{"poster":"oroora6","date":"2017-07-25T02:27:17.549+0000","title":"Un oggetto che sta segnando il meta","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Salve gentaglia, volevo un secondo concentrare la vostra attenzione su un oggetto che ultimamente sta segnando da solo l&#039;intero meta della jungle\r\nparlo dunque della {{item:3193}} , un oggetto completamente op che la riot sta tendenzialmente ignorando.\r\nSe andiamo a controllare i winrate pi&ugrave; alti nella jungle possiamo osservare:\r\nCho&#039;gath{{champion:31}} :\r\nhttp://champion.gg/champion/Chogath/Jungle?league=silver ({{item:3193}} )\r\n\r\nMaokai{{champion:57}} :\r\nhttp://champion.gg/champion/Maokai/Jungle?league=silver ({{item:3193}})\r\n\r\nJarvan{{champion:59}} :\r\nhttp://champion.gg/champion/JarvanIV/Jungle?league=silver ({{item:3193}})\r\n\r\nAmumu{{item:3070}} :\r\nhttp://champion.gg/champion/Amumu/Jungle?league=silver ({{item:3193}})\r\n\r\nSkarner{{champion:72}} :\r\nhttp://champion.gg/champion/Skarner/Jungle?league=silver ({{item:3193}})\r\n\r\nRammus{{champion:33}} :\r\nhttp://champion.gg/champion/Rammus/Jungle?league=silver ({{item:3193}})\r\n\r\nSembra che questo oggetto potenzi un po troppo i tank da jungle, portandoli dal 53% al 58% di winrate, che sono numeri eccezionali\r\nCosa ne pensate, credete che nerferanno l&#039;oggetto riportando il meta i campioni con un forte 1 vs 1({{champion:19}} , {{champion:121}} , {{champion:11}} ) ed i support da jungle ({{champion:20}}) o questo oggetto rimarr&agrave; ancora a lungo sulle vette degli item pi&ugrave; op? la riot non ha mostrato molto interesse su questo oggetto fino ad ora\r\n1. Inoltre credete forse ci siano altri campioni su cui un oggetto simile possa darer grande forza? SI potrebbe forse trasportare su campioni come {{champion:164}} , {{champion:114}}  e {{champion:39}} che hanno un alto impatto di danni puri oppure sui campioni support pi&ugrave; resistenti?\r\n\r\nDitemi la vostra opinione, sono molto interessato a conoscere il meta in arrivo","replies":[{"poster":"vondarck","date":"2017-07-25T06:03:00.027+0000","up_votes":4,"down_votes":0,"body":"Sono l'unico che quando ha cliccato sul topic era certo che si parlasse della crepuscolare/youmummus e mi sono ritrovato un wain post sulla stoneplate? :I","replies":[]},{"poster":"HaIIeIujah","date":"2017-07-25T02:59:59.252+0000","up_votes":4,"down_votes":0,"body":"Usare le stats in silver rende l'intera discussione inaffidabile.\n\nJarvan, Skarner, e Amumu lo droppano completamente in Plat+, e l'unico winrate fuori media a quell'elo che usa il Gargoyle è Maokai (che secondo meddler dovrebbe ricevere nerf a breve.)\n\nL'interazione con Cho è un caso a parte ed è talmente unica che non ha alcun parellelo in come funziona per gli altri tank.","replies":[{"poster":"oroora6","date":"2017-07-25T03:14:41.644+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ł Tera ł,realm=EUW,application-id=MJVj50Jw,discussion-id=jLs4AEkQ,comment-id=0000,timestamp=2017-07-25T02:59:59.252+0000)\n>\n> Usare le stats in silver rende l&#x27;intera discussione inaffidabile.\n> \n> Jarvan, Skarner, e Amumu lo droppano completamente in Plat+, e l&#x27;unico winrate fuori media a quell&#x27;elo che usa il Gargoyle è Maokai (che secondo meddler dovrebbe ricevere nerf a breve.)\n> \n> L&#x27;interazione con Cho è un caso a parte ed è talmente unica che non ha alcun parellelo in come funziona per gli altri tank.\n\nOh si, ho preso le statistiche silver perchè quelle più complete, dato che la playerbase è più concentrata in quel punto, ma puoi notare gli stessi risultati in tutte le altre leghe! Poi in plat o superiore ci sono più onetrick e un numero molto più basso di giocatori, lì le statistiche sono più affidabili se ricercate sui giocatori stessi","replies":[{"poster":"HaIIeIujah","date":"2017-07-25T03:17:54.605+0000","up_votes":1,"down_votes":0,"body":"Assolutamente no. Muovi l'affare in plat+ e Jarvan e Skarner passano ad una build AD/Bruisr, Amumu lo perde in favore di Abysall+Thorn e Rammus si abbassa ad un più gestibile, ma perfettamnete giustificato per l'abbondanza di Draktarr, 53% winrate.\n\nBuild e campioni giocati in Silver sono pià un discorso di accessibilità che di potenza pura.","replies":[{"poster":"oroora6","date":"2017-07-25T13:45:05.391+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ł Tera ł,realm=EUW,application-id=MJVj50Jw,discussion-id=jLs4AEkQ,comment-id=000000000000,timestamp=2017-07-25T03:17:54.605+0000)\n>\n> Assolutamente no. Muovi l&#x27;affare in plat+ e Jarvan e Skarner passano ad una build AD/Bruisr, Amumu lo perde in favore di Abysall+Thorn e Rammus si abbassa ad un più gestibile, ma perfettamnete giustificato per l&#x27;abbondanza di Draktarr, 53% winrate.\n> \n> Build e campioni giocati in Silver sono pià un discorso di accessibilità che di potenza pura.\n\nIo seguo gli insegnamenti del buon vecchio Dopa/Apdo, che ha sempre detto che i migliori a trovare build sono sempre quelli in silver ed in gold e che le build che diventano famose in challenger sono sempre prese da persone incontrate da questi ultimi in quell elo, per cui a parere mio le statistiche gold e silver sono molto più affidabili (ed io è così che ho ottenuto il mio winrate su warwwick, se controlli non uso la build classica)\nFonte: https://www.youtube.com/watch?v=LPExhkl6CwU","replies":[{"poster":"HaIIeIujah","date":"2017-07-25T19:17:53.236+0000","up_votes":1,"down_votes":0,"body":"Quello che significa è che i Gold/Bronze/Silver esperimentano di pioù(perché possono permetterselo) e poi quelle migliori vengono prese e portate in Challenger, non che la build di maggioranza in silver è quella giusta.\n\nUn milione di scimmie con una macchina da scrivere e due ispettori per scegliere le opere corrette.","replies":[]}]}]}]},{"poster":"vondarck","date":"2017-07-25T14:15:20.648+0000","up_votes":1,"down_votes":0,"body":"Basterebbe \"nerfare\" la ulti aggiungendo una stringa\n\nSalute bonus (ma non da item attivabili)","replies":[]}]},{"poster":"RGM Player","date":"2017-07-25T09:08:59.678+0000","up_votes":2,"down_votes":0,"body":"Il meta sarà distrutto da un unico oggetto {{item:3056}}","replies":[]},{"poster":"ImSmurfnHolyPogz","date":"2017-07-25T04:58:50.192+0000","up_votes":1,"down_votes":0,"body":"Ma scusate, cosi come vengono continuamente nerfati campioni (vedi: Yasuo,malzahar, vladimir) perché la playerbase bronzo-silver non è in grado di fronteggiarli cosi com'è mentre in high elo pure una scarpa ha un win rate piu alto, allora perché un oggetto come la stoneplate che in low elo sta facendo danni non dovrebbe essere nerfato?","replies":[{"poster":"HaIIeIujah","date":"2017-07-25T05:13:47.364+0000","up_votes":2,"down_votes":0,"body":"Vlad e Malzahar sono stati nerfati perché _stompavano_ ad alto livello. Support Malz ha tenuto fuori i melee dal meta per qualcosa come tre patch prima che fosse ucciso.\n\nE quanto alla tua domanda: gli item non sono campioni. I lGargoyle non è magicamente più forte in silver perché la gente non sa schivare lo stun lanciato dal Gargoyle. Il Gargoyle è _più usato_ in silver perché è un i'tem che fa scena e con la narrativa di \"coso nuovo broken\" dietro.\n\nCho/Mao sono chiaramente fuori scala e stanno vendo ridotti per quello. L'item in sé non ha nulla di impressionante oltre gli specifici abuser.","replies":[]}]},{"poster":"Darkinknight","date":"2017-07-25T14:06:50.495+0000","up_votes":1,"down_votes":0,"body":"Ah,pensavo fosse {{item:3147}} ..ormai mancano solo i support Ap a buildarlo","replies":[{"poster":"oroora6","date":"2017-07-25T14:19:16.463+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hellknight1994,realm=EUW,application-id=MJVj50Jw,discussion-id=jLs4AEkQ,comment-id=0005,timestamp=2017-07-25T14:06:50.495+0000)\n>\n> Ah,pensavo fosse {{item:3147}} ..ormai mancano solo i support Ap a buildarlo\n\neh ma quella la prossima patch muore tragicamente","replies":[{"poster":"Darkinknight","date":"2017-07-25T14:27:57.424+0000","up_votes":1,"down_votes":0,"body":"Non mi ricordo di preciso il cambiamento,ma mi sembrava un nerfino nulla di che","replies":[]}]}]},{"poster":"Dodop","date":"2017-07-25T06:43:25.619+0000","up_votes":1,"down_votes":0,"body":"Secondo me la Gargoyle Stoneplate non ha bisogno di un nerf. È un item bilanciato fin dal suo rilascio, nonostante i rumors che gridavano all'esageratamente broken prima della mid season (compreso il nostro caro Terenas, mi ricordo il suo video).\nQuindi non è l'oggetto a essere OP, ma i 3 tank jungler che fanno da padroni in giungla al momento che lo usano (parlo ovviamente di Cho'Gath, Maokai e Zac), ma dato che Zac e Cho'Gath verranno nerfati pesantemente nella patch di domani e Maokai se non verrà nerfato nella prossima, verrà bilanciato molto probabilmente nella 7.16, questo tank meta della giungla avrà vita molto breve e lascerà probabilmente il posto a qualche assassin e fighter (ovviamente sì, alcuni tank jungler come Sejuani rimarranno ancora forti, più o meno come la situazione attuale di Kha'Zix).\nGli altri jungler tank che hai citato non è nessuno al top tier al momento, poiché il loro alto win rate è giustificato da un pick rate molto basso (Amumu, Skarner, Rammus).\n\nUn altro motivo per cui la Gargoyle non ha a mio parere bisogno di un nerf è per il tank meta quasi inesistente della toplane: gli unici due tank in top al momento decenti sono proprio gli stessi della jungle, Maokai e Cho'Gath. L'oggetto in questione viene buildato da pochi altri toplaner in meta (Jarvan e Kled ad esempio).\n\nInoltre secondo me non è worth buildare la Gargoyle su Irelia, Fiora e Camille, i danni puri rimangono comunque una minima parte rispetto all'Attack Damage, quindi è meglio buildare un oggetto AD in più o una GA.","replies":[]}]}