{"poster":"oroora6","date":"2016-10-31T01:03:24.122+0000","title":"Dove andare quando si gioca con dei premade?","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Premade, cari buon vecchi premade, ne avete mai incontrati 4? Quasi sicuramente la risposta &egrave; si, ma per vostra ~~s~~fortuna oggi ho dei consigli da darvi, chiamatemi pure &quot;vostro eroe&quot;, c&#039;&egrave; ne per tutti\n\ncavolate a parte\n\nOra che i gruppi sono nuovamente attivi e possiamo vedere quando questi mostri immondi decidono di torturare una singola persona grazie al tag vicino al nome, potete prepararvi mentalmente alla tragedia, ma non solo, ci sono delle piccole manovre fattibili per evitare l inevitabile\n**NON ANDATE ADC**\n\nsapete cosa &egrave; peggio di avere 4 premade nella squadra? doverci stare assieme.\nUmanamente se si ha la possibilit&agrave; do parlare con uno e di non parlare con l altro si star&agrave; con chi si pu&ograve; parlare, guardando con occhio storto la persona che non conosci, perch&egrave; appunto &quot;quello &egrave; un nabbo&quot;, complimenti per averlo giudicato subito, MOSTRO\nquesto dunque ci porta ad un problema di base, se il tuo support non ti vuole supportare, hai finito di vivere. Esattamente, anche i support sono umani ed anche loro decideranno di non stare con voi se possibile, e chi ha mai giocato ADC sa che se un tiratore &egrave; da solo, non &egrave; che un ammasso di pixel morti, sempre che tu non usi vayne, in tal caso PENTAKILL, ma questo &egrave; un altro caso\nper cui escludiamo subito l adc dalle possibili scelte, anzi, categorizziamola come la peggiore\nDallo stesso ragionamento si ottiene il support, devi supportare un adc che non vuole giocare con te, e tu non avrai i mezzi per vincere la lane da solo, anche se comunque portai fare di pi&ugrave; che un adc da solo, dato che hai la possibilit&agrave; di fuggire o nel caso tu sia blitzcrank, grabbare a morte i nemici\nEd ecco che il support va al secondo posto\nDunque una scelta migliore potrebbe essere la toplane, se i premade sono cos&igrave; tragici, allora andiamo nell unica lane dove non li vedrai mai, ecco questo potrebbe essere un ragionamento giusto, ma non troppo\nMettendo caso che tu riesci a prenderti la toplane e a vincerla, non hai speranza in quella partita, perch&egrave; sarai in un 2 contro 1\nNon sei l unico a poter vedere i tag ed i jungler sono esseri astuti che calcolano qualsiasi minima variabile nella loro caccia alla preda, ed indovina un po&#039; la preda pi&ugrave; facile in questo caso, tu\nUn jungler che ti vede vincere la toplane mentre hai 4 premade in squadra &egrave; un jungler felice, ha una lunghissima zona di battaglia dove poter gankare con facilit&agrave; e non avere problemi in caso di gank, perch&egrave; non solo prender&agrave; una kill facile e ti far&agrave; perdere la lane, ma ti lascer&agrave; anche solo, i premade gankano solo le proprie lane\ned abbiamo un terzo posto per il toplaner\nandiamo nella lane che ci rimane, midlane, la terra dei maghi e degli assassini, ecco questa &egrave; un ottima scelta, una lane pi&ugrave; corta, un alto raggio in caso tu sia mage o un ottimo escape in caso tu sia assasin, nessuno che ti viene a gankare se te la giochi bene e nessun contatto in early con i premade, sembrerebbe un ottima scelta, se non per due fattori, il primo e pi&ugrave; ovvio &egrave; che dopo l early, in quanto mage o assasin avrai bisogno del team per poter fare qualcosa, dato che un po&#039; di mobilit&agrave; o tankosit&agrave; nel nemico ti sbaraglier&agrave; come pochi ed il secondo, l impossibilit&agrave; di prendere mid, esatto dobbiamo anche contare questo, la midlane &egrave; la lane pi&ugrave; amata e scelta dagli yasuo di tutte le et&agrave;, e anche se sarai il primo a prenderla, non vuol dire che un inutile scarto non instalocki, in fondo sono sempre premade, per cui mettiamo la midlane in secondo posto in quanto a scelta anche se ardua da prendere\n\ned infine, voi gi&agrave; sapete la scelta mancante, il jungler\ndovrai stare solo nella tua bella jungla, con rospi amorosi e uccelli radioattivi mutati che non vogliono che abbracciarti in gruppo, e poi volete mettere quanto &egrave; simpatico giorgio? Doveva fare il comico quel granchietto\nNessuno vi costringer&agrave; a gankare, vi daranno solo la colpa della loro scarsit&agrave;, sarete sempre pi&ugrave; forti delle persone nelle lane grazie alla vosta indole da jungler e potrete farmare in pace ed armonia con il mondo attorno a voi, mutate tutti e preparatevi ad ore ed ore di farm con Master yi o shyvana, gankare con dei premade &egrave; inutile, non sano premere il tasto destro\n\nper cui in cima al podio, tra lacrime e sofferenza di un povero main adc abbiamo il jungler\nricordatevelo la prossima volta che incontrerete 4 nomi gialli dalla stessa forma\ne se non riuscite a prendere la jungle, scappate, finch&egrave; ne siete in tempo, 5 minuti valgono la vostra felicit&agrave;","replies":[{"poster":"SUPERALEX88","date":"2016-10-31T14:20:25.786+0000","up_votes":2,"down_votes":0,"body":"per fortuna dalla prossima stagione le premade rovinapartite saranno solo un lontano ricordo","replies":[]},{"poster":"DANJERpuntoEXE","date":"2016-10-31T07:30:25.759+0000","up_votes":2,"down_votes":0,"body":"Non so che premade conosciate voi, ma io gioco per vincere oltre che per divertirmi...tendenzialmente il mio premade si lamenta con me perché lo ganko poco, perché provo ad aiutare tutti...","replies":[]},{"poster":"Orco Pippo","date":"2016-10-31T09:50:12.720+0000","up_votes":1,"down_votes":0,"body":"Io non capisco che problemi abbiate con chi gioca in 3-4.. Io e alcuni amici lo facciamo spesso, generalmente restano libere la top o la giungla perché a nessuno di noi piace farle, ma non è che abbandoniamo uno del team al suo destino, anzi se lo riteniamo scarso tendenzialmente roammiamo nella sua lane per aiutarlo o fargli prendere kill e dargli un vantaggio... Al jungler chiediamo solitamente un pick utile per ingaggiare, così saremo noi a dover seguire ed evitiamo problemi di comunicazione.. Se un amumu si butta tra 5 persone e tira l'ulti è facile capire che vuole ingaggiare..\nSecondo me sbagli a fare \"afkfarm\" come jungler, alla fine hai comunque bisogno di aiuto e non potrai fare 1v5, o sarà almeno complicato... Al limite guarda l'andamento della partita e campa una lane, così fai almeno 2v5...\nIl support invece è il ruolo che gioco più spesso, anche se con pick discutibili. In genere la bot è premade, ma quando capita che non lo sia tendo a prendere support \"veri\", come blitz, thresh o nami, o comunque dei champ con cui sia facile far capire all'altro quando ingaggiare.. Se vedo che non mi segue, gioco passivo e lo proteggo dagli ingaggi degli avversari o aspetto il jungler fino a quando abbandoniamo la lane e non trovo qualcuno che si faccia supportare meglio..\nDa ADC non gioco mai quindi non mi esprimo.\nCome mid il lavoro mi sembra abbastanza semplice, se sei assassino assassini qualcuno fuori posizione e poi forzi l'ingaggio, calcolando che anche i premade giocano per vincere capiranno che un4v5 è un buon momento per un fight. Se non ti seguono diverse volte dovrai seguire tu loro, sempre buttandoti sui damage dealer.\nDa mago invece tendo a giocare champ con cc pesanti come annie, quindi basta trovare il momento giusto e buttare un tibbers nel team nemico, di solito i premade sono attirati dall'orso nel fight e combattono.\nCome toplane se so per certo che non riceverò gank e dovrò firmare sotto torre lo faccio, prendendo magari qualcosa con cui difficilmente verrò preso sotto torre o che abbia o resistenze o modi facili di ingaggiare (mundo, lissandra, wukong) o, se non puoi essere conuterpickato, nasus, e appena arrivi ad avere un numero di stack accettabile veramente puoi carriare.\n\nIn generale penso che per giocare con dei gruppi si debba uscire dall'idea \"carrio io\" ed entrare più in quella \"vinciamo come squadra\"...\nÈ poi non necessariamente i 4 premade sono senza mani dai","replies":[{"poster":"oroora6","date":"2016-10-31T19:27:38.230+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BananaMao,realm=EUW,application-id=MJVj50Jw,discussion-id=jy0URK71,comment-id=0003,timestamp=2016-10-31T09:50:12.720+0000)\n>\n> Io non capisco che problemi abbiate con chi gioca in 3-4.. Io e alcuni amici lo facciamo spesso, generalmente restano libere la top o la giungla perché a nessuno di noi piace farle, ma non è che abbandoniamo uno del team al suo destino, anzi se lo riteniamo scarso tendenzialmente roammiamo nella sua lane per aiutarlo o fargli prendere kill e dargli un vantaggio... Al jungler chiediamo solitamente un pick utile per ingaggiare, così saremo noi a dover seguire ed evitiamo problemi di comunicazione.. Se un amumu si butta tra 5 persone e tira l&#x27;ulti è facile capire che vuole ingaggiare..\n> Secondo me sbagli a fare &quot;afkfarm&quot; come jungler, alla fine hai comunque bisogno di aiuto e non potrai fare 1v5, o sarà almeno complicato... Al limite guarda l&#x27;andamento della partita e campa una lane, così fai almeno 2v5...\n> Il support invece è il ruolo che gioco più spesso, anche se con pick discutibili. In genere la bot è premade, ma quando capita che non lo sia tendo a prendere support &quot;veri&quot;, come blitz, thresh o nami, o comunque dei champ con cui sia facile far capire all&#x27;altro quando ingaggiare.. Se vedo che non mi segue, gioco passivo e lo proteggo dagli ingaggi degli avversari o aspetto il jungler fino a quando abbandoniamo la lane e non trovo qualcuno che si faccia supportare meglio..\n> Da ADC non gioco mai quindi non mi esprimo.\n> Come mid il lavoro mi sembra abbastanza semplice, se sei assassino assassini qualcuno fuori posizione e poi forzi l&#x27;ingaggio, calcolando che anche i premade giocano per vincere capiranno che un4v5 è un buon momento per un fight. Se non ti seguono diverse volte dovrai seguire tu loro, sempre buttandoti sui damage dealer.\n> Da mago invece tendo a giocare champ con cc pesanti come annie, quindi basta trovare il momento giusto e buttare un tibbers nel team nemico, di solito i premade sono attirati dall&#x27;orso nel fight e combattono.\n> Come toplane se so per certo che non riceverò gank e dovrò firmare sotto torre lo faccio, prendendo magari qualcosa con cui difficilmente verrò preso sotto torre o che abbia o resistenze o modi facili di ingaggiare (mundo, lissandra, wukong) o, se non puoi essere conuterpickato, nasus, e appena arrivi ad avere un numero di stack accettabile veramente puoi carriare.\n> \n> In generale penso che per giocare con dei gruppi si debba uscire dall&#x27;idea &quot;carrio io&quot; ed entrare più in quella &quot;vinciamo come squadra&quot;...\n> È poi non necessariamente i 4 premade sono senza mani dai\n\nPremetto che da main jungler l'afk farm non lo faccio mai, uso hecarim rammus e akali, che sono quasi completamente incentrati sui gank (ho fatto un 31/1 con hecarim prima sono felice :D) però al mio elo i premade spesso se così tanti sono gente media che va a giocare con gli amici nabbi, per cui in team ti ritroverai un celebroleso che gira in tondo cercando di mordersi le orecchie, per cui personalmente se trovo i premade tendo a sapere già che sarò messo da parte e dovrò carryare","replies":[]}]},{"poster":"fedy99","date":"2016-10-31T08:30:16.566+0000","up_votes":1,"down_votes":0,"body":"Afk","replies":[]},{"poster":"Kazushi San","date":"2016-10-31T08:13:41.430+0000","up_votes":1,"down_votes":0,"body":"top, la lane dei sociopatici","replies":[]}]}