{"poster":"Waysted1","date":"2017-03-06T10:07:21.299+0000","title":"pings spikes and a song of deception and half lies","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"I get massive ping spikes in game during the day, I followed the advice and downloaded the hextech repair tool to see if there was a reason on my end why. I did the ping check which said my ping was 34, which in its self is untrue because on the top right of my in game screen it says (when I&#039;m not spiking to 2000) that my ping is 63.  Late at night and early morning i get no spikes at all. So i can only assume now its the traffic over load on the riot server that causes it. I am in OCE which is the smallest server and it seems that even with the lowest population, it cant handle the traffic flow. I must admit that in my darker moments i think that its a hack like the disconnect hack of days gone by. Riot, your video &quot;A song of lag and packet loss&quot; (while its not untrue what you say) is still misleading about why ping spikes happen. Please fix your server","replies":[{"poster":"CHEESYLEEKS","date":"2017-03-08T21:24:38.809+0000","up_votes":1,"down_votes":0,"body":"I was getting massive ping spikes due to malware.\n\nYou might wanna try and run an antivirus program and clean your pc.","replies":[]},{"poster":"Waysted1","date":"2017-03-06T11:55:04.695+0000","up_votes":1,"down_votes":0,"body":"I live in New Zealand with fibre optic","replies":[]},{"poster":"Nightjar","date":"2017-03-06T11:52:53.150+0000","up_votes":1,"down_votes":0,"body":"It's not so much riot's fault (though they could always improve their infrastructure), it's more to do with australian 'copper nbn' not being able to handle the cyber traffic of the the Australian net population. A few years ago, to cut costs they decided to replace the old copper network with fancy new fibre, however due to political disputes and cost cutting, this plan was scrapped for replacing the at the time 'copper' network, with a much better, 'copper' network. Much of the infrastructure remains unchanged and as you can imagine, this new network worked quite well whilst the population that had upgraded was small and the plan was a political success. However as the number of nbn users has increased, we encounter the old problem of copper networks being unable to handle large loads of packets.\n\nThe improvement was minimal and now that more people are upgrading to nbn, it can't cope. Hence why your ping may have gotten worse recently in some areas as of late and why your ping can vary greatly depending on how much nearby houses are streaming.","replies":[]}]}