{"poster":"Illidanisdead","date":"2017-09-26T05:57:41.211+0000","title":"Auto locking lanes on normals","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"I was wondering if some one from riot could answer me this, I have reported some one who auto locked their lane without calling it on a normal game, initially the team agreed with the report however I did pretty badly in the game and the guy reported me as well. My question is how do you deal with people who are instalocking and these false reports especially when I was the sportsman by playing the final role, why should I get reported for having a bad game?","replies":[{"poster":"oNIELy","date":"2017-09-26T07:00:01.595+0000","up_votes":2,"down_votes":0,"body":"I don't think riot gives penalty to instalocking... i don't like it either tho.\nbecause there's no rule about it.\nIn korea, usually we don't call positions, just lockin your champs, and that's your position.","replies":[{"poster":"Illidanisdead","date":"2017-09-26T07:56:33.142+0000","up_votes":1,"down_votes":0,"body":"That's silly though, plus let's say you have a bad game and at the end, what if your team reports you, even though your team won, since the person who auto locked just happen to win lane and carry game? He was gold and I m just level 30, but that doesn't mean he should be able to lock his position just cause he probably is better than me at league. I just don't think its fair that people get away with this.","replies":[{"poster":"oNIELy","date":"2017-09-26T09:27:23.387+0000","up_votes":1,"down_votes":0,"body":"i understand deeply but, the report will not ban or punish you because you were just bad, not a serious TROLL.\nSo don't worry about it, if you didn't say any bad words.\nRather you should report them, to bad behavior, negative attitude... things like that.\nit's just a normal game so.. i really don't care tho, i understand.\nI don't get why oce server just keep blind pick, not the draft one.","replies":[]},{"poster":"Easley","date":"2017-09-26T09:12:30.067+0000","up_votes":1,"down_votes":0,"body":"role distribution isn't enforced in blind pick. instalocking is rude but it doesn't break any rules because riot doesn't care if you do wacky stuff like double mid or double jungle in a normal game, and they don't have any mechanism in place to ensure fair distribution","replies":[]}]}]},{"poster":"Project Xayah","date":"2017-09-26T12:40:14.970+0000","up_votes":1,"down_votes":0,"body":"It's my understanding that situations that aren't explicitly against the rules that have significant potential to cause a negative experience for a significant number of players can be acted upon *conditionally*. If a person were to be reported consistently enough for a particular negative behaviour, for example dozens/hundreds of reports over the span of, say, a month, there's real potential for Riot to act upon it and dish out a punishment. The reason for that is that the community is effectively telling Riot that the player is creating a negative experience in-game, and because it's affecting so many players it becomes a significant issue.\n\nA good example of a situation where a player *has* been banned, not because of their chosen strategy, but because of how it created a negative experience for other players, is the Support Singed case that appeared several months ago (around 10 months now, if I'm not mistaken). For reference, here's a link to a post Wuks made that particular scenario, which I think accurately addresses some of the nuances of what is and isn't punishable (and is somewhat relevant to your concerns): https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/79aGu3wR-support-singed-isnt-banable-but-thats-not-the-point\n\nAs for false reports, I'm a little unclear on the specifics of how report weight is determined (it's either on an overall basis for any given player, or on a case-by-case basis for each individual report) but the point with that is that any report determined to be false will be ignored. You could probably get reported a thousand times as a result of bad games and chances are you wouldn't see a punishment (*if anything*, your MMR would probably get adjusted to put you in with players of a closer average skill level). There would need to be a good reason for Riot to act on a report, and a person having some bad games simply doesn't cut it (after all, we all have bad games every now and then).","replies":[]},{"poster":"Fitzky","date":"2017-09-26T12:03:54.782+0000","up_votes":1,"down_votes":0,"body":"Here is your solution: https://boards.oce.leagueoflegends.com/en/c/announcements/WEAy3U0l-normal-draft-test-coming-to-oceania","replies":[]},{"poster":"About 9 Kenyans","date":"2017-09-26T11:02:49.014+0000","up_votes":1,"down_votes":0,"body":"simple answer, not against rules, its a game for fun and maybe he only enjoys one lane, should he lose his fun because someone believes in whoever has the fastest pc gets first pick?","replies":[]}]}