{"poster":"KillgoreZ","date":"2017-12-18T06:57:13.598+0000","title":"Algún consejo o motivación para rankear?","subforum":"Reclutamiento","up_votes":3,"down_votes":1,"body":"Bueno, necesito ayuda, tengo 8/10 rankeds jugadas y aproximadamente gane solo una, necesito motivaci&oacute;n o algo porque tengo miedo a seguir rankeando y quedar en bronce V porque dicen que es muy dif&iacute;cil salir de ah&iacute;, de ser posible un duo que este en bronce bajo, no flamee y tenga conocimientos ``normales&acute;&acute; del juego como yo para avanzar juego jg y top {{champion:421}} {{champion:58}}\r\nGracias por leer y por la ayuda {{summoner:4}} \r\nPD: tambi&eacute;n juego muchas normales","replies":[{"poster":"AIister","date":"2017-12-18T08:42:04.758+0000","up_votes":3,"down_votes":0,"body":"Mirá, todos fuimos malos cuando empezamos. Vos tenes que entender que el sistema te va a poner donde merezcas estar. Es decir que si quedas en BV es porque el sistema considera que tu habilidad está a ese nivel. También tenes que entender que si queres mejorar o si queres ser un buen jugador, vas a tener que pasar por ser un jugador malo. Mi consejo es que juegues ranked sin darle importancia al resultado de la partida. Lo que tenes que tratar de hacer es analizar que podrias haber hecho mejor en la partida (incluso cuando ganes, porque siempre se puede mejorar), y tratar de aprender de cada partida. Si empezas a hacer esto, vas a ver que subis de liga en nada. Suerte :)\n\n------------------edit------------\nCuando entres a una partida usa el comando: \"/mute all\" el cual mutea a todos los jugadores de la partida, asi te concentras en tu juego sin el miedo a que te flameen.\n\nSalir de bronze 5 es facil, creeme. Yo estuve ahi la season pasada, estuve en lo peor de lo peor, bronze 5 con -3lp. Ni bien empezé a seguir lo que te aconsejé, salí al toque.","replies":[]},{"poster":"PG kandy","date":"2017-12-26T02:56:15.919+0000","up_votes":2,"down_votes":0,"body":"Mi la cosa es facil \nPara ser mejor mecanicamente tenes que saber todo de los campeones que usas, tu pool champ( campeones que mas uses) para esto podes ver guias e por you tube y buscar builds en reedit o mobafire\nAhora si la cosa es un problema de motivacion pero queres seguir jugando, es facil. Mira montajes de campeones que te guste ver o usar al jugar, yo hago eso y en 5 o 10m me pongo a jugar como si nada. poner musica tambien ayuda pero no muy fuerte ya que el volumen alto te distrae de cierta forma de lo mas importante que es jugar. \nEspero que te haya servido nv kappa {{{sticker:katarina-love}}","replies":[{"poster":"KillgoreZ","date":"2017-12-26T09:32:22.500+0000","up_votes":1,"down_votes":0,"body":"Gracias Makinola +10","replies":[]}]},{"poster":"KillgoreZ","date":"2017-12-21T09:08:09.643+0000","up_votes":1,"down_votes":0,"body":"Gracias por las ayudas, al final terminé en plata v :p , creo que no hacer las 10 ni bien llegué a lvl 30 sirvió, es que ya me sonaba estúpido hacerlas así {{champion:105}}","replies":[]},{"poster":"Americans","date":"2017-12-18T14:01:49.758+0000","up_votes":1,"down_votes":0,"body":"No tiene nada de malo quedar bronce 5, si jugas bien a la larga vas a salir. No es para nada dificil subir de bronce.","replies":[]},{"poster":"Elfízz Presley","date":"2017-12-18T13:52:14.678+0000","up_votes":1,"down_votes":0,"body":"si quieres mejorar tienes que seguir jugando y con esto me refiero a seguir jugando rankeds, hoy en día las normals no ofrecen aprendizaje si no son de premades por eso te recomiendo que sigas jugando bro, de bronce es fácil salir si realmente juegas bien, sigue jugando y tryhardeando pero siempre con la mentalidad de mejorar. Te recomiendo mirar streams o partidas de profesionales con tus campeones eso enseña demasiado cuidate y suerte amigo","replies":[]},{"poster":"Esguein","date":"2017-12-18T10:24:21.165+0000","up_votes":1,"down_votes":0,"body":"Piensa en que vienen los extraterrestres a invadir y que si no ganas rip Tierra","replies":[]},{"poster":"ParedSinRevoque","date":"2017-12-18T09:15:51.139+0000","up_votes":1,"down_votes":0,"body":"Si tu necesitar ayuda, tu poder agregarme. Hasta oro yo poder ayudarte tranquilamente.\n\nP.D.: dije ayuda no carrito\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"FSS CreeD","date":"2017-12-18T08:38:09.386+0000","up_votes":1,"down_votes":0,"body":"agregame","replies":[]},{"poster":"KillgoreZ","date":"2017-12-18T06:58:19.819+0000","up_votes":1,"down_votes":0,"body":"Me acabo de dar cuenta de que me falto una coma antes del juego jg y top :,p{{champion:105}}","replies":[]}]}