{"poster":"qonero","date":"2017-06-19T18:54:45.237+0000","title":"im banned from the game","subforum":"Player Behavior","up_votes":1,"down_votes":11,"body":"dear riot\r\nim really sorry that i was toxic in games but what i dont understand is how i get perma banned for it.\r\ni understand that im toxic and that i may be mean to people but i have my reasons.\r\nAlso i wouldnt have been toxic if my team didnt ping me and blame me for dying.\r\nI really want to keep this account and i liked this account  a lot. I want to keep playing this game on this account but im banned so i cant. Is there any way i can get this account unbanned. I will do anything.\r\n If im reported for one single toxicity i will understand why i will get perma banned plz give me a second chance.","replies":[{"poster":"Geauxx","date":"2017-06-19T19:56:27.314+0000","up_votes":5,"down_votes":0,"body":"They already gave you a second chance, it's called getting off the 14 day ban, you didn't fix yourself and got hammered.\n\nAnd don't try to say you never had any other punishment, because the only time they insta-ban is if you're caught cheating using scripts or so... and then you don't deserve a second chance either.","replies":[]},{"poster":" Döpey Döbby","date":"2017-06-19T22:22:36.814+0000","up_votes":1,"down_votes":4,"body":"Pretty sure everyone's been toxic a couple of times so don't go around with that \"You get what you deserve\" crap","replies":[{"poster":"Jo0o","date":"2017-06-19T22:28:44.971+0000","up_votes":3,"down_votes":0,"body":"I've never so much as had a chat restriction, and I'm no saint. \n\nOP either has had multiple punishments building up to a perma, or did or said something so incredibly removed from acceptable behavior that he had to be removed. Either way, hard to feel sorry for him.","replies":[]}]},{"poster":"ME UNGA ME SMASH","date":"2017-06-19T18:56:28.947+0000","up_votes":2,"down_votes":0,"body":"if you're perma'd it's done my guy. The account is gone for good. Support ticket it, that's the best you can do. I doubt you'll get it unbanned. If you have a history of punishments and behavior reports, you've earned it, I'm sorry to say.","replies":[{"poster":"qonero","date":"2017-06-19T18:57:03.136+0000","up_votes":1,"down_votes":0,"body":"what do u mean support ticket it?","replies":[{"poster":"ME UNGA ME SMASH","date":"2017-06-19T18:59:45.140+0000","up_votes":1,"down_votes":0,"body":"Go to the support website and send in a support ticket. How have you been playing the game long enough to get banned and you don't know what player support is?","replies":[]}]}]},{"poster":"General Esdeath ","date":"2017-06-21T00:25:40.415+0000","up_votes":1,"down_votes":0,"body":"You already had a second chance fam, learn from this.","replies":[]},{"poster":"gIKSvtuLV5","date":"2017-06-20T04:46:25.435+0000","up_votes":1,"down_votes":0,"body":"I am banned too. \n\nI'm still going through my 5 stages of grief.\n\nit's been just about a year now. I regret every decision my past self made.","replies":[]},{"poster":"HalcyonDweller","date":"2017-06-20T00:05:10.311+0000","up_votes":1,"down_votes":0,"body":"Better luck with your next account. Learn from your mistakes and do not be so toxic again.\n\nIf teammates are upsetting you by blaming you, just mute them.","replies":[]},{"poster":"Ciaoe","date":"2017-06-19T22:02:50.289+0000","up_votes":1,"down_votes":0,"body":"you get what you deserve","replies":[]},{"poster":"Okuma","date":"2017-06-19T18:57:24.132+0000","up_votes":1,"down_votes":0,"body":"A second chance is not going to happen, but feel free to create another account.","replies":[]}]}