{"poster":"tempname952","date":"2015-03-11T03:18:04.168+0000","title":"How do you prove to your teammates that you're the best option to call shots?","subforum":"Tips & Tricks","up_votes":1,"down_votes":0,"body":"I assumed that simply having played well during laning and mid game that my team would follow my calls. I thought that having a nice big round positive score would show to them that I know what I'm doing. Apparently they'd rather listen to the 5-5 kalista instead, which immediately cost us the game(no exaggeration, kalista's play got us aced and the enemy pushed for the win). What else can I do to make my team listen to me?","replies":[{"poster":"Phreak","date":"2015-03-11T10:44:43.351+0000","up_votes":7,"down_votes":0,"body":"I don't really think you can. It's really hard to get random strangers to listen to each other.\n\nThe best way I've found is to simply do straightforward calls via smart ping. Essentially, they'll see the direction on the map and decide on their own \"is this a good idea?\" Assuming all your ideas are good, they'll just follow it because it makes sense to them. Like when you get a gank bot lane, and you ping the turret, people will typically go, \"huh, yeah, I guess we can kill that\" and just kill it with you.","replies":[]},{"poster":"Mathbalnase","date":"2015-03-11T05:22:02.636+0000","up_votes":3,"down_votes":0,"body":"Step 1: don't be an ass\nStep 2: your first call(s) in yoloQ should be relatively simple and of obvious benefit to your allies (even if that means you bear the brunt of the expense)\nStep 3: don't be wrong\nStep 4: ?\nStep 5: Challenger","replies":[]},{"poster":"GaleWinUnleashed","date":"2015-03-11T16:50:01.880+0000","up_votes":2,"down_votes":0,"body":"Offer strategies and predictions about what the enemy is about to do, but don't try to push your advice down people's throats. If they see that you're consistently correct about what's going on, most players will at least give your ideas proper consideration.\n\nStart off the game with really simple calls that make sense. Don't start with complicated suggestions that involve lots of coordination, but work up to them over time as you continue to make logical calls that have very clear immediate value to the team. Once players trust you more about the lower-level stuff, they'll be more likely to listen when you have a more complex idea.","replies":[]},{"poster":"ccseancc143","date":"2015-03-11T19:50:55.339+0000","up_votes":1,"down_votes":0,"body":"Basically never make the wrong call. You win your lane and never make stupid decisions. Once you make a stupid move that created doubt in your teammates about you which is never good.","replies":[]},{"poster":"Provengreil","date":"2015-03-11T16:46:29.291+0000","up_votes":1,"down_votes":0,"body":"The only calls I can **reliably** get my teammates to do is dragon, and even then only as support or jungler if someone else isn't already thinking it. call the timers: \"drag 1:45, preparing it\" while recalling is typically enough to let them know that their thresh is going to be fighting the vision war near the dragon pit in about 30 seconds, and therefore will not be near enough to a toplane or top jungle to help. following through with one pink, an upgraded sweeper use, and dropping 3 sightstone wards on likely incoming enemy paths is like a gigantic neon sigh saying, \"Take this, we have vision and they either can't fight us or can't find us\" without you having to communicate any of that. To be fair, I can only speak to silver and bronze experiences, where they won't realize you're doing this until it's far too late to trade anything back for it, and you also can't get your team to turn off dragon and fight them if they just run in and contest, but it's a start.\n\nBasically, make the call ahead of time, then stay focused. Don't call dragon timer at one minute, then take top inner turret as a jungler, or scream for group then immediately farm wolves. Of those that listen, even the worst players actually do realize that a bad plan followed well is better than no plan followed perfectly, so follow your own plan and you might find other behind you.","replies":[]},{"poster":"Leti the Yeti","date":"2015-03-11T07:21:44.448+0000","up_votes":1,"down_votes":0,"body":"srry, if the plan isnt \"all mid\"\nthey dont listen :l","replies":[]},{"poster":"AwesomeChad","date":"2015-03-11T05:18:01.439+0000","up_votes":1,"down_votes":0,"body":"Usually its your performance in-game and how you've talked to your teammates (your attitude towards your teammates). If you're doing well and you're being nice/not being a jerk, your teammates are more likely to listen to your calls.  \n\nIf your call requires preparation prior to execution, let your teammates know and start your sentences with \"Hey guy, I think its a good idea if we....\" or something along those lines. Don't bark out order or look down on your teammates. Also use pings to lead your team. ","replies":[]},{"poster":"2000boxes","date":"2015-03-11T04:09:08.974+0000","up_votes":1,"down_votes":0,"body":"when i try to shot call and people disagree with me i ask them, \"Do you have a better plan?\"\nthe answer is usually no and if they think they do i tell them lets do their plan then and if that fails the team will start to listen to me\nit's all about faith, trust, and communication.","replies":[]},{"poster":"Angry Monster","date":"2015-03-11T03:57:45.971+0000","up_votes":1,"down_votes":0,"body":"2 things here. First off Lakers  get pissie when jungles taken kills. They are less likely to follow someone that they are irritated at. 2nd I saw that u have to make calls that makes sense to the Laners. \n\nSo it helps if you are being clear in the early game with communication. Constant use of smart pings can make u look like a leader. Setting the tone early for leading\n\nIf the teammate does not think your calls are gOod for them they will resist them.","replies":[]},{"poster":"freeformline","date":"2015-03-11T03:44:01.460+0000","up_votes":1,"down_votes":0,"body":"I don't know what you have been trying, but being polite and supportive throughout the game usually helps, as does briefly explaining your reasoning and using proper grammar.","replies":[]},{"poster":"Kivolan","date":"2015-03-11T03:23:12.583+0000","up_votes":1,"down_votes":0,"body":"I tend to look to the Jungler for leadership. Generally the Jungler is the one who decides when to take objectives such as Dragon and Baron, so I also give more precedence to their pings to group or back off.","replies":[{"poster":"RogueWill","date":"2015-03-11T03:25:48.516+0000","up_votes":1,"down_votes":0,"body":"I agree with you but then again I'm normally the jungler xD","replies":[{"poster":"Kivolan","date":"2015-03-11T03:29:52.022+0000","up_votes":1,"down_votes":0,"body":"Man, really dunno what to tell you then. :l\n\nI'm also usually Jungling so I'm pretty used to calling shots. I haven't seen many ADCs try to lead the way in my ranked games (they're not the engage, obviously) so you just had a really, really bad Kalista.\n\nMaybe people trust my silent, contemplative personality... Because I ping a whole freaking lot, but I very rarely talk in chat when I'm in a game. :P","replies":[]}]}]}]}