{"poster":"SB Camus","date":"2019-07-05T13:51:36.341+0000","title":"Proyecto SneakyBaron.GG: Nuevo sitio para notas del parche fácil y rápido","subforum":"Charlas Generales","embed":{"description":null,"url":"https://www.sneakybaron.gg/","image":null},"up_votes":4,"down_votes":2,"body":"Buenas tardes jugadores!\r\n{{sticker:slayer-jinx-catface}} \r\n\r\nSoy iCamus, juego al League of Legends como todos ustedes y quería contarles sobre un proyecto que estamos haciendo con un equipo de trabajo.\r\n\r\nSe llama **SneakyBaron**, básicamente resumimos lo que está más \"op\" (roto) y lo dividimos según liga y posición.\r\n\r\nPágina:\r\nhttps://www.sneakybaron.gg/\r\n\r\nEspero que les sirva!\r\n\r\nPD: Se aceptan sugerencias, esta es una versión 1.0, se vienen cosas muy grandes!\r\nGracias y saludos! \r\n\r\n\r\niCamus\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Fransoi ","date":"2019-07-05T19:47:35.808+0000","up_votes":2,"down_votes":0,"body":"bueno no te voy a criticar por que es nuevo lo que estas intentando y bueno seria de rata criticarte, pero si puedo decirte que una gran idea es que a cada campeon cuando vos lo apretas te mande a un resumen de ese campeon, que diga estadisticas por ejemplo %de armados,en x enfrentamientos en que momentos es mas fuerte, etc tambien consejos con ese campeon, cosas asi, estadisticas es lo que a la gente mas le gusta, publica esto cada tanto en el foro asi sigo esta pagina, yo voy a dar consejos en todas por el momento no tiene nada pero no te bases en los pro, si pones por ligas ,basate en cada liga no te bases en que x campeon esta fuerte en los pro y lo pongas en oro a kowmaw en oro tu team te deja regalado si pueden los pro te lo defienden a muerte","replies":[{"poster":"SB Camus","date":"2019-07-06T15:06:46.057+0000","up_votes":1,"down_votes":0,"body":"Es muy buena idea, si, teniamos pensado algo de eso.. builds o contra quien es fuerte / debil el campeón!","replies":[]}]},{"poster":"SliferUry","date":"2019-07-05T17:29:45.552+0000","up_votes":1,"down_votes":0,"body":"En que se basan para decir que KowMaw es de lo mas \"op\" \"roto\" ?","replies":[{"poster":"SB Camus","date":"2019-07-05T17:46:00.188+0000","up_votes":1,"down_votes":1,"body":"En estadísticas de los pro players y su win rate","replies":[{"poster":"Fransoi ","date":"2019-07-05T19:39:26.880+0000","up_votes":2,"down_votes":0,"body":"en oro donde estoy me pones que kowmaw esta roto pero le respondiste a el que te basas en las estadisticas de los pro :S","replies":[]},{"poster":"SliferUry","date":"2019-07-05T18:41:58.877+0000","up_votes":1,"down_votes":0,"body":"De proplayers tiene un pickrate del 0,06%.\n\nLa idea me gusta de todos modos y recién empiezan, tienen varias cosas a arreglar pero denle para adelante !","replies":[]}]}]},{"poster":"SW Qui Gon Jinn","date":"2019-07-05T15:58:23.928+0000","up_votes":2,"down_votes":1,"body":"y le pones nombre de ese transformista? no gracias","replies":[]},{"poster":"ZombieCrow","date":"2019-07-05T16:20:14.776+0000","up_votes":1,"down_votes":0,"body":"Se ve interesante, a ver que siguen agregando a la página. Suerte con el proyecto!!.","replies":[{"poster":"SB Camus","date":"2019-07-05T17:46:32.617+0000","up_votes":1,"down_votes":0,"body":"Si, esta es la primera parte nada más!\nVamos a incluir funcionalidades típicas, te gustaría algo en particular?","replies":[]}]}]}