{"poster":"DEATCROW","date":"2018-03-13T16:56:47.430+0000","title":"cambios a mordekaiser","subforum":"Charlas Generales","up_votes":6,"down_votes":0,"body":"ya que est&aacute;n devolviendo a los campeones a como eran antes de sus cambios de habilidades deber&iacute;an hacerlo tambi&eacute;n con mordekaiser que estaba mejor antes del cambio a como esta ahora","replies":[{"poster":"Liliths","date":"2018-03-13T18:03:09.735+0000","up_votes":4,"down_votes":1,"body":"Es y era una mierda. Mordekaiser necesita un rework completo.","replies":[]},{"poster":"GaurdKill","date":"2018-03-13T20:43:15.207+0000","up_votes":1,"down_votes":0,"body":"Soy main Morde, (Mi verdadera acc es 3Q Kaiser, si, el que spameaba algo para morde en los foros). Pero déjame decirte que con certeza, Mordekaiser es más util el actual que el antiguo. Mordekaiser antes estaba casi obligado a armarse tanque, ya que la Antigua Q (Habilidad donde se enfoca prácticamente el 80% de daño de este champ) Solo podías hacerle como un 25% o 30% más SI EL OBJETIVO ESTABA SOLO (Supongo que lo sabes de igual forma). Sin embargo mucho no sacaba ya que debía armarse tanque.\n\n Lo peculiar es que era un Tanque Sin CC, ni movilidad, ni nada por el estilo, era directamente un campeón bastante... extraño en ese aspecto.\n\n Personalmente pienso que Mordekaiser está bien que le hayan hecho este cambio, ahora es más util, piensa que ahora se cura con la W, algo que necesitaba y con el Dragón de la R, está bastante fuerte en TF, independiente su build. Pero si es cierto que a Morde le falta algo, o bien, maneras de acercarse del enemigo o cc, o directamente escape.\n\n Con seguridad si, le falta un rework visual.","replies":[{"poster":"Joaquín1891","date":"2018-03-14T05:05:04.984+0000","up_votes":1,"down_votes":0,"body":"Yo últimamente estuve viendo un youtuber español (Mordekaiser Español - Manute) y el tipo cada vez que saca Dragón va con el mismo hacia una linea (mid y bot) y siempre saca una torre. Creo que el cambio del dragón es mas para enfocarlo en los objetivos.","replies":[{"poster":"GaurdKill","date":"2018-03-14T21:01:48.845+0000","up_votes":1,"down_votes":0,"body":"Por eso, antes ni si quiera tenia eso del Drg y por lo tanto, aun mas \"inútil\" era morde.","replies":[]}]}]}]}