{"poster":"nahu1","date":"2017-07-27T19:06:14.327+0000","title":"Estoy perdido, no puedo subir.","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"**_Simplemente ando perdido no puedo subir, trato de poner buena voluntad y no puedo subir ando actualmente Platino V, juego Shaco Top pero de veras me esfuerzo  por ser unos de los mejores que se pueda, puede ser que cada tanto juege mal pero trato de mejorar con cada partida mirando tips y streamers, autocriticandome y sigo sin subir entiendo que es por tiempo empeze Bronce I y en flex Bronce IV pero no puedo subir mas y tengo miedo que este sea mi nivel.._**{{champion:35}} {{summoner:14}} {{summoner:12}}","replies":[{"poster":"DarksWaves","date":"2017-07-27T19:13:22.972+0000","up_votes":2,"down_votes":1,"body":"juego Shaco Top - Yo juego eso para trolear oros, eso es un pick malisimo en el meta de hoy dia, y no aportas nada a lo que van a jugar los demas.\n\no que men me vas a decir que subis a platino sin saber que vana  jugar champs meta?\n\nPLZ autoreport. Tenes que saber a que jugas, para eso usa mas vale un tryndamere, o una annie, o algo asi.","replies":[{"poster":"nahu1","date":"2017-07-27T19:20:27.832+0000","up_votes":1,"down_votes":0,"body":"Subi Only Shaco Top, con 9.2/5.2/8.1 KDA, 211 games y con 59% de ganar, eso no era a lo que iba pero gracias por tu aportacion","replies":[{"poster":"DarksWaves","date":"2017-07-27T19:25:34.273+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=nahu1,realm=LAS,application-id=v7qsfXsE,discussion-id=AHU5j4cV,comment-id=00000000,timestamp=2017-07-27T19:20:27.832+0000)\n>\n> Subi Only Shaco Top, con 9.2/5.2/8.1 KDA, 211 games y con 59% de ganar, eso no era a lo que iba pero gracias por tu aportacion\n\nEn realidad subiste hasta ahi, porque con rivales mas habiles no vana perder contra un shaco top.","replies":[]}]}]},{"poster":"Mayushi","date":"2017-07-28T00:39:24.924+0000","up_votes":1,"down_votes":0,"body":"llegaste a platino V facilmente porque en low elo es muy poca gente la que sabe jugar contra un {{champion:35}}  y champs de mecanicas similares {{champion:67}} {{champion:28}} {{champion:29}} {{champion:84}} {{champion:121}} {{champion:7}} {{champion:91}} , me paso con {{champion:28}}  que subi una cuenta hasta platino 3 y {{champion:35}}  me llevo a oro 1 en una season donde estaba fuerte su version ad, te recomiendo que cambies de champ ya que ahi todos saben donde wardear y ubicar a los carry para borrarte en esa fraccion de segundo que te muestras para matar a alguien, sino vas a strugglear igual que esos tipos main Shaco de otros servidores que no logran salir de Diamante 5 por lo mismo. cambiar por otros champs casi similares {{champion:421}} {{champion:32}} {{champion:107}} {{champion:62}}  podria llegar a hacer mas facil el intercambio pero siempre enfocandose en los que aporten mas utilidad","replies":[{"poster":"Mayushi","date":"2017-07-28T00:43:30.307+0000","up_votes":1,"down_votes":0,"body":"lo mas importante en cuanto a subir es lograr adaptarte rapido al entorno con dificultad, viendo mis replays en la season 4 yo era capaz de reventar a todo un team full cc con {{champion:161}}  y en el transcurso usar {{item:3157}}  para esquivar el flash de {{champion:54}}  y {{champion:254}} , ahora estoy terriblemente oxidado prueba de haber jugado tanto tiempo en low elo y no soy capaz de hacer nada de eso","replies":[]}]},{"poster":"LandaMC","date":"2017-07-27T20:54:36.038+0000","up_votes":1,"down_votes":0,"body":"Es un pick medio troll y antimeta, yo creo que si te buscan un buen champ podrias ir mejor.","replies":[{"poster":"LandaMC","date":"2017-07-27T20:55:01.283+0000","up_votes":1,"down_votes":0,"body":"Teniendo en cuenta el potencial que tenes para subir con shaco top a platino 5","replies":[]}]},{"poster":"Jherico","date":"2017-07-27T19:50:27.851+0000","up_votes":1,"down_votes":0,"body":"quizas debas cambiar de champs o tacticas, stomepas top pero el resto como que no puede tener manos pa,\nen la ultima no tenias resistencia magica y el kassa seguro te deleteaba mas ese brand seguro desaparecias,\nveo que por ahi te salvan los otros que se fedean xq en la que veo vos tenes varias kill y tu team da lastima, y en otras\ntenes mismas kill y muertes pero ty mid y adc hiper feed, asi que pensa subiste solo por usar shaco o xq te carrearon la partida.\nojo yo soy re malo pero creo que a shaco se le gano como a teemo con lente y wards. deberias probar otros champs o buscar una build mas tanke cosas asi usa flex para probar ajaja","replies":[]},{"poster":"s10 toplaner","date":"2017-07-27T19:21:23.940+0000","up_votes":1,"down_votes":0,"body":"Tenés que ser DEMASIADO bueno para ganar partidas y subir elo jugando Shaco TOP (Shaco jungla como One Trick Pony es otra cosa). Yo te recomiendo que lo empieces a usar en la jungla o que, de otro modo, cambies a campeón para ir TOP","replies":[]}]}