{"poster":"TheDoubleSkiller","date":"2015-07-11T03:42:04.104+0000","title":"Hallo, wie carry ich mich als Zed (oder mit anderen midlanern) aus Silber V? :D","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":1,"body":"Hallo,\r\n\r\nich bin schon seit einiger Zeit main Zed und auch Silber V. Wenn ich mid komme kann ich mein Team oft carrien, aber ich verliere fast jedes zweite Spiel (Ranked: 25Wins/23Looses), was wahrscheinlich daran liegt dass ich ihn oft nicht bekomme. Ich wollte aber mal trotzdem fragen ob mich jemand trainieren kann mit Zed oder vllt. einem anderen Champion, der dazu besser gedacht ist.","replies":[{"poster":"LessQQ","date":"2015-07-13T12:24:38.415+0000","up_votes":1,"down_votes":0,"body":"Hey!\nGuck doch mal hier rein!\n\nhttps://www.youtube.com/watch?v=PKXe6RgVg4Q&list=PL0gzkUZvyS3_KxnQWu_CdhJidV7S3dE9U\n\nDas sind alles äußerst detallierte Champ Guides mit Commentary und Gameplay!","replies":[{"poster":"TheDoubleSkiller","date":"2016-03-31T16:40:54.529+0000","up_votes":1,"down_votes":0,"body":"Danke, konnte mich mithilfe von Zed, Fiora und Shen (manchmal auch anderen) innerhalb von 10Monaten aus Bronze 2 bis zu Platin 2 carrien. Nicht alles dein Verdienst aber ich bin ein großer Fan deiner Guides und habe damals nicht geachtet dass du mir das geschrieben hast :D. Viel Glück noch mit deinem Kanal bro","replies":[]}]},{"poster":"Clashez","date":"2015-07-14T05:50:32.948+0000","up_votes":1,"down_votes":0,"body":"Als Midlaner muss man die anderen Lanes im Auge behalten. Vor allem wenn du gerade Level 6 geworden bist und die Botlane noch nicht, ist das ne gute Situation für nen Gank. Am einfachsten isses, wenn du während der Laning-Phase auf die HP der eigenen Teammates achtest(oben links). Denn ist einer Low HP, also blinkt rot, ist der Gegner meistens auch angeschlagen und du kannst dir nen Kill holen gehen.\n\nVor allem ist wichtig, dass du dich an die Objectives hältst: Nach nem Kill sofort die Lane weiter pushen und den Tower zerstören oder Dragon holen.. Einfach drauf pingen und anfangen, die Teammates ziehen mit. Dann sofort back porten und einkaufen, vor allem Trinket ausbauen, kostet nur 250 und gibt dir das ganze Game über Wards.\n\nDann zurück auf die Lane, Minions farmen und beim nächsten Kill wieder nen Objective usw.\n\nSo gewinnt man die Games, langsam, aber sicher. Da spielt auch keine Rolle, was dein Main ist, der Ablauf bleibt derselbe.","replies":[]},{"poster":"LSG shamshiev","date":"2015-07-11T11:08:52.277+0000","up_votes":1,"down_votes":0,"body":"Hallo TheDoubleSkiller,\n\nViele Faktoren beeinflussen deine Win-Rate. Ein Faktor ist natürlich dein \"Champion Skill\", doch wie sieht es mit den anderen aus? Wie verhaltest du dich in bestimmten Situation? Kennst du die Aufgaben deines Champions? (in diesem Fall bei Zed = Flanking) Wie kommunizierst du mit deinen Teammates? \n\nLoL ist ein sehr vielseitiges Spiel ;)\n\nWenn du Lust hast kannst du auf meine YouTube Channel vorbeischauen. Das Format \" How To Get out of Bronze/Silver könnte dir helfen. \n\nlink : https://www.youtube.com/channel/UCH4d_JhRewkdflojar1tADw\n\nLG,\nLSGsham","replies":[{"poster":"TheDoubleSkiller","date":"2015-07-11T15:23:43.579+0000","up_votes":1,"down_votes":0,"body":"Danke für die Antwort =). Also zu den Aufgaben des Champions Zed weiß ich, dass es in Teamfights meist darum geht den Adc zuerst auszuschalten und dann sicher rauszukommen, also nicht direkt beim Töten des Adc´s zu sterben und dann kann man vllt. wieder reingehen.","replies":[{"poster":"loliufg","date":"2015-07-11T16:47:55.571+0000","up_votes":1,"down_votes":0,"body":"Das stimmt so nicht direkt. Naürlich ist es die Aufgabe eines Assassin high priority targets zu töten. Leider ist es in der Realität oft so das dies unmöglich ist. Gerade in der derzeitigen tank meta in der einfach viel zu viel cc im game ist, ist es oft von Vorteil erst seinen Poke WQE Comp zu benützen um so Schaden zu erzeugen und erst später den Carrie zu focusen. Da meisten ein bortk gebaut wird, sind auch deine aas wichtig.  Vergiss nicht du bist als Zed meistens ein Midlaner also ein carrie. Die Aufgabe eines Carrie ist es Schaden zu machen, später kannst du immer noch deep gehen wenn der gegnerische carrie einen misstep macht oder die cc rausist und du sicher denn kill hohlen kannst. Die Teamfights sind aber allgemein eher ein kleiner Teil des games. Wenn du die lane godlike bis ins hohe gold spielen kannst, kannst du die meisten games easy snowballen da in niedriger elo viel zu viele mistakes begangen werden, auch auf der lane die schnell spiel entscheidend sein können.","replies":[{"poster":"TheDoubleSkiller","date":"2015-07-11T17:43:53.693+0000","up_votes":1,"down_votes":0,"body":"Die poke combo benutze ich sehr oft im early, auch weil meist die Midlaner in der low Elo mit low life am tower backen kann ich somit Kills securen... aber ich behalte mir auch oft den schatten in der Hinterhand falls z.B. der Jungler ganken kommen könnte. Im late mach ich das eher weniger, bzw. fast nur wenn ein gegner mit low life am wegrennen ist und ich aus dem hinterhalt komme und mit der WQE Comp schnell zu töten","replies":[]}]}]}]},{"poster":"Bluefersan","date":"2015-07-11T15:37:36.009+0000","up_votes":1,"down_votes":0,"body":"würde gern mal ein game von dir ansehen add mich mal ingame, maine zed (nicht auf dem acc).","replies":[{"poster":"TheDoubleSkiller","date":"2015-07-11T16:19:16.144+0000","up_votes":1,"down_votes":0,"body":"Ok habe dich geaddet aber geht erst wieder wenn er enabled ist.","replies":[]}]},{"poster":"Ben Maxims Sohn","date":"2015-07-11T15:31:30.304+0000","up_votes":1,"down_votes":1,"body":"Mit Zed garnicht der ist nämlich gerade diasbled. {{champion:17}}","replies":[{"poster":"TheDoubleSkiller","date":"2015-07-11T16:17:55.780+0000","up_votes":1,"down_votes":0,"body":"Ich weiß xD. Schon seit ca. 2Tagen :/ und ich hoffe immer dass er enabled wird...","replies":[]}]},{"poster":"Heal and Protect","date":"2015-07-11T05:26:32.551+0000","up_votes":1,"down_votes":0,"body":"Hallo DoubleSkiller\n\nZunächst würde ich dir empfehlen, deine \"Ich muss carrien\" Mentalität an den Nagel zu hängen, hilft an sich nicht sehr viel (Ausser du bist ein Smurf).\n\nAls Zweiteres ist Zed ein sehr guter Roamer - heisst, wenn es bei dir sehr gut läuft versuche deinen Vorteil auch auf die anderen Lanes zu bringen, jedoch nicht vor level 6. Dazu brauchst du nur vorher deine Midlane auszupushen und ungesehen entweder nach top oder meist besser in die Botlane zu verschwinden.\n\nEin letzter Punkt, den ich bei vielen \"Low Elo\" Zeds sehe ist, dass sie nicht wirklich zu Farm kommen, was bei Assassinen wirklich schlecht ist, also auch da verbessern ;)\n\nDavon abgesehen ein paar Allgemeine Tipps: Mehr warden, auch wenn du nicht support spielst, Nicht flamen, Auch auf anderen Lanes dein bestes geben, Champs spielen, die du auch beherrschst und diese weiter üben ist besser als Champs zu spielen, von denen gesagt wird dass sie gut \"Carrien\" können.","replies":[{"poster":"TheDoubleSkiller","date":"2015-07-11T15:25:21.769+0000","up_votes":1,"down_votes":0,"body":"Danke für die Tipps =). Eigentlich ist ja Zed der Champ den ich am meisten beherrsche.","replies":[]}]},{"poster":"68 73 77 65","date":"2015-07-11T07:49:52.593+0000","up_votes":1,"down_votes":0,"body":"Du kannst grundsätzlich alles von Bronze - Plat, oder evtl. Dia spielen.. nimm bitte einfach nicht Zed! Such dir nen Champion, der nicht viele Mäkäniks braucht & mit dem du gut carryn kannst, glaub mir, ist besser.","replies":[]},{"poster":"LucarryXX","date":"2015-07-11T06:09:43.073+0000","up_votes":1,"down_votes":0,"body":"Übung macht den meister :) \nich zu meinem teil spiele seit s1 und bin immer noch in platinum :) \nda ich keine rankeds mag ^^ und elo's nichts aussagen ^^","replies":[]},{"poster":"Quantum Theory","date":"2015-07-11T07:36:21.197+0000","up_votes":2,"down_votes":6,"body":"Spiel einfach ein Noobchamp\nZed ist da schon mal eine gute Wahl","replies":[]}]}