{"poster":"Darkary","date":"2017-01-16T13:58:39.544+0000","title":"Kriegt ihr auch immer schlechte mitspieler?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":13,"body":"Immer wenn ich spiele, und ich spiele nur Rankeds (derzeit Silver 5) kriege ich die schlechtesten Mitspieler oder einfach die, die rein Trollen, ich spiele fast jedes Game positiv, und muss dann gegen Spieler spielen die richtig rein sweaten und kriege die Spieler, die es einfach nicht juckt das andere Menschen auch was erreichen wollen. Ich habe gerade erst ein Spiel gemacht, und habe jemanden gekriegt, er wurde Auto-Filled, ratet mal was er gemacht hat.\nJa richtig er hat meinen Mid Lane champ gebannt, hat Lee Sin support gepickt, ist zu mir Mitte gegangen ist gestorben und ging Afk. Und solche bekomme ich jedes Spiel.\n\nL&ouml;scht diese Diskussion oder verschiebt sie, oder macht damit sonst noch was, wollte das hier einfach mal loswerden\n\nMfg DarkaryxD","replies":[{"poster":"Ozuraak","date":"2017-01-16T14:07:13.765+0000","up_votes":11,"down_votes":0,"body":"Lest ihr im Forum auch immer so schlechte Threads?","replies":[{"poster":"Neamhoilte","date":"2017-01-16T14:39:42.686+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Ozuraak,realm=EUW,application-id=KYnfKGf0,discussion-id=ERfKKTE1,comment-id=0000,timestamp=2017-01-16T14:07:13.765+0000)\n>\n> Lest ihr im Forum auch immer so schlechte Threads?\n\nMeistens schlechtere. Zumindest gibt es Satzzeichen, Absätze und ne Rechtschreibung. \n\nIch spiel ja selber nicht so pralle, aber was man teilweise am unteren Ende der Rangliste sieht, lässt einen schon öfters in die Tischkante beissen. Ob das nun zum Vor- oder Nachteil für den TE ist - Wer weiß das schon mit Sicherheit. \n\n{{sticker:slayer-jinx-wink}} \n\nWie auch immer. \n\n@TE: Augen zu und durch. Kann nur besser werden.  : )\n\n\nGruß OT Becks","replies":[]},{"poster":"MisterFirstBlood","date":"2017-01-17T08:16:16.579+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ozuraak,realm=EUW,application-id=KYnfKGf0,discussion-id=ERfKKTE1,comment-id=0000,timestamp=2017-01-16T14:07:13.765+0000)\n>\n> Lest ihr im Forum auch immer so schlechte Threads?\n\neigentlich suche ich danach","replies":[]},{"poster":"Uranbrennstab","date":"2017-01-16T14:51:48.513+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ozuraak,realm=EUW,application-id=KYnfKGf0,discussion-id=ERfKKTE1,comment-id=0000,timestamp=2017-01-16T14:07:13.765+0000)\n>\n> Lest ihr im Forum auch immer so schlechte Threads?\n\nIst schon in den Top Ten der Woche würde ich sagen.","replies":[]},{"poster":"KingxOfxHeaven","date":"2017-01-16T14:31:26.816+0000","up_votes":1,"down_votes":0,"body":"Jeder 3 Thread besteht aus geheule xD","replies":[]}]},{"poster":"Nycaria","date":"2017-01-16T17:02:18.315+0000","up_votes":5,"down_votes":0,"body":"> ich spiele fast jedes Game positiv, \n\nGut du spielst also fast jedes Game positiv ?\n\n1/6/3 Annie\n1/4/4 Ezreal\n4/7/1 Katarina\n3/7/4 Jax\n8/9/11 Annie\n2/7/1 Olaf\n5/10/5 Veigar\n1/7/5 Malphite\n4/5/7 Veigar\n\nDas sind die Games aus deiner Matchhistory, wo deine Stats nicht positiv sind.In 4 weiteren Games hast du über 10 Tode & allgemein sind deine Stats wirklich nichts, worauf man stolz sein könnte.\nSchonmal daran gedacht,dass es deine Schuld sein könnte, wenn du nicht aufsteigst? Das du nicht carrien kannst,selbst mit halbwegs guten Stats? \n\nDu wirst das nicht hören wollen, aber fang an deine Fehler zu sehen und auszumerzen und suche Fehler nicht nur bei deinen Teammates, dann steigst du auch irgendwann auf.","replies":[]},{"poster":"LegendaryXenon","date":"2017-01-16T14:37:06.622+0000","up_votes":3,"down_votes":0,"body":"\"Erreichen\", du sollst Spaß haben und dabei gut werden. Nicht durch Glück gewinnen und dann zu deinen Kumpels in der 8a sagen, du wärst pro.","replies":[{"poster":"Shooter90","date":"2017-01-16T17:57:24.133+0000","up_votes":1,"down_votes":0,"body":"kumpels in der 8a. hahaha genial :D","replies":[]}]},{"poster":"Shooter90","date":"2017-01-16T15:47:20.209+0000","up_votes":2,"down_votes":0,"body":"dieser post und dann folgendes op.gg:\n\nhttp://euw.op.gg/summoner/userName=darkaryxd\n\n{{sticker:zombie-brand-facepalm}}\n\nP.S.: lass die finger von kata die scheint zu schwer für dich zu sein ;)","replies":[{"poster":"Darkary","date":"2017-01-16T16:15:14.033+0000","up_votes":1,"down_votes":5,"body":"P.S. nein ist sie nicht, meinst das Game gegen Zed? Das Game als ich nen Lee support hatte, der lvl 1 afk ging? Wo ich komplett am tilten war?","replies":[{"poster":"Shooter90","date":"2017-01-16T17:56:44.918+0000","up_votes":4,"down_votes":0,"body":"nein ich meine deine DURCHSCHNITTSstats\n\ndu stirbst im schnitt 10,4 mal. das ist VIEL zu viel. vielleicht hattest du ja auch bad games und bist eigentlich ne sicke kata. das bezweifel ich aber :D","replies":[]},{"poster":"CoopA826","date":"2017-01-16T18:40:41.223+0000","up_votes":1,"down_votes":0,"body":"Hast du eine Ausrede parat für alle Spiele die du verloren hast?\nIrgendwann muss doch der Punkt kommen, wo du einsiehst, dass du schlecht bist und dich verbessern musst.\n\n20% winrate auf die anderen zu schieben ist echt arm.","replies":[]}]}]},{"poster":"Neamhoilte","date":"2017-01-17T17:43:19.524+0000","up_votes":2,"down_votes":0,"body":"So,\n\nnachdem die meisten hier nur auf dir rumgehackt haben, werde ich mal zwischen den Zeilen lesen und gebe dir folgende Denkanstöße :\n\nWards - dein Freund und Lebensretter. 75g für nen Kontrollauge sollte man überhaben.  Gut platziert steht der eine lange Zeit auf der Map. \n\nMinimap - Ist quasi der beste Kumpel vom Ward. Immer mal ein Auge drauf werfen.\n\nChasen - Wir spielen LoL, nicht Räuber und Gendarm. Hol dir lieber Farm oder den Tower etc. Nichts ist unsinniger als den Gegner über die ganze Map zu verfolgen. \n\nGreed - auch als Darius kann man nicht 1vs5 Towerdiven. Einen Kill kriegen ist gut. Dann dabei auch zu sterben nicht. \n\nLasthitten - die Lizenz zum Gold machen. Je mehr du bekommst umso besser. Lerne unter dem Tower zu farmen. Ein Gegner der so hard pushed ist ein leichtes Gankopfer.\n\nRunen - Nützliche kleine Dinger. T3 Runen sollten es schon sein. Gönn sie dir und verschwende nicht deine EP für den nächsten neuen Champ. Pass sie deinem Spielstil an. \n\nMasteries - Nicht nur schmückendes Beiwerk, sondern genauso hilfreich wie Runen. Wähle weise. \n\nIngame Chat - so wenig wie möglich, so viel wie nötig. Allchat brauchst nicht. Wir wollen mit dem anderen Team nicht Smalltalk machen. Kein Flame, Blame oder Shame. Nur relevante Sachen für dein Team, wie Top no flash, Bot warded etc. \n\nItembuild - Nicht einfach stur bauen, sondern mitdenken und anpassen. \n\n.......\n\nGibt bestimmt noch mehr Sachen, aber wenn du nur ein paar davon umsetzen kannst, wirst du dich mit Sicherheit über kurz oder lang verbessern. Deine Winrate wird steigen und du wirst wieder climben. \n\nWas ich noch empfehlen kann, ist der Ranked Guide für Dummies von Der Redakteur. Ein Super Thread zum Thema. Nicht mehr ganz uptodate, aber immer noch aktuell. \n\n\nHoffe das ich dir mit diesem Post etwas behilflich sein kann. Lass dich nicht unterkriegen und immer schön am Ball bleiben. \n\nGruß OT Becks","replies":[{"poster":"Time2Whine","date":"2017-01-18T09:06:26.113+0000","up_votes":2,"down_votes":0,"body":"Na dann hoffen wir mal dass er deine Ratschläge auch umsetzt. Wenn ich mir seinen Thread und sein Profil anschaue, habe ich da aber wenig Hoffnung. Wer so wenig Selbstreflexion an den Tag legt und meint es liegt immer an den Anderen, wird auch weiterhin kaum an sich arbeiten.\nBeachtet er deine Tipps, sollte es jedoch schnell aufwärts gehen.","replies":[]}]},{"poster":"One Eyed Øwl","date":"2017-01-17T07:23:47.677+0000","up_votes":2,"down_votes":0,"body":"Ich hab noch nie so ne WR gesehen... 32% nach 100+ Games isn dickes Ding, wenn man bedenkt, dass du mindestens eins von drei Games sowieso gewinnst, weil das Team stompt. Das heißt, du bist in keinem deiner knappen Games ein Faktor, der das Team zum Sieg führen kann, und genau diese Games sind wichtig zu gewinnen...","replies":[]},{"poster":"Darkary","date":"2017-01-16T14:48:41.301+0000","up_votes":1,"down_votes":3,"body":"Danke OT Becks, habe mit der weile aber 1000 Spielstunden und habe letzte Season Gold gehabt da nervt es schon ein bisschen auf Silber zu hängen. Für die anderen, es kotzt einfach an, @isklhairtuz, du bist selber Silber, genauso wie ich es bin, bist doch selber nicht der beste Spieler, also warum kannst du so was sagen?","replies":[{"poster":"XenesisCH","date":"2017-01-16T15:46:28.136+0000","up_votes":2,"down_votes":0,"body":"Scheint so als musst du diese Saison ein bisschen mehr tun, dass du Gold erreichst bzw. du musst es dir verdienen mit konstant guten Leistungen. Mir ging es am Anfang auch nicht besser, ich hatte nach den Platzierungsspielen ein lange Serie mit vielen Niederlagen und hatte weniger als 40 % meiner Spiele gewonnen Overall, nach über 100 Spielen bin ich wieder auf 50 %. Was ich damit sagen will ist, dass mit ein bisschen Geduld und \"guten Leistungen\" auch du wieder aufsteigen wirst (die Leistungen deiner ständig wechselnden Mitspieler sind dabei völlig irrelevant) ;).","replies":[{"poster":"Darkary","date":"2017-01-16T16:14:00.788+0000","up_votes":1,"down_votes":2,"body":"Was heißt hier \"auch du\" :D. Spaß. Danke dir :)","replies":[]}]},{"poster":"ikslhairtuz","date":"2017-01-16T14:55:51.914+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DarkaryxD,realm=EUW,application-id=KYnfKGf0,discussion-id=ERfKKTE1,comment-id=0003,timestamp=2017-01-16T14:48:41.301+0000)\n>\n> Danke OT Becks, habe mit der weile aber 1000 Spielstunden und habe letzte Season Gold gehabt da nervt es schon ein bisschen auf Silber zu hängen. Für die anderen, es kotzt einfach an, @isklhairtuz, du bist selber Silber, genauso wie ich es bin, bist doch selber nicht der beste Spieler, also warum kannst du so was sagen?\n\nHabe ich behauptet das ich gut bin? Ich denke nicht!\nUnd ob ich gut genug für meine Elo bin wirst du wohl schlecht sagen können... immerhin habe ich über 70 Prozent Winrate in SoloQ und Flex wo du mit 30 Prozent Winrate wohl kaum mitreden kannst.","replies":[{"poster":"Darkary","date":"2017-01-16T15:17:31.551+0000","up_votes":1,"down_votes":4,"body":"Schon mitgekriegt worum es in diesem Thread geht?","replies":[{"poster":"0815xand0r","date":"2017-01-16T17:36:03.509+0000","up_votes":1,"down_votes":0,"body":"Ja, darum dass du mit Spielern zusammen spielst, die offensichtlich auf deinem Niveau sind und dass du uns hier angelogen hast (da der von dir genannte Lee Sin nämlich gar nicht gestorben ist, wenn man der Matchhistory glauben schenken mag)","replies":[]}]}]}]},{"poster":"ikslhairtuz","date":"2017-01-16T14:27:30.350+0000","up_votes":3,"down_votes":2,"body":"Sobald ich dich im Team habe ja!","replies":[]},{"poster":"Time2Whine","date":"2017-01-17T10:49:21.963+0000","up_votes":1,"down_votes":0,"body":"Mir reicht ein Blick auf deine Statistik um den Thread mit einem herzhaften Lacher zu schließen. Du stehst da wo du bist, weil du es verdienst da zu spielen. \nFast 100 Spiele und du bist seit 1!! Monat Hardstuck in S5 mit einer 32 % Winrate. Tut mir Leid, aber die Probleme liegen nicht bei den anderen sondern bei dir selber. \nSolange du das nicht erkennst wirst du niemals climben können und dich bald in Bronze wiederfinden.","replies":[]},{"poster":"Megamaexx","date":"2017-01-16T18:36:12.679+0000","up_votes":1,"down_votes":0,"body":">hat Lee Sin support gepickt, ist zu mir Mitte gegangen ist gestorben und ging Afk\n\nHast du einen Link zu dem Game? Ich finde nur ein Spiel, als du Katarina warst, wo ein Lee zwar AFK war, du allerdings first blood abgegeben hast.\n\nWobei das ja eigentlich irrelevant ist.\n\nDie Spieler sind eben so stark wie du.","replies":[]},{"poster":"Snowgen","date":"2017-01-16T17:19:30.920+0000","up_votes":1,"down_votes":0,"body":"Ja \"Müll zu Müll\" wie man so schön sagt.","replies":[]},{"poster":"0815xand0r","date":"2017-01-16T17:05:14.990+0000","up_votes":1,"down_votes":0,"body":">  ich spiele fast jedes Game positiv, und muss dann gegen Spieler spielen die richtig rein sweaten und kriege die Spieler, die es einfach nicht juckt das andere Menschen auch was erreichen wollen.\n\nNaja, also so toll sind deine Stats nun wirklich nicht. Deine KDA ist z.T. echt mies, dein Farm mit im Schnitt 5 CS/Min ebenfalls, von den Wards sprechen wir mal gar nicht.\n\n> Ja richtig er hat meinen Mid Lane champ gebannt, hat Lee Sin support gepickt, ist zu mir Mitte gegangen ist gestorben und ging Afk.\n\nkomisch, dass der einzige Lee Sin, den ich da als Nicht-Jungler finde, gar nicht gestorben ist oO","replies":[]}]}