{"poster":"Yúnò","date":"2018-08-24T16:10:25.832+0000","title":"Shyvanas Vater","subforum":"Champions & Gameplay","up_votes":2,"down_votes":0,"body":"Ich bin heute mal wieder &uuml;ber den Lore von Shyvana gestolpert und mir ist zun&auml;chst eine Frage offen geblieben: Wer ist Shyvanas Menschlicher Vater? Ich wei&szlig;, es war im urspr&uuml;nglichen Shyvana-Lore anders aber im derzeitigen hei&szlig;t es:\r\n&quot;Ein solches Drachenei, ..., pulsierte mit den sachten Echos einer Feuerrune. Von ihrer Kraft angezogen, machte sich ein wagemutiger Magier daran, die Runenmagie aus seinem Inneren zu extrahieren, wurde jedoch von der R&uuml;ckkehr der Drachenmutter unterbrochen. Der Magier floh, hatte jedoch im Chaos unwissentlich bereits das Ei mit seiner eigenen sterblichen Magie versehen.&quot;\r\nEin paar Zeilen sp&auml;ter wird erkl&auml;rt, dass durch diesen Sterblichen Shyvana ein Halbdrache wurde.\r\n\r\nMein erster gedanke war Ryze.\r\nDiese These wurde auch bereits vor einem Jahr im NA Forum aufgestellt fand aber nicht wirklich eine endg&uuml;ltige Antwort.\r\n\r\nIch fasse einmal kurz die begr&uuml;ndungen vom NA Forum zusammen und erg&auml;nze sie durch meine Eigenen.\r\n\r\nRyze und Shyvana sind sich sehr &auml;hnlich. Beide haben (Shyvana nur in Menschlicher Gestalt) Violette Haut, beide haben Probleme sich in die normale Zivilisation ein zu gliedern und beide wollen die Sterblichen um sich herum besch&uuml;tzen.\r\n\r\nHierzu gibt es aber die Gegenmeinung, die sich auf die Textstelle\r\n&quot;Der Magier floh, hatte jedoch im Chaos unwissentlich bereits das Ei mit seiner eigenen sterblichen Magie versehen.&quot; beziehen und sagen, dass der Magier Shyvana gar nicht &uuml;ber seine Pers&ouml;nlichen Gene ver&auml;ndert. Die Vertreter dieser Meinung sagen dass es auch jeder andere Magier gewesen sein k&ouml;nnte.\r\n\r\nDoch auf der anderen Seite hei&szlig;t es ja am Anfang &quot;Ein solches Drachenei,...,pulsierte mit den sachten Echos einer Feuerrune. Von ihrer Kraft angezogen, machte sich ein wagemutiger Magier daran, die Runenmagie aus seinem Inneren zu extrahieren,...&quot;\r\nEin Wagemutiger Magier, der Runenmagie aus einem Ei extrahieren M&ouml;chte? Es w&uuml;rde zu Ryze passen.\r\n\r\nDie Gegenseite Argumentiert hier,dass Ryze sich nur f&uuml;r die Weltrunen interessieren w&uuml;rde. \r\nEs wird jedoch dagegen Argumentiert, dass Drachen urspr&uuml;nglich  eine Biologische Waffe der Menschen waren oder ein schief gegangenes Experiment und dass eben diese mit Weltrunen erstellt wurden und Ryze eben diesen Ursprung der Runen erforschen oder entfernen wollte um eben diese Gefahr die durch die Runen der Drachen ausgeht, von den Menschen ab zu wenden.\r\n\r\nWas denkt ihr? \r\nIst Ryze Shyvanas Vater?\r\nUnd wenn er es nicht ist, wer ist dieser &quot;wagemutiger Magier&quot; dann?","replies":[{"poster":"A Ryze From Dead","date":"2018-08-25T08:59:29.819+0000","up_votes":1,"down_votes":0,"body":"Es wird ggf irgendwann in eine story eingebunden. So wie Yasuo's Meister's Mörder am anfang auch unbekannt war und später ein ganzer Comic mit story drumrum gemacht wurde.\n\nAußerdem ist Ryze nicht wirklich \"wagemutig\" zumindest nicht mehr. Er hat nur die Runen im Auge und das Leben anderer Wesen die ihm nicht in die Quere kommen zu beeinflussen ist nicht sein Ding, er verabscheut jede Art von Gier. Außerdem ist das \"sterbliche Element\" in ihm nicht wirklich vorhanden. Er ist einer der ältesten und immer noch stärksten Wesen von Runeterra.","replies":[{"poster":"Uranbrennstab","date":"2018-08-25T13:41:05.853+0000","up_votes":1,"down_votes":0,"body":"Ja, das Riven Yasuos Meister umgebracht hat fand ich auch ziemlich gut gemacht. So hat man viel Potenzial für eine gute Geschichte zwischen den beiden.","replies":[]}]},{"poster":"Epic Melons","date":"2018-08-25T08:58:37.824+0000","up_votes":1,"down_votes":0,"body":"Sie nennt mich immer \"Daddy\" {{sticker:sg-jinx}}","replies":[]},{"poster":"Uranbrennstab","date":"2018-08-24T18:55:07.913+0000","up_votes":1,"down_votes":0,"body":"Aufgrund von Riots glorreicher Idee ihr Lore nicht nur qualitativ zu ermorden, sondern auch auseinander zu fasern wird es nicht Ryze sein. Es wird wohl ein Unbekannter Magier sein und ich denke nicht, dass wir es je erfahren werden.","replies":[{"poster":"Veezey","date":"2018-08-24T20:28:58.989+0000","up_votes":1,"down_votes":0,"body":"Also ich finde die Lore jetzt besser als früher. Davor waren es meistens einzelne Geschichten und jetzt ist das alles mehr mit einander verwoben und stimmiger. Allerdings finde ich auch nicht alles gut. Varus' Story fand ich davor besser. Besonders die Kurzgeschichte beim Release fand ich gut und jetzt es das eher meh.","replies":[{"poster":"Uranbrennstab","date":"2018-08-24T20:50:23.599+0000","up_votes":1,"down_votes":0,"body":"Also zum einen haben sie sehr sehr viel entflochten, was vorher zusammen gehört hat. \nZum anderen: Was ist denn besser geworden? Mount Targon ist von Sparta zum Sitz Körperstehlender Aliens geworden. \nZhaun ist vom eigenen Stadtstaat zum Ghetto Piltovers geworden. \nFreljord ist von einer hochgradig interessanten Geschichte rund um die Frozen Watchers zu einer Karikatur auf sich selbst geworden. \nDemacia ist moralisch fast so korrupt wie Noxus, nur weniger konsequent.\nSwain ist vom Grand Generell zum Demonboosted Lucius Malfoy geworden. \n\n\nAlso sag mir, was aus Bilgewater ist denn besser als vorher? Es ist besser präsentiert, aber qualitativ kompletter Abfall.","replies":[{"poster":"Veezey","date":"2018-08-24T21:23:59.168+0000","up_votes":1,"down_votes":0,"body":"Ich finde das Ganze insgesamt besser als vorher. Ist doch nur Geschmacksache. Ich kann aber nachvolziehen warum du es vllt nicht magst^^","replies":[{"poster":"Uranbrennstab","date":"2018-08-24T21:45:01.922+0000","up_votes":1,"down_votes":0,"body":"Was gefällt dir denn besser? Aliens? Dämonen überall? Edgy McEdgeface Aatrox?","replies":[]}]}]}]},{"poster":"Yúnò","date":"2018-08-24T19:00:04.827+0000","up_votes":1,"down_votes":0,"body":"Auch wenn ich anderes hoffe,muss ich dir leider recht geben.","replies":[]}]},{"poster":"Yúnò","date":"2018-08-24T18:58:16.584+0000","up_votes":1,"down_votes":0,"body":"Warum leugnet Riot eigentlich, dass die Champions eigentlich eine riesen fetternwirtschaft sind? Gebt doch einfach mal Vaterschafts test statt! Shyvana-Ryze, Kai'Sa-Kassadin, was kommt als nächstest, Rito?!","replies":[{"poster":"Uranbrennstab","date":"2018-08-24T19:45:05.995+0000","up_votes":1,"down_votes":0,"body":"Naja Kai Sa ist Kassadins Tochter. Es macht zwar absolut keinen Sinn, da Malzahar sie dem Void geopfert hat um Kassadin zu bekehren, aber gut. Im neuen Lore ist Leben im Void ja möglich, was diesem gesamten Aspekt die Glaubwürdigkeit und die Bedrohung nimmt. \nFrüher war der Void -No Light, no sound, just dark dead cold. fand ich um einiges besser.","replies":[]}]}]}