{"poster":"LiikeMars","date":"2016-09-21T11:31:11.162+0000","title":"The Story Must Be Told! - Kampagne, Story-Koop-Modus uvm.","subforum":"Karten & Spielmodi","embed":{"description":"Spiel Champions Gegenst. Stats Beschw. Vasallen Monster Strukturen Karten Zauber Meister. Runen Skins Patches Forum Champions [edit] Historie Aktuelle Champion Rotation Woche 32 (23.08.2016 - 29.08.2016) Ahri Ashe Braum Cho'Gath Jarvan IV Kog'Maw Pantheon Skarner Thresh Zyra Neue Skins (Historie) Neuster Champion Hol dir jetzt die kostenlose League of Legends Wiki App!","url":"http://de.leagueoflegends.wikia.com/wiki/League_of_Legends_Wiki","image":"http://images.wikia.com/leagueoflegends/de/images/b/bc/Wiki.png"},"up_votes":2,"down_votes":1,"body":"**Liebste Kollegen an den M&auml;usen und Tastaturen, liebster und bester Support  hinter den Kulissen,**\n\nnach doch geraumer Spielzeit in League habe ich Riot lieben gelernt f&uuml;r das was sie erschaffen und will hiermit keinerlei Kritik anwenden oder etwas zugrunde machen, sondern eurer Inspiration f&uuml;r das was ihr tut mehr Raum geben. Ich bin mir sicher, dass in manchen eurer K&ouml;pfe dieser Wunsch lauert, nicht in jedermanns - schon klar, dennoch braucht ihr wahrscheinlich den Ansto&szlig; der Community, sonst wird sowas nie passieren\n\n**Und hier bringe ich das Thema mal zum Rollen:**\n\nEinen Story-Modus der durch die pregnanten Welten vom unersch&ouml;pflichem Lore f&uuml;hrt. Seien es die dunklen L&auml;nder von Noxus mit der Noxianischen Arena_ &quot;Die Zerfleischung&quot;_  und deren Feindschaft zum Inselstaat Ionia oder die demacianischen H&auml;user-Beziehungen oder der Yordlestadt Banle **UND UND UND ....**\nEs gibt nicht umsonst tausende Seiten Wikia allein auf Deutsch!\nDa steckt mehr als genug Grundlage zu einem (Koop-)Story-Modus drinnen.\n\nTechnisch gesehen ist das kein geringer Aufandt und die Anspr&uuml;che sind nicht gering, das kann sich wohl jeder Vorstellen. \n\nDas Projekt sollte vielleicht erst mit einer simplen Kampagne beginnen, bei der man sich keinen Champ mit seiner Geschichte Vornimmt, sondern eher die Kampagne in eine der Regionen legt, und die Auswahl der Champs auf diese Region begrenzt. \n\nIch will hier gar keine genaueren Vorstellungen erzwingen sondern nur Raum f&uuml;r die Diskussion geben.\n\nZudem will ich anmerken, dass sich dieser Gedanke dann von dem urspr&uuml;nglichen MOBA-Stil abhebt und in Richtung RPG geht, was Leage nie war und nie sein wird! \n\nDennoch fehlt es w&auml;hrend dem spielen an Lore, an Geschichte an Hintergrundinformationen - und das Internet flippt ja aus, wenn man ne Audio-Datei an nen gerstorbenen Blue h&auml;ngt und alle Welt f&auml;ngt an dar&uuml;ber zu r&auml;tseln was das wohl sein mag. \nIch meine - man hat ja genug Wikia-Seiten zu lesen, aber wer will denn** lesen **- Wir Gamer wollen erleben!, wollen die lebendig gewordenen Welten f&uuml;hlen, das B&ouml;se bezwingen, anfangen zu meucheln und selbst zum Schl&auml;chter werden!\n\n\nAber genug gebrabbelt, jetzt mal ehrlich:\n1. Denkt ihr, dass das realisierbar ist?\n2. Glaubt ihr, man w&uuml;rde dadurch etwas gewinnen?\n3. Bin ich der Einzige, der Bock auf sowas h&auml;tte? (Unter Voraussicht, dass ich hier mit MOBA-Gamern diskutiere )\n\n\nSch&ouml;nste Gr&uuml;&szlig;e, GL &amp; Have Fun\n\nEuer Mars\n{{item:1001}}","replies":[{"poster":"RM Heartmeander","date":"2016-09-21T12:40:10.025+0000","up_votes":2,"down_votes":0,"body":"Wäre sicher ne interessante Idee.\nMan könnte daraus auch einen Spezialmodus machen der z.B. eine Woche o.ä. läuft.\n\nOder wenn das zu aufwändig ist vielleicht so was kleines wie ne Co-op als Vasalle.\nWäre sicher Lustig xD\nZu 5 oder 6 (damit alle Vasallen) und man könnte jede Welle die Lane und Vasall wählen den man spielen will.\nZiel ist es halt Gegner einzupushen.\nMan könnte dem Vasall sagen was er angreifen soll.","replies":[{"poster":"LiikeMars","date":"2016-09-23T09:05:14.454+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RM Heartmeander,realm=EUW,application-id=cGRapXds,discussion-id=5K2Xjs4L,comment-id=0001,timestamp=2016-09-21T12:40:10.025+0000)\n>\n> Wäre sicher ne interessante Idee.\n> Man könnte daraus auch einen Spezialmodus machen der z.B. eine Woche o.ä. läuft.\n> \n\nDu hast mich nicht verstanden - die Map wäre eine Art Open World - In Richtung Diablo oder Titan Quest!\nErgo nichtmehr auf der MOBA-Map!","replies":[]}]},{"poster":"Rioyter","date":"2016-10-15T15:26:53.159+0000","up_votes":1,"down_votes":0,"body":"1. Nein, da man viel zu viel programmieren und designen muss.... Und das sich dann sicher wie WoW anfühlt.... wobei das evlt. Kostenlos wäre?!\n2. Ja klar aber nur einen kleinen Teil der Spielerschaft\n3. Du bist sicherlich nicht der einzige, aber ich bin nicht auf deiner Seite...\n(Bei Strife gibt es einen Story Modus für Einsteiger.... Um das Spiel kennen zu lernen.... Das war echt langweilig)","replies":[]},{"poster":"Uranbrennstab","date":"2016-09-21T12:45:34.061+0000","up_votes":1,"down_votes":0,"body":"Ich sehe als Hauptproblem eher das unbestätigte Lore. Riot werkelt munter an Hintergründe und macht viele Dinge neu. Da wäre es unrealistisch ein Spiel dazu zu machen.","replies":[{"poster":"LiikeMars","date":"2016-09-23T09:04:49.408+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Uranbrennstab,realm=EUW,application-id=cGRapXds,discussion-id=5K2Xjs4L,comment-id=0002,timestamp=2016-09-21T12:45:34.061+0000)\n>\n> Ich sehe als Hauptproblem eher das unbestätigte Lore. Riot werkelt munter an Hintergründe und macht viele Dinge neu. Da wäre es unrealistisch ein Spiel dazu zu machen.\n\nIch nehme stark an, dass du nicht die Hintergründe in JPEG Format meinst. \nCheck mal das Wiki aus, das ich verlinkt habe! - Einfach mal nach deinem Lieblings-Champ suchen!","replies":[{"poster":"Uranbrennstab","date":"2016-09-23T09:26:39.970+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LiikeMars,realm=EUW,application-id=cGRapXds,discussion-id=5K2Xjs4L,comment-id=00020001,timestamp=2016-09-23T09:04:49.408+0000)\n>\n> Ich nehme stark an, dass du nicht die Hintergründe in JPEG Format meinst. \n> Check mal das Wiki aus, das ich verlinkt habe! - Einfach mal nach deinem Lieblings-Champ suchen!\n\nIch hab das Lol Wiki inhaliert, ich weiß wovon ich rede. Ich sag als Beispiel nur Mount Targon oder Elise/Cassiopeia. Das ändert sich mit unter stark.","replies":[]}]},{"poster":"RM Heartmeander","date":"2016-09-21T13:07:41.930+0000","up_votes":1,"down_votes":0,"body":"Man kann ja einfach eine generale Richtung nehmen.\nz.B. Ionia und da nur Ionische Champs, die wechseln nicht einfach die Lore davon.","replies":[{"poster":"Uranbrennstab","date":"2016-09-21T16:13:46.575+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RM Heartmeander,realm=EUW,application-id=cGRapXds,discussion-id=5K2Xjs4L,comment-id=00020000,timestamp=2016-09-21T13:07:41.930+0000)\n>\n> Man kann ja einfach eine generale Richtung nehmen.\n> z.B. Ionia und da nur Ionische Champs, die wechseln nicht einfach die Lore davon.\n\nIch sag jetzt mal ganz vorsichtig Mount Targon. Von Superharten Spartanern zu Nachfahren von geboosteten Alien-Galaxis-Herrschern digitiert. Das war echt heftig, weil ich nicht im Mindesten verstehe warum. Das passt nicht und zieht das Niveau richtig runter. Ich meine sie sind jetzt Aspekte Intergalaktischer Super Avatare, die den Schmied des Universums getrollt haben und ihn mit komplett unrealistischen Drohungen bei der Stange halten, damit er für sie den Void bekämpft. U wat mate?! Klingt hart nach Scientology","replies":[]}]}]},{"poster":"Patter1991","date":"2016-09-21T11:37:59.278+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LiikeMars,realm=EUW,application-id=cGRapXds,discussion-id=5K2Xjs4L,comment-id=,timestamp=2016-09-21T11:31:11.162+0000)\n>\n> 1. Denkt ihr, dass das realisierbar ist?\n\nNein. Bei weit über 100 Champs mit ihren eigenen Stories, dazu dann noch Story, die nichts mit den Champs zu tun hat... Das wäre genug Material für dutzende Spiele. Und selbst wenn, dann wird Riot das garantiert nicht gratis raushauen sollen.\nAußerdem können die Leute von Riot MOBA. Ob sie RPGs können? Keine Ahnung, unwahrscheinlich, sind komplett unterschiedliche Genres.","replies":[{"poster":"LiikeMars","date":"2016-09-23T09:07:51.433+0000","up_votes":1,"down_votes":0,"body":"Ja, die Vielzahl an Ereignissen sehe ich komplett ein - Ist aber alles machbar! Das spiel soll ja in dem Sinne abzuspeichern sein - also einen Questlog haben, bei dem man nach belieben weitermachen kann. Also auch Gegenstände sammeln etc. und verschiedenste Charaktere könnten nur angerissen sein, wie zum Beispiel der Noxus-General Swain - der kannn ja durchgehend im Hintergrund der Kopf hinter einem bösem Angriff sein!\nDa sind keine Grenzen gesetzt, weil zu viel Material da wäre!\n\nZudem braucht man ja nur den richtigen Freak einzustellen (Nicht negativ gemeint). Man nehme sich Lore-Experte und Schreiber Michael Kirkbride bei der Elder Scrolls Serie zum Vorbild! \n\nZum zweiten Punkt: Man muss nur die richtigen Leute einstellen - die, die dem Genre verbunden sind und Bock auf die Sache haben. Nicht komplett neue Teams aufstellen, eher die richtigen darauf ansetzen!","replies":[]}]}]}