{"poster":"Lunar Lunacy","date":"2018-03-10T07:57:27.097+0000","title":"\"U BANNED KAI'SA, TIME TO TROLL\" 4 games in a row...","subforum":"Gameplay","up_votes":56,"down_votes":19,"body":"Stop this shit. If the champion you want to play gets banned by a teammate that&#039;s no excuse to purposely throw the game and ruin it for everyone","replies":[{"poster":"Stars Shaper","date":"2018-03-10T08:37:01.484+0000","up_votes":56,"down_votes":14,"body":"It isn't but it's also BS to ban your team mate pick.\n\nPpl go in draft because they don't want to get lucky and instalock first the new champion in that toxic waste pit that blind pick is. So don't be the douchebag and don't ban your team mates pick.","replies":[{"poster":"WubbaLubbaDubDab","date":"2018-03-10T08:59:35.096+0000","up_votes":10,"down_votes":30,"body":"its their problem dude,kai sa is a new champ and i always ban new and reworked champs in the beginning noone knows how to play with or against i dont want to risk it,if that player is a garbage and want to troll then its his problem noone else's","replies":[{"poster":"AlienPrimate","date":"2018-03-10T09:01:46.534+0000","up_votes":25,"down_votes":18,"body":"How is anyone supposed to learn the new champion if no one gets a chance to play them?  I personally think new champs shouldn't be allowed to be banned for the first 2 weeks.","replies":[{"poster":"z63XnLCMwX","date":"2018-03-10T10:45:09.246+0000","up_votes":19,"down_votes":7,"body":"> [{quoted}](name=AlienPrimate,realm=NA,application-id=3ErqAdtq,discussion-id=vsX8W7zL,comment-id=000200000000,timestamp=2018-03-10T09:01:46.534+0000)\n>\n> How is anyone supposed to learn the new champion if no one gets a chance to play them?  I personally think new champs shouldn&#x27;t be allowed to be banned for the first 2 weeks.\n\nPlay normals or bots? Ranked isn't meant to be a practise playground","replies":[{"poster":"BeatzBoyFTW","date":"2018-03-10T10:48:45.330+0000","up_votes":26,"down_votes":1,"body":"Normal Draft is a thing.....","replies":[{"poster":"Beacon Academy","date":"2018-03-10T13:19:37.674+0000","up_votes":3,"down_votes":5,"body":"not in Japan it isn't","replies":[{"poster":"BeatzBoyFTW","date":"2018-03-10T13:30:40.606+0000","up_votes":8,"down_votes":0,"body":"No one in this thread site is from a Japanese server anyway, so what's the point.","replies":[{"poster":"Beacon Academy","date":"2018-03-10T13:54:08.797+0000","up_votes":6,"down_votes":2,"body":"Are you assuming my server D:\n\nIn all seriousness though there is only blind pick, flex, and solo/duo queues in Japan","replies":[{"poster":"Sp33d Zer0","date":"2018-03-11T01:38:13.324+0000","up_votes":2,"down_votes":0,"body":"I dont need to assume it, it's posted next to your name","replies":[]}]},{"poster":"SociaI Justice","date":"2018-03-10T15:43:43.489+0000","up_votes":3,"down_votes":1,"body":"its not that no one on this site is from the japanese server its more of the fact that we cannot comment on na / eu boards while being logged in to our server, which is the case for me for example.","replies":[]}]}]}]}]},{"poster":"Captainn Ginyu","date":"2018-03-10T09:47:21.393+0000","up_votes":11,"down_votes":9,"body":"> [{quoted}](name=AlienPrimate,realm=NA,application-id=3ErqAdtq,discussion-id=vsX8W7zL,comment-id=000200000000,timestamp=2018-03-10T09:01:46.534+0000)\n>\n> How is anyone supposed to learn the new champion if no one gets a chance to play them?  I personally think new champs shouldn&#x27;t be allowed to be banned for the first 2 weeks.\n\nthey can learn to play them\nin normals or non-ranked draft \nyou dont go to ranked to LEARN new champions at that point your just gimping your team an the people who want to climb","replies":[{"poster":"AlienPrimate","date":"2018-03-10T09:48:48.687+0000","up_votes":18,"down_votes":2,"body":"The OP never said this was ranked.  I had assumed it was normal draft.","replies":[{"poster":"Captainn Ginyu","date":"2018-03-10T09:49:46.322+0000","up_votes":9,"down_votes":2,"body":"> [{quoted}](name=AlienPrimate,realm=NA,application-id=3ErqAdtq,discussion-id=vsX8W7zL,comment-id=00020000000000000000,timestamp=2018-03-10T09:48:48.687+0000)\n>\n> The OP never said this was ranked.  I had assumed it was normal draft.\n\ni assumed it was ranked \npeople just LOOOOOOOOOOVE playing her for there first time in ranked","replies":[{"poster":"SooFr0sty","date":"2018-03-10T09:51:01.886+0000","up_votes":2,"down_votes":15,"body":"Went 7/0/7 my first game","replies":[{"poster":"Stars Shaper","date":"2018-03-10T10:01:35.344+0000","up_votes":8,"down_votes":0,"body":"Single game performance doesn't really matter. I've been a monster on some first game experiences with champions I didn't know for shizzle and realized that after 4-5 games where I hated myself for even thinking about picking them.","replies":[]}]}]}]}]},{"poster":"HyperZEROXL","date":"2018-03-10T09:54:29.164+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=AlienPrimate,realm=NA,application-id=3ErqAdtq,discussion-id=vsX8W7zL,comment-id=000200000000,timestamp=2018-03-10T09:01:46.534+0000)\n>\n> \n\nDon't forget...When the people DO get her in normals, the whiney people dodge.","replies":[]},{"poster":"Ozag the Mighty","date":"2018-03-10T19:09:44.749+0000","up_votes":2,"down_votes":1,"body":"AI battles are for learning new champs to learn at least how their kit works. I've never went straight into PVP on a new champs cause I'll just lose the lane. I just play a few games of bots to at minimum see how the kit works.","replies":[{"poster":"Gibberwatt","date":"2018-03-12T18:29:57.569+0000","up_votes":1,"down_votes":0,"body":"Thats you though.  I personally grab a new dude, then play passively in lane.  Honestly I see no point in bot matches to learn their kit - nothing I'll learn in the 15 minutes I have b4 my team ends will be anything I couldn't learn by reading my abilities, sitting in my chair for a few minutes, and thinking to myself:\n\n\"What can I do with this?\"","replies":[]}]},{"poster":"Purejoyce","date":"2018-03-10T18:27:10.326+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=AlienPrimate,realm=NA,application-id=3ErqAdtq,discussion-id=vsX8W7zL,comment-id=000200000000,timestamp=2018-03-10T09:01:46.534+0000)\n>\n> How is anyone supposed to learn the new champion if no one gets a chance to play them?  I personally think new champs shouldn&#x27;t be allowed to be banned for the first 2 weeks.\n\n\"I personally think\" they shouldn't be allowed to be played outside of a co-op games, what now?","replies":[{"poster":"AlienPrimate","date":"2018-03-10T18:50:17.966+0000","up_votes":4,"down_votes":2,"body":"I think you need help if you actually think that.","replies":[{"poster":"Purejoyce","date":"2018-03-10T18:51:35.554+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=AlienPrimate,realm=NA,application-id=3ErqAdtq,discussion-id=vsX8W7zL,comment-id=00020000000000040000,timestamp=2018-03-10T18:50:17.966+0000)\n>\n> I think you need help if you actually think that.\n\nRight back at you, buddy.","replies":[]}]}]},{"poster":"WubbaLubbaDubDab","date":"2018-03-10T14:59:08.862+0000","up_votes":2,"down_votes":1,"body":"play them in normal games not ranked,ranked isnt for testing new stuff go to normal and do whatever u want go play soraka adc for all i care but in ranked its normal to ban new stuff","replies":[]}]},{"poster":"Stars Shaper","date":"2018-03-10T09:20:54.805+0000","up_votes":5,"down_votes":1,"body":"Ppl banning their choice are their problem. And defending this attitude is just more Bull Fertilizer. If I want to learn whatever new champion (or old ones I never played) why should I be forced to play in an enviroment where every1 rushes mid because \"FIRST MID\", \"NO I FIRST PICKED MID\", etc. ?\n\nOnce again, I don't condone trolling but banning a team mate's choice in normal draft is as much as BS as trolling.","replies":[{"poster":"WubbaLubbaDubDab","date":"2018-03-10T14:58:11.243+0000","up_votes":6,"down_votes":1,"body":"im talking about ranked games,not normal.normals are to try new stuff but i dont want this kind of stuff in my ranked games,its their problem not mine","replies":[{"poster":"Stars Shaper","date":"2018-03-10T15:17:12.766+0000","up_votes":2,"down_votes":0,"body":"That's another story and I agree with new champion not being brought into Ranked at least for 2 weeks from their release.","replies":[{"poster":"Flawless Fetus","date":"2018-03-10T18:52:33.487+0000","up_votes":4,"down_votes":1,"body":"Even after two weeks you might get first timers. Imo champs should require a certain amount of mastery to be played in ranked - similar to how Smite does it. Someone first time Kaisa isn't any less detemental than someone first timing any other champ","replies":[]}]}]}]},{"poster":"Supreme Senpai69","date":"2018-03-10T17:56:24.321+0000","up_votes":2,"down_votes":1,"body":"If its just normals then why? By all means ban it if your team won't get it or doesn't want it. But that's how you learn. If you never play with or against a new champion, that champion will ALWAYS be new to you.","replies":[{"poster":"Purejoyce","date":"2018-03-10T18:28:43.960+0000","up_votes":1,"down_votes":7,"body":"> [{quoted}](name=Supreme Senpai69,realm=NA,application-id=3ErqAdtq,discussion-id=vsX8W7zL,comment-id=000200000003,timestamp=2018-03-10T17:56:24.321+0000)\n>\n> If its just normals then why? By all means ban it if your team won&#x27;t get it or doesn&#x27;t want it. But that&#x27;s how you learn. If you never play with or against a new champion, that champion will ALWAYS be new to you.\n\nSo if some people don't play ranked, they're supposed to have their games shit on because \"it's normal\"? Great logic.","replies":[{"poster":"Supreme Senpai69","date":"2018-03-10T18:33:58.047+0000","up_votes":4,"down_votes":1,"body":"1) Implying having a Kai'Sa in your game is having your game shit on\nGreat logic. \n2) Implying that the people who don't play ranked agree with this sentiment \nI don't play ranked. \n3) Implying that the reason people ban her is to avoid a game not being fun\nThey ban her to avoid losing LP. In ranked. \n\n\nBan her if you want. But if you're doing it because your first pick ADC teammate wants to play her, you're not being very logical.","replies":[{"poster":"Purejoyce","date":"2018-03-10T18:48:01.344+0000","up_votes":1,"down_votes":6,"body":"> [{quoted}](name=Supreme Senpai69,realm=NA,application-id=3ErqAdtq,discussion-id=vsX8W7zL,comment-id=00020000000300000000,timestamp=2018-03-10T18:33:58.047+0000)\n>\n> 1) Implying having a Kai&#x27;Sa in your game is having your game shit on\n> Great logic. \n> 2) Implying that the people who don&#x27;t play ranked agree with this sentiment \n> I don&#x27;t play ranked. \n> 3) Implying that the reason people ban her is to avoid a game not being fun\n> They ban her to avoid losing LP. In ranked. \n> \n> \n> Ban her if you want. But if you&#x27;re doing it because your first pick ADC teammate wants to play her, you&#x27;re not being very logical.\n\n1) Then why make an argument that \"it's just normals\"? It applies to ranked games too, but somehow you singled out one gammode -suddenly you claim having new champ in your team is totally fine? Great logic indeed.\n2) What?\n3) Yeah, because people usually play normals to lose, lmao.\n\nI did and I will, thanks for \"permission\". It is very logical, it's you who goes back on something your wrote in your previous post (1.) to make it seem like it's illogical :)","replies":[{"poster":"Supreme Senpai69","date":"2018-03-10T21:23:23.944+0000","up_votes":5,"down_votes":1,"body":"Losing isn't the end of the world on normals. Because you aren't scored based on LP. Therefore it's the perfect environment to learn how to play with and against her. If you don't understand this, that's just on you.","replies":[]}]}]}]}]}]},{"poster":"RainbowIcee","date":"2018-03-10T13:41:56.310+0000","up_votes":3,"down_votes":1,"body":"this depends on the situation, if i don't wanna play vs {{champion:63}} and my team mates pick second and wants to pick him I have a good enough excuse to ban him because he is a popular champ.","replies":[{"poster":"LiteUpSketchers","date":"2018-03-10T13:51:16.981+0000","up_votes":1,"down_votes":2,"body":"As someone playing Brand right now, fuck you and I hope to god I'm not queuing with you","replies":[{"poster":"RainbowIcee","date":"2018-03-10T17:08:58.865+0000","up_votes":1,"down_votes":0,"body":"shouldn't you be used to it by now, brand is pretty strong rn is given most people don't wanna play vs him so they'd ban him.","replies":[{"poster":"Hammermancer","date":"2018-03-10T17:30:40.562+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RainbowIcee,realm=NA,application-id=3ErqAdtq,discussion-id=vsX8W7zL,comment-id=0002000200000000,timestamp=2018-03-10T17:08:58.865+0000)\n>\n> shouldn&#x27;t you be used to it by now, brand is pretty strong rn is given most people don&#x27;t wanna play vs him so they&#x27;d ban him.\n\nnobody bans new champs because they're worried they're too strong anymore\n\nthings are too complicated these days, remember how we all thought ornn was trash?","replies":[{"poster":"Flawless Fetus","date":"2018-03-10T18:54:34.077+0000","up_votes":2,"down_votes":0,"body":"Tbf, he was. He got 3 rounds of massive buffs; then he was a problem. Lol.","replies":[{"poster":"ninjaroxas","date":"2018-03-10T21:09:21.170+0000","up_votes":3,"down_votes":0,"body":"Granted he still wasn't as bad as people made him out to be. A better example is tailyah, who I'm pretty sure is weaker then she was on realease but still strong","replies":[]}]}]}]}]}]}]},{"poster":"Captainn Ginyu","date":"2018-03-10T09:45:47.238+0000","up_votes":22,"down_votes":4,"body":"i just ban kai'sai from ranked for a week straight i tend to let people know as soon as pop into the lobby with a copy pasted message i dont really care if that person has been playing her for hours or played her on pbe an now suddenly shes that person main i refuse to believe it takes someone 2 days to completely master a champion ontop of the fact that theres ALWAYS first timers trying to play her in ranked games an im just not dealing with that\n\nif they wana play her that bad go play her in normals other wise prepared to be disapointed ","replies":[{"poster":"SooFr0sty","date":"2018-03-10T09:51:35.700+0000","up_votes":3,"down_votes":12,"body":"You've always played champs in ranked that you've played before?","replies":[{"poster":"RocketRelm","date":"2018-03-10T14:12:13.382+0000","up_votes":11,"down_votes":2,"body":"You don't?\n\nLike, knowing the fundamentals of your champion before going into ranked is just courtesy, to your own MMR as much as to your allies.\n\nThe one time I first-timed a champion in Ranked was Top Lane Malphite some years back, and even that was only because he takes the brain cells of pressing a [R]ock to play.","replies":[]},{"poster":"Captainn Ginyu","date":"2018-03-10T09:59:01.971+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=SooFr0sty,realm=NA,application-id=3ErqAdtq,discussion-id=vsX8W7zL,comment-id=00040000,timestamp=2018-03-10T09:51:35.700+0000)\n>\n> You&#x27;ve always played champs in ranked that you&#x27;ve played before?\n\ni pretty much know how to play a little bit of everybody at this point iv been playing the game long enough","replies":[]}]}]},{"poster":"Fear the Kayn","date":"2018-03-10T08:14:12.351+0000","up_votes":9,"down_votes":12,"body":"Yeah I've starting banning her too, shes honestly pretty useless right now and I don't want her on my team.","replies":[{"poster":"zacktootall","date":"2018-03-10T08:31:57.883+0000","up_votes":9,"down_votes":15,"body":"your part of the problem then. let them play the craz to play the new champ will die off in a few weeks anyway. so don't taunt them by banning it your only dragging those weeks out.","replies":[{"poster":"Fear the Kayn","date":"2018-03-10T08:42:14.455+0000","up_votes":22,"down_votes":3,"body":"In norms I guess, but in ranked sorry I'm not letting people play a champ that has been out for less than a week and has a sub 40% winrate.","replies":[{"poster":"zacktootall","date":"2018-03-10T08:43:53.425+0000","up_votes":4,"down_votes":1,"body":"fair enough","replies":[]}]}]}]},{"poster":"Rexxiee","date":"2018-03-10T18:51:58.728+0000","up_votes":5,"down_votes":0,"body":"If they were going to pick kai sa in ranked their intent was to troll anyway, didnt change anything.","replies":[]},{"poster":"Leaf on Bush","date":"2018-03-10T13:43:51.290+0000","up_votes":10,"down_votes":6,"body":"So you have no respect for your teams decision to play Kai'Sa but you expect them to behave perfectly....that's Int-eresting.\n\nAll i can see is trolls on both sides. If I wanted to play Kai'Sa and some self-righteous douchebag bans her in a normal game I would just dodge or play something that is completely off-meta if I am in the mood but I would still try to win. I don't even ban champions in normals...at all. In ranked only sometimes, but only depending on the match-up, new champions are not a concern. Banning new champions is for insecure losers tbh.\n\nPS: and I know what some of you will say \"But... QQ they ruin games QQ, new Kai'Sa players are the reason that I can't climb.\"\nNo they are not, you are just a loser. Statistically the Kai'Sa players even out on both sides, you get free wins and losses 50/50 but at least you can experience the new champion and explore the strengths and weaknesses. If a Kai'Sa player is really too bad, it's only bad for them because they will 100% drop, you won't.... unless you are just a loser.\n\nBut oh wait I know what are you gonna say now \"if I ban Kai'Sa on my team, there can still be Kai'Sa players on the enemy team so it helps me win more\" \nWell yes, but if you rely on that for winning games you are still just a loser.","replies":[]},{"poster":"LuxannaVeritas","date":"2018-03-10T17:03:47.379+0000","up_votes":5,"down_votes":2,"body":"In response to that, I feel like banning a champion that a teammate wants to play is also trolling. \n\nWhile trolling because your champion got banned is unacceptable, the person who banned the champion themselves isn't making the game better either. They're ruining the game for that one teammate, which is extremely rude.\n\nLet people play what they want to play, even if it's a new champion. Banning a champion because \"you don't want to deal with it\" is basically saying \"I don't want to get better at the game and adapt.\" I want to learn how to play as/with Kai'Sa, but I can't when my team straight up thinks that they know best.","replies":[]},{"poster":"SilentBomber","date":"2018-03-12T09:06:36.806+0000","up_votes":2,"down_votes":0,"body":"I feel that Riot should rethink their  opinion about allowing new champions to be played in Ranked.I as well do not wish to allow players playing new champions 1-2 days after their release.\n\nIt gives an awful experience and results into feeding most of the times.More awful is that even if we report them,they are just considered bad players and do not get punished  even if they really give up on the game or brake our balls to FF(saw that countless times).\n\nWhile it's true that players NEED to play them to learn,in ranked it is truly awful and encourages bad manners or even trolling the game because someone didn't get to play the X new released champion.If you ban that champion you get reported for provoking your teammate and results into games being destroyed intentionally by that dude that got tilted.","replies":[]}]}