{"poster":"ousheslaw","date":"2017-05-18T16:22:45.873+0000","title":"kommt das Tribunal zurück?","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":0,"body":"ich wei&szlig; dass das Tribunal schon seit langem nicht mehr aktiv ist und soweit ich wei&szlig; wird das auch f&uuml;r n&auml;chste so bleiben wird.Ich w&uuml;rde mich freuen wenn mir wemand sagen k&ouml;nnte wieso das Tribunal heruntergefahren wurde und ob es jemals wieder benutzbar wird.Denn ich pers&ouml;nlich fand das Prinzip hinter dem Tribunal ziemlich cool und w&uuml;rde mich sehr freuen wenn es zur&uuml;ckkommt","replies":[{"poster":"Yamató","date":"2017-05-18T21:19:38.560+0000","up_votes":1,"down_votes":0,"body":"Kann jemanden dem Silber Noob (mir) erklären was ein Tribunal ist`?","replies":[{"poster":"Sirrkas","date":"2017-05-18T21:36:05.106+0000","up_votes":2,"down_votes":0,"body":"Das Tribunal war eine Art Abstimmung der Spieler über Fehlverhalten. Die Grundlagen waren etwa wie folgt. Jeder Spieler ab einer gewissen Stufe (20 müsste das gewesen sein), konnte sich dort anmelden und über gemeldete Spiele abstimmen. Dort sah man dann Chatlogs von Spielern, die gemeldet wurden, inklusive der Gründe, warum sie gemeldet wurden, mit den Kommentaren der Melder dazu. Der Chatlog hat das ganze Spiel gezeigt. Man könnte täglich bis zu 20 mal abstimmen. Die Abstimmung war erst nach ein paar Sekunden möglich, war aber nicht mehr, als eine halbe Minute. \n\nJeder Fall musste von mehreren Tribunen bearbeitet werden, ehe es zu einer Entscheidung kam. Abhängig davon, wie die Tribune gestimmt haben, wurden Spieler bestraft oder begnadigt. \n\nWenn ich mich Recht erinnere gab es folgende Strafen 1 Tagesbann, 3 Tagebann, 7 Tagebann, 14 Tagebann, Permabann. Man konnte Stufen überspringen oder mehrfach durchlaufen. Theoretisch könnte man also jedes mal einen 1 Wochenbann erhalten. \n\nAm Anfang gab es (ich glaube 5) EP pro Fall, bei dem man mit der Mehrheit überein gestimmt hat. Man konnte die Namen aller Spieler im Chatlog sehen und dadurch theoretisch auch die Leute gezielt adden und für ihren Flame flamen. \n\nSpäter wurden die EP abgeschafft, das hat die Qualität und sogar die Beteiligung erhöht. Auch die Namen wurden nicht mehr angezeigt. Irgendwann gab es auch eine Rangliste für besonders fleißige und genaue Tribune (die oft mit der Mehrheit überein gestimmt haben). \n\nProblematisch daran war aber, dass es auch Spieler gab, die ewig lange nicht belangt wurden. Manchmal habe ich Chatlogs gesehen, die teilweise über ein halbes Jahr zurück lagen. Da es auch nie genug Spieler gab, die abgestimmt haben, wurde auch immer nur die Spitze des Eisbergs bearbeitet. \n\nDas Tribunal war zwar laut Riot genauer und auch strenger, als es Riotmitarbeiter gewesen wären. Allerdings war die Verzögerung zwischen Fehlverhalten und Strafe viel zu groß. Deswegen wurde dann die Chatanalyse entwickelt. Die ist im Instantfeedbacksystem und wurde mit den Daten des Tribunals gefüttert und passt sich zusätzlich durch die Reports der Spielerschaft weiter an. Inklusive der Möglichkeit manuell einzugreifen, sollte das System etwas neues übersehen oder falsch bewerten.\n\nDarüber nichts zu wissen, hat aber kaum etwas mit deiner Platzierung zu tun. Das liegt auch schon Jahre zurück. \n\nWenn du magst, kannst du auch hier einen Blick reinwerfen:\n\nhttp://alpha.volu-eu.org/pbkb_general_user_view.php?art=6\n\nOh, laut der Seite waren das 10 EP je bearbeiteten Fall. ","replies":[{"poster":"Yamató","date":"2017-05-19T23:34:43.162+0000","up_votes":1,"down_votes":0,"body":"Danke für die Erklärung ^^","replies":[{"poster":"Sirrkas","date":"2017-05-20T00:12:23.245+0000","up_votes":1,"down_votes":0,"body":"Keine Ursache.","replies":[]}]}]}]},{"poster":"Humpelstilzche","date":"2017-05-18T16:26:39.526+0000","up_votes":1,"down_votes":1,"body":"Momentan kann man diese Frage ziemlich sicher mit \"nein\" beantworten. Riot arbeitet momentan nicht am Tribunal und hat auch keine Pläne dies in naher Zukunft zu tun.\n\n(Aussage von Ghostcrawler vor einigen Wochen)","replies":[{"poster":"ousheslaw","date":"2017-05-18T17:07:17.731+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=YnZkMR0R,discussion-id=U6I6FknW,comment-id=0000,timestamp=2017-05-18T16:26:39.526+0000)\n>\n> Momentan kann man diese Frage ziemlich sicher mit &quot;nein&quot; beantworten. Riot arbeitet momentan nicht am Tribunal und hat auch keine Pläne dies in naher Zukunft zu tun.\n> \n> (Aussage von Ghostcrawler vor einigen Wochen)\n\ndanke \nich finds aber ziemlich schade","replies":[{"poster":"thefire7","date":"2017-05-18T17:47:12.102+0000","up_votes":1,"down_votes":1,"body":"wieso? Ich finde das System leistet gute Arbeit.","replies":[{"poster":"MGP","date":"2017-05-18T22:00:14.727+0000","up_votes":1,"down_votes":0,"body":"Aus mehreren Gründen:\nDas System ist fehlerhaft, es ist zwar besser als das alte aber immernoch Fehlerhaft.\nBeispiel man kann auch unglaublich toxic sein indem man einfach nur annoying ist. Du musst den gegner nicht Beleidigen oder dein Team Flamen du kannst auch einfach deinen Gegner nerven in dem du Konversation betreibst die ihn zum tilten bringt. Ist nicht nett, sollte gepunished werden, wird vom System jedoch nicht erkannt.\n\nEs war ein netter Zeitvertreib während der Queue Time\n\nEs war doch auch der ein oder andere ganz wizige Fall darunter\n\num nur ein paar Punkte zu nennen","replies":[]}]},{"poster":"Reformedboiiiamk","date":"2017-05-19T00:12:13.107+0000","up_votes":1,"down_votes":2,"body":"guter Witz hahahahahahh","replies":[]}]}]},{"poster":"Oriius","date":"2017-05-18T18:14:29.275+0000","up_votes":2,"down_votes":3,"body":"Das jetzige System ist einfach purer müll daher wäre ich schon dafür jedoch wird das vermutlich wenn überhaupt nicht so schnell wiederkommen.","replies":[{"poster":"Pure Cynicism","date":"2017-05-18T19:21:05.365+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Oriius,realm=EUW,application-id=YnZkMR0R,discussion-id=U6I6FknW,comment-id=0001,timestamp=2017-05-18T18:14:29.275+0000)\n>\n> Das jetzige System ist einfach purer müll daher wäre ich schon dafür jedoch wird das vermutlich wenn überhaupt nicht so schnell wiederkommen.\n\nWieso ist das System Müll?","replies":[{"poster":"Oriius","date":"2017-05-19T08:43:39.216+0000","up_votes":2,"down_votes":1,"body":"Ganz einfach .... AFk = report nächste Runde haste den gleichen wd im Team wd afk oder einfach inting noch n report ... so damit sind wir im optimalfall bei 18 reports ... so passiert immer noch nichts ... so und mit etwas Pech kriegste den typen noch n 3. mal rein wenn der Leavebuster nicht vorher einsetzt sprich ohne Leavebuster könnten gefühlt einige Leute jede Runde afk gehen und denen passiert nichts.","replies":[]}]},{"poster":"Reformedboiiiamk","date":"2017-05-19T00:14:51.928+0000","up_votes":1,"down_votes":2,"body":"Da muss man dir absolut recht geben, jedesmal wenn ich einen im Team habe der durchgehend in den Turm vom Gegner rennt passiert absolut nichts. Beleidigt man dann aber im Chat einen Mitarbeiter oder Riot an sich ist das geheule natürlich wieder groß. Super System ;)","replies":[]}]},{"poster":"sir0xxx","date":"2017-05-18T21:51:57.886+0000","up_votes":1,"down_votes":0,"body":"Ich melde jemanden bzw reporte wenn derjenige wirklich rein suckt oder sehr am flamen/inten/bedrohen ist. Bin ein recht ruhiger typ in diesem Fall und wenn ich reporte dann sollte derjenige auch eine bestimmte Strafe die Riot dann bestimmt bekommen, aber soweit davon, noch nie eine Meldung bekommen oä. Ich finde es in dieser Perspektive nutzlos denn wenn jemand dich so hart anmotzt wenn du einen schlechten Tag hast bzw. ein schlechtes Spiel was jedem mal passieren kann und passiert, dich und deine Familie zu beleidigen und auch dir Krebs im Alter von 20-30 wünscht, dies kann ich allerlei nicht leiden aber da denke ich mir, dass die Leute die einmal ragen gebannt werden und die es immer tun einfach davon kommen.","replies":[]},{"poster":"AchimedesII","date":"2017-05-18T21:48:58.899+0000","up_votes":1,"down_votes":0,"body":"Wozu wir haben doch einen gerichtssaal....","replies":[]}]}