{"poster":"SeT SeTSeTSeTSeT","date":"2016-02-04T21:56:03.242+0000","title":"Problem an Dynamic Q - Rollenwahl vs. letztendliche Rollenzuweisung","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":1,"body":"n&#039;Abend,\n\nmir ist aufgefallen, das etwas an dem derzeitigen Zuweisungssystem ge&auml;ndert werden sollte.\n\nAn und f&uuml;r sich ne Tolle Idee, keine Frage. Hatte sogut wie keinen Troll mehr oder jemand, der einem den Spielspa&szlig; schon in der champselect nimmt, da er seine Rolle nicht bekommt.\n\nIch selbst bin Jungle main und bis letzte Season war Support meine Ausweichrolle. Mir macht es an und f&uuml;r sich nichts aus, Support zu spielen jedoch sollte man auch nach 6 Spielen mal seine Mainrolle bekommen und im allgemeinen sollte das wohl eher andersrum sein, oder?\n\nIch selbst weis, dass Jungle die meistgespielte Rolle ist (kurz gefolgt von Midlane) und Support eben (leider immernoch) die am wenigsten. {{sticker:slayer-jinx-unamused}} \n\nAber gerade darum sollte man sich aus meiner Sicht um die Zuweisungen des Systems k&uuml;mmern. Ich selbst habe nach diesem einen Tag mit 6x Support und 1x Jungle entschieden, dass ich von da an Jungle/Mid angebe, da dass am meisten Sinn macht. Klappt soweit auch gut, jedoch muss ich mich nun langsam an die Rolle des Midlaners rantasten (was in meiner derzeitigen mid-diamond elo nicht einfach ist, da dort schon ein mechanischer Unterschied zu normalgames herrscht, in denen man &uuml;ben k&ouml;nnte), obwohl ich darauf eigentlich garnicht so Lust habe und viel lieber als Ausweichrolle Supporten w&uuml;rde.{{sticker:zombie-nunu-tears}} \n\nDa ich aber keinen Support mehr angeben kann (au&szlig;er ich habe wirklich Lust auf n Supportgame), finde ich das schon sehr schade.\n\nMir selber f&auml;llt im Moment nicht direkt ein L&ouml;sungsansatz ein (Verst&auml;rkung der Prio w&uuml;rde ja aufs gleiche rauslaufen, genauso wie wenn man einzelne rollen verst&auml;rkt), aber ich wollte es auch nur einmal anmerken, da mir das am Herzen lag.\n\nTldr : &Auml;nderung am derzeitigen Zuweisungssystem, da unausgeglichen (Bsp: Jungle am beliebtesten, Sup am wenigsten - gebe jgl/sup an und du bekommst zu einer hohen %-Zahl die sup-rolle)\n\nGr&uuml;&szlig;e","replies":[{"poster":"Firebreeze","date":"2016-02-06T01:33:45.905+0000","up_votes":2,"down_votes":0,"body":"ich hatte mich so auf das neue system gefreut...weil ich dachte endlich hören die ständigen diskussionen im chat auf....\n\nich bin main-sup...kann und möchte nur diese position spielen...aber ständig werde ich auf meine ausweichrolle geschickt....die ich natürlich nicht behersche....und muss dann gegen irgenwelche tryhards spielen gegen die ich natürlich keine chance habe...\n\nnun hab ich die letzten beiden spiele gedoged....(ausweichrolle) ist es das was riot mit dem neuen system erreichen wollte....das man gezwungen wird rollen zu spielen die man nicht kann und dann die lust am spiel verliert...denn darauf läuft es hinaus...\n\nvielen dank rito...^^","replies":[]},{"poster":"KeylanX","date":"2016-02-05T11:18:57.057+0000","up_votes":2,"down_votes":0,"body":"Ich kann mich mit der second Lane einfach nicht anfreunden. Ich spiele keine rankeds und in normals möchte ich einfach spielen was mir Spass macht (und zwar Supporter). Heute Morgen mal wieder \"Zwangsmitte\": 0/14/6 gegen Jhin aus dem Match. Mir reichts, ich mach das nicht mehr mit. Tut mir leid um die Wartezeit meiner Mitspieler, aber von jetzt an dodge ich die second Lane bis zum Permabann!\n\nZwang in einem Spiel... gute Idee Riot.","replies":[]},{"poster":"You Got My Name","date":"2016-02-09T11:27:04.043+0000","up_votes":1,"down_votes":0,"body":"Gleiche, was die Rollen verteilung angeht.\nVon denn letzten 6 Rankeds, hab ich 2 mal meine main rolle kommen ( Jgl ).\nWenn man sowas wie Support auf secundary hat,ist man so gut wie immer support (hatte das mal 6-7 games in folge).\n{{sticker:zombie-brand-mindblown}} \n\n\n@SiskoD  Es hat nichts mit jammern oder \"lernt ne second lane\" , sondern es geht um das System, weil es ja nicht sein kann dass ich meine Main rolle zu ca.33% bekomme von denn letzten 6 games / allgemein.\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"TexxAvery","date":"2016-02-05T11:05:14.859+0000","up_votes":1,"down_votes":0,"body":"bei mir das gleiche. Ich möchte gerne adc spielen u gebe als sekundär supp an und bis jetzt hatte ich kein einziges match als adc. Aber immer noch besser als früher.","replies":[]},{"poster":"Chipsdose","date":"2016-02-04T23:21:09.760+0000","up_votes":1,"down_votes":0,"body":"Same problem.\nWäre besser, wenn man auch nur eine Lane auswählen könnte und dafür länger warten müsste. Aber dan spielt warscheinlich keiner mehr supp :D","replies":[]},{"poster":"SiskoD","date":"2016-02-06T11:11:43.111+0000","up_votes":1,"down_votes":1,"body":"Das gejammer...dan lernt ne second lane...puh","replies":[]}]}