{"poster":"Rydia Junior","date":"2019-01-23T23:55:05.220+0000","title":"Rydia contra el Hantavirus","subforum":"Streaming & videos","embed":{"description":"Welcome to RydiaOM's channel on Twitch. Watch them stream League of Legends and other content live and join the community!","url":"https://www.twitch.tv/rydiaom","image":"https://static-cdn.jtvnw.net/jtv_user_pictures/229a9242-720b-4f5d-974d-221de04196a4-profile_image-300x300.png"},"up_votes":3,"down_votes":3,"body":"Buenas noches querida comunidad, en vista de los recientes y crecientes casos de hantavirus en Argentina, he decidido comenzar por casa y terminar esta pretemporada en la lucha contra las ratas t&oacute;xicas del servidor.\r\nEste es un Stream did&aacute;ctico donde lo pasamos bien en el chat, discutimos estrategia pre y post partida y por que no, miramos algunos memes.\r\n\r\nSaludos comunidad, espero verlos en mi canal y recuerden que compartir el Stream y dejar un Follow ayuda enormemente!\r\n\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"MILFortune","date":"2019-01-24T00:07:30.363+0000","up_votes":1,"down_votes":0,"body":"Vas a combatir la toxicidad llamándole rata a alguien ? Creo que así no funciona la cosa","replies":[{"poster":"Rydia Junior","date":"2019-01-24T04:10:11.750+0000","up_votes":1,"down_votes":0,"body":"Si una persona es tóxica, el ver que es tóxica no te hace tóxico. Además no se los digo en el juego. Saludos","replies":[{"poster":"MILFortune","date":"2019-01-24T04:22:57.308+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rydia Junior,realm=LAS,application-id=PK16w6wv,discussion-id=xntEujZ6,comment-id=00000000,timestamp=2019-01-24T04:10:11.750+0000)\n>\n> Si una persona es tóxica, el ver que es tóxica no te hace tóxico. Además no se los digo en el juego. Saludos\n\nPensalo de este modo: si en este servidor todo el mundo fuera cordial ¿te atreverías a usar la palabra \"ratas\" para referirte a un grupo de personas dentro o fuera de lol? Probablemente no. Y si lo hicieras, serías el único elemento tóxico dentro de ese lugar. Entonces para minimizar un comportamiento que es global y te involucra, tenés que abandonar ese propio comportamiento. Esa es la forma de sanear la comunidad. Y está bien que expreses lo que pensás, de la forma que lo pensás pero si en verdad querés ser un agente de cambio, debés cambiar primero. Nadie va a creer que querés combatir la toxicidad si llamás ratas a los desviados del código del invocador. ¿Creés que no merecen respeto por ser tóxicos? El ojo por ojo no arregla nada. El ambiente que te rodea es una extensión de vos","replies":[{"poster":"Rydia Junior","date":"2019-01-24T18:42:50.133+0000","up_votes":1,"down_votes":0,"body":"Si lo merecen, es mas, si hubieras estado al final de mi stream, mira la ultima partida y fijate a quien le doy el hosteo y por que.","replies":[]}]}]}]},{"poster":"Tortuguita","date":"2019-01-24T00:23:38.911+0000","up_votes":1,"down_votes":0,"body":"Combatir a las \"Ratas toxicas\". Damn tu si que das el ejemplo","replies":[]}]}