{"poster":"PlsNerfMyDonger","date":"2015-07-27T14:51:33.669+0000","title":"League of Legends als MMORPG","subforum":"Karten & Spielmodi","up_votes":2,"down_votes":1,"body":"Mir ist heute etwas in den Sinn gekommen was zumindest in meiner Vorstellung absolut geil war.\r\nWenn League of Legends zu dem originalen League noch ein zweites Spiel erstellen w&uuml;rde welches ein Openworld MMORPG sein w&uuml;rde.\r\nIch w&uuml;rde es mir so vorstellen das jeder Champion dort vertreten ist und die gesamte Geschichte der einzelnen Champs nat&uuml;rlich auch. \r\nWenn man sich diese durchgelesen hat dann k&ouml;nnte einem, wie in meinem Fall, evtl. auffallen das dort so viele Orte genannt werden und so viele verschiedenen Ereignisse das man nicht einmal mehr gro&szlig;artig neue Ideen br&auml;uchte was Story und Charaktere angeht.\r\nMan k&ouml;nnte die Revalit&auml;ten und B&uuml;ndnisse der einzelnen Champions und Orten auch einbringen in dem man jeden Ort auf diese Map klatscht, und dass dann die jeweiligen Orte verfeindet sind (so ungef&auml;hr wie bei Metin2 die einzelnen Reiche)\r\nEs g&auml;be dann zwar nicht sonderlich viel Vielfalt was die Gestaltung deines Charakters angeht, aber man k&ouml;nnte R&uuml;stungen und Waffen trotzdem noch dropen und somit aus der Menge hervor stechen.\r\nWar nur ein Gedanke und ich wei&szlig; das das SEHR schwer w&auml;re umzusetzen aber irgendwie gef&auml;llt mir der Gedanke trotzdem ^^","replies":[{"poster":"Uranbrennstab","date":"2015-07-27T15:25:23.399+0000","up_votes":3,"down_votes":0,"body":"Als MMORPG ungeeignet, würde es jedoch als Action RPG in Stile von The Witcher oder Gothic eins der besten Spiele überhaupt werden, wenn man diese ganze Legendäre Hintergrundgeschichte verarbeitet.","replies":[{"poster":"PlsNerfMyDonger","date":"2015-07-28T13:35:16.740+0000","up_votes":1,"down_votes":0,"body":"Finde ich ist sogar ne bessere Idee als meine :D","replies":[]}]},{"poster":"Abasin","date":"2015-08-26T12:02:44.493+0000","up_votes":1,"down_votes":0,"body":"MMOs sind nicht mehr die Meta. Wird also schwer, da neue Kundenkreise zu gewinnen. Selbst mein Lieblings-MMO \"The Secret World\", mit Lob überschüttet und wirklich fantastischem Hintergrund, kriecht da vor sich hin. Ich schaue nach jedem Content-Patch rein und spiele ein paar Tage weiter, aber zu mehr reicht es nicht. Das Prinzip hat sich überlebt.","replies":[]},{"poster":"Yokumor","date":"2015-08-25T17:14:26.605+0000","up_votes":1,"down_votes":0,"body":"League is das derzeit meist gespielte Game überhaupt wenn ich mich nicht irre? Wieso Resourcen in ein anderes Game stecken und sich selbst konkurenz machen wenn man seine resourcen auch in das bereits sehr gut laufende Spiel stecken und somit den Gewinn noch weiter maximieren kann? Und dann besteht immer noch die Gefahr das es flopt. Denke nicht das in naher Zukunft da irgendetwas kommt.\nHaunse.","replies":[]},{"poster":"Fred Sik Ham","date":"2015-07-27T14:57:32.680+0000","up_votes":1,"down_votes":0,"body":"Fände das auch ganz cool, nur gibt's für jeden Punkt, der dafür spricht, mindestens fünf dagegen. :l","replies":[{"poster":"TheRealPTM","date":"2015-07-27T15:03:01.296+0000","up_votes":1,"down_votes":0,"body":"Grundlegend erstmal nicht. Muss ja nicht für immer so sein, dass Riot Games nur ein Spiel bereitstellt. Solange League aber so erfolgreich ist, wird man sich aber wahrscheinlich erstmal darauf konzentrieren. Ein MMO in Runeterra wäre aber durchaus interessant.","replies":[{"poster":"Καisα","date":"2015-08-02T00:02:54.500+0000","up_votes":1,"down_votes":0,"body":"Riot GAMES, hoffe da kommt noch was :)","replies":[]},{"poster":"Fred Sik Ham","date":"2015-07-27T15:08:09.384+0000","up_votes":1,"down_votes":0,"body":"Sicher könnte das n ordentliches Spiel werden, garkeine Frage. \n\nNur ein MMO zu etablieren ist halt immer son Ding. Schau dir Wildstar an, was ja glaube ich der letzte große \"WoW-KIller\" war.\n\nExtra Ressourcen für ein neues Spiel aufbringen ist einfach saumäßig risikoreich. \n\nOh, Feierabend. Schreib von zuhause weiter, wenn ich dran denke! :D","replies":[]}]}]}]}