{"poster":"YMA RedPlayer","date":"2016-08-27T14:38:44.534+0000","title":"Member Suche !","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Unser Clan YMA Gaming Sucht neue aktive Member!\r\n\r\nWas wir brauchen!\r\nSpieler auf LvL 30 / Bis auf ausnahmen die unter lvl 30 sind ^^\r\n\r\nWas wir euch bieten k&ouml;nnen:\r\nRegelm&auml;&szlig;ige Trainings\r\nAktive Spieler\r\nSpieler mit Erfahrungen von verschiedenster Champions\r\nWir helfen euch bei jedem Problem\r\nTs3- Server\r\n\r\nWas wir von euch erwarten werden:\r\nKein unn&ouml;tiges geflame\r\nEin funktionst&uuml;chtiges Headsett\r\nKritikf&auml;higkeit\r\nAn die Ts-3 Regeln halten\r\nAktiv im Spiel\r\nVertrauen, Ehrlichkeit\r\n\r\nIn unserem Clan geht es haupts&auml;chlich nur Spa&szlig; am spielen wenn du denkst das du sehr aktiv bis und Spa&szlig; am spielen hast Freundlich und Lustig bis dann bis du bei uns gut aufgehoben ^^\r\nDU hast Interesse dann schreib drunter eine Bewerbung mit dem Inhalt bitte: Ranglistenerfahrung, Teamplayerfahrung, wie alt ihr seit, eure Champions, Bot, Top, Jungle oder Mitte ? und warum ihr gerne bei uns beitreten m&ouml;chtet ?\r\n\r\nWir Freuen uns auf dich &lt;3\r\n{{sticker:slayer-jinx-catface}} \r\nLG YMA","replies":[{"poster":"Letstalkabouts3x","date":"2016-08-28T08:16:16.791+0000","up_votes":1,"down_votes":0,"body":"hey ich bin schon seit längerer zeit auf der suche nach ein Clan, zu meiner Person heiße Maik bin 24 jahre jung, spiele lol schon eine längere Zeit, allerdings mit Pause...ich finde es kommt garnicht dadrauf an ob man platin oder sonst was ist, hauptsache die teamarbeit stimmt :-)\nich hoffe ihr meldet euch, mfg Maik","replies":[{"poster":"YMA RedPlayer","date":"2016-08-28T20:36:50.292+0000","up_votes":2,"down_votes":0,"body":"Ich meld mich bei dir ^^\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"TheMasterBe","date":"2016-08-29T15:25:49.703+0000","up_votes":1,"down_votes":0,"body":"Hey ich bin schon lange auf der suche nach einem Team das auch als solches Spielt und finde euren Foreneintrag interessant.\nEinmal zu mir ich bin Kjeld ( ja das ist ein name ) bin 17 und spiele seid der Beta LoL habe momentan 120 Ranked wins und war immer im Silber bzw Gold berich unterwegs ( jetzt leider bronze ) erfahrungen in richtigen team habe ich nicht nur das was man mit Kollegen sammelt. Einen richtigen main champ habe ich nicht und auch keine beforzugte lane ich habe  308 lvl in champ ( spiele also wirklich ALLES) am besten bin ich alledings im Jungel.\nAuf ne antwort würd ich mich freuen auch wenn es nur n nein ist aber dan weiß ich das ich nicht ewig warten muss.\n\nmfg und gl in rankt:\nnexus12112","replies":[{"poster":"YMA RedPlayer","date":"2016-08-29T16:09:34.433+0000","up_votes":1,"down_votes":0,"body":"Ich meld mich bei dir ^^","replies":[]}]},{"poster":"Calł me Daddy","date":"2016-08-27T17:29:39.863+0000","up_votes":1,"down_votes":0,"body":"Halölle:) Ich heiße Johannes , bin 14Jahre alt und suche ein aktives Team/DuoQ Partner.Ich bin zurzeit von Platin 2 wieder auf Platin 4 gedroppt und strebe Dia an. Würde mich sehr freuen wenn ich bei euch richtig bin :D","replies":[{"poster":"YMA RedPlayer","date":"2016-08-27T17:43:22.816+0000","up_votes":1,"down_votes":0,"body":"Ich werd mich bei dir melden ^^","replies":[]}]},{"poster":"Voltin","date":"2016-08-27T17:11:03.046+0000","up_votes":1,"down_votes":0,"body":"Hi ich würde mich gerne für das team bewerben. Ich bin 16 (m) und bin momentan leider noch bronze 3. Ich habe eine gute erfahrung was team angeht, weil ich selber schon in ranked teams war. Ich spiele sehr gern und oft mitte zb. mit morgana, ahri, kata etc. . Würde mich freuen wenn ich eine Meldung von euch bekomme. MFG Elvolpe3","replies":[]},{"poster":"2Adler","date":"2016-08-27T16:44:13.286+0000","up_votes":1,"down_votes":0,"body":"Abend,\nIch hätte auch Interesse da ich seit längerem am suchen bin was zu mir passt ,\nIch bin 23 jahre alt (m) , bin momentan silber 4 teampalyerfahrungen besitze ich da ich schon öfters in einem Team war oder ein eigernes gegründet habe \nMain jung : Lee Sin rengar ,graves , Gragas ,Zac\nIch suche leute die etwas älter sind und aktiv spielen würde mich über die aufnnahme freuen\nMFG \n2Adler","replies":[]},{"poster":"Chrónós","date":"2016-08-27T15:39:01.070+0000","up_votes":1,"down_votes":0,"body":"Hallöchen,\nIch hätte sehr großes Interesse an dem Clan, da ich Leute zum mitspielen suche, die vielleicht auch auf meinem Level sind.\nIch bin momentan level 22(sogut wie 23) mitlerweile wieder sehr aktiv in LoL und spiele Jungle und Top als Nunu, Yi und Lee sin.\ndementsprechend wenig teamplayerfahrung, aber aufgrund von sehr viel streams, sowie lcs eine recht gute spielübersicht, taktiktische reaktion, etc.\nmfg, Chrónós","replies":[{"poster":"YMA RedPlayer","date":"2016-08-27T15:58:54.055+0000","up_votes":1,"down_votes":0,"body":"Danke für deine Bewerbung ich werde mich bei dir melden ^^","replies":[]}]}]}