{"poster":"Manny1978","date":"2018-05-30T20:13:37.344+0000","title":"C'è un modo per non beccare gente così?","subforum":"Off-topic","up_votes":1,"down_votes":1,"body":"La gente quella bella, quella con cui fa sempre piacere giocare. Tu gli dici vedi che Mundo &egrave; tank, non &egrave; normale che scappi quando il jungler ganka per aiutarti e lui a fine partita ti augura malattie incurabili. GG WP\n\n_EDIT DI FLOPPYZ: Ho rimosso l'immagine, dato che il name&&shame è vietato._","replies":[{"poster":"beppedessi","date":"2018-05-31T06:50:11.629+0000","up_votes":2,"down_votes":0,"body":"Sarà che sono fortunato io ma a me non capita così spesso di trovare questo tipo di giocatori, e se capita muto le emote e la chat a tutti, lascia solo i ping a meno che non abusino anche di quelli. Il mio consiglio quindi non è di passare dalla parte del torto trollando o flammando a tua volta, piuttosto gioca la tua partita al meglio che puoi e magari potresti ricavarne qualcosa di buono.","replies":[{"poster":"DNR Jake","date":"2018-05-31T15:00:17.331+0000","up_votes":1,"down_votes":0,"body":"concordo pienamente.","replies":[]}]},{"poster":"DNR Jake","date":"2018-05-31T14:49:08.244+0000","up_votes":1,"down_votes":0,"body":"https://i.makeagif.com/media/8-29-2015/iN3iOV.gif\n**_Ironia_**","replies":[]},{"poster":"HarukiHaru","date":"2018-05-31T06:19:30.779+0000","up_votes":1,"down_votes":6,"body":"Benvenuto in lol.\nTi dico ieri mi sono classificate è in OGNI paritat beccavo afk e troll alla fine dopo un pò mi rompo le palle è feedo apposta tanto se ho troll è flame perchè perdere 40 minuit feedo cosi la finisco in meta del tempo.\nOrmai sto gioc è diventato cosi,sè hai un buon team ok sali altrimenti è impossibile","replies":[{"poster":"DNR Jake","date":"2018-05-31T14:54:18.152+0000","up_votes":2,"down_votes":1,"body":"É **facile** dire _\"é colpa del team\"_, anche io un tempo lo dicevo. Anzi mi capita di dirlo ancora, ma di sicuro se non sali non é solo colpa del team. Da quando ho smesso di flammare con il mio main account sono salito da bronzo 5 a silver 1 in pochissimo.\nQuindi: _un tuo compagno fa qualcosa di sbagliato?_ impegnati e a fine game **lo segnali**, ovviamente solo se intano (realmente, essere scarsi non é reportabile), flammano, ecc..\nIntare per finire prima significa comportarsi come loro, detto questo, Saluti.\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"HarukiHaru","date":"2018-06-01T08:13:18.116+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=DNR Jake,realm=EUW,application-id=Un6AGJq2,discussion-id=36iUAKvw,comment-id=00000000,timestamp=2018-05-31T14:54:18.152+0000)\n>\n> É **facile** dire _&quot;é colpa del team&quot;_, anche io un tempo lo dicevo. Anzi mi capita di dirlo ancora, ma di sicuro se non sali non é solo colpa del team. Da quando ho smesso di flammare con il mio main account sono salito da bronzo 5 a silver 1 in pochissimo.\n> Quindi: _un tuo compagno fa qualcosa di sbagliato?_ impegnati e a fine game **lo segnali**, ovviamente solo se intano (realmente, essere scarsi non é reportabile), flammano, ecc..\n> Intare per finire prima significa comportarsi come loro, detto questo, Saluti.\n> {{sticker:slayer-jinx-catface}}\n\nHa scusa quando hai il bot che sta a 1 /15 il suppo 0 10 non devo tiltare quando vai ad aiutarli l 'adc avversario ti uccide con un colpo solo va tutto bene ,certo come no devo migliiore io ma sè ho un team del cazzo come miglioro.","replies":[{"poster":"DNR Jake","date":"2018-06-01T20:32:25.811+0000","up_votes":1,"down_votes":0,"body":"Se fosse come dici te, non ci sarebbe nessuno superiore al gold.\nLeggi bene quello che ho scritto, \"non é solo colpa del team\". \nQuello che intendo dire é: puó capitare di perdere per il team, ma di sicuro se non sali _**non é solo colpa di quello.**_\nEvitare di Tiltare penso sia una delle cose piú difficili in LoL, molte persone di elo alto tiltano. É una cosa che si puó risolvere nel tempo e dipende molto dalla propia personalitá, quello che devi ricordare é che tiltando abbassi le tue possibilitá di vincita.","replies":[]}]}]}]},{"poster":"Loki Toki ","date":"2018-05-31T07:18:23.213+0000","up_votes":2,"down_votes":5,"body":"guarda almeno mundo è in meta. Io con soraka top e garen jungler... per dire le più recenti, che devo fare... SI TROLLA\nSe trollano... fai lo stesso. La partita dura meno e non ti rompi a cercare di mettere le pezze in giro per la mappa.\nRicorda cmq se sei forte , ma veramente, sali.","replies":[{"poster":"DNR Jake","date":"2018-05-31T14:58:55.292+0000","up_votes":2,"down_votes":0,"body":"Quello che dici ha poco senso a mio parere, facendo cosí ti abbassi solo al loro livello.","replies":[]}]}]}