{"poster":"kirarising","date":"2015-07-17T13:31:25.294+0000","title":"Schooling at riot","subforum":"[ARCHIVED] Miscellaneous","up_votes":7,"down_votes":2,"body":"Is there a way to get an internship at riot without going through a college. I don't have the resources to get into a college and i work full time (60+ hours/week) just to pay all the bills. I tire greatly of my current job and i will likely not ever get out without training or schooling. I have a high school diploma and have found every available job at riot requires previous experience in the field or college. I want to do this and i want to start here.","replies":[{"poster":"moonstones","date":"2015-07-17T19:25:00.843+0000","up_votes":3,"down_votes":0,"body":"Hiya! \n\nAs someone had mentioned, to qualify for an internship, you'd need to be a full-time student and we give preference to students looking for internships for the summer before their final year. \n\nThat said, I don't want to discourage you from applying to Riot! Various positions at Riot do state that we'd like to see a BA, however, we also don't mind **the equivalent real-world experience**! College isn't for everyone, and there are certainly people who are self-taught programming beasts. Or, maybe you didn't go to college, but you have a killer eye for design and an awesome portfolio to show for it. \n\nThe best advice I can offer to to find that skill you are mastering/have mastered and really focus on that. Find the resources that can help you - maybe that means watching YouTube tutorials on how to model, or learning how to code in various languages. \n\n[This](https://www.linkedin.com/grp/home?gid=3544410) LinkedIn page is also a fantastic resource. Riot Careers offers advice/feedback from fellow applicants, as well as from Rioters in several fields. Applicants also share their experiences! \n\nHope this helps a bit!","replies":[{"poster":"Progresso","date":"2015-07-18T02:46:52.977+0000","up_votes":2,"down_votes":0,"body":"Hi KateyKhaos!\n\nQuestion about the student internship, is it an unpaid internship or is it a co-op?  I'm going to Rochester Institute of Technology majoring Computer Science and minoring in Game Design and Development starting in the fall. Part of the BA program is 2 semesters and a summer of full-time paid co-op.  Is that a viable option for students at Riot?  By the time I would be starting my co-op, I will have been playing League for >1/3 of my life and working with Riot would be amazing.","replies":[]}]},{"poster":"Fallen Soraka","date":"2015-07-17T15:42:04.521+0000","up_votes":1,"down_votes":0,"body":"Full time? 60+ hours a week? That's a ton of work; I thought full time was 40 hours per week. Jesus, you work really hard. I hope you can get a better job, and seeing as you seem to have the work ethic (after all, that's a lot of hours) you should have no problem proving that you can work hard.","replies":[{"poster":"kirarising","date":"2015-07-18T13:36:00.821+0000","up_votes":1,"down_votes":0,"body":"Well my work has 12 hour days and works monday-saturday I take weekends off to watch my little one and the + is because i'm a lead and if something isn't done I have to stay until it is. I work in a welding shop, I spend all week going from work to bed to work until the weekend, then i just game myself out when I can while I let my body rest for the next week. Its rough but ill do anything to keep my family happy. Only income of a family of 5 makes for plenty of responsibility.","replies":[]}]},{"poster":"KirynDawn","date":"2015-07-17T14:51:32.733+0000","up_votes":1,"down_votes":0,"body":"most game industries require a lot of experience sadly :C.\nI understand your ambition trust me I'm the same way.","replies":[]},{"poster":"DeynaTaggerung","date":"2015-07-17T14:16:32.958+0000","up_votes":1,"down_votes":0,"body":"My guess is that it's highly unlikely considering their internship program's FAQ (http://www.riotgames.com/riot-internships/faq) says this\n>To qualify for an internship, you've gotta be a full-time student in an accredited undergrad or grad degree program and remain a full-time student the semester after the internship\n\nNot only that but they have a lot of applicants every year, (much more than get in). So while I'm upvoting, don't hold your breath.","replies":[]},{"poster":"Hoi Im Temmo","date":"2015-07-17T14:10:03.533+0000","up_votes":1,"down_votes":0,"body":"This is a good question (for people in general, I am scraping by at a community college) - bumping in the hopes of getting a rioter to reply","replies":[]}]}