{"poster":"Not A Leona OTP","date":"2015-08-25T07:44:46.058+0000","title":"Looking for players for a serious ranked team (Trying to go to Oceanic Challenger Series).","subforum":"Team Recruitment","up_votes":4,"down_votes":0,"body":"Hey guys, we are The Knights, a starting/building e-Sports team, hoping to go to the Oceanic Challenger Series. Before I go into detail about the positions and such, we are looking for dedicated and serious members - people with the same passion as me to go to OCS, or even opL if we&#039;re really good. You need to be able and willing to participate in weekend training sessions, team chats, and creation of League plays. Basically, you need to have tons of time on the weekend (just a couple of hours in the early stages) to be willing to do some team training. You should also be able to play pro picks. Additionally, you will need to have:\n\nSkype\nAt least Level 30 (for the ranked team)\nWillingness to train and improve\nYOU MUST BE WILLING TO PLAY SATURDAY AND SUNDAY GAMES AND MEET ON TIME. IF YOU DO NOT ATTEND THREE WITHOUT A VALID REASON, YOU&#039;RE OUT. WE ARE A SERIOUS TEAM LOOKING FOR SERIOUS COMPETITIVE PLAY. TRAINING SESSIONS INCLUDED.\nA calm head - you must not get mad at your teammates\nTime\nSkill (this can always improve) and flexibility with champions at your main role\nOur current and developing team roster is:\n\nCoach: LGC Minkywhale. I&#039;m not kidding. I got into contact with him, and he&#039;ll be happy to coach us. Awesome, eh? (Challenger 1, obviously)\n\nSubstitute Coach: Saiclone (Analyst for the Dire Wolves opL team, they came third). Again awesome, eh? (Diamond IV, but he&#039;ll be able to teach us professional Oceanic League play)\n\nTop: Cloudy Days (Diamond V)\nMid: IN NEED (DESPERATE)\nJungle: IN NEED (DESPERATE)\nSupport: AnonymousDiamond - That's me :). (Silver III - I know, not the best but I'm looking to play tons over the week. I am getting lots of tutoring)\nADC: Sun Wubong (Diamond V)\n\nSubstitute 1 ADC/Support: IN NEED\nSubstitute 2 Mid: Ziggy Fate (Diamond V, played in a team with players who eventually made it to opL)\nSubstitute 3 Top: IN NEED\nSubstitute 4 Jungle: IN NEED\n\nPut your application in the comments, according to this little draft:\n\nSummoner ID:\nRank (We will review your account to see if you are quite good even if you&#039;re at a low rank, but higher ranks will have higher chance):\nHours which can be played over the weekends:\nAge (Doesn&#039;t matter a single ounce, but you can&#039;t be 11 and play for us, 13+ is good):\nSkype:\nFirst Name:\nPreferred Role:\nChampions Played In Said Role:\nHow can I trust you to be dedicated:\n\nGood luck on the battle field, summoners! \n\nI will attempt to reply to every post - do not expect an instant reply. I have to review all summoners first, and make a choice!  YOU MUST LEAVE AN APPLICATION. I WILL DENY ALL REQUESTS SENT VIA \"ADD FRIEND\" ON LEAGUE OF LEGENDS.\n\n","replies":[{"poster":"DontWorry Regret","date":"2015-08-25T15:31:12.182+0000","up_votes":2,"down_votes":1,"body":"Just letting you know that you must be 17+ to play in OPL","replies":[{"poster":"Not A Leona OTP","date":"2015-08-25T20:31:57.296+0000","up_votes":1,"down_votes":0,"body":"Mhmm, but what are the chances of us making it to opL anyways? We're just a startup, we're not the Chiefs hiring or anything like that. That being said however, our team is pretty much 17+ so if a miracle occurs, we're all set :)","replies":[]}]},{"poster":"Caeli Pluvia","date":"2015-08-25T09:02:17.203+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"FrozenArrow","date":"2015-08-25T09:05:01.011+0000","up_votes":1,"down_votes":0,"body":"Abit rude i mean everyone can try for the challenger series that why riot put it in place","replies":[]}]},{"poster":"pattystarfish","date":"2016-11-01T09:52:46.531+0000","up_votes":1,"down_votes":0,"body":"Summoner ID - Pattystarfish\nRank - Im silver 5 but I must say I'm alot better when it comes to a rank team who skypes. (Plat/Diamond Average)\nHours which can be played over the weekends: Around 7hours each day\nAge - 17\nSkype: Starfish1238\nFirst Name: Patrick\nPreferred Role: Mid/Jg\nChampions Played In Said Role: Mid- Diana/Tf/Ori Mains. Jg-Nocturne-Yi-J4\nHow can I trust you to be dedicated: I know my Solo Queues might not look great, but when it comes to ranked teams im fully dedicated and try my hardest every game.","replies":[]},{"poster":"Hi im Teeq","date":"2015-09-21T17:09:01.504+0000","up_votes":1,"down_votes":0,"body":"Summoner ID: Teeq (im posting from my smurf atm)\nRank (We will review your account to see if you are quite good even if you're at a low rank, but higher ranks will have higher chance): Plat 3\nHours which can be played over the weekends:\nAge (Doesn't matter a single ounce, but you can't be 11 and play for us, 13+ is good): 19\nSkype: buxtonnnn\nFirst Name: Josh\nPreferred Role: Jungle\nChampions Played In Said Role: Lee Sin, Elise, Rek'Sai, Gragas\nHow can I trust you to be dedicated: I played WoW for a long time I'm used to committing to a game and making times.","replies":[]},{"poster":"Danyku","date":"2015-09-20T12:39:37.626+0000","up_votes":1,"down_votes":0,"body":"Summoner ID: Danyku\nRank (We will review your account to see if you are quite good even if you're at a low rank, but higher ranks will have higher chance): Plat 3\nHours which can be played over the weekends: 10\nAge (Doesn't matter a single ounce, but you can't be 11 and play for us, 13+ is good): 17\nSkype: danykoool\nFirst Name: Daniel\nPreferred Role: Support>ADC\nChampions Played In Said Role: Thresh, Janna, Ashe, Jinx, Tristana, Draven\nHow can I trust you to be dedicated: I want to contribute towards being the best that I can get and being exposed to a highly competitive team environment is what I've always wanted. I am dedicated to put in the hours to get better at the game and work as a team to succeed.","replies":[]},{"poster":"Sunny Jim","date":"2015-09-16T21:58:40.114+0000","up_votes":1,"down_votes":0,"body":"Summoner ID: Sunny Jim\nRank: Gold 5 (plan to be play within two weeks)\nAge: 18\nSkype: yes\nFirst name: Joshua \nPreferred role: Mid\nChampions played in said role: any champion, do enjoy ad champs. \nHow can I trust you'll be deicated: I have a good work ethic and want a chance to go pro","replies":[]},{"poster":"hunter98","date":"2015-09-09T23:52:35.576+0000","up_votes":1,"down_votes":0,"body":"Summoner ID: hunter98\nRank (We will review your account to see if you are quite good even if you're at a low rank, but higher ranks will have higher chance):\nHours which can be played over the weekends: Bronze IV\nAge (Doesn't matter a single ounce, but you can't be 11 and play for us, 13+ is good): 17\nSkype: Ask me in game for Skype\nFirst Name: Nicholas\nPreferred Role: top or jungle\nChampions Played In Said Role: top =  Irelia, Gnar, Maokai, Shen. Jungle = Rek'Sai, Skarner, Diana, Gragas\nHow can I trust you to be dedicated: I am wanting to become the best I can, when it comes to games, I will always being playing to 100%. I have also been playing trying to climb out of bronze, will gladly accept any feedback to increase my skill level in the game.","replies":[]},{"poster":"lnsomniak","date":"2015-09-04T23:30:07.021+0000","up_votes":1,"down_votes":0,"body":"Lnsomniak do not ask me in game ask me in skype\nDiamond 2\n10am to 12pm\n18years\naymeric650\naymeric\nMidlaner\nChampions Played In Said Role: TwistedFate, Viktor, lulu, orianna, cassio, Jayce, Anivia\nHow can I trust you to be dedicated: I got 1years to improve my skill on the International scene, And i train my self every day for being the best\n\nSry for my English","replies":[]},{"poster":"noslen","date":"2015-08-30T09:39:12.082+0000","up_votes":1,"down_votes":0,"body":"Summoner ID: Voxel\nRank: Diamond 3 \nHours which can be played over the weekends: Pretty much all day until around midnight\nAge: 16\nSkype: Ask me in-game for Skype\nFirst Name: Daniel\nPreferred Role: ADC\nChampions Played In Said Role: Can play any ADC except for Ezreal and Draven.\n\nBest champions:\n{{champion:236}} {{champion:22}} {{champion:18}} {{champion:42}} {{champion:67}}\n\nYou can trust me to be dedicated because I'm really looking to get into the professional scene and I've been trying to improve my gameplay every day for a very long time. I will happily take any feedback that is given as I will do whatever it takes to become a great player.","replies":[]},{"poster":"Solution","date":"2015-08-29T13:08:45.715+0000","up_votes":1,"down_votes":0,"body":"Summoner ID: Solution\nRank: Diamond 5\nHours which can be played over the weekends: If told in advanced, 24/7 availability. Just need to be able to change work availability to work around it :)\nAge: 20\nSkype: would prefer to disclose over in-game chat.\nFirst Name: Jacob\nPreferred Role: Support\nChampions Played In Said Role: In order of skill - Thresh, Nami, Janna, Braum, Alistar, Lulu, Annie\nHow can I trust you to be dedicated: As of the last 4-5 months (I believe) I have been involved in the Nucleus Project (previously run by Saiclone) and have been looking for a serious team throughout the progress. I am looking to get better at the game every day and want to be involved in a serious team.","replies":[]},{"poster":"Imperiusˆ","date":"2015-08-29T05:01:17.978+0000","up_votes":1,"down_votes":0,"body":"Rank (We will review your account to see if you are quite good even if you're at a low rank, but higher ranks will have higher chance): Platinum IV\nHours which can be played over the weekends: Roughly 15 hours\nAge (Doesn't matter a single ounce, but you can't be 11 and play for us, 13+ is good): 16\nSkype: stronkcookie\nFirst Name: Benny\nPreferred Role: Top\nChampions Played In Said Role: Maokai, Lee Sin, Jarvan IV, Cho'Gath, Shen, Gnar\nHow can I trust you to be dedicated: I have played League of Legends competitively and established my own teams, winning 5k RP individually in total (25k RP, but split towards each player), and have lots of experience in playing in a team/tournament environment. Additionally, I am quite eager to join a competitive team and get back in the scene.{{champion:32}}","replies":[]},{"poster":"Sultan","date":"2015-08-28T12:44:10.745+0000","up_votes":1,"down_votes":0,"body":"Summoner ID: Sultan\nRank (We will review your account to see if you are quite good even if you're at a low rank, but higher ranks will have higher chance): Gold V was platinum previous season climbing back the rankings.\nHours which can be played over the weekends: Currently I can play mostly everyday monday to wed i can play after 5 pm but after that i can play everyday and available most times.\nAge (Doesn't matter a single ounce, but you can't be 11 and play for us, 13+ is good): 19\nSkype: gaming.expo\nFirst Name: Yusuf\nPreferred Role: Adc/support i am also a good top player\nChampions Played In Said Role: Jinx, Cait, Corki ( can play all the adc fairly good ) Thresh, janna, leona, nautilus.\nHow can I trust you to be dedicated: ever since i started league of legends i was hoping to be in a team serious team and have been practising to be able to get to the skill level of a serious team. Im hoping to get better as i love ranked 5 and try my best potential at all times when playing ranked 5s. Hoping to go to the level of chiefs one day and achieve something great.","replies":[]},{"poster":"sbeve","date":"2015-08-28T06:56:55.385+0000","up_votes":1,"down_votes":0,"body":"Summoner ID: AsianNation\nRank: B5 (lol rip)\nHours which can be played over the weekends: 5+\nAge: 15\nSkype: NA\nFirst Name: NA\nPreferred Role: Mid \nChampions Played In Said Role: {{champion:238}} {{champion:103}} {{champion:81}} {{champion:7}} {{champion:61}} {{champion:134}} {{champion:268}} {{champion:4}} {{champion:157}}  (Zed, LeBlanc, Teemo, Thresh <3, Ezreal all lvl 5 mastery with Riven and Morgana lvl 4 mastery)\nHow can I trust you to be dedicated:  I play most weekends and I'm very eager to learn more and new things about the game. I am very humble and love a good laugh. (as long as we're having fun! amirite) But seriously, I really like the competitive side of the game and I want to settle down  and enjoy it with people who share the same passion!\n\n**ALL HAIL TARIC {{champion:44}} **","replies":[]},{"poster":"hiimjames001","date":"2015-08-27T23:18:47.217+0000","up_votes":1,"down_votes":0,"body":"Summoner ID: Hiimjames001\nRank (We will review your account to see if you are quite good even if you're at a low rank, but higher ranks will have higher chance): Diamond 5\nHours which can be played over the weekends: All day on weekends\nAge (Doesn't matter a single ounce, but you can't be 11 and play for us, 13+ is good): 16, will be 17 by the time of next years challenger OCS\nSkype: Yes, also have teamspeak and can download any other methods if preferred (will give skype details in PM if accepted)\nFirst Name: James\nPreferred Role: Jungle, but and can support extremely well too if needed to sub\nChampions Played In Said Role: Soloq i play a lot of nid/rengar etc. (carry-type junglers), but in a serious team game i am heavily practiced on champs like reksai, gragas, Jarvan, Elise, Zac,  Udyr. Can flex to alternate jungle options i pick up junglers extremely easy\nHow can I trust you to be dedicated: Iv been trying for months to look for serious ranked teams to look for high level player and to be seen on the pro scene, and i feel like soloq can be a lot harder to achieve it with. I am confident with a strong team i can carry that far , i have just struggled to find enough committed players with high enough skill capacity to play with. The description you've given to apply for is well put so i can clearly see this is a hard working team that i would be joining so im willing to play as many hours as needed to get to the top","replies":[]},{"poster":"mlg JONO","date":"2015-08-27T13:52:10.684+0000","up_votes":1,"down_votes":0,"body":"Summoner ID: mlg JONO \nCurrent rank: promos to plat 4\nhighest rank this season: plat 3\nAge (Doesn't matter a single ounce, but you can't be 11 and play for us, 13+ is good): 19 years old.\nSkype: Yes, also have ts and cv.\nFirst Name: Jonathan\nPreferred Role: Jungle and Mid or Top Sub\nChampions Played In Said Role: main Junglers include elise, lee sin, gragas, ekko and rek sai. Mid laners include viktor, zed, ahri, annie, azir(still mastering).\nHow can I trust you to be dedicated:\nI'm looking for team mates who share the same passion and dedication towards the game as I do. I'm always looking for ways I could improve my play and becoming a professional is a serious goal and mindset of mine. I am willing to but the effort and hard work into all assets of achieving my goal, through strong teamwork, hours of consistent practise and always willing to learn and adapt to new things. I have had previous experience in university grade league of legends tournaments including competing in the QUT Lcs Autum split, and both the Oce university championships this year. I have had a taste for the competitive scene and it is really inspiring me to take it to the next level. During the QUT Lcs Autum split I played as a jungler and then competed as a top laner for both the Oce university championships. I'm currently taking it within myself to learn mid lane champions and to be a really diverse player. I believe I can perform in each jungle and in mid, but i would say im a more confident jungler. I would love the opportunity to be considered and i believe that i would be a huge advantage for any team to have. \n\nAs for hours im available; all weekend pretty much every weekend, and most nights throughout the week. \n\nThank you for your time and I hope to be in touch with you soon:)","replies":[]},{"poster":"Ludo","date":"2015-08-27T07:55:52.692+0000","up_votes":1,"down_votes":0,"body":"Ludo here\nRank: S3\nSkype: Tom Suh, jax.vorsammanko\nName: Tom Suh\nPref role- Can play any, but best at Mid/top and worst at adc.\nChampions\nmid-{{champion:69}} {{champion:74}} {{champion:105}} {{champion:268}} {{champion:112}} are the champs that are my most played\ntop-{{champion:150}} {{champion:92}} {{champion:8}} {{champion:107}} are my most played.\nCan pretty much play any time, working to try and find people who are serious about the game. Oh and **Donger FTW**","replies":[]},{"poster":"Jackbar","date":"2015-08-27T01:18:44.600+0000","up_votes":1,"down_votes":0,"body":"Jackbar\nGold 4 (G1/P5 mmr, climbing)\n9am onwards. Weekends are free\n22 y/o \nNot adding skype for security reasons\nJack \nSupport only.\nMains\n{{champion:12}} {{champion:111}} {{champion:201}} {{champion:412}} \nAlso Plays\n{{champion:40}} {{champion:267}} {{champion:25}} {{champion:117}} {{champion:1}} {{champion:16}}{{champion:89}} \n\nhttp://oce.op.gg/summoner/userName=Jackbar\n\n\nHow can you trust me to be dedicated? Depends on if you have trust issue's or not. Give me a reason to focus my energy and I'll outperform expectations. If it's another shit show with no leadership and god awful management, I'll be out before the ship goes down. Your choice boss\n\nMy dream is to KS a penta infront of 1000+ people.","replies":[]},{"poster":"Rocka","date":"2015-08-26T22:50:54.123+0000","up_votes":1,"down_votes":0,"body":"ID: Rocka\nRank: platinum 2\nHours: everyday 6pm plus and anytime on weekends\nSkype: Thewatertrainer\nName: Jordan\nRole preffered: Jungle\nChampions played: rek'sai, zac and cho'gath\nI am a well organised person and hate to let people down. im hard working and willing to improve.","replies":[]},{"poster":"Minigorophin","date":"2015-08-26T21:34:43.463+0000","up_votes":1,"down_votes":0,"body":"Minigorophin\n21\ndiamond 3\nnot putting my skype here\nAndrew\nAdc\nSivir/Jinx/Tristana/Kog'Maw/Kalista.  Everything Except Ezreal. even if he becomes meta. I will not learn it.\nI made it to Challenger Series, and got Kicked out by Minkywhales Team.","replies":[]},{"poster":"Spaghini","date":"2015-08-26T11:52:45.860+0000","up_votes":1,"down_votes":0,"body":"Summoner ID: Spaghini\nRank (We will review your account to see if you are quite good even if you're at a low rank, but higher ranks will have higher chance): Plat 5\nHours which can be played over the weekends: Pretty much all day\nAge (Doesn't matter a single ounce, but you can't be 11 and play for us, 13+ is good): 18\nSkype: eddiegbarnett@hotmail.com\nFirst Name: Eddie\nPreferred Role: Jg/top/mid (I knoq these might not all be open)\nChampions Played In Said Role: Jg lee/seju/elise (expanding pool atm), top riven/maokai, mid viktor/zed\nHow can I trust you to be dedicated: I also want to make OCS or OPL, I've been improving steadily since season 3 and enjoy ranked 5s.","replies":[]},{"poster":"Realm","date":"2015-08-25T14:49:59.922+0000","up_votes":1,"down_votes":0,"body":"Summoner ID:\nRank (We will review your account to see if you are quite good even if you're at a low rank, but higher ranks will have higher chance): Bronze 1, but was Gold 5 not too long ago. I trolled around a bit in games, and this is where I am. \nHours which can be played over the weekends: I can basically play all weekend, apart from when I'm rostered on at work\nAge (Doesn't matter a single ounce, but you can't be 11 and play for us, 13+ is good): 16\nSkype: I prefer not to announce my skype on a public forum, but I'd be more than willing to give it to you if I get accepted via league\nFirst Name: James\nPreferred Role: JUNGLE\nChampions Played In Said Role: Lee Sin (mainly) However, I can play other champs and still be proficient with them\nHow can I trust you to be dedicated: I've played this game for nearly two years without a break\n\nJUST AN ADDITION:\nExtra information about me: I am very flexible. I obviously desire to play the jungle role for this team, however I can play other roles to a high standard as well; in this order: Jungle, ADC, Mid, Top, Support\nI only got moved down to Bronze 1 because of me fucking around with my mates, however I am a dedicated person, I believe I am the perfect candidate for this team. I am basically a Gold 5 in disguise. If selected, you will be more than appreciative of my skills, and I'm always open to learning as well. Please consider me, as this is my dream as well, playing the game I love in a competitive scene.\n\nThank-you for the consideration.\n\nIGN: PvPRealm","replies":[]},{"poster":"Jubly","date":"2015-08-25T12:43:56.814+0000","up_votes":1,"down_votes":0,"body":"Summoner ID:\nRank (We will review your account to see if you are quite good even if you're at a low rank, but higher ranks will have higher chance): Plat 2 could be higher but so may trolls.\nHours which can be played over the weekends: Sundays should be mostly good, anything past 4-5pm WST on a Saturday is good (generally)\nAge (Doesn't matter a single ounce, but you can't be 11 and play for us, 13+ is good): Old as \nSkype: Yes\nFirst Name: Matt\nPreferred Role: ADC, SUP,  MID (applying for MID)\nChampions Played In Said Role: VLAD, Ahri, Brand and whatever else you need me to learn\nHow can I trust you to be dedicated: errr, How can I trust this is the team to dedicated my skills to?","replies":[]},{"poster":"ThatGuyIsMiitch","date":"2015-08-25T10:13:57.060+0000","up_votes":1,"down_votes":1,"body":"Summoner ID: MightyDuck2\nRank (We will review your account to see if you are quite good even if you're at a low rank, but higher ranks will have higher chance): Silver 3 (but climbing)\nHours which can be played over the weekends: I can play all weekend long\nAge (Doesn't matter a single ounce, but you can't be 11 and play for us, 13+ is good): 18\nSkype: Mitchell.lowery12\nFirst Name: Mitchell\nPreferred Role: ADC\nChampions Played In Said Role: Kalista, Jinx, Vayne, Ashe, Sivir\nHow can I trust you to be dedicated: You can trust me to be dedicated beccause i have the same goal as you dude, its just been hard for me beccause of being low elo and not being able to climb (due to bad teams, but not gonna lie i do make mistakes as everyone else). I have the dream to beccome a professional league player. Im willing to put in the time and practice and learn, because i know im not the best but i know i can become the best if i try and have the right people around me","replies":[{"poster":"ThatGuyIsMiitch","date":"2015-08-25T12:00:19.478+0000","up_votes":1,"down_votes":0,"body":"also applying for ADC sub","replies":[]}]},{"poster":"420 booty wizard","date":"2015-08-25T11:56:33.798+0000","up_votes":1,"down_votes":0,"body":"IGN: 420 booty wizard\nCurrently P4 and climbing (Diamond last season)\nAge: 24\nPreferred Roles: Mid, ADC, JG.\nChamp pool: Mid; Azir, Zed, Cass, Kass, Ori, Talon, Ahri, LB, Varus, J4, Yasuo. JG; Grag, Ekko, Lee, Rek'sai, Rengar, Elise. ADC: all of them.\nHave plenty of time to dedicate to the team and climbing the ranks, add me in game if you want to chat, cheers!","replies":[]},{"poster":"Distinct","date":"2015-08-25T11:24:27.881+0000","up_votes":1,"down_votes":1,"body":"I think people would take this more seriously if you stepped down from support and just stayed to the management side of things. GL though :)","replies":[{"poster":"Not A Leona OTP","date":"2015-08-25T11:43:08.307+0000","up_votes":1,"down_votes":0,"body":"Agreed here, but hey I'm always looking to play with a ranked team and improve :) I cannot manage teams at all, trust on that. Trust. ","replies":[]}]},{"poster":"Dom1nAtAr","date":"2015-08-25T10:08:03.188+0000","up_votes":1,"down_votes":0,"body":"Summoner ID: Dom1nAtAr\nRank: Gold III\nHours which can be played over the weekends: All At the moment\nAge: 18\nSkype: ap1dster\nFirst Name: Anthony\nPreferred Role: Jungle\nChampions Played In Said Role: All The Meta/Tank/Bruiser Junglers accept Rengar and Elise\nHow can I trust you to be dedicated: Taking an opportunity like this would also mean me having the oppurtunity to further improve my play and play for a serious team which is something im looking for","replies":[]},{"poster":"MrPine","date":"2015-08-25T09:19:03.726+0000","up_votes":1,"down_votes":0,"body":"MrPine / S5/ 18/ Top/ Yung Rengar and more. Add me in game fanks","replies":[{"poster":"MrPine","date":"2015-08-25T09:19:37.601+0000","up_votes":1,"down_votes":0,"body":"oh and im applying for top sub <--","replies":[]}]},{"poster":"Jimbolio","date":"2015-08-27T07:37:26.426+0000","up_votes":1,"down_votes":1,"body":"Rank : B4 ( I know it isnt very high but i am very eager even if it is just a chance to watch and play) \nSkype: Ruaridh Drown\nRuaridh ( prenounced rory )\nPref Role : Top\nChampions : Pref Yasuo and Gnar and can practise any others\nYou can trust me to be dedicated because i am willing to learn \n \nIf i don't make this team i just wish to get some experience and have a chance to learn more about the game.","replies":[]}]}