{"poster":"Eladjudicador","date":"2018-11-09T07:43:22.932+0000","title":"Sanción injusta","subforum":"Problemas Técnicos","up_votes":3,"down_votes":5,"body":"En este momento me encuentro en cola de baja prioridad de debido a problemas de conexión  que no son problemas de mi servicio ,  entonces  por ese error  de sistema  de  League OF Legends  quede  fuera  de las partidas  3 veces seguidas por ende me cae el Leave Buster  \ny tengo  que  jugar  6 miserables partidas  con cola de baja prioridad  de  10 mintos de tiempo de espera  más el tiempo de espera de \"buscando partida\"  una sanción injusta  \n\nespero que  solucionen  el  tema de las des-conexiones o que suspendan  temporalmente  el Leave Buster  ya que    por cada vez que el sistema me dice  \";no  se ha  podido establecer  la conexión al servidor\"   ;  siendo que cuando chequeo el Internet no tengo ningún problema   pero a  su vez el sistema  me saca de la partida  ni  idea porqué  ni idea  que puede ser  pero espero que  arreglen esto    \n\ny creo que  no soy  el único al que le pasa esto \n\natte el adjudicador","replies":[{"poster":"Professor Farn","date":"2018-11-09T07:53:05.773+0000","up_votes":11,"down_votes":0,"body":"He comprobado los registros de las partidas que aplicaron la penalización.\nSuspensión removida {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"KIÐÐ","date":"2018-11-09T08:04:27.229+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Professor Farn,realm=LAS,application-id=X54mVVp0,discussion-id=VAiTzeRL,comment-id=0001,timestamp=2018-11-09T07:53:05.773+0000)\n>\n> He comprobado los registros de las partidas que aplicaron la penalización.\n> Suspensión removida {{sticker:slayer-pantheon-thumbs}}\n\nAl fin alguien atento!","replies":[]},{"poster":"EllaEsMiMucamita","date":"2018-11-09T07:59:37.061+0000","up_votes":1,"down_votes":4,"body":"Ojalá fueran así de rápidos para solucionar (o ayudar con) los problemas importantes","replies":[]}]},{"poster":"Gatito xfas","date":"2018-11-09T07:45:12.964+0000","up_votes":3,"down_votes":1,"body":"Che, todo bien, pero si sabias que estaba andando mal, ¿por que seguías jugando? \nNo digo que este bien la sanción, pero de todas formas son 10 minutos, podes aprovecharlos para pensar en muchas cosas sobre tu próxima partida (?","replies":[]}]}