{"poster":"Dat Ashe HD","date":"2016-06-14T03:55:51.600+0000","title":"Getting permanent ban is retarded","subforum":"Player Behavior","up_votes":3,"down_votes":17,"body":"Yea, you got it, i just got permanent banned, for giving my opinion on a game, yet there is people who flame, verbal abuse, troll, feed on purpose, and never ever get punished, but you know, because i received chat restrictions mean i deserve ban. I don't get why when you receive one penality, you get so easily banned . People are overly toxic everyday, none of them get banned, as soon i say something '' considered, offensive'' by those 10 years old kids, i receive ban. Riot mentality of banning is getting worst and worst everyday. Good Bye Riot, piece of crap compagny who get our money and still accept permanent ban when in every other games ban isn't even an option.","replies":[{"poster":"AeroWaffle","date":"2016-06-14T03:59:46.527+0000","up_votes":5,"down_votes":1,"body":"I'm not sure what world you're living in, but plenty of games ban when you consistently break the rules.","replies":[]},{"poster":"Zombiemaster","date":"2016-06-14T04:16:36.385+0000","up_votes":6,"down_votes":2,"body":"> there is people who flame, verbal abuse, troll, feed on purpose, and never ever get punished\n\nUmm... there's plenty of posts on this very forum that suggest the exact opposite.","replies":[]},{"poster":"Narvuntien","date":"2016-06-14T04:07:56.153+0000","up_votes":8,"down_votes":4,"body":"I am sooooo sick of this stupid notion of \"its their fault for being offended\". NO NO NO its not. That's now how things work, you don't get to be a horrible person then blame other people for thinking you are horrible. \n\"but but but the internetssss\" NO NO NO the internet is a public place stop pretending its different somehow. Would you shout this out in a shopping centre/mall? would you call a stranger on the street these things? Public place! with all sorts of people.\nhave some respect for other people seriously!\n\nI am pretty sure not understanding that you are responsible for your words and actions and the consequences of them, including how others perceive you is a mark of immaturity and extreme...errr privilege, never had to deal with someone telling you no.","replies":[]},{"poster":"x R e n g a R x","date":"2016-06-14T04:04:33.458+0000","up_votes":4,"down_votes":1,"body":"Just. Stop.\n\n{{sticker:zombie-brand-facepalm}} \n\nReform or leave.","replies":[]},{"poster":"Dat Ashe HD","date":"2016-06-14T04:03:10.558+0000","up_votes":1,"down_votes":11,"body":"False, every other game ban when you use third party programs, hacks or whatever, never i saw game where they ban for such a things. It's literally stealing people money.","replies":[{"poster":"AeroWaffle","date":"2016-06-14T04:07:27.632+0000","up_votes":8,"down_votes":2,"body":"You got banned for breaking the rules. A behavioral rule, but a rule nonetheless. Just like in any other online game you agree to not break the rules or face the punishments.\n\nAnd Riot didn't \"literally\" steal your money. All the stuff you buy, even your entire account, is provided to you at Riots discretion. They agree to allow you to access the account and the game, so long as you **don't break the rules**.","replies":[]},{"poster":"archerno1","date":"2016-06-14T10:02:10.138+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Dat Ashe HD,realm=NA,application-id=ZGEFLEUQ,discussion-id=51vJAHe6,comment-id=0001,timestamp=2016-06-14T04:03:10.558+0000)\n>\n> False, every other game ban when you use third party programs, hacks or whatever, never i saw game where they ban for such a things. It&#x27;s literally stealing people money.\n\nI dont think you understand concept of word \"literally\"","replies":[]}]},{"poster":"Dat Ashe HD","date":"2016-06-14T05:16:03.594+0000","up_votes":1,"down_votes":9,"body":"I like how people disaprove until this kind of thing happen to you. If you dont like just get out , i dont need your opinion.","replies":[{"poster":"AeroWaffle","date":"2016-06-14T05:21:13.207+0000","up_votes":5,"down_votes":1,"body":"Either you made the thread to talk to the community, or the thread is a worthless rant talking to no-one.","replies":[]},{"poster":"FurriesAreHot","date":"2016-06-14T11:06:13.521+0000","up_votes":2,"down_votes":2,"body":"Funny thing is this will never happen to is because we aren't toxic","replies":[]},{"poster":"IcyPepper","date":"2016-06-14T05:23:32.971+0000","up_votes":1,"down_votes":2,"body":">If you dont like just get out , i dont need your opinion.\n\nYou've been permanently banned. Do we need *your* opinion?","replies":[]},{"poster":"BeatzBoyFTW","date":"2016-06-14T05:23:17.790+0000","up_votes":1,"down_votes":3,"body":"Guy who never received a single chat restriction here.\n\nHa. Ha.","replies":[]}]},{"poster":"Prandine","date":"2016-06-14T05:33:01.957+0000","up_votes":2,"down_votes":2,"body":"Punishments are handed out in a progression based system.\n\nStep 1: 10-game chat restriction.\nStep 2: 25-game chat restriction.\nStep 3: 2-week ban.\nStep 4: permanent ban.\n\nWhenever you are punished for showing consistent negative behavior across multiple games you are given the next punishment in line, which in your case was a permanent ban. Permabans are designed to get rid of people who would rather troll and be jerks to others rather than follow the rules and interact with others in a neutral or positive manner. Many businesses do this, it's nothing new. If you refuse to follow their rules then you get removed from their business because of your own poor behavior. It's not rocket science here: follow the rules and don't act like a jerk to others when things don't go your way and you won't get punished, it's as simple as that.\n\nNow if you want to actually discuss your ban rather than just rant and rave like a madman then please post your reform card here (the entire reform card, not just bits and pieces of it). Otherwise there's nothing we can do here to help you out.","replies":[]},{"poster":"Aír","date":"2016-06-14T08:05:26.934+0000","up_votes":1,"down_votes":2,"body":"Well, looks like Riot did something right here...\n\nNice to see that the system works as intended. xD","replies":[]},{"poster":"Vladimeow","date":"2016-06-14T04:10:43.247+0000","up_votes":1,"down_votes":4,"body":"you got banned?\nhehe xd","replies":[]}]}