{"poster":"Ke Meme","date":"2017-09-09T18:27:38.450+0000","title":"Ark, l'assassino celato","subforum":"Creazioni della community","up_votes":1,"down_votes":2,"body":"Benvenuti alla vetrina campioni di Ark, l&#039;assassino celato.\nArk &egrave; un temibile assassino da Giungla che si diletta a far impazzire e distruggere senza piet&agrave; gli avversari che fa cadere nel suo subdolo gioco mentale. Con grazia ed insana agilit&agrave; salta da un cespuglio all&#039;altro uccidendo chiunque provi a disturbarlo. \nNato nella giunga di Kumungu, &egrave; un Vastaya che ha usato la magia innata della sua razza per diventare il re e il migliore degli Arkeon, una sottorazza che vive imboscata pronta ad uccidere ed ad inebriarsi del sangue di chiunque provi ad entrare nel territorio da loro disegnato.\n\nPassiva [Occhio del cacciatore esperto]\nQuando **Occhio del Cacciatore Esperto** &egrave; applicato su un nemico, i prossimi [2 danni] che infligger&agrave; Ark saranno amplificati in base al suo livello.\n\nSolo un campione nemico alla volta pu&ograve; essere bersagliato da **Occhio del Cacciatore esperto**.\n\n\nCon Danno ci si riferisce a qualsiasi tipo di Danno che Ark infligge: un autoattacco è un Danno, un'abilità o una carica di W è un Danno. \n\nQ [Fendente Assassino]\nArk sferza un fendente letale ad un nemico che infligge ingenti danni fisici in base all&#039;AD totale di Ark. \n\nSe il bersaglio &egrave; marchiato da **Occhio del Cacciatore esperto** il colpo infligge danni fisici in base alla salute mancante del nemico ed avvicina Ark al nemico ponendo Ark davanti ad esso.\n \nSe il bersaglio non &egrave; marchiato da **Occhio del Cacciatore esperto** il colpo ha il suo effetto base ma se il bersaglio rimane con meno vita in percentuale di Ark dopo la sferzata, la ricarica viene rimborsata e il bersaglio viene marchiato da **Occhio del Cacciatore esperto**.  \n\nW [Riposizionamento]\n\nArk &egrave; un grande maestro della Giungla e i cespugli sono la sua casa. Sa come muoversi al loro interno ed ottiene bonus speciali entrandoci. \n\nPassiva: Quando Ark uccide un campione marchiato da **Occhio del Cacciatore esperto**, ottiene velocit&agrave; di movimento se passa sopra il cadavere della vittima.\n\nPassiva: Quando &egrave; in combattimento, Ark pu&ograve; saltare da un cespuglio all&#039;altro (a patto che questi siano vicini, Ark non esca dal combattimento ed Ark non pu&ograve; saltare dallo stesso cespuglio pi&ugrave; di due volte: &egrave; un nemico leale che adora combattere!). Se Ark non combatte dopo essere saltato da un cespuglio, viene rallentato pesantemente per 2 secondi e il rallentamento non sceme durante il tempo.\n\nAttiva: 3%,4%,5%,6% del mana massimo ogni scalo di abilit&agrave; + 2% mana attuale fisso, gratuito per l&#039;attivazione.  [Bisogna tenere premuto W per usare l&#039;abilit&agrave; fin quando si vuole, alla fine si rilascia automaticamente]\nArk stringe il suo bersaglio nei suoi artigli. Pi&ugrave; tempo riesce a tenerlo stretto, maggiori bonus ottiene:\n1&deg; Scatto: Ark applica **Occhio del Cacciatore esperto** al nemico.\n2&deg; Scatto: Ark ottiene velocit&agrave; di movimento verso il nemico.\n3&deg; Scatto: Ark infligge ingenti danni fisici al nemico in base alla sua salute attuale.\n4&deg; Scatto: Ark rallenta il nemico.\n5&deg; Scatto: Ark immobilizza il nemico, infligge ingenti danni fisici al nemico in base alla sua salute massima e riapplica **Occhio del Cacciatore esperto**.\n\nE [Grande Balzo]\nAttiva: Ark balza in linea retta nell&#039;ultimo cespuglio in cui &egrave; stato, a patto che questo non sia troppo lontano da lui. Se Ark salta sopra un campione nemico questo viene marchiato da **Occhio del Cacciatore esperto**.\n\nR [Fine delle Danze]\nPassiva: Ark pu&ograve; avere due **Occhi del Cacciatore esperto** su un nemico, ma comunque infligger&agrave; danni come se ne avesse solo uno. Dopo i  [2 danni] di Ark, entrambi gli **Occhi del Cacciatore esperto** vengono eliminati.\nPassiva: Ark inizia ad odiare tutte le persone che sono entrate nella sua giungla. Se vince la sfida con loro ottiene bonus, se la perde ottiene ingenti debuff.\n\nAttiva: Ark marchia un nemico con **Occhio del Cacciatore esperto** e poi tira a se tutti i marchi applicati su quel nemico infliggendo danni in base alla salute massima del nemico per marchio. In pi&ugrave; Ark ottiene danni magici bonus in base alla vita massima del bersaglio sul colpo per i successivi tre attacchi che ottengono il 250% di velocit&agrave; d&#039;attacco in pi&ugrave;. Se Ark vince la sfida, ottiene 2% di velocit&agrave; di movimento bonus per campione unico ucciso. Se Ark perde la sfida, per 3 secondi Ark ottiene 5% di riduzione danni inflitti da qualsiasi output. \n\n\nPer fisionomia mi sono ispirato a Zoroark (da cui prende anche il nome) maggiormente per testa artigli e corpo  https://media.pokemoncentral.it/wiki/thumb/a/a9/Artwork571.png/200px-Artwork571.png e a Lycanroc forma notte per la meccanica dell&#039;occhio illuminato e per zampe corona di rocce sul petto e criniera  https://media.pokemoncentral.it/wiki/thumb/8/8b/Lycanroc-Notte_concept.png/250px-Lycanroc-Notte_concept.png \n\nSo che c&#039;&egrave; bisogno di qualche bilanciamento, ma spero che apprezziate Ark :)","replies":[{"poster":"Adalkah","date":"2017-09-13T18:46:05.498+0000","up_votes":1,"down_votes":0,"body":"troppa roba da leggere","replies":[]},{"poster":"A Yolo Singed","date":"2017-09-09T18:42:28.924+0000","up_votes":1,"down_votes":0,"body":"Dota2?","replies":[{"poster":"A Yordle ln Heat","date":"2017-09-10T12:49:10.016+0000","up_votes":1,"down_votes":0,"body":"Commento molto a caso, visto che il kit di questo campione non si avvicina minimanete allo stile di Dota.\nt h i n k i n g e m o j i","replies":[{"poster":"A Yolo Singed","date":"2017-09-10T19:28:31.341+0000","up_votes":1,"down_votes":0,"body":"Le sfide dei buff e debuff mi ha fatto pensare a legion commander lmao\nMa sì era un commento a caso.\nNon fare il fanboy su.","replies":[]}]},{"poster":"Ke Meme","date":"2017-09-10T06:28:53.631+0000","up_votes":1,"down_votes":0,"body":"Non gioco a Dota2 mi spiace :(","replies":[]}]},{"poster":"HaIIeIujah","date":"2017-09-10T08:24:41.484+0000","up_votes":1,"down_votes":0,"body":"Questa non è un'accusa di plagio.\n\nOgni campione in League deve tentare di occupare un suo spazio unico. Questa è una filosofia creata dopo la Season 2 circa, ed è generalmente accettata come un principio del buon design.\n\nSe due campioni occupano una spazio simile, anche se con diverse sottigliezze, tendono a dover venire separati col tempo con un rework. Per esempio, Xin Zhao è funzionalmente molto simile a qualunque altro diver ceh autattacca soltanto, e sta venendo mini-reworkato. E' un metodo per assicurarsi che siano abbastanza diversi da non outclassarsi a vicenda.\n\n\nQuindi, il fatto che tu stia creando un assassino vastaya basato in jungla con una meccanicha che gli permette di saltare dai cespugli finisce un po' per pestare i piedi allo spazio di Rengar. Ci sono altri problemi nel gameplay , ma sono secondari rispetto alla sovrapposizione del design.","replies":[{"poster":"Ke Meme","date":"2017-09-10T08:37:48.986+0000","up_votes":1,"down_votes":0,"body":"Non salta dai cespugli, salta nei cespugli. L'unica cosa che è simile a Rengar ora che ci penso è il bonus passivo della suprema che può essere rimosso togliendo il gioco Vinci/Perdi duello. \n\nNel mio immaginario, quando salta da un cespuglio all'altro vedi un'ombra nera muoversi non il campione e se noti bene non c'è un'abilità vera e propria che permetta ad Ark di saltare da un cespuglio su un campione o da un cespuglio su un fiore esplosivo e scappare via come fa rengar perché se dovesse saltare in un cespuglio e scappare via otterrebbe tanta riduzione di velocità. Detto ciò è vero che utilizza i cespugli come fonte primaria come Rengar ma effettivamente Rengar è basato sulla passiva e sullo stacking di essa più che sul salto dai cespugli... potrebbero avere questa cosa in comune. Anche Kha per esempio quando potenzia la suprema e passa da un cespuglio diventa invisibile e nonostante questo a livello di lore è il più grande nemico di Rengar senza che nessuno dei due venga intaccato.\nFinisco in più col dire che la meccanica dei cespugli è attivabile solo in combattimento dopo aver preso almeno un livello di W e quindi bisogna prima di tutto infliggere almeno un danno al campione nemico (Ed aver sviluppato un'abilità)  mentre con Rengar è possibile ingaggiare con la sua passiva da subito.\n\nQuindi a prima vista possono sembrare simili ma non sono esattamente lo stesso genere di campione ","replies":[]}]}]}