{"poster":"N3ymarJr","date":"2016-12-22T05:09:55.378+0000","title":"how can I increase my fps w/o having to buy another video card?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":1,"body":"So currently, I'm playing on a VAIO laptop. Here are the specs:\r\nAMD Athlon(tm) II P320 Dual-Core Processor 2.10GHz or in other words, ATI Mobility Radeon HD 4200 Series\r\n4.00 Gb of Ram (3.78Gb still usable)\r\n\r\nI even tried going to intel and scan for the latest drivers and it said that it couldn't detect it?\r\nI also tried going to device managers and update my drivers automatically but it said that the one that I currently have is the most latest one.\r\n\r\nIf possible, can any of you guys rec commend any advice?\r\n\r\nMy fps in game is currently 08-40 fps (average 30) I would like you have it a constant 60 or so. Thanks.","replies":[{"poster":"Porocles","date":"2016-12-22T22:44:54.847+0000","up_votes":1,"down_votes":0,"body":"Updating your drivers are good for resolving most fps issues, so that was a good step.  Are your fps issues only on League?  I suggest trying every step in the [FPS issues](https://support.riotgames.com/hc/en-us/articles/201752684-Low-Frame-Rate-FPS-Troubleshooting) guide to help tune up your PC.  Let me know if that helps!","replies":[{"poster":"Angry Monster","date":"2016-12-23T00:49:05.067+0000","up_votes":1,"down_votes":0,"body":"not to be mean but did you even read what he said he did? He went to intel for an AMD processor and AMD GFX card...\n\nYou should of at least pointed him to the right brand.","replies":[]}]},{"poster":"Angry Monster","date":"2016-12-23T00:46:22.239+0000","up_votes":1,"down_votes":0,"body":">I even tried going to intel and scan for the latest drivers\n\nbut you have \n\n>AMD Athlon(tm) II P320 Dual-Core Processor 2.10GHz or in other words, ATI Mobility Radeon HD 4200 Series\n\nNothing on that Laptop is going to have Intel on it\n\nAlso i am not sure why you are using the term in other words.... You are not even talking about the same part on the laptop.\n\nLastly I am 95% sure you can not upgrade that video card on that laptop.","replies":[]}]}