{"poster":"Getattorex","date":"2016-05-17T20:56:43.266+0000","title":"Has anyone else been having high ping problems lately?","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"I know the server status is fine, but i've been playing under the same conditions as before and i cant find the problem.\r\n\r\nMaybe its nothing i can do and other people have been having the same issue.\r\n\r\nIf you have some information, please help!","replies":[{"poster":"warpenguin555","date":"2016-05-17T21:33:09.090+0000","up_votes":2,"down_votes":0,"body":"not just you. i get random spikes ever since 6.9 launched","replies":[]},{"poster":"dArtagnan","date":"2016-05-17T21:15:20.314+0000","up_votes":1,"down_votes":0,"body":"If your ping is consistently spiking up really high, there seems to be some sort of connection issue between your computer and the individual game servers for League.  In an effort to get this resolved, make sure to complete all of the steps in our [Connection Issues Guide](https://support.riotgames.com/hc/en-us/articles/201752664).  There steps there are the most common solutions to resolve these high ping issues.\n\nGive me a heads up if you are still experiencing any issues!","replies":[{"poster":"Dokte","date":"2016-05-18T02:29:28.221+0000","up_votes":1,"down_votes":0,"body":"Hey Dartagnan -- I'm still having issues after completing the Connection Issues Guide. [Posted here.](http://boards.na.leagueoflegends.com/en/c/help-support/twnXVqfG-lag-spikes-ping-jumping) Any help you could provide would be really appreciated!","replies":[]},{"poster":"Dokte","date":"2016-05-18T00:46:11.635+0000","up_votes":1,"down_votes":0,"body":"I'm getting big lag spikes since 6.9 as well, especially in the past few days.","replies":[]},{"poster":"Getattorex","date":"2016-05-17T22:18:14.458+0000","up_votes":1,"down_votes":0,"body":"I disabled the peer to peer on the patching window and the ping has lowered significantly!\n\nThank you for your time.","replies":[]}]}]}