{"poster":"Dtroxxe","date":"2017-11-20T22:27:58.528+0000","title":"Adc bekommen 3en Gemstoneskin verarschen die uns! Supporter hat keinen bekommen","subforum":"Skin- & Champion-Konzepte","up_votes":3,"down_votes":5,"body":"Es regt einen einfach auf ADCs bekommen einen Skin nach dem anderen jetzt die 2 Projekt skins, dann kommt auch noch KogMaw Hextech!\r\nWTF Riot h&ouml;rt auf adc skins zumachen oder Wechselt den Skincreator  aus  habt ihr mal nachgedacht das es noch keinen Supporterskin gibt bei den Hextech/Gemstone skins? \r\nWir haben Darius f&uuml;r Top\r\nAnnie f&uuml;r Mid \r\nHecarim f&uuml;r Jungle \r\nUnd ADC haben wir Vayne bekommen dann ist Sivir gekommen und Jetzt FK Kogmaw!?\r\nWann wollt ihr endlich einen Supporter Hextechskin raus bringen  vielleicht im Jahr 2041?\r\nWenn alle ADC und Midlaner einen haben?\r\nEs gibt so viele Supporter die einen Coolen Hextechskin haben k&ouml;nnten wie Thresh,Janna,Leona und Rakan aber auch die anderen.\r\nOder macht ihr das nur da es weniger Leute gibt die Freiwillig Support spielen und mehrere Leute Lieber Adc spielen und deswegen diese Skins kaufen?\r\nMacht da mal bitte ein Balancing an Skins und macht f&uuml;r jede Rolle genau gleich viele Hextechskins!!!!\r\nOder bringt mehr Supporter skins raus meine Fresse!!!!\r\n\r\nUnd jeder der sich jetzt wegen der Grammatik oder Fehler beschweren will tut mir einen gefallen geht zum Spiegel und fasst euch an die Nase jeder macht Fehler vielleicht nicht im Schreiben aber anders wo DANKE!!!{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Pantoffel","date":"2017-11-20T22:34:00.507+0000","up_votes":4,"down_votes":0,"body":"Vernünftiger Ton wäre vielleicht angebracht. Also ich muss ehrlich gesagt sagen das mich das mal so null interessiert, welche Hextech Skins sie rausbringen. Können von mir aus auch 20 Hextech skins für Vayne raushauen... Naja, und für die Leute die das halt sammeln, ist es halt Pech, wat willste machen?\nUnd bitte schreib in einem normal Ton, und nicht so!","replies":[{"poster":"Dtroxxe","date":"2017-11-20T23:11:38.713+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Pantoffel,realm=EUW,application-id=L7E6lhzo,discussion-id=x2qQjajM,comment-id=0000,timestamp=2017-11-20T22:34:00.507+0000)\n>\n> Vernünftiger Ton wäre vielleicht angebracht. Also ich muss ehrlich gesagt sagen das mich das mal so null interessiert, welche Hextech Skins sie rausbringen. Können von mir aus auch 20 Hextech skins für Vayne raushauen... Naja, und für die Leute die das halt sammeln, ist es halt Pech, wat willste machen?\n> Und bitte schreib in einem normal Ton, und nicht so!\n\nMir doch egal das schreib nix und lies was anderes!","replies":[{"poster":"TheFoxRox","date":"2017-11-21T06:02:53.081+0000","up_votes":2,"down_votes":1,"body":"Wer in einem öffentlichen Forum schreibt, hat sich zu benehmen, Punkt! Und nein, wir (die Leser) haben nicht die Aufgabe, dieses Forum nach Qualität zu filtern. Du hast sicherlich eine gute Erziehung genossen, jetzt darfst du sie umsetzen. Viel Erfolg dabei.","replies":[{"poster":"Qbert","date":"2017-11-21T06:07:09.275+0000","up_votes":2,"down_votes":1,"body":"Ich habe die leise Ahnung, dass die angesprochene Erziehung nicht so ausgeführt wurde, wie du es annimmst.\nWer sich in vermeidlicher Anonymität so ausdrückt, ist irgendwo falsch abgebogen.","replies":[{"poster":"TheFoxRox","date":"2017-11-21T12:08:21.463+0000","up_votes":2,"down_votes":0,"body":"Vielleicht auch nur in einem schwierigen Alter\n\n{{sticker:sg-janna}}","replies":[]}]}]},{"poster":"Pure Cynicism","date":"2017-11-21T07:07:12.836+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dtroxxe,realm=EUW,application-id=L7E6lhzo,discussion-id=x2qQjajM,comment-id=00000000,timestamp=2017-11-20T23:11:38.713+0000)\n>\n> Mir doch egal das schreib nix und lies was anderes!\n\nTja, bei allen diesen Gemstone-Skins gibt es leider nicht einen, der mir gefällt und für den ich sammeln würde. Soll ich jetzt auch einen Weinthread aufmachen?","replies":[]}]}]},{"poster":"Lasse Laufen","date":"2017-11-22T11:30:22.449+0000","up_votes":2,"down_votes":0,"body":"Also ich mag Star Guardian Soraka. Wenn ich einen Supp spielen müsste, dann sie :3","replies":[]},{"poster":"Qbert","date":"2017-11-21T05:58:25.505+0000","up_votes":2,"down_votes":0,"body":"Ich fänd n Alistar-Hextech schon geil ... Tech-Kuh \n{{sticker:sg-jinx}}","replies":[]},{"poster":"Teilzeitweeb","date":"2017-11-21T04:47:01.427+0000","up_votes":2,"down_votes":0,"body":"Also ich wäre für Malphite das wäre doch geil. {{sticker:sg-jinx}} \n\nLg\nMomo","replies":[{"poster":"Razorbl8","date":"2017-11-21T04:47:24.415+0000","up_votes":1,"down_votes":0,"body":"Da kann ich nur zustimmen.{{sticker:zombie-brand-clap}} ","replies":[]}]},{"poster":"Sirrkas","date":"2017-11-21T12:27:11.745+0000","up_votes":1,"down_votes":0,"body":">WTF Riot hört auf adc skins zumachen oder Wechselt den Skincreator aus habt ihr mal nachgedacht das es noch keinen Supporterskin gibt bei den Hextech/Gemstone skins?\n\nIst dir schon aufgefallen, dass es erst 4 Skins sind, die man nur über Gems erwerben kann und der letzte erst vor 4 Monaten dazu kam? Da ist es noch etwas früh, um sich darüber aufzuregen. Und nein, die Sivir zählt hier nach meiner Auffassung nicht dazu, da sie nur zeitlich begrenzt und die Neuauflage eines alten Skins ist. \n\n> und Jetzt FK Kogmaw!?\n\nWo steht denn, dass der Kog Maw ein Skin für Gems wird?","replies":[]},{"poster":"Sihari","date":"2017-11-21T07:33:44.920+0000","up_votes":1,"down_votes":0,"body":"Ich freue mich eher, dass es keinen Gemstone-Skin für Supporter gibt. Warum? Weil ich deswegen nicht verleitet werde mein Geld in ein teures Glücksspiel zu pumpen! xD","replies":[]},{"poster":"CrasenEX Neeko","date":"2017-11-21T06:25:20.299+0000","up_votes":1,"down_votes":0,"body":"Gemstone-Taric confirmed","replies":[]},{"poster":"D4rki3","date":"2017-11-21T00:40:26.218+0000","up_votes":1,"down_votes":0,"body":"annie kannst du ja als supp spielen lol\nund es gibt einen hextech janna skin?\nsion support ist auch legit und der hat auch einen hextech skin?\nund für supps gibts ein anderes skin genre genannt star guardian z.b da sind auch für jenna lulu und poppy skins vorhanden also wein nicht rum bitte hast du eigentlich nen plan was für ne arbeit es ist nen skin zu entwerfen?\nund zudem gibts noch projekt leona aus der projekt reihe aber hey oder programm soraka aus der programm reihe supports haben genug tolle skins augen auf machen","replies":[{"poster":"Megamaexx","date":"2017-11-21T05:11:56.519+0000","up_votes":1,"down_votes":0,"body":"Star guardian ist doch kein Supporter-Skin-Genre...","replies":[]},{"poster":"Nycaria","date":"2017-11-21T01:00:16.805+0000","up_votes":1,"down_votes":0,"body":"Es geht nicht um die Hextech Skin Reihe, sondern um die Skins die man für Gemstones freischalten kann. Weder Sion noch Janna gehören dort dazu.","replies":[]}]},{"poster":"manial fly","date":"2017-11-20T23:34:01.358+0000","up_votes":1,"down_votes":0,"body":"Durch die Reduzierung der orangenen Essenzen kann man die Skins ohnehin erst nach Jahrzehnten einlösen :D\n\nWeiß auch gar nicht was alle an den Skins so toll finden. Unter normalen Umständen ist es ohnehin total schwer einen zu bekommen und die Alternative ist ein halbes Vermögen für Kisten auszugeben (welche ja nun noch weniger Wert sind).\nNee nee ich bin froh das bislang keiner meiner Main Champs son Skin hat und ich mir für selbige sämtliche Skins zu einem humanen Preis kaufen kann.","replies":[]},{"poster":"Megamaexx","date":"2017-11-20T22:36:11.383+0000","up_votes":1,"down_votes":0,"body":"Sorry aber Hextech Janna gibt es schon.\nIst es schon bestätigt, dass Hextech Kog'Maw für Gemstones erhältlich sein wird?","replies":[]}]}