{"poster":"Esencia Azul","date":"2018-02-17T13:19:27.915+0000","title":"Pérdida de paquetes?","subforum":"Problemas Técnicos","up_votes":10,"down_votes":1,"body":"estos últimos días he tenido 50 de ping como siempre, pero ahora cuando hago varios clicks o aprieto combinaciones de teclas el ping sube de 100 a 300 y si no toco nada baja de nuevo.\r\nA alguien le está pasando??","replies":[{"poster":"Gaspar Noeh","date":"2018-02-17T13:26:29.356+0000","up_votes":5,"down_votes":0,"body":"Mira estaba jugando con un amigo y si, se le subia hasta 2000ms y bajaban de nuevo en grieta y ni te cuento en aram, pensamos q era solo el, pero a un Ganplank q estaba en partida tambien le pasaba, lo unico q pregunten a soporte, porque si no es su internet, es el server.\n-proba borrando el archivo de configuracion de lol y jugando una personalizada para q se cree desde cero.\nRiot Games\\League of Legends\\Config\\game.cfg","replies":[]},{"poster":"Charlôtte","date":"2018-02-17T13:45:53.193+0000","up_votes":7,"down_votes":8,"body":"Lo que pasa es que los paquetes se atascan en el cable cuando mandás muchos a la vez, metele vaselina al conector ethernet para que pasen mejor.","replies":[{"poster":"Squealer","date":"2018-02-17T20:40:45.300+0000","up_votes":2,"down_votes":0,"body":"Cuando le mandes la vaselina decile que tiene propiedades analgésicas para que no le duela o un chamuyo así, siempre se la creen.","replies":[{"poster":"Charlôtte","date":"2018-02-17T22:59:25.224+0000","up_votes":4,"down_votes":0,"body":"Soy la única persona que dio una solución al problema y me negativean :c","replies":[]}]}]},{"poster":"Zit","date":"2018-02-17T14:59:42.839+0000","up_votes":3,"down_votes":0,"body":"Esta madrugada tipo 4-5am estaba viciando en aram y de una me subieron los ms desde 36 hasta 2000 sin razón, mi hermano estaba jugando y no tuvo problemas\n\nTengo cablevision si de algo sirve","replies":[]},{"poster":"Bloshan","date":"2018-02-17T16:48:23.893+0000","up_votes":2,"down_votes":0,"body":"Me pasa lo mismo :(. Antes me iba 52 ms y ahora por la mañana que no hay nadie conectado me dice reconectando a cada rato. Esto ya es PROBLEMA DEL SERVER DE RIOT GAMES. Espero que lo solucionen, mientras tanto creo que voy a dejar d ejugar porque ASI es imposible{{sticker:sg-shisa}}","replies":[]},{"poster":"Esencia Azul","date":"2018-02-18T17:18:25.919+0000","up_votes":1,"down_votes":0,"body":"> Hola, Esencia Azul ^^\n\n> Ains lamento leer que estés teniendo estas subidas de MS tan repentinas :(. Antes de determinar con el Tracert si será a causa del ISP, voy a necesitar que hagas algunos cambios en tu conexión siguiendo estas guías ^^\n\n> Desactiva tu IPV6: https://support.riotgames.com/hc/es-419/articles/201752664#wq4\n> Configura tu DNS: https://support.riotgames.com/hc/es-419/articles/201752664#wq5\n> Crea una excepción en tu cortafuegos para el LoL: https://support.riotgames.com/hc/es-419/articles/201752664#wq3\n> Después de haber realizado todos los cambios anteriores, limpia tu lista de procesos mediante un arranque limpio, ya que tienes un montón secundarios activos que pueden causar problemas. Para ayudarte a hacerlo he incluido un artículo con imágenes de los pasos a realizar:\nhttps://support.riotgames.com/hc/es/articles/201761974#wq7\n\n> Coméntame qué tal tras los cambios ^^\n\n\n\n> ChoiJong\n\n> RIOT GAMES \n> Player Support Specialist\n\n> \"There's always another wave\"\n\nel soporte me lo soluciono, espero que les sirva, si se les jode algo recuerden los pasos que siguieron para revertir la configuración","replies":[]},{"poster":"Squealer","date":"2018-02-17T20:35:15.415+0000","up_votes":1,"down_votes":0,"body":"No me pasa exactamente eso, pero con Ryze que hay que combinar varias tecla muy rápido no se castean, o directamente se congela y después de unos segundos pasa todo de una vez, sin embargo el ping no sube de 30-40. Estoy seguro que no es mi PC porque el resto de programas andan perfecto, y no hay nada usando el internet.\nTengo 70 megas de fibertel, por si sirve de algo.","replies":[]},{"poster":"Jeffront","date":"2018-02-17T17:47:54.424+0000","up_votes":1,"down_votes":0,"body":"Yep, bastante.","replies":[]},{"poster":"Emissang","date":"2018-02-17T17:43:07.167+0000","up_votes":1,"down_votes":0,"body":"tenes tirones de ping, la perdida de paquetes es otra cosa","replies":[]},{"poster":"Kyousuke Kousaka","date":"2018-02-17T16:03:59.543+0000","up_votes":1,"down_votes":0,"body":"a mi me ha pasado tambien en estos dias en aram es imposible","replies":[]},{"poster":"JannaBanana","date":"2018-02-17T16:55:25.126+0000","up_votes":2,"down_votes":3,"body":"Si fuera pérdida de paquetes no notarías cambios en el ping. Lo tuyo es lag o alta latencia. Te puedo asegurar que el server de RITO funciona impecable. Yo vivo cerca del server y jamás he tenido más de 10ms jugando (generalmente 8ms clavados). Las únicas veces en que mi ping ha saltado a 100+ es cuando se me olvida apagar los torrents y me están chupando todo el ancho de banda. Te recomiendo comenzar a investigar tu red de hogar e incluso probar otro ISP.","replies":[]}]}