{"poster":"aushigh16","date":"2016-07-24T00:27:27.144+0000","title":"Leona","subforum":"Gameplay","up_votes":2,"down_votes":0,"body":"Just a quick question about Leona\r\n\r\nI haven&#039;t tried her since her updated ultimate, but I&#039;m reading the patch notes here and it just seems off. She gains Incandescence for 5 seconds, at max rank this affects 5 auto attacks. Does Leona have the attack speed to perform 5 autos in 5 seconds? Seems you would need to use your AA resets to get all 5 in... Doesn&#039;t that limit the damage from her passive? Like I said I haven&#039;t tried her, anyone have testimonies that this works well?","replies":[{"poster":"Meddler","date":"2016-07-24T01:50:29.586+0000","up_votes":5,"down_votes":1,"body":"You get an extra 5s to land the next Incandescence empowered auto attack each time you land one, so you shouldn't need attack speed to get them off if you're near the enemy moderately regularly. That's not currently clear enough though, so we'll be doing some work to make it easier to track how many charges you've used (counter on the spell icon or something similar).","replies":[{"poster":"Luna Ather Solis","date":"2016-07-28T17:05:13.590+0000","up_votes":1,"down_votes":0,"body":"Leona is has fallen i hope she will become the new urgot/yorick so YOU will give her a proper kit update, this is what happens when you try to force a tank to be a priority support","replies":[]},{"poster":"Cherysse","date":"2016-07-24T02:02:27.341+0000","up_votes":2,"down_votes":6,"body":"when are you gonna alow her to lane solo? it is racist that just because she is a main support woman she can't solo, seriusly dude, thats racist! (joke joke... it is sexist!) \n**_Triggered_**","replies":[]}]},{"poster":"Sire Hippington","date":"2016-07-24T01:19:20.605+0000","up_votes":2,"down_votes":0,"body":"Yes, makeing use of all 5 stacks requires the AA resets from Q(or as form runes/items), and even then it's only an ideal scenario cause where you always are in range for AAs from the start and don't get CCed.\nI'd say about over 90% of the time, leona can't get off all 5 AAs after the ult.","replies":[]},{"poster":"ADepressedLeona","date":"2016-07-24T01:09:49.049+0000","up_votes":2,"down_votes":0,"body":"If you have CDR you can easily use your Q to reset your auto attack and that helps a bunch","replies":[]},{"poster":"Embertine","date":"2016-07-24T01:04:22.170+0000","up_votes":2,"down_votes":0,"body":"You have to build atleast one attack speed item in order to get them all off. Right now the most effective build for Leona is more of a fighter than as a tank.","replies":[{"poster":"aushigh16","date":"2016-07-24T01:22:35.267+0000","up_votes":1,"down_votes":0,"body":"LOL your match history. I never thought Sheen leo would be in but apparently you make it work. Cheers!","replies":[]}]},{"poster":"lightdragoon88","date":"2016-07-24T00:30:17.977+0000","up_votes":2,"down_votes":0,"body":"I usually get around 3 hits. But that because I ult from a distance and walking/using E takes a bit of the time.","replies":[]},{"poster":"CerealBoxOfDoom","date":"2016-07-24T00:46:28.561+0000","up_votes":1,"down_votes":0,"body":"timer resets on hit and if even if she wasn't getting it she's silly as shit right now anyways","replies":[]}]}