{"poster":"aushigh16","date":"2015-02-02T08:27:12.886+0000","title":"Supports and Sightstone","subforum":"Gameplay","up_votes":1,"down_votes":4,"body":"TL;DR - Comment on possible changes to sightstone so supports don't have to rush this every game.\r\n\r\nOther roles have different build paths and first item options but supports always have to buy sightstone first. This puts them behind on their first item purchase when they're already last in gold. I usually get pinks when laning as well and if the enemy finds these I have to buy another. This means between sightstone and pinks I may have well spent my first 1k on nothing but wards (Sightstone hp >.>). The gold items for supports are nice but I cringe at not getting my sightstone first.\r\n\r\nJust a thought to a possible change being directed at ward trinkets. Maybe adding the option of two trinkets that both store wards over time. One trinket would take longer to get a charge but the wards last 3 minutes. The other trinket would store charges faster but the wards would only last 1 minute (Explorer wards?) useful for split pushers that are applying pressure. Would keep the no more than 3 wards out at a time rule. Sweep would still be an option. Not sure how the upgrading would work though...\r\n\r\nMaybe I'm the only one... I've seen other threads wanting to make sightstone a trinket itself. I'm not concerned with the extra item slot.. I never get full build anyways. It would just be nice to have a build path that didn't start with my first 1k going to wards.","replies":[{"poster":"The Queen Viper","date":"2015-02-02T09:48:54.064+0000","up_votes":2,"down_votes":1,"body":">This puts them behind on their first item purchase when they're already last in gold. \n\nSightstone IS your first item purchase, and your MOST IMPORTANT item in the game.\n\n\n>This means between sightstone and pinks I may have well spent my first 1k on nothing but wards (Sightstone hp >.>). \n\nDuring laning phase you don't even need anything else. As a support your purpose is to keep your ADC alive and provide vision to your lane and Dragon. Nothing more, nothing less. If you are fantasizing about dmg and stuff, then don't play support. \n\n>It would just be nice to have a build path that didn't start with my first 1k going to wards.\n\nAnd this is exactly the reason why you are still in Bronze, bro. You have no clue how to play this game and how important the vision is...","replies":[{"poster":"IcyPepper","date":"2015-02-18T04:07:20.082+0000","up_votes":1,"down_votes":0,"body":"> And this is exactly the reason why you are still in Bronze, bro. You have no clue how to play this game and how important the vision is...\n\nAd hominem for the crime of questioning a specific strategy? \n\nAnyway, I have a question. Is it fair for the adc to spend 250 gold upgrading his trinket, and the occasional equivalent of three minions to buy a ward here or there? Or am I bronze for thinking that it's not only the support's job?","replies":[{"poster":"The Queen Viper","date":"2015-02-18T12:22:35.196+0000","up_votes":1,"down_votes":0,"body":"Sure the ADC could upgrade the trinket, would help your team to get vision and maybe couple of wards if the support is a tool and doesn't know what he/she is doing and doesn't understand the importance of vision. \n\nAt the end of the day, it's supports job to keep the bottom lane + drake warded, not the ADCs.","replies":[{"poster":"IcyPepper","date":"2015-02-18T18:07:21.925+0000","up_votes":1,"down_votes":0,"body":"A ward costs three minions. Supports have the lowest income in the game. Why is it their job again?\n\nLook, people keep saying \"it's the support's job\" without giving any reasons beyond \"muh items.\" Please, give me a reason why the adc can't spare that gold for the sake of helping the team.","replies":[]}]}]},{"poster":"ZephyrDrake","date":"2015-02-02T10:25:38.309+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Çerastes,realm=EUW,application-id=3ErqAdtq,discussion-id=EU4N9VxE,comment-id=0001,timestamp=2015-02-02T09:48:54.064+0000)\n>\n> Sightstone IS your first item purchase, and your MOST IMPORTANT item in the game.\n> \n> During laning phase you don't even need anything else. As a support your purpose is to keep your ADC alive and provide vision to your lane and Dragon. Nothing more, nothing less. If you are fantasizing about dmg and stuff, then don't play support. \n> \n> And this is exactly the reason why you are still in Bronze, bro. You have no clue how to play this game and how important the vision is...\n\nyeah, it's such a horrible thought to want to not be have to build the same items every game, it's such a foul thing to even think about wanting to have variety in ones playstyle. Maybe if i didn't have to buy sightstone every single game i could build one extra aura/utility item.","replies":[{"poster":"The Queen Viper","date":"2015-02-02T14:47:25.448+0000","up_votes":1,"down_votes":0,"body":"> yeah, it's such a horrible thought to want to not be have to build the same items every game, it's such a foul thing to even think about wanting to have variety in ones playstyle. \n\nThen maybe League of Legends, where the vision has a very big role... is NOT for you. If you want to have variety in play styles, then DO NOT PLAY SUPPORT! \n\nAnyways, you also are building boots every game, so why you are not bitching about that too? \n\n\n> Maybe if i didn't have to buy sightstone every single game i could build one extra aura/utility item.\n\nYour utility means nothing compared to vision and objective control provided by Sightstone. Or you just could actually play proper support champions that have the utility by DEFAULT.","replies":[{"poster":"aushigh16","date":"2015-02-04T02:53:14.167+0000","up_votes":1,"down_votes":0,"body":"I think you missed the entire point of my post. Because you literally defended my point even as you tried so hard to bash me. I said it would be nice to not have to rush the same item every game. I main support and jungle. In the jungle I can rush tank, utility, or dmg. As support you rush wards, wards, wards, wards, wards. All I said is that it would be nice to not have to worry about rushing that every game since its meta to rush sightstone anyways. You even said how important vision is... I realize this, I rush sightstone every game...\n\nNow since your such a better player than myself. If you have any ideas I'd love to hear them. Its brainstorming... we're not making any game changes in this board post... or you could just continue to be a dick, whatever","replies":[{"poster":"Erockandroll","date":"2015-02-04T03:52:00.512+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=aushigh16,realm=NA,application-id=3ErqAdtq,discussion-id=EU4N9VxE,comment-id=0001000000000000,timestamp=2015-02-04T02:53:14.167+0000)\n>\n> I think you missed the entire point of my post. Because you literally defended my point even as you tried so hard to bash me. I said it would be nice to not have to rush the same item every game. I main support and jungle. In the jungle I can rush tank, utility, or dmg. As support you rush wards, wards, wards, wards, wards. All I said is that it would be nice to not have to worry about rushing that every game since its meta to rush sightstone anyways. You even said how important vision is... I realize this, I rush sightstone every game...\n> \n> Now since your such a better player than myself. If you have any ideas I'd love to hear them. Its brainstorming... we're not making any game changes in this board post... or you could just continue to be a dick, whatever\n\nIt seems to me that you don't actually Like playing support. When I'm playing support. I'm actually glad that I can rush Sight stone. Nothing is quite more Gold Efficient than this endless fountain of wards. It freaking pays for itself after a couple of wards are placed.\n\nAnd the reason I like Rushing it early is not even Objective control. I can not only ward river, but also the side brush, making sure that the bot lane does not pull off any shenanigans. And considering you have maybe one sweeper in bot lane, the opponent would have to chose which wards they clear out.\n\nThe only time I really don't rush sight stone. is if bot lane is behind, or if for some reason I need to stop supporting. The latter case happens if the ADC a) Royally fks up or b) goes AKF. And in the Former case, if our lane is constantly pushed to our tower. MS would allow me to better juke skill shots and get back to lane quicker. \n\nBut if your Bot lane is Clearly ahead. Sight stone is the best choice because you can press the advantage without worry about being ambushed.\n\nNow their is a fact that Sight stone can be slot inefficient. and limits the Options late game. But as the one with the least gold, this should rarely be an issue. But it's also worth that much more during the late game because everyone else will be full build and have no slots left for wards. And yet their will probably be problems if Sightstone, or its upgrade (or future upgrades) ever become slot efficient enough to be a general build item. \n\nAnother thing to consider about Wards is that Vision has to be balance around the ability to deny it. I don't know what it was like in past seasons. But I do remember Oracle elixir being scraped, with the Trinket wards and sweeping lenses coming into play. Fast forward to the current season. Trinket Upgrades are being severely buffed (except sweeping lens). while the smite bonus on raptors give us more vision denial. (and extra vision with control of the scuttle crab.) \n\nI analyze this and I would say that the vision game is going to get more Trinketised. Particularly in the mid to late game after level 9. While giving a weary hover over vision Denial. But this by no means is making Sight stone any worse.","replies":[]}]}]}]}]},{"poster":"7ha7guy777","date":"2015-02-04T03:00:01.125+0000","up_votes":1,"down_votes":0,"body":"what if sightsone's active replaced the current gp5 items' actives? or possibly a new set of gp items are added where they have a warding active. then you get the choice between damage {{item:3303}} , hp {{item:3302}} , movement{{item:3301}} , or vision [new item(s)]. this could open up a slot for more active items too.","replies":[]},{"poster":"BeatzBoyFTW","date":"2015-02-02T15:03:43.478+0000","up_votes":1,"down_votes":0,"body":"{{item:2049}} has always been a first build for all supports, unless if they want to rush gold gains first like {{item:3096}} {{item:3098}} {{item:3097}} . Or else, you're nothing but a mid-reject {{champion:157}} .","replies":[{"poster":"Zmuecat","date":"2015-02-04T02:55:13.673+0000","up_votes":1,"down_votes":0,"body":"This. The only time I build ANYTHING other than the listed items above, is boots or I was forced back and only had the gold for the mana regen 180g items and some wards.","replies":[]}]},{"poster":"Markus Vakarian","date":"2015-02-02T08:49:27.579+0000","up_votes":1,"down_votes":0,"body":"I would suggest a drastic change\n1) No more Sightstone as item for everyone\n2) Sightstone built in trinket slot upgrading the first ward\n3) Sightstone doesn't give HP anymore\n4) you can upgrade it only if you have \n\nThis way supports can build 6 items like everyone else","replies":[{"poster":"Wullf","date":"2015-02-02T08:51:20.938+0000","up_votes":1,"down_votes":0,"body":"if you have what?","replies":[{"poster":"Markus Vakarian","date":"2015-02-02T08:53:10.276+0000","up_votes":1,"down_votes":0,"body":"i wrote it between < and > maybe it doesn't show\n\ni wrote: \"if you have a new mastery in the utilities tree\"\n\nit will be like smite:you can't buy jungler items without it","replies":[{"poster":"Leti the Yeti","date":"2015-02-02T09:05:24.420+0000","up_votes":1,"down_votes":0,"body":"I'm a tanky support who invest in the defense tree, fk me right?","replies":[{"poster":"Markus Vakarian","date":"2015-02-02T09:10:45.180+0000","up_votes":1,"down_votes":0,"body":"30 in defense tree?? i don't think...you are a tanky supp,not a full tank\nIf you want to be only tank,it's your choice....and you also have to choose your masteries\n\nAlso..you want to be tanky?? i think that spending 8-10 points in Utilities tree to have  free slot items (Frozen Heart,Warmog,what you want) makes you more tanky than having HP from sighstone and 8-10 defense masteries","replies":[{"poster":"Leti the Yeti","date":"2015-02-02T09:14:04.102+0000","up_votes":1,"down_votes":0,"body":"of course not\neven on tanks, I still take 9/21/0 or 0/21/9\nsometimes I'm even 0/27/3\n\nbut you're telling me that maaaybe, just maybe that mid lane mage can take 21/0/9 and get access to sightstone, that really slap support champs","replies":[{"poster":"Markus Vakarian","date":"2015-02-02T09:17:29.657+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LeagueSrsBsns,realm=NA,application-id=3ErqAdtq,discussion-id=EU4N9VxE,comment-id=000000000000000100000000,timestamp=2015-02-02T09:14:04.102+0000)\n>\n> of course not\n> even on tanks, I still take 9/21/0 or 0/21/9\n> sometimes I'm even 0/27/3\n> \n> but you're telling me that maaaybe, just maybe that mid lane mage can take 21/0/9 and get access to sightstone, that really slap support champs\n\nwhy? more wards for the team,everone can do it,not only enemies\nLike you (supp) are getting the 6th items,the other roles can take the sighstone. More wards for everyone","replies":[{"poster":"Leti the Yeti","date":"2015-02-02T09:26:49.437+0000","up_votes":1,"down_votes":0,"body":"{{champion:64}} {{champion:55}} \n-cough-\n\nI find that supports are abit special... in a sense they give up things that no other champ can afford to give up\n\nits a great thing that more people have access to wards, and now we can effectively remove fog of war cuz about 4 wards per corner of the map will pretty much grant vision of the entire rift ;l\n\nI'm also worried that sightstone access from utility tree is gonna make it really fking popular\neven crowd out what othr choices that are avaliable to you for 9 mastery points by a long shot\nespecially cuz of how much we value vision\n","replies":[]}]}]}]}]},{"poster":"Wullf","date":"2015-02-02T08:55:04.627+0000","up_votes":1,"down_votes":0,"body":"i thought so.\nIt might not be actually wrong.\n\nSometimes I hit full build (as support) and I am not even aware of it as my inventory is full of utility items that does not cost much.","replies":[]}]}]}]}]}