{"poster":"MegaLui","date":"2016-03-12T19:04:21.972+0000","title":"DRINGEND!!!","subforum":"Hilfe & Support","up_votes":1,"down_votes":5,"body":"Bitte kann meine wartezeit auf 10 min vermindert werden. ich habe oft internet probleme, daher habe ich wartezeiten. aber diese sind 20 min lang. Daher w&uuml;rde ich es nett finden wenn ihr sier auf 10 vermindert. Bitte ich habe vor 5 min. wieder einen Internet \"absturz\" kann meine wartezeit deswegen bitte weggemacht werden :((( es wird sich nicht wiederholen ich bekomme bald eine neue leitung BIIIITTTEEE. ich finde es komisch dass ich 20min warten muss.\n\nMFG MegaMeuchler1000","replies":[{"poster":"legofreak1","date":"2016-03-12T19:10:29.780+0000","up_votes":2,"down_votes":0,"body":"Diese Wartezeit existiert, weil du trotz anhaltender Probleme immer wieder in Spiele gehst und riskierst, dort aufgrund dieser Probleme afk zu sein. Damit beeinträchtigst du die Spielerfahrung deiner Mitspieler, weil du eure Siegchancen deutlich verringerst. Sobald du dich um deine Probleme kümmerst, diese löst und nicht mehr afk gehst, wirst du vor deinen Spielen auch nicht mehr warten müssen.\nEntfernt oder verringert wird die Wartezeit aber auf keinen Fall.","replies":[{"poster":"MegaLui","date":"2016-03-12T19:17:47.512+0000","up_votes":1,"down_votes":3,"body":"Lego freak. wieso kann meine wartezeit nicht auf 10min vermindert werden. Es macht einfach keinen spaß jedes mal 20min zu warten nur weil ich essen, internet absturz oder sinstiges hatte. D:","replies":[{"poster":"legofreak1","date":"2016-03-12T19:20:13.993+0000","up_votes":3,"down_votes":0,"body":"Das hab ich dir bereits erklärt: Dadurch, dass du afk bist oder Spiele verlässt, minderst du das Spielerlebnis deiner Mitspieler. Dies ist deine Strafe dafür, daran wird sich auch nichts ändern.\nEntweder du änderst nun etwas an deiner Einstellung, löst deine Probleme, gehst nicht mehr afk und verlässt keine Spiele mehr oder du wirst weiterhin vor deinen Spielen 20 Minuten warten müssen.","replies":[{"poster":"Ratplank","date":"2016-03-12T22:20:20.835+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=legofreak1,realm=EUW,application-id=7hciEY9w,discussion-id=peEMLTnQ,comment-id=000000010001,timestamp=2016-03-12T19:20:13.993+0000)\n>\n> Das hab ich dir bereits erklärt: Dadurch, dass du afk bist oder Spiele verlässt, minderst du das Spielerlebnis deiner Mitspieler. Dies ist deine Strafe dafür, daran wird sich auch nichts ändern.\n> Entweder du änderst nun etwas an deiner Einstellung, löst deine Probleme, gehst nicht mehr afk und verlässt keine Spiele mehr oder du wirst weiterhin vor deinen Spielen 20 Minuten warten müssen.\n\nAlso ich feier neben deinen Antworten vor allem deinen Namen, hast dir einen cookie verdient {{item:2054}}","replies":[]}]},{"poster":"Patty91","date":"2016-03-12T19:20:03.925+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=MegaLui,realm=EUW,application-id=7hciEY9w,discussion-id=peEMLTnQ,comment-id=00000001,timestamp=2016-03-12T19:17:47.512+0000)\n>Es macht einfach keinen spaß jedes mal 20min zu warten nur weil ich essen, internet absturz oder sinstiges hatte. D:\n\nEs macht deinen Mitspielern keinen Spaß, jedes Mal einen weniger zu haben, nur weil du essen musst, Abtsürze hast oder sonstiges.\nErnsthaft, mit DIESEM Kommentar und der damit gezeigten Einstellung und Dreistigkeit, wünsche ich dir den Perma. Leider gibt es den für AFK nicht...","replies":[]}]},{"poster":"MegaLui","date":"2016-03-12T19:11:39.841+0000","up_votes":1,"down_votes":2,"body":"Es wird wirkölich nicht mehr vorkommen. es wäre eeecht cool","replies":[{"poster":"legofreak1","date":"2016-03-12T19:13:33.653+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MegaLui,realm=EUW,application-id=7hciEY9w,discussion-id=peEMLTnQ,comment-id=00000000,timestamp=2016-03-12T19:11:39.841+0000)\n>\n> Es wird wirkölich nicht mehr vorkommen. es wäre eeecht cool\n\nDann spiel die Zeit ab. Wenn es wirklich nicht mehr vorkommt, wirst du in Zukunft auch keine Probleme mehr damit haben. Abgesehen davon kann ich als Spieler sowieso nichts an deiner Strafe verändern. Und der Support wird das nicht machen, selbst wenn er vielleicht könnte.","replies":[]}]}]},{"poster":"Chiyoo x Anzuu","date":"2016-03-12T22:32:05.421+0000","up_votes":1,"down_votes":2,"body":"kommt es mir nur so vor, oder ist er 10?","replies":[]}]}