{"poster":"x Pissio","date":"2017-06-26T13:58:45.706+0000","title":"Calo di FPS per un istante","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"Salve a tutti,\r\n\r\nda un bel po&#039; di tempo ho un problema leggermente fastidioso. Premetto fin da subito che ho un PC di fascia alta (GTX 970, i5-6600, 16GB di RAM. Come OS ho W10 64bit) e quindi escluderei fin da subito il problema &quot;Hardware&quot;. In cosa consiste questo problema?\r\nOgni tot secondi (circa 10-15) gli FPS scendono da 60 a 40/50 per un istante, per poi ritornare subito a 60. E questo comporta ad un freeze temporaneo della schermata. Inizialmente il problema si presentava solo se giocavo in &quot;Schermo intero&quot;, ora lo fa anche in &quot;Senza bordi&quot; e &quot;In finestra&quot;.\r\nQualche giorno fa ho formattato del tutto il PC perch&egrave; si era rallentato in generale, e il problema persiste.\r\nTutti i driver sono aggiornati. Ho provato a disattivare il V-sync, niente. Non ho provato ad abbassare i settaggi grafici, questo perch&egrave; con un hardware del genere lo troverei un po&#039;.... imbarazzante. Ho provato anche a fare un repair del client, niente.\r\n\r\nQualcuno potrebbe aiutarmi? Grazie! {{item:3681}}","replies":[{"poster":"Chroniicles","date":"2017-06-27T08:05:21.486+0000","up_votes":2,"down_votes":0,"body":"Ciao! Se estraessi i log con [HRT](https://support.riotgames.com/hc/it/articles/224826367-Risoluzione-problemi-automatizzata-strumento-di-riparazione-Hextech) e li hostassi su dropbox (o simili), potrei scaricarli e consultarli per cercare di capire la causa di questo strano problema. Piuttosto magari di farti fare prove su prove ;)","replies":[{"poster":"x Pissio","date":"2017-06-27T09:48:21.752+0000","up_votes":1,"down_votes":0,"body":"Ecco a te. (https://www.dropbox.com/s/lzglm43k7akow64/Registri%20LoL.zip?dl=0)","replies":[{"poster":"Chroniicles","date":"2017-06-27T15:36:42.000+0000","up_votes":2,"down_votes":0,"body":"Ho esaminato i log, ti riporto cosa ho trovato che non va bene sperando che tra queste cose si nasconda la causa del problema:\n\n- c'è un errore ricorrente in Windows con questo processo:\n_** MSIDDRService.exe **_\n[Qui](http://www.file.net/process/msiddrservice.exe.html) ho trovato alcuni consigli sul come comportarsi, ti consiglio di provare a disinstallarlo e in caso reinstallarlo. Visita il sito della MSI e scarica i driver/tool da lì, se hai usato un cd o altro evita perchè potrebbero essere obsoleti; l'articolo riporta anche la possibilità possa nascondere un malware, avendo appena formattato penso sia difficile ma un controllo con [anti malware bytes](https://it.malwarebytes.com/) vale comunque la pena farlo.\n\n- ci sono altri processi duplicati/che non rispondono in lista, prova a fare un [avvio pulito](https://support.microsoft.com/it-it/help/929135/how-to-perform-a-clean-boot-in-windows) di Windows\n- ci sono un sacco di errori nel caricamento delle texture del gioco, prova a seguire questa [guida](https://support.riotgames.com/hc/it/articles/204134104-Impostare-le-autorizzazioni) per escludere interferenze col client\n- ho trovato un sacco di errori anche nel client (nonostante la riparazione) purtroppo non sono in grado di dirti da cosa dipendano/cosa comportino, ma se gli interventi sopra non sortiranno effetto conviene provare a reinstallare il gioco (usando la funzione in [HRT](https://support.riotgames.com/hc/it/articles/224826367-Risoluzione-problemi-automatizzata-strumento-di-riparazione-Hextech) magari)\n\nUna cosa te la dico in sincerità: il pc che hai dovrebbe far girare lol al massimo anche \"con un braccio solo, e bendato\" xD\nnon riesco proprio a capire tutti gli errori generati (ti giuro, sono una marea) e prestazioni tanto intaccate da non arrivare a fare nemmeno 60fps. \nTienimi aggiornato su cosa riesci a fare, e se hai bisogno di altri chiarimenti non esitare a chiedere","replies":[{"poster":"x Pissio","date":"2017-06-27T17:46:42.910+0000","up_votes":1,"down_votes":0,"body":"Ho fatto tutte le procedure possibili che potessi fare, ho raccolto dei nuovi registri, eccoti il link: https://www.dropbox.com/s/lzglm43k7akow64/Registri%20LoL.zip?dl=0\n\nDevo ancora vedere se il problema c'è ancora. {{summoner:3}}","replies":[{"poster":"Chroniicles","date":"2017-06-28T07:21:43.968+0000","up_votes":2,"down_votes":0,"body":"Visti, in aggiunta a quelli di prima c'è poco in realtà, però:\n- gli errori del client non ci sono più, a parte nell'ultimo avvio in cui ci sono alcuni warn\n- gli errori di **MSIDDRService.exe **sono rimasti, a cui se n'è aggiunto un altro relativo all'audio\n- il drop degli fps, nei game che ho visto dai log, sembra non essere cambiato in alcun modo\n\nAltri controlli da fare:\n- controlla che sia disabilitato il [gamedvr](https://support.steampowered.com/kb_article.php?ref=6239-DZCB-8600) in Windows\n- installa ccleaner e fa una pulizia dei registri\n- dato che hai un SSD, prova a seguire i passi di questa [guida](https://www.assemblarepconline.it/hdd-ssd/ottimizzare-ssd-per-windows-7-8/)\n\nTienimi aggiornato","replies":[{"poster":"x Pissio","date":"2017-06-28T08:11:00.148+0000","up_votes":1,"down_votes":0,"body":"Per gli errori di MSIDDRService.exe non ho capito allora come sistemarli. Ho disinstallato MSI Live Update, ma son rimasti a quanto pare. Ho fatto una pulizia dei registri con Ccleaner poco fa, magari servirà. Il DVR l'avevo già disattivato, ho seguito tutta la guida per l'SSD e tutte le altre.\n\nComunque, il problema se gioco in \"Senza bordi\" non ce l'ho più, però se gioco in \"Schermo intero\" il gioco va come a \"rallentatore\", il personaggio va a scatti.","replies":[{"poster":"Chroniicles","date":"2017-06-28T08:27:34.718+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=x Pissio,realm=EUW,application-id=98NGV4Al,discussion-id=5J8wZMuR,comment-id=000100000001000000000000,timestamp=2017-06-28T08:11:00.148+0000)\nil problema se gioco in &quot;Senza bordi&quot; non ce l&#x27;ho più, però se gioco in &quot;Schermo intero&quot; il gioco va come a &quot;rallentatore&quot;, il personaggio va a scatti.\n\nInfatti quando hai descritto questa sintomatica nel primo post, mi è venuto subito in mente potesse essere un problema con l'utilizzo del driver... dai log però non sembra esserci nulla di strano: il driver è aggiornato all'ultima versione e viene caricato correttamente dal gioco{{summoner:3}} \nPer non tralasciare nulla, proviamo questa strada:\n- logga con il tuo account nel client;\n- **mantenendo il client aperto**, spostati nella cartella del gioco, precisamente nella directory config, e cancella il file _game.cfg_ e _persistedsettings.json_. Quest'operazione ti resetterà le impostazioni (ho visto che hai anche degli item set, purtroppo li perderai ma non penso sarà un problema ricrearli);\n- starta una custom, renderà effettive le impostazioni. Una volta entrato in partita puoi chiudere game e client;\n- entra nel Pannello di controllo NVIDIA, seleziona _Gestisci le impostazioni 3D_ e poi clicca su Ripristina;\n- apri GFE, fa il rilevamento del gioco (se già non presente) ed esegui l'ottimizzazione automatica;\n- ravvia il pc;\n- entra di nuovo in una custom, assicurati di reimpostare eventuali personalizzazioni andate perse col reset, a livello di grafica controlla che il vsync sia attivo (per cappare gli fps alla frequenza di refresh del tuo monitor) e di disabilitare queste impostazioni dal menù interfaccia:\n> \n>     Togli la spunta ad Abilita animazioni interfaccia\n>     Togli la spunta a Mostra frame bersaglio all'attacco\n>     Togli la spunta ad Abilita visualizzazione traiettoria missili\n>     Togli la spunta a Mostra gittata attacchi\n\nVediamo così se otteniamo un miglioramento sostanziale","replies":[{"poster":"x Pissio","date":"2017-06-28T09:17:01.444+0000","up_votes":1,"down_votes":0,"body":"Sei una cosa incredibile, sembra che il problema sia svanito. {{summoner:4}} \n\nGrazie grazie mille! :)\n\n{{summoner:30}}","replies":[{"poster":"Chroniicles","date":"2017-06-28T09:20:56.531+0000","up_votes":1,"down_votes":0,"body":"Menomale ;)","replies":[{"poster":"x Pissio","date":"2017-06-28T09:58:46.907+0000","up_votes":1,"down_votes":0,"body":"{{summoner:3}} {{summoner:3}} {{summoner:3}} \n\nScherzavo, ho fatto un game intero e verso la fine ha ripreso a farlo. {{champion:122}} \n\nMannaggia mannaggia.","replies":[{"poster":"Chroniicles","date":"2017-06-28T10:30:24.383+0000","up_votes":1,"down_votes":0,"body":"Comincio ad esaurire le idee xD\nProvo a fare qualche ricerca e ti faccio sapere altre possibili soluzioni!\np.s. rimandami comunque i log aggiornati appena puoi","replies":[{"poster":"x Pissio","date":"2017-06-28T11:07:33.335+0000","up_votes":1,"down_votes":0,"body":"Ecco a te: https://www.dropbox.com/s/yp2d834smrrmujt/Registri%20LoL.zip?dl=0\n\nGrazie per la pazienza comunque.","replies":[{"poster":"Chroniicles","date":"2017-06-29T17:12:41.197+0000","up_votes":1,"down_votes":0,"body":"Ho visto i nuovi log: i primi game che hai fatto andavi una bomba, ho visto punte di 400fps e valori minimi di 200 xD\nHai modificato qualcosa dopo aver fatto i primi game? Ora la situazione è tornata simile a prima (dico simile, perchè la conta degli fps massimi è aumentata, ma son tornati i cali)","replies":[{"poster":"Chroniicles","date":"2017-06-30T06:44:01.186+0000","up_votes":1,"down_votes":0,"body":"Ripeti la procedura che hai fatto l'altra volta, se torna di nuovo a posto significa che è qualche impostazione che il pc non digerisce bene (dopo bisogna capire quale xD)","replies":[]},{"poster":"x Pissio","date":"2017-06-30T00:38:12.027+0000","up_votes":1,"down_votes":0,"body":"Da quel che ricordo no. 😂 Non ho toccato altro.","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Chroniicles","date":"2017-06-27T11:42:56.313+0000","up_votes":2,"down_votes":0,"body":"Li scarico e guardo, ti faccio sapere a breve ;)","replies":[]}]}]},{"poster":"Dr LouD","date":"2017-06-26T14:17:41.326+0000","up_votes":1,"down_votes":0,"body":"Se alzi il cap dei FPS succede comunque?","replies":[{"poster":"x Pissio","date":"2017-06-26T16:13:14.241+0000","up_votes":1,"down_votes":0,"body":"Si, purtroppo si.","replies":[]}]}]}