{"poster":"ShibberMeTibbers","date":"2018-04-05T20:04:36.132+0000","title":"Does Riot check post game chat","subforum":"Player Behavior","up_votes":1,"down_votes":0,"body":"I was told to kill myself in a norms match. my team stole all my jungle camps and i got behind so they flamed me all game for being behind even though it was their fault. they said they are more important than me and do more damage so theyre gonna take it. this guy said kys in the post game scoreboard page chat. i just returned from a 2 week ban myself so i doubt any of my reports will be taken seriously but being told to kill myself especially in a norms game is way over the top","replies":[{"poster":"breakordoom444","date":"2018-04-06T05:21:50.717+0000","up_votes":1,"down_votes":0,"body":"The simplest answer is. YES\nRiot has Bots monitoring each chat log and auto adjust reports.","replies":[]},{"poster":"KVbqbFsC8e","date":"2018-04-06T03:23:25.337+0000","up_votes":1,"down_votes":0,"body":"It can be checked via a manual review if Riot finds a reason to do so, but generally it isn't checked.  Its pretty unlikely to be punished for something said in pre/post game chat.","replies":[]},{"poster":"Boltonator","date":"2018-04-05T20:07:16.820+0000","up_votes":1,"down_votes":0,"body":"Riot checks every aspect of chat, whether it’s before the game, during the game or after the game. \n\nWhat you should be focusing on is how you word your report. Details are everything and action is more likely to occur if you point out specifically what the player said or did wrong, instead of simply saying “This person was very rude to me”\n\nA little effort goes a long way to change.","replies":[]},{"poster":"Imperial Pandaa","date":"2018-04-05T20:05:55.267+0000","up_votes":1,"down_votes":0,"body":"Post game chat is checked. Just not included in chat logs because different system for storing","replies":[]},{"poster":"Prandine","date":"2018-04-05T20:07:04.674+0000","up_votes":1,"down_votes":1,"body":"Yes, Riot does check pre- and post-game chat, and people have in fact been punished for poor behavior in those chats even if their in-game chat was clean. The reason they're not currently presented in reform cards is because they're stored on a separate server than the in-game chat is. Again though, rest assured that it is checked and it is taken into consideration when deciding whether to punish someone or not.","replies":[{"poster":"Grilled Penguin","date":"2018-04-05T22:20:02.619+0000","up_votes":1,"down_votes":1,"body":"Prove it.","replies":[{"poster":"Prandine","date":"2018-04-06T03:08:44.305+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Grilled Penguin,realm=NA,application-id=ZGEFLEUQ,discussion-id=Qa2rbXAj,comment-id=00010000,timestamp=2018-04-05T22:20:02.619+0000)\n>\n> Prove it.\n\nRiot Tantram talked a bit about it here: https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/HzvVO8zo-wrongful-ban-please-help?comment=001d","replies":[]}]}]},{"poster":"Hayes","date":"2018-04-05T20:08:13.791+0000","up_votes":1,"down_votes":1,"body":"your whole team was hot garbage, no real tank , your support only warded 15 times in a 30 min game, and your carries had horrible CS for a game that long. and everyone had a negative KDA. I would just go with \"they suck\" and move on.","replies":[]}]}