{"poster":"Misuky","date":"2016-07-21T23:44:07.647+0000","title":"Primera impresión y comentemos todos","subforum":"Discusiones sobre el Cliente","up_votes":2,"down_votes":0,"body":"Quer&iacute;a agradecer a los de riot por dejarme probar el alfa del cliente.\n* Como el la primera vez que hago un comentario seria que el cliente nuevo parece practico, me gusta el nuevo estilo visual  por hay el fondo de la parte del chat me gustar&iacute;a que  fuera con algo mas de luz y no tan contrastante con el negro, para mi tambi&eacute;n seria bueno poder bajar la parte de chat (capas soy el &uacute;nico que le incomoda), tambi&eacute;n poder a&ntilde;adir a los bloqueados, por que  me parece que al final de la partida no se puede, luego tarda un poco al cagar la sala de equipos, y los cambio en ella de campeones modificaci&oacute;n de maestr&iacute;as (aunque no tanto  ya que deber&iacute;a de tener las maestr&iacute;as listas :v), cambios de hechizo de invocador, me gusto la selecci&oacute;n de tipo de mapa que se implemento y el mensaje que se encontr&oacute;,  capas las letras mas grandes en general, con respecto a las hojas de runas est&aacute;n muy bien para mi el cambio, pero para cambias de hojas estar&iacute;a bueno  otra lista descendente con para las runas, y con la maestr&iacute;as creo que confunden un poco  los colores ya que se iluminan todo el &aacute;rbol hasta donde tenes puntos de maestr&iacute;as en lugar de apagarse al no estar seleccionadas o tener un recuadro con con las de un punto y un marco distintivo a la clave ya que juegan con las formas, tambi&eacute;n el cambio a la  visualizaci&oacute;n de los  hechizos de invocador me gustaron, se que est&aacute;n en desarrollo pero me gusta bastante como lo est&aacute;n haciendo.\nCon respecto espero que habiliten la tienda :3 y se pueda ver el mensaje si gane una llave para la artesan&iacute;a se que todav&iacute;a no la implementan aun pero solo el mensaje se agradecer&iacute;a, y en el perfil me gustar&iacute;a que centren la imagen del campe&oacute;n o que podemos elegir entre los que tenemos de maestr&iacute;a 6 para arriba, seria tambi&eacute;n mucho pedir poder poner alg&uacute;n skin que tengamos del mismo aunque se que seria mucho ya que las &uacute;nica deber&iacute;a de poder ser las definitivas.\nSaludos y si alguien mas quiere discutir sobre algunas cosas me gustaria que lo escriban :3{{sticker:slayer-jinx-wink}}\nPd: se traba demasiado en volver a la sala de espera cuando alguien abandona la seleccion de campeones","replies":[{"poster":"MAYURIKAMI","date":"2016-07-22T23:56:53.310+0000","up_votes":1,"down_votes":0,"body":"ACA el Mayu reportando \n\n1 el fondo de la parte del chat me gustaría que fuera con algo mas de luz y no tan contrastante con el negro.... 100% de acuerdo, ya de por si uso anteojos y me molesta deducir un poco o forzar la vista para leer \" vas a jugar o no b*****\"\n\n2 seria bueno poder bajar la parte de chat (capas soy el único que le incomoda).... No es el único a mi también me incomoda y la primera vez que entre apreté la \"x\" y me salí completamente... busque la opción pero al no encontrarla achique todos los chat pero me sigue pareciendo incomodo\n\n3  cambios de hechizo de invocador.... ammmm creo que esto estaria mejor como bug pero cambiar de {{summoner:32}}  a {{summoner:7}}  me dio error y termine yendo con {{summoner:32}}  con {{champion:40}}  :3 igual me divertí pero no era lo que quería\n\n4  con la maestrías creo que confunden un poco los colores ya que se iluminan todo el árbol hasta donde tenes puntos de maestrías en lugar de apagarse al no estar seleccionadas o tener un recuadro con con las de un punto y un marco distintivo a la clave ya que juegan con las formas.... otro 100% no distingo muy bien las maestrías claves y ese doble circulito me parece insuficiente, volvemos a forzar la vista \n\n5 con respecto a las hojas de runas están muy bien para mi el cambio, pero para cambias de hojas estaría bueno otra lista descendente con para las runas.... emmm 60% de acuerdo , no me gusta que sea tan opaco el color no distingo bien entre las de grado 2 y 3, la forma de las quintaesencias me suena a poco pero serian mejorables.\n\nNo me extiendo mas cambio y fuera :3 {{sticker:zombie-brand-clap}}","replies":[]},{"poster":"Chinizuelo","date":"2016-07-22T17:44:05.586+0000","up_votes":1,"down_votes":0,"body":"La primera impresion mia fue que era lento, como todo nuevo confuso y faltaban indicadores de que donde y como.\n\nLo bueno fue que estructuralmente hablando es el paso necesario para cualquier juego que desee mantenerse en el tiempo.\n\nEl cliente se siente robusto, facil de acceso algunos aspectos, muy pulido visualmente y claro y conciso.\n\nLa barra de chat por el estilo de colores que tiene se siente que deberia poderse minimizar.","replies":[]},{"poster":"Wollff","date":"2016-07-22T02:39:18.298+0000","up_votes":1,"down_votes":0,"body":"Personalmente me gusto mucho el cliente, todavía lo estoy probando, la sección de los hechizos me pareció excelente! me gustaría que se pueda decorar \"temáticamente\" el launcher, por ejemplo, usando colores o símbolos de noxus demacia, etc, o utilizando detalles de nuestros campeones favoritos. Exelente trabajo, espero podamos colaborar entre todos para que pronto esté en beta abierta!!","replies":[]},{"poster":"Mazer Rakham","date":"2016-07-22T02:12:46.033+0000","up_votes":1,"down_votes":0,"body":"A mí en lo general, me encantó. Estéticamente es muy agradable en todo. Lo que me gustaría es que cambien las imágenes en la sección de runas, una versión actualizada de las viejas estaría copado, las de ahora me parecen muy simples. También que cuando elegís crear una nueva página de maestrías te redireccione  a la página nueva y no que tengas que buscarla. Por lo demás, es genial!","replies":[]},{"poster":"pelu4theworld","date":"2016-07-22T00:17:30.204+0000","up_votes":1,"down_votes":0,"body":"A mi me gusto mucho , si bien no esta terminado y no hay mucho que probar me parece mucho mas lindo estéticamente ademas. lo de volver a la sala es verdad , lo que no vi fue que al aceptar una partida no podes ver cuantos la aceptaron. aparte de eso me parece increíble   \n{{sticker:zombie-nunu-hearts}}","replies":[]}]}