{"poster":"Blackavar","date":"2015-02-21T01:21:25.538+0000","title":"A manga I am making","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Hello everyone, on the boards every so often I will be posting a new chapter for a manga I'm making. The name isn't decided yet but if you're interested looks for posts by me. The manga will be Sci-fi and the story will be about 3 different sides fighting for what they think is right, the 3 different sides are:\r\n\r\nThe people fighting for the law (name undecided)- These guys protect the law and 'protect' earth's last remaining metal.\r\n\r\nThe people that are against the law protectors (name- metallica (could change later))- these guys are against the laws motives and they want freedom from there reign. the story follows these guys and everyone have this device on there arm which helps them in battle called gear metallica\r\n\r\nThe religious guys- they are against all technology and are against metallica and the law. these guys have magic.\r\n\r\nthere is still alot of undecided stuff and i will post more, these ideas are all very rough and are subject to change, please tell me if you like the ideas so far and please give me advice if you have any, criticism is fully allowed and please tell me ways i can fix my mistakes if i ever do any. thankyou.\r\n\r\n and here is a remix of parra for cuva wicked games and DJ sona ethereal https://www.youtube.com/watch?v=-7X2mEm4zCY","replies":[{"poster":"Shyvana Bot","date":"2015-02-21T02:43:47.789+0000","up_votes":1,"down_votes":0,"body":"I think the story is interesting, what faction would the main character belong to? Will he maintain one faction or will there be faction swapping? are these 3 factions of the primary players in your manga or will there be a hidden faction lurking in the shadows? will this be shounen, shoujou, action, adventure along with the sic-fi element? Will the main character be a lone wolf or will he travel with his gang. What is the motive behind the acquisition of the metal? what year is the story going to be set in? if its futuristic why do they need this metal? does it have any special properties? \n\nSome other stuff you need to think about include, the art style you will be using.\n\nI would also recommend you read this manga, [Bakuman](http://mangafox.me/manga/bakuman/) , it is a manga about a guy making a manga and provides lots of insight into the manga making world.\n\nHappy manga making and i look forward to enjoying your work.","replies":[{"poster":"Blackavar","date":"2015-02-21T05:06:45.195+0000","up_votes":1,"down_votes":0,"body":"The main character will start of in the law faction then change to the metalica faction. It will be mostly action but i'm not sure if i should make it so there are alot of planets they go to. the year is undecided but due to some 'unknown' reason the sun has gotten a lot bigger so the earth is mostly dried up. the metal has all been used on robots and hi tech buildings.\ni have read bakuman","replies":[]}]}]}