{"poster":"THE HUNTERS","date":"2017-09-02T01:16:46.606+0000","title":"so i got perma banned for defending my self and telling trolls to shut up","subforum":"Player Behavior","up_votes":1,"down_votes":15,"body":"so about a week ago i got perma banned for telling some trolls to shut up and not to talk to me while im farming jg so they\nsomehow died 5 times in less then 15 minutes and blame me for the game because i didnt gank them which i did but wasnt successful\nbecause they were so behind so after that  i got flammed for the rest of the game i told them to shut up and they just kept talkin shiit all game \nso i cuss them alittle bit to shut them up which kinda worked but got me banned but not them so riot tell me how is this fair ? so when they talk shiit to me\nall day they dont get banned but when i use two or 1 bad word i get banned instantly wow riot i cant believe you ? then i got this pop up  in my screen  which kind of confused me when i log into the account that says &quot;Inactivity notification  you are close to becoming inactive in ranked. You have 8 days left before in activity causes your lp to decay , which can cause you to drop divisions and tiers &quot;       Chat logs here >>Game 1\nTHE HUNTERS: how are you match with us\nTHE HUNTERS: good\nTHE HUNTERS: leash\nTHE HUNTERS: plz\nTHE HUNTERS: thnx\nTHE HUNTERS: wait\nTHE HUNTERS: me\nTHE HUNTERS: care\nTHE HUNTERS: my red\nTHE HUNTERS: ffs\nTHE HUNTERS: wjhy the fck\nTHE HUNTERS: would u go\nTHE HUNTERS: kay\nTHE HUNTERS: top\nTHE HUNTERS: clasic\nTHE HUNTERS: but\nTHE HUNTERS: that doesnt\nTHE HUNTERS: mean\nTHE HUNTERS: sahiiit\nTHE HUNTERS: fck opff\nTHE HUNTERS: and\nTHE HUNTERS: play\nTHE HUNTERS: ffs\nTHE HUNTERS: fkcing\nTHE HUNTERS: rash\nTHE HUNTERS: trash\nTHE HUNTERS: team\nTHE HUNTERS: always\nTHE HUNTERS: mind\nTHE HUNTERS: fckling\nTHE HUNTERS: of\nTHE HUNTERS: biches\nTHE HUNTERS: cant\nTHE HUNTERS: even\nTHE HUNTERS: win\nTHE HUNTERS: their own\nTHE HUNTERS: lanes\nTHE HUNTERS: without a gank\nTHE HUNTERS: stfu\nTHE HUNTERS: ohh\nTHE HUNTERS: do i\nTHE HUNTERS: why dont u\nTHE HUNTERS: check\nTHE HUNTERS: idiot\nTHE HUNTERS: mind reporting bot and top plz\nTHE HUNTERS: extremly toxic\nTHE HUNTERS: and not polite at all\nTHE HUNTERS: wel;l\nTHE HUNTERS: we aint wining\nTHE HUNTERS: this\nTHE HUNTERS: im teling ya\nTHE HUNTERS: clasic\nTHE HUNTERS: iv\nTHE HUNTERS: lmao\nTHE HUNTERS: ohh\nTHE HUNTERS: now\nTHE HUNTERS: she wants\nTHE HUNTERS: too ff\nTHE HUNTERS: lmao\nTHE HUNTERS: sit down\nTHE HUNTERS: kid\nTHE HUNTERS: and play\nTHE HUNTERS: game\nTHE HUNTERS: fck\nTHE HUNTERS: 3\nTHE HUNTERS: we almost\nTHE HUNTERS: had it\nTHE HUNTERS: lmao\nTHE HUNTERS: report me for what idiot\nTHE HUNTERS: she blames me for loosing to a jayce \nTHE HUNTERS: report lb\nTHE HUNTERS: now\nTHE HUNTERS: for bitchingg out\nTHE HUNTERS: gg\nTHE HUNTERS: Gg\nGame 2\nTHE HUNTERS: bot hard leash\nTHE HUNTERS: thnx\nTHE HUNTERS: tat\nTHE HUNTERS: q\nTHE HUNTERS: e\nTHE HUNTERS: wave\nTHE HUNTERS: bot\nTHE HUNTERS: where you\nTHE HUNTERS: at\nTHE HUNTERS: wtf\nTHE HUNTERS: mid\nTHE HUNTERS: any sums\nTHE HUNTERS: k\nTHE HUNTERS: clasic\nTHE HUNTERS: wtf\nTHE HUNTERS: was that\nTHE HUNTERS: wow\nTHE HUNTERS: see\nTHE HUNTERS: wont mater\nTHE HUNTERS: its 4v5\nTHE HUNTERS: why are we even\nTHE HUNTERS: trying\nTHE HUNTERS: just get that bich\nTHE HUNTERS: banned\nTHE HUNTERS: and move forward\nTHE HUNTERS: report adc plz\nTHE HUNTERS: hec\nTHE HUNTERS: care\nTHE HUNTERS: gg\nTHE HUNTERS: just get hjer baned \nTHE HUNTERS: bich didnt say shiit she died twice and straight out quited \nTHE HUNTERS: u geting banned\nTHE HUNTERS: anyways\nTHE HUNTERS: oohh look she is bak\nTHE HUNTERS: k\nTHE HUNTERS: r\nTHE HUNTERS: fc\nTHE HUNTERS: mind\nTHE HUNTERS: fkcing off\nTHE HUNTERS: bich\nTHE HUNTERS: easy\nTHE HUNTERS: we\nTHE HUNTERS: can\nTHE HUNTERS: play around team\nTHE HUNTERS: see\nTHE HUNTERS: lul\nTHE HUNTERS: lmao\nTHE HUNTERS: thnx bois\nTHE HUNTERS: rkaan\nTHE HUNTERS: is the gota\nTHE HUNTERS: goat\nTHE HUNTERS: tat\nTHE HUNTERS: r\nTHE HUNTERS: care\nTHE HUNTERS: we\nTHE HUNTERS: did\nTHE HUNTERS: good tho\nTHE HUNTERS: siv and\nTHE HUNTERS: xerath\nTHE HUNTERS: first\nTHE HUNTERS: get now\nTHE HUNTERS: let me buy\nTHE HUNTERS: Eqasy\nTHE HUNTERS: easy\nTHE HUNTERS: lul\nTHE HUNTERS: inhbi\nTHE HUNTERS: reset ten\nTHE HUNTERS: prepare\nTHE HUNTERS: bar\nTHE HUNTERS: no smite\nTHE HUNTERS: let me buy\nTHE HUNTERS: holy fck i do\nTHE HUNTERS: so much dmg\nTHE HUNTERS: brand\nTHE HUNTERS: blue\nTHE HUNTERS: gg\nTHE HUNTERS: easy\nTHE HUNTERS: i need\nTHE HUNTERS: 4 honors\nTHE HUNTERS: boys\nTHE HUNTERS: Gg","replies":[{"poster":"The Djinn","date":"2017-09-02T01:36:16.640+0000","up_votes":9,"down_votes":0,"body":"> [{quoted}](name=THE HUNTERS,realm=NA,application-id=ZGEFLEUQ,discussion-id=nlGMW9kM,comment-id=,timestamp=2017-09-02T01:16:46.606+0000)telling some trolls to shut up and not to talk to me while im farming\n\nLet's take a look.\n\n> THE HUNTERS: ffs\n> THE HUNTERS: fkcing\n> THE HUNTERS: rash\n> THE HUNTERS: trash\n> THE HUNTERS: team\n> THE HUNTERS: always\n> THE HUNTERS: mind\n> THE HUNTERS: fckling\n> THE HUNTERS: of\n> THE HUNTERS: biches\n> THE HUNTERS: cant\n> THE HUNTERS: even\n> THE HUNTERS: win\n> THE HUNTERS: their own\n> THE HUNTERS: lanes\n> THE HUNTERS: without a gank\n>\n> THE HUNTERS: idiot\n> THE HUNTERS: sit down\n>\n> THE HUNTERS: just get that bich\n> THE HUNTERS: banned\n> THE HUNTERS: bich didnt say shiit she died twice and straight out quited \n> THE HUNTERS: u geting banned\n> THE HUNTERS: fkcing off\n> THE HUNTERS: bich\n\nNope, this isn't asking them not to talk to you. This is calling them trash, calling them bad, calling them bitches, and telling them to fuck off. That's not the same at all, and will definitely get you punished.","replies":[{"poster":"THE HUNTERS","date":"2017-09-02T01:54:51.362+0000","up_votes":2,"down_votes":6,"body":"so you just expect me to just sit there and let them ruin my game and not do anything about it if thats what you are suggesting then might aswell just get rid of chat if thats what you expect some players to do this discusting players just quited and made me do all the work so i told them to shut up and let me do my thing as you can see whenever i used the word f*** it was to shut them up i know instead of muting i defended my self but perma ban for this nah i reported them but nothing happens but when they report me i get banned lmao intelligent company","replies":[{"poster":"The Djinn","date":"2017-09-02T01:58:45.050+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=THE HUNTERS,realm=NA,application-id=ZGEFLEUQ,discussion-id=nlGMW9kM,comment-id=00030000,timestamp=2017-09-02T01:54:51.362+0000)so you just expect me to just sit there and let them ruin my game\n\nNo, I don't expect that, and I know for a fact that that's not the only course of action Riot expects. There is a whole range of polite options between sitting idly and spewing insults. \"Hey, guys -- knock it off please, okay?\", for example. Because let's be honest -- if they want to ruin your game, they will. Ranting at them won't help, and all it does is make everyone a little angrier and a little less happy.\n\nEven telling someone to shut up every now and then won't get you in trouble.\n\nSpending an entire gaming telling someone to shut up, calling them a bitch (or bich, in this case -- the meaning is obvious), and calling them trash though? That WILL get you in trouble.\n\nThere's reasonable frustration, and then there's needless and insulting venting. This is the latter.","replies":[{"poster":"THE HUNTERS","date":"2017-09-02T02:05:12.122+0000","up_votes":2,"down_votes":1,"body":"but how come i get the ban and not them like riot says trolls and scripters get punished too but i dont see any improvement from riots side. like i could understand being banned for trolling or scripting those are two horrible things that im aware of at all times but people can get mad sometimes that doesnt mean that they are so bad and trolls  as you can see i didnt start the fight i was being bullied so i stood up and said what i said which doesnt mean that i act like this all the time. those trolls always gets away not surprised at all and riot just sits there and report you because you talked back interesting =)","replies":[{"poster":"The Djinn","date":"2017-09-02T02:10:10.873+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=THE HUNTERS,realm=NA,application-id=ZGEFLEUQ,discussion-id=nlGMW9kM,comment-id=0003000000000000,timestamp=2017-09-02T02:05:12.122+0000)\n>\n> but how come i get the ban and not them like riot says trolls and scripters get punished too but i dont see any improvement from riots side\n\nIf you are not yourself a troll or a scripter, you will not often see the punishments being handed out, as account punishments are kept fairly private -- often the single person who triggers the punishment with their report will see a message, but that's about it. Riot does come down pretty hard on trolling and scripters any time they are identified.\n\n>but people can get mad sometimes that doesnt mean that they are so bad and trolls\n\nThis is why there are several warnings, and why the system is fairly forgiving. Once those warnings are used up, however, the system hits hard.\n\n>i was being bullied so i stood up and said what i said which doesnt mean that i act like this all the time.\n\nThe response to being bullied is _not_ to bully back. Stand your ground, certainly, but do not stoop to their level.","replies":[{"poster":"THE HUNTERS","date":"2017-09-02T02:29:47.591+0000","up_votes":1,"down_votes":0,"body":"so how i know that riot needs to improve their system is people like the ones i got in my game still play aroound and troll peoples games and there is nothing that riot can do but say we are looking closely to those trolls which they dont if they actually  banned trolls this game wouldve become alot funner like s2 or 3 so thats how, and the other thing is i didnt say words that really hurt peopels feeling like \"kys\" or get \"cancer\" so i dont see why this deserved a perma people use fuck daily not gonna lie with you but those other words maybe once when they get mad plus i dont use any racism or homophonic words ext .","replies":[{"poster":"The Djinn","date":"2017-09-02T02:33:02.715+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=THE HUNTERS,realm=NA,application-id=ZGEFLEUQ,discussion-id=nlGMW9kM,comment-id=000300000000000000010000,timestamp=2017-09-02T02:29:47.591+0000)so i dont see why this deserved a perma people use fuck daily,,,\n\nCursing is just fine. Fuck fuck fuckity fuck fuck. There's no rule against cursing (unless it's a slur). There IS a rule against harassing/insulting/belittling other players though. You can say \"fuck, that was close\" or \"fuck Rengar deals a lot of damage\" as much as you want. You can't say \"fuck you, you bitch\" to another community member.\n\nYou started crossing that line when you called your team \"fucking trash\" and \"idiots\" -- that behavior is using curse words an an intensifier for insults, and those insults are the real issue here.","replies":[{"poster":"THE HUNTERS","date":"2017-09-02T04:01:43.872+0000","up_votes":1,"down_votes":0,"body":"hi again the thing is when i used fuck it was when i died to minions or something like that i used fucked in the first game bro believe  me im not making this up those kids made me want quit for live like ive never been trolled this hard in my life and got banned for it thats little bit too much for a player thats tryna have fun but trolls want to ruin his game so thats the reason why i kinda went overboard and talked back well i said what i had in my mind will see how riot reacts to this .","replies":[]}]}]}]},{"poster":"Geauxx","date":"2017-09-02T02:07:53.541+0000","up_votes":1,"down_votes":0,"body":"because you do this consistently and the others more than likely don't","replies":[{"poster":"THE HUNTERS","date":"2017-09-02T02:24:52.358+0000","up_votes":1,"down_votes":1,"body":"do what?  you clearly have no idea of what you speak lmao if i acted like this i wouldve gotten banned long ago so take your opinion somewere plz coz clearly you just dont understand what i wrote this was unfair some people get away with mistakes that are way worst than this but when i i say 1 or 2 words i get banned thats what i said read again.","replies":[{"poster":"Geauxx","date":"2017-09-02T04:51:00.851+0000","up_votes":1,"down_votes":0,"body":"lmao what you said literally made sure you don't know how this works\n\n\nand the only thing you're doing in your post is acting like a child crying for others to get punished cause you got punished.\n\n\nlike we understand that you don't know how the report system works and that you're self absorbed but come on, stop being blind fam.\n\n\nand im saying you're toxic in multiple games over and over so u got banned but you act like it was only for those 2 games. you're so oblivious","replies":[{"poster":"THE HUNTERS","date":"2017-09-02T23:23:06.209+0000","up_votes":1,"down_votes":0,"body":"first of all you dont know shiit about me so stop talking to me like you know me , second of all how you know i act like this all the time huh , do you really think i would last 4 years if i had this kinda behavior use your brain fam.\nAnd the other thing is  i said i could understand being baned for trolling quiting games and flaming people so hard which i dont think needs perma ban , But i could understand being banned for those things but telling some dumbas kid to shut up and not talk to me while we in game deserve a ban nah thats something i never knew about self defense deserves perma ? comon riot what are you on right here.","replies":[{"poster":"Geauxx","date":"2017-09-02T23:27:33.621+0000","up_votes":2,"down_votes":0,"body":"1. i don't need to know you\n2. i know you act like this cause you got permabanned for it.\n3. yes you would its what toxic people like you do.\n4. talking shit back to people that are talking shit to you isn't an excuse to believe you don't deserve to be in trouble. you agreed to the terms u failed to uphold them\n5. need i go on? or have you learned you're just toxic and deserved to be banned... jk you'll prob just continue being oblivious","replies":[]}]}]}]}]}]}]}]}]},{"poster":"ArchMageM4gnus","date":"2017-09-02T01:49:14.630+0000","up_votes":1,"down_votes":0,"body":"Youre suppose to just mute and then report them. How is arguing with someone going to change their view of you? \n\n\"You're an asshole\"     oh...yes, you're right...Im sorry. Yea, thats never gonna happen.","replies":[{"poster":"THE HUNTERS","date":"2017-09-02T01:57:19.108+0000","up_votes":1,"down_votes":1,"body":"well the thing is ive seen this kinda of players in the past riot just hunts the victims not the trolls and scripters just when someone says 1 bad word boom perma lmao my 14 days ban was like 4 months ago then i decided to not talk shiit but when you get those players on your team they wont just talk shiit but feed their ass of and make you want to quit league for good coz thats all they care about and riot doesnt do anything about it seems fair","replies":[{"poster":"ArchMageM4gnus","date":"2017-09-02T02:43:47.464+0000","up_votes":1,"down_votes":0,"body":"The fact you got banned shows that Riot does care. Riot does do a lot of bans. Start a new account and just see how many people are starting over again because their mains actually got banned. I've had friends that have had multiple accounts banned and they never learn. I know the feeling of wanting to defend yourself is strong, but its a lose-lose situation. You are always taught to stick up for yourself but on the internet that's basically a complete waste of time.\n\nIgnore, report. Guaranteed if they keep up the attitude they will be banned. I've had countless messages from Riots thanking me for reports that have led to players being punished, so I know it's working. The last one was just last night.","replies":[{"poster":"THE HUNTERS","date":"2017-09-02T03:54:12.979+0000","up_votes":1,"down_votes":0,"body":"i know riot used to run a program where if you get perma banned you have to level up a new account but they said the successful rate was like 2% man if they run that again i will be on top people deserve atleast last chance or something some people play this countless hours if they get banned all those hours are for nothing i get that riot want remove toxic players from the game but that wont help toxic players too they just gonna start a new account and move on from there. that wont even help riot they just get rid of people they will loose so many costumers watch everyday i check players behavior i atleast see 4 or 5 banned reports daily and if people keep getting banned like tis game will die ,","replies":[{"poster":"ArchMageM4gnus","date":"2017-09-02T07:44:42.343+0000","up_votes":2,"down_votes":0,"body":"How many chances do you need? You get the popup basically saying you've been bad and you need to type \"I Agree\".\n\nYou then get somewhere between 1 - 3 chat bans. If thats not enough you then get actual suspensions, and finally a ban. You're basically calling Riots bluff the entire time that they won't take that step and actually ban you.","replies":[{"poster":"THE HUNTERS","date":"2017-09-04T01:25:39.369+0000","up_votes":1,"down_votes":0,"body":"im not calling riot anything im just saying baning people of the game wont help you probably silver or bronze so you dont put as much work  as other high elo players put in this game so this is a basic stuff for you people in higher elo are so toxic like extremely toxic in higher diamonds and higher plat the y talk shitt daily and hourly and still get away with it so how is that fair","replies":[]}]}]}]}]}]},{"poster":"Squidwards House","date":"2017-09-02T04:56:13.269+0000","up_votes":2,"down_votes":0,"body":"small advice: telling a troll to shut up gives him everything he wants. attention. and in 100% of the cases, this wont make him stop.","replies":[]},{"poster":"Primaquarius","date":"2017-09-02T18:44:40.469+0000","up_votes":1,"down_votes":0,"body":"\"u geting banned\"\n\n#30 minutes later\n\n\"i need 4 honors boys\"","replies":[]},{"poster":"Subdue","date":"2017-09-02T01:17:06.805+0000","up_votes":1,"down_votes":0,"body":"Logs?","replies":[{"poster":"THE HUNTERS","date":"2017-09-02T01:19:25.920+0000","up_votes":1,"down_votes":0,"body":"they already there homie","replies":[]}]},{"poster":"Leylania","date":"2017-09-02T01:18:21.712+0000","up_votes":1,"down_votes":0,"body":"Post your chatlogs.","replies":[]}]}