{"poster":"exrex","date":"2017-07-17T00:18:24.418+0000","title":"Desmintiendo \"culpa de la comunidad\"","subforum":"Comportamiento del jugador","up_votes":14,"down_votes":8,"body":"El post que voy a desmentir es el siguiente\nhttps://boards.las.leagueoflegends.com/es/c/comportamiento-del-jugador/XAXby2Ju-culpa-de-la-comunidad\n\nEn resumen el autor y muchos de los que comentan culpan al usuario de no utilizar los reportes para que baje la cantidad de trolls. Eso es totalmente mentira, y lo explico con pruebas que ustedes mismos pueden verificar. \n\n\n------------------------------------------------------------------------\n\n--------------Hipotesis\nLa culpa no la tiene la comunidad, la tiene riot. La comunidad responde al comportamiento que tuvo riot hacia los trolls y afk dej&aacute;ndonos a merced de sistemas autom&aacute;ticos defectuosos y pretextos que terminaron por destrozar la imagen de los reportes en league of legends. \n\n\n--------------Desarollo\nAcuerdense de cuando podias ponerte de acuerdo con tu team para reportar a un solo jugador que nada hab&iacute;a dicho y tampoco hecho para que le cayera restricci&oacute;n de chat. Que aparte estaba bugueado porque la cantidad de partidas que tenias que jugar con la sanci&oacute;n, nunca bajaban. En su momento riot dijo que estaba todo perfecto... \n\nAcu&eacute;rdense  de cuando el tribunal estuvo bugeado desde el inicio mostr&aacute;ndote casos repetidos una y otra vez.  De nuevo los rioters dijeron que estaba todo perfecto hasta que admitieron su error ya cuando estaban listo de reemplazar el tribunal por el sistema actual. \n\nLos viejos foreros se acordaran del primero drop hack en LAS. Los rioters no solo se tardaron un mes en permabanearlo, sino que antes de eso prohibi&oacute; a los foreros a hablar sobre el tema y daban duras sanciones a aquellos que segu&iacute;an insistiendo. \n\n--------------------------------------------------------------------------------\n\n------------Conclusion\nCada uno de estas razones erosionaron la imagen que tiene la comunidad sobre el reporte. Entonces la mayoria cree que no funciona, otro porcentaje cree que los reportes son totalmente al azar. \n\nEntonces &iquest;es culpa de la comunidad que siempre reclama sanciones a los toxicos?, &iquest;o la culpa es de riot que se dejo estar? \nRiot hizo que los reportes pierdan credibilidad, Riot tiene que recuperar la confianza en la comunidad para que vuelvan a confiar en los reportes. \n\nSi no me creen, fijense el impacto que tuvo el sistema de honor en la comunidad, &iquest;no les parece que hay menos comportamiento toxico? estas cosas solo las puede hacer riot. no la comunidad. La comunidad actua cuando ve progreso, si no ve progreso entonces no le encuentra sentido hacerlo. \n---------------------------\n\nPD: Los amo &lt;3","replies":[{"poster":"Yoen","date":"2017-07-17T01:10:14.469+0000","up_votes":5,"down_votes":2,"body":"No estoy de acuerdo sinceramente,\n\nAntes que nada, nosotros, todos lo que jugamos al \nLoL técnicamente somos **_usuarios_** de un  software para\njugar (League Of Legends).\n\nSignifica que  a nosotros como jugadores,\nse nos prestan las cuentas, a cambio de aceptar \nlos términos  de uso.\nSomos usuarios porque utilizamos una cuenta.\n\nEs como que algo o alguien te presta algo y \nnosotros  aceptamos las consecuencias y\nresponsabilidad por el uso de ese algo.\n\n\nLos jugadores que fomentan la mala experiencia\ncomo los  tóxicos, trols, afks, hackers, estafadores,\nson los que usan mal la cuenta y genera la reputación\nde mala comunidad.\nLos jugadores que no reportan, que hacen un mal uso\ndel reporte, y que permanecen neutrales,\nTambién forman parte de esa causa de mala comunidad,\npor no querer usar el mute all, remake, rendicion, report, \ndodge, mute ping, seguridad de las cuentas. etc.\n\nEn general, **_el problema es causado por la comunidad_**,\nno de Riot, porque Riot no tiene ninguna obligación legal, moral\n de corregir actitudes personales  y solo puede limitarse a ofrecer\nel juego y el servidor con las herramientas de control de convivencia.\n\n\nEl sistema de honor es un incentivo, Riot lo ha puesto\ndisponible, pero el cambio no fue por Riot,\nfue por nosotros,\nAsí que el contexto que se forja en este juego, es por\nnosotros como usuarios.\n\nSuerte","replies":[]},{"poster":"TURFORANAI","date":"2017-07-17T02:37:53.852+0000","up_votes":2,"down_votes":1,"body":"Sí pero te equivocas en algo, los Rioters de LAS no trabajan en Riot Central osea Corea del Sur.","replies":[{"poster":"DanteV","date":"2017-07-17T05:45:05.766+0000","up_votes":2,"down_votes":0,"body":"Riot central no esta en kr.","replies":[{"poster":"TURFORANAI","date":"2017-07-17T20:46:02.982+0000","up_votes":1,"down_votes":1,"body":"No si va a estar en NA","replies":[{"poster":"DanteV","date":"2017-07-18T03:42:24.030+0000","up_votes":1,"down_votes":0,"body":"Es sarcasmo o ignorancia extrema? Porque no entiendo.","replies":[{"poster":"TURFORANAI","date":"2017-07-18T05:00:27.396+0000","up_votes":1,"down_votes":0,"body":"Un poco de los tres.","replies":[]}]}]}]}]},{"poster":"MrMagnífico","date":"2017-07-17T03:27:49.121+0000","up_votes":2,"down_votes":0,"body":"Para mi el sistema de reportes, dentro de todo, funciona. ¿Tendría que ser más severo? Si, seguramente.\n El problema es, como decís, que la gente no confía y piensa que no vale la pena reportar, pasa porque no tenemos ningún dato de cómo funciona, tendrían que poner, por lo menos, un resumen mensual de sancionados... o algo.\n Por mi parte sigo reportando así sea por un \"izi\".","replies":[]},{"poster":"Gretta Thunberg","date":"2017-07-17T00:45:06.925+0000","up_votes":3,"down_votes":2,"body":"Creo que riot tiene la mitad de la culpa.\n\nte explico riot es una empresa y ellos no pueden permabannear a alguien por flamear en una partida practicamente nadie estaria jugando yo he flameady y posiblemente tu igual. El tema es que Riot no maneja eso te voy a dar un ejemplo claro de la ineptitud de riot y eso provoca trolls y una comunidad toxica.\n\nSalio el nuevo campeon tu entras a una ranked y ves que alguien quiere probarlo en ranked, que haces tu? pues banneas el campeon no? es lo logico para probar champs champs hay normales. listo banneas a kayn el tipo te flamea y dice troll y te trolea la partida.\n\nDe quien es culpa? una de riot por que ellos saben que los nuevos campeones y reworks deberian estar desabilitados el menos 2 semanas o una semana para ligas bajas para precisamente evitar eso.\n\nQuien mas tiene la culpa? el jugador existen mas de 130 campeones en el lol y el llora por uno que salio ayer me entiendes por que la culpa no es completa de rito? que sus actos llevan a una mala comunidad por no saber manejar bien las cosas totalmente de acuerdo pero tambien existe culpa por parte de la comunidad.","replies":[]},{"poster":"Sphyx01 ","date":"2017-07-17T01:51:31.725+0000","up_votes":1,"down_votes":0,"body":"Yo sinceramente y mirandolo desde otra perspectiva, creo que la \"toxicidad\" de la comunidad o mas bien la toxicidad en general, es algo mas cultural (costumbres), que por el sistema de reportes o \"comportamiento del jugador\", si bien Riot tiene responsabilidad en este tema, también es responsabilidad de nosotros, es solo mi opinión y desde mi punto de vista. No me desplayo mas porque me da pereza escribir un testamento xd.","replies":[{"poster":"exrex","date":"2017-07-17T02:12:29.379+0000","up_votes":1,"down_votes":0,"body":"Conta conta, que estamos aca entre amigos. Yo siempre leo todo. Aparte hice el post porque no podia jugar por el delay.  \nPara ponerlo mas simple, primero plantear que no estamos en la jungla,  imaginate el lol como si fuera un bar, Los encargados son los responsables de echar a la gente que no respeta las normas del lugar, ya que al entrar ofrecen a sus clientes determinadas experiencias. \nSi los encargados no cumplen con su trabajo, entonces la experiencia se arruina y los clientes no tienen la culpa de que los encargados no actuen en tiempo y forma para brinda esa experiencia prometida. \nPero ojo, cuando al bar le debes dinero, las medidas son inmediatas. Esto quiere decir que los medios estan, Lo que no estan son las ganas de los encargados a enfocarse en ese problema.","replies":[{"poster":"Sphyx01 ","date":"2017-07-18T05:36:05.280+0000","up_votes":1,"down_votes":0,"body":"En parte si, tienes razón, sobre todo en la parte en la que hablas del dinero y riot, seguramente lo tendrá como prioridad alta, pero una ultima cosa que a muchos se nos olvida, y es que Riot no es una empresa \"utópica\" en donde busca el equilibrio en cuanto a sus clientes (jugadores) y ellos (entidad/empresa) y recuerda que el fin de cada proyecto de empresa es generar ingresos, por lo que es obvio que tienen en mas alto estima puntos que beneficien esa causa.","replies":[]}]}]},{"poster":"Perdí Un Meep","date":"2017-07-17T08:09:32.515+0000","up_votes":1,"down_votes":0,"body":"Sos un groso,embarazame y embaraza a mis futuras hijas,ahr","replies":[]},{"poster":"Alekséi Románov","date":"2017-07-17T05:46:06.668+0000","up_votes":1,"down_votes":0,"body":"Me gusta tu post. \n\nY si, creo que la culpa desde un principio es de Riot. \nSu sistema funciona, pero en si es algo defectuoso y no siempre cumple con el pedido de cada jugador. Aunque hay que admitir que mucha gente reporta absurdamente y sin sentido. Un ejemplo muy claro son las premade, donde cuatro personas se ponen de acuerdo para reportar a uno, que quizás no estuvo siento toxico, solo que disgusto a los demás. \n\nDejando de lado el sistema, Riot y la comunidad solo se dedica a penalizar errores de sus jugadores. \nEsta bien esto? \nEn si, por supuesto. Pero no del todo. \nRiot no ayuda su comunidad, no nos brinda una ayuda para mejorar como jugadores y como personas. \nHay mucha gente acá que comete errores y es muy tóxica, pero realmente si los banean, seguirán siendo así en otro juego, incluso en sus vidas diarias. \nRiot jamás nos brinda unas palabras acerca del mal comportamiento y como combatirlo. \n\nEn fin, yo opino que lo que se necesita es ayudar, y no penalizar. Solo así dejara de haber tóxicos.","replies":[]},{"poster":"FedecarboneroUY","date":"2017-07-17T02:08:47.728+0000","up_votes":1,"down_votes":0,"body":"\"prohibió a los foreros a hablar sobre el tema y daban duras sanciones a aquellos que seguían insistiendo\"\n\nhttp://pm1.narvii.com/6223/f670275bf6e5d5e3fe41242555f2ce00d5e0fcd1_hq.jpg","replies":[]},{"poster":"Emma Mirra","date":"2017-07-17T00:39:06.128+0000","up_votes":1,"down_votes":0,"body":"Excelente!","replies":[]}]}