{"poster":"NumeN","date":"2015-02-28T06:43:28.732+0000","title":"Necesita nerf Zed? me lo compro y pruebo.","subforum":"Charlas Generales","up_votes":1,"down_votes":3,"body":"Bueno, como dice el título.....en lo personal no me molesto si me toca un zed, por lo general les gano línea. Si me toca uno en ranked...pido mid Kayle y disfruto ver como no pueden hacer nada XD. Pero es cierto que a veces jugando algún AP \"mantequita\", me han reventado.\r\nComo medio server+1 pide nerf....dije, me lo compro, reembolsé a Syndra, la cual no puedo jugar porque sus habilidades hacen explotar la tarjeta integrada de mi cafetera jajaja y compre Zed.\r\nManos a la obra...pensé, tengo que cuidar de tirar la sombra para usarla como escape por las dudas (cosa que leí en el foro), y jugar pasivo....\r\nAsí que empece, fui top al final, cosas del lol.\r\nNunca había leído sobre las habilidades de zed, me puse la Q, puuuuum!!!!! primera sangre, un k6 exploto, lo mate de nuevo, así como 3 o 4 veces. En un momento, esto fué el 25/2 super lag, como 300 ping, fps en 10 y menos......seguí jugando y LITERALMETE!!!!!!\r\nApretaba R y después, qwe3 (el 3 la activa de bork) .......sonaban por toda la casa lo \"teclazos\" ..........haz matado a un enemigo, en un momento fue imposible jugar, creo que iba 7 7 algo asi,hice un doble despues.\r\nEn la segunda partida, fue parecido, me avive que no tenia que subir mucho la sombra y demás detalles, como usar mejor el ulti. 18 14\r\nEn conclusión:\r\nEl que dice que las mecánicas son super difíciles, mentira. Que a pesar de todo es un flan? si y? antes te tienen que agarrar.\r\nLa pasiva.......rota. El daño/enfriamiento de la Q demasiado, el ulti, aunque seas \"ultidependiente\" pfffff.........en fin.\r\nLa suma de todas las ventajas o \"detalles medios rotitos\" hacen que Zed este roto, para nada es balanceado. \r\nAhora me pregunto........nerfean a Kassa? cambian la jugabilidad de Veigar? y etc de los parches anteriores y zed nada?\r\nMe sorprendió que para haber usado un campeón el cual desconocía, se me hizo demasiado fácil, línea mid late.....\r\nSaludos","replies":[{"poster":"Dildo de Moria","date":"2015-02-28T12:27:29.842+0000","up_votes":3,"down_votes":0,"body":"Tranquilo que Rito ya le nerfeo un porcentaje MINIMO de la vel. de ataque, un SUPER nerfeo Rito eh, se ponen a nerfear a Kassadin que ya casi ni se usa pero a Zed no lo tocan, esta mas roto que el servidor de cuarta este.","replies":[{"poster":"JesúsEsMiPastor","date":"2015-02-28T12:58:47.085+0000","up_votes":1,"down_votes":0,"body":"En NA Kassadin era freeelo (lo que aqui seria mas o menos... una Riven), pero claro, a ellos no les importa LAS TT","replies":[]}]},{"poster":"Vastorn","date":"2015-02-28T12:21:12.820+0000","up_votes":2,"down_votes":0,"body":"Descuida, pronto lo nerfearán, y a Katarina, y a Jarvan, y a Nidalee, y a Kassadin. Para buffear a Seju, Urgot, Ashe, Skarner, Galio, Shyvana y tendremos otra generación de campeones rotos que luego serán nerfeados y otros buffeados, para así, dar paso a la siguiente generación, y así sucesivamente, hasta que la gente se aburra, rito quiebre y nadie recuerde que existió un juego llamado \"League of Legends\"","replies":[{"poster":"Platinum491","date":"2015-02-28T12:30:46.105+0000","up_votes":1,"down_votes":0,"body":"kassa denuevo?","replies":[{"poster":"Vastorn","date":"2015-02-28T13:13:28.895+0000","up_votes":1,"down_votes":0,"body":"Obvio, no es parche si no nerfean a Kassa.","replies":[]}]}]},{"poster":"Blaknight","date":"2015-02-28T15:20:58.402+0000","up_votes":1,"down_votes":0,"body":"Resumen: Nerf zed","replies":[]},{"poster":"Hwaxinghz","date":"2015-02-28T14:20:17.160+0000","up_votes":1,"down_votes":0,"body":"Tengo el presentimiento que los nerfs a Kassadin, Fizz, Veigar y demás campeones de Mid (casi todos de MID) son para evitar demasiadas molestias contra ZED, no es por nada, pero todos sabemos que ese personaje es el favorito por los rioters, me parece medio sospechoso que nunca lo toquen y si lo tocan lo hacen insignificantemente cambiándole 0.01 de velocidad de ataque para ellos es un nerf y ni siquiera se siente. Nerfiaron a Ahri, el counter casi que por excelencia de Zed a tal punto que zed ulteaba, lanzas una E, te escapas con el ulti y lanzas tus skills y lo exterminas al extremo de que lanzas una E y no le haces ni cosquillas (como está ahora Ahri, lo comparo) y el daño de la W es disminuido, el rango del ulti disminuido y demás. Solo tengo esa sospecha, a tal punto de que en rankeds es instaban por todas las que he jugado (mas de 300 en total contando la temporada pasada y esta) y siempre ban ZED, pero SIEMPRE, salvo que el primero del lado azul se digne por no banearlo y lo usa él. no les parece raro?","replies":[]},{"poster":"JesúsEsMiPastor","date":"2015-02-28T12:55:13.624+0000","up_votes":1,"down_votes":0,"body":"Les comento mi experiencia: Con mi antiguo champ de midlane (que era Fizz, pero ahora ya no me atrevo a usarlo ahi por el nerf, salvo que juegue unas normals con los amigos o algo asi) y la verdad Zed, independientemente de la calidad del otro jugador, era uno de los matchups mas complicados. El podia farmear a distancia, tenia harras, y podia zonearme con muchisima facilidad. Incluso ni bajo torre podia farmear de el. Muchos dicen: \"Hay no pero Fizz counterea al Zed por su salto blablabla\" pero seamos sinceros... Lo unico que conseguias al esquivar la ultimate de Zed con el salto era bloquear 200 de daño (tampoco bloqueaba la marca) y a continuacion eras totalmente vulnerable a que te encaje el combo entero. No diria que es un hard counter... pero se la hace muy dificil a los otros mid, en especial a los magos, y tal cual como Yasuo, casi todos (por no decir todos) sus counters picks estan en top (Darius, Jax, etc.) Y si se buildea {{item:3153}} practicamente ya es una autentica maquina de destruir torres. Eso si... la gran desventaja de Zed, es que en ciertas situaciones se queda sin energia, lo que le impide ejecutar sus combos a la perfeccion, sin contar que en mid/late game depende mucho de su ultimate para hacer practicamente algo. Pero bueno... para mi el nerf que se comio del attack speed no resolvio practicamente nada, ya que si se queda sin energia te puede seguir enchufando a basicos (y mas aun por esa pasiva que tiene) a no ser que te pesques un poco de armadura al principio (y todos sabemos lo incomodo que eso podria llegar a ser)\n\nEn conclusion: La verdad si, se merece un nerf, no tan duro, pero al menos lo merecia mas que Fizz. Pero bue... asi es la vida.","replies":[]},{"poster":"RNGesus","date":"2015-02-28T07:21:07.529+0000","up_votes":1,"down_votes":0,"body":"Yo la unica vez que lo use gane la linea contra una annie gotica random y bastante facil diria yo xD luego contra otro zed creo que tambien la ultima vez que estubo gratis , me gano la linea y luego entendi como jugarle a zed siendo zed , dejaba que me ulteara y justo en el momento que es targeteable lo ulteaba yo xD   , la unica gran dificultad de zed esta en colocar bien las sombras estrategicamente y conociendo el rango de la Q , la ulti tiene la mecanica comun del lol a la que llamo \"click to win\" . aparte como el jungla se aviva y te deje el blue , spameas como loco.","replies":[]}]}