{"poster":"El XayahJhin","date":"2017-04-27T19:24:29.673+0000","title":"cuantas de las 10 ranked hay que ganar para salir de bronce","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"cuantas de las 10 ranked hay que ganar para salir de bronce \r\nyo jugue las flexibles y gane 7 y quede bronce 2 \r\nosea que tengo que ganar las 10 para salir de bronce\r\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"Yazzy","date":"2017-04-27T19:39:02.968+0000","up_votes":2,"down_votes":0,"body":"Hola, ¿qué liga eras el año pasado? Antes de que se reiniciaran las Clasificatorias.\n\nGeneralmente quedás mas abajo que la temporada anterior. Es decir, si en la temporada anterior terminaste en Plata II, es muy probable que, aunque ganes las 10 de posicionamiento, quedes en Plata IV o III. \n\nYo, por ejemplo, en 2015 terminé la temporada en Oro V, jugué las 10 de posicionamiento 2016, gané 5 y quedé en Plata V, pero terminé la temporada 2016 en Plata IV, por lo que este año aunque haya ganado 8 de las 10 de posicionamiento, quedé en Bronce I (por suerte, logré salir :P)\n\nPero el punto es que es así, quedás mas abajo de lo que terminaste la temporada anterior. \n\nSaludos!","replies":[]},{"poster":"Dyaebl","date":"2017-04-27T20:17:12.015+0000","up_votes":1,"down_votes":0,"body":"Para SALIR de bronce tenes que ganar 10 con suerte, para no entrar en bronce con 2 o 3 te alcanza aveces","replies":[]},{"poster":"Tecnicomando","date":"2017-04-27T20:16:03.715+0000","up_votes":1,"down_votes":0,"body":"La temp pasada quedaste b4, asi que ni ganando las 10 sales de ahi\n\n\nsalu2","replies":[]},{"poster":"WhiteMax","date":"2017-04-27T19:46:47.185+0000","up_votes":1,"down_votes":0,"body":"Eso depende, si jugaste el año pasado aunque ganes las 10 podes quedar en Plata perfectamente.\n\nQue puedes hacer? jugar y ganar la promo a Plata, asi es todos los años.","replies":[]},{"poster":"Chase me","date":"2017-04-27T19:45:36.551+0000","up_votes":1,"down_votes":0,"body":"Depende de como te fue en la season pasada.\nSi eres completamente nuevo en rankeds, depende de como juegues y puede varias de bronce 5 a oro 5 (creo que oro 5). \n\nSi te hiciste una nueva cuenta con la cual llegaste a platino y luego juegas en tu antigua cuenta que era plata, posiblemente con las 10 rankeds subas 2 divisiones, ya que en este punto ya seras bueno de por si. Yo lo hice.","replies":[]},{"poster":"Chisolin","date":"2017-04-27T19:38:03.064+0000","up_votes":1,"down_votes":0,"body":"Depende lo que fuiste en la temporada pasada\nSi son las primeras 10 de la cuenta, simplemente puede que seas así de malo xD","replies":[]},{"poster":"Néd Stark","date":"2017-04-27T19:37:43.970+0000","up_votes":1,"down_votes":0,"body":"Depende de como juegues o qué se yo. \nNo necesariamente debes ganar las 10, tal vez se haya dado el caso de alguien que ganó las 10 y quedó en bronce 1. Quién sabe.\nEn lo personal, yo gané 4 el yoloQ y quedé en plata V. Y en las flex gané 4 y quedé en bronce 3.","replies":[]}]}