{"poster":"Jiren MP","date":"2018-11-13T03:09:47.353+0000","title":"¿Por qué la gente odia tanto las flex?","subforum":"Comportamiento del jugador","up_votes":9,"down_votes":0,"body":"Es algo que no me deja dormir, siempre me he preguntado por qu&eacute; la comunidad(De LAS por lo que he visto) odia tanto o mira en menos a las flex, seg&uacute;n yo son igual de importantes que las otras clasificatorias.\r\n\r\nAlguien llegar&aacute; a leer esto? xd otra gran duda existencial.\r\n\r\nEspero recibir comentarios y opiniones.\r\n\r\nPD: He visto gente que va a practicar en las flex y dice que no pasa nada, que no les importa perder, no son nada.","replies":[{"poster":"NathaARD","date":"2018-11-13T03:22:04.124+0000","up_votes":4,"down_votes":0,"body":"La primera vez que escuche de alguien \"las flex son para trolear\" era bronce 3 y por alguna razon casi todos nos pasan de oro a lo mucho\nSigo pensando a dia de hoy que uno sube por amor propio para sentirse bien con uno mismo no para alardear al otro o sentirse superior (Sentirse mas capó por un juego....pls)\nSi te gusta jugar flex mandale para adelante y que los demas la sigan chupando salu2","replies":[]},{"poster":"Main Cocina S3","date":"2018-11-13T03:16:52.048+0000","up_votes":1,"down_votes":7,"body":"***","replies":[{"poster":"NathaARD","date":"2018-11-13T03:18:18.585+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=CPY,realm=LAS,application-id=PJAKt7ph,discussion-id=fzAgExvI,comment-id=0004,timestamp=2018-11-13T03:16:52.048+0000)\n>\n> es lo mismo que jugar una normal pero te saca LP cada vez que te encontras algun cheater hijo de recontra mil putas y la concha de su puta madre gordos deformes\n\nUn cheater? en el lol? en las? oie no creo","replies":[]}]},{"poster":"Angry Player","date":"2018-11-13T04:17:01.470+0000","up_votes":2,"down_votes":0,"body":"Por mi parte solo juego flex con amigos (que son malisimos y me viven troleando) asi que no les doy importancia... Aunque igual siempre intento ganar.\nAhora que lo pienso, quizas deberia dejar de jugar con mis amigos...\nO deberia conseguir amigos mejores, con juegos de azar y mujerzuelas (?","replies":[]},{"poster":"Zalvagzk","date":"2018-11-16T14:20:08.068+0000","up_votes":1,"down_votes":0,"body":"Supongo que las miran a menos porque se puede jugar hasta de 5 personas, entonces el nivel personal se notaría menos, y según ellos habrían más carreados o algo así..\nPero la Flex es una cola tan importante como SoloQ, simplemente que se puede jugar con más amigos.","replies":[]},{"poster":"DooMMetaL","date":"2018-11-13T17:08:24.534+0000","up_votes":1,"down_votes":0,"body":"En general eso sucede porque en FLEX te empareja con cualquier jugador de la cola y que el valor de MMR total del equipo sea igual (al menos por 20 puntos) al equipo enemigo. En un ejemplo un poco \"desquiciado\" digamos 1 challenger y 4 bronces 1 contra 5 oro 3. Antes la cola era de 5vs5 pero se usaba poco y ahora con Clash por ahí resucita el uso, además es una herramienta muy buena para medirse cuando Clash esté completamente habilitado. Aunque he leído comentarios a mi me pasaba que estuve mucho tiempo clavado en plata 5 (tampoco juego mucho rankeds) y jugaba con amigos en normals que estaban Oro 3+, fuimos a la 5vs5 y salimos como equipo plata 3, y mi desempeño no era tan malo... hay jugadores que son muy buenos en equipo pero en la individualidad no tanto. \nEntonces:\nSolo/duo: Medición de individualidades.\nFlex: Medición de jugador/es en equipo.","replies":[]},{"poster":"QUBE","date":"2018-11-13T12:43:23.322+0000","up_votes":1,"down_votes":0,"body":"por que no tienen ningún valor competitivo, no son representativas de tu habilidad como jugador la única forma de que se tomaran un poco mas en serio seria si solo se pudiera entrar en teams de a 5 pero las colas serian eternas. yo uso flex para probar champs y jugar con amigos es un poco mas serio que normals por lo que la practica tiene valor real y subir o bajar no me importa por que no representa la habilidad de un jugador especifico.\n\nTodo esto dejando de lado que mucha menos gente juega flex que solo q. por lo que ser diamante en flex tiene menos valor que ser diamante en solo q. nadie se puede tomar de forma competitiva un modo de juego en el que la gente no compite","replies":[]},{"poster":"Hadion","date":"2018-11-13T06:14:51.831+0000","up_votes":1,"down_votes":0,"body":"Por el hecho de que se puede hacer un equipo de 4 (no se si de 5, nunca las juge), entonces le quita \"merito\" de alguien que subio solo (aunqe es muy estupido el razonamiento de toda la gente). Ademas de que son colas diferentes (flex y soloq), por ejemplo:\nUna persona puede ser Challenger en soloq y en flex platino 5, o al revez.\nMucha gente confunde o no sabe eso y empiezan con el tipico lloro de \"rito y sus emparejamientos\", \"rito mis lps\", \"soy oro y me toco contra plugo\", etc etc.\n(este si paso XD porque una de las 15 partidas flex de toda la season que jugo plugo le toco justo contra ese pibe)\n\nAl final la gente que entra a jugar flex pensando que son mas \"faciles\", terminan en la misma liga que estan posicionados en soloq, porque al final si jugas como un plata vas a terminar en plata y un oro como oro, etc etc.","replies":[{"poster":"Mioen","date":"2018-11-13T10:44:59.427+0000","up_votes":1,"down_votes":0,"body":"De hecho, no se puede hacer equipo de 4 en FlexQueue. Solo se puede entrar en cola con equipos de 1/2/3/5.","replies":[]}]},{"poster":"rafihttta","date":"2018-11-13T05:46:46.601+0000","up_votes":1,"down_votes":0,"body":"Es por que están muy desbalanceadas, el emparejamiento es muy random, diría que incluso mas que las normales.","replies":[]},{"poster":"NerfAutoFill","date":"2018-11-13T04:38:02.191+0000","up_votes":1,"down_votes":0,"body":"Flex tiene varias fucniones:\n\n1) jugar de a 5\n\n2) practicar camepones. seamos sinceros cuando uno juega normals generalmente pelotudea o juega a cagarse de risa.\n\n3) ultima funcion: tolerar el flameo de gente con 3 ligas de difernecia por no estar try hardeando con los champs que maineamos","replies":[]},{"poster":"AlphaLyrae","date":"2018-11-13T03:28:41.711+0000","up_votes":1,"down_votes":0,"body":"Es mucha cuestión de suerte, a mi cuando intente jugar flex me toco contra diamantes y platinos siendo unranked y en mi equipo lo mas alto que había era algún que otro oro V / IV. También el hecho de que puede tocarte contra un pre-made de 5 y es muy distinta la jugabilidad de 5 desconocidos a 5 que estan conectados mediante discord,skype, etc. A menos que tengas 4 amigos con quienes hacer pre-made no me resulta muy copado.","replies":[]},{"poster":"Loli On Bush","date":"2018-11-13T03:22:49.284+0000","up_votes":1,"down_votes":0,"body":"por donde empezar xd. el emparejamiento es horrible, premades que con buena comunicacion tienen free wins, la gente que se mete a trollear/probar champs/molestar. es decir, eso no mide tu elo, puedes ser diamante pero carreado por tus amigos.","replies":[]},{"poster":"SpectreChazer","date":"2018-11-13T03:14:13.602+0000","up_votes":1,"down_votes":0,"body":"Porque es mas cuestión de suerte ganar partidas ahí, te puede tocar contra una premade de 5 en contra cuando juegas solo o que el emparejamiento sea tan malo que te toque contra diamantes siendo oro. Te lo digo por experiencia propia \n{{sticker:sg-lulu}}","replies":[]},{"poster":"Only Insane","date":"2018-11-13T03:12:23.835+0000","up_votes":1,"down_votes":0,"body":"Por que la mayoría toma las flex como una normal reclutamiento y eso paso por que la mayoría de los rioters antiguos que ya no están se encargaron de eso de decir que no era una cola como la de solo q y bla bla bla, yo la juego como una solo q solo que cuesta un poco mas ganar en esa ! si te salen premades estas frito xD","replies":[]},{"poster":"One Single","date":"2018-11-13T03:11:32.168+0000","up_votes":1,"down_votes":0,"body":"por el emparejamiento es malisimo ahi podes ser plata y te toca contra un platino o diamante esta mal ese emparejamiento","replies":[]},{"poster":"Falcon25","date":"2018-11-13T03:11:19.486+0000","up_votes":1,"down_votes":0,"body":"Mucha gente ve a las partidas Flexibles como \"Rankeds de mentira\" y creen que vale menos que en Duo y solo Q aunque yo pienso casi lo mismo xd","replies":[]},{"poster":"Yo y 4 inútiles ","date":"2018-11-13T04:15:19.464+0000","up_votes":1,"down_votes":1,"body":"No tienen peso, no mide tu habilidad como jugador como lo hace la soloQ, solo mide el carreo que te hicieron tus premades o los premades que te tocaron. Así de simple, y sí, por esta razón yo justifico el poco peso que se le dan a las flex, por lo que encuentro aceptable que la gente la tome como jugar una normal reclutamiento pero con PL.\nPonte a pensar que eres Bronce I en soloQ y solo juegas supp, entonces te pones a jugar Flex con tu premade de 5 y llegas hasta platino o diamante siguiendo solo las instrucciones de tu equipo, siendo además supp. En simples palabras sí, eres un carreado y hasta podríamos decir que eres un eloboosteado","replies":[]}]}