{"poster":"Shinjore","date":"2017-03-10T15:42:20.502+0000","title":"wie gewinne ich bitte 3 lanes alleine????","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":19,"body":"bitte erkl&auml;r mir das mal einer, das macht alles keinen sinn mehr in diesem spiel! wenn alle nur immer am feeden sind!\r\nund mit alle meine ich nur meine teammitglieder, alle halt und nicht nur bot, mid oder top !","replies":[{"poster":"SoloQisMentlBoom","date":"2017-03-10T15:50:28.777+0000","up_votes":3,"down_votes":0,"body":"Alle feeden also? \nMit alle sind deine Teammitglieder gemeint?\nDu bist Mitglied deines Team. \nAlso feedest du auch?!","replies":[{"poster":"RM Heartmeander","date":"2017-03-10T15:58:14.757+0000","up_votes":7,"down_votes":0,"body":"Er meint wirklich alle!\nAuch die Gegner feeden.\nDie Minons sind so gefeeded, dass er nicht alle 3 Lanes alleine Deffen kann!\n\nMinions OP!","replies":[]},{"poster":"Shinjore","date":"2017-03-10T17:34:41.830+0000","up_votes":1,"down_votes":4,"body":"äh nein naturlich nur meine mitspieler, wieso könnt ihr euch nicht mal die post richtig durchlesen und versuchen diese richtig zu verstehen!!!","replies":[{"poster":"SoloQisMentlBoom","date":"2017-03-10T18:16:19.421+0000","up_votes":1,"down_votes":0,"body":"Was gibts da nicht zu verstehen?\n\nDu bist mad weil mal ab und zu jemand in deinen Games verkackt und lässt deinen Frust jetzt mehr oder weniger hier aus.\n\nIst doch so oder nicht?","replies":[{"poster":"Shinjore","date":"2017-03-10T18:37:39.140+0000","up_votes":1,"down_votes":3,"body":"weil ab und zu!? das ist fast dauernd so! ab und zu sind meine mitspieler mal gut!","replies":[{"poster":"SoloQisMentlBoom","date":"2017-03-10T23:46:03.914+0000","up_votes":2,"down_votes":0,"body":"Was erwartest du in Bronze? Es hat Gründe warum deine Teammates dort sind. Ebenso welche warum du und deine Gegner auch dort sind.\n\nAkzeptiere es, dass du bei den Schlechtesten mitspielst und spiele dementsprechend. Erwarte keine Plays, nicht mal solide Spielweisen deiner Mitstreiter. Könnten sie das, wären sie mindestens Gold.","replies":[{"poster":"Shinjore","date":"2017-03-11T17:19:00.922+0000","up_votes":1,"down_votes":1,"body":"nur mal zum verständniss nochmal, ich schreibe hier ausschließlich über die flexi q. meine siegesrate ist hier laut op.gg 47%. in meinen gegner teams sind oft schon leute gewesen die solo q silber gold und sogar platin waren oder sind. wenn nun alle in der flexi q mit neuer mmr beginnen, was machen dann bitte diese spieler in meinen spielen? weil theoretisch müsste meien mmr ja bei 0 sein.\n\n\n> Akzeptiere es, dass du bei den Schlechtesten mitspielst und spiele dementsprechend. Erwarte keine Plays, nicht mal solide Spielweisen deiner Mitstreiter. Könnten sie das, wären sie mindestens Gold.\n\nok kann akzeptieren das ich mit und gegen das schlechteste was es gibt an spieler mit- und gegen spiele, auch das die keine plays machen kann ich akzeptieren. aber solide zu spielen darf man auch als b5 doch wohl erwarten.","replies":[{"poster":"SoloQisMentlBoom","date":"2017-03-11T17:39:00.968+0000","up_votes":1,"down_votes":0,"body":"Ich spiele in Flex mit Spielern von Gold-Challenger.\n\nSo wie ich das verstanden habe, wird sich beim Platzieren nur bedingt auf die SoloQ-Elo bezogen.\n\nEs gibt eben Leute die investieren viel Zeit in Flex (meistens LowElo) und welche die inverstieren kaum Zeit in Flex (meistens HighElo) - von Teams mal abgesehen.\n\nIch z.B. wurde Platin 2 in Flex und SoloQ gematcht. Flex spiele ich seither ausschlieslich im Team oder 1 mal die Woche um nicht zu droppen. Das wird vermutlich bis Ende der Season so bleiben.\nHeißt ich kann theoretisch bis BronzeV droppen oder bis Challenger aufsteigen und bin in Flex immer noch Plat 2.\n\nDamit will ich nur sagen, dass es normal ist, dass in Flex mehrere Ligen und Divisionen aufeinander treffen können und das auch verständlich ist.","replies":[]}]}]}]}]},{"poster":"charmelikeahri","date":"2017-03-11T07:09:04.227+0000","up_votes":2,"down_votes":0,"body":"Ich verstehe:\n\nIch bin Bronze, verdiene es dort zu sein, und meckere noch über Teammates damit ich meine Zeit rumkriege","replies":[]}]}]},{"poster":"Alekra","date":"2017-03-10T15:46:22.341+0000","up_votes":4,"down_votes":0,"body":"\"Alle Mates sind kacke, ich bin super MIMIMIMI\"","replies":[{"poster":"Patter1991","date":"2017-03-10T15:46:40.147+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Alekra,realm=EUW,application-id=ip27PlEH,discussion-id=kyAt9MjM,comment-id=0000,timestamp=2017-03-10T15:46:22.341+0000)\n>\n> &quot;Alle Mates sind kacke, ich bin super MIMIMIMI&quot;\n\nSo wie jeder Post von Shinjore.","replies":[{"poster":"Alekra","date":"2017-03-10T15:47:16.413+0000","up_votes":1,"down_votes":0,"body":"Ja.","replies":[{"poster":"Shinjore","date":"2017-03-10T17:31:20.762+0000","up_votes":1,"down_votes":2,"body":"nein.","replies":[{"poster":"charmelikeahri","date":"2017-03-11T07:09:33.647+0000","up_votes":1,"down_votes":0,"body":"Doch","replies":[{"poster":"Awsane","date":"2017-03-11T17:19:23.474+0000","up_votes":1,"down_votes":0,"body":"OH","replies":[]}]}]}]},{"poster":"Shinjore","date":"2017-03-10T17:30:53.014+0000","up_votes":1,"down_votes":3,"body":"das ist nicht mimmimi sondern das was ich war nehme von diesem spiel!","replies":[]}]},{"poster":"Shinjore","date":"2017-03-10T17:30:07.065+0000","up_votes":1,"down_votes":4,"body":"ich bin nicht super aber die mates sind kacke, so wie dein post hier!","replies":[{"poster":"Alekra","date":"2017-03-10T17:40:50.822+0000","up_votes":1,"down_votes":0,"body":"Scheinst mir dem toxischen Teil der Community anzugehören.","replies":[]}]}]},{"poster":"Basti133","date":"2017-03-11T21:57:45.992+0000","up_votes":1,"down_votes":0,"body":"Jungle spielen","replies":[]},{"poster":"Awsane","date":"2017-03-11T17:22:40.479+0000","up_votes":1,"down_votes":0,"body":"weiterspielen und sich emotional nicht von niederlagen beeinflussen lassen\n\nund immer auf eigene Verbesserung fokusiert sein\njeder hat mal spiele in denen man nicht gewinnen kann mit seinem aktuellen skill (vllt faker hätte gewonnen du aber nicht da der skillunterschied zw. euch beiden zu hoch ist)\nund jeder hat auch mal Phasen in denen es nicht läuft\n\nder ware skill kommt davon einfach weitermachen und immer sein bestes geben und clean im kopf zu bleiben, irgendwann geht's wieder aufwärts\n\nlerne niederlagen zu akzeptieren auch wenn sie Großteils nicht selbstverschuldet bist\nlol ist ein teamgame, das bessere Team gewinnt nicht der beste (aus allen 10) spieler\nund lerne aus diesen spielen noch etwas mitzunehmen was du selber verbessern kannst, niemand absolut niemand spielt perfekt also kann man immer irgendetwas verbessern\n\n\nlol ist grinding, wer nicht viel spielt und sich durch sowas durchboxt hat nicht verdient aufzusteigen","replies":[]},{"poster":"Supportsmanlike","date":"2017-03-10T18:24:35.954+0000","up_votes":1,"down_votes":0,"body":"Also ich habe mir das jetzt lange genug angeschaut. Ich rate dir dringend mal ein Singleplayerspiel zu spielen. Dann kannst du es nicht mehr auf andere schieben. Bei dir grenzt das ja schon fast an Narzissmus.","replies":[{"poster":"Shinjore","date":"2017-03-12T10:29:16.152+0000","up_votes":1,"down_votes":3,"body":"pass mal auf, wenn du nicht weißt was das bedeutet dann google erst mal, denn das stimmt so sicher nicht weshalb ich diese post alle schreibe.\nund wenn es dir nicht passt das hier zu lesen dann lies es nicht und poste nix und fertig!\nmeine treats sind für die leute die genauso denken wie ich und eventuell helfen wollen oder gar können!","replies":[{"poster":"Supportsmanlike","date":"2017-03-12T17:44:43.970+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Shinjore,realm=EUW,application-id=ip27PlEH,discussion-id=kyAt9MjM,comment-id=00040000,timestamp=2017-03-12T10:29:16.152+0000)\n>\n> pass mal auf, wenn du nicht weißt was das bedeutet dann google erst mal, denn das stimmt so sicher nicht weshalb ich diese post alle schreibe.\n\nVielleicht solltest DU es lieber mal googlen.\n\n> meine treats sind für die leute die genauso denken wie ich und eventuell helfen wollen oder gar können!\n\nNein, deine Threads sind nur Mimimi Spam und haben jedes mal den selben Inhalt. Nämlich \"Meine Teammates sind scheiße und ich bin der beste Spieler der Welt\" oder \"Das System ist unfair, holt mich hier raus\".\nUnd bis du nicht endlich einsiehst, dass du selbst besser werden musst, bringen deine drölfzig Threads überhaupt nichts. Denn jedes mal, wenn dir jemand einen guten Tipp gibt, willst du diesen nicht annehmen.","replies":[]}]}]},{"poster":"Pure Cynicism","date":"2017-03-10T17:12:19.818+0000","up_votes":1,"down_votes":0,"body":"Du musst nicht die Lanes gewinnen, du musst nur den Nexus zerstören. Du kannst alle Teamfights verlieren - bis auf den letzten.","replies":[{"poster":"Shinjore","date":"2017-03-10T17:29:26.840+0000","up_votes":1,"down_votes":4,"body":"ach auch mal eine anständige antwort!\ndas mit dem nexus ist mir klar aber da kommt man nicht so schnell ran wenn deine mitspieler nur blödsinn machen.\nselbst wenn ich die mitte durch pushen möchte (mit towers natürlich) kommen die gegner zu 5 auf mich zu und ich muss abhauen weil mein team nicht mal in der lage ist mir zu helfen geschweige denn mich zu beschützen wenn ich feed bin.\n\nalso was soll ich tun??","replies":[]}]}]}