{"poster":"Orthrax3564","date":"2017-09-22T04:42:59.940+0000","title":"Chat Restricted and penalty for basicly nothing bad....","subforum":"Player Behaviour","up_votes":1,"down_votes":2,"body":"I have been chat restricted and penalized pretty much for nothing and dont really agree with it... it only shows my chat only and not that other players chat who was Swearing their head off at me and being toxic all game most of the time i was just trying to explain to them why i did apparently nothing in this Jungler&#039;s eye&#039;s and i bet they did not even get penalized because i got no report message what i normally get when i report toxic player&#039;s\r\n\r\nThis is my chat log notice there is no swearing and i only called him a kid because he was being really aggro swearing all game and calling me a stupid kid (not just me whole team) so yes i called him a kid is that a bad thing? Notice in my chat log alot of it was me trying to explain i am playing passive (In their eyes doing nothing) because im behind and also got no ganks which i even said &quot;i was not saying your bad for not ganking i said im doing nothing because i dont have a jg help&quot; which you can see in the logs just trying to explain why i did nothing. because i did not want to feed because i was really far behind and is it my fault i had 1 off game? NO so im quite unhappy that &quot;Your Honor level dropped and you lost access to free rewards.&quot; when i dont even think i did anything even that bad considering their chat log which i dont like how you cant see the whole chat log in the report only mine.. also to put into context he got counter jungled died and i did not run and try to help him because start of the game our adc and at the time of the counter jungle i was busy hitting accept to the remake call which did not go through but draven did come back later in the game which is all good we all get connection problems some time&#039;s. that is what started this Vi jungle to be mad and starting to intentionally feed and stopped trying to play the game. if you have any other questions feel free to ask if your unsure about the context of any of it would love to be able to post the WHOLE chat log but unfortunately i cant.\r\n\r\nGame 1\r\nOrthrax3564: thought it was going to be a remake\r\nOrthrax3564: because afk\r\nOrthrax3564: righto\r\nOrthrax3564: blame everyone else\r\nOrthrax3564: because its your team that is bad\r\nOrthrax3564: you just said NO ONE\r\nOrthrax3564: love how im the kid\r\nOrthrax3564: crying over a gamer\r\nOrthrax3564: game\r\nOrthrax3564: ..\r\nOrthrax3564: lol\r\nOrthrax3564: sounds like it\r\nOrthrax3564: blah blah blah cry cry cry\r\nOrthrax3564: noob this stupid person that\r\nOrthrax3564: its norms\r\nOrthrax3564: just chill out and play\r\nOrthrax3564: kid\r\nOrthrax3564: cant do much vsing a main ekko\r\nOrthrax3564: with no ganks\r\nOrthrax3564: so i play passive\r\nOrthrax3564: i was not saying your bad for not ganking\r\nOrthrax3564: i said im doing nothing because i dont have a jg help\r\nOrthrax3564: so im playing passive\r\nOrthrax3564: so i dont feed\r\nOrthrax3564: and you sound like a kid when you have anger issues over a game\r\nOrthrax3564: haha\r\nOrthrax3564: this vi\r\nOrthrax3564: toxic all game\r\nOrthrax3564: crying over a game\r\nOrthrax3564: needs to chill out\r\nOrthrax3564: someone just tell vi to take a chill pill\r\nOrthrax3564: okay reporting vi\r\nOrthrax3564: i see im muted\r\nOrthrax3564: hey\r\nOrthrax3564: inting\r\nOrthrax3564: and your only lvl 7..\r\nOrthrax3564: vi doing nothing\r\nOrthrax3564: in that fightg\r\nOrthrax3564: i never did\r\nOrthrax3564: i said why i was not doing anything\r\nOrthrax3564: because im playing passive\r\nOrthrax3564: because ekko got ahead\r\nOrthrax3564: and i had no HELP\r\nOrthrax3564: hahaha\r\nOrthrax3564: you sound mad kid\r\nOrthrax3564: why you mad\r\nOrthrax3564: ...\r\nOrthrax3564: =P\r\nOrthrax3564: haha\r\nOrthrax3564: kid\r\nOrthrax3564: need to study\r\nOrthrax3564: everyone report vi thanks\r\nOrthrax3564: just report vi toxic inting and ruining everyones game\r\nOrthrax3564: soraka how am i trolling\r\nOrthrax3564: when i get no ganks when im behind vsing a ekko?\r\nOrthrax3564: he can tower dive and then ult ez\r\nOrthrax3564: i did nothing??\r\nOrthrax3564: soraka\r\nOrthrax3564: i came bot\r\nOrthrax3564: and helped you \r\nOrthrax3564: hahah\r\nOrthrax3564: these kids are so mad its funny\r\nOrthrax3564: im laughing so hard atm\r\nOrthrax3564: blaming me for doing nothing because i could not do anything\r\nOrthrax3564: kids now days dont know how to play passive when behinds\r\nOrthrax3564: i can by not letting him have a double\r\nOrthrax3564: if i came\r\nOrthrax3564: because im behind\r\nOrthrax3564: yeah we lost\r\nOrthrax3564: draven i could not do anything in that\r\nOrthrax3564: they was all there\r\nOrthrax3564: vi so mad\r\nOrthrax3564: its stupid\r\nOrthrax3564: learn to calm down\r\nOrthrax3564: its a game\r\nOrthrax3564: games are made for fun\r\nOrthrax3564: not to go bright red with anger\r\nOrthrax3564: guessing thats what happened to VI?\r\nOrthrax3564: haha your more trash\r\nOrthrax3564: im still trying\r\nOrthrax3564: your not","replies":[{"poster":"pieceofpecanpie","date":"2017-09-24T11:50:29.585+0000","up_votes":2,"down_votes":0,"body":"This is honestly a blessing... for other players.\n\nYou should not be typing that much useless garbage in a game. You keep tilting an already tilted Vi and your team has every chance of tilting too with your constant useless spam. Stop typing and get on with the game, even if it's a bad one.","replies":[]},{"poster":"Tele","date":"2017-09-23T02:19:04.877+0000","up_votes":1,"down_votes":0,"body":"It's probably slightly on the heavy side, but I imagine there have been a few games like this in the past. Overall I think this is a fair punishment. Remember it's not necessarily the language that you use, but how you use your language that can lead to punishment. \n\nWhile it's clear that someone else's behaviour was also unacceptable here, I do think you were a part of the problem here too. It's also overwhelmingly clear that you should have been a bit more responsible muted Vi  early on, I'd really recommend doing this in the future.\n\nAlso, in future games I'd be avoiding lines like this, these most likely lead to your punishment IMO. It just contributed to the problem and made you look bad:\n\n+ _\"and you sound like a kid when you have anger issues over a game\"_\n\n\n+ _\"this vi\n     toxic all game\n   crying over a game\"_\n\n\n+ _\"you sound mad kid\n  why you mad\"_\n\nHopefully you get off that chat restriction soon, and let me know if you have any questions :D","replies":[]}]}