{"poster":"Xenith Circuit","date":"2015-09-11T14:00:19.020+0000","title":"How Can I Do Better In Solo Queue?","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"Hey guys, Bronze IV here. \r\n\r\nDisclaimer: I don&#039;t think I&#039;m &quot;good&quot; or &quot;better than my teams.&quot; I am willing to accept the possibility that my current rank is exactly where I belong. The problem is that I know I am capable of more because I&#039;ve been able to see relative success. Once I climb up a few divisions with a strategy, I stick with it only to eventually be knocked down just as many divisions. No, I don&#039;t think I&#039;m better than I really am. I want to get better, but I DO think I&#039;m not so terrible that I deserve the teams I&#039;m being matched up with. More on that later.\r\n\r\nSo, I&#039;m frustrated. I can&#039;t seem to make solo queue work for me. I&#039;ve been playing League for about two years now, and the highest I&#039;ve ever made it to was Bronze I. When season 5 started, I won 6/10 provisional matches and still got placed in Bronze V. No matter, I took time to learn new champions, improve my personal skill, and work on my teamwork. At a relatively recent point in this season, I managed to climb up to Bronze I by working with my team in champ select and researching their stats. Based on their stats, I would say &quot;hey, &lt;name&gt;, you should play Ahri mid. You have a good KDA with her and a 50+% win rate.&quot; Typically, this worked out really well for our team comps - because even though we weren&#039;t setting up specific comps - everyone was playing what they were strong at. However, I got frustrated when I lost two promos attempting this. I don&#039;t know what went wrong, but I told myself that this approach was not working to help me climb the ladder. \r\n\r\nI&#039;ve tried a bunch of strategies. I&#039;ve tried being an excellent team player. I&#039;ve tried saying &quot;screw the team, I&#039;ll just do my thing.&quot; I&#039;ve tried just playing &quot;OP Champs.&quot; I&#039;ve tried adopting a &quot;win lane win game&quot; mentality. I&#039;ve even sunk as low as to &quot;just play Yi or Kat anywhere.&quot; All have had SOME rate of success, but none of them has rewarded me with a positive climbing experience (like anyone has one of those right?) This has frustrated me to no end. \r\n\r\nSo, here I am in Bronze IV again. This is where I ended up after a humiliating knock down from Bronze I. This has happened to me before. I am perfectly capable of recognizing my own mistakes, and I do, but I know I can do a better job of it. But still, it&#039;s hard not to look at things from the perspective of a typical bronzie. I feel like matchmaking is working against me when I constantly get teams with at least one player who is CERTAINLY not up to par with the rest of us in terms of individual skill, or even awareness of how to play the game. I can&#039;t tell you how many times I have to suffer with some squishy carry who constantly thinks they can go in 1v5, or the support who refuses to purchase any vision for us (disclaimer 2: I always buy wards no matter what), or the top lane who just won.t leave. top. And then there&#039;s the obvious ones: AFKs, trolls, ragers who feed when they don&#039;t get what they want. It&#039;s horrible. \r\n\r\nAlright, so enough of the &quot;wo is me&quot; crap. I&#039;m here looking for advice from people who have climbed this hellish ladder further than I have. How can I improve my win rate in solo queue? My best positions are Mid, Top, and Jungle - though I think that&#039;s everyone who plays solo queue because I just CANNOT work with other people on bot lane. I play lane aggressive no matter the matchup, and it seems that nobody who plays bot in my ELO can do that with me. It&#039;s always &quot;play safe&quot; or &quot;just farm.&quot; This is why I avoid bot. I can win lane consistently on the solo lanes / jg. When I do play bot, it&#039;s bad. Really bad. I can never get along with anyone down there.\r\n\r\nSo, before I make this any longer with tales of my frustration, what can I do? Have I missed something in the solo queue formula? Did I have the right idea at one point but got discouraged from it? I&#039;d really like some input, guys. I love this game and I take it quite seriously in terms of improving at it. One last note: I am all for helping and sharing my power with my team if I get ahead, but I simply have too many trust issues with that approach. I&#039;ve seen people just do the STUPIDEST things while playing, and it makes me very hesitant to share power with people who might not know how to use it. The other issue is that I don&#039;t want to get into the habit of getting carried for fear I won&#039;t be able to hold my own once I reach my personal skill threshold. \r\n\r\nI&#039;d really appreciate the feedback, everyone.","replies":[{"poster":"DingleNutsMcGee","date":"2015-09-11T17:17:00.909+0000","up_votes":1,"down_votes":0,"body":"I used to be in the same boat as you. I was in Bronze and felt like I wasn't ever going to climb out of it. Now I have 2 Gold accounts. The #1 thing I've found that separates Bronze from Gold+ is greed. Bronze players typically don't know when to let things go. They chase across the map for a kill until they eventually get drawn into the rest of the enemy team and die. They stay underneath their tower with very low health instead of just recalling immediately. They tower dive for kills instead of letting it go and saying \"ah damn, almost had him...oh well I'll get him next time.\" Another major thing is they don't quite know how to position themselves in team-fights. If you're a tank you need to decide whether you should be going after the enemy carries or staying right in front of your own carries to keep the enemy tanks off of them. It varies from game to game which you should be doing. Countless times I've seen people going waaaayy too deep for the enemy carries, and then I'm left with no one in front of me as the adc to peel the tanks/assassins off of me, and I just end up getting instakilled b\\c of it. Then we lose the fight b\\c teammates didn't position themselves properly. If you're an assassin you need to make sure you don't dive too deep for a kill and then can't safely get out. If you cant reach the carries safely, then just help your team take out the tanks/bruisers first...then as a team you go after the carries that are left. There's all kinds of little things like this that will help you to climb up, but you have to know what to practice at in order to do it. Watching high elo streamers was extremely helpful for me. That's where I gained a large majority of game knowledge. Also one thing I noticed in Bronze is if you control the objectives...Baron, Dragon, Buffs, Towers, and just have overall good map awareness...you are guaranteed to win more games. Bronze players do not put nearly enough emphasis into how important getting objectives is. They play with the attitude that League is about playing team death-match and whoever gets the most kills wins. That couldn't be further from the truth. I'm currently ranking up a Bronze account just for fun and controlling the objectives/securing them is how I'm winning most games. I've climbed 3 divisions in a matter of days just by knowing what to do and when to do it. I main jungle and adc...roles I can carry the game from and make a huge impact with.             To recap....don't be greedy, focus on the objectives not kills, and position yourself properly in teamfights. You also have to constantly play ranked if you want to climb at all. You can't just play a game or two of it here and there and expect to get anywhere. Climbing is something that takes time and patience. And ALWAYS ALWAYS ALWAYS look at what you can do better! Even if you go 20/2/17....there are ALWAYS things you could've still done better to help your team. No one is the perfect player. If you get killed, think about it and say \"hmmmm how could I have won that fight instead of dying?\" \"What could I have done differently there?\" High elo players always say the #1 thing to getting better is to realize your own mistakes and learn from them, cuz everyone makes mistakes. Hope this was at least some help to you man. Good luck! If you ever have any questions or just want to learn whatever you can, I can give you my summoner name if you want.....","replies":[]},{"poster":"Jungled","date":"2015-09-11T14:11:47.694+0000","up_votes":1,"down_votes":0,"body":"Mid: Play champions that have high mobility and snowball potential. Once you have the snowball rolling, roam as much as you can and try and get the rest of your team an advantage as well. Don't be greedy for kills. If you can roam bot and get a kill for your ADC then great work. The advantage of being mid lane is the fact that you can roam to anywhere in the map. Top, bot and jungle. Utilise wards and place them in appropriate positions based on time stamps and potential pathing by enemies (not just the jungler, think of roaming lanes as well).\n\nTop: Pick champions accordingly and time and position your teleports so that they are most advantages and create the best outcomes for team fights. e.g. zoning. Again, utilise wards and ward accordingly. \n\nJungle: Jungle is where you can do a ton of good for your team. Just aim to get your laners as much of an advantage as possible. I tend to focus a lane that I believe we will get the most benefit out overall. Maintain your presence and utilise your roaming ability to ward. If you can put a pink down in the river bush of mid lane. Fantastic.\n\nBest of luck!\n\nRegards,\nEuVee [@euveelol](http://www.twitter.com/euveelol)","replies":[]}]}