{"poster":"Soloc","date":"2017-05-04T19:58:56.178+0000","title":"Mac 7.9 issue with graphics (not the 1/4 of a screen","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":0,"body":"Hi all.\r\n\r\nAfter patch 7.9 the borderless setting causes the game to be played in a smaller window than my screen (I can't resize it) which means that when I move the mouse outside of the window I'm done x).\r\n\r\nMy Fullscreen setting causes the game to be shifted up with a black horizontal area on the bottom and even I place my mouse at the edge of top of the screen the camera doesn't go up because the game's screen is outside of my monitor area.\r\n\r\nFinally my windowed setting doesn't let me resize the window and so I always see the status bar of the mac and my app bar on the bottom. Again if in the middle of the game I move the mouse outside of said window I'm also done (as in the camera doesn't move and the game window loses focus).\r\n\r\nOS: Sierra 10.12.4\r\nLoL Version: 7.9.186.\r\nResolution: 1920x1800 (same as the previous patches which worked fine, even with the new client)\r\n\r\nThank you, and let me know if you need more info.","replies":[{"poster":"Broporo","date":"2017-05-05T03:11:56.939+0000","up_votes":1,"down_votes":0,"body":"Hmmmmmm, thaaaaat is really hard to conceptualize what's going on without some kind of picture. I'm getting the point that your window is shifted somewhat so that you can't see the entire League window, and if you move the mouse anywhere outside the window then it changes focus to the background. This sounds a lot like the 1/4 screen issue, so if you haven't yet be sure to check the steps in the [**sticky we made here**](https://boards.na.leagueoflegends.com/en/c/help-support/nxyEq9WA-532017-14-screen-directx-error-issues) to double check that it doesn't fix it. \n\nIf that doesn't seem to help, we might need to take a look at your config files to make sure those aren't damaged in any way. We can do a manual reset on those files by following [**this guide**](https://support.riotgames.com/hc/en-us/articles/201761934-Mouse-and-Keyboard-Issues#mq2).","replies":[{"poster":"Soloc","date":"2017-05-05T18:57:03.440+0000","up_votes":1,"down_votes":0,"body":"Ok, so in windowed mode: https://ibb.co/n9Og85\nIn borderless mode: https://ibb.co/jftET5\n\nI already saw the sticky (thank you anyways) but doesn't work. My monitor resolution is 1920x1080 (max and current resolution) and LoL video setting resolution is set to 1920x180 aswell.","replies":[{"poster":"Broporo","date":"2017-05-05T20:23:47.389+0000","up_votes":1,"down_votes":0,"body":"No worries! I was hoping we could get this fixed up with some quick and easy steps, since not let's try something a little more in-depth. Let's try going into your config files and forcing the resolution to match your monitor's. \n\n- Navigate to the default install directory /Applications/League of Legends.app/Contents/LoL/Config\n- open the Mac config file, and look for Height and Width\n- edit those to match what your monitor is currently set to\n\nLet me know if that works a little better!","replies":[{"poster":"Soloc","date":"2017-05-06T13:12:58.442+0000","up_votes":1,"down_votes":0,"body":"It was already equal to the monitors resolution. \n\nFull screen worked after I turned it to 1600x900 and back to 1920x1080. Borderless and Windowed continue the same.","replies":[{"poster":"The Arctic Otter","date":"2017-05-20T21:26:06.831+0000","up_votes":1,"down_votes":0,"body":"Did your ticket ever get resolution?","replies":[]},{"poster":"Broporo","date":"2017-05-06T20:24:45.542+0000","up_votes":1,"down_votes":0,"body":"Weeeeeeird....that resolution might be stemming from something completely different. It looks like League is being forced to run in a slightly lower resolution than your monitor, and I was hoping you config file just had the wrong settings. Since borderless and windowed still aren't working quite right, let's get you little more in-depth help with our tech guys in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new).","replies":[]}]}]}]}]},{"poster":"ﬂÔw","date":"2017-05-05T22:55:04.196+0000","up_votes":1,"down_votes":0,"body":"I have this problem as well ;-;","replies":[]}]}