{"poster":"D4rki3","date":"2017-04-11T20:57:23.749+0000","title":"Duo Partnerin","subforum":"Clans & Teams","up_votes":5,"down_votes":8,"body":"heho! ich suche ne duo support partnerin (silber elo maximal gold) f&uuml;rs solo queue! ich will die beiden neuen champs Rakan und xayah dann mainen ich selbst bin in einem lol clan und dort zurzeit auch in nem team mit dem wir in der flex queue climben bei interesse kann ich mit dem clanleiter um einen eintritt reden","replies":[{"poster":"XExEcUtOrX04","date":"2017-04-11T21:45:00.633+0000","up_votes":2,"down_votes":6,"body":"Das Forum ist keine Partnerbörse!","replies":[{"poster":"Vikypedia","date":"2017-04-12T12:18:12.444+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=XExEcUtOrX04,realm=EUW,application-id=ElKI1ocy,discussion-id=YE3Rhw8k,comment-id=0000,timestamp=2017-04-11T21:45:00.633+0000)\n> Das Forum ist keine Partnerbörse!\n\nKann dir doch egal sein ob der Thread Ersteller einen w oder m Support haben möchte ist doch seine Sache. Es wurde im Thread auch nicht danach gefragt ob w oder m Support Spieler besser sind etc. sondern hier wird nach einem w Support gesucht. Warum hier jetzt einige meinen ihren geistigen Durchfall nieder zu schreiben ist mir unerklärlich. \n\nLasst jedem doch bitte seins und seid nicht so gehässig. Die Community verträgt es auch wenn ihr unnötige Kommentare die nicht zu der Anfrage im Thema gehören einfach mal für euch behält und vllt auch mal etwas nettes schreibt.\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"XExEcUtOrX04","date":"2017-04-12T12:24:48.601+0000","up_votes":1,"down_votes":1,"body":"Ach ich bin nicht der einzige, es gibt genügend andere die auch so denken. Es wurde eigentlich schon viel zu oft diskutiert warum man einfach geschlechtsneutral suchen sollte - und außerdem ist es immernoch ein Forum in dem ich schreiben kann was ich möchte (solang ich mich an die regeln halte).","replies":[{"poster":"Vikypedia","date":"2017-04-12T12:41:59.329+0000","up_votes":3,"down_votes":0,"body":"***","replies":[{"poster":"XExEcUtOrX04","date":"2017-04-12T13:31:56.212+0000","up_votes":1,"down_votes":2,"body":"Er kann ja wie er möchte schreiben, ich kann meine Meinung dazu haben und diese hier auch preisgeben. Es zwingt ja keiner irgendjemanden meine Texte durchzulesen. Und genau da ist das Problem - es kommt keiner damit zu recht das jemand eine andere Einstellung zu einem Thema hat, man fühlt sich immer direkt angegriffen und aufs schwerste beleidigt. \n\nUnd nochmal: Ich beschneide niemanden in seinen Rechten, das bedeutet aber auch das er im Gegenzug meine Rechte akzeptieren muss, ob er sich das durchliest ist eine andere Frage.","replies":[{"poster":"Vikypedia","date":"2017-04-12T15:04:24.473+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"XExEcUtOrX04","date":"2017-04-12T18:31:39.202+0000","up_votes":1,"down_votes":0,"body":"Du sollst doch nicht immer von wenigen auf alle schließen!","replies":[{"poster":"Vikypedia","date":"2017-04-12T19:29:48.283+0000","up_votes":2,"down_votes":2,"body":"***","replies":[{"poster":"XExEcUtOrX04","date":"2017-04-12T20:28:17.421+0000","up_votes":1,"down_votes":2,"body":"Woher hast du diese Information? Ich für meinen Teil habe mehr Spieler die freundlich sind bzw. einfach nichts sagen. Nur der geringere Teil der LoL-Community ist wirklich so stark toxic.","replies":[]}]}]}]}]}]}]}]},{"poster":"D4rki3","date":"2017-04-11T21:52:24.835+0000","up_votes":5,"down_votes":2,"body":"natürlich...jeder der nach ner duopartnerin fragt ist automatisch auf ne freundin aus...1. weist du nicht mal welches geschlecht ich hab 2. wenn ich männlich wäre könnte ich ne beziehung hben 3. wenn ich männlich wäre könnte ich auch homosexuell sein ich finde diese erst eindrücke immer verdammt scheiße aber hey mehr hab ich von der lol community die voll von nonverballen affen sein kann auch ned erwartet aber ein versuch war es wert","replies":[{"poster":"XExEcUtOrX04","date":"2017-04-11T22:00:47.116+0000","up_votes":2,"down_votes":1,"body":"¯\\_(ツ)_/¯\n\nUnd dann fühlt man sich gleichs aufs übelste beleidigt?","replies":[{"poster":"D4rki3","date":"2017-04-11T22:03:18.350+0000","up_votes":2,"down_votes":2,"body":"ja das war vielleicht etwas passive aggressiv formuliert aber man muss ja bei so einem post nicht gleich von ner beziehungssuche ausgehen? wenns so wäre würd ich unseren clan ned angeben bzw die person ned einladen wenn ich nur auf das eine aus wäre^^","replies":[{"poster":"XExEcUtOrX04","date":"2017-04-11T22:06:52.215+0000","up_votes":2,"down_votes":1,"body":"Dann sag mir doch mal jetzt bitte warum du extra eine Partnerin suchst? Ich meine ist denn das männliche Geschlecht schlechter?","replies":[{"poster":"D4rki3","date":"2017-04-11T22:10:36.570+0000","up_votes":2,"down_votes":1,"body":"ums hart zu formulieren...ja ich kenn keinen guten männlichen supp main selbst bei uns im clan in jedem team is der supp weiblich die haben aber schlichtweg keine zeit weil die fast jeden tag training haben und irgendwo muss dann das real life hin","replies":[{"poster":"Nivoras","date":"2017-04-11T22:14:16.318+0000","up_votes":5,"down_votes":3,"body":"Komisch ich kenn fast keine guten weiblichen Spieler bis auf wenige aka 2 Ausnahmen... xD","replies":[{"poster":"HHaie tabbian","date":"2017-04-12T15:39:55.831+0000","up_votes":1,"down_votes":0,"body":"Gut ist relativ ;) Ich glaub es gibt schon ein paar mehr Spielerinnen, die auf niedrigem Silberniveau mithalten können :p","replies":[{"poster":"Nivoras","date":"2017-04-12T23:54:17.472+0000","up_votes":1,"down_votes":0,"body":"Gut ist für mich Diamant und höher und da habe ich bisher nur 2 kennen gelernt :p\nAber wie du sagst, gut ist relativ :D","replies":[]}]}]},{"poster":"XExEcUtOrX04","date":"2017-04-11T22:16:09.157+0000","up_votes":2,"down_votes":1,"body":"Dann schließt du aber von wenigen auf alle, ich weiß nicht ob das besser ist. Ich für meinen Teil kenne einige gute Supporter, in (fast) allen Skillklassen - so rar sind die nicht ... wenn man aber nur weibliche sucht kann man auch nix anderes finden.","replies":[]}]}]}]}]}]}]},{"poster":"Nycaria","date":"2017-04-11T22:57:01.861+0000","up_votes":3,"down_votes":1,"body":"Immer wieder faszinierend, wie viel Hate solche Posts hervorrufen. Viel Glück bei der Suche.","replies":[{"poster":"D4rki3","date":"2017-04-12T06:22:29.070+0000","up_votes":2,"down_votes":2,"body":"danke, vor allem passts halt auch mit nem weiblichen supporter besser zum thema was rakan und xayah find das echt geil gemacht von riot die synergy zwischen beiden champs","replies":[{"poster":"Megamaexx","date":"2017-04-12T13:33:49.515+0000","up_votes":1,"down_votes":0,"body":"Zum Thema der beiden Champions passt es eher, wenn man einen männlichen Supporter hat (ich entnehme mal deinen anderen Aussagen hier, dass du weiblich bist)","replies":[{"poster":"D4rki3","date":"2017-04-12T17:39:46.752+0000","up_votes":1,"down_votes":0,"body":"nein bin ich nicht wollte mit den anderen aussagen nur darauf hinweisen das ich es sein könnte nur weil ich ne w supp suche heißt das ja nicht das ich ne beziehung oder sonstiges will weil ich ja auch weiblich sein könnte etc...aber danke das wenigstens ein paar menschen hier hirn besitzen und den post nicht so sehen!!","replies":[{"poster":"Megamaexx","date":"2017-04-12T19:39:32.184+0000","up_votes":1,"down_votes":0,"body":">nein bin ich nicht\n\nSorry, kam so rüber^^\n\n>aber danke das wenigstens ein paar menschen hier hirn besitzen und den post nicht so sehen!!\n\nEs gibt eben keinerlei Vorzüge, die man auf das Geschlecht spezifizieren kann, was den Spielstil angeht. Es ist von dir ein Trugschluss, dass weibliche Supporter besser sind. \nDas variiert von Person zu Person.","replies":[]}]}]}]},{"poster":"D4rki3","date":"2017-04-12T06:21:22.765+0000","up_votes":2,"down_votes":2,"body":"danke","replies":[]}]}]}