{"poster":"Jokersmoker","date":"2018-10-11T09:25:24.558+0000","title":"Progetto per coach e per chi cerca un coaching.","subforum":"Reclutamento","up_votes":2,"down_votes":1,"body":"Ciao a tutti, vado subito al sodo, stiamo cercando persone di qualsiasi Elo disposte a fare coaching per un progetto di una piattaforma online che metta in contatto utenti disposti ad insegnare il proprio stile con gente che vuole migliorarsi in game.\r\n\r\nHo detto qualsiasi Elo perch&eacute; molti anche ad Elo medio-basso sono magari bravi nella teoria e nella strategia e meno nella meccanica, molti coach importanti non sono ad altissimi livelli di gioco, questa piattaforma ha lo scopo di valorizzare davvero il coach indipendentemente dal suo livello di gioco.\r\n\r\nSe siete interessati questa sera avr&ograve; l&rsquo;onore e l&rsquo;&ograve;nere di poterne parlare tranquillamente durante una live su twitch.\r\nCi tengo a sottolineare che non &egrave; un&#039;associazione a cui aderire, &egrave; una piattaforma libera a chiunque e SENZA VINCOLI, ognuno sar&agrave; libero da ogni punto di vista ma di questo ne parleremo molto meglio a voce.\r\n\r\nNickname su twitch: Thejokersmoker_\r\nLa live inizia alle ore 20:00 \r\n\r\nVi aspetto per rispondere a domande o curiosit&agrave; ;-)","replies":[{"poster":"SoulOfIwao","date":"2018-10-13T19:38:27.251+0000","up_votes":1,"down_votes":0,"body":"Ciao io S4 non riesco a salire, mi alleno circa 4/5 ore al giorno ma non riesco a migliorare. sono 4 anni che gioco, è ancora disponibile tutto ciò? Sarà a pagamento o Free?","replies":[{"poster":"Jokersmoker","date":"2018-10-14T12:38:53.070+0000","up_votes":1,"down_votes":0,"body":"Ciao soul la piattaforma è in progettazione, non manca molto, è una piattaforma che mette a disposizione dei coach gli strumenti necessari per organizzare i propri coaching e rendere facile la comunicazione tra chi cerca un coach e chi vuole fare il coach, per quanto riguarda i costi ogni coach inserisce un prezzo orario, quindi dipende da quello, paypal sarà la modalità di pagamento.","replies":[]}]},{"poster":"Andri Aka Endi","date":"2018-10-12T22:36:25.264+0000","up_votes":1,"down_votes":0,"body":"sarei interessato (sono passato da s5 0lp a s2 0lp in una settimana e mezzo circa riprendendo a rankare questo periodo e salgo benino perchè credo di essere minimo da gold per conoscenza e meccanica con i champ confident) ma sono povero af quindi rip","replies":[]},{"poster":"mangialavandini","date":"2018-10-11T12:09:17.273+0000","up_votes":1,"down_votes":0,"body":"Ciao, quanto durerà lo stream?","replies":[{"poster":"Jokersmoker","date":"2018-10-11T13:05:14.426+0000","up_votes":1,"down_votes":0,"body":"Ciao caro, lo stream durerà un paio di ore ma parlerò del progetto all'inizio del tutto, non sono alla ricerca di follow però è meglio spiegare alcune cose a voce che scrivendole, tutto qui :-) cercherò di spiegare al meglio il progetto e se si hanno domande è più facile interagire.","replies":[]}]}]}