{"poster":"BattleNîght","date":"2019-09-17T18:14:20.754+0000","title":"Abgestiegen","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":2,"body":"Guten Abend, \nIch habe da mal eine Frage, ich bin seit paar Games auf Gold 2 bin grad durch unglückliche Teammates auf 0 Punkte gesprungen und hab dann 1 Game verloren und bin direkt abgestiegen.... \nHabe eine MMR von Gold 1 im Solo Que\nHab eine Winrate von 54% und hab nichtmal 100 Spiele also kein hard stuck oder sowas. \nFinde das schon bisschen frech das man sofort mit 1 Lose auf 0 Punkte absteigt trotz besserer MMR und sogar guter KDA in den games. \nIch habe sogar in meinen letzten 2 Loses Auto Fill Positionen bekommen also 1 mal meine Second Role und beim 2 mal Auto Fill was wirklich unlucky is wenn man dann sofort absteigt..\n\nNun meine Frage ab wann steigt man denn nun ab? Laut Riot FAQ kann man das nicht genau sagen...","replies":[{"poster":"BattleNîght","date":"2019-09-18T18:52:16.917+0000","up_votes":1,"down_votes":0,"body":"Es gibt eine Seite \"whatismymmr.com\" die deine Spiele analysiert und berechnet.\nDa wird die deine geschätzte MMR angezeigt. Ganz genau stimmt sie natürlich nicht aber man kann sich orientieren habe es mit mehreren Accounts probiert.","replies":[]},{"poster":"BlackSugaRose","date":"2019-09-17T18:34:55.368+0000","up_votes":1,"down_votes":0,"body":"Huhu BattleNîght,\n\nwegen sowas abzusteigen ist frustrierend, das kenne ich zu gut, da bin ich ganz bei dir.\nWinrate und KDA haben damit aber nichts zu tun. **(Edit)**\nDen \"Abstiegschutz\" gibt es auch nur in IV-er Divisionen und unmittelbar nach dem Aufstieg.\nWenn du gerade deine Promo gewonnen hast, steigst du nach einem Lose nicht direkt wieder ab.\nDu kannst im Prinzip zwei Spiele verlieren, ohne Punkte zu verlieren, erst nach der dritten Niederlage steigst du ab.\n**(Edit: Wirklich starke MMR Abweichungen können dabei scheinbar eine Ausnahme bilden.)**\nIn IV-er Divisionen steigst du erst dann ab, wenn sich deine MMR eine komplette Liga unter deinem derzeitigen Rang befindet.\n(Zumindest ist das meine letzte Information zu dem Thema)\nIch wünsche dir viel Erfolg dabei, wieder aufzusteigen!\n\nLiebe Grüße\nBlackSugaRose","replies":[{"poster":"Angel Ayume","date":"2019-09-18T06:29:25.530+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BlackSugaRose,realm=EUW,application-id=ip27PlEH,discussion-id=ByRFpGIE,comment-id=0002,timestamp=2019-09-17T18:34:55.368+0000)\n\n> Mit MMR (die man ohnehin nicht einsehen kann) und Winrate hat das aber nichts zu tun. Zumindest nicht in einer II-er Division.\n\nMit der Winrate hat es tatsächlich nichts zutun, da geb ich dir recht. \nAber die MMR ja schon. Wäre seine MMR tatsächlich sehr hoch, dann bräuchte er schon mehr als nur 1 oder 2 Spiele um abzusteigen. Ich hatte in irgendeiner Season mal eine sehr hohe MMR (geschätzt anhand der LP die ich bekam und verlor) und bin selbst nach 5 Niederlagen auf 0 LP nicht abgestiegen. {{sticker:zombie-brand-clap}} \nUnd ich bin mir ziemlich sicher, dass das keine 5er/4er Division war. \nIst seine MMR aber nur so hoch wie sein Rang auch entspricht, dann ist es wohl zu erwarten, dass er nach einem Game direkt wieder absteigt. \nZu sagen das die MMR damit nichts zutun hat wäre also irgendwie falsch.","replies":[{"poster":"BlackSugaRose","date":"2019-09-18T08:35:16.509+0000","up_votes":1,"down_votes":0,"body":"Danke für den Einwand! Ich hab meinen Kommentar mal dementsprechend angepasst.\nJetzt, wo du es sagst. Es kann sogar sein, dass mir das auch ein mal passiert ist.\nDas dürfte aber auf meinem kleinen Account gewesen sein.\nMein Main ist leider zu hardstuck, um davon gebrauch zu machen. \n{{sticker:sg-janna}}","replies":[{"poster":"Tickle My Donger","date":"2019-09-18T19:14:23.867+0000","up_votes":1,"down_votes":1,"body":"Habe 5 Spiele nacheinander verloren auf 0LP und bin nicht abgestiegen, das war auf Gold 2.","replies":[]}]}]}]},{"poster":"AudreyrJmEb","date":"2019-09-18T06:16:25.940+0000","up_votes":1,"down_votes":0,"body":"Deine Mmr is wohl doch nicht so gut^^ bin noch nie nach einem Game auf 0 LP direkt wieder abgestiegen, außer TFT, rip q.q","replies":[]},{"poster":"Timethief49","date":"2019-09-17T18:21:57.647+0000","up_votes":1,"down_votes":0,"body":"Du kannst garnicht wissen, was deine MMR ist.","replies":[]},{"poster":"ITroll4Fun","date":"2019-09-17T18:43:12.339+0000","up_votes":1,"down_votes":2,"body":"Woher weißte deine MMR? Kannst mir bitte es erklären wie genau man es berechnet?","replies":[{"poster":"BattleNîght","date":"2019-09-18T18:54:16.458+0000","up_votes":1,"down_votes":0,"body":"Es gibt eine Seite \"whatismymmr.com\" die deine Spiele analysiert und berechnet.\nDa wird die deine geschätzte MMR angezeigt. Ganz genau stimmt sie natürlich nicht aber man kann sich orientieren habe es mit mehreren Accounts probiert.","replies":[]},{"poster":"AudreyrJmEb","date":"2019-09-18T06:15:58.593+0000","up_votes":1,"down_votes":0,"body":"Kann er nicht wissen","replies":[]}]},{"poster":"Tickle My Donger","date":"2019-09-18T19:11:37.978+0000","up_votes":1,"down_votes":1,"body":"Also ich hab nach meinem Aufsteig zu G2, ca. 4 oder 5 SPiele auf 0LP verloren und bin nicht abgestiegen. Nur meine mmr hatte ein bisschen gelitten, statt wie vorher +26LP beomme ich  nur noch +22, bin trotzdem nach der losing streak nach G1 durchgeritten mit 7 wins in Folge.","replies":[]},{"poster":"RM Heartmeander","date":"2019-09-17T18:26:55.476+0000","up_votes":1,"down_votes":1,"body":"Also ich dodge ja, wenn ich Autofill komme.","replies":[]}]}