{"poster":"Niaphim","date":"2016-04-16T19:37:17.537+0000","title":"Turrets are a joke (LCS, probably a minor spoiler)","subforum":"Gameplay","up_votes":50,"down_votes":3,"body":"Just watched H2K vs FNC series. Not going too much into details to avoid spoilers but in one game an ace at 30 minutes was enough to destroy an outer turret, an inner turret, an inhib turret, an inhibitor, two nexus turrets and the nexus itself - all in under 30 seconds. And it wasn't even a full AD comp.\nAnother example of why towers are a complete joke.","replies":[{"poster":"The Deckowner","date":"2016-04-16T19:58:12.741+0000","up_votes":12,"down_votes":0,"body":"Death timer extremely long+Towers are paper thin=30 minute farm festival an 1 teamfight wins the game","replies":[]},{"poster":"ProfDrDeath","date":"2016-04-16T20:48:23.279+0000","up_votes":5,"down_votes":15,"body":"\"It wasn't even a full AD comp.\"\n\nDoesn't matter, the champions and builds Fnatic had were pretty much tailored to such a situation (albeit certainly not intentionally):\n\n- Maokai and Trundle can tank towers for long, preventing the minion wave from being thinned out and the activation of backdoor plating\n- Orianna build high AP, and AP tower damage was buffed this season\n- Graves has increased damage to towers if he stands right next to them\n- Ezreal had Blade and has his W AS buff, increasing the tower-taking speed of the whole team\n- A clean ace at 31 minutes is game over, and it should be\n\nIf they did not have one of these elements, they would not have been able to go through the towers this fast.","replies":[{"poster":"Kouhey","date":"2016-04-17T02:00:16.422+0000","up_votes":15,"down_votes":2,"body":"> A clean ace at 31 minutes is game over, and it should be\n\nlol wut?","replies":[]},{"poster":"Xonra","date":"2016-04-17T09:50:49.174+0000","up_votes":8,"down_votes":0,"body":"It should be if teams are playing around onjectives and towers are down. When zero...literally zero mid towers are down and you can end the game in 25 second...no that is stupid","replies":[{"poster":"ProfDrDeath","date":"2016-04-17T11:03:31.273+0000","up_votes":2,"down_votes":2,"body":"Look at the exact way that fight happened - it ended under the blue side T1, with red minions already crossing the river, and was a perfect ace, with the tanks remaining healthy. It was literally the perfect storm - even with S5 death timers and S5 turrets, Fnatic would've ended the game there.","replies":[]}]}]},{"poster":"Glaedr","date":"2016-04-17T11:12:56.626+0000","up_votes":1,"down_votes":8,"body":"Die in front of your base at the 30 minute mark and lose 5 for nothing. Wow, I can't believe they're finishing!\n\nPeople love to talk about death-timers and turrets but conveniently neglect any context.","replies":[{"poster":"macromite","date":"2016-04-17T15:55:29.687+0000","up_votes":8,"down_votes":0,"body":"enough to destroy an outer turret, an inner turret, an inhib turret, an inhibitor, two nexus turrets and the nexus itself.\n\nouter turret, like the one you use in laning.\n\ninner turret, like the one after the outer but before your base.\n\ninhib turret, the first turret in your base.\n\ninhibitor, an objective that is in your base.\n\nnexus turrets, there are two of these and they are well within your base.\n\nnexus, something that should take more than one fight to take unless you were slaughtered in your base and it was naked.\n\n\nin the old days, we called a 30 minute game a stomp, and that was cause to win by 30 minutes your team had to be taking objectives non-stop.","replies":[]}]},{"poster":"stealthfox94","date":"2016-04-16T19:50:03.726+0000","up_votes":4,"down_votes":1,"body":"Turrets seem week except when I try to tower dive then they're suddenly super strong.","replies":[{"poster":"Irelia Bot","date":"2016-04-16T19:53:44.129+0000","up_votes":5,"down_votes":0,"body":"they are still rather weak when that is done as well.","replies":[]}]},{"poster":"Ezzary","date":"2016-04-16T19:38:33.881+0000","up_votes":2,"down_votes":10,"body":"Nothing has really changed compared to something like season 1 it's just the death timers but they also do not want 1hr long games to happen. \nTurrets are fine fam","replies":[{"poster":"Woook3r","date":"2016-04-16T19:44:15.161+0000","up_votes":2,"down_votes":5,"body":"its fine for my games, but I think that 27 minutes of farming minions and killing wards and then one teamfight to win is a bit boring.","replies":[{"poster":"Ezzary","date":"2016-04-16T19:46:01.115+0000","up_votes":1,"down_votes":3,"body":"Because if 1 or 2 people die then its baron or towers. same shit happened in every season it's nothing new.","replies":[{"poster":"Woook3r","date":"2016-04-16T19:48:46.058+0000","up_votes":3,"down_votes":0,"body":"it seemed like ppl fought for more advantages and took more risks in other seasons.","replies":[{"poster":"Ezzary","date":"2016-04-16T19:52:36.195+0000","up_votes":1,"down_votes":2,"body":"If you watch alot of the top teams play during those seasons it's like how it is now. lol","replies":[{"poster":"Sakaru","date":"2016-04-18T00:42:30.546+0000","up_votes":1,"down_votes":0,"body":"It's not even a little similar, no. They had to be taking towers throughout the game, because each tower mattered to some degree. Now they're weak enough that you don't have to ever touch the towers, just wait 'til 28+ and win a single teamfight.\n\nGo back and watch teamfights at the 28~32 minute mark. They didn't take all 3 of mids towers, the inhib and both inhibitors. Even when they had Baron. They got a lot done, yes. But the game wasn't just \"Welp, nothing up to this mattered because all that matters is the first teamfight after 28 minutes.\"\n\nWhether games ended quickly, or lasted and ended lategame. Everything that happened in the game up to the final moments had an impact. Now days it's literally just the first teamfight after 28 minutes that matters. Nothing else. At all.","replies":[]}]}]}]}]}]},{"poster":"FakeGravity","date":"2016-04-17T16:43:48.320+0000","up_votes":2,"down_votes":0,"body":"I'm also getting sick of the passive lane swaps to take turrets because they are just impossible to defend and fall so easily","replies":[]},{"poster":"NeX Daark","date":"2016-04-18T03:16:47.692+0000","up_votes":1,"down_votes":0,"body":"Tune in for a LCK game. Viewership is about half of what it used to be.  Even for SKT.  The goal with the changes was to make games shorter. The changes failed miserably.\n\nMost games are just as long because teams are too afraid to commit to a fight. NA is the only region that is interesting to watch because, clown fiesta.","replies":[]},{"poster":"chide da jungler","date":"2016-04-16T22:19:25.035+0000","up_votes":1,"down_votes":5,"body":"The problem is that you're watching LCS is which is boring a fuk.","replies":[{"poster":"Shadòw","date":"2016-04-17T12:14:04.899+0000","up_votes":3,"down_votes":1,"body":"And this isn't happening in soloQ too?\n\nFirst think, then write","replies":[{"poster":"JediSenpaiNP","date":"2016-04-17T18:03:28.989+0000","up_votes":1,"down_votes":1,"body":"What SoloQ?","replies":[]}]}]},{"poster":"MunchCrunchLunch","date":"2016-04-17T17:24:58.597+0000","up_votes":1,"down_votes":2,"body":"wouldnt it be called the EUCS.","replies":[]},{"poster":"Athenes Lulu","date":"2016-04-16T19:54:31.524+0000","up_votes":1,"down_votes":2,"body":"I mean, that's what happens when we don't want ADCs to be mandatory.","replies":[]}]}