{"poster":"FlashFor","date":"2015-02-19T16:10:51.613+0000","title":"A mai napom megint és ismént köszönöm Riot","subforum":"Általános beszélgetés","up_votes":1,"down_votes":6,"body":"Semmi extra az ugyan ilyen témámba is ez van kb.\nA mai napom 4 játék és 4 vereség . köszönöm Riot.\nMinden egyes játékba egy hozzá nemértő játékos és legalább egy ember ami throwol + ba még egy aki nem ér semmit.\nKöszönöm, hogy 3vs8 ba vagyok minden játékba.\nLehet elgondolkozom azon, hogy ha így folytatódik tovább, hogy átmegyek a Blizzárd játékára.\n\nA megmondó embereknek: lehet mondani, hogy akkor menj, de ha ez megy idő után majd a 10 éves avagy más korosztály játszani nemtudó játékosok maradnak.","replies":[{"poster":"M4dr4c","date":"2015-02-19T16:29:33.452+0000","up_votes":4,"down_votes":0,"body":"Igazából csak egy dolgot köszönhetsz ebből nekik, az ingyenes játékot, amivel elütöd az idődet. A játékosokat nem a Riot neveli ilyenre, nem ő tanítja őket, hogy így viselkedjenek, sőt próbál tenni ellene. Szóval ne az ő hibájuk legyen már. :p\n\nu.i: A Heroes per pill nincs még olyan állapotban, hogy kiadják. Nincs erőegyensúly, az UI 1001 kívánnivalót hagy maga után, valamint hiába a több pálya az egy játékmód per pill kicsit kevés. Ne indulj felé oly nagy bőszen. ;)","replies":[{"poster":"FlashFor","date":"2015-02-19T18:07:52.492+0000","up_votes":1,"down_votes":0,"body":"Bocsi, de az, hogy én bemegyek 40 percre egy RANKED játékba és nem tudnak játszani az emberek az eléggé baj és csak idő húzás.\nAz nem játék, hogy 2 ember 15 perc alatt add 8 killt az ellenfélnek.\nKéne talán változtatni a ranked besorolásokon, hogy az ilyen embereket kiszűrjék.\nÉn szoktam mondani, hogy nem érdekel, hogy vesztek, de ne így kapjak ki, hogy 10-30 az állás hanem az legyen szoros vagy élvezhető, de ez egyikse a kettő közül.","replies":[{"poster":"NalamiHUN","date":"2015-02-19T19:56:31.845+0000","up_votes":1,"down_votes":0,"body":"Na én ezért nem fogok soha rankedezni. :)\n\nCsak ideggörcsöt kapnék. Nekem jó a normal, ott kevesebb ideggörcsöt kapok. :D","replies":[{"poster":"manaszon","date":"2015-02-19T22:35:03.305+0000","up_votes":1,"down_votes":0,"body":"Közel sem olyan biztos az! :)\nMióta elértem a 30. szintet, jóval több diamondos / goldost dob össze velem, és a fele trollkodik. Nem azért, mert trollok, mert jó játékosok lennének, csak itt normálra úgymond \"funolni\" jönnek, próbálnak mindenféle hülyeséget. Ha ne adj' Isten szólnék, hogy rendesen pickeljen (és en egy LB-t hozzon supportnak..), akkor általában legalább 3-tól megkapom az \"its just a normal game\" mondatot. Úgyhogy, én szerintem amint rúnaoldalaimat befejezem, megyek is rankedra, hátha azt komolyabban veszik - aztán majd meglátjuk.","replies":[]}]}]}]},{"poster":"Zooty","date":"2015-02-19T16:48:13.148+0000","up_votes":1,"down_votes":0,"body":"Szóval a Riot hibája hogy vesztettél? Ok...\n\nEzt a jelenséget amúgy a szaknyelv \"tilt\"-nek hívja. Olyan mentális állapotba vagy, amivel sorozatosan veszted a játékokat. Minél többet vesztesz, annál jobban akarod megnyerni a következőt, és ennek következtében folyamatosan túlvállalod magad, illetve kevésbé tudsz koncentrálni a játékra.\n\nSzerintem hanyagold egy ideig a játékot, és majd nyugodtabb állapotba folytasd, mert különben \"a Riot mégtöbb játékodat fogja elveszteni neked..\"","replies":[{"poster":"FlashFor","date":"2015-02-19T18:16:58.201+0000","up_votes":1,"down_votes":2,"body":"Tudod a Riot tehet róla, mert rengeteg jó és hasznos dolgot írnak ki és mi a válasz?\nKilehet játszani!\nErre te?\nErre én az, hogy ez egy jó ötlet amit finomítani kéne, mert ez egy kezdet és még sehol se lehet látni a végét, de nem, mert miért is fogadják meg.\n\nIgazad van abba, hogy túl vállalom magam, mert ezt jól látod hissz nyerni akarok, mert most vesztettem el a 3 promom Platinába ahol már rég Plat2-be kéne elvileg legyek ...\nÉs tudod erre én:\nHanyagolom is, de ne. hogy azt hidd, hogy ez gátolt eddig, hogy hozzam amit hozni szoktam, mert nem hátráltatott csak bosszantott a dolog.\n\nUtólag bosszant a dolog és a Riot-ot támadom, mert változtatni kéne a dolgokon.\n\nVissza térve:PBE elvileg az egy próba fázisban lévő dolgokat raknak be oda.\nNa és tudod mennyi hiba jön ki a PBE szerverről, hogy ott már próbálják nem is kevés ideje?\n\nDe lehet nem így van.","replies":[{"poster":"Brăd","date":"2015-02-22T18:28:03.707+0000","up_votes":1,"down_votes":0,"body":"Na ennél magyartalanabb szöveget még az életben nem láttam xd","replies":[{"poster":"FlashFor","date":"2015-02-23T16:02:55.273+0000","up_votes":1,"down_votes":0,"body":"Te vagy a Magyartalan.","replies":[]}]}]}]},{"poster":"Tetth","date":"2015-02-19T18:15:57.298+0000","up_votes":1,"down_votes":0,"body":"Szerinted a platos vagy goldos játékosok nem kapnak rossz társakat ha bronzban smurfölnek? Vagy az elo boosterek is csak a szerencséjük miatt nyernek mindig? Fogd a csapatodra, nem csak az ő hibájuk.","replies":[{"poster":"FlashFor","date":"2015-02-19T18:21:59.372+0000","up_votes":1,"down_votes":0,"body":"Oh Oh. Mindjárt jön, hogy végén én vagyok a rossz és én rontom a játékot.\nNa erre én az, hogy Top 300 skarner és top 500 Rammus S4.\nMost se változtam, csak a ráta változott meg gyökeresen.\nNem felvágás, de egy kis bizonyítás.\nVagy kinek a hibájára gondolsz?","replies":[]}]},{"poster":"Eshu","date":"2015-02-19T16:49:52.836+0000","up_votes":1,"down_votes":0,"body":"A Heroes őszintén szólva egy f*s. És nem azért mert \"nem a LoL másolata\" - egyszerűen kihagyni a tárgyakat és globálissá tenni az xp-t egy olyan mértékben lebutított játékká tették hogy hihetetlen. Tényleg nyíltan álltam neki és elég sokat játszottam vele mire erre az ítéletre jutottam - de kb annyi köze van egy normális moba-hoz hogy van benne 2-3 lane - ennyi. A menet közben választható extra képességek egy jópofa ötlet de ez kevés lesz ahhoz hogy kitűnjön a piacon max a blizzard marketingje fogja eladni. Ja és minden pofátlanul, undorítóan drága. Itt veszel egy bajnokot vagy 500 forintból ott meg vagy tízszer ennyiből. \n\nBtw nem tudom hogy mennyiben oldja meg a problémádat hogyha a többi játékosnak elsírod hogy milyen rossz csapatod volt. Melletted még 100-meg 100 embernek - csak szerencsére nem mindnek van késztetése erről spammelni. Most ha csinálsz erről két három naponta egy új topicot jobb lesz neked? Mert nekünk tuti nem... Őszintén kit érdekel? Tudunk rajta változtatni? Pont annyira nem, mint ahogy te sem. Láttunk már ilyet ? Vagy milliószor. Akkor meg nem sok értelme volt, lévén nincs benne új vagy érdemi információ és előrelépést sem hozott semmilyen értelemben. Meg nem is fog.","replies":[{"poster":"FlashFor","date":"2015-02-19T18:09:01.036+0000","up_votes":1,"down_votes":0,"body":"Nem változtat semmin, de tudod unom és igazság szerintem én nekem ez így jó.\nKöszi az infot+ba de majd megnézem talán, ha így adja a játékos ráta.","replies":[{"poster":"Eshu","date":"2015-02-19T18:14:17.949+0000","up_votes":1,"down_votes":0,"body":"Nm. Ha ingyen hozzájutsz egy próbát megér de elég felejthető jelenség - ki tudja mi lesz belőle a béta végére de most nem meggyőző. És nem azért mondom mert \"menő\" lenyálkázni az új jövevényt a mobák közt :D ","replies":[]}]}]}]}