{"poster":"Àsho","date":"2020-01-11T16:20:40.260+0000","title":"Connessione lenta solo su LoL","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Ciao ragazzi,\r\npremetto di aver acquistato un nuovo pc, di avere fibra Fastweb e sono connesso con wifi a 2 metri dal modem. \r\nQuando gioco a LoL il 70% delle partite le faccio con un ping fisso di 350 ms circa, però se esco  e vado su speed test va tutto bene (mentre faccio questa operazione e rientron in game ping scende a 90 per poi tornare sui 300). \r\nDa cosa può dipendere? Cosa posso fare? \r\nNon ho problemi di connessione su altri dispositivi, devo modificare qualcosa sul computer, entrare nel modem? Non so più che pensare, grazie in ogni caso","replies":[{"poster":"Hyuaska","date":"2020-01-11T18:19:15.449+0000","up_votes":2,"down_votes":0,"body":"Ci sono molti fattori che potrebbero far alzare i ping quando giochi.\nPer prima cosa : \"premetto di aver acquistato un nuovo pc, di avere fibra Fastweb e sono connesso..\" con il pc vecchio te li dava questi problemi nei giochi?\n---\nComunque le soluzioni più semplici sono:\n\n• Chiama un operatore della fastweb e li fai notare questo problema appunto. Oppure puoi andare sul forum della fastweb e segnalare il problema, se fai questo ti consiglio di mettere già uno screen dei dettagli della linea. Dato che la prima risposta che riceverai sarà appunto: \"Posta qui uno screen dei dettagli della tua linea grazie\"\n\n• Potrebbero essere colpa dei software di sicurezza ovvero il firewall che ha regole troppo \"restrittive\" o l'antivirus. (anche se dubito che sia questo, visto che solo in gioco si alza mentre al di fuori hai detto che va bene)\n\n---\n\nUna soluzione che richiede più ..\"impegno\", se si vuole dire così:\n\n• Il ping è anche influenzato dalle prestazioni dei server DNS utilizzati dal tuo provider di internet, puoi provare a cambiare DNS al computer o al router e vedere se migliora magari.\nTIP: Se esegui questa operazione, fai degli screen delle impostazioni che cambi, così se devi fare un \"back-up\" almeno non hai problemi.\n\n----\n\nOppure aspetti un volontario che ti dia un consiglio più valido.","replies":[]},{"poster":"Àsho","date":"2020-01-12T23:01:22.912+0000","up_votes":1,"down_votes":0,"body":"Ragazzi grazie per le risposte, per ora ho fatto molte altre partite e tutto é migliorato disattivando il Firewall, ora sono tornato al mio vecchio problema di connessione che mi sarebbe bastato pur di giocarci, ovver 1/2 secondi di lag ad ogni partita mai poi stabile, quindi useró le informazioni che mi hai dato per contattare fastweb.\nGRAZIE :]","replies":[{"poster":"Hyuaska","date":"2020-01-13T08:31:00.483+0000","up_votes":1,"down_votes":0,"body":"Bene dai sono felice di averti aiutato in qualche modo, comunque cerca di sistemare il problema senza disattivare il firewall.\nNon ti consiglio di lasciarlo disattivato per molto, anche se giochi solo a lol.\n\nGl &amp; hf","replies":[]}]},{"poster":"Ringiel","date":"2020-01-11T16:46:07.126+0000","up_votes":1,"down_votes":0,"body":"hai provato a fare un game con il cavo? e poi quanto pinghi nello speed test?","replies":[]}]}