{"poster":"Tomiika92","date":"2015-01-01T16:19:54.898+0000","title":"Mit tegyen az aki bedőlt a Free Rp és Free Skinnek  ?","subforum":"Általános beszélgetés","up_votes":2,"down_votes":0,"body":"Vannak olyan ismerőseim akik bedőltek a Free RP és Free Skineknek.\r\nKöztük sajnos én is megnyitottam a linket sőt még be is jelentkeztem.. \r\nAhogyan néha néha ránéz a haverom a  LoL-on azt látja ,hogy bot gameban voltam .\r\nÉs minden ismerősöm aki bedőlt ennek az utolsó meccse bot game .\r\nEgy fórumos bejegyzésből megtudtam  van egy gyerek aki megkapta ezt a linket megnyitotta a rokona és be is jelentkezett.\r\nDe ő még be tud jeelntkezni neki viszont eltűnt XXXX riot pont azt látta ,hogy van valaki akinek küldözgették a különböző skineket .\r\nAz illető msot kapott 3 új skint nem tüntetem fel se a küldő sem az új tulajdonos nevét.\r\nIgaz meg van az e-mail címe az első 5 betű/szám kivételével ha valaki tud valamit az kérem vegyen fel ismerősnek LoL-ban név : Tomika1199\r\nElőre is köszönöm. !! VIGYÁZZATOK","replies":[{"poster":"Tomiika92","date":"2015-01-01T16:49:39.396+0000","up_votes":1,"down_votes":0,"body":"Ezekre mikor kapok választ ? \nVan esély arra ,hogy vissza kapjuk az profiljainkat ? \nKöszönöm a választ és a segítséget!!","replies":[{"poster":"iSPZ","date":"2015-01-01T17:00:32.922+0000","up_votes":4,"down_votes":0,"body":"A fiókkal kapcsolatos problémákat, tehát eltulajdonításokat, átveréseket a Riot nagyon szigorúan veszi és kifejezetten figyel rá és törekszik, hogy 100%-ban azt illesse meg a fiók akié valójában, ennek érdekében mindent megtesz, hogy kiderítse és annak az embernek a tulajdonába adják akit megillet. Általában pár órán belül választ kapsz, de beletelhet 1 napba is, addig várj türelmesen. A legjobb ilyenkor amit tehetsz, hogy össze szedsz a fiókról mindent amit tudsz. Mik ezek? Például, mikor és hol (helység) regisztráltad a fiókot, milyen internetszolgáltatónál, mikor és mennyi RP-t töltöttél fel, milyen módon (tehát bankkártya, telefon, stb.), nagyjából hány hősöd van, milyen kinézetek, nagyjából mennyi, ebből amennyit tudsz szedj össze, a barátlistáról pár embert \"szedj össze\", tehát akiknek a nevére emlékszel azokat írd le, honnan jelentkeztél be túlnyomó részt, ha volt másik helyszín is ami eltér az általánostól akkor az hol volt. Amennyiben eltulajdonították a fiókodat, tehát megváltoztatták a jelszót és akár az email címhez való elérést is, akkor felfognak tenni egy rakat kérdést a játékostámogatástól, a fent leírtak közül elég sokat. Mivel írtad, hogy ha valaki tud segíteni stb. az vegyen fel játékon belül, de viszont ebben a válaszban azt írtad, hogy \"vissza kapjuk a profiljainkat\" így nem teljesen értem, hogy \"csak\" átvertek és veszteséged van, vagy magát a fiókot is elveszítetted és megváltoztatták a jelszavakat. Mindenesetre nekem ezt nem kell tudnom, a lényegen nem változtat mindenféleképpen a játékostámogatás fog tudni segíteni. Írd le nekik pontosan, hogy mi a helyzet, eltulajdonították vagy sem, milyen veszteségeid értek, stb. A fent leírtakat pedig egy jegyzettömbbe össze szeded hasznos lehet a későbbiekben is ha számon tartasz pár dolgot a fiókról amiket ténylegesen csak Te tudsz így ha a későbbiekben ilyen lenne akkor nem kell aggódni vissza fogod-e kapni a fiókot vagy sem.","replies":[]}]},{"poster":"iSPZ","date":"2015-01-01T16:31:16.510+0000","up_votes":4,"down_votes":0,"body":"Nem poénból lett millió egy helyen létrehozva ilyen téma, hogy ez mind átverés, ne dőljetek be neki, a hivatalos főoldalon ha nincs kint akkor biztosan átverés, aki ezután is bedől az ilyen badarságnak... Egyszerűen nem is értem, látszik az ilyen oldalakon, hogy igénytelen, öt perces munka, ha nem a hivatalos oldal vezet oda akkor egyértelmű, hogy átverés. Nem volt és valószínűleg nem is lesz ilyen oldal. Itt a fórum legtetejére ki van ragasztva egy [téma](http://boards.eune.leagueoflegends.com/hu/c/altalanos-beszelgetes/3EZflHfP-free-rp-free-skin-figyelmeztetaos) amiben mindent leírunk, ennek ellenére... kicsit szét kellene nézni mielőtt eszeveszetten gondolkodás nélkül beírjátok a jelszót meg minden mást... nem értem.\n\n[Itt](https://support.riotgames.com/hc/hu/requests/new) kell írni a játékostámogatásnak, írj le mindent amit tudsz, képeket küldj és majd ők segítenek, itt a fórumon nem tudunk.","replies":[]},{"poster":"Tomiika92","date":"2015-01-01T23:42:03.644+0000","up_votes":1,"down_votes":0,"body":"Köszönöm szépen a segítséget az accuntom újra elérhető :)) Bár a zsákolókirály Dariusomat eladták és vettek saját használatra egy skint ,de legalább megvan :)\nKöszönöm mindenkinek a segítséget :)","replies":[]},{"poster":"Zooty","date":"2015-01-01T16:53:44.894+0000","up_votes":1,"down_votes":0,"body":"Írj a [játékostámogatásnak](https://support.riotgames.com/hc/hu/requests/new) minél előbb!!","replies":[]}]}