{"poster":"Hi Im DRAAAAAVEN","date":"2017-05-21T13:49:08.697+0000","title":"Zu unrecht gebannt","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo Leute, \r\nIch bin echt von Riot entt&auml;uscht, da die so stur sind. Ich bin vor ein halbes Jahr ungef&auml;hr f&uuml;r 2 Wochen suspendiert wurden f&uuml;rs flamen. Ich habe darauf hin nicht mehr geflamed und mir klar gemacht, dass es nur ein Game ist. Jedoch wurde ich random als ich eine Runde gestrartet habe Permanent gebannt wurden, obwohl ich nicht mal geflamed habe. Die Gr&uuml;nde bzw. der Chatverlauf war fehlerhaft und schon mehr als 6 Monaten her. Ich wurde f&uuml;r den Chat weshalb ich suspendiert wurde auch gepermabannt, was gar keinen Sinn macht, da ich daraufhin nicht  mal geflamed habe. Au&szlig;erdem ist nicht mal eine Mail zugeschickt wurden, worin angeblich alles genauer stehen sollte. Ich bin echt entt&auml;uscht von Riot, da ich schon mehr als ein Jahr spiele und mehrere hunderte Euro f&uuml;r den Account investiert habe. Meine Freunde haben mir gesagt, wenn es vom Programm gemachjt wroden ist, kann ich nicht entbannt werden, bzw. werden sie nicht machen. Ich nehme das aber nicht hin, da ich zu unrecht gepermabannt wurde. Ich bitte die Community darum, Riot auf diese Diskussion aufmerksam zu machen. \r\nPS: Ich habe beweise, dass die Chats schon veraltet sind, da ich sie damals mit meinem Handy fotografiert habe, als ich suspendiert wurde. \r\nAlso bitte Riot, es ist ein Programm, der auch mal fehlerhaft sein kann. \r\nIch bitte auch um konstruktive Tipps und Hilfen, was ich machen k&ouml;nnte.","replies":[{"poster":"TerrorRaven","date":"2017-05-21T13:50:53.981+0000","up_votes":1,"down_votes":0,"body":"Klär das mit den Support. Hier im Forum kann dir niemand helfen.","replies":[{"poster":"Hi Im DRAAAAAVEN","date":"2017-05-21T13:53:00.695+0000","up_votes":1,"down_votes":0,"body":"könntest du mir bitte sagen, wo ich den Support finde? am besten ein link oder erklären. Danke für diene Hilfe","replies":[{"poster":"Humpelstilzche","date":"2017-05-21T14:00:27.435+0000","up_votes":2,"down_votes":0,"body":"Hier: \nhttps://support.riotgames.com/hc/de/requests/new\n\nIch hätte noch eine Bitte an dich. Könntest du bitte, sobald du das Ticket geschrieben hast, uns die Ticketnummer sagen? \nAußerdem wäre das von dir erwähnte Foto von damals so wie ein Screenshot der aktuellen Chatlogs nützlich. \nNatürlich steht es dir völlig frei das alles sein zu lassen, aber wenn du das machen könntest, hätte ich die Möglichkeit das mal beim Support (zu dem wir Volunteers im direkten Kontakt stehen) anzusprechen. Du bist nämlich jetzt schon der zweite innerhalb weniger Tage, der von diesem Fehler berichtet. Dementsprechend nützlich wäre es, der Sache näher nachzugehen.","replies":[{"poster":"Hi Im DRAAAAAVEN","date":"2017-05-21T14:08:27.383+0000","up_votes":1,"down_votes":0,"body":"selbstverständlich ich werde das schreiben und ihnen die nummer schicken. Vielen Dank für ihre schnelle Antwort und Hilfe","replies":[{"poster":"thefire7","date":"2017-05-21T15:03:15.019+0000","up_votes":1,"down_votes":0,"body":"Viel Glück^^","replies":[]}]},{"poster":"Hi Im DRAAAAAVEN","date":"2017-05-21T14:33:43.421+0000","up_votes":1,"down_votes":0,"body":"Die Ticketnummer lautet: 30369383\nHabe gerade Porbleme damit die Fotos vom Handy auf dem Pc zu ziehen, aber versuche die nochmal hinterher zuschicken","replies":[]},{"poster":"AmazingMaze","date":"2017-05-21T14:14:37.630+0000","up_votes":1,"down_votes":0,"body":"An dieser Stelle mal ein dickes Lob von mir an dich!\nFinde es super, dass du solchen Dingen nach gehst. <3","replies":[]}]}]}]},{"poster":"Allerbester Biss","date":"2017-05-21T18:27:26.092+0000","up_votes":1,"down_votes":0,"body":"Einfach den Bann hinnehmen weil du ihn so oder so nicht ändern kannst XD","replies":[]},{"poster":"ΔRC RΔFUNZΞL","date":"2017-05-21T17:23:38.785+0000","up_votes":1,"down_votes":0,"body":"wie schaffst du es einen 2  wochen bann nach einem halben zu haben","replies":[]}]}