{"poster":"kRaGuth","date":"2015-06-21T12:52:06.421+0000","title":"Toplane Noob sucht Mates/ Coach - ab 23+","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Mahlzeit liebe Beschw&ouml;rer,\n\nnach langer Zeit, habe ich meinen Account aus der Mottenkiste rausgekramt. Mein Account existiert schon relativ lange, jedoch aktuell erst Level 24. Als LoL damals erschienen ist, habe ich das Game eine Zeit getestet. Bei erreichen von Level 20, musste ich jedoch das spielen vorerst aufgegeben, aus verschiedenen Gr&uuml;nden.\n\nSeit einigen Wochen bin ich wieder dabei und habe Blut geleckt. Durch meine lange Abstinenz habe ich mich nat&uuml;rlich nicht weiterentwickelt und dieses bekommt man bei einigen Games auch zu sp&uuml;ren. Um erst mal wieder in das Spiel rein zu kommen, bin ich erneut mit einem Smurf-Account gestartet.\n\nIch bin jetzt auf der Suche nach einigen Mitspielern, die Erbarmen haben und einem Noob das Game vern&uuml;nftig beibringen wollen und mich Unterst&uuml;tzten. Au&szlig;erdem macht das Zocken im Team, doch auch viel mehr Laune. ;-)\n\nIch bin urspr&uuml;nglicher Egoshooter-Spieler und habe 7 Jahre lang aktiv Counter-Strike 1.6 und Counter-Strike:Source auf professionellem Niveau gespielt. Ich wei&szlig; also was Teamgeist bedeutet und habe eine schnelle Auffassungsgabe. Ich bin ein ruhiger Spieler und habe immer einen flotten Spruch auf den Lippen.\n\nIch bin 27 Jahre alt, bin ein Fischkopp _(komme aus dem sch&ouml;nen Norden)_ und bin berufst&auml;tig. Das ein oder andere Match nach Feierabend ist eigentlich immer drin . Am Wochenende kann daf&uuml;r um so mehr gesuchtet werden. Headset f&uuml;r die Kommunikation ist selbstverst&auml;ndlich vorhanden. Ich spiele fast ausschlie&szlig;lich Toplane.\n\n**Ich bin auf der Suche nach Mitspielern die**\n\n- Mindestens 23 Jahre alt sind _(Ausnahmen best&auml;tigen die Regel)_\n- ruhige und freudliche Art; kein geflame, Beleidigen etc. \n- regelm&auml;&szlig;ig Zocken\n- Erfahren und bereit sind ihre Kenntnisse zu teilen.\n- Kommunikativ; TS-Server kann ich dauferhaft stellen\n\n\nSkypedaten sende ich gerne nach erster Kontaktaufnahme zu. Alternativ einfach ingame adden.\n\n\nIch freue mich, von euch zu h&ouml;ren!","replies":[{"poster":"kRaGuth","date":"2015-08-03T13:53:13.005+0000","up_votes":1,"down_votes":0,"body":"Sers,\n\nPromo beendet. Wurde in Gold V eingestuft. Wer Lust hat auf Dou Ranked...","replies":[]},{"poster":"kRaGuth","date":"2015-07-19T12:00:35.925+0000","up_votes":1,"down_votes":0,"body":"Mittlerweile Level 30 und spiele mit einigen Gold und Diamant Spielern. ^^","replies":[]},{"poster":"kRaGuth","date":"2015-06-28T15:41:40.243+0000","up_votes":1,"down_votes":0,"body":"*push* ^^","replies":[]},{"poster":"PremiumKartoffel","date":"2015-06-21T12:55:52.809+0000","up_votes":1,"down_votes":0,"body":"Warum +23? Ich glaube dir können mehr Leute helfen die sogar unter 20 sind.","replies":[{"poster":"kRaGuth","date":"2015-06-21T12:59:32.012+0000","up_votes":1,"down_votes":0,"body":"Moin,\n\nda wirst du mit hoher Wahrscheinlichkeit sogar Recht haben. Jedoch musste ich die Erfahrung machen, dass gerade jüngere Spieler oftmals meine Voraussetzungen und wünsche nicht nach kommen können. Außerdem ist auch das zwischen Menschliche oftmals durch den Altersunterschied nicht gegeben.\n\nAber wie bereits geschrieben, bestätigen Ausnahmen die Regel. ;-)","replies":[]}]}]}