{"poster":"tScHkLynn","date":"2019-04-15T16:37:51.769+0000","title":"Riot ruined smurfing in Season 9 and it's killing games for both smurfs and non-smurfs","subforum":"Gameplay","embed":{"description":null,"url":"https://subefotos.com/ver/?9699c4f98f5f39f0fd4595f6da581204o.png","image":"https://fotos.subefotos.com/9699c4f98f5f39f0fd4595f6da581204o.png"},"up_votes":82,"down_votes":9,"body":"This is something that nobody seems to bring up, and it's impacting games for everyone. \n\nLast season, if you were smurfing on a fresh, unranked, level 30 account and 10-0 your placements, you would automatically be placed Plat 5, as you would be placed correctly according to your MMR. You could even further skip P4 and P2 if you maintained a winstreak.\n\nThis season, you can 8-0 your provisionals on an unranked smurf account and only get Silver 1. \n\nWhether you hate smurfing with a passion or are okay with it, the result is a flood of silver and gold games being filled with smurfs deciding the outcomes, and extremely unfavorable matchmaking on one side. \n\nNot only are the platinum / diamond smurfs in these silver / gold games, but D1+ smurfs are also playing at least 15 games in silver / gold because they're not being appropriately placed in P5. \n\nSmurfs don't want to be playing 2 divisions below where they usually are placed, and silver and gold players definitely don't want more smurfs stuck in their matchmaking deciding games. \n\nLet me know your thoughts.","replies":[{"poster":"420 grams","date":"2019-04-15T17:01:57.225+0000","up_votes":35,"down_votes":0,"body":"Yet my friend who is a new player and Iron 4 0 lp skill level if I ever seen one, was placed Bronze 3 and has somehow stayed there with a 29% win rate after 40 games","replies":[]},{"poster":"Farm With Jayce","date":"2019-04-15T22:47:50.769+0000","up_votes":8,"down_votes":0,"body":"Pretty sure I brought this up like the 2nd week of the season. I won 8/8 of my game placements on my smurf, and the game placed me in bronze 4. Then I made a post about how this game was going to be dominated by smurfs in the future because its going to be hard for them to rank up","replies":[{"poster":"Madsin25","date":"2019-04-16T15:10:54.634+0000","up_votes":1,"down_votes":3,"body":"There is no way I believe this. Infact I 100% believe you are lying.\n\nAfter every game now it tracks your rank. In placements you get +50 LP most of the time after a win.\n\nSo if you went 8-0 you should be in ATLEAST bronze 1 even if you started at bronze 5(which you didn't).","replies":[{"poster":"Farm With Jayce","date":"2019-04-16T18:01:19.128+0000","up_votes":1,"down_votes":0,"body":"Almost like it started me in iron 4.","replies":[]}]}]},{"poster":"Moonscourge","date":"2019-04-16T07:04:43.758+0000","up_votes":6,"down_votes":0,"body":"THey've specifically said that brand new accounts that have never been ranked before are going to be placed very low. They said it 3 months before the season started.","replies":[]},{"poster":"Phieldworker","date":"2019-04-15T17:10:11.347+0000","up_votes":28,"down_votes":30,"body":"People should just play their main accounts and stop being that roadblock for people who are in their right Elo’s. It’s not fun getting stomped by a top lane vayne who is normally a D2 player in S2.","replies":[{"poster":"Disembark","date":"2019-04-15T17:59:30.728+0000","up_votes":17,"down_votes":11,"body":"When LP gains are fucked in diamond no one wants to play there. \n\nPlus it’s not about bashing low elo players, it’s about just having a “safety net” so you don’t feel tilted if you lose. I.e. you have 1 account in Plat 1, and another in Plat 2. You don’t get as tilted by rank fluctuation on the second account. Nor are you really “smurfing”. \n\nSame reason I usually have a higher rank on my “smurf” than my main. Being more relaxed when I play makes me play better. \n\nAlso most people smurf at most 1-1.5 divisions lower. Being a diamond player against silvers is actually like playing against bots. There is no joy in beating them. It’s not like you’re going for big plays or some shit to get big outplays or pentakills. They just walk into you and die half the time.","replies":[{"poster":"Illabethe","date":"2019-04-15T18:43:56.085+0000","up_votes":7,"down_votes":5,"body":"That's totally why every major streamer generally defaults to smurfing Bronze/Silver....\n\nNot all smurfs smurf for a safety net.\n\nSome smurf to help friends,\nOthers smurf for publicity.\nSome just smurf because they like to perma stomp.","replies":[{"poster":"Disembark","date":"2019-04-15T20:47:55.193+0000","up_votes":6,"down_votes":0,"body":"Not a single high elo streamer smurfs in bronze/silver. Most streamers smurf in Diamond 4 - Diamond 2. Smurfing in bronze for a streamer isn't even fun dude. It's like beating beginner bots over and over again. \n\nPlus it's physically difficult for a streamer to stay in bronze/silver. Unless they have a constant stream of people deranking for them or buying new accounts. ","replies":[{"poster":"Illabethe","date":"2019-04-15T21:57:30.569+0000","up_votes":3,"down_votes":5,"body":"NB3, SoloRenek, BunniFufu....... I could go on and on.....\n\nAnd no. It's not hard at all. You run in like a fool and int 0/3 at the beginning of the game, tilt your team, and then just play casual the rest of the game.... Instant loss. Just because someone's good does not mean they can't also play bad..... on purpose.\n\nhttps://matchhistory.na.leagueoflegends.com/en/#match-history/NA1/43247565 &lt; Banned Smurf who harassed Silver/Bronze for over 3 years on this account.\n\n\nYup. So hard to derank. (I love his 92/0 Fizz game, 52/2/24 Kai Sai game, etc etc)","replies":[{"poster":"KaiSá","date":"2019-04-16T03:17:20.564+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Illabethe,realm=NA,application-id=3ErqAdtq,discussion-id=NyJG0XBw,comment-id=00020000000000000000,timestamp=2019-04-15T21:57:30.569+0000)\n>\n> NB3, SoloRenek, BunniFufu....... I could go on and on.....\n> \n> And no. It's not hard at all. You run in like a fool and int 0/3 at the beginning of the game, tilt your team, and then just play casual the rest of the game.... Instant loss. Just because someone's good does not mean they can't also play bad..... on purpose.\n> \n> https://matchhistory.na.leagueoflegends.com/en/#match-history/NA1/43247565 &lt; Banned Smurf who harassed Silver/Bronze for over 3 years on this account.\n> \n> \n> Yup. So hard to derank. (I love his 92/0 Fizz game, 52/2/24 Kai Sai game, etc etc)\n\nidk about solo rene or bunnifufu but nb3 always smurfts in high plat-mid diamond. so no nb3 is  playing ur bronze game.","replies":[{"poster":"Disembark","date":"2019-04-16T06:59:12.913+0000","up_votes":4,"down_votes":0,"body":"Even Solo Renek, the lowest he usually goes is Gold elo. And he isn't even high elo (perma D4-D2 on his main).","replies":[{"poster":"RtClick","date":"2019-04-16T12:57:50.814+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Disembark,realm=NA,application-id=3ErqAdtq,discussion-id=NyJG0XBw,comment-id=0002000000000000000000000001,timestamp=2019-04-16T06:59:12.913+0000)\n>\n> Even Solo Renek, the lowest he usually goes is Gold elo. And he isn't even high elo (perma D4-D2 on his main).\n\nDiamond is considered high elo. Regardless, SRO has an account in Masters.","replies":[{"poster":"Asura","date":"2019-04-16T17:13:49.896+0000","up_votes":2,"down_votes":0,"body":"D4 is not high elo.","replies":[{"poster":"RtClick","date":"2019-05-08T16:49:23.625+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Sοna,realm=EUNE,application-id=3ErqAdtq,discussion-id=NyJG0XBw,comment-id=000200000000000000000000000100000000,timestamp=2019-04-16T17:13:49.896+0000)\n>\n> D4 is not high elo.\n\nD4 and above represents the top 5% of players, so yes it's high elo. If you make to Diamond 4, you're literally better than 95% of people who play the game.","replies":[]}]}]}]}]},{"poster":"Disembark","date":"2019-04-16T06:54:11.050+0000","up_votes":2,"down_votes":0,"body":"Streamers don't have the time to int your games dude. You think you're way more important than you are.","replies":[]}]},{"poster":"HeeroTX","date":"2019-04-16T15:22:22.607+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Disembark,realm=NA,application-id=3ErqAdtq,discussion-id=NyJG0XBw,comment-id=0002000000000000,timestamp=2019-04-15T20:47:55.193+0000)\n>\n> Not a single high elo streamer smurfs in bronze/silver. Most streamers smurf in Diamond 4 - Diamond 2. Smurfing in bronze for a streamer isn't even fun dude. It's like beating beginner bots over and over again. \n\nhttps://www.youtube.com/results?search_query=bronze+to+challenger\n\nOMG, look at all the wannabe streamers with clickbait titles pretending to play in low elo for clicks.  I can only imagine how angry all the viewers must be when they expect to see a guys climbing out of low elo easily but instead watch high diamond games because the streamers never ACTUALLY play in low elo.  Thanks for correcting me, I was worried that this happens a LOT because there are so many videos that aren't hard to find at all.  It's a big relief to hear that this is all a scam and these videos are either guys playing in Diamond or just scam videos that don't actually contain noob-stomping smurf crap.\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Disembark","date":"2019-04-16T16:41:46.605+0000","up_votes":1,"down_votes":0,"body":"Jay Sea was Challenger like once on the OCE ladder and is a diamond player. MidBeast was doing a specific challenge that isn’t just “shitting on bronze players”.\n\nNot to mention it’s a “bronze to challenger”. They escape bronze in like 15 games. They aren’t constantly smurfing in bronze. Considering that streamers play like 10+ games a day.","replies":[{"poster":"HeeroTX","date":"2019-04-17T02:16:51.941+0000","up_votes":1,"down_votes":0,"body":"That's 2 out of the stack, keep scrolling, there's more.  If 10 guys do this and take 15 games to get out of bronze, that's 150 games, if they take the same amount to get thru silver, that's 300 games of \"low elo\" thrown off by smurfs.\n\nAnd besides, I thought you said \"**Not a single high elo streamer** smurfs in bronze/silver.\"","replies":[]}]}]}]}]},{"poster":"Ragnaveil","date":"2019-04-15T19:54:02.879+0000","up_votes":3,"down_votes":0,"body":"This. I had to sweat almost multiple weeks of blood and tears just to get d3 (which if the gains weren't that bad and ranked didn't switch in the first place I could have gotten in maybe half the time it took) because of the very degrading lp gains. Doesn't help that also most people who make it to diamond the first time just quit climbing afterward and play to maintain rank, lowering matchmaking quality. Couple that with boosters wreaking havoc, and you are given a cesspool that is called the true ELO hell (d4/d5).\nThat is why smurfs exist other than pros trying  shit but not screwing their main ranking (or try to have the most accounts in challenger in the case of some streamers).","replies":[]},{"poster":"GripaAviara","date":"2019-04-15T22:53:08.995+0000","up_votes":2,"down_votes":1,"body":"> When LP gains are fucked in diamond no one wants to play there.\n\nSo they play two, three divisions down, basically putting themselves - hundreds of LP behind? This is a stupid argument. \n\nSmurf are 3 categories:\n- **Not by choice:** they have friends in lower ELO and want to have fun with them. Or were placed by the system. I respect this smurfing since it's not their direct fault\n-**Training** they need a break from the stress and/or want to test new strategies/champions . While normal should be their choice, it seems some need the thrill of ranked, even if it's with people below their skill. \n- **Bully:** sort of a jerkoff, when they get a vanity orgasm from stomping lower skilled people or make views on their streams, most toxic smurfing and despise those people","replies":[{"poster":"KaiSá","date":"2019-04-16T03:28:01.247+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=GripaAviara,realm=EUNE,application-id=3ErqAdtq,discussion-id=NyJG0XBw,comment-id=000200000003,timestamp=2019-04-15T22:53:08.995+0000)\n>\n> So they play two, three divisions down, basically putting themselves - hundreds of LP behind? This is a stupid argument. \n> \n> Smurf are 3 categories:\n> - **Not by choice:** they have friends in lower ELO and want to have fun with them. Or were placed by the system. I respect this smurfing since it's not their direct fault\n> -**Training** they need a break from the stress and/or want to test new strategies/champions . While normal should be their choice, it seems some need the thrill of ranked, even if it's with people below their skill. \n> - **Bully:** sort of a jerkoff, when they get a vanity orgasm from stomping lower skilled people or make views on their streams, most toxic smurfing and despise those people\n\n\"training\" in normals doesnt work cus the skill level their is so random and people are so casual/trolly. when people train they normal train on an account that is about 1 division lower then them cus the people their are still good enough to offer a decent challenge if you are on something very unfamiliar with. so like say you are a d1 top main but want to learn mid more you probably play a plat 3-1 account as mid for a while then switch to a d4-3 account then finally play it on your main. so your working up to your skill lvl which you cant do in normals","replies":[]}]},{"poster":"Saianna","date":"2019-04-16T01:50:59.935+0000","up_votes":2,"down_votes":1,"body":"> When LP gains are fucked in diamond no one wants to play there.\n\nsmurfing was in LOL for alot longer than Diamond MMR fuckery Riot did. Sure it can be used as an argument now, but imo it hardly had any influence on number of smurfs. More like an excuse.","replies":[]},{"poster":"RacoonHunter","date":"2019-04-17T09:41:03.417+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Disembark,realm=NA,application-id=3ErqAdtq,discussion-id=NyJG0XBw,comment-id=00020000,timestamp=2019-04-15T17:59:30.728+0000)\n>\n> When LP gains are fucked in diamond no one wants to play there. \n> \n> Plus it’s not about bashing low elo players, it’s about just having a “safety net” so you don’t feel tilted if you lose. I.e. you have 1 account in Plat 1, and another in Plat 2. You don’t get as tilted by rank fluctuation on the second account. Nor are you really “smurfing”. \n> \n> Same reason I usually have a higher rank on my “smurf” than my main. Being more relaxed when I play makes me play better. \n> \n> Also most people smurf at most 1-1.5 divisions lower. Being a diamond player against silvers is actually like playing against bots. There is no joy in beating them. It’s not like you’re going for big plays or some shit to get big outplays or pentakills. They just walk into you and die half the time.\n\nIt's not just diamonds its everything above silver. I've watched youtubers and lcs casters who have admitted that ranked is the worst this season as it's ever been.","replies":[{"poster":"Disembark","date":"2019-04-17T12:03:00.315+0000","up_votes":1,"down_votes":0,"body":"No. Only for Diamond+ and the top of the ladder. It was being flooded with _overinflated_ lp gains, not deflated lp gains. And they hotfixed the lp gains in Diamond+ which made them super underinflated.\n\nThe people that were bitching about ranked quality like LS don't give a shit what happens in your silver games dude.","replies":[]}]},{"poster":"CervixGrappler","date":"2019-04-17T05:13:35.309+0000","up_votes":1,"down_votes":0,"body":"Wow as a silver player I really feel offended. Lmfao","replies":[]}]}]},{"poster":"Nea104","date":"2019-04-16T03:59:56.053+0000","up_votes":5,"down_votes":0,"body":"One-sided matches are due to their flawed/rigged matchmaking system.\nSmurfs just make it worse, but the problem is bigger and never gonna be solved 'cause \"working as intended\" :P","replies":[{"poster":"jurrrr","date":"2019-04-16T08:51:51.950+0000","up_votes":3,"down_votes":0,"body":"I agree with you that the problem is much bigger then what is known right now","replies":[{"poster":"IainG10","date":"2019-04-16T14:42:06.474+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=jurrrr,realm=NA,application-id=3ErqAdtq,discussion-id=NyJG0XBw,comment-id=00120000,timestamp=2019-04-16T08:51:51.950+0000)\n>\n> I agree with you that the problem is much bigger then what _Riot will admit to right now_\n\nFixed that for you","replies":[]}]}]},{"poster":"Banuvan","date":"2019-04-16T02:32:16.667+0000","up_votes":4,"down_votes":0,"body":"have an entire team almost a full rank above your team is disheartening and the game is over by 15 minutes.  There is zero fun from matchmaking at all.  Games are decided by 15 minutes now.","replies":[]},{"poster":"MiniJurista","date":"2019-04-15T16:50:54.721+0000","up_votes":4,"down_votes":54,"body":"If hes good he will climb even vs smurfs, next","replies":[{"poster":"XElite109","date":"2019-04-15T17:07:02.822+0000","up_votes":14,"down_votes":0,"body":"smurfs have more knowledge than the opposing player so that amount of experience does effect that level of game play so to say someone will still win if they are good is severely wrong.","replies":[{"poster":"HopeStartsWithU","date":"2019-04-15T19:49:05.972+0000","up_votes":1,"down_votes":0,"body":"But someone can LEARN from the enemies. The game isn't just about YOU getting better. While some games feel insanely unfair it forces some bronzies/irons to actually understand WHY some of their actions were wrong. Once they overcome some of their stupid mentalities (like greeding instead of farming, or chasing kills) they will automatically climb. Also playing against good mechanical players will eventually boost your mechanics.\n\nI don't like smurfs, it is annoying for noobs/newbies but it's not as bad as some people think it is.","replies":[{"poster":"GripaAviara","date":"2019-04-15T22:57:00.818+0000","up_votes":4,"down_votes":0,"body":"You can learn, but you have no agency as a bot for example on a top lanner getting stomped by a smurf that will then inevitably stomp the whole team. At best you can force a draw, but the problem is nobody jumps in skill so hard. You need constant stronger opponents to increase in skill","replies":[{"poster":"HopeStartsWithU","date":"2019-04-16T08:34:47.326+0000","up_votes":2,"down_votes":0,"body":"That's actually true.","replies":[]}]}]}]}]},{"poster":"Dweeebles","date":"2019-04-15T22:48:33.932+0000","up_votes":4,"down_votes":0,"body":"100 % agree, in fact it is way worse, a prominent streamer doing a Iron to whatever series started in iron and was on almost a 30 game winning streak and was not jumped divisions ahead somehow.... what a game ruining experience for the iron and silver players for every game he plays....","replies":[{"poster":"Madsin25","date":"2019-04-16T15:16:46.596+0000","up_votes":1,"down_votes":1,"body":"Except this doesn't happen.\n\nStomping placements on any account is going to put you above iron players from the get go.\n\nAnother 10 wins you are playing with plats.\n\nIt is virtually impossible to smurf in iron.","replies":[{"poster":"Dweeebles","date":"2019-04-16T17:55:59.606+0000","up_votes":1,"down_votes":0,"body":"This does happen, I am literally watching it game by game on youtube.  The difference is he didn't do his own placements.  Someone else did placements and a few other matches and then he bought the account.  Since he has taken over the account, he has about 39 wins and 2 losses and is still in bronze 4.  That is total BS and toxic, he should have been promoted instantly into gold or something after a 30 game win streak.  \n\nLiterally his last match is against against Iron and bronze players, not gold or plat players... so this does happen, no question about it.    \nhttps://imgur.com/a/jQn09fF","replies":[]}]}]},{"poster":"Eightprism","date":"2019-04-16T16:43:50.117+0000","up_votes":3,"down_votes":0,"body":"Jay Sea was 30 something games in and still in bronze lol","replies":[{"poster":"Dweeebles","date":"2019-04-16T17:57:02.114+0000","up_votes":1,"down_votes":0,"body":"yup, this is exactly what I was talking about in my post below.","replies":[]}]},{"poster":"Banuvan","date":"2019-04-16T03:09:04.836+0000","up_votes":3,"down_votes":0,"body":"just had a game where the opponent jungler has a 70% win rate in silver...Thanks Riot.  I love playing against smurfs who destroy my team and completely skew the game.","replies":[{"poster":"5050BS","date":"2019-04-16T05:25:32.711+0000","up_votes":2,"down_votes":0,"body":"I get that and my bot lane are a duo with 33% win rate.... Yep those games are 50/50 according to Riots shit Match Making.","replies":[]}]},{"poster":"Saianna","date":"2019-04-16T01:48:50.929+0000","up_votes":3,"down_votes":0,"body":"> Smurfs don't want to be playing 2 divisions below where they usually are placed,\n\nIsn't that like... the only reason why people make smurf accounts? So they can feel like gods among pleb while dominating each game? Cause if you just want to play on your level, the f would you need smurf account? For statistics? I don't get this.\n\nOverall smurfing did get hit, but alot less than you think it did. Smurfers will still smurf as if nothing happend. If anything normal people got hit harder as they'll have to deal with whatever smurf waste is being tossed at them in their lower-than-plat divisions.","replies":[{"poster":"KaiSá","date":"2019-04-16T03:24:08.861+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Saianna,realm=EUNE,application-id=3ErqAdtq,discussion-id=NyJG0XBw,comment-id=000e,timestamp=2019-04-16T01:48:50.929+0000)\n>\n> Isn't that like... the only reason why people make smurf accounts? So they can feel like gods among pleb while dominating each game? Cause if you just want to play on your level, the f would you need smurf account? For statistics? I don't get this.\n> \n> Overall smurfing did get hit, but alot less than you think it did. Smurfers will still smurf as if nothing happend. If anything normal people got hit harder as they'll have to deal with whatever smurf waste is being tossed at them in their lower-than-plat divisions.\n\nthere is dozens of reason why people have smurf accounts. a lot of challengers/grand masters have diamond accounts to play on during non peak hours cus playing non peak hours in challenger sucks. also have smurf accounts to try new builds learn champions. also people just have alt accounts for a safety net so if you get tilted play on an account that means less to you or if one account mmr gets messed up you dont have to spend forever fixing. there is a difference between a high diamond player wanting a few high plat accounts for legit reasons and having a lower silver account. accounts that are 0.5-1.5 divisions below your main have lots of value accounts 4 divisions are basically worthless you could just queue up for normals at that point.","replies":[{"poster":"Saianna","date":"2019-04-16T03:49:25.074+0000","up_votes":2,"down_votes":0,"body":"> also have smurf accounts to try new builds learn champions.\n\nYou can't be serious with this one. There are custom games/normals for that one. Heck, if you want to check how it works in RANKED and possibly ruin others time there's even more of a reason to ban such smurfer.\n\n> also people just have alt accounts for a safety net so if you get tilted play on an account that means less to you or if one account mmr gets messed up\n\nThis one falls under the 'statistics' I mentioned. Kinda broad meaning, I know, my bad. Tbh this is kinda going against the whole idea of ranked games. But whatever\n\nAll I know that for each 1 positive example why one would want to smurf, there's like 10+ cases of sealclubbing smurfers just wanting to feel good being OP.\n\nAt this point I'd wish if LOL went and just made smurfing impossible and fix/help with whatever reasons people were forced to smurf. Maybe 1-3 pardons, that player gets per week (increased to 5 by honour), or forced downgrade to find games for high elo players. It wouldn't ever happen anyways. Meh","replies":[]}]}]},{"poster":"AnotherFeeder","date":"2019-04-16T00:27:04.356+0000","up_votes":3,"down_votes":0,"body":"I did placements 8-0 and got silv 4 :(\n\nMMR wise I already get some plats in my game at silv 2 tho.","replies":[]},{"poster":"Andevar","date":"2019-04-17T20:40:45.665+0000","up_votes":2,"down_votes":0,"body":"Smurfs win 8-0 placed in whatever low rank still had a high MMR. They don’t play against other bronzes or silvers, they play against players according to their MMR, not rank.\n\nThat’s why silver smurfs with 90% winrate can be seen in plat and diamond games. It just becomes harder for them to legitimately rank up their sccounts.","replies":[]},{"poster":"GripaAviara","date":"2019-04-15T22:45:51.339+0000","up_votes":2,"down_votes":0,"body":"I brought it up and got tons of downvotes. But I'm glad people are more open here and finally start to see a problem","replies":[]},{"poster":"Ðroxx","date":"2019-04-16T00:38:23.644+0000","up_votes":3,"down_votes":1,"body":"I hate smurfing and I do 100% believe a large portion of the smurfs I encounter are doing it to stop people in lower ELOs because they cannot handle playing vs people at their own skill level. It's annoying, and yeah OP is probably right about this but I think smurfing in general is horrible for lower ELOs","replies":[]},{"poster":"Madsin25","date":"2019-04-16T14:53:47.762+0000","up_votes":2,"down_votes":1,"body":"You are overexaggerating this entire thing.\n\nFirst of all if you go 8-0 in your promos and get placed in silver 1 you will not actually be in silver 1, silver 1 will just be your rank.\n\nYou will have the MMR of mid golds(possibly even higher) getting 25+ LP per win until you start losing games.\n\nSource: I have lots of smurfs and this is what happens every single time.\n\nThe sad truth is there are no true smurfs in your silver games, those players are actually silver.","replies":[]}]}