{"poster":"Ciller","date":"2015-03-14T04:50:18.714+0000","title":"[Champion Concept] Mors, Shade of Death","subforum":"Concepts & Creations","up_votes":1,"down_votes":4,"body":"Mors is a champion who is excellent at ambushing opponent's, while also being an exceptional duelist.\r\n\r\nPassive: Shade's Vengeance- Mors gains 20 of one stat(completely randomized-excluding AP) when an enemy champion dies within a certain range of him.\r\n\r\nQ: Heart of the Shade- Mors takes a chunk out of himself, dealing an amount of true damage(costs life).\r\n\r\nW: Shade's Vengeance- If Mors is hit for more than a certain amount of damage, he may activate Shade's Vengeance, dealing the same amount of damage to the enemy.\r\n\r\nE: Shadow Strike- Passive: Mors gains an addition 50% damage when attacking from a bush. (amplifies spells) Active: Mors does 20xChampion level to a target, dealing more damage the lower the health of the opponent.\r\n\r\nR: Finalis- If the target is below 10% of their maximum HP, Mors execute's them, losing half of his maximum health, and instantly killing the target.\r\n\r\nThe R feels really strong on Mors, but, that is the ability that makes him, well, HIM. His kit allows for a load of counter play versus your opponent. For instance, say you are playing Mors as a jungler, you can hide in a bush, and max your E, allowing you to successfully ambush opponents. If you are playing him Middle, and feel like Mors needs to reduce the damage he is taking, or, at least, punish your opponent for doing damage to you with your W. Otherwise, it's still possibly the most beneficial to max your Q. Lore is shady (LOL, GET IT!), and so is artwork. I want him to be a sort of shadow with a purely black claw. If anyone could help me with this, that would be most beneficial.","replies":[{"poster":"Riot Lutzburg","date":"2015-03-15T01:15:23.203+0000","up_votes":2,"down_votes":0,"body":"Unfortunately I think this kit is all over the place and pretty broken in a number of ways.\n\nPassive- A completely random stat gain seems odd.  Perhaps it should be based off of the kind of champion who dies nearby?\n\nQ- Isn't this just Olaf's E?  Self-damage to deal true damage?\n\nW- This seems bland and uncounterable.  You also don't explain how he actually targets or activates the ability.\n\nE- A flat +50% damage spike on all damage from a bush seems mega broken in 1% of circumstances and completely useless in 99% of circumstances.  No one is going to stand in a bush and fight this guy if his kit is tuned to deal comparable damage to enemies outside of bushes and insane one-shottable amounts in a bush.\n\nR- Again, no mention of how this ability is targeted and dealing 10% of a target's health for 50% of your own sounds like a very unattractive trade in almost all cases.","replies":[{"poster":"Ciller","date":"2015-03-16T13:48:47.560+0000","up_votes":1,"down_votes":0,"body":"Yeah, I was very tired when I made Mors. His Q was supposed to have an additional effect, but I cannot remember for the life of me, what it was. His W is very much like Jax's old E. Where he would dodge and then be able to use it. Basically, the last target who did a good chunk of damage to him is just hit for the same amount. Say a Tryndamere crit's you for 350. You could activate the W to deal 350 damage to him. The E is meant to help for an assassination.  A 50% increase of damage to the Q, which dealt true damage, and was probably supposed to stun/slow, feels really good for assassination, and with a solid amount of Attack Speed, you could probably get 2 autos in before they can get out, and then you could ult for the kill. I forgot to mention that if used from a bush(the target doesn't need to be in the bush, he does) his ultimate is 30% for 30%. Very powerful, and it makes it a better trade. I will be editing it later. Thanks for helping me. His R is just a single target nuke, BTW.","replies":[]}]}]}