{"poster":"Barti119","date":"2015-05-14T14:30:59.422+0000","title":"new zac skin","subforum":"Campioni e gameplay","up_votes":3,"down_votes":2,"body":"salve a tutti. volevo chiedere se, secondo voi, &egrave; meglio acquistare ora la skin di zac oppure aspettare per vedere se ne aggiungeranno una in futuro (ad esempio pool party zac http://th05.deviantart.net/fs71/PRE/i/2014/289/1/a/league_of_legends__pool_party_zac_by_gisalmeida-d8313mr.jpg )\nfra un po cancellero questo post perche mi rendo conto che intasi solo il foro","replies":[{"poster":"Ucr0niA","date":"2015-05-14T14:34:48.864+0000","up_votes":2,"down_votes":1,"body":"Da possesore di Zac arma speciale ti posso dire che non è male, viene additata come semplice \"color rework\" ma ti posso assicurare che i boblet sono più visibili.","replies":[]},{"poster":"A Yordle ln Heat","date":"2015-05-14T14:32:58.572+0000","up_votes":3,"down_votes":3,"body":"Io Zac non l'ho nemmeno comprato, ma se dovesse uscire una Pool Party skin per lui mi prenderei di prepotenza l'uno e l'altra.\nPerò guarda, di skin per Zac non si sa nulla da più di due anni.\nArma Speciale a me piace molto, ti consiglio di prenderla; molto probabilmente ci vorrà diverso tempo prima che arrivi un'altra skin per lui!","replies":[{"poster":"xIDraz","date":"2015-05-15T10:23:35.516+0000","up_votes":1,"down_votes":6,"body":"Critica chi mette -1 ai post, spende soldi per comprare SKIN.","replies":[{"poster":"A Yordle ln Heat","date":"2015-05-15T12:26:38.995+0000","up_votes":4,"down_votes":1,"body":"Non trovo i collegamenti.\nDavvero.\nDel tipo \"tu mi hai offeso gne gne gne ora trovo difetti per offendere te\"?\nWow, complimenti :)","replies":[]},{"poster":"Darki200","date":"2015-05-15T10:31:39.574+0000","up_votes":3,"down_votes":1,"body":"Ma saranno cazzi suoi se compra le skin, come una gran parte dei giocatori, eh.","replies":[]},{"poster":"Ucr0niA","date":"2015-05-17T09:43:05.149+0000","up_votes":2,"down_votes":0,"body":"Ti prego, prova con studio assiduo ed integratori di fosforo, provaci ora, prima che sia troppo tardi.","replies":[]}]},{"poster":"Barti119","date":"2015-05-14T16:53:22.414+0000","up_votes":1,"down_votes":1,"body":"infatti pero non vorrei che, dato che praticamente non ha skin, ne facessero una con l'avvenire dell'estate. in quel caso \"pool party zac\" lo prenderei anche avendo special weapon.","replies":[]}]}]}