{"poster":"KingChris4k","date":"2018-01-13T21:42:25.214+0000","title":"Acc dauerhaft gesperrt","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":5,"body":"Hallo liebes Riot team\r\nIch hatte nach langer langer zeit mal wieder lust League of Legends zu spielen, und hab dann beim anmelden gelesen, dass mein acc dauerhaft gesperrt worden ist.\r\nIch hab mich dann durch den letzten gespielte Matches gemerkt das mein acc gehackt worden ist, weil meine letzten spiele nie und nimmer der U.R.F Modus war, aber zu erst hab ich das daran gemerkt das ich oft mal verschiedene Champs gespielt habe, die ich noch nie gespielt habe, meine letzten spiele waren mit Riven und Cho gath.\r\nIch hab auch gelesen das ich selbst verantwortlich bin auf meinen acc aufzupassen, aber kann man da jetzt noch was retten?\r\n\r\nMfg. KingChris15\r\nund Vielen Dank im Vorraus","replies":[{"poster":"AceLaughUpdate","date":"2018-01-15T15:56:30.565+0000","up_votes":2,"down_votes":0,"body":"Jemand hat  auf dein acc bestimmt bol, aimkek, goelites benutzt = bancode 9001 \nbzw dein acc wurde gehackt und wurde zu einem Cracked acc  zum leertasten drücken benutzt sprich du bist rip bekommst den acc nicht mehr wieder unlucky\nwenn du glück hast bekommst nen bann wegen ACC-Sicherheit musst du angeben was deine ersten champs waren und mit was du bezahlt hast","replies":[]},{"poster":"Megnok","date":"2018-01-14T10:07:00.032+0000","up_votes":2,"down_votes":0,"body":"Ich hatte das Problem vor ein paar Monaten auch. Allerdings war ich nicht begannt. Ich kam nicht in den Account rein und hab dann quasi von meinem Smurf aus zugesehen wie gespielt wurde -_- \n\nWenn der Bann wirklich nur deswegen ist und du dir ganz sicher bist dass du die daten nicht selbst weggegeben hast oder meinetwegen versucht hast RP von irgendwelchen Seiten zu bekommen oder sowas lohnt sich der Weg zum Support auf jeden Fall.\n\nDir wird dann ein dicker Fragenkatalog zugestellt den du beantworten musst um zu verifizieren dass das auch wirklich dein Account ist.\nSelbst wenn du da nicht alles zu 100 % beantworten kannst reicht es wohl wenn du ein paar wichtige Eckdaten im Kopf hast. Und ich denke die hat man. Hat bei mir jedenfalls wunderbar geklappt obwohl ich einiges gar nicht beantworten konnte. \nAber lass dem Support ein wenig Zeit, die antworten nicht unbedingt am gleichen Tag wenn viel zu tun ist. Also das Ticket nicht ständig aktualisieren oder so, einfach Geduld und Spucke. Wenigstens ist dein Account schon gebannt und somit auf Eis gelegt sodass dem erstmal nichts passieren kann :D","replies":[]},{"poster":"drexxsack","date":"2018-01-13T21:47:05.678+0000","up_votes":2,"down_votes":0,"body":"Melde dich bitte beim Support. Wenn noch was getan werden kann, dann nur über den Support.","replies":[{"poster":"KingChris4k","date":"2018-01-13T22:07:47.509+0000","up_votes":1,"down_votes":0,"body":"Ja das war mir schon bewusst, aber vielleicht gibt es ja welche die schon sowas miterlebt habe und mir gleich sagen können ob jetzt noch sinn macht dafür zu kämpfen den acc zurück zubekommen oder ob ich´s gleich aufgeben kann","replies":[{"poster":"eingew","date":"2018-01-14T08:23:54.300+0000","up_votes":2,"down_votes":1,"body":"Im Normalfall kriegst du deinen Account wieder. Vielleicht hilft dir auch [das hier](https://support.riotgames.com/hc/de/articles/201751694).","replies":[]}]}]},{"poster":"KingChris4k","date":"2018-01-21T16:03:09.198+0000","up_votes":1,"down_votes":0,"body":"Für alle die das selbe Problem haben und hier vielleicht auf ne Lösung hoffen oder wissen wollen wie es mit deren Acc weiter geht.\n\nMein Konto bleibt gesperrt, du bist für jede Aktivität deines Kontos selber verantwortlich, selbst wenn dich jemand gehackt hat und du selber dafür nix kannst.\nMeinem Acc wurde weger Scripts, Hacks, unbefugten Programmen Dritter oder des Ausnutzens unfairer Spielfehler permanent gebannt.","replies":[]},{"poster":"Man of Honor","date":"2018-01-15T20:55:36.395+0000","up_votes":1,"down_votes":0,"body":"Wo soll ich bei dir anfangen KingChris4k,oder doch wohl eher KingChris15?\n\nFangen wir doch bei deinem Matchverlauf an! Weisst du was recht auffällig ist?Du spielst seit Monaten immer nur an einem Tag im Monat LeagueofLegends und das ist der 8.eines Monats!\n\n15 Spiele am 8.7.2017\n12 Spiele am 8.8.2017\n  2 Spiele am 8.9.2017\n13 Spiele am 8.10.2017\n23 Spiele am 8.11.2017 (angebliche gespielt von einer dritten Person)\n\nWenn dein Account \"gehackt\"wurde,dann hat der \"Hacker\"deine Tradition jedenfalls fortgesetzt!\n\nDu behauptest weiterhin,dass du das letzte mal mit Riven und Cho´Gath gespielt hast,leider passt diese Aussage keinesfalls zu deinem Matchverlauf!\nDas letzte Cho´Gath Game war nämlich im U.R.F Modus und befindet sich inmitten der Spiele,die angeblich der \"Hacker\"bestritten haben soll.\nDu könntest dich natürlich auch auf das Cho´Gath Game vor 5 Monaten beziehen(8.9.2017),aber je weiter du in der Matchhistorie zurück blickst,desto unglaubwürdiger ist deine Aussage!\n\nWie warscheinlich ist es,dass jemand deinen Acc. hackt,um dann 1x pro Monat (über Monate hinweg) darauf zu spielen und das exakt an dem Tag,an dem du immer spielst?\n\nSoll ich das Rätsel lösen? Niemand hat deinen Account gehackt,du bist für deinen Bann selbst verantwortlich und du versuchst hier im Forum auf eine dreiste Art und Weise Aufmerksamkeit zu erhaschen.\n\nSchönen Tag noch KingChris15...ähm ich meine KingChris4k!","replies":[{"poster":"KingChris4k","date":"2018-01-19T18:02:38.479+0000","up_votes":1,"down_votes":0,"body":"Wenn du runterscrollst bis zum 5/6/2017 und dir dann kills/tode anschaust und weiter runter schaust, sieht man, das ich so ziemlich ein bob im game bin, klar es gibt vielleicht paar matches dabei wo gut gelaufen sind, aber die meisten Kills/tode sehen echt schlecht aus, ich versteh nicht warum ich dann nach 1,5 monate gleich ranked gespielt habe und 4-5 mal aufgestiegen bin, ich kann leider hier nix beweißen, aber ich hab es nicht nötig, dass mir ein anderer in lol hilft im ranked hochzukommen, im end-effekt wäre ich selber der dumme weil ich dann gold oder platin wäre, spiele aber schlechter als ein bronze spieler (ist auch der grund warum vor dem 8/7/2017 ziemlich selten ranked gespielt habe und dafür mehrer selber erstellte runden mit/gegen bots oder mit freunden normal matches)\n\nIch hab auch die letzten tagen in meiner mail geschaut ob ich da irgendwas bekommen habe weger nem hacker angegrifft oder der artiges, und bin tatsächlich draufgestoßen, dass sich einer aus Portugal und später aus der Türkei versucht hat sich in meine mail anzumelden, hab aber nix von league of legends gesehen, werde auf spam oder gelesene mails. Ich weiß nicht ob dir das beweiß genug wäre, aber ich bin aufjedenfall kein verräter... Wenn ich gespielt hätte und selbst mitbekommen hätte, dass ich nen bann kassiert habe weil ich toxic war oder so, wäre ich auch dazu gestanden, aber ich weiß ja nicht mal WARUM der acc nen bann hat","replies":[]}]}]}