{"poster":"Faust2470","date":"2018-01-08T21:39:39.990+0000","title":"Wie vor hackern schützen?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Der Account meines Freundes wurde vor 1-2 Monaten gehackt aber nach langem hin und her mit Riot hat er seinen Account vor einigen Tagen zur&uuml;ckbekommen.\r\nNun wurde sein Account schon wieder gehackt. Ich wei&szlig; nur dass seine E-Mail schon ein paar mal gehackt wurde und er hat die auch schon ge&auml;ndert aber anscheinend hat es nichts gebracht.\r\nWei&szlig; jemand was man da machen k&ouml;nnte?","replies":[{"poster":"Homunculi","date":"2018-01-09T07:45:00.749+0000","up_votes":2,"down_votes":0,"body":"Mögliche Maßnahmen zum sicheren Account:\n\n- Account und Beschwörer/Nickname dürfen nicht der gleiche/selbe sein\n- Das Passwort sollte 8 Zeichen lang sein, mit Groß- und Kleinbuchstaben sowie Zahlen und Sonderzeichen(ä, ö, ?, / als Beispiel)\n- Das Passwort sollte keinen direkten persönlichen Bezug auf die Person haben, wie etwa der Geburtstag\n- Man kann für seinen Account eine E-Mail Benachrichtigung einrichten lassen, aber wenn der E-Mail Account auch übernommen wurde, wahrscheinlich das gleiche Passwort, ist das wenig Sinnvoll\n- Keine Daten an dritte weitergeben, nichtmal der eigenen Mutter\n- Keine Links/Webseiten anklicken die eine \"Authentifizierung\" verlangen bzw. Accountname und Passwort, besonders nicht wenn sie mit Sperrung des Accounts drohen oder eine Rechnung/Strafzahlung in Aussicht stellen\n- Sollte es einem evtl. doch Spanisch/Chinesisch vorkommen, die meisten Anbieter haben einen telefonischen Kontakt den man am besten über die eigentliche Webseite aufruft und anruft  um Fragen zu stellen","replies":[]},{"poster":"hshtagniemehrcdu","date":"2018-01-08T21:48:34.751+0000","up_votes":3,"down_votes":1,"body":"uhm .... so ziemlich alle Fälle, wo ein Account \"gehackt\" wurde, waren solche, wo der User auf Pishing reingefallen ist, d.h. auf irgendeiner Website mit den Accountdaten eingeloggt, in der Hoffnung Free RP oder ähnlches zu bekommen.\n\nWenn deinem Freund das gleich zweimal passiert ist, würde ich erstmal erfragen, was genau denn die Ursache war - das riecht stark nach fahrlässigem Umgang mit eigenen Daten.","replies":[{"poster":"Faust2470","date":"2018-01-08T23:20:35.327+0000","up_votes":1,"down_votes":0,"body":"Er ist nie auf so einen Link o.ä. gegangen. Bevor er gehackt wurde (beide male) hat er ja ne weile schon nicht mehr gespielt. Sein Account bzw. seine E-Mail war einfach plötzlich gehackt.","replies":[]}]},{"poster":"Alustus","date":"2018-01-08T22:05:20.828+0000","up_votes":2,"down_votes":1,"body":"Sicheres Passwort am besten generieren lassen.\nBenutzername/Passwort niemanden erzählen.\nNichts downloaden anklicken wo du nicht weißt wo der Link hinführt.\n\nKeine Fragwürdigen Links wie Free RP, Free Elo Boosting, Get a skin if u share this link.\n\nDann ist dein Account so sicher, dass kein Hacker außer er hat ungehinderten zugriff auf deinen Rechner den Account klauen kann.\nMit einem Passwort cracker sitzt du bei einem 16 Stelligen generierten Passwort mit dem jetzigen Stand der Technik schon mal ein paar Tausend Jahre.\n\nBei so ziemlich allen Großen Hacks sind die Mitarbeiter/PC Anwender die Schwachstellen gewesen und für einen LoL Account wird sich niemand Stunden oder Tage Zeit  zum Hacken Pc Hacken nehmen.","replies":[{"poster":"Faust2470","date":"2018-01-08T23:57:58.417+0000","up_votes":1,"down_votes":0,"body":"Er ist nie auf so einen Link o.ä. gegangen. Bevor er gehackt wurde (beide male) hat er ja ne weile schon nicht mehr gespielt. Sein Account bzw. seine E-Mail war einfach plötzlich gehackt.","replies":[{"poster":"Alustus","date":"2018-01-09T01:01:16.381+0000","up_votes":2,"down_votes":1,"body":"Du glaubst also das der Hacker sowohl seine E-Mail als auch seinen LoL Account gehackt hat ohne das er irgenwo diese genannt bekommen hat?\n\nSowohl der Benutzername als auch das Passwort + das Herausfinden der E-mail + das dortige Passwort hacken ist ohne Massiven Sicherheitsverfehlungen oder Heruntergeladener  Spyware (durch öffnen dubioser Mails, Links) nicht\nohne Enormen Wissen+ massiven Zeitaufwand möglich ist.\n\nIch bezweifle das jemand der mit diesem Wissen/Können seine Zeit mit einem LoL Account verschwendet um bestenfalls 50€ zu verdienen, denn mit diesem wissen verdient er als Sicherheitsberater um einiges mehr in einer Stunde und das was hier getan wurde dauert um einiges länger als eine Stunde dauern.\n\nIch behaupte einmal das 90% die auf solche Seiten/Links geklickt haben behaupten das sie das nicht getan haben da es ihnen peinlich ist.","replies":[]},{"poster":"Nycaria","date":"2018-01-09T00:06:49.408+0000","up_votes":2,"down_votes":1,"body":"Und das weißt du woher? Sitzt du etwa die ganze Zeit neben ihm und guckst dir die Links an, welche er anklickt? ^^\nViele die auf solche Links gehen und dadurch ihre Accounts verlieren, wollen eben einfach ihre eigene, entschuldigt die Ausdrucksweise mir fällt nur nichts besseres dafür ein, Dummheit nicht zugeben.","replies":[]}]}]},{"poster":"Zoe OTP 2K18","date":"2018-01-09T12:25:10.311+0000","up_votes":1,"down_votes":0,"body":"Dann sollte er sich nicht auf free rp seiten einloggen :D","replies":[]},{"poster":"Sidia","date":"2018-01-09T08:06:19.412+0000","up_votes":1,"down_votes":0,"body":"Folgende Dinge sollte man tun:\n\n1. NIEMALS irgendwo deine Daten herausgeben, seien es Freunde, Familienmitglieder oder Leute die euch Belohnungen versprechen, nichtmal dem Riot Support\n2. Sicheres Passwort: 12-16 Zeichen, Zahlen, Groß- + Kleinbuchstaben, Sonderzeichen\n3. Kein Passwort auf zwei Plattformen gleichzeitig verwenden\n4. Computer Frei von Viren halten\n5. Lieber einmal zu viel Misstrauisch als nachher zu bereuen","replies":[]},{"poster":"SgtToffel","date":"2018-01-08T23:14:40.808+0000","up_votes":1,"down_votes":0,"body":"Experten raten zu einem Programm namens brain.exe\n\nHier ein Link: https://brain.yubb.de/","replies":[]},{"poster":"Miniphiri","date":"2018-01-08T23:13:29.212+0000","up_votes":1,"down_votes":1,"body":"wie wäre es mit? nicht auf seiten gehen wo dir gratis skins und co versprtochen wird und du nur dich mit deinem account einloggen musst. sry aber  wurde mit sicherheit NICHT gehackt sondern er seine daten weitergegeben aus, ich bitte um verzeihung für die folgenden Worte, dummheit. \n\ndie einzigen varianten warum das passiert ist: die sachen die oben stehen oder aber er ist immer auf zwielichtigen websites unterwegs und hat sich sonstwas auf seinem rechner eingefangen.","replies":[{"poster":"Faust2470","date":"2018-01-08T23:22:02.506+0000","up_votes":1,"down_votes":1,"body":"Er ist nie auf so einen Link o.ä. gegangen. Bevor er gehackt wurde (beide male) hat er ja ne weile schon nicht mehr gespielt. Sein Account bzw. seine E-Mail war einfach plötzlich gehackt.\n\nDen laptop, auf dem er spielt, benutzt er nur für LoL und Steam Spiele.","replies":[{"poster":"Miniphiri","date":"2018-01-09T01:54:21.444+0000","up_votes":1,"down_votes":1,"body":"ja sicher. als würde man sich die mühe machen , große datenbanken zu hacken nur um einen , nichts für ungut, nicht mal lcs oder sonstwas für kleinen Gamer zu hacken. Er hat definitiv irgendwo scheiße gebaut. Ob es nun auf einer phishing seite war oder ob er sich allgemein einen Keylogger eingefangen hat weil er auf ungesicherten webseiten unterwegs war ohne antivirenschutz is erstmal egal. \n\noder aber er hat ein viel zu leichtes passwort benutzt wie 123456 usw. Er sollte definitiv mal über das thema \"sicherheit m internet : wie stelle ich ein sicheres passwort zusammen\" informieren","replies":[]}]}]}]}