{"poster":"ProtomSpina","date":"2017-07-26T23:34:53.901+0000","title":"Quale sistema operativo scegliere? :(","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Ciao ragazzi!\r\nDa poco ho aggiornato il mio PC da Windows 8.1 pro a Windows 10 pro e ho provato subito una partita nell&#039;allenamento per testare gli fps.\r\nSfortunatamente a inizio game avevo 03 fps a inizio game e 01 fps appena sono spawnati i minions.\r\nHo provato a fare pulizia del PC ma niente da fare e perci&ograve; stavo pensando di cambiare sistema operativo.\r\nPerci&ograve; chiedo a voi, che siete pi&ugrave; informati di me, se potete dirmi quale sistema va meglio per il mio PC.\r\nEcco i vari dati del mio PC:\r\n\r\nProcessore: AMD E1-6015 APU with Radeon(TM) R2\r\n                    Graphics                           1,40 GHz  \r\nRAM installata: 4,00 GB\r\nSistema: Sistema operativo a 64 bit\r\nProduttore: Hewlett-Packard (HP)\r\n\r\nGrazie in anticipo a chiunque mi dia una mano e a presto! :)\r\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"ILoveTiramisu","date":"2017-07-27T09:11:37.798+0000","up_votes":1,"down_votes":0,"body":"Stesso problema. Il mio penso centri anche con la temperatura del pc, si scalda piu del solito e rallenta le prestazioni quando è molto caldo. Sto pensando di comprarmi una ventola ausiliaria.","replies":[]},{"poster":"Floppyz","date":"2017-07-27T06:49:49.346+0000","up_votes":1,"down_votes":0,"body":"Non ti complicare la vita e tieniti Windows 10.","replies":[]},{"poster":"Financial Issues","date":"2017-07-27T01:00:05.556+0000","up_votes":1,"down_votes":0,"body":"In teoria Windows 10 dovrebbe essere leggermente più leggero rispetto a Windows 8 e 7, quindi tra le tre versioni consiglierei la prima. Mi raccomando, esegui un'installazione pulita del sistema operativo: aggiornare da versioni precedenti di Windows porta sempre ad un sacco di problemi.\n\nDetto questo, purtroppo il PC è davvero pessimo. Posso darti qualche consiglio per raccattare qualche fotogramma in più qua e là, ma non aspettarti miracoli.\n\n* Ovviamente in gioco tutto al minimo. Non dimenticarti di abilitare l'opzione \"Hide eye candy\" e di disabilitare \"Character inking\", \"V-sync\" e \"Anti-aliasing\". Ah, e gioca in Fullscreen, non in finestra.\nSu PvP.net abilita invece le opzioni [\"Enable low spec mode\" e \"Close client during game\"](http://i.imgur.com/i6ZYGJJ.jpg).\nIn teoria è possibile guadagnare mezzo fotogramma disabilitando completamente l'audio, ma vedi un po' tu se te la senti di giocare in modalità sordomuto.\n\n\n* In Windows, vai in \"Opzioni prestazioni\" e seleziona \"[Regola in modo da ottenere le prestazioni migliori](http://i.imgur.com/1sjcNmT.jpg)\".\n\n\n* Sempre su Windows, ma solo nel caso tu decida di installare Windows 10, vai in Impostazioni→ Gaming e disattiva sia Game Bar che Game Mode.","replies":[]},{"poster":"Nabbomaster","date":"2017-07-27T00:24:42.793+0000","up_votes":1,"down_votes":0,"body":"aggiornato i drivers?","replies":[]}]}