{"poster":"Bienzahar","date":"2017-12-15T02:11:57.325+0000","title":"Se fediaste como un cochino al menos ten la decencia de votar que si al surrender xD","subforum":"Charlas Generales","up_votes":82,"down_votes":14,"body":"Si la manqueaste como un cochino y fedeaste, al menos ten la decencia de votar que si al surrender para que tus compa&ntilde;eros que no fedearon y jugaron bien puedan irse tranquilos.","replies":[{"poster":"MasterRightClick","date":"2017-12-15T02:24:04.367+0000","up_votes":52,"down_votes":5,"body":"Espera que van a saltar los únicos y especiales a decirte \"yo no me rindo hasta que el nexo este caido\" cuando le sacan 50k de oro 3 drakes 1 baron todas las torres y 30 kills","replies":[{"poster":"Tortuguita","date":"2017-12-15T04:53:36.654+0000","up_votes":23,"down_votes":2,"body":"Demasiadas películas de heroes y superación se ven , es lamentable.","replies":[{"poster":"Nuke","date":"2017-12-15T19:52:50.690+0000","up_votes":6,"down_votes":14,"body":"No es por parecer heróicos, es simplemente porque (Y te lo dice un feeder con todas las letras que el 95% de las veces no se rinde) me divierte. \nOsea, yo entro a Normales para divertirme, y mientras mas dure la diversión mejor asi que bueno.\nPero si fuera por cuestiones de querer ganar, aun asi no votaría que si, justamente, si quiero ganar (Jugar enserio), va a ser ranked asi que no voy a jugarme los LP que puede pasar cosas de lo mas inesperadas. \n\n¿O me están diciendo que ustedes juegan para ganar en Normales? xDDD\n\nEste soy yo en Normales:\nhttps://i.gyazo.com/abd14fcf24cd5a4a82bd3091aac12e37.png\n\nY este soy yo en ranked:\nhttps://i.gyazo.com/f8ae9b11c6b4ce35674c7528b2511ac5.png\n\n¡Saludos! {{champion:33}} ","replies":[{"poster":"El Nabu","date":"2017-12-16T00:09:24.500+0000","up_votes":5,"down_votes":3,"body":"\"Mirenme, cago a downvotes a un tipo que no tryhardea en normales porque yo no soy una ratita tóxica que siempre hace lo mejor por limpiar el server. Soy tan maduro. Rito plz, baneen a esta gente.\"\n\nhttp://lh3.googleusercontent.com/2NfvXFyfI-W-OIfrUzy_iiDNclQeYHV_x3JtQdA8nvDaVV_w0lLMlb5i9KeJd-U33f90NCY2AgLO7WM9Ulmg5Q=s240","replies":[{"poster":"Nuke","date":"2017-12-16T00:22:43.108+0000","up_votes":4,"down_votes":4,"body":"No me dan downvotes por el comentario y el tema/mi opinión, me los dan porque si, sin razón. Osea, mas madurez imposible v:\nCon la actitud de varios responsables de mis downvotes es como: Boludímetro excediendo los niveles seguros, por favor apague el emisor de boludeces (?\n\nAgradezco a aquellos que usan el sistema de votos de forma honesta, y no por eso digo que me den +1 todo el rato. Solo que tengan una razón en contexto para darme el voto que dan.","replies":[{"poster":"El Nabu","date":"2017-12-16T05:15:56.741+0000","up_votes":3,"down_votes":1,"body":"Te lo daban por no surrendear las normales. Igual muchos se pueden poner molestos por no surrendear rankeds, pero ahí es para ganar. Si se puede ganar no hay que surrendear y si no, bueno, tampoco es que iba a durar mucho más la partida. A mi también me molesta que no quieran surrendear en las normales si está muy perdida, pero hay mucha gente que quiere surrendear al primer error y tampoco es que no podés divertirte intentado cosas bizarras.","replies":[{"poster":"Nuke","date":"2017-12-16T15:55:57.093+0000","up_votes":1,"down_votes":0,"body":"Yo algunas veces que estoy con premades surrendeamos cuando estamos en el nexo xD","replies":[]}]}]}]},{"poster":"Tortuguita","date":"2017-12-16T11:35:10.841+0000","up_votes":2,"down_votes":0,"body":"Pero tampoco para perder el tiempo , quiero jugar una normal y ver que va estar \"Peleado\" si es una stompeada de los dioses es como que pierde la gracia , no me molesta pero pierde la gracia xD","replies":[{"poster":"Nuke","date":"2017-12-16T15:57:36.474+0000","up_votes":2,"down_votes":2,"body":"No, yo no pierdo el tiempo. Es divertido, eso hace que todo valga la pena xD.\nSi no te molesta pues no hay problema :D","replies":[]}]}]}]},{"poster":"LemønPykë","date":"2017-12-15T12:20:54.618+0000","up_votes":11,"down_votes":1,"body":"> [{quoted}](name=MasterRightClick,realm=LAS,application-id=v7qsfXsE,discussion-id=a1pxTQag,comment-id=0000,timestamp=2017-12-15T02:24:04.367+0000)\n>\n> Espera que van a saltar los únicos y especiales a decirte &quot;yo no me rindo hasta que el nexo este caido&quot; cuando le sacan 50k de oro 3 drakes 1 baron todas las torres y 30 kills\n\nLo peor de todo es que hasta en una putisima normal se hacen las estrellas","replies":[]},{"poster":"WhiteMax","date":"2017-12-15T02:26:26.271+0000","up_votes":3,"down_votes":1,"body":"\"gg wp\".","replies":[]},{"poster":"ZanahoriaAsesina","date":"2017-12-15T02:30:45.974+0000","up_votes":4,"down_votes":2,"body":"Ni terco, jajaj.","replies":[]},{"poster":"xThreeh","date":"2017-12-15T19:25:26.792+0000","up_votes":4,"down_votes":3,"body":"claro te pueden sacar 50k de oro 3 drakes y 1 baron, pero cuando van más de 40 minutos de partida cualqueira de los dos puede ganar, sólo basta que tú y tu equipo jueguen mejor una tf para dar vuelta la partida, yo no he visto a skt rendirse aunque vayan muy mal, cada quien con su forma de jugar, al menos la mía es dar todo para llevar a tu equipo a la victoria, saludos! :) enjoy\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"MasterRightClick","date":"2017-12-15T21:38:01.050+0000","up_votes":1,"down_votes":0,"body":"Estas hablando de full late. El meta es de early y la gran mayoria de partidas que se juegan en todos los servidores no pasan los 30 minutos. Al min 10 ya se sabe que equipo tiene tendencia a snowbollear. \n\nEn el comentario hacemos referencia a los pibes que no surrendean en early (el meta) cuando hay una gran ventaja y que nada de lo que haga el team hará que se revierta la situacion\n\nPor lo tanto, es una perdida de tiempo y de paciencia jugar partidas perdidas o en la 4 jugadores votan que si y que solo un infeliz (no lo puedo nombrar de otra forma, disculpas, pero esa es la palabra y definicion exacta) pone que no solo para joder a los demas","replies":[{"poster":"El Nabu","date":"2017-12-16T05:19:20.200+0000","up_votes":1,"down_votes":1,"body":"\\> Meta de early game\n\\> No saber cerrar partidas\n\\> Late game\n\\> Ganar una tf porque uno la cagó\n\\> Ganar la partida haciendo (casi) todo mal","replies":[{"poster":"MasterRightClick","date":"2017-12-16T05:49:02.062+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=El Nabu,realm=LAS,application-id=v7qsfXsE,discussion-id=a1pxTQag,comment-id=0000000700000000,timestamp=2017-12-16T05:19:20.200+0000)\n>\n> \\&gt; Meta de early game\n> \\&gt; No saber cerrar partidas\n> \\&gt; Late game\n> \\&gt; Ganar una tf porque uno la cagó\n> \\&gt; Ganar la partida haciendo (casi) todo mal\n\nPor eso se llama \"meta\" porque es muy poco probable que pase eso. \n1- porque hay snowball\n2- porque deberia pasar el muy poco probable hipotetico caso que no la sepan cerrar (cosa que en elos mas altos o medios ya se sabe hacer)\n3- porque deberian recuperarse lo suficiente para poder tener chances al menos de pelear una tf\n4- aun asi llegar a full late es 50 y 50 % de chances que alguno la cague\n5- hay mas chances que la gane el otro team debido a los drakes que consiguieron en early \n\n6- no renta mucho comerse todo el tilteo interno solo por una partida que se puede terminar al 15 o al 20 en un meta asi","replies":[]}]}]}]},{"poster":"Eckerdt","date":"2017-12-15T19:21:46.586+0000","up_votes":2,"down_votes":1,"body":"Eso se remonta con un solo error del equipo rival.","replies":[]},{"poster":"Holox1","date":"2017-12-15T18:59:15.576+0000","up_votes":1,"down_votes":5,"body":"Creo que todos tuvimos partidas en las que remontamos situaciones asi. Yo me niego a surrendear, sea yo el que haya feedeado o alguien de mi equipo, siempre pongo que no (al menos que este con un premade completo y todos queramos hacerlo, es una situacion distinta).\n\nSiempre se puede ganar una partida sin importar que.\n\nAdemas siempre se puede caer el server jaja salu2.","replies":[{"poster":"kira4000","date":"2017-12-15T21:31:37.070+0000","up_votes":1,"down_votes":0,"body":"como ahora xd","replies":[]}]}]},{"poster":"Kłaytøn","date":"2017-12-15T14:27:59.210+0000","up_votes":18,"down_votes":1,"body":"Igual tampoco nunca falta el manco que considera rendirse cuando todavía la partida no esta perdida y esa actitud justamente es la que hace que la partida se termine perdiendo, empiezan a jugar como no se debe, feedear y demás porque total para ellos \"ya esta perdida\", gente que piensa que la partida solo se basa en ellos y no se dejan carrear.","replies":[{"poster":"Iluon","date":"2017-12-15T22:16:03.451+0000","up_votes":3,"down_votes":1,"body":"No lo se... yo algunas veces tiro surrender sabiendo q la puedo ganar porq simplemente quiero dejar de jugar con mi equipo, es como un grtio de \"saquenme de aca\"; como cuando estas intentando carrear pero tu equipo se empieza a suicidar","replies":[{"poster":"Iluon","date":"2017-12-15T22:17:03.642+0000","up_votes":1,"down_votes":0,"body":"estoy hablando de normales btw","replies":[]}]},{"poster":"Surume91","date":"2017-12-15T20:28:28.319+0000","up_votes":2,"down_votes":1,"body":"Estoy completamente de acuerdo. Mas encimas empiezan a abusar del Surrender, se supone que las partidas se deben jugar hasta el final. Nunca falta los malos perdedores","replies":[]},{"poster":"El Nabu","date":"2017-12-16T00:16:41.584+0000","up_votes":1,"down_votes":0,"body":"Hay muchas más partidas que se pierden porque no hay nadie que haga eso. Todos juegan positivamente y no se esfuerzan por cerrar el game, entonces empiezan a hacer throws. Si hay alguien que la quiere cagar los otros 4 que van ahead cierran el game aprovechando que van a buscar al que va solo y tiene 2 items menos.","replies":[]}]},{"poster":"Akalimaster","date":"2017-12-15T11:22:33.022+0000","up_votes":16,"down_votes":1,"body":"{{champion:78}}  ''¿Te confieso algo? nunca me rindo.'' 0/12/3 30 cs min 30","replies":[]},{"poster":"Arondight","date":"2017-12-15T18:17:34.644+0000","up_votes":12,"down_votes":0,"body":"Estoy de acuerdo... muchas veces hay que saber cuando ceder. Dejar las cosas por la buenas.\n\nAhora, si saben quien mierda dijo que no, que diga como se gana la mierda sino juegue sólo. Si no contesta eso, me quedo en base mientras hierve el agua para el té.","replies":[{"poster":"Bienzahar","date":"2017-12-15T18:35:14.939+0000","up_votes":5,"down_votes":0,"body":"Este es de los míos xD","replies":[]}]},{"poster":"Diosmo","date":"2017-12-15T05:27:34.650+0000","up_votes":10,"down_votes":2,"body":"Parece regla de LAS (al menos) que los que mas feedean son los mas rapidos en poner que no al surrender cosa de alargar mas la derrota inevitable.\n\"Jamassss me rindo\" 0/10/2","replies":[]},{"poster":"Paaizer","date":"2017-12-15T02:34:02.162+0000","up_votes":6,"down_votes":1,"body":"Bueno, eso es cierto. Muy molesto cuando no hay la mas minima chance de ganar y ponen no. \nPeor cuando son duo... nunca podes salir, estas encerrado con ellos hasta que decidan tirar ff... y otras veces es todo lo contrario, tal vez tiran surrender cuando es ganable un game.\nEstaria bueno que cuando los duos votan, sea los dos 1 solo voto, onda 1/2, 2/2 de voto para que no te tengan de rehen.","replies":[{"poster":"ICrookShanks","date":"2017-12-16T00:41:13.288+0000","up_votes":1,"down_votes":0,"body":"son premade ambo van mal y encima se defienden entre ellos","replies":[]}]},{"poster":"Marx we need you","date":"2017-12-15T15:23:04.638+0000","up_votes":4,"down_votes":0,"body":"Pienso que depende mucho de la situación, por ejemplo si tienes un team de late, tipo jax, vayne, yi o cosas así, contra un equipo que tiene principalmente personajes de early, por más que te estén stompeando al principio, siempre se puede ganar si es que aguantas lo suficiente. Ahora es un tema de composición, hay veces en donde uno del team contrario se va afk y la gana tu equipo, pero estoy de acuerdo en que hay partidas irremontables.","replies":[]},{"poster":"ElDadorDeCacha","date":"2017-12-16T13:58:41.699+0000","up_votes":4,"down_votes":1,"body":"Las únicas conclusiones que saco de los comentarios es que: gran parte de la gente solo sabe jugar y ganar con el factor suerte de por medio, apostándolo todo a peleas full late donde no importa que tanto la hayas cagado puedes ganar tirando monedas al aire; a la gente le divierte morir porque si y poner a prueba a sus compañeros; abusan del cliché de \"jugar hasta el final\", o \"todo puede pasar en una partida\", \"es un juego, así me divierto\", para excusarse de morir consecutivamente sin ninguna lógica y perder el tiempo a posta.","replies":[]},{"poster":"gastritis","date":"2017-12-15T20:46:03.765+0000","up_votes":2,"down_votes":0,"body":"me pasa muy seguido :,v","replies":[]},{"poster":"payasojudio","date":"2017-12-15T09:08:31.595+0000","up_votes":8,"down_votes":21,"body":"Yo nunca me rindo porque siempre creo que se puede ganar y cuando tiran surrender siempre preguntan \"quien fue el que puso que no?\" y yo me hago el loco.{{item:3348}} {{item:3348}} \nEs que aveces tambien es la actitud la que hace ganar. si alguien tira surrender todo el rato moralmente, desmotiva, y crea como un ambiente de \"esto ya se perdio\" he visto partida donde vamos muy mal, y el solo hecho de no tirar surrenders o decir comentarios negativos hace que se de vuelta.","replies":[{"poster":"Tsume Asterisk","date":"2017-12-15T17:40:35.218+0000","up_votes":2,"down_votes":7,"body":"wtf? ¿Porque te volaron a negativos si tienes toda la razón? .___.","replies":[{"poster":"MasterRightClick","date":"2017-12-15T21:41:34.876+0000","up_votes":2,"down_votes":1,"body":"Porque no tiene nada de razon. Es unranked, es su primera season. Todos al principio eramos asi, porque se podian dar vuelta las partidas porque cada uno juega con la nariz y los codos.\n\nDespues de avanzar divisiones y subir elo las partidas empiezan cada vez menos a ser remontables. Menos en un meta de full early en la que predomina el snowball","replies":[{"poster":"Tsume Asterisk","date":"2017-12-16T13:20:14.630+0000","up_votes":2,"down_votes":1,"body":"Ah, bueno, que todos son diamantes en el foro para hablar con tanta seguridad. (Recordemos además que Diamante V es el segundo elo hell)\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"MasterRightClick","date":"2017-12-16T14:17:11.340+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tsume Asterisk,realm=LAS,application-id=v7qsfXsE,discussion-id=a1pxTQag,comment-id=0006000200020000,timestamp=2017-12-16T13:20:14.630+0000)\n>\n> Ah, bueno, que todos son diamantes en el foro para hablar con tanta seguridad. (Recordemos además que Diamante V es el segundo elo hell)\n> {{sticker:zombie-brand-facepalm}}\n\nNo es tampoco ningun elo hell... cualquiera llega a diamante con solo jugar partidas. Pero aun asi, en diamante 5 ya saben cerrar partidas.\n\nLo cuenten como lo cuenten a veces es indefendible lo de que un infeliz le ponga que no al surrender cuando una partida esta muy probablemente perdida. Es una perdida de tiempo","replies":[{"poster":"Tsume Asterisk","date":"2017-12-17T17:32:51.453+0000","up_votes":1,"down_votes":0,"body":"¿Y cuando dijo \"partida perdida\"? Habló de malas partidas, donde se está en desventaja, pero no está por hecho perdida. Si quedaste en desventaja y das por hecho que está perdida OBVIAMENTE que está perdida, porque ya perdiste tu resolución para ganar.","replies":[]}]}]}]},{"poster":"PrincesaPingüino","date":"2017-12-15T21:12:33.986+0000","up_votes":3,"down_votes":0,"body":"Porque no la tiene.","replies":[]}]}]},{"poster":"Chimmyillegirl","date":"2017-12-16T05:35:09.487+0000","up_votes":2,"down_votes":1,"body":"A mi me gusta no aceptar el FF cuando pasan flameando.\n{{sticker:sg-miss-fortune}}","replies":[]},{"poster":"Nuke","date":"2017-12-15T19:50:56.062+0000","up_votes":1,"down_votes":11,"body":"Ni en pedo jajaja.\nSon Normales que se la banquen xD.\n\nSi quieren jugar enserio vallan a ranked vieja.","replies":[{"poster":"IvVicious","date":"2017-12-15T21:31:07.666+0000","up_votes":4,"down_votes":1,"body":"Al contrario, si querés tryhardear andá a ranked.\nLas normales son para divertirse, no para fumarse una hora de partida con 10K de oro de diferencia porque no se quieren rendir.","replies":[{"poster":"Nuke","date":"2017-12-15T22:17:32.493+0000","up_votes":2,"down_votes":5,"body":"> Las normales son para divertirse, no para fumarse una hora de partida con 10K de oro de diferencia porque no se quieren rendir.\n\nSi tenés esa mentalidad, no parece que las Normales sean para divertirte xD.\n\nRanked = Serio\nNormales = No importa nada, está para divertirse xD","replies":[{"poster":"Liliths","date":"2017-12-15T22:25:56.566+0000","up_votes":1,"down_votes":2,"body":"Cuando no Nuke...","replies":[{"poster":"Nuke","date":"2017-12-15T22:53:53.697+0000","up_votes":2,"down_votes":2,"body":"Cuándo no Liliths...","replies":[{"poster":"Liliths","date":"2017-12-15T23:02:28.766+0000","up_votes":2,"down_votes":1,"body":"Anda a feedear. Seguro es muy divertido.","replies":[{"poster":"Nuke","date":"2017-12-15T23:31:35.660+0000","up_votes":2,"down_votes":2,"body":"Acabo de \"ir a feedear\", si fue re divertido xD\n\nhttps://i.gyazo.com/0e17d8d562c43fe974eb0685cab3a80c.png","replies":[{"poster":"Liliths","date":"2017-12-16T03:42:16.950+0000","up_votes":2,"down_votes":1,"body":"Cántaselo a quien le interese.","replies":[{"poster":"Nuke","date":"2017-12-16T16:00:43.472+0000","up_votes":1,"down_votes":1,"body":"When te humillan asi que vas por la salida del \"callate\", \"a quién le interesa\", \"jajaja\", o su hermano gemelo, \"¿Y?\" xDDDDDDD\n\nTengo mas si querés, me gusta mucho este tema de feedear, es re divertido:\n\nhttps://i.gyazo.com/11f1ccca2dd4421bbe7f387e522cf059.png\n\n¡Saludos!\n\nPD:  En la partida de Galio mi hermano se hace un penta, pero es rey poro xd","replies":[]}]}]}]}]}]}]}]}]}]}