{"poster":"Bienzahar","date":"2018-01-02T16:00:34.486+0000","title":"Entonces, hemos estado con el programa de Voluntarios hace más de un año y qué se ha logrado?","subforum":"Charlas Generales","up_votes":13,"down_votes":7,"body":"Muchos desaparecieron despu&eacute;s de que los llevaran a la final de la CLS y otros est&aacute;n pero realmente no representan una ayuda adicional.\nSe supon&iacute;a tendr&iacute;amos un resumen de lo que han hecho y los avances del programa, ya es 2018 y tenemos un a&ntilde;o y 3 meses desde que se implemento.\n\nEDIT: Se hace difícil no compararlos con otro grupo que están organizados y ejecutando eventos con la comunidad y que llevan menos tiempo.\nEDIT2: No es que yo espere algo o que no haya entendido el programa, fue un rioter quien me explico que se esperaban cosas cuantificables y que habria, quisas, un resumen a un año del programa.\nhttps://boards.las.leagueoflegends.com/es/c/charlas-generales/IFXrhOB0-gracias-a-la-comunidad-gracias-riot?comment=000e0001000000000000","replies":[{"poster":"Calihea","date":"2018-01-02T17:00:51.743+0000","up_votes":11,"down_votes":2,"body":"Más allá de si veo o no a los voluntarios de color (no participo mucho del foro pero si lo leo bastante), mi pregunta es: cuál es la intención de hacer aportes a la comunidad?\n\nSe pueden hacer aportes a la comunidad y funcionar como voluntario sin tener color verde, o amarillo o lo que sea. Naturalmente la comunidad va a reconocer más el trabajo del que aporta con frecuencia, que del que aporta una vez cada tanto, indistinto del color del nombre. \n\nAl final parece más una queja por falta de reconocimiento que una búsqueda genuina de ayudar o aportar a la comunidad, en mi opinión.","replies":[{"poster":"Bienzahar","date":"2018-01-02T20:05:17.528+0000","up_votes":3,"down_votes":2,"body":"Creo que me equivoque en no poner el siguiente link.\nhttps://boards.las.leagueoflegends.com/es/c/charlas-generales/IFXrhOB0-gracias-a-la-comunidad-gracias-riot?comment=000e0001000000000000\nRecomiendo leer la conversación completa.","replies":[]}]},{"poster":"Tomas3D","date":"2018-01-02T16:37:35.226+0000","up_votes":5,"down_votes":2,"body":"El problema esta en la gente que frecuenta el foro,uno hace un post detallado de una problematica del juego para abrir un debate de como solucionarlo y nadie le da bola,es mas te llenan de negativos,haces un guia detallada de como usar un campeon a la perfeccion?lo ignoran completamente,es mas si no les gusta el champ negativo tambien,los verdaderos aportes son ignorados o rechazados.Despues aparece un boludo poniendo un meme que saco de google y se pone en populares lo comentan todos, ah pero para quejarse de los trolls/flamers estan todos.\n\nRealmente hay poca gente que se interese por el juego,fijate la mayoria de los post son pelotudeces que ni siquiera tendrian que estar en el foro te doy ejemplos? los memes,las gente que quiere jugar juegos de steam(o cualquier otro) que se vaya a steam a buscar amigos este es el foro de LOL,etc.\n\nLa comunidad de los foros es 40% gente que vale la pena y aporta y el otro 60% son personas que viven publicando boludeces y tienen multi cuentas.","replies":[{"poster":"Salvor","date":"2018-01-02T16:48:39.339+0000","up_votes":6,"down_votes":2,"body":"> detallado de una problemática del juego para abrir un debate de como solucionarlo y nadie le da bola,es mas te llenan de negativos,haces un guía detallada de como usar un campeón a la perfección?lo ignoran completamente,es mas si no les gusta el champ negativo también,los verdaderos aportes son ignorados o rechazados\n\nTriste pero cierto.\nYo creo que se necesita un nuevo foro (como el de Br pero mejor) que le de un nuevo aire al mismo, que atraiga nueva gente y de paso, mejore ciertos aspectos que permitan una mejor experiencia del mismo. (Por ejemplo una aplicación para hacer mas amigable su uso desde el móvil)\n\nSaludos!","replies":[{"poster":"rokushoger","date":"2018-01-02T17:12:00.829+0000","up_votes":2,"down_votes":1,"body":"+1 al foro para cel!","replies":[]},{"poster":"Tomas3D","date":"2018-01-02T16:57:13.883+0000","up_votes":1,"down_votes":0,"body":"Tal como salio \"amigos de lol\",estaria bueno un \"foros de lol\" para celular,muy buena idea man.","replies":[{"poster":"Salvor","date":"2018-01-02T17:07:27.492+0000","up_votes":2,"down_votes":2,"body":"Se viene pidiendo hace rato.","replies":[]}]}]},{"poster":"Corchito","date":"2018-01-02T18:18:44.788+0000","up_votes":3,"down_votes":1,"body":"Ustedes son los que eligen como comunidad que es lo que valoran.","replies":[]},{"poster":"rokushoger","date":"2018-01-02T17:11:24.643+0000","up_votes":2,"down_votes":1,"body":"Sep, muchas veces me pierdo publicaciones interesantes que quedan sepultadas por crypost y cosas del estilo que no aportan en nada. Sobre todo cuando hay algún problema con el server la gente entra y postea, nada de ver si hay un tema ni nada así, entra y lo hace y ajo y agua si sepulta post buenos.\n\nSuerte que ahora existe la revista forera que algún tema rescata a veces que no vi y puedo leerlo.","replies":[{"poster":"Ks Erwyn","date":"2018-01-02T17:20:16.184+0000","up_votes":2,"down_votes":1,"body":"Es algo que el foro a Br ha mejorado con su nuevo formato, acá siendo LAS quien sabe cuanto deberemos esperar...","replies":[{"poster":"rokushoger","date":"2018-01-02T17:36:39.324+0000","up_votes":1,"down_votes":0,"body":"Creo que nunca entré al foro de BR, que tiene de diferente?","replies":[{"poster":"Ks Erwyn","date":"2018-01-02T17:47:04.833+0000","up_votes":1,"down_votes":0,"body":"Una navegación mas sencilla, los post que son tendencia se mantienen mas activos y no son opacados por crap,tmb hay mejores sub-foros, lo único que no me gusta es el ranking de foreros que se prestaría a malas practicas....","replies":[{"poster":"Tortuguita","date":"2018-01-02T18:00:21.846+0000","up_votes":2,"down_votes":1,"body":"Dependerá de la madurez del foro , un ranking puede aportar (dar ese sentimiento de superarse día a día) como no hacerlo (rivalidades , competencia toxica o simple búsqueda de fama). Dependerá , como dije antes , de la madurez de los participantes.\n\nPD: Nunca fui a BR , así que tu me dirás y me reventaras esta suposición mía jajaj xD","replies":[{"poster":"Ks Erwyn","date":"2018-01-02T18:05:53.338+0000","up_votes":1,"down_votes":0,"body":"es que es justamente de lo que siempre han carecido los foros, madurez(irónico que yo lo diga XD) , un ranking de foreros cuyo única motivación de postear es por que hay un ranking...mmmmmmmmh","replies":[]}]},{"poster":"rokushoger","date":"2018-01-02T17:56:03.957+0000","up_votes":1,"down_votes":0,"body":"Sep, opino lo mismo con el ranking, y te lo digo así sin verlo. \n\n> los post que son tendencia se mantienen mas activos\n\nAmaría ver esto!","replies":[]}]}]}]}]},{"poster":"Deigex","date":"2018-01-02T18:14:36.432+0000","up_votes":2,"down_votes":3,"body":"Desde mi punto de vista el que viene a plantear o preguntar algo en el foro, salvo que quiera contar algo que le paso o experiencia personal dentro del juego es alguien que no sabe usar google porque realmente toda pregunta o duda que le pueda surgir a cualquiera tiene su respuesta ahi y en reddit.\n\nYo uso el foro para entretenerme y prefiero mil veces leer un chiste o responder a los post de gente que no entiende lo que esta planteando que leerme una guia detallada que no me interesa porque A: no uso el champion o B: la guia al hizo un low elo y si quiero aprender un campeón me busco a los mejores con dicho campeón no a un random en el foro. Hay temas dentro del juego que cierta gente aunque lo haga sin mala intencion no puede hacer porque literalmente no sabe mucho del juego y lo van a llenar de negativos \n\nLo que para vos es una problemática y requiere debate dentro del foro tal vez para otra persona no es un problema y no requiere análisis, no todos tienen que buscar lo mismo dentro de un foro.","replies":[]}]},{"poster":"Salvor","date":"2018-01-02T16:41:21.418+0000","up_votes":6,"down_votes":2,"body":"[POST](https://boards.las.leagueoflegends.com/es/c/charlas-generales/W6FprJAe-info-nuevos-colores-para-los-nombres-en-el-foro-avoluntarios-soporte-y-moderadores)\n\n> **¿Qué puedo exigir a un voluntario?**\n> Son un jugador/a más, y no tienen ninguna obligación de nada. No reciben remuneración, RP, skins ni otros privilegios excepto su nombre en otro color y acceso a la misma información que los demás jugadores pero más fluido. Sí, puedes decirle que no te gusta el amarillo, así lo atormentas un poco ;-)\n\n-\n\n> **¿Entonces de qué sirven?**\n> Dejamos a cada Voluntari@ decidir cómo ser de utilidad. Al observarlos verán distintos estilos y áreas de conocimiento.\n\n\nhttps://i.gyazo.com/6583d24a0c19437f0592464b32a3df0e.png","replies":[]},{"poster":"SKT T1 Bank","date":"2018-01-02T16:14:54.907+0000","up_votes":5,"down_votes":12,"body":"***","replies":[{"poster":"Ks Erwyn","date":"2018-01-02T16:54:33.041+0000","up_votes":7,"down_votes":0,"body":"Pero una buena parte de ellos si ayudaban al foro o lo enriquecían, tras el programa por así decirlo algunos(no todos) se arruinaron a ellos mismos, unos se jactaron de su posición, otros literalmente abusaron de ella y otros siguieron haciendo lo mismo que hicieron siempre...","replies":[]}]},{"poster":"rokushoger","date":"2018-01-02T17:10:01.073+0000","up_votes":8,"down_votes":5,"body":"Creo que esto lo hablé contigo por privado, pero por las dudas lo dejo acá. La gente espera de los voluntarios cosas que no son la finalidad del programa.\n\nEn realidad, la finalidad de tener un nombre en amarillo es decirle al que lea la respuesta que la información que te dan procede de una fuente que es confiable, y nada más.\n\nLa otra parte de la propuesta es darnos a los voluntarios una forma de hablar con Riot para que podamos traer información más certera que la que conseguíamos nosotros por la nuestra.\n\nLa última parte es darnos una forma de comunicarnos entre nosotros. Así por ejemplo a mi que me gusta el lore a veces puedo ayudar a otro a responder una duda, o si voy a contestar algo del PBE le puedo preguntar a Alex sin esperar a que el mismo tenga que pasar por el foro.\n\nA su vez, cuando vemos temas preocupantes o muy importantes podemos dar aviso a algún rioter para que estén alerta, o solucionen, o contesten, y esto es una función que no es del programa, simplemente yo me tomo esa atribución, porque en el fondo es lo que puso salvor, somos voluntarios, cada quien hace lo que le parece un aporte, cuando puede y cuando quiere.\n\nEl hecho radica en que hay gente que se hace ideas equivocadas o más expectativas de lo que en realidad es. Como quien dice, le dieron mucho \"color\" al asunto (y me perdonas la ironía XD).","replies":[{"poster":"Bienzahar","date":"2018-01-02T20:06:18.964+0000","up_votes":4,"down_votes":2,"body":"No es algo que yo esperase, mi error fue no haber puesto el siguiente link https://boards.las.leagueoflegends.com/es/c/charlas-generales/IFXrhOB0-gracias-a-la-comunidad-gracias-riot?comment=000e0001000000000000\nDonde se ve que si se esperan cosas del programa y donde se habla de un resumen anual.","replies":[{"poster":"rokushoger","date":"2018-01-02T22:23:50.871+0000","up_votes":3,"down_votes":2,"body":"No se en que parte de eso dice lo que dices. Claramente dice:\n\n> Lo que hace el programa es inyectar medio de contraste a esto para que estas personas sean más fáciles de encontrar, quee colaboren entre sí y a los demás, y además nos ayuden a nosotros como Rioters a lograr más para los jugadores. \n\n> Lo importante es entender que el programa de voluntarios está más en manos de los jugadores que nosotros, y queremos que así sea\n\nCreo que no deja lugar a dudas.\n\nLo otro que dice es que van a estudiar los resultados, que no significa que no sea exitoso el programa, como vos das a entender. Ni tampoco dice \"los voluntarios deberían realizar eventos y divertirnos\" como pareces sugerir.","replies":[{"poster":"Bienzahar","date":"2018-01-02T23:29:32.799+0000","up_votes":2,"down_votes":1,"body":"Hay que leer toda la conversación.\n\nEdit1: Excalibeer edito la parte de un resumen anual y en la que nombraba hitos cualitativos, dios santo que risa, porque sera? que tendra que ocultar? acaso tendria que admitir que no se ha logrado nada xDDDDDDD\nCuatico bro.","replies":[{"poster":"rokushoger","date":"2018-01-03T11:15:09.458+0000","up_votes":2,"down_votes":1,"body":"Leí todo y no vi nada de eso. Además, que conveniente que justo la parte en que te apoyas conspiranoicamente fue editada... \nDe onda man, ya me cansa explicarte lo mismo 150 veces. En este tema paso de contestarte de aquí y a futuro.","replies":[{"poster":"Bienzahar","date":"2018-01-03T11:53:05.228+0000","up_votes":2,"down_votes":1,"body":"Loco, Excalibeer lo edito xDD que conveniente que justo en la parte en que se caía lo edito, además de que le avisaran xDDD\nEn serio que risa lo que paso xD","replies":[{"poster":"Ks Erwyn","date":"2018-01-03T11:54:52.206+0000","up_votes":2,"down_votes":0,"body":"es un pillo....","replies":[{"poster":"Bienzahar","date":"2018-01-03T12:02:09.540+0000","up_votes":2,"down_votes":1,"body":"Tendría que admitir que el programa no sirve para nada xD","replies":[{"poster":"Ks Erwyn","date":"2018-01-03T12:06:02.272+0000","up_votes":2,"down_votes":1,"body":"por que ellos son unos vagos, el problema con el \"programa\" es que dejaron colgados a los yellows...","replies":[{"poster":"Bienzahar","date":"2018-01-03T12:10:15.588+0000","up_votes":2,"down_votes":1,"body":"Quisas tengas razón xD","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"vaVav","date":"2018-01-02T19:13:22.793+0000","up_votes":4,"down_votes":2,"body":"> EDIT: Se hace difícil no compararlos con otro grupo que están organizados y ejecutando eventos con la comunidad y que llevan menos tiempo.\n\nLos fines son distintos. En muchos sentidos no necesariamente buenos.","replies":[]},{"poster":"Excorpion","date":"2018-01-02T16:06:21.158+0000","up_votes":4,"down_votes":2,"body":"Yo no veo cambio ni desde antes del programa. Por que las mismas personas seguimos haciendo lo mismo con contacto a rioters y mods, nada más.\nLos mods podrían notar algo diferente, dado que son los que pasan siempre en el foro.","replies":[]},{"poster":"Ks Erwyn","date":"2018-01-02T16:26:50.177+0000","up_votes":5,"down_votes":3,"body":"Tú error es creer que el programa Voluntarios tenia un Fin/propósito para empezar...\n\n{{sticker:sg-lulu}}","replies":[]},{"poster":"2801","date":"2018-01-02T16:01:34.364+0000","up_votes":4,"down_votes":3,"body":"Es que no hacen mucho algunos, generalmente veo siempre a los mismos 3, los demás, andan desaparecidos.","replies":[]},{"poster":"Tortuguita","date":"2018-01-02T17:35:47.230+0000","up_votes":2,"down_votes":1,"body":"Nada , lamentablemente nada :/\n\nY esta bien por que tampoco debiamos esperar nada xD. Los amarillos son solo personas iguales a nosotros que tenían (algunos) las ganas de aportar y lo intentaron varias veces y aunque algunos bajo su color amarillo se tiraron para atrás , otros abusaron de el , etc , ellos van a seguir haciéndolo por que no importa si tenes toda la paleta de colores en tu nombre lo que es relevante son tus aportaciones y la pasión que le pones.","replies":[]},{"poster":"Tenken","date":"2018-01-02T16:29:51.838+0000","up_votes":3,"down_votes":3,"body":"https://youtu.be/YCNENUDdYtA?t=4\n\n--------------------\n--------------------------\n\nSimplemente obtuvieron las recompensas (Que no existen, ya que todos somos iguales según decían) y se fueron (No todos obviamente).\n\nBueno, no hay mucho que pueda agregar a estas alturas, ya que he dicho casi todo lo que pienso, he visto y experimentado con este sistema que se inventaron; y con la gente que pusieron en estos ''cargos''.\n\nA menos que responder la pregunta de ''¿Como puedo iniciar sesión?'' o  ''¿Como puedo tirar la Q?'' sea un aporte importante, digno de todas las invitaciones a la Luna.\n\nSaludos y suerte! ( ^ 3^)http://i.imgur.com/dP2JdDJ.png?1 ❤","replies":[]},{"poster":"Perdí Un Meep","date":"2018-01-02T18:11:57.340+0000","up_votes":2,"down_votes":4,"body":"AGUANTE FILANTROPOS PAPA!","replies":[]}]}