{"poster":"Bienzahar","date":"2018-03-14T18:22:22.525+0000","title":"Este es el elo de ORO, 10 k de diferencia en oro y no logran cerrar la partida.","subforum":"Jugabilidad, balance y narrativa","up_votes":2,"down_votes":1,"body":"https://i.gyazo.com/6568b9c14980b3fd6b025c3a98133583.png\r\n4 Dragones, un dragon ancestral y 2 barones hizo el equipo rojo y no logro terminar una partida que estaba cantada, se dedicaron a robar jungla y dar vueltas mientras que nosotros farmeabamos lo que llegaba a base.\r\nAl final todos ibamos full build pero nosotros teniamos una Vayne y ganamos por 2 TeamFights bien hechas.\r\n\r\nGG ORO ELO (?)","replies":[{"poster":"Diosmo","date":"2018-03-14T23:50:55.553+0000","up_votes":1,"down_votes":0,"body":"Si te metes en una partida de Bronce/Plata donde un equipo stompea, hace eso el 100% de las veces.","replies":[]},{"poster":"Nabuze","date":"2018-03-14T21:18:17.857+0000","up_votes":1,"down_votes":0,"body":"Esos 5 que te tocaron en contra no salen más de donde están xD.\nO estaban muy tilteados o pertenecen ahí definitivamente","replies":[]},{"poster":"Roruto","date":"2018-03-14T21:16:06.835+0000","up_votes":1,"down_votes":0,"body":"He ganado varias partidas así: \nTienen ellos una {{champion:55}} o {{champion:11}} ultra feed que les ha hecho la partida por 30 minutos pero no aprovechan esa ventaja y terminan perdiendo (no sin antes insultarnos a nosotros y entre ellos) que estábamos perdiendo porque le dieron duro a nuestros hipercarrys {{champion:67}} {{champion:37}} \nSimplemente aguantas mientras ellos van a buscar kills o a spamear pings y luego esperas a un error.\nSaludos!","replies":[]},{"poster":"Not Personal","date":"2018-03-14T18:55:41.110+0000","up_votes":1,"down_votes":0,"body":"Es horrible estar del lado del que va ganando y que te pase eso. La unica forma de lograr revertir esta actitud es ser vos el que esta carreando, entonces casi cantadamente el team te va a seguir por logica. Capitalizar la ventaja (osea, hacerla valer) es la parte que mas falla en la mayoria de los elos y una de las mas importantes.","replies":[{"poster":"Bienzahar","date":"2018-03-14T20:22:09.415+0000","up_votes":1,"down_votes":0,"body":"Ni con eso, no vas a ir 1 vs 5 xD","replies":[]}]},{"poster":"WhiteMax","date":"2018-03-14T19:06:03.078+0000","up_votes":1,"down_votes":0,"body":"Lo mas triste es cuando se ponen a farmear la jg los full build... o que seas el sup de utility y te tengas que bancar esto...","replies":[]},{"poster":"exrex","date":"2018-03-14T19:02:33.483+0000","up_votes":1,"down_votes":0,"body":"Pasa en platino 4 y 5 tambien. Siempre esta el caprichoso que no se quiere juntar porque le faltan 100 para la armadura, otros 100 para la espadita, se relaja y empieza a morir 1 vs 5. Al final se desespera y sigue paseandose por jg rival sin vision, y por orgullo de no reconocer que esta jugando mal se va quedando cada vez mas atras.\nSi le decis que se junte, se enoja. Si lo acompañas, se va a otra linea... \n\nMientras mas tiempo pase, los error se pagan cada vez mas caro.  \nExrex 2018","replies":[]},{"poster":"MILFortune","date":"2018-03-14T18:39:19.451+0000","up_votes":2,"down_votes":2,"body":"Me pasa en todos los elos. Los pajeros tienen una torre que tirar y en vez de robar jungla a la vuelta \"NO, mejor jungla y después si queda tiempo vamos a tirar la torre cuando revivan todos los rivales y nos maten\" . Se quedan excesivamente en mid aunque tiren hasta el inhibidor. haciendo qué? No sé. Y platino igual","replies":[]}]}