{"poster":"Bienzahar","date":"2017-08-27T02:21:06.859+0000","title":"ADC con Targon, new meta?","subforum":"Jugabilidad, balance y narrativa","up_votes":4,"down_votes":2,"body":"El otro d&iacute;a estaba viendo un stream de un tipo en diamante, me llamo la atenci&oacute;n que el adc que era twicht se comprara targon para comenzar, dije &quot;esta trolleando, van a perder&quot; y no fue as&iacute;. El targon le permitio a su support armarse mucho antes que el otro y el escudo de la pasiva del targon le ayudo en los trades, ganaron la partida.\r\nRecien lo probe con jhin y anda super bien para el sustein en linea.","replies":[{"poster":"Neo Gaussrik","date":"2017-08-28T13:56:41.005+0000","up_votes":3,"down_votes":0,"body":"En mi opinion, es una consecuencia de lo OP que estaba el pebetero.\n\nSi el poder que ganas cuando tu soporte completa su primer objeto es tan grande, entonces que el tirador invierta su oro en que el soporte gane mas oro vale la pena.","replies":[{"poster":"Bienzahar","date":"2017-08-29T00:25:47.862+0000","up_votes":1,"down_votes":0,"body":"Pero realmente no estas inviertiendo el oro del adc, ambos lo ganan.\nCreo que para jugar esto hay que ir siempre en premade.","replies":[{"poster":"Neo Gaussrik","date":"2017-08-29T13:55:33.596+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bienzahar,realm=LAS,application-id=xQmJPO8F,discussion-id=8MchJWNV,comment-id=00030000,timestamp=2017-08-29T00:25:47.862+0000)\n>\n> Pero realmente no estas inviertiendo el oro del adc, ambos lo ganan.\n> Creo que para jugar esto hay que ir siempre en premade.\n\nEl tirador igual esta comprando un objeto de soporte que le da estadisticas poco atractivas (vida y regeneracion de vida) en vez de, digamos, {{item:1055}} que le da daño de ataque y robo de vida.","replies":[{"poster":"iNGENiO","date":"2017-08-29T14:06:10.406+0000","up_votes":2,"down_votes":0,"body":"Hay otra gran diferencia, 1 es que gana vida con la pasiva del objeto al matar subditos. Y tiene Reg de vida propia del objeto + vida extra.\n\nLo único que sacrificas son los 8 de daño de ataque.\n\nPero ganas 2 potas de vida extra. 300 de vida en consumibles. Ya que targon es mas barato.\n\nPara una linea donde sabes que solo vas a farmear es atractivo.","replies":[]}]}]}]},{"poster":"Cuchufleitor","date":"2017-08-27T02:38:43.155+0000","up_votes":2,"down_votes":0,"body":"Es algo que se hizo apenas salio el targon, de hecho era tan bueno que jugaban sin jungla y con doble top, poco despues tuvieron que nerfearlo. Primera vez que lo veo volver, capaz es por que lo estuvieron bufeando de a poquito y a alguien se le ocurrio probar si seguia siendo viable.","replies":[{"poster":"Bienzahar","date":"2017-08-27T02:42:21.882+0000","up_votes":1,"down_votes":0,"body":"A pues eso no lo sabia xD","replies":[]}]},{"poster":"Cesth","date":"2017-08-27T02:37:14.782+0000","up_votes":1,"down_votes":0,"body":"Es para que el soporte pueda tener mas oro para comprar el Pebetero Ardiente antes y conseguir rápido el power spike que da el objeto.","replies":[{"poster":"Bienzahar","date":"2017-08-27T02:40:01.678+0000","up_votes":1,"down_votes":0,"body":"Iba con Leona y eran premade, ella se hizo la Promesa del Caballero despues del Targon y los wards.","replies":[{"poster":"ObreroSocialista","date":"2017-10-04T06:20:51.511+0000","up_votes":1,"down_votes":0,"body":"Pero es la misma lógica de rushear el pebetero, solo que leona no tiene la capacidad de spamear curaciones o escudos sobre su adc por lo que es más conveniente invertir ese oro extra en un ítem de mid game que le permita tankear más en los trades prolongados o consecutivos y con hacer más peel al adc y aliados antes de backear, como lo es con promesa del caballero.","replies":[]}]}]},{"poster":"MILFortune","date":"2017-08-27T03:03:50.974+0000","up_votes":1,"down_votes":0,"body":"Como te han dicho, ayudarle al soporte a ganar oro, parra rushear el Pebetero, es ganar la línea. Por eso usan runas de oro en los soportes como Janna. Pero esto es MUY específico y depende del matchup, también.","replies":[{"poster":"Bienzahar","date":"2017-08-27T03:07:56.255+0000","up_votes":1,"down_votes":0,"body":"En el caso que comento eran una premade de Twitch y Leona, no se buildeo Pebetero.","replies":[{"poster":"MILFortune","date":"2017-08-27T03:12:33.916+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bienzahar,realm=LAS,application-id=xQmJPO8F,discussion-id=8MchJWNV,comment-id=00020000,timestamp=2017-08-27T03:07:56.255+0000)\n>\n> En el caso que comento eran una premade de Twitch y Leona, no se buildeo Pebetero.\n\nTwitch, Kogmaw y algún otro lo puedan hacer. El punto no es el Pebetero en sí (pero si sos un soporte de heal, querés buildear primero el ítem) . Mirá este video:\n\nhttps://www.youtube.com/watch?v=vPPhh5Oh_Po","replies":[]}]}]}]}