{"poster":"ToMac4","date":"2017-01-17T18:07:45.383+0000","title":"leavebuster","subforum":"Charlas Generales","up_votes":3,"down_votes":2,"body":"y pensar que el leavebuster es lo &uacute;nico bien implementado de lol y es completamente autom&aacute;tico. mientras que los flamers, trolls y dem&aacute;s tienen rienda suelta por la flojera humana. \r\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"WhiteMax","date":"2017-01-17T18:13:18.007+0000","up_votes":2,"down_votes":0,"body":"No van a poner un sistema automatico que banee gente solo por decir una palabra \"mala\" o que se interprete como mala{{sticker:slayer-jinx-unamused}} .\n\nSi te topas con trolls, flammers, etc. Reportalos y ya, si ellos siguen asi tarde o temprano perderan la cuenta.","replies":[{"poster":"ToMac4","date":"2017-01-17T18:25:23.699+0000","up_votes":1,"down_votes":0,"body":"tengo 3 años jugando a lol y aun espero a que baneen gente, o que siquiera aparezca el mensaje de que mi reporte al menos fue tomado en cuenta y pasa 1 vez cada un año. \n\ny una palabra mala? cual? si ponen mas esfuerzo en censurar palabras mas que en corregir a la gente que las escribe xd","replies":[{"poster":"WhiteMax","date":"2017-01-17T18:41:29.427+0000","up_votes":1,"down_votes":0,"body":"Dicen por ahi (no lo eh confirmado) que el mensaje se lo dan a la ultima persona que haya reportado y que haya generado la sancion en la persona reportada.\n\nY en lo de censurar palabras, creo que hasta decir \"mama\" es censurado jaja.","replies":[]}]}]},{"poster":"Gabsss","date":"2017-01-18T00:09:16.070+0000","up_votes":1,"down_votes":0,"body":"Hola, pasate por mi post y dejame tu opinión es casi el mismo tema.\nsaludos.","replies":[{"poster":"ToMac4","date":"2017-01-20T12:18:32.393+0000","up_votes":1,"down_votes":0,"body":"y si me dejas algún link?","replies":[]}]},{"poster":"Yrox the Third","date":"2017-01-17T19:51:36.328+0000","up_votes":1,"down_votes":0,"body":"Revisa el foro un momento y veras la cantidad masiva de gente baneada \"injustamente\"","replies":[{"poster":"ToMac4","date":"2017-01-17T19:54:33.785+0000","up_votes":1,"down_votes":0,"body":"tengo una semana consecutiva aquí y no e visto mucho, solo a una persona.","replies":[{"poster":"Yrox the Third","date":"2017-01-17T19:56:50.533+0000","up_votes":1,"down_votes":0,"body":"Te digo por experiencia que he estado desde antes que actualizaran la pagina para que quedara asi, y ver post de \"bans injustos\" ya es pan de cada dia para mi.","replies":[]}]}]},{"poster":"AxGod","date":"2017-01-17T19:35:18.033+0000","up_votes":1,"down_votes":0,"body":"yo el otro dia reporte por abuso verbal y cuando volvi a entrar al lol me aparecio el cartel de que el jugador iba a ser sancionado pero no baneado porque ellos interpretan que todos pueden tener un mal dia","replies":[]},{"poster":"faster51","date":"2017-01-17T18:12:09.302+0000","up_votes":1,"down_votes":0,"body":"+1 :V","replies":[]}]}