{"poster":"ToMac4","date":"2017-01-02T15:20:52.845+0000","title":"jugadores novatos o rankeds muy accesibles?","subforum":"Charlas Generales","up_votes":8,"down_votes":4,"body":"Antes de comenzar, todos sabemos  lo &uacute;nico que pide el juego para entrar a ranked &quot;&quot;&quot;&quot;&quot;&quot;&quot;el juego serio&quot;&quot;&quot;&quot;&quot;&quot;&quot; es tener cierto numero de campeones (solo que los tengas) los sepas usar o no y ser nivel 30. \n\nLa realidad es que mucha gente llega a nivel 30 jugando a un solo campe&oacute;n y una sola linea. (los que de verdad son nuevos, ya hablare de las cuentas secundarias) esto afecta de manera el emparejamiento total del juego, ya ha muchos nos toca ver gente que no sabe ni desempe&ntilde;arse de manera m&iacute;nima en su carril o escogiendo algo con lo que sabe que va a perder, pero es lo &uacute;nico que sabe usar. \n\nYo les pregunto, &iquest;las rankeds son demasiado accesibles? o &iquest;la gente solo aprende a subir de nivel en su camino de 1 a 30?. \n\nEn lo personal creo que son ambas cosas, tenemos gente que en su camino de 1 a 30 jamas han jugado de soporte y solo saben ir a mid y &iquest;que pasa cuando no les toca la linea que quieren y se saben desempe&ntilde;ar?, el resto de personas se ve perjudicado. \n\notra cosa que quiero tratar y por el cual creo que se deben agregar pasos extra para entrar a las ranked, son las cuentas secundarias. \ne hablado con gente que posee mas de 5 cuentas o jugado en contra de personas que se nota que no pertenecen a esa liga y te destrozan en eso de 5 minutos, pero su cuenta es nueva. \n\nYa que el sistema de maestr&iacute;as es in&uacute;til (es as&iacute;), es decir para lo &uacute;nico que sirven es para esas personas a las que les gusta spamearlas y junto a las maestr&iacute;as tenemos un sistema de puntos tambi&eacute;n in&uacute;til, &iquest;por que no agregarles una nueva funci&oacute;n?. \ny que la gente tenga que poseer cierto grado de maestr&iacute;a con cierto numero de campeones en general para poder acceder. en pocas palabras que de alguna manera demuestre que tiene experiencia con mas de un campe&oacute;n y a su vez, que la gente que tiene la man&iacute;a de crear cuentas secundarias para subir de liga de forma mas r&aacute;pida encuentre tedioso este proceso y se detenga un poco ese tema. \n\nlo mismo con los baneos, si se crea un sistema que resulte tedioso de hacer repetidas veces la gente se comportaría y no simplemente escape a su cuenta secundaria a seguir flameando. \n\nsi lol en el tema de rankeds fuera mas exigente en lugar del sistema del cual todos se quejan, la cosa cambiar&iacute;a, &iquest;que crees tu?.","replies":[{"poster":"9081913DEL1","date":"2017-01-02T15:53:56.150+0000","up_votes":7,"down_votes":2,"body":"Todo muy lindo pero conozco gente que esta en diamante jugando un solo campeon y una sola linea y dodgeando todo lo demas, en cuanto al juego son medio mancos pero no les quitas de la cabeza que tienen el marquito.\n\nVeamos al llegar a lvl 30 ya has jugado bastantes partidas asi sean en aram contra bots y demas, hay cosas que ya conoces, basicas si, pero esa es la cuestion. No podes salir del gym coo un boxeador de elite, tenes que boxear primero.\nEn cuestion de lol por mas que practiques, vas a tener el limitante de la realidad, ranked se juega totalmente distinto a normales.\nLol es un juego si entras a divertirte deberias ir a normales, y con amigos. Lo malo es pensar que porque las rankeds estan disponibles hay que rankear. Es como decir tengo soraka voy soraka jungla porque puedo pickearla. No es asi.\n\nEn cuanto a la habilidad, ja esta bien lo que dices pero la media del server ya es bastante baja, que tanto sabe alguien estancado en bronce, plata u oro mas que un unranked. \nAl smurf que le cuesta sacar maestria con un campeon, ademas si sabe jugar subira rapido tratar de retrasarlo solo haces que juegue mas partidas contra lvls bajos.\n\nEl problema mas grande que veo en el rankeo es que no se toman el tiempo de aprender de sus errores, que es la clave de un jugador competitivo. Esto no esta atado a gente nueva. Es decir escucho gente hablar sobre la diferencia entre un plata con 1000 partidas y un unranked. Si tenes 1000 partidas en plata no aprendes de tus errores y como en  plata no necesitas mucho para ascender, es una cuestion de logica que bien puede jugar mejor que tu un unranked.\n\nSaludos.","replies":[{"poster":"Hijikata","date":"2017-01-02T18:01:38.717+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zelos From Jonia,realm=LAS,application-id=v7qsfXsE,discussion-id=QmeAKbRt,comment-id=0000,timestamp=2017-01-02T15:53:56.150+0000)\n>\n> Todo muy lindo pero conozco gente que esta en diamante jugando un solo campeon y una sola linea y dodgeando todo lo demas, en cuanto al juego son medio mancos pero no les quitas de la cabeza que tienen el marquito.\n> \n> Veamos al llegar a lvl 30 ya has jugado bastantes partidas asi sean en aram contra bots y demas, hay cosas que ya conoces, basicas si, pero esa es la cuestion. No podes salir del gym coo un boxeador de elite, tenes que boxear primero.\n> En cuestion de lol por mas que practiques, vas a tener el limitante de la realidad, ranked se juega totalmente distinto a normales.\n> Lol es un juego si entras a divertirte deberias ir a normales, y con amigos. Lo malo es pensar que porque las rankeds estan disponibles hay que rankear. Es como decir tengo soraka voy soraka jungla porque puedo pickearla. No es asi.\n> \n> En cuanto a la habilidad, ja esta bien lo que dices pero la media del server ya es bastante baja, que tanto sabe alguien estancado en bronce, plata u oro mas que un unranked. \n> Al smurf que le cuesta sacar maestria con un campeon, ademas si sabe jugar subira rapido tratar de retrasarlo solo haces que juegue mas partidas contra lvls bajos.\n> \n> El problema mas grande que veo en el rankeo es que no se toman el tiempo de aprender de sus errores, que es la clave de un jugador competitivo. Esto no esta atado a gente nueva. Es decir escucho gente hablar sobre la diferencia entre un plata con 1000 partidas y un unranked. Si tenes 1000 partidas en plata no aprendes de tus errores y como en  plata no necesitas mucho para ascender, es una cuestion de logica que bien puede jugar mejor que tu un unranked.\n> \n> Saludos.\n\nla diferencia entre un unranked y un silver o un gold es muchisima, te lo digo porque cuando estaba en silver 3 mas o menos, me acuerdo que era que te toque un unranked y perder automaticamente.","replies":[{"poster":"9081913DEL1","date":"2017-01-02T19:01:42.197+0000","up_votes":1,"down_votes":0,"body":"Unranked significa no rankeado, lo que vos decis es noob que es distinto. Que la gente sea unranked no tiene que ver con que desconozca el juego. De hecho rankear es posicionarse a nivel global en ese marco primero tienes que conocer que estas haciendo. Lo que deberias saber si sabes lo que significa smurf, cuando un smurf rankea su cuenta primero es unranked, acaso nunca jugaste con un smurf? \n\nSaludos.","replies":[{"poster":"Hijikata","date":"2017-01-02T22:12:53.128+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zelos From Jonia,realm=LAS,application-id=v7qsfXsE,discussion-id=QmeAKbRt,comment-id=000000010001,timestamp=2017-01-02T19:01:42.197+0000)\n>\n> Unranked significa no rankeado, lo que vos decis es noob que es distinto. Que la gente sea unranked no tiene que ver con que desconozca el juego. De hecho rankear es posicionarse a nivel global en ese marco primero tienes que conocer que estas haciendo. Lo que deberias saber si sabes lo que significa smurf, cuando un smurf rankea su cuenta primero es unranked, acaso nunca jugaste con un smurf? \n> \n> Saludos.\n\nsi queres usar vocabulario especifico usalo, la realidad es que los unranked nunca tienen el nivel de un silver 3 para arriba, salvo algunos contados con los dedos. Y lo vivi, era infumable que te tocaran tipos sin runas, que armaban lo que querian, un desastre.","replies":[{"poster":"Locked ULIvE","date":"2017-01-03T03:21:05.996+0000","up_votes":1,"down_votes":0,"body":"No tiene la skill de un plata 3, he jugado con platas con mil partidas no tiene la experiencia, pero si lo que tienen en común la mentalidad de no aprender, no aceptas sus errores, no comunicarse, flamear, frustrarse al no salir una partida bien, eso tienen en común. La temporada pasada subir a oro en 300 partidas y parte en bronce 4. Es lo que vi y sentí.","replies":[]},{"poster":"Lynox12","date":"2017-01-03T00:11:00.839+0000","up_votes":1,"down_votes":0,"body":"Soy unranked, compro runas y juego mid/top/jg/supp, eso es ser noob?\nDomino a champs con bastantes mecanicas (menos a teemo)\nPor ser unranked me vuelvo noob automaticamente?","replies":[{"poster":"Hijikata","date":"2017-01-03T00:59:47.074+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lynox12,realm=LAS,application-id=v7qsfXsE,discussion-id=QmeAKbRt,comment-id=00000001000100000000,timestamp=2017-01-03T00:11:00.839+0000)\n>\n> Soy unranked, compro runas y juego mid/top/jg/supp, eso es ser noob?\n> Domino a champs con bastantes mecanicas (menos a teemo)\n> Por ser unranked me vuelvo noob automaticamente?\n\nY mira, las unicas 4 ranked que jugaste las perdiste todas, eso habla solo. Ademas tenes un promedio de 10 11 muertes por partida.","replies":[]}]}]}]},{"poster":"ToMac4","date":"2017-01-02T18:15:23.311+0000","up_votes":1,"down_votes":0,"body":"ami me salían unrankeds en oro 3....","replies":[]}]},{"poster":"ToMac4","date":"2017-01-02T17:16:48.056+0000","up_votes":1,"down_votes":0,"body":"el punto es, que la gente de de verdad aprenda a jugar en el camino de 1 a nivel 30. lo que tu dices que conoces gente que es diamante jugando un solo campeón, siempre y absolutamente siempre puede jugar la misma linea? el mismo cham?. \npregúntate a ti mismo bajo tus experiencias en el juego si eso es siquiera posible. \n\nel concepto general al que me refiero es, a agregar pasos extra para que la idea de crearse otra cuenta sea algo que de verdad se tenga que considerar y mejorar a su vez la calidad de la gente que entre a jugar rankeds.  el problema es justamente ese, las cosas en lol están demasiado accesibles. \n\nuna solución mas drástica solo y solo como ejemplo podría ser por ejemplo. para evitar que la gente \"trolle\" pickeando bichos en lineas que no les corresponde seria a mi ideal y en relación en como se elijen campeones en ranked. es que si tu elijes jungla o supp por ejemplo tengas disponible para elegir todos los soportes del juego, (en gran medida eso eliminaría a los te emo adc y etc. \n\npero por consecuencia limitarías a toda esa gente que en ocasiones juega con kog en top, zed o fizz jungla, cosa que no es completamente necesaria, pero se a implementado antes con por ejemplo te emo y la tiamat no? \n\ncomo digo el concepto general seria que de verdad se aprenda a jugar desde un lado mas técnico a medida de que subes de nivel.","replies":[]}]},{"poster":"Flánn","date":"2017-01-02T18:17:29.926+0000","up_votes":1,"down_votes":0,"body":"https://www.google.com.ar/url?sa=i&rct=j&q=&esrc=s&source=images&cd=&ved=0ahUKEwiIwOmAiaTRAhWBj5AKHT4NDLcQjRwIBw&url=http%3A%2F%2Fwww.memegenerator.es%2Fmeme%2F19109819&psig=AFQjCNHMvQ-W-FHRTCulh1JDLzjH94ryow&ust=1483467437185913","replies":[{"poster":"Diosmo","date":"2017-01-02T18:43:17.547+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=EL parkito,realm=LAS,application-id=v7qsfXsE,discussion-id=QmeAKbRt,comment-id=0004,timestamp=2017-01-02T18:17:29.926+0000)\n>\n> https://www.google.com.ar/url?sa=i&amp;rct=j&amp;q=&amp;esrc=s&amp;source=images&amp;cd=&amp;ved=0ahUKEwiIwOmAiaTRAhWBj5AKHT4NDLcQjRwIBw&amp;url=http%3A%2F%2Fwww.memegenerator.es%2Fmeme%2F19109819&amp;psig=AFQjCNHMvQ-W-FHRTCulh1JDLzjH94ryow&amp;ust=1483467437185913\n\nFixed\n\nhttp://cdn.memegenerator.es/imagenes/memes/full/19/10/19109819.jpg","replies":[{"poster":"Flánn","date":"2017-01-02T18:53:19.069+0000","up_votes":1,"down_votes":0,"body":"KOMO LO HIZO O_o disculpa mi ignorancia pero como es que haces para que se vea la imagen en vez del link?","replies":[{"poster":"Diosmo","date":"2017-01-02T20:19:10.170+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=EL parkito,realm=LAS,application-id=v7qsfXsE,discussion-id=QmeAKbRt,comment-id=000400000000,timestamp=2017-01-02T18:53:19.069+0000)\n>\n> KOMO LO HIZO O_o disculpa mi ignorancia pero como es que haces para que se vea la imagen en vez del link?\n\nEn la direccion de Meme Generator:\nhttp://www.memegenerator.es/meme/19109819\n\nTenes que buscar donde dice el enlace \"Imagen\"","replies":[{"poster":"Flánn","date":"2017-01-02T21:18:05.915+0000","up_votes":1,"down_votes":0,"body":"Muchisimas gracias","replies":[{"poster":"ToMac4","date":"2017-01-02T21:22:06.676+0000","up_votes":1,"down_votes":0,"body":"cuando tu post se torna en un \"como poner memes\"","replies":[{"poster":"Flánn","date":"2017-01-02T21:38:22.676+0000","up_votes":1,"down_votes":0,"body":"En un post que trataba de un chiste que decia \"Que es Rengar cuando Poppy ultea? EL GATO VOLADOOOOOOOOOOR\" en ese post se termino hablando de politica :u","replies":[]}]}]}]}]}]}]},{"poster":"Gabsss","date":"2017-01-02T22:35:38.223+0000","up_votes":1,"down_votes":0,"body":"Rankeds demasiado accesibles.\nRedujeron la experiencia que se necesitaba antes para poder llegar al nivel 30.\nSe llega tan rápido que la gente piensa que juega bien y se mandan a jugar rankeds quedando en el circulo eterno de los low elo y futuros trolls.","replies":[]},{"poster":"NsCzdr","date":"2017-01-02T20:17:13.440+0000","up_votes":1,"down_votes":0,"body":"La solucion real, seria que Riot realmente enseñe o obligue a los jugadores a aprender.\nEl Tutorial es malisimo y la gente no le presta atencion, por consecuencia no aprenden nada hasta llegar a lvl 30.","replies":[{"poster":"ToMac4","date":"2017-01-02T20:57:10.910+0000","up_votes":1,"down_votes":0,"body":"no se tendría por que obligar, el tutorial es malo por que no es una guía de introducción al juego, sino un totorial de \"aprende a manejar los controles básicos\".  agregar pasos extra como que por ejemplo tener 16 campeones con una puntuación mínima para acceder a rankeds seria lo ideal. por que tendrías que entrar a jugar con esos 16 bichos a subirles maestría y eso implica que ya sabrías jugarlos aun que sea un poco.","replies":[]}]},{"poster":"bleachwill","date":"2017-01-02T19:55:01.711+0000","up_votes":1,"down_votes":0,"body":"me parece que a nadie le importa eso ya que solo afecta a los jugadores de elo bajo. y lo de poner un requisito de maestria por numero de campeones afectaria hasta a los challengers que son one trick","replies":[{"poster":"ToMac4","date":"2017-01-02T20:52:57.355+0000","up_votes":1,"down_votes":0,"body":"es que la idea  que tengo es, que si tu vas a crear una cuenta secundaria para ir a joder a la gente de elo bajo.. mínimo que te cueste volver a entrar a las ranked y dudes incluso mas en crearte una tercera cuenta.","replies":[]}]},{"poster":"LEPscad ","date":"2017-01-02T18:48:02.531+0000","up_votes":1,"down_votes":0,"body":"Veamos, resumiendo mi respuesta, uno puede llegar a lv 30 jugando contra bots (Mi caso), luego de eso comprar champs \"Baratos\" y tirarte a ranked, muchos amigos mios cometieron ese error y en aquella epoca... bronze V IV III etc.\n\ncreo que los requisitos son muy pocos, yo luego de llegar a 30, tuve que perderle el miedo a jugar contra gente real, vamos, xenofobia, formar una barrera contra los insultos y luego rankear, ¿el resultado?  jamas toque bronze, plata III, oro III, y termine la season pasada en platino, una división cada año.\n\nde lv 1 a 30 es muy poca la experiencia, asi que yo creo que deberían tener normas mas rigurosas.","replies":[]},{"poster":"Nocere Æternum","date":"2017-01-02T16:15:06.565+0000","up_votes":1,"down_votes":0,"body":"Me parece que muy acertado loq ue decis. No paro de ver gente que juega de sup y se queda ATRAS del adc y  la piedra vidente al min 28.\nHabiendo mas de 130 champs que el sistema pida 15 es una invitacion a la gente que recien esta empezando a que aprenda a jugar en Ranked, el tipico ejemplo de chat que dice: y a esto que se le maxea?\n\n  Mi idea era que se tenga un minimo de 3 champs con maestria 4 por rol para empezar a jugar rankeds.","replies":[{"poster":"Flánn","date":"2017-01-02T18:19:10.656+0000","up_votes":1,"down_votes":0,"body":"Puta wn que wina la idea conchitumari","replies":[]}]},{"poster":"NerfAutoFill","date":"2017-01-02T16:02:01.244+0000","up_votes":1,"down_votes":0,"body":"Cual es el problema? \n\nEstos jugadores piensan que juegan bien y van a quedar en una liga alta\n\nCon el tiempo se dan cuenta que no entendian mucho del juego y termianan  quedano en bronce o silver. Luego mejoran y suben\n\nEl lado malo es que lo unico que hacen es hacer la partida 5vs4... Todos fuimos unraked alguna vez y paso esto","replies":[]},{"poster":"tigre05","date":"2017-01-02T15:54:19.125+0000","up_votes":1,"down_votes":1,"body":"deberia pedir al menos maestria 5 con 1 champ de cada lane para entrar a ranked :v","replies":[]}]}