{"poster":"FluffyPotato","date":"2016-06-28T11:53:49.760+0000","title":"Suppenporter hilfe","subforum":"Level Up: Guides & Tipps","up_votes":3,"down_votes":0,"body":"Heyho gr&uuml;&szlig; euch liebe Mitbeschw&ouml;rer.\r\n\r\nIch d&uuml;mpel als Suppenporter durch die Eloladder, meistens Solo um etwaige Fragen vorwegzunehmen. Ich bin jetzt nicht der beste, aber hab schon etwas Ahnung vom Spiel.\r\n\r\nHab mir mittlerweile bis dato viele Guides und Videos reingezogen. Was tut ein Supp wie wann wo usw. Dabei bin ich &uuml;ber Begriffe wie ^Shotcall^ &uuml;ber ^Map-Awarness^ bis ^Laneswap^ gestolpert. Ich bin mittlerweile Gold 1 und hab mir eine gewisse Map-Control angeeignet. In der theoretischen Theorie is doch der Supp das Gehirn vom Team, sodass sich alle anderen aufs ^Fett^ werden konzentrieren k&ouml;nnen. \r\n\r\nMir wurde auch von Highelo Dia Supps geraten meine Teammitglieder sterben zu lassen...zb.: Wenn mein adc in die feindliche Base in 3 Gegner rein &quot;e&quot;t (in dem Fall Ez), dort aber 4 Dudes stehn, die zwar halb low sind aber nen squishy adc trotzdem in ner halben Sekunde stampfen, ist es doch eig logisch das man den so hart es klingt seinem Schicksal &uuml;berl&auml;sst. (Ja Ez war Killgeil xD)\r\n\r\nAnderes Beispiel...Mein Toplaner hat gewarded. Der gegnerische Jungler war grad Mitte und hat die Lane Topside verlassen. Meine Top lane nat&uuml;rlich mit Farmen, Harassen, Tanzen was auch immer besch&auml;ftigt(darf er ja hehe). Ich ping ihm und warne ihn vor einen Gank(nahm ich an das der kommt), er bleibt auf der Lane....Ich seh den gegnerischen Jungler beim Baron(da war ein Ward) - ich pinge nochmal....er bleibt auf der Lane.....was passiert....er stirbt xD....das ganze ist &uuml;brigens im selben Spiel 4 mal passiert....und jedes mal habe ich gepingt.\r\n\r\nNimmt man Supporter nicht ernst ? Mir kommt es so vor das man meine Pings ignoriert, letztes Spiel mit nem Lucian...ich war Braum...ich ping ihm nicht reinzugehn, er geht rein...er stirbt....wer wird angeflamed ? Ich ^^ \r\nSp&auml;ter beim tf, ich pinge nicht dort k&auml;mpfen, &uuml;berall vom gegner gewardet usw, was passiert....mein team k&auml;mpft dort, alle sterben au&szlig;er ich....wer wird geflamed ?ihr d&uuml;rft raten...\r\n\r\nIch bin zwar nur Gold 1, aber in jedem Spiel sind Platin Spieler, in jedem Spiel werden die Pings ignoriert...wird das iwann besser ? \r\n\r\nBtw....was hei&szlig;t shotcall, laneswap usw?\r\n\r\nLg xD\r\n\r\nRechtschreibfehler, gro&szlig;-Kleinschreibung d&uuml;rft ihr an Duden melden.","replies":[{"poster":"BlackSugaRose","date":"2016-06-28T12:17:47.653+0000","up_votes":3,"down_votes":0,"body":"Sodelaa, wo fang ich an..\nMan kann nicht pauschal sagen, dass Supporter nicht ernst genommen werden.\nManchmal werden Calls (egal von wem) ignoriert, aus bloßer Arroganz, fehlender Einsicht oder manchmal schlichtweg wegen dem Tunnelblick.\nAlso wenn du siehst, dass der gegnerische Jungler irgendwo gankt, spam Pings. Es mag dir vielleicht in der Vorstellung blöd vorkommen, aber eh der betroffene Laner es schlichtweg nicht bemerkt, lieber ein mal zu viel pingen als zu wenig.\nUnd es stimmt auch, dass man sich in manchen Situationen von einem Teammate entfernen sollte, wie du es beschrieben hast.\nAber wenn man das auf ganze Teamkämpfe überträgt wird das ganze etwas knifflig. Insgesamt ist es besser einem schlechten Call zu folgen, als ihn zu ignorieren und dadurch die letzte Chance zu verpassen. Wenn dein ganzes Team also am kämpfen ist und dein Leben nicht gerade von deiner KDA abhängt, solltest du auf jeden Fall mitmachen.\nEin Shotcaller ist der Spieler (eigentlich nur in Teamranked, in Solo Queue ist das zu unorganisiert), der den Ton im Team angibt. Wann wird der Drache gemacht? Wann gehen die Teamfights los? Wird um den Baron gekämpft? etc.\nUnd ein Call eben einfach das, was im Moment das Ziel ist.\nLaneswap ist eine Taktik, die man auch in Solo Queue fast nie sieht. Dabei wechseln Toplaner und Adc/Support die Position, um zum Beispiel einen gegnerischen Toplaner, der auf einen Vorteil im Early Game angewiesen ist zurückzuhalten. Aber damit wirst du vermutlich nicht konfrontiert.\nAls Laneswap kann man es auch bezeichnen, wenn Midlaner und Toplaner wechseln um ein schwieriges Matchup zu verhindern oder ähnliches. Aber im klassischen Sinne bezieht sich das auf Top und Botlane.","replies":[{"poster":"FluffyPotato","date":"2016-06-28T12:31:43.143+0000","up_votes":1,"down_votes":0,"body":"> Aber wenn man das auf ganze Teamkämpfe überträgt wird das ganze etwas knifflig. Insgesamt ist es besser einem schlechten Call zu folgen, als ihn zu ignorieren und dadurch die letzte Chance zu verpassen.\n\n\n\n\n\n\nVersteh mich nicht falsch....aber ich bin sogar diesem Ez hinterhergejumpt-konnte mich aber noch saven als er tot war, den tf hab ich auch nur grad so überlebt :) Ich lass doch mein Team nich alleine :) \n\nDanke für die Erklärung der Begriffe :)","replies":[{"poster":"BlackSugaRose","date":"2016-06-28T12:38:13.361+0000","up_votes":1,"down_votes":0,"body":"Da habe ich dich wohl wirklich falsch verstanden ^^\nDann darfst den Teil natürlich überspringen ;)","replies":[{"poster":"FluffyPotato","date":"2016-06-28T13:52:52.086+0000","up_votes":1,"down_votes":1,"body":"Das heißt du räts mir nurnoch Duo zu ranken ?","replies":[{"poster":"BlackSugaRose","date":"2016-06-28T14:18:06.179+0000","up_votes":3,"down_votes":0,"body":"Huch? Wo liest du das denn raus?\nIch sage nur, dass es nicht an der Position liegt, weshalb Pings gern mal überhört werden.\nAber es ist es tatsächlich ganz nett jemanden zu haben, den man im TS anschreien kann, dass er doch bitte back gehen soll :P\nTrotzdem ist das nicht unbedingt notwendig. Und das sage ich als leidenschaftlicher Solo Queue Support Spieler.","replies":[]}]}]}]}]},{"poster":"Im a Papaya","date":"2016-06-28T12:18:07.024+0000","up_votes":1,"down_votes":0,"body":"Shotcall kenne ich nur aus Streams und Videos, da wird festgelegt was jetzt gemacht wird wenn man unter Druck ist und Chaos auszubrechen droht also \"Focus Ez\", \"Burstet baron\" usw. aber das wird in SoloQ erheblich schwieriger, am ehesten klappt es wenn du was pingst denn mehr kann man nun mal nicht machen.\nLane Swap ist eine knifflige Sache. Unter Profis wurde das einmal gemacht als jemand als Rumble ein sehr unvorteilhaftes Matchup hatte. Rumble und deren Botlane haben dann die Lanes getauscht damit die Botlane gut farmen kann, der Rumble hat dan sehr defensiv gespielt aber seine Ult hat auch ohne viele Items einiges an Impact gehabt während der gegnerische Toplaner sehr viel langsamer an Einfluss und Items gewonnen konnte.","replies":[]}]}