{"poster":"Under Light","date":"2017-03-15T16:16:29.795+0000","title":"Anti Virus fiable..","subforum":"Off-topic y temas personales","up_votes":5,"down_votes":0,"body":"Que tal gente, me recomendaron el anti virus total 360, alguien lo tiene? es bueno?","replies":[{"poster":"ImNw","date":"2017-03-15T19:46:29.674+0000","up_votes":2,"down_votes":0,"body":"Yo tengo el predeterminado de W10 el windows defender y realmente hace rato que no veo nada raro en mi pc, como muchos dicen la mejor solucion seria no tener uno, ya que consume muchos recursos(Si tenes una PC de gama baja), sino es bastante indistinto, es cuestion de gustos, pero realmente probe  con no instalar ninguno y ningun problema.","replies":[]},{"poster":"rokushoger","date":"2017-03-15T17:35:36.874+0000","up_votes":2,"down_votes":0,"body":"El avg anda muy bien al menos para mí. Ese no lo conozco la verdad.","replies":[{"poster":"Icesoul","date":"2017-03-15T18:26:00.071+0000","up_votes":1,"down_votes":0,"body":"Same here, va bastante bien, no se si él tendra la free, pero yo si y va bien.","replies":[{"poster":"rokushoger","date":"2017-03-16T13:39:04.540+0000","up_votes":1,"down_votes":0,"body":"Si, uso el free nomás, eso con un bloqueador de publicidad y algún antimalware que pases cada tanto y estás del otro lado.","replies":[]}]}]},{"poster":"Ellora","date":"2017-03-15T22:29:27.538+0000","up_votes":1,"down_votes":0,"body":"Para que quede claro no existe un antivirus que te proteja 100%, cumplen su funcion pero tambien depende del usuario de no estar entrando y haciendo click en cda baner o programa que nadie conoce.\nDicho eso, avg, avast, panda, funcionan muy bien tienen la opcion free, pero uno que pocos conocen y tiene muy buenos resultados es el windows defender (win 8 y win 10), microsoft security esssential win7. Estos no tienen publicidad y no van a molestar con el \"pruebe, compre y registre\"\n\nCosas que una PC debe tener, antivirus, malwarebytes y un adblocker en los navegadores (ej. adguard), ccleaner para limpieza de temp y basurillas que van quedando por ahi. No se necesita mas para tener la pc en condiciones.","replies":[]},{"poster":"FAdermi7","date":"2017-03-15T21:21:37.874+0000","up_votes":1,"down_votes":0,"body":"Yo lo tengo y es buenísimo, es muy completo, y con el tiempo iras descubriendo nuevas cosas con el, prueba a hacer click en todas partes para descubrir algo interesante, utiliza el motor de 5 antivirus y tiene un optimizador, ademas de poder limpiar los archivos basura mas profundos del sistema.","replies":[]},{"poster":"I Love Pantsu","date":"2017-03-15T20:32:51.973+0000","up_votes":1,"down_votes":0,"body":"Ninguno es fiable vivo arreglando pc ,te lo digo, pero segun el av tests (Pruebas de Antivirus) .El mejor es bit defender free antivirus ,a mi me funciona ,pero eso no significa que sea fiable, para guardar archivos muy importantes los guardo en gnu/linux ,para jugar, windous","replies":[]},{"poster":"Nombre ofensivo","date":"2017-03-15T17:26:16.796+0000","up_votes":1,"down_votes":0,"body":"Ninguno, usa bloqueadores de publicidad en tu navegador y no instales software extraño. Para lo primero recomiendo firefox y le instalas los plugins de ADB, Ublock, Ghostery y activas en algunas paginas el plugin No script.","replies":[]},{"poster":"panther189","date":"2017-03-15T16:49:07.855+0000","up_votes":1,"down_votes":0,"body":"Yo no tengo ningun antivirus desde hace un año  y cero problemas. pero si tendria que instalarme uno, ese seria el avast, ademas que es free","replies":[]}]}