{"poster":"Ashhelynx","date":"2018-06-08T21:30:33.805+0000","title":"Plat Team: LF Mid & Jgl","subforum":"Looking For Team","up_votes":1,"down_votes":0,"body":"Hello! We are looking for a mid and jungle to join our competitive plat team. We will be hosting try outs starting at 11 PM Est Today. We will have 3 set practice days a week as we are going to be playing in a tournament within a few weeks. We are looking for only people who are serious and willing to commit to practice times and being apart of the team. Please fill out the information below and I will add you in game if you seem like a good fit. Thanks! \r\n\r\nIGN:\r\nAGE:\r\nRank:\r\nRole: \r\nTop 5 Champs: \r\nReason you wanna join our team:\r\nCan you shotcall: \r\nworking mic and discord:","replies":[{"poster":"NoNetflixNoChill","date":"2018-06-09T03:41:06.164+0000","up_votes":1,"down_votes":0,"body":"IGN: NoNetflixNoChill\nAGE: 21\nRank: p1/2(varies)\nRole: I fill in ranked but I guess mid/adc\nTop 5 Champs: lux, ori, corki(mid), lulu(mid), fizz/ cait, ashe, lucian, vayne, ez\nReason you wanna join our team: I just want a more competitive feel. I used to play collegiate as well as coach it but im taking a break from that for now\nCan you shotcall: if im on a less active role(such as if I fill as support/jung then I can do it pretty well) but other than that only a little like specific macrocalls\nworking mic and discord: yes(Freshavacado#6284)","replies":[]},{"poster":"BimBIm","date":"2018-06-09T02:33:29.018+0000","up_votes":1,"down_votes":0,"body":"IGN: LL Graves LL\nAGE: 20 in the navy\nRank: g2, will be plat before the weekend is over, peaked at d3\nRole: Jg\nTop 5 Champs: Graves, Rek'Sai, Zac, Ekko, Xin Zhao\nReason you wanna join our team: To join a team that likes to have fun and that strive to be the best they can be.\nCan you shotcall: Yes\nworking mic and discord: Yes to both","replies":[]},{"poster":"Ashhelynx","date":"2018-06-09T01:58:04.107+0000","up_votes":1,"down_votes":0,"body":"Bump^","replies":[]},{"poster":"OKÏZEME","date":"2018-06-08T22:58:49.603+0000","up_votes":1,"down_votes":0,"body":"IGN: Nëãr\nAGE: 18 just grad highschool\nRank:Plat 5 100lp in promos for Plat 4\nRole: JG\nTop 5 Champs: Usually whatever is top tier in meta or hyper carry junglers (xin, eve, ww, sej, graves, yi)\nReason you wanna join our team: just looking for a competitive team to join currently\nCan you shotcall: yes\nworking mic and discord: yes","replies":[]},{"poster":"Dotrix","date":"2018-06-08T21:38:13.772+0000","up_votes":1,"down_votes":0,"body":"IGN: dotrix\nAGE: 21\nRank: p4\nRole: mid\nTop 5 Champs: viktor ori azir syndra and I'm tied with malz zed and vlad for 5th\nReason you wanna join our team: Just want a team to compete in flex and tournaments with\nCan you shotcall: Yes but I'm not the best at it\nworking mic and discord: Yup","replies":[]}]}