{"poster":"Kídá","date":"2019-09-17T18:25:50.565+0000","title":"Can Brand get better wave clear","subforum":"Gameplay","up_votes":2,"down_votes":6,"body":"This is aimed towards {{champion:63}}  mid.\r\n\r\nTL;DR: Have E deal bonus damage to **minions only** and have the damage scale with AP only or have it scale with AP only and have the AP ratio increase with E's level like {{champion:15}}  Q.\r\n\r\nHis wave clear currently sucks, You need to use all 3 abilities and spend a ton of mana to clear a regular minion wave. Late game is even worse since your W radius is not big enough to get all minions. I think giving his E bonus damage to **MINIONS ONLY!** Would come a long way in making his wave clear better. To reduce the possibility of indirectly buffing support Brand, the following can be done.\r\n\r\n1. Have E deal bonus damage to minions that scales with AP only. Now If you really want to make sure this doesn't impact support Brand, you can go to the second option\r\n2. Have E deal bonus damage to minions that scales with AP only and have the AP ration increase with the level of E. These would be similar to how {{champion:15}}  Q works.\r\n\r\nand example for the bonus damage increasing with both AP and levels would be (10/20/30/40/50% AP) bonus magic damage to minions only at E levels 1/2/3/4/5. This way Brand would need both AP and levels in order for this to be effective, something that support Brand cant get easily.","replies":[{"poster":"Gamma Sector","date":"2019-09-17T18:29:34.279+0000","up_votes":2,"down_votes":1,"body":"two words: FUCK NO. Brand support is a scourge as is. If they give him even better waveclear, well, botlane is now an actual living hell.\n\nEdit: ok ngl I made that comment before even reading it, because Brand support tilts me that much. It wouldn't be bad... But support brands tend to rush liandrys over their support item. Bc you don't need vision when everybody is dead","replies":[{"poster":"Kídá","date":"2019-09-17T21:47:20.959+0000","up_votes":1,"down_votes":0,"body":"If you go the option with AP ratio that starts low and increases with levels I don't think it would be much of an issues. Most Brand supports tend to max Q second because it gives more poke damage early, than E max second so E would only start gaining levels at level 14. Also Brand is a team fight champion so late game you should be grouping up or as a support be with another teammate which doesn't leave much room for him to use his wave clear. In the scenarios where he does use his wave clear it is still not as good since his only mana item is the support item, he cant be excessively using it or else risk going OOM.\n\nMid Brand on the other hand can use the bonus damage to have a better laning phase by pushing and roaming or prevent getting pushed in. Additionally late game he could actually one shot the back line with E instead of using W which lacks an AoE large enough to kill the back line of big minion waves.","replies":[]},{"poster":"MagicFlyingLlama","date":"2019-09-17T18:58:55.259+0000","up_votes":1,"down_votes":0,"body":"Supports having better waveclear is pretty niche, really only matters if your ADC is absolute trash and you are ditching them to carry.","replies":[{"poster":"Gamma Sector","date":"2019-09-17T19:26:21.969+0000","up_votes":1,"down_votes":0,"body":"arguable, it's extremely useful since he already pushes you out of lane so easily. Push enemy out of lane, waveclear the minions in 2 seconds, push to turret and get 2 plates to net 2 kills worth of gold. If your adc isn't complete trash, they can use the kill potential to get stupid fed, on top of the waveclear helping get turret plates.","replies":[]},{"poster":"5050BS","date":"2019-09-17T19:08:10.744+0000","up_votes":1,"down_votes":2,"body":"Brand is not a support.  He like other mages have been pushed bot because of stupid assassin shit in the mid lane","replies":[{"poster":"MagicFlyingLlama","date":"2019-09-18T03:57:37.947+0000","up_votes":1,"down_votes":0,"body":"Brand is a support now, like a lot of mages. It would be great if he was also viable mid, though.\n\nNice to see botlane not just be thresh vs leona snoozefest _every_ game.","replies":[]}]}]}]},{"poster":"Posui Gart","date":"2019-09-18T12:39:30.478+0000","up_votes":1,"down_votes":0,"body":"Or you could just build actual damage-mana-cdr items on him instead of rushing mask. After Ludens he will have 0 waveclear problems","replies":[]},{"poster":"ZephyrDrake","date":"2019-09-18T04:28:24.317+0000","up_votes":1,"down_votes":0,"body":"Fuck no! Brand does not need any more waveclear than he currently has. Not if he is going to keep the obnoxious amount of damage he currently has","replies":[{"poster":"Kídá","date":"2019-09-18T12:28:01.011+0000","up_votes":1,"down_votes":0,"body":"Nah, Support Brand maxes Q second anyway so this wouldn't have much impact on support Brand specially if it requires both AP and levels. Just like how people complained about the E AP ratio increase from 35% to 45% which didn't really do much for support Brand.","replies":[]}]},{"poster":"Malix Farwin","date":"2019-09-18T04:00:23.398+0000","up_votes":1,"down_votes":0,"body":"f--- no.","replies":[]}]}