{"poster":"HushNowGregory","date":"2018-06-28T03:08:20.000+0000","title":"14 day Banned copy paste prelobby player name?","subforum":"Player Behaviour","up_votes":1,"down_votes":1,"body":"I&#039;m a fairly respected individual for not being toxic/rude or disrespectful in my games and irl. I copied and paste joining lobby information to prove to someone that I called a role before someone else. And one of those players happened to say something rude and their name was fairly rude. However I am the one to receive a 14-day suspension:\nWhat most worries me is getting back to Honor level 3\n\nhttps://imgur.com/qx8Rgpt\nhttps://imgur.com/zcSForT\nhttps://imgur.com/R7bAumV","replies":[{"poster":"Aneirin","date":"2018-06-28T03:13:58.148+0000","up_votes":1,"down_votes":0,"body":"Lodge a support ticket with Riot, should be able to get that overturned (and get them to change his summoner name).\nAs far as their automated system is concerned you were being homophobic, it doesn't know you were copying and pasting.","replies":[{"poster":"HushNowGregory","date":"2018-06-28T03:41:20.240+0000","up_votes":1,"down_votes":0,"body":"Just tried to login for a support ticket and it says I must login first even when i'm logged in. I've relogged and restarted and everything. Still says this.\nhttps://imgur.com/a/m8lv97s","replies":[{"poster":"Roguestoney","date":"2018-06-28T03:58:56.342+0000","up_votes":2,"down_votes":0,"body":"Seras comment in this link may help you.\n\nhttps://boards.oce.leagueoflegends.com/en/c/help-support-oce/xowmxp07-cant-submit-support-ticket?comment=0001","replies":[]},{"poster":"HushNowGregory","date":"2018-06-28T03:44:52.245+0000","up_votes":2,"down_votes":0,"body":"I'll try again in a while. Thank you for suggesting the ticket system to me.","replies":[{"poster":"Aneirin","date":"2018-06-28T03:58:04.372+0000","up_votes":1,"down_votes":0,"body":"Yeah it's pretty buggy - I've found using another browser helps. Otherwise try clearing out your cache and rebooting your browser.","replies":[]}]},{"poster":"PLAYER47","date":"2018-06-28T23:16:57.823+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HushNowGregory,realm=OCE,application-id=T8eq2lFQ,discussion-id=mGkF56lt,comment-id=00000000,timestamp=2018-06-28T03:41:20.240+0000)\n>\n> Just tried to login for a support ticket and it says I must login first even when i&#x27;m logged in. I&#x27;ve relogged and restarted and everything. Still says this.\n> https://imgur.com/a/m8lv97s\n\nLooks like you are logged-in on your boards account but not your support account. They are separated.\n\nhttps://postimg.cc/image/f707zsps1/\n\nIf you look at the top right you will see that it shows me logged-in twice.\n\nhttps://tinyurl.com/y8m9klkf\n\nSo I just had the issue that you are having: If you have logged-in on the Boards.oce first it for some reason bugs up the log-in of support.\nI logged-out of boards.oce and then was able to log-in on support and then logged-in on boards.oce to have it both work.","replies":[]}]}]},{"poster":"BearGrillz34","date":"2018-06-28T03:28:39.699+0000","up_votes":1,"down_votes":0,"body":"Wtf, that shouldn't of gotten you banned. Goes to show how flawed the system is. It is based off of reports for automation. \n\nSend in a support ticket and you'll be unbanned, most likely.","replies":[{"poster":"Talon12","date":"2018-06-28T09:13:42.217+0000","up_votes":1,"down_votes":0,"body":"riot's system is perfect, its never wrong, riot won't see a need to overturn the system's judgement. they've ignored people before, why would they stop now.","replies":[{"poster":"BearGrillz34","date":"2018-06-28T13:44:10.473+0000","up_votes":1,"down_votes":0,"body":"It isn't perfect, It's automated. It bans anyone who says like 2 swear words that got reported by more than 2 people from your team.","replies":[{"poster":"Talon12","date":"2018-08-09T00:53:10.169+0000","up_votes":1,"down_votes":0,"body":"*slathers the sarcasm on thicker*","replies":[]}]},{"poster":"Ninox","date":"2018-06-28T10:45:14.067+0000","up_votes":1,"down_votes":0,"body":"I'm pretty sure he just said he got un-banned.\n\n> I was about to login to screenshot to show you the evidence. Unfortunately I cannot do that as my account has been revoked (un-suspended)","replies":[]}]}]},{"poster":"PLAYER47","date":"2018-06-28T05:04:35.829+0000","up_votes":1,"down_votes":0,"body":"From the looks of your screenshots: I notice that the scroll-bar (on the right there); there is no screenshot of the text around the middle part of the wall of text. Seems like you are not showing the full truth there.\n\nhttps://bitport.io/?a=sd9yM9","replies":[{"poster":"HushNowGregory","date":"2018-06-28T05:40:18.611+0000","up_votes":1,"down_votes":0,"body":"It was talk about the meta change in bot lane and random talk about % wins with bot lane comp styles. I was about to login to screenshot to show you the evidence. Unfortunately I cannot do that as my account has been revoked (un-suspended) but it mostly me pulling random statistics from my head to say what I reckon win rates would be with strange combo's","replies":[]}]}]}