{"poster":"Sakuya5","date":"2019-09-01T00:07:53.829+0000","title":"Fps drops","subforum":"Report a Bug","up_votes":2,"down_votes":0,"body":"So i have micro fps drops but the real problem is why is league consuming like 80% of my cpu?? a couple patches ago it barely used 30% wtf??? do you reall suck that much at optimizing this game??","replies":[{"poster":"MagicFlyingLlama","date":"2019-09-01T01:06:23.157+0000","up_votes":1,"down_votes":0,"body":"What hardware and OS?","replies":[{"poster":"Sakuya5","date":"2019-09-01T02:25:43.825+0000","up_votes":1,"down_votes":0,"body":"Windows 10 \nRyzen 3 2200g and rx560","replies":[{"poster":"MagicFlyingLlama","date":"2019-09-01T02:54:21.630+0000","up_votes":1,"down_votes":0,"body":"Peculiar. The 2200G is a single-CCX processor, so it is not the inter-CCX latency issue with the windows scheduler (being a trashfire), which is a huge issue with a couple games, LoL included. If it was an R5 1600 or 2600, there is a program that can fix it by containing the game to a single core cluster.\n\nHigh reported CPU usage on a low core count CPU without SMT is normal, though.\n\nAre you using unlimited fps, or a framelimiter/vsync? Without a limiter, CPU load increases drastically from higher framerates, and as a result the OS typically scheduler splits up threads across more cores to handle the load (which raises the reported utilization), on top of the load itself increasing.","replies":[{"poster":"Sakuya5","date":"2019-09-01T21:56:00.458+0000","up_votes":1,"down_votes":0,"body":"I have it in limited fps but at 240 also like in patch 9.2 i had like +200 fps with everyting in very high and now i have like 140 fps thats kinda strange and now i checked in practice tool and i have 240 fps lmao","replies":[{"poster":"Snake Plizzken","date":"2019-09-02T20:44:55.762+0000","up_votes":1,"down_votes":0,"body":"same i think it has something to do with the last windows update but cant confirm hopefully someone will come up with a fix","replies":[{"poster":"Sakuya5","date":"2019-09-03T00:48:50.249+0000","up_votes":1,"down_votes":0,"body":"Not the windows update since u have the 1803 one","replies":[]}]}]}]}]}]}]}