{"poster":"Coveredinstrings","date":"2016-02-09T12:43:08.039+0000","title":"Ranked for the Cardboard Division","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"Is it just me or has the ranked selection page improved yet the people you&#039;re matched up with become the most unwelcoming experience in this new patch?\r\n\r\nI just started Ranked again after feeling like I should give it ago and noticed the awesome changes so we all get to avoid conflict in choosing our lanes and have fun. So I thought...\r\n\r\nOut of the 10 matches, I only won 2.\r\nNow let me tell you, it wasn&#039;t about the enemy team and how skilled they were (In some cases, that were the case, which I felt the enemy team did deserve the win). However, out of those 10 games, 6 of those games were of players on my team verbally abusing one another. Yes, League is known for verbal abusers and negative comments when it comes to ranked but I noticed how much it has increased. The 2 remaining, was of my team constantly feeling the need to chase the enemy team in the Jungle, only to end up getting ganked (I watched this happened over 5 times in one game, they clearly didn&#039;t learn from the first time).\r\n\r\nI watched 6 games, two people verbally abusing one another blaming each other for either feeding the enemy team or not coming in to help when they &quot;pinged&quot; as though pinging means that we have become slaves and must do exactly that and not use our brains for decision making. During these games, we lost because they wouldn&#039;t stop abusing one another and while we were winning, the enemy team noticed all my team tried to do was chase them in the jungle and then end up dying from being ganked by the whole team.\r\n\r\nNot only was I frustrated, but at the beginning of the game I even stated that multiple people got banned in my previous games for verbal abuse to one another and let it be a friendly game. Did it work? Hell no, I gave it a shot though. I was honestly excited to play ranked games like I normally do and have fun, but each and every game it was either us winning and then my team getting &#039;big headed&#039; and always trying to gank the enemy team rather than focus on objectives. It wasn&#039;t the fact that I lost 3/4 of the games to be put into a rank, because frankly, I don&#039;t mind losing if it&#039;s fair. It was the fact that these loses were due to the communities&#039; pride in not working as a team and being very cocky at their beginning game, only to have them get ganked 24/7 towards the end.\r\n\r\nThe patch is great, ranked game selection has removed the unnecessary comments of &quot;Mid or I&#039;ll feed&quot; comments or instant lock ins of two adc champions wanting to go bot. But for some reason, the matchups with other players has become a really horrific experience, one that I actually (suprisingly) never experienced during my time on League until now.\r\n\r\nPlease Riot, ranked is meant to be fun and about showing how randoms within the League community come together and synergise and play a good game whether winning or losing.\r\n\r\nIs there no &quot;purgatory&quot; match up where all the negative and rude human beings are put together in ranked, just so they understand how negativity gets you nowhere?","replies":[{"poster":"Sailor Jupiter","date":"2016-02-10T04:00:39.409+0000","up_votes":1,"down_votes":0,"body":"I know how you feel Covered, I've also recently had a string of ranked games where the negativity of the team was the deciding factor in who lost the game. \nUntil things shake out a bit more in ranked I think people are going to be a bit more worked up than usual.\nThere isn't a purgatory so the best thing to do is give a detailed report after the game! If they continue to be toxic they'll receive punishments such as chat restrictions or bans.","replies":[{"poster":"Coveredinstrings","date":"2016-04-06T04:28:11.412+0000","up_votes":1,"down_votes":0,"body":"It's gotten so much better after going up a few divisions, still bronze but I noticed Bronze III is where all the toxicity lurks, pretty odd how a division changes people's personalities right away haha","replies":[]}]},{"poster":"ayaya cutie","date":"2016-02-11T04:00:50.434+0000","up_votes":1,"down_votes":0,"body":"Just ignore them mostly /mute helps ahah your bound to get those players but just report them and see if they get banned{{summoner:11}}","replies":[]},{"poster":"Blackavar","date":"2016-02-10T07:39:24.553+0000","up_votes":1,"down_votes":0,"body":"This happens all the time in the rank i'm in (Bronze) and I must say that the toxicity is one of the worst things that are in this game. Riot is trying to reduce the number of toxic people in matches but they can't do much if you don't notify them by reporting toxic players at the end game screen.\n I'd recommend muting the negative players and don't reply to them if they say anything out of order. Don't worry about your rank now, i'm sure you will get higher. Also, if the team you are getting places in is a problem, play with friends! I believe you can play with 4 other people at once.","replies":[]}]}