{"poster":"Packun Flower","date":"2017-04-06T22:51:28.710+0000","title":"Can we maybe NOT remove the crit reduction from Omen?","subforum":"Gameplay","up_votes":241,"down_votes":26,"body":"I would like {{champion:157}}  to have at least a little bit of counter play.\r\n\r\nThanks.","replies":[{"poster":"Chønklord","date":"2017-04-07T01:47:44.852+0000","up_votes":93,"down_votes":0,"body":"#we need more crit reduction items not less","replies":[{"poster":"Chief Mayonnaise","date":"2017-04-07T02:39:18.585+0000","up_votes":4,"down_votes":47,"body":"Yeah, cause fuck crit adcs, the class thats **SUPPOSED** to be strong against tanks.","replies":[{"poster":"Big Lincoln","date":"2017-04-07T02:41:58.626+0000","up_votes":42,"down_votes":4,"body":"240% crit damage is not the end of the world when you get {{item:3036}} 15% bonus damage against them","replies":[{"poster":"Chief Mayonnaise","date":"2017-04-07T02:53:08.597+0000","up_votes":3,"down_votes":22,"body":"It's less that randuin's exists and more that I see no reason that there should be more crit reduction. I don't see why there needs to be more counterbuilding against the class thats supposed to counter tanks. Besides, Randuin's  is still a strong counter item due to the auto attack slows and Tabis is as strong as ever.","replies":[{"poster":"SweedishGunner","date":"2017-04-07T07:23:49.003+0000","up_votes":25,"down_votes":0,"body":"Because it's not just ranged ADC's that crit. \n\nTrynd, Yas, even things like Talon and Rengar all crit.","replies":[{"poster":"RFPSHBYQl7","date":"2017-04-07T07:45:00.870+0000","up_votes":2,"down_votes":19,"body":"A tank is not supposed to win a 1v1 against a Tryndamere in most of the cases anyway?","replies":[{"poster":"Spoofghoul","date":"2017-04-07T10:27:57.409+0000","up_votes":26,"down_votes":0,"body":"it's isn't just to 1v1\n\nsometimes you just don't want to die\n\nthats all","replies":[]}]}]}]},{"poster":"Wimbledofy","date":"2017-04-07T03:27:51.398+0000","up_votes":10,"down_votes":0,"body":"it doesn't become 240% crit damage. It reduces that damage from the whole thing by 10%. So if an adc has ie and has 100 ad, he will do 250 damage if they don't have randuins (assuming armor doesn't exist). If the enemy has randuins they will do 250 - .10 x 250= 250-25= 225 damage.","replies":[{"poster":"junglerboy16","date":"2017-04-07T05:32:07.495+0000","up_votes":3,"down_votes":4,"body":"Still, using that same logic and math, 225% damage gets amped back up to 225 + .15 x 225 = 225 + 33.75 = 258.75\n\nPoint being that even with a crit damage reduction item, which is also relatively expensive for a tank item, ADCs are still going to deal plenty of damage.","replies":[{"poster":"Wimbledofy","date":"2017-04-07T05:41:59.872+0000","up_votes":10,"down_votes":0,"body":"i was just explaining how the math worked","replies":[]}]}]}]},{"poster":"DarkPh0enix","date":"2017-04-07T09:00:05.143+0000","up_votes":3,"down_votes":6,"body":"ADC's are not supposed to be strong against tanks, lol.\n\nOther than Vayne, no Tank cares whther or not an ADC has crit. Who do you think is going to win in a 1v1, Fucking Caitlyn or Nautilus?\n\nADC's exist because of their high overall damage and how fast they can push, they do NOT exist to kill tanks, other than Juggernauts, no class by itself can truly 1v1 a tank.","replies":[{"poster":"PermabannedGaren","date":"2017-04-07T15:45:32.048+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=FK LANA,realm=EUNE,application-id=3ErqAdtq,discussion-id=TlV7xMBg,comment-id=000c00010002,timestamp=2017-04-07T09:00:05.143+0000)\n>\n> ADC&#x27;s are not supposed to be strong against tanks, lol.\n\nWrong.\n\n> Other than Vayne, no Tank cares whther or not an ADC has crit. Who do you think is going to win in a 1v1, Fucking Caitlyn or Nautilus?\n\nSix items? Caitlyn, probably effortlessly.\n\n> ADC&#x27;s exist because of their high overall damage and how fast they can push, they do NOT exist to kill tanks, other than Juggernauts, no class by itself can truly 1v1 a tank.\n\nDivers and skirmishers eat tanks alive 1v1. There is not a single tank in the game Yasuo doesn't shit on 1v1 at six items, much less a duelist like Tryndamere, Master Yi, or Xin Zhao. Even some assassins like Rengar, or some mages like Cass, 1v1 tanks.","replies":[{"poster":"DarkPh0enix","date":"2017-04-07T17:15:47.953+0000","up_votes":1,"down_votes":8,"body":"Caitlyn, 1v1ing Nautilus effortlessly at 6 items? Lol, no\n\nFull damage Rengar can't 1v1 a tank, full damage cass can probably not 1v1 a tank.\n\nAlso, if a tank dodges Yas' q, he is screwed, so no. \n\nOther than Tryndamere and his refusal to die, Master Yi and Xin will have trouble killing a full build Nautilus; even if they do manage to eventually kill him.","replies":[{"poster":"Orangesilk","date":"2017-04-07T17:42:26.479+0000","up_votes":5,"down_votes":1,"body":"ADCs, as opposed to assassins or mages are supposed to be the guys that scale better with items, that's why you give them a whole lane and a nanny, and a second nanny with smite so they can get their gold. So, when the ADC finally gets his items, they absolutely stomp over anything that can't kill them fast enough, like tanks.","replies":[{"poster":"DarkPh0enix","date":"2017-04-07T17:46:11.637+0000","up_votes":1,"down_votes":2,"body":"In what kind of fantasy land can a Caitlyn 1v1 a Nautilus with these items? \n: {{item:3110}} {{item:3025}} {{item:3047}} {{item:3068}} {{item:3001}} {{item:3065}} \n\nNot only will Nautilus CC the fuck out of her so she can't attack, she will be slowed to death and get dealt insane damage if she tries to run. Traps mean nothing. ADC's can kill anything IF protected, but their dumbass glass canon builds are just that, glass canons. If they get caught, they die. That's the reality of it.","replies":[{"poster":"Orangesilk","date":"2017-04-07T20:15:54.421+0000","up_votes":4,"down_votes":0,"body":"Like this {{item:3072}}. Nautilus has a single knockup, the rest are roots and slows so she can keep firing during those. And he deals less damage than she heals up. She can literally sit there shooting at his inefficient ass (Seriously, that build has very little HP) and healing up the damage he deals.\n\nNow, if it was a fighter, an assassin or a mage it'd be a different story, but a tank? pfft, ADCs are made to eat those alive. Lifesteal exists precisely so ADCs eat tanks whole in any circumstance. Which is great because aside from ADCs and some fighters, most people wouldn't stand a chance against a full-item tank.","replies":[]}]}]}]}]}]}]},{"poster":"Elikain","date":"2017-04-07T02:28:26.184+0000","up_votes":2,"down_votes":29,"body":"No, we don't.\nWhat's funny enough is that no one even bought Randuin's when faced against a crit champion, even as a tank. So what's this about \"i need counterplay items\" when no one even thinks about counterplay, when no one even itemizes against their matchup accordingly?\n\n>Randuin's is possibly too weak in this version, though it still is the strongest of the HP/Armor items defensively, and has the lowest price point. As mentioned very briefly, there are some possible change to penetration coming that perhaps will help with this concern.\n\n>One thing I didn't get into in the main post (but am happy to here) is that the removal of Crit Damage Reduction from Randuin's is intended to head off and/or defuse some power creep in the shop, especially since crit users are generally supposed to be successful at dealing damage to tanks. Some of these changes may result in outlier champions that have special crit interactions, and in that case, we'll need to address those case by case.\n\nhttps://boards.pbe.leagueoflegends.com/en/c/champions-gameplay-feedback/8g2H4vjy-midseason-durability-feedback","replies":[{"poster":"Chønklord","date":"2017-04-07T03:11:40.511+0000","up_votes":13,"down_votes":1,"body":"Go play something like {{champion:111}}, build: {{item:3742}} {{item:3143}} {{item:3110}} {{item:3065}} {{item:3068}} {{item:3047}} \n\nand watch yourself get deleted by a comp like this: \n\n{{champion:104}} {{champion:236}} {{champion:157}} {{champion:63}} {{champion:134}}","replies":[{"poster":"Wimbledofy","date":"2017-04-07T03:29:06.514+0000","up_votes":5,"down_votes":11,"body":"well yeah he should die pretty quickly to a full damage team","replies":[{"poster":"Chønklord","date":"2017-04-07T03:44:48.629+0000","up_votes":9,"down_votes":1,"body":"in 3 seconds?","replies":[{"poster":"Wimbledofy","date":"2017-04-07T04:12:28.029+0000","up_votes":8,"down_votes":5,"body":"assuming he gets hit by everything i don't see why he shouldn't.","replies":[{"poster":"Chønklord","date":"2017-04-07T04:15:10.108+0000","up_votes":15,"down_votes":5,"body":"Then why bother playing tanks at all? Everyone can just go full damage teams and whomever gets the kill secure first on their counterpart/enemy team, wins the game.\n\nImagine, games could be over under 20-30 minutes _all the time_.","replies":[{"poster":"King of Mongoose","date":"2017-04-07T04:48:59.354+0000","up_votes":9,"down_votes":7,"body":"because tanks aren't supposed to be raid bosses who can survive against a fully dedicated mixed damage team that builds armor pen and has %hp magic damage for like 10 seconds","replies":[{"poster":"Kilanost","date":"2017-04-07T13:59:53.127+0000","up_votes":9,"down_votes":0,"body":"If they can't survive for an extended amount of time, they can't do anything.  The tank role is not mean to go in and die for the cause.  It's mean to go in, survive, and disrupt.  You can't disrupt if you're dead.  You can't deal damage because you built full tank.  Basically, if you can't survive extended periods under heavy damage, your team is playing a 4v5.\n\nThis is why riot recently mentioned they're looking at armor pen stats along with the reworks.","replies":[{"poster":"King of Mongoose","date":"2017-04-07T15:28:51.882+0000","up_votes":1,"down_votes":2,"body":"but full tanks still have lots of damage in their bases and in the fact that a lot of them have %hp damage\n\ncurrent tanks still distrupt but with cc. they shouldn't be able to just sit on your team for like 10 seconds. if they can then they should have their base damages and %hp damages removed.","replies":[{"poster":"Kilanost","date":"2017-04-07T16:27:50.360+0000","up_votes":4,"down_votes":0,"body":"If you die because you let {{champion:154}} sit on top of you for 10 seconds to kill you with his W, you deserve to die because you were out of position OR your team deserves to lose because no one peeled the zac after the engage.  I use zac as the example because he has %health damage and people whine about him a lot.  Btw, say an adc (because adcs complain the most about tanks) has 2k health at level 18.  zac's %health ability is  dealing 260 damage to you before resistances which he basically has to be standing on top of you to deal.  The only chance zac has to outright kill anyone as full tank is if he lands the E, hits all the bounces on his ult on them, never lets them get out of range of his W, and nails the Q and even then he'll still likely have to hit at least one more E.  This whole initial rotation happens over the course of 5 seconds at which point anyone could have CCed him to peel.  After that he can only jump in (with a telegraphed skill shot that gives an indicator of where he's landing) once every 7 seconds.  Most full tank champions follow a similar pattern of slow damage, being kited, and reengaging.\n\nSimply put, tanks aren't actually the ones killing you.  They're just the ones punishing you when you get out of position aka engaging intelligently.  \n\nWhats that?  You're in the back line and still got nailed by the zac E?  This is when we look at adc kits and I ask you \"why didn't you punish it?\"  \nCaitlin- drop a trap where he's going to lane and E away.\nTristana- jump away, R him into your tank\nJinx drop chompers and take a little damage and walk away\nvayne- tumble away, potentially into a condemn\nlucian- dash away and ult him\ndraven- CC him mid jump, take no damage and kill him\nkallista- autoattack kite him\nmiss fortune- E take a little damage and sprint away\nKog Maw- Die unless you get peel over the next 8 seconds or are fed enough to just kill him anyway.\nAshe- arrow and kite with built in slows\ntwitch- Take some damage, go invisible and walk away\nVarus-pray you have flash up\n\nFor good measure I will also include the following:\nGraves- basically a bruiser, builds maw, and has a dash. He's fine.\nQuinn- take some damage, vault away and punish zac.\nTeemo- you drop a mushroom and die you piece of shit. good riddance.  \nMages- zhonyas and walk away basically for free after your team CCs him down.\n\nSo unless you are playing varus, teemo, or kog maw, you've got a way to deal with tank engage.","replies":[{"poster":"TequilaZombie","date":"2017-04-07T17:46:38.240+0000","up_votes":2,"down_votes":0,"body":"BTW Kog can probably facetank a Zac anytime after 4 items. Unless it's full AP Zac. But then he's an Assassin. And a bad-ish one at that.","replies":[]}]}]}]}]},{"poster":"Elikain","date":"2017-04-07T12:08:19.642+0000","up_votes":2,"down_votes":0,"body":"You're thinking of raid bosses, not tanks.\nOne thing is to get buttblasted by 5 damage sources and not last even 5 seconds, the other thing is when one champion does that to you with these items and you don't last 5 seconds.","replies":[]},{"poster":"SH Azykan","date":"2017-04-07T05:53:20.440+0000","up_votes":5,"down_votes":3,"body":"because they blew all of their skills to kill that 1 tank, who probably used his lockdown on someone on their team and his carries can shred the enemy team who focused the tank?","replies":[]}]},{"poster":"Kilanost","date":"2017-04-07T13:55:03.871+0000","up_votes":3,"down_votes":0,"body":"The entire tank role is based on survivability and disruption.  Without the former, they cannot do the latter.","replies":[]}]}]},{"poster":"deadlychuck","date":"2017-04-07T11:01:05.797+0000","up_votes":6,"down_votes":1,"body":"You say that as if 80% of team comps aren't currently 4 high damage champions and a mage who's failed rework put them into the support role.","replies":[]}]}]},{"poster":"Thilmer","date":"2017-04-07T10:23:43.698+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Elikain,realm=EUNE,application-id=3ErqAdtq,discussion-id=TlV7xMBg,comment-id=000c0000,timestamp=2017-04-07T02:28:26.184+0000)\n>\n> No, we don&#x27;t.\n> What&#x27;s funny enough is that no one even bought Randuin&#x27;s when faced against a crit champion, even as a tank. \n\nExcuse me, but anyone with half a brain builds Randuin when figthing against a crit champion, specially shits like Yasuo or Jhin that have automatic crits.","replies":[{"poster":"Elikain","date":"2017-04-07T12:32:25.574+0000","up_votes":4,"down_votes":2,"body":"> anyone with half a brain\n\nYou're clearly overestimating how many people actually use their brains to play League.\nEven using half comes as a big challenge, from my experience. When i expect that my team will itemize accordingly to counter the enemy team, i get disappointed because all the items they need to deal damage to high resistance targets end up as 5th/6th purchases (Void Staff/LW items). Most of the times, they can't even finish them because they waited too long. Even if i tell them before all of the shit goes down what we'll need to rush because this and that team comp can screw us over with one stat type, they still ignore every bit of common sense and do what they want. Then they get shat all over and it's someone else's fault they aren't doing good.\n\nObviously letting the enemy team walk over you, because you were too thickheaded to buy one counter item sooner, is not good for your team's chances of victory. If you're one of those rare players who is using their brain to its minimum capacity to understand such a simple concept, all the power to you. Players like you are very scarce around my parts which leads me to believe the dumbasses rigidly follow their guides to the letter, if god forbid, they didn't take it upon themselves to innovate a build.\n\n\nA lot of players simply like to skip steps and follow someone else's directions. If you don't understand what you're doing, how can you even attempt to replicate someone's success in your games?","replies":[]}]}]}]},{"poster":"Falling Ic3","date":"2017-04-07T00:17:38.532+0000","up_votes":34,"down_votes":0,"body":"randuins is shit if those changes happen","replies":[{"poster":"RainbowIcee","date":"2017-04-07T01:05:03.003+0000","up_votes":10,"down_votes":0,"body":"Clearly, armor pen is still very strong in the game so any dmg reduction is highly welcomed over 10 extra armor. When I play ADC once i get my armor pen item and have crit everyone feels like butter. This crit reduction is essential, if anything it's not that strong maybe that's why they're removing it but i still rather have that over nothing. I don't get that mentality of the balance team, people don't use it much let's remove it, it's situational let's remove it, it's not making a huge impact let's remove it. WTF? i want my atma's back.","replies":[]}]},{"poster":"Ariel the Cruel","date":"2017-04-07T01:49:24.578+0000","up_votes":27,"down_votes":3,"body":"Omen is counter-build, not counter-play.","replies":[{"poster":"Inuyasha99999","date":"2017-04-07T02:24:30.950+0000","up_votes":1,"down_votes":13,"body":"itemization trapping my dear bronze. You pick ap toplane so that your adc hurts him more because he is itemization for your AP dmg","replies":[{"poster":"Ariel the Cruel","date":"2017-04-07T03:30:53.141+0000","up_votes":18,"down_votes":0,"body":"I'm unranked, not bronze.\n\nGet it right, scrub! ;p","replies":[{"poster":"INoble KnightI","date":"2017-04-07T03:44:00.036+0000","up_votes":5,"down_votes":0,"body":"So does that make you higher rank than Bronze or lower?","replies":[{"poster":"Ariel the Cruel","date":"2017-04-07T04:05:43.876+0000","up_votes":21,"down_votes":3,"body":"Trick question.\nRank is a system of comparison. I do not exist within that system of comparison. Therefor, I can not be compared.\n\nMy skill level is beyond the identification of rank. As such, attempts to lump me with the ranked scrubs are insulting at worst and circumstantial at best. ;p","replies":[{"poster":"INoble KnightI","date":"2017-04-07T11:12:35.771+0000","up_votes":1,"down_votes":0,"body":"That and at least you have the potential of being good instead of being confirmed bad lol","replies":[{"poster":"Kilanost","date":"2017-04-07T14:04:13.691+0000","up_votes":2,"down_votes":0,"body":"But then aren't you stuck in the super position of being both good ANd bad?! Lol","replies":[]}]}]}]}]}]}]},{"poster":"Sasogwa","date":"2017-04-07T01:45:05.506+0000","up_votes":22,"down_votes":1,"body":"I hate how Riot changes Randuins to a cheaper item with less stats. WE WANT TANKIER ITEMS THAT COST MORE NOT ITEMS THAT ARE CHEAPER EVEN IF MORE COST EFFICIENT (and being more cost efficient is even debatable) FFS.","replies":[{"poster":"Ariel the Cruel","date":"2017-04-07T01:50:22.983+0000","up_votes":2,"down_votes":0,"body":">THAT COST MORE\n\n{{item:2049}} That's one perspective. . .","replies":[]}]},{"poster":"TheJakeinator","date":"2017-04-06T22:54:03.400+0000","up_votes":2,"down_votes":18,"body":"Cause mid laners were building it against him?","replies":[{"poster":"xWaters","date":"2017-04-07T01:15:31.820+0000","up_votes":20,"down_votes":0,"body":"Is building defensive a problem? Is it a problem when yasuo gets maw?","replies":[]},{"poster":"NineTailedMystic","date":"2017-04-07T01:16:38.770+0000","up_votes":20,"down_votes":0,"body":"And? I don't see the issue if an APC wants to willing give up AP for a Randuin's so they don't immediately die to a Yas.","replies":[{"poster":"Elikain","date":"2017-04-07T02:30:34.738+0000","up_votes":2,"down_votes":1,"body":"No AP mid laner was ever buying Randuin's to counter Yasuo...","replies":[{"poster":"NineTailedMystic","date":"2017-04-07T04:51:30.707+0000","up_votes":3,"down_votes":0,"body":"I didn't say they were or were not. In fact, it's likelier that they'd give up their Sorc Shoes for Tabis instead, but I was saying that there shouldn't be an issue if they do that. Giving up AP for a strong counteritem.","replies":[]}]}]}]},{"poster":"PermabannedGaren","date":"2017-04-06T23:45:05.731+0000","up_votes":17,"down_votes":1,"body":"I main Yasuo and I want it back tbh. Randuin's Omen is one of the few items that meaningfully lowers the damage of an ADC or crit-based melee carry like Yasuo or Tryndamere late game.","replies":[]}]}