{"poster":"Apocrypha","date":"2016-11-24T00:58:45.987+0000","title":"Rework de asesinos","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"No creen que dejaron campeones muy op y que mataron a otros onda a {{champion:55}}  le quitaron su esencia aparte que ya no la pickea ni dios por eso de estar buscando las dagas le da un counter play gigante, y para que hablar de {{champion:238}} le mandaron tremendo nerfeo que lo disfrazaron de rework le quitaron el da&ntilde;o del W su E tienes mas enfriamiento para poder volver a usar la sombra de la R tienes que esperar 1.5 segundos el bono de AD de ulti es una mierda por que si te te toca un team en contra con mucho AP no te sirve de nada o si te toca un adc que se arma velocidad de ataque igual en poca palabras lo mataron, a {{champion:107}} lo dejaron como una especie de dios que puede cruzar las grieta de esquina a esquina con la R le quisieron hacer mas counter play pero lo dejaron aun mas roto.\r\n\r\nAhora me van a decir main zed anda llorar a otro lado, puto main zed y otras cosas pero es mi simple opini&oacute;n quisieron hacer un meta de asesinos pero les salio como el ojete matando a los 2 asesinos por excelencia y dejando a otro como un dios que te puede seguir de una esquina del mapa a la otra solo para matarte, esa es mi humilde opini&oacute;n.\r\n\r\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Yo la amaba wum","date":"2016-11-24T01:11:52.909+0000","up_votes":2,"down_votes":0,"body":"Le quitaron su esencia a Katarina? si ahora veo que salta y salta y salta y salta y salta, antes hacia lo mismo, solo que ahora es mas \"\"\"\"DIFICIL\"\"\"\", he visto Katarinas que ya le han tomado el ritmo después del Rework y son un dolor de pelotas atraparlas... Lo de Zed si estoy de acuerdo, fue mas un nerfeo que un rework, eso no te lo discuto, lo de Rengar tambien tienes toda la razon, la pasiva del collar y su W, estan asquerosamente rotas, lo de la R de Rengar ya no es taaanto problema por que ahora lo vez de mas lejos y sabes mucho antes si es que no te ultea al lado que te anda buscando (por la cara que aparece al momento de el ultear), campeones quedaron muy mal? Si, quienes? Zed, Campeones quedaron algo fuertes?: Rengar, K6 (Este csm juega URF...), Talon (1200 de sangrado OP), Kakali, no se de donde sacaron que estaba debil, si yo veo que aunque vaya 0/5 se borra a tu adc de una Q+R igual, pero bueno. Campeones peores que los mencionados anteriormente? Si, hay campeones mucho peores, ademas este \"Meta de asesinos\" no existe, sigue siendo meta de tankes, los tankes están demasiado OP, aguante y daño descente, que mejor.","replies":[{"poster":"CoronavirusC0V","date":"2016-11-24T02:58:45.961+0000","up_votes":1,"down_votes":0,"body":"a rengar ya lo nerfearon en el pbe, kata si la verdad es molesta cuando la agarra alguien que sabe usarla, talon,akali y k6 es aburdo el daño que hacen sobre todo akali,esa cosa de una q basico media vida te saca y se quejan de rengar, esta lo hace desde el min 1","replies":[]}]},{"poster":"nifu","date":"2016-11-24T01:26:31.881+0000","up_votes":1,"down_votes":0,"body":"estuve practicando la LB . la ulti esta buena es un ward de todo el mapa. porque para hacer engaños es como querer meter la ulti de nunu tiene que ser elo muy bajo.\nlo que le destaco es la limpieza de oleadas .lvl 2 le das un basico a cada minions tiras una w a la oleada de 6 minions y tiras q . la limpias toda. pero esa pasiva es lo que esta rota y 1.5 seg para activarla es algo riesgoso meterla o pegarla. aparte con un poco de MR ya no deletias nada y estas muy condicionado a tener una buena fronlane que hoy por hoy encontras akalis top.","replies":[]},{"poster":"KarmaUnder","date":"2016-11-24T01:23:23.610+0000","up_votes":1,"down_votes":0,"body":"katarina es solo acostumbrarse :D mira a box box sino xD\ny rengar tranquilo que ya lo nerfearon en el pbe :P\nlo de zed era nesesario a decir verdad, tenia 90% de ban rate antes del rework... eso no era sano\n\nTranquilo hombre es pretemporada, es normal el desbalance, despues de todo para eso es la pretemporada, meter nuevas cosas e ir balanceandolas de a poco antes de que arranque la season :D","replies":[]},{"poster":"Darkmastah","date":"2016-11-24T01:17:25.526+0000","up_votes":1,"down_votes":0,"body":"Al que aventajaron fué al payaso de Shaco, ahora no lo alcanzas ni con Talon, el desgraciado se desaparece cada dos segundos.","replies":[]}]}