{"poster":"Aeonian Sentinel","date":"2018-01-05T00:45:22.717+0000","title":"Good score no S","subforum":"[ARCHIVED] Help & Support","embed":{"description":"MagicSheld / Gold 4 0LP / 180W 145L Win Ratio 55% / Darius - 24W 12L Win Ratio 67%, Thresh - 22W 8L Win Ratio 73%, Aatrox - 12W 10L Win Ratio 55%, Lee Sin - 8W 13L Win Ratio 38%, Corki - 11W 5L Win Ratio 69%","url":"http://na.op.gg/summoner/userName=MagicSheld","image":"http://opgg-static.akamaized.net/images/logo/2015/reverse.rectangle.png"},"up_votes":1,"down_votes":0,"body":"So I'm not sure why but even if I got good score with Lulu, I never seem to be getting any S. The link leads to my match history, I'm wondering if the requirement of getting an S like least an S- has raised, or it's just my score isn't good enough.","replies":[{"poster":"Son of Ornn","date":"2018-01-05T04:21:49.996+0000","up_votes":1,"down_votes":0,"body":"Yoona and Kokua both make excellent points, so much so that I won't bear repeating their words and stealing their thunder.\n\nAnother thing to keep in mind that I can think of is that, until just recently, Lulu was one of the most meta Support Champions during the 'Rush Ardent Support' meta. With that said a lot of players will try to use her with that in mind, and thus that means you'll have more players to compete against in order to prove your skill. I can say though from what I see your Lulu games aren't too shabby, so keep up the pressure and I'm sure you'll nab a solid S in no time!\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Real Sexy Yoona","date":"2018-01-05T02:59:15.844+0000","up_votes":1,"down_votes":0,"body":"I have 14 M7, 10 M6 Champions and have many more M7, M6 shards laying around in the loot section. Just don't have the BE to activate them. Also I have around 60 chests this season so I do actively get a lot of S-s, Ss and S+s. \n\nThe grading system is always a tad bit shaky with the support role imao. \nThere are many aspects like warding/de-warding etc. but the two most important aspects of getting an S as a support is probably 1. not dying 2. stack up on assists or even kill secures. \n\nLike I had games where I was 1/2/20+ and got an S-. \nI've seen one positive KDA in ur op.gg with lulu (of the recent 20 games) and that 4/3/11. \n\nTry to get a strong positive KDA like 3/0/11 or something. \nthe \"I refuse to die for my ADC\" mentality isn't something I have in ranked games. But in norms, I often go in with the goal of getting a chest or a m6, m7 shard, so be a little bit selfish. \nTry not to die and earn gold through assists and via support item as much as possible. (If you have relic shield, actively cull minions not only in laning phase, but during sieges, when your team groups, mid game- you'll be surprised how much gold is put to waste not procing relic shield culls) \n\nHope this helps.","replies":[{"poster":"Kokua","date":"2018-01-05T03:26:25.539+0000","up_votes":1,"down_votes":0,"body":"KDA is more than just having more kills than deaths, especially for support. Your KDR should be above 2:1 just to be average, and higher if you want a better score. 4/3/11 looks positive to someone who is focusing on kills and deaths, but it's actually a pretty solid 5:1 KDR. Just above that is a 2/3/14 game, and though it may look less impressive, it's actually a 5.33:1 KDR, having 1 more kill assist added in there. And then there's his 2/2/26 game with an amazing 14:1 KDR.\n\nYou are being compared to other people who played the same champion in the same role. That means that all champions are graded on different scales. The requirements for S ranks are ALWAYS rising as people obtain it, as you have to be in that top percentage to obtain it.","replies":[]}]}]}