{"poster":"Thampon","date":"2016-09-24T16:41:49.746+0000","title":"Vissza esés. Trollok. Gyerekek!","subforum":"Általános beszélgetés","up_votes":1,"down_votes":3,"body":"**Napot! Gyors leszek, nagy nehezen fel mentem Bronz1-ig és onnantól jó pár napja csak vesztek! Olyan embereket kapok hogy az valami elképesztő! Nem hiszitek el komolyan mondom be afkol, pokemon go-zik közben és nem figyel, feedel természetesen, trollkodik, és még jó pár dolgot sorolhatnék! Pár nap alatt vissza is estem Bronz4-be baszki hát nemár!!!! Az embernek a kedve is elmegy a játéktól mikor költök is rá, hónapok kellenek hogy valamit elérj és a többi troll meg kisgyerek meg idióta stb pár óra-nap alatt ezt meg semmisíti! Komolyan mondom már inkább Bot-ozgatok csak hogy legyen egy kis siker élményem! Ezeket vagy ki kéne szelektálni vagy legalább 14 éves korhatárra megcsinálni vagy ha már ranked akkor legyen ranked ne az legyen hogy b1 vagy, vagy akármilyen és össze dob egy b5-el vagy akár fordítva hanem ha már b1 akkor az b1-esekkel játszon vagy bármi mert ez borzasztó komolyan mondom! De szerintem nem csak én vagyok ezzel így! Elnézést de a vérnyomásom már a plafonon! Köszönöm!**","replies":[{"poster":"Kecses","date":"2016-09-26T09:19:48.750+0000","up_votes":1,"down_votes":0,"body":"Én 18 életévhez kötném a rangsorolt játékot és igazolvánnyal kellene igazolnod. 18 éves fejjel talán már jobban tud gondolkodni, hiszen iskolákkal is végzett és egy kicsit tanultabb embernek kell lennie. :) Egyszer egy stream-en láttam egy 8 éves gyereket aki játszott ezzel a játékkal. Az asztal felett csak a feje látszott semmi más, olyan kis picike volt. Hát komolyan elsírtam magamat tőle. :')","replies":[]},{"poster":"HeadRekt1995","date":"2016-09-25T09:53:35.467+0000","up_votes":1,"down_votes":0,"body":"Nem tudom mit sírsz :)\nNem csak te éled át, ez ellen annyit tudsz tenni, hogy fejleszted a skilled,\nés megpróbálod az 1v5-őt :D","replies":[{"poster":"Thampon","date":"2016-09-25T20:39:42.404+0000","up_votes":1,"down_votes":0,"body":"Na ja :D","replies":[]}]},{"poster":"Imiking ","date":"2016-09-25T05:19:44.796+0000","up_votes":1,"down_votes":0,"body":"Pont én is hasonló posztot akartam csinálni, de beelőztél. Idén, feladom,de csak akkor ha nem szeretne velem rankedezni valaki. \nCsak 1 mód van az elo hell kijutásából:Haverok.\nNe szomorkodj, rajtad kívül több ezer LoLozó van úgy vele, hogy ebből lehetetlen kijutni(köztük én is).\n\nUi.:Ha sokat nyersz sorozatban, több rankot is átugrathatsz(pl:B3-ban nyersz 20-at sorozatban, bedob Silvernek/B1be.\nAmúgy meg nem a rank a lényeg, hanem a csapatmunka. :)","replies":[{"poster":"Shikaichi","date":"2016-09-25T13:01:34.257+0000","up_votes":1,"down_votes":0,"body":"Akkor mondjuk miért nem fogtok össze ketten? :)","replies":[]}]},{"poster":"Shikaichi","date":"2016-09-24T16:50:12.996+0000","up_votes":1,"down_votes":0,"body":"Mi a bizonyíték arra, hogy egy 14 éven aluliaknak nem ajánlott játékot, majd nem fog játszani fiatalabb is? Hiába kéri regisztrálásnál a játék, hogy hány éves vagy, lehet hazudni. \nTrollok ellen? Ne foglalkozz velük! Ne bosszantsd föl magad rajtuk, mert azzal csak a saját teljesítményed csökken és persze, hogy lentebb csúszol. Légy higgadt, koncentrálj a játékra amennyire tudsz. A feeder sem mindig direkt feedel, lehet erősebb az ellenfél, lehet rossz napja van, de ha megszólják érte, akkor még rosszabb lesz neki. Ne másokban keresd a hibát, hanem te próbálj meg fejlődni! Ja, és reportold a rosszakarókat! :)","replies":[{"poster":"Thampon","date":"2016-09-24T16:51:36.341+0000","up_votes":1,"down_votes":0,"body":"Köszönöm. Ez jó, megfogadom. Bár már próbálkoztam ezzel is. De az embernek egy idő után már el megy a türelme pedig én nagyon türelmes egy ember vagyok","replies":[{"poster":"Shikaichi","date":"2016-09-24T16:54:03.497+0000","up_votes":1,"down_votes":0,"body":"Nincs mit! :)","replies":[{"poster":"Thampon","date":"2016-09-24T17:01:22.125+0000","up_votes":1,"down_votes":0,"body":"Mondanám, hogy gyere egyet, nézd meg mi folyik az én meccseimen","replies":[{"poster":"Shikaichi","date":"2016-09-24T17:02:38.295+0000","up_votes":1,"down_votes":0,"body":"Bocsi, nem nagyon rankedezek, a tíz besorolót sem játszottam le még.","replies":[{"poster":"Thampon","date":"2016-09-24T17:04:28.920+0000","up_votes":1,"down_votes":0,"body":"Rendbe","replies":[{"poster":"Thampon","date":"2016-09-25T04:29:51.057+0000","up_votes":1,"down_votes":0,"body":"http://matchhistory.eune.leagueoflegends.com/hu/#match-details/EUN1/1522958131/216723539?tab=overview Kár, hogy nem lehet vissza nézni! Ismét esek vissza, a feljebb jutás ezen múlott, JG voltam erre kiválaszt egy Nunu-t és egy smite-ot, amivel tudja elég jól ks-elni a jg-met, bárhova mentem, bármit csináltam afkoltam vagy akármi, követett és le smite-olt minden jgmet előlem. Ne legyek ideges? Csak kérdezem. Hogyan tudnék az ilyenekre jó szemmel nézni? Vagy nem idegesnek lenni? Taníts! Minden mecsemen van troll! ha hiszed, ha nem","replies":[{"poster":"Imiking ","date":"2016-09-25T05:23:15.962+0000","up_votes":1,"down_votes":0,"body":"Nekem is minden meccsem tele van trollokkal, feederekkel, flamerekkel... \nAsszem ezt nevezik elo hellnek.","replies":[]},{"poster":"HeadRekt1995","date":"2016-09-25T09:55:48.373+0000","up_votes":1,"down_votes":1,"body":"kezdje ő a junglezast írd neki. ok np i give you jg. egyszer neki ugrik, és smiteold be.\nDe az is elég jó ha azt írod  /all Please report this guy. He is trolling in ranked, he stole my jg monsters everytime!.\nAz enemy ha rendes írni fogják hogy reportolják, és elég egy olyan ranked meccsa hol min b reportolják 4 -5 en már kapja is a chat bant meg az egyéb elvonásokat.{{champion:53}}","replies":[]}]}]}]}]}]}]}]}]}