{"poster":"junglerboy16","date":"2015-02-02T14:30:46.687+0000","title":"QoL for Swain.","subforum":"Gameplay","up_votes":37,"down_votes":1,"body":"Just a really simple idea: Could we get an indicator on the HUD buff bar that shows how much mana Ravenous flock costs each second? Sort of in a way where it counts up each second as the cost ramps up?","replies":[{"poster":"HandheldBrandon","date":"2015-02-02T14:50:30.611+0000","up_votes":3,"down_votes":21,"body":"They need to straight up remove the rising cost on that ultimate. \n\nAlso they need to revert the cooldown when switching back to human form.\n\nSeriously you got champs like Nidalee and Jayce who have transformation forms yet Nidalee has a no cost transformation and the only drawback is she loses her already short range but instead gains massive mobility and the ability to completely all in and do massive burst and huge chase potential?\n\nJayce is not so much a problem but by god if Nidalee can be the way she is they can remove the cooldown on Swains ultimate and the rising mana cost.","replies":[{"poster":"junglerboy16","date":"2015-02-02T14:56:54.007+0000","up_votes":21,"down_votes":1,"body":"This was ONLY supposed to be a QoL request, and has nothing to do with how strong or weak Swain is. Also, just wondering, but how often do you play Swain? Right now, if they simply removed the ramping mana cost and made the cool down shorter (it is already really small with CDR), then he would be able to leave it on almost indefinitely, and considering the amount of damage and sustain it gives, I don't think that would be good for him. Right now, having the ramping cost and a cool down on the toggle gives Swain meaningful times of weakness, like \"Oh, he just turned off his ult, I have 6 seconds to retaliate before he sustains it all up\" and \"swain wasn't watching his mana, so I can take advantage of him being OOM\".","replies":[{"poster":"HandheldBrandon","date":"2015-02-02T15:05:05.203+0000","up_votes":3,"down_votes":13,"body":"I played Swain non stop for almost 2 years since his release.\n\nHonestly what you are asking isn't really a QOL its just an indicator to let you know how much the ult is costing. Riot does stuff like this alot.\n\nA QOL would be more like bringing his mana costs in line with other champions that are similar or making it so his ult doesn't have that 0.3 second delay when first hitting the button (Which it does i tested it numerous times at 20-30 latency).\n\nIf they honestly wanted to do anything with Swain they would need to fix his problems. \n\nHe is a dot mage like Malzahar and Cassiopiea but falls short in DPS compared to both of them in exchange for tankiness and sustainability however his sutainability costs are so high that it ends up hurting him in the long requiring him to completely Itemize around his ultimate for him to be successful. When Swain does do good hes damn near impossible to kill but when he does Poorly HE REALLY does poorly. He's basically one of those champs that does too good when doing well and does really awful when not doing well there is no middle ground.","replies":[{"poster":"junglerboy16","date":"2015-02-02T15:11:19.046+0000","up_votes":21,"down_votes":1,"body":"No, that is called a *buff*. QoL is very specifically just for the feel of gameplay, not actually changing how the champion's kit works.\n\nAs for whether Swain is in a good spot right now, no he isn't. He isn't horrible, but he definitely could use some help here or there. All I'm saying is that this thread isn't about Swain's balance, this is about how it feels to play him. I personally don't have enough experience with Swain to really be a reliable authority on how they should change his kit, but I like him and this indicator idea was just to make it a bit less confusing to play him.","replies":[{"poster":"DarkenedSoul420","date":"2015-02-03T16:45:52.045+0000","up_votes":1,"down_votes":0,"body":"Swain is only in a bad spot for those who dont know how to play immobile champions. As far as the usage on his ult goes, after roa it is fairly spammable just dont leave it on for more than a few seconds at a time. Unless you absolutely have to.","replies":[]},{"poster":"HandheldBrandon","date":"2015-02-02T19:03:27.251+0000","up_votes":1,"down_votes":7,"body":"Exactly \n\nA QOL buff is to help the feel of gameplay or to help a skill function slightly more fluidly. It can be a nerf or a buff depending on how it affects the skill. For example if a Player missed a few kills because the Animation on a skill was just slightly clunky but not buggy they would give it a QOL change to improve the skills functionality and responsiveness and that could result in the skill now nearly guaranteeing a kill every time that is an indirect buff to the skill through fixing a slight usability problem. The skill was not buggy it was working fine however the animation just left a little to be desired so they cleaned up the animation a bit and now the skill is suddenly on overdrive.\n\nThat is QOL change that results in a buff whether intended or not.","replies":[{"poster":"Cindikle","date":"2015-02-03T01:49:24.004+0000","up_votes":2,"down_votes":1,"body":"Those would all be buffs. \n\nA QoL change is say Evelynn having a ring around her showing her stealth range. \n\nA player can learn this range through practice and not need it. But the fact the ring is there does not change how her kit works. \n\nAnimation changes are buffs/nerfs. \nFixing a bug is generally a buff. Sometimes a nerf if it was doing things it should have to give power. \n\nHaving Swain's ult show the current mana cost does not change anything about how he works. It just makes the information easier to find.","replies":[{"poster":"HandheldBrandon","date":"2015-02-03T06:41:57.217+0000","up_votes":1,"down_votes":2,"body":"Animation changes are not considered buffs or nerfs they are considered QOL changes which help the functionality of a champion to perform better. See lower post for clarification as Riot stated themselves.","replies":[{"poster":"Cindikle","date":"2015-02-03T14:34:51.287+0000","up_votes":1,"down_votes":0,"body":"Preforming better is a buff. \n\nQoL changes are not buffs. They are not nerfs. They do not make a champion weaker or stronger. They just make them easier to use. \n\nAn example would be Swain's Q. When he casts it it now shows a ring of how far the enemy can go before the tether breaks. This is a QoL change. It does not make him stronger than he already is. It just shows more information for the player to use. A Swain player who has played him enough will already know this range. Thus, it is not a buff. \n\nThe Diana change coming up to her shield is not a QoL change. It changes the function of the spell making the orbs spin faster. Some say it is a buff, some say nerf. It is not a QoL change. It doesn't make using the shield easier. It changes how the shield works.","replies":[]}]}]}]}]},{"poster":"Orbv","date":"2015-02-02T16:54:25.553+0000","up_votes":4,"down_votes":1,"body":"I have to agree with the OP, you didn't describe a Quality of Life change at all. \"Quality of Life\" as in \"whatever exists is fine, but it's glitchy, or it's shadey, or it's not behaving the way it was intended\". Any change to that would direct the numerics and timing of what is in play, is a buff or nerf.","replies":[{"poster":"HandheldBrandon","date":"2015-02-02T17:26:10.073+0000","up_votes":2,"down_votes":9,"body":"Quality of life changes can comprise of both nerfs and buffs depending on how they affect the skill.\n\nSimple numbers changes are the most seen type of nerfs and buffs in this game but Quality of life changes can comprise both.\n\nTake for example changes to Rammus they made awhile ago and the changes they made to Yasuo in 4.1 which they explicitly called Quality of life buffs. So unless you are saying Riots wrong on their own patch notes then i stand by my point.\n\nhttp://na.leagueoflegends.com/en/news/game-updates/patch/patch-41-notes\n\nhttp://na.leagueoflegends.com/en/news/game-updates/patch/patch-42-notes\n\nIf you notice in patch 4.2 they said \n\n\"We made some general quality of life changes to Yasuo in patch 4.1 , but as players begin to master him, we’ve seen how strong he is when played to maximum effectiveness. We looked at areas where we could reduce some of that power without messing with his core playstyle. We were also unhappy with how Yasuo was using Last Breath to engage in fights by teleporting from thousands (and thousands) of miles away.\"\n\nAfter the changes were made that made Yasuo feel smoother and play more correctly tuned they went and nerfed him because fixing him and making him overall smoother to play and function he was still considered too good so they then nerfed him.\n\nBy directly fixing his flaws and strange gameplay behavior they indirectly buffed him which then they went and nerfed him.\n\nIt was a buff albeit in a different manner than simple numbers changes.\n\nAlso in \n\nhttp://na.leagueoflegends.com/en/news/game-updates/patch/patch-417-notes\n\nThey deliberatly called a rammus change a Qualit of life buff which changed how his Powerball and Defensive ball overlapped. It was a very small and very minor buff but it was a buff none the less. Indicators are hardly what i call QOL changes more like Readability and Ease of use changes in that it makes the ability easier to read or understand whats functionally happening with th ability. Such as with Shields getting a visual marker on a health bar now where as long before they didnt.","replies":[{"poster":"Orbv","date":"2015-02-02T18:27:13.293+0000","up_votes":1,"down_votes":0,"body":"You are mistaking what they did as straight buffs. What they did WERE quality of life changes, they were inconsistencies that were not intended. They just also happened to buff the champions after being fixed. What you were suggesting are changes to numbers which is strictly a buff which does not affect the way the champion plays, but rather how one should play the champion..","replies":[{"poster":"HandheldBrandon","date":"2015-02-02T18:56:52.221+0000","up_votes":1,"down_votes":3,"body":"They were not straight buffs they were QOL changes to make the character function more fluidly which made their gameplay and abilities function smoother which in turn gave them an indirect buff. People were saying Azir was garbage and he was due to bugs. Then Riot gave him some necessary fixes and people cried he was OP and annoying as shit which he is annoying then. Then gave him a QOL change to his Q which made his nearest soldier always go to the cursor which before it didnt. Its an indirect buff which makes Azir more powerful without actually changing anything such as numbers or scaling.\n\n\nAlso as clearly seen in the patch notes i posted they immediately nerfed Yasuo after they gave him some QOL changes because he was considered too good at what he was doing. Where before because of the clunkiness of his spells he wasn't nearly as great but still good.","replies":[{"poster":"Hyrum Graff","date":"2015-02-03T07:41:20.324+0000","up_votes":1,"down_votes":0,"body":"I'd argue that the QOL \"buffs\" didn't actually add any power into yasuo's kit, they just made it more accessible.\n\nStated differently, they made it easier to master yasuo.","replies":[]}]}]}]}]}]}]},{"poster":"Bouffon dAnglais","date":"2015-02-02T18:45:44.897+0000","up_votes":2,"down_votes":0,"body":"Elise's, Jayce's and Nidalee's transformations don't give direct damage, Swain's does. \nElise's, Jayce's and Nidalee's transformations don't give direct sustain, Swain's does.\nAll that Elise's,  Jayce's and Nidalee's transformations do is give them another set of abilities.\n\nTherefore, Elise's, Jayce's and Nidalee's transformations are not comparable to Swain's.","replies":[{"poster":"HandheldBrandon","date":"2015-02-02T19:15:34.621+0000","up_votes":2,"down_votes":1,"body":"Incorrect Jayce and Nidalee's provide 3 entirely new damaging skills While Elise still functions slightly similar but mainly changes how her Q and W put out damage. Elise's Q goes from a ranged max health damage shred to a Melee Missing health damage shred. and Her W changes goes from a ranged delayed damaging skill shot slow to a Melee attack speed buff that provides Health on hit Akin to lifesteal.","replies":[{"poster":"aaronconlin","date":"2015-02-02T19:36:13.179+0000","up_votes":2,"down_votes":0,"body":"Swain's transformation is more similar to Aatrox's ult than it is to Nidalee's.","replies":[{"poster":"HandheldBrandon","date":"2015-02-02T20:11:06.239+0000","up_votes":2,"down_votes":2,"body":"I wouldn't go that far as AAtrox's Ult is more of a steroid than anything. Swain's just provides passive healing and damage to 3 nearby targets on activation whereas AAtroxs does a set amount of damage once then Increases his attack speed and range.","replies":[{"poster":"aaronconlin","date":"2015-02-02T21:55:02.868+0000","up_votes":1,"down_votes":0,"body":"I know. I was saying that Swain's transformation is purely aesthetic, whereas Nidalee's is actually a transformation, so the two can't really be equally compared. I made the connection to Aatrox because his ult changes his shape and does damage, so it's not an actual different form, same as Swain.","replies":[]}]}]}]}]},{"poster":"Abyssphere","date":"2015-02-02T17:58:53.839+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HandheldBrandon,realm=NA,application-id=3ErqAdtq,discussion-id=P55wKnWY,comment-id=0001,timestamp=2015-02-02T14:50:30.611+0000)\n>\n> They need to straight up remove the rising cost on that ultimate. \n> \n> Also they need to revert the cooldown when switching back to human form.\n> \n> Seriously you got champs like Nidalee and Jayce who have transformation forms yet Nidalee has a no cost transformation and the only drawback is she loses her already short range but instead gains massive mobility and the ability to completely all in and do massive burst and huge chase potential?\n> \n> Jayce is not so much a problem but by god if Nidalee can be the way she is they can remove the cooldown on Swains ultimate and the rising mana cost.\n\nSwain's ult is a transformation only in a visual sense. It is completely unlike that of actual transform champions, so can't be compared. He retains the same kit.","replies":[{"poster":"HandheldBrandon","date":"2015-02-02T19:12:01.597+0000","up_votes":1,"down_votes":3,"body":"So what you are saying is...... That its a transformation thats not a transformation?\n\nIts called a toggle and Swain and Nidalee and Jayce are all considered to have toggled forms.\n\nNidalee and Jayce gain a set of 4 new abilities all which provide new ways for them to produce damage. Swains only changes his ultimate and gives him damage to 3 people in an AOE around him and provides self healing.\n\nAs far as transformations go out of the 3 of those champs Swains Transformation provides the least but has the highest continual resource cost and it only increases the longer it goes on.","replies":[{"poster":"alagore","date":"2015-02-02T21:20:15.848+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=HandheldBrandon,realm=NA,application-id=3ErqAdtq,discussion-id=P55wKnWY,comment-id=000100030000,timestamp=2015-02-02T19:12:01.597+0000)\n>\n> So what you are saying is...... That its a transformation thats not a transformation?\n> \n> Its called a toggle and Swain and Nidalee and Jayce are all considered to have toggled forms.\n> \n> Nidalee and Jayce gain a set of 4 new abilities all which provide new ways for them to produce damage. Swains only changes his ultimate and gives him damage to 3 people in an AOE around him and provides self healing.\n> \n> As far as transformations go out of the 3 of those champs Swains Transformation provides the least but has the highest continual resource cost and it only increases the longer it goes on.\n\nBy that logic, Anivia changes form.","replies":[]},{"poster":"Abyssphere","date":"2015-02-02T20:27:08.218+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=HandheldBrandon,realm=NA,application-id=3ErqAdtq,discussion-id=P55wKnWY,comment-id=000100030000,timestamp=2015-02-02T19:12:01.597+0000)\n>\n> So what you are saying is...... That its a transformation thats not a transformation?\n> \n> Its called a toggle and Swain and Nidalee and Jayce are all considered to have toggled forms.\n> \n> Nidalee and Jayce gain a set of 4 new abilities all which provide new ways for them to produce damage. Swains only changes his ultimate and gives him damage to 3 people in an AOE around him and provides self healing.\n> \n> As far as transformations go out of the 3 of those champs Swains Transformation provides the least but has the highest continual resource cost and it only increases the longer it goes on.\n\nI'm saying it's not a transformation at all. He is the exact same champion, he just has a different appearance and is dealing constant damage. It is no different to something like Anivia's ultimate if it was cast at her centre. No champion like Nidalee gets massive inherent benefits just from being in a different form, they just get different abilities to cast. Swain's ultimate is literally just \"I am me and also I am doing AOE damage and healing\", whereas every actual transform champ's ult is \"I am trading one set of abilities for another\".\n\nIf Swain's ultimate had no mana cost then please tell me, why would he ever turn it off?","replies":[{"poster":"alagore","date":"2015-02-02T21:22:08.912+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MotherTeresa1910,realm=NA,application-id=3ErqAdtq,discussion-id=P55wKnWY,comment-id=0001000300000000,timestamp=2015-02-02T20:27:08.218+0000)\n>\n> I'm saying it's not a transformation at all. He is the exact same champion, he just has a different appearance and is dealing constant damage. It is no different to something like Anivia's ultimate if it was cast at her centre. No champion like Nidalee gets massive inherent benefits just from being in a different form, they just get different abilities to cast. Swain's ultimate is literally just \"I am me and also I am doing AOE damage and healing\", whereas every actual transform champ's ult is \"I am trading one set of abilities for another\".\n> \n> If Swain's ultimate had no mana cost then please tell me, why would he ever turn it off?\n\nMaybe he wanted to ward bron or dragon? Idk. I agree with you btw.","replies":[]}]}]}]},{"poster":"KnightsKemplar","date":"2015-02-02T15:45:51.589+0000","up_votes":3,"down_votes":0,"body":"Nidalee's transform isn't really analogous to Swain's because she isn't constantly damaging people in it.\n\nThat aside, if they remove the rising cost, it would need to be higher cost. It costs very little mana on the first tic, and I think leaving it that low would be OP.\n\nTHAT aside, I actually like the ramping cost. It makes Swain interesting because you have to think about when to transform back and forth carefully. Having that ramping cost increases his threat, skillcap, and counterplay. To me, he is an example of a remarkably well balanced champion. He has weaknesses and strengths that are VERY well defined, and his win rate is reasonable. He is nuanced, but not unbearably complicated and doesn't have 6 passives and multiple effects on every ability. A good Swain player is terrifying; a bad one is hilarious.\n\nCould they lower the mana cost on ult a little overall to bring his costs in line with other champs?  Absolutely yes. But I like that it ramps. It makes him more interesting by directly influencing his play patterns.","replies":[]},{"poster":"AetherKingdom","date":"2015-02-02T18:39:56.155+0000","up_votes":1,"down_votes":0,"body":"sure.\nIF everything about swain is nerfed hard as well.","replies":[]},{"poster":"A Slime Appears","date":"2015-02-02T15:35:21.126+0000","up_votes":3,"down_votes":1,"body":"Nidalee doesn't steal health just by being in your general vicinity.  Swain would likely be perma-ban status with a such a change unless he was nerfed heavily elsewhere.  Really awful idea.","replies":[]},{"poster":"MartinLaEpic","date":"2015-02-03T01:42:48.182+0000","up_votes":1,"down_votes":0,"body":"such a bad idea and I play him a good amount. He would be insane, a walking sustain machine","replies":[]}]},{"poster":"4nth0l0gy","date":"2015-02-02T14:34:59.228+0000","up_votes":4,"down_votes":0,"body":"Good idea!","replies":[]},{"poster":"Kaipop","date":"2015-02-03T02:52:51.515+0000","up_votes":1,"down_votes":0,"body":"No. Nothing for Swain I hate that guy","replies":[{"poster":"junglerboy16","date":"2015-02-03T03:02:29.860+0000","up_votes":2,"down_votes":0,"body":"To each his own...","replies":[]}]},{"poster":"Meep Man","date":"2015-02-02T22:07:22.862+0000","up_votes":2,"down_votes":0,"body":"Can we also see the range on Ravenous Flock while it is active?","replies":[{"poster":"Ginjor","date":"2015-02-03T20:13:30.099+0000","up_votes":1,"down_votes":0,"body":"I also think this would be a great idea, whether it's just when I hover over my skill so I know the range, or if it's a visual indicator so everyone knows the range, either one would be super helpful","replies":[]}]},{"poster":"KING OF MASKS","date":"2015-02-03T15:46:27.761+0000","up_votes":1,"down_votes":0,"body":"*Shhhh!!!* What do you think you're doing, OP?! Don't let rito notice that Swain is still in the game! What, you want him to get the Cassio treatment?","replies":[]},{"poster":"yay pink","date":"2015-02-03T01:52:35.768+0000","up_votes":1,"down_votes":0,"body":"Uh, getting back to the original request... Not how far off topic this got...\n\nYou mean something like how Kog'maw has a number on his ult icon that shows how much the next ult will cost right?  Doesn't Kass have something like that too? I don't see why this is such a bad request.","replies":[{"poster":"junglerboy16","date":"2015-02-03T03:04:26.425+0000","up_votes":1,"down_votes":0,"body":"Yes exactly, just a little counter like that to show how much it costs. I know most swain players just know how it feels and turn it on and off when they need it, but for a Swain n00b like myself, this would be very helpful.","replies":[]}]},{"poster":"Focus Teemo","date":"2015-02-02T17:10:23.121+0000","up_votes":1,"down_votes":0,"body":"I support this idea. For it aids me in my endeavor to spread word of the bird and his prophet {{champion:50}} across the world.\nhttps://www.youtube.com/watch?v=9Gc4QTqslN4","replies":[]},{"poster":"A Slime Appears","date":"2015-02-02T15:37:20.895+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=junglerboy16,realm=NA,application-id=3ErqAdtq,discussion-id=P55wKnWY,comment-id=,timestamp=2015-02-02T14:30:46.687+0000)\n>\n> Just a really simple idea: Could we get an indicator on the HUD buff bar that shows how much mana Ravenous flock costs each second? Sort of in a way where it counts up each second as the cost ramps up?\n\nI don't know, you can get a pretty good feel for how much mana it costs by looking at how the mana bar under your health is draining.  Since the mana bar isn't segmented by 100s like health knowing it costs 400 mana this second doesn't do a lot for me.","replies":[]}]}