{"poster":"BlitzRankD","date":"2016-08-27T02:53:49.520+0000","title":"Bots in low level games","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Want to start off by saying sorry if this has already been discussed but had a quick look and couldn&#039;t find anything.\r\n\r\nSo I&#039;ve been leveling my new account, (got over my old name, thought it was time for a change) , and I&#039;ve been smashing a lot of ARAM games to get quick Exp and IP and I&#039;ve noticed what I feel is a major problem with bot leveling programs in the low levels, I would say as high as 2 out of 3 games has at least one useless bot that does nothing but feed \r\n\r\nWanted to get peoples opinions on this phenomena.   Is it as a big an issue as I think if not why not?  Do you think the community/Riot is responding to this appropriately Ie. reporting all bots/Banning them? any suggestions on how this could be improved?","replies":[{"poster":"TheOneUser","date":"2016-08-27T14:15:02.081+0000","up_votes":2,"down_votes":0,"body":"Riot's already sued one of those bot making companies so it's a lot better than it used to be. but generally, it's balanced between bots and people on both sides. horrible game if it's a 1v1 with 8 bots\nsometimes you can get the bots fed and they'll wreck the enemy team for you\n\nIMO: free s+ free chest free win","replies":[]},{"poster":"CHEESYLEEKS","date":"2016-08-27T12:24:03.117+0000","up_votes":2,"down_votes":0,"body":"Basically get your mmr score up after 30 and the problem will dissapear \n\nI was regurlarly getting bot games pre 30 now i havnt had a bot in a game for over a year","replies":[]},{"poster":"Ingénue","date":"2016-08-27T08:20:32.892+0000","up_votes":2,"down_votes":0,"body":"Unfortunately it is super common, especially in low level ARAM and intermediate bots. \nRiot do know about the issue, and are doing what they can to combat it, but the people botting the accounts are constantly evolving their bots, and the demand for premade level 30 accounts isn't really going down so when they do ban an account, a bunch more will pop up in its place. \n\nFor now, just be sure to report every suspected bot in the end of game screen, so that Riot can review the account and take necessary action (after all, some might actual new players). Keep in mind, that just because you see a bot you reported in another game, doesn't mean that your report doesn't matter and they won't get banned. Its just that 3rd party software reports (scripting/botting) is a pretty serious offence, and Riot likes to be super sure that they are taking the right actions so it may take a lil while longer.","replies":[]},{"poster":"Krispy Migraine","date":"2016-08-27T07:24:50.524+0000","up_votes":2,"down_votes":0,"body":"In pvp an entire bot team was there... 2 ppl with smite lol. We rekt dem. And u the 2nd person I met on boards who isn't lvl 30!!! Yay I'm not alone!!1","replies":[]},{"poster":"EzeBlood","date":"2016-08-27T07:18:18.102+0000","up_votes":2,"down_votes":1,"body":"It's in ARAMs so Riot won't care...\nBut really it is an issue. Unfortunately for those of us who play ARAMs for fun, it means that our fun gets ruined by bots. But Riot want's League of Legends to be a competitive game, so don't expect much in the way of reform for this.\nAlso, for Riot's misconduct system, it's really hard to detect a bot program with software or coding. They can't use characteristics of bots, because they're just too similar to unexperienced players, or players just having a bad game. It really does suck. One time, I was in a game with 9 bots, and that was just like \"Why am I even here? I could be off playing a game with actual people on something like CS:GO or, god forbid, DotA.","replies":[]}]}