{"poster":"Charon7","date":"2016-08-28T08:12:20.469+0000","title":"FAIRNESS TO UNRANKED MATCHMAKING","subforum":"[ARCHIVED] Miscellaneous","embed":{"description":"Imgur: The most awesome images on the Internet.","url":"http://imgur.com/a/56lmM","image":"http://i.imgur.com/JHmNq84.jpg?fb"},"up_votes":2,"down_votes":0,"body":"So, I've been playing league of legends for a long time now (since season 2) and I haven't played a ranked game for years until this game. Can you explain to me why I am facing a team full of platinum players, while my team is gold and I am UNRANKED ? Here's a photo with the mmr's/divisions of the participants, please for the love of god don't answer with any general links if you want to actually improve the quality of the game and the communication between the staff and the players. I mean I'm not a new guy when it comes to league but think of the new players in ranked that have to deal with very skilled players - veterans of the game while themselves have ZERO experience.\r\n\r\nI mean...any thoughts?","replies":[{"poster":"Geauxx","date":"2016-08-28T09:43:46.091+0000","up_votes":1,"down_votes":1,"body":"Tbh, most of the higher elos treat normals/aram as joke modes. so they lose more often in normals overall... there is no \"fix\" that's needed... it's the actual player mindset. i don't blame them, i also treat normals/aram as a joke mode and will do random dumb stuff if even others don't like it.","replies":[{"poster":"Nami Want Salami","date":"2016-08-28T09:50:20.513+0000","up_votes":2,"down_votes":0,"body":"That's a ranked game not normals in the screenshot","replies":[{"poster":"Geauxx","date":"2016-08-28T09:56:43.977+0000","up_votes":1,"down_votes":1,"body":"oh well, thanks for making me realise im blind af lol. Then it's his fault for having an undefined elo, and maybe his team was a bunch of players on a nice winstreak making their mmr higher than normal.","replies":[{"poster":"Charon7","date":"2016-08-28T10:51:06.893+0000","up_votes":1,"down_votes":0,"body":"So undefined elo is around Platinum in your opinion? thanks for the info man (proof next time). Also too many players having winstreaks at the same time\n\n\n?????????????????????????????????????????????????????????????????????????????????????????????????????????????","replies":[{"poster":"Geauxx","date":"2016-08-28T23:02:09.985+0000","up_votes":1,"down_votes":0,"body":"No, undefined elo, is you not having a known amount, normally when you start ranked they start you off higher, and yes all  of them can be high at the same time since they try to match them all within the same general mmr. that also includes duo's that could have made one of their mmr alot higher than normal.","replies":[]}]}]}]}]},{"poster":"Rocka","date":"2016-08-28T09:29:30.865+0000","up_votes":1,"down_votes":1,"body":"They have high win rates so mmr is probs plat as well. nothing wrong with this","replies":[{"poster":"Charon7","date":"2016-08-28T10:45:51.298+0000","up_votes":1,"down_votes":0,"body":"You do understand that in this picture there is a gold 5 player right? no way he has mmr like a platinum 3 30+ points. **Ok how about 5 Platinums? ** Also, the highest i have been is gold 5 SEASON 3 and i haven't played a ranked game that gave me LP since then. Thats no coincidence look at my team. Now look at their team 200~ mmr difference.","replies":[{"poster":"Rocka","date":"2016-08-28T13:44:34.755+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Charon7,realm=EUNE,application-id=cIfEodbz,discussion-id=AUXlEBwa,comment-id=00000000,timestamp=2016-08-28T10:45:51.298+0000)\n>\n> You do understand that in this picture there is a gold 5 player right? no way he has mmr like a platinum 3 30+ points. **Ok how about 5 Platinums? ** Also, the highest i have been is gold 5 SEASON 3 and i haven&#x27;t played a ranked game that gave me LP since then. Thats no coincidence look at my team. Now look at their team 200~ mmr difference.\n\nHe has 65% winrate.........mmr is good end of story lol","replies":[]}]}]}]}