{"poster":"Aether","date":"2019-08-11T23:10:02.531+0000","title":"(Youtube Video) League of Legends Highlights #5 |Lethality VI | VI stands for violence","subforum":"Streams & YouTube","embed":{"description":"Viel Spaß mit dem League of Legends Vi Highlights. Lasst bitte eine Bewertung und Konstruktive Kritik da, damit ich meine Videos verbessern kann. ───────────────────────────────────────── Instagram: calvinvoelling Instagram Band: thebooth7777 ───────────────────────────────────────── Danke fürs mitmachen bei: Meine Freundin (Melli) ───────────────────────────────────────── Server: EUW","url":"https://www.youtube.com/watch?v=nYHtw66qyq8","image":"https://i.ytimg.com/vi/nYHtw66qyq8/hqdefault.jpg"},"up_votes":2,"down_votes":2,"body":"Hallo,\r\nich habe ein neues Video auf meinen Kanal hochgeladen und würde mich freuen wenn sich das einige vielleicht mal anschauen würden.\r\nSchon mal danke im voraus, an alle die sich das Video anschauen und vlt eine Bewertung bzw ein Abo da lassen :).\r\n\r\n- Aether","replies":[{"poster":"Izaya Kumiho","date":"2019-08-11T23:26:56.248+0000","up_votes":2,"down_votes":0,"body":"Und es sind wieder keine wirklichen \"HIghlights\", sondern nur diese eine einzige Runde, wo gefühlt random Cuts gewählt worden sind.\n\nSchade. ._.\n\nWenigstens seid ihr beide weniger verkrampft im Vergleich zu der Story mit Yasuo.\nDie Jokes sind weiterhin \"meh\", aber jetzt wirkt das Video dezent angenehmer. Improvement. Wooh! \\o/","replies":[{"poster":"Aether","date":"2019-08-11T23:40:52.352+0000","up_votes":1,"down_votes":0,"body":"Na ja wir haben scheinbar eine andere Definition von Highlights. Ich meine es sind halt die Highlights dieser Runde und ... so ist das ok für mich. Ja die cuts waren etwas Random, aber das lag daran, dass ich Heute echt Rückenschmerzen hatte und damit relativ schnell fertig werden wollte, dadurch hat der Schnitt etwas gelitten. Ich habe aber auch nicht die Zeit 5 witzige und unterhaltsame Vi Runden aufzunehmen. Ich bin immer noch arbeitslos, weil meine Schule mich angelogen hat und somit 1 Monat vor beginn der Ferien gesagt bekommen habe, dass ich von der Schule muss, mache nebenbei noch Musik und habe noch ein paar andere private Probleme. Das war übrigens auch der Grund warum ich so patzig zu dir war, weil ich einfach einen doofen Tag hatte und dafür möchte ich mich auch nochmal bei dir herzlichst entschuldigen. Ich hoffe wir können in guten auseinander gehen und du trägst mir das nicht weiter nach und danke für die Kritik bzw. dein Feedback.","replies":[{"poster":"Izaya Kumiho","date":"2019-08-11T23:49:27.927+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Aether,realm=EUW,application-id=ENHTtUTO,discussion-id=yLxKtp8f,comment-id=00000000,timestamp=2019-08-11T23:40:52.352+0000)\n>\n> Ja die cuts waren etwas Random, aber das lag daran, dass ich Heute echt Rückenschmerzen hatte und damit relativ schnell fertig werden wollte, dadurch hat der Schnitt etwas gelitten.\n\nMein Beileid bezüglich der Schmerzen.\nAber wenn dir irl etwas dazwischen kommt, solltest du dir vielleicht etwas mehr Zeit lassen. Schließlich ist die Qualität wichtiger, als die Quantität.\n\n\n> Ich habe aber auch nicht die Zeit 5 witzige und unterhaltsame Vi Runden aufzunehmen. \n\nDann setz dir eine größere Deadline ._. Leute wie Videodonkey sind damals auch eher durch die Qualität des Contents groß geworden. Da kam so ein Video auch mal nur alle zwei oder drei Wochen.\n\n>Ich bin immer noch -[...]\n\nAh! Niemals sowas im Internet sagen. Das ist dein privates Leben, was niemanden etwas angehen sollte! D: Merk dir das.\n\n\n>[...]Das war übrigens auch der Grund warum ich so patzig zu dir war, weil ich einfach einen doofen Tag hatte und dafür möchte ich mich auch nochmal bei dir herzlichst entschuldigen.\n\n\nOh, passt schon. Ich sehe ja, dass das Gesagte von mir nicht ignoriert worden ist.\n\n>Ich hoffe wir können in guten auseinander gehen und du trägst mir das nicht weiter nach und danke für die Kritik bzw. dein Feedback.\n\nIch bin selten nachträglich...\n\n(ᴬᵘßᵉʳ ᶰᵃᵗüʳᶫᶦᶜʰ, ʲᵉᵐᵃᶰᵈ ᵈᵉᶰᶦᵉᵈ ᵐᶦʳ ᵈᵉᶰ ᶠᵒᵒᵏᶦᶰ ᵈᵃʳᵏ ʰᵃᵛᵉˢᵗ ˢᵗᵃᶜᵏ⋅)\n\nWenn du möchtest, kann ich dir Ideen geben für die Bearbeitung. o/","replies":[{"poster":"Aether","date":"2019-08-11T23:56:55.880+0000","up_votes":1,"down_votes":0,"body":"Ach ich habe damit kein Problem Sachen aus dem echten Leben zu erzählen bzw. ich bin einfach sehr offen und mir ist relativ egal was Menschen von mir denken. Es sei denn ich gebe mir bei etwas mühe. Na ja ich war früher Minecraft Youtuber und da war es nun mal üblich daily Uploads zu machen. Natürlich muss ich mir das etwas abgewöhnen, aber ich schneide auch erst seit ner Woche meine Videos. Vorher habe ich sie nie bearbeitet und dafür bin ich eigentlich ganz zufrieden damit. Die Qualität wird sich definitiv noch steigern, es ist noch kein Meister vom Himmel gefallen. Wir können ja auch gerne mal reden oder so wenn du möchtest, dann kannst du mir auch deine Tipps geben.\n\n-Aether","replies":[]}]}]}]}]}