{"poster":"Urmybadhabit","date":"2016-08-15T13:55:24.261+0000","title":"Amped Project: Zac","subforum":"Player Creations","up_votes":1,"down_votes":0,"body":"Recently, many project skins have been promoted, leaked, and some faked. Project skins are hands down some of the most quality and rich skins worth any money. It takes a lot of criteria for project skins to be made; such as if the character could get particle effects or a cool animation for a certain core skill/ability/passive. Despite all of this, many characters that are favorites among players, don&#039;t meet this criteria and sometimes champions can&#039;t reach any criteria for a well designed skin. For example, we have Zac. Amazing champion, lousy idea for a champion, but his backstory, persona and abilities make him very unique and overall just amazing....except for his skin choices.....anyways here is a little idea I thought about when I encountered an old topic on Project: Zac\r\n\r\nNow Zac is basically genetic goo. Not much to work with and metal armor and cool green visors won&#039;t work, It just won&#039;t make sense. But that&#039;s not all project skins are. Project skins are sort of a non canon futuristic development PROJECT, which means that Zac doesn&#039;t only have to get cool armor and all, he can Pixilate like zed.\r\nWhen he bounces or moves it&#039;s just like depixelatin and pixelating all over. \r\n\r\nHis passive, when he hits someone with an ability could cause a disruption in the pixels which make up his body, leading to a very cool glitch animation followed by the bloblet&#039;s being data codes and number codes that generate static.\r\n\r\nHis Q not much can be done on such a vague ability, but when he punches forward his arms can become all blurred and fuzzy and when they retract go back to normal.\r\n\r\nHis W would let him fade into a type of static figure with codes and pixels flying everywhere\r\n\r\nHis E when he charges it begins to slowly start depixilating him piece by piece and when he &quot;flies&quot; he can be seen as a fuzzy figure and the shadow where it normally would be on the classic skin could start repixilating him. This would be the harder skill to animate but if done well it could look amazing.\r\n\r\nHis ultimate doesn&#039;t have much ground to stand on, but the best that can be done is pixelation and enemies get knocked back by a bolt of static electricity or some sort.\r\n\r\nEither way, this is just my idea. Anyone could feel free to add it or suggest some thing but I would pay legendary price for this skin.","replies":[{"poster":"FrodoTeaBaggins","date":"2016-08-16T02:13:01.444+0000","up_votes":1,"down_votes":0,"body":"Aren't PROJECT skins only for human champions though?","replies":[{"poster":"EzeBlood","date":"2016-08-27T08:15:51.472+0000","up_votes":2,"down_votes":0,"body":"yes, they are. That's what the whole storyline is: the rebellion is fighting to retain their humanity.","replies":[]}]},{"poster":"Nothing bots","date":"2016-08-15T22:57:44.574+0000","up_votes":1,"down_votes":0,"body":"that suits arcade better that project tbh{{champion:154}}","replies":[]},{"poster":"Rocka","date":"2016-08-15T14:41:56.041+0000","up_votes":1,"down_votes":0,"body":"Errr no thanks lol, as a zac 1 trick im happy with Pool party zac :)","replies":[]}]}