{"poster":"vaas4","date":"2015-07-23T14:18:45.977+0000","title":"consulta sobre anuncios de que mis reportes sobre malas conductasa otros jugadores sirvieron de algo","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":2,"body":"a los rioters les tengo una consulta, ayer me salio un aviso de q mis plegarias fueron escuchadas y que uno de los tantos jugadores q he reportado le dieron algun tipo de castigo, mi duda es la siguiente... como puedo saber cual de los (sin bromear) cientos de reportes a jugadores que he hecho por mala conducta, afk, flameos etc es el que sirvio para banear al jugador? porq esta bien q te digan q sirven de algo los reportes, pero deberian implementar un sistema q te informe exactamente q jugador fue baneado porq no recuerdo la ultima partida en la cual no reporte a alguien sea de mi equipo o del contrario.\r\nSaludos!","replies":[{"poster":"Neo Gaussrik","date":"2015-07-23T15:23:48.591+0000","up_votes":2,"down_votes":1,"body":"La idea no es apoyar una caceria de brujas; la idea es simplemente hacerte saber que el sistema esta funcionando. :)\n\nPara que necesitas saber quien exactamente fue castigado?","replies":[{"poster":"vaas4","date":"2015-07-23T20:44:51.538+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=PJAKt7ph,discussion-id=nmA6lk9E,comment-id=0000,timestamp=2015-07-23T15:23:48.591+0000)\n>\n> La idea no es apoyar una caceria de brujas; la idea es simplemente hacerte saber que el sistema esta funcionando. :)\n> \n> Para que necesitas saber quien exactamente fue castigado?\n\nentiendo a lo q va, pero podrian colocar al menos la fecha en la q se hiso el reporte o algo, porq he tenido la mala suerte de jugar dos veces con los mismos a los q reporte","replies":[{"poster":"Neo Gaussrik","date":"2015-07-23T20:47:38.686+0000","up_votes":3,"down_votes":3,"body":"Y, de nuevo- de que te ayuda saber esto? :)","replies":[{"poster":"DieOrSovngarde","date":"2015-07-24T15:36:58.657+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=PJAKt7ph,discussion-id=nmA6lk9E,comment-id=000000010000,timestamp=2015-07-23T20:47:38.686+0000)\n>\n> Y, de nuevo- de que te ayuda saber esto? :)\n\nDe que lo ayuda? De saber que el report que hizo a dicho usuario, el cual fue castigado, no lo volvera a cruzar en sus partida. Tan simple...","replies":[{"poster":"Neo Gaussrik","date":"2015-07-24T15:46:57.567+0000","up_votes":1,"down_votes":0,"body":"OK, pero para que necesita saber eso?\n\nHablo en serio. Va a hacer algo distinto si sabe? Hay una diferencia entre saber que los castigos estan funcionando, y que -ese invocador en particular- fue castigado?","replies":[{"poster":"Marra","date":"2015-07-24T21:36:26.086+0000","up_votes":1,"down_votes":0,"body":"Básicamente, quiere sentir la satisfacción de que ese usuario/a fue penalizado como se debe.","replies":[{"poster":"Neo Gaussrik","date":"2015-07-24T23:49:38.333+0000","up_votes":2,"down_votes":0,"body":"Si esta es la razon, entonces mi respuesta seria:\n\nNos importa mas que un jugador negativo aprenda a comportarse (reformacion) que darle satisfaccion a los jugadores que reportan (schadenfreude).\n\nNos parece que el hacer publico el hecho de que un invocador fue castigado puede llevar a comportamientos no deseados en la comunidad; el castigo mismo es suficiente castigo sin humillarlos publicamente tambien.","replies":[{"poster":"vaas4","date":"2015-07-29T08:27:40.234+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=PJAKt7ph,discussion-id=nmA6lk9E,comment-id=0000000100000001000000000000,timestamp=2015-07-24T23:49:38.333+0000)\n>\n> Si esta es la razon, entonces mi respuesta seria:\n> \n> Nos importa mas que un jugador negativo aprenda a comportarse (reformacion) que darle satisfaccion a los jugadores que reportan (schadenfreude).\n> \n> Nos parece que el hacer publico el hecho de que un invocador fue castigado puede llevar a comportamientos no deseados en la comunidad; el castigo mismo es suficiente castigo sin humillarlos publicamente tambien.\n\npara saber si realmente el jugador fue sancionado, por q el aviso que da el juego es poco claro, solamente se castigo a un jugador de los que reporte? que ocurrio con los otros que reporte? siguen jugando y arruinando partidas? realmente ya es un martirio jugar a este juego, en todas las partidas alguien flamea e insulta a todos, ya ni siquiera me molesto en tener el chat activado, empieza la partida y muteo a todos, usted cree q esa es la solucion? siempre colocan que banean a tantos jugadores, que cada vez las penalizaciones son mas severas pero no se ve reflejado en ninguna parte por eso pregunte el porq no daban el nombre del jugador, para saber si realmente funcionan de algo mis reportes, llamele caseria de brujas o como quiera, no veo el porq defender a los jugadores que arruinan el juego... \n\nsi no entiende lo que le digo, le propongo que juegue unas cuantas partidas y cuente a los jugadores con mala actitud, le aseguro que la cantidad de invocadores que poseen una  actitud desagradable es mayor a lo que siempre nos colocan en sus post en los cuales dicen que mas del 90 porciento de los jugadores tienen una actitud acorde a el reglamento del juego... claro q colocando esas estadisticas en un partida normal quiere decir q uno de los 10 jugadores es un flamer","replies":[{"poster":"Neo Gaussrik","date":"2015-07-29T13:34:09.037+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=vaas4,realm=LAS,application-id=PJAKt7ph,discussion-id=nmA6lk9E,comment-id=00000001000000010000000000000000,timestamp=2015-07-29T08:27:40.234+0000)\n> solamente se castigo a un jugador de los que reporte?\n\nNo; se pueden haber castigado todos, o solo uno, o cualquier numero entre estos dos limites.\n\n> que ocurrio con los otros que reporte?\n\nDepende. Es posible que hayan sido castigados; es posible que no.\n\n> siguen jugando y arruinando partidas?\n\nTambien depende.\n\nPuede ser que les haya llegado un aviso y hayan corregido su actitud. Puede ser que normalmente no se comporten asi, y simplemente los pillaste en un mal dia.\n\nPuede ser que los hayan baneado permanentemente, o cualquier castigo entre estos extremos.\n\n> empieza la partida y muteo a todos, usted cree q esa es la solucion?\n\nNo creo que sea la solucion, pero entiendo por que lo haces. Espero que con el tiempo la situacion del servidor vaya gradualmente mejorando.\n\n> no veo el porq defender a los jugadores que arruinan el juego... \n\nEs simple: son jugadores tambien, y hostigarlos no nos gana nada.\n\nLeague of legends es un juego gratis. Lo peor que podemos hacerle a un jugador es banearle una cuenta; no podemos evitar que cree otra y siga jugando.\n\nPor eso, nos interesa mucho mas incentivarlos a dejar de ser toxicos que castigarlos.\n\n> si no entiende lo que le digo, le propongo que juegue unas cuantas partidas y cuente a los jugadores con mala actitud\n\nJuego LoL muchisimo, te aseguro que entiendo de lo que estas hablando.","replies":[]}]}]}]}]}]},{"poster":"Anampia","date":"2015-07-23T22:24:12.395+0000","up_votes":2,"down_votes":1,"body":"ud es diabolico","replies":[]}]}]},{"poster":"hi im chito","date":"2015-07-23T16:19:23.678+0000","up_votes":1,"down_votes":1,"body":"esta bien, no es necesario saber quien fue castigado.","replies":[]}]}]}