{"poster":"ORD Fraud","date":"2018-01-20T12:30:29.593+0000","title":"bug crashes","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"my client keeps saying that it crashes yet there is nothing wrong with my client, for this reason i&#039;ve been down as afk and now my queue times i have to wait 20 mins, how is this my fault that everytime i try to reload my client, it does a full recovery of the client which takes a few minutes. Riot this is out of my control and your placing my under a possible ban for a crash. \r\n\r\nThere must be a system where the client can identify whether or not the gamer has intentionally left the game or the client itself has crashed or a bug has suddenly cause the client to stop working for whatever reason. As it stands i&#039;m now very pissed that i have to wait 20mins for a game when i didn&#039;t afk instead my client fucked up.  Please have feedback from some at riot","replies":[{"poster":"Ninox","date":"2018-01-20T13:49:50.370+0000","up_votes":1,"down_votes":0,"body":"Consider this, what is the effect on the other players in your game when you disconnect, and what is the effect when you afk? Assuming there's no other toxicity, the effect is the same.\n\nIt's a given that issues will occur every now and again, but if you're getting 20 minute leaver busters it's because this has happened a lot. If you were having issues with your client why not endeavour to get them fixed? If a 20 minute leaver buster was needed to prompt you to do so...well that's why they exist. It sucks when things go wrong unexpectedly, but client issues aren't beyond your control.\n\nFirst thing to do is manually run a client repair. Go to the settings (gear icon) in the top right of the client and click \"Initiate full repair\". Load up a few custom games and see if the issue is fixed, if yes, great, if not try doing a full reinstall with the Hextech Repair Tool:\nhttps://support.riotgames.com/hc/en-us/articles/202539040-Reinstalling-League-of-Legends","replies":[]}]}