{"poster":"Villger","date":"2014-05-23T19:01:54.519+0000","title":"Braum és Orianna","subforum":"Hibabejelentés","up_votes":1,"down_votes":0,"body":"Amikor orianna ellövi a q -ját és braum kirakja a pajzsát akkor visszamegy egyböl oriannához, és amikor elnyomom az ultit akkor ugyebár rajtam nyomja el az ulti (remélem érthetően fogalmaztam). Nem lehetne egy késleltetést rányomni mint ahogy kimeg a q ja a látótérből és visszamegy oriho a golyó (mert ugyebár akkor egy mp ig nem lehet [szerencsére] elnyomni az ultit)","replies":[{"poster":"Victorious Ori","date":"2014-06-12T07:38:33.509+0000","up_votes":1,"down_votes":0,"body":"Rájöttem. Pont nem régen játszottam ezekkel a felállásokkal. Yasuo fala egy az egyben megállítja a labdát, és nem engedi továbbmenni. Megáll a fal mellett. Braum falával még bizonytalan vagyok, de ahogyan észrevettem, vele ugyanez történik. Vegyük számba: Yasuo fala az összes azon áttörni próbáló lövedéket megállítja, majd megsemmisíti. Braum fala nem semmisíti meg a lövedéket, csak az első azt érő csapásnak nem lesz hatása. A továbbiak pedig tulajdonképpen \"átmennek\" a falon, hiszen megsebzik Braumot, de Braumon túl nem mennek.\nMegjegyzem: Yasuo fala nem küldi vissza a labdát, úgy látszik, csak bug volt, amit már kijavítottak.","replies":[]},{"poster":"Victorious Ori","date":"2014-05-28T11:06:09.422+0000","up_votes":1,"down_votes":0,"body":"Nos. Orianna a mainem. Ismerem nagyjából, (mint a tenyeremet). Braum és Yasuo fala szinte ugyanaz az első csapásra. Játszottam már nemegyszer Yasuo ellen és a labda, ha a falnak csapódik, azonnal visszateleportál hozzám és Orianna aurájában marad. Nem tudom, milyen ez Braum ellen, de ahogy olvastam, eltűnik. Az nem valami szerencsés, biztosan csak bug, de Braum falának ugyanazt kéne csinálnia A Labdával szemben, mint Yasuo falának. Ezen remélem akkor javítani fognak, mert ugyebár Orianna csakis A Labdával tud skillezni, szóval nem igazán lenne vicces, ha örökre eltűnne (ez csak egy feltételezés).","replies":[]},{"poster":"EGC Shred","date":"2014-05-24T13:19:51.873+0000","up_votes":1,"down_votes":0,"body":"A különbség Yasuo és Braum fala között annyi, hogy Yasuo fala megállítja, Braum fala azonban megsemmisíti a lövedékeket. Ez okozza a problémát.  \nA labdának azonban valahol mindenképp lennie kell... Közel teljesen biztos vagyok benne, hogy a játékmotorban ugyanaz az event fut le a labda Braum falába ütközése esetén, ami akkor is, mikor túl távol mész a labdától, és az visszaugrik hozzád. Ekkor a labda gyakorlatilag megsemmisül, majd egy szempillantás alatt újra létrejön, de már a karaktered mellett, így Mr. Bajusz falába ütközése után könnyen csattanhat rajtad az ultid.\n\n**Szerk.:** Lehet, hogy hülyeséget beszélek, mert ha ugyanaz az event futna le, akkor elméletileg lennie kéne késleltetésnek ebben az esetben is, ami ugyebár nincs. Majd egy okosabb jön, és felhomályosít...","replies":[]},{"poster":"Dei","date":"2014-05-24T12:43:45.660+0000","up_votes":1,"down_votes":0,"body":"A leírás alapján Braum törhetetlen pajzsa megsemmisíti az összes lövedéket. Jó ez így ahogy van.","replies":[]},{"poster":"CSZDragon","date":"2014-05-23T19:49:58.726+0000","up_votes":1,"down_votes":0,"body":"Szerintem is úgy kéne működnie, mint ahogy NessThaesis írja. A gömbnek ott kéne maradnia. Bár nem tudom, mert ezzel a kombóval még nem találkoztam, de szerintem inkább egy bug. De ki tudja.","replies":[]},{"poster":"Looter","date":"2014-05-23T19:15:14.780+0000","up_votes":1,"down_votes":0,"body":"Azt kéne eldönteni, hogy most akkor braum fala ugyanúgy működik e mint yasou fala, mivel yasou falán megáll a gömb.","replies":[]},{"poster":"Villger","date":"2014-05-23T19:02:06.439+0000","up_votes":1,"down_votes":0,"body":"*orihoz","replies":[]}]}