{"poster":"Kuroba","date":"2018-06-11T11:58:10.172+0000","title":"Ein Story Modus für LoL?","subforum":"Karten & Spielmodi","up_votes":7,"down_votes":0,"body":"Hallo,\r\n\r\nkurze Frage, was w&uuml;rdet ihr von einem Story Modus in LoL halten?\r\nDie Starguardianmap war da z.B. ein guter Start. Ich stell mir das ca so vor:\r\nNehmen wir mal als Beispiel Shurima vor seinem Zerfall.\r\n\r\nNun g&auml;be es 10-20 Kapitel, die selbstverst&auml;ndlich extrem schwer werden (bis fast unm&ouml;glich) und auf den Endboss Xerath hinarbeiten (Wenn ich mich richtig erinnere, hat der hier alles kaputt gemacht)\r\n\r\nDabei geht man von der Geschichte Skarners, zu der Geschichte Rek Sai zu Nasus und Renekton usw., sodass die Story Shurimas, in einem Zusammenhang, erz&auml;hlt wird und man sich da einwenig besser mit auskennt. Gerne auch mit Bildern und Comics als zwischensequenzen (davon habt ihr doch schon viele erstellt), f&uuml;r das Abschlie&szlig;en der Meilensteine 5 10 15 20 bekommt man dann gr&ouml;&szlig;ere Belohnungen z.B. bei 5 und 10 eine Truhe mit einem random Skinshard, bei 15 2 Skinshards und bei 20 dann zu 100% einen 1350+ Skinshard. oder einen Gemstone. Irgendwie sowas eben. die kleinen zwischenetappen k&ouml;nnen ja Blue Essence geben, sodass vorallem Neulinge an Champions kommen.\r\n\r\nLetztendlich soll dieser Modus ja aus Spa&szlig; gespielt werden, und nicht wegen den Belohnungen.\r\n\r\nAber so in der Art w&uuml;rd ich mir das vorstellen.","replies":[{"poster":"Doctor Rakan","date":"2018-06-11T18:11:34.483+0000","up_votes":2,"down_votes":1,"body":"ich würde zuerst das Game an sich zum laufen bringen und danach über so etwas nachdenken, klingt interresdant, aber dennoch utopisch","replies":[]},{"poster":"Gwadon","date":"2018-06-11T14:34:31.881+0000","up_votes":2,"down_votes":1,"body":"Das Spiel von dem du redest heißt Diablo 3^^","replies":[]},{"poster":"Released Ape","date":"2018-06-11T20:05:10.313+0000","up_votes":1,"down_votes":0,"body":"Würde einen Story Mode sogar begrüßen, könnte von mir aus auch etwas abstrakter sein und von League etwas abgespalten werden (als eigenes Spiel). Man könnte den Champions dann auch Fähigkeiten passend zur Lore geben und diese wirklich mächtig aussehen lassen. Man könnte es wie ein Hack and Slay Spiel gestalten und es in Klassen einteilen, also das es Schützen, Supporter, etc. gibt und man diese halbwegs freigestalten kann (zum Beispiel eine Magierin kann wie Lux aussehen oder man erstellt sich eine Syndra mit einer Viktor Hand am Rücken, usw.). Dann müsste man auch nicht jeden Champion einpflegen.\n\nKönnte mir das wirklich gut vorstellen, da könnte Riot ihre aktuelle Strategie mit \"Mehr und mehr Schaden, dass wollen wir!\" wirklich gut fahren. Paar shiny Animationen, eine Story die logisch aussieht aber random zusammengeworfen ist, paar Endgegner die viel grinden erfordern, selten erhältliche gemstones, ... und schon geht das Spiel ab. Mikrotransaktionen für Skins, Pets, Banner, mehr Truhenplatz, Serverwechsel, ... und schon ist das Spiel profitabel. Man könnte es auch Pay2Win machen um in diesem Bereich Erfahrungen sammeln, ich sehe es dann schon vor mir\n\n\"Hextech Gunblade\" (kann kostenlos gefunden werden): Alle 3 Sekunden verursacht deine nächste Fähigkeit zusätzlich 100 (+ 2*Stufe) magischen Schaden\n\n\"Masterwork Gunblade\" (kauft man sich für 25 €): Alle 2 Sekunden verursacht deine nächste Fähigkeit oder nächster normaler Angriff zusätzlich 800 absoluten Schaden und heilt dich um 75 % des Gesamtschadens. Überschüssige Heilung wird in ein langsam abfallendes Schild umgeleitet (über 30 Sekunden).\n\nManchmal braucht man P2W Spiele um sich besser und mächtiger als andere zu fühlen, so dachte sich das ein einst bekannter \"Ego-Shooter\" auch mal (Das erste Shooter Game, bei denen Cash Player 4 Head-Shots aushalten und Non-Cash Player one-shot auf dem ganzen Körper sind). Oh ich schweife ab....","replies":[]},{"poster":"Edison ss","date":"2018-06-11T17:06:54.229+0000","up_votes":1,"down_votes":0,"body":"Denke wäre cool aber ich würde es nicht in Kapitel aufteilen sondern mehr als ein flüssiges spiel","replies":[]},{"poster":"Megamaexx","date":"2018-06-11T13:04:42.489+0000","up_votes":1,"down_votes":0,"body":"Ist ja ganz interessant und so, aber was macht das Gameplay aus? Einfach nur Wellen aus Gegnern totspammen, ist nicht unbedingt das, was ich dabei erwarten würde, für ein RPG sind 4 Fähigkeiten etwas wenig, für ein RTS ist LoL nicht ausgelegt. Das hat Potenzial für ein eigenes Spiel, aber nicht als ein in LoL integrierter Spielmodus.","replies":[]},{"poster":"Izaya Kumiho","date":"2018-06-11T12:19:26.293+0000","up_votes":1,"down_votes":0,"body":"Ich würde super gerne für SG, Project, Bloodmoon und Ionia eine Storyline mit so einem Levelsystem sehen. Das wäre voll toll und so! \\O^O/","replies":[]}]}