{"poster":"lioneb","date":"2015-02-25T15:06:52.351+0000","title":"Sofort 2 verlorene spiele in der promo","subforum":"Melde einen Bug","up_votes":1,"down_votes":1,"body":"Ich hatte 90 Punkte und hab ein Spiel gewonnen, bin in die Promo gekommen und hab gleich noch eins gespielt. Nachdem ich des auch gewonnen hab steht bei mir oben jetzt, das ich schon 2 looses hab und den einen win ?????????????????\r\n\r\nBitte helft mir","replies":[{"poster":"HDLuckySlevin","date":"2015-02-25T15:23:56.329+0000","up_votes":1,"down_votes":0,"body":"Das habe ich auch hin und wieder. Das scheint ein Bug zu sein, denn auch wenn ich dann \"laut System\" 2 verlorene Matches habe, habe ich dann, wenn ich die restlichen Matches gewinne trotzdem den Aufstieg geschafft.\n\nSpiel einfach weiter. Sollte es ein Systemfehler sein und du steigst ab, dann schreib dem Support. Aber in die Promo zu kommen sollte ein leichtes für dich sein.\nGL HF in der Promo\n\nGrüße\nHDLuckySlevin","replies":[]},{"poster":"Virtas","date":"2015-02-25T15:09:32.497+0000","up_votes":1,"down_votes":0,"body":"Bei mir wird nur angezeigt dass du 1 Win in der Promo hast... Scheint also alles richtig zu sein","replies":[{"poster":"Suppœrt","date":"2015-02-25T15:16:17.555+0000","up_votes":1,"down_votes":0,"body":"ich glaube er mein die roten X evtl wird es bei ihm falsch angezeigt bei mir steht im Client 2 Ranks 2 gewertet als gewonnen und in der Liga steht nur 1 ok Zeichen also das grüne \n\nund wen ich den Matchverlauf hier auf der Seite anschaue hat er nur ein rank gespielt komischerweise wird auch nur das mit jarv. angezeigt . Also das 2te","replies":[{"poster":"Virtas","date":"2015-02-25T15:21:09.187+0000","up_votes":1,"down_votes":0,"body":"Meinte ich ja^^ hab sowohl im Client als auch auf LoLKing stehen, dass 1 Promo-Match gemacht wurde und er dies gewann","replies":[]}]}]},{"poster":"Suppœrt","date":"2015-02-25T15:08:52.405+0000","up_votes":1,"down_votes":0,"body":"Support melden und abwarten und kein Ranks mehr spielen ...","replies":[]}]}