{"poster":"Vesstan","date":"2019-06-09T13:51:33.184+0000","title":"Make Aram Random Again","subforum":"Karten & Spielmodi","up_votes":7,"down_votes":1,"body":"Liebe ja diesen Gamemode ( bin nicht so der \"schwanzvergleichtyp\" daher weniger Ranked orientiert)\r\n\r\nAllerdings seit wir diesen Championpool haben..\r\n\r\nDas Random geht immer mehr verloren.. leider\r\n\r\nalso egal in welchem Aram, es gibt immer mindestens einen dieser Champs ( Lux, Jhin, Nidalee, Xerath, Fiddle, Ziggs, Kaisa, Ezreal )\r\n\r\nSowie natürlich auch andersherum full Tank Comps\r\n\r\nIch würde mir wirklich wieder ein Random Mode wünschen und kein dreh solange bis es dir passt..","replies":[{"poster":"AramStufe Rot","date":"2019-06-09T23:16:47.954+0000","up_votes":8,"down_votes":0,"body":"find die rolls ok\nwenn du 5 mal hintereinander nen tank random bekommst machste lol einfach aus...kann ich dir aus erfahrung sagen\n\nwürde mir ja wünschen das der komplette champ pool mal kommt\ndann gibts auch keine aram only accs mehr\n\nund die türme...junge junge endweder gehts denen am arsch vorbei das da grad einer am turm steht und das halbe team auseinander nimmt\noder man bekommt aggro obwohl man keinen champ angegriffen hat\n\nbin stark dafür das die türme % schaden machen\ndamit nicht nen garen oder mundo mal eben hinterm turm kommen können und ein snacken","replies":[{"poster":"FBI Fox Mulder","date":"2019-06-24T09:29:17.244+0000","up_votes":1,"down_votes":0,"body":"Du stellst was in den Raum, wovon du wenig Ahnung hast(Tower). Guck dir deine Replays an vom den Games und beobachte genau wie sich die Tower verhalten. \n\nUnd das mit den Tanks sind die tüpischen kacklappen die aram nur spielen damit dir hinten mit xerath, ziggs oder lux etc free poke dmg verteilen können und sich freuen und dann mitn nem full ap team sich aufregen dass tanks auf full mr die unterm tower platt machen. Spielt doch das spiel, spielt es einfach. Finde das mitn rerolls eh unnötig. ALL RANDOM soll in ARAM immer im Vordergrund stehen. Und fürs games leaven sollte man eine ordentliche Sperre bekommen wenn man bei der Auswahl das Spiel zu oft verlässt. Spielt doch einfach den Modus so wie er ist.","replies":[{"poster":"AramStufe Rot","date":"2019-06-24T11:07:51.293+0000","up_votes":2,"down_votes":0,"body":"ich hab über 10k aram spiele...erzähl mir nicht das ich keine ahnung von den türmen habe\nwir sind ne etwas größere gruppe die jeden tag aram spielen und alle sind der meinung das die türme nen rework brauchen\n\nwenn da (name vom tank) einfach hinter den tower rennt und mal fix noch 1-2 wegbumst dann is das nicht mehr lustig\nich bin ja auch für schnelle games aber die dinger sucken hart","replies":[]},{"poster":"Th1rzarr","date":"2019-06-26T23:52:35.990+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FBI Fox Mulder,realm=EUW,application-id=cGRapXds,discussion-id=q5E0vE1O,comment-id=00000000,timestamp=2019-06-24T09:29:17.244+0000)\n>\n> Du stellst was in den Raum, wovon du wenig Ahnung hast(Tower). Guck dir deine Replays an vom den Games und beobachte genau wie sich die Tower verhalten. \n> \n\nalso, so manchmal sind die Tower im aram doch etwas komisch. hatte vor ein paar mal wieder ein game, wir haben das gegnerteam geacet, stehen am gegnerischen tower, es sind mehrere unserer minions in tower range und auf einmal kriege ich tower aggro und bin nach 2 hits tot.\n\nWarum der Tower auf mich aggro ist, wenn ich auf ihn draufkloppe und eigene minions da sind? in SR modus ist mir das noch nie passiert!","replies":[{"poster":"AramStufe Rot","date":"2019-06-28T07:44:41.421+0000","up_votes":1,"down_votes":0,"body":"hab ich gestern in etwa auch gehabt\ngegnerischer ziggs hinterm tower...wir gehen mit 3 leute + unseren minions zum tower\nich geh hinter den tower, habe weder den tower noch ziggs angegriffen, 2 mates waren an tower dran + unsere minions...bekam auf einmal aggro {{sticker:slayer-jinx-unamused}}","replies":[]}]}]}]},{"poster":"SAO Heathcliff","date":"2019-06-11T19:31:03.923+0000","up_votes":1,"down_votes":0,"body":"Bin auch dafür das wenn du Aram spielst den kompletten Pool an Champions hast. Egal ob du ihn besitzen tust oder nicht. Somit wäre das dann wirklich random.\n\nUnd was die Türme angeht, die sollten vielleicht mit skallieren damit keiner mehr ab mit 10 einfach mal sagen kann, was ist denn schaden... -.-''","replies":[]}]}