{"poster":"Electrıc Wızard","date":"2019-02-04T11:58:27.984+0000","title":"CHAT VOCALE MAC OS MOJAVE","subforum":"Aiuto e supporto","up_votes":2,"down_votes":0,"body":"Ragazzi/e qualcuno è riuscito a risolvere il problema del mic?\r\nsu mojave non funzione la chat vocale con nessuna impostazione audio","replies":[{"poster":"beppedessi","date":"2019-02-04T15:27:42.202+0000","up_votes":1,"down_votes":0,"body":"É un problema conosciuto. Come puoi vedere [QUI](https://status.leagueoflegends.com/#euw) la Riot è a conoscenza di questa anomali e vedrai che in un paio di patch verrà risolta. Al momento l'unica cosa da fare è utilizzare un programma terzo come TeamSpeak o Discord...","replies":[{"poster":"Power Mac","date":"2019-02-05T08:33:48.844+0000","up_votes":1,"down_votes":0,"body":"Lo penso anche io, ma evitiamo espressioni impegnative come \"in un paio di patch\": per fortuna non abbiamo problemi di lag come i nostri cugini attualmente, ma noi utenti Mac aspettiamo ancora da due anni che risolvano il problema che impedisce di minimizzare la finestra. Penso che Riot sia l'unica compagnia che possa permettersi di fregarsene di un bug così banale da risolvere, noto e grave. E la cosa peggiore è quando le si scrive via mail affermano sempre di non avere un'ETA, manco stessero riscrivendo il client di nuovo.","replies":[{"poster":"beppedessi","date":"2019-02-05T09:41:40.991+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Power Mac,realm=EUW,application-id=98NGV4Al,discussion-id=gNMoE01N,comment-id=00000000,timestamp=2019-02-05T08:33:48.844+0000)\n>\n> Lo penso anche io, ma evitiamo espressioni impegnative come &quot;in un paio di patch&quot;: per fortuna non abbiamo problemi di lag come i nostri cugini attualmente, ma noi utenti Mac aspettiamo ancora da due anni che risolvano il problema che impedisce di minimizzare la finestra. Penso che Riot sia l&#x27;unica compagnia che possa permettersi di fregarsene di un bug così banale da risolvere, noto e grave. E la cosa peggiore è quando le si scrive via mail affermano sempre di non avere un&#x27;ETA, manco stessero riscrivendo il client di nuovo.\n\nForse hai ragione, un paio patch è troppo ottimistico, ma è quello che mi ripeto per non incazzarmi! Al momento io ho ancora la versione 10.13.6 di macos unicamente per colpa di questo bug su LoL. Menomale che non ho la necessità di aggiornare il sistema operativo al momento... La cosa che mi piace è che appaia nella pagina di stato dei problemi conosciuti. Mi fa sperare che non verrà risolto in tempi eccessivi.\n\np.s. non sai quante volte ho scritto sul forum NA e del PBE per riportare alla luce quel cavolo di bug sulla minimizzazone della finestra...","replies":[{"poster":"Power Mac","date":"2019-02-05T13:48:36.420+0000","up_votes":1,"down_votes":0,"body":"Tra parentesi, non per andare off-topic (del resto penso anch'io che essendo la chat vocale importante, ripareranno presto), ma qualcuno ai piani alti di Riot si è posto il problema di Mac OS 10.15? Ovverosia, del fatto che non verranno più supportate le app a 32 bit? Da come è parso di capire, tutto quel che non è x64 non si avvierà proprio più. Non è un lavoro immane, e l'han fatto una  marea di software house negli ultimi anni, ma comunque non possono pensare di aspettare le prime beta e poi iniziare a ragionare (o addirittura non supportare le nuove versioni)! Spero davvero che ci stiano già lavorando.","replies":[{"poster":"beppedessi","date":"2019-02-06T09:59:22.633+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Power Mac,realm=EUW,application-id=98NGV4Al,discussion-id=gNMoE01N,comment-id=0000000000000000,timestamp=2019-02-05T13:48:36.420+0000)\n>\n> Tra parentesi, non per andare off-topic (del resto penso anch&#x27;io che essendo la chat vocale importante, ripareranno presto), ma qualcuno ai piani alti di Riot si è posto il problema di Mac OS 10.15? Ovverosia, del fatto che non verranno più supportate le app a 32 bit? Da come è parso di capire, tutto quel che non è x64 non si avvierà proprio più. Non è un lavoro immane, e l&#x27;han fatto una  marea di software house negli ultimi anni, ma comunque non possono pensare di aspettare le prime beta e poi iniziare a ragionare (o addirittura non supportare le nuove versioni)! Spero davvero che ci stiano già lavorando.\n\nTrovato! https://www.reddit.com/r/leagueoflegends/comments/8sbes0/gnulinux_compatibility_riot_restores_gpu/e0zoety/","replies":[{"poster":"Power Mac","date":"2019-02-06T16:19:17.098+0000","up_votes":1,"down_votes":0,"body":"Gentilissimo come sempre! All'inizio mi ero preoccupato per i due anni, poi ho visto che il post è di sette mesi fa, quindi recente. L'impiegato Riot dovrebbe sapere che Apple invece l'ha data eccome la timeline: ma a sua discolpa, sette mesi fa nemmeno c'era Mojave! Resta il fatto che comunque un piccolo avviso fugherebbe dubbi ad una marea di utenti: anche solo uno che dicesse \"non siamo sicuri di farcela per il lancio della 10.15, ma ci stiamo lavorando\". \n\nMetal è il futuro grafico di Mac OS X, e sulle macchine recenti potrebbe anche portare ad ulteriori ottimizzazioni per LoL: ad esempio, io che uso la sincronia verticale, ogni tanto durante i momenti più concitati vedo cadere gli FPS a 57 o 58, e in generale non è tutto fluidissimo come con i, seppur inutili a 60 Hz, 90-100 FPS della modalità standard (il che è un effetto degli alti framerate, che però mi piace). L'idea di Vulkan è bella, ma siamo ancora gli esordi, nemmeno su Wine sono ancora riusciti ad ottenere risultati apprezzabili in ambiente Linux, su Mac sono in alto mare. Probabilmente in futuro potrà esserci un unico client per tutti e tre i grandi OS, ma non è un futuro vicino. Tra parentesi, pensavo che il client fosse broken da tempo su Ubuntu con Wine, sono sorpreso.","replies":[{"poster":"beppedessi","date":"2019-02-06T20:16:30.295+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Power Mac,realm=EUW,application-id=98NGV4Al,discussion-id=gNMoE01N,comment-id=000000000000000000010000,timestamp=2019-02-06T16:19:17.098+0000)\n>\n> Gentilissimo come sempre! All&#x27;inizio mi ero preoccupato per i due anni, poi ho visto che il post è di sette mesi fa, quindi recente. L&#x27;impiegato Riot dovrebbe sapere che Apple invece l&#x27;ha data eccome la timeline: ma a sua discolpa, sette mesi fa nemmeno c&#x27;era Mojave! Resta il fatto che comunque un piccolo avviso fugherebbe dubbi ad una marea di utenti: anche solo uno che dicesse &quot;non siamo sicuri di farcela per il lancio della 10.15, ma ci stiamo lavorando&quot;. \n> \n> Metal è il futuro grafico di Mac OS X, e sulle macchine recenti potrebbe anche portare ad ulteriori ottimizzazioni per LoL: ad esempio, io che uso la sincronia verticale, ogni tanto durante i momenti più concitati vedo cadere gli FPS a 57 o 58, e in generale non è tutto fluidissimo come con i, seppur inutili a 60 Hz, 90-100 FPS della modalità standard (il che è un effetto degli alti framerate, che però mi piace). L&#x27;idea di Vulkan è bella, ma siamo ancora gli esordi, nemmeno su Wine sono ancora riusciti ad ottenere risultati apprezzabili in ambiente Linux, su Mac sono in alto mare. Probabilmente in futuro potrà esserci un unico client per tutti e tre i grandi OS, ma non è un futuro vicino. Tra parentesi, pensavo che il client fosse broken da tempo su Ubuntu con Wine, sono sorpreso.\n\nSi è vero! Avevo detto due anni ma è la mia percezione del tempo ad essere sbagliata: non vedo l’ora che esca una qualche notizia ufficiale riguardante il client per Mac e sette mesi mi sono già sembrati un’eternità...","replies":[{"poster":"Power Mac","date":"2019-03-29T17:51:52.659+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=beppedessi,realm=EUW,application-id=98NGV4Al,discussion-id=gNMoE01N,comment-id=0000000000000000000100000000,timestamp=2019-02-06T20:16:30.295+0000)\n>\n> Si è vero! Avevo detto due anni ma è la mia percezione del tempo ad essere sbagliata: non vedo l’ora che esca una qualche notizia ufficiale riguardante il client per Mac e sette mesi mi sono già sembrati un’eternità...\n\nScusa il necro-post ma... mi è venuto in mente che hai avuto ragione.","replies":[]}]}]}]},{"poster":"beppedessi","date":"2019-02-05T19:53:42.183+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Power Mac,realm=EUW,application-id=98NGV4Al,discussion-id=gNMoE01N,comment-id=0000000000000000,timestamp=2019-02-05T13:48:36.420+0000)\n>\n> Tra parentesi, non per andare off-topic (del resto penso anch&#x27;io che essendo la chat vocale importante, ripareranno presto), ma qualcuno ai piani alti di Riot si è posto il problema di Mac OS 10.15? Ovverosia, del fatto che non verranno più supportate le app a 32 bit? Da come è parso di capire, tutto quel che non è x64 non si avvierà proprio più. Non è un lavoro immane, e l&#x27;han fatto una  marea di software house negli ultimi anni, ma comunque non possono pensare di aspettare le prime beta e poi iniziare a ragionare (o addirittura non supportare le nuove versioni)! Spero davvero che ci stiano già lavorando.\n\nGuarda, penso che ci stiano lavorando, o almeno lo spero. Mi ricordo di un commento fatto da un Rioter ormai circa due anni fa che parlava di una transizione presto o tardi \"obbligatoria\" alle API Metal (che quindi comprende anche il porting a 64bit), visto che come accadrà per le applicazioni a 32bit anche quelle che utilizzano OpenGL prima o poi verranno tagliate fuori. Se lo ritrovo te lo linko.","replies":[]}]}]}]}]}]}