{"poster":"OCG Blade8895","date":"2018-12-30T14:34:31.695+0000","title":"OrcaGaming - eSports sucht Support (Plat-Low Dia) für Sinn League Season 2","subforum":"Clans & Teams","embed":{"description":"eSports","url":"http://OrcaGaming.de","image":"https://orcagaming.de/wp-content/uploads/2018/10/LogoREDNewColor.png"},"up_votes":1,"down_votes":0,"body":"**OrcaGaming**\r\nWir sind eine eSports Organisation seit 2017 mit dem Bestreben, indem was wir tun, immer besser zu werden! Derzeit z&auml;hlen wir ein Counter-Strike Team, dass sich auf Platz 3 in ihrer Gruppe innerhalb der Division 5 der 99Damage Liga befindet. Des Weiteren wurde Anfang Oktober ein League of Legends Team gegr&uuml;ndet und hat bereits erste Erfolge in der Summoners-Inn Liga erzielen k&ouml;nnen! Die Season 1 der Summoner&rsquo;s Inn Liga haben wir auf einem soliden 2. Platz der Division 4.12 abgeschlossen.\r\n**\r\nWir ben&ouml;tigen:**\r\nF&uuml;r die 2. Season der Summoner&rsquo;s Inn Liga ben&ouml;tigen wir einen Supporter mit Teamerfahrung! Dieser muss mindestens 18 Jahre alt, und bereit sein semi-professionell League of Legends zu spielen, dies bedeutet mindestens 3x Trainingseinheiten die Woche zzgl. 1 Ligaspiel. (Sobald die neue Season der Summoner&rsquo;s In Liga beginnt. Datum derzeit noch unbekannt)\r\n\r\nUnsere Trainingszeiten sind derzeit **Di + Do 18:45-21 Uhr und Sonntag 14:45-17 Uhr**. Diese Zeiten k&ouml;nnen sich bei Bedarf auch &auml;ndern! Dies bedeutet, dass wir, sobald sich ein Support findet, noch einmal &uuml;ber diese Zeiten sprechen werden!\r\n**\r\nWir bieten:**\r\n- Teamspeak 3 Server mit Trainingsbereich indem ihr ungest&ouml;rt bleibt\r\n- Einen Slot in der Division 4 der Summoners-Inn Liga Season #2\r\n- Ambitionen f&uuml;r mehr (LAN-Events, gr&ouml;&szlig;ere Turniere, etc.)\r\n- Ein offenes Ohr fast rund um die Uhr\r\n- Aktiv gestaltete Website mit Spielerprofilen\r\n- (Ab Januar 2019) Verein als organisatorische Grundlage (eSports-Wear &amp; Merchandise, finanzielle Unterst&uuml;tzung f&uuml;r/auf LAN&rsquo;s)\r\n**\r\nWir erwarten:**\r\nWir erwarten P&uuml;nktlichkeit und Kritikf&auml;higkeit von jedem Einzelnen. Unter Anderem erwarten wir eine klare Mikro Qualit&auml;t, sodass w&auml;hrend hektischen und evtl. lauteren Situationen dennoch eine gute und verst&auml;ndliche Kommunikation m&ouml;glich ist. Des Weiteren wird nach der Aufnahme als aktiver Spieler im LineUP auch die Mitgliedschaft im Verein erwartet.\r\n\r\n**Bewerbungsablauf:**\r\nDa wir keine Zeit f&uuml;r wochenlange Playoffs haben, f&uuml;hren wir ein kurzes Gespr&auml;ch im Teamspeak um euch kennenzulernen und evtl. Fragen eurerseits nach unseren detaillierten Vorstellungen zu kl&auml;ren. Des Weiteren werden im Anschluss 2-3 Games mit - m&ouml;glichst - dem kompletten Team gemacht (je nach Verf&uuml;gbarkeit). Im Anschluss daran bekommt ihr nat&uuml;rlich eine Bedenkzeit von 24 Stunden um euch f&uuml;r das Team zu entscheiden. Wenn ihr euch f&uuml;r uns entscheiden solltet dann gilt die Verpflichtung nur f&uuml;r die derzeitige Season, d.h. bis voraussichtlich Ende November! Dar&uuml;ber hinaus ist nat&uuml;rlich auch m&ouml;glich.\r\n\r\n**Wenn wir euer Interesse geweckt haben seit ihr gerne auf unseren TS3 eingeladen! Die Adresse lautet:\r\nOrcaGaming.de**\r\n\r\nFolgende Personen stehen f&uuml;r euch als Ansprechpartner bereit:\r\n**Blade8895/Justin (14-21 Uhr)**\r\n\r\nMit freundlichen Gr&uuml;&szlig;en\r\n**Das OrcaGaming Management**","replies":[]}