{"poster":"YUGGHCK","date":"2014-11-01T18:41:12.916+0000","title":"Why does Frozen Heart not have a visual aura?","subforum":"Gameplay","up_votes":39,"down_votes":2,"body":"Why does this bad boy not have a visual aura? {{item:3001}} has one. How cool would it be to have a frozen circle following you around like {{champion:44}} ? Just another clarity thing.","replies":[{"poster":"FeralPony","date":"2014-11-02T06:42:49.148+0000","up_votes":19,"down_votes":1,"body":"The reason we don't have one is actually for the sake of clarity. While adding more effects, indicators, etc can result in improved clarity there is a cost to doing so which is increasing visual noise. There is only so much screen space and so many places, objects, and moving pieces a single players eyes can follow and interpret in a given scenario. Once you hit that threshold any additional effects or indicators either get lost or visually clobber another important gameplay effect. It can be as helpful, if not more helpful, to remove or reduce the size of existing effects in improve clarity rather than add or amplify existing effects. \n\nIn this specific case a giant frozen circle ring would almost certainly cause more clutter and obfuscate more desired effects than improve overall clarity. Though it would feel pretty cool for the purchaser (which is important) the clarity cost by adding that much visual noise was high enough we chose not to do it.","replies":[{"poster":"Tiropat","date":"2014-11-02T07:57:51.462+0000","up_votes":13,"down_votes":0,"body":"Could there be at least an aura radius shown when you hover over the item similar to when you hover on {{champion:67}}'s passive?","replies":[{"poster":"FeralPony","date":"2014-11-03T02:44:39.193+0000","up_votes":4,"down_votes":0,"body":"Pretty sure there is one currently similar to other aura items. If not I'll add it to my backlog, cause that sounds like a bug.","replies":[{"poster":"Shentok","date":"2014-11-03T05:31:07.909+0000","up_votes":2,"down_votes":0,"body":"There used to be a range indicator when you hovered over aura items. It's been missing for several patches.","replies":[]},{"poster":"Jingerbeardman","date":"2014-11-03T05:01:05.192+0000","up_votes":1,"down_votes":0,"body":"there are actually quite a few items that could use this done as well.","replies":[]},{"poster":"Tiropat","date":"2014-11-03T04:36:14.052+0000","up_votes":1,"down_votes":0,"body":"Thanks rito :)","replies":[]}]}]},{"poster":"Zydron","date":"2014-11-02T19:06:58.275+0000","up_votes":2,"down_votes":0,"body":"Honestly there is already a lot of aura indicators for items and if you have all of them, you have a lot of indicators under your feet, (and that's not even mentioning buffs, but I think those are getting visually changed) either way there will never be a time when you have every aura (unless you are {{champion:32}} )","replies":[]},{"poster":"TheI3igDaddy","date":"2014-11-02T07:02:16.332+0000","up_votes":2,"down_votes":0,"body":"What if I proposed a small haze-like visual similar to Hecarim's Spirit of Dread? It would be a very icy blue color (so almost white or grey) and in combat, I don't think it would be a huge issue, but in the moments before a teamfight, the ADC could notice it as the players are strafing around and take note of the debuff.\n\nEDIT: I meant to add that it's not the same size as Hec's W; I was thinking about a 200 unit distance for the visual...although I know with that, the haze might be misleading to the aura's actual range. ","replies":[]},{"poster":"Malah","date":"2014-11-04T19:03:30.545+0000","up_votes":2,"down_votes":1,"body":"Okay, stop with the bullshit buzzwords. You've added a ridiculous amount of effect clutter to the game over time; FH's power is certainly worth highlighting considering the team-wide %AS effect it has, which *nobody* gives enough weight to. Unless you specifically remember who has the aura and can eyeball the radius effect by memory, you can't make decisions around that aura, and -15% AS is hardly an insignificant effect.\n\nNobody wants fifty rings overlapping because you guys shove too many passive auras in the game, but FH should at least have a noticeable indicator effect. You want to play the buzzword game? Hey, look, I have another one! Let's take \"invisible power\" for a spin: that's another term which devs like to use with incredibly selective memory.","replies":[]},{"poster":"darkdill","date":"2014-11-02T19:06:54.160+0000","up_votes":1,"down_votes":0,"body":"If adding visual noise is so toxic, why are there no toggleables in options?","replies":[]}]},{"poster":"Sailor Mint","date":"2014-11-01T18:45:03.547+0000","up_votes":13,"down_votes":0,"body":"You can see a snowflake on affected targets.\n\nIn all honesty, auras just add ground clutter.","replies":[{"poster":"SecretAgentHulk","date":"2014-11-01T19:39:16.445+0000","up_votes":15,"down_votes":2,"body":"{{champion:37}} {{item:3001}} {{item:3190}} needs another aura. For realz. This is about swag, yo. Don't you be trying to steal my swag.","replies":[{"poster":"Wulf Helhammer","date":"2014-11-02T03:30:18.105+0000","up_votes":9,"down_votes":2,"body":"{{champion:37}} {{item:3001}} {{item:3190}} {{item:3068}} {{item:3110}} {{item:3105}} {{item:3050}} {{item:3060}} BUY ALL THE AURAS!!!!","replies":[{"poster":"ShadowNinetails","date":"2014-11-02T06:50:47.831+0000","up_votes":3,"down_votes":1,"body":"7 items? Hax.","replies":[{"poster":"Mushkai","date":"2014-11-02T09:39:35.756+0000","up_votes":9,"down_votes":0,"body":"isn't one of the items the component to the other one?","replies":[{"poster":"EvilRabbitt","date":"2014-11-02T17:06:13.339+0000","up_votes":3,"down_votes":0,"body":"Aegis becomes locket.\nIcon 6 becomes icon 3.","replies":[]},{"poster":"ShadowNinetails","date":"2014-11-02T17:48:01.063+0000","up_votes":2,"down_votes":0,"body":"As the joke completely misses the mark...","replies":[{"poster":"Mushkai","date":"2014-11-02T18:02:25.488+0000","up_votes":2,"down_votes":0,"body":"not really xD But sometime people don't notice...","replies":[]}]}]}]}]}]}]},{"poster":"Malicious Fury","date":"2014-11-01T23:13:17.076+0000","up_votes":6,"down_votes":1,"body":"Only if {{champion:17}} gets a Global Taunt aura visual...","replies":[{"poster":"FeralPony","date":"2014-11-03T04:57:33.581+0000","up_votes":12,"down_votes":0,"body":"We added this feature a while ago. If Teemo can be seen by any member of your team an icon of his face will appear on your minimap with his location so you can hunt him down.","replies":[]},{"poster":"TheRainInSpain","date":"2014-11-02T02:13:37.862+0000","up_votes":8,"down_votes":1,"body":"The fact he exists *is* the visual.","replies":[]},{"poster":"SilentOppressor","date":"2014-11-02T04:43:47.043+0000","up_votes":3,"down_votes":1,"body":"The grass of the Rift wilts, the snow of the Abyss turns to lava, the Treeline's jungle is ablaze and the Crystal Scar is breaking at the seams. All because one yordle stepped on the scene.","replies":[]},{"poster":"KillaTron100","date":"2014-11-02T20:21:05.393+0000","up_votes":1,"down_votes":0,"body":"He is a global taunt.","replies":[]}]},{"poster":"Terchuy","date":"2014-11-01T20:48:20.129+0000","up_votes":2,"down_votes":0,"body":"Frozen Heart's range is gigantic and its aura is permanent. What would be the point of the indicator? \"Don't stand in autoattack range of the tank or your Attack Speed will go down.\"","replies":[{"poster":"TheRainInSpain","date":"2014-11-02T02:14:23.570+0000","up_votes":5,"down_votes":0,"body":"Don't stand near that Sunfire Cape or you'll be damaged!","replies":[]}]},{"poster":"gubigubi","date":"2014-11-02T03:19:33.773+0000","up_votes":3,"down_votes":0,"body":"Riot is going to have to be very careful how many visuals they eventually end up adding because you can only ad so many things for clarity sake before it becomes like wow raids and you cant see anything at all under the spell effects.\n\nSome times less is more.","replies":[]},{"poster":"I Main Swain","date":"2014-11-01T20:49:54.277+0000","up_votes":2,"down_votes":0,"body":"I honestly forget all the time that it even has an aura, largely because visually there isn't one.","replies":[{"poster":"AbodyHUN666","date":"2014-11-02T10:52:27.241+0000","up_votes":2,"down_votes":0,"body":"I mostly buy it just for the aura xD op vs Yi and Tryndamere","replies":[]}]},{"poster":"Leblancs Boob","date":"2014-11-01T19:16:27.053+0000","up_votes":3,"down_votes":1,"body":"{{champion:28}}","replies":[]},{"poster":"Quepha","date":"2014-11-02T17:34:51.722+0000","up_votes":1,"down_votes":0,"body":"the problem is that it's very hard to tell when your champion is affected by an AS slow, even while attacking. MS is obvious, you can generally tell damage taken if there aren't many damage sources, but you have to be attacking to notice frozen heart's aura and you're still wondering \"huh, was my attack that slow before or am i just overestimating my AS boosts?\"","replies":[]},{"poster":"BrickcityBryant","date":"2014-11-02T13:03:13.484+0000","up_votes":1,"down_votes":0,"body":"in all honesty you can see the effect on the icon, why would you need anything else?","replies":[]},{"poster":"sir d wreck","date":"2014-11-02T09:24:28.142+0000","up_votes":1,"down_votes":0,"body":"This is a good idea, upvoted for visibility.","replies":[]},{"poster":"KowaiKami","date":"2014-11-02T23:42:25.591+0000","up_votes":3,"down_votes":5,"body":"Riot in its infinite wisdom has 3 latin servers, and one NA server. super duper smart. Why do they have 3 servers....they don't even have clean water.... Us east coast players are stuck playing at 130-140 ping everygame. I switched to LAN and play at 40 ms...guess what? i jumped up a whole tier...and im still climbing. The pros are Cali in for the ping while Riot gives a middle finger to the rest of us. I made the realization that they aren't good....they are just at really low pings.","replies":[{"poster":"agustinlabarque","date":"2014-11-03T05:30:57.736+0000","up_votes":2,"down_votes":0,"body":"> Riot in its infinite wisdom has 3 latin servers, and one NA server. super duper smart. Why do they have 3 servers....they don't even have clean water.... Us east coast players are stuck playing at 130-140 ping everygame. I switched to LAN and play at 40 ms...guess what? i jumped up a whole tier...and im still climbing. The pros are Cali in for the ping while Riot gives a middle finger to the rest of us. I made the realization that they aren't good....they are just at really low pings.\n\nJust to let you know, we wash our hands and bath with drinkable water, I heard europeans bath less than once everyday (met an austrian guy who bathed less than once in a week) and they are forced to buy bottles of water because they can't drink water from their faucets. Please don't generalize.","replies":[]}]},{"poster":"2000boxes","date":"2014-11-02T18:44:42.942+0000","up_votes":1,"down_votes":1,"body":"it does have a visual affect\nenemies in range get a snowflake floating above their heads","replies":[]},{"poster":"TenSlashTen","date":"2014-11-02T12:00:39.510+0000","up_votes":1,"down_votes":1,"body":"AURAS ARE VISUAL CLUTTER\nplz no visual clutter v.v","replies":[]}]}