{"poster":"DIELINK","date":"2020-01-19T02:23:31.825+0000","title":"Akali esta mal hecha","subforum":"Jugabilidad, balance y narrativa","embed":{"description":"Soy parte del Programa de Socios de LoL oficial de Riot Games. Para más información acerca del programa: https://partners.leagueoflegends.com/... ÚNETE AL CANAL!","url":"https://www.youtube.com/watch?v=WTLr35z-wn0","image":"https://i.ytimg.com/vi/WTLr35z-wn0/hqdefault.jpg"},"up_votes":4,"down_votes":1,"body":"Holaaaaa!!!!!!\nEl video no es mio es de Seba de la Akali Army todos los creditos a dicha persona, es algo que yo tambien pienso pero me da paja grabar o escribir tantos problemas que tiene el champ.\n\nRiotgames devuelvan a la antigua Akali pls!!!! \nSe aceptan criticas contructivas.\nSaludos y suerte gente!!!","replies":[{"poster":"Parry To Life","date":"2020-01-19T02:47:33.242+0000","up_votes":3,"down_votes":0,"body":"lo que pasa es que el kit de habilidades del campeón es demasiado bueno y tienen que nerfearlo de alguna forma, yo estoy de a cuerdo con los nerf a ese champ, los que los defienden son todos main akaly","replies":[{"poster":"DIELINK","date":"2020-01-19T02:57:02.154+0000","up_votes":1,"down_votes":0,"body":"correcto el kit de habilidades esta mal hecho, estamos hablando de un champ que con el rework tiene 3 saltos y invisiblidad.\ncon respecto al nerf, yo creo que es necesario, que este en la B durante un o dos parches maximo y despues vean que se puede hacer, \nclaro que mi sueño humedo es que metan a la antigua Akali, pero manteniendo el rework visual. \nSaludos nuevamente","replies":[{"poster":"Parry To Life","date":"2020-01-19T04:16:17.504+0000","up_votes":1,"down_votes":0,"body":"a mi también me gusta la akaly antigua de echo fue unos de los campeones que mas use, pero dudo que la vuelvan a atras, como dice el tipo de el vídeo \"si lo hicieron con LB por que conn akaly no?\" LB fue un rework solamente de habilidades y las animaciones eran las mismas fue un mini rework como a rengar que le paso lo mismo, quizas podrian hacerle un rework a akaly pero seria bastante extraño.","replies":[]}]}]},{"poster":"TheFalc","date":"2020-01-19T07:04:13.377+0000","up_votes":2,"down_votes":0,"body":"Ahh, si, mí amo y señor hashinshin estará deleitado","replies":[]},{"poster":"Nightmaresparkle","date":"2020-01-20T01:15:28.832+0000","up_votes":1,"down_votes":0,"body":"Esta actual akali es mierda esta hecha solo para vender y vender y nunca podran arreglarla","replies":[]},{"poster":"VenganceZ","date":"2020-01-19T19:22:16.176+0000","up_votes":1,"down_votes":0,"body":"Yo ya subí ese vídeo uwu copión ahr jaja","replies":[]},{"poster":"BASHERHUNTER","date":"2020-01-19T15:22:39.601+0000","up_votes":1,"down_votes":0,"body":"Estoy alegre por el cambio a su W pero mas nerfs a la R me parece una barbaridad, soy main yasuo y la veces que me tocaba mid o top odiaba ir vs akali.\nDeberian reducir el cd de su r y aumentar el escalado de ad de esa habilidad asi no solo la arman ap.\nQue opinas?","replies":[]},{"poster":"LeyendaRankeQ","date":"2020-01-19T02:29:02.696+0000","up_votes":2,"down_votes":2,"body":"A llorar a la iglesia ese champ tiene una variedad de habilidades que en manos de un main Akaly se vuelve imposible. Yasuo y otros se quedan muy atras xD A seguir llorando xD.","replies":[{"poster":"DIELINK","date":"2020-01-19T02:32:36.591+0000","up_votes":1,"down_votes":1,"body":"ni siquiera viste el video probablemente, por favor miralo y vuelve.\npor otro lado cualquier champ en buenas manos se vuelve imposible.\nbuenas noches","replies":[{"poster":"LeyendaRankeQ","date":"2020-01-19T02:39:47.412+0000","up_votes":1,"down_votes":0,"body":"Puede ser puede ser.","replies":[]}]}]},{"poster":"Sabanur","date":"2020-01-19T07:48:14.624+0000","up_votes":1,"down_votes":1,"body":"Campeona rota su Q es inesquivable y tiene rango de mago esa mierda, borrenla del Game mejor","replies":[]}]}