{"poster":"Drcurby","date":"2015-04-26T10:47:10.174+0000","title":"Tages Quests ?","subforum":"Champions & Gameplay","up_votes":6,"down_votes":4,"body":"Hallo liebe LoL Community ich hatte die idee, das Tages quest in League of Legends hinzugef&uuml;gt werden sollen wie zb. in Hearthstone und Heroes of the storm. \r\nDies h&auml;tte den vorteil, dass viele leute anti-meta Champs spielen w&uuml;rden oder man andere rollen/lanes ausprobieren w&uuml;rde \r\nEin paar beispiele w&auml;ren : \r\nSpiele 2 Games mit einem Champion aus Demacia Belohnung 200  ip (die Belohnung w&auml;re unterschiedlich )\r\nSpiele 2 Spiele mit Caitlyn etc.\r\nPlatziere insgesamt 50 wards \r\nT&ouml;te 50 Jungle Monster in einem Spiel\r\nGewinne 3 Spiele in Folge \r\nErlange den Baron Buff\r\nT&ouml;te 100 Vasallen in einem Spiel\r\nbeende 3 spiele indem du weniger als 2 mal stirbst\r\nWerde in einem Spiel legend&auml;r......\r\n\r\nAls Belohnung k&ouml;nne man auch was anderes nehmen wie zb. wenn man eine quest die extra auf einen speziellen champion basiert macht k&ouml;nnte man ja mehr punkte in dem kommenden champion mastery bekommen","replies":[{"poster":"MetaBunny","date":"2015-04-29T09:27:25.134+0000","up_votes":2,"down_votes":0,"body":"Lol Quest töte Jinx, keiner spielt sie mehr, und wenn dann campen vier Mitspieler auf der Botlane und rennen wie die Wilden in den Tower nur um Jinx zu töten.","replies":[]},{"poster":"Dermel","date":"2015-04-26T19:21:24.929+0000","up_votes":2,"down_votes":0,"body":"Also spiele 2 spiele mit Champion XY oder so ist halt wie schon genannt problematisch, stärkt auch schön den instalock.50 neutrale Monster 200 Vasallen insgesamt also egal wie viele Spiele fände ich dagegen gut, weil manche nur so kapieren, dass es keine Zeitverschwendung ist, Vasallen zu killen sondern was bringt... Gewinne 3 spiele in Folge:\"Noob you stopped my winstreak, report you\" (ja so etwa in der sprachlichen Qualität. Stattdessen: _Spiele ein Spiel als Supporter_ Das würde den Mangel an Supportern doch etwas kompensieren. Fazit: ★★★ von 5 wegen den verbesserungswürdig Ideen, Grundidee gut.","replies":[]},{"poster":"Lady Yunalesca","date":"2015-04-26T13:39:43.505+0000","up_votes":2,"down_votes":0,"body":"Finde ich eine gute Idee,solange die Belohnung nicht zu groß sind würde es wohl kaum dem spielspaß entgegen stehen :D","replies":[]},{"poster":"Evenrider","date":"2015-04-26T11:22:07.069+0000","up_votes":3,"down_votes":2,"body":"Würde manche vom Hauptziel ablenken.\nz.b. Muss noch 1 Spiel mit einem Champion des Mt. Targon. Werde aber zum ADC \"genötigt\" (Lastpick und der bleibt übrig). Wie jeder weiß, stammen bisher nur Leona, Diana und Panth von dem Berg.\nWenn ich jetzt einen der Champion picke für den Tagesquest, zerlege ich mein Team auf mentaler Ebene. Wenn nicht, kann ich den Quest nicht machen. Allerdings habe ich doch nur noch diese eine Spiel, da ich danach keine Zeit mehr habe...\n\nOder man braucht den Baronbuff. Dann würden diese Spieler auf Teufel komm raus den Baron versuchen, statt zu beenden, wenn sie könnten.\nBei den 50 Wards wird jemand den Sighstone kaufen, dazu Wards und die Base vollwarden.\n...","replies":[{"poster":"Kéllin","date":"2015-04-26T13:20:38.447+0000","up_votes":2,"down_votes":0,"body":"1. Da gibt es etwas das sich Teambuilder nennt, musst du unbedingt mal ausprobieren ;-)\n2. Wieso willst du denn unbdingt deine Tagesquest erledigen? Bringt es dir irgendeinen Vorteil gegenüber anderen die sie nicht machen? \n3. Wenn die Belohnung nicht grade RP sind, wird man sich nicht extra einen Sightstone kaufen (wobei das auf garkeinem Champion schlecht ist, aber es gibt ja Trinkets und normale Wards)\n4. Gut ihr macht Baron und baut euren Vorteil noch weiter aus, wenn ihr nicht grade behind seid und das eure einzige Chance ist zu finishen ist, ist es garnicht so tragisch. Und zudem würde das wennn schon in Normals passieren, selbst im Ranked ist jedem ein Sieg leiber als ein paar Tagesquest.","replies":[{"poster":"Evenrider","date":"2015-04-26T14:15:43.737+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Kéllin,realm=EUW,application-id=Wj1wcocU,discussion-id=XFdE7hV3,comment-id=00000000,timestamp=2015-04-26T13:20:38.447+0000)\n>\n> 1. Da gibt es etwas das sich Teambuilder nennt, musst du unbedingt mal ausprobieren ;-)\n> 2. Wieso willst du denn unbdingt deine Tagesquest erledigen? Bringt es dir irgendeinen Vorteil gegenüber anderen die sie nicht machen? \n> 3. Wenn die Belohnung nicht grade RP sind, wird man sich nicht extra einen Sightstone kaufen (wobei das auf garkeinem Champion schlecht ist, aber es gibt ja Trinkets und normale Wards)\n> 4. Gut ihr macht Baron und baut euren Vorteil noch weiter aus, wenn ihr nicht grade behind seid und das eure einzige Chance ist zu finishen ist, ist es garnicht so tragisch. Und zudem würde das wennn schon in Normals passieren, selbst im Ranked ist jedem ein Sieg leiber als ein paar Tagesquest.\n\n1. Gut der klappt natürlich.\n2. Weil sie zusätzliche IP geben und bei z.b. 200 IP lohnt sich die Bonusaufgabe mehr als ein Win.\n3. Wenn man mal eben schnell die 30 Wards haben will schon. Bei Spiele auf meiner Elo kommt der Support vielleicht auf 15-20. Die anderen liegen weit darunter, dadurch zum spammen von Wards perfekt. Aber es ging eher um Wardspamming im Fountain.\n4. Statt zu finischen wird ein dämlicher Baron versucht, der geht schief/wird gestohlen und das Gegnerteam aced und gewinnt. Oder statt sicherere Objektives zu holen (z.b. ein fast zerstörter Turm) wird der gewardete Baron in angriff genommen, obwohl das Gegnerteam stärker ist. Dieses kommt dann dazu, Ace und Lose.\n\nAber auch deine anderen Beispiele sind zweifelhaft.\nz.b. maximal 2 Tode: Statt zu kämpfen spiele ich ganz save um blos nicht zu sterben, das natürlich noch als der Tank, wodurch mein Team ohne wirkliche Frontline 4vs5 kämpft.\n\nDas Problem ist, sobald die Belohnung größer ist, als die Belohnung nach einem Sieg, könnte es Sinn machen das Spiel absichtlich zu \"sabotieren\", um die Aufgabe zu schaffen und die Niederlage hinzunehmen.","replies":[{"poster":"Kéllin","date":"2015-04-26T14:30:39.676+0000","up_votes":1,"down_votes":5,"body":"Solange es sich nicht um Rankeds handelt, sind all diese Situationen keine tragischen Vorfälle. Außerdem geht man davon aus, dass man LoL spielt um Spaß zu haben und nicht in der Foutain zu stehen und Wards zu spammen um eine lächerliche Quest zu beenden, wenn man sowas schon tut, dann ist man von Natur aus schon toxic.\n\nIch finde den Vorschlag den der Threadersteller am Ende gebracht hat sehr schön. Wenn Championmastery kommt, dann könnte solche Quest wie z.B Töte 300 Vasallen in einem Spiel ganz praktisch sein, wodurch man dann mehr Punkte erhält als Normal. Jedoch sollten diese Quest täglich variieren. Sowas wäre schon ganz praktisch, wenn man davon ausgeht das die aktuelle Tagesquest nur mit einem Win zusammen hängt könnte das ein bisschen mehr Motvation ins Spiel bringen.","replies":[{"poster":"Shiggyvara","date":"2015-04-26T18:25:05.802+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Kéllin,realm=EUW,application-id=Wj1wcocU,discussion-id=XFdE7hV3,comment-id=0000000000000000,timestamp=2015-04-26T14:30:39.676+0000)\n>\n> Solange es sich nicht um Rankeds handelt, sind all diese Situationen keine tragischen Vorfälle.\n\nEntweder überall oder nirgends tragisch. Bei Rankeds gewinnst du auch nicht mehr, als das dir deine Platzierung angezeigt wird...","replies":[]}]}]}]}]},{"poster":"Holger Hodensack","date":"2016-03-24T11:43:42.066+0000","up_votes":1,"down_votes":0,"body":"Hi!\n\nI know it's late but I made a website that does exactly this! For more information check this post:\n\nhttp://boards.euw.leagueoflegends.com/en/c/forum-games-contests-en/RMrMYl4n-league-of-quests-repost-with-new-url-free-skin-for-best-quester-of-march\n\nIf you wanna try it out, just go to \n\n**leagueofquests.com**\n\nHave fun! :)","replies":[]},{"poster":"BG Steckling","date":"2015-04-26T20:09:00.503+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"eingew","date":"2015-04-29T10:16:17.764+0000","up_votes":1,"down_votes":0,"body":"Was wäre an einem KS schlimm? 0.o","replies":[{"poster":"BG Steckling","date":"2015-04-30T21:54:36.822+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"eingew","date":"2015-05-01T11:09:38.474+0000","up_votes":1,"down_votes":0,"body":"Das ist mir glücklicherweise noch nicht passiert. Leaven wegen einem KS? Naja, wer so stark nach Strafen schreit hält sich vermutlich auch nicht lange in diesem Spiel.","replies":[]}]}]}]},{"poster":"HyperionCH","date":"2015-04-29T09:58:19.036+0000","up_votes":1,"down_votes":0,"body":"Überzeugt mich jetzt nicht wirklich, weil es dann zu viele Spieler gibt, die nur die Quests abgrasen:\n\n\n> Spiele 2 Games mit einem Champion aus Demacia Belohnung 200  ip (die Belohnung w&auml;re unterschiedlich )\n\nDann werden (fast) nur noch diese Champs gepickt, egal ob es fürs ganze Team sinnvoll ist. Lux-Jungle, weil ein Mate junglen muss (Lastpick) aber nur noch Lux verfügbar war, um den Quest zu erfüllen? Ob dies das Team möchte...\n\n> Spiele 2 Spiele mit Caitlyn etc.\n\nWird auch hier schwierig. Klar, der TB wäre hier eine Option, um den Quest zu erfüllen.\nDie Warteschlangen wären dann aber extrem lang, weil alle Cait spielen wollen und die anderen Warteschlangen (Sup, Jungler, etc.) trocken wie ein Martini ist.\n\n> Platziere insgesamt 50 wards \n\nWird wohl zu Ward-Spaming führen. Selbst der Vorschlag, dass er in einem Busch sein muss: Sightstone + Homegards -> zum nächsten Busch alle Wards spammen -> back gehen -> wieder zum nächsten Busch rennen, etc.\nWird wohl nicht dem Team gefallen. ;)\n\n> T&ouml;te 50 Jungle Monster in einem Spiel\n\nDann sind wohl mindestens 2 Jungler im Team. ;)\n\n> Gewinne 3 Spiele in Folge \n\nMacht hier sogar Sinn. Jedoch besteht hier grosse Flame-Gefahr, wenn jemand bereits 2 Games gewonnen hat (ich denke, Botgames gehören nicht dazu) und im dritten am verlieren ist.\n\nGewinne 1 Game gibt es btw. bereits als Quest. Dafür gibt es 150 Einflusspunkte. ;)\n\n> Erlange den Baron Buff\n\nWenn ich sehe, wie oft selbst bei der LCS ein Game am Baron verloren geht, obwohl man in Führung ist...\nDamit kann man rasch ein Game verlieren, nur weil jemand den Quest macht.\n\n> T&ouml;te 100 Vasallen in einem Spiel\n\nDa spielen noch weniger Leute Sup. ;)\nBei höheren Werten (z.B. 200 oder 300): man sieht nur noch Splitpusher/afk farmer.\n\n> beende 3 spiele indem du weniger als 2 mal stirbst\n\nGrundsätzlich sinnvoll, weil viele Spieler zu greedy werden.\nDie Gefahr ist jedoch gross, dass die Teamcombo nicht mehr gut ist. So ist es ganz OK, wenn ein Tank öfters in den TF stirbt, aber dadurch seine DMG-Dealer überleben und der TF z.B. 3:2 ausgeht. Aber wegen solchen Quests tankt wohl kaum jemand mehr.\n\n> Werde in einem Spiel legend&auml;r......\n\nAus meiner Sicht achten eh schon zu viele Spieler auf ihre KDA (oder noch schlimmer: nur K/D).\nMöchte auch nicht gerne das zusätzliche Flame-Potential einschätzen, wenn der Nami-Sup seinen ADC heilt (und damit sein Überleben im TF sicherte), während der Midlaner stirbt und dadurch seinen \"legendär\" nicht erreichte.\n\n\nNatürlich muss dies nicht gleich so extrem aussehen. Jedoch wird wohl ein gewisser Trend erkennbar sein, dass Mates dem Erfüllen der Quests mehr Prioritäten setzen werden als einem Sieg. Aus meiner Sicht sollte man dies nicht fördern.","replies":[{"poster":"eingew","date":"2015-04-29T10:15:28.140+0000","up_votes":1,"down_votes":0,"body":"Mir würde ein \"schaffe 30 Assists\" sehr gut gefallen. Aber sich jeden Tag sowas ausdenken? Ich würde nicht mit Riot tauschen wollen.","replies":[]}]},{"poster":"Lordsteve","date":"2015-04-26T19:21:43.245+0000","up_votes":1,"down_votes":0,"body":"Ich denke bei diesem \"Wards platzieren\" könnte man hinzufügen, dass man sie in einen Busch stellen soll. {{item:2044}}","replies":[]}]}