{"poster":"Sionata","date":"2017-09-18T23:26:13.440+0000","title":"Suspension for having complete Dummies on my team!?","subforum":"Player Behavior","up_votes":0,"down_votes":13,"body":"All i want to do is have a nice game that is even sided maybe we&#039;ll lose or maybe we&#039;ll win but nothing infuriates me more than having complete idiots on my team who do nothing but feed and act autistic in the chat this particular Taliyah ( The one who reported me)  was acting so autistic in the chat saying things like &quot;Daddy spank me&quot; &quot;Go to sleep son&quot; &quot;son&quot; etc really cringey individual and not to mention he went 2/13 feeding the F*ck out of kassadin making the game impossible to win because he would just insta everyone. I Cannot play a game that is entirely one sided thats not fun and the last game i got banned our team went 6- 24 because my jungler decided to dive my top laner 3x and my bot lane was getting absolutely crushed so what is the point thier whole team is fed why the F*ck can&#039;t my team be reasonable and just decide its quits?? first of all there was no chance of a comeback because my teams coordination is so bad, they fed all the enemies making them way to hard to kill but yet my team is so petty they dont want to FF already and just report me straight of the bat because i didn't want to waste a single minute more playing a unbeatable game I believe this Suspension is not deserved im really tired of playing with Dumb asses every game ","replies":[{"poster":"Icy Hot Shoto","date":"2017-09-19T00:08:26.597+0000","up_votes":4,"down_votes":0,"body":"You used hate speech. Which is an automatic 14 day ban with no prior restrictions. Riot has a No Tolerance policy for hate speech. As such, ban deserved.","replies":[]},{"poster":"Rebel 986","date":"2017-09-18T23:55:24.438+0000","up_votes":3,"down_votes":0,"body":"Ur toxic lol. Learn to shut up n mute ppl.","replies":[{"poster":"Sionata","date":"2017-09-18T23:56:40.939+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Rebel 986,realm=NA,application-id=ZGEFLEUQ,discussion-id=OWR84kBu,comment-id=0003,timestamp=2017-09-18T23:55:24.438+0000)\n>\n> Ur toxic lol. Learn to shut up n mute ppl.\n\nYou can't mute a feeding team mate","replies":[{"poster":"Winters Dawn","date":"2017-09-19T00:27:12.431+0000","up_votes":1,"down_votes":0,"body":"Then just shut up","replies":[]}]}]},{"poster":"Sionata","date":"2017-09-18T23:41:19.710+0000","up_votes":2,"down_votes":3,"body":"Sionata: ching ching\nSionata: chong chong\nSionata: %%%%%%%%%%% ching ching\nSionata: chong chong\nSionata: ching ching\nSionata: chongg?\nSionata: ty evel\nSionata: you gonna camp my lane eve?\nSionata: 2 times\nSionata: when my eve was in my bush\nSionata: she was coming to my lane\nSionata: ff\nSionata: dumb team\nSionata: whatever my team is feeding\nSionata: its gg\nSionata: ITS GG\nSionata: They're feeding\nSionata: good onme\nSionata: eve came to my lane and fucked it up\nSionata: you guys on the other hand\nSionata: you have a 6/1 ashe\nSionata: LOL\nSionata: gG\nSionata: Im glad thier jg actually helps\nSionata: i was going crit build but eve came and fucked it up\nSionata: im going to afk\nSionata: i cant\nSionata: uhuh\nSionata: 0/5 zil gonna tell me the facts\nSionata: %%%%%s\nSionata: you can either just waste everyones times by saying no or we can never see each other again. i dont care ill just watch youtube\nSionata: while you suffer","replies":[{"poster":"Tenth Leper","date":"2017-09-19T00:21:41.183+0000","up_votes":2,"down_votes":0,"body":"I appreciate your posting them, sir. I wonder if they would have been willing to surrender if they hadn't felt the need to spite you for your criticism though.  Honestly I am a care bear and would not have been over troubled by you in this case.","replies":[]}]},{"poster":"Icy Hot Shoto","date":"2017-09-18T23:31:37.391+0000","up_votes":2,"down_votes":0,"body":"Chat logs, please.","replies":[{"poster":"Sionata","date":"2017-09-18T23:39:32.486+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Gakupo,realm=NA,application-id=ZGEFLEUQ,discussion-id=OWR84kBu,comment-id=0000,timestamp=2017-09-18T23:31:37.391+0000)\n>\n> Chat logs, please.\n\nI don't have his chat logs but i do have mine","replies":[{"poster":"Icy Hot Shoto","date":"2017-09-18T23:41:40.644+0000","up_votes":2,"down_votes":0,"body":"That's what I was asking for, your chat logs.\n\nIf you want to know if your suspension is deserved/not deserved from the community we need you to post them.","replies":[{"poster":"Sionata","date":"2017-09-18T23:50:59.329+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Gakupo,realm=NA,application-id=ZGEFLEUQ,discussion-id=OWR84kBu,comment-id=000000000000,timestamp=2017-09-18T23:41:40.644+0000)\n>\n> That&#x27;s what I was asking for, your chat logs.\n> \n> If you want to know if your suspension is deserved/not deserved from the community we need you to post them.\n\nUsually the league community will automatically align with any suspension i honestly don't care anymore i just wanted to make a point that this game is way to sensitive and it is full of bad players who ruin the competitiveness of this game. you have to act like you're not mad at your teammates for being complete dumbasses in order not to get banned i don't get why riot thinks minimal sh*t talk is bad in league its literally present in every other game even ones without multiplayer. But when you see somthing so absurd you have to call it out Just like Tyler1 and Dunkey Did","replies":[{"poster":"Winters Dawn","date":"2017-09-19T00:28:00.001+0000","up_votes":1,"down_votes":0,"body":"N","replies":[]}]}]}]}]},{"poster":"Sionata","date":"2017-09-18T23:46:23.417+0000","up_votes":1,"down_votes":5,"body":"I love how people downvote me without any argument gotta love to pure snowflake league community","replies":[]}]}