{"poster":"TRA X DETRA","date":"2015-02-15T03:05:02.784+0000","title":"Como counterear a graves?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"alguien me dice con que champ puedo frenarlo?","replies":[{"poster":"Malas Tripas","date":"2015-02-15T03:24:33.186+0000","up_votes":1,"down_votes":0,"body":"Sivir, Cait y Varus.\nAunque siendo Varus hay que jugar con un poco de cabeza.","replies":[{"poster":"Skyllnex","date":"2015-02-15T06:51:41.496+0000","up_votes":1,"down_votes":0,"body":"Graves es counter de Varus xD (solo necesita saltar para esquivar la Q de varus y ademas que graves gana armadura pasivamente, reduciendo el daño de la Q de varus)\n\nEn cuanto a cait y sivir, si counterean al graves","replies":[{"poster":"Malas Tripas","date":"2015-02-15T14:14:49.709+0000","up_votes":1,"down_votes":0,"body":"Por eso digo que hay que jugar con un poco de cabeza siendo Varus.\nConsidera que Varus, teniendo potencial iniciador, puede comenzar una ofensiva desde muy lejos antes de que Graves stackee la pasiva. Si no se hace a lo tonto y se espera una oportunidad, Varus tiene buenas probabilidades contra Graves. Hay que considerar también que antes de que Graves tenga la BF, Varus tiene todas las de ganar, teniendo muchísimo más daño.","replies":[]}]}]},{"poster":"RayDeath","date":"2015-02-15T10:47:50.553+0000","up_votes":1,"down_votes":0,"body":"Creo que Cait y Lucian ya que te puedes salir rápidamente de la bomba de humo con sus habilidades.","replies":[]},{"poster":"Zystem Cloud","date":"2015-02-15T07:45:40.933+0000","up_votes":1,"down_votes":0,"body":"Hola, 1 vs 1 en si Draven le hace un gran duelo a Graves, no son counter (Ninguno), pero Draven le dificulta mucho a Graves por su daño y movilidad ^^.","replies":[]},{"poster":"Skyllnex","date":"2015-02-15T06:52:52.311+0000","up_votes":1,"down_votes":0,"body":"Por mas que busques un counter adc, bot depende mucho mas de que tan bueno sea el supp","replies":[]},{"poster":"Samuer","date":"2015-02-15T03:24:09.090+0000","up_votes":1,"down_votes":0,"body":"podria ser caitlyn por su rango o sivir,ya que con el escudo que tiene le puede mitigar bastante el busrt que tiene ya sea la q o el ulti\nEspero que te sirva","replies":[]}]}