{"poster":"Bombasa Ozora","date":"2020-02-16T13:26:31.184+0000","title":"Bots verstärken","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":1,"body":"Mir sind die Bots als Gegner zu leicht. Und der höchste Schwierigkeitsgrad der Bots heißt \"dazwischen\" (intermediate). Also muss es etwas stärkeres geben. Sicher ist das Programmieren der KI schwieriger als einer Schnecke in die Weichteile zu treten, aber es gibt da eine einfache Lösung:\r\n**Gebt den Bots mehr Gold** (zum Items kaufen). Bei Demigod wird es so gehandhabt.\r\nIch habe gemerkt, dass die Bots schon knackig sein können, wenn meine Mitspieler diese anfüttern (meist unfreiwillig).\r\nHätte nicht jeder gerne eine größere Herausforderung?\r\nNebenbei: Wer das nicht will, kann ja immer noch auf intermediate einschlafen.","replies":[{"poster":"HHaie tabbian","date":"2020-02-16T22:38:13.406+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Bombasa Ozora,realm=EUW,application-id=cGRapXds,discussion-id=AywkolYn,comment-id=,timestamp=2020-02-16T13:26:31.184+0000)\n>Also muss es etwas stärkeres geben. \n\nDie schweren Bots treffe ich jedes Game in meinen Soloq-Spielen ;)","replies":[]},{"poster":"AramStufe Rot","date":"2020-02-16T13:34:32.903+0000","up_votes":2,"down_votes":0,"body":"wenn ihr was schwierigeres wollt geht normals oder aram spielen","replies":[]},{"poster":"Phoenixale","date":"2020-02-16T17:26:32.823+0000","up_votes":2,"down_votes":1,"body":"Nein. Schwierigere Bots ergeben keinen Sinn.","replies":[]},{"poster":"Amycos Cyrus","date":"2020-02-16T21:33:23.195+0000","up_votes":1,"down_votes":0,"body":"> Also muss es etwas stärkeres geben.\n\n1. Intermediate wird als Mittel übersetzt.\n2. Befinden sie sich ja zwischen den Leichten Bots und dem Niveau von Normal-Games (also Spielern)\n\n> Gebt den Bots mehr Gold (zum Items kaufen).\n\nDadurch werden sie nicht besser. Was die Bots so leicht zu besiegen macht ist, dass sie sehr berechenbar agieren. Sie lassen sich leicht baiten und agieren deutlich unbedachter als Spieler. Es ist egal wie viel Gold sie haben, wenn sie teilweise einfach unter den gegnerischen Tower rennen.\n\n> Hätte nicht jeder gerne eine größere Herausforderung?\n\nWas hältst du denn von den Normals? Da hast du dann deine Herausforderung, die schwerer ist als die Mittel-Bots\n\n> Wer das nicht will, kann ja immer noch auf intermediate einschlafen.\n\nDie Bots haben nicht den Sinn, dass sie das gesamte Spiel abbilden sollen. Sie sollen Spielern ermöglichen gegen einfache Gegner das Spiel kennen zu lernen oder neue Champions zu üben. Eben weil sie eine geringere Herausforderung sind, kann man sich ja auf den eigenen Champion konzentrieren.\nHat man das erledigt, so gibt es ja die PvP-Modi, ob nun auf Summoners Rift oder in der Howling Abyss.","replies":[]},{"poster":"Allerbester Biss","date":"2020-02-16T18:38:21.788+0000","up_votes":1,"down_votes":0,"body":"Wenn du eine größere Herausforderung haben willst, kannst du ja mal gegen mich spielen!","replies":[]},{"poster":"Megamaexx","date":"2020-02-16T16:41:05.490+0000","up_votes":1,"down_votes":0,"body":"> Und der höchste Schwierigkeitsgrad der Bots heißt \"dazwischen\" (intermediate)\n\nOder auch mittel. So wie in mittlere Bots ;)\n\n> Gebt den Bots mehr Gold\n\nNaja, trotzdem bleibt die KI grausig. Selbst die Doombots (RIP my broken AI friends) konnte man easy outplayen und waren zwar witzig, allerdings trotzdem nicht stark genug, um dagegen zu verlieren.","replies":[]}]}