{"poster":"Karora","date":"2016-08-04T15:31:41.831+0000","title":"Jhin Skin Concept","subforum":"Player Creations","up_votes":4,"down_votes":0,"body":"_**Artist Jhin**_\n\nIf you can come up with a better name for the skin, please let me know, it&#039;s not exactly the best skin name at the moment. Jhin is already an artist but I wanted to take a literal approach with his character idea, so it&#039;s going to be very &quot;on the nose&quot;.\n\n**Model:**\nSomething resembling a stereotypical French artist, a black or white long coat with a red cravat or necktie and a beret. His mask could be the Comedy/Tragedy masks (half Melpomene/half Thalia). His cane can look like a regular cane that widens at one end to create the Curtain Call rifle, which I envisioned to be a giant paintbrush or some painting utensil. I&#039;m not exactly sure how to hide the shoulder though, could be a throw-over with paint splotches on it or a huge colour palette or a cape that flows and doesn&#039;t look bulky. Whisper is a paint-gun but I don&#039;t have any idea what it could look like.\n\n**Emotes:**\n_Joke_ - Animation could change to Jhin shooting paint onto an easel and one paint bullet shoots a hole through the canvas. \n_Dance_ - Considering the stereotypical French artist emerged during the Belle Epoque era, I was thinking he could have a dance from that era as well? Something refined and fluid.\n\n**Recall:**\nThe recall could be something like Jhin painting on his easel which he then turns around to reveal the painting which could randomise between a few paintings.\n\n**VO:**\nAs will be stated later, I want Jhin to shout specific colours for his auto attacks like he does when counting how many shots he has used. \nI&#039;m not sure where you&#039;d want to put this quote but put it in somewhere, _&quot;Now where did I leave my easel...&quot;_\nI&#039;d also thought he could have some more lines to some other champions. e.g.\n- To female champions (or at least Fiora) -_ &quot;Let me paint you like one of my French girls.&quot;_\n- To characters that are primarily one colour (e.g Zac, Vlad, Veigar, etc.) - _&quot;Unoriginal.&quot;_ _&quot;Boring.&quot;_ _&quot;Uninspired.&quot;_ _&quot;Just... one colour? (sigh.)&quot;_ \n_&quot;A child could paint you.&quot;_ Or something to that effect. Lines that are scathing and/or critical of others based on the colour of their ensemble.\n\n** Abilities:**\n_Auto Attack_ - Jhin, as you&#039;d expect, is wielding a paint-gun, which would shoot different colours based on a voice line. Like his lines in the game where he&#039;s obsessed with the number four, instead of shouting numbers, he would shout colours and the AA would be that colour (or both. I would assume four colours because Jhin.) e.g. Jhin shouts &quot;Blue!&quot; and the shot fired is blue. Also, I think the last shots colour should always be red.\n_Passive_ - The shot gauge could be paint bottles?\n_Q_ - The bouncing grenade could be a paint bottle which could also change colour randomly\n_W Passive_ - Something colourful. Coloured brush strokes perhaps?\n_W Active_ - Particles could be two colours spiraling around each other. When the root lands... \nhaven&#039;t got an idea for that.\n_E _- The traps could be a colour palette trap, upon activation, the trap swirls (spirals) colours around and finally a huge explosion of many colours. Or it transitions from a cool, calm colour (blue? green?) to a violent colour (red?) which then explodes.\n_R _- Curtain Call&#039;s weapon could be a giant paintbrush and once again shoots different coloured shots with the last being\nred.\n\nThat&#039;s all I could think of. If you have feedback or more ideas, that&#039;d be awesome. Try to keep the feedback constructive. It's only a half-baked skin at the moment but hopefully you'll see it has potential.\n\nThanks everyone.","replies":[{"poster":"Ascalon127","date":"2016-08-05T08:56:20.021+0000","up_votes":1,"down_votes":0,"body":"I like this idea. How did you come up with it?","replies":[{"poster":"Karora","date":"2016-08-05T09:22:35.118+0000","up_votes":1,"down_votes":0,"body":"A friend of mine and I were talking about some cool skin ideas we had and Artist Jhin happened to come up at some point. Jhin already is a killer artisan, so we figured it'd be funny to make it more visually obvious and have him literally be an painter.","replies":[]}]}]}