{"poster":"Greedwin","date":"2019-04-03T18:00:58.803+0000","title":"Der U.R.F. Modus sollte aus diesen Gründen wieder zurück...!","subforum":"Champions & Gameplay","up_votes":5,"down_votes":4,"body":"Hey Leute,\r\n\r\nnun ist wohl wirklich der Tag gekommen. Das allseits beliebte **U.R.F.** Erlebnis wurde uns am 02.04.2019 leider verwehrt. \r\n\r\nNun möchte ich darauf eingehen, wieso dieser Modus ehemalige League-Player wieder in den vollen Spielgenuss kommen lassen hat.\r\n\r\nInsgesamt lässt sich sagen, dass der Spielmode alte Freunde wieder zusammengebracht hat. Der Mode hat sich einfach wie von selbst spielen lassen und wir haben im TS einfach nur Spaß gehabt. Man ist wirklich in einem Flow und das Gefühl einer gewissen Trägheit verfliegt vollkommen. \r\n\r\nMittlerweile ist es leider so, dass die Motivation LoL zu starten einfach immens gesunken ist. Im Endeffekt würde League schließlich auch finanziell profitieren, da aktive Spiele auch Skins kaufen würden. Zufriedene Spieler verlieren den Touch zum Game nicht und bleiben immer up to date. \r\n\r\nDas bedeutet fernerhin, dass man die Basis der Spieler beisammen hält und nicht an Aktualität verliert. Auch Normals machen sehr viel Spaß, jedoch ist es einfach sehr abwechslungsreich, U.R.F. als Funmode zu spielen. Ein Kompromiss wäre eventuell, dass man den Mode für Custom Games zur Verfügung stellt. Somit würde man einer sehr großen Anhängerschaft entgegenkommen. \r\n\r\nOptimal ist jedoch die dauerhafte Freischaltung auf den normalen Servern (also keine Custom-Einschränkung).\r\n\r\n**Unsere Bitte an das Riot Team:**\r\n\r\nWir wären Euch wirklich dankbar, wenn Ihr den Modus wieder einführen könntet, da dieser uns als ehemalige Player wieder in's Game gebracht haben und das Game wieder lieben gelernt haben. Ohne das Abschalten in U.R.F. würden wir einfach wieder bedingungslosen Spaß haben und neben den ganzen Normals/Rankeds abschalten können.\r\n\r\nVielen Dank für Eure Aufmerksamkeit!","replies":[{"poster":"00 M4ddin 00","date":"2019-04-04T05:59:01.812+0000","up_votes":2,"down_votes":1,"body":"Kann immer noch nicht verstehen was Leute an diesen Modus finden :/","replies":[]},{"poster":"Amycos Cyrus","date":"2019-04-03T18:45:29.732+0000","up_votes":2,"down_votes":1,"body":"Wäre ARURF permanent, dann würde es seinen Reiz verlieren und Riot würde auch mehr Zeit in den Modus investieren, was nicht unbedingt denjenigen gefallen wird, die an den Übertreibungen dieses Modus ihren Spaß gefunden haben.\n\nEin weiterer Aspekt ist, dass alle URF-Modi darauf beruhen, dass elementare Aspekte von LoL ihr Gewicht verlieren. (e.g. Das Management von Ressourcen und Abklingzeiten). Da sich LoL jedoch als Summe aller Aspekte \"vermarkten\" will kann man hart formuliert sagen, dass LoL Spieler, die nur wegen URF da sind nicht gebrauchen kann. (Absichtlich etwas überzogen formuliert)\nWer für den Spaß an LoL wesentliche Teile des Spiels eliminieren muss, sollte lieber aufhören.\n\nGewisse Aussagen in diese Richtung sind ja bereits der Grund, warum aus URF die  ARURF-Modi wurden.\nhttps://nexus.leagueoflegends.com/de-de/2017/12/ask-riot-urf/\n\n\nIch glaube, viele Spieler sind sich den Konsequenzen nicht bewusst, die ARURF als permanenter Modus hätte. Und viele Spieler verstehen glaube ich nicht, was LoL eigentlich ausmacht und warum ausgerechnet ARAM, Normal 5v5 und 3v3, sowie die Ranked-Modi permanent sind und eine Spielmodus-Rotation mit Fun-Modi bestückt ist, die eben nur temporär sind.\nSelbes Spiel natürlich auch mit Nexus-Blitz. Stellt euch doch einfach mal die Frage, was diese Modi auszeichnet, sodass sie permanent erhalten sind (oder von Riot Games angestrebt ist diesen Status zu erzielen.)\n\n{{sticker:zombie-brand-facepalm}}\n\nPS.: Auch Riot Games hat mit LoL ein unfassbar vieldimensionales Spiel geschaffen und setzt natürlich alles daran zu verhindern, dass diese Leistung verschwendet war. Sie haben in dem Artikel (oben verlinkt) klar geäußert, dass sie dank URF einen Teil der Spieler verloren haben, die eben nicht wegen URF kamen. Der Verdacht liegt also nah, dass sich das Hild von LoL dieser Spieler negativ verändert hat. Wesentliche Elemente des Spiels wurden als störend wahrgenommen. Um diesen Effekt zu verhindern und die Entartung des Spiels zu vermeiden sind Spielmodi, die Spielmechaniken negieren nur temporär und werden von Riot Games besonders beäugt. (Nicht umsonst wurde URF so oft verändert)\n\n___\n\nAussagen wie \"Ihr seid doch nicht gezwungen URF zu zocken\" sind genau der richtige Ansatz, jedoch bedarf es ihrer allgegenwärtigen Abstraktion: \"Ihr seid doch nicht gezwungen LoL zu zocken\". Egal was ist. Am Ende entscheidet nicht die Community, was LoL sein soll, sondern eine Firma, die genauso wie jede andere Profit machen will.\nRiot hat von Anfang an bei jedem URF.-Event gesagt, dass es temporär ist. Wenn man damit nicht leben kann, dann ist es so. Die Statistiken und das Bild, das Riot von LoL hat widersprechen einem permanenten URF-Modus.","replies":[]},{"poster":"SAO Heathcliff","date":"2019-04-03T18:33:00.722+0000","up_votes":2,"down_votes":1,"body":"Wenn man eh keinen Bock mehr hat auf League und nur zocken tut wegen URF, dann sollte man es einfach sein lassen und lernen los zulassen. Besser für beide Parteien in so einem Fall. URF war für meinen Geschmack zu lange da.. ich habe es die erste Woche gut gesuchtet und danach wurde man schon angeschissen wenn man einmal zu viel gestorben ist.. \n\nIn so einem Fall, sollten solche Fun Gamemodes als solches auch betrachtet werden gut und schön für einen kurzen Zeitraum.... aber wenn ich dann 4 mal Poro King habe in 3 Monaten dann hört es echt auf..","replies":[]},{"poster":"Snorlax irl Slav","date":"2019-04-03T18:19:28.791+0000","up_votes":2,"down_votes":1,"body":"Für mich war urf lang genug da und zum Ende hin hab ich es eig gar nicht mehr gespielt ich hatte meinen spaß und gut ist ich kann aber auch verstehen das urf viele Leute kurzfristig wieder in League zusammenbringt. Allerdings geht bei den modes schnell der Reiz verloren zumindest für mich und anscheinend viele aus meiner fl wo ich zum Schluss kaum noch urf gesehen hab.","replies":[]},{"poster":"Xayah Strife","date":"2019-04-05T16:26:33.578+0000","up_votes":1,"down_votes":0,"body":"Nein wir hatte gerade erst URF das reicht erstmal für die nächsten Jahre.\nAll for one soll mal wiederkommen da bin ich richtig heiß drauf. :)","replies":[]},{"poster":"Reboot Geostorm","date":"2019-04-05T10:44:14.584+0000","up_votes":1,"down_votes":1,"body":"Ich verstehe Leute einfach nicht dte hier von Urf reden.\n\n\nUrf hat Riot gelöscht und seit dem ist dieser Modus gestorben. \n\nJedes Mal dieser Mist von Arurf.  Sry den Modus kann ich nicht ernst nehmen.  Gezwungen zu werden einen Champion spielen zu müssen hat in meinen Augen nichts mit Spaß zu tun.","replies":[{"poster":"currywuest567","date":"2019-04-05T16:13:14.850+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Reboot Geostorm,realm=EUW,application-id=Wj1wcocU,discussion-id=iN8OTu9o,comment-id=0007,timestamp=2019-04-05T10:44:14.584+0000)\n>\n> Ich verstehe Leute einfach nicht dte hier von Urf reden.\n> \n> \n> Urf hat Riot gelöscht und seit dem ist dieser Modus gestorben. \n> \n> Jedes Mal dieser Mist von Arurf.  Sry den Modus kann ich nicht ernst nehmen.  Gezwungen zu werden einen Champion spielen zu müssen hat in meinen Augen nichts mit Spaß zu tun.\n\nDann spiele es doch nicht, wenn du es scheiße findest. Viele Leute finden URF gut. Ich selber habe während URF draußen war, nur URF gespielt und es wurde nicht langweilig (Meine Meinung) ok ich habe glaub ich 2 normals gespielt","replies":[]}]},{"poster":"Nordwolf87","date":"2019-04-04T08:16:30.228+0000","up_votes":1,"down_votes":1,"body":"Finde URF/ARURF beide ziemlich langweilig. Ich war schon genervt für die eine Mission URF spielen zu müssen.\n\nDaher wär es mir völlig egal ob der Modus permanent da oder permanent weg wäre (diese Antwortmöglichkeit fehlt übrigens bei deiner Umfrage). Ich spiel ihn nur wenn ich dazu gezwungen bin.","replies":[]},{"poster":"Lorik Leonidas","date":"2019-04-03T19:07:15.751+0000","up_votes":1,"down_votes":2,"body":"Ihr seid doch nicht gezwungen URF zu zocken wenn es da ist, was sind dass den für Argumente? Wer Urf zocken möchte und nur LOL wegen Urf zockt, können die das doch tun. FIFA hat auch ein Spaß Modus indem es keine Fouls etc. gibt und keiner beschwert sich, es ist jedem selbst überlassen ob er diesen Modus zocken will oder nicht. Wer LOL ernster nimmt kann ja weiter seine ranked spielen und wer Spaß haben will mit seinen Freunden kann ja Urf weiter spielen. Urf  hat für mich keinen Reiz verloren, hab mich jeden Tag aufs neue gefreut es zu spielen. LOL ist kein Arbeitslager wo man nur normals und ranked spielen soll, SPAß ist ganz ganz wichtig und die Argumente die ich grade gelesen habe, waren null überzeugend um gegen URF abzustimmen. Kann euch tryhards nicht.","replies":[]},{"poster":"Lorik Leonidas","date":"2019-04-03T18:27:21.191+0000","up_votes":1,"down_votes":2,"body":"Bin der gleichen Meinung wie Greedwin, URF sollte für immer online sein, für diejenigen die Spaß haben wollen können entweder zwischen durch mal Spaß haben oder für Leute wie uns die am Tag 3-5 Runden URF (UND NUR URF) gespielt haben wäre es echt eine super Sache. Spaß sollte bei online Spielen immer Vordergrund stehen und dazu gehört URF!!","replies":[]}]}