{"poster":"Οwen","date":"2018-06-02T19:34:48.439+0000","title":"Ich und die Elo","subforum":"Champions & Gameplay","up_votes":1,"down_votes":5,"body":"Ich habe ja einige Threads hier wo ich mich wegen dem climben beschwere aber heute habe ich mal eine frage wo ich mir echt inzwischen denke so bin ich &uuml;berhaupt da wo ich hingeh&ouml;re oder bin ich einfach boosted...\r\nIch habe sie letzten Tage bisschen duoq gespielt mit nem Silber Mate und das war ja einfach also oft einfach nur zerst&ouml;rt. Dann habe ich mit nem Mate gespielt der halt auch Gold ist und last Seasion Plat war das ging auch ganz gut bin ich auch abgegangen. Dann wollte ich ich vorhin meine G3 promos machen und es musste nat&uuml;rlich passieren das ich beide Games verliere. Aber so typisch halt ich wei&szlig; halt auch nicht was ich anders machen soll zudem kann ich mir keinen Coach leisten ATM... Bisschen Hilfe w&auml;re echt sch&ouml;n und danke im voraus f&uuml;r Leute die helfen. Irgendwie besch&auml;ftigt mich das","replies":[{"poster":"Rena","date":"2018-06-02T19:51:05.987+0000","up_votes":2,"down_votes":1,"body":"Ich bin selbst kein Highelo Spieler aber wenn ich dir irgendwie helfen kann sag bescheid.\nWar letzte Season Mid-High Diamond habe aber mit Ranked seit dieser Season aufgehört.\nKannst mich aber gerne adden :D\n\nEDIT: Helfen im sinne von Coaching nicht Boosten lol.","replies":[{"poster":"Alekra","date":"2018-06-03T01:04:13.490+0000","up_votes":1,"down_votes":0,"body":"Tststs boosting Rena? Ich bin enttäuscht c:","replies":[{"poster":"Rena","date":"2018-06-03T16:24:19.367+0000","up_votes":1,"down_votes":0,"body":"Ich habe helfen im sinne von Coaching gemeint nicht via Boosting lol.\nMein Fehler hätte ich klarer sagen müssen.\n","replies":[{"poster":"Alekra","date":"2018-06-03T20:55:00.581+0000","up_votes":1,"down_votes":0,"body":"Bisschen","replies":[]}]}]},{"poster":"Οwen","date":"2018-06-02T20:22:53.480+0000","up_votes":1,"down_votes":0,"body":"Done haha","replies":[]}]},{"poster":"TGA 10k","date":"2018-06-03T03:21:19.478+0000","up_votes":1,"down_votes":2,"body":"kenne das problem. habe früher viel ranked gespielt, aber zu keiner zeit war es so schlimm wie jetzt. gefühlt jedes match ist ein extrem einseitiger stomp. leider oftmals gegen mich obwohl ich, meiner meinung nach ok spiele und die lane so gut wie nie verliere. aber gut. was soll man machen als tank spieler, wenn riot alles tut um sie unspielbar zu machen","replies":[]}]}