{"poster":"Desilus","date":"2016-07-30T01:24:13.347+0000","title":"Campaña Anti-Cola de baja prioridad","subforum":"Comportamiento del jugador","up_votes":0,"down_votes":19,"body":"Bueno como sabr&aacute;n por el t&iacute;tulo quede un poco cabreado porque me dieron cola de baja prioridad (eso me pasa por ir afk) si bien tampoco me gusta que otros se vayan y abandonen la partida no considero esto &quot; un pecador capital &quot; [para las partidas normales], generalmente tengo 1 hora - 1 y media para jugar cualquier tipo de juegos (soy un jugador Regular de lol) y la penalizacion de 20minutos es demasiado, estas penalizaciones que recibo son solo de partidas normales (ni loco me voy afk en una clasificatoria) \n\nEn fin, estaba pensando si hay alguna forma de sacar las penalizaciones para partidas normales asi los jugadores casuales/regulares no nos quedamos &quot;con las ganas&quot; de jugar. Otra cosa es que me distraje viendo videos y no escuche el sonido de la partida encontrada; no pude aceptar por 1 segundo! y ahora estoy escribiendo esta discusi&oacute;n con esos otros 20 minutos extra de espera. \n\nQuerido Crew y jugadores de League of Legends, no me voy afk simplemente porque si, realmente no puedo seguir jugando, algunos tenemos obligaciones (y problemas de internet) y a veces las partidas se alargan y el tiempo se va, compa&ntilde;eros por favor perdonen mis abandonos de partidas porque _en serio s&eacute; lo que se siente._\n\n> Por ese motivo estoy lanzando esta discusión para ver si es posible sacar las penalizaciones en **partidas normales** \n(y saber que piensan ustedes al respecto)\n\nY ustedes.. &iquest;Que opinan? Soy el unico que piensa de esta forma? Comenten sus puntos de vista!  {{summoner:11}} \n\n-Atte.Desilus","replies":[{"poster":"Salfate Otaku","date":"2016-07-30T01:48:59.917+0000","up_votes":5,"down_votes":0,"body":"juega dota x 4","replies":[]},{"poster":"Hnk Kenshiro","date":"2016-07-30T01:27:13.428+0000","up_votes":3,"down_votes":0,"body":"Ni locos sacan los castigos en colas normales :P","replies":[{"poster":"Desilus","date":"2016-07-30T01:28:14.470+0000","up_votes":1,"down_votes":7,"body":"En dota no hay penalizaciones {{summoner:7}}","replies":[{"poster":"Hnk Kenshiro","date":"2016-07-30T01:31:44.845+0000","up_votes":7,"down_votes":0,"body":"Juega dota {{summoner:14}}","replies":[]},{"poster":"Shappaw","date":"2016-07-30T01:29:09.648+0000","up_votes":6,"down_votes":0,"body":"Andá a jugar dota, entonces.","replies":[]}]}]},{"poster":"EEL EUQ LE 0TUP","date":"2016-07-30T02:26:19.413+0000","up_votes":4,"down_votes":0,"body":"Opino que sos un rata y por el post tenes menos de 18 años... simplemente si dispones de poco tiempo juga cuando sepas que podes! USA LAS NEURONITAS \"huhu en media hora me tengo que ir JUEGO IGUAL TOTAL SI SE ALARGA ME VOY AFK\"\nMereecidooooo ahora fumate 20 minutos de cola por arruinar las partidas de muchas personas!!","replies":[]},{"poster":"Mazer Rakham","date":"2016-07-30T01:49:11.872+0000","up_votes":3,"down_votes":0,"body":"Si sacaran las penalizaciones sabes la cantidad de gente que se iría AFK porque murieron una o dos veces? Yo juego normales y los modos rotativos, todavía no rankeo y no me gustaría que cada dos por tres alguien se vaya AFK porque se enojó o se deprimió. Y así como estoy yo, hay muchas otras personas que no rankean todavía y a las cuales les molestaría. Hasta contra bots te dan leaver buster y me parece perfecto. Ah! y la cola de baja prioridad no te la dan a la primera que te vas AFK, tiene que ser un comportamiento recurrente. Te funciona mal internet? no juegues. Tenés otras cosas que hacer? no juegues. No creo que tengas \"imprevistos\" en cada partida como para tener que irte AFK seguido.","replies":[{"poster":"Desilus","date":"2016-07-30T02:01:08.809+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Amu404,realm=LAS,application-id=PJAKt7ph,discussion-id=Nr0d54pY,comment-id=0002,timestamp=2016-07-30T01:49:11.872+0000)\n>\n> Si sacaran las penalizaciones sabes la cantidad de gente que se iría AFK porque murieron una o dos veces? Yo juego normales y los modos rotativos, todavía no rankeo y no me gustaría que cada dos por tres alguien se vaya AFK porque se enojó o se deprimió. Y así como estoy yo, hay muchas otras personas que no rankean todavía y a las cuales les molestaría. Hasta contra bots te dan leaver buster y me parece perfecto. Ah! y la cola de baja prioridad no te la dan a la primera que te vas AFK, tiene que ser un comportamiento recurrente. Te funciona mal internet? no juegues. Tenés otras cosas que hacer? no juegues. No creo que tengas &quot;imprevistos&quot; en cada partida como para tener que irte AFK seguido.\n\nBuenísimo punto de vista, gracias por el feedback","replies":[]}]}]}