{"poster":"XT9 XantoSZz","date":"2015-11-16T22:23:07.308+0000","title":"Brauche Hilfe weiß nicht ob ich richtig ganke","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey Community,\r\nich bin Top/Jgl Main und eig. auch sehr zu frieden damit, doch im Moment bekomme ich immer h&auml;ufiger gesagt, dass meine Ganks schlecht w&auml;ren. Ich kann das schlecht beurteilen :/ W&auml;re nett wen jmd. die Zeit und das Interesse h&auml;tte sich mal 1 oder 2 Runden von mir anzugucken, in denen ich Jungler bin, und mir sagen k&ouml;nnte ob und was ich falsch mache.\r\nFalls jmd. Interesse hat addet mich/schreibt mich (XT9 XantoSZz) an alles andere kl&auml;ren wir dann wenn es so weit ist. ^^\r\n\r\nDanke schonmal an den jenigen der sich die Zeit daf&uuml;r nehmen wird.\r\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"EasyWIN Katarina","date":"2015-11-17T02:51:23.387+0000","up_votes":3,"down_votes":0,"body":"Der TE ist Bronze 2, eure Ratschläge sind da wenig zielführend, weil ich weiß wie auf Bronze gejungled wird. Da gibt es ganz andere Defizite -  \"Schach\" wird da garantiert nicht gespielt, da ist man froh wenn der jungler nicht 15 Minuten in einem Busch hockt weil er gerade schxxxn gegangen ist... \n\nEin Fortschritt ist bereits folgendes: \n\n1. versuche bei Ganks nicht ausversehen  mehrfach aus dem Busch rauszulaufen, um danach wieder in den Busch zurückzuhampeln nach dem Motto \"ich hoffe es hat keiner gesehen.\" (...) \n\n2. versuche, nicht immer in dem offensichtlichsten Busch zu hocken (und bleib vor allem keine Minute oder länger darin hocken!!) der selbst auf Bronze beinahe garantiert gewardet ist und renne nicht immer direkt durch den Fluss, da auch dort meist irgendwo ein Ward steht (ja, sogar die Bronzies warden den) sondern lauf um kleine Umwege um diese standard Wardplätze herum, damit dein Gank eine Überraschung ist. \n\n3. auf Bronze wird dir IMMER gesagt, dass du deinen Job schlecht machst. Die Spieler können es aber nicht beurteilen, denn könnten sie es, wären sie nicht bronze. Von daher ignoriere ihre Aussagen, weil sie einen guten Gank nicht von einem schlechten unterscheiden können. Dein Gank kann z. B. auch schon dadurch gut sein, wenn der Gegner sich zurückziehen muss oder wegflashed und der Laner etwas Farmvorsprung gewinnt oder man einen Drachen machen kann usw... Auf Bronze werden solche \"kleinen\" Vorteile aber nicht wirklich erkannt. \n\n4. Du solltest möglichst nicht bei den Gankversuchen sterben. Falls doch, sind es natürlich tatsächlich keine allzu guten Ganks, da du den gegnerischen Laner damit stärkst statt ihn zu schwächen, was wiederum nicht gut ankommt (aus verständlichen Gründen).\n\n5. Skillshots sind nicht nur \"für schön\" da, sie sollten ab und zu auch treffen. Wenn das nicht geht spiel sowas wie Jax, der hat keine. Ein sehr Bronze-freundlicher Champ, dieser Jax.","replies":[{"poster":"The mute Swan","date":"2015-11-17T14:51:21.678+0000","up_votes":1,"down_votes":0,"body":"schöner kommentar, hab mich dabei tatsächlich beim schmunzeln ertappt. :D\nhabe mal nen mao'kai gesehen, der als countergank nen sapling geworfen hat, nachdem er 2 minuten im busch hockte (der gewardet war!!!) und dann wieder weggegangen ist.\n\nIch hätte noch hinzuzufügen, dass man vorher pingen sollte um seinen Gank anzukündigen, es soll \"Bronzies\" geben, die keine map-awareness haben und mitten in deinem gank backporten, oder einfach weiterfarmen, etc. (und das lasse ich jetzt einfach so ohne weiteren kommentar da stehen.)\nBeim Gank auch berücksichtigen, wo der gegnerische jungler (oder andere teammitglieder) ist, bzw grade war. kann gut gegen counterganks sein. Soll Leute geben, die nicht immer ss pingen.\n\nDas wars dann auch.","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2015-11-17T01:09:09.538+0000","up_votes":1,"down_votes":0,"body":"Als guter Jungler... spielst du kein LoL, sondern Schach.\nMir wurde zum Beispiel gerne vorgeworfen, dass ich die von Jungler gecampte Toplane vernachlässige... Wenn ich aber die \"Jungler Camps Top\" Info gut verarbeite und uns dadurch den ersten Drachen (mit Level 4) sichere... muss der Toplaner \"nur\" sicher stellen, dass er selber nicht stirbt. Und ja, ich spiele Nunu Jungle, der ist in den ersten 20 Minuten am stärksten, wenn er immer genau dort ist, wo der andere Jungler nicht ist.\n\nDas ist aber auch auf der Metaebene das extrem schwierige am Jungle. Ein guter Toplaner kommt damit klar, dass er gecampt wird und du kannst diese \"Information\" (und Junglen heißt im wesentlichen Arbeiten mit Informationen) ganz anders nutzen, als wenn dein Toplaner wirklich Hilfe braucht.\nUnd ja, ich bin kein guter Jungler, weil ich im wesentlichen immer dort auftauche, wo der andere Jungler derzeit garantiert nicht ist. Wenn der andere dann aber wirklich gut ganken kann, ist mein Team am Arsch...\n\nUm aber mal meine Lieblings-Jungle-Fehler zu nennen: Deine Aufgabe ist es, deinen Lanes Vorteile zu verschaffen. Vorteile müssen nicht zwingend Kills sein. Ein Vorteil kann auch der Level 4 Solo Drake sein. Und ja, ich hatte letztens ein Spiel, in dem mich der Toplaner geflamet hat, ohne zu merken, dass er nach Drachen 4-0 führt... Ich bin halt jedes Mal, wenn der gegnerische Jungle Top aufgetaucht ist, zum Drachen gegangen... und selbst die 2 Kills, die unser Toplaner abgegeben hat, wären völlig egal gewesen, wenn der Toplaner die Drachen bemerkt hätte...\n\nNehmen wir das konkreteste Beispiel: Du kommst Top, der Gegner flasht. An der Stelle... drehst du erst Mal um und bist zufrieden... oder aber du flasht hinterher, dein Toplaner auch und ihr kriegt den Kill trotzdem nicht.\nIn Beispiel A) war es ein erfolgreicher Gank. Du musst halt nur in den nächsten 3 Minuten wieder kommen und den Vorteil ausnutzen. Wenn ihr aber auf den einen Flash mit 2 Flashes reagiert... ohne am Ende den Kill zu bekommen... habt ihr mehr bezahlt, als ihr bekommen habt.\n\nUnd ich bin kein guter Jungler. Aber als Toplaner passiert es mir oft, dass der Jungler hinter dem Toplaner hinterher flasht und mich dann fragt, wo ich bleibe... weil ich instinktiv nach dem Flash des Toplaners umdrehe und \"gj, worth\" in den Chat schreibe.\nAn der Stelle gilt eigentlich eine einfache Regel: Flash ist das \"KS-Tool\". Wenn du dir nicht absolut sicher bist, dass du mit dem Flash den Kill holst, dann Flashe nicht, sondern sei zufrieden, dass deine Gegner seinen Summoner Spell verbraucht hat.\nDanach notierst du dir den Timer und kommst wieder, wenn ihr beide Flash habt und der Gegner nicht.\n\nDasselbe gilt nebenbei für Recalls. Wenn du auf der Toplane den Flash und den Recall provozierst. Und der Gegner sich auf die Lane teleporten muss... dann gehe ich direkt zum Drachen. Und hole mir den Support. Denn wenn dein Toplaner TP hat und der Gegner nicht, habt ihr dort theoretisch einen Mann mehr. \n\nAber an der Stelle sind \"erfolgreiche Ganks\" halt immer mehrschichtig. Wenn der Gegner mehr Summoner Spells als ihr verbraucht habt, war es an sich ein guter Gank. Aber diesen Guten Gank musst du auch hinterher ausnutzen.\n\nUnd ja, ich habe Mata und DanDy studiert... die jeden noch so kleinen Vorteil im Jungle in der Season 4 eiskalt ausgenutzt haben. Und denen ging es im Zweifelsfall um 2 Wards, die sie platzieren konnten. Aber genau darum geht es als Jungler: Vorteile erarbeiten und diese ausnutzen.","replies":[{"poster":"InfectedGreed","date":"2015-11-17T09:35:02.640+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=Wj1wcocU,discussion-id=3MPKdmqv,comment-id=0001,timestamp=2015-11-17T01:09:09.538+0000)\n>\n> Als guter Jungler... spielst du kein LoL, sondern Schach.\n> Mir wurde zum Beispiel gerne vorgeworfen, dass ich die von Jungler gecampte Toplane vernachlässige... Wenn ich aber die \"Jungler Camps Top\" Info gut verarbeite und uns dadurch den ersten Drachen (mit Level 4) sichere... muss der Toplaner \"nur\" sicher stellen, dass er selber nicht stirbt. Und ja, ich spiele Nunu Jungle, der ist in den ersten 20 Minuten am stärksten, wenn er immer genau dort ist, wo der andere Jungler nicht ist.\n> \n> Das ist aber auch auf der Metaebene das extrem schwierige am Jungle. Ein guter Toplaner kommt damit klar, dass er gecampt wird und du kannst diese \"Information\" (und Junglen heißt im wesentlichen Arbeiten mit Informationen) ganz anders nutzen, als wenn dein Toplaner wirklich Hilfe braucht.\n> Und ja, ich bin kein guter Jungler, weil ich im wesentlichen immer dort auftauche, wo der andere Jungler derzeit garantiert nicht ist. Wenn der andere dann aber wirklich gut ganken kann, ist mein Team am Arsch...\n> \n> Um aber mal meine Lieblings-Jungle-Fehler zu nennen: Deine Aufgabe ist es, deinen Lanes Vorteile zu verschaffen. Vorteile müssen nicht zwingend Kills sein. Ein Vorteil kann auch der Level 4 Solo Drake sein. Und ja, ich hatte letztens ein Spiel, in dem mich der Toplaner geflamet hat, ohne zu merken, dass er nach Drachen 4-0 führt... Ich bin halt jedes Mal, wenn der gegnerische Jungle Top aufgetaucht ist, zum Drachen gegangen... und selbst die 2 Kills, die unser Toplaner abgegeben hat, wären völlig egal gewesen, wenn der Toplaner die Drachen bemerkt hätte...\n> \n> Nehmen wir das konkreteste Beispiel: Du kommst Top, der Gegner flasht. An der Stelle... drehst du erst Mal um und bist zufrieden... oder aber du flasht hinterher, dein Toplaner auch und ihr kriegt den Kill trotzdem nicht.\n> In Beispiel A) war es ein erfolgreicher Gank. Du musst halt nur in den nächsten 3 Minuten wieder kommen und den Vorteil ausnutzen. Wenn ihr aber auf den einen Flash mit 2 Flashes reagiert... ohne am Ende den Kill zu bekommen... habt ihr mehr bezahlt, als ihr bekommen habt.\n> \n> Und ich bin kein guter Jungler. Aber als Toplaner passiert es mir oft, dass der Jungler hinter dem Toplaner hinterher flasht und mich dann fragt, wo ich bleibe... weil ich instinktiv nach dem Flash des Toplaners umdrehe und \"gj, worth\" in den Chat schreibe.\n> An der Stelle gilt eigentlich eine einfache Regel: Flash ist das \"KS-Tool\". Wenn du dir nicht absolut sicher bist, dass du mit dem Flash den Kill holst, dann Flashe nicht, sondern sei zufrieden, dass deine Gegner seinen Summoner Spell verbraucht hat.\n> Danach notierst du dir den Timer und kommst wieder, wenn ihr beide Flash habt und der Gegner nicht.\n> \n> Dasselbe gilt nebenbei für Recalls. Wenn du auf der Toplane den Flash und den Recall provozierst. Und der Gegner sich auf die Lane teleporten muss... dann gehe ich direkt zum Drachen. Und hole mir den Support. Denn wenn dein Toplaner TP hat und der Gegner nicht, habt ihr dort theoretisch einen Mann mehr. \n> \n> Aber an der Stelle sind \"erfolgreiche Ganks\" halt immer mehrschichtig. Wenn der Gegner mehr Summoner Spells als ihr verbraucht habt, war es an sich ein guter Gank. Aber diesen Guten Gank musst du auch hinterher ausnutzen.\n> \n> Und ja, ich habe Mata und DanDy studiert... die jeden noch so kleinen Vorteil im Jungle in der Season 4 eiskalt ausgenutzt haben. Und denen ging es im Zweifelsfall um 2 Wards, die sie platzieren konnten. Aber genau darum geht es als Jungler: Vorteile erarbeiten und diese ausnutzen.\n\nDa muss ich dir widersprechen.\n\nAufgabe des Junglers ist es hauptsächlich Objective zu bekommen, zu saven.\n\nD.h. deine Aufgabe ist es z.b. den Drake-Call zu machen, Ganks gehören natürlich auch dazu, sind aber nicht zwangsläufig spielentscheidend.\n\nObjectives sind immer wichtiger, denn nicht Kills gewinnen das Spiel sondern Tower, Inhibs, Drakes, Barons.\n\nAber es gibt auch \"andere\" Jungler, deren Aufgabe kann es sein einfach nur counterjunglen.(z.b. Lee Sin vs Amu)","replies":[{"poster":"HyperionCH","date":"2015-11-17T10:31:56.087+0000","up_votes":2,"down_votes":0,"body":"Wobei \"Objectives sichern\" auch Vorteile für das Team gibt. ;)\nEr schrieb ja auch, dass er Drake macht, wenn der gegnerische Jungler Toplane sittet (=Objective sichern). Mehr oder weniger hat er der selben Sache nur anders ganannt.\n\nJungler haben sehr viele Aufgaben und Objectves sichern ist wohl die wichtigste. Trotzdem gibt es weitere, die sehr wichtig sind und die man nicht vernachlässigen darf.\n\nDas Counterjungeln kann man auch als \"Vorteile für die Laner\" schaffen bezeichnen. Klaut man nämlich die gegnerischen Camps, hat der gegnerische Jungler weniger XP und Gold (bzw. Items). Seine Ganks werden dann schwächer, was ein Vorteil ist, weil die Laner so eher überleben.\n\nAuch Warden ist eine wichtige Aufgabe, gerade für den Jungler. Ein Toplane-Ward im Busch hilft nicht nur zum Objectives sichern (Drake), der Toplaner ist nun vorbereitet und sollte den kommenden Gank überleben. Wenn der gegn. Jungler dann noch eine halbe Minute im gewardeten Busch wartet, ist das ganze perfekt. Da verliert er unnötig Zeit und damit Farm im Jungle.\n\nBeim Beispiel mit \"Flash\" verbraucht:\nErfolgreich ist ein Gank eigentlich bereits, wenn der Gegner back muss (und der eigene Mate nicht); selbst wenn niemand Flash nutzte. Denn so bekommt der Mate Free-Farm und der Gegner verliert Farm (oder auf Toplane allenfalls TP). \nWenn der Gegner back muss und 2 Waves verpasst, dann ist dies bereits ein Kill wert. Für den Kill towerdiven und selber draufgehen, ist also oft gar nicht nötig. ;)","replies":[]}]}]},{"poster":"Veezey","date":"2015-11-17T16:09:22.763+0000","up_votes":1,"down_votes":0,"body":"Ich hab auch Probleme mit dem Ganken. Nicht mit dem ganken an sich, aber mit dem Zeitpunkt. Ich hänge manchmal ewig im Jungle, bevor einmal ganke xD","replies":[]},{"poster":"EasyWIN Katarina","date":"2015-11-17T10:58:07.561+0000","up_votes":1,"down_votes":0,"body":"Theoretisch spielen alle eigentlich auch etwas Schach, die einen eben mehr, die anderen weniger. Es ist allerdings gleichzeitig ein Reaktionsspiel (mechanics) und Zeit ist ein viel wesentlicherer Faktor als beim Schach, da Entscheidungen teilweise in einer viertelsekunde getroffen werden müssen und wenn es nur um das Ausweichen eines Skillshots geht oder darum, smite perfekt zu setzen, was nunmal auch eine Sache von einem Sekundenbruchteil sein kann, wenn der andere Jungler daneben steht. Von daher ist es eher sowas wie Fußball oder Boxen, weniger ein Schachspiel. Selbst beim Bullet-Mode von Schach hat man eine Minute Denkzeit pro Zug. Bei LoL kann ein Teamfight hingegen in 5 Sekunden zuende sein...\n\nWas die Thesen zum Jungle betrifft: es ist am Ende doch eine \"der Erfolg gibt ihm Recht\" sache. \n\nKlar ist in der Theorie Bot wichtiger als Top, aber wenn beispielsweise die eigene Botlane vollkommen mit 0:16 gestomped wird und man feststellt, dass selbst der beste Gank der Welt hier nichts mehr retten kann (am besten weil die eigene Bot permanent eh pushed und dabei stirbt, so dass ein Gank unmöglich ist), während auf der Toplane und auf der Midlane zwei klasse Spieler stehen, die glänzende Gankaussichten versprechen, dann würde ich pauschal die Strategie wechseln und die beiden Lanes noch etwas unterstützen um dann eben mit deren Hilfe das Spiel zu drehen. ","replies":[]},{"poster":"M4ster Yi","date":"2015-11-17T05:18:33.461+0000","up_votes":1,"down_votes":0,"body":"Hey bin Diamant Main Jungle / adc DU kannst mich gerne adden dann schau ich mal drüber :)","replies":[]},{"poster":"Kvothe100","date":"2015-11-16T23:32:24.694+0000","up_votes":1,"down_votes":0,"body":"Hey ich bin selbst \"nur\" gold daher weiß ich nicht ob ich da der richtige bin, aber ich bin main jungle. Also falls du keinen besseren findest kann ich dir helfen ;)","replies":[]}]}