{"poster":"Spooh","date":"2019-06-08T18:36:59.871+0000","title":"Problemas con fps AYUDAAAA","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Desde hace unos días tengo un problema de fps durante la partida, al inicio va todo bien 70 - 80 fps pero después del minuto 6 tengo 20-30 fps  durante toda la partida lo cual lo hace injugable, vi muchos foros donde mucha gente con pc s buenos se quejaba del mismo problema en parches anteriores. \r\n Aparte de ese problema también tengo el problema de que el teclado no reacciona por unos segundos y la desconexion  en partida, no se como arreglar este problema ya que no puedo jugar con estos fps y problemas de conexión que estoy seguro que son problemas del juego y no de mi pc ya que la temporada anterior jugaba tranquilamente a 70 - 80 fps todas las partidas con gráficos bajos / medios y ahora los tengo al mínimo y ni así puedo jugar  bien ya que después del minuto 6 tengo 20 fps. Necesito ayuda.","replies":[{"poster":"DoteroGordo","date":"2019-06-17T04:07:43.596+0000","up_votes":1,"down_votes":0,"body":"desde que instale el parche 9.12 se bajaron los fps abismalmente","replies":[{"poster":"Spooh","date":"2019-08-25T03:14:07.908+0000","up_votes":1,"down_votes":0,"body":"Le pasa a gente con buena pc no se soluciona, por lo menos yo no encontre la solucion.","replies":[]}]},{"poster":"Lord Parca","date":"2019-06-08T23:29:39.064+0000","up_votes":1,"down_votes":0,"body":"Los bajos FPS son el rendimiento del juego con tu pc, si el uso de memoria, disco y procesador se ven saturados o con exceso de uso bajan los FPS. generalmente pasa x programas o tareas en segundo plano. TB la caida de FPS puede pasar con rendimiento insuficiente de la grafica en momentos cargados de datos como son TF donde mas trabaja. Yo actualizaria windows, drivers, si es una pc mediocre utilizaria game booster o algo similar y tb para descartar un problema de conexión pondría los 2 comandos (tracert y ping -t al servidor) en consolas CMD para ver si surge algo anormal. Después de todo eso y con los datos del tracert, ping y tb podrias capturar la pantalla en el momento con el msi afterburner con la grafica de uso de pc para decir \"ves q es problema del servidor\"","replies":[{"poster":"Spooh","date":"2019-06-09T05:02:12.113+0000","up_votes":1,"down_votes":0,"body":"Aun no lo probé pero lo haré seguramente para quitarme las dudas de que no sea mi pc, aunque si hay mucha gente con el mismo problema desde este parche e incluso en el parche 9.2 paso lo mismo aunque mas global donde gente con muy buenas pcs se quejaba de bajadas de fps, y riot admitió que era un bug que no tenia solución por el momento luego de eso con unos parches mas creo que, se soluciono medianamente el error, ya que desde este parche volvió el mismo error del parche 9.2  pero no tanta gente es afectada por esto.\n \nhttps://boards.lan.leagueoflegends.com/es/c/ayuda-y-soporte/43Kq2Zur-problemas-taocnicos-parche-92       \n\nesto es el error  del parche 9.2 que afecto a mucha gente, la segunda situación que explica este rioter es exactamente lo que me pasa a mi desde este parche, ya mande tickets pero aun no me contestaron, ahora voy a esperar a ver si es un error de este parche solo y con la implementacion del siguiente parche, es decir, el 9.12 no tenga el mismo error ya que no me deja jugar rankeds normales ni nada xq soy una carga para mi team con 20 fps.  \n\nGracias por resporder :)\n ","replies":[]}]},{"poster":" Níðhöggr69","date":"2019-06-08T22:10:07.320+0000","up_votes":1,"down_votes":0,"body":"estoooy igual","replies":[{"poster":"Spooh","date":"2019-06-09T04:48:48.476+0000","up_votes":1,"down_votes":0,"body":"ya me encontré 5 personas con el mismo problema en unas pocas partidas todos con caídas de fps, esto lo hace injugable ahora solo juego con bots espero que el  próximo parche tenga una solución","replies":[]}]},{"poster":"VENI FIORA","date":"2019-06-08T23:20:03.475+0000","up_votes":1,"down_votes":0,"body":"no se si te funcionara pero dale a la tecla windows+R y luego escribe msconfig anda a servicios marca ocultar servicios de windows y despues deshabilitar todos aplicar aceptar y reiniciar","replies":[{"poster":"Spooh","date":"2019-06-09T04:46:25.840+0000","up_votes":1,"down_votes":0,"body":"Gracias pero no me funciono sigue pasando lo mismo cuando llega el minuto 6 baja de golpe a 20-30 fps y de ahí no sube mas en toda la partida.","replies":[]}]}]}