{"poster":"Kelp2","date":"2017-04-10T16:09:06.807+0000","title":"Champion Select Leaven oder Spiel verlieren?","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":2,"body":"Hallo,\n\nIch habe vorhin eine Champion select geleavt da einer meiner Mitspieler schrieb das er trollen werde, da sein Main\nvon einem Teammate gebannt wurde.\nDeshalb habe ich zurecht einen Leaverbuster bekommen. Ich frage mich jedoch was ich h&auml;tte tun sollen; \nDie Champion Select verlassen oder mit hoher Wahrscheinlichkeit ein Spiel verlieren und vlt. demoted\nwerden da ich momentan mehr Games verliere als gewinne und bei 0 LP war.\n\nH&auml;tte ich das Spiel gespielt h&auml;tte ich zwar Sp&auml;ter den Spieler reporten k&ouml;nnen, h&auml;tte aber viel mehr\nLP verloren als durch das leaven.\n\nIch bin nicht demoted aber habe den Summoner&#039;s Code gebrochen d.h. ich habe egoistisch gehandelt und der Community geschadet um das Spiel nicht zu verlieren. \n\nWar meine Entscheidung gerechtfertigt?","replies":[{"poster":"Supportsmanlike","date":"2017-04-10T16:19:41.687+0000","up_votes":7,"down_votes":1,"body":"Inwiefern ist es egoistisch, wenn du 3 Spielern in deinem Team und 5 im Gegner Team ein schlechtes Game erspart hast","replies":[{"poster":"eingew","date":"2017-04-12T06:09:03.783+0000","up_votes":3,"down_votes":0,"body":"Wenn der Troll sein Verhalten durchzieht trollt er einfach die nächste CS? Er hat die Granate mit gezogenem Stift einfach nur an den nächsten weiter gereicht :P.","replies":[]},{"poster":"Kelp2","date":"2017-04-10T17:09:45.016+0000","up_votes":1,"down_votes":0,"body":"Ich dachte daran das ich vor allem die Wartezeit meiner Gegner verschwendet habe.\nAber wenn ich darüber nachdenke  hast du Recht xD","replies":[]}]},{"poster":"Nycaria","date":"2017-04-10T17:46:34.811+0000","up_votes":5,"down_votes":0,"body":"Nur weil jemand ankündigt zu trollen, trollt er/sie auch? Ohje dann hätte ich schon viele Leute gehabt, welche getrollt oder gefeedet haben. Solche Leute wollen,dass jemand die Select verlässt, dementsprechend spielst du ihnen nur in die Hände. \n\nFast kein Spiel ist bereits in der Champselect verloren (Dia2+ mal ausgenommen) also lohnt es sich jedes Game zu spielen.","replies":[{"poster":"Revilous","date":"2017-04-11T11:05:05.991+0000","up_votes":2,"down_votes":2,"body":"Außer diese Spiele wo der Support Smite und Cleanse pickt und die Mitte runter rennt. Hatte ich schon mehrfach und in jedem Falle hat er das in der CS angekündigt. Aber lieber spiele ich und reporte die Spieler danach da sie zu 90% danach einen 2 Wochen oder sogar Permabann bekommen.","replies":[{"poster":"Nycaria","date":"2017-04-11T15:57:01.207+0000","up_votes":3,"down_votes":0,"body":"Ist mir persönlich noch nie untergekommen, aber hey Ausnahmen bestätigen die Regel.","replies":[{"poster":"Revilous","date":"2017-04-11T20:50:24.661+0000","up_votes":1,"down_votes":4,"body":"nene das ist die Regel. Die Ausnahme wäre, wenn der Troll im Gegnerteam ist ^^","replies":[{"poster":"eingew","date":"2017-04-12T06:09:45.744+0000","up_votes":2,"down_votes":0,"body":"Das ist komplett unlogisch... hältst du dich für einen Trollmagnet?","replies":[{"poster":"Revilous","date":"2017-04-12T09:33:22.060+0000","up_votes":1,"down_votes":0,"body":"Ja! Viel zu oft komme ich in eine Champselect wo 2 Spieler schon vorher miteinander gespielt haben und der Eine dem Anderen \"das Spiel ruiniert hat\" und der Eine muss es ihm natürlich heimzahlen.\n\nOder jemand will Yasuo, Yi oder Riven spielen und was machen die netten Leute da? Bannen den Champ. Die zweite Wahl fällt für diese Leute natürlich auf Heimerdinger mit cleanse und Ghost und dann wird schön gefeedet.\n\nOder, was auch vorkommt, jemand ist extrem tiltet und erklärt in der Champselect, dass sein Team diesmal bitte nicht trollen soll und einfach nicht feeden soll so wie in seinem letzten Spiel. Doch wie die netten Leute sind, wird Udyr mit Cleanse und Heal gepickt um ihm nochmal zu verdeutlichen mit was für einer Community er spielt.","replies":[{"poster":"CYPHΕR","date":"2017-04-12T09:37:28.307+0000","up_votes":2,"down_votes":0,"body":"Ich könnte an einer Hand abzählen wie oft ich solche Championselects seit der Beta in mehreren Tausend Matches hatte...","replies":[]},{"poster":"eingew","date":"2017-04-12T16:49:32.181+0000","up_votes":1,"down_votes":0,"body":"Und die kommen sicher nur in deine CS und tauchen unter Garantie deutlich seltener bei den Gegnern auf? Legst du dafür deine Hand ins Feuer? Und das auch noch ständig, ohne dass du sie provozierst?\n\nOder anders gefragt: Du legst mich doch rein?","replies":[{"poster":"Revilous","date":"2017-04-12T18:18:45.070+0000","up_votes":1,"down_votes":0,"body":"nein die kommen natürlich auch oft bei den Gegnern vor. Wenn ich ehrlich bin heute sogar öfter bei den Gegnern^^ Aber das ist wirklich eine Ausnahme.","replies":[]}]}]}]}]}]}]}]},{"poster":"MacDeath","date":"2017-04-10T21:28:25.234+0000","up_votes":3,"down_votes":0,"body":"Gerechtfertigt bestimmt, aber damit hast du auch gleichzeitig die Haut vom Troller der nach dem Spiel bestimmt reported geworden, LP verloren und keinen Spaß gehabt hätte gerettet. \n\nIch denke jedes mal wenn so ein Spieler mit seinem asozialem Verhalten ungeschoren davon kommt ermutigt ihn das (und vielleicht andere) damit weiter zu machen. Damit wäre das Trollerproblem also gerade mal (vielleicht) _einmalig_ für _dein_ Spiel gelöst.\n\nIch verstehe wenn du nicht für die geistige Unreife anderer Leiden möchtest, aber an diesem Punkt würde ich (so ungern ich Supportsmanlike auch widerspreche) einer egoistisch motivierten Handlung zustimmen.\n\nIch sehe sowas gerne wie das Impfen; Es müssen alle gemeinsam solidarisch gegen das Problem vorgehen. Eine Community die sich sozusagen durch konsequente und maximale Inakzeptanz von toxischen Verhalten selbst gesund hält. \nDem Problem nachzugeben _scheint_ für einen selbst erstmal die beste Option zu sein. Langfristig gesehen ist es dies aber wahrscheinlich nicht.","replies":[]},{"poster":"HyperionCH","date":"2017-04-12T09:33:46.636+0000","up_votes":2,"down_votes":0,"body":"Auf jeden Fall spielen und dann reporten.\n\nDie Kosten sind recht gering, sofern der Troll überhaupt seine Drohung wahr macht, was nicht immer der Fall ist. Etwas LP-Verlust hat auf die ganze Season verteilt kaum eine Auswirkung.\n\nDer Ertrag ist hingegen grösser. Wenn das Trolling nämlich nicht funktioniert, dann wird es selten bis nie angewandt.","replies":[]},{"poster":"SilvaxStar","date":"2017-04-12T05:57:22.374+0000","up_votes":1,"down_votes":2,"body":"Ich finde deine Entscheidung gerechtfertigt. Es macht niemandem Spaß mit solchen Leuten zu Spielen und ich verstehe auch nicht, dass man Spieler nicht schon in der Pick und Bann Phase reporten kann. Außerdem hast du den anderen auch einen Gefallen getan. Ich persönlich hasse es, wenn Spieler schon in der Pick und Bann Phase ein solches Verhalten zeigen. \nMan hat dann doch auch überhaupt keine Lust mehr zu spielen und ich wette alle denken dann, hoffentlich leaved noch jemand. Von daher hast du eher ein Opfer gebracht, wo für die anderen dir mit Sicherheit dankbar wären. XD","replies":[{"poster":"eingew","date":"2017-04-12T06:12:19.406+0000","up_votes":2,"down_votes":0,"body":"> Außerdem hast du den anderen auch einen Gefallen getan.\n\nInwiefern? Was ist mit den Spielern aus der nächsten CS, die den Troll treffen? Vorausgesetzt der Troll will sein Verhalten wirklich so konsequent durchziehen, wie er es vorgibt. Und wenn er das nicht tut, dann war die Gefahr auch in der CS des TEs schon kaum vorhanden.\n\n> Man hat dann doch auch überhaupt keine Lust mehr zu spielen und ich wette alle denken dann, hoffentlich leaved noch jemand. Von daher hast du eher ein Opfer gebracht, wo für die anderen dir mit Sicherheit dankbar wären. XD\n\nIch persönlich finde einen erhöhten Schwierigkeitsgrad nicht einmal eine allzu schlechte Erfahrung - selbst wenn man damit sicher öfter auf die Schnauze fällt.","replies":[]}]},{"poster":"charmelikeahri","date":"2017-04-12T09:23:45.307+0000","up_votes":1,"down_votes":0,"body":"Ich leave meistens nicht weil die Leute in den letzten 5s wieder auf normale Summoner umschwenken und man erkennen kann das sie nicht trollen.\n\nWenn sie das allerdings nicjt tun leave ich bei 1s, ich möchte meine Zeit nicht mit solchen Leuten verschwenden. Das ist vergeudete Lebenszeit","replies":[]},{"poster":"Pandaphiri","date":"2017-04-11T09:37:52.086+0000","up_votes":1,"down_votes":0,"body":"einfach spielen, muten und reporten","replies":[]},{"poster":"Bayonetta38","date":"2017-04-25T12:58:16.310+0000","up_votes":1,"down_votes":1,"body":"Eigentlich schon. Nur die Sache ist die wird er den wirklich trollen? Ich kenns von mir. Ich nehme ein Spiel an in dem Moment schreibt mir ein Freund mit dem ich unbedingt spielen will. Daher sage ich ich trolle zeige auch meinen Trollpick (meist Yi support mit Ghost und Smite) und warte bis jemand leavt falls nicht, und es ist schon zuspät ist, erkläre ich den Fall, entschuldige mich, versuch wenn möglich meinem Champ mit jemanden zu tauschen oder spiele wirklich Yi Support  mit Flash und Exhaust (Tanky variante funktioniert recht gut). Wenn das Spiel vorbei ist finde ich es gerechtfertigt wenn mich mein Team reportet egal ob wir gewonnen oder verloren haben. Deine Situation finde ich auch komplett in Ordnung, weil wenn du leavst passiert dir was nicht den anderen. Du verlierst 3lp (in deinem Fall nichts bei 0LP) anstatt 18LP oder demoted zu werden und du rettest dein Team auch vor einem warscheinlichen Lose.","replies":[]}]}