{"poster":"BlackMargoiv","date":"2017-05-14T21:19:14.715+0000","title":"Tengo dudas sobre las MAESTRIAS y las RUNAS.","subforum":"Nuevos jugadores","up_votes":3,"down_votes":0,"body":"Sobre las runas : Acabo de subir a nivel 20 , ahora me dan las runas de grado 3 (quede claro que no compre las de grado 2 porque no sabia que existian hasta que intente comprar las de 3) Y me dijeron que en este nivel tengo que comprar runas segun el campeon que maineo (tristana) y pues le compre 5 marcas de da&ntilde;o porque tiene da&ntilde;o fisico , &iquest;Que runas tendria que comprarle?\r\n\r\nSobre las maestrias : Veo que ya en este nivel todos tienen maestrias para su campeon y eso pero mi duda es , solo soy nivel 20 y para hacerse las maestrias que un amigo me recomendo para tristana y necesitas 30 puntos de maestria para completarla (soy nivel 20 :p) y como se que se consiguen por nivel , &iquest;tengo que esperar a nivel 30 para hacerlo de golpe o hacerlo de a partes?\r\n\r\nPD : Si alguien con mis mismas estadisticas ve esto , agregueme y jugamos.","replies":[{"poster":"Shufe","date":"2017-05-14T23:08:02.194+0000","up_votes":2,"down_votes":0,"body":"En el caso de las maestrias cada vez que subas de nivel es bueno que las asignes a la pagina que estes usando en el momento, lo creas o no ese unico punto puede cambiar partidas, asi que acordate cada vez que subas de level agrega los puntos a tus maestrias y segui llenando tus runas de a poco. Te diria que no compres campeones hasta tener las runas completas hechas.","replies":[]},{"poster":"Rinoa HeartiIIy","date":"2017-05-14T23:36:52.739+0000","up_votes":1,"down_votes":0,"body":"Te aconsejo que compres las de grado 2 porque son mucho más baratas y sirven. Así usas el ip para comprar campeones y practicar. Más adelante terminas tus runas de grado 3 y compras las páginas que necesites los días de ofertas (2x1 en páginas de runas). Y cuando te sientas preparado ya puedes rankear! Saludos","replies":[]},{"poster":"KSM Masi","date":"2017-05-14T21:25:44.572+0000","up_votes":1,"down_votes":0,"body":"Quinta esencia las 3 de vel.ataque , gilfo de resistencia mágica , marca de daño de ataque y sello de armadura . Son las básicas para tristana u adc","replies":[{"poster":"BlackMargoiv","date":"2017-05-14T21:37:02.294+0000","up_votes":1,"down_votes":0,"body":"¡ Muchas gracias ! Pero , ¿La cantidad de cada una?","replies":[{"poster":"KSM Masi","date":"2017-05-14T22:20:16.056+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BlackMargoiv,realm=LAS,application-id=njUm58At,discussion-id=P102kXl6,comment-id=00000000,timestamp=2017-05-14T21:37:02.294+0000)\n>\n> ¡ Muchas gracias ! Pero , ¿La cantidad de cada una?\n\n9 marcas / 9 gilfos / 9 sellos / 3 quintaesencia todo de lo que te dije anteriormente","replies":[{"poster":"BlackMargoiv","date":"2017-05-14T22:51:28.968+0000","up_votes":1,"down_votes":0,"body":"¡ Muchas gracias bro ! , ahora lo voy a probar.","replies":[]}]}]}]}]}