{"poster":"TheLegionofDark","date":"2015-12-23T17:27:50.241+0000","title":"Does Yasuo's Windwall mechanic block too many things?","subforum":"Gameplay","up_votes":171,"down_votes":25,"body":"Okay so this is just as the title implies, I&#039;m just looking for thoughts and opinions. I&#039;m not necessarily looking for nerfs but maybe some clarity.\r\nI used to main a Nami support and for some reason never noticed it before this week, but Yasuo&#039;s windwall blocks Nami&#039;s Q (her bubble stun). I also have a friend who mains a Heimer who noticed that it also blocks Heimer&#039;s grenade. To me personally it bugs me that an ability that &quot;lobs&quot; something in an arc&#039;d trajectory gets blocked by windwall. It literally appears to go over it, not through it, yet it simply blocks and cancels the ability. From a visual as well as just a gameplay perspective, this just doesn&#039;t make since. Shouldn&#039;t you be able to &quot;lob&quot; an ability over the windwall and hit Yasuo?\r\n\r\nThis isn&#039;t really an OMG NERF YASUO post. Just wondering if this mechanic has bugged anyone else but me and my friend.","replies":[{"poster":"Nekusen","date":"2015-12-23T17:50:05.906+0000","up_votes":48,"down_votes":14,"body":"they should change it to only reduce the damage from missiles and perhaps slow them (missiles), instead of completely negating the effects and damage.","replies":[{"poster":"Keevalroy","date":"2015-12-23T18:16:54.007+0000","up_votes":43,"down_votes":7,"body":"See, right there - this actually makes sense.  If you fire an Ashe ult at him, the arrow shouldn't disappear into nothingness, it should slow it's travel speed after passing through the wall...because that's what wind does Riot.","replies":[{"poster":"TheProAndrew","date":"2015-12-23T22:56:08.852+0000","up_votes":8,"down_votes":2,"body":"talking about logic in LOL? \n\ntell me about {{summoner:14}} on {{champion:63}} \n\nor {{champion:267}} and {{champion:56}} using {{item:1001}}","replies":[{"poster":"Nin10do0014","date":"2015-12-24T01:00:51.852+0000","up_votes":10,"down_votes":0,"body":"Or {{champion:17}} blinding {{champion:64}}","replies":[{"poster":"Keevalroy","date":"2015-12-24T01:29:11.354+0000","up_votes":21,"down_votes":1,"body":"I won't accept Lee being blind until he has permanent burrowed Rek'Sai vision, is unable to see his allies to go along with it, and no longer has 350 ms to go with his ludicrous mobility.  He's blind - it should be an actual impairment.","replies":[{"poster":"Troll for Trump","date":"2015-12-24T03:45:55.092+0000","up_votes":4,"down_votes":12,"body":"^Lee Sin hate threads in a nutshell","replies":[{"poster":"Keevalroy","date":"2015-12-24T03:51:33.522+0000","up_votes":5,"down_votes":0,"body":"I'm not saying it should happen, but if it's insisted that he's blind, it should be reflected.","replies":[{"poster":"Troll for Trump","date":"2015-12-24T07:06:12.651+0000","up_votes":6,"down_votes":1,"body":"Maybe, but Riot will never Leesin to you,\n\nBadum- tch","replies":[]}]}]}]}]},{"poster":"windwolf777","date":"2015-12-23T23:23:20.130+0000","up_votes":3,"down_votes":0,"body":"Have some adorableness \n[Nami](http://pre01.deviantart.net/4c39/th/pre/f/2014/209/7/7/____a_boot_to_the_head_____by_axlrosie-d7spdav.png)\n\n[Cassiopeia](http://25.media.tumblr.com/tumblr_lqt6rr0W2g1qgszuzo1_400.jpg)","replies":[]}]},{"poster":"Saianna","date":"2015-12-23T20:17:30.583+0000","up_votes":7,"down_votes":7,"body":"Riot hasn't grasped what logic is yet, but don't worry they'll get it eventually ;)\n\n(perhaps in season 79)","replies":[{"poster":"Keevalroy","date":"2015-12-23T20:23:18.063+0000","up_votes":17,"down_votes":6,"body":"\"Well we live in a world where two books make a gun {{item:3145}} and two sticks make a hat {{item:3089}}  so why should we focus so much on realism?\" - Riot logic. \n\nGraves was reworked to specifically to give him a shotgun feel.  Uhhh, help?","replies":[]},{"poster":"AbrahamBaconham","date":"2015-12-23T23:08:09.548+0000","up_votes":11,"down_votes":3,"body":"You can have magic or you can have physics. You can't have both.","replies":[{"poster":"PeponiPoro","date":"2015-12-24T03:26:43.202+0000","up_votes":4,"down_votes":0,"body":"That is exactly what the world of Runeterra is though. They have Rune Wars and then they have the cities of Zaun and Piltover. Then there is also Yordles, who seem to show interest in both.","replies":[]}]}]},{"poster":"Llanite","date":"2015-12-23T21:03:11.309+0000","up_votes":3,"down_votes":1,"body":"Actually no, if you throw a knife into a giant fan, it loses velocity and falls to the ground.","replies":[{"poster":"Troll for Trump","date":"2015-12-24T03:46:46.285+0000","up_votes":4,"down_votes":0,"body":"No, but you can lob the knife over  the fan","replies":[]}]}]}]},{"poster":"Ionian","date":"2015-12-23T17:46:22.765+0000","up_votes":31,"down_votes":1,"body":"This happens because the game is actually coded in 2D. For example, Trist's hitbox during Rocket Jump just moves in a straight line, glued to the floor.","replies":[{"poster":"TheLegionofDark","date":"2015-12-23T17:50:29.600+0000","up_votes":11,"down_votes":1,"body":"Wouldn't it be possible to just code abilities like the bubble to be ignored by the windwall?","replies":[{"poster":"The Yetii Rider","date":"2015-12-24T02:31:00.795+0000","up_votes":12,"down_votes":1,"body":"> [{quoted}](name=TheLegionofDark,realm=NA,application-id=3ErqAdtq,discussion-id=kE2ukLrH,comment-id=00010000,timestamp=2015-12-23T17:50:29.600+0000)\n>\n> Wouldn't it be possible to just code abilities like the bubble to be ignored by the windwall?\n\nRiot doesn't want to do that. They want things to be clear to the Yasuo player, and don't want him to try and Wind Wall a skill he can't because it's not clear what is blocked and what isn't.\n\nTo that end, meddler said he was going to change Nautilus's ultimate to not go through Wind Wall, because the boards said it was odd that it was an exception.","replies":[{"poster":"NegusInParis","date":"2015-12-24T08:17:51.390+0000","up_votes":7,"down_votes":0,"body":"Nautilus ultimate was brought up when the boards wanted ground spells to not be blocket by wind wall.","replies":[]},{"poster":"IiIiana","date":"2015-12-24T03:34:56.176+0000","up_votes":3,"down_votes":0,"body":"I understand and don't disagree with Riot on that matter, but isn't Fiora's riposte confusing like that? It blocks some things you wouldn't expect it to, yet doesn't block everything, even with perfect timing.","replies":[{"poster":"LeprechaunJinx","date":"2015-12-24T04:17:19.989+0000","up_votes":4,"down_votes":0,"body":"For sake of clarification, what doesn't Fiora's Riposte block?","replies":[]}]}]}]}]},{"poster":"Stellafreyja","date":"2015-12-23T22:05:58.571+0000","up_votes":28,"down_votes":2,"body":"In my opinion, it should only block a limited number of projectiles before breaking. Someone in another thread suggested it break if Yasuo or someone else walks through it since Yasuos love to stand in the middle of it to avoid damage.\n\nRiot has stated that they hate one-point-wonders, which is why they nerfed Swain's root duration. And yet, Yasuo's Windwall is the best one-point-wonder in the game. He levels it once and he's good and can afford to level it last.\n\nFor only blocking a limited number of projectiles, it should start pretty decently, like 3 or so and then increase as he levels it.\n\nBraum and Yasuo's walls both fulfill the same function, but no one complains about Braum's because he still takes damage from projectiles BECAUSE HE'S A TANK AND THAT'S WHAT HE'S SUPPOSED TO DO.","replies":[]},{"poster":"LatetotheRace","date":"2015-12-23T22:16:58.475+0000","up_votes":21,"down_votes":2,"body":"{{champion:161}}  He stops me from ripping the world apart?!?!?!?!?1? Like wtf?","replies":[{"poster":"kaltenashes","date":"2015-12-23T22:37:56.401+0000","up_votes":12,"down_votes":0,"body":"{{champion:267}} He stops me from drowning the world apart?!?!?!?!?1? Like wtf?","replies":[{"poster":"SeductiveGrandpa","date":"2015-12-23T23:37:02.328+0000","up_votes":9,"down_votes":0,"body":"{{champion:150}} He stops me from boomeranging the world apart?!?!?!?1? Like wtf?","replies":[{"poster":"PeponiPoro","date":"2015-12-24T03:29:32.653+0000","up_votes":5,"down_votes":0,"body":"{{champion:432}} He stops me from cosmically warbling the world apart?!?!?!?!?!? Like wtf?","replies":[{"poster":"Troll for Trump","date":"2015-12-24T03:47:15.767+0000","up_votes":4,"down_votes":0,"body":"{{champion:17}} He stops me from turning the world into a living hell????? wtf?","replies":[{"poster":"Ariel the Cruel","date":"2015-12-24T05:04:49.186+0000","up_votes":6,"down_votes":0,"body":"{{champion:103}} He stops me charming new ~~victims~~ fans!?!?!?!?1? Like, wtf!?","replies":[]},{"poster":"OhZenny","date":"2015-12-24T06:30:00.438+0000","up_votes":4,"down_votes":0,"body":"{{champion:53}} He stops me from pulling the world apart?!?!?!? Like wtf?","replies":[]}]}]}]}]}]},{"poster":"morris1","date":"2015-12-23T18:58:55.743+0000","up_votes":15,"down_votes":0,"body":"Wondering how you haven't said anything about Nami's ult vanishing into nothingness if its corner ever so slightly even clips the wall.","replies":[{"poster":"TheLegionofDark","date":"2015-12-23T19:23:11.897+0000","up_votes":10,"down_votes":1,"body":"I 100% agree with you.  I was going to eventually get there.  It just didn't 100% mix with the \"lobbing\" question I had.  \n\nI don't know,  personally I think the ability is just broken or needs better tuned for situations like Nami's bubble/heimer grenade, as well her it completely canceling out Nami's ult just by barely touching it.\n\nFor clarity I'm not in this case meaning its OP broken, but visually and mechanically broken and needs some work to better function with abilities.","replies":[]},{"poster":"Pikmints","date":"2015-12-23T21:55:10.236+0000","up_votes":6,"down_votes":0,"body":"While I can see Riot's justification as it's one object, I think everyone who plays Nami agrees it should be treated like Azir's ult where if a section of the ult doesn't touch the wall then it keeps going the full distance. I will forever use this as a reference, but the cc on Galio's ultimate isn't able to be reduced by tenacity, so clarity in the game isn't a highest priority in 100% of the circumstances.\n\nI think Riot should look first at multi-object spells like Talon's ult first. Nami's ult being cancelled can be pretty infuriating, but Talon's ult gets entirely stopped if one of the, what appears to be numerous independent projectiles, touches the wall.","replies":[]}]},{"poster":"Nauthes","date":"2015-12-23T20:27:43.597+0000","up_votes":15,"down_votes":1,"body":"I've also noticed it blocks Sona's Ult. Now i know its not a lob, but her Ult doesn't feel like a projectile. Its a Wave of music. \nTo me it doesn't feel like I'm shooting anything. \nIm just spreading the irresistible urge to dance.\nBut Wind > Dance Power","replies":[{"poster":"freeformline","date":"2015-12-24T00:02:16.581+0000","up_votes":6,"down_votes":0,"body":"To be fair, a zone of high turbulence would interfere with the target's ability to hear the music.","replies":[]},{"poster":"CrushforceX","date":"2015-12-24T04:32:12.002+0000","up_votes":4,"down_votes":0,"body":"Simple fix, is code it like a lux ult. Applies the effect and does not travel, kinda like the wave just _appearing_ there","replies":[]}]},{"poster":"Sozan5","date":"2015-12-24T02:59:49.502+0000","up_votes":7,"down_votes":0,"body":"Meh, I don't mind it blocking projectiles as it does.\n\nBUT, there is a much bigger issue I have with it - the projectiles completely disappear. I think they should change it to work exactly like Braum's E - that is, projectiles would \"hit\" the wall (that means Draven axes would bounce back if they hit a wall, Ashe ult would deal AoE damage around the wall etc.) instead of being erased.","replies":[]},{"poster":"Its Me Mega","date":"2015-12-24T00:20:04.738+0000","up_votes":8,"down_votes":1,"body":"When you have a wall that can be thrown out at the last second, and it blocks every single projectile in the game, then yes it blocks too many things.","replies":[]},{"poster":"DevlinCrow","date":"2015-12-24T08:38:47.412+0000","up_votes":5,"down_votes":0,"body":"Definitely, look at Braum's shield, he's a bloody support and it only blocks 1 ability. They should be switched imo","replies":[{"poster":"IronwallJackson","date":"2015-12-24T09:01:58.346+0000","up_votes":1,"down_votes":2,"body":"His wall can be moved, but it still destroys projectiles. It's just that he still has to tank the effects and a portion of the damage. Probably because he's a tank and eating cc and damage are his job.","replies":[{"poster":"DevlinCrow","date":"2015-12-24T13:27:20.268+0000","up_votes":4,"down_votes":0,"body":"You would think a champion dedicated to defensive support would be able to block more than a champion dedicated to damage","replies":[]}]}]},{"poster":"Wyrmblade","date":"2015-12-24T04:48:59.415+0000","up_votes":6,"down_votes":1,"body":"Windwall definitely needs to be toned down. It provides more utility than the ability Braum's entire kit is centered around.","replies":[]},{"poster":"doiminat0r3600","date":"2015-12-23T19:16:26.489+0000","up_votes":6,"down_votes":1,"body":"I mean, Heimer's kit is blocked entirely by one yasuo ability. His ultimate can have its damage drastically reduced by his BS shield that blocks 90% of the damage that is coming in.\n\nIts always bugged me (as a Vel player sometimes) that everything that vel does can be blocked by yasuo's windwall. My only hope is to have my Q go around the windwall or my AA go through it. Even then if one pixel hits the windwall that he is most-likely standing near/inside of, I cannot hit him. A decent Vel has almost no chance of beating a Yasuo simply because of his windwall. \n\nOn another note, It blocks all projectiles. That includes rifts, bullets, boomerangs, bubbles, waves, tornadoes (kinda BS tbh with the Wind:wind Ratio), and even unstoppable missles of magical energy. Something doesn't seem right here.\n\nBraum has the same mechanic but at-least it still damages him a little. Passives also go through his shield and it isn't THAT much of a problem considering it is one sided (seemingly). On another note I have had Braum's shield blocking a Karthus Ult. No idea how but I thought I'd throw that in.\n\nTL;DR: this is a rather big problem giving Yasuo, a Fragile champion, into a high defense and mobility champion. Blocking of everything with such a wide hit-box is sure to cause toxicity.","replies":[{"poster":"The Governer","date":"2015-12-24T01:05:24.525+0000","up_votes":4,"down_votes":0,"body":"Do you know Vel'koz's R is coded as a linear area-of-effect ability instead of a regular projectile? Yasuo's Windwall cannot block it.\n\nThe more you know.","replies":[]}]},{"poster":"Llanite","date":"2015-12-23T20:56:32.348+0000","up_votes":2,"down_votes":8,"body":"Every glass melee has a way to block/evade everything {{champion:105}} {{champion:11}} {{champion:114}} {{champion:238}}{{champion:245}} {{champion:35}} \n\nThere is no such thing as 'block too many'.","replies":[{"poster":"Knoyle","date":"2015-12-23T22:53:51.768+0000","up_votes":9,"down_votes":2,"body":"Evasion and dashing makes sense, but unlike all the Champs you listed Yasuo has a literal shield that he can stand on. Having an escape method is one thing but just being able to flat out stand there and have no worries about incoming projectile damage? Yeah, no.","replies":[{"poster":"bladepuppet","date":"2015-12-24T05:08:44.068+0000","up_votes":4,"down_votes":0,"body":"Plus you could say that he already has another strong escape method with his e dash (at least around minions), so giving him a shield is even more annoying.","replies":[]}]}]},{"poster":"Nanuk Pihoqahiak","date":"2015-12-24T12:30:27.642+0000","up_votes":4,"down_votes":0,"body":"It shouldn't block abilities that rip through the ground, like Braum's ultimate.","replies":[]},{"poster":"PenguinOverlord8","date":"2015-12-24T06:50:59.615+0000","up_votes":4,"down_votes":0,"body":"I have seen a Soraka's Star Call just disappear into the wind. A star falling from above ;-; {{champion:16}} {{item:3070}}","replies":[]},{"poster":"fééd l0rd","date":"2015-12-23T18:49:50.937+0000","up_votes":6,"down_votes":3,"body":"Windwall is a frustrating ability - I agree\nShould it exist? There are tons of frustrating things and if we would remove all of these things the game would get boring (flash tibbers, rocket grab, lantern, Zed's ult, Poppy's ult, etc.). \nI think that the windwall has so much potential is because they don't want Yasuo to be feast or famine. Also his ultimate is really bad for him actually. The first items Yasuo is picking up are? Statiks, Ie, Boots. With these items EVERY midlaner can burst him down quickly enough. During midgame teamfights Yasuo will fly into your whole team - because of his ultimate. Vi does the same, yes, but she is not nearly as squishy as Yasuo is. His ultimate provides utility due to the armorpen. but still for him it's a bad and really risky spell. Therefore I understand that his windwall is so damn strong.","replies":[{"poster":"TheLegionofDark","date":"2015-12-23T19:34:01.350+0000","up_votes":2,"down_votes":0,"body":"I think it can be strong, but not mechanically broken.  Which in cases like Nami's ult where it just clipping it cancels the entire thing, or with like I was asking about lobbing abilities over it.  I'm sorry but I also don't think one ability when placed should be able to 100% nullify an entire champion (which there are multiple champions this applies to). \n\nLike I said in my original post, I'm not saying he needs to be nerfed, but more clarity and what I believe is common sense logic behind what windwall blocks and how mechanically its broken (looking at Nami's ult in this case) and needs to be fixed.","replies":[]}]}]}