{"poster":"ITroll4Fun","date":"2019-10-14T00:25:57.406+0000","title":"Ansage an die Forenbewohner","subforum":"Spielerverhalten & Moderation","up_votes":6,"down_votes":16,"body":"Hallo peoples,\r\n\r\neinige von euch halten mich für einen Forentroll, könnt ihr weiterhin machen, aber dieses Mal ist es eine ernste Angelegenheit. \r\n\r\nDurch meinen Summonersnickname und/oder meine kritische Posts und Kommentare zur Riots Systemen habe ich bisschen Fame bekommen, weshalb ich jetzt öfters FL-Anfragen bekomme, von denen ich keine Ahnung habe. Also nehme ich sie an und frage die Leute wer sie sind  und was sie von mir wollen. Unter denen waren ca 60% richtig negativ gegenüber meiner Person - sie haben mich auch \"beleidigt\" und so weiter. \r\n\r\nZu meinem Problem. Heute war da ein Sonderfall. Ein Spieler, der mal Master war (Zwinker Zwinker). Er hat mir richtig Angst gemacht und mir gedroht. Es fing ca so an, er wollte sehen was für Spieler hinter den Posts steckt und was für \"Skill\" ich habe etc. Das alles war etwas offensiv verfasst worden, z.B. Abwertung gegenüber meiner Entscheidung Supportonly zu sein usw. Da konnte ich mich leider nicht zusammenreißen  und meinte, dass wenn er meine Posts gelesen hat, müsste er wissen, dass ich einen F+ck auf ihn gebe. Dann kamen die Drohungen, dass er und seine Freunde mich aus dem Spiel nehmen werden und dass irgendwelche Screenshots gemacht worden sind.\r\n\r\nIch kenne noch seinen Nicknamen, aber leider habe ich es nicht geschafft, die Konversation zu screenshoten, da ich ingame war.\r\nWas denkt ihr, soll ich diesen Vorfall beim Support melden, ignorieren oder die echte Person hinter dem Beschwörernamen finden?\r\n\r\nLG euer Captain\r\n\r\nPS: {{champion:78}} Wenn du das liest, übertreibe nicht, ich kenne ein paar Tschetschenen.\r\n\r\n{{sticker:sg-ahri-2}}","replies":[{"poster":"clair de lune289","date":"2019-10-14T00:46:10.054+0000","up_votes":9,"down_votes":1,"body":"privater Chat kann und wird von Riot zurecht **nicht** bestraft. Alles was vorher deiner Zustimmung (auch wenn es nur die einmalige Annahme der Freundschaftsanfrage ist) unterliegt deiner **persönlichen** Verantwortung.\n\nEs gibt bei Drohungen etc natürlich die Möglichkeit die Polizei einzuschalten und die kann dann auch bei privatem Chat was unternehmen,dass hat dann allerdings strafrechtliche Konsequenzen und eben nichts mehr mit Riot.\n\nBevor man diesen Schritt jedoch macht sollte man sich klar machen was das bedeutet und dann entscheiden, ob dieser Schritt notwendig ist.\n\nich nehme dich zwar nicht ernst.dafür schreibst einfach zu viel Blödsinn. Dein \"PS\" am Ende macht das mal wieder sehr deutlich","replies":[{"poster":"Lad0g213","date":"2019-10-14T08:30:07.467+0000","up_votes":3,"down_votes":0,"body":"> privater Chat kann und wird von Riot zurecht **nicht** bestraft. Alles was vorher deiner Zustimmung (auch wenn es nur die einmalige Annahme der Freundschaftsanfrage ist) unterliegt deiner **persönlichen** Verantwortung.\n\n\nDas man durch privat Chat nicht bestraft werden kann ist mir neu, mir wurde neulig von einem Support etwas anderes gesagt. \nIch hatte ein Ticket gemacht vor rund einem Jahr auf meinem anderen Account, weil so ein Typ mir ne pw chatcher Seite geschickt hatte und ich ohne zu überlegen drauf geklickt habe und das ganze dann mit dem Support abgeklärt habe und die Seite meldete , jedoch habe ich dann noch andere Sachen nach gefragt wie zum Beispiel ob es auch strafen für beleidigungen im Privat Chat gäbe, woraufhin er mir mit einem eindeutigen **Ja** antwortete.","replies":[{"poster":"Megamaexx","date":"2019-10-14T09:23:35.580+0000","up_votes":1,"down_votes":0,"body":"> [...]ob es auch strafen für beleidigungen im Privat Chat gäbe, woraufhin er mir mit einem eindeutigen Ja antwortete.\n\nMir wurde das vor Ca 2 Jahren mit einem eindeutigen Nein beantwortet.","replies":[{"poster":"Hinata Misaki","date":"2019-10-14T13:57:01.045+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=KYnfKGf0,discussion-id=Q6z0vaU7,comment-id=000100010001,timestamp=2019-10-14T09:23:35.580+0000)\n>\n> Mir wurde das vor Ca 2 Jahren mit einem eindeutigen Nein beantwortet.\n\nAlso ich hab schon mehrmals Leute die mich nach dem Game geaddet haben weil ich ein schlechtes Game hatte, gemeldet (mit einem Screenshot des Chats natürlich) und bei 80% kann ich sicher sagen, dass es eine Strafe gab, da ich sie auch so gemeldet hab, da sie ingame schon toxic waren und dann nach der Antwort vom Support immer ein Instant Feedback Report kam^^\n\nAußerdem wurde mir jedes Mal, wenn ich nachgefragt habe gesagt, dass sofern man einen Screenshot davon hat, eine Meldung auch im Privatchat zu strafen führt (sofern es sich um wirkliche Beleidigung oder sonstiges Fehlverhalten handelt).","replies":[{"poster":"Angel Ayume","date":"2019-10-14T14:25:26.837+0000","up_votes":2,"down_votes":0,"body":"Hast du davon einen Beweis? Also die Antwort vom Support zB, wo ganz klar steht, dass Beleidigungen im Privatchat ebenfalls zu Strafen führen. Würde das nämlich gerne mal sehen per Screenshot. \n\nDenn mir wurde das vor einiger Zeit auch mit einem klaren Nein beantwortet.","replies":[]}]}]},{"poster":"MidlaneGod115","date":"2019-10-14T08:43:58.174+0000","up_votes":1,"down_votes":0,"body":"Da gab es mal nen Reddit Post drüber, dass sich die Supporter nicht alle einig sind...","replies":[{"poster":"Angel Ayume","date":"2019-10-14T11:21:58.650+0000","up_votes":2,"down_votes":0,"body":"Dito\n\nEdit: Ich seh grade, dass ich mich verklickt habe. Der Post sollte eigentlich unter den von Megamaexx... \n\n> Mir wurde das vor Ca 2 Jahren mit einem eindeutigen Nein beantwortet.\n\nMir wurde das ebenfalls mit einem klaren Nein beantwortet. ","replies":[]}]}]},{"poster":"SackRyze","date":"2019-10-17T19:15:22.572+0000","up_votes":1,"down_votes":0,"body":"Der Private Chat wird bestraft ich habe vor kurzem den ChatVerlauf von jemandem Gescreenshotted der mich geaddet hat nur um mich extremst zu beleidigen weil das Game wohl nich so gelungen ist. Er wurde innerhalb der nächsten 3 Tage gebannt xD.{{sticker:sg-syndra}}","replies":[{"poster":"Angel Ayume","date":"2019-10-17T19:23:59.990+0000","up_votes":1,"down_votes":0,"body":"Woher weißt du das er gebannt wurde und woher weißt du, dass er DESWEGEN gebannt wurde?","replies":[]}]},{"poster":"ITroll4Fun","date":"2019-10-14T01:45:40.039+0000","up_votes":1,"down_votes":2,"body":"{{sticker:sg-soraka}}","replies":[]}]},{"poster":"00 M4ddin 00","date":"2019-10-14T07:00:42.660+0000","up_votes":7,"down_votes":1,"body":"Hahahahahahhahahahahahahhahahqhahahahhahahahahahahahhahahahahaha\n\nIn welcher Traum Welt lebst du das du denkst irgend jemand würde dich Anden weil du sowas wie \"fame\" bist ^^ \n\nDie wo dich adden sind maximal smurf acc von Foren Nutzern die dich einfach beleidigen wollen weil sie es im Forum nicht dürfen\n\nEdit. \nNatürlich ist das nicht soweit ok und wenn sie was richtig böses schreiben würde ich damit auch zur Polizei gehen ;) einfach nur um die damit richtig zu ärgern ;)","replies":[{"poster":"ITroll4Fun","date":"2019-10-14T11:15:42.246+0000","up_votes":2,"down_votes":3,"body":"\"hey, habe dich im forum gesehen gehabt und fand deinen namen gut xD\"\n\nDie negativen Beispiele kann ich nicht reinkopieren, habe die boys/girls/Xs nicht mehr auf der FL. Der plötzliche Anstieg der FL-Anfragen ist wohl kein Indiz für Fame? Sei bitte nicht neidisch, ich wollte diesen Fame nicht.\n\n{{sticker:sg-shisa}}","replies":[{"poster":"00 M4ddin 00","date":"2019-10-15T06:57:37.853+0000","up_votes":1,"down_votes":1,"body":"Hahaha :D","replies":[]}]}]},{"poster":"Ráyleigh","date":"2019-10-14T08:44:16.385+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=CptOnDuty,realm=EUW,application-id=KYnfKGf0,discussion-id=Q6z0vaU7,comment-id=,timestamp=2019-10-14T00:25:57.406+0000)\n>\n> Hallo peoples,\n> \n> einige von euch halten mich für einen Forentroll, könnt ihr weiterhin machen, aber dieses Mal ist es eine ernste Angelegenheit. \n\nDu gibst dich ja mit absich als Forentroll und das auch nicht selten ziemlich Offensiv.\n\n> \n> Durch meinen Summonersnickname und/oder meine kritische Posts und Kommentare zur Riots Systemen habe ich bisschen Fame bekommen, weshalb ich jetzt öfters FL-Anfragen bekomme, von denen ich keine Ahnung habe. Also nehme ich sie an und frage die Leute wer sie sind  und was sie von mir wollen. Unter denen waren ca 60% richtig negativ gegenüber meiner Person - sie haben mich auch \"beleidigt\" und so weiter. \n> \n\nIch habe mir fast gedacht das es langsam so kommen wird. >.&lt;\nEs ist echt schade, dass du hier direkt Downvotes bekommst... Da dich einfach keiner mehr ernst nimmt oder wie man merkt nehmen dich einige zu ernst und werden Persönlich.\nDu kannst doch weiter Riot kritisch usw. bleiben aber bring es auf ein vernünftiges Niveau.\n\nIch lasse dir ein Upvote da es ist ja doch ein ernst zu nehmendes Thema.\n\n> Zu meinem Problem. Heute war da ein Sonderfall. Ein Spieler, der mal Master war (Zwinker Zwinker). Er hat mir richtig Angst gemacht und mir gedroht. Es fing ca so an, er wollte sehen was für Spieler hinter den Posts steckt und was für \"Skill\" ich habe etc. Das alles war etwas offensiv verfasst worden, z.B. Abwertung gegenüber meiner Entscheidung Supportonly zu sein usw. Da konnte ich mich leider nicht zusammenreißen  und meinte, dass wenn er meine Posts gelesen hat, müsste er wissen, dass ich einen F+ck auf ihn gebe. Dann kamen die Drohungen, dass er und seine Freunde mich aus dem Spiel nehmen werden und dass irgendwelche Screenshots gemacht worden sind.\n> \n\nIch würde an deiner Stelle dem Riot Support schreiben und auch zur Polizei gehen.\nSo hast du dich in den Punkten abgesichert.\nNicht das du unser Rainer wirst :D","replies":[{"poster":"Izaya Kumiho","date":"2019-10-14T13:03:16.386+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Ráyleigh,realm=EUW,application-id=KYnfKGf0,discussion-id=Q6z0vaU7,comment-id=0004,timestamp=2019-10-14T08:44:16.385+0000)\n>\n> Nicht das du unser Rainer wirst :D\n\nOh Gott, naaaiin. Ich erinnere mich noch an den Dude. Uff. :D","replies":[{"poster":"Ráyleigh","date":"2019-10-14T13:08:24.732+0000","up_votes":1,"down_votes":0,"body":"Der Kerl ist einfach ein knaller :D","replies":[{"poster":"Veezey","date":"2019-10-15T13:13:50.958+0000","up_votes":1,"down_votes":0,"body":"Das ist A richtig und B falsch","replies":[{"poster":"Ráyleigh","date":"2019-10-15T13:35:27.434+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-zephyr}}","replies":[{"poster":"Veezey","date":"2019-10-15T16:15:32.670+0000","up_votes":1,"down_votes":0,"body":"Das Meer ist nun mal größer als die Welt","replies":[]}]}]}]}]},{"poster":"ITroll4Fun","date":"2019-10-14T11:25:12.136+0000","up_votes":1,"down_votes":2,"body":"Danke. \n\nWarum Rainer? Ich kenne die Situation nicht.","replies":[{"poster":"Ráyleigh","date":"2019-10-14T13:07:46.787+0000","up_votes":1,"down_votes":0,"body":"Drachenlord :D","replies":[]}]}]},{"poster":"Angel Ayume","date":"2019-10-14T12:20:52.517+0000","up_votes":5,"down_votes":1,"body":"Das man dich als Forentroll bezeichnet bist du selbst schuld. Denn du gibst dich genau so. Viele deiner Beiträge zielen einfach nur darauf ab zu provozieren und bei einem ernsten Thema reagierst du meist nur sarkastisch und versuchst das ganze in lächerliche zu ziehen. \nDeswegen kann man mit dir kein ernstes Thema diskutieren. \nUnd dann wunderst du dich, dass man dich als Forentroll betitelt und dich nicht mehr ernst nimmt?\n\nSelbst das, was du jetzt in diesem Thread angesprochen hast ist schwer ernst zunehmen, alleine schon wegen deinem PS:. Warum hast du das dahin geschrieben? Was hat so ein Satz bei so einem Thema zusuchen, wenn du doch was ernstes ansprechen willst? Wenn du ernst genommen werden willst, dann fang an dich bei ernsten Themen auch erwachsen zu verhalten. \n\n---\n\nWas das Verhalten der Spieler angeht die dich geaddet haben - falls das überhaupt der Wahrheit entspricht - ist das natürlich nicht in Ordnung. Das liegt aber nicht an deinem angeblichen \"Fame\", denn fame biste ganz sicher nicht, sondern das liegt an deine oben angesprochene Art und Weise mit gewissen Themen umzugehen und mit manchen Spielern zu reden. Ich sag nur \"du bist erbärmlich, weil du low Elo bist\". Sowas geht halt gar nicht, das einige darauf empfindlich reagieren und dir mal nen bisschen heftiger die Meinung sagen wollen als sie es hier im Forum können ist irgendwie nicht wirklich verwunderlich.","replies":[{"poster":"ITroll4Fun","date":"2019-10-14T13:34:56.337+0000","up_votes":1,"down_votes":3,"body":">.. und bei einem ernsten Thema reagierst du meist nur sarkastisch und versuchst das ganze in lächerliche zu ziehen.\n\nIch bin eine Kunstfigur und kein Troll. Ist doch gut. Sarkasmus und Satire ist beschte.\n\n>Selbst das, was du jetzt in diesem Thread angesprochen hast ist schwer ernst zunehmen, alleine schon wegen deinem PS:. Warum hast du das dahin geschrieben?\n\nWar an diesen einen Beschwörer gerichtet, er liest ja meine Posts. \n\n>und dir mal nen bisschen heftiger die Meinung sagen wollen als sie es hier im Forum können ist irgendwie nicht wirklich verwunderlich.\n\nIch würde es bevorzugen, wenn sie es mit \"heftiger\" ins Gesicht sagen würden.","replies":[{"poster":"Angel Ayume","date":"2019-10-14T14:22:59.389+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=CptOnDuty,realm=EUW,application-id=KYnfKGf0,discussion-id=Q6z0vaU7,comment-id=00060000,timestamp=2019-10-14T13:34:56.337+0000)\n>\n> Ich bin eine Kunstfigur und kein Troll. \n\nNein, für mich und für viele andere bist du nur ein Troll und der ist einfach nur nervig. \n\nIst doch gut. Sarkasmus und Satire ist beschte.\n\nNicht, wenn es nicht passt. Und dein Sarkasmus ist oft genug fehl am Platz. \n\n> \n> War an diesen einen Beschwörer gerichtet, er liest ja meine Posts. \n\nMag sein, aber grade sowas sorgt dafür, dass man dich nicht ernst nehmen kann... \n\n> \n> Ich würde es bevorzugen, wenn sie es mit \"heftiger\" ins Gesicht sagen würden.\n\nAch so, du beschwerst dich mit einem Thread, dass man dir \"heftiger\" die Meinung gesagt hat und nun sagst du, dass du das eigentlich bevorzugst? Entscheide dich! Entweder du findest das gut oder du findest es kacke -.- \n\nMit heftiger die Meinung geigen meinte ich übrigens dieses \"adden und ihn im privat Chat angehen mitunter mit Beleidigungen\".","replies":[{"poster":"ITroll4Fun","date":"2019-10-14T15:42:38.909+0000","up_votes":1,"down_votes":3,"body":">Ach so, du beschwerst dich mit einem Thread, dass man dir \"heftiger\" die Meinung gesagt hat und nun sagst du, dass du das eigentlich bevorzugst? Entscheide dich! Entweder du findest das gut oder du findest es kacke -.\n\nIch habe nichts dagegen, wenn man mich kritisiert, aber dann soll der dude vor mir stehen und nicht im Internet auf Großmaul machen und mich bedrohen. Dass er mich \"beleidigt\" ist mir egal, ist sowieso nur ein Whiteknight Spa*t.","replies":[{"poster":"Angel Ayume","date":"2019-10-14T16:13:36.432+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=CptOnDuty,realm=EUW,application-id=KYnfKGf0,discussion-id=Q6z0vaU7,comment-id=0006000000000000,timestamp=2019-10-14T15:42:38.909+0000)\n>\n> Ich habe nichts dagegen, wenn man mich kritisiert, aber dann soll der dude vor mir stehen und nicht im Internet auf Großmaul machen und mich bedrohen. \n\nDa wir uns im Internet befinden haben wir keine andere Wahl als dir verbal übers Internet die Meinung zu sagen. ^^ So wichtig bist du nicht, dass man dich persönlich treffen soll nur um dir zu sagen, was man von dir hält.\n\n> Dass er mich \"beleidigt\" ist mir egal, ist sowieso nur ein Whiteknight Spa*t.\n\nWegen solchen Aussagen wirst du verbal angegangen.\n","replies":[]}]}]},{"poster":"MeMyselfandBaal","date":"2019-10-15T01:41:18.282+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=CptOnDuty,realm=EUW,application-id=KYnfKGf0,discussion-id=Q6z0vaU7,comment-id=00060000,timestamp=2019-10-14T13:34:56.337+0000)\n>\n> Ich bin eine Kunstfigur und kein Troll. Ist doch gut. Sarkasmus und Satire ist beschte.\n\nNur weil es nervt ist es noch keine Kunst.","replies":[]}]}]},{"poster":"Shacoláde","date":"2019-10-14T08:29:12.393+0000","up_votes":4,"down_votes":1,"body":">  Riots Systemen habe ich bisschen **Fame bekommen**\n\nJa... du bist die Kim Kardashian des Forums.\n\n> Er hat mir richtig Angst gemacht und mir gedroht.\n\nUnd...was hat dich davon abgehalten ihn gleich von der FL zu entfernen?\nIch frag mich was du dir von dem Beitrag erhoffst.. Mitleid.. Verständnis... oder einfach nur den \"Twitter-Effekt\",\nindem du irgendwas schreibst, was null Disskussiongrundstoff bietet, sondern zu versuchen sich einfach nur \"wichtig\" zu machen.\n\nLass bitte gut sein und spiel einfach mit deinen \"Mate\" weiter, den du reporten wolltest (andere Beitrag), weil er flamt und feedet.","replies":[{"poster":"II3RDB4NG","date":"2019-10-14T08:51:40.049+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Shacoláde,realm=EUW,application-id=KYnfKGf0,discussion-id=Q6z0vaU7,comment-id=0003,timestamp=2019-10-14T08:29:12.393+0000)\n>\n> Ja... du bist die Kim Kardashian des Forums.\n\n\nMade my day {{sticker:slayer-pantheon-thumbs}}\n\n","replies":[{"poster":"Shacoláde","date":"2019-10-14T09:41:20.445+0000","up_votes":1,"down_votes":0,"body":"Freut mich :)))","replies":[]}]},{"poster":"ITroll4Fun","date":"2019-10-14T11:21:33.414+0000","up_votes":2,"down_votes":1,"body":">Ja... du bist die Kim Kardashian des Forums.\n\nNein, ich habe mit Ray J nichts am Hut.\n\n>Und...was hat dich davon abgehalten ihn gleich von der FL zu entfernen?\n\nEr hat erst zurückgeschrieben als ich bereits ingame war. Danach hat er mich selbst von der FL entfernt bzw. wahrscheinlich geblockt.\n\n>Ich frag mich was du dir von dem Beitrag erhoffst.. Mitleid.. Verständnis... oder einfach nur den \"Twitter-Effekt\",\nindem du irgendwas schreibst, was null Disskussiongrundstoff bietet, sondern zu versuchen sich einfach nur \"wichtig\" zu machen.\n\n\" Ich sag das ist was für deinen Leistungskurs zum interpretieren\"\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Shacoláde","date":"2019-10-14T11:27:06.390+0000","up_votes":1,"down_votes":0,"body":"> \" Ich sag das ist was für deinen Leistungskurs zum interpretieren\"\n\nIch frag dich nach einem Grund und du versuchst zu provozieren.\nHier merkt man, dass du nicht diskutieren willst, sondern einfach nur trollen.\n\nBitte tu uns alle einen gefallen und lass die Beiträge einfach sein.","replies":[{"poster":"ITroll4Fun","date":"2019-10-14T11:40:01.353+0000","up_votes":1,"down_votes":0,"body":"Oh sorry, du meintest das ernst und ich dachte die Intention war deutlich. Nein, ich wollte nicht trollen. Ich wollte nur diesem Problem (Drohungen etc.) Aufmerksamkeit schenken.","replies":[{"poster":"Shacoláde","date":"2019-10-14T11:47:40.089+0000","up_votes":1,"down_votes":0,"body":"Ja, ok.... \nIch wart aber immer noch auf einen Grund ^^","replies":[]}]}]}]}]},{"poster":"Izaya Kumiho","date":"2019-10-14T13:02:14.915+0000","up_votes":3,"down_votes":2,"body":">Unter denen waren ca 60% richtig negativ gegenüber meiner Person - sie haben mich auch \"beleidigt\" und so weiter. \n\nJa aber...wundert sich das?\nKlar, sowas ist nicht okay...aber wenn du mit Steinen nach Leuten wirfst, solltest du mit einer Gegenreaktion rechnen.\n\n>Was denkt ihr, soll ich diesen Vorfall beim Support melden\n\nDie Drohung wirkt eher nicht so gefährlich, to be honest.","replies":[{"poster":"ITroll4Fun","date":"2019-10-14T14:23:40.912+0000","up_votes":2,"down_votes":4,"body":">Klar, sowas ist nicht okay...aber wenn du mit Steinen nach Leuten wirfst, solltest du mit einer Gegenreaktion rechnen.\n\nWo werfe ich denn mit Steinen?  Die Leute können einfach nicht akzeptieren, dass jemand eine abweichende Meinung zu einem Thema hat. Ich bevorzuge kein Schaf zu sein, was blind folgt.","replies":[{"poster":"Angel Ayume","date":"2019-10-14T14:52:45.554+0000","up_votes":3,"down_votes":1,"body":"Indem du zB anderen sagst sie seien erbärmlich, nur weil sie nicht so gut in einem Onlinespiel sind...","replies":[{"poster":"ITroll4Fun","date":"2019-10-14T15:40:09.158+0000","up_votes":1,"down_votes":5,"body":"Ich habe es nicht gesagt. Es ist erbärmlich ,dass man schlechte Spieler ins Ranked lässt. Wenn der dude sich als schlecht einstuft, ist es seine Sache, aber ich habe ihn nicht als erbärmlich bezeichnet. Sein statement zum System war erbärmlich und seine Aussage zum Fortnite.","replies":[{"poster":"Angel Ayume","date":"2019-10-14T16:11:54.321+0000","up_votes":4,"down_votes":2,"body":"Das wäre äußerst diskriminierend! \n\nDu kannst doch nicht sagen, dass Spieler kein Recht haben Ranked zu spielen nur weil sie schlecht sind. Das ist als würdest du sagen, dass Männer nicht mehr ins Kino dürfen nur weil sie männlich sind. \n\nAußerdem gibt es extra die low Elo für schlechtere Spieler. Wer nicht gut genug ist bzw schlecht, der ist eben in low Elo. Es ist außerdem nichts verwerfliches daran, wenn jemand in etwas schlecht ist. Ob das nun in einem Spiel ist, im Sport ist oder in einem Unterrichtsfach.","replies":[{"poster":"ITroll4Fun","date":"2019-10-14T17:07:39.661+0000","up_votes":1,"down_votes":4,"body":"Ich versuch mal die umgekehrte Logik, einer von euch hat es beim Ban des Prepicks erwähnt, also dass der dude nicht entscheidet was du spielst, sondern was du nicht spielst.\n\nWas soll daran diskriminierend sein? Du spielste schlecht, bekommste einen \"Rankedban\" für ein paar Spiele (10). Ich denke dann würde mehr Leute nachdenken bevor sie einfach reinfeeden.","replies":[{"poster":"Angel Ayume","date":"2019-10-14T20:07:51.920+0000","up_votes":3,"down_votes":0,"body":"> Ich versuch mal die umgekehrte Logik, einer von euch hat es beim Ban des Prepicks erwähnt, also dass der dude nicht entscheidet was du spielst, sondern was du nicht spielst.\n\nSoll mir was sagen? Was hat das Bannen einen Champs von einem Mitspieler damit zutun dass es unfair wäre schlechte Spieler vom Ranked auszuschließen?\n\nUnd meinst du echt die Spieler feeden freiwillig? Das ist schwachsinnig. Sie sind auch geknickt darüber dass sie gefeedet haben. \nSelbst ein Faker hat mal Games wo er feedet. Sicher, sie kommen bei ihm wohl eher selten vor aber es gibt sie. \nAbsichtlich so schlecht gestanden hat er sicher nicht.\n\nIch habe letztens auch ein Game gehabt wo ich 3/8 stand. Diese Games kommen bei mir durchaus selten vor, aber es gibt sie. Willst du mich jetzt dafür bestrafen, dass ich einfach schlecht gespielt habe? Das ist doch unsinnig. \n\nUnd was ist mit denen die LoL noch nicht lange spielen aber eben lieber Ranked spielen? Die steigen sowieso ab und landen irgendwann in der Elo in der sie auch gehören. Willst du sie auch dafür bestrafen nur weil sie schlecht sind bzw noch zu unerfahren in dem Spiel? \n\nEs ist noch kein Meister vom Himmel gefallen. Du kannst von niemandem Perfektion erwarten. Nichtmal von den Profis.","replies":[{"poster":"ITroll4Fun","date":"2019-10-14T22:47:53.718+0000","up_votes":1,"down_votes":4,"body":"Wieso ist es eine Strafe? Es ist die Chance sich zu verbessern, findeste nicht?","replies":[{"poster":"Angel Ayume","date":"2019-10-15T05:37:23.227+0000","up_votes":4,"down_votes":0,"body":"Nun erkläre mir doch mal, was eine Rankedsperre für eine Chance sein soll sich zu verbessern? \nWer sich nicht verbessern will, der wird das auch nicht im Normal schaffen. Und wer sich verbessern will, der schafft das genau so gut in Rankedgames. \n\nUnd ja, eine Rankedsperre IST eine Strafe. Auch wenn du das selbst nicht als solche wahrhaben willst, eine Sperre bzw von etwas ausgeschlossen zu werden aufgrund eines Ereignisses wofür du selbst gesorgt hast, ist eine Strafe.\nUnd selbst wenn Riot sagen würde \"dies ist keine Strafe\" würden es die Spieler als solche Empfinden und es würde nur Frustration und Wut hervorrufen und ganz sicher nicht dafür sorgen, dass sich der Spieler jetzt auch bessert. \n\nBei Flaming ist es doch ähnlich. Ein Flamer flamed doch oft, weil er sich über die Fehler seiner Mates aufregt und will, dass er diese nicht mehr in \"seinem\" Game macht. Doch das Flaming bewirkt das genaue Gegenteil. Der Spieler wird nicht plötzlich besser oder reißt sich zusammen, damit er nicht mehr geflamed wird. Nein, er wird wütend, flamed vllt zurück oder denkt sich \"jetzt erst recht\".","replies":[]},{"poster":"eingew","date":"2019-10-15T04:36:24.187+0000","up_votes":2,"down_votes":0,"body":"Aber ja viel weniger als aktuell.","replies":[]}]}]},{"poster":"eingew","date":"2019-10-15T04:35:48.852+0000","up_votes":2,"down_votes":1,"body":"Ich finde die aktuelle Strafe des Demotes bedeutend effektiver, weil man nach jedem Spiel Feedback für seine (schlechte) Leistung erhält und nicht nur alle 11.","replies":[]}]}]}]}]},{"poster":"Izaya Kumiho","date":"2019-10-14T14:47:30.160+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=CptOnDuty,realm=EUW,application-id=KYnfKGf0,discussion-id=Q6z0vaU7,comment-id=00070000,timestamp=2019-10-14T14:23:40.912+0000)\n>\n> Wo werfe ich denn mit Steinen?  Die Leute können einfach nicht akzeptieren, dass jemand eine abweichende Meinung zu einem Thema hat. Ich bevorzuge kein Schaf zu sein, was blind folgt.\n\nSagtest du nicht gerade selber noch, du würdest der Forentroll sein?","replies":[{"poster":"ITroll4Fun","date":"2019-10-14T14:59:47.428+0000","up_votes":1,"down_votes":2,"body":"Leute halten mich für einen. Ich selbst sehe mich nicht als Troll an. Aber Menschen spielen ja Theater. Wer weiß, der weiß.","replies":[]}]}]}]},{"poster":"Abasin","date":"2019-10-14T21:05:54.268+0000","up_votes":2,"down_votes":0,"body":"{{champion:48}}","replies":[]},{"poster":"SayaShire","date":"2019-10-14T00:32:35.881+0000","up_votes":2,"down_votes":0,"body":"Mal davon abgesehen, dass die meisten Drohungen genau so effektiv sind, wie Babypüpse... \n\nHaben die auch gesagt, wie sie dich finden wollen? \n\nRiot kann sowohl den ingamechat sehen, als auch den vor und nach jedem Match.\nReporte den Typ einfach per Ticket und bitte den Support darum, den Chat durchzulesen. \n\nVermutlich sind das aber nur leere Drohungen von irgendwelchen Halbstarken mit weniger als drei Achselhaaren. \nDennoch - sollten die dir so richtig Angst gemacht haben, kannst du das auch zur Anzeige bringen und die Polizei mal nach denen suchen lassen. \nDann geht denen der Poppes vermutlich auf Grundeis, wie diesem Terrorzwerg in den USA, bei dem das FBI auf der Matte stand.","replies":[{"poster":"Megamaexx","date":"2019-10-14T09:21:15.771+0000","up_votes":1,"down_votes":0,"body":"Das ist aber in nem Privatchat geschehen, ich glaube nicht, dass die Supportmitarbeiter diesen lesen dürfen. Riot wird es garantiert vermeiden wollen, Privatsphäreverletzungsklagen zu bekommen, nur weil alle Mitarbeiter und einige Dienstleister die Chats lesen dürfen^^ und ist günstiger.\nNe Anzeige wäre wohl das einzige, was eine tatsächliche Option darstellt.","replies":[]}]}]}