{"poster":"ITroll4Fun","date":"2019-09-14T13:30:40.934+0000","title":"Diese Reaktion normal in League?","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":14,"body":"Hello peoples,\r\n\r\nich war mal wieder am \"trollen\" mit dem Teemosupp, wurde wie meist in der Selection geflamet as hell , vor allem durch den \"Schützen\". Ich bin ehrlich hatte nicht mein bestes Spiel. Also das Spiel war eigenermaßen even, wir verlieren bot, Ryze gewinnt mid, weil er einen Sit von der Vi bekommt. Dann macht das Team falsche Entscheidungen. Ich flame sie dafür nicht, jeder kann falsche Entscheidungen treffen. Zuerst hat es uns den Nash gekostet und dann das Spiel, weil während die Quinn auf der Bot war, entschied sich der Ryze mit der Vi 2v5 bzw. mit uns dann 4v5 zu engangen.\r\n\r\nUnd nach dem Match werde natürlich ich geflamet. ich bin ja so böse und will eine \"Abwechslung\" auf der Botlane. Meine Antwort war kurz. Ich meinte, dass es nicht mein Pick war, welcher euch zu diesem 4v5 Engage zwang, obwohl wir die Quinn auf bot sahen. Und wenn ich so schlecht bin und anstatt League Playmobil spielen soll, wieso sind wir in derselben \"Elo\". Dann  ist der dude komplett ausgerastet lol. Warum? Harte Wahrheit?","replies":[{"poster":"Hundis Katze","date":"2019-09-14T13:39:52.832+0000","up_votes":12,"down_votes":2,"body":"Es wurde schon genug zu deinen speziellen Support gesagt. Allgemein frage ich mich was du erwartest.\n\nIch selbst spiele hin und wieder Teemo Supp oder AP Shaco und hatte nicht mal ansatzweise solche Probleme.\n\nNach deinen Verhalten in Forum zu urteilen, muss ich sagen, dass du anscheinend selbst viel zum Klima beträgtst.","replies":[{"poster":"ITroll4Fun","date":"2019-09-15T11:06:02.034+0000","up_votes":1,"down_votes":5,"body":"Die Frage ist warum der dude so toxisch auf seine eigene Fehler und meine \"Verteidigung\" reagiert und nicht mein Pick, obwohl es wahrscheinlich sein Trigger war. Ich muss keinem den Pick erklären, ich bin freier Mensch und kann machen was ich will (mit Beachtung der Gesetze natürlich). Wenn du ein Anhänger der aktullen Meta bist, ist es deine Entscheidung.\n\nIch könnte jeden Champ spielen und der dude würde genauso reagieren, weil die Leute in League Kritik nicht aushalten können. League ist ja eine rosarote Welt, wo es keine Trolle und Feeder existieren. Und der Chat besteht immer aus ggwps und gjs, wenn nicht dann ist der Spieler \"toxisch\" oder nicht?\n\nDas ist halt nicht so, aber Riot weigert sich, etwas daran zu ändern, die Mängel der Systeme sind so sichtbar, dass ein Blinder sie sehen würde, aber Riot juckt es nicht und sie verteidigen ihre veraltete Systeme mit dem RnG, aber zugleich ist das MM kein RNG. Für mich ein Widerspruch.","replies":[{"poster":"5weeds","date":"2019-09-16T10:50:20.573+0000","up_votes":1,"down_votes":0,"body":"> sie verteidigen ihre veraltete Systeme mit dem RnG, aber zugleich ist das MM kein RNG. Für mich ein Widerspruch.\n\nWas bedeutet MM und RnG?","replies":[{"poster":"ITroll4Fun","date":"2019-09-16T12:30:28.032+0000","up_votes":2,"down_votes":1,"body":"Matchmaking und random number generator","replies":[{"poster":"5weeds","date":"2019-09-20T08:07:58.849+0000","up_votes":1,"down_votes":0,"body":"Mit dem Matchmaking hatte ich eigentlich noch nie Probleme und ich spiel schon seit ein paar Jahren.\n\nAber was meinst du mit random number Generator?","replies":[{"poster":"SSF LastAngel","date":"2019-09-20T11:15:35.319+0000","up_votes":1,"down_votes":0,"body":"Randon Number Generator (RNG) ist ein Hilfsmittel beziehungsweise ein Indikator dafür mit und gegen welche Spieler man ein Spiel bestreitet. Ich gebe zu es klingt wie die Definition der MMR aber es hat damit zu tun das deine MMR dir einen Wert vorgibt der vom RNG erfasst wird (oder so ähnlich). Und aufgrund der MMR matcht der RNG dich dann mit und gegen Spieler von einem ähnlichen level.\n@Angel Ayume mit rein zufällig gewinnen oder verlieren hat das Spiel wenig zu tun, es sind 10 Spieler , 5 pro Seite und es gibt viele Faktoren die dafür entscheidend sind ob man gewinnt oder verliert die mmr und der rng in einem ranked eher selten bis nie","replies":[{"poster":"Angel Ayume","date":"2019-09-20T11:16:49.373+0000","up_votes":2,"down_votes":0,"body":"Du solltest vielleicht genauer lesen. ^^ ICH habe das nicht behauptet xD","replies":[{"poster":"SSF LastAngel","date":"2019-09-22T09:01:10.814+0000","up_votes":1,"down_votes":0,"body":"Jo mein Fehler sorry xd","replies":[]}]},{"poster":"5weeds","date":"2019-09-23T13:00:11.141+0000","up_votes":1,"down_votes":0,"body":"Danke für die tolle Erklärung ^^","replies":[{"poster":"SSF LastAngel","date":"2019-09-23T16:55:56.696+0000","up_votes":1,"down_votes":0,"body":"gerne","replies":[]}]},{"poster":"Haudruppmoor","date":"2019-09-20T12:27:09.917+0000","up_votes":1,"down_votes":0,"body":"https://www.reddit.com/r/summonerschool/comments/2bdu5a/how_much_rngluck_is_involved_in_lol/\n\nhttps://www.reddit.com/r/leagueoflegends/comments/33mt4p/does_lol_use_rng_or_prng/\n\nDa wird über Crits gesprochen. MMn. ist RNG genau wie zB. Inten ein Begriff den sich einige Communityleuts ausgedacht haben . Die wollen nur zum Ausdruck zu bringen , daß das Matchmaking blanker Zufall und deshalb ranzig ist. Damit soll wohl einiges kompensiert werden. \n\nIch habe da nirgendwo ne zuverlässige offizielle Quelle dazu gefunden. Wenn Du eine hast, dann her damit.","replies":[]}]},{"poster":"Angel Ayume","date":"2019-09-20T09:05:41.596+0000","up_votes":2,"down_votes":0,"body":"Er will damit sagen, dass LoL zu gewinnen oder zu verlieren rein zufällig geschieht. ^^","replies":[]}]}]}]}]}]},{"poster":"LegendaryXenon","date":"2019-09-14T14:10:30.952+0000","up_votes":7,"down_votes":2,"body":"Wurde inzwischen alles mit dir besprochen. Du kennst die Gründe. \n\nIch seh da keine Grundlage zu diskutieren.","replies":[{"poster":"ITroll4Fun","date":"2019-09-15T11:07:22.669+0000","up_votes":1,"down_votes":1,"body":"Nein , tue ich nicht. Wieso blamet er meinen Pick für seinen Fehler?","replies":[{"poster":"SayaShire","date":"2019-09-15T12:32:25.152+0000","up_votes":1,"down_votes":0,"body":"Weil das so ist. \nEin Großteil der Leute sieht andern Leutens Fehler zuerst.\nOder halten sich für so gut, dass ihr Fehler nichtig ist. \n\nGestern erlebt. Gragas Support, vorher noch geprahlt, er wäre Dia Smurf. \nKommt mich ganken auf der Top. Ich pinge ihm aber dass ich nichtmal 30% Leben übrig habe und nicht reingehen will. \nWar ihm egal, er ging trotzdem rein. Und so doof wie ich bin, versuche ich zu helfen, obwohl ich mir sicher bin, dass es ein Fehler ist. \nWar es auch, es gab dann einen Countergank und natürlich wurde davor ich gefocussed, statt Gragas. \n\nIch kann jetzt nicht sagen dass das NUR Gragas' Schuld war. Ich bin ja trotzdem rein. \nHätte ich auf mein Gewissen gehört, hätt ich mich einfach back geported und dann wäre er vielleicht umgedreht und hätte nicht gekämpft. \n\nNatürlich wurde ICH danach dann gepingt. Natürlich hat er nicht sich selbst gepingt, obwohl er wusste, dass ich das sehr wahrscheinlich nicht überleben werde. Leute halten sich einfach für super und alle anderen für superblöd. Darum hacken sie auch natürlich zuerst auf denen rum, die ihnen dümmer vorkommen als sie selbst. Was ich dabei lernen muss ist zu denken: \"Nö. Ich bin mir nicht 100% sicher, dass ich das schaffe, also tu ich es auch nicht\". \n\nDamit musst du dich abfinden lernen. Neue Runde, neues Glück.","replies":[{"poster":"ITroll4Fun","date":"2019-09-16T13:11:22.459+0000","up_votes":1,"down_votes":1,"body":"\"Neue Runde, neues Glück\". \n\nDas ist der springende Punkt. Riot streitet das ja ab, dass das Matchmaking fast wie ein reiner Zufallexperiement abläuft. Sie haben ja MMR, was kompliziert berechnet wird, weshalb es keiner wissen darf und man es geheim halten muss. Aber im Prinzip ist es Glück was entscheidet, ob du gewinnst oder verlierst. Das ist doch nicht der Sinn eines MOBA, dass der RNG entscheidet. Will ich RNG gehe ich Black Desert oder ähnliche Spiele spielen.\n\nRiot muss doch es sehen, dass das Matchmakingsystem eine Anpassung braucht. Seit der Season 7 ist das System richtig schlecht und es wird nicht besser. Die Einführung der Eisenelo und Verkürzung auf 4 Divisionen hat das bereits schlechte MMS weiter verschlechtert.","replies":[{"poster":"Angel Ayume","date":"2019-09-16T13:42:55.002+0000","up_votes":3,"down_votes":0,"body":"Es wird lediglich per Zufall entschieden, welche Mitspieler und Gegner du ins Game bekommst. Diese werden aber aus demselben MMR Bereich gewählt. Das ist reiner Zufall ja. \nAber nicht, wer gewinnt oder verliert. \nSonst wären Challenger ja vom Glück gesegnet und Iron Spieler vom Pech verfolgt xD","replies":[{"poster":"ITroll4Fun","date":"2019-09-16T17:51:54.655+0000","up_votes":1,"down_votes":1,"body":"Hatte gerade Probleme zu connecten, also dachte ich mein Team wird remaken. Aber nein, nach 30 Minuten komme ich ins Spiel und sehe, dass die Gegner auf den Sack bekommen. Wie verdammt kann es sein, dass diese Spieler aus demselben MMR-bereich sind. Wie riesig sind die Intervallgrenzen, von -5000 bis 5000 oder was? \n\nDas Traurige ist halt, dass das keine Ausnahme ist, sondern die Regel momentan. Was genau ist diese \"MMR\" und wie misst man diese. Dazu ein Zitat eines Supportmitarbeiters: \"Die MMR hängt im übrigen nicht vom Skill, Verhalten oder Rang ab\". Und du willst sagen, dass es kein Zufall ist, ob man gewinnt oder verliert? Wenn man schon so random gematched wird.","replies":[{"poster":"eingew","date":"2019-09-17T03:46:40.491+0000","up_votes":3,"down_votes":2,"body":"Das ist ja gerade die Ironie am Remake. Von allen Spielen mit Leavern ist ein solches, bei dem ein Spieler von Beginn an AFK war noch am ehesten zu gewinnen, weil dadurch keine XP an einen Spieler verschwendet werden, der später weg ist. Ein 4v5 bei dem man von Anfang an zu viert kämpft führt eben dazu, dass man einen Levelvorteil im eigenen Team hat, wodurch der Kampf gegen fünf relativ erträglich wird.\n\nDazu muss man auch nicht gegen deutlich unterlegene Gegner spielen. Es reicht völlig, wenn man sich mal etwas mehr anstrengt als sonst und ein paar Fehler weniger macht, während der Gegner eben genau das nicht tut. Dann ist das durchaus möglich. \n\nAbgesehen davon... sagt, dass dein Team das 4v5 besser gespielt hat, als viele 5v5s bei dir ausgehen mehr über die Teamzusammenstellung oder über den Erfolg deiner Taktik?\n\nUnd rede mal weniger von Dingen die du nicht verstehst. Informier dich zur MMR, dann kannst du dich darüber echauffieren. Aber aktuell haben deine Argumente das klare Problem, dass es ihnen an Realitätsbezug fehlt. Aber da du wenigstens noch die Ehrlichkeit besitzt, zuzugeben, dass du keine Ahnung hast, bitte, ich erleichtere dir das suchen. Wir haben ein komplettes Unterforum, welches sich dem Thema Matchmaking widmet, dort findest [diesen Thread](https://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele) gepinnt. Seither hat sich das ein oder andere verändert, die Grundstruktur ist aber nach wie vor gleich. Wenn du den gelesen (und verstanden!) hast, darfst du dich gerne wieder über das MM aufregen.","replies":[{"poster":"ITroll4Fun","date":"2019-09-17T18:41:45.566+0000","up_votes":1,"down_votes":1,"body":"Nein, die Gegner waren einfach schlecht und eindeutig nicht auf dem Niveau meiner Teammates. Man muss sich da nichts ausdenken, so einfach ist es.\n\nBin gespannt, ob dort steht wie genau diese existierende und reale Zahl, die man MMR nennt, berechnet wird. Man gewinnt und bekommt + Elo, wenn man verliert bekommt man - Elo. Danke, jetzt verstehe ich es endlich wie man die MMR berechnet und wieso ich mit diesen Spielern gematched werde. Man bin ich ein Dümmerchen, danke dir und dem Eintrag für die Erleuchtung.\n\nIch habe den Eindruck, dass man sagen will, dass LP und MMR/ELO das Gleiche sind. Da du dich anscheinend damit auskennst und entscheiden darfst, ob ich darüber reden darf bzw. kann, stimmt das?\nDes Weiteren hat laut dem dude ein einzelner Spieler mehr Einfluss auf sein MMR als die Teammates. Aber wie kann es sein, wenn man als Einzelner kein/ kleineren Impact auf das Spielresultat hat als das gesamte Team. Kläre mich bitte auf Senpai und sage bitte nicht, dass ich einfach unlucky bin, wenn ich \"schlechte\" Mates zugelost bekomme, denn es ist ja alles gut berechnet worden + Elo da,-Elo dort usw.","replies":[{"poster":"eingew","date":"2019-09-18T04:09:56.230+0000","up_votes":2,"down_votes":1,"body":"Wozu schreibst du überhaupt eine Antwort, wenn du dich weigerst die meine zu lesen? Ja, der Thread ist lang, ich verstehe, dass man nicht immer die Zeit dazu hat, das zu lesen. Aber die MMR ist nun mal ein bedeutend komplexeres Thema als dass man ein Spiel mit \"das Team war halt besser\" zusammenfassen kann.","replies":[{"poster":"ITroll4Fun","date":"2019-09-18T13:01:28.821+0000","up_votes":1,"down_votes":2,"body":"Ich habe es gelesen. Beantworte meine Fragen bitte, wenn du in dem Bereich mir überlegen bist und denkst, dass du entscheiden darfst, über was ich schreiben kann oder nicht. Die Fragen sind doch für dich leicht zu beantworten? \n\nIch sehe da garnichs, wo es erklärt wird wie und warum die Leute gematched werden. Und was ich dort sehe, stimmt eindeutig nicht mehr.","replies":[{"poster":"Haudruppmoor","date":"2019-09-18T13:17:41.642+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RitoFkedUp,realm=EUW,application-id=KYnfKGf0,discussion-id=qGXtcoyP,comment-id=0001000000000000000000000000000000000000,timestamp=2019-09-18T13:01:28.821+0000)\n>\n> Ich habe es gelesen. \n\nNein , hast Du nicht. Sonst würdest Du so nicht antworten.\n\n>Beantworte meine Fragen bitte, wenn du in dem Bereich mir überlegen bist und denkst, dass du entscheiden darfst, über was ich schreiben kann oder nicht. Die Fragen sind doch für dich leicht zu beantworten? \n\nEine Antwort darauf kann es gar nicht geben !\n\n>dass du entscheiden darfst, über was ich schreiben kann oder nicht.\n\nHat er gar nicht, er hat Dich darauf hingewiesen, wo Du relevante Informationen zu dem Thema finden kannst. Diese solltest Du erstmal lesen UND verstehen. Anonsten ist jegliche Diskussion darüber mit Dir \"Perlen vor die Säue\" , weil Du schlichtweg NICHT auf dem Niveau bist !\n\nDu hast seine sachliche Antwort komplett falsch und als ein Angriff auf Dein Ego interpretiert !\n\n{{sticker:slayer-jinx-unamused}}\n\nSo langsam ist's man leid Deine unsinnigen Ansichten zu diskutieren. Da gab es nicht eine brauchbare Basis von Deiner Seite aus. Das ist iwie schon schlimmer als mit Stichsäge {{sticker:sg-ahri-1}} \n\nWenn's Dich so juckt, dann spiel halt den Nubracschisstemo aber beschwer Dich nicht über Reaktionen deren Auftreten so ziemlich jeder hier Dir hinreichend erklärt hat. Geh und spiel, mach doch . Wenn Du's net ertragen kannst, dann spiel halt nicht, aber hör doch auf hier zu trollen.\n\np.s.\n Die Grundlage von allem ist das hier https://de.wikipedia.org/wiki/Elo-Zahl .","replies":[{"poster":"ITroll4Fun","date":"2019-09-18T14:42:08.393+0000","up_votes":1,"down_votes":1,"body":"> Und rede mal weniger von Dingen die du nicht verstehst. Informier dich zur MMR, dann kannst du dich darüber echauffieren. \n\nJa hat er nicht. Wie gesagt, groß auf den schlausten machen und dann es gibt keine Antwort. Seems legit, richtig Theoretiker. Was ist an dem Satz sachlich und objektiv?\n\nIch sags wie ich es verstanden/interpretiert habe. Die Erläuterung aus dem Beitrag da. Erstens mischen sie LP und MMR und ELO alles durcheinander, oder empfindeste da anders? Meiner Meinung nach ist es falsch LP und die anderen beiden Begriffe als fking Synonyme zu verwenden. \n\nZweites, wird gesagt, dass durch das MMR der äußere Einfluss (die andere 4 Mitspieler) wegfallen, da man als einzige Konstante ist. Also im Prinzip nach keine Ahnung 1000 Spielen müssen alle Spieler in dem Spiele auf dem gleich \"Skilllevel\" sein, aber das ist halt nicht so im realen Geschehen. \n\nBTW Hatte ein Spiel, wo ich das Gefühl hatte, dass alle auf demselben Niveau waren. Das war, aber eine Ausnahme. Und wie du sicherlich weißt, beweisen die Ausnahmen die Regel. Ich bin ja nicht der einzige, der wegen MM rumheult. Expros, Pros und HighElo heult doch auch rum, weil das MM ein coinflip geworden ist.\n\nWenn dir das gefällt, schön. Mir nicht,  weshalb ich es auch äußere. Wie sonst soll Riot was verändern, wenn keiner was sagt?","replies":[{"poster":"Haudruppmoor","date":"2019-09-18T15:00:13.099+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RitoFkedUp,realm=EUW,application-id=KYnfKGf0,discussion-id=qGXtcoyP,comment-id=000100000000000000000000000000000000000000000000,timestamp=2019-09-18T14:42:08.393+0000)\n>\n> Ja hat er nicht. Wie gesagt, groß auf den schlausten machen und dann es gibt keine Antwort. Seems legit, richtig Theoretiker. Was ist an dem Satz sachlich und objektiv?\n\nDeine vorigen Aussagen zu dem Thema MMR/Elo waren falsch und iwie zusammengereimt auf eigenen persönl. Empfindungen. Das war Deine Diskussionsgrundlage. Mit sowas kann man nunmal schlichtweg nicht arbeiten.\n\n> \n> Ich sags wie ich es verstanden/interpretiert habe. Die Erläuterung aus dem Beitrag da. Erstens mischen sie LP und MMR und ELO alles durcheinander, oder empfindeste da anders? Meiner Meinung nach ist es falsch LP und die anderen beiden Begriffe als fking Synonyme zu verwenden. \n\nNein. Der Link zur Wickipedia zeigt es, in Grundzügen ist das ganze System mathematisch nachzuvollziehen. Da gibt es nunmal keinen Interpretationsspielraum. Wenn Du das verstanden hast, kannst Du mit den Erkenntnissen den Thread über das mmr hier im Forum durchackern.\n\n> \n> Zweites, wird gesagt, dass durch das MMR der äußere Einfluss (die andere 4 Mitspieler) wegfallen, da man als einzige Konstante ist. Also im Prinzip nach keine Ahnung 1000 Spielen müssen alle Spieler in dem Spiele auf dem gleich \"Skilllevel\" sein, aber das ist halt nicht so im realen Geschehen. \n\nSag ich ja, hast nicht verstanden.\n\n> \n> BTW Hatte ein Spiel, wo ich das Gefühl hatte, dass alle auf demselben Niveau waren. Das war, aber eine Ausnahme. Und wie du sicherlich weißt, beweisen die Ausnahmen die Regel. Ich bin ja nicht der einzige, der wegen MM rumheult. Expros, Pros und HighElo heult doch auch rum, weil das MM ein coinflip geworden ist.\n> \n> Wenn dir das gefällt, schön. Mir nicht,  weshalb ich es auch äußere. Wie sonst soll Riot was verändern, wenn keiner was sagt?\n\nGefühl, Interpretation, Empfindung ... genau das ist es doch, Du gehst permanent von Dir aus und betrachtest es nicht sachlich. Was Du empfindest ist doch für den Diskussionspartner zu dem Thema irrelevant, weil Du keine Fakten vorlegst .\n\nUnd wenn Du mal querliest , durch Deine Threads, und Zustimmung und Ablehnung gegenüberstellst, was bleibt da übrig ? Wenn Du unzufrieden bist, daß Du Dein Teemo nicht kommentarlos spielen kannst, warum sollte RIOT da etwas unternehmen ? Und komm jetzt nicht mit Meta. Das man abseits jeder Meta spielen kann wurde Dir schon hinreichend dargelegt. Aber man kann eben nicht abseits vom Team spielen, so begreif das doch endlich. Dann mach Dir reine Botspiele, da brauchste auf deine Mates keine Rücksicht zu nehmen. \n\nNubrac : Forever alone !\n\n---\n\nedit :\nUnd wenn Du Hilfe brauchst, weil Du es eben nicht verstanden hast, dann sag das doch, aber stelle keine Mutmaßungen an, wie es sein könnte. Ich denke mal, das war auch noch ein Hinweis in seiner Antwort.\nDu kannst auch einfach hier bei einigen Leute nachfragen. Ich denke mal, der Link von @eingew wäre da ein guter Anlaufpunkt.\n\nedit2:\nKritik ist erstmal immer Subjektiv. Du sprichst an, was Dich stört. Dagegen ist nix einzuwenden. Aber spätestens bei der Argumentation sollten sachliche Kenntnisse angeführt werden und das Persönliche in den Hintergrund treten, sonst kann Dein Gegenüber doch überhaupt nicht drauf reagieren. \n1:\"Ich fühle es sind 25 Grad\" \n2:\"Aber der Wetterbericht sagte doch es sind 20 Grad\"\n1:\"Nein, mein Gefühl sagt das es 25 Grad sind\"\n2: \"Ja , aber das Thermometer zeigt doch 20 Grad an\"\n1:\"Kann nicht sein, ich fühle doch die 25 Grad - der Celsius sollte das mal ändern !\"\n2: _PENG_","replies":[{"poster":"Haudruppmoor","date":"2019-09-19T13:13:59.070+0000","up_votes":1,"down_votes":0,"body":"Oh mann, Du hast echt nicht mehr ... ach was solls. Das Temperaturbeispiel war ein Beispiel für DEINE Argumentationsweise und hatte mit mmr nix zu tun. Genau das ist es ! {{sticker:zombie-brand-facepalm}} {{sticker:zombie-brand-facepalm}} {{sticker:zombie-brand-facepalm}} \n\nVergiss es einfach. Hab ich schonmal gesagt/geschrieben, mach Dein Ding, aber hör einfach auf hier rumzuspammen wegen der darauffolgenden Reaktionen.\n\n~~Und wo hast Du denn nachgefrgt ?~~ vergiss es, interessiert mich nicht .\n\nUm auf den Threadtitel zurückzukommen :\n\nOb \"Diese Reaktion normal in League ?\" ist , ja, diese Reaktion ist auf DICH normal . Kannst beruhigt sein {{sticker:slayer-jinx-unamused}} ","replies":[]},{"poster":"ITroll4Fun","date":"2019-09-19T12:55:45.552+0000","up_votes":1,"down_votes":0,"body":"Habe ich doch nachgefragt? Leider kommt keine Antwort. Warum? Weil keine Sau es weiß was und wie MMR berechnet wird. Dieses - und + LP das ist doch nicht die ganze Berechnung dieser Zahl?\n\nDu vergleichst doch nicht wirklich Temperatur und MMR, das ist ja dasselbe wenn man IQ und Masse vergleichen würde. Als Beispiel die Ausnutzung der IQ-Berechnung. Die Leute versuchten es so darzustellen, dass Frauen und anderen \"Rassen\" kleineren IQ hätten. Deshalb keine Ahnung wozu du die Naturwissenschaft reinzieht. Wie gesagt ist MMR ähnlich zur IQ und zweitens Mathematik ist keine Naturwissenschaft. PENG PENG. Hast du das nicht gelernt, dass man Birnen und Äpfel nicht vergleichen darf.\n\n\"nur Sieg oder Niederlage zählt und wer der Gegner ist. Zweiteres ist aber zu vernachlässigen, weil das Matchmaking nur Spieler gleicher Stärke in ein Spiel steckt.\"\n\nWo hast das gesehen, dass die Leute mit gleicher Spielstärke gematched werden? In den letzten 50 Spielen hatte ich nur ein Spiel, wo es ausgeglichen war, andere waren stomps. \n\nAlso wie wird gematched, da  diese Aussage auf mich nicht zutrifft. Jetzt kommt natürlich, ja du musst aber mehr Spiele machen etc. wie viel 10000? Das ist die  Inferenzstatistik und man bekommt keine ausreichende Stichprobe als Einzelner. Du kannst deine Argumentation in der Praxis in die Tonne schmeißen. Dass es \"theoretisch\" geht ist mir klar, praktisch ist ein Fail. \n\nZur Kritik:\n\nRiot hatte das mit den Skins und Lootboxen sehr gut gemacht, aber andererseits ist das Matchmakng und Balancing nicht so gut, da es nicht gut genug ausbalanciert ist (zufrieden?).\n\nIch verpiss mich lieber aus  5v5 League, sonst kommt echt der Perma.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"HyperionCH","date":"2019-09-16T13:39:12.941+0000","up_votes":2,"down_votes":0,"body":"Du spielst ja offenbar öfters Teemo-Sup. Dann müsstest du ja am besten wissen, ob dies normal ist oder nicht.\n\nVorweg mein Tipp:\nNicht antworten auf Flame. Das bringt nichts.\nDu brauchst dich für deinen Pick nicht zu rechtfertigen. \n\nGestern in FlexQ spielte eine Ashe-Sup (aber ohne Gold-Item!), nachdem der Gegner den Main (Yuumi) wegpickte. \nVon unserem Team hat niemand etwas gesagt (wahrscheinlich auch, weil es Premade Bot war). Jeder spielte einfach sein Game und versuchte, seine Aufgabe im Game zu erfüllen. Nur ein Gegner fragte im All-Chat, ob \"Double-ADC\" gespielt wird. :D\n\nWichtig ist nur, dass man in der CS klar kommuniziert, was man spielt.\nIch hatte vor einiger Zeit ein Game, da pickte der Sup einfach Varus. Ich wusste nicht, ob er vielleicht autofilled war und dies nicht bemerkte. Leider bekam ich keine Antwort von ihm mit Absprache der anderen Mates pickte ich Ashe, da man mit ihr gut \"ADC\" und Sup spielen kann (je nachdem, was Varus dann wirklich spielt).\nVarus war dann wirklich Sup, aber kam erst knapp bevor die Camps spawnen. Da hatte ich bereits mein Gold-Item, da ich dem Jungler beim Buff helfen wollte. Die Lane haben wir hart verloren; leider durch die fehlende Kommunikation des Sups (wir haben aber am Ende das Game gewonnen).","replies":[{"poster":"ITroll4Fun","date":"2019-09-16T18:01:56.755+0000","up_votes":1,"down_votes":3,"body":"Ein Einzelner bestimmt doch nicht die Norm, also kann ich es nicht sagen, ob der Pick \"normal\" ist und vor allem ist die \"Normalität\" subjektiv as hell, was an sich fast ein Widerspruch ist. Aber die Reaktionen sind eher 60% negativ und 40% (positiv bzw. neutral). Ich bin mit dem Pick nach Platin gekommen, obwohl ich negative WR habe (45%). Also muss es nicht so schlecht sein wie die meisten Spieler denken.\n\nMir ist bekannt, dass man auf Flame nicht antworten soll (jegliche Bans/Crs), weshalb ich jetzt komplett ohne Chat spiele. Leider kann man momentan nur den ingame Chat ausmachen.\n\nIch kommuniziere nur dann, wenn ich die Nubractactic spielen möchte, ansonsten nur Prepick und sarkastische Bezeichnung der Spieler, die den Pick bannen als Coach.","replies":[]}]},{"poster":"SayaShire","date":"2019-09-14T16:25:44.701+0000","up_votes":3,"down_votes":2,"body":"Also wenn ich suppe und es ist was, was ich gern testen würde, schreibe ich: \"I would like to test something\". \nSo kann jeder dodgen der das nicht will. Wenn jemand sagt \"That wont work, what you wanna try\", dann frage ich wieso. \nWenn mir der Mensch nett vorkommt, füge ich mich und suche mir was aus, was sinnvoller für ihn ist. Wenn es nur im Flame ausartet, gehe ich was ich will und mute die Leute. Immerhin sind es Normals und da sollte man schon was testen dürfen. Und wenn es ihm nicht wichtig genug ist zu dodgen, ist es mir nicht wchtig genug, mich zu fügen.","replies":[]}]}