{"poster":"Stylè","date":"2015-02-09T18:24:35.738+0000","title":"Reportsystem","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":5,"body":"Sehr geehrte Community,\r\n\r\nich habe eine Frage, bei welcher ich mich auf das Reportsystem beziehe. Ist dies fair gemacht, dass jeder jeden melden kann, ein Bot nach 2 oder 3 Meldungen bei einem Spieler sagt, dass man eine Strafe bekommt?\r\nMeine Wenigkeit z.B. schreibt nichts in den Chat außer Calls und Informationen, in keinster Weise anzüglich oder beleidigend, bekommt jedoch Warnungen bis hin zu Chatbanns, welche mir nicht mehr erlauben Informationen zu schreiben. Meistens ist es Negative Einstellung... Liegt es daran, dass ich am ende kein \"GG Wp\" schreibe oder am Anfang \"Gl HF\"? Dazu sei gesagt, dass ich natürlich auch nichts provozierender sage.\r\n\r\nNun, gibt es eine Möglichkeit dies zu ändern, dass nicht jeder einen Reporten kann oder diese Reports erst einmal gecheckt werden?\r\nDesweiteren würde ich gerne wissen worum es sich bei Negative Einstellung handelt und wann man diesen Grund auswählen kann.\r\nDieser Thread soll keinster Weise als Thread verstanden werde, in welchem ich mich \"ausheule\" , sondern dient nur als Fragestellung sachlich korrekter Themen.\r\n\r\n\r\nLG Exception","replies":[{"poster":"PROJECT Penta","date":"2015-02-09T19:12:15.438+0000","up_votes":1,"down_votes":8,"body":"Ich verstehe dein Problem, das habe ich selber auch, ich habe einfach keine Möglichkeit Informationen zu tauschen, nur weil sie meinen mich aus Spaß Reporten zu müssen...","replies":[{"poster":"eingew","date":"2015-02-09T19:14:21.002+0000","up_votes":1,"down_votes":2,"body":"Im Post steht kein Problem, nur eine Frage 0.o Und wenn dein Problem ist, dass du nicht weißt, ob und wie das System funktioniert, dann musst du dir nur die Antworten durchlesen...\n\nIch verstehe nicht, wieso man keine Informationen tauschen kann, wenn man reported wurde.","replies":[{"poster":"PROJECT Penta","date":"2015-02-09T19:22:29.226+0000","up_votes":1,"down_votes":4,"body":"Weil ich Chat Sperre dadurch gekriegt habe, und als ob ich (am HANDY!) JEDEN post durchlese, das dauert viel zu lange","replies":[{"poster":"eingew","date":"2015-02-09T19:26:26.656+0000","up_votes":2,"down_votes":1,"body":"Wieso beteiligst du dich an einer Diskussion, wenn du das eigentlich gar nicht willst? Die Meinung anderer anzuhören und nicht zu spammen, indem man nichts redundantes postet gehört nunmal dazu.","replies":[{"poster":"PROJECT Penta","date":"2015-02-09T19:31:35.284+0000","up_votes":2,"down_votes":2,"body":"Wie bitte kannst du das mal genauer erklären, ich habe dich kognitiv nicht verstanden weil du zu viele Fachbegriffe verwendet hast?","replies":[{"poster":"eingew","date":"2015-02-09T19:35:06.247+0000","up_votes":1,"down_votes":1,"body":"Ich habe exakt einen Begriff verwendet, den du möglicherweise nicht verstanden hast. Deshalb rate ich:\n\n[Google!](http://lmgtfy.com/?q=redundant)","replies":[{"poster":"PROJECT Penta","date":"2015-02-09T19:44:17.858+0000","up_votes":1,"down_votes":0,"body":"Naja den ersten Satz verstehe ich vom Sinn nicht, und außerdem fühle ich mich benachteiligt, wenn ich nicht einfach meine Meinung sagen darf, ohne das gleich irgendwer was dagegen sagt, dass ich was dazu sage, nichts gegen dich.","replies":[{"poster":"Humpelstilzche","date":"2015-02-09T19:54:12.918+0000","up_votes":1,"down_votes":1,"body":"So läuft das in Diskussionen halt: Jemand sagt was, jemand anderes sagt was dagegen. Wenn du das nicht magst, bist du in einem Forum (deren Zweck die Diskussion ist) eindeutig falsch. Wenn dir niemand widersprechen soll, empfiehlt sich beispielsweise ein Tagebuch.","replies":[{"poster":"PROJECT Penta","date":"2015-02-09T19:57:26.337+0000","up_votes":2,"down_votes":0,"body":"Ich habe ja extra NICHT geschrieben, das ich nicht mag das andere was gegen meine Meinung sagen, sondern das andere sagen das ich \"den Mund halten soll\"","replies":[]}]},{"poster":"eingew","date":"2015-02-09T19:46:28.472+0000","up_votes":1,"down_votes":1,"body":"Ich meine damit, dass die Teile, die du als negativ erachtest und deshalb nicht tust (also zum Beispiel das durchlesen von den anderen Meinungen), zur Diskussion gehören.","replies":[]}]}]}]}]},{"poster":"Humpelstilzche","date":"2015-02-09T19:23:39.068+0000","up_votes":2,"down_votes":1,"body":"So Leid es mir tut, aber das stimmt nicht. Du hast deine Chatsperre wegen deines Verhaltens erhalten. Unbegründete Reportst KÖNNEN keine CR auslösen.","replies":[{"poster":"PROJECT Penta","date":"2015-02-09T19:27:34.820+0000","up_votes":1,"down_votes":2,"body":"Selbst wenn, ist es dann der Sinn das man durch die CR (fast) jedes Spiel verliert, weil ich keine Information teilen kann? Und jetzt sag nicht man verliert keine Spiele weil man keine Informationen teilen kann, und jetzt zitiere das nicht und schriebe doch doch drunter...","replies":[{"poster":"eingew","date":"2015-02-09T19:33:01.911+0000","up_votes":1,"down_votes":2,"body":"Das Ping System reicht laut Riot vollkommen aus, um zu kommunizieren.\n\nUnd ich kenne keine Person, die so abhängig von Chatnachrichten ist, dass sie deshalb Spiele verliert 0.o","replies":[{"poster":"PROJECT Penta","date":"2015-02-09T19:59:52.734+0000","up_votes":1,"down_votes":0,"body":"Hast du jemals mit mir gespielt, wie könnt ihr das behaupten? In meinen spielen ist es nunmal so, oder wenn z.b. Ich als Mid laner den Jungler Fragen Will, ob ich den nächsten Blue haben kann, wie soll das gehen? Ich habe jedenfalls starke Nachteile und Einschränkung, oder wenn ich mal kurz anderen danken will, z.b. Wenn mein Thresh mich mit einer Laterne über eine Mauer rettet das geht alles nicht mehr.","replies":[{"poster":"eingew","date":"2015-02-09T20:21:16.582+0000","up_votes":2,"down_votes":1,"body":"Du hast 5 Chatnachrichten.\n\nSelbst Schuld, wenn du dich danebenbenimmst.\n\nNach dem Blue kann man auch mit PIngs fragen.","replies":[]}]}]},{"poster":"Humpelstilzche","date":"2015-02-09T19:31:52.206+0000","up_votes":2,"down_votes":1,"body":"Tatsächlich hat die CR einen positiven Einfluss auf die Winrate der entsprechenden Spieler, da die Art von Kommunikation die sie vorher am gewinnen gehindert hat unterdrückt wird. \n\nMal abgesehen davon ist es ja nicht so, dass du garnichts schreiben kannst. Die Nachrichten die zur Verfügung stehen sind bei Verwendung des Ping-Systems mehr als ausreichend für wichtige taktische Infos.\n\nedit: ich zitiere dich garnicht. Das liegt an deiner Wahl der Darstellung des Forums. Stell um auf \"Diskussions-Ansicht\"","replies":[{"poster":"PROJECT Penta","date":"2015-02-09T19:42:27.971+0000","up_votes":1,"down_votes":1,"body":"Es hätte ja sein können das du mich zitierst war nur so zur Vorsicht :P, aber bei Pings kann ich anderen ja nicht sagen, dass da ein Ward ist","replies":[]}]}]}]}]}]},{"poster":"Ragequit Account","date":"2015-02-09T19:15:18.965+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Panzer1119,realm=EUW,application-id=KYnfKGf0,discussion-id=cEop5boX,comment-id=0003,timestamp=2015-02-09T19:12:15.438+0000)\n>\n> Ich verstehe dein Problem, das habe ich selber auch, ich habe einfach keine Möglichkeit Informationen zu tauschen, nur weil sie meinen mich aus Spaß Reporten zu müssen...\n\nWürdest du einfach mal lesen, dann wüsstest du, dass Reports aus Spaß rein gar nichts bewirken, außer dass die Wertigkeit der Reports, des reportenden sinkt.","replies":[]}]},{"poster":"Ragequit Account","date":"2015-02-09T18:37:06.311+0000","up_votes":2,"down_votes":0,"body":"Wir haben deine Chatlogs nicht, also können wir auch keine Aussagen treffen.\n\nDu bekommst keine Restriction, weil du nichts schreibst. Vielleicht rufst du zu Reports auf oder iwas anderes. Aufjedenfall ist dein Chat nicht so sauber, wie du behauptest. Irgendwas muss das Skript ja gefunden haben.\nReports führen zu einer Überprüfung.\nWenn jemand einfach jeden reported, dann verlieren seine Reports an Gewichtung und haben irgendwann gar keine Auswirkung mehr.","replies":[{"poster":"PROJECT Penta","date":"2015-02-09T20:03:09.667+0000","up_votes":1,"down_votes":3,"body":"Wieso verlieren Reports an Bedeutung? Kann mir jemand dass sagen? Das ist vollkommen unfair! Weil es kann ja nicht sein das mein Report weniger wert ist, weil ich vorher (der Meinung des Tribunals nach) grundlos Leute reportet habe und die nächsten Reports \"weniger wert sind\" das Tribunal kann ja nicht sagen das ist grundlos, weil auch wenn einer nur einmal mich beleidigt fühle ich mich schon sehr beleidigt und gekränkt, das ist nunmal mein Empfinden.","replies":[{"poster":"Humpelstilzche","date":"2015-02-10T12:54:07.037+0000","up_votes":2,"down_votes":0,"body":"[Kennst du die Geschichte vom Hirtenjungen und dem Wolf?](http://de.wikipedia.org/wiki/Der_Hirtenjunge_und_der_Wolf)\n\nWer permanent beweist, dass seine Meldunge lediglich die Ressourcen der Spieler-Verhaltens-Systeme verschwenden und völlig grundlos reportet, dessen Urteil schenkt man eben nicht mehr viel Glauben. Ich denke das ist für jeden nachvollziehbar. Wenn er dann doch mal was reporten muss: Tja, Pech. Hätter er sich mal vorher überlegen sollen. \n\nOder wie meine Oma immer gesagt hat:\n\"Der Bschiss kommt auf den Tisch!\"","replies":[{"poster":"dat Zoidberg","date":"2015-02-10T13:42:14.725+0000","up_votes":1,"down_votes":0,"body":"Da das Tribunal (noch) inaktiv ist stellt sich die Frage, in welcher Form Reports überhaupt auf Korrektheit geprüft werden. Dazu müsste der Leaverbuster oder die Chatüberprüfung eine Rückmeldung an das Reportsystem geben, bzw. an den \"Reportrank\" jedes Spielers, der einen Report abgegeben hat. Halte ich für etwas fraglich.\n\nMeiner Spielerfahrung nach könnte ich in nahezu 50% aller Spiele jemanden zu Recht reporten. Inzwischen denke ich da 2mal drüber nach um nur die \"krassen\" Fälle zu reporten und mit der Vielzahl von Reports mein Report-Ranking nicht zu beeinträchtigen (in der Hoffnung, dass es in diesen schwierigen Fällen dann auch etwas bringt).\n\nDie Frage ist also: Werden Reports wirklich auf Korrektheit überprüft, und falls ja, auf welche Art und Weise?","replies":[{"poster":"Humpelstilzche","date":"2015-02-10T13:55:05.555+0000","up_votes":1,"down_votes":0,"body":"> Meiner Spielerfahrung nach könnte ich in nahezu 50% aller Spiele jemanden zu Recht reporten.\n\nJoa, das entspricht dann auch ziemlich genau der Anzahl der Leute die tatsächlich irgendwann eine Chatrestriction bekommen (5%). Insofern scheint dein Urteilsvermögen bezüglich Verhalten ziemlich genau dem Durchschnitt zu entsprechen. \n\n> Die Frage ist also: Werden Reports wirklich auf Korrektheit überprüft, und falls ja, auf welche Art und Weise?\n\nJa. Einerseits durch die Chatanalyse-Software, andrerseits durch statistische Methoden (wenn ein Spieler permanent von Leuten reportet wird die ausschließlich Leute reporten die anschließend auch bestraft wurden, darf man davon ausgehen dass der Spieler auch tatsächlich schuldig ist....ist natürlich jetzt nur vereinfacht dargestellt).","replies":[]}]}]}]}]},{"poster":"Humpelstilzche","date":"2015-02-09T18:42:40.450+0000","up_votes":3,"down_votes":1,"body":"> Ist dies fair gemacht, dass jeder jeden melden kann, ein Bot nach 2 oder 3 Meldungen bei einem Spieler sagt, dass man eine Strafe bekommt?\n\nDas wäre sicherlich unfair, wenn es denn so wäre...ist es aber nicht. Tatsächlich braucht man Unmengen (berechtigert) Reports von Spielern, die schon in der Vergangenheit zuverlässig reportet haben, um eine Strafe zu bekommen. \n\n> Nun, gibt es eine Möglichkeit dies zu ändern, dass nicht jeder einen Reporten kann oder diese Reports erst einmal gecheckt werden?\n\nEine solche Funktion existiert bereits. Jeder Spieler hat ein verstecktes Report-Rating. Wer die Report-Funktion missbraucht, verliert sein Rating, dessen Reports sind dann wenig bis garnichts mehr wert. Wer sehr zuverlässig reportet, hat einen höheren Wert. \nNur wenn man sehr viele Reports von Leuten mit hohem Rating bekommt, wird man für eine Strafe in Betracht gezogen. \nDazu kommt noch die Chatanalyse, die überprüft ob in deinem Chat tatsächlich etwas schlimmes enthalten war.","replies":[{"poster":"Stylè","date":"2015-02-09T18:46:20.809+0000","up_votes":1,"down_votes":1,"body":"Dies würde ja in gewisser Weise heißen, dass ich jeden und dies ist jedes Spiel mindestens ein mal für eine Beleiding: ****\nReporten müssten!","replies":[{"poster":"Humpelstilzche","date":"2015-02-09T18:50:54.541+0000","up_votes":2,"down_votes":1,"body":"Warum meinst du das tun zu müssen?","replies":[{"poster":"Stylè","date":"2015-02-09T18:57:53.606+0000","up_votes":1,"down_votes":0,"body":"Laut deiner Aussage, müsste man dies ja tun, meine Wenigkeit reportet nicht grundlos.","replies":[{"poster":"Stylè","date":"2015-02-09T19:04:50.061+0000","up_votes":1,"down_votes":0,"body":"Reportet jemand, jemanden, welcher z.B. ein Wort gesagt hat, welches \"gesternchend\" wurde, erhöht er sein Ranking (siehe deine Aussage), also würde es ja reichen, wenn dieser eine Spieler einen Reportet, welcher nichts getan hat oder nur eine Sache gesagt hat, welche \"gesternchend\" wurde. Also ist das System doch anzeifelnd.","replies":[{"poster":"eingew","date":"2015-02-09T19:07:24.074+0000","up_votes":1,"down_votes":0,"body":"Nein. Humpel hat das nicht ausreichend hervorgehoben, aber Reports führen keineswegs zu einer Strafe, sondern nur zu einer Überprüfung. Erst wenn diese positiv ausfällt, wird ein Spieler bestraft.","replies":[]},{"poster":"Humpelstilzche","date":"2015-02-09T19:13:24.593+0000","up_votes":1,"down_votes":1,"body":"Wenn jemand tatsächlich geflamed hat, darfst du ihn sehr gerne reporten, gerne auch mit dem Hintergedanken dein Report-Rating zu erhöhen. \nWenn du meinst Leute reporten zu müssen die nur ein zensiertes Wort (das kann man übrigens ausstellen) schreiben ohne andere Spieler anzugreifen, wird dir das nichts bringen. Dieser Spieler wird nicht bestraft werden und dein Report-Rating wird nicht steigen. Ich verstehe nicht ganz, wo du das aus meinen Post rausgelesen hat. Es geht hier um BERECHTIGTE Reports, nicht scheinbar berechtigte Reports. \n\nDesweiteren hab ich nirgendwo gesagt, dass ein einzelner berechtigter Report einem ein derartig hohes Rating verleiht, dass man direkt im Alleingang Leute bestrafen kann. Du bist nach wie vor nur einer. Selbst wenn du ein heraussragend zuverlässiger Reporter sein solltest, bist du nach wie vor allein. Um bestraft zu werden muss man, wie ich bereits erwähnte, eine ganze Menge berechtigter Reports bekommen.","replies":[]}]},{"poster":"eingew","date":"2015-02-09T19:04:15.146+0000","up_votes":1,"down_votes":0,"body":"Man muss nur sterben.\n\nUnd die Funktion ist dazu gedacht, dass du nur das reportest, was du selbst als Bestrafungswürdig erachtest.","replies":[]}]}]}]}]},{"poster":"Miscalculated","date":"2015-02-09T18:38:11.101+0000","up_votes":1,"down_votes":7,"body":"Hallo Exception,\n\nmeiner Meinung nach reporten viele Summoners grundlos bzw. reagieren über.\nAllerdings kann man, wenn man zu unschuld  bestraft wurde, den Support kontaktieren.\nDer Reportgrund \"Negative Einstellung\" sollte an Summoners gehen, die sich negativ Verhalten oder von Anfang an ein negative Einstellung haben (z. B. \"We're going to lost this anyway!\"). Der Grund sollte sich eigentlich von selbst klären.\nEs gab schon einige Beschwerden über das Reportsystem, allerdings wird Riot diesbezüglich nichts unternehmen (meiner Meinung nach).\nDesweitern ist es beinahe unmöglich jeden Report, wie du es nennst, zu checken, da es zu Zeitaufraubend ist alleine schon von der Anzahl der gespielten Spiele pro Tag.\nMein Tipp: Einfach nichts in den Chat schreiben, das nötigste kannst du auch Pingen bzw. halte dich kurz in Chats.\n\nMit freundlichen Grüßen\n\nxRekt by Jason\n\n[Dieser Beitrag sollte nicht geflamt werden oder schlecht gemacht werden,  falls ihr mit diesen Beitrag ein Problem haben solltet: Ignoriert ihn. Ebenso gebe ich wenig Achtung auf Rechtschreibung etc., solange es verständlich ist.]","replies":[{"poster":"Humpelstilzche","date":"2015-02-09T18:46:34.911+0000","up_votes":3,"down_votes":0,"body":"> Dieser Beitrag sollte nicht geflamt werden oder schlecht gemacht werden, falls ihr mit diesen Beitrag ein Problem haben solltet: Ignoriert ihn. Ebenso gebe ich wenig Achtung auf Rechtschreibung etc., solange es verständlich ist\n\nWie die Leute auf deinen Beitrag reagieren, musst du schon ihnen überlassen, das hast nicht du zu entscheiden. So könnte man durchaus an deinem Beitrag kritisieren, dass er einige wichtige Fakten vernachlässigt bzw Unwahrheiten verbreitet. Zu sagen dass es keine Möglichkeit gibt, die Reports zu checken, ist beispielsweise ebenso inkorrekt wie die Aussage, dass Riot nichts unternimmt (es wird TÄGLICH an den player behavior Systemen gearbeitet). \nInsofern muss ich leider deine Bitte, diesen Beitrag nicht schlecht zu machen, ignorieren und auf diese kleinen Fehler aufmerksam machen. Sorry dafür, aber das konnte ich so nicht stehen lassen.","replies":[]},{"poster":"Stylè","date":"2015-02-09T18:43:01.821+0000","up_votes":1,"down_votes":5,"body":"Gut das jemand meine Meinung teilt, genau dieser Ansicht wie du es beschreibst bin ich auch.\nNatürlich kann ich es nachvollziehen, dass Riot nicht ändern kann, aber danke für deine schnelle Antwort.\n\nLG Exception","replies":[{"poster":"Humpelstilzche","date":"2015-02-09T18:53:21.633+0000","up_votes":2,"down_votes":0,"body":"Es ist aber halt leider keine Meinungsfrage. Die Art und Weise wie du und Jason die Funktionsweise der Player-Behavior-Systeme schildern entspricht schlicht und einfach nicht der Realität. Da könnt ihr euch so viel gegenseitig zustimmen wie ihr wollt, das ändert nichts daran dass die Realität ganz anders aussieht.","replies":[]}]}]}]}