{"poster":"Stylè","date":"2015-11-28T22:48:32.172+0000","title":"Bot-Lane sucht Ranked-Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Servus Leute\n\nWir, Eximation und What, suchen als Botlane ein Team.\n\nEximation: http://www.lolking.net/summoner/euw/35450193\nWhat: http://www.lolking.net/summoner/euw/31736235\n\nWir beide sind aus dem hochgepriesenen Ranked-Team &quot;Trollers in Pyjamas&quot;, wie auch schon unser Team-Tag verraten hat.\nWir beide sind 17 und 16 Jahre alt, besuchen ein Gymnasium in der Oberstufe, bereiten uns gerade auf unser Abitur vor, was uns jedoch nicht davon abh&auml;lt in einem Ranked-Team aktiv mitzuspielen.\n\nSchon seit Season 2 Ende spielen wir beide gemeinsam aktiv League of Legends als Bot-Lane.\nSeit einiger Zeit sind wir beide wieder als Duo-Bot unterwegs und suchen ein Team, da sich nach knapp 2 Jahren unser Team aufgel&ouml;st hat. Wir haben mit diesem Team vieles Erreicht z.B. Sind wir es gewohnt gegen Platin-Master zu spielen und k&ouml;nnen dies auch einiger Ma&szlig;en h&auml;ndeln.\nZudem haben wir als Team viele Turniere bestritten, mehrere Preise gewonnen und nahezu die Platin Elo im Teamranked erreicht.\n\nWir beide sind ruhige Zeitgenossen, am Tryharden, wenns darauf ankommt, verstehen aber auch gut Spa&szlig;.\n\nFalls wir nun euer Interesse geweckt haben, addet mich oder antwortet unter diesem Thread.\nWeiteres k&ouml;nnte man dann im Ts3 oder notfalls auch auf Skype kl&auml;ren.\n\nLiebe Gr&uuml;&szlig;e \n\nWhat &amp; Eximation","replies":[{"poster":"Stylè","date":"2015-11-30T15:21:33.307+0000","up_votes":1,"down_votes":0,"body":"push","replies":[]},{"poster":"neXfaqq","date":"2015-11-29T13:16:54.934+0000","up_votes":1,"down_votes":0,"body":"Hey, ich adde nahher mal einen von euch, können dann mal ne runde labern und ein bisschen spielen :) seid mir exht sympatisch !","replies":[{"poster":"Stylè","date":"2015-11-29T13:44:31.204+0000","up_votes":1,"down_votes":0,"body":"ok","replies":[]}]},{"poster":"mosewhat","date":"2015-11-29T13:11:38.265+0000","up_votes":1,"down_votes":0,"body":"push","replies":[]}]}