{"poster":"Stylè","date":"2016-09-25T17:38:03.985+0000","title":"[3vs3] Team sucht Mitstreiter[~Platin/16-19]","subforum":"Clans & Teams","up_votes":3,"down_votes":1,"body":"Sehr geehrte Community,\r\n\r\nwir sind aktuell 5 feste Member in einem kleinen 3vs3 Projekt. Unser Ziel ist es Master+ in 3vs3 zu schaffen.\r\nDazu wollen wir einen Club mit X-Leuten aufbauen, welche alle im Platin+ in der Solo Q sind und sich untereinander gut verstehen. \r\n______________________________________________________________________________________\r\n\r\n**Unser Team besteht aus:**\r\n\r\nBoosted Head Platin V\r\nImcoca  Diamond V\r\nPandas R Fluffy Diamond V\r\n69 McD&ouml;rty Platin II\r\nEYE Tez Platin I\r\n\r\n\r\n\r\nLeader/Organisator: Boosted Head\r\n\r\n\r\n______________________________________________________________________________________\r\n\r\n\r\n**Ziele:**\r\n\r\nMaster+ Wertung am Season Ende 6\r\n\r\n______________________________________________________________________________________\r\n\r\n**Nun zu den Vorraussetzungen, denen du gewappnet sein musst:**\r\n\r\n* **Elo Platin+**\r\n* **Alter 16-19**\r\n* Nett\r\n* Kein Rager\r\n* TS \r\n* Headset/Mikro/Kopfh&ouml;rer .... Kein Hall\r\n* 3vs3 Erfahrung\r\n\r\n\r\n\r\nLG Boosted Head","replies":[{"poster":"Saphane","date":"2016-10-18T21:25:10.189+0000","up_votes":1,"down_votes":0,"body":"Hätte mega Bock darauf, also bei Interesse adden.","replies":[]},{"poster":"Zedstroyed","date":"2016-10-01T16:30:48.063+0000","up_votes":1,"down_votes":0,"body":"Ich fühle mich ja nicht so geehrt von dir, ich performe ein Game schlecht und schwupp die Wupp ist man aus dem Team geworfen, aus dem Club gekickt und permanent vom TS gebannt mit dem Grund \"See Why At Sign\"(Sollte das lustig wirken?, wars für dich bestimmt auch, aber denk mal drüber nach wärst du in meiner Lage, außerdem sollten meiner Meinung nach alle NB3 Fans sowieso LoL quitten oder mindestens den Server wechseln). Zeigt auf jeden Fall wie viel Eier du hast,kannst du nicht einfach mit mir reden? Ich verstehe so etwas nicht. Vorallem hast du nicht ein Wort darüber verloren, geschweige denn irgendwas über mich gesagt, was ich besser machen könnte oder was der Fehler sei, meine Perfomance war keine Glanzleistung in dem Spiel, deine auch nicht, aber sowas ist schon schwach von dir. Was denkst du denn was passiert wenn du einfach mit mir redest? Manche Menschen verstehen das wenn man mit ihnen redet, aber einfach nur Rausschmiss, kick und Bann, das ist eher die Pussy variante. Und du willst der Leader eines Teams sein was sich gut verstehen Soll, Bitte? Wenn ihr nicht auch so behandelt werden wollt sucht euch was anderes oder macht was eigenes, denn der Anführer ist das Allerletzte.","replies":[]},{"poster":"RekSaiii","date":"2016-09-25T18:16:18.547+0000","up_votes":1,"down_votes":0,"body":"wäre dabei :) add graves rekt u oder ahriboo","replies":[]}]}