{"poster":"Clausius","date":"2019-08-16T20:43:11.928+0000","title":"League of legends en Windows 7","subforum":"Problemas Técnicos","up_votes":5,"down_votes":0,"body":"Abro esta discucion para contar mi experiencia usando windows 7 64 bits, mi PC es una AMD A10-7850K con 8G de RAM y una Shappire Radeon R7 350, ultimamente tenia bajos fps unos 50-60, hasta incluso bajaba a 30. Esto nunca me habia pasado anteriormente siempre tenia unos 100 para arriba y la verdad que lo sentia mucho, como ya dieron de baja el soporte de windows 7 crei que podria a llegar a ser este el problema. Ayer me decidi a cambiar mi SO por el windows 10 y hoy probe una ARAM, resulto ser que lo que yo creia era cierto, volvieron los 100fps para arriba y el juego corrio lo mas bien. Por eso aliento a todo aquel que sigue jugando en windows 7 a que cambie a windows 10 si quiere seguir jugando decentemente al LOL.","replies":[{"poster":"Fízz","date":"2019-08-16T20:46:12.929+0000","up_votes":3,"down_votes":0,"body":"nose bro yo tengo windows 7 y me corre perfectamente a 80-120 fps en resolucion medio -alta (mi pc tiene 11 años)","replies":[]},{"poster":"RSSPLOTER","date":"2019-08-16T21:28:49.014+0000","up_votes":2,"down_votes":0,"body":"Presiento que tal vez era un asunto de los drivers de video, ya eh visto que puede pasar eso con las GPU radeon.","replies":[]},{"poster":"VenganceZ","date":"2019-08-16T20:50:04.443+0000","up_votes":2,"down_votes":0,"body":"A mí me pasó lo mismo y da miedo porque tengo las mismas especificaciones, igual no me voy a cambiar a w10 no me conviene","replies":[]},{"poster":"AltoGatoPro","date":"2019-08-27T18:06:14.938+0000","up_votes":1,"down_votes":0,"body":"Donde descargaste el Win10?","replies":[]},{"poster":"Errør 404","date":"2019-08-17T02:04:30.730+0000","up_votes":1,"down_votes":0,"body":"A mi me pasó exactamente lo mismo en una notebook un tanto vieja. Ahí el juego funcionaba a 30fps, pero ultimamente estaba en 10 o 15. Al cambiar a W10 volvieron los 30fps. \n\n¿Será un tema de lol o será Microsoft que intenta por medios bastante cuestionables que actualicemos nuestro SO?\n\nEs que, si fuese por mi, seguiría usando Windows XP xD\n\nUn saludoo!! -3-","replies":[{"poster":"Mioen","date":"2019-08-17T14:59:48.767+0000","up_votes":1,"down_votes":0,"body":"Simplemente al no recibir mas actualizaciones, ya no se puede mejorar el rendimiento en sistemas como Win7. En cambio en W10 recibe actualizaciones y utiliza de mejor manera los recursos.\n\nMas bien si fuera por Riot le conviene que nos quedemos todos en XP, así no tienen que trabajar en un nuevo cliente optimizado para OS mas actuales, como W8.1/W10.","replies":[{"poster":"Errør 404","date":"2019-08-18T05:06:56.635+0000","up_votes":1,"down_votes":0,"body":"Extraño el cliente del legado... Era best cliente in the guor :'c","replies":[]}]}]},{"poster":"Puynsi","date":"2019-08-17T00:29:34.327+0000","up_votes":1,"down_votes":0,"body":"Debe ser un problema del parche y el spaghetti code, de vez en cuando saltan errores raros que a nadie mas le agarra, siempre te dicen que \"actualizes los drivers\" pero en la mayoria de los casos deja de jugar un tiempo hasta el parche que viene y te va a andar todo bien.\n\nt. W7 user","replies":[]}]}