{"poster":"woody1902","date":"2015-12-10T07:53:38.700+0000","title":"Duda sobre Reseteo de Clasificatorias","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hola, Espero que est&eacute;n bien!\r\n\r\nTengo una duda y espero que alguno de ustedes me pueda responder.\r\nYo actualmente estoy en plata 4, pero supongamos que termino as&iacute; hasta que reseteen las colas clasificadoras, cuantas partidas deber&iacute;a ganar para quedar en oro V como minimo? (Si es que es posible) o a que liga o division llegar&iacute;a mas alto en el caso de que ganase 6 o 7 de las 10.\r\n\r\nNo entiendo mucho eso ya que dicen que al volver a jugar las 10 partidas uno no puede subir mas arriba de la liga en que estaba uno anteriormente, Saludos! {{summoner:11}} {{summoner:21}}","replies":[{"poster":"DayronDrakend","date":"2015-12-10T15:59:58.781+0000","up_votes":2,"down_votes":1,"body":"Lo más probable es que te dejen en bronce, suelen dejar en ligas más bajas de lo que estás :/","replies":[]},{"poster":"Whitesse","date":"2015-12-10T16:37:42.764+0000","up_votes":1,"down_votes":0,"body":"Para quedar en Oro 5 directamente tenes que ganar X.\nNo se sabe, es depende tu habilidad, no hay un estimado.","replies":[]},{"poster":"Revolución","date":"2015-12-10T16:21:43.392+0000","up_votes":1,"down_votes":0,"body":"mmm no quiero ser mala onda, pero generalmente son complicados los resets... a menos que estés ganando 32 puntos por victoria y ganes las 10, veo demasiado difícil que arranques en Oro. De hecho, no te sorprendas tanto si ganaras 5 y arrancaras en Bronce 3 o 2. Si te parece que tu nivel está para llegar a Oro, entonces no deberías tener problema en subir desde Bronce.\n\nPara que te hagas una idea, yo estoy en Oro 3 (promo a Oro 2) y calculo que si dejara ahora de rankear tendría que ganar mínimo 5 para no quedar en Plata.","replies":[]},{"poster":"Natchin","date":"2015-12-10T12:59:51.761+0000","up_votes":1,"down_votes":0,"body":"Lo más probable es que ni aunque ganes las 10 quedes en oro 5.","replies":[]},{"poster":"Hellcore","date":"2015-12-10T12:26:06.558+0000","up_votes":1,"down_votes":0,"body":"hola amigo, mira segun lei (Extraoficial), promedian tu MMR actual con el nuevo obtenido despues de jugar las 10 rankeds, y eso te dara tu nueva division.\ncuanto MMR tienes aprox ahora?","replies":[]},{"poster":"ElClarke","date":"2015-12-10T08:11:15.806+0000","up_votes":1,"down_votes":0,"body":"No hay manera precisa de saber amigo. Ya que el posicionamiento despues de el reinicio depende de cuantas partidas ganes y de tu MMR anterior.\nDiciendote a grandes rasgos, ya que tenes un 52% de partidas ganadas, quizas si ganas 8 o 9 llegues a oro V, pero no son mas que simples especulaciones\n\n**PD:** Si podes subir mas ligas de lo que ya estabas, el maximo que podes llegar es Platino 1 dado el caso.\n\n\nSaludos {{champion:412}}","replies":[]}]}