{"poster":"twenty47","date":"2015-11-05T13:40:03.011+0000","title":"Hat ein Toplaner wirklich so wenig Einfluss?","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hi Community :)\r\n\r\nzurzeit ist es wie verhext im Ranked. Ich maine zz Renekton auf der Toplane und steh in der Laningphase immer gut da, oft 2:0 oder 3:0 (auch ohne Jungler). Nur ich habe das Gef&uuml;hl, dass ich mit dem Feed im Midgame &uuml;berhaupt nichts anfangen kann, wenn die restlichen Lanes verkacken. \r\nKurzes Beispiel. Ich steh oben auf der Top: zone so gut es geht den Gegner, f&uuml;hre im Farm und mein Farm ist eigentlich recht gut (20 Min 170 - 190 CS). Mein Jungler steht auch oft gut oder ausgeglichen im Game. Grunds&auml;tzlich ist es aber so, das die Mitte und Bot verkackt. \r\nDas soll kein qq Thread werden, sondern beachtet genau den Titel. Wenn wie gesagt mitte und bot verkacken, kann ich das game nicht in die hand nehmen. Verkacken diese aber nicht, f&uuml;hlt man sich als Toplaner useless. Da reicht es zu splitpushen und um objekte mitzufighten. \r\n\r\nWie ergeht es euch auf der Toplane? Ich hab mir z.b. ein Textdokument auf den Desktop angelegt wo ich meine Rankgames notiere und meine Fehler aufschreibe und wie das Matchup gg verschiedene Champions verlaufen ist. Ungelogen, ich schreib oft laningphase dominat, aber nicht genug impact gegen noch mehr gefeedete Gegner klar zu kommen. \r\n\r\nManchmal denke ich mir mein Ehrgeiz aufzusteigen und mein Skill zu verbessern ist so gro&szlig;, dass mir Fehler von anderen tierisch auf den Sack gehen. Gerade dann, wenn man dass Gef&uuml;hl bekommt besser zu werden ^^. \r\n\r\nHabt ihr vielleicht Tipps, wie ich mit mein Feed besser umgehen kann? oder vllt sogar an noch mehr feed zu kommen?\r\n\r\nliebe gr&uuml;&szlig;e","replies":[{"poster":"invite mich mal","date":"2015-11-07T22:29:56.738+0000","up_votes":1,"down_votes":0,"body":"Mit Renekton kann man sich easy auf Diamond carrien, mein kumpel maint ihn und er hat 61% Winration mit Renekton http://www.lolking.net/summoner/euw/29454217#profile .\n\nDas Ding in Bronze/Silber/Gold sogar in low plat ist, dass die Leute TP mitnehmen es entweder nur für die Lane benutzen, gar nicht benutzen oder nie auf die Map schauen.\n\nWenn man TP mitnimmt ist das timing extrem wichtig, dass man nicht zu spät im Teamfight tp't, desweiteren, lohnt es sich manchmal mehr die Lane rauszupushen und die Sidelanes zu ganken, manchmal wenn du halt die Lane freezt, roamt der Gegner und wird dann gesnowballed.\nWenn du wirklich gefeedet bist kannst du einfach Top durchpushen, dann sind die Gegner gezwungen mind. 1-2 Leute zusätzlich hochzuschicken, in der Zeit kann dein team eine andere Lane pushen oder Drake machen.","replies":[]},{"poster":"twenty47","date":"2015-11-06T12:42:37.280+0000","up_votes":1,"down_votes":0,"body":"Wow danke für die ganzen Antworten :) \n\nIch versuch mal auf alle antworten einzugehen. \nDer erste Punkt der mir aufgefallen ist, ist dass ich eher ein Champ picken sollte der mehr snowballt bzw. mehr impact im Late hat. \nIch finde Renekton ist ein Champ mit dem ich mich in der Laningphase wohl fühle. Er gibt mir eine inne Ruhe bzw sicherheit die Lane zu dominieren. Ich hab auch öfters mal Riven gespielt, aber ich muss sagen, mit dem AA Reset ist Riven ein schwerer Champ. Yasuo hingegegen könnte ich echt mal ausprobieren. \n\nSteraks ist eigentlich immer ein Pflichtkauf für mich und ich finde die neuen Tank Items stehen Renekton echt gut {{item:3053}} {{item:3742}} ! :D\n\nIch spiele Renekton mit offensiven Masteries und kaufe mir so schnell es geht {{item:3077}} danach überlege ich meist ob ich auf dmg gehe oder auf Tankiness. \nOft denke ich mir dass ich mein lead ausspielen muss und gehe deshalb auf {{item:3071}} aber ich habe das Gefühl wenn ich mich für die tanky Variante entscheide, dass ich gerade in den Teamfights mehr für mein Team machen kann. \n\nIch pushe mit Renekton eigentlich sogut wie immer. Das verschafft mir meist immer ein sehr guten Vorteil ggüber mein Gegner auf der Lane, da er unterm Tower nicht gut farmen kann. wenn es zum gank kommt, kann ich abhauen oder auch oft gewinne ich den 2v1 fight 8-) (deshalb mag ich {{champion:58}}  ja auch so gern :D)\n\nDas mit den Entscheidungen treffen ist mir selbst auch aufgefallen und ich versuche so oft es geht mein TP für das Team zu nutzen. Da ich ja meist eh vorne liege kann ich die Wave auch rauspushen, base und dann auf die lane laufen. Nur wie gesagt, manchmal überlege ich es mir ob ich auf die bot {{summoner:12}} soll wenn der gegnerische adc schon 3:0 steht und schon {{item:3031}} fertig hat ^^. Vielleicht sollte ich diesbezüglich mehr ausprobieren. (angst ist der schlimmste Feind xD).\n\nDie Anmerkung noch mehr auf DMG zu gehen erscheint mir bissle fragwürdig, ich mein ok, es ist nur die Silber-Gold Elo, aber pure ad. Ich mein Ok würde mir durchaus spaß machen :D aber bin ich dann nicht so butterweich, dass ich in Teamfights vllt 1 hole und mein tod im TF einfach hinnehmen muss? najut wenn die gegner klumpen könnte ich mit der e q genug poke raushauen damit meine Mates den Rest machen ^^ .. Naja weiß noch nicht was ich davon halten soll .. ich find mich ja schon mit den offtank Items ziemlich weich ^^\n\nOk, dass die Toplaner genug einfluss haben können sehe ich ein, hat man ja auch bei den Worlds gesehen. Ich meinte ja eher im Low Elo Bereich ^^\n\nSo nochmal danke für die Antworten, hat mir auf jeden Fall schon mal weiter gebracht, meine Spielweise bissle zu überdenken, gerade was entscheidungen angeht :)\n\nlg","replies":[]},{"poster":"Bergelmir32","date":"2015-11-05T14:48:23.636+0000","up_votes":1,"down_votes":0,"body":"> Wie ergeht es euch auf der Toplane? Ich hab mir z.b. ein Textdokument auf den Desktop angelegt wo ich meine Rankgames notiere und meine Fehler aufschreibe und wie das Matchup gg verschiedene Champions verlaufen ist. Ungelogen, ich schreib oft laningphase dominat, aber nicht genug impact gegen noch mehr gefeedete Gegner klar zu kommen. \n\nAls ob es anderen Lanes da anders gehen würde, wenn sie gegen jemanden ran müssten der mehr gefeedet ist als sie.\nAbsonsten vielleicht was anderes als Renekton spielen? Er ist gradezu verschrien dafür sehr stark im Early zu sein und dann gnadenlos abzufallen.","replies":[{"poster":"MeDontEnglish","date":"2015-11-05T15:27:44.216+0000","up_votes":1,"down_votes":0,"body":"Nicht mehr, Renekton hat in seinen letzten Änderungen in der Laningphase etwas abgenommen ( immernoch sehr stark in der Lane ) und Mid/Late stärke dazugewonnen.\n\nAuch die neuen Items, vor allem {{item:3053}} in Kombination mit seiner Ulti machen ihn zum übertank mit starkem DMG.","replies":[]}]},{"poster":"Diabolisstriker","date":"2015-11-05T15:23:38.526+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nwenn du als Top Laner nicht carrien kannst, dann liegt das entweder an deinem Desicion Making oder am Champion Pool. \nTop Laner sind zur Zeit wirklich unglaublich broken im Gegensatz zu anderen Lanes. \n\nOft hilft es auch Mid (oder Bot) Lane zu roamen wenn möglich.\nWenn du Fehler notierst und probierst zu vermeiden wirst du aber sicher weiter kommen. \n\nLG","replies":[]},{"poster":"Call me Br00t","date":"2015-11-05T15:07:40.569+0000","up_votes":1,"down_votes":0,"body":"Sag deinen Lanes, besonders Botlane, sie sollen auf dem Lane Busch (den, der näher am Gegner Tower ist) einen Ward stellen, dann wartest du bis die Gegner auf deine Botlane engagen, TP´st runter holst dir im Idealfall 2 Kills für euer Team + Tower + Drake.","replies":[]},{"poster":"LZ Flame","date":"2015-11-05T14:53:52.655+0000","up_votes":1,"down_votes":0,"body":"warscheinlich wirst du keine Ahnung haben wann du groupen sollst oder was du  machen solltest,nach der lanningphase du hast mehrere Optionen,splitpush oder groupen, wenn du splitpusht sollstest du vorne sein oder sehr weit hinten z.b wenn du vorne bist nim dir den 1sten Tower dann push die lane zum 2ten Tower  warde die üblichen wardspots im Gegner jungle push die waves immer aus und farm den Gegner jungle mit.es gib da mehr Optionen aber das mache ich oft.groupen Dragon hollen und mitte pushen wenn man den besseren siege oder waveclear, wenn du z.b sagen  wir 2kills ahead bist und der gegnerische toplaner keinen tp hat und top ist kannst du auch recht leicht diven du solltest es dein Team  wissen lassen davor.teamfighten willst   du nur \n wenn du mehr machen würdest in einem teamfight als dein Gegner z.B ein malphite will teamfighten weil er scheise ist auf der lane ist\nund in teamfights recht gut,ein tryndamere z.b will 50m splitpushen aber muss auch teamfighten wenn die Gegner  darauf wirklich bestehn z.b sie würden baron machen.","replies":[]},{"poster":"Fairtrade Milk","date":"2015-11-05T14:53:19.352+0000","up_votes":1,"down_votes":0,"body":"toplaner haben sehr viel einfluss, da sie mit tp spielen.\ndazu muss man natürlich immer ein blick auf die anderen lanes haben, dass man sich rechtzeitig zum counter gank tp'n kann.\n\nOder da du immer sehr gefeedet bist, nimm snowball champions oder splitpush champions. Als tank bist du generell aufgeschmissen, wenn dein apc und adc keinen damage drücken können","replies":[]},{"poster":"Hi im Rosek","date":"2015-11-05T14:34:06.993+0000","up_votes":1,"down_votes":0,"body":"Also dein Farm ist echt gut auf der Toplane ! Dein farm ist sicher nicht das Problem.\nBei dir scheint es ein Problem in den Teamfights zu geben. Wann gehe ich wo rein. Was ist zu fokusen usw. Wie ist mein positioning usw. \n\nDu bist im Silber-Gold ELO , du könntest versuchen etwas mehr auf Damage zu gehen. Du spielst immer sehr tanky und verursachst dadurch natürlich wenig schaden.","replies":[]},{"poster":"Rogeríous","date":"2015-11-05T13:47:49.029+0000","up_votes":1,"down_votes":0,"body":"Die Toplaner sind in der momentanen Meta sehr einflussreich, gerade mit den Juggernauts kann man sehr schnell snowballen, du sagst du stehts meistens 2/3:0 kannst den feed aber nicht in Impact umsetzen, versuch zu roamen, sei es pushen ---> midlane, pushen---> tp botlane, allgemeint ist pushen wenn man roamen will extrem wichtig auch solltest du versuchen den 1. tower zu holen. Versuch so viel focus wie möglich auf die Toplane zu holen (gegner jungler/midlaner) aber du darfst nicht sterben. Nimm den gegnerischen jungle mit falls möglich (Yasuo Riven sehr gute champs dafür). \nFalls du zu etwas genauere Fragen hast meld dich. \nLg","replies":[]}]}