{"poster":"IllIllIIllIll","date":"2016-11-30T23:42:11.382+0000","title":"FlexQ nimmt den Spaß","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":7,"body":"Sry Riot aber die flexQ kann nur ein schlecht gemeinter scherz eurerseits sein fast jeder in der community macht sich l&auml;cherlich dar&uuml;ber und schon dass sollte euch zum nachdenken geben. Weiters kann diese art von ranked so wie ihr sie erstellt habt nicht mal ann&auml;hernd als ersatz f&uuml;r teamranked bezeichnet werden. Dass beginnt schon an den elounterschieden, viele wollen teamranked mit freunden spielen welche vll nicht in deren elo spielen und dann hei&szlig;t es wieder es geht nicht ?? Das kann nicht euer ernst sein. Weiters kann man die flexQ auch deshalb nicht mit dem alten teamranked vergleichen weil es eher die position als DynQ einnimmt. Ihr habt jtz eig 2 x SoloQ/DynQ gemacht anstatt einfach dass System mit Teamranked zu lassen mit dem jeder zufrieden war !!! H&ouml;rt ihr &uuml;berhaupt auf eure community? Solche fragen stelle ich mir sicher nicht als einziger hier also bitte macht mal eure augen auf es gibt sicher noch gen&uuml;gen weitere punkte welche die flexQ als schlecht und &uuml;nnotig darstellen und genauso positive dinge f&uuml;r dass einf&uuml;hren des alten teamrankeds jedoch ist mir so ein schei&szlig; system mir nicht die zeit wert weitere worte daf&uuml;r zu schreiben, ihr wisst es dass unzufriedenheit herrscht und ihr wisst genauso dass ihr das so einfach und schnell l&ouml;sen k&ouml;nntet also warum tut ihr dass nicht ?!! W&uuml;rde mich echt &uuml;ber eine ernste antwort freuen bzw &uuml;ber eine wiedereinf&uuml;hrung des alten systems (Teamranked statt FlexQ)\r\n\r\nLG euer Tilted Communtiy Member","replies":[{"poster":"Megamaexx","date":"2016-12-01T05:20:00.477+0000","up_votes":6,"down_votes":0,"body":"Weißt du, was das Problem an deinem Beitrag ist? Dass sich ein Level 11er über etwas beschwert, das er nicht spielen kann. Da das aber vermutlich dein Smurf ist, frage ich mich, warum du das nicht mit deinem Main-Account geschrieben hast. Als ob du Angst davor hättest, mit deiner Meinung in Verbindung gebracht zu werden. Wenn man hinter einer Sache steht, dann sollte man diese auch nicht über einen Smurf verbreiten.\n\nAlso nehmen wir mal an, Riot bemerkt das hier. Dann schauen sie doch erst mal nach, ob die betroffene Person wirklich so viele Teamrankeds gespielt hat und ob diese wirklich dieser Person fehlen oder ob das wieder einer dieser Personen ist, die zwar regelmäßig in einem Team waren, aber nie wirklich gespielt haben. Die gibt es nämlich zu hauf. Wirklich konstant aktive Teams gab es doch kaum. Viele haben Teamranked am Ende auch nur noch gespielt, um den Ward zu bekommen.\n\nWenn man übrigens einfach nur mit Freunden aus anderen Elos Spielen möchte, kann man ja noch Draft Pick spielen.","replies":[{"poster":"Nivoras","date":"2016-12-01T06:09:29.987+0000","up_votes":2,"down_votes":0,"body":"Problematisch wäre es in der Tat wenn Draft hier deaktiviert werden sollte wie in den anderen Regionen, und Riot hat selbst gesagt dass  sie das eigentlich gerne tun würden. Aber ansonsten stimme ich dir voll zu^^","replies":[{"poster":"Megamaexx","date":"2016-12-01T07:15:04.694+0000","up_votes":1,"down_votes":0,"body":"Wäre doof, wenn sie draft wegnehmen, weil ich das hauptsächlich spiele. Ich denke aber mal, dass wir hier auf EUW genügend Spieler haben, die aktiv normal draft spielen.","replies":[{"poster":"CYPHΕR","date":"2016-12-01T07:53:19.569+0000","up_votes":2,"down_votes":0,"body":"Laut der Aussage von Riot existiert in EUW zumindest eine sehr geringe Nachfrage nach der Normal Draft Queue. In den Regionen in denen diese bereits abgeschafft wurde hat ja so gut wie kein Spieler sich für diese Queue angemeldet.\n\nIch spiele eigentlich immer Draft Queue wenn ich mit Freunden ein paar Normals starte, aber wenn man immer wieder liest wie viele sich über das Instalocken in der Champselect aufregen, dann scheint der Blindpick doch deutlich dominanter zu sein (was ich mir bis zu dem Riot Post nie hätte vorstellen können).","replies":[{"poster":"Megamaexx","date":"2016-12-01T08:37:21.701+0000","up_votes":1,"down_votes":0,"body":"Falls sie es abstellen, lässt sich da bestimmt über das Forum was beeinflussen (sofern wir ein paar tausend Upvotes+Kommentare zusammenbekommen)\nWenn sich allein mehrere 1000 deutsche Spieler finden, die auf die draft queue bestehen und dasselbe Thema auch in anderen Foren von euw kommuniziert wird, dann wird Riot zumindest darauf aufmerksam. Dann liegt es noch an uns, dass wir dann eben nicht mehr spielen dürften. Manipulation durch Masse ;) \nIch hoffe aber, dass man solche Aktionen nicht planen muss und normal draft einfach erhalten bleibt.","replies":[]}]}]}]}]},{"poster":"Kiahebly","date":"2016-12-01T06:09:42.376+0000","up_votes":2,"down_votes":0,"body":"Also wenn ich das so lese, kommt mir der Verdacht, dass Du ein ganz anderes Problem hast, arbeite daran, dann wird Dir einiges leichter zu Verstehen sein.","replies":[]},{"poster":"Jastol","date":"2016-12-01T08:17:53.636+0000","up_votes":1,"down_votes":0,"body":"Ich habe früher in einem Team gezockt. Wir hatten Bronze, Silber und Platin Spieler im Team und eigentlich ist es immer nur darin geendet, das die Platin-Spieler und später auch Ich als Silber Spieler das Team verlassen haben, da es immer nur darauf hinauslief, welches Team wohl den besten Einzelspieler hatte, entweder hat dieser das Spiel gecarried oder es wurde verloren. Spaß hat das auf dauer nicht gemacht und die Stimmung wurde immer toxischer.\n\nDas Problem war nur, dass es für jemanden mit paar Freunden schwer war anders zusammen zu ranken. Mit der FlexQ ist das jetzt kein Problem mehr, Ich spiele da meist mit zwei Kumpel zusammen und wir haben Spaß, vor allem, da wir alle ungefähr das gleiche Skillevel haben und die Gegner eben auch.","replies":[]}]}