{"poster":"cCftw","date":"2018-02-18T14:44:08.219+0000","title":"PROBLEMA GRAVE.","subforum":"Charlas Generales","up_votes":1,"down_votes":1,"body":"Hace mucho tiempo estoy intentando recuperar mi cuenta, un dia de la nada me dijo su cuenta ah sido transferida de region y nunca mas pude volver a usarla, tengo el correo etc todo en regla, y cuando la busco en cierta pagina que te muestra stadisticas region etc, aparece en LAS pero no puedo logear al foro ni al juego, mand&eacute; reiterados tickets sin solucion alguna, necesito mi cuenta de vuelta se&ntilde;ores por favor \r\n\r\nnick :f4se\r\nID: miirook.","replies":[{"poster":"SKT T1 Bank","date":"2018-02-18T16:03:08.159+0000","up_votes":1,"down_votes":0,"body":"Hola f4se. Mira si la transferencia a las se hizo recientemente puede que aun este en proceso de transferencia y por eso nmo puedas acceder aun a la cuenta.\n\nSi ya creaste un ticket al respecto, espera constestacion, hoy es domingo y sera un poco mas lento el sistema.\n\nDesde mi opinión, lo mejor seria hacer un ticket en el marco de \"recuperación de cuenta\", y tratar de ver que paso, y si puede ser un chat mejor aun.\n\nTen en cuenta las demoras de estos días y no te preocupes si la cuenta es tuya la recuperaras ;).\n\n**BANK**.","replies":[{"poster":"cCftw","date":"2018-02-18T21:00:49.983+0000","up_votes":1,"down_votes":0,"body":"El ticket lo hice hace bastante , de hecho hice 2 ... uno me lo respondio un bot y el otro no me dio una respuesta concreta, la transferencia no se cuando f ue y si realmente se hizo, por que en lolking me figura que sigue en LAS  la cuenta, cambie la contraseña hoy y no puedo ingresar , me dice que fue transferida de servidor, por eso quiero una explicacion racional y concreta...a ver que paso con mi cuenta :S .","replies":[]}]},{"poster":"ANYASZOMORÍTÓK","date":"2018-02-18T15:08:31.115+0000","up_votes":1,"down_votes":0,"body":"Si te dice que la cuenta está en LAS, fijate que hayas seleccionado esa región en el launcher.","replies":[{"poster":"cCftw","date":"2018-02-18T15:22:28.050+0000","up_votes":1,"down_votes":0,"body":"juego desde la season 2, se como entrar al juego ... no es ese el problema, debe estar buggeado no se, pero acabo de cambiar la contraseña etc y sigo sin poder logear ,además probe ingresar en todos los servers y no me deja en ninguno .\n","replies":[{"poster":"ANYASZOMORÍTÓK","date":"2018-02-18T15:24:44.583+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=cCftw,realm=LAS,application-id=v7qsfXsE,discussion-id=T5nAQLIh,comment-id=00010000,timestamp=2018-02-18T15:22:28.050+0000)\n>\n> juego desde la season 2, se como entrar al juego ... no es ese el problema, debe estar buggeado no se, pero acabo de cambiar la contraseña etc y sigo sin poder logear ,además probe ingresar en todos los servers y no me deja en ninguno .\n\nEntonces mandá ticket a soporte explicando todo con screenshots.","replies":[{"poster":"cCftw","date":"2018-02-18T15:30:43.869+0000","up_votes":1,"down_votes":0,"body":"ya lo hice , pero no recibo una respuesta positiva... me piden muchos datos que no recuerdo, no se por que tanto si es mi mail tengo la ip desde la cual jugué etc.","replies":[]}]}]}]},{"poster":"cCftw","date":"2018-02-18T15:07:33.224+0000","up_votes":1,"down_votes":0,"body":".","replies":[]}]}