{"poster":"Salomon Sraris","date":"2017-09-01T06:24:03.182+0000","title":"Respeto. Por sus madres!!!! LÉANLO!!!","subforum":"Comportamiento del jugador","up_votes":8,"down_votes":5,"body":"Queridos jugadores h&eacute;roes de este juego que cada d&iacute;a mejoran y dan lo mejor de ustedes, vengo a felicitar esto , cada cuanto les toca un t&iacute;pico jugador que comienza flameando ami siempre me paso y si no digo que no reten ni insulten a uno mismo, pero lo que mas molesta, enoja, intriga, enfurece y da mucha pena que insulten a la madre de uno o la insulten sin motivo alguno. Vengo a esto RIOT, un d&iacute;a solo un d&iacute;a vean esto todos tenemos una madre, mama, alguien que nos dio la vida y a esto quiero llegar ya vasta PONE UN STOP a esto. Empece como todos en el juego un d&iacute;a tan especial para mi un cumplea&ntilde;os que no tengo a mi madre cerca hace 2 a&ntilde;os que ni la veo, por temas de trabajo y de estudios vengo a disfrutar su juego al entretenerme en mi cumplea&ntilde;os. PERO ALGO ME DENSONRRA ESTO QUE UN BUEN JUEGO DONDE TE DIVIERTE COMPITES Y TE ESFUERZAS PARA SER EL MEJOR. toquen estas personas a insultar ........ en fin vengo a recalcar esto disfruten unos tienen madres vivas otros no TODOS tenemos una madre que no dio a nacer es una lastima que no puedas hacer algo con esto RIOT una verdadera lastima................ \r\n\r\nSOLO PIDO QUE ANTES DE INSULTAR PIENSEN ANTES DE ACTUAR..... no es una algo para burla respeto no hacia el otro sino-\r\n!!!!!RESPETO A SU MADRE&iexcl;&iexcl;&iexcl;&iexcl;&iexcl;&iexcl;&iexcl;&iexcl;&iexcl;","replies":[{"poster":"Ks Erwyn","date":"2017-09-01T12:49:46.251+0000","up_votes":2,"down_votes":0,"body":"http://i.imgur.com/EtXD1Wb.gif[/img] , osea que debería de respetar a la madre de Dasant? XD","replies":[{"poster":"Vi Sexual","date":"2017-09-01T13:09:54.793+0000","up_votes":1,"down_votes":0,"body":"Tiene?","replies":[]}]},{"poster":"Geeik","date":"2017-09-01T11:56:57.130+0000","up_votes":2,"down_votes":0,"body":"Me pareció muy sensacionalista, pero bueno... Es tu opinión.\nLo dices como si todos los flammers del universo usaran el foro de forma frecuente","replies":[{"poster":"Salomon Sraris","date":"2017-09-21T17:57:46.011+0000","up_votes":1,"down_votes":0,"body":"En si ya se pasan todas las voy jugando empiezan con esa mierda sino es mi team es el enemigo polomenos algo de respeto.","replies":[]}]}]}