{"poster":"Blackodem","date":"2015-10-27T09:52:36.322+0000","title":"Silver IV Spieler sucht Lehrer/Duo Q Partner/Seelsorger","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Hallo zusammen,\n\nich suche nach oben genannten Personen und hoffe hier f&uuml;ndig zu werden ;)\n\nZu mir, 22 aus Dortmund.\n\nRankeds spiele ich erst seit etwa 1 - 1.5 Monaten wirklich aktiv, h&auml;nge mich aber auch sehr rein, versuche viel zu lernen, lese viele Guides, schau viele Tutorials und spiele viel.\n\nMomentan sitz ich aber fast jeden Abend geknickt am Rechner und w&uuml;rde am liebsten in meine Tischkante bei&szlig;en, obwohl die gar nicht so gut schmeckt :D Nach einer sehr guten Anfangszeit mit vielen Siegen, viel Freude, Aufstieg und nem Pentakill, stellt sich momentan Ern&uuml;chterung ein, fast jedes Game wird verloren und ein Win ist die gro&szlig;e Ausnahme und wird infernal gefeiert.\n\nIch versuche mich daf&uuml;r selbst in die Verantwortung zu nehmen und nicht die Schuld auf meine Mates zu schieben. Ich sehe selbst: Ich overextende zu oft (m&ouml;chte mich jedes mal Ohrfeigen), habe schlechte Mapawareness und schaue deutlich zu selten auf die Minimap und mein Wardingverhalten ist maximal ausreichend. Das sind alles Probleme an denen ich versuche zu arbeiten, aber leider das Gef&uuml;hl habe ich mache keine gro&szlig;en Fortschritte. Ich w&uuml;rde mich daher freuen jemanden zu finden, der mich etwas beim Zocken unterst&uuml;tzt, ein bisschen mit auf die Finger guckt, Fehler sieht, sie einem mitteilt, mir auch sagt wie ich besser reagieren sollte und mich verhalten soll etc. also mir beim Besser werden hilft. Es w&auml;re sch&ouml;n sich dabei menschlich gut zu verstehen, nicht geflamed zu werden etc.\n\nIch will damit nicht sagen das ich absolut grottig und schlecht spiele (Naja vielleicht auch schon :D ), aber es ist einfach noch viel Potential nach oben offen das ich gerne aussch&ouml;pfen will, ein gro&szlig;es Ziel f&uuml;r S6 ist Gold zu erreichen, das sieht momentan aber ziemlich &uuml;bel aus wenn das so weiter geht.\n\nPositive Seiten sind:\nIch flame mein Team nicht, ja ich bekomme oft Teams bei deinen ich mir denke &quot;Komm das hast du nicht verdient&quot; wenn im Pick schon geschrieben wird &quot;Top or troll&quot; etc stellen sich ja bei mir die Nackenhaare auf, am Anfang hab ich mir oft gesagt &quot;Du bist nicht Schuld sondern dein Team&quot; (Wahrscheinlich die h&auml;ufigste Reaktion am Anfang), bis ich einen wirklich guten Guide gelesen habe der besagt das man sich an die eigene Nase fassen soll und das stimmt, trotzem hasse ich solche Teammates.\n\nIch versuche mich meinem Team anzupassen, ich spiel top und wir haben noch keinen Tank und keiner wird einen spielen? Dann pick ich nen Tank. Wir sind full AD? Ein APler w&auml;re sinnvoll etc.\n\nDanke an alle die meine Wall of Text gelesen haben und ich freue mich auf Antworten :)\n\nEigener TeamSpeak 3 Server ist auch vorhanden!","replies":[{"poster":"Ireliα","date":"2015-10-28T22:35:25.365+0000","up_votes":1,"down_votes":0,"body":"Moin, ich bin Main Top und derzeit Platin 5. Du kannst mich gerne adden und wir gucken mal ob wir nen paar Spiele zusammen machen können. \n\nMuss aber im Vorhinein sagen, dass die Uni mich aktuell ziemlich einspannt, ich also momentan nicht sonderlich viel spielen kann.","replies":[{"poster":"Blackodem","date":"2015-10-29T12:05:39.117+0000","up_votes":1,"down_votes":0,"body":"Moin,\n\nsehr gerne, ich adde dich dann heute Abend, bin nur grad ziemlich krank muss mal schauen wie lange ich on bleibe.\n\nMit der Uni ist kein Problem, bin ja auch vollzeitbreufstätig und hab nicht ganz so viel Zeit.\n\nGruß\nNico","replies":[]}]},{"poster":"hshtagniemehrcdu","date":"2015-10-27T14:21:11.875+0000","up_votes":1,"down_votes":0,"body":"Kannst einfach ein Replay auf Youtube hochladen; dann kann man das ganze in aller Ruhe analysieren.\nIst den meisten aber zu aufwendig.","replies":[{"poster":"Blackodem","date":"2015-10-28T09:23:02.849+0000","up_votes":1,"down_votes":0,"body":"Gibt es da eigentlich andere Möglichkeiten als den LolRecorder? Der funktioniert leider seit Wochen nicht mehr bei mir.","replies":[{"poster":"hshtagniemehrcdu","date":"2015-10-28T15:11:28.220+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Blackodem,realm=EUW,application-id=ip27PlEH,discussion-id=GOsL80is,comment-id=00020000,timestamp=2015-10-28T09:23:02.849+0000)\n>\n> Gibt es da eigentlich andere Möglichkeiten als den LolRecorder? Der funktioniert leider seit Wochen nicht mehr bei mir.\n\nhttps://ahri.tw/en/Download/","replies":[]}]}]},{"poster":"Shiro equals","date":"2015-10-27T13:14:00.438+0000","up_votes":1,"down_votes":0,"body":"Ich habe dich auch mal geaddet, hab mittlerweile schon Erfahrung mit Coaching gemacht. Zur Zeit habe ich allerdings Nachtschicht, weiß nicht wie das mit dir zusammenpasst.","replies":[{"poster":"Blackodem","date":"2015-10-28T09:22:32.858+0000","up_votes":1,"down_votes":0,"body":"Moin,\nich danke dir, hat viel Spaß gemacht gestern.","replies":[]}]},{"poster":"MAST0D0N","date":"2015-10-27T10:35:04.107+0000","up_votes":1,"down_votes":0,"body":"Hi, würde mich bereiterklären ein paar Spiele von dir mit anzuschauen und nach Verbesserungen ausschauzuhalten. Bin derzeitig Platin 4, spiele jedoch als Main Position ADC , wobei ich auch sehr gerne af die Top Lane gehe. \nIch sag allerdings schon im Vorraus dass ich zurzeit meistens nur an Wochenenden Zeit habe, wahrscheinlich ändert sich das jedoch innerhalb der nächsten 2 Wochen was dann dazu führen würde dass ih fast täglich für dich Zeit hätte.\nIch selber kann Gedult zeigen wenn ich Leuten etwas erkläre, aber wenn sie beleidigend auf kritig reagieren dann kann ich sie auch mal zur Schnecke machen.\nBis jetzt hab ich mehreren meiner Freunde geholfen Gold zu erreichen. Wenn es nicht nach wochenlangen Tipss grreicht hat dann eben durch Duo Q, da lernt man auch immer einiges dazu.\nFalls du interesse zeigst musst du mich halt InGame adden. mein Name ist MAST0D0N . ( Achtung keine O´s es sind 2 0 )\nAchja , ich bin noch die nächsten 3 Tage 18  und wenn es dir zu jung ist einfach ignorieren.\nMfG Chris","replies":[{"poster":"Blackodem","date":"2015-10-27T10:49:25.850+0000","up_votes":1,"down_votes":0,"body":"Moin Chris,\n\nach Quatsch warum sollte das zu jung sein, ist doch kaum ein Altersunterschied :)\n\nErstmal danke das du geantwortet hast, das Angebot finde ich sehr nett und gehe gerne darauf ein. Ich denke ein Platin 4 Spieler sieht das alles einfach nochmal aus einer ganz anderen Perspektive.\n\nDas Aufsteigen ist auch gar nicht das wichtigste, sondern primär das besser werden.\n\nIch adde dich nachher wenn ich zuhause bin.\n\n\nLiebe Grüße\nNico","replies":[{"poster":"MAST0D0N","date":"2015-10-27T13:51:16.234+0000","up_votes":1,"down_votes":0,"body":"gut, Frühestens werde ich wohl am Freitag mich einloggen können, also nicht wundern wenn es eben etwas dauert. Da ich allerdings am Freitag Geburtstag habe werde ich auch vllt erst am Samstag dazu kommen","replies":[]}]}]}]}