{"poster":"RocketRelm","date":"2018-03-07T10:03:26.932+0000","title":"The Hows Of Balance: Patch 8.5","subforum":"Gameplay","up_votes":48,"down_votes":4,"body":"About two weeks ago [I did some math and made up a chart](https://boards.na.leagueoflegends.com/en/c/gameplay-balance/UggE3koc-doing-a-math-balance-changes-damage-creep)  of the way Riot&#039;s been balancing over Season 8. I decided I&#039;d continue to update along with each new patch, to follow the trends. It&#039;s a nice way to zoom out and see the forest instead of the trees.\n\nTherefore, here&#039;s ___Patch 8.5___\nhttps://imgur.com/CRPdy78.jpg?noredirect\n\nTL;DR: This patch has largely been damage increases and utility increases. Some cool downs have shuffled around, and *some* damage has been nerfed, but two of the three instances of damage nerfs are Berfs that result in almost 100% buffs on average.\n\n\n\n\nEdit: ***But not all nerfs and buffs are the same size!***: Yeah, the variance of Buffs to Nerfs is an issue, but my viewpoint is that while certain nerfs might = 2 of a different buff, on average each Nerf will = each Buff, or at 'worst' 1.3(Nerf) = 1(Buff). Once we get enough data points, we can wash out the effects of outliers, and I think we're starting to hit that point already.\n","replies":[{"poster":"Doozku","date":"2018-03-07T14:51:52.315+0000","up_votes":18,"down_votes":6,"body":"Berfs? I really don't like that term. Can we call them neutral changes? \n\nAlso I'd say this post can be pretty manipulative. I know that this isn't your intention but this feels like a statement on power creep which makes it really manipulative when you don't look at what kind of changes are actually being made, and what champions are being looked at. Just off the top of my head, Rengar was one of the champions receiving a damage buff but only because his ratios were thrashed on pbe prior to release to make sure that he wasn't op but he ended up being really bad.","replies":[{"poster":"Riot MapleNectar","date":"2018-03-07T17:54:05.169+0000","up_votes":25,"down_votes":0,"body":"We tend to refer to them as \"neutral\" or \"power neutral\" internally, that being said the term Berf (burf?) also get's thrown around a decent amount","replies":[{"poster":"Aznbeat","date":"2018-03-07T17:59:40.271+0000","up_votes":26,"down_votes":0,"body":"the word berf makes me want to berf","replies":[{"poster":"Melledoneus","date":"2018-03-08T03:35:23.716+0000","up_votes":5,"down_votes":0,"body":"Well, well, it looks like Surrender@20's Queen is visiting.\n\n*Knight's Salute*","replies":[{"poster":"Aznbeat","date":"2018-03-08T15:52:36.537+0000","up_votes":3,"down_votes":0,"body":"hOi","replies":[]},{"poster":"MuffledGarbage","date":"2018-03-08T16:51:18.944+0000","up_votes":1,"down_votes":0,"body":"*tips fedora*","replies":[]}]},{"poster":"Doozku","date":"2018-03-07T18:10:28.154+0000","up_votes":3,"down_votes":0,"body":"same","replies":[]}]},{"poster":"Jmman","date":"2018-03-07T20:13:52.171+0000","up_votes":1,"down_votes":1,"body":"Yea that is what you said about fiddle, but it was just a nerf all around.","replies":[{"poster":"Riot MapleNectar","date":"2018-03-07T20:54:26.307+0000","up_votes":5,"down_votes":0,"body":"Hmm? We nerfed him in the middle and support surely, but his jungle was undoubtedly buffed. Even with the changes though mid/support fiddle still outperforms jungle. Do you feel differently?","replies":[{"poster":"Ahristocats","date":"2018-03-07T21:08:02.732+0000","up_votes":4,"down_votes":1,"body":"do you feel like the buffs were enough to make jungle fiddle good?\n\njust asking i don't know cuz i never see him since he's never picked in high elo","replies":[{"poster":"Riot MapleNectar","date":"2018-03-07T21:36:55.176+0000","up_votes":5,"down_votes":1,"body":"Short term he's doing better in the jungle at high elo after the changes based on purely performance, but he's definitely played far less than compared to low elo. I would expect him to benefit more longer term as players adjust to less vision being in the jungle, but that'll remain to be seen. For him and other mage junglers I think we're going to need to see what our explorations into jungle sustain (mana/health) do before trying to push him further","replies":[{"poster":"Ahristocats","date":"2018-03-07T21:52:52.472+0000","up_votes":8,"down_votes":1,"body":"i just want to say it's amazing that you guys are that much on the boards right now, it feels really good to talk with the people who are managing the game we're playing\n\nas for fiddle, what you said makes sense but didn't you already buffed the mana regeneration in the jungle? i thought you already did it forgive me if i didn't follow well what happened","replies":[]},{"poster":"Jmman","date":"2018-03-08T03:01:17.480+0000","up_votes":1,"down_votes":0,"body":"Looking from an outside perspective...... could it be that only some mains are playing him now and other dropped him off as possible choices.  This would lead to less games and a slightly higher win rate.\n\nJungle and support are sub 50% and have been for a while.  Why can other champs just get buffs or fixes but fiddle is always a \"special\" case.  He has a really low play rate and at one time had the most games play by mains on average.( a season or so ago was when I saw this.  it was like 200+ on average)  This is the totally opposite of what you would expect looking at his win rate at that time and now.\n\nWhy are you so scared to just buff him like you did everyone else.  Heck you event made the \"e\" cost 20 more mana.  This nerf him late game mana wise.  What about late game keep waves off things NERFED.  I'm looking at the WHOLE game at every part of it.  There is a lot more than lane farming that extra damage was used for.  You could kill super minions and push back the wave.  Controling waves and quick correcting a lane to group up is very important.  But this was nerfed too.  You just didn't nerf is \"lane phase\" you hurt every fiddle late game and ability to protect your base / turrents.  And the whole point is to protect your base and kill theirs.\n\nedit: now your raising the minions hp.  You couldn't wait to nerf the bonus damage knowing this was coming in a patch or two?","replies":[]}]}]},{"poster":"The Yetii Rider","date":"2018-03-07T20:58:56.873+0000","up_votes":2,"down_votes":2,"body":"That doesn't inspire much confidence, Asirite. The champion has been a jungler for ages and the fact that you took a look at him to try and support him in that role and still couldn't fix it worries me.\n\nI get it, the move from MP/5 to % MP really hurts jungle mages in particular. But that change happened like three years ago and jungle mages are still almost completely absent from the game.","replies":[{"poster":"Riot MapleNectar","date":"2018-03-07T21:25:35.858+0000","up_votes":5,"down_votes":1,"body":"Our goal when we took him on was not \"make jungle his best role\", so I'd disagree that we didn't \"fix\" anything. We wanted to make his jungle less sad while also not destroying his ability to play in mid/support. His jungle was undeniably buffed, and both support and mid were undeniably nerfed. The power we took out of his kit for lane was also the least interactive pattern (I throw E on cd and to clear waves and poke you out of lane), and put it into his ult - a move that requires risk on behalf of the fiddle to position well, control vision etc.","replies":[{"poster":"Jmman","date":"2018-03-08T03:12:49.388+0000","up_votes":2,"down_votes":1,"body":"If he was balance this would make sense.  But if a champ was weaker and you just added here and removed there then the net outcome would be 0 added.\n\nBoth were played at such low rate you deemed it a must to nerf him.  All the while, other champs would be played 10 times more often with as high or about the same win rate were ok?  I guess you are coming with about 5 different champs nerfs to mid lane this if fiddle nerf was the bar for being nerfed.\n\nI know i'm sounding mean.  But heck you can't honestly sit there and tell me fiddle was OP compared to the other mid champs.  Look at freaking sion mid.  So from my view you are pick and chosing or \"Can\" and Cant\" play were.  And how \"Can\" and \"Can't\" be allowed to be good.  You knew what you did was only going to nerf him and wasn't going to fix him in the jungle at all.  but you still did it.","replies":[]}]},{"poster":"loli nukes","date":"2018-03-07T21:07:45.878+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=The Yetii Rider,realm=NA,application-id=3ErqAdtq,discussion-id=mMhP3k7Z,comment-id=00010001000200000000,timestamp=2018-03-07T20:58:56.873+0000)\n>\n> That doesn&#x27;t inspire much confidence, Asirite. The champion has been a jungler for ages and the fact that you took a look at him to try and support him in that role and still couldn&#x27;t fix it worries me.\n> \n> I get it, the move from MP/5 to % MP really hurts jungle mages in particular. But that change happened like three years ago and jungle mages are still almost completely absent from the game.\n\nThe issue with fiddles is less an issue of jungle mages. Champs like nid, eve, and elise have succeeded or are succeeding. Fiddlesticks has large issues like outdated champ design, some chunkiness,  and changes to the jungle as a whole (like the changes to camps 3(something like that) years ago. Fiddle will most likely need large changes sometime in the future which i believe he is on the list for high prio vgu but so are many other changes which is unlucky.","replies":[{"poster":"Jungle Lux God","date":"2018-03-08T05:24:06.053+0000","up_votes":3,"down_votes":0,"body":"I think you're confusing the term \"mage junglers\" with \"AP junglers\". There's a good selection of AP junglers, but they're all either assassins, skirmishers, or AP bruisers, with the sole exception of Fiddlesticks. Of course there have been some pseudo-viable mage junglers in the past, but they've always been either fringe viable or got nerfed out of the jungle because they were breaking lanes even harder.\n\nIt's true that Nidalee, Evelyn, and Elise have succeeded in the past, but they don't account for balance of mage junglers. Why? They aren't mages. Nidalee and Eve are assassins, while Elise is a skirmisher.\n\nI personally would like to see Riot give more effort into broadening the AP jungling pool to actually include some proper mages and a legit choice on what type of mage you want to bring to your team the same way most other classes of junglers have and whether or not you want to bring a mage to your team at all. The answer to the former is exclusively \"Fiddlesticks\" and the answer to the latter is \"oh hell no\".\n\nAnd in case you can't tell from my summoner name, I really like mage junglers. However, I haven't been able to play them since season 6 since changes in preseason 7 neutered them and I haven't had the desire to play SR since because of changes made that season.","replies":[{"poster":"loli nukes","date":"2018-03-08T18:47:54.061+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Jungle Lux God,realm=NA,application-id=3ErqAdtq,discussion-id=mMhP3k7Z,comment-id=0001000100020000000000000002,timestamp=2018-03-08T05:24:06.053+0000)\n>\n> I think you&#x27;re confusing the term &quot;mage junglers&quot; with &quot;AP junglers&quot;. There&#x27;s a good selection of AP junglers, but they&#x27;re all either assassins, skirmishers, or AP bruisers, with the sole exception of Fiddlesticks. Of course there have been some pseudo-viable mage junglers in the past, but they&#x27;ve always been either fringe viable or got nerfed out of the jungle because they were breaking lanes even harder.\n> \n> It&#x27;s true that Nidalee, Evelyn, and Elise have succeeded in the past, but they don&#x27;t account for balance of mage junglers. Why? They aren&#x27;t mages. Nidalee and Eve are assassins, while Elise is a skirmisher.\n> \n> I personally would like to see Riot give more effort into broadening the AP jungling pool to actually include some proper mages and a legit choice on what type of mage you want to bring to your team the same way most other classes of junglers have and whether or not you want to bring a mage to your team at all. The answer to the former is exclusively &quot;Fiddlesticks&quot; and the answer to the latter is &quot;oh hell no&quot;.\n> \n> And in case you can&#x27;t tell from my summoner name, I really like mage junglers. However, I haven&#x27;t been able to play them since season 6 since changes in preseason 7 neutered them and I haven&#x27;t had the desire to play SR since because of changes made that season.\n\nSo I understand the idea of separating these champs because they seem outliers to mage class and that fiddlesticks seems so different from other ap junglers. If we r looking at the mage jungle group over history it would be like morg ap kayle karthus and zyra. However I feel there is always gonna be a huge issue for mages with no mobility in the jungle outside of heavy iteration to keep them there. There are other ap junglers like ekko and fizz and akali who have worked that don't work well now. I personally see the argument that Elise and nid are assassins not mages but they are heavily overlapping in the class and have had success in the jungle. All I was saying in fiddlesticks case a lot of factors have hindered him and are large part of that is his outdated kit and relatively clunkliness overall that hinders him and riot was just trying to help him in the present until future in depth work comes. He will be a good champ to decide what a jungle mage should look like and maybe other champs could find a place but it's very hard for class if u exclude Elise and nid","replies":[{"poster":"Jungle Lux God","date":"2018-03-13T18:08:31.698+0000","up_votes":1,"down_votes":0,"body":"Elise and Nidalee are bad examples of what a mage jungler should look like since they aren't technically mages while still having mage elements (they instead use their mage elements to fuel their intended playstyles of skirmisher and assassin, respectively). At the same time they are good examples of what a mage jungler should be balance around.\n\nRiot insists that AP junglers be balanced around mana gating, but Elise and Nidalee don't have to play by those rules since half their kits are manaless, and as a result are some of the strongest AP junglers in the game's history. We could actually see more AP junglers if Riot decided to reduce some of the mana gating that AP junglers have to deal with.\n\nRiot should look at laning AP's for inspiration. Laning AP's can buy a mana item their first back, so why shouldn't junglers be able to buy a mana item their first back? Runic Echoes is unreasonable for this purpose because it doesn't give enough mana for teamfighting, and it also favors champions that have strong early games which is exclusively Elise, Nidalee, and maybe Evelyn (I really don't know if she's good early game, someone who knows her better can be a better judge of that), at least among AP junglers. Why should the jungle item heavily favor champions that are already good in the jungle?","replies":[{"poster":"loli nukes","date":"2018-03-13T18:36:51.891+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jungle Lux God,realm=NA,application-id=3ErqAdtq,discussion-id=mMhP3k7Z,comment-id=000100010002000000000000000200000001,timestamp=2018-03-13T18:08:31.698+0000)\n>\n> Elise and Nidalee are bad examples of what a mage jungler should look like since they aren&#x27;t technically mages while still having mage elements (they instead use their mage elements to fuel their intended playstyles of skirmisher and assassin, respectively). At the same time they are good examples of what a mage jungler should be balance around.\n> \n> Riot insists that AP junglers be balanced around mana gating, but Elise and Nidalee don&#x27;t have to play by those rules since half their kits are manaless, and as a result are some of the strongest AP junglers in the game&#x27;s history. We could actually see more AP junglers if Riot decided to reduce some of the mana gating that AP junglers have to deal with.\n> \n> Riot should look at laning AP&#x27;s for inspiration. Laning AP&#x27;s can buy a mana item their first back, so why shouldn&#x27;t junglers be able to buy a mana item their first back? Runic Echoes is unreasonable for this purpose because it doesn&#x27;t give enough mana for teamfighting, and it also favors champions that have strong early games which is exclusively Elise, Nidalee, and maybe Evelyn (I really don&#x27;t know if she&#x27;s good early game, someone who knows her better can be a better judge of that), at least among AP junglers. Why should the jungle item heavily favor champions that are already good in the jungle?\nI dont know if mana gating should be something used in the jungle anymore, as you said champs like elise and nid don have much mana costs, and eve has a refunded ability on the ability used to proc her w. My guess is mana costs for champs that would be the \"mage jungler\" are just not too well designed, I don't feel itemization is the issue anymore. As riot said they r looking at the regen for junglers, but I think it might be more champs kit are not suited enough to jungling all the time. I think riot and the community need to talk about mage junglers (specifically who would that include) and whether they would want to change part of their kits in order to make them work in the jungle, and if that would affect their play in other places. Fiddlesticks is obv the best champ to be a mage jungler, and as a lot of people agree, needs some type of a rework. I think itemization for aps now is relatively good and options like rylais morellos lich liandrys spellbinders dcap void zhon and banshees r in pretty good spots and have situational uses based on game/champ.","replies":[{"poster":"Jungle Lux God","date":"2018-03-13T18:53:53.981+0000","up_votes":1,"down_votes":0,"body":"It's possible that a good number of champions don't have good kits for jungling, but there are others that do have good kits for jungling but don't have good itemization for the jungle because their jungle item is tuned around being a mana item while also not functioning as a real mana item the way laning AP's have their mana items. \n\nAs a result, these AP champions need to spend the money and power budget for 2 mana items when they should only be spending money and power budget on 1 the way laning AP's do, or spend their money and power budget for 1 mana item and either not get the power spike other types of junglers do or have mana problems 5 minutes after buying your mana item (or AFK farm and not help your team, which Riot distinctly wants to avoid).\n\nIf we had a jungle AP item that didn't heavily favor the meta AP junglers and instead functioned as a real mana item, then we might have more diversity. But we don't, so we don't have any diversity.","replies":[{"poster":"loli nukes","date":"2018-03-13T20:42:41.973+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jungle Lux God,realm=NA,application-id=3ErqAdtq,discussion-id=mMhP3k7Z,comment-id=00010001000200000000000000020000000100000000,timestamp=2018-03-13T18:53:53.981+0000)\n>\n> It&#x27;s possible that a good number of champions don&#x27;t have good kits for jungling, but there are others that do have good kits for jungling but don&#x27;t have good itemization for the jungle because their jungle item is tuned around being a mana item while also not functioning as a real mana item the way laning AP&#x27;s have their mana items. \n> \n> As a result, these AP champions need to spend the money and power budget for 2 mana items when they should only be spending money and power budget on 1 the way laning AP&#x27;s do, or spend their money and power budget for 1 mana item and either not get the power spike other types of junglers do or have mana problems 5 minutes after buying your mana item (or AFK farm and not help your team, which Riot distinctly wants to avoid).\n> \n> If we had a jungle AP item that didn&#x27;t heavily favor the meta AP junglers and instead functioned as a real mana item, then we might have more diversity. But we don&#x27;t, so we don&#x27;t have any diversity.\n\nI'm just curious what champs you think could work in the jungle with this new mana item, when i think mage junglers i think things that were very niche for specific times like karthus/morg, what champs do u think could be enabled into the jungle in this mage category?","replies":[{"poster":"Jungle Lux God","date":"2018-03-13T22:20:13.258+0000","up_votes":1,"down_votes":0,"body":"Malzahar, Brand, and Morgana could potentially be really good with this new jungle items, but just about any other mages need some numbers/kit tweeks before they can actually become legitimate junglers.","replies":[]}]}]}]}]}]}]},{"poster":"Riot MapleNectar","date":"2018-03-07T21:37:43.117+0000","up_votes":5,"down_votes":2,"body":"+1 to this","replies":[{"poster":"Jmman","date":"2018-03-08T02:24:27.783+0000","up_votes":3,"down_votes":1,"body":"This is why I feel differently.  Look the \"Mages\" you agree with all Auto attack in the jungle.  Which item does {{champion:28}} {{champion:60}} {{champion:76}} start with.... \n\nLets see {{champion:76}} goes into a big kitty and autos things down sometimes castings spell but mostly Auto and skills that are mana less.\n\nNow lets look at {{champion:60}} who cast and then turns into a big spider to auto things with other little spiders auto attacking things.\n\nso the above two have a lot of Auto attacking between there instant damage spells.\n\nNext up {{champion:28}} who spams one spell mostly that has a low low low cd and auto things.\n\nAll these champs mix multiple other forums of damage with there instant spells.\n\nThen on the defense side {{champion:60}} {{champion:76}} can jump away / CC with effecting their damage to monsters.  Meaning they can save this good escape on low CD.\n\nNow lets look at fiddle.\n\nTo farm the jungle he can cast crows (only doing max damage if multiple things.  But higher mana cost makes you OOM quicker and mana regen removed). \n\n Then he can drain.  While draining he can not auto attack like the other champs.  So he has to wait 5 secs for max damage.  Now this was off set by healing.  But since riot added healing to everyone and their moms, EVERY jungler has it now.  This spell is now not efficient in the jungle anymore as the scaling life steal  auto attackers are getting.  (see jungle that are AD ganking top lane with both buff and level 3 when they are level 2)\n\nNow the other have escapes that are animations.  This allow them to live.  Fiddle's fear has an internal missle time or delayed timing.  Yes this is correct.  But since other CC / dashes can be \"qued\" they will eat the fear and jump on you.  meaning you can't get away in the jungle.  You are easy prey.  Have tried this from same house hold.  This is the only thing that would make sense.\n\nThese \"mages\" don't just stand back and not move ramping up damage over 5 secs.  They have multiple souces of damage while fiddle doesn't.\n\nThey are nothing alike at all.  'E\" then A tether for 5 secs of the damage compare to 2 instant spell jump to cat form, aa,q,aa,e,aa, back to human form spear heal are the same?!?!?!?\n\n\nare {{champion:28}} {{champion:60}} {{champion:76}} mages or two AP bruisers and an AP assassin because riot really need to \"define\" mage.  Because everything that build AP is a mage while AD has been sub classed into bruisers, divers, assassins, and marksman?  This seems a little bias doesn't it?\n\n\nedit:  nice you also plus 1 a person that has no actually games on fiddle.( well one game last season compare to a fiddle main since season 1).... this seems to be a repeating pattern I seeing.  No don't listen to people that play the champs..... listen to the arm chair QB and wonder what things aren't getting any better for them....","replies":[]},{"poster":"TeCoolMage","date":"2018-03-08T14:14:49.522+0000","up_votes":1,"down_votes":0,"body":"Tbh it's a bit late now since these AP junglers have been balanced around current jg, but monsters should've taken auto damage scaling on AP (But DoT or with static cooldown so it doesn't scale on AS), like towers do.","replies":[]},{"poster":"r4ndomkill","date":"2018-03-07T22:35:48.194+0000","up_votes":1,"down_votes":0,"body":"i feel like fiddle really suffers because his whole kit was made with a specific jungle in mind but the jungle has evolved from that point.","replies":[]},{"poster":"loli nukes","date":"2018-03-07T22:01:00.084+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Maple Nectar,realm=NA,application-id=3ErqAdtq,discussion-id=mMhP3k7Z,comment-id=0001000100020000000000000000,timestamp=2018-03-07T21:37:43.117+0000)\n>\n> +1 to this\n\nthanks, i really like that you guys r making changes to champs like fidd and quinn to sate their play-ability temporarily for the mains for just want love for their champs but vgus are needed for so many that it must feel bad for both players and designers to see a champ in like a very nonexistence or ineffective or unfun state. Keep it up and thanks for all the posts!","replies":[]}]},{"poster":"Jmman","date":"2018-03-08T02:38:17.946+0000","up_votes":2,"down_votes":1,"body":"{{champion:76}} {{champion:28}} {{champion:60}}  mages or bruisers and assassins that build AP?\n\n\nbecause I see more auto attack damage while jungle at early level than \"spell\" damage.  Can your \"mages\" still farm OOM?  Like be a cat have spiders or good/fast auto attacks.  Because fiddle attacks is really slow.  He can throw crows and stand still for 5 secs.(but you can't atuo attack during that time)\n\nLets see {{champion:76}} can trap, spear, cat form, aa, Q, aa, E, aa.\n\nIts like you picked the only ok AP champs that jungle (still not top tear or in lcs) that all have instant damage with a splash of mulple sources of damage that function ok in the jungle while oom or low mana compared to someone that has to cast for damage with the slowest, least damaging, cluckiest auto attacks and every high mana cost and said see mages are fine no worries....\n\nI have vastly different perspectives on the game atm.\n\nOH and how nice that you haven't played any games on fiddle.  Same story different day.  Nice a red can Plus 1 you of fiddle issues when neither one of you have actually played him..... nice....","replies":[{"poster":"loli nukes","date":"2018-03-08T18:56:00.321+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jmman,realm=NA,application-id=3ErqAdtq,discussion-id=mMhP3k7Z,comment-id=0001000100020000000000000001,timestamp=2018-03-08T02:38:17.946+0000)\n>\n> {{champion:76}} {{champion:28}} {{champion:60}}  mages or bruisers and assassins that build AP?\n> \n> \n> because I see more auto attack damage while jungle at early level than &quot;spell&quot; damage.  Can your &quot;mages&quot; still farm OOM?  Like be a cat have spiders or good/fast auto attacks.  Because fiddle attacks is really slow.  He can throw crows and stand still for 5 secs.(but you can&#x27;t atuo attack during that time)\n> \n> Lets see {{champion:76}} can trap, spear, cat form, aa, Q, aa, E, aa.\n> \n> Its like you picked the only ok AP champs that jungle (still not top tear or in lcs) that all have instant damage with a splash of mulple sources of damage that function ok in the jungle while oom or low mana compared to someone that has to cast for damage with the slowest, least damaging, cluckiest auto attacks and every high mana cost and said see mages are fine no worries....\n> \n> I have vastly different perspectives on the game atm.\n> \n> OH and how nice that you haven&#x27;t played any games on fiddle.  Same story different day.  Nice a red can Plus 1 you of fiddle issues when neither one of you have actually played him..... nice....\n\nThe reason I posted was not my insight that the ap/mage balance is perfect and I know every flaw of fiddle. I am just pointing out that the issue with fiddlesticks is from a lot of places like jungle changes over years, mobility creep, and the champ being outdated and having clunky gameplay. Riot has posted in the past that fiddles is on the list for vgu and I just wanted to voice that imo these changes were never made to fix fiddlesticks but to help his performance for those who play him and enjoy him till they can make a in depth attempt on him. It doesn't require 500 hours of fiddlesticks to see gameplay issues. It sucks that fiddlesticks isn't get the love he deserves right now but he will one day and that's when all the fiddle mains should step up and give in depth opinions on the champs role in the game, mechanical satisfaction, thematics and playstyle.","replies":[{"poster":"Jmman","date":"2018-03-08T20:36:04.755+0000","up_votes":1,"down_votes":0,"body":"But your list isn't Jungle mages.  They are jungle AP users.  There is NO viable jungle mage atm.  that is my issue.  But you said they are find.... Then a Red +1 you.  Do you need see the issue here.  They don't event know the difference between a mage and AP assassin.  How can you balance jungle mages if you don't know what a mage is.\n\nI disagree.  It does take a lot of hours.  Because what you think are issues really aren't once you learn different builds and the extent of the champ.  You no when you can and can't do things.  You understand the Mico play and how you spell interact with the crap coding they have.\n\nFiddles problem is he is an immobile mage with ramp up time.  Be once you get close to him you blow him up.  They have to be punished or not choosing when to attack instead of just save my CC for drain.\n\nBats bounce off him and a tether moving drain would do this.  You just have to balance it out right.  People just can't learn to walk away then re-engage.  That will also beat fiddle event with the tether and \"e\" buff I want.\n\nDrain being a tether like karma's and crows bounces off him will 100% fix the issues.  Next would be to balance the damage of both AFTER they see the effects of it.  Now when doing this we might have to revisit if the fear should be a root or slow and should crows silence.  But we need to correct his playstyle and agency then balance out the numbers.  \n\nHonest question.  Why wouldn't you listen or try to see things from someone that has 1000's of game on him.  Its like why not listen to the Doctor but instead listen to the GNC sales person.  No offense but you have only played 1 fiddle game in two seasons.  You have no clue of the \"real\" issues.  Its only what you think they are from the few times you play against him.  This would also be one extra target in lane to \"eat\" some of the damage for less farm.\n\nThis would fix fiddle while still having counter play.  But instead we need to buff {{champion:29}} not like he can go bot or jungle and have a better win rate and higher tiered champ.....\n\nedit: i'm waited since season 4 for this \"love\" that never has happened.  Just repeated nerfed and indirect nerfs.  I doubt they remember he is still a champ.  Added surprise party Amumu in that picture.... much have forgot fiddle has a surprise party skin too.","replies":[{"poster":"loli nukes","date":"2018-03-08T21:20:19.395+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jmman,realm=NA,application-id=3ErqAdtq,discussion-id=mMhP3k7Z,comment-id=000100010002000000000000000100000000,timestamp=2018-03-08T20:36:04.755+0000)\n>\n> But your list isn&#x27;t Jungle mages.  They are jungle AP users.  There is NO viable jungle mage atm.  that is my issue.  But you said they are find.... Then a Red +1 you.  Do you need see the issue here.  They don&#x27;t event know the difference between a mage and AP assassin.  How can you balance jungle mages if you don&#x27;t know what a mage is.\n> \n> I disagree.  It does take a lot of hours.  Because what you think are issues really aren&#x27;t once you learn different builds and the extent of the champ.  You no when you can and can&#x27;t do things.  You understand the Mico play and how you spell interact with the crap coding they have.\n> \n> Fiddles problem is he is an immobile mage with ramp up time.  Be once you get close to him you blow him up.  They have to be punished or not choosing when to attack instead of just save my CC for drain.\n> \n> Bats bounce off him and a tether moving drain would do this.  You just have to balance it out right.  People just can&#x27;t learn to walk away then re-engage.  That will also beat fiddle event with the tether and &quot;e&quot; buff I want.\n> \n> Drain being a tether like karma&#x27;s and crows bounces off him will 100% fix the issues.  Next would be to balance the damage of both AFTER they see the effects of it.  Now when doing this we might have to revisit if the fear should be a root or slow and should crows silence.  But we need to correct his playstyle and agency then balance out the numbers.  \n> \n> Honest question.  Why wouldn&#x27;t you listen or try to see things from someone that has 1000&#x27;s of game on him.  Its like why not listen to the Doctor but instead listen to the GNC sales person.  No offense but you have only played 1 fiddle game in two seasons.  You have no clue of the &quot;real&quot; issues.  Its only what you think they are from the few times you play against him.  This would also be one extra target in lane to &quot;eat&quot; some of the damage for less farm.\n> \n> This would fix fiddle while still having counter play.  But instead we need to buff {{champion:29}} not like he can go bot or jungle and have a better win rate and higher tiered champ.....\n> \n> edit: i&#x27;m waited since season 4 for this &quot;love&quot; that never has happened.  Just repeated nerfed and indirect nerfs.  I doubt they remember he is still a champ.  Added surprise party Amumu in that picture.... much have forgot fiddle has a surprise party skin too.\n\nSo I'm starting to understand the issue here and thats the idea of fiddlesticks and what a \"jungle mage\" should be. I personally believe elise and nidalee are extremely mage like and would classify them in the category if that did exist, which the category of jungle mage doesnt really exist. This is a way huger talk about opening the jungle to the class being high end viable through champs like fiddle, morg, zyra, karthus (naming the view that have been played or have wanted to be played) and changing parts of their kits to make them work and significantly succeed in the jungle. However the idea that fiddlestick should be the forefront designed and iconic jungle mage is something i can agree with as an outsider, but he is still in the line with all the other vgu champs.As i said, all i said is fiddlesticks was hurt severely in several years past because things like raptor camp having more raptors and krugs having smaller krugs, or the removal of spirit of the spectral wraith and being replaced with items like runeglaive which didn't help him. As well as vision changes, plant changes, more dashes to escape his ult. His kit is also very old and feels clunky when i do play him ( i don't play him as much because he feels outdated and enjoy other champs more). These are things I can say from my experience, but I am not commenting on a fiddlesticks specific solution or what fiddlesticks needs in the future in terms of rework. What I am saying is that the changes were to help current state (not fine fiddle) as compensation till real work can be made. But this comes to the biggest issue people having been having with similar changes to champs in states like fiddle. People want specific champs reworked before other based on the roles they play, the champs they main, etc. and will always want those first. Seeing champs that are less problematic get reworks before your personal desired reworked champ sucks and makes people very annoyed. But riot has said that when it comes to reworks tons of factors come in and they do not want to mess up a champion's identity or playstyle by rushing a champ to just rush it. There have been 2 champs that they wanted to give work to for being problematic and they didnt truly reach that leaving issues in playstyle to the people who play those champs which are le blanc and rengar.  The goal of every rework know is it seems they truly want to make champs reach their thematic and gameplay fantasies in the modern state, instead of fixing the \"worst off\" champions, which seems unfair to some, i agree, but its the way riot decided to make the best reworked champions they can possibly make. Does aatrox/irelia/akali/swain need the vgu/gu update work as much as champs like fiddle morde nunu shaco, etc. Possibly not, but they feel these were the best ones in current times and with current efforts they could execute on and while it sucks with champs sitting in terrible states for years (wukong being one of my personal ones i wish was updated [especially ever since they canceled any hopes of a diver rework]) its the cost the game faces. It is extremely frustrating to the champions players and the game designers, but in reality every champion needing a rework cannot be reworked today, and thats a frustration players must voice, but also understand riots difficult position.","replies":[]}]}]}]}]}]},{"poster":"MuffledGarbage","date":"2018-03-08T16:52:48.949+0000","up_votes":1,"down_votes":0,"body":"The one \"Crow bounce off of Fiddlesticks\" change seemed like a good idea from a while ago, what was wrong with it?\n\nBuggy?\n\nDidn't feel right?","replies":[{"poster":"Jmman","date":"2018-03-08T20:53:23.243+0000","up_votes":1,"down_votes":0,"body":"\"seems\" like it would do too much damage.  Never saw it on the PBE to see the damage and if there is issues.  Scraped before it made it.... then they put Zoe on it.... Riot honestly doesn't have a clue on Mage balance.  (Because every that uses AP is a mage to them apparently.)  I think they are ok on AD (broke down into sub classes to make it easier to manage)  just can't fine tune Tanks because of damage creep issues.  (they do too much damage or are blown up too fast.)\n\nThis and make drain tether like karma where you can move would fix him.  You just might have to fine tune the numbers in AFTER you see the effects and counter play to it.","replies":[]}]},{"poster":"Death by Glamour","date":"2018-03-07T23:50:08.404+0000","up_votes":1,"down_votes":0,"body":"You kinda buffed support fiddle by nerfing his waveclear","replies":[]}]}]},{"poster":"Doozku","date":"2018-03-07T18:11:56.416+0000","up_votes":2,"down_votes":0,"body":"Meh, people can call them what they want. I just don't want to read the next patch notes and see \"we are gonna be burfing on a ton of champions this patch!\"","replies":[]}]},{"poster":"Ashen Rider","date":"2018-03-07T15:52:58.021+0000","up_votes":16,"down_votes":2,"body":"> [{quoted}](name=Doozku,realm=NA,application-id=3ErqAdtq,discussion-id=mMhP3k7Z,comment-id=0001,timestamp=2018-03-07T14:51:52.315+0000)\n>\n> Berfs? I really don&#x27;t like that term. Can we call them neutral changes? \n\nThat's unfortunate, as I _REALLY_ like it","replies":[{"poster":"Doozku","date":"2018-03-07T16:00:28.612+0000","up_votes":5,"down_votes":9,"body":"Burfs sounds like burps or barfs which makes it sound really nasty for me and also gives it a negative connotation when it's supposed to be neutral. It would better if it meant buffs disguised as nerfs (which is extremely rare).","replies":[{"poster":"ZackTheWaffleMan","date":"2018-03-07T16:05:27.511+0000","up_votes":13,"down_votes":1,"body":"Perhaps they should be called nuffs.","replies":[{"poster":"Doozku","date":"2018-03-07T17:06:22.804+0000","up_votes":6,"down_votes":1,"body":"Snuffs? Thats even worse now xd","replies":[]},{"poster":"It Hertz When IP","date":"2018-03-07T16:33:54.014+0000","up_votes":2,"down_votes":1,"body":"As in, \"Y'all had 'nuff?\"","replies":[]}]}]}]},{"poster":"DeathBurst","date":"2018-03-07T18:11:03.914+0000","up_votes":2,"down_votes":0,"body":"I suggest \"tweaks\" or \"shifts\". \"Neutral\" is a bit too absolute of a word, implying the power level didn't change at all.","replies":[]},{"poster":"Disembark","date":"2018-03-08T04:29:06.290+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Doozku,realm=NA,application-id=3ErqAdtq,discussion-id=mMhP3k7Z,comment-id=0001,timestamp=2018-03-07T14:51:52.315+0000)\n>\n> Berfs? I really don&#x27;t like that term. Can we call them neutral changes? \n> \n> Also I&#x27;d say this post can be pretty manipulative. I know that this isn&#x27;t your intention but this feels like a statement on power creep which makes it really manipulative when you don&#x27;t look at what kind of changes are actually being made, and what champions are being looked at. Just off the top of my head, Rengar was one of the champions receiving a damage buff but only because his ratios were thrashed on pbe prior to release to make sure that he wasn&#x27;t op but he ended up being really bad.\n\nNot to mention this is legit for one patch. Why doesn’t he do this for every patch of season 7? Riot nerfs a fuck ton more than they buff. \n\nDon’t believe me? All of the patch data is out there.","replies":[{"poster":"RocketRelm","date":"2018-03-08T04:51:44.948+0000","up_votes":1,"down_votes":0,"body":"5 patches, actually. The 8.1-8.4 data is in the link in the OP, but I'll grab the relevant image for below.\n\nAlso, the reason I haven't done S7 yet is because a full season takes an assload of time and effort. It takes several minutes to do each patch, and a whole season of 20+ patches means we're talking a 2-3 hour endeavor, maybe more.  I may wind up doing that eventually, just not right now.\n\n\nhttps://i.imgur.com/7kR6cto.jpg?noredirect","replies":[]}]},{"poster":"RocketRelm","date":"2018-03-08T02:41:20.514+0000","up_votes":1,"down_votes":0,"body":"Neutral Change doesn't fit into the little bar I have in the table, and \"Neutral\" isn't as specific and may need an outside-the-bar explanation.\n\nAs for the Rengar thing, I make a special note of the oddity of the \"Rengar\" changes in my link to the data earlier in the season, so I'm not trying to *obfuscate* that.","replies":[]}]},{"poster":"Mast3rMahan","date":"2018-03-07T18:35:23.882+0000","up_votes":6,"down_votes":0,"body":"The problem is this doesn't provide context for anything. There are things like Swain who needed buffed because he was released weak, twitch got hit too hard last nerf, etc. So according to this system, 2 buffs could = 1 nerf. Context matters.","replies":[]},{"poster":"Late For Tea","date":"2018-03-07T14:57:12.343+0000","up_votes":8,"down_votes":7,"body":"Powercreep at its finest","replies":[{"poster":"Spank the Fox","date":"2018-03-07T15:38:11.826+0000","up_votes":7,"down_votes":3,"body":"Well, not necessarily.\n\nFor example, Twitch is still a net nerf over the last two patches compared to 8.3 and prior.\n\nZoe is another one who overall has been net nerfed (gutted) and tried to be brought up back to neutral.\n\nA number plot for a single patch does not show a trend nor the quality of changes that have occured. In fact, this tells us next to nothing since it puts every buff and nerf in the same magnititude, when they are not.","replies":[]}]},{"poster":"Velzard of Koz","date":"2018-03-07T17:33:43.080+0000","up_votes":4,"down_votes":1,"body":"While I appreciate you taking the time, there is quite little actual knowledge we can derivate from this. Buffs and nerfs must be judged by how massive they are.\n\nExample: We nerf literally all champions in one patch. That's nearly 200 nerfs. But If the nerf is -0.01 Max Health from everyone, that's not really going to have that strong impact. Then you simply add +40 MS to Boots. It's one buff. But how massively will it change the game? This way you could say there were 200 nerfs versus 1 buff, yet you get the picture of how the buff is the only relevant change that adds to the powercreep.\n\nMore realistic example: You nerf Twitch by decreasing his E's per stack damage by 10, nerf Vayne by decreasing her Initial Base Attack Damage by 5, nerf Vi by decreasing her Q's base damage by 50, buff Galio by decreasing his ult's CD by 40 seconds. What can we judge from this? Were these the masive nerfs people ask for? Or will the buff to Galio overshadow them and put oil into the powercreep? Who got hurt more, Twitch by losing burst that requires stacking, or Vayne losing total net damage she can accumulate over average period of time with her basic attacks? Is simple 3 nerfs versus 1 buff useful information?\n\nI'm writing this as expansion to what others said and as food for thought to be considered, but not to discourage you from proceeding to post these, they may still hold some value from certain point of view.","replies":[]}]}