{"poster":"Amon19","date":"2015-12-17T14:40:40.596+0000","title":"Solucion a \"pvp.net patcher kernel dejó de funcionar\"","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Al parecer muchos han tenido problemas al iniciar la descarga del lol {{item:3151}}  ya que aparece este error al iniciarlo\r\nintente muchas formas de solucionarlo y lo unico que me funciono fue INSTALAR HOTSPOT SHIELD.\r\n\r\nhttp://www.hotspotshield.com/es\r\n\r\nen mi caso, el problema era que vtr no me dejaba tener acceso a la descarga del launcher\r\nespero les sirva de algo\r\n\r\nSaludos {{summoner:4}}","replies":[{"poster":"gamaxd","date":"2016-02-11T16:13:04.060+0000","up_votes":1,"down_votes":0,"body":"Wena cabros aquí les dejo mi solución al problema.... porque no me sirvió el Hotspotshield (nose que sucede xd pero no lo podia instalar) y no tenia tampoco net en el celular, solo el router de VTR ... buscando y buscando porque cada mes me pasaba algún problema y me daba la lata de intentar solucionarlo con todos los foros del mundo  (hasta los de taringa asdfasdfasdf.... y hasta llegue a este: que era el VTR MARDITO el problema) \n\nDesintalando-compatibilidad-borrando, aunque independiente igual lo podía solucionar cada mes, siempre tiritaba en cada actualización ya que nuevamente me salia este ERROR del mal: PVP.net Patcher Kernel dejo de funcionar.\n\nya para hacerla corta encontré este vídeo hizo mi día mas feliz: \nhttps://www.youtube.com/watch?v=BaPrRj0ZSBg  \nAunque es del año del ojete!! me funciono a mi con windows 10 en la actualización 6.3 {{champion:245}} \n\nSaludos invocadores y que tengan un buen día :D\nSorry la redacción pero me fue mal en lenguaje (castellano) en el liceo xD\nOjala le funcione!! {{item:3136}} {{item:2050}} {{item:3187}}   \npdt: Su cajita de regalo xD","replies":[]},{"poster":"quityelmejor13","date":"2015-12-17T16:20:02.914+0000","up_votes":1,"down_votes":0,"body":"tambien tengo vtr y no me deja logearme o ingresar al launcher sin otengo activo el hotspot xd","replies":[{"poster":"Darknice34","date":"2015-12-17T19:43:21.233+0000","up_votes":1,"down_votes":0,"body":"Da mucho ping el hotspot shield o no?","replies":[]}]},{"poster":"Baall","date":"2015-12-17T16:54:33.373+0000","up_votes":1,"down_votes":0,"body":"que es vtr ?? porque yo tengo problemas tambien para la actualizacion pero no se que es eso..","replies":[]}]}