{"poster":"HateDaddy","date":"2016-08-22T18:56:59.376+0000","title":"I appreciate Gangplank nerfs and we all agree something needs to be done..","subforum":"Gameplay","up_votes":109,"down_votes":18,"body":"But I still completely disagree with these nerfs. You&#039;re just going to keep nerfing him until his cooldowns are too high, his mana costs are too high and his base damages are too low. You&#039;ll basically be doing exactly what you did to old GP during meta golem where you kept constantly nerfing him. The difference is, I don&#039;t think he needs these nerfs. It won&#039;t change anything, he will still be picked in almost every competitive game. \r\n\r\nI play GP and I can tell you the biggest problems with him are his bonus gold passive on his Q and his Q applying melee bandit gold. With these two things, he farms up so much gold just by existing. Even if he&#039;s getting zoned for a wave or two, he&#039;s still collecting some gold. And that&#039;s rare a champion can do that to be honest. He can sit back and just keep a barrel behind him and clear waves this way and not interact. There&#039;s nothing that can be done about that, GP will be a safe farmer no matter what. GPs ult will provide great zone control in teamfights no matter what. GP basically already has a free ticket to late game but I don&#039;t think you should complete remove his ability to have lane presence and make him a non interactive farmer either because that playstyle is extremely unhealthy.\r\n\r\nWhat needs to be done is removing his bonus gold passive on Q and changing how his Q works with masteries like grasp and bandit, these are clearly ranged spells granting melee benefits and this shouldn&#039;t be the case. His Q&#039;s gold passive is what makes him impossible to shut down. Even when you have large leads by 2-3 kills on him, at best you&#039;re slightly ahead in gold. Between his barrels, ult and orange, snowballing on GP is almost impossible. And that shouldn&#039;t be a thing for a champion that scales so hard into late game. And these nerfs don&#039;t change that, they&#039;re just going to force him to be more farm heavy and non interactive and players will feel like they can&#039;t do anything to stop the GP train from going full force late game. \r\n\r\nMake him able to actually lose a lane significantly enough that he has to consider something other than farming two waves to make back up whatever deficit he had. This would be a much better change than what you&#039;re doing right now.","replies":[{"poster":"Only Play Darius","date":"2016-08-22T19:24:23.295+0000","up_votes":48,"down_votes":2,"body":"But he's a scumbag pirate, plundering gold is central to his theme. You can't change that.","replies":[{"poster":"HateDaddy","date":"2016-08-22T19:32:33.830+0000","up_votes":8,"down_votes":30,"body":"> [{quoted}](name=Jelly Mac,realm=NA,application-id=3ErqAdtq,discussion-id=XUMEiEHo,comment-id=0003,timestamp=2016-08-22T19:24:23.295+0000)\n>\n> But he&#x27;s a scumbag pirate, plundering gold is central to his theme. You can&#x27;t change that.\n\nthat's literally not his theme anymore","replies":[{"poster":"Hawkefire","date":"2016-08-22T20:04:12.243+0000","up_votes":29,"down_votes":2,"body":"No, it literally is his theme.","replies":[{"poster":"HateDaddy","date":"2016-08-22T20:33:46.426+0000","up_votes":11,"down_votes":13,"body":"> [{quoted}](name=Hawkefire,realm=NA,application-id=3ErqAdtq,discussion-id=XUMEiEHo,comment-id=000300000000,timestamp=2016-08-22T20:04:12.243+0000)\n>\n> No, it literally is his theme.\n\nHis theme is a pirate and he already plunders silver for his ult upgrade. And keeping some silly theme to contributes nothing to this game when his theme is already in tact with the rest of his kit in exchange for sacrificing good balance is a terrible idea.","replies":[{"poster":"Sahn Uzal","date":"2016-08-22T20:35:38.675+0000","up_votes":27,"down_votes":0,"body":"I mean it is a pretty big part of his theme, but sometimes, Game health needs to go before Thematic.","replies":[{"poster":"HateDaddy","date":"2016-08-22T20:54:46.274+0000","up_votes":4,"down_votes":7,"body":"> [{quoted}](name=Tidal Tyrant,realm=EUW,application-id=3ErqAdtq,discussion-id=XUMEiEHo,comment-id=00030000000000000000,timestamp=2016-08-22T20:35:38.675+0000)\n>\n> I mean it is a pretty big part of his theme, but sometimes, Game health needs to go before Thematic.\n\nhttps://m.youtube.com/watch?v=Cm0R380Bz8A\n\n~~see what I did there~~","replies":[{"poster":"Sahn Uzal","date":"2016-08-22T21:06:11.397+0000","up_votes":7,"down_votes":0,"body":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQElfX1o4vou5H9waPQCwhYjU5x7b0BMvNLh0hhvKvmpBGlfGzL\n\nOh, and what's up with the Dutch subtitels? o.o","replies":[]}]}]}]}]}]},{"poster":"ProfDrDeath","date":"2016-08-22T22:08:06.309+0000","up_votes":3,"down_votes":1,"body":"He can still have that in his Silver Serpents.","replies":[]}]},{"poster":"Sire Hippington","date":"2016-08-22T19:53:01.539+0000","up_votes":21,"down_votes":2,"body":"I agree with the Gold gain nerfs, but i disagree with the statement that his current nerfs are wrong.\nThe nerfs hit exatly where they should.\nHis early laneing gets less safe, between the higher mana costs on W and less base hp, you get more kill potential vs him, allowing to excert more early pressure against Gp.\nEven without his extra gold, a well played GP would still be incredible safe becuase he can farm from range, gets good wavecontroll once trinity is completed and has his nope oragnes. Makeing his early a bit weaker goes hand in hand with your idea of lowering the 'free' gold he gets to make early advantages more meaningfull.\nAnd the Ult nerf is really needed. That ult is absurd, and one of the main balance issues. There are other lategamescaleing champs that are decently save in lane and reliably reach their lategame point, but they sacrifice map preasure for it.\nGp has more map preasure than nearly any other champ in the early, without ever stopping to farm his lane for it. That ult on an lategame hyperscaler is just insane as it gives him so much impact even early in the game as he can deter dives on him, win many 1v1 all-ins with it, prevent crossmap plays and even creat crossmap plays.\nAll without ever leaving his lane.\nIt's just an instant fully global ult, and that's imo rather bad design, there is little to counter it. Other globals are either skillshots, have some other form of delay or are only semi-global, so you won't reach from top to bot. Karthus is BS aswell, but he atleast has 3 sec channle that can be interupted by death or hard CC.\nBut GPs ult has some meaningfull impactpac on any point of the map the very moment he presses the button, you can't avoid that first cluster at all, and hardly the second if it's centered on you, and 2 clusters already are amongst the highest basedamage for ults in the game(300 at rank 6+evt thunderlords)\n\nWithout the ult-nerf, GP would remain a monster, he might need slightly longer ti reach his mid-lategame powerspikes, but as long as his ult grants as much earlygame impact, that doesn't matter at all.","replies":[{"poster":"HateDaddy","date":"2016-08-22T20:46:22.919+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Don Cingulum,realm=EUW,application-id=3ErqAdtq,discussion-id=XUMEiEHo,comment-id=0009,timestamp=2016-08-22T19:53:01.539+0000)\n>\n> I agree with the Gold gain nerfs, but i disagree with the statement that his current nerfs are wrong.\n> The nerfs hit exatly where they should.\n> His early laneing gets less safe, between the higher mana costs on W and less base hp, you get more kill potential vs him, allowing to excert more early pressure against Gp.\n> Even without his extra gold, a well played GP would still be incredible safe becuase he can farm from range, gets good wavecontroll once trinity is completed and has his nope oragnes. Makeing his early a bit weaker goes hand in hand with your idea of lowering the &#x27;free&#x27; gold he gets to make early advantages more meaningfull.\n> And the Ult nerf is really needed. That ult is absurd, and one of the main balance issues. There are other lategamescaleing champs that are decently save in lane and reliably reach their lategame point, but they sacrifice map preasure for it.\n> Gp has more map preasure than nearly any other champ in the early, without ever stopping to farm his lane for it. That ult on an lategame hyperscaler is just insane as it gives him so much impact even early in the game as he can deter dives on him, win many 1v1 all-ins with it, prevent crossmap plays and even creat crossmap plays.\n> All without ever leaving his lane.\n> It&#x27;s just an instant fully global ult, and that&#x27;s imo rather bad design, there is little to counter it. Other globals are either skillshots, have some other form of delay or are only semi-global, so you won&#x27;t reach from top to bot. Karthus is BS aswell, but he atleast has 3 sec channle that can be interupted by death or hard CC.\n> But GPs ult has some meaningfull impactpac on any point of the map the very moment he presses the button, you can&#x27;t avoid that first cluster at all, and hardly the second if it&#x27;s centered on you, and 2 clusters already are amongst the highest basedamage for ults in the game(300 at rank 6+evt thunderlords)\n> \n> Without the ult-nerf, GP would remain a monster, he might need slightly longer ti reach his mid-lategame powerspikes, but as long as his ult grants as much earlygame impact, that doesn&#x27;t matter at all.\n\nI agree that his ult needs nerfed, I don't even necessarily question all of these nerfs because what you're saying is absolutely correct. But I don't think this is going to change a thing because he's still going to afk farm and be ahead by virtue of being able to farm simply because of his Q passive. And I think ultimately, good changes would be to take away global range on his ults first two ranks and remove his passive gold gain. I think these two changes would be much more meaningful nerfs and you wouldn't have to keep hitting his kits numbers. Because I promise you, this won't change shit.","replies":[]}]},{"poster":"Requiemsfire","date":"2016-08-22T19:41:39.612+0000","up_votes":18,"down_votes":0,"body":"Currently there are two types of gangplanks I encounter in lane.\n\n1) One who is aggressive and chips a third of my health away with his barrels\n\n2) passive as fuck Gangplank using his barrels to farm and impossible to punish for basic mistakes using oranges to sustain himself for a bit longer and cleanse any kind of CC. He eventually becomes gangplank no.1. ","replies":[]},{"poster":"YoungFarmer","date":"2016-08-23T02:06:02.035+0000","up_votes":9,"down_votes":0,"body":"Imo I never really find getting hit by a barrel for 1200 damage very fun or fair, considering how spam able they are","replies":[{"poster":"Malicious Metal","date":"2016-08-23T07:29:21.191+0000","up_votes":6,"down_votes":0,"body":"Meet {{champion:82}} \n1200 damage Q's every 3 seconds.","replies":[{"poster":"lil koda","date":"2016-08-23T09:00:14.080+0000","up_votes":2,"down_votes":0,"body":"yo metal, iv been wanting to play mord top for a while but everytime i play him i feed my ass off will you just start streaming/youtube or someshit i bet a lot of people would enjoy watching mord 1 trick... heck we even watch tobias fate","replies":[{"poster":"Apocyliptic","date":"2016-08-23T19:18:55.504+0000","up_votes":1,"down_votes":0,"body":"I have a stream, not that I'm going to name I because of rules and what not, but I play exclusively mordekaiser and Rengar if you ever want to check it out. I smurf in Bronze/Silver/Gold regularly. Also, TastyPotatoX or something is a high elo mordekaiser streamer, though he plays a lot of other top lane picks as well.","replies":[]}]},{"poster":"Lovelle","date":"2016-08-24T15:26:01.672+0000","up_votes":1,"down_votes":0,"body":"I never enjoy playing against him.","replies":[]}]}]},{"poster":"YCitizenSnipsY","date":"2016-08-22T23:48:32.755+0000","up_votes":1,"down_votes":10,"body":"\" It won't change anything, he will still be picked in almost every competitive game. \"\n\nHe hasn't been a popular pick in Solo queue since his rework and he hasn't been a meta pick in pro play since last worlds. Where in gods name do you get the idea this is true?","replies":[{"poster":"HateDaddy","date":"2016-08-23T00:13:04.293+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=YCitizenSnipsY,realm=NA,application-id=3ErqAdtq,discussion-id=XUMEiEHo,comment-id=0010,timestamp=2016-08-22T23:48:32.755+0000)\n>\n> &quot; It won&#x27;t change anything, he will still be picked in almost every competitive game. &quot;\n> \n> He hasn&#x27;t been a popular pick in Solo queue since his rework and he hasn&#x27;t been a meta pick in pro play since last worlds. Where in gods name do you get the idea this is true?\n\nlmfao","replies":[{"poster":"YCitizenSnipsY","date":"2016-08-23T00:53:54.562+0000","up_votes":1,"down_votes":4,"body":"http://lol.esportswikis.com/wiki/Gangplank/Statistics/2016 \nHighest amount of picks in a single split is 53 in Korea. That's 53 picks across ten teams that play Bo3 all split. No other region even used him near that much and that is hilariously low. Picked a single time at one major tournament this year. \n\nhttp://lol.esportswikis.com/wiki/Trundle/Statistics/2016\nhttp://lol.esportswikis.com/wiki/Poppy/Statistics/2016\nCompare that to Trundle and Poppy's usage this year. \n\n\nhttp://www.leagueofgraphs.com/champions/stats/gangplank\nIn solo que he averaged under a 10% pick rate for most of the year. Not really high priority.","replies":[{"poster":"HateDaddy","date":"2016-08-23T01:06:14.238+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=YCitizenSnipsY,realm=NA,application-id=3ErqAdtq,discussion-id=XUMEiEHo,comment-id=001000000000,timestamp=2016-08-23T00:53:54.562+0000)\n>\n> http://lol.esportswikis.com/wiki/Gangplank/Statistics/2016 \n> Highest amount of picks in a single split is 53 in Korea. That&#x27;s 53 picks across ten teams that play Bo3 all split. No other region even used him near that much and that is hilariously low. Picked a single time at one major tournament this year. \n> \n> http://lol.esportswikis.com/wiki/Trundle/Statistics/2016\n> http://lol.esportswikis.com/wiki/Poppy/Statistics/2016\n> Compare that to Trundle and Poppy&#x27;s usage this year. \n> \n> \n> http://www.leagueofgraphs.com/champions/stats/gangplank\n> In solo que he averaged under a 10% pick rate for most of the year. Not really high priority.\n\nHe's pick/ban in all regions right now in the playoffs. He's also got a 15% total playrate with a 30% banrate in plat+\n\nThat's hardly unpopular","replies":[{"poster":"YCitizenSnipsY","date":"2016-08-23T01:08:37.473+0000","up_votes":1,"down_votes":5,"body":"And if they nerf him he will go right back to being unpopular like he has been most of the year. You made it sound like he is Rek'sai or Gragas.","replies":[{"poster":"HateDaddy","date":"2016-08-23T01:10:07.204+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=YCitizenSnipsY,realm=NA,application-id=3ErqAdtq,discussion-id=XUMEiEHo,comment-id=00100000000000000000,timestamp=2016-08-23T01:08:37.473+0000)\n>\n> And if they nerf him he will go right back to being unpopular like he has been most of the year. You made it sound like he is Rek&#x27;sai or Gragas.\n\nI didn't make it sound like anything. But he's constantly been nerfed this entire season and he still reemerge as a strong pick. Clearly they aren't nerfing him the right way.","replies":[]}]}]}]}]}]},{"poster":"Sahn Uzal","date":"2016-08-22T19:08:25.459+0000","up_votes":1,"down_votes":0,"body":"I personally think changing his barrel-lifetime to 20/30/40/50/60 from 60 at all ranks would do a great job at balancing him aswell.","replies":[{"poster":"HateDaddy","date":"2016-08-22T19:33:11.373+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Tidal Tyrant,realm=EUW,application-id=3ErqAdtq,discussion-id=XUMEiEHo,comment-id=0001,timestamp=2016-08-22T19:08:25.459+0000)\n>\n> I personally think changing his barrel-lifetime to 20/30/40/50/60 from 60 at all ranks would do a great job at balancing him aswell.\n\nI'm not sure that accomplishes much tbh\n\nHe rarely hits anyone with randomy scattered barrels and the by the time one dies, he'd basically have a full inventory of barrels again","replies":[]}]},{"poster":"ThugWalrus","date":"2016-08-22T21:02:43.687+0000","up_votes":6,"down_votes":1,"body":"Hmm I disagree. Honestly no matter what you do, GP will always have the same play style (sitting on barrels, Q'ing the wave, and generally not fighting), and taking away the gold won't change that, so it doesnt solve the problem of interactivity.\n\nAs a Gangplank main, my opinion is that it is his game stalling techniques that are the problem. I think this contributes to what you call a \"free ticket to late game.\" What I mean by this is his ability to 1-shot casters and 2-shot the whole wave after trinity. This severely limits the opportunity for tower-dives or just pressuring him under the turret, forcing you to try and freeze, but then he just farms safely from a distance anyway. It also makes Gangplank an effective counter to split-pushers like Trynd or Fiora who like to push waves in and then tower-dive, as he can stop them from getting to the tower at all.\n\nThis is not an easy problem to fix except by just straight up **making barrels do reduced damage to minions**. This would force him to farm individually with Q and melee autos more often when he's frozen out or forced under turret. Conversely he could use multiple barrels to clear the wave, which diminishes his ability to escape as he has less barrels on hand. It also gives incentive to use barrels against champs to try and whittle them down instead of just clearing the wave and running away because now he has to hang around the wave longer if he's being frozen out for example. Hopefully they could find a number where come late-game he is still able to siege and defend properly (he is a late-game champ after all), but make it so if he's behind to a strong laner in mid game he can't just blow up waves and run away. \n\nHonestly this might be totally wacky and nonsensical, but it's just my 2 cents as a guy who plays a ton of GP.","replies":[{"poster":"HateDaddy","date":"2016-08-22T21:09:34.219+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=ThugWalrus,realm=NA,application-id=3ErqAdtq,discussion-id=XUMEiEHo,comment-id=000b,timestamp=2016-08-22T21:02:43.687+0000)\n>\n> Hmm I disagree. Honestly no matter what you do, GP will always have the same play style (sitting on barrels, Q&#x27;ing the wave, and generally not fighting), and taking away the gold won&#x27;t change that, so it doesnt solve the problem of interactivity.\n> \n> As a Gangplank main, my opinion is that it is his game stalling techniques that are the problem. I think this contributes to what you call a &quot;free ticket to late game.&quot; What I mean by this is his ability to 1-shot casters and 2-shot the whole wave after trinity. This severely limits the opportunity for tower-dives or just pressuring him under the turret, forcing you to try and freeze, but then he just farms safely from a distance anyway. It also makes Gangplank an effective counter to split-pushers like Trynd or Fiora who like to push waves in and then tower-dive, as he can stop them from getting to the tower at all.\n> \n> This is not an easy problem to fix except by just straight up **making barrels do reduced damage to minions**. This would force him to farm individually with Q and melee autos more often when he&#x27;s frozen out or forced under turret. Conversely he could use multiple barrels to clear the wave, which diminishes his ability to escape as he has less barrels on hand. It also gives incentive to use barrels against champs to try and whittle them down instead of just clearing the wave and running away because now he has to hang around the wave longer if he&#x27;s being frozen out for example. Hopefully they could find a number where come late-game he is still able to siege and defend properly (he is a late-game champ after all), but make it so if he&#x27;s behind to a strong laner in mid game he can&#x27;t just blow up waves and run away. \n> \n> Honestly this might be totally wacky and nonsensical, but it&#x27;s just my 2 cents as a guy who plays a ton of GP.\n\nI don't think it's that wacky. My concern with this is taking away his ability to shove or counter shove waves and you might go from one extreme to another where he's forced to sit under tower all day because he can't push very well. I don't think that's the right answer.","replies":[{"poster":"ThugWalrus","date":"2016-08-22T21:14:28.306+0000","up_votes":4,"down_votes":0,"body":"That might be true. My thoughts were that it just exposes him to dives from champions he should be weak to (Riv,Fiora,Renek) who have less of an opportunity to get at him normally because they have no minions. I also know from experience that if I'm losing lane to a Riven or something and they freeze me out, I will blow up the wave from a screen away (unfreezing the wave) and just back for free. I mean if I had my way, we would never nerf GP, but I just think specifically this is what I abuse when I play him.","replies":[{"poster":"HateDaddy","date":"2016-08-22T22:10:03.834+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ThugWalrus,realm=NA,application-id=3ErqAdtq,discussion-id=XUMEiEHo,comment-id=000b00000000,timestamp=2016-08-22T21:14:28.306+0000)\n>\n> That might be true. My thoughts were that it just exposes him to dives from champions he should be weak to (Riv,Fiora,Renek) who have less of an opportunity to get at him normally because they have no minions. I also know from experience that if I&#x27;m losing lane to a Riven or something and they freeze me out, I will blow up the wave from a screen away (unfreezing the wave) and just back for free. I mean if I had my way, we would never nerf GP, but I just think specifically this is what I abuse when I play him.\n\nI definitely agree that this can be problematic but I think the alternative is worse unfortunately","replies":[]}]}]}]},{"poster":"Apocalypsic","date":"2016-08-22T19:38:34.544+0000","up_votes":6,"down_votes":1,"body":"My thoughts are still the bonus damage and still quite significant free armor shred on a mechanic that GP can essentially make unavoidable are the reason he's broken.   (Or at the very least way too big for his own britches currently)\n\nHis gold Passive and GP spamming gold gain in general has historically never really been a game breaking issue, even when it was strong.","replies":[{"poster":"HateDaddy","date":"2016-08-22T19:40:15.767+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=GaIacticCat,realm=NA,application-id=3ErqAdtq,discussion-id=XUMEiEHo,comment-id=0006,timestamp=2016-08-22T19:38:34.544+0000)\n>\n> My thoughts are still the bonus damage and still quite significant free armor shred on a mechanic that GP can essentially make unavoidable are the reason he&#x27;s broken.  \n> \n> His gold Passive and GP spamming gold gain in general has historically never really been a game breaking issue, even when it was strong.\n\nThat's because old GP sucked. This isn't old GP. \n\nI don't mind his barrels that much honestly, any way you change them won't matter unless you remove them entirely. The armor pen he gets from them is just a good way to scale but it doesn't really change much. He still just afk farms and doesn't interact even if you remove the armor pen from them.","replies":[]}]},{"poster":"WhZGALTY9O","date":"2016-08-23T15:03:09.722+0000","up_votes":4,"down_votes":0,"body":"old gangplank was one of my favorite characters, now we just have this impossible to balance shit stain.\n\nThanks ~~Obama~~ Rito","replies":[]},{"poster":"Itankyou","date":"2016-08-22T19:03:28.311+0000","up_votes":7,"down_votes":3,"body":"Well constructed post that's what I'm FUCKIN TALKIN ABOUT. Riot should Hire you on balance team {{sticker:slayer-pantheon-thumbs}} Lets get riot to think twice on GP.\n\nThe nerfs riot are suggesting would take out any fun interactions GP already has in the game and instead replaces it with farmfest. WE DON'T WANT FARM FEST WE WANT FUN RIOT PLEASE BRING BACK FUN.","replies":[{"poster":"HateDaddy","date":"2016-08-22T19:33:36.855+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Itankyou,realm=NA,application-id=3ErqAdtq,discussion-id=XUMEiEHo,comment-id=0000,timestamp=2016-08-22T19:03:28.311+0000)\n>\n> Well constructed post that&#x27;s what I&#x27;m FUCKIN TALKIN ABOUT. Riot should Hire you on balance team {{sticker:slayer-pantheon-thumbs}} Lets get riot to think twice on GP.\n> \n> The nerfs riot are suggesting would take out any fun interactions GP already has in the game and instead replaces it with farmfest. WE DON&#x27;T WANT FARM FEST WE WANT FUN RIOT PLEASE BRING BACK FUN.\n\nYou heard the man Marc Merrill\n\nMy agent will be expecting a call.","replies":[]}]},{"poster":"Dessem","date":"2016-08-23T10:46:23.764+0000","up_votes":3,"down_votes":0,"body":"I think no champion should have mechanics that enable them to get extra Gold, with the exception of Draven perhaps. The thing is that getting free gold for doing something easy (farm minions in TF's case, farm with Q procs in GP's case) is just a bunch of hidden power that's hard to gauge by the opponent. I'm never quite sure just how much extra Gold TF has, for example. GP's is a bit more trackable since you can keep an eye on his Silver Serpent stash, but even there it shows that he's easily getting a Gold lead on anyone unless you have a significant CS advantage.\n\nIn GP's case I am more worried over his lane pattern, though. He basically is weak to all-in (even there, oranges help mitigate being caught out) but his barrel mechanic allows him to stand in Africa and still effectively farm due to the large range. He gets a movement speed bonus to boot, so trading with him after he blows a barrel on you becomes a tough sell due to his movement speed bonus and your movement speed penalty.\n\nI think rather than his ult damage, I'd rather see the ult size nerfed. It's such a huge circle for an untelegraphed global ult, and it effectively zones the entire enemy team. Therein lies his ult's problem: Rumble's Equaliser is hailed as a great zoning tool, but Gangplank's ultimate is far easier to land and can be used from anywhere on the map.\n\nI always ban Gangplank when I can simply because I am not good enough at ADC to handle his cannon barrage allowing Leona's easy engages.","replies":[{"poster":"Teridax68","date":"2016-08-24T00:34:14.650+0000","up_votes":1,"down_votes":0,"body":"I agree with this, gold generation creates serious item lead problems that are difficult to balance around, especially in the laning phase. Gangplank is especially difficult to deal with because his other abilities allow him to play with more safety than many other top laners, which goes back to his old issues of eking out lane victories through gold generation advantages rather than more interesting engages. While it was a nice touch to keep his plundering theme, it might be better to just cut out the gold generation portion and leave him with his Silver Serpents mechanic.\n\nI think his barrels are, in most circumstances, more or less okay, but what I especially dislike about them is how unpredictable they can be for both Gangplank and his opponent. Crit interaction could be fun, but not in an environment when crits are purely RNG-dependent, and placing so much power on what is essentially random chance screws everyone over (Gangplank can miss a juicy amount of farm simply because he didn't get the crit he needed to last-hit every minion at once, but squishies can find themselves get blown up with 1k+ crit damage barrels). I'm also not the biggest fan of their early health, which can be bypassed by Gangplank by spawning an early barrel next to him and using it to detonate subsequent ones. Not sure how this could get fixed, but revising how they get detonated and how much of a real chance opponents have at disabling them early on could also help him be less of a lane bully (taking down barrels is usually a false choice for melee champions, for example, who are much more liable to just have it detonate in their face).","replies":[{"poster":"Dessem","date":"2016-08-24T08:44:41.067+0000","up_votes":2,"down_votes":0,"body":"> his old issues of eking out lane victories through gold generation advantages rather than more interesting engages. \n\nThat's also certainly a thing. In most lanes, you have three basic states:\n\n1) You kill your opponent or have superior trades, forcing him to back and you to gain a Gold lead.\n\n2) You go even with your opponent, meaning you have similar CS and Gold values.\n\n3) You are defeated by your opponent and have a Gold disadvantage.\n\nin Gangplank's case, it's much more difficult to achieve #2, because Gangplank *naturally* has a Gold lead on you. You need to actually deny him CS in order to be on even footing with him. (Same goes with TF.) That's a ridiculous proposition: given 100 CS on both sides, neither side should have an advantage over the other for simply existing. (Mordekaiser does this with duo lanes.)","replies":[{"poster":"Teridax68","date":"2016-08-25T00:27:07.521+0000","up_votes":1,"down_votes":0,"body":"I agree, and from the looks of it these kinds of laning advantages tend to incur major dysfunctionality in other areas: back when Ashe had her income bonus on her E, she had an abysmal (and quite boring) laning phase to compensate, which ended up forcing her to farm passively. TF has a burst pattern with really low actual burst, and so mostly needs to gank other lanes at opportune moments to make use of his early gold lead. Morde is Morde, so playing him in a duo lane is pretty much punishment in itself, even with the XP bonus, and even Draven to some degree only capitalizes on his bonus gold through champion kills, which avoids the whole passive advantage aspect of bonus income but makes him more binary as a result. By contrast, Gangplank is now a pretty functional champion with the ability to do cool things in lane and scale well thereafter, so there really isn't an innate need for him to earn items faster than others, besides the flavor and pre-existence of his gold bonus. He does need an incentive to use his Q other than for poke, but Silver Serpents are already a good way to encourage that, and if nothing else he could be balanced around a weaker ult, as you mentioned, and stronger Silver Serpent-based upgrades, which would take away some of his free global power and allow him to be shut down more easily.","replies":[]}]}]}]},{"poster":"Bears eat people","date":"2016-08-24T13:21:51.145+0000","up_votes":2,"down_votes":0,"body":"Riot should just revert GP rework.","replies":[]},{"poster":"Ãelofasht","date":"2016-08-23T04:08:07.531+0000","up_votes":2,"down_votes":0,"body":"What about adding some risk to his gold gain by making the gold actually drop on the ground from his Q or Barrels, he actually has to walk out there and pick it up in order to collect it?  Then both players get interaction with his gold gain potential and making his gameplay even more interesting with barrels being set up to cover him gathering perhaps?","replies":[]},{"poster":"GrReaper96","date":"2016-08-22T22:46:41.846+0000","up_votes":2,"down_votes":0,"body":"Lets not agree his synergy of Q and E.\n1 Q + barrel = tons of gold","replies":[]},{"poster":"adidas","date":"2016-08-22T19:40:07.464+0000","up_votes":3,"down_votes":1,"body":"No.. My problem with gangplank is his Ult is such a fuckin freelo skill. The radius of it + the damage + thunderlords proc is so painful to actually see","replies":[]},{"poster":"Baron Perenolde","date":"2016-08-23T08:26:13.304+0000","up_votes":2,"down_votes":1,"body":"I just miss old Gangplank, to be honest. He wasn't exciting but his old look and kit was more fun to a less-mechanical player like myself. Now I never play him and I have all of his skins :( It feels bad.","replies":[]},{"poster":"AwesomeChad","date":"2016-08-22T19:28:30.997+0000","up_votes":2,"down_votes":1,"body":"well this is the hallmark Riot games way of handling problems. They slap a band aid on everything instead of fixing the problem right at the moment. I'm sure Gangplank will receive a rework later on in the future but until then, riot is just going to keep giving him buffs/nerfs that don't actually solve the core issue with the champion. Seems like a big waste of time how they handle problematic champions in my opinion.","replies":[]},{"poster":"Spoofghoul","date":"2016-08-22T19:27:12.000+0000","up_votes":2,"down_votes":1,"body":"as a bankplank main this would make me feel awfull\n\nthough i guess it needs to be done\n\njust leave him as he currently is and remove the gold gimmick thats all the nerf he needs","replies":[]},{"poster":"Seraphim117","date":"2016-08-24T20:06:37.244+0000","up_votes":1,"down_votes":0,"body":"How's about, gp plunders less gold for minions, but killing an enemy CHAMPION grants like 50-100 bonus gold or something, so he if he just farms he won't do very well, but if he gets a solid kill or 2 he can start to snow ball","replies":[{"poster":"Seraphim117","date":"2016-08-24T20:27:01.066+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Seraphim117,realm=NA,application-id=3ErqAdtq,discussion-id=XUMEiEHo,comment-id=0031,timestamp=2016-08-24T20:06:37.244+0000)\n>\n> How&#x27;s about, gp plunders less gold for minions, but killing an enemy CHAMPION grants like 50-100 bonus gold or something, so he if he just farms he won&#x27;t do very well, but if he gets a solid kill or 2 he can start to snow ball\n\nAnother idea is crit doesn't work in gp, rather it gives him percent bonus as scaling, like jhin, except go can't crit at all, he only gets the crit->as part of that mechanic","replies":[]}]},{"poster":"Doctor Dyment","date":"2016-08-24T08:22:20.279+0000","up_votes":1,"down_votes":0,"body":"I don't think completely removing the extra gold he gets from killing with his Q if right, but perhaps it can give him less and masteries like Bandit that allow him to get even more gold for free can be halved in power overall.","replies":[]},{"poster":"Et Tu Geddon","date":"2016-08-22T22:26:14.691+0000","up_votes":1,"down_votes":0,"body":"Only reason all these nerfs are coming is because some LCK player started playing him in the early summer LCK and bad at that ( yeah i know some played him in solo que).  That started a chain reaction which we now see in pro and solo que games.  Honestly people tell me how much Gangplank was played in the Spring split? . Come on give it too me. After the triforce change everybody stopped playing Gp then the new build came and people started picking him up because HEY hes played in LCK he got to be OP now. Well truth to be told Gp isnt more broken than any other high tier top laner in the game. His ult does alot of dmg because of thunderlords if it wasnt for that keystone his dmg output wouldnt be that high early with his ult. Also most of the Pro Gps i see are honestly bad when comparing them to people who actually know how to combo with him with a few exeptions like Huni and Soaz back in the days though. The pros only use GP as a ult bot which is proven when they almost never hit the barrel comboes and still use the champion.  ( yeah someone walking into your barrel doesnt count as hitting a combo btw and if someone tells me that  a stationary target hit with a two barrel combo is pro work then meh no )  Gp getting almost perma banned in solo que is laughable and even when he is picked only a third or less of the players actually manage to become something else than ye old ult bot. TLD is actually a keystone that has made many champions very strong early and GPs ult is only one of many examples and yes i know who you want to think about {{champion:80}} . You might say that TLD is what makes champions suffer nerfs and not the champions themselves.  Why do i mention the pros you say because riot nerfs champions that mostly does well in Pro matches. I am only a silver player but i have watched alot of HIgh tier matches meaning Masters and Challengers matches and until the bad LCK Gangplank came up from the dephts almost nobody played GP unless they mained him. Nerf TLD or replace it before you start nerf every champ that synergize sometimes all to well with it thats the simplest thing to do or you might find your own champions being nerfed to the Kraken just because the early TLD dmg was too much. Btw i watched the semi between IMT and C9 sorry but the only impactfull Gp there was Hunis whos mechanism on the champion was good while the player called Impact was used as Ye old Ult bot and did not make an impact so to speak.","replies":[{"poster":"Droogzy","date":"2016-08-23T02:25:55.402+0000","up_votes":1,"down_votes":0,"body":"Champions often stop being played when they received nerfs simply because it takes time to get used to number changes behind the nerf. Not because they aren't strong. GP was still an unquestionably strong pick, but he's also has received some serious number changes in patches in which he gets attention being his barrel count and CD was adjusted among myriads of things. To bring a champion immediately that gets such a shift of power into professional play is downright illogical. \n\nRyze is another example of this. When he got his rework v2 (Not his current one), he was unquestionably the strongest top/mid laner in the game, yet you didn't see him for almost a full season. Why? Because it took professional players ages to hit the point where they had his number and combos down. The pros aren't going to play a champion whom they don't have the exact numbers down on.\n\nNot sure how you claim the pros are bad at GP when they are the ones that are the best at the game. Especially considering LCK is the undisputed hands down strongest region, player quality-wise, if a champion starts being picked and played with a build consistently in the LCK, that usually means its a strong champion. They're the ones that discover pretty much everything that everyone else plays. \n\nOften time, the meta we see in professional play is established or mimicked by the LCK. So if they start spamming a champion with a consistent build, that's usually a strong hint that said champion/build is powerful. Every pro will go to LCK/Korea before worlds for boot camp. Reason being, its the strongest region. \n\nIt's also incredibly ironic that you say Impact didn't have a contribution to the series against Immortals considering he was named the MVP of the BO5. And its also arguable that except for his one solid game on GP, Huni was the reason Immortals lost the series as he swallowed up so much of the teams resources and proceeded to tilt and play poorly with non-meta champions, deja vu to the Spring championship split.\n\nAlso, while yes, Huni did play well that one game, Reignover securing a triple inferno buff, basically an AD deathcap for Huni, certainly help him snowball his game. Not taking away from Huni's play, but his success with GP that game was in large part because Reignover pretty much handed him his damage on a silver platter. Impact would have done the same exact thing in his situation. Hell any professional top laner could have done what Huni did in his situation with a triple inferno. Hardly a strong case for good GP game play. \n\nEven when Impact was playing Gangplank he was playing him quite well, he was absorbing a lot of attention through repeated ganks and he made Immortals expend far too much in try to kill him. It was the rest of his team that didn't play well. \n\nAnd that's really whats key about Gangplank in professional play right now: he's so fucking difficult to kill that you need to expend a massive amount of resources into killing him. \n\nAnd the kicker is even if you kill him multiple times, because of his safe wave clear, bandit, and his gold generation passive, he's always guaranteed to hit his late game hyper-carry status. You know how the counter-play to late game hyper carries is to focus them down so much that they are crippled to a point where they will never hit that late game power spike? Yeah, absolutely not applicable with GP. See the problem? \n\nGP's problem is exactly what the OP is talking about: for such a late game hyper-carry champ, his ultimate has insane early-mid global pressure combined with the fact that he generates gold at a rate that's unparalleled to any other champion which leads inevitably to an insane late game that happens earlier then it should, is a recipe for an overly-strong champion. \n\nUntil they address that, he's going to go down the same road as Azir and Kalista. ","replies":[{"poster":"Et Tu Geddon","date":"2016-08-23T22:18:13.020+0000","up_votes":1,"down_votes":0,"body":"Watch Pro games and tell me how many comboes are actually hitting unless your willing to call hitting his ult is a combo though i will give you that one. Pros like Impact are used solely as an Ult Bot because they never or rarely hit the barrel comboes unless the target is standing still in the ult and yes i know how difficult it is to hit a combo. They will gut GP now until some guy finds out he can still be usable then Riot will gut him again just because someone maybe a pro most likely finds the only other way to play him. \n\nI have seen alot of LCK matches in Korea and yes i can say that i have seen Gps there i just want to cringe.  Koreans are the best at league no questions but in Pro matches i rarely see their Gps make impacts besides being used as an Ult bot. One of the first Pro match Gp after the triforce change was so bad that it hurt my eyes and yes this was the LCK. It got camped and seemed like it didnt understand that it got camped since it died or just ended up being an anchor to the rest of the team. And i see alot of LCK Gps doing the same thing over and over again unless their jungler babysits their lane. Straight after that One game there was a resurection of Gps in EU then in Na not sure about the rest dont watch brazil or australlian. There is also  a difference between how your able to play a champ in Pro matches vs solo que matches that i dont have to tell anyone. Which is why for a long time some pros tried to squeeze kha zix into the meta because they were almost dominating solo que with it. But yeah it failed. I honestly think some of the pros say Hey im great with Gp in que bet i can do as well in my Pro matches which ends having them using it once then twice because they thought the first was a fluke then a third and the chain reaction has comenced. \n\nHuni actually had plays with the gp which involved using the barrels which Pros rarely manage to do even if they manage to secure a inferno two or three. Basically its fun to watch a Gp player who knows how to use the comboes and doesnt have to wait for his ult to make an entrance.  Also i agree that the games they lost he felt like a spoonge that just sucked up resources that would be better for another player or he did something he really shouldnt. The Riven pick actually worked though until he went Kamikaze like a japanese pilot and smashed into the enemy team on repeat or when he had failed xpeke. Impacts barrel play was sitting up one barrel then wait for a champ to jump over the wall and walk right into the next barrel he sat out. If you think im hanging myself up on barrels well thats why thats part of GPs main Kit. \n \nThe ult of gp makes a so big impact with the TLD proc early that it destroys lanes without him being there and thats something that is rarely looked upon . It baffles me why TLD is never shown as a reason why many champions now dominate some pro matches but  more often solo que matches. They talk so much about the champions that they forget the keystones being used. If you know the difference between GP ulti without TLD then you should  know how much lower the dmg is specially early. The difference is literally a kill.\n\nAlso im saying Impacts Gp which just pressed R when needed isnt that impactfull in comparisson to acually setting up comboes and using his entire Kit. I did not mean that his other games wasnt good just the uneventfull Gp one. \n\nDo you think Ekko or GP got the highest winrate in pro matches ? I will go on a limb a say its Ekko who needs tweaks alot more than Gp does. Well atleast the Pros wont play him now thats hes being thrown to the Kraken. \n\nSo the Ult nerf im not very salty so to speak about but that they to change everything with him is overkill and just gutting. Gps early laningh phase is bad enough that you need to gut everything about it. Atleast he cant almost two shot you like Azirs soldiers could or actually almost still can in the early levels. They also start forcing Gp to go Top with everything they do now. and to end yes he can be played mid which is also were i have seen both China i think but def LCK try him which failed to be nothing more than a walking Cannon barrage button.","replies":[]}]}]}]}