{"poster":"HateDaddy","date":"2015-09-10T05:16:45.284+0000","title":"Please hotfix Nasus' Q Bug","subforum":"Report a Bug","up_votes":77,"down_votes":4,"body":"This is probably honestly responsible for his drop in winrate by 5%. It&#039;s literally ruining his teamfight whenever he switches targets, there&#039;s times where his Q won&#039;t register at all even when his Q animation shows it hits. This isn&#039;t me reporting a bug, this is a known bug that Riot has stated they already have a fix for. Why are you waiting until 5.18? This is a game breaking bug for Nasus, if you already have a fix, just patch it in. What happens if it turns out the fix isn&#039;t even fixed? What happens if you wait until 5.18 and it&#039;s still bugged? Are you going to wait to 5.19? Please, just fix it now. It&#039;s making playing him miserable.\r\n\r\nReposting here because I was told Gameplay and Balance is the wrong board for asking for a hotfix on a known bug with an intended fix for the next patch because it&#039;s a gamebreaking issue gameplay wise for Nasus. What great mods we have.","replies":[{"poster":"Br4ndon","date":"2015-09-10T06:51:22.498+0000","up_votes":13,"down_votes":0,"body":"The worst part for me is that it locks you in place. It's like a 3 second suppression.","replies":[{"poster":"HateDaddy","date":"2015-09-10T09:37:49.549+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Br4ndon,realm=NA,application-id=LqLKtMpN,discussion-id=cqnWYtXG,comment-id=0001,timestamp=2015-09-10T06:51:22.498+0000)\n>\n> The worst part for me is that it locks you in place. It's like a 3 second suppression.\n\nNasus honestly feels buggy in general, his auto attacks feel clunkier, his Q feels clunky, he feels like he moves slower. IDK it may sound odd but I'd like to think I know a thing or two about a champ I've got 1000+ games on","replies":[{"poster":"TraderDerp","date":"2015-09-10T14:29:24.978+0000","up_votes":1,"down_votes":0,"body":"I don't have quite that many games on him, but I play him a decent amount, and his stuff has always felt quite smooth to me. I haven't played him during this patch yet though, maybe this patch broke something.","replies":[]}]}]},{"poster":"Riot Riscx","date":"2015-09-10T20:31:49.668+0000","up_votes":19,"down_votes":68,"body":"We haven't redeployed this because it would cause a decent sized client download for **all** players - and the bug is completely avoidable if you just don't swap targets mid-Q animation. It will be fixed in 5.18 next week.","replies":[{"poster":"LaceUp23","date":"2015-09-10T22:23:18.242+0000","up_votes":30,"down_votes":5,"body":">We haven't redeployed this because it would cause a decent sized client download for all players\n\nThis is literally the worse excuse I have heard. Lord forbid Zed have a bug, instantly shut down League.","replies":[{"poster":"Beoridas","date":"2015-09-10T23:05:39.611+0000","up_votes":14,"down_votes":2,"body":"to be fair: Zed was a bug that broke the WHOLE game. He would get all the gold from the mid lane while the mid lane minions would just not spawn.","replies":[{"poster":"Tannhäuser Gate","date":"2015-09-11T01:17:21.614+0000","up_votes":6,"down_votes":1,"body":"ALL MINIONS wouldnt spawn","replies":[]}]},{"poster":"Silents429","date":"2015-09-11T00:27:30.911+0000","up_votes":5,"down_votes":2,"body":"The difference is Zed had a game breaking bug while this only affects Nasus and merely inconveniences him in specific situations.","replies":[]},{"poster":"Nidalee SO NYAAA","date":"2015-09-10T22:58:35.780+0000","up_votes":3,"down_votes":1,"body":"Zed did have a bug once and he was disabled so","replies":[]},{"poster":"ElJanitorFrank","date":"2015-09-10T23:16:06.347+0000","up_votes":4,"down_votes":4,"body":"Yeah, a global bug that affects everybody playing versus one that makes Nasus clunkier.\n\nAnd you seem to have assumed they are the exact same, maybe Nasus' bug requires a shit load of refining in the spaghetti code, taking a lot of work and ironing out to get right.","replies":[]},{"poster":"SeductiveGrandpa","date":"2015-09-10T22:57:43.320+0000","up_votes":3,"down_votes":5,"body":"Actually, I can remember some times where Zed had bugs and they werent fixed off the bat, thing is that \nhotfix = Time to download\ncommunity = impatient\nimpatient = complaints\nremember the week when Cait/Rumble/(Jayce I think)  were disabled?\nAnd really it is quite avoidable when you think about it. IMO, im just happy that if Nasus switches targets I have a chance of not getting one-shotted.","replies":[]}]},{"poster":"Guardman","date":"2015-09-10T21:04:10.374+0000","up_votes":6,"down_votes":2,"body":"> [{quoted}](name=Riot Riscx,realm=NA,application-id=LqLKtMpN,discussion-id=cqnWYtXG,comment-id=000a,timestamp=2015-09-10T20:31:49.668+0000)\n>\n> We haven't redeployed this because it would cause a decent sized client download for **all** players - and the bug is completely avoidable if you just don't swap targets mid-Q animation. It will be fixed in 5.18 next week.\n\nI don't usually like to do this, but the fact that this has been stated in every (or at least most) post about the hotfix means that this isn't a one off comment said in the moment, but something that Riot (or at least some Rioters) believe is not offensive to people who play Nasus. Yes in an ideal world you won't switch targets mid Q. In the real world it is hard not to do while playing the game, even when you are actively trying to avoid it. That this statement has been added as work around in every (or at least most) post about the bug is really tone deaf to the players who play Nasus as it implies if you are experiencing this bug it is your fault.\n\nIn the future you are better off not explaining how to avoid a bug or give a work around when even the most vigilant of player will accidentally trigger it at least once a game (most likely in times of high action such as a teamfight).","replies":[{"poster":"DeynaTaggerung","date":"2015-09-10T22:18:13.324+0000","up_votes":1,"down_votes":0,"body":"They are going to fix it so by no means are you being offered a solution in that, but in the meantime it's something to take into consideration.","replies":[{"poster":"Guardman","date":"2015-09-10T22:52:02.757+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=DeynaTaggerung,realm=NA,application-id=LqLKtMpN,discussion-id=cqnWYtXG,comment-id=000a00010000,timestamp=2015-09-10T22:18:13.324+0000)\n>\n> They are going to fix it so by no means are you being offered a solution in that, but in the meantime it's something to take into consideration.\n\nI would like them to fix it. But I am not asking them to fix it with that post.\n\nI am asking them to try to not be condescending when posting. Because the post (and others they have posted about the bug) clearly reads as if you experience this bug its your own fault.","replies":[]}]}]},{"poster":"Jari","date":"2015-09-10T22:45:18.306+0000","up_votes":7,"down_votes":1,"body":"I'm not trying to sound Biased or anything here, but I bet that if there was a bug where jumping to Zed's shadow instantly froze him in place for 3+ seconds you'd fix it instantly even if it has this big of a patch. And to use your excuse back at you, if we had that, I could say, \"Just wait half a second.\"","replies":[{"poster":"Infinite Daps","date":"2015-09-11T00:58:42.807+0000","up_votes":2,"down_votes":1,"body":"Zed is also not a tank that has the potential to literally 1 shot ANYTHING IN THE GAME. In truth it is a bug that should be fixed, but it is just hard for me to feel bad when he is already potentially so broken. Wither at max rank might as well be a permanent stun unless you have {{item:3140}} and then you only have a few seconds before he simply casts it again. In a game i was literally withered, it fell off, i took two steps, and I was withered again. This champion already will undoubtedly carry the late game if the player isn't too brain dead to press Q. His ult makes him even tankier than he already is. He can literally build full tank items and do the most damage in the game.","replies":[{"poster":"Jari","date":"2015-09-11T16:04:53.808+0000","up_votes":1,"down_votes":0,"body":"Nasus needs time to get his stacks. Anyone who can make him afraid to CS just pretty much makes him useless for a good while. Wither is strong, sure. But it can only be on one target. There are assassins with better CC than Nasus does.\n\nAnd just saying as a Nasus player, he's a mid-game champion, not late. Late-game he gets kited too easily by the full build teams and dies up. Mid-game you  have a lot of your power while your opponents are still building up.\n\nAnd as a last note, Azir was a really powerful mid laner on release. His bugs made him unplayable though. Do you think Azir was justified to be m ore of a bug than what {{champion:121}} could dream of?","replies":[]},{"poster":"LemurKick","date":"2015-09-11T08:17:29.259+0000","up_votes":1,"down_votes":0,"body":"Nasus being strong is not an excuse to leave a gamebreaking issue for him in the game.","replies":[]}]}]},{"poster":"Denims Wrath666","date":"2015-09-11T11:38:26.886+0000","up_votes":2,"down_votes":1,"body":"while you guys are fixing that with nasus, can you let nasus stack gangplanks barrels? makes no sense why they arent stackable. voidlings, plants, wards are all stackable but barrels? also, just saying, turrets should be +6, not +3.","replies":[{"poster":"HateDaddy","date":"2015-09-11T14:13:26.714+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Denims Wrath666,realm=NA,application-id=LqLKtMpN,discussion-id=cqnWYtXG,comment-id=000a000a,timestamp=2015-09-11T11:38:26.886+0000)\n>\n> while you guys are fixing that with nasus, can you let nasus stack gangplanks barrels? makes no sense why they arent stackable. voidlings, plants, wards are all stackable but barrels? also, just saying, turrets should be +6, not +3.\n\nAccording to lolwiki they are stackable. Is he really not getting the stacks for them? I personally don't think they should give stacks but that's not the point here. I just haven't fought one since his rework.","replies":[{"poster":"Denims Wrath666","date":"2015-09-13T09:27:02.178+0000","up_votes":1,"down_votes":0,"body":"dont think they should give stacks? what are you on? like explain that thought process because its just going over my head or requires a half side of my brain to be dead.","replies":[]}]}]},{"poster":"iamthegoatofwar","date":"2015-09-10T22:01:29.647+0000","up_votes":13,"down_votes":0,"body":"as a person who still enjoys a game of nasus from time to time you have just upset me greatly...if i need to switch targets on the fly i should be allowed to do so without thinking \"oh no the bug took effect and i didn't hit my 700 damage nuke\" seriously man fix this.","replies":[]},{"poster":"EnderForHegemon","date":"2015-09-10T20:55:22.309+0000","up_votes":4,"down_votes":3,"body":"\"Completely avoidable\" if you just don't play the champion optimally for your skill level in a non-bugged scenario isn't good enough...\n\nI get that you don't want to add another download, even if I don't agree with it, but don't trivialize the bug that is now on live, changing the way the game plays, to the determent and frustration of your players.","replies":[]}]},{"poster":"Ignis0","date":"2015-09-10T13:33:31.519+0000","up_votes":5,"down_votes":0,"body":"I noticed this too. It like stretches the animation for a couple seconds and never applies any dmg. Can't cancel the q.","replies":[]},{"poster":"Vocata of Xoriso","date":"2015-09-10T11:25:18.092+0000","up_votes":1,"down_votes":2,"body":"LOL","replies":[{"poster":"HateDaddy","date":"2015-09-10T12:58:17.682+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Pinsnowes11,realm=EUW,application-id=LqLKtMpN,discussion-id=cqnWYtXG,comment-id=0002,timestamp=2015-09-10T11:25:18.092+0000)\n>\n> LOL\n\navin a giggle m8?","replies":[{"poster":"SeductiveGrandpa","date":"2015-09-10T22:59:50.639+0000","up_votes":1,"down_votes":0,"body":"Avian* a giggle\n\nHonestly, although the bug is problematic ITS SO FUNNY\nI HAVE ARCHDUKE NASUS ITS THE SLOW-MO PIMPCANE","replies":[]}]}]},{"poster":"Nidalee SO NYAAA","date":"2015-09-10T23:01:28.619+0000","up_votes":3,"down_votes":0,"body":"This bug is doing him doggysytle","replies":[]},{"poster":"Rinrintaru","date":"2015-09-10T18:01:54.518+0000","up_votes":2,"down_votes":0,"body":"You'll surely notice the bug yourself with 40% CDR Q farming, it's almost impossible to run into it with that. (As for the issue, he pauses in place, sometimes stuck in animation or just stuck in general until you can cast it on something else, most ground breaking one to happen to me was undertower in my ultimate inable to last hit Q the tower, I ended up getting stuck for around 4-5 seconds. Thank god the enemy laner was dead already.) It's been frustrating me also, first time i've commented on something before so no hate pls. {{champion:32}}","replies":[]},{"poster":"Bard in a Diaper","date":"2015-09-10T16:50:16.862+0000","up_votes":2,"down_votes":1,"body":"the gutting of frozen heart was way worse then this bug, hes unplayable atm.","replies":[{"poster":"Pikmints","date":"2015-09-10T16:57:09.881+0000","up_votes":2,"down_votes":1,"body":"Also with the Juggernauts being in their current state Nasus is unplayable. CSing outside of your turret means either taking true damage, being out sustained, or just simply chunked. Nasus almost seems like a champ that's intentionally designed to lose lane, get zoned from his minions, in exchange for the _possibility_ of being a late game terror.","replies":[{"poster":"Auryiel","date":"2015-09-10T17:41:44.523+0000","up_votes":2,"down_votes":1,"body":"He is...","replies":[{"poster":"Pikmints","date":"2015-09-10T18:31:40.838+0000","up_votes":2,"down_votes":3,"body":"He's designed to have a tough time during lane, and almost no ability to be a lane bully. Against Juggernauts, he's guaranteed to lose lane assuming they know how their champion works. It makes sense for a champion to be weak early and strong late, but having around ten champions that guarantee a lost lane is poor design, even better when at least 3 of them are very strong picks in general at the time because of a balance lapse on Riot's part.\n\nGranted the idea of a champion with infinitely scaling damage like Nasus' Q is a piece of poor design that prompted him being designed poorly in lane in the first place. Nasus seems like one of those wonky characters that oozes with \"I was designed before design made sense and was never updated\".","replies":[{"poster":"Auryiel","date":"2015-09-10T18:59:12.119+0000","up_votes":2,"down_votes":1,"body":"Pretty much this, tbh.\n\nIt's sad to say, but Nasus is not very well designed. He goes from ''Well I can't do much as Nasus'' to ''Well I can't do much against Nasus''. It's possible to make both cases less frustrating (buff his AA range, increase his early sustain, reduce the range or effecitveness of his point and click slow, make him more kiteable, etc.) but overall he's just... weird in a bad sense.","replies":[{"poster":"HateDaddy","date":"2015-09-10T20:16:55.355+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Auryiel,realm=NA,application-id=LqLKtMpN,discussion-id=cqnWYtXG,comment-id=00070000000000000000,timestamp=2015-09-10T18:59:12.119+0000)\n>\n> Pretty much this, tbh.\n> \n> It's sad to say, but Nasus is not very well designed. He goes from ''Well I can't do much as Nasus'' to ''Well I can't do much against Nasus''. It's possible to make both cases less frustrating (buff his AA range, increase his early sustain, reduce the range or effecitveness of his point and click slow, make him more kiteable, etc.) but overall he's just... weird in a bad sense.\n\nHe's already extremely kitable and contrary to popular belief, he's not even good late game because he just gets kited into oblivion and dies really fast since carries will have %pen and he won't have a significant level advantage. Nasus is basically a mid game champ with tools that allow him to scale into an unstoppable duelist, which doesn't since it's impossible to reliably split push given how good iniation is atm.","replies":[{"poster":"Auryiel","date":"2015-09-10T21:19:47.090+0000","up_votes":1,"down_votes":0,"body":"Just wanna point out that I never said anything about his late game, just how I perceive the scale that is playing as/against Nasus.\n\nNasus' kit doesn't call for much interaction. You can kite? You're golden. You can't? Does he deal more damage than you? You're screwed. He doesn't? You're golden.\n\n\nCompare to champs like {{champion:61}} that can always outplay you unless she's massively behind (and even then she can still set up her team mates for wombo combos, make allies into initiators or just peel and support) and can always be outplayed even when ridiculously ahead and you'll understand why IMO Nasus is badly designed.","replies":[{"poster":"KING OF MASKS","date":"2015-09-11T06:15:52.542+0000","up_votes":2,"down_votes":1,"body":"Not every champion needs to have Orianna levels of interaction/counterplay. Nasus has his niche, and he's balanced around it. Sometimes simplicity is the key to brilliance; if you consider the recent trend of overloaded CertainlyT-esque kit designs (*cough* Ekko *cough*), Nasus is especially refreshing in comparison.","replies":[]}]}]}]}]}]}]}]},{"poster":"Racks","date":"2015-09-12T20:44:18.844+0000","up_votes":1,"down_votes":0,"body":"jesus that riot reply... the company is a joke.","replies":[]},{"poster":"FiniteApple","date":"2015-09-11T23:21:35.438+0000","up_votes":1,"down_votes":0,"body":"This is worst when jungling. {{champion:75}} {{item:3073}}","replies":[]},{"poster":"Doktor X","date":"2015-09-11T10:32:45.434+0000","up_votes":1,"down_votes":0,"body":"Ah, so he is bugged! I was playing Nasus, get to late game with some 400-500 stacks, and try to Q a minion, and it doesn't die. Doesn't even lose half its health. Now I know why. But yeah, after two games, decided to stop playing him.","replies":[]},{"poster":"SuicideJ","date":"2015-09-11T07:29:02.936+0000","up_votes":1,"down_votes":0,"body":"I don't know why this is a surprise.. Riot never fixes anything (especially stuff they acknowledge as needing a patch/hotfix/or otherwise) before it is time to do a full patch where they make more screwups. If Garen is as overpowered as even Riot says.. Then why is he not disabled? Why not just do the patch? People can wait 2 minutes to fix the game rather than get screwed by it. I'd like to think Riot is trying to do good by us.. It is just hard to think that because of the lame excuses, the obvious decisions based on instant income (instead of longterm income), ignoring requests by concerned players about the games unhealthy state, and many more. How are we supposed to trust Riot? They don't trust us.","replies":[]},{"poster":"Bard in a Diaper","date":"2015-09-11T03:28:08.706+0000","up_votes":1,"down_votes":0,"body":"so when is frozen heart getting reverted? dont think ive seen it built once since it got gutted. You wonder why \"bruisers\" are running rampant when one of the best items to counter them got gutted","replies":[{"poster":"HateDaddy","date":"2015-09-11T03:44:17.337+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bard in a Diaper,realm=NA,application-id=LqLKtMpN,discussion-id=cqnWYtXG,comment-id=0011,timestamp=2015-09-11T03:28:08.706+0000)\n>\n> so when is frozen heart getting reverted? dont think ive seen it built once since it got gutted. You wonder why \"bruisers\" are running rampant when one of the best items to counter them got gutted\n\nEh not really\n\nBruisers are just a bit overtuned in general currently, they'll get properly retuned. But I wouldn't mind seeing Nasus get a bit more armor per level like many tanks did since it's his core item.","replies":[]}]},{"poster":"Lùxánnà","date":"2015-09-10T22:52:23.086+0000","up_votes":1,"down_votes":0,"body":"When i play rank and select the champ i cant start the game and cant make reconnect all game fix it now i cant play any game normal or rank and when i play custom i start the game but attempting to reconnect and cant make reconnect again","replies":[]},{"poster":"Carnage","date":"2015-09-10T22:15:22.455+0000","up_votes":1,"down_votes":0,"body":"did not know this was a bug \nnow I know","replies":[]},{"poster":"Hoodwink","date":"2015-09-10T22:03:00.717+0000","up_votes":1,"down_votes":0,"body":"I've had this issue several times, luckily it hasn't cost me much but it's been quite annoying.","replies":[]},{"poster":"somebeety","date":"2015-09-10T21:31:59.805+0000","up_votes":1,"down_votes":0,"body":"Yea i made a vid when i found ithttps://www.youtube.com/watch?v=WtYeGfifj_k","replies":[]},{"poster":"LICENSED HOOKER","date":"2015-09-10T16:50:41.703+0000","up_votes":1,"down_votes":0,"body":"I stopped playing him after I almost got a PENTA but the q failed me","replies":[]},{"poster":"ks916","date":"2015-09-10T16:09:03.762+0000","up_votes":1,"down_votes":0,"body":"This bug really hurts Nasus hard, I don't think as many people realize how bad it is unless you have played him. Pretty much all your dmg is in that Q (especially late when your trying to 1 shot squishes) and when it bugs out it means your out of 700-1500 (depending on stacks, build etc) which if fcking huge.","replies":[]},{"poster":"Wheatloaf","date":"2015-09-10T14:45:13.012+0000","up_votes":1,"down_votes":0,"body":"It's possible the fix just isn't valuable enough to them to risk messing shit up with a hotfix. It's not like there's no risk to fixing a plane while it's in the air.","replies":[]}]}