{"poster":"castrechino","date":"2017-07-09T23:36:24.710+0000","title":"Getting rid of Runes!","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":1,"body":"This is not cool Riot. From what you have shown runes will be removed and I am not happy about the change. Honestly having to pay for runes is terrible and a problem for a lot of players (even me). That being how it is runes are still a very fun part of character customization. When you can start the game with an entire page of mana runes on ryze or a full page of attack speed runes on sion and just run at people it makes for fun little cheese. I like the idea of trying to make them more accessible, it's great but when you turn them into one or two pre-made runes like this bloodthirster one that over heals or whatever they may be, it's not quite the same as making your own page for a champ. I may be totally off base as we don't have all the information but you guys said to be vocal and I'm trying. These are concerns of mine. Thank you for a fun game and listening to the community.","replies":[{"poster":"Broporo","date":"2017-07-10T00:46:47.559+0000","up_votes":1,"down_votes":0,"body":"I love getting this kind of feedback! We want to hear from the community even more when making changes like this so thanks for voicing your concerns with me!\n{{sticker:slayer-pantheon-thumbs}} \n\nThere's still a lot to be revealed about how the new rune system will work, but rest easy knowing that you'll still be able to have fun with coming up different builds for different champs. I can't go into too much detail (mostly because I don't even have it yet xD) but you'll find a lot of details about how the new system will work [**right over here**](http://na.leagueoflegends.com/en/news/game-updates/features/coming-preseason-runes-reforged)!","replies":[{"poster":"castrechino","date":"2017-07-15T15:44:55.759+0000","up_votes":2,"down_votes":0,"body":"Ok. Thanks ^_^ I know even on the pro level that one exp quint to hit 3 for an early gank made such a huge difference. I was just worried that they would become \"watered down\" for lack of a better term. I look forward to the news and finding out what happens. You guys have been doing this for a long time. I should have faith you will only make the game better.","replies":[]}]},{"poster":"Shandos","date":"2017-08-28T00:51:30.807+0000","up_votes":1,"down_votes":0,"body":"I have been around sense season 1. And personally I  really like the runes and talents. With talents it's all about adjusting to champs. I even went so far as to buy the multi page just so I could custom's my champs. With the runes. You have to make a chose use the IP for champs or new runes. Or saving up for runes. I would like them to stay. They are one thing in the game that hasn't really changed sense season 1. Yea they have been updated. But they are still the same. It would be a loss to the game in my opinion if they are taken away. But it's your game. And I know riot will do what is best for the whole community. Riot has never let me down. It's why when I get a new computer the first game I download is leauge of legends. It's why I keep coming back season after season. I don't play ranked because the player base gets mad at mistakes. I play normal I have more fun. Players are friendly there. And the one thing that can help you over come players that are not great in normal or that are new. Is the runes you pick. It can help you carry the day in a match. Or mess it up completely if you didn't grab the right set up. If they go I will cry inside a little. And then get on to playing. Just some thoughts from a long time player.","replies":[]},{"poster":"SwitchWonder","date":"2017-08-26T12:49:43.424+0000","up_votes":1,"down_votes":0,"body":"I don't think that the new rune changes offer enough precision. \n\nFor example, sometimes I want to add or take away only 1 or two runes. 1 or 2 runes can make a big difference. It allows me to make my non-meta champions viable. If  rune choices become too general it wont be possible to have an edge on a champion, making it even more necessary to play meta champions.\n\nLess choice makes them game boring. Being bored makes me want to play less.\n\n{{sticker:zombie-nunu-tears}}","replies":[]}]}