{"poster":"CooMing","date":"2018-01-31T05:19:24.693+0000","title":"Let's talking about Permanent Ban","subforum":"GD","up_votes":1,"down_votes":0,"body":"The discussion was about the permanent ban of the language offense, the cause of which was that my account was reported in a game leading to a permanent ban. After I get in touch with the supports, and send total nearly 3000 word message, but get back just keep repeating the similar statement, and one of support advised me to put my opinions on GD, I think it is a good choice, so I&#039;m here to discuss this, in order to direct show what I said, I choose to copy the mail directly.\n\nMe:\nThe first thing I&#039;d like to say is that I had been punished several times because of the radical speech being reported. And this time, I got report again, and my account is permanently banned. First of all, I don&#039;t want to talk about other things, and just start from my game chat records \nGame 1 \nCooMing: lmao \n\nCooMing: ban my kayn ? eh \n\nCooMing: i know this sup \n\nCooMing: he is bad \n\nCooMing: i guess if i win again \n\nCooMing: u gona crying ~~~~ i gona tell my papa RIOT \n\nCooMing: BAN THIS ACC~~~~ \n\nCooMing: SO WHY I STILL PLAY THIS GAME ?? \n\nCooMing: I dont know did u ever know how the system working just u report make nothing cause i report u too \n\nCooMing: for 2game \n\nCooMing: for ? \n\nCooMing: just u ? \n\nCooMing: then cant work \n\nCooMing: reconncet \n\nCooMing: go reconect \n\nCooMing: cool \n\nCooMing: ty sup \n\nCooMing: top \n\nCooMing: top \n\nCooMing: are u blind ??? \n\nCooMing: gj \n\nCooMing: i will report for afk \n\nCooMing: i dont know why people come to play rank with such internet \n\nCooMing: this kind of int \n\nCooMing: whatvere \n\nCooMing: gg \n\nCooMing: i will report adc whatever \n\nCooMing: ty \n\nCooMing: u good sup \n\nCooMing: u deserve win \n\nCooMing: sor \n\nCooMing: ofc \n\nCooMing: i am plat \n\nCooMing: i used to this already \n\nCooMing: save time \n\nCooMing: save time ok ? \n\nCooMing: ff? \n\nCooMing: fk u guys \n\nCooMing: this reconnect voice like joke \n\nCooMing: 20 ; 11 \n\nCooMing: 4 V 5 \n\nCooMing: i didnt know how this can be good \n\nCooMing: i go AFK too \n\nCooMing: so suffering \n\nCooMing: dont play rank \n\nCooMing: plz \n\nCooMing: fix ur int \n\nCooMing: haha \n\nCooMing: that only way u can win \n\nCooMing: with 1 afk in my team \n\nCooMing: trash \n\nCooMing: i guess u never been to plat rank kalista \n\nCooMing: hahahah \n\nCooMing: then why u ban my kayn ??? \n\nCooMing: little idiot \n\nCooMing: i running out of time \n\nCooMing: idiot \n\nCooMing: just pick without think \n\nCooMing: u think u good ?? \n\nCooMing: cant even hook \n\n(In this game, the people I am talking about was my teammate of the game before the last one, he used Thresh and made lots of unwise behavior, even when the enemy pushed to the highland, he went to clean the ward which was near the wall, and a Blitz pulled him directly from the highland, before that I kept ping him don&#039;t do that, but he refuse to listen. and his death was a direct result of our failure to defense. After that game I met him again and he lost to me, I kept to told his bad game consciousness, and he said he would make my account ban, clearly his teammate didn&#039;t help him to report me, but after that game, which is this one he made it.)\n\nThis game is a Solo rank and one of our teammates appeared AFK whole the game. I was mocked by the opposite player in an unfair game. One of opposite player incites his teammates to report me and obviously, he is successful, there is definitely more reporting behavior led to this permanent ban. I want to say that I was punished no matter what reason I had been given before, but this time, whether it&#039;s the opposite player&rsquo;s attitude or Riot review is unjust. I got one honor at the end of the game, and I&#039;ve done my best to do everything for this game. If you go to see my game record, you&#039;ll know I&#039;m a platinum player who always treats my game positively, I have been recognized by a lot of people. What I want to say is why this group of maliciously framing a person can succeed, I lost the game because of the teammate&#039;s AFK behavior, but I didn&#039;t report him either, because I knew that some things could not be avoided, to some extent, I was also a victim. \nNow I&#039;d like to say for LOL, the Honor system is a pretty good start, but this setting can&#039;t compete against the negative effects caused by the report, there are a lot of reasons. And because words lead to a permanent ban on an account, it seems to me too much too harsh. Almost all players will speak some words out of a malicious mind at a certain time, and the system is just going to judge a person&#039;s malice based on the number of reports and the recognition of words. For a realistic perspective, how do you judge a person&#039;s total negation based on a word? How can you deny a player by the speech of one game? I know that my account may not be relieve banned for this email. But before I leave this game I want to say I love this game and I made a lot of effort for my game skill, and when I face difficulties, when I need to lead the whole team to victory by myself, my inner indomitable spirit and my indomitable struggle are given by the games and you guys who are trying to make this better. In these five years, from China to Australia, this game made me know a group of friends and my best brother, I made too much effort on this account, and I get platinum rank on my own with solo rank when everyone else denied me, and I played eight promoted games to get to platinum, do you know how hard that it is? From 16 to 21 years old, from a bronze to platinum, from endless blaming teammates to reflecting on why I failed to lead my team to win after every defeated game, I am working on it. I have an endless desire for victory because I know that my strength is more than platinum. I hope to enter a higher stage, but because of the imperfect matching mechanism, I often face many lag teammates, high expectations always bring too much disappointment, and of course, I have a lot of such emotions to go to this day. Now, my understanding of games and the control of jg rhythm are excellent enough for me. I have been recognized by many friends and teammates in the game. \nFor me, this account and this ID, which is all I am in this game. I used to insist on this game forever, but I didn&#039;t expect that I would be forced to leave the game because of the system mechanism of the game and a group of malicious players. I am 21 years old I used to want to join Riot and make more efforts. In my opinion, LOL is no longer a simple game, it has the potential to learning from NBA and developed into an international event, at least it has too much soil can make it development. It&#039;s a pity that I might have to draw a stop here for the five-year, I believe that through this mail you can feel how I am a person if you still think I am a negative one who is toxic and unreasonable, I guess I am speechless. After all, the game is yours, the choice is ours. However, I hope that better than anyone, after so many people suffered permanent ban because the verbal behavior, Riot can from the reflection of some problems, make more and better for the game improvement, ban cannot change too much, If an account can be permanently banned for chat and this kind of behavior can make this game and whole society become better, I don&rsquo;t believe in that. Sometimes, people deserve more and people are supposed to look more and deeper. \nI will never forget this game, and those bad memories will disappear. In my view, my four years are not worth for nothing. I hope that LOL and Riot will get better and better.\n\nSupport 1:\nMundo read your whole ticket and he was impressed all the way to his Mundo Heart.\nMundo understands very well how hard it is...how much work it&#039;s involved in trying to better yourself (not only in games) and to reflect upon your actions and mistakes and to always find ways to improve instead of blaming others.\nMundo thanks you for the kind words also, you are one of the few players that realize how the gaming industry works and what it takes to satisfy all the players that play the game, which sadly is almost impossible no matter the game.\nAs you may know we have a system in place called IFS, that punishes the players regarding their behavior. Our IFS system is built around the feedback we received from our League Community and it is in constant development.\nAlso, Mundo thinks that you are aware of our policy regarding hate speech, homophobia, bullying, wishing harm on others have a zero tolerance and that retaliation is not an acceptable or justifiable behavior. An argument between two players can easily create a negative experience for the rest of the players in the game with you. Regardless of the other player&rsquo;s actions, this does not justify your own behavior.\nAfter thoroughly investigating your account it seems that your account has been permanently banned after being escalated through multiple levels of punishment by our disciplinary audits. So basically you had the chance to reform but you failed to make amends to it.\nFurthermore, keep in mind that we do not punish players, but accounts. So basically you are responsible for all the actions taken on your account. That being said, when an account is marked as a negative element in our community we remove it by placing a permanent suspension on it. Under no circumstances we will allow that negative element to reenter our community and create a negative effect.\nMundo would really wish that he could do something to help you, but sadly, we cannot discriminate between our players and every player that reaches this point is very disappointed about how our system works or about the final decision.\nAlso, Mundo thanks you for the kind words and feedback regarding our game.\nMundo can only wish you the best of luck in your future endeavors.\n \nMe(There are 2 emails):\nWell, like you said I really have a chance to avoid this punishment, I think the so-called avoidance is completely out of the communication of the game, which means keeping silence all the time. What you say about zero tolerance in the language of violence, I want to say if it is zero tolerance, then whether Riot staff work when you are not allowed to use any hurtful words, even joking, are not allowed to use, otherwise it will be 4 times the gag, a two weeks from work, and permanently expelled? \nCommunication needs in life, a victory for the goal of the game also need to communicate, but sometimes some game player doesn&#039;t recognize their skill is too low, continue to do some stupid behavior, and cause your efforts were all in vain, in this case, I would like to ask if it is you, you can not in the mood? If the cleaners in your office have just finished cleaning up a place, you&#039;re going to get it dirty right away, do I want to ask if he will scold you? But I guess he will never come to hurt you or even kill you. That&#039;s how everything works. \nA big reason for the five years of LOL fascinated me is high correlation with reality, because the virtual network platform, some of the problems it can better reflect the people, everyone is to take the most direct attitude in the face of the problem, no hide, do not need to treat the elderly like and treat your boss like that, the game has no boundaries, especially in the rank game all we do is to win, I don&#039;t know how many of your supports have platinum level or above. I don&#039;t know how you treat each game of rank. But I want to say as a loyal player, and platinum jg, I can find many stupid details of my teammates in the game, sometimes these details do not matter but sometimes these details will lead to lose, big difference between LOL and DOTA is LOL rhythm quickly, because of this the butterfly effect is more obvious, some silver players complaining about his teammates, complained to lose the game, it is because those stupid decisions they do not see themselves and their team does, if you have watched internet broadcast, I believe you will also see some of the anchors in the game will also make some negative comments on some of his/her mates and will also use some bad words, I want to ask why don&#039;t you go to ban their account?\nDo you know why Riot can still maintain a lower number of the permanent ban because of language? It is because of one word, vent. Think about it, if you are not play alone, but with two people or more, or as the anchor that face a lot of people in the game, when you are not feeling well you can express to your friend or the audience, then vent your anger, but if you are playing alone, you&#039;re going to argue with some stupid teammate, and may eventually become quarrel, because they don&#039;t know how many stupid actions they&#039;ve done and still wasting your effort. Once the game finish we will see how much false good guys and real bad guys between the two sides in the team, because their report directly determines one account&#039;s fate, this is your system, if it is a real world, this is a personal life and death to a group of ignorant masses to see how much they vote and one-sided evidence system. Don&#039;t say how many opportunities you have before permanent ban, because based on that every punishment may not be fair, and the last penalty that leads to permanent ban is worth considering. Therefore, language may be the best way for our individual players to vent, or how can I vent my dissatisfaction? Smashed my computer? Smashed my table? \nLanguage is the inherent right of human beings. It conveys the feelings and meanings of people, whether it is good or bad. I don&#039;t think that a few uncivilized words can be regarded as verbal violence, or it&#039;s true violence. Moreover, I also believe that Riot can create a game world without language violence, Riot can punish for the language violence that u think, but it is not necessary for language to cause a permanent ban. Using unauthorized third-party plugin and buying smurf can lead to permanent ban, because this is fraud, even fraud in real life will also suffer because of the degree of legal judgment, but the language is not the same, I have never heard that any country would have sentenced me to jail because I had said several dirty words. I want to say from a customer&#039;s point of view and tell Riot, your system really have many deficiencies and inhuman place, whether it is your matching mechanism, scoring mechanism after the game, or even the mechanism such as a permanent ban for a chat offense, I guess that is truly too harsh. I hope one day I can see LOL change before it is too late if it does make a change if my account can come back I hope you guys can email me, I think I may not want to enter in such an unfair game before that, thank you very much.\nBest wish to you.\n\n(I also send them a game replay which I try my hard to win a game but still got throw by my mates)\nThis is a game I played with my second account, but I don&#039;t actually use this account, and I hope you can see it. This is just a very ordinary normal game, a game I didn&#039;t say a word, I try my best to do what I can do myself, no matter what my teammates said, I just muted some of them, but before I muted them I still see some bad talks, which make me feel sad, and their foolish behaviours and a lack of map consciousness makes me feel very depressed, because my efforts are wasted again and again. Lost does not make me feel uncomfortable, but no teamwork and opinionated words make me angry. Sometimes such a game, two or three times I can stand, but what if it is a rank game? I spent so much time to win that point, but some people&#039;s actions make all my efforts back to the starting point. \nTo tell you the truth, I&#039;ve played tens of thousands of games, losing more than winning. Riot told me that I could not speak one dirty words even it is joke, and you could not get rid of any more unfair treatment. What is this? Is this a game between the saints and the children? It&#039;s unfair. The matching mechanism of the game itself has been very unfair, especially in rank. Now Riot has banned my account because of my few words, and deprive me of everything, it&#039;s really violent. I&#039;m just said trash, idiot, my vocabulary is not good. I can&#039;t believe this can be judged as excessive language. Trust me, if I am pretty good with English, I will sure to criticize them without those easy words. At the same time, are you sure that there is no language violence without uncivilized words, but I guess in that situation report will not work at all, because your system can&#039;t identify them. Riot want to use chat offense to create a harmonious environment, but are you sure that what you guys doing are right, because if that&#039;s not, you&#039;ve hurt a lot of player&#039;s hearts. Fair and justice, right and wrong are really can be reflected by several reports and few words? Even the law is impossible, what is the standard of Riot? An ancient Chinese quote &ldquo;Attend to trifles to the neglect of Essentials &rdquo;, in my opinion, using permanent ban for chat offense or what Riot called language violence is what that talking about.\nFive years, tens of thousands of games, in the game I made contribution, tried again and again to help others, to make others and this game become better, which has not been recognized by Riot, but a few times I was dissatisfied and with some hypocrites used and made me lose everything in the Summoner&#039;s Rift, this is really unfair, as early as S1 and S2, Riot rewards to those without used plug-in and script players, but now? Riot is going to punish people like who have already been unfair, even complain are denied. It&#039;s really unfair. Is there really no justice and fairness in this game? \n\nSupports 2:\nHello,\nAs it is mentioned on our support page, a permanent ban is the last punishment that an account can received due to inappropriate behavior. The game has rules which all players have accepted before stating to play.\nI understand how frustrating it can be when you are doing your best to win a game but still end up losing it because someone decided to throw it but please remember that this dos not excuse offensive behavior. We do not tolerate toxic behavior and neither retaliation to such behavior in the same manner. It does not matter who started being offensive or who was the most toxic player in a game, as we are all responsible for our own actions and other player&#039;s negative actions do not justify our own.\nI understand the need to vent but that doesn&#039;t mean that others should suffer because of our frustration and anger. Everyone has the right to play the game in a civilized environment.\nI see that you are not very pleased with how our systems work. We can&#039;t pass feedback reports directly to the development team, but I recommend posting to the Boards. The team is always looking at the Boards to get a feel for things players think could be improved.\nYou can find the Boards here:\nhttps://boards.oce.leagueoflegends.com/en/c/general-discussion\nPlease let me know if you have any other questions.\n\nAfter such a long talking I see that giving the feedback of game system&#039;s problems to supports is of no use, they will only make an explanation and tell you about the current situation like there is already happened, we can&#039;t feedback your problem and there is no way to help you to solve. If I throw away all these messages, I don&#039;t know that a game with ADC keeps dropping and I only talked about the two words of trash and idiot, are these belong to excessive violations? I don&#039;t know how many people can understand me, but the fact is that the group of small people in the game did report me and the Riot system really helped them to succeed. And now I see the support told me &quot;It does not matter who started being offensive or who was the most toxic player in a game&quot;, and this sentence makes me very helpless. I hope my discussion can be saw by the development team, and they can do somethings to change this situation.\n\nThanks for reading.","replies":[]}