{"poster":"maquiaZ","date":"2017-01-23T09:12:23.089+0000","title":"los adc realmente estan tan en mal ?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Todos dicen que los adc estan mal que es muy dificil ganar con ellos etc etc lo que yo opino es que simplemente cambiaron los top tier a adcs que no se suelen usar por que el juego esta orientado a early mid game , los adc mas populares de america son caitlyn jinx y vayne , junto con ezreal los 4 escalan en late pues requieren 3 items y al menos 9 k de oro, 11 k  en el caso de ez. Aun asi ko6maw miss fortune kalista varus draven twic estan fuertes  pueden carear una partida tranquilamente pero  no son campeones populares cuando les comparas con jinx o vayne, este juego como la vida trata de adaptarse ir cambiando, investigando y aprendiendo. que un mago como ziggs puede ganar la lane es un caso puntual y el ziggs estaba muy off meta desde  season 4 asi que le tocaba su turno.  Si eres main adc te toca adaptarte si quieres ganar o esperar que el meta cambie.{{summoner:7}} {{summoner:4}}","replies":[{"poster":"Diosmo","date":"2017-01-23T16:49:54.731+0000","up_votes":1,"down_votes":0,"body":"Miralo de este modo, en competitivo (al menos LAS y LCK que vi) siguen usando tiradores en bot, asi que taaaan mal no deben estar.","replies":[]},{"poster":"Americans","date":"2017-01-23T15:00:54.738+0000","up_votes":1,"down_votes":0,"body":"En 5v5 si, en solo q no.","replies":[]},{"poster":"Gretta Thunberg","date":"2017-01-23T10:15:14.418+0000","up_votes":1,"down_votes":0,"body":"viejo el tema es el siguiente tu como adc o yo en este caso tengo que compartir la linea con alguien que no conozco de nada y mi superviviencia y de lo que yo haga en la partida esta a cargo el supp.\n\nahora un talon con {{item:3134}} {{item:3117}}  y dos {{item:1036}}  deletean ojo le hacen one shot a una mf que tiene {{item:1038}} {{item:3006}}  viejo con suerte le podia pegar 1 basico era realmente estupido que posibilidad de dueler tengo yo contra eso si tengo un objeto que da mas daño pero aun asi no puedo pelearle?","replies":[{"poster":"maquiaZ","date":"2017-01-23T14:46:26.076+0000","up_votes":1,"down_votes":0,"body":"la build core de mf es {{item:3142}}  {{item:3071}}   {{item:3814}}   o  {{item:3147}}  mas los items de penetracion y robo de vida o angel  guardian. un talon en teoria deberia tener dificil iniciarte  con la pasiva de la w mas la pasiva del {{item:3134}}","replies":[]},{"poster":"9081913DEL1","date":"2017-01-23T11:03:01.769+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Ammaru,realm=LAS,application-id=v7qsfXsE,discussion-id=GHTN1A1L,comment-id=0002,timestamp=2017-01-23T10:15:14.418+0000)\n>\n> viejo el tema es el siguiente tu como adc o yo en este caso tengo que compartir la linea con alguien que no conozco de nada y mi superviviencia y de lo que yo haga en la partida esta a cargo el supp.\n> \n> ahora un talon con {{item:3134}} {{item:3117}}  y dos {{item:1036}}  deletean ojo le hacen one shot a una mf que tiene {{item:1038}} {{item:3006}}  viejo con suerte le podia pegar 1 basico era realmente estupido que posibilidad de dueler tengo yo contra eso si tengo un objeto que da mas daño pero aun asi no puedo pelearle?\n\nVos estas hablando de one shoot a una mf, mf no inicia con filo salvo ciertas ocaciones. La mayoria de los adcs tiene una build clasica y una suplementaria segun la situacion, el post trata sobre la adaptacion a los cambios. Si tenes alguien que te puede hacer one shoot, te compras espadon para contrarestar? \nLiteralmente el fallo es tuyo. \nDepender del soporte y si, toda la vida fue duo la lane, y toda la vida el adc fue el mas debil, solo que tenes que saber pararte, tenes que evitar el one shoot. Y ojo, que al momento en que tenes 1350 de oro one shoot no hay, gank y demas si, pero one shoot? quien te solea un adc con 1350 de oro? sabiendo kitear y no parandote a melee o poniendote a pelearle a un ryze obviamente.\n\nEs cuestion de saber que hacer y por que. Claramente si tenes un soporte como janna, karma, morgana, bardo, nami, soraka, sona, tenes mucha mas supervivencia que si tenes un blitz o una leona. Pero no depende totalmente de los demas, tambien hay que hacer las cosas bien como adc.\n\nSaludos.","replies":[{"poster":"Gretta Thunberg","date":"2017-01-23T11:06:28.166+0000","up_votes":1,"down_votes":0,"body":"filo con el mf? what saqueador de escencias viejo me tiraba la ulti y con la ulti me quitaba la mitad de la vida luego las shurikens y la q y explotaba.\n\nque puedo hacer si ahora en invisible no tiene ninguna señal o algo tampoco lo puedes revelar, aparte puede saltar paredes xD que hablas locoooo","replies":[{"poster":"9081913DEL1","date":"2017-01-23T12:04:29.468+0000","up_votes":1,"down_votes":1,"body":"Shurikens, te refieres a zed, cierto?. Zed es un asesino, no es dificil adivinar un gankeo de zed, y no es dificil evitarle las shurikens. Despues de eso la ult lo que tenes que hacer si ves que te hacen roam es abrazar la torre y hacer clear. En un 3 vs 2 no hay forma de que tengas la ventaja, aun siendo retador vs bronce podes claramente ir a un 2 vs 2 y estar en mejor posicion. Lo dicho no seas cegado al jugar.","replies":[{"poster":"Gretta Thunberg","date":"2017-01-23T12:10:50.899+0000","up_votes":1,"down_votes":0,"body":"viejo no hablo de zed hablo de talon y si te digo que me hacia one shot al minuto 15 no te miento","replies":[{"poster":"9081913DEL1","date":"2017-01-23T12:25:39.697+0000","up_votes":1,"down_votes":0,"body":"Talon actualmente esta under, creo que es a lo mucho un 75% del talon que era pre rework. \n\nEs claro que no es meta de adcs, pero no estan inutilizados ni por asomo, la cuestion es como se usa el campeon. Si ves que falta talon, no pushees, en realidad siempre que falta alguien tenes que jugar a la segura. Podria jurar que el 99% de tus partidas no sabes adonde esta el jungla enemigo, eso ya es uno que falta.\n\nTalon no hace one shoot si estas full hp. Al minuto 15 esta pasando algo, o no tenes la pierda o no tenes runas de armadura plana. Que te deletee un campeon que escala con LETALIDAD al minuto 15 no es el problema del campeon, es problema tuyo. Pensalo un rato y te vas a dar cuenta.\n\nP.D.: Mf no esta en plan de adc hace dos temporadas, es buen adc pero no tiene escape. Para usar mf de adc deberias tener un premade jungla que te lleve a estompear tu linea, tardas mucho en volver si no es asi.","replies":[]}]}]}]}]}]},{"poster":"TSW Rorschach","date":"2017-01-23T13:07:08.828+0000","up_votes":1,"down_votes":0,"body":"El otro día pensaba eso, pero no vi muchos problemas. Juego muchísimo supp y lo único que veo de jodidos a los adcs, es que es algo complicado tratar de posicionarse sin que te maten, ya que si vos como supp focuseas al adc y al asesino contrario (para que en la tf sean wards), lo mata el tank ya que por más que le trates de bajar todo, él te lo mata antes xd\n\nDe adcs fuertes obviamente Vayne nunca se va a ir, el daño verdadero la tiene muy presente ahora. A Cait y a Tris también las vi bastante bien. Pero luego por ejemplo creí que Graves adc estába en la porquería ahora y...\n\nhttp://i.imgur.com/2e1eZ22.png\n\n\nAsí que ya no sé qué creer xd","replies":[]},{"poster":"WhiteMax","date":"2017-01-23T11:49:17.084+0000","up_votes":1,"down_votes":0,"body":"Lo que sucede con los Adc es que tienen daño pero les falta un poco de aguante, ponele que peleas contra el tanque rival, en teoria si el Adc esta bien posicionado tendria que matarlo (porque es el daño del team) pero al contrario el tanque lo mata y se queda sobrado con 30% de vida la cual recupera rapido con una {{item:3065}} y al final no tiene sentido, solo {{champion:67}}  se los come pero por su daño verdadero.","replies":[]},{"poster":"Wísh","date":"2017-01-23T09:31:45.642+0000","up_votes":1,"down_votes":0,"body":"para mi lso adc del momento son ashe varus ezreal y jhin y el tema que este tan jodido ganar siendo adc es mas por que te deletea cualquier cosa xd  y  no meten nada comparado a lo que aguanta un coloso xd conoses el meme adc in 2K17? de por eso todos joden con lo que los adcs son una mierda xd","replies":[{"poster":"9081913DEL1","date":"2017-01-23T11:10:49.038+0000","up_votes":1,"down_votes":0,"body":"El tema de los colosos es como el thunder. Como le sacas el rinde al thunder? te aprendes su cd de activacion y listo desgaste a full. \nColoso es igual, es como janna, como le ganas a janna? baiteas su escudo y atacas. Es lo mismo, si viene un coloso no trates de escapar de entrada espera que se active dodgeas y le das. Pierden vida, la cosa esta en no gastar todo en su punto fuerte.\n\nP.D.: hay items de resistencia para adcarrys, deberian ver los parches, daño no es el unico stat que existe.\nSaludos.","replies":[{"poster":"Wísh","date":"2017-01-23T11:42:12.408+0000","up_votes":1,"down_votes":0,"body":"no me referia en si a la maestria como te explico estamos en un meta donde los tankes dominan en la top osea lso adcs tardan bastante en armarse mientras uqe lso items de tankes valen masomenos 1000 de ooro menos que los items de daño, es un ej nomas.\npd me leo lso parches tengo que aprobecharme de lo roto 2 divisiones mas y subo a master D: xd","replies":[]}]}]},{"poster":"Annie Botz","date":"2017-01-23T09:53:48.023+0000","up_votes":1,"down_votes":0,"body":"Estoy de acuerdo con más que nada con {{champion:29}}  pero no con {{champion:110}} y {{champion:429}} \nEso si, {{champion:29}} necesita buen peel o no hace nada.\n\nLa verdad es que de momento no he visto ningún {{champion:115}} , estoy jugando en mi cuenta plata y por lo que veo a los adc's se los comen vivos {{champion:102}} es el ejemplo perfecto de que no hay escapatoria :v\nIncluso yo que juego {{champion:6}} me los bajo de unas 4-5Q aunque la mayoría no tiene mucha idea de posicionarse, pero eso no justifica que casi cualquiera explote al adc, últimamente es exagerado lo fácil que es borrarlo, aunque con un peel bueno quizás resista pero sigue siendo vulnerable a campeones con mucha movilidad y daño.","replies":[{"poster":"9081913DEL1","date":"2017-01-23T11:07:37.841+0000","up_votes":1,"down_votes":0,"body":"A ver, primero twich no necesita peel, twich se juega a desgaste y daño continuo, por eso puede ir jungla y ashe no a pesar de tener stunt global.\n\nVarus es un iniciador y puede desenganchar. Varus esta totalmente onmeta, si te viene un asesino lo clavas al piso. Jamas, repito jamas haces trade 1 a 1 siendo adc, el trabajod el adc no es matar todo, es hacer daño. Estan mal acostumbrados a manejar campeones a lo bonzo. Mandarse hiteando y skilleando y a ver que pasa, no es asi el juego.\n\nLucian, kalista depende el jugador, varus, hay muchas opciones, obviamente depende del jugador. Vamos que en plata no pueden jugar a la segura con cait menos vamos a discutir el meta en ese elo. Alli con que jueguen en la torre ya ganan, juegan tan segados que 10 de 10 partidas se te mandan bajo la torre si no salis.\n\nSaludos.","replies":[]},{"poster":"NerfAutoFill","date":"2017-01-23T09:55:34.197+0000","up_votes":1,"down_votes":0,"body":"la rata necesita peel si flanquea mal nomas","replies":[]}]}]}