{"poster":"Mintod98","date":"2016-05-10T01:39:58.876+0000","title":"Garens Q is negating stuns when he is mid animation","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hey everybody, In the past 3 or 4 games where there has been a garen ive been playing against, I have been encountering this bug. When Garen Q's and charges, if i stun him (for example with a xerath e) while he is mid swing (while the animation is happening) he does not get stunned! Now i know you may be thinking i may just get silenced, and my e didnt' go off, but that isnt' the case. My E (in xeraths case) goes on FULL COOLDOWN. There is nothing in Garen build that would negate my stun in any of these games. It was happening when i played xerath mostly. \r\nPlz Riot, look into this for me.","replies":[{"poster":"dArtagnan","date":"2016-05-10T04:43:49.368+0000","up_votes":1,"down_votes":0,"body":"League mechanics can get kind of wonky when it comes to different types of CC and what is actually registered.  For example, you can still cancel an auto-attack even though the entire animation goes through.  There are also a myriad of other abilities where you do get the cast off, nothing happens, and you still get the full cool-down timer.  At the core of this, it simply involves how the frames and windows of CC work with League.  The reason Garen doesn't get stunned is because the silence actually goes into effect instantly (before anything is shown for you being silenced) even though your ability goes through a full animation.  This usually has to happen in the same .25 second window though.  It is similar to how someone can be stunned, but appear to have flashed during the stun duration.\n\nI hope this clarifies a little bit, even though it is incredibly frustrating >.<","replies":[{"poster":"EnderForHegemon","date":"2016-05-10T08:27:39.822+0000","up_votes":3,"down_votes":0,"body":"Okay, but why would Xerath E for example, go on cooldown if it never cast because he was silenced? The ability should not be on cooldown in that case right?","replies":[]},{"poster":"soulbatt","date":"2016-05-10T15:38:54.426+0000","up_votes":1,"down_votes":0,"body":"moving a little away from stuns specifically if its a known issue where animations go though and CD is popped anyway that actually sounds like a major game breaking bug. its essentially the same as being able to repeatedly turn god mod on in a competitive game, especially when you consider this is the first time ive seen riot mention this as a known issues it looks like alot of favoritism towards garen.","replies":[]},{"poster":"Photos of Ghosts","date":"2016-05-10T15:00:54.151+0000","up_votes":1,"down_votes":0,"body":"Is that the same reason why projectiles seem to be disappearing since preseason?","replies":[]},{"poster":"Mr Toasted","date":"2016-05-10T05:59:49.723+0000","up_votes":1,"down_votes":0,"body":"Garens Q does have a few weird things to it though.  Try using a {{item:3087}} with him.  You can proc the magic damage about halfway through his Q animation and then cancel the auto and Q somebody else.","replies":[]}]},{"poster":"soulbatt","date":"2016-05-10T07:14:16.308+0000","up_votes":1,"down_votes":0,"body":"ive experienced this as well when using leona i can pop Q away from garen walk up and hit him to no effect, end game with cdr this can be a huge problem as garen basically removes a vital part of my kit even without his silence ","replies":[]}]}