{"poster":"Bokeyeone","date":"2019-01-01T15:04:52.114+0000","title":"Samurai Champion","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":1,"body":"F&auml;higkeiten:\n\nPassive: Ehrfurcht des Todes:\nWenn der Samurai stirbt, sticht er das Schwert in seinen Bauch und verursacht Fl&auml;chenschaden an gegnerischen Champions an seinem Todesort.\n\n\n1. Skill: Klinge der Habgier:\nPassive Komponente:\nSeine Autoattacks verleihen ihm die F&auml;higkeit Gold zu bekommen, \nwenn er gegnerische Champions schl&auml;gt.\n(Etwa wie die Rune Clyptomanie)\nAktive Komponente:\nDer n&auml;chste Schlag verursacht mehr Schaden. \nWenn das Ziel ein gegnerischer Champion war und stribt, erh&auml;lt der Samurai Bonusgold.\n\n2. Skill: Drachenhaut:\nPassive Komponente:\nDer Samurai erh&auml;lt dauerhaft Resistenz gegen Fernkampfautoattacks.\nAktive Komponente:\nErh&ouml;ht kurzzetig seine R&uuml;stung und Magieresistenz.\n\n3. Skill: Ansturm:\nDer Samurai bewegt sich schnell zum gegnerischen Ziel.\n(Etwa wie Xins E) {{champion:5}} \n\n4. Ultimate: Unterst&uuml;tzung der Drachen:\nW&auml;hle ein Zielort, wo der Odem der Drachen auf deine Gegner niederprasselt.\n(Etwa wie Gangplnaks Ultimate) {{champion:41}} \n\nIch muss dazu sagen, dass dieser Samurai stark an dem Samurai \naus dem Battle Realms Spiel orientiert ist.","replies":[{"poster":"Izaya Kumiho","date":"2019-01-01T15:17:49.498+0000","up_votes":4,"down_votes":0,"body":">Samurai Champion\n\n{{champion:157}} \n\n>Passive: Ehrfurcht des Todes:\nWenn der Samurai stirbt, sticht er das Schwert in seinen Bauch und verursacht Flächenschaden an gegnerischen Champions an seinem Todesort.\n\n{{champion:96}} {{champion:127}} \n\nIch mag jedoch, wie du hier etwas aus der Geschichte des asiatischen Raumes mit einbringst durch die Passive. Das klingt nach Seppuku/Harakiri. \n\n+1^\n\n>Seppuku (jap. 切腹) bezeichnet eine ritualisierte Art des männlichen Suizids, die etwa ab der Mitte des 12. Jahrhunderts in Japan innerhalb der Schicht der Samurai verbreitet war und 1868 offiziell verboten wurde.\nEin Mann, der wegen einer Pflichtverletzung sein Gesicht verloren hatte, konnte durch Seppuku die Ehre seiner Familie wiederherstellen. Weitere Gründe für Seppuku waren unter anderem Strafe für einen Gesetzesverstoß oder das sogenannte oibara (追腹), bei dem Rōnin (herrenlose Samurai), die ihren Daimyō (lokale Herren im feudalen Japan) verloren hatten, diesem in den Tod folgten, falls er es ihnen schriftlich erlaubt hatte.\nDer Begriff Harakiri (腹切り, von 腹 hara „Bauch“, und 切る kiru „schneiden“ – umgekehrte Reihenfolge der Kanji-Schriftzeichen) wird vor allem in Europa und Amerika benutzt.","replies":[]}]}