{"poster":"Larce","date":"2019-07-17T21:36:14.446+0000","title":"Sammelthread: Probleme beim Übergang von der Champ Select ins Spiel","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo Beschwörer!\n\nZurzeit erreichen uns mehrere Meldungen, bei denen Probleme direkt nach der Champ Select auftreten.\n\nHäufig erhält man dabei die Fehlermeldung \"A critical error has occurred and the process must be terminated.\"\nWeiter bietet die Fehlermeldung mit dem Titel \"System Error\" die Option an, einen Crash Dump zu generieren.\n\nDieser Fehler tritt normalerweise auf, wenn die Spieldateien von League of Legends beschädigt sind.\n\n# Der Player Support empfiehlt:\n- League schliessen, die Konfigurationsdateien unter C:\\Riot Games\\League of Legends\\Config löschen, und wieder starten. Die Dateien werden dann erneut heruntergeladen, die Einstellungen bleiben erhalten da diese auf dem Server gespeichert sind.\n- VPN zum einloggen nutzen (wenn möglich)\n- Steam, Origin, Razer Software und Spotify schliessen (diese verursachen manchmal Fehler und Probleme)\n\nBei manchen hilft es auch, alle Ordner unter C:\\Riot Games\\League of Legends\\Logs zu entfernen.\n\n# Einfacher HRT-Scan\nLade dir dazu das [Hextech Repair Tool](https://support.riotgames.com/hc/de/articles/224826367-Automatisierte-Fehlerbehebung-Hextech-Repair-Tool) herunter. Installiere es, und führe es anschliessend aus. Schliesse deinen League-Client.\n\nKlicke dann auf die Schaltfläche \"Start\", um den Scan durchzuführen. Dieser überprüft einige Systemeinstellungen (unter anderem Uhrzeit und Firewall) und behebt mögliche Fehlerursachen.\n\nÖffne den League-Client wieder und versuche, ein Spiel zu starten. Bitte teste mit einem **Custom Game**, so dass du kein Remake verursachst, und dich selbst vor dem Leaverbuster schützt.\n\nWenn dies nicht funktioniert hat:\n\n# Erneutes Patchen mit dem HRT\nSchliesse zuerst wieder den League-Client.\n\nStarte das Hextech Repair Tool wieder, und wähle diesmal bevor du auf \"Start\" klickst die Checkbox \"Erneutes Patchen erzwingen\" aus. Führe den Scan durch.\n\nStarte den League-Client wieder, jetzt sollte der letzte Patch neu heruntergeladen und installiert werden. Teste auch danach wieder, ob es funktioniert. Verwende bitte dazu wie oben beschrieben ein **Custom Game**\n\n# Erneute Installation mit dem HRT\nWenn das Problem mit den oberen Schritten nicht behoben werden konnte, kannst du noch versuchen League of Legends komplett neuzuinstallieren. Am einfachsten geht dies wieder über das Hextech Repair Tool. Schliesse erst deinen League-Client und öffne das HRT.\n\nWähle jetzt die Checkbox \"Neuinstallation\" aus, und klicke auf \"Start\". Du wirst jetzt durch den Neuinstallationsprozess geführt. Dieser kann einige Zeit in Anspruch nehmen.\n\nTeste auch danach wieder in einem **Custom Game**.\n\nWenn es bis hier nicht funktioniert hat, dann lade bitte die vom HRT auf dem Desktop angelegten Logdateien (.zip-Format) hier hoch und teile den Link im Kommentar: https://wrenchbox.de/ul/\n\nWeitere Informationen und Lösungsansätze dürfen hier gerne gesammelt werden.\n\nFreundliche Grüsse\nLarce","replies":[{"poster":"Little Soldier","date":"2020-02-22T12:26:13.917+0000","up_votes":1,"down_votes":0,"body":"Bei mir kommt auch ständig nach der Championauswahl die Fehlermeldung System Error und Crash Dumb. Hoffe das Problem kann gefixt werden.\nhttp://wrenchbox.de/ul/files/1582374180_5e511d242fb76.zip","replies":[{"poster":"Blacky1234","date":"2020-03-02T21:41:42.498+0000","up_votes":1,"down_votes":0,"body":"Siehe unten!\nHatte das selbe Problem!","replies":[]}]},{"poster":"N X z T","date":"2020-02-21T12:22:33.742+0000","up_votes":1,"down_votes":0,"body":"Hallo zusammen,\n\nich hatte das gleiche Problem - Sophos hat bei mir die Datei stub.dll jedes mal wieder gelöscht.\n\nHabe jetzt für die Datei selber und die Anwendungen LeagueClient.exe und League of Legends.exe alle möglichen Ausnahmen in Sophos hinzugefügt.","replies":[{"poster":"XKnightmar3X","date":"2020-02-21T19:40:40.040+0000","up_votes":1,"down_votes":0,"body":"wie hast du das auf sophos gemacht ?","replies":[]}]},{"poster":"Raktacosa","date":"2020-01-21T20:32:14.588+0000","up_votes":1,"down_votes":0,"body":"http://wrenchbox.de/ul/files/1579638714_5e275fbaab648.zip","replies":[{"poster":"Blacky1234","date":"2020-01-21T23:45:27.721+0000","up_votes":1,"down_votes":0,"body":"DirectX Database Version: Unknown\nDX Setup Parameters: Not found","replies":[{"poster":"Raktacosa","date":"2020-01-22T16:42:29.077+0000","up_votes":1,"down_votes":0,"body":"Danke schonmal aber wie behebe ich das am besten ? DirektX neu runterladen und das andere ??\nLG Raktacosa","replies":[{"poster":"Blacky1234","date":"2020-01-24T17:24:06.300+0000","up_votes":1,"down_votes":0,"body":"Ich würde sagen einfach mal testen mir DX Installation.\nwenn das nicht Hilft dann evtl. mal den Vorschlag von mir weiter unten testen.","replies":[]}]}]}]},{"poster":"Werner1993","date":"2019-12-25T18:08:44.837+0000","up_votes":1,"down_votes":0,"body":"http://wrenchbox.de/ul/files/1577297263_5e03a56f0dfa8.zip\n\nfunktioniert einfach nicht, hab es auch schon deinstalliert und wieder installiert.","replies":[{"poster":"Blacky1234","date":"2019-12-26T14:54:45.591+0000","up_votes":1,"down_votes":0,"body":"Auf die schnelle, fällt mir auf, dass es ein Problem gibt, das mehrere Programme/Spiele betrifft.\nDX Setup Parameters: Not found\nDirectX Database Version: Unknown\nDxDiag Previously: Crashed in system information (stage 4)\n\nMal DirectX neu installieren.\n\nDann in der CMD (Administrator Modus) den Befehle sfc /scannow ausführen.\n\nDesweiteren ein Programm installieren das Maleware bekämpft/eindämmt.\n\nGrafiktreiber sind ja Aktuell.\n\nFreue mich über Rückmeldung.","replies":[]}]},{"poster":"ReNoMiX","date":"2019-12-19T20:44:38.661+0000","up_votes":1,"down_votes":0,"body":"Größten Dank\nhat geklappt","replies":[]},{"poster":"InZac","date":"2019-12-11T17:51:38.323+0000","up_votes":1,"down_votes":0,"body":"Hallo ich hatte das gleiche Problem auch 10 Tage lang im Patch 9.23, habe alles versucht nichts hat geklappt. Windows neuinstallieren, alle Firewalls Deaktivieren, LOL neu installiert. Aber nachdem Patch 9.24 installiert wurde hat alles wieder geklappt... Naja manchmal hilft nur Geduld...","replies":[]},{"poster":"Blacky1234","date":"2019-11-19T01:04:43.100+0000","up_votes":1,"down_votes":0,"body":"Bei mir läuft es derzeit.\nWas habe ich gemacht, außer der oben genannten Prozedur?\nIch habe die Nvidia Einstellung verändert!\nIn den 3D Einstellungen habe ich die Auswahl \"Programmeinstellungen\" gewählt.\nDort habe ich den \"League of Legends Client\" gewählt und die Einstellung wie in den Bildern vorgenommen.\n\n\nhttp://wrenchbox.de/ul/files/1574124793_5dd33cf90581b.png\nhttp://wrenchbox.de/ul/files/1574124793_5dd33cf927a96.png\n\nGebt bitte eine Rückmeldung, wenn es bei euch dadurch auch wieder geht!","replies":[]},{"poster":"wiMpa","date":"2019-10-14T11:36:10.809+0000","up_votes":1,"down_votes":0,"body":"Leider auch kein Erfolg:\n\nhttp://wrenchbox.de/ul/files/1571052893_5da45d5d35663.zip","replies":[{"poster":"Blacky1234","date":"2019-11-18T16:29:47.821+0000","up_votes":1,"down_votes":0,"body":"Bei Ihnen Laufen 4 LOL Clienten","replies":[]}]},{"poster":"Blacky1234","date":"2019-11-18T16:23:19.617+0000","up_votes":1,"down_votes":0,"body":"Was sehr auffällig ist das Die 5 Leute unter mir alle Win 10 64 bit haben und GTX Gafikkarten. Btw Glückwunsch zum Alienware :)\nBei mir ist es das selbe...\nAch ja Datenschutz wird hier auch sehr Groß geschrieben....\n\nIP Adressen Netzwerknamen Benutzernamen Computer Namen Mac Adressen \nDamit kann man schon einiges anstellen^^\n\nHab noch ein wenig Probiert und Geschaut Nach der Auswahl Versucht er das neue Fenster zu öffnen Dabei geht die Grafikkartenauslastung schlagartig auf 100 % 1 sec später--> Schwerer Fehler Zufall!?","replies":[]},{"poster":"p5 Raptus","date":"2019-11-08T13:03:31.802+0000","up_votes":1,"down_votes":0,"body":"seid mehrern monaten das probelm nix hilft\nhttp://wrenchbox.de/ul/files/1573218181_5dc56785e9869.zip","replies":[]},{"poster":"Trivil","date":"2019-10-30T15:12:50.424+0000","up_votes":1,"down_votes":0,"body":"http://wrenchbox.de/ul/files/1572448353_5db9a861197d9.zip\nJo bei mir geht auch gar nichts mehr.","replies":[]},{"poster":"Danee","date":"2019-10-17T12:04:39.047+0000","up_votes":1,"down_votes":0,"body":"Hier meine Logs : http://wrenchbox.de/ul/files/1571313758_5da8585e9c24a.zip\nHab alles schon probiert und bin am ende. Ich kann kein Match starten und es stört extrem.\nWin neu installiert, Lol ca. 7 mal neu installiert und jegliche Sachen ausprobiert..\nHoffe man kann mir hier weiterhelfen","replies":[]},{"poster":"AcExplosion","date":"2019-10-16T18:04:17.642+0000","up_votes":1,"down_votes":0,"body":"Ich bin mit meinem Latein am Ende, bitte um Hilfe, habe alles probiert. \n\nhttp://wrenchbox.de/ul/files/1571249019_5da75b7b0e509.zip","replies":[]},{"poster":"RankedSirMomo","date":"2019-10-07T13:07:57.515+0000","up_votes":1,"down_votes":0,"body":"Moin hab alles versucht und es geht nichts!  schon seid 5 Tagen !!! \nhttp://wrenchbox.de/ul/files/1570453353_5d9b3769c0e13.zip","replies":[]},{"poster":"xrbite","date":"2019-09-29T20:13:39.145+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nhat leider bei mir nichts geholfen, kann das Spiel noch immer nicht starten\nhttp://wrenchbox.de/ul/files/1569787911_5d91100730cdf.zip","replies":[]},{"poster":"THESilverSmurFER","date":"2019-09-20T15:47:23.754+0000","up_votes":1,"down_votes":0,"body":"guten tag\nheute nochmal lol gestartet und das problem nach der champselect das ein bugsplat kommt habe einen 6 tage alten post gefunden das es am windows update liegt und ich dieses löschen soll...hoffe mal das das nicht die lösung des problems ist und bitte dahér um hilfe...danke im vorraus","replies":[]},{"poster":"SigaZed Senpai","date":"2019-07-25T17:17:17.315+0000","up_votes":1,"down_votes":0,"body":"Moin Moin zusammen.\nAlso Ich habe dasselbe Problem auch seit drei Tagen.. Ich bin echt verzweifelt und weiss nicht was ich tun soll. Die oben genannten Lösungsvorschläge haben leider nichts gebracht. Ich spiele seit 1-2 Jahren wieder regelmäßig LoL und muss sagen, dass es, bis auf ein paar gewöhnliche Komplikationen an vereinzelten Tagen, relativ gut spielbar war und ich von daher kaum Probleme hatte mit dem Spiel. Sei es bei nem Freund, sei es bei mir, sei es mit WLAN oder mit dem Lan-Kabel. Da mir das Spiel unglaublich Spaß macht und ich momentan dementsprechend aktiv in diesem Spiel bin, regt mich das quasi nur umso mehr auf, dass ich nun nicht mehr spielen kann und im Internet absolut keine Lösung für GENAU DIESES Problem finde.\n\nIch hoffe Riot Games nimmt DIESES PROBLEM in die Hand und tut was für IHRE AKTIVEN ZOCKER, die schliesslich Tage verbringen und sogar Geld investieren in Skins usw. \nIch fordere keine Entschädigung, sondern wenigstens eine Nachricht, dass DIESES PROBLEM IHNEN bekannt ist und sich DARUM GEKÜMMERT wird. \n\nIch weiss momentan somit nähmlich nicht, ob ich überhaupt jemals noch spielen darf, da bei mir ständig der Button *RECONNECT* kommt und daraufhin sich einfach nichts ändert, egal was man tut.\n\nnaja.. :-/    einfach nur schade :-(","replies":[]},{"poster":"Tréndsetter","date":"2019-07-22T14:47:37.422+0000","up_votes":1,"down_votes":0,"body":"Also, ich hatte das Problem auch, jedoch nachdem ich \n1. Alle anderen Programme geschlossen habe und\n2. Einen LoL-Prozess der im Hintergund noch offen war (Aus unerfindlichen Gründen) geschlossen habe\nGing es direkt wieder.\n\nVlt. hilft das euch","replies":[]},{"poster":"Ducks Schatten45","date":"2019-07-21T09:08:23.184+0000","up_votes":1,"down_votes":0,"body":"Es geht mir mittlerweile so auf den Sack, ich habe mittlerweile 10 spiele mehr Verloren als Gewonnen wegen diesen SCHEIß Error entweder Fliege ich oder andere leute aus dem Spiel..., was bekommt man.... NICHTS außer ne verfickte entschuldigung....DAMALS hat man noch eine entschädigung bekommen mitterweile reicht Riot ein \"oh sorry tut mir leid\"........aber mittlerweile schwimmen diese Affen in Geld und kriegen trozdem nicht geschissen........und ein Sorry oder sonstwas bringt mir mein scheiß Rang auch nicht zurück oder den Restrictions(Honor etc.) da man ja wegen AFK reportet wir auch nichts .......wie wäre es mal den scheiß grund der AFK-Meldung nach zu gehen wenn euch BEKANNT ist das es so einen ERROR gibt?.........ne zu viele arbeit für das geld huh? geht mir das auf die eier seit etlichen jahren spiele ich LEAGUE aber sowas ist echt zum kotzen und kommt mir jetzt nicht mit \"Bleib mal ruhig\" als lang jähriger spieler darf ich mir ja wohl mal leisten ein mal aus der haut zu fahren weil mich etwas dermaßen aufregt.\n\nachja was habe ich unternommen ALLES, JEDE MAßNAHME, NICHTS hilf der Scheiß kommt Trozdem.....wenn einer eurer Champs verbuggt is kommt nach wenigen Stunden ein Hotfix.....aber wenn mal was ernsthaftes passiert lasst ihr eure Spieler hängen und braucht wieder 500 jahre....\n{{sticker:slayer-pantheon-thumbs}}    Ihr seit die Besten.....SLOWCLAP*","replies":[]},{"poster":"Kratoss92","date":"2019-07-20T19:20:39.566+0000","up_votes":1,"down_votes":0,"body":"Alles ausprobiert, es funktioniert nichts.","replies":[]},{"poster":"Xodar","date":"2019-07-20T13:11:14.574+0000","up_votes":1,"down_votes":0,"body":"Hab das gleiche Problem, weder HRT noch neu installieren hat mir weitergeholfen. Bekomme weiterhin die Critical Error Meldung und kann nicht ins Game rein. Das hat mir ziemlich mein Placement verhauen","replies":[]},{"poster":"DerSpliffendeDon","date":"2019-07-20T12:18:07.625+0000","up_votes":1,"down_votes":0,"body":"Kleiner Vorschlag, die durch SKin Geld vollgepumpte Firma Riot bekommt mal seinen Scheiß gefixt und gibt allen betroffenen nen Boni wie 200 RP oder sonst was. Nach den Bugs in letzter Zeit wäre es das mindeste... So verkrault man auch die langjährigen Fans, bin seit Season 1 dabei...","replies":[]},{"poster":"Sanny","date":"2019-07-19T20:47:47.911+0000","up_votes":1,"down_votes":0,"body":"Hatte das Problem seit 9.14! Nur einmal deinstallieren und neu installieren hat bei mir geholfen!\nAber heute hatte ich das Problem ebenfalls und da hat mir das geholfen:\n> League schliessen, die Konfigurationsdateien unter C:\\Riot Games\\League of Legends\\Config löschen, und wieder starten. Die Dateien werden dann erneut heruntergeladen, die Einstellungen bleiben erhalten da diese auf dem Server gespeichert sind.\n\nLG","replies":[]},{"poster":"BreakerBoy","date":"2019-07-19T00:02:40.272+0000","up_votes":1,"down_votes":0,"body":"Weder das Hextech Tool noch eine Neuinstallation können helfen. Wollte echt gerne TFT Ranked spielen, ist aber so nicht möglich da man ständig unnötig LP verliert. Pls Fix","replies":[]},{"poster":"Zaramay","date":"2019-07-18T20:56:21.582+0000","up_votes":1,"down_votes":0,"body":"Ich habe das alles auch ausprobiert, hat leider nicht funktioniert. Das Problem ist heute über den Tag hinweg neben dem \"Bugsplat\"-Problem vermehrt aufgetaucht. Habe am Abend ewig gewartet, bis ich mit meinen Freunden ne Runde spielen kann (Gott sei Dank nur ARAM und kein Ranked) und dann kommt dieser \"critical error\". Hatte einen Black Screen, konnte meinen Laptop nur noch gewaltsam ausschalten. Das ging dreimal so, bis mein Laptop dann auch nicht mehr wollte (verständlicherweise). Bis ich wieder online war, war das Spiel vorbei, alle offline, Abend gelaufen. Ein schönes D- im Spielverlauf und wahrscheinlich den ein oder anderen Report. \n\nIch glaube leider auch, dass mit dem Patch etwas ganz gewaltig nicht stimmt, vorher lief nämlich alles gut :( und dass das Problem vermehrt und bei sehr vielen auftaucht (kaum mehr ein Spiel gespielt in dem alle 10 Spieler da waren), spricht auch dafür...","replies":[]},{"poster":"BreakerBoy","date":"2019-07-18T17:58:48.361+0000","up_votes":1,"down_votes":0,"body":"Es liegt am Patch.  Haben ja nicht umsonst auf einmal alle dieses Problem. Bitte fixen Riot","replies":[]},{"poster":"RB cheter","date":"2019-07-18T15:03:14.785+0000","up_votes":1,"down_votes":0,"body":"Guten abend hat alles nicht funkioniert....\nhier der link bitte um lösung\nhttp://wrenchbox.de/ul/files/1563462131_5d3089f3d14e2.zip","replies":[]},{"poster":"Í am Udyr","date":"2019-07-18T13:20:40.072+0000","up_votes":1,"down_votes":0,"body":"Alles probiert, geht nicht, im Gegenteil, wenn ich nachm3ten mal reconnecte bekomm ich ihn 5min später geich nochmal.. ich bin echt Sauer… ganze Nacht gestern alles neu runtergeladen damit ich heute dieselbe Sch…. wieder habe. Danke für nichts!","replies":[]},{"poster":"00 M4ddin 00","date":"2019-07-18T08:59:40.726+0000","up_votes":1,"down_votes":0,"body":"Muss ich heute Abend mal schauen. Hatte den Fehler zwar aber hab danach auch einfach ausgemacht ^^' \n\nHoffe das startet heute einfach wieder ohne Probleme","replies":[]},{"poster":"powerred6","date":"2019-07-17T23:38:50.080+0000","up_votes":1,"down_votes":0,"body":"Es geht nicht.","replies":[]}]}