{"poster":"ColdHands","date":"2017-02-23T05:27:24.890+0000","title":"Rework Aatrox Urgente","subforum":"Charlas Generales","up_votes":4,"down_votes":6,"body":"Quiero tocar un tema urgente que es el rework de Aatrox que creo que la mayor&iacute;a de los mains aatrox estar&aacute; de acuerdo que no es lo que esper&aacute;bamos todos cre&iacute;amos que era algo para que durara mas en late game  y la q dejara de ser tan in&uacute;til en mi opini&oacute;n lo arruinaron se transformo en otro rengar mas","replies":[{"poster":"Kyousuke","date":"2017-02-23T05:46:18.433+0000","up_votes":1,"down_votes":2,"body":"el rework me parece BRUTAL, su pasiva ahora se carga rápido en una tf cosa que antes tardaba mucho, tiene mucho daño y buenos escalados lo que lo hace mejor aun con la sinergia de su pasiva y el fervor de combate, solo necesitas entrar bien con ulti y agarrar a 3 para tener la pasiva a FULL y empezar a pegar como un buen dios de la guerra manda. \nla pasiva de ahora le quita lo \"seguro\" haciendo que sea un diver menos eficiente pero mejor iniciador y gankeador, su heal ahora aumenta por cada 5% de vida perdida lo que a baja hp lo hace curarse un montonaso.\nlo único que no me llega a gustar son el tiempo para revivir que serian 4 segundos si no estas en combate contra un campeón (básicamente la duración de la pasiva) y que en baron/dragón no se reinicie el tiempo al esta combatiendo.\n\npero son cambios buenísimos y MUUUY necesarios, antes de llorar por el rework primero deja que llegue y después quéjate todo lo que quieras, recorda que este es su primer día en el pbe y pueden cambiar muchas cosas ","replies":[]},{"poster":"kiuhm","date":"2017-02-23T05:34:26.407+0000","up_votes":1,"down_votes":2,"body":"La verdad a simple vista parece que lo perjudicaron un monton. quieren que entre a tf a burstear y morir de dos hits... no se que onda. Lo hubiesen dejado como estaba. Despues de todo ya estaba en la miseria.","replies":[]},{"poster":"NerfAutoFill","date":"2017-02-23T05:30:09.993+0000","up_votes":1,"down_votes":2,"body":"http://boards.na.leagueoflegends.com/en/c/memes/8WbadKHE-looking-at-the-aatrox-pbe-changes","replies":[]},{"poster":"Yrox the Third","date":"2017-02-23T05:28:42.899+0000","up_votes":1,"down_votes":2,"body":"Disculpa, ¿pero quien es el?","replies":[]}]}