{"poster":"Bârd","date":"2017-11-13T07:48:19.101+0000","title":"Transcendence is balanced and Black Cleaver is balanced.","subforum":"Gameplay","up_votes":93,"down_votes":9,"body":"It&#039;s just the combination of the two that makes this broken.\n\nDon&#039;t go gutting either of them, just make the CDR on {{item:3071}} unique","replies":[{"poster":"Mega Noob","date":"2017-11-13T08:05:32.016+0000","up_votes":40,"down_votes":6,"body":"What makes broken what? \nthat extra 25 ad from 20 cdr? \nWhy not get 20 lethality instead? And some usefull passives? Like {{item:3814}} or {{item:3812}} \nWhat a nonsense, paying 3k for 65 ad and 400 hp.","replies":[{"poster":"Omnem Occido","date":"2017-11-13T08:22:10.633+0000","up_votes":17,"down_votes":8,"body":"Um... it's kinda the defacto tank shredding item used by juggernauts to absolutely ruin their laning opponents. It also gives them movement speed for dealing physical damage, something juggernauts need.\n\nIt's THE class defining item.","replies":[{"poster":"Automated Riven","date":"2017-11-13T10:46:15.994+0000","up_votes":32,"down_votes":2,"body":"But stacking them doesn't bust tanks harder. I have played a few games with cleaver stacking and it simply isn't that terribly strong. It's just super safe.","replies":[{"poster":"RISE Shlack123","date":"2017-11-13T19:29:44.426+0000","up_votes":11,"down_votes":1,"body":"You're right - the passive doesn't stack.  What's making the Black Cleaver stacking so oppressive is that assassins can stack them, get tanky, and still get bonus AD from Transcendence and the AD on Black Cleaver, and then be hard to kill while stomping squishies who can't easily kill them anymore.","replies":[]}]},{"poster":"Poske","date":"2017-11-13T18:09:26.725+0000","up_votes":1,"down_votes":16,"body":"> [{quoted}](name=Omnem Occido,realm=NA,application-id=3ErqAdtq,discussion-id=rQkzk5aT,comment-id=00010001,timestamp=2017-11-13T08:22:10.633+0000)\n>\n> Um... it&#x27;s kinda the defacto tank shredding item used by juggernauts to absolutely ruin their laning opponents. It also gives them movement speed for dealing physical damage, something juggernauts need.\n> \n> It&#x27;s THE class defining item.\n\nIts not a juggernaut item its more of J4/Riven item","replies":[{"poster":"Corvid","date":"2017-11-13T19:47:04.777+0000","up_votes":18,"down_votes":0,"body":"> [{quoted}](name=Poske,realm=EUNE,application-id=3ErqAdtq,discussion-id=rQkzk5aT,comment-id=000100010001,timestamp=2017-11-13T18:09:26.725+0000)\n>\n> Its not a juggernaut item its more of J4/Riven item\n\nDarius... garen.... ????????","replies":[{"poster":"Iota Theta","date":"2017-11-13T22:51:57.407+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Outrider99,realm=NA,application-id=3ErqAdtq,discussion-id=rQkzk5aT,comment-id=0001000100010000,timestamp=2017-11-13T19:47:04.777+0000)\n>\n> Darius... garen.... ????????\n\nCan add Illaoi to that list.","replies":[]},{"poster":"Wolfeur","date":"2017-11-14T11:31:08.755+0000","up_votes":2,"down_votes":0,"body":"Urgot?","replies":[]}]}]},{"poster":"Eedat","date":"2017-11-13T22:14:17.403+0000","up_votes":3,"down_votes":0,"body":"True, but the point of this thread is buying multiple BCs. The armor shred does not stack. You get the same amount of armor shred with 1 BC as with 5 BCs.","replies":[]}]},{"poster":"Auz the Ripper","date":"2017-11-13T16:34:02.693+0000","up_votes":5,"down_votes":1,"body":"It's because the Black Cleaver is one of the few complete AD item that is by itself gold efficient on stats alone, even without transcendence. ","replies":[{"poster":"PB4UAME","date":"2017-11-13T20:28:18.444+0000","up_votes":1,"down_votes":0,"body":"Every single ADC item is more than gold efficient from stats alone. . . Before you even account for the multiplicative value of their stats.","replies":[{"poster":"Pierce The Veal","date":"2017-11-13T23:51:11.156+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=PB4UAME,realm=NA,application-id=3ErqAdtq,discussion-id=rQkzk5aT,comment-id=000100020001,timestamp=2017-11-13T20:28:18.444+0000)\n>\n> Every single ADC item is more than gold efficient from stats alone. . . Before you even account for the multiplicative value of their stats.\n\nYep, and yet people are complaining that people MIGHT stack black cleavers.\n\nI'm more worried about some ADC going something like essence reaver, phantom dancer IE, triforce, black cleaver+random boots or another crit item. Fast as heck, and yet tons of AD, has shred built in, and furthermore is tanky as heck. Only thing missing is lifesteal and you could easily make the last item a death's dance to just give people cancer.","replies":[]}]},{"poster":"Faceroll Tactics","date":"2017-11-13T19:06:01.303+0000","up_votes":5,"down_votes":2,"body":"But just because it's gold efficient doesn't mean it's worth stacking the and losing the gold worth that Rage and Shred do.\n\nRage is worth 300 gold if you're consistent with it, Shred is worth over 1000 if you get 5 stacks on a tank","replies":[]}]}]},{"poster":"RiotRepertoir","date":"2017-11-13T23:50:43.249+0000","up_votes":22,"down_votes":2,"body":"This seems like the likely adjustment to make.\n\nOne other consideration worth making is if the effect on Transcendence is properly tuned outside of the \"abuse stacking a bunch of the same 20% CDR item\" case. We'll have to look into that part as well as Runes tuning carries on into the coming months.","replies":[{"poster":"Raxistaicho","date":"2017-11-14T00:05:51.240+0000","up_votes":13,"down_votes":5,"body":"Honestly I'd suggest making cdr on _every_ item unique, just to make sure this doesn't happen again.","replies":[{"poster":"Häxel","date":"2017-11-14T19:07:46.419+0000","up_votes":3,"down_votes":1,"body":"on Items that bulds into another items it already is unique. And most items are just not worth stackign for their unique passives and the stats they give (or even unique actives). And the other ones already have unique cdr (nashors/warmogs). And Bc is like these 2 cause it gives you good stats: Much ad and much health. i mean if you realy just want to stack spirit visages while there are plenty of mr AND Cdr items, well than you already waste potential. No need to change that cd into unique cdr. If you just buy frozen hearts you will have much cdr for transcendence and much armor, but literaly nearly no health AND you are weak to magic damage.","replies":[]}]},{"poster":"StoryDuck","date":"2017-11-14T01:13:46.857+0000","up_votes":6,"down_votes":0,"body":"I've often wondered, why not just make all finished items unique?  Is there a reason for allowing players to build 2-4 of the same finished item?  The only times I see this is if there is a game breaking thing like now or when people are trolling.","replies":[{"poster":"Pierce The Veal","date":"2017-11-14T10:00:34.496+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jharr,realm=NA,application-id=3ErqAdtq,discussion-id=rQkzk5aT,comment-id=001a0003,timestamp=2017-11-14T01:13:46.857+0000)\n>\n> I&#x27;ve often wondered, why not just make all finished items unique?  Is there a reason for allowing players to build 2-4 of the same finished item?  The only times I see this is if there is a game breaking thing like now or when people are trolling.\n\nBecause it honestly wouldn't be fair.\n\nThe black cleaver stacking is nowhere near as viable as people make it out to be. And on the other hand, removing all finished items stacking would prevent people from coming up with interesting strats.","replies":[{"poster":"StoryDuck","date":"2017-11-14T11:41:29.806+0000","up_votes":1,"down_votes":0,"body":"Could you give me an example of when it wouldn't be fair?  \n\nI'm sorry but I just can't figure out any finished item that you need to or ever should build 2-4 of.  To clarify, when I say finished item I mean items like {{item:3102}} {{item:3174}} {{item:3742}} and not items that build into things like {{item:3144}} {{item:1042}} {{item:3801}}","replies":[{"poster":"Pierce The Veal","date":"2017-11-14T14:01:53.478+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jharr,realm=NA,application-id=3ErqAdtq,discussion-id=rQkzk5aT,comment-id=001a000300000000,timestamp=2017-11-14T11:41:29.806+0000)\n>\n> Could you give me an example of when it wouldn&#x27;t be fair?  \n> \n> I&#x27;m sorry but I just can&#x27;t figure out any finished item that you need to or ever should build 2-4 of.  To clarify, when I say finished item I mean items like {{item:3102}} {{item:3174}} {{item:3742}} and not items that build into things like {{item:3144}} {{item:1042}} {{item:3801}}\n\nCurrently there's no real case where you might want to stack the same item except for example maybe nashors tooth with transcendence. The issue here isn't that. The issue here is even in this one case, it's not even strong and moreso lackluster than anything else. So preventing stacking items would only actually prevent people from doing fun stupid shit/trying weird shit. Hence it is enforcing a certain gameplay rather than anything else. More power to the player is always my motto. Next thing you know we're demanding Riot to mail people pacifiers that they must suck on to play this game.","replies":[{"poster":"StoryDuck","date":"2017-11-14T15:09:52.845+0000","up_votes":1,"down_votes":0,"body":"How does building {{item:3153}} {{item:3153}} {{item:3153}} {{item:3153}} create more fun for someone other then they are trolling?  If you want more fun combining additional items with unique passives is what does it not stacking 4 of the same item.  You have kind of proved my point, the only time people do this is to troll or because the system breaks the item to give you an advantage.  What item do you build 4 of to have more fun with that isn't trolling? \n\n{{item:3083}} {{item:3083}} {{item:3083}} {{item:3083}} ?\n{{item:3060}} {{item:3060}} {{item:3060}} {{item:3060}} ?\n{{item:3156}} {{item:3156}} {{item:3156}} {{item:3156}} ?\n{{item:3074}} {{item:3074}} {{item:3074}} {{item:3074}} ?\n{{item:3285}} {{item:3285}} {{item:3285}} {{item:3285}} ?\n\nThere really isn't any item that building 4 of makes it more fun except in the cases of trolling.  For the record {{item:3070}} is not a finished item so you can still {{item:3070}} up when you team loses.  \n\nWhat does happen is occasionally certain items can be stacked up to do stupid stuff.  Remember supports building {{item:3504}} {{item:3504}} {{item:3504}} {{item:3504}}?  There have been many situations in which an item is given too many stats and people just buy 4 of them to take advantage of it.  I would also add that making finished items unique would make it easier for new players to buy items as they can't accidentally buy the same item twice clearing up purchasing a bit for them.  many new players see {{item:3072}} with the unique +20% life steal and think they can't get anymore lifesteal.  Not to mention that used to be an item that people purchased 4 of to have 80% lifesteal on auto attacks.  Draven was a nightmare then.\n\nThis doesn't really detract for unique builds either it just prevents trolling.  Now if there was a genuine item added that was meant to be made multiple times it would be different.  It would also be easier just to give it the ability to be built multiple times rather then combing through all items to find one that is unhealthy to be stacked.","replies":[{"poster":"V D","date":"2017-11-14T15:27:21.198+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jharr,realm=NA,application-id=3ErqAdtq,discussion-id=rQkzk5aT,comment-id=001a00030000000000000000,timestamp=2017-11-14T15:09:52.845+0000)\n>\n> How does building {{item:3153}} {{item:3153}} {{item:3153}} {{item:3153}} create more fun for someone other then they are trolling?  If you want more fun combining additional items with unique passives is what does it not stacking 4 of the same item.  You have kind of proved my point, the only time people do this is to troll or because the system breaks the item to give you an advantage.  What item do you build 4 of to have more fun with that isn&#x27;t trolling? \n> \n> {{item:3083}} {{item:3083}} {{item:3083}} {{item:3083}} ?\n> {{item:3060}} {{item:3060}} {{item:3060}} {{item:3060}} ?\n> {{item:3156}} {{item:3156}} {{item:3156}} {{item:3156}} ?\n> {{item:3074}} {{item:3074}} {{item:3074}} {{item:3074}} ?\n> {{item:3285}} {{item:3285}} {{item:3285}} {{item:3285}} ?\n> \n> There really isn&#x27;t any item that building 4 of makes it more fun except in the cases of trolling.  For the record {{item:3070}} is not a finished item so you can still {{item:3070}} up when you team loses.  \n> \n> What does happen is occasionally certain items can be stacked up to do stupid stuff.  Remember supports building {{item:3504}} {{item:3504}} {{item:3504}} {{item:3504}}?  There have been many situations in which an item is given too many stats and people just buy 4 of them to take advantage of it.  I would also add that making finished items unique would make it easier for new players to buy items as they can&#x27;t accidentally buy the same item twice clearing up purchasing a bit for them.  many new players see {{item:3072}} with the unique +20% life steal and think they can&#x27;t get anymore lifesteal.  Not to mention that used to be an item that people purchased 4 of to have 80% lifesteal on auto attacks.  Draven was a nightmare then.\n> \n> This doesn&#x27;t really detract for unique builds either it just prevents trolling.  Now if there was a genuine item added that was meant to be made multiple times it would be different.  It would also be easier just to give it the ability to be built multiple times rather then combing through all items to find one that is unhealthy to be stacked.\n\n{{item:3027}} {{item:3027}} {{item:3027}} {{item:3027}} {{item:3003}} \n\nHowever, I wouldn't do that, but to each their own.","replies":[{"poster":"StoryDuck","date":"2017-11-14T16:41:32.026+0000","up_votes":1,"down_votes":0,"body":"That would be a troll build sir.  Either that or a very uninformed build that a new player might think is good but it really isn't.","replies":[{"poster":"Pierce The Veal","date":"2017-11-15T01:37:37.150+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jharr,realm=NA,application-id=3ErqAdtq,discussion-id=rQkzk5aT,comment-id=001a0003000000000000000000000000,timestamp=2017-11-14T16:41:32.026+0000)\n>\n> That would be a troll build sir.  Either that or a very uninformed build that a new player might think is good but it really isn&#x27;t.\n\nUh. Clearly you haven't been around long enough.","replies":[{"poster":"StoryDuck","date":"2017-11-15T12:32:49.476+0000","up_votes":1,"down_votes":0,"body":"No, I've been playing since season 3.  I'm in diamond and every time I think abut this the more I'm convinced it would benefit new players.  Perhaps you like to troll and make very subpar builds but teaching new players this creates poor expectations.","replies":[{"poster":"Pierce The Veal","date":"2017-11-15T12:58:35.562+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jharr,realm=NA,application-id=3ErqAdtq,discussion-id=rQkzk5aT,comment-id=001a000300000000000000000000000000000000,timestamp=2017-11-15T12:32:49.476+0000)\n>\n> No, I&#x27;ve been playing since season 3.  I&#x27;m in diamond and every time I think abut this the more I&#x27;m convinced it would benefit new players.  Perhaps you like to troll and make very subpar builds but teaching new players this creates poor expectations.\n\nBeing allowed to play as you wish and learn that way is great. Being forced into shit, no matter how optimal it is, is shitty.","replies":[{"poster":"StoryDuck","date":"2017-11-15T14:01:45.437+0000","up_votes":1,"down_votes":0,"body":"There is over 200 items in LOL so what are you being forced into?","replies":[]}]}]}]}]}]},{"poster":"Pierce The Veal","date":"2017-11-15T01:36:57.014+0000","up_votes":1,"down_votes":0,"body":"Except the freedom to do that is crucial. What's wrong with being allowed to do stupid shit? There have been times it stuck. Like double morellonomican. \n\nBeing forced to play a certain way *just because* is toxic. Playing it that way cause it's optimal is fine, but when you're actually barred from making the decision, we have a problem.","replies":[{"poster":"StoryDuck","date":"2017-11-15T12:39:57.840+0000","up_votes":1,"down_votes":0,"body":"No one is being forced to build a certain way, not one.  Have you counted the number of items in LOL at this time?  There are over 200 items in lol and you're telling me you don't have the freedom to be creative in your builds if you can't build 4 of the same finished item?  That is what we call denial sir.  You just don't want anything to change, you're not willing to admit you could be wrong, that or you just want to be able to troll.  No one has been able to produce one example of when this would be a good thing and the only times that the meta supports 4x of the same item is when something is not balanced correctly and riot needs to patch it out.  If you can provide me with one example of when it would be a good practice to build 4 of the same finished item I will retract my statement but the fact is no one can provide such a thing because making all finished items unique is a good idea.","replies":[]}]}]}]},{"poster":"Jerry SeinfeId","date":"2017-11-14T15:28:06.287+0000","up_votes":1,"down_votes":0,"body":"Singed pre passive rework could go {{item:3027}} {{item:3027}} {{item:3027}} {{item:3027}} {{item:3027}} {{item:3027}}. Again not \"optimal\" but it was possible to pull off.\n\nwhich is the whole point, dumb shit that's \"viable\" is fun, this is a game so i wanna have fun.\n\nthat's all BC stacking is a gimmick.","replies":[]}]}]}]},{"poster":"DeadUnborn","date":"2017-11-14T04:20:48.777+0000","up_votes":2,"down_votes":0,"body":"If staking the same item twice outside of entry level items like tome and long sword is supposed to be gold inefficient, then every time a champ is able to do it the result is usually busted (I remeber Azir buying 2 morellos for the CDR + attack speedcombo back in the say).\n\nI guess my question is: why not make it so that end tier items cannot be purchased more than once? This means you can't buy 2 boots, 2 sunfire capes, 2 BC and such.\n\nI understand you use \"unique passives\" to have this to a certain degree, but to me right now it seems like you are beating around the bush instead of cutting the problem by the roots","replies":[]},{"poster":"Jesus is Savior","date":"2017-11-15T00:28:22.984+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=rQkzk5aT,comment-id=001a,timestamp=2017-11-13T23:50:43.249+0000)\n>\n> This seems like the likely adjustment to make.\n> \n> One other consideration worth making is if the effect on Transcendence is properly tuned outside of the &quot;abuse stacking a bunch of the same 20% CDR item&quot; case. We&#x27;ll have to look into that part as well as Runes tuning carries on into the coming months.\n\nIs it even worth changing? I heard it was a troll build. ie: it works, but it's not actually as efficient as people think it is.","replies":[]},{"poster":"Yma S","date":"2017-11-14T16:47:30.565+0000","up_votes":1,"down_votes":0,"body":"\"Stacking CDR is abuse\"\n\nlol no, not when every squishy mage is henpecked forced into rushing morellos, and every AD bruiser rushes Black cleaver.","replies":[]},{"poster":"xxxDogmanxxx","date":"2017-11-14T16:12:28.896+0000","up_votes":1,"down_votes":0,"body":"Nah, just make the CDR unique if you really don't want people to stack {{item:3071}}. Transcendence is fine, since it only gives on average 12 AD in the mid game, and maybe 24 AD if you really make an effort to build for it and forgo having other, more useful items.","replies":[]}]},{"poster":"Hammermancer","date":"2017-11-13T18:35:26.518+0000","up_votes":2,"down_votes":6,"body":"Meanwhile {{item:3508}} {{item:3031}} {{item:3031}} {{item:3031}} {{item:3031}}  has been a thing for a long time","replies":[{"poster":"Yordle Xayah","date":"2017-11-13T18:48:25.318+0000","up_votes":17,"down_votes":0,"body":"{{champion:119}} {{item:1055}} \n\nPretty much same damage.","replies":[]},{"poster":"Bârd","date":"2017-11-13T21:30:53.316+0000","up_votes":8,"down_votes":1,"body":"I mean, it's your LP to lose.","replies":[]}]},{"poster":"PhaseDives","date":"2017-11-13T08:34:47.717+0000","up_votes":15,"down_votes":1,"body":"its not even broken too its just viable","replies":[]},{"poster":"Akali is SO HOT","date":"2017-11-13T18:30:10.669+0000","up_votes":9,"down_votes":1,"body":"The Cleaver stacking isn't really even that broken imo.  I've seen it in a few of my games and the person doing it didn't pop off and go 30/0 or something like that.  It's viable, but it's not super op or broken.  No reason to change it tbh.","replies":[{"poster":"RISE Shlack123","date":"2017-11-13T19:35:23.148+0000","up_votes":4,"down_votes":2,"body":"It's not a build that's going to just curb-stomp everyone, no.  But it is a build that makes assassins like Zed or Talon able to get more raw AD, HP, and one bit of armor shred, and get bonus AD from Transcendence.  Something doesn't have to be hotfix-worthy to be overpowered.  Stacking Black Cleavers with Transcendence gives you more value from the items even without the unique passives stacking.  And making Zed's HP pool to around 4k while still being able to put out similar damage on immobile squishies is not a balanced state of affairs, especially given how cheap Black Cleavers are compared to other damage items assassins would normally build.  \n\nhttps://www.youtube.com/watch?v=qgbZNCzbqOM","replies":[{"poster":"Akali is SO HOT","date":"2017-11-13T21:15:23.270+0000","up_votes":5,"down_votes":2,"body":"I'd much rather have other good passives and actives from other items instead of just getting some bonus AD from stacking the same item.  Just because an item is gold efficient, doesn't mean it's slot efficient.  The build is still decent, but it is nowhere near broken.","replies":[]}]}]},{"poster":"Solidair3","date":"2017-11-13T18:33:41.992+0000","up_votes":5,"down_votes":0,"body":"Is this even broken? I've seen it a few times but not with crazy results.\n\nI imagine the solution they'll go with is in fact the one you've outlined, however. This seems to be the only major abuse case.","replies":[]},{"poster":"Tartaros","date":"2017-11-13T18:12:19.547+0000","up_votes":5,"down_votes":0,"body":"All they have to do is make the 20% CD unique","replies":[]},{"poster":"DuskDaUmbreon","date":"2017-11-13T15:43:03.063+0000","up_votes":5,"down_votes":1,"body":"I don't think the two combined are actually broken. You'd actually get more damage if you picked up Lethality. _Maybe_ {{item:3147}} {{item:3142}} and 3x{{item:3071}} would be strong, but even then it's not _that_ great a combo. You'd actually probably end up getting more damage by stealing IE and Bloodthirster, alongside BC, Duskblade, and Youmuu's, and throwing in {{item:3158}} for a bit more CDR damage.\n\nHonestly, this rune is only really helping enchanter supports. Works well when every goddamned enchanter item has CDR. Gives you a nice extra boost of damage and healing as {{champion:37}}.\n\nAlthough it _would_ be smart to make BC's CDR unique now, just to be safe.","replies":[]},{"poster":"kile147","date":"2017-11-14T00:56:54.431+0000","up_votes":3,"down_votes":0,"body":"I was curious so I thought I'd do the math on some high CDR builds.\n\n**Cleaver Stacking**\n{{item:3071}}{{item:3071}}{{item:3071}}{{item:3071}}{{item:3071}}{{item:3158}}\nCost:  15,900 Gold\n\n2000 HP\n200 AD\n110% CDR\n\nWith transcendence gives 120% and converts to X=1.2(120-40)= 96 AD, Giving a grand total of 296 AD\n\nStacking the Cleavers seems pretty gold efficient for giving yourself a lot of health and AD and not much else.\n\n**Semi-Standard Assassin Build**\n{{item:3812}}{{item:3071}} {{item:3156}} {{item:3142}} {{item:3147}} {{item:3158}} \nCost: 16,450 Gold\n\n400 HP\n45 MR\n280 AD\n40 Lethality\n70% CDR\n\nWith transcendence gives 80% and converts to X=1.2(80-40)= 48 AD, Giving a grand total of 328 AD\n\nThis build gives you ok durability and a lot of damage against targets of varying armor values. Costs about 500 Gold more than Cleaver stacking.\n\nYou could also swap in {{item:3800}} instead of {{item:3142}} for\n\n**Bruiser-ish Build**\nCost: 16,200 Gold\n\n800 HP\n300 Mana\n30 Armor\n45 MR\n225 AD\n20 Lethality\n70% CDR\n\nWith transcendence gives 80% and converts to X=1.2(80-40)= 48 AD, Giving a grand total of 273 AD\n\nThis gives less flat health than the cleaver build but it probably offers similar if not better durability with resistances, death's dance/Hexdrinker passive, and lifesteal factored in. Comparable flat AD with a bonus burst from Duskblade and its lethality, and it gives an engage/slow. 300 Gold more than cleaver stacking.\n\n\n**Personal Conclusion:**\n\nCleaver stacking is a little overrated. Main issue I see is that you have flat health with no resistances meaning that you will still get shredded pretty quickly. Flat penetration is still going to be very effective against you while you are also susceptible to effects from {{item:3036}} {{item:3153}} {{item:3151}}, and have no way to sustain back up. You could put together a better build with more damage, durability, and utility, tailored to suit the team you are up against, by mixing and matching tank/bruiser items with assassin ones. Cleaver stacking is absolutely viable, but it's probably not ideal in any situation. I don't really see much of a reason to remove this interaction aside from preventing mindless, inefficient builds.","replies":[]},{"poster":"Shadòw","date":"2017-11-13T21:20:53.539+0000","up_votes":3,"down_votes":0,"body":"inb4 Riot first guts the item and then the mastery, leaving both in an useless state instead of just making the CDR unique.","replies":[]},{"poster":"MonkeyMadness","date":"2017-11-13T17:58:31.342+0000","up_votes":4,"down_votes":1,"body":"I'm kind of a fan of locking items such that you can only ever have 1. I know that this will ruin a very popular build ({{item:3070}} {{item:3070}} {{item:3070}} {{item:3070}} {{item:3070}} {{item:3070}}) but I think it's for the best.","replies":[{"poster":"Atanchan","date":"2017-11-13T18:08:20.818+0000","up_votes":2,"down_votes":1,"body":"How would you build Dirk or Warhammer, then? Or Recurve or Stinger?","replies":[{"poster":"MonkeyMadness","date":"2017-11-13T18:37:51.242+0000","up_votes":2,"down_votes":0,"body":"I mean finished items. Build all the long swords you want, but anything with a unique passive should be restricted.","replies":[]}]}]}]}