{"poster":"Bârd","date":"2019-11-24T09:30:32.988+0000","title":"The point of a gold generation item is to generate gold. The new support items do not do that.","subforum":"Gameplay","up_votes":91,"down_votes":13,"body":"Lets take the Spellthief's line for example.\n\nWith the old items, you'd spend 850 total gold to buy a Frostfang.\nThis item granted anywhere between up to 144 gold per minute.\n\nWith the new items, you spend 400 gold to buy a Spellthief's Edge.\nIn its base form, this item grants up to 102 gold per minute.\nAs Frostfang, it grants up to 108 gold per minute.\nAs Shard of True Ice, it grants up to 18 gold per minute.\nThis means that once you've earned 1000 gold with the item (which could be done in 6.94 minutes if the old Frostfang was used opimally), the item gives virtually no gold.\n\nBut hey, a free item is saving you some gold, so that's worth a good bit, right?\n**Wrong**\nIn the first place, no support player worth their salt bothered upgrading their old support items past tier 2.\nThis means that you're only saving the 450 gold it cost to upgrade the damn item, which is more than made up for by how much gold you miss out on.\n\nSure, when you hit your T3 support item you get a spike. Who gives a shit? Sure, the support has a 60 AP item.\nYou think they wouldn't rather have the money to buy items?\n\nIt's funny, in a way.\n\nRemember in Seasons 1 and 2, when people avoided playing Support because they had no way to get gold?\nWhen your only items were Boots, Wards, GP10, and maybe 1-2 utility items if you were lucky?\n\nWell, now you spend 400 gold on a GP10 item at the start of the game.\nOver the item's lifetime, it generates around enough gold for Upgraded boots.\nMeanwhile, your innate gold generation and kill participation might allow you to purchase an Ardent Censer.\n\nWe've come full circle. The only difference is that now, the other guys with items can burst you down even faster and easier, and you can't even buy wards to stop that from happening.","replies":[{"poster":"DuskDaUmbreon","date":"2019-11-24T09:36:10.754+0000","up_votes":28,"down_votes":4,"body":"T3 item definitely needs more income. It's nice to not have to buy the gold items (although you're definitely wrong about *no* support upgrading to t3 gold items, since it was generally mandatory on tank supports), but 18 gold a minute from a gold item is...well...not enough.\n\nHonestly that's my only complaint about the gold items so far. It needs tuning to make support have more gold from t3 item.","replies":[]},{"poster":"Ashe mage AD","date":"2019-11-24T13:22:44.838+0000","up_votes":5,"down_votes":23,"body":"You're conveniently leaving out the fact that the new T3 support item gives a nice stat boost; for free.","replies":[{"poster":"feral one","date":"2019-11-24T13:44:38.635+0000","up_votes":28,"down_votes":6,"body":"Yea you get free stats, stats you don't want. No decent TANK support wants some flat ap or ad. Even enchanters only have ap because the items they want to build just give it as stat, or they would be all building roa or w/e. We want cdr, regen, hell the ms from coin was better than the 40 ap we get now. Before we could generate gold by poking,, by pushing by executing minions and healing our teammates the whole game, now we get those useless 300hp and 40 offensive stat for free but after that unless we steal kills, cs, or last hit objectives we are stuck with a nice 18g/minute. That is 360g... in 20 minutes... Can't even cover our pink ward cost for the whole game. If they wanna nerf supports then nerf our items but give back our way to generate gold so we can have build a fucking item after 20.","replies":[{"poster":"Illabethe","date":"2019-11-24T17:28:31.467+0000","up_votes":6,"down_votes":3,"body":"I disagree. Nami is nothing without AP.\nSoraka has no base HP regen to build off of.","replies":[{"poster":"feral one","date":"2019-11-24T18:25:11.910+0000","up_votes":4,"down_votes":1,"body":"Let me edit my comment to specify i was referring to tank supports.","replies":[]}]}]},{"poster":"Illabethe","date":"2019-11-24T17:26:55.917+0000","up_votes":3,"down_votes":4,"body":"1) T3 comes at 17-22 minutes into the game.\n2) The stat boost sacrifices mana regen, 10% CDR, and potential AP on {{item:3174}} , as well as on hit damage. It's a compromise.","replies":[{"poster":"Ashe mage AD","date":"2019-11-24T17:57:07.471+0000","up_votes":2,"down_votes":5,"body":"... you'll have manaflow at least 80% of the time while playing most supports and if it's enchanters you'll drown in mana regen regardless.\n\nAlso that stat boost ties in with 1st item completion allowing you to spike pretty damn hard.","replies":[{"poster":"Illabethe","date":"2019-11-24T18:13:53.641+0000","up_votes":4,"down_votes":3,"body":"Manaflow is directly affected by the change and doesn't even come close to sustaining mana lol.\n\nYou run out of mana after about 4-5 volleys of Manaflow proccing, so it takes longer to finish now.\n\nDrown in mana? Not before items. Enchanter regen rates have been nerfed, and most build paths still suffer mana problems.","replies":[{"poster":"Ashe mage AD","date":"2019-11-24T18:25:48.026+0000","up_votes":4,"down_votes":3,"body":"{{item:1004}} {{item:1004}} {{item:1004}} {{item:1004}} {{item:1004}} {{item:1004}} {{item:1004}}","replies":[{"poster":"Illabethe","date":"2019-11-24T19:07:23.274+0000","up_votes":2,"down_votes":1,"body":"generally I only at MOST {{item:1004}} {{item:1004}} {{item:1004}} {{item:1004}} {{item:1004}} into {{item:3003}} {{item:3504}} {{item:3174}} \n\nBUT most supports only get 2 items and don't get the {{item:3003}} . Without the {{item:3003}} you still run out.","replies":[{"poster":"Ashe mage AD","date":"2019-11-24T19:39:20.177+0000","up_votes":3,"down_votes":2,"body":"You sound like you play machine gun Lux or something rofl xD","replies":[{"poster":"Illabethe","date":"2019-11-24T19:50:56.526+0000","up_votes":4,"down_votes":0,"body":"I play Machine Gun Nami.\n\nMaybe you don't realize it, but Nami does have a passive, that albeit only lasting 1.5 seconds, is flat movement speed, one of the rarest and most influential movement speed buffs in the game, and it applies every time you self cast, or cast an ally. Namis who don't.... aren't playing her correctly. It can shave ~ 20 seconds off a recall > base > turret run for you and your adc.","replies":[{"poster":"Ashe mage AD","date":"2019-11-24T19:58:31.107+0000","up_votes":1,"down_votes":0,"body":"I always loved Nami, was spamming her for about a season and a half until Braum came out then I got annoyed at both him and Yasuo having a wall to deny my ult lol. But yeah she's super good with the new items. Just, manage your mana xD what you're complaining about is pure extravaganza lol.","replies":[{"poster":"Illabethe","date":"2019-11-24T20:01:56.384+0000","up_votes":2,"down_votes":1,"body":"I also complain because they drastically reduced Morgana's base and growth mana regeneration to accommodate for the fact she was taking Spellthief. I want it reverted.","replies":[]}]}]}]}]},{"poster":"waterflame1","date":"2019-11-25T03:51:45.469+0000","up_votes":2,"down_votes":0,"body":"Could be a champion that went both frostfang and forbidden idol. Which was a good rush if you champion really wanted/needed 40% CDR early.","replies":[]}]}]}]}]},{"poster":"Bârd","date":"2019-11-24T18:08:51.031+0000","up_votes":9,"down_votes":0,"body":"It isn't for free.\n\nIt comes at the cost of having actual gold generation.\n\nWith the old Frostfang, you'd spend 850 gold on a decent item, make up its cost in a few minutes, and move on to other items.\n\nWith the new Spellthiefs, you spend 400 gold on a terrible item that scales into a sub-par item. Since the item loses 90% of its gold generation when it upgrades, the Spellthiefs went from giving you a potentially unlimited amount of gold to an item that onlty profits you 600 gold.\n\nFor comparison, that profit is the same amount of gold an ADC frees up for themselves by buying a fucking **Cull**.","replies":[{"poster":"RyzeRework","date":"2019-11-25T01:18:14.769+0000","up_votes":1,"down_votes":2,"body":"why should supports have the same amount of gold as a laner? the whole point of support is sacrificing themselves to get their carries fed. litteraly played a game of senna support where i was full build building leathality items at 30 mins","replies":[{"poster":"waterflame1","date":"2019-11-25T03:07:14.349+0000","up_votes":2,"down_votes":0,"body":"They didn't and still don't. They're always the player with the least amount of gold unless someone is farming 5CS per minute or under and/or the support is racking double kills like crazy.","replies":[{"poster":"RyzeRework","date":"2019-11-25T07:07:31.332+0000","up_votes":1,"down_votes":0,"body":"It's pretty easy to rack up kills as a support  but support items are also cheaper than ad ap or tank items. Supports are suppose to have a low income. And their income isnt even that low.","replies":[{"poster":"waterflame1","date":"2019-11-25T07:25:49.355+0000","up_votes":1,"down_votes":0,"body":"Well yeah, their income was lower so their items are cheaper to compesate. This makes so that all players have more or less the same amount of items at any given time, or else you'd make supports really weaker until the hyper late game or you make them balanced around having less items and that makes them too strong at the hyper late game (because everybody would be full build and the support would still be scalling).\n\nBut back to the main point, it shouldn't be easier for you to rack up a lot of kills every game unless you're way better than your opponents or you're also dying a lot. And yeah the support doesn't have half the other players gold, it's more about 70%, but it's still the lowest amount of gold.","replies":[{"poster":"RyzeRework","date":"2019-11-25T13:37:31.564+0000","up_votes":2,"down_votes":0,"body":"Nah the problem is supports want to be buying 3 ap items and a dcap","replies":[{"poster":"waterflame1","date":"2019-11-25T18:02:55.116+0000","up_votes":1,"down_votes":0,"body":"Almost no supports want that, and the ones that want aren't able to unless they're playing like they're an entire Elo above their opponents or the game goes up to 40 minutes, when the midlane mage already bought these items and more if he's playing up to standard.","replies":[{"poster":"RyzeRework","date":"2019-11-26T06:48:49.735+0000","up_votes":1,"down_votes":0,"body":"Litteraly noone wants to play the other kind of supports they want to kill or hook. That's why bot lane is filled with hook supports or mage supports. And senna is somewhere in there","replies":[]}]}]}]}]}]},{"poster":"Saezio","date":"2019-11-25T04:03:29.772+0000","up_votes":2,"down_votes":0,"body":"And you had as much gold as top/mid/adc I presume? Cause that's my taking on your comment. Did you have THE SAME AMOUNT OF GOLD as a laner?","replies":[]}]}]}]},{"poster":"Modnar Erom","date":"2019-11-24T15:51:13.098+0000","up_votes":12,"down_votes":2,"body":"If you think passive gold generation from the support item is anywhere close to farming champions I have news for you...\n\nThe actual math:\n\nPost 25 mins, lane income is 20x or 2000% higher than the passive gold from the support item.  That's right two thousand percent.  And you are acting like supports are the entitled ones...\n\nOh and that \"extra gold\" is 180 per 10 mins.  Let's assume you want to buy 2 control wards over a 10 minute period.  Well you now have 30 gold per 10 minutes to spend on item upgrades.  Just think, in 20 hours you can afford a deathcap, op op.","replies":[{"poster":"Mordistar","date":"2019-11-24T16:08:34.764+0000","up_votes":2,"down_votes":28,"body":"Yes you had an entire season of being the most important role but boo hoo they took away your infinite gold generation and gave you free items lmao. Only supports dude.","replies":[{"poster":"Miss Lilianae","date":"2019-11-24T17:25:20.751+0000","up_votes":15,"down_votes":1,"body":"***","replies":[{"poster":"Freaktory","date":"2019-11-25T09:41:47.330+0000","up_votes":2,"down_votes":0,"body":"as a support main, this just means I will have to find other income sources, say taxing more and more of the minion wave, forcing adc to actually FIGHT for their cs. Lord knows they see their supports as little more than meat shields and healbots anyways.\n\nI stopped seeing my team as any importance anyways. If I can bust my ass to get my adc a triple, get them out of a fight alive and still be told how \"useless\" i am because I am 0/2/15 becuz \"look at ur kills, ur trash\" as SUPPORT. Guess its time for adc to see how it feels to be treated as the second-class peasant in the lane relationship. :) There is no rule saying that supports cannot take cs, so I intend to fully make use of that. I will no longer extend the COURTESY of uncontested farm. (Yes, the whole \"Supports dont take cs\" that is a common courtesy, a friendly gesture. NOT A WRITTEN IN STONE RULE)","replies":[]}]}]}]},{"poster":"Modnar Erom","date":"2019-11-24T16:16:36.215+0000","up_votes":10,"down_votes":2,"body":"As if creep waves and jungle camps are not infinite gold generation (at a much higher rate).... good god the entitlement.\n\nMost important role... lol what.    Lowest level in game with still least income which gets spent on items to help teammates before self.    But it is cool, it isn't like farming caddies is hard. I'm sure your supports will love to help you with that, enjoy ;).\n\nOr hey, let's just give everyone in the game a free \"quest\" item since they are so great and have minions and jungle camps stop giving any gold at all ever.  What is good for the goose....","replies":[]},{"poster":"TobiaskJ","date":"2019-11-24T23:30:50.806+0000","up_votes":7,"down_votes":0,"body":"So\n\nIn other words, in late game, no matter how active you are as support, you get the same amount of gold as an AFK support sitting in base. (past the 15 min mark) wtf is this?","replies":[]},{"poster":"Karn Bishop","date":"2019-11-24T10:25:09.133+0000","up_votes":1,"down_votes":10,"body":"I used to hate the items but honestly after using them for a  while the only trash ones are {{item:3858}} and its ap brother.","replies":[{"poster":"Zulgaines","date":"2019-11-24T12:18:38.314+0000","up_votes":11,"down_votes":1,"body":"Relic is just painful to use in normal gameplay in general, TO THIS FREAKING DAY I run into ADC that don't know how relic procs work and rage and fight me for that cannon minion","replies":[{"poster":"xSwimmx","date":"2019-11-24T13:02:19.490+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Zulgaines,realm=NA,application-id=3ErqAdtq,discussion-id=oYpZ834n,comment-id=00010000,timestamp=2019-11-24T12:18:38.314+0000)\n>\n> Relic is just painful to use in normal gameplay in general, TO THIS FREAKING DAY I run into ADC that don't know how relic procs work and rage and fight me for that cannon minion\n\n\nI love when the Mage fights me for the cannon and uses his protobelt to secure  it","replies":[{"poster":"Zulgaines","date":"2019-11-24T13:12:39.581+0000","up_votes":6,"down_votes":1,"body":"Our game is a giant meme at this point.\n\nhttps://www.youtube.com/watch?v=wnirEjsXczA","replies":[]}]}]}]},{"poster":"MistsOfMystery","date":"2019-11-25T00:30:24.801+0000","up_votes":5,"down_votes":0,"body":"They are trying to fix problems that don't exist. Like making new support items because the old ones are \"too powerful\"...… sorry what? No they are perfect the way they were BEFORE THE UPDATE and the new PRESEASON. This is your feedback riot pls change it back.","replies":[]},{"poster":"BlackXIV","date":"2019-11-24T21:30:30.978+0000","up_votes":5,"down_votes":0,"body":"I honestly don't get why rito keeps on putting down supp and jung season after season. Now they want us to fight for drakes all the time, but guess what, the drakes are controlled by midlane now because botlane and jungle were gutted in gold and experience.","replies":[]},{"poster":"Voluug13","date":"2019-11-24T23:41:39.440+0000","up_votes":4,"down_votes":0,"body":"Its rather obvious that those changes were made with Pyke and Senna in mind, since they are about the only supports with kill pressure at same skill levels. \n\nThis is a gigantic nerf to actual supports and a buff to Didnt Get Mid/Adc™ ''supports''.","replies":[]},{"poster":"Modnar Erom","date":"2019-11-25T03:33:30.024+0000","up_votes":3,"down_votes":0,"body":"No support is having an impact when the toplaner with 4 levels and 4 items on them deletes them from the map in 1.5 seconds.\n\nI'm fairly confident something will be done as soon as the pros start scrims though (if not sooner).","replies":[]},{"poster":"Reaper Soraka","date":"2019-11-25T00:40:18.563+0000","up_votes":3,"down_votes":0,"body":"Improvise.\nAdapt.\nPoach.\n*edited for memability.\nI'm sorry. Riot made me do it, my beautiful ADC.\n{{sticker:sg-soraka}} ","replies":[]},{"poster":"Moody P","date":"2019-11-24T13:51:52.617+0000","up_votes":4,"down_votes":32,"body":"Supports should not have gold. \n\nIf they end up too weak riot should look to buffing their kits to be less dependent on gold because supports should be effective primarily on their base kit","replies":[{"poster":"Zulgaines","date":"2019-11-24T14:06:10.843+0000","up_votes":13,"down_votes":3,"body":"The only reason supports exist is becuase there's 4 gold streams for 5 players, they wern't even intended.","replies":[{"poster":"D357R0Y3R","date":"2019-11-24T17:53:51.907+0000","up_votes":2,"down_votes":2,"body":"they were intended lol\n\never since dota 1 and the first RTK games the support class always existed as a class not relying on gold. Why do you think immediatly during dreamhack season 1 pro players played alistar soraka janna taric? Those champions had strong kits which didn't depend on golds\n\nlater, riot nerfed their kits and gave them gold in season 4 during patch 3:14","replies":[{"poster":"Doopliss7","date":"2019-11-24T21:01:50.359+0000","up_votes":2,"down_votes":1,"body":"if their kits are too strong without needing gold you could just take them solo lane with gold and become even stronger.","replies":[{"poster":"D357R0Y3R","date":"2019-11-24T21:08:49.434+0000","up_votes":3,"down_votes":0,"body":"yea that's what happened\n\nand then riot removed their waveclear\ndid people forget everything or nobody played the game back then?\n\nI can't tell","replies":[]}]}]}]},{"poster":"Pika Fox","date":"2019-11-24T16:40:33.273+0000","up_votes":7,"down_votes":1,"body":"> [{quoted}](name=Moody P,realm=NA,application-id=3ErqAdtq,discussion-id=oYpZ834n,comment-id=0004,timestamp=2019-11-24T13:51:52.617+0000)\n>\n> Supports should not have gold. \n> \n> If they end up too weak riot should look to buffing their kits to be less dependent on gold because supports should be effective primarily on their base kit\n\nTerrible game design. It is an utter failure of your game if you have 1/5th of players in every game unable to partake in most of the complexities of the game. \n\nIf that is the route you want to take, it would make more game design sense to make SR a 4v4.","replies":[{"poster":"dont trust girls","date":"2019-11-25T19:02:53.745+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pika Fox,realm=NA,application-id=3ErqAdtq,discussion-id=oYpZ834n,comment-id=00040003,timestamp=2019-11-24T16:40:33.273+0000)\n>\n> Terrible game design. It is an utter failure of your game if you have 1/5th of players in every game unable to partake in most of the complexities of the game. \n> \n> If that is the route you want to take, it would make more game design sense to make SR a 4v4.\n\nIf it were a 4v4 mages would rock the bot lane so hard :P","replies":[]}]}]},{"poster":"D357R0Y3R","date":"2019-11-24T11:09:44.585+0000","up_votes":6,"down_votes":3,"body":"> [{quoted}](name=Bârd,realm=NA,application-id=3ErqAdtq,discussion-id=oYpZ834n,comment-id=,timestamp=2019-11-24T09:30:32.988+0000)\n>\n> \n> Remember in Seasons 1 and 2, when people avoided playing Support because they had no way to get gold?\n\nlow elo didn't know the meta back then\nhigh elo players would always play support cuz it was broken\n\nsupports back then were balanced around having no items, meaning their kit was way stronger \n\nwhen riot gave supports gold in season 4 they immediatly nerfed the shit out of supports (taric janna sona are the one I remember)","replies":[{"poster":"Illabethe","date":"2019-11-24T17:37:49.397+0000","up_votes":1,"down_votes":4,"body":"No..... High elo supports just were averse to doing anything but being remote supports like Janna. Janna Season 2-3 averaged about 4-6k damage a game. She spent the entire game in high elo being nothing but a Barrier bot. In low elo, Janna players had the gusto to actually use their skills, and try to do damage, which resulted in them dying more and losing more. That was the simple, pure, difference, and hence why she got a Victorious skin.\n\nSona had a similar story, until Season 4 when they began buffing her, which resulted in subsequent nerfs. She was so easy ANYONE could ride to Plat + on Sona irregardless of skill.\n\nThe reason they nerfed supports had 0 to do with gold generation. It had everything to do with Ardent Censor, and Athene's rework, and an attempt to \"preserve their work\" on those items.\n\nP.S. Janna is stronger now than she EVER was before.","replies":[{"poster":"D357R0Y3R","date":"2019-11-24T17:48:39.050+0000","up_votes":4,"down_votes":0,"body":">P.S. Janna is stronger now than she EVER was before.\n\nyou've got no clue what you're talking about, please don't  say anything like that\nJanna's ult used to slow enemies that entered the field, her Q used to deal twice more damage which made her ridiculous midlane, she had better base stats and her E gave AD even if the shield was broken and her passive was GLOBAL\n\n>High elo supports just were averse to doing anything but being remote supports like Janna\n\nwhat does that even mean?\nAny support had stronger kit before riot gave them gold\n\npatch 3:14 :\nTailwind\nRange reduced to 800 from global.\nBonus movement speed increased to 5% from 3%.\nHowling Gale Howling Gale\nAP ratio reduced to (+35% AP) from (+75% AP)\nCharge damage reduced to 15 / 20 / 25 / 30 / 35 (+10% AP) from 25 / 30 / 40 / 50 / 60.\nZephyr Zephyr\nBase passive bonus movement speed increased to 4 / 6 / 8 / 10 / 12% from 4 / 7 / 10 / 13 / 16%.\nNEW EFFECT: Bonus movement speed increases at 2% per 100 AP\nBase slow amount reduced to 24 / 28 / 32 / 36 / 40% from 24 / 30 / 36 / 42 / 48%.\nNEW EFFECT: Slow has a 6% per 100 AP ratio capped at 80% total slow.\nAP ratio reduced to 50% AP from 60% AP.\nEye of the Storm Eye of the Storm\nNEW EFFECT: Bonus AD has a 10% AP ratio.\nShield AP ratio reduced to 70% AP from 90% AP\n\nthis is janna since you talked about her\n\nher passive was global,  as I told you Q damage got halved because they gave her gold\nand it's the same for any other supports, they were balanced around not having gold so when riot gave them gold they just nerfed them ","replies":[{"poster":"Bârd","date":"2019-11-24T18:15:04.646+0000","up_votes":1,"down_votes":2,"body":"He's probably talking relative to the roster.\n\nIf we're playing a game where supports have no money, Janna is one of the best champions for that since all she really needs is boots.","replies":[]}]}]}]}]}