{"poster":"xEvilknight","date":"2016-04-14T00:02:52.035+0000","title":"T1G3R Looking for Top Main (Gold) Serious Ranked 5s","subforum":"[ARCHIVED] Player Recruitment","up_votes":1,"down_votes":0,"body":"Hi, I am xEvilknight, I am an officer of T1G3R, I've been playing since Season 2 and currently forming a Ranked 5s Team that is looking to push to Diamond. We have 1x Platinum [myself] and 2x Gold Players. We are about to begin our placement games and is looking to acquire Gold by the end of the 10 games. We will push to Diamond throughout the rest of the season. Curse Voice is our main use of voice-communication, please have it.\n\nMonday - Thursday : Practicing as a team (mechanics, warding, communication, team-play)\nFriday - Sunday : Dynamic Queue \n\nWe are in need of recruiting a Top lane Main player (Gold) \nChampions preferred, {{champion:111}} {{champion:54}} {{champion:39}} {{champion:58}} {{champion:48}} {{champion:127}} {{champion:254}}  {{champion:57}} {{champion:150}} \n\nMUST have atleast 50k experience on the preferred champions in the top lane.\n\nNO TOXICITY!!! \n{{sticker:slayer-pantheon-thumbs}}\n\nPlease place comments or questions below if you're interested in fulfilling this role.","replies":[{"poster":"xX1SaVaGe3Xx","date":"2016-04-14T00:37:44.401+0000","up_votes":2,"down_votes":0,"body":"BUmp","replies":[]},{"poster":"Sisters10086","date":"2016-04-14T00:09:26.988+0000","up_votes":2,"down_votes":1,"body":"play all above as top except for gnar and renekton. I used to vi jg a lot, but never top her before. I main irelia. G5 right now. can be inflexible in times during the week so I might miss practices occasionally, but will be free almost all weekends.\n\nIGN Sisters10086\n\n\n\nIt looks like u will have better choices, but I will be fine as a sub, too if you don't mind","replies":[]},{"poster":"xX1SaVaGe3Xx","date":"2016-04-14T06:10:00.131+0000","up_votes":1,"down_votes":0,"body":"Bump","replies":[]},{"poster":"Héat","date":"2016-04-14T00:50:16.793+0000","up_votes":1,"down_votes":0,"body":"I play mid sadly ahha","replies":[]},{"poster":"Getmelaidplz","date":"2016-04-14T00:41:27.210+0000","up_votes":1,"down_votes":0,"body":"IGN: Getmelaidplz\ncurrent rank is gold 3 (plat 5 last season)\nhave played a lot of ranked 5s last season \ntop lane main since season 4\nknow how to play all those champions and more except vi top\ncan play both carry and support top\nadd me in game if you need me to tryout","replies":[]},{"poster":"Pr0duct","date":"2016-04-14T00:12:07.699+0000","up_votes":1,"down_votes":0,"body":"Hi my ign is boomkinatorqt I'm 17 years old turning 18 in August. Last season I played jungle primarily this season though I have found top more desirable for my play style therefore this season I will be maining top.  My team experience is diamond 4  (last season as jungle for top was my secondary role at the time I got to plat 4 on a team where I was there sub top-lane). My main champions are as follows Poppy Nidalee Ekko Fizz  Naut Irelia Maokia!! and a few other picks like darius and such that are niche and I adapt quickly to the meta so if the team feels I should learn more champions then I will. =D\nMy current rank is gold 4 in promos to gold 3 I am climbing quickly and will not see myself not doing so in the future. \nI have any voice comms \nI am free any day after 3 to 10 and weekends whenever I work at the university as an intern so my time is very flexible. ","replies":[]},{"poster":"Sleeb","date":"2016-04-14T00:11:15.517+0000","up_votes":1,"down_votes":0,"body":"I added you. Woiff","replies":[]}]}