{"poster":"Xeero","date":"2016-01-25T19:07:34.204+0000","title":"¿Cual fue el o los juegos que te marcaron?","subforum":"Off-topic y temas personales","up_votes":2,"down_votes":2,"body":"Todos hemos tenido alguna ves un juego que amamos y que de repente te entre unas ganas de volver a jugarlo y escuchar esa m&uacute;sica &eacute;pica... o esas ocasiones que maldec&iacute;as al juego por su dificultad y lo tirabas y al pasar 5 segundos volv&iacute;as a intentarlo.\r\n\r\nTodos tenemos algo que nos marco y dime cual fue el juego que mas te marco.","replies":[{"poster":"KSGL","date":"2016-01-25T19:11:25.886+0000","up_votes":1,"down_votes":0,"body":"Spyro the Dragon y Crash Bandicoot diría yo. Fueron de los primeros juegos que me tuve en la PS1 y aún los recuerdo muy bien, en especial el Crash. Últimamente siento como que el LoL marcó una etapa en el antes y después de mi vida porque me enseñó muchas cosas, en especial a jugar en equipo y a entender que la comunicación si es importante en un equipo, aunque sea en un juego el hecho de hablar con los demás y decirles qué tienes pensado puede ayudar a planificar cosas de antemano.\nMe gustaría escuchar los tuyos ahora, jaja.","replies":[{"poster":"Xeero","date":"2016-01-25T19:34:38.038+0000","up_votes":2,"down_votes":0,"body":"En mi caso tengo muy buenos recuerdos de muchos juegos y de diferentes géneros y plataformas.\n\nEl international super star soccer y el castlevania de la snes, los queke y doom, después descubrí a Squaresoft y me enamore de los rpg's. Mas tarde llego blizzard con diablo y stracraft y nació un amor y odio por estas franquicias (y si riot mi corazon es de blizzard el llego primero :C) esos son algunos.\n\nY si tuviera que elegir me quedaría entre chrono trigger y starcraft.","replies":[]}]},{"poster":"Il Bardolino","date":"2016-01-25T21:11:43.993+0000","up_votes":1,"down_votes":0,"body":"Los dos que marcaron un antes y un despues en mi vida (en lo que a juegos respecta) fueron **Metal Gear Solid** y **Grim Fandango**. Fue ahi cuando el pequeño Bardomero descubrio una enorme pasion por los juegos que tengan una gran historia para contar.","replies":[]},{"poster":"Yrox the Third","date":"2016-01-25T19:37:02.498+0000","up_votes":1,"down_votes":0,"body":"La primera trilogia de Crash Bandicoot, Sonic Adventure 1 y 2 mas Sonic Heroes, Kingdom Hearts (best game ever) y The last Story, estos me marcaron.","replies":[]},{"poster":"DojaaCat","date":"2016-01-25T19:31:48.601+0000","up_votes":1,"down_votes":0,"body":"Skyrim es un vicio, increiblemente aún no lo termino  {{item:3151}}","replies":[]},{"poster":"Rehrs","date":"2016-01-25T19:24:32.663+0000","up_votes":1,"down_votes":0,"body":"el conker bad fur day me pase la historia y el multijugador es brutal xD","replies":[]},{"poster":"AkNando","date":"2016-01-25T19:14:33.111+0000","up_votes":1,"down_votes":0,"body":"Guardián's Crusade.\nFF IX\nPokemon Red\n\nNostalgia a mí!!!!!\n\nPD: Tengo 26.\n\nSaludos. {{champion:19}}","replies":[]},{"poster":"Dildo de Moria","date":"2016-01-25T19:14:26.014+0000","up_votes":1,"down_votes":0,"body":"Supaplex!! Recuerdo que me re enojaba el nivel 11, para mi era imposible ¬¬\nAyer lo encontré para el celu y ahi nomás lo descargue :v","replies":[]},{"poster":"Juanmayeri","date":"2016-01-25T19:13:33.161+0000","up_votes":1,"down_votes":0,"body":"digimon world 1 de psx","replies":[]},{"poster":" Acantha","date":"2016-01-25T19:12:25.423+0000","up_votes":1,"down_votes":0,"body":"Mario Bros :v\nA veces lo descargo, lo juego una semana y lo vuelvo a eliminar.\nXD","replies":[]},{"poster":"JACKY FANBOY","date":"2016-01-25T19:09:37.244+0000","up_votes":1,"down_votes":0,"body":"Recuerdo jugar cuando pequeño todo lo relacionado con Nintendo\n-Fire emblem the sacred stones (el mejor juego LAS C: )","replies":[]}]}