{"poster":"fixating30","date":"2017-03-27T21:58:55.197+0000","title":"chat restriction worth","subforum":"Player Behavior","up_votes":2,"down_votes":5,"body":"so i recently decide to become toxic on my smurf to people I deem to be selfish or bad players because of there style of play(selfish narrow minded greedy ect) probably mild compared to most people getting punished but I finally got a chat ban on my smurf for saying the things I want to say on my main but don&#039;t to the shitty yasuo,riven,vayne type players who think there style of play and skill is much better then it is and cost the team a lose 4 times for every one time they actually carry. I pretty much got my whole team to rage at our useless yasuo and then held him hostage into admitting hes a dumb ass so I wouldn&#039;t afk and continue to carry him.  my beef with this guy was basically this he sat in lane farming and the enemy jayce just bounced back and fourth from top and bot helping his lanes which were getting stomped badly. yasuo would sometimes ping often way to late and wasn&#039;t really pushing his lane in fact most times when jayce would roam he would back or take wolves. this lead to jayce becoming huge and stopping the bleeding of there top and bot lanes but not being punished mid at all(tower in tact close in cs). we still had control over the game but could never close out because our yasuo continued to do dumb things or just not group and he wasn&#039;t doing this to troll he was legit trying to win the game as hard as he could in his mind but his playstyle was narrow minded and dumb that it basically amounted to a 4v5. I let him have it and don&#039;t regret it. I pretty much have hard carried plenty of games on this smurf and all sabotage some games where my teammates were bad and annoying so I stopped caring and just did silly things where I knew it would result in a lose eventually. anyone theres my story heres the log combined with my other behavior guess it deserve the chat ban but who really cares about a chat ban.\r\nfixating30: u warned me as u stood in your lane doing nothing\r\nfixating30: typical trash yasuo player who is gonna need to be carried\r\nfixating30: yet u stand there and do nothing\r\nfixating30: you are useless\r\nfixating30: lol\r\nfixating30: k im done\r\nfixating30: your such a fucking moron\r\nfixating30: id rather lose then see u get a win\r\nfixating30: no not gonna relax stomping top\r\nfixating30: but constantly 1v2 top\r\nfixating30: nope\r\nfixating30: done\r\nfixating30: not till yasuo admits hes fuckign wrong\r\nfixating30: letting your fucking lane roam and not doing anything about it\r\nfixating30: till then i sit in base\r\nfixating30: k\r\nfixating30: i sit in base\r\nfixating30: about what?\r\nfixating30: what are u wrong about?\r\nfixating30: and what should u have done instead?\r\nfixating30: couldnt stay\r\nfixating30: dont know how u expect me to do anything when u constantly take all my side lane farm kayle\r\nfixating30: mid laner doing whats he been doing all game was the difference\r\nfixating30: never there\r\nfixating30: never ever\r\nfixating30: he hasnt been in postion to do anyhtign entire game\r\nfixating30: r didnt go off in time\r\nfixating30: cuz we lost i cant stop them 1v3\r\nfixating30: i threw?\r\nfixating30: 22/5 jayce how do u think that happen\r\nfixating30: thats how we lost\r\nfixating30: we lost cuz of 22/5 jayce","replies":[{"poster":"Magical Player","date":"2017-03-27T22:01:39.168+0000","up_votes":3,"down_votes":1,"body":"Harrassment and admitting to afk?\nfixating30: till then i sit in base\nfixating30: k\nfixating30: i sit in base\n\nGood for you? Thanks for adding input to the system","replies":[]},{"poster":"Astrovert","date":"2017-03-28T05:45:53.235+0000","up_votes":1,"down_votes":0,"body":"By the way, you could tell half of the bronze people all day the right way to play and they still wouldn't. You literally are not only wasting your time but all those other peoples too.","replies":[{"poster":"fixating30","date":"2017-03-28T18:53:04.157+0000","up_votes":1,"down_votes":0,"body":"only there not bronze players, and I'm not wasting my time (still learning the different champs and roles I want to). I just get to be toxic to the same type of people I see in plat in diamond who are just as toxic dumb selfish and greedy just better mechanically, because I don't care about bans or winning on this account.","replies":[]}]},{"poster":"Odd Gnome","date":"2017-03-27T22:10:29.611+0000","up_votes":2,"down_votes":2,"body":"TFW you end up getting IP banned for being toxic trash.","replies":[{"poster":"franchise7676","date":"2017-03-27T23:29:22.449+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Odd Gnome,realm=NA,application-id=ZGEFLEUQ,discussion-id=cb7lmbcT,comment-id=0002,timestamp=2017-03-27T22:10:29.611+0000)\n>\n> TFW you end up getting IP banned for being toxic trash.\n\n\nWho can't get around an Ip ban?","replies":[{"poster":"fixating30","date":"2017-03-28T01:52:55.608+0000","up_votes":1,"down_votes":0,"body":"just this guy I guess must not have vpns where he comes from yet?","replies":[]}]}]},{"poster":"Astrovert","date":"2017-03-27T22:42:02.006+0000","up_votes":1,"down_votes":0,"body":"I don't know what game you may play be it Aram or Summoners Rift, but if you pick Vayne or are happy with him, you just look like an idiot.\n\nYasou and Riven are different as either the player is really good with them (it happens) or they just suck completely.","replies":[]},{"poster":"franchise7676","date":"2017-03-27T22:00:52.955+0000","up_votes":2,"down_votes":2,"body":"he is weak\nwhen my actions or words cause someone to afk/feed i enjoy that more than winning.  you would've never held me hostage like that.","replies":[{"poster":"Limmie","date":"2017-03-27T23:06:25.826+0000","up_votes":1,"down_votes":0,"body":"Personally I don't talk back or change what I'm doing, I'll just mute them (if I haven't already muted all from the get go like I usually do) and keep doing what I think it's best then report afterwards. But while I wouldn't say I enjoy people going AFK, I agree it's a pretty pathetic stance to have being extorted out of your dignity over a freaking game. Like seriously, have some pride. If you allow yourself to be pushed around in a game, I don't even want to imagine how much of a spineless pushover you are IRL.","replies":[]}]}]}