{"poster":"Alepsyco","date":"2016-12-23T01:16:38.153+0000","title":"Strada predefinita","subforum":"Discussioni generali","up_votes":3,"down_votes":1,"body":"Premetto che ci saranno mille motivi per cui, imagino, questa discussione sar&agrave; inutile, ma mi piacerebbe avere un chiarimento sui bilanciamenti dei champ.\nNel dettaglio, perch&egrave; se la riot decide un determinato ruolo per un champ, tu sei costretto a giocare quel ruolo per essere utile?\nPer fare un esempio ho da poco preso lulu e, non giocando support, vado top ap/tank: non si pu&ograve; dire che non sia forte, ma una volta lo era di pi&ugrave; e riusciva a stare dietro ai champ in meta anche in solo lane.\nIn conclusione, perch&egrave; devo pickare sempre i soliti spanaculi in meta per avere un match facile/bilanciato?\nSi potrebbe fare di pi&ugrave; per valorizzare i champion facendogli facilmente ricoprire vari ruoli oltre a quello di base.\nFate questo invece che far diventare {{champion:107}} permabannato dopo il rework","replies":[{"poster":"HaIIeIujah","date":"2016-12-23T03:22:24.071+0000","up_votes":8,"down_votes":0,"body":"Se ho capito bene, quello che intendi è \"Perchè i campioni tendono ad avere un ruolo predefinito nel loro design, piuttosto che essere completamente aperti e utilizzabili ovunque\", giusto?\n\nBene, è una buona discussione. Parliamone.\n\nUno dei motivi principali è la difficoltà di bilanciamento. Le diverse lane (per non parlare della jungla) hanno requisiti molto diversi l'una dall'altra, e un campione per poter andare in più di una deve ricoprire almeno un ruolo utile nella lane stessa. Quando questo accade, il campione entra in un limbo spiacevole: qualunque modifica di bilanciamento deve essere pensata in modo da toccarne un certo aspetto-ma senza drenare potere da un altro modo di giocarlo che può essere meno efficiente, o addirittura underpowered. A volte, è possibile farlo (in particolare agendo sui ratio/base damages). In altri, no.\n\nIl secondo è l'unicità del campione. Per creare un kit veramente unico è a volte necessario creare delle meccaniche che giocano sulle forze uniche di una particolare lane, \"legandoli\" ad essa. Per alcuni esempi:\n {{champion:114}} : Fiora è stata creata come una duellante, seguendo la fantasia della \"uno contro uno, isolata e lontana\" di molti campioni in toplane. Pertanto le è stata data una meccanica che si bassa sulle interazioni esclusive in 1v1 su quella fantasia-che vale e funziona solo in toplane, dove quel tipo di gameplay è presente.\n{{champion:427}} : Uomo-Albero pacifista che libera gli animali non potrebbe essere stato creato per un altra lane senza diluire incredibilmente la sua particolarità. Se fosse stato inizialmente ideato come, per esempio, multilane Jungla-Mid, non avrebbero potuto spendere cosi tanto \"power budget\" nella sua passiva.\n{{champion:429}} : Kalista è basata su una passiva che implica un rapporto con un altro personaggio. Per farla funzionare in un altra lane, dove non hai accesso alla passiva- il resto del kit dovrebbe essere abbastanza potente da funzionare senza di essa, rendendo quindi \"ADC\" Kalista insana.\n(E si, so che Kalista fa pena al momento. Il discorso vale dal punto di vista del design, non del live balance.)\n\nE infine, il meta esiste. Ed esisterà sempre. Alcuni campioni sono semplicemente più performanti di altri in una lane specifica, quindi finiranno per popolarla e alterare l'ambiente intorno a loro. In QUALUNQUE POSSIBILE MONDO, anche se il bilancaiemnto fosse pseudo perfetto, alcuni campioni avrebbero priorità su altri. Questo fa sì che molti sembrino \"impossibili\" da giocare- non per un loro problema intrinseco, ma perché non sono attualmente quell1,2% più forti come quelli usati principalmente. Nessun ammontare di \"multilane design\" può imepdire che si stabilisca un meta.","replies":[{"poster":"BrattishSolid6","date":"2016-12-23T07:10:10.653+0000","up_votes":4,"down_votes":0,"body":"Ottimo commento, ben argomentato! ^^\n\nMi chiedo solo come tu lo abbia elaborato alle 4 di mattina ahahahah","replies":[{"poster":"HaIIeIujah","date":"2016-12-23T07:48:37.495+0000","up_votes":3,"down_votes":0,"body":"Devo resettare il ciclo del sonno ;_;","replies":[]}]},{"poster":"Alepsyco","date":"2016-12-23T09:31:43.593+0000","up_votes":2,"down_votes":0,"body":"Ottimo commento davvero! Non saprei come controbattere se non per additare la colpa Riot di creare certi bilanciamenti strani per dare power sempre ai soliti campioni e per farti un esempio con ekko top/tank (inteso come midlaner ap, scoperto tank ed entrato in meta. Ammazzato subito perchè non nato per quel ruolo...di certo serviva un nerf, ma non così pesante).\n\nParlando dell'altro discorso, posso dire che le 4 di mattina è l'orario magico dove avere a che fare con il forum di lol...ha un gusto epico","replies":[]}]}]}