{"poster":"MukkeAkaDennis","date":"2016-08-28T20:13:55.088+0000","title":"AUF SUCHE !!!!!","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Hey Leute ich und mein Kumpel suchen ein Team, er is ADC und ich sein Supp w&auml;re cool wenn wer Intresse an uns h&auml;tte sind zwar nur Silber aber das liegt daran das wird meist nur Normals spielen haben aber schon oft von anderen geh&ouml;rt ob wir wirklich silber spielen die meisten h&auml;tten uns auf gold oder Platin gesch&auml;tzt wie gesagt bei Intresse einfach ne Post unter klatschen w&uuml;rden uns freuen :) Ps: h&auml;tten gern aber auch leute im gold bereich w&auml;re schon echt nice :) \n\nSUCHEN TEAM !!!!\n\nAlter von uns 20,21\n\nLg der Mukke Aka Dennis","replies":[{"poster":"Sásaki","date":"2016-08-28T20:17:26.106+0000","up_votes":1,"down_votes":1,"body":"hätte Interesse, smurfe grade bisschen in Silver\nhab dich mal geadded","replies":[{"poster":"werkmeista","date":"2016-08-29T09:37:11.421+0000","up_votes":1,"down_votes":0,"body":"immer diese kopierten Standartantworten mit individueller Kopfzeile. Nene also das würde ich mir echt überlegen \n\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"MukkeAkaDennis","date":"2016-08-29T15:19:55.317+0000","up_votes":1,"down_votes":0,"body":"meinst du mich ?","replies":[]}]}]},{"poster":"KAPPOBY","date":"2016-08-29T07:01:05.250+0000","up_votes":1,"down_votes":0,"body":"Du hast es satt alleine in der Dynamic Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/cOWosEff-aequilibritas-esports-sucht-rekruten-community-esports-lol-csgo-overwatch-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]},{"poster":"Kíngpin","date":"2016-08-28T22:02:34.154+0000","up_votes":1,"down_votes":0,"body":"Hallo Dennis,\n\nvielleicht wäre für dich langfristig gesehen auch ein Clan interessant.\n___________________________________________________________________________________________________________________\nDu hast keine Lust mehr alleine zu spielen oder suchst einfach ein paar nette Leute für ein paar gemeinsame Runden?\n\nDann dürftest du bei uns genau richtig sein!\n\nWir vom Gaming Clan \"Nobody Cares\" sind ständig auf der Suche nach neuen Membern, welche Spaß am Spiel haben und mit uns gemeinsam gesteckte Ziele erreichen wollen. Bei uns steht der Spielspaß und eine nette Gaming-Community im Vordergrund. Sollten wir dein Interesse geweckt haben so schau dir doch mal unseren Forum-Post an oder schreib mich direkt an.\n\nIn diesem Sinne und vielleicht bis bald... Die Leute von \"Nobody Cares\"!!!\n\nMfG F4K3Z\n\nForum-Post:\nhttp://boards.euw.leagueoflegends.com/de/c/clans-teams-de/xVaUEfkF-nobody-cares-jetzt-auch-bei-league-of-legends-clan-im-aufbau-sucht-mitglieder","replies":[]}]}