{"poster":"SpectreChazer","date":"2019-06-12T18:07:16.049+0000","title":"Es Baneable usar esta App?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Se llama \"Mod Skin LOL Pro\" y te permite ver skins del propio juego, algún que otra custom skin y nada más. No tiene virus ni Hack\nhttp://img.modskinpro.com/upload/image__20160624_1.jpg\nTiene esta imagen que te dice que Riot la aprueba o algo asi, pero me banearon del foro por preguntar por otro programa para cambiar la skin de la grieta siendo que ellos mismos decían que mientras no de ventaja no pasa nada. Así que no estoy seguro.\n\nActualización:\nPregunte al soporte y esta fue su respuesta.\n\nhttps://i.gyazo.com/de6349873a1f727c3c0158ca90e4bbd8.png\n\nPrefiero no jugarmela y seguír como antes.","replies":[{"poster":"WhiteMax","date":"2019-06-12T18:49:10.254+0000","up_votes":1,"down_votes":0,"body":"A ver si el programa te permite usar skins sin tener que pagarle a Riot siempre va a tener chance de que te baneen. En especial si dichas skins son las del juego.","replies":[]},{"poster":"Hnk Kenshiro","date":"2019-06-12T18:27:05.294+0000","up_votes":1,"down_votes":0,"body":"Si deja usar skins del juego es ban.\n\nAntes teniamos Wooxy para las custom, se le extraña.","replies":[{"poster":"SpectreChazer","date":"2019-06-12T18:29:59.757+0000","up_votes":1,"down_votes":0,"body":"Tenía una Skin de Shen Deadpool y otra que se llamaba \"Kawai Nautilus\", era Nautilus Rosa con cara tierna xd\nhttps://srv.latostadora.com/designall.dll/kawaii_face--i:14138534364514138520;x:20;w:520;m:1.jpg","replies":[{"poster":"Hnk Kenshiro","date":"2019-06-12T18:47:48.813+0000","up_votes":1,"down_votes":0,"body":"Usaba principalmente J4 mecha xd","replies":[]}]}]},{"poster":"Hierro IV 1 LP","date":"2019-06-12T18:23:01.670+0000","up_votes":1,"down_votes":0,"body":"Si me banearon permanentemente por cambiar las voces, creo que te espera el mismo destino.","replies":[]},{"poster":"Desaroll","date":"2019-06-12T18:14:00.514+0000","up_votes":1,"down_votes":0,"body":"El mismo texto de la imagen dice que con las customs no tienen problema....\n\nPero si te deja ver las propias del juego, ya cae en otro terreno, ¿No crees?\n\nDicho esto, TODOS los programas de terceros son bajo tu propio riesgo. Si hacen algo (Lo que sea) que Riot detecte como modificación ilegal, RIP tu cuenta.\n\nTu eliges si vale la pena arriesgar la cuenta por lo que te dé el programa.\n\nSuerte!","replies":[]},{"poster":"SliferUry","date":"2019-06-12T18:09:53.765+0000","up_votes":1,"down_votes":0,"body":"Yo te diria que consultes en soporte, mandes ticket.\n\nEn un principio no tendria nada de malo pero mejor prevenir","replies":[]}]}