{"poster":"Riot Nusliful","date":"2016-01-11T21:35:19.818+0000","title":"2016 Split Diskussion (VORSICHT SPOILER!)","subforum":"Esports","up_votes":1,"down_votes":0,"body":"Moin!\r\n\r\nDer Spring Split startet bald in eine neue Runde und in diesem Thread k&ouml;nnt ihr, &auml;hnlich wie im [World Championship 2015 Thread,](http://boards.euw.leagueoflegends.com/de/c/esports-de/zaP1fcxJ-2015-world-championship-vorsicht-spoiler) &uuml;ber alles m&ouml;gliche diskutieren.\r\n\r\nDen Spielplan findet ihr auf unserer neuen [deutschen lolesports Seite](http://eu.lolesports.com/de), die seit Januar im Gange ist. Hier findet ihr auch in Zukunft die deutschen eSports Artikel, die fr&uuml;her immer auf der League of Legends Seite gepostet wurden. Auch eure Tickets f&uuml;r die Show k&ouml;nnt ihr hier erwerben. Um  keine Neuigkeiten zu verpassen, k&ouml;nnt ihr unserem offiziellen [Twitter](https://twitter.com/LoLGermany) Account folgen.\r\n\r\nWas denkt ihr Beschw&ouml;rer? Wird Fnatic wieder einen 18-0 Split hinlegen? Wird Origen, oder vielleicht das neue Vitality, die K&ouml;nige vom Thron sto&szlig;en? Wir freuen uns auf rege Diskussionen! \r\n\r\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"ü ö","date":"2016-02-08T18:04:20.734+0000","up_votes":1,"down_votes":0,"body":"Noxiak muss FNC verlassen; Ersatz ist Klajbajk.\n\nNoxiak ist mMn nicht das Problem, eher der andere Part der Botlane..","replies":[{"poster":"Armaderschaden","date":"2016-02-08T19:03:01.099+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lee Keane,realm=EUW,application-id=hGYdiTd1,discussion-id=1K8irVRU,comment-id=00d0,timestamp=2016-02-08T18:04:20.734+0000)\n>\n> Noxiak muss FNC verlassen; Ersatz ist Klajbajk.\n> \n> Noxiak ist mMn nicht das Problem, eher der andere Part der Botlane..\n\nHörte ich auch schon oft, aber was genau ist denn da das Problem?\nSchaute mir nicht, die LCS so sehr an, um da eine Aussage zu geben.","replies":[{"poster":"ü ö","date":"2016-02-08T19:26:49.849+0000","up_votes":1,"down_votes":1,"body":"Er spielt einfach nicht so, wie er spielen sollte.\n\nBeispiel letzte Woche, FNC - ROC;\n\nFNC hatte Janna, Lulu und Malphite, also eine komplette Teamcomp nur für Rekkles (Caitlyn). So, was macht Rekkles? Andauernd caught out, so dass FNC nicht fighten kann da ihr ADC immer fehlt. \n\nJa, er hatte am Ende zwar trotzdem mit Abstand den meisten Schaden rausgehauen, allerdings stand er bis zum letzten Fight 1-6-1 und es ist auch kein Wunder dass eine Caitlyn mit Janna/Lulu als Unterstützung den meisten Schaden macht, dafür muss man echt kein toller ADC sein. Er ist seit den Worlds wo er teilweise richtig schlecht war einfach (für mich) kein guter ADC mehr, und das jetzt an Noxiak festzumachen (Gerüchten zufolge wollte Rekkles sogar einen neuen Support) ist einfach falsch. Hätte Rekkles nicht so viele Fans, würde der richtig fertiggemacht wrden.","replies":[{"poster":"ObeVanDope","date":"2016-02-08T20:32:38.003+0000","up_votes":4,"down_votes":0,"body":"Ja und nein. \n\nJa, Rekkles ist zZ nicht in Topform, liegt aber daran das ER shotcallen muss. Kasing hat mal gesagt, das ein ADC sich nur auf sein Spiel konzentrieren soll und nicht noch shotcall betreiben muss. Und ich denke das sieht Dailor und hat halt lieber jetzt einen schlussstrich gezogen als später.\n\nNein, man muss sich nur Noxiaks spielweiße anschauen. Er ist der aggresive Spieler, Rekkles mehr passiv. Wenn die synergie in deinem oder meinem Ranked Team nicht stimmt scheiss egal, aber in der LCS wird da halt gleich eine Veränderung herbei geführt.\n\nIch denke immernoch das Fnatic weiß was sie tun, und deshalb werden wir abwarten was dabei rauskommt.\n\nPS: Man muss sich nur YS bei TSM anschauen, er kommt mit DL auch nicht zurecht. YS war immer ein roamender Supp der über die map plays macht. Er wusste er kann Rekkles alleine lassen da er sich einfach passiv hinstellt und gut farmen kann. Bei DL ist das nicht so, er will High Risk High Reward und darauf kommt auch YS nicht klar.\n\nGreetz","replies":[]}]}]}]},{"poster":"JCDenton333","date":"2016-02-14T16:14:46.453+0000","up_votes":3,"down_votes":0,"body":"Malphite ist super stark grade. Bester Engage im Spiel und gerade gegen Teams mit viel AD super. Und genau das wird doch grade gespielt, in vielen Spielen 2 oder gar 3 ADC.","replies":[]},{"poster":"ü ö","date":"2016-01-21T22:14:10.726+0000","up_votes":1,"down_votes":0,"body":"Odoamne......","replies":[{"poster":"Bezar","date":"2016-01-21T22:16:48.597+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Lee Keane,realm=EUW,application-id=hGYdiTd1,discussion-id=1K8irVRU,comment-id=006e,timestamp=2016-01-21T22:14:10.726+0000)\n>\n> Odoamne......\n\nDas kann man nachher immer leicht sagen xD, ausserdem müsste man dann auch sicher sein, dass es seine Endscheidung war.","replies":[]}]},{"poster":"JCDenton333","date":"2016-01-15T15:11:14.406+0000","up_votes":3,"down_votes":0,"body":"Ich würde das nicht unbedingt zu hoch hängen. Dass ehemalige Mitarbeiter abwertend über Teams reden kommt schon mal vor. Und wenn OG tatsächlich so beratungsresistent wäre, dann wäre das Halbfinale nur noch höher zu bewerten.","replies":[]},{"poster":"Bezar","date":"2016-01-14T17:01:38.040+0000","up_votes":3,"down_votes":0,"body":"ES GEHT LOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOS !!!!!!!!\n\n*freu* *hype* *FNC*","replies":[]},{"poster":"KUFie","date":"2017-01-09T07:36:53.037+0000","up_votes":2,"down_votes":0,"body":"Hey mal so 10 Tage vor Saisonstart ein kurzes Statement.\nIch hab bei ESPN gelesen das schon am WE die Gruppen für die LCS gezogen wurden.\n\nGruppe A: G2, FNC, MIF, ROC, Gia\n\nGruppe B: H2K, SPY, VIT, UOL, OG\n\nSchade das davon bisher nichts auf den Europäischen LoLesports Seiten zu lesen ist. Ich glaub wenn in anderen Sportarten Gruppenziehungen 2 Tage später noch nicht offiziell verlautet wurden könnten diese ganz schnell \"einpacken\".\nVielleicht sollten Riot zumindes den englischen Artikel schonmal vorschreiben lassen und nur den Part über die Gruppenziehung am Samstag direkt einfügen und noch Samstag oder Sonntag releasen. Oder zumindest bei Twitter eine Kurze Nachricht raushauen. Währe sicher schön für die \"Fans\" zeitnah informiert zuwerden.  Wenn das Ganze eine ESPN Fakenachricht war, dann vergesst die Anmerkung ;)","replies":[]},{"poster":"JCDenton333","date":"2016-06-02T17:57:51.219+0000","up_votes":2,"down_votes":0,"body":"Baron in  3 Sekunden ist halt schon daneben. Ansich finde ich die Änderungen aber nicht schlecht, weil man mehr taktische Möglichkeiten hat. Es ist auch nicht Riots Schuld, dass OG sich null um Dragon gekümmert hat","replies":[]},{"poster":"JCDenton333","date":"2016-05-18T05:03:00.335+0000","up_votes":1,"down_votes":0,"body":"Zven und Mithy also wirklich raus bei OG...\n[Quelle](http://origen.gg/2016/05/changes-in-origen/)","replies":[{"poster":"Treffnix","date":"2016-05-18T10:44:26.491+0000","up_votes":1,"down_votes":0,"body":"Konnte man ja mit rechnen. Solche Gerüchte bewahrheiten sich ja meistens. \nFür OG ganz klar eine Schwächung. \nIch gehe davon aus, das die jetzt wirklich zu G2 gehen. Sollte es so kommen, hat G2 nen richtig geiles team, finde ich\n\nBin mal gespannt, wen OG dafür jetzt holen. Wird schwierig die 2 zu ersetzen.\nUnd nen guter Spieler, der auch Wert auf Training etc. liegt, überlegt sich doch jetzt auch zweimal, ob er sich das antut^^","replies":[{"poster":"StitchStar","date":"2016-05-18T10:57:37.866+0000","up_votes":1,"down_votes":0,"body":"Das Team von G2 ist erst richtig geil wenn die einen besseren Toplaner haben. Sorry hab hohe Ansprüche und MSI hat mir gezeigt das die G2 Toplane bei weitem nicht so weit ist es mit besseren Toplanern aufzunehmen. Trotzdem sind die für EU Verhältnisse bestimmt sehr gut, da in EU die Toplane die schwächste Position ist. Bei CLG vs SKT hat man auch gesehen, dass man Skill braucht nicht nur sehr gutes Teamplay um Korea zu schlagen in einem Bo5!\n\nG2 ist aber nun bei vielen Fans anscheinend das Judas Team und OG das \"lazy\" Team, irgendwie finde das interessant :D. Mir ist das gleich jeder muss für sich selbst entscheiden was er in seiner Karriere erreichen will.\n\nNur Forg1ven mit OG kann mir nicht vorstellen, da prallen totale Gegensätze aufeinander, da kann man dann die Wochen zählen bis Forg1ven explodiert.","replies":[{"poster":"ü ö","date":"2016-05-18T14:19:09.863+0000","up_votes":2,"down_votes":0,"body":"Perkz (der ja soooo hochgelobt war, selber meint er wäre besser als Faker etc.) hat doch mindestens genauso viel Mist gemacht wie Kikis, die haben einfach als Team komplett versagt, weswegen ich Kikis jetzt nicht extrem schlecht nennen würde, auf Tanks ist er immernoch solide.","replies":[]}]}]}]},{"poster":"KUFie","date":"2016-05-15T16:32:56.816+0000","up_votes":1,"down_votes":0,"body":"Naja, im Fussball gewinnt seit 4 Jahren auch immer Bayern München, trozdem sind die Stadien immer voll. :-)","replies":[{"poster":"ü ö","date":"2016-05-15T19:10:31.835+0000","up_votes":2,"down_votes":0,"body":"Bundesliga ist aber eher mit EU LCS zu vergleichen, international gewinnt Bayern ja nicht alles.","replies":[]}]},{"poster":"ü ö","date":"2016-03-11T18:54:48.148+0000","up_votes":1,"down_votes":0,"body":"Tja UOL.. Diamond ist Klasse, Rudy gut aber loulex nicht tragbar... musste irgendwann so kommen.\n\nSteelback trotz 12-5-8 KDA 2 mal verloren, meh. Das mit den Lags war ja lächerlich grade.. EL pusht die Nexus Tower, 2 Sekunden später ist der Screen beim feierndem EL und Spiel vorbei..","replies":[{"poster":"legofreak1","date":"2016-03-11T18:56:56.985+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lee Keane,realm=EUW,application-id=hGYdiTd1,discussion-id=1K8irVRU,comment-id=0124,timestamp=2016-03-11T18:54:48.148+0000)\n>\n> Das mit den Lags war ja lächerlich grade.. EL pusht die Nexus Tower, 2 Sekunden später ist der Screen beim feierndem EL und Spiel vorbei..\n\nIch hab das Spiel ohne Probleme sehen können. Lags im Stream müssen nicht unbedingt auf RIOTs bzw Twitchs Seite zu finden sein, sondern oft beim Anwender.","replies":[]}]},{"poster":"Bezar","date":"2016-03-10T09:17:12.558+0000","up_votes":2,"down_votes":0,"body":"Ahaha AlexIch ist raus, ich muss aber auch sagen, dass er nachgelassen hat, mit Ryze Mid konnte er überhaupt nicht spielen und auch sonst relativ durchschnittlich.\n\nREN versucht alles zu machen, um drin zu bleiben...\n\n\nZu der LCK Trainingsdiskussion, wenn jemand dort trainieren will, dann muss das Team aber auch beisammen bleiben sonst ist das ganze Training nämlich fürn Arsch! Aktuell bleiben Teams ja kaum während einer Season zusammen, wie soll das über 1-2 Jahre gehen...?","replies":[]},{"poster":"Bezar","date":"2016-02-21T21:17:42.666+0000","up_votes":2,"down_votes":0,"body":"Etwa Renegades, die nichtmal wissen, wie man das Midgame mit einem Lead spielt...","replies":[]},{"poster":"Bezar","date":"2016-02-11T21:36:42.835+0000","up_votes":2,"down_votes":0,"body":"... Ja klar Giants, pickt 0815 Meta of the Day, weil ihr ja so gut seid mit 0-8 .... *facepalm*\n\nMega lächerliches Earlygame von Giants werden komplett outplayed...","replies":[]},{"poster":"Bezar","date":"2016-02-09T18:07:07.771+0000","up_votes":2,"down_votes":0,"body":"Habs auch grad gelesen, auch wenn es erstmal nur ein Leak ist...\n\nRekkles kann von miraus passiv spielen wie er will, nur ist das einfach nicht hilfreich, wenn Top und Mid nicht automatisch gewinnen, wie letzte Season. Rekkles sollte auch mal seine Lane gewinnen, statt sich einen Goldvorteil zu erfarmen und hoffen, dass der Gegner bis dahin nicht stärker ist...\nFür mich kein Worlds-Niveau tauglicher Spielstil.\n\nDoublelift ist was anderes, der sieht einfach nur Rot, greift alles an was kommt und schaut weder auf die Map noch sichert er sich richtig mit Wards ab, als Toplaner wär der nen Alptraum für jedes Team, dass Splitpushen will.","replies":[]},{"poster":"StitchStar","date":"2016-01-21T22:31:34.628+0000","up_votes":1,"down_votes":0,"body":"Ansonsten bin nicht so überzeugt vom FNC Shotcalling, Spirit ist auch fraglich siehe WE als Hauptshotcaller! Ich denke aber Spirit sein teilweise Shotcalling ist bestimmt ganz gut wenn es um Dragon usw geht siehe SSB.\n\nIrgendwie sieht mir das nach einem großen Problem aus und bin mir nicht sicher ob die das bis zu Worlds lösen können. Außer Noxiac wird wie aus dem nichts ein zumindest guter Shotcaller. \n\nWundert mich aber nicht, dass FNC ein Teamfight Team wurde, mit 2 SSB Spielern, auch wenn der eine nur Sub war.","replies":[{"poster":"ObeVanDope","date":"2016-01-21T22:38:58.689+0000","up_votes":2,"down_votes":0,"body":"Das war die 2 Woche LCS. Das da noch nicht alles greift sollte klar sein :). Ich würde auch jedem mal (zumindest der es noch nicht gesehen hat) die neue Life of Legends Folge von Fnatic ans herz legen. Ich finde, durch die eindrücke die man da bekommt, das es \"KEIN\" Team im westen auch nur \"annähernd\" mit Fnatic ihrem Staff aufnehmen kann. Egal wieviel Leute gehen, es wird einfach wieder genauso gute, wenn nicht sogar bessere, geholt. Und man sollte auch mal auf das Englisch von Spirit achten, halbwegs ok, für das, das er erst aber ein gewisse \"kurze\" zeit im Gaminghaus ist, ist das schon ziemlich beeindruckend wie schnell er das doch lernen möchte.\n\nDa ist noch mehr drin in diesem Team :)\n\nGreetz","replies":[]}]},{"poster":"AmazingMaze","date":"2016-01-14T10:50:12.987+0000","up_votes":1,"down_votes":0,"body":"Gibt es eigentlich auch irgendwo eine Übersicht über ALLE Spiele? Also eine bei der man nicht immer zwischen den einzelnen Regionen hin und her klicken muss (EU LCS, NA LCS, usw zusammen?).\nVielleicht bin ich auch einfach zu unfähig sie zu finden, aber letzte Saison fand ich das besser und übersichtlicher. :)","replies":[{"poster":"StitchStar","date":"2016-01-14T11:47:12.654+0000","up_votes":2,"down_votes":0,"body":"Wenn dich nur EU interessiert:\n\nhttp://lol.esportspedia.com/wiki/League_Championship_Series/Europe/2016_Season/Spring_Season\n\nFür alle ...:\n\nhttp://lol.esportspedia.com/","replies":[]}]},{"poster":"KUFie","date":"2017-01-24T20:39:43.016+0000","up_votes":1,"down_votes":0,"body":"JAu schade, das Riot das mit der Communitypflege nicht so hinbekommt ...","replies":[]},{"poster":"ü ö","date":"2017-01-24T20:28:40.474+0000","up_votes":1,"down_votes":0,"body":"rip thread","replies":[]},{"poster":"KUFie","date":"2017-01-20T09:10:14.692+0000","up_votes":1,"down_votes":0,"body":"Die ersten beiden Spiele der EU LCS sind um, zu OG vs H2K kann ich nicht viel sagen das hab ich leider noch nicht gesehen. \nFNC war für mich stärker als gedacht, vorallem in Spiel 2 und 3 vielleicht hat G\" aber auch nach den beiden Kills für Caps im 2ten Spiel ein wenig den Faden verloren. Caps selber war im ersten Spiel nervös im zweiten Stark und im dritten wollte er zuviel :-). Aber das er gut in der SoloQ performt hat man erkennen können. \nIch würde mich über noch mehr unerwartete Picks wie singed in der LCK freuen. Vielleicht hat ein EU Analyst da ja was vergleichbares in der Tasche ? Heute würde ich UOL oder MSF einen funktionierenden ungewöhnlichen Pick zutrauen.","replies":[]},{"poster":"KUFie","date":"2017-01-15T12:44:14.035+0000","up_votes":1,"down_votes":0,"body":"Naja wenn man sich mal die ganzen offenen Stellen auf der Riot Homepage anguckt scheinen sie ihre Personalressourcen gut auszun ... äh schöpfen :)","replies":[]},{"poster":"Ghostwing","date":"2017-01-14T12:53:45.727+0000","up_votes":1,"down_votes":0,"body":"Ich muss sagen, ich bin ziemlich enttäuscht von dem Fantasy System. Da Riot ja sicherlich wusste was kommt, hätte man seit November auch an nem Durchschnittspunkte System arbeiten können. Oder nicht jedes Mal in EU ein anderes System testen. Ist zwar nett, dass es überhaupt Fantasy gibt, aber ein deutlicheres Indiz für Null-/Fehlplanung gibt es ja kaum.","replies":[]},{"poster":"Ghostwing","date":"2017-01-12T11:21:13.918+0000","up_votes":1,"down_votes":0,"body":"Bezar, JC haltet mal Ausschau im Channel, weil so demnächst (wenn Rito selbst nen Plan hat) sollte der Draft möglich sein.","replies":[]},{"poster":"KUFie","date":"2017-01-10T14:41:45.384+0000","up_votes":1,"down_votes":0,"body":"Ich persönlich hätte auch eine Season Preshow ganz nett gefunden, in der  einmal die neuen Roster und der neue Spielmodus vorgestellt werden, aber so bleibt Luft nach oben für den Summersplit bzw. 2018....","replies":[]},{"poster":"Ghostwing","date":"2017-01-09T13:43:47.973+0000","up_votes":1,"down_votes":0,"body":"Da stand was auf reddit, dass das wohl ärgerlich gelaufen ist. Allerdings sollte Riot nicht davon ausgehen, dass jeder reddit liest.\nWas mich mehr ärgert ist dieses \"being different for the sake of being different\" (from NA). Dadurch gibts auch jedesmal Auswirkungen auf die fantasy lcs. Wir wisssen 10 Tage vor LCS Start nichts, ja, es waren Feiertage und das lief schon immer so knapp. Ich kann mir aber vorstellen, dass die Leute nich wollen, dass es so knapp läuft. Legt den Start doch einfach nächstes Mal 2 Wochen nach hinten, dann könnte genug Zeit sein.","replies":[{"poster":"HyperionCH","date":"2017-01-09T21:58:09.516+0000","up_votes":1,"down_votes":0,"body":"Ich habe auch teilweise das Gefühl, Riot erwartet von seiner Community, dass sie in Reddit aktiv sind. Hoffentlich wird Riot auch in anderen Plattformen (insbesondere den eigenen) aktiver.\n\nWas mich jedoch irritiert:\nHätte Riot nicht eigentlich die Gruppenauslosung streamen können? Wäre bestimmt interessant gewesen, wenn im Vorfeld die Caster die Regel-Änderung dabei erklärten, etc. und dann die Gruppen ausgelost werden.\nZudem hätte Riot so die Fans bereits auf den Split etwas anheizen können.","replies":[]}]},{"poster":"KUFie","date":"2017-01-09T13:56:31.580+0000","up_votes":1,"down_votes":0,"body":"Oder es wird halt mal 2 Monate im vorraus geplant, für die Bundesliga der Spielplan steht ja auch schon kurz nach dem Ende der letzten Saison fest, ist doch theoretisch kein Problem das sich 1-2 Mitarbeiter ab November mit der Terminierung und Artikelplanung für die neue Saison befassen ist ja nicht so das Riot rote Zahlen schreibt und sich die 1-2 Mitarbeiter zusätzlich nicht leisten könnte. Ich erwarte ja nichtmal das alles auf GER übersetzt wird tut unseren Kids ganz gut sich ein wenig mit der englischen Sprache zubeschäftigen. \n\nNAja vielleicht kommt ja noch etwas im Laufe der Woche. Oder halt am 18.01. so wie jetzt auch zum CS-Q ;)","replies":[]},{"poster":"JCDenton333","date":"2016-12-07T00:30:31.209+0000","up_votes":1,"down_votes":0,"body":"Huch, hier ist ja doch noch was los!\n\nSolange die Roster noch nicht durch sind werde ich mich mal halbwegs zurück halten. \nBei FNC sehe ich ein paar Fragezeichen. Ein klares Statement á la \"Nach der Season rocken wir aber alles weg\" sieht jedenfalls anders aus. \nBtw. dürfte sich Perkz über die Verpflichtung von Caps freuen, vielleicht ist er dann nicht mehr der am negativsten betrachtete Midlaner in EU ;)\nInsgesamt sehe ich EU bisher nicht sonderlich stark. Ich hoffe, dass H2K noch eine geile Botlane zusammen bekommt, der Rest sieht schon gut aus. \n\nBei NA sehe ich es ähnlich, da sieht es bisher enger aus als früher. Da verstehe ich allerdings so einige Entscheidungen nicht, sowohl von Teams als auch von Spielern. \n\nUnd zu Korea muss man nichts sagen, das wird vermutlich die kompetitivste und stärkste Liga bisher sein.","replies":[]},{"poster":"Ghostwing","date":"2016-12-02T13:26:10.972+0000","up_votes":1,"down_votes":0,"body":"So, da wir unsere Diskussion ja hauptsächlich im Channel halten, aber nicht alle da sind (Stitch, irgendwie muss der Support dich da wieder reinbekommen, bei jemand anderem von dem ich weiß wurde auch ein Problem behoben): mit den (soweit confirmed) ganzen Rosterchanges die sich so langsam einstellen, was denkt ihr?\n\nEin paar Gedanken meinerseits:\n\nSollte Caps wirklich so ein Rollo sein wie jetzt langsam herauskommt, meh. Ich glaube an zweite Chancen (auch bei Jensen war ich skeptisch, aber der scheint tatsächlich nicht mehr so übel zu sein) aber wenn sie ihn nicht schnellstens \"in line\" bekommen, weg mit ihm. UoL hat immer noch ein Jungleproblem und H2K hat auch schon ein paar solide Spieler gesigned. Wird das eigentlich BO3 werden?\n\nKR wird interessant. KT SKT SSG sehen schonmal stark aus.\n\nIn NA tut sich auch viel, da dürfte es vll. auch enger zugehen, ich rechne bisher nicht mit 17-1 Ergebnissen. Mal schauen wer TSM ADC wird.\nNur Echo Fox ist für mich etwas unverständlich. Man holt sich Looper (yay) und behält Froggen, bei dem man nun 3 Seasons min. Zeit hatte zu merken, dass er kein Spieler mehr ist, um den man ein Team baut. In S2 hat (übertrieben dargestellt) \"nichts tun bis man gestalled hat und nen Teamfight gewinnen kann\" noch geklappt. Klappt jetzt nicht mehr so. Ich hab keine  Zweifel, dass Froggen gut ist, aber dann kommt mir immer wieder vor Augen wie er seinen Jungler im eigenen Redsidejungle hat sterben lassen, wobei sein gegnerischer Mid noch vor ihm da war, obwohl er näher dran UND Ahri war. Ja ist nur eine Szene und war vll. ein Call, aber ich hab immernoch das Gefühl, der Kerl tut nix außer farmen bis 5-6 Items. Außerdem mal schaun, wie sie das Sprachproblem lösen, da es nicht so viele NA Residents in Jungle/Sup gibt, die koreanisch können.","replies":[]},{"poster":"Sneaky Bastard","date":"2016-11-24T08:10:13.629+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"ü ö","date":"2016-11-22T07:40:06.918+0000","up_votes":1,"down_votes":0,"body":"piep","replies":[]},{"poster":"KUFie","date":"2016-11-05T06:29:49.682+0000","up_votes":1,"down_votes":0,"body":"Moin!\n\nDer Spring Split startet bald in eine neue Runde und in diesem Thread könnt ihr über alles mögliche diskutieren.\n\nDen Spielplan findet ihr demnächst auf unserer neuen deutschen lolesports Seite, die seit Januar im Gange ist. Hier findet ihr auch in Zukunft die deutschen eSports Artikel, die früher immer auf der League of Legends Seite gepostet wurden. Auch eure Tickets für die Show könnt ihr hier erwerben. Um keine Neuigkeiten zu verpassen, könnt ihr unserem offiziellen Twitter Account folgen.\n\nWas denkt ihr Beschwörer? Wird Fnatic wieder einen 18-0 Split hinlegen? Wird Origen, oder vielleicht das neue Vitality, die Könige vom Thron stoßen? Wir freuen uns auf rege Diskussionen!\n\n\nSo hab mal pre season 2017 eröffnet ^^","replies":[]},{"poster":"Treffnix","date":"2016-10-04T22:27:16.666+0000","up_votes":1,"down_votes":0,"body":"Auch wenn hier nicht soviel ist, kein Worlds-Thema zu erstellen ist absolut peinlich Riot und nicht zu entschuldigen.\n\nKann doch net sein das alles in ner LoL-Gruppe wie in unserer diskutier wrd.\n\nPeinlich Riot einfach nur peinlich -,-","replies":[{"poster":"hshtagniemehrcdu","date":"2016-10-05T15:50:02.709+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Puferli,realm=EUW,application-id=hGYdiTd1,discussion-id=1K8irVRU,comment-id=021d,timestamp=2016-10-04T22:27:16.666+0000)\n>\n> Auch wenn hier nicht soviel ist, kein Worlds-Thema zu erstellen ist absolut peinlich Riot und nicht zu entschuldigen.\n> \n> Kann doch net sein das alles in ner LoL-Gruppe wie in unserer diskutier wrd.\n> \n> Peinlich Riot einfach nur peinlich -,-\n\nSehe kein Problem darin.\nDu kansnt zu jedem Thema selber einen Thread erstellen.\nWelchen Zusatznutzen hat es denn, wenn der von Riot kommt?\nUnd das ganze dann nur für die 5-6 Leute die darin überhaupt posten...","replies":[]}]},{"poster":"JCDenton333","date":"2016-09-09T12:41:15.596+0000","up_votes":1,"down_votes":0,"body":"Ich schätze mal, das müssen wir selbst in die Hand nehmen...","replies":[]},{"poster":"Treffnix","date":"2016-09-06T19:15:44.663+0000","up_votes":1,"down_votes":0,"body":"Kriegen wir denn zumindest nen World-Thread?\nOder ist das auch zuviel verlangt? :P","replies":[]},{"poster":"JCDenton333","date":"2016-07-28T14:35:24.699+0000","up_votes":1,"down_votes":0,"body":"Origen packt das nicht mehr, da würde ich fast drauf wetten. \nIch denke, dass die Top 3 von jetzt auch am Ende zu den Worlds fahren werden, evtl noch H2K wegen der Punkte aus dem Spring Split.","replies":[]},{"poster":"KUFie","date":"2016-07-27T12:32:52.297+0000","up_votes":1,"down_votes":0,"body":"Das denke ich auch, allerdings sind hier noch so 1-2 mehr unterwegs gewesen, und unterwegs hab ich keinen Ingamechat 😉 also schreib ich hier noch ab und an. \nWas denkt ihr fahren Origen noch zu den Worlds ist ja theoretisch noch möglich...\n\nUnd bekommen wir für die worlds wohl einen neuen Thread ?","replies":[]},{"poster":"Ghostwing","date":"2016-07-26T12:12:57.096+0000","up_votes":1,"down_votes":0,"body":"Weil wir hauptsächlich ingame chatten jetzt denk ich mal. Und der Thread heißt schon ziemlich lange so. ^^","replies":[]},{"poster":"JCDenton333","date":"2016-07-24T15:45:51.415+0000","up_votes":1,"down_votes":0,"body":"Japp, das Forum ist ziemlich tot...","replies":[]}]}