{"poster":"MegaErnando","date":"2016-06-07T17:26:12.592+0000","title":"¿Es normal?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Lo que pasa es que me compre una PC hace dos semanas, y tengo todo en alto excepto las sombras que estan en medio, y me va a 80 fps llega a 100 pero lo limite a 80, y la cpu llega a 65&deg; a 4000RPM o mas, el ruido que hace cuando pasa los 4000RPM es muy molesto,y queria saber si es normal ya que como la pc cumple con todos los requisitos a la perfeccion quiza no tendria que calentarse tanto, no se mucho de esto, les dejo las caracteristicas. \nAMD A10-7850K 3.7GHZ\nCuatro Nucleos\nAsrock FM2A68-HD+\n6 de ram (5 utilizables)\nAMD Radeon R7 (Integrada)","replies":[{"poster":"ZeNch","date":"2016-06-07T17:33:43.206+0000","up_votes":1,"down_votes":0,"body":"Nunca use un APU (y hace MUCHO no uso los disipadores de fabrica) pero es una barbaridad... estaria bueno que le comentes al que te lo armo quizas hay algun defecto en el armado (quizas no puso bien el disipador o vino fallado algo...sin jugar, en iddle que temperaturas tenes?","replies":[{"poster":"MegaErnando","date":"2016-06-07T17:35:46.904+0000","up_votes":1,"down_votes":0,"body":"Sin jugar unos 37 grados sin nada abierto y con el chrome viendo videos o cualquier otra cosa a los 43 - 45","replies":[{"poster":"ZeNch","date":"2016-06-07T17:56:49.689+0000","up_votes":1,"down_votes":0,"body":"llama al tecnico, esa temperatura en iddle (sin hacer nada de nada) estando aca en INVIERNO (casi) ... en verano no vas a poder ni iniciar el escritorio.\n\n\nPor mas de que AMD tenga mucha temperatura en algunos modelos, eso es una barbaridad. el limite ronda los 62/72 grados (no recuerdo).\nAlgun defecto del producto o armado hubo.","replies":[{"poster":"MegaErnando","date":"2016-06-07T18:08:44.674+0000","up_votes":1,"down_votes":0,"body":"Igual tambien tengo la estufa puesta y no se nota para nada el frio aca, quiza sea por eso","replies":[{"poster":"ZeNch","date":"2016-06-07T18:22:24.359+0000","up_votes":1,"down_votes":0,"body":"lo unico q falta es q la estufa este pegada al pc... yo saque mi estufa por que no la iba a prender nunca por que mi cuarto es chico y mi pc esta justo al lado (no hay otro lugar para ponerla)","replies":[{"poster":"MegaErnando","date":"2016-06-07T18:25:07.480+0000","up_votes":1,"down_votes":0,"body":"Mi estufa esta en una punta de la pieza y la pc en la otra, enrealidad la pc esta en el living por que en mi pieza no hay espacio, abri la puerta del living para que salga calor por que la verdad de sentia bastante el calor, y ahora estoy solo en el chrome y esta a 34 grados, ahora me fijo que onda en el juego","replies":[{"poster":"ZeNch","date":"2016-06-07T19:23:05.996+0000","up_votes":1,"down_votes":0,"body":"te bajo 10 grados solo x la estufa... masomenos lo que decia yo de la temperatura... xD se ve que tan mal no llevo mi calculo (?\n\nLos AMD calientan pero lo tuyo era una bestialidad considerando que estamos en invierno","replies":[]}]}]}]}]}]},{"poster":"Maszke","date":"2016-06-07T17:35:46.845+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZeNch,realm=LAS,application-id=v7qsfXsE,discussion-id=61kT7GgB,comment-id=0002,timestamp=2016-06-07T17:33:43.206+0000)\n>\n> Nunca use un APU (y hace MUCHO no uso los disipadores de fabrica) pero es una barbaridad... estaria bueno que le comentes al que te lo armo quizas hay algun defecto en el armado (quizas no puso bien el disipador o vino fallado algo...sin jugar, en iddle que temperaturas tenes?\n\nno hay ningun defecto, es amd y encima apu :P","replies":[{"poster":"ZeNch","date":"2016-06-07T18:03:12.582+0000","up_votes":1,"down_votes":0,"body":"Considerando que dijo 35c en iddle (sin hacer nada) y que estamos en invierno... obviamente algo mal hubo... que intel es mas frio lo acepto pero que amd es TAN caliente lo niego... te creo que me digas que llega a 55 grados a full (en esta epoca del año... en verano mas, pero que le llega a 65 en dias de CASI invierno... ahi algo mal hay.)\n\nPor mi parte con AMD estoy feliz por que siempre por el mismo $ encontre mejores opciones (HASTA sierto punto donde INTEL ya empieza a ganar en todos los aspectos...)\n\nYo con mi 8320 soy feliz (soy de argentina lo compre cuando estaba $2100 y habia vendido por internet un phenom II 1090T a 2000 asi que negocio redondo.) Luego un lindo OC a 4.5 que lo baje a 4.2 por que me calentaba mucho el mother ( los VRM... ty gigabyte) y asi ando ahora... obvio que con Un kit de LQS aunque con el Thermaltake Frio se lo bancaba pero hacia mas ruido.\n\nAMD mas alla de ese modelo no valia la pena en su rango de precio. a partir de ese precio (en ese momento) intel ganaba todo.","replies":[]}]}]},{"poster":"Conejito Feliz","date":"2016-06-07T18:36:20.961+0000","up_votes":1,"down_votes":0,"body":"Es amd . listo fin de la discucion.","replies":[]},{"poster":"Khimea","date":"2016-06-07T17:31:10.689+0000","up_votes":1,"down_votes":0,"body":"1ro es AMD.\n2do estas usando la integrada es normal que caliente tanto.","replies":[]},{"poster":"Maszke","date":"2016-06-07T17:30:18.205+0000","up_votes":1,"down_votes":0,"body":"tengo tu misma maquina, y si, hace un ruido del averno, ponele 2gb mas para que te quedes con 6gb utilizables y 2 de video.\nen opciones capea los fps a 60fps, es un gasto de recursos por parte de tu pc y se sobrecalienta. te recomiendo tambien que le compres un cooler mejor (cosa que yo tambien deberia hacer) y si no podes, no te pongas la estufa y abri las ventanas para que el frio entre a tu pieza :P\n\nde memoria ram espero estes utilizando minimo de 1866mhz","replies":[]}]}