{"poster":"Beatsteak","date":"2017-03-25T16:36:16.201+0000","title":"DuoQ Partner gesucht (High Gold / Low Plat)","subforum":"Clans & Teams","embed":{"description":"Beatsteak / Gold 1 25LP / 47W 30L Win Ratio 61% / Evelynn - 15W 7L Win Ratio 68%, Irelia - 12W 4L Win Ratio 75%, Wukong - 4W 6L Win Ratio 40%, Poppy - 4W 5L Win Ratio 44%, Maokai - 6W 1L Win Ratio 86%","url":"https://euw.op.gg/summoner/userName=Beatsteak","image":"http://s3.ap-northeast-2.amazonaws.com/opgg-static/images/logo/2015/reverse.rectangle.png"},"up_votes":2,"down_votes":0,"body":"Hi,\nich suche jemanden zum DuoQ&#039;n. H&auml;nge im Moment auf Gold 1 rum, weil ich keine Lust auf tryharden hab. Spiele alles au&szlig;er ADC gern und gut (f&uuml;r low Plat reicht&#039;s). Ich hab auch n ganz gutes Gameverständnis, deshalb solltest du auch solches mitbringen (ich finde ab Platin braucht man das sowieso..) Vor allem suche ich einen ADC, damit ich &ouml;fter mal vern&uuml;nftig supporten kann, da mir das eigentlich mit am meisten Spa&szlig; macht. Ansonsten gerne Midlane oder Top; Jungle geht auch, ist mir aber zu stressig :D\n\nBin h&auml;ufig nachmittags on - ab ca. 16 Uhr. Im Endeffekt suche ich n lustigen Premade mit dem die SoloQ nicht ganz so &auml;tzend ist, mit dem die Spiele Spa&szlig; machen und mit dem ich trotzdem noch mehr gewinne als verliere - Denn ganz ehrlich, was macht mehr Spa&szlig;, als n enges Game gewinnen?\n\nDa es mir um Spa&szlig; geht, wechsle ich meine Position auch mal, dh. ich werd nicht jedes Spiel supporten, aber auch von der Mid oder Top kann man die Botlane ja beeinflussen.\n\nWenn du also Interesse hast, und 18 oder &auml;lter bist, meld dich Ingame bei mir.\nPS: Bin auch offen für Flex :D\n\nCheers","replies":[{"poster":"ID Smash","date":"2017-03-28T23:58:50.455+0000","up_votes":1,"down_votes":0,"body":"Kann dir da den indischen-boosting-service empfehlen, macht super viel spaß die games zu gewinnen und is auch n cooler dude der umsonst dich auch noch locker flockig hochzieht. \nLG","replies":[]}]}