{"poster":"Lokirian","date":"2017-08-16T06:47:52.582+0000","title":"Probleme mit Mega Orb(s)?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Guten Morgen liebe Community / Wrenchmen / RIOT-Mitarbeiter\r\n\r\nIch habe mir Heute f&uuml;r meine erfarmten 150 Tickets einen Mega Orb gekauft in dem hat es (in der Theorie):\r\n\r\nGarantiert / Guaranteed to contain:\r\n\r\n- Legacy Skin Shard (den ich nicht bekommen habe)\r\n\r\nM&ouml;glich / Chance to contain (was bei mir nicht der Fall war):\r\n\r\n- Mega Orb\r\n- 2x Gemstones\r\n- Lancer Zero Hecarim Skin Shard\r\n\r\nWas f&uuml;r mich bedeutet das folgendes nicht enthalten sein wird (daher der oben genannte Loot nicht als Extra Loot / Special Loot gekennzeichnet ist):\r\n\r\n- Champion (Shard) &lt;- War drin\r\n- Skin (Shard), ausser Lancer Zero Hecarim\r\n- Ward Skin (Shard)\r\n- Summoner Icon (Shard)\r\n- Sonstige Materialien\r\n\r\n\r\nDas irritiert mich nun jedoch sehr, ich mein ich kauf eine Kiste f&uuml;r etwas was ich will (Legacy Skin Shard) und drin sein sollte, bekomme daf&uuml;r jedoch etwas was ich auf KEINEM Fall wollte einen Talon Champion Shard (Ich besitze alle Champions und gen&uuml;gen Shards f&uuml;r neue). So nach dem ich mein Problem erkl&auml;rt habe (und etwas geweint habe) komm ich zu meiner Frage, ist das Absicht? Ist es gewollt das es im Mega Orb keinen (Garantierten) Legacy Skin Shard hat und man einen (Nicht erw&auml;hnten) Champion Shard bekommen kann? Wenn ja finde ich die Beschreibung des Mega Orbs unzureichend und unklar. ich w&uuml;rde ja auf einen &Uuml;bersetzungsfehler tippen wenn ich nicht in der Originalsprache Spielen w&uuml;rde.\r\n\r\nIch glaube es liegt daran das ich (beinahe?) alle Legacy Skins besitze, doch warum w&uuml;rde ich dann keinen Ersatz bekommen? Oder zumindest den Shard, ich bekomme ja auch noch Champion Shards obwohl ich alle Champions besitze.\r\n\r\nVielen Dank vorweg\r\nEuer Loki","replies":[{"poster":"Rahzar","date":"2017-08-16T16:57:59.211+0000","up_votes":5,"down_votes":0,"body":"Hallo, \n\ndabei handelt es sich hoffentlich nur um einen bekannten Anzeigefehler. Du solltest die Inhalte bekommen haben, auch wenn es dir bei der Öffnung nicht korrekt angezeigt wird. \n\nLaut meinen Informationen hast du aus dem Orb den SSW Rengar shard bekommen. Schau bitte nochmal nach und meld dich beim Support, wenn dir wirklich noch etwas fehlt.","replies":[{"poster":"Lokirian","date":"2017-08-16T21:51:11.934+0000","up_votes":2,"down_votes":0,"body":"Vielen Dank, mir wurde der Shard nicht im Loot angezeigt beim ersten mal, doch seit dem Relogen ist er da.","replies":[]}]},{"poster":"Sidia","date":"2017-08-16T07:11:20.061+0000","up_votes":2,"down_votes":0,"body":"Hallo Loki,\n\nfalls aus dem Orb nicht der angegebene Gegenstand gekommen ist bitte ich dich den Spielersupport anzuschreiben: https://support.riotgames.com/hc/de/requests/new\n\nDieser hat die Möglichkeiten sich den Fall anzuschauen und den Fehler ggf. zu korrigieren. Bei falsch ausgegebenen / nicht erhaltenen Belohnungen ist dieser meiner Erfahrung nach sehr offen und schnell.\n\nMit freundlichen Grüßen\nSidia","replies":[]}]}