{"poster":"The Whamboozler","date":"2015-02-21T02:31:15.547+0000","title":"Nidalee is balanced, yo.","subforum":"Gameplay","up_votes":15,"down_votes":7,"body":"I just had some schmuck argue with me for about 5 minutes that {{champion:76}}  jungle isn't ungodly broken right now.  \"lol, she's only bad if you can't dodge spears...  Which she spams every few seconds from the fog of war... and if you eat ONE you have to base or die instantly to her Q.\"  This is balanced to this man.\n\nOh, and if you're not playing a hyper-mobile bursty champ that can actually CATCH her and blow her up before she hops to safety to continue spamming spears from over a wall.  Hell, half the time if you DO manage to all-in her with someone you'll blow up anyway from a point-blank spear and execute on her Q.  \n\nDid {{champion:76}}  get a nerf or something, or was this guy... as I suspect... talking out his ass to defend his free-win champ?","replies":[{"poster":"BetaDude40","date":"2015-02-21T04:04:37.041+0000","up_votes":6,"down_votes":1,"body":"Something about her is very hard to balance for Riot, and they really haven't gotten her in a particularly good spot since release. Before, her spears did insane damage and meant instant death. Then she basically saw no play for a while because a lot of people didn't like how they couldn't insta-gib people with their spears like they used to. Now, her spears... continue to be instant death. We're right back to where we started, except this time she isn't passively sitting back launching spears at the opposing midlaner. Now she's hopping around the jungle throwing spears from the brush to unsuspecting laners and diving in on them like a Season 3 Rengar on cocaine.\n\nI would really like for Riot to go into very large detail whenever they change a champion, other than \"counterplay\" and \"clarity\" (or lack thereof). I feel every patch needs to have a small AMA afterwards, where we can ask a few questions and receive some answers. My judgement of Nidalee isn't always clear (I still have nightmares of the past in the mid lane, and I have a hard time thinking of her as a jungler), so maybe something similar to an AMA would help.","replies":[]},{"poster":"The Whamboozler","date":"2015-02-21T04:39:06.585+0000","up_votes":2,"down_votes":6,"body":"Good to know she's still a disgusting pile of cancer.  I knew that guy was full of crap.  As long as her kit is what it is, I don't see her being balanced.  MAYBE if they gave her meaningful resources to worry about so she couldn't just spam spears all day and wait for ONE to hit so she can go in for the easy kill.","replies":[{"poster":"1st HanarSpectre","date":"2015-02-21T05:26:37.919+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Deitrix,realm=NA,application-id=3ErqAdtq,discussion-id=3IiPzqTz,comment-id=0006,timestamp=2015-02-21T04:39:06.585+0000)\n>\n> Good to know she's still a disgusting pile of cancer.  I knew that guy was full of crap.  As long as her kit is what it is, I don't see her being balanced.  MAYBE if they gave her meaningful resources to worry about so she couldn't just spam spears all day and wait for ONE to hit so she can go in for the easy kill.\n\nNow you're just butthurt circlejerking.\nShe has decent growth in mana and regen, but her early  stats for those are amongst the lowest tier. She can easily run out of mana, and unless she hogs blue all game she can not just spam spear and heals constantly.\n\nNidalee jungle is definitely to ostrong right now, but lanedalee is fine, They should just revert the ability to hunt jungle creeps.","replies":[{"poster":"Thefriendlyorc","date":"2015-02-21T22:11:36.641+0000","up_votes":1,"down_votes":0,"body":"Its her counterjungling I hate. Theres little to nothing you can do about it. You cant duel her early cause she has resourceless attacks and more of them than you do, she's got a heal, a dash and a second one if she hits ANYTHING with her hunt. So she can effectively steal your stuff and just hop over the wall to safety. And once she touches a bush? Forget it. May as well go back to base and call it a loss of creeps.","replies":[]},{"poster":"Junkο","date":"2015-02-21T19:16:48.333+0000","up_votes":1,"down_votes":1,"body":"Or you know, she gets Tear so she takes 2 blues and then doesn't need it anymore. Just like every single Nidalee ever.","replies":[]}]}]},{"poster":"Yash Gautam","date":"2015-02-21T02:35:51.509+0000","up_votes":2,"down_votes":11,"body":"Nidalee is pretty balanced.  Her extrememly weak early game has to be made up for.","replies":[{"poster":"Raja Chachki","date":"2015-02-21T02:38:37.173+0000","up_votes":9,"down_votes":2,"body":"you mean easy, fast clear and great sustain? yeah that makes her early game very hard","replies":[{"poster":"Zair Umbras","date":"2015-02-21T22:07:26.970+0000","up_votes":1,"down_votes":0,"body":"You mean her horrible early clear because she needs all three abilities and items to make her do damage pre-6, her god awful sustain from E that requires you to either level it first or you're chunking your own mana without a blue buff, and her horrible ganks unless the enemy eats some spears? Yeah. Maybe if her spear was reliable in Diamond and above, I'd say she could use some nerfs, but her spear has not only a cast animation, but it moves slowly AND it's radius is smaller than any other skill shot currently.","replies":[]}]}]},{"poster":"Kitten of Evil","date":"2015-02-21T05:47:50.630+0000","up_votes":2,"down_votes":1,"body":"My thing is... why give her a free root to neutral monsters? Literally every single ranged potential jungler would love to have that option, but she gets it for free.\n\nOh also most junglers would also love to have an almost-Soraka strength heal that also gives AS. Hell, most champions in general would like that.","replies":[{"poster":"Junkο","date":"2015-02-21T19:16:15.428+0000","up_votes":1,"down_votes":0,"body":"almost Soraka strenght? It has a higher base and higher ratio than Soraka's heal, and it doesn't cost her health and it gives her an AS boost!","replies":[]}]},{"poster":"GloriousKaiser","date":"2015-02-21T04:10:07.594+0000","up_votes":2,"down_votes":1,"body":"Yup {{champion:76}}  strong again. Burst, Mobility, Sustain. A disgusting combination but that's just how the balance works. Power shifts from nerfs and it continues.","replies":[{"poster":"A Slime Appears","date":"2015-02-21T04:28:49.309+0000","up_votes":1,"down_votes":1,"body":"Has nothing to do with nerfs, has to do with the fact that the rework didn't do anything noteworthy.  She still does the same shit.  They nerfed her pounce but it's still on a cd that even Kassadin is jealous of and it doesn't cost mana, so most champs STILL have no chance of catching her.  They moved some of the damage from human Q into her cougar Q, but her human Q still chunks just fine.  Slimming the hitbox on the spear was the only good thing they did and that wasn't even part of the rework, if memory serves.","replies":[{"poster":"GloriousKaiser","date":"2015-02-21T04:30:04.770+0000","up_votes":1,"down_votes":0,"body":"I was talking about post rework Nidalee anyway. And the nerfs? I'm talking about the game in general.","replies":[]}]}]},{"poster":"CoolKnightST","date":"2015-02-21T18:34:44.276+0000","up_votes":1,"down_votes":0,"body":"For some reason it feels like they have to add a delay to her ultimate. Her R transition really solid and I was really suprised I managed to deal so many damage out my combo without any counterplay. An example of a trade:\n\n* Q > E > E > Q > R > W > Q > R > E > auto > auto > auto > Q \n* Q > E > E > Q (let's say you miss it) > E > auto > auto > auto > Q\n\nSo even if you miss the Q you will still win the trade. She's really an example on a perfect ballanced 7 ability combo. This makes her so strong. None of her abilities is really broken on their own. But together they are just unstoppable. Maybe whe could give her cougar form energy or something.","replies":[]},{"poster":"flibitydoo","date":"2015-02-21T04:21:06.854+0000","up_votes":1,"down_votes":0,"body":"ccless champions like fiora, yi, morde, lucian and kat will always be a balance issue since they are supposedly balanced for their lack of cc by providing stupid levels of damage output/untargetability. They will always be OP or UP because their damage has to be greater than normal to make up for their lack of cc, and if their damage is equal to a champion with cc, then there is no reason to pick them. Giving them mobility won't work because mobility is an even worse method of balancing them out (as we have seen) and giving them untargetability mechanics (as we have seen) have also not fixed the issue with these champions.","replies":[]},{"poster":"Yash Gautam","date":"2015-02-21T02:40:42.861+0000","up_votes":3,"down_votes":6,"body":"She has crappy clear really early, no mana sustain, heal barely does anything.","replies":[{"poster":"The Whamboozler","date":"2015-02-21T03:30:38.872+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=zznoobtubesxx,realm=NA,application-id=3ErqAdtq,discussion-id=3IiPzqTz,comment-id=0001,timestamp=2015-02-21T02:40:42.861+0000)\n>\n> She has crappy clear really early, no mana sustain, heal barely does anything.\n\nHer and every other jungler out there.  At least she HAS a heal.","replies":[]},{"poster":"Frikgeek","date":"2015-02-21T15:33:34.570+0000","up_votes":1,"down_votes":0,"body":"Every jungler that's not WW or Fiddle has a crappy early clear. The new jungle is on stereoids. At least NIdalee has a heal and can kite in her ranged form to avoid some damage.","replies":[]}]},{"poster":"A Miss Fortune","date":"2015-02-21T04:27:59.392+0000","up_votes":1,"down_votes":2,"body":"I've tried to give Nidalee chances as a balanced champion, but every time I play against her she just proves she isn't balanced.\n\nHer spears do either force you to recall or die if you get hit by 1 - 2, and she can spam them very often for what they do. She has easy escapes and gap closers, her traps can be used as a quick ward. The only thing is that Nidalee is squishy usually. But even then she will probably kill you before you kill her, considering even if you try to get away she can easily catch up and will kill you.","replies":[]}]}