{"poster":"skysoul fenrir","date":"2016-08-28T22:05:54.218+0000","title":"mi experiencia con yasuo","subforum":"Charlas Generales","up_votes":3,"down_votes":16,"body":"bueno, me presento, mi nombre de invocador es skylightwolf777, llevo jugando este juego desde diciembre del a&ntilde;o pasado, soy bronce III (a mucha honra) y soy main jungla.\r\nUltimamente he estado pensando en ver el juego de una manera mas competitiva, tratar de ganar mas del 50% de mis paridas, ascender de liga y para eso pens&eacute; en usar campeones rotos para ellos y que ampeon no esta mas roto que yasuo actualmente? Despues de muchas partidas me lo compre y mi primera experiencia fue... que es un campeon con mecanicas divertidas, muy excedidas (y a mi parecer esto lo hacen adrede) y con un estilo que se adaptaba a mi, la segunda partida empec&eacute; a darme cuenta que algo andaba al cada vez que me metia en un duelo contra un rival y a la tercera partida ya me dio dolor de estomago, por lo que lo reembolse de inmediato.\r\nPienso que yasuo es un buen campeon que si riot le hiciera los ajustes necesarios (y ellos saben cuales son) seria un muy MUY buen campeon, no roto, sino potente, pero me desvio del tema, lo unico que les puedo decir es que, si ustedes son jugadores que nunca tocaron a yasuo en todo el tiempo que llevan jugando (como yo) y son jugadores &quot;honestos&quot; por decir de una manera (no me refiero a honestos en si) no lo usen para aumentar de elo ni para subir de liga, es un campeon injusto, facil de counterear, pero solo con ciertos campeones y hasta cierto momento de la partida, si son como yo que se sintio sucio por usar a un campeon como el (insisto, el campeon me encanto, tiene lo que me gusta de un personaje pero esta muy desbalanceado) no lo compren ahora.\r\nEs probable que me llenen de negativos, pero es mi opinion asi que espero que la sepan respetar, que tengan buen dia","replies":[{"poster":"DarkClouds","date":"2016-08-29T00:15:06.225+0000","up_votes":3,"down_votes":0,"body":"Sentí lo mismo que tu pero luego de unas 500 partidas, lo tengo con 250k de maestria pero hace unos 5 meses que no lo juego por lo desbalanceado que esta ahora, se siente bien jugarlo pero cuando juegas en contra de el es una pesadilla, lo deje por tu misma razón","replies":[{"poster":"skysoul fenrir","date":"2016-08-29T00:18:04.557+0000","up_votes":1,"down_votes":0,"body":"ojala los demas pensaran como tu","replies":[]}]},{"poster":"Ks Erwyn","date":"2016-08-28T22:50:12.934+0000","up_votes":3,"down_votes":0,"body":"Ami me salio por juntar 3 fragmentos de campeon, si no jamas me lo hubiera comprado...senti lo mismo que tu al usarlo una 2 partidas donde stompee sin saber usarlo, lo mismo me paso con Riven alguna vez....","replies":[]},{"poster":"1st Time Eve","date":"2016-08-29T01:25:15.415+0000","up_votes":1,"down_votes":0,"body":"yasuo contra campeones como {{champion:84}} {{champion:131}} {{champion:39}} {{champion:114}} {{champion:238}} {{champion:92}} {{champion:90}} no tiene ninguna posibilidad en linea :)","replies":[{"poster":"skysoul fenrir","date":"2016-08-29T03:39:59.443+0000","up_votes":2,"down_votes":0,"body":"depende de la mano de quien lo juegue, uno puede decir facilmente que son counters de yasuo pero aun asi, no es de ir a tirarse contra el como si nada, aun para sus counter, yasuo es peligroso","replies":[{"poster":"1st Time Eve","date":"2016-08-29T18:00:51.288+0000","up_votes":1,"down_votes":0,"body":"Tenes razón","replies":[]}]},{"poster":"Aioria99","date":"2016-08-29T01:54:32.177+0000","up_votes":1,"down_votes":1,"body":"Riven y zed estan de mas","replies":[]}]},{"poster":"TSW Rorschach","date":"2016-08-29T00:18:15.073+0000","up_votes":1,"down_votes":0,"body":"Yo usé a Yasuo unas tres veces y simplemente no me gustó (no sé otros pero se me hacía irritante tener que ir con la E para un lado, para el otro, para un lado, para el otro e_e prefiero los plomazos andantes que pegan duro), pero no es un personaje al que counterean pocos campeones, en serio? .-. Lb, Lux, Annie, Malzahar, Zed, Jax, Olaf, Teemo, Darius, Garen, Braum, Fiora, Gnar, Pantheon, Cho'Gath, Riven, dependiendo de quien juegue mejor siempre pero sus habilidades lo joden mucho... (es un \"luchador\" asesino :v stun/encarcelamiento/silencio y es personaje muerto sacando el caso de Olaf o Zed) Mas allá de que sea un campeón desbalanceado (te admito que luego de statikk o bailarín duelen sus q y si te dejas golpear bye a tu vida :v ), solo hay que saber cómo contrarrestarlo, like metiendo el cc donde se está moviendo, y su muro tiene como 20 segundos de enfriamiento al inicio, mucho más largo que cualquier skillshot corriente sin contar ultis :v y en el caso de que justo tu personaje no pueda, se pide ayuda al jg/ compañero que ande cerca, se rommea, pueden hacerse muchas cosas contra un campeón al que no le puedas no solo hablando de Yasuos xD \n\nEs como con muchos campeones \"Asquerosamente poderosos\" (cof, cof, Vayne/ Zyra/ inserte otros), los ves tan fuertes en late o en early, pero siempre se los puede cagar de una u otra manera a pesar de que los veas invencibles en cierto momento de la partida xD Claro, muchas veces terminas perdiendo porque parece invencible (cof cof, Vayne m7 20/5/8) pero eso ya es otra cuestión, más allá de que son campeones con un daño de mierda :v\n\nY si, odio a Vayne :v que no se note(?","replies":[{"poster":"skysoul fenrir","date":"2016-08-29T00:22:50.055+0000","up_votes":1,"down_votes":0,"body":"jaja, yo tambien odio a vayne pero hay algo que te discutire y es sobre como contrarrestarlo ya que tienes que encadenarlo con cc para que no haga nada, borrarlo por la misma razon o ambas cosas por que una vez pilla 2 items es capaz de borrarte en cero coma, su late es injusto por donde lo veas (igual que el de vayne)","replies":[{"poster":"Lunari Red Mask","date":"2016-08-29T01:06:46.853+0000","up_votes":1,"down_votes":0,"body":"Hola,\n Cualquier campeón puede ganar a Yasuo sí  no llega a late game. Y es el problema. Porque es tan fácil como jugarle con campeones que peguen mucho o a distancia y entonces Yasuo no tiene nada que hacer. Sin embargo he visto gente que va Yasuo top, muere 10 veces  y no le rompen la torre, después en late gana el 1vs1 y rompe todo y carrea. Odio a esa gente.","replies":[{"poster":"skysoul fenrir","date":"2016-08-29T03:48:54.309+0000","up_votes":1,"down_votes":0,"body":"el problema es justamente su late game","replies":[{"poster":"TSW Rorschach","date":"2016-08-29T10:25:32.573+0000","up_votes":1,"down_votes":0,"body":"Pero si a eso vamos muchísimos campeones tienen late injustos en plan que hace muchisimo daño y no llegás a  siquiera darle un golpe y si se lo diste ni se notó xD como Jax, bajar a Jax en late si anda feed es peor porque encima de que hace un daño absurdo, resiste demasiado dependiendo como se arme y hacerle focus a un Jax es... :v. A Yasuo un buen cc puesto o un focus en el momento indicado y lo bajaste xD como a cualquier asesino en sí pero bueno...\n\nNo sé si me enfrenté o vi demasiados Yasuos y como que no lo priorizo a la hora de preocuparme (para mí, campeones asquerosamente poderosos hay otros más preocupantes(?), pero si bien está desbalanceado en daño luego de un ítem/ dos ítems completos, hay formas efectivas de joderlo en una tf y que no te deletee de dos q(?\n\nY si todo falla siempre campear en el arbusto de a 3 mientras pushea con sus saltitos solo es una buena táctica(?","replies":[]}]}]}]}]}]}