{"poster":"skysoul fenrir","date":"2016-09-01T21:59:06.829+0000","title":"te tomas esto como un juego y no te importa ir 0/10/0? pasate por acá","subforum":"Charlas Generales","up_votes":24,"down_votes":5,"body":"Asi como vez en el titulo, si te tomas esto como un juego, no esta mal, es mas, es lo mejor que puedes hacer por que hay gente que solo piensa en ganar, ganar y ganar y por lo general son personas que(creo yo) le dedican mas tiempo al juego que a otros aspectos de su vida, lo cual para mi, me parece mal.\nPero que pasa? Esto es juego como piensas, y para que estan hechos los juegos? Para divertirse, ahora la cuestion es, a ti te parece justo que un sujeto que no le importa ni un poco morir, ni tampoco le importe evitar su muerte? Esto le da una ventaja injusta al equipo contrario volviendo el juego algo frustrante y por lo tanto le quita lo divertido, si en una carrera a ti alguien te mete el pie y tropiezas, y pierdes por ello, te enfadas y te dicen &quot;es solo un juego&quot; no te gustaria no?.\nEl punto es, que por mas que esto sea un juego, si estas llendo mal, por lo menos intenta no cometer los mismos errores que te llevaron a estar mal en la partida, por que le estas dando una ventaja al equipo enemigo lo que lleva a una experiencia de juego amarga para los demas.\nAhora que te dije todo esto, seguiras pensando que por que es un juego, todo esta bien?\n****\n\nRecalco, esto va para las personas que se toma demasiado a la ligera el juego y va fedeando al team enemigo, esto le arruina la experiencia de juego a sus copañeros, esta bien que no te importe perder pero no por ello quiere decir que a tus compañeros no les importe, hay gente que no dice nada, otra que te flamea pero la verdad es que perder no se siente bien y eso es algo que no toda la gente lo ve así y arruina la diversion","replies":[{"poster":"TSW Rorschach","date":"2016-09-01T22:47:21.616+0000","up_votes":5,"down_votes":0,"body":"Creo que una cosa es una ranked -donde el juego es competitivo- y otra el juego normal, que es donde la gente prueba cosas y practica aparte de divertirse.\nEl ejemplo de la carrera, iría para una ranked, ahí si entiendo porque ya es un juego competitivo y obviamente a nadie le gusta perder, la idea en sí, es subir :v Pero ya una partida normal, no digo que no se deba, pero en mi opinión, no tendría que ser en sí competitiva, ya que, justamente es una partida en la que la gente prueba cosas, builds y roles. También tácticas, etc.\nSi no podes practicar en normales porque justo todos se toman terriblemente a pecho la victoria, es imposible, porque en bots, todo funciona. Las normales en mi opinión son practicas efectivas para las ranked.\nEn fin, yo me tomo las normales por lo que son, un juego. Vaya para el traste o vaya bien, trato de divertirme y mejorar. El tema es que siempre me encuentro con gente que se cree que es su promoción a diamante y te putea nomás porque no cantaste la mia/te moriste 3 veces/ no miras el mapa/te roban el dragon o baron/\"No ayudas\"/el enemigo te gana en farm/etc.\n\nUna cosa es morirte 400 veces porque te parece divertido, y otra divertirte y al mismo tiempo saber qué cosas tenes que hacer en x momento para llegar a la victoria.","replies":[{"poster":"skysoul fenrir","date":"2016-09-01T23:09:58.453+0000","up_votes":2,"down_votes":0,"body":"lo que quise decir esta en las personas que se divierten aun si pierden pero no se ponen en lugar de sus compañeros y por ello no tratan de cambiar algo en la partida, lo que lleva a que el equipo enemigo se fedee y a ti te arruine la diversion y emocion que te puede dar una partida reñida o por lo menos decente, hay una verdad que ellos no saben interpretar estando en el lugar de los demas y es que perder no se siente bien, a pesar de que ellos aun se diviertan en la derrota, hay gente que no le hace nada de gracia y les molesta y no me refiero a esos que te flamean solo por que diste la primera sangre o por que vas un poco mal en early, sino la gente que es paciente pero que de tanto que fedeaste hasta ellos se cansan","replies":[{"poster":"EdxxEdxx","date":"2016-09-02T01:06:33.130+0000","up_votes":2,"down_votes":0,"body":"lo que intentas decir es que, esa gente no le importa lo que sientan sus compañeros al saber que literalmente perdieron por su culpa, es decir, esta bien que no te sulfures el cerebro, pero sea una normal, sea la lcs, sea donde sea, un jugador simple y llanamente va a querer ganar lo que sea que este haciendo, asi sea una competicion de tirarse pedos mas rapido que el otro. una cosa es perder sabiendo que A VOS te falto habilidad, y esto solo pasa en juegos de 1vs1, pero el lol, al ser un 5vs5, es obvio que muchas veces vas a perder por culpa de tu equipo, es normal, es lo que pasa cuando dependes de 4 personas que no conoces de absolutamente nada, y el problema es que esa gente, que termina 0/25 y dicen \"es un juego\", no se ponen en los zapatos de: \"es un juego?, es MI juego, es MI partida, es NUESTRA partida, no me importa que sea un juego, quiero disfrutarlo y darlo todo, y me estas poniendo cadenas en las piernas para que no pueda ni arrastrarme a la victoria\". :/... algo asi? xd","replies":[{"poster":"skysoul fenrir","date":"2016-09-02T02:10:47.168+0000","up_votes":2,"down_votes":0,"body":"exacto, no pude haberlo expresado mejor","replies":[{"poster":"TSW Rorschach","date":"2016-09-02T05:51:32.314+0000","up_votes":1,"down_votes":0,"body":"Bueno, en esos casos creo que discutirlo entre todos -pacíficamente con amor, galletitas, drogas y heavy metal- lo antes posible es lo mejor antes de que la partida se vaya a la mierda recomendando lo que podría hacer para ayudarlos de forma que no se perjudique como pushear otras lineas con alguien o no ir solo lejos cuando no hay ni un solo enemigo visible. Ayuda bastante en sí comunicarse para hacer estrategias y evitar repetir errores que les está costando la partida, en serio, muchas partidas las dimos vuelta todos juntos haciendo eso (aguante campear los 5 en el arbusto esperando al tarado que siempre pushea solo :v). Ya en caso de que no les importe una mierda trabajar en equipo (porque más que \"Es un juego\" es un \"Me vale mierdas el juego y mi equipo, total es divertido no seguir la idea de la partida y hacer lo que se me cante aunque los perjudique y me lo hayan dicho\") y se ponga a hacer Barón solo cuando tenés la base hecha mierda y recién los enemigos se hicieron el Dragón Ancestra. Es diferente a lo que parecías referirte en un inicio xD Pero bueno, ya entiendo el punto.","replies":[]}]}]}]},{"poster":"shinji icardi","date":"2016-09-03T13:41:13.345+0000","up_votes":1,"down_votes":0,"body":"Estoy de acuerdo en que las partidas normales son para practicar y probar cosas. Pero qué pasa con esa gente que pickea los mains y te tryhardean todo? Un ejemplo, en este servidor esta cagado en mains Yasuo, Lee Sin, Vayne, de esos se ven en TODAS las partidas normales al menos uno (ya sea en tu team o en el contrario) con maestría 6 o 7. Yo quiero practicar Vayne supongamos, y en contra me toca una Vayne maestría 7 con 500k, es necesario que te humillen sacando la maestría y tryhardeando todo el game? Así no se puede jugar ni normal. En conclusión, no entiendo la necesidad de las personas de sacar sus mains en normal y hacer quedar mal a uno que practica con x campeón.","replies":[{"poster":"TSW Rorschach","date":"2016-09-03T16:05:55.634+0000","up_votes":1,"down_votes":0,"body":"Es que buscan la primera victoria del día si o si(?\n\nYa no solo en normales pasa eso :v ayer jugué Asedio al nexo y parecía ranked, todos marco de plata o oro maestrías 6-7 tanto enemigos como aliados, fui el único gil que se pickeó un personaje para divertirse y efectivamente, me partieron el traste :v encima mi Morgana se puso a flamear feo en el /all a mi Illaoi porque no pusheaba mid. Y de aram ni hablemos, te flamean por morir :v en aram.\n\nSi la cosa sigue asi creo que voy a jugar personalizadas el resto de mi vida xD al menos ahi sabes que no te va a tocar un maestría 6-7 que te la spamee todo el juego(?","replies":[{"poster":"shinji icardi","date":"2016-09-04T16:09:15.127+0000","up_votes":1,"down_votes":0,"body":"Same :'v pero qué casualidad que en todas y cada una de las partidas q juego me toca siempre el que quiere ganar la primera victoria del día -.-","replies":[]}]}]}]},{"poster":"Quo","date":"2016-09-01T22:30:39.872+0000","up_votes":4,"down_votes":1,"body":"Te sere sincero, yo cuando empece a jugar al lol, mi mentalidad era del 100% ganar, lo que me llevo a ser un toxico asqueroso, negativo y pesimista, yo mismo me di cuenta de esto  y me sentia mal, criticaba a todos y nunca me criticaba a mi, pensaba que yo hacia todo bien y los demas estaban mal, ¿y todo por que? porque queria ganar siempre, y claro, eso es algo que no se puede [a menos que seas immortals en su primer sprint] poco a poco deje de disfrutar el juego y a sentir asco por el, ¿que hice? adquiri la mentalidad como la que tu dices, claramente me gusta aprender de mis errores, tratar de ser mejor y jugar bien, pero si voy 0/5 no le doy importancia, lo tomo como un juego, un hobby, algo en lo que quiero divertirme antes que ganar y para eso no tengo que centrarme en la victoria.\nMucha gente se toma el elo como si su vida dependiese de ello y se olvida de todo lo demas, hay algo que aprendi viendo a streamers de ligas altas, [master para arriba] y es, que si eres bueno, no importa si ganas o pierdes, con el tiempo terminaras donde debes estar.","replies":[{"poster":"skysoul fenrir","date":"2016-09-01T23:05:22.015+0000","up_votes":4,"down_votes":0,"body":"lo que me refiero es que hay gente que se toma demasiado a la ligera el juego y esta bien, pero cuando va fedeando al team enemigo le arruina la experiencia de juego a sus copañeros, esta bien que no te importe perder pero no por ello quiere decir que a tus compañeros no les importe, hay gente que no dice nada, otra que te flamea pero la verdad es que perder no se siente bien y eso es algo que no toda la gente lo ve así y te arruina la diversion","replies":[{"poster":"Dr Lukas","date":"2016-09-01T23:44:46.797+0000","up_votes":2,"down_votes":2,"body":"Para que existan ganadores tienen que haber perdedores.","replies":[{"poster":"1Nimeryos","date":"2016-09-02T12:40:30.139+0000","up_votes":2,"down_votes":0,"body":"Una cosa es perder una \"buena partida\" y otra es perder porque un cristiano no sabe jugar bajo torre, pasivo o solo farmear. E ahí la diferencia.","replies":[]},{"poster":"Anti Magic","date":"2016-09-01T23:46:16.659+0000","up_votes":2,"down_votes":1,"body":"Si","replies":[]}]}]}]},{"poster":"Bot Oro","date":"2016-09-01T23:17:10.243+0000","up_votes":2,"down_votes":1,"body":"yo solo juego para divertirme :C","replies":[{"poster":"Anti Magic","date":"2016-09-01T23:18:48.924+0000","up_votes":1,"down_votes":0,"body":"yo para divertirme en las normales y siendo que voy cosas medias raras en normal para divertirme tengo buenos scores :v","replies":[{"poster":"Bot Oro","date":"2016-09-01T23:19:35.141+0000","up_votes":2,"down_votes":0,"body":"yo en normales y en rankeds :s\nPD:pero no trolleo","replies":[{"poster":"Anti Magic","date":"2016-09-01T23:20:59.419+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Bot Oro","date":"2016-09-01T23:22:52.885+0000","up_votes":2,"down_votes":0,"body":"jajaja yo recuerdo que en mi ultima ranked ocupe a urgot full critico y termine 12/5 solo recuerdo que ese dia me rei mucho","replies":[{"poster":"AutistaKun","date":"2016-09-02T05:02:05.514+0000","up_votes":1,"down_votes":0,"body":"\"PD:pero no troleo\"\nA vos te parece que ir urgot Full critico no es trolear?\n","replies":[{"poster":"Bot Oro","date":"2016-09-02T15:57:54.444+0000","up_votes":1,"down_votes":0,"body":"yap y por que crees que urgot critico es troll? mientras no me mate cada 20 segs no creo que eso fuera trollear","replies":[{"poster":"AutistaKun","date":"2016-09-02T19:48:05.543+0000","up_votes":2,"down_votes":0,"body":"Yo te reportaba de una,basicamente porque reducis mis posibilidades de ganar en gran medida yendo con una build troll o completamente anti meta ,por algo a los campeones se  los lleva de cierta forma y no de la forma que a uno se le cante,en normales esta todo bien,en rankeds no","replies":[{"poster":"Bot Oro","date":"2016-09-02T23:44:50.963+0000","up_votes":1,"down_votes":0,"body":"Urgor adc rinde y ademas no es reportable ir con una build anti meta","replies":[]}]}]}]},{"poster":"Anti Magic","date":"2016-09-01T23:25:35.084+0000","up_votes":1,"down_votes":0,"body":"jaajjajaj yo ahora fui zac full ap en normal no me fedie pero salí con score positivo solo que me había tocado enrecien una persona que solo hace ks y me insulta que soy platino carriado, siendo que el tiene no se cuantos puntos de maestría y sigue pegado en plata 5 xd","replies":[]}]}]},{"poster":"Anti Magic","date":"2016-09-01T23:23:30.318+0000","up_votes":1,"down_votes":0,"body":"yo tampoco, juego enserio aveces cuando pierdo artas me enojo pero ya me enojo menos donde salen tipos malos aveces te empiezas a acostumbrar y no te enojas xd","replies":[{"poster":"Bot Oro","date":"2016-09-01T23:25:10.748+0000","up_votes":2,"down_votes":0,"body":"yo solo me enojo cuando me da lag eso es del infierno we","replies":[]}]}]}]}]},{"poster":"rokushoger","date":"2016-09-02T11:49:42.632+0000","up_votes":2,"down_votes":0,"body":"Hablan de divertirse y de ganar como si fueran cosas opuestas, y no lo son.\nYo SIEMPRE juego para divertirme, lo que no significa que no quiera ganar cuando juego, pero si de última tuve tremenda partida que duró 2 hs (si me ha pasado), todos en buena onda y la perdí no importa! Eso no quiere decir que no quiera ganarla, pero me divertí igual que era mi finalidad.\nMuchos confunden también divertirse con trolear, cosa que no es así, o antimeta con troleo, cosa que tampoco es así. Me han flameado muchísimo por usar a phant de support, hasta que les cierro el traste con un 2/0/45 y un ADC que parece rambo con 5 redbull encima, y si, me divertí haciendolo, y me divertí ganando.","replies":[]},{"poster":"SATIV","date":"2016-09-02T00:18:57.969+0000","up_votes":3,"down_votes":2,"body":"Hasta en el mas minimo aspecto de la vida ser un ganador, si estan regalando caramelos me llevo la canasta llena, si una viejita quiere el ultimo asiento en el bondi le meto un tackle y me siento YO en MI asiento,si una embarazada necesita el asensor QUE SE CAGUE, nadie la mando a abrir las piernas, deje de hablarme con varias personas por perder. Asi vivo yo y soy feliz y quien no lo veo como un fracasado que nunca va a progresar en la vida.","replies":[{"poster":"TSW Rorschach","date":"2016-09-02T06:01:41.280+0000","up_votes":1,"down_votes":0,"body":"Yo solo me limito a ser feliz cuando duermo, pero bueno, cada uno con sus gustos dicen :v","replies":[]},{"poster":"EdxxEdxx","date":"2016-09-02T01:09:49.323+0000","up_votes":1,"down_votes":0,"body":"mmmm estoy en una duda existencial, te doy +1 porque yo tiraria a la vieja por la ventana, o te dejo asi como estas porque me da flojera... mmm... si, yo tambien me llevaria la canasta llena, de hecho, antes de que regalen caramelos, me infiltro y los robo todos :D okno.","replies":[]},{"poster":"JANC","date":"2016-09-02T01:54:59.746+0000","up_votes":2,"down_votes":3,"body":"Si haces eso quedas como un fastidioso irritante, no puedes ser tan poco empatico, no por no querer ser ganador soy un fracasado, solo pienso que si gano es porque se lo merecia, si es un partido de futbol y pierdo, le doy la mano al capitan y digo \"buen partido, bien jugado\", si soy competitivo pienso que pierdo el tiempo","replies":[]}]},{"poster":"TapateLasPatitas","date":"2016-09-02T21:01:35.720+0000","up_votes":1,"down_votes":0,"body":"Prefiero a un manco jugando de mi lado por sobre los que te bardean y bardean y bardean y cuando ya termina la partida, te agregan para seguir el bardeo(ya caí dos veces x'D) Puedo perder sin asco ni dramas, juego soporte y la frustración de ver como te insultan por prácticamente existir, es horrible.\nCuras, eres troll, salvas, eres troll, te matan eres troll, no curas, eres troll, y al final basta que uno de todo el team insulte y automaticamente todo el odio recae sobre un jugador, por eso, prefiero a alguien que se divierte.","replies":[{"poster":"Draugt","date":"2016-09-02T23:10:10.535+0000","up_votes":1,"down_votes":0,"body":"que curioso, yo preferiría tener alguien que sabe jugar decentemente (no que sea un pro, pero que si sepa jugar bien) y que sea muy flamer a uno que no sepa jugar, ya que el flameo se arregla con silenciarlo.","replies":[]}]},{"poster":"Salafe","date":"2016-09-02T16:08:40.033+0000","up_votes":1,"down_votes":0,"body":"\"es solo un juego\"\n\nTodos los que van 0/10/0","replies":[]},{"poster":"Glorfindel esdla","date":"2016-09-02T15:42:58.034+0000","up_votes":1,"down_votes":0,"body":"Por lo menos no rankeen e intenten seguir los consejos del equipo y mucho menos FLAMEEN","replies":[]},{"poster":"Hellnen","date":"2016-09-02T15:35:11.447+0000","up_votes":1,"down_votes":0,"body":"La verdad, pienso lo mismo que vos, este juego es muy divertido, pero a la vez muy toxico, para dar un ejemplo recién salí de jugar una partida con k6, en mi team había una ashe que iba algo de 6/9 y no hizo nada en la partida, obviamente me flameo ami por no campear su linea. 10 minutos mas tarde la partida se empezó a dar vuelta a nuestro favor y fue ahí cuando empezó el midlaner nuestro, un Ekko que también era pésimo jugando y me echo la culpa ami, la verdad eso me cambio mi buen humor y me empezó a dar asco, (como en la mayoría de las partidas de este juego), me empezaron a flamear porque no jugaba bien, esto lo otro. Esa gente así es la que arruina todas las partidas con su flameo indiscriminado, aclaro, yo también fui así pero hace mucho tiempo cuando recién empezaba a jugar, ahora que llevo mas de 2k de partidas (oh sigues en bronce con 2k de partidas que manco) me doy cuenta que no hay que flamear porque empeoras el rendimiento del team. Bueno esto no tiene nada que ver con este post pero me chupa un huevo, tenia que decirlo.","replies":[]},{"poster":"Gaspar Noeh","date":"2016-09-02T07:31:15.706+0000","up_votes":1,"down_votes":0,"body":"Grande Men, por fin alguien que se da cuenta que jugar es para divertirse y reirse, no para ganar, Felicitaciones! (justo hoy estuvimos hablando toda la  partida sobre si Braum devia afeitars el vigote, y ganamos igual)","replies":[]},{"poster":"Carpaccio","date":"2016-09-01T22:09:05.740+0000","up_votes":1,"down_votes":0,"body":"La verdad la mentalidad del 90% de las personas es Ganar,ya que es algo natural en el ser humano.\nNo que no es natural es pensar que ganar lo es todo,al menos en Normales,juegas esto para aprender asi que es normal que haya gente que no sepa jugar a un campeon y lo malo empieza cuando los \"Pros\",ante un \"Primera vez con [Inserte Nombre de Campeon Dificil de usar]\" va 0/5,es normal que,con un campeon como por ejemplo {{champion:101}}  vayas algo mal,por que recien aprendes sus mecanicas y aunque en fases de lineas Xerath es \"Facil\" lo dificil es en TF por que serias como otro ADC mantienes siempre las distancias,los \"Pros\" dicen \"Report Mid\" , \"Mid Troll\" y flameo por cualquier error,como si en la primera vez de un campeon va a ir 10/0 Jajaja","replies":[{"poster":"TSW Rorschach","date":"2016-09-02T06:41:57.558+0000","up_votes":1,"down_votes":0,"body":"La verdad. Justo hoy en una partida un Xerath que lo estaba aprendiendo a usar le fue re mal contra un Yasuo porque le costaba muchisimo posicionarse contra él (Y el Yasuo era main). Su team lo re flameaba cuando se veía posta que no lo hacía adrede (o sea, Yasuo se te pone mele con dos items y estas muerto siendo Xerath justo xDD) inclusive el team enemigo se puso a explicarle como se usaba la R de Xerath porque su team ni para eso lo ayudaba. No lo ayudaron ni en el early como para decir \"Tratamos de ayudarte a levantar cabeza toda la partida y ni te pusiste\". O sea, lo dejaron solo en plan \"jodete porque justo te fue mal\" :/","replies":[]},{"poster":"Annie Botz","date":"2016-09-01T22:55:21.956+0000","up_votes":1,"down_votes":0,"body":"Yo casi que no recuerdo que es probar un campeón, para mi antes como a todos no conocía nada del juego, y mientras más jugaba con diversidad era mejor para las partidas a futuro, ahora sé como funcionan la mayoría de campeones pero ya perdí esa sensación de no saber jugar con X campeón, a pesar de que sean nuevos campeones ves champion spotlight y te lo aprendes.","replies":[]}]},{"poster":"Anti Magic","date":"2016-09-01T23:12:03.395+0000","up_votes":1,"down_votes":0,"body":"no se yo me tomaba antes todo encerio las primera rankeds, normales, no quería perder ninguna pero al final soy platino 3 y me quería desestresar, juego una voy zac full ap para divertirme, mi score de hecho no estaba mal y me aparece un tipo que decía incarrebles, etc y flamea todo el rato, me añade molestándome diciendo como eres platino carriado y me empieza a flamiar todo el rato, lo mutie y todo y me pregunto ¿porque gente que se toma este juego tan enserio? yo e perdido antes muchas veces y ahora no me frustro pero los otros solo flamean porque se fedean y se creen siendo que yo no fedie :C","replies":[{"poster":"TSW Rorschach","date":"2016-09-02T06:31:00.546+0000","up_votes":1,"down_votes":0,"body":"Bienvenido a Las amigo mio U_U \n\nRecuerdo que una vez eramos Blitz y Draven contra Blitz y Draven en la bot lane y estaba terriblemente emparejados -mismo farm, mismos ganchos, misma vida, era el re reto eso-\nLa cosa es que le pediamos ayuda al Trundle jg para hacer una diferencia porque eso no iba ni para atrás ni para adelante y el tipo dijo que iba a ir. Tratamos de aguantar como 7 minutos y no vino, pero claro, el jg enemigo como que sí vino a hacer la diferencia. Me suicidé salvando a mi adc agarrando con el gancho al Lee sin así podía escapar y cuando muero (primera kill que encima se lleva Blitzcrank) el Trundle pone \"Report bot, que feeders de mierda. Aviso que ahora los mutié\" cuando ni habíamos dicho nada .-.\nPerdimos la partida porque en 30 minutos no fue a ninguna línea, ni al pobre Vel'koz que desde la primera vez que se murió dijo que no podía contra Zed y tuve que ir yo para hacer algo. Mi Draven se re flameó con el jg y después de robar los bichos se quedó afk, el Garen también se re enojó y se quedó en el spawn plantando wards y el Trundle se fue también al spawn y lo único que hacía era tirar el surrender que nadie le aceptaba.\nEramos Vel'koz y yo poniéndonos con todo pero un un 2 vs 5 es imposible lo veas donde lo veas.\nY si, al final Trundle puso \"Report team\".","replies":[]}]},{"poster":"AutistaKun","date":"2016-09-02T05:10:49.581+0000","up_votes":1,"down_votes":0,"body":"Por mi jueguen lo que quieran en normales,pero en Ranked es otra cosa,la mayoria de las personas que entramos ahi queremos ganar,y nos importa los puntos que obtenemos o perdemos,si el punto es divertirse solamente pueden jugar normales,en las rankeds se juega por el LP ademas que por la diversion","replies":[]},{"poster":"Suní","date":"2016-09-02T00:44:14.843+0000","up_votes":1,"down_votes":4,"body":"Yo juego divertirme casi siempre juego ahri adc o cosas así\n\nPocas veces he jugado serio me han flameado mucho\n\nPero te acostumbras de todos modos es un juego tienen que divertirse\n\nSi ellos quieren jugar serio que vayan a ranked y que no jueguen normales\n\nAunque en cualquier momento todos pueden divertirse con amigos o sin amigos\n\nSaludos ^^","replies":[{"poster":"skysoul fenrir","date":"2016-09-02T02:16:11.112+0000","up_votes":2,"down_votes":0,"body":"primero que nada, sobre que vayas ahri adc y cosas asi, no se si lo haces con intenciones de intentarlo de verdad y tratar de llevar una partida favorable para ti o si lo haces para molestar a tus compañeros.\nSegundo, tienes que pensar que las ranked son cosa muy distinta a las normales, la competividad esta implementada ahi, si entras es por que quieres ganar, eso se sabe, pero tambien el nivel de los jugadores cambia, hay personas que pueden estar en mala racha y solo quiere cortar esa racha en una normal pero aun asi sus compañeros no se lo permiten y al final se terminan frustrando por que los jugadores no saben ponerse en el lugar de los demas.\nEl querer ganar es algo natural en todos y es por la simple razon de que perder no es agradable para nadie, por mas divertido que haya sido la partida, si la pierdes te deja un sabor agridulce, o me equivoco?","replies":[{"poster":"Suní","date":"2016-09-02T02:18:21.266+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=skylightwolf777,realm=LAS,application-id=v7qsfXsE,discussion-id=aHEJ3Baz,comment-id=00070000,timestamp=2016-09-02T02:16:11.112+0000)\n>\n> primero que nada, sobre que vayas ahri adc y cosas asi, no se si lo haces con intenciones de intentarlo de verdad y tratar de llevar una partida favorable para ti o si lo haces para molestar a tus compañeros.\n> Segundo, tienes que pensar que las ranked son cosa muy distinta a las normales, la competividad esta implementada ahi, si entras es por que quieres ganar, eso se sabe, pero tambien el nivel de los jugadores cambia, hay personas que pueden estar en mala racha y solo quiere cortar esa racha en una normal pero aun asi sus compañeros no se lo permiten y al final se terminan frustrando por que los jugadores no saben ponerse en el lugar de los demas.\n> El querer ganar es algo natural en todos y es por la simple razon de que perder no es agradable para nadie, por mas divertido que haya sido la partida, si la pierdes te deja un sabor agridulce, o me equivoco?\n\nLo de ahri adc lo hago para divertirme casi siempre con premades pero cuando lo hago sola\n\naveces se enojan pero casi nunca se enojan, normalmente gano raras veces pierdo con ahri adc\n\nPero casi siempre la uso mid incluso le pregunto a mis compañeros si la puedo usar casi siempre me dicen que no tienen problema\n\nPorque es una normal y que no hay que enojarse en partidas asi","replies":[{"poster":"4R13L999","date":"2016-09-02T04:18:45.213+0000","up_votes":1,"down_votes":0,"body":"jeje en eso de las normales y ranked nwn tienes razon","replies":[]}]}]}]},{"poster":"Ode to dark","date":"2016-09-02T02:53:30.079+0000","up_votes":1,"down_votes":0,"body":"A mí me parece super, pero no tener esa actitud en ranked...","replies":[]},{"poster":"Shichi","date":"2016-09-02T00:03:56.434+0000","up_votes":1,"down_votes":0,"body":"Me lo tomo como un juego trato de jugar bien pero si me va como la mierd* aveces que le voy a hacer no?","replies":[]}]}