{"poster":"skysoul fenrir","date":"2016-07-15T05:29:38.995+0000","title":"Yo debería estar en una partida ahora","subforum":"Problemas Técnicos","up_votes":1,"down_votes":2,"body":"si, asi es, como ven, y de seguro los rioters lo primero que van a hacer es meterme de nuevo en cola y por que digo de nuevo? por que esta es la partida contigua a las 5 partidas (las cuales jugue de seguido en este momento) que me metio el leaver buster por &quot;abandonar&quot; una partida (lo cierto es que no solo el ping subio a niveles insanos sino los FPS bajaron a practicamente a FPS 1  de la nada cuando todo el dia jugue con FPS&#039;s normales, pero eso es arena de otro costal) lo que me paso a mi no es la primera vez que me ocurre, me pasaron varias veces antes pero esta vez ya es el colmo, ya me harte, la primera vez consulte al soporte y me respondieron que &quot;era un problema del antivirus&quot; y no me dieron mas que una pagina para descargar avast en mi pc y eso fue toda su ayuda, alegando que sino ya era problema de mi conexi&oacute;n a internet sin siquiera (al parecer) haber leido toda mi peticion, cuando la verdad es que es un error del juego que no me pasa a mi sino a demas personas las cuales el sistema castiga injustamente, quiero que se haga algo, no quiero un antivirus, no quiero que me den sermones de que mi conexion es una aberracion (por que no lo es), quiero que se haga algo, puedo soportar bajones de fps, que el ping suba a mas de 10.000, puedo soportar a los flamers, afk y troll pero ue ya ni siquiera me deje meterme a una partida Y QUE ADEMAS  me sancionen por eso? eso ya no","replies":[{"poster":"TeemoTankeTiamat","date":"2016-07-15T05:38:26.624+0000","up_votes":1,"down_votes":0,"body":"los FPS son culpa de tu computadora y lo del ping puede ser tu proveedor de Internet ya que yo jugando hasta recién no tuve ni un solo problema de lag.","replies":[{"poster":"skysoul fenrir","date":"2016-07-15T05:52:48.725+0000","up_votes":1,"down_votes":1,"body":"repito, eso es arena de otro costal que no se aplican en este caso","replies":[{"poster":"TeemoTankeTiamat","date":"2016-07-15T05:54:40.483+0000","up_votes":1,"down_votes":0,"body":"me estas diciendo que te da leave booster aunque no te desconectes?","replies":[{"poster":"skysoul fenrir","date":"2016-07-18T23:30:10.879+0000","up_votes":1,"down_votes":0,"body":"me refiero a que me da leaver buster cuando el propio juego no me deja conectar por un problema del mismo","replies":[]}]}]}]},{"poster":"Help Support","date":"2016-07-15T05:39:55.823+0000","up_votes":1,"down_votes":0,"body":"A mi me pateo en 7 partidas y nunca me sancionó y eso que tardó 10 minutos o más en conectarme nuevamente salir entrar que se cuelgue salir volver a entrar colgándose en iniciando sesión volver a cerrar asta que entra como 7 o más veces me pasó eso ayer. Y 0 sancion","replies":[]}]}