{"poster":"skysoul fenrir","date":"2016-09-22T03:47:21.509+0000","title":"yasuo 100% critico con 2 items? Pls eso ya se ha visto antes","subforum":"Charlas Generales","up_votes":3,"down_votes":15,"body":"{{champion:23}} eso se lo copiaron al pobre tryndamere :^( ... ( ͡&deg; ͜ʖ ͡&deg;)","replies":[{"poster":"Ðeceiver","date":"2016-09-22T13:45:55.931+0000","up_votes":2,"down_votes":0,"body":"Pero es diferente , Yasuo tiene una pasiva que multiplica por 2 sus críticos en cambio Trynda tiene que cargar su pasiva.","replies":[]},{"poster":"9081913DEL1","date":"2016-09-22T10:35:09.507+0000","up_votes":2,"down_votes":0,"body":"Da igual, 2 hits de trynda goodbye yasuo XD.\n\nSaludos.","replies":[{"poster":"ReyTimati","date":"2016-09-23T02:22:49.229+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-jinx-unamused}}","replies":[]}]},{"poster":"Guiso al disco","date":"2016-09-22T06:04:14.626+0000","up_votes":1,"down_votes":3,"body":"yasuo es una absurda,ridicula y mal hecha copia del señor y amo de rito, trynda. siempre lo dije,siempre lo dire","replies":[{"poster":"KanServero","date":"2016-09-22T14:36:04.672+0000","up_votes":2,"down_votes":0,"body":"Prefiero a los yasuo que a los trynda","replies":[]},{"poster":"Pascut","date":"2016-09-23T11:41:03.220+0000","up_votes":1,"down_votes":0,"body":"Solo porque tengan criticos no significa que sea un copia, con esa lógica xin, fiora y shaco también serían copias porque tienen un critico xD","replies":[{"poster":"skysoul fenrir","date":"2016-09-23T12:29:30.017+0000","up_votes":1,"down_votes":1,"body":"de hecho, xin, shaco y fiora no tienen critico :v solo aseguran que sus golpeas sean criticos de manera pasiva, trynda y yasuo meten criticos de manera natural, es decir, en base al porcentaje que le otorgan los items (y la pasiva de trynda en caso de este)","replies":[{"poster":"Guiso al disco","date":"2016-09-24T02:37:52.188+0000","up_votes":1,"down_votes":0,"body":"↑","replies":[]}]},{"poster":"Natchin","date":"2016-09-23T13:07:09.300+0000","up_votes":1,"down_votes":1,"body":"todos son copias de yi","replies":[]}]}]},{"poster":"rokushoger","date":"2016-09-22T11:05:09.761+0000","up_votes":1,"down_votes":0,"body":"Siempre me soprende la capacidad de la gente de comparar papas con cebollas XD","replies":[{"poster":"skysoul fenrir","date":"2016-09-22T21:35:27.928+0000","up_votes":2,"down_votes":3,"body":"me sorprende que una persona defienda a yasuo :v","replies":[{"poster":"rokushoger","date":"2016-09-23T11:01:19.341+0000","up_votes":1,"down_votes":0,"body":"Me gustaría que cites en que parte crees tu que yo estoy \"defendiendo\" a yasuo (de hecho no lo acusaste de nada así que no se puede defender nada).","replies":[{"poster":"skysoul fenrir","date":"2016-09-23T12:31:06.698+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=skylightwolf777,realm=LAS,application-id=v7qsfXsE,discussion-id=MXJYmsOt,comment-id=00030000,timestamp=2016-09-22T21:35:27.928+0000)\n>\n> me sorprende que una persona defienda a yasuo \n\nahi tienes :v","replies":[{"poster":"rokushoger","date":"2016-09-23T13:14:14.187+0000","up_votes":1,"down_votes":0,"body":"Eso lo dijiste vos no yo XD, un poco de comprensión lectora te vendría de perlas. Lo que te pedí es que cites la parte donde YO estoy defendiendo a Yasuo.\nLo único que yo dije en forma de metáfora, es que estás comparando dos heroes que pelean distinto, funcionan distinto, y tienen distintos objetivos en una pelea de equipos. No son comparables. No dije que yasuo esté o no roto, ni dije que fuera o no op, ni dije en general nada de yasuo.","replies":[{"poster":"skysoul fenrir","date":"2016-09-23T13:40:45.119+0000","up_votes":1,"down_votes":0,"body":"me parece que te conviene tanto escribir mas claro como jugar mas al lol por que para empezar, se les dice campeones no heroes fanboy del overwatch (okno).\nY si son comparables por que ambos son luchadores que giran en torno al critico, a deletear gente y tienen pasivas que les hacen ganar mas critico de lo que  acostumbran los personajes habituales del lol con solo 2 items :J","replies":[{"poster":"rokushoger","date":"2016-09-23T14:50:11.623+0000","up_votes":1,"down_votes":0,"body":"No es por overwatch, es por dota, antes de venir a jugar lol, jugaba dota (el 1, hace como 6 años, luego ya me cambié), pero igual de vez en cuando se me escapa un \"heroe\" o \"creep\".\n\nAdemás escribo perfectamente claro, si tu no entendés lo que el otro escribe no lo acuses de no escribir claro, máxime cuando hasta te confundís y te citas vos mismo intentado citarme a mí XD.\n\nPor último, creo que también deberías aprender más de League of Legends, porque tryndramere no es un campeón para \"deletear gente\" (por más que no se le de mal), sino para splitpushear lineas y duelear (que no es lo mismo que deletear), al contrario de yasuo que está hecho para peleas de equipo, más cortas y con más daño concentrado, y donde busca mostrar diferencia bajando rivales y no torres. Es más, ni siquiera en la forma de obtener crítico se parecen, porque trynda tiene que \"cargarlo\" a golpes, mientras que yasuo solo lo tiene y ya.\n\nPara ejemplificarte lo que te digo, decir esto:\n\n> tienen pasivas que les hacen ganar mas critico de lo que acostumbran los personajes habituales del lol con solo 2 items\n\nes equivalente a decir que las manzanas y las naranjas son iguales porque ambas son ligeramente redondas XD.","replies":[{"poster":"skysoul fenrir","date":"2016-09-23T21:37:50.818+0000","up_votes":1,"down_votes":0,"body":"de hecho, la funcion de splitpushear s la dieron los propios jugadores cuando jugaban con el aprovechando esa supervivencia anormal que posee para la linea :) yasuo puede hacer lo mismo si se le juega de la misma manera, de igual forma, tryndamere puede entrar a una pelea de equipo y matar al adc y bajar a todo lo que tenga al alcance y pese a que la forma de obtener critico no es igual, las pasivas estan relacionadas con el critico asi que de nada te sirve decirme que uno dobla el critico y el otro lo obtiene de manera pasiva por que al fin y al cabo ambos terminan teniendo mas critico de lo que cualquier campeon obtiene por medios normales y por si no lo notaste, tanto tryndamere como yasuo son duelistas y a pesar de que digas que yasuo explota gente, no es asi, por que su daño esta centrado en el dps, no en el burst, aunque te pese, todo lo que escribiste fue para nada :v","replies":[{"poster":"rokushoger","date":"2016-09-24T20:24:48.429+0000","up_votes":1,"down_votes":0,"body":">  la funcion de splitpushear s la dieron los propios jugadores\n\nExacto, porque rinde más de esa manera. Por más que sea otorgada por los jugadores no vale menos que la función propia que le dio Riot, que hoy día se le complica en lograr, y que es la que tu quieres reinvindicar.\n\n> yasuo puede hacer lo mismo si se le juega de la misma manera\n\nYasuo no le puede pegar a las torres con la Q. Yasuo no tiene un escape si no hay minions. Yasuo no tiene tanta supervivencia como da la R de trynda. Yasuo no puede curarse. Yasuo puede hacer lo mismo pero no tan bien como trynda.\n\n> las pasivas estan relacionadas con el critico\n\nLas naranjas y las pelotas también son ambas redondas, eso no las hace iguales.\n\n> ambos terminan teniendo mas critico de lo que cualquier campeon obtiene por medios normales\n\nPero lo obtienen de distinta manera, con otros requisitos uno de otro.\n\n> su daño esta centrado en el dps, no en el burst\n\nDije que tiene daño más concentrado que trynda, no que yasuo sea de burst, en serio entendés español? Yasuo tiene una llegada mucho más fácil hasta el adc que lo que tiene trynda, y puede matarlo tan rápido como trynda o más incluso, eso es lo que digo. Trynda si usa su E de gap closer puede quedarse corto, con yasuo y su E eso no pasa nunca en la vida, salvo que seas muy mal yasuo.\n\nTe vuelvo a repetir, son campeones con funciones diferentes, que ganan crítico de distinta forma, que se orientan a cumplir distintos objetivos, y compararlos es simplemente inservible. \n\nPara la próxima, cuando quieras responderme un argumento, asegurate de entender lo que leíste.","replies":[{"poster":"skysoul fenrir","date":"2016-09-24T20:49:44.686+0000","up_votes":1,"down_votes":0,"body":"y yo te pregunto, en que momento dije que las pasivas eran iguales?, deja de romper las pelotas con eso hermano, lo que dije no es incorrecto, lo sabes, estas empezando a ser irritante, nunca compare a los  campeones, no se de donde sacaste eso, el punto del post era mostrar que trynda y yasuo llegan al 100% de critico con 2 items pero llegas tu, pones palabras en mi boca solo para molestar y al parecer hacerme quedar mal cuando solo estas discutiendo por un sinsentido que tu mismo empezaste, deja de molestar y ve a molestar a otro foro con argumentos estupidos que solo tu consideras correctos :)","replies":[{"poster":"rokushoger","date":"2016-09-25T14:09:25.918+0000","up_votes":1,"down_votes":0,"body":"Dijiste: \n\n> eso se lo copiaron al pobre tryndamere\n\nDecir que es una copia equivale a decir que es muy similar o igual. \n\nSegún la RAE:\n\nDel lat. copia 'abundancia'.\n\n1. f. Acción de copiar. La copia de obras de arte está legislada.\n\n2. f. Muchedumbre o abundancia de algo.\n\n3. f. Reproducción literal de un escrito o de una partitura.\n\n4. f. En los tratados de sintaxis, lista de nombres y verbos, con los casos que rigen.\n\n5. f. Obra de arte que reproduce fielmente un original.\n\n6. f. Reproducción exacta de un objeto por medios mecánicos. La copia de una llave.\n\n7. f. Imitación de una obra ajena, con la pretensión de que parezca original.\n\n8. f. Persona que se parece mucho a otra. Pedro es una copia de su padre.\n\n9. f. Cada uno de los ejemplares que resultan de reproducir una fotografía, una película, una cinta magnética, un programa informático, etc.\n\n10. f. desus. Pintura o efigie que representa a alguien.\n\ncopia intermedia\n\n1. f. Cinem. Prueba positiva de una película en celuloide de grano fino, para obtener de ella pruebas negativas, con las cuales se obtienen las copias para la exhibición.\n\ncopia simple\n\n1. f. Der. copia de una escritura o documento público, cuya exactitud no está certificada por el funcionario competente para ello.\n\nFuente: http://dle.rae.es/?id=AknZiIz\n\nTe molesta que alguien te diga algo que va contra tu forma de pensar? Entonces no publiques en un foro público XD. Por cierto, yo me estoy divirtiendo bastante contestandote, que lástima que vos te enojes XD.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"ReyTimati","date":"2016-09-22T09:12:50.422+0000","up_votes":1,"down_votes":0,"body":"{{champion:23}}  siempre sera ejecutado por {{champion:157}}  y lo sabes","replies":[{"poster":"skysoul fenrir","date":"2016-09-22T21:36:06.254+0000","up_votes":1,"down_votes":0,"body":"al contrario, trynda se come a yasuo con papas","replies":[{"poster":"ReyTimati","date":"2016-09-23T02:21:38.746+0000","up_votes":1,"down_votes":0,"body":"anda vos seguí jugando a tu {{champion:5}} nomas.","replies":[{"poster":"skysoul fenrir","date":"2016-09-23T03:04:18.877+0000","up_votes":1,"down_votes":0,"body":"heri tus sentimientos de main yasuo por decirte algo que esta en las estadisticas del juego?","replies":[{"poster":"ReyTimati","date":"2016-09-23T12:43:33.593+0000","up_votes":1,"down_votes":0,"body":"no sabes cuanto {{champion:32}}","replies":[{"poster":"skysoul fenrir","date":"2016-09-23T13:05:25.451+0000","up_votes":1,"down_votes":0,"body":":C","replies":[]}]}]}]}]}]}]}