{"poster":"TEF PlaGue","date":"2015-05-25T17:48:06.311+0000","title":"Suchen Supporter für 5on5 Ranked","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey,\nwir suchen noch ein aktives Member als Supporter in unserem Rankedteam.\n\nZu den Voraussetzungen :\n\nihr solltet\n\n mindestens 18 Jahre alt sein\nkeine Flamer oder Rager sein\n&uuml;ber TS verf&uuml;gen\nein gutes Headset haben\neure Rolle (Support) mainen\n\n\nWir sind alle im Alter von 18 - 26 Jahren, zocken recht oft und wollten diese Season noch etwas in diesem Rankedteam erreichen. Wir sind Silber4-Gold3 von der Elo her.\n\nWenn Interesse besteht, added mich einfach inGame (TEF PlaGue), dann kann man alles weitere besprechen.\n\nLg  TEF Plague","replies":[{"poster":"Acalus","date":"2015-05-26T10:03:08.650+0000","up_votes":1,"down_votes":0,"body":"Servus,\n\nMain Support von Anfang an hier! Hab in Season 3 angefangen und arbeite mich grade nach einer halbjährigen Pause wieder rein ins geschehen. Die Anforderungen erfülle ich alle, bin 28 Main Support, verfüge über TS Headset und so weiter.\nIch kann mit so gut wie jedem Support Champ umgehen und verfüge auch über ungewöhnliche Picks.\nZu meinen Mains Zähle ich Thresh, Leona, Lulu und Morgana.\nHatte mich zu Ende Season 4 im Goldbereich bewegt wurde allerdings aufgrund einer Zwangspause (Kein Internet) Demoted nach Silber.\n\nFalls also Interesse besteht einfach adden, bin während der Woche meistens ab 17 Uhr erreichbar.\n\nLG Acalus","replies":[]},{"poster":"FlankDieAlteWeg","date":"2015-05-26T00:05:55.322+0000","up_votes":1,"down_votes":0,"body":"Also zu mir:\n+Bin 18 \n+habe Teamspeak /Skype\n+habe regelmäßig Zeit \n+bin Blitzcrank Main, sonst Morgana oder Leona ( mit mehr Übung Thresh)\n+spiele seit 2 Jahren LoL\n-habe nur ein mäßiges Headset\n-noch NIE in einem dauerhaften Rankedteam gespielt\n\nRagen kann ich nicht ab genauso wenig wenn jemand AFK geht weil das Spiel mal nicht rund läuft.\nFalls ich euren Anforderungen gerecht werde würde ich mich über eine Probespiel freuen.\n\nMfG \n\nPs: Hoffe der Name stört nicht xD\n\nName ist Ingame gleich","replies":[]}]}