{"poster":"Kreyyx","date":"2017-07-02T14:51:58.836+0000","title":"PERMA GEBANNT","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":8,"body":"Hallo LoL Community.\r\n\r\nAls ich micht heute vor genau 1 Stunde einloggen wollte, habe ich eine Meldung erhalten, die ich so noch nie gesehen habe. Und zwar wurde ich Perma gebannt. Dies kann ich total nicht verstehen. Wie ich aber dann von einem Freund erfahren habe, war jemand auf meinem Account. Da ich laut meinem Freund mit Bard (rank) Und mit Fiora(normal) in 2 GAmes war... Das kann aber nicht sein da ich heute mein Abi hatte... Also hat jemand mein Acc gehackt. \r\n\r\nEr hat zudem auch Spieler geflamt. Ich hatte noch nie eine Ban. Auch keinen ChatBan oder Einschr&auml;nkung, habe mich sozusagen vorbildlich verhalten. Wieso bannen sie jetzt meinen Account obwohl ich nichts daf&uuml;r kann.. Ich kann ja nichts daf&uuml;r das mich jemand hackt.","replies":[{"poster":"ü ö","date":"2017-07-02T15:08:01.455+0000","up_votes":3,"down_votes":7,"body":"Ich finde die Vorgehensweise von Riot bezüglich Permas während gehackt dennoch strange, wenn man zB gehackt wird und der Hacker alle RP ausgibt gibt Riot sie dir ebenfalls wieder sobald du deinen Account hast bzw macht die Käufe rückgängig, aber beim Perma ist dann Schluss? Wieso denn? Weil die Leute dann Hacks faken würden wenn sie einen Perma kriegen? Das wäre 1) ziemlich schwer und 2) sollte Riot in der Lage sein, sowas zu sehen..","replies":[{"poster":"Balmung","date":"2017-07-02T15:16:19.087+0000","up_votes":4,"down_votes":1,"body":"Weil es keine Fälle von Hacking sind.\n\nWer es nicht gebacken bekommt seine Logindaten sicher zu verwahren (oder sie wenigstens NICHT herzugeben, wenn jemand via Link danach fragt...) hat eben auch keinen Anspruch auf Schadensersatz.","replies":[{"poster":"Kreyyx","date":"2017-07-02T15:27:09.213+0000","up_votes":1,"down_votes":4,"body":"Wieso??? ich habe meine Daten nie preisgegeben...\nMein Freund wurde  auch mal gehackt.. Perman Ban und er hat ihn wieder bekommen nach 3 monaten da Riot es endlich mal gecheckt hat das er gehackt wurde","replies":[{"poster":"EasternMountain","date":"2017-07-02T15:38:18.549+0000","up_votes":8,"down_votes":1,"body":"***","replies":[{"poster":"Kreyyx","date":"2017-07-02T15:41:47.966+0000","up_votes":1,"down_votes":3,"body":"Diese 2 Games war ich ja nicht... Den Support habe ich schon angeschrieben... Und ich werde alles versuchen, da ich an diesem Acc hänge. Ich habe nichts preisgegeben!! Was kann ich dagegen tun wenn jemand sich Zugriff auf meinen Acc verschafft hat.","replies":[{"poster":"EasternMountain","date":"2017-07-02T15:48:29.606+0000","up_votes":6,"down_votes":1,"body":"***","replies":[{"poster":"Kreyyx","date":"2017-07-02T15:53:56.791+0000","up_votes":1,"down_votes":2,"body":"Ich weiss ja nicht seit wann der drauf ist?? Jedes mal wenn ich on war war alles in Ordnung","replies":[{"poster":"Balmung","date":"2017-07-02T15:55:29.700+0000","up_votes":3,"down_votes":1,"body":"...und du bemerkst veränderte IP (eventuell RP), LP und deine Matchhistory bei den ganzen Fällen nicht?","replies":[{"poster":"Kreyyx","date":"2017-07-02T15:56:50.785+0000","up_votes":1,"down_votes":2,"body":"Alles was sich bei meinen IP und RP geändert hat, war ich","replies":[{"poster":"Bettnachleger","date":"2017-07-02T15:58:59.735+0000","up_votes":3,"down_votes":1,"body":"Also bist du der \"Hacker\"?\nDenn durch seine Spiele muss sich ja der IP Stand geaendert haben?!","replies":[{"poster":"Kreyyx","date":"2017-07-02T16:01:41.527+0000","up_votes":1,"down_votes":3,"body":"Natürlich hat sich was geändert ich meinte Champs oder so geakuft... ES WAR JEMAND ANDERES. Ich habe meine Daten nicht weitergegeben","replies":[{"poster":"Bettnachleger","date":"2017-07-02T16:09:11.757+0000","up_votes":3,"down_votes":1,"body":"Dir faellt doch nicht erst nach Monaten auf, das jemand anderes auf deinem Account spielt?!\nSchaust du absolut NIE in deine Matchhistory? \nOder kam es NIE zu einem Konflikt? Von wegen, das du aus einem laufenden Match gekickt wurdest,  weil sich der \"Hacker\" einloggte, als du im Spiel warst (er  loggt sich ja an tagen ein, an denen du auch gerade Spielst)?\nIst dir nie aufgefallen, das deine Summonerspells ab und an anders sind als sonst?\nUnd WIESO hat der Hacker nicht dein PW usw. geaendert? Ich meine ... sowas wuerde ich mahen, wuerden ich einen Account hacken. Und ihn nicht mit irgendjemanden teilen?!","replies":[{"poster":"Kreyyx","date":"2017-07-02T16:17:15.637+0000","up_votes":1,"down_votes":1,"body":"Die Spells waren immer wieder normal","replies":[]}]}]}]}]}]}]}]},{"poster":"Balmung","date":"2017-07-02T15:49:45.735+0000","up_votes":3,"down_votes":1,"body":"Da dir offensichtlich nicht bewusst ist, worauf er anspricht: Du wechselst ständig mal Flash für einige Games von D auf F und umgekehrt.\n\nQuelle: https://euw.op.gg/summoner/userName=Kreyyx","replies":[]},{"poster":"Bettnachleger","date":"2017-07-02T15:56:19.747+0000","up_votes":1,"down_votes":0,"body":"Wer hat  denn z.B.das Spiel gespielt:\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3245478109/214179828?tab=overview\n\nOder  das:\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3247289825/214179828?tab=overview\n\nOder das:\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3235939367/214179828?tab=overview\n\nOder  das:\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3247136127/214179828?tab=overview\n\nusw.\n\nDu warst das ja nicht. War das etwa auch ... der \"hacker\"?","replies":[]}]}]},{"poster":"Balmung","date":"2017-07-02T15:46:03.511+0000","up_votes":1,"down_votes":0,"body":"Und du bist sicher, dass ein \"Hacker\" auf deinem Rechner nichts besseres zu suchen hat als die Accountdaten eines Leagueaccounts um diesen danach in den Perma zu spielen?\n\nUnd das gleiche noch mal bei deinem Freund?\n\nEin Lottogewinn wäre glaubwürdiger.","replies":[{"poster":"Kreyyx","date":"2017-07-02T15:49:11.763+0000","up_votes":0,"down_votes":5,"body":"Ich bleibe bei meiner Aussage, wenn du nicht etwas hilfreicher schreiben kannst, lass es =) Ich suche hier Leute die mit eventuell sagen können ob ich eine realistische Chance habe den Acc wieder zu bekommen","replies":[]}]}]},{"poster":"ü ö","date":"2017-07-02T15:58:08.301+0000","up_votes":1,"down_votes":0,"body":"Das speziell bei ihm kein Hacken involviert war hab ich mir schon gedacht, mir gings eher ums generelle, da Riot bei kleineren Problemen bzgl. Hacken sehr gütig ist und alles aufhebt, bis auf Permabans. Natürlich sind wahrscheinlich 95% dieser \"Fälle\" gelogen so wie hier, mir ging es eher um die anderen 5%.","replies":[{"poster":"Balmung","date":"2017-07-02T16:12:16.386+0000","up_votes":1,"down_votes":0,"body":"Mir ist kein einziger Fall eines wirklich gehackten Kontos bekannt. Alles Phishingopfer oder wissentliches Accountsharing. Ergo würde ich die \"restlichen 5% echte Hackingopfer\" eher auf 0.005% schätzen...oder noch geringer.\n\nZudem werden Permabanns wirklich nur in Ausnahmefällen ausgesprochen, sonst hätte die Leaguecommunity auch nicht den informellen Titel der \"most toxic Community ever\".\nDas sie diese dann nicht noch zurücknehmen ist imo nicht verwunderlich.","replies":[{"poster":"eingew","date":"2017-07-02T16:19:17.012+0000","up_votes":1,"down_votes":0,"body":"Doch, gabs auch schon. Ist schon wieder ne Weile her, aber irgendjemand hatte mal ne Lücke bei Riot gefunden, wo er n Bruteforce durchlaufen lassen konnte. Hat damals afaik auch einige Streamer betroffen.\n\nAbgesehen davon ist es jetzt auch nicht sooo unwahrscheinlich, sich nen Keylogger einzufangen... wobei man dafür natürlich auch n bisschen unvorsichtiger sein muss.","replies":[{"poster":"Balmung","date":"2017-07-02T16:28:51.574+0000","up_votes":2,"down_votes":0,"body":"Ich sagte ja - mir nicht bekannt. Das schließt es ja nicht zwingend aus.\n\nAber wie ich geschrieben habe: Die Chance als unbekannte Privatperson wirklich gehackt zu werden geht gegen 0.\n\nUnd Keylogger sind eben...naja, Eigenverschulden. Das kann durch Unwissenheit mal schnell gehen, das stimmt. Allerdings wäre bei einem Keylogger über nennenswerten Zeitraum mein League Account wohl die geringste Sorge.","replies":[{"poster":"eingew","date":"2017-07-02T16:33:42.441+0000","up_votes":2,"down_votes":1,"body":"Oh, wollte dir eigentlich auch gar nicht vorwerfen, dass du behauptet hättest, es gäb sowas gar nicht. War blöd formuliert, sorry :D. Wollte bloß n paar Infos einfließen lassen :D.","replies":[{"poster":"Balmung","date":"2017-07-02T16:38:55.885+0000","up_votes":2,"down_votes":1,"body":"Passt doch alles, wir kennen uns ja schon :P","replies":[]}]},{"poster":"Kreyyx","date":"2017-07-02T16:30:30.127+0000","up_votes":1,"down_votes":0,"body":"Ich lasse gerade alle Virenprogramme drüber laufen =(","replies":[{"poster":"Balmung","date":"2017-07-02T16:36:02.350+0000","up_votes":1,"down_votes":0,"body":"Erst mal von einem sicheren System Dinge wie Paypal und wichtige E-Mailpasswörter etc ändern.\nDanach das infizierte System plattmachen und neu aufsetzen. Alles andere hilft nicht sicher.","replies":[{"poster":"eingew","date":"2017-07-02T16:38:14.273+0000","up_votes":1,"down_votes":0,"body":"Schon, sollte ein Keylogger gefunden werden, wäre es allerdings vielleicht sogar recht nützlich, den Namen zu kennen und einen Screen von der Analyse des Programms zu besitzen.","replies":[]}]}]}]},{"poster":"ü ö","date":"2017-07-02T16:22:22.902+0000","up_votes":1,"down_votes":0,"body":"D.h, wenn man **wirklich** durch einen Hacker einen Perma kriegt und es auch beweisen kann, würde Riot den Ban aufheben?\n\n(Die Umstände bzw Beweise sind mir nicht wichtig, geht mir nur ums theorethische)","replies":[{"poster":"eingew","date":"2017-07-02T16:25:41.632+0000","up_votes":1,"down_votes":0,"body":"Natürlich. Naja, die meisten bemerken ja auch bevor Riot einen regulären Ban für Acc-Sharing vergibt von alleine, dass etwas nicht stimmt und melden sich beim Support. Und dann ist die Sache natürlich klar für Riot und die kümmern sich um die Accountwiederherstellung.\n\nAber generell gilt bei allen Bans: Sofern Riot einen Fehler bemerkt, heben sie die Strafe wieder auf.","replies":[]}]}]},{"poster":"Il Sten lI","date":"2017-07-02T20:59:36.542+0000","up_votes":1,"down_votes":0,"body":"Viele haben gleichen login und summoner-namen. Riot weist nicht darauf hin, dass diese besser unterschiedlich sein sollten. Sollte dann tatsächlich möglich sein, das Passwort per BruteForce zu knacken. Mit gemächlicher Geschwindigkeit sollte dies funktionieren (-selbst schon für nen alt acc über zwanzig mal das pw falsch eingegeben, dann das richtige mit Erfolg...)","replies":[]}]},{"poster":"Kreyyx","date":"2017-07-02T15:59:13.027+0000","up_votes":1,"down_votes":3,"body":"Es ist nicht gelogen =/","replies":[{"poster":"ü ö","date":"2017-07-02T16:05:03.763+0000","up_votes":1,"down_votes":0,"body":"Da du keine Beweise hast, deine Matchhistory ziemlich deutlich aussieht und aufgrund der Tatsache, das solche Threads sogut wie immer gelogen sind wird dir hier keiner glauben.","replies":[]}]}]}]}]},{"poster":"Homunculi","date":"2017-07-02T15:07:07.594+0000","up_votes":3,"down_votes":1,"body":"Hallo,\n\nder Account wird meistens aus Sicherheitsgründen gebannt, wenn der Verdacht auf Accountsharing/-missbrauch besteht. Melde dich beim Support, schildere ihnen die Situation. Bleib am Ball und bleib höflich, die ersten Antworten werden dir wahrscheinlich nicht gefallen.\n\nMach einen Virenscan so tief wie möglich, ändere das Passwort deines Accounts und schalte die E-Mail Verifikation ein.\n\nDir wird jetzt etwas schwerer Weg bevor stehen, da du jetzt beweisen musst das der Account dir gehört.\n\n\nHast du vor kurzem dich auf Seiten eingeloggt die \"Kostenlose RP/Skins\" angeboten haben?","replies":[{"poster":"Kreyyx","date":"2017-07-02T15:28:00.381+0000","up_votes":1,"down_votes":2,"body":"Vielen Dank =) Und nein ich habe nirgendswo draufgeklickt. Ich habe auch niemanden etwas von meinen Daten gegeben.\n\nDenkst du  ich habe eine realistische Chance ihn wieder zubekommen","replies":[{"poster":"eingew","date":"2017-07-02T16:05:44.787+0000","up_votes":1,"down_votes":0,"body":"Wofür ist denn der Ban? Was steht in der Nachricht? Für das Feeding in den zwei Spielen heute morgen?","replies":[{"poster":"Kreyyx","date":"2017-07-02T16:18:56.659+0000","up_votes":1,"down_votes":0,"body":"Für den Flame im Fiora game... Nur für das Game","replies":[{"poster":"eingew","date":"2017-07-02T16:22:26.044+0000","up_votes":1,"down_votes":0,"body":"Oha... kannst du da mal die Logs posten? Sofern du nicht vorher schon recht toxic warst und Strafen erhalten hast muss da ja ziemlich harter Tobak zu finden sein.","replies":[{"poster":"Kreyyx","date":"2017-07-02T16:24:38.822+0000","up_votes":1,"down_votes":0,"body":"Game 1\nKreyyx: FCKING FAGOT\nKreyyx: I HOPE U DIE\nKreyyx: STFP\nKreyyx: I HOPÜE DU DIE\nKreyyx: TAG MUELE\nKreyyx: FCKING NIGGAHS\nKreyyx: AND FRENCH RETARDED BASTARDS**\nKreyyx: DIE FAGGOTS DIE\nKreyyx: DIE FAGGOTS DIE\nKreyyx: FCKIGN NIGGAH\nKreyyx: SALE PUTE\nKreyyx: SALE PUTE\nKreyyx: DE MERE\nKreyyx: FGT\nKreyyx: DARIUS NO FLASH\nKreyyx: THIS FCKING FRENCH BASTARD USED IT CAUSE FLAMING ME\nKreyyx: GET CANCER FUCKTARDS\nKreyyx: FUCK YOU LALL BASTARDS NIGGAHS\nKreyyx: NOOBS l2p\nKreyyx: mumu this fgt is at gromp\nKreyyx: FCKING CANCER PLAYERS L2P\nKreyyx: FKCING CANCER PLAYERS GET FUCKED YOU BASTARDS\nKreyyx: I HOPE U DIE\nKreyyx: FUCKING BASTARDS DIE !!!\nKreyyx: GET CANCER NIGGAH*\nKreyyx: GET CANCER U FUCKING NIGGAH JEW\nKreyyx: I HOPE HITLER CIMES AND KILLS U ALL BASTARDS FGT FGT FGT\nKreyyx: SIEG HEIL VERGAST DIE JUDEN\nKreyyx: TA MUGELE\nKreyyx: FGTS\nKreyyx: FUCKING BASTARDS GET CANCER\nKreyyx: REPORT FUCKING BASTARDS\nKreyyx: fgt\nKreyyx: FGT FGT FGT FGT FGT\nKreyyx: OUTFUCKED\nKreyyx: WP HEIMER MY PREMADE\nKreyyx: GET CANCER U FUCKTARDS FGTS\nKreyyx: free tyler 1 sieg heil\nKreyyx: get cancer\nKreyyx: FUCKYOU ALL GET CANCRER ALL I AM RHYMING LIKE CANCER GOAL\nKreyyx: FGTS\nKreyyx: SOO CLOSE DFR REPORT MY ADC\nKreyyx: YOU FUCKING LUCIAN FGT L2P\nKreyyx: FUCK YOU FGTS L2P\nKreyyx: GET FUCKED RAKAN\nKreyyx: L2p FAGGOTS\nKreyyx: NEVER SURRENDER I WONT FF AT 15 you fgts\nKreyyx: L2P BASTARDS\nKreyyx: SYNDRA WHAT YOU FGT\nKreyyx: SYNDRA FAGGOT L2P\nKreyyx: FFGT DRAVEN DIED NOOB L2P\nKreyyx: 1v9 FAGGOTS 1v9\nKreyyx: l2p faggsz\nKreyyx: REPORT DARIUS CAUSE FAGGOT\nKreyyx: THIS BASTARD\nKreyyx: DARIUS DIDNT MUTE ALL HHAHAHA FAGGOT\nKreyyx: dont report me pls\nKreyyx: FAGGOTS\nKreyyx: I am tryharding fkcing lucian\nKreyyx: reprot lucian for killing inting people\nKreyyx: FUCK OFF CANCERS\nKreyyx: FCKING CANCER DARIUS\nKreyyx: FCKING NIGGAH PLAYERS\nKreyyx: WTF\nKreyyx: ANYONE DIDNT FF\nKreyyx: i would ff\nKreyyx: but anyone didnt ff xD\nKreyyx: GET CANCER ANYONE DIDNT FF\nKreyyx: FCKING CANCERS\nKreyyx: FUCKING CANCER NOOBS\nKreyyx: only 1v3\nKreyyx: FCKING CANCER\nKreyyx: FUCKING FAGGOTS\nKreyyx: FUCKING FAGGOTS\nKreyyx: FUCK OFF CANCER PLAYER\nKreyyx: FCKING FAGGOTS\nKreyyx: FCKING CANER NOOB L2P\nKreyyx: FGT\nKreyyx: FGT\nKreyyx: Darius flames me ;( report pls\nKreyyx: I am 98\nKreyyx: yo\nKreyyx: FGTS\nKreyyx: heimer leona dont ff\nKreyyx: FUCKTARDS\nKreyyx: OR AMUMU *\nKreyyx: FGTS\nKreyyx: GET CANCER REPORT MUMU AFK\nKreyyx: GET FUCKED DARIUS GET FUCKING FUCKED\nKreyyx: REPORT TEAM\nKreyyx: FCKTARDS\nKreyyx: report mumu afk\nKreyyx: cancer player and team dont want to ff so RREPORT FGTS\nKreyyx: FUCKIN FGTS\nKreyyx: FCKING FGTS\nKreyyx: IS MY KDA GOOD?\nKreyyx: FUCKTARDS\nKreyyx: NO CAUSE MY FGT TEAM KSED ME\nKreyyx: 542 MOVEMENT GAFFGOTS\nKreyyx: U SEE I AM TOO FAST FOR U FGTS\nKreyyx: report ammumu afk FAGGOT\nKreyyx: REPORT DARIUD FLAME NOOB FGT\nKreyyx: thx FCKTARDS L2P\nKreyyx: FGTS\nKreyyx: report heimer toxic darius toxic leona toxic mumu toxic afk\nKreyyx: FCKING FUCKING INTERS NOOBS\nKreyyx: BG FAGGOTS\n\nIch wurde noch nie gebannt... NOCH NIE warum jetzt ein Permaban als erster???","replies":[{"poster":"eingew","date":"2017-07-02T16:30:23.570+0000","up_votes":1,"down_votes":0,"body":"Weil Riot Homophobie und Rassismus zum Beispiel besonders hart bestraft, was hier beides eindeutig zu finden ist. Wenn die Logs richtig sind und du tatsächlich nichts mit dem Fremdzugriff auf deinem Account am Hut hast, solltest du gute Chancen haben den Account wieder zu bekommen.\n\nBedenke aber, dass dafür auch definitiv deine Geschichte hier stimmen muss. Solltest du auch nur in einem Punkt geflunkert haben, im Gegensatz zu uns kann Riot das überprüfen.\nEDIT: Und wenn der Account schon seit längerem von einem Fremden mitbenutzt wird, ist es ebenfalls schwierig für Riot, das herauszuwurschteln... würde die Entbannung ebenfalls unwahrscheinlicher machen.","replies":[{"poster":"Kreyyx","date":"2017-07-02T16:42:57.828+0000","up_votes":1,"down_votes":1,"body":"Ok danke erstmal das hier nicht alle Negativ gestimmt sind... Ich habe nicht geflunkert und auch nie meine Daten preisgegeben... Was mich auch wundert das ich jetzt einen Permaban bekommen habe obwohli ich noch nie einen Ban bekommen habe... Warum gleich PERMA?","replies":[{"poster":"eingew","date":"2017-07-02T16:44:21.078+0000","up_votes":1,"down_votes":0,"body":"Wie gesagt: Homophobie und Rassismus werden besonders hart bestraft. Kann bei der ersten Überprüfung zum Perma führen.","replies":[{"poster":"Kreyyx","date":"2017-07-02T16:55:40.397+0000","up_votes":1,"down_votes":4,"body":"zu Hart!!!!!!!","replies":[{"poster":"Webturnier","date":"2017-07-02T17:30:05.653+0000","up_votes":4,"down_votes":0,"body":"warum stört es dich wenn du das alles nicht geschrieben hast?","replies":[]}]}]},{"poster":"Balmung","date":"2017-07-02T16:51:38.173+0000","up_votes":2,"down_votes":1,"body":"Ohne dir auf den Schlipps treten zu wollen: Du hättest den Chatlog (imo) in den Eröffnungspost hauen sollen.\n\nWenn man sich vor Augen führt wie extrem dieser Chatlog ist, liegt die Vermutung sehr nahe das dir doch jemand den Account in den Perma treiben wollte. Da ist ja wirklich alles ab Zeile 1 dabei.","replies":[{"poster":"Kreyyx","date":"2017-07-02T16:53:26.567+0000","up_votes":1,"down_votes":2,"body":"Ich bin neu hier und verzweifelt... Ich versuche nur meinen Acc zurück zubekommen der mir weggenommen wurde OHNE RECHT...","replies":[{"poster":"Balmung","date":"2017-07-02T16:57:17.183+0000","up_votes":2,"down_votes":0,"body":"Ohne Recht ist Unfug.\n\nNach diesem Chatlog wäre jeder Account rechtens permanent gebannt, egal von wem und egal wer es verschuldet\n\nDie Chance ihn entbannt zu bekommen gilt nur unter der Prämisse, dass jede deiner Angaben absolut wahr ist.\n\nVersuche dich mal deiner Lage bewusst zu werden - ist vielleicht neben dem Abistress nicht so einfach, aber mal 'ne klaren Überblick über die Situation zu haben würde dir definitiv helfen.","replies":[{"poster":"Kreyyx","date":"2017-07-02T17:07:09.948+0000","up_votes":1,"down_votes":1,"body":"Natürlich verstehe ich das, aber warum kann mir dann keiner helfen... ICH WAR DAS NICHT und ich habe auch keinem meine Daten gegeben!!","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}