{"poster":"Riot LATAM","date":"2019-12-06T18:12:02.912+0000","title":"Ideas sobre el sistema de juego: 6 de diciembre","subforum":"Jugabilidad, balance y narrativa","up_votes":7,"down_votes":1,"body":"¡Hola a todos!\r\n-------------------------------------------------------------------------------\r\n**Avisos de siempre**\r\n\r\nEstas publicaciones a menudo contienen información acerca del trabajo a futuro que estamos realizando o que planeamos hacer y que no garantizamos que saldrá para el público. La naturaleza de dicho trabajo puede cambiar o, según lo que vayamos descubriendo, algunos proyectos mencionados podrían retrasarse o incluso cancelarse definitivamente. Si deseas ver un tuit cada vez que subimos una de estas publicaciones, síguenos en: https://twitter.com/RiotMeddler (en inglés).\r\n\r\n----------------------------------------------------------------------------     \r\n**Estamos revisando los efectos de la pretemporada en el desempeño de los jungleros**\r\n\r\nEstamos revisando el desempeño del junglero para realizar algunos ajustes si son necesarios en la versión 9.24b. Los ángulos principales que consideraremos son:\r\n\r\n* Nivel promedio antes y después de la pretemporada en diferentes puntos de la partida. Al combinarse con la participación en asesinatos, esto funge como un muy buen elemento para la influencia general de los jungleros.\r\n* Variación en el desempeño de los jungleros. La eliminación de la XP de recuperación tenía el objetivo de generar más diferencias entre los jungleros de desempeño alto y bajo. Queremos asegurarnos de que el efecto no sea tan extremo, y que los errores pequeños o las buenas jugadas no conduzcan a ventajas/desventajas demasiado grandes.\r\n* Independientemente de si ciertas clases y estilos de junglero tienen alto o bajo desempeño (p. ej. tanques contra acarreadores, recolectores de oro contra emboscadores, etc.). \r\n\r\n----------------------------------------------------------------------------   \r\n**9.24b**\r\n  \r\nHablando de la versión 9.24b, una breve línea de tiempo:\r\n\r\n* La versión 9.24 de la próxima semana será la última versión normal del año.\r\n* Haremos una versión solo para el servidor (así que no será necesario descargar ni habrá contenido nuevo, como aspectos/campeones) llamada 9.24b aproximadamente una semana después del lanzamiento de la 9.24.  \r\n* Esta versión contendrá cambios de balance para Grieta del Invocador y TFT, en especial a elementos que necesitan seguimiento tras la 9.24 (p. ej. cosas que recibieron demasiado impacto, que no recibieron lo suficiente o que, en retrospectiva, deberían haber estado en la versión 9.24 en primer lugar). Algunos usuarios actuales de Conquistador son un grupo de posibles candidatos para cambios, por ejemplo, si los cambios de Conquistador en la versión 9.24 no retiran la cantidad prevista de poder. \r\n\r\n----------------------------------------------------------------------------   \r\n**Objetos para soportes**\r\n\r\nAdemás de revisar la jungla, también estamos analizando los efectos de los cambios a los objetos para soportes. Algunas cuestiones específicas que queremos resolver son cosas como si la disminución de ganancias tras completar una misión es muy estricta (¿más oro cada 10 seg en el objeto o menos penalización por recolección de oro?); si la parte de la misión de centinelas se está completando muy rápido en algunos casos; si es necesario ajustar las líneas de estadísticas para los distintos objetos, etc. Aunque aún no planeamos cambios específicos.\r\n\r\n----------------------------------------------------------------------------   \r\n**Tasas de victorias de campeones según el tipo de Grieta**\r\n\r\nUna de las primeras cosas que queríamos saber tras el lanzamiento de la pretemporada era cómo las diferentes grietas elementales + las almas de dragones impactaban el poder de los diferentes campeones. Hemos observado grandes diferencias en las tasas de victorias según la combinación de campeón + tipo de mapa, pero nada particularmente exagerado en general. A continuación, algunos ejemplos de esta información. Recordemos que esto es *antes del nerf de regen. de Dragón de los Océanos*. También es una combinación del impacto de los cambios de terreno, las mejoras de dragón que adquieras y las almas de dragón que reclames. \r\n\r\nAlgunas tendencias son como las esperábamos (p. ej. los campeones hostigadores tienden a bajar su desempeño en los mapas de Océano, por la regen. y la maleza para esconderse. Otros son un poco más sorprendentes (p. ej. que Rengar no tenga un mejor desempeño en un mapa de Océano, con otros factores que le restan el poder que obtiene de tener más maleza). Tahm Kench, al menos antes del nerf a océano, era el campeón con el mayor cambio en la tasa de victorias según un elemento de grieta, mientras que los siguientes campeones con más cambios tienen alrededor de la mitad del cambio de su tasa de victorias. Tal vez sea porque la regeneración le sirve mucho, pero también es posible que una muestra tan pequeña genere información incorrecta (es un campeón poco jugado y esta información corresponde solo a un par de días). La información más reciente sugiere que las tasas de victorias están dentro del 1% en las grietas elementales para todos los campeones, incluyendo a Tahm.\r\n\r\nhttps://news-a.akamaihd.net/public/images/articles-latam/2019/Boardports/QGPT1206spaMX.jpg\r\n\r\n----------------------------------------------------------------------------     \r\n**Puntos de Prestigio**\r\n\r\nCambiando de tema, para quienes tienen Puntos de Prestigio en espera, tendremos la tienda de Puntos de Prestigio la próxima semana el 12 de diciembre. Contendrá una variedad de cosas para comprar con menos de 100 Puntos de Prestigio, como bolsas de aspectos del Premio Mayor, Llaves Hextech, Esencia Naranja, etc. \r\n\r\nPara tener más información en caso de que te hayas perdido algún detalle, entra al siguiente enlace. También compartiremos más detalles tras el lanzamiento de la tienda. \r\n\r\nhttps://las.leagueoflegends.com/es/news/game-updates/features/prestige-updates  \r\n\r\n----------------------------------------------------------------------------     \r\n**Última publicación del año**\r\n\r\nEsta será mi última publicación de 2019, ¡espero que les haya ido bien este año! Me voy a Nueva Zelanda por un par de semanas, así que no estaré disponible por un rato. Pero Riot Scruffy publicará algo aquí la siguiente semana sobre cosas como los resultados de nuestras investigaciones de jungla/soporte, el contexto de los cambios de la versión 9.24b, etc.\r\n\r\n\r\nhttp://ddragon.leagueoflegends.com/cdn/6.24.1/img/champion/Ziggs.png","replies":[{"poster":"Limonadah","date":"2019-12-12T20:16:00.809+0000","up_votes":2,"down_votes":0,"body":"Si pueden agregar el problema de Crasheos en el 9.24 b seria de gran ayuda!","replies":[]},{"poster":"Doctor Rata","date":"2019-12-06T21:05:54.581+0000","up_votes":2,"down_votes":1,"body":"No leí nada, pero proviniendo de un rioter de seguro es una vendida de humo seguida de una decepción y una posible tilteada.","replies":[]},{"poster":"Kyousuke","date":"2019-12-06T19:08:39.993+0000","up_votes":2,"down_votes":1,"body":"sería bueno que bajaran el precio de las bolsas por prestigio a 25 piezas en lugar de 50 porque es exagerado ese precio","replies":[]},{"poster":"Valgard Slayer","date":"2019-12-12T04:47:59.938+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"gurennaxus12","date":"2019-12-24T03:47:16.192+0000","up_votes":1,"down_votes":0,"body":"a eres plata 3 no hay mucha diferencia con los bronzes","replies":[]},{"poster":"Gonk","date":"2019-12-24T01:02:34.912+0000","up_votes":1,"down_votes":0,"body":">A ver si pueden hacer algo con el emparejamiento yo con mi amigo que es bronze II no puedo invitarlo a jugar ranked por la diferencia de nivel\n\nSiempre fue así, sólo puede haber una liga de diferencia (hierro/bronce - bronce/plata - plata/oro, etc).\n\n>a pero cuendo juego soloQ me emparejan con bronces III-II-I y Unrankeds \n\nEstás en plata 3, obviamente te van a emparejar con bronces, unrankeds y posiblemente oro (si es que tiene un mmr muy malo). \n Los unrankeds comienzan con un elo de plata 2 o 3.","replies":[]}]},{"poster":"DragonFelgrand8","date":"2019-12-06T19:49:58.615+0000","up_votes":1,"down_votes":0,"body":"Sobre lo de los puntos de prestigio, recibimos 25 PP en el 10° aniversario pero 25 PP sirve para máximo un gesto. Creo que al menos tendría que poder comprarse una bolsa con un fragmento de skin aunque sea.","replies":[{"poster":"BC Shuh","date":"2019-12-06T20:20:31.461+0000","up_votes":1,"down_votes":0,"body":"Como hago para comprar al menos un gesto con los 25 pp?","replies":[{"poster":"DragonFelgrand8","date":"2019-12-06T21:45:39.060+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BC Shuh,realm=LAS,application-id=xQmJPO8F,discussion-id=wAfrsZ1Y,comment-id=00020000,timestamp=2019-12-06T20:20:31.461+0000)\n>\n> Como hago para comprar al menos un gesto con los 25 pp?\n\nSe supone que próximamente va a haber una tienda de PP\nhttps://las.leagueoflegends.com/es/news/game-updates/features/actualizaciones-de-prestigio","replies":[]}]}]},{"poster":"ManucioElSucio","date":"2019-12-06T20:17:42.620+0000","up_votes":1,"down_votes":0,"body":"Reviertan la jg ya, es injugable, puro ekko o kayn, no se puede jugar tranqui, puro gank o te quedas atras","replies":[]},{"poster":"Gonk","date":"2019-12-06T19:40:58.331+0000","up_votes":1,"down_votes":0,"body":">  Objetos para soportes\n\n> Además de revisar la jungla, también estamos analizando los efectos de los cambios a los objetos para soportes. Algunas cuestiones específicas que queremos resolver son cosas como si la disminución de ganancias tras completar una misión es muy estricta (¿más oro cada 10 seg en el objeto o menos penalización por recolección de oro?); si la parte de la misión de centinelas se está completando muy rápido en algunos casos; si es necesario ajustar las líneas de estadísticas para los distintos objetos, etc. Aunque aún no planeamos cambios específicos.\n\nSiento que deberían hacer como era antes, al llegar a tener los wards, podes farmear tranquilamente o sino que siga la misión del oro porque es bastante dificil llegar a tener más items si sos del equipo que anda perdiendo.\n\n\n>Variación en el desempeño de los jungleros. La eliminación de la XP de recuperación tenía el objetivo de generar más diferencias entre los jungleros de desempeño alto y bajo. Queremos asegurarnos de que el efecto no sea tan extremo, y que los errores pequeños o las buenas jugadas no conduzcan a ventajas/desventajas demasiado grandes.\n\nDesde mi punto de vista, tuvieron que haber hecho un hotfix de esto, es demasiado tedioso ser el que pierde porque quedas muy por detras que todos","replies":[]},{"poster":"YasuOwO","date":"2019-12-06T20:26:01.552+0000","up_votes":1,"down_votes":1,"body":"¿Una pregunta cuando adelantaran algo del mapa de campeones?","replies":[]}]}