{"poster":"Riot LATAM","date":"2019-05-13T18:03:25.639+0000","title":"llegan cambios para Zac al PBE para la versión 9.11","subforum":"Jugabilidad, balance y narrativa","up_votes":2,"down_votes":5,"body":"¡Hola! \r\n\r\nHemos estado analizando algunas excelentes conversaciones sobre el desempeño de Zac después de su actualización en 2017. Después de evaluar los comentarios de los jugadores, finalmente decidimos que nos excedimos un poco cuando redujimos su daño al intentar convertirlo en un tanque con mayor control de masas. Estamos de acuerdo en que parte del patrón de Zac de lanzarse hasta las filas traseras e infligir daño es fundamental para su identidad como campeón. Desafortunadamente, los jugadores que usan a Zac consideraran que, después de entrar en las peleas, no son capaces de lograr mucho más que solo controlar a los enemigos que estén alrededor. Con esto en mente, revertiremos su definitiva y su W, que habían sido actualizadas.\r\n\r\n**Lista completa de cambios:**\r\n\r\nQ: Golpes de Estiramiento\r\nENFRIAMIENTO :: de 13 a 9 seg >>> de 15 a 9 seg.\r\n\r\nW: Materia Inestable\r\nAhora inflige un 2% de la Vida Máxima del objetivo por cada 100 de Poder de Habilidad como daño.\r\n\r\nR: ¡Rebotemos! \r\nELIMINAMOS SU DEFINITIVA ANTERIOR\r\n\r\nNUEVA DEFINITIVA :: Zac rebota 4 veces y obtiene de 20% a 50% de Velocidad de Movimiento a lo largo del efecto, pero no puede usar su Q ni su E, y no puede atacar. Cada rebote inflige 140/210/280 (+40% de Poder de Habilidad) de daño, reducido un 50% en rebotes posteriores. El primer rebote lanza a los enemigos hacia atrás durante 1 seg y todos los rebotes ralentizan un 20%.\r\n\r\nLa definitiva es completamente igual a como era antes de los cambios a Zac, cuatro ataques de área, cada uno 1 seg después del anterior, los cuales infligen daño y lanzan por el aire a los enemigos una vez por definitiva. También revertimos su W, donde básicamente volvimos a añadir la tasa de poder de habilidad que eliminamos. No cambiamos la Q, pero su enfriamiento es un poco más largo para extraer más poder del control de masas de Zac y llevarlo a su daño. Esto debería ampliar las opciones de armados para Zac como peleador de poder de habilidad, aunque esperamos que el armado de tanque siga siendo la opción predeterminada. \r\n\r\nEstos cambios deberían estar pronto en el PBE para realizar pruebas y recibir comentarios, con un plan tentativo para lanzar la lista final de cambios en la versión 9.11. Esperamos conocer las opiniones de todos ustedes sobre esta lista y partir de allí.","replies":[{"poster":"Mioen","date":"2019-05-13T20:13:05.220+0000","up_votes":2,"down_votes":0,"body":"¿Esto es una broma de April Fool fuera de fecha?\n\nAlguien me edita este video para que diga estos son los cambios a Zac.\nhttps://youtu.be/9ztLHvll7mc","replies":[]},{"poster":"lllHeisenberglll","date":"2019-05-13T20:10:41.768+0000","up_votes":2,"down_votes":0,"body":"Recuerdo cuando Riot habia dicho que Zac en cuanto a gameplay no tenia personalidad, era lanzarse y spamear W y R y esperar que todo salga bien. Queremos mas carisma para Zac asi que introdujimos su nueva R\n\nAhora vuelven a la R vieja que era horrible \n\n{{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"Zindro","date":"2019-05-13T23:20:13.017+0000","up_votes":3,"down_votes":1,"body":"Créanme que estos cambios no son buenos, la ulti de Zac es una gran forma de ccear al rival y moverlo donde quieras. \n\nEsto NO es bueno para Zac.","replies":[{"poster":"ChinCheSlayer","date":"2019-05-25T16:30:08.693+0000","up_votes":1,"down_votes":0,"body":"Sinceramente yo soy Main Zac desde la S4 o cualquiera haya Sido Main desde antes del rework que le hicieron a la Q,W,R se volvió inútil antes vos veias a Zac en competitivo ahora mismo Zac está como udyr e ivern","replies":[]}]},{"poster":"SofiGamer2006","date":"2019-05-13T18:31:08.786+0000","up_votes":3,"down_votes":1,"body":"> Estamos de acuerdo en que parte del patrón de Zac de lanzarse hasta las filas traseras e infligir daño es fundamental para su identidad como campeón.\n\n{{sticker:sg-lux-2}} \n\nLa gracia de ZAC es ser una maquina de CC y desposicionamiento. El daño no tiene nada que ver.\n\nLa ulti actual es un trillon de veces mejor de lo que era antes ya que si llegas a meter el salto la R es casi garantizada. Para los que no saben la E los ccea por 1 segundo si cargaste full y la R necesita 1.1s de tiempo de canalizacion para moverlos.\n\nEsto significa que tienen 0.1s-0.3s para flashear y salirse de la r (dependiendo del tiempo de reaccion de la persona usando zac).\n\nSi realmente quieren hacerlo util aumenten la duracion de la E de 1s a 1.3s y eso te da una ulti garantizada, un displacement bastante bueno y un cc impresionante.\nEl daño no es el problema aca, es no tener una ulti \"reliable\" si el enemigo tiene flash.","replies":[{"poster":"ChinCheSlayer","date":"2019-05-25T16:38:43.408+0000","up_votes":1,"down_votes":0,"body":"El problema de Zac es que es un Nunu no tiene daño y si tu equipo va mal ya perdiste la partida, yo juego Zac desde la S4 y sé que Zac actualmente no está en meta por la falta de daño podrá tener todo el CC que quiera pero si pensas que Zac se arma solamente tanke mírate videos de la S3 y S4 se armaba AP, la gente ahora mismo se queja porque no conoció al viejo es como el nuevo atrox arruinado esta","replies":[{"poster":"SofiGamer2006","date":"2019-05-25T16:56:38.899+0000","up_votes":1,"down_votes":0,"body":"Zac no es como nunu porque tankea 47 veces menos que el.\n\nZAC para ser un tank es bastante mediocre porque casi ni tankea comparado con otros. Si solucionan eso creo que andaria bien.","replies":[]}]}]},{"poster":"VictoriousYorick","date":"2019-05-13T18:39:20.997+0000","up_votes":4,"down_votes":2,"body":"Es un tank, no tiene que hacer daño, tiene que poder meterse en medio de todos y ccear, que es justamente lo que hace a la perfeccion ahora, E en medio de todos, ultea y gana la tf\n\"los jugadores que usan a Zac consideraran que, después de entrar en las peleas, no son capaces de lograr mucho más que solo controlar a los enemigos que estén alrededor.\" No es suficiente eso para un campeon tanke? tambien tiene que hacer daño? no riot, basta con los tankes que deletean, como son por ej: todos los tankes del juego","replies":[]},{"poster":"Ode to dark","date":"2019-05-13T18:38:21.260+0000","up_votes":2,"down_votes":1,"body":"¿Zac AP bruiser? ¿Qué te fumaste rito?\n\n¿Y Cuándo los cambios para Diana? Hace como un mes que lo anunciaron","replies":[{"poster":"SBL Nightel","date":"2019-05-13T19:15:28.026+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ode to dark,realm=LAS,application-id=xQmJPO8F,discussion-id=Q7NaEJP4,comment-id=0002,timestamp=2019-05-13T18:38:21.260+0000)\n>\n> ¿Zac AP bruiser? ¿Qué te fumaste rito?\n> \n> ¿Y Cuándo los cambios para Diana? Hace como un mes que lo anunciaron\n\nCambios a Diana? Me podrias pasar un post/info sobre eso? Gracias!","replies":[]},{"poster":"Salvor","date":"2019-05-13T18:43:55.645+0000","up_votes":1,"down_votes":0,"body":"Si mal no recuerdo llegan esta semana o la que viene al PBE.","replies":[]}]},{"poster":"Súb de Elmillor","date":"2019-05-19T16:45:46.343+0000","up_votes":1,"down_votes":0,"body":"hola buenas, lei un articulo qué tambien van a cambiar a camille en ese parche, eso es correcto?","replies":[]},{"poster":"Hnk Kenshiro","date":"2019-05-13T19:26:26.470+0000","up_votes":2,"down_votes":2,"body":">  evaluar los comentarios de los jugadores\n\nEvalúen revertir a Aatrox.","replies":[{"poster":"Mioen","date":"2019-05-13T20:15:02.893+0000","up_votes":1,"down_votes":0,"body":"Los cambios a Aatrox lo volvieron viable nuevamente. Es una maquina del 1v1 y del 1v2, como deberia ser.","replies":[{"poster":"Alkiashi","date":"2019-05-13T23:23:00.222+0000","up_votes":1,"down_votes":0,"body":"Aatrox ya era viable, el rework fue lo peor que le pudo pasar. \nLe quitaron su esencia, no del lore pero si de las mecanicas, ademas de que fue sacado por debajo de los demas, tuvieron que buffearlo, se les fue de las manos, volvieron a nerfearlo pero sin saber como controlarlo, asi repetidas veces, ahora con los ultimos cambios rezan para que desaparezca un poco del competitivo. \nComo se extraña al viejo Aatrox.","replies":[{"poster":"Mioen","date":"2019-05-14T00:58:02.507+0000","up_votes":1,"down_votes":0,"body":"Si lo que pasó con Aatrox antes del rework fue lamentablemente, tras mucho tiempo desde su salida era viable, pero le metieron igualmente el rework.\nDe todas formas yo estoy hablando de los cambios que le metieron hace poco, respecto a el funcionamiento de su últi y habilidades.","replies":[]}]}]}]},{"poster":"Alkiashi","date":"2019-05-13T23:18:15.328+0000","up_votes":1,"down_votes":0,"body":"Sáquenle el circulo de 32 metros  de diámetro que aparece abajo de donde va a caer Zac y van a ver como vuelve al meta.","replies":[]},{"poster":"alex569","date":"2019-05-29T23:18:31.309+0000","up_votes":0,"down_votes":1,"body":"HOLA HE YO QUIERO DAR MI OPINION POR QUE YO USO HA ZAC PERO AL DE LA R QUE ATRAPA Y LO ASE INTARJETEABLE MI OPINION ES QUE : CONBINEN LAS 2 R POR QUE NECESITAS CANALIZAR LA R 1.1SG PARA MOVERLOS QUE SEA ASI... SI SOLTAS LA R ANTES DE 1.1SG QUE FUNCIONE COMO EL DE LA S4 Y SI LA CANALIZAS 1.1SG QUE LOS MUEVA","replies":[]},{"poster":"Salvor","date":"2019-05-13T18:06:10.127+0000","up_votes":2,"down_votes":4,"body":"Me parece excelente!","replies":[]}]}