{"poster":"Yordle God","date":"2015-02-03T20:34:36.757+0000","title":"I gotta be the guy to say this? (DJ Sona)","subforum":"Concepts & Creations","up_votes":240,"down_votes":29,"body":"If you hate that a support is getting an ultimate skin I will bet money you're one of those ADC's that takes all the credit for winning bot and blames the support for their deaths.\r\n\r\nOr you're just a Zed main.\r\n\r\nQQ more.\r\n\r\nAs a fan of Sona and EDM, this skin is a wet dream.\r\nSo thank you Rito :)","replies":[{"poster":"SmokinSickStyle","date":"2015-02-03T20:50:17.799+0000","up_votes":19,"down_votes":24,"body":"You'd lose all your money with me then heheh.\n\nI play {{champion:238}}  since release, never stopped even when he was nerfed multiple times and yet i'm not mad because of a support getting a Ultimate skin, ADC is my least played role because i'm not good at it, i support from time to time if it's needed, but i mostly play with friends so i'm more than happy to do that.\n\nI was so eager to see which what skin would it be not much for the champion who gets it.\n\nI quite like DJ Sona even if people may be upset about it they cannot deny it's a very good one.\n\nUltimates makes me always feel like a kid in a sweet shop heh, we certainly needed new content to refresh the air here as nothing exciting did happen lately.\n\n\nI'm happy for {{champion:37}}  mains (Free music for me :D)","replies":[{"poster":"Señor Karthus","date":"2015-02-03T21:26:48.764+0000","up_votes":106,"down_votes":6,"body":"> [{quoted}](name=IudexAter,realm=EUW,application-id=A8FQeEA8,discussion-id=t6N1EWjY,comment-id=0004,timestamp=2015-02-03T20:50:17.799+0000)\n>\n I play {{champion:238}}  since release, never stopped even **when he was nerfed multiple times**\n\nhttp://i.ytimg.com/vi/mpfjJwexXIw/maxresdefault.jpg","replies":[{"poster":"Rew711","date":"2015-02-03T23:48:33.512+0000","up_votes":15,"down_votes":0,"body":"I can't stop laughing. Why?","replies":[]},{"poster":"SmokinSickStyle","date":"2015-02-03T22:22:02.434+0000","up_votes":4,"down_votes":22,"body":"Funny, but yes, he has received SEVERAL changes since his release, between nerfs and buffs, if you don't believe me check up the patch notes into LoL wiki or something.","replies":[{"poster":"Captain Aishi","date":"2015-02-03T22:47:16.912+0000","up_votes":16,"down_votes":1,"body":"V3.7:\n\n     Razor Shuriken\n        Damage dealt to secondary targets reduced to 45/69/93/117/141 (+0.6 bonus attack damage) from 60/92/124/156/188 (+0.8 bonus attack damage). \n     Living Shadow\n        Vision radius of the Shadow reduced to 700 from 1300. \n     Shadow Slash\n        Cooldown increased to 4 seconds from 3. \n\nactually that's the only patch where zed received flat-out nerfs without getting any compensation buffs, so it's quite negligible as far as \"X champion being nerfed multiple times\" unlike champions like Sona for example\n\nshe has received straight up nerfs in patches 5.1, 4.20, since her rework that made a lot of her mains hate her in patch 4.13 (which also was considered to be a nerf in her power level comparatively to her previous iteration)\n\nso it's easy to understand why people might react this way","replies":[{"poster":"Junkο","date":"2015-02-04T17:06:24.677+0000","up_votes":6,"down_votes":0,"body":"Actually:\n-Q damage reduced\n-W vision reduced\n**-W missile speed reduced by a third**\n**-E cooldown increased by 1** (this is a huge nerf, as it removes 1 E from your ultimate early game)\n**-E now reduces W cd by 2 each time it hits a champion instead of 1 from every unit\n**\n-Indirect nerf via Botrk changes, which made him build the tank destroying build he builds today\n-R ultimate now spawns a shadow from where it was cast instead of where you land, \"But now he is safer\", before every smart player would just leave a W behind OR go with triple shadow overkill, now you only have the first option.\n-ult cast time increased by half a second\n-the ones he got last patch\n\nbolded huge nerfs\n\nnot saying he isn't a problem, but he got nerfed a lot.","replies":[]},{"poster":"SmokinSickStyle","date":"2015-02-03T23:14:13.431+0000","up_votes":8,"down_votes":2,"body":"W projectile speed got nerfed by 1000 (1500 from 2500).\n\nAnyway, enough with the Zed talking, my comment was just to express myself on people hating Sona getting the ulti  and  from OP's point of view many of those people being Zed players, and as Zed player i was stating that it isn't totally true.\n\nI think we can stop turning this thread from DJ  Sona to ANOTHER Zed thread.","replies":[]}]}]}]},{"poster":"Deathtenfold","date":"2015-02-03T20:55:29.293+0000","up_votes":13,"down_votes":6,"body":"> [{quoted}](name=IudexAter,realm=EUW,application-id=A8FQeEA8,discussion-id=t6N1EWjY,comment-id=0004,timestamp=2015-02-03T20:50:17.799+0000)\n>\n> You'd lose all your money with me then heheh.\n> \n> I play {{champion:238}}  since release, never stopped even when he was nerfed multiple times and yet i'm not mad because of a support getting a Ultimate skin, ADC is my least played role because i'm not good at it, i support from time to time if it's needed, but i mostly play with friends so i'm more than happy to do that.\n> \n> I was so eager to see which what skin would it be not much for the champion who gets it.\n> \n> I quite like DJ Sona even if people may be upset about it they cannot deny it's a very good one.\n> \n> Ultimates makes me always feel like a kid in a sweet shop heh, we certainly needed new content to refresh the air here as nothing exciting did happen lately.\n> \n> \n> I'm happy for {{champion:37}}  mains (Free music for me :D)\n\nPersonally, I think the DJ sona skin is 60% an apology for the nerfs and 40% pissing off everyone who hates sona and sona mains. Fair trade if I might say. Although the nerfs were unjustly, I don't wanna keep fighting a battle that is already over.","replies":[{"poster":"Pika310","date":"2015-02-04T05:11:33.744+0000","up_votes":5,"down_votes":9,"body":"Just like how George Washington gave up and America to this day is still a British colony.  Oh wait a second...\n\nPersonally, I feel no \"apology\" in Riot releasing this skin.  How I see the percent going: 40% pissing off Sona haters and Sona mains, 20% screw viability, 30% screw players willing to speak out against Riot's intentionally bad decision-making and 10% Riot themselves hating Sona and extorting anyone still willing to play her.  I don't know about your state, but here in Arizona this would be a class 4 felony by way of criminal code 13-1804 subsection A paragraph 6.","replies":[{"poster":"Jofeyy","date":"2015-02-04T05:38:53.377+0000","up_votes":7,"down_votes":1,"body":"Ari(sona)  ...dont kill me XD","replies":[{"poster":"Pika310","date":"2015-02-04T05:48:54.909+0000","up_votes":12,"down_votes":2,"body":"Close, you were just 1 step off.\n\nhttp://st.elohell.net/public/chill/b2a94371db62e2ef7a97fb7ff74e99d2.jpg","replies":[]}]}]},{"poster":"Flay and Pray","date":"2015-02-03T21:00:27.130+0000","up_votes":14,"down_votes":6,"body":"> Personally, I think the DJ sona skin is 60% an apology for the nerfs and 40% pissing off everyone who hates sona and sona mains. Fair trade if I might say. Although the nerfs were unjustly, I don't wanna keep fighting a battle that is already over.\n \nIt's obvious what the nerfs were for now, they know that when an ultimate skin comes out they want the champion to be as balanced as possible to reduce the amount of complaints. Since they have had this skin in development so long this is why we have been seeing periodic sona changes and nerfs for a while now.","replies":[{"poster":"Pika310","date":"2015-02-04T05:06:46.583+0000","up_votes":11,"down_votes":7,"body":"> they want the champion to be as balanced as possible \n\nBeing the weakest champ in the entire game is \"balanced?\"  That cardboard logic.","replies":[]}]}]},{"poster":"Agent Tatsu","date":"2015-02-03T22:33:43.090+0000","up_votes":4,"down_votes":1,"body":"I'm actually really sad for Sona mains. Before, Arcade Sona was enough to showcase your dedication to the silent support, but now you need DJ Sona FOR THE INCREDIBLY LOW PRICE OF JUST $25\n\nrip wallets worldwide, need more gp5 {{item:3303}} {{item:3303}} {{item:3303}} {{item:3303}}","replies":[{"poster":"Pika310","date":"2015-02-04T05:32:57.336+0000","up_votes":6,"down_votes":1,"body":"Unfortunately gp5 was nerfed too.\n\n{{item:3070}} {{item:3098}} {{item:3070}} \n\nWhen will Riot's hate for Sona finally end?","replies":[]},{"poster":"Tsunday","date":"2015-02-04T17:44:03.358+0000","up_votes":1,"down_votes":0,"body":"Really I thought I needed every Sona skin to showcase my dedication? I thought a dedicated suppot always tried to make matching botlanes with their ADC and their ADC's skins :C I say this as a support main who owns almost every support skin in the game. This time next year I will own them all (Except the Victorious skins, RIP Victorious Janna the best skin in the entire game) because all I need ATM are a few Alistar skins, Bittersweet Lulu, Deep Terror Thresh, Sun Goddess Karma (prey the RNG is with me on Traditional), a few Blitcrank skins, and maybe a few Annie/Morg/Zyra skins if they're still considered 'supports'. I'm not even counting DJ Sona on the skins I need, I've owned every DJ Sona skin since the last time Muse came out of Legacy Vault last time and I am not going to lose my claim on owning every Sona skin.\n\nbut naw everyone played Arcade Sona even the Sona's who didn't main Sona. It didn't feel like much of a dedication at all. The dedicated Sonas were the ones who played Pentakill, Muse, or Guqin.","replies":[{"poster":"Agent Tatsu","date":"2015-02-04T17:46:12.819+0000","up_votes":1,"down_votes":0,"body":"Guqin was always my favorite.","replies":[{"poster":"Tsunday","date":"2015-02-04T18:11:40.172+0000","up_votes":1,"down_votes":0,"body":"Part of me really liked Arcade, I loved the gaming board in front of her, but she was really my midlane skin. I laughed so hard when I went midlane because it pissed enemies off when I AAd because of her AA sound. it was great. I switch between them all outside of midlane though. Part of it depends on my ADC, part of it my mood, and then part of it based on who I played last.\n\nI bought Arcade first and Guqin second (it was my favorite of her 975) because the music was great but now that you can't hear the music it's a little more lackluster imo.","replies":[{"poster":"Agent Tatsu","date":"2015-02-04T18:20:22.078+0000","up_votes":1,"down_votes":3,"body":"I find it funny how everyone acknowledges how utterly annoying Sona is, yet everyone complains when she gets nerfed","replies":[{"poster":"Tsunday","date":"2015-02-04T18:32:42.300+0000","up_votes":1,"down_votes":3,"body":"I'm actually upset that she is still getting nerfed on PBE because I think she's at an alright (if not a little bit of an outclassed place) atm, but her rework was a major buff and the first set of nerfs were definitely needed :/","replies":[{"poster":"Pika310","date":"2015-02-05T03:29:20.056+0000","up_votes":3,"down_votes":0,"body":"The \"rework\" was undoubtedly a major nerf.  It can't logically or mathematically be described as anything, but that.  A compilation of 17 simultaneous nerfs, it secured her position as the most unplayable character in the entire game.\n\nTruly the clearest showing of Feareless' deep-seated Sona hatred.","replies":[]}]}]}]}]}]}]},{"poster":"Orisi","date":"2015-02-04T00:03:02.943+0000","up_votes":4,"down_votes":0,"body":"Personal bugbear time; His wager was not that all Zed players hate Supports getting this skin, it was that IF you hate the skin, you're either that sort of ADC or a Zed player. as in 'the latter is predicated on the former'. A truncated example; All Sona haters are Zed players, is not the same as All Zed players hate Sona.","replies":[{"poster":"Pika310","date":"2015-02-04T05:35:16.169+0000","up_votes":7,"down_votes":2,"body":"I would be under the impression all Zed players love Sona.  She's easier for him to farm than a caster minion.","replies":[]}]}]},{"poster":"stealthfox94","date":"2015-02-03T20:41:29.019+0000","up_votes":21,"down_votes":1,"body":"Who could possibly complain about a support getting an ultimate skin?","replies":[{"poster":"Ardond","date":"2015-02-04T03:42:46.506+0000","up_votes":10,"down_votes":0,"body":"the people who think supports are only good at carrying 2 things, wards and blame.","replies":[]}]},{"poster":"1st HanarSpectre","date":"2015-02-03T21:09:43.290+0000","up_votes":24,"down_votes":5,"body":"I don't think i've seen anyone complain about a support getting the ultimate.\nI see plenty of people mentioning that Arcade and DJ are very similar, and also others that mention that Arcade is pretty much already a legendary skin due to how well it's made and that it is wasted to give someone with a skin like that an ultimate.\n\n\nI could also be like you an assume that you posted this because you are a supprot that feeds every game and who's only retort to teammate asking you to please stop feeding is \"OMG SUPPORT HAET BAD ZED/ADC\"","replies":[{"poster":"Phrixscreoth","date":"2015-02-03T22:45:47.079+0000","up_votes":9,"down_votes":1,"body":"It's that I have Arcade Sona that is making me even a LITTLE hesitant about picking this one up.  I really like using Arcade and don't know how I'm going to easily pick between using one or the other per game.\n\nHonestly if I had this skin I wouldn't even worry about Sona's viablity as a pick-  I'd pick sona just to let my teammates groove out.","replies":[{"poster":"Envy Sin","date":"2015-02-03T23:31:16.099+0000","up_votes":7,"down_votes":2,"body":"Arcade Sona skin doesn't look that good. \n\nEveryone was all excited about the Arcade lane when MF got one only to find out that MFs had WAAYYYY more work put into it, I wish they had just updated Arcade to look better. Not tried to get more money out of people that already own a skin or two for her.","replies":[{"poster":"Phrixscreoth","date":"2015-02-04T00:08:43.999+0000","up_votes":3,"down_votes":0,"body":"Oh I agree, this one is better than arcade on a straight skin quality level, but I really love the 16bit sound direction for Arcade.","replies":[]}]}]},{"poster":"Adrian Blackbear","date":"2015-02-04T01:14:23.344+0000","up_votes":3,"down_votes":0,"body":"I've actually seen a lot of complaints about a support getting the ultimate skin.\nA lot of people, I don't know if they were trolling or not, said \"Supports shouldn't get the skin. Nobody wants to play as them.\"\nTo which my response was: Every single LoL Summoners Rife game (following the meta) has a support?","replies":[]}]},{"poster":"SleepyLionCub","date":"2015-02-03T21:12:34.812+0000","up_votes":4,"down_votes":7,"body":"Eh, i only dont like it because i dont use Sona. Plus sona just got a skin a little while ago.\n\nI want Lux, or Amumu to get an Ultimate skin.","replies":[{"poster":"Shonicss4","date":"2015-02-03T21:53:37.222+0000","up_votes":10,"down_votes":1,"body":"Sona's Last Skin was Arcade and that was released in 2012, that's not a little while ago","replies":[{"poster":"Malluma","date":"2015-02-03T22:26:18.174+0000","up_votes":1,"down_votes":18,"body":"Actually Sona's last skin was Silent Night Sona in 2013","replies":[{"poster":"Captain Aishi","date":"2015-02-03T22:40:59.998+0000","up_votes":17,"down_votes":0,"body":"silent night sona was released in december 2010 actually","replies":[]}]}]}]},{"poster":"chonky poyo","date":"2015-02-03T21:42:05.551+0000","up_votes":11,"down_votes":0,"body":"At least you aren't the girl who posted on my board saying that DJ Sona was an \"insult to women.\"","replies":[]},{"poster":"Deathtenfold","date":"2015-02-03T20:43:11.549+0000","up_votes":16,"down_votes":6,"body":"It makes me smile to see someone who speaks so much truth in such a small post. You have my Sword,{{item:3153}} My Axe {{item:3074}} And My Bow {{item:3085}}.","replies":[]},{"poster":"Hellish Prophecy","date":"2015-02-03T22:31:20.753+0000","up_votes":9,"down_votes":1,"body":"Can't believe how ignorant this post is if you're serious.\nI love supp. Support deserves a major amount of credit for bot lane victory, and it's the most vital role with Sona being the face of \"true\" supports.\nI don't hate that a supp got an ultimate. I hate that it was Sona and the theme for it was DJ. Don't get me wrong. It looks great.","replies":[]},{"poster":"Damorion215","date":"2015-02-04T05:36:21.726+0000","up_votes":11,"down_votes":3,"body":"**Date: July 30th, 2014**\n\n**Riot:** Alright, so I think we can all agree we hate Sona, even though there's really nothing wrong with her, right? Let's nerf the shit out of her!!\n\n~~~~~ ~~~~~ ~~~~~ ~~~~~ ~~~~~ ~~~~~\n\n**Date: February 3rd, 2015**\n\n**Riot:** Hey there, LoL Community! Here's an ultimate skin for the champ that us here at Riot have nerfed the shit out of! Now buy the skin because it's really awesome, even though we'll still nerf Sona into oblivion!\n\n\nI am **very** tempted to get this skin. At first, I'm like, \"Holy crap, that's freakin' awesome! I might start playing Sona again!\" Then I'm like, \"Oh wait, Riot's nerfed the shit out of her and will continue to do so. So what's the point?\" I wanna keep track of this skin's sales and see how many people buy it, just in hope of seeing a low number of people buy it in order to spit in Riot's face for such an asshole move.","replies":[{"poster":"Pika310","date":"2015-02-04T05:53:52.989+0000","up_votes":6,"down_votes":3,"body":"Yes, my feelings exactly.","replies":[{"poster":"Damorion215","date":"2015-02-04T06:47:44.054+0000","up_votes":6,"down_votes":3,"body":"Yeah, like, I want the skin so badly, but why should I give any money to Riot for a champ they're just going to keep ruining? They've yet to properly nerf Zed, they're afraid to touch Lee SIn without pissing off the community (like they already haven't), but out of all the champs the feel needs the most nerfing, it's Sona. She doesn't even get any LCS play anymore (which I blame both on Riot AND the players for a number of champs other than just Sona)! I think we can see some reasons as to why NikaSaur and Ms. Pudding (and probably some others) left Riot.\n\nSo yeah, if anyone can tell me, is there some website or app of some kind I can use to track the sales of a skin and/or champ? I'm really curious.","replies":[]}]}]},{"poster":"Nightcrow Teo","date":"2015-02-04T09:24:21.487+0000","up_votes":7,"down_votes":1,"body":"Sona has been nerfed hard and nowdays people don't tend to use sona anymore.. Her win rate dropped hard.. I think this new skin is riot idea to make player to use sona again..","replies":[]},{"poster":"Kojiro Sasaki","date":"2015-02-04T19:30:19.128+0000","up_votes":5,"down_votes":0,"body":"\"or a champion that has her fair share of counters (ex. Leona, Blitzcrank, vocal chords), Sona's pattern lacks significant counterplay when these champs aren't present, leaving her laning phase pretty oppressive. To give her opponents more windows to counterattack, we're reducing some of her skirmishing power so she's not so obnoxious with that harp. Etwahl, sorry.\"\n\nTranslation - \"We want Sona to be crap, and every other support should be able to beat her\" \n\nIsn't that what counter picks are? If you don't pick against a specific champion you're saying it should still be easy to just kill them?","replies":[]},{"poster":"Visigoth","date":"2015-02-03T21:25:13.732+0000","up_votes":6,"down_votes":2,"body":"I just hope Zac is next on the skin list. And not just legendary. I've seen plenty of decent ideas for skins on him but Riot just refuses to acknowledge his existence in this game, kinda like {{champion:83}}.","replies":[{"poster":"Terff","date":"2015-02-03T21:51:09.632+0000","up_votes":5,"down_votes":0,"body":"They've acknowledged his lack of skins plenty of times, his skins just take longer and require a lot more effort than most others do.","replies":[]}]},{"poster":"mirth101","date":"2015-02-04T02:40:41.451+0000","up_votes":8,"down_votes":3,"body":"Please Riot.... why NERF Sona all the time. She is NEVER played on LCS anymore. Because you nerfed the hell out of her kit. Please look at her again. Who complained?  No one. She was fine. Zyra , Sorak, Morgana, Braum, Taric. No one gets nerfed ....except little Sona who is powerless. This is not balanced. This is unbalanced. And we need her back. We need her heal to be better. We need her poke to be  stronger and less manna hungry/ Why do you make a skin  then If she can't be played properly because of her total uselessness after you took a scalpel to her. Please restore some of her strength, I beg you. I main her. I ranked with her. But now? Impossible. Please reconsider.","replies":[]},{"poster":"NoMonku","date":"2015-02-05T09:48:19.904+0000","up_votes":4,"down_votes":0,"body":"Only reason I don't like this skin is because she has received a LOT of nerfs recently.  Nothing makes me love a skin MORE then playing it on something I know that RIOT feels is too strong.  Besides that its cool.","replies":[]},{"poster":"xGvPx","date":"2015-02-04T20:06:15.497+0000","up_votes":4,"down_votes":0,"body":"So they nerf Sona three times and then everyone is happy to spend money on an ultimate skin?  Is that the way it works? ;P","replies":[]},{"poster":"Ashes Arise","date":"2015-02-04T02:26:39.181+0000","up_votes":6,"down_votes":2,"body":"I would be happy about this if Sona wasn't Riots new most hated champion. As much as I like the skin, I just don't care. Sona is so undesirable atm. Too squishy, too slow, and still chained to her adc on a leash due to gutted ranges. I wasn't okay with the Sona rework when it went live... do you honestly think I'm going to be okay with it after she has been heavily nerfed since then?","replies":[]},{"poster":"Comedy Silver","date":"2015-03-27T02:47:59.243+0000","up_votes":3,"down_votes":0,"body":"Who's ready for the next ultimate skin YOHGOT!?!?! {{champion:6}} {{champion:6}} {{champion:6}} {{champion:6}} {{champion:6}} {{champion:6}} {{champion:6}} {{champion:6}} {{champion:6}}  (not really, but support it, it could happen)","replies":[]},{"poster":"Junkο","date":"2015-02-04T17:20:42.702+0000","up_votes":1,"down_votes":0,"body":"I play Zed and i don't hate DJ Sona because she is a support. I hate it because she got absolutely gutted in the last few patches, and she is probably gonna be buffed back up again just so the skin will sell.","replies":[]}]}