{"poster":"VenixHigh","date":"2017-06-11T12:57:27.461+0000","title":"Permaban","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":8,"body":"Hey,...\r\nWei&szlig; gar ni wie ich das ganze hier anfangen soll...\r\nHab seit 1 Monat keinen Ban mehr (Also die Wegsitz-Strafen) und dachte alles ist ok. Manchmal musste ich kurz meine Meinung vertreten aber war ni extrem beleidigend! Ich spiel mit meinem Account in Bronze 3.... ja ok bitte nicht darauf achten, ich spiele nicht sehr oft und nur kaum Ranglistenspiele. Und vielleicht gibt es einige von euch denen es &auml;nlich geht -.- Mal hier ein Troller mal da ein Feeder (richtige feeder). Egal erstmal...\r\nAlso mich gerade nach meinem Wochenendsurlaub zu einer Runde lol bewegt.\r\nNur ein blind, wollte support spielen also schnell supp reingeschrieben. Dann die ersten Konfrontationen... BLlitzcrank wird instalocked und ich sitze da und denke mir: Hmh na super... Also nach Streitigkeiten Zed genommen. Bin richtig schlecht mit ihm aber wollte nicht komplett trollen... Also die ersten Minuten gespielt ohne gro&szlig;e Konfrontionen mit meinem Freund Blitzcrank... Auf einmal werde ich vollgeflamet weil ich 0-1 stehe... Ja, hmh... Dann wenig sp&auml;ter 0-2 und der Spa&szlig; beginnt. Auf einmal werde ich auch noch von der Top vollgeflamet und das gesamte Gegnerteam macht sich lustig... Die &quot;Pre&acute;s&quot; waren ja von sich aus die totalen Bringer (Blitz-Tresh ...) und so kam es das ich nach dem Spiel wutentbrannt beide reported habe. Nach wenigen Minuten wartens dann auf einmal...\r\nWEgen extremer .... permanent gebannt WAAAAS dachte ich und sitze jetzt hier in meinem Stuhl und frage mich warum RIOOOOT.\r\nWarum bekomme ich ohne Vorwarnung und ohne jegliche Gr&uuml;nde (bis auf das Spiel und andere Kleinigkeiten) einen permanenten Ban? Ichw ei&szlig; Riot darf das aber ist das nicht schwachsinnig? Leute ihren Account weg zu nehmen wenn sie nur einen schlechten Tag hatten? Kann man irgendetwas,... egal was machen? \r\nIch wei&szlig; nicht ob das hier irgenjemand versteht und wenn... Bitte mich nicht noch mehr zu flamen :(","replies":[{"poster":"Eazy Yi","date":"2017-06-11T13:03:04.172+0000","up_votes":4,"down_votes":0,"body":"Wenn du nen Perma hast, dann hattest du bereits nen 14 Tage Bann. Dieser gilt als deine letzte Warnung, wenn du dann paar Wochen später flamst, dann wirste halt permgebannt. Du hattest genug Warnungen & Chancen.","replies":[{"poster":"Sałtyy","date":"2017-06-11T20:13:50.069+0000","up_votes":1,"down_votes":0,"body":"Geile is das du für int feeding auch ohne sperre davor instand 14 tage bekommst xD\nFand ich super wenns vorallem nedma inting is xD","replies":[{"poster":"CYPHΕR","date":"2017-06-12T09:09:19.416+0000","up_votes":1,"down_votes":0,"body":"Der Feederbuster ist extrem konservativ eingestellt, d.h. er reagiert eigentlich nur bei sehr eindeutigen Fällen. Hast du denn das Match nach welchem angeblich zu Unrecht der Ban ausgesprochen wurde?","replies":[{"poster":"Sałtyy","date":"2017-06-14T21:47:25.449+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CypherHD,realm=EUW,application-id=KYnfKGf0,discussion-id=wrjZ8sAE,comment-id=000000010000,timestamp=2017-06-12T09:09:19.416+0000)\n>\n> Der Feederbuster ist extrem konservativ eingestellt, d.h. er reagiert eigentlich nur bei sehr eindeutigen Fällen. Hast du denn das Match nach welchem angeblich zu Unrecht der Ban ausgesprochen wurde?\n\nDas is schon fast  6 monate her, daher nein ^^\nIch fand den ban halt einfach unnötig","replies":[]}]}]},{"poster":"Mi3zekatze","date":"2017-06-11T14:47:53.725+0000","up_votes":1,"down_votes":0,"body":"Er MUSS keinen 14 Tage bann gehabt haben ^^","replies":[]}]},{"poster":"ΔRC RΔFUNZΞL","date":"2017-06-11T13:15:18.457+0000","up_votes":2,"down_votes":0,"body":"chat logs bitte mit screenshot","replies":[{"poster":"rip john shelby","date":"2017-06-11T13:29:18.253+0000","up_votes":1,"down_votes":0,"body":"or it didn't happen","replies":[]}]},{"poster":"Martensitic","date":"2017-06-11T16:20:32.209+0000","up_votes":3,"down_votes":3,"body":">Manchmal musste ich kurz meine Meinung vertreten\n\nWie erklär ich das auf die freundliche Tour, hmm...\n\n...okay, versuchen wirs so:\n\n#Wenn man einen 14day hatte, dann ist schluss mit \"mal kurz die Meinung vertreten\". 14day Gebannte Accounts stehen auf der Liste, da ist schluss mit Lustig, Schluss mit mal Augen zudrücken, schluss mit \"mal kurz die Meinung vertreten\".","replies":[{"poster":"Abasin","date":"2017-06-12T06:00:51.513+0000","up_votes":2,"down_votes":2,"body":"Ich geb Dir in der Sache vollkommen recht. Aber bitte schrei (aka grosse Fettschrift) nicht immer so. Das nervt gewaltig und ist extrem offensiv.","replies":[{"poster":"Martensitic","date":"2017-06-12T06:24:37.735+0000","up_votes":3,"down_votes":1,"body":">und ist extrem offensiv.\n\nDa wir hier **nicht** an einer der vielen Amerikanischen Unis sind, in denen es derzeit als chic gilt, alles was einem grade auf den Keks geht zu _\"offensive\"_ oder _\"trigger word\"_ oder _\"harassment\"_ zu erklären (meistens um Professoren zu erpressen), sondern gottseidank in einem Land wo derjenige Präsident wird der tatsächlich die meisten Stimmen bekommt, ist fettdruck eben nicht \"offensiv\".\n\n\"Offensiv\" wäre, jemanden einen Idioten zu nennen, oder ihn wegen seines Rankings zu verspotten. Offensiv wären rassistische, sexistische oder sonstwie diskriminierende Bemerkungen.\n\nUm es kurz zu sagen:\n\"Offensiv\" ist, was die Mehrheit der Gesellschaft als Beleidigend/Diskriminierend/etc. ansieht.\n\nEine Schriftart ist nicht offensiv.\n_(Es sei denn es ist Comic Sans MS, aber dabei Aggressionen zu kriegen ist ein menschlicher Urinstink)_\n\nEs kann sein dass es jemanden nervt.\nDas ist schade, und lag nicht in meiner Absicht.\nAber erwarte nicht dass ich die Art meine Texte zu formatieren ändere, nur weil mir irgendwer im Internet mitteilt, dass er sich davon \"genervt\" fühlt.","replies":[{"poster":"Coopa123","date":"2017-06-12T08:02:26.263+0000","up_votes":3,"down_votes":1,"body":"Muh' Safespace D:","replies":[{"poster":"Abasin","date":"2017-06-12T10:49:53.320+0000","up_votes":2,"down_votes":1,"body":"Safespace ist mir total wumpe, davon halte ich nix. Ich krieg von diesem Geschreibe aber Augenkrebs. Fast jeder Beitrag dieses wahrscheinlich nur zum Belehren erzeugten Accounts enthält solche Schoten, wo er meint anderen sagen zu müssen wo es lang geht. Das geht mit weniger Markup und nachvollziehbaren Argumenten mindestens genausogut, wenn nicht noch besser. Da muss man keinen runterputzen. Ich gehe sogar davon aus, dass er mehrere Accounts hat und diese zum systematischen Downvote unliebsamer Einwände benutzt. Da wäre er nicht der erste.","replies":[{"poster":"Coopa123","date":"2017-06-12T11:31:13.028+0000","up_votes":1,"down_votes":2,"body":"Meine Güte. Die Schrift ist ein bisschen größer als normal. Reg dich mal ab.","replies":[]}]},{"poster":"Martensitic","date":"2017-06-12T08:12:36.469+0000","up_votes":2,"down_votes":1,"body":"Genau mein Gedanke als ich die Postings gelesen hab :-)","replies":[]}]},{"poster":"Abasin","date":"2017-06-12T06:48:08.156+0000","up_votes":2,"down_votes":4,"body":"Grossbuchstaben, Bold Fonts und grössere Schriftgrade gelten in Foren nun mal als genau das, was ich gesagt habe, offensiv. Sie kommen nämlich als Geschrei rüber. Es ist halt schlicht gesprochen das schriftliche ~~akustische~~ (edited) Äquivalent des Niederschreiens. Und ich vermute, dass Dir das durchaus bewusst ist und Du es einfach billigend in Kauf nimmst. Eine Grundregel jeder Rhetorik sollte auch Dir geläufig sein: Es kommt nicht darauf an, was man sagen will, sondern wie es beim anderen ankommt. Und Dein Stil kommt eben bei mir extrem offensiv an, und vermutlich auch bei anderen. Es weckt bei mir obendrein die Assoziation, dass Du gerne andere belehrst ohne selbst belehrt werden zu wollen - weil nicht nötig, da Du alles am Besten weisst. Also ja, kannst gerne tacheles schreiben, hab ich nix dagegen. Aber in \"Zimmerlautstärke\" bitte.","replies":[{"poster":"Martensitic","date":"2017-06-12T08:05:58.111+0000","up_votes":2,"down_votes":1,"body":">Es ist halt schlicht gesprochen das akustische Äquivalent des Niederschreiens.\n\nErstens sind sie das literarische Aquivalent des Schreiens (das Äquivalent bezieht sich auf die Sache die man mit dem Vergleich beschreibt, nicht auf jene mit der man die Sache vergleicht).\n\n>Und ich vermute, dass Dir das durchaus bewusst ist und Du es einfach billigend in Kauf nimmst.\n\nUnd selbst wenn es so wäre, hätte das absolut keine Relevanz.\n\nLaut sprechen, oder sogar rufen, ist nunmal nicht die Definition von \"Offensiv\" wie es im Forum in den Report Optionen verstanden wird. Denn diese sind einfach nur eine billige 1:1 Übersetzung aus der Englischen Version der Forensoftware, und das englische [_\"offensive\"_](https://www.merriam-webster.com/dictionary/offensive?utm_campaign=sd&utm_medium=serp&utm_source=jsonld) hat eine komplett andere Bedeutung als das Deutsche [_\"Offensiv\"_](http://www.duden.de/rechtschreibung/offensiv).\n\nUnd ich lehne mich jetzt einfach mal aus dem Fenster, und vertrete die Meinung dass du die englische Version gemeint hast, als du über mein Posting geschrieben hast. Denn, falls nicht, hast du zwar jedes Recht darüber genervt zu sein, hast aber nichtmal im logischen Rahmen deines Arguments etwas, auf dass du dich berufen könntest um mir zu sagen dass ich anders schreiben solle.\n\nDenn wie oben bereits ausgeführt, die blosse Tatsache dass sich jemand durch etwas \"genervt\" fühlt, ist für sich genommen noch kein Argument.\n\n>Eine Grundregel jeder Rhetorik sollte auch Dir geläufig sein: Es kommt nicht darauf an, was man sagen will, sondern wie es beim anderen ankommt.\n\nDies ist mir in der Tat geläufig.\n\nEin Fehler den viele Menschen machen wenn sie über Rhetorik nachdenken, ist die Annahme Sprachliche Fertigkeit müsse in jedem Fall dazu benutzt werden von allen anderen gemocht zu werden, oder anderen zu gefallen. Das ist nicht zwingend der Fall. Wenn du dich mit der Geschichte der Sophisten beschäftigst, wirst du sehr schnell erkennen, dass Rethorik ein Mittel zum Zweck ist, und die Einsatzmöglichkeiten sehr viel vielfältiger sind.\n\n>Also ja, kannst gerne tacheles schreiben, hab ich nix dagegen. Aber in \"Zimmerlautstärke\" bitte.\n\nWie bereits gesagt:\nWie ich meine Texte formatiere, ist meine Sache.\n\nWenn sich jemand durch eine Formatierung \"genervt\" oder \"gestört\" fühlt, dann ist das nicht mein Problem.","replies":[]}]}]}]}]},{"poster":"OrangeBubble","date":"2017-06-12T06:13:31.129+0000","up_votes":1,"down_votes":0,"body":"**bis auf das Spiel und andere Kleinigkeiten**\n\nWaren wohl zu viele Kleinigkeiten ...........","replies":[]},{"poster":"Gebudsan","date":"2017-06-11T13:46:27.638+0000","up_votes":1,"down_votes":0,"body":"Eine Frage die ich mir hier stelle: Wenn du supporten willst, wieso gehst du nicht in nen Draft Pick und wählst dort Support? Ich hatte es vielleicht in einem von 100 Fällen dass ich wenn ich support als Position genommen habe, diese nicht bekommen habe. \n\nZu dem rest kann ich mich meinen Vorrednern nur anschließen: Du hattest deine Verwarnung und diese ist dauerhaft gültig glaube ich.. Oder nur für die Season?\nich meine wenn du vor 3 Jahren mal nen 14 Tage Ban hattest und dann jetzt wieder auffällig wirst, gibts eben nen Permaban und nicht wieder ne Verwarnung.","replies":[{"poster":"Mi3zekatze","date":"2017-06-11T14:47:01.309+0000","up_votes":1,"down_votes":0,"body":"Falsch. Nach 3 Jahren ist dein Bann \"abgelaufen\" und du gilts als reformed. D.h. die nächste Strafe ist NICHT den Permabann","replies":[{"poster":"Timethief49","date":"2017-06-11T15:30:38.795+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mi3zekatze,realm=EUW,application-id=KYnfKGf0,discussion-id=wrjZ8sAE,comment-id=00050000,timestamp=2017-06-11T14:47:01.309+0000)\n>\n> Falsch. Nach 3 Jahren ist dein Bann &quot;abgelaufen&quot; und du gilts als reformed. D.h. die nächste Strafe ist NICHT den Permabann\n\nNicht unbedingt. Wenn du 3 Jahre nicht spielst bist du kein bisschen weiter wie vor 3 Jahren.","replies":[{"poster":"Mi3zekatze","date":"2017-06-11T16:19:56.912+0000","up_votes":1,"down_votes":0,"body":"Du weißt was ich sagen wollte, Strafstufen laufen ab. Tut mir leid das ich das schwammig formuliert habe","replies":[]}]}]}]},{"poster":"ü ö","date":"2017-06-11T14:21:32.114+0000","up_votes":1,"down_votes":0,"body":"> Warum bekomme ich ohne Vorwarnung und ohne jegliche Gründe (bis auf das Spiel und andere Kleinigkeiten) einen permanenten Ban?\n\nDeine Vorwarnungen waren etwaige CR's **und** der 2 Wochen Bann. Der 2 Wochen Bann heißt fast schon perma, nur duldet man dich noch und gibt dir eine allerletzte Chance - \"Kleinigkeiten\" reichen dann aber schon damit du fliegst. Da hättest du dich mal besser informieren sollen, das wars jetzt.","replies":[]},{"poster":"HyperionCH","date":"2017-06-11T13:38:52.830+0000","up_votes":1,"down_votes":0,"body":"Du hattest also gem. deiner Aussage seit einem Monat keinen ban; also hattest du einen (14-Tage-ban).\n\nStell dir vor: das war die \"Vorwarnung\"! ;)","replies":[]},{"poster":"Lotuskobra","date":"2017-06-11T13:12:37.352+0000","up_votes":1,"down_votes":0,"body":"> WEgen extremer .... permanent gebannt WAAAAS dachte ich und sitze jetzt hier in meinem Stuhl und frage mich warum RIOOOOT.\n\nWeil Riot dir mit allen Strafen vorher schon gezeigt hat, dass es so nicht weitergeht. Du hattest viele Chancen dich zu ändern und den Summoners Code zu akzeptieren, aber du hast sie nicht genutzt. Der Kontext in dem Flame passiert ist egal, flame bleibt flame. Ich möchte glaube ich nicht mal die Chatlogs sehen, ich kann mir fast denken was drin steht.\n\nWarum schreibst du überhaupt etwas negatives, nicht spielrelevantes?\nWarum mutest du die Leute nicht einfach, die rummeckern?\n?\n\nEs gibt genug Wege und Möglichkeiten in Leagze ohne Flame auszukommen, die anderen die geflamed haben, werden ihre Strafen, sofern sie sich nicht ändern auch früher oder später erhalten.\n\nTut mir Leid für deinen Account und die investierte Zeit, aber wer sich nicht ändert muss mit den Konsequenzen leben.","replies":[]},{"poster":"Oikawa Senpai","date":"2017-06-11T13:09:35.963+0000","up_votes":1,"down_votes":0,"body":"Dann häng doch bitte die Chatlogs an damit wir diskutieren können. Es wird dir zwar wahrscheinlich nicht mehr auf dem Account helfen, jedoch steht es dir frei einen neuen anzufangen. \nEs denken leider alle die einen Permabann bekommen haben das sie nichts falsches geschrieben haben... Blamen gehört btw auch zum Flame dazu.\nUnd ich denke mal das es niemanden Interessiert was dir vorgeschichte ist, ob die anderen angeblich angefangen haben oder schlimmeres geschrieben haben oder nicht. DU wirst für dein Verhalten bestraft und die anderen für Ihr eigenes.\nDu kannst auch bei besonderes extremen Flamen einige Stufen überspringen (z.b. durch Homophobie oder Rassismus etc.) \nUnd scheinbar musst du ja doch etwas schlechtes geschrieben haben nach deiner Aussage \"Leute Ihren Account weg zunehmen wenn sie nur einen schlechten Tag haben\".\nUnd genau da is eines der Probleme, du schreibst nur das du geflamet wurdest und alle anderen so böse sind, jedoch liest es sich beim ersten mal so als ob du nix geschrieben hättest. Kommst dann aber mit der \"schlechten Tag\" Ausrede.\n\nTL: DR\nChatlogs or it didnt happend und nein du kannst da nix mehr machen","replies":[]}]}