{"poster":"AwesomeSlash55","date":"2017-10-08T06:37:27.681+0000","title":"How to get an S by being a jg?","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"I am a jg main and I have lvl 4 kayn and I realy want lvl 5 but I need 2 S&#039;s but I do not know how to get them but just getting lots of kills. I also know u need lots of cs. If someone knows how to get it and the expatations to get an S (for example 10mins in 5 kills and 100cs from a jg) tell me please.\r\nThanks","replies":[{"poster":"Akkordian Zoeve","date":"2017-10-08T07:05:10.254+0000","up_votes":3,"down_votes":0,"body":"You don't need S ranks at all to go from Mastery 4 to Mastery 5 :)\n\nI'm guessing you meant Mastery 5 to Mastery 6?\n\nAs a Jungler that gets S ranks every other game, I've noticed a few things:\n\n1. You *need* good CS over most things. 100 CS is not enough. I am consistently getting 200+ at 30 minutes. This mainly requires understanding Jungle rotations, holding/shoving lanes, and Counter-Jungling.\n\n2. I am not sure how much Counter-Jungling counts, but I am constantly in the enemy Jungle and taking their camps. This then leads to getting more CS, which leads to getting items sooner, which leads to kills over the enemy Jungler.\n\n3. Wards are good. Not just for a number to place, but also to keep you safe when Counter-Jungling.\n\n4. Naturally, a decent KDA is good. I have gotten S ranks with a score of 12/9, but then I had insane CS numbers, took most objectives, had an 85+% kill participation, etc. Trying to reduce your deaths will help a lot. Getting an S is much easier if you're 10/3 than 12/9.\n\n5. As mentioned in the previous point, kill participation is a good pointer, as it shows how much of an impact you had in the game. You can be 1/0, but have 100% KP because there's only been one kill all game, or you can be 20/0 but have 20% KP because there have been 100 kills.\n\n6. Gold and Objectives are other important factors. If you are getting a lot of towers (or even damage onto towers), securing all/most dragons and Barons, etc. then that is a good start. This also leads into gold advantages.\n\nI hope this all helps ❤\n{{sticker:sg-ahri-2}}","replies":[]},{"poster":"Azirious Mistake","date":"2017-10-08T21:33:13.490+0000","up_votes":1,"down_votes":0,"body":"Smite Kayn top = profit??? The game will think you're jg since you take smite but you just go top, take all the CS, split to inhib and just be a no fear dominator all game. Let me know if this works.","replies":[]}]}