{"poster":"zusSILENCER","date":"2016-04-14T08:13:37.323+0000","title":"All of My Thoughts on Mac's Bugs","subforum":"Report a Bug","up_votes":16,"down_votes":1,"body":"Guys a big portion of the players are mac users. Don&#039;t understand why we are getting left out. I mean we are just getting attention on this one sound bug and nothing else, we aren&#039;t getting any feedback from the actual teams working on a fix so my conclusion is that there are no teams working on it. If this happened on PC in less than a week this would have been resolved but nooooo, who cares about mac. I mean like there are many other bugs which have never been fixed. I&#039;m talking about Draven&#039;s spinning axes, thresh&#039;s souls, malzahar&#039;s skills and many others which have been left behind. Mac is becoming unplayable and if you continue leaving behind bugs then you will lose us mac players which means that your revenues will lower by a lot. We are not a small part of the community we are big and still important enough for you to care.","replies":[{"poster":"Tg8RCCWpor","date":"2016-04-14T14:43:12.790+0000","up_votes":8,"down_votes":1,"body":"It's nothing to do with whether or not Riot 'cares'.\n\nRiot cannot assume responsibility for this issue without backlash, in the form of breaking service. It's been five weeks now. I've lost one month of gameplay due to malicious neglgance on behalf of he whole Riot team. Remember Riot poduced six hundred million dollars in revenue last year.\n\nPlease keep posting\nPlease demand updates\nPlease use your little bit of power to make all of us heard. Each one of us has to try. Post in all of e threads.\nDown vote anything by Riot staffers which doesn't clearly communicate answers.\nWe are fans of the game and deserve better treatment.\n\n-paleo\n\nPermalink","replies":[]},{"poster":"YlmvjOBMpz","date":"2016-04-14T14:56:07.513+0000","up_votes":6,"down_votes":0,"body":"Keep posting. Keep demanding an answer. \nWe are fans. We should always demand more.","replies":[]},{"poster":"XxGbC0gPRz","date":"2016-04-14T15:05:20.593+0000","up_votes":5,"down_votes":0,"body":"Five weeks and counting and Riot never said a word about this. Boo!","replies":[{"poster":"moonstones","date":"2016-04-19T00:58:14.543+0000","up_votes":1,"down_votes":1,"body":"We have been giving updates, the most recently [on the 16th](http://boards.euw.leagueoflegends.com/en/c/bug-reports-eu/jT9W0Jc1-16-04-16-update-on-mac-performance-issue). :)","replies":[]}]},{"poster":"BridgeKeep","date":"2016-04-14T08:25:26.048+0000","up_votes":5,"down_votes":0,"body":"I agree,\n\nbeing a mac player who is stuck in bronze 4, SIMPLY BECAUSE I LAG SO BAD I CANT CATCH MY AXES. Ticks me off.  I was climbing steadily, and now I'm lagging so badly in games that I can't play.  I'm about to put the game up until they patch this crap.  I'm a long time player who reports bugs and tries to help the community, but how can I when the gameplay is so awful?  Riot, please fix all this!  Stop telling us it's just our internet because it isn't just me like you made it seem.\n\nBridgeKeep","replies":[]},{"poster":"YlmvjOBMpz","date":"2016-04-14T15:32:23.032+0000","up_votes":3,"down_votes":0,"body":"Mac bugs","replies":[]},{"poster":"XxGbC0gPRz","date":"2016-04-16T20:24:47.446+0000","up_votes":1,"down_votes":0,"body":"Z","replies":[]},{"poster":"Sirius GG","date":"2016-04-14T16:21:14.650+0000","up_votes":1,"down_votes":0,"body":"Btw, will the Linux/Unix client come out finally?\nThere are pretty much as Linux users as Mac users (Mac has around 0.1% more market share).\n\nhttps://en.wikipedia.org/wiki/Usage_share_of_operating_systems\nhttps://en.wikipedia.org/wiki/Usage_share_of_operating_systems#/media/File:Operatingsystem_market_share.svg","replies":[]},{"poster":"moonstones","date":"2016-04-19T01:01:21.488+0000","up_votes":1,"down_votes":1,"body":"Hey zusSILENCER -\n\nWe do understand that we have a large portion of Mac players, and we certainly aren't intentionally leaving you guys out in terms of having a less than optimal performance. We realize it sucks. \n\nIn this particular case, it was something that involved code changes, and the fix was not as simple as we had initially intended for it to be. We also wanted to fully test any fix we had before releasing it, as we wanted to ensure a. the fix worked, and b. it didn't cause any upsets anywhere else. \n\nThat said, we have been giving updates when we can - most being that we're aware and are working on it - but we did post a [more informational post](http://boards.euw.leagueoflegends.com/en/c/bug-reports-eu/jT9W0Jc1-16-04-16-update-on-mac-performance-issue) on the 16th. TL;DR - we are looking to have a fix in for Patch 6.8. \n\nThanks for your patience.","replies":[]}]}