{"poster":"RORAN 7","date":"2019-01-30T14:27:41.605+0000","title":"Idea per un nuovo champ","subforum":"Discussioni generali","embed":{"description":null,"url":"https://goo.gl/images/Ad5F89","image":"https://i.ytimg.com/vi/LUAAmXXzmg8/maxresdefault.jpg"},"up_votes":1,"down_votes":0,"body":"Mi &egrave; venuta tipo in pochi minuti l&#039;idea per un nuovo champ, ditemi che ne pensate...\nil concept dovrebbe essere come quello nel link e il suo ruolo originale sarebbe jungler meelee\nPASSIVA: la passiva ti consente nel momento in cui resti fermo per due secondi di posizionare nel punto in cui ti trovi una &quot;bambola&quot; (massimo 4 nominate Q,W,E,R) a tua stessa immagine e somiglianza (tipo clone di shaco o torre di heimer) che star&agrave; ferma per tutto il tempo.\nQ: la q ti attiva l&#039;allucinazione. L&#039;allucinazione consiste nel renderti invisibile a chiunque stia vicino alla bambola (range di mezza lane di gioco iniziale tipo) non rendendoti visibile nemmeno se gli stai attaccato. in questa posizione puoi colpire minions, mostri della giungla e torri (non puoi attivare abilit&agrave; o colpire champ salvo se ritorni visibile cliccando, ma se ricliccando stai troppo vicino ad un champ nemico vieni stunnato per un breve periodo) ma non puoi guadagnare exp o oro con la Q attiva\nW: la w consiste in una specie di colpo roteante (tipo il colpo di zed) e chiunque ne viene colpito viene rallentato\nE: la E &egrave; la particolarit&agrave; del champ. Consiste in un colpo che si alimenta a cariche (tipo la q di morde) che aumenta il danno fisico contro mostri e minion di un tot ogni colpo di autoattacco che dai appunto a mostri e minion (anche torri). nel momento in cui colpisci un campione gli infliggi tot danni puri in base alle cariche attive e il colpo si resetta perdendo tutte le cariche (non si resetta se il champ viene ucciso con il colpo della E).\nR: nel momento in cui si clicca la R la schermata delle mosse varia. le 4 mosse diventano le 4 bambole (Q,W,E,R) e alla pressione di una la bambola cliccata si attiver&agrave;. All&#039;attivazione la bambola inizia a correre verso il champ a lei pi&ugrave; vicina aumentando gradualmente la velocit&agrave; di movimento e ignorando ogni stun o rallentamento, da qui si possono fare due cose: o lasciare la bambola correre verso il champ nemico provocando uno stun (tipo q di janna) per poi sparire. O alla ri-pressione della R ci si teletrasporta (lasciando nel posto in cui si era un&#039;altra bambola) al posto della bambola (continuando ad aumentare la velocit&agrave; di movimento ignorando stun e rallentamenti) potendo combattere utilizzando tutti i propri poteri. Ma dal momento in cui tu missi un potere (la w in tal caso) o applichi un autoattacco comincerai a perdere gradualmente velocit&agrave; di movimento rallentando di molto. Nel momento in cui si &egrave; passato alle sembianze della bambola non puoi essere ucciso, nel senso se vieni ucciso ritorni nella bambola lasciata all&#039;inizio sul posto lasciando morire quella in corsa. Inoltre nel momento in cui si &egrave; nelle sembianze della bambola attiva ri-cliccando r puoi tornare nella bambola lasciata all&#039;inizio sul posto facendo morire all&#039;istante quella in corsa. Quest&#039;ultime azioni si possono fare in qualsiasi momento finche la bambola lasciata sul posto rimane. La bambola lasciata sul posto esplode 3 secondi dopo aver missato un colpo o aver applicato un autoattacco\nCOMBO: lo scopo del champ &egrave; grazie alla Q e alla E aiutare a farmare una lane senza che il champ nemico se ne accorga (se hai buon occhio te ne dovresti accorgere per&ograve;) e senza rubare farm o oro. Al che alimentata la E abbastanza si pu&ograve; sferrare l&#039;attacco potente contro il champ in lane attivando la finale o disattivando la Q dentro un bush lontano dal champ nemico. La combo con la R &egrave; semplice, prima di un fight si lascia una bambola nelle vicinanze e appena si nota il momento buono la si lascia partire, si riattiva la r, una volta in mischia si rallentano i champ nemici con la W (che, se non missata non termina l&#039;aumento della velocit&agrave; e non disattiva le cariche) e focussato il mago o l&#039;adc lo si shotta con la E carica (Certo se si &egrave; bravi lo si uccide prima, ma se la bambola riesce a raggiungere velocit&agrave; di 600 la vedo dura). A questo punto vi si star&agrave; applicando il rallentamento e avrete la possibilit&agrave; (3 secondi) di ritornare nella bambola di partenza uscendone indenni. Secondo me sarebbe un buon assassino, che con le cariche della E si troverebbe a farmare comodo in giungla, voi che ne pensate?\n\nSi potrebbe anche fare che mentre si farma con la Q attiva i soldi dei minions vanno al compagno pi&ugrave; vicino, aiutandolo in tutti i sensi a farmare. Ah e ovviamente la prima R (l&#039;attivazione della bambola) non &egrave; applicabile se si &egrave; in combattimento senn&ograve; ci si salverebbe sempre mentre si sta per morire. Sennò un'altra idea che mi è venuta in questo momento è che il colpo della W applica i danni puri della E a tutti i champ colpiti, resettando le cariche se non si uccide nessuno","replies":[{"poster":"Apokàlypsis","date":"2019-01-30T17:21:53.597+0000","up_votes":1,"down_votes":0,"body":"Personalmente penso che gli sviluppatori di  the Conjuring farebbero tranquillamente causa alla riot per plagio. Si vocifera pure su un possibile spin off su  Crooked man","replies":[{"poster":"RORAN 7","date":"2019-01-30T20:01:23.113+0000","up_votes":1,"down_votes":0,"body":"vabbè non lo devono fare identico, lo fanno simile cambiando qualcosa","replies":[]}]}]}