{"poster":"iLMao85","date":"2015-07-07T12:36:08.789+0000","title":"Account 'rubato'","subforum":"Aiuto e supporto","up_votes":0,"down_votes":0,"body":"Buongiorno a tutti, \r\ndopo aver giocato ieri sera con il mio team, oggi ho provato a collegarmi ma non sono riuscito. Ho subito sospettato che mi avessero hackerato l&#039;account, non riuscivo a loggare nemmeno nel forum. Grazie ad un pc con cui avevo lasciato la sessione aperta sono riuscito ad entrare nel profilo e scoprire che ovviamente la mail &egrave; stata modificata, ora mi ritrovo una nuova psw e un indirizzo mail di riferimento a me sconosciuto. La cosa incredibile &egrave; che vi sto scrivendo appunto dall&#039;account in questione...\r\nHo gi&agrave; mandato una richiesta alla Riot, c&#039;&egrave; altro che posso fare? \r\nCiao grazie a tutti per l&#039;attenzione,\r\n\r\np.s. Ho 30 anni e buone conoscenze informatiche, sicuramente non ho cliccato su link particolari, giusto per intenderci :)","replies":[{"poster":"iLMao85","date":"2015-07-10T15:36:17.278+0000","up_votes":1,"down_votes":0,"body":"Scusate se uppo nuovamente, non ho ancora avuto nessuna risposta per il ticket che ho aperto, solitamente quanto tempo ci vuole per avere una risposta e quantomeno essere tranquilli che non venga spammato nulla dall'account in attesa del recupero?\nRingrazio nuovamente chiunque si interessi della cosa, :) ciao a tutti","replies":[]},{"poster":"iLMao85","date":"2015-07-08T15:12:26.752+0000","up_votes":1,"down_votes":0,"body":"Scusate se uppo il post, non ho ancora avuto risposta dal supporto, ho paura che presto non riuscirò nemmeno a postare sul forum. Per ora non ha giocato nessuna partita, non si corre il rischio che dal mio account spammi ad amici o cose simili? \nCiao grazie ancora per l'interessamento.","replies":[]},{"poster":"CapitanAshi","date":"2015-07-07T15:22:02.316+0000","up_votes":1,"down_votes":0,"body":"Hai per caso cliccato su uno di questi link , che in questi giorni vengono spammati qua sul sito ?","replies":[{"poster":"iLMao85","date":"2015-07-07T15:29:43.133+0000","up_votes":1,"down_votes":0,"body":"No purtroppo non ho idea di come sia potuto succedere, sicuramente non ho cliccato nessun tipo di link, non ho dato le mie credenziali a nessuno. Ho il dubbio che siano entrati nella mia mail in quanto ho notato di aver ricevuto questa mattina una mail da accounts@riotgames.com conn questa dicitura: You've recently requested a change to your Riot Games account associated with: XXXXXXX  To complete this process, enter the following special access code into the security dialog: XXXXX.\n\nGrazie per l'interessamento, se non violo nessuna regola vi dico la parte di mail non mia che leggo ******ster12@hotmail.com","replies":[]}]}]}