{"poster":"kamakazzi","date":"2020-01-28T05:15:05.535+0000","title":"Who is your AP Bruiser of choice?","subforum":"Gameplay","up_votes":1,"down_votes":2,"body":"Looking for a new champ. I used to main Diana mid as an AP bruiser with Aftershock. For me it played as the perfect counter to mage/assasin builds. They could almost never do enough burst to get through my shields &amp; high armor/mr. I won almost every trade. After the Diana rework it seems bruiser Diana has been completely gutted. You either go full assassin or get wrecked. \r\n\r\nSince that is not my play style, I'm looking for a new mid AP bruiser champ to run with. What are the best options right now? Opinions appreciated!","replies":[{"poster":"Disco Swiss","date":"2020-01-28T05:33:02.993+0000","up_votes":3,"down_votes":0,"body":"{{champion:27}} all you need.","replies":[]},{"poster":"ROYALR3IGN","date":"2020-01-28T15:41:35.671+0000","up_votes":1,"down_votes":0,"body":"Swain hasn't been said yet! Grag, Lissandra, Nidalee, Sylas, and Galio can also be kinda beefy for when you want to go in.","replies":[{"poster":"kamakazzi","date":"2020-01-29T05:39:28.012+0000","up_votes":2,"down_votes":0,"body":"Ya I'm thinking Grag or Sylas. Just been hearing about his nerfs though but some really like him still.","replies":[]}]},{"poster":"Warmas","date":"2020-01-28T10:50:58.627+0000","up_votes":2,"down_votes":0,"body":"{{champion:82}} is the only AP bruiser, maybe {{champion:27}} is one too. They are terrible at mid any ranged champ with 2+ IQ will destroy them as far as tankiness goes {{champion:157}}  is much more tankier then many with the shield and wind wall on lane, {{champion:34}} has the egg, {{champion:245}} can just reset any fight, {{champion:105}} invincibility, {{champion:84}} shroud, {{champion:103}} can jump away 3 times also charm when enemy tries to jump on you, {{champion:45}} insanely safe because of his cage and many more.\n\nDon't play bruisers they have been a joke/troll pick class for a year now.","replies":[{"poster":"PhillipDaGreat","date":"2020-02-10T00:49:15.238+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Warmas,realm=EUW,application-id=3ErqAdtq,discussion-id=iERsjYtd,comment-id=0003,timestamp=2020-01-28T10:50:58.627+0000)\n> {{champion:34}} has the egg\n\nEggnivia is super squishy. Anivia is super squishy.\n\nRealistically speaking, eggnivia is only relevant against early-mid game tower dives and in games where you have a solid team. Anivia also has no escapes. Once you get close enough to pop her, she pops.","replies":[]},{"poster":"kamakazzi","date":"2020-01-29T05:38:21.509+0000","up_votes":1,"down_votes":0,"body":"Haha maybe so...","replies":[]}]},{"poster":"kda akali","date":"2020-02-10T00:32:57.212+0000","up_votes":1,"down_votes":0,"body":"{{champion:517}} {{champion:79}} Grag is super fun but not super meta, some people still make it work well though. Sylas is alright rn too, he is kind of weak because of nerfs I've heard. \n\n{{champion:3}} {{champion:54}} {{champion:31}} {{champion:32}} Tankier but u can build build ap offtank with them. Chogath is also very good with glacial right now. Malphite can go the oneshot build or a tank build, he's very flexible. Galio is good but hard to utilize imo without a super coordinated team.\n\n{{champion:8}} {{champion:518}} {{champion:127}} {{champion:68}} Sort of like mage/bruiser hybrids. Neeko and Liss can take aftershock and become super tanky.","replies":[]},{"poster":"Troll Slaiyer","date":"2020-02-09T17:42:41.752+0000","up_votes":1,"down_votes":0,"body":"grag is rare and can pull off sick moves when mastered.. singed is satisfying to melt peeps i suppose.","replies":[]},{"poster":"Ragnaveil","date":"2020-01-28T15:29:21.069+0000","up_votes":1,"down_votes":0,"body":"Mine use to be Sylas before Riot got nerfbat giddy and started butchering the shit out of him with rework after rework.\nMorde's your only choice cuz Singed requires people to stay in his poison and have 0 braincells. And Rumble just goes full AP cheesemode mid, so theres that.","replies":[]},{"poster":"ElMcChicken01","date":"2020-01-28T08:20:03.481+0000","up_votes":1,"down_votes":0,"body":"{{champion:31}}","replies":[]},{"poster":"Theorex","date":"2020-01-28T05:59:00.827+0000","up_votes":1,"down_votes":0,"body":"Ryze?  Vlad?  \n\nJust saying, AP Bruisers go by the word battle mages.  If Diana counts its fair game for Ekko, Sylas, Ryze, Vlad, Singed, etc.\n\nChampions that can dish out damage and take a bit of damage :)","replies":[]}]}