{"poster":"Mosifus","date":"2015-07-08T16:35:10.624+0000","title":"Gnar's tusks turned to fangs in new Gentleman Gnar skin?","subforum":"Concepts & Creations","embed":{"description":null,"url":"http://ddragon.leagueoflegends.com/cdn/img/champion/splash/Gnar_2.jpg","image":null},"up_votes":1,"down_votes":1,"body":"I absolutely love the new Gnar skin that is coming out but I was just wondering if anyone knows why in the splash art his tusks are now fangs?  Mainly curious because I want to cosplay Gnar&#039;s skins at some point and want to make accurate teeth for both his Gentleman Gnar skin and Dino Gnar skin.","replies":[{"poster":"GreenLore","date":"2015-07-08T22:32:39.125+0000","up_votes":1,"down_votes":0,"body":"Lol I actually didn't notice that there was a picture of mega gentleman gnar in the splash art.\nBut anyway:\nIts because Gentleman mega gnar doesn't have tusks.\nhttp://i.ytimg.com/vi/KQCRDSCe4zw/maxresdefault.jpg","replies":[{"poster":"Mosifus","date":"2015-07-11T15:05:03.552+0000","up_votes":1,"down_votes":0,"body":"It took me a moment as well to see him in the ripped up picture frame. I really enjoy the unique ways they incorporate his Mega Gnar form into the splash art.","replies":[]}]},{"poster":"moonstones","date":"2015-07-08T18:15:32.730+0000","up_votes":1,"down_votes":0,"body":"Hey Mosifus,\n\nThat's awesome that you want to cosplay Gnar! You should definitely post photos when you're finished, I've love to see them! \n\nThe in-game model also has a fang, so it'd be accurate to give your Gentleman Gnar fangs, as opposed to tusks. :]","replies":[{"poster":"Mosifus","date":"2015-07-11T15:04:16.719+0000","up_votes":1,"down_votes":0,"body":"I most definitely will.  Thank you for clarifying everything for me and I can't wait to see more gorgeous and amazing splash arts and skins. ^.^","replies":[]},{"poster":"Renthaeus","date":"2015-07-08T18:17:37.913+0000","up_votes":1,"down_votes":0,"body":"Yea but when he turns into Mega, he has tusks again. This Gnar doesn't have tusks like his other skins.","replies":[{"poster":"Mosifus","date":"2015-07-11T15:03:23.931+0000","up_votes":1,"down_votes":0,"body":"I believe all of the Mega Gnars so far have both fangs and tusks but I was also just more curious about the mini gnar form for my cosplay. ^.^","replies":[]},{"poster":"moonstones","date":"2015-07-08T18:37:49.850+0000","up_votes":1,"down_votes":1,"body":"Yup, his Mega Gnar form does have tusks! I was comparing the splash, which is Mini Gnar, to the Mini Gnar model in the game. :]","replies":[]}]}]}]}