{"poster":"I Am The Rock","date":"2016-05-05T00:15:29.631+0000","title":"Xerath Riot!","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Gente hermosa de riot, solicitamos los main xerath, que no alejen la camara cuando activas ulti, perdes precisi&oacute;n, necesito una respuesta para saber si esto es posible... chauu{{summoner:4}}","replies":[{"poster":"LeonxLoL","date":"2016-05-05T01:14:43.729+0000","up_votes":2,"down_votes":0,"body":"perdes precisión porque no estas acostumbrado al cambio de cámara, es un poco de practica {{champion:101}} \nPD: no hables por todos los main xerath :v","replies":[]},{"poster":"Ez Oops","date":"2016-10-30T23:20:04.767+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=I Am The Rock,realm=LAS,application-id=v7qsfXsE,discussion-id=QqzqtGYV,comment-id=,timestamp=2016-05-05T00:15:29.631+0000)\n>\n> Gente hermosa de riot, solicitamos los main xerath, que no alejen la camara cuando activas ulti, perdes precisi&amp;oacute;n, necesito una respuesta para saber si esto es posible... chauu{{summoner:4}}\n\nTotalmente deacuerdo contigo!!","replies":[]},{"poster":"Gy NazaBoy92 yG","date":"2016-05-05T00:22:42.529+0000","up_votes":1,"down_votes":0,"body":"Siendo main, tenes que saber que si sacan el alejamiento de camara no te da el rango de  ataque para ver donde mrd tiras las bolas...\natte. only ADC :* {{summoner:4}}","replies":[{"poster":"Ez Oops","date":"2016-10-30T23:19:20.140+0000","up_votes":1,"down_votes":0,"body":"eso se hace con rapidez de mouse los main xerath como yo lo haciamos asi ahora es totalmente molesto el alejamiento de camara.","replies":[]},{"poster":"La corrupción","date":"2016-05-05T01:50:18.090+0000","up_votes":1,"down_votes":0,"body":"only jhin Kappa","replies":[]}]},{"poster":"maxxisrae","date":"2016-05-06T03:58:52.675+0000","up_votes":1,"down_votes":0,"body":"Hola gente de Riot game. No se si leen estos comentarios pero acabo de usar a xerath y me gusto que aumenten el numero de disparos por nivel, pero lo que realmente nadie pidió y nunca tubo quejas es la distancia de la cámara al lanzar su definitiva. Nos disminuye mucho la precisión y no es tan cómodo como antes solía ser. Todos los que usamos xerath sabemos y tenemos muy en claro como posicionarnos y cuando utilizar esta habilidad, y realmente no nos preocupa tanto los ataques que nos hagan, si quieren ayudar en ves de alejar la cámara, amplíen el radio de visión en el mapa cuando la tiramos. No se, se me acaba de ocurrir, pero por favor, si leen esto vuelvan a como era, no seremos muchos los que lo usamos pero nos gusta el campeón. Gracias por entender.","replies":[{"poster":"Ez Oops","date":"2016-10-30T23:18:04.461+0000","up_votes":1,"down_votes":0,"body":"totalmente deacuerdo no hay nada maas molesto que se aleje la camara, nose puede apreciar bien los movimientos de el heroe enemigo y se pierde mucha precision.","replies":[]}]},{"poster":"NicolásPandy","date":"2016-10-04T15:13:04.041+0000","up_votes":1,"down_votes":0,"body":"Sí, estaría muy bien esto, ya que si lo tiramos de cerca nos facilita matar, y  xerath no está roto, creo que deberíamos revivirlo.\nY como main xerath, estaría bien que le pongan algo de movilidad por ejemplo luego de que tire una habilidad tiene 2 sg se le sube un 10% la velocidad de movimiento... es un campeón que no estará roto en este meta así que estaría muy bien que le dieran solo ese toque de movilidad, que facilitaría a los main xerath carrear una partida, por ejemplo, en elos bajos.","replies":[]},{"poster":"I Am The Rock","date":"2016-05-05T20:15:08.670+0000","up_votes":1,"down_votes":0,"body":"WTF? si te da el rango si moves la camara, pero perdes presicion al estar mas alejada la camara, los champs se ven mas chicos, y el redondel mas chico, a mi gusto no sirve.","replies":[]}]}