{"poster":"cajaru977","date":"2017-02-11T18:12:31.864+0000","title":"Ideas de skins 2: \"Ziggs Basketbolista\"","subforum":"Creaciones de la comunidad","up_votes":4,"down_votes":3,"body":"Bueno facil sencillo y pa` toda la familia\n\nAspecto visual: Facil, ziggs vestido como un jugador de basket (en el equipo &quot;Riot&quot; y que el uniforme sea blanco con el logo de riot, el numero que tenga ziggs o puede ser el 23 o el 3) y cambia las bombas por pelotas de basket \n\n\n\n\nTaunts: *Que haga girar una pelota en su dedo \n* Que haga cambios de mano por delante,abajo y atras (los que juegan basket entenderan) y mientras hace los cambios que le explote la pelota\n*El baile podria ser cualquier baile que haya hecho un jugador famoso de la NBA (Curry,Iverson,Jordan,etc)\n\nP=Una pelota en llamas\n\n\nQ= No es muy dificl de entender, basicamente cambias la bomba por la pelota, y le agregas un efecto de sonido como si la pelota rebotara (Quedaria muy bueno que en la Q ziggs haga como si tirara al aro)\n\nW= Esta no la tengo muy clara, podria poner tanto como una pelota, como un trampolin que usan en algunos torneos de clavadas. Pero quedaria muy bien que si ziggs esta arriba de la W cuando explote, que en el aire diga &quot;Air ziggs&quot; o &quot;Clavada va&quot;\n\n\nE= &iquest;Mini pelotas de basket? aca realmente estoy seco\n\n\nR=La ulti me parece que ya saben como va a ser UNA PELOTA DE GOLF GIGANTE (okno)\nLa ulti enrealidad seria una pelota de basket, pero en el area donde vaya a caer la pelota exista un aro. \nEn la R quedaria hermoso que cuando tire diga &quot;VA DE 3 Y..... (En caso de que le pegue o mate a un enemigo) CHAS&quot;\n\n\n\n\nObviamente tendria que tener alguna interaccion con Darius rey de las clavadas\nejemplo:&quot;Puedes ser el rey de las clavadas darius, pero yo soy el rey de los triples&quot;\n\n\n\n\nIdea anterior\nhttp://boards.las.leagueoflegends.com/es/c/reclutamiento/5EG9BOoT-thresh-el-pescador-idea-de-skin\n\n\nGracias por su atencion gente :3","replies":[{"poster":"Hunny Boop","date":"2017-02-12T00:58:29.798+0000","up_votes":1,"down_votes":0,"body":"Dunkmaster ziggs","replies":[]},{"poster":"Shion Archimago","date":"2017-02-11T18:20:18.984+0000","up_votes":1,"down_votes":0,"body":"creo q le quedaria mejor una de dodgeball","replies":[]}]}