{"poster":"Dedahhh","date":"2017-10-05T20:41:48.784+0000","title":"Anyone else can't log in currently?","subforum":"[ARCHIVED] Help & Support","up_votes":4,"down_votes":0,"body":"Been playing normal games all day. Got off for a bit and got back on to play ranked with a friend. After we got first blood I started lagging. My ping went up to 90 but it felt like it was in the thousands. Couldnt even move or ping. Randomly got disconnected and had to close client. Haven't been able to sign back in yet...Lost ranked game because of it","replies":[{"poster":"Broporo","date":"2017-10-05T21:47:06.041+0000","up_votes":1,"down_votes":0,"body":"We've started noticing some login issues around 1:20 and put up a [**Live Incident tracker**](https://boards.na.leagueoflegends.com/en/c/live-incident-breakdown-na/EdHm3dWu-105-unable-to-loginstuck-at-authenticating). Apologize for the rather slow update on my part as I've been trying to help figure out the main issue myself as well. It does look like we're starting to come out of this login issue, but please comment any issues [**over here**](https://boards.na.leagueoflegends.com/en/c/live-incident-breakdown-na/EdHm3dWu-105-unable-to-loginstuck-at-authenticating) so that we can track this better!","replies":[{"poster":"Poopstar Poopy","date":"2017-10-06T13:56:22.873+0000","up_votes":1,"down_votes":0,"body":"I'm still having the authentication problem. It worked briefly 9~10 hours ago but it's not working again. I'm in Budapest Hungary and my ISP is UPC Magyarorszag.","replies":[]}]},{"poster":"Sexico","date":"2017-10-06T01:31:32.783+0000","up_votes":1,"down_votes":0,"body":"Im getting the error \"We're unable to log you in because you may be offline\" again....Ive followed all the steps to fix it, but nothing works, its happening on both my laptop and PC. is this the same thing?","replies":[]},{"poster":"MaroModo","date":"2017-10-05T21:09:26.068+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-janna}}  so so sad..","replies":[]},{"poster":"VERDILINE","date":"2017-10-05T20:47:39.062+0000","up_votes":1,"down_votes":0,"body":"Yeah I was in a game then i got disconnected with 500 ping and now it just says authenticating when trying to login.\n\nI am also a Spectrum user","replies":[{"poster":"TrueSplitzer","date":"2017-10-05T20:48:46.898+0000","up_votes":1,"down_votes":0,"body":"I'm also a Spectrum user, who got affected by their server fuck up the other day, but everything else was running fine.  Like, I didn't lose internet, I checked my speed, everything was fine, EXCEPT for League having problems with frame rate and normal ping lagging me hard.","replies":[{"poster":"VERDILINE","date":"2017-10-05T21:08:40.730+0000","up_votes":1,"down_votes":0,"body":"yeah i started lagging and it just said i had 80 ping till it 100% dced me","replies":[]}]}]},{"poster":"MaroModo","date":"2017-10-05T20:46:51.991+0000","up_votes":1,"down_votes":0,"body":"Yeah seems to be an issue happened to me and few others I saw who posted","replies":[{"poster":"Velice","date":"2017-10-05T21:08:10.809+0000","up_votes":1,"down_votes":0,"body":"Hung on login authintacation *sad face","replies":[]}]},{"poster":"MorbeKaiser","date":"2017-10-05T20:53:42.889+0000","up_votes":1,"down_votes":0,"body":"I'm getting the same issue. Lagged out of my last game even though my ping was only 70 or so. ALl other internet functions are working just stuck on Authenticating... Fortunately my game was ending so we got the win and that sweet lp.","replies":[]},{"poster":"King Of Tyrants","date":"2017-10-05T21:12:51.869+0000","up_votes":1,"down_votes":1,"body":"I have the same issue, also a Spectrum user... Let me guess RIOT... You plan on screwing my rank up just like you did the other day with no loss forgiven on the same issue","replies":[]}]}