{"poster":"KanagaWave","date":"2016-08-18T20:15:47.998+0000","title":"A nice request","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"i've been playing Shen for a very long time and i love him very much and i see the skins he has availabe in the store are kind of... lackluster for a shortness of words and was wondering if i can buy the yellow jacket skin for 1380 rp or some other way of earning it or if i show proof of my birthday i could get it on November 7th or any way i truly have supported you guys since 4th season i would love it from you guys \r\n\r\nsincerely, IBroughtBear\r\n\r\nP.S. i will do any form of battlling or in game terms to get the skin it is truly my favorite or even frozen but i really like yellow jacket my uncle is a fan or mortal kombat and its just fitting for me to have it not that i am mandating that i have it, just requesting","replies":[{"poster":"Porocles","date":"2016-08-18T20:32:49.474+0000","up_votes":2,"down_votes":0,"body":"I appreciate your passion for Shen, and admire the honor you wield to obtain his skin!  As Zombiemaster mentioned, Yellow Jacket Shen is a [legacy skin](https://support.riotgames.com/hc/en-us/articles/201752944-Guide-to-Legacy-and-Limited-Skins) so there's a chance that he can reappear at some point!  Unfortunately, I don't know when but any updates will be posted at our [Sales ](http://na.leagueoflegends.com/en/news/store/sales)page.  Get over there, and bookmark it!","replies":[]},{"poster":"Zombiemaster","date":"2016-08-18T20:19:10.868+0000","up_votes":2,"down_votes":0,"body":"Yellow Jacket Shen is a legacy skin and thus will return whenever Riot decides to open the Legacy Vault again. Until then, though, the only way to get it would be through Mystery Gifts or Hextech Crafting, but unfortunately you won't be able to directly purchase the skin as Riot does not do these types of special requests.","replies":[]},{"poster":"KanagaWave","date":"2016-09-22T23:11:49.856+0000","up_votes":1,"down_votes":0,"body":"thank you both for your help i truely apreciate it{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}