{"poster":"Demon Zagor","date":"2017-07-10T01:58:35.881+0000","title":"porque estos últimos días hay un ping tan alto","subforum":"Problemas Técnicos","up_votes":6,"down_votes":0,"body":"hola , estoy acostumbrado a jugar  entre  70 y  80 de ping , pero estos &uacute;ltimos d&iacute;as no se porque motivo me esta andando  a 300 al principio pens&eacute; que era mi Internet , pero le hice un speed test y vi que no , y hay varias personas que me comentaron lo mismo que el lol les esta andando horrible , alguien me puede informar que pasa , o existe alguna solucion ? desde  antemano gracias","replies":[{"poster":"Silenciosito","date":"2017-07-10T03:12:10.029+0000","up_votes":2,"down_votes":0,"body":"Xk al ping le crecieron alas","replies":[]},{"poster":"KAINE","date":"2017-07-10T03:05:37.541+0000","up_votes":1,"down_votes":0,"body":"hola, ami también me esta pasando lo mismo nada mas que en mi caso estoy acostumbrado a jugar entre 70 y 80ms, pero últimamente estoy jugando con 104 a 110 y a pesar de que es tolerable, aveces se vuelve peor porque supuestamente estoy a 90 ms y bien con los fps pero aun así anda muy muy lag, lo peor de todo esto es que ya me tocaron 3 partidas no seguidas obviamente pero si a lo largo de la semanas, 3 partidas ranked cabe aclarar que varios compañeros tuvieron ese lag y riot no puso derrota evitada. Es un lag repentino ya que al principio la partida era fluida ningún problema pero desp llega la latencia y no se puede jugar. Esta de mas decir que hice pruebas con mi proveedor de Internet y compruebo que tanto la velocidad de subida como de bajada están bien son las correctas así que no queda otra que pedirle a riot que revise el tema o que al menos ponga en las notificaciones de alerta para LAS informando a los jugadores de posibles partidas con latencias altas o al menos poner derrota evitada","replies":[{"poster":"Demon Zagor","date":"2017-07-12T01:29:41.389+0000","up_votes":1,"down_votes":0,"body":"eso también me  suele pasar , los supuestos 70 de ping y la realidad es que anda como 500 no se porque pasa esto segura mente  aya problemas en la transferencia de datos","replies":[]}]},{"poster":"iEban","date":"2017-07-10T02:37:34.104+0000","up_votes":1,"down_votes":0,"body":"Hablo sin saber: me imagino que por el fin de semana de PI juega más gente, lo que creo que significa más uso de los servidores, lo que daría sentido a que pueda funcionar peor.\n\nRepito: no se nada de informática, ni de redes, ni de nada por el estilo. Es algo que me parece sentido común, puedo estar equivocado.","replies":[{"poster":"JPablo01","date":"2017-07-10T03:50:45.916+0000","up_votes":1,"down_votes":0,"body":"En sierto punto tienes razon, o sea, los servidores petan, pero no es por el ping que tienen ellos, sino que ellos tienen un mal net","replies":[{"poster":"iEban","date":"2017-07-10T05:01:55.688+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JPablo01,realm=LAS,application-id=X54mVVp0,discussion-id=L2G3duNG,comment-id=00000000,timestamp=2017-07-10T03:50:45.916+0000)\n>\n> En sierto punto tienes razon, o sea, los servidores petan, pero no es por el ping que tienen ellos, sino que ellos tienen un mal net\n\nClaro. Yo no se del tema pero me imagino que no pagan o no tienen servidores para mantener cuatro veces el caudal de usuarios promedio que tienen. Pongamos que en sus picos regulares tienen una cantidad X de jugadores, el razonamiento lógico te diría de asegurarte de que tus servidores aguanten un 1.2X, 1.3X. \nEl fin de semana es cuando, supongo, más gente debe poder jugar. Si le agregas a ese fin de semana el bonus de PI es más probable que haya más gente jugando y superes el pico regular y ahí entres a tener problemas.\nNo se de internet y todo esto, pero me sigue pareciendo sentido común. No creo que sea coincidencia tantas quejas por el lag el finde de PI. Yo no creo en las casualidades.","replies":[]}]}]}]}