{"poster":"Kid in a Fridge","date":"2016-03-17T04:58:39.408+0000","title":"0xc0000005 Error","subforum":"Help & Support (OCE)","embed":{"description":"The easy way to save screenshots, GIFs, and websites. Make everyone happy by sharing smarter, faster, and with your point crystal clear.","url":"https://gyazo.com/381ba1dbab642ffef31f58e5c239c690","image":"https://i.gyazo.com/thumb/1200/_3f8bfe5b2a027de7a775184649d64d0e-png.jpg"},"up_votes":1,"down_votes":0,"body":"Every time the game exits to champ select, it doesn&#039;t go into the loading screen and it pops up with the error &quot;The application was unable to start correctly (0xc0000005). I have only got this error today, it was fine yesterday. I don&#039;t know how to fix it and it&#039;s frustrating. I&#039;ve repaired my League and it didn&#039;t help I also deleted the folder  &quot;lol_patcher&quot; at C:\\Riot Games\\League of Legends\\RADS\\projects and that didn&#039;t work either (I saw a post that it might help). Please leave any suggestions! Thanks. \r\n{{item:3070}}  {{item:3070}}  {{item:3070}}","replies":[{"poster":"NasiKong","date":"2016-03-17T14:09:50.259+0000","up_votes":1,"down_votes":0,"body":"i am having the same problem. have you get it fixed yet?","replies":[{"poster":"Kid in a Fridge","date":"2016-03-18T10:11:01.735+0000","up_votes":1,"down_votes":0,"body":"Yes. Upgrading to Windows 10 worked twice. Try it!","replies":[]},{"poster":"Kid in a Fridge","date":"2016-03-18T06:05:43.425+0000","up_votes":1,"down_votes":0,"body":"When I upgraded to Windows 10 and loaded up a custom game it ran fine no errors. But the my dumbass was like \"It might work on Windows 7 now\"... which it didn't. Upgrading now though. Try upgrading if you can, you can always revert the update if it doesn't work.","replies":[]}]},{"poster":"SephirothSG","date":"2016-03-17T23:11:21.591+0000","up_votes":1,"down_votes":0,"body":"Do you have lolreplay installed? If so, then this is more than likely the cause.\n\nDisable lolreplay and attempt to play a CUSTOM game, let me know if this helps.","replies":[{"poster":"Kid in a Fridge","date":"2016-03-18T06:03:44.456+0000","up_votes":1,"down_votes":0,"body":"I did have it installed. I just uninstalled it and it didn't work. I'll try restarting my PC.","replies":[]}]}]}