{"poster":"Aquila1606","date":"2015-05-17T15:39:14.869+0000","title":",,Battle of Legends''2-Janna vs Nami","subforum":"Community-Kunstwerke","up_votes":2,"down_votes":0,"body":"Naturkatastrophen-verursachen oftmals gro&szlig;e Sch&auml;den und k&ouml;nnen,wenn es schlimm wird, auch mal Millionen von Menschen mit in den Tod reissen.Aber noch schlimmer w&auml;re es, wenn es Personen geben w&uuml;rde, die diese kontrollieren k&ouml;nnten.Solche Personen k&ouml;nnten die ganze Welt bzw. in diesem Fall Runeterra auf den Kopf stellen.Zwei von diesen k&auml;mpfen auch in der Liga der Legenden- ihre Hauptrolle:Supporter/Unterst&uuml;tzer-was f&uuml;r das erste harmlos klingt,aber sie benutzen sie(im Moment)gr&ouml;&szlig;tenteils f&uuml;r den Schutz von anderen.Janna,die Wut des Sturms und Nami die Gezeitenruferin.Beide werden alles einsetzen was sie haben,Wind vs Wasser,St&uuml;rme vs Wellen und Tornados vs Tsunamis um zu beweisen wer die st&auml;rkere natur-kontrollierende Championesse ist, in einem ,,Battle of Legends&#039;&#039;\n\nJanna{{champion:40}} \n\nHintergrund\n\nJanna Windforce(Ihr kompletter Name,best&auml;tigt von Ezreal)war ein Waisenkind und ihre Kindheit schien schwer.Durch ihre Cleverness und das Stehlen,&uuml;berlebte sie jedoch.Aber Janna schien einen weiteren Joker zu haben .Sie hatte das Wissen,dass eine ungez&uuml;gelte Magie in ihrem Geburtsort Zhaun gab,was f&uuml;r sie verf&uuml;hrerisch klang.Sie k&ouml;nnte sich sch&uuml;tzen und besonders sich erheben und Macht zeigen.Ihre Neigung ging besonders zur Luftmagie.Innerhalb von wenigen Monaten schlie&szlig; sie ihre Studien dazu ab,als w&auml;re sie daf&uuml;r geboren worden und wurde nahezu &uuml;ber Nacht ein Avatar der L&uuml;fte.Diese rasante Entwicklung verlieh ihr auch ein &uuml;bernat&uuml;rliches Aussehen.Ihr Ziel ist es nun alle Ungerechtigkeit auf der Welt zu bek&auml;mpfen und besonders dem Wahnsinn ihres Geburtsortes Zhaun eine Ende zu setzen.Mittlerweile ist sie eine ber&uuml;hmte Championesse und man kann sie als eine Art Star gelten lassen.Auch arbeitet sie nebenbei als Wetterfee beim LoL Sender RGN.\nSt&auml;rken\n\n-Die Person Janna\n\nJanna selbst scheint eher ein zierliches M&auml;dchen zu sein,dennoch besitzt sie einen hohen Grad an Cleverness, mit der sie &uuml;berleben konnte und die Magie der L&uuml;fte auch innerhalb von einem vergleichsweise kurzen Zeitraum erlernen konnte.Sie scheint auch ziemlich geschickt zu sein und auch mutig, da sie unter anderem auch schon stehlen musste um zu &uuml;berleben.Sonst kann man eigentlich nur sagen, dass sie sch&ouml;n und jung ist,denn den Gro&szlig;teil ihrer Kraft hat sie durch ihre Winde.\n-Kraft des Windes(u.a.F&auml;higkeiten)\n\nWind entsteht dadurch,dass der Luftdruck an verschiedenen Orten auch verschieden.Einige Orte besitzen einen tiefen Druck,andere einen hohen,wobei dann Luft vom Hochdruck zum Tiefdruck zieht,was wir dann Wind nennen.Janna hat eine breite Palette an Dingen, die sie mit ihren Winden machen kann.Ihr Hauptnutzen ist erstmal das fliegen,denn sie scheint immer zu fliegen,mit Ausnahme wenn sie stirbt ... oder tanzt.Ihre anderen Kr&auml;fte kann sie sowohl mit ihrem Stab als auch mit ihren H&auml;nden kontrollieren.Dennoch scheint sie mit ihrem Stab diese besser zu kontrollieren.Man kann die Kr&auml;fte gut mit ihren F&auml;higkeiten verkn&uuml;pfen.Die Passive verr&auml;t, dass sie R&uuml;ckenwind geben kann-ergo sie schafft es den Luftdruck zu manipulieren.Mit ihrer Q Heulender Sturm zeigt sie,dass sie auch kompliziertere Winde erschaffen kann,in Form eines Wirbels und durch das neuere Splash-Art erf&auml;hrt man,dass sie diese Wirbel mit ihrem Stab erschafft.Die W zeigt dass sie ein Luftelementar beschw&ouml;ren kann.Dieses sieht &auml;hnlich aus wie ein Vogel und man kann annehmen, dass dieses Luftelementar Zephir hei&szlig;t,da die F&auml;higkeit diesen Namen tr&auml;gt.Dieses erh&ouml;ht ihre Bewegungsgeschwindigkeit,kann aber auch als Geschoss verwendet werden,was den Gegner verlangsamt.Mit der E schlie&szlig;t sie sich in einem Schild ein was gleichzeitig daf&uuml;r sorgt,dass austretende Geschosse st&auml;rker werden.Ihre Ultimative F&auml;higkeit zeigt dass sie Gegner um sich wegsto&szlig;en kann und Verb&uuml;ndete heilen kann bzw. es auf sich selbst auch k&ouml;nnte.Fr&uuml;her wurden Gegner in diesem Gebiet auch verlangsamt,was ich ber&uuml;cksichtigen werde.\n\nKommen wir aber nun zu den gef&auml;hrlichsten Winden.Es gibt mehrere Skalen die Winde unterteilen.Eine f&uuml;r normale Winde,die Beaufortskala,die Fujitaskala f&uuml;r Tornados wozu es noch eine ,,verbesserte Version&#039;&#039; gibt, die Enhanced-Fujitaskala und die Saffir-Simpson-Hurrikan-Skala.Die Beaufortskala ist von 0-12 eingeteilt.Stufe 12 ist dabei der Orkan,der als einer gilt, bei einer Windgeschwindigkeiten &uuml;ber 117km/h.Orkane sind stark genug um das Wasser so ,,wegzupusten&#039;&#039;,dass man nichts mehr sehen kann.Zudem k&ouml;nnen B&auml;ume einknicken,Dachziegel werden zu Projektilen und mehr.Die Fujita Skala ist in F0-F12 eingeteilt,wobei F0-F5 die einzigen sind die wirklich schon zu 100% eingetreten sind und deswegen als einzige ber&uuml;cksichtet werden.F6 gibt es amtlich nicht,k&ouml;nnte aber eventuell schon eingetreten sein.Die restlichen sind theoretische Windgeschwindigkeiten, au&szlig;er F12 was auf der Erde nicht eintreten kann,da dieser Tornado &uuml;ber Schallgeschwindigkeit w&auml;re,was auf der Erde nicht m&ouml;glich ist.Ein Tornado bewegt sich mit seiner Mutterwolke mit und erreicht im Durchschnitt 50km/h.Tornados k&ouml;nnen zudem bis zu 1-2 Kilometer Durchmesser erreichen.F5 Tornados k&ouml;nnen Autos 100Meter weit schleudern,Holzh&auml;user von ihren Fundamenten rei&szlig;en,verschieben und sogar zerlegen und auch asphaltierte Stra&szlig;en einsaugen.Auch viele Gegenst&auml;nde k&ouml;nnen zu gef&auml;hrlichen Projektilen werden,seien es nur Dachziegel.Die Enhanced-Fujita-Skala ist &auml;hnlich wie die Fujita Skala,nur dass sie jediglich von EF1 bis EF5 geht.Der h&ouml;chste theoretische Wert liegt bei bei 1188km/h Windgeschwindigkeit.Die h&ouml;chste gemessene bei 511km/h.Hurrikans werden in der Saffir-Simpson-Hurrikan-Skala eingeordnet,die 5 Kategorien einordnet(7 wenn man Tropisches Tief und Tropischer Sturm mitrechnet).Alles mehr als 252km/h wird als Kategorie 5 eingestuft.Dies ist zwar langsamer als ein Tornado,aber da Hurrikans auch bis zu 2000Km Durchmesser verf&uuml;gen k&ouml;nnen,starke Niederschl&auml;ge und somit &Uuml;berschwemmungen und Wellen mit bis zu 5Meter H&ouml;he verursachen k&ouml;nnen,zeigen sie mehr Zerst&ouml;rungskraft.Man sollte auch noch erw&auml;hnen,dass Hurrikans 5-10 Tage andauern,w&auml;hrend Tornados grade mal einige Minuten und selten mal eine Stunde andauern.Hurrikans haben aber auch sehr strenge Bedingungen um zu entstehen:\n\n1.Das Meer muss 26,5C&deg; warm sein \n\n2.Das Gebiet muss diese Temperatur &uuml;ber eine gro&szlig;e Fl&auml;che besitzen\n\n3.550km Abstand vom &Auml;quator um die typische Drehung erzeugen zu k&ouml;nnen\n\n4.Der Wind in der Luft muss eine &auml;hnliche Geschwindigkeit haben wie der am Boden sowie in die selbe Richtung wehen.\n\n5.Der Sturm braucht ein Nucleus, auf den er sich aufbauen kann wie z.B. ein au&szlig;ertropisches Tief\n\nJanna ist also auf das Wasser teilweise angewiesen,aber sie kann es wahrscheinlich leicht w&auml;rmen,durch die hei&szlig;eren Luftstr&ouml;me aus warmen Gebieten Runeterras.Shurima kann man als Beispiel nennen\nEs gibt aber noch einen einzigen Sturm, der, bis jetzt (zum Gl&uuml;ck), nicht aufgetreten ist in Menschen-Zeiten,aber eventuell Ende des Perm Zeitalters sowie eventuell zum Aussterben der Dinosaurier beigetragen haben k&ouml;nnte.Die Rede ist von dem Hyperkan.Dieser k&ouml;nnte nur bei einer Wassertemperatur von 50&deg; entstehen,was nur bei dem Ausbruch eines Supervulkans,dem Einschlag eines Asteroiden oder &auml;hnlichem hervorgerufen werden kann.Dieser Hyperkan ist hochgenug um die Ozonschicht zu besch&auml;digen,aber besitzt nur einen Durchmesser von 16km.Auch die maximale Windgeschwindigkeit ist niedriger als die eines Tornados mit 800km/h,aber dennoch stark genug um globale Zerst&ouml;rung zu verursachen.Das Zerst&ouml;ren der Ozonschicht w&uuml;rde dazu f&uuml;hren,dass die UV Strahlung der Sonne ungehindert auf die Erde strahlen w&uuml;rde,was Hautkrebs verursachen kann...mindestens.Auch k&ouml;nnte man allein wegen der Strahlung sterben.Der Wetterfee Janna Skin zeigt zudem,dass sie auch Blitze auf den Gegner einsteigen lassen kann.\n\nSchw&auml;chen\n\nZwar erscheinen Jannas Kr&auml;fte monstr&ouml;s, aber sie besitzt klare Schw&auml;chen,denn sie selber ist auf ihre Winde angewiesen.Sonst ist sie nur ein cleveres geschicktes, aber auch zerbrechliches M&auml;dchen.Ihre Winde erlauben zwar gro&szlig;e Zerst&ouml;rung,aber Hurikans und Hyperkans sind sehr schwer zu kreieren,da diese auch auf das Wasser angewiesen sind.Hurrikans m&uuml;ssen auch in einer bestimmter Entfernung vom &Auml;quator sein,wodurch Janna diesen erstmal in das richtige Gebiet lenken m&uuml;sste.Hurrikans bewegen sich eigentlich immer in Kurven fort und erreichen bei der Bewegung 30km/h,was dies einschr&auml;nkt.Die zerst&ouml;rerischen Wirbelst&uuml;rme sind zudem mit dem Schwachpunkt belastet,ein windstilles Auge zu haben,was ein Zufluchtsort sein kann.Hurrikans schw&auml;chen sich auch schnell ab,wenn sie in Kontakt mit Festland kommen,da sie Wasser ben&ouml;tigen.Die gr&ouml;&szlig;te Schw&auml;che ist aber die,dass sie sich darauf spezialisiert hat,eher eine besch&uuml;tzende Rolle einzunehmen.Auch ihre Q ist nur ein schwacher und kleiner Wirbelwind,und die W macht nur leichten Schaden und spezialisiert eher auf das verlangsamen.Die st&auml;rkeren Sch&uuml;sse der E sind eher ein netter Nebeneffekt und die Ulti schubst nur weg.\n\nDas scheint aber nicht genug zu sein um ihre Tr&auml;ume fortzublasen.\n\nNami{{champion:267}} \n\nHintergrund\n\nNami ist Teil des Wasservolkes der Marai.Sie leben Unterwasser,in dem Meer der Beh&uuml;ter und besitzen deswegen Flossen und &auml;hneln Meerjungfrauen.Ihr Dorf wird dank der Kraft eines Mondsteines von den Gefahren der Tiefe besch&uuml;tzt,jedoch kann der Mondstein diese Kraft nur 100 Jahre halten,bevor sein Licht erlischt.Deswegen gibt es immer zu der Zeit eine Gezeitenruferin,die eine Tiefseeperle aus den tiefen Gew&auml;ssern holt um sie von einem Landg&auml;nger gegen einen neuen Mondstein tauschen zu k&ouml;nnen.Ohne die Kraft des Mondsteines w&uuml;rde dem Volk eine Katastrophe drohen.Die 100Jahre drohten zu enden und Nami wollte sich dieser Aufgabe zuwenden,obwohl sie nicht als die Auserw&auml;hlte galt,weil es keinen dieser Sorte gab.Nach 6Tagen kehrte sie mit der Perle in der Hand zur&uuml;ck und war auf dem Weg an die Oberfl&auml;che.Die Marai betitelten sie bereits als die neue Gezeitenruferin.Als sie aber an die Oberfl&auml;che kam,sah sie keinen einzigen Menschen.Sie wartete und wartete aber nichts war zu sehen.So beschloss sie als erste ihrer Art an die Oberfl&auml;che zu gehen und die Perle dort zu suchen und nicht eher zur&uuml;ck zu kehren, bis sie die Perle gegen den Mondstein eingetauscht hat.\n\nSt&auml;rken\n\n-Lebensform Nami\nDa sie Teil des Volkes der Marai ist, hat sie keine Beine,daf&uuml;r aber Flossen,dennoch kann sie sich an der Oberfl&auml;che fortbewegen,mit Hilfe von Wasser.Nami ist resistenter gegen Druck als Lebensformen auf dem Land,da sie 6Tage in sehr tiefen Wasser verbracht hat und allgemein Unterwasser lebt.Zudem muss sie auch genug Kraft besitzen,um ihre Flosse sowie ihre H&auml;nde bewegen zu k&ouml;nnen,da dies unter Druck auch sehr viel schwerer ist.Auch ihre Augen m&uuml;ssten in dieser Dunkelheit sehen k&ouml;nnen,da sie sonst ziemlich lange da unten h&auml;tte suchen m&uuml;ssen,weil Sonnenlicht nach einer gewissen Tiefe nicht mehr im Wasser vordringen kann.Man wei&szlig; leider nicht wie tief dies war und man kann also nur grob sagen,dass Nami sehr viel resistenter gegen Druck ist,als ein normaler Mensch und scheinbar auch selbst als ein normaler Marai,da keiner gedacht h&auml;tte,dass sie dies &uuml;berleben k&ouml;nnte,wodurch man vermuten kann,dass normalerweise nur die Auserw&auml;hlten dieser Gefahr trotzen k&ouml;nnen.\n\n-Kraft der Gezeiten\n\nAuf unserer Welt entstehen normalerweise nur riesige Wellen, wenn ein Erdbeben eingetreten ist,H&auml;nge von Bergen und Vulkanen oder ein Meteorit oder Komet ins Wasser st&uuml;rzt.Nami macht dies aber anders-sie kontrolliert indirekt die Schwerkraft indem sie die Kraft der Gezeiten benutzt.Sie kann die Gezeiten schnell kontrollieren was sie uns mit ihrer W Ebbe und Flut verr&auml;t.Auch benutzt sie das Wasser um sich an der Oberfl&auml;che schneller fortbewegen zu k&ouml;nnen oder um sich mit F&auml;higkeiten noch schneller zu machen(Passive).Auch kann sie eine Wasserblase erschaffen die den Gegner in der Luft ohne Fortbewegungsm&ouml;glichkeit schweben l&auml;sst(Q-Wassergef&auml;ngnis).Mit der Kraft der Gezeiten kann sie sich zudem heilen und Gegnern Schaden zuf&uuml;gen,wobei es immer auf jemand n&auml;herem umschl&auml;gt(Feind->Freund->Feind oder Freund->Feind->Freund im Spiel;W-Ebbe und Flut).Dies geschiet sehr schnell,und man kann durch aus annehmen,dass sie Strukturen wie S&auml;ulen oder W&auml;nde aus Wasser erschaffen kann,da sie z.B. ja auch bei ,,Ebbe und Flut&#039;&#039; Wasser in der Luft schweben lassen kann.Mit den Gezeiten kann sie auch ihre normalen Angriffe aus dem Zauberstab st&auml;rken,und mit der Kraft des Wassers den Gegner sogar verlangsamen(E-Segen der Gezeitenruferin).Nami kann aber auch gewaltige Mengen an Wasser auf einmal bewegen um eine Flutwelle innerhalb k&uuml;rzester Zeit zu erschaffen(Ultimate-Flutwelle).Wenn Nami die Kraft der Gezeiten l&auml;nger konzentriert einsetzt,k&ouml;nnte dies genug sein um ein Gro&szlig;teil des Wassers an einer Stelle zu versammeln und dieses dann auf den Gegner loszuhetzen.Auf der Erde befinden sich 1,4Milliarden Kubikkilometer Wasser.Runeterra d&uuml;rfte einen &auml;hnlichen Wert an Wasser haben,was sogar leichter zu kontrollieren ist als das auf der Erde,da Runeterra im Moment ein Superkontinent ist und somit sogut wie alles Wasser in einem gro&szlig;en Weltmeer gespeichert ist.Diese Masse an Wasser ist so gro&szlig;,dass ein W&uuml;rfel mit diesem Volumen eine Kantenl&auml;nge von 1120km h&auml;tte-Viel genug um ein Land bzw sogar einen Kontinent komplett &uuml;berschwemmen zu k&ouml;nnen.Zwar besitzt sie auch die Rolle des Supporters,aber jede ihrer F&auml;higkeiten kann Schaden machen und alle haben DAZU noch einen CC au&szlig;er die W,daf&uuml;r mit einer Heilung.Tsunamis alleine k&ouml;nnen auch sehr viel Zerst&ouml;rung anrichten-ein Beispiel w&auml;re der Tsunami von 2004,der viele St&auml;dte um den Indischen Ozean verw&uuml;stet hat.Das Wasser hatte genug Druck um Glasscheiben zu zerbersten und verschiedene Gegenst&auml;nde durch die Str&ouml;mung zu gef&auml;hrlichen Projektilen werden lassen.Und diese Wellen waren einige Meter hoch,w&auml;hrend Nami eventuell Kilometer hohe Wellen erschaffen kann.\n\nSchw&auml;chen\n\nNami scheint gut mit dem Wasser umgehen zu k&ouml;nnen,keine Frage,aber kondensiertes oder eingefrorenes Wasser scheint sie nicht kontrollieren zu k&ouml;nnen.Sicherlich besitzt sie auch Nachteile am Land zu k&auml;mpfen,da sie ein Wasserlebewesen ist und sich Flossen immernoch besser Unterwasser eignen.\n\nDennoch hindert sie das nicht daran den Landg&auml;nger zu suchen,um den Mondstein endlich zu bekommen\n\nOk nach dem wir etwas &uuml;ber ihre St&auml;rken und Schw&auml;chen erfahren haben, sind wir bereit sie in einem Battle of Legends antreten zu lassen!\n\n{{champion:40}} Janna vs Nami {{champion:267}} \n\n(ACHTUNG!Folgender Teil kann Gewalt in schriftlicher Form enthalten.Wenn ihr empfindlich auf  Gewalt seid bitte ich euch bis nach dem K.O. weiterzuscrollen.Dort werde ich das Resultat erkl&auml;ren.Danach kommt noch eine Zusammenfassung von Vor-und Nachteilen gegen&uuml;ber den Gegner)\n\nIn Zhaun,nahe der K&uuml;ste die nicht sehr weit entfernt ist,,nur Nami ist immernoch auf der Suche nach dem Landg&auml;nger oder zumindestens nach einem Mondstein,denn bald w&uuml;rden schon die 100Jahre enden.Sie fragte auch mehrere Bewohner, aber sie wurde nur verspottet und schikaniert.Die Leute schienen sie wie eine Art Freak anzusehen,selbst nachdem sie in der Liga der Legenden  Erfolge zeigte.Nach einer Weile verlor sie schon fast die Motivation,aber nun scheint es Hoffnung zu geben.Ein &auml;lterer Mann rennt von hinten auf sie zu und schreit sie an:,,Hey Marai!Ich bin der Landl&auml;ufer&#039;&#039;,,DAS HEI&szlig;T DU KANNST UNSER VOLK RETTEN!ICH HAB EINE TIEFSEEPERLE!&#039;&#039;,ruft sie freudenstrahlend auf,,Warte ab junges Fr&auml;ulein!Mir wurden vor ein paar Jahren ALLE gestohlen!Es ist eine Katastrophe!Und ich wei&szlig; nicht mal wer dies getarn haben k&ouml;nnte.Dieser jemand muss ziemlich schlau und vorallem geschickt gewesen sein.Denn ich bin zwar alt,aber sehr aufmerksam!&#039;&#039;,folgt er darauf.,,WAS???!!NICHT EINMAL DU HAST IHN NOCH?&#039;&#039;,entgegnet Nami ihn.Ihre Stimmung kippte.Alles war nach dieser Begegnung weg.Sie wusste nicht weiter,also beschlie&szlig;t sie an den Strand zu gehen und nachzudenken um eine Entscheidung treffen zu k&ouml;nnen.Sie sieht aus der Ferne dort ein bekanntes Gesicht-es ist das von einer ber&uuml;hmten Championesse aus der Liga der Legenden,Janna.Sie hebt einen Stein hoch,aber nicht irgendeinen,es schien ein Mondstein zu sein.Sie fasst es nicht.,,Warum hatte eine ber&uuml;hmte Pers&ouml;nlichkeit es n&ouml;tig zu stehlen&#039;&#039;,fragt Nami sich.Sie eilt zu dem Star und macht kurzen Prozess:,,Entschuldigung aber ich brauch diesen Stein!&#039;&#039;Janna kichert nur:,,Und was ist wenn ich ihn dir nicht geben m&ouml;chte?Immerhin habe ich ihn schon seit meiner Kindheit!&#039;&#039;Nami kocht teilweise schon vor Wut:,,Siehst du das hier?Das ist eine Tiefseeperle!Entweder du wirst diese mit dem Mondstein tauschen oder es setzt was!&#039;&#039;,,Ich finde diesen Mondstein aber viel sch&ouml;ner und einer so unruhigen Person m&ouml;chte ich diesen eigentlich gar nicht geben!&#039;&#039;,verspottet sie Nami.,,JETZT REICHT ES!&#039;&#039;,br&uuml;llt Nami \n\nKampf!\n\nNami schie&szlig;t Wasser aus dem Meer mit gro&szlig;er Wucht auf Janna,genug um sie einige Meter wegzuschubsen.,,Du meintest deine Drohung also ernst&#039;&#039;,seufzt Janna,bereitet ein Luftelementar vor und startet auch zu schweben.Den Mondstein legt sie mit Hilfe ihrer Winde auf die Klippe vor dem Strand.Darauf schleudert sie 3 Windstr&ouml;me hintereinander auf Nami,die alle treffen,aber nur einen leichten R&uuml;cksto&szlig; verursachen.Janna versucht einen gro&szlig;en Windstrom auf Nami zu hetzen aber Nami steht mit dem R&uuml;cken zum Wasser und kann somit einen gro&szlig;en Wasserstrom benutzen um sich gegen den Wind zu verteidigen.Das Wasser kommt teilweise auch durch den Wind und Janna muss den Windstrom zu ihrer Verteidigung aufheben.Sie erschafft Winde um sich herum, um ein Schild zu erschaffen.Dieses st&auml;rkt darauf ihre Sch&uuml;sse aus dem Stab die auf Nami zufliegen.Nami benutzt Wasser aus dem Meer hinter ihr um auch ihre Sch&uuml;sse zu st&auml;rken und beide prallen gegeneinander,aber wieder kommt das Wasser von Nami durch und das Schild durch die Winde schw&auml;cht ab.Auch f&uuml;hlt sich Janna schwerf&auml;lliger,da Wasser auf ihrer Haut liegt,was sich schwerer anf&uuml;hlt als es ist.Nami dr&uuml;ckt Janna also mit dem wenigen Wasser nach unten.Janna trocknet sich aber mit ihren Winden und mit einem kontrollierten Orkan bewegt sie sich schnell hinter Nami schl&auml;gt ihr gegen den Hinterkopf und tretet sie in Kombination mit einem Windsto&szlig; weg.In der Luft versucht sich Nami mit Wasser aus dem Ozean zu retten,aber Janna fliegt mit ihren Windstr&ouml;men &uuml;ber  Nami und schl&auml;gt sie auf den Boden.Mit einer hektischen Flut kann Nami in den Ozean fl&uuml;chten.An der Oberfl&auml;che des Wassers schwimmt sie nun und l&auml;sst S&auml;ulen aus Wasser hochschie&szlig;en,die Janna,dank ihrer hohen Geschwindigkeit,ausweichen kann.Janna l&auml;sst einen Orkan &uuml;ber das Wasser wehen,wodurch sie Nami die Sicht nahm und sie ihren Zephir landen konnte.Nami schwimmt unter die Wasseroberfl&auml;che,w&auml;hrend Janna einzelne Windstr&ouml;me in die ungef&auml;hre Position von Nami schie&szlig;t.Nami kann sich Unterwasser unbemerkt heilen und konzentriert sich um ein Wassergef&auml;ngnis f&uuml;r Janna zu erschaffen.\n\nJanna l&auml;sst den Orkan sich beruhigen und bemerkt,dass Nami verschwunden war-wie zu erwarten,denn sie k&auml;mpft immerhin gegen eine Wasserbewohnerin.Aber pl&ouml;tzlich wird sie von Wasser umschlossen und kann sich nicht  bewegen.Das Wasser geht zur&uuml;ck um mit einer ca. 30 Meter hohen Welle zur&uuml;ck zu kehren.Nach einer Weile ist Janna aber wieder frei und als die Wellen sie fast um schlie&szlig;en,benutzt sie Monsun um das Wasser wegzudr&uuml;cken und nebenbei auch,um einige Wunden zu heilen,da das Wasser einen hohen Druck hatte,was sie verletzt hatte.Auch hat sie Nami wieder sichtbar gemacht,da sie sich auf der Welle befand und nun in der Luft war.Sie versucht dies auszunutzen und rief einen Orkan aus Zhaun herbei.Dachziegel Laternen und Regenschirme fliegen Richtung Nami.Nami erschafft aber eine Welle,die sie als Mauer benutzt und alle Gegenst&auml;nde werden abgewehrt.Sie versucht mit dieser Welle aus gef&auml;hrlichen Projektilen Janna zutreffen.Aber Janna fliegt &uuml;ber sie weg und musste zusehen,wie ein Teil der Stadt Hinter dem Strand durch die Welle &uuml;berflutet worden ist.Sie erkannte die wahre Kraft von Nami und erschuf mehrere Wirbelwinde,die zu F5+ Tornados wurden,um nicht als schwach darzustehen.Nami bemerkt ihre Kr&auml;fte und versucht mit Monsterwellen Janna zu treffen,jedoch war dies sehr schwer, da sich Janna mit den Tornados drehen konnte und sie im Auge des Sturms vor jeglichen Wasserw&auml;nden so gut wie sicher war,da diese von den Tornados eingesaugt werden.Nami kann sich nur dank ihren Wellen noch vor der Kraft des Tornados sch&uuml;tzen.Sie schwimmt wieder unter Wasser und versucht unter einen der St&uuml;rme zu kommen,um mit Gl&uuml;ck Janna zu sehen und zu treffen.In dem Auge des ersten Tornados sieht sie zwar nicht Janna,aber sie bildet eine Wassers&auml;ule,hoch in den Himmel,um die Wolke des Tornados instabil zu machen,da mit sie schnell wegregnet und der Tornado sich aufl&ouml;st.Aus der Ferne macht sie dies mit den weiteren auch und sie sieht auch wie das zierliche Fr&auml;ulein aus dem Wirbel geschleudert wird.\n\nIm Himmel beschlie&szlig;t sie,noch mehr Kraft anzuwenden,in Form eines Hurrikan.Sie lie&szlig; sich einiges an Zeit,da sie viele Bedingungen beachten musste und ein Fehler nicht genug Kraft hervorbringen w&uuml;rde.Nami schwimmt w&auml;hrenddessen auf der Wasseroberfl&auml;che und schaut in den Himmel.Sie sieht Janna zwar,aber nur als ein kleiner Punkt und Nami wei&szlig; auch nicht was sie vorhat.Nach einer Weile sp&uuml;hrt sie,dass ein starker Wind aufkommt,es stark regnet und auch Blitze vom Himmel runtergeschossen kommen.Sie sp&uuml;hrt au&szlig;erdem,dass die Ozeanoberfl&auml;che starke Wellen aufzeigt-gegen ihren Willen.Sie schwimmt Unterwasser um zum Ort zu kommen,wo die Wellen herkommen.Sie muss feststellen,dass der Ausl&ouml;ser ein noch gr&ouml;&szlig;erer Sturm als vorher war.Dessen Auge war aber auch um einiges gr&ouml;&szlig;er.Nur klappt dies mal ihre Strategie nicht,sie hatte es nicht mit einem Tornado zu tun der die Kraft aus den Wolken nimmt.Dieses Kaliber zieht die Kraft aus dem Wasser und Nami beschlie&szlig;t das Wasser am &Auml;quator zu lagern,da sie dort keine gr&ouml;&szlig;eren St&auml;dte in Gefahr bringen w&uuml;rde,da sich die gro&szlig;e Barriere am &Auml;quator von Runeterra befindet und diese Stelle auch weitgenug vom Wirbelsturm entfernt ist.Nami nutzt auch erstmal nur das Wasser,nahe des Hurrikans, um andere Personen nicht zu gef&auml;hrden.Janna gibt den Hurrikan auf und l&auml;sst den Wind langsam zerfallen.Die warme Luft zog sie aber zu einem anderen Ort und fixierte sie dort.Diese Wasser erw&auml;rmt sich schnell.Es wird w&auml;rmer als gew&ouml;hnlich aber das wollte sie auch.Nami sp&uuml;hrt den Wind leicht in diese Richtung sich bewegend und begibt sich in Richtung dieses Punktes,von Janna verfolgt.Eine Stunde sp&auml;ter kommt sie dort an und bemerkt,dass sich ein R&uuml;sselschon bildet.Diesmal sah sie nur die M&ouml;glichkeit alles Wasser an einem Punkt zu fixieren,was sie am &Auml;quator gegen&uuml;ber der gro&szlig;en Barriere auch tat.Janna versucht dem Wasser zu folgen und kann grade auch mithalten.Nami geht jetzt aber auf die offensive Variante und als Janna nur c.a.200Meter entfernt von ihr stand erhebt sie die Wassermenge und verfolgt Janna damit.In dem Wasser waren s&auml;mtliche Gegenst&auml;nde oder sogar Geb&auml;ude von Tsunamis.Tote K&ouml;rper,Schiffe,H&auml;user,Waffen und mehr in Verbindung mit gewaltiger Wassermenge bewegten sich auf Janna zu und sie hat Probleme wegzu fliegen,da sie ein Gro&szlig;teil der Luft an einer entfernten Stelle gesammelt hatte und w&uuml;rde sie diesen zu sich holen,w&uuml;rde sie in die Welle gepustet werden.Die Welle war am Ende aber schneller und als auch der Monsun nicht hilft, landet Janna unter der Welle und alles ist aus.Die Gegenst&auml;nde die ihr entgegen kamen und der hohe Druck des Wassers sind einfach zu viel f&uuml;r die zierliche Frau.Nami versucht alle Sch&auml;den r&uuml;ckgangig zu machen,schwimmt Richtung Zhaun und findet eine ganze Ration an Mondsteinen in der Innenstadt von Zhaun.,,Sie wurden wohl alle hier angesp&uuml;hlt.&#039;&#039;,dachte sich die ersch&ouml;pfte Marai Nami.Sie ist auf dem Weg zu ihrem Heimatort mit einem Mondstein(den Rest gab sie dem Mann zur&uuml;ck zusammen mit einer Tiefseeperle)Sie findet den Stab von Janna-er war immernoch best&auml;ndig und trug kaum Sch&auml;den davon-im Gegensatz zu Janna.\n\nK.O.\n\nBeide besitzen monstr&ouml;se F&auml;higkeiten,aber Nami ist weniger auf diese angewiesen.Nami kann mehr aushalten als Janna und auch ohne jegliche F&auml;higkeiten st&auml;rkere Schl&auml;ge ausf&uuml;hren.Mit F&auml;higkeiten ist Janna aber wesentlich schneller und kann einiges an Kraft nachholen,aber Nami kann mit ihrem Wasser sich auch st&auml;rken oder Treffer abblocken.Jannas wichtigste St&uuml;rme sind zu dem auf Wasser angewiesen,was nicht umbedingt vorteilhaft gegen die Gezeitenruferin ist.Wasser ist auch schwerer als Luft weshalb Wasser in den meisten aufeinander Treffen den Vorteil hat.Janna ist auch nicht sehr erfahren ihre F&auml;higkeiten super offensiv einzusetzen,weshalb sie nicht genug Kraft aufbringen kann Nami zu t&ouml;ten.Janna kann sich nicht &uuml;ber Wasser halten und der Sieger ist somit Nami.\n\nSt&auml;rken und Schw&auml;chen\n\nJanna{{champion:40}} \n\nVorteile\n\n-Sehr viel schneller\n-Kl&uuml;ger\n-St&auml;rker auf dem Land\n-Kann Nami mit einem Orkan auf offener See die Sicht nehmen\n-Erfahren den Wind zu benutzen-wie daf&uuml;r geboren\n\nNachteile\n\n-Ohne Wind=nur eine zierliche Frau\n-benutzt Winde selten offensiv \n-Kann Nami kaum verletzen\n-schw&auml;chere Deffensive\n-Hurrikans und Hyperkans sind auf Wasser angewiesen-Namis Spezialgebiet\n-Wirbelst&uuml;rme besitzen ein Auge,indem Windstille herrscht\n->Nami kann sich darin zwar sch&uuml;tzen, aber nicht wehren und Nami kann Unterwasser in dieses gelangen und Janna angreifen.\n-Luft ist leichter als Wasser\n\nNami{{champion:267}} \n\nVorteile \n\n-St&auml;rker(Muskeln k&ouml;nnen sich unter Hockdruck bewegen)\n-Mehr Durchhalteverm&ouml;gen\n-Wasser ist schwerer als Wind \n-Hat im Wasser einen Vorteil,ist trotzdem Okay am Land\n-Kann Janna in ihrer Bewegungsm&ouml;glichkeit stark einschr&auml;nken \n-besitzt eine ernstere Aufgabe,weshalb sie automatisch ernst k&auml;mpft\n-Kann sich im Wasser unbemerkt heilen\nNachteile\n\n-Schw&auml;cher als Janna am Land\n-Langsamer als Janna-besonders am Land\n-Kann Wolken nicht direkt kontrollieren\n\nN&auml;chstes Mal bei Battle of Legends:\n\nDemacia vs Noxus \n\nBeide sind schon tausend mal aufeinander getroffen\n\n&Uuml;bernat&uuml;rliche Kreaturen","replies":[{"poster":"N00B FreshToasty","date":"2015-06-01T19:18:41.577+0000","up_votes":2,"down_votes":0,"body":"Was sind die übernatürlichen Kreaturen?\nCassio? Vladimir? Und wer sind die von Demacia?","replies":[{"poster":"Aquila1606","date":"2015-09-11T13:16:44.029+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=N00B FreshToasty,realm=EUW,application-id=NIAgX8ss,discussion-id=rLrpeyhK,comment-id=0001,timestamp=2015-06-01T19:18:41.577+0000)\n>\n> Was sind die übernatürlichen Kreaturen?\n> Cassio? Vladimir? Und wer sind die von Demacia?\n\nIch meine mit diesen Kreaturen Sion(Noxus) und Galio(Demacia)\nEs ist eine relativ unbekannte Rivalenschaft \nDennoch hab ich sie genommen weil ich Sion mag und Galio auch so ein bisschen meine Inspirationsquelle repräsentieren sollte,die einen Wasserspeier  aus nem Cartoon in dem ,zu der Zeit,aktuellsten Kampf kämpfen gelassen haben.\nLeider ist das schon ein paar Monate her ^^","replies":[]}]},{"poster":"N00B FreshToasty","date":"2015-05-23T14:39:48.449+0000","up_votes":2,"down_votes":0,"body":"Super! Ich bin zwar etwas traurig, da ich Janna lieber mag, aber ich kann verstehen, dass sie verliert.\n{{item:2009}}","replies":[{"poster":"Aquila1606","date":"2015-09-11T13:12:50.451+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=N00B FreshToasty,realm=EUW,application-id=NIAgX8ss,discussion-id=rLrpeyhK,comment-id=0000,timestamp=2015-05-23T14:39:48.449+0000)\n>\n> Super! Ich bin zwar etwas traurig, da ich Janna lieber mag, aber ich kann verstehen, dass sie verliert.\n> {{item:2009}}\n\nIch mag Janna auch.Von Anfang an hab ich mir aber vorgenommen den gewinnen zu lassen,der am wahrscheinlichsten gewinnen würde\nEs gibt sicher auch irgendeinen Weg wie Janna gewinnen könnte,denn sie kann mit der Geschwindigkeit sicher einiges an Kraft aufwenden was ich leider nicht berücksichtigen konnte.\nSry dass ich erst jetzt antworte,hatte aber etwas Motivation am Forum verloren und auch dem nächsten Teil des Projekts\nIch glaub nicht dass ich es im geringeren Zeitraum schaffe,da ich dieses Mal ein paar Rechnungen einfüge.Zudem muss ich auch noch in die Schule was mir auch Zeit nimmt(Na Guuut ...in den Sommerferien hab ich auch kaum was daran gemacht)","replies":[]}]}]}