{"poster":"Hunter1897","date":"2015-08-10T12:31:52.566+0000","title":"aiuto...sono un principiante","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Ciao a tutti,\r\n\r\nho cominciato a giocare da poco a lol, sono liv 9. Ho usato come personaggio ( quando era free) Varus e mi piace moltissimo utilizzarlo, ora sto tenendo da parte $$ per comprarlo. Come da titolo, di lol non so assolutamente nulla o poco pi&ugrave; di nulla e vi chiedi giusto un p&ograve; di aiuto per continuare il mio percorso al meglio. Ho spulciato questo forum e ho trovato le build per adc ( correggetemi se sbaglio) ma non so nulla di meccaniche di gioco, combo, maestrie, rune, posizioni di gioco, strategie ecc ecc. Ah, riguardo la teminologia che utilizzate in questo forum sappiate che per me &egrave; ostrogoto quindi cercate di utilizzare termini semplici. Dove posso &quot; studiare&quot; un p&ograve; di teoria? Video? Guide? Vi prego datemi una mano un p&ograve; in tutto che non so da dove cominciare. \r\n\r\nGrazie a tutti  per l&#039;aiuto","replies":[{"poster":"Hunter1897","date":"2015-08-10T13:38:23.841+0000","up_votes":1,"down_votes":1,"body":"si grazie mille, era proprio quello di cui avevo bisogno... :D \n\nvolevo sapere una cosa per sapere se sto facendo bene, fino ad ora ho sempre giocato contro i computer, va bene oppure è preferibile giocare subito \"online\"?","replies":[{"poster":"Giacux","date":"2015-08-10T15:16:54.736+0000","up_votes":1,"down_votes":1,"body":"Prima smetti di giocare contro i bot meglio è","replies":[{"poster":"Hunter1897","date":"2015-08-10T15:22:35.588+0000","up_votes":1,"down_votes":1,"body":"a che livello potrei cominciare a smettere? pensi fin da subito?","replies":[{"poster":"73668109_DEL","date":"2015-08-10T18:17:54.706+0000","up_votes":2,"down_votes":0,"body":"Non pensarci minimamente , dovrai smettere di giocare contro i bot quando farai risultati molto positivi (es. 15/0/5).\nSe non riesci a farli nemmeno contro i bot , credimi non sei pronto per i pvp , saresti carne da macello.","replies":[{"poster":"Sorcio84","date":"2015-08-10T22:36:14.771+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LastExileITA,realm=EUW,application-id=MJVj50Jw,discussion-id=nq9R4af7,comment-id=0001000000000002,timestamp=2015-08-10T18:17:54.706+0000)\n>\n> Non pensarci minimamente , dovrai smettere di giocare contro i bot quando farai risultati molto positivi (es. 15/0/5).\n> Se non riesci a farli nemmeno contro i bot , credimi non sei pronto per i pvp , saresti carne da macello.\n\nquoto","replies":[]}]},{"poster":"Giacux","date":"2015-08-10T15:39:14.802+0000","up_votes":1,"down_votes":0,"body":"Anche ora. I bot sono ripetitivi, e quando giocherai contro giocatori veri potresti sentirti un po' spaesato.","replies":[]},{"poster":"ObscureFenix","date":"2015-08-10T15:36:31.040+0000","up_votes":1,"down_votes":0,"body":"Smetti ora, giocare contro i bot è noioso, ripetitivo ed è praticamente inutile nel imparare!! Gioca contro player veri, impararei molte più cose.","replies":[]}]}]}]},{"poster":"Sorcio84","date":"2015-08-10T22:44:06.630+0000","up_votes":1,"down_votes":0,"body":"impara il last hit .\nFai una partita personalizzata da solo nella landa\npiazzati in bot\nquando arrivano i minion tiragli 1 solo colpo che dovrà ucciderli\ndopo 10~11 minuti, fermati e guarda quanti ne hai fatti fuori.\n\nPiu ne fai fuori, più hai gold ed exp, prima compri gli item che ti servono.\n\nho anche una pagina in costruzione dove metterò tutte le guide che trovo, ma c'è poco ancora. si chiama sorcio84 .","replies":[]},{"poster":"Giacux","date":"2015-08-10T15:19:43.564+0000","up_votes":1,"down_votes":0,"body":"Di youtuber ti consiglio di seguire gente come Agua, Terenas, Jake sieghardt, Ultramito per imparare a giocare. \nSe cerchi gente simpatica Yougizzi, Snitecs, StarskyQQ, Kyrenis. \nUn altro bellissimo forum è lolitalia.it, ti consiglio di guardare anche lì.","replies":[]},{"poster":"Mura7797","date":"2015-08-10T13:33:23.508+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=n0Y5uxvMktA\nhttps://www.youtube.com/watch?v=ZtfasTp-NSk\nhttps://www.youtube.com/watch?v=fbTIP7Lz_AQ\n\nGuarda questi per avere dei concetti base su tutto ciò che ti serve per imparare l'adc, ti saranno utili.\n\nhttp://forums.euw.leagueoflegends.com/board/showthread.php?t=1081796\n\nInvece usa questo link per tutte le volte che usano qualche termine che non conosci.\n\nSpero di esserti stato d'aiuto. :)","replies":[]}]}