{"poster":"Essigdressing","date":"2016-11-15T21:48:59.368+0000","title":"Verschiebung von Spiel zwischen Team Immortal und Team Naughty Boys","subforum":"Battlegrounds-Turniere","up_votes":1,"down_votes":0,"body":"Wir w&uuml;rden gerne das Spiel das wir gegen Team Naughty Boys spielen um einen Tag vorziehen. Also statt am 20.11 lieber am 19.11 um 18 Uhr.","replies":[{"poster":"Rono","date":"2016-11-19T16:21:17.172+0000","up_votes":1,"down_votes":0,"body":"Wo sollen wir anschließend das Ergebnis eintragen?","replies":[{"poster":"Cunctor","date":"2016-11-19T16:24:32.204+0000","up_votes":1,"down_votes":0,"body":"Das Ergebnis sehen wir dann schon :)","replies":[]}]},{"poster":"Essigdressing","date":"2016-11-19T14:02:17.564+0000","up_votes":1,"down_votes":0,"body":"Kann es sein, dass man beim neuen Client keine Chatrooms aufrufen kann? Seitdem ich den neuen Client habe ist es mir auch nicht mehr möglich den alten zu benutzen","replies":[{"poster":"Elthision","date":"2016-11-19T14:09:25.846+0000","up_votes":1,"down_votes":0,"body":"Chaträume und Turnierlobbys gehen im neuen Client noch nicht. Hier ist eine Anleitung wie du den Legacy Client starten kannst: [http://boards.euw.leagueoflegends.com/de/c/alpha-client-de/QMYjaqjs](http://boards.euw.leagueoflegends.com/de/c/alpha-client-de/QMYjaqjs)","replies":[]}]},{"poster":"Elthision","date":"2016-11-15T22:23:24.916+0000","up_votes":1,"down_votes":0,"body":"Alles klar! Samstag, 18 Uhr, ist für euch eingetragen und somit verbindlich. Die Turniercodes können erst generiert werden, wenn die Samstagsrunde abgeschlossen ist. Ihr könnt aber einfach ein Freies Spiel mit Turnierauswahl erstellen und eure Gegner einladen. Viel Glück beim Match!\nZum gegebenen Zeitpunk wird ein Adjudicator im Chatraum \"SuR Terminverschiebung\" erreichbar sein, falls es Probleme gibt.\nmfg Elthision","replies":[]},{"poster":"Rono","date":"2016-11-15T22:11:36.563+0000","up_votes":1,"down_votes":0,"body":"Stimme zu. ;)","replies":[]},{"poster":"Elthision","date":"2016-11-15T21:58:12.274+0000","up_votes":1,"down_votes":0,"body":"Hey,\nUm das Spiel auf diesen Zeitpunkt zu verschieben benötigen wir die Zustimmung beider Teamcaptains. Falls ihr den Termin also schon mit ihnen so ausgemacht habt, dann soll der gegnerische Teamcaptain in diesem Thread dem Termin zustimmen.\nFalls ihr das noch nicht geklärt habt, dann schickt am besten eine Freundschaftsanfrage an den Captain und klärt mit ihm ab, ob der Termin möglich wäre.\nSobald beide Teams dem Termin zustimmen, können wir Adjudicators den Termin bestätigen.\nmfg Elthision","replies":[]}]}