{"poster":"Rinky Dinky","date":"2016-02-03T16:33:29.157+0000","title":"Will This Video Save GD?","subforum":"Gameplay","embed":{"description":"LIKE because you're here to enjoy the comments of people flipping out over this topic. *Subscribe to Lootcrate and get trinkets every month! http://bit.ly/1FZmMOn & 10% discount code STONE008 *Use my Crunchyroll link to get a free - 1 month trial of unlimited anime http://bit.ly/1QHTOr6 *Reduce your Lol ping (free trial available) - http://bit.ly/1HtwbQw Question of the Day - Who do you think are the easiest champions and the hardest champions?","url":"https://www.youtube.com/watch?v=itVTcUztFMU","image":"https://i.ytimg.com/vi/itVTcUztFMU/hqdefault.jpg"},"up_votes":30,"down_votes":13,"body":"Probably not. But perhaps it will wake up some of ya.","replies":[{"poster":"Penns","date":"2016-02-03T17:13:07.508+0000","up_votes":15,"down_votes":1,"body":"\"Master Yi will die to a feather after he is ccd\" haha","replies":[{"poster":"Only Play Darius","date":"2016-02-04T00:56:50.246+0000","up_votes":3,"down_votes":0,"body":"Well up until the bruiser builds became standard that's how it was, not entirely inaccurate.  People just realized that 700 damage crits at 2.5 attack speed mean nothing if a stray Draven axe is enough to do you in","replies":[{"poster":"Penns","date":"2016-02-04T11:29:48.706+0000","up_votes":1,"down_votes":0,"body":"This video is from a vew days ago so I think he shouldve known that Yi has a pretty high win rate even in high elo because he goes 2 really cheap damage items and tank after that. Pretty much any carry dies if you \"just cc\" them, but Yi with Steraks and over 3k HP... idk","replies":[]}]},{"poster":"Rinky Dinky","date":"2016-02-03T17:15:13.420+0000","up_votes":1,"down_votes":0,"body":":')","replies":[]}]},{"poster":"fééd l0rd","date":"2016-02-03T17:39:33.269+0000","up_votes":7,"down_votes":5,"body":"Yi is easy to play but incredibly hard to master (yi).\n\nIf people would put effort into searching for ways to deal with these champions instead of complaining about these champions there wouldn't be nearly as much whiny threads as they are here.\n\nBtw - Yi has a 30% winrate on probuilds.","replies":[{"poster":"Remlap1223","date":"2016-02-03T19:32:18.143+0000","up_votes":4,"down_votes":3,"body":"The problem with Yi is that the only way to deal with him is to get one person on your team with hard CC to consistently lock him down.  If that person isn't babysitting your team, you are hella screwed.  I'm not even going to bring up how ridiculous it is to face someone actually good with Yi.  Cowsep is awesome, but the thought of him having a smurf account gives me nightmares.\n\nHowever, on the flipside, if Master Yi is against a team of just CC bots, he's going to be completely useless.  He needs a rework because he's textbook feast or famine and counterpick to counterplay.","replies":[{"poster":"Quepha","date":"2016-02-03T20:06:14.885+0000","up_votes":7,"down_votes":2,"body":"> [{quoted}](name=Remlap1223,realm=NA,application-id=3ErqAdtq,discussion-id=6ZXrFEEK,comment-id=00010000,timestamp=2016-02-03T19:32:18.143+0000)\n>\n> The problem with Yi is that the only way to deal with him is to get one person on your team with hard CC to consistently lock him down.  If that person isn't babysitting your team, you are hella screwed.  I'm not even going to bring up how ridiculous it is to face someone actually good with Yi.  Cowsep is awesome, but the thought of him having a smurf account gives me nightmares.\n> \n> However, on the flipside, if Master Yi is against a team of just CC bots, he's going to be completely useless.  He needs a rework because he's textbook feast or famine and counterpick to counterplay.\n\nHaving weaknesses doesn't mean a champion needs a rework.","replies":[{"poster":"FantasySniper","date":"2016-02-04T00:50:55.665+0000","up_votes":4,"down_votes":0,"body":"He's got a point, though. When a weakness is so debilitating in terms of balance because they are too powerful without it present, you should probably think about changing it.","replies":[{"poster":"Quepha","date":"2016-02-04T00:52:52.689+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=FantasySniper,realm=NA,application-id=3ErqAdtq,discussion-id=6ZXrFEEK,comment-id=0001000000000000,timestamp=2016-02-04T00:50:55.665+0000)\n>\n> He's got a point, though. When a weakness is so debilitating in terms of balance because they are too powerful without it present, you should probably think about changing it.\n\nI don't think Yi is at the point where it's unhealthy. He can still be beaten if your team has no hard cc at all and if your team has a ton of hard cc he can still split push and cause you a lot of trouble.","replies":[{"poster":"Seenan","date":"2016-02-04T03:22:54.451+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Quepha,realm=NA,application-id=3ErqAdtq,discussion-id=6ZXrFEEK,comment-id=00010000000000000000,timestamp=2016-02-04T00:52:52.689+0000)\n>\n> I don't think Yi is at the point where it's unhealthy. He can still be beaten if your team has no hard cc at all and if your team has a ton of hard cc he can still split push and cause you a lot of trouble.\n\nOnly way I can think of is str8 outplaying him with Zhonya tricks or just deleting him before he can move.","replies":[{"poster":"Quepha","date":"2016-02-04T03:58:35.008+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Seenan,realm=NA,application-id=3ErqAdtq,discussion-id=6ZXrFEEK,comment-id=000100000000000000000000,timestamp=2016-02-04T03:22:54.451+0000)\n>\n> Only way I can think of is str8 outplaying him with Zhonya tricks or just deleting him before he can move.\n\nIf you're grouped, your team has to be ridiculously behind to be unable to kill a yi before he can kill more than one target, and a 1-for-1 trade should be considered acceptable against a late-game oriented champion who presents very little early pressure.","replies":[]}]}]}]}]},{"poster":"Steel Blossom","date":"2016-02-04T05:45:17.631+0000","up_votes":1,"down_votes":0,"body":"Textbook feast or famine? I think you meant \"niche\".","replies":[]},{"poster":"gg git diff","date":"2016-02-04T01:07:14.364+0000","up_votes":1,"down_votes":0,"body":"What about pressuring him during his weak early game?","replies":[]}]}]},{"poster":"Zydron","date":"2016-02-03T18:11:51.496+0000","up_votes":5,"down_votes":1,"body":"I wish every video made by stonewall was sent directly to the boards","replies":[]},{"poster":"Bolwinkel","date":"2016-02-04T05:28:58.105+0000","up_votes":4,"down_votes":1,"body":"Every Yasuo main that you meet, I mean true Yasuo main. Like TrinImmortal level of Yasuo main. They will tell you that Yasuo takes skill. Yes, he has windwall. Yes he gets 100% crit from 2 items. Yes, he has a lot of mobility. However, Windwall has fairly long cooldown. Level 1 it's 26 seconds and level 5 it's 18 seconds. That's with 0% cdr (why would you even buy cdr on yasuo). Also, you can't move or reposition his windwall. Once it's out, its there until it disappears. His E is on a .5 second cd at level 1 and .1 cd at level 5. However what people don't realize about his E is that 1. it can only be used on enemies and neutral monsters and 2. he has to wait 10-6 seconds (based on level) to dash through the same target again. Now, on to his crit. A lot of people also seem to not understand the fact that he has to have 3 stacks on his q to be able to ult. Not to mention the fact that his q is a fairly small hitbox on the first two hits. It's also fairly easy to dodge his tornado. They don't realize that Yasuo is going to have a bad time if he is the only form of knockup on a team. On Yasuo you have to think about a lot of things. For example, YOU DON'T HAVE TO ULT ON EVERY KNOCKUP YOUR TEAM HITS. Idgaf what your body is telling you. Unless it's either 1. A knockup on a single enemy who was caught out, 2. The enemy squishies, 3. the entire enemy team, or 4. you have your team to help and follow up on your ult, YOU SHOULDN'T BE ULTING. Yasuo players have to be thinking about what minions to dash through and where it will take me because yasuo's dash is a fixed distance and he can run out of escapes if he isn't too careful. They also have to be thinking about where to place their windwall in a fight. Most good Yasuo players have it as muscle memory and they can kite around it to negate as much damage as possible. Go ahead, I just can't wait for the people to come and comment \"You don't know what the hell you're talking about bronzie\" because I bet you're one of the people who can't play Yasuo well.","replies":[]},{"poster":"Saianna","date":"2016-02-03T20:55:12.177+0000","up_votes":2,"down_votes":2,"body":"I've watched this yesterday. There are some solid arguments etc, but also something feels off. What exactly? Stonewall takes everything from Top/Jungle perspective. And what's healthy for top is nowhere near healthy for bot. What is effective in jungle doesn't mean jack sh#t for mid.\n\n\nI like watching stonewall. I like to learn new stuff, but sometimes it's just annoying. No matter what champion he picks, build ends up 90% the same (build jungle tank). his playstyle is 99% the same (act like a tank). And in the end it's exactly the same story told using different words..","replies":[{"poster":"Itadaki Seieki","date":"2016-02-03T22:16:20.052+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Saianna,realm=EUNE,application-id=3ErqAdtq,discussion-id=6ZXrFEEK,comment-id=0006,timestamp=2016-02-03T20:55:12.177+0000)\n>\n> I've watched this yesterday. There are some solid arguments etc, but also something feels off. What exactly? Stonewall takes everything from Top/Jungle perspective. And what's healthy for top is nowhere near healthy for bot. What is effective in jungle doesn't mean jack sh#t for mid.\n> \n> \n> I like watching stonewall. I like to learn new stuff, but sometimes it's just annoying. No matter what champion he picks, build ends up 90% the same (build jungle tank). his playstyle is 99% the same (act like a tank). And in the end it's exactly the same story told using different words..\n\nWhy change something if it works? He build jungle tank because he's fine being a frontline jungler for his team.\n\nDoesn't mean he can't build carry. He recently put out a \" Carry Nocturne \" game that put him in the carry role. He's also a known Teeto player, because you know, Satan and all of that jazz. He's fine, I love the guy. He teaches me a lot about the game.","replies":[]},{"poster":"Steel Blossom","date":"2016-02-04T05:47:54.913+0000","up_votes":1,"down_votes":0,"body":"So you're saying that a class of champions who pose no threat to all tanks, but have an easy time killing ADCs and APs who don't have Zhonya, is imbalanced? Jeez, better remove all mobile ADCs from this game, then, because those are fucking nightmares for tanks and some bruisers.","replies":[]}]},{"poster":"Sahn Uzal","date":"2016-02-03T17:59:16.986+0000","up_votes":2,"down_votes":0,"body":"I'm a simple man, I see a stonewall video on the boards, I upvote.\n{{summoner:31}}","replies":[]},{"poster":"Streeton","date":"2016-02-04T02:33:52.543+0000","up_votes":1,"down_votes":2,"body":"I totally agree, but if we are talking about the easiest champions, i mean one certain fox comes into my mind. She has 3 flashes in her kit, so you dont need to worry about positioning, you can put her in any match up and she will do decent, and her kit is kinda bland.","replies":[{"poster":"NineTailedMystic","date":"2016-02-04T03:33:09.871+0000","up_votes":2,"down_votes":0,"body":"Dash =/= flash.","replies":[]}]},{"poster":"chipndip1","date":"2016-02-04T00:50:19.913+0000","up_votes":3,"down_votes":2,"body":"Champ is easy = Regardless of difficulty, since I lost to this champ, they MUST be fucking easy to play. No other explanation.","replies":[]},{"poster":"CarameI Frappe","date":"2016-02-03T23:53:37.484+0000","up_votes":3,"down_votes":2,"body":"I used to think {{champion:86}} was OP and I hated laning against him ... but then I decided- \n\nWhy not do research? Turns out, just from taking 5 minutes of my time reading his counters / how he farms / what he builds / what to build to counter him, I ended up stomping most Garen players (mostly using {{champion:80}} as the key counter) and ever since, I did this with every champion I laned against. The video is 100% right. You just have to take the time to understand how to fight against the champions you hate, and also shut them down early if they're going to spike later on.","replies":[]},{"poster":"Gene Freakz","date":"2016-02-04T22:54:33.207+0000","up_votes":1,"down_votes":0,"body":"Wells said, +1","replies":[]},{"poster":"TheRealBaz","date":"2016-02-03T18:53:07.737+0000","up_votes":1,"down_votes":0,"body":"what is 'GD'?","replies":[{"poster":"Wolfenstin","date":"2016-02-03T21:55:57.297+0000","up_votes":1,"down_votes":0,"body":"General Discussion boards, infamous for being the worst of the worst.","replies":[{"poster":"TheRealBaz","date":"2016-02-04T08:22:54.243+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wolfenstin,realm=NA,application-id=3ErqAdtq,discussion-id=6ZXrFEEK,comment-id=00050000,timestamp=2016-02-03T21:55:57.297+0000)\n>\n> General Discussion boards, infamous for being the worst of the worst.\n\nah ok, yeah most of that sucks","replies":[]},{"poster":"Ralanr","date":"2016-02-04T04:31:30.181+0000","up_votes":1,"down_votes":0,"body":"...worst than gameplay?\n\nIs that possible?","replies":[{"poster":"Wolfenstin","date":"2016-02-04T05:59:10.280+0000","up_votes":1,"down_votes":0,"body":"Hell if I know, I don't go there for fear its ideals will corrupt me and somehow leak into how I play the game.\n\nIt's Ravenholm without a gravity gun and buzzsaws.","replies":[]}]}]}]},{"poster":"Shifune","date":"2016-02-04T06:46:15.127+0000","up_votes":1,"down_votes":0,"body":"I used to tell people stuff like this back when I used to play a lot of Katarina. They would always say \"You're playing kat, easiest champ in the game\" or whatever. Meanwhile, I'm sitting here monitoring ever cc ability the enemy team has so I can know when it is safe for me to enter a teamfight. You can't just jump into the middle of 5 people, press R, and get a penta. You will most likely be cc'd and killed instantly if you do. Also, most of my katarina days were from when she had her old w ability. This meant that you had to make a choice between which ability you wanted to empower. Do you want the reduced damage when you jump in or do you want the extra damage and bounces on your q? So yes, while Kat may be an easy champion to pick up and play, she does require a lot of decision making to be played to her maximum potential.\n\nI think you explained this issue perfectly. The champion that people call easy could also be called \"noob killers\" because they excel at carrying in low elo where people don't know how to deal with them.","replies":[]},{"poster":"Teslablade","date":"2016-02-04T02:31:41.483+0000","up_votes":1,"down_votes":0,"body":"Yasuo takes more skill than people admit. The problem is he can survive fights too easily.","replies":[{"poster":"Seenan","date":"2016-02-04T03:25:01.084+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Teslablade,realm=NA,application-id=3ErqAdtq,discussion-id=6ZXrFEEK,comment-id=000a,timestamp=2016-02-04T02:31:41.483+0000)\n>\n> Yasuo takes more skill than people admit. The problem is he can survive fights too easily.\n\nThat's where the skill part comes in. He's a squishy melee until his post-core when he decides that quite possibly, he wants a DMP or something.","replies":[{"poster":"Teslablade","date":"2016-02-04T04:39:26.126+0000","up_votes":1,"down_votes":0,"body":"My point was if he can land a tornado, he can win the fight by effectively suppressing his enemy.  He's a duelist though, so I guess that's his job.","replies":[]}]}]},{"poster":"CasterGilgamesh","date":"2016-02-04T02:18:36.691+0000","up_votes":1,"down_votes":1,"body":"yi  really is easy same with yasuo if you don't just flat out CC or get much more fed than them they destroy anyone no matter what kind of situation/match up besides maybe a tank that literally stacks enough armor to nullify their damage.Even then Yi has true damage plus tons of attack speed maybe if he didn't build a lifesteal item he would be kill able to {{item:3075}}.Just because a champion has counter picks and can be CC'ed to death does not mean they aren't Op since Every champion is weak to being CC'ed to death and Any champion can have a counter plus you shouldn't need to be forced to play another champion just because one champion is broken.","replies":[]},{"poster":"CoolHandJack","date":"2016-02-03T18:23:32.496+0000","up_votes":1,"down_votes":1,"body":"No, this point has been made a hundred thousand times,  changed nothing.","replies":[]}]}