{"poster":"Bockmist","date":"2015-03-09T00:16:38.266+0000","title":"Kann Riot mal bitte was gegen diese drecks high elo Smurfs im ranked machen?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":1,"body":"Gerade mein 4.  Placement Match gespielt und der Gegner Jungle Yi (ja Yi ist der totale crap champion bla bla) walzt alles um (32-4 etc). Das letzte Spiel war von dem war ein Jax ranked game mit 24-3-2 oder so. Das versaut einem echt den Spaß am ranked.","replies":[{"poster":"HyperionCH","date":"2015-03-09T00:30:47.400+0000","up_votes":2,"down_votes":0,"body":"Seltsamer \"High-Elo-smurf\", der mehrere hundert Rankeds letzte Season (alleine mit seinem Main Udyr 116) spielt und trotzdem in Silber spielt. ;)","replies":[]},{"poster":"fakeaccftw","date":"2015-03-10T19:29:23.390+0000","up_votes":1,"down_votes":0,"body":"haben sie gesagt das sie smurfen ? ich mein yi spielen ist nich das schwerste ( wirklich gut zu spielen etwas anderes) das er beinah nur auf draufhauen und timing basiert :P","replies":[]},{"poster":"MID or NUKE","date":"2015-03-09T01:58:51.939+0000","up_votes":1,"down_votes":1,"body":"Und warum sollte man Smurfen verbieten,  vorallem wie willst du es verbieten, dazu macht Smurfen einfach zuviel Spass, da kannst du neue Champs oder Build-Orders üben ohne direkt in deine Normale MMR zu müssen.","replies":[{"poster":"Alustus","date":"2015-03-09T11:58:41.117+0000","up_votes":1,"down_votes":0,"body":"Mal abgesehn dass ich bezweifle, dass es soviele smurf gibt um das eigene Spielerlebniss  wirklich zu beeinflussen:\n\n\nvielen geht es beim smurfen nicht um den Spaß, also nicht um noobs zu verprügeln (zumindest bei high elo spielern)\nViele spielen mit den smurfs um neue Positionen/Champs zu lernen. Oder wenn Sie müde sind und keine 100% mehr geben können.\nUnd wirkliche High Elo Spieler Dia1+ spielen oftmals mit smurfs um nicht 20 minuten auf ein game zu Warten falls mal weniger Gegner online sind.","replies":[]}]},{"poster":"LuckingFegendary","date":"2015-03-09T06:24:29.616+0000","up_votes":1,"down_votes":0,"body":"Sollte jemand smurfen (hatte ich letzte Season bei meinen Einrankedgames, das ganze wurde dann auf Twitch gestreamt, weshalb ich dann auch darauf aufmersam wurde), landet er sowieso gleich recht hoch oben, außer er versucht ein Experiment wie \"Raus aus der Elo-Hell\", dann dauert das aber auch nicht allzu lange.\nDas System kann ja nicht einfach sagen: \"Ich glaube das ist ein Smurf. Ich stufe ihn jetzt in Division X ein.\"","replies":[]},{"poster":"Zero000","date":"2015-03-09T00:29:38.190+0000","up_votes":1,"down_votes":0,"body":"Und warum sind besagte Spieler jetzt Smurf Account?\nMan muss kein Smurf Spieler sein um solche Stats zu haben.\nAuch sind die Einstufungs Spiele doch genau dafür da, um eine grobe Einstufung in bessere und schlechtere Spieler zu machen. Wo ist also das Problem?","replies":[]}]}