{"poster":"Fri3dChickn","date":"2016-09-23T04:26:04.497+0000","title":"Tribunal System Sucks And The Community Is Underage","subforum":"Player Behavior","up_votes":3,"down_votes":17,"body":"Well whoever thought of the tribunal system took the biggest L. You let the most toxic gaming community run a tribunal system? Wtf? And what is wrong with everyone crying out report every time they have a bad game? Every time someone says report I feel like they&#039;re telling on me like it&#039;s elementary school. Very childish. I mean high ranks everyone is mature ,  a few bad words gets dropped ..but when it comes to low ranks idk if i&#039;m playing with 15 year olds or something but if I give criticism while making a &quot;little offensive joke&quot; to a player to benefit the whole team they automatically cry and /all report.  Like maybe I&#039;m used to console gaming, because I could say 99% of the things that could get you banned in league and everyone will laugh and joke about it. The tribunal system needs a lot of work. People get banned for the most softest &quot;insults&quot;.  I don&#039;t even know if it  should be called insults. The community will forever be toxic because it&#039;s a team game, just like any other sports team or other online games. I feel like if a league player played COD or Halo they&#039;ll start crying. Or maybe I&#039;m just too old for this game. Either way, this community needs to grow a pair. Maybe it&#039;s just NA..\n\nAll I'm saying is I shouldn't be banned for calling some1 sht. it's the truth.\n\nLike my football team, my coach is reckless. He gets straight to the point. Goes hard... He doesn't sugar coat anything. He will insult you , joke about you until you play better. Reasons why league will never be a real sport. you kids.\n\n\nTSM'S Coach Reginald shows many examples of toxicity in league.. but it's going to happen. Why should he get banned for it?\n\nhttps://www.youtube.com/watch?v=hBMjvLJAGsQ\n\nhttps://www.youtube.com/watch?v=wPfHDIkIcks\n","replies":[{"poster":"Awkward Couch","date":"2016-09-23T05:52:13.086+0000","up_votes":8,"down_votes":0,"body":"The main difference is, when you're playing football, it's the coach's job to tell you what you're doing wrong.  It's your job to listen and take it.  In League, you're not in charge, no one put you in charge, they don't have to listen to you.\n\nYou can also give criticism in League and not get banned, it's really not that hard.  If you say \"Mundo build armor against Pantheon\" no one is going to report you, and if they did, you won't get punished for saying something like that.  What you will get punished for is being an ass to your teammates saying something like \"Mundo you fucktard, why didn't you build any MR? KYS\".  If you can't realize the difference between the two examples, then League isn't for you.\n\nI also love how you try to prove that there is toxicity in League by showing the two TSM VODS, when in fact, Regi is the teams coach, and this takes place outside of the game.  Doing exactly what your football coach does.  But what Regi does with his team is none of Riot's concern because, Riot doesn't control every aspect of player's lives outside of the game.  If you are going to try and prove this point, at least show something like this https://mobile.twitter.com/Prototype_Vayne/status/718529484509421569/photo/1 which is actual in game toxicity from a Pro LCS player.","replies":[{"poster":"JhomasTefferson","date":"2016-09-23T06:03:52.527+0000","up_votes":1,"down_votes":11,"body":"It became toxic when he said sorry your dad never loved you. Up to that point it should have been fine.\n\n>You can also give criticism in League and not get banned, it's really not that hard. If you say \"Mundo build armor against Pantheon\" no one is going to report you, and if they did, you won't get punished for saying something like that. What you will get punished for is being an ass to your teammates saying something like \"Mundo you fucktard, why didn't you build any MR? KYS\".\n\nImo it would have been fine if he didn't say kill yourself.","replies":[{"poster":"Karunamon","date":"2016-09-23T19:54:26.065+0000","up_votes":2,"down_votes":0,"body":"\"Mundo you fucktard, why didn't you build any MR\" is just straight up flaming and has no place on the Rift. It tilts people, loses games, and will get you {{summoner:11}} ed.\n\n**Just don't do it.** It's not that hard.","replies":[{"poster":"JhomasTefferson","date":"2016-09-23T20:36:21.994+0000","up_votes":1,"down_votes":3,"body":"That's your opinion.","replies":[{"poster":"Karunamon","date":"2016-09-24T21:48:46.216+0000","up_votes":2,"down_votes":0,"body":"Also the opinion of the people who will be reporting you for acting like that.\n\nHey, it's your account. You want to risk it because you can't exercise any self control, knock yourself out.","replies":[]}]}]}]}]},{"poster":"Zezockary","date":"2016-09-23T05:37:25.093+0000","up_votes":6,"down_votes":0,"body":"http://operations.nfl.com/football-ops/fines-appeals/\n\nScroll down to sportsmanship.\n\n$9,000 fine for taunting. $12,000 for excessive profanity. If anything rules like this make league MORE like a sport.\n\nThose are a minimum, it can be more.","replies":[]},{"poster":"archerno1","date":"2016-09-23T06:11:16.889+0000","up_votes":5,"down_votes":0,"body":"Tribunal was down last 3 years...","replies":[]},{"poster":"Kei143","date":"2016-09-23T07:58:58.996+0000","up_votes":2,"down_votes":0,"body":"having an organized team with a coach (where their goal is to make you improve, whether you agree or disagree with their methods) is very different than a stranger from soloQ (more comparable to street ball)  tell you rude stuff.","replies":[]},{"poster":"EvilDustMan","date":"2016-09-23T08:08:12.832+0000","up_votes":3,"down_votes":1,"body":"You are mistaking being offended for being annoyed. You don't really offend that many people. But you most likely annoy them. Who wants to play a game with someone constantly assaulting them verbally? It's like having a yappy dog in the room while you play.\n\nRiot bans yappy dogs.","replies":[]},{"poster":"Ada Wong","date":"2016-09-23T21:18:26.703+0000","up_votes":1,"down_votes":0,"body":"Riot doesn't seem to ban players fast enough players playing like Retards, no lack of understanding in ranked at all things like \"Intentionally\" putting the enemy ahead, causing arguments, not understanding anything over-all running around doing nothing to support your team takes forever to get banned it seems like off league because Riot considers it bad play....\n\nYet in \"Vainglory\" I have reported kids who just follow me around jungle, or enter my lane and throw me off not understanding anything and this is what I see over 80% of the time...\n\nhttp://i.imgur.com/A2cnXNZ.jpg","replies":[]},{"poster":"JhomasTefferson","date":"2016-09-23T04:45:35.061+0000","up_votes":1,"down_votes":8,"body":"100% agree. I didn't like people calling me bad at this game, so i just got better. now people rarely say to me \"you feeding fuck\" or \"shit map awareness noob\" and when they did/do, guess what? i didn't/don't report them.\n\nI feel like toxicity starts when they start assaulting your character(as a person, not the champ youre playing). Rude comments towards your gameplay shouldn't be considered toxic.","replies":[{"poster":"VoidPoro101","date":"2016-09-23T05:03:14.726+0000","up_votes":1,"down_votes":6,"body":"> [{quoted}](name=JhomasTefferson,realm=NA,application-id=ZGEFLEUQ,discussion-id=IErlpUA4,comment-id=0001,timestamp=2016-09-23T04:45:35.061+0000)\n>\n> 100% agree. I didn&#x27;t like people calling me bad at this game, so i just got better. now people rarely say to me &quot;you feeding fuck&quot; or &quot;shit map awareness noob&quot; and when they did/do, guess what? i didn&#x27;t/don&#x27;t report them.\n> \n> I feel like toxicity starts when they start assaulting your character(as a person, not the champ youre playing). Rude comments towards your gameplay shouldn&#x27;t be considered toxic.\n\n\nBasically this. If they start talking about things irrelevant to the game they should be banned. Reginald was raging and dropping a few F bombs but It was about the game ... he wasn't insulting anyone personally. Riot fix the system.","replies":[{"poster":"JhomasTefferson","date":"2016-09-23T06:02:41.105+0000","up_votes":1,"down_votes":6,"body":"***","replies":[{"poster":"Mister Punches","date":"2016-09-23T07:11:51.781+0000","up_votes":2,"down_votes":0,"body":">look at all the pussies downvoting\n> I feel like toxicity starts when they start assaulting your character\n\nAnd now the toxicity starts. Ladies and gentlemen, the League community.","replies":[{"poster":"TyrekGoldenspear","date":"2016-09-23T08:15:42.559+0000","up_votes":1,"down_votes":0,"body":"*grabs popcorn*","replies":[]}]}]}]},{"poster":"Fri3dChickn","date":"2016-09-23T04:53:45.677+0000","up_votes":1,"down_votes":4,"body":"EXACTLY. So much people rage at me and insult me but I never report them. I just laugh or make a joke back. I don't even report afks.. lmao.","replies":[]}]},{"poster":"KVbqbFsC8e","date":"2016-09-23T06:55:26.259+0000","up_votes":1,"down_votes":0,"body":"Comparing League to an actual sport just isn't valid. The difference in handling and interpreting trash talk is massively different between professional sport players, and League playing teenagers.","replies":[]},{"poster":"Around999People","date":"2016-09-23T05:41:40.505+0000","up_votes":1,"down_votes":1,"body":"Ok, so I. Football, if you start screaming profanities loud enough for everyone to hear about how the person you're facing is shit that's good? Or about your own team? Like, when has that ever happened? Hell the only times I've ever even known of it people never got to play again I believe","replies":[{"poster":"Awkward Couch","date":"2016-09-23T05:59:14.697+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Around999People,realm=NA,application-id=ZGEFLEUQ,discussion-id=IErlpUA4,comment-id=0003,timestamp=2016-09-23T05:41:40.505+0000)\n>\n> Ok, so I. Football, if you start screaming profanities loud enough for everyone to hear about how the person you&#x27;re facing is shit that&#x27;s good? Or about your own team? Like, when has that ever happened? Hell the only times I&#x27;ve ever even known of it people never got to play again I believe\n\nhttps://www.youtube.com/watch?v=X1KsBdkZDjA","replies":[]}]},{"poster":"Mister Punches","date":"2016-09-23T05:53:44.545+0000","up_votes":1,"down_votes":0,"body":"There's just one problem about your theory, bud: The Tribunal doesn't exist anymore.","replies":[{"poster":"JhomasTefferson","date":"2016-09-23T06:04:25.121+0000","up_votes":1,"down_votes":1,"body":"lets just pretend he said the moderation system in general.","replies":[]}]},{"poster":"KayyK","date":"2016-09-23T04:38:17.789+0000","up_votes":1,"down_votes":0,"body":"League is a sport? since when.","replies":[{"poster":"Fri3dChickn","date":"2016-09-23T05:07:28.787+0000","up_votes":1,"down_votes":0,"body":"idk man","replies":[]}]}]}