{"poster":"monto78","date":"2017-03-10T01:27:25.070+0000","title":"da bronzo ad argento","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"con un po di fatica sono riuscito a fare la scalata da bronzo 5 a silver 5.. siccome &egrave; da 1 anno e mezzo che gioco e so giocare solo 6 champion.. volevo addestrarmi in altri 4 o 5 champions prima di rigiocare le ranked.. c&#039;e il rischio che mi facciano scendere di divisione? e nel caso gioco le ranked.. quante sconfitte consecutive ho in buono  prima di essere rispedito in bronzo 1?","replies":[{"poster":"Dissociated","date":"2017-03-10T10:36:57.312+0000","up_votes":3,"down_votes":0,"body":"Nella mia esperienza giocare in normal non vale come allenamento, perché le persone giocano a caso. Io stesso sono gold 3 ma in normal gioco come un bronzo: gioco ruoli che non conosco, provo trollpick, non gruppo mai, mi butto sotto torre. Per dire, in ss6 pensavo di essere fortissimo perché avevo un winrate assurdo in normal, ma in ranked già in silver3 mi riempivano di schiaffi.\n\nSe vuoi migliorare allenati su queste cose:\nLaning phase:\n-coprire gli invade\n- come lasthittare i creep\n- come tradare (scambiare colpi col nemico)\n- map awarness (impara a guardare la mappa ogni pochi secondi per controllare se ci sono pericoli o opportunità)\n- i matchup specifici (quanti danni fai, quanti ne fa l' avversario, come punire i nemici, come vieni punito, cosa comprare e come cambiare stile sulla base di quello che comprano i nemici)\n\nMidgame:\n- quando roammare\n- controllo wave\n- come giocare se ti camperano\n- come gankare con l'aiuto del jungler\n- come wardare\n- punire i roam\n- tiltare i nemici\n-coprire draghi e herald\n\nLategame:\n- teamfight\n- splitpush\n-evitare il \"brush of death\"","replies":[]},{"poster":"Jeanne dˆArc","date":"2017-03-10T06:02:10.561+0000","up_votes":2,"down_votes":0,"body":"Non c'è la retrocessione per inattività fino al Gold 1, quindi puoi riprendere a fare ranked quando vuoi. Le partite di protezione ci sono: 10 partite \"cuscinetto\" tra una lega e l'altra e 3 partite tra le divisioni.","replies":[]}]}