{"poster":"Big Lincoln","date":"2015-05-07T13:37:37.135+0000","title":"Ich verliere enorm viel LP! Warum?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Hey, wie genau funktioniert das LP System? Denn ich verliere mehr LP, wenn ich verliere als ich bekomme, wenn ich gewinne. \r\nBei einem Lose so c.a. -30 bis -40. Bei einem Win +10 bis +25. Das bedeutet ich muss mehr als 80% meiner Rankeds gewinnen um &uuml;berhaupt aufsteigen zu k&ouml;nnen? Das ist enorm schwierig, fast schon unschaffbar.\r\n\r\nWie genau funktioniert dieses LP System?","replies":[{"poster":"Danny89","date":"2015-05-07T17:48:18.521+0000","up_votes":2,"down_votes":0,"body":"Alle und detaillierte Informationen findest du hier: http://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/IqBzFyO9-der-informationsthread-aber-ligen-mmr-und-hidden-elo","replies":[]},{"poster":"Imb4lanced","date":"2015-05-07T17:36:04.566+0000","up_votes":2,"down_votes":0,"body":"Warum verstehen es einige menschen nicht? Gewinnen oder verlieren ist egal. Und aufsteigen ist auch komplett egal. \n\nnur VERBESSERN ist wichtig. Nix anderes. Es ist egal ob du bronze landest solang du immer wieder deinen champion besser lernst. Die position, farmen, gameplay. \n\nEiner macht gleiche fehler 1 mal anderer macht sie 100 mal. Einer sucht fehler beim verlieren bei anderen, anderer sieht seine fehler immer, egal wie ausgangs des spiel ist. \n\nzb : auch wenn du 10-0 gewinnst. Kannst immernoch fehler machen wie : verpassen der cs beim fast push. Oder schlechte ausführung der skillcombos. Verschwendung von summoner spells wie flash oder ignite. \n\nEs ist immer wichtig wenn du lernst, alles versuchen perfekt zu machen. Und niemals anfangen zu trollen nur weil du 10-0 stehst. So lernst du einfach weniger aus dem spiel. Richtige einstellung und lernbereitschaft ist wichtig um weiter zu kommen, sei es lol oder in der schule/arbeitswelt/beziehung und co.","replies":[]},{"poster":"Señor Phantom","date":"2015-05-07T13:45:00.757+0000","up_votes":2,"down_votes":0,"body":"Das liegt daran das das Ligasystem denkt du gehörst nicht in deine jetzige Liga.\n\nIch habe mir mal den Spaß gemacht und mir dein Profil angeguckt und du hast 73 Games gespielt und nur 23 davon gewonnen ~31,51% Winrate. Nun ist es aber so das das System dich so einordnen will das du auf 50% Winrate kommst, also ist es normal das es dich runterstuft damit du gegen leichtere Gegner spielst und somit mehr gewinnst, dadurch sollte sich deine Winrate i-wann wieder einpendeln und wenn dies passiert ist bist du deinem Spielstyle nach eingeranked.\n\nAlso Ja es ist normal das du diese Punkte bekommst/verlierst.\n\nMit freundlichen Grüßen,\nSeñor Phantom\nEin Troll im Körper von {{champion:31}}","replies":[{"poster":"Big Lincoln","date":"2015-05-07T15:18:11.486+0000","up_votes":1,"down_votes":0,"body":"Das ist ja schei*e gemacht, also keine Chance auf zu steigen -_-? Ich meine, ein Liga System ist für mich sowas wie : Ich will mich verbessern und aufsteigen. So ist das eher : Werde mal Bronze V, dann werde besser, dann steig erst auf.","replies":[{"poster":"Veezey","date":"2015-05-07T16:18:44.568+0000","up_votes":2,"down_votes":0,"body":"Wenn du in Bronze 5 gehörst, dann wirst du da auch früher oder später landen. Wenn du besser wirst, dann steigst du auch auf. Das System funktioniert schon richtig so.","replies":[]},{"poster":"Señor Phantom","date":"2015-05-07T17:53:10.042+0000","up_votes":1,"down_votes":1,"body":"Die Aussage ist Theoretisch falsch weil wenn du irgendwann so tief gefallen bist das du auf deiner richtigen elo bist wirst du 50% winratio haben und damit steigst du dann auch auf aber mit der winratio die du grade hast ist es klar das du für das System in Bronze 5 gehörst und da muss man dir auch nix von der schönen Welt erzählen.\nWenn du nicht bald anfängst zu gewinnen landest du Bronze 5, ich meine 23 Wins / 50 Defeats ist klar und deutlich Bronze 5 Niveau, und wenn du besser sein solltest als Bronze 5 dann wirst du niemals Bronze5 kommen weil du theoretisch ja gegen die \"achso schlechten Bronze 5Player\" wie sie ja immer genannt werden nicht verlieren kannst....\n\nMit freundlichen Grüßen,\nSeñor Phantom\nEin Troll im Körper von {{champion:31}}","replies":[]}]}]}]}