{"poster":"YedStaar","date":"2016-10-04T11:43:29.470+0000","title":"[HELP] Account Suspension with no additional details.","subforum":"Miscellaneous","embed":{"description":"The easy way to save screenshots, GIFs, and websites. Make everyone happy by sharing smarter, faster, and with your point crystal clear.","url":"https://gyazo.com/7660d6b6d8496cdc1b6073cb8eb6c4b4","image":"https://i.gyazo.com/thumb/1200/_141b84a04bec384db9b8f1098489388c-png.jpg"},"up_votes":1,"down_votes":0,"body":"So today I have come back from a week trip and I open up my League client, attempt to log in and I receive a message saying that I am suspended till the 12th of October and that I should check my email for additional details. I went and opened up my email, seeing no email sent in by Riot telling me why am I suspended. Can someone please help me out here and tell me what to do?","replies":[{"poster":"xDarkRavenx","date":"2016-10-04T12:13:18.030+0000","up_votes":1,"down_votes":0,"body":"Send in a support ticket at https://support.riotgames.com/hc/en-us","replies":[{"poster":"YedStaar","date":"2016-10-04T12:16:03.342+0000","up_votes":1,"down_votes":0,"body":"I have sent one and i chose the option 'I have a question about riot games' and then I chose account --> transfer option and I've sent one but I don't know if that was the correct choice.","replies":[{"poster":"Wuks","date":"2016-10-04T18:13:31.216+0000","up_votes":1,"down_votes":0,"body":"It should get to the appropriate department (Player Behaviour) regardless. Hang tight and you should receive a response; however, in the off-chance that you don't receive a response within 7 days (you should get a response before this anyway), please let me know and I'll try to get context behind this suspension for you.","replies":[{"poster":"YedStaar","date":"2016-10-05T23:41:06.679+0000","up_votes":1,"down_votes":0,"body":"Hello Wuks, it's been 2 days since I've made the support ticket and I have not received any response from Riot. It would be really great if you can find out for me the context of my suspension.","replies":[{"poster":"Wuks","date":"2016-10-07T02:10:32.078+0000","up_votes":1,"down_votes":0,"body":"There's a ticket queue, and Riot Support will get to yours as soon as they can.","replies":[]}]}]}]}]}]}