{"poster":"YedStaar","date":"2015-10-27T23:27:32.509+0000","title":"Hacker found - xl Kenny lx","subforum":"Help & Support (OCE)","embed":{"description":"Check your Summoner statistics, MMR, realtime spectate and using powerful global LoL Charts!","url":"http://oce.op.gg/summoner/userName=YedStaar","image":"http://attach.s.op.gg/logo/20151013181540.9e341b820aa4da9076f6c76c62b98a41.PNG"},"up_votes":1,"down_votes":1,"body":"Hello riot support, I would like you to ban this person right here whose name is xl Kenny lx because of 2 good reasons:\n1. When I vsed this Tristana (the match of Vayne which I lost) it says on my client that he is a Diamond V and that really doesn&#039;t make sense because I&#039;m a Silver IV, how am I to vs a Diamond V?\n2. He changed his name on op.gg to CHOCOLATExoxo so what this guy tried to do was play on his main account and somehow hacked and changed his name on this website.\nI strongly urge you to ban this person because I find it real unfair for someone of my skill level vsing someone of his and then hacking his way out of it ( check my match against the &quot;chocolate&quot; tristana from your databases, he shouldnt be the one in the match, it should be xl kenny lx).\nI have a screen here showing xl Kenny Lx from my lol client in that match and his actual stats and screens of his recent match history.\n https://gyazo.com/7dbbab97f7b6ac40f7ecac29dfc9b8b9\nhttps://gyazo.com/91810b1eb7e42e6336791c00ec5e93cd\nhttps://gyazo.com/4eaae9e56126ca2553dc418f2bc937af\nP.S I could be wrong and it may be the other way around but I want you rioters to help me out to find out what the hell is going on and why I gotta deal with this crap.\nEdit: I just checked my stats on oce.op.gg and his name changed back so I dont know if it was an error or he actually did hack so hopefully you guys can tell me.","replies":[{"poster":"You Pick My Hero","date":"2015-10-28T01:12:52.465+0000","up_votes":1,"down_votes":0,"body":"There is no proof of a name change that I can see. Plus you are sometimes put against higher ELO players because of the match times. Do you want to wait 15mins for League to find someone at your level or do you want to get into a game at a reasonable time with someone a little higher? \n\nELO means nothing. Diamond doesn't mean anything. So many people buy accounts these days. I have versed many diamonds and won. I am only in Bronze and I admit that is where my level is. I am not too good at this game but Diamonds don't mean they are good. \n\nYou may come across a few that are pretty good and that just means that you need to watch what they do in game and hopefully learn from it. \n\nDo not complain here when you had a great opportunity to learn some league from a diamond player and move up.\n\nNext time just accept that he is diamond and watch and learn for future games. \n\nThat is my advice. You don't have to listen but I don't need negative comments after reading this. I am just giving my opinion and I am not trying to be mean.\n\nThank you for listening.\nAndyTheEskimo","replies":[{"poster":"YedStaar","date":"2015-10-28T09:02:40.442+0000","up_votes":1,"down_votes":0,"body":"I'll be honest, had no problem that he was Diamond but the fact when I looked at the stats before it was changed, it put someone else's name on it which I find is quite unfair since the guy should have shown his real name and i guess he did over time.\nEdit: I solved the issue, spoke with the guy, apparently there are 2 other guys with the same name lmao","replies":[{"poster":"You Pick My Hero","date":"2015-10-28T21:07:46.056+0000","up_votes":1,"down_votes":0,"body":"Ok no worries :) Glad you found the issue","replies":[]}]}]}]}