{"poster":"Uchih4 M4dara","date":"2015-06-25T00:44:43.591+0000","title":"Nerf a Akali?","subforum":"Charlas Generales","up_votes":1,"down_votes":15,"body":"bueno acabo de perder como siempre otra partida, y que paso en esta? yo era yasuo y toco vs akali... los wanna be pros diran a pero es f&aacute;cil ganarle solo tienes que dodgear etc etc.... no, va a mas haya de la habilidad, a esta champ la prob&eacute; cuando estuvo gratis, de hecho fue mi primera vez y que paso? CHAN CHAN CHAAAAN&iexcl;&iexcl; pentakill, ojo la use una vez y me basto para ver su da&ntilde;o rid&iacute;culo, tiene mucho sustain, abusa en lvl 6 contra cualquiera, sus enfriamientos son un chiste, su da&ntilde;o inicial con la Q es rid&iacute;culo es absurdamente alto, encima con su R atraviesa unidades cosa que se me hace OP.\r\nYo como experiencia jugandola 3 veces saliendo 23/4 27/6 \r\ntengo que decir que esta campeona es peor y mas abusiva que Leblanc,es como katarina pero un poquito casi nada mas dif&iacute;cil \r\nsi hay champs para contrarrestarla pero aun asi es molesta contra cualquier AD o AP, Melee o de rango mata y pega mucho cosa que ya me canso bastante de que cualquiera (incluyendome) se haga quadrakills incluso pentakills con apretar 3 botones\r\nquiero saber que opinan, como dominarla, si necesita en nerf o no, y en que necesita el nerf\r\neso buenas noches.","replies":[{"poster":"ZE1T","date":"2015-06-25T01:02:49.819+0000","up_votes":3,"down_votes":0,"body":"Sinceramente me duele lo de \"Peor que LeBlanc\".... Akali tiene countereos pero eso sí, que te gankeen, compra pinks, tenela a raya porque es cierto, que al igual que Zed, Lee, Riven entre otros, son Snowball, con unas pocas kills ya empiezan a romper todo, Y que te parecería que... LB es un casi counter de ella ._. Tenes que saber jugar contra un campeon, no opines rapido porque vienen estos creidos y empiezan a bardear, practicala mucho si es que la tenes y ahi vas a ver que tiene sus puntos debiles (su combo tiene unos pocos segundos en el cual se acaba y no puede hacer mucho por ejemplo, tambien el CC contra ella y el que no tenga minions con los cuales usar su R y escapar son situaciones que le joden mucho...","replies":[{"poster":"FurchiDC","date":"2015-06-25T02:21:11.451+0000","up_votes":1,"down_votes":0,"body":"LeBlanc y Zed son un dolor en el ano para Akali.","replies":[{"poster":"ZE1T","date":"2015-06-25T17:54:34.209+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FurchiDC,realm=LAS,application-id=v7qsfXsE,discussion-id=q7zi51pm,comment-id=00010000,timestamp=2015-06-25T02:21:11.451+0000)\n>\n> LeBlanc y Zed son un dolor en el ano para Akali.\n\nZed no tanto, en fase de lineas Zed tiene que forzarla a gastar su W para tirarsele con la ult :/ es molesto (Experiencia :C)","replies":[]},{"poster":"ZE1T","date":"2015-06-25T17:53:20.928+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FurchiDC,realm=LAS,application-id=v7qsfXsE,discussion-id=q7zi51pm,comment-id=00010000,timestamp=2015-06-25T02:21:11.451+0000)\n>\n> LeBlanc y Zed son un dolor en el ano para Akali.\n\nGracias por la sutil imagen...","replies":[]}]}]},{"poster":"Mr Crowley","date":"2015-06-25T00:48:42.688+0000","up_votes":1,"down_votes":3,"body":"Opino que Akali es un gran champion para matar gente que no sabe jugar, e aqui un ejemplo; despues es bastante normalita tirando a mala","replies":[{"poster":"Hwaxinghz","date":"2015-06-25T01:00:20.201+0000","up_votes":2,"down_votes":0,"body":"No tanto que no sabe jugar, mas bien que no sabe posicionarse, es cuestión de que Akali te enganche con una Q, lanzas ulti y al explotar esa marca hace daño ridículo, si te posicionas bien para que no te pueda meter la Q, Akali mucho que no sirve en TF, no aportaría nada al equipo si no puede deletear a alguno de los Carrys.","replies":[]},{"poster":"ZE1T","date":"2015-06-25T00:58:18.531+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mr Crowley,realm=LAS,application-id=v7qsfXsE,discussion-id=q7zi51pm,comment-id=0000,timestamp=2015-06-25T00:48:42.688+0000)\n>\n> Opino que Akali es un gran champion para matar gente que no sabe jugar, e aqui un ejemplo; despues es bastante normalita tirando a mala\n\nQue agresivo, no te parece?","replies":[]}]},{"poster":"Amethyst Gamer","date":"2015-06-26T02:41:12.867+0000","up_votes":1,"down_votes":0,"body":"Jajaja antes de nivel 6 no hace nada... E incluso para ser brutal tiene que esperar a tener sus 3 cargas en la R... Pensas que esta rota? Ni te imaginas antes cuando podías activar su Q con su E... Ahora solo se puede explotar la marca con un básico... Eso hace que pierdas tiempo en el combo! Antes del nerfeo te hacías un pentakill y encima el equipo enemigo revivia y los volvias a matar! Ahora perdió mucho potencial! Es facil hacerle frente y si la matas en early ya es GG","replies":[]},{"poster":"FurchiDC","date":"2015-06-25T02:20:15.291+0000","up_votes":1,"down_votes":0,"body":"Yo maineo Akali y sí es cierto que hago un daño ridículo, pero cuesta llegar a eso. Tengo un early ASQUEROSO donde tengo que farmear bajo torre hasta ser lvl 6 y recién ahí empezar a jugar. Tampoco hay que olvidarse que a diferencia de Kata y LeBlanc, Akali puede dañara 1 campeón a la vez, por lo que en TF es media mala, y si te comés algún CC te moriste, porque es de papel.\nNo necesita un NERF, incluso te diría que necesita un Buff, debería poder explotar la marca con la E, como Katarina explota sus marcas con la W.","replies":[{"poster":"NelsonFT","date":"2015-06-25T03:04:51.506+0000","up_votes":1,"down_votes":0,"body":"De hecho lo único que explota la marca de la Q es el ataque básico, así que es dependiente de eso más que otra cosa...","replies":[]}]},{"poster":"Monserrat tu sup","date":"2015-06-25T02:31:37.777+0000","up_votes":1,"down_votes":0,"body":"Si quieres dejar de ver akalis sube a oro+ y listo veras 1 en 100000 partidas","replies":[{"poster":"NelsonFT","date":"2015-06-25T03:01:55.495+0000","up_votes":1,"down_votes":0,"body":"Ni siquiera he jugado mis 10 rankeds, pero puedo avalar lo que decís porque veo partidas en Internet. Que tampoco es necesario ver partidas, porque cualquiera puede analizar y darse cuenta que no es un campeón hecho para las TF.","replies":[]}]},{"poster":"NelsonFT","date":"2015-06-25T02:59:22.720+0000","up_votes":1,"down_votes":0,"body":"Akali no necesita nerf. Es un campeón asesino, así que es normal que pegue mucho. Akali va a por objetivos individuales y si gasta las cargas de la ulti se vuelve useless. Es muy fácil contrarrestar su W si se tiene un pink encima. Cualquier CC la puede dejar afuera de combate, como a Katarina. Usa energía y a pesar de que la regenera rápido, en muchas situaciones puede quedarse sin la suficiente para acabar con un enemigo. Difícil ganarle si se fedea? Por supuesto, como a cualquier otro campeón!","replies":[]},{"poster":"Sir Crucifix ","date":"2015-06-25T02:56:35.799+0000","up_votes":1,"down_votes":0,"body":"akali ?","replies":[]},{"poster":"Kobalth","date":"2015-06-25T02:26:37.853+0000","up_votes":1,"down_votes":0,"body":"Akali no esta rota, solo que es el counter de Yasuo. Antes cuando yasuo estaba roto y se usaba en la lcs, muchos usaban a akali para hacerle counter.\n\nSi te la encuentras te recomiendo que mejores la baratija a nivel 9, solo sale 250 de oro y ayudara mucho para verla cuando se mete en el charco de invisibilidad. Antes de lvl 9 juega defensivo y farmea lo mejor que puedas. Akali es decente en el early, Yasuo es muy débil. En late una vez  te acostumbres a usar el pink si no la fedeaste deberías ser mejor que ella en pelea de equipo","replies":[]}]}