{"poster":"Ïce King Twitch","date":"2015-04-07T21:17:04.017+0000","title":"I was in an abusive relationship","subforum":"[ARCHIVED] General Discussion","up_votes":25,"down_votes":10,"body":"If you're just here to say 'dear diary' or whatever, save it. I'm posting this because it's relevant to current topics of discussion.\r\n\r\nAnyways, onto the topic: I was in an abusive relationship for about a year. There was physical abuse and psychological abuse. I was raised, like many young men today, that you don't lay a hand on a woman. But she struck at me on a daily basis, because I didn't get her what she wanted for breakfast, because I worked too many hours, because I didn't let her have the rent money to go party, whatever. But it wasn't what got to me, it was the way I was treated. I worked 12 hour shifts almost every day at the local factory. When I got home, I was typically too tired to fight back or argue, so I just went along with whatever she said. She was right, I finally started convincing myself. I'm useless, I exist only to serve her. She should get whatever she wants from me, because without her my life means nothing.\r\n\r\nI honestly BELIEVED these things. But I couldn't do anything about it. There's no counseling for men in this situation. There's no help. Men aren't taught to recognize the signs of an unhealthy controlling relationship like that, so I didn't even realize what was going on. It wasn't until I finally got away from her for a few days to visit my dying grandfather that I came to terms with it, and even then, breaking up with her was difficult. It fucked me up, and I wanted to get her back, but I couldn't let myself do that, because I knew what she had done to me.\r\n\r\nThe point I'm getting at is that it's not just women who can be in these circumstances. It goes both ways, but men are taught that we're supposed to just acquiesce to the wishes of our women, because they can withhold sex or whatever. I don't know. It was the darkest time of my life, and looking back, it still hurts that someone I stood by, that I gave up so much for, did that to me. I'm not able to have healthy relationships anymore. I was too scarred by that incident, to the point where now I can't control my emotions - I have extreme attachment issues, I become clingy and desperate. These things are issues that I'm working through, but it's not easy.\r\n\r\nIt cuts both ways, and it's time we start recognizing that. Men aren't doormats, we aren't meal tickets, and we aren't slaves. If you're in a relationship where you're being treated like you are, talk to someone. Try and remove yourself from it and ask yourself objectively \"Is this healthy? Am I treated with respect?\"\r\n\r\nThat's all. I've never really opened up about this before, so forgive me if I rambled a little bit.\r\n\r\nAnyways, I've got knives to make and handles to drill, so I'll let you get back to your regularly scheduled \"tanks are cancer\" posts. Delete Teemo.","replies":[]}