{"poster":"Twisted Payaso ","date":"2017-02-22T17:57:03.668+0000","title":"¿La gente que juega mal sabe que tiltea al que va bien?","subforum":"Charlas Generales","up_votes":5,"down_votes":13,"body":"Por que a mi me parece que esa gente no sabe que tiltea al que juega bien, estar&iacute;as cometiendo una actitud antideportiva, por que si yo veo que soy mejor que vos y no est&aacute;s a mi nivel para mi est&aacute;s trolleando entonces te reporto por actitud antideportiva por mas que no seas troll y seas malo, como no est&aacute;s a mi nivel para mi sos troll, el juego empareja con gente de tu nivel , entonces la gente que uno cree que est&aacute;  jugando a un nivel mas bajo ser&iacute;a reportable por que estar&iacute;a trolleando seg&uacute;n uno que est&aacute; a un nivel superior. \n\nEntonces el report no ser&iacute;a al que juega bien y no se suicida por seguir al team malo que tiene, sino al que dice en ese momento: &quot;report al que juega bien por **NO** suicidarse con el asco de team que somos nosotros&quot;\n\nEl 99% del foro juega mal ya lo se. pero dense cuenta que ustedes tiltean, es por su culpa que se pierde no por el que los flamean, al que flamea lo muteas y listo, pero para vos que no sabes un corno, no hay soluci&oacute;n, ten&eacute;s que esperar que se les caiga la conexi&oacute;n a los 5 contrarios., por que siempre est&aacute;n lo que piden report y siempre son los mas malos, los que siempre juegan mal.\n\nSi jugaste mal, callate la boca y no llores pidiendo report, no escribas al chat enemigo report ....... por flamer, al team enemigo le importa un carajo, es mas, seguramente te flameen por malo, por feeder o algo.\n\nLa verdad Ofende {{champion:17}}","replies":[{"poster":"IvVicious","date":"2017-02-22T18:01:39.601+0000","up_votes":7,"down_votes":1,"body":"> si yo veo que soy mejor que vos y no estás a mi nivel para mi estás trolleando\n\nHay un poco de post en tu soberbia.","replies":[{"poster":"Twisted Payaso ","date":"2017-02-22T18:03:10.588+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Escrache","date":"2017-02-22T18:05:59.408+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Twisted Payaso ,realm=LAS,application-id=v7qsfXsE,discussion-id=7VKB54Qp,comment-id=00000000,timestamp=2017-02-22T18:03:10.588+0000)\n>\n> La opinión de mujeres no me interesa.\n\nOjala pase algun moderador pronto por aca :)","replies":[]},{"poster":"IvVicious","date":"2017-02-22T18:05:48.789+0000","up_votes":4,"down_votes":0,"body":"Si veo que sos un tóxico asqueroso para mí sos un flammer y te reporto por actitud antideportiva. ¿Sabés la diferencia? Que mi report está justificado y te van a bannear ;3","replies":[{"poster":"kiuhm","date":"2017-02-22T18:09:39.678+0000","up_votes":2,"down_votes":1,"body":"Decirle que es un toxico asqueroso no te hace diferente.","replies":[{"poster":"IvVicious","date":"2017-02-22T18:41:21.639+0000","up_votes":1,"down_votes":0,"body":"Se me fue la mano, me disculpo.","replies":[]}]}]}]}]},{"poster":"Escrache","date":"2017-02-22T18:05:23.975+0000","up_votes":3,"down_votes":0,"body":"¿Los que se tiltean saben que hacen jugar mal a la gente?","replies":[{"poster":"kiuhm","date":"2017-02-22T18:10:41.814+0000","up_votes":1,"down_votes":0,"body":"Depende, si vos por cada vez que matas, tu team muere, entonces no pretendas que el que juega bien no empiece a jugar mal.","replies":[]}]},{"poster":"Silver000","date":"2017-02-22T20:02:16.038+0000","up_votes":1,"down_votes":0,"body":"lo que hace la suerte","replies":[]},{"poster":"WhiteMax","date":"2017-02-22T18:54:06.154+0000","up_votes":1,"down_votes":0,"body":"El titulo esta al reves: La gente que va bien tiltea a los que van mal y hacen que se sientan peor.\n\nNo digan que no porque es verdad el tipico \"ñee voy 5/0 y te acoso porque vas 0/2\".","replies":[]},{"poster":"PicknRoll","date":"2017-02-22T18:30:32.373+0000","up_votes":1,"down_votes":0,"body":"Twisted Payaso, no podes reportar nunca a alguien por tener una mala partida, si vos sos mejor que el otro entonces carrealo, ademas, estas siendo demasiado soberbio siendo que tu liga es Gold 3, te recuerdo que seguis estando en low elo, si queres encontrar gente que realmente sabe jugar y que comprende el juego vas a tener que suibir hasta diamante 3 o diamante 2, porque desde bronce hasta diamante 5, te puede tocar cualquier cosa, gente que juega bien, gente que juega mal, trolls, afks, flammers, lo que sea, pero como te dije al principio, si un jugador tiene una mala partida, no es reportable.","replies":[]},{"poster":"JACKY FANBOY","date":"2017-02-22T18:25:38.301+0000","up_votes":1,"down_votes":0,"body":"-Main Yasuo\n\"No tengo team\"","replies":[]},{"poster":"Sirek","date":"2017-02-22T18:05:15.757+0000","up_votes":1,"down_votes":0,"body":"Eehh... ¿¿Si juegas bien y flameas al que juega mal, debes reportar y banear al que juega mal?? ¿Eso quisiste decir?","replies":[]},{"poster":"Hijikata","date":"2017-02-22T18:32:54.889+0000","up_votes":2,"down_votes":2,"body":"SIEMPRE dije lo mismo, el flamer no es la causa, es una consecuencia. Un tipo flamea y se tiltea porque esta mal el emparejamiento y/o hay alguno jugando muy mal. Seamos sinceros muchachos, a esta altura de la vida, todos sabemos que si vas con un champ que maineas no vas a fedear salvo contadas ocasiones. Entonces, por ejemplo, ahora que se lleno de varus petes, por que uno no esta en su derecho a flamear? Uno les dice bien las cosas y los tipos te contestan como el orto todo. Me canse de discutir en champ select por tipos que no saben ni pickear, les decis algo y te putean de arriba abajo y despues vos sos el flamer, tiltean hasta a lazy.","replies":[]}]}