{"poster":"lJhonySinsl","date":"2017-12-26T02:32:17.080+0000","title":"GG Esencia azul perros.","subforum":"Charlas Generales","up_votes":10,"down_votes":1,"body":"Yo pienso que esto de las esencias supuestamente dijieron que iva  a ser mejor pero es lo contrario cuesta mucho sacar campeones asi, antes era mucho mas facil y pusieron esto de las victorias del dia que te dan la EXP y 50 de esencia azul y creen que ya arreglaron la diferencia :P y encima sacaron el rerol de campeones eso me molesta mucho por que , que voy a hacer con mis 50 nunus que dan 90 de esencia xD","replies":[{"poster":"Sebasaurio REX","date":"2017-12-26T02:43:25.258+0000","up_votes":2,"down_votes":1,"body":"yo llegue a nivel 30 y me faltan 9 champs para poder rankear , me imagino que a nivel 40 o mas recién voy  a poder jugar mi primera ranked , a menos que compre campeones de relleno de los mas baratos aunque no es la idea , la cosa es comprar los que sabes usar y no para rellenar","replies":[{"poster":"DanteV","date":"2017-12-26T03:17:14.355+0000","up_votes":4,"down_votes":1,"body":"Antes pasaba lo mismo, llegabas a 30 y para rankeae tenias que comprar los de 450 o esperar","replies":[{"poster":"Sebasaurio REX","date":"2017-12-26T03:54:48.011+0000","up_votes":1,"down_votes":0,"body":"ademas de que antes calcula 50 de esencia diaria en un mes 30 jugando 1500 de esencia , el pi en una semana jugando lo que fuera tenias esa cantidad","replies":[{"poster":"Nisman on bush","date":"2017-12-26T15:45:31.520+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=inserte nick her,realm=LAS,application-id=v7qsfXsE,discussion-id=Lxbt3nJs,comment-id=000000000002,timestamp=2017-12-26T03:54:48.011+0000)\n>\n> ademas de que antes calcula 50 de esencia diaria en un mes 30 jugando 1500 de esencia , el pi en una semana jugando lo que fuera tenias esa cantidad\n\nyo sacaba 3k de pi por dia con el viejo sistema... tengo todos los champs y mucha escencia acumulada pero para la otra cuenta da paja hace una semana quiero comprarme un campeon de  4800 escencias y no llego mas siempre me dan champs de 90 escencia en las capsulas de nivel","replies":[]}]},{"poster":"Sebasaurio REX","date":"2017-12-26T03:25:04.259+0000","up_votes":1,"down_votes":1,"body":"antes eran menos campeones y obtener pi era mas rápido , ahora para sacar un champ tienes que desencantar 5 y esperar a que te salga algo que quieres en las capsulas","replies":[]},{"poster":"lJhonySinsl","date":"2017-12-26T03:20:49.554+0000","up_votes":1,"down_votes":2,"body":"no es lo mismo perro vende tus nunus aver si te alcansa un champ de 6300 xD en un 2 semanas capas","replies":[]}]}]},{"poster":"WhiteMax","date":"2017-12-26T03:23:33.173+0000","up_votes":1,"down_votes":0,"body":"El sistema esta hecho para que consigas TODOS los campeones mas rapido gracias a los descuentos, pero para los campeones \"especificos\" tendras que ahorrar EA, igual que antes.\n\nDe nivel 1 a 30 recibiras 21k de EA aproximadamente + algunos campeones gratis.\n\nA partir de 30 las capsulas te daran entre 810 a 1260 de EA con promedio de 910. Y cada 10 niveles (40, 50, 60) recibiras una capsula con 1900 a 2200 de EA.","replies":[{"poster":"Sebasaurio REX","date":"2017-12-26T03:56:24.048+0000","up_votes":1,"down_votes":0,"body":"que campeones gratis ??? tristana y alistar por codes","replies":[{"poster":"LindseyxStirling","date":"2017-12-26T05:55:18.828+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"WhiteMax","date":"2017-12-26T16:01:46.119+0000","up_votes":2,"down_votes":0,"body":"https://boards.las.leagueoflegends.com/es/c/guias-y-consejos/z55pwXmU-obtaon-la-skin-de-alistar-desencadenado-gratis","replies":[]}]},{"poster":"WhiteMax","date":"2017-12-26T15:44:38.996+0000","up_votes":1,"down_votes":0,"body":"https://imgur.com/SWsjH5M","replies":[]}]},{"poster":"lJhonySinsl","date":"2017-12-26T04:23:38.143+0000","up_votes":1,"down_votes":0,"body":"aca me estoy riendo con unos amigos jajaj osea tengo que esperar que me salga ramdon el champ que quiero para poder sacarlo.. osea.. mayormente salen champs baratos {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"WhiteMax","date":"2017-12-26T15:45:09.889+0000","up_votes":1,"down_votes":0,"body":"Ya te lo explique, sino queres razonarlo no es mi problema.\n\n> mayormente salen champs baratos \n\nTe pueden salir varios fragmentos que sumandolos dan el total de EA que te da la capsula o en 1 solo fragmento que tenga todo el valor (ejemplo los fragmentos de 6300 que valen 1260).","replies":[{"poster":"lJhonySinsl","date":"2017-12-26T18:32:09.882+0000","up_votes":1,"down_votes":0,"body":"dale amigo de riot :D suerte{{sticker:galio-happy}}","replies":[]}]}]}]},{"poster":"Deathfire","date":"2017-12-26T03:24:52.628+0000","up_votes":2,"down_votes":0,"body":"yo estaba apunto de escribir sobre lo mismo, del lvl 33 que me han dado solo campeones de 90 o de 650 si es que tengo muchas suerte, considerando que por lvl son como 10 partidas (ganadas), no alcanza a ser 1000 de esencia azul, ni siquiera uno se puede el lujo de habilitar la maestría 6 o 7, ya que  cobran un dineral, deberían revisar eso.","replies":[{"poster":"WhiteMax","date":"2017-12-26T03:28:56.914+0000","up_votes":1,"down_votes":0,"body":"Recibes entre 810 a 1260 con promedio de 910, si resulta que recibes menos del minimo manda ticket a soporte.\n\nY respecto a la maestrias, supongo que la intencion de Riot es que la gente use los fragmentos para desbloquear maestria.","replies":[{"poster":"lJhonySinsl","date":"2017-12-26T04:21:29.542+0000","up_votes":1,"down_votes":1,"body":"pero... para que quiero sacarle maestria a nunu...? ami no me interesa sacarle maestria a los champ y quiero tener los champs no quiero jugar siempre lo mismo aburre","replies":[{"poster":"WhiteMax","date":"2017-12-26T15:43:20.124+0000","up_votes":2,"down_votes":0,"body":"Y bueno ya te explique, si igual queres quejarte ahi tenes eso que comentas.","replies":[]}]}]}]},{"poster":"The Rappers","date":"2017-12-26T02:45:15.837+0000","up_votes":2,"down_votes":0,"body":"Si la verdad que estoy de acuerdo, ya que pienso que dan muy poca esencia... me molesta también lo de la victoria del día, ya que tendrían que darnos mucho más que sólo 50, porque acaso que piensan? que vamos a jugar TODOS los días? ponganse a pensar que entrando a jugar sólo para hacer la victoría del día, en 1 mes, saqué la cuenta y serían unos 1500 de esencia! MISERIA! Y dejen de darnos a Nunu en las capsulas... Me parece que a ustedes sólo les importa el dinero! DINERO, DINEROO, DINEROO ♫\n {{champion:20}}","replies":[]},{"poster":"Aêthêriâl","date":"2017-12-26T04:05:56.736+0000","up_votes":2,"down_votes":1,"body":"Yo desde que cambiaron el sistema, conseguí 13 campeones de todos precios de EA. Nunca antes saqué campeones tan fácilmente. ¿La solución? Esperar los fragmentos de campeones que no tengo y si los quiero los compro al 60% de su valor en Esencia. Y oooobviamente cuando tocan los que ya tengo, los hago esencia, básicamente y sin mentir, estoy sacando un campeón de 6300 cada 3 niveles xD","replies":[{"poster":"Hísøka","date":"2017-12-26T10:00:04.492+0000","up_votes":1,"down_votes":0,"body":"Solo me faltan 7 champs actualmente, en lo que subi 30 lvl (del 30 al 60) me salio solo 1 de 4800 que no tenia... si contamos en total cuantos campeones compre en esos 30 lvl solo pude comprar 5 contando el del fragmento que obtuve.\n\nPD: vale aclarar que cuando pusieron el nuevo sistema solo me hacia falta 12 champs y ahora 7","replies":[]}]},{"poster":"Deadly Crimson","date":"2017-12-29T02:51:12.154+0000","up_votes":1,"down_votes":0,"body":"conclusión de toda esta conversación: a hacerse main nunu\n \nbuenas noches \n\n{{sticker:vlad-salute}}","replies":[]},{"poster":"20th CenturyBoys","date":"2017-12-26T17:40:59.608+0000","up_votes":1,"down_votes":0,"body":"es mucho mas facil sacar champs, en niveles anteriores a 30 te regalan los tipicos fragmentos de champs pero tambien un campeon permanente con cada subida de nivel\nahora mismo por mas de que sea aleatorio y dependas del tipo de fragmento te sale muchisimo mas barato comprarlos, de ultima los desencantas y listo, sigue siendo lo mismo, de lo que deberiamos quejarnos es del valor de la esencia naranja, eso es un robo de cuello blanco","replies":[]},{"poster":"SKT T1 Bank","date":"2017-12-26T10:00:53.856+0000","up_votes":2,"down_votes":3,"body":"El costo de esencia naranja no es alto, pero si fue nerfeado.\nEl sistema de hex mantiene su precio, pero en cuanto al contenido visual, sigue siendo de pago. Debido a que Riot Games entro en una meseta en cuanto a sus ingresos (lo que es algo totalmente esperable) ya no se puede seguir regalando TODO el contenido de la manera en la que se venia haciendo.\n\nNo se dejan de dar premios de este tipo, pero si se reduce la velocidad de obtencion y esperamos con esto tener un equilibrio entre lo que se obtiene y las \"ventas\", pues a pesar de todo es una empresa.\n\nPara equilibrar esto el sistema de EA genera una mayor velocidad de obtencion de campeones, y en cierto punto podran desbloquear nuevas cosas con la EA sobrante una vez que obtengan los campeones deseados o bien todos los campeones.\n\nEl sistema de EA puede parecer torpe, pero no lo es. Tengan en cuenta que hay 3 sistemas alimentandolo, gratuitos y muchos mas de pago y los eventos. Hay mucha EA siendo ganada constantemente. Lo que deben hacer para sacarle jugo es encantar los fragmentos de campeon que les van saliendo y desencantando los repetidos. Una vez que obtengan todos, o los deseados todo lo demas sera EA en sus bolsillos. Y claro esto es mas rapido en aquellas cuentas que ya tienen muchos campeones.\n\nAsi mismo, los niveles iran entregando contenido cosmetico cada cierto tiempo a modo de recompensa por el esfuerzo.","replies":[]}]}