{"poster":"ForgiveColour","date":"2015-11-15T22:05:50.628+0000","title":"ap has the best itemizatoon for 2 years and no one bats an eye","subforum":"Gameplay","up_votes":4,"down_votes":5,"body":"s6 pre season comes for less than a week and already rip ap post going over leddit and gameplay. god damn double standards","replies":[{"poster":"BluePolarizer","date":"2015-11-15T22:09:08.347+0000","up_votes":5,"down_votes":0,"body":"AP has better itemization because late game, they can't really solo carry the way marksmen can except by killing the enemy marksman. So they have to be better at killing and avoiding being killed by champions.","replies":[]},{"poster":"Ratbert","date":"2015-11-15T22:18:03.812+0000","up_votes":1,"down_votes":0,"body":"adcs mandatory for 6 years and no one bats an eye.\nLiterally anyone else (except maybe supports, who are only there because adcs are) become popular and are there for a year or two tops and then mass nerfed. ","replies":[{"poster":"Zair Umbras","date":"2015-11-15T22:55:44.917+0000","up_votes":1,"down_votes":0,"body":"Supports existed long before ADC's ever went bot lane. Long, long before ADC's were bot lane.","replies":[{"poster":"Battalion","date":"2015-11-15T22:59:56.777+0000","up_votes":1,"down_votes":0,"body":"That's not true.","replies":[{"poster":"Zair Umbras","date":"2015-11-15T23:16:45.910+0000","up_votes":1,"down_votes":0,"body":"It is true. You used to have supports at bot lane with an APC. Of course that changed after people saw proplay, but still.","replies":[{"poster":"Battalion","date":"2015-11-15T23:45:34.940+0000","up_votes":1,"down_votes":0,"body":"I've been around for every season, ADC and APC have always been interchangeable and to an extent they still are very much so with Blue Build Ezreal  AP.  Though your comment:\n\n>Supports existed long before ADC's ever went bot lane. Long, long before ADC's were bot lane.\n\nIs not true. ADC's have gone bot lane all throughout league of legends even before there was a Meta to do with Top, Mid, Bot, and Jungle were even put into action. ADC is, as you know, Attack Damage Carry, you might be meaning Marksmen, which then you'd be correct. Marksmen in the bottom lane was not a common thing until professional players came to League of Legends in early S1.","replies":[]}]}]}]}]},{"poster":"Mr Broken Wings","date":"2015-11-15T22:57:58.997+0000","up_votes":1,"down_votes":0,"body":"Its funny because ad assasins got the worst itemization changes.\nAt least not every mage did lose 5-6% winrate like the regular assasins.","replies":[]},{"poster":"WalkingInACircle","date":"2015-11-15T22:23:19.144+0000","up_votes":1,"down_votes":0,"body":"APs also had the more diverse set of champions with different talents. So while the old adc build might be stale, it was pretty much perfect for their job.","replies":[]}]}