{"poster":"ForgiveColour","date":"2017-01-18T16:31:16.121+0000","title":"”Poppy isnt broken just play a lane bully against her\"","subforum":"Gameplay","up_votes":37,"down_votes":21,"body":"Yeah its not like Poppy was picked into Jayce at worlds and did really well right? LUL that was when grasp was &quot;bad&quot; and tanks were &quot;shit&quot; times","replies":[{"poster":"Melledoneus","date":"2017-01-18T17:40:21.829+0000","up_votes":18,"down_votes":1,"body":"You can't blame the entire class for one or two champions.\n\nI'd like to see you make the argument that Shen is broken. Or Taliyah based on Syndra and Viktor. Hell, even Aatrox based on Camille.","replies":[{"poster":"ForgiveColour","date":"2017-01-18T17:43:15.227+0000","up_votes":1,"down_votes":29,"body":"Hey you ok? Read the thread title. Im talking about Poppy.\n\nLmao are tank mains this delusional that they cant even read properly?","replies":[{"poster":"Melledoneus","date":"2017-01-18T17:44:20.430+0000","up_votes":13,"down_votes":0,"body":"> LUL that was when grasp was \"bad\" and tanks were \"shit\" times\n\nI think this statement needs to be rephrased. You came off really wrong, apparently.","replies":[{"poster":"ForgiveColour","date":"2017-01-18T17:45:44.699+0000","up_votes":1,"down_votes":26,"body":"Lmao are you ok? It implies that Poppy was supposed to be in a \"weak\" state at that time so Poppy shouldnt be a viable pick into Jayce but we all know what happened. Just use your brain a little bit more tho next time ok?","replies":[{"poster":"Melledoneus","date":"2017-01-18T17:50:20.444+0000","up_votes":22,"down_votes":0,"body":"You're being extremely aggressive and, to be honest, a little rude over something almost everybody in this thread is talking about. All you needed to do was clarify instead of being condescending.\n\nIn fact, I could argue that I used my brain TOO MUCH reading between the lines of that statement to find intrinsic meanings that weren't there.","replies":[]},{"poster":"Ralanr","date":"2017-01-18T18:04:42.512+0000","up_votes":5,"down_votes":1,"body":"You said tanks in general were implied to be in a weak state. That has never meant that Poppy was ever weak. She has remained powerful for a good while and showcased a lot of usage in proplay. \n\nSo tanks in general being weak has nothing to do with Poppy's individual power because of how her kit works.  In fact, her and Maokai were both doing well, and the only common point I can see between them is that they both have a defensive ability that reduces both physical and magic damage (Maokai ult and Poppy W). Not to mention how good Poppy is a shutting mobile people down.","replies":[{"poster":"LordGeovanni","date":"2017-01-19T03:12:06.021+0000","up_votes":2,"down_votes":0,"body":"i may have some mental deficeny put poppy is a Tank / bruiser not just a tank right? She came from being a high damage bruiser to being a slow low damage bruiser / tank that you literally have to stand one place vs to lose any kind of fight.","replies":[{"poster":"Ralanr","date":"2017-01-19T03:17:28.529+0000","up_votes":1,"down_votes":0,"body":"Eh, I see her as a full tank. Course I see Sion as a full tank as well.","replies":[{"poster":"LordGeovanni","date":"2017-01-19T07:14:32.429+0000","up_votes":1,"down_votes":0,"body":"both were intended as fighters though sions rework arguably killed his fighter style (i dont care his his q knocks up for 20 years its stupid for a fighter) he still lacks base defenses if riot wants to classify him as a tank even if he farms to scale  his base health should be slightly higher  maybe shift some of his scaleing damage into base damage and and let his health stack for more per unit killed but most maybe raise the cooldown on his e or but raise the duration of intensity of the armor penetration  and idk if the q stun needs to be rebalanced but idk how long it is now ..\ni see poppys rework as trying to be a fighter but ineffective at the job. haveing to q and then wait for it to pop w only stopping one dash would be okay if she was balanced as a fighter but if she is supposed to be a tank why does it only stop one dash let it stop all for the short duration its up or low the cooldown so that it can be used every 4 seconds with about 20% cdr","replies":[{"poster":"Ralanr","date":"2017-01-19T12:18:40.490+0000","up_votes":2,"down_votes":0,"body":"Sion lacks base damage?  What?\n\nEdit: oh, defenses. Derp. \n\nHis tanking steroid is his health gain passive. It's definitely not great early and in late it doesn't feel impactful all the time because of how durability gets outscaled. Personally I wish he had better base resistances. ","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Sahn Uzal","date":"2017-01-18T16:34:38.847+0000","up_votes":19,"down_votes":4,"body":"Poppy is broken. \nThat does not mean the entire Tank Class is broken.\nHecarim is a Diver, so him being broken does not mean Tanks are broken either.\n\nJust clearing that up, a general message for whoever reads it.","replies":[{"poster":"Ralanr","date":"2017-01-18T16:39:19.938+0000","up_votes":8,"down_votes":2,"body":"Doing gods work.","replies":[]},{"poster":"Penns","date":"2017-01-18T17:00:10.951+0000","up_votes":7,"down_votes":3,"body":"The ones that are played are just cancer tho. Also everyone calls juggernauts or divers \"tanks\", and Darius stomping every game because he autowins after a few auto attacks isnt fun either lol.","replies":[{"poster":"Ralanr","date":"2017-01-18T17:01:49.768+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Penns,realm=EUW,application-id=3ErqAdtq,discussion-id=4vLf2EOI,comment-id=00000002,timestamp=2017-01-18T17:00:10.951+0000)\n>\n> The ones that are played are just cancer tho. Also everyone calls juggernauts or divers &quot;tanks&quot;, and **Darius stomping every game because he autowins after a few auto attacks isnt fun either lol.**\n\nNeither is Fizz's ult and E fucking you up.","replies":[{"poster":"Penns","date":"2017-01-18T17:32:43.758+0000","up_votes":1,"down_votes":0,"body":"Maybe but Fizz doesnt auto beat pretty much all melees and some ranged champs just because he can right click. Actually with the rework just about every matchup is decided by how his lane opponent plays lol.","replies":[{"poster":"Big Lincoln","date":"2017-01-18T21:57:46.692+0000","up_votes":2,"down_votes":1,"body":"Darius doesn't auto beat anyone","replies":[]}]}]}]},{"poster":"Big Lincoln","date":"2017-01-18T16:52:47.345+0000","up_votes":2,"down_votes":1,"body":"most tanks are quite cancer tho","replies":[]}]},{"poster":"MLDzXnRRR","date":"2017-01-18T18:21:18.388+0000","up_votes":2,"down_votes":0,"body":"Good Fiora can destroy Poppy.\nBut Fiora can't really teamfight well and Poppy will just protect the backline.\nAlso Poppy is broken, because noone wants to rush a Last Whisper item. I can see how she feels unkillable when you have only a zeal item + IE. Both items are pretty useless vs her. And the games are over in 25 minutes.\nThe fighters also don't build it. Some like Darius, Fiora, Riven, Jayce get BC and thats it.\nTrynda can probably rush LW + upgrade, if he has full AS runes.","replies":[{"poster":"ForgiveColour","date":"2017-01-18T19:13:35.872+0000","up_votes":3,"down_votes":7,"body":"No \nOne\nRushes\nLast \nWhisper\nWhat\nElo\nAre\nYou","replies":[{"poster":"MLDzXnRRR","date":"2017-01-18T19:26:38.157+0000","up_votes":10,"down_votes":1,"body":"> [{quoted}](name=ybuR,realm=NA,application-id=3ErqAdtq,discussion-id=4vLf2EOI,comment-id=000b0000,timestamp=2017-01-18T19:13:35.872+0000)\n>\n> No \n> One\n> Rushes\n> Last \n> Whisper\n> What\n> Elo\n> Are\n> You\n\nSo rushing LW is bad, but complaining about Poppy being unkillable is right?\nI see the ADCs rushing IE + and 2 zeal items, then lifesteal. Add the boots and you have 5 items that don't do anything to Poppy or any other tank. \nBut, hey, let's complain more about Poppy.\nI'm pretty sure that Malphite, Nautilus, Rammus, Zac, Alistar, Sion, Sejuni, Leona and so on will be equally unkillable with the same items. But these champions are not exactly popular toplaners atm, so we don't see farmed Malphite diving the squishy full AD enemy team and wrecking everyone...","replies":[{"poster":"ForgiveColour","date":"2017-01-18T19:28:50.055+0000","up_votes":2,"down_votes":15,"body":"Holy shit you actually think rushing ldr first item is viable. im going to end this just so I dont lose more brain cells from you","replies":[{"poster":"MLDzXnRRR","date":"2017-01-18T19:44:15.133+0000","up_votes":19,"down_votes":3,"body":"> [{quoted}](name=ybuR,realm=NA,application-id=3ErqAdtq,discussion-id=4vLf2EOI,comment-id=000b000000000000,timestamp=2017-01-18T19:28:50.055+0000)\n>\n> Holy shit you actually think rushing ldr first item is viable. im going to end this just so I dont lose more brain cells from you\n\nYou can't lose something that you don't have...","replies":[{"poster":"DragonShea","date":"2017-01-19T15:38:40.628+0000","up_votes":1,"down_votes":0,"body":"The swag is strong in this one.","replies":[]}]},{"poster":"SithesisLord","date":"2017-01-18T20:00:13.924+0000","up_votes":6,"down_votes":0,"body":"Not optimal, but very, very viable.","replies":[{"poster":"ForgiveColour","date":"2017-01-18T20:10:41.249+0000","up_votes":1,"down_votes":7,"body":"First item ldr is never viable unless youre playing in bronze where most gameplay monkeys are","replies":[{"poster":"SithesisLord","date":"2017-01-18T20:25:31.007+0000","up_votes":4,"down_votes":0,"body":"It IS viable. Like rushing Guinsoo's first item on Kayle. Or going for any other item Irelia can build for first item other than Trinity Force. Or being able to pick from a myriad of possible first items for an off-tank Leona top. Heck, Leona top itself. Viable? Yes. Optimal? Not on most cases.\n\nIt´s what Riot calls build diversity. It´s why they reintroduced AP ratios into new Warwick's Q. Is it viable for him to build AP? Most definitely, but not without consequences, thus not making it the commonly desired/optimal build.\n\nIt has nothing to do with at which rank stuff is being played on/built on. If it works, there is no reason not to consider doing it.\n\nHence why Pants are Dragon occasionally builds Redemption on Hecarim jungle. Or why Tobias Fate often builds Cull AND Spellthief's Edge on Gangplank. Three not optimal, but very viable items on those champions, respectively.","replies":[]}]}]}]},{"poster":"DragonShea","date":"2017-01-19T15:37:46.844+0000","up_votes":1,"down_votes":0,"body":"It's a bit more justified to get LW early against Poppy as she gains 12% more armor and double that amount at <40% HP","replies":[{"poster":"Ralanr","date":"2017-01-19T15:42:08.801+0000","up_votes":2,"down_votes":0,"body":"The reason why you don't get it early as an adc against Poppy is because it offers practically nothing to help your lane. \n\nEarliest you should get it is 3rd damage item.","replies":[{"poster":"DragonShea","date":"2017-01-19T15:50:27.394+0000","up_votes":1,"down_votes":0,"body":"Well not too early.","replies":[{"poster":"Ralanr","date":"2017-01-19T15:51:14.090+0000","up_votes":1,"down_votes":0,"body":"When people see \"rush\" they assume first item.","replies":[]}]}]}]}]}]}]},{"poster":"SNSD Sunnny","date":"2017-01-18T17:11:44.053+0000","up_votes":5,"down_votes":1,"body":"i mean who would you pick into the most broken top laner right now?\n\nif you're going to get dumped on in lane you want to at least outscale","replies":[{"poster":"dunder kill","date":"2017-01-18T17:18:02.256+0000","up_votes":7,"down_votes":2,"body":"How do you outscale a Poppy? She becomes absolutely unkillable in a 1v1 in the mid to late game","replies":[{"poster":"Ralanr","date":"2017-01-18T17:18:56.648+0000","up_votes":4,"down_votes":2,"body":"Poppy is outscaling Jayce. \n\nGreat way to fuck over Poppy is to get LDR.\n\nEdit: not early, obviously. Tanks are meant to be strong early-mid. ","replies":[{"poster":"Eedat","date":"2017-01-18T19:09:43.958+0000","up_votes":1,"down_votes":4,"body":"LDR barely negates Poppy's ridiculous bonus defenses. You still can't kill her. Do I need to mention that defensive items are ***vastly*** cheaper than AD?","replies":[{"poster":"Ralanr","date":"2017-01-18T19:22:28.789+0000","up_votes":9,"down_votes":0,"body":"They're supposed to be because tanks need their power spikes earlier as they end up falling off. \n\nAt no, it doesn't barely negate it. That's 45% bonus armor pen, that's a good chunk. Obviously it's not going to bring her down quickly because it shouldn't. Tanks are supposed to be harder to kill than everyone else.","replies":[]}]}]}]}]},{"poster":"MFTORANK1","date":"2017-01-18T18:56:04.381+0000","up_votes":8,"down_votes":1,"body":"Dude just because she's unkillable and can kill you doesn't mean that she's OP, she has very clear weaknesses. For exemple, if she get cc'ed for 20 seconds and focused by 5 people she will die, now tell me that isn't a big weakness.","replies":[{"poster":"ForgiveColour","date":"2017-01-18T19:12:55.570+0000","up_votes":4,"down_votes":8,"body":"Better put /s or delusional tank mains will actually think youre serious and use this","replies":[{"poster":"RizHippoKhan","date":"2017-01-19T00:29:18.973+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=ybuR,realm=NA,application-id=3ErqAdtq,discussion-id=4vLf2EOI,comment-id=000c0000,timestamp=2017-01-18T19:12:55.570+0000)\n>\n> Better put /s or delusional tank mains will actually think youre serious and use this\n\nreading ur other comments,seems like you're an arrogant asshole in real life xD","replies":[]},{"poster":"MrHaZeYo","date":"2017-01-18T23:44:59.388+0000","up_votes":3,"down_votes":0,"body":"Why are you so salty?","replies":[]}]}]},{"poster":"Attticus Finch","date":"2017-01-18T19:27:11.523+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=ybuR,realm=NA,application-id=3ErqAdtq,discussion-id=4vLf2EOI,comment-id=,timestamp=2017-01-18T16:31:16.121+0000)\n>\n> Yeah its not like Poppy was picked into Jayce at worlds and did really well right? LUL that was when grasp was &amp;quot;bad&amp;quot; and tanks were &amp;quot;shit&amp;quot; times\n\nWho actually said this? Who are you talking about?","replies":[]},{"poster":"Incarceration","date":"2017-01-18T23:16:30.477+0000","up_votes":1,"down_votes":0,"body":"Poppy is actually pretty broken. He can basically 1 vs 5 while he's a little weak in lane though. He's freelo.","replies":[{"poster":"Ralanr","date":"2017-01-18T23:20:10.675+0000","up_votes":4,"down_votes":0,"body":"...Poppy is a she.","replies":[{"poster":"Incarceration","date":"2017-01-18T23:23:40.868+0000","up_votes":1,"down_votes":0,"body":"xd. You know what's even funnier. I could dive a Garen, blow his flash and leave him 100 health, and still get out with a 1/4 of my health. \n\nI'm glad she's strong when shit like Caitlyn is out there.","replies":[{"poster":"ReZisT Lust","date":"2017-01-19T08:50:15.845+0000","up_votes":3,"down_votes":0,"body":"but what that person said wasnt funny, nor what you said thats just tank things {{sticker:zombie-nunu-bummed}}","replies":[]}]}]}]},{"poster":"Looknook","date":"2017-01-18T18:11:06.168+0000","up_votes":4,"down_votes":0,"body":"Poppy was picked into Jayce with the knowledge on both sides that Poopy would lose lane. She was picked because she was still able to make do on a small budget and still be effective latter. Other toplaners could not do that with Jayce.","replies":[]},{"poster":"dunder kill","date":"2017-01-18T17:15:48.895+0000","up_votes":6,"down_votes":2,"body":"{{champion:78}} *comes back to lane with a {{item:1031}} *\n\nWell it was fun bullying her while it lasted","replies":[]},{"poster":"RexSaur","date":"2017-01-18T17:25:45.880+0000","up_votes":1,"down_votes":4,"body":"Its pretty hilarious to play a damage champion like Riven against Poppy because even if you snowball against her early game with every kill you get she becomes harder and harder to kill, its almost like shes the one getting the kills on me! Not even going to talk about the secnario where she actually gets ahead in lane with a gank or something.\n\nHer kit is just completely ridiculous for a tank, it literally has everything % on it, from damage to every single tanky steroid imaginable + a free fk you if you are a mobility reliant champion at absolutely no cost on her kit budget.","replies":[{"poster":"Veltox","date":"2017-01-18T20:25:13.639+0000","up_votes":4,"down_votes":0,"body":"No cost? You realize how long is {{champion:78}} w cooldown? It costs a moderate amount of mana too.","replies":[]},{"poster":"CountSpatula","date":"2017-01-18T21:09:56.871+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=RexSaur,realm=NA,application-id=3ErqAdtq,discussion-id=4vLf2EOI,comment-id=0004,timestamp=2017-01-18T17:25:45.880+0000)\n>\n> Its pretty hilarious to play a damage champion like Riven against Poppy because even if you snowball against her early game with every kill you get she becomes harder and harder to kill, its almost like shes the one getting the kills on me! Not even going to talk about the secnario where she actually gets ahead in lane with a gank or something.\n> \n> Her kit is just completely ridiculous for a tank, it literally has everything % on it, from damage to every single tanky steroid imaginable + a free fk you if you are a mobility reliant champion at absolutely no cost on her kit budget.\n\nget downvoted by tank mains lul","replies":[{"poster":"Veltox","date":"2017-01-19T11:15:37.233+0000","up_votes":2,"down_votes":0,"body":"Nobody likes playing against Riven kit except her mains/players or counters and this won't change soon.","replies":[]}]}]}]}