{"poster":" Acantha","date":"2018-01-23T00:25:23.738+0000","title":"Zed y Syndra: Dudas y misterios.","subforum":"Off-topic y temas personales","up_votes":13,"down_votes":1,"body":"M&aacute;s que ser uno de los juegos m&aacute;s populares y competitivos a nivel mundial (lol), se id&eacute;ntica por el hecho de tener un universo. Y m&aacute;s que un universo, historias especificas de dichos campeones dentro del juego, creando un vinculo &uacute;nico con ellos y dando de cierta forma **Vida he identidad** al personaje. Pero tambi&eacute;n, hay algo que de cierta forma, se ha estado agregando a los personajes (y a mi parecer es hermoso) que es el **amor** y relaciones de &quot;parejas&quot; dentro del juego.\r\n\r\nAblando espec&iacute;ficamente de personajes, le dedico este misterio a {{champion:238}} y {{champion:134}}.\r\nAun que {{champion:238}} y {{champion:134}} no est&aacute;n relacionados oficialmente como **pareja**, si es muy popular dentro de la comunidad ciertos rumores. \r\nTodos nacen de un simple **comic** creado por fans: **&quot;La vida ordinaria de Zed y Syndra**\r\nhttps://k44.kn3.net/taringa/1/6/6/2/2/7/2/lalalonchi1/803.jpg?5317\r\nA pesar que nada es **oficial** por parte de Riot, durante el a&ntilde;o 2014/2015, lanzan una imagen donde se muestra que {{champion:238}} y {{champion:134}} salen juntos por las noches a pasarla bien y todo eso:\r\nhttps://fotos.subefotos.com/3afea37a4ca03a56be96530b4cde12bao.png\r\nPor otra parte, Si se fijan en el splash art de {{champion:238}} y {{champion:134}}, ambas **&quot;casas&quot;** en las que est&aacute;n detr&aacute;s de ellos pareciera que son la misma. Eso quiere decir que, &iquest;est&aacute;n viviendo juntos?\r\nhttps://fotos.subefotos.com/be87262ff392ee3848ad6aeb320c9dddo.png\r\nhttps://fotos.subefotos.com/1e9c19499550c57e8a19c91a65847b3ao.png\r\nAlgo que se como mujer, es que no existe la amistad entre un hombre y una mujer. Entonces, &iquest;{{champion:238}} y {{champion:134}} llevan una relaci&oacute;n amorosa en secreto?\r\n&iquest;Por que Riot no hace esto oficial?\r\n\r\nBy: Ivana Deviluke.","replies":[{"poster":"FurchiDC","date":"2018-01-23T01:46:33.557+0000","up_votes":9,"down_votes":2,"body":"Según su lore, canónicamente nunca podrían ser pareja. Están demasiado ocupados y enfocados en satisfacer su sed de venganza y poder. Son muy individualistas. \n\nSorry fans de la pareja pero, it's not gonna happen.\n\nCon respecto a los splashes, los edificios (o casas) no son los mismos, solo son parecidos porque la arquitectura de Jonia (Ionia) está basada en la oriental, y suelen tener esos techos adornados. Los adornos de esos edificios se ve que son parecidos pero no iguales.\n\nY por último agregar, que Syn es mía (?\n\n#SorryNotSorry\n\n######Es broma lo último, tómenlo como un personaje de foro jaja\n\n\nPD: Como crítica constructiva, y no lo tomes a mal por favor ^^; fijate tu ortografía de mejorarla, porque escribís muy bien! Solo te falta ese detalle.\n\nEjemplos:\nhttps://i.gyazo.com/ca41a36607d9d3b03bc42b07fed3e939.png\n\n[](http://.)\n[](http://.)\n_________________________________\n>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;http://i.imgur.com/2GnAbBM.png?noredirect\n>#&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;**Saludos**","replies":[{"poster":" Acantha","date":"2018-01-23T02:07:21.014+0000","up_votes":3,"down_votes":0,"body":"Pero hay que pensar que {{champion:238}} y {{champion:98}} una ves fueron como hermanos entrenados por el mismo maestro. Podrían actualizar historia y dar indicios que {{champion:238}} esta arrepentido de sus actos y en convertirse en dicho ninja de las sombras. O que conoce a {{champion:134}} en una batalla y que esta despierta algo en el, donde ya no solamente piensa en si mismo... tantas ideas...\nCreo que me enamore...\n{{sticker:sg-jinx}}","replies":[{"poster":"Hísøka","date":"2018-01-23T13:03:07.728+0000","up_votes":2,"down_votes":0,"body":"Pero Zed realmente no estaba arrepentido? antes de matar al padre de Shen el se arrepintió luego se escucho un grito desgarrador de parte de Zed y salio con la cabeza del padre de Shen, eso quiere decir que es mas bien algo como... un Darking? Ya que al abrir el cofre donde estaban tales secretos pudo ser que liberase un Darking  y que realmente Zed no tuviera la intención de matar al padre de Shen al final y todavía este peleando con el Darking para que no domine su cuerpo totalmente","replies":[]},{"poster":"lllHeisenberglll","date":"2018-01-23T20:23:06.389+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Yami Deviluke,realm=LAS,application-id=J8qpiO2I,discussion-id=pklaoeaa,comment-id=00050001,timestamp=2018-01-23T02:07:21.014+0000)\n>\n> Pero hay que pensar que {{champion:238}} y {{champion:98}} una ves fueron como hermanos entrenados por el mismo maestro. Podrían actualizar historia y dar indicios que {{champion:238}} esta arrepentido de sus actos y en convertirse en dicho ninja de las sombras. O que conoce a {{champion:134}} en una batalla y que esta despierta algo en el, donde ya no solamente piensa en si mismo... tantas ideas...\n> Creo que me enamore...\n> {{sticker:sg-jinx}}\n\njajjajajaja volas mucho amiga xD Y lo de la amistad entre hombres y mujeres hmmmmm creo que tenes razon mi amiga terminó siendo mi novia, y hablo de amigos AMIGOS no conocidos de hola y chau. Clase de amigos que se cuentan todo casi siempre.\n\nY respecto a estos dos asquerosos {{champion:238}} {{champion:134}} Creo que Riot los mete en comic de la comunidad osea lo de Ezreal Taric lo creó la comunidad y en el splash art nuevo de Taric Rosa sale Ez xD Eso es porque Riot a pesar de toda la mierda que le tiren siempre. Riot es una empresa de la puta madre, es muuuuy buena empresa que practicamente no existe la barrera de \"Jugador/empleado de Riot\" Yo los veo como otros jugadores mas xD son re piolas y saben escuchar a la comunidad, por eso ha llegado tan lejos en mi opinion.\n\nVolviendo al Tema, tengo entendido que Syndra y Zed viven en Jonia osea que es normal que las casas sean similares dado que las casas de Jonia en su mayoria tienen ese tipo de arquitectura. Pero mas alla de eso no he visto casi ningun dato de que ambos se conocen y la verdad no me gustaria verlos juntos xD es que los odio a ambos ?) y si vamos por creaciones de la comunidad {{champion:154}} {{champion:92}} Yo al ver esto dije \"que carajos?\" ajajajjajjaja","replies":[]},{"poster":"FurchiDC","date":"2018-01-23T02:34:46.756+0000","up_votes":1,"down_votes":0,"body":"Eso ya es muy tirado de los pelos... pero sí, hay un universo de probabilidades. ¿Quién sabe? jajaj\n\nLeí la historia de Zed x Syndra, y hasta la modifiqué jaja me pareció hermosa.\n\n\n\n\n\n\n[](http://.)\n[](http://.)\n_________________________________\n>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;http://i.imgur.com/2GnAbBM.png?noredirect\n>#&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;**Saludos**","replies":[]}]},{"poster":"K6 VoidHunter","date":"2018-01-23T01:54:47.289+0000","up_votes":2,"down_votes":0,"body":"Bueno chicos... Lo sentimos, pero no hay pareja entre estos 2...\nSyndra es sola y exclusivamente para Furchi.","replies":[{"poster":"FurchiDC","date":"2018-01-23T01:56:15.468+0000","up_votes":2,"down_votes":0,"body":"¡Dénle una cerveza a este hombre! ¿Sos mayor verdad? \n\n\n[](http://.)\n[](http://.)\n_________________________________\n>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;http://i.imgur.com/2GnAbBM.png?noredirect\n>#&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;**Saludos**","replies":[{"poster":"K6 VoidHunter","date":"2018-01-23T04:44:41.308+0000","up_votes":2,"down_votes":0,"body":"¿Cerveza? Yo tomo lechita de chocolate para machos, novato.","replies":[{"poster":"FurchiDC","date":"2018-01-23T04:47:55.982+0000","up_votes":2,"down_votes":0,"body":"Que sean dos! \n\nhttp://mrwgifs.com/wp-content/uploads/2016/04/Natalie-Portman-and-Ashton-Kutcher-Share-a-Milkshake-On-a-Date-In-No-Strings-Attached.gif\n\n[](http://.)\n[](http://.)\n_________________________________\n>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;http://i.imgur.com/2GnAbBM.png?noredirect\n>#&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;**Saludos**","replies":[]}]}]}]},{"poster":"Bienzahar","date":"2018-01-23T13:33:50.312+0000","up_votes":1,"down_votes":0,"body":"Igual descartar un amorio solo por su sed venganza y poder es apresurado, no veo el porqué estas razones los hagan incompatibles. No creo que hayas presentado pruebas reales de que la pareja no pueda existir.\nPor otro lado, tampoco hay pruebas contundentes de que la pareja sea real, pero así lo hizo ver, como un rumor xD\nY que los giros inesperados de lore de parte de Riot, porqué no? xDD","replies":[]}]},{"poster":"Sad Kiwi","date":"2018-01-23T07:09:52.988+0000","up_votes":2,"down_votes":0,"body":"Sólo voy a decir esto\n\n\"es que no existe la amistad entre un hombre y una mujer. \"\n\nHasta sentí pena de leer eso {{sticker:sg-soraka}}","replies":[]},{"poster":"yo soyyoporqueno","date":"2018-01-23T05:07:37.147+0000","up_votes":2,"down_votes":0,"body":"Pues, en el lore en cierto punto se van a encontrar, pero los 2 se enemistarían ya que buscan el dominio total de Ionia, y  Syndra lo quiere para ella sola. Zed busca que la orden de las sombras domine Ionia. Nunca serian aliados siquiera.","replies":[]},{"poster":"Jack310","date":"2018-01-23T00:44:55.136+0000","up_votes":2,"down_votes":0,"body":"bueno en mi opinión es mas la típica relación de mantén a tus amigos cerca y a tus enemigos aun mas cerca {{sticker:sg-syndra}} \nlo que quiero decir con esto es que de estar ambos  vivido en el mismo lugar la relación que llevarían  seria una alianza  en la cual ninguno confiaría en el otro  solo colaborarían por conveniencia propia","replies":[]},{"poster":"Hísøka","date":"2018-01-23T13:00:00.987+0000","up_votes":1,"down_votes":0,"body":"Ahh que mal y yo que quería ser tu amigo... pero como dicha amistad no existe {{sticker:sg-soraka}}","replies":[]},{"poster":"Geeik","date":"2018-01-23T03:35:05.958+0000","up_votes":1,"down_votes":0,"body":"Como ser humano, te digo que tengo tanto amigos hombres como mujeres :D. Creo que son epocas distintas, por lo demás, aunque me encantan los shipps, zed y syndra no son del tipo romántico, son más de los que quieren poder y venganza..\n\nAún así los shippeo :3","replies":[]},{"poster":"Semilla de Arce","date":"2018-01-23T02:22:35.957+0000","up_votes":1,"down_votes":0,"body":"Tranquilamente podrian ser pareja. Si algo dejo claro el lore de Riot es que ningún campeón está totalmente aislado de los otros campeones. Si aun no lo hicieron oficial es porque no era algo determinante en el lore y por la época en que salieron estos champs no había tanto contenido agregado a los teasers. \nYo creo que al ser tan parecidos se deben entender por el simple hecho de \"odiamos lo mismo\" (en este caso la debilidad, la gente débil, ambos mataron a los maestros que intentaron contener su poder, limitarlos, etc), eso es lo que yo creo que les creó un vínculo en principio. Ese es el lore que nos dan, pero sinceramente, en un mundo donde nadie mas entiende como te sentis y lo que viviste ¿No te sentirias especialmente atado a la persona que si te entiende? xD","replies":[]},{"poster":"Warwiick","date":"2018-01-23T01:00:38.824+0000","up_votes":1,"down_votes":0,"body":"Pero se supone que zed es medio tarics ¿No?","replies":[{"poster":"Rendezvous Alice","date":"2018-01-23T02:10:29.377+0000","up_votes":1,"down_votes":0,"body":"Creo que ese es Kayn. (...?)","replies":[]}]},{"poster":"Turbinax","date":"2018-01-23T01:44:54.643+0000","up_votes":1,"down_votes":0,"body":"no lo se pero ese comic es muy bueno lo recomiendo al 100%{{sticker:galio-happy}}","replies":[]},{"poster":"El Impostor","date":"2018-01-23T01:40:53.989+0000","up_votes":1,"down_votes":0,"body":"Imagínense que clase tendrían sus contrapartes del universo Star Guardian.","replies":[]}]}