{"poster":" Acantha","date":"2015-09-29T21:44:53.366+0000","title":"¿Por que pasa esto en Bronce V, IV, III, etc?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Saludos chicos n.n, recien llegue y tanto que ley el foro me dije &quot;quiero preguntar algo&quot; jajaja. Bueno, la duda que tengo es &iquest;Por que cuando estas en bronce V ganas aproximadamente 20 puntos +5 con baron hecho y pierdes unos 15, pero cuando estas en bronce IV ganas unos 13 +5 con baron y pierdes mas de 20? \r\nEn bronce III ganas 20 +5 con baron y pierdes  lo mismo +5 si el team enemigo hace el baron.\r\n&iquest;A que se debe esta diferencia de puntos ganados?\r\n&iquest;Pasa lo mismo en todas las ligas?\r\nYo creo que deberian dar un poquito mas de oportunidad en la liga bronce IV, no hablare esta ves por mi pero se que hay varias personas que merecen salir de bronce IV pero no pueden por la perdida de puntos desvalanceada (por llamarlo asi).\r\nConosco personas que juegan mejor que yo a nivel OP en bronce IV y V, pero no salen de hay por que llegas a bronce IV, ganas dos partidas seguidas (unos 30 puntos) pero pierdes una y chao, quedas con 0 y vuelven a desender a bronce V. Tengo un amigo que es main top, justo como yo jajaja y antes era plata 1 y ahora es bronce I, pero por lo que el decia y por lo que me di cuenta al verlo y al mirar al resto (sin contar con migo) en bronce IV es casi imposible salir, practicamente no puedes perdonarte perder una como en bronce V o en bronce III ya que si lo haces quedas con 0 putos o pierdes todo lo que reuniste en dos o tres partidas u.u\r\n\r\nPosdata: lamento si escribo poco, pero este post lo hago del celular y no acostumbro escribir desde aqui (solo de pc) jajaja n.n","replies":[{"poster":"Tecnicomando","date":"2015-09-29T22:03:24.126+0000","up_votes":3,"down_votes":0,"body":"Eso se llama ELO...\n\nFunciona asi...\n\nTienes mas victorias que derrotas , el sistema te \"empuja\" dando mucho lp y quitando poco, asi subes rápido a tu nivel de liga...\nSi tienes MUchas victorias sobre derrotas, el sistema te empuja aun mas, te saltas promos y ligas completas....\n\nSi es al revés(mas derrotas que victorias), el sistema te \"jala\" a tu nivel, quitando mas de lo que ganas...\n\nSi subes de liga y tu elo(mmr) es alto, puedes perder asta 100 partidas y tener 0 lp , y aun asi no bajaras , pues tu elo debe bajar asta dicha liga...\nSI tienes un elo bajo, a la primera perdida te regresas...\n\n\nPD: en ese elo el \"counter\" no existe, no sacas nada con elegir un counter si no tienes idea de como se usa y mas aun  si no tienes runas especificas\n\nMejor jugar un par de roles y unos 3 campeones","replies":[]},{"poster":"lordeman10","date":"2015-09-29T23:22:32.200+0000","up_votes":1,"down_votes":0,"body":"claro es para que tu nivel de emparejamiento se asemeje a la liga que muestra tu perfil, si estás más abajo o más arriba del común de esa liga te va a dar más o menos para que tiendas a al mismo número de MMR que el resto de los de tu liga","replies":[]},{"poster":"balkion","date":"2015-09-29T23:04:28.925+0000","up_votes":1,"down_votes":0,"body":"Hola aqui te dejo un link donde un invocador creo un post explicando como funciona el Sistema de Ligas (salteate las partes que ya sepas  ( explica bastante bien el mmr){{summoner:4}} \n\nhttp://boards.las.leagueoflegends.com/es/c/guias-y-consejos/67N9aKAz-como-funciona-el-sistema-de-ligas-mmr-lp-y-rangos","replies":[]},{"poster":"panther189","date":"2015-09-29T22:40:18.860+0000","up_votes":1,"down_votes":0,"body":"es como te dicen del mmr, yo por ejemplo me siguen dando muchos puntos. en la ultima me dieron 30 y llegue a promo para platino 3, esto va  a ser asi hasta que se acomede a una division que sera platino 3,2,1 despues seguramente me pase lo mismo que al de arriba.","replies":[]},{"poster":"CrystaI Castles","date":"2015-09-29T21:51:45.183+0000","up_votes":1,"down_votes":0,"body":"Eso es por el MMR si no me equivoco, lo tenés por el piso si perdés más que las que ganás, pasa en todas las ligas.\n\nA mí me pasó en la season anterior, y practicamente no entraba en promo nunca y quedé bronzodia, esta temporada rankee al estar en racha ganás demasiado y perdés poco.","replies":[{"poster":" Acantha","date":"2015-09-29T21:59:08.122+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CrystaI Castles,realm=LAS,application-id=v7qsfXsE,discussion-id=njBO4HLZ,comment-id=0000,timestamp=2015-09-29T21:51:45.183+0000)\n>\n> Eso es por el MMR si no me equivoco, lo tenés por el piso si perdés más que las que ganás, pasa en todas las ligas.\n> \n> A mí me pasó en la season anterior, y practicamente no entraba en promo nunca y quedé bronzodia, esta temporada rankee al estar en racha ganás demasiado y perdés poco.\n\nGracias, por cierto, ¿tengo que tener mas victorias que derrotas en ranked o solo mantenerme en racha cosa que cuando pierda no sea exagerada la perdida de puntos?","replies":[{"poster":"martincarp","date":"2015-09-29T22:09:42.038+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Brayanador,realm=LAS,application-id=v7qsfXsE,discussion-id=njBO4HLZ,comment-id=00000000,timestamp=2015-09-29T21:59:08.122+0000)\n>\n> Gracias, por cierto, ¿tengo que tener mas victorias que derrotas en ranked o solo mantenerme en racha cosa que cuando pierda no sea exagerada la perdida de puntos?\n\nEl sistema no se basa solo en la cantidad de victorias y de derrotas, sino que tienes que \"demostrarle\" que mereces estar en tu liga para que el MMR se acomode a tu división.\nSi tu tienes el MMR de un bronce V, y subes a bronce IV con una racha, eso no quiere decir que automáticamente tu MMR será el de un bronce IV, sino que tienes que mantenerte con una racha lo suficientemente verde como para que el MMR se aclimate a tu nueva división.\nPor ejemplo cuando era platino I ganaba lo mismo que perdía, por lo tanto mi MMR era de platino I y no de diamante V. Cuando salió el devorador tuve una racha verde con Xin Zhao y subí bastante rápido a diamante, pero al llegar allí me encontré conque perdía más de 20 PL y no ganaba ni 15. ¿Qué hice? me mantuve con un porcentaje de victorias cercano al 65 o 70%, haciendo que el sistema luego de unas 10 o 15 partidas acomode mi MMR a mi nueva división. Para que te des una idea tuve 6 victorias seguidas y ni así llegué a promo, quedé con 93 PL, pero luego desde esa racha verde gano la misma cantidad de PL que cuando pierdo, haciéndome más fácil mi estadía en esta división.","replies":[]}]}]},{"poster":"HotSjokzGG","date":"2015-09-29T21:58:28.912+0000","up_votes":1,"down_votes":0,"body":"el baron no tiene nada que ver. los LP que ganes depende solo y unicamente de tu elo","replies":[{"poster":" Acantha","date":"2015-09-29T22:00:25.313+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HotSjokzGG,realm=LAS,application-id=v7qsfXsE,discussion-id=njBO4HLZ,comment-id=0001,timestamp=2015-09-29T21:58:28.912+0000)\n>\n> el baron no tiene nada que ver. los LP que ganes depende solo y unicamente de tu elo\n\nTranquilo, ya me respondieron, gracias igual n.n","replies":[]}]},{"poster":"Zabivaka","date":"2015-09-29T23:40:58.350+0000","up_votes":1,"down_votes":2,"body":"Si empezas a ganar muchas partidas seguidas vas a ganar menos PL y vas a perder más, esto es debido a un sistema que sirve para que no subas tan rapido, pues quiere que te esfuerces para pasar de division y no subas por suerte","replies":[]}]}