{"poster":" Acantha","date":"2016-07-27T00:11:17.182+0000","title":"En caso de: \"¿¡Donde esta mi caja Riot y la..!?","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Hola. En caso de que hay gente que no le ha llegado su cajita es por 3 simples razones: \n\n1. Nunca participaste, te uniste o creaste un club...\n2. &iexcl;No te preocupes!, las cajas se entregaran hasta el 10 de AGOSTO. \n3. Aquellos que fueron baneados en estos &uacute;ltimos tres meses (por insolente, irte muy seguido afk, etc), no reciben premios de los concursos o modos de juego que se han hecho dentro de estos meses desde que fuiste baneado.\n\nEspero que esto ayude a esos jugadores que tiene la duda. \no.0 sobre todo aquellos que est&aacute;n en el punto 3.\n[https://i.ytimg.com/vi/a7H_FBo2t-w/maxresdefault.jpg ]\nPosdata: La imagen es de referencia. \n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Boku wa senpai","date":"2016-07-27T00:37:44.015+0000","up_votes":1,"down_votes":0,"body":"El punto tres dice que las personas que han recibido restricción de chat no recibirán recompensas, pero a un amiguito de mi club le llegó desde el ícono del evento hasta el aumento de PI. {{summoner:3}}","replies":[{"poster":"Turrote35","date":"2016-07-27T02:33:17.384+0000","up_votes":1,"down_votes":0,"body":"yo fui baneado permanente, me lo sacaron a los 2 días por aclare las cosas y no resivo nada :/","replies":[]}]},{"poster":"Thails SirYordle","date":"2016-07-27T00:13:08.760+0000","up_votes":1,"down_votes":0,"body":"es hasta el 10 de agosto :v","replies":[{"poster":" Acantha","date":"2016-07-27T00:14:01.929+0000","up_votes":1,"down_votes":0,"body":"Gracias por corregir, no se en que pensaba XD.","replies":[]}]},{"poster":"XxlentaoxX","date":"2016-07-27T01:52:04.935+0000","up_votes":1,"down_votes":1,"body":"Vivo con restricciones de chat y me llego. Nunca recibí ban, pero tengo amigos que fueron baneados un dia antes de la caja de buen comportamiento de 2014 y se la dieron, otro recibió un ban 2 meses antes de la FdM y le dieron skin. Supongo que es para meter miedo eso.\nNos vemos, voy a flamear para llegar a mi 8va restricción de chat.","replies":[]}]}