{"poster":" Acantha","date":"2017-08-05T18:09:36.532+0000","title":"Y te demuestro que los Rioters de LAS no se toman nada en serio.","subforum":"Off-topic y temas personales","up_votes":9,"down_votes":10,"body":"Aclaro que el tema esta enfocado a los **Rioters** que trabajan en el foro de **LAS.**\r\n\r\nhttps://fotos.subefotos.com/f2e13f600b8a9f5e8d8f80d21dc6483fo.png\r\n\r\nD&iacute;as atr&aacute;s cree un post donde muestro un jugador que no paro de insultar durante 45 minutos de la partida, lamentablemente no pude censurar todos los nombres, y el post solo duro 10 minutos, posterior a eso **Riot Games** me banea del foro por el hecho que incumpl&iacute; una regla &quot;**No usar el nombre de invocadores en v&iacute;deos, pantallasos o audios con motivos de perjudicar a este/estos invocadores...**&quot;.\r\n\r\nhttps://fotos.subefotos.com/4220c3f2a6fea975e633dad746c02f05o.png\r\n\r\nY dejando eso de lado, &iquest;**por que Riot Games crea reglas donde algunos pueden infringirlas, incluyendo ellos?**\r\nPara los que no saben, un jugador, que no nombrare, crea un post llamado **4 afk en mi partida**, donde este personaje pide que Riot haga algo al respecto (banearlos), y para peor, este deja un v&iacute;deo y un pantallaso donde se aprecian claramente los nombres de los invocadores...\r\n\r\nhttps://fotos.subefotos.com/293d62362c56867e5171915db6bd24a8o.png\r\n\r\n&iquest;Como es posible que este post, con mas de 12+ positivo, mas de 500 visitas, no es baneado o eliminado donde claramente crea un post donde perjudica a 4 jugadores no solamente con un pantallaso, si no con un v&iacute;deo?\r\n\r\nRealmente me da rabia la injusticia, o la falta de compromiso por los Rioters cuando de post que incumplen reglas en el foro no son baneados. Como yo, a muchos les pasa que a veces crean un post donde se equivocan de **tipo de post** y el post es eliminado en cuesti&oacute;n de minutos.\r\nSin embargo, llega gente, que nunca se vio en los foros, crea un post, perjudica a jugadores y lo dejan como si estuviera cumpliendo todas las reglas. Sin mencionar a esos foreros de colores **amarillos** y **celestes**, que se pelean entre si para acusar X cosas con los Rioters, y cuando realmente se necesitan, ni se asoman...\r\n\r\nEspero que ese post llamado **4 afk en mi partida** sea eliminado y reciba una suspensi&oacute;n al igual que todos en el foro. O simplemente me queda claro, que aqu&iacute; en LAS no se toman nada en serio.","replies":[{"poster":"xaerials","date":"2017-08-05T18:46:18.741+0000","up_votes":4,"down_votes":1,"body":"Hola!. Nos tomamos las cosas bastante en serio, por eso no borramos el post que acabas de explicitar. Si bien, los nombres de invocador son claramente visibles, ya hemos dicho en varias ocasiones, que es la intención del post lo que cuenta. Bajo esta perspectiva y lo que se diferencia con tu post, es que no hay intención de denuncia en este. \n\n\"Y dejando eso de lado, ¿por que Riot Games crea reglas donde algunos pueden infringirlas, incluyendo ellos?\". ¿En qué momento ha pasado esto?. Con gusto leo algún ejemplo :). ¡Saludos!.\n\n-Xae","replies":[{"poster":"exrex","date":"2017-08-05T19:59:03.517+0000","up_votes":3,"down_votes":0,"body":"La verdad chabon estuviste flojo con la respuesta, esperaba que dijeras algo como que se te habia pasado por alto.  \n\nPor favor repasa las normas del foro \n\n> • No coloques el nombre de otros jugadores sin su autorización eso evita peleas y discusiones que crean un mal ambiente (lo mismo se aplica con capturas de pantalla polémicas).\n> \n> • No uses el foro para acusar a alguien de ser un noob, feedear, trolleo, generar mal ambiente, etc. Eso se realiza directamente reportandolo dentro del juego, en el foro solo se generan mas peleas y todo termina en una épica batalla como Demacia contra Noxus donde moriremos delante de nuestras pantallas.\n\nhttps://boards.las.leagueoflegends.com/es/c/charlas-generales/tYVHLRE9-como-usar-nuestro-foro-reglas-para-el-bienestar-general\n---------------------------------------------\n\n\n> \"Y dejando eso de lado, ¿por que Riot Games crea reglas donde algunos pueden infringirlas, incluyendo ellos?\". ¿En qué momento ha pasado esto?. Con gusto leo algún ejemplo :). ¡Saludos!.\n\nAca le dejo material. \n\n https://boards.las.leagueoflegends.com/es/c/comportamiento-del-jugador/5r9A9eEj-la-actitud-de-los-voluntarios-condensado-en-un-post\nhttps://boards.las.leagueoflegends.com/es/c/comportamiento-del-jugador/ytdpVtgB-excalibeer-voluntario-reincide-con-actitud-negativa-y-lo-protegen-de-nuevo\n----------------------------------------------------------------\n\nAca le dejo un post en donde se le hicieron miles de criticas a los moderadores pero a pesar de que uno de ustedes fue baneado por su comportamiento frente a las criticas, no cambiaron absolutamente nada. \n\nhttps://boards.las.leagueoflegends.com/es/c/charlas-generales/ir5d9WTc-los-moderadores-del-foro-hacen-mal-su-trabajo-con-el-mayor-de-los-respetos-plz-no-ban\n--------------------------------------------------------------------------\n\nAclaro que no busco ninguna respuesta, solo lo menciono. \n\nSaludos.","replies":[{"poster":"Excorpion","date":"2017-08-06T01:40:51.276+0000","up_votes":1,"down_votes":0,"body":"Me gusta como te has desarrollado exrex :3\nAunque me parece raro que nadie se da cuenta de que el comentario de Gato terminó siendo aceptado por los argumentos presentados, y que un amarillo ya fue eliminado del programa por mala conducta... pero nadie lo ha notado.\n\nEntonces yo quede con la duda en ese tiempo... ¿Cuales fueron realmente las malas actitudes?, descontando unas escapadas de otros que a mi parecer respondieron de mala gana (el que llamó pedazo de tóxico a un jugador, etc)... yo por ejemplo, [le dije a todos en el foro que eran platas o bronces, y mostré los datos de ello](https://boards.las.leagueoflegends.com/es/c/charlas-generales/TOwJhktq-70-de-la-comunidad-en-bronce-o-plata-estadausticas-las?show=flat) (y se me hizo lindo poner el gif para llamar la atención, cosa que resultó), pero solo un par de personas denotaron el tema del gif, y el post terminó siendo tema de discusión para muchos de los que se pasaron... pero creo que nunca tuve un caso directo por responder en los comentarios a otros jugadores.","replies":[{"poster":"exrex","date":"2017-08-06T09:51:37.483+0000","up_votes":3,"down_votes":0,"body":"Tu post no se compara. En resumen, en el caso de tu compañero desarroll y gatomonstruo se pusieron a decir que no iban a aceptar la opinión de un bronce, literal. \nEl comentario no fue aceptado, fue rechazado por un rioter despues de ver que el post tuvo apoyo admitiendo que fue pesado y que termino por desvirtuar el post. dicho por el mismo. \nLos argumentos que usaron fueron los siguientes\n\"los demas tambien lo hacian\"\n\"esa norma ya no la usamos\"\n\n\nY mira la hipocresia que aparece tu amigo desaroll hablando en este tema.\nhttps://boards.las.leagueoflegends.com/es/c/charlas-generales/FhwQiA5K-todos-tienen-el-derecho-de-tener-una-opinian-no-importa-a-que-divisian-pertenezcan\nAhora le parece mal, hace 6 meses para el fue una practica maravillosa. \n--------------------------------------------------------------------------------\n\nNo voy a discutir mas sobre ese tema, todo ya fue dicho. Y mucho menos voy a responderle a un mod que esta hace 3 años en un foro y todavía no se sabe las normas del lugar en donde trabaja, pero tiene cara para decir que sus errores son nada mas que visiones subjetivas de los demas.\n\nO sea, pensa esto, si hasta el dia de hoy no se sabe las reglas, que iba a pretender hace un año cuando salio ese tema? y que voy a pretender hoy? no tiene sentido. \n--------------------------------\n\nSi alguien salio del sistema de voluntarios, no lo se y la verdad a esta altura no estoy interesado en saberlo. Me da igual, significa tanto para la comunidad que echaron a alguien y nadie se dio cuenta. O sea. no hay mas que decir.","replies":[{"poster":"Excorpion","date":"2017-08-06T12:03:09.210+0000","up_votes":1,"down_votes":0,"body":"> Y mira la hipocresia que aparece tu amigo desaroll hablando en este tema.\n\nNo es mi amigo... no entiendo por que siempre dicen esas cosas... yo igual he debatido muchas veces contra el, eso no lo hace mi amigo, tampoco el ser amarillo.\nPero mirando solo el comentario, creo que deja sus puntos claros, está explicando el tema de la falacia en la argumentación, en la sentencia de \"Yasuo es OP\", si hasta yo hice un post ([Yasuo necesita un nerfeo?](https://boards.las.leagueoflegends.com/es/c/charlas-generales/m24j5wOy-analizando-yasuo-necesita-un-nerfeo) \\) donde mostré la correcta forma de hacer la crítica, y así diferenciarse de alguien que solo no le sabe jugar, y le tiene bronca. \nYo creo que un mal argumento, invalida cualquier sentencia, me da igual quien lo diga, y por eso debato los temas primero, si la consistencia del argumento es lógica, para mi tienen razón, sea o no sea el punto en la conversación, tendrá razón, dado que su lógica tiene sentido.\n\nCon respecto al tema de los mods, pienso lo mismo... muchas veces lo han hecho, y seguro seguirá ocurriendo, pero solo basta remitirse a la cantidad de reportes y a las normas, las cuales ahora mismo, no cubren todos los casos y necesitan mejoras drásticas para poder hacerlo. (Así como muchas normas de Riot en general, que se protegen más a sí mismo, que a la comunidad)\n\n> Si alguien salio del sistema de voluntarios, no lo se y la verdad a esta altura no estoy interesado en saberlo. Me da igual, significa tanto para la comunidad que echaron a alguien y nadie se dio cuenta. O sea. no hay mas que decir.\n\nYep, es tan claro como la reacción de la comunidad, simplemente, no importa.","replies":[]}]}]},{"poster":"xaerials","date":"2017-08-05T20:20:22.393+0000","up_votes":1,"down_votes":0,"body":"¡Hola!. Siento no haber cumplido las expectativas con mi respuesta. \n\n\"a pesar de que uno de ustedes fue baneado por su comportamiento frente a las criticas, no cambiaron absolutamente nada\". Eso no ha pasado, en lo absoluto.\n\nEl tema de los voluntarios, y que \"se protegen\" es un tema de amplia discusión. Hemos dicho muchas veces, que ellos son jugadores **igual que ustedes** , por ende no tienen ninguna regalía o protección. Esto queda bajo tu subjetividad y no puedo hacer nada para ayudar o cambiar tu parecer.\n\n\n-Xae","replies":[]}]},{"poster":" Acantha","date":"2017-08-05T19:15:24.033+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=xaerials,realm=LAS,application-id=J8qpiO2I,discussion-id=EUQcz5QI,comment-id=0002,timestamp=2017-08-05T18:46:18.741+0000)\n>\n> Hola!. Nos tomamos las cosas bastante en serio, por eso no borramos el post que acabas de explicitar. Si bien, los nombres de invocador son claramente visibles, ya hemos dicho en varias ocasiones, que es la intención del post lo que cuenta. Bajo esta perspectiva y lo que se diferencia con tu post, es que no hay intención de denuncia en este. \n> \n> &quot;Y dejando eso de lado, ¿por que Riot Games crea reglas donde algunos pueden infringirlas, incluyendo ellos?&quot;. ¿En qué momento ha pasado esto?. Con gusto leo algún ejemplo :). ¡Saludos!.\n> \n> -Xae\n\nCreare un post aparte, donde en varias ocaciones ellos mismos dicen insolencias en post, incluso en los de ellos, lamentablemente, nadie los banea a ellos, pero uno escribe algo o una palabrota y es baneado.\nSegundo, ¿como que el post que nombro no tiene malas intenciones?, Habla con un rioter y pidele que te pase mi post que fue baneado, en ningun momento pedi que reportaran este grupo de personas, solo cree un post diciendo \"la partida mas turbia de mi vida\" donde X jugador insulto durante 45 minutos, en ningún momento pedí que los banearan, a diferencia de este, que incluso pide que Riot los sancione.","replies":[{"poster":"xaerials","date":"2017-08-05T20:24:07.123+0000","up_votes":2,"down_votes":0,"body":"Déjame revisar tu caso.","replies":[]}]}]},{"poster":"IvVicious","date":"2017-08-05T18:14:49.966+0000","up_votes":5,"down_votes":2,"body":"Los rioters no moderan el foro.","replies":[]},{"poster":"xaerials","date":"2017-08-05T20:32:08.635+0000","up_votes":2,"down_votes":0,"body":"¡Hola!. Esto fue lo que acordamos, borramos el post del cuál hablas, porque a pesar que se puede \"camuflar\" la intención de denuncia, NO se puede exponer nombres de invocador bajo ninguna circunstancia donde queden expuestos por un mal comportamiento. Gracias por el feedback, ley pareja no es dura :). ¡Saludos!.\n\n-Xae","replies":[]},{"poster":"Excorpion","date":"2017-08-06T01:18:16.842+0000","up_votes":1,"down_votes":0,"body":"Primero, no te banearon, te borraron el post simplemente.\nSegundo, todos los jugadores estamos bajo las mismas normas, por lo que nadie puede denunciar usando nombres. Lo que la gente hace, es contar que en una partida tuvo afks, y dice los personajes, esto lo hace totalmente aceptable para el foro.\nHace un par de días respondí un post donde el sujeto ponía explícitamente los nombres, y en menos de 1 minuto, le respondí que los borrara para que su post no fuera eliminado, el sueto los borró, y el post queda libre de sanción de cualquier tipo.\n\n> _Ejemplo_\n- **Correcto: ** Ayer tuve un wukong que se tiró bajo torre 600 veces para trollear...\n- **Incorrecto:** Ayer, un jugador llamado alex777 se tiró bajo torre 600 veces para trollear...\n\nEs lo mismo, solo que sin el nombre... no cuesta nada hacer eso.","replies":[]},{"poster":"Yellow Sphere","date":"2017-08-05T18:14:23.001+0000","up_votes":1,"down_votes":4,"body":"> Y te demuestro que los Rioters de LAS no se toman nada en serio.\n\nEso no es ninguna novedad...","replies":[]}]}