{"poster":"OwlRaven","date":"2015-02-20T21:11:36.453+0000","title":"Hős,mágus","up_votes":1,"down_votes":0,"body":"Hali szerintetek a 3 közül kit vegyek meg első \"mágusként\"?Morgana, Fiddlesticks vagy Cho'Gath?","replies":[{"poster":"CSZDragon","date":"2015-02-21T08:38:31.285+0000","title":null,"up_votes":2,"down_votes":0,"body":"Azt is érdemes hozzátenni, hogy Morgana jelenleg az egyik legtöbbször pickelt support, de miden is megállja a helyét. Sőt, mostanában többször top-ra is hozzák. Emellett jungle-ben is életképes. Szóval sokoldalú, és erős karakter.","replies":[]},{"poster":"frvr13","date":"2015-02-21T13:18:46.722+0000","title":null,"up_votes":3,"down_votes":1,"body":"Cho'Gathot ajánlom. Rettenet nagy tévedés, hogy \"csak egy tank\". Az emberek csak azért viszik tanknak, mert az ultijával bónusz hp-t tud szerezni, de pont emiatt ostobaság fulltanknak vinni. Nem egy mobilis hős(ahogy Morgana sem, is fiddlenek is csak egy megszakitható blinkje van, amit sebzésre sokkal értelmesebb használni), viszont kárpótolja őt ezért az ap-ból kiinduló tényleges sebzés hősökre és minionokra egyaránt, a rettenet hosszú némitás, és a spamelhető fellökés, ami egyben lassitás. Emellett ott van a passzivja, ami nagyon erős ap lanerré teszi, és a passziv, nem is olyan gyenge ap-rátával rendelkező alaptámadás-erősitő is jól jöhet neki egyaránt miden és topon. A q-jának nagy a range-je, és ha több agyad van mint egy moszatnak, akkor néha azért alá tudod rakni az enemynek. Plusz az sem elhanyagolható, hogy az AP-rátái hatalmasak: q: 100% AP w: 70% AP e: 30 AP%(autotattackokra, manaköltség nélkül, AoE) r: 70% AP TÉNYLEGES sebzésként. Erősebb, mint egy Darius ulti. Simán tudsz neki kb. 500 AP-t szerezni, és még tankosra is viheted. Példa build:\n{{item:3089}} {{item:3027}} {{item:3116}} {{item:3003}}  {{item:3065}} {{item:3151}} \nEz, plusz az ulti stackjai adnak neki több mint 2500 bónusz életerőt ÉS rengeteg ap-t. Tankos, sok a sebzése, jók a képességei alapsebzése, könnyű vele farmolni, majdhogynem elüldözhetetlen a sávról, és habár nehéz elsajátitani, de ha eleget gyakorolsz vele, egy-két hőst(például Warwick) leszámitva mindekit elversz.","replies":[]},{"poster":"M4dr4c","date":"2015-02-20T23:43:38.507+0000","title":null,"up_votes":2,"down_votes":1,"body":"Morgana, ha ebből kell mindenkép választani. Ha jó van skillshotokkal akkor Luxot ajánlom inkább.","replies":[]},{"poster":"OwlRaven","date":"2015-02-20T23:59:54.435+0000","title":null,"up_votes":1,"down_votes":0,"body":"Kössz!","replies":[]},{"poster":"Eshu","date":"2015-02-21T09:30:18.550+0000","title":null,"up_votes":1,"down_votes":2,"body":"Érdekes választék ha \"mágust\" akarsz... ChoGath egy tank. Nem lesz valami nyerő ha AP-nek építed. Morgana az ami a legközelebb áll ahhoz hogy mágusnak nevezzem. Fiddlesticks-szel ha nem tiszta a játék mechanizmus max feedelni fogsz. Mindig utálom a saját csapatomban látni ismeretlen embertől. De mágusnak egy Lissandrával Ahrival vagy Ziggs-szel lehet hogy könnyebben boldogulnál kezdőként. Morgana mondjuk nem rossz.","replies":[]},{"poster":"YiJaegar","date":"2015-02-20T21:56:38.111+0000","title":null,"up_votes":1,"down_votes":2,"body":"Én személy szerint Morganát ajánlom, cho inkább tank mint mágus, fiddle pedig elég érdekes mechanikájú (de ha egyszer az ember kitanulja csúnya dolgokra képes, de addig szenvedés).","replies":[]}]}