{"poster":"Aleisterpy99","date":"2019-12-02T21:11:05.520+0000","title":"Bug de elecci贸n a 3 campeones al llegar al nivel 9-10.","subforum":"Problemas T茅cnicos","embed":{"description":"Captured with Lightshot","url":"https://prnt.sc/q5931q","image":"https://image.prntscr.com/image/wB9GouhXQX66UlNUcTBBbQ.jpg"},"up_votes":5,"down_votes":0,"body":"Buenas, les comento que sub铆 al **nivel 10** y al mismo tiempo **realic茅 1 misi贸n** y el juego me recompens贸 el nuevo nivel o el haber hecho 1 misi贸n, con la posibilidad de elegir a 3 campeones. Al mover mi cursor por sobre los campeones me di cuenta de que no pod铆a elegir la opci贸n de \"Ver Habilidades\", \"Seleccionar\" o \"Aceptar\" por lo que me qued茅 atascado en esa pantalla. Reinici茅 el juego, desinstal茅 y lo volv铆 a instalar, reinici茅 mi pc y de igual forma no puedo pasar la pantalla de elecci贸n que me da el juego. Alguna sugerencia o soluci贸n?","replies":[{"poster":"Crazy Bear T","date":"2020-01-13T00:51:45.168+0000","up_votes":2,"down_votes":0,"body":"A mi me acaba de pasar lo mismo y lo pude solucionar. Apenas entras al cliente clickeas en configuraci贸n del cliente(tiene que ser r谩pido) y le cambias el tama帽o, yo lo tenia en el m谩s peque帽o (1024 x 576) y  lo cambie al m谩s grande (1600 x 900) y ahi si me dejo elegir a uno de los campeones. Espero les pueda servir, un saludo.{{summoner:31}}","replies":[{"poster":"Samuzah","date":"2020-01-18T11:43:00.578+0000","up_votes":1,"down_votes":0,"body":"Gracias! lo tuve que intentar unas 3 veces hasta que me sali贸. {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"TheHaitianBoi","date":"2020-01-17T02:19:48.929+0000","up_votes":1,"down_votes":0,"body":"Gracias hermano, tu soluci贸n s铆 funciona si lo haces r谩pido","replies":[]}]},{"poster":"Nine Iota","date":"2019-12-02T21:58:10.387+0000","up_votes":1,"down_votes":0,"body":"Si tenes la posibilidad, trata de iniciar sesi贸n en otra computadora para pasar esa pantalla, no es una soluci贸n pero al menos es un parche temporal. Yo creo que tiene que ver con la resoluci贸n del launcher.","replies":[{"poster":"Aleisterpy99","date":"2019-12-02T22:16:04.496+0000","up_votes":2,"down_votes":0,"body":"De alguna forma logr茅 cerrar la ventana de elecci贸n de recompensa y pude jugar una partida, sub铆 de vuelta de nivel pero no me recompens贸 m谩s el juego. Estar茅 dando un update si contin煤o sin problemas subiendo de nivel sin el bug, al final del d铆a estar茅 borrando el post si no existe problema alguno.\nDe todas formas agradezco tu ayuda.!","replies":[]}]},{"poster":"The Infunabl3","date":"2019-12-03T21:21:37.097+0000","up_votes":1,"down_votes":0,"body":"Amigo, encontraste alguna soluci贸n? A mi me pasa exactamente lo mismo y no puedo jugar {{champion:32}}","replies":[{"poster":"Aleisterpy99","date":"2019-12-04T10:34:14.211+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Infunabl3,realm=LAS,application-id=X54mVVp0,discussion-id=KEbaqYwz,comment-id=0004,timestamp=2019-12-03T21:21:37.097+0000)\n>\n> Amigo, encontraste alguna soluci贸n? A mi me pasa exactamente lo mismo y no puedo jugar {{champion:32}}\n\nBuenas, no encontr茅 ninguna solci贸n permanente pero s铆 una temporal que funciona hasta ahora. Apenas ejecutes el juego (luego de haber iniciado sesi贸n) se te presentar谩 la pantalla de carga con la L de LoL, segundos despu茅s te dar谩 el tiempo de clickear algunas de las pesta帽as que tiene el juego, yo siempre le doy click a la de \"Colecci贸n\" y apenas aparece la pantalla de recompensa, le apretas el bot贸n \"Esc\" es la 煤nica forma que el juego cierra esa pantalla pero si dejo pasar varios segundos y aparece la pantalla de recompensa NO funciona la soluci贸n temporal. Es raro el bug pero al menos tenemos soluci贸n temporal.","replies":[]}]},{"poster":"Aleisterpy99","date":"2019-12-03T03:00:36.288+0000","up_votes":1,"down_votes":0,"body":"Update: El bug contin煤a una vez reiniciada la sesi贸n de m铆 cuenta, es decir, el problema contin煤a y no s茅 c贸mo solucionarlo pero encontr茅 una soluci贸n temporal. Al ejecutar el juego luego de la pantalla de carga con el logo LoL, me da un breve segundo como para clickear en la pesta帽a colecci贸n y as铆 evitar el bug. ","replies":[]},{"poster":"UNKNOWSER","date":"2019-12-03T01:00:21.640+0000","up_votes":1,"down_votes":0,"body":"Ami me paso en todas las cuentas y solo tube que cerrar el cliente y entrar de nuevo","replies":[]},{"poster":"Dalahsurfal","date":"2019-12-02T22:33:57.709+0000","up_votes":1,"down_votes":0,"body":"葛 ,               .","replies":[]}]}