{"poster":"Clean Morgana","date":"2018-02-02T16:22:36.100+0000","title":"Essere plat è good?","subforum":"Discussioni generali","up_votes":3,"down_votes":0,"body":"Sto per fare plat (spero) ma voglio capire se posso ancora ritenermi bad come player in generale o se plat &egrave; comunque un elo buono. Per intenderci: c&#039;&egrave; tanta differenza da plat a diamond? Corrisponde pi&ugrave; o meno a quella tra gold/plat? Voglio capire fino a che punto posso migliorare\r\nTy in anticipo e buon weekend guyz","replies":[{"poster":"Cry of the Celts","date":"2018-02-02T21:54:15.921+0000","up_votes":3,"down_votes":1,"body":"L'elo \"buono\" è quello in cui si è: sotto il proprio elo sono tutti dei senza mani che non sanno fare nulla, sopra il proprio sono tutti dei nerd senza vita sociale che non fanno altro che giocare a lol. \n{{sticker:slayer-jinx-wink}} \n\nPer il resto gioca sempre meglio che puoi senza preoccuparti dell'elo, avrai delle partite molto più soddisfacenti","replies":[]},{"poster":"Dr LouD","date":"2018-02-02T16:37:31.403+0000","up_votes":4,"down_votes":2,"body":"Fare meno schifo della media è sempre un ottimo traguardo su LoL","replies":[]},{"poster":"Power Mac","date":"2018-02-03T09:50:56.809+0000","up_votes":2,"down_votes":1,"body":"La risposta è: in qualunque livello tu sia, farai sempre schifo per buona parte del forum. Sta' certo che, se arriverai a Diamond II o I, ti diranno che è il livello minimo per non essere considerato una scimmia; se arriverai in master ti diranno che sei vicino al saper giocare; se arriverai in challenger ti diranno \"sì non sei male, ora sai giocare\". Un Platinum, specialmente se alto, è chiaramente un ottimo livello: dopo quello c'è solo il Diamond alto, del resto (evitiamo di prendere in considerazione il professionismo, perché essere challenger è praticamente un lavoro, e master significa non fare altro tutto il giorno).","replies":[]},{"poster":"Bluishlion","date":"2018-02-07T06:58:13.109+0000","up_votes":1,"down_votes":0,"body":"Io sono p3 e vedo ancora oscenitá che farebbero concorrenza al bronze time quindi si, il platino non è il massimo, ma sei sopra la media. Credo che dal p1 in poi si inizia a ragionare. Per essere considerato un giocatore veramente forte invece devi essere almeno d2.","replies":[]},{"poster":"Pellah","date":"2018-02-03T00:58:15.594+0000","up_votes":1,"down_votes":0,"body":"La differenza tra Plat e Diamond è tangibile, conta che come ti hanno già detto più sali di ero e più la differenza tra una divisione e l'altra aumenta.\n\nIl Plat è un buon obiettivo? Non credo, non che tu non debba essere felice di averlo raggiunto eh, ogni piccolo obiettivo  va festeggiato. Penso che però il primo vero obiettivo sia il Diamond, fino a che non capisci come funziona almeno, poi capisci che se non sei D1+ non hai raggiunto alcun vero obiettivo lol.","replies":[]},{"poster":"Ray Chiri","date":"2018-02-03T00:20:32.468+0000","up_votes":1,"down_votes":1,"body":"La prima volta che feci platino in season 5 era bellissimo, gente serissima con 80 minion al minuto 10, selezionavano il campione in base a ciò che mancava nel team (ho zed mid e manca danno ap? rumble/vladimir/swain top ) . Di quella comunità è rimasto forse solo il counterpick.\n\nOra è molto peggio e purtroppo per colpa di scelte di mamma rito. \nCon l'arrivo delle ranked flex dopo quel periodo dove si, tutti si flammavano come adesso la qualità del matchmaking è scesa a picco e ha faticato tantissimi anche solo per migliorarsi un pochino.\n\nil primo problema erano i matchmaking con 5 premade gold 5 contro   2+2+1 premade gold 4 ad esempio dove essere di una divisione in più doveva in teoria compensare l'affiatamento di un team compatto. Inaspettatamente i team da 5 vincevano al 60% per ovvi motivi ( meno tilt, chiamate ss, babysitter del jungler, dive coordinati,....) . Mamma rito ha sbagliato. Succede.\nPer rimediare a questo errore mamma rito ne commette un secondo ovvero dividere la coda in 2 code, dimezzando la popolazione di lol in 2 code. \nImmaginate adesso di essere il più forte di un gruppo di  6 persone e il più forte di un gruppo di 12 persone. Essere più forti di un gruppo più piccolo è più facile. \n\nQuindi essere platino oggi non è la stessa cosa di essere platino in season 5 perchè ci sono 2 code e il matchmaking è peggiorato e sta cercando di risanarsi.","replies":[]},{"poster":"Saibbo","date":"2018-02-02T23:19:38.655+0000","up_votes":1,"down_votes":1,"body":"Onestamente? Secondo me giocatori pessimi vanno da B5-S2, giocatori . S2-G1, giocatori decenti G1-P3, giocatori buoni P3-P1, giocatori orribili D5, giocatori bravi D4-D3, poi penso da D2 in su trovi gente che vive solo di questo gioco ma che e' decisamente brava. Ovviamente parlo del MMR nascosto non del rank che uno ha, uno potrebbe giocare da D4 ma essere in gold perché non ha sbatta di rankare. In più le Divisioni 5 di un elo le vedo sempre con un -1 (cioè G5 -> ancora silver)","replies":[]},{"poster":"Aegis Winebeard","date":"2018-02-02T19:48:57.454+0000","up_votes":1,"down_votes":1,"body":"Certo, basta che tu abbia un atteggiamento positivo con gli altri\n\nPoi dopo, l’elo diventa Secondario","replies":[]},{"poster":"KCM Randagio I","date":"2018-02-02T18:17:13.934+0000","up_votes":1,"down_votes":1,"body":"Ciao!!!\nAllora il Plat è buono, vuol dire che cominci ad essere un giocatore decente.\n\nPerò tieni conto che il divario tra plat e diamond è molto più ampio di quello tra gold e plat. \n\nIl perchè è semplice.. nel Platino sei nel migliore 8/9% dei giocatori, nel diamante tra il 1,5/2%.. quindi per scalare c'è molta più differenza di abilità rispetto al gold dove sei solo nella media (circa 25/30% dei giocatori).\n\nPiù si sale più il gap tra i player è alto","replies":[]},{"poster":"Aurelion Shmoll","date":"2018-02-02T16:59:02.293+0000","up_votes":2,"down_votes":2,"body":"Buono o male sono concetti relativi, dipende quali sono i tuoi standar.\n****\nLa differenza tra elo ed elo aumenta proporzionalmente. La differenza tra un D5 e un D3 è la stessa che c'è tra un silver e un plat.","replies":[]},{"poster":"Linkimaru","date":"2018-02-02T16:35:12.280+0000","up_votes":1,"down_votes":1,"body":"No sorry, fa abbastanza schifo il plat, differenza tra plat e diamond dipende, tipo tra plat 5 e D5 si, avoglia ma tra p1 e d5 non cambia niente. La differenza si conta a seconda di quante divisioni ci sono in mezzo, da diamond in poi il divario tra una divisione ed un altra aumenta in maniera quasi esponenziale perchè già da D5 vinci e perdi più o meno la stessa somma di lp anche se hai un mmr alto, quindi per salire devi vincere almeno 3 game su 5 ne consegue che tra D5 e D3 c'è molta più differenza che tra P5 e P3 ad esempio.","replies":[]},{"poster":"Clearωay","date":"2018-02-02T18:54:51.419+0000","up_votes":3,"down_votes":4,"body":"Quello che posso dirti è questo: è good per gli standard di una persona normale, perché i pro player e gli streamer ti diranno \"fai cagare al cazzo, sei solo plat 5\" ma sai qual è la differenza? Che tu hai una vita al di fuori di lol, lavori, studi, esci con gli amici ecc, quello che fanno i pro player è giocare 10 ore al giorno a lol, credo che sia inevitabile esseri più bravi degli altri no? Okay, farai cagare rispetto a loro, ma non potendo concederti il \"lusso\" di giocare per metà giornata ogni giorno a lol credo che rientrare nei migliori 9-10% dei giocatori non sia male.\nAnche per restare a diamond 2-3 devi avere una certa costanza nel giocare, perché a livello più alto contano i dettagli e se non li curi ogni giorno è inevitabile che tu scenda. Migliorare? Certo che puoi, ma non aspettarti di raggiungere il diamond alto, questo no, perché ci vuole il doppio del tempo e dell'impegno, direi anche inutile trattandosi di un gioco che non ti frutta soldi o altro","replies":[]}]}