{"poster":"AntDoom","date":"2019-11-26T03:01:29.699+0000","title":"Riot needs to fix this issue with leavers/rage quitters","subforum":"Player Behavior","up_votes":4,"down_votes":3,"body":"I get at least a couple of leavers or rage quitters every day. Wanted to suggest something more fair to the team that is now basically going to lose due to the game being 4v5. \r\n\r\nRather than unfairly punish the people who are actually playing the game, maybe we can lose LESS LP when someone else leaves the game, ruining it for the entire team and basically ruining the game for everyone. Is something like this in the works? I mean it is getting really old and when you are trying to grind LP, this makes the game a lot less fun. \r\n\r\nThoughts Riot???","replies":[{"poster":"HorseProofBacon","date":"2019-11-26T17:35:26.102+0000","up_votes":3,"down_votes":0,"body":"This has come up a zillion times before and the counter answer is the same; It could and would easily be abused.","replies":[]},{"poster":"WoollyWitch","date":"2019-11-26T06:22:53.477+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"NF Remilia","date":"2019-11-26T09:47:09.099+0000","up_votes":3,"down_votes":0,"body":"What about those people that are getting DCed or bug error from client and can't reconnect right away before the leave system detects them ?","replies":[]}]},{"poster":"GatekeeperTDS","date":"2019-11-26T03:11:35.508+0000","up_votes":4,"down_votes":3,"body":"Nope.\n\nTying LP gains or losses to anything other than winning or losing the game pollutes individual ranks and the ladder as a whole. 5 people have to win full LP, 5 people have to lose full LP. You losing less because of a leaver would not be fair to the people that won the game.\n\nAdditionally, I want you to think about this and you'll see how this could be easily abused, or used to bully people to leave games so that others lose less LP.\n\nNot going to happen.\n\nPreseason is a shitshow every year, my man. Stop playing ranked. Give yourself a break until things settle down.","replies":[]},{"poster":"Modnar Erom","date":"2019-11-26T03:58:51.595+0000","up_votes":1,"down_votes":0,"body":"Well a couple of things:\n\n1) Verified queue so that there can be real, meaningful consequences.\n\n2) Preventing LP could be tricky, though preventing MMR loss should be fine.  I would hope that much is done already, since losing a 4v5 shouldn't really hurt your expected rating, but it probably isn't.","replies":[]}]}