{"poster":"Beskh01","date":"2017-08-07T16:04:35.527+0000","title":"Il Silver è un sogno lontano ? Ecco come farsi \"boostare\" dalla Riot","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Salve a tutti ! {{champion:412}} \r\nInizialmente pensavo fosse una cosa casuale e invece &egrave; proprio un dato di fatto.\r\nVoi, che siete in bronzo e fate fatica a salire perch&egrave; trovate trollers/feeders/afk e molto altro.. Non ci avete mai pensato ? \r\nSe l&#039;anno scorso (Stagione 6) avete giocato rankeds in solo/duo e vi hanno classificati bronzi quest&#039;anno per voi sar&agrave; praticamente impossibile guadagnarsi il silver senza tiltare e tryhardare migliorando tantissimo..\r\nNon so bene come funzioni, ma insomma.. Con un nuovo account fresco con qualche vittoria siete in Silver ! {{champion:17}} \r\n\r\nIo gioco dalla lontana Stagione 3, quest&#039;anno con le placement facendo 7w3l mi hanno direttamente messo in Bronzo e ho dovuto scalare duramente fino al Gold, trovandomi in team tutta la solita noiosa gentaccia che odia LOL, ma alla quale piace far tiltare le persone del proprio team.\r\nHo degli amici, i quali l&#039;anno scorso erano bronzo, e quest&#039;anno (pur giocando bene e facendo 5w5l) sono finiti in Bronzo V tutti e 3\r\nOra non sto dicendo che sono bravi nel giocare a lol, per carit&agrave;, pero se la cavano!\r\nMentre altri tre amici miei, giocando da quest&#039;anno con l&#039;account nuovo, facendo schifo (perche giocano appunto da poco) con 2/3 vittorie si sono portati a casa il loro amato Argento {{summoner:31}} \r\nCon 2 vittorie facendosi carriare dal team un&#039;altro &egrave; stato posizionato direttamente in Bronzo 1 !\r\n\r\nAdesso voi direte.. &egrave; solo un caso.. e invece l&#039;ho testato anch&#039;io :D\r\nHo portato un account al 30 (&egrave; davvero semplice e ce la si fa in poco tempo con l&#039;exp dimezzata) e letteralmente trollandole tutte mi hanno messo in Silver 3 :D ahaha\r\n\r\nDunque cari miei lettori, se siete cosi disperati, e avete voglia di provare, provateci e lo noterete subito anche voi ! :)\r\nGL &amp; HF {{summoner:4}}","replies":[{"poster":"Dr LouD","date":"2017-08-07T16:10:46.922+0000","up_votes":9,"down_votes":2,"body":"Ma solo io mi sono fatto il culo dal bronzo fino al diamond?\n\nIl rank ve lo dovete meritare, è inutile fare il silver con le placements con un nuovo account quando con 50 games poi droppate di nuovo in bronze","replies":[{"poster":"mikellazzo","date":"2017-08-07T18:07:03.301+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=ibOBHJqp,comment-id=0000,timestamp=2017-08-07T16:10:46.922+0000)\n>\n> Ma solo io mi sono fatto il culo dal bronzo fino al diamond?\n> \n> Il rank ve lo dovete meritare, è inutile fare il silver con le placements con un nuovo account quando con 50 games poi droppate di nuovo in bronze\n\nnon sei l'unico <3","replies":[]},{"poster":"Pellah","date":"2017-08-07T16:38:53.623+0000","up_votes":2,"down_votes":1,"body":"Bro ci sono anche io! :D S6 Da Bronzo 3 a plat 4, Questa season da Silver 4 ad attuale D4","replies":[]}]},{"poster":"zYaichi","date":"2017-08-07T16:27:25.709+0000","up_votes":6,"down_votes":0,"body":"Tanto la season successiva se eri silver ti fa partire da bronzo 5.\nNon risolvi nulla,il fatto che in silver è più facile salire rispetto al bronzo é una leggenda metropolitana,la differenza tra le due leghe è minima.","replies":[]},{"poster":"Re Sombra","date":"2017-08-07T17:14:42.945+0000","up_votes":2,"down_votes":0,"body":"caro, non lamentarti.\nHo giocato per un anno o due a hots; sai che li basta che ti fai un account nuovo, fai 5 e 5; e indovina un po; finisci diamond !! e il bello è che ci rimani  XD non c è alcun soft reset, ti basta fare 5 e 5 di nuovo e sei di nuovo diamond anche se non sai giocare; qua al  massimo finisci il silver alto.\nquindi il fatto che finisci silver con le prime dieci non significa niente per qua almeno c è un sitemma di reset decente.","replies":[]},{"poster":"Darkinknight","date":"2017-08-08T07:45:00.437+0000","up_votes":1,"down_votes":0,"body":"Internet explorer regna.\nÈ tipo una vita che si sa funziona cosi,ma non cambia nulla saperlo,season successiva vieni sbattuto giu di circa una lega a prescindere.","replies":[]},{"poster":"Don Draven","date":"2017-08-07T19:21:41.246+0000","up_votes":1,"down_votes":1,"body":"Tanto dal punto di vista mio bronzo e silver sono veramente delle leghe infime senza offesa... giocandoci mi sono accorto che non devo neanche sforzarmi per vincere fino a gold 2..","replies":[]},{"poster":"Skeltur","date":"2017-08-07T20:32:20.006+0000","up_votes":1,"down_votes":2,"body":"dai su, basta con queste cretinate: se avessi un account bronzo in 1 o 2 settimane sarei gold, finiamola di dare la colpa ai compagni di squadra","replies":[]}]}