{"poster":"Xeš","date":"2019-01-25T20:24:10.926+0000","title":"Elo vergabe","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":0,"body":"Findet ihr die Elo vergabe nicht auch ein wenig komisch?\n\nIn der Regel war ich mit der Elo vergabe immer ziemlich zufrieden. Doch in dieser Saison verstehe ich es nicht. Zu mir: Ich wurde diese Saison nach dem ersten Game Iron 2 eingestuft mit einem Lose und einer 6/2/2 Ahri mit 155 Farm in 23:50 Min. Und war in der davorigen Season B2 mit generellen 20-25 Spielen. Mein Teammate bei meinem Game war unranked und ist mit 0/7 aus dem Game raus und wurde jedoch Eisen 1 eingeranked. Ein Anderer Freund der in der vorherigen Season Silber 5 eingerankt wurde hatte sein erstes Game ebenfalls verloren als Zed mit 10/7/5 und 152 Farm in 29:08 min und wurde B4 eingestuft. \n\nWei&szlig; jemand wie das alles genau beurteilt wird? Weil f&uuml;r mich ist das einfach komplett unverst&auml;ndlich und auch nicht nachvollziehbar, denn w&auml;hrend viele sich schon auf Silber hocharbeiten, darf ich mit meinem &quot;ziemlich&quot; guten lose jetzt erst mal 5-6 Games machen um aus Iron raus zu kommen.\n\nIch hoffe auf ein paar Tipps und gute antworten p.s. das soll kein mimimi sein, ich werde mich trotz allem hoch spielen\n\ngr&uuml;&szlig;e, Xes","replies":[{"poster":"i am Mango  ","date":"2019-01-26T00:01:25.977+0000","up_votes":3,"down_votes":0,"body":"Wie den Mate, der Zed gespielt hat war ich letzte season auch S5.\nIch habe mein erstes Spiel gewonnen (mit Karma, Skillstufe B) und wurde trotzdem wie Zed auf B4 eingestuft. Die vorläufige Platzierung sagt nur aus, was dein schlechtester Rang werden kann in den Platzierungsspielen.\n\n\nIch zitiere die offiziellen Patch-Notes:\n\"Nach deinem ersten Ranglistenspiel erhältst du einen provisorischen Rang. Dieser Rang ist der niedrigste, den du nach deinen Platzierungsspielen erreichen kannst. Gewinnst du Platzierungsspiele, erhältst du Bonus-LP. Niederlagen kosten dich jedoch keine LP. Dein Rang wird für andere sichtbar, nachdem du deine Platzierungsspiele absolviert hast.\"\n\nFür einen ein habe ich 56 LP bekommen.","replies":[]},{"poster":"Holokom","date":"2019-01-26T14:34:06.050+0000","up_votes":1,"down_votes":0,"body":"Hey also wenn du willst kann ich dich mal spectaten und dir Hinweise geben,  Ich kann im Moment leider nicht selber spielen weil mein Internet rumm spinnt aber fürs spectaten dürfte meine Verbindung ausreichen. Einfach adden und anschreiben wenn du interesse hast.\n\nMFG Holokom","replies":[]},{"poster":"Sedros","date":"2019-01-25T21:03:18.887+0000","up_votes":1,"down_votes":0,"body":"Du musst bedenken dass unter dir 1 Division rausgenommen wurde und 4 hinzugepackt wurden. Dein B2 aus dem alten system ist in wirklichkeit ja eig nur Iron 1. \n\nUnd es wird hier zwischen Win/Lose entschieden und nicht nach Stats, weil die alleine keine Aussage über Skill sein können.\n\nZudem hast du trotzdem 10 Placement Games. Das ist nur dein vorläufiger Rang damit man besser sieht wie man in den ersten 10 Games steht. Du musst in diesen ersten 10 Games keine Promos spielen und kannst keine Punkte verlieren. Zudem bekommst du mehr als gewöhnlich.\n\n\nAußerdem frage ich mich was du dir aus den Rank machst, wenn du doch anscheinend sowieso nie Ranked spielst? Also 20-25 ist ja nichts","replies":[]},{"poster":"SvenniGod2004","date":"2019-01-26T06:44:40.707+0000","up_votes":1,"down_votes":1,"body":"Es ist ziemlich kompliziert und ja, ziemlicht bescheuert und frustrierend.\nDie kurze Variante ist: Aktzepier wie es ist, deine MMR ist sowieso die gleiche.","replies":[]}]}