{"poster":"Fake Yauso Otp","date":"2016-09-20T21:30:42.790+0000","title":"Perché mi sto divertendo questo periodo?","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Boh non so cosa sia succeso: la fine della season che mi spinge a puntare a gold? La voglia di dimostrare che cribbio si pu&oacute; scalare anche in silver? \r\nNon lo so! Ma sto giocando davvero bene in questo periodo: ho fatto da s5 a s2 in 4 giorni senza perdere games, ora sono un attimo bloccato aim&eacute;... (ho iniziato a giocare a lol a gennaio in modo decente e son partito B5):\r\n\r\nVi svelo un segreto amici nabbi della landa: a meno che il vostro premade non sia un diamond, non rankate con nessnuno!!\r\n\r\nSe si sale si sale perch&eacute; si &egrave; migliori, non si perde perch&eacute; gli altri sono nabbi: \r\nDa quando mi son convinto che faccio cagare e che posso diventare bravo solo imparando a stare safe e giocarmela in modo INTELLIGENTE... beh ecco sono salito:)\r\n\r\nQuindi questo post vuole essere un NO! a tutti coloro che cercano un compagno con cui rankare a s5, perch&eacute; sar&aacute; lui a farti perdere anche se giocher&agrave; bene!\r\n\r\nP.s. io sono salito da SUPPORT ma ora gioco adc, mid e top. Jungla faccio cagare :/\r\n\r\nAnche io ho giocato premade in 2, 3, 4, 5. \r\nLa cosa migliore &egrave; giocartela tu vs 9 :)\r\n9 perch&egrave; a volte anche i tuoi compagni tiltano tanto da desiderare la sconfitta.. \r\nE tu? &gt;:)","replies":[{"poster":"FuryTheFenix ITA","date":"2016-09-22T12:08:38.445+0000","up_votes":1,"down_votes":0,"body":"No dai, io ho fatto quasi tutte le partite di piazzamento + varie partite con un bronzo 3.\nLui adesso sta in promo per l'argento 5 e io sono stato piazzato in argento 4.\nLe botlane del profondo bronzo non sono al sicuro con noi in lane :D !","replies":[]},{"poster":"superkey97","date":"2016-09-21T08:12:24.415+0000","up_votes":1,"down_votes":0,"body":"Anche io volevo arrivare in gold...  E da B3 a S4 è stato abbastanza facil, ma poi la Riot a quanto pare ha deciso di farmi restare in silver pure in questa season, perchè negli ultimi giorni le ho perse tutte per un motivo o l' altro e ora sono sceso a S5 con 0 LP e temo che a perderne un'altra riscenderi in bronzo... Le ho provate di tutte: a giocare supp (è il mio main) o in qualsiasi altro ruolo, da solo, in 2 o in 3, ma il risultato è sempre quello, la discesa al bronze. Io vorrei continuare a rankare, ma ho paura! Cosa dovrei fare? \n:(","replies":[{"poster":"Nice Doggo","date":"2016-09-21T10:38:18.141+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=superkey97,realm=EUW,application-id=MJVj50Jw,discussion-id=KheiaIao,comment-id=0000,timestamp=2016-09-21T08:12:24.415+0000)\n>\n> Anche io volevo arrivare in gold...  E da B3 a S4 è stato abbastanza facil, ma poi la Riot a quanto pare ha deciso di farmi restare in silver pure in questa season, perchè negli ultimi giorni le ho perse tutte per un motivo o l&#x27; altro e ora sono sceso a S5 con 0 LP e temo che a perderne un&#x27;altra riscenderi in bronzo... Le ho provate di tutte: a giocare supp (è il mio main) o in qualsiasi altro ruolo, da solo, in 2 o in 3, ma il risultato è sempre quello, la discesa al bronze. Io vorrei continuare a rankare, ma ho paura! Cosa dovrei fare? \n> :(\n\nSei il mio gemello.\n\nIo mi butterei... alla fine se non ci provi... non saprai mai come andrà a finire","replies":[{"poster":"superkey97","date":"2016-09-21T19:53:23.056+0000","up_votes":1,"down_votes":0,"body":"Già provato, ne ho perse altre 3,un'altra sconfitta e scendo davvero. No dai, non è periodo da ranked, tanto la season finirà presumo a metà novembre come gli altri anni, ormai il gold è per la season 7,vabb.","replies":[]}]}]},{"poster":"Kazushi San","date":"2016-09-21T17:27:00.961+0000","up_votes":1,"down_votes":0,"body":"Voi Maestrini che volete dimostrare robette siete diventati più fastidiosi di chi si lamentava del bronzo, gj","replies":[]}]}