{"poster":"Daikataro","date":"2016-09-07T02:03:52.214+0000","title":"Unbearably high ping","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":0,"body":"Greetings, I hope I can find a solution to my problem here. Roughly 3 months ago, I have been having this intermitent problem that has just recently became permanent. Basically, if I left League client open for a while, next game I would have astronomical ping (sometimes up to 2k) that would only go back to normal if I force-shut the client and start it again.\r\n\r\nNow however, I am completely unable to play the game, as my champion loading screen quickly jumps my ping from the usual 50-75 to 300 to 700 to 999, then I get a couple seconds with 2,8k ping, followed by an \"attempting to reconnect\". Now before I get the usual treatment, I AM TOTAL, ABSOLUTE, POSITIVE, CERTAINLY BEYOND ANY REASONABLE DOUBT sure the problem is NOT on my end:\r\n\r\n-I have shut down literally every single program that could potentially use internet, including browser and anything that updates over the internet\r\n-I have tested connection for ping and latency, ranking between a B+ and A, consistent after several attempts\r\n-When league is constantly dcing, I can open web pages or watch youtube videos no problem, so I'm not losing connection\r\n-I connect via a 2' CAT6 ethernet cable (leftover from a PLC project) at less than 5\" from the modem, which sits over my desk. Yes I have tried resetting the modem too.\r\n-Other MMOs I have tried (WoW, Heartstone, SC2) function well and do not consistently lose connection to the servers\r\n-It is not a hardware issue either, this machine can run game at top settings with over 200fps\r\n\r\nSo I would like to know, what can I do to go back to the fields of justice? I literally cannot play a single game, because it takes 10 seconds for my champion to react to ONE input, and it's not fair to the guys stuck with me either.","replies":[{"poster":"Porocles","date":"2016-09-07T15:09:07.122+0000","up_votes":1,"down_votes":0,"body":"League requires a lot of network power for an always online match, and it's possible your connection is having problems maintaining that conneciton.  This could be due to your hardware, packet loss, or settings.  I suggest following through each step in our [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to help get this fixed up.  You may also download the [hextech repair tool](https://support.riotgames.com/hc/en-us/articles/224826367) to help with setting options like with firewalls.  That should help get this fixed up!","replies":[{"poster":"Daikataro","date":"2016-09-08T03:48:33.808+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Porocles,realm=NA,application-id=osqw6G4M,discussion-id=e7nAeyGQ,comment-id=0001,timestamp=2016-09-07T15:09:07.122+0000)\n>\n> League requires a lot of network power for an always online match, and it&#x27;s possible your connection is having problems maintaining that conneciton.  This could be due to your hardware, packet loss, or settings.  I suggest following through each step in our [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to help get this fixed up.  You may also download the [hextech repair tool](https://support.riotgames.com/hc/en-us/articles/224826367) to help with setting options like with firewalls.  That should help get this fixed up!\n\nSeemingly, the Hextech repair tool did the trick. It evades me why literally every other always-online app was working and League wasn't, but since I can play again, I don't really care about it, could've been a gnome in my processor that Hextech scared away and I couldn't care less. Thanks a bunch!","replies":[]}]},{"poster":"Pandaizm","date":"2016-09-07T07:09:14.637+0000","up_votes":1,"down_votes":0,"body":"Same, but I play on JP server. I usually have a stable ping of 96-102 ms but now it skyrockets to 200+/- stable ms. Riot hasn't been responding to any of this kind of problem and it's frustrating that this happens every month or so (just an estimate). It wasn't permanent, lasted about 4 days or so usually, but this has been going on since 8 days ago for me and I can't play with my normal ping around 96. I did everything and tested my ping, even called technicians from my ISP and the problem still occurs.\n\nI can't even play the game, and it's almost time to go back to university. ugh.","replies":[]}]}