{"poster":"Adniel","date":"2018-08-16T22:59:12.407+0000","title":"¡El aumento de precios fue Demasiado!  ¿Riot Games está acabando? ¿Necesitan este dinero extra?","subforum":"Charlas Generales","up_votes":11,"down_votes":14,"body":"Miren, podemos ser medio tontos para algunas cosas y manquearla feo en League Of Legends, pero creo que a la mayoría nos enseñaron bien las matemáticas en la escuela y/o universidad. **Era entendible que los precios subieran**, el RP lleva sin aumentar mas de un año, teniendo en cuenta que el Dolar pasó de 14$ a 30$. **Pero, el hecho de que no solo aumenten los precios, sino de que den menos RP, nerfearan al esencia naranja y muchos cambios mas solo implica que Riot Va muy pero muy mal.**\r\n\r\nEl cambio de PI a EA fue el primero. Nos regalaron simplemente campeones gratis y para premiar a aquellos jugadores \"fieles\" que llevaban años, les dieron skins/íconos/cromas a cambio de EA. **De esta manera mantenían felices a los antiguos y nuevos.** Lo mismo con los cambios a los **tutoriales y recompensas de nivel 1 al 30** Han premiado con cosas que se consigue **COMPLETAMENTE GRATIS.**\r\n\r\nEn cambio, hace mas de 6 meses se vienen haciendo muchos cambios raros y sin explicación:\r\n**• Ya no dejan re rolear campeones.**\r\n**• La Esencia naranja fue terriblemente nerfeada.**\r\n**• Los aumentos del precio de RP en mas de una ocasión.**\r\n**• Las misiones que te dan iconos y cada tanto una llave o caja.**\r\n\r\n\r\n**RIOT... ¿QUE HA PASADO?** {{sticker:sg-janna}}","replies":[{"poster":"Dutty","date":"2018-08-17T13:50:32.406+0000","up_votes":11,"down_votes":1,"body":"Amigo... Agradece que tenes un servidor solo para LAS, agradece que te dan skin gratis aunque no sean 100 al año y el precio esta bien porque? Cuando se fijaron esos precios el dolar estaba 18, ahors esta 30 o casi 30, además no existía impuesto por IVA en toda compra online, ahora si, Riot no puede regalarnos lo único que utiliza para sustentar el servidor... Simplemente queda aguantar y si no te gusta puedes tranquilamente no comprar y listo.","replies":[]},{"poster":"SlayMeDaddy","date":"2018-08-17T07:11:36.657+0000","up_votes":10,"down_votes":1,"body":"MACRI GATO {{item:3070}}","replies":[{"poster":"DA ShiningLight","date":"2018-08-18T02:20:35.277+0000","up_votes":2,"down_votes":0,"body":"Vine a este post sin sentido solo buscándote a vos amor","replies":[{"poster":"Wikatomi12","date":"2018-08-19T11:49:23.272+0000","up_votes":2,"down_votes":0,"body":"JAJAJAJAJAJ hdp","replies":[]}]}]},{"poster":"Imagine Breaker","date":"2018-08-17T12:49:38.475+0000","up_votes":7,"down_votes":0,"body":"Buenas! Vengo a comentar un tema interesante... Primero es que, el LoL está pasando uno de sus mejores momentos! Ya casi renuevan todos sus campeones desactualizados y están teniendo el mayor índice de jugadores nuevos en años gracias a tooooooda esa publicidad, el problema viene de Tencent (Actual dueño del 94% de Riot) con el cual han discutido varias veces y ya nos le da el mismo capital para que trabajen, y esto pasa hace ya un tiempo desde que Tencent les pidió que porteen el LoL a celulares y Riot se negó, luego Riot discutió con ellos por su visión en los Battle Royale (Donde están invirtiendo todo su dinero) y por estas discusiones las relaciones ha Sido... Tensa xD\nAsí que es normal el aumento de precios, están tratando de traer más dinero para mostrar que si vale la pena invertir en Mobas. (Esta información la saque de un vídeo de Lastpick)\nSaludos!","replies":[]},{"poster":"HealthierShark","date":"2018-08-17T10:04:23.313+0000","up_votes":8,"down_votes":2,"body":"Es como está la economía en Argentina que esperas\nQue la compañía no se vea afectada por nuestra economía?\nRiot no pone los precios si hubieses leído el post que subió del por qué pero quejarse sin saber el por qué es facil\nAdemas quiero decir que no somos ni el único país que pasa por esto  Colombia también se vio con los aumentos en rp\nPero si les parece caro no compren el  rp ya que quejarse no sirve de nada","replies":[{"poster":"tateTeemo","date":"2018-08-17T12:34:17.265+0000","up_votes":2,"down_votes":4,"body":"***","replies":[{"poster":"bombastico","date":"2018-08-17T13:18:22.711+0000","up_votes":3,"down_votes":0,"body":"Fuera del tema de los rp, lo unico que hace es quejarse que riot no nos da suficientes cosas gratis\n\nY eso que tengo 3 skins definitivas sin haber gastado un peso.","replies":[{"poster":"Tec de Personal","date":"2018-08-17T20:50:58.885+0000","up_votes":2,"down_votes":0,"body":"Benditos sean los \"cambiar en aspecto aleatorio permanente\" saque DJ Sonia udyr guardián de espíritus y es pulse fire gracias a ellos y mí billetera no sufrió en ningún momento (?","replies":[{"poster":"gamer86","date":"2018-08-18T21:55:26.975+0000","up_votes":2,"down_votes":0,"body":"Compartí tu suerte, lo mejor que me salio fue fiora veraniega y eso que ni siquiera juego fiora","replies":[]}]}]}]}]},{"poster":"Betaalfa","date":"2018-08-17T12:00:28.189+0000","up_votes":6,"down_votes":1,"body":"Es un juego gratis, te da Miles de horas sin pedirte que pagues nada. La verdad es que de poco te podés quejar, si realmente estás molesto por esta \"tontería\" anda a jugar otro juego que te haga más feliz.","replies":[]},{"poster":"WhiteMax","date":"2018-08-16T23:18:44.726+0000","up_votes":7,"down_votes":2,"body":"Tecnicamente aumentan el precio porque les sobra la plata y no les afecta disminuir ventas al aumentar el precio. Si estuvieran \"necesitados\" ahi reducirian el precio (a no ser que la estrategia sea que los jugadores aprovechen las **ofertas** y de ahi sacar jugadores que compren).\n\n> • Ya no dejan re rolear campeones.\n• La Esencia naranja fue terriblemente nerfeada.\n\nEstos 2 cambios si fueron importantes para ellos ya que les hacia perder mucha ganancia el hecho de que el jugador pudiera comprar todos los campeones baratos con EA y despues los \"caros\" sacarlos con reroll de campeones de 450. Lo mismo con las skins, con el tema de desencantar una legendaria que no te gusta para encantar otras 2 de menor calidad pero que igual te gustan.\n\nExplicacion hay, el tema esta en si quieren o no el explicarlo o se inventan excusa.","replies":[{"poster":"gamer86","date":"2018-08-18T21:58:49.098+0000","up_votes":1,"down_votes":0,"body":"En realidad el precio del rp aumento porque se empezo a cobrar iva, riot recibe la misma cantidad de dinero que antes gracias a que aumentó el precio del rp","replies":[]}]},{"poster":"God Usop","date":"2018-08-17T00:01:09.202+0000","up_votes":3,"down_votes":4,"body":"Habla con tu presidente, el pone impuestos adicionales por transferencias bancarias.","replies":[{"poster":"legalícenla","date":"2018-08-17T00:05:07.033+0000","up_votes":7,"down_votes":3,"body":"> [{quoted}](name=God Usop,realm=LAS,application-id=v7qsfXsE,discussion-id=ZKaRZvVj,comment-id=0002,timestamp=2018-08-17T00:01:09.202+0000)\n>\n> Habla con tu presidente, el pone impuestos adicionales por transferencias bancarias.\n\nni leiste el post, ridiculo","replies":[]},{"poster":"skylex157","date":"2018-08-18T23:20:17.439+0000","up_votes":1,"down_votes":0,"body":"Illo, para debates politicos vete a otro lado, que aqui es sobre videojuegos","replies":[{"poster":"DIOS TUTI","date":"2018-08-21T01:36:38.852+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=skylex157,realm=LAS,application-id=v7qsfXsE,discussion-id=ZKaRZvVj,comment-id=00020001,timestamp=2018-08-18T23:20:17.439+0000)\n>\n> Illo, para debates politicos vete a otro lado, que aqui es sobre videojuegos\n\nque hace un andaluz en LAS? XD","replies":[{"poster":"skylex157","date":"2018-08-23T00:38:37.730+0000","up_votes":1,"down_votes":0,"body":"no soy andaluz pero miro zellendust (en verso y todo papuh)","replies":[]}]}]}]},{"poster":"Neomer ","date":"2018-08-17T17:45:49.410+0000","up_votes":2,"down_votes":1,"body":"Pasó que votaste a Macri un saludo","replies":[{"poster":"skylex157","date":"2018-08-18T23:21:43.206+0000","up_votes":2,"down_votes":0,"body":"1. Vos que sabes\n2. Que tiene que ver con lo que dice el post, el se queja de lo que hace riot, no de la moneda argentina :v","replies":[]}]},{"poster":"Alekséi Románov","date":"2018-08-17T21:32:32.249+0000","up_votes":2,"down_votes":0,"body":"Esto solo afecta a Argentina, porque el dinero se devaluo, y no es sólo el RP, sino cualquier boludez que compres en internet ya sean juegos o cosas de Mercado Libre, van a venir cargados de impuestos. \nLa moneda está en la mierda, eso pasa, no es culpa de Riot","replies":[]},{"poster":"adojosue","date":"2018-08-17T12:24:31.249+0000","up_votes":2,"down_votes":0,"body":"No entiendo de que se quejan, desde un principio el juego ha sido gratuito(menos si reservabas el juego en la beta xD) los únicos ingresos del juego es por las skins y nadie te esta obligando a comprarlas... En fin hace 3 años más o menos, solo quienes invertían dinero en el juego podian darse el lujo de tener una skin...  A día de hoy obtienes skins definitivas permanentes si corres la suerte.. . (lo digo por que hace 3 días me salió en caja la del rubio y me salio permanente) , e investigando ahora las definitivas te las dan permanente... Asi no sean llorones fuera de política disfruten el juego, las skins solo sirven para decir \"si mirenmen tengo dinero\" o \"tengo suerte\"... So, ya dejen de quejarse :v ya estan grandesitos el juego es GRATIS.","replies":[{"poster":"F2T Sköll","date":"2018-08-17T13:36:15.047+0000","up_votes":1,"down_votes":0,"body":"Te las dan permanente?, fa, no sabia, a mi me salio la de ezreal al segundo cofre que abri y la rompi nomas","replies":[{"poster":"Tec de Personal","date":"2018-08-17T20:55:06.518+0000","up_votes":1,"down_votes":0,"body":"Yo saque 3 de rerolls hace tiempo ya y aún las tengo, estaba la opción de activarlas x7dias si no tenías la esencia para desbloquearla pero te quedaban ahí si querías juntar las esencias naranjas","replies":[]}]}]},{"poster":"TheGhostLuc","date":"2018-08-17T22:21:44.538+0000","up_votes":3,"down_votes":1,"body":"Son concientes que esto aumento por el dolar y no por macri no?","replies":[]},{"poster":"Raiot","date":"2018-08-17T00:56:42.960+0000","up_votes":3,"down_votes":1,"body":"En colombia pasa lo mismo","replies":[]},{"poster":"SiFedeanTroleo","date":"2018-08-17T00:34:03.762+0000","up_votes":3,"down_votes":1,"body":"Paso macri","replies":[]},{"poster":"maxi666","date":"2018-08-17T10:02:09.812+0000","up_votes":4,"down_votes":2,"body":"Primero, si no entiendo mal sos de Argentina igual que yo, por lo tanto me parece que deberías de saber que a muchos \"servicios\" como Netflix, por decirte un ejemplo muy fácil, o las compras en Steam. Ahora cuentan con el IVA. Por lo tanto de forma inevitable los precios subirán en función de lo descontrolado que esté el mercado cambiario. \nSi dan menos cosas y todo lo que dijiste en respecto a la cantidad de RP y encendía naranja es correcto. Pero te basas en el precio de RP para dar un argumento que no es valió ya que el valor de los paquetes de RP varía por región y por país. Ya que la tienda dentro del juego es un \"servicio\" diferente e independiente del juego en lo que a servidor se refiere.","replies":[{"poster":"Hayato","date":"2018-08-23T17:59:53.294+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=maxi666,realm=LAS,application-id=v7qsfXsE,discussion-id=ZKaRZvVj,comment-id=0007,timestamp=2018-08-17T10:02:09.812+0000)\n>\n> Primero, si no entiendo mal sos de Argentina igual que yo, por lo tanto me parece que deberías de saber que a muchos \"servicios\" como Netflix, por decirte un ejemplo muy fácil, o las compras en Steam. Ahora cuentan con el IVA. Por lo tanto de forma inevitable los precios subirán en función de lo descontrolado que esté el mercado cambiario. \n> Si dan menos cosas y todo lo que dijiste en respecto a la cantidad de RP y encendía naranja es correcto. Pero te basas en el precio de RP para dar un argumento que no es valió ya que el valor de los paquetes de RP varía por región y por país. Ya que la tienda dentro del juego es un \"servicio\" diferente e independiente del juego en lo que a servidor se refiere.\n\nHola, no, no es tanto por el aumento del dolar oe e IVA en sí (tiene que ver pero eso podía mitigarse), lo que ocurre es que quieren equiparar todos los precios de los países en la región, entonces para evitar que los chilenos, peruanos u otros compren RP en la tienda Argentina (podes cambiar de país de la tienda al elegir comprar RP), y les salga muy barato, decidieron aumentar el valor para que cueste mas o menos igual que los demás paises.\n\nComo se puede evitar o hacer más razonable este aumento sin perjudicar a los jugadores argentinos y a la empresa? \n\nDe la misma forma que hacen Blizzard y Steam\n\nBlizzard y Steam tienen tiendas regionales para sus juegos como Riot Games para la compra de RP. Pero tanto Blizzard como Steam (Valve)  no permiten que un chileno compre un juego desde la tienda argentina o viceversa, tampoco permite que un chileno regale un juego a un argentino aun comprándolo en su tienda correspondiente (o viceversa de un argentino a un chileno), por que ocurre esto? Porque los precios de los juegos en cada país son distintos y no quieren haya abuso, por ejemplo le left 4 dead 2 en oferta, a un argentino, le cuesta 22 pesos, yo le quise regalar dicho juego a una amiga de Chile y cuando voy a efectuar la compra me indican que no es posible porque el destinatario no corresponde a mi país de origen. Lo mismo ocurre si un chileno/uruguayo/etc. quiere hacer regalo a otra persona de otro país. \n\nCon Blizzard sucede algo similar, no permite directamente que un latinoamericano haga regalos (quise regalarle Legacy of the Void a una amiga de México y no se me permitía)\n\nEn síntesis, si Riot bloquease las tiendas de RPs por país como Blizz y Valve, no tendría necesidad de equiparar precios entre países para evitar abusos. Por esto Blizzard y Steam tienen precios acordes a cada país.\n\nPor ejemplo yo hoy me compré varios DLCs de Dying Light por 17 pesos arg cada uno, menos de 1 dolar por DLC.","replies":[]}]},{"poster":"Akeiji","date":"2018-08-17T00:25:44.628+0000","up_votes":4,"down_votes":3,"body":"las demás regiones no cambia sus precios, solo Argentina, por la devaluación de su moneda y el impuesto a las compras on-line.\n\nEditado:\nlo de la EA por PI, ya fue se discutió en su momento, no tiene caso seguir con ello.","replies":[]},{"poster":"RocioChan245","date":"2019-04-04T02:03:03.458+0000","up_votes":1,"down_votes":1,"body":"Que bueno que no estas en Argentina JAJAJA{{sticker:sg-ahri-2}}","replies":[{"poster":"SolExmosito","date":"2019-05-02T02:05:20.822+0000","up_votes":1,"down_votes":0,"body":"Comentario flashero xd {{summoner:4}} , no se le puede hacer nada y se que es raro que conteste 28 días después pero es verdad Argentinas es un desastre !\"#$%&amp;/()=?¡ solo económica y políticamente y que Ríot no es culpable de las acciones financieras del país, solo es un eslavon del Miau, Ratas alavando a un gato, Espera no tiene sentido, lo siento hablo mucho. Mira esto, es el secreto para ganar con garen lo dejare solo con iconos {{champion:86}} {{summoner:13}} {{item:3070}} {{sticker:garen-swing}} EQUISDE. mucho drama perdon por salir de la atmosfera xd, Suerte gente ya todo cambiara para el proximo año se los aseguro, promesa garantizada por Joel Joestar :0000 revele mi nick lo siento no lo hice aproposito, mi segunda intencion para escribir este comentario es que Riot me devuelva la cuenta que me baneo por culpa de un yi al leer este comentario :´(, Cierto que dije chau al drama, Lo siento, Ahora si suerte quien seas {{champion:45}}","replies":[]}]},{"poster":"Technø","date":"2018-11-04T18:59:11.365+0000","up_votes":1,"down_votes":0,"body":"Hola vengo a revivir el posrt! ningun rioter habla","replies":[]},{"poster":"zoenheinze96","date":"2018-08-21T00:57:37.919+0000","up_votes":1,"down_votes":0,"body":"Totalmente de acuerdo, son unos abusivos. Ryot es un desarrollador multinacional con un ingreso de unos US$1.6 mil millones al año, que no solamente obtiene del LOL, para solo 1000 empleados. Además de ser un monopolio, podrían tener un poco de empatía con conocimiento de la situación socio-económica de Sudamérica.  Es un tema de tener un poquito de visión comercial, no estoy diciendo esto para eximir de responsabilidad gubernamental y administrativa a nuestros pésimos gobiernos que devaluaron la moneda en relación a la tasa de cambio (divisa) al punto de hacerla valer tan poco, que los ingresos no sean exponenciales para los proveedores; pero teniendo cierto privilegio en el mercado videojugabilístico, hay ciertas medidas que se podrían solventar, para que tengan menor impacto negativo en el bolsillo de los jugadores de LAS.\nUn ejemplo sencillo que se ha dado no hace mucho tiempo, es World of Warships y World Of Tanks. Juegos que no están ni cerca del top 10 de los juegos tipo MMORPG, más jugados en el mundo, y que aún así tiene su público. Son de origen Ruso, y a sabiendas de los problemas montearios en la región sudamericana, los cabecillas redujeron los precios y colocaron ofertas de muchísimos barcos y tanques para que sea más redituable en los jugadores sudamericanos, lo cuál siguió generando ganancias positivas.\nA lo que voy es que, entiendo el aumento, y la devaluación monetaria en ARG, pero podrían ser más suaves y comprender la situación, ya que mantener los precios en LAS, no perjudicaría casi en nada sus ganancias, pero así son los empresarios, donde puedan obtener un beneficio, para disfrazar con el marketing de \"el juego es gratis\" y así justificarse, lo van a hacer. Nada más. {{champion:86}}","replies":[]},{"poster":"Palmit0","date":"2018-08-18T23:32:45.532+0000","up_votes":1,"down_votes":1,"body":"Esto pasa al votar a macri, esta devaluando la moneda y el rp va a estar mas y mas caro, yo no voy a comprar mas pero por favor no sean estupidos y voten a macri denuevo xD","replies":[{"poster":"Akari Kuro","date":"2018-08-19T19:45:45.205+0000","up_votes":1,"down_votes":0,"body":"Obvio lo votaria de nuevo","replies":[]}]},{"poster":"skylex157","date":"2018-08-18T23:16:27.889+0000","up_votes":1,"down_votes":0,"body":"No te dejan rerollear para que un botin de 3 campeones de 300 (900 de esencia en total) no se transforme en uno de 6300, sabes, paara que tener un sistema que premia la cantidad de campeones que te tocan en una caja en vez de la calidad?\n\nEsencia naranja nerfeada, pues te jodes, ve tu a decirle que te regalen skins :v\n\nQue las misiones dan iconos, pues tambien, las misiones cuando fueron pruebas, ver si un sistema de misiones le pegaba al lol o no\n\nLa gente deja de jugar porque el meta es una mierda (aunque ahora ya lo estan arreglando)","replies":[]},{"poster":"Chubi","date":"2018-08-18T05:10:01.687+0000","up_votes":1,"down_votes":0,"body":"Vieja te contestaste solo: de 18 a 30 en un año el dólar + 21% de impuesto por parte del gobierno argentino... Si haces los números de hecho riot te lo está cobrando más barato que antes.. solo que tú moneda se fue al tacho","replies":[]},{"poster":"Olcadan","date":"2018-08-17T22:53:55.130+0000","up_votes":1,"down_votes":0,"body":"Entiendo tu comentario y entiendo lo de la economía, ví un vídeo en donde se hablaba que presionaban a riot para hacer un battle Royale y los directivos niegan rotundamente querer poner este modo en la que la empresa que invirtió en riot (dueña de Blizzard, de epic ganes, de supracell y otras desarrolladoras de juegos del momento),  habría dicho también que invertiria en riot de la que es un porcentaje solamente si riot sacaba un juego para dispositivos móviles, desde la empresa los directivos dicen que la experiencia moba debe jugarse en pc, aparentemente se rumorea que riot perdió este apoyo y que no se está invirtiendo lo que antes si se invertia.\nDespués en mi caso hay cambios que me parecen buenos y otros no. La esencia azul es buena pero no me gusta que no se pueda re-rrolear campeones, no me gusta que para tener una maestría 6 o 7 tenes que invertir cantidad de EA y tampoco me gusta el hecho de que no haya ningún modo de juego rotativo con la cantidad que hicieron, si bien lo hacen para eventos antes era cada fin de semana, no me gusta que no se sancione gente por flammer en elos bajos, que no se sancione gente afk en ranked, si bien esto afecta la experiencia en lo que respecta a lo macro lo del Rp yo cargo en efectivo y por 300 pesos argentinos me llevo una cantidad considerable, yo compro skins en ofertas o paquetes y eso me ayuda, después debido a que Argentina se cobra el impuesto digital con IVA de 21% desde hace ya un mes, de todas maneras el cambio se centra en la temporada que viene con respecto a los eSports de la región y también en el servidor con la implementación del nuevo sistema de clasificatorias.","replies":[]},{"poster":"suljin","date":"2018-08-17T20:00:35.434+0000","up_votes":1,"down_votes":0,"body":"Tengo una consulta: al comprar RP en Argentina dice que al precio reflejado, ej: 480 RP a $90), le falta agregar el IVA, eso quiere decir que me saldría $90+21%(90+18,90=108,90)? O ese IVA ya está incluido en los $90?","replies":[]},{"poster":"BlueGamer22","date":"2018-08-17T19:30:09.149+0000","up_votes":1,"down_votes":0,"body":"porque hablas de dolares sin el LAS argentina tenes que pagar en ARS o yo no entiendo","replies":[]},{"poster":"Jhäö","date":"2018-08-17T16:59:53.518+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Adniel,realm=LAS,application-id=v7qsfXsE,discussion-id=ZKaRZvVj,comment-id=,timestamp=2018-08-16T22:59:12.407+0000)\n>\n> Miren, podemos ser medio tontos para algunas cosas y manquearla feo en League Of Legends, pero creo que a la mayor&amp;iacute;a nos ense&amp;ntilde;aron bien las matem&amp;aacute;ticas en la escuela y/o universidad. **Era entendible que los precios subieran**, el RP lleva sin aumentar mas de un a&amp;ntilde;o, teniendo en cuenta que el Dolar pas&amp;oacute; de 14$ a 30$. **Pero, el hecho de que no solo aumenten los precios, sino de que den menos RP, nerfearan al esencia naranja y muchos cambios mas solo implica que Riot Va muy pero muy mal.**\n> \n> El cambio de PI a EA fue el primero. Nos regalaron simplemente campeones gratis y para premiar a aquellos jugadores &amp;quot;fieles&amp;quot; que llevaban a&amp;ntilde;os, les dieron skins/&amp;iacute;conos/cromas a cambio de EA. **De esta manera manten&amp;iacute;an felices a los antiguos y nuevos.** Lo mismo con los cambios a los **tutoriales y recompensas de nivel 1 al 30** Han premiado con cosas que se consigue **COMPLETAMENTE GRATIS.**\n> \n> En cambio, hace mas de 6 meses se vienen haciendo muchos cambios raros y sin explicaci&amp;oacute;n:\n> **&amp;bull; Ya no dejan re rolear campeones.**\n> **&amp;bull; La Esencia naranja fue terriblemente nerfeada.**\n> **&amp;bull; Los aumentos del precio de RP en mas de una ocasi&amp;oacute;n.**\n> **&amp;bull; Las misiones que te dan iconos y cada tanto una llave o caja.**\n> \n> \n> **RIOT... &amp;iquest;QUE HA PASADO?** {{sticker:sg-janna}}\n\nAmiguito los rp salen lo mismo, el precioesta en dolares y los pesos se devaluanron muchisimo. \nPensa que si sacas s conseguis cajas y si te portas bien sacas llaves... Y es gratis...\nNo armes\n{{champion:432}}","replies":[]},{"poster":"kiorpz","date":"2018-08-17T16:16:59.869+0000","up_votes":1,"down_votes":0,"body":"Y la verdad q es un tema. Tan importante q no me deja dormir. Ayer me quede despierto toda la noche.","replies":[]},{"poster":"CAPI 98","date":"2018-08-17T15:42:48.949+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Adniel,realm=LAS,application-id=v7qsfXsE,discussion-id=ZKaRZvVj,comment-id=,timestamp=2018-08-16T22:59:12.407+0000)\n>\n> Miren, podemos ser medio tontos para algunas cosas y manquearla feo en League Of Legends, pero creo que a la mayor&amp;iacute;a nos ense&amp;ntilde;aron bien las matem&amp;aacute;ticas en la escuela y/o universidad. **Era entendible que los precios subieran**, el RP lleva sin aumentar mas de un a&amp;ntilde;o, teniendo en cuenta que el Dolar pas&amp;oacute; de 14$ a 30$. **Pero, el hecho de que no solo aumenten los precios, sino de que den menos RP, nerfearan al esencia naranja y muchos cambios mas solo implica que Riot Va muy pero muy mal.**\n> \n> El cambio de PI a EA fue el primero. Nos regalaron simplemente campeones gratis y para premiar a aquellos jugadores &amp;quot;fieles&amp;quot; que llevaban a&amp;ntilde;os, les dieron skins/&amp;iacute;conos/cromas a cambio de EA. **De esta manera manten&amp;iacute;an felices a los antiguos y nuevos.** Lo mismo con los cambios a los **tutoriales y recompensas de nivel 1 al 30** Han premiado con cosas que se consigue **COMPLETAMENTE GRATIS.**\n> \n> En cambio, hace mas de 6 meses se vienen haciendo muchos cambios raros y sin explicaci&amp;oacute;n:\n> **&amp;bull; Ya no dejan re rolear campeones.**\n> **&amp;bull; La Esencia naranja fue terriblemente nerfeada.**\n> **&amp;bull; Los aumentos del precio de RP en mas de una ocasi&amp;oacute;n.**\n> **&amp;bull; Las misiones que te dan iconos y cada tanto una llave o caja.**\n> \n> \n> **RIOT... &amp;iquest;QUE HA PASADO?** {{sticker:sg-janna}}\n \nCuánto aumento, digo con 100 pesos cuánto rp puedo comprar ? Quiero la nueva skin de {{champion:236}}","replies":[]},{"poster":"F2T Sköll","date":"2018-08-17T13:31:17.146+0000","up_votes":1,"down_votes":0,"body":"Creo que se separaron de la empresa china que los mantenia, pero la verdad no me parece que este mal lo que hacen, aunque cuesten sacar las skins al menos te las regalan, y las ofertas si las quieres aprovechar son muy buenas tambien, no hay de que quejarse","replies":[]},{"poster":"bombastico","date":"2018-08-17T13:15:14.142+0000","up_votes":1,"down_votes":0,"body":"Riot no va mal, es la moneda argentina que se devaluó, si hubieran dejado los paquetes con la misma cantidad de rp hubiesen tenido que cobrar cantidades que la gente no hubiese podido pagar eso sin contar el impuesto que siempre lo termina pagando el consumidor.","replies":[]},{"poster":"BeatYoi","date":"2018-08-18T02:35:11.832+0000","up_votes":1,"down_votes":2,"body":"Además de que nuestra moneda está callendo en picada, que ya lo explicaron muchos aquí.\nSinceramente, creo que deberías meter la mano  tu bolsillo y por lo menos comprar todo el pack que te toca en Tu Tienda (en la que hacen descuento a skins de campeones que usaste con más frecuencia), al menos una vez.\nComo para compensar los mantenimientos que le hacen al juego con actualizaciones a los servidores, campeones, clientes, etc.\nPiensa en todos los cambios que le hicieron al mismo, hasta llegar a lo que es ahora.\nPiensa en la cantidad de gente que trabaja en esto.\nY por sobre todas estas cosas, piensa que a pesar de todo, el juego sigue siendo gratis.\n\nSi no tienes dinero? Busca la manera de generarlo, si eres niño/adolescente? Hay muchas maneras de ayudar en casa. Si eres adulto? Has trabajo de medio tiempo, algún hobbie que te de algo de plata.\nY si no quieres gastar tu dinero físico? Has como yo, responde encuestas en internet. ( {{champion:29}} )\nAsí destinas ese dinero para estas cuestiones.\n\nY si no quieres hacer nada de esto?\nNo te quejes ni te enojes, te haces mal a ti mismo innecesariamente, simplemente juega y diviértete.\n\nY como dijeron por ahí? No armes {{champion:432}} .\nSaludos.\n{{summoner:6}}","replies":[]}]}