{"poster":"Adniel","date":"2018-02-03T01:57:43.419+0000","title":"No jueguen clasificadoras de 19:00 a 24:00 horario argentino.","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":10,"body":"La verdad estoy super tilteado y frustrado y no quiero que a nadie que le interese ganar le pase lo mismo que a mi. Hoy jugu&eacute; mis primeras 10 en todo el d&iacute;a, vengo jugando desde las 5:35 AM hasta ahora las 23:00 PM, todo el d&iacute;a, no seguido, pero cada 1 o 2 horas jugaba una partida.\r\nTodo ven&iacute;a perfecto hab&iacute;a ganado 6 y perdido 2, las ultimas 3 partidas que fueron en el horario marcado **19:00 a 23:00 PM** me tocaron esta clases de personas:\r\n1)Jugadores muy flamers que se quedan parados mientras escriben. Haces muy buenas jugadas pero estos siguen flameandote, son de aquellos de que mueren una ves y aunque vayan 9/1 te ponen &quot;ggwp no jg&quot;.\r\n2)Jugadores 0 experimentados, que no saben nada del macrogame, fuerzan objetivos 2vs5 o 3vs5 y te llevan a derrotas aseguradas. Me ha pasado tener heraldo y marcar con se&ntilde;ales, escribir en el chat hasta escrib&iacute; &quot;tengo heraldo hay qeu tirarlo antes de que se acabe, pueden venir a mid loco&quot; y no ven&iacute;an, terminamos perdiendo la partida...\r\n3)Jugadores trols. En especial esos que no trolean con kill porque es muy b&aacute;sico para ellos, sino que te roban toda la jungla, todos los campamentos, te dejan super atr&aacute;s en oro y experiencia y luego no sirves.\r\n4)Gente cansada, llega de estudiar/trabajar y solo rompe un poco las pelotas a los que queremos subir r&aacute;pido las cuentas.\r\n\r\n\r\nNada, espero que nadie se lo tome a mal, simplemente no quiero que a nadie le pase esto que me pas&oacute; a mi, porque es muy feo y encima fue 3 partidas seguidas, se ve que a esta hora varias personas se deciden por trolear o jugar mal de forma intencional.","replies":[{"poster":"StąrDust","date":"2018-02-03T02:19:58.379+0000","up_votes":2,"down_votes":0,"body":"Lo mejor para rankear seguro es buscar el horario donde haya menos trolls y niños ratas, yo por ejemplo rankeaba de lunes a jueves ( a veces me arriesgaba los viernes) en la madrugada pero en el período escolar, y no ahora q están todos los niños de vacaciones (por lo menos en Argentina). Y los flammers están siempre, es cosa de mutear al primer insulto.","replies":[]},{"poster":"Mioen","date":"2018-02-03T02:16:04.727+0000","up_votes":3,"down_votes":1,"body":"Por lo general las horas nocturnas son las peores para jugar, muchos \"chicos\" grandes, usuarios que desquitan su furia del trabajo, flammers que creen que están en el mejor horario, y el típico dormido que juega pero que está cerrando las pestañas.\n\nPara mi, los mejores horarios son de 6 AM a 11AM, usuarios que están más atentos, no son tan tóxicos, son más tolerantes, no hay \"chicos\" grandes.","replies":[]},{"poster":"Jaden101","date":"2018-02-03T02:00:47.194+0000","up_votes":3,"down_votes":2,"body":"Suelo dar negativo a estas cosas pero le di positivo solo porque tienes razón. Este post te lo van a llenar de negativos los mismos flamers o jugadores que están en diamante y no te entienden, pero es verdad, me ha pasado en varias cuentas, a esta hora es muy difícil jugar y es bueno saberlo para los jugadores nuevos.","replies":[{"poster":"Adniel","date":"2018-02-03T02:02:39.947+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Jaden101,realm=LAS,application-id=PJAKt7ph,discussion-id=B1QvbIfL,comment-id=0000,timestamp=2018-02-03T02:00:47.194+0000)\n>\n> Suelo dar negativo a estas cosas pero le di positivo solo porque tienes razón. Este post te lo van a llenar de negativos los mismos flamers o jugadores que están en diamante y no te entienden, pero es verdad, me ha pasado en varias cuentas, a esta hora es muy difícil jugar y es bueno saberlo para los jugadores nuevos.\n\nPuede que tengas razón, pero no por negativos mi nivel en el lol bajará, mi elo bajará o cosas así, es algo simbólico nomas, luego los que ponen negativo son los que se enojan porque les tocó un tipo que les robaba toda la jungla cuando morían... pero bueno xd, al menos alguien me entiende","replies":[]}]},{"poster":"I Love KaiSa","date":"2018-02-03T02:26:41.078+0000","up_votes":1,"down_votes":0,"body":"Entonces porque vos tuviste malos emparejamientos todos los demás también?","replies":[{"poster":"Adniel","date":"2018-02-03T13:24:31.773+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=I Love Janna,realm=LAS,application-id=PJAKt7ph,discussion-id=B1QvbIfL,comment-id=0003,timestamp=2018-02-03T02:26:41.078+0000)\n>\n> Entonces porque vos tuviste malos emparejamientos todos los demás también?\n\nVeo que muchas personas coincidieron... puede ser como dicen todos que a esa hora hay mas chicos pequeños, gente cansada del trabajo/estudio y gente que quiere dormir.","replies":[]}]},{"poster":"Fuuck My Lag","date":"2018-02-03T07:23:08.472+0000","up_votes":1,"down_votes":0,"body":"Me pasó lo mismo, venia en racha de victorias, empeze jugando a la 1pm y llegué a 87pl y tipo 6:30 por ahí me empezaron a emparejar con ese tipo de gente y terminé en 7pl","replies":[]}]}