{"poster":"Adniel","date":"2018-03-14T15:39:14.017+0000","title":"El soporte no quiere trabajar \"Pasaré tu caso al especialista\"","subforum":"Problemas Técnicos","up_votes":7,"down_votes":10,"body":"La verdad quiero que hagan algo con los Rioters que no quieren trabajar. **Si pasale el caso a un especialista, que se tarda 7 d&iacute;as en contestar, para eso mi sanci&oacute;n de chat ya pas&oacute; y me la tuve que fumar igualmente.** Si no queres laburar, tomatelas, vengo a disfrutar el juego no a que me lo cagues mas de lo que est&aacute;.\r\n\r\n**PD: Un tamh kench me trole&oacute; toda la partida, mir&eacute; su historial y ya se jug&oacute; dos partidas mas como si nada. Yo por enojarme porque me com&iacute;a y me tiraba a los enemigos, porque tiraba W FLASH y yo me mor&iacute;a por su culpa, porque me robaba la jungla, etc etc etc fui baneado.** \r\n\r\n&iquest;Cuando ser&aacute; el d&iacute;a que Sancionen a los trols? Porque no tengo que PORQUE AGUANTAR que un trol me coma y me tire a los enemigos EN RANKED y que terminemos la partida al minuto 15 y todos nivel 6-7 porque el tamh kench trole&oacute; por todos lados...","replies":[{"poster":"Excalibeer","date":"2018-03-14T16:25:23.508+0000","up_votes":21,"down_votes":0,"body":"Adniel como te comenté en el ticket, el problema fue:\n\n- No hay evidencia que tahm kench troleó, de hecho los demás del team, que no era premade, lo defendieron.  \n- Sí amenazó con hacerlo en pre game chat, y eso es antideportivo, estudiaremos el historial a ver si es un solo caso o es reincidente\n- Tu amenazaste y te fuiste AFK y flameaste a varios del equipo, no solo a Tahm  \n- Esto es parte de un historial reiterado en ti\n- Además en un chat insultaste a al menos dos personas de soporte, pero no fue el típico chat frustrado con riot, fueron insultos directos.  Eso no lo dejaré pasar\n\nTe suspendimos el acceso al chat de soporte permanentemente después de revisar bien la partida y determinar que troleaste tú mismo aumenté la sanción a dos semanas.  \n\nEs perfectamente aceptable que no estés de acuerdo o estés frustrado, pero quiero dejar la línea de lo inaceptable bastante clara en tu caso.\n\n-Excalibeer","replies":[{"poster":"Rohaerlyn","date":"2018-03-14T16:27:11.260+0000","up_votes":9,"down_votes":1,"body":"Toma excalibeer, te lo olvidaste en la mesa wp.\nhttps://lafrikileria.com/4000-thickbox_default/replica-martillo-thor-mjolnir.jpg","replies":[]},{"poster":"Rick Silence","date":"2018-03-14T16:40:31.767+0000","up_votes":2,"down_votes":0,"body":"Excalibeer, la leyenda de los foros :3\nWow!","replies":[]},{"poster":"SKT T1 Bank","date":"2018-03-14T16:38:33.082+0000","up_votes":2,"down_votes":0,"body":"Y yo que lo queria ayudar, lastima termino siendo el troll el. Cosas que pasan.\n\nWp","replies":[]},{"poster":"Adniel","date":"2018-03-14T16:50:30.573+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Riot Excalibeer,realm=LAS,application-id=X54mVVp0,discussion-id=R3m7HEAa,comment-id=0004,timestamp=2018-03-14T16:25:23.508+0000)\n>\n> Adniel como te comenté en el ticket, el problema fue:\n> \n> - No hay evidencia que tahm kench troleó, de hecho los demás del team, que no era premade, lo defendieron.  \n> - Sí amenazó con hacerlo en pre game chat, y eso es antideportivo, estudiaremos el historial a ver si es un solo caso o es reincidente\n> - Tu amenazaste y te fuiste AFK y flameaste a varios del equipo, no solo a Tahm  \n> - Esto es parte de un historial reiterado en ti\n> - Además en un chat insultaste a al menos dos personas de soporte, pero no fue el típico chat frustrado con riot, fueron insultos directos.  Eso no lo dejaré pasar\n> \n> Te suspendimos el acceso al chat de soporte permanentemente después de revisar bien la partida y determinar que troleaste tú mismo aumenté la sanción a dos semanas.  \n> \n> Es perfectamente aceptable que no estés de acuerdo o estés frustrado, pero quiero dejar la línea de lo inaceptable bastante clara en tu caso.\n> \n> -Excalibeer\n\n¿No hay pruebas? op.gg la partida grabada. Me aumentaste la sanción diciendo que yo trolié? Como voy a trolear si tengo la partida grabada, tomo totalmente injusta tu decisión.\nEn cuanto a lo del soporte. **llevo mas de un mes con problemas en la cuenta y aun no se han solucionado, estoy muy cansado de esta situación y así no sea justificable mi actitud, tampoco es muy rara, que cada ves que tengo un problema se demoren días y días en resolverlo o siempre tenga la misma respuesta de su parte.**","replies":[{"poster":"Rick Silence","date":"2018-03-14T16:55:36.585+0000","up_votes":1,"down_votes":0,"body":"Y lo del flameo a otros del team e irte afk? Y lo del historial reiterado de esa actitud? -.-","replies":[{"poster":"Adniel","date":"2018-03-14T16:59:43.919+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Viuda Negra 13,realm=LAS,application-id=X54mVVp0,discussion-id=R3m7HEAa,comment-id=000400030000,timestamp=2018-03-14T16:55:36.585+0000)\n>\n> Y lo del flameo a otros del team e irte afk? Y lo del historial reiterado de esa actitud? -.-\n\nNo me he ido afk jamás en una sola partida de esta cuenta. Y si lo hice fue hace meses por un corte de luz. En cuanto a lo de flamear, la verdad no coincidio, tengo los chats y si tengo actitud quizás **de mas...** pero jamás un insulto. Jamás.","replies":[{"poster":"Not Personal","date":"2018-03-14T17:15:27.761+0000","up_votes":2,"down_votes":0,"body":"Entonces, segun tu logica, un rioter esta inventando todo, pudiendo ver absolutamente todos tus registros y los de tus compañeros, solo por que tenia ganas de hacerte pasar un mal rato, a vos, que no te conoce ni tiene nada malo en contra tuya (ademas de, como ya se dijo, insultos directos al staf de Riot)","replies":[{"poster":"Adniel","date":"2018-03-14T17:17:54.793+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nacchitto,realm=LAS,application-id=X54mVVp0,discussion-id=R3m7HEAa,comment-id=00040003000000000000,timestamp=2018-03-14T17:15:27.761+0000)\n>\n> Entonces, segun tu logica, un rioter esta inventando todo, pudiendo ver absolutamente todos tus registros y los de tus compañeros, solo por que tenia ganas de hacerte pasar un mal rato, a vos, que no te conoce ni tiene nada malo en contra tuya (ademas de, como ya se dijo, insultos directos al staf de Riot)\n\nTengo la partida GRABADA. Ellos no la vieron, solo miraron estadísticas. **Y ya te digo, si flamié (cosa que no se porque no me dejan ver el chat)** https://ibb.co/gGsWjc para que veas <--   Si flamié como decía, el baneo es de 25 partidas, no debieron aumentarlo de la nada a 2 semanas.","replies":[{"poster":"Not Personal","date":"2018-03-14T17:32:51.239+0000","up_votes":1,"down_votes":0,"body":"No es que dude de vos, pero no dudo de ellos. Mas de una vez se ha pedido disculpas y levantado sanciones de 2 semanas y hasta permanentes de corresponder. Ademas te habla de que se repite en muchas ocaciones, y no solo en una vez. Y vamos, el aumento es por el insulto al staff, no hay de otra.","replies":[]}]}]}]}]}]},{"poster":"Pliosaurio","date":"2018-03-14T17:17:06.032+0000","up_votes":1,"down_votes":0,"body":"Que buena respuesta, ordenada y detallada. Sigan así, Sres. Rioters. \"De una lado La Luz (Jugadores Honorables y deportivos)\",\"Del otro, La Oscuridad (Jugadores de mal comportamiento y antideportivos).\".","replies":[]},{"poster":"Salvor","date":"2018-03-14T17:09:54.893+0000","up_votes":1,"down_votes":0,"body":"Te pasaste Excali, sos un héroe.\n\nhttps://img-comment-fun.9cache.com/media/aqZgdAp/alzqwVXr_700w_0.jpg\nhttps://i.gyazo.com/bd2284e748e54b7433518569bc23e6af.png","replies":[]}]},{"poster":"Salvor","date":"2018-03-14T17:03:34.138+0000","up_votes":2,"down_votes":0,"body":"https://i.gyazo.com/920177c400671f48a0410e471b38ffdb.png","replies":[{"poster":"Corchito","date":"2018-03-14T17:22:38.206+0000","up_votes":2,"down_votes":1,"body":"Qué te había dicho sobre esta persona? xD","replies":[{"poster":"Salvor","date":"2018-03-14T17:33:22.126+0000","up_votes":1,"down_votes":0,"body":"Jamas dudaría de ti.\nPero tenia que verlo en persona.\n\nTheDiamonds2016 es su smurf, podes comprobarlo fácilmente.","replies":[]}]}]},{"poster":"Falkon","date":"2018-03-14T16:00:09.760+0000","up_votes":2,"down_votes":0,"body":"Pues Wyna y KhainMazix soy buenas personas, es mas, fueron las que mejor atencion al jugador me han dado, asi que :l no se.","replies":[]},{"poster":"Excorpion","date":"2018-03-14T16:17:33.988+0000","up_votes":1,"down_votes":0,"body":"Los soportes tienen areas.\nAlgunos atienden casos específicos debido al tiempo e investigación que haya que hacer.\nSi hay errores que de solucionan en 5 min por chat y tu caso se demora 30 min, el tipo que atiende los casos rapidos pasará el caso a alguien del área, para el seguir atendiendo otros casos.","replies":[{"poster":"Adniel","date":"2018-03-14T17:05:09.493+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Excorpion,realm=LAS,application-id=X54mVVp0,discussion-id=R3m7HEAa,comment-id=0002,timestamp=2018-03-14T16:17:33.988+0000)\n>\n> Los soportes tienen areas.\n> Algunos atienden casos específicos debido al tiempo e investigación que haya que hacer.\n> Si hay errores que de solucionan en 5 min por chat y tu caso se demora 30 min, el tipo que atiende los casos rapidos pasará el caso a alguien del área, para el seguir atendiendo otros casos.\n\nEn el día de hoy un tamh kench me troleó y no por sacrificio intencional, me comía y me tiraba a enemigos, estuvo afk, jamás fue a top (Una prueba de esto es que no tiene subditos farmeados, solo minions de la jungla, cuando el jungla era yo y es nivel 6). Y muchas cosas mas... Supuestamente yo enojado por la situación flamié en la partida y me sancionaron el chat por 25 partidas.\n\nCansado de estas situaciones porque ayer vine al soporte por un afk y un trol, hoy de nuevo por un trol y encima EL BANEO FUE PARA MI, pido disculpas quizás por mi conducta con el soporte, si bien hay cosas que mantengo, creo que podría haberlas dicho de otra manera que no faltaran al respeto. \nSIN EMBARGO, la respuesta de ustedes fue \"Hay pruebas de que TU TROLEASTE, no TAMHKENCH, así que el baneo de 25 partidas aumentará a 2 semanas\".\n\n¿Como vas a decir que yo trolie? Tengo la partida grabada en op.gg, warwick 2/1/0, no tengo build trol, no tengo score trol, no tengo farmeo trol, soy el que mas kill tenía del equipo si no me equivoco, y como la partida esta GRABADA puedo demostrar QUE TAMHKENCH ME TROLEABA.\n\nAquí vuelvo a repetir:\n\n-Quería hacerme el blue, el me comía y hacía que se reseteara el blue. \n-Me comía y me tiraba a los enemigos... \n-Me sacaba el farmeo de la jungla. \n-JAMÁS FUE A TOP. EL ERA TOP, JAMÁS FUE PORQUE SE LA PASÓ TROLEANDO.\n\n¿Y tu dices que yo he troleado? La verdad me gustaría que se me devolviera la cuenta, que sancionen al tamh kench (cosa que no han hecho) y la verdad y lo pongo en mayus NO VUELVO A USAR EL CHAT. Porque cada cosa que digo, para ustedes está mal, y si el otro me trolea no es que este bien pero no es sancionable...\n\n-Primera promo a oro 3: un afk y un chico 0/11 que tuvo mal día. \n-Segunda promo: Dos trols, uno en cada partida. \n-Tercera promo: tamh kench trol.\n\nEntiendan mi fastidio, entiendan porque reacciono como reacciono y repito: \"Si bien no es justificable, ES ENTENDIBLE que los jugadores que me trolearon o se fueron AFK busco su perfil y siguen jugando como si NADA.\"\n\nMAYUSCULAS LAS USO PARA RESALTAR COMO SI FUERAN NEGRITA, NO SE TOMEN LAS MAYÚSCULAS COMO GRITAR.\n\nMuchas gracia por leer, espero que solucionen esta pésima decisión de aumentar mi baneo a 2 semanas.","replies":[{"poster":"Excorpion","date":"2018-03-15T00:33:38.812+0000","up_votes":1,"down_votes":0,"body":"Deberias compartir esa info, chatlog, video, etc.\n\nY no importa que hayan hecho otros. Tu ban es de chat por lo que hiciste, y ya está.","replies":[]}]},{"poster":"SKT T1 Bank","date":"2018-03-14T16:30:19.905+0000","up_votes":1,"down_votes":2,"body":"Los especialistas son rioters de, area, no otro soporte.\n\n;)","replies":[{"poster":"Excorpion","date":"2018-03-14T16:39:51.671+0000","up_votes":1,"down_votes":0,"body":"No men, soportes, no rioters","replies":[{"poster":"SKT T1 Bank","date":"2018-03-14T16:42:15.293+0000","up_votes":1,"down_votes":0,"body":"Riot santiago , 3er piso area soporte (?)","replies":[{"poster":"Excorpion","date":"2018-03-14T16:43:41.754+0000","up_votes":1,"down_votes":0,"body":"Sofia no existe ?","replies":[]}]}]}]}]},{"poster":"MasterRightClick","date":"2018-03-14T17:39:44.315+0000","up_votes":1,"down_votes":0,"body":"Si lo dice Exca es porque es verdad... ademas....si puteaste al soporte entonces no tenes nada que reclamar\n\nNo te creo que no seas toxico.\n\nHasta a mi me puteaste por chat privado cuando buscabas un coach y yo me ofreci, por lo tanto, que sepan que si sos tóxico y si sos capaz de putear a alguien.\n\nY si todos los del team apoyaban al Tham tambien es por algo. \n\n2 semanitas de ban y apenas vuelvas y digas algo te cae un perma porque para el sistema sos \"peligroso\"\n\nReformate","replies":[{"poster":"Adniel","date":"2018-03-14T17:41:59.085+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=MasterRightClick,realm=LAS,application-id=X54mVVp0,discussion-id=R3m7HEAa,comment-id=0006,timestamp=2018-03-14T17:39:44.315+0000)\n>\n> Si lo dice Exca es porque es verdad... ademas....si puteaste al soporte entonces no tenes nada que reclamar\n> \n> No te creo que no seas toxico.\n> \n> Hasta a mi me puteaste por chat privado cuando buscabas un coach y yo me ofreci, por lo tanto, que sepan que si sos tóxico y si sos capaz de putear a alguien.\n> \n> Y si todos los del team apoyaban al Tham tambien es por algo. \n> \n> 2 semanitas de ban y apenas vuelvas y digas algo te cae un perma porque para el sistema sos &quot;peligroso&quot;\n> \n> Reformate\n\nSi es verdad, a ti te insulté porque sentía y ahora no recuerdo que era lo que me dijiste, fue hace mucho, pero sentía que me estabas troleando/pelotudeando. Yo solo te pido una cosa:\n\nhttp://las.op.gg/summoner/userName=adniel\nWW 2/1/0 mirala... solo mírala... y no comentes mas... Eso solo te pido dura 15 minutos.. NADA... por favor te lo pido.","replies":[]}]},{"poster":"SKT T1 Bank","date":"2018-03-14T16:20:22.771+0000","up_votes":1,"down_votes":4,"body":"Hola soy Bank especialista en troleo y atendere tu caso.\n\nCuentame bien el tema, pudiste bajar la replay?\nGraba la seccion donde te pasa eso de forma clara y subela a youtube, enviame dicho video y corroboraremos el troleo.\n\n\nNo, mi respuesta no va a ser \"no te dejes comer por tham\".\n\nTen en cuenta que si no reportas al final de la partida, no se puede marcar el reporte. Tambien esta bueno que aclares en el reporte que sucedio, y sobre todo bloquea al jugador luego de reportarlo.\n\nEl sistema es automatico,es como un niño tarda mucho en aprender que es troleo y que no lo es, por eso es mas rapido sancionarte a ti por flammer que a el por trolear. En este caso aclarar ayuda, pero el sistema tomara varias partidas en darse cuenta, ahora cuando se de cuenta no sera un mero ban chat jeje, le va a doler en el alma.\n\nAtentos todos, si trolean, se nota. Y el sistema puede trabajar PARA ATRAS, asique si creen que porque el sistema no los vio hoy no pasa nada, yo les recomiendo hacer buena letra, porque despues les va a caer un permaban directo y no van a entender. No sean tontos, los robots tienen muy buena memoria, yo que ustedes paraba con el troleo. Solo un consejo aparte.\n\n\nBANK\nTroll Specialist for Riot Las","replies":[{"poster":"Rick Silence","date":"2018-03-14T16:32:59.842+0000","up_votes":1,"down_votes":0,"body":"Mirá la respuesta de Excalibeer","replies":[{"poster":"SKT T1 Bank","date":"2018-03-14T16:37:43.628+0000","up_votes":1,"down_votes":0,"body":"Si la vi, si insultas al soporte bien no te va a ir....\n\nMal ahi,se intento.","replies":[]}]}]},{"poster":"Jaden101","date":"2018-03-14T15:45:14.481+0000","up_votes":1,"down_votes":3,"body":"Opino lo mismo. No andan atendiendo bien.","replies":[]}]}