{"poster":"Adniel","date":"2017-09-09T18:18:28.819+0000","title":"\"El support es main cocina\" \"Escudo y listo...\" \"Te van a crecer las tetas\"","subforum":"Off-topic y temas personales","up_votes":7,"down_votes":3,"body":"Tengo amigos en la vida real que no dejan de molestarme con que el rol de soporte es el mas f&aacute;cil de jugar, que ning&uacute;n campe&oacute;n de la bot line tiene mec&aacute;nicas, que soy un escudo andante, un ward andante, sea cual sea el campe&oacute;n que use.\r\nYo en lo personal se que eso no es cierto, que si el trabajo de un support sea solo que su adc no muera o dar un escudo, muchas TF se perder&iacute;an, el soporte cumple tareas como mirar el mapa mucho mas que los dem&aacute;s, el wardeo de objetivos y jungla enemiga, cortar o iniciar TF, yo que uso mucho a janna, una buena Q me hace ganar una TF y no cortar la E de zac me puede hacer perderlas. \r\n\r\n\r\nA lo que voy con esto es que no se que responderle estas personas, porque decir lo que puse arriba en palabras se me dificulta, son dos personas las que molestan con estas bromas que ya se vuelven pesadas, \r\nLa primera es main yasuo, darius, zed, teemo y yi con todos maestria 7. \r\nLa segunda es main azir, karthis, gp, lee sin todos maestria 7. \r\n\r\nLo digo para ver que puedo responderles y evitar que sigan despreciando mi rol favorito.","replies":[{"poster":"vaVav","date":"2017-09-09T18:24:33.884+0000","up_votes":3,"down_votes":0,"body":"Deciles \"Cuanto tu supp se vaya afk y no puedan tirar remake, te vas a comer tus palabras\".","replies":[]},{"poster":"Hwaxinghz","date":"2017-09-09T18:56:36.719+0000","up_votes":4,"down_votes":1,"body":"Como consejo te diría que no juegues con esa gente, que te digan lo que quieran, ser Soporte no tiene porque ser algo en lo que debas avergonzarte.\n\nYo soy Main Support y estoy casi en Diamante jugando de Support, quiere decir que tiene mérito y que no es un rol tan fácil. No le des bola a esa gente que insulta por jugar Soporte. De hecho, ahora mismo las colas para entrar a una partida (poniendo soporte) son super largas (más que cuando pongo mid o adc), quiere decir que hay mucha más gente jugando dicho rol y que no es tan \"carreado\" como parece.\n\nTe puedo mostrar un vídeo que grabe  sobre como carrié como Support en una partidita en elo Platino, para que entiendas que la gente que te molesta sólo juegan campeones \"izi\" (Darius, Yasuo, GP, Yi, etc), cuando les toca Sup se darán cuenta de que no entienden nada de la vida y que perderán, que no es tan fácil como parece.\n\nUn soporte bueno hace la diferencia, que no te engañen los malos comentarios. Muchas veces las malas lenguas opacan lo hermoso que es el rol, no es tan terrible como todos te dicen. Por mi parte lo que haría sería Bloquear a esa maleza y, si siguen molestando en la realidad, ignoralos, sube de Liga tú y deja que ellos se queden atrapados en los reinos de bronza, vas a ver como solitos se darán cuenta que no es tan simple jugar Soporte.\n\nhttps://www.youtube.com/watch?v=UpyV7bnu7Ns\n\nNo te preocupes, ya solos se darán cuenta de la importancia del Rol de Soporte.\n\n{{sticker:poppy-wink}}","replies":[]},{"poster":"The Steel Shadow","date":"2017-09-10T01:43:20.808+0000","up_votes":2,"down_votes":0,"body":"Si jugaras rakan o alistar quizá sería más respetable que apretar E, suerte que ya van a nerfear el pebetero y a janna, increíble un juego donde apretar E se equipara a un rakan","replies":[]},{"poster":"Shion Archimago","date":"2017-09-09T18:33:39.436+0000","up_votes":2,"down_votes":0,"body":"es solo un meme\ncomo molestar a los main yasuo o focusear a los teemos {{sticker:katarina-love}}","replies":[]},{"poster":"connor984","date":"2017-12-31T23:31:31.673+0000","up_votes":1,"down_votes":0,"body":"Vos hace así, entras a una partida con tus amigos, y cuando sea min 5 (para que no tiren remake) les decís \"uy me acordé que los supps no sirven mejor me voy afk\" y listo hasta la rendición temprana va a ser la peor partida de su vida.","replies":[]},{"poster":"Luna Aureum","date":"2017-09-17T16:12:09.611+0000","up_votes":1,"down_votes":0,"body":"La primer persona es main cabecear teclado what jaja\nMira, no te conviene decirles nada y que sigan hablando. A mi me gastan todo el tiempo por ser mujer y jugar support, me vale mierda lo que dicen porque es mi rol favorito. Si te gusta el rol, ignoralos y seguí en la tuya. Vos jugas porque te gusta y lo hacer por vos. A la mierda ellos y esos comentarios.","replies":[]},{"poster":"Lucil","date":"2017-09-11T14:02:08.453+0000","up_votes":1,"down_votes":0,"body":"Hola, quiero decirte que te súper entiendo y que también me rompe las pelotas cuando me hacen chistes como: ¿Quién te puso internet en la cocina?, pone wards y deja que los que saben jueguen bla bla bla y la verdad que si bien es algo a lo que te acostumbras, está re mal. \n\nLamentablemente no se puede hacer nada más que relajarse, respirar profundo y tomar el comentario como de quién viene: de alguien que es main yasuo. <3\n\nSalu2","replies":[]},{"poster":"ÅTLAS ","date":"2017-09-09T20:50:08.928+0000","up_votes":1,"down_votes":0,"body":"No digo que sea un rol menos importante pero sin ofender no tenes la habilidad que tienen los otros 4 roles ni las mecanicas no tenes que farmear ni hacer 1 vs 1 son mecanicas las que tenes que realizar mas sencillas sin ofender , no apruebo que te digan cosas ofensivas pero tampoco podemos decir que un soporte tiene el mismo nivel/habilidad que el mid o el top","replies":[{"poster":"iEban","date":"2017-09-09T21:00:32.705+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Berserker088,realm=LAS,application-id=J8qpiO2I,discussion-id=snGMfZye,comment-id=0005,timestamp=2017-09-09T20:50:08.928+0000)\n>\n> No digo que sea un rol menos importante pero sin ofender no tenes la habilidad que tienen los otros 4 roles ni las mecanicas no tenes que farmear ni hacer 1 vs 1 son mecanicas las que tenes que realizar mas sencillas sin ofender , no apruebo que te digan cosas ofensivas pero tampoco podemos decir que un soporte tiene el mismo nivel/habilidad que el mid o el top\n\nPor suerte las mecánicas son la parte menos importante del juego.","replies":[{"poster":"ÅTLAS ","date":"2017-09-09T22:32:05.325+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DKeaton,realm=LAS,application-id=J8qpiO2I,discussion-id=snGMfZye,comment-id=00050000,timestamp=2017-09-09T21:00:32.705+0000)\n>\n> Por suerte las mecánicas son la parte menos importante del juego.\n\nCoincido que es mas importante son las decisiones pero si tenes menos mecánicas que el resto el rol de support es el indicado","replies":[{"poster":"Adniel","date":"2017-09-10T19:37:02.427+0000","up_votes":1,"down_votes":0,"body":"Discúlpame, es verdad que quizás hacer un insec con lee sin es mas difícil que tirar flash R con janna. Pero apretá 1 segundo tarde la R con janna, o no cortes la iniciación de un zac, thresh, leona con la Q a tiempo... Con solo 1 segundo que te demores, el equipo rival hizo una cantidad de daño que tu pudiste evitar y probablemente pierdas la tf. Viéndolo del otro punto de vista, apreta bien tu Q y tu R y con solo eso puedes ganar una tf muy fácil mente donde quizás con otro soporte la hubieras perdido. \n\nLo que tiene este rol es que se nota el que lo mainea y el que lo juega por primera vez. Yo veo a Tops jamás usar el TP para hacer ARAM bot (x decirlo así) o midlaners que el roaming no es efectivo o que pierden la torre por hacer demasiado roaming, o junglas que no ponen wards y no sacan objetivos, pero en el caso del rol soporte, 1 error simple te condiciona toda la partida, porque fedeaste a una vayne, tu  adcarry no farmeó bien, vos no tenes oro ni exp, se quedan atrás 2 jugadores, **no 1 como en los demás roles**, y potencias para mi gusto a los 2 jugadores rivales mas poderosos **(Poderosos en el sentido de que si tenes una vayne 10/0 y un braum, thresh, alistar, janna, soraka,etc anda a darle un básico a esa vayne... con un buen soporte no muere nunca y se hace el 5vs2.**","replies":[]}]}]}]},{"poster":"Rehrs","date":"2017-09-09T23:26:19.228+0000","up_votes":1,"down_votes":0,"body":"tus amigos son los tipicos que ven el juego por encima, pensando que el lol es un juego que requiere muchisimas \"mecanicas\" restando importancia a cosas mas dificiles de ver, como el conocimiento del juego el cual te da posicionamiento y la capacidad de predecir al enemigo (que algunos confunden con reflejos koreanos cuando en verdad lo estaba esperando xD)\nsi quieren juegos que requieran \"manos\" que jueguen SC2 o incluso wow en pvp sobre 2300 para que se les rompan las manos xDDDDD","replies":[]},{"poster":"TheJackKrausser","date":"2017-09-09T20:50:47.462+0000","up_votes":1,"down_votes":0,"body":"no les hagas caso,a mi me encanta jugar de suport con tresh y leona a pesar de que por lo general maineo mid y adc,ultimamente me divierto y siento mas util  jugar de suport,nadie te hace focus y cuando quieren acordarse te terminas mandando un doble,triple kill (con tresh en un tf llegue a hacer un cuadrakill jajajajaja){{champion:412}}","replies":[]},{"poster":"Wawüz","date":"2017-09-09T18:50:44.596+0000","up_votes":1,"down_votes":0,"body":"Consejos\n\n1.- Si lo hacen en plan \"broma hiriente\", tu tambien bromea con ellos, {{champion:157}} {{champion:17}} {{champion:30}} {{champion:11}} {{champion:238}} , tiene mucho potencial de broma.\n\n2.- Si no eres de hacer esa clase de chistes simplemente diles lo que piensas, que no te gusta que se expresen de tu rol de esa forma y que si tan facil les parece ser soporte pues que lo intenten ellos. \n\n3.- Si no hacen caso a tu reclamo pues yo creo que ahi no hay nada de amistad, solo es gente jodiendote en un juego que se supone sirve para que uno se divierta.","replies":[]},{"poster":"Sparky Lulu","date":"2017-09-09T18:42:19.199+0000","up_votes":1,"down_votes":0,"body":"Mirá, como poder podés probar una partida ayudar a todo el mundo menos a ellos dos. Cuando vean que no sobreviven, que no pueden ganar peleas y demás porque tu ayuda es indispensable, puede que se den cuenta de que lo que les decís es cierto. Igualmente, no te desesperés porque ellos no lo entiendan porque lo más probable es que ni aunque los hagas ir de soporte o hagas cualquier cosa que te podamos sugerir acá, acepten que su concepción del rol es errada, ya que si tienen las ideas tan fijadas en la cabeza es casi imposible hacerles cambiar de opinión (sobre todo si saben que a vos te molesta).\n\nMi mejor consejo es que hagas tu juego y les digas de frente que no te gusta que te molesten por el rol y los personajes que jugás, así como vos no los molestás a ellos por eso (si los molestás por eso fuiste, porque tu argumento va a ser inválido xD). Intentá olvidarte de lo que te dicen, no demuestres que te molesta, y hablales como amigos: si ellos no pueden dejar de lado eso porque valoran más el molestarte por lo que te gusta, no juegues más con ellos. Si se enojan, es problema de ellos porque todo tiene un límite y ésto es algo que a vos te molesta. Te lo digo por experiencia: decirle a un/a amigx que no querés jugar más con él/ellx porque ves que la situación es desagradable no es ser mal amigo, al contrario, es buscar lo mejor para todxs para poder mantener la amistad. Si lo entienden bien y si no, a otra cosa, pero no está bueno que te banques una situación que te hace pasar malos ratos por un juego y porque tus **amigos** no saben cuándo cortar la _\"joda\"._\n\nEs un tema que me toca de cerca porque he tenido problemas al jugar con amigos, porque soy main soporte, y porque _\"encima\"_ soy mujer (¡cómo voy a ozar semejante cosa!), con lo cual, las puteadas y los comentarios machistas están a la orden del día (y también me los he tenido que bancar de \"amigxs\"). Ojalá puedas solucionar ésto y ojalá tus amigos tengan un poco más de cabeza y piensen un poco en lo que te pueden generar con sus palabras.\n\nSaludos,\n{{champion:117}}","replies":[]}]}