{"poster":"Adniel","date":"2018-06-04T18:01:40.162+0000","title":"Taric y yi mid... ¿Que han hecho con la jungla?","subforum":"Charlas Generales","up_votes":4,"down_votes":2,"body":"La verdad... decepcionado de que el rol que mas me gusta del juego se est&eacute; eliminando... Ya se est&aacute; jugando Doble Mid en varios servidores, en todos los elos... y la verdad es desastroso ver como la jungla ha llegado a un punto donde si vos jugas jungla **No ganas.**","replies":[{"poster":"Adniel","date":"2018-06-04T18:08:47.691+0000","up_votes":2,"down_votes":0,"body":"https://www.youtube.com/watch?v=1pPSisRMLYY","replies":[]},{"poster":"Sonne","date":"2018-06-04T20:48:49.154+0000","up_votes":1,"down_votes":0,"body":"No están eliminando nada, esa \"meta\" solamente le sirve a Yi y a Taric _juntos_. Además, hay muchas formas de jugarle en contra a eso cuando se sabe lo que están haciendo.\n\nY realmente la jungla no está arruinada, estás exagerando un poco. ¿A qué te referís con \"si vos jugás jungla no ganás\"?","replies":[{"poster":"Adniel","date":"2018-06-04T21:30:38.755+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SonneKa,realm=LAS,application-id=v7qsfXsE,discussion-id=2bwmH45J,comment-id=0003,timestamp=2018-06-04T20:48:49.154+0000)\n>\n> No están eliminando nada, esa &quot;meta&quot; solamente le sirve a Yi y a Taric _juntos_. Además, hay muchas formas de jugarle en contra a eso cuando se sabe lo que están haciendo.\n> \n> Y realmente la jungla no está arruinada, estás exagerando un poco. ¿A qué te referís con &quot;si vos jugás jungla no ganás&quot;?\n\nMe refiero a que ese rol antes era determinante en la partida, y ahora esta en un segundo plano. He notado en elos bajos y altos (Hablando solo de LAS no korea) que **Un jungla puede ir 4/0 con buen farm y el otro 0/3 con mal farm, pero no es tan determinante para ganar la línea.** Si tenes un buen adc y un buen mid, que de verdad sean BUENOS por mas que tu jungla sea malo, vas a ganarla.\n\n\nPor ejemplo, si tenes un adc 6/0 y un mid 5/0 y un soporte con 3 asistencias pero que sepa poner escudos por lo menos, como una janna, por mas que el otro jungla vaya 6/0 y se haya hecho dos dragones de la montaña y el heraldo, a la hora de pelear, va a ganar el equipo que tiene fedeados a su mid y a su adc. **AL MENOS QUE EL JUNGLA SEA UN ASESINO.**","replies":[{"poster":"Sonne","date":"2018-06-05T00:00:24.305+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Adniel,realm=LAS,application-id=v7qsfXsE,discussion-id=2bwmH45J,comment-id=00030000,timestamp=2018-06-04T21:30:38.755+0000)\n>\n> Me refiero a que ese rol antes era determinante en la partida, y ahora esta en un segundo plano. He notado en elos bajos y altos (Hablando solo de LAS no korea) que **Un jungla puede ir 4/0 con buen farm y el otro 0/3 con mal farm, pero no es tan determinante para ganar la línea.** Si tenes un buen adc y un buen mid, que de verdad sean BUENOS por mas que tu jungla sea malo, vas a ganarla.\n> \n> \n> Por ejemplo, si tenes un adc 6/0 y un mid 5/0 y un soporte con 3 asistencias pero que sepa poner escudos por lo menos, como una janna, por mas que el otro jungla vaya 6/0 y se haya hecho dos dragones de la montaña y el heraldo, a la hora de pelear, va a ganar el equipo que tiene fedeados a su mid y a su adc. **AL MENOS QUE EL JUNGLA SEA UN ASESINO.**\n\nAntes del nerfeo a la jungla, la línea de bot se basaba no solamente en el concepto de \"better botlane wins\", sino que iba a ganar la botlane que más ganks del jungla tenía.\n\nCuando yo jugaba carry o support, era muy estresante tener al otro dúo bot bajo torre _todo_ el día esperando a que el jungla apareciera. Es que eso es lo único que hacían: freezear lo máximo posible y pelear únicamente con la presencia del jungla, para poder mandarse un kill doble gratis. Era un modo de juego que estresaba mucho, como carry no había nada más frustrante que ver cómo el jungla enemigo se las arreglaba para aparecer 24/7 mientras mi propio jungla andaba intentando campear al tanque en top (pasaba en el 90% de las partidas).\n\nCon el nuevo parche realmente no siento que se hayan complicado mucho las cosas para los junglas, llego a hacerme todos los cangrejos de la partida y aun así el jungla rival tiene la misma experiencia que yo, así que taaaan mal las cosas no van.\n\nLo que sí noté es que ya no hay tanto campeo exagerado, lo cual es un alivio. Pude volver a jugar bot y dejar el estrés de lado, ya que el jungla aparece pero no es el factor más importante para ganar la línea... Finalmente!\n\nY todo eso pasa porque el cambio a la jungla se basa en manejar la ruta de los junglas, haciendo que quedarse solamente por una zona del mapa sea lo menos eficiente. Si te guiás por los cangrejos estás por buen camino, el factor aleatorio de ellos hace que ser jungla sea más algo de oportunidades que de planear campeos (cosa que se hacía con bot antes).\n\nPuede que ahora sientas que no tiene un impacto importante en la partida, pero me parece que ahora cumple con la misma importancia que las demás líneas... Antes eso no pasaba, si no tenías jungla era perder automáticamente, lo cual tampoco estaba muy bien que digamos. Siento que poco a poco se está llegando a un punto medio, en el que todas las líneas sean igual de importantes. Pero obviamente, dale paciencia.\n\nY tu ejemplo lo entiendo muy bien, podés ser el mejor jungla, hacerte todos los objetivos del mundo... Pero si tu team es malo, perdiste, todo eso no sirve de nada (aunque generalmente no llegás a hacerte objetivos si tu team no sabe responder...). Ahora, eso no solamente pasa con la jungla, pasa con absolutamente todas las líneas, así que no tiene mucho que ver con los nerfeos y todo eso.\n\n\n(PD: Creo que escribí mucho, pero bueno... me gusta explicarme.)","replies":[]}]}]},{"poster":"WhiteMax","date":"2018-06-04T18:07:39.900+0000","up_votes":1,"down_votes":0,"body":"Puedes pasar link? quiero ver ese doble mid, si es posible que sea una partida en Diamante o +.","replies":[{"poster":"Hell Darking","date":"2018-06-04T18:17:22.273+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WhiteMax,realm=LAS,application-id=v7qsfXsE,discussion-id=2bwmH45J,comment-id=0000,timestamp=2018-06-04T18:07:39.900+0000)\n>\n> Puedes pasar link? quiero ver ese doble mid, si es posible que sea una partida en Diamante o +.\n\nNo somos diamantes ni nada.. solo unos simples platitas\nde hecho no es doble mid, solo vuelven a mid para farmear la oleada y se piran denuevo a la jg a farmear\ntaric no hace nada mas que tankearle las cosas al yi y/o ayudar con los ganks metiendo el stun\n\nhttps://imgur.com/BVOuPMn","replies":[{"poster":"WhiteMax","date":"2018-06-04T21:45:46.744+0000","up_votes":1,"down_votes":0,"body":"Ahhh xD yo me imagine a lo literal a 2 en mids en plan como una bot lane.","replies":[]}]}]},{"poster":"POD2 Midnight","date":"2018-06-04T20:39:46.357+0000","up_votes":1,"down_votes":0,"body":"Buenas ;)\n\nhttps://youtu.be/pgE4eY7s78M\n\nOtra vez con Dong Huap, esta vez con unos tips para ganarle a Maestro Yi + Taric, que la verdad siento esa estrategia (y sus variantes) muy débil cuando el enemigo sabe y aplica estos tips.\n\nSaludos :)","replies":[]}]}