{"poster":"Taijis","date":"2017-06-06T07:58:34.782+0000","title":"Problemi con il client","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Ho recentemente resettato il PC e quindi reinstallato il gioco.\r\nma reinstallandolo ora fa cose che prima non faceva (per esempio ora quando lo apro non ha l&#039;icona del nuovo client ma di quello vecchio, e prima di aprire il login screen, mi compare la vecchia schermata di avvio)\r\noltre a questo, client, Champion select e schermata di caricamento sono ok, ma in game la grafica si sfoca e si schiaccia.\r\nho bisogno di aiuto per sistemare queste due cose.\r\n\r\nse qualcuno ha un download per scaricare il nuovo client senza parti rimanenti di quello vecchio me lo scriva qui sotto.","replies":[{"poster":"Chroniicles","date":"2017-06-06T09:25:28.949+0000","up_votes":1,"down_votes":0,"body":"Come già suggerito da Etoclas, il primo problema puoi momentaneamente arginarlo creandoti manualmente il collegamento al gioco da quel percorso, con le patch hanno rimosso mano mano i file del vecchio client che non servivano più (anche se effettivamente ho ancora il vecchio percorso nella cartella, che non funziona ovviamente).\nPer l'altro problema, prova ad estrarre i log con [HRT](https://support.riotgames.com/hc/it/articles/224826367-Risoluzione-problemi-automatizzata-strumento-di-riparazione-Hextech) che gli dò un'occhiata (hostali su dropbox o simili)","replies":[{"poster":"Taijis","date":"2017-06-06T09:49:16.672+0000","up_votes":1,"down_votes":0,"body":"Come faccio ad estrarre i log? Il programma in questione si chiama proprio HRT?","replies":[{"poster":"Chroniicles","date":"2017-06-06T10:24:00.199+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hope Spirit,realm=EUW,application-id=98NGV4Al,discussion-id=8PXoRhYo,comment-id=00010000,timestamp=2017-06-06T09:49:16.672+0000)\n>\n> Come faccio ad estrarre i log? Il programma in questione si chiama proprio HRT?\n\nse clicchi sul nome ti rimanda alla pagina, c'è collegato un link! li estrae in automatico quando lanci l'applicazione","replies":[{"poster":"Taijis","date":"2017-06-07T06:06:39.978+0000","up_votes":1,"down_votes":0,"body":"Ho appena finito di fare l'analisi con HRT, mi ha lasciato sul desktop una cartella con i registri di lol.\ndevo farti vedere quella?\n(permetti l'ignoranza, ma non ho ben capito che devo fare)","replies":[{"poster":"Chroniicles","date":"2017-06-07T08:33:46.359+0000","up_votes":1,"down_votes":0,"body":"Esatto, proprio quelli. Hostali su dropbox o drive, lasciami il link qua per scaricarli che appena ho modo gli dò un'occhiata","replies":[{"poster":"Taijis","date":"2017-06-07T09:09:30.927+0000","up_votes":1,"down_votes":0,"body":"https://www.dropbox.com/s/1a5c8searfcqi4q/Registri%20LoL.zip?dl=0\n\nEcco a te","replies":[{"poster":"Chroniicles","date":"2017-06-07T09:10:24.961+0000","up_votes":1,"down_votes":0,"body":"Li scarico subito e ti faccio sapere ;)","replies":[{"poster":"Taijis","date":"2017-06-07T09:12:15.144+0000","up_votes":1,"down_votes":0,"body":"Va bene grazie mille :)","replies":[{"poster":"Chroniicles","date":"2017-06-07T09:32:45.197+0000","up_votes":1,"down_votes":0,"body":"Ho dato un'occhiata veloce e mi sono accorto che stai giocando con la grafica integrata invece che con la dedicata, prova a impostare la vga giusta all'avvio di lol e vedi se il problema è rimasto.\n(inoltre, aggiorna i driver della Nvidia, hai la penultima versione)\n\nEdit: ho anche notato una possibile incongruenza nel file di configurazione, però prima fa la prova dello switch scheda poi proviamo a modificare il file game.cfg","replies":[{"poster":"Taijis","date":"2017-06-07T09:52:51.575+0000","up_votes":1,"down_votes":0,"body":"Ho provato a cambiare il processore grafico che veniva utilizzato sul gioco in ''processore NVIDIA ad alte prestazioni'' provando a riavviare.\nMagicamente tutto si é risolto.\ncomunque ho provato a controllare per gli aggiornamenti del driver sia tramite la gestione driver di windows sia tramite il programma dedicato (GeoForce Experience)\nma non ho comunque trovato alcun aggiornamento da fare.\noltre a tutto questo, per il file di configurazione?","replies":[{"poster":"Taijis","date":"2017-06-07T09:54:33.974+0000","up_votes":1,"down_votes":0,"body":"inoltre come processore mi conviene utilizzare sempre la scheda dell'NVIDIA, la CPU o selezione automatica?","replies":[{"poster":"Chroniicles","date":"2017-06-07T10:36:34.778+0000","up_votes":1,"down_votes":0,"body":"Ti conviene lasciare lo switch e impostare l'avvio automatico per lol con la Nvidia, almeno quando usi il pc per cose basilari consuma meno (e con l'estate, si scalda pure meno xD).\nPer il driver strano ma potrei essermi sbagliato io, ho visto che risale al 17/05 ma quello successivo potrebbe non interessare la tua vga.\nPer il file di configurazione, se il problema si è risolto non lo toccare, riguardava le dimensioni dello shop ma tieni così com'è se ti ci trovi!\n\nIn ogni caso, a prescindere da questo problema che ti è sorto, ci sono una MAREA di error nei log: potrebbero anche essere dovuti a interferenze col client, ti conviene usare ccleaner per una bella pulizia dei registri, controllare che ci siano le eccezioni sull'antivirus e sul firewall, e riprovare una riparazione","replies":[{"poster":"Taijis","date":"2017-06-07T11:03:45.650+0000","up_votes":1,"down_votes":0,"body":"Va bene, ti ringrazio moltissimo per l'aiuto :)","replies":[{"poster":"Chroniicles","date":"2017-06-07T11:05:17.279+0000","up_votes":1,"down_votes":0,"body":"figurati per così poco ;)","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Etoclas","date":"2017-06-06T08:21:26.791+0000","up_votes":1,"down_votes":0,"body":"Per il primo problema prova ad usare LolClient: \"C:\\Riot Games\\League of Legends\\LeagueClient.exe\".\n\nIo uso quello, e mi carica direttamente il nuovo client.\n\nPer il secondo problema prova a vedere la risoluzione e le altre impostazioni video.","replies":[{"poster":"Taijis","date":"2017-06-06T08:52:48.708+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Etoclas,realm=EUW,application-id=98NGV4Al,discussion-id=8PXoRhYo,comment-id=0000,timestamp=2017-06-06T08:21:26.791+0000)\n>\n> Per il primo problema prova ad usare LolClient: &quot;C:\\Riot Games\\League of Legends\\LeagueClient.exe&quot;.\n> \n> Io uso quello, e mi carica direttamente il nuovo client.\n> \n> Per il secondo problema prova a vedere la risoluzione e le altre impostazioni video.\n\nil mio schermo é un 1920 x 1080 (la risoluzione che sta anche in gioco) e poi ho controllato gia le impostazioni, ho provato anche a riparare, ma niente.","replies":[]}]}]}