{"poster":"MF Support","date":"2016-12-21T02:19:17.374+0000","title":"BOOSTER FOUND!","subforum":"Player Behaviour","up_votes":1,"down_votes":1,"body":"Just played a ranked game vs a Jayce that was obviously scripting or was getting boosted.\n\nAfter the game he linked these details in chat about 20 times.\n\nSKYPE: _Name Removed_\nDISCORD: _Name Removed_\n\nHis IGN was: _Name Removed_\nClan name: _Name Removed_\n\nSilver 3 last season, playing like a diamond or above player.\n\nNow go infiltrate his discord and give him hell.","replies":[{"poster":"Tele","date":"2016-12-21T02:58:15.866+0000","up_votes":1,"down_votes":0,"body":"I won't go into much because **LGC Elam** already summed it up for me. We've already removed your content before for _'Naming and Shaming'_, and this case is even worse because you're calling for players to _\"give him hell\"_.  \n\nIf you _'Name and Shame'_ again you will be facing a temporary ban from the boards.","replies":[]},{"poster":"Captain Fortune","date":"2016-12-21T02:49:40.756+0000","up_votes":1,"down_votes":0,"body":"**Hey mate, please remove the name and personal information from this post such as the person's summoner name, club and their Skype/Discord information.** If you want to report this player go ahead and send in a support ticket at https://support.riotgames.com with the information you have gathered, take some screen shots of chat logs and etc. We don't want this to turn into a witchhunt which rarely results in positive discussion.\n\nHere is an copy-paste from the universal boards rules referring to this:\n\n\"**Reporting Other Players**\n\nPlease don't name names. If you see or hear about another person breaking the rules, send us a ticket directly so we can investigate and take action if necessary. We know that players report publicly with the best intentions, but it often leads to a witchhunt, rarely resulting in a positive discussion. We'll be taking action against players who have violated rules, so please report these players correctly.\n\nModerators will be looking for the following:\n\n* Posts that accuse others of being toxic players in-game\n* Posts accusing others of malicious activity\n* Posts that accuse others of cheating or using illegal services\n* Posts accusing others of trolling in the boards (there’s a report button for that)\"","replies":[]}]}