{"poster":"feintfiend","date":"2018-08-09T17:38:06.612+0000","title":"Garen shouldn't be allowed to be this strong","subforum":"Gameplay","up_votes":13,"down_votes":17,"body":"He&#039;s so overbearing with his silence + grasp proc.\r\nIf Garen goes ignite he has an insane amount of kill pressure more so than the average top laner that takes ignite because of Garen&#039;s R.\r\nWith a kit a simple as his when he&#039;s this strong it isn&#039;t healthy.","replies":[{"poster":"EbonyBladeJ88","date":"2018-08-09T18:30:56.237+0000","up_votes":10,"down_votes":1,"body":"As an L7 Garen player (Though someone like Critmaster Garen could probably explain it better) I'll try to explain things.\n\nGaren, like most other Juggernauts, has an Auto-Attack resetting skill, his Q. This makes it synergize very well with Auto-Attack procced Keystones like Grasp, or Conqueror and others.\n\nIn regards to his kill pressure, it simply means he is doing his job as a Juggernaut. Juggernaut champions are DESIGNED to be able to deal out large amounts of damage, while also being able to tank large amounts of damage. But this comes at a cost. The cost being among some of the slowest champions in the game, with very limited (Or in the case of {{champion:82}} , none at all) Crowd Control.\n\nWhile simple on paper, Garen's kit (Thanks to his Visual Update and the Juggernaut Update) DOES have its complexities.\n\nGaren, unlike a Juggernaut like, say {{champion:122}} , does NOT have a strong early game. His Villain passive on his ult, for example, ONLY comes into play once he's LVL 6 at the earliest, AND a member of the opposing team needs to have gotten at least 1 kill for it to even activate; while {{champion:122}} gets his Noxian Might at LVL 1 as long as he can apply all 5 stacks of Haemorrhage. In addition to that, his lane opponent might not even BE the one that gets made the Villain depending on how the kills are flowing in a particular game. In low-kill games, for example, the Villain passive can be near-on useless because there might be a long period between kills, and thus, no one on the enemy team is getting marked as the Villain.\n\nGaren's W's passive that gives him free armor and magic resist requires him to get good CS rates, as kills (Whether of minions or of champions) are the ONLY things that increase it. Thus preventing him from farming not only reduces the amount of gold he can get, and thus items he can buy, but ALSO keeps him from getting stacks of his W's passive, making him less capable of tanking damage. His W also has a LONG CD, meaning if you can get him to use it prematurely, you've taken away his defensive capabilities even more.\n\nHis E does 33% increased damage when hitting a single unit. By standing with another champion, or in groups of minions, you prevent him from getting that potential damage boost. It can also critically strike, but due to the way most crit items work, it's not exactly the best idea to build it on him. (Critmaster Garen or others might take flak with this, but just speaking from my own experience)\n\nHis normal passive, his Perseverance/Regeneration, can be put on cool-down with something as simple as an auto-attack. Damaging abilities can also put it on CD. DoT (Damage over Time) abilities are even MORE effective as each tick resets his passive's CD. Constant poke keeps his passive on CD, thus greatly reducing his ability to regenerate and sustain through the laning phase.\n\nDo it enough, and you could (Depending on your chosen champion) get him low enough for an all-in, as by constantly poking him, you prevent him from regenerating.\n\nLet's Continue. Garen, like all Juggernauts, is susceptible to being KITED. He's actually one of the MOST susceptible, because unlike someone like {{champion:122}}  or {{champion:75}} or some other Juggernaut, his CC is not a Stun, Slow or Pull or something else. It is a Silence, which, yes, prevents the use of movement abilities such as Dashes, but it does NOT hinder actual movement speed, meaning you CAN move away from him after he's used it, and he largely can't do anything to stop you.\n\nHis play-making abilities revolve ENTIRELY around his {{summoner:4}} , because, like I said above, he doesn't have a Pull, or a Slow, or a Stun for his CC. Get him to blow his {{summoner:4}} and you've reduced his play-making abilities even more.\n\nThis is probably a way too long, and way too wordy response for such a short post as yours, but I'm making it anyway.","replies":[{"poster":"murderess","date":"2018-08-09T18:47:51.271+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=EbonyBladeJ88,realm=NA,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=0002,timestamp=2018-08-09T18:30:56.237+0000)\n>\n> \n> While simple on paper, Garen&#x27;s kit (Thanks to his Visual Update and the Juggernaut Update) DOES have its complexities.\n\nHow so? There is basically no champion with an easier kit, only champions with similiarly easy kits with similiarly little complexity. \n\nAlso, all your arguments are beside the point: he is performing too well in low elo (54%WR/15.5%POP) which means that he should get changed.\nThere are two possibilities:\n1: straight nerfs, making him reasonably strong in low elo while keeping his simplicity\n2: changes to make him worse in low and better in high elo","replies":[{"poster":"EbonyBladeJ88","date":"2018-08-09T19:39:10.813+0000","up_votes":4,"down_votes":0,"body":"Well, for complexities, let's look at the parts of his kit,one by one.\n\nHis passive only boosts his regen when it is active. Hitting him with one auto-attack or damaging ability places it on CD, reducing his regen. Granted at LVL 11 the cool-down to reactivate it is reduced from 9 seconds to 4, but the same rule of ONE Auto-attack or ANY damaging ability STILL places it on CD. He cannot activate it at will, he cannot reduce it's CD by buying CD reducing items, and, if you have something that applies Grievous Wounds, his Regen will FURTHER be reduced while it is on CD. Like I said above, constant poke PREVENTS him from getting his Perseverance, and thus his Regen.\n\nHis Q, upon activation CLEANSES him of all slows currently affecting him. With proper timing, a Garen can remove a slow nearly instantly after it has been applied to him. But, it does NOT say he is IMMUNE to slows afterwards. Meaning, if you can get the Garen to use his Q PRIOR to you applying your slow, you can render the MS boost he gets to be ineffective. Consistent or repeated slowing effects, such as {{champion:22}} 's Frost Shot or {{champion:48}} 's Pillar of Ice can remove his speed boost almost as quickly as he can gain it.\n\nNext, his W. For the first 0.75 seconds once activated, he takes 60% less damage and gains 60% Tenacity. For the remaining duration, he takes only 30% reduced damage. Through wise use, his W can act very similar to {{champion:114}} 's Riposte. But remember, that initial Tenacity and DMG reduction only apply during the first 0.75 seconds. The remaining duration has no Tenacity and the DMG reduction is halved.\n\nFor his E, it applies 33% more damage to a SINGLE unit. Meaning, like I said above, if he is hitting more than one unit, such as a group of minions and a champion, or even a single minion and a champion, those ticks of his E will NOT apply the additional damage. It means the Garen player must position himself wisely to get the very most out of his E.\n\nLastly, his R. It is an execute that deals bonus damage based on missing health, the amount dependent on the rank of the skill. (28.6% for 1, 33.3% for 2, and 40% for 3). The more health you have, the longer it takes for Garen to get you low enough to execute you, which if played around wisely, can let you occupy him so that other team-mates can come and aid you against him, or allow you to escape and prevent him from getting a kill, if your character has a dash or a blink or a knockback to boot him away.\n\nNext, here's what the tool-tip itself says about the Villain passive: \"The enemy with the most kills in the last 5 minutes is marked as the Villain. The mark cannot be assigned to another champion while Garen is in combat with the Villain. If more than one enemy has the same bounty, the enemy who received it first is marked the Villain.\"\n\nAs I said in my first comment, the Villain passive ONLY comes into play at LVL 6 at the earliest. Meaning, if you can shut him down early and keep him from getting levels, you keep the Villain passive away for as long as possible. Also, it REQUIRES that a member of the opposing team to have gotten some kills. If he is in a low-kill game, yes, someone will be marked as the Villain, but that also means that as long as that does not change, the bonuses granted do NOT apply to someone that it COULD be more effective on, reducing his ability to shut down that potentially more threatening opponent, until he finally kills his current Villain.\n\nSo there we are. Yes, his kit IS Simple. But, by looking at the tool-tips and what they entail it CAN reveal some complexities and mechanically intensive aspects. I NEVER said he had ALOT of complexities, only that he had SOME.","replies":[{"poster":"murderess","date":"2018-08-09T20:00:53.174+0000","up_votes":1,"down_votes":2,"body":"> So there we are. Yes, his kit IS Simple. But, by looking at the tool-tips and what they entail it CAN reveal some complexities and mechanically intensive aspects. I NEVER said he had ALOT of complexities, only that he had SOME.\n\nI never said that he doesn't. You simply took several paragraphs to agree with me: \n\n>  There is basically no champion with an easier kit, only champions with similiarly easy kits with similiarly little complexity.","replies":[{"poster":"Critmaster Garen","date":"2018-08-09T20:01:40.602+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=murderess,realm=EUW,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=0002000100000000,timestamp=2018-08-09T20:00:53.174+0000)\n>\n> Yes, he has SOME complexity. However, this statement still remains true:\n\nno champion who is easier?\n\n{{champion:80}}","replies":[{"poster":"murderess","date":"2018-08-09T20:02:33.293+0000","up_votes":1,"down_votes":2,"body":"Passive management in itself makes him more complex and difficult than Garen.","replies":[{"poster":"Critmaster Garen","date":"2018-08-09T20:04:45.136+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=murderess,realm=EUW,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=000200010000000000000000,timestamp=2018-08-09T20:02:33.293+0000)\n>\n> Passive management in itself makes him more complex and difficult than Garen.\n\nhis passive management is about as hard as annies.","replies":[{"poster":"murderess","date":"2018-08-09T20:10:02.817+0000","up_votes":1,"down_votes":1,"body":"Yes. If Annie's basic attacks counted towards her passive. And if Annie had a skill that charged her passive.\n\nOr in other words: you're literally wrong.","replies":[{"poster":"Critmaster Garen","date":"2018-08-09T20:12:21.003+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=murderess,realm=EUW,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=00020001000000000000000000000000,timestamp=2018-08-09T20:10:02.817+0000)\n>\n> Yes. If Annie&#x27;s basic attacks counted towards her passive. And if Annie had a skill that charged her passive.\n> \n> Or in other words: you&#x27;re literally wrong.\n\npantheons basic attacks help him charge his passive, but neither his spells nor basic attacks consume it. so youre right. its actually even less management to it.\n\nyou spam your q and in an all in you weave auto attacks between your spells. if you want to charge your passive or not, doesnt matter and you dont have to think about it. youre doing it anyways to maximize your damage.\n\ni have played that champion, and you cant argue that hes any more difficult to play. hes even easier to play than garen, since his win condition and his trades are easier.","replies":[{"poster":"murderess","date":"2018-08-09T20:24:12.078+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Critmaster Garen,realm=NA,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=000200010000000000000000000000000000,timestamp=2018-08-09T20:12:21.003+0000)\n>\n> pantheons basic attacks help him charge his passive, but neither his spells nor basic attacks consume it. so youre right. its actually even less management to it.\n\nBut it is consumed by enemy autoattacks and combining that with his W charging his passive that poses an interesting question: do you wait for your opponent to proc your passive to potentially get that triple block or do you W beforehand, effectively wasting the stacks you've accumulated to that point. \n\n> you spam your q and in an all in you weave auto attacks between your spells. if you want to charge your passive or not, doesnt matter and you dont have to think about it. youre doing it anyways to maximize your damage.\n\nSpamming your Q should somewhat be done with purpose as you now draw minion aggro, thus potentially messing up your wave when trying to freeze. \n\n> i have played that champion, and you cant argue that hes any more difficult to play. hes even easier to play than garen, since his win condition and his trades are easier.\n\nHe is most definitely not easier and equally easy only if you got any bias on the situation. Personally, I am totally unbiased (if not slightly biased towards full lethality Garen) as I play neither of these champions.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"feintfiend","date":"2018-08-09T18:43:17.510+0000","up_votes":3,"down_votes":5,"body":"> [{quoted}](name=EbonyBladeJ88,realm=NA,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=0002,timestamp=2018-08-09T18:30:56.237+0000)\n>\n> As an L7 Garen player (Though someone like Critmaster Garen could probably explain it better) I&#x27;ll try to explain things.\n> \n> Garen, like most other Juggernauts, has an Auto-Attack resetting skill, his Q. This makes it synergize very well with Auto-Attack procced Keystones like Grasp, or Conqueror and others.\n> \n> In regards to his kill pressure, it simply means he is doing his job as a Juggernaut. Juggernaut champions are DESIGNED to be able to deal out large amounts of damage, while also being able to tank large amounts of damage. But this comes at a cost. The cost being among some of the slowest champions in the game, with very limited (Or in the case of {{champion:82}} , none at all) Crowd Control.\n> \n> While simple on paper, Garen&#x27;s kit (Thanks to his Visual Update and the Juggernaut Update) DOES have its complexities.\n> \n> Garen, unlike a Juggernaut like, say {{champion:122}} , does NOT have a strong early game. His Villain passive on his ult, for example, ONLY comes into play once he&#x27;s LVL 6 at the earliest, AND a member of the opposing team needs to have gotten at least 1 kill for it to even activate; while {{champion:122}} gets his Noxian Might at LVL 1 as long as he can apply all 5 stacks of Haemorrhage. In addition to that, his lane opponent might not even BE the one that gets made the Villain depending on how the kills are flowing in a particular game. In low-kill games, for example, the Villain passive can be near-on useless because there might be a long period between kills, and thus, no one on the enemy team is getting marked as the Villain.\n> \n> Garen&#x27;s W&#x27;s passive that gives him free armor and magic resist requires him to get good CS rates, as kills (Whether of minions or of champions) are the ONLY things that increase it. Thus preventing him from farming not only reduces the amount of gold he can get, and thus items he can buy, but ALSO keeps him from getting stacks of his W&#x27;s passive, making him less capable of tanking damage. His W also has a LONG CD, meaning if you can get him to use it prematurely, you&#x27;ve taken away his defensive capabilities even more.\n> \n> His E does 33% increased damage when hitting a single unit. By standing with another champion, or in groups of minions, you prevent him from getting that potential damage boost. It can also critically strike, but due to the way most crit items work, it&#x27;s not exactly the best idea to build it on him. (Critmaster Garen or others might take flak with this, but just speaking from my own experience)\n> \n> His normal passive, his Perseverance/Regeneration, can be put on cool-down with something as simple as an auto-attack. Damaging abilities can also put it on CD. DoT (Damage over Time) abilities are even MORE effective as each tick resets his passive&#x27;s CD. Constant poke keeps his passive on CD, thus greatly reducing his ability to regenerate and sustain through the laning phase.\n> \n> Do it enough, and you could (Depending on your chosen champion) get him low enough for an all-in, as by constantly poking him, you prevent him from regenerating.\n> \n> Let&#x27;s Continue. Garen, like all Juggernauts, is susceptible to being KITED. He&#x27;s actually one of the MOST susceptible, because unlike someone like {{champion:122}}  or {{champion:75}} or some other Juggernaut, his CC is not a Stun, Slow or Pull or something else. It is a Silence, which, yes, prevents the use of movement abilities such as Dashes, but it does NOT hinder actual movement speed, meaning you CAN move away from him after he&#x27;s used it, and he largely can&#x27;t do anything to stop you.\n> \n> His play-making abilities revolve ENTIRELY around his {{summoner:4}} , because, like I said above, he doesn&#x27;t have a Pull, or a Slow, or a Stun for his CC. Get him to blow his {{summoner:4}} and you&#x27;ve reduced his play-making abilities even more.\n> \n> This is probably a way too long, and way too wordy response for such a short post as yours, but I&#x27;m making it anyway.\n\nYou can't kite a Garen with his Q and {{item:3742}} unless you have hard CC and this applies to every other champion except {{champion:2}} so its not a specific weakness\n.{{champion:86}} is much more mobile than {{champion:122}} and {{champion:82}} .\nThe fact you think {{champion:82}} can take in a lot of damage tells me you don't know the champion very well, his appearance and role are decieving.\n\nThe fact is that a 4k health Garen runs at a squishy and chunks 1/3 of thats squishies' health with a Q and can E+R for the kill or just stay autoing and Q until they die and he can't be shaken off because of his Q, {{item:3742}}  and {{item:3044}} unless you have hard CC.\nI don't think a fast champion with 4k+ health, insane out of combat regen, high resistances, burst damage, a missing % HP nuke and a toxic mechanic that punishes the enemy for doing well is healthy at all.","replies":[{"poster":"True Garen","date":"2018-08-12T20:40:03.077+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=feintfiend,realm=NA,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=00020000,timestamp=2018-08-09T18:43:17.510+0000)\n\n> The fact is that a 4k health Garen runs at a squishy and chunks 1/3 of thats squishies&#x27; health with a Q and can E+R for the kill or just stay autoing and Q until they die and he can&#x27;t be shaken off because of his Q, {{item:3742}}  and {{item:3044}} unless you have hard CC.\n> I don&#x27;t think a fast champion with 4k+ health, insane out of combat regen, high resistances, burst damage, a missing % HP nuke and a toxic mechanic that punishes the enemy for doing well is healthy at all.\n\n\nBut he's had all of these things for years, and he was actually considered a weak pick, despite or because of it. Nothing that you find issue with is new. It's been there all along, and Garen barely got by.","replies":[]},{"poster":"EbonyBladeJ88","date":"2018-08-09T20:06:45.770+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=feintfiend,realm=NA,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=00020000,timestamp=2018-08-09T18:43:17.510+0000)\n>\n> You can&#x27;t kite a Garen with his Q and {{item:3742}} unless you have hard CC and this applies to every other champion except {{champion:2}} so its not a specific weakness\n\nI never said that Kiting was a weakness SPECIFIC to Garen. Kiting is the main bane of ALL Juggernauts, whether it's Garen or someone else in the subclass.\n\n> .{{champion:86}} is much more mobile than {{champion:122}} and {{champion:82}} .\n\n{{champion:86}} is more mobile than {{champion:122}}  or  {{champion:82}} , this is true. I never said he wasn't.\n\nIn regards to his mobility, he is classified in an UNOFFICIAL way by Juggernaut players such as myself as a \"Freight Train\" Juggernaut. Let me explain what I mean.\n\nIn addition the already existing subclass system that Riot officially uses, some Juggernaut players have added to it, coming up with their OWN subclasses OF the Juggernaut Subclass, and there are 2 of these subclasses.\n\nRaid Bosses and Freight Trains.\n\nRaid Bosses are the slow, powerful champions like {{champion:122}} ,  {{champion:420}} ,  {{champion:6}} ,  {{champion:83}}  as examples.\nFreight Trains are the faster, but slightly less hard-hitting or less tanky ones, as the case may be with the champion themselves. {{champion:86}} is one of the Freight Train Juggernauts.\n\nThe information regarding Raid Bosses and Freight Trains comes from the post just below:\n\nhttps://boards.na.leagueoflegends.com/en/c/gameplay-balance/5Lj6oXPe-long-post-what-are-juggernauts-an-introduction-to-the-class-and-each-champion\n\n> The fact you think {{champion:82}} can take in a lot of damage tells me you don&#x27;t know the champion very well, his appearance and role are decieving.\n\n{{champion:82}} is a bit of a mess. He has a major identity crisis. Is he a Top Laner? Is he a Bot Laner with his Dragon-capturing aspect? Is he a Mid Laner? Riot themselves don't even know for sure. (I'm not a consistent Morde player, so I don't know his ins-and-outs, so that's not my place to judge, since I'm not as informed about him.)\n\nWhy do you think people like Malicious Metal and other Morde players are practically BEGGING for him to get a VGU? He's buggy as crap, and because of that, his identity crisis and other factors, Morde CANNOT fulfill reliably, the THEME or DESIGN a Juggernaut is meant to have. That design being a slow, powerful champion who can take damage as well as dish it out.\n\n> \n> The fact is that a 4k health Garen runs at a squishy and chunks 1/3 of thats squishies&#x27; health with a Q and can E+R for the kill or just stay autoing and Q until they die and he can&#x27;t be shaken off because of his Q, {{item:3742}}  and {{item:3044}} unless you have hard CC.\n> I don&#x27;t think a fast champion with 4k+ health, insane out of combat regen, high resistances, burst damage, a missing % HP nuke and a toxic mechanic that punishes the enemy for doing well is healthy at all.\n\nYou didn't read, or at least didn't understand what I wrote in the first comment. Here it is again.\n\n\"In regards to his kill pressure, it simply means he is doing his job as a Juggernaut. Juggernaut champions are DESIGNED to be able to deal out large amounts of damage, while also being able to tank large amounts of damage.\"\n\nHere is another description and classification of the INTENDED role of Juggernauts.\n\n\"Juggernauts are melee titans who relentlessly march down the opposition and devastate those foolish enough to get within their grasp. They are the only subclass who excel at both dealing and taking significant amounts of damage, but in turn they have a tough time closing in on targets due to their low range and extremely limited mobility. \"\n\nThat was taken from THIS post by Riot as part of the Dev Blog that OFFICIALLY established the notion of Subclasses:\n\nhttps://na.leagueoflegends.com/en/news/game-updates/gameplay/dev-blog-classes-subclasses\n\n\nThis means that if Garen, or ANY OTHER Juggernaut for that matter, gets on you, IT'S GOING TO HURT.\n\nI said that unlike Darius, he does NOT have a strong EARLY game. He does not get a free AD boost for basic attacking 5 times like {{champion:122}} , or get a free shield for simply damaging with his abilities like {{champion:82}} . His W, like I said above, requires him to get CS to get those permanent Armor and MR boosts, he is dependent on FARM or KILLS for that. He doesn't simply gain it over the course of a game by doing nothing.","replies":[]},{"poster":"onionsan01","date":"2018-08-09T20:00:05.067+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=feintfiend,realm=NA,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=00020000,timestamp=2018-08-09T18:43:17.510+0000)\n>\n> You can&#x27;t kite a Garen with his Q and {{item:3742}} unless you have hard CC and this applies to every other champion except {{champion:2}} so its not a specific weakness\n> .{{champion:86}} is much more mobile than {{champion:122}} and {{champion:82}} .\n> The fact you think {{champion:82}} can take in a lot of damage tells me you don&#x27;t know the champion very well, his appearance and role are decieving.\n> \n> The fact is that a 4k health Garen runs at a squishy and chunks 1/3 of thats squishies&#x27; health with a Q and can E+R for the kill or just stay autoing and Q until they die and he can&#x27;t be shaken off because of his Q, {{item:3742}}  and {{item:3044}} unless you have hard CC.\n> I don&#x27;t think a fast champion with 4k+ health, insane out of combat regen, high resistances, burst damage, a missing % HP nuke and a toxic mechanic that punishes the enemy for doing well is healthy at all.\n\nas a garen main i only sometimes build death plate man. and when i dont. it´s because i dont need mobility. garen is a champ with no mobility and he is easly kiteable. so if you wanna kill garen kite him. and if i get kited easly. i build death man plate. for running away.","replies":[]}]}]},{"poster":"Salvor Hardın","date":"2018-08-09T18:00:25.787+0000","up_votes":8,"down_votes":4,"body":"The problem is the W, makes almost imposible to gank him.","replies":[{"poster":"Fear the Kayn","date":"2018-08-09T19:55:38.366+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Salvor Hardın,realm=NA,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=0000,timestamp=2018-08-09T18:00:25.787+0000)\n>\n> The problem is the W, makes almost imposible to gank him.\n\nIndeed, his W is his main issue atm. I think his damage is fine, but his innate tankiness is way too good.","replies":[{"poster":"Critmaster Garen","date":"2018-08-09T19:59:44.712+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Fear the Kayn,realm=NA,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=00000000,timestamp=2018-08-09T19:55:38.366+0000)\n>\n> Indeed, his W is his main issue atm. I think his damage is fine, but his innate tankiness is way too good.\n\nhis innate tankyness is a replacement for the sustain that other juggernauts have.\n\nhe cant repeatedly heal for a giant chunk of his missing health like {{champion:122}} {{champion:420}} {{champion:77}} \n\nor by csing and lifestealing like {{champion:48}} {{champion:75}} \n\nhe cant just regenerate a massive portion of his health pool in a fight like {{champion:106}} {{champion:36}}\n\nunlike other juggernauts he gets one health bar he has to work with, and thats it.","replies":[{"poster":"Fear the Kayn","date":"2018-08-09T20:04:37.634+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Critmaster Garen,realm=NA,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=000000000000,timestamp=2018-08-09T19:59:44.712+0000)\n>\n> his innate tankyness is a replacement for the sustain that other juggernauts have.\n> \n> he cant repeatedly heal for a giant chunk of his missing health like {{champion:122}} {{champion:420}} {{champion:77}} \n> \n> or by csing and lifestealing like {{champion:48}} {{champion:75}} \n> \n> he cant just regenerate a massive portion of his health pool in a fight like {{champion:106}} {{champion:36}}\n\nHis passive is his innate tankiness. Once he gets out of a fight he can regen his health very quickly. He doesn't need an ability that passively gives him armor and MR, and can be activated to negate pretty much any damage/CC for like 5 seconds. It's impossible to gank/lock him down him.","replies":[{"poster":"Critmaster Garen","date":"2018-08-09T20:06:27.852+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Fear the Kayn,realm=NA,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=0000000000000000,timestamp=2018-08-09T20:04:37.634+0000)\n>\n> His passive is his innate tankiness. Once he gets out of a fight he can regen his health very quickly. He doesn&#x27;t need an ability that passively gives him armor and MR, and can be activated to negate pretty much any damage/CC for like 5 seconds. It&#x27;s impossible to gank/lock him down him.\n\nbut you typically dont get out of a fight. when youre committing, then you usually cant just disengage. youre not jax or camille.\n\nhis passive is literally only relevant when hes already winning fights to be able to stay afterwards and push another wave or a turret. its literally the same as another champion healing up with lifesteal on a couple minions.\n\nin combat, his passive doesnt help him, and doesnt grant him any sustain whatsoever.\n\npre lvl 11 its barely more than other champions base health regeneration.\n","replies":[]}]}]}]}]},{"poster":"I NEED HEALlNG","date":"2018-08-09T20:16:01.361+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Jamaree","date":"2018-08-09T20:25:52.861+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=I NEED HEALlNG,realm=NA,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=0006,timestamp=2018-08-09T20:16:01.361+0000)\n>\n> Nope, you boards assholes said to just kite him so just kite him and let him be broken.\n\nBut you do just kite him, it is pretty easy to.","replies":[{"poster":"Critmaster Garen","date":"2018-08-09T20:30:07.197+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Jamaree,realm=NA,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=00060000,timestamp=2018-08-09T20:25:52.861+0000)\n>\n> But you do just kite him, it is pretty easy to.\n\nbe careful. youll get swarmed by people claiming that its impossible because he has a slow cleanse, and less than a second of tenacity on a 24 to 20 second cooldown.","replies":[{"poster":"Need Gold 4 Tent","date":"2018-08-09T20:47:09.865+0000","up_votes":1,"down_votes":0,"body":"to be fair though, IF the Garen is good, those skills will be used reactively rather than \"press when i want to kill someone\". He'll press W right before he steps on a cait trap, and Q as soon as her E hits for example, vs the longest range, safest adc. However, that's if the Garen is good, in which why shouldn't he do well?\n\nI do think phase rush removed a major weakness of his though like how it did to darius.","replies":[{"poster":"Critmaster Garen","date":"2018-08-09T20:48:51.732+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Need Gold 4 Tent,realm=NA,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=0006000000000001,timestamp=2018-08-09T20:47:09.865+0000)\n>\n> to be fair though, IF the Garen is good, those skills will be used reactively rather than &quot;press when i want to kill someone&quot;. He&#x27;ll press W right before he steps on a cait trap, and Q as soon as her E hits for example, vs the longest range, safest adc. However, that&#x27;s if the Garen is good, in which why shouldn&#x27;t he do well?\n> \n> I do think phase rush removed a major weakness of his though like how it did to darius.\n\nive played that game.\n\nif the cait is good, youll still run into the second trap before you get to her, and lose 50% of your health on the way.","replies":[]}]},{"poster":"Jamaree","date":"2018-08-09T20:37:33.017+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Critmaster Garen,realm=NA,application-id=3ErqAdtq,discussion-id=dIoJyWRz,comment-id=000600000000,timestamp=2018-08-09T20:30:07.197+0000)\n>\n> be careful. youll get swarmed by people claiming that its impossible because he has a slow cleanse, and less than a second of tenacity on a 24 to 20 second cooldown.\n\nYeah, I know but most of them are silver or below so their balance recommendations shouldn't be taken seriously.","replies":[]}]}]}]},{"poster":"rtbf223434721","date":"2018-08-09T21:18:08.092+0000","up_votes":4,"down_votes":1,"body":"> He's so overbearing with his silence + grasp proc.\n> If Garen goes ignite he has an insane amount of kill pressure more so than the average top laner that takes ignite because of Garen's R.\n\n\nI started to play this game before the juggernaut update.\nBefore that update Garen was STRONG and he could do everything u say he is doing now.\n\n> With a kit a simple as his when he's this strong it isn't healthy.\n\nIf its simple u need to conter play him. Mobility destroys him.","replies":[]},{"poster":"Critmaster Garen","date":"2018-08-09T19:48:27.378+0000","up_votes":5,"down_votes":2,"body":"garen is exactly as strong as he should be. no more and no less.\n\nmy guess is the tank buffs are going to change the meta around, and higher amounts of cc and less squishies for him to kill for shutdown gold will change the situation, and make his life a bit more difficult.\n\nbut until then, there is literally no reason to nerf him.","replies":[]},{"poster":"LeftyRaydy","date":"2018-08-09T18:04:35.069+0000","up_votes":6,"down_votes":5,"body":"They need to Gut his base damage ratios and remove his true damage on the Villain. Increase his AD scalling (by a little) and then please Destroy his base damage. He should not be able to build a specters cowl and do more DPS than me. don't get me wrong I dont think I should do more damage to him, but his damage needs to be nerfed hard.","replies":[]},{"poster":"MOLTinaTOR","date":"2018-08-09T20:01:16.282+0000","up_votes":1,"down_votes":0,"body":"Laughs in {{champion:83}}","replies":[]},{"poster":"JPLangley","date":"2018-08-09T19:58:10.866+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=ztVMib1T4T4","replies":[]}]}