{"poster":"El Bromaz","date":"2019-08-21T01:06:51.723+0000","title":"Servidor de LAS, cada vez mas injugable","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":0,"body":"Buenas gente como están? Yo bien, pero podría estar mejor si se pudiera jugar a este hermoso juego que me encanta que se llama Liga de las leyendas pero bueno como ven en el titulo ya se habrán dado cuenta que NO, NO SE PUEDE DISFRUTAR DE ESTE GRAN JUEGO, el servidor de LAS es una porquería tirando a lamentable no se cual de los 2 adjetivos le queda mejor es impresionante la cantidad de gente troll que te toca en las ranked y yo apenas estoy en PLATA III y quizás la mayoría dirán bueno si no carreas es porque no sabes jugar Y CLARO QUE NO SE JUGAR SI NUNCA SE PUEDE APRENDER A JUGAR con la cantidad de trolls que te tocan y para desgracia la mayoría son chilenos y no, no es xenofobia porque yo aprecio mucho a los chilenos tengo muchísimos amigos chilenos pero la realidad es esta y encima lo peor es que lo reportas y nunca hacen nada POR FAVOR HAGAN ALGO CON ESTE JUEGO, PREOCÚPENSE MAS POR SU COMUNIDAD Y NO TANTO POR EL COMPETITIVO. DESDE YA MUCHAS GRACIAS.\r\n\r\n UN JUEGO HERMOSO CON GENTE DE PORQUERÍA","replies":[{"poster":"Prince Y Pitto","date":"2019-08-21T01:32:58.826+0000","up_votes":1,"down_votes":0,"body":"Si no sales de tu division es porque no te dan las manos para subir, hecharle la culpa los trolls es de un jugador mediocre","replies":[{"poster":"Legate Lanius","date":"2019-08-23T15:33:34.067+0000","up_votes":1,"down_votes":0,"body":"Aquí un ejemplo promedio de jugador tóxico.","replies":[]},{"poster":"Delort","date":"2019-08-21T09:27:23.819+0000","up_votes":1,"down_votes":0,"body":"osea que esta bien ser troll segun vos? no le veo sentido a tu comentario","replies":[]},{"poster":"El Bromaz","date":"2019-08-21T02:11:26.402+0000","up_votes":1,"down_votes":0,"body":"Si claro porque es totalmente mi culpa que llegue gente a trollear y dar kills para que pierdas apropósito","replies":[]}]},{"poster":"Br1bkn","date":"2019-08-22T02:41:50.072+0000","up_votes":1,"down_votes":0,"body":"la wea fome wn qliao argentino xuxa tu mare\n\n\nBroma jajajajaja, que mal que mis compatriotas sean tan tóxicos, yo igual he notdo que salen mas chilenos tóxicos siendo que antes habían mas flamers argentinos xD, tienes que ignorarlos y no caer en su juego, mute y report muy simple, se que puedes llegar a oro &lt;3","replies":[]},{"poster":"xAlpha","date":"2019-08-21T06:52:19.663+0000","up_votes":1,"down_votes":0,"body":"te entiendo viejito porque lo viví y lo sigo viviendo. ya llegue a oro, pero me costo un huevo llegar por la gente asquerosa que te toca. \nse van afk, te trollean, etc, pero es lo que nos proporciona este jueguito y su sistema de baneos que es un desastre. pero ojo si lo haces vos pum baneo sin pensarlo, mientras que los otros son re intocables... \ncomo dije en un post anterior, hay que masticar la bronca del momento y seguir para adelante porque este tema no se va a solucionar hasta que uno de riot se ponga los pantalones y empiece a tomar las medidas correspondientes para esa gente toxica que arruina tanto a la comunidad como al juego.","replies":[{"poster":"El Bromaz","date":"2019-08-21T23:48:09.743+0000","up_votes":1,"down_votes":0,"body":"Si bro ayer de la bronca dije bah no juego mas ranked pero no, es imposible es que me encanta jugar y mejorar ayer escribi el post este porque estaba re caliente porque mira si fuese algunas partidas no pasa nada porque es algo normal que entre gente a molestar pero es todas las partidas lo mismo y ya te saca del quicio mas encima con gente como el Prince Y Pitto que viene y defiende a los trolls con comentarios super toxicos como que me faltan manos","replies":[]}]},{"poster":"OTP YI CHILE","date":"2019-08-21T01:15:25.852+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=M Y T H R A X,realm=LAS,application-id=PJAKt7ph,discussion-id=l9olTxgl,comment-id=,timestamp=2019-08-21T01:06:51.723+0000)\n>\n> Buenas gente como están? Yo bien, pero podría estar mejor si se pudiera jugar a este hermoso juego que me encanta que se llama Liga de las leyendas pero bueno como ven en el titulo ya se habrán dado cuenta que NO, NO SE PUEDE DISFRUTAR DE ESTE GRAN JUEGO, el servidor de LAS es una porquería tirando a lamentable no se cual de los 2 adjetivos le queda mejor es impresionante la cantidad de gente troll que te toca en las ranked y yo apenas estoy en PLATA III y quizás la mayoría dirán bueno si no carreas es porque no sabes jugar Y CLARO QUE NO SE JUGAR SI NUNCA SE PUEDE APRENDER A JUGAR con la cantidad de trolls que te tocan y para desgracia la mayoría son chilenos y no, no es xenofobia porque yo aprecio mucho a los chilenos tengo muchísimos amigos chilenos pero la realidad es esta y encima lo peor es que lo reportas y nunca hacen nada POR FAVOR HAGAN ALGO CON ESTE JUEGO, PREOCÚPENSE MAS POR SU COMUNIDAD Y NO TANTO POR EL COMPETITIVO. DESDE YA MUCHAS GRACIAS.\n> \n>  UN JUEGO HERMOSO CON GENTE DE PORQUERÍA\n\nEl elo en el que estas es en el que te mereces estar.\n\nPrueba a jugar con Yi de jungla, te puede sacar fácil de plata. Yo soy only yi y soy diamante 3 solo jugando con este campeón.","replies":[]}]}