{"poster":"Misses Old Talon","date":"2017-08-12T02:34:33.451+0000","title":"Why does everyone orgasm at the thought of urf?","subforum":"Gameplay","up_votes":18,"down_votes":10,"body":"I just don&#039;t understand what the appeal is. I&#039;ve been playing League WELL before Urf ever existed, and to this day I&#039;ve only played it 5 times total and I&#039;ve hated every game of it. I used to just pick Yasuo, so I can handicap myself and make it a little fun, but then because of tryharding babies that don&#039;t realize its a **JOKE** mode, Riot made it all random. Can someone PLEASE explain the appeal of just spamming your keyboard blindly? It&#039;s just boring and repetitive. Theres no sense of reward for outplaying an opponent. And now due to all random, you can&#039;t even get a champion you find fun. Youre forced to play bullshit thats either Broken, or mediocre.","replies":[{"poster":"CamilleRule34","date":"2017-08-12T02:36:05.482+0000","up_votes":8,"down_votes":0,"body":"i have a fetish for manatees","replies":[]},{"poster":"WyvernEgg","date":"2017-08-12T02:38:20.008+0000","up_votes":3,"down_votes":1,"body":"Lol you're bad if you blindly spam your keys.","replies":[{"poster":"Misses Old Talon","date":"2017-08-12T05:07:33.520+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=WyvernEgg,realm=NA,application-id=3ErqAdtq,discussion-id=LpiUEmxA,comment-id=0001,timestamp=2017-08-12T02:38:20.008+0000)\n>\n> Lol you&#x27;re bad if you blindly spam your keys.\n\nYou're an idiot if you think anyone can be bad in a joke game mode, and probably tryhard in it.","replies":[{"poster":"WyvernEgg","date":"2017-08-12T06:36:51.584+0000","up_votes":4,"down_votes":0,"body":"oooooh \"idiot\" great insult. Totally got me. Oh no whatever will I do now. I guess I'll just go cry in this corner over here. Boo hoo.","replies":[{"poster":"Pumping Iron","date":"2017-08-12T09:41:36.660+0000","up_votes":1,"down_votes":0,"body":"lmao","replies":[]}]},{"poster":"Wimbledofy","date":"2017-08-12T09:57:51.166+0000","up_votes":2,"down_votes":0,"body":"It's a video game, not just a video. If you didn't try it wouldn't be a game. Imagine playing basketball against someone that was throwing the ball in the complete opposite direction of the hoop, that sure sounds fun","replies":[]},{"poster":"HellSingsDOG","date":"2017-08-12T11:04:07.272+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Misses Old Talon","date":"2017-08-13T08:33:21.876+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=HellSingsDOG,realm=NA,application-id=3ErqAdtq,discussion-id=LpiUEmxA,comment-id=000100000002,timestamp=2017-08-12T11:04:07.272+0000)\n>\n> got forbid we &quot;Tryhard&quot; to win a game that takes 15-30 mins + moron....\n\n1.Don't mispell god and then call someone a moron. \n2.Urf takes on average 15 minutes.","replies":[]}]}]}]},{"poster":"Forbidden Siren","date":"2017-08-12T06:03:53.311+0000","up_votes":2,"down_votes":0,"body":"It's a game mode that's meant for chaotic fun. Everyone won't like the same thing and that's fine. If you don't like it, no one is forcing you to play it.","replies":[]},{"poster":"Aptest","date":"2017-08-12T05:58:25.380+0000","up_votes":2,"down_votes":1,"body":"Because Urf allows players to ignore two things they secretly hate: resource management and cooldowns. \n\nYasuo is a direct descendant of URF as an experimental platform.","replies":[]},{"poster":"Volphi","date":"2017-08-12T12:08:13.512+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Misses Old Talon","date":"2017-08-13T08:37:39.820+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Volphieus,realm=EUNE,application-id=3ErqAdtq,discussion-id=LpiUEmxA,comment-id=0011,timestamp=2017-08-12T12:08:13.512+0000)\n>\n> Crying little kid doesn&#x27;t realize it&#x27;s no longer a joke mode and tryharding is fun for some people.\n> \n> Not for everyone.\n> \n> What?\n> \n> Because most of people would just pick broken champs.\n\nIts almost like Urf was supposed to be a April fools joke, where everyone was broken and you could use who ever you wanted to have fun, and then little babies that find randomly mashing keys fun ruined it by trying to tryhard and find whats over powered.","replies":[]}]},{"poster":"underscores222","date":"2017-08-12T07:55:27.713+0000","up_votes":1,"down_votes":0,"body":"I admit I've found the mode less and less fun each time it's come up.  The first time... it was a blast.  No one knew anything, it was always \"who else would be stupid on this?\"\nThe second time, people had found the broken champs and made it go from a fun mode to \"oh look, ANOTHER hecarim/shaco/wukong/etc\"\n\nThe random bit was nice, but the novelty of the game mode wore off - it can never be as fun because the first time it broke all the rules and no one knew how to handle it.","replies":[{"poster":"Leetri","date":"2017-08-12T08:39:30.586+0000","up_votes":1,"down_votes":0,"body":"People figured out the broken stuff within a day. Riot even had to permaban those champions towards the end of the event because no one played anything else.","replies":[{"poster":"underscores222","date":"2017-08-12T16:24:41.086+0000","up_votes":1,"down_votes":0,"body":"While true, it wasn't on the level of seeing the same 5 or so champs in every game.  People were still mostly playing for fun.","replies":[{"poster":"Leetri","date":"2017-08-13T08:52:48.451+0000","up_votes":1,"down_votes":0,"body":"I don't know, I saw at least a Hecarim and Sona every single game.","replies":[]}]}]}]},{"poster":"TheDevice","date":"2017-08-13T08:24:45.295+0000","up_votes":1,"down_votes":0,"body":"It's a spoof mode. It's loosely balanced. There's no ranking. There is no consistency to the availability of the mode to allow for people to develope any kind of resonating strategy. It's a spam fest for the lol's. \n\nAnyone tryharding/raging at this mode have issues. It doesn't even make sense to tryhard. Half your opponents are not even trying hard and are just having fun. This automatically nullifies any sense of competition. \n\nIts like some dude crashing a party when they're playing a silly ass game of hungry hungry hippos or some mindless equivalent and talking shit and getting up in their faces. Nobody cares. Its a silly ass game lol","replies":[]},{"poster":"PACIFlC MALL","date":"2017-08-13T04:06:24.198+0000","up_votes":1,"down_votes":0,"body":"I never really saw the appeal, played it once 3 years ago, never played it since.","replies":[]},{"poster":"Lovelle II","date":"2017-08-12T16:27:29.607+0000","up_votes":1,"down_votes":0,"body":"I don't like URF either, but that may be because none of the champs I play are any good there. I'm not good enough at this game to play champs randomly either.","replies":[]},{"poster":"bàn","date":"2017-08-12T06:38:22.027+0000","up_votes":2,"down_votes":2,"body":"Because it lets them pretend that they're good at the game.","replies":[{"poster":"GayFluffyUnicorn","date":"2017-08-12T13:57:04.806+0000","up_votes":1,"down_votes":0,"body":"This^\nthe downvotes just proof the point. \nThe pathetic tryhard in this gamemode is even worse.","replies":[]}]},{"poster":"ˉˉˉˉˉˉ","date":"2017-08-12T08:43:49.977+0000","up_votes":1,"down_votes":0,"body":"What about One For All Mirror Mode?","replies":[]},{"poster":"Deraviin","date":"2017-08-12T07:11:07.551+0000","up_votes":1,"down_votes":0,"body":"I don't like it either but all my friends do. Most of them see it as fun and meaningless while I struggle to deal with how ridiculous and boring it is. I think its the same reason I couldn't really get into HOTS, I actually enjoy all the resource managing, scanning for enemies, choosing what to build (because it actually matters unlike urf where you either build all ap or all ad and the same like. five item sets.) income and spell building etc and focus on objectives and avoid meaningless fights.... and a lot of people actually don't like that so much.  They just want to wham bam jam fight every second and try to come out alive.","replies":[]},{"poster":"Feed Daddy","date":"2017-08-12T07:06:51.288+0000","up_votes":1,"down_votes":0,"body":"I just went 21/2 on rumble and I can tell you URF is a blast. I like that you can cast stuff while he's supposed to be silenced and just have bonus AP ratios on everything constantly and use ur 20 second ult for waveclearing . Its balanced mkay.","replies":[]},{"poster":"Gelmous","date":"2017-08-12T07:03:57.515+0000","up_votes":1,"down_votes":0,"body":"what do you mean \"everyone\" ?","replies":[]},{"poster":"hhaavviikk","date":"2017-08-12T06:50:47.968+0000","up_votes":1,"down_votes":0,"body":"for the same reason players like spamming their keyboards when playing riven, it's fun","replies":[]},{"poster":"Mysticman89","date":"2017-08-12T05:48:35.672+0000","up_votes":1,"down_votes":0,"body":"Don't really care for urf. Like ARURF better since I enjoy the silliness of trying to make unconventional comps work, but since it's still URF it's just a silly never ending deathmatch of people all in-ing every few seconds.","replies":[]},{"poster":"MagicFlyingLlama","date":"2017-08-12T03:41:32.023+0000","up_votes":1,"down_votes":0,"body":"> just pick Yasuo\n\nThis is why you hated it. Yasuo is so awful in URF (especially original URF) it is a form of self-punishment.","replies":[{"poster":"Misses Old Talon","date":"2017-08-12T05:07:00.673+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=MagicFlyingLlama,realm=NA,application-id=3ErqAdtq,discussion-id=LpiUEmxA,comment-id=0003,timestamp=2017-08-12T03:41:32.023+0000)\n>\n> This is why you hated it. Yasuo is so awful in URF (especially original URF) it is a form of self-punishment.\n\nI guess you missed the part where I said I picked him to enjoy it. Spamming shit blindly is garbage. Yasuo actually makes you require some form of thought pattern in the garbage mode.","replies":[]}]},{"poster":"Miror B","date":"2017-08-12T02:38:26.064+0000","up_votes":1,"down_votes":0,"body":"I don't just orgasm at the thought of urf, I think outside the box and orgasm at the thought of people orgasming at the thought of urf.\n\nAs for the actual topic, I'm under the assumption it's because URF essentially allows you to \"exploit\" and enjoy all the broken features with certain characters in a controlled environment. Karthus players can enjoy his ulti on a ridiculously low cooldown, mobile characters like riven/lucian can try to perma-kite enemies. Hell, even TF players can go for infinite q spam with rylai's and gank three lanes simultaneously. While broken characters do exist in the game, URF shifts the focus so that all characters are theoretically \"broken\" making it a much more fair environment.","replies":[]},{"poster":"Ariel the Cruel","date":"2017-08-13T07:02:59.753+0000","up_votes":1,"down_votes":1,"body":"Because Riot has conditioned people to love SR unconditionally. Which means SR clones are likewise loved unconditionally.\nSheep are as sheep do.\nAnd to hell with other game modes that Riot will neglect and ignore anyways.","replies":[]},{"poster":"Academy Kayn","date":"2017-08-12T05:52:54.488+0000","up_votes":1,"down_votes":1,"body":"I'm gonna admit too, URF just doesn't have the same feeling as previous years. Even with the randomness, I think I've just grown to dislike losing because other people getting luckier. The feeling probably comes from Magic Drafts.","replies":[]},{"poster":"King of TroIIs","date":"2017-08-12T05:30:13.859+0000","up_votes":1,"down_votes":3,"body":"URF is actually better balanced in terms of game length, income and attackspeed. The cooldowns are a bit excessive, if it were like 70% CD and 25% original mana costs it could replace normal league play entirely.","replies":[]}]}