{"poster":"Raystlin82","date":"2018-03-02T19:08:25.981+0000","title":"wen ganken die jungler?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":1,"body":"also ganken ist ja wohl jetzt ein ausdruck ohne den man in lol nicht auskommen. aber was bedeutet ganken? eine genaue uebersetzung hab ich nicht gefunden. es scheint sich hierbei um englischen slang zu handeln.\r\n\r\nalso, wir haben jetzt zb. nasus top in unserem team und darius top im gegnerischen team. wir haben kha jungler und gegnerischer jungler ist rengar. so, und jetzt die quiz frage:\r\n\r\nwen ganked kha?\r\n\r\na) kha ganked darius\r\nb) kha ganked nasus\r\nc) weder noch","replies":[{"poster":"Hakkuu","date":"2018-03-02T19:32:50.637+0000","up_votes":2,"down_votes":0,"body":"Kha ganked Darius ODER Kha ganked Toplane ODER Kha ganked für Nasus.\n\nKha ganked Nasus ist auf jeden Fall falsch (auch wenn es da keinen Duden gibt lol). Schließlich beschwert man sich ja darüber, \"geganked zu werden\" - also dass der Gegner Jungle vorbeischaut. Daraus ergibt sich, dass das wort \"ganken\" sich auf den Gegner bezieht und nicht auf den Teammate.","replies":[]},{"poster":"SuicidePlank","date":"2018-03-02T19:19:15.269+0000","up_votes":1,"down_votes":1,"body":"Was?","replies":[{"poster":"Durkheim ","date":"2018-03-02T19:26:00.454+0000","up_votes":2,"down_votes":1,"body":"Es geht hier offenbar nicht um das tatsächliche Spielszenario sondern darum, wie man das ausdrückt. Einfach gesprochen: wie man es sagt? Würdest du sagen, dass dein Junger deinen Toplaner gankt oder gankt er den Gegner? \n\nIch würde sagen, dass er die Lane gankt.","replies":[]}]},{"poster":"KIabusterbeere","date":"2018-03-03T00:37:32.026+0000","up_votes":1,"down_votes":0,"body":"l","replies":[]},{"poster":"Oriius","date":"2018-03-02T22:39:49.206+0000","up_votes":1,"down_votes":0,"body":"Ganken ist vorallem ein Ausdruck für den Jungler. Der Jungler hat die Aufgabe Gegnerische Lanes in einem verwundbaren Moment zu überraschen.\n\nGank ist eigentlich ein taktischer Kampfstil wo man bewusst Gegner benachteiligt und einen fast aussichtslosen Kampf eröffnet für den Gegner. Das gleiche ist es in dem Sinne auch in League wobei hier ein Gank bedeutet das man konkret eine kurzzeitige Überzahlsituation erschafft und sich dadurch massive Vorteile ergattert. Da hier aber ein Gank oft fehlschlagen kann wird die Theorie des aussichtslosen Kampfes wieder zunichte gemacht. \n\nSprich wenn du als Jungler einfach sagen wir mal deine Botlane bei einem Kill unterstützt dann ist es ein Gank. Du hast eine kurzzeitige überzahlsituation erschaffen und den Gegner extrem benachteiligt. \n\n\nParallel zum Ganken gibts noch das Roamen. Das ist im Prinzip nichts anderes als ein Gank im weitesten Sinne außer das dieser Begriff für alle anderen  Lanes benutzt wird.\n\nHier gibt es kleine Unterschiede\n\n1. der Roam hat meistens den Sinn Objectives zu forcen. Objectives stellen hier gewisse Objekte dar die in jedem Fall einen starken, globalen Spielvorteil verschaffen. Türme Drachen oder Herald/Baron sind damit gemeint.\n\n2. Die meisten Roams verfolgen ein bestimmtes Ziel , jedoch muss ein Roam nicht immer das Ziel haben auf eine verbündete Lane zu landen. ein Roam findet immer statt wenn du deine ursprüngliche Route verlässt (base zur lane)\n\n3. die meisten Roams geschiehen von Top zu Mid , von Mid zu Bot/Top oder von Bot(supporter) zu Mid. Im Falle das der Toplaner  Teleport besitzt spricht man auch von einem TP-Roam. \n\n4. Während Jungler aufs Ganken ausgelegt sind und somit sich Vorteile im Jungle verschaffen ,haben Roam´s im Jungle keine Vorteile. Sie können daher meist leichter abgefangen werden und können sich nicht so effektiv verteidigen. \n\n5. Während der Jungler oft \"Unsichtbar\" für die Gegner ist kann man einen roam sehr leicht erkennen. Daher ist ein Roam oft abschreckend zu werten.\n\n6. Es gibt spezielle Champs vorallem häufig Midlaner die spezielle Roamfähigkeiten besitzen um schnell auf andere Lanes zu gelangen ohne in der Zeit erkannt zu werden. Beispiel wäre hier die Twisted Fate Ultimate während Jungler diese Möglichkeit oft nicht haben. Jungler müssen oft eine wesentlich längere Strecke zurücklegen haben es aber einfacher die Gegner festzuhalten da Jungler meist viel CC mit sich bringen der den direkten Tod des Gegners bedeutet.","replies":[]},{"poster":"Amycos Cyrus","date":"2018-03-02T22:26:03.959+0000","up_votes":1,"down_votes":0,"body":"Hier eine einfach Darstellung: https://de.wikipedia.org/wiki/Ganker_(Computerspiel)\n\nNach ihr gankt man immer das Opfer, da man als ganken nicht nur das in LoL als ganken bezeichnete 2v1 durch Jungler bezeichnet.","replies":[]},{"poster":"Schokohörnchen","date":"2018-03-02T20:45:45.878+0000","up_votes":1,"down_votes":0,"body":"Sie laufen eventuell über die Lane und machen Sachen wie Minions klauen oder Kills :>","replies":[]},{"poster":"RaupiNimmersatt","date":"2018-03-02T20:26:07.604+0000","up_votes":1,"down_votes":0,"body":"Hi,\n\nGanken kommt ursprünglich aus anderen spielen und bezieht sich darauf das eine grössere Anzahl eine kleinere vernichtet. Gank = Gang Kill\nDaher ergibt sich das Personen x Person y gankt. Allerdings wenn du den Vorgang an sich meinst das eine grössere Gruppe eine Lane überfällt und dort einen Gruppenkill erzielt kann man denke ich guten gewissens sagen das eine Lane auch gegankt werden kann. \n\nLg\n\nRaupi\n\nP.s: da du dich scheinbar echt für die Thematik interessierst ist es auch gankt und nicht ganked. Die deutsche Sprache hat die merkwürdige Möglichkeit Wörter anderer Sprachen nach deutschen Regeln zu konjugieren oder deklinieren. Soll kein flame sein nur ne Erklärung falls es dich interessiert :-D","replies":[]},{"poster":"Raystlin82","date":"2018-03-02T19:26:56.132+0000","up_votes":1,"down_votes":0,"body":"na ja, eigentlich gings mir nur um das objekt. ich bekomm im spiel andauernd zu lesen, dass der jungler den eigenen team-kollegen ganken soll. das klingt so komisch. jetzt will ich's halt genau wissen. vielleicht bin ich ja der dumme, wenn ich sage, dass der jungler den gegner ganked und nicht das eigene teammitglied.","replies":[{"poster":"Enderized","date":"2018-03-02T20:17:05.758+0000","up_votes":1,"down_votes":0,"body":"Das liegt daran, dass mit der Aussage ''Gank <Teammate>'' diese zum Ausdruck bringen wollen, dass du <Teammate>{{'s Lane}} Ganken sollst.\nErgo den Gegner von deinem <Teammate>","replies":[]}]},{"poster":"Yingar","date":"2018-03-02T19:54:14.382+0000","up_votes":1,"down_votes":0,"body":"man ganked eine lane und keinen champion meines erachtens","replies":[]},{"poster":"Durkheim ","date":"2018-03-02T19:16:22.332+0000","up_votes":1,"down_votes":0,"body":"Nun, keine der Optionen. \n\nDas Blickfeld des gemeinen Nasusspielers beschränkt sich in den meisten Fällen auf die Minions, um möglichst schnell zu stacken. Aus diesem Grund wird Kha wohl Darius wohl nicht ganken, da er gewisse Nachteile hat. \n\nAus diesem Grund ist es sehr unrealistisch und die Frage nicht relevant. \nEs besteht allerdings die Möglichkeit, dass Nasus von Rengar gegankt wird.","replies":[]},{"poster":"Dr Madscientist","date":"2018-03-02T19:11:31.336+0000","up_votes":1,"down_votes":2,"body":"Im zweifelsfall die Midlane.","replies":[]}]}