{"poster":"Buen Fazo","date":"2016-05-16T22:37:25.241+0000","title":"Practicar un champ en NORMAL - Es legal?","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":6,"body":"Esto es algo que me pasa seguido. \r\n\r\nCuando quiero practica un champ, hago lo siguiente paso. \r\n\r\nBusco runas y maestrias. veo alguno gameplay y luego me creo una personalizada para ver como funcionan las habiliades del campeon, cuando estoy familiarizado entro a jugar una Normal y hasta donde puedo llegar. Si no me adapto lo dejo de lado y digo este champ no es para mi. \r\nAhora cuando me tocan gente que entra en normal y se pone a practicar un campeon que nunca uso, y da mucho asco. Pero lo mas molesto es que feedea al rival y dice, decir que es la primera vez que lo usa. Yo puedo usar un campeon por primera vez, pero no por eso voy a fidear mi linea como troll. \r\nSe puede reportar a ese tipo de gente? O esta cubierto, por el, es mi primera vez con el campeon. \r\n\r\nGG WP: \r\n\r\nSALUDOS:","replies":[{"poster":"Yrox the Third","date":"2016-05-16T22:38:39.179+0000","up_votes":5,"down_votes":0,"body":"Es distinto no saber usar a un personaje que alguien quiera arruinar la partida dandole ventajas al enemigo como muertes intencionales o cosas asi.","replies":[{"poster":"Buen Fazo","date":"2016-05-16T22:47:13.453+0000","up_votes":1,"down_votes":7,"body":"eso mismo paso, pero lo unico que leo, es que jutifican su mala partida por ser su primera partida con ese campeon. Fideo pero todo lo justifican por ser su primera vez. \nY el reporte RIot se lo pasa por el medio del culo, ya que le importa un huevo esos tipo de reporte.","replies":[{"poster":"Yrox the Third","date":"2016-05-16T22:52:32.425+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Buen Fazo,realm=LAS,application-id=PJAKt7ph,discussion-id=u8OQqJis,comment-id=00000000,timestamp=2016-05-16T22:47:13.453+0000)\n>\n> eso mismo paso, pero lo unico que leo, es que jutifican su mala partida por ser su primera partida con ese campeon. Fideo pero todo lo justifican por ser su primera vez. \n> Y el reporte RIot se lo pasa por el medio del culo, ya que le importa un huevo esos tipo de reporte.\n\nPuedes reportarlo, y se acumula muchos de estos reportes SERÁ baneado.","replies":[]}]}]},{"poster":"Nombre ofensivo","date":"2016-05-16T22:41:40.907+0000","up_votes":4,"down_votes":0,"body":"mientras intentes ganar no veo el inconveniente","replies":[]},{"poster":"Excorpion","date":"2016-05-16T23:16:03.482+0000","up_votes":1,"down_votes":0,"body":"Normales esta hecho para eso, practicar\nAunque hayas entrenado en bot, a maxima dificultad 100 veces\nno se compara con los niveles de pvp solo porque uno es maquina (patrones siempre iguales)\ny otro es humano (nunca sabes que haran)\n\nNo es ilegal jugar con un campeon nuevo en normales\npuede irle demasiado mal a alguien\npero la idea es enseñarle\nSi te dedicaste a insultarlo en vez de aconsejarlo, no eres quien para criticarlo\nPero si fue al reves, ni siquiera deberias estar preguntando esto","replies":[{"poster":"Buen Fazo","date":"2016-05-17T00:21:25.659+0000","up_votes":1,"down_votes":2,"body":"Aconsejar? \nAmigo yo antes de usar un champ en normal, busco toda la iformación posible para evitar perjudicar a el team. \nSi tu mentalidad es entrar a jugar con un champ sin antes saber como funciona, es porque eres un maldito troll. \nAdemas dejame decirte que esta gente, mas que practicar entra a feedear al rival. porque no dejand e dar kill tras kill.","replies":[{"poster":"Excorpion","date":"2016-05-17T00:36:47.228+0000","up_votes":2,"down_votes":0,"body":"Ser un maldito troll y jugar para ganar aunque pierdas...\nSi crees que son lo mismo estas muy mal...\nClaro que no defiendo a los trolls, pero no todos son así\nEsa gente que pide ayuda, te hace caso y espera que lo gankees, son respetable o no ?\no acaso porque no saben jugar hay que perjudicarlos y llamarlos \"Malditos trolles\"\n\nAcaso tu naciste como un super jugador ?\nnunca tuviste una mala partida donde el liner enemigo te haya countereado aunque hayas jugado bien ?","replies":[{"poster":"Maedme","date":"2016-05-17T01:19:13.278+0000","up_votes":1,"down_votes":0,"body":"Estás hablando con un conductista.","replies":[{"poster":"Excorpion","date":"2016-05-17T01:42:14.900+0000","up_votes":1,"down_votes":0,"body":"_comentaro erroneo borrado No habia notado que era otra persona quien respondio_","replies":[]}]}]}]}]},{"poster":"AresC","date":"2016-05-16T22:42:37.522+0000","up_votes":3,"down_votes":2,"body":"Sí, de hecho también lo es hacerlo en clasificatorias, no hay ninguna regla que lo impida siempre que busques la victoria.","replies":[]},{"poster":"Sir Crucifix ","date":"2016-05-16T22:42:32.872+0000","up_votes":2,"down_votes":1,"body":"NO","replies":[]},{"poster":"Maedme","date":"2016-05-17T01:16:57.854+0000","up_votes":1,"down_votes":0,"body":"Quien te crees que sos para reportar gente que prueba champs en normales? O.e Si vos querés competencia anda a rankear ahí si te podes quejar de todo y vas a estar en lo cierto, pero en normales no.\nTenes que entender que fedear al rival NO es sinónimo de trolear, trolear es hacerlo con intención.","replies":[{"poster":"Buen Fazo","date":"2016-05-17T23:55:14.265+0000","up_votes":1,"down_votes":3,"body":"a sos uno de esos niños rata que entra a normal para perjuciar a los team.\n\nYo sigo un protocolo antes de usar un champ en normal o ranked. Y es saber y practicar al champ en otros ambitos que no sea en normal. \n\nSi lo usara, jugaria de una forma de evitar dar kill al rival. \n\nMe creo que soy capas de tener un mejor desempeño con un champ, que tu, ya que por lo visto no eres mas que un niño rata.","replies":[]}]},{"poster":"BERT1","date":"2016-05-16T23:48:32.705+0000","up_votes":1,"down_votes":0,"body":"En normal relajate y cagate de la risa xd y en ranked .... no hay solucion.","replies":[]}]}