{"poster":"Pilze","date":"2018-08-16T12:39:16.802+0000","title":"Kleiner Dank.","subforum":"Spielerverhalten & Moderation","up_votes":7,"down_votes":2,"body":"Ich will mich hier mal bedanken an den Leuten im Forum das man in der letzten Zeit richtig gut Diskussionen gef&uuml;hrt hat. Ganz ohne Beleidigungen oder der Gleichen, ich hoffe das es weiter hin so bleibt.","replies":[{"poster":"Noxempire","date":"2018-08-16T14:25:04.344+0000","up_votes":2,"down_votes":0,"body":"Selbiges kann ich nur zurückgeben. \n\nJeder soll seine Meinung hier vertreten und verteidigen dürfen. \n\nIch hoffe Mal dass ist keine Ironie.","replies":[{"poster":"Pilze","date":"2018-08-16T14:41:48.777+0000","up_votes":3,"down_votes":1,"body":"Nein, ich meine das ehrlich. In der letzten Zeit kann man mit einigen richtig gute Diskussionen führen. Aber schon komisch das der Thread kaum Beachtung findet. Wurde ich jetzt was negatives schreiben, wäre in kürze 20 Post. {{sticker:zombie-brand-clap}}","replies":[{"poster":"Alpacana","date":"2018-08-16T14:52:26.702+0000","up_votes":2,"down_votes":0,"body":"Ein Forum ist da um zu dikutieren :)\nErwartest du jetzt 15 Antworten die alle sagen \"Ja, das finde ich auch\"?\nIch denke viele (die meisten) stimmen dir einfach mit diesem Post zu.\nIch persönlich kann mich da nur anschließen, ich mag auch Diskussionen, die ohne Beleidigungen vonstatten gehen, aber was genau soll ich jetzt zu deinem Post schreiben?^^","replies":[{"poster":"Pilze","date":"2018-08-16T15:26:38.414+0000","up_votes":2,"down_votes":2,"body":"Gut ne. Man weiß auf positives gar nicht mehr antworten zu geben, reine Gewohnheit und komplettes abstumpfen. \nNe war von mir nur ein Dank. Ich erwarte gar nichts, was auch? Gut, euer Geld würde ich natürlich nehmen, bin ja kein Unmensch.","replies":[{"poster":"dugg","date":"2018-08-17T08:01:39.745+0000","up_votes":2,"down_votes":0,"body":"Hihi, die Ironie dieses Themas finde ich gerade witzig.\n\nDu lobst eindrücklich die Diskussionsfreude der Mitwirkenden, \"beschwerst\" dich gleich im nächsten Post aber über die fehlende Diskussionsfreude. ;) Absicht?\n\nWas erwartest du, dein Dank bietet halt wenig Diskussionsstoff. Mich freut es, dass du dies so siehst und deinem positiven Fühlen Ausdruck verleihst.","replies":[{"poster":"Pilze","date":"2018-08-17T08:06:42.108+0000","up_votes":1,"down_votes":1,"body":"Jetzt bin ich raus, wo beschweren ich mich? Das war eine Feststellung nichts weiter, ist wirklich so das man über positives sehr schwer reden kann. Ob das jetzt abstumpfen  ist oder etwas anderes.\nSollte ich mich mal beschweren dann wirst du es ohne jeden Zweifel verstehen und werde ich auch deutlicher. Bin für durch die Blume oder Bockigkeit etwas zu alt, gehe dann den direkten Weg.","replies":[{"poster":"dugg","date":"2018-08-17T08:13:41.051+0000","up_votes":1,"down_votes":0,"body":"Von \n> Ich will mich hier mal bedanken an den Leuten im Forum das man in der letzten Zeit richtig gut Diskussionen geführt hat. Ganz ohne Beleidigungen oder der Gleichen, ich hoffe das es weiter hin so bleibt.\n\nzu\n> Aber schon komisch das der Thread kaum Beachtung findet.\n\nIch fand den Widerspruch bloß witzig. Daher auch das Wort \"beschwerst\" in Anführungszeichen. Mir ist bewusst, dass es sich lediglich um eine Feststellung deinerseits gehandelt hat. Dieser **kleine** Widerspruch erreicht bloß gerade mein Humorzentrum.\n\n# nooffense\n\nP.S.: Wenn du schon draußen bist, kannst du dann bitte den Rasensprenger anstellen. Danke schön.","replies":[{"poster":"Pilze","date":"2018-08-17T08:15:45.672+0000","up_votes":1,"down_votes":0,"body":"Wollte es nur mal gesagt haben. Habe mich mal beim Support beschwert, ich glaube die schreiben mir nie wieder.","replies":[{"poster":"eingew","date":"2018-08-17T09:02:29.781+0000","up_votes":1,"down_votes":0,"body":"Zwei Stunden nach Eröffnung des Thread hätte ich persönlich noch nicht die große Reaktion erwartet. Ich zB schaue bloß einmal am Tag ins Forum und ich denke mal damit bin ich nicht unbedingt alleine.","replies":[{"poster":"Mjölnir Kind","date":"2018-08-17T09:13:11.443+0000","up_votes":1,"down_votes":1,"body":"Nein Nein, da kann ich nicht mitreden mit meinen alle 10 Minuten ins Forum gehen, oder wenn ich in LoL warte bis ich Respawn xD","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Shacoláde","date":"2018-08-17T05:50:17.845+0000","up_votes":2,"down_votes":0,"body":"zu viel des Lobes, danke ;)\n\nhttps://media.giphy.com/media/l4FGBOiHtpxQQocRW/giphy.gif","replies":[]}]}