{"poster":"wazaco","date":"2016-04-10T22:58:15.433+0000","title":"Ayuda - Existe alguna manera de hacer rendir Janna mid ?","subforum":"Charlas Generales","up_votes":4,"down_votes":1,"body":"Nada eso, digamos que podes farmear, si te haces full ap pegas un poquitoooo, pero hay alguna manera de posta hacerla rendir, digamos vamos! sona puede ir tranquilamente mid, en cambio janna no pega ni la mitad :s, la pregunta basicamente es para poder hacerla rendir, que items creen que se deberia sacar?  \n\n PD: que copado q quedo este splash art :3 \nhttp://imgur.com/mWprZnW","replies":[{"poster":"lordeman10","date":"2016-04-10T23:36:23.904+0000","up_votes":3,"down_votes":0,"body":"lo primero que se me viene a la cabeza es \"para que\" pero a ver imaginar\n\nte ayudo a razonar la build\n\nNo es un mago que necesite mantenerse en pelea o que necesite mucho mana, por lo que descartamos la vara de las edades y el arcangel, como su daño no es constante un morello no sería muy efectivo por lo tanto para mantenernos con mana armaríamos el caliz {{item:3174}} \n\nen las botas podrías probar armar las de cdr también pero lo más lógico se me hace {{item:1311}}  (el enchant cuando ya estés full build) \n\nes un campeón sin dash y que su jugabilidad se basaria en hostigar a la distancia con los tornados por lo que un buen primer item podría ser {{item:3285}} \n\ndefensivo, contra asesinos por ejemplo {{item:3157}} , o te vas por un{{item:3116}} (contra blanditos) {{item:3151}} (contra tanques)  mas que nada porque no vas a sacar vida de ningún lado sino\n\n{{item:3092}}  te serviria mucho para tener una buena iniciación lo podrías reemplazar por el caliz\n{{item:3165}}  sacalo en lugar del caliz si hay enemigos con regeneración de vida como vladi o trynda\n\nofensivo, {{item:3100}} {{item:3089}}  el liche sería muy efectivo junto a la E además que te ayuda a tomar objetivos, la verdad nunca la jugué ap pero también podrías probar si funciona {{item:3115}} \n\n{{item:3027}}  Muy dificil de armar y stackear y no te da atributos que janna aproveche\n{{item:3003}}  Lo mismo, está bueno pero para janna los otros item cubren todas las sircunstancias donde puedas necesitarlo\n{{item:3135}}  Este no está mal podrías probar armarlo después de tener los item principales\n{{item:3001}}  no, no tenés daño en corta distancia con lo que sería totalmente inutil\n\nde nuevo, no creo que sea viable janna mid pero tampoco la he probado, ponele que algún día se vuelva fuerte te la van a nerfear antes de que te enteres, porque no está diseñada para hacer daño","replies":[{"poster":"wazaco","date":"2016-04-11T00:43:37.996+0000","up_votes":4,"down_votes":0,"body":"gracias por tanto laburo!!! es posta un buen comentario, voy a probar con caliz y ecco + botas de red de enfriamiento para comezar, despues vere, seguro voy a probar liche que uno de abajo dijo que la usaba de jg y con la e seguro se puede hacer rendir, la verdad gracias, con respecto a por que la quiero jugar, es y por que no? solo por que me gusta probar champs en distintas lineas y no quiero trolear, en serio los quiero hacer rendir, en fin janna no se por que pero me parece divertida ajajja saludos!","replies":[]},{"poster":"wazaco","date":"2016-04-11T01:39:58.497+0000","up_votes":1,"down_votes":0,"body":"Otra vez yo de probarla la primera vez, contra zed, sali 6/4/24 con 101 de farm :s ajjaja igual fue demasiado divertido. Gracias!","replies":[]}]},{"poster":"Pizzah","date":"2016-04-11T02:32:15.208+0000","up_votes":3,"down_votes":0,"body":"En la S3 Janna AP alcanzó popularidad lo que causó que le nerfearan los ratios, en esos tiempos su Q tenía un waveclear bastante bueno, y le rebajaron el escalado de AP a la mitad.\nAcá te dejo los cambios que le hicieron, saludos.\n\nV3.14:\n\n   ** Tailwind (Pasiva)**\n        Tailwind range reduced to 800 from global.\n        Tailwind movement speed buff increased to 5% from 3%. \n\n   ** Howling Gale (Q)**\n**        Ability power ratio reduced to (+35% AP) from (+75% AP).**\n        Charge damage reduced to 15 / 20 / 25 / 30 / 35 (+10% AP) from 25 / 30 / 40 / 50 / 60. \n\n    **Zephyr (W)**\n        Passive self-movement speed buff changed to 4 / 6 / 8 / 10 / 12% (+2% per 100 AP) from a flat 4 / 7 / 10 / 13 / 16%.\n        Slow debuff now scales at (+6% per 100 AP), capped at 80% total.\n        Base slow reduced to 24 / 28 / 32 / 36 / 40% from 24 / 30 / 36 / 42 / 48%.\n **       Ability power ratio reduced to (+50% AP) from (+60% AP). **\n\n**    Eye of the Storm (E)**\n        Attack damage buff of the shield now scales with (+10% AP).\n        **Shield health ratio reduced to (+70% AP) of ability power from (+90% AP). **","replies":[{"poster":"wazaco","date":"2016-04-11T16:46:15.032+0000","up_votes":1,"down_votes":0,"body":":s no lo sabia... la hicieron bosta jajaja, yo juego desde finales de la S4 asi que nada no sabia, gracias por el comentario!","replies":[]}]},{"poster":"Nyán","date":"2016-04-11T12:17:54.830+0000","up_votes":2,"down_votes":0,"body":"La puedes hacer rendir como Lulu mid. Un segundo \"support\" en late game, que hace más daño. No es necesario fedearse, sólo farmear bien.\n\nSi te maxeas la W primero, es mucho harass targeteado y puedes ir corriendo por todas partes.\n\nTambién llevar tp no es mala idea, ya que una Janna es muy útil en un countergank","replies":[]},{"poster":"alop55555","date":"2016-04-11T06:55:33.999+0000","up_votes":2,"down_votes":0,"body":"en una composicion del tipo proteger al adc te rendiria pero tendrías que tener un farmeo decente y no fedear\n\nel tornado de janna permite denegar farm si es tirado de forma muy precisa lo que un buen jugador podría sacarle provecho a esa pequeña diferencia de minions ","replies":[]},{"poster":"DkA Darkito","date":"2016-04-11T05:23:40.147+0000","up_votes":2,"down_votes":0,"body":"Me acuerdo cuando Alex Ich la jugaba en mid, pero la nerfearon xD. En fin, más consejos que los que te dieron no puedo darte, así que te deseo suerte!","replies":[]},{"poster":"LST Slime Blue","date":"2016-04-10T23:24:26.302+0000","up_votes":2,"down_votes":0,"body":"Janna es un soporte-mago, por ende tiene habilidades que escalan por AP pero en su mayoría son de utilidad, eso no quiere decir que no sirve, es mas, funciona bastante bien contra campeones como Yasuo y Zed que si se acercan o en caso de Zed ultean, ella puede alejarlos con su ulti.\nLa mejor forma de hacerla rendir es buscando un equilibrio entre la utilidad y el daño:\nBotas de hechizera\nMorelo de primer item\nGrial pare resistencia mágica y regeneración de mana\nUn item de AP poderoso, el cual recomiendo que sea el zhonyas si es que te toca contra AD, si esas contra AP un sombrero rinde mejor\nCetra abisal para reducir resistencia magica enemiga y y aumentar la tuya, o si hay mas AD en el otro team es mejor un cetro de cristal\nY un tormento de lyandri apoyaría","replies":[{"poster":"wazaco","date":"2016-04-11T00:46:18.895+0000","up_votes":1,"down_votes":0,"body":"siempre le esquivo al rabadon me parece un item demasiado caro :s, no le quito valor, pero se lo dedico a los ultimos, voy a probar con grial, el morello no por lo que puso el de arriba (? jajaja nada despues les cuento como me fue xD","replies":[]}]},{"poster":"Runth","date":"2016-06-12T08:10:32.927+0000","up_votes":1,"down_votes":0,"body":"se, armate ad y la victoria es de - 3.95 segundos y tu team quedaran sin aliento\n\n{{sticker:slayer-pantheon-popcorn}}  anti metas","replies":[]},{"poster":"Hnk Kenshiro","date":"2016-04-10T23:39:09.192+0000","up_votes":2,"down_votes":2,"body":"La verdad yo juego janna jg, te explico.\n1° la jugaba ad cuando era más rentable el devorador con los de rango, pero ya no tanto.\nAsi que ahora la juego AP, sigue teniendo buenos ganks, y sin problemas para limpiar, pero no podras deletear, seras siendo de utilidad, pero con más daño gracias al {{item:1414}} y {{item:3100}}","replies":[{"poster":"wazaco","date":"2016-06-12T05:26:59.135+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hnk Kenshiro,realm=LAS,application-id=v7qsfXsE,discussion-id=dVuHZnEX,comment-id=0004,timestamp=2016-04-10T23:39:09.192+0000)\n>\n> La verdad yo juego janna jg, te explico.\n> 1° la jugaba ad cuando era más rentable el devorador con los de rango, pero ya no tanto.\n> Asi que ahora la juego AP, sigue teniendo buenos ganks, y sin problemas para limpiar, pero no podras deletear, seras siendo de utilidad, pero con más daño gracias al {{item:1414}} y {{item:3100}}\n\nAJAJA lollllll como vuelven las cosas ehh xD jajaja Saludos!","replies":[]},{"poster":"wazaco","date":"2016-04-11T00:44:31.433+0000","up_votes":1,"down_votes":0,"body":"gracias voy a probar!","replies":[{"poster":"Hnk Kenshiro","date":"2016-04-11T17:04:02.964+0000","up_votes":1,"down_votes":0,"body":"La juego con marcas de ad, quintas de ap, sellos de vida y glifos de cdr.\nPartes en golems, luego pajaros y red, luego gankeas o haces el cangrejo para recuperar vida.\nCompras talizman de cazador para el mana y la vida, partes con el escudo (que es el que se maxea) y luego tornado.","replies":[]}]},{"poster":"MrAres","date":"2016-04-11T02:32:32.341+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hnk Kenshiro,realm=LAS,application-id=v7qsfXsE,discussion-id=dVuHZnEX,comment-id=0004,timestamp=2016-04-10T23:39:09.192+0000)\n>\n> La verdad yo juego janna jg, te explico.\n> 1° la jugaba ad cuando era más rentable el devorador con los de rango, pero ya no tanto.\n> Asi que ahora la juego AP, sigue teniendo buenos ganks, y sin problemas para limpiar, pero no podras deletear, seras siendo de utilidad, pero con más daño gracias al {{item:1414}} y {{item:3100}}\n\nY pega?","replies":[{"poster":"Hnk Kenshiro","date":"2016-04-11T17:01:06.881+0000","up_votes":1,"down_votes":0,"body":"Pues donde tiene más impacto tiene janna jg es en early, ya despues pasa a dedicarse a hacer peel en tf.\ntiene buen daño gracias al escudo y el daño verdadero del castigo, en donde puedes dar como 4 golpes gracias al cc","replies":[]}]}]},{"poster":"Shion Archimago","date":"2016-04-11T17:26:03.577+0000","up_votes":1,"down_votes":0,"body":"{{item:3124}} {{item:3085}} {{item:3009}} {{item:3153}} {{item:3742}} {{item:3031}} rotisimo","replies":[]},{"poster":"Atun","date":"2016-04-11T16:54:38.283+0000","up_votes":1,"down_votes":0,"body":"Antes se podia. Es mas alex ich (legendario mid de moscow five) solia pickear mid extraños entre ellos janna mid full ap.\n\nPero eso era antes, en esas season en que habia variedad, balance y entretencion.\n\nAdemas de eso, antes habia DFG, no habia maw (en su estado actual), etc. Pero rito se ha empecinado en darle foco a los ad y nerfear los magos (o todo lo que le haga contra a los ad, recuerdan el nerf a rammus, cuando empezo a ocuparse en top contra los ad?)","replies":[]},{"poster":"zPrydez","date":"2016-04-11T06:36:12.961+0000","up_votes":1,"down_votes":0,"body":"Top ad bruiser.","replies":[]},{"poster":"Fedejp","date":"2016-04-11T01:10:56.558+0000","up_votes":1,"down_votes":0,"body":"yo la usaba contra katarina, si mi jungla era premade es facil ganarle jajaja","replies":[]},{"poster":"resnov15","date":"2016-04-10T23:06:03.357+0000","up_votes":1,"down_votes":0,"body":"el splash art hace unos años","replies":[]},{"poster":"Amenotejikara","date":"2016-04-11T02:17:58.650+0000","up_votes":1,"down_votes":1,"body":"Janna rinde mid, lo único que a la larga tenés más asistencias que kills. Lo bueno (para mí) que tiene al ir mid, es que tiene un buen juego en equipo. Aún así, no conozco de alguna build que haga que rinda como Sona, tampoco creo que llegue a tener tan buen daño cuando está muy enfocada en brindar utilidad al equipo. No tengo idea de que build usaba con ella, pero el Eco de Luden y el sombrero (creo yo) que es necesario que los incluyas en esa build. Sin embargo, como te dije, por la utilidad y el juego en equipo que tiene, me parece que la build que de más resultado con ella no tiene que ser full AP.\nPD: yo tengo esa skin y no me gustó el splash art, me gustaba Janna como morocha!","replies":[]},{"poster":"Lumpfish","date":"2016-04-10T23:02:56.651+0000","up_votes":1,"down_votes":1,"body":"No","replies":[]}]}