{"poster":"xiGreen","date":"2015-02-16T10:05:02.256+0000","title":"Wir suchen Jungler","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Unser Team sucht noch einen Jungler, der sich wie wir zwischen silber II und Gold II befindet.\nMöglichst über 16.\nWir sind zwischen 17 und 20 Jahre alt und wollen ein neues Team erstellen, kennen uns aber schon seit etwa einem Jahr.\n\nBei Interesse addet xiGreen.","replies":[{"poster":"JG Solo","date":"2015-02-16T17:39:59.915+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nbin seit season 2 Main Jungler und suche nun ein Team ! Eure Anzeige hat mich sehr angesprochen und würde mich über ein Gespräch freuen.\nZu mir selbst ich bin 22 Jahre alt war Season 4 Gold iii und bin nun auf Gold V gedroppt, fals ihr Interesse habt könnt ihr euch bei mir melden bzw ich habe xiGreen schon geaddet\n\nMfG lFloki","replies":[]},{"poster":"AΝTON","date":"2015-02-16T15:25:19.049+0000","up_votes":1,"down_votes":0,"body":"HalliHallo \n\nich hätt schon i wie bock ^^ Ich bin 17 jahre alt und war s4 Gold 3 bin dann runtergestuft worden auf silber4 (weil ich die promo getrollt hab :-) ) und bin mitlerweile wieder silber1.\nNaja ich spiele den Jungle sehr objektorientiert, dass heißt falls ihr mich nehmt erwartet keine sitts auf euren Lanes und erwartet nicht das ich eure Lane carry.Ihr würdet dann mehr so sachen bekommen wie 5 Drakes nach 35 min, oder permanente vision im gegnerischen jungle. :--) \n\nNaja besprecht euch mal schön und falls ihr mich wollr addet einfach Funtonio in LoL.\n\nLg Anton","replies":[]},{"poster":"Resolution","date":"2015-02-16T11:25:19.393+0000","up_votes":1,"down_votes":0,"body":"hi also ich könnte vlt jungeln, mein main jungler is lee das heist wir brauchen ne starke midlane dass wenn ich der lane den bluebuff gebe dass er nicht gleich an das gegerische Team geht, ich bin 14 jahre alt (nur weil ich 14 bin heißt es nicht dass ich schlecht bin) ich bin soloq rank silber 3 ich spiele seit zac auf dem pvp online kahm und ich wohne in Göppingen das ist in der nähe von stuttgart","replies":[{"poster":"Marksmansitter","date":"2015-02-16T11:40:54.057+0000","up_votes":1,"down_votes":0,"body":"Das Alter hat nichts mit dem \"skill\" zu tun aber wir suchen eher \"reifere\" Leute tut mir leid.\n\nMfg Mitglied des Teams","replies":[]}]},{"poster":"Markathus","date":"2015-02-16T11:29:34.564+0000","up_votes":1,"down_votes":0,"body":"Hey Ich wäre interessiert \nBin 20 Jahre alt Main Jungler und habe letzte Saision Silber 3 \ngespielt, diese Saison bin ich noch nicht gerankt.\nIch besitze den kommpletten Championpool meine Mains sind: \n{{champion:76}} {{champion:59}} {{champion:80}} {{champion:107}} {{champion:421}} {{champion:72}} {{champion:56}}  \n\nHabe leider nur erst ab morgen Zeit.\nBei Interesse Eurerseits addet mich einfach \n\nLG Markathus {{summoner:11}} ","replies":[]},{"poster":"Support Penguin","date":"2015-02-16T10:29:54.034+0000","up_votes":1,"down_votes":0,"body":"Wäre schon, wenn man vielleicht noch etwas über euch erfährt. \nWie alt seid ihr, woher kommt ihr, wie lange gibt es euch schon, .. etc.\n\nGrüße, Chris.","replies":[{"poster":"xiGreen","date":"2015-02-16T10:32:42.128+0000","up_votes":1,"down_votes":0,"body":"Danke, habe es grade geändert.","replies":[]}]}]}