{"poster":"Imagine Breaker","date":"2017-09-14T01:12:33.927+0000","title":"Acabo de perder una promo porque al juego le dio la gana :)","subforum":"Charlas Generales","embed":{"description":"Image Guardar hosted in imgbb.com","url":"https://ibb.co/hOD3da","image":"https://image.ibb.co/kh6Oda/Guardar.png"},"up_votes":3,"down_votes":7,"body":"Soy un jugador normal, no me considero bueno en lo absoluto y tengo que poner mucho esfuerzo para mejorar cada dia como jugador. Actualmente, casi no tengo tiempo de jugar, y el poco que tengo juego con amigos por lo que jugar ranked es algo que hago poco y nada. Hoy, logre entrar en promo, perdi mi primera partida y me fui a la escuela. Hice todo lo que tenia que hacer durante el dia y volvi ILUSIONADO de jugar, y con suerte, ganar mi promo. Me meto a partida y durante la pantalla de carga el juego crashea y se pone a escanear archivos. Que paso? Mi equipo tiro remake y perdi mi promo.\r\nEsto, literalmente paso porque al juego le dio la gana y me indigna tener que perder una Promo, algo tan simple como eso, pero que conllevo esfuerzo y tiempo teniendo en cuenta que NO soy bueno solo porque al juego le dio la gana. Obviamente no hay nada para hacer, solo queria descargarme. Un saludo, y suerte en los campos de la INjusticia invocadores :)\r\nAdjunto imagen donde claramente se ve que perdi la promo y enj el fondo se ve como el juego estaba reparando archivos.","replies":[{"poster":"SparkkNimoTV","date":"2017-09-14T01:16:35.286+0000","up_votes":1,"down_votes":3,"body":"Y si mandas ticket al soporte? capaz te puedan dar una mano","replies":[{"poster":"vFrance","date":"2017-09-14T01:19:55.298+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=SparkFall22,realm=LAS,application-id=v7qsfXsE,discussion-id=PyeVTtAa,comment-id=0001,timestamp=2017-09-14T01:16:35.286+0000)\n>\n> Y si mandas ticket al soporte? capaz te puedan dar una mano\n\nPerdio los puntos amigo y la promo. No le van a devolver nada le van a dar una palmada en la espalda con unas disculpas y ya. O seguramente te pidan informacion sobre tu computadora para ver mas sobre el asunto.","replies":[]}]},{"poster":"vFrance","date":"2017-09-14T01:16:13.065+0000","up_votes":1,"down_votes":0,"body":"Me ha pasado algunas veces, incluso en promo a Master amigo. Pero son problemas internos o externos. Puede que se haya generado un problema en tu pc o con el launcher del juego que es pesima la calidad ya que es un Software diferente al del juego interno, lo cual puede generar muchos problemas como el que tuviste. Laucher (SorftWare Chino) y el juego sigue siendo SoftWare Norte Americano.","replies":[]}]}