{"poster":"Djerun90","date":"2016-01-02T01:30:53.295+0000","title":"Ich bin endgültig raus - League ist tot","subforum":"Champions & Gameplay","up_votes":6,"down_votes":14,"body":"Dies ist mein letzter Eintrag in diesem Forum - Ich h&ouml;re auf mit League of Legends!\r\n\r\nDie Pre-Season dauert nun schon geraume Zeit an und ich muss sagen, dass ich keinen Spa&szlig; mehr habe bei den neuen &Auml;nderungen. \r\nDas League of Legends, das ich seit Season 2 gespielt habe, ist tot und wird so nie wiederkommen. \r\n\r\nDas ganze Spiel dreht sich aktuell nur noch um 10 Mal Thunderlords pro match und dann purer dmg bis eine Seite einknickt. Keine Chance mehr f&uuml;r klassische Supporter oder reine Tanks. \r\n\r\nIch hab wirklich versucht, mich an die neuen Begebenheiten anzupassen ... hab meine Masteries angepasst, meine Championauswahl erweitert und mir die neuesten Patch-Notes durchgelesen ... aber nach der letzten Pech-Str&auml;hne (mehrere verlorene Spiele hintereinander, in denen mein Team jeweils brutal gestomped wurde), hab ich beschlossen, diesen SCHROTT, den Riot aktuell League of Legends nennt, zu deinstallieren und nicht wieder damit anzufangen. Daf&uuml;r ist mir meine Zeit einfach mittlerweile zu schade!\r\n\r\nJeder, der weiterhin mit Begeisterung dieses Spiel spielt, soll dies von mir aus gerne tun. Es ist nicht meine Absicht, Leuten League of Legends madig zu machen ... Ich m&ouml;chte nur abschlie&szlig;end meine Meinung sagen d&uuml;rfen.\r\n\r\nVielleicht denkt Riot ja mal dr&uuml;ber nach, warum so viele alteingesessene Spieler mittlerweile das Feld r&auml;umen und sich andere Games suchen. \r\n\r\nDjerun90","replies":[{"poster":"Zero000","date":"2016-01-02T02:03:38.932+0000","up_votes":9,"down_votes":0,"body":"Gehst du weil League tot ist oder ist League tot weil du gehst?\n\nAber naja wie sagt man \"Totgesagte leben länger\".\nIm Grunde wird doch seit (5-6) Jahren behauptet das League ausstirbt. Mal war es Diablo 3 das den Untergang herbeiführt, mal Dota 2, mal CSGO und jedes Jahr wieder die Änderungen zur nächsten Saison hin. Komischerweise spielen es lauf Riot immer mehr. Nekrophilie muss heutzutage wirklich weit verbreitet sein.","replies":[]},{"poster":"franticFurball","date":"2016-01-02T08:51:57.802+0000","up_votes":6,"down_votes":0,"body":">warum so viele alteingesessene Spieler mittlerweile das Feld räumen\n\nInteressant, zu dem Satz auch irgendeinen Beweis?\n\n\"Ich gehe\" ist nämlich keiner.","replies":[{"poster":"haha weed lol xd","date":"2016-01-02T17:53:51.304+0000","up_votes":2,"down_votes":2,"body":"https://www.youtube.com/watch?v=YA3e_Ti7Zns","replies":[{"poster":"franticFurball","date":"2016-01-02T18:19:21.441+0000","up_votes":1,"down_votes":1,"body":"Es wär vielleicht gut wenn du dir das Video ansiehst bevor du es als Argument verwendest, denn was der gute Mann sagt ist vermutlich nicht das was du über deine Meinung, oder League ganz allgemein, hören willst :D","replies":[{"poster":"haha weed lol xd","date":"2016-01-02T19:30:26.101+0000","up_votes":1,"down_votes":1,"body":"?","replies":[{"poster":"YouMadBroLTP","date":"2016-01-03T00:50:24.734+0000","up_votes":1,"down_votes":1,"body":"Der videoersteller meinte selbst das er auch wieder öfter LoL spielt, andere rollen und champs probiert.\nSich mehr auf Teamplay konzentriert und dadurch auch wieder spaß dran hat.","replies":[{"poster":"haha weed lol xd","date":"2016-01-03T00:58:35.252+0000","up_votes":1,"down_votes":0,"body":"Das interessiert nur nicht. \nDas ist seine perönliche Meinung. \nDer Hauptteil bezieht sich auf das PvP das die alten LoL Spieler ( Darunter auch meiner seits, dabei seit 012 ) so fasziniert hat. \nMittlerweile kann eine Irelia 0/5 aus der Lane gehen und ein Spiel gewinnen einfach weil die TeamComp besser ist, unabhänging davon ob ich als Spieler generell besser bin.","replies":[{"poster":"YouMadBroLTP","date":"2016-01-03T01:31:50.210+0000","up_votes":2,"down_votes":0,"body":"oder als 5/0 irelia verlieren wenn das eigene team nix auf die reihe bekommt","replies":[]}]}]}]}]},{"poster":"YouMadBroLTP","date":"2016-01-04T19:28:42.903+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=2XKjGvjY9pg","replies":[]}]},{"poster":"YouMadBroLTP","date":"2016-01-02T14:27:49.896+0000","up_votes":1,"down_votes":0,"body":"Also von meiner FL ist nur noch 1/5 aktiv...","replies":[{"poster":"franticFurball","date":"2016-01-02T14:35:28.126+0000","up_votes":1,"down_votes":0,"body":"Wow. Und wieviele Einträge hat deine FL?\n\nSelbst wenn sie voll ist sind das glaub ich 150 Personen. Dieses Spiel hat über 70 Millionen aktive Spieler.","replies":[{"poster":"YouMadBroLTP","date":"2016-01-02T14:40:14.871+0000","up_votes":1,"down_votes":4,"body":"21\n\nWoher nimst du die \"70 Millionen\"? BEWEIS? {{sticker:slayer-jinx-wink}} \nEUW oder alle Server zusammen?","replies":[{"poster":"Phobos Selini","date":"2016-01-02T14:57:34.680+0000","up_votes":1,"down_votes":0,"body":"Pressemitteilungen, die hin und wieder mal rauskommen: 2 Sekunden Googlesuche ergab z.B. das hier: http://venturebeat.com/2014/05/05/dota-2-grows-larger-than-world-of-warcraft-but-league-of-legends-still-crushes-both/","replies":[]},{"poster":"Shiggyvara","date":"2016-01-02T17:59:36.537+0000","up_votes":2,"down_votes":0,"body":"Weltweit und RIOTs eigene Angaben. \nVon daher sind es natürlich nicht 70 Millionen Spieler, sondern Accounts (aber Spieler hört sich besser an).\n\nPersönlich würd ich eher von um die 35 Millionen tatsächlichen Spielern ausgehen (bei im Schnitt 1 Zweitaccount pro Spieler), was immer noch ne nette Anzahl an Spielern ist.","replies":[]},{"poster":"franticFurball","date":"2016-01-02T15:10:09.194+0000","up_votes":1,"down_votes":0,"body":"70 Millionen sind die \"monthly unique players\".","replies":[]}]}]},{"poster":"Phobos Selini","date":"2016-01-02T14:30:02.017+0000","up_votes":1,"down_votes":0,"body":"Ja na und? Es sterben auch jeden Tag tausende Leute und trotzdem wird die Weltbevölkerung immer größer.","replies":[]}]}]},{"poster":"Patty91","date":"2016-01-02T08:44:58.565+0000","up_votes":3,"down_votes":0,"body":"Überhaupt, sich zu beschweren, dass ein Spiel, dass man seit 3 bis 4 Jahren spielt, langsam langweilig wird... Logik? Welches andere Spiel hält einen so lang? Und vor allem: OHNE VERBINDLICHE ZUSATZKOSTEN?","replies":[{"poster":"haha weed lol xd","date":"2016-01-03T17:50:39.992+0000","up_votes":1,"down_votes":0,"body":"Wolfenstein: Enemy Territorry hält mich nun schon seit 12 Jahren.","replies":[]}]},{"poster":"OrangeBubble","date":"2016-01-02T08:42:44.507+0000","up_votes":3,"down_votes":0,"body":"\"Die Pre-Season dauert nun schon geraume Zeit an und ich muss sagen, dass ich keinen Spaß mehr habe bei den neuen Änderungen.\nDas League of Legends, das ich seit Season 2 gespielt habe, ist tot und wird so nie wiederkommen.\"\n\nDie Pre-Season ist jedes Jahr ca. gleich lang. Das sollte man wissen, wenn man seit Season 2 spielt, aber ok.\nDir macht das Spiel kein Spaß, sowas kann passieren, warum man deswegen einen Thread aufmachen muss, versteh ich nicht. Mir macht das Spiel momentan auch nicht soo viel Spaß, weswegen ich eher weniger spiele und mache deswegen auch kein Fass auf. \n\nWenn sich LoL nicht stätig weiterentwickeln würde, dann würde es nach einer Zeit einfach langweilig werden, weswegen Riot bemüht ist, das Spiel immer weiter zu verändern und zu \"erneuern\". Dafür ist dann auch die Pre-Season da. Dass das nicht jeden passt, sollte klar sein, denn Geschmäcker sind unterschiedlich, deswegen von \"LoL ist tot\" zu reden.... nja ich denke, die Zahlen sprechen für sich.","replies":[]},{"poster":"Spicavius","date":"2016-01-02T08:14:55.257+0000","up_votes":3,"down_votes":0,"body":"Preseason = Testphase\nTestphase = No Balance\n\nTestphase ist extra um mal richtig krasse Änderungen auszuprobieren und zu sehen wie die sich auswirken. Aber ok viel spaß bei anderen spielen.","replies":[]},{"poster":"Spicavius","date":"2016-01-04T20:52:24.985+0000","up_votes":2,"down_votes":0,"body":"Sry, wenn ich diesen Thread nochmal rauskrame, aber ich finde es einfach nur zu gut, dass der TE nach diesem ach so dramatischen Abschied, einen Tag und die weiteren Tage nach dem Thread mehrere Rankeds gezockt hat. x)\n\nMan beachte diese Zitate von ihm:\n\n> Ich höre auf mit League of Legends!\n\nweiter gehts mit\n\n> hab ich beschlossen, diesen SCHROTT, den Riot aktuell League of Legends nennt, zu deinstallieren und nicht wieder damit anzufangen. Dafür ist mir meine Zeit einfach mittlerweile zu schade!\n\nund \n\n> Vielleicht denkt Riot ja mal drüber nach, warum so viele alteingesessene Spieler mittlerweile das Feld räumen und sich andere Games suchen.\n\nHat wohl doch kein gutes anderes Spiel gefunden. \n\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-history/EUW1/24033409\n\nHier der Spielverlauf :P\n\nP.S. Ich sehe gerade, dass die Beschwörerzauber hin und her wechseln x) ok anscheinend hat der Account zwei Besitzer x)  Mein Fail, dennoch interessante Entdeckung :P","replies":[]},{"poster":"EpicDieterBohlen","date":"2016-01-02T12:07:06.413+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Djerun90,realm=EUW,application-id=Wj1wcocU,discussion-id=BrZ32Jb6,comment-id=,timestamp=2016-01-02T01:30:53.295+0000)\n>\n> Vielleicht denkt Riot ja mal dr&uuml;ber nach, warum so viele alteingesessene Spieler mittlerweile das Feld r&auml;umen und sich andere Games suchen. \n\n\nalso ich bin seit season 1 dabei und denke noch nicht mal dran aufzuhören ich weiß nicht wo du das her hast","replies":[]},{"poster":"ü ö","date":"2016-01-02T04:12:03.277+0000","up_votes":2,"down_votes":0,"body":"Nur weil du keinen Bock mehr hast, ist das nicht tot.. wird auch weiterhin gespielt werden glaub mir.\n\nPS: Willkommen zurück morgen.","replies":[]},{"poster":"Flakies12","date":"2016-01-02T01:41:39.004+0000","up_votes":2,"down_votes":0,"body":"\"Vielleicht denkt Riot ja mal drüber nach, warum so viele alteingesessene Spieler mittlerweile das Feld räumen und sich andere Games suchen.\" Wäre das Spiel nie erweitert worden und immernoch auf den Stand von Season aus würde ICH mir ein neues Spiel suchen. \n\nHier schrieben schon öfter Leute das die anderen Talentbäume geändert werden damit nicht alle nur mit Thunderlords spielen. \n\nSoviele Beiträge von Leuten die sich über die starken Tanks beschweren zeigen wohl eine andere Sicht als deine. \n\nBis Morgen.","replies":[]},{"poster":"SNKFreak","date":"2016-01-02T11:57:16.065+0000","up_votes":2,"down_votes":1,"body":"Können wir uns einfach darauf einigen, dass ein Emissary diesen QQ-Thread closed? Natürlich ist es ärgerlich, wenn man mit einem Full Thunderlords-Team gematched wird und dann nach allen Regeln der Kriegskunst auseinandergenommen wird. Und? Deal with it. Ich hab mich auch innerlich geärgert, und spiele trotzdem weiter. Warum? Weil PreSeason. Es ändern sich so viele Dinge, grad ich als Main ADC hab mich über die Marksman Änderungen wie ein Wiener Schnitzel gefreut, auch die Masterie Änderungen klingen in sich ganz schlüssig, ganz zu schweigen von den neuen Items. Trotzdem muss man nicht gleich zu Mamas Brust rennen und sich ausheulen... Dann macht man halt kurz was Pause, lässt Gras über die Sache wachsen und macht später weiter.\n\nSelbst ich bin all die Zeit mich am weiterverbessern, trotz PreSeason. Bin im Moment dabei, mich mit Smartcast zu befassen und lerne, damit umzugehen, während der PreSeason. So kann man auch gut lernen, trotz der Veränderungen.","replies":[]},{"poster":"XxX Nomad","date":"2016-01-03T13:05:36.206+0000","up_votes":1,"down_votes":0,"body":"> Das ganze Spiel dreht sich aktuell nur noch um 10 Mal Thunderlords pro match und dann purer dmg bis eine Seite einknickt. Keine Chance mehr für klassische Supporter oder reine Tanks.\n\nKomisch, ich Spiele den Klassischen Support und Tank sehr gerne mit viel Spaß und Erfolg, je nach Situation passt auch ganz gerne mal ein Taric rein ^^","replies":[]},{"poster":"ReDcOrSaIr2","date":"2016-01-02T14:28:04.811+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"YouMadBroLTP","date":"2016-01-02T14:23:00.089+0000","up_votes":1,"down_votes":0,"body":"**Nein LoL ist nicht tot**\n\ndennoch hat eine Veränderung begonnen die nicht von allen Spielern positiv gesehen wird...\nRiot will LoL als E-Sport anspruchsvoll machen, versucht gleichzeitig aber für junge unerfahrene Spieler einfach und motivierend zu sein...\nFrüher konnte man irgendeinen WTF Itembuild bauen, hatte trotzdem Spaß und wurde nicht gleich zugeflamt oder reportet...\n\nMit dem Merchandise und E-Sports wird es sich sogar noch sehr lange halten und auch sehr viele neue(junge) Spieler gewinnen.","replies":[]},{"poster":"Sihari","date":"2016-01-02T01:46:20.427+0000","up_votes":1,"down_votes":4,"body":"https://www.youtube.com/watch?v=YA3e_Ti7Zns \nDieses Video erklärt glaube ich ganz gut, warum die alteingessenen sich langsam von LoL distanzieren. \nAußerdem ist Thunderlords gar nicht in jedem Match so stark vertreten. Hat man einen \"klassischen\" Supporter an der Seite wird mindestens dieser kein Thunderlords nutzen. Für Tanks ist es auch eher mau und von denen gibt es noch genug in der Meta.\nDesweiteren hatte ich zB heute mehrere Spiele, in denen nur 1-2 Thunderlords vertreten waren.\nMal abgesehen davon, dass die Meisterschaft bald angeglichen wird. Die Preseason wird noch etwas dauern und in der Zeit wird Riot auch versuchen die Meisterschaften alle gleichwertig stark zu machen, so dass man sich damit sehr gut spezialisieren kann. Schließlich wurden sie ja aus diesem Grund geändert. ;3","replies":[{"poster":"YouMadBroLTP","date":"2016-01-02T13:39:47.434+0000","up_votes":1,"down_votes":0,"body":"dauert aber noch fast 2 Wochen {{sticker:slayer-jinx-wink}}\n\nwie ein dev es bezüglich des balancing so schön formuliert hat...\nDie Helden werden in Gruppen aufgeteilt und für diese gruppen die items/masteries optimiert.\nChamps die aus der gruppe fallen kriegen ein Nerf/Buff/Rework.","replies":[]}]},{"poster":"Rainbow Dashie","date":"2016-01-02T07:56:13.936+0000","up_votes":1,"down_votes":0,"body":"was ist ein klassischer Support? Ich spiele Nami bei mir recht erfolgreich und das ist weder ein Fulltank noch ein Full Ap Support. \n\nUnd ich spiele sie auch nicht mit Thunderlords sondern mit der Heal masterie. But ok...\n\nIch geb dir 1 Woche","replies":[{"poster":"Santas hoe","date":"2016-01-02T09:01:07.297+0000","up_votes":1,"down_votes":0,"body":"Bin mir auch noch sicher, was er damit meint. Ich carry andauernd mit janna, nami  und lulu die botlane durch und zwar mit heal masterie. Ich bin ja iwie auch gespannt was er als normalen sup versteht, aber vielleicht liegt es bei mir ja auch an der lowelo ;)","replies":[]}]}]}