{"poster":"Keyser Sóze","date":"2019-09-01T17:42:51.724+0000","title":"Permanenten Ban...während meines Urlaubs!","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":7,"body":"Hallo,\n\nich möchte hier kurz erzählen was passiert ist.\n\nVom 14.08. bis 31.08 war ich im Urlaub (Italien) und als ich zurückgekommen bin, musste ich feststellen, dass mein Account einen Permaban bekommen hat.\nHabe natürlich dem Support ein Ticket geschrieben und ihm folgendes mitgeteilt:\n> Sehr geehrte Damen und Herren,\n> \n> ich bin gestern von meinem Italien Urlaub zurückgekommen und musste feststellen, dass mein Account permanent gebannt wurde. Ich weiß, dass die Accountsperre nicht rückgängig gemacht werden kann obwohl ich sogar beweisen kann, dass ich es nicht war der in den letzten ~2 Wochen (seit 14.08) gespielt hat (Flugtickets, Airbnb Buchung, Fotos, BusTickets). Dennoch würde ich Sie bitten mir zu sagen ob die letzten Spiele die auf dem Account durchgeführt wurden über die IP xxxxxxxxxx gelaufen sind. Denn rein theoretisch könnte mein Mitbewohner sich Zugriff zu meinem Account beschafft haben...er behauptet er war es nicht. Sollten die letzten Spiele über genannte IP gegangen sein, so kann ich ihn wenigstens für den Schaden aufkommen lassen.\n> \n> Im Anhang befindet sich das Ticket nach Wien zurück (31.08.2019).\n> \n> Mit freundlichen Grüßen \n> mein name\n> \n> PS: Weil ich \"Teilst du dir dieses Konto mit anderen?\" unten im Formular gesehen habe, möchte ich nur feststellen, dass mein (sollte er es gewesen sein) Mitbewohner mein Passwort zwar nicht kennt aber mein PW auf einer Maustaste gespeichert ist. Er hat auch keine Erlaubnis meinen Account zu verwenden!\n\nDie endgültige Antwort des Supports:\n> Hey,\n> ich hab den Fall gründlich überprüft und die Spiele wurden von deinem PC gespielt. Es tut mir leid, aber in diesem Fall können wir nicht beweisen, dass du diese Spiele nicht gespielt hast.\n> \n> Chop, chop!\n> ------------------\n> RiotGames Player Support\n\nEigentlich dachte ich, dass Bans grundsätzlich nicht Rückgängig gemacht werden. Aufgrund der Antwort des Support entnehmen ich aber, dass es doch möglich wäre....wenn ich beweisen kann, dass ich es nicht war. Oder?\n\n**Denn Bilder (mit mir beim Koloseum; Fotos haben Zeitstempel), Flug- und Bustickets und Airbnb-Buchungen die beweisen, dass ich zur besagten Zeit nicht im Lande war (wo mein PC mit IP Adresse nunmal steht), sind laut RIOT anscheinend nicht aussagekräftig genug bzw haben keine Gültigkeit als Beweis...\n**\n\n**Nun würde ich gerne wissen, was bitte als \"gültiger\" Beweis angenommen wird?**\n\nlg\n\nEDIT: ja ich habe beim Ticket meine \"Beweise\" als Anhang angegeben.","replies":[{"poster":"Abasin","date":"2019-09-02T09:41:27.950+0000","up_votes":3,"down_votes":1,"body":"Gute Güte. Du bist hier nicht vor Gericht in einem Strafprozess und musst ein Alibi vorweisen. {{sticker:zombie-brand-facepalm}} Es ist in einem Onlinespiel zu einem Zeitpunkt X ein Vorfall auf Deinem Account passiert. {{sticker:zombie-brand-mindblown}} Da gibt es nur zwei Möglichkeiten:\n\n1. Du warst es selbst und versucht das zu verschleiern. {{champion:17}} \n2. Du sagst die Wahrheit. Dann aber hat sich jemand Deines Accounts bedient und Du musst glaubhaft erklären, wieso Du deinen Account derart verantwortungslos behandelst, dass solche Sachen passieren. Und Dir im Klaren sein, dass dies ein Verstoss gegen die Benutzerregeln ist, der ebenfalls mit einem Bann geahndet werden kann.{{sticker:sg-ahri-1}} \n\nSo gesehen bist Du mit dem 14 Tage Bann noch mit einem blauen Auge davongekommen, Accountsharing gibt nämlich nen Perma.{{sticker:leblanc-funny}}","replies":[{"poster":"Haudruppmoor","date":"2019-09-02T09:50:07.236+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Abasin,realm=EUW,application-id=KYnfKGf0,discussion-id=8FoRpANP,comment-id=0006,timestamp=2019-09-02T09:41:27.950+0000)\n> \n> So gesehen bist Du mit dem 14 Tage Bann noch mit einem blauen Auge davongekommen, Accountsharing gibt nämlich nen Perma.{{sticker:leblanc-funny}}\n\n{{sticker:sg-ahri-2}} ähm er hat nen Perma ...","replies":[{"poster":"Abasin","date":"2019-09-02T13:00:40.161+0000","up_votes":3,"down_votes":1,"body":"Ups. Damit ist die ganze Dramatik aus meinem Post raus. {{sticker:slayer-jinx-unamused}} {{sticker:sg-ahri-1}}","replies":[{"poster":"Haudruppmoor","date":"2019-09-02T14:49:02.438+0000","up_votes":3,"down_votes":0,"body":"Sorry - {{sticker:katarina-love}} \n\n---\n\nIst aber auch so wie Nordwolf87 es schon gesagt hat, \"fahrlässiger Umgang\" mit persönlichen Daten. MNn. sogar grob fahrlässig . Den PC wie auch immer ungesichert in ner WG zu lassen, wo JEDER ran kann {{sticker:zombie-brand-facepalm}} \n\nAus der Nummer kommt der Protagonist net mehr raus. Btw. wer da gespielt hat ist sowieso irrelevant. Es wurde auf dem ACC gespielt, fertig.\n\nRITO wird auch nicht irgendwelche IP's rausrücken, das glaub ich nicht. Da würden die sich ja auch ein Stück weit in die Karten gucken lassen . \n\nUnd die Floskel \"in diesem Fall können wir nicht beweisen, daß Du die Spiele nicht gespielt hast\" ließt sich eher so - Du hast nicht auf Deine Daten achtgegeben , mußt Du aber und deshalb bleibt der ACC gesperrt. \n\nIch mein probieren kann er ja, den wiederzubekommen. Aber es reicht halt nicht aus, Beweise zu finden. Die Beweise müssen auch nachprüfbar sein. Dazu kommt noch der Beweis, daß er seine Daten vorher ausreichend geschützt hat. Deshalb seh ich da eher schwarz.\n\nDie \"Wahrheit\" kennt sowieso nur der Protagonist und/oder sein Mitbewohner.","replies":[]}]}]}]},{"poster":"Nordwolf87","date":"2019-09-02T04:51:02.246+0000","up_votes":4,"down_votes":1,"body":"Bei allem respekt\n\n>dass mein (sollte er es gewesen sein) Mitbewohner mein Passwort zwar nicht kennt aber mein PW auf einer Maustaste gespeichert ist. \n\nDas ist schon fahrlässiger Umgang mit deinen Daten oder?","replies":[]},{"poster":"AudreyrJmEb","date":"2019-09-09T08:21:31.010+0000","up_votes":2,"down_votes":0,"body":"Klar kann Riot perma bans rückgängig machen wenn du eindeutig beweisen kannst dass du unschuldig bist, ist aber nur sehr selten der Fall und bei dir sicherlicht nicht, sorry :D","replies":[]},{"poster":"Haudruppmoor","date":"2019-09-03T07:40:34.027+0000","up_votes":2,"down_votes":0,"body":"hier, ein bischen Guckstoff :\n\nhttps://www.youtube.com/watch?v=_KTXPH8BGwk\n\nunser lieber Maik ist wohl ein \"Wiederholungstäter\"  {{sticker:zombie-brand-mindblown}} \n\nhttps://www.youtube.com/watch?v=aym8RZmzBVQ\n\ndann\n\nhttps://www.youtube.com/watch?v=YFoUKYpQ7lQ\n\nund auf einmal \n\nhttps://www.youtube.com/watch?v=_TqkyWMOmP4 {{sticker:galio-happy}}\n\nUnd wenn man nix draus lernt, passiert sowas\n\nhttps://www.youtube.com/watch?v=HVH5dy38dEU\n\n{{sticker:sg-kiko}} ","replies":[]},{"poster":"Timethief49","date":"2019-09-01T17:54:32.488+0000","up_votes":1,"down_votes":0,"body":"Gibts in deinem Haus andere Leute die Zugang zu deinem Computer gehabt haben könnten oder hast du Freunde/familienmitglieder die deine Login Daten haben?","replies":[{"poster":"Keyser Sóze","date":"2019-09-01T18:01:56.290+0000","up_votes":1,"down_votes":0,"body":"Ich wohne in einer 2er WG. Habe dem Support (siehe oben) auch mitgeteilt, dass dieser Zugang zu meinem Zimmer hat. Wegen Blumen gießen und lüften.\nKeiner hat meine Login-Daten! Ich betreibe kein Account-Sharing! Keiner hat meine Erlaubnis meinen PC zu benutzen. Selbst die Freundin muss immer das Notebook nehmen xD\nJedoch habe ich ein Passwort das ich für alles verwende und dies ist auf meiner zusätzlichen Maustaste gespeichert und das weiß mein Mitbewohner auch. Er behauptet, dass er nicht an meinem PC war.","replies":[{"poster":"dugg","date":"2019-09-01T18:17:58.713+0000","up_votes":3,"down_votes":1,"body":"Leider ist der Tatbestand dann trotzdem, dass du die Accountdaten weitergegeben hast.\n\nVor allem, wenn man das Passwort für ALLES per Mausklick sofort zu Verfügung hat und du es auch noch jemanden erzählst. Das hast du dir dann selbst zu zuschreiben. Tut mir leid. Das widerspricht irgendwie dem Sinn eines Passworts als Sicherheitseinrichtung.","replies":[{"poster":"Keyser Sóze","date":"2019-09-01T18:21:44.778+0000","up_votes":2,"down_votes":1,"body":"Ich habe es ihm **nicht gesagt**, dass mein PW da drauf ist. Aber sowas kann man doch bemerken wenn man beim einloggen nicht auf die Tastatur eintippt sondern nur auf der Maus.\n\nDas ändert nichts, dass ich beweisen kann, dass ich es nicht gewesen sein kann. Daher finde ich den permaban so übertrieben.\n\nEdit: Da wäre ich immerhin glücklich, wenn man zb. nen 14 Tage ban draus macht und ich dann durch weiterhin normales spielen zeige, dass ich nicht auffalle","replies":[{"poster":"Sirrkas","date":"2019-09-01T19:29:53.924+0000","up_votes":2,"down_votes":0,"body":"Du kannst gerne versuchen dem Support zu erklären, dass dein Mitbewohner unerlaubt Zugriff auf deinen Account gehabt hat. Aber ich sehe da eher schwarz, so wie du die Situation schilderst. ","replies":[{"poster":"Keyser Sóze","date":"2019-09-01T19:32:50.665+0000","up_votes":2,"down_votes":1,"body":"Das habe ich Ihm ja schon erklärt. Seine Antwort war:\n> ich hab den Fall gründlich überprüft und die Spiele wurden von deinem PC gespielt. Es tut mir leid, aber in diesem Fall können wir nicht beweisen, dass du diese Spiele nicht gespielt hast.\n\nMeine Frage ist (siehe oben), was dann bitte sonnst als Beweis gelten soll, dass ich es nicht war, wenn nicht meine Bilder und Flugtickets.\n\nAlso nochmal:\n**Nun würde ich gerne wissen, was bitte als \"gültiger\" Beweis angenommen wird?**","replies":[{"poster":"need elo police","date":"2019-09-01T19:51:42.766+0000","up_votes":3,"down_votes":1,"body":"Es gibt keinen gültigen Beweis. Es wurde bewiesen, dass auf deinem PC dein Account gespielt wurde. Du bist für deinen Account verantwortlich. Riot kann deinen Account bei nicht korrektem Verhalten sperren lassen. Es ist dabei auch egal ob du selber gespielt hast oder nicht. Dein Account ist dein Account, und dieser wurde anscheinend zurecht gebannt.","replies":[{"poster":"Keyser Sóze","date":"2019-09-01T19:54:14.768+0000","up_votes":1,"down_votes":2,"body":"Das glaube ich aber nicht...\n\nSupport:\n> Es tut mir leid, aber in diesem Fall können wir nicht beweisen, dass du diese Spiele nicht gespielt hast.\n\nDiese Aussage impliziert, dass wenn ich es nicht war, man etwas gegen meine Situation machen könnte.\n\nUnd genau darum geht es mir. Man kann beweisen, dass ich es nicht war...","replies":[{"poster":"Divin1ty","date":"2019-09-01T20:51:30.736+0000","up_votes":2,"down_votes":1,"body":"Wenn du es nicht warst, hast du trotzdem indirekt Accountsharing betrieben. \n\nDu warst nicht an deinem PC, jemand anders war's, fine, kaufe ich dir sogar ab.\nAber **du** alleine bist für deinen Account zuständig.\nWenn du sowas schwachsinniges machst wie ein Passwort für alles auf **einer** Taste zu speichern ist es leider Gottes **dein** Fehler und niemandes sonst.\n\nAccountsharing ist verboten, Riot wird weiterhin davon ausgehen das du die Daten weitergegeben hast, oder wie es der Fall ist, fahrlässig behandelt. \n\nSorry, aber da ist nichts mehr zu machen.","replies":[{"poster":"Keyser Sóze","date":"2019-09-01T21:05:47.340+0000","up_votes":2,"down_votes":1,"body":"Unter Accountsharing verstehe ich schon, dass ich wissentlich und mit Erlaubnis mein Account einer anderen Person zur Verfügung stelle bzw. teile.\n\nHabe ich nicht gemacht!\n\nLaut deiner Logik würdest du Accountsharing betreiben wenn du zb. einen Trojaner auf deinem PC hast, dieser mitlesen würde wie dein Passwort lautet und der Trojana-Besitzer dieses dann bei deinem Account verwendet....\nDu siehst sehr schnell, dass dies dann nicht Accountsharing ist....Nein, er hat es sich ohne Erlaubnis Zugriff beschafft.\n\nÄhnlich wie bei mir. => kein Accountsharing","replies":[{"poster":"need elo police","date":"2019-09-01T21:07:50.598+0000","up_votes":2,"down_votes":2,"body":"Der Sinn ist aber der gleiche. Ob da jetzt ein Trojaner am Werke ist oder ob ein Mitbewohner an die Daten rankommt. Am Ende bist du eben dafür verantwortlich.","replies":[{"poster":"Keyser Sóze","date":"2019-09-01T21:11:49.392+0000","up_votes":2,"down_votes":2,"body":"Nein es ist nicht das gleiche...Würde RIOT sehen, dass die IP plötzlich aus Brasilien kommen würde und sowas passiert, würden sie sicher den Account entbannen. Sonnst würden Sie nicht einmal kontrollieren ob dies der Fall ist....Tun sie aber! ==> Ist da schon ein unterschied.","replies":[{"poster":"Divin1ty","date":"2019-09-01T21:42:03.630+0000","up_votes":1,"down_votes":1,"body":"Nein, sie würden es nicht entbannen.\nDu würdest trotzdem deinen Bann behalten.","replies":[{"poster":"Haudruppmoor","date":"2019-09-03T06:50:03.033+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Æeras,realm=EUW,application-id=KYnfKGf0,discussion-id=8FoRpANP,comment-id=00000000000000000000000000000000000000000000000000000000,timestamp=2019-09-02T15:15:12.746+0000)\n>\n>Solange du gehackt wirst, wirst du entbannt. \n\nDie Daten liegen auf dem ROIT-Server, nicht bei Dir lokal. Und meines Wissens nach wurde der RIOT-Server bisher nicht gehackt. \n\nWenn Du gehackt wurdest, dann NUR auf Deinem PC. Denn dann haste Deine Logindaten lokal auf Deinem PC , wie auch immer - z.B. Zugang zum Forum hier und Passwort in Firefox , abgespeichert. Dafür bist DU verantwortlich. Wenn Du Dir nen Trojaner einfängst, dann kannste maximal versuchen süßholzraspelnd den Supp um ne 2. Chance zu bitten. Wenn Du Deinen PC mit jemanden teilst, oder einer drauf Zugriff hat, und Du sicherst den nicht genügend ab. dann haste gelitten.\n\nNe andere Möglichkeit ist, wenn Du auf irgendwelche dubiosen Angebote im Clienten reingefallen bist, weil ein \"Freund\" dir nen Link geschickt hat und Du draufgeklickt hast. Das ist meiner Tochter passiert . Da konnten wir aber nachweisen von wem das kam, die 2 haben sich nacheinander auf den ACC meiner Tochter eingeloggt und an sich selber Skins geschenkt - RP's geklaut . \n\nDas war nachzuvollziehen über die Geschenkeecke und über den Chat im Clienten. Ich hab den Supp angeschrieben und der hat dann reagiert, wir haben die Punkte wiederbekommen und im Anschluß unser Passwort geändert. Weil wir recht schnell reagiert haben, hatten die auch keine Möglichkeit auf dem ACC weiteren Bockmist zu machen.\n\n> [{quoted}](name=Æeras,realm=EUW,application-id=KYnfKGf0,discussion-id=8FoRpANP,comment-id=00000000000000000000000000000000000000000000000000000000,timestamp=2019-09-02T15:15:12.746+0000)\n>\n> Aber generell wegen illegalen Verhaltens anderer gebannt zu werden wäre doch sehr fragwürdig.\n\nDoch, wenn man selber das illegale Verhalten begünstigt, forciert dann wird man bestraft . \n\nDie einzigste Ausnahme die ich noch kenne, war als ein Youtuber gesperrt wurde - MrMaikAP . Der hat in seinen Videos zuviel Privatkram preisgegeben und daraufhin hat ein User sich das Passwort zusammenreimen können. Nach einigem hin und her hat MrMaikAp sein Acc wiederbekommen, auch weil der Dieb sich gemeldet hatte.\n\nIn meinen beiden Fällen war der Täter ergreifbar/ersichtlich. Wir hatten die Namen von den Typen und nen späteren Chatverlauf, wo sie es indirekt zugegeben haben und beim Youtuber hat der Dieb sich selber gemeldet.","replies":[]},{"poster":"Æeras","date":"2019-09-02T15:15:12.746+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Divin1ty,realm=EUW,application-id=KYnfKGf0,discussion-id=8FoRpANP,comment-id=0000000000000000000000000000000000000000000000000000,timestamp=2019-09-01T21:42:03.630+0000)\n>\n> Nein, sie würden es nicht entbannen.\n> Du würdest trotzdem deinen Bann behalten.\n\nHattest du den Fall schonmal oder haust du hier nur raus? Ich hab nen Kollegen der gebannt wurde für angeblichem Accountsharing, war in der USA online. Er war aber in echt zu der Zeit in Deutschland. Solange du gehackt wirst, wirst du entbannt. Was ein Schwachsinn. Und das kann man auch beweisen. Was der User hier macht ist eben einfach zu viel vage Informationen die nicht nachprüfbar sind. Aber generell wegen illegalen Verhaltens anderer gebannt zu werden wäre doch sehr fragwürdig.","replies":[]}]},{"poster":"Haudruppmoor","date":"2019-09-03T07:02:24.332+0000","up_votes":1,"down_votes":0,"body":"Die IP interessiert keinen. Die Leute/Der Typ sind/ist an DEINE Daten rangekommen. Du müßtest Deinem Freund erstmal kriminelle Absichten beweisen und das dann RIOT vorlegen. Du musst quasi den Täter präsentieren und aufzeigen, daß Du alles mögliche für die Sicherheit getan hast. Und selbst dann ist es immer noch eine Ermessensfrage von RIOT. \n\n\n> [{quoted}](name=Keyser Sóze,realm=EUW,application-id=KYnfKGf0,discussion-id=8FoRpANP,comment-id=000000000000000000000000000000000000000000000000,timestamp=2019-09-01T21:11:49.392+0000)\n>Sonnst würden Sie nicht einmal kontrollieren ob dies der Fall ist....Tun sie aber! \n\n\nTun sie nicht. Das steht auch nicht da. Du interpretierst das für Dich so.\n\nDen PC 2 Wochen ungesichert in ner WG stehen zu lassen ist doch voll cringe, DAS musst Du doch einsehen. Sowas macht man einfach nicht. Man geht auch nicht durch geschlossene Bahnschranken oder bei Rot über die Straße oder schreit laut \"BOMBE\" in nem Flugzeug. \n\n---\n\n- niemals auf irgendwelche Links im Clientchat klicken\n- auch wenn es lästig ist, den Zugang zum Forum nicht im Browser abspeichern\n- zum Adminzugang für den lokalen Rechner einfach einen lokalen Benutzer MIT Passwort anlegen und damit arbeiten/spielen\n- ein Passwort wählen, was KEINEN Bezug zu persönichen Daten beinhaltet (Geburtstage, etc)\n\nusw.\n\nDein Zugang ist am sichersten in DEINEM Kopf !","replies":[]}]}]},{"poster":"Divin1ty","date":"2019-09-01T21:32:56.383+0000","up_votes":1,"down_votes":1,"body":"Doch.\nEin anderer war auf meinem Account am Werk.\nDer einzige verantwortliche bin ich, da ich nicht für die Sicherheit meines Kontos gesorgt habe.","replies":[{"poster":"HaveMerzyOnMe","date":"2019-09-01T21:39:10.379+0000","up_votes":1,"down_votes":1,"body":"Schwachsinnige Argumentation, stell dir vor dein Account wird gehackt und damit wird Mist gebaut. Dann wirst du gebannt, denkst du dir dann auch: \"Naja, bin ich selber Schuld dran, weil ich kein IT-Spezialist mit 5 Firewalls hatte\", oder wie darf ich dich verstehen?","replies":[{"poster":"Divin1ty","date":"2019-09-01T21:41:02.825+0000","up_votes":2,"down_votes":0,"body":"Das ist hier aber nicht der Fall.\nUnd selbst dann musst du kein 'IT-Spezialist' sein, sondern einfach nur ein gutes Passwort nur für **eine** Sache verwenden.\nDieser Spezialist hier hat sein Passwort für **alles** auf eine Taste gelegt.","replies":[{"poster":"HaveMerzyOnMe","date":"2019-09-01T21:44:09.632+0000","up_votes":1,"down_votes":0,"body":"Ja, gut in diesem Fall, ist es natürlich selbstverschuldet, da stimme ich dir durchaus zu.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"e621 Rengar","date":"2019-09-01T19:34:39.502+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Keyser Sóze,realm=EUW,application-id=KYnfKGf0,discussion-id=8FoRpANP,comment-id=0000000000000000,timestamp=2019-09-01T18:21:44.778+0000)\n>\n> Ich habe es ihm **nicht gesagt**, dass mein PW da drauf ist. Aber sowas kann man doch bemerken wenn man beim einloggen nicht auf die Tastatur eintippt sondern nur auf der Maus.\n> \n> Das ändert nichts, dass ich beweisen kann, dass ich es nicht gewesen sein kann. Daher finde ich den permaban so übertrieben.\n> \n> Edit: Da wäre ich immerhin glücklich, wenn man zb. nen 14 Tage ban draus macht und ich dann durch weiterhin normales spielen zeige, dass ich nicht auffalle\n\nAndere frage \nWarum diskutierst hier mit leuten die \n1. Dir nicht weiterhelfen können da wir hier alle Spieler sind  bzw leute die nicht dafür da sind .\n2. Die eh immer alles als erlogen sehen egal was du für Beweise hast","replies":[{"poster":"Keyser Sóze","date":"2019-09-01T19:36:45.458+0000","up_votes":2,"down_votes":1,"body":"Weil ich hoffe, dass jemand einen ähnlichen Fall hatte und mir sagen kann was laut Riot-Support ein \"gültiger\" Beweis sein soll um zu zeigen, dass man nicht persönlich für das vorgeworfene verantwortlich war.\n\nAlso nochmal (siehe oben):\nNun würde ich gerne wissen, was bitte als \"gültiger\" Beweis angenommen wird?","replies":[{"poster":"e621 Rengar","date":"2019-09-01T19:38:40.012+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Keyser Sóze,realm=EUW,application-id=KYnfKGf0,discussion-id=8FoRpANP,comment-id=000000000000000000010000,timestamp=2019-09-01T19:36:45.458+0000)\n>\n> Weil ich hoffe, dass jemand einen ähnlichen Fall hatte und mir sagen kann was laut Riot-Support ein \"gültiger\" Beweis sein soll um zu zeigen, dass man nicht persönlich für das vorgeworfene verantwortlich war.\n> \n> Also nochmal (siehe oben):\n> Nun würde ich gerne wissen, was bitte als \"gültiger\" Beweis angenommen wird?\n\nDas is der Joke.\nGibt es nicht weil alles photoshopped sein könnte.\n\nWenn sie die bilder ablehnen hast verkackt ","replies":[{"poster":"Keyser Sóze","date":"2019-09-01T19:40:58.984+0000","up_votes":2,"down_votes":1,"body":"PDFs mit QR-Code wo man auf die Homepage der Fluglinie weitergeleitet wird...Soll also gephotshopt sein?\nJa die Bilder könnten \"photoshopped\" sein, aber dann wäre ich der eine unter 1Mil der das Programm so gut beherrscht sodass keine sichtbaren Fehler zu erkennen sind.\n\nEdit: Und ja nicht vergessen, dass ich um die 100 Bilder binnen eines Tages gephotshopt hätte...","replies":[]}]}]}]},{"poster":"dugg","date":"2019-09-02T13:18:08.349+0000","up_votes":1,"down_votes":0,"body":"> Ich habe es ihm nicht gesagt, dass mein PW da drauf ist [...]\n\nDoch hast du: \n\n> Jedoch habe ich ein Passwort das ich für alles verwende und dies ist auf meiner zusätzlichen Maustaste gespeichert und das weiß mein Mitbewohner auch [...]\n\nAnsonsten widersprichst du dir einfach selbst.\n\nDu brauchst nicht zu beweisen, dass du nicht vor Ort warst. Sobald sich jemand auf deinem Account anmeldet und damit Unfug treibt ist es dein Verschulden, weil du für deine Accountdaten verantwortlich bist. Für alles ein Passwort zu nutzen und es dann noch auf eine Taste zu speichern, welches dein Mitbewohner sogar weiß, dann ist das echt grob fahrlässig.\n\nIch hoffe nur, dass du daraus lernst und zukünftig sensibler mit deinen Daten umgehst.","replies":[]}]}]},{"poster":"Crοwned","date":"2019-09-02T10:11:17.962+0000","up_votes":1,"down_votes":0,"body":"> Jedoch habe ich ein Passwort das ich für alles verwende und dies ist auf meiner zusätzlichen Maustaste gespeichert\n\nDas ist ohne Übertreibung das dümmste was ich je in diesen Forum gelesen habe... Wie ... , Warum???","replies":[]}]}]},{"poster":"need elo police","date":"2019-09-01T19:20:12.876+0000","up_votes":3,"down_votes":1,"body":"Naja, in der Zeit wo du angeblich im Urlaub (Italien) warst, wurden genau die Champs bzw. Rolle gespielt die du sonst auch spielst. Schon auffällig :D\n\n> Habe dann nach einigen Spielen sogar die Rückmeldung bekommen, dass ich als (ich glaube so wurde es genannt) Rehabilitiert gelte\n\nSeit wann bekommt man so eine Meldung? Noch nie gehört. Wäre auch unlogisch, da Riot ja will dass man weiter positiv bleibt. Mit so einer Rückmeldung werden die Leute nur wieder toxisch, was weder den Spielern noch Riot selber etwas bringt. Falls es so eine Rückmeldung wirklich gegeben hat, dann hast du dir vermutlich wieder gedacht dass man auf den Putz hauen kann.\n\nWenn ich mir deine letzten Niederlagen ansehe hast du vermutlich einen Grund gehabt deine Mates zu flamen ... wie die MF in deinem letzten Spiel zum Beispiel die du supportet hast. Das wird auf der Botlane keinen Spaß gemacht haben. Oder dann noch das vorletzte Spiel ... Nasus Jungle am Ende 3/12/1 während ihr auf der Botlane vermutlich solide gespielt habt.\n\nIst ja eigentlich auch egal ... wer auch immer auf deinem PC gespielt hat, hat sich nicht korrekt verhalten. Mich würde aber folgendes interessieren: \n\n> Denn rein theoretisch könnte mein Mitbewohner sich Zugriff zu meinem Account beschafft haben...er behauptet er war es nicht. Sollten die letzten Spiele über genannte IP gegangen sein, so kann ich ihn wenigstens für den Schaden aufkommen lassen.\n\nWie willst du dies machen? xD Der Schaden ist, dass dein Account futsch ist. Willst du ihn jetzt zwingen einen neuen zu Leveln? Oder das Geld was du darin investiert hast zurück zahlen? Klingt nach einer harmonischen Freundschaft mit deinem Mitbewohner!","replies":[{"poster":"Keyser Sóze","date":"2019-09-01T19:30:47.414+0000","up_votes":2,"down_votes":1,"body":"1. Ich habe mir nicht angeschaut wie die Stats der letzten Spiele sind, da mich das nicht interessiert. Ab dem 14.08 war ich nicht im Lande und habe mich nicht mal in LoL eingeloggt.\n2. Ist diese Logik fehlerhaft, denn man erwischt nun mal öfters solche die sowas wie einen schlechten Nasus-Jungler spielen. Demnach müsste mich schon früher ein permaban erwischt haben wenn ich angeblich ja so \"auf den Putz haue\"...\n3. Ich kann vielleicht nicht direkt das Geld zurückverlangen welches ich gerne in LoL gesteckt habe. Da ich aber Hauptmieter bin, kann ich ihn aus der WG hauen (mit der 3-Monat-Frist).\n\nUnd mir geht es auch nicht um das hier eben angesprochene von dir. Sondern wie man meine Fotos, Tickets usw. nicht als Beweis anerkennen möchte.\n\n\"Klingt nach einer harmonischen Freundschaft mit deinem Mitbewohner!\" Ich dachte, dass wir Freunde sind. Da mir aber der Support bestätigt hat, dass es von meinem PC ausgegangen ist, muss ich entsprechend reagieren und ihn aus der WG werfen.\n\nlg","replies":[]},{"poster":"eingew","date":"2019-09-02T05:24:33.521+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=need elo police,realm=EUW,application-id=KYnfKGf0,discussion-id=8FoRpANP,comment-id=0002,timestamp=2019-09-01T19:20:12.876+0000)\n>\n> Seit wann bekommt man so eine Meldung?\n\nIch schätze mal gemeint ist die Meldung, dass man wieder H2 ist und somit Belohnungen erhalten kann.","replies":[]}]},{"poster":"XenesisCH","date":"2019-09-01T20:37:16.960+0000","up_votes":1,"down_votes":1,"body":"> ich hab den Fall gründlich überprüft und die Spiele wurden von deinem PC gespielt. Es tut mir leid, aber in diesem Fall können wir nicht beweisen, dass du diese Spiele nicht gespielt hast.\n\nIch denke mal sie haben dir diese Antwort gegen, weil der Morgana Build der gleiche ist wie immer. Ergo wird es sehr schwer zu sagen sein, ob da jemand anders an deinem PC war, wenn alles \"as usual\" gespielt wurde.\n\n> Eigentlich dachte ich, dass Bans grundsätzlich nicht Rückgängig gemacht werden. Aufgrund der Antwort des Support entnehmen ich aber, dass es doch möglich wäre....wenn ich beweisen kann, dass ich es nicht war. Oder?\n\nBans werden nur Rückgängig gemacht, wenn sie zu unrecht waren z. B. Fehler bei der Auswertung des Chatlogs, was aber äusserst selten vorkommt. Ein Fall wie deiner ist mir nicht bekannt und es gibt bisher auch kein Vergleichbarer Fall der hier im Forum zu finden ist, von dem ich dir Infos über den Sachverhalt mitteilen könnte. \n\n\n> Nun würde ich gerne wissen, was bitte als \"gültiger\" Beweis angenommen wird?\n\nAufgrund der Fehlender Vergleichbarkeit und mangels Infos zu so einem Fall hier im Forum, rate ich dir diese Frage dem Support zu stellen. Vielleicht hast du Glück und der Support ist gewillt dir zu glauben und erklärt dir was sie für Nachweise benötigen, um den Perma rückgängig zu machen. Viel Glück dabei.","replies":[{"poster":"need elo police","date":"2019-09-01T20:42:30.263+0000","up_votes":2,"down_votes":1,"body":"Solche Fälle gab es schon hier im Forum, wo man auch gemeint hat man könne es beweisen da man gar nicht anwesend war als die Spiele gespielt wurden. Aber soweit ich weiß wurde keiner dieser Accounts wieder entbannt.","replies":[{"poster":"XenesisCH","date":"2019-09-01T21:46:43.310+0000","up_votes":1,"down_votes":0,"body":"> ich hab den Fall gründlich überprüft und die Spiele wurden von deinem PC gespielt. Es tut mir leid, aber in diesem Fall können wir nicht beweisen, dass du diese Spiele nicht gespielt hast.\n\nEs gab schon Fälle hier im Forum, wo der Support so etwas geschrieben hat als Antwort? Dann verlinke dem TE doch diese, dass er die Fälle selber nachlesen kann.","replies":[]}]}]},{"poster":"00 M4ddin 00","date":"2019-09-02T06:16:00.999+0000","up_votes":1,"down_votes":0,"body":"Also dann wird der ban aufgehoben und direkt ein neuer drauf gepackt wegen acc Sharing ?","replies":[]},{"poster":"Ráyleigh","date":"2019-09-08T23:43:37.457+0000","up_votes":1,"down_votes":1,"body":"Alle hier hätten es kurz und schmerzlos machen können.\nEs wurde gesagt, die Spiele liefen über deinen Pc also kein Acc sharing.\nDa du einen Permabann hast, bist du schon sehr oft aufgefallen und hast dir einiges zu schulden kommen lassen.\nAlso glaubt dir auch keiner deine Story.\nChat Bann und 14 Tage Bann, wirst du sicher auch schon gehabt haben.\nAlso ist der Bann mehr als gerecht und sollte auf keinen Fall zurückgenommen werden.","replies":[]},{"poster":"Hundis Katze","date":"2019-09-01T18:02:14.267+0000","up_votes":3,"down_votes":4,"body":"Joa... so zwei Wochen Urlaub, oder einfach zwei Wochen Bann, den man schon vorher kassiert hat... netter Versuch ;)","replies":[{"poster":"Keyser Sóze","date":"2019-09-01T18:18:26.017+0000","up_votes":2,"down_votes":1,"body":"Bitte missverstehe mich nicht, der Ban war vor **mehr **als einem Jahr und war der die einzige Strafe und ich spiele sehr viel (LVL 143).\nHabe dann nach einigen Spielen sogar die Rückmeldung bekommen, dass ich als (ich glaube so wurde es genannt) Rehabilitiert gelte. \n\nUnd plötzlich, sogar mit Beweise (wenn du willst sende ich sie dir auch), wird mein Account permagebannt weil anscheinend was so schlimmes damit angestellt wurde...\n\nhast recht, klingt sehr logisch!\n\nlg","replies":[]}]}]}