{"poster":"One Trick Butt","date":"2015-05-31T15:42:39.230+0000","title":"rumble mainen?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey leute ich suche in letzter zwit verzweifelt nach einem neuen soloq champion.  Vor kurzem bin ich auf Rumble gesto&szlig;en. Insgesammt gef&auml;llt mir sein kit ziemlich  auch wenn ich meistens die ulti nie treffe.  Ich mache so gut wie immer am meisten schaden im ganzen Spiel schaffe es aber nicht zu carrien.\r\nist rumble &uuml;berhaupt ein guter pick f&uuml;r einen silber bob wie mich?\r\n\r\n\r\nLG","replies":[{"poster":"Serage","date":"2015-06-01T06:58:09.330+0000","up_votes":1,"down_votes":0,"body":"In Silber ist eigentlich egal welchen Champ du mainst, da du mit jedem carrien kannst. Konzentrier dich auf einen Hero und du wirst aufsteigen, wenn du mit ihm besser wirst. Ich bin mit only Akali auf Plat1 gekommen und das selbst, obwohl ich mit allen anderen Rollen so meine Schwierigkeiten habe...","replies":[]},{"poster":"Forunes Of War","date":"2015-05-31T18:59:56.381+0000","up_votes":1,"down_votes":1,"body":"Moin,\nzwar spiele ich Rumble kaum in Ranked aber in letzter Zeit wieder mehr in Normals.\nIn meinen Augen wird der kleine Yordle viel zu sehr unterschätzt ,\nAm Anfang hatte ich auch meine Probleme aber es gibt im Internet einige gut Videos die ich dir empfehlen würde.\nDa siehst du was man baut und wie man in bestimmten Situationen mit ihm reagiert.\nDie Ult am besten immer in TF setzten.\nUnd ja das Hitzemanagment ist nicht leicht......\n\n{{champion:68}} \n{{champion:68}} \n{{champion:68}} \n\n\nLG Forunes\n[keine Haftung für Rechtschreibfehler]","replies":[]},{"poster":"Stiv1234","date":"2015-05-31T16:09:13.723+0000","up_votes":1,"down_votes":1,"body":"Rumble ist für mich einer der schwersten, wenn nicht der schwerste Champ im Spiel. Das Hitzemanagement erfordert einige Erfahrung, aber wenn du ihn gut kannst, machst du im Early fast jeden auf der Toplane und räumst noch im Late die Teamfights richtig auf.","replies":[]},{"poster":"Alustus","date":"2015-05-31T15:52:06.962+0000","up_votes":1,"down_votes":1,"body":"Ich bin jetzt kein Profi, und kann auch sein das ich kompletten bockmist rede.\n\nGrundsätzlich kann man mit jedem Champion carryn.\n\nAber rumble würde ich jetzt so nicht empfehlen, auch wenn er ein starker champion ist.\n\nIch denke Tryndamere, Jarvan, Amumu, Ahri, Jax, Leblanc, Riven, Panteon sind im soloQ super zum carrien.\n\n\nAber grundätzlich kannst du mit jedem Champ zu Dia spielen.","replies":[]}]}