{"poster":"a special one","date":"2016-11-14T21:31:25.211+0000","title":"Ok vayne really does need a nerf","subforum":"Gameplay","up_votes":102,"down_votes":20,"body":"Many people think vayne should be olafed, if u think that, u probably have the IQ of the room temperature. However she does need a nerf, coming from a vayne main. Right now the problem with vayne is that she has too much burst and really does too much dmg to squishy targets, so reducing her ad per level by around 1.2 would be pretty harsh but would put her in an ok spot, another solution is to simply revert the q changes and reduce its scaling by 20%, she would still be in the meta but not op","replies":[{"poster":"Jbels","date":"2016-11-14T21:43:04.596+0000","up_votes":42,"down_votes":0,"body":"I think the biggest problem with her design is that she isn't a tank shredder, she's an everyone shredder. The nature of her kit is supposed to make her an attractive pick for shredding tanky targets, but due to the nature of her build, she'll be shredding squishy targets even faster. I don't understand the hyper carry argument either. Why is saying a champion has to farm to get items an okay argument for how she has too much power overall?","replies":[{"poster":"Poop Jelly","date":"2016-11-15T02:40:14.702+0000","up_votes":7,"down_votes":1,"body":"I remember earlier in S6 Vayne was considered a balanced champ. But then ADCs just kept getting changed and nerfed while Vayne got buffs so here we go again. Nothing new, some numbers changed and she should be back to being balanced.\n\nThough I want Botrk Vayne back, Infinity Edge standard ADC build is so boring on Vayne.","replies":[{"poster":"Volcanuz","date":"2016-11-15T07:20:34.277+0000","up_votes":4,"down_votes":1,"body":"So much this.\n\nShe wasn't a threat early in season 6. It wasn't until her rival champs got nerfed hard that she started to shine again.\n\nEven now my main, twitch, struggles against her when before S6 i would take her out easy nearly every game.","replies":[{"poster":"Twichty","date":"2016-11-15T07:45:21.169+0000","up_votes":3,"down_votes":1,"body":"Ya but I don't want it so {{champion:67}}  gets her ass kicked nearly every game by other adcs. I do think she is too strong but I can't ignore the fact that everyone wants her nerfed, but please if you don't have a suggestion for a balance don't recommend just a nerf also something that can even it out, because many people enjoy her and we don't want her to be{{champion:266}}.","replies":[]}]}]}]},{"poster":"HazyCloud7","date":"2016-11-14T22:44:40.989+0000","up_votes":20,"down_votes":2,"body":"Solution: Make it so that the extra Q damage cannot crit.","replies":[{"poster":"a special one","date":"2016-11-14T22:51:07.997+0000","up_votes":4,"down_votes":23,"body":"too harsh","replies":[{"poster":"HazyCloud7","date":"2016-11-14T22:56:18.068+0000","up_votes":27,"down_votes":1,"body":"Azir & Kalista's nerfs were too harsh but playing against them was a very bad experience so they got them anyway. She can't be an assassin that kills the other adc and midlaner in 2 autos and still shred tanks.","replies":[]},{"poster":"LankPants","date":"2016-11-15T05:26:35.815+0000","up_votes":9,"down_votes":2,"body":"Why is this too harsh? \n\nVayne can never be balanced as long as she has both absurd burst and absurd true damage. One has to go. This get rid absurd burst, so It's a solid change.\n\nIf you want to keep your insane 'tumble in and 2 shot a carry with a 1.4K crit' bullshit then you need to lose your tank shredding ability altogether. Something like making Silver Bolts deal physical damage rather than true would suffice for this.\n\nThe simple fact here is that Vayne can't be an ADC/Assassin hybrid who gets all the strengths of both and none of the weaknesses of Assassins, I'd say weaknesses of ADCs too, but who are we fucking kidding at this point?\n\nYou also only think this is too harsh because you're incredibly biased. You posted [this](http://boards.na.leagueoflegends.com/en/c/gameplay-balance/X67GI3Hj-to-all-of-u-who-thinks-vayne-needs-nerfs) two days ago, am I really to believe that your opinion has done a complete 180 since then? You don't think Vayne is as powerful as she actually is, I'd be surprised if you truly think she's actually too strong. Any time someone suggests a reasonable change you're going to scream 'too harsh' because of your biases. ","replies":[{"poster":"Sightless66","date":"2016-11-15T07:10:31.606+0000","up_votes":4,"down_votes":4,"body":">Why is this too harsh? \n\nBecause that's a very large amount of damage to lose, and it's disproportionate to her actual balance state. It's a larger nerf than the buffs that got us into this mess.\n\nA more reasonable option would be reducing the amount of damage it can crit for (something like having the bonus get only a 50% crit), or reverting the buffs to the amount of damage the Q does. That damage reduction would very likely be more than sufficient to bring her to a balanced state.\n\nAnd for the record, this is coming from someone who doesn't play Vayne, doesn't own Vayne, and rather dislikes Vayne.","replies":[{"poster":"Big Lincoln","date":"2016-11-15T14:47:58.297+0000","up_votes":6,"down_votes":1,"body":"how is it disproportionate when it's just a revert of the buffs she got","replies":[]},{"poster":"oSEXYPLATYPUSo","date":"2016-11-15T11:53:05.446+0000","up_votes":2,"down_votes":1,"body":"unless you are on the side of completely destroying vayne you are wrong...","replies":[{"poster":"Verdade","date":"2016-11-16T00:01:53.092+0000","up_votes":1,"down_votes":0,"body":"Vayne's Q is the only enhanced AA in game that can crit","replies":[{"poster":"OMGSoAnnoying","date":"2016-11-16T01:38:58.546+0000","up_votes":1,"down_votes":0,"body":"This is not correct. There are several champs that get crits on enhanced AAs.\n\nXin Zhao is a perfect example - his Q enhances his AA, and so long as he has W at all, one of those three attacks WILL crit. Nasus Q can crit (which is really nasty when he has triforce). I know there are more, but those are the first two I could think of offhand.","replies":[{"poster":"Ai Tilt Lord","date":"2016-11-16T16:57:16.399+0000","up_votes":1,"down_votes":0,"body":"Pretty sure triforce no longer offers crit, why you would want crit on nasus is questionable.. Sorry, I'll let you guys continue on the real topic at hand :3","replies":[]}]},{"poster":"oSEXYPLATYPUSo","date":"2016-11-16T00:11:21.224+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Verdade,realm=EUNE,application-id=3ErqAdtq,discussion-id=N8wYVtsK,comment-id=000400000001000000000001,timestamp=2016-11-16T00:01:53.092+0000)\n>\n> Vayne&#x27;s Q is the only enhanced AA in game that can crit\n\nok i never said she wasnt... \n\nim saying for a fair trade if her empowered Q ends up as a crit the scaling bonus damage on her Q dont apply just the base crit damage... and if she dont crit let the empowered auto apply the scaling bonus damage \n\nshe cant crit if she dont have crit chance? correct? so not all empowered Qs are crits?","replies":[{"poster":"Verdade","date":"2016-11-16T02:54:22.118+0000","up_votes":1,"down_votes":0,"body":"Actually her Q crits as whole, not just the base part but bonus part aswell.\nInfinity Q crit deals 4.25 x Total AD, which is just as high as whole Wu-kongs R","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-11-16T02:57:42.573+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Verdade,realm=EUNE,application-id=3ErqAdtq,discussion-id=N8wYVtsK,comment-id=00040000000100000000000100000000,timestamp=2016-11-16T02:54:22.118+0000)\n>\n> Actually her Q crits as whole, not just the base part but bonus part aswell.\n> Infinity Q crit deals 4.25 x Total AD, which is just as high as whole Wu-kongs R\n\ni know it does... \n\ni never said it didnt... but it only crits when you get crit... it dont crit on its own... and it is subjected to RNG OF CRIT CHANCE meaning the more crit strike chance she gets the more likely it is to crit.. \n\nbut what i was trying to get across which no one seems to pick up on... having her Q be situational ... if she crits while using Q she does the crit damage and not the scaling bonus damage on her Q and if she dont crit then she does damage based off of her scaling bonus damage on Q","replies":[]}]}]}]}]}]},{"poster":"a special one","date":"2016-11-15T16:24:39.005+0000","up_votes":2,"down_votes":5,"body":"i am biased but im also a quite high elo vayne main, so give me some credit on this.","replies":[{"poster":"Apretus","date":"2016-11-15T16:28:14.142+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=FBI Officer,realm=EUW,application-id=3ErqAdtq,discussion-id=N8wYVtsK,comment-id=0004000000010001,timestamp=2016-11-15T16:24:39.005+0000)\n>\n> i am biased but im also a quite high elo vayne main, so give me some credit on this.\n\nwe do give u credit, but since it doesnt affect the lcs i doubt there will be any major changes to her. but still, polay her as long as u can before she gets thrown into the void.{{sticker:slayer-jinx-wink}}","replies":[]}]}]}]}]},{"poster":"Handy Sandy ","date":"2016-11-14T21:32:40.869+0000","up_votes":12,"down_votes":0,"body":"if she gets olafed shes gonna be so strong, look at olaf. Immune to cc adc wtf","replies":[{"poster":"a special one","date":"2016-11-14T21:35:04.088+0000","up_votes":8,"down_votes":1,"body":"ye man exactly, that would be such a bad idea, imagine a tanky vayne but with axes flying around and cc immunity, 2op","replies":[]}]},{"poster":"khorney","date":"2016-11-14T22:35:38.362+0000","up_votes":12,"down_votes":5,"body":"what she needs is to lower her base ad and lower her aa range","replies":[{"poster":"a special one","date":"2016-11-14T22:51:32.259+0000","up_votes":8,"down_votes":13,"body":"WAY too much, would gut her","replies":[{"poster":"Scionic Rampage","date":"2016-11-14T23:54:53.028+0000","up_votes":7,"down_votes":2,"body":"I'd say just lower her AA range.\n\nIf she is meant to be a marksman assassin, she shouldn't have that much of a range if shes' both.\n\nThis way she has to position herself more carefully and put more risk in. (Also she uses a 1 handed crossbow, that range is no were near larger ranged weapons)\n\nBasically all assassins have to risk it for the biscuit, vayne should have to as well.","replies":[{"poster":"LankPants","date":"2016-11-15T05:36:39.969+0000","up_votes":11,"down_votes":1,"body":"If you want her to be an Assassin ADC you also need to take away her tank shredding ability because an Assassin who doesn't give a fuck about tanks is a really, really bad idea, as has been proven by Zed historically and Vayne right now.\n\nI'm not opposed to Vayne being more assassin like but if she is then she needs to lose some of the tank shredding ability from Silver Bolts. Maybe setting it up as something like a %missing HP magic damage hit rather than %max HP true damage would play more into an assassin like pattern.","replies":[{"poster":"PB4UAME","date":"2016-11-15T06:19:46.209+0000","up_votes":10,"down_votes":0,"body":"^This.  Vayne must be made to choose between uncounterable  stealth + self peel + CC + ridiculous mobility and all other facets of her assassin nature, and her fucking massive 12% MAX HP true damage.\n\nShe should either be able to get in and blow up squishies with a way out, and situational defensive tools to keep her safe a la assassins, or she should be able to melt any tank regardless of how they build or what they do.\n\nShe should not be allowed to have her cake, eat it to, and invalidate pretty much all melees that don't have ranged, targeted CC, or huge AoE CC ultimates.","replies":[]}]}]}]},{"poster":"xelaker","date":"2016-11-15T02:03:22.760+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=khorney,realm=NA,application-id=3ErqAdtq,discussion-id=N8wYVtsK,comment-id=0003,timestamp=2016-11-14T22:35:38.362+0000)\n>\n> what she needs is to lower her base ad and lower her aa range\n\nher range is already sub-par...they just need to remove the ability to crit from her abilities","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-11-15T02:29:16.130+0000","up_votes":2,"down_votes":4,"body":"q isnt an ability like caits piltover its is an enhanced auto attack... like nasus ... it still is an auto attack which if you build crit you should be able to crit","replies":[{"poster":"PB4UAME","date":"2016-11-15T06:26:32.637+0000","up_votes":4,"down_votes":1,"body":"Jax's empower can't crit, nor can Trundle's q, nor can: Teemo's E, Diana's passive proc, Alistar's E empowered auto, Braum's empowered autos, Blitz's E, etc etc.  There are virtually no empowered auto attacks that the full thing can crit.  Even Garen's Q only crits the base damage, same with Xin and Dravem's Q. \n\nAdditionally, I don't think you even know what you're talking about as only the base damage on Nasus' Q crits, the bonus damage, and the AD ratio does not-- to make the statement that you did, Vayne's Q should, again following your own logic, have its base damage (0) be able to crit, and the scaling bonus damage not be able to. . . which is a long way to say her Q shouldn't crit.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-11-15T11:20:45.244+0000","up_votes":1,"down_votes":0,"body":"no you arent reading it correctly... crit is based on crit % if you crit on your Q you dont get the BONUS PHYSICAL DAMAGE: 30 / 40 / 50 / 60 / 70% AD but if you dont crit based on RGN of crit % you get the BONUS PHYSICAL DAMAGE: 30 / 40 / 50 / 60 / 70% AD","replies":[{"poster":"PB4UAME","date":"2016-11-15T15:38:25.199+0000","up_votes":1,"down_votes":0,"body":"I have no idea what the fuck you're talking about. \n\nHere's how empowered autos work.\n\nThey have 2 components: base damage (the part that can crit if its applied as a physical on-hit in most cases), and then they have scaling damage (this part virtually never crits, can scale off AD/AP/kills[for Nasus] depending on champ).\n\nVayne's Q is an empowered auto.  It however, is fairly unique in that it doesn't have a base damage.  As it is live, Vayne can crit for the scaling portion of her Q, as a few patches ago RIOT decided she needed this buff for no fucking reason.  No other character in the game (iirc) has an empowered auto that the full damage on it can crit.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-11-15T23:09:35.302+0000","up_votes":1,"down_votes":0,"body":"but she cant crit with just Q she has to have crit chance and she would have to proc a critical strike based on the RGN of crit chance. \n\nim saying if she ends up getting a crit then just give her the crit damage and dont apply the bonus damage that Q scales on ... but if her attack isnt a critical strike then let her have the bonus damage from Q on the attack\n\none or the other.. depending if she crits or not","replies":[{"poster":"PB4UAME","date":"2016-11-16T14:03:47.420+0000","up_votes":1,"down_votes":0,"body":"I see.  \n\nI would disagree here, and say it would just make more sense for it to not crit the bonus damage period.  \n\nIf it functioned as you discribed then hitting 100% crit chance would entirely remove the AD app as it would never proc.  This is the extreme case but it highlights the fundamental problem, it now punishes Vayne for criting on her Q auto rather than the one either before or after it.\n\nSay she autos three times, aa, q -> aa, aa.  If she crits on the first or third attack she'll still get her 70% ad bonus on the 2nd one.  If she crits on the second attack however, now she gets the same crit damage as the non-q amped 1st or third auto attack, and will never get the q's AD amp.  Effectively, she'd have conditionally lower DPS for using her Q for each point of crit chance she got.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-11-16T23:14:52.220+0000","up_votes":1,"down_votes":0,"body":"but the issue is that people cry her damage with crit on Q is too strong/broken. yes? \n\nso if you make it as i suggest it would provide a way to curve her damage output with out completely hindering it.  and typically adcs end up with 50% crit chance unless they build 3 crit items . but heres the kicker majority of the crit items in the game dont provide AD just crit, as and some unique aspect of the item... so if you build more then 50% crit chance with out getting ad you lower your crit damage... do to lower over all ad but you increase yoru crit chance ... \n\njust for example you build {{item:3031}} {{item:3094}} {{item:3046}} {{item:3153}} {{item:3036}} giving you 80% crit chance and 145 ad and if you crit you do 250% damage giving you 363 physical damage *not including armor pen or other passives*  \n\nbut if you build {{item:3031}} {{item:3094}} {{item:3072}} {{item:3153}} {{item:3036}} \nyou have 50% crit chance but 75 more ad for  total of 210 ad x 250% *for crit strikes* for 525 physical damage \n\nnow they trade off is one build you crit more often and have more attack speed the other is more raw damage crit less often and have less attack speed \n\nbut a difference of 162 physical damage per crit but where does one out damage the other? \n\nso they theory i put forth if would it be worth it to get more crit chance where if she crits the scaling damage on Q isnt applied? or less crit chance so if she dont crit she still gets the scaling damage on her Q more often ?","replies":[]}]}]}]}]}]}]}]}]},{"poster":"ValyrianBlade","date":"2016-11-15T01:22:13.703+0000","up_votes":9,"down_votes":0,"body":"Vayne is one of those champions that gets REALLY strong whenever she comes in to power.\n\nThey need to find a way to balance her long term. I think it's in shifting a LOT of her power to Silver Bolts (and ideally AWAY from her ult). Make her do an amazing job at shredding tanks with her silver bolts, but she can only barely kill squishies slightly faster. Barring an outplay (such as getting a condemn stun), Vayne should lose to other ADCs 1v1 given that she has more utility and is better at taking down tanks.\n\nIt would also be healthier gameplay because she needs to auto 3 times to get a silver bolt proc. She can do that instantly with AA-Q-AA-E for the first proc, but if she needs a second rotation it takes the full time. \n\nNow IDK exactly how it should balance it, but I'd imagine increasing the bonus damage on her W while gutting her base damages and especially the AD on her ult would go a long ways towards more long-term stability. Although I really don't know Vayne, so perhaps my opinion is just wrong.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-11-15T01:25:46.390+0000","up_votes":2,"down_votes":4,"body":"there is no long term answer due to meta shifts, item changes, direct and indirect buffs/nerfs to other champs \n\nthat is what makes it impossible to have a perfectly \"balanced\" game.. and her win % of 53% is a lil high... but how do you suggest riot make all 133 champs have a 50% win rate?","replies":[{"poster":"ValyrianBlade","date":"2016-11-15T02:21:31.496+0000","up_votes":9,"down_votes":0,"body":"> [{quoted}](name=MrFawknSunshine ,realm=NA,application-id=3ErqAdtq,discussion-id=N8wYVtsK,comment-id=000c0000,timestamp=2016-11-15T01:25:46.390+0000)\n>\n> there is no long term answer due to meta shifts, item changes, direct and indirect buffs/nerfs to other champs \n> \n> that is what makes it impossible to have a perfectly &quot;balanced&quot; game.. and her win % of 53% is a lil high... but how do you suggest riot make all 133 champs have a 50% win rate?\n\nYou're misunderstanding long term solution.\n\nWhen is the last time Orianna was deemed OP? There are plenty of champions that are perfectly healthy over long periods of time. It's not about keeping them at a 50% win rate, it's about giving them a kit that is healthy for the game. Of course meta shifts will alter their power levels, but they'll still feel useful and playable when weak, and still won't feel super oppressive when strong.\n\nThen look at stuff like Gangplank or Old Poppy or Rengar or what-have-you. They're frequently called in as OP and whenever they're strong they become a real problem for people. Maybe part of it is just some distaste for the champion (e.g. Rengar's snowball-ness) but something like Old Poppy was just unbalanceable. She either was garbage or broken OP - there was no in between. The idea is to make champions that can succeed when they're weak and can be beaten when ahead - so that as the meta changes and updates are made they may shift in power levels, but they don't become a systematic problem to game balance.\n\nWhen a champion is brought up as problematic every time an item they like gets changed or every time their counters are altered, there's probably something inherently unhealthy about how they work. For Vayne, that's being designed as a champion who's supposed to be a true tank shredder, but who just shreds anyone regardless and can 1v1 just about anyone in the game once she hits level 6. ","replies":[{"poster":"NineTailedMystic","date":"2016-11-15T08:33:29.725+0000","up_votes":3,"down_votes":0,"body":"> When is the last time Orianna was deemed OP?\n\nEh, Ori could stand some minor nerfs to her damage for the utility she provides, but not OP per se.","replies":[]}]}]}]},{"poster":"Venomar","date":"2016-11-15T03:46:01.728+0000","up_votes":7,"down_votes":0,"body":"Honestly vayne needs a nerf for the same reason every other ADC has gotten nerfs.  3rd Highest playrate with the highest win rate.  That's it,  there's really no other reason about it other than her representation and performance are trending way too linearly upward,  and you can't argue that point,  it's numbers,  it's facts.  \n\nI'd throw twitch into that ring too,  but doesn't get attention because he isn't played as much (yet).   He only dips below 53% in the Midgame,  which completely breaks his end game scaling hyper carry design. Vayne at least still trends upwards in game length(but still starts too hard). They made his lane phase way too stronk with his W change.  I've no idea how riot didn't see that coming(and with BOTRK getting buffed he will be getting better since it's core with Youmuus changes).  And that's a shared opinion of a lot of smarter better players than I, not just my barely silver ass.  \n\nHe also has a mixed match vs Vayne so if she gets nerfed his win rate will skyrocket being Cait is the only one that can really still counter him and keep him under seige. Actually Cait is the only ADC he has a negative win rate against presently.\n","replies":[]},{"poster":"oSEXYPLATYPUSo","date":"2016-11-14T23:20:41.290+0000","up_votes":1,"down_votes":8,"body":"vayne already has the 4th lowest base ad in the game being 84","replies":[{"poster":"Scionic Rampage","date":"2016-11-14T23:56:17.629+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=MrFawknSunshine ,realm=NA,application-id=3ErqAdtq,discussion-id=N8wYVtsK,comment-id=0005,timestamp=2016-11-14T23:20:41.290+0000)\n>\n> vayne already has the 4th lowest base ad in the game being 84\n\nShe already gets a super short cool down on her Q that adds a shit ton of mobility and extra AD ratio. (It's justified)","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-11-14T23:57:27.679+0000","up_votes":2,"down_votes":0,"body":"never said it wasnt... just stating nerfing her base ad isnt the best way to go...","replies":[]}]}]},{"poster":"WiegrafOfValor","date":"2016-11-15T00:57:45.616+0000","up_votes":4,"down_votes":2,"body":"I think is really easy to fix vayne right now, Riot aways seems to tackle the problem from the wrong direction.\n\n>#TRUMPLE [Q]\nRANGE: 300 \nCOST: ~~30 MANA~~ >> 20 MANA \nCOOLDOWN: ~~6 / 5 / 4 / 3 / 2~~  >> 8 / 7 / 6 / 5 / 4\n\n>ACTIVE: Vayne quickly rolls toward the cursor's location, causing her next basic attack within 7 seconds to deal bonus physical damage, ~~which critically strikes if the attack is also a critical strike~~.\n\n>BONUS PHYSICAL DAMAGE: ~~30 / 40 / 50 / 60 / 70% AD~~ >>  30 / 35 / 40 / 45 / 50% AD\n\nMay look like a huge nerf, but she never needed so much power on her Q, she can do all right just with her AA and superior kitting. No need for burst on her kit.","replies":[{"poster":"hhaavviikk","date":"2016-11-15T07:42:36.664+0000","up_votes":3,"down_votes":1,"body":"as much as I dislike vayne that is a significant nerf to her ult stealth, her ult lasts 8/10/12 seconds, if her tumble cooldown is 4 seconds then that is a huge nerf to her stealth capabilities","replies":[{"poster":"WiegrafOfValor","date":"2016-11-15T15:45:19.816+0000","up_votes":2,"down_votes":0,"body":"* Vayne Q with 2 sec at lvl 18 + 40% CDR = 1.2\n\n12 / 1.2 = 10 times = perma stealth, unless attacking. \n\n* Vayne Q with 4 sec al lvl 18 + 40% CDR = 2.4\n\n12 / 2.4 = 5 times \n\nMost of the times you trumble 2 to 3 times during her ult, isn't quite the nerf as you may think.","replies":[{"poster":"Sightless66","date":"2016-11-15T17:16:09.115+0000","up_votes":1,"down_votes":0,"body":"Why the heck are you calculating this with cdr, let alone 40%? When do you ever see a Vayne building cdr?\n\nAdditionally, your calculation wouldn't be valid even at 40% cdr because you haven't actually accounted for the fact that the ability does not go on cooldown until you actually attack. You have to account for up to 1.5 seconds spent in stealth repositioning.","replies":[{"poster":"WiegrafOfValor","date":"2016-11-15T18:41:58.315+0000","up_votes":1,"down_votes":0,"body":"{{item:3508}} {{item:3031}} {{item:3046}} + CDR runes or {{item:3158}} \n\nWhat world do you live in.. O_O this is almost core on every vayne right now\n\n40% CDR means your ult will be up more, and you'll aways be safe even when your flash is down..\n\nPlus if you build shiv = 100% crit","replies":[{"poster":"Sightless66","date":"2016-11-15T20:50:29.596+0000","up_votes":2,"down_votes":0,"body":">What world do you live in.. O_O this is almost core on every vayne right now\n\nNo it absolutely is not, and I can show you numbers proving it. [ER shows up in neither her most common, nor her highest winrate build.](http://champion.gg/champion/Vayne/ADC) Additionally, if we look at item stats for plat+ play, we can see that [Essence Reaver is built 0.5% of the time and CDR boots are built less than 0.1% of the time.](http://www.leagueofgraphs.com/champions/items/vayne/platinum)\n\nI don't know where you got the idea that this is in any way a common build, but it's a misconception. Her core build is Shiv into IE. CDR has no place in her build.","replies":[{"poster":"ChaosThief","date":"2016-11-16T00:39:35.894+0000","up_votes":1,"down_votes":0,"body":"I mean, 0.0% of people built a mejais on vayne and got 100% win rate... data can be skewed.","replies":[{"poster":"Sightless66","date":"2016-11-16T00:43:20.713+0000","up_votes":1,"down_votes":0,"body":"I didn't talk about winrate. He claimed ER was the core build for Vayne. Playrate alone proves that to be wrong. It by definition is not the core build if no one ever builds it.","replies":[]}]}]}]}]}]}]}]}]}