{"poster":"Dustin DeWind","date":"2017-01-04T16:00:16.727+0000","title":"Fehlermeldung beim Client starten","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Halo ich hab ein Problem, ich hab gestern meinen Grafiktreiber aktualisiert und hatte dann beim Lol starten (neuer Client) die Fehlermeldung, dass mscvcp140.dll und vcruntime.dll fehlen w&uuml;rden. Hab die dan neu geholt und jetzt kommt die Fehlermeldung: Kann nicht gestartet werden 0xc000007b.\r\n\r\nHab schon alles versucht Lol neu gestartet (ging dann beim alten Client aber hat dann wieder auf den neue gepatcht und geht da wieder nicht), Directx neuinstalliert. Nichts immer die selbe Meldung.\r\nHab Windows 10 64 bit Grafikkarte ist AMD Radeon R9 380x (Treiber 16.12.1 Radeon Crimson Software)\r\nWei&szlig; echt nicht woran es liegt und es ist nur beim neue Client. Kann den neuen auch nicht entfernen.\r\n\r\nDanke f&uuml;r jede Hilfe","replies":[{"poster":"Dustin DeWind","date":"2017-01-04T16:59:50.005+0000","up_votes":1,"down_votes":0,"body":"Mein CPU ist noch von AMD.\nJa hab ich neuinstalliert. Ich komm aber nicht soweit, dass ich drauf klicken kann. Kommt ja schon die Meldung bevor iwas offen ist.\nHab ich gegoogelt, einziger Tipp war die DirectX sachen wegzuwerfen und neu drauf zu machen. Hab ich gemacht.\nMittlerweile kommt keine Fehlermeldung mehr(hab beim alten Client auf reparieren geklickt :D)\nsondern nichts mehr ^^ Steht einfach nur das League of Legends Symbol da und es passiert nichts.","replies":[{"poster":"Homunculi","date":"2017-01-04T19:23:05.027+0000","up_votes":1,"down_votes":0,"body":"Führe den Launcher mal als Administrator aus.","replies":[]}]},{"poster":"Homunculi","date":"2017-01-04T16:37:16.172+0000","up_votes":1,"down_votes":0,"body":"Es gibt \"Removing Tools\" von/für AMD Produkte, meistens schmeissen die aber alles raus, also wenn du mehr als einen AMD Chip drin hast, muss du dafür wieder die Treiber drauf bügeln.\n\nHast du directX 9 neu installiert?\n\nWenn du den neuen Client meinst, es gibt die Möglichkeit auf den alten zurück zu gehen. Im Start Menü, rechts unten \"Alten Client starten\"\n\nHast du schon nach der zweiten bzw. dritten Fehlermeldung/-Code gegoogelt?","replies":[]}]}