{"poster":"xSiMoX99","date":"2015-12-25T21:21:09.093+0000","title":"LeBlanc","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"ho visto dei montage di lb,devo dire &egrave; molto forte,soprattutto se cominciate a fiddarvi in early.Ma diventa molto pi&ugrave; difficile in late,a meno che ci sono tf con un team buono o per lo meno decente c&#039;&egrave; la si pu&ograve; fare.Ho il desiderio di acquistarla.Me la Consigliate?","replies":[{"poster":"Apônivi","date":"2015-12-25T22:09:41.726+0000","up_votes":4,"down_votes":0,"body":"Ciao! Leggendo quanto da te scritto volevo solo dirti una cosa: i teamfight non sono una fase obbligata della partita. Prima che tu o altri incomincino a dire \"omg noob che **** scrivi\" ti spiego che intendo. \n\nCi sono team composition che non sono fatte per combattere nei teamfight. Sono quelle squadre in cui mancano controlli applicabili a più persone e che non hanno danno AoE degno di nota. Il fatto che tu dica \"non è buona nei teamfight\" deriva (immagino) dall'esperienza che ti sei fatto giocando in linea generale con un team di sconosciuti o con pochi premade. Quando si gioca in team ranked però, diventano possibili scenari che difficilmente si riesce a immaginare giocando da soli. \n\nIl teamfight e la sua importanza derivano dal fatto che scegliere champion che si \"incastrano\" bene l'un l'altro nel momento in cui si gruppa costituisce una sorta di garanzia per il late game. \n\nImmagina di avere un team con poca sinergia (mancanza di controlli, danno primariamente single-target) che si scontra con un team che invece gode di stun ad area, un sostanzioso danno AoE, possibilità di chainare controlli di vario tipo, debuff... \nA parità d'esperienza, è il secondo team che ha la meglio.\n\nComprendere i limiti di un champion (e in generale di un team) significa anche sfruttarli. \n\nLe Blanc è famosissima per l'incredibile quantità di danno che infligge in frazioni di secondo. Sbuca dal nulla e BAM! Morto. Il suo kit è improntato sull'eliminazione di bersagli vulnerabili; in teamfight, non avendo i danni AoE di una Orianna o una Annie (ma la lista è molto più lunga) costituirà uno svantaggio su carta. \n\nMa con un team organizzato si può enfatizzare ciò in cui Le Blanc eccelle: l'assassinio. Come? In late, invece di teamfightare continuamente, immagina di avere il controllo della giungla nemica con un'appropriata visione. Diventa subito facile punire bersagli squishy inconsapevoli di essere osservati.\n\nQuesto tipo di strategia è chiamato **pick**, perché appunto si \"prende\" un bersaglio e lo si elimina. Fatto questo ogni possibile scontro diventa un 5vs4. \nSe il team nemico si ritira si possono prendere obiettivi; se li contesta si può fightare con un vantaggio numerico. \n\nInsomma, esistono tante forme di vittoria, che non per forza deve passare attraverso il brutale scontro di dieci campioni sulla mappa.\n\nSpero che quello che ho scritto ti sia risultato interessante e utile.\n\nCiao e buone feste :)","replies":[]},{"poster":"SideshowEMS","date":"2015-12-25T21:49:59.907+0000","up_votes":1,"down_votes":0,"body":"Quelli che hai scritto sono propio i suoi problemi. Sai già quello che compreresti insomma.\nNon dovrei dirtelo io, visto che l'ho presa perché mi piaceva la sua illustrazione ( XD ), ma se pensi di cavartela in late sapendo che potrebbero renderti inutile, allora prendila.\n\nPoi sta a te ovviamente. Tutti i campioni hanno dei limiti, e se a te piacciono le abilità di LB allora comprala. \nCioè, se volessi usare Malphite non mi aspetterei di giocare come ADC. Capito ?","replies":[]},{"poster":"Mytlix","date":"2015-12-25T21:52:47.658+0000","up_votes":1,"down_votes":1,"body":"Assolutamente si.\n Pro:\nDanni ignorante\nRanged\nMobility\nEscape\nPassiva op\n\nContro:\nMolto difficile da mainare\nSquishy\nNon è buono nei tf","replies":[]}]}