{"poster":"Keyz","date":"2016-06-06T15:55:16.566+0000","title":"Arnet: el problema de todos los años","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"pues ya por decima quinta vez desde que juego digo lo mismo, desde el parche 6.8 al parche 6.10 venia jugando tranquilamente con sus 60ms, 57ms minimo, luego tuve una subida de ping exagerada intermitente, y luego volv&iacute; a mis antiguos 88-89 ms, 85 minimo, lamentablemente el unico servicio por el que puedo optar en mi ciudad es arnet, y tengo 1 sola alternativa que es fibertel por el cual de momento no puedo pagarme un cambio de isp.\r\n\r\nsegundo: por qu&eacute; en brasil siempre me anda a 60ms y en las sucede esto? porque la verdad no entiendo como funciona el tema de enrutamiento.\r\n\r\ntercero: si alguno sabe como modificar la ruta sea tan amable de compartirla en la caja de comentarios de este post (ah re youtuber el pibe)","replies":[{"poster":"Maszke","date":"2016-06-06T16:08:32.140+0000","up_votes":2,"down_votes":0,"body":"lo mismo loco, tenia 50 de ping minimos, 55 maximos, ahora es 75 minimo, 150 maximo en picos de lag.{{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"Conejito Feliz","date":"2016-06-06T16:05:30.058+0000","up_votes":1,"down_votes":0,"body":"Hay una vpn pero depende que tan lejos estes capaz no te sirve. En mi caso la vpn me sube el mismo ping que el problema que hay ahora.\n\nEsta ruteando a brasil y de ahi a chile. Osea que tenes el ping del server brasilero + el viaje hasta chile. Por eso siempre hay mas ping a chile que brasil.\n\nTelecom siempre dio problemas con chile y menos con brasil. Desde hace años. Si estas cansado de renegar empeza en brasil y no vuelvas mas para aca xD.\n\nYo ahora estoy jugando ww jungla. 20 ms mas no me van a afectar.","replies":[{"poster":"Keyz","date":"2016-06-06T16:07:48.561+0000","up_votes":1,"down_votes":0,"body":"el tema es que no son 20ms mas, son casi 40 ms mas ¬¬ de 57 ms minimo, a un minimo de 85 son 28ms adicionales, ni hablar cuando sube a 88 o inclusive a 90 que en ese casi son de 30 para arriba...","replies":[{"poster":"Esti","date":"2016-06-06T16:37:42.247+0000","up_votes":1,"down_votes":0,"body":"De hecho, puedes jugar bien hasta 150ms. Más de eso se nota y mucho","replies":[{"poster":"Conejito Feliz","date":"2016-06-06T17:05:48.054+0000","up_votes":1,"down_votes":0,"body":"Una cosa es jugar, otra es \"jugar\". Si estas acostumbrado a jugar con 50 o menos. Cuando jugas con 100 o mas te sentis super lento en reacciones. Jugas con 120 contra alguien que teiene 20 y la vas a pasar mal. A menos que estes en bronce. Ahi nada importa.","replies":[{"poster":"Maszke","date":"2016-06-06T17:09:15.085+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Conejito Feliz,realm=LAS,application-id=v7qsfXsE,discussion-id=2VHQOQEm,comment-id=0000000000000000,timestamp=2016-06-06T17:05:48.054+0000)\n>\n> Una cosa es jugar, otra es &quot;jugar&quot;. Si estas acostumbrado a jugar con 50 o menos. Cuando jugas con 100 o mas te sentis super lento en reacciones. Jugas con 120 contra alguien que teiene 20 y la vas a pasar mal. A menos que estes en bronce. Ahi nada importa.\n\ncuando jugas champs con mecanicas se nota mas de la cuenta. medio segundo tarde es darle tiempo al otro para que flashee o te ownee.","replies":[]}]}]}]}]}]}