{"poster":"Christoph","date":"2018-10-28T18:02:23.065+0000","title":"El soporte, duda","subforum":"Charlas Generales","up_votes":5,"down_votes":0,"body":"Tuve un problema en el que me com&iacute; 2 leaverbsuter porque se me congelaba el juego y cuando volvia daban remake, quedando yo sancionado con eso me com&iacute; las dos menos una osea fueron 9 partidas porque 1 me la saco el soporte.\nPero a la tercera que me dieron y que tengo ahora pensando que se solucion&oacute; ya no ando jugando, estando con leaverbuster de 5 partidas.\nY el soporte le escribi el 26 de octubre en la tarde y ese mismo d&iacute;a me respondieron 6 horas despu&eacute;s a las 9 y desde esa me dijo que iba a &quot;escalar mi caso&quot; cosa que no se que poronga es la verdad XDD\nPero me parece extra&ntilde;o que un soporte de un juego tarde m&aacute;s de un d&iacute;a para una respuesta ya que estamos 28 de octubre a las 3 de la tarde, dos dias despues de que haya escrito mi mensaje y no haya respuesta \n\nhttp://i67.tinypic.com/eajf2g.png\n\nMI pregunta es que es escalar un caso y si es normal que demoren días en respoonder","replies":[{"poster":"Mull of Kintyre","date":"2018-10-28T23:32:54.022+0000","up_votes":1,"down_votes":0,"body":"Una pregunta, pudiste solucionar el tema del congelamiento del juego? me esta pasando lo mismo","replies":[{"poster":"Christoph","date":"2018-10-30T21:13:54.699+0000","up_votes":1,"down_votes":0,"body":"Juega en modo ventana nomas xd","replies":[]}]},{"poster":"KBZA","date":"2018-10-28T20:34:25.203+0000","up_votes":1,"down_votes":0,"body":"Recién me sancionaron por el mismo problema que tu tienes y estos inútiles en vez de cerrar el juego por unas horas para solucionar el problema de manera mas eficiente, dejan que sanciones injustamente a la gente que quiere disfrutar del juego. Trata de reportar este error  en el servidor de prueba quizás allí nos presten un poco mas de atención. Es la segunda vez que me sancionan , pensé que era mi pc pero no me pasa nada de esto con otros juegos.","replies":[{"poster":"Rakan Wawita","date":"2018-10-29T02:21:08.425+0000","up_votes":1,"down_votes":0,"body":">inútiles\nOjito ahi con la frase","replies":[]}]},{"poster":"Ísaac Foster","date":"2018-10-28T22:47:13.401+0000","up_votes":1,"down_votes":0,"body":"Hola, si es normal que tarden un dia o mas, quizas no te respondan lo ultimo por que creo que no lo especificaste o mientras haya solucionado el problema no importa tanto. Y con lo de \"escalar el caso\" creeria que se refiere a \"investigar el caso\" para ver si es cierto lo que les has dicho.\n Suerte con tu problema y espero no te suceda mas!","replies":[]}]}