{"poster":"DrNova","date":"2015-01-15T18:51:44.724+0000","title":"The problem with Riot(Red's) participation in the forums","subforum":"[ARCHIVED] General Discussion","up_votes":5,"down_votes":4,"body":"I often check the **Red** Tracker, just to see if there is any meaningful feedback on alot of the actual, interesting, gameplay related threads that are posted all of the time.  And there rarely, and I man Rarely, ever is.\r\n**Riot** likes to pride itself (or so I gather) and connecting with the community and being in touch. However its by and large superficial.\r\n\r\nLook at the last week of the **Red** Tracker for instance. 99.9 (probably not an exaggeration) of all **Red** posts are fluff.  The majority of their posts are in threads about Skins, alot of Art and Story board stuff, the occasional \"Funny hypothetical character thing\" thread. The OCCASIONAL bug reply, they touch up on UI posts sometimes....    I found ONE single post actually concerning gameplay/champs, an Ahri thread where someone actually showed up.  (granted there may be one or two more I missed)\r\n\r\nMy point is, there is little feedback/communication from anything that matters. It appears to me that Riot/Red's mainly come here for entertainment, aka skins and stories and fluff like that.\r\n\r\nIn the many item discussions, character discussions, lane discussions, the majority of which often seem aimed AT **Riot/Reds** for clarification or to bring up percieved issues, are ignored. These are the ones that people would like to hear back from.  \r\n\r\nGranted alot of the posts in those threads are recycled \"OMG DIS CHAMP SOO OP\", or other general venting (though the occasional OP champ thread has actual points to consider), but many of them are actual topics worth consideration or debate.  I'd also wager if the feedback on the forums was actually acknowledged more often, maybe there wouldnt be so many desicions seen by the community as poor and bad for champs/gameplay/ect.\r\n\r\nJust my two cents, but naturally, I expect fluff and filler...","replies":[]}