{"poster":"JirajaSama","date":"2015-03-26T01:15:49.091+0000","title":"Troller, feeder e persone che non comunicano in ranked.","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Buonasera a tutti,\nvolevo parlare con voi riguardo la questione dei troller (quelli che pur rispettando il pick order, una volta in partita iniziano a trollare senza aiutare con gli ss o, se sono jungler, senza magari prendere lo smite o gankare ((mi è capitato \"pref jungler\" e all'ultimo secondo cambiavano lo smite in ignite condannando una partita)), o magari di feedda e nemmeno comunica col team ( mi è capitata una Ashe con heal e teleport bot con un bel 0/5 e non si è degnata/o nemmeno di dire \"hi\" nel pick order) .\nOra vi starete chiedendo \"eh ma sei bronzo III avrai fatto schifo pure tu\" , indubbiamente avrò fatto errori ma non così fatali da condannare una partita, non sono mai andato aldilà delle 6 death, anche perchè se son capitato in bronzo III da silver V lo devo grazie a queste tre categorie di persone. \n(Tuttavia ci sono dei bronzo che giocano molto meglio di alcuni silver..)\nNon sto qui a spammare il classico commento con scritto \" rito please perchè coi troller, perche i team buoni mai a me!\" PERO' mi chiedevo.. il report a queste persone, vale qualcosa? per feeding (nel caso di quella Ashe che ho sopracitato), per non aver comunicato con il gruppo (il famoso jungler sopra, un Udyr), o è solo tempo perso, i troller si son divertiti e  io l'ho preso nei cosidetti? o.O Che punizione c'è per individui simili?\nPurtroppo di ranked così ne ho perse molte e per arrivare a fare un topic io del genere significa che veramente mi son scese nei calzini .-.\nGrazie a tutti per la pazienza di aver letto il post, era solo un piccolo sfogo perchè credo sia capitato anche a voi...\n(Se ho fatto orrori grammaticali segnalatemeli, sonno sorry xD)","replies":[{"poster":"Sìrjohn","date":"2015-03-26T10:30:07.250+0000","up_votes":3,"down_votes":0,"body":"> se son capitato in bronzo III da silver V lo devo grazie a queste tre categorie di persone.\n\nOgni volta che qualcuno sostiene questa cosa, nel mondo muore un gattino.","replies":[{"poster":"JirajaSama","date":"2015-03-26T12:07:38.603+0000","up_votes":2,"down_votes":0,"body":"Purtroppo per esperienza personale, temo che moriranno molti gattini allora ^^'","replies":[]}]},{"poster":"Onecesco","date":"2015-03-27T22:19:39.480+0000","up_votes":2,"down_votes":0,"body":"Boh, io ho osservato la mia ragazza giocare (in bronzo 1). E ti assicuro che prendere teleport e non flash, o andare 2 top a quei livelli non cambia nulla in partita. Tanto il flash verrà usato per lanciarsi sotto una torre e quello strano simbolo a forma di fulmine non andrà mai in ricarica. Sono altri i problemi a quei livelli: ad esempio imparare a giocare con lo schermo sbloccato, a non vedere la jungla come un posto pericoloso nel quale è meglio non avventurarsi e magari anche sapere che esiste una minimappa. Poi come dici tu ci sono pure quelli che ste cose le sanno e che non giocano da bronzo ma che tanto builderanno il campione completamente a caso o che faranno sempre scelte sbagliate: ho visto gente skillata che però è convinta che il gioco consista nel fare una penta e recallare senza mai portare a casa 1 obiettivo.","replies":[]},{"poster":"vegetable61","date":"2015-03-26T09:23:12.143+0000","up_votes":1,"down_votes":0,"body":"Per feeding il report è ridicolo. Non vedrai mai qualcuno condannato perchè sta avendo una brutta partita o anche perchè è un noob totale. Il feeding, per essere riportabile, deve essere intenzionale, cioè ad esempio andare addosso alle torri apposta e altre cose simili","replies":[{"poster":"Ryuk1980","date":"2015-03-26T09:41:15.268+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=vegetable61,realm=EUW,application-id=MJVj50Jw,discussion-id=qaxrsGq5,comment-id=0001,timestamp=2015-03-26T09:23:12.143+0000)\n>\n> Per feeding il report è ridicolo. Non vedrai mai qualcuno condannato perchè sta avendo una brutta partita o anche perchè è un noob totale. Il feeding, per essere riportabile, deve essere intenzionale, cioè ad esempio andare addosso alle torri apposta e altre cose simili\n\nSi ma dal log lo capiscono che è feed intenzionale, perchè sanno ogni quanto sei morto. La brutta partita di sta, ma di certo non fai 0/20","replies":[{"poster":"JirajaSama","date":"2015-03-26T12:10:14.086+0000","up_votes":1,"down_votes":0,"body":"Quindi per cosa dovrei reportare queste persone che non riescono nemmeno a fare una kill e nemmeno a completare il primo oggetto della build? Giocatore inesperto? (che non è manco un report alla fine..)","replies":[{"poster":"Il Freddo","date":"2015-03-26T12:52:29.242+0000","up_votes":2,"down_votes":0,"body":"semplicemente non reporti, miglioni, esci dall'elo hell e ti dimenticherai di questi problemi.\nParlo che sono ancora un silver 5 e sinceramente i troll in ranked non li vedo pur essendo nel pieno elohell","replies":[{"poster":"JirajaSama","date":"2015-03-26T15:16:02.274+0000","up_votes":1,"down_votes":0,"body":"Quindi loro han la libertà di trollare e io dovrei ignorarli senza nemmeno reportarli xD","replies":[]}]}]}]}]},{"poster":"JRobich","date":"2015-03-26T06:53:13.591+0000","up_votes":2,"down_votes":0,"body":"Mettiti l'anima in pace e pensa solo a migliorare. Un cosiglio che ti do è quello di registrare le partite e rivederle in modo da autocriticarti e migliorare. Anche io mi sono trovato nella stessa situazione... la soloq è una scommessa con te stesso che non dipende solo da te, ma ANCHE DA TE","replies":[{"poster":"JirajaSama","date":"2015-03-26T12:11:22.492+0000","up_votes":1,"down_votes":0,"body":"Indubbiamente, ma ho letto anche commenti di persone che dicono \"ho giocato una partita da padre eterno, ma ho perso per colpa del team\".\nIn questi casi che si fa?","replies":[]}]},{"poster":"Jolly Roger","date":"2015-03-27T23:03:01.851+0000","up_votes":1,"down_votes":1,"body":"nella soloQ non serve comunicare, si gioca da soli e bisogna pensare a se stessi.\ncomunicare con chi non ha la capacità di far funzionare occhi, cervello e mani allo stesso tempo è del tutto inutile.\nsprechi tempo e concentrazione preziosa nel pingare o scrivere a chi \n1 non ha i suoni\n2 non legge chat\n3 legge la chat del suo canale streaming\n4 ride come un ritardato con il champion","replies":[]}]}