{"poster":"Chroniicles","date":"2016-02-06T11:03:49.409+0000","title":"In merito ai bug segnalati sull'ulti di Brand...","subforum":"Aiuto e supporto","up_votes":5,"down_votes":3,"body":"Ciao a tutti,\r\nin merito alle varie segnalazioni fatte in merito al rimbalzo dell&#039;ulti di Brand in particolari condizioni mi son preso la briga di testarlo in custom con degli amici e i risultati sono questi, che dopo 8 diverse prove effettuate, non ho riscontrato le anomalie da voi segnalate.\r\nSe gli utenti che hanno riscontrato quel genere di problemi son convinti che ci sia un malfunzionamento su quella spell, li pregherei di:\r\n- postarmi un video dove accade;\r\n- addarmi in game e farmi vedere come succede in modo da poterlo filmare (se non avete i mezzi per farlo);\r\nperch&egrave; io sinceramente non ho trovato nulla di anomalo.\r\ngrazie a tutti per la collaborazione","replies":[{"poster":"Il Freddo","date":"2016-02-06T13:26:36.873+0000","up_votes":2,"down_votes":0,"body":"A me è capitato ierisicuro di aver eseguito correttamente la cosa?Infiamma un avversario, mettigli ignite e poi ulta, la ulti dovrebbe fare solo in colpo sul nemico per poi sparire nonostante in nemico sia in mezzo ai minion","replies":[{"poster":"Chroniicles","date":"2016-02-08T09:19:29.272+0000","up_votes":1,"down_votes":0,"body":"Ciao,\nMi sono informato e a quanto pare il bug c è, ma non c entra nulla con l ignite. Semplicemente col fix introdotto qualche patch fa sono sorte delle complicazioni e l ulti sporadicamente non rimbalza come dovrebbe.\nIl fatto ti capiti spesso è una sfortunata coincidenza, comunque puoi stare tranquillo perché già con la 6.3 dovrebbe venir fixato","replies":[]},{"poster":"Chroniicles","date":"2016-02-06T13:31:01.727+0000","up_votes":1,"down_votes":0,"body":"Ho provato io, e altri 2 amici.","replies":[]}]},{"poster":"Frattaglia","date":"2016-02-08T09:23:45.750+0000","up_votes":1,"down_votes":0,"body":"È successo anche a me ieri, vedo se riesco a recuperare il replay... Speriamo lo fixino presto perché l'ho notato mediamente quasi una volta a partita il che vuol dire che influenza parecchio :(","replies":[{"poster":"Chroniicles","date":"2016-02-08T11:21:10.032+0000","up_votes":1,"down_votes":0,"body":"Tranquilla non credo serva a quanto pare la riot ne è già al corrente ^^","replies":[]}]}]}