{"poster":"JinxedFate","date":"2017-08-23T12:26:22.897+0000","title":"Something you might have missed in Ornn's backstory....","subforum":"Story, Art, & Sound","up_votes":3,"down_votes":1,"body":"So, I was reading up on the backstory of Ornn, and I found a curious tidbit of information:\r\n\r\n&quot;So Ornn labored for ten days and built the single best door anyone had ever built. He adorned it with a ram&rsquo;s head, like his own, and the one at the heart of the Freljord. It was impervious to magic and lock-pickers alike. &quot; Passage IV - The Troll and the Ram Door\r\n\r\nThat detail bothered me. Why? The choice of words. &quot;adorned it with a ram&rsquo;s head, like his own, and the one at the heart of the Freljord.&quot;\r\n\r\nBraum&#039;s title is the heart of Freljord.... \r\nAnd you might want to look at his shield :)","replies":[{"poster":"WOOOOOOOOHOOOOOO","date":"2017-08-23T13:13:27.806+0000","up_votes":9,"down_votes":0,"body":"You're a little late on that","replies":[{"poster":"Solarkoid","date":"2017-08-23T14:13:33.644+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WOOOOOOOOHOOOOOO,realm=NA,application-id=6kFXY1kR,discussion-id=TIPgcXT7,comment-id=0000,timestamp=2017-08-23T13:13:27.806+0000)\n>\n> You&#x27;re a little late on that\n\nThats rude that some dislike it. He/She just found out and didn't copy and rushed to tell the community, yes WE KNOW it was obvious but still...","replies":[{"poster":"Mogarl","date":"2017-08-23T15:20:51.160+0000","up_votes":5,"down_votes":0,"body":"Let's take a moment and think about who's being more rude here\n\n\"You're a little late on that\" Implies that he got to the party late. He didn't read it soon enough.\n\n\"yes WE KNOW it was obvious but still...\" Implies that they are foolish for sharing something obvious.","replies":[]}]}]},{"poster":"FauxSchizzle","date":"2017-08-23T18:14:16.104+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Queen of Heals,realm=NA,application-id=6kFXY1kR,discussion-id=TIPgcXT7,comment-id=,timestamp=2017-08-23T12:26:22.897+0000)\n>\n> So, I was reading up on the backstory of Ornn, and I found a curious tidbit of information:\n> \n> &amp;quot;So Ornn labored for ten days and built the single best door anyone had ever built. He adorned it with a ram&amp;rsquo;s head, like his own, and the one at the heart of the Freljord. It was impervious to magic and lock-pickers alike. &amp;quot; Passage IV - The Troll and the Ram Door\n> \n> That detail bothered me. Why? The choice of words. &amp;quot;adorned it with a ram&amp;rsquo;s head, like his own, and the one at the heart of the Freljord.&amp;quot;\n> \n> Braum&amp;#039;s title is the heart of Freljord.... \n> And you might want to look at his shield :)\n\nThere are a couple more fun nuggets. Ornn's handiwork made its way out into the world a few times.","replies":[{"poster":"GreenLore","date":"2017-08-24T12:59:32.020+0000","up_votes":1,"down_votes":0,"body":"What I wonder:\nDoes that mean that there are at least 2 doors like this?\n\nAfter all it says that he gave it a rams head just like the door at the heart of the freljord,implying that this new door came after the one that Braum uses.\n\nIt would also kinda fit since the new door is seemingly always closed and can't be opened,but the one that Braum uses did let a Troll boy into the vault.","replies":[{"poster":"Skelenth","date":"2017-08-24T19:46:19.233+0000","up_votes":1,"down_votes":0,"body":"The Heart of the Freljord is in this case the giant fire elemental he saw inside his furnace (aka volcano). It also has a rams head. It's not a door fashioned after Braums door - it _is_ Braums door.\nAt least that's what I got from his lore","replies":[{"poster":"GreenLore","date":"2017-08-24T21:41:53.461+0000","up_votes":1,"down_votes":0,"body":"Well it says \"**and the one** at the heart of the freljord\" ,which sounds to me like it talks about a seperate door.\n\nAnd Braums title is \"the heart of the freljord\" so it would mean that this other door is close to him.","replies":[{"poster":"Skelenth","date":"2017-08-24T23:50:27.617+0000","up_votes":1,"down_votes":0,"body":">  He adorned it with a ram’s head, like his own, and the one at the heart of the Freljord. It was impervious to magic and lock-pickers alike.\n\nObject is the Ram's Head here, not the door. \nI doubt the title \"Heart of Freljord\" is more than a figure of speech for the Freljords fiery core, not a direct mention of Braum.\n\nIt is one of those theories that are easier to debunk than prove, imo.","replies":[]}]}]},{"poster":"Krabohod","date":"2017-08-24T19:19:21.267+0000","up_votes":1,"down_votes":0,"body":"There are also may be a myth that the Troll boy were in a cave. Or maybe he climbed through the little hole near the cave that've been burried under stones then","replies":[]}]}]},{"poster":"Placentas","date":"2017-08-23T19:12:57.663+0000","up_votes":2,"down_votes":0,"body":"There's also the theory that Fizz's trident is Ornns fork.","replies":[{"poster":"TheHappyReaperz","date":"2017-08-24T17:00:31.129+0000","up_votes":1,"down_votes":0,"body":"And his spade is Yorick's Shovel.","replies":[]}]}]}