{"poster":"Wukong Airways","date":"2018-06-06T09:40:22.996+0000","title":"Yasuo's {Passive} might be changed because everyone can have it, But Wukong's Stone skin won't?","subforum":"Gameplay","up_votes":101,"down_votes":12,"body":"For anyone who doesnt know what I&#039;m talking about, {{champion:62}} &#039;s Passive is called {Stone Skin} and it gives you 8 armor+MR for each nearby enemy at lvl 16 resulting in 40 additional Armor and MR lategame.  \r\nThe design team created an item {{item:3193}} that gives the same passive with the same name {Stone Skin} but gives you 40 Armor + MR with only 3 nearby enemies.\r\n\r\nand now that the new {{item:3031}} doubles your critical strike {Yasuo&#039;s Passive} , the design team is thinking of changing {{champion:157}}&#039;s passive because of that, or at least it&#039;s one of the reasons.\r\n\r\nYou see, you have the ability to work on any champion and hot fix them in a day, but because Wukong is not popular at all , yeah, you still have no idea what to do with him.\r\n\r\nBonus: now Wukong&#039;s passive is even less existent because of the Last whisper changes.","replies":[{"poster":"FilDaFunk","date":"2018-06-06T10:38:19.139+0000","up_votes":64,"down_votes":7,"body":"TBH, they could just remove that part of Yasuo's passive.","replies":[{"poster":"Wukong Airways","date":"2018-06-06T10:41:29.492+0000","up_votes":23,"down_votes":7,"body":"Do you really wanna upset all the anime fans out there?","replies":[{"poster":"FilDaFunk","date":"2018-06-06T11:06:22.199+0000","up_votes":61,"down_votes":1,"body":"https://i.imgur.com/s4dTtBy.jpg","replies":[]},{"poster":"SayoriIsBigSad","date":"2018-06-06T15:35:45.827+0000","up_votes":8,"down_votes":4,"body":"Scuse me but us anime fans would rather play someone like kayn(shadow) and zed or annie/zoe","replies":[{"poster":"Velasan","date":"2018-06-07T04:56:44.423+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SayoriWantsToDie,realm=NA,application-id=3ErqAdtq,discussion-id=JrE3EwzY,comment-id=000300000002,timestamp=2018-06-06T15:35:45.827+0000)\n>\n> Scuse me but us anime fans would rather play someone like kayn(shadow) and zed or annie/zoe\n\nThat's strange.  I like anime, but some of my favorite characters are Shen, Fiddlesticks, and Swain.\n\nDoes Vel'koz count as anime? :P","replies":[]}]},{"poster":"Feel Apathy","date":"2018-06-06T14:21:56.328+0000","up_votes":2,"down_votes":0,"body":"It's a win win then.","replies":[]}]},{"poster":"rtbf11791216","date":"2018-06-06T16:05:12.086+0000","up_votes":2,"down_votes":7,"body":"agreed, remove that and make his ult a higher cd 30 seconds level 3 with 0cdr%","replies":[{"poster":"TheCodeisCupCake","date":"2018-06-06T16:07:05.539+0000","up_votes":9,"down_votes":13,"body":"Yasuo was soo bad he needed a hot fix, and here you are suggesting nerfs. {{sticker:zombie-brand-clap}}","replies":[{"poster":"Tzuyu Is My Bias","date":"2018-06-06T17:56:20.306+0000","up_votes":11,"down_votes":3,"body":"As long as we don't have to fight him, anything goes.","replies":[]}]}]}]},{"poster":"Bisaknosp","date":"2018-06-06T10:32:08.154+0000","up_votes":53,"down_votes":4,"body":"eh why are they not just removing it? why does he need 2 passives?","replies":[{"poster":"Spicy Rice","date":"2018-06-06T15:51:46.587+0000","up_votes":4,"down_votes":11,"body":"Tell me what melee carry doesn't have some sort of steroid that buffs their autos.\n\nOh wait, there isn't one","replies":[{"poster":"Auz the Ripper","date":"2018-06-06T17:56:28.709+0000","up_votes":18,"down_votes":2,"body":"Most melee carries also don't have two purely defenses abilities and a base autoattack range of 175","replies":[{"poster":"5301","date":"2018-06-07T02:16:11.607+0000","up_votes":7,"down_votes":1,"body":"The 175 range is very weird, but there are plenty of melee carries with 2 defense spells. Let's compare him to the other champions in his subclass:\n\n{{champion:114}} has W, the ult heal and a tiny heal on her passive\n{{champion:24}} has E and ult\n{{champion:11}} has Q and damage reduction W\n{{champion:23}} has W debuff and ult\n{{champion:245}} he's more of a hybrid assassin than a skirmisher but has W and ult\n\nThere are also some divers who are part of a different subclass (just to be clear) that have 2 defensive spells or 1 defensive spell and another that doubles down as one\n\n{{champion:266}} situationally has passive and W\n{{champion:164}} has passive and untargetable ult\n{{champion:141}} this one isn't a melee carry but when in bruiser form some of his damage has vamp and has an untargetable ult\n{{champion:2}} has vamp and the anti-CC ult, but isn't a melee carry either\n{{champion:19}} this one is weird, but is still pretty much a drain-tank with respectable damage. He still has the vamp all over his kit and E\n{{champion:5}} has a tiny passive heal but a powerful ult\n\nIf I wanted to stretch far, I could add more\n\n{{champion:86}} is pretty much a tanky bruiser with a passive heal and W. This however is going too far because his passive sucks\n{{champion:39}} Q has a heal, also W\n{{champion:56}} small passive heal and W\n{{champion:80}} passive, can gain a charge of passive with W\n{{champion:58}} has Q and R steroid\n{{champion:107}} has W heal and empowered W heal/cleanse\n{{champion:62}} has his shitty passive and W that can be used to tank hits\n\nThere are plenty of other melee carries with 2 defensive spells, but they all just suck. Also Yasuo arguably only has 1 pure defensive abilitiies. His passive shield is still part of his crit passive.","replies":[{"poster":"Auz the Ripper","date":"2018-06-07T03:36:21.926+0000","up_votes":7,"down_votes":2,"body":"Most of those secondary skill are not purely defensive though, the majority are offensive skills with defensive effects and a large amount of those skills’ power are in the offensive part","replies":[]}]},{"poster":"Spicy Rice","date":"2018-06-06T19:17:40.303+0000","up_votes":3,"down_votes":3,"body":"They also don't have low base stats, aren't pigeonholed into rushing (what are now) some expensive items, and don't have as low late game dps as yasuo (for an aa based carry)","replies":[{"poster":"GigglesO","date":"2018-06-06T22:09:43.948+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Spicy Rice,realm=NA,application-id=3ErqAdtq,discussion-id=JrE3EwzY,comment-id=0002000100010000,timestamp=2018-06-06T19:17:40.303+0000)\n>\n> They also don&#x27;t have low base stats, aren&#x27;t pigeonholed into rushing (what are now) some expensive items, and don&#x27;t have as low late game dps as yasuo (for an aa based carry)\n\nDid you mention low base stats that needs to auto attack? \n{{champion:82}}","replies":[{"poster":"Spicy Rice","date":"2018-06-06T22:45:39.799+0000","up_votes":3,"down_votes":1,"body":"And you know what, he fuckin sucks, what do you know.","replies":[]}]}]}]}]}]},{"poster":"Zeromatsu","date":"2018-06-06T11:56:58.726+0000","up_votes":28,"down_votes":0,"body":"And then you have Shyvana with 5 armor/mr. Feels good.","replies":[{"poster":"LifeIsBasketball","date":"2018-06-06T12:09:34.385+0000","up_votes":2,"down_votes":0,"body":"doesnt it scale per dragon tho?","replies":[{"poster":"Zeromatsu","date":"2018-06-06T12:18:07.700+0000","up_votes":23,"down_votes":0,"body":"It does scale with every elemental drake (5 extra for each), elder drake doesn't grant armor/mr.\n\nEven if you get each drake it feels lackluster, now imagine getting none/just one?","replies":[]},{"poster":"TheFancySkeleton","date":"2018-06-06T14:05:19.618+0000","up_votes":5,"down_votes":1,"body":"*Meanwhile on Twisted Treeline*","replies":[]}]}]},{"poster":"M00ndanc3","date":"2018-06-06T15:38:23.937+0000","up_votes":15,"down_votes":1,"body":"{{champion:121}} {{item:3147}} \n{{champion:63}} {{item:3151}} \n{{champion:202}} {{item:3095}} \n{{champion:86}} {{item:3083}} \n{{champion:36}} {{item:3065}} \n{{champion:74}} {{item:2053}} \n{{champion:24}} {{item:3124}} \n{{champion:10}} {{item:3091}} +{{item:3071}} \n{{champion:75}} {{item:3072}} \n{{champion:61}} {{item:3115}} \n{{item:3046}} {{champion:15}} \n{{champion:223}} {{item:3748}} \na lot of champs have passives that are really similar to items.","replies":[{"poster":"Wukong Airways","date":"2018-06-06T16:10:34.714+0000","up_votes":7,"down_votes":7,"body":"I like the fact that people like you are comparing which is similar to what, and dont get the point of the thread to begin with.\n\nIf the design team can change yasuo's passive since it's not relevant anymore, then why do they keep wukong's passive the way it is?\n\nget the point?","replies":[{"poster":"M00ndanc3","date":"2018-06-06T17:36:32.249+0000","up_votes":6,"down_votes":1,"body":"i know what the point of the post was. but all i see is people complaining about how everyone gets a yasuo passive but ignores all the items that give similar effects to other champion passive. and when it comes to wukong, he really just needs to have a rework because so many of his abilities are fighter oriented, but the only way to play him is as an assassin because even with all the free tank stats he just isn't much of a fighter.","replies":[]},{"poster":"Citavista","date":"2018-06-07T15:15:09.052+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Wicked Jesterr,realm=EUNE,application-id=3ErqAdtq,discussion-id=JrE3EwzY,comment-id=00130000,timestamp=2018-06-06T16:10:34.714+0000)\n>\n> I like the fact that people like you are comparing which is similar to what, and dont get the point of the thread to begin with.\n> \n> If the design team can change yasuo&#x27;s passive since it&#x27;s not relevant anymore, then why do they keep wukong&#x27;s passive the way it is?\n> \n> get the point?\n\nBecause Wukong functions without the passive, his passive was never relevant because it never needed to be. Go back to before this patch and take away Yasuo passive and watch how utter shit he becomes. Wukong is shit too but that's a numbers thing since he's a stat check champion who will either kill you instantly or do no damage.","replies":[]},{"poster":"DuskDaUmbreon","date":"2018-06-06T17:36:17.091+0000","up_votes":2,"down_votes":0,"body":"The difference is that Wukong's passive *can* reliably stack, and it is in no way hampered or affected by the existence of Stoneplate.\n\nMeanwhile, Yasuo's double crit passive is *actually* hindering him at this point, since he significantly overcaps on crit with just two items now (meaning he can't afford *both* Shiv and PD, as they'd be just terrible items for him), has reduced crit damage, and is just taking away from his power budget.\n\nThere is nothing similar about Wukong's passive. Hell, even if he *did* go into Stoneplate, it'd just *amplify* it. He has nothing hindering him at all because of that.\n\nIs his passive bad? Yeah. Is it the same situation? Not at all.","replies":[]}]}]},{"poster":"Hethalean","date":"2018-06-06T10:17:56.397+0000","up_votes":7,"down_votes":0,"body":"Where did you see that the design team is thinking about changing yasuo passive?","replies":[{"poster":"Wukong Airways","date":"2018-06-06T10:21:50.529+0000","up_votes":9,"down_votes":0,"body":"https://www.youtube.com/watch?v=PXAJrB3yNZk\n\n2:29 confirms Riotblaustoise  saying they will likely do larger changes.","replies":[{"poster":"Hethalean","date":"2018-06-06T10:35:39.948+0000","up_votes":3,"down_votes":0,"body":"Awesome, thanks!  I still wonder why they so fast reacted to Yasuo going down in win rate, but other champions that have been sitting there for a long time aren't even coming up.  Ease of buff maybe?  Who knows, but they could just easily give AD and such to Kindred or something.  Good to know though.","replies":[]}]}]},{"poster":"Boreto","date":"2018-06-06T09:59:09.441+0000","up_votes":5,"down_votes":3,"body":"The reason here is the same just like with lux kata having 10+ skins popularity of certain champions make riot change those popular ones while champs like wu urgot stay the same.","replies":[{"poster":"Wukong Airways","date":"2018-06-06T10:18:54.994+0000","up_votes":3,"down_votes":2,"body":"but then again, they're Just professional when it comes to money making strategies, that's all, which have always lead to the fall of even greater companies.","replies":[{"poster":"TheSingularity","date":"2018-06-06T11:04:01.689+0000","up_votes":7,"down_votes":0,"body":"Also, there's been a non stop campaign of hatred and rage from people who hate facing yasuo.\nRiot acts when things affect their income (the best example being the dynamic queue switch back to solo, why else would riot flush an entire year worth of work down the toilet?), this champion may very well be costing them money. People leave games when things don't go the way they want, ppl leave and so do their wallets.\n\n\nAs for the wukong thing, he's in line for a full rework. Just not soon as there are more problematic designs like {{champion:82}} {{champion:9}} {{champion:266}} {{champion:84}} {{champion:20}} those last 3, are the next 3 while the first 2, have been mentioned by rioters to be in line with reworks\nI doubt he'll keep his passive with the rework","replies":[]}]}]},{"poster":"Sasogwa","date":"2018-06-06T16:33:56.916+0000","up_votes":6,"down_votes":0,"body":"Your bonus fact makes no sense though. Wukong's passive gives bonus resistances and not base resistances, meaning the change from %bonus to %total literally doesn't change anything to his passive.","replies":[]},{"poster":"ƒrostγ","date":"2018-06-06T12:16:38.332+0000","up_votes":7,"down_votes":1,"body":"It was the same with {{champion:127}} passive  and manaflow band. ( yes I know they changed mb eventually, but it still counts","replies":[]},{"poster":"Jaspers","date":"2018-06-06T12:14:05.741+0000","up_votes":1,"down_votes":4,"body":"Lissandra's passive wasn't changed when the first version of Manaflow Band existed either. Infact it made her better as it gave her 2 free abilities. They ended up changing the the rune in the end.\n\nWould a change on Yasuo turning him into a fighter (removing double crit and upping autos back to 1 autos, not 0.9) instead of forcing him to build crit because of his passive help? Would this change his identity too much? Would it make players who like the Yasuo flash plays and 'crits' turn off the champ?","replies":[{"poster":"Thefrostyviking","date":"2018-06-06T16:25:46.004+0000","up_votes":6,"down_votes":1,"body":"Dude are you somewhat off?\n\nLissandra was the biggest loser in the manaflow episode.\n\nHer passive and it had a bugged interaction that lasted for ages in which they didnt stack, so if you used one then the other also got proced.\n\nNot sure if riot actually ever fixed it until they just straight up reworked manaflow.","replies":[]}]},{"poster":"Sun Wu Ryuumoku","date":"2018-06-06T14:12:59.403+0000","up_votes":11,"down_votes":10,"body":">, the design team is thinking of changing 's passive because of that, or at least it's one of the reasons.\n\n\nYasuo's garbage, and can't build anything other than PD + IE. His passive restrict (build wise), IE is sh*t for him (build path). And he was nerfed... but wasn't targeted by riot.\n\n\n>You see, you have the ability to work on any champion and hot fix them in a day, but because Wukong is not popular at all , yeah, you still have no idea what to do with him.\n\nNo, this is stupid as conclusion. Yasuo kit is healthy for the game, Wukong's one isn't. You talk about Wukong passive, but his whole kit is an issue.\n\n>Bonus: now Wukong's passive is even less existent because of the Last whisper changes.\n\nWho care ??? \n\n\nTldr : rework Wukong already.","replies":[{"poster":"YumaS2Astral","date":"2018-06-06T17:48:53.527+0000","up_votes":8,"down_votes":3,"body":"> [{quoted}](name=Ryuumoku no koke,realm=EUW,application-id=3ErqAdtq,discussion-id=JrE3EwzY,comment-id=000f,timestamp=2018-06-06T14:12:59.403+0000)\n> \n> No, this is stupid as conclusion. **Yasuo kit is healthy for the game**, Wukong&#x27;s one isn&#x27;t. You talk about Wukong passive, but his whole kit is an issue.\n\n\nhttps://www.youtube.com/watch?v=ztVMib1T4T4","replies":[]},{"poster":"Dryditch","date":"2018-06-06T17:17:04.121+0000","up_votes":3,"down_votes":1,"body":"What do you find unhealthy in Wukong's kit? Genuinely interested.","replies":[{"poster":"Sun Wu Ryuumoku","date":"2018-06-06T18:24:30.249+0000","up_votes":3,"down_votes":1,"body":"Point and clic OS potential. Thats for the unhealthy part.\n\nWukong kit is outdated, he's stat check champ. Unless he OS carries, either he's useless. And unlike others \n\n- assassins he bring nothing comparing to other from gameplay to  roles(Zed & Talon can poke, Talon  & eve can scout)\n- bruisers... i mean, wukong lose most of matchup cause they outsustain him and outdps him. \n- tanks !!! Tankong is a trollbuild.","replies":[{"poster":"Dryditch","date":"2018-06-07T04:58:33.169+0000","up_votes":2,"down_votes":1,"body":"Really what I'm hearing here is that Wukong is just not in a good spot in the meta. He's in a similar position to Malphite in that even if he's useless in terms of damage, a decent ultimate can turn a fight regardless of his damage output.\n\nThe champ isn't \"unhealthy,\" per se, given the existence of so many other champions who can one-shot easily, but his kit definitely needs work.","replies":[{"poster":"Sun Wu Ryuumoku","date":"2018-06-07T13:17:10.174+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Dryditch,realm=NA,application-id=3ErqAdtq,discussion-id=JrE3EwzY,comment-id=000f000000010000,timestamp=2018-06-07T04:58:33.169+0000)\n>\n> Really what I&#x27;m hearing here is that Wukong is just not in a good spot in the meta.\n\n\nHe's decent in this meta. He'll never be a beast in any meta tho...\n\n> He&#x27;s in a similar position to Malphite in that even if he&#x27;s useless in terms of damage, a decent ultimate can turn a fight regardless of his damage output.\n>\n\nno\n \n> The champ isn&#x27;t &quot;unhealthy,&quot; per se, given the existence of so many other champions who can one-shot easily, but his kit definitely needs work.\n\nHis kit is unhealthy. A kit is unhealthy when ennemy have no many option to prevent x kit to work.","replies":[{"poster":"Dryditch","date":"2018-06-07T15:37:15.842+0000","up_votes":1,"down_votes":3,"body":"I'd really like for you to explain how two ultimates that have similar functionality and similar duration CC, which both rely on Flash to be reliable initations, do not put two champions in similar positions.\n\nWukong does damage and is significantly less tanky than Malphite, who is an actual tank. I'm not comparing the rest of their kits. I'm saying that a single good ultimate from Wukong is 1 second in a teamfight where your team can freely attack the enemies because they're knocked up and unable to do anything.\n\nAnd finally, if that's your definition of unhealthy, then 1/3 of the cast of League, at least, is unhealthy design.","replies":[{"poster":"Sun Wu Ryuumoku","date":"2018-06-07T18:20:25.011+0000","up_votes":2,"down_votes":0,"body":">I'd really like for you to explain how two ultimates that have similar functionality and similar duration CC, which both rely on Flash to be reliable initations, do not put two champions in similar positions.\n\nboth aren't same to begin. The ult of Malphite is faster than E > R (and usualy you will E > Q > R). And after this ennemy team will instant Wukong,  not the case with Malphite where you will slow ennemy and debuff them.\n\n\n>And finally, if that's your definition of unhealthy, then 1/3 of the cast of League, at least, is unhealthy design.\n\n\nI don't see the problem here. Thats legit what i say since age, most of champions are outdated, and thats why most bitch about Yasuo (and cause they're low elo ... mean don't know how to play the game).","replies":[]}]}]}]}]},{"poster":"DuskDaUmbreon","date":"2018-06-06T17:43:02.094+0000","up_votes":3,"down_votes":3,"body":"Generally unhealthy gameplay. He either assassinates targets in a fraction of a second or is completely useless. And I'm personally not a fan of champions with invisibility that can move far during said invisibility (No problem with Vayne or even Kai'sa invis, as it's a short range. I do have a problem with something like Wukong or Shaco's, though, as they can travel a significantly farther distance during it).\n\nWukong mains aren't happy. Everyone else isn't happy. He just needs a rework because right now *nobody* is happy with him.","replies":[{"poster":"Sun Wu Ryuumoku","date":"2018-06-06T18:25:44.570+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=DuskDaUmbreon,realm=NA,application-id=3ErqAdtq,discussion-id=JrE3EwzY,comment-id=000f00000000,timestamp=2018-06-06T17:43:02.094+0000)\n>\n> Generally unhealthy gameplay. He either assassinates targets in a fraction of a second or is completely useless. And I&#x27;m personally not a fan of champions with invisibility that can move far during said invisibility (No problem with Vayne or even Kai&#x27;sa invis, as it&#x27;s a short range.** I do have a problem with something like Wukong or Shaco&#x27;s, though, as they can travel a significantly farther distance during it).**\n\n\nWhut ??? i think you should play him. Cause you won't go so far with 1,5 sec invisibility.","replies":[]}]}]}]},{"poster":"KZ Engel","date":"2018-06-06T21:24:24.051+0000","up_votes":2,"down_votes":2,"body":"yasuo's passive is getting changed not because \"everyone can have it\" but because the crit changes utterly shat on him, whether or not \"everyone gets double crit chance\" \n\nthe only realistic crit cap without wasting a bunch of stats is 60% rn, and yasuo _needs_ the 100% to be worth anything after laning. his build got more expensive, his damage got nerfed, a power spike was deleted, and he has no choice but to waste stats\n\nthe fact that other champions can now get 10% more crit than before with 2 items while never realistically getting any higher has nothing to do with whether or not yasuo got shit on \n\nthe crit changes force ADCs to not be 80-100% crit sniper assassins while also forcing yasuo to give up his core build or waste the ie passive _and_ 20% crit \n\n_nothing_ is ideal for yasuo rn ","replies":[{"poster":"GripaAviara","date":"2018-06-06T23:31:23.537+0000","up_votes":5,"down_votes":0,"body":"What are you talking about, yas can get 100% now with a zeal and infinity just as before","replies":[]}]},{"poster":"Zero Skill Tank","date":"2018-06-06T13:18:04.383+0000","up_votes":3,"down_votes":8,"body":"LW changes didn't affect Wu Kong's passive at all, since it's bonus armor.","replies":[{"poster":"Thefrostyviking","date":"2018-06-06T16:27:53.696+0000","up_votes":2,"down_votes":2,"body":"Eh.....pardon but.......LDR now is total armor pen.\n\nMeaning it shreds more than it used to.","replies":[]}]}]}