{"poster":"SKT T1 Sutu","date":"2017-08-15T11:42:18.124+0000","title":"Main Supp mit massiver Lose-Streak sucht DuoQ Partner","subforum":"Clans & Teams","up_votes":1,"down_votes":8,"body":"Hey,\r\nich bin kein schlechter Support. Ich bin nur in der schrecklichen Lage, dass ich auch der Support Position nicht carryn kann. Ich suche einen DuoQ Partner der einen Dauer-Supp braucht.\r\n\r\nIngame: Skt t1 Sutu\r\n\r\nLG","replies":[{"poster":"Sirrkas","date":"2017-08-16T07:29:12.442+0000","up_votes":2,"down_votes":0,"body":"Oh, da du wieder da bist, kann ich dir ja den Text schreiben, den ich letztes mal abschicken wollte:\n\n___\n\nDu kannst den Sightstone auch mit dem Supportitem verschmelzen. Dann braucht es keinen zusätzlichen Platz, kann die Questbelohnung aktiv halten, gewährt sehr günstig Wards und du hast einen Trinketplatz frei um zum Beispiel etwas anderes damit zu machen, wie etwa blaue Wards oder das rote Trinket zu nehmen. \n\nIch bin immer sehr davon enttäuscht, wenn sich jemand \"Mainsupport\" nennt und das Sichtspiele komplett ignoriert. Und nein, 6 Wards und 0 Pinks in 22 Minuten sind kein \"ich weiß wie ich zu warden habe\". Das ist höchstens ein, ich ignoriere Wards. \n\nIn Season 3 habe ich mich als Support aus Bronze gespielt, indem ich Wards platziert habe, die Gegner neben denen im Busch warten und wir aus ihrem Hinterhalt selbst einen Überraschungsangriff machen konnten. Wenn also die Bronzespieler vor 4 Jahren es geschafft haben, Wardsicht zu nutzen, warum sollten es deine Goldmitspieler nicht hinkriegen? \n\nVielleicht sollte ich doch mal mehr als 50 Rankeds machen und mich nach Platin spielen.","replies":[{"poster":"SKT T1 Sutu","date":"2017-08-16T11:13:53.024+0000","up_votes":1,"down_votes":3,"body":"Ich hätte es gerne im privaten Chat ausgetragen, aber dieses Forum bietet diese Funktion nicht. Danke, dass du mir die Information geliefert hast, dass ich das Ward Item mit dem Support item verschmelzen kann. Ich wußte das vorher gar nicht als Support Main. *ironie off*. Die Information hättest du auch mit einem kurzen Blick auf mein Profil auch erlangen können, dass ich Supp Main bin. So wären deine Zweifel innerhalb von Sekunden weg gewesen. Ok, du hast vermutlich nicht richtig auf den Schirm was ich schrieb. Ich sagte ich weiß wie ich zu warden habe, aber in dieser Elo empfinde ich es nicht als notwendig, weil aus empirischen Informationen heraus habe ich gefolgert, dass meine Team Mates nicht genügend die Minimap nutzen. So ist die dauerhafte Nutzung von Wards Zeitverschwendung. \"Ja, dann warde doch einfach und schaue selbst auf die Minimap und pinge deine Leute. Mach Sie darauf aufmerksam, dass gerade ein Drake oder whatever gemacht wird.\", wenn die Pings ignoriert werden ist es useless. Zitat: \"Wenn also die Bronzespieler vor 4 Jahren es geschafft haben, Wardsicht zu nutzen, warum sollten es deine Goldmitspieler nicht hinkriegen?\". Zunächst mal kann man das easy daher sagen ohne Belege dazu zu haben. Aber nehmen wir mal an du hast Recht. Es ist ziemlich unwahrscheinlich, dass ein Spieler, der gerade ins ranked gekommen ist taktische Moves ausübt, aber nehmen wir wirklich mal an, dass es so sei. So müssten die in der Gold Elo, die Standarts besitzen, wenn die diese in der Bronze Elo schon trainiert haben. Sie besitzen auch die Meisten, aber in Sachen Vision nicht. Warum ist das so? Ist im Prinzip auch einfach zu erklären. Man besitzt die Frosch Perspektive. Man sieht nicht das große Ganze in meiner Elo. Sie sind gut im Bereich von dem was Sie wahrnehmen, aber Sie nehmen die Minimap nicht wahr. Dem entsprechend auch nicht die Gesamte Map. Einen kleinen Teil nur. Nämlich das was die Kamera Ihnen anzeigt.\n\nDu wirst meine Denkweise nicht ändern können, weil A ich mich auf das Stütze was ich gesehen habe und B ich der Meinung bin, dass du ein traditioneller Spieler bist. Es ist ein Gefühl. Ich habe keine Belege dafür. Ich distanziere mich von Personen, die dem vorhergegangenem Muster treu bleiben. Ich verwende ein paar Elemente vom Muster, aber nicht alle.","replies":[{"poster":"Sirrkas","date":"2017-08-16T11:44:01.735+0000","up_votes":2,"down_votes":0,"body":"Du kannst es gerne als \"traditionell\" bezeichnen, wenn ich finde, dass ein Supporter Wards braucht. Da Wissen zugleich Macht bedeutet, würde ich es als effektiv bezeichnen. Wenn du meinst, Wards sind in deinen Spielen verschwendet, nur zu, ich halte dich nicht davon ab, eine der Hauptaufgaben des Supports zu ignorieren. Etwas kostengünstigeres als einen gut genutzten Sightstone wirst du als Support nicht bekommen. Es ist deine Sache, das Potential nicht zu nutzen. \n\nIch sage auch nicht, dass die Bronzespieler damals toll waren. Von den 50 Rankeds, die ich von Bronze 3 nach Silber 5 gebraucht habe, wurden aber etwas um die 4 durch meine Wards im Lategame gewonnen. Zwei Gegner steht bei Minute 40 im Fluss und legt einen Hinterhalt. Da steht ein Ward, mein Team sieht die seit einer halben Minute da stehen, geht zu fünft hin und macht die fertig. Danach können die Gegner keinen Widerstand mehr leisten, das 3vs5 verlieren sie garantiert. \n\nDu darfst nicht vergessen, durch die fehlenden Wards, verweigerst du deinen Teammitgliedern, die Mapawareness besitzen, selbige. Klar, ich sehe in Gold auch haufenweise Jungler, die keinen Plan haben, wann man Drache machen kann. Wenn du dann aber mal den Jungler hast, der auf die Map achtet und durch deinen Ward sehen konnte, wie die Botlane eben backportet und durch einen anderen, dass der Gegnerjungler gerade auf dem Weg zur Toplane ist, kriegt dein Team dadurch einen Vorteil und auch du. Ohne die Sicht, kann er aber nicht wissen, ob es gerade eine gute oder eine schlechte Idee ist, den Drachen zu beginnen, Mitte zu ganken oder weiter zu farmen.","replies":[]}]}]},{"poster":"zooaffe111","date":"2017-08-15T12:06:38.821+0000","up_votes":1,"down_votes":0,"body":"hm  finds lustig das jemand  anch duoQ leuten sucht und einen wen man hi schreib instant löscht nur weils der acc silber 4 ist xd aber na ja wen man zu dumm ist zu vertshen das es auch 2 accs gibt hat man pech gehabt ^^","replies":[{"poster":"Necromant","date":"2017-08-15T12:17:29.407+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=zooaffe111,realm=EUW,application-id=ElKI1ocy,discussion-id=6ZxHPP3L,comment-id=0000,timestamp=2017-08-15T12:06:38.821+0000)\n>\n> hm  finds lustig das jemand  anch duoQ leuten sucht und einen wen man hi schreib instant löscht nur weils der acc silber 4 ist xd aber na ja wen man zu dumm ist zu vertshen das es auch 2 accs gibt hat man pech gehabt ^^\n\nOder man den gleichen Beitrag nochmal erstellt weil man Lernresistent ist in Richtung Wards und Vision ( ͡° ͜ʖ ͡°)\nEinfach obigen User ignorieren, so wird er nie aufsteigen :)","replies":[{"poster":"SKT T1 Sutu","date":"2017-08-15T22:02:28.227+0000","up_votes":1,"down_votes":2,"body":"Neuer Titel: Main Supp mit massiver Win-Streak sucht DuoQ Partner \n\nQuelle:\nhttps://euw.op.gg/summoner/userName=skt+t1+sutu","replies":[{"poster":"Necromant","date":"2017-08-16T06:06:45.104+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SKT T1 Sutu,realm=EUW,application-id=ElKI1ocy,discussion-id=6ZxHPP3L,comment-id=000000000000,timestamp=2017-08-15T22:02:28.227+0000)\n>\n> Neuer Titel: Main Supp mit massiver Win-Streak sucht DuoQ Partner \n> \n> Quelle:\n> https://euw.op.gg/summoner/userName=skt+t1+sutu\n\n55% ist ganz nett aber nicht massiv :D","replies":[]}]}]}]}]}