{"poster":"CristalScheihing","date":"2017-10-27T03:26:25.354+0000","title":"Reportes","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":2,"body":"No sirven los reports verdad??\r\nCuando mejoran??\r\nCuando se aplicara un castigo para esa gente que trollea para esa gente que te hace perder rankeds??\r\nRunas nuevas, skins, campeones, pero el sistema de baneo sigue siendo in&uacute;til...{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Keykpo","date":"2017-10-27T03:31:22.152+0000","up_votes":2,"down_votes":0,"body":"El sistema de banneos se aplica bien, yo cada vez que reporte a alguien que flameaba como cuando te golpeas el dedo chiquito del pie con una mesa o silla y bueno, hizo lo suyo y aparecia el cartelito \"Retroalimentacion no se cuanto pero solo tenes que saber que lo bannearon :v\" o algo asi xddxd","replies":[{"poster":"CristalScheihing","date":"2017-10-30T18:25:43.324+0000","up_votes":1,"down_votes":1,"body":"si supieras a cuantos baneo yo... por flamear o por trolls, y nunca me llega ese msj, a lo sumo de 10 a los que baneo 1 me llega la notificación de que fue baneado, yo creo que riot puede hacer que sean mas efectivos los baneos, osea que sea de a 10 que beneo o baneamos 8 por lo menos que sean baneados, no creo que solo en las partidas que a mi nomas me toquen me toquen trolls   {{sticker:slayer-pantheon-rainbows}}","replies":[]}]},{"poster":"Lucio22","date":"2017-10-27T08:01:31.804+0000","up_votes":1,"down_votes":0,"body":"\"pero el sistema de baneo sigue siendo inútil\"\n\n...\ncon eso desacreditas todo lo que pudiste haber puesto antes...","replies":[{"poster":"CristalScheihing","date":"2017-10-30T18:30:02.935+0000","up_votes":1,"down_votes":1,"body":"y si, a vos te gusta jugar partidas o rankeds en las que te trollean y en la que esa gente no es baneada y  que siguen trolleando a mas gente como vos ?\nlo que digo es que dejen de hacer cosas tan buenas como las skins etc, y que se pongan a arreglar  cosas como los bans que hoy en dia solo estan de adorno, aclaro esto es mi punto de vista","replies":[{"poster":"Lucio22","date":"2017-10-30T19:04:32.598+0000","up_votes":1,"down_votes":0,"body":"...\n\nComo se nota que no sabes nada, acá te dejo unos pro tips:\n1. Los skins, champs, rework, modos de juegos y todo eso, se encarga na, por algo es la central\n2. Como sabes que no es baneada esa gente? Si no lo sabes  tas hablando al pedo. Y si lo sabes, como lo sabes? Los agregas después una vez que te cargaron la partida? Si es así, sos medio especial...\n3. Es para lo que le contestaste al otro, pero igual: vos no baneas, reportas. Son 2 cosas distintas.\n4. El sistema de reportes funciona mediante acumulaciones. Si no fuese así, uno se encima con vos porque si y te reporta, chau cuenta. \n5. La notificación te llega SI Y SÓLO SI tu report es el último que se necesita para que se banee al tipo. Al mismo tiempo, es necesario que sea el último report tuyo (es decir, si reportaste a Á y después a B, si banean a Á no te avisan) y tiene que estar dentro de un límite de tiempo breve. Estas restricciones son para que no te lluevan notificaciones de gente banear a de hace 4 meses","replies":[]}]}]}]}