{"poster":"0wOOvOOw0","date":"2015-10-27T11:11:37.358+0000","title":"Instalocker in der Champion - Auswahl","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":13,"body":"Ich lebe damit schon seit ich LoL spiele, jetzt m&ouml;chte ich euch mal Fragen, wie ihr das seht.\r\nBei den meisten Normals wird die Lane ja dadurch bestimmt, wer als erster in den Chat schreibt z.B. MidMidMidMid oder BOTPREMADEWITHBLABLABLA. So und damit geht das auch schon los. Sobald einer merkt das er nicht auf seine Lane gehen kann reagieren viele so: [Best&auml;tigen-Button dr&uuml;cken]-[Nichts mehr schreiben]-[Trollen]! Ich beispielsweise spiele am liebsten auf der Midlane. Wenn dann einer Instalockt, entscheide ich mich meistens auf eine andere Lane zu wechseln, manchmal denke ich aber ich w&auml;re Safe und best&auml;tige selber meinen Champion. Auch dann gibt es welche die einfach Locken. Mein einziger Ausweg besteht dann darin die Puckphase zu quiten, wobei ich dann immer wieder mit Sperre. Leben muss! Was hieltet ihr von einem Report System, bei dem man einen in der Auswahl schon als Insalocker Reporten kann, daraufhin wird das Game aufgel&ouml;st und der der Reportet wurde, und der der Reportet hat werden &uuml;berpr&uuml;ft. Wenn festgestellt wird das tats&auml;chlich Instalockt stattfand wird dieser Spieler im Nachhinein mit einer Strafe belegt. Falls er zu unrecht Reportet wurde, wird der der Reportet hat mit einer Strafe belegt, da man sonst ja einfach aus Dummheit und Spa&szlig; am &Auml;rgern die Spiele aufl&ouml;sen k&ouml;nnte! \r\n\r\nSo ich weis das war jetzt viel Text, aber ich freue mich trotzdem &uuml;ber eure Kommenatre{{summoner:31}}","replies":[{"poster":"Lord Vilich","date":"2015-10-27T11:23:58.124+0000","up_votes":8,"down_votes":2,"body":"Wieso sollte einer der zuerst \"Mid\" geschrieben hat ein höheres Anrecht auf diese Rolle haben als der andere, der zuerst den Champion hat?\n\nUnd für wen 3-5min zu lange sind um dem Rollenstreit auszuweichen ist sowieso nicht zu helfen.","replies":[{"poster":"Jastol","date":"2015-10-27T11:44:29.290+0000","up_votes":3,"down_votes":2,"body":"Vor allem wenn der der Mid schrei(b)t dies vll macht bevor der insta locker überhaupt im Chat ist oder ähnliches. Einfach mal die anderen Fragen, wesen Nachricht als erstes kam. Das ist nicht identisch und manche bekommen es dann nicht einmal mit das einer bereits Mid geschri(b)en hat oder zwei haben es gleichzeitig und bei manchen wird der eine bei anderen der andere als erstes angezeigt etc...","replies":[]},{"poster":"Alustus","date":"2015-10-27T12:16:00.639+0000","up_votes":2,"down_votes":1,"body":"Weil er offensichtlich einen Besseren PC oder eine bessere Inet leitung hat, oder einfach schneller im STRG+V klicken ist, das macht einem nämlich zum besseren Menschen (habe ich gehört)\n\n*Ironie off","replies":[]}]},{"poster":"Patter91","date":"2015-10-27T11:13:15.209+0000","up_votes":5,"down_votes":1,"body":"Wenn du nicht mit Instalock klar kommst, spiel kein Blind Pick.\nUnd nen Report dafür? Höchst lächerlich. Du weißt schon, dass das nicht gegen die Regeln ist?","replies":[{"poster":"0wOOvOOw0","date":"2015-10-27T11:14:59.137+0000","up_votes":1,"down_votes":8,"body":"Ach genau, das hatte ich vergessen in den Text zu schreiben. Ich wollte nicht auf Teamersteller oder DraftMode ausweichen weil das ja sehr lange dauert.","replies":[{"poster":"Doeboý","date":"2015-10-27T11:30:11.715+0000","up_votes":4,"down_votes":1,"body":"In Relation: 20+Min für ein \"Troll-Game\" gegen 5Min Que Up, ohne Flame & Blame?","replies":[]},{"poster":"Synatics","date":"2015-10-27T11:24:41.482+0000","up_votes":5,"down_votes":2,"body":"Dann mein Freund musst du wohl damit Leben, denn \"Instalocken\" ist nicht verboten ist.","replies":[]},{"poster":"Jastol","date":"2015-10-27T11:39:59.478+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Earthwaker,realm=EUW,application-id=KYnfKGf0,discussion-id=5HqA1pw6,comment-id=00000000,timestamp=2015-10-27T11:14:59.137+0000)\n>\n> weil das ja sehr lange dauert.\n\n??? Was sol da zu lange dauern? Ok, Teamersteller kann schon nervig sein wenn man nicht schon zu fünft ist, aber Draft ist von der Que teilweise sogar schneller als normal und die Vorteile sind sehr stark. Ich würde sagen, normal nur wenn es dir egal ist was du wo gegen wen spielst. Für alles strukturierte Draft.\n\nWenn dir die Pick/Bann Phase zu lange dauert ist das schade. Ich persönlich finde es immer spannend zu sehen, was gebannt wird und mit welchen Champs auf welche reagiert wird und wie sich dadurch auch kombos entwickeln. So kann man mit einer guten Pick-Phase bereits einen Vorteil (oder eben auch Nachteil) für das eigene Team erschaffen. Bei Normal ist es hingegen reiner Zufall und im Schlimmsten Fall hat man auch noch ein Mirror Match. Ich möchte hier jetzt aber keine Debatte über die Modi lostreten. Nur das Argument mit der Zeit finde Ich eher lachhaft.","replies":[]}]}]},{"poster":"OrangeBubble","date":"2015-10-27T11:32:11.352+0000","up_votes":3,"down_votes":2,"body":"Ich hab damit keine Probleme, da ich, wenn ich blind spiele, sowieso nur füllen will. Will ich eine Position spielen, tja dann spiel ich Teambuilder.\n\nUnd warum sollte das Kind, das am lautesten Schreit, seinen Willen bekommen? Zumal man auch mit Picks gewinnen kann, die nicht unbedingt in die Meta passen. Sowas solls geben. \n\nBlind ist für mich eh nur just 4 fun (Okay ist ranked/teambuilder und draft auch xD), entweder hab ich Glück und krieg ein gutes / neutrales Matchup oder ich hab Pech und krieg ein schlechtes Matchup. ^-^","replies":[]},{"poster":"Shadowscreen","date":"2015-10-27T11:44:35.947+0000","up_votes":2,"down_votes":1,"body":"Theoretisch kann jeder einlocken was er will.\n\nDann gehen eben 2 Leute mid wenn keiner ausweicht, das ist erlaubt weil keine Meta vorgeschrieben wird.\nWenn du mit soetwas nicht klar kommst musst du wohl auf den Teambuilder ausweichen,  dafür gibts den schließlich.","replies":[]},{"poster":"Der Großmugister","date":"2015-10-27T14:57:05.420+0000","up_votes":1,"down_votes":0,"body":"Ich wäre ja vollkommen bei dir, wenn es nicht den Draftpick und sogar den Teambuilder gäbe.\nWer keine Lust auf das von dir beschriebene Spielchen hat, kann einen der beiden Modi wählen.","replies":[]},{"poster":"0815xand0r","date":"2015-10-28T22:25:40.143+0000","up_votes":1,"down_votes":1,"body":"Wäre es nicht viel simpler, wenn Riot stattdessen einfach den Instalock abschafft, indem man bspw. mind. 20sec warten muss, bevor man locken kann? Ansonsten bleibt Teambuilder oder Draft (wobei es auch da Instalocker gibt)","replies":[]},{"poster":"Freiherr Alex","date":"2015-10-27T12:25:59.600+0000","up_votes":1,"down_votes":1,"body":"Schritt 1: Jemand pickt Urgot\n\nSchritt 2: Jemandem Passt das nicht weil nicht Meta und ihm wäre Fiora Top eh lieber. Also Reprted er lieber mal vorsichtshalber...\n\nSchritt 3: Spiel wird aufgelöst und der Urgot ist traurig weil das bei jedem Spiel so passiert. Nimmt irgendwann doch die Fiora und kann sie nicht Spielen. Steht am schluss 1/15/2...ist aber immerhin ein pick der ins Spiel kommt.\n\nFazit: Keiner ist Glücklich damit\n\nErgo würden sicherlich 25% der Champions wenn nicht mehr nicht mehr in Spielen gesehen werden und die Spiele würden immer gleich aussehen...\n\n\n\nAnbei fehlende Kommas die ich hier aus versehen vergessen habe ,,,,,,,,,,,,,,,,","replies":[{"poster":"0wOOvOOw0","date":"2015-10-27T12:30:28.180+0000","up_votes":1,"down_votes":3,"body":"Deswegen die Überlegung auch den Reporter zu überprüfen, damit nicht einfach aus Lust ein Spiel aufgelöst wird","replies":[]}]},{"poster":"Jastol","date":"2015-10-27T11:41:22.000+0000","up_votes":1,"down_votes":2,"body":"Nein, da es dann mMn gar nicht mehr zu Games kommen würde da jeder einfach abbrechen würde wenn er nicht das bekommt was er will und Ich würde jetzt mal grob behaupten, dass in jedem Spiel mindestens einer nicht seinen Main bekommt.","replies":[]}]}