{"poster":"Darkaslan","date":"2015-07-08T15:45:31.002+0000","title":"Consiglio champ mid lane","subforum":"Campioni e gameplay","up_votes":1,"down_votes":1,"body":"CIao a tutti, vorrei un consiglio su chi pu&ograve; essere un buon pick al momento tra Yasuo e Ekko...dato che rispettivamente non costano poco come champ. Vorrei sapere pregi e difetti di entrambi, grazie in anticipo","replies":[{"poster":"zDarkPow3r","date":"2015-07-12T13:20:58.061+0000","up_votes":1,"down_votes":0,"body":"Io invece volevo sapere chi fra azir{{champion:268}} e yasuo{{champion:157}}","replies":[{"poster":"One Tax Man","date":"2015-07-12T18:15:56.604+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=zDarkPow3r,realm=EUW,application-id=cAOZwaUi,discussion-id=HeOQE6oo,comment-id=0004,timestamp=2015-07-12T13:20:58.061+0000)\n>\n> Io invece volevo sapere chi fra azir{{champion:268}} e yasuo{{champion:157}}\n\nAzir. Non c è se o ma che tenga , ora è un bel pick almeno che non sei contro lux o xerath. In quel caso occhio perché ti aprono come una cozza.","replies":[]}]},{"poster":"M0N573RATaRu","date":"2015-07-08T23:39:08.491+0000","up_votes":1,"down_votes":0,"body":"Yasuo è estremamente difficile da giocare, non so se sei bronzo, silver o unranked (suppongo altrimenti non avresti avuto bisogno di domandare :) )in qualsiasi caso per questi livelli sopraelencati yasuo va bene in quanto il tuo avversario non sa di preciso come giocare contro yasuo. Quando avrai più esperienza capirai che tenere la lane con yasuo è abbastanza difficile, al primo errore regali una kill.\nIn poche parole: Yasuo è molto più funny secondo me di ekko e potresti comprarlo tranquillamente, tanto prima o poi dovrai imparare ad usarlo ^^ Se invece ti serve un pg con cui vuoi avere più possibilità di vincere una partita vai su ekko\nAh ps: Yasuo Top no pls ","replies":[]},{"poster":"Ryukito","date":"2015-07-08T16:30:51.157+0000","up_votes":1,"down_votes":0,"body":"Yasuo è un pick molto rischioso. Devi essere sicuro di avere un Ap in squadra, ma un ap che fa danni.\nEkko è Ap ed è Op.\nTra i due preferisco giocare Yasuo perché ha piu stile, ma dovessi consigliare direi Ekko.","replies":[]},{"poster":"CicciaBauBau","date":"2015-07-08T16:38:46.171+0000","up_votes":1,"down_votes":1,"body":"Yasuo se lo sai giocare fai i culi, a meno che non sei contro fighter-che-ti-aprono come Sion,\nEkko è forte ma se il nemico è bravo a counterarti o usa ekko sarà difficile","replies":[]},{"poster":"Daniele646","date":"2015-07-08T16:04:15.306+0000","up_votes":1,"down_votes":3,"body":"ekko,yasuo secondo me è più forte come toplaner","replies":[]}]}