{"poster":"SirTobi","date":"2016-08-28T00:29:43.170+0000","title":"Midlaner/in für Team gesucht; Elo Zweitrangig !!!","subforum":"Clans & Teams","up_votes":3,"down_votes":2,"body":"Hallo,\n\nfalls du dich f&uuml;r** eine/n nette/n Spieler/in** h&auml;lst, luftig-locker **die Midlane dominierst** und das im Team beweisen m&ouml;chtest, bist du bei uns vielleicht gut aufgehoben. \n\nUnser Team hei&szlig;t &quot;Alles Klar&quot; und war bisher, aufgrund geringer Mitglieder Zahl, nur im 3vs3 Ranked aktiv. Mit dir zusammen wollen wir das &auml;ndern und mit einer Mischung aus gesundem Ehrgeiz und einer Prise Humor die 5vs5 Leiter erklimmen. **Dabei sind Spieler/innen, die neu im Teamranked sind, als auch Veteranen gleicherma&szlig;en willkommen. Deine pers&ouml;nliche Elo ist ebenfalls nicht_ so_ wichtig. **Momentan bewegen sich die Mitglieder, mich eingeschlossen, ein einem Bereich von Gold1- Plat 3. Wenn du Unranked/Bronze/Silber/Gold bist, aber dich selber mal mit und gegen Spieler h&ouml;here Elos beweisen m&ouml;chtest, bist du genauso gerne gesehen, wie jeder andere.\n\n**Grunds&auml;tzlich gilt, dass eine gesunde Einstellung fehlende F&auml;higkeiten wettmacht.**\n\nFolgende Punkte sind **optional**:\n- Offenheit gegen&uuml;ber anderen Spielern\n- generelle Erfahrung aus der SoloQ/dem Teamranked\n- um die 20 Jahre alt\n\nEin paar Dinge solltest du aber **unbedingt** mitbringen:\n- Ehrgeiz/Kritikf&auml;higkeit (sowohl austeilen, als auch einstecken k&ouml;nnen ist hierbei besonders wichtig); &quot;Trashtalken&quot; ist ok, wenn es sich in Grenzen h&auml;lt\n- Spa&szlig; am (Team)Spiel\n- ein paar freie Stunden in der Woche und am Wochenende (vorzugsweise Abends)\n- ein Teamspeak f&auml;higes Headset/Mikrofon \n\nFalls wir dein Interesse geweckt haben, add mich einfach und gib einen Kommentar ab, in dem du kurz folgende Infos zusammenfasst:\n\n- Alter\n- Champion-Pool \n- Was dich auszeichnet\n- Was du erwartest\n\n\n{{summoner:31}} **Wir freuen uns &uuml;ber jede Bewerbung!! :)**  {{summoner:31}}","replies":[{"poster":"King Babo","date":"2016-08-28T17:14:17.705+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\nich bin Sascha und 29 Jahre alt. Ich bin auf der suche nach einem Team. Ich spiele LoL seit der Alpha und habe in der Mitte sehr viel Erfahrung.\nIch bin ein ruhiger Spieler welcher nicht flamt. Ich habe keinen besonderen Elo Rank da ich dies nicht spiele.\nWenn sehr selten weil langeweile.\nIch habe Durchhaltevermögen und bin kritikfähig.\nEs wäre schön wenn ihr ein Team wärt was sich nciht wieder nach 2 Wochen auflöst wie die meisten Teams.\nChampions habe ich alle.\nLieben Gruß","replies":[]},{"poster":"TheGreenNero","date":"2016-08-28T04:56:10.396+0000","up_votes":1,"down_votes":0,"body":"Hi,\nMeine ist TheGreennero aka Sven ich bin 22 jahre alt mein Champion-Pool besteht aus Viktor(Main),Lb,Veigar,Vlad,Azir,Varus würde auch noch andere Champs lernen wenn es dem Team hilft. Mich macht aus ich kann mich schnell an neuen Champs gewöhnen und möchte mich stets verbessern. Ich erwarte von dem Team das es nicht gleich nach 2-3 Games aufgibt nur weil es mal nicht läuft. Meine Elo ist Momentan auf Gold 4","replies":[]},{"poster":"El Bardô","date":"2016-08-28T00:42:24.797+0000","up_votes":1,"down_votes":0,"body":"Hi ich wollte ma fragen warum das Mindestalter 20 sein muss ?","replies":[{"poster":"SirTobi","date":"2016-08-28T00:48:21.459+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\ndas Mindestalter ist nicht 20. Wir sind alle 20 und das \"~20\" meint \"ca 20\". Wenn du 16, 17 oder 23 bist ist das auch ok. C:","replies":[{"poster":"El Bardô","date":"2016-08-28T01:27:32.732+0000","up_votes":1,"down_votes":0,"body":"ja dann erstmal Moin ich heiße yannick bin 17 jahre alt. Jetzt zu meinem Championpool : Vladimir cassio viktor anivia ahri falls ich einen speziellen Champion lernen soll wäre das keinen Problem. Mich zeichnet aus ich bin ehrgeizig will mich immer in lol verbessern. Bin derzeitig Platin 3 und spiele regelmäßig lol meine Vorstellung wäre das wir das Team ernst nehmen und auch traineren.","replies":[]}]}]},{"poster":"Tickle my Donger","date":"2016-08-28T01:00:15.785+0000","up_votes":1,"down_votes":1,"body":"Na ich weiss nicht so recht :c","replies":[]}]}