{"poster":"FOR JUSTICE","date":"2018-10-08T16:59:50.865+0000","title":"Saying \"Riot only bans for money\" is honestly the most ridiculous argument ever.","subforum":"Player Behavior","up_votes":17,"down_votes":9,"body":"Youre essentially saying riot locked you out of a game, and wiped you of all of your rp purchases.\nso you then decide to spend even more money on an account that has the exact same restrictions and/or penalties\n\n{{sticker:slayer-jinx-unamused}} ","replies":[{"poster":"BurakkuRozu9","date":"2018-10-08T17:02:02.723+0000","up_votes":4,"down_votes":13,"body":"No one says this","replies":[{"poster":"DrCyanide","date":"2018-10-08T17:03:34.937+0000","up_votes":11,"down_votes":2,"body":"Clearly you're new here. It comes up *very* frequently.","replies":[{"poster":"BurakkuRozu9","date":"2018-10-08T17:08:00.137+0000","up_votes":3,"down_votes":8,"body":"Not at all.  Just going through weeks, and the month, there doesn't seem to be any mention of banning for money, aside from this post. You new here?","replies":[{"poster":"BobaFlautist","date":"2018-10-08T17:23:16.649+0000","up_votes":9,"down_votes":1,"body":"Did you like...actually look?\n\nhttps://imgur.com/a/FhJrz9F","replies":[{"poster":"BurakkuRozu9","date":"2018-10-09T02:18:27.694+0000","up_votes":1,"down_votes":1,"body":"So aside from the post 8 months ago, and if you want to include the 10 month old post? Where do people say Riot bans to make money?\n\nThere is just people complaining about themselves wasting money and getting banned. No one there is saying they are getting banned so that Riot can get more revenue. They are saying that they wasted their money because they got banned, and want a refund. So did you actually read them?\n\nSaying riot only bans for money is not the same as saying you wasted on because you got banned.","replies":[{"poster":"Subdue","date":"2018-10-09T02:35:10.983+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BurakkuRozu9,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=00000000000000020000,timestamp=2018-10-09T02:18:27.694+0000)\n>\n> So aside from the post 8 months ago, and if you want to include the 10 month old post? Where do people say Riot bans to make money?\n> \n> There is just people complaining about themselves wasting money and getting banned. No one there is saying they are getting banned so that Riot can get more revenue. They are saying that they wasted their money because they got banned, and want a refund. So did you actually read them?\n> \n> Saying riot only bans for money is not the same as saying you wasted on because you got banned.\n\nDude... they're in this thread... READ.","replies":[]}]}]},{"poster":"Pika Fox","date":"2018-10-08T17:10:27.661+0000","up_votes":6,"down_votes":0,"body":"Riots forum searching isnt useful or good.","replies":[{"poster":"BurakkuRozu9","date":"2018-10-08T17:13:08.723+0000","up_votes":1,"down_votes":1,"body":"I guess google's search engine isn't good either huh?","replies":[{"poster":"Pika Fox","date":"2018-10-08T17:25:38.706+0000","up_votes":3,"down_votes":0,"body":"Googles search function doesnt do a good job searching for specific worded things in a random post, especially if its not directly in the OP. Its built to look for commonly searched for pages/sites.","replies":[{"poster":"Last avatarname","date":"2018-10-09T12:36:59.380+0000","up_votes":1,"down_votes":0,"body":"I just gave a response to the guy above that you might like then, it helps you find results like this using the google search engine.","replies":[]}]},{"poster":"Voldymort","date":"2018-10-08T17:15:39.333+0000","up_votes":2,"down_votes":1,"body":"not really. unless you know what the post was called or how the story was phrased , it's unlikely you'll find what you're looking for","replies":[]},{"poster":"Last avatarname","date":"2018-10-09T12:33:48.250+0000","up_votes":1,"down_votes":0,"body":"So, just checking if it wouldn't give results I did do a google search.\nfirst I used this specific phrasing to lock in the site:(also this is not a personal attack or me disagreeing with you, I am just curious)\n\nsite:boards.na.leagueoflegends.com/en/c/player-behavior-moderation riot games money\n\nThe most recent post that says in the title about banning for the  money is 8 months ago:\nhttps://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/e0QPUWBy-so-the-banning-system-is-about-money\n\nSo, not being satisfied, I also wanted to know when the most recent comments were made so I refined my search. Using direct search I refined my query to this: www.google.com/search?tbs=qdr:d14\n\nThis limits my search to the last 14 days(gregorian calendar command, for more info see www.google.com/search?q=site:boards.na.leagueoflegends.com/en/c/player-behavior-moderation/&tbs=qdr:d14), then I searched:\n\nsite:boards.na.leagueoflegends.com/en/c/player-behavior-moderation/ bans for money\n\nThis limits my search to the last 14 days of our existence causing more irrelevant things like comments to shoot up my recommended area. here are some of the results of it being said the past 14 days.\n\nhttps://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/Xb3EX6eT-banning-accounts-the-right-move\n6 days since I responded\n\n> [{quoted}](name=mlm olo mlm,realm=NA,application-id=ZGEFLEUQ,discussion-id=Xb3EX6eT,comment-id=0004,timestamp=2018-10-03T15:27:23.461+0000)\n>\n> New player queue times are relatively fast. Between bots, smurfs, and actual new people, there is a steady population for the new people to play with. (New people aren&#x27;t going to wait 10 minutes queues. They are uninstalling or buying an account.)\n> \n> Every banned account is a money making opportunity, if done correctly. A drug dealer sells drugs. The drug user does a small amount of drugs. The drug dealer steals the drugs back. Then offers the addicted drug user, the opportunity to buy the drugs again. The addiction is the key point. Only ban people with addiction problems.\n> \n> &quot;Self-righteous&quot; people love it because whoever they report gets punished. They are selfish anyways, they don&#x27;t care about toxic people or new player experience. I imagine they spend money the longer they stick around.\n> \n> So, bans are $$$, If you want money, bans are smart. If you want player behavior reform, bans are not smart. If you want ranked integrity, free accounts and bans are not smart.\n\nthen there are post implying that riot mostly bans people who spent money on this game.\n\nhttps://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/a3qsL4mq-flaming-should-be-allowed\n\nwhere he also admits believing in the hidden agenda:\n\n> [{quoted}](name=Report this Ahri,realm=EUW,application-id=ZGEFLEUQ,discussion-id=a3qsL4mq,comment-id=00070000,timestamp=2018-09-29T19:34:49.945+0000)\n>\n> You don&#x27;t know that, they might have a hidden agenda.\n\nhttps://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/RAfb0McT-got-banned-for-intentional-feeding-for-a-game-with-02-death \nand here is another one, this from 13 days ago.\n\n\nSo to answer your question, it is not extremely common, but the argument definitely gets thrown around.\n\nThis does not mean that just visiting this site, you will find thousands of people replying this. It is just somewhat common.\n\nHope this somewhat clears up the confusion","replies":[{"poster":"BurakkuRozu9","date":"2018-10-20T21:27:52.045+0000","up_votes":1,"down_votes":0,"body":"Exactly. There is one actual post, and then one or two people posting conspiracy comments. It's like people don't bother reading.","replies":[]}]}]}]},{"poster":"zPOOPz","date":"2018-10-08T17:09:08.893+0000","up_votes":8,"down_votes":2,"body":"month?  Must be some mighty selected readings/browsings","replies":[{"poster":"Voldymort","date":"2018-10-08T17:12:29.263+0000","up_votes":3,"down_votes":2,"body":"https://imgur.com/mR6iAll","replies":[]}]}]}]}]},{"poster":"Vreivai","date":"2018-10-08T17:28:48.474+0000","up_votes":6,"down_votes":2,"body":"They do ban for money, but not for the reason those saying it think.\n\nThey do it because they think they'll get more people playing their game if they remove or reform the players that harass other players, which will lead to more RP purchases.","replies":[{"poster":"WeaselRune","date":"2018-10-08T18:56:42.480+0000","up_votes":1,"down_votes":0,"body":"Then how come they dont bother banning the E-mail? You can make another account on the same E-mail? If the goal is to \"remove\" or reform, then the players certainly arent getting removed.... \n\nI made a post about this when I made this new account to make a \"sup only climb\" and was constantly being exposed to the most toxic players in the game that had obviously been recently banned...\n\nSo Riots goal is \"because they think they'll get more people playing their game if they remove or reform the players\" then thats BS. All they do is piss off people who already are toxic by destroying their time/money investment, and then shuffle them into path of beginning/new players to... what... make money? drive them away? or teach them to be toxic also?\n\nStudies show time out is the best way to discipline children, not taking their Xbox with all their games, & saves, and throwing it in the trash to teach them to be good.... though Im sure Microsoft would approve cause if they want those games back, it will cost $$$.......\n\nIts really simple, banned players dont cease to exist... they just have to make new accounts, and if you dont think some of them spend money to replace missing champs, maybe not all but def. some... If you dont think that happens, then I dont know what to say. Overwatch will ban people for season, then they can come back and play competitive after theyve had a while to grow up. If Riot were really trying to reform people, they would go with the time out (2 week ban followed by seasonal ban).","replies":[{"poster":"Subdue","date":"2018-10-08T19:16:47.945+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WeaselRune,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=00010000,timestamp=2018-10-08T18:56:42.480+0000)\n>\n> Then how come they dont bother banning the E-mail? You can make another account on the same E-mail? If the goal is to &quot;remove&quot; or reform, then the players certainly arent getting removed.... \n> \n> I made a post about this when I made this new account to make a &quot;sup only climb&quot; and was constantly being exposed to the most toxic players in the game that had obviously been recently banned...\n> \n> So Riots goal is &quot;because they think they&#x27;ll get more people playing their game if they remove or reform the players&quot; then thats BS. All they do is piss off people who already are toxic by destroying their time/money investment, and then shuffle them into path of beginning/new players to... what... make money? drive them away? or teach them to be toxic also?\n> \n> Studies show time out is the best way to discipline children, not taking their Xbox with all their games, &amp; saves, and throwing it in the trash to teach them to be good.... though Im sure Microsoft would approve cause if they want those games back, it will cost $$$.......\n> \n> Its really simple, banned players dont cease to exist... they just have to make new accounts, and if you dont think some of them spend money to replace missing champs, maybe not all but def. some... If you dont think that happens, then I dont know what to say. Overwatch will ban people for season, then they can come back and play competitive after theyve had a while to grow up. If Riot were really trying to reform people, they would go with the time out (2 week ban followed by seasonal ban).\n\nRiot has stated multiple times, the permanent ban is not an attempt to reform a player.  It is a message, \"GET OUT.\"  Some people will come back anyway, but certainly not all of them.  Probably not most of them.\n\nAlso, I don't think you're able to create more than one account off of the same email.  However, even if you were, it's not like emails are difficult to come by.","replies":[{"poster":"WeaselRune","date":"2018-10-08T19:40:26.745+0000","up_votes":2,"down_votes":3,"body":"> It is a message, \"GET OUT.\" Some people will come back anyway...\n\nThen some of them spend money...\n\n>Probably not most of them.\n\nReally? People who play a game get an account banned and say \"I dont like MOBAs now, done with that forever.\" Based on what? Fantasy? Opinion? Delusion? Why are there so many accounts named \"unreformed\" or \"still toxic\" that I encountered when leveling this support only account? Because most of them quit when banned? Sure, probably it.\n\n>Also, I don't think you're able to create more than one account off of the same email.\n\nYou dont think.... come back when youre certain you cant cause you can. Im sure you can even look on these forums finding threads talking about it....\n\nThis post... two big baseless opinions formed from what you want, like, hope, believe, but nothing form observation; thats how a religion starts.","replies":[{"poster":"Ifneth","date":"2018-10-09T18:31:00.214+0000","up_votes":1,"down_votes":0,"body":"When you started that climb, an automatic smurf-detector flagged you for not being a new player and put you in a smurf queue.  Now, you play with only players who are starting extra accounts, many of which they use because their first account was banned.  Hence the toxicity.","replies":[{"poster":"WeaselRune","date":"2018-10-10T20:31:39.597+0000","up_votes":2,"down_votes":0,"body":"I agree I was put in a smurf que at one point. Yes, may banned players make accounts and are very toxic, though in a different manner after the first ban often times.\n\nI was being called and seeing others called ni**er and fa**ot in the first hand full of matches after getting out of bots. On top of that, for a while my winrate was negative cause of all the newbs getting stomped on my team so hard they couldn't be carried. Of course while Im waiting for the match to end one person on my team is still raging in all chat telling others to die in a fire for being a no life smurf. Other matches people are stomping on my team making rape jokes about how our team looks like our mothers last night begging for them to take the dick out.\n\n\nThe smurf detection system hadn't put me with other smurfs inside of 10 post bot match games that have a negative win rate... After around 20 matches I think it caught on, but I was appalled at how unreal the slurs and rape comments were. There was some of that when I first started, but I had forgotten how much the N-word got used.\n\n\nAside from that, the toxicity remained about at constant once Im certain I was placed in other smurfs. People started using meta tactics, and playing in a way that was starkly different at one point, but the toxicity went from slurs and rape jokes to passive aggressive and backhanded comments. More along the lines of \"Well all the lanes are feeding bots, ff.\" Sutff like \"mid afk, gg\" \"We don't have a jungle, just open mid\" or \"I cant even with this bot lane, next match.\" The best are when someone ask \"why did you x\" and someone takes the bait and then they start typing a novel of crap at them. I mean novel too. They would just spew endlessly, trying to get the person riled up so they would say \"fuck off\" or call them a \"dumbass\" or something so they could report them.\n\nSee one problem with Riots ban system is it encourages trolls to try and bait other people into a response that can get them punished. People see troll baiters all the time, and its because of the perma bans people want to make others suffer. So this system also brings in trolls who are \"playing league\" but their real game is getting others punished. If perma bans exist, those trolls will always be in the game trying to bait people. They would never truly go away, but if their sense of impact wanes they may find somewhere else to troll.\n\nSo bans not only fail to remove banned players from the game, they also give a tool for trolls to fish for victims.","replies":[]}]},{"poster":"Subdue","date":"2018-10-08T20:13:49.671+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WeaselRune,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=0001000000000000,timestamp=2018-10-08T19:40:26.745+0000)\n>\n> Then some of them spend money...\n> \n> Really? People who play a game get an account banned and say &quot;I dont like MOBAs now, done with that forever.&quot; Based on what? Fantasy? Opinion? Delusion? Why are there so many accounts named &quot;unreformed&quot; or &quot;still toxic&quot; that I encountered when leveling this support only account? Because most of them quit when banned? Sure, probably it.\n> \n> You dont think.... come back when youre certain you cant cause you can. Im sure you can even look on these forums finding threads talking about it....\n> \n> This post... two big baseless opinions formed from what you want, like, hope, believe, but nothing form observation; thats how a religion starts.\n\nLet me ask you something.  Do you think ALL players who are permanently banned go on to create new accounts?  Is that your claim here?","replies":[{"poster":"Illabethe","date":"2018-10-09T14:45:32.005+0000","up_votes":2,"down_votes":0,"body":"Go make a new account. 4 out of 5 players per game at low levels are renewed bannees. Most aren't even ashamed to admit it, and many will even name their account based on being a bannee.","replies":[{"poster":"Subdue","date":"2018-10-09T14:58:07.913+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Illabethe,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=000100000000000000000001,timestamp=2018-10-09T14:45:32.005+0000)\n>\n> Go make a new account. 4 out of 5 players per game at low levels are renewed bannees. Most aren&#x27;t even ashamed to admit it, and many will even name their account based on being a bannee.\n\nWell first of all, Riot estimates player skill early on and bumps those it identifies as smurfs, so when you smurf, it's more likely for you to run into other smurfs than a new player.  That said, I'd question the 4 out of 5 number.\n\nBut even if all that were true, what still makes absolutely no sense is the assertion that Riot bans players to make more money off the players they ban.  Literally no sense whatsoever.  For that to be true, all of the following would have to be true:\n\n1. Players are more likely to spend money on a fresh account than on an account they've had for years and already spent money on.\n2. Riot has identified as a target for sales growth the .006% of players they actually ban.\n3. The potential paying customers put off by toxic behavior do not far outweigh the spending potential of the toxic players.\n\nIf you don't agree with the above 3 assumptions, then the assertion that Riot bans players to make more money off of them makes absolutely no sense.","replies":[]}]},{"poster":"WeaselRune","date":"2018-10-08T21:34:51.975+0000","up_votes":2,"down_votes":1,"body":"My logic train is that if someone who wants to play MOBA style games will continue to play MOBA style games. If someone who wants to play League of Legends is banned, they will not cease playing the game.\n\nI dont know about ALL players, making that kind of assumption would be foolish.\n\nI do know about basic human behavior and desires. If they want to play the game, an account being banned wont stop them from playing. Not sure why you think it would. If banning people cured toxicity, then based on a game with millions of players Riot would have weeded out all the toxic people interested in MOBAs by now and the game wouldnt have any toxic people in it anymore cause they get banned and dont come back hurr durr...\n\nI cant say how many make a new account after being banned, do they? YES, undoubtedly, you can take a trip through player behavior with people talking about how they were banned and realized how toxic they were, and consider themselves reformed... they obviously made new accounts. There are plenty of those, and probably thousands more that do the same but dont write on the forums about it.\n\nDose Riot make twice as much money for selling the same skin to a banned player on a new account? YES, they do.\n\nRiots ban stance does two things, first, to those not looking very closely it looks like theyre cracking down on poor player behavior that makes some people think \"Riot is protecting me for trolls and ragers!\" Second, It makes some people who get banned potentialy buy stuff twice. If they make a new account and dont buy anything, who cares they already got their money. If theyve never spent a dime on the game who cares, they dont spend money. Win/win for Riot. Makes people stay off their back cause theyre \"doing something\" and sometimes makes them money twice.\n\nSo my \"claim\" is that banning doesnt remove banned players from the game (provided they make the effort to make a user name and password), and their bans stand to make them money by selling to people twice (provided the player wishes to replace champs and skins they desire).... thats my stance, I tried to explain it for you multiple ways so you could understand.","replies":[{"poster":"Subdue","date":"2018-10-08T22:39:58.753+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=WeaselRune,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=000100000000000000000000,timestamp=2018-10-08T21:34:51.975+0000)\n>\n> My logic train is that if someone who wants to play MOBA style games will continue to play MOBA style games. If someone who wants to play League of Legends is banned, they will not cease playing the game.\n> \n> I dont know about ALL players, making that kind of assumption would be foolish.\n> \n> I do know about basic human behavior and desires. If they want to play the game, an account being banned wont stop them from playing. Not sure why you think it would. If banning people cured toxicity, then based on a game with millions of players Riot would have weeded out all the toxic people interested in MOBAs by now and the game wouldnt have any toxic people in it anymore cause they get banned and dont come back hurr durr...\n> \n> I cant say how many make a new account after being banned, do they? YES, undoubtedly, you can take a trip through player behavior with people talking about how they were banned and realized how toxic they were, and consider themselves reformed... they obviously made new accounts. There are plenty of those, and probably thousands more that do the same but dont write on the forums about it.\n> \n> Dose Riot make twice as much money for selling the same skin to a banned player on a new account? YES, they do.\n> \n> Riots ban stance does two things, first, to those not looking very closely it looks like theyre cracking down on poor player behavior that makes some people think &quot;Riot is protecting me for trolls and ragers!&quot; Second, It makes some people who get banned potentialy buy stuff twice. If they make a new account and dont buy anything, who cares they already got their money. If theyve never spent a dime on the game who cares, they dont spend money. Win/win for Riot. Makes people stay off their back cause theyre &quot;doing something&quot; and sometimes makes them money twice.\n> \n> So my &quot;claim&quot; is that banning doesnt remove banned players from the game (provided they make the effort to make a user name and password), and their bans stand to make them money by selling to people twice (provided the player wishes to replace champs and skins they desire).... thats my stance, I tried to explain it for you multiple ways so you could understand.\n\nFirst of all, if you aren't claiming that ALL permanently banned players come back on new accounts, then you are admitting that the current process does indeed reduce toxicity, as there are fewer toxic players than there would be if said players were not being permanently banned.\n\nSecond of all, can you think of any other business, gaming or otherwise where you would believe that the act of telling patrons their business is unwelcome would be considered a solid business strategy?  If a movie theater kept taking your money and then kicking you out halfway through the show, would you keep going to that movie theater?  You still like movies right?  If a bar kept taking your money and kicking you out before you finished your drink, would you keep going to that bar?  You still like to drink right?  If a taxi service kept dropping you off halfway to your destination and telling you to fuck off, would you keep using that taxi service?  You still have places to go right?\n\nAny salesperson, any marketing person, anyone with any experience at all in the field will tell you that it is much easier and much more lucrative to keep an existing customer than it is to land a new one.  This is why every brand from lowly mom-and-pop restaurants to huge chains like Starbucks, and across industries from hotels to airlines to retail stores ALL have loyalty programs designed to keep customers coming back.  These companies are investing huge amounts of money to make sure they KEEP their customers.  When a company tells you \"Go away, we don't want your business,\" it's pretty safe to assume **they don't want your business**.\n\nAnd finally, for those players that do decide return AND spend more money on the game, do you think they will continue to be toxic?  If there was a big red button on the League client that would permanently delete your account and you accidentally pressed it once, do you think if you created a new account you would ever press that button again?\n\nAm I going to argue that no one ever comes back and spends money?  No, that's the hazard of absolutes.  However, anyone with common sense can understand that a business model that involves sending customers away in hopes that they'll come back and purchase more goods is ludicrous, and that those who do decide to come back and spend more money are much less likely to be toxic than if they had never lost their accounts in the first place.","replies":[{"poster":"WeaselRune","date":"2018-10-08T23:48:22.203+0000","up_votes":2,"down_votes":1,"body":">First of all, if you aren't claiming that ALL permanently banned players come back on new accounts, then you are admitting that the current process does indeed reduce toxicity\n\nNo....? I dont know how many make accounts after being banned, I know some do, I dont know that they all do. Its possible that they all do, not knowing if they all do dosnt mean I admit it reduces toxicity (and by reduce you are saying REMOVES toxic players)... it means I admit to not knowing how many people make new accounts after being banned. Its somewhere between 1-100% of people. Just because I cant say its 100% (because it could be, I DONT KNOW) doesnt mean I have say its therefore removed ANYONE.... Not sure how you arrived at that nonsense, but it is indeed a fallacy to say I admitted anything of the kind.\n\nRemember earlier when I said what causes religions? Youve got talent, cause this is the typical \"You cant prove God doesnt exist, so therefore he MUST exist!\" Cant prove all banned players make new accounts, therefore they dont!\"\n\n>Second of all, can you think of any other business, gaming or otherwise where you would believe that the act of telling patrons their business is unwelcome would be considered a solid business strategy?\n\nI can think of businesses that treat their customers like trash and carry on in a \"if you want this service you will deal with us\" manner. Have you ever dealt with the airlines? They double book, telling people who show up for their flight they cant go on it cause they sold the seat twice... and if you dont like it, you can just suck it, hell you can walk to where youre going. Just like how if Riot bans someone, and they still want to play... they can just suck it (up an make a new account). League of Legends is the only League of Legends, so if a player wants to fly they... oh, I mean play League, they will deal with their treatment of being double booked... I mean being banned. So yeah... I can think of other businesses that do that, and GAMING... YES, RIOT BANS PEOPLE... and they make new accounts; think we covered that.\n\n>Any salesperson, any marketing person, anyone with any experience at all in the field will tell you that it is much easier and much more lucrative to keep an existing customer \n\nThis would be an actual point, if there was another League of Legends.... Its isnt a car rental service, or a meal delivery plan, or a taxi company. Its ONE game. If you want that ONE thing that their is ONE of, you can only get that ONE thing from ONE place. Therefore, if a person wants that thing, they will try to get it. Ban... or no. I dont think people are considering the \"feelings\" of draconian punishment method when making a new account.\n\n>it's pretty safe to assume they don't want your business.\n\nIrrelevant if the PLAYER makes a new account, and wants to give them money... why even bother typing this. Its pointless, people make new accounts after being banned, its a fact regardless of if Riot wants them to.\n\n>And finally, for those players that do decide return AND spend more money on the game, do you think they will continue to be toxic? If there was a big red button on the League client that would permanently delete your account and you accidentally pressed it once, do you think if you created a new account you would ever press that button again?\n\nDont ask me to explain self destructive human behavior, why does anyone do anything that they know is bad for them? Brain damage, addiction, stubbornness, inebriation, stupidity. \n\nHere you will see some agreement from me that \"punishment\" can work to change behavior. Banning people for the season, or 3 months, would serve much the same purpose of teaching people the lesson that this point of yours is trying to make... with one exception. Time out ends, and people dont have to buy stuff twice. I agree Riot \"punishes\" people to affect behavior, but they BAN permanently because people DO come back, and when they do they HAVE TO spend money if they want their champs/skins back in short order.\n\nPick an arbitrary long duration, 1 year. If people had accounts suspended for 1 year.... they would have time to think about what theyve done, time to physically, and emotionally mature, and it would be a significant removal period. People could come back, new attitude, avoid the same mistakes that got them kicked out for a year, it would do all the things bans do... except make people buy stuff twice... unless they bought some things on the account they made while waiting to play on their original.\n\n>a business model that involves sending customers away in hopes that they'll come back and purchase more goods is ludicrous\n\nThats not the business model, never said it was, youre inferring that, trying to argue cause you dont have anything better to do or you just cant get what Im saying.\n\nThe business model is a a game where they give an slightly unfair playing field of only having a few champions slowly trickle in, but you can buy them to increase your composition/counter pick options, and also sell cosmetics, while occasionally selling cosmetics twice to a small % of players as a little extra.\n\nLike I said, Riot \"punishes\" to affect player behavior. Extreme offenders should get some kind of punishment, consistent or violent threats should get some kind of ban I should think, just not perma bans. I dont think perma bans do anything productive... cept maybe in corporate eyes.","replies":[{"poster":"Subdue","date":"2018-10-09T00:32:17.449+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WeaselRune,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=00010000000000000000000000000000,timestamp=2018-10-08T23:48:22.203+0000)\n>\n> No....? I dont know how many make accounts after being banned, I know some do, I dont know that they all do. Its possible that they all do, not knowing if they all do dosnt mean I admit it reduces toxicity (and by reduce you are saying REMOVES toxic players)... it means I admit to not knowing how many people make new accounts after being banned. Its somewhere between 1-100% of people. Just because I cant say its 100% (because it could be, I DONT KNOW) doesnt mean I have say its therefore removed ANYONE.... Not sure how you arrived at that nonsense, but it is indeed a fallacy to say I admitted anything of the kind.\n> \n> Remember earlier when I said what causes religions? Youve got talent, cause this is the typical &quot;You cant prove God doesnt exist, so therefore he MUST exist!&quot; Cant prove all banned players make new accounts, therefore they dont!&quot;\n> \n> I can think of businesses that treat their customers like trash and carry on in a &quot;if you want this service you will deal with us&quot; manner. Have you ever dealt with the airlines? They double book, telling people who show up for their flight they cant go on it cause they sold the seat twice... and if you dont like it, you can just suck it, hell you can walk to where youre going. Just like how if Riot bans someone, and they still want to play... they can just suck it (up an make a new account). League of Legends is the only League of Legends, so if a player wants to fly they... oh, I mean play League, they will deal with their treatment of being double booked... I mean being banned. So yeah... I can think of other businesses that do that, and GAMING... YES, RIOT BANS PEOPLE... and they make new accounts; think we covered that.\n> \n> This would be an actual point, if there was another League of Legends.... Its isnt a car rental service, or a meal delivery plan, or a taxi company. Its ONE game. If you want that ONE thing that their is ONE of, you can only get that ONE thing from ONE place. Therefore, if a person wants that thing, they will try to get it. Ban... or no. I dont think people are considering the &quot;feelings&quot; of draconian punishment method when making a new account.\n> \n> Irrelevant if the PLAYER makes a new account, and wants to give them money... why even bother typing this. Its pointless, people make new accounts after being banned, its a fact regardless of if Riot wants them to.\n> \n> Dont ask me to explain self destructive human behavior, why does anyone do anything that they know is bad for them? Brain damage, addiction, stubbornness, inebriation, stupidity. \n> \n> Here you will see some agreement from me that &quot;punishment&quot; can work to change behavior. Banning people for the season, or 3 months, would serve much the same purpose of teaching people the lesson that this point of yours is trying to make... with one exception. Time out ends, and people dont have to buy stuff twice. I agree Riot &quot;punishes&quot; people to affect behavior, but they BAN permanently because people DO come back, and when they do they HAVE TO spend money if they want their champs/skins back in short order.\n> \n> Pick an arbitrary long duration, 1 year. If people had accounts suspended for 1 year.... they would have time to think about what theyve done, time to physically, and emotionally mature, and it would be a significant removal period. People could come back, new attitude, avoid the same mistakes that got them kicked out for a year, it would do all the things bans do... except make people buy stuff twice... unless they bought some things on the account they made while waiting to play on their original.\n> \n> Thats not the business model, never said it was, youre inferring that, trying to argue cause you dont have anything better to do or you just cant get what Im saying.\n> \n> The business model is a a game where they give an slightly unfair playing field of only having a few champions slowly trickle in, but you can buy them to increase your composition/counter pick options, and also sell cosmetics, while occasionally selling cosmetics twice to a small % of players as a little extra.\n> \n> Like I said, Riot &quot;punishes&quot; to affect player behavior. Extreme offenders should get some kind of punishment, consistent or violent threats should get some kind of ban I should think, just not perma bans. I dont think perma bans do anything productive... cept maybe in corporate eyes.\n\nIt's funny that you mention airlines.  I've been on plenty of flights.  In fact, last year alone I flew 140,000 miles.  I will tell you that #1, airlines go out of their way to retain customers, especially high paying customers, and #2 that situation you just described does not happen the way you described it.  Yes, airlines all double book, because they can count on a certain number of people not showing up.  Flights with a lot of empty seats are very expensive for airlines.  That said, it's not a \"sucks to be you\" situation for the passenger.  Airlines will typically make an announcement looking for volunteers, with progressively higher offers in search of a volunteer.  I've personally seen them offer over $1200 for a seat in addition to booking a later flight for the volunteer, but most of the time people will take the offer at between $400 and $800.  So yes, they go out of their way to not piss off their customers.\n\nAs for wanting to play League of Legends, in multiple posts before you said \"MOBA,\" of which there are several out there.  And if you expand that beyond just one genre of video games, there are thousands of video games across many genres.  This is a good example of moving the goalpost.\n\nAs for the comment on a business model, not only is it not their primary business model, it is CONTRARY to their (or any business's) business model.  Don't send away customers you want to keep.  I don't even know if that makes it into business books because it's just about as obvious as \"breathe so you don't die.\"\n\nPlus, your assertion hinges on so many ridiculous assumptions, I have trouble picking my favorite.  Here's a few:\n\n* Toxic players would not have spent money on RP if they weren't banned.\n* Toxic players would act irrationally and purchase RP after first hand experience that said RP could be taken away for behavior they know they cannot control.\n* Riot earns more revenue from the less than .006% of the player base that is permanently banned, returns on a new account, and continues buying RP than they lose from the hundreds or even thousands of players that are turned off from League due to interactions with those players.","replies":[{"poster":"3TWarrior","date":"2018-10-09T04:37:22.241+0000","up_votes":2,"down_votes":0,"body":"\"flights with a lot of empty seats are very expensive to airlines\"\n\ncan you please back that up?  less fuel used to carry less weight, the tickets are already payed for unless the flight has a refund or cancellation policy\n\nit's been bad enough that there is a law being made that the air-lines can not overbook flights...","replies":[{"poster":"Subdue","date":"2018-10-09T05:44:43.991+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=3TWarrior,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=0001000000000000000000000000000000000001,timestamp=2018-10-09T04:37:22.241+0000)\n>\n> &quot;flights with a lot of empty seats are very expensive to airlines&quot;\n> \n> can you please back that up?  less fuel used to carry less weight, the tickets are already payed for unless the flight has a refund or cancellation policy\n> \n> it&#x27;s been bad enough that there is a law being made that the air-lines can not overbook flights...\n\nIt's simple math. Over half of the total weight of a plane on any given flight is the plane itself. Furthermore, the pilot, the flight crew, as well as all the support staff at the airports must be paid whether every seat is full or the plane takes off with just half the seats filled.\n\nAs for refunds, I mean you can check out the refund policy on various airlines. There are plenty of options for refunding at least part of the value of you tickets. And that's not even including the tickets bought with airline points, which are fully refundable at any time. \n\nhttps://www.aa.com/i18n/customer-service/faqs/customer-service-faqs.jsp","replies":[]}]},{"poster":"WeaselRune","date":"2018-10-09T03:54:17.708+0000","up_votes":2,"down_votes":1,"body":"Glad I mentioned religion in this discussion, because thats what this is like. You have a belief, and you twist your perceptions to support that. Everyone else is confused, what YOU think is real. This makes you argue in circles, and sound like youre just trying to troll... hell at this point I think you may be.\n\n>Am I going to argue that no one ever comes back and spends money? No, that's the hazard of absolutes.\n\nThen you type...\n\n>your assertion hinges on so many ridiculous assumptions\n\n>Toxic players would act irrationally and purchase RP after first hand experience that said RP could be taken away for behavior they know they cannot control.\n\nSo youre not going to argue no one ever comes back and spends money, but then its a ridiculous assumption meaning that youre saying people wouldnt do that.... So youre saying that thing you would never say... ughhhh... OK.\n\nYoure either trolling, or just enjoy arguing with people... thin hair to split at this point.\n\nI feel nothing else can be had from discussing this with you since youre now beginning to contradict yourself.","replies":[{"poster":"Subdue","date":"2018-10-09T05:15:17.134+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WeaselRune,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=0001000000000000000000000000000000000000,timestamp=2018-10-09T03:54:17.708+0000)\n>\n> Glad I mentioned religion in this discussion, because thats what this is like. You have a belief, and you twist your perceptions to support that. Everyone else is confused, what YOU think is real. This makes you argue in circles, and sound like youre just trying to troll... hell at this point I think you may be.\n> \n> Then you type...\n> \n> So youre not going to argue no one ever comes back and spends money, but then its a ridiculous assumption meaning that youre saying people wouldnt do that.... So youre saying that thing you would never say... ughhhh... OK.\n> \n> Youre either trolling, or just enjoy arguing with people... thin hair to split at this point.\n> \n> I feel nothing else can be had from discussing this with you since youre now beginning to contradict yourself.\n\nDid you notice you didn't actually refute any of the points? \n\nDoes your point of view make sense if you don't make the assumptions I listed?","replies":[{"poster":"WeaselRune","date":"2018-10-09T14:15:43.146+0000","up_votes":2,"down_votes":1,"body":">I feel nothing else can be had from discussing this with you since youre now beginning to contradict yourself.\n\nDid you notice how I said youre arguing things you said you wouldnt? If youre going to say things you said you woudlnt, arent you just arguing with me for attention instead of honest opinions?\n\nIf youre going to ignore the fact that I owned you hard by calling out your hypocritical stance, but then say I didnt refute your points then I think we both know what your troll goal is here.\n\nThere is no need to debate with someone trying to waste time for their trollish amusement, all you will do at this point is gish gallop at me, and contradict yourself more eventually, but I cant be bothered to waste more time on dishonest nonsense. Im done with you.","replies":[{"poster":"Subdue","date":"2018-10-09T14:28:41.086+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=WeaselRune,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=000100000000000000000000000000000000000000000000,timestamp=2018-10-09T14:15:43.146+0000)\n>\n> Did you notice how I said youre arguing things you said you wouldnt? If youre going to say things you said you woudlnt, arent you just arguing with me for attention instead of honest opinions?\n> \n> If youre going to ignore the fact that I owned you hard by calling out your hypocritical stance, but then say I didnt refute your points then I think we both know what your troll goal is here.\n> \n> There is no need to debate with someone trying to waste time for their trollish amusement, all you will do at this point is gish gallop at me, and contradict yourself more eventually, but I cant be bothered to waste more time on dishonest nonsense. Im done with you.\n\nI said I wouldn't argue that no one comes back and spends money, and I didn't.  I argued that it would not be a financially viable strategy, which it isn't.\n\nHere, I'll give you some examples of how that logic works:\n\nI wouldn't argue that no one wants to be homeless, but I think most people would prefer to have a home.\n\nI wouldn't argue that no one wants to have a slut for a girlfriend, but I think most people would prefer to have someone loyal.\n\nI wouldn't argue that no one has pet alligators, but I think most people would find that too dangerous and probably expensive.\n\nDo you see the pattern here?  \"No one\" is an absolute.  To disprove an absolute all you need is a single case.  There's a difference an absolute, which I didn't argue, and a probability or improbability.\n\nBut more to the point.  You've made a series of ad hominem attacks against me now, which I've chosen to ignore.  What I won't choose to ignore though is your inability to contest a very simple question:\n\n**DOES YOUR PREMISE MAKE SENSE IF YOU DON'T ASSUME THE FOLLOWING?** (I've added clarification since apparently that nuance tripped you up)\n\n* **(MOST)** Toxic players would not have spent money on RP if they weren't banned.\n* **(MOST)** Toxic players would act irrationally and purchase RP after first hand experience that said RP could be taken away for behavior they know they cannot control.\n* Riot earns more revenue from the less than .006% of the player base that is permanently banned, returns on a new account, and continues buying RP than they lose from the hundreds or even thousands of players that are turned off from League due to interactions with those players.","replies":[{"poster":"DearPear","date":"2018-10-09T14:43:45.029+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Subdue,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=0001000000000000000000000000000000000000000000000000,timestamp=2018-10-09T14:28:41.086+0000)\n>\n> Things\n\nPoints for trying but it's like debating with an antivax, all you are in for is disappointment at their inability to question their beliefs.","replies":[]}]}]}]}]}]}]},{"poster":"Illabethe","date":"2018-10-09T14:51:05.860+0000","up_votes":3,"down_votes":1,"body":"Wrong. The remaining players are just as toxic, and many of those who return get MORE toxic, and strictly come back to grief an to try to \"beat the system\" rather than just being naturally toxic. And many get away with it, because they know the IFS is a robot, that can't decipher subtle differences in text.\n\n-They mispell their chats on purpose.\n-They use terminology to bait others into toxicity.\n-They yolo feed rather than run down the middle int feed, picking up enough kills to not trigger an inting investigation.\n-They afk farm rather than actually playing a role, sometimes even going as far as to going between lanes to deprie teammates of farm to force the games.\n\nThere's no end to the creative things ex -bannees do to bring their toxicity back into the game. And they increase toxic responses from people who haven't been banned yet, creating a larger pool of dishonorables. \n\nSo no. The bans do not improve toxicity, and Riot's own stats don't defend that argument.","replies":[{"poster":"Subdue","date":"2018-10-09T15:00:01.019+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Illabethe,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=00010000000000000000000000000001,timestamp=2018-10-09T14:51:05.860+0000)\n>\n> Wrong. The remaining players are just as toxic, and many of those who return get MORE toxic, and strictly come back to grief an to try to &quot;beat the system&quot; rather than just being naturally toxic. And many get away with it, because they know the IFS is a robot, that can&#x27;t decipher subtle differences in text.\n> \n> -They mispell their chats on purpose.\n> -They use terminology to bait others into toxicity.\n> -They yolo feed rather than run down the middle int feed, picking up enough kills to not trigger an inting investigation.\n> -They afk farm rather than actually playing a role, sometimes even going as far as to going between lanes to deprie teammates of farm to force the games.\n> \n> There&#x27;s no end to the creative things ex -bannees do to bring their toxicity back into the game. And they increase toxic responses from people who haven&#x27;t been banned yet, creating a larger pool of dishonorables. \n> \n> So no. The bans do not improve toxicity, and Riot&#x27;s own stats don&#x27;t defend that argument.\n\nI'm not sure what you're arguing with here.  If there are 1000 toxic players, and they're all permabanned, but 999 of them come back on a new account and continue to be toxic, that's still one less toxic player.  Or are you arguing that ALL toxic players come back?","replies":[]}]}]}]}]}]},{"poster":"Illabethe","date":"2018-10-09T14:41:32.701+0000","up_votes":1,"down_votes":0,"body":"Most come back. It's a Casino. We're gamblers. We see the sweet incentives of a fresh Honor 2 account, the fresh Placements which can autoplace us in gold and then we can lay back and Norms play casually and without a temper (because..... you know ..... most banned accounts are the result of the tension of climbing ranked with bad players. We don't care about bad players in minigames or norms).\n\nThe. Game. Is. Addictive.\n\nP.S. You can use the same email for multiple accounts. Even if you \"couldn't,\" you could..... simply because the forum account is different than the game access to the account. If you get permabanned, you can just change the email on the old account, and reuse the old email for a new account.\n\n","replies":[]}]}]},{"poster":"Illabethe","date":"2018-10-09T14:36:25.395+0000","up_votes":1,"down_votes":0,"body":"Except..... almost all banned players make new accounts. I'm on account # 5, and I've spent over $1200 per account. The 4th account had over $1600.\n\nI'm nursing this account..... I've got a new $240k house to pay for.","replies":[]}]},{"poster":"LeftyRaydy","date":"2018-10-08T23:11:48.786+0000","up_votes":1,"down_votes":6,"body":"while they may not ban directly for money it is part of it.\n-Riot says you do not own your account which first off is big BS (blahh blah blah you agreed to these terms)\n-you are not compensated for your banned account which is a big FU, because you can spend hundreds of dollars but not get a single bit of reinbursement. If it was not about money then they would offer some sort of reinburstment it doesnt even have to be full, but why should they care you can either A make a new account or just deal with it.\n- Riot would not Auto ban accounts if it affected their money I can guarantee you that, but the fact that it can only increase their revenue is why they do it. \n\nif you don't think its about money just imagine if banned accounts if it cost them a single penny I can tell you for sure they would not.","replies":[{"poster":"Subdue","date":"2018-10-08T23:14:18.951+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=LeftyRaydy,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=0006,timestamp=2018-10-08T23:11:48.786+0000)\n>\n> while they may not ban directly for money it is part of it.\n> -Riot says you do not own your account which first off is big BS (blahh blah blah you agreed to these terms)\n> -you are not compensated for your banned account which is a big FU, because you can spend hundreds of dollars but not get a single bit of reinbursement. If it was not about money then they would offer some sort of reinburstment it doesnt even have to be full, but why should they care you can either A make a new account or just deal with it.\n> - Riot would not Auto ban accounts if it affected their money I can guarantee you that, but the fact that it can only increase their revenue is why they do it. \n> \n> if you don&#x27;t think its about money just imagine if banned accounts if it cost them a single penny I can tell you for sure they would not.\n\nIf halfway during a movie at a theater you start harassing other patrons and get kicked out, do they refund your ticket?\n\nRiot absolutely expects to profit off of banning toxic players, but not directly from those players themselves.  Rather, they intend to profit off the hundreds or even thousands of players that that player might have put off of the game with his or her behavior.","replies":[{"poster":"LeftyRaydy","date":"2018-10-08T23:27:58.136+0000","up_votes":1,"down_votes":4,"body":"lol ok so in this analogy this person is harrassing other patrons for no reason. ok how about this then you pay for a movie ticket but the guy in front of you is wearing the biggest hat you can imagine and you cant see the movie so you ask him to take it off he doesnt then you start yelling at him, because you paid for your ticket you should see the movie right, but then security gets called and takes you out because you were mad about not being able to watch the damn movie you paid for. I think that more or less sums up League :).","replies":[{"poster":"Subdue","date":"2018-10-08T23:38:02.765+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=LeftyRaydy,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=000600000000,timestamp=2018-10-08T23:27:58.136+0000)\n>\n> lol ok so in this analogy this person is harrassing other patrons for no reason. ok how about this then you pay for a movie ticket but the guy in front of you is wearing the biggest hat you can imagine and you cant see the movie so you ask him to take it off he doesnt then you start yelling at him, because you paid for your ticket you should see the movie right, but then security gets called and takes you out because you were mad about not being able to watch the damn movie you paid for. I think that more or less sums up League :).\n\nAnd you still wouldn't get your money back.","replies":[{"poster":"LeftyRaydy","date":"2018-10-08T23:52:47.369+0000","up_votes":2,"down_votes":2,"body":"Yes that is the point of that analogy haha. I mean that is wrong if someone paid to see a movie, but could not enjoy said movie because of someone else how is that fair. lol you riot fan boys are terrible at making arguments here. just because you can do something does not make it right. I am in Business and I know for a fact that riot would not ban a single person as easily as they do now if it cost them any money. You all have the idea that its because they are doing the right thing, no it is not because the right thing would be at least offering some compensation back from your investment. \n\nNow I have never been banned or chat restricted, but it is seriously stupid to have something you put money into completely taken away from you and if they can \"justify this reason\" they will not give it back or offer any compensation whatsoever. There is almost no real way to compare these things, because we need to catch up on this \"renting\" stuff from companies from the internet because that is such BS. What if tomorrow they decided something (and I will use recent events) if your political views do not match up they can ban your account now and they still do not have to refund you at all does that make sense to you. This is a very dangerous thing to defend and you have no idea, which is why I always protest it. You are purchasing a product here in this case skins/borders/icons and so on. the fact that it cost them nothing to distribute this out to you, but offer no compensation when leaving is dumb. I am not even talking about being banned, what if you are done with league and want to sell your goods, you can't because it would be wrong according to riots standards and can ban said account. \n\nThe fact that you cannot get any compensation back whatsoever is stupid its like if you couldn't sell your car before getting a new one or selling an old refrigerator that still works, but you have no use for it anymore. the fact that you think it is right is fine until it happens to you. It makes me sick that people are ok with this but then again a lot of people are ok with silencing freedom of speech now a days too so I guess I am not too surprised. anyway I wish you luck and hopefully you change your mind before you see something happen like this to you and/or your friends.","replies":[{"poster":"Subdue","date":"2018-10-09T00:46:27.169+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=LeftyRaydy,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=00060000000000000000,timestamp=2018-10-08T23:52:47.369+0000)\n>\n> Yes that is the point of that analogy haha. I mean that is wrong if someone paid to see a movie, but could not enjoy said movie because of someone else how is that fair. lol you riot fan boys are terrible at making arguments here. just because you can do something does not make it right. I am in Business and I know for a fact that riot would not ban a single person as easily as they do now if it cost them any money. You all have the idea that its because they are doing the right thing, no it is not because the right thing would be at least offering some compensation back from your investment. \n> \n> Now I have never been banned or chat restricted, but it is seriously stupid to have something you put money into completely taken away from you and if they can &quot;justify this reason&quot; they will not give it back or offer any compensation whatsoever. There is almost no real way to compare these things, because we need to catch up on this &quot;renting&quot; stuff from companies from the internet because that is such BS. What if tomorrow they decided something (and I will use recent events) if your political views do not match up they can ban your account now and they still do not have to refund you at all does that make sense to you. This is a very dangerous thing to defend and you have no idea, which is why I always protest it. You are purchasing a product here in this case skins/borders/icons and so on. the fact that it cost them nothing to distribute this out to you, but offer no compensation when leaving is dumb. I am not even talking about being banned, what if you are done with league and want to sell your goods, you can&#x27;t because it would be wrong according to riots standards and can ban said account. \n> \n> The fact that you cannot get any compensation back whatsoever is stupid its like if you couldn&#x27;t sell your car before getting a new one or selling an old refrigerator that still works, but you have no use for it anymore. the fact that you think it is right is fine until it happens to you. It makes me sick that people are ok with this but then again a lot of people are ok with silencing freedom of speech now a days too so I guess I am not too surprised. anyway I wish you luck and hopefully you change your mind before you see something happen like this to you and/or your friends.\n\nIn your theater scenario, if you report the guy with the big hat to security, what do you think would happen?  They would either A) make him take it off, or B) Kick him out.  This is because his actions are adversely affecting other customers, and a poor experience for those customers would make it less likely for them to return.\n\nThis is no different from League of Legends.  I absolutely agree with you that it's about money.  All business is about money.  However, the real value is not in what the toxic player may or may not irrationally spend on a new account, but rather, on the other potential customers that the toxic player might drive away.","replies":[{"poster":"LeftyRaydy","date":"2018-10-09T15:32:15.962+0000","up_votes":1,"down_votes":1,"body":"In this Scenario again and everyone has experienced it before the troll that doesn't do anything wrong to get banned or chat restricted (such as troll builds, soft inting, someoone goes AFK on accident all of these effect your experience), but if you get mad and flame the person then you would get a chat ban possibly permanent (based on your history).  This game can be frustrating and I am not talking about the players that are trying and just having a bad game, but the people that are flamers themselves, playing a champ first time in ranked and making you lose the game (which still happens in plat plus elo believe it or not), someone trolling/AFK. I mean look at the game I had to deal with the other day. I went 16/2/2 Our top lane was a 1st time AAtrox and you know what we did not even lose my team surrendered, I was the only person who did not surrender. I WAS FURIOUS.  I get so tired of some of the BS I deal with on a daily basis with the mindset of the people I am playing with. Surrender so easy, claiming the game is over 5 minutes in and this is Plat ELO. \n\nhttps://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2881608777/231057367?tab=overview\n\n\n\nBack to the conversation at hand, the problem that I have with Riot is that they remove our \"ownership\" of the account so that they can ban us without any repercussions. if I spent huge dollars and the game and wanted to sell my account because I am moving on from League I should be able to. Skins are expensive if we are only \"renting\" in that case they should be 1/5 - 1/10 the price they are so, and we should be able to return them for other skins. I will not be happy with riot until we get true ownership of our accounts.","replies":[{"poster":"Subdue","date":"2018-10-09T16:04:20.733+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LeftyRaydy,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=0006000000000000000000000000,timestamp=2018-10-09T15:32:15.962+0000)\n>\n> In this Scenario again and everyone has experienced it before the troll that doesn&#x27;t do anything wrong to get banned or chat restricted (such as troll builds, soft inting, someoone goes AFK on accident all of these effect your experience), but if you get mad and flame the person then you would get a chat ban possibly permanent (based on your history).  This game can be frustrating and I am not talking about the players that are trying and just having a bad game, but the people that are flamers themselves, playing a champ first time in ranked and making you lose the game (which still happens in plat plus elo believe it or not), someone trolling/AFK. I mean look at the game I had to deal with the other day. I went 16/2/2 Our top lane was a 1st time AAtrox and you know what we did not even lose my team surrendered, I was the only person who did not surrender. I WAS FURIOUS.  I get so tired of some of the BS I deal with on a daily basis with the mindset of the people I am playing with. Surrender so easy, claiming the game is over 5 minutes in and this is Plat ELO. \n> \n> https://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2881608777/231057367?tab=overview\n> \n> \n> \n> Back to the conversation at hand, the problem that I have with Riot is that they remove our &quot;ownership&quot; of the account so that they can ban us without any repercussions. if I spent huge dollars and the game and wanted to sell my account because I am moving on from League I should be able to. Skins are expensive if we are only &quot;renting&quot; in that case they should be 1/5 - 1/10 the price they are so, and we should be able to return them for other skins. I will not be happy with riot until we get true ownership of our accounts.\n\nIf you were just saying \"We need to improve detection of trolls,\" sure I'd be all for that.  No idea how Riot would do it, but I'd be for it.\n\nHowever, if you're saying \"I have a right to flame trolls\" then no, I can't agree with that.  For one, your perception of a troll may not always be a troll.  And for another, the person you've identified as a troll is not the only one affected by your flaming.  Your teammates are negatively impacted too.  And finally, you're not banned, or even penalized, for a single instance of losing your cool, unless your reaction is very severe.  Penalties are more typically assessed due to a pattern of harassment.\n\nAs for account ownership, they didn't \"Remove\" it.  It was never yours to begin with.  You were told this upfront before you even created your account.  As for how expensive skins are, well, I think that depends on your point of reference.  $10 for a skin that I'll rent for the life of the game doesn't seem like a lot to me.  But $10 for a skin when I know I'm going to get banned because I can't control myself?  Sure, that sounds like a lot.","replies":[{"poster":"LeftyRaydy","date":"2018-10-09T16:16:23.146+0000","up_votes":1,"down_votes":1,"body":"you completely misunderstanding what I am saying. First I have never been chat banned or temp banned from league so this is not me, but I can understand getting mad in a competitive game where you have to rely on your team to win especially in higher elo's and your team is just holding you down, trolling, and whatever. Also I know we never had ownership, but that does not mean we should never have ownership. These companies and their policies of not owning anything is wrong. when you pay for something you should own it hands down. 10 Dollars is a lot for a skin that cost the company nothing after being made of course. I have almost 100 skins and if I somehow lost this account I would be so livid as I will never see any of that money back. I am mad just thinking that there is no way to get compensation if I wanted to leave the game. I have spent more on this game then a standard 60$ console or PC game and i should be able to make a return on said investment if I decide to leave, but I cannot because I do not \"own\" it. \n\nnow the rent for life thing is fine, but what if you do not want to play league anymore, but you could sell your skin content to other players. That would be amazing not even selling your account, but just the skins. I think this would be a great step in the right direction.","replies":[{"poster":"Subdue","date":"2018-10-09T16:38:12.631+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=LeftyRaydy,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWFKK2sj,comment-id=000600000000000000000000000000000000,timestamp=2018-10-09T16:16:23.146+0000)\n>\n> you completely misunderstanding what I am saying. First I have never been chat banned or temp banned from league so this is not me, but I can understand getting mad in a competitive game where you have to rely on your team to win especially in higher elo&#x27;s and your team is just holding you down, trolling, and whatever. Also I know we never had ownership, but that does not mean we should never have ownership. These companies and their policies of not owning anything is wrong. when you pay for something you should own it hands down. 10 Dollars is a lot for a skin that cost the company nothing after being made of course. I have almost 100 skins and if I somehow lost this account I would be so livid as I will never see any of that money back. I am mad just thinking that there is no way to get compensation if I wanted to leave the game. I have spent more on this game then a standard 60$ console or PC game and i should be able to make a return on said investment if I decide to leave, but I cannot because I do not &quot;own&quot; it. \n> \n> now the rent for life thing is fine, but what if you do not want to play league anymore, but you could sell your skin content to other players. That would be amazing not even selling your account, but just the skins. I think this would be a great step in the right direction.\n\nIt's one thing to get mad.  It's another to use it to harass your teammates.  Everyone gets mad, but being mad does not mean you have the right to harass your teammates because of it.  And sometimes you'll slip up.  We all do.  You don't get penalized for just slipping up, unless your slip up is severe (racial slurs, homophobic slurs, advocating self harm, etc).  Most of the time, your slip up is just that, and nothing more.  The people who end up permabanned are those are go to extremes (as described earlier), and those are show a pattern of abuse to their teammates.  You say you've never been penalized.  Have you never gotten mad?  Never said something rude to a teammate?  Of course you have.  We all have.  The expectation here isn't that you're a saint.\n\nAs for the cost, you are thinking about it in the vacuum of the cost to develop the skin.  But that's not how it works.  How much money do they make from their customer service reps?  $0.  How much money do they make from their accounting department? $0.  How much money do they make from their balance team? $0.  I could go on, but you get the picture.  The sale of skins isn't just supporting the development of those skins.  It's their primary source of income that is paying for a bunch of other necessary assets that aren't sources of income.\n\nLet me ask you this.  If you could pay $1 for what is usually a $10 skin, but that your access to that skin expires after 1 month, would you prefer that over the current system?","replies":[{"poster":"LeftyRaydy","date":"2018-10-09T17:08:19.074+0000","up_votes":1,"down_votes":1,"body":"I would rather pay 10$ for a skin and then if I decided to I could sell that skin for 5$ somewhere else.\n\nOf course like I know about the other sides of business and so on, but what I am saying they do not have to pay for anything else on the skin once it is made. I am not saying flame team mates to oblivion, but if your in a game and someone is constantly ruining your chances of winning and you call them an idiot once I can understand that. Even in real life there are plenty of Assholes, but they are still entitled to compensation for a product or service if said product or service is not up to standard, and/or someone else ruined their fun as well. All I'm all I am saying it is about the money and if Riot wants to eliminate that idea then they can compensate any rp purchased on banned account by 1/4 - 1/2 price I believe that is a fair deal. \n\nI am not saying give 100% back because products and services do lose value (tangible products and services at least) and they still keep 75-50% which is a fair deal for that. I would respect Riot for this. \n\nI will also end this saying that It has been a good discussion with you, compared to what I usually deal with on the board.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}