{"poster":"Kishi","date":"2016-08-27T09:42:54.207+0000","title":"Sugerencia acerca de primeras ranked y posicionamiento.","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Buenas invocadores.. queria dar mi opinion acerca del posicionamiento de las primeras rankeds. Ok no se si lo cambiaron pero en la s3 cuando empece a rankear si ganabas las 10 primeras partidas ibas a oro V, si ganabas 8, plata I/II, y asi sucesibamente hasta bronce. El problema que me encuentro es que en ranked toca gente que no tiene experiencia pero como tuvieron un golpe de suerte y ganaron en varias partidas llegan hasta plata. La solucion es simple, que el mecanismo se mantenga pero que te ubique desde bronce I a V dependiendo de las partidas ganadas e ir subiendo. Debemos recordar que la politica de Riot es que si sos bueno, vas a poder subir, lo que esta perfectamente bien desde mi punto de vista. El punto mas recatable de esto es que al subir por plata no te encuentres gente que no tiene experiencia y no ayudar a smurf que tambien es un problema porque te toca gente que tiene 150 partidas pero parece que juega como oro-platino. \r\nEs mi humilde opinion. Que opinan? les deseo un bonito dia!","replies":[{"poster":"Dark Helel","date":"2016-08-27T16:14:27.483+0000","up_votes":2,"down_votes":0,"body":"El sistema funciona siempre igual, por ELO/MMR,\nno se puede hacer eso q vos decis porque al resetear el MMR estarias poniendo a un diamante q gana 9 partidas con un bronce que gano 8 partidas ambos en bronce 1, entonces como ves es ilogico q ambos siquieran esten cerca...\nel MMR divide e impide que pase eso...el problema que vos ves es justamente Dynamic Q, donde cualquiera puede ser carreado por premades, asi q alguien con 100 wins puede hacer premade con 2 que tengan 2000 ranked ganadas si tienen MMR similar y que suba, desp te lo cruzas y quedas WTF...claro, cuando juega solo o juega mas su MMR se balancea, pero dado que ya esta en una liga que no le corresponde se generan malas partidas igualmente.","replies":[{"poster":"Kishi","date":"2016-08-28T11:04:37.487+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dark Helel,realm=LAS,application-id=v7qsfXsE,discussion-id=wEppLsf5,comment-id=0004,timestamp=2016-08-27T16:14:27.483+0000)\n>\n> El sistema funciona siempre igual, por ELO/MMR,\n> no se puede hacer eso q vos decis porque al resetear el MMR estarias poniendo a un diamante q gana 9 partidas con un bronce que gano 8 partidas ambos en bronce 1, entonces como ves es ilogico q ambos siquieran esten cerca...\n\nNadie nace \"diamante\", uno se hace buen player jugando MUCHO, pero MUCHO! entonces si pertenecen a esa liga no van a subir, es lo que hay colega, si sos bueno vas a poder explotar la debilidad del otro equipo y ganarla. Pregunta a un diamante si tarda de salir de bronce, NAAAAAAAAAAAAA, en una semana se la suben a oro minimo, hay streamers que te suben a platino inclusive. Es ir creciendo segun tus partidas, y esto es lo que se mantuvo desde que se incluyo el MMR","replies":[{"poster":"Dark Helel","date":"2016-08-28T23:01:14.178+0000","up_votes":1,"down_votes":0,"body":"Eso no tiene nada q ver...al parecer no entendiste a que me referia y estas hablando de otra cosa.\n\naparte el MMR no se incluyo...existio siempre desde q se instalo en sistema de ranked, pues MMR=ELO, solo que hecho mas bonito...\n\nEn tu ejemplo no tenes en cuenta la experiencia de jugador, \nsi todos partieran de bronce cada season, implica que un jugador va a tener que aguantarse un desnivel total hasta que el MMR propio y ajeno se nivele, por ende un jugador podria sufrir constantes malos emparejamientos uno tras otro injustamente....es por eso que el ELO se resetea acorde a tu nivel maximo, sumado al de otras seasons  asi se diferencia de el de un jugador promedio para evitar esas cosas.\n\nY lo de diamante...Yo llegue a Oro en 10 partidas sin ser diamante, asi que es facil llegar en menos de 1 semana si se quiere, para un diamante deberia ser todavia mas facil.","replies":[]}]},{"poster":"Kishi","date":"2016-08-28T11:05:08.505+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dark Helel,realm=LAS,application-id=v7qsfXsE,discussion-id=wEppLsf5,comment-id=0004,timestamp=2016-08-27T16:14:27.483+0000)\n>\n> El sistema funciona siempre igual, por ELO/MMR,\n> no se puede hacer eso q vos decis porque al resetear el MMR estarias poniendo a un diamante q gana 9 partidas con un bronce que gano 8 partidas ambos en bronce 1, entonces como ves es ilogico q ambos siquieran esten cerca...\n\nNadie nace \"diamante\", uno se hace buen player jugando MUCHO, pero MUCHO! entonces si pertenecen a esa liga no van a subir, es lo que hay colega, si sos bueno vas a poder explotar la debilidad del otro equipo y ganarla. Pregunta a un diamante si tarda de salir de bronce, NAAAAAAAAAAAAA, en una semana se la suben a oro minimo, hay streamers que te suben a platino inclusive. Es ir creciendo segun tus partidas, y esto es lo que se mantuvo desde que se incluyo el MMR","replies":[]}]},{"poster":"Nerwal","date":"2016-08-27T09:58:27.510+0000","up_votes":1,"down_votes":0,"body":"Yo pense en un metodo que no costaria nada implementarlo. Para sacar una S-, S o S+ hay un sistema que evalua cierto?, evalua farm en base a los minutos, kills, muertes, asistencias, derribo de torres, participacion en drakes, wards utilizados, comprados, etc. \nEl mismo metodo de evaluacion se tendria que evaluar para una persona que va a rankear, antes de que pueda rankear libremente, tendria que ser evaluado (a mi gusto) por 10 partidas y que tenga que dar un porcentaje valido para poder seguir haciendolo. Si no califica en wards, farm, kill etc etc etc. No esta apto para rankear porque perjudicaria la experiencia de los demas. Podrian ser menos partidas 5 quizas, pero a mi gusto deberian ser 10.\nEl dia que se implemente un metodo de evaluacion para las rankeds de esta manera, muchisima gente podria rankear tranquila.","replies":[{"poster":"Kishi","date":"2016-08-27T14:22:22.501+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nerwal,realm=LAS,application-id=v7qsfXsE,discussion-id=wEppLsf5,comment-id=0000,timestamp=2016-08-27T09:58:27.510+0000)\n\n> El dia que se implemente un metodo de evaluacion para las rankeds de esta manera, muchisima gente podria rankear tranquila.\n\nDudo mucho de esto, osea, mas por lo de tranquilo, ya que siempre va a haber gente flamer, afk o nenes que no ganaron linea y trolean, no es solo habilidad (a pesar de lo que mencionaste de las 10 partidas igualmente pierda linea) realmente no me convence nada esto tu solucion, la misma tiene un fallo y es que en pvp no van a ganar siempre, y lo mas probable es que la gente igualmente fedee y por consigo venga actitudes antideportivas..","replies":[{"poster":"Nerwal","date":"2016-08-27T22:04:09.370+0000","up_votes":1,"down_votes":0,"body":"Yo prefiero un afk, un flamer, un troll que podes llegar a encontrarte con gente que no lo mate al troll que lo ignore, que a veces se aburren de trollear y se van, o que simplemente de aburridos que estan vuelven a intentar jugar bien y tratar de carrear a uno de esos, que una persona que te lleva un garen a una ranked y sale sin comprar va bot le hablan todos y dice que no sabe jugar. Me cruce con mucha gente asi, lvl alto y lvl bajo.","replies":[{"poster":"Zoliza","date":"2016-08-28T02:37:31.112+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nerwal,realm=LAS,application-id=v7qsfXsE,discussion-id=wEppLsf5,comment-id=000000000000,timestamp=2016-08-27T22:04:09.370+0000)\n>\n> Yo prefiero un afk, un flamer, un troll que podes llegar a encontrarte con gente que no lo mate al troll que lo ignore, que a veces se aburren de trollear y se van, o que simplemente de aburridos que estan vuelven a intentar jugar bien y tratar de carrear a uno de esos, que una persona que te lleva un garen a una ranked y sale sin comprar va bot le hablan todos y dice que no sabe jugar. Me cruce con mucha gente asi, lvl alto y lvl bajo.\n\nMe imagino en que elo jugaras.... En 4 temporadas nunca me cruce alguien asi. Salvo alguien que intencionalmente quisiera perder para dejar la cuenta en elo bajo y subirla desde ahi.","replies":[{"poster":"Nerwal","date":"2016-08-28T03:22:01.667+0000","up_votes":1,"down_votes":0,"body":"Haz de ser plata o oro, solo esas ligas son de presumir de \"elo\" cuando no hay diferencia con bronce.\nPor si lo notaste, es una cuenta lvl 5, pero estas cegado en tu egocentrismo de haber salido de bronce, sinceramente no tengo ganas de seguir debatiendo con un mente cerrada sory.","replies":[{"poster":"Zoliza","date":"2016-08-28T03:39:38.270+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nerwal,realm=LAS,application-id=v7qsfXsE,discussion-id=wEppLsf5,comment-id=00000000000000000000,timestamp=2016-08-28T03:22:01.667+0000)\n>\n> Haz de ser plata o oro, solo esas ligas son de presumir de &quot;elo&quot; cuando no hay diferencia con bronce.\n> Por si lo notaste, es una cuenta lvl 5, pero estas cegado en tu egocentrismo de haber salido de bronce, sinceramente no tengo ganas de seguir debatiendo con un mente cerrada sory.\n\nLo primero que vi es tu nivel, porque la gente acostumbra a esconderse detras de cuentas lvl 1 en vez de dar la cara con su main. Yo por lo menos te hablo y respondo desde mi cuenta smurf. \nNo soy egocentrico y estoy en elo bajo con esta cuenta, oro 1 con 86% de winrate en promo a platino (algunos lo llaman mid elo, diganle como quieran me da igual) y te aseguro que hay diferencia con bronce. Jugue desde bronce 5 en mis inicios hasta platino 1 casi D5 y conozco la jugabilidad de todas las ligas. Los que dicen que no hay diferencia son los bronces. No discutis con una mente cerrada , discutis con alguien que tiene mucha experiencia en el juego, piensa y no le das ningun argumento coherente \"sory\" :)","replies":[{"poster":"Nerwal","date":"2016-08-28T04:10:30.975+0000","up_votes":1,"down_votes":0,"body":"Esconderme?. Tenes mucha experiencia de juego y seguis en una liga que hablando de elo es como decir clase media baja?. Diferencia?, que diferencia?, si ves a los supps y jgs sin cambiar los wards a lente reveladores, que diferencia?, si te tocan adcs que no saben farmear, que diferencias?, si no saben cuando pushear, frezear una linea, que diferencia?, si hacen baron el equipo contrario, siguen haciendo lo de ir uno solo a investigar el cadaver del nashor y lo agarran los 5 mueren, que diferencia?, si los adcs siguen haciendo 1 vs 2 cuando el supp va a wardear, que diferencia me decis?. Lindemann Alan fue mi cuenta, baneada, desde ese momento nunca mas habia jugado solo me dedique a mirar videos de lol, LCS, cosas asi, el juego aburrio hace mucho y veo por lo que escribis, en el tiempo que habia dejado de jugar, que no cambio nada, los platas y oros se siguen creyendo superiores. Ah por cierto, fijate ya tanto que hablas de diferencia, en el historial, para la fecha de evento de mascaras, hay una partida que me invitaron diamantes, se cagaban de risa decian el lvl 17 la carrea, jajaaj lo sacamos?, no dale mandala asi. Fijate en el historial, decime quien carreo a los diamantes :)\nNo hay diferencia amigacho, estas pintando la chapita de amarillo nada mas, recien en D2 aparece el elo, ni en D5, D4, D3 hay elo, perdoname por romperte las iluciones :)\nSino agregame demostra tu habilidad de oro ya que decis que sos tan diferente a las demas ligas.","replies":[{"poster":"Zoliza","date":"2016-08-28T06:08:40.617+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nerwal,realm=LAS,application-id=v7qsfXsE,discussion-id=wEppLsf5,comment-id=0000000000000000000000000000,timestamp=2016-08-28T04:10:30.975+0000)\n>\n> Esconderme?. Tenes mucha experiencia de juego y seguis en una liga que hablando de elo es como decir clase media baja?. Diferencia?, que diferencia?, si ves a los supps y jgs sin cambiar los wards a lente reveladores, que diferencia?, si te tocan adcs que no saben farmear, que diferencias?, si no saben cuando pushear, frezear una linea, que diferencia?, si hacen baron el equipo contrario, siguen haciendo lo de ir uno solo a investigar el cadaver del nashor y lo agarran los 5 mueren, que diferencia?, si los adcs siguen haciendo 1 vs 2 cuando el supp va a wardear, que diferencia me decis?. Lindemann Alan fue mi cuenta, baneada, desde ese momento nunca mas habia jugado solo me dedique a mirar videos de lol, LCS, cosas asi, el juego aburrio hace mucho y veo por lo que escribis, en el tiempo que habia dejado de jugar, que no cambio nada, los platas y oros se siguen creyendo superiores. Ah por cierto, fijate ya tanto que hablas de diferencia, en el historial, para la fecha de evento de mascaras, hay una partida que me invitaron diamantes, se cagaban de risa decian el lvl 17 la carrea, jajaaj lo sacamos?, no dale mandala asi. Fijate en el historial, decime quien carreo a los diamantes :)\n> No hay diferencia amigacho, estas pintando la chapita de amarillo nada mas, recien en D2 aparece el elo, ni en D5, D4, D3 hay elo, perdoname por romperte las iluciones :)\n> Sino agregame demostra tu habilidad de oro ya que decis que sos tan diferente a las demas ligas.\n\nPrimero: \"Veo que el juego no cambio nada\" Y el que fue baneado fue el. \nSegundo: Dije que es mi smurf. \nTercero: Sos agresivo, no me interesa jugar con alguien como vos. Tengo mis amigos los cuales varios llegaron hasta challenger no necesito jugar con alguien como vos y demostrarte nada, yo se como juego, se los errores que cometo y se las cosas que tengo que mejorar.\n\"Veo que los platas y oros se siguen creyendo superiores\" Donde me crei superior a alguien? Donde dije que soy \"High Elo\"? Donde dije que soy Silver o Gold?\nDije que jugue en todas las ligas hasta un elo de platino 1 - D5, la gente lee lo que le conviene. Y entre todos los elos hay diferencias, tu concepto de \"Hay Elo\" es muy pobre que queres que te diga. Cualquier persona puede decirte la diferencia entre todas esas ligas. La gente no tiene farm perfecto ni en diamond, pero un diamond o platino no farmea como un bronce disculpame que te lo diga. No se hace cuanto no jugas pero hace mucho no veo un sup que no cambie el ward por lente hasta en silver. El saber  cuando pushear o freezear lane son cosas que la gente tarda mas en aprender, como casi todo lo que se base en vision de juego porque son cosas que no se aprenden solo jugando 850 partidas con el mismo campeon. Que las nombres y las sepas implementar correctamente son dos cosas distintas. \nPerdon Faker no te habia reconocido.  :)\nNo puedo ver el historial de una cuenta que no existe, no me interesa si ganaste una normal ni sos tan importante. Parece que venis al foro a opinar sobre un juego que \"ya aburrio hace mucho\" que supuestamente no jugas, en el cual fuiste baneado por razones que me imagino pero venis a seguir figurando aca e intentar ser alguien :). Disculpame pero no tengo tal complejo de inferioridad como para seguir discutiendo con vos. \nMi chapita de amarillo me alcanza en cualquiera de mis cuentas para tener lo unico importante en este juego, las recompenzas de final de temporada. Si te hace sentir mejor juego la promo a platino asi tengo una chapa distinta ya que te enerva tanto.\n\nEspero se solucionen tus problemas :)","replies":[{"poster":"Nerwal","date":"2016-08-28T06:46:42.398+0000","up_votes":1,"down_votes":0,"body":"Mucha suerte para el que le interese leer tan largo discurso de un presumido que seguro es oro o plata, anda a presumirle a los demas vamos vamos, como dijiste recien me imagino en que liga estas, vamos vamos muestre la chapita por ahi vaya...","replies":[]}]}]}]}]}]}]}]},{"poster":"Zoliza","date":"2016-08-27T16:04:06.905+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nerwal,realm=LAS,application-id=v7qsfXsE,discussion-id=wEppLsf5,comment-id=0000,timestamp=2016-08-27T09:58:27.510+0000)\n>\n> Yo pense en un metodo que no costaria nada implementarlo. Para sacar una S-, S o S+ hay un sistema que evalua cierto?, evalua farm en base a los minutos, kills, muertes, asistencias, derribo de torres, participacion en drakes, wards utilizados, comprados, etc. \n> El mismo metodo de evaluacion se tendria que evaluar para una persona que va a rankear, antes de que pueda rankear libremente, tendria que ser evaluado (a mi gusto) por 10 partidas y que tenga que dar un porcentaje valido para poder seguir haciendolo. Si no califica en wards, farm, kill etc etc etc. No esta apto para rankear porque perjudicaria la experiencia de los demas. Podrian ser menos partidas 5 quizas, pero a mi gusto deberian ser 10.\n> El dia que se implemente un metodo de evaluacion para las rankeds de esta manera, muchisima gente podria rankear tranquila.\n\nCon tu criterio ningun bronce y el 85% de los silvers no esta apto para rankear.","replies":[{"poster":"Nerwal","date":"2016-08-27T22:01:44.262+0000","up_votes":1,"down_votes":0,"body":"No le veo nada malo a eso. Al contrario, los esmeraria en mejorar para poder calificar a las rankeds y serian mejores jugadores.","replies":[{"poster":"Zoliza","date":"2016-08-28T02:35:29.592+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nerwal,realm=LAS,application-id=v7qsfXsE,discussion-id=wEppLsf5,comment-id=000000010000,timestamp=2016-08-27T22:01:44.262+0000)\n>\n> No le veo nada malo a eso. Al contrario, los esmeraria en mejorar para poder calificar a las rankeds y serian mejores jugadores.\n\nEl querer mejorar depende de uno, yo juego desde la S2 y no rankeo casi. Cuando juego normal, lo hago seriamente siempre y siempre juego para ganar. La actitud de la gente no cambia dependiendo de la cantidad de tiempo que jugas, sino de lo que vos queres en el juego. \nUna cuenta virgen sin elo previo ganando 7/10 queda oro 5 y el maximo ganando las 10 es oro 1.   Yo no creo que alguien que alguna persona quiera quedar en el pozo, es un juego y tiene que poder jugarse de forma competitiva en todos los niveles del juego. Es absurdo lo que planteas. Una persona que gano de suerte en sus primeras partidas o lo carrearon por lo general si saben que no es su nivel y no ganan una dejan de jugar o juegan hasta bajar, el sistema funciona te lo aseguro. Aunque tambien puedo decir que la dinamic Q desvirtuo mucho el juego dado que la habilidad grupal no es la misma que la individual siempre y se nota cuando juegan con su grupo o cuando juegan solos esa diferencia.","replies":[]}]}]}]},{"poster":"Hero Killer","date":"2016-08-27T10:52:39.580+0000","up_votes":1,"down_votes":0,"body":"Simplemente tendrian que cambiar la regla de la cantidad de campeones que se requieren para rankear a que sean la mitad o mas de la mitad de los que hay en el momento , de esa forma evitas cuentas smurf y gente que no entiende bien el juego rankeando , ya que a la mayoria de los unranked si tienen suerte y ganan 2 partidas seguidas los emparejan con oros o platinos y te cagan las partidas","replies":[{"poster":"Zoliza","date":"2016-08-27T16:07:17.091+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SBT Sting,realm=LAS,application-id=v7qsfXsE,discussion-id=wEppLsf5,comment-id=0002,timestamp=2016-08-27T10:52:39.580+0000)\n>\n> Simplemente tendrian que cambiar la regla de la cantidad de campeones que se requieren para rankear a que sean la mitad o mas de la mitad de los que hay en el momento , de esa forma evitas cuentas smurf y gente que no entiende bien el juego rankeando , ya que a la mayoria de los unranked si tienen suerte y ganan 2 partidas seguidas los emparejan con oros o platinos y te cagan las partidas\n\nRiot no esta en contra de las cuentas smurf ademas que estas pidiendole a una cuenta que posea la mitad de los champ  y encima tenga runas y maestrias lo que conlleva a veces hasta mas de un año. Tengo conocidos con 200 normal que llegaron a platino, cantidad de partidas jugadas no es equivalente a nivel. Y los smurf te los cruzas un par de partidas, decime cuantas veces te cruzaste al mismo smurf en dos partidas, nosotros subimos las cuentas de forma escalonada y con un mmr que no es normal en elo bajo por lo poco que perdemos y un jugador normal de esa liga no nos va a cruzar varias veces.","replies":[]},{"poster":"Luminosity","date":"2016-08-27T11:11:05.926+0000","up_votes":1,"down_votes":0,"body":"Comenze a jugar las clasificatorias y es siempre lo mismo, oros y platas mas flamers que la vrga, me faltan 5 a ver como las sigo :v{{sticker:zombie-nunu-bummed}}","replies":[{"poster":"Kishi","date":"2016-08-27T14:26:42.446+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Luminosity,realm=LAS,application-id=v7qsfXsE,discussion-id=wEppLsf5,comment-id=00020000,timestamp=2016-08-27T11:11:05.926+0000)\n>\n> Comenze a jugar las clasificatorias y es siempre lo mismo, oros y platas mas flamers que la vrga, me faltan 5 a ver como las sigo :v{{sticker:zombie-nunu-bummed}}\n\nPan de cada dia amigo, pero no es el objetivo del post. Por cierto te faltaron los bronces! xd","replies":[]}]},{"poster":"Kishi","date":"2016-08-27T14:26:11.739+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SBT Sting,realm=LAS,application-id=v7qsfXsE,discussion-id=wEppLsf5,comment-id=0002,timestamp=2016-08-27T10:52:39.580+0000)\n>\n> Simplemente tendrian que cambiar la regla de la cantidad de campeones que se requieren para rankear a que sean la mitad o mas de la mitad de los que hay en el momento , de esa forma evitas cuentas smurf y gente que no entiende bien el juego rankeando , ya que a la mayoria de los unranked si tienen suerte y ganan 2 partidas seguidas los emparejan con oros o platinos y te cagan las partidas\n\nEse es otro problema por el cual Riot probablemente no haya aumentado la cantidad de bans antes, y es que o te haces runas o compras campeones, de cierta manera es bueno porque la gente puede practicar y todo si eligen las runas, pero si eligen comprar campeones, lo cual sucede mas, solo tendriamos gente igualmente (un poco mas experimentadas) pero sin llegar a un nivel aceptable de ranked.","replies":[]}]},{"poster":"TaitoTikaro","date":"2016-08-27T15:44:50.400+0000","up_votes":1,"down_votes":0,"body":"Hay que hacer lo mismo que se hace en el SMITE que tenes que tener maestria con 15 campeones si mal no recuerdo para rankear y ahi le pones el nivel de maestria que quieras 5, 6, 7","replies":[]},{"poster":"Ryûjin Ronin","date":"2016-08-27T10:37:32.884+0000","up_votes":1,"down_votes":0,"body":"Si asi fuera, bronce/silver estaria lleno de smurfs y seria una mala experiencia para los que si tienen ese nivel de habilidad","replies":[{"poster":"Kishi","date":"2016-08-27T14:23:46.828+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Samurai Warlord,realm=LAS,application-id=v7qsfXsE,discussion-id=wEppLsf5,comment-id=0001,timestamp=2016-08-27T10:37:32.884+0000)\n>\n> Si asi fuera, bronce/silver estaria lleno de smurfs y seria una mala experiencia para los que si tienen ese nivel de habilidad\n\nperdon? de hecho lo esta! y no mencione perfiles porque podrian borrar el post.. y el problema no es tanto los smurfs sino gente que tiene 150 partidas y quedan en plata III sin ninguna experiencia y terminan fedeando increiblemente, ya me paso como 15 veces cuando entro en promo, siempre es la misma historia!","replies":[]}]}]}