{"poster":"Bunshuu","date":"2017-01-20T21:50:28.708+0000","title":"Idea - ¡Rework Visual/Completo de Janna!","subforum":"Creaciones de la comunidad","up_votes":8,"down_votes":6,"body":"Holi holi! {{champion:18}} \n\nNo soy una fan&aacute;tica de los foros en juegos online, pero tuve esta idea en la cabeza despu&eacute;s de leer la nueva historia de Janna (&iexcl;Se encuentra en la p&aacute;gina de Universo!). C&oacute;mo ser&iacute;a, si en un futuro lejano, cuando los campeones que necesitan un rework lo m&aacute;s pronto posible ya est&eacute;n listos para salir, y Janna se vuelva el foco para una actualizaci&oacute;n completa o al menos visual? Y me entraron ganas de compartir lo que anduve pensando! \n\n Desde que le&iacute; la historia, no solamente estaba sumamente satisfecha con la nueva interpretaci&oacute;n de una de mis support preferidas (&iexcl;Justo detr&aacute;s de Lulu y Ivern!) si no que tambi&eacute;n me surgieron un mont&oacute;n de dudas: \n\n* C&oacute;mo se ver&iacute;a un esp&iacute;ritu que sali&oacute; de las plegarias de los marineros al volver a nacer para ayudar a las personas de una ciudad steampunk? \n* Seguir&iacute;a siendo &#039;La Furia de la Tormenta&#039; en la gruta que es ahora Zaun? Qu&eacute; es lo que involucrar&iacute;a vivir como un esp&iacute;ritu del viento en este lugar?\n* Como seria la personalidad de esta nueva Janna? Seria la misma que la de la Janna que naci&oacute; cerca del mar? Se ver&iacute;an iguales siquiera?\n\n\n Con la cabeza que me iba a mil, me puse manos a la obra con un mont&oacute;n de ideas rid&iacute;culas en la cabeza, que terminaron en esta peque&ntilde;a posible interpretaci&oacute;n de esta nueva &#039;Janna&#039;, que dej&oacute; los vientos del oc&eacute;ano para ayudar a la gente de Zaun como hizo antes: Una brisa de esperanza en los tiempos mas dif&iacute;ciles!\n(Tomen en cuenta que no soy una artista/jugadora terriblemente buena! Simplemente pongo lo que anduve masticando en mi cabeza! {{champion:105}} )\nhttp://puu.sh/ttrsr/6186bb28c4.png\n\n* **Pasiva - Viento a Favor:** Si Janna **no a recibido da&ntilde;o en los &uacute;ltimos 10 segundos**, deja un sendero de viento que aumenta la velocidad de los campeones aliados que siguen el sendero un 5% (Aumenta hasta un m&aacute;ximo de 20% a nivel 18)\n* **Q - Vendaval Aullante:** Janna genera un torbellino que inflige 60/75/85/110/125/135(+35% AP) de Da&ntilde;o M&aacute;gico a los enemigos que est&eacute;n su camino y reduce su velocidad de movimiento un 8/12/17/22/28% por 3 segundos.\n\n  El torbellino puede cargarse hasta un m&aacute;ximo de 3 segundos. Cada segundo de carga hace que el torbellino inflija 15/20/25/30/35(+10% AP) de Da&ntilde;o M&aacute;gico adicional y extiende su rango hasta un 35%. Si el torbellino se carga por al menos 2 segundos, los enemigos son lanzados por los aires por 1.5 segundos en vez de ser ralentizados.\n* **W - Cefiro: ** Janna canaliza las fuerzas del viento por 3 segundos, tomando la forma de un ave et&eacute;rea y ganando un aumento de velocidad de movimiento del 20/25/30/35/40%\n\n Mientras esta en forma de Cefiro, Janna no puede usar ninguna habilidad. A cambio, mientras Janna no haga giros bruscos (Ej: Darse la vuelta) ganar&aacute; cargas de **Brisa ** que le dan velocidad de movimiento extra hasta un m&aacute;ximo de 15/20/25% a las 10 cargas. Los giros bruscos har&aacute;n que Janna** pierda **cargas de **Brisa**.\n\n A las 10 cargas de Brisa, hacer un** giro brusco** provocara que se pierdan 5 cargas de Brisa para generar una onda de viento **en la direcci&oacute;n contraria en la que Janna giro**, lo que inflige 125/170/200/220/280(+55% AP) a los campeones enemigos impactados.\n\n (Usar ataques b&aacute;sicos o activar esta habilidad de vuelta vuelve a Janna a su forma humana.)\n* ** E - Bendicion del Viento: ** Otorga un escudo a un campeon aliado que lo escuda por 65/115/160/190/225(+50% AP)  y concede da&ntilde;o de ataque igual ** al 25% del AP total de Janna**.\n\n* **R - Monz&oacute;n :** &iexcl;La misma funcionalidad que la Janna actual!\n\n**_La idea detras de estas habilidades:_**\n\n La idea que tuve al imaginarme estas habilidades fue mas o menos lo que Riot hace ya con cada actualizaci&oacute;n de los campeones: Mantener la esencia del campe&oacute;n (En este caso, para mi, CC potente ademas de un escudo y movilidad/ralentizaci&oacute;n extra) pero m&aacute;s moderno y en general mas..._ divertido!_\n\n  A mi me encantaron siempre los campeones que hacen mucho roaming, por lo que esta loca nueva W de Janna es lo que transforme para generar ese habito!\n\n En esencia, es parecida a la definitiva de Quinn, en el sentido de que ambas sirven para que el jugador se mueva velozmente a trav&eacute;s del mapa, solo que siendo que Janna es un campe&oacute;n de soporte, me pareci&oacute; divertido poder motivar al jugador a ir a otras l&iacute;neas r&aacute;pidamente a ayudar a esa Taliyah que est&aacute; siendo gankeada por el Xin Zhao que va 12/3, adem&aacute;s de recompensar al jugador por un viaje largo mediante el efecto de &#039;derrape&#039; al tener 10 cargas de Brisa.\n\nEsto sin mencionar que es_ demasiado placentero_ tener una velocidad movimiento** rid&iacute;culamente** alta, que me encantar&iacute;a ver en mas campeones.\n\n\n* **_El dise&ntilde;o del espiritu de Zaun:_**\n\n Esto fue la parte que mas me gusto de imaginarme a esta nueva Janna! Pens&eacute; en un principio en que es lo que cambiar&iacute;a de la Janna que ayudaba a los marineros de Valoran a la Janna que recorre el acantilado de Zaun? \n\n Lo primero que me vino a la cabeza fue su apariencia (Que derivo en la nueva W). Siendo que Janna puede convertirse en un peque&ntilde;o p&aacute;jaro azul, por que no ir por la ruta imaginativa y ver como eso afectar&iacute;a su forma humana? Por lo que eso se manifest&oacute; en que esta Janna muestre un vestigio de su forma como ave en las peque&ntilde;as plumas y sus manos que asemejan a las garras de un ave.\n\n &iquest;Que mas cambiaria? Obviamente, Janna no usa ropa muy pesada o complicada que podr&iacute;a molestarla en sus viajes a trav&eacute;s del cielo. Por lo que intente darle una apariencia mas moderna (y menos de.. Bikini?) con un pelo mas corto y ropa que se ajusta al cuerpo. Sin embargo, a quien no le agrada destacar? Janna usa telas largas y semi-transparentes adornadas con peque&ntilde;as piezas de metal que encuentra en los santuarios dedicados a ella (&iexcl;Hay muchos a trav&eacute;s de todo Zaun!) que forman una estela celeste y tintineante detr&aacute;s de ella cuando toma vuelo.\n\n Eso determinaba su vestimenta, pero quedaba algo m&aacute;s. &iquest;Como se comportaria? &iquest;Cual seria su personalidad? Janna siempre me pareci&oacute; una chica agradable la cual su humor cambia tan r&aacute;pido como una brisa se vuelve una tormenta, pero con una bondad tremenda al estar viva _literalmente_ por las plegarias y la esperanza de la gente de Zaun.\n Siendo que esta Janna fue &#039;renacida&#039;, por as&iacute; decirlo, con la cat&aacute;strofe que separo Zaun y Piltover, adem&aacute;s de ser la personificaci&oacute;n del viento, me parecio lo mas apropiado darle una apariencia mas acorde a la de una chica joven de Zaun (mas o menos de la edad de Ekko o Taliyah, en apariencia.) que, adem&aacute;s de ser amigable y a darlo todo por los dem&aacute;s, tambi&eacute;n disfruta de hacerle jodas a sus aliados y es algo inmadura o vol&aacute;til, como el viento mismo!\n\n Todo se combina en lo que me imagine como la Janna, La Esperanza de Zaun, una chica bondadosa que disfruta de largas caminatas por el cielo, robar comida de los puestos de Piltover y &#039;&#039;wardear&#039;&#039; siendo un &#039;&#039;support&#039;&#039;.\n\nhttp://i.imgur.com/vxrW6uM.png\n\n\n_Eso seria basicamente todo! Creo que me emocione demasiado escribiendo, pero sientanse libres de tirar sus propias ideas o contribuir con lo que quieran! Despues de todo, esto es mas que nada algo que imagine para entretenerme a mi misma. Turururu! {{summoner:31}} _","replies":[{"poster":"resnov15","date":"2017-01-20T21:53:38.784+0000","up_votes":3,"down_votes":1,"body":"Me recuerda al dibujito de la robot adolescente esa","replies":[{"poster":"Bunshuu","date":"2017-01-20T22:06:59.315+0000","up_votes":5,"down_votes":0,"body":"Aqui vemos a Janna y el Yasuo enemigo maestria 7 que va 1/12/1\nhttp://puu.sh/tttbk/b5d6e8a851.jpg","replies":[]}]},{"poster":"Dildo de Moria","date":"2017-01-20T21:51:06.400+0000","up_votes":3,"down_votes":0,"body":"No leí nada pero por favorrr! Ella lo pide y ella lo necesita!","replies":[]},{"poster":"GiGadeliC","date":"2017-01-21T03:13:43.905+0000","up_votes":2,"down_votes":0,"body":"janno montano {{sticker:slayer-pantheon-rainbows}}","replies":[]},{"poster":"Akali FemiNinja","date":"2017-07-14T07:01:47.911+0000","up_votes":1,"down_votes":0,"body":"+1000 maquinola.\nEn serio, Janna necesita un rework, al menos visual, para hacerla menos puta (aceptémoslo, es una ramera ahora, más con el taunt ese que tiene). \n\nEl arte nuevo me gusta, pero creo que la idea de adolescente no encaja con su lore nuevo (quizás con apariencia de niña, dejando en claro su naturaleza caprichosa, pero con una voz más grave y madura) es una deidad, después de todo... Apoyo la moción de menos bubis, pero creo que debería mantener los pies descalzos, y el pelo largo, quizas con un aire más etéreo.\n\nLo único que no me convence nada de ese rework es el nerfeo terrible que le estarías metiendo a la Q, porque habría que cargarla mucho para que levante, y aunque sea súper emocionante levantar cuatro personas con un tornado de 3 segundos, no sirve de mucho, a menos que tengas un yasuo en el team. \n\nAl principio no me convencía mucho la W (me encanta cómo se ve el Céfiro dando vueltitas)  pero cuando explicaste cómo iba a ser más abajo, me enamoré de la idea. Igual, creo que le cambiaría algunas cosas, por ejemplo, que sea una pasiva, que te de velocidad de movimiento, y que mientras más te muevas sin dar vueltas bruscas más cargas y velocidad te dé, y cuando llegás a cierto cap te transformás en Céfiro y ya no perdés cargas con los giros bruscos, y la onda esa sería la activa, y que mientras esté en forma de Céfiro no pueda pegar básicos, pero sí usar habilidades (tirar la W la vuelve a su forma \"humana\"). \n\nEl escalado de ap plano en el escudo... me da una sensación intensa de amorodio. Me gusta, porque a Janna le armo bastante ap, pero no me gusta tanto, porque dicho ap se lo armo de tercer o cuarto ítem recién. Quizás ageregando que escale con velocidad de movimiento? Sería genial llegar a mid como Céfiro a 180km/h y meter un escudo de 1600.\n\nLa pasiva... no sé, la actual es exactamente lo que da la línea de la moneda antigua, y la que vos presentás es un calco de la poción de hierro... Debería tener una pasiva característica, que represente su afinidad con el viento, pero que no se base sólo en hacer que los aliados se muevan más rápido (eso no es emocionante, incluso aunque sea útil). No se me ocurre nada original, la verdad... quizás algo más interactivo, como que tus _habilidades_ dejen una estela de velocidad (el tornado está claro, el nuevo céfiro dejaría un camino como la ulti de kled, menos potente y ancha, la E dejaría la misma estela pero debajo del que tenga el escudo, y que la ulti mejore el movimiento de todos los aliados encima de ella, y llendo hacia ella, en un rango, claro).\n\nY por último, cambiaría el taunt, que diga \"No, no es cierto, yo ya no hago eso... (pausa de dos segundos)   por tan poco...\"\n{{champion:40}}","replies":[]},{"poster":"MCJC23","date":"2017-02-09T05:38:11.804+0000","up_votes":1,"down_votes":0,"body":"Ya comente mucho acá,y quizás me estoy dejando llevar,pero...\nPodria usar este concepto en una historia,un spin-off.\npls{{sticker:zombie-nunu-tears}}","replies":[]},{"poster":"MCJC23","date":"2017-02-09T04:39:43.118+0000","up_votes":1,"down_votes":0,"body":"Encanto la idea.Si rito  algún día le hace un rework a janna,espero que se parezca a esto.\nTe ganaste una porogalleta {{item:2052}} \n{{sticker:slayer-pantheon-thumbs}} \n(PD:Tal vez sea porque tengo 16 como {{champion:245}},o porque me gusta {{champion:163}}.Pero me encanto la idea de \"darle una apariencia mas acorde a la de una chica joven de Zaun \")","replies":[{"poster":"MCJC23","date":"2017-02-09T04:44:02.776+0000","up_votes":1,"down_votes":0,"body":"Olvide decir,lindos dibujos {{sticker:slayer-pantheon-popcorn}}","replies":[]}]}]}