{"poster":"Stillname","date":"2015-11-19T21:00:16.154+0000","title":"\"New game\" new meta.","subforum":"Gameplay","up_votes":38,"down_votes":8,"body":"Why is the duo lane still bottom? There have been some pretty big changes this pre-season and I am starting to wonder if the old meta still comes out ahead.\r\n\r\nWhy isn&#039;t the duo lane going mid now? The advantages are pretty big. The biggest advantage being that with the duo mid you have easy access to both dragon **AND the new rift Herald**. If your duo has any advantage mid (or if the other team is doing solo mid) you can push out the mid lane and go 3 man Rift Herald easily with jungler (or 4 man with top) before the other team has a chance to respond. Then you use baron empowered minions in the midlane to take the tower, and since the new game is very snowbally you can quickly move your &quot;mid duo&quot; top or bottom to take another tower and win the game. This advantage will be even bigger once the winnions change hits in 5.23\r\n\r\nThe only disadvantage that I see for doing this is that your &quot;mid-laner&quot; suffers because he is easier to gank bottom and no longer has easy access to blue. But there are a lot of current mid-laners who have safe wave-clear and decent escape, and there is opportunity to &quot;cross-map&quot; now.\r\n\r\nWhether or not this strategy actually is better then the current strategy of sending the duo bot it still brings up a big question. What would it take to change 5 years of players running the same meta with small changes to what champions go to which spots? Is there even a set of in-game changes that will alter lane assignments?","replies":[{"poster":"GetMariahCarried","date":"2015-11-19T22:20:39.047+0000","up_votes":31,"down_votes":2,"body":"Sorry, the only people who OFFICIALLY get to decide the meta are people in LCS matches. Until something new happens there, no one will consider SOMETHING NEW as a legitimate way of playing League. Any playstyle that requires actual thought is automatically shunned if it doesn't conform to what League players unquestioningly rely on from ancient League meta history.\n\nWelcome to mobas.","replies":[{"poster":"Transgressor","date":"2015-11-19T23:21:09.755+0000","up_votes":15,"down_votes":0,"body":"This 100% true, and 100% sad, which is 100% fucking sad in itself.\n\nAlso, your name has great comedic value.","replies":[{"poster":"GetMariahCarried","date":"2015-11-19T23:39:17.497+0000","up_votes":7,"down_votes":0,"body":"On a related note: while everyone still brands the non-traditional wukong mid or double glass cannon bot as trolling, 90% of players still don't try to secure the new herald... and don't even seem aware that it's there. Why am I not surprised...","replies":[{"poster":"Transgressor","date":"2015-11-20T00:32:47.948+0000","up_votes":5,"down_votes":0,"body":"The Rift Herald is the least of my issues. Fucking bronzers don't buy any form of Grevious wounds and armor penetration as well as wholeheartedly reject BotrK as trash. Then they fucking complain about tanks being unbalanced and Mundo being OP, because they are the only thing that has counterplay in those cancerous 5-AD comps.","replies":[{"poster":"GetMariahCarried","date":"2015-11-20T00:59:39.455+0000","up_votes":7,"down_votes":0,"body":"\"Bork does 2% less current health damage, waaaah, totally useless now.\" Yeah, that whole whopping 40 less average physical damage against 4k health 300 armor champs. I feel your pain, adc's.\n\nLet's just ignore the fact that we now have a Kog that can proc bork twice as fast as it has ever been procced in League history. And ignore the runaan's that's good on almost EVERY adc now, to get that cross-team bork proc without sacrificing crit at all. Or that new Giant slayer passive that basically brings bork back up to where it was pre-patch against tanks, barring even the last two changes I mentioned.\n\nI now understand why Riot systematically ignores this community. Riot makes one small change, and people flip out (heck, I'm guilty of it too). Riot makes 10 small changes, people ignore 9 of them, tunnel vision one nerf, and declare all hope lost.","replies":[{"poster":"HeadHonchkrow","date":"2015-11-20T06:46:04.069+0000","up_votes":1,"down_votes":0,"body":"...Even though Kog is trash right now.","replies":[{"poster":"GetMariahCarried","date":"2015-11-20T08:08:01.222+0000","up_votes":1,"down_votes":0,"body":"Well, he's not shining at the moment, but even so, when he starts spitting on tanks... ugh.","replies":[{"poster":"HeadHonchkrow","date":"2015-11-20T08:20:25.637+0000","up_votes":2,"down_votes":0,"body":"http://i.imgur.com/zPg4py2.gif\"","replies":[]}]}]}]}]}]}]},{"poster":"Sona Ping","date":"2015-11-20T06:52:12.842+0000","up_votes":2,"down_votes":0,"body":">OFFICIALLY get to decide the meta\n\nSorry but no, that's not what the word \"Meta\" means.  This:\n>Any playstyle that requires actual thought is automatically shunned if it doesn't conform to what League players unquestioningly rely on from ancient League meta history.\n\nIs completely, totally true for the general League playerbase; not saying differently.  And it's a pretty sad reality.  But nobody \"officially\" decides meta, that's not how the concept works.","replies":[{"poster":"GetMariahCarried","date":"2015-11-20T09:28:13.537+0000","up_votes":2,"down_votes":0,"body":"Yeah, I know. I honestly should have more respect for the meta, or at least what it GENUINELY refers to. What meta LEGITIMATELY refers to is ALWAYS a preferable strategy. It has inherently positive connotation. It's like the word \"good\". Saying \"I hate the meta\" is like saying \"I hate good\". What do you MEAN you hate good?\n\nBut I think we agree that most people are overconfident in what IS meta. And once they can tag something with \"meta\", they use that tag as the be all and end all justification for unquestioning support of a playstyle. They rely on the \"it's good because it's meta\" argument, which is like saying \"it's meta because it's meta\" or \"it's good because it's good\". That's not an argument at all. There are REASONS why certain strategies are commonly useful (other than \"let's do it like they do in the LCS\", which is all people think about). If you think about the reasons, you'll realize these strategies aren't the ONLY useful strategies, or the ONLY correct choice in every situation, or somehow inherently effective regardless of player skills, or ALWAYS effective FOREVER in a continuously morphing game, or effective when the reasons for the strategies no longer hold.\n\nA duo sustain/damage botlane is great for early dragon secures, for instance, which is one of many reasons adc and support are preferable there. But who cares if no one is coordinating early dragons? Which happens all the time in random matchmaking. Ultimately, people are more laid back, and heck, maybe not even warding deep river two thirds of the time. And what if the two people you INSIST on going bot, and doing so as support/adc (because \"the meta\") would roflstomp with their favorite fighter champs against a fairly mid-skill-level enemy botlane? What if those two people suck at support and adc, and would quickly lose as such? Where's your drag control or late game now? What if you're team isn't good at peeling? So much for a late game comp when you're \"late game\" champ can't do anything, because a) the player's not great at kiting and b) any attempt at dps is immediately met with death.\n\nPeople can't take a good strategy, strip away every aspect of skill and/or related strategies it's dependent on, and treat it like law anyway. But they do. \"I don't care if you suck and lose the game, as happens for precisely 50% of ALL teams, traditional or not, just as long as you don't suck and lose the game as Xin bot, because then I will give you \\*\\*\\*\\* to no end for that pick the moment you hit 0/1/assists-what-are-those.\"\n\nIf people would start thinking of meta as an adjective instead of a pronoun, we might make some headway in people actually THINKING about why they're doing what they're doing, why OTHER people are doing what they're doing, and not running the guilt-trip gauntlet the moment someone tries a strategy that isn't \"THE\" meta. Here's an (unintentionally) long story to make my point:\n\nI won 9 out of 10 duo placements a couple seasons back using double-heal botlane, synergizing old Soraka's e mana-heal with Sona's heal for infinite sustain. It screwed up a lot of traditional botlaners who didn't counter-strategize to quickly burst-kill a couple of squish with poor escape using some ganks. Strategizing? What's that? Instead, the enemies would always run down mana dishing out the usual everyday botlane pokes, which, in this circumstance, were TERRIBLE choices. We obviously recovered from them quickly and indefinitely.\n\nOccasionally, they'd go for the burst kill, but that was without jungle+mid, or maybe with jungle, but without the right burst synergy, and they'd never count the costs of our unusual summoner spell setups (barriers for ignites, heals for when the ignites wore off, no flash, 'cause the bait was real). If they went in, they'd die before we did with that setup. The thought that, without flash, more frequent mid/jungle combo ganks would be freelo just doesn't occur to a team of people randomly matched with each other. Only the thought of \"they don't have an adc, so we MUST outtrade\" passed their minds, in EVERY GAME. As a result, we roflstomped lane and midgame in every one but two out of those 10 games. And I mean ROFLSTOMPED. No team recovered even slightly in 8 out of those 10 games after we had major kill/objective leads in the lower half of the map. Even if enemy toplaner also roflstomped, we would then, midgame, shut that down too.\n\nWhat happened in chat in the two games we DIDN'T win GLORIOUSLY from minute 1? Well, one of our allies, Lee Sin punches away at a taric in a mid-siege skirmish while a vayne 3 feet away, not even moving, just free-pokes him to death for about 7 seconds. He wouldn't stop basic attacking taric the whole time, or move back, or turn to vayne after the initial stun. Lee was right in front of our tower. If I didn't know better, I would have assumed that was an intentional feed. All he had to do was back up a little and stop \"chasing the singed\", so to speak. Once he inevitably died, he said, \"YOU SEE THAT VAYNE? SHE IS CARRYING THEIR TEAM\" to give us a \"lesson\" in the meaning of \"carry\" and why it was clear the lack of a strict \"ad carry\" bot was the reason ham-spamming taric with a wide-open squish-nuker practically in melee range didn't work out for him (the connections... so strong). The importance of carries would be a nice lesson to consider, if I wasn't busy thinking the honest truth for this particular situation, \"no, Lee, YOU'RE carrying their team.\"\n\nIn one of those two postgames, one of our allies goes, \"guys, don't ever do that again\". Right, sure. If only we went TRADITIONAL carry/support botlane, 'cause then we would have won... like we did every time until my internet crapped out one game. Um, I'm sorry, I thought the point of the \"meta\" was to win. ISN'T that the point? We won overwhelmingly while carrying over and over again. Wait, no, doesn't matter, gotta ignore that fact. If it's not \"THE\" meta, then it's bad, BY DEFINITION, and therefore shouldn't be done. \n\nIf ONLY we had chose to do something \"good\", like, a traditional carry/support botlane that would have lost us 5 out of 10 games, the average, given our skill level. But THAT'S OKAY, because \"THE\" meta choices are \"good\" choices and if that causes us to lose 5 times as often, that's irrelevant, because it's \"good\", and what we successfully did to win is \"bad\".\n\nBarely anyone on any of the teams we were matched with were exceptional, and WE certainly wouldn't have been with our not-so-leet skills in most traditional rolls. It was a bunch of average players, including us. Case in point: no enemy botlaners could seem to get a freakin' clue what was up when they saw a Sona/Raka no-flash barrier/heal botlane until it was too late. Most of them were too busy thinking \"woot, free victory\" telling from chat... and, pretty much not thinking otherwise, apparently. If they hadn't been so stuck up about \"THE\" meta that they understood very little about, except how to pronounce it, they could have easily taught us a lesson in \"meta\" by effectively countering our strategy with easily coordinated jungle/mid ganks to burst through all of our defenses and punish our lack of mobility. But since most players don't actually KNOW what the meta they hold dear means, it's not surprising those teams failed (miserably) at fighting us in their \"freelo\" game against \"troll\" botlaners.","replies":[{"poster":"Sona Ping","date":"2015-11-21T01:16:17.865+0000","up_votes":1,"down_votes":0,"body":"This was a good post.\n\n>> [{quoted}](name=GetMariahCarried,realm=NA,application-id=3ErqAdtq,discussion-id=RvNonZp5,comment-id=000800010000,timestamp=2015-11-20T09:28:13.537+0000)\n>People can't take a good strategy, strip away every aspect of skill and/or related strategies it's dependent on, and treat it like law anyway. But they do. \"I don't care if you suck and lose the game, as happens for precisely 50% of ALL teams, traditional or not, just as long as you don't suck and lose the game as Xin bot, because then I will give you **** to no end for that pick the moment you hit 0/1/assists-what-are-those.\"\n\nQuoted for truth (and for the laugh I got from it).","replies":[]}]}]},{"poster":"MrWasjig","date":"2015-11-20T10:31:37.603+0000","up_votes":1,"down_votes":0,"body":"I don't see what's wrong with sticking to something that works. \n\nI'm not saying trying to innovate is a bad thing, it's just that if you know something works there's a degree of reliability to it.","replies":[{"poster":"GetMariahCarried","date":"2015-11-21T00:22:39.430+0000","up_votes":1,"down_votes":0,"body":"Sticking with something that \"works\" in scenarios where it DOESN'T work, is NOT sticking with something that works, and that's what I claim most players are ACTUALLY doing a lot of the time unwittingly in League (in one of my long-winded sub-responses). A strategy is only as reliable as what it RELIES on, and much what the meta relies on is absent in almost all games where people flip out ABOUT the meta. If you want to know what I mean, you can read that heftier response, although it's probably TLDR material.","replies":[{"poster":"MrWasjig","date":"2015-11-22T13:48:36.104+0000","up_votes":1,"down_votes":0,"body":"I'll pass. The condensed response here made enough sense. \nAgain nothing wrong with something that works, but when you put it like that I can see where you're coming from.","replies":[]}]}]},{"poster":"Lithium Rosa","date":"2015-11-20T18:01:27.537+0000","up_votes":1,"down_votes":0,"body":"yeah but the lcs botlanes are not really going bot..........\nThey do lane swaps all the day.","replies":[{"poster":"GetMariahCarried","date":"2015-11-21T00:24:20.560+0000","up_votes":1,"down_votes":0,"body":"Reason #47 for people to stop freaking out over role calls and lane choices like the world depends on it.","replies":[]}]}]},{"poster":"RogueWill","date":"2015-11-19T21:42:55.332+0000","up_votes":9,"down_votes":0,"body":"Well because it opens a can of worms on why the duo lane is not mid. First of all assuming you send both support and adc mid then the friendly mage/assassin will be forced out of lane as easily as you can force the red mid out of lane. Assuming you get the Herald to push mid, the jungler can go both and do the same and push your bot (unless you have a friendly anivia on the red side of the map so she can access blue the waveclear needed to keep 3 enemies at bay from taking your turret is ridiculous).\nAlso, adc are generally more vulnerable at mid due to the amount of possibilities to pull of a gank since pretty much everyone on the enemy team can do it (top, mid laner, jungler, supprt and adc, pick your poison), not only that take into consideration than to prevent the ganks from happening,  warding takes twice as much effort since you have to cover more spaces with your wards.... is practically impossible for a support to cover that much area early game so unless you have your friendly jungler babysitting you as well you are going to get ganked a lot. The only reason mid can do it is either A. they have a dash or speedbust or B. They have heavy CC to prevent the gank or a combination of both. Poke supports will suffer in this scenario(since they will be the most vulnerable to ganks since they posses the less reliable escapes)  and all in supports will also fall off meta since they won't be able to do anything during the laning phase to get ahead and don't become useless. The only supports that would trill would be disengage supports (such as alistar or janna and maybe lulu) and sustain supports ( such as soraka, the only real sustain support,  and maybe nami; although nami is more of a poke support).\n\nI can see it working on competitive play (were voice communication is a given) as a counter to mid picks with low waveclear similar of how was laning swap worked with top and bot lanes but I see it as such a lane swap, something situational that you are not supposed to do it every game.","replies":[{"poster":"CrushforceX","date":"2015-11-21T00:05:41.670+0000","up_votes":1,"down_votes":0,"body":"Just because anyone can gank, does not mean you are necessarily more susceptible to ganks. Because the lane is shorter, freezing can't really happen, and even if it does, you have a fairly better chance of escaping then if it happened bot. With the new farsight alteration, you can keep both sides warded easily, and pretty much have enough time to walk away unless they are a super mobile jungler, in which case it is still worse then bot lane.","replies":[{"poster":"RogueWill","date":"2015-11-21T09:55:42.395+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CrushforceX,realm=NA,application-id=3ErqAdtq,discussion-id=RvNonZp5,comment-id=00060001,timestamp=2015-11-21T00:05:41.670+0000)\n>\n> Just because anyone can gank, does not mean you are necessarily more susceptible to ganks. Because the lane is shorter, freezing can't really happen, and even if it does, you have a fairly better chance of escaping then if it happened bot. With the new farsight alteration, you can keep both sides warded easily, and pretty much have enough time to walk away unless they are a super mobile jungler, in which case it is still worse then bot lane.\n\nUhm... Don't you need lvl 9 for fair sight alteration? how is level 9 early game? I'm aware that by level 9 vision shouldn't be a problem anymore since you jungler will be carrying a couple of wards himself plus your support carrying another 3 and your adc using fairsight. I mean, the first tier turret should be down by level 9 if you are laning against a mage anyway so that's not the real issue, the real issue are level 3-7 or so. I'm aware that lane is shorter but you will have several more blind spots as well, enemy junglers get behind you from the paths coming from wraiths and blue avoiding river altogether, so the enemy jungler will either burst you or cc you before you have a chance to react, also 4 man ganks are going to be more frequent and easier to pull. \n\nMid laners usually don't need to freeze lane as well (unless you are someone like fizz or zed) they can just wave clear it as fast as you can shove it and/or safe farm from a distance so they won't be as behind as you might think, the only real advantage is taking the mid turret early and get the first herald but as I mention earlier it can be countered by the enemy jungler just get bot and take bot turret. Then assuming you rotate bot, the enemy adc rotates mid and take your first turret as well. \n\nIs a lane swap and not a change of meta","replies":[]}]}]},{"poster":"delonix","date":"2015-11-19T22:42:54.618+0000","up_votes":4,"down_votes":0,"body":"People are just doing what they're used to. Let's say you want to try some new meta stuff, like duo mid. You go into draft mode and explain what you want to do during the bans. Even if you're willing to take support, it means convincing someone that they should try 1v2 bot lane probably and convincing whoever wanted mid/adc that you going mid with them as a support isn't trolling, it's a viable strategy. Even if you do it and it works great, how does that spill over to the rest of League's players?\n\nLike other people have commented in the thread, it will probably take a meta-shift on the competitive level to get people to start playing differently. If the teams in the LCS start doing duo mid or something else that represents a significant shift from the way lane resources are allocated now, people who pay attention to competitive LoL will try bringing into their games, and it might actually catch on. \n\nAlternatively, if Riot feels like people should start exploring different meta strategies, there are a number of things they could do to encourage strategic diversity, from posting about different ways to allocate experience and gold and managing objectives to changing the new queue system to that you can queue for things like \"mid support\" or \"roaming support\" instead of just top/jungle/mid/adc/support/fill.","replies":[]},{"poster":"disregardable","date":"2015-11-19T21:01:15.874+0000","up_votes":5,"down_votes":1,"body":"I just don't think it's really possible to send immobile waveclear mages anywhere that isn't the mid lane. They'll have to overextend and die in the other lanes.","replies":[{"poster":"Mimy","date":"2015-11-19T21:15:20.144+0000","up_votes":4,"down_votes":0,"body":"To do that we'd have to perhaps mix things up a bit.. What if he Support and the imobile midlane went to the same lane?  (OH THE CC) \n\nSend a \n\ntop - ADC \nJungle - Assasians /fighters \nMid - Mage and Support. \nBot - Juggarnauts/tanks\n\nIt's just an example.. im not meaning this would be meta... xD \n\nHey having a support with a Speed boost would help them immobile mages..\n\n(Now ADCs dont have anyone to blame but themselves) ","replies":[{"poster":"disregardable","date":"2015-11-19T21:27:35.783+0000","up_votes":3,"down_votes":0,"body":"No, the ADCs get to blame the enemy jungler for ganking them and tower diving them three times in a row. Believe me, I've played plenty of ADC top. You can't consistently not feed. The ADC needs the support to stave off tower dives until level 8 or so.\n\nI mean there definitely might be something, but I'm gonna wait for the pros to do it. ^^;","replies":[]},{"poster":"Myozthirirn","date":"2015-11-20T04:17:12.640+0000","up_votes":2,"down_votes":0,"body":"Mages scale with EXP way better than (most) Adcs","replies":[]},{"poster":"Asayake 5150glow","date":"2015-11-19T22:44:55.650+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Onastacia,realm=NA,application-id=3ErqAdtq,discussion-id=RvNonZp5,comment-id=00000000,timestamp=2015-11-19T21:15:20.144+0000)\n>\n> To do that we'd have to perhaps mix things up a bit.. What if he Support and the imobile midlane went to the same lane?  (OH THE CC) \n> \n> Send a \n> \n> top - ADC \n> Jungle - Assasians /fighters \n> Mid - Mage and Support. \n> Bot - Juggarnauts/tanks\n> \n> It's just an example.. im not meaning this would be meta... xD \n> \n> Hey having a support with a Speed boost would help them immobile mages..\n> \n> (Now ADCs dont have anyone to blame but themselves)\n\nInstead, I think we should get a Cait or Trist and have them solo bot (all they do is farm anyways), putting the bruiser mid since most bruisers do pretty well in lane, they should be able to hold against a mid-laner, with the mid and supp in top (more space to catch enemies out).","replies":[{"poster":"SpinnerMask","date":"2015-11-20T18:05:38.755+0000","up_votes":1,"down_votes":0,"body":"but then you  give up drag control. The reason duo mid would work is cause the duo lane is still near dragon.","replies":[{"poster":"Asayake 5150glow","date":"2015-11-20T19:59:16.531+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Spinnerlink,realm=NA,application-id=3ErqAdtq,discussion-id=RvNonZp5,comment-id=0000000000010000,timestamp=2015-11-20T18:05:38.755+0000)\n>\n> but then you  give up drag control. The reason duo mid would work is cause the duo lane is still near dragon.\n\nBut it grants additional Rift Herald control, and the mid/jungler/bot could still take drag.","replies":[]}]}]}]}]},{"poster":"IcyPepper","date":"2015-11-19T21:42:43.052+0000","up_votes":3,"down_votes":0,"body":"I dunno, you're kind of saying that the support and ADC *have* to lane together.\n\nI figured you'd be the guy to figure out that some ADC's can solo lane (Graves, for instance) and some mages are more item dependent than level dependent (I believe Azir may be one? He can certainly zone and take towers). \n\n>The only disadvantage that I see for doing this is that your \"mid-laner\" suffers because he is easier to gank bottom and no longer has easy access to blue. But there are a lot of current mid-laners who have safe wave-clear and decent escape, and there is opportunity to \"cross-map\" now.\n\nWhy not just send the support midlane and have a solo lane ADC bot lane? Obviously you wouldn't send Kog'Maw alone, but someone like Graves or Caitlyn might be able to handle it. \n\nOr you can mix it up in other ways. A mage bot lane, the ADC top lane, and a bruiser+support midlane. The possibilities are endless if you consider ADC and support two separate roles rather than one singular unit.","replies":[{"poster":"Stillname","date":"2015-11-20T04:36:07.571+0000","up_votes":1,"down_votes":0,"body":"Traditionally the reason the ADC is with the support is because of the split experience. Mages, assassins, and tanks all do better then ADCs do with more levels. The other benefit is that the ADC gets someone to babysit them in lane but yeah some do pretty well in a lane of their own. Who knows though a lot changed so I think it would be worth it to try out different strats but getting randoms to go along with it is difficult... or impossible. Which is why the meta is so tough to change.","replies":[{"poster":"IcyPepper","date":"2015-11-20T04:46:34.138+0000","up_votes":2,"down_votes":0,"body":"I know, I acknowledged it:\n\n>I figured you'd be the guy to figure out that some ADC's can solo lane (Graves, for instance) and some mages are more item dependent than level dependent (I believe Azir may be one? He can certainly zone and take towers. He's also more vulnerable without his knockup nowadays).\n\nAnd yeah, the meta is hard to change... but on the bright side, some ADC's seem more able to solo lane than ever (Graves, Caitlyn, Vayne, Quinn). An assassin wouldn't really want to duo lane, but I can see some bruisers and mages who'd be willing (Orianna, Lulu, Lux, Morg, basically any utility mage ever, and bruisers like Susan, Pantheon, and maybe even Yasuo who is not a bruiser but very much item-dependent rather than level-dependent).\n\nI'd love to experiment, but I don't really have friends who are like-minded in that regard.","replies":[{"poster":"Partholonian","date":"2015-11-20T23:51:15.953+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=tombdragon,realm=NA,application-id=3ErqAdtq,discussion-id=RvNonZp5,comment-id=000500000000,timestamp=2015-11-20T04:46:34.138+0000)\n>\n> some ADC's seem more able to solo lane than ever (Graves, Caitlyn, Vayne, Quinn). \n\nWell, they can solo lane in the sense of going against another solo laner, like top.  Or if the enemy laneswaps, they can stay bot solo.  \n\nBut if you're an early adopter of the mage+support mid meta, then you're probably sending your marksman into a *1v2* lane.  (It can't become the new meta if it can't beat the old meta when they go head to head.)\n\nSo your marksman is probably up against another marksman *and* a Thresh or whatever.  I don't see how they're going to get out of that alive, let alone with decent farm.","replies":[{"poster":"IcyPepper","date":"2015-11-21T00:23:37.514+0000","up_votes":1,"down_votes":0,"body":"Severely depends on the match-ups (plural, mind you!), if you ask me.\n\nLike, sending Kog'Maw against Graves+Thresh is a suicide mission.\n\nI think Caitlyn and Graves could manage it, since Graves gets burstier with level and he can get innately tanky, and Caitlyn's mobility, zoning, and I believe her aa extendors (I really don't know what to call her new mechanics) can handle it.\n\nBut, that's only one side of the coin. If I, or whoever else, decided to adopt duo mid, it would require putting the pressure on those neutral objectives and the enemy laning opponent(s). Sure, your bot is now 1v2, but *so is the enemy's midlane.* I mean, if you go duo mid for the sake of duo mid and do nothing with it, you're not accomplishing anything except for that pointless 1v2 bot lane. \n\nI think it's worth a shot. One way to see if it's starting to work is if the enemy support heads mid or bot and mid lane swap. That's an indicator of pressure. I've seen 1v2 lanes handle just fine, either through double jungling or your standard lane swapping. It's not impossible, but it's probably going to be hard to get people to cooperate at first (and forcing them wouldn't be okay either!).","replies":[]}]}]}]}]},{"poster":"iainB85","date":"2015-11-20T17:26:16.602+0000","up_votes":2,"down_votes":0,"body":"I think duo mid would be pretty bad. You are putting one of your (theoretically) hardest to gank lanes in the shortest, safest lane on the map. Not to mention, it would be so easy to collapse on a mage type character solo bot.\n\nI see a lot more advantage to swapping bot and top lanes (as is sometimes done in LCS), as Rift Herald offers much more immediate benefit than dragon, and games snowball out of control before 5th dragon is even obtainable 90% of the time now.","replies":[{"poster":"Stillname","date":"2015-11-20T17:40:23.749+0000","up_votes":1,"down_votes":0,"body":"Yeah putting the mid bot really makes life miserable for them. It makes them open to ganks and away from all the action. Basically it gives them the two things bot lane and top lane were complaining about over the last year then combines it all into one.\n\nI am wondering if despite this it still makes sense to do the mid-bot swap BUT a bot top swap also makes a lot of sense. Especially with the dragon being less valuable like you mentioned. Will be curious to see if anything ends up changing this season.","replies":[]}]},{"poster":"gg git diff","date":"2015-11-20T01:38:02.507+0000","up_votes":1,"down_votes":0,"body":"Mid lane has the most roam potential of all lanes, and the ADC generally isn’t the person you want to have roaming early.","replies":[{"poster":"Stillname","date":"2015-11-20T04:21:55.599+0000","up_votes":2,"down_votes":0,"body":"However, a lot of the champions that go support Annie, Thresh, Leona, etc. Are very good at roaming and it's hard to punish them for roaming since the adc can stay and waveclear till they comeback.","replies":[{"poster":"Partholonian","date":"2015-11-20T23:53:09.376+0000","up_votes":1,"down_votes":0,"body":"That's a good argument for supports to roam more, but they don't have to be permanently mid to do that.  Even roaming to Herald could be done by backing first and then showing up at Herald instead of at bot lane.  Or you could roam up the river to mid, force the enemy mid to b, and then accompany your own mid to Herald.  (Your adc will probably have to concede some farm during that long a roam, but we're assuming Herald is worth it, right?)","replies":[]}]}]},{"poster":"qetzel","date":"2015-11-19T21:42:44.314+0000","up_votes":1,"down_votes":0,"body":"Have you considered that at the higher levels of play the duo lane could still get only one of the two objectives? If they move to the Rift Herald the opposing duo lane will be ready to take the Dragon, for example. Given the damage reduction on ranged AAs and the loss of the important shorter mid lane for other champions it probably isn't worth it.\n\nThat and people are quite stubborn...","replies":[{"poster":"BluePolarizer","date":"2015-11-20T01:37:58.509+0000","up_votes":2,"down_votes":0,"body":"Dragon is essentially irrelevant compared to the global gold and map control of turrets.","replies":[]},{"poster":"Transgressor","date":"2015-11-19T23:22:04.327+0000","up_votes":1,"down_votes":0,"body":"Which means giving away the first or second dragon for 2 or maybe 3 top turrets.\n\nI'll take it.","replies":[{"poster":"Sevixys","date":"2015-11-20T16:22:57.960+0000","up_votes":1,"down_votes":0,"body":"I'd trade 2 dragons for 3 top turrets any day any time.","replies":[{"poster":"Transgressor","date":"2015-11-20T16:52:39.726+0000","up_votes":1,"down_votes":0,"body":"So, lategame stats over global gold and map control?\n\nHah, whatever works for you I guess.","replies":[{"poster":"Sevixys","date":"2015-11-20T19:22:28.695+0000","up_votes":1,"down_votes":0,"body":"I think you understood me wrong. I should've said: 3 top turrets>2 drakes, pushing wins games and turrets don't regen. :)","replies":[{"poster":"Transgressor","date":"2015-11-20T19:43:11.395+0000","up_votes":1,"down_votes":0,"body":"Oops","replies":[]}]}]}]}]}]},{"poster":"Dukues","date":"2015-11-19T21:40:21.898+0000","up_votes":2,"down_votes":0,"body":"I feel like with the dynamic groups and the preseason changes  might change things up a bit in some ranked games.I told my buddies that we're trying some weird shit this season if there is 3-4 of us willing to do it.","replies":[]},{"poster":"Dukues","date":"2015-11-19T21:38:10.340+0000","up_votes":2,"down_votes":0,"body":"Me and my buddy been running TF & Anivia bot lane. Support with mage, double hard cc. Has worked pretty well so far. But that is also when you already have 3 ad assasins on your team.... don't really necessarily want an adc as well.\n\nAlthough at the end of the season I did have a vayne who wanted to mid. And we said f it ok  and we went Annie blitz bot.Worked out well.","replies":[]},{"poster":"Axests","date":"2015-11-19T21:31:19.732+0000","up_votes":2,"down_votes":0,"body":"most likely we'll have to wait until another big meta shift happens before we see anything like that. After all the laning meta hasn't changed much in a few years (outside of the pro scene that is).","replies":[]},{"poster":"FluxBound","date":"2015-11-20T23:56:32.332+0000","up_votes":1,"down_votes":0,"body":"Usually, player distribution is the most resilient part of the meta. If the lanes are uneven, this is usually really bad. When a team plays a duo top and the supp goes with the bruiser, the adc is left alone bot. In the top lane, the solo top laner will most likely have more aoe, tankiness and cc to defend against the waves pushing on them. On the other hand, the lone adc is gonna be against a good lane pusher and support, while they will probably have subpar or expensive waveclear. Another thing with uneven games is exp difference. The solo laner will be much stronger than the duo, but the adc can't do too much with that size of an advantage yet, but the top laner can probably 2v1. Once there's a 2v1 for a few minutes, you can't change back. That makes everything worse. So games with different lane positions often end horribly so the meta can't change without everyone doing the same line up","replies":[]}]}