{"poster":"Stillname","date":"2016-10-30T14:32:47.094+0000","title":"Barrier vs Heal","subforum":"Gameplay","up_votes":2,"down_votes":1,"body":"Before early season 4 all of the ADC&#039;s used to take Barrier over Heal in the botlane because it simply provided more protection then Heal did because Heal was a group aoe heal for the whole team that was pretty low.\r\n\r\nThen Heal got its rework to be only 2 target and it has pretty much been Heal ever since with the exception of a few midlaners taking Barrier from time to time.\r\n\r\nHowever, I think the assassin rework is the perfect opportunity to give Barrier its niche over Heal because assassins already have to be re-balanced for the new items so what is one more small change?\r\n\r\nBarrier should be changed to give a damage reduction buff for 1-2 seconds in addition to its shielding so that players have the opportunity to choose between heal and barrier depending on the enemy team comp. This could be done by giving bonus armor and mr per level or just a flat percent bonus reduction.\r\n\r\nThe larger benefit would be that midlaners would have on option to take against assassins in the midlane to make lanning against an assassin feel like there is more counter-play besides &quot;push them out of lane early.&quot;\r\n\r\nThe disadvantage to all of this being that assassins have a harder time creating windows of opportunity to kill a target with flash being an option and barrier shutting down their all in but numbers can be tweaked to make it balanced.\r\n\r\nWhat are your thoughts? Does this just push Barrier to be better than Heal in every situation?","replies":[{"poster":"Stick In Mudd","date":"2016-10-30T14:48:23.989+0000","up_votes":1,"down_votes":0,"body":"I do like the idea of changing barrier to be about 'damage reduction'. It would certainly be considered when someone goes tank jungle or top, over teleport or flash/ghost. \n\nBut perhaps a shield AND damage reduction would be too much. Perhaps just damage reduction, but then you may as well create a new summoner spell and keep barrier intact. \n\nI kind of wish they would buff the other sum. Spells like cleanse; giving them a bit of an edge towards certain comps. The problem I see, would be giving players too much counterplay. Have you ever been counterpicked in lane? Yeah, it sucks bad. Now double that horrible experience; that's what it would be like to have to pick first. Then the team counterpicks, and then counter summoner's you, making it so much harder to do anything.","replies":[{"poster":"Stillname","date":"2016-10-30T14:52:21.357+0000","up_votes":2,"down_votes":0,"body":"Agreed, there is a reason cleanse doesn't get rid of suppress I think and that is because it would almost completely negate champions that rely on the suppress in their ultimate for their kit to function. At a certain point summoner spells can become too much and this barrier change might just give too much power against assassins trying to find gaps in their opponents play to 100-0 them.","replies":[]}]},{"poster":"Emerald Fang","date":"2016-10-30T14:51:20.411+0000","up_votes":1,"down_votes":0,"body":"How about give shield equal to 10 - 20% max HP, and 30% straight damage reduction for 2 seconds.","replies":[{"poster":"Stillname","date":"2016-10-30T14:56:12.781+0000","up_votes":1,"down_votes":0,"body":"I have no idea what the numbers where this would feel like a good addition to the game would be without being able to playtest it. My gut says 30% is a little high but it could be a little low or just the right amount. Not quite sure.","replies":[{"poster":"Mig89","date":"2016-10-30T14:57:52.713+0000","up_votes":1,"down_votes":0,"body":"If barrier was a 20%hp shield and 30% damage reduction for two seconds it is still outclassed by exhaust.","replies":[{"poster":"Stillname","date":"2016-10-30T15:05:09.573+0000","up_votes":1,"down_votes":0,"body":"exhaust has the disadvantage that you have to apply it to your opponent. Zed, for example, can get his q and an aa off pretty easily immediately after his ulti before most players can react and put exhaust on.\n\nIt also can be used at ranges where you cannot put exhaust on like Jhin ulting or lux burst.\n\nI think exhaust should have better numbers because Barrier will have these advantages over it in gameplay.","replies":[]}]}]}]},{"poster":"oSEXYPLATYPUSo","date":"2016-10-30T14:36:35.089+0000","up_votes":1,"down_votes":0,"body":"well barrier blocks grievous wounds so if your champ has lifesteal or some kind of regen it stops and blocks healing reduction already so thing like {{summoner:14}} it pretty much negates the heal reduction and it blocks damage from it for 2 seconds \n\ni think {{summoner:21}} is fine when facing an assassin (usually mid lane) you need to know if you need {{summoner:3}} to trade back or {{summoner:21}} to protect yourself from dying...","replies":[{"poster":"Stillname","date":"2016-10-30T14:49:45.833+0000","up_votes":1,"down_votes":0,"body":"Barrier blocks grievous wounds? I think it has the benefit of being unaffected by grievous woulds but it doesn't block it in any way.\n\nI don't know if it is right to say that Barrier is fine when no one is taking it but maybe people are just mistaken to never take it and it does already have its own niche.","replies":[]}]}]}