{"poster":"xFenix7","date":"2016-05-11T01:03:14.848+0000","title":"Quiero ser coach/analista y me nomino para un team","subforum":"Reclutamiento","up_votes":1,"down_votes":1,"body":"Buenas Gente!\r\n\r\nHace rato que tenia ganas de ser coach/analista de un team y hoy me dieron las ganas por empezar a estar en uno, as&iacute; que si alguno anda buscando un coach o piensan que uno les vendr&iacute;a bien, pues aqu&iacute; estoy!.\r\n\r\nLes cuento un poco de mi:\r\n\r\nActualmente soy Platino II (antes uno pero baje T_T) y tengo una completa experiencia en todas las lineas menos top (puedo jugar top pero no me siento confiado a la hora de jugar). \r\nQuiero recalcar que es mi primera vez de coach/analista y que siempre me gust&oacute; resaltar los errores en los dem&aacute;s (obviamente los m&iacute;os tambi&eacute;n). No soy de: &quot;Wow mira la jugada que hizo!&quot;, si no mas bien de: &quot;pudiste no haberte muerto si no hubieras quemado flash antes&quot;. Se que es un poco desanimador pero es que para mi un jugador/a es bueno/a no por las jugadas que se mande si no por el poco margen de error que tenga.\r\nAun as&iacute; eso no saca que mi actitud sea negativa, en una auto-critica me considero bastante positivo y optimista (piensen que jamas tiro surrender ni aunque tengamos las torres del nexo destruidas y el otro equipo sea puro de late) ya que para mi es cuesti&oacute;n de esperar a que un enemigo cometa un error y dar vuelta cualquier partida, no importa las circunstancias, composiciones de equipo, jugabilidad, etc.\r\n\r\nMi tiempo es bastante extenso (aun no empiezo la facultad xD) entre las 10-13hs ARG y 19-24hs de lunes a viernes (s&aacute;bados y domingos libre). ACLARO, NO ES FIJO EL HORARIO, osea, no voy a estar exactamente entre esas horas, puede variar (depende de mis ganas o que tenga cosas que \r\nhacer).\r\n\r\nQuiero que por favor a la hora de considerarme sean objetivos y no se fijen por mi liga ya que considero que siendo un coach/analista puedo ser tan eficiente desde un team bronce a un team challenger.\r\n\r\nTambi&eacute;n aclaro por que pongo coach/analista en vez de uno solo. Resulta que la influencia que quiero dar en un equipo contiene tanto la de un coach como la de un analista y no le encuentro una categor&iacute;a media en la que me sienta identificado.\r\n\r\nEso es todo, al que le interese que me mande una solicitud y si quieren pueden probarme antes de aceptarme, no tengo ning&uacute;n problema y sera un gusto hacerlo.\r\n\r\nSalu-2!","replies":[{"poster":"Hoholasoynoob19","date":"2016-05-11T16:05:08.011+0000","up_votes":1,"down_votes":0,"body":"necesito un analista para mi team, actualmente soy el coach. Tenemos horarios de entrenamiento y un roster completo. Los chicos son muy organizados y respetuosos, si te interesa responderme y te mando solicitud","replies":[{"poster":"xFenix7","date":"2016-05-11T17:19:38.163+0000","up_votes":1,"down_votes":0,"body":"Dale","replies":[]}]},{"poster":"Saiiyan","date":"2016-05-11T04:47:20.855+0000","up_votes":1,"down_votes":0,"body":"se mi coach pero no tengo team, aunque no se si vos vas a crear el team","replies":[{"poster":"xFenix7","date":"2016-05-11T15:36:26.076+0000","up_votes":1,"down_votes":0,"body":"Con gusto,mándame solicitud","replies":[]}]}]}