{"poster":"Hide In Q ","date":"2016-11-21T17:00:13.558+0000","title":"Suche Team für Rankeds und mehr (plat oder höher)","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo Leute, Ich suche ein Team f&uuml;r Ranglisten Spiele und eventuell Turniere . \n\nInformationen &uuml;ber mich :\n-Ich bin 18 Jahre alt und mache gerade mein Abi\n-bin ca immer 15-16 Uhr  Zuhause\n-MainLane:\n Ich hab mit jeder Lane Erfahrung gemacht und kann so zu sagen auch jede gut.\n Bevorzuge in SoloQ aber Top/Mid weil man da mehr carry potenzial hat.\n-Elo:\n ich bin Platin 4 letze Season gewesen. lag allerdings daran das ich viel zu viel zeit in gold verschwendet hab und mit freunden gespielt     hab die silber sind und nur trollen. \nich selbst w&uuml;rde mein Niveau auf Dia einsch&auml;tzen.\nalso falls euch jemand fehlt oder ihr gerade ein team aufbauen wollt bin ich genau der richtige !\n\nMeine Anforderungen:\n-keine geflame untereinander \n-Elo: Plat oder dr&uuml;ber\n-Zeit: man sollte schon regelm&auml;&szlig;ig spielen , ich spiele t&auml;glich.\n\nBei Interesse einfach i RuffyJ adden und anschreiben ","replies":[{"poster":"fess123","date":"2016-11-22T08:33:16.433+0000","up_votes":1,"down_votes":0,"body":"Hi i RuffyJ,\n\ndu hast es satt alleine in der Flex Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/cOWosEff-aequilibritas-esports-sucht-rekruten-community-esports-lol-csgo-overwatch-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]}]}