{"poster":"Néd Stark","date":"2018-04-28T16:56:05.386+0000","title":"Este juego ya está muerto aunque no quieran reconocerlo","subforum":"Charlas Generales","up_votes":5,"down_votes":24,"body":"-Se est&aacute;n yendo todos los rioters.\n-El server va de mal en peor.\n-10 a&ntilde;os con trolls impunes y ahora banean todo lo que produzca sombra.\n-Pasaron de no hacer nada y decir &quot;para eso est&aacute; el mute y el report&quot; a sancionar por cualquier estupidez.\n-No hicieron absolutamente nada para el d&iacute;a de los inocentes.\n-Los de rito balancean el juego acorde a la liga profesional que son como 0.000000001% de todos los jugadores y al resto que somos m&aacute;s del 99% y los que les aportamos con dinero, nos dejan as&iacute; sin m&aacute;s, teniendo que bancarnos a campeones rotisimos pero que seg&uacute;n ellos est&aacute;n bien porque en la liga profesional no son nada.\n-Exageraron con los reworkearon de champs, algunos si necesitaban ciertos retoques, pero no en el caso de unos cuantos que eliminaron pr&aacute;cticamente el campe&oacute;n completo para meter a otro con el mismo nombre.\n-Muchos de nosotros nos descargamos el juego no por ser el mejor de todos en ese entonces, si no porque era el que m&aacute;s ofrec&iacute;a y menos recursos ped&iacute;a, ahora el juego pesa como el doble de sus inicios y poco a poco va perdiendo su esencia.\nRito no entiende que queremos solo un server decente, para qu&eacute; m&aacute;s skins, meta, reworkears, cambios al mapa, etc, si no puedes jugar.\n-&quot;Van a tener los dos clientes&quot;, nunca fue as&iacute;, a fin de cuentas tuve que comprarme otra computadora, porque el lol ya era tan pesado y ped&iacute;a tantos recursos, que la antigua que ten&iacute;a no lo pod&iacute;a correr m&aacute;s.\n-Urf era lo mejor que ten&iacute;an, ll&aacute;menme rata, pero para m&iacute; fue su mejor &eacute;poca cuando ese modo exist&iacute;a, hac&iacute;an o&iacute;dos sordos a la petici&oacute;n de la comunidad y pon&iacute;an los mismos modos semana tras semana hasta que de la nada dejaron de rotar y solo ponen uno cada tanto.\n-El 99% de las veces que ca&iacute;a el server, nunca era culpa de ellos, siempre alguien m&aacute;s, hasta a las pobres alpacas culparon.\n- Cuando algo anda mal, todos los rioters desaparecen, nadie da la cara, siempre se enteran horas despu&eacute;s mientras t&uacute; te comes el leavebuster, reportes, insultos y p&eacute;rdida de lp, un mal rato que te pudiste haber evitado si estuvieran monitoreando constantemente el juego, encima de todo siempre tienen excusas para todo y nunca dan nada en compensaci&oacute;n, no deber&iacute;an pero m&iacute;nimo unas disculpas, basta de vernos la cara, la calidad del juego es mal&iacute;sima, entras contento a jugar y sales horriblemente mal, en cualquier otro juego nunca Vi que pusieran excusas, pasaba algo malo y de inmediato te sal&iacute;a un cartelito compensandote por la falla, aunque a ti no te haya afectado, esto demuestra que la empresa de riot nunca se preocup&oacute; ni de su gente que eran los que los manten&iacute;amos, ni de su servidor.\n-Dinero, dinero, dinero, para qu&eacute; ofrecerles algo a la gente si reclamen lo que reclamen, van a seguir jugando igual?\n-Por algo muchos jugadores se est&aacute;n yendo, no porque haya surgido otro juego m&aacute;s divertido, es que el lol ya no es divertido, es estresante, te enferma de la cabeza, no puedes disfrutarlo por muhos factores y eso ustedes lo saben, los rioters no son tontos y no se fueron de s poquito, se est&aacute;n yendo en masa, solo p&oacute;nganse a averiguar quienes son los que ya se fueron, no solo los de nombre rojo, algunos de soporte tambi&eacute;n dejaron esto por algo mejor, esto no se dirige a ning&uacute;n lugar.\n-Dejen de pedir compensaciones, si siempre han hecho oídos sordos y lo van a seguir haciendo hasta que el juego terminé de agonizar.\n-Denme negativos, me vale, no escribí  esto para agradar a nadie.","replies":[{"poster":"Phaedra","date":"2018-04-28T17:07:23.038+0000","up_votes":4,"down_votes":0,"body":"10 años ya? como pasa el tiempo...\nA mi me resulta al reves, viven haciendo cambios y modificando las cosas...pero por lo visto en tu vision no hacen nada. \nPero ahora banean y antes no...queres cosas nuevas pero no querer reworks, queres reworks pero que no sean tan drasticos...\nSinceramente, si te canso el game cambiate. El otro dia me baje el fornite, porq joden todos con eso. Me parecio una bost4 , tarde 3 hs en estar jugando lol de nuevo. \nAdemas no todos juegan lol porque piensen que sea el mejor game, si no porq se adapta mejor a las posibilidades, como pcs con bajos recursos, o que podes jugar pocas horas al dia. \nPor ejemplo, si fuera por mi jugaria L2 toda la vida. es el mejor juego que existe y existio (para mi) , pero laburo y hago deporte, no puedo dedicarle mas de 2 hs por dia, y en esos juegos si no jugas 12hs diarias al menos, no existis en el servidor.","replies":[{"poster":"Néd Stark","date":"2018-04-28T19:03:29.079+0000","up_votes":1,"down_votes":3,"body":"No quiero cosas nuevas, pagaría por volver a jugar en la antigua grieta con los antiguos champs, esto no es lo que era y no sé de otros juegos, solo he jugado esto.","replies":[{"poster":"bombastico","date":"2018-04-28T19:17:04.364+0000","up_votes":2,"down_votes":0,"body":"Yo jugué en el 2012 y era todo muy ortopédico, los poligonos te pinchaban los ojos.","replies":[{"poster":"Néd Stark","date":"2018-04-28T21:25:19.392+0000","up_votes":1,"down_votes":2,"body":"Me gustaba.","replies":[]}]}]},{"poster":"Ellora","date":"2018-04-29T04:33:51.617+0000","up_votes":1,"down_votes":1,"body":"Los shooter requieren mas manos que el lol, por algo habras vuelto... para pensar no?","replies":[{"poster":"Phaedra","date":"2018-04-29T04:42:51.336+0000","up_votes":1,"down_votes":0,"body":"Campeon de CS en mi pueblo fui...\n\nAl margen de eso, un shooter mas dedos que lol? se nota que jugas yi ...","replies":[{"poster":"Néd Stark","date":"2018-04-29T05:15:45.817+0000","up_votes":1,"down_votes":1,"body":"Uhh! Pará un poco! No sabía que teníamos al campeón de cs jugando al lol, seguro que sos la alegría de tu pueblo.\nPor algo estás acá.","replies":[{"poster":"Phaedra","date":"2018-04-29T05:39:40.237+0000","up_votes":1,"down_votes":0,"body":"Aca donde? Si te jode tanto el LOL andate y listo genio. Te pensas que le preocupa a alguien? {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Néd Stark","date":"2018-04-29T05:51:56.694+0000","up_votes":1,"down_votes":0,"body":"Uff! Cuánta arena bro!\nNo deberían ni responderle a la gente así de maleducada.","replies":[{"poster":"Phaedra","date":"2018-04-29T06:11:58.317+0000","up_votes":1,"down_votes":0,"body":"\"Uhh! Pará un poco! No sabía que teníamos al campeón de cs jugando al lol, seguro que sos la alegría de tu pueblo.\nPor algo estás acá.\"\n\nAl maleducado se le responde igual...jaja. No te alteres chiquitin, segui haciendo posteos sobre lo malo de LOL que seguro dejamos de jugar todos. besito mua","replies":[]}]}]}]}]},{"poster":"DIOS TUTI","date":"2018-04-29T05:22:53.010+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ellora,realm=LAS,application-id=v7qsfXsE,discussion-id=T2zkvuVf,comment-id=00020001,timestamp=2018-04-29T04:33:51.617+0000)\n>\n> Los shooter requieren mas manos que el lol, por algo habras vuelto... para pensar no?\n\nrequieren mas reflejos, pero mucho menos conocimiento.\n\npodes ser el dios mecanicamente en lol que si no tenes macro no ganas.","replies":[]}]}]},{"poster":"bombastico","date":"2018-04-28T19:16:10.876+0000","up_votes":3,"down_votes":0,"body":"O tal vez en estos años los gustos cambian, es totalmente valido ir cambiando de juego.\n\nPero aquí pareciera que si juegas a algo no puedes jugar a ninguna otra cosa. ¿No es valido echar una partida a lol y otro día meterte en algún otro juego?\n¿Tenemos que matar al lol cada año que se pone de moda algún otro juego o el server tiene problemas xD?","replies":[{"poster":"Néd Stark","date":"2018-04-28T21:28:55.089+0000","up_votes":1,"down_votes":3,"body":"Cada uno juega los juegos que quiera, de momento solo estoy con el lol, de otros solo conozco los títulos.","replies":[]}]},{"poster":"Juice Wrld","date":"2018-04-28T18:20:08.608+0000","up_votes":3,"down_votes":0,"body":"Esto me hace acordar a la gente de mi país, si la policia llega tarde se quejan, si los policías no aparecen se quejan... AHHH pero si los policías matan a un asesino o a un ladrón hacen huelga porque no tiene que ser así.","replies":[]},{"poster":"BG King Fratus","date":"2018-04-28T17:02:20.899+0000","up_votes":6,"down_votes":3,"body":"https://www.generadormemes.com/download/qf6xoyews1t791fqlzo10hhujn6qkmipihqrh1z3t6o7g1xu27d9xb7fcp8ltlk","replies":[]},{"poster":"Folkie","date":"2018-04-28T17:33:07.155+0000","up_votes":1,"down_votes":0,"body":"Tal vez no esté pasando por un buen momento pero conozco un juego online que diariamente entran a lo máximo 60 personas y asi se ha mantenido, agregan actualizaciones cada 5 meses etc etc \n\ny adivina lleva 12 años y aun sigue vivo.. (no puedo mencionarlo aqui, pero ejemplos como ese hay muchos)","replies":[{"poster":"DIOS TUTI","date":"2018-04-29T05:20:24.039+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Folkie,realm=LAS,application-id=v7qsfXsE,discussion-id=T2zkvuVf,comment-id=0004,timestamp=2018-04-28T17:33:07.155+0000)\n>\n> Tal vez no esté pasando por un buen momento pero conozco un juego online que diariamente entran a lo máximo 60 personas y asi se ha mantenido, agregan actualizaciones cada 5 meses etc etc \n> \n> y adivina lleva 12 años y aun sigue vivo.. (no puedo mencionarlo aqui, pero ejemplos como ese hay muchos)\n\nel AO querras decir? me acuerdo que cuando deje de jugarlo (compre una pc mejor, tenia una net chota antes) tenia 200 users, pero me dijeron q hay 50 60 ahora.","replies":[{"poster":"Folkie","date":"2018-04-29T18:37:15.763+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JuliosTUTI,realm=LAS,application-id=v7qsfXsE,discussion-id=T2zkvuVf,comment-id=00040002,timestamp=2018-04-29T05:20:24.039+0000)\n>\n> el AO querras decir? me acuerdo que cuando deje de jugarlo (compre una pc mejor, tenia una net chota antes) tenia 200 users, pero me dijeron q hay 50 60 ahora.\n\nNop, no es AO ni mu como dijeron arriba, se trata de un juego RvR creado en argentina (famoso en su tiempo) que a pesar de no ser la gran cosa gráficamente aun cuenta con fieles usuarios, pero la población decae dia a dia.","replies":[]}]},{"poster":"Javo Trypod","date":"2018-04-28T18:37:32.356+0000","up_votes":2,"down_votes":1,"body":"Es el mu?","replies":[]},{"poster":"Néd Stark","date":"2018-04-28T19:00:43.952+0000","up_votes":1,"down_votes":3,"body":"No vas a comprar un juego de 60 jugadores con el lol que sin cientos de Miles, con 60 esto no existe más.","replies":[]}]},{"poster":"Tortuguita","date":"2018-04-28T20:18:46.351+0000","up_votes":3,"down_votes":2,"body":"\"-10 años sin hacer nada contra los trolls\" Hasta acá pude llegar, me parece que tampoco lo anterior me digne en leer. jaja","replies":[]},{"poster":"Gretta Thunberg","date":"2018-04-28T17:20:21.086+0000","up_votes":1,"down_votes":0,"body":"Quiza no eres bueno para el lol por eso sientes que todo esta mal :) pero estoy contigo en la parte de los balanceos, un tank no puede limpiar una oleada de 2 habilidades xD","replies":[{"poster":"Néd Stark","date":"2018-04-28T19:01:29.115+0000","up_votes":1,"down_votes":1,"body":"No, no soy bueno y no tiene nada que ver las habilidades con la experiencia que tenía años atrás con la de ahora.","replies":[{"poster":"Gretta Thunberg","date":"2018-04-28T23:02:22.754+0000","up_votes":1,"down_votes":0,"body":"amigo, bajo ningun concepto el lol esta muerto que tiene falencias? claro como todo pero el lol cada sube mas la gente que lo juega y en las competencias igualmente han avanzado mucho.\n\nen 2014 en la cls los jugadores jugaban en sus casas, ahora los equipos juegan en una sala reacondicionada perfectamente para los jugadores si eso no es avanzar entonces explicate tu que es.\n\ny eso es solo por poner un ejemplo, no te estoy hablando de los streamers que viven del lol, ni tampoco de que pubg y fornite no llegan a la popularidad del lol loquete :D","replies":[{"poster":"Néd Stark","date":"2018-04-28T23:52:43.939+0000","up_votes":1,"down_votes":0,"body":"No entiendo la insistencia de la gente en mencionar al fornite ese o cómo se llame.\n\n>amigo, bajo ningun concepto el lol esta muerto\n\nEstá muerto bajo muchos conceptos, de una mala comunidad, de calidad de server, de rioters que no dan la cara, de modos rotativos que son cada tanto, de soporte que no  responde los tickets, etc.","replies":[{"poster":"Gretta Thunberg","date":"2018-04-29T12:17:49.364+0000","up_votes":1,"down_votes":0,"body":"LUUUUUUL primero que nada lo de mala comunidad la verdad es que si es un asco y es en lo unico que te doy la razon, calidad del server a mi me parece bastante estable, estos ultimos problemas no fueron por el server si no por el proveedor de internet telefonica con lo cual riot no tiene nada que ver, lo de rioters que no dan la cara me parece una mentira.\n\nEl lol no se centra en modos de juegos rotativos y si no estan es por algo, riot ya implemento modos de juegos distintos cada semana y si lo quitaron es por algo, a mi personalmente para bien o para mal me han respondido todos los tickets que en enviado asi que tu argumento tiene 10% de credibilidad. y es que si riot empezara a permabannear a todos los toxicos que alguna vez han flameado el servidor se queda sin players la verdad riot es una empresa y eso salu3","replies":[]}]}]}]}]},{"poster":"Ellora","date":"2018-04-29T04:43:47.484+0000","up_votes":1,"down_votes":0,"body":"Sabes que pasa? Como la comunidad de jugadores es cada vez mas casual, el LOL se esta adaptando a eso, convirtiendose en un juego casual.\nVos fijate las ranked como cada vez son mas faciles, temporadas atras tenias que conocer todas las lineas porque al entrar podia tocarte cualquier rol, luego vinieron las flex con eleccion de 2 roles, y ahora quieren implementar rankear por rol. y ni hablar como pusieron los tiempos de jungla.\nYa no hay desafio, el juego cada vez mas facil, dando la posibilidad que cualquiera escale liga facilmente (implementando 1 victoria de regalo), que la flex sea free eloboost y el nulo control a las smurf en soloQ con sus premades.\nResumiendo, juego facil, bajo nivel, casuales asi esta el lol en 2018","replies":[{"poster":"Néd Stark","date":"2018-04-29T05:12:05.785+0000","up_votes":1,"down_votes":0,"body":"El mejor comentario que haya leído jamás.\n Te regalaría todo lo que tengo, pero no tengo nada, excepto amor. (?)","replies":[]}]},{"poster":"xXSHERMINATORXx","date":"2018-04-29T02:14:37.262+0000","up_votes":1,"down_votes":0,"body":"Me parece que el muerto eres tu y no lo quieres reconocer","replies":[{"poster":"Néd Stark","date":"2018-04-29T04:37:06.648+0000","up_votes":1,"down_votes":0,"body":"Muerto de amor por ti.","replies":[]}]},{"poster":"AxElL93","date":"2018-04-28T18:31:20.199+0000","up_votes":1,"down_votes":0,"body":"la vdv pero aun asi hay partidas buenas","replies":[]},{"poster":"Sir Nova","date":"2018-04-28T17:04:47.840+0000","up_votes":1,"down_votes":0,"body":"Entiendo algunos puntos que detallaste, pero la parte de que los rioters se están llendo de donde lo sacaste ? ( pregunto por mi ignorancia sobre eso )","replies":[{"poster":"MasterRightClick","date":"2018-04-28T18:01:39.405+0000","up_votes":1,"down_votes":0,"body":"https://boards.las.leagueoflegends.com/es/c/off-topic-y-temas-personales/ncY7TEfu-que-esta-pasando-en-latam-fuga-de-rioters\n\nY panda tambien se fue, una lastima, el unico de comportamiento al jugador que tenia pelotas para hablar los temas, que bien me caia ese pibe","replies":[]}]}]}