{"poster":"swaaaag","date":"2017-02-03T21:58:51.854+0000","title":"Turniermatch verschieben Gruppe 12 imProve Inferno vs Athena Parthenos","subforum":"Battlegrounds-Turniere","up_votes":2,"down_votes":0,"body":"Guten Tag,\nwir, das Team &quot;Athena Parthenos&quot; bitten um eine Verschiebung unseres Gruppenspiels gegen das Team &quot;imProve Inferno&quot;, da es zu zeitlichen Komplikationen kommen w&uuml;rde und wir deshalb das Spiel, am Samstag den 4.2. , Aufgeben m&uuml;ssten. Ebenso ist es leider nicht m&ouml;glich das Spiel auf Sonntag den 5. Februar zu verschieben da an diesem Datum ein Spieler des anderen Teams aus zeittechnischen Gr&uuml;nden nicht antreten kann. \n\n\nMit freundlichen Gr&uuml;&szlig;en \nKbL\n\nPs: Falls eine Verschiebung nicht möglich ist, wäre die Frage ob man eventuell einen Ersatzspieler einsetzen könnte.","replies":[{"poster":"swaaaag","date":"2017-02-03T22:40:48.952+0000","up_votes":1,"down_votes":0,"body":"Unser Vorschlag für die Verschiebung wäre Dienstag der 7.2.16 um 22 Uhr.","replies":[{"poster":"Alwhity","date":"2017-02-03T23:37:31.916+0000","up_votes":1,"down_votes":0,"body":"Der Terminvorschlag kommt unserem Team imProve Inferno sehr gelegen und benötigt nur noch die Bestätigung eines Adjudicators.","replies":[{"poster":"Elthision","date":"2017-02-03T23:45:49.748+0000","up_votes":1,"down_votes":0,"body":"Alles klar, Dienstag 22 Uhr ist für euch eingetragen und somit verbindlich. Viel Glück beim Match.\nmfg Elthision","replies":[{"poster":"Alwhity","date":"2017-02-03T23:55:10.740+0000","up_votes":1,"down_votes":0,"body":"Verliert der Tournament-Code seine Gültigkeit oder wird dieser dennoch für den neuen Termin verwendet?","replies":[{"poster":"Elthision","date":"2017-02-03T23:59:09.424+0000","up_votes":2,"down_votes":0,"body":"Der Turniercode ist weiterhin gültig.\nIn der Lobby oder in Chatraum werdet ihr zur entsprechenden Zeit auch einen Adjudicator finden, der euch weiterhelfen kann, falls doch Probleme auftreten sollten.","replies":[]}]}]}]}]},{"poster":"Elthision","date":"2017-02-03T22:07:29.415+0000","up_votes":1,"down_votes":0,"body":"Hey,\nUm ein Spiel zu verschieben müsst ihr mit eurem Gegner Kontakt aufnehmen und mit ihnen einen Termin finden. Falls dieser nach Samstag 18:00 Uhr liegen sollte, so benötigt ihr unsere Bestätigung. Schicke am besten dem gegnerischen Captain eine Freundschaftsanfrage und kläre mit ihm ab, wann sie könnten. Falls ihr einen Termin gefunden habt, so meldet euch z.B. hier und lasst ihn von uns bestätigen. Bitte beachtet, dass wir den Termin nicht annehmen, falls er zu nahe an der nächsten Runde liegt.\nmfg Elthision","replies":[]}]}