{"poster":"Daddo","date":"2015-03-18T03:00:39.698+0000","title":"Problemi nelle Ranked","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Ragazzi.....sono Silver 3 dalla season 3 e sono molto demoralizzato per le ranked, non si riescono a giocare come tu vorresti, non mi diverto non c'è gioco di squadra e quasi sempre trovo il solito troller o nabbo di turno che va 1 vs 3 pensando di essere immortale o il solito player che gioca straoffensivo e viene ucciso dal jungler per poi flammare e feeddare.....ragazzi non ce la faccio piu sono stufo di queste persone, quando ho un team buono vinco e mi diverto l'altro giorno ero Irelia{{champion:39}}  e stavo farmando e pushando e in Graves con solo 98 di farm mi viene a dire di non farmare perché è una cazzata, e io gli dico: Guarda che il farm è la cosa piu importante di sto gioco sei tu che non ci dai importanza..... detto questo ha iniziato a insultarmi e a suicidarsi 1 vs 4 a caso per poi farmi perdere RAGAZZI FACCIAMO QUALCOSA !!!! {{summoner:11}} \r\n\r\nIo maino {{champion:64}} Lee Sin dalla season 3, e ogni volta sentirmi dire CAZZO PER ESSERE SILVER SEI UN LEE BRAVO mi ha un po rotto il cazzo, vorrei arrivare Gold senza rompi palle in team e usare il mio Lee nelle ranked di elo piu alto, un mio amico platino mi ha detto che ad elo alti Lee è giocato e la squadra vince velocemente mentre in Silver la gente non pusha si fa i cavoli suoi e si arriva a 50 minuti se non un ora di partita, piu che ward kikkare l'adc o fare qualche insec o magia non posso fare altro.....","replies":[{"poster":"Sìrjohn","date":"2015-03-18T17:56:58.975+0000","up_votes":2,"down_votes":0,"body":"Parti dal presupposto che il maggior beneficio che puoi trarre dalle masteries è mettendone 21 su una colonna e 9 su un altra, tranne il support che puoi fare un ibrido a seconda che tu abbia pickato un support poke (0/13/17) o un support tank (0/15/15) (sono indicativi poi te li gestisci tu). Poi ci sono rari casi dove puoi fare un ibrido per il top e rarissimi casi per il jungler.  Ma fai sparire quella cosa 0/30/0…….:)\n\nPer quanto riguarda le rune del support, indipendentemente dal tipo di support, ti suggerisco  vita magic res e armor (molti mi dicono di mettere mana regeneration ma non mi convincono). Lascia perdere danno e cool down reduction,  a quelli penserà l'adc., devi essere grosso per farle fare a lui queste cose.\n\nLe build che metti secondo me sono giuste. \n\nSu Annie leva quei punti talento sul danno fisico, ne trai beneficio i primi 5 livelli e basta, poi non farai la differenza di autoattack.\n\nSu Vi leva block e unyelding, quelli servono in lane per non farti arrassare troppo, in jungle sono sprecati.\n\nSe ti va aggiungimi in game che andiamo a tirar due pugni insieme!","replies":[]},{"poster":"Sìrjohn","date":"2015-03-18T10:13:24.679+0000","up_votes":2,"down_votes":0,"body":"Ma sinceramente guardando il tu profilo mi sembra più che giusto il tuo attuale elo, hai ancora maestrie del tipo 0/30/0 o 27/2/1.... punti talento danno fisico su campioni full ap...... \n\nSulle rune support hai messo quasi full danno fisico...\n\nMagari poi ti muovi benissimo sul campo ma sulla spec sei un pochino randomico :)\n\nPoi giochi dalla season tre e in quella attuale hai già fatto 90 partite, se sei li vuol dire che quello è l'elo che meriti\n\n saper giocare bene lee non vuol dire meritare divisioni superiori..\n\nspero di non essere risultato antipatico, ma non aveva senso lasciarti nell'illusione di meritare un elo più alto","replies":[{"poster":"Daddo","date":"2015-03-18T14:10:39.441+0000","up_votes":1,"down_votes":0,"body":"Nho le rune lee sin me le sn fatte io le altre le ho imitate se devo correggere dimmi che fare, cmq le build che faccio mi sembrano adeguate guardando le ultime ranked fatte no ?","replies":[]}]},{"poster":"Dr LouD","date":"2015-03-18T08:37:59.649+0000","up_votes":2,"down_votes":0,"body":"Il 90 % delle partite di basso elo (e sono Gold 2 e mi considero ancora basso elo) durano più di 40 minuti, ergo impara a giocare hypercarry da lategame.\nNasus, Tryndamere, Tristana, Cassiopieia, quei champ che una volta completata la build asfaltano tutto e tutti, quelli che con 2 secondi di splitpush ti tirano giù tutta la base avversaria, insomma, quelli che ti fanno vincere giocando da solo e con un pò di astuzia.\n\nPer il problema del troll/afk E' SEMPRE STATO COSI', non ci potet far nulla, bisogna smettere di lamentarsi perchè non è questione di matchmaking o qualcos'altro, i troll ci sono in tutte le leghe. \nSe sei davvero bravo per essere un silver come ti dicono, se ti impegni vedrai che dal silver ci esci.\nSe posso dirti la mia esperienza per esempio, in s4 ero Silver II e non riuscivo proprio a salire. Mi dicevo \"cavolo, io merito davvero il gold, devo farcela\". Mi sono chiuso nelle normal draft per un mese e sono tornato nelle ranked in season 5. \n30 partite mi sono bastate per scalare quasi tutto il Gold. Ed ho vinto partite anche in 4v5, o partite disperate dove eravamo sotto di 20 kill e senza nemmeno un inibitore.\n\nL'importante su questo gioco è volersi impegnare a migliorare VERAMENTE, se per ogni cosa che vedo tutt'ora nei game devo venir qui a scrivere sul forum per denunciare qualche \"troll\" o \"afk\", a quest'ora sarei ancora bronzo. (con tutto il rispetto per i bronzi obvs)","replies":[{"poster":"Daddo","date":"2015-03-21T18:58:37.671+0000","up_votes":1,"down_votes":0,"body":"Posso capire un Nasus e un trynda ma spesso mi basta un team inutile per morire come uno stupido, in un team fight molto spesso focussano me che sono il tank ma il mio team non ne approfitta se ne scappa dicendo: dai dai ci protegge lui andiamocene","replies":[]}]},{"poster":"WorldUp","date":"2015-03-18T03:18:17.746+0000","up_votes":2,"down_votes":0,"body":"Io ho lo stesso identico problema,e sono gold 5. Puntualmente ogni volta che vado in Ranked ( sia in solo che in duo) becco della gente che non sa usare il proprio champ. Mentre nel team avversario quando domando se qualcuno sta Smurfando trovo sempre come minimo 1 o 2 persone che Smurfano. \nNon riesco davvero a capire se succede solo a me o se è proprio un problema di Matchmaking.   \nNon sono uno di quelli che flamma a caso e che non fa altro che dire che si meriterebbe di stare in platino, in diamond o di farla in testa a faker. \nMa anche per me è diventato impossibile divertirmi in Ranked per via di queste persone. \nPer quanto io o la persona con il quale faccio Duo possiamo mettercela tutti ci sono sempre delle persone davvero nabbe che ti fanno perdere 9 volte su 10. \nSinceramente voi cosa ne pensate del Matchmaking in questa season 5? Sono l'unico al quale sta iniziando a {{summoner:14}} il c*** per ste cose?","replies":[{"poster":"Daddo","date":"2015-03-18T03:20:51.538+0000","up_votes":1,"down_votes":0,"body":"PORCA PUTTANA VEDI ? PURE TU CON STI PROBLEMI .-.","replies":[]}]},{"poster":"Frattaglia","date":"2015-03-18T07:45:29.815+0000","up_votes":1,"down_votes":0,"body":"Gioca ranked team, così ti trovi contro una Frattaglia mid che perde tutte le lane {{champion:17}} \n\nDetto questo, ultimamente anche io ne sto perdendo parecchie. È cambiato il meta e, soprattutto in soloQ, è soprattutto la prestazione del mid quella che determina una partita.\nGiocando Lee jungler quello che devi fare è dare vantaggio presto e chiudere la partita presto. Se mid hai un champ con molto danno e capace di snowballare, camperalo. Oppure cerca di capire qual è la lane che può fare i danni feedata e inizia a cercare di portare vantaggio là.\n\nConsidera che puoi avere delle ottime meccaniche con il champ, ma serve anche imparare a muoversi bene nel ruolo che hai scelto, soprattutto se conosci i limiti del tuo champ devi scegliere le azioni più vantaggiose. Considera che al momento i jungler forti sono i tank, che però hanno altri svantaggi :)\n\n\nDetto questo, anche io ultimamente ne sto perdendo parecchie. Per ora voglio adattarmi al nuovo meta imparando qualche mid e migliorando nei match-up, poi si vedrà. :)","replies":[{"poster":"Daddo","date":"2015-03-29T21:59:19.986+0000","up_votes":1,"down_votes":0,"body":"Ho fatto feddare una LB che shottava tutti, dato una mano alla bot che ha vinto la lane, ma porca troia.... un GRAGAS TOP contro cho gath ha straperso e quel coso era immortale io dicevo: gioca safe per favore aspettami ma lui si buttava melee e moriva ma cazzo !!!!!\n\nAppena sono arrivato non siamo riusciti a tirarlo giu e quello si è lamentato con me....\n\nPoco fa ero support e abbiamo vinto la lane ma il nostro rengar è andato FULL CRITICO contro un team tankoso senza armor pen....si buttava e moriva","replies":[]}]},{"poster":"Honey Queen","date":"2015-03-19T15:51:14.718+0000","up_votes":1,"down_votes":0,"body":"Matchmaking ... credo sia davvero sballato nel senso che ne vinci 3 di fili ne perdi 3 di fila ( a me succede sempre così) e quelle 3 di fila perse son le promo ovvio  a forza di perdere sto anche peggiorando nel  giocare oggi un lee sin si è messo a feddare di proposito  tutte le lane perchè il top non gli aveva dato la top lane, poi si è messo la testa a posto ed ha smesso di trollare, ma il top e il mid li aveva già feddati, abbiamo perso di poco per colpa sua che in early ha feddato tutte le lane. è solo un esempio voglio anche citare un ramus che in squadra mia è morto al minuto 00:40  per poi chiudere la partita 2/28/1 queste sono le ranked questo è il bronzo .","replies":[]},{"poster":"Daddo","date":"2015-03-18T03:01:13.090+0000","up_votes":1,"down_votes":0,"body":"Ragazzi facciamo qualcosa per favore {{champion:64}}","replies":[]}]}