{"poster":"DwarvenGiant","date":"2015-08-10T23:59:55.001+0000","title":"@Repertoir- Questions about Juggernauts and other Updates","subforum":"Gameplay","up_votes":5,"down_votes":0,"body":"I have a few questions about them Juggernauts:\r\n\r\n- You guys also mentioned Shyvana and Olaf in the Dev Blog- How far off are they and can you share anything about their updates?\r\n\r\n- Are there any plans for Galio, Aatrox and Tryndamere? (Is Aatrox considered a Juggernaut?)\r\n\r\n- Are there more Juggernauts in the works that aren&#039;t Shyvana and Olaf?","replies":[{"poster":"RiotRepertoir","date":"2015-08-11T02:21:38.720+0000","up_votes":5,"down_votes":0,"body":"> You guys also mentioned Shyvana and Olaf in the Dev Blog- How far off are they and can you share anything about their updates?\n\nEnd of year maybe? We know _that_ we want to work on them, but we don't yet know exactly _what_ the output should be per champion yet.\n\n> Are there any plans for Galio, Aatrox and Tryndamere? (Is Aatrox considered a Juggernaut?)\n\nAatrox is probably closest to a Juggernaut here, but even then, his mobility profile (free target dash, specifically) is pretty contradictory to our expectation for these guys, so working on him would probably come at costs to that or something else that players see as important to his identity. That said, Gypsylord was  recently looking into giving Aatrox some love unrelated to 'juggernaut' work, so he may be ready to shed some light on that in the coming months.\n\n> Are there more Juggernauts in the works that aren't Shyvana and Olaf?\n\nCurrently, no.","replies":[{"poster":"Fan I Kuken","date":"2015-08-11T16:29:02.852+0000","up_votes":2,"down_votes":0,"body":"I think you mentioned Trundle being closer to a tank than a juggernaut. Why is that? And could Renekton and Udyr be considered Juggernauts? Someone at Riot mentioned one of the criteria for juggernaut were immobile (at least to the extent with troublesome initiation), preferably building tanky but still being able to kill targets by themselves if they manage to get to them. Udyr and Renekton seems to fit into this.","replies":[]},{"poster":"NullDragon","date":"2015-08-11T04:11:54.147+0000","up_votes":2,"down_votes":0,"body":"I wanna be an awesome badass dragon with shyvana a lot more :(\n\nAnd for being an awesome badass dragon to feel better instead of just \"oh okay I get some extra things on my abilities that are mostly useless\". and for more to do than run at enemy autoattacking","replies":[]},{"poster":"ExecutorDill","date":"2015-08-11T17:21:03.041+0000","up_votes":1,"down_votes":0,"body":"What about Warwick as a juggernaut?","replies":[]},{"poster":"RainbowYoshi","date":"2015-08-11T15:48:42.005+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=iPKExlp2,comment-id=0000,timestamp=2015-08-11T02:21:38.720+0000)\n> Aatrox is probably closest to a Juggernaut here, but even then, his mobility profile (free target dash, specifically) is pretty contradictory to our expectation for these guys, so working on him would probably come at costs to that or something else that players see as important to his identity. \n\nWhat exactly is the line between determining if a champion can fit the Juggernaut profile, then?  In my opinion, Darius and Garen both completely fit it, along with Morde.  They are big, slow, do a lot of damage, and you want to stay away from them.  But I've never felt big and slow when playing Skarner.  In fact I've always felt the opposite, ever since I started playing him in Season 2.  He was fast, scurried around the map and went to fight people.  He used to slow them so he could keep up with his big speed boost, then later he sped himself up instead so he could keep up.\n\nAt what point was it seen that the scorpion whose entire gameplay was wrapped around speeding around the map really quickly to get scrappy with people should be put into the Juggernaut profile of being big and slow?\n\nPlus, there are the more recent changes on the PBE of him getting his base movement speed back, which is really good, in my opinion.  I feel the nerf there would've been another nail in the coffin for him him as he's already super easy to kite and the additions to his kit weren't giving him anything to really counteract that at all outside of a very specific basis.  But the revert to that nerf then puts him back into being a speedy little scorpion... so not really a juggernaut?","replies":[]}]}]}