{"poster":"Ticklish Tas","date":"2015-01-17T05:18:22.230+0000","title":"Broken Wings (Q) now auto cancels it's animation, allowing Riven to attack much faster after using Q","subforum":"Gameplay","up_votes":152,"down_votes":38,"body":"NO\r\nBAD RIOT\r\nNO\r\nYOU DO NOT BUFF CHAMPIONS BY MAKING THEM EASIER THAN GAREN\r\nNO","replies":[{"poster":"Meddler","date":"2015-01-17T08:35:22.113+0000","up_votes":83,"down_votes":16,"body":"This is an unexpected change from some of the fixes in 5.1 to Overlapping CC effects (Riven's lockouts, which were blocking her from auto attacking automatically at once previously, use some of the same system that governs CC). We're going to look at this and discuss what the appropriate course of action is start of next week, will keep you folks posted.","replies":[{"poster":"ehlo","date":"2015-01-17T09:13:22.101+0000","up_votes":120,"down_votes":30,"body":"Lowering her skill cap and making her easier to play will only result in you guys nerfing her unjustly.","replies":[{"poster":"Schteltzer","date":"2015-01-17T10:42:59.933+0000","up_votes":20,"down_votes":76,"body":"she requires no skill and every nerf is right","replies":[{"poster":"MrBluePants","date":"2015-01-17T10:44:52.282+0000","up_votes":7,"down_votes":17,"body":"Says the guy who probably never played her... XD Now seriously, she is not like Warwick, or Fiora or Master Yi. I'm not saying she is very hard to play, but she is not as easy as everyone thinks. She is easy to start playing but very hard to master, specially because of that animation cancel. Also, she has so many counters!! And not just counters! Her counters don't let her do anything at all! Examples: Pantheon, Olaf, Morde, Ryse (not sure after his nerf), Yorick, every single marksman top (Quinn and Vayne are fun vs Riven -.-). These counters won't let you do absolutely nothing and they will force you to go back to base as soon and you come back to lane. What I learned with Riven is: she counters some champs very hard but she also gets destroyed by her counters. There is no middle term here.\n\nSidenote: Why is Pantheon's spear not a skillshot? It makes the champ super easy and cmon, defying the laws of physics?? A spear that can turn? Makes sense, LoL logic... Also, Ryse needs a skillshot as well.","replies":[{"poster":"Rinky Dinky","date":"2015-01-17T13:19:32.673+0000","up_votes":18,"down_votes":4,"body":"Master Yi may have a low skill floor, but Riven does as well...\n\nAnyone can pick up Riven and shit on everyone with her.\n\nHowever, the animation canceling, etc. is what seperated bad Rivens from good Rivens. She has a very high skill cap.\n\nYi also has a very high skill cap, as there are alot of things possible with Master Yi you probably dont even know about.\n\nEdit: If you think I'm bullshitting\n\nhttps://www.youtube.com/user/sepimnida","replies":[{"poster":"MrBluePants","date":"2015-01-17T13:34:54.762+0000","up_votes":2,"down_votes":5,"body":"Not just the animation canceling. There is the flash stun combo which no one does and I got quadras and pentas doing that (1 vs 4 or 5), using animation canceling as well. Another thing which I find intriguing is that some people activate her ult AFTER starting to fight. XD WTF?? I also see people just spaming qwe without using her passive and still getting kills... So yeah, I agree with you that she is op even if you play her wrong. But then, her counters are so damn.... AAAhhhhh!!! Even if you play Riven perfectly you will get completely violated!","replies":[{"poster":"biomaster","date":"2015-01-20T02:33:36.915+0000","up_votes":2,"down_votes":0,"body":"this is why she needs the nerfs, champions shoudnt be able to 4v1 anyone unless extremly fed, btw id love to know those counters cause im sick of constantly losing to her in lane","replies":[{"poster":"MrBluePants","date":"2015-01-25T20:05:43.747+0000","up_votes":2,"down_votes":0,"body":"And she can't 1 vs 4 when she is not fed... Unless the enemy team is very incompetent...","replies":[]}]}]}]}]}]},{"poster":"OyddAWqJ5r","date":"2015-01-18T05:55:03.099+0000","up_votes":5,"down_votes":1,"body":"But skill shouldn't equate to needlessly complicated inputs to perform a simple action. Q->Move Command->AA->Q->repeat is not skillful, it's just needless complication. Granted it takes skill, it does so in a needlessly convoluted manner.","replies":[{"poster":"AMYS GRAVE","date":"2015-08-05T14:43:23.739+0000","up_votes":3,"down_votes":0,"body":"This. So much this. I couldn't agree more. \n\nImagine for a second that if karthus wanted to ult he had to type \"The quick brown fox jumps over the lazy dog\" 3 times before the ult went off to get bonus damage. It takes more skill but it is not the type of skill league should require.","replies":[{"poster":"Zeeewwwmmmm","date":"2015-10-01T00:29:18.282+0000","up_votes":1,"down_votes":2,"body":"Mechanical skill is \"not the type of skill league should require\"?\n\nSo what is? Because almost all of the game boils down to mechanical skill on some level.","replies":[{"poster":"Maximum Morde","date":"2015-10-01T00:33:34.694+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mai Waifu Fiora,realm=NA,application-id=3ErqAdtq,discussion-id=R12g5sUE,comment-id=000c0003000300010000,timestamp=2015-10-01T00:29:18.282+0000)\n>\n> Mechanical skill is \"not the type of skill league should require\"?\n> \n> So what is? Because almost all of the game boils down to mechanical skill on some level.\n\nThere is also a heavy emphasis on decision making, intuition, and perception. These all set your course of action that you  must then execute via mechanical skill. All of these are critical, including mechanical skill.","replies":[]}]}]}]}]},{"poster":"Telosa","date":"2015-01-17T09:26:10.571+0000","up_votes":62,"down_votes":30,"body":"Do us a favor. I assume you're going to rework this later on and just revert Riven back to how she is on Live, but do us a favor - don't. Right now, Riot is essentially balancing two seperate versions of Riven - one exceptional assassin who does her combo in just over a second, and a slow, lumbering assassin who takes around 3 seconds to do her combo (either because they don't have high enough ping, they don't have the mechanical skill to press that quickly, or they don't realize it's even POSSIBLE to animation cancel Riven to that extent).  You shouldn't get THAT much of a difference in quality because one player has better ping or is more willing to fight against Riven's terrible controls to get more out of her kit and it's a huge level of invisible power. Include a small delay that CANNOT be auto canceled (maybe .3 or .5 in between Qs, so that the delay is less than it is on Live, but not as fast as it is currently if you animation cancel Riven perfectly) and just balance Riven around that. \n\nNow, I realize that this change WOULD necessitate further changes to Riven's kit because she'd be a bit stronger at lower elos and a little weaker at higher ones, but it would honestly be a good thing. Basic animation canceling for autos or Kiting is fine, but a player shouldn't see SUCH a dramatic difference in performance just because they know how to abuse Riot's code and people shouldn't have to fight a champion's kit SO much to get more use out of it. I'm tired of Riot balancing Riven's kit for fringe cases such as high-elo Riven players when most players don't even realize it's even possible to use Riven's kit in that way.","replies":[{"poster":"soliznoel","date":"2015-01-17T09:36:27.231+0000","up_votes":22,"down_votes":21,"body":"i think riven is fine as is tbh, to me it seems like you're trying to say riven shouldn't take skill anymore? She is supposed to have a high skill ceiling, thats what makes her so rewarding to play when you finnaly learn how to AA cancel and combo correctly.  This change would make her insta banned again at lower elos, which automatically takes away 1/4 of my champ pool lol. I just feel like riven needs to stay a skill based champ","replies":[{"poster":"Minarde","date":"2015-01-17T10:56:18.508+0000","up_votes":36,"down_votes":5,"body":"His complaint is that Riven's skill floor and skill ceiling are so far apart as to almost make her two different champions. At the lower-end, she's \n>a slow, lumbering assassin who takes around 3 seconds to do her combo,\n\nbut at the upper-end, she's\n>one exceptional assassin who does her combo in just over a second.\n\nEssentially, it makes for a huge disparity. Balancing for the upper-end makes her trash tier for the majority of the playerbase that can't animation cancel. Balancing for the lower-end makes her unstoppable in the hands of the small group who can. Shrinking the gap between floor and ceiling makes it easier to balance her.","replies":[{"poster":"Decaedeus","date":"2015-01-18T23:01:23.615+0000","up_votes":4,"down_votes":0,"body":"I respectfully disagree with this statement. \nRiven, by nature, is a noobstomp-type champion, one that is difficult to take down without proper team coordination. Even though there is a lot of hate against Riven, she's not consistently picked or banned at the highest levels of play, unlike Zed. \n\nIn my opinion, she is already balanced for the upper end, yet she still faces near-universal hatred at Silver and Bronze tiers due to her snowball ability and mobility; low-end players have issues fighting Riven due to a lack of skill kiting. If this change was completely implemented, I think that balancing Riven would be a bigger nightmare than it already is.\n\nI see what your point is, I'd just like to respectfully disagree. Maybe you could elaborate further?","replies":[{"poster":"Minarde","date":"2015-01-19T21:08:52.474+0000","up_votes":3,"down_votes":0,"body":"Sure, I'll try to explain my thoughts here. \n\nCurrent Riven is tough to balance because her damage is applied over such a variable time frame. Without animation canceling, she throws out her damage over, say, 6 seconds.* With animation canceling, she throws out the exact same damage over 2 seconds. This inconsistency raises the question of whether her damage should be balanced for the 6s state or the 2s state. Doing 1k damage over 6s is a much different thing than doing 1k damage over 2s.\n\nEven assuming that Riven is currently balanced (for some part of the playerbase), you can't just leave her alone. Because balance is entirely relative, changes to other champs, items, or meta shifts affect Riven's balance. See Tristana's rise from obscurity and subsequent nerfs due to the IE/BT changes some time ago.\n\nAs such, it's not a matter of hatred by lower-MMR players, usage at high-MMR, or even current balance state. Automatic animation canceling would undoubtedly lessen her variation in damage. Rather than messing with \"Oh, Riven does anywhere from 600 to 1.5k damage over 2s,\" dealing with \"Okay, Riven does about 1k damage over 2s\" is a much more straight-forward task.\n\n\n*All numbers are completely arbitrary and should be treated as such.","replies":[]}]}]},{"poster":"Rinky Dinky","date":"2015-01-17T13:28:34.567+0000","up_votes":5,"down_votes":2,"body":"Don't they kinda have to make this change?\n\nAs Meddler said, this is do too the overlapping cc change.","replies":[]}]},{"poster":"MeleeNuke","date":"2015-01-17T16:26:46.540+0000","up_votes":18,"down_votes":11,"body":"\"Riven is balanced.\"\n\n-Riven Players","replies":[{"poster":"SUNBURST96","date":"2015-01-17T16:35:14.708+0000","up_votes":15,"down_votes":16,"body":"\"Riven is balanced.\" -Riven Players\n\n-Players that fed against riven","replies":[{"poster":"Duke Of Casual","date":"2015-01-17T17:22:32.406+0000","up_votes":16,"down_votes":3,"body":"\" \"Riven is balanced.\" -Riven Players\n\n-Players that fed against riven\"\n\n-Riven Main","replies":[]},{"poster":"biomaster","date":"2015-01-20T02:46:48.379+0000","up_votes":3,"down_votes":0,"body":"players that couldn't win in a lane fight against her dash which is both a hello and goodbye (engage and disengage) with a sheild stronger then shen ( even tough shens the one thats supposed to be tank) her knock up and a stun (idc if its the shortest one in the game that 0.5s is all she needs to break my attack animation) the ult is the only thing i dont take issue with on her kit and thats cause its her ult so it kinda is supposed to be really strong, everything else i fail to see they couldnt do changes to, for example maybe make the sheild scale with ap like most other shield, she shouldnt get that much of a defensive boost for building dmg, even just reducing the ad scaling to 50% would be fine.\nI played riven and i thought she was great she was so much fun, but honestly first time as her i shouldnt have done so welll especially if shes supposedly such high skill level.","replies":[]}]}]}]},{"poster":"13Flamma","date":"2015-01-17T11:48:17.585+0000","up_votes":51,"down_votes":19,"body":"Please don't go through with this. We Riven mains who actually spent hours practicing this champ, all those hours will go to waste.","replies":[]},{"poster":"Last Watch","date":"2015-01-17T15:09:37.068+0000","up_votes":19,"down_votes":1,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=R12g5sUE,comment-id=000c,timestamp=2015-01-17T08:35:22.113+0000)\n>\n> This is an unexpected change from some of the fixes in 5.1 to Overlapping CC effects (Riven's lockouts, which were blocking her from auto attacking automatically at once previously, use some of the same system that governs CC). We're going to look at this and discuss what the appropriate course of action is start of next week, will keep you folks posted.\n\nI don't think Riot intended for you to be able to artificially increase your damage output through higher apm. I think Riven's q is currently unique in the fact that it is the only skill in the game where you can artificially increase your dps, through more apm, while not resulting in any clear gameplay decisions/counterplay offered to the enemy. Simply put, if the enemy Riven can animation cancel she will do a lot more damage in a smaller time frame than a Riven who cannot.\n\nI see this making Riven less about how fast you can cancel your animations, and more about your game decisions which isn't necessarily a bad thing.\n\nNow as to whether this will lower her skill cap, it may to a degree mechanically but when I look at other high skillcap champions Yasuo, Ahri, Lee Sin, Vayne they all have in common high mobility and outplay potential through dodging skill shots etc. In this sense I think that Riven will remain a high skillcap champion, 4 mobility skills on a very short cool down and how effectively those skills can be used will be what determines the skill of a Riven.","replies":[]},{"poster":"Blàck Lotus","date":"2015-01-18T04:39:52.579+0000","up_votes":10,"down_votes":0,"body":"Dear Riot, \nplease make lee sin's insec move into a simple QQQ combo\nthat way we dont have to spend so much time on learning ward jump\nthank you so much ","replies":[]},{"poster":"CrafterOfLaughs","date":"2015-01-17T15:52:15.594+0000","up_votes":6,"down_votes":0,"body":"To give a bit of context for a discussion, I'd like to add something that Meddler wrote himself in a previous developer journal regarding [meaningful choices](http://na.leagueoflegends.com/en/news/game-updates/features/lol-design-values-depth-meaningful-choices):\n\n> Meaningful choice adds a lot to a game, but it’s not an essential part of every element. Skillshots or challenging combos, for example, can be satisfying skill tests for many, even if the correct play is the same every time...\n> In League, a lack of meaningful choice is worth accepting either because of the **benefits a single option brings to the rest of the game**, or because the **choice is meaningful to other players**.\n\nI'm not arguing for the change either way, but I think it might be useful to frame any arguments in the current design values held by Riot. \n\nIs optimizing damage through animation canceling Riven's Q versus not animation canceling a meaningful choice? If so, how is the choice meaningful? Is there a different choice in regards to her Q that is perhaps better in other situations? (I hear that Riven Qs without animation canceling travels farther thus better for movement, but I don't know for sure. Just hearsay from a reddit post. I defer to Riven mains for the facts.)\n\nIf the choice isn't meaningful (i.e. it's always optimal to animation cancel Riven's Q), then is the mechanic worth accepting? What are the **benefits** for having animation canceling Riven's Q be the best possible choice in all cases? Is the choice to animation cancel Riven's Qs a choice that is **meaningful to other players**? To your opponents? To your allies?\n\nFinally, I think it appropriate to add something about League of Legends evolution that Morello spoke about in the [original design values post](http://na.leagueoflegends.com/en/news/game-updates/features/dev-blog-design-values-league-legends):\n\n> Players and designers are both a part of the League of Legends experience and evolution doesn't come through inaction. Our commitment to evolution means we can keep League healthy and dynamic over a number of years. Mistakes will be made along the way, but with player feedback and consistent iteration, we can create a constantly improving, ever-evolving game.\n\nDue to the unintended side effects of certain changes to Riven's Q, I think some idiosyncrasies have been exposed in Riven's design, in player-design value expectations, and even perhaps in Riot's own internal brain trust. If you feel that some certain values are not being appreciated, then I would urge players to voice their opinion on why certain values have more consideration into the design of League of Legends. While I don't think Riot can automatically pivot to incorporate different core values immediately, I do think we can help to influence the evolution of the game with heartfelt, but succinct communication. Be passionate, but be clear. Don't devolve into hyperbole and bile spewing and maybe everyone can come out ahead.","replies":[]},{"poster":"Rune Ocarina","date":"2015-01-17T15:13:01.760+0000","up_votes":9,"down_votes":8,"body":"Please keep this change. Riven's my favorite champ but it really hurts that I get shut down so hard because I don't have the insane mechanical skill to AA cancel her full combo in less that two seconds. No matter how many times I practice I can't perfect AA canceling but I still want to play Riven (and still do). Right now it feels like she's been nerfed for the people who've mastered her which makes her nearly impossible to play at lower elos properly. It really feels like we have two champs here mixed into one.","replies":[{"poster":"Jeozer","date":"2015-01-17T15:52:07.524+0000","up_votes":6,"down_votes":5,"body":"man, like seriously 15 games on riven and you said you have tried really hard?.. just because you put a  little work and didn't work and you think you having privilege to let riot make you to the level that people who player like 1000 games on riven. that's some critical thinkings.","replies":[{"poster":"Rune Ocarina","date":"2015-01-17T15:58:20.860+0000","up_votes":5,"down_votes":1,"body":"I've played more than 15 games with her - a lot more. But go ahead, use match history to try to prove a point.","replies":[]}]}]},{"poster":"Chris Chris","date":"2015-01-17T17:54:41.218+0000","up_votes":5,"down_votes":7,"body":"Meddler, since you are already here, I hope that you can read and respond to this little rant of mine.\n\nPlease keep this change. This is a simple matter of \"clarity\" as Riot has been choosing to call it recently.  The Animation cancelling that Riven can exploit the way she does is, correct me if I'm wrong, and unintended function. Therefore, people who know of and how to cancel the ability animations will automatically have an advantage over those who don't. Just like people who knew the timers of the jungle camps had an edge over the junglers that didn't. This is a case of fighting the system, and there is no other champion that can exploit something like this. (I'm not counting flashing ability windups since any champion can do that.)\n\nMy biggest problem with this is that this kinda of animation cancelling is its non intuitive and leads to a large disparity in the speed of execution. A standard Riven combo, with out animation canceling can take about 6-8 seconds, where as if you can cancel the animations that same combo only takes about 2-3. That's a whole 4 seconds, which as we all know is a very long time in League.\n\nI think for \"clarity's sake\" that there are only two real options here, either A) Keep the change, or B) Lock Riven into her animations, and I don't think anyone wants the latter.\n\nI would really like to hear your opinions on the matter.","replies":[{"poster":"Raptamei","date":"2015-01-17T18:04:38.649+0000","up_votes":8,"down_votes":3,"body":"> [{quoted}](name=Chris Chris,realm=NA,application-id=3ErqAdtq,discussion-id=R12g5sUE,comment-id=000c001b,timestamp=2015-01-17T17:54:41.218+0000)\n>\n> Please keep this change. This is a simple matter of \"clarity\" as Riot has been choosing to call it recently.  The Animation cancelling that Riven can exploit the way she does is, correct me if I'm wrong, and unintended function. Therefore, people who know of and how to cancel the ability animations will automatically have an advantage over those who don't. Just like people who knew the timers of the jungle camps had an edge over the junglers that didn't.\n\nKnowledge is skill.\nBeing able to animation cancel is skill.\nIf you don't know how to do it, you deserve to lose vs someone who knows how to do it.\n\nStop trying to make the game easier.","replies":[]}]},{"poster":"xyl","date":"2015-01-17T16:36:55.207+0000","up_votes":3,"down_votes":0,"body":"Please don't make these changes. Making a champion that has one of the highest skill caps in the game easier is not healthy for a game. There is no reason for this change at all and It's really going to frustrate allot of riven mains who spent hours trying to master animation canceling, which btw is apart of rivens skillcap and imo mastering how to do that can be very enjoyable as its definitely what separates good riven players from great one's as far as mechanics. There's no reason for this change at all! PLEASE RIOT DON'T TOUCH RIVEN","replies":[]},{"poster":"The ShadowSider","date":"2015-01-17T13:01:11.921+0000","up_votes":10,"down_votes":9,"body":"***","replies":[{"poster":"DoubleSummon","date":"2015-01-17T13:07:30.138+0000","up_votes":5,"down_votes":3,"body":"> [{quoted}](name=The ShadowSider,realm=NA,application-id=3ErqAdtq,discussion-id=R12g5sUE,comment-id=000c000b,timestamp=2015-01-17T13:01:11.921+0000)\n>\n> As a {{champion:92}}  main, i think this change in is overall kind of bad, plus i'm just kind of scared of what will happen after.\n> \n> Now for those who play her a lot, we all know that if you want to win fights, you gotta do combos as fast as possible with Animation canceling. Of course with this change you remove an ''exploit'' which requiered more *Apm* (**Some skill**) thus lowering her BASIC skillcap by a little (It is still mechanics). This is already a nerf of skillcap, and or even a waste of time for those who practiced the canceling for hours. \n> \n> To learn her you still need a lot I know that, but still...    (matchups, build paths, ult combo,  {{item:3077}} / {{item:3074}}  combo... etc)\n> \n>  By making this change new Riven players will be able to make* Q*s really fast and auto attack almost instant. Litteraly making double the damage by *Right click + Q *compared to the live for those who weren't able to make canceling happen.\n> \n> If you guys at riot want to give all Riven players the gift of ''***Animation canceling god***'' by reducing the *Q+AA* combo by 2 second, don't nerf her damage right after. Won't make any sense.\n> \n> Making this change  is a buff of dps for unskilled / low skilled players only, for such a champion in with deep mechanics in general is kind of... the contrary?\n> \n> If she is nerfed because of this change, this will affect Higher player in diamond for a problem low as the tier Dirt VII.\n> \n> (*Sorry for my bad english if I did mistakes*).\n\nI think Riven has more to it than that skill.. she really got a lot more tricks than that and it makes her less sluggish to play if you don't just rememer to press outside it was a bug after all..\nit will also hurt those cocky Riven mains :D","replies":[{"poster":"Valiant Yordle","date":"2015-01-17T15:47:14.105+0000","up_votes":11,"down_votes":8,"body":"Riven is one of my main champions, and I've never even heard of Q animation canceling.\n\n I'm really good with Riven because I've mastered things like roaming at opportune times, watching enemy jungle timers to catch the enemy jungler in his/her jungle, baiting the enemy junglers into bad ganks in my minion waves, backing off at low health then hiding in bushes and surprising my lane opponent while they farm, baiting non-piercing skillshots by standing at the edge of minion waves then using Valor to jump back behind the wave, and timing both activations of Blade of the Exile.\n\nRiven is a fascinating champion defined by immense power spikes that allow you to reverse poor landing phases and games, or cement a lead in either lane or game.\n\nShe is not, in the slightest, a cool champion because there is an unintentional exploit that barely anyone knows about, is very hard to learn, and heavily penalizes people with low ping.","replies":[]}]}]},{"poster":"GigglesO","date":"2015-01-19T00:06:30.843+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=R12g5sUE,comment-id=000c,timestamp=2015-01-17T08:35:22.113+0000)\n>\n> This is an unexpected change from some of the fixes in 5.1 to Overlapping CC effects (Riven's lockouts, which were blocking her from auto attacking automatically at once previously, use some of the same system that governs CC). We're going to look at this and discuss what the appropriate course of action is start of next week, will keep you folks posted.\n\nCan we just remove her until it is fixed? Just like zz'rot portal and mao?","replies":[]},{"poster":"Raptamei","date":"2015-01-17T09:48:28.283+0000","up_votes":4,"down_votes":17,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=R12g5sUE,comment-id=000c,timestamp=2015-01-17T08:35:22.113+0000)\n>\n> This is an unexpected change from some of the fixes in 5.1 to Overlapping CC effects (Riven's lockouts, which were blocking her from auto attacking automatically at once previously, use some of the same system that governs CC). We're going to look at this and discuss what the appropriate course of action is start of next week, will keep you folks posted.\n\n**NERF RIVEN SHE HAS 4 CC ABILITIES THATS MORE THAN NAUTILUS**\n\nEdit: whoooooooosh x12","replies":[{"poster":"Electro522","date":"2015-01-17T10:27:40.096+0000","up_votes":4,"down_votes":0,"body":"...\n\nShe has 2, both of which are extremely short. Nautilus does have 4 (you forgot his passive), all of which take for fricken ever to complete.","replies":[{"poster":"Raptamei","date":"2015-01-17T18:03:29.793+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Paleo Electro,realm=NA,application-id=3ErqAdtq,discussion-id=R12g5sUE,comment-id=000c00060000,timestamp=2015-01-17T10:27:40.096+0000)\n>\n> ...\n> \n> She has 2, both of which are extremely short. Nautilus does have 4 (you forgot his passive), all of which take for fricken ever to complete.\n\n*sigh*\n\nMeddler said she ccs herself after every Q. And since people like to QQ that Riven is OP because she has \"4 gapclosers\", I said she has \"4 cc abilities\".\n\n{{champion:32}}","replies":[{"poster":"Electro522","date":"2015-01-17T21:45:50.479+0000","up_votes":1,"down_votes":1,"body":"Then, either everyone misunderstood you, or you misunderstood the term \"cc\". cc is Crowd Control, or any ability that takes away a certain amount of power from your opponent. Gapclosers can be a form of crowd control (such as Nautilus, Blitz, or Thresh Q), but in Riven's case, her gapclosers generally aren't her crowd control (her third Q does have a small knockup, but it is nowhere near as useful as her stun).","replies":[{"poster":"Raptamei","date":"2015-01-18T01:50:16.202+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Paleo Electro,realm=NA,application-id=3ErqAdtq,discussion-id=R12g5sUE,comment-id=000c0006000000000000,timestamp=2015-01-17T21:45:50.479+0000)\n>\n> Then, either everyone misunderstood you, or you misunderstood the term \"cc\". cc is Crowd Control, or any ability that takes away a certain amount of power from your opponent. Gapclosers can be a form of crowd control (such as Nautilus, Blitz, or Thresh Q), but in Riven's case, her gapclosers generally aren't her crowd control (her third Q does have a small knockup, but it is nowhere near as useful as her stun).\n\nWhoooooooooooooooooooooooooooooooooooooooooosh.","replies":[{"poster":"Electro522","date":"2015-01-18T02:40:28.686+0000","up_votes":2,"down_votes":0,"body":"Wow. *facepalm* I'm sorry, I thought you were being serious, and apparently, a lot of other people thought so too.\n\nI completely misread your second comment. If I had read it correctly, I wouldn't have made my second comment.\n\nBut hey, can you blame me? Its slightly difficult to take sarcasm sometimes on the internet.","replies":[]}]}]}]}]}]}]},{"poster":"Caezium","date":"2015-01-17T05:48:16.594+0000","up_votes":30,"down_votes":8,"body":"Making Riven easier sounds like she will become problematic at all elos... /again/...","replies":[{"poster":"Diostukos","date":"2015-01-17T06:31:15.283+0000","up_votes":5,"down_votes":4,"body":"> [{quoted}](name=Caezium,realm=NA,application-id=3ErqAdtq,discussion-id=R12g5sUE,comment-id=0003,timestamp=2015-01-17T05:48:16.594+0000)\n>\n> Making Riven easier sounds like she will become problematic at all elos... /again/...\n\nYour icon is adorable. Source?","replies":[{"poster":"Gahlo","date":"2015-01-17T09:00:51.256+0000","up_votes":5,"down_votes":2,"body":"Too early to tell if sarcasm... The icon was gained through putting a serial code into the store that was given out on stream during S2WC Finals. The icon is the cross-guard area of Championship Riven's sword, with the highlighted 2 for \"Season 2.\"","replies":[]}]}]},{"poster":"kirbyzama","date":"2015-01-17T07:18:13.207+0000","up_votes":30,"down_votes":10,"body":"As it stands with the aa reset combo as it is makes the burst/trade potential of good Riven's and new Riven's far too wide. If you play Garen or Jax and you do a full spell rotation you deal the same dmg in the same time from bronze to diamond. Riven is the only champ who has her damage potential gated so hard by animation cancels. By removing it Riot can actually balance Riven if they so feel in ways that don't alienate new  players from her by reducing their possible damage in fear of how strong Riven is in a skilled hand.\n\nBut by all means ignore me and continue reveling in hyperbole.","replies":[{"poster":"Dantilq","date":"2015-01-17T09:04:53.137+0000","up_votes":11,"down_votes":2,"body":"This was exactly my first thought as well. Riven is pretty much like two different champions depending on who plays her. With all animation-canceling she get EXTREMELY fast, and her burst is insane. She becomes an assassin, that kills you while you are stunned.\nA player that can't do all the animaton-cancelings she is more of a Melee DPS type of champ, that deals good damage, but no extreme burst.\n\nRight now she is decently balanced, but not overly fun to play against if it's a good player playing her, and kinda weak as a Melee DPS in the hands of a bad player.","replies":[]},{"poster":"Rinky Dinky","date":"2015-01-17T13:31:52.971+0000","up_votes":6,"down_votes":1,"body":"Common Sense has spoken~\n\nLooks like Riot might actually be trying to balance their game. That might sound bitchy but, lets be honest, this game is a mess right now.\n\nAt least they fixed adc's. Almost all of them are being played besides Quinn, MF, and Urgot.","replies":[]}]},{"poster":"Ashes Arise","date":"2015-01-17T05:42:07.898+0000","up_votes":31,"down_votes":15,"body":"To be fair. Using animation canceling on her Q was practically an exploit. This change just allows people who don't play that way to actually be able to use Riven viably.","replies":[]},{"poster":"Darth Pixy Misa","date":"2015-01-17T05:53:08.624+0000","up_votes":11,"down_votes":32,"body":"riven still has no sustain, average base stats, and does not teamfight well","replies":[]}]}