{"poster":"Toa of Death","date":"2015-08-05T19:40:48.502+0000","title":"Riot, Your Reasoning for Never Wanting to Make Sandbox Mode is Ridiculous","subforum":"Gameplay","up_votes":279,"down_votes":24,"body":"\"Just playing a game of League is all the practice you need\" is what you're basically saying. That&#039;s like saying \"You can&#039;t just shoot free throws, just play a full game of basketball.\" No, I&#039;m sorry but that is some of the worst logic I&#039;ve ever seen from game devs.","replies":[{"poster":"Koldheartedjsp","date":"2015-08-05T19:44:09.987+0000","up_votes":51,"down_votes":9,"body":"They're reasoning makes sense\n\nwhy put money into something that will net 0 profit return?\n\nThe reasoning they gave us is bullshit i agree entirely","replies":[{"poster":"Saianna","date":"2015-08-06T00:44:11.754+0000","up_votes":22,"down_votes":3,"body":"(their)\n\nGrammar Nazi out!","replies":[{"poster":"HeadHonchkrow","date":"2015-08-06T00:48:33.523+0000","up_votes":3,"down_votes":2,"body":"Heil the Grammar Nazis","replies":[{"poster":"blueberrypancake","date":"2015-08-06T01:35:03.191+0000","up_votes":3,"down_votes":1,"body":"Rito is now to gestapo\n\nIt had to come to this\n\nHave fun with HoN 2.0\n\nWith 2000% More Bullshit","replies":[]}]}]},{"poster":"Sam VC","date":"2015-08-06T06:09:12.341+0000","up_votes":6,"down_votes":0,"body":"What's interesting to me is the potential of a well made sandbox mode from a business perspective seems incredible.\n\nImagine a sandbox mode alongside a Scenario Creators akin to Age of Empires or  StarCraft. On the one hand, die hard competitive players get to improve at an unprecedented rate, investing more time (and hoepfully money) into the system. If you're worried about a Bronze player feeling even more bronze, readjust the ladder system to rebalance the amount of players in each tier of play.\n\nBut where the real money would be is in the solo scenario generator. Imagine a tower defense game with the LoL cast, or a single (or multi!) player campaign, steeped in lore about your favorite champion. Imagine how many casual, and I emphasize this market, players would love this kind of content?\n\nNow imagine how much money a first party, official, scenario or campaign would bring in? How much are customers willing to pay to play through a campaign about Teemo, Vayne, Draven, or Katarina? Five dollars a chapter? One dollar a mission? This is a giant stack of cash waiting to be scooped up. And it solves problems in the process!\n\n(So please, steal my idea, take ALL the money I just made you, and invest in servers for the replay system of our dreams!)","replies":[{"poster":"Mistress Madoka","date":"2015-08-06T15:35:17.023+0000","up_votes":1,"down_votes":0,"body":"Eww, that sounds like paying for mods, and that [ALWAYS goes](https://steamcommunity.com/workshop/aboutpaidcontent) [over well](http://www.pcgamer.com/paid-mods-are-dead-pc-gamer-reacts/)","replies":[{"poster":"ahferroin7","date":"2015-08-06T16:44:34.065+0000","up_votes":2,"down_votes":0,"body":"No, it's paying for DLC, which is still a thriving business.","replies":[]}]}]},{"poster":"KillerPingPong","date":"2015-08-07T20:33:26.716+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Koldheartedjsp,realm=NA,application-id=3ErqAdtq,discussion-id=hGT6Ks8b,comment-id=0002,timestamp=2015-08-05T19:44:09.987+0000)\n>\n> They're reasoning makes sense\n> \n> why put money into something that will net 0 profit return?\n> \n> The reasoning they gave us is bullshit i agree entirely\n\nI agree, To major companies such as Riot, they mostly want money so I imagine if they introduced Sandbox mode they would probably make you pay RP, because they will get no money if they made it free.","replies":[]}]},{"poster":"MrBuffington","date":"2015-08-05T20:53:57.454+0000","up_votes":34,"down_votes":0,"body":"> While there are very real skills one can develop in a hyperbolic time chamber, we never want that to be an expectation added onto an already high barrier to entry. On an individual level, we know this isn’t always true – some just want a space to practice flashing over walls without having to wait at least 3.6 minutes in between – but when that benefit is weighed against the risk of Sandbox mode ‘grinding’ becoming an expectation, we just can’t accept the tradeoff.\n\nThat's the part that gets me; Sandbox mode grinding *is* already an expectation for many players, just instead of sandbox mode you just load up a custom and wait the downtime anyways. I've spent hours loading into custom games by myself just to practice CSing, flash mechanics, etc. because it's more efficient that loading into a game, hoping I get the role/champion I want to practice, and trying a lvl 3 Flash + Q as Vi and oh look, I messed up and fed the enemy top double buffs and now they're snowballing out of control and I have to wait another 20+ minutes to queue up for another game to try another lvl 3 Flash + Q gank.\n\nThat's the thing about this game; they don't want people grinding? *The game is already a grind*. You grind for IP for champions and runes. You grind in solo q every day to try to rank up. Heck, in every game you're grinding for CS in order to buy your first few items to even begin to play the actual game.\n\nI don't think a decent 'sandbox mode' would even take that much effort. If they added a \"Cheats Enabled\" box (something that many games have) when setting up custom games with like, four options (Infinite gold, EXP gain off including minions/monsters staying the same strength, 90% CDR including summoners, mana/energy costs off), that would solve most of people's issues as far as practice goes. It's basically just URF mode with the ability to change some settings.\n\nHonestly I'm not that miffed that they're not working on a sandbox mode; customs and bot games work decent enough for practice. I also don't see grinding in a Sandbox mode becoming an expectation; if players aren't willing to do it in customs or bot games (or even normals), where you're playing the game still, I don't see those players jumping into a dedicated game mode to practice CSing or flash mechanics. I just can't make sense of the reasoning \"We don't want you grinding in sandbox mode, so go grind in normal games\"\n\nI think the real reason is also the reason why they're not going to make URF a permanent part of the game, or why they hardly put work in Dominion or 3v3; it pulls too much attention away from your standard 5v5 summoner's rift.","replies":[]},{"poster":"Voidgolem","date":"2015-08-05T19:41:41.158+0000","up_votes":17,"down_votes":2,"body":"the reason they don't want to make a sandbox mode is there's about a 99.98% chance of it being exploitable in non-sandbox modes.\n\nbecause coded as minions.","replies":[{"poster":"Ace Access ","date":"2015-08-06T13:14:05.116+0000","up_votes":1,"down_votes":3,"body":"can't they umm I don't know..... fix the code ?","replies":[{"poster":"ahferroin7","date":"2015-08-06T16:46:19.761+0000","up_votes":2,"down_votes":0,"body":"Easier said than done, especially considering how long league has been around (core rule of programming, the longer people have been working on a piece of code, the harder it becomes to maintain).","replies":[]}]},{"poster":"Champion Skin","date":"2015-08-06T12:38:38.214+0000","up_votes":1,"down_votes":0,"body":"Players: Could we please have a sandbox or practice mode?\n\nRiot: We have minion code... so no","replies":[]}]},{"poster":"TheI3igDaddy","date":"2015-08-06T02:12:08.241+0000","up_votes":11,"down_votes":1,"body":"Daily reminder that leaving the game and never coming back might be the only way to truly wake Riot up.","replies":[{"poster":"46104328_DEL","date":"2015-08-06T02:12:42.566+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=TheI3igDaddy,realm=NA,application-id=3ErqAdtq,discussion-id=hGT6Ks8b,comment-id=000b,timestamp=2015-08-06T02:12:08.241+0000)\n>\n> Daily reminder that leaving the game and never coming back might be the only way to truly wake Riot up.\n\nAgreed, Shame the community creates such cool things...","replies":[{"poster":"Serlthree","date":"2015-08-06T02:41:20.092+0000","up_votes":3,"down_votes":0,"body":"Riot is already a major endorser of Esports, not sure that's gonna happen soon","replies":[{"poster":"TheI3igDaddy","date":"2015-08-07T01:58:30.912+0000","up_votes":1,"down_votes":0,"body":"And what % of the League community watches Esports? Not trying to attack you, I'm genuinely curious about it. Sure they want to make LoL Esports a thing, but there are still tons of players who don't give a shit about it, and probably never will.\n\nI could only watch about half of a split before I got bored out of my fucking mind, because it was all the same. Including the bans, there were a consistent 15-20 champions picked, every game, until some meta shift changed some of the names. Nobody, especially in the American scene, tries new things. It's always 'let's play whatever's just stronger number-wise', because they don't do it for entertainment, they do it for money. \n\nAnd because they're so into Esports, namely Summoner's Rift 5v5, you'll never see Ranked TT or Dominon. We're almost at season 6 and still only one ranked mode. It's retarded. \n\nWhich brings me back to my earlier post. If you truly upset at how Riot doesn't cater to you, the potential paying customer, leave. Sometimes doing that will hit them harder then by constantly raising your voice about it.","replies":[]}]}]}]},{"poster":"Ipressbutton","date":"2015-08-05T22:41:51.779+0000","up_votes":8,"down_votes":0,"body":"Sandbox would be fun for custom game modes. I mean, valve is going all out with dota 2, even to the point of allowing custom maps. I think more companies should encourage this sort of thing. After all, MOBA's did evolve out of the starcraft / warcraft map editor","replies":[{"poster":"ElJanitorFrank","date":"2015-08-06T00:40:14.100+0000","up_votes":4,"down_votes":0,"body":"\"Going all out\" \"allowing custom maps\".\n\nDotA was originally a custom map :P\n\nValve was just slow in that regard.","replies":[]}]},{"poster":"TheFirstGokun","date":"2015-08-06T10:31:16.545+0000","up_votes":2,"down_votes":4,"body":"Play Custom.\nPlay Bots.\nWhat does Sandbox really provide in terms of training and improvement?","replies":[{"poster":"Tusutaki","date":"2015-08-06T10:40:06.118+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=TheFirstGokun,realm=NA,application-id=3ErqAdtq,discussion-id=hGT6Ks8b,comment-id=0011,timestamp=2015-08-06T10:31:16.545+0000)\n>\n> Play Custom.\n> Play Bots.\n> What does Sandbox really provide in terms of training and improvement?\n\nTesting out builds without wasting a lot of time\nTest and play out any scenarios you can think of\nPracticing aiming and dodging skill shots\nHave a better understanding of minion control \nAdjusting variables to better understand outcomes \nPracticing mechanics without the hindrance time\n\nMust it really be spelled out for you? Why is it that 100% of the fighting games have a practice mode? Why is it that majority of the top tier players practice in practice/sandbox mode than vs CPUs?","replies":[{"poster":"TheFirstGokun","date":"2015-08-06T11:20:39.788+0000","up_votes":2,"down_votes":2,"body":"Testing out builds against what? So Sandbox mode has custom bots that you build any way you want? That sounds reasonable and totally not a waste of time, especially considering how many different ways to build there are. While you think this will help you test out builds, the usefulness of that experience is pretty much moot. So much complexity in build paths such as power spikes, farming time, the opposing team composition, early game dominance or failure, etc. mean that testing out a final build in Sandbox mode do nothing other than let you play with whatever toys you have. Every game of League is different and every build path you decide on must be tailored to fit the situation, so it's better to learn from Normals than Sandbox.\n\nDodging and aiming skillshots can be done simply enough in a custom game with one other friend (I doubt the AI for this mode would be incredibly realistic, but we can dream). The only problem would probably be cooldowns, but aside from ultimates and flashes there is no huge difference.\n\nHaving a better understanding of minion control comes best from a custom game with either friends or normals. True experience in this can only come from actually playing against another human being who is also trying to control the minion wave, unless we have an AI specifically tailored to controlling the minion wave.\n\nAdjusting variables to better understand outcomes... how the hell is this supposed to work. There's a million variables in every teamfight, split second to split second, which are much easier to theorize than adjust ingame.\n\nPracticing mechanics without the hindrance time. Like what? Aiming a Rumble ultimate? Flashing a wall? There are other champions who can help with flash mechanics training such as Lucian (Relentless Pursuit), Graves (Quickdraw), and Ekko (Phase Dive), all with dashes that pass terrain and travel 425-325 units (Flash is 425 units). Reactive Barriers? Janna and Lulu can help with that. What mechanics are you talking about, because if these were essential you would have found a way around them.\n\nFighting games have practice modes because it's a 1 on 1 battle; there are less variables affecting everything there. League is a lot more strategically complex, while mechanically simpler, so it doesn't all come down to whether you got that extra hit in on your lane opponent, but it does come down to whether you've responded to the enemy's build paths and team composition accordingly. This comes down to theory rather than practice. If you really need to practice EVERY TOPLANE MATCHUP POSSIBLE, find a friend and play a custom.\n\nIn conclusion, Sandbox mode isn't a necessity, not because it doesn't generate profit but because it sucks resources out of any other area which actually needs improvement. You can claim that it wouldn't take any time at all, that they can just hire and setup a whole new division to cater to this one specific need, but it just doesn't matter.","replies":[{"poster":"Tusutaki","date":"2015-08-06T12:01:35.613+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=TheFirstGokun,realm=NA,application-id=3ErqAdtq,discussion-id=hGT6Ks8b,comment-id=001100000000,timestamp=2015-08-06T11:20:39.788+0000)\n>\n> Testing out builds against what? So Sandbox mode has custom bots that you build any way you want? That sounds reasonable and totally not a waste of time, especially considering how many different ways to build there are. While you think this will help you test out builds, the usefulness of that experience is pretty much moot. So much complexity in build paths such as power spikes, farming time, the opposing team composition, early game dominance or failure, etc. mean that testing out a final build in Sandbox mode do nothing other than let you play with whatever toys you have. Every game of League is different and every build path you decide on must be tailored to fit the situation, so it's better to learn from Normals than Sandbox.\n> \n\nOr you can play sandbox mode with friends. Doesnt always have to be with bots. Since, you know, sandbox would be used for better practicing and understanding, and perfecting multiple scenarios which would greatly benefit ranked teams. \n\n> Dodging and aiming skillshots can be done simply enough in a custom game with one other friend (I doubt the AI for this mode would be incredibly realistic, but we can dream). The only problem would probably be cooldowns, but aside from ultimates and flashes there is no huge difference.\n\nCooldowns, Mana, itemization that affects the two. \n\n> Having a better understanding of minion control comes best from a custom game with either friends or normals. True experience in this can only come from actually playing against another human being who is also trying to control the minion wave, unless we have an AI specifically tailored to controlling the minion wave.\n> \n\nOr just have the option to control the amount of minions and reset if you want to perfect it.\n\n\n> Adjusting variables to better understand outcomes... how the hell is this supposed to work. There's a million variables in every teamfight, split second to split second, which are much easier to theorize than adjust ingame.\n> \n\nWhat is having unlimited amounts of gold and increase or decrease levels at will? Better understanding of game knowledge. Which those millions of variables can be easily replicated in sandbox. \n\n> Practicing mechanics without the hindrance time. Like what? Aiming a Rumble ultimate? Flashing a wall? There are other champions who can help with flash mechanics training such as Lucian (Relentless Pursuit), Graves (Quickdraw), and Ekko (Phase Dive), all with dashes that pass terrain and travel 425-325 units (Flash is 425 units). Reactive Barriers? Janna and Lulu can help with that. What mechanics are you talking about, because if these were essential you would have found a way around them.\n> \n\nWaiting for the amount of gold to buy and test out an item or build, cool downs such as flash and flashing over walls with champions that has a bigger hitbox than your said champs. Oh and a better understanding hitboxes in general. With mechanics in general, well about everything you can get better at. All without having restraints \n\n> Fighting games have practice modes because it's a 1 on 1 battle; there are less variables affecting everything there. League is a lot more strategically complex, while mechanically simpler, so it doesn't all come down to whether you got that extra hit in on your lane opponent, but it does come down to whether you've responded to the enemy's build paths and team composition accordingly. This comes down to theory rather than practice. If you really need to practice EVERY TOPLANE MATCHUP POSSIBLE, find a friend and play a custom.\n> \n\nYou're simply just not understanding and just assuming it would just only be used by one person in the mode when in fact it could have all 10 players. And all of which you listed could all be covered via by sandbox mode. But since you dont like the fighting game analogy for some reason how about every team sports in existence? Same principle applies.\n\n> In conclusion, Sandbox mode isn't a necessity, not because it doesn't generate profit but because it sucks resources out of any other area which actually needs improvement. You can claim that it wouldn't take any time at all, that they can just hire and setup a whole new division to cater to this one specific need, but it just doesn't matter.\n\nYou say it sucks resources when they practically use it everytime for champion spotlight. \n\nYou really need to stop looking at the surface and actually think and understand why sandbox mode would be a great benefit.  Why is it that DOTA2 and Hero's of the Storm has this mode but League refuses?","replies":[{"poster":"TheFirstGokun","date":"2015-08-06T12:29:15.397+0000","up_votes":2,"down_votes":0,"body":"After reading your explanation, it makes a lot of sense :/\nI feel kinda dumb about not realizing the implications of this mode. Apologies.","replies":[{"poster":"ahferroin7","date":"2015-08-06T16:49:56.628+0000","up_votes":1,"down_votes":0,"body":"Wow, someone actually apologizing on the forums, I need to get a permalink.","replies":[{"poster":"TheFirstGokun","date":"2015-08-06T19:52:45.940+0000","up_votes":1,"down_votes":0,"body":"I try to stay humble. It helps for coping when someone's argument is clearly better than mine.","replies":[{"poster":"LFG","date":"2015-08-07T03:09:31.614+0000","up_votes":1,"down_votes":0,"body":"Dont worry im still with your reasoning \n\nThe game doesnt play as you wish all the time\nSometime you can set towards it but its difficult with alot of variables such as number of trolls in your team, trolls on enemy team or fed one in their team. You need to act accordingly\nLeague is not a scenario game, dont expect something to happen same as always like you practiced, things can go wrong and you learn from your mistake","replies":[]}]}]}]}]}]}]}]},{"poster":"Nameless Voice","date":"2015-08-05T19:42:58.305+0000","up_votes":2,"down_votes":3,"body":"They didn't say they never want it, they listed the problems with it and the reason why they don't feel it's worth spending months of solid coding from multiple developers to make this feature at the expense of other features that they could instead make in that time.","replies":[{"poster":"Renaille","date":"2015-08-06T00:42:49.619+0000","up_votes":8,"down_votes":3,"body":"> [{quoted}](name=Nameless Voice,realm=EUW,application-id=3ErqAdtq,discussion-id=hGT6Ks8b,comment-id=0001,timestamp=2015-08-05T19:42:58.305+0000)\n>\n> They didn't say they never want it, they listed the problems with it and the reason why they don't feel it's worth spending months of solid coding from multiple developers to make this feature at the expense of other features that they could instead make in that time.\n\n\nI call bullshit, They already invested tons of resources from multiple developers to make something that people don't want. the Fiora VU and the HUD","replies":[{"poster":"Nameless Voice","date":"2015-08-06T01:04:56.815+0000","up_votes":6,"down_votes":0,"body":"Things that *some people don't want*.\n\nYes, all those people who hate them just come onto the boards, reddit, etc. and say how much they hate it (often not saying *why* they hate it), but that's because people who feel strongly about something are far more likely to be vocal.\n\nI've seen lots of threads previously where people complained that Fiora's kit (especially her ult) didn't fit the champion's theme and wasn't fun to play against.  Clearly those people wanted a Fiora rework (though I have no idea if they wanted this particular one.)\n\nThe HUD?  A lot of people asked for things like team ultimate timers, freeing up the bottom-left corner of the screen so that it doesn't block a part of the game space, and other things.\nWas the initial HUD full of problems?  Yes.  Does it still have some problems?  Yes.\n\nBut you can't say no one asked for it.  People wanted these things.  Maybe people aren't happy with the results, and that's fair, but you can't say no one wanted them in the first place.","replies":[]}]},{"poster":"Mistress Madoka","date":"2015-08-06T15:40:19.854+0000","up_votes":1,"down_votes":0,"body":"They already have a Sandbox Mode. It's how they make their Champion Spotlights","replies":[]}]},{"poster":"AkiocCZKgm","date":"2015-08-06T03:01:27.338+0000","up_votes":1,"down_votes":0,"body":"Isn't league of legends f2p?","replies":[{"poster":"Toa of Death","date":"2015-08-06T03:13:17.062+0000","up_votes":5,"down_votes":0,"body":"Free to pay.","replies":[{"poster":"YumaS2Astral","date":"2015-08-06T10:32:08.059+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Toa of Death,realm=NA,application-id=3ErqAdtq,discussion-id=hGT6Ks8b,comment-id=000c0000,timestamp=2015-08-06T03:13:17.062+0000)\n>\n> Free to pay.\n\nLoL is technically free to play but they do a lot of things that, in the end, just encourage players to spend a lot of money. For example, the price of runes and champions is so high that you are essentially encouraged to buy champions and rune pages with RP so that you can save your money for runes.\n\nLoL is a game that doesn't technically force you to pay to win, but makes it so that if you can pay, you will be ahead of those who can't.","replies":[]},{"poster":"Ancestor007","date":"2015-08-06T07:42:54.051+0000","up_votes":2,"down_votes":0,"body":"Hearthstone life...","replies":[]}]}]},{"poster":"DesertFox","date":"2015-08-06T01:45:14.030+0000","up_votes":6,"down_votes":1,"body":"Riot's post TL;DR version:\n\"Alright guys, it's true that we could give players the Sandbox mode everyone asked for 5 years ago, or we can just try to sell more junk to you guys. Oh but cheer up! Here's a good ol' long wall of text explaining why we felt that something as mainstream Sandbox is going to completely destroy LoL.\"","replies":[]},{"poster":"Bonly","date":"2015-08-06T02:09:07.741+0000","up_votes":4,"down_votes":0,"body":"Hey Riot, your game already forces us to grind the current sandbox mode every season when you update the jungle. Instead of doing 10 jungle routes in an hour with my slow load time, a sandbox mode would let me do that in 30 minutes. That's REMOVING half of the already required grind.","replies":[]},{"poster":"Learnding","date":"2015-08-06T00:45:09.626+0000","up_votes":5,"down_votes":1,"body":"I don't even know why we have a custom game lobby.","replies":[]},{"poster":"Temptation Tan","date":"2015-08-06T06:51:45.645+0000","up_votes":3,"down_votes":0,"body":"I want sandbox mode","replies":[]},{"poster":"bahamutkaiser","date":"2015-08-06T06:03:00.807+0000","up_votes":3,"down_votes":0,"body":"Money is going into the wrong places. Where is it going?, Esports, it has to be advertised and catered to in order to sustain and maintain relevancy. Meanwhile, the game suffers.\n\nThe Esports agenda is fine, it's not okay to fail other qualities. Imagine if RTS games didn't have single player modes to aquatint you to all the units and challenges gradually? Sandbox mode may not be a necessity, but their justification is nonsense and there needs to be a superior learning experience beside competition.\n\nLet me think of ANY physical sport where the only allowed practice is engaging in competition... Gee, and this is a game that wants to foster it's Esport culture, failure. Some discounts are self defeating.","replies":[]},{"poster":"junglerboy16","date":"2015-08-06T14:51:37.610+0000","up_votes":4,"down_votes":1,"body":"I bet that 4 years from now when Riot releases a sandbox mode, they'll be like \"yeah, we would have implemented it sooner except for community backlash that it would force grinding. We're happy that the public perception of this mode has changed appropriately for us to implement this amazing feature.\"","replies":[]},{"poster":"unskilledplayer1","date":"2015-08-07T10:38:24.041+0000","up_votes":2,"down_votes":0,"body":"\"Why make something that no-one will play and will eventually die out\"\n\n\n\nWhy do Twisted Treeline and Dominion still exist, huh Riot? Fucking idiots.","replies":[]},{"poster":"Ace Access ","date":"2015-08-06T13:12:40.241+0000","up_votes":2,"down_votes":0,"body":"makes more than 10s of millions in revenue each year\nspends money on teams to make new skins and champs\n\ncan't afford to make sandbox mode for players to practice or even a decent tutorial","replies":[]},{"poster":"Big Reddit Plays","date":"2016-01-24T00:20:14.370+0000","up_votes":1,"down_votes":0,"body":"What does \"sandbox mode\" mean?","replies":[]},{"poster":"Lmeowzers","date":"2015-08-07T09:23:16.529+0000","up_votes":1,"down_votes":0,"body":"While I do believe that a Sandbox Mode would be extremely useful for some people that actually want to take advantage and practice a few things, I don't think their reasoning is really wrong.\n\nThere are many things I would love to practice without having to wait for dumb things like \"Cooldowns,\" A very common one, which walls you can jump over on specific champs with their abilities. Or which walls are actually flashable, And then find out the perfect spot to actually use that ability to get across terrain quickly. It'd be great to practice these things. \n\n**I think it'd be great to _practice a few things._**\n\nBut I believe that this may create a situation that is current in those Co-op vs AI games. \n\nI have some people I know (and used to know) that played **nothing but** games that were not Summoners Rift, mostly Co-op vs AI players. Their reasoning, like many others, is because they knew they were preform terribly in a real game, so they decided to keep hiding in Co-op vs AI games and other games modes, hoping to improve in the game in those game modes. \n\nNow I'm not saying there's a problem with this,  but no player that actually _wants_ to improve will gain anything from anything that's not a real Summoners Rift game. This being said, I'm sure it can be related back into Sandbox Mode. People may create a way of thinking, that they will suddenly get good at the game just from spending time in **Sandbox Mode** which, remember, is **_not a real game of League of Legends._** Just like the other game modes, people may just get sucked into this one and never come out, and if they do, they would not have gained as much experience as they could have gained if they played a real match. \n\nPeople might think by spending a lot of time in Sandbox Mode, that they will improve just because they learned a few more mechanics on a few champions, but being able to apply that to a real game is what is much more important if you want to improve. \n\nThe main point of that was, people should not have to rely too much on Sandbox Mode, because it may end up just trapping people inside this new gamemode and no progress would be made. \n\n**But this isn't the only problem that may occur**\n\nA little quick one, a problem that may come up with Sandbox mode, is that it might be too much fun! I'm sure it has to (or should be) like customs, and you can invite and have people join you. This will just create a bunch of people playing Sandbox Mode in customs, and instead of actually doing what Riot (probably) intended for, has now become a new fun gamemode for everyone to play in, instead of it being a place where you can practice skills. Which leads into less people getting sucked into customs and Co-op vs AI games and also not creating a person's skill progression.\n\n(Please keep in mind I assume that people who play League of Legends actually want to improve, though I know there are a few who purely play for fun, my perspective League of Legends is being a place where people want to get better at the game, and have fun when you know how to play the game)","replies":[]},{"poster":"Narog","date":"2015-08-07T00:55:47.759+0000","up_votes":1,"down_votes":0,"body":"Riot could make up a better excuse that they have gave anyways.","replies":[]},{"poster":"Lucian Shot 2pac","date":"2015-08-06T20:43:35.749+0000","up_votes":1,"down_votes":0,"body":"When Riot doesn't listen to what the players want.","replies":[]},{"poster":"diamondlight","date":"2015-08-06T17:58:08.462+0000","up_votes":1,"down_votes":0,"body":"\"Please foul me, I need to practice free throws!!\"","replies":[]},{"poster":"steampig","date":"2015-08-06T15:16:57.500+0000","up_votes":1,"down_votes":0,"body":"Because you might have to play a dozen full games of basketball just to practice 20 free throws.  And all your teammates will be pissed at you for not having learned before.  And you might NEVER get to practice a certain move until you need it, at which point you'll fail miserably because you haven't practiced it.","replies":[]},{"poster":"iainB85","date":"2015-08-06T03:26:59.139+0000","up_votes":1,"down_votes":0,"body":"100% Agree","replies":[]}]}