{"poster":"AufDenZac","date":"2016-11-13T19:09:40.800+0000","title":"Perma bann aus spass","subforum":"Hilfe & Support","up_votes":1,"down_votes":8,"body":"hey leute ich hab ne wichtige frage und zwar wollten ein paar leute (meine freunde) mich perma bannen aus spass  hierzu mal eine geschichte:vor einem monat ca. habe ich bei nem freund gebettelt das er mir ein lee skin kauft (akolyth) auf das versprechen das ich ihm arcade ezreal kaufe was ich dann auch in einer woche wo ich mir ne paysi geholt habe getan habe ... richtiges deutsch ? XD \r\n\r\nauf jeden fall ein paar monate sp&auml;ter sagten sie mir in skype (jetzt grade) das sie ein ticket an riot geschrieben haben und zwar da sie das grade als scamm gemeldet haben und der grund warum sie mich perma bann haben wollten war der: &quot;macht uns halt spass lol&quot; ich bin halt ein ziemlicher league suchti und habe angst um meinen account weil ich da auch zeit reingesteckt habe ... nun meine frage : w&auml;re ein perma bann wirklich realistisch ? und kann ich mich irgendwie verteidigen ich habe auch schon ein ticket an riot geschrieben und die geschichte erz&auml;hlt nun bin ich hier danke f&uuml;r jegliche hilfe","replies":[{"poster":"gamerman3000","date":"2016-11-13T19:15:15.622+0000","up_votes":3,"down_votes":0,"body":"Nein, so wie ich das versteh hast du ihm doch den Skin auch gegeben, also ist das doch kein scam?\nUnd wenn du denen das nicht gegeben hättest sind sie halt selbst schuld wenn sie so dumm sind und sich scammen lassen. Ist mir auch schon passiert :pp\nIch würd die aufjedenfall blocken","replies":[]},{"poster":"Haudruppmoor","date":"2016-11-14T09:01:46.213+0000","up_votes":2,"down_votes":0,"body":"Kein Wunder wenn es beim Support mal wieder länger dauert, wenn hier solche Kinderspielchen abgezogen werden. \n\n{{sticker:slayer-jinx-unamused}} \n\nIch wär für ne Einführung einer Strafe, wenn mit irgendwelchen unberechtigten Behauptungen ein Bann von einem Mate beim Supp eingefordert wird. Wenn man aus Spass die Polizei oder Feuerwehr ruft, dann muß man ja auch Strafe zahlen !\n\nUnd da fragen sich einige hier echt noch , warum die vom Supp am Anfang immer nur Copy-Paste-Antworten bekommen ! Ne,ne,ne -roll eyes-","replies":[]},{"poster":"AufDenZac","date":"2016-11-14T16:51:04.473+0000","up_votes":1,"down_votes":0,"body":"danke für die hilfe bis jetzt von allen dachte das dauert erstmal bevor die ersten antworten kommen","replies":[]},{"poster":"AufDenZac","date":"2016-11-13T19:18:29.869+0000","up_votes":1,"down_votes":1,"body":"hab ich auch ich bin halt echt so ein internet fettsack der keine freunde hat :/","replies":[{"poster":"OT Riku","date":"2016-11-13T20:01:32.099+0000","up_votes":1,"down_votes":1,"body":"Erstens ist es nicht schlimm etwas dicker zu sein, aber wenn du Internet süchtig bist, was hoffentlich nicht so ist such dir Hilfe das kann schnell mal schlimm enden.\nAber du wirst wegen Sowas höchstwahrscheinlich niemals gebannt.","replies":[{"poster":"AufDenZac","date":"2016-11-14T16:11:51.529+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ChaosRiku,realm=EUW,application-id=7hciEY9w,discussion-id=oGld1Mq8,comment-id=00020000,timestamp=2016-11-13T20:01:32.099+0000)\n>\n> Erstens ist es nicht schlimm etwas dicker zu sein, aber wenn du Internet süchtig bist, was hoffentlich nicht so ist such dir Hilfe das kann schnell mal schlimm enden.\n> Aber du wirst wegen Sowas höchstwahrscheinlich niemals gebannt.\n\nnein das war eigentlich so als klischee gemeint haha XD aber fett bin ich trozdem aber hab kein prob damit man soll ja so leben wie man es mag nicht wahr ^^","replies":[]}]}]},{"poster":"RAG Ryve","date":"2016-11-14T00:58:02.845+0000","up_votes":1,"down_votes":0,"body":"Da kann garnichts passieren. Reports ohne Beweise sind nur Platzpatronen und werden nichtmal eines Blickes gewürdigt bei Riot.\nDeine Mates kriegen ne 08/15 Antwort vom Support die sie sich einrahmen lassen können um sie anzusehen und zu weinen.","replies":[]},{"poster":"AufDenZac","date":"2016-11-13T19:25:45.827+0000","up_votes":1,"down_votes":0,"body":"oh vieln dank das meinte ich halt auch zu den beiden aber die sagen \"ja das kann ja ein bestechungs versuch sein  je nach ansicht halt\" ich hab jetzt erstmal weniger angst danke schön die haben gesagt das sie morgen ne email von riot bekommen","replies":[]},{"poster":"AufDenZac","date":"2016-11-13T19:20:18.065+0000","up_votes":1,"down_votes":1,"body":"habe trozdem angst um meinen account weil ich da einfach zeit reingesteckt habe können die mich dafür bannen ?","replies":[{"poster":"Crounty","date":"2016-11-13T19:24:30.506+0000","up_votes":1,"down_votes":0,"body":"1. Du wirst wegen so etwas nicht gebannt weil das versprechen außerhalb von LoL war und wenn du in dem aller seltensten Fall gebannt werden solltest, dann kannst du immer noch anhand der Gifting History zeigen, dass du ihm den Skin zurück geschenkt hast\n\nhttp://image.prntscr.com/image/54c90ffe378f4a5aa88c45ab38478c65.png\n\nSo sieht die z.B aus","replies":[]}]},{"poster":"ClAO KAKAO","date":"2016-11-13T19:12:03.933+0000","up_votes":1,"down_votes":0,"body":"Hahahahaha wtf\nSuch dir richtige Freunde","replies":[]}]}