{"poster":"Tharazz I","date":"2015-04-28T16:38:45.989+0000","title":"Loss not prevented?","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"Zweites Game in Folge haben mehrere Spieler gleichzeitig Verbindungsprobleme und lags. Das erste Spiel konnte ich nach einem Verbindungsabbruch nicht mehr beitreten und habe 20 Punkte verloren. Das Zweite Spiel ebenfalls 2 Mitspieler Verindungsprobleme und unter 20min verloren, ebenfalls Punkte verloren und gleichzeitig eine Strafe f&uuml;r eine eingeschraenke Warteschlange der naechsten f&uuml;nf Spiele bekommen. Kann mir bitte jemand erklaeren warum die Warteschlange f&uuml;r gewertete Spiele nicht deaktiviert wird? Und noch wichtiger warum die Spiele als verloren gewertet werden?\r\nDanke im vorraus \r\n\r\nMfG Tharazz I","replies":[{"poster":"Śjokz","date":"2015-04-28T19:16:15.688+0000","up_votes":1,"down_votes":0,"body":"wurde loss prevented nicht abgeschafft?\nden hatte schon games in dieser season wo ich und freunde dc'ed sind und auch mal das komplette gegnerteam + unsers. haben trotzdem punkte verloren + ne verwarnung für afk, wir haben alle unterschiedliche anbieter benutzt und internet hat ansonsten auch einwandfrei funktioniert. haben den support angeschrieben und er meinte ja es sei ein fehler von riot gewesen aber wir haben halt pech gehabt punkte werden nicht zurückerstattet, müssen wa halt mit leben... (also die antwort war nicht wort-wörtlich so hatte aber den gleichen sinn) bin gespannt wieviel LP riot uns diesmal abzieht den im moment haben ich undn kumpel wieder solch ein problem, game taucht nich inna history auf, können nicht reconnecten ins game udn laut diversen seiten sind wa in keinem game, laut clienten aber schon, als es das letzte mal so war gabs LP abzug udn ne verwarnung.. find ich ehrlich gesagt scheiße, es passiert zwra im gegensatz zu season 3 & 4 relativ selten nurnoch, aber damals gabs wenigstens n loss forgiven oder loss prevented","replies":[]},{"poster":"Sree","date":"2015-04-28T16:50:25.301+0000","up_votes":1,"down_votes":0,"body":"Loss Prevented gibt es nur bei serverweiten Problemen. Das gleiche gilt fuer die Deaktivierung der Ranglistenspiele.\nWenn beispielsweise die Telekom gerade Probleme haette, die Spieler zu den Servern zu verbinden, dann sind das\n1. Probleme, die Riot nichtmal direkt betreffen und\n2. Probleme, die Riot erstmal gar nicht bemerkt, ausser dadurch, dass mehr Spieler als ueblich den Spielen nicht beitreten und\n3. Probleme, von denen nur ein Bruchteil der Spieler auf EuW betroffen sind.\n\nSolche Probleme sind aergerlich, aber da kann Riot nur wenig machen. Man kann nicht jedes Mal fuer den ganzen Server Loss Prevented anmachen, nur weil irgendein lokaler Anbieter gerade Probleme hat. Dann waere Loss Prevented rund um die Uhr aktiviert.\n\nIch wollte damit ueberigens nicht sagen, dass die Telekom gerade Probleme hat. Das war ein rein fiktives Beispiel, fuer ein Problem, bei dem kein Loss Prevented aktiviert wird.","replies":[{"poster":"Tharazz I","date":"2015-04-28T16:59:11.866+0000","up_votes":1,"down_votes":0,"body":"Alles klar dann waren es wohl Probleme eines Anbieters. Ja es ist wirklich Aergerlich, denn ich werde für Sachen bestraft für die ich nichts kann. Wie auch immer danke für die schnelle und hilfreiche Antwort.\n\nMfG Tharazz I","replies":[{"poster":"Sirrkas","date":"2015-04-28T17:11:30.976+0000","up_votes":1,"down_votes":0,"body":"Welchen Anbieter hast du denn? Ich hatte gerade ähnliche Probleme. Ich konnte alles sehen und verzögert schreiben aber nicht den Champion kontrollieren. Bei mir ist es Kabel Deutschland.","replies":[]}]}]}]}