{"poster":"Lones","date":"2015-09-05T14:48:16.346+0000","title":"Rassismus","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":4,"body":"Zu sowas f&auml;llt mir nichts mehr ein.","replies":[{"poster":"Maexle","date":"2015-09-05T16:43:20.181+0000","up_votes":4,"down_votes":0,"body":"Hmm... dein Score scheint ja nicht so gut zu sein... naja im nächsten Spiel wird es bestimmt wieder besser ;)\n\nAlso ich würde die Leute auch einfach nur blocken und reporten und überhaupt nicht auf diese Aussagen eingehen... Das ist immer die beste Lösung {{champion:17}}","replies":[]},{"poster":"eingew","date":"2015-09-05T14:58:34.055+0000","up_votes":2,"down_votes":1,"body":"Für \"Offensive Language\" Reporten, in den Kasten schreiben wie Rassistisch die Spieler waren und auf den 2 Wochenban für diese Spieler warten. Das fällt mir dazu ein.","replies":[{"poster":"crit in ur anus","date":"2015-09-05T15:24:21.618+0000","up_votes":1,"down_votes":2,"body":"in extremfällen sogar ein perma jenachdem was das player behavior team denkt^^","replies":[{"poster":"eingew","date":"2015-09-05T15:50:23.504+0000","up_votes":2,"down_votes":1,"body":"Die Meinung des PB-Teams ist herzlich egal, über die Härte der Tat entscheidet die Community :P","replies":[{"poster":"crit in ur anus","date":"2015-09-05T15:55:27.910+0000","up_votes":1,"down_votes":2,"body":"ja aber wir haben nix zu sagen über bann längen etc... tribunal down etc... von daher wird das PB team das beurteilen und handeln","replies":[{"poster":"eingew","date":"2015-09-05T15:57:59.785+0000","up_votes":2,"down_votes":1,"body":"Jein. Das PB-Team hat eine Chatanalyse geschaffen, welche sämtliche alten Tribunalfälle kennt und anhand derer die Toxicness der neuen Fälle festlegt. Das heißt ja, das PB-Team legt die Strafen fest, aber es sind wir, welche festlegen, welches Verhalten wie toxisch ist, oder ob es überhaupt toxisch ist.","replies":[{"poster":"Spicavius","date":"2015-09-05T16:08:36.648+0000","up_votes":2,"down_votes":0,"body":"Hmm Damals wurde aber niemals das Wort \"C.ancer\" benutzt. Inwiefern das jetzt erkannt wird (wenn es nach den Tribunalfällen geht) weiß ich jetzt nicht. Habe aber vollstes Vetrauen, dass auch das geahndet wird.\n\nNur leider hatte ich vorgestern einen Spieler, der sich über das Team beschwert wie schlecht wir doch alle sind und wir sollten laut ihm alle Krebs kriegen und daran verrecken.\nNiemand aus dem Team hat ihm geantwortet, außer mal ein \"muted\".  Leider sehe ich, dass er immer noch spielen kann und leider hat dieser Spieler immernoch viele Honors (300+).\nDas finde ich ist ein derber Rückschlag für das System und mein Vertrauen in dieses. :/\n\nDa kann man auch nicht mehr von \"schlechtem\" Tag sprechen. Das ist einfach nur ein 2 Wochenbann wert. Da gibt es garkeine Diskussion darüber.","replies":[]},{"poster":"crit in ur anus","date":"2015-09-05T16:07:08.048+0000","up_votes":2,"down_votes":0,"body":"trozdem kann es sein das dass PB team sich einen fall ansieht und entscheidet härtere strafen zu geben als das autobann system ;)Lyte>PB team>Autobann System","replies":[]}]}]}]}]}]},{"poster":"Kaitri","date":"2015-09-05T14:58:22.461+0000","up_votes":2,"down_votes":0,"body":"blocken und reporten fällt mir dazu ein :/","replies":[]},{"poster":"Fututor2710","date":"2015-09-05T15:09:56.947+0000","up_votes":1,"down_votes":0,"body":"Ich würde diesen Link (um ehrlich zu sein) direkt an riot schicken, denn DAS ist ja wirklich total übertrieben","replies":[{"poster":"eingew","date":"2015-09-05T15:50:52.961+0000","up_votes":1,"down_votes":0,"body":"Die werden nichts tun. Warum auch, wenn es doch ganz einfach über die Ingame-Reports geregelt werden kann?","replies":[]}]},{"poster":"Hu3ter","date":"2015-09-05T14:57:13.980+0000","up_votes":2,"down_votes":2,"body":"Also ich bann immer Ekko, Karma und Lucian.","replies":[]}]}