{"poster":"MahmudGetsYoAss","date":"2018-10-07T12:46:13.213+0000","title":"Ich brauche eine kleine Expertise bezüglich meiner MMR Situation :(","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Ja der Punkt ist, dass ich ganz komisch LP bekomme. Ich war G5 und habe am Anfang 20 LP bekommen, und bekam immer weniger. Dann bin ich jetzt G4 und habe es relativ Straight geschafft, allerdings bekomme ich jetzt hardcore wenig LP :/\r\n\r\nIch hatte einmal schon mal so ein Problemchen, da habe ich mir kurz downgeranked und dann wieder auf den vorigen Rank und meine MMR war normal. Sollte ich das wieder versuchen oder nicht. Habt ihr irgendwelche Tipps meine MMR wieder in den Griff zu kriegen.","replies":[{"poster":"Clint Beastwood","date":"2018-10-07T13:06:13.077+0000","up_votes":1,"down_votes":2,"body":"Moin,\n\nWieviele Games bist du den schon dabei? ab 100 im ranked bist du ja Veteran und bekommst weniger Punkte.\nDas System ist ja soweit ich weiß so ausgelegt, dass wenn man zu viele Games und zu viel Zeit in einer Divison/Liga verbingt auch dorthin \"gehört\".\nD.h. du es also schwerer hast aufzusteigen. Das würde auch erklären, dass du mehr Punkte nach deinem Abstieg bekommen hast. Aus Erfahrung hatte ich die Probleme (ohne Veteran zu sein) immer in Silber 1, Gold 1. .. macht meiner Meinung aber auch Sinn.\nBin mir da aber auch nicht zu 100% sicher.\n\nGrüße","replies":[{"poster":"OT Riku","date":"2018-10-07T13:17:02.684+0000","up_votes":4,"down_votes":0,"body":"Die Bezeichnungen haben keine Auswirkung auf den LP gewinn.\n\nWenn du Beispielsweise, solange die Championselect verlässt bis du wieder auf 0 LP bist, sagen wir du gehst von knapp 90 LP aus.\nDann anfängst wieder zu gewinnen wirst du zweifelsfrei mehr LP bekommen wie vor dem verlassen der Cs. \nDie Bezeichnungen sind nichts weiter als eine kosmetische Sache. \n\nDas einzige was deinen LP gain beeinflusst ist die MMR von dir und deinem Team und die der Gegner.","replies":[]}]},{"poster":"Humpelstilzche","date":"2018-10-07T15:06:10.829+0000","up_votes":3,"down_votes":0,"body":"> Habt ihr irgendwelche Tipps meine MMR wieder in den Griff zu kriegen.\n\nSpiele gewinnen. \n\nVergiss LP und Ligen und all den Käse, es gibt keine geheimen Tricks oder Kniffe, um schneller aufzusteigen und es gibt auch keine mysteriösen oder geheimen Gründe, warum man nicht aufsteigt. \nAm Ende läuft es immer auf genau eine Sache und NUR diese Sache hinaus: Du musst einen möglichst großen Anteil deiner Spiele gewinnen. Was anderes kannst und musst du nicht tun, es ist das einzige was zählt. \nJeder Gedanke den du dir darüber machst warum genau du jetzt so und so viel LP bekommst oder verlierst, ist verschwendet, denn die Schlussfolgerung ist immer die selbe: Gewinne Spiele.","replies":[{"poster":"MahmudGetsYoAss","date":"2018-10-07T15:32:40.926+0000","up_votes":1,"down_votes":0,"body":"Ziemlich klare Antwort. Thx.","replies":[]}]}]}