{"poster":"Zesc","date":"2018-01-30T01:09:54.112+0000","title":"Mi problema en general con el sistema de reportes (debate)","subforum":"Charlas Generales","up_votes":4,"down_votes":2,"body":"Habiendo visto el v&iacute;deo de deportividad y escuchando lo que se explica, me dio la sensaci&oacute;n de que no hay nada nuevo.\r\n\r\nLo unico que veo que se enfocan es si un jugador insulta, y sinceramente, es lo de menos. Es lo de menos porque uno puede mutear, es lo de menos porque es facil de detectar y castigar. \r\n\r\nLos casos con los que me encontre durante estas 2 semanas fueron.\r\n\r\n* - Afk\r\n* - ADC master yi (trollpick)\r\n* - Instalock (blindpick, 2 casos de 4 partidas)\r\n* - no hacer caso al equipo (el mas complejo).\r\n* - gente que murio 11 veces porque era &quot;mala&quot;.\r\n\r\nTengo print screen de algunos de los casos, pero con el tiempo los borro, porque nunca los castigan, no se si es falta de pruebas o lo que sea, porque ni siquiera hay alguna devolucion de lo que vos reportaste en soporte, y eso que  tienen una replay del jugador en donde pueden ver todo lo que sucede, junto con el chat.\r\n\r\nEntiendo que no se justifica el que anda diciendo &quot;mogolico&quot; en una partida, pero tambien acepten un poco la realidad de su juego, pretenden que la gente no pueda salirse de la sala sin recibir una penalizacion de tiempo, pretenden que la gente juegue esto como un deporte pero no son claros con las normas.\r\n\r\n&quot;puedo usar el campeon que quiera donde quiera?&quot;\r\n&quot;puedo no juntarme con el equipo y seguir farmeando como autista mi linea&quot;\r\n&quot;puedo ser sup con smite?&quot;\r\n\r\nentre otras cosas....\r\n\r\nEl tema del ELO boost, soy un plata 3, nunca en mi vida encontre a alguien elo boosteando que me haya hecho sentir que la partida era imposible de ganar,  y creo que deben ser los menos, para mi enfocarse en encontrar a la gente que comparte cuenta, no va a hacer el juego menos toxico, veo mas a la gente quejandose de un troll o un afk que de un smurf en su liga, el soporte hace cosas, pero creo que no estan enfoncandose en la raiz del problema.\r\n\r\nPor ultimo, a un jugador que dice 1 vez algun insulto fuerte, lo banean durante 3 dias inmediatamente, a un jugador que sale 0/11/0 en una partida, no lo castigan porque no saben si jugo &quot;mal&quot;... Basicamente podes suicidarte en 1 de cada X cantidad de partidas en donde nadie va a poder justificar tu castigo.\r\n\r\nLa toxicidad del juego va a bajar en el momento en el que **este ** **problema ** se resuelva, porque es un circulo vicioso, entras a jugar tu partida, alguien pickea algo muy poco convencional y no podes salirte de la sala, entras a la partida haces tu mejor esfuerzo para no morir y esta persona con su pick poco convencional ya murio 2 veces, seguis concentrandote en lo tuyo, juntas farm,  entras en tu primera pelea de equipo y por mas pins que hagas esta persona que murio un par de veces , se niega a hacer caso a lo que le pide el equipo, empezas a perder TF tras TF, le decis &quot;che pedazo de **** juntate, asi no nos tiran todo&quot; &quot;/all report tal por flammer&quot;. y eso es la pelea mas comun que me encuentro en las partidas...","replies":[{"poster":"StąrDust","date":"2018-01-30T01:37:02.365+0000","up_votes":1,"down_votes":0,"body":"Es q hay casos diferentes, por ejemplo el del feeder 0/11/0 le puede pasar a cualquiera que tenga una mala partida Y está probando champs o no lo conoce en su totalidad, eso en normal te lo acepto (que para eso están y muchos no lo entienden a esto) pero en ranked lo reporto. Acá hay que hacer algo, por eso me parece que debe volver el report por \"jugador sin habilidad\" y cuando llega a una determinada cantidad de reportes de este tipo se le prohíba jugar en ranked por X cantidad de partidas, así aprovechan para practicar en normales antes de volver a rankear.\n\nCon el tema de los offmeta no importa mucho si es una normal, pero si es ranked y muere más de 15 veces es un troll y ahí hay que reportarlo por muerte intencional y actitud negativa, pero no en \"jugador sin habilidad\",hay que diferenciarlo (si es que aplican este tipo de report). Es importante no flammear porque te puede jugar en contra.\n\nPor los autopicks para mí deberían poner el modo blind pick como el modo reclutamiento pero sin bans de champs, pero el problema sería que aumentará el tiempo en buscar partidas.\n\nPor el tema de los jugadores que no hacen caso a sus aliados, hay que pedirle amablemente que les haga caso, si se niega hay que reportarlo por actitud negativa, no queda otra.","replies":[{"poster":"Zesc","date":"2018-01-30T01:51:27.726+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=lLukazl,realm=LAS,application-id=v7qsfXsE,discussion-id=7N3vFtNd,comment-id=0000,timestamp=2018-01-30T01:37:02.365+0000)\n>\n> Es q hay casos diferentes, por ejemplo el del feeder 0/11/0 le puede pasar a cualquiera que tenga una mala partida Y está probando champs o no lo conoce en su totalidad, eso en normal te lo acepto (que para eso están y muchos no lo entienden a esto) pero en ranked lo reporto. Acá hay que hacer algo, por eso me parece que debe volver el report por &quot;jugador sin habilidad&quot; y cuando llega a una determinada cantidad de reportes de este tipo se le prohíba jugar en ranked por X cantidad de partidas, así aprovechan para practicar en normales antes de volver a rankear.\n> \n> Con el tema de los offmeta no importa mucho si es una normal, pero si es ranked y muere más de 15 veces es un troll y ahí hay que reportarlo por muerte intencional y actitud negativa, pero no en &quot;jugador sin habilidad&quot;,hay que diferenciarlo (si es que aplican este tipo de report). Es importante no flammear porque te puede jugar en contra.\n> \n> Por los autopicks para mí deberían poner el modo blind pick como el modo reclutamiento pero sin bans de champs, pero el problema sería que aumentará el tiempo en buscar partidas.\n> \n> Por el tema de los jugadores que no hacen caso a sus aliados, hay que pedirle amablemente que les haga caso, si se niega hay que reportarlo por actitud negativa, no queda otra.\n\nEso no hace nada, es exactamente lo que digo,   cuando se yo que eso es actitud negativa?, cada vez que reporto y no banean a esa persona mi reporte pierde valor, como hago yo entonces? , por un lado te piden que reportes , por otro le bajan la importancia a tu report por ser \"poco efectivo\", entonces  lo unico que funciona este sistema es para reportar a alguien que insulta.  El master yi que me toco en ranked de adc, que lo unico que hacia era poner jajaja en el chat, no tuvo ningun tipo de castigo, los 2 instalockers que me cruce hoy en blindpick, no tuvieron ningun tipo de castigo, entonces esto es lo mismo que siempre. Pretenden que la gente se insulte menos sin arreglar la raiz del problema, y eso genera solo mas frustracion, por eso la creacion de multicuentas.\n","replies":[{"poster":"EdGeinTexas","date":"2018-01-30T21:08:39.793+0000","up_votes":2,"down_votes":0,"body":"Ya es así lol , tendrías que darle menos importancia a los flamers y tratar de prestarle atencion a los trolls y los que dijiste vos, encima esta etapa es en la que van a entrar mas ñiños al juego , y bueno , va a ser un quilombo.","replies":[]}]}]},{"poster":"azulwashere","date":"2018-01-30T03:36:17.490+0000","up_votes":1,"down_votes":0,"body":"A mi una vez se me ocurrió una idea, a la cual tal vez haya que pulir, pero la idea es la siguiente:\n\nQue la clasificación de champs se haga por el rol que te toca. Si, ya se que algo de esto hay, pero a lo que voy es que tendrían que evaluar cada campeón y decir \"si, es viable que vaya esta linea por esto por aquello y esto otro\". Una vez hecho esto arreglaría las colas de reclutamiento para que cuando te toque, por ejemplo soporte, sólo puedas pickear campeones de soporte y que dentro de la selecc de campeón puedas intercambiar roles con alguien más. Algo como el intercambiar champ con alguien, pero de roles, haciendo que tu pool de champs cambie automáticamente.\n\nA mi parecer, esto reduciría los trolles en partida, los \"si no voy mid trolleo\" etc. No es la forma de erradicarlos, pero sí considero que bajaría notablemente. \nEstoy conciente que a mi idea hay que pulirle muchas cosas, si alguien está interesado en aportar a la causa, puede hacerlo! No creo que sea de interes por riot, pero tal vez a alguien alguna vez se le ocurrió algo parecido, o esté en desacuerdo y pueda mostrarme sus puntos de vista!","replies":[{"poster":"Deigex","date":"2018-01-30T14:58:17.386+0000","up_votes":1,"down_votes":0,"body":"No sirve lo que planteas porque el que un campeón sea viable en un rol no es por como se,creo originalme ( leona era jg) ahora podes cruzarte una zyra jg y es viable.\n\nDepende del meta e ingenio de los jugadores.","replies":[{"poster":"EdGeinTexas","date":"2018-01-30T21:05:14.082+0000","up_votes":2,"down_votes":0,"body":"Bueno , pero tipo elegir twisted fate o taliyha jungla es obvio que o la gana de pedo o el team lo carrea , tendria que tener mucha suerte de poder ir bien en el rol en el que eligio  si fue con los champs que te mencione antes , y mas si nose , si te toca enfrentar un warwick o un maestro yi jungla , pero bueno , hay que probar champs esta bien , pero tener un poco de conciencia en lo que vas a hacer o como vas a idear un \"plan\".","replies":[{"poster":"Deigex","date":"2018-01-30T23:09:16.275+0000","up_votes":1,"down_votes":0,"body":"Habia gente challenger que jugaba tf jungla hace un par de seasons. Esto es a lo que voy, lo que para vos parece troll, no tiene sentido y \"gana de pedo o lo carrean\" no es cierto en todos los casos. Si me nombras a syndra sola desde mi punto de vista es inútil en la jg pero capaz alguien la hace rendir en soloq, tf es más que viable. Es más del otro lado hay gente que juega Evelynn mid, yo mismo la jugué ayer en br que es el servidor donde me encuentro jugando y stompee. No podes cerrar campeones a roles cuando riot quiere todo lo contrario y cada vez busca que los campeones se puedan usar de más formas aunque  sea menos efectivo que en su rol principal.\n\nQue un campeón sirva o no depende del jugador que lo utilice\ny que sea utilizado en las situaciones donde pueden ser útiles dichos picks  ( hay mil campeones para cada línea y muchos no se usan porque no sirven con el meta o estan por detrás pero en casos puntuales contra ciertos picks del meta siguen siendo buenos)","replies":[{"poster":"Zesc","date":"2018-01-30T23:18:36.514+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Deigex,realm=LAS,application-id=v7qsfXsE,discussion-id=7N3vFtNd,comment-id=0002000000010000,timestamp=2018-01-30T23:09:16.275+0000)\n>\n> Habia gente challenger que jugaba tf jungla hace un par de seasons. Esto es a lo que voy, lo que para vos parece troll, no tiene sentido y &quot;gana de pedo o lo carrean&quot; no es cierto en todos los casos. Si me nombras a syndra sola desde mi punto de vista es inútil en la jg pero capaz alguien la hace rendir en soloq, tf es más que viable. Es más del otro lado hay gente que juega Evelynn mid, yo mismo la jugué ayer en br que es el servidor donde me encuentro jugando y stompee. No podes cerrar campeones a roles cuando riot quiere todo lo contrario y cada vez busca que los campeones se puedan usar de más formas aunque  sea menos efectivo que en su rol principal.\n> \n> Que un campeón sirva o no depende del jugador que lo utilice\n> y que sea utilizado en las situaciones donde pueden ser útiles dichos picks  ( hay mil campeones para cada línea y muchos no se usan porque no sirven con el meta o estan por detrás pero en casos puntuales contra ciertos picks del meta siguen siendo buenos)\n\nEstas jugando un partido de futbol, tenes a tu compañero que esta en frente del arco y en vez de patear quiere hacer 3 jueguitos y cabezearla como vio en un video de youtube. Por hacer eso no anota, que te crees que le va a hacer el director tecnico?, lo va a sacar, sus amigos lo van a insultar, lo que pasa en cualquier deporte. Uno tiene que tener nocion de que no es \"juego lo que quiero y donde quiero\".\n\nPorque creeme que si esa syndra jg hace buenos ganks, ayuda a empujar las lineas y puede hacer objetivos, nadie se va a quejar de nada.\n\nYo estoy a favor de los picks pocos convencionales, lo que digo es que el sistema no castiga a personas que en vez de hacer eso buscan hacer un pick para que alguien se salga de la sala, o para \"trolear\".  Solo basta con ver el historial de un master yi adc con 5 derrotas consecutivas y que no fue baneado, que en los reportes no sabes exactamente en donde reportarlo, y que para colmo si en esa partida vos lo insultas, vos te comes un ban casi inmediato. Entonces Riot quiere evitar que se insulte tanto en el juego, pero la respuesta no es solo banear a todos, no es evitar el elo boost... no es ponerle asteriscos al \"izi\".... La solucion es evitar que 1 solo jugador tenga el poder de arruinarle la partida a los otros 4.","replies":[]}]}]},{"poster":"azulwashere","date":"2018-01-30T20:18:31.928+0000","up_votes":1,"down_votes":0,"body":"Si pero yo no digo que se los ponga en un solo rol. Cada campeón tendría que ser estudiado a fondo y decir \"ok, es viable leona jungla? supp? y adc? realmente puede ir como adc?\" \n\nEntiendo que el \"meta\" cambia, pero mi idea sería cambiar solamente las de reclutamiento, no las de selec oculta. Y me parecía bueno como una forma de ver qué pasa si encasillas a los jugadores en lineas específicas, como una forma de poder medir si, por ejemplo, los troles de selec de champ que autolockean o amenazan con trollear se reducen :).","replies":[{"poster":"Deigex","date":"2018-01-30T23:12:48.108+0000","up_votes":1,"down_votes":0,"body":"Eso solo lograria estancar el juego. El lol no evoluciona por riot sino por sus jugadores probando cosas. No existiría la mf support por tu modo de pensar el juego sería monótono,  una caja cerrada que la gente dejaría de jugar al cabo de un tiempo.\n\nEl que quiere trollear lo va a hacer con cualquier pick, el autolock sólo existe en blind pick y es el modo de juego menos competitivo que existe, cada uno elije si jugar blind o no.","replies":[]}]}]}]},{"poster":"Deigex","date":"2018-01-30T14:54:12.897+0000","up_votes":1,"down_votes":0,"body":"\"puedo no juntarme con el equipo y seguir farmeando como autista mi linea\" \n\nSi si sos un splitpusher podes tranquilamente, es culpa del equipo si siguen haciendo tf 4v5 y no hacer caso al equipo no es reportable en soloq sino el negarte a comunicarte que son cosas distintas. \n\nAutolock en blind pick? Normal game? Existe normal draft.\n\nTroll picks? Perdí contra uno de los otp mordekaiser challenger  en flex  de adc,  vi mil yasuo adc no sólo en normal, no hay que confundir adc con tirador y aún así podrías ir teemo por serlo.\n\nA veces intear no es sinónimo de trollear. Hay que ver si realmente se está tirando a morir o perdió en early y no puede hacer nada. (El top de mi team ha perdido inhib de top min 12 en finales de un torneo después de una mala jugada y cuando volvió con tp a Lane volvió a morir y era imposible pararlo luego.)","replies":[{"poster":"Zesc","date":"2018-01-30T23:31:23.215+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Deigex,realm=LAS,application-id=v7qsfXsE,discussion-id=7N3vFtNd,comment-id=0003,timestamp=2018-01-30T14:54:12.897+0000)\n>\n> &quot;puedo no juntarme con el equipo y seguir farmeando como autista mi linea&quot; \n> \n> Si si sos un splitpusher podes tranquilamente, es culpa del equipo si siguen haciendo tf 4v5 y no hacer caso al equipo no es reportable en soloq sino el negarte a comunicarte que son cosas distintas. \n> \n> Autolock en blind pick? Normal game? Existe normal draft.\n> \n> Troll picks? Perdí contra uno de los otp mordekaiser challenger  en flex  de adc,  vi mil yasuo adc no sólo en normal, no hay que confundir adc con tirador y aún así podrías ir teemo por serlo.\n> \n> A veces intear no es sinónimo de trollear. Hay que ver si realmente se está tirando a morir o perdió en early y no puede hacer nada. (El top de mi team ha perdido inhib de top min 12 en finales de un torneo después de una mala jugada y cuando volvió con tp a Lane volvió a morir y era imposible pararlo luego.)\n\nNo hablamos de teams y torneos, hablas de soloQ donde no se organiza nada. Si vos estas jugando con personas que no estan aceptando tu estrategia, trata de hacerle caso a la mayoria, o explicaselos por chat, ponerse en modo autista no sirve.\n\nSi sacan blindpick solucionan la mayoria de los problemas, draftpick no esta siempre. Uno piensa \"bueno, pero la gente puede no entrar en blindpick\", pero esto no sucede, entonces tenes gente que entra a blindpick, no puede elegir su linea, se ofende, y dice \"voy mid igual\", eso es una actitud completamente antideportiva.\n\nEl trollpick existe, no importa el resultado de la partida, a veces te pueden intentar trolear y sin embargo ganas la partida 4vs5, eso no quita que la persona que los dejo 4vs5 por ser completamente inutil haya estado \"intentando\", no te pasa que cuando revisas el historial derrepente no tiene ninguna partida en donde juega ese champ en esa posicion?.\n\nDespues hay cosas que si se entienede, ver 1/10/2 en plata no es lo mismo que ver 1/10/2 en diamante, mas si ves que el resultado final de la partida es un 12-5 en el general.... lo que yo digo es que se deberian concentrar mas en detectar estos casos, y no en el eloboost, o en banear insultos (porque el sistema funciona casi a al a perfeccion).  Yo entiendo que la gente puede tener malas partidas , pueden tener picks pocos comunes, pero hay veces en donde simplemente cuando quieren ganar, no pickean esas cosas, juegan diferente, cuando se ofenden por algo y quieren perder tiene otro tipo de juego o derrepente les nace las ganas de \"expermientar\".","replies":[{"poster":"Deigex","date":"2018-01-30T23:57:11.216+0000","up_votes":2,"down_votes":0,"body":"El tema es que si juego un splitpusher no me voy a juntar con el team. Muchos no entienden como funcionan ciertos picks. Una de las formas más efectivas de ganar y subir elo es splitpusheando porque en soloq no hay equipos organizados para jugar alrededor de un splitpusher en el equipo enemigo. \n\nRespecto al hacer caso una de mis líneas principales es la jg actualmente  y si fuera por hacer caso hubiese perdido más de lo que he ganado. Desde cierto elo  tener alguien que pueda splittear después de tener una ventaja o que maneje ciertas rotaciones te da una ventaja mucho mayor que juntarte con el equipo el problema es que la mayoría de los jugadores no sabe que hacer durante las partidas, se creen que toda partida se gana juntandose cuando muchas veces no es óptimo. Que va a hacer en una tf un trynda? No es que sos siempre un maokai y las tf es donde más brillas. En soloq no podes intentar que tu equipo haga lo que vos quieras que además porque razón le haría caso a alguien que no es mejor que Yo? Todos intentan ganar a su forma en soloq algunos no podrán,  tendrán que mejorar,  cambiar su forma de juego y otros subirán pero depende de uno mismo y no de tu team.\n\nAl fin y al cabo gana el que se adapta como siempre.","replies":[{"poster":"Zesc","date":"2018-01-31T00:55:28.134+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Deigex,realm=LAS,application-id=v7qsfXsE,discussion-id=7N3vFtNd,comment-id=000300000000,timestamp=2018-01-30T23:57:11.216+0000)\n>\n> El tema es que si juego un splitpusher no me voy a juntar con el team. Muchos no entienden como funcionan ciertos picks. Una de las formas más efectivas de ganar y subir elo es splitpusheando porque en soloq no hay equipos organizados para jugar alrededor de un splitpusher en el equipo enemigo. \n> \n> Respecto al hacer caso una de mis líneas principales es la jg actualmente  y si fuera por hacer caso hubiese perdido más de lo que he ganado. Desde cierto elo  tener alguien que pueda splittear después de tener una ventaja o que maneje ciertas rotaciones te da una ventaja mucho mayor que juntarte con el equipo el problema es que la mayoría de los jugadores no sabe que hacer durante las partidas, se creen que toda partida se gana juntandose cuando muchas veces no es óptimo. Que va a hacer en una tf un trynda? No es que sos siempre un maokai y las tf es donde más brillas. En soloq no podes intentar que tu equipo haga lo que vos quieras que además porque razón le haría caso a alguien que no es mejor que Yo? Todos intentan ganar a su forma en soloq algunos no podrán,  tendrán que mejorar,  cambiar su forma de juego y otros subirán pero depende de uno mismo y no de tu team.\n> \n> Al fin y al cabo gana el que se adapta como siempre.\n\n Es verdad, en mi cabeza era otro el ejemplo. No todos saben splitpushear, y se podria decir que pueden defender su argumento diciendo \"intente splitpushear\".  Sin hablar de ejemplos en concreto, muchas veces se encaprichan en no hacer caso al equipo, a eso iba. Entiendo lo que decis y tenes toda la razon, no siempre la mayoria va a estar en lo correcto. \n\nMientras justo hablamos de eso, me toca este caso \"todos pueden pickear lo que quieran, en cualquier linea\", tengo un teemo que va teemo adc, porque instalockeo para ir top y yo tenia a fiora, se cambia el tp a ultimo segundo y va con ignite, arranca la partida va 3/6 y dice voy a trolear, se ausenta durante todas las peleas, pone los hongos en el medio de la jungla y queda ahi parado. Salio 4/11/4. Esto acaba de pasar. Este ejemplo es demasiado completo, pero estos son los casos a los que me refiero, el chabon no tiene un score que refleje que es un troll, sin este tipo no dijese por chat \"voy a trolear\", ni siquiera seria baneado (asumo que lo van a banear)., e ir teemo adc, puede ir porque esta intentando o \"probando un pick\" mentiraaa, busca arruinar la partida a las personas porque no gano top, esto es el ejemplo mas concreto que tengo.","replies":[]}]}]}]},{"poster":"xaxesis","date":"2018-01-30T01:41:07.531+0000","up_votes":1,"down_votes":2,"body":"lo de elegir campeones nunca se a sancionado puede ir el campeon que desee en la linea que sea a riot no le interesa solo le interesa que no se falten el respeto basicamente","replies":[{"poster":"Zesc","date":"2018-01-30T01:47:27.565+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=xaxesis,realm=LAS,application-id=v7qsfXsE,discussion-id=7N3vFtNd,comment-id=0001,timestamp=2018-01-30T01:41:07.531+0000)\n>\n> lo de elegir campeones nunca se a sancionado puede ir el campeon que desee en la linea que sea a riot no le interesa solo le interesa que no se falten el respeto basicamente\n\ndecile al singed support que iba con smite y lo banearon, y no banean aca cuando te toca un master yi adc....","replies":[{"poster":"xaxesis","date":"2018-01-30T04:45:42.911+0000","up_votes":2,"down_votes":1,"body":"amigo deje de desinformar ese singed no fue sancionado por elecion de campeon fue sancionado porque nunca estaba en su posicion y era un segundo jungla que roba el farm al jungla de este tema muchos post se han discutido \n\ndeje de desinformar a la gente","replies":[{"poster":"Zesc","date":"2018-01-30T14:16:52.204+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=xaxesis,realm=LAS,application-id=v7qsfXsE,discussion-id=7N3vFtNd,comment-id=000100000001,timestamp=2018-01-30T04:45:42.911+0000)\n>\n> amigo deje de desinformar ese singed no fue sancionado por elecion de campeon fue sancionado porque nunca estaba en su posicion y era un segundo jungla que roba el farm al jungla de este tema muchos post se han discutido \n> \n> deje de desinformar a la gente\n\nNunca estaba en su posicion?, pero el era el que tiraba los inhibidores, el era el que robaba la jg del otro team, la razon del ban era porque dejaba a su adc solo y punto, ya que este no podia \"disfrutar la partida\", le aclararon que si el jugaba duo con alguien en bot iba a poder mantener su estrategia. Porque el flaco llego a platino tranquilo, tenia un muy buen winrate y casi nunca moria. Por eso fue el gran escandolo, yo no desinforme nada amiguin. Y que se siga debatiendo muestra que no estan las reglas claras.\n\nY ademas no es mi punto lo que paso con singed, lo que digo es que no trazan una linea y que todo es segun cuanta gente se queje en ese momento... y que los insultos vienen a raiz de la impotencia que te da el mismo sistema, castigar a los que insultan esta bien, pero no por eso la gente va a insultar menos, en vez de concentrarse ahora en el elo boost y seguir con el tema de los insultos, lo unico que estaria bueno es que encuentren la manera de ser mas severos con los que mueren 11 veces en una partida, con los que se quedan dando vueltas en base, con los que derrepente juegan mal a proposito, con los que no hacen caso a los pins ni a lo que pide al equipo.","replies":[{"poster":"xaxesis","date":"2018-01-30T17:06:53.693+0000","up_votes":1,"down_votes":1,"body":"amigo este tema ya debatio en su momento y no lo van a llamar a usted para debatirlo de nuevo ese singed nunca fue baneado por eleccion de campeon ya que no existe sancion por eleccion para riot la eleccion de campeon sea la linea que sea es libertad del invocador si tiene dudas vaya a soporte a preguntarles\n\na ese singed lo sancionaron primero porque nunca estaba en su posicion y robaba la jungla enemiga y amiga haciendo el jungla del equipo no pudiera subir de nivel \n\ndebaja al adc solo en su posicion evitando asi que pudiera farmear \n\ntodos flameaban por su actitud\n\ny eso no es solo en una partida tuvo muuuuchas partidas donde su comportamiento era peor el video que usted vio fue una sola partida pero existieron muchas mas\n\nentienda usted que para riot su habilidad le importa un comino para riot lo importante es el respeto hacia los invocadores entre ellos que eso hace que muuuuchos abandonen el juego\n\nlo que usted dice de que jueguen mal aproposito si tiene quejas reportelo le haran seguimiento y listo si ven que el jugador es malo por naturaleza y falta de habilidad cree que lo van a sancionar por no saber jugar?\n\na riot le importa poco lo que usted sienta ya que es evidente que usted le gusta ganar y no peder y entienda en este juego se gana y se pierde tener invocadores que no le hagan ganar no significa que sean trolls porque los trolls son esos que flamean a los de poca habilidad\n\npor mas negativos que de usted no puede negar la verdad","replies":[{"poster":"Zesc","date":"2018-01-30T23:11:13.201+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=xaxesis,realm=LAS,application-id=v7qsfXsE,discussion-id=7N3vFtNd,comment-id=00010000000100000000,timestamp=2018-01-30T17:06:53.693+0000)\n>\n> amigo este tema ya debatio en su momento y no lo van a llamar a usted para debatirlo de nuevo ese singed nunca fue baneado por eleccion de campeon ya que no existe sancion por eleccion para riot la eleccion de campeon sea la linea que sea es libertad del invocador si tiene dudas vaya a soporte a preguntarles\n> \n> a ese singed lo sancionaron primero porque nunca estaba en su posicion y robaba la jungla enemiga y amiga haciendo el jungla del equipo no pudiera subir de nivel \n> \n> debaja al adc solo en su posicion evitando asi que pudiera farmear \n> \n> todos flameaban por su actitud\n> \n> y eso no es solo en una partida tuvo muuuuchas partidas donde su comportamiento era peor el video que usted vio fue una sola partida pero existieron muchas mas\n> \n> entienda usted que para riot su habilidad le importa un comino para riot lo importante es el respeto hacia los invocadores entre ellos que eso hace que muuuuchos abandonen el juego\n> \n> lo que usted dice de que jueguen mal aproposito si tiene quejas reportelo le haran seguimiento y listo si ven que el jugador es malo por naturaleza y falta de habilidad cree que lo van a sancionar por no saber jugar?\n> \n> a riot le importa poco lo que usted sienta ya que es evidente que usted le gusta ganar y no peder y entienda en este juego se gana y se pierde tener invocadores que no le hagan ganar no significa que sean trolls porque los trolls son esos que flamean a los de poca habilidad\n> \n> por mas negativos que de usted no puede negar la verdad\n\nRiot no dice que le importa poco lo que pienso, piden feedback, el tema de singed ya se resolvio y vos los seguis trayendo al tema. Poco y nada dijiste de lo que quiero debatir.","replies":[{"poster":"xaxesis","date":"2018-01-30T23:40:28.448+0000","up_votes":1,"down_votes":1,"body":"como le dije en mi comentario inicial antes que  comenzara a desinformar:\n\n\"lo de elegir campeones nunca se a sancionado puede ir el campeon que desee en la linea que sea a riot no le interesa solo le interesa que no se falten el respeto basicamente\" \n\n{{sticker:slayer-jinx-catface}}","replies":[]}]}]}]}]},{"poster":"ChadwickEsMiNana","date":"2018-01-30T02:07:14.660+0000","up_votes":1,"down_votes":0,"body":"Banearon al singed supp no por el pick, si no porque basicamente dejaba a su adc solo durante los primeros minutos de partida.\nAhora en el caso del yi adc, el sistema esta hecho para que el que flamee en repetidas ocasiones le caiga el ban(esto es verdad, lo siguiente es como una teoria mia xd), el tema de los trolls es que es dificil diferenciar un troll de un novato, por lo que segun mi teoria lo deberias notificar al soporte y se revisara al usuario de forma manual","replies":[{"poster":"Zesc","date":"2018-01-30T02:37:13.809+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=themastersword,realm=LAS,application-id=v7qsfXsE,discussion-id=7N3vFtNd,comment-id=000100000000,timestamp=2018-01-30T02:07:14.660+0000)\n>\n> Banearon al singed supp no por el pick, si no porque basicamente dejaba a su adc solo durante los primeros minutos de partida.\n> Ahora en el caso del yi adc, el sistema esta hecho para que el que flamee en repetidas ocasiones le caiga el ban(esto es verdad, lo siguiente es como una teoria mia xd), el tema de los trolls es que es dificil diferenciar un troll de un novato, por lo que segun mi teoria lo deberias notificar al soporte y se revisara al usuario de forma manual\n\nno es repetidas veces, es a la primera, no hay excusa para la persona que diga \"sos un mogolico\", eso es baneado a la primera , no hay muteo de chat, no hay nada. Y si es lo que hice mas de una vez, el problema esta en que no te dicen nada de las medidas que toman, y en muchos casos los agregaba como amigos para saber si eran baneados, y no , siempre se conectaban :/","replies":[{"poster":"ChadwickEsMiNana","date":"2018-01-30T03:44:08.114+0000","up_votes":1,"down_votes":0,"body":"Cuidado como afirmas las cosas, lo que estas afirmando es opinión tuya, no lo que pasa en realidad.\nPero por lo menos según yo el sistema esta bien, ya que por flamear 1 partida no significa que seas un flamer que insulta a la primera, el sistema va progresando según se flamea en las partidas (restricciones de chat, bans temporales y el permanente).","replies":[{"poster":"Zesc","date":"2018-01-30T04:18:16.516+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=themastersword,realm=LAS,application-id=v7qsfXsE,discussion-id=7N3vFtNd,comment-id=00010000000000000000,timestamp=2018-01-30T03:44:08.114+0000)\n>\n> Cuidado como afirmas las cosas, lo que estas afirmando es opinión tuya, no lo que pasa en realidad.\n> Pero por lo menos según yo el sistema esta bien, ya que por flamear 1 partida no significa que seas un flamer que insulta a la primera, el sistema va progresando según se flamea en las partidas (restricciones de chat, bans temporales y el permanente).\n\npor flamear una partida estas generando una infraccion , dependiendo de la gravedad es castigada a la primera.\nEl sistema funciona solo para castigar el flameo, pero esto no lo va a detener, porque lo otro, el troleo, el feeder , el rage quiter es lo que sigue sucediendo y  por ahora no veo una manera efectiva de controlarlo","replies":[]}]}]}]}]}]},{"poster":"EdGeinTexas","date":"2018-01-30T21:00:05.536+0000","up_votes":1,"down_votes":0,"body":"Pues si , haber ,flameando no pierdes partida , solo como lo haz dicho : muteas , y lo relacionado con lo otro , tienes razon , tendrian que darles mas castigo a esas personas que directamente trollean y hacen picks troll, y  etc , aunque aveces puede salir bien , aveces puede salir mal . y eso , bueno , es molesto , y bueno puede haber gente probando champs , pero seria mejor , que prueben champs que son de esas lineas , no como lo dijiste vos , tipo: un yi adc o. y bueno con los afks y esos solo reportas al final de la partida o remake.","replies":[]}]}