{"poster":"Codarus","date":"2015-07-29T17:19:53.311+0000","title":"¿Shen en elos bajos?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"&iquest;Qu&eacute; piensas acerca de Shen en &eacute;ste tipo de divisiones? {{champion:98}}","replies":[{"poster":"Ufaaaaaaaaaa","date":"2015-07-29T21:03:01.344+0000","up_votes":2,"down_votes":0,"body":"Shen mas allá de todo, siempre fué un gran campeón. Aún en su momento de extrema rotéz y dominación, siempre tuvo cierto componente de utilidad y saber en que momento ejecutar que cosa con él.\nEn elos bajos, esto siempre fué un problema. De hecho cuando estaba rotisimo y lo nerfearon, la mayoría de la gente de elos bajos se quejaba de que todos pickeaban Shen porque estaba roto y terminaban feedeando, tirando ultis fuera de tiempo, y no gravitando para nada.\nA mi es un PJ que me encanta y forma parte de mi pool, por mas que hace tiempo no lo juegue, ya lo tengo claro. Además si me iba bien con él antes del buff, ahora mas todavía. Pero toma su tiempo. No se si para \"agarrarlo y usarlo en rankeds\" te sirva de una. En mi caso fué uno de mis primeros campeones a fines de la S2, por ende lo uso mas por el campeón en si que por su estado de fortaleza o adaptación al meta. \nPero obviamente cometí muchos errores y me comí un montón de puteadas antes de dominarlo como lo domino. Es una decisión que hay que tomar. Si te digo respecto a ese componente de utilidad que cuando tenés un campeón de utilidad, pasas a depender un poco de tus compañeros.","replies":[]},{"poster":"HyenaLoL","date":"2015-08-03T21:13:53.434+0000","up_votes":1,"down_votes":0,"body":"Shen funciona en elos medios, en bronce-plata es 100 veces mas probable ganar con champs de daño elevado","replies":[]},{"poster":"AkNando","date":"2015-07-29T19:24:49.753+0000","up_votes":1,"down_votes":0,"body":"A mi parecer, lo vas a utilizar más cómo tanque inicador/ soporte, ya que no muchos en nivel bajo comprenden toda la utilidad que Shen otorga haciendo que se comenta varíos errores: Correr con escudo en vez de quedarse, no atacar al enemigo marcado con la Q, etc.\n\nSaludos.","replies":[]},{"poster":"rokushoger","date":"2015-07-29T17:33:51.374+0000","up_votes":1,"down_votes":0,"body":"No se realmente si es un buen pick, dado que el team tiene que estar atento a aprovechar al máximo tu taunt una vez que entras a la pelea, y a saber cuando quedarse para que no desperdicies tu ultimate.","replies":[]}]}