{"poster":"BaaadBoy x3","date":"2017-06-29T08:42:03.806+0000","title":"Supp Champs Übersicht","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo zusammen,\r\nich h&auml;tte da mal eine frage bez&uuml;glich der Support Rolle^^\r\nWas ist eure meinung nach der beste der Supportchamp und wieso? :D \r\nich bin letzte zeit einfach so unschl&uuml;ssig was ich spielen soll und wollte daher mal nach eurer Meinung fragen :)","replies":[{"poster":"ninju7su","date":"2017-06-29T09:28:28.571+0000","up_votes":1,"down_votes":1,"body":"Ich gebe Rudeltreiber recht. \nAls grobe einteilung kannst du dir aber die Botlane anschauen und versuchen zu verstehen, was für eine Botlane ihr da unten habt. Poke, Sustain oder All in. Es gibt dieses schöne Stein, Schere Papierprinzip: Poke > All-In > Sustain > Poke _(Sustain-Lane hätte also einen Vorteil gegenüber einer Poke-Lane)_\n\nDaran kann man sich grob orientieren. natürlich sind das nur Preferenzen aber für den Anfang ist das ein guter Anhaltspunkt.\nAls gute Supporter in der jeweiligen Kategorie sehe ich _(in der Reihenfolge der von mir zugesprochenen stärke)_:\nPoke: Sona, Lulu, Zyra\nSustain: Sona, Soraka, Janna, Nami\nAll-In: Leona, Thresh, Fiddle\n\nOffen sit die Frage ob man Tank, AP-Supp oder Sustain spielen will. Hängt etwas davon ab, was dein Team hat und was du unterstützen musst oder was noch fehlt. Ein Fiddle z.B. hat ein extrem gutes All-In Potential, allerdings nur gegen squishys. Sollte das gegner team aus 2 oder 3 Tanks bestehen, nimm lieber eine Leona für All in. Hat das Gegnerteam NUR tanks, wird es an DMG fehlen und daher würde ich eher auf Soraka gehen, die zwar nicht gut Burst-DMG weghealen kann, aber bei DMG-over-Time die Queen der Kluft ist. \n\nEs hängt viel mit Faktoren zusammen, die man so aus dem stehgreif schlecht umreißen kann. Was ist z.B wenn man Firstpcik ist und nichts über die Gegner weiß? In dem moment würde ich den sichersten und flexibelsten Pick nehmen (Sona/Janna). Wie spielst du die einzelnen Champs? Ich zB liebe Gragas Support auf Ardent Censer. Auch das kann ein extrem starker Support sein. Kommt auch auf deine stärken und schwächen an, womit man sich wohl fühlt und was einem liegt. Ich würde nie Lulu picken, da ich mit dem gnom einfach nich klar komme. \n\naber so als Denkrichtung hoffe ich hilft dir das erstmal.","replies":[{"poster":"BaaadBoy x3","date":"2017-06-29T10:07:00.876+0000","up_votes":1,"down_votes":1,"body":"danke für den ausführlichen beitrag :)\nhabe überwiegend Janna/thresh/lulu/zyra/morgana gespielt letzte zeit aber auch andere probiert\naber mir fehlt einfach wieder ein supp der einfach immer spaß macht zu spielen und mit dem man auch games carrien kann\nwie ist denn rakan so? oder gibt es diese season wieder gut untypischen supports wie gragas oder trundle beispielsweise? :)\n","replies":[{"poster":"ninju7su","date":"2017-06-29T11:34:59.852+0000","up_votes":1,"down_votes":1,"body":"Welcher Supporter dir am meisten Spaß macht, wirst du für dich rausfinden müssen. Es ist so, dass die meisten Spieler Spaß haben, wenn Sie für eine gelungene Aktion oder gute Mechanics ein Sofort-Feeedback bekommen. Beispielsweise genießen viele Mechaniclastigen Toplaner wie Yasuo oder Riven die Aufmerksamkeit, dadurch das sie hin und herspringen und alles zermetzeln wärend sie gerade so überleben. Sie generieren sofortige Anerkennung. Das ist natürlich eine starke Belohnung und fühlt sich gut an und das Adrenalien schießt ins Blut. Sehr schnell, sehr viel Aktion, ziemlich geil!\n\nSupporter Carrien allerdings eher dadurch, das Sie ein erweitertes Spielverständnis haben. Gut platzierste und vorausschauend gestellte Wards, intelligente Roams, Shotcalls und eine gute Einstellung sind Punkte mit denen ein Support carried. Alles nichts, was man sofort mitbekommt und auch nichts was von den meisten gehonord wird. Daher entgeht einem etwas des Spaßes, den es auf anderen Lanes überwiegend gibt. Mit krassen Mechanics kann man, bei genug Training auch als Supporter aufwarten. Allerdings würde ich dann empfehlen die ersten 50 Games mit diesem nicht im Ranked zu machen.\nWenn du so etwas willst, such dir Mechanic-lastige Playmaker-Champs raus. **Bard** wäre einer der mir da mit als erstes einfallen würde. Ist aber auch gleichzeitig der komplizierteste Champ der mir spontan einfällt. **Blitzcrank** hat eine super einfache Mechanic die aber schwer zu meistern ist. Ich selbst spiele den nicht außer ich will wirklich nur ein Arschloch sein und der Win ist mir egal. Kann man den aber spielen, kann er Games carrien. Das sind beides Champs wo dein Team sofort sieht das du es drauf hast (sofern du es drauf hast) und was dir dadurch ein gutes gefühl gibt. **Thresh** ist auch so ein Champ dem ich jedem Anfänger nicht empfehlen würde, der aber durch übertrieben gute Plays glänzen kann. Ein gut gespielter Thresh ist für mich mit das schlimmste da dieser Champ einfach unheimlich viel Potential in sich birgt. \n\nUngewöhnliche Supps,.. nun ja im Endeffekt kannst du alles spielen was gewisse Voraussetzungen erfüllt.\ni.d.R. alles, was ohne viel Gold genügen Einfluss auf das Game haben kann. D.h. die Fähigkeiten sind entscheidend. Jemand der von Natur aus gute Fähigkeiten hat die z.B. für CC sorgen oder Sustain mitbringen haben die richtigen vorraussetzungen. **Fiddlesticks** z.B. ist einer der Kandidaten, der fast ausschließlich wegen seines Fears als Support gespielt werden kann. Seine Ulti gibt ihm dazu noch die Chance sehr gute Roams hinzulegen. Man kommt halt ohne Flash aus dem Midlanebush direkt zum Gegner um ihn zu über 2 Sekungen zu fearn. Das ist für die Meisten Gegner GG. Einer meiner Liebsten ist **Gragas **als Tank. Der Typ hat so viel CC, dass du auf den auf Stoneborn Pact spielen kannst. Zur Erinnerung, die Meisterschaft healt jeden Ally den du CCst. Damit kannst du hervorragend Ardent Censor triggern und den Heal den Stoneborn Pact mitbringt mit Athenes rein theoretisch noch verstärken. Zusätzlich bieten seine Fähigkeiten imensen Impact im Game. Ich hab auch schon Ashe Supports gesehen oder Veigars. Bei den beioden erstgenannten kann ich dir versichern das sie im richtigen Team wirklich gut sind. Ansonsten schau einfach ob folgende Gegebenheiten vorhanden sind:\n\nEinfluss ohne viel Gold möglich (ist also CC oder Sustain vorhanden)?\nHat der Champ eine hohe Manaregeneration um seine Fähigkeiten oft zu wiederholen und/oder Manareg-Items gut zu verwenden?\nHat er gutes Roampotential?\n\nWenn du zwei der Fragen für den Champ mit Ja beantwortest kannste dir den genauer anschauen.\n\nRakan halte ich aktuell für problematisch. Mit der neuen Münze und dem neuen Zeke könnte er besser werden, aber er ist definitv kein leicht zu spielender Champ. Ich persönlich freue mich immer wenn ich gegen ihn spiele. Das heißt zu 90% ist die Lane gewonnen, fast egal mit wem ich antrete. Aber vllt ändert sich das ja mit den letzten Patches. wer weiß.","replies":[{"poster":"BaaadBoy x3","date":"2017-06-29T12:04:02.687+0000","up_votes":1,"down_votes":1,"body":"okay danke :) ich denke ich probiere rakan mal aus","replies":[]}]}]}]},{"poster":"Rudeltreiber","date":"2017-06-29T09:02:58.588+0000","up_votes":1,"down_votes":1,"body":"Situationsabhängig, da wirst du so allgemein keine Antwort bekommen können. Musst dich jeweils an deinen adc und die gegnerische Botlane anpassen.","replies":[{"poster":"BaaadBoy x3","date":"2017-06-29T09:23:05.973+0000","up_votes":1,"down_votes":1,"body":"ja das ist mir klar :D\naber dennoch gibt es Champs die besser sind als andere :)","replies":[]}]}]}