{"poster":"evilmikereborn","date":"2017-03-15T11:12:15.387+0000","title":"Sono nabbo e voglio consigli","subforum":"Discussioni generali","up_votes":3,"down_votes":3,"body":"Volevo sapere cosa &egrave; la dicitura di un item &quot;rigenerazione dalle base&quot; {{item:1006}}  ? Su cosa influisce? Se possibilmente potete spiegarmelo con termini umani e non con termini usati dalla NASA","replies":[{"poster":"Don Draven","date":"2017-03-15T20:24:22.717+0000","up_votes":1,"down_votes":0,"body":"e vorrei,se potreste spiegarlo semplicemente\n\nhttp://i63.tinypic.com/351fgh4.png\n\ncome noti mundo a 7.76 di healt regen base + 0.75 per ogni livello dall'1 al 18.\n\nquesto significa che quell'item da te citato incrementa del 50% 7.76+(0.75*lvl).\n\nse provi a vedere un altro campione tipo lucian : http://leagueoflegends.wikia.com/wiki/Lucian  (devi mettere il livello su n),\nnoterai che lui essendo un adc e non un tank come mundo ha 6.19 da subito più (+ 0.65) per livello,questo significa che rigenera molti meno hp di mundo giustamente.","replies":[]},{"poster":"oroora6","date":"2017-03-15T13:06:06.945+0000","up_votes":1,"down_votes":0,"body":"Ogni campione rigenera vita passivamente, chi di più, chi di meno. Guardando il tuo op.gg penso che tu lo stia chiedendo per Singed, per cui lo prenderò come esempio\n\nSinged a livello 1 ha 8.02 di rigenerazione salute ogni 5 secondi, quindi con la {{item:1006}} la sua rigenerazione a livello 1 va a 8.02+([8.02/100]x50)=12,03 ogni 5 secondi\nperò singed ottiene anche 0.5 rigenerazione base per livello, per cui ad ogni livello otterrai anche 0.5+([0.5/100]x50])=0.75 rigenerazione vita ogni 5 secondi\npuoi però avere alcuni secondi di rigenerazione vita potenziata grazie alla ultimate di singed e alla {{item:2033}} che va sempre comprata su singed subito dopo la {{item:1082}}, in questo modo attivando entrambi gli effetti durante un combattimento otterrai una rigenerazione costante che renderà i danni nemici davvero molto meno efficaci","replies":[]},{"poster":"HaIIeIujah","date":"2017-03-15T12:49:19.884+0000","up_votes":1,"down_votes":0,"body":"Ogni campione ha una sua statistica personale chiamta \"Rigenerazione Base\", che indica quanta vita recupera naturalmetne ogni 5 secondi.\n\nQuell'oggetto ti fornisce rigenerazione bonus in base alla rigenerazione base. Se il tuo campione normalmente rigenera 4 hp per 5 secondi, con quello ottiene +50% della base, quindi passa a 4+(2)= 6 HP per 5 secondi.","replies":[]},{"poster":"The Fluffy Lamb","date":"2017-03-15T11:49:33.083+0000","up_votes":1,"down_votes":0,"body":"SE NON SBAGLIO\n\nLa quantità di salute che il tuo pg rigenera al secondo quando non è in combattimento. \n\nPotrebbe pure avvenire in combattimento ma non ne sono sicuro perche non faccio in tempo a guardare che sono gia morto :/","replies":[]}]}