{"poster":"Cale017","date":"2015-01-18T07:59:14.631+0000","title":"If anyone's ever doubted that Lee Sin was Riot's favorite champ","subforum":"Gameplay","embed":{"description":"Champion Spotlight for Lee Sin, the Blind Monk Hey guys, MrNeobuxFan here, just wanted to fill you guys in on a great new way to earn money-EASY. Basically its a website where you earn rewards and free stuff by searching and shopping online, answering surveys, and also a customer loyalty rewards program.","url":"https://www.youtube.com/watch?feature=player_embedded&v=CXxcpaCr1hw","image":"http://i.ytimg.com/vi/CXxcpaCr1hw/hqdefault.jpg"},"up_votes":2,"down_votes":3,"body":"Or wondered why it is that he's never actually nerfed to make his power curve match his skill cap, take a look at this video. \r\n\r\nHonestly no one should be surprised that Riot lets him Dragon Rage them in the balls and asks for more.","replies":[{"poster":"Zair Umbras","date":"2015-01-18T12:03:54.161+0000","up_votes":3,"down_votes":1,"body":"Lol. You seriously just linked the spotlight for Lee Sin when he was actually an April Fool's joke champion. The funny part? The April Fool's was on us. He was a real champion. Silly new players not knowing the truth behind old champions. Next thing you know, you'll be saying Evelynn has always been a jungler, Mundo has always been a top laner, and that Zyra wasn't made to be a mid champion. :P","replies":[{"poster":"HandheldBrandon","date":"2015-01-18T18:21:38.065+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zair Umbras,realm=NA,application-id=3ErqAdtq,discussion-id=dL0nxJ1s,comment-id=0000,timestamp=2015-01-18T12:03:54.161+0000)\n>\n> Lol. You seriously just linked the spotlight for Lee Sin when he was actually an April Fool's joke champion. The funny part? The April Fool's was on us. He was a real champion. Silly new players not knowing the truth behind old champions. Next thing you know, you'll be saying Evelynn has always been a jungler, Mundo has always been a top laner, and that Zyra wasn't made to be a mid champion. :P\n\nThis \n\n\nLee Sin was actually supposed to be one of the release champs but he never came out and people were left wondering and then Riot did this video getting us all hyped and then april fooling us.\n\nThen turning around and double april fooling us giving us Lee sin when everyone thought he was fake. Honestly that was one of the best moments this game has had and one of my favorite april fools riot jokes.","replies":[]}]},{"poster":"Cale017","date":"2015-01-18T18:16:48.201+0000","up_votes":1,"down_votes":0,"body":"I'm fully aware of what he started out as, and I'm definitely not new to this game. But clearly Riot knew that his kit was overloaded from day one, the joke just reinforces that.\n\nLooks like Lee Sin's not the only blind person on this thread.","replies":[]}]}