{"poster":"TFT Zarak","date":"2015-03-03T17:33:39.228+0000","title":"Trínity auf Quinn?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Was haltet ihr von Trinity auf SoloLane Quinn, ob jetzt Mid oder Top?\r\nwürdet ihr es kaufen oder findet ihr es gibt bessere Items?","replies":[{"poster":"AkaiHono","date":"2015-03-03T18:26:16.945+0000","up_votes":1,"down_votes":0,"body":"Ich bin mir grade nicht sicher welche AP Skallierungen sie hat. \nIch denke Quin kann sehr viel mit dem Movementspeed anfangen, denn so kann sie nach ihrem DMG output sich neu positionieren. \nAuf der anderen Seite sind Blutdürster/Statiks meiner Meinung nach Sinnvoller, da BT ihr die Fähigkeit gibt länger auf der Lane zu bleiben und Shiv ihr den erwähnten Movementspeed **und** Waveclear gibt.","replies":[{"poster":"XxKampflappenxX","date":"2015-03-03T19:36:31.601+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=AkaiHono,realm=EUW,application-id=Wj1wcocU,discussion-id=rulnFErn,comment-id=0000,timestamp=2015-03-03T18:26:16.945+0000)\n>\n> Ich bin mir grade nicht sicher welche AP Skallierungen sie hat. \n> Ich denke Quin kann sehr viel mit dem Movementspeed anfangen, denn so kann sie nach ihrem DMG output sich neu positionieren. \n> Auf der anderen Seite sind Blutdürster/Statiks meiner Meinung nach Sinnvoller, da BT ihr die Fähigkeit gibt länger auf der Lane zu bleiben und Shiv ihr den erwähnten Movementspeed **und** Waveclear gibt.\n\nDarf ich dich fragen wie du von Trinity direkt auf AP Skalierungen assoziierst?\n\nQuinn ist Pur AD, als Spieler sollte man eigentlich wissen dass Trinity ein AD Item ist, Lichbane das AP Gegenteil und Frosthandschuh die tanky Alternative\n\nZur Frage:\n\nIch würde dir eine Trinity auf Quinn wirklich empfehlen und dir einen eher Offtank orientierten Build ans Herz legen. Bei Quinn bin ich mir nicht so sicher was genau sie denn jetzt ist. Sie ist kein ADC und ein Bruiser ist sie jetzt auch nicht so wirklich aber die Trinity und ihre Passive passen wunderbar zusammen. Besonders da du mit ihrer E Passive und Trinity gleichzeitig auslösen kannst. Ein gesunder Mix aus Attackspeed, Triforce und ÜberlebensItems lassen dich auf der Top gegen Melees dominieren da sie nicht wirklich an dich heran kommen können.\n\nIch habe Quinn noch nicht so oft gespielt aber alleine von der Logik her erklärt sich das von selbst dass Ranged Champions den Melee Tanks auf der Top überlegen sind\n\nMein Vorschlag auf Quinn:\n\nBerserkerschuhe / Ninja Tabis / Merkurs Schuhe\n\nTrinity Force\n\nBotRK\n\nRanduins / Frosthammer / \n\nGeistessicht / Banshees\n\nGuardian Angel","replies":[]}]}]}