{"poster":"TFT Zarak","date":"2015-11-27T21:46:12.491+0000","title":"Kindred Passive Chance","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Ein Vorschlag f&uuml;r eine Anpassung der Kindred Passive:\r\n\r\nMan bekommt pro Stack nur noch 0.5% Schaden.\r\nF&uuml;r das T&ouml;ten eines makierten Jungle Monsters erh&auml;lt man 2 Stacks\r\nF&uuml;r das T&ouml;ten eines makierten Champs erh&auml;lt man 3 Stacks.\r\n\r\nWieso?\r\n\r\nWenn man als Jungle gegen Kindred spielt, hat man oft das Gef&uuml;hl gezwungen zu werden m&ouml;glichst schnell die Camps zu machen damit Kindred nicht schnell an viele Stacks kommt und dann snowballed.\r\nDaher f&auml;nde ich es gut, wenn die St&auml;rke die man durch die Jungle Camps bekommt etwas runtergesetzt wird.\r\nAls Ausgleich w&uuml;rde ich dann die St&auml;rke die man durch das T&ouml;ten eines makierten Champs bekommt etwas erh&ouml;hen um gute Plays noch etwas mehr zu belohnen und Kindred nciht zu stark zu nerven.\r\n\r\nLogischerwei&szlig;e w&uuml;rden dann auch Junglecamps makiert werden bis man [12-15] stacks hat.\r\n\r\nIch spiele Kindred selbst sehr gerne und wei&szlig; daher recht gut, was f&uuml;r ein Vorteil es ist wenn man fr&uuml;h es schafft 1-2 Jungle camps zu bekommen.","replies":[{"poster":"Alustus","date":"2015-11-27T22:39:39.535+0000","up_votes":1,"down_votes":0,"body":"finde ich nicht unbedingt als nötig.\n\nDa man  die Camps welche kindred machen muss überwachen kann und dementsprechen reagieren und sie töten","replies":[{"poster":"xXTheFalloutXx","date":"2015-11-27T23:23:05.820+0000","up_votes":1,"down_votes":0,"body":"Das geht aber auch andersherum ^^\nMan Geht zum Gegnerischen Camp und killt den Wachhabenden jungler als Team...","replies":[]}]},{"poster":"Sirrkas","date":"2015-11-27T22:44:16.772+0000","up_votes":1,"down_votes":0,"body":"Ich glaube wenn ich einmal gegen Kindred jungeln müsste und zum Beispiel das Wolfcamp von mir markiert hat, würde ich das Camp stattdessen stehen lassen und eher für gute Sicht an den Jungeleingängen sorgen. Solange die Wölfe nicht gemacht werden, kriegt sie die Markierung nicht auf einrachere Ziele wie die Krabben und um den Stack zu kassieren, muss sie ziemlich weit in gegnerisches Gebiet eindringen.","replies":[]}]}