{"poster":"PeppeJerry","date":"2016-05-05T19:01:51.104+0000","title":"Meta support","subforum":"Campioni e gameplay","up_votes":10,"down_votes":1,"body":"Salve vorrei parlare di una richiesta abbastanza semplice ovvero una meta support.\nGli oggetti da support sono i seguenti:\n {{item:3401}} {{item:2303}} {{item:3092}}  {{item:2301}} {{item:3069}}  {{item:2302}} {{item:2045}} {{item:3050}} {{item:3190}} {{item:3222}}.{{item:3504}} {{item:3060}} \nIo gioco molto spesso support e penso che la build sia diventata ormai monotona e ripetitiva e che alcuni degli oggetti qui sopra ( {{item:3050}} {{item:3060}} {{item:3504}}  ) sono poco utilizzati per la loro scarsa efficienza in game.\nPropongo una meta support per semplici motivi:\n\n&gt; 1. Aumentare il lavoro di protezione da parte dei campioni support per garantire un maggiore margine di protezione per ogni campione del proprio team.\n2. Aumentare il numero di oggetti da supporto per una build pronta ad ogni evenienza e pi&ugrave; importante DINAMICA per ogni game.\n\nOggetti da proporre (per lo pi&ugrave; effetti su futuri oggetti):\n\n&gt;Pozione della illuminazione - costo 150 oro\n**abilit&agrave; attiva UNICA** Se utilizzate riprestinano 75 di salute in 12 secondi  e possiedono 2 cariche che possono essere ricaricate visitanto l&#039;emporio\n**abilit&agrave; passiva UNICA** Usare una pozione della visione in possesso di un oggetto con passiva unica &quot;**bottino di guerra/tributo/favore**&quot; diminuir&agrave; di 10 secondi il tempo di ricarica del trinket in possesso, la passiva dopo il suo utilizzo viene disabilitata per un tempo di 20 secondi.\n\n-\n&gt;Pozione della Visione - costo 400 oro/250 oro + pozione della illuminazione\n**abilit&agrave; attiva UNICA** Se utilizzate riprestinano 100 di salute in 10 secondi e possiedono 3 cariche che possono essere ricaricate visitanto l&#039;emporio\n**abilit&agrave; passiva UNICA** Usare una pozione della visione in possesso di un oggetto con passiva unica &quot;**bottino di guerra/tributo/favore**&quot; diminuir&agrave; di 10 secondi il tempo di ricarica del trinket in possesso, la passiva dopo il suo utilizzo viene disabilitata per un tempo di 15 secondi.\n**abilit&agrave; passiva UNICA** Distruggere o assistere nella distruzione di un lume invisibile/della visione aumenteranno le cariche della pozione di 1.\n\n-\n&gt;Mantello del legame - costo non definito\nStatistiche non definite\n**abilit&agrave; attiva UNICA** Questa abilit&agrave; &egrave; possibile attivarla su un campione al di sotto del 25% di vita che si trova in un raggio di (non definito),una volta attivata il campione alleato subir&agrave; per 4 secondo il 50% dei danni in meno ( esclusi danni puri ) e il possessore di questo oggetto rimarr&agrave; immobilizzato impossibilitato di muoversi e usare qualsiasi altra abilit&agrave; per 4 secondi subendo il rimanente 50% di danni assorbiti sotto forma di danni fisici e disabilitando questa abilit&agrave; attiva per 150 secondi.\nDopo i 4 secondi sempre il possessore di questo oggetto verr&agrave; rallentanto del 30% per 2 secondi (Debuff Sforzo del legame)\n\nInfine propongo delle skin per support come Braum Gentiluomo o sicuramente non braum ( con dei capelli e senza baffi ) e lumi  come Lume indistruttibile (lume con lo scudo di braum).\n\nNon chiedo che tutte le mie richieste vengano accettate ma almeno quella meta support.\nBuonGame\n\nPS: Se avete idee di nuovi oggetti o proposte riguardante questo post scrivete nei commenti e se mi piacciono le aggiungo nel post per una maggiore visibilità.","replies":[{"poster":"xFexindery","date":"2016-05-06T15:43:57.732+0000","up_votes":3,"down_votes":0,"body":"Davvero belle idee forse un pochino da rivedere, però davvero belle! GG","replies":[{"poster":"PeppeJerry","date":"2016-05-06T16:03:56.751+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xFexindery,realm=EUW,application-id=cAOZwaUi,discussion-id=9vo4XG9N,comment-id=0007,timestamp=2016-05-06T15:43:57.732+0000)\n>\n> Davvero belle idee forse un pochino da rivedere, però davvero belle! GG\n\nGrazie bro {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Dantazzo","date":"2016-05-06T11:07:52.008+0000","up_votes":3,"down_votes":0,"body":"Sinceramente un oggetto che mi sopprime per 4 secondi mi sembra abbastanza inutile. L'idea di trasferire il danno è buona comunque però le statistiche sono sballate.","replies":[{"poster":"PeppeJerry","date":"2016-05-06T11:14:12.440+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dantazzo,realm=EUW,application-id=cAOZwaUi,discussion-id=9vo4XG9N,comment-id=0002,timestamp=2016-05-06T11:07:52.008+0000)\n>\n> Sinceramente un oggetto che mi sopprime per 4 secondi mi sembra abbastanza inutile. L&#x27;idea di trasferire il danno è buona comunque però le statistiche sono sballate.\n\nL'idea più importante è la meta support aggiungendo più oggetti e io ho buttato solo qualche idea","replies":[]}]},{"poster":"TheSeriousMaster","date":"2016-05-06T13:33:20.484+0000","up_votes":2,"down_votes":0,"body":"Sono main Support e la trovo molto utile questa Proposta :D{{summoner:31}}","replies":[{"poster":"PeppeJerry","date":"2016-05-06T13:38:47.521+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheSeriousMaster,realm=EUW,application-id=cAOZwaUi,discussion-id=9vo4XG9N,comment-id=0004,timestamp=2016-05-06T13:33:20.484+0000)\n>\n> Sono main Support e la trovo molto utile questa Proposta :D{{summoner:31}}\n\nGrazie spero che condividerai questa proposta{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"TheSeriousMaster","date":"2016-05-06T13:39:42.518+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=PeppeJerry,realm=EUW,application-id=cAOZwaUi,discussion-id=9vo4XG9N,comment-id=00040000,timestamp=2016-05-06T13:38:47.521+0000)\n>\n> Grazie spero che condividerai questa proposta{{sticker:slayer-pantheon-thumbs}}\n\n{{sticker:slayer-pantheon-rainbows}}","replies":[]}]}]},{"poster":"Gianpy98","date":"2016-05-06T11:03:45.968+0000","up_votes":2,"down_votes":0,"body":"Penso che le idee sono buone e originali e che con qualche ritocco possono essere approvate dalla RIOT","replies":[{"poster":"PeppeJerry","date":"2016-05-06T11:05:19.133+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gianpy98,realm=EUW,application-id=cAOZwaUi,discussion-id=9vo4XG9N,comment-id=0001,timestamp=2016-05-06T11:03:45.968+0000)\n>\n> Penso che le idee sono buone e originali e che con qualche ritocco possono essere approvate dalla RIOT\n\nGrazie Spero che condividerai ad altri questa mia idea{{sticker:slayer-pantheon-thumbs}} ","replies":[]}]},{"poster":"DANJERpuntoEXE","date":"2016-05-05T21:51:27.364+0000","up_votes":2,"down_votes":0,"body":"Allora:\n\nhai dimenticato l'incensiere e lo stendardo(non pensare a nautilius top, nemmeno ad heimerdinger, almeno prima del nerf sul'aura).\nil calice di athena credo sia diventato il must have per i support (ap)che possono scudare o guarire, provalo.\n\n\nil primo oggetto mi piace, molto, solo che diventa inutile in mid late, perche dovrei spendere soldi in qualcosa di un po' inutile quando potrei completare il medaglione o altro? anzi probabilmente dopo i 4 oggetti venderei il pezzo base. In'oltre per tutte le cose che da per l'early dovrebbe costare di più, e di più è troppo per un champ che non farma.\n\nl'ultima ha una buona attiva, solo che metterei riduzione anche dei danni puri, perchè no? inoltre ha troppi debuff!!! per usare quell'oggetto dovrei suicidarmi praticamente!\n\ncomunque ripeto le idee sono molto belline, e non c'è bisogno di un meta dei support per metterle in gioco, basta una patch.","replies":[{"poster":"PeppeJerry","date":"2016-05-06T10:05:53.432+0000","up_votes":1,"down_votes":1,"body":"Grazie per avermi fatto notare di aver tralasciato 2 oggetti  anche se considerando bene l'attiva dello {{item:3060}}  io non lo vedrei molto come oggetto da support poiché lo scudo MAGICO sul minion creato da esso è inutile per la lane bot come primi oggetti ma anche come uno degli ultimi oggetti apparte in qualche situazione particolare .\nIo lo vedrei bene come un oggetto da MID dato che da anche un po di vita e resistenza magica e blocca i danni magici.\nDopo questo appunto io gioco molto smesso Support tank come {{champion:201}}  {{champion:12}}  {{champion:89}}  {{champion:53}}  e la build è ormai diventata monotona per entrambi e penso sia la stessa cosa per i support AP che alcune volte comprano oggetti da tank e utility cercando di sfruttare le loro abilità gia utili in game con oggetti altrettanto utili.\nChiedo la meta support per bilanciare l utilità dei campioni, aggiungere dinamicità in partita e il rework di campioni che sono diventati inutili per i loro continui NERF ({{champion:16}} almeno per me è cosi).\n\nGrazie per aver letto il post e se puoi condividilo ad altre persone cosi magari l'approvano{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Ste the ripper","date":"2016-05-06T16:46:44.203+0000","up_votes":1,"down_votes":0,"body":"Veramente zeke, stendardo e incensiere vengono da un periodo in cui erano molto usati...","replies":[{"poster":"PeppeJerry","date":"2016-05-06T18:44:10.352+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ste the ripper,realm=EUW,application-id=cAOZwaUi,discussion-id=9vo4XG9N,comment-id=0008,timestamp=2016-05-06T16:46:44.203+0000)\n>\n> Veramente zeke, stendardo e incensiere vengono da un periodo in cui erano molto usati...\n\nBeh hai appena detto \"erano\" e anche io li usavo","replies":[{"poster":"Ste the ripper","date":"2016-05-06T18:47:46.433+0000","up_votes":1,"down_votes":0,"body":"Con erano intendevo fino alla patch 6.8, siamo nella 6.9...","replies":[{"poster":"PeppeJerry","date":"2016-05-06T18:50:50.744+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ste the ripper,realm=EUW,application-id=cAOZwaUi,discussion-id=9vo4XG9N,comment-id=000800000000,timestamp=2016-05-06T18:47:46.433+0000)\n>\n> Con erano intendevo fino alla patch 6.8, siamo nella 6.9...\n\nBeh alla fine questo è un mio pensiero almeno nella mia lega ( silver 3 ) non viene mai utilizzato e comunque anche se fosse utile come tu pensi rimane di fatto che secondo me una meta support per valorizzare i support ci dovrebbe essere dato che almeno penso non attiri molta gente","replies":[]}]}]}]},{"poster":"ihccoc1302","date":"2016-05-06T15:15:33.665+0000","up_votes":1,"down_votes":0,"body":"shoppero' per questa causa{{summoner:14}}","replies":[]},{"poster":"Frattaglia","date":"2016-05-06T12:33:45.169+0000","up_votes":1,"down_votes":0,"body":"Io il banner lo compro in quasi ogni partita. Le pozioni penso che squilibrerebbero troppo i trinket (mi aspetterei contestualmente un nerf alla cd del trinket rosso), il mantello non è male ma bisognerebbe cambiargli un po' le statistiche.\n\nTra gli oggetti da support che hai nominato aggiungerei {{item:3110}}","replies":[{"poster":"PeppeJerry","date":"2016-05-06T13:22:25.753+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=cAOZwaUi,discussion-id=9vo4XG9N,comment-id=0003,timestamp=2016-05-06T12:33:45.169+0000)\n>\n> Io il banner lo compro in quasi ogni partita. Le pozioni penso che squilibrerebbero troppo i trinket (mi aspetterei contestualmente un nerf alla cd del trinket rosso), il mantello non è male ma bisognerebbe cambiargli un po&#x27; le statistiche.\n> \n> Tra gli oggetti da support che hai nominato aggiungerei {{item:3110}}\n\nPenso che il fulcro dei geli sia un oggetto che bensì la sua utilità con la sua passiva unica, riduzione ricarica e mana sia piu impuntato per un contesto tank che support.","replies":[{"poster":"Frattaglia","date":"2016-05-06T13:45:55.505+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PeppeJerry,realm=EUW,application-id=cAOZwaUi,discussion-id=9vo4XG9N,comment-id=00030000,timestamp=2016-05-06T13:22:25.753+0000)\n>\n> Penso che il fulcro dei geli sia un oggetto che bensì la sua utilità con la sua passiva unica, riduzione ricarica e mana sia piu impuntato per un contesto tank che support.\n\nIl support può essere tank, quindi adatto a tutti i support tank, inoltre la sua passiva è comunque ad area. In realtà è un oggetto che compro spesso su {{champion:16}} {{champion:40}} {{champion:267}}  quando gioco contro Master Yi o Vayne. \n\nTra l'altro Soraka mi sembra comunque tutt'altro che nerfata, attualmente è il support col win rate maggiore, e spesso bannata.","replies":[]}]}]},{"poster":"HaIIeIujah","date":"2016-05-08T04:23:13.715+0000","up_votes":1,"down_votes":1,"body":"Le pozioni sono passabili, ma un supporto è già estremamente impoverito nell'early game ( in cui è costretto a rusahre SIghstone+Gold item) e 400, o addirittura 550 gold spesi in un item del genere sono un semplice spreco, specie per quanto limitato è il loro effetto.\n\nIl Mantello è un item inauditametne tremendo sotto ogni punto di vista.\nPrimo, il limite di attivazione: usarlo su un alleato già sotto il 25% significa che nella stragrande maggioranza dei casi questo morirà immediatamente dopo. Una riduzione del 50% è sorpredentemente poco rilevante quando si è già in fin di vita,ed esistono mezzi piu' efficienti per garantirne la sopravvivenza-Mikael e Solari primi tra tutti. Secondo, l'autostun di 4 secondi seguito da uno slow  lo rendono, in assoluto, il peggior item dell'intero gioco-ti rimuove attivamente dalla fight, è incapace di proteggere il tuo alleato, e  nel migliore dei casi condanna te ad una morte immediata al suo posto. Necessita di un totale rework, da zero.\n\nPS: Dubito che tu comprenda cosa \"Metagame\" significhi, quello di cui stai parlando è semplicemente un class rework limitato.","replies":[]}]}