{"poster":"R3playZ3","date":"2018-01-23T14:55:23.575+0000","title":"die aram rank theorie","subforum":"Karten & Spielmodi","up_votes":7,"down_votes":7,"body":"http://img8.myimg.de/zbilde6c9a.jpg\n\n**from 29.01 to 04.02 the english forum is cordially invited to be our guest :)**\n\nthe aram rank mode is the most requested mode here in the forum and in every international forum in which I looked around, statistics for example aram ranks vs urf I have already listed elsewhere for the skeptics.\n\nLately, aram quality has deteriorated significantly as aram was almost at the height of its games, now pro teams are disintegrating and you notice a certain displeasure in the different clubs.\n\n**I'll explain that too**\n\n1.) The right-click was abolished to invite people to the gamelobby\n2.) All gold items have been removed\n3.) respawn times of champions / minions / heal have been changed\n\nWith all the means you tried to cut and shorten the game, I still know where some games went 55 minutes, that definitely belongs to the past, you have the game as far as it is from 20 minutes already through in most cases ,\n\n**we hold on again**\n1.) really many people demand the aram rank mode\n2.) There were countless complaints against the right-click\n3.) There were countless complaints against the new 0-8-15 aram\n\nI know even from a reliable source (riot support) the riot exactly as intended\n\n**So now we come to my theory**\n\nIn one of the last episodes, \"riot\", riot said he was asking questions\n\n\"why do you urf in so many variations although all want the normal urf\"\n\nthe answer was summarized\n\n\"We noticed that whenever we released this urf the players played so much urf that the numbers of the SR games went down drastically and we see that very critically as SR is our main game.\"\n\n**solution**\n\nin reverse and related to the aram ranks so you can use the same 1: 1 and already has one explanation why such a popular game mode is specifically outclassed. riot does not want people to play this mode as the main mode but they want to play the SR and if you do not want more on SR then you should play 1-2 round aram then to notice \"the mode is shit, I play it again SR \"just that one does not change the entire game in the meantime and zb to dota or something changes.\n\nSo a strategic masterpiece in my opinion.","replies":[{"poster":"MeMyselfandBaal","date":"2018-01-23T16:17:40.874+0000","up_votes":6,"down_votes":3,"body":"Als jemand, der zu viel Zeit in diesem Forum verbringt... würde ich mal behaupten, dass zumindest hier mehr Leute URF in seienr Ursprünglichen Form wieder haben wollen...\n\nAlso ja, das Thema kommt ein Mal im Quartal auf. Dann kriegt es ungefähr 15 Antworten... und dann ist es wieder erledigt. Eine Massenbewegung sieht irgendwie anders aus... Wenn es in anderen Foren anders ist, kannst du das ja bestimmt mit Quellen belegen... und im Gegensatz zu den Aussagen des Riot Mitarbeiters droht dir keine Strafe, wenn du hier andere Foren verlinkst. Und wenn das sooo viele fordern, wirst du ja auch sehr schnell fündig...\n\nUnd ja, du hast Recht: ARAM ist als lustige Abwechslung zum Hauptspiel gedacht. Als Fun Modus, den man mal ganz entspannt spielen kann... und Riot will denn auch genau so lassen... allein schon, weil man sich dann nicht ums Balancing und Banns kümmern muss...\n\nAber hey, von mir aus... wenn die paar Hanseln, die das unbedingt als Tryhard Modus wollen, den bekommen... (Also unter der Bedingung, dass in der Que immer alle Champions freigeschaltet sind... Damit es keine \"Ich habe halt nur die 5 besten Champs und rasiere deswegen\" Accounts gibt) würde das niemanden weh tun... die müssen dann ja mit den Warteschlangen und dem Matchmaking leben...\n\nWobei... das ja auch wieder zu spannenden Fragen führt: Muss man dann in ARAM Ranked Banns einführen? Werden die Rerolls abgeschafft, damit alle Teams die gleichen Vorraussetzungen haben? Es wäre schließlich unfair, wenn das eine Team mit 2 richtig schwachen ARAM Champions spielen muss, weil die Spieler gerade keine Reroles haben, die im Gegnerteam aber schon... alles so fragen, mit denen sich Riot nicht beschäftigen will, weil sich aus ihrer Sicht der Aufwand nicht lohnt...\n\nWenn dieser Thread 30 Upvotes und 5 Seiten Unterstützung kriegen würde... Aber die Vielen Spieler, die unbedingt ARAM Ranked wollen, sind anscheinend zu faul deswegen hier vorbeizukommen... Oder im englischsprachigen Forum... Also ich hab mal spaßeshalber im NA Forum nachgeguckt... da gab es das Thema das letzte Mal vor einem Jahr... Aber auch dort erzählen dann alle wieder, dass es verdammt viele Spieler gibt, die das unbedingt brauchen... nur tauchen die auch dort nicht auf...","replies":[{"poster":"Abasin","date":"2018-01-26T08:41:59.258+0000","up_votes":1,"down_votes":0,"body":"> Wobei... das ja auch wieder zu spannenden Fragen führt: Muss man dann in ARAM Ranked Banns einführen? Werden die Rerolls abgeschafft, damit alle Teams die gleichen Vorraussetzungen haben? Es wäre schließlich unfair, wenn das eine Team mit 2 richtig schwachen ARAM Champions spielen muss, weil die Spieler gerade keine Reroles haben, die im Gegnerteam aber schon... alles so fragen, mit denen sich Riot nicht beschäftigen will, weil sich aus ihrer Sicht der Aufwand nicht lohnt...\n\nMan muss nicht sklavenhaft die gleichen DInge wie in der Kluft machen. Auf Banns kann man völlig verzichten. Man könnte über einen Reroll pro Spiel nachdenken...aber das wars schon. \nDie Frage nach dem Championpool kam auch immer mal auf, mit dem Wunsch für ARAM Ranked alle Champions freizuschalten. Halte ich auch für Quatsch. In der Kluft gibt es genug OTPs, die nur ihre handvoll Champions spielen und sonst nix. Die Leute mit ihren speziellen ARAM-Accounts tun nichts anderes, als ihre ARAM-Favoriten zu spielen. So what? Also letztlich muss RIOT nicht viel tun ausser ein Ranglistensystem drüberstülpen und gut ist. Das dauert keine Jahre an Entwicklung.","replies":[{"poster":"MeMyselfandBaal","date":"2018-01-26T09:05:36.738+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Abasin,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=00040001,timestamp=2018-01-26T08:41:59.258+0000)\n>\n> Man muss nicht sklavenhaft die gleichen DInge wie in der Kluft machen. Auf Banns kann man völlig verzichten. Man könnte über einen Reroll pro Spiel nachdenken...aber das wars schon. \n> Die Frage nach dem Championpool kam auch immer mal auf, mit dem Wunsch für ARAM Ranked alle Champions freizuschalten. Halte ich auch für Quatsch. In der Kluft gibt es genug OTPs, die nur ihre handvoll Champions spielen und sonst nix. Die Leute mit ihren speziellen ARAM-Accounts tun nichts anderes, als ihre ARAM-Favoriten zu spielen. So what? Also letztlich muss RIOT nicht viel tun ausser ein Ranglistensystem drüberstülpen und gut ist. Das dauert keine Jahre an Entwicklung.\n\nHier ist der Grund, warum ich der Meinung bin, dass man im ARAM alle Champions freischalten sollte: Wenn dies nicht der Fall ist, wird man ab einer gewissen Elo geflamed, wenn man auf ein Mal schwache ARAM Champions besitzt... oder wenn man einen Champion einfach nicht beherrscht...\nDas mag jetzt völlig übertrieben wirken... aber im letzten ARAM meines Lebens wurde ich geflamed und fürs feeden reported, weil ich Master Yi nicht beherrsche... GG... \nWenn einem das selbst in der FunQue passiert, kannst du dir vorstellen, was in der Tryhard Que passiert... die einfachste Variante dies einzudämmen ist... alle Champs freizuschalten... Zumindest was die Championpicks anbelangt.\n\nAbgesehen davon soll es ja darum gehen, dass man mit jedem Champ klar kommt und sich anpasst... Wenn man dann einen ARAM Only Account mit 15 OP Champs aufmacht, wird diese Idee ad absurdum geführt.","replies":[]},{"poster":"Sirrkas","date":"2018-01-26T10:17:10.237+0000","up_votes":1,"down_votes":2,"body":"Rankeds sollten für alle die gleiche Möglichkeiten bieten, aufzusteigen. Im Draftpick wird das zwar durch Banns und Picks der anderen eingeschränkt, so dass eben nicht beide Teams den gleichen Champion haben können. Man hat aber die Kontrolle darüber, was man spielen will. Deswegen ist es hier nicht wichtig, alle Champions zu besitzen.  Es reicht völlig mit denen ins Ranked zu gehen, die einem gefallen. Wenn es dann einen OP Champ gibt, den gerade alle spielen wollen und man das selber gerne auch möchte, kann man den ganz leicht dazu erwerben und lernen. \n\nBei einem ARAM Ranked wäre ein großer Championpool aber ein Nachteil. Und einer, den man nicht einfach ausgleichen kann. Wenn jemand etwa Udyr und Kayn gerne in SR spielt, sind das eher Nachteile für ihn im ARAM. Da sind die beiden nicht gerade stark. Damit die Rangliste im ARAM fair wäre, müsste man allen Accounts eine Möglichkeit bieten, gleich gute Champions für den Modus erhalten zu können. \nDa im Ranked die freie Rotation wegfällt, würden ARAM-Mainaccounts sonst sehr starke Vorteile gegenüber Spielern genießen, die keinen Account dafür erstellt haben. \n\nDie bräuchten ja nur 10 relativ gute Champions, um gut da zu stehen und spielen zu können, wenn es keine Banns gibt. Etwa Sona, Lux, Ziggs etc. Damit es fair wird, gibt es eben ein paar einfache Möglichkeiten. Alle Champions sind immer für alle im ARAM-Ranked verfügbar. Dadurch ist es zufällig, wer was besitzt und man kann zeigen, wie gut man mit zufälligen Champions ist. Dadurch wird der Vorteil der ARAM-Mainaccounts negiert. \n\nAlternativ ginge auch das Gegenteil. Jeder Account wählt eine bestimmte Anzahl an Champions, die er im Ranked erhalten kann. Dadurch werden alle Accounts effektiv zu ARAM only Accounts mit den Champions, die sie da gerne spielen möchten. Dies hätte aber den Nachteil, dass das Spiel sehr, sehr, sehr langweilig wird, wenn das wenige Champions sind. Bei 10 Champs je Account als Minimum, würde man so gut wie immer, die selben 10 Champions in jedem ARAM Ranked ab einem gewissen Niveau haben. Die Leute wollen schließlich eine gute Chance auf den Sieg haben.","replies":[{"poster":"R3playZ3","date":"2018-01-26T13:14:32.739+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=000400010001,timestamp=2018-01-26T10:17:10.237+0000)\n>\n> Rankeds sollten für alle die gleiche Möglichkeiten bieten, aufzusteigen. Im Draftpick wird das zwar durch Banns und Picks der anderen eingeschränkt, so dass eben nicht beide Teams den gleichen Champion haben können. Man hat aber die Kontrolle darüber, was man spielen will. Deswegen ist es hier nicht wichtig, alle Champions zu besitzen.  Es reicht völlig mit denen ins Ranked zu gehen, die einem gefallen. Wenn es dann einen OP Champ gibt, den gerade alle spielen wollen und man das selber gerne auch möchte, kann man den ganz leicht dazu erwerben und lernen. \n> \n> Bei einem ARAM Ranked wäre ein großer Championpool aber ein Nachteil. Und einer, den man nicht einfach ausgleichen kann. Wenn jemand etwa Udyr und Kayn gerne in SR spielt, sind das eher Nachteile für ihn im ARAM. Da sind die beiden nicht gerade stark. Damit die Rangliste im ARAM fair wäre, müsste man allen Accounts eine Möglichkeit bieten, gleich gute Champions für den Modus erhalten zu können. \n> Da im Ranked die freie Rotation wegfällt, würden ARAM-Mainaccounts sonst sehr starke Vorteile gegenüber Spielern genießen, die keinen Account dafür erstellt haben. \n> \n> Die bräuchten ja nur 10 relativ gute Champions, um gut da zu stehen und spielen zu können, wenn es keine Banns gibt. Etwa Sona, Lux, Ziggs etc. Damit es fair wird, gibt es eben ein paar einfache Möglichkeiten. Alle Champions sind immer für alle im ARAM-Ranked verfügbar. Dadurch ist es zufällig, wer was besitzt und man kann zeigen, wie gut man mit zufälligen Champions ist. Dadurch wird der Vorteil der ARAM-Mainaccounts negiert. \n> \n> Alternativ ginge auch das Gegenteil. Jeder Account wählt eine bestimmte Anzahl an Champions, die er im Ranked erhalten kann. Dadurch werden alle Accounts effektiv zu ARAM only Accounts mit den Champions, die sie da gerne spielen möchten. Dies hätte aber den Nachteil, dass das Spiel sehr, sehr, sehr langweilig wird, wenn das wenige Champions sind. Bei 10 Champs je Account als Minimum, würde man so gut wie immer, die selben 10 Champions in jedem ARAM Ranked ab einem gewissen Niveau haben. Die Leute wollen schließlich eine gute Chance auf den Sieg haben.\n\naber das kann doch nicht wirklich das problem sein? ich meine riot freut sich doch wenn jeder noch nen zweiten (aram account) macht und die nutzer zahlen steigen und die spieler auch mit den zweitaccount geld ausgeben. jeder der es nutzen will kann es tun, wer nicht will der lässt es halt bleiben und steigt dann etwas langsamer auf.\n\naber um auch eine lösung deines genannten problems zu präsentieren habe ich folgende idee\n\nnehmen wir mal einfach diese seite als basis http://www.metasrc.com/all/aram/current/tierlist?ranks=platinum,diamond,master,challenger\ndas kann man natürlich noch viel viel filigraner machen\n\nein spieler startet ein aram ranked\n-> das system rollt die wahrscheinlichkeiten und entscheidet sich\nGOD champion\nBELOW AVERAGE champion\nBELOW AVERAGE champion\nBAD champion\nSTRONG champion\n\nteam A bestehend aus\nspieler1 1300mmr\nspieler2 1300mmr\nspieler3 1400mmr\nspieler4 1500mmr\nspieler5 1400mmr\n\ndie bekommen jetzt also champions aus ein und dem selben nützlichkeits pool, sie können zwar noch rerollen, würden aber wieder einen champion aus dem gleichen pool erollen\n\nteam B bestehen aus\nspieler1 1400mmr\nspieler2 1400mmr\nspieler3 1500mmr\nspieler4 1600mmr\nspieler5 1500mmr\n\nbekommen genau aus den gleichen pool die championzuweisung\n\nsomit bleibt der modus sogar random ;-)\n\nwie wir bemerkt haben ist team A das favoriten team da sie die höhere team mmr haben daher würde ich vorschlagen das das system innerhalb des nützlichkeitspools nochmal unterscheidet\n\nspieler 1 aus team A 1300mmr\nvs\nspieler 2 aus team B 1400mmr\n\ndas system weißt beiden einen BELOW AVERAGE champion zu, spieler 1 bekommt einen champion mit einer siegesquote von 50,18% und spieler 2 bekommt jetzt einen ganz minimalen vorteil da er aus dem selbigen pool einen champion mit 50,20% siegesquote bekommt.\n\nund für den fall das wir es ohne freischaltung aller champions haben wollen so sucht das system aus dem nützlichkeitspool zuerst nach gemeinsammen nennern beider teams und berücksichtigt dies schon vorzeitig im matchmaking.","replies":[{"poster":"Sirrkas","date":"2018-01-26T21:52:15.147+0000","up_votes":1,"down_votes":1,"body":">aber das kann doch nicht wirklich das problem sein? ich meine riot freut sich doch wenn jeder noch nen zweiten (aram account) macht und die nutzer zahlen steigen und die spieler auch mit den zweitaccount geld ausgeben.\n\nDa nach meinem Wissen Riot Smurfs nur toleriert und nicht befürwortet, werden sie wohl kaum etwas, vor allem keine Rangliste, einführen wollen, das die Leute dazu animiert, mehr Accounts erstellen. \n\n>nehmen wir mal einfach diese seite als basis http://www.metasrc.com/all/aram/current/tierlist?ranks=platinum,diamond,master,challenger \ndas kann man natürlich noch viel viel filigraner machen\n\nDer Link lädt ewig. Aber ich bin mal auf die Seite und hab die ARAM-Tierlist angesehen. Es ist schon erstaunlich, wie die ihre Liste erstellen. BC etwa hat 58 Punkte, bei einer Winrate von 48 %. Wie kommen die also darauf, dass BC überdurchschnittlich ist, Lulu aber, mit besserer Winrate, besserer KDA und lediglich niedrigerer Beliebtheit unterdurchschnittlich ist?\n\nWarum ist nicht Ziggs bei Lux im Godtier? Der gewinnt deutlich öfter.\n\nDazu gibt es bei deiner Sortierung nach Plat+ noch einen Haufen, nicht einsortierter Champions. Sollen die alle gestrichen werden, weil sie nicht oft genug aufgetaucht sind, für eine Bewertung? \n\nSolche Tierlisten, mag ich genau deswegen nicht. Die sind meist undurchsichtig erstellt und nicht sonderlich hilfreich dabei, zu erkennen, was warum besser sein soll. \n\nZudem entgeht mir, warum Riot so etwas kompliziertes entwerfen soll, wenn man stattdessen Fairness viel einfacher erlangt, indem einfach alle Champions freigeschalten sind. Macht den ARAM-Mains ARAM-Ranked etwa keinen Spaß , wenn sie etwas anderes, als ihre Lieblingschampions kriegen?\n\nDes weiteren erinnere ich mich noch, dass du beim ersten mal, als du die Liste erwähnt hast, die Punktzahl von Teemo für seine Winrate gehalten hast. ","replies":[{"poster":"R3playZ3","date":"2018-01-26T22:27:10.383+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=00040001000100000000,timestamp=2018-01-26T21:52:15.147+0000)\n>\n> Da nach meinem Wissen Riot Smurfs nur toleriert und nicht befürwortet, werden sie wohl kaum etwas, vor allem keine Rangliste, einführen wollen, das die Leute dazu animiert, mehr Accounts erstellen. \n> das kann man natürlich noch viel viel filigraner machen\n> \n> Der Link lädt ewig. Aber ich bin mal auf die Seite und hab die ARAM-Tierlist angesehen. Es ist schon erstaunlich, wie die ihre Liste erstellen. BC etwa hat 58 Punkte, bei einer Winrate von 48 %. Wie kommen die also darauf, dass BC überdurchschnittlich ist, Lulu aber, mit besserer Winrate, besserer KDA und lediglich niedrigerer Beliebtheit unterdurchschnittlich ist?\n> \n> Warum ist nicht Ziggs bei Lux im Godtier? Der gewinnt deutlich öfter.\n> \n> Dazu gibt es bei deiner Sortierung nach Plat+ noch einen Haufen, nicht einsortierter Champions. Sollen die alle gestrichen werden, weil sie nicht oft genug aufgetaucht sind, für eine Bewertung? \n> \n> Solche Tierlisten, mag ich genau deswegen nicht. Die sind meist undurchsichtig erstellt und nicht sonderlich hilfreich dabei, zu erkennen, was warum besser sein soll. \n> \n> Zudem entgeht mir, warum Riot so etwas kompliziertes entwerfen soll, wenn man stattdessen Fairness viel einfacher erlangt, indem einfach alle Champions freigeschalten sind. Macht den ARAM-Mains ARAM-Ranked etwa keinen Spaß , wenn sie etwas anderes, als ihre Lieblingschampions kriegen?\n> \n> Des weiteren erinnere ich mich noch, dass du beim ersten mal, als du die Liste erwähnt hast, die Punktzahl von Teemo für seine Winrate gehalten hast.\n\ngenau das würde ich auch sagen als entwickler aber mich insgeheime freuen das sie jetzt ein und den selben skin auf 3 verschiedenen account kaufen.\n\nich weiß nicht wie die seite den score errechnet, ich denke aber mal das sie metabezogene daten auswerten das steht ja meist auch oben rechts irgendwo welcher champions verbessert wurde oder veschlechtert und daraus erfolgt ja eine endlose kettenreaktion, der blitz der voher noch 48% winrate hatte wird nun durch patches aufgewertet und ist weiter oben anzusiedeln als zuvor noch. kann ich mir jetzt nur so logisch denken.\n\nwie ich selbst aber auch sagte kann man das ganze natürlich viel filigraner machen, riot wird die richtige winrate liste haben und daraus kann man dann natürlich einen viel besseren nützlichkeitspool erstellern als die verschiedenen seiten die vielleicht ein paar tage die api auslesen und diese daten als grundlage nehmen.\n\nich persönlich habe spaß daran jeden champion zu spielen und so ist es überwiegend bei uns im club mit über 100 mitgliedern aber wenn riot sich zumbeispiel denkt \"warum sollten wir denen alle champions schenken wenn sie auch alle kaufen können\" weil riot hat nix davon champions frei zugänglich für alle zu machen. dann wäre mein system eine alternative. es kann einfach nicht als grund aufgeführt werden das will ich damit zum ausdruck bringen, überall wo die skeptiker ihren unmut äußern dort gibt es wieder aram spieler die diesen unmut beseitigen können mit wieder neuen ideen und wir werden nicht dafür bezahlt, das riot team wird noch ganz andere möglichkeiten haben wenn man nur will.\n\nkannst du mir den link nochmal schicken wo ich das genau so gesagt habe? weil die winrate kann man ja auch einsehen auf dieser webseite aber gut das ist ja nun wirklich nebensächlich gerade. wenn ich das so geschrieben habe dann ups tut mir leid :-D","replies":[]}]}]}]}]},{"poster":"R3playZ3","date":"2018-01-23T19:15:26.938+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=0004,timestamp=2018-01-23T16:17:40.874+0000)\n>\n> Als jemand, der zu viel Zeit in diesem Forum verbringt... würde ich mal behaupten, dass zumindest hier mehr Leute URF in seienr Ursprünglichen Form wieder haben wollen...\n> \n> Also ja, das Thema kommt ein Mal im Quartal auf. Dann kriegt es ungefähr 15 Antworten... und dann ist es wieder erledigt. Eine Massenbewegung sieht irgendwie anders aus... Wenn es in anderen Foren anders ist, kannst du das ja bestimmt mit Quellen belegen... und im Gegensatz zu den Aussagen des Riot Mitarbeiters droht dir keine Strafe, wenn du hier andere Foren verlinkst. Und wenn das sooo viele fordern, wirst du ja auch sehr schnell fündig...\n> \n> Und ja, du hast Recht: ARAM ist als lustige Abwechslung zum Hauptspiel gedacht. Als Fun Modus, den man mal ganz entspannt spielen kann... und Riot will denn auch genau so lassen... allein schon, weil man sich dann nicht ums Balancing und Banns kümmern muss...\n> \n> Aber hey, von mir aus... wenn die paar Hanseln, die das unbedingt als Tryhard Modus wollen, den bekommen... (Also unter der Bedingung, dass in der Que immer alle Champions freigeschaltet sind... Damit es keine &quot;Ich habe halt nur die 5 besten Champs und rasiere deswegen&quot; Accounts gibt) würde das niemanden weh tun... die müssen dann ja mit den Warteschlangen und dem Matchmaking leben...\n> \n> Wobei... das ja auch wieder zu spannenden Fragen führt: Muss man dann in ARAM Ranked Banns einführen? Werden die Rerolls abgeschafft, damit alle Teams die gleichen Vorraussetzungen haben? Es wäre schließlich unfair, wenn das eine Team mit 2 richtig schwachen ARAM Champions spielen muss, weil die Spieler gerade keine Reroles haben, die im Gegnerteam aber schon... alles so fragen, mit denen sich Riot nicht beschäftigen will, weil sich aus ihrer Sicht der Aufwand nicht lohnt...\n> \n> Wenn dieser Thread 30 Upvotes und 5 Seiten Unterstützung kriegen würde... Aber die Vielen Spieler, die unbedingt ARAM Ranked wollen, sind anscheinend zu faul deswegen hier vorbeizukommen... Oder im englischsprachigen Forum... Also ich hab mal spaßeshalber im NA Forum nachgeguckt... da gab es das Thema das letzte Mal vor einem Jahr... Aber auch dort erzählen dann alle wieder, dass es verdammt viele Spieler gibt, die das unbedingt brauchen... nur tauchen die auch dort nicht auf...\n\ndas sind nur die ersten 5 seiten\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/ivKqRE5y-aram-ranked\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/E0KetuYq-aram-ranked\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/O0gcugYR-ranked-in-aram\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/refOpz2m-ranked-aram\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/JLrTbyHw-aram-ranked\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/st8lF52m-aram-ranked\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/jKiMLyTL-vorschlag-ranked-in-aram\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/6bPeeaiJ-aram-ranked-2016\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/nUP8i3ds-aram-ranked\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/sFwigNKm-aram-ranked\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/EldOeojn-aram-ranked\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/zVcInpd7-aram-ranked\n\nwieviele threads möchtest du haben? 30 40 oder 50 ? suche ich dir dann raus sobald ich mal zu viel zeit habe","replies":[{"poster":"MeMyselfandBaal","date":"2018-01-23T21:45:53.089+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=R3playZ3,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=00040000,timestamp=2018-01-23T19:15:26.938+0000)\n>\n> das sind nur die ersten 5 seiten\n>\n> \n> wieviele threads möchtest du haben? 30 40 oder 50 ? suche ich dir dann raus sobald ich mal zu viel zeit habe\n\nDanke, dass du meinen Punkt belegst... also die beiden jüngsten Threads sind 3 und 10 Monate alt. Der Beste Versuch kommt auf 9 Upvotes... Die Abstimmung ging 12 zu 27 gegen das Ranked Aram aus... und die [Online Petition](https://www.change.org/p/riot-games-petition-aram-ranked-league-of-legends) wurde von 21 Leuten unterstützt... noch 79 Unterstützer bis zum Meilenstein... ist in so fern gelogen, als dass eine Meile bei 1.600 beginnt, aber Details...\n\nIm Wesentlichen unterstützen die geposteten Threads meine These: Es gibt das Volksbegehren ARAM, so wie du es hier dastellst, einfach nicht. Es gibt immer wieder mal nen paar vereinzelte, die die Idee vorbringen, sie trifft aber immer auf wenig Gegenliebe...\n\nGerade die Petition ist da wirklich nicht gut ffür dein \"1.) wirklich viele menschen fordern den aram rank modus\" Denn die Seite wird in verschiedensten Foren gepostet worden sein. Trotzdem kamen keine 100 Leute zusammen... Nur um das mal zu vergleichen: Die [Make Urf a permanent Game Mode Petition](https://www.change.org/p/riot-games-make-ultra-rapid-fire-a-permanent-game-mode-on-league-of-legends) kam damals auf 22.000 Unterstützer...  Beim selben Anbieter für solche Aktionen...\n\nSieh es ein: Deine Argumentationsgrundlage geht einfach völlig an der Wirklichkeit vorbei. Es interessiert sich kaum jemand für ein ARAM Ranked... Die meisten wollen es als Funmode und Abwechslung nutzen, haben aber keinen Bock auf eine Tryhard Version dieser Que. \n\nAber hey, du könntest ja mal all die Leute aus den alten Threads anschreiben und eine neue Petition starten... vielleicht kommt ihr dann auf 100 Leute... Nur kannst du mit 100 Leuten keien Ranked Que aufmachen.","replies":[{"poster":"R3playZ3","date":"2018-01-23T23:34:27.379+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=000400000000,timestamp=2018-01-23T21:45:53.089+0000)\n>\n> Danke, dass du meinen Punkt belegst... also die beiden jüngsten Threads sind 3 und 10 Monate alt. Der Beste Versuch kommt auf 9 Upvotes... Die Abstimmung ging 12 zu 27 gegen das Ranked Aram aus... und die [Online Petition](https://www.change.org/p/riot-games-petition-aram-ranked-league-of-legends) wurde von 21 Leuten unterstützt... noch 79 Unterstützer bis zum Meilenstein... ist in so fern gelogen, als dass eine Meile bei 1.600 beginnt, aber Details...\n> \n> Im Wesentlichen unterstützen die geposteten Threads meine These: Es gibt das Volksbegehren ARAM, so wie du es hier dastellst, einfach nicht. Es gibt immer wieder mal nen paar vereinzelte, die die Idee vorbringen, sie trifft aber immer auf wenig Gegenliebe...\n> \n> Gerade die Petition ist da wirklich nicht gut ffür dein &quot;1.) wirklich viele menschen fordern den aram rank modus&quot; Denn die Seite wird in verschiedensten Foren gepostet worden sein. Trotzdem kamen keine 100 Leute zusammen... Nur um das mal zu vergleichen: Die [Make Urf a permanent Game Mode Petition](https://www.change.org/p/riot-games-make-ultra-rapid-fire-a-permanent-game-mode-on-league-of-legends) kam damals auf 22.000 Unterstützer...  Beim selben Anbieter für solche Aktionen...\n> \n> Sieh es ein: Deine Argumentationsgrundlage geht einfach völlig an der Wirklichkeit vorbei. Es interessiert sich kaum jemand für ein ARAM Ranked... Die meisten wollen es als Funmode und Abwechslung nutzen, haben aber keinen Bock auf eine Tryhard Version dieser Que. \n> \n> Aber hey, du könntest ja mal all die Leute aus den alten Threads anschreiben und eine neue Petition starten... vielleicht kommt ihr dann auf 100 Leute... Nur kannst du mit 100 Leuten keien Ranked Que aufmachen.\n\nwow so viel leidenschaft das ließt sich richtig gut, ich werd bei zeiten mal alles raus suchen und einen extra thread dazu eröffnen da lege ich dann alle zahlen ab zu jeglichen posts. dauert halt ne weile aber es wird kommen.\n\ndie anzahl der zeit spielt für mich hier keine wirkliche rolle in welchen zeitraum die spieler das fordern, fakt ist es wird gefordert.","replies":[{"poster":"Sirrkas","date":"2018-01-23T23:41:03.409+0000","up_votes":2,"down_votes":2,"body":">die anzahl der zeit spielt für mich hier keine wirkliche rolle in welchen zeitraum die spieler das fordern, fakt ist es wird gefordert.\n\nWobei es aber ziemlich unwichtig ist, wenn es alle paar Monate ein mal von jemandem vorgeschlagen wird. Du hast angegeben, es wäre DER Modus, der am meisten von der Community gefordert wird, was aber einfach nicht stimmt. \n\nWenn alle 2 Monate jemand schreibt, Teemo/Yasuo/Riven solle gelöscht werden, wird das auch gefordert. Das heißt aber nicht, dass die Community als ganzes das fordert oder es eine gute Idee wäre.","replies":[{"poster":"Canis858","date":"2018-01-24T12:05:45.868+0000","up_votes":2,"down_votes":2,"body":"Aber genau an diesem Thread hier solltest du doch sehen, dass dies eben doch erwünscht ist. Sonst hätte dieser Thread ja nicht 26 Kommentare in ca.21 Std.","replies":[{"poster":"Sirrkas","date":"2018-01-24T12:37:40.550+0000","up_votes":2,"down_votes":2,"body":"Lies dir die Antworten durch. Wenn von den Kommentatoren nur einer Pro ARAM Ranked ist und der Rest Contra ARAM Ranked, spricht das nicht dafür, dass die Leute für ARAM Rankeds sind.","replies":[{"poster":"Canis858","date":"2018-01-24T13:02:06.890+0000","up_votes":1,"down_votes":1,"body":"Nur weil nur diejenigen, die dagegen sind hier schreiben, heist es nicht, dass die Akzeptanz für ein ARAM-Ranked nicht gegeben ist. Außerdem lebt dieses Spiel ja auch von Neuerungen, oder siehst du das anders?","replies":[{"poster":"Sirrkas","date":"2018-01-24T13:05:08.382+0000","up_votes":1,"down_votes":1,"body":"Hängt von den Neuerungen ab. Wenn morgen ein Champion eingeführt wird, der alle 50 Sekunden R drücken kann und damit automatisch alle anderen Champions tötet (auch das eigene Team), wäre das keine gute Neuerung.","replies":[{"poster":"Canis858","date":"2018-01-24T13:42:11.250+0000","up_votes":1,"down_votes":0,"body":"Aber durch ARAM-Ranked wird ja nur ein Spielmodus erneuert und sonst nur die Motivation der Spieler die dies Wünschen gesteigert.\n\nWenn allerdings dieser Champion als Event in einem 1v4 Match reingepatcht wird könnte es interessant sein;)","replies":[{"poster":"Sirrkas","date":"2018-01-24T14:32:11.652+0000","up_votes":1,"down_votes":1,"body":"Der Modus wird nicht wirklich erneuert. Er würde neu definiert werden. Von \"zock mit einem zufälligen Champion und schau wies läuft\" zu \"versuch doch in der Rangliste mit zufälligen Champions aufzusteigen\".\n\nDazu kommt noch die Problematik, dass es Resourcen abzieht und viel mehr Balancing benötigt, wenn daraus ein Rank Modus wird.\n\n>Wenn allerdings dieser Champion als Event in einem 1v4 Match reingepatcht wird könnte es interessant sein;)\n\nNicht, sobald die Todestimer 45 Sekunden betragen.","replies":[{"poster":"Canis858","date":"2018-01-25T15:51:04.178+0000","up_votes":1,"down_votes":0,"body":"Um mit irgendeinem Champion zu spielen, um zu sehen wie es läuft kann man auch Kooperativ spielen oder den Übungsmodus nutzten. Außerdem ist hier ja nicht die Rede davon, dass man den \"normalen\" ARAM-Modus in ein Ranked ändert, sondern nur um eine Erweiterung.\nUnd zu dem zweiten Punkt: \nWenn man mit Blitzcrank oder Sion spielt dürfte man diesen Champ gut auskontern können. Ebenso wäre das Item Schutzengel eine gute Wahl. Außerdem muss er ja erst einmal Stufe 6 werden!","replies":[{"poster":"Sirrkas","date":"2018-01-25T16:59:08.583+0000","up_votes":1,"down_votes":1,"body":">Um mit irgendeinem Champion zu spielen, um zu sehen wie es läuft kann man auch Kooperativ spielen oder den Übungsmodus nutzten.\n\nKeine Ahnung, wie du darauf kommst. Wo habe ich denn behauptet, dass ARAM ein Testmodus sein soll?","replies":[{"poster":"Canis858","date":"2018-01-25T21:48:40.276+0000","up_votes":1,"down_votes":0,"body":"Du meintest, dass ARAM vom einen _mit zufälligen Champ zu zocken und gucken wie es dann ist_ zu _mit zufälligen Champs die Rangliste erklimmen_ mutiert.","replies":[]},{"poster":"Sirrkas","date":"2018-01-26T10:00:11.717+0000","up_votes":1,"down_votes":1,"body":"Das ist im Grunde der Unterschied zwischen Ranked und nicht Ranked für ARAM. Jetzt wüsste ich aber gerne, wie da der Teil mit, man kann Champions im Übungsmodus oder gegen Bots testen dazu passt.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"R3playZ3","date":"2018-01-24T21:44:56.842+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=00040000000000000000,timestamp=2018-01-23T23:41:03.409+0000)\n>\n> Wobei es aber ziemlich unwichtig ist, wenn es alle paar Monate ein mal von jemandem vorgeschlagen wird. Du hast angegeben, es wäre DER Modus, der am meisten von der Community gefordert wird, was aber einfach nicht stimmt. \n> \n> Wenn alle 2 Monate jemand schreibt, Teemo/Yasuo/Riven solle gelöscht werden, wird das auch gefordert. Das heißt aber nicht, dass die Community als ganzes das fordert oder es eine gute Idee wäre.\n\nwieviele menschen mussten denn dafür stimmen das es für den gewundenen wald ranks gibt? :) das würde mich jetzt aber mal interessieren da hier der eindruck entstehen könnte das es nur umgesetzt wird wenn viele menschen es verlangen oder irgendeine petiton unterschreiben.\n\nich als etwickler würde nen mist darauf setzen was irgendwer will weil vom gesamten game vielleicht 1% im forum aktiv ist oder unter 1% die petiton unterschreibt, ich als entwickler würde mich hier auf zahlen verlassen die das system mir ausspuckt.\n\nda aram ohne jeglichen zeifel mehr gespielt wird als der gewundene wald wäre das doch mal ein punkt zum nachdenken oder? aram wird seit monaten bereits gebalanced mit den patchs also verstehe ich hier nicht das einige schreiben es wäre zu viel arbeit dies zu tun, es passiert doch schon :-D","replies":[{"poster":"Sirrkas","date":"2018-01-24T22:33:02.000+0000","up_votes":1,"down_votes":1,"body":">wieviele menschen mussten denn dafür stimmen das es für den gewundenen wald ranks gibt? :) das würde mich jetzt aber mal interessieren da hier der eindruck entstehen könnte das es nur umgesetzt wird wenn viele menschen es verlangen oder irgendeine petiton unterschreiben.\n\nKeine Ahnung, hat denn jemand dafür gestimmt? Soweit ich mich zurück erinnern kann, gab es das schon immer. \n\n>ich als etwickler würde nen mist darauf setzen was irgendwer will weil vom gesamten game vielleicht 1% im forum aktiv ist oder unter 1% die petiton unterschreibt, ich als entwickler würde mich hier auf zahlen verlassen die das system mir ausspuckt.\n\nWäre dein gutes Recht. Wenn Riot aber kein ARAM-Ranked einführen wird, ist das deren Entscheidung. \n\n>da aram ohne jeglichen zeifel mehr gespielt wird als der gewundene wald wäre das doch mal ein punkt zum nachdenken oder? aram wird seit monaten bereits gebalanced mit den patchs also verstehe ich hier nicht das einige schreiben es wäre zu viel arbeit dies zu tun, es passiert doch schon :-D\n\nWas ist daran jetzt die Zahl dahinter, dass die Leute gerne ARAM Rankeds hätten? Sollte Riot meinen, das wäre eine gute Idee, können die das gerne machen. Ist deren Spiel. Allerdings ist deine Argumentation lückenhaft und deine Annahme, alle fänden ARAM Ranked toll, die auch ARAM spielen, nichts weiter als eine Annahme.\n\nWenn die Community hinter so etwas steht, besteht auch die Chance, dass es kommt. ARAM ist ja schließlich ein Funmode, der von der Community quasi erfunden wurde und so beliebt war, dass es einen eigenen Spielmodus erhalten hat.","replies":[]}]}]}]}]}]}]},{"poster":"R3playZ3","date":"2018-01-24T15:40:41.766+0000","up_votes":2,"down_votes":0,"body":"vielleicht bekommen wir ja zumindest bald mal einen turnier modus das würde alle aram fans für einige jahre zumindest halbwegs zufrieden stellen","replies":[{"poster":"Canis858","date":"2018-01-24T21:02:51.188+0000","up_votes":3,"down_votes":0,"body":"Wäre auf jedenfall ein Anfang!","replies":[]}]},{"poster":"Sirrkas","date":"2018-01-23T17:55:07.709+0000","up_votes":2,"down_votes":1,"body":">1.) der rechtsklick wurde abgeschafft um personen zur gamelobby einzuladen\n\nKlappt bei mir.\n\n>1.) wirklich viele menschen fordern den aram rank modus\n\nNicht das ich wüsste. Meistens bist das hier du.","replies":[{"poster":"Abasin","date":"2018-01-25T07:52:32.670+0000","up_votes":2,"down_votes":0,"body":"Es geht um den Rechtsklick in der Clubliste...{{sticker:sg-shisa}} {{sticker:sg-zephyr}} {{sticker:sg-janna}}","replies":[{"poster":"Like a Sir","date":"2018-01-25T13:11:38.773+0000","up_votes":2,"down_votes":0,"body":"Das ist Blasphemie!","replies":[]}]},{"poster":"R3playZ3","date":"2018-01-23T19:13:59.416+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=0006,timestamp=2018-01-23T17:55:07.709+0000)\n>\n> Klappt bei mir.\n> \n> Nicht das ich wüsste. Meistens bist das hier du.\n\n1.) ich glaube dir kein wort kannst du bitte ein kurzvideo davon machen?\nmit dem erweis das diese leute die du dort per rechtsklick einlädst nicht auf deiner friendsliste sind. weil ich kriege es nicht hin und die 100 mitglieder aus meinen aram club auch nicht :( daher musst du mal deinen trick verraten.\n\n2.) das sind nur die ersten 5 seiten\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/ivKqRE5y-aram-ranked\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/E0KetuYq-aram-ranked\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/O0gcugYR-ranked-in-aram\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/refOpz2m-ranked-aram\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/JLrTbyHw-aram-ranked\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/st8lF52m-aram-ranked\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/jKiMLyTL-vorschlag-ranked-in-aram\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/6bPeeaiJ-aram-ranked-2016\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/nUP8i3ds-aram-ranked\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/sFwigNKm-aram-ranked\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/EldOeojn-aram-ranked\n\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/zVcInpd7-aram-ranked\n\nwieviele threads möchtest du haben? 30 40 oder 50 ? suche ich dir dann raus sobald ich mal zu viel zeit habe","replies":[{"poster":"Sirrkas","date":"2018-01-23T21:33:17.917+0000","up_votes":2,"down_votes":2,"body":"Wenn du mit dem Einladen über Rechtsklick etwas anderes gemeint hast, als die Freundesliste, hättest du das besser erläutern können. So denkt jeder zuerst an diese Funktion und nicht daran, dass es in Clubs nicht gehen könnte. \n\nWenn ich nach ARAM und Ranked über die Suchfunktion suche, finde ich 15 Threads, die das als Thema zu haben scheinen. Die sind teilweise aber 3 Jahre alt. 5 Threads je Jahr, sind nicht gerade \"wirklich viele\". Ob es der meistgeforderte Modus in diesem Forum ist, steht auf einem anderen Blatt. Aber Anfragen über Spielmodi, in älteren Patches gibt es ähnlich oft.\n\nWenn stattdessen 15 Threads, von verschiedenen TEs unabhängig voneinander, seit Neujahr erstellt worden wären, wäre das viel näher dran, an meist gefordert.","replies":[]}]}]},{"poster":"Il Sten lI","date":"2018-01-23T20:53:16.156+0000","up_votes":2,"down_votes":0,"body":"Mal meine zehn Cent:\n\n1.) Rechtsclick-invite aus club: Ich **vermute** dies ist gewollt, um anonyme premades zu unterbinden (-> es gibt auch keine chaträume à la \"party ip weekend\" mehr). Riot möchte die Spieler animieren (drängen!?), mit bekannten Freunden zu spielen; Riot hat die Statistiken, also vielleicht unverhältnismäßig hohe Reportzahlen der eigenen teammates als Grundlage...\n\n2.) URF: Meine Unlust auf SR und LoL i.A. ist mir auch schon aufgefallen. Während durch URF bei vielen kurzzeitig timings und gameplan völlig verwursten, spielt für mich auch definitiv etwas anderes eine Rolle: URF verdeutlicht mir persönlich sehr deutlich, **wie wenig Spaß** ich am normalen SR noch habe...","replies":[]},{"poster":"Herr Hübsch","date":"2018-01-23T15:34:27.605+0000","up_votes":3,"down_votes":1,"body":"es gab pro-teams? thats weird","replies":[{"poster":"R3playZ3","date":"2018-01-23T15:42:13.965+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=BreakYourHeadxD,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=0002,timestamp=2018-01-23T15:34:27.605+0000)\n>\n> es gab pro-teams? thats weird\n\nauf den turnierplattformen sicher, es gab ein pro team die haben über 90% aller aram turniere gewonnen","replies":[{"poster":"Allerbester Biss","date":"2018-01-23T17:40:22.831+0000","up_votes":2,"down_votes":0,"body":"Wenn man gegen Silber Bronze Gold Platin spielt...","replies":[{"poster":"R3playZ3","date":"2018-01-23T19:16:42.911+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Allerbester Boss,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=000200000000,timestamp=2018-01-23T17:40:22.831+0000)\n>\n> Wenn man gegen Silber Bronze Gold Platin spielt...\n\naram silber gold usw? klar aber im halbfinale/finale wirds auch häufiger dia/master/challanger aram mmr spieler geben","replies":[{"poster":"Allerbester Biss","date":"2018-01-23T19:36:43.437+0000","up_votes":1,"down_votes":0,"body":"Jaja ganz klar.\nUnd am Ende hat man da Top1-5 Challenger im Gegner Team","replies":[{"poster":"R3playZ3","date":"2018-01-23T20:01:30.469+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Allerbester Boss,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=00020000000000000000,timestamp=2018-01-23T19:36:43.437+0000)\n>\n> Jaja ganz klar.\n> Und am Ende hat man da Top1-5 Challenger im Gegner Team\n\nwer ist den top 1-5?\nunter den top 5 aram spielern waren sicher mal welche dabei das weiß ich wohl","replies":[{"poster":"Allerbester Biss","date":"2018-01-23T22:04:23.882+0000","up_votes":1,"down_votes":0,"body":"Sehr wahrscheinlich die ARAM Challenger..\nAch sag nicht, dass es die nicht gibt und nie geben wird :-D","replies":[{"poster":"R3playZ3","date":"2018-01-23T23:29:46.353+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Allerbester Boss,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=0002000000000000000000000000,timestamp=2018-01-23T22:04:23.882+0000)\n>\n> Sehr wahrscheinlich die ARAM Challenger..\n> Ach sag nicht, dass es die nicht gibt und nie geben wird :-D\n\nsollte so sein ja","replies":[]}]}]}]}]}]}]}]},{"poster":"Megamaexx","date":"2018-01-23T15:57:45.944+0000","up_votes":3,"down_votes":1,"body":"Du hast echt ein ganz großes Talent. Du nennst “Fakten“ und belegst diese nicht.\nSowas wie “habe ich bereits an anderer stelle aufgeführt für die skeptiker.“ überzeugt Skeptiker keineswegs","replies":[{"poster":"R3playZ3","date":"2018-01-23T16:10:18.386+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=0003,timestamp=2018-01-23T15:57:45.944+0000)\n>\n> Du hast echt ein ganz großes Talent. Du nennst “Fakten“ und belegst diese nicht.\n> Sowas wie “habe ich bereits an anderer stelle aufgeführt für die skeptiker.“ überzeugt Skeptiker keineswegs\n\nman nehme alle posts aus allen internationalen foren\n1.) du zählst die posts\n2.) du zählst die einzelnen beiträge der posts\n3.) und die klicks der posts\n\nich meine wofür gibts eine sufu? das sollte recht schnell übersichtlich dargestellt werden wer es wirklich wissen will, aber wie oben erwähnt habe ich das in einem weiteren älteren post bereits getan. wer da zu faul ist sondern nur schnell irgendwas hier einwerfen will tja selbst schuld.","replies":[{"poster":"R3playZ3","date":"2018-01-23T16:13:05.270+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=R3playZ3,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=00030000,timestamp=2018-01-23T16:10:18.386+0000)\n>\n> man nehme alle posts aus allen internationalen foren\n> 1.) du zählst die posts\n> 2.) du zählst die einzelnen beiträge der posts\n> 3.) und die klicks der posts\n> \n> ich meine wofür gibts eine sufu? das sollte recht schnell übersichtlich dargestellt werden wer es wirklich wissen will, aber wie oben erwähnt habe ich das in einem weiteren älteren post bereits getan. wer da zu faul ist sondern nur schnell irgendwas hier einwerfen will tja selbst schuld.\n\nzumal meine glaubwürdigkeit habe ich bereits mehrfach bewiesen, schau einfach mal in meinen älteren posts vorbei :-) dafür klickst du einfach auf meinen namen hier im forum und dort werden sie angezeigt","replies":[]}]}]},{"poster":"Homunculi","date":"2018-01-23T15:27:54.468+0000","up_votes":2,"down_votes":1,"body":">ich weiß sogar aus verlässlicher quelle (riot support) das riot das genau so beabsichtigt\n\nBehaupten kann ja jeder sowas, kannst du auch Beweise liefern? \n\nUnd überhaupt, was hat RIOT so beabsichtigt? Das ist leider nicht ganz klar.\n\n\n\n\n>1.) wirklich viele menschen fordern den aram rank modus\n\nGehöre ich persönlich nicht dazu\n\n\n>2.) es gab unzählige beschwerden gegen den rechtsklick\n\nPersonen können doch immer noch eingeladen werden, das hat eher was mit der Clientaktualiserung zutun, wenn ich dich jetzt überhaupt richtig verstehe.\n\n>3.) es gab unzählige beschwerden gegen das neue 0-8-15 aram\n\nWo? bei Reddit?\n\n\nAuf URF kann ich auch gut und gerne verzichten :x, aber jedem das seine.","replies":[{"poster":"R3playZ3","date":"2018-01-23T15:39:10.752+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Homunculi,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=0001,timestamp=2018-01-23T15:27:54.468+0000)\n>\n> Behaupten kann ja jeder sowas, kannst du auch Beweise liefern? \n> \n> Und überhaupt, was hat RIOT so beabsichtigt? Das ist leider nicht ganz klar.\n> \n> Gehöre ich persönlich nicht dazu\n> \n> Personen können doch immer noch eingeladen werden, das hat eher was mit der Clientaktualiserung zutun, wenn ich dich jetzt überhaupt richtig verstehe.\n> \n> Wo? bei Reddit?\n> \n> \n> Auf URF kann ich auch gut und gerne verzichten :x, aber jedem das seine.\n\n1.) mir wurde mal gesagt von einem riot supporter das ich seine aussage nicht verwenden darf da mir ansonsten sperre droht daher möchte ich die direkten zitate auch nicht einfügen aber was meine allgemeine glaubwürdigkeit angeht darfst du dich gerne in meinen letzteren posts bedienen als es um aram ging\n\n2.) das mag gut sein :) die meisten spielen halt wirklich SR\n\n3.) persönlich bringt einem club aber nicht sehr viel da nicht jeder der 100 mitglieder jeden addet und somit war der rechtsklick ein bereicherung für aram und das war übrigens der punkt der so beabsichtig war, du fragtest ja weiter oben was der riot support mit bestätigt hat, er hat mir bestätigt das das auflösen des rechtsklicks beabsichtig ist.\n\n4.) nein hier im forum :-D","replies":[]}]},{"poster":"Canis858","date":"2018-01-23T15:20:11.169+0000","up_votes":1,"down_votes":0,"body":"Eine strategische Meisterleistung würde ich es nicht nennen, da dadurch auch \"ARAM-Mains\" (wie ich) geboren werden. Außerdem wäre es von Riot sehr unintelligent, wenn Sie einen oft geforderten Spielmodus nicht (irgendwann) einführen würden, weil ihnen dadurch sehr viele Spieler, die genau sowas wollen an andere Games, die dies anbieten, verloren gehen.","replies":[{"poster":"R3playZ3","date":"2018-01-23T15:33:47.356+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Canis858,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=0000,timestamp=2018-01-23T15:20:11.169+0000)\n>\n> Eine strategische Meisterleistung würde ich es nicht nennen, da dadurch auch &quot;ARAM-Mains&quot; (wie ich) geboren werden. Außerdem wäre es von Riot sehr unintelligent, wenn Sie einen oft geforderten Spielmodus nicht (irgendwann) einführen würden, weil ihnen dadurch sehr viele Spieler, die genau sowas wollen an andere Games, die dies anbieten, verloren gehen.\n\naber sie haben es zugegeben schau mal in den news bei den letzten folgen \"frag riot\" wenn man ein festes pferd im stall hat wie bei der formel 1 ferrari dann gibts intern immer diese absprache das der erste fahrer das ding auch gewinnt ganz gleich ob es auch fans von dem zweiten fahrer gibt. das system ist seit uhrzeiten schon im gebrauch und eher eine blanke berechnung.\n\n> Außerdem wäre es von Riot sehr unintelligent, wenn Sie einen oft geforderten Spielmodus nicht (irgendwann) einführen würden\n\ndas ding ist sie wollen die spieler ja nicht grundsätzlich verärgern aber durch kleinere abschwächungen springen immer mal wieder spieler ab und wechseln dann zu SR das ist gezieltes stark halten des hauptmodus","replies":[{"poster":"Canis858","date":"2018-01-24T13:58:33.850+0000","up_votes":1,"down_votes":1,"body":"Ein so stark gespieltest Spiel wird es wohl verkraften können, wenn ein paar Spieler das Hauptspiel als eher sekundär betrachten.\nEs sollte lieber der Hauptmodus verbessert werden, um mehr Spieler dafür zu aquirieren, als das alle Anlternativen zu Tode gepatcht werden!","replies":[]}]}]},{"poster":"Shiggyvara","date":"2018-01-23T16:29:20.011+0000","up_votes":2,"down_votes":2,"body":"Wenn es nach den Forenpostern hier gehen würde müsste man auch den 10-Kampf als olympische Disziplin abschaffen.\nIch meine jemand der in 10 Sportarten antritt und in jeder davon nicht die Ergebnisse erzielt, wie jemand der sich nur auf die eine Sportart konzentriert so jemanden kann man doch nicht ernst nehmen.","replies":[{"poster":"R3playZ3","date":"2018-01-23T17:08:42.281+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Shiggyvara,realm=EUW,application-id=cGRapXds,discussion-id=MXZUpkBW,comment-id=0005,timestamp=2018-01-23T16:29:20.011+0000)\n>\n> Wenn es nach den Forenpostern hier gehen würde müsste man auch den 10-Kampf als olympische Disziplin abschaffen.\n> Ich meine jemand der in 10 Sportarten antritt und in jeder davon nicht die Ergebnisse erzielt, wie jemand der sich nur auf die eine Sportart konzentriert so jemanden kann man doch nicht ernst nehmen.\n\nkommt ja auf den verband an der das ausrichtet vielleicht gibt es längst aram ranks nur von einem anderen entwickler team die nunmal wert darauf legen","replies":[]}]}]}