{"poster":"R3playZ3","date":"2017-12-18T18:57:19.810+0000","title":"aram wettkapf","subforum":"Karten & Spielmodi","up_votes":2,"down_votes":1,"body":"wann kommt der aram wettkampf?\r\nin der kluft kann man sich ja immer sofort mit jedem erdenklichen modus besch&auml;ftigen aber wann passiert mal was wettkampforientiertes in aram? die inoffiziellen turniere k&ouml;nnen doch nicht alles sein.\r\n\r\nnicht jeder bekommt zu einem festen zeitpunkt immer 5 spieler on mit denen er dann von 19 bis 23 uhr zockt, wir brauchen den wettkampfmodus!\r\n\r\nund wenn hier wieder einer kommt mit **-&gt; aram ist nicht balanced &lt;-**\r\n\r\nmacht euch bitte nicht l&auml;cherlich :-D wieviele zahlen muss ich euch noch pr&auml;sentieren eh ihr von euren stumpfen nachgelaber endlich herunter kommt.","replies":[{"poster":"Megamaexx","date":"2017-12-18T19:01:19.128+0000","up_votes":2,"down_votes":2,"body":"aram ist zu random für einen kompetitiven Modus. Außerdem wird League of Legends nicht darauf gebalanced, gerecht im aram zu sein.","replies":[{"poster":"R3playZ3","date":"2017-12-18T22:45:26.372+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=cGRapXds,discussion-id=tfQELvyp,comment-id=0000,timestamp=2017-12-18T19:01:19.128+0000)\n>\n> aram ist zu random für einen kompetitiven Modus. Außerdem wird League of Legends nicht darauf gebalanced, gerecht im aram zu sein.\n\ndas ist eine unwahre aussage","replies":[{"poster":"Megamaexx","date":"2017-12-19T05:08:28.077+0000","up_votes":3,"down_votes":2,"body":"Winrates im aram einzelner Champions klaffen von 31% bis 71%. Das ist ein Nachweis für unbalanced. Beweis geliefert, viel Erfolg beim widerlegen. \n(Quelle: http://www.aram-ranked.info/euw/statistics/champion )","replies":[{"poster":"R3playZ3","date":"2017-12-19T09:56:40.908+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=cGRapXds,discussion-id=tfQELvyp,comment-id=000000010000,timestamp=2017-12-19T05:08:28.077+0000)\n>\n> Winrates im aram einzelner Champions klaffen von 31% bis 71%. Das ist ein Nachweis für unbalanced. Beweis geliefert, viel Erfolg beim widerlegen. \n> (Quelle: http://www.aram-ranked.info/euw/statistics/champion)\n\nThe page you were looking for doesn't exist.\n\naber mal davon ab gibt es diese zahlen auch für die kluft wenn ich jetzt lange genug suchen würde. und dann google mal pepe show die mit ihren team fast 90% aller turniere gewonnen haben und das natürlich ohne aram account. wie kann bei einen umbalanced game immer ein und die selbe manschaft gewinnen bei einer auswahl von knapp 1000 verschiedenen teams?\n\nin aram gewinnt das team mit mehr skill, mit den besseren teammechanismen und nicht das team mit den besseren chas :D aber wenn du es auf low elo spieler beziehst hast du natürlich recht, aber genau so werden die in der kluft im niedrigen elo bereich eher mit den besseren champions gewinnen.","replies":[{"poster":"Abasin","date":"2017-12-19T10:54:24.229+0000","up_votes":3,"down_votes":0,"body":"> The page you were looking for doesn't exist.\n\nMach einfach die Klammer am Ende weg. {{sticker:poppy-wink}} Die ist irgendwie in den Link reingerutscht.","replies":[{"poster":"Megamaexx","date":"2017-12-19T12:37:07.712+0000","up_votes":2,"down_votes":1,"body":"Hab mal ein Leerzeichen im falschen Link ergänzt, der funzt jetzt^^","replies":[]}]},{"poster":"Megamaexx","date":"2017-12-19T12:40:30.243+0000","up_votes":1,"down_votes":1,"body":"Pepe show gegoogelt. Ich wollte keine Klamotten kaufen, danke. Links sind immer eindeutiger als “google mal“","replies":[{"poster":"R3playZ3","date":"2017-12-19T13:28:04.610+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=cGRapXds,discussion-id=tfQELvyp,comment-id=00000001000000000001,timestamp=2017-12-19T12:40:30.243+0000)\n>\n> Pepe show gegoogelt. Ich wollte keine Klamotten kaufen, danke. Links sind immer eindeutiger als “google mal“\n\nklar irgendwas zu klicken ist natürlich immer besser als selbst zu recherchieren ;) deshalb kommen ja auch so nutzlose aussagen zustande wie \"unbalanced\"\n\nich mag es nicht wenn man irgendwas aus einer theorie heraus redet ohne festen grund und boden aber scheint voll dein ding zu sein.","replies":[{"poster":"Megamaexx","date":"2017-12-19T14:18:31.277+0000","up_votes":1,"down_votes":1,"body":"Ohne Zahlengrundlage fehlt dir die Aussagekraft. Solange du etwas nicht belegen kannst, ist es deine Meinung/Wahrnehmung, aber noch lange keine Tatsache.","replies":[]}]}]}]},{"poster":"R3playZ3","date":"2017-12-19T13:33:07.111+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=cGRapXds,discussion-id=tfQELvyp,comment-id=000000010000,timestamp=2017-12-19T05:08:28.077+0000)\n>\n> Winrates im aram einzelner Champions klaffen von 31% bis 71%. Das ist ein Nachweis für unbalanced. Beweis geliefert, viel Erfolg beim widerlegen. \n> (Quelle: http://www.aram-ranked.info/euw/statistics/champion )\n\n http://www.aram-ranked.info :D okok damit ist unser gespräch beendet, das ist die mit unter schlechteste seite die es überhaupt gibt und zeigt das du absolut keinen plan von der materie hast.","replies":[{"poster":"eingew","date":"2017-12-19T13:45:02.418+0000","up_votes":2,"down_votes":1,"body":"Ist op.gg schlecht? Die zeigt nämlich ähnliche WRs.\n\nAbgesehen davon solltest auch du dir etwas Demut zulegen. Kleiner Tipp, man bringt seine Idee nicht unters Volk, indem man ihm vorwirft, keine Ahnung zu haben und nichts zu verstehen.","replies":[{"poster":"R3playZ3","date":"2017-12-19T14:18:26.906+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=cGRapXds,discussion-id=tfQELvyp,comment-id=00000001000000010000,timestamp=2017-12-19T13:45:02.418+0000)\n>\n> Ist op.gg schlecht? Die zeigt nämlich ähnliche WRs.\n> \n> Abgesehen davon solltest auch du dir etwas Demut zulegen. Kleiner Tipp, man bringt seine Idee nicht unters Volk, indem man ihm vorwirft, keine Ahnung zu haben und nichts zu verstehen.\n\ndie seiten sind da verschieden aber im allgemeinen ist op.gg schon etwas hochwertiger, es geht ja hier um die allgemeine diskussionsgrundlage, der gibt sich absichtlich keine mühe und sucht gezielt nach ärger was er weiter unten ja sogar zugibt.\n\nwenn wir über die wesentlichen dinge mal reden würden und nicht diese uhralten kamellen auspacken das aram nicht balanced ist was ich in ka wievielen threat inzwischen wiederlegt habe.\n\nfakt ist doch das aram derzeit sehr monoton ist und mal einen anstrich bräuchte, ein ligasystem will man aus welchen gründen auch immer nicht, öffentliche aram turniere werden dann aber wieder von riot unterstützt oO da fühlt mich sich leicht veräppelt :D","replies":[{"poster":"Megamaexx","date":"2017-12-19T15:24:16.350+0000","up_votes":2,"down_votes":1,"body":"Okay, die Winrates lt. op.gg klaffen von 33% bis 67%. Wenn das balanced ist, dann brauchen wir in Summoners Rift ja gar nix mehr veränder n. Deine weiteren Posts sind zwar nicht an mir vorbeigegangen, allerdings habe ich da keine Zahlen in Erinnerung. Was ist deine Argumentationsgrundlage, abgesehen von deiner Wahrnehmung? Du benötigst lediglich einen Link, der deine Aussage unterstützt, um gegen mich argumentieren zu können. Übrigens wollte ich eine Diskussion auslösen mit einer bewusst provokanten Äußerung. Ich will wahre Werte von dir und nicht nur deine in den Raum gestellten Aussagen. Wir haben nun eine veraltete Quelle und eine aktuelle Quelle, die zum selben Schluss führen. Du behauptest ohne Grundlage das Gegenteil. Wenn es dir zu anstrengend wird, da einen Hauch Seriosität reinzubringen, dann lass es einfach ganz sein.","replies":[{"poster":"R3playZ3","date":"2017-12-19T16:25:54.969+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=cGRapXds,discussion-id=tfQELvyp,comment-id=0000000100000001000000000000,timestamp=2017-12-19T15:24:16.350+0000)\n>\n> Okay, die Winrates lt. op.gg klaffen von 33% bis 67%. Wenn das balanced ist, dann brauchen wir in Summoners Rift ja gar nix mehr veränder n. Deine weiteren Posts sind zwar nicht an mir vorbeigegangen, allerdings habe ich da keine Zahlen in Erinnerung. Was ist deine Argumentationsgrundlage, abgesehen von deiner Wahrnehmung? Du benötigst lediglich einen Link, der deine Aussage unterstützt, um gegen mich argumentieren zu können. Übrigens wollte ich eine Diskussion auslösen mit einer bewusst provokanten Äußerung. Ich will wahre Werte von dir und nicht nur deine in den Raum gestellten Aussagen. Wir haben nun eine veraltete Quelle und eine aktuelle Quelle, die zum selben Schluss führen. Du behauptest ohne Grundlage das Gegenteil. Wenn es dir zu anstrengend wird, da einen Hauch Seriosität reinzubringen, dann lass es einfach ganz sein.\n\n1.)\nhttp://www.aram-ranked.info/euw/statistics/ranking_top\n^^\ndas sind laut aram-ranked die besten spieler\nCas\nAyphir\nRlco38\nFcknZapdosBtch\nDarkZed107\n\nschaut man jetzt bei whatismymmr.com findet man hier die tollen jungs.\nCas mit gerade mal 2400+mmr soviel mmr hatte ich selbst schon :-D das heißt er ist nicht einer top 10 spieler, er gehört mit 2400mmr nichtmal zu den top 1000 euw und das ist fakt\n\naram-ranked.info basiert auf anmeldungen in form von profilsuchen, whatismymmr.com hingegen hat eine feste datenbank der momentan 17,650,766 aktivsten spieler euw und ist somit um X% genauer als aram-ranked.info und jetzt beziehe ich mich lediglich auf diesen einen vergleich.\n\nich habe nie behauptet whatismymmr.com ist die beste seite im netz, es soll nur verdeutlichen mit welcher vorsicht aram-ranked.info zu genießen ist.\n\n2.)\nseiten die irgendwelche zahlen darstellen sind nicht wirklich seriös wenn du die genaueren quellen nicht kennst woraus sie das beziehen.\n\nwas wurde in deiner rechnung gewertet?\ndie letzten 10 spiele zufälliger spieler?\ndie letzten 1000 spiele zufälliger spieler?\nalle spiele die seit des letzten updates gemacht wurden?\nwurden hier nur high elo spieler gewertet oder ist es ein schnitt vielleicht sogar weltweit?\n\ngenau das meine ich, es macht garkeinen sinn irgendeinen link zu dropen wenn man nicht dazu angibt auf was es sich bezieht und da wiederspreche ich dir\n\nbesser man sagt nix als das man etwas falsches sagt\nund nicht\nbesser man sagt überhaupt irgendetwas\n\n3.)\nauf http://www.metasrc.com\nhaben wir zumbeispiel einen SR wert der verschiedenen champions zwischen 34,78 und 53,97 wenn ich jetzt weitere seiten durchsuche könnte ich sicher mühelos einen abstand von mehr als 45 ausfindig machen aber auf welcher basis?\n\nich würde dir ans herz legen selbst erfahrung zu machen, adde mal eine hand voll 3000+mmr spieler und dann machst du mit deinen team ein spiel gegen diese jungs und ich verspreche dir das sie gewinnen werden ganz gleich welche teamcomp ihr pickt. ich hab die erfahrung gemacht in über 50 games habe ich vielleicht 4x gewonnen\n\n4.)\nweiter zu pepe show (das team das über 90% aller turniere gewonnen hat) was in einem unbalancen modus nicht möglich wäre.\n\nich mache es dir an der stelle einfach ich klicke wahllos auf die ersten 6 turniere die ich finde und wir schauen mal was daraus kommt\n\nhttps://battlefy.com/aramamabend/aram-am-abend-90/5681d9f7825e6846009e768c/stage/56896fd3423c63530043db05/bracket/\n\npepeshow gewinnt das turnier mit über 30 teilnehmern\n\nhttps://battlefy.com/aramamabend/aram-am-abend-89/566eca67377a0d4a00668e19/stage/5682e012d554f38f0086d2de/bracket/\n\nda nächstes auch gewonnen\n\nhttps://battlefy.com/aramamabend/aram-am-abend-86/566356350728cd48003f0f79/stage/56730dd8ba879c510062759e/bracket/\n\nda waren sie zumindest im finale\n\nhttps://battlefy.com/aramamabend/aram-am-abend-84/566354425a41b1500030f7ab/stage/566354425a41b1500030f7ac/bracket/\n\nwieder im finale und gegen ein ebenfalls prominentes team verloren\n\nhttps://battlefy.com/aramamabend/aram-am-abend-83/565ebc97409fd54a0052cc26/stage/565ebc97409fd54a0052cc27/bracket/\n\nsie gewinnen das turnier\n\nhttps://battlefy.com/aramamabend/aram-am-abend-81/565eb96057d6f64a009bb943/stage/565eb96057d6f64a009bb944/bracket/\n\nsie gewinnen das turnier im finale sogar gegen die nunus bot bande\n\n5.)\njetzt gehe ich mal auf den einwurf ein das aram auch nicht balanced wird.\n\nim letzten update wurden die runen verändert (die runen für alle spielmodi) nur weil sie in aram zu op waren, dann wurde der modus balanced als sie die gold items raus genommen haben, als sie an den towern geschraut haben, die minion respawn zeiten veränderten, heal spawn zeiten verändert wurden. wenn ich jetzt weiter suche finde ich noch über 100 weitere balance changes alleine für aram.\n\naber die gegenfrage sollte auch sein warum sollte man aram nicht balancen? riot sieht das potential in aram sonst wäre es kein fester modus der zwischenzeitlich mehr als 5x so häufig am tag gespielt wurde wie der gewunde wald","replies":[{"poster":"Megamaexx","date":"2017-12-19T16:53:26.740+0000","up_votes":1,"down_votes":1,"body":"Na geht doch, damit kann man arbeiten =)\n\nwhatismymmr.com gibt mir scheinbar aufm Handy nicht dieselben Möglichkeiten wie auf nem PC. Dazu möchte ich nur anmerken, dass das nicht der Riot-MMR-Wert ist, da dieser nicht preisgegeben wird. \n\nBei meiner Quelle stand bei jedem Champion die Anzahl der berücksichtigten Spiele. Dooferweise ist die Seite nicht up to date.\n\nMetasrc gibt hier nicht die Winrates der Champions allgemein wieder, sondern auf bestimmten Rollen/Positionen. So eine Auswertung entfällt im ARAM sowieso. Metasrc gibt dir übrigens allerhand Informationen darüber, worauf die Daten basieren, aber das wäre schon wieder was für eine andere Diskussion. \nTeams mit hohem MMR würden auch mein Team auseinandernehmen, auch wenn die die schlechtesten Champions spielen. Das liegt einfach mal daran, dass der Skillunterschied so gewaltig ist, dass der Champion keinen Unterschied macht. Ich denke mal, das muss ich nicht beweisen und in dem Punkt gebe ich dir auch Recht.\n\nDie Turniere werde ich mir mal bei Gelegenheit genauer anschauen, aufm Handy ist das nicht so prickelnd.","replies":[{"poster":"R3playZ3","date":"2017-12-20T00:24:44.071+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=cGRapXds,discussion-id=tfQELvyp,comment-id=000000010000000100000000000000000000,timestamp=2017-12-19T16:53:26.740+0000)\n>\n> Na geht doch, damit kann man arbeiten =)\n> \n> whatismymmr.com gibt mir scheinbar aufm Handy nicht dieselben Möglichkeiten wie auf nem PC. Dazu möchte ich nur anmerken, dass das nicht der Riot-MMR-Wert ist, da dieser nicht preisgegeben wird. \n> \n> Bei meiner Quelle stand bei jedem Champion die Anzahl der berücksichtigten Spiele. Dooferweise ist die Seite nicht up to date.\n> \n> Metasrc gibt hier nicht die Winrates der Champions allgemein wieder, sondern auf bestimmten Rollen/Positionen. So eine Auswertung entfällt im ARAM sowieso. Metasrc gibt dir übrigens allerhand Informationen darüber, worauf die Daten basieren, aber das wäre schon wieder was für eine andere Diskussion. \n> Teams mit hohem MMR würden auch mein Team auseinandernehmen, auch wenn die die schlechtesten Champions spielen. Das liegt einfach mal daran, dass der Skillunterschied so gewaltig ist, dass der Champion keinen Unterschied macht. Ich denke mal, das muss ich nicht beweisen und in dem Punkt gebe ich dir auch Recht.\n> \n> Die Turniere werde ich mir mal bei Gelegenheit genauer anschauen, aufm Handy ist das nicht so prickelnd.\n\nja das ist korrekt aber der angegebene wert ist einer der meiner meinung nach mit am nähesten ran kommt zumindest merkt man die unterschiede im spiel sehr deutlich.\n\n Metasrc gibt einen score aber die winrate auch wenn du mit der maus drauf stehen bleibst.\n\ngenau das sage ich ja lediglich, der skill entscheidet letzlich den gesamten modus. kleinere mmr unterschiede werden sicher auch durch teamcomps gewonnen und dann ist auch glück im spiel na klar aber im großen und ganzen kommt hier jeder auch nur dort hin wo er hin gehört ganz genau wie in der kluft der beschwörer","replies":[]}]}]}]}]}]},{"poster":"Megamaexx","date":"2017-12-19T14:16:42.750+0000","up_votes":1,"down_votes":1,"body":"Nun, ich gebe eine Quelle an. Du behauptest stur. Meine Aussagen haben öffentliche Zahlen dahinter. Deine nicht. Gib mir deine Quellen und wir können weiterreden.","replies":[{"poster":"R3playZ3","date":"2017-12-19T14:55:41.945+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=cGRapXds,discussion-id=tfQELvyp,comment-id=00000001000000010001,timestamp=2017-12-19T14:16:42.750+0000)\n>\n> Nun, ich gebe eine Quelle an. Du behauptest stur. Meine Aussagen haben öffentliche Zahlen dahinter. Deine nicht. Gib mir deine Quellen und wir können weiterreden.\n\ndann beschäftige dich vielleicht mal mit den seiten die du postest, ich bring ja hier schließlich auch keine bildzeitung.de statistiken","replies":[{"poster":"Megamaexx","date":"2017-12-19T15:09:09.481+0000","up_votes":2,"down_votes":1,"body":"Richtig, du bringst gar keine.","replies":[]}]}]}]}]}]},{"poster":"Abasin","date":"2017-12-18T22:15:01.858+0000","up_votes":3,"down_votes":1,"body":"ARAM muss nicht gebalanced werden. Es ist ok wie es ist. Man muss es halt üben. Wie alles sonst auch.","replies":[{"poster":"Megamaexx","date":"2017-12-19T05:14:37.913+0000","up_votes":2,"down_votes":2,"body":"Was ist das denn für eine Aussage? Wenn Riot das als Wettkampf-Modus nutzen würde, muss es gebalanced werden. Da kann man üben, wie man will, es ist halt nicht gebalanced.","replies":[{"poster":"Abasin","date":"2017-12-19T07:08:42.051+0000","up_votes":2,"down_votes":0,"body":"Löse Dich von dem Pick-and-Ban Gedanken. Man kann einen Wettkampfmodus auch auf der Prämisse aufbauen, den Zufall als spiel(mit)bestimmendes Element zu benutzen. Das ist für Dein lineares Denken sicher sehr verunsichernd, aber spiel mal sehr lange ARAM, dann kannst Du auch in unmöglichen Teamcombos gewinnen, Skill auf dem Champion spielt auch hier eine Rolle. Denn der Zufall trifft ja jeden gleichermassen. Über einen längeren Zeitraum. Und ich kenne Spieler, die inzwischen über 4000 ARAM Wins auf dem Konto haben, die müssen ja irgendwie damit klarkommen.\n\nWenn Du Dir die Auswertungen einschlägiger Seiten ansiehst, die ELOs schätzen oder ein eigenes Punktesystem zu Grunde legen, dann sind auch ARAM-ELOs normalverteilt. Und ja, die Zahlenwerke basieren auf Vermutungen, wie RITO seine MMR/ELO errechnet. Aber mit ein wenig mathematischem Verständnis kann man solche Dinge auch recht genau nachmodellieren. Das ist kein Hexenwerk.","replies":[{"poster":"Megamaexx","date":"2017-12-19T13:03:45.276+0000","up_votes":2,"down_votes":2,"body":"Klar kann man sich da ein MMR zusammenrechnen, das nicht vom Zufall abhängt. Dafür benötigt man aber auch ziemlich viele Spiele. Ich habe bei Wettkampf allerdings eher an ein Turnier gedacht, was nur verhältnismäßig wenige Spiele beinhalten würde. Umso geringer die Anzahl der Spiele, umso größeren Einfluss hat der random-Faktor.\nIch muss auch zugeben, dass ich mit meinem Ausgangs-Kommentar den TE triggern wollte :P","replies":[]}]}]}]}]},{"poster":"R3playZ3","date":"2018-01-07T07:05:37.020+0000","up_votes":2,"down_votes":0,"body":"wir wollen freibier und zwar sofort","replies":[]},{"poster":"R3playZ3","date":"2017-12-19T09:59:55.642+0000","up_votes":2,"down_votes":0,"body":"wer ist eigentlich der ersteller des textes \n\"aram ist zu random\"\n\"ungebalanced\"\n\ndas kann einfach kein brain sein, schaut euch alleine das letzte update mal genauer an, aussage direkt wiederlegt","replies":[]},{"poster":"Arcen","date":"2017-12-18T19:36:21.996+0000","up_votes":2,"down_votes":2,"body":"Also erstmal solltest du Wettkampf als Titel richtig schreiben, zweitens die haben gerade vor paar Tage Competition für 5v5 reingebracht... es gab buggs am ersten Tag und alles musste neugestartet werden und du erwartest, dass es gleich sofort das selbe für ARAM rauskommt?!?! \nVerstehe mich nicht falsch... ich wäre auch dafür, aber sei bitte bisschen geduldig da noch sich alles in der Alpha/Beta Phase befindet! Diese Leistung ist schon genug fürs erste denn das ist ein grosser Schritt für die kommende Season 8","replies":[{"poster":"R3playZ3","date":"2017-12-18T22:47:34.037+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Arcen,realm=EUW,application-id=cGRapXds,discussion-id=tfQELvyp,comment-id=0001,timestamp=2017-12-18T19:36:21.996+0000)\n>\n> Also erstmal solltest du Wettkampf als Titel richtig schreiben, zweitens die haben gerade vor paar Tage Competition für 5v5 reingebracht... es gab buggs am ersten Tag und alles musste neugestartet werden und du erwartest, dass es gleich sofort das selbe für ARAM rauskommt?!?! \n> Verstehe mich nicht falsch... ich wäre auch dafür, aber sei bitte bisschen geduldig da noch sich alles in der Alpha/Beta Phase befindet! Diese Leistung ist schon genug fürs erste denn das ist ein grosser Schritt für die kommende Season 8\n\nohh war ich ein wenig hastig aber danke fürs erwähnen ;)\n\nist doch alles ok solange sie drüber nachdenken überhaupt mal irgendwann irgendetwas für aram zu tun, dann wäre ich schon sehr glücklich.","replies":[]}]}]}