{"poster":"ToasI3rot","date":"2016-01-22T23:58:10.318+0000","title":"Was haltet ihr von den Junglern?","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Guten Tag, \n\nich wollte mal nachfragen was ihr von ein paar Champion im Jungle haltet, welchen Schwierigkeitsgrad ihr diese einsch&auml;tzen w&uuml;rdet, wie usefull sie zur Zeit sind, ob es sich lohnt einen von denen zu mainen und welcher zur Zeit am st&auml;rksten ist. Ich kann mich n&auml;mlich nicht entscheiden aber diese hier gefallen mir sehr:\n\nElise\nJ4\nMaster Yi\nQuinn\nLee Sin\nNidalee\nPantheon\nEvelynn\nRek Sai\nNocturne\n\nVielleicht kann mir ja auch jemand sagen welcher der genannten Champion f&uuml;rs Soloq am besten w&auml;re. Ich danke euch schon mal im Vorraus und vielleicht nimmt sich ja jemand etwas Zeit um etwas n&auml;her drauf ein zu gehen welcher Champ sich von denen am meisten Lohnt zu trainieren :)","replies":[{"poster":"sN00Bdogg","date":"2016-01-25T19:56:04.308+0000","up_votes":1,"down_votes":0,"body":"Wie ich sehe spielst du silver/Bronze irgendwo. (Ich bin Main Jungle in der Bronx)\n\nAlle gennanten Jungler können sehr gut sein! Vielleicht denkst Du mal an folgende Aspekte:\n\n1) Der Char muss Dir liegen. Also spiel mal paar normals und schau, ob Du mit den Combos etc zurecht kommst\n2) Wie kann ich mit dem Char ganken? Gibts nen Gapcloser/Stun/Speedbuff? Welchen Cooldown hat dieser? Ist es ein skill-shot?\n3) Wann kann ich mit dem Char ganken? Bestes Beispiel: Warwick ohne Ulti kann nicht ganken! Will ich also einen Spielstil mit frühen ganks, dann kein ww!\n4) Inwieweit kann ich auf mein Team zählen? (Eine Jarvan-Ulti kann sehr stark sein, ist aber auch davon abhängig, daß dein Team was daraus macht!)\n5) Welches Level muss ich erreichen, um nen Solo-Drake hinzulegen? Denn oft genug gibts keinerlei Hilfe aus Bot- oder Midlane und der erste Drake geht oft an den, der zuerst kommt! Das gleiche gilt natürlich analog für den Herold und den Baron. Mit WW hatte ich schon Solo-Baron auf Level 15 und das mit dem normalen WW-Build. (Das alles kann man sehr schön im Freien Spielmodus mit Bots durchexerzieren! Und ausserdem nebenbei seine Runen optimieren.)\n6) Was passiert, wenn mir mein Team keinen Pull gibt? Können die ersten paar Nester auch solo gelöst werden?\n7) Wie oft wird der Char gebannt? Welchen zweiten Char habe ich, der als Ersatz dient und vielleicht auf dem gleichen Runensatz eingesetzt werden kann?\n8) Was taugt der Char im Endgame?\n9) Inwieweit ist der Char anfällig bei Invades? Spiel mal nen Fiddle oder WW-Jungle, bei dem der erste Blue gestohlen wird! Von dem Schlag erholen sich die beiden so langsam, daß sie für de ersten 10 Minuten aus dem Spiel sind!\n10) Zu guter Letzt kannst Du Dir ja in LOLKING die Charts anschauen und die Chars mit der höchsten Gewinnrate suchen. Soweit ich weiss kann man dies auch nach Bronze/Silber etc sortieren.\n\nTipp:\nVon meinem Sohn weiss ich, daß Xin und Nocturne auch in Platin super Winrates haben können.","replies":[]},{"poster":"Razgalor","date":"2016-01-25T15:11:31.370+0000","up_votes":1,"down_votes":0,"body":"Kann dir nicht zu allen was sagen aber erstmal: Comfort > Champ\n\nDer Champion kann noch so op sein, viel wichtiger ist, dass du dich mit dem Champion wohl fühlst. Letzte Season war Sejuani zeitweise verdammt stark und es wurde gerne ein Vergleich zu Amumu gezogen, welcher ähnlich aber zu dieser Zeit nicht so gut war wie sie. Trotzdem habe ich als Amumu wesentlich bessere Ergebnisse erzielt, weil ich mit Ihm besser zurecht kam. Zudem ändert sich das mit dem OP alle paar Wochen/Monate. zur Zeit ist ein Master Yi wenn er seinen Verschlinger voll hat absolut abartig. Lass sie den Verschlinger ändern oder kleine Änderungen an Yi vornehmen und schon ist er es nicht mehr und nen totales Gankopfer, weil er nur laufen kann (q zähle ich hier nicht, weil man da landet wo man herkam und daher idR keine Distanz zurücklegt in Bezug aufs Disengagen) und squishi ist. Von daher guck welcher Champ dir liegt und übe ihn (wenn du Yi spielen willst, weil du einfach gut mit dem Stil des Champions klar kommst und dann weißt wie mit schwächen umzugehen ist etc. kannst du ihn ja auch immer noch gut spielen, wenn er nicht mehr op ist).\n\nZudem gilt: je stärker ein Champion ist umso öfter ist er gebannt. Den zu Mainen bringt daher nicht viel, weil du ihn eh erst wieder regelmäßig spielen kannst, wenn er nicht mehr op ist (ich habe letzte Season sehr viel mit Rengar gespielt, da er jetzt ziemlich stark geworden ist, ist er ständig gebannt und ich bin aktuell eher auf Vi umgestiegen, weil ich Rengar in etwa 80% der Spielen eh nicht spielen kann, da er gebannt oder gepickt ist).\n\nZu den einzelnen Champions:\n\nIch habe jetzt nicht nachgeguckt in welcher Elo du bist bzw. wie du so spielst (dafür müsste ich dich ja spielen sehen, Elo sagt ja - gerade jetzt - nicht viel aus).\n\nIch würde auf Lee Sin auf jeden Fall verzichten. Er hat theoretisch ein gutes Kit und (obwohl jeder Ihn letzte Season gepickt hat obwohl es eine absolut - Fluchwort - Idee war) inzwischen viabel ist sollte man ihn in der low elo nicht spielen. Denn: man kann zwar in der Theorie wunderschöne Plays machen und sich dann denken wow bin ich eine harte sau, hast du den geilen move gesehen? Ich bin ein Gott. Soweit die Theorie: das wird fast nie passieren (wegen der paar male wo man dann doch was schafft haben die Leute ihn aber weiter gepickt -.-). Der Punkt ist nämlich: Lee Sin ist SCHWER, er ist sau Schwer. Richtig gespielt ist er inzwischen eine gute Wahl aber da muss man erstmal hinkommen. Sein Abfallen im Late wurde etwas abgefangen, weswegen er early kills inzwischen nutzen kann zum snowballen (was bisher halt nicht der Fall war, ich habe 8:2:6 Lee Sins gesehen die im Lategame trotzdem komplett useless waren und somit nur die eigenen Carrys geschwächt hatten).\nDazu kommt natürlich DER Klassiker: man tritt die Gegner mit der Ult in Sicherheit.\n\nElise hat eine ähnliche Problematik, wobei nicht ganz so schlimm meiner Meinung nach und du rettest den Gegner nicht aus Versehen.\n\nNida ist halt nen ccopfer und useless wenn behind. Wenn man sie aber einigermaßen beherrscht in der lowelo super, weil die Leute ihre Schwächen nicht ausnutzen und nicht dodgen können.\n\nPantheon bin ich selber noch am ausprobieren. Er hat 3 Probleme. 1. useless gegen Tanks (die gerade eh extrem stark sind) 2. fällt im late durch steigende tankyness der Gegner ab 3. cc anfällig. Er hat dafür nen sehr starkes early und midgame, ein kit ohne skillshoots aber mit Poke, CC, aoe und solange die Ulti up ist bist du eine Konstante Bedrohung auf der ganzen Map (solange deine Gegner nicht wissen wo du bist). Er ist also ne gute Wahl, wenn die Gegner weich und dein Team aufs early ausgelegt ist.\n\nNocturne ist ganz nice, weil du halt nen 100% sicheren engage hast mit der Ulti, würde da aber grundsätzlich Rengar vorziehen, wenn du mit ihm klar kommst. Die beiden sind sich ähnlich aber Rengar ist einfach stärker (wobei man zZ halt die oben geschilderte Problematik bedenken muss).\n\nQuinn ist halt gerade (wie Graves) nen guter Adc im jungle (Probleme von Quinn stehen hier ja schon in einem anderen Beitrag). Gehört für mich aber zu der Kategorie Champ die im Jungle gar nicht mehr spielbar sein wird im Laufe der Season durch Änderungen (wissen kann man es nicht aber ich denke schon, dass das so sein wird).","replies":[]},{"poster":"Visuš","date":"2016-01-25T14:23:23.026+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ToasI3rot,realm=EUW,application-id=vatevpvi,discussion-id=N5pHmqxj,comment-id=,timestamp=2016-01-22T23:58:10.318+0000)\n>\n> Guten Tag, \n> \n> ich wollte mal nachfragen was ihr von ein paar Champion im Jungle haltet, welchen Schwierigkeitsgrad ihr diese einsch&auml;tzen w&uuml;rdet, wie usefull sie zur Zeit sind, ob es sich lohnt einen von denen zu mainen und welcher zur Zeit am st&auml;rksten ist. Ich kann mich n&auml;mlich nicht entscheiden aber diese hier gefallen mir sehr:\n> \n> Elise (mit der stärkste Metajungler z.Zt.)\n> J4 (eher nicht so toll, ungesunden ersten clear und bietet nichts, was z.B. lee nicht kann)\n> Master Yi (devourer ist n schlechtes Item. Warrior yi nie gesehen)\n> Quinn (starker jungler. einfacher clear, gute ganks v.a. nach 6)\n> Lee Sin (mit Elise der beste Jungler z.Zt. allerdings erheblich schwerer zu meistern als Elise)\n> Nidalee (sehr gute Nidalees sind immernoch ne Qual. Ansonsten eher nicht so toll)\n> Pantheon (k.A.)\n> Evelynn (hab ich S5 gespamt, bin mir nicht ganz schlüssig, wo sie aktuell steht)\n> Rek Sai (eher fürs comp. gaming als für soloq n toppick)\n> Nocturne (Ult ist leider sehr eindimensional. Einmal rein gibts kein zurück. Ist ok, aber nicht top)\n> \n> Vielleicht kann mir ja auch jemand sagen welcher der genannten Champion f&uuml;rs Soloq am besten w&auml;re. Ich danke euch schon mal im Vorraus und vielleicht nimmt sich ja jemand etwas Zeit um etwas n&auml;her drauf ein zu gehen welcher Champ sich von denen am meisten Lohnt zu trainieren :)\n\nGraves und Kindred sind momentan noch sehr starke Picks","replies":[]},{"poster":"Baka Shiro","date":"2016-01-23T00:14:38.862+0000","up_votes":1,"down_votes":0,"body":"was magst du am meisten vom typ her d.h. kämpfer,tank,assasine,ap etc ich spiele zur zeit yi und muss sagen er macht sehr spaß elise ist auch gut aber du musst mit ihr spielen können damit sie was taugt. Quinn ist gut die probleme sind ihre R kostet viel zu viel mana am anfang. Zu den anderen kann ich nix wirkliches sagen weil ich sie so gut wie gar nicht spiele ich lasse dir mal einen yt link den ein challenger heute rausgebracht hat kannst es dir mal anschauen wenn du lust hast ^^ https://www.youtube.com/watch?v=NwqvQB4vSWQ","replies":[]},{"poster":"OneViArmy","date":"2016-01-23T00:13:05.011+0000","up_votes":1,"down_votes":0,"body":"Zu Main Nidalee ; \n\nDas Farmen ist early und late sehr einfach . \nFür das Ganken ist Nidalee Perfekt du wirfst einen Speer die gegner wissen du wirst springen \n (Bronze - Gold) SPRING UND HOL DIR DEN KILL , sei dir bewusst das sie flashen also bereite dich darrauf vor .\n (Gold+) Nach dem Speer verfolg sie CC wird kommen DODGEN zwei schritte zur Seite KILLEN und wegflashen falls es ein Dive ist \n\nNIDA IST EIN BIEST . spiel sie nicht gegen tanks mfg","replies":[]},{"poster":"Call me Br00t","date":"2016-01-23T00:39:26.571+0000","up_votes":1,"down_votes":1,"body":"Elise, J4, Lee, Nida, Rek, Kindred, Rengar, Mundo, Graves, Shyvana, (Shaco)\n\nSind im Moment die Top SoloQ Jungler haben alle guten clearspeed, early dmg und können gut ganken.\n\nDa es eh nur ums erarly geht wer es härter snowballt (Vorrausgesetzt man wirft es am Ende nicht weg) kannst du mit den oberen dein Ziel eig sehr gut erreichen.","replies":[]},{"poster":"DrYatty","date":"2016-01-23T00:13:30.529+0000","up_votes":1,"down_votes":1,"body":"Hallo _Toasl3rot_\n\nDies ist meine Meinung!\n\n\nNatürlich könnte ich jetzt zu jeden Champ etwas schreiben aber ich werde dir nur meine Favoriten nennen.\n\n{{champion:64}} ist momentan gut dabei kann Tanky werden und mach viel Schaden.\n\n{{champion:5}}  ist einfach nur der Hammer! Falls du Xin noch nicht besitzt würde ich dir empfehlen ihn zu zulegen da er im Moment in der Meta viel zusagen hat.\n{{champion:59}} und {{champion:421}} kann man picken wenn das Team noch jemanden braucht der etwas Tankiger wird und guten Schaden anrichtet. Klar kann das Lee Sin auch aber Lee Sin kann irgendwie mehr als die beiden. Aber da kommt es drauf an wie man sie spielt.\n{{champion:11}} zu guter letzt. In kann man wirklich immer spielen wenn man ihn beherrscht und weiß welche Items man kaufen muss.\n\nIch finde alle Champions **außer** {{champion:133}} {{champion:76}} und {{champion:80}} momentan sehr gut. Da ich diese Champions sehr selten im Jungle sehe deswegen kann ich auch nichts dazu sagen.\n\nWeiterhin wünsche ich allen die diesen Beitrag lesen eine erfolgreiche Season 2016 und nachträglich ein wundervolles Jahr 2016! \n\n{{sticker:slayer-pantheon-thumbs}} \n\nIhr findet einen Rechtschreibfehler? Sagt mir bescheid ich gebe euch einen {{item:2009}} \n\n\nMit freundlichen Grüßen\n\nOnly {{champion:89}} Supp","replies":[]}]}