{"poster":"Penns","date":"2017-06-08T11:57:35.365+0000","title":"Imo PD is too good on Yasuo and the main reason why he is so strong top lane","subforum":"Gameplay","up_votes":3,"down_votes":2,"body":"I mean, it gives him \r\n\r\n* 45% attack speed, which doesnt only boost his auto attacks but also his Q speed and cooldown\r\n* 60% crit, just a {{item:1018}} makes that 100% for an early spike\r\n* Basically 12% move speed in combat (and he ignores minion block)\r\n* Pre-nerf Ninja Tabi damage reduction in duels. Not just on auto attacks tho, on everything except true damage.\r\n\r\nAnd its not even an expensive item at all, it literally costs as much as two BF swords.\r\n\r\nI think the offensive stats are fine but the dmg reduction passive should be reworked again either into something more interactive/delayed that helps with dueling or something offensive.","replies":[{"poster":"Anhartamin","date":"2017-06-08T13:22:51.972+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"IronwallJackson","date":"2017-06-08T19:28:42.003+0000","up_votes":1,"down_votes":0,"body":"Yasuo's build had been Shiv/IE/crit runes long before the changes to crit items though. Hitting full or nearly full crit relatively early isn't anything new for him.","replies":[{"poster":"Anhartamin","date":"2017-06-08T19:57:36.480+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"FeelsCampedMan","date":"2017-06-08T20:52:55.594+0000","up_votes":1,"down_votes":0,"body":"Yasuo has never built more than 2 crit items\nEver","replies":[]},{"poster":"IronwallJackson","date":"2017-06-08T20:19:22.907+0000","up_votes":1,"down_votes":0,"body":"Yasuo players always ran crit runes to make up the 10% missing from Shiv/IE, even during the period where Riot knocked like 5% chance off of one of those items. Regardless, back then, Shiv+Cloak let players hit 80% and their runes brought it up to 90.\n\nGrabbing a trinity, or rather, a Zeal to finish later, was just the thing you did you avoid running crit runes.","replies":[]}]}]},{"poster":"Ralanr","date":"2017-06-08T13:24:08.871+0000","up_votes":1,"down_votes":0,"body":"Yet he's not picked nor banned in today's proplay.","replies":[{"poster":"Anhartamin","date":"2017-06-08T19:15:57.894+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Ralanr","date":"2017-06-08T19:17:16.018+0000","up_votes":1,"down_votes":0,"body":"Why does most of the playerbase hate him?\n\nSimple: he's frustrating to fight against to normal players.","replies":[]}]},{"poster":"Penns","date":"2017-06-08T15:29:36.933+0000","up_votes":1,"down_votes":1,"body":"Well he isnt really an lcs-champ but he is too strong top in soloq, especially when Fiora and probably Kled/Riven get nerfed.","replies":[]}]}]},{"poster":"Langhof","date":"2017-06-08T20:57:45.705+0000","up_votes":1,"down_votes":0,"body":"You don't get 100% crit from just pd, you hit 100% after you have pd and cloak. And to be honest it's just a good item on Yasuo for the effect. The reduced damage taken passive is great on Yasuo because he is easy to poke and abuse early and he needs some sort of mitigation in order to get up in your face and trade, with him being melee and all. Imho I think Yasuo is in a fine spot right now, and with about 700k xp on Yasuo I can comparatively say the reduced time I can hold my q sucks, because I have a lot less room/time for zoning and playmaking early on.","replies":[]},{"poster":"Lucian Waifu","date":"2017-06-08T19:57:11.686+0000","up_votes":1,"down_votes":1,"body":"I think they should make the damage reduction work half as well for melee champions just like how they worked out the rage passive on {{item:3044}}.","replies":[]}]}