{"poster":"MjRocMas","date":"2016-06-03T22:46:35.667+0000","title":"¿que pasa con el emparejamiento?","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"Por favor riot me gustar&iacute;a insultarlos o desquitarme de alguna manera, ya que acabo de jugar una ranked y me tocaron 2 unrankeds, estoy en oro 5, la verdad no me importa si son unrankeds, lo que me molesta es que fedearon y flamearon. Porque estando en oro 5 aun me emparejan con gente asi? No se si fue un error o algo pero por favor quiero alguna respuesta, luego se quejan de que la comunidad es toxica, como no serlo con gente asi. Intente jugar callado aquella partida pero los feders se dedicaron a flamear, tambi&eacute;n intente de ayudarlos pero siguieron flameando. Buena rito vas de mal en peor ;)","replies":[{"poster":"JustoxGames","date":"2016-06-03T22:50:33.238+0000","up_votes":1,"down_votes":1,"body":"**¡Lo solucionaran pronto!**\nTe recomiendo te pases por el ultimo video que subio Riot Games a su canal, Habla mucho de ese tema.\nhttp://imgur.com/6IGzWjq","replies":[{"poster":"ZeNch","date":"2016-06-03T22:58:08.206+0000","up_votes":1,"down_votes":0,"body":"creo que no viste el video xD ... o no leiste el post","replies":[{"poster":"JustoxGames","date":"2016-06-03T23:01:03.751+0000","up_votes":1,"down_votes":1,"body":"oc\nhttp://imgur.com/shFBTlQ","replies":[{"poster":"MjRocMas","date":"2016-06-04T02:11:51.400+0000","up_votes":1,"down_votes":0,"body":"El video creo que no habla mucho de eso, habla mas de la cola dinámica y el soloQ","replies":[]}]}]}]},{"poster":"Conejito Feliz","date":"2016-06-03T23:01:51.840+0000","up_votes":1,"down_votes":0,"body":"Hasta que no salgas de oro pueden aparecer unranked. En platino ya no salen si te pone feliz. Solo subi a platino y listo.","replies":[]},{"poster":"ZeNch","date":"2016-06-03T22:59:35.902+0000","up_votes":1,"down_votes":0,"body":"Pasa por que la gente sin rankear tiene elo de plata 2 aprox... entocnes ganando un par juegan con gente oro... sin importar que las wins anteriores sean x carreados. sube a oro 2 o 1 y recien ahi desaparecen creo... x q yo estando en plata 2 jugaba hasta con oros 3... hasta que la nacion del feeder que hay en mi ataco y bueno...)","replies":[]},{"poster":"J7ycjHAfiL","date":"2016-06-03T22:58:09.137+0000","up_votes":1,"down_votes":0,"body":"El elo unranked es silver 3, s comun","replies":[]}]}