{"poster":"Tiniest Turtle","date":"2018-10-25T22:51:39.936+0000","title":"Eve visuals","subforum":"Story, Art, & Sound","up_votes":35,"down_votes":3,"body":"Ok so for a while I&#039;ve been staring at these concept arts wondering why Eve doesn&#039;t look more like them. I think they look so much cooler and would love if she got a touch up to her (imo) kind of underwhelming base model. \n\nhttps://cdna.artstation.com/p/assets/images/images/007/728/108/large/gem-lim-evelynn-ingame.jpg?150812646\n\n\nhttps://cdna.artstation.com/p/assets/images/images/007/728/060/large/gem-lim-evelynn-concept-color.jpg?1508125727\n\nhttps://cdnb.artstation.com/p/assets/images/images/007/728/199/large/gem-lim-evelynn-turnaround.jpg?1508126970\n\nI would really love to see horns on base Eve, as well as fuller hair, more detailed lashers with smaller tips, and better looking shadow coverings! Personally, base Eve's skin was my least favourite part of the update. I found her lashers too big and kinda ugly, and her hair sorta looks like an onion instead of a flaming mane. That and I don't really like the way her \"clothes\" look. If she looked more like some of these concepts though...","replies":[{"poster":"Frickface","date":"2018-10-25T23:02:30.748+0000","up_votes":16,"down_votes":0,"body":"Oh _that's_ why you've been staring?\n{{sticker:sg-lulu}}","replies":[{"poster":"Tiniest Turtle","date":"2018-10-25T23:04:28.364+0000","up_votes":31,"down_votes":0,"body":"I'm hella gay tho {{sticker:sg-ezreal}}","replies":[{"poster":"Frickface","date":"2018-10-25T23:07:05.088+0000","up_votes":12,"down_votes":0,"body":"You have bested me...\n{{sticker:sg-ahri-1}}","replies":[{"poster":"Warlord Rhinark","date":"2018-10-26T06:32:23.065+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Frickface,realm=NA,application-id=6kFXY1kR,discussion-id=nn1iWU3f,comment-id=000000000000,timestamp=2018-10-25T23:07:05.088+0000)\n>\n> You have bested me...\n> {{sticker:sg-ahri-1}}\n\nNot if OP's a girl.\n\nhttps://i.imgur.com/WxLPXU9.jpg/img","replies":[]},{"poster":"Hexs Fortune","date":"2018-10-25T23:42:34.331+0000","up_votes":7,"down_votes":2,"body":"> [{quoted}](name=Frickface,realm=NA,application-id=6kFXY1kR,discussion-id=nn1iWU3f,comment-id=000000000000,timestamp=2018-10-25T23:07:05.088+0000)\n>\n> You have bested me...\n> {{sticker:sg-ahri-1}}\n\nI read that in Anduins voice..","replies":[{"poster":"AggressiveWolf","date":"2018-10-26T09:15:47.142+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Hexs Fortune,realm=NA,application-id=6kFXY1kR,discussion-id=nn1iWU3f,comment-id=0000000000000000,timestamp=2018-10-25T23:42:34.331+0000)\n>\n> I read that in Anduins voice..\n\nHOLY SHIT I THOUGHT I WAS THE ONLY ONE","replies":[]}]},{"poster":"Monstermushmush","date":"2018-10-26T04:48:31.247+0000","up_votes":2,"down_votes":0,"body":"Hey there I upvoted your comment on your unfortunate inability to remake when your Noc afk'ed.","replies":[{"poster":"Frickface","date":"2018-10-26T05:00:06.656+0000","up_votes":1,"down_votes":0,"body":"Lul, I finally got over my bad mood from that, thanks :p","replies":[]}]}]}]}]},{"poster":"Tormentula","date":"2018-10-26T00:53:06.892+0000","up_votes":5,"down_votes":0,"body":"From a zoomed out gameplay camera, textures like that is just eye candy and not really that important. It'll just look like clutter unless you zoom in. If they were there, you likely wouldn't notice them 90% of the time. ","replies":[]},{"poster":"Total Eclipse","date":"2018-10-26T03:30:02.589+0000","up_votes":4,"down_votes":0,"body":"i like the black and white concept art, but the current model is honestly pretty hawt.","replies":[]},{"poster":"DeracadaVenom","date":"2018-10-25T23:34:51.341+0000","up_votes":4,"down_votes":0,"body":"I like the hair in the concepts","replies":[]},{"poster":"AXayahAccount","date":"2018-10-26T00:33:11.723+0000","up_votes":3,"down_votes":0,"body":"I think the current one holds up to those concepts. The thing about those concept art pieces is they're very revealing and they most likely had to tune it down a little bit. With that in mind I still think the current one maintains all the value from the concepts.","replies":[{"poster":"Tiniest Turtle","date":"2018-10-26T00:38:39.700+0000","up_votes":1,"down_votes":0,"body":"Her shadow coverings on her base skin don't look as detailed or fleshed out as they do in the concepts. The lashers and the hair in the concepts also looks better imo. The lasher tips are smaller and I think it looks nicer.","replies":[{"poster":"AXayahAccount","date":"2018-10-26T00:56:02.882+0000","up_votes":2,"down_votes":0,"body":"To be fair, that is most likely the fact the in game models can not hold a candle to any of the splash arts. Obviously concept art is starter splash art. Compare the current eve splash to the concepts see if that makes you think the concepts look bad or better.\n\nMyself I think the concept art looks fine, however I also think the in-game model looks fine enough as is.","replies":[]}]}]},{"poster":"Akali Prime","date":"2018-10-26T02:23:39.042+0000","up_votes":2,"down_votes":0,"body":"i kinda wish her lashers were sentient and she talked to them lol kinda like how doctor octopus did in spiderman 2","replies":[{"poster":"DeracadaVenom","date":"2018-10-26T15:40:02.623+0000","up_votes":1,"down_votes":0,"body":"LOL","replies":[]}]},{"poster":"A Superb Villain","date":"2018-10-26T00:37:54.850+0000","up_votes":2,"down_votes":0,"body":"In my opinion, her base model is absolutely fantastic. I found it so impressive I hardly considered her skins worth buying (I got Bloodmoon though because it was in my personal store for 50% off and Bloodmoon skins are dope). The only thing I don't like about it is her tentacles; they look like inflatable plastic rather than wispy magic eviscerators. \n\nhttp://lienminh360.vn/wp-content/uploads/2017/10/eve.jpg","replies":[{"poster":"Quort","date":"2018-10-26T19:36:57.895+0000","up_votes":1,"down_votes":0,"body":"I like Tango Eve. I always enjoyed skins that make non-humans look human. It’s why i used SKT Zyra all the time before Dragon Sorceress came out (I really like the DS skin because of the purple colors).","replies":[]}]},{"poster":"Hexs Fortune","date":"2018-10-27T00:09:54.826+0000","up_votes":1,"down_votes":0,"body":"I'll be honest {{champion:28}}'s base skin has been growing on me. The moving shadows are a nice touch.","replies":[]},{"poster":"Melledoneus","date":"2018-10-26T23:44:39.232+0000","up_votes":1,"down_votes":0,"body":"Files, art style, rendering, and model issues.\n\nUnfortunately cell shaded and art textures don't translate well to 3D when players view the characters on such a zoomed out scale. That's why Zoe looks horrifying at ground level, so she looks normal to the player. (Although I still believe she dethroned Teemo on being a demonic monstrosity from Hell)","replies":[]},{"poster":"AmenPerson","date":"2018-10-26T19:43:29.678+0000","up_votes":1,"down_votes":0,"body":"Mm, I can see that they took inspiration from picture 2 and 3 and split it up into her visible and shrouded version, you know, with the horns and such. Picture 3 just _feels_ too revealing, and even though that is what the character is suppose to suggest, I feel like it'd be a bit too much.","replies":[]},{"poster":"Academy Kayn","date":"2018-10-26T01:41:08.708+0000","up_votes":1,"down_votes":0,"body":"Because too many details on a smaller model from a heads up perspective adds clutter and the like. Less can be more sometimes.","replies":[{"poster":"DeracadaVenom","date":"2018-10-26T15:40:39.721+0000","up_votes":1,"down_votes":0,"body":"Thats why champions dont usually move their faces right?","replies":[]}]},{"poster":"Hexs Fortune","date":"2018-10-26T04:59:38.962+0000","up_votes":1,"down_votes":0,"body":"They were trying to find a balance between monster girl and sexy humanoid. Original eve never had horns either.\n\n Her bloodmoon skin has horns in the non shadow form","replies":[{"poster":"DeracadaVenom","date":"2018-10-26T15:39:41.161+0000","up_votes":1,"down_votes":0,"body":"her shadow skin has horn crown thingys","replies":[]}]},{"poster":"Kraysis","date":"2018-10-26T13:35:08.108+0000","up_votes":1,"down_votes":0,"body":"This makes me want eve chromas","replies":[]},{"poster":"Tomoe Gozen","date":"2018-10-26T11:00:28.020+0000","up_votes":1,"down_votes":0,"body":"She doesn't look like this because this is mostly concept art and the images of her on the map look beautified more than functional.\n\nWhen Riot designs champions, they have to make sure that what displays on everyone's screens isn't too resource intensive, has the right amount of rendered polygons and that it's very clear at what you're looking at from the usual zoomed-out/zoomed-in perspective. Clarity is a big deal in League since there's 141 champions, followed by a literal metric ton of their assets that have to be displayed on the screens and have to be distinguished enough so that everyone knows from where it comes from and whos attacks/spells those belong to.\n\nRiot can surely render Eve's model in 4k resolution and equally beautify her but to what end?\nYou're never going to see her delicious belly button sheen caused by the soft moonlight reflecting on her taught, blue-tinted skin. Because it's not possible to zoom in that close and this isn't an MMO. Beautification can only get so so far before what you have before you is more distracting for gameplay purposes than helping.\n\n\nThere's an axiom in almost any other discipline that relates to programming/designing):\n**If you're sacrificing the ease of use and functionality of a product for the sake of making it more visually appealing, you're making a bad product.**\n\nFurthermore, look at Eve's model in-game:\nHer base splash is trying to convey that her clothes are actually living shadows and not something that formed \"shadowy\" fabric that has some rigidity to it. The pinkish glow that comes out of her hair, nails and lasher tips is her own demonic magic. Even the color of it makes you believe that it's inviting, seductive and warm to the touch but that's all a trap for you to come too close to the flame so that Eve can \"devour\" you.\n\nEverything about Eve is of her own design.\nCenturies of adapting to her environment in order to capture her prey in the most unsuspecting way possible. All those details of her splash are faithfully recreated in her base model. Her shadowy clothes are actually moving around her thighs, arms and breasts and convey the idea that she can change her appearance at will and her ornamental forehead flame is moving as well. Obviously, the shadows on her legs, arms, lashers and  \"lingerie\" is conforming to her own shapely form but that's also because she herself wants to project that image of perfection to her potential prey. And if makes it easy for Riot to make skins for her due to having a defined model.","replies":[]},{"poster":"PokladnicaZla","date":"2018-10-26T08:25:29.042+0000","up_votes":1,"down_votes":0,"body":"I love Eve's concept,but wish she looked more like in her teaser trailer.\n\nhttps://pbs.twimg.com/media/DKN80QPXUAAIv--.jpg","replies":[]}]}