{"poster":"MRPELADO3D","date":"2017-02-06T07:00:07.544+0000","title":"Malas Rachas Desesperado Por Mala Racha","subforum":"Guias y consejos","up_votes":8,"down_votes":0,"body":"Hola comunes, queria compartir algo que nos pasa a varios de los jugadores de league of legends, en especial los que se toman el juego SERIO. Llevo una mala racha de derrotas, todo esto por la causa de haberme estresado por perder una ranked, de ahi comenzo a pesarme ese estres y deje de jugar partidas por un dia, intente calmarme, me ponia a conversar conmigo mismo acerca de que fue lo que hice mal en la partida o que pude haber hecho mejor, y asi fui viendo cada detalle de como se iba agrandando el problema, tambien como ponerme a discutir con mi equipo o ver mi posicionamiento en las partidas, cada detalle influia algo, pero habia una cosa muy grave en mi, algo que llevaba una semana presionado por esa avalancha, era la DESESPERACI&Oacute;N. Si, estaba desesperado por mejorar lo mas rapido posible, queria superar cada rival inmediatamente ignorando el potencial de cada jugador, porque veia gente que estaba muy arriba mio y me desesperaba cada vez mas, de hecho, en las ma&ntilde;anas no comenze a tomar desayuno ni siquiera comer un pan, simplemente queria ascender como jugador y ya, pero no veia la situacion en la que estaba apretado, hasta que llego el dia en que decidi ir al parque y tirarme al cesped y soltar toda esa presion que tenia en la cabeza, y dije ESTAS TODO EL RATO HABLANDO SOBRE SER CHALLENGER SI NI SIQUIERA ESTAS VIENDO TE TIENES QUE ENFRENTAR AHORA, ESTAS SO&Ntilde;ANDO TANTO QUE SE TE OLVIDA ESFORZARTE, ESTAS MIRANDO TAN ARRIBA QUE TE TROPIEZAS POR NO MIRAR DE FRENTE. Espero que hayan entendido y sentido mi mensaje pues me lo he tomado muy enserio porque llegare a ser el mejor adc del mundo, saludos y seria de agrado que compartieran sus experiencias.","replies":[{"poster":"LCI Insight","date":"2017-02-07T17:38:06.464+0000","up_votes":1,"down_votes":0,"body":"Buena reflexión :)!","replies":[]},{"poster":"Vi Sexual","date":"2017-02-06T19:35:39.322+0000","up_votes":1,"down_votes":0,"body":"A que tenes al futuro mejor Vi del mundo, asi que claro que es entendible y sirve mucho! \n\nMe paso que tenia una mala racha y quede bloqueado en una division, me pude destiltear y ahora no paro de subir.\nSuerte!","replies":[]},{"poster":"Hi im Eleven","date":"2017-02-06T12:36:10.575+0000","up_votes":1,"down_votes":0,"body":"Al menos estuviste en oro y no estas estancado en bronce como muchos de nosotros, eso si es desesperante.","replies":[]}]}