{"poster":"Dönersaurier","date":"2017-09-25T15:44:08.349+0000","title":"Unser Team sucht dich! (Mid/Supp)","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo und danke, dass du dir die Zeit nimmst dir diesen Beitrag durchzulesen. \n\n**Zu unserem Team:**\nWir (Top,Jngl und Adc) sind eine frische Mannschaft, und suchen derzeit noch einen Supporter und einen Midlaner. Da wir noch nicht so lange was miteinander zutun haben besteht nat&uuml;rlich noch Trainingsbedarf, aber es funktioniert schon ganz gut. Wir sind sehr darauf hinaus sp&auml;ter bzw in naher Zunkunft Turniere etc mitzumachen, also der gewisse Reiz ist da :)\nTop: Alexej2727\nJngl: G0dFlstLeeSin\nAdc: D&ouml;nersaurier (Teamleiter)\n\nAlso ich schreibe nun erstmal ein Paar **Allgemeine Vorraussetztungen** auf, damit ihr hier &uuml;berhaupt wisst ob es auf euch zutrifft.\nIhr solltet mindestens 16 sein (keine Ausnahme) und eine mindestelo von Silber III haben. Au&szlig;erdem solltet ihr eine gewisse Zeit LoL gespielt haben. Wir wollen ja keine Anf&auml;nger... Ihr solltet einen Reiz haben hoch hinaus zu wollen und viel daf&uuml;r zu geben. Ihr solltet nicht Flamen/Tilten etc (Wir wollen keine Aufgebenden Teammates)! Au&szlig;erdem solltet ihr Humor haben aber auch die gewisse Ernsthaftigkeit in gewissen Siotuationen. Und zu guter letzt solltet ihr auch daran denken, dass ihr in einem Team reden m&uuml;sst. Also das solltet ihr drauf haben ;)\n\n**Was wir uns von unserem Midlaner w&uuml;nschen:**\nEr sollte wenn es m&ouml;glich einen Teamorientierten Champion Pool haben. Au&szlig;erdem sollte er wissen wann es Zeit ist zo Roamen etc.\n\n**Was wir uns von unserem Supporter w&uuml;nschen:**\nEr sollte wissen wo man warded etc, also gamenolage sollte auf jeden Fall vorhanden sein bzw wann kann ich auf der Lane Poken etc.\n\nFalls es noch Fragen gibt kann man diese nat&uuml;rlich noch privat beantworten :)\n\nBei Interesse meldet euch bei: **D&ouml;nersaurier\n**\n\nSch&ouml;nen Tag noch!\n{{sticker:slayer-jinx-wink}}******","replies":[{"poster":"DHo Kanaus","date":"2017-09-28T14:13:25.801+0000","up_votes":1,"down_votes":0,"body":"naja joa und dann nicht einmal richtig mit einem schreiben und dann einfach den kontakt abbrechen, klingt nicht wirklich nach joa, naja das nächste mal reicht es auch wenn ihr einem sagt ihr sucht nicht mehr ...","replies":[{"poster":"Dönersaurier","date":"2017-09-28T15:37:58.213+0000","up_votes":1,"down_votes":0,"body":"Tut mir leid aber dieses Kommentar ist ungerechtfertigt.","replies":[]}]},{"poster":"e4rthling","date":"2017-09-25T18:06:08.058+0000","up_votes":1,"down_votes":0,"body":"sucht ihr noch?","replies":[{"poster":"Dönersaurier","date":"2017-09-27T10:11:23.365+0000","up_votes":1,"down_votes":0,"body":"joa","replies":[]}]},{"poster":"DHo Kanaus","date":"2017-09-26T15:20:41.868+0000","up_votes":1,"down_votes":0,"body":"Hallo an euch 3 sucht ihr noch einen Spieler, bin Gold 4 könnt euch ja mal melden bei interesse würde mich freuen ;)","replies":[]},{"poster":"can i supp0rt","date":"2017-09-25T17:33:47.206+0000","up_votes":1,"down_votes":0,"body":"Habe dir eine Anfrage gesendet. \n\nBeste Grüße can i supp0rt","replies":[]},{"poster":"Sidooon","date":"2017-09-25T17:00:06.257+0000","up_votes":1,"down_votes":0,"body":"Hab dich mal geadded!","replies":[]},{"poster":"dee200","date":"2017-09-25T16:07:30.985+0000","up_votes":1,"down_votes":0,"body":"hey, ich habe dir eine Freundschaft anfrage geschickt schreibt mir mal bei lol da können wir mal schauen ob ihr Interesse habt","replies":[]},{"poster":"DHo Kanaus","date":"2017-09-28T16:49:25.282+0000","up_votes":1,"down_votes":1,"body":"Weil ? ^^\nEs war doch leider genau so","replies":[]}]}