{"poster":"OmegaDulli","date":"2018-08-18T08:09:31.010+0000","title":"Was spielen in der Tank Meta und wie?","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":1,"body":"Hi, habe l&auml;nger kein League mehr gespielt und jz gibts gleich ne Tankmeta zu beginn :/\r\nWas spiele ich am besten (Mid/Jgl) und wie spiele ich in der Tank meta? Sehr passiv oder agressiv und spiele ich eher aufs late oder auf siege um schnell finishen zu k&ouml;nnen?","replies":[{"poster":"0OLegendO0","date":"2018-08-31T23:26:51.142+0000","up_votes":1,"down_votes":0,"body":"spiel etwas wie jax, renekton, camille, panth (top) und lb, akali, ahri, talon (mid)\nidR sind lane bullies, die ihre lane zerstören, entscheidend\nwas in soloQ wichtig ist, die lane pushen und roamen :)\ntanks sind stark, aber von einer tank-meta kann man denke ich nicht wirklich sprechen, es gibt gute mittel ggn tanks, gerade als ADler (wenn man bissle fürs mid-late spielt)","replies":[]},{"poster":"CcClownfiesta","date":"2018-08-18T20:25:55.007+0000","up_votes":1,"down_votes":0,"body":"Zurzeit haben wir keine Tankmeta \n\nEs ist aber wahr dass Tanks stärker geworden sind und meiner meinung nach wieder spielbar sind \nje nach patch könnte es aber gut sein dass tanks wieder meta werden , der erste schritt war der letzte patch\n\n\nich kann nur von top sprechen \n\ndort sind Mundo, Sion, Nautilus, Malphite, Cho für mich S tier\ngefolgt von Gragas , Kled und Poppy , wobei die letzten beiden je nach build auch bruiser sein können\n\nman sollte aber dran denken das mit jedem meta switch auch counterpicks entstehen zb fiora die sowieso zurzeit stark ist","replies":[]},{"poster":"VinceTheVince","date":"2018-08-18T09:14:12.843+0000","up_votes":1,"down_votes":0,"body":"Ich frage mich wie du darauf kommst, dass wir in einer Tank-Meta sind. Es wurden jetzt zwar einige Tanks gebufft, ja, aber generell sieht man zur Zeit eher weniger Tanks - ich jedenfalls.\nSelbst in der lcs, lck und so weiter werden zB auf der Toplane kaum noch Tanks gespielt, sondern Bruiser und andere Splitpusher. Aber natürlich spielen die Profis auch nochmal ganz anders wie Leute in der Solo-Queue.\n\nIm Moment sind die Spiele sehr schnell vorbei, daran solltest du dich gewöhnen. Um dir die aktuellen Jungle Picks anzugewöhnen, würde ich dir den Streamer/youtuber iwilldominate empfehlen. Er hat grad auf YT ein gutes Format begonnen, bei dem er erklärt wie man zB mit Graves, udyr und pantheon spielen sollte.\nAuf der Midlane solltest du auf jeden Fall Zoe spielen lernen. Sie hat eine hohe Bannrate, aber wenn sie durch kommt, lohnt es sich auf jeden Fall sie zu picken - allerdings wurde sie jetzt generfed und deswegen sollte man sie wirklich gut beherrschen. Sonst kann ich dir jetzt gar keinen Champion nennen, der auf der Midlane nicht weg zu denken ist.  Leblanc und Talon sind im Moment auch stark, aber Riot will ja die hohen Damage-Spikes verringern, deswegen denke ich, dass da auch noch ein Nerf kommen wird. Schau ganz einfach auf Statistik Seiten, welche Champions gepickt werden und welche viel gewinnen ;)","replies":[{"poster":"Megamaexx","date":"2018-08-18T12:33:35.328+0000","up_votes":1,"down_votes":0,"body":"Spielen die Pros schon auf dem 8.16er Patch? Der ist ja die Einleitung zu einer eventuell zurückkehrenden Tank+ADC Meta.","replies":[]}]},{"poster":"Wolf Husky","date":"2018-08-18T12:07:49.344+0000","up_votes":1,"down_votes":0,"body":"Tankmeta kommt noch, gerade ist es in der einstiegsphase. Dennoch ist es besser, sich darauf vorzubereiten und die Champs zu lernen, die schließlich \"op\" werden. Also auf der Midlane spiele ich gerade sehr oft Corki, da die Assassine langsam verschwinden und er wie ein 2ter Adc ist(Lategame meta kommt öfters parallel zu Tankmeta, und adc sind gut gegen Tanks). Andere scalende Champs wie Veigar,(azir),ziggs, kasa etc. werden wahrscheinlich auch stark sein, sowie champs die gut gegen Tanks sind.\nIm jng würde ich dann mitziehen und auch Tanks picken, wobei es dort auch gute Champs gibt, mit den man Tanks zerstört(twitch,(yi), KIndred, jax)\n\nIn Worlds beliebte Champions wie Lee,Corki,Rumble etc. werden sicherlich auch stark sein.","replies":[]},{"poster":"OPChampsSucks","date":"2018-08-18T10:00:11.942+0000","up_votes":1,"down_votes":2,"body":"Tankmeta ? lul. 90% der nontanks oneshotten tanks atm.","replies":[]}]}