{"poster":"onlineVirus","date":"2017-12-15T15:58:07.233+0000","title":"Rückmeldung /dev: Clash: totaler Mist","subforum":"Champions & Gameplay","embed":{"description":"Wenn du auf EUW, EUNE oder TR spielst, kannst du uns jetzt helfen, „Clash\" zu testen! Schau auf euw.leagueoflegends.com oder auf eunue.leagueoflegends.com vorbei, um Details zur Registrierung zu erfahren. Wir haben gerade erst „Clash\" angekündigt, einen neuen teambasierten, kompetitiven Modus, der 2018 für League erscheint.","url":"https://nexus.leagueoflegends.com/de-de/2017/12/dev-clash/","image":"https://nexus.leagueoflegends.com/wp-content/uploads/2017/12/LOL_CMS_159_Social_1200_wr6pfh8ns772ljcczwez.jpg"},"up_votes":1,"down_votes":0,"body":"Botschaft an Riot Games.\r\nGuten Tag. Ich habe euern /dev: Clash nun mehrfach aufmerksam gelesen und dachte erst, dass das ziemlich cool werden kann. Doch als ich dann auf euer Ticket System gesto&szlig;en bin musste ich erschreckend feststellen, dass ich falsch lag. Ich kann schon bevor ich &uuml;berhaupt gespielt hab sagen, dass mir das nicht gefallen wird. Ich zitiere euch hier mal damit wir alle wissen um welche Zeilen es sich handelt:\r\n\r\n&quot;Wir implementieren au&szlig;erdem &uuml;ber ein Ticketsystem einen &bdquo;Einsatz&ldquo; f&uuml;r das Turnier. [...] Jedes Teammitglied muss mindestens ein Ticket verwenden, um an einem &bdquo;Clash&ldquo;-Turnier teilzunehmen.&quot;\r\n\r\nSch&ouml;n und gut. Aber wurde da nachgedacht? Ich fasse das  ganze mal so zusammen wie ich es verstanden habe: Die Wettk&auml;mpfe sollen mein altes geliebtes Teamranked ersetzten und meine neue Alternative f&uuml;r  5er Gruppen sein. F&uuml;r diese Wettk&auml;mpfe muss ich jedoch Tickets kaufen die ich mit Risiko sogar verliere. Oder ich bekomm sie in Missionen. Wie h&auml;ufig? Wenn ich also keine BE ausgeben will, weil mir noch Champs fehlen und nicht bereit bin RP zu kaufen muss ich also auf diese Missionen pokern und darauf, dass ich auch noch gewinne im Tunier. \r\nBedeutet letztendlich: der ganze Mist an diese Tickets zu kommen ist mir jetzt schon zu aufwendig und &auml;tzend dass der Spa&szlig; der mich dann erwartet nicht so hoch ist, dass es sich lohnt. \r\nIch spiele meist nur ein mal in der Woche mehrere games am St&uuml;ck. Und das spiele ich mit meinen Freunden. Meine Freunde sind u.a. Flexi so hoch eingeranked worden, dass ich nicht mit denen spielen kann. Wie soll ich denn dann zb die aktuelle Mission machen ohne mein Nachmittag zu opfern weil ich allein spielen muss um dann mit ihnen das Tunier spielen zu k&ouml;nnen?\r\nUnd das hier: &quot;Wenn man bedenkt, wie viel Spa&szlig; League mit einer Gruppe Freunde machen kann, muss man die Ranglistenteams als Fehlschlag bezeichnen.&quot; ist schlichtweg falsch. Ich habe nie einen Arktikel von euch gesehen in dem Umfragen o.&Auml;. gemacht wurden bevor das ganze Abgeschafft wurde deswegen ist das ganze f&uuml;r mich eine lere behauptung. Ich z.B. muss mit meien Freunden immer normal games machen weil wir von Flex ranks nicht zusammen spielen k&ouml;nnen und alleine keinen Ergeiz haben auf zu ranken. Das macht auf dauer keinen Spa&szlig; weil man keinen Fortschritt sieht. Im teamranked sah man einen.\r\nUnd noch was. Das hier: &quot;Da es um Tickets geht, kannst du dir der Motivation deiner Teamkollegen sicher sein, das Turnier zu Ende zu spielen.&quot; ist ja absoluter Quatsch. Wenn ich damals Teamranked gespielt hab konnte ich mir auch immer sicher sein dass wir zu ende spielen weil ich mit meinen Freudnen gespielt habe. Warum sollte pl&ouml;tzlich jemand keine Lust mehr haben und offline gehen. Wenn ich als 5er Gruppe mit 4 Freudnen spiele besteht schlichtweg keine Gefahr, dass jemand nicht zu ende spielt.\r\n\r\nIch m&ouml;chte hiermit abschlie&szlig;end mal sagen, dass ich enorm entt&auml;uscht bin, dass ihr mit einem der gr&ouml;&szlig;ten Computerspiele &uuml;berhaupt trotzdem nochmal etwas einbauen musstet um noch mehr Geld zu verdienen. Als w&auml;re das Hextechsystem nicht schon genug gewesen. \r\nonlineVirus","replies":[]}