{"poster":"PaffWasTaken","date":"2018-04-30T12:14:07.394+0000","title":"Sorcery deserves to be the next tree to get an extra keystone","subforum":"Gameplay","up_votes":86,"down_votes":5,"body":"As a mage, choosing between present keystones just feels so wrong. Either you have the kit to be able take something outside of sorcery, either you are stuck with Aery and Comet (Phase rush just feels decent for people that aren&#039;t mages and {{champion:69}} {{champion:136}} ). When you take a look at them, Comet and Aery literally does the SAME thing; one just has less chance to hit but have better damage, while the other has less damage and always hit, along with having a small bonus with shields. Some mages like {{champion:101}} feels right at home with only those two, but with things like {{champion:38}} ,{{champion:90}}  or {{champion:112}} , it feels like you could have sooooo much better, but you are stuck with those poor choices.\r\n\r\nPlease, the mana changes will already hit pretty hard most mages, at least give them the diversity of usable keystones that most champ classes had from the start.","replies":[{"poster":"DW Diana","date":"2018-04-30T12:19:53.626+0000","up_votes":42,"down_votes":9,"body":"Deathfire touch please! You can nerf Brand back down to a sensible passive and give the rest of us our keystone back in one go!!!!","replies":[{"poster":"Snowman Arc","date":"2018-04-30T13:35:07.733+0000","up_votes":11,"down_votes":0,"body":"DFT is essentially Aery for most mages that are not Brand or Malz.","replies":[]},{"poster":"ZephyrDrake","date":"2018-04-30T14:10:54.745+0000","up_votes":5,"down_votes":13,"body":"> [{quoted}](name=Lord Loki1987,realm=NA,application-id=3ErqAdtq,discussion-id=BZs1cOJ7,comment-id=0000,timestamp=2018-04-30T12:19:53.626+0000)\n>\n> Deathfire touch please! You can nerf Brand back down to a sensible passive and give the rest of us our keystone back in one go!!!!\n\nDFT is pretty much scorch","replies":[{"poster":"DW Diana","date":"2018-04-30T15:04:05.703+0000","up_votes":12,"down_votes":1,"body":"> [{quoted}](name=ZephyrDrake,realm=NA,application-id=3ErqAdtq,discussion-id=BZs1cOJ7,comment-id=00000001,timestamp=2018-04-30T14:10:54.745+0000)\n>\n> DFT is pretty much scorch\n\nYeah just like scorch, except it scaled, didnt have a 20 second CD, and therefore was useful beyond level 6. Give me those things on scorch and I'll be happy lol","replies":[{"poster":"ZephyrDrake","date":"2018-04-30T16:04:23.581+0000","up_votes":5,"down_votes":8,"body":"> [{quoted}](name=Lord Loki1987,realm=NA,application-id=3ErqAdtq,discussion-id=BZs1cOJ7,comment-id=000000010000,timestamp=2018-04-30T15:04:05.703+0000)\n>\n> Yeah just like scorch, except it scaled, didnt have a 20 second CD, and therefore was useful beyond level 6. Give me those things on scorch and I&#x27;ll be happy lol\n\nAnd then it'll just be another Aery/Comet making the entire point of introducing a new keystone pointless","replies":[{"poster":"DW Diana","date":"2018-04-30T16:55:16.463+0000","up_votes":7,"down_votes":3,"body":"> [{quoted}](name=ZephyrDrake,realm=NA,application-id=3ErqAdtq,discussion-id=BZs1cOJ7,comment-id=0000000100000000,timestamp=2018-04-30T16:04:23.581+0000)\n>\n> And then it&#x27;ll just be another Aery/Comet making the entire point of introducing a new keystone pointless\n\nOk so you missed the sarcasm then...scorch is currently pointless post 6 and will likely be removed before long unless it's failing are remedied, meanwhile there is currently nothing LIKE DFT in the new runes (a dot that scales off both ad and ap).\nNeither summon arey nor comet give a sustained burn. Arey is a small poke, comet is a bigger poke, neither of which are a dot style and therefore it is completely different to both of them. If you want sudden burst then there's electrocute, which is still viable in the same way stormraiders was on mages (except for Taliyah). You want it up more often then there's comet. More often still and with increased shielding? arey. But for a more sustained damage there is nothing like DFT left in the game, which is a shame as it was good on so many champions and would do well in runes reforged.","replies":[{"poster":"ZephyrDrake","date":"2018-04-30T17:21:17.537+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Lord Loki1987,realm=NA,application-id=3ErqAdtq,discussion-id=BZs1cOJ7,comment-id=00000001000000000000,timestamp=2018-04-30T16:55:16.463+0000)\n>\n> Ok so you missed the sarcasm then...scorch is currently pointless post 6 and will likely be removed before long unless it&#x27;s failing are remedied, meanwhile there is currently nothing LIKE DFT in the new runes (a dot that scales off both ad and ap).\n> Neither summon arey nor comet give a sustained burn. Arey is a small poke, comet is a bigger poke, neither of which are a dot style and therefore it is completely different to both of them. If you want sudden burst then there&#x27;s electrocute, which is still viable in the same way stormraiders was on mages (except for Taliyah). You want it up more often then there&#x27;s comet. More often still and with increased shielding? arey. But for a more sustained damage there is nothing like DFT left in the game, which is a shame as it was good on so many champions and would do well in runes reforged.\n\nKeystone that only does more damage with no actual difference between the others. DFT was removed for being a boring mastery that had nothing going for it other than \"guess I'll take this since nothing else works for this champion\"","replies":[{"poster":"YumaS2Astral","date":"2018-04-30T22:07:20.367+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=ZephyrDrake,realm=NA,application-id=3ErqAdtq,discussion-id=BZs1cOJ7,comment-id=000000010000000000000000,timestamp=2018-04-30T17:21:17.537+0000)\n>\n> Keystone that only does more damage with no actual difference between the others. DFT was removed for being a boring mastery that had nothing going for it other than &quot;guess I&#x27;ll take this since nothing else works for this champion&quot;\n\nExcept that in the \"nothing else works for this champion\" situation, Thunderlord's Decree was the default choice.\n\nDFT was only really used by some champions that had synergy with this mastery; DoTs, spammable abilities, poke mages, and a few AD casters that wouldn't make better use of TLD or Fervor.","replies":[]}]},{"poster":"GenoXx","date":"2018-04-30T18:00:02.652+0000","up_votes":3,"down_votes":1,"body":"I thought people complained about it being too much damage in the game, do we really need more damage?","replies":[{"poster":"NoDragonsPlz","date":"2018-04-30T19:25:21.049+0000","up_votes":6,"down_votes":1,"body":"In Riot's mind, yes.","replies":[{"poster":"TeCoolMage","date":"2018-05-01T04:05:51.638+0000","up_votes":3,"down_votes":0,"body":"and in sorcery user's minds","replies":[]}]}]}]}]}]}]},{"poster":"CyberBalt","date":"2018-04-30T16:28:33.730+0000","up_votes":7,"down_votes":2,"body":"Meh. If they were to reintroduce deathfire touch, it'd have to replace aery or comet, because all three are already so similar. They're all basically just \"here's a bit of extra chip damage\" and that's it. It doesn't get more boring than that, there needs to be actual variety, not just an illusion of it.","replies":[]},{"poster":"ApexInTheCircle","date":"2018-05-01T01:48:23.955+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Lord Loki1987,realm=NA,application-id=3ErqAdtq,discussion-id=BZs1cOJ7,comment-id=0000,timestamp=2018-04-30T12:19:53.626+0000)\n>\n> Deathfire touch please! You can nerf Brand back down to a sensible passive and give the rest of us our keystone back in one go!!!!\n\nMake it burn for % current hp and give you back the same amount that it's burned as mana. Boom you got yourself a unique keystone that isn't completely broken and is good for harass, tanks and mana regen.","replies":[]},{"poster":"AirKingNeo","date":"2018-04-30T22:23:59.498+0000","up_votes":1,"down_votes":0,"body":"balancing all dots around a keystone is bad","replies":[{"poster":"RainXBlade","date":"2018-05-01T00:16:37.914+0000","up_votes":3,"down_votes":0,"body":"Yeah, and so was Fervor of Battle and its ability to dictate whether bruisers would be viable or not, depending on how strong it is.","replies":[]}]},{"poster":"NineTailedMystic","date":"2018-04-30T22:00:53.710+0000","up_votes":2,"down_votes":0,"body":"Except they stated why they removed it.","replies":[]}]},{"poster":"Critmaster Garen","date":"2018-04-30T14:20:46.670+0000","up_votes":11,"down_votes":3,"body":"also physical casters with sustained spell damage patterns could use a keystone in sorcery too.\n\n{{champion:86}} {{champion:420}} {{champion:122}} {{champion:92}} {{champion:58}} etc. could use a keystone like that. what if we just made something like {{champion:63}} passive, that stacks up on the enemy over a couple of seconds of taking spell damage and at full stacks gets exploded with the next auto attack?\n\nsomething like\n\n\n> #DEATHFIRE TOUCH\n> dealing spell damage applies deathfire touch to enemy champions. debuffed enemies take 3 - 20 (scaling with level) adaptive damage over two seconds.\n\n> after 6 seconds of a target being debuffed, the next auto attack against the target deals x (scales with ad and ap) amount of adaptive damage. melee champions stack the debuff twice as fast.\n\nthe dot on its own deals very little damage/second, but if you trigger it, its basically an aery proc worth of damage, after which the stacks reset to 1 and have to be built up again to get the next proc. similar to how grasp stacks up until its ready every 4 seconds.\n\nranged champions take 6 seconds to stack the proc on an opponent. melee champions only take 3 seconds.\n\nit would support sustained spell damage patterns of ad and ap casters, while it has some interactivity to it with the requirement of triggering the keystone when its stacked up, to get worthwile damage out of it.\n\nits important, that we dont just make it a keystone that deals a shitload of damage for {{champion:90}} pressing e or {{champion:25}} pressing w from range and then walking backwards, but at the same time it should still support these kind of champions in extended fights. so if they stay and auto attack to trigger the proc, they get the extra damage.","replies":[{"poster":"Sp33d Zer0","date":"2018-04-30T20:30:21.578+0000","up_votes":3,"down_votes":0,"body":"But darius is at home with conqueror and phase and renekton (I believe) one proc pta with just empowered w","replies":[{"poster":"Critmaster Garen","date":"2018-05-01T06:33:27.727+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Sp33d Zer0,realm=NA,application-id=3ErqAdtq,discussion-id=BZs1cOJ7,comment-id=00040001,timestamp=2018-04-30T20:30:21.578+0000)\n>\n> But darius is at home with conqueror and phase and renekton (I believe) one proc pta with just empowered w\n\nright, but the idea with the new rune system was to give people choices, and not just one cookie cutter build.\n\nwhile he does have conqueror, there isnt really a reason to not design such a keystone to accommodate physical spell casters and APC.","replies":[]}]},{"poster":"Automated Riven","date":"2018-04-30T17:00:43.553+0000","up_votes":3,"down_votes":0,"body":"To be fair. Aery on riven isn't complete garbage.","replies":[]}]},{"poster":"TeCoolMage","date":"2018-04-30T14:17:08.473+0000","up_votes":6,"down_votes":0,"body":"tbh as a Xerath player I'm sad that Aery takes longer to come back with longer range, and comet is better when you constantly hit single target spells, or are a burst mage who uses CC first (like Lux)\n\nBut why don't viktor, kass and malzahar work with Aery?? imo they'd work with it better than Xerath","replies":[{"poster":"warpenguin555","date":"2018-04-30T17:10:44.556+0000","up_votes":6,"down_votes":0,"body":"For Malz I hate aery because you only get half of the keystone, and the half you get isn't some thing you really want. The poke given by aery and comet are useless when the only thing your champion is good for is shoving the lane and roaming with ult. By the time you get enough items to hurt the damage those 2 runes do is non existent. It's better to just have a shorter flash cd","replies":[{"poster":"Sire Hippington","date":"2018-05-01T16:01:37.303+0000","up_votes":2,"down_votes":0,"body":"Then look at other rune paths. Predator makes for very scarry roams on malz for example, while spellbook grants more flash ults and more options as the game progresses.","replies":[{"poster":"ChaddyFantome","date":"2018-05-02T01:44:44.214+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sire Hippington,realm=EUW,application-id=3ErqAdtq,discussion-id=BZs1cOJ7,comment-id=000300010000,timestamp=2018-05-01T16:01:37.303+0000)\n>\n> Then look at other rune paths. Predator makes for very scarry roams on malz for example, while spellbook grants more flash ults and more options as the game progresses.\n\nPredator Malzahar ulti sounds scary as fuck tbh.","replies":[{"poster":"DW Diana","date":"2018-05-02T11:44:33.619+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ChaddyFantome,realm=NA,application-id=3ErqAdtq,discussion-id=BZs1cOJ7,comment-id=0003000100000000,timestamp=2018-05-02T01:44:44.214+0000)\n>\n> Predator Malzahar ulti sounds scary as fuck tbh.\n\nI'm enjoying Electrocute Malz atm tbh. It's almost like I do damage again :)","replies":[]}]}]}]},{"poster":"Votable Jester","date":"2018-04-30T16:47:46.479+0000","up_votes":3,"down_votes":0,"body":"I take Comet on Xerath actually...\n\nW is a near guaranteed hit, E is a guaranteed hit, and even with your Q and ult it gives them an extra thing to dodge.","replies":[]},{"poster":"SB Arneeman","date":"2018-05-02T18:23:41.917+0000","up_votes":1,"down_votes":0,"body":"Aery is the best option on Viktor atm, but it doesn't really feel good. You completely lose the shield part and it only adds a tiny bit of damage in a fight. Electrocute is the strongest keystone for him, but the lesser runes are too weak.","replies":[]}]},{"poster":"Laceration","date":"2018-05-01T01:34:37.041+0000","up_votes":5,"down_votes":0,"body":"Domination has the worst runes in the game, beside the keystone electrocute.","replies":[]},{"poster":"warpenguin555","date":"2018-04-30T16:49:19.108+0000","up_votes":4,"down_votes":2,"body":"100% agree. The current options are boring and barely noticeable after lane phase. Where are the options for burst mages? DOT Mages? AP assassins? I'd rather go spellbook and have a keystone I actually like. I'd also love it if Absolute Focus and Waterwalking were replaced so I'd feel like I had 3 options in all the lines.","replies":[{"poster":"VICHEL CHAOS","date":"2018-05-01T00:33:40.188+0000","up_votes":4,"down_votes":0,"body":"Burst mages and ap assassins do pretty well with electrocute.","replies":[]}]},{"poster":"Risen29","date":"2018-04-30T21:14:39.275+0000","up_votes":3,"down_votes":0,"body":"So often when I play a mage and take sorcery primary it feels like I am wasting my keystone slot on something that has no real synergy with my kit.","replies":[]},{"poster":"FilDaFunk","date":"2018-04-30T18:40:32.306+0000","up_votes":1,"down_votes":2,"body":"I would think something with healing on the next spell would be nice (like fleet footwork).","replies":[{"poster":"DW Diana","date":"2018-04-30T18:50:42.975+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=FilDaFunk,realm=EUW,application-id=3ErqAdtq,discussion-id=BZs1cOJ7,comment-id=000b,timestamp=2018-04-30T18:40:32.306+0000)\n>\n> I would think something with healing on the next spell would be nice (like fleet footwork).\n\nI'd be concerned anything with healing would just be abused by adcs, unless it was only on abilities in which case it would be Ravenous Hunter#2. I'm really not sure what they could bring out beyond the aforementioned DFT, but I will admit I'm looking forward to finding out.","replies":[]}]},{"poster":"Skeletons Grave","date":"2018-04-30T19:17:02.376+0000","up_votes":2,"down_votes":3,"body":"Really? mages probobly have the most options right now.\nAp assassins like LB and Kass have electrocute and spell book.\nDoT mages  do well with phase rush, spell book, and aery ( can proc twice off 1 spell).\nVictor likes his fleet footwork. But others could do fine as well. \nI have even seen a fair amount of predator on roaming mages.\nAnd even seen after shock on some mages verse assassins.","replies":[{"poster":"Ryusaether","date":"2018-05-01T08:06:34.898+0000","up_votes":2,"down_votes":0,"body":"Viktor doesn't actually like Fleet Footwork, he's just forced to take it because he doesn't have anything better going for him","replies":[{"poster":"SB Arneeman","date":"2018-05-02T18:25:28.449+0000","up_votes":2,"down_votes":0,"body":"Fleet isn't good on Viktor anymore either after the nerf to healing for ranged champs.","replies":[{"poster":"DW Diana","date":"2018-05-02T18:27:23.869+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SB Arneeman,realm=EUW,application-id=3ErqAdtq,discussion-id=BZs1cOJ7,comment-id=000d00010000,timestamp=2018-05-02T18:25:28.449+0000)\n>\n> Fleet isn&#x27;t good on Viktor anymore either after the nerf to healing for ranged champs.\n\nYou know what he used to take? DEATHFIRE TOUCH! (yes I am going to keep on about this, but I do it out of love :P)","replies":[{"poster":"Ryusaether","date":"2018-05-02T19:19:16.521+0000","up_votes":1,"down_votes":0,"body":"He was using that in the latest periods, but usually got into Electrocute. \n\nI did like stormraider more than actual Phase Rush, dunno if overall or just the bonus it gave (the proc part wasn't that intuitive unless your champ did insane bursts like Veigar or Darius, and I really liked to take it on them and Aurelion Sol).\n\nI hope dot mages (or maybe better just battle mages overall) get some nice Keystone that isn't just uninteractive dmg as DFT was, but I can't think of anything rn. Though Aery is really lackluster dmg wise for late game ap carries like good old Vik, comet isn't reliable and PR just isn't good on him. Electrocute isn't worth taking because it forces you into a suboptimal path, maybe Glacial Augment could be fun to try but meh, it just feel like \"I dunno what to take because nothing synergizes with my kit, guess I'll use this and try not to suck\", like FF for him or Unsealed Spellbook for other champs","replies":[]},{"poster":"SB Arneeman","date":"2018-05-02T18:31:30.502+0000","up_votes":1,"down_votes":0,"body":"Both thunderlords and deathfire were used. Now there isn't really a good option.","replies":[{"poster":"DW Diana","date":"2018-05-02T18:41:55.320+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SB Arneeman,realm=EUW,application-id=3ErqAdtq,discussion-id=BZs1cOJ7,comment-id=000d0001000000000000,timestamp=2018-05-02T18:31:30.502+0000)\n>\n> Both thunderlords and deathfire were used. Now there isn&#x27;t really a good option.\n\nUnless they bring out a new Deathfire =P","replies":[]}]}]}]}]}]},{"poster":"Toxic Diana","date":"2018-05-01T21:54:28.198+0000","up_votes":2,"down_votes":0,"body":"Phase Rush needs a rework too","replies":[{"poster":"ChaddyFantome","date":"2018-05-02T01:36:53.461+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Toxic Diana,realm=OCE,application-id=3ErqAdtq,discussion-id=BZs1cOJ7,comment-id=001a,timestamp=2018-05-01T21:54:28.198+0000)\n>\n> Phase Rush needs a rework too\n\nMore Like Revert. Gimme back Stormraiders :(","replies":[]}]},{"poster":"SociopathFriend","date":"2018-04-30T19:06:32.769+0000","up_votes":2,"down_votes":0,"body":"Hmm, so we want something that helps the champions with repeated ticks but won't excessively be applied to other classes like ADC and Tanks? And we want a keystone that isn't replicated by an item so something like Liandry's buff is out (as that would've been my idea).\n\nHow's about this: \nFor every ability-based instance of damage you land on a target, they're inflicted with a stack of X for a short time, up to a maximum of 3 stacks. \nWhen a DoT effect is inflicted by an ability (not ignite or items), these 3 stacks are triggered and amplify the DoT damage in some way (percent increase of damage, partial true damage, lower MR/Armor per tick) that hopefully scales as that's what is currently lacking?\n\nI think the main issue with DoT champions is they're quite varied if you think about it.\n{{champion:63}} {{champion:69}} {{champion:90}} {{champion:122}} {{champion:82}} {{champion:17}} {{champion:68}} \nThese are typically the big examples of DoTs and each of them have fairly different purposes in the game- which I imagine is one reason a *good* DoT-based keystone might be hard to come by.\n\nAlready I see a slight issue in that not all of them can trigger my idea, Teemo only technically has one damage-based ability for example, E is only auto-attacks. Perhaps so long as you keep inflicting damage on the enemy champion, stacks won't fade? ","replies":[]},{"poster":"Son Foku","date":"2018-04-30T16:28:06.956+0000","up_votes":2,"down_votes":0,"body":"I don’t know, at least you’ve got 2 choices in Sorcery. Domination you’ve got electrocute which is great on some champs, ten Predator which is only\nGood on a handful of champs, and dark harvest which is decent at best on like 2 or 3.","replies":[]},{"poster":"BLIGHTBRINGER","date":"2018-04-30T16:19:45.190+0000","up_votes":2,"down_votes":0,"body":"I agree, and the worst thing is that Riot had said that their next rune is probably going to be in the domination path since they want \"more people to pick the domination path\". Like Assassin's aren't being buffed enough already lol.\n\nBut if it's going to be a rune that would not be targetted towards Assassins specifically and more towards other champion classes then i'm down for it.","replies":[]},{"poster":"HungryAngry2SPP","date":"2018-04-30T15:08:53.954+0000","up_votes":3,"down_votes":1,"body":"Why should someone go Sorcery on {{champion:38}} , Thunderlord is much better","replies":[]},{"poster":"ShroomsAndSpells","date":"2018-04-30T14:08:43.743+0000","up_votes":2,"down_votes":1,"body":"I would kill for some kind of Health sustain","replies":[{"poster":"AlienPrimate","date":"2018-04-30T16:14:15.658+0000","up_votes":2,"down_votes":1,"body":"Resolve or domination secondary is your sustain.","replies":[]}]},{"poster":"Sohleks","date":"2018-05-02T19:22:52.592+0000","up_votes":1,"down_votes":0,"body":"I kinda agree just the challenge is the keystone has add somehow without being the clear choice. Because one duh choice isn't better than say three or more meh imo.\n\nThe sub runes in sorcery have been good enough to make up for it (or used to be?)\n\nIt'd probably be easier to make stormsurge more appealing or make aery less.. generally lame in effect","replies":[]},{"poster":"JoeMG","date":"2018-05-01T22:03:29.175+0000","up_votes":1,"down_votes":0,"body":"I had an idea a while back where Aery was changed so that instead of just being a glorified scorch, the target that Aery is attached to doesn't get damaged but rather takes a little extra damage from subsequent abilities for the duration, like 2 seconds or whatever. So then on an ally, it's slight damage reduction for 2 seconds. \n\nI think that could fill a nice niche for mages that aren't quite dps based but aren't ap assassins that need the burst from electrocute.","replies":[]}]}