{"poster":"VGO chN","date":"2017-04-24T07:42:38.909+0000","title":"Silber 3 toplaner sucht Couch !","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hallo ihr netten mit Menschen.\n\nIch suche unbedingt einen Coach der mich ein wenig Teachen m&ouml;chte bin derzeit s3 will mindestens Gold diese season erreichen.\n\nHabe einen ziemlich gro&szlig;en Pool f&uuml;r alle lanes. \n\nEinfach mal hier drunter schreiben w&uuml;rde mich &uuml;ber Hilfe freuen.","replies":[{"poster":"Captain Hedgi","date":"2017-04-30T05:23:37.490+0000","up_votes":1,"down_votes":0,"body":"Bin zwar keine Couch und auch kein Coach, aber dein \"großer Pool\" für alle Lanes, ist wohl dein Hauptproblem :D Versuch dich auf jeder Lane für 1-3 Champs zu entscheiden und spiel sie viel, dann schaffst du es locker noch nach Gold-Plat :D Nur dran bleiben und das wichtigste, niemals aufgeben und bei deinen Champs bleiben.","replies":[]},{"poster":"Abasin","date":"2017-04-24T12:44:23.320+0000","up_votes":1,"down_votes":0,"body":"> Silber 3 toplaner sucht **Couch** !\n\nGeh mal zu IKEA.{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Shiro equals","date":"2017-04-24T07:50:19.245+0000","up_votes":1,"down_votes":0,"body":"Also wenn du ne Couch suchst, dann solltest du in Möbelgeschäften suchen und nicht hier im Forum ;)\nWas du suchst ist ein \"Coach\".","replies":[{"poster":"VGO chN","date":"2017-04-24T09:00:14.030+0000","up_votes":1,"down_votes":0,"body":"Ich entschuldige mich in allen Formen für die autokorrektur meines Handys. Bin halt derzeit auf arbeit. :)","replies":[]}]},{"poster":"Tigerkeeper","date":"2017-04-30T08:53:33.578+0000","up_votes":1,"down_votes":1,"body":"Hey, adde mal Tigerkeeper ingame und lass dich von meinem Ranking nicht irritieren^^\nIch bin kein Profi-Coach aber für Gold bis Platin wirds locker reichen, wäre nur gut wenn du Skype hast.\nLg","replies":[]},{"poster":"PTG Nevsor","date":"2017-04-24T11:09:29.016+0000","up_votes":1,"down_votes":1,"body":"Hi, bin momentan selber nur gold und maine hauptsächlich jungle und support, habe aber schon einiges an erfahrung sammel können momentan coach ich seit ca 3 monaten ein dia team, wodurch ich ein relativ gute verständniss und wissen über die theorie und die meta jeder lane habe und mich in den grundzügen auch mit den verschiedenen matchups auskenne.\nSolltes du interesse haben adde mich einfach ingame.\nMfG\nFF TiltBoy","replies":[]}]}