{"poster":"Guru4All","date":"2018-12-01T20:13:44.673+0000","title":"A critical error has occurred and the process must be terminated ??!!","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo, seit meinem letzten Post habe ich nun endlich die Fehlermeldung herrausgefunden, welche für die ständigen crashes verantwortlich ist.\r\n\r\nA critical error has occurred and the process must be terminated.\r\n\r\nWould you like to create a crash dumb to aid the developers in troubleshooting this issue ? This may take up to 5 minutes.\r\n\r\nNOTE: The process may appear unrespnsive during this time.\r\n\r\n\r\nHatte das jemand schonmal und hat eine Lösung parat ? \r\n\r\nWas ich schon probiert habe: spiele auf 2560x1440 höchste Auflösung woran es nicht liegen kann da es erst seit kurzem auftritt\r\n\r\nHextechRepairTool mehrmals durchlaufen lassen - Neuinstallation League of Legends\r\nTreiber aktualisiert\r\nRandlos - Fenstermodus bzw. Vollbildmodus alles ausprobiert\r\nDann Verbindungskabel von Graka zum Monitor ausgetauscht HDMi oder Display Port jeweils probiert auch nicht (ähnliche Lösungsvorschläge gelesen)\r\nDann am Netzteil neue Stromverbindungskabel zur Grafikkarte ausprobiert (evtl. neues Netzteil ??? )\r\nDie Grafikkarte selber habe ich mehrmals im Stresstest durchlaufen lassen Nvdia 1070 wird nicht wärmer als 72° und es kommen keine Abstürze ( da ich sonst keine Beeinträchtigungen habe was die Grafik oder Darstellung betrifft sollte die Graka einwandfrei funktionieren)\r\n\r\n    kaum Staub im Rechner\r\n    wie geschrieben der PC nimmt nur an den einem Monitor keine Befehle mehr entgegen ( wie ein no Signal Fehler eben) der andere Monitor funktioniert weiterhin und ich kann daran arbeiten\r\n    die Speicher und CPU sehen alle gut aus nun kann ich das nur darauf zurückführen das es eben nur seit kurzem und nur bei LOL auftritt andere mehr Hardware verbrauchende Spiele freezen nicht\r\n    Windows 10 64 Bit Home\r\n\r\n    StandBy ist deaktiviert - ja Monitor ist Neu seit Januar..und bis vor 3 Wochen lief auch noch alles gut\r\n\r\n    was ich in der zwischenzeit versucht hatte war Windows Visual C++ neuinstalliert auf die neuste Version 2017 + Updates .. schien erstmal stabil gelaufen zu sein allerdings ist es eben gerade erneut gefreezed\r\n    in der Windows Ereignisanzeige wo Fehlermeldungen usw. protokolliert werden kann ich leider auch nichts dementsprechendes finden\r\n\r\n\r\nNun weiß ich auch nicht weiter, ich hoffe jemand der dieses Problem hatte und es vielleicht gelöst bekommen hat liest mit und kann mir eine Problembehebung vorschlagen.","replies":[{"poster":"BjêrgsênI","date":"2020-02-16T04:11:32.401+0000","up_votes":1,"down_votes":0,"body":"hab das selbe Problem aber komischer weise nur bei ranked games  alle 5 Minuten     bei aram hab ich keine Probleme","replies":[]},{"poster":"Xahou","date":"2019-01-19T20:23:22.872+0000","up_votes":1,"down_votes":0,"body":"Bei mir das gleiche. Bei manchen Spielen freezt mein LoL einfach so. Ich hör aber trotzdem im Hintergrund alle im Teamspeak weiter und kann auch selber reden. Nach ein paar Sekunden (meistens) läuft LoL dann wieder und ich seh alles was in z.B. 30 Sekunden passiert ist in 2 Sekunden ablaufen und hör auch die Geräusche die in der Zeit entstanden sind. Hab schon das Spiel neuinstalliert, das HExtechRepairTool gedownloadet und V-Sync Einstellungen in LoL geändert. Der Bildschirm ist auch neu.\nHilfe wäre super.","replies":[]},{"poster":"LetsMatt","date":"2019-01-15T15:10:46.620+0000","up_votes":1,"down_votes":0,"body":"Hab genau das selbe Problem.. wäre schön wenn der Support hierauf antworten würde. Hab einen neuen Rechner mit allen aktuellen Treibern und finde es komisch das es Crashed...","replies":[]},{"poster":"Auulay","date":"2018-12-01T20:24:36.774+0000","up_votes":1,"down_votes":0,"body":"Hast du eventuell irgendwelche Overlays am laufen? Discord / Overwolf / und wie sie alle heißen? Die können gerne mal Probleme verursachen","replies":[]}]}