{"poster":"Perlendieb","date":"2015-04-23T22:50:44.078+0000","title":"trotz high feed low lvl","subforum":"Spielerverhalten & Moderation","embed":{"description":"Jedes Match erzählt seine eigene Geschichte; schaue in den neuen Matchverlauf von League of Legends, um zu sehen, wie diese ausgeht, und um andere an deinen Geschichten teilhaben zu lassen!","url":"http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2077152114/208936766?tab=overview","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":1,"down_votes":1,"body":"Hi ho \r\nhab ma ne bescheidene frage\r\nin dem game link bin ich lvl 10 mein voli lvl 12\r\nich habe 3 kills und 1 assist mehr 2 tower + 2 drakes mehr \r\nund trotzdem ist der voli 2 lvl &uuml;ber mir verstehe das net so ganz wobei ich mehr auf den lanes war als in der base.","replies":[{"poster":"0815xand0r","date":"2015-04-23T23:01:01.927+0000","up_votes":3,"down_votes":0,"body":"Du hast dir die XP geteilt, vornehmlich mit dem Support. Der Voli war länger allein auf der Top-Lane und bekam so Solo-XP.","replies":[]},{"poster":"Temudschinn","date":"2015-04-24T12:17:25.242+0000","up_votes":2,"down_votes":0,"body":"Drache und Türme geben keine \"lokale\" Erfahrung. Sprich, du hast in dieser Hinsicht keinen EP-Vorteil Voli gegenüber.\nAndererseits hatte er massig Solokills (die geben mehr EP als geteilte) und konnte ständig alleine auf der Lane sein, während du deine EP mit dem Support teilen musstest und nur ca. 87% der vollen EP erhalten hasten (falls die 87% nicht stimmen bin ich froh um Korrektur)","replies":[]},{"poster":"Djerun90","date":"2015-04-24T08:40:16.611+0000","up_votes":2,"down_votes":0,"body":"1. Volibear war allein auf der Lane und hat deswegen die vollen EXP erhalten, während du dir die Erfahrung auf der Botlane mit dem Supporter teilen musstest\n2. Volibear ist nicht gestorben und war deswegen wahrscheinlich länger auf der Lane als du (Voli kann gefühlt stundenlang auf der Lane bleiben)\n3. Volibear hat Rengar mehrmals 1vs1 besiegt und deswegen viel Erfahrung bekommen, während ich bei dir als ADC drauf spekuliere, dass du deine Kills mehr zusammen mit deinem Supporter oder im Teamfight geholt hast \n\nJa, man unterschätzt teilweise wirklich, wie viel Erfahrung ein Toplaner bekommt, wenn er gut ins Spiel startet ;-)\n\nAber schau dir z.b. deine Support-Jana an ... die ist auch nie gestorben, war deswegen wahrscheinlich ständig auf der Lane und hat am Ende auch mehr Erfahrung als du bekommen .... Level 11 gegen Level 10","replies":[]},{"poster":"Perlendieb","date":"2015-04-24T18:13:55.235+0000","up_votes":1,"down_votes":0,"body":"ich bedanke mich für die vielen kommentare\ndas ergibt sinn und versteh das auch =) \nwusste nur net das kills auch die exp gesplittet wird. \ndas auf der lane bleiben ist schon hart das nen toplaner der tanky geht wirklich extrem lange auf der lane bleiben kann ^^","replies":[]}]}