{"poster":"Perlendieb","date":"2016-10-11T19:58:45.539+0000","title":"Leavbuster / bestrafung zu hart?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":15,"body":"F&uuml;r einige ist die Leavbuster Bestrafung gerechtfertigt aber f&uuml;r einige auch nicht.\r\nIch selbst habe das problem das alle &quot;X&quot; games mein PC einfach ausschaltet egal ob ranked oder aram... und ich starte sofort neu lade League und connecte und lande nach 30 sec ladezeit im &quot;End&quot; screan wo alle miteinandner reden und ich punkte abgezogen bekomme und mich versuche zu erkl&auml;ren.\r\nMein vorschlag bitte setzt die &quot;Surrender/Reset&quot; Funktion f&uuml;r Leaver ein wenig h&ouml;her denn ein Kompletter PC restart dauert nunmal ca. 60 sec. und wenn die leute Panisch nach 40 sec sofort surrender/restarten dann is das einfach unm&ouml;glich.\r\nsofern nicht jeder einen &quot;HIGH END&quot; PC hatt wo League ast rein l&auml;uft.\r\nIch hatte meine Letzten ausf&auml;lle w&auml;rend meiner letzten promo und 2 games danach.habe mich mit den 5/10 min abgefunden danach habe ich die promo erreicht 2 games in folge verloren und promt im neuen game wieder absturz und nun 20 min Leavbuster.\r\nIrgendwo sollte eine grenze gezogen werden zwischen spielern die WIRKLICH resetten wollen und spielern denen das Ranked Schei&szlig; egal ist!!\r\nTeemos die ein spiel total versauen PERMANENT wenn man die Matchhistory anschaut werden nicht bestraft davon hatte jeder schon VIEL ZU VIELE! aber Spieler die nur einen &quot;Restart&quot; brauchen die werden mit 20 min bestraft DANKE RITO!!!!","replies":[{"poster":"legofreak1","date":"2016-10-11T20:05:43.894+0000","up_votes":7,"down_votes":0,"body":"Damit ein Remake ausgelöst werden kann, musst du dem Spiel in den ersten 3 Minuten mindestens 90 Sekunden am Stück fern geblieben sein. Wenn dies der Fall ist hat dein Team dadurch bereits einen Nachteil erhalten. Kümmere dich bitte um deine technischen Probleme, ansonsten wirst du in Zukunft öfter mit dem Leaverbuster aneinander geraten. Solltest du dabei Hilfe benötigen, kannst du diese im Forum für [Hilfe & Support](http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de) erhalten.","replies":[{"poster":"Perlendieb","date":"2016-10-11T20:13:38.717+0000","up_votes":1,"down_votes":7,"body":"Ich werde meinen PC in den nächsten 2 tagen ienfach einmal komplett neu aufsetzen vllt behebt sich das ja wieder es hatt ja schlieslich vor dem 6.18er patch auch funktioniert wer weiß was meine frau hier wieder raufgeladen hatt aufm pc und vierenbelastet gedownloaded hatt aber trotzdem find ich das einfach bisls zu hart man könnte das ja auch auf 150 sec hochsetzen weil 90 sec das schafft keiner.","replies":[{"poster":"hshtagniemehrcdu","date":"2016-10-11T20:19:51.795+0000","up_votes":9,"down_votes":0,"body":"> [{quoted}](name=Perlendieb,realm=EUW,application-id=KYnfKGf0,discussion-id=B88tuiIp,comment-id=00000000,timestamp=2016-10-11T20:13:38.717+0000)\n>\n> Ich werde meinen PC in den nächsten 2 tagen ienfach einmal komplett neu aufsetzen vllt behebt sich das ja wieder es hatt ja schlieslich vor dem 6.18er patch auch funktioniert wer weiß was meine frau hier wieder raufgeladen hatt aufm pc und vierenbelastet gedownloaded hatt aber trotzdem find ich das einfach bisls zu hart man könnte das ja auch auf 150 sec hochsetzen weil 90 sec das schafft keiner.\n\nDann spiel nicht, bis du deine Probleme behoben hast.\nMit einem PC zu spielen, der andauernd Probleme macht, ist ziemlich a**** gegenüber den anderen Spielern....","replies":[{"poster":"Perlendieb","date":"2016-10-11T20:49:09.705+0000","up_votes":1,"down_votes":8,"body":"Ich habe gerade ein Haus geerbt und ich brauch Iwas zum ablenken wärend der ganzen \"SCH...****\" und LOL hatt mir immer geholfen zum ablenken der Privaten probleme ich brauche LOL derzeit einfach um den Kopf leer zu kriegen und das nervt einfach ab nen game mit 20 min delay zu starten!!!","replies":[{"poster":"legofreak1","date":"2016-10-11T20:50:51.895+0000","up_votes":9,"down_votes":0,"body":"Und deine Mitspieler nervt es, dass jemand zu spät ins Spiel kommt und sie deswegen im Nachteil sind. Deine Mitspieler sind vielleicht in einer ähnlichen Situation wie du und wollen mit einer gemütlichen Runde am Abend etwas runterkommen, da nervt diese dein Verhalten genauso.","replies":[]},{"poster":"HyperionCH","date":"2016-10-12T06:03:07.152+0000","up_votes":6,"down_votes":0,"body":"Zum Ablenken braucht es btw. Auch kein Ranked. ;)","replies":[]}]}]},{"poster":"0815xand0r","date":"2016-10-11T21:26:05.929+0000","up_votes":6,"down_votes":0,"body":"Also mit einem normalen Rechner, solange er denn eine SSD hat, kann man innerhalb von 90sec durchaus neustarten und reconnecten. Und eine 250GB SSD kostet echt nicht die Welt (und glaube mir, du wirst danach nicht mehr drauf verzichten wollen).\n\nAber wie dir schon geschrieben worden ist: du bist für deine Hardware verantwortlich und es ist einfach nicht okay, wenn du derart oft Probleme hast. Kümmere dich zuerst darum, diese Probleme zu lösen und dann kannst du auch wieder LoL spielen. Und die Zeit fürs Remake hochzusetzen ist auch keine Lösung, denn wenn du nach 150sec wieder reinkommst, hast du einen extremen Early-Game-Nachteil.","replies":[]}]}]},{"poster":"Freiherr Alex","date":"2016-10-12T05:31:20.319+0000","up_votes":4,"down_votes":0,"body":"Hab das Problem auch schon mal gehabt, mein PC ist auch nicht der neueste. Klingt alles ähnlich wie bei mir.\nBei mir hat sich rausgestellt, dass mein PC Hitze Probleme hatte. Sprich ich hab den CPU Lüfter erst mal abgeschraubt und den Staubteppich entfernt. da hat mich das nicht mehr gewundert dass der PC nicht mehr wollte.\nVielleicht solltest du das mal versuchen und es hilft schon. Macht auf jeden fall weniger Arbeit als Win neu aufzusetzen.\nWeil ob dir das gerecht erscheint oder nicht...gerechtfertigt ist deine Bestrafung nun mal.\nDrück dir die Daumen :)","replies":[]},{"poster":"Temudschinn","date":"2016-10-11T23:02:42.329+0000","up_votes":5,"down_votes":1,"body":"Mein Computer ist ein Schrotthaufen. Ich bin zu faul ihn neu aufzusetzen, er ist 7 Jahre alt (und war schon damals gebraucht gekauft), ab und zu hängt er sich beim Start auf.\n\nTrotzdem läuft League astrein, weil das Game einfach kaum Anfoderungen hat. Und falls sich das ändern würde, weisst du was ich tun würd? Ich würd das Problem beheben. Und nicht wie du erst hunderten von Leuten das Game versauen und danach rumheulen, weil ich 20 Minuten warten muss.","replies":[]},{"poster":"Megamaexx","date":"2016-10-12T09:03:05.167+0000","up_votes":3,"down_votes":0,"body":"Ich finde die Leaverbuster-Strafen eigentlich noch ziemlich milde. Ein absichtlicher Feeder bekommt immerhin nach einem Vergehen sofort einen 14-Tage-Bann, beim zweiten Mal einen permanenten, da ist nach vielfachen Verlassen von Spielen eine Sperre von 20 Minuten ziemlich gering.\nAber wie die anderen schon gesagt haben, fix dein Problem oder spiel was anderes. (Staub vom Lüfter entfernen ist übrigens ein sehr guter Tipp von seipelsche)","replies":[]},{"poster":"Lagbeard","date":"2016-10-13T12:08:21.853+0000","up_votes":2,"down_votes":0,"body":"LoL benötigt vieles, aber ganz sicher keinen High End PC. ich kenne viele, die ohne Probleme auf noch gammligeren Maschinen zocken als ich, und mein Laptop ist schon ne Klapperkiste. \n\nUnd weil ich es bin, der Antwortet hier noch mal RIOTs Meinung dazu:\n\n>[Sie versichern bei der Installation des Spiels, dass sie] die auf der Site angegebenen Hardware- und Verbindungsanforderungen erfüllen. Diese Anforderungen können sich mit der Weiterentwicklung des Spiels verändern. Sie sind vollumfänglich verantwortlich für die in Zusammenhang mit Ihrer Internetnutzung entstehenden Kosten sowie die Kosten für Hardware, Wartung oder Reparaturkosten, die für Ihren Zugang zum Spiel erforderlich sind. \n\nWie üblich aus den AGB. Schade eigentlich, dass die nicht für alle zugänglich sind. Oh, wait...\n\nAuf deutsch: Dein PC, dein Problem und du hast selbst zugestimmt, dass das Okay ist. Du kannst nicht erst \"ja\" und dann \"nein\" sagen, wie es dir gerade passt. Also, kannst du schon, aber niemand kann dir da dann helfen.\n\n\n\nMeine Meinung: \nIch finde die Strafen durchaus angemessen. Man muss schon echt oft disconnecten, damit da was passiert. Dazu kommte der Teil oben, nach dem du selbst versichert hast, dass du in der Lage bist, das Spiel zu spielen. ICh bin auch ein großer Fan der Remake Funktion, denn ich warte lieber 10 Mal in der Q, als ein Ranked im 4 gegen 5 zu spielen. Niemand kann mir versichern, dass der AFKler wiederkommt, da bin ich schon froh, wenn ich das Spiel zeitig abbrechen kann. Das einzige, was ich einführen würde wäre eine High Priority Q für Remakeopfer. Das wär schön.\nDazu kommt noch, dass wenn man den Zeitraum verlängert, du zwar eventuell wiederkommst, aber Farm, Kills und EP, verpasst hast, deine Lane nicht beschützen konntest, sodass der Jungler einspringt, was dem Gegnerischen Jungler freie Junglekontrolle und Ganks in beiden Seiten verleiht und und und.\n\nWas die Trolls angeht, so bin ich ebenfalls einer der Leute, die strengere und schnellere Strafen für Flame und Troll fordern. Was nicht passieren wird, aber das ändert an meiner Grundhaltung nichts.","replies":[]}]}