{"poster":"tomfunes","date":"2017-01-09T15:07:08.955+0000","title":"¿Magos carrys? ¿Por qué?","subforum":"Charlas Generales","up_votes":2,"down_votes":4,"body":"&Uacute;ltimamente se est&aacute;n viendo muchos magos en bot como apc. Incluso los profesionales los est&aacute;n practicando. Ziggs es el &quot;tirador&quot; con mayor winrate del momento, pero tambi&eacute;n se juega mucho Cassio, Orianna, etc. \r\n&iquest;Por qu&eacute; creen que se da ahora? Los adc est&aacute;n en la mierda, si, pero de ah&iacute; a que desaparezcan... \r\nA mi se me ocurre algo: la desaparici&oacute;n de los objetos que daban aura de resistencia m&aacute;gica a tu team. Los adc antes no necesitaban hacerse SIEMPRE un {{item:3139}} o {{item:3156}} para que no los deletee un mago porque el supp o la jungla se armaban {{item:3190}} y atenuaban el da&ntilde;o que pod&iacute;an hacer los magos a los carrys.\r\n&iquest;Ustedes qu&eacute; opinan?","replies":[{"poster":"LSB MrPapu","date":"2017-01-09T15:12:39.354+0000","up_votes":2,"down_votes":1,"body":"hay que dejar de copiar a los profesionales y jugar mas como uno sabe, ellos están a otro nivel. cuando seamos profesiones hay vemos.","replies":[{"poster":"tomfunes","date":"2017-01-09T15:23:40.319+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=F4cu3797,realm=LAS,application-id=v7qsfXsE,discussion-id=rTTMZsUF,comment-id=0001,timestamp=2017-01-09T15:12:39.354+0000)\n>\n> hay que dejar de copiar a los profesionales y jugar mas como uno sabe, ellos están a otro nivel. cuando seamos profesiones hay vemos.\n\nNo soy profesional ni mucho menos, pero cuando vez que el mejor tirador en todas las ligas y divisiones es un mago,cuanto menos me da curiosidad.","replies":[{"poster":"Saykan","date":"2017-01-09T16:10:21.819+0000","up_votes":1,"down_votes":0,"body":"realmente no es por profesionalismo ni nada el meta actual es de tanks y apc en bot la razon es por eso mismo los ADC contra tanks no pueden hacer mucho por mas que ganen la linea y aparte que la tienen muy complicada con los junglas y los gankeos hasta en nivel 1-2 \n\nlos ADC actualmente se arman atk speed y critico y muchos en si tampoco se arman penetracion de armadura y por mas que te la armes los tanks son muy fuertes con pocos objetos y con objetos son imparables gracias las maestrias etc \n\nlos APC en bot estan fuertes contra los ADC por la razon que les pegan demasiado y con pocas Kills te podes hacer al ADC en 0, segundos \n\nZiggs es bueno por que tiene absolutamente todo Daño bruto contra el adc buen pusheo y para colmo rompe torres en 1 seg \n\npero realmente cualquier APC con movilidad es bueno y aun asi sin movilidad con un buen soporte tambien es bueno","replies":[]}]}]},{"poster":"Quo","date":"2017-01-09T16:20:56.683+0000","up_votes":1,"down_votes":0,"body":"Que yo sepa, al menos de ziggs se que se esta jugando porque su capacidad de burst es una salvajada, y sumado a eso, su w es un executer de torretas, ademas su pasiva le aplica daño a torretas tambien, y su kit le permite un juego safe desde lejos, tiene el doble de rango que una cait por ejemplo, ademas de que pushea muy bien.\n\n\n**Resumen taringuero nivel 5**\n\n\nPor esto: \n\nhttps://youtu.be/1bQ6aZBC6qA?t=9m17s","replies":[]},{"poster":"HeartOfTheStormm","date":"2017-01-09T16:06:52.131+0000","up_votes":1,"down_votes":0,"body":"la realidad es que los adc esan demasiado mal, con el bufeo a los magos, y acecinos, puffff.","replies":[]},{"poster":"9081913DEL1","date":"2017-01-09T15:13:50.573+0000","up_votes":1,"down_votes":0,"body":"A ver eso se ve hace años en korea, ahri se uso adc cuando salio, es por otro tema, no hay obligacion de ir adc rango. hasta yi y mundo se usaba de adc.\n\nEs cuestion de pensar y coordinar.\n\nIncreible que algunos todavia no conocen el concepto de antimeta.","replies":[{"poster":"tomfunes","date":"2017-01-09T15:22:04.976+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zelos From Jonia,realm=LAS,application-id=v7qsfXsE,discussion-id=rTTMZsUF,comment-id=0002,timestamp=2017-01-09T15:13:50.573+0000)\n>\n> A ver eso se ve hace años en korea, ahri se uso adc cuando salio, es por otro tema, no hay obligacion de ir adc rango. hasta yi y mundo se usaba de adc.\n> \n> Es cuestion de pensar y coordinar.\n> \n> Increible que algunos todavia no conocen el concepto de antimeta.\n\nSi, conozco el concepto de antimeta, el problema es que ziggs apc en bot se está convirtiendo en meta. El problema es que los adc están todos fuera del meta actual (excepto quizás Corki, pero en mid). Creo que no entendiste lo que quise decir, no es una queja, es una simple observación y quería conocer lo que opinaba la comunidad.","replies":[{"poster":"9081913DEL1","date":"2017-01-09T15:32:29.299+0000","up_votes":1,"down_votes":0,"body":"Desde mi punto de vista hay adcs que ya no tienen gran rinde, hace varios parches, pero hay adcs que se mantienen. Ashe puede mantener a raya a casi cualquier adc. Jhin, ezreal, claro no te tienen que atrapar, pero los duo fast estuvieron siempre. Incluso un irelia + karma o irelia + morgana, terror de los adcs. Es cuestion de saber adaptarte y saber que hacer. \nComprendo que para muchos es algo nuevo, sobre todo porque si toman una build como obligatoria mas va a costar que vean una  rotacion o un pick especifico). Ziggs rinde de adc pero tiene problemas contra campeones clave, como siempre los tuvo. Lo mismo que pasa con el pick ashe + mf. Tiene una bestialidad de combo y ambos sufren de un buen gankeo como rek, vi o elise.\n\nSi no es queja, pero va a costar que muchos que recien se adaptan a la composicion clasica tomen el parametro.\nSaludos.","replies":[]}]}]},{"poster":"faster51","date":"2017-01-09T15:09:46.768+0000","up_votes":1,"down_votes":0,"body":"yo opino que los tiradores se empiezen a jugar en mid, o creo que será así en algún futuro","replies":[{"poster":"tomfunes","date":"2017-01-09T15:24:27.222+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=faster51,realm=LAS,application-id=v7qsfXsE,discussion-id=rTTMZsUF,comment-id=0000,timestamp=2017-01-09T15:09:46.768+0000)\n>\n> yo opino que los tiradores se empiezen a jugar en mid, o creo que será así en algún futuro\n\nCorki es actualme el mejor midlaner del juego...jajajaja","replies":[{"poster":"faster51","date":"2017-01-09T15:28:27.607+0000","up_votes":1,"down_votes":0,"body":"a si? lol XD, hay que probar así:  luchadores supp, asesinos top, tiradores mid, magos adc, y supps jg :V","replies":[]}]}]}]}