{"poster":"xImVaas","date":"2016-03-05T14:35:23.655+0000","title":"Spielerrolle/Champion finden","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":1,"body":"Moin Leute, ich zocke seit einer Woche LoL und hab ein paar Champs und Lanes ausprobiert. Ich habe allerdings nichtmal ansatzweise meine Rolle gefunden (das Einzige, was ich ausschliessen kann ist die Rolle des Tank). Irgendwelche Tipps, wie ich meine Rolle finde? Bin momentan n&auml;mlich noch sehr schlecht und mit dem Rollefinden durch die gro&szlig;e Anzahl der Champs usw. &uuml;berfordert :/","replies":[{"poster":"xImVaas","date":"2016-03-05T17:33:57.367+0000","up_votes":1,"down_votes":0,"body":"Cool Amnesia werd ich machen :) Hab Interesse an Pantheon und Miss Fortune gefunden. Hab jedoch gehört das Pantheon eher ein Tank ist, würde aber nicht so gerne Tank spielen. Seine Fähigkeiten sehen aber nach einem guten Schadensausteiler aus. Miss Fortune ist aber eine Schützin (ich mag Schützen) und sieht stark aus :) Wen soll ich wählen? Habe nicht die Punkte für Beide und kann noch kein Geld in das Spiel stecken.","replies":[{"poster":"Glaskanone","date":"2016-03-05T21:12:56.616+0000","up_votes":1,"down_votes":0,"body":"Wenn du Interesse an Pantheon hast, kann ich dir ihn gerne ingame näher bringen.\n\nEr ist an sich nicht schwer zu spielen, du wirst ziemlich oft deine Lane gewinnen, aber bei ihm ist es wichtig die richtigen Entscheidungen zu treffen und die Games schnell zu finishen, bevor k im späteren Spiel abfällst.","replies":[]},{"poster":"Lady Yunalesca","date":"2016-03-05T19:35:10.701+0000","up_votes":1,"down_votes":0,"body":"naja pantheon ist primär kein tank,wenn dann eher ein off-tank. man baut ihn schon eher schadens-orientiert. Das gute bei ihm ist,dass du pantheon sowohl top als auch jungle spielen kannst und er ist relativ stark und einfach,er hat viele gute matchups und ist ein ziemlicher lane bully .\nMiss fortune wirst du so ziemlich nur auf der Bot spielen,ist aber auch kein schlechter Pick,sie hat extrem viel schaden ist aber auch schwieriger im vergleich zu Pantheon^^","replies":[]}]},{"poster":"Cyanprime","date":"2016-03-05T16:18:20.645+0000","up_votes":1,"down_votes":0,"body":"Hi,\nnachdem du erst seit einer Woche LoL zockst, solltest du aufjedenfall jeden Champ testen. Außerdem wird es warscheinlich noch 1-2 Monate dauern, bis du deine Mainrolle findest.\nMfG Cyanprime","replies":[]},{"poster":"xImVaas","date":"2016-03-05T15:23:42.888+0000","up_votes":1,"down_votes":0,"body":"Sag das mal der Community die sehen das anders wenn ich halt mit 2/10/5 oderso dastehe :D","replies":[{"poster":"Lady Yunalesca","date":"2016-03-05T15:48:38.903+0000","up_votes":1,"down_votes":0,"body":"naja kommt mit der zeit,welche champs haben dir denn bisher gefallen?\ndu kannst mich auch gerne in-game adden wenn du weitere fragen hast etc :)","replies":[]}]},{"poster":"Lady Yunalesca","date":"2016-03-05T14:43:31.829+0000","up_votes":1,"down_votes":0,"body":"ach lass dir Zeit,probier die free week champs und du findest schnell was,das dir gefällt. Sobald du diese champs hast kannst du mit den kriterien neue finden.\nDu spielst noch nicht lange also ist es doch komplett in Ordnung viel auszuprobieren und sich noch nicht festzulegen^^","replies":[]},{"poster":"Reaz83","date":"2016-03-05T14:38:35.091+0000","up_votes":1,"down_votes":0,"body":"Also als ich LoL angefangen haben war mir eins klar {{champion:33}} im Jungle ... bin bis heute immer noch Jungler ... \n\nJungle is my Home","replies":[]}]}