{"poster":"JimmyJohn1623","date":"2015-08-03T17:48:46.384+0000","title":"Is it worth buying Miss Fortune?","subforum":"Gameplay","up_votes":3,"down_votes":2,"body":"Should I buy Miss Fortune or is she still bad?\r\n{{champion:21}}","replies":[{"poster":"Celio Hogane HD","date":"2015-08-03T18:32:42.729+0000","up_votes":2,"down_votes":0,"body":"Depends, do you want to play her to have fun or to win?","replies":[{"poster":"Marthian","date":"2015-08-03T19:06:56.975+0000","up_votes":4,"down_votes":0,"body":"Either answer leads to yes.\n\nI play her frequently and do very well with her. So does a lot of other Miss Fortune players that know what they are doing.","replies":[{"poster":"AmazÍan","date":"2015-08-15T03:00:49.556+0000","up_votes":1,"down_votes":0,"body":"exactly ^^","replies":[]},{"poster":"Celio Hogane HD","date":"2015-08-04T13:59:42.614+0000","up_votes":1,"down_votes":0,"body":"actually the \"WIN\" depends on the guy, you know, not everybody is good with the same character.","replies":[]}]}]},{"poster":"colesy","date":"2015-08-03T17:53:09.399+0000","up_votes":1,"down_votes":0,"body":"mf is pretty fun to play as, plus her new captain fortune skin is really nice. \n\nyou can bully your lane really hard and then try and push your lead mid-game but I feel she drops off mid-late.","replies":[{"poster":"VDc0zCqe0w","date":"2015-08-03T18:28:19.207+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=colešy,realm=EUW,application-id=3ErqAdtq,discussion-id=ccZ5ZF7E,comment-id=0003,timestamp=2015-08-03T17:53:09.399+0000)\n>\n> mf is pretty fun to play as, plus her new captain fortune skin is really nice. \n> \n> you can bully your lane really hard and then try and push your lead mid-game but I feel she drops off mid-late\n\nmidgame she's still strong, she falls from the 30th minute and on","replies":[{"poster":"Marthian","date":"2015-08-03T19:08:33.935+0000","up_votes":3,"down_votes":0,"body":"She may not be a late game hyper carry, but don't under-estimate her either, she is still a threat.","replies":[]}]}]},{"poster":"A Miss Fortune","date":"2015-08-03T21:29:26.045+0000","up_votes":2,"down_votes":0,"body":"From a Miss Fortune main's view I don't think she's bad by any means.\n\nShe's a really solid ADC that's has easily the best laning phase of all ADCs, she can be super scary during teamfights, and she falls off late game clearly though she isn't non-exisent. Any ADC will do damage late game due to how Attack Damage and the builds work currently. Proof of this is my weird match history of playing AD Janna for some reason.\n\nBut anyways, she's so much fun and she's strong even if she's ahead or behind. Actually last time I was \"behind\" in lane, I ended up some how 1v4'ing and getting a quadra kill. A good Miss Fortune just doesn't lose lane, and it allows her to be an insane threat mid game even if for some reason she is behind.\n\nThere's plenty of sheep on the boards and those who actually only go on the boards to post anti-Miss Fortune threads and stuff like that almost exclusively. I'd suggest playing Miss Fortune for yourself, since clearly everyone isn't going to like the same champion. But overall I think she's fun, healthy, viable, with a low skill base and a high skill cap.","replies":[]},{"poster":"5 Shots Of Jhin","date":"2015-08-03T19:38:20.753+0000","up_votes":2,"down_votes":0,"body":"I feel that MF is a very odd ADC, and there are definitely more powerful ADC's out there right now. However, I don't think this makes her a weak pick, as she does have very good lane harass and a good long-ranged cone ulti, however I think it is very difficult to play her versus more powerful bot lane combos such as a Kalista - Nautilus bot lane for example, as her ulti can get easily cancelled etc. She also lacks an escape.","replies":[]},{"poster":"Only Play Darius","date":"2015-08-15T03:12:20.983+0000","up_votes":1,"down_votes":0,"body":"Her kit is an absolute mess, but she is a lane bully and can handle herself better than most ADC's. Her mixed damage is good for mid game but she's just too janky to be taken seriously (Ult converts AP into AD damage for real?). However I have seen people do extremely well with her, but it might not be worth learning.","replies":[]},{"poster":"MLDzXnRRR","date":"2015-08-04T14:27:03.322+0000","up_votes":1,"down_votes":0,"body":"She is not op, broken, high skill cap - but is dead meat vs assasins.","replies":[]},{"poster":"Sythriel Draken","date":"2015-08-03T20:14:30.885+0000","up_votes":1,"down_votes":0,"body":"If only they would change her W to allow strut to be always on during the duration of the W no matter what. that would make her even more viable","replies":[]},{"poster":"OverpoweredSoap","date":"2015-08-03T20:14:26.569+0000","up_votes":1,"down_votes":0,"body":"Her problem is that a lot of other adcs have a much easier time dealing with getting jumped on.\n\nShe is really fun though, she's kind of a mix between a mage and adc, at least imo.","replies":[]},{"poster":"Reaper Soraka","date":"2015-08-03T21:37:24.007+0000","up_votes":1,"down_votes":1,"body":"I'm sure you could get to platinum/diamond with her.  Your personal skill and game knowledge matters more than if the champions have a slight stats advantage or not, up until the highest of tiers.","replies":[]},{"poster":"Leu07","date":"2015-08-03T20:12:55.086+0000","up_votes":1,"down_votes":1,"body":"She is outclassed by Jinx by faaaarr. She is an inmobile adc but not a hypercarry like jinx or Kog'maw. She is stupidly team dependent, take Jinx or Vayne that are stupidly broken instead.","replies":[]},{"poster":"Woodsy2575","date":"2015-08-03T17:50:06.827+0000","up_votes":2,"down_votes":2,"body":"Watch this\nhttps://www.youtube.com/watch?v=YxzirQ7Uz3I","replies":[]},{"poster":"S H A Y C 0","date":"2015-08-03T17:49:59.255+0000","up_votes":1,"down_votes":1,"body":"nothing special, more or less the same champion with an on demand hell speed boost. AP miss fortune is quite dead though.","replies":[]},{"poster":"TraakSC","date":"2015-08-03T17:49:53.133+0000","up_votes":1,"down_votes":1,"body":"Do you want to play her? If so then yes, otherwise no.","replies":[]},{"poster":"theragingnerd","date":"2015-08-03T21:19:24.364+0000","up_votes":1,"down_votes":2,"body":"its about mind games you make the enemy think you are weak oh wait you are weak","replies":[]}]}