{"poster":"HimbeerJogurt","date":"2018-08-27T16:46:46.898+0000","title":"Botlane duo suchen ein nettes Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hall&ouml;le alle samt !\r\n\r\nWir sind ein nettes botlane team auf der suche nach einen geigneten team  ganz league of legends zu unterwerfen *bad jokes wieder weg packen*\r\n\r\nStellen wir uns mal eben kurz vor !\r\n\r\nMein name ist Henrik aber warum auch immer nennt mich jeder Klaus zur zeit bin ich 21 jahre alt aber dieses alter ver&auml;ndert sich einmal im jahr *kiste wieder vergraben*\r\n\r\nIch bin ein ruhiger spieler der sich aber  auch gerne unterh&auml;lt\r\nmein salzgehalt liegt bei unter 5% , Ich bin sehr lernf&auml;hig und f&uuml;r kritik an meinen spielstyle der in der laneing face ehr passiv ist immer offen \r\nMan kann sich mit mir sehr gut unterhalten hab immer ein offenes ohr und meine game wissen ist auch nicht grade schlecht !\r\n\r\nkommen wir zu den champions die ich spiele \r\nMein absuloter main ist Thresh \r\ndicht gefolgt von\r\n- Nami\r\n- karma\r\n- leona\r\n- brand\r\n und als keiner  spa&szlig; faktor Zac support\r\n\r\nIch bin immer offen f&uuml;r neues und K&ouml;nnte auch f&uuml;r die mitte ein springen wenn der midlaner verhindert ist ! \r\n\r\ndort spiele ich ehr \r\n-lux\r\n-ahri\r\n-syndra \r\n-karthus\r\n\r\nnaja genug von mir kommen wir zu meinen Adc\r\n\r\nHeyho\r\n\r\nMein name ist Christian aber alle nennen mich chris sehr einfalls reich ich wei&szlig; dazu bin ich schon 20 jahre alt !\r\n\r\nmein salzgehalt liegt bei ca. 5%.\r\nIch bin  in der laneing face ehr auf der passiven seite mein farm ist mir hoch und heilig wann hat man den schon die gelegnheit farmer zu sein *reusper* nicht lustig ? schade  Ich bin auch sehr kritikf&auml;hig aber leider ein perfectionist wenn mein farm zu sehr nach hinten geht habe ich die angewohnheit zu vergessen das meine menschen nicht taub sind an diesen ohrenbet&auml;ubenden mengel arbeite ich schon das dieser weg geht \r\njetzt kommt der interessante part !\r\nwas ich so im moment gerne spiele \r\n\r\nMein main ist Jinx\r\n\r\ndanach kommt \r\n-Lucian \r\n-Caitly\r\n-Kalista\r\n\r\nIch kann aber auch noch Support als secondary lane spielen falls der support mal nicht kann dort spiele ich meisten \r\n\r\n- Thresh\r\n- Janna\r\n- Taric\r\n\r\n\r\nWenn ihr bis jetzt noch nicht abgeschreckt seid w&uuml;rden wir uns sehr &uuml;ber ein add freuen wenn noch fragen auf kommen bitte einfach anschreiben ! \r\n\r\nbis dahin \r\n\r\nSch&ouml;nen tag noch","replies":[{"poster":"Jagganut","date":"2018-08-30T14:40:53.976+0000","up_votes":1,"down_votes":0,"body":"Hallöchen lieber Futo Maki,\nwie ich gesehen habe bist du auf der suche nach Mitgliedern für deine Games?\nBei uns spielen täglich Gruppen in Normals, Rankeds und anderen Modi in Bronze-Platin - d.h. du müsstest nie mehr fremde Leute suchen!\n \nWir sind eine ~300 Mitglieder große Ü18 Community mit Bereichen in LoL, OW, P&P und Other Games.\nBesteht evtl. Interesse? Dann melde dich doch einfach nochmal bei mir oder joine einfach direkt dem Discord! :)\n \nHier musst du nur unsere Regeln lesen und dein Alter bestätigen:\nhttps://discord.gg/RtgmsCe\n \nWir sehen uns in der Kluft!","replies":[]},{"poster":"JG Aaron","date":"2018-08-27T17:28:12.355+0000","up_votes":1,"down_votes":0,"body":"Wenn ihr ein freund von Katzenbilder seid, dann schaut mal bei dem Link vorbei:\n\nhttps://boards.euw.leagueoflegends.com/de/c/clans-teams-de/ieKi6BnE-wie-war-das-mit-den-ranked-teams-nochmal-achja\n\nPS: Es geht auch um Teams :D","replies":[]}]}