{"poster":"CapitalSivir","date":"2018-05-19T22:19:58.032+0000","title":"que debo hacer en esta situacion","subforum":"Memes & juegos","up_votes":4,"down_votes":0,"body":"amigos lolero que debo hace ante esta situaci&oacute;n: tengo un amigo que conoc&iacute; en la escuela que juega lol y el fue el quien me inicio y animo a jugar este maravilloso juego, cuando empece a jugar recuerdo que el era bronce 4 en flex y duo y le costaba mucho ascender de liga, el me ense&ntilde;o la mayor parte de lo que yo se del juego y cuando rankie mis primeras 10 ranked me dejaron en plata 5 en duo y en bronce 1 en flex.\r\nEn Este a&ntilde;o el progreso bastante y de echo creo que se agrando mucho por sus m&eacute;ritos, de echo este a&ntilde;o al jugar las 10 primeras ranked de la season 8 lo dejaron en bronce 5 en duo y flex pero, no se dio por vencido ahora el esta en plata 5 en duo y plata 2 en flex. \r\n\r\nYo este a&ntilde;o tambien ca&iacute; en bronce 5 en duo y flex pero logre salir f&aacute;cilmente solo, ahora soy plata 5 en duo y plata 4 en flex, mi amigo vio mi esfuerzo por ascender de liga y bueno me esta invitando a jugar ranked junto a el pero creo que siempre que juego con el me trollea las ranked, yo personalmente no quiero decirle nada porque es mi amigo y lo conozco hace a&ntilde;os, pero en la promo que tenia para ascender a plata 4 tenia 1 de 3 ganadas, solo me faltaba ganar una mas y pasaba a plata 4, pero intento trollearme las dos partidas, la primera la perdimos, pero la segundo logre carrearlo y al final termine ganando la promo, que es lo que debo hacer, seguir jugando con el hasta adaptarme a su estilo, o seguir jugando solo?","replies":[{"poster":"GR33NGOBLIN","date":"2018-05-19T23:58:40.156+0000","up_votes":4,"down_votes":0,"body":"no entendi nada, espero q no nos cruzemos en ranked salu3","replies":[]},{"poster":"Kokoro Chacarero","date":"2018-05-19T23:35:57.722+0000","up_votes":3,"down_votes":0,"body":"Estimado, creo que aquí hay un problema de perspectiva. Es muy probable que ambos sean malísimos, ambos piensen que el otro esta \"trolleando\" y ninguno se tome el juego con la seriedad suficiente como para querer mejorar de verdad. Es lo que pasa cuando se encara un juego competitivo desde la perspectiva de un estudiante de primaria. No dejes que ranked se interponga entre su relación.\n\nComo nota al pie, me gustaría exortarte a que prestes más atención durante las clases de lengua/idioma español. Tus poderes de redacción dejan mucho que desear, y se dificulta decifrar lo que pretendes transmitir.\n\nUn abrazo.","replies":[{"poster":"EsPawnJota","date":"2018-05-20T09:50:23.356+0000","up_votes":3,"down_votes":0,"body":"Me hiciste cagar de risa. +10 maquinola","replies":[]},{"poster":"Riklde","date":"2018-05-19T23:59:56.551+0000","up_votes":2,"down_votes":1,"body":"v:","replies":[]}]},{"poster":"RSSPLOTER","date":"2018-05-19T22:43:53.413+0000","up_votes":1,"down_votes":0,"body":"Mejor solo que mal acompañado.\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Riklde","date":"2018-05-20T00:00:21.055+0000","up_votes":1,"down_votes":0,"body":"lo que dijo el men de arriba","replies":[]}]},{"poster":"El Trollaso122","date":"2018-05-19T23:24:56.473+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-lux-2}}  Para que te invitara para jugar rankeds si te va a estar trolleando? Digo yo","replies":[]}]}