{"poster":"Wise Alien","date":"2016-10-13T06:03:11.030+0000","title":"questions about alpha client","subforum":"Client Discussion","up_votes":1,"down_votes":0,"body":"So I just got my pass for alpha client and got some questions. \r\n\r\n- What is the different between alpha and normal client? Is it just the client or are there in game differences too? \r\n\r\n- I&#039;m using a computer and a lap top for playing league, depending on where I am. I was on my computer when I got the message for the alpha client, so It&#039;s installed on my pc. Can I download the client for my laptop too? If yes, then how? \r\n\r\n- Is there a full client note?","replies":[{"poster":"RiotSomeOtherGuy","date":"2016-10-13T17:09:43.374+0000","up_votes":3,"down_votes":0,"body":"There are no in-game differences. The game itself is exactly the same. The client update is just for the part that runs \"outside\" the game, where you chat with your friends, look at your profile, join a matchmaking queue, etc.\n\nYou can download the client for your laptop as well. http://na.leagueoflegends.com/en/client-update/download\n\nThere are update news at http://na.leagueoflegends.com/en/client-update/news","replies":[{"poster":"Decrit","date":"2016-10-13T17:39:44.321+0000","up_votes":1,"down_votes":0,"body":"siiince you are here, do i miss something if i wait to do ranked until season ends, since you usually keep ranked up to seed for the next season? i am gold 5 with 0 lp and since i am at university my elo is begging me to not play ranked xD","replies":[{"poster":"Wise Alien","date":"2016-10-14T07:06:15.599+0000","up_votes":1,"down_votes":1,"body":"just play one ranked game every 2 weeks or so, so you won't get automatically dropped to silver","replies":[{"poster":"Decrit","date":"2016-10-14T07:37:59.063+0000","up_votes":1,"down_votes":0,"body":"there is no ranked decay on gold as i am aware","replies":[]}]}]}]},{"poster":"Luggs","date":"2016-10-13T16:00:03.541+0000","up_votes":1,"down_votes":0,"body":"1. There are a bunch of backend differences between the clients, as well as a hugely different design motif from the Legacy client. Riot is testing to weed out any bugs, since the code base is made entirely from scratch.\n\n2. Yes, you can install the alpha client on as many devices as you want. However, only accounts accepted into the beta will be able to log in with it. You can install the alpha client on other devices through the link in the acceptance  e-mail you were sent, or by going to the Client Update page and going back to the sign up area. If you're logged in, it'll show you the download link.\n\n3. I'm not sure I understand the question.","replies":[]}]}