{"poster":"Huelmerin","date":"2018-04-29T00:42:28.088+0000","title":"Me banean injustamente, dame tu opinión","subforum":"Off-topic y temas personales","up_votes":2,"down_votes":2,"body":"Buenas a todos y gracias de antemano por dedicarme su tiempo.Si bien no me considero un veterano del juego  tengo muchas partidas jugadas ( m&aacute;s de 3mil ) y juego activamente desde el 2015, resulta que hace unos d&iacute;as entro a jugar una partida normal la cual en la selecci&oacute;n de champs qued&oacute;  un poco confusa (el problema era que 2  cantaron top: pantheon y akali )  pero todos terminaron medianamente &uml;conformes&uml; con las lineas que les toco, nuestra composici&oacute;n era :  {{champion:84}} TOP; {{champion:245}} MID ; {{champion:203}} JG ; {{champion:80}} SUPP {{champion:29}} ADC ... La composici&oacute;n enemiga era {{champion:1}}  TOP ; {{champion:238}} MID {{champion:120}}  JG ;{{champion:498}}  ADC ; {{champion:497}} SUPP\r\nLa cosa es que yo iba con la rata adc y un panadero de supp, estaba conforme a pesar de lo que se pueda pensar de que pikeara panth supp para trolear (porque seg&uacute;n &eacute;l hab&iacute;a ganado top pero fue a bot con su ignite de supp) hasta el momento todo correcto para mi, pero todo cambio cuando el supp se me fue AFK  al minuto 2 y se me hacia imposible una fase de linea contra un rakan y una xayah super agresivos que ni bajo torre me dejaban farmear, sin contar que tenian un hecarim JG . Antes de que el MID enemigo suba al 6 (Zed) decido gankearlo (cosa que nuestro jg no hacia )  y en ese momento todo comenz&oacute; a ser una lluvia de insultos por parte de mi  ekko acus&aacute;ndome de troll por gankearlo y que dejaba mi linea sola ( porque nadie venia a ayudarme)  desde ese momento el ekko empez&oacute; una campa&ntilde;a de pedir que me reportaran porque me iba mal en la partida  y &uml;estaba troleando&uml; Infelizmente estamos acostumbrados a &eacute;sa gente toxica la cual no me afecto mucho, pero no fue una buena experiencia de juego porque resulta que al final de la partida me reportaron y me banearon el chat. Nuestro top y jg eran premades y se flameaban entre ellos, el ekko que pasaba insultando a todos, no me molesta el perder la partida pero si me molesta el baneo que me dieron y que mi honor bajara al lvl 1 que no me pareci&oacute; justo porque aunque es para otro tema el nuevo sistema de honor sin el Rival Honorable y la cuenta individual de cantidad de honores  recibidos  el cual extra&ntilde;o mucho pero tambi&eacute;n estoy agradecido porque ahora es mejor recompensado el que es un jugador  honorable. No voy a quien jugo mal o bien, sino al error de que me banearan \r\nUna vez m&aacute;s, gracias!\r\n  Adjunto el chat que me envi&oacute; Riot\r\n\r\nhttps://prntscr.com/jbfy9h\r\nhttps://prntscr.com/jbfymy\r\nhttps://prntscr.com/jbfxs1\r\nhttps://prntscr.com/jbfybs","replies":[{"poster":"Exit","date":"2018-04-29T02:25:23.190+0000","up_votes":2,"down_votes":0,"body":"falta mas abajo un poco mas del chat igual si te estaban molestando ni tendrias que haber contestado xD","replies":[]},{"poster":"ZanahoriaAsesina","date":"2018-04-29T00:51:22.222+0000","up_votes":3,"down_votes":1,"body":"Deberías hablar con Soporte, ellos pueden revisar más a fondo.\n\nSinceramente, no me parece justa.","replies":[{"poster":"Huelmerin","date":"2018-04-29T01:01:05.459+0000","up_votes":2,"down_votes":0,"body":"gracias! éso intentare","replies":[]}]},{"poster":"lordeman10","date":"2018-04-29T09:07:35.588+0000","up_votes":1,"down_votes":1,"body":"es un erroraso ponerse a hablar sobre el comportamiento de los demás, es colgarte un cartelito de reportenme por decir cosas que en realidad no importan, porque con reportarlos basta y sobra\n\nla verdad no tengo ganas de leer asique no opino sobre si es injusto o no, suerte en tal caso","replies":[]}]}