{"poster":"SLASH MUT3AII","date":"2015-02-11T22:26:44.202+0000","title":"Die GoFreaks suchen noch eifrige Mitspieler (ü18)","subforum":"Clans & Teams","embed":{"description":"Wir sind eine deutschsprachige Fun-Multigaming Community.","url":"http://gofreaks.eu/","image":null},"up_votes":1,"down_votes":1,"body":"Hallo zusammen,\r\n\r\nWir sind die GoFreaks eine mittlerweile doch sehr große Community in der alle möglichen Spiele gespielt werden, unteranderem eben auch LoL.\r\nStändig sind wir auf der suche nach neuen Mitspielern im LoL Bereich was mich nun auch dazu gebracht hat diesen Post zu schreiben.\r\n\r\nIm Bereich LoL wird bei uns eigentlich alles gespielt, seinen es Normals, 3v3/5v5 Rankeds oder mal aus Spaß an der Freude ein Aram. Das einzige was bei uns vielleicht ein bisschen kurz kommt ist Dominion.\r\nWenn wir lustig sind und genug Leute da sind kommt auch mal gut und gerne ein Custom game zu standen wo kräftig getrollt werden kann oder man sich mit den anderen Communitymitgliedern messen kann.\r\n**Eure Elo spielt hierbei keine Rolle!!!!!!!!!!!!!!!!**\r\nOb lvl 20, Bronze 5 oder Challenger, bei uns sind alle gerne gesehen.\r\nDie einzige vorraussetzung die wir an euch stellen ist das ihr über 18 Jahre alt seid, dies ist einfach dadurch begründet das die Community mittlerweile so groß ist das es sich mit ruhigen und reifen gemütern einfach besser und angenehmer zocken lässt.\r\nWer auch gerne mal bis tief in die Nacht zockt findet bei uns auch immer gewillte Mitspieler.\r\n\r\nNatührlich haben wir auch einen Teamspeak Server auf dem wir miteinander kommunizieren. Dieser ist groß genug damit auch ja immer alle drauf passen (250 Slots). \r\n\r\nAuch eine Homepage haben wir auf der ihr euch Bewerben könnt, ihr findet sie unter dieser URL: **http://gofreaks.eu**\r\n(Beachtet bitte das die Bewerbung zumindest einigermaßen euer \"ich\" wiederspiegelt, Bewerbungen wie:\r\n*\"Hi ich bin der Kevin, 20 Jahre alt, Spiele LoL und würde gerne zu euch in den Clan\"*\r\nwerden von uns nicht Aktzeptiert.\r\n\r\nSollte euch dieser Forenbeitrag noch nicht überzeugt haben dürft ihr uns aber auch gerne auf dem TS besuchen. Die ip hierfür ist: **ts3.gofreaks.eu**\r\n\r\nAlso Freunde, wir sehen uns in der Kluft :)\r\n\r\nMit freundlichen Grüßen\r\n\r\nMatze aKa Nudelholz {{summoner:3}}","replies":[{"poster":"SLASH MUT3AII","date":"2015-10-20T16:50:31.710+0000","up_votes":1,"down_votes":0,"body":"PUSH","replies":[]},{"poster":"SLASH MUT3AII","date":"2015-02-14T13:42:11.453+0000","up_votes":1,"down_votes":0,"body":"PUSH","replies":[]},{"poster":"SLASH MUT3AII","date":"2015-02-12T22:40:40.139+0000","up_votes":1,"down_votes":0,"body":"Push it baby","replies":[]},{"poster":"SLASH MUT3AII","date":"2015-02-12T19:06:59.963+0000","up_votes":1,"down_votes":0,"body":"Push it to the limit","replies":[]},{"poster":"SLASH MUT3AII","date":"2015-02-12T16:43:17.720+0000","up_votes":1,"down_votes":0,"body":"PUSH IT","replies":[]},{"poster":"SLASH MUT3AII","date":"2015-02-12T11:52:35.522+0000","up_votes":1,"down_votes":0,"body":"Könnten übrigens noch einen Top Laner für eins unserer Ranked Teams gebrauchen ;)","replies":[]}]}