{"poster":"lo0DeathRow0ol","date":"2017-11-06T23:55:37.621+0000","title":"CLASSIFICATE ? Impossibile avanzare","subforum":"Discussioni generali","up_votes":2,"down_votes":7,"body":"Salve e benvenuti in questa discussione.\r\nVorrei mettere in chiaro un paio di punti che da un paio di anni a questa parte influenzano il mio game all&#039;interno di League of Legends.\r\nEssendo un giocatore che ama la competizione, dal momento in cui ho creato un account e scaricato il gioco, ho scalato i livelli per arrivare allo stimatissimo LV.30 per iniziare a rankare, farmi valere e potermi piazzare in una divisione adatta al mio livello di gioco.\r\nSono in divisione Bronzo V ormai da 1 anno poiche ogni volta che sono in promo o avvio una classificata non ho mai il piacere di giocare una partita doveci sono compagni di squadra e avversari a pari livello.\r\nIo cerco di migliorarmi,cerco di informarmi sui vari campioni, provarli prima in addestramento, non andare in rank con un campione che non ho mai utilizzato o se non so bene quale sia il mio ruolo all&#039;interno della mia lane.\r\nOgni volta, OGNI SANTA VOLTA che avvio una classificata, all interno del mio team c&#039;&egrave;:\r\nIL FEEDER, Il francese che spamma solamente &quot;STUFU&quot; e fail cazo che gli pare, il support che gira per la mappa cercando in qualche modo di giocare a nascondino con gli avversari, L&#039;ADC che non sanno che non c&#039;&egrave; bisogno di attacare da vicinissimo, Il JUNGLER che pensa soltanto a farmare dimenticandosi di gankare, il top che gironzola in altre lane regalando non solo 10 kill al suo avversario in lane ma &egrave; cosi generoso da donarle a tutta la squadra avversaria e poi, c&#039;&egrave; l&#039;immancabile giocatore che fa di tutto per aiutare, a tal punto da aspetare quei 100 gold che gli mancavano per comprare un oggetto che neanche gli serve :){{item:3683}} \r\n\r\n1. Sinceramente, sono stufo di questi player che continuano a distruggere questo gioco.\r\n2. Sono stufo di quei giocatori domenicali che prendono le rank alla leggera\r\n3. Sono stufo di entrare in partite dove c&#039;&egrave; gente che fa di tutto tranne che giocare gecentemente.\r\n4. Sono stufo di non poter uscire da una divisione senza l&#039;aiuto di amici nel mio team per rankare. (sono tutti gold, non possono aiutarmi, sono partiti bronzetti e hanno scalato la classifica tutti appassionatamente)\r\n\r\nChiedo soltanto pi&ugrave; attenzione alle segnalazioni, pi&ugrave; attenzione al comportamento dei giocatori e una stabilit&agrave; nelle classificate dove ogni livello del giocatore singolo viene inserito in partite con altri livelli uguali e simili.\r\n\r\nGrazie mille per aver letto questa discussione.\r\nGGWP!\r\n\r\n**DeathRow**","replies":[{"poster":"Dr LouD","date":"2017-11-07T12:16:38.208+0000","up_votes":6,"down_votes":1,"body":"È più difficile rimanere bloccati in bronze V rispetto a fare il Diamond\n\nChapeau","replies":[]},{"poster":"Linkimaru","date":"2017-11-07T07:00:51.330+0000","up_votes":5,"down_votes":1,"body":"Sei bronzo V da un anno vuol dire che te lo meriti","replies":[{"poster":"TheConte","date":"2017-11-07T12:21:00.219+0000","up_votes":2,"down_votes":1,"body":"dovresti giocare con lui prima di giudicarlo ...","replies":[{"poster":"HaIIeIujah","date":"2017-11-07T12:27:09.200+0000","up_votes":1,"down_votes":1,"body":"Ma anche no.\n\nBronze V è la peggior divisione del gioco. Uscire da Bronze V è semplicemente una questione di saper giocare le basi e di non flammare/deprimersi ogni singola partita.\n\nSe avesse iniziato da due settimane, forse. Ma un anno? Un anno in Bronze V? L'unica spiegazione è un'assoluta mancanza di basi. In nessun altro modo puoi rimanere bloccato lì. \n\nOvviamente il fatto che venga a lamentarsi sul forum non aiuta.","replies":[{"poster":"TheConte","date":"2017-11-07T12:59:17.218+0000","up_votes":2,"down_votes":4,"body":"si invece <.<\n \nio sono stato b5 per 2 anni e poi b2-1 per altri 2 ora son silver 4 quasi 3 e l'unica cosa che ho migliorato?\nricordarmi di mettere la ward anche in late game xd...\npoi quando qualcuno si lamenta sul forum lo fa solo per cercare spiegazioni o consigli per risollevarsi il morale, non altri tizi che dicono \"b5? ben ti stà!\" o altre risposte bastarde Xdd","replies":[{"poster":"HaIIeIujah","date":"2017-11-07T13:01:49.218+0000","up_votes":2,"down_votes":1,"body":"Quindi ti sei meritato di stare B5 per due anni e poi hai imparato giocare.\n\nIo ho iniziato in bronzo ed adesso sono diamond V. Pensi davvero che mentre stavo a prendere botte in Bronze IV giocassi \"bene\" e mi meritassi Diamond solo perché ci sono arrivato anni dopo? No, la risposta è no.\n\nE secondo te scrivere questo:\n\n> Ogni volta, OGNI SANTA VOLTA che avvio una classificata, all interno del mio team c'è:\nIL FEEDER, Il francese che spamma solamente \"STUFU\" e fail cazo che gli pare, il support che gira per la mappa cercando in qualche modo di giocare a nascondino con gli avversari, L'ADC che non sanno che non c'è bisogno di attacare da vicinissimo, Il JUNGLER che pensa soltanto a farmare dimenticandosi di gankare, il top che gironzola in altre lane regalando non solo 10 kill al suo avversario in lane ma è cosi generoso da donarle a tutta la squadra avversaria e poi, c'è l'immancabile giocatore che fa di tutto per aiutare, a tal punto da aspetare quei 100 gold che gli mancavano per comprare un oggetto che neanche gli serve :)\n\nE' cercare spiegazioni? Sono le solite, ripetute ed inutili lamentele che ognuno di noi dice alla fine di ogni partite, con la differenza che anziché essere tenute in privato vengono spammate in un forum pubblico.","replies":[{"poster":"TheConte","date":"2017-11-07T13:15:23.053+0000","up_votes":2,"down_votes":2,"body":"ho no io non lo letto tutto xd ma mi danno fastidio le persone che vanno a scrivere te lo meriti ed altri commenti inutili per creare litigi...\npoi nel caso del migliorarsi  a questo punto e meglio non dire niente perché ci son persone  e persone con metodi di miglioramento differenti xd","replies":[]}]}]}]}]}]},{"poster":"SKFF1R SubZero","date":"2017-11-07T00:01:06.369+0000","up_votes":5,"down_votes":1,"body":"https://pbs.twimg.com/media/DHELcnGXsAMV-3S.jpg","replies":[]},{"poster":"ZZALA","date":"2017-11-07T06:17:21.322+0000","up_votes":3,"down_votes":0,"body":"Veramente guardando il tuo profilo io vedo build sbagliate e partite in cui ti hanno carryato ultimamente , bello l' heal + trinity su Illaoi","replies":[{"poster":"Trenitaliyah","date":"2017-11-07T09:36:38.663+0000","up_votes":1,"down_votes":1,"body":"Era Illaoi support \n\nPOGCHAMP","replies":[]}]},{"poster":"Skeltur","date":"2017-11-07T02:52:40.538+0000","up_votes":2,"down_votes":0,"body":"http://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/3407700259/209373324?tab=overview\nminuto 3:30 dai il first blood a singed, rovinando tutta la tua top\nminuto 8:15 dai una kill a kindred, a questo punto tu sei \n\nhttp://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/3406899712/209373324?tab=overview\nriassumendo: prendi la kill mid, dai la kill, prendi la kill, dai la kill, dai la kill, ecc...ahri riesce a snowballare, te no","replies":[]},{"poster":"Nabbomaster","date":"2017-11-07T02:03:03.192+0000","up_votes":3,"down_votes":1,"body":"e come si fa a distinguere il gameplay in bronzo 5 per fare dei team piu' equilibrati\nmanco si distingue al differenza tra un player e un bot a quell'elo","replies":[]},{"poster":"ReyZør","date":"2017-11-07T10:17:24.309+0000","up_votes":2,"down_votes":1,"body":"B5 da un anno ----> non hai idea di come si giochi (senza offesa).\nPensa a te stesso che hai molto su cui lavorare e non al tuo team.","replies":[]},{"poster":"wattbatt","date":"2017-11-07T11:39:36.683+0000","up_votes":1,"down_votes":0,"body":"Son stato bronzo 4 per 3 mesi, amareggiato ho smesso le ranked per 3 mesi poi ho ripreso e son salito fino a silver di botto; qualcosadi diverso nel comportamento c'è","replies":[]},{"poster":"Aurelion Shmoll","date":"2017-11-07T11:36:11.321+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-lulu}}","replies":[]},{"poster":"Sorcio84","date":"2017-11-06T23:59:40.421+0000","up_votes":1,"down_votes":0,"body":"Il mio problema invece è diverso.\nHo fatto b5 b3 proprio easy, e al B2 ci sono arrivato 3 volte in 16 promo, poi sceso, risalito e ridisceso. È impressionante la quantità di smurf ed eloboosters a fine season, oltre a gente che non gioca senza ward. Dopo 19 promo per b2 uno si sente un pò preso in giro, perchè per quanto possa fare dei piccoli miglioramenti, rimane sempre piantato la.","replies":[{"poster":"Italian No Hands","date":"2017-11-07T08:53:28.707+0000","up_votes":1,"down_votes":0,"body":"Questo già ha più senso, purtroppo a fine season a low elo silver bronzo è veramente difficile giocare perchè molte persone si ricordano di voler portare un secondo account a gold, ma questa è una scusa che regge solo le ultime 3 settimane della season, hai altri 10 mesi per giocare normalmente non mi sembra un gran problema, ma comunque seriamente per uscire dal bronzo e silver è facilissimo non morire e farmare, arrivi a 20 min che sei 3 lvl sopra e 3k gold in più, solo con queste 2 cose poi è tutti in discesa ti metti su una side e pushi fino al nexus","replies":[]}]},{"poster":"Saibbo","date":"2017-11-07T10:04:38.200+0000","up_votes":1,"down_votes":1,"body":"Se sei bronzo 5 non mi lamenterei troppo della gente che rovina il gioco... o che non prende sul serio le ranked, il problema e' un'altro.","replies":[]}]}