{"poster":"MYM Kreigon","date":"2015-06-16T13:20:45.842+0000","title":"Ist diese seite ein fake? Ich denke schon","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":3,"body":"Hi zusammen,\n mich hat letztens irgendwer aus meiner kontaktliste folgendes geschrieben. \n> i see your name in the Forum for flame And u risk A ban go check up and talk with them\n\n**Link entfernt**\n\ndaraufhin wird man auf ne seite gelenkt die &auml;hnlich aussieht wie die lol page und man soll sich dort mit email und email pw anmelden. Das kam mir sehr unseri&ouml;s vor. \nErstens war ich in nem anderen tab ,schon auf der offiziellen lolseite angemeldet.\nZweitens man kann diese login meldung auch nicht schlie&szlig;en.\nDrittens das Tribunal ist doch eh schon jahr zu.\n\nWas haltet ihr davon? (ich bin mir sicher , dass das ein fake ist aber evtl. hab ich schon nen virus weil ich dumm auf den link geklickt hab)\n\nmfg\n\nKreigon","replies":[{"poster":"MYM Kreigon","date":"2015-06-16T13:24:16.238+0000","up_votes":1,"down_votes":0,"body":"soll ich irgendwas gegen den typen machen der mich damit zugespammt hat, ich mein der hätte ja theoretisch meine email+ pw bekommen können","replies":[{"poster":"Sree","date":"2015-06-16T13:28:32.100+0000","up_votes":3,"down_votes":0,"body":"Er hat sicher selbst auf der Seite seine Logindaten eingegeben und dadurch wurde sein Account gestohlen. Und mit dem gestohlenem Account macht ein Bot dann weiter Werbung.\nDu kannst den Account dem [Support](https://support.riotgames.com/hc/de/requests/new) melden, aber mehr als den Account schliessen bis der richtige Besitzer sich meldet, koennen sie auch nicht machen, da der Account wie gesagt selbst nur ein gestohlener ist.","replies":[]},{"poster":"Alustus","date":"2015-06-16T13:27:41.046+0000","up_votes":2,"down_votes":0,"body":"Du kannst den Spieler beim Support melden.\n\nAber es ist durchaus möglich, dass er selber ein Opfer dieser Seite war.","replies":[{"poster":"MYM Kreigon","date":"2015-06-16T13:28:55.118+0000","up_votes":1,"down_votes":1,"body":"ich denke nicht ? wieso sollte der mir als opfer so was schicken ?","replies":[{"poster":"Alustus","date":"2015-06-16T13:33:22.661+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"MYM Kreigon","date":"2015-06-16T13:35:29.913+0000","up_votes":1,"down_votes":0,"body":"glaub ich nicht der type hat heute schon 5 games gemacht","replies":[{"poster":"Sahnepuffelchen","date":"2015-06-16T14:05:08.095+0000","up_votes":2,"down_votes":0,"body":"Ein Freund von mir ist sehr Naiv, und ist auf eine dieser \"Free Riotpoints\" Seiten gelandet - Account gehackt. \nAllerdings sah es von ihm so aus, als wenn alles in Ordnung wäre, dem war aber nicht so, denn kaum einen Tag später bekam ich ebenfalls Spam Nachrichten von seinem Account aus. \nEs ist durchaus möglich, dass deinem Freund das gleiche passiert / ist.\n\nMfG Sahnepuffelchen","replies":[{"poster":"hshtagniemehrcdu","date":"2015-06-16T19:59:19.908+0000","up_votes":2,"down_votes":0,"body":"Wenn du mir dass Passwort für deinen Account gibst (bekommst nen Keks!), und ich dir den Account dann wegnehme, dann hat das mit \"Hacken\" recht wenig zu tun.\n\"Phishing\" wäre der richtige Ausdruck.","replies":[]}]}]}]}]}]}]},{"poster":"Sree","date":"2015-06-16T13:24:10.418+0000","up_votes":3,"down_votes":0,"body":"Die Homepage von LoL endet immer auf leagueoflegends.com\nDie meisten Browser markieren diesen Teil der Homepage auch und heben ihn hervor. Schau dir das mal oben in der Zeile an, dann wirst du es sehen.\nImmer wenn eine Homepage anders heisst, solltest du auf keinen Fall deine Logindaten dort eingeben.\nIn deinem Beispiel steht zwischen leagueoflegends und com nocht etwas, daher ist die Seite eine Faelschung. Ich entferne den Link mal, damit niemand ausversehen drauf klickt.","replies":[]},{"poster":"Kaitri","date":"2015-06-17T07:35:25.496+0000","up_votes":1,"down_votes":0,"body":"man leute ernsthaft?\n\"i see your name in the forum for flame\" anprangern ist verboten, also höchst unwahrscheinlich das irgendjemand im forum gelesen hat \"hey kreigon voll der flamer bannt den %%%%%en mal!\"\nund dann diese links...","replies":[]},{"poster":"Batrix2","date":"2015-06-16T13:29:18.806+0000","up_votes":1,"down_votes":0,"body":"ein guter und leichter trick beim anmelden gib einfach nur scheisse ein zum beisspiel dfnsdvxcjsdfhbg pw: fsduhvgsuzdcgb","replies":[]},{"poster":"Temudschinn","date":"2015-06-16T13:22:42.057+0000","up_votes":1,"down_votes":0,"body":"league**OT**legendes...sicherlich fake","replies":[]}]}