{"poster":"Veloshotz","date":"2017-02-22T08:30:07.147+0000","title":"INFINITE CRISES TO BE RESERECTED","subforum":"Miscellaneous","embed":{"description":"This game is the best Moba and it needs to take off it is a DC comics Moba named Infinite Crisis by signing this you will show your support to get Turbine to keep going or for Warner Bros to change it to some else to pick it up","url":"https://www.change.org/p/warner-brothers-get-the-game-back-up-for-good","image":"http://assets.change.org/photos/8/wy/dw/xlwydWbzpsKuARh-1600x900-noPad.jpg?1433258086"},"up_votes":3,"down_votes":0,"body":"Hey guys the reason i got into lol was because of this game, this is an amazing game and if any of u are hardcore dc fans or are into dc please \r\nsupport this game by sighing the petition.\r\n\r\n\r\nThis game was in my opinion the best game i have ever played and i think has the potential to beat hots or heroes of newerth\r\nin my opinion pls check it out its an awsome game and i would love to see this game back up.\r\n\r\npls support us.","replies":[{"poster":"Veloshotz","date":"2017-02-22T10:48:12.460+0000","up_votes":1,"down_votes":0,"body":"Thank u so much guys for signing the petition your help is much appreciated","replies":[]},{"poster":"SEKAI","date":"2017-02-22T09:04:54.710+0000","up_votes":1,"down_votes":0,"body":"I think I read it somewhere that starting petition is not legal in terms of our forum rules. So this thread might be taken down because of it.\n\nBut whatever, I signed the thing.","replies":[]},{"poster":"Project Xayah","date":"2017-02-22T09:01:14.933+0000","up_votes":1,"down_votes":0,"body":"I remember IC. It was a pretty good game, and something I *really* wanted to get into. The only issue I had with it was some kind of input lag. Every time I played (and regardless of what I tried to fix the issue) it would be like playing on 500-1000 ping (for my character only). Went back to try it again last year to find out it was discontinued, was so sad about that.\n\nDefinitely worth trying to get it back, in my opinion (especially with all the new DC movies/series coming out).","replies":[]},{"poster":"Veloshotz","date":"2017-02-22T08:31:50.930+0000","up_votes":1,"down_votes":0,"body":"we only need 508 people to sigh it so pls tell your friends riot workers and parents to sign it this is for a good cause","replies":[]}]}