{"poster":"RandomGamesITA","date":"2016-11-06T21:16:54.701+0000","title":"Cosa ne pensate su \" Orianna \"","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Salve ragazzi ultimamente sono molto attirato da orianna, vedo in alcuni game che i sui danni sono molto notevoli. Sono anche consapevole che &egrave; un champ abbastanza difficile da usare ma infondo ogni personaggio ha la sua meccanica e una volta averla capita il personaggio se per se diventa facile.. per&ograve; volevo sapere la vostra se orianna sarebbe un ottimo acquisto!","replies":[{"poster":"Ziovi","date":"2016-11-07T06:59:17.684+0000","up_votes":2,"down_votes":0,"body":"è un ottimo acquisto. Come hai detto, anche se ha delle meccaniche un po' particolari basta giocarci per un po' e poi ci prendi la mano. \nQuando impari ad usarla bene può davvero dare un contributo fondamentale alla sua squadra. In più è in grado di fare grandiose combo con altri campioni che possono vincere un teamfight da sole.\nAlcuni giocatori, le prime volte che provano orianna, sono tentati di maxare la W per prima per via dei danni maggiori, ma personalmente te lo sconsiglio: la cosa più importante è poter continuare a riposizionare la palla, quindi la Q è l'abilità che vuoi migliorare per prima. Questo ti consente anche di risparmiare mana, che specialmente in early è piuttosto importante perché ori tende a consumarne parecchio.\nIl farm è piuttosto facile, e la presenza della palla, quando correttamente posizionata, è una minaccia costante per il tuo avversario che dovrà stare attento ad ogni sua mossa per non essere colpito troppo facilmente. Se non sei costretto alla difensiva, la posizione ideale in cui metterla è fra te ed il tuo avversario, nella zona dove dovrebbe andare per colpire i minion: in questo modo è facile per te attaccare. La palla infatti non si muove molto velocemente quando la sposti con la Q, e non è facile andare a segno se deve fare molta strada per colpire l'avversario.\nSe per qualche motivo, ad esempio quando stai inseguendo un nemico in fuga, la palla si trovasse dietro di te, invece che usare la Q da quella posizione da cui difficilmente potrai colpire,  può convenirti continuare a correre fino a superare il limite massimo della distanza: a quel punto la palla si teletrasporta istantaneamente da te, rendendo il tuo attacco molto più veloce.\nIn alternativa, se correre oltre il limite non è possibile, puoi sempre utilizzare la E per portare la palla fino a te e poi attaccare: con il comando di protezione infatti la palla si muove molto più velocemente.\nOvviamente se c'è un alleato in posizione più favorevole puoi sempre utilizzare la E su di lui.","replies":[]},{"poster":"8 Herpes Simplex","date":"2016-11-08T17:09:02.937+0000","up_votes":1,"down_votes":0,"body":"Se vuoi imparare ad usarla ti consiglio questo sito (http://www.lolcoachingitalia.it/ ).\n\nCi sono coach dal platino 5 al MASTER1 che insegnano GRATIS!!! Lo fanno solo per pura passione.\nNessuna registrazione obbligatoria, per avere un coaching basta che guardi la lista dei coach e ne aggiungi uno in gioco e se ha tempo ti aiuterà :)","replies":[]},{"poster":"LightIsMyPath","date":"2016-11-07T12:23:06.876+0000","up_votes":1,"down_votes":0,"body":"Credo che sia un ottimo acquisto. Io faccio ancora cagare con lei ma è veramente divertente oltre che molto forte e per il momento non ho ancora trovato nessun match-up TROPPO brutto.. Anche quando ho seri problemi in lane se riesco comunque a non feeddare finirò per outscalare il tizio di turno quando arriviamo a teamfightare.","replies":[]},{"poster":"vondarck","date":"2016-11-07T08:25:29.438+0000","up_votes":1,"down_votes":0,"body":"a me piace molto averla in team, da main junger/top con champion da hard engage sono anche incentivato a gankare mid per portarla in vantaggio, se non trayarda a schifo lei e non pusha come una matta se vince la linea (anche se non è uberfeddata) la partita prende una buona piega\n\n{{champion:120}} {{champion:62}} {{champion:77}}","replies":[]},{"poster":"SPX Levi","date":"2016-11-06T22:42:27.488+0000","up_votes":1,"down_votes":0,"body":"Veramente forte e secondo me abbastanza sottovalutata, ha un buon damage e se usata in combo con qualche champ da engage  può fare davvero la differenza","replies":[]},{"poster":"wildfox99","date":"2016-11-06T22:14:14.152+0000","up_votes":1,"down_votes":0,"body":"attualmente è molto forte,è un ottimo mid laner","replies":[]},{"poster":"Kim114","date":"2016-11-06T22:25:53.234+0000","up_votes":3,"down_votes":3,"body":"Falla full ap, solo midlaner e non usarla support anche se te lo dicono\nLa combo è easy Q per danneggiare, W per il damage\nOppure E su di te + W per lo speed\nSe hai un tankone tipo {{champion:150}} {{champion:64}} che si buttano in fight, falli buttare con La Palla e usa R","replies":[]}]}