{"poster":"Sariin","date":"2015-07-30T19:47:17.959+0000","title":"Cercasi ragazza main top per team ranked","subforum":"Reclutamento","up_votes":4,"down_votes":3,"body":"Salve.\r\nTeam femminile cerca una ragazza main top disponibile per allenamenti serali (Abbiamo 3 coach che ci seguono) e che possa utilizzare team speak.\r\nSiamo tutte elo silver in su\r\nGrazie","replies":[{"poster":"Sariin","date":"2015-07-31T13:22:00.777+0000","up_votes":0,"down_votes":6,"body":"Questo dimostra la maturità e la serietà dei player italiani. Per chi ha risposto seriamente, grazie. \nPer chi ha solo voglia di prendere in giro, bhe..fate schifo. E poi vi chiedete perchè facciamo team solo femminili, basta leggere quello che scrivete ^^","replies":[{"poster":"UnknownEV","date":"2015-07-31T14:43:11.574+0000","up_votes":5,"down_votes":0,"body":"Se mi fai i complimenti sei figo :D\n\nSe mi critichi sei sfigato :D\n\nLOL. {{champion:36}}","replies":[{"poster":"Sariin","date":"2015-07-31T15:03:03.772+0000","up_votes":1,"down_votes":4,"body":"Quello non è criticare, è rompere le cosiddette. Io sto cercando una player, non ho scritto che voglio discutere su \"maschi e femmine come player\". Impara a vedere la differenza","replies":[]}]}]},{"poster":"Giovarco","date":"2015-07-31T12:04:41.186+0000","up_votes":3,"down_votes":0,"body":"Buona fortuna :)","replies":[]},{"poster":"JRobich","date":"2015-07-31T08:07:18.172+0000","up_votes":3,"down_votes":0,"body":"in bocca a lupo per il Vostro progetto ma se vi posso dare un consiglio scegliete 1 coach dei 3 a Roma si dice \"Quanno sò troppi galli a cantà nun se fa mai giorno...\" :)","replies":[]},{"poster":"Madaf4ka","date":"2015-07-31T06:56:56.559+0000","up_votes":3,"down_votes":0,"body":"Dai è una cosa buona, vi auguro di trovarla e buona fortuna! ;)","replies":[]},{"poster":"NiraBlade","date":"2015-07-31T08:52:08.761+0000","up_votes":4,"down_votes":1,"body":"e questa è la mia solita fortuna: trovo finalmente un team femminile e sono main mid :V in bocca al lupo ragazze","replies":[]},{"poster":"kirchhoff","date":"2015-07-30T22:25:18.617+0000","up_votes":2,"down_votes":2,"body":"Team Siren 2?\n\nhttps://www.youtube.com/watch?v=_Gz9um3wV1o\n\nahahah\n\nPoi le ragazze di solito non giocano top o giungla ...","replies":[{"poster":"FreeGonzo","date":"2015-07-31T00:08:11.234+0000","up_votes":2,"down_votes":4,"body":"Che ficata ragazze! \nSe diventate brave...bè, fatico ad immaginare l'impatto culturale che avrebbe una cosa del genere sul mondo dei videogiochi ed oltre. Se voi e i vostri coach vincete la sfida (ed è quello che mi auguro)  seppur di riflesso, sarò più sexy anch'io :D","replies":[{"poster":"Sariin","date":"2015-07-31T13:26:42.267+0000","up_votes":1,"down_votes":5,"body":"Siete simpatici come dita nel naso, seriamente. Se non avete niente di sensato da dire, tornatevene a farvi i cavoli vostri grazie.\nCome voi fate team solo maschili perchè \"le donne stanno bene solo in cucina\", noi facciamo team solo femminili \"perchè gli uomini sono maschilisti del cavolo e non accettano che molte ragazze sappiano giocare meglio di loro ^^\".","replies":[{"poster":"Menfrix","date":"2015-07-31T16:03:52.515+0000","up_votes":3,"down_votes":0,"body":"Scusa, ma stai facendo ti tutta l'erba un fascio.\n Ti assicuro che conosco ragazze che flammano quanto gli \"uomini\" e si, mi sento tirato in causa quando dai a tutti i ragazzi indistintamente dei maschilisti,  visto che IRL sono sceso numerose volte in piazza per manifestare la volontà di ugualianza di genere.\nÈ vero che ancora oggi (tristemente) ci siano discriminazioni verso il sesso femminile, ma ti ripeto, attenzione a non fare di tutta l'erba un fascio.\n\nHo giocato con è contro ragazze (da glod a diamond) e personalmente non ho alcun problema ad ammetterlo se sono più brave, ritengo che sia la cosa più bella dei giochi digitali o comunque non fisici l'abbattimento della distinzione tra i sessi.\n\nSpero sinceramente che possiate raggiungere gli obbiettivi che vi siete prefissate ma spero altresì che le motivazioni che vi portano a creare un team full Girls siano altre perchè queste scritte sono una gran stronzata.\n\nPotere alle PUSSY RIOT!!! ^^","replies":[{"poster":"Sariin","date":"2015-07-31T22:31:58.528+0000","up_votes":1,"down_votes":0,"body":"Non faccio di tutta l'erba un fascio, però ho scritto in vari gruppi e le risposte sono sempre state le stesse.\nPerchè se noi ragazze facciamo un team femminile rompete le scatole con commenti poco opportuni però la maggiorparte dei team non accetta ragazze? Io ho cercato un team per 1 anno e passa, ma non ne ho mai trovato uno serio. Tutte risposte tipo \"torna in cucina\" etc.\nIo voglio giocare e voglio migliorare, se per farlo devo stare in un team femminile va benissimo. Mi trovo bene con loro e voglio continuare, fine. Era nato come team femminile di una multigaming e anche se ci siamo distaccate vogliamo mantenere la cosa perchè stiamo bene così. Basta come motivazione?","replies":[{"poster":"Menfrix","date":"2015-07-31T23:11:40.891+0000","up_votes":1,"down_votes":0,"body":"\"...rompete... \" è una generalizzazione, ovviamente sei liberissima di fare quello che vuoi (ci mancherebbe altro) e non hai bisogno di motivare le tue scelte, la mia era solamente un appunto ad una tua frase sessista:  \"perchè gli uomini sono maschilisti del cavolo e non accettano che molte ragazze sappiano giocare meglio di loro ^^\" (ok, ci sta che l'esasperazione porti a delle affermazioni, spero, non troppo sentite) al pari di \"torna in cucina\".\n\nPersonalmente non credo di averti mancato di rispetto e più di augurarvi di riuscire nei vostri intenti non so che fare.\n\nMi dispiace se lo hai preso come un attacco personale (visto che usando il plurale mi hai tirato in mezzo), non era questo l'intento del mio intervento, ti posso dire sinceramente che odio quanto te i comportamenti sessisti ma non solo, odio anche i comportamenti omofobi e razzisti. Fomentare la separazione tra i sessi non aiuta a superare il pensiero retrogrado di alcune persone.\n\nPoco tempo fa ho giocato una custom contro un team femminile e l'adc diamond mi ha malmenato male, ma a fine game ci siamo fatti due risate sopra senza alcun problema...\n\nP.S.: se avete bisogno di carne da macello per gli allenamenti non esitare a chiamarmi :D\n\nP.P.S.: tra le altre ti ho anche upvotato il tread.\n\nEnjoy your games :)","replies":[{"poster":"Sariin","date":"2015-08-01T00:07:38.281+0000","up_votes":1,"down_votes":0,"body":"(Avevo scritto un papiro ma l'ha cancellato magicamente, portebbero spuntare millantamila post simili)\nMi dispiace ma devo generalizzare perchè sono davvero pochi quelli che sono aperti a tutto. Però, come ho detto, io ho fatto questo post in molti gruppi su fb e le risposte sono state tutte di quel genere là. Questo ovviamente fa arrabbiare quando uno cerca di fare qualcosa di serio. Perchè quando cercano membri per team solo maschili nessuno si scandalizza? Perchè va bene e invece noi ragazze dobbiamo essere sempre prese di mira?\nIo sto anche cercando un team o comunque compagnia per giocare al pomeriggio visto che con le ragazze gioco solo la sera, ma nessuno risponde. Perchè tutti gli altri che chiedono la stessa identica cosa ricevono millemila richieste?\nComunque mi dispiace se ti sei sentito tirato in mezzo, non avevo certo intenzione di prendermela con uno dei pochi che ha commentato usando il cervello\n\nps. Grazie della disponibilità!","replies":[{"poster":"NiraBlade","date":"2015-08-01T16:19:59.386+0000","up_votes":1,"down_votes":0,"body":"da una parte ti do ragione, si trovano sempre i commentini buttati lì negli streaming quando ci sono ragazze che giocano, anche sul forum uguale (fb stendiamo un velo pietoso) :V è una cosa fastidiosa, non credo che un uomo possa capire pienamente quanto sia degradante e umiliante sentirsi ripetere sempre le solite cose, retaggi di un'ignoranza contro la quale si è completamente impotenti. Non perché in quanto uomo, ma semplicemente perché non ha passato tutta la vita a sentirsi dire certe cose. Che poi ci possa essere empatia verso queste problematiche ci sta.\nBtw se cerchi compagnia per giocare fuori dal team addami, qualche partita ce la possiamo fare :V \nps: finiamola con questo team siren plz :V non erano bravi players perché non c'erano brave persone dietro, quanti team finiscono così e non ne sentiamo parlare, solo perché sono full uomini? Senza contare i commenti su yt dove gli adoni di turno le prendono in giro perché brutte ._. spiegatemi che centra questo per videogiocare. \n\n> Poi le ragazze di solito non giocano top o giungla ...\n\n kirchhoff nerfati plz >.>","replies":[{"poster":"Vileblood Pyke","date":"2015-08-03T12:22:51.599+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=NiraBlade,realm=EUW,application-id=n1bhmWE7,discussion-id=8kqmGLNE,comment-id=00000000000000000000000000000000,timestamp=2015-08-01T16:19:59.386+0000)\n>\n> ps: finiamola con questo team siren plz :V non erano bravi players perché non c'erano brave persone dietro, quanti team finiscono così e non ne sentiamo parlare, solo perché sono full uomini?\n\n\nNah, è divertente: hanno presentato il team in una maniera esagerata e hanno fato poco e nulla.\n\nComunque io sono per la parità dei generi, infatti ricordo gli Inferno nostrani che oltre le Challenger Series non sono andati, i C9 che erano full NA e sono andati in crisi, I GIANTS, team full spagnolo che era partito abbastanza bene, adesso si trova in mezzo alla classifica EU e boh, non si sa cosa facciano della loro vita.\n\nSe volessimo prendere giocatori singoli, di Doublelift se ne potrebbe parlare per giorni, con tanti video divertenti...","replies":[]},{"poster":"Menfrix","date":"2015-08-01T18:19:59.075+0000","up_votes":1,"down_votes":0,"body":"Guarda, secondo me il problema è che i bambini (anagraficamente parlando ma anche ti cervello) si sentono feriti nell'orgoglio a confrontarsi con ragazze, magari più brave di loro jn un gioco.\nSe avrete l'occasione di confrontarvi con persone più mature vi renderete conto che questi problemi sono relegati esclusivamente all'ignoranza dell'altra categoria di individui (feccia).\nI bambini fanno gruppo in questi casi per sentirsi forti, cercano un senso di appartenenza probabilmente per colmare un vuoto che li pervade.\nCome dice una canzone \"...sempre in sintonia col 0.5%...\" mappe della libertà assalti frontali :)","replies":[{"poster":"Sariin","date":"2015-08-01T21:27:49.305+0000","up_votes":1,"down_votes":0,"body":"Un altro problema è che ci sono veramente tante, troppe ragazze che sfruttano \"il potere delle donne\" (Sapete di cosa sto parlando suvvia) per farsi soldi o farsi boostare in game quindi si generalizza considerando tutte così. Incapaci \"moneygrabber\".\nAah che nervi <.<","replies":[{"poster":"Lord Valotz","date":"2015-08-01T23:01:53.406+0000","up_votes":1,"down_votes":0,"body":"Per essere idioti non è che conti più di tanto il sesso, come ci sono quelli che fanno commenti poco piacevoli, ci sono anche quelle che se la tirano per guadagnarci come dici tu, entrambi comportamenti poco \"onorevoli\" se così si può definire il tutto. Il mondo è vario, non si può fare di tutta l'erba un fascio.","replies":[]},{"poster":"NiraBlade","date":"2015-08-01T21:50:21.646+0000","up_votes":1,"down_votes":0,"body":"come sempre dove ci sono i polli ci sono le volpi pronte a sbranarli >.>","replies":[]}]}]}]}]}]}]}]}]},{"poster":"kirchhoff","date":"2015-07-31T19:14:40.444+0000","up_votes":1,"down_votes":1,"body":"Perchè hai risposto a me?","replies":[]}]},{"poster":"Vileblood Pyke","date":"2015-07-31T10:55:51.006+0000","up_votes":3,"down_votes":1,"body":"http://i.imgur.com/gwy3iC0.png","replies":[]}]},{"poster":"LightIsMyPath","date":"2015-07-31T14:41:29.757+0000","up_votes":2,"down_votes":0,"body":"uuffa..in ogni gruppo che trovo son quasi sempre l'unica ragazza, trovo un gruppo di ragazze..e hanno libera l'unica posizione che proprio non so fare x niente :( In bocca al lupo a tutte, e tanta invidia per la vostra mid-laner XD\n\nps: vi prego, asfaltate i gruppi maschili :D","replies":[{"poster":"Sariin","date":"2015-07-31T15:04:40.839+0000","up_votes":2,"down_votes":1,"body":"Anche io sono stata l'unica ragazza di un gruppo per anni. Ho trovato questo team a caso D: Con un po' di fortuna troverai anche tu un team femminile. Fidati, ci si trova bene.. tra ragazze ci si capisce e soprattutto non c'è flame.\nPs. la midlaner sono io xD","replies":[]}]},{"poster":"UnknownEV","date":"2015-07-31T14:44:44.884+0000","up_votes":3,"down_votes":1,"body":"Sempre con queste diversità... \nNoi siamo un team sia con femmine che con maschi...dov è il problema...\nqua tutti che pensano di essere un gradino sopra gli altri. \nPFF che pena","replies":[{"poster":"Sariin","date":"2015-07-31T15:07:48.037+0000","up_votes":1,"down_votes":0,"body":"Noi vogliamo giocare tra femmine perchè ci si intende meglio e non si flamma. Avete qualche problema? Risolvetevelo da soli. Ognuno è libero di scegliere.","replies":[]}]},{"poster":"renee1","date":"2015-07-31T06:53:37.673+0000","up_votes":3,"down_votes":2,"body":"ciao io sono una ragazza e gioco in top sopratutto con  teemo solo  che sono bronzo 1 va bene lostesso???\n;)\nfatemi sapere!!!","replies":[{"poster":"Sariin","date":"2015-08-01T00:09:20.232+0000","up_votes":1,"down_votes":0,"body":"Oddio, scusami per la risposta così tardi.  Mi era sfuggito il commento.\nComunque cerchiamo qualcuna che abbia una pool un pochetto più vasta e che sappia giocare i tank >.<","replies":[{"poster":"renee1","date":"2015-08-02T08:37:42.512+0000","up_votes":1,"down_votes":0,"body":"NP!!!!!!! GRAZIE CMQ!!! IN BOCCA A LUPO GIRLS!!!!!!!!!!!!!!!!!!!! ^^","replies":[]}]}]},{"poster":"Hi im Dragon v1","date":"2015-09-19T18:41:42.836+0000","up_votes":1,"down_votes":0,"body":"Hi im Dragon v1 se volete potete aggiungermi e provare","replies":[]},{"poster":"xxG1G4xx","date":"2015-07-31T14:45:22.501+0000","up_votes":2,"down_votes":2,"body":":)","replies":[]},{"poster":"Il Freddo","date":"2015-07-31T00:24:06.773+0000","up_votes":2,"down_votes":3,"body":"agli lcs hanno un coach e voi in silver ne avete 3","replies":[]}]}