{"poster":"Beet Roots","date":"2016-12-15T03:52:55.769+0000","title":"The legacy clients lifespan?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"hopefully one of the devs see this board but as a fan with a less than everage performance computer i have to ask, how much longer til the legacy client is gone, because the new client doesnt close in the background and takes more processes, which can hurt the overall experience playing the game and i was hoping the legacy client would always be an option","replies":[{"poster":"Targons Blade","date":"2016-12-15T05:31:47.245+0000","up_votes":1,"down_votes":0,"body":"First, I wanted to mentioned that I am **not** a developer that works on the New Client, but I can still answer your question. The Legacy Client will not always be an option. I'd imagine a lot of this has to do with the Legacy Client relying on Adobe Air, which is a platform that is pretty dated and lacks a lot features that the New Client's platform has. Our [**Beta Client FAQ**](https://support.riotgames.com/hc/en-us/articles/230175788#h1q6) states the following:\n\n> **Q: \"CAN I KEEP PLAYING ON THE LEGACY CLIENT INDEFINITELY?\"**\n\n>A: *\"No, sorry. By the end of open beta, the updated client will be a complete replacement for the legacy client (plus a few new features). It takes serious time and resources to support any large piece of software, so we'll focus exclusively on the updated client.\"*\n\nLet me know if you have any questions.","replies":[{"poster":"Beet Roots","date":"2016-12-16T05:52:01.035+0000","up_votes":1,"down_votes":0,"body":"i actually did have a question, 2, the first why replace the legacy client? it works just fine and 2 why soes the legacy client take up 4 different tasks? the legacy already takes 3 processes and on alot of computers like mine that already use 30-45% of processing power without league the new client taking up alot of the processing power can hurt the experience by alot be it fps or ping problems. i know there is little to be done aside from me getting a better computer but the real question is why replace a client that works?","replies":[]}]}]}