{"poster":"iZekkai","date":"2016-09-29T02:17:29.225+0000","title":"Can i apply PBE with lvl 21?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"hi guys as tittle says, lvl 21 is right for applying pbe? a friend told me about it and i was very intereset(the obvious reason haha), can you please give to me detailed information of letting people join it?","replies":[{"poster":"Targons Blade","date":"2016-09-29T18:29:56.568+0000","up_votes":1,"down_votes":0,"body":"You can definitely apply for PBE before level 30! We generally look for really active players who are a positive influence on the community. In some cases, we've wanted to test features on lower level summoners, so we've accepted some lower level players in the past. Check out our [PBE FAQ](https://support.riotgames.com/hc/en-us/articles/201751904-Public-Beta-Environment-FAQ#top) for complete details on the system.\n\nLet me know if you have any questions.","replies":[{"poster":"iZekkai","date":"2016-09-29T21:57:51.521+0000","up_votes":1,"down_votes":0,"body":"My mind is clear now, thanks for the answer Targons, but how many active i need to be? i only can play like 4 or 5 hours per day","replies":[{"poster":"Targons Blade","date":"2016-10-02T17:08:46.590+0000","up_votes":1,"down_votes":0,"body":"I don't know the exact measurement used to determine *active*, but that amount of playtime certainly sounds really active to me.\n\nLet me know if you have any other questions. Best of luck with your application.","replies":[{"poster":"iZekkai","date":"2016-10-03T01:48:46.202+0000","up_votes":1,"down_votes":0,"body":"Thanks for your help! \n\nAnother question, some time ago a friend told to me that Riot are accepting people every firsts days of the months, that's true?","replies":[{"poster":"Targons Blade","date":"2016-10-03T15:25:40.133+0000","up_votes":1,"down_votes":0,"body":"We used to only allow PBE signups during the first week of each month, but that was part of the old retired PBE system that we've since moved on from. Currently, you can sign up at any time and invites are sent out in batches when players qualify for access by meeting the test criteria at the time.\n\nI hope that cleared this up for you.","replies":[{"poster":"iZekkai","date":"2016-10-05T02:24:11.785+0000","up_votes":1,"down_votes":0,"body":"Totally, i'm very good with that and thanks for your help, i'll contare with you the next!","replies":[]}]}]}]}]}]},{"poster":"Mysticman89","date":"2016-09-29T02:55:26.340+0000","up_votes":1,"down_votes":2,"body":"You live account needs to be level 30 is one of the requirements for pbe applications.","replies":[]}]}