{"poster":"FarRockBF","date":"2015-04-22T12:53:46.809+0000","title":"How To Deal With a Toxic Teammate","subforum":"[ARCHIVED] Miscellaneous","up_votes":105,"down_votes":7,"body":"If someone was to ask you \"how would you deal with a toxic teammate you would answer either \"I mute them\", or \"I ignore them\". Fact is, most people do neither. The reason is because in the heat of the game it is very hard to think logically and people often react without thinking things through.\n\nThis issue is identical to one I faced when I was a camp counselor for second graders many years ago. There was a bully who would pick on the other kids and they always REACTED without thinking; they first tried to retaliate and then began crying. So I devised a system for them and it crushed the bully. It worked so well; I figured let's try it on League.\n\n**The Vegetable System**\n\nWhat to do: When someone rages, is toxic, or rude towards you simply reply with a vegetable. For example: \"WTF man, why did you call bot lane if you suck at ADC so bad??\" You respond: \"Avocado\" or \"Carrots\".\n\nWhat it does: \n\nA. Instead of feeling beat-down you feel smug \nB. Toxic person will very quickly learn that he is getting no where and will give up. \n\nRetaliation is necessary sometimes. It is very hard to focus and play well or even enjoy them game when your ego has taken a beating. This is the most passive form of retaliation; you aren't saying ANYTHING negative about the other player yet you feel good that you have said your piece. \n\nThis might seem very weird but I encourage you to try it. Next time you meet a toxic player in game try the **Vegetable System**.","replies":[{"poster":"Carrotz","date":"2015-04-22T17:17:24.422+0000","up_votes":57,"down_votes":0,"body":"But then I'll think your calling me all game and it might throw me off my game!","replies":[]},{"poster":"ResponsibleDad","date":"2015-04-22T13:10:54.063+0000","up_votes":19,"down_votes":0,"body":"As a responsible dad I can tell you that such systems do indeed work.","replies":[{"poster":"BeatzBoyFTW","date":"2015-04-22T13:48:28.059+0000","up_votes":26,"down_votes":1,"body":"Dad: Son, can you tell me how can you be this stupid to get a 30 out of 100 in English?\nSon: Banana\nDad: Son, dont play around with me....\nSon: Apple\n\nSeems like it's working alrite :3","replies":[{"poster":"Riot Hylia","date":"2015-04-22T17:33:14.819+0000","up_votes":7,"down_votes":1,"body":"imagine  doing this playing as Order of the Banana Soraka omg","replies":[]},{"poster":"Vistha Kai","date":"2015-04-27T01:20:16.930+0000","up_votes":4,"down_votes":0,"body":"I read it as \"Sona\"... then I saw \"Dad\". :|","replies":[]}]}]},{"poster":"9baksQuJhb","date":"2015-04-22T13:31:06.803+0000","up_votes":24,"down_votes":1,"body":"Why not fruit? {{champion:16}}","replies":[{"poster":"EvilMerodach","date":"2015-04-25T08:43:00.877+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=KimJongUlt,realm=NA,application-id=cIfEodbz,discussion-id=EOBKEEOY,comment-id=0002,timestamp=2015-04-22T13:31:06.803+0000)\n>\n> Why not fruit? {{champion:16}}\n\n..no one expects it. D=\n\nEdit: Also, because of Monty Python, most people know how to counter attack fruit bearing enemies. ;)\nhttps://www.youtube.com/watch?v=4bCyIAsSid8","replies":[{"poster":"Vi and Cupcait","date":"2015-04-26T14:46:30.795+0000","up_votes":2,"down_votes":0,"body":"But what if you don't have a gun, a 16 ton weight, a tiger, a crocodile, a pointed stick, or an escape route and your assailant has a pineapple?","replies":[{"poster":"Vistha Kai","date":"2015-04-27T01:29:18.330+0000","up_votes":1,"down_votes":0,"body":"You pull a lever and the assailant falls into a trap beneath the floor. {{champion:115}}","replies":[]}]},{"poster":"FarRockBF","date":"2015-04-26T02:18:26.444+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=EvilMerodach,realm=NA,application-id=cIfEodbz,discussion-id=EOBKEEOY,comment-id=00020000,timestamp=2015-04-25T08:43:00.877+0000)\n>\n> ..no one expects it. D=\n> \n> Edit: Also, because of Monty Python, most people know how to counter attack fruit bearing enemies. ;)\n> https://www.youtube.com/watch?v=4bCyIAsSid8\n\nLove me some Monte Python!","replies":[]}]}]},{"poster":"FarRockBF","date":"2015-04-22T16:13:14.430+0000","up_votes":10,"down_votes":1,"body":"God dammit GD you are so hard to read. I was certain I was going to be pounded with down-votes. {{summoner:31}}","replies":[{"poster":"Rasv","date":"2015-04-29T16:13:34.597+0000","up_votes":1,"down_votes":0,"body":"This is in Miscellaneous...","replies":[]}]},{"poster":"Sáx Man","date":"2015-04-22T17:20:04.728+0000","up_votes":8,"down_votes":0,"body":"To play devils advocate: I was a camp counselor for 7th graders for 2 years. In order for the ones that were misbehaving to understand what they were doing wrong, in most cases you could not simply say a random word that was off-topic to divert their attention or confuse them. Both years when i was there, there were a few kids that didn't want to follow the rules. Those people wanted attention, and acknowledging that they were disturbing people is what made them happy. What worked best to deal with these people was first to tell the other students to ignore the instigator, and if he/she persists, then a punishment is to follow. \n\nI believe it's similar in league. We're not dealing with second graders that have a much lower cognitive base, we're dealing people that, for the most part, are our age. Someone that is spamming chat and/or throwing death threats to other players is not going to stop once you respond because you're giving them acknowledgement, even if it doesn't pertain to what the person is saying.\n\nYou also make the argument about \"not thinking logically\" while in this sort of situation. If the person has already said enough to throw you off-game, then you've waited too long to utilize the mute button and chances are they won't think logically of another way to handle it. Muting a player is faster than typing a response, and doesn't draw you into the problem. \n\nThe best way to deal with people that are truly a problem is to mute them and play the game as you would otherwise. Then you can report them after the game. Don't waste time responding to someone, even if it's just one word. Most of these people are hoping to get some sort of reaction out of you, and no matter how you view it, they will think that they're getting to you.","replies":[{"poster":"r11na","date":"2015-04-23T00:24:23.427+0000","up_votes":8,"down_votes":0,"body":"> We're not dealing with second graders that have a much lower cognitive base\n\nAre you sure about that?","replies":[]}]},{"poster":"Linthe","date":"2015-04-22T17:24:34.765+0000","up_votes":1,"down_votes":0,"body":"Funny, I agree. Also sounds like a good way to get reported: failure to communicate.","replies":[{"poster":"Jubbinaut","date":"2015-04-22T17:26:21.369+0000","up_votes":7,"down_votes":0,"body":"Maybe, but it's not like that matters. Nobody has been banned or restricted for failure to communicate. It's effectively a trash report option.","replies":[{"poster":"Mikal Pikal","date":"2015-04-22T20:57:31.757+0000","up_votes":5,"down_votes":0,"body":"Especially when its failure to communicate with a toxic rager trash talking you. In fact, communicating back how you actually want to will get you banned.","replies":[]}]},{"poster":"FarRockBF","date":"2015-04-22T17:27:27.925+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Linthe,realm=NA,application-id=cIfEodbz,discussion-id=EOBKEEOY,comment-id=000c,timestamp=2015-04-22T17:24:34.765+0000)\n>\n> Funny, I agree. Also sounds like a good way to get reported: failure to communicate.\n\nNah, just a NEW way to communicate {{champion:36}}","replies":[]}]},{"poster":"BeatzBoyFTW","date":"2015-04-22T13:41:16.330+0000","up_votes":8,"down_votes":2,"body":"_When I dived into a 1v5 under turret as Garen and got one kill anyway despite being killed_\n\n{{champion:77}} : Omg, you stupid idiot, wtf you dived that for?\n{{champion:86}} : Cz Demacia","replies":[{"poster":"Slaven152","date":"2015-04-24T13:38:55.333+0000","up_votes":1,"down_votes":0,"body":"To be fair... You gave a kill, and 4 assists... =P While it's not a big enough deal to name call a player over you did give the other team more gold than you gained unless you somehow got a shut down worth more than that 1 kill + 4 assists.","replies":[{"poster":"Leonerdo","date":"2015-04-24T20:57:44.980+0000","up_votes":1,"down_votes":0,"body":"Just fyi, 1 assist is worth the same as 4 assists. Assist gold (50% of the kill gold) is always split between all the assisters (if any)","replies":[{"poster":"EvilMerodach","date":"2015-04-25T09:05:07.350+0000","up_votes":2,"down_votes":0,"body":"Gold is the same, but unless it's late game, like everyone level 18, there's still the exp for assists, so still a net gain for enemy unless it was a massive shutdown of a carry right before an important objective.\nAnd utility mastery has some extra gold gains on assists too..so there's that.\n\nBut even ignoring that, 1 kill for 1 kill and 1-4 assists isn't 'worth' unless you are a low priority target (support, non-carry jungler, etc) trading deaths for a high priority target, (adc, apc, assassins..etc) or an objective (tower, dragon, baron, inhib..nexus...)","replies":[]}]}]}]},{"poster":"58738074DEL1","date":"2015-04-24T06:56:45.672+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Slaven152","date":"2015-04-24T13:41:01.317+0000","up_votes":5,"down_votes":0,"body":"That's when you can turn that report into a police report. :D","replies":[]}]},{"poster":"tempname129c","date":"2015-04-22T22:39:07.508+0000","up_votes":5,"down_votes":0,"body":"Kakarot.","replies":[]},{"poster":"gr8job","date":"2015-04-23T13:36:03.746+0000","up_votes":4,"down_votes":0,"body":"As a person who was bullied mercilessly for many years, I can confirm that the use of non-sequitur responses is the best device to mitigate it. As you said, victims of bullies are forced to react without thinking, and that's what they get off on. They attack what they perceive to be a weak point, and they don't expect you to have the gumption react in a way which is meaningful to them. Even if you say nothing, their work is done. They said what they wanted to say, and they think you're weaker for it. Your retaliation or self-defense enhances this feeling even more. Unless you can find a weak point to attack as well (which can break the TOS of this game, as well as be difficult to find if you're not a predatory individual like they are,) saying something completely random is the most effective route to throw them off. My preferred method is responses revolving around the word \"dad\" (I will say \"my dad told me to,\" \"my dad,\" \"ok dad,\" or just \"dad,\") but vegetables work too. :)","replies":[]},{"poster":"Transgressor","date":"2015-04-22T20:49:27.945+0000","up_votes":2,"down_votes":1,"body":"Won't work when the flamer is intentionally feeding anyways. You can mute the entire universe but that won't change the fact that they're 2/18/4 with 40 cs at 18 minutes despite you not being exposed to toxicity thanks to the mutes. :/","replies":[{"poster":"MeesterMoo","date":"2015-04-22T21:57:11.905+0000","up_votes":4,"down_votes":0,"body":"40 cs with a 2/18 score is impressive.","replies":[]}]},{"poster":"SciencePrime","date":"2015-04-24T15:00:29.412+0000","up_votes":3,"down_votes":0,"body":"This is hilarious. It would even be funnier if Rito instituted some system where a small vegetable graphic popped over your head any time you said it. lol","replies":[{"poster":"GreenRaven22","date":"2016-07-05T20:29:37.963+0000","up_votes":1,"down_votes":0,"body":"that would make my day...vegetables everywhere..imagine situatios...all standing in center of the map just spamming all vegetables there is...{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"infinate 8s","date":"2015-04-30T22:09:20.055+0000","up_votes":1,"down_votes":0,"body":"rito plz","replies":[]}]},{"poster":"Hyrum Graff","date":"2015-04-22T20:22:28.715+0000","up_votes":3,"down_votes":0,"body":"I use the mute system, liberally.\n\nLike, if I have a reasonable suspicion that a player will be toxic (ie, they say something not toxic but rude in pre-game or pre-1:55), I'll immediately mute them.\n\nMost of my games are good games. That is to say, in most games I don't know which player is toxic unless others respond to them directly, in which case I request that they not talk about matters unrelated to winning the game.","replies":[]},{"poster":"Qarekeo","date":"2015-08-19T05:42:39.296+0000","up_votes":2,"down_votes":0,"body":"I like how you're applying a system devised for 2nd graders to deal with what are most likely adults.\n\nBravo","replies":[]},{"poster":"Budupops","date":"2015-04-23T01:18:10.907+0000","up_votes":1,"down_votes":0,"body":"lol seems like that is reportable for refusing to communicate","replies":[{"poster":"Niwanee","date":"2015-04-27T17:44:51.104+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Budupops,realm=NA,application-id=cIfEodbz,discussion-id=EOBKEEOY,comment-id=0020,timestamp=2015-04-23T01:18:10.907+0000)\n>\n> lol seems like that is reportable for refusing to communicate\n\nif someone is telling you how much you suck and you respond with \"cucumber\" that's not \"refusing to communicate\", it's not like they were asking when is your ult up or if you can ward baron or anything like what.","replies":[]}]},{"poster":"Fredart","date":"2015-04-22T17:43:34.384+0000","up_votes":2,"down_votes":1,"body":"I find that returning fire is more fun than just taking it, sorry im not christian, i sir will not turn the other cheek.","replies":[{"poster":"Aelvr","date":"2015-04-22T22:19:01.183+0000","up_votes":2,"down_votes":0,"body":"\"turning the other cheek\" =/= letting someone make you feel bad about yourself, it's about not being vindictive. Trolling them back is not being vindictive imho, becoming toxic yourself and/or reporting them is.","replies":[]},{"poster":"FarRockBF","date":"2015-04-22T17:45:57.077+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Fredart,realm=NA,application-id=cIfEodbz,discussion-id=EOBKEEOY,comment-id=000f,timestamp=2015-04-22T17:43:34.384+0000)\n>\n> I find that returning fire is more fun than just taking it, sorry im not christian, i sir will not turn the other cheek.\n\nThat is the point. Here you get to \"return fire\" (have fun) without being mean. In fact tbh, you'll probably piss the guy off even more by showing him that you don't care what he's saying at all.","replies":[]}]},{"poster":"Penta Penguin","date":"2015-04-22T19:48:50.092+0000","up_votes":2,"down_votes":0,"body":"This wouldn't help anything\n\nThe epic leet \"i have to carry\" people literally sit there for half an hour and just type shit at you after they give up and \"afk\" or start feeding\n\ndon't be a 2nd grader and just mute them","replies":[]},{"poster":"prozak82","date":"2015-04-22T17:38:02.544+0000","up_votes":2,"down_votes":0,"body":"I dunno that seems like it could get em riled up more. usually youre just better off not responding at all IMO","replies":[]},{"poster":"ShaftyMegee","date":"2015-04-22T17:30:20.079+0000","up_votes":2,"down_votes":0,"body":"I tell them how hot they are making me feel... getting so hard off you getting angry","replies":[]},{"poster":"Shroom Junkie","date":"2015-04-22T14:38:49.715+0000","up_votes":3,"down_votes":1,"body":"Upvote for laughs\noh and way to rek dem trolls\n<3","replies":[]},{"poster":"Ternt","date":"2015-04-22T13:01:25.397+0000","up_votes":3,"down_votes":1,"body":"I laughed lol. Good post sir.","replies":[]},{"poster":"wangfanzzZ","date":"2015-04-23T02:57:39.204+0000","up_votes":2,"down_votes":1,"body":"toxic troll here,except in ranked where i'm a nice guy believe it or not, best way to counter a toxic teammate it to tell them to chill, don't let them know you're mad,raging,etc. Make them think you dont give a fuck{{champion:17}}","replies":[]},{"poster":"IcyPepper","date":"2015-04-22T17:58:16.735+0000","up_votes":2,"down_votes":1,"body":">What to do: When someone rages, is toxic, or rude towards you simply reply with a vegetable. For example: \"WTF man, why did you call bot lane if you suck at ADC so bad??\" You respond: \"Avocado\" or \"Carrots\".\n\nI... just can't even. Omg.\n\nI'm so going to try this.","replies":[]},{"poster":"Xietnin","date":"2015-04-22T17:53:02.094+0000","up_votes":2,"down_votes":1,"body":"I absolutely love killing them with kindness and all, but there are some that you can't get through to. \nPotato. =)","replies":[]},{"poster":"Krigjer","date":"2015-04-22T17:47:54.254+0000","up_votes":2,"down_votes":1,"body":"I try to logically discuss things with my teammates before I mute them if they're being toxic.\n\nI recently had an Olaf tell me how much I sucked. I asked him what I should do differently, and explained why I did was I did as the issue came up. I wanted him to at least understand my train of thought as I played. \nWhen he told me I was too bad for him to carry, I gave up and muted him.\n\nBut LOL I'll start responding with random things now.","replies":[]},{"poster":"oeL","date":"2015-08-01T12:34:44.130+0000","up_votes":1,"down_votes":0,"body":"avocado","replies":[]},{"poster":"Sohleks","date":"2015-05-05T19:50:16.879+0000","up_votes":1,"down_votes":0,"body":"Haygo vaygo {{champion:150}}","replies":[]},{"poster":"Declined","date":"2015-05-03T19:27:38.404+0000","up_votes":1,"down_votes":0,"body":"Nice mental trick, I've searched far and wide for this answer as I did a bit of research on the human psychology and I needed a 'neat' answer that I could use as a reference in the guide I wrote.\n\nWhich I am informing you off here, if you disagree, I can remove it, but I'd very much like to get your consent.\n\n[NA](http://boards.na.leagueoflegends.com/en/c/tips-tricks/64VFYEZy) and [EU](http://boards.eune.leagueoflegends.com/en/c/champions-gameplay-en/mr8E2Vxb) version, almost identical except for the fact that it has been stickied on EU.","replies":[]}]}