{"poster":"GÐS Victor","date":"2017-01-31T04:52:06.296+0000","title":"Soldi, Soldi, Soldi, Soldi ....","subforum":"Discussioni generali","embed":{"description":"Salve Evocatori, sono Errigal e vorrei darvi maggiore contesto sul cambio di prezzo degli RP che applicheremo in futuro e sulle motivazioni che ci hanno spinto a farlo. A causa dei recenti slittamenti nell'economia su scala globale, aumenteremo il prezzo medio degli RP per i giocatori di EUO e EUNE.Il risultato finale sarà un aumento del costo degli RP di circa il 10%.","url":"http://euw.leagueoflegends.com/it/news/riot-games/announcements/cambio-di-prezzo-gli-rp-europa","image":"http://euw.leagueoflegends.com/sites/default/files/styles/wide_medium/public/upload/bundle-banner_1_0.jpg?itok=PfwoU_ZU"},"up_votes":1,"down_votes":0,"body":"RIleggendo questo vecchio post mi sono posto due domande.\nA distanza di 2 anni, il calo effettivo dello shopper di RP &egrave; diminuito? \n\nRingrazio la RIOT che ogni tanto mi ritrovo in saldo qualche skin dei champs che uso maggiormente. \nPer&ograve; sinceramente spendere 10 euro per una skin mi sembrano un po troppi. \n\nOvviamente mi direte &quot; infatti nessuno ti obbliga a comprarlo&quot; &quot; guarda che &egrave; un acquisto facoltativo&quot; &quot;C&#039;&egrave; tanto lavoro dietro 10 euro se lo meritano&quot;  e avete ragione tutti con queste affermazioni non lo nego; per&ograve; comprarmi una Morgana sposa fantsma, &#039;ashe regina di cuori per esempio e pagarla over 7.50 euro, mi f&agrave; perdere una parte dell&#039;entusiasmo nel vederla in game. \n\nE&#039; un post per dire qualcosa, non incolpo nessuno della riot e nessuno dei player che fa regolari acquisti di skin. \n\nForse la situazione da Studente Laureato senza lavoro aggrava questa mia idea a riguardo. \n{{sticker:zombie-brand-facepalm}} \n\nvoi  che ne pensate?","replies":[{"poster":"ChaosJuda","date":"2017-01-31T14:57:36.485+0000","up_votes":1,"down_votes":0,"body":"Dipende dalle skin onestamente che si suddividono in diverse categorie:\n\n-Skin orrende sia nella splash art che in game: Vayne aristocratica \n-Skin belle nella splash art ma orrende in game: Morgana sposa spettrale\n-Skin che hanno perso il loro valore e che hanno un bisogno disperato di un visual update: Ezreal pulsefire\n-Visual Update che vengono fatti passare per skin leggendarie: Udyr guardia spirituale\n-Skin che rendono le skill più difficili da evitare: iBlitzcrank, Project Ashe, Lux Legione di ferro, Syndra grande giustiziera, Syndra atlantidea, Pantheon ammazzadraghi\n-Skin che rendono più facile da giocare un champion: Caitlyn spettro lunare, Lee Sin muay thay, Quinn esploratrice guerriera etc etc...\n\nPer alcune di queste spendere anche 2 centesimi è troppo, mentre altre per la cura con cui sono fatte, effettivamente li valgono tutti","replies":[{"poster":"TerrorVodka","date":"2017-01-31T18:08:22.455+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ChaosJuda,realm=EUW,application-id=MJVj50Jw,discussion-id=bLZMwFnG,comment-id=0003,timestamp=2017-01-31T14:57:36.485+0000)\n>\n\n> -Skin che rendono le skill più difficili da evitare: iBlitzcrank, Project Ashe, Lux Legione di ferro, Syndra grande giustiziera, Syndra atlantidea, _**Pantheon ammazzadraghi**_\n\ngià, con quella le spear non le dodgi neanche morto\n\nio spendo solo se sono in saldo e mi piacciono davvero tanto sennò niente\nche tanto ti accorgi della skin i primi game poi non ci fai neanche caso IMO","replies":[{"poster":"Firenheit","date":"2017-01-31T18:42:57.016+0000","up_votes":1,"down_votes":0,"body":"\"già, con quella le spear non le dodgi neanche morto\"\n\nNon ho capito se è sarcastico o no!","replies":[]}]},{"poster":"GÐS Victor","date":"2017-01-31T17:18:35.469+0000","up_votes":1,"down_votes":0,"body":"ottimo commento {{sticker:zombie-brand-clap}}","replies":[]}]},{"poster":"Firenheit","date":"2017-01-31T18:40:53.875+0000","up_votes":1,"down_votes":0,"body":"Io ho effettivamente diminuito i miei acquisti, ormai spendo qualcosa SOLO se una skin mi tira fuori i soldi puntandomi una pistola alla testa. \nTra l'altro avrei molto di cui parlare a proposito, ma non credo sia questo il luogo adatto!","replies":[]},{"poster":"Dr LouD","date":"2017-01-31T11:37:32.315+0000","up_votes":1,"down_votes":0,"body":"CS:GO e Dota2 avrebbero qualcosa da ridire","replies":[]},{"poster":"Jack Garrus","date":"2017-01-31T11:32:22.459+0000","up_votes":1,"down_votes":0,"body":"E pensa che su altri moba il prezzo delle skin minimo è 20 euro :D","replies":[]},{"poster":"The Fluffy Lamb","date":"2017-01-31T06:46:02.202+0000","up_votes":1,"down_votes":0,"body":"E poi ci sono io che faccio fuori 30 euro per tre skin :D alla volta","replies":[]}]}