{"poster":"The Mighty Luma","date":"2015-08-19T19:06:16.246+0000","title":"Der Letzte Project-Skin","subforum":"Skin- & Champion-Konzepte","embed":{"description":"Die Wahrheit geht nie verloren. Initiiere PROJEKT:","url":"http://euw.leagueoflegends.com/de/site/skins-project/#!trace-1","image":"http://s.lolstatic.com/site/skins-project/a8bebddc3be8c6a49759df4c054672c7b8b191db/images/social-preview.jpg"},"up_votes":3,"down_votes":1,"body":"Hallo Community!\r\n\r\nDas \"Kampfger&auml;t\" des letzten Project-Skin wurde auf der LoL-Seite gezeigt\r\nEs scheint eine Klinge zu sein.\r\nDas l&auml;sst jetzt etwas Spielraum f&uuml;r Spekulation!\r\n\r\nIch k&ouml;nnt mir Yi als letzten Project Skin vorstellen, weil das Ger&auml;t \"Alpha Klinge\"  hei&szlig;t und eine von Yis F&auml;higkeiten ja \"Alpha Strike\" hei&szlig;t.\r\n\r\nWeitere M&ouml;glichkeiten w&auml;ren vl Jax oder Kalista.\r\n\r\nWas meint ihr?\r\n\r\nLG The Mighty Luma","replies":[{"poster":"xJustplay","date":"2015-08-20T11:21:18.490+0000","up_votes":2,"down_votes":0,"body":"Vielleicht bekommt jax ja seine Waffe zurueck darum kennt die Waffe keiner ;p","replies":[]},{"poster":"IceeeStorm","date":"2015-08-19T19:46:33.771+0000","up_votes":2,"down_votes":0,"body":"Ich glaub eher des wird ein neuer Champ...zumal die Klinge nicht zu ihm passt, da es (für mich gesehen) ne Doppelklinge (Yi besitzt ja nur ein Schwert) ist und auch keine Beschreibung zu der jeweiligen Person gibt, wie jetzt bei den anderen Waffen, wo man die Personen ja erraten kann. ^^","replies":[{"poster":"EGRILLHUNTER69","date":"2015-08-20T16:26:49.011+0000","up_votes":1,"down_votes":0,"body":"Ein Riotler hat bestätigt das kein neuer chamo#p zurzeit rauskommt und die zwei hinweiße weißen auf seine Q und E hin.","replies":[]}]},{"poster":"Zero000","date":"2015-08-19T19:57:51.774+0000","up_votes":3,"down_votes":1,"body":"Ich würde sagen es gibt Skins für folgende Champions\n\n----------------\n\nBei dem Hexagon oben bin ich mir am unsichersten, glaube aber {{champion:58}}. Die genannte Waffe \"Hyperlicht \"Alpha\" Klinge sieht nach einem \"Zwilligs-\" oder \"Doppelschwert\" aus. Wobei ich mir nicht sicher bin ob solche wirklich so genannt werden.\nZumindest scheint der Griff in der Mitte zu sein, womit die meisten anderen Schwertkämpfer weg fallen.\nUnd der einzige mit einer entsprechenden Waffe der mir einfällt ist Renekton.\n\n------------\n\nAuf dem Hexagon oben rechts sieht man einen Schild, womit besonders {{champion:201}} und {{champion:89}} in frage kommen.\nAufgrund des dabeistehenden Textes \n\n> **VERSENKBARER SCHLAGPANZER**\nVersenkbarer Energiepanzer mit Titaniumeinsätzen bietet maximalen Schutz gegen starke Angriffe. In der Lage, Ziele durch Einbindung der Energie des Operators abzublocken und zu betäuben.\n\nund \n\n>**ERINNERUNGSDATENBANK_ 002385500000**\nBrillanz entzweit, von ätherischer Flamme umhüllt. Beschützerin, Lichtbringerin. Ruferin. Hält Stellung und kämpft. In Feldern voller Toter steht sie noch immer, Licht flutet über sie hinweg ...\n\nwürde ich aber auf {{champion:89}} tippen, da unter anderem von einer weiblichen Person gesprochen wird.\n--------------\nAuf dem Hexagon unten rechts sieht man zwei Pistolen womit {{champion:236}} und {{champion:21}} in frage kommen. Die Form der Waffen und deren Thematik\n\n> **IONENFEUERKERN**\nKern feuert Lichtstrahlen mithilfe von sekundärer Fokuskammer ab. Durch Primärkammer kanalisierte Ionen ermöglichen zusätzliche Ladungen.\n**STARKER LICHTVERSTÄRKER**\nAktivierter Verstärker feuert Leuchtkugel zur Zielverfolgung ab, welche Erfassung weit entfernter Ziele ermöglicht. Einheit mit Ionenfeuerkern kompatibel.\n\n passt jedoch besser auf {{champion:236}}. Auch ist später von einem Männlichen Charakter die rede.\n> **ERINNERUNGSDATENBANK_ 6553112894302**\nDurchdringende Flamme, er, von Licht umgeben. Ich sehe seine Vision, von Schatten befreit, eine leuchtende Melodie. Jenseits des Lichts, nichts, Reinheit eingesperrt in Zorn ...\n\n-------\n\nUnten ist der schon vorhandene Yasuo Skin\n\n------\n\nUnten links haben wir vermutlich einen {{champion:238}} Skin. Die Form der Waffen passt zu seinen bisherigen und im Text steht unter anderem\n\n> **ERINNERUNGSDATENBANK_ 000982389000**\nDunkelheit, Schattenmarkierung, Tod an seiner Seite. Lässt verstummen, er folgt. Der Schatten ruht im Inneren. Aufrecht, blutgetränkt. Verflüchtigt sich ...\n\n\"Schatten\" und \"Markierung\" passt sehr gut auf Zed, nur das mit dem verstummen passt je nach Sichtweise nicht rein da Zed keine Fähigkeit hat die andere verstummen lässt. Wenn man mit \"verstummen aber eher \"ruhigstellen\" bzw umbringen meint passt es.\n\n----\n\nOben Links haben wir zum Schluss ein großes Schwert o.ä. womit erstmal viele gemeint sein könnten.\nAufgrund des Namen der Waffe \"1.0.0 Pulsdegen \"Scarlet\" würde ich aber auf {{champion:114}} tippen die glaube ich als einzige einen Degen benutzt.","replies":[{"poster":"ShinigamiDoragon","date":"2015-08-20T07:52:21.229+0000","up_votes":1,"down_votes":0,"body":"Jup erst mal soweit eine gute theorie aber bei renekton oben könnte es halt auch ein neuer champ sein aber wer weiß das schon diese waffe lässt eigentlich nicht so ganz viel Spielraum denn soweit ich weiß ist {{champion:58}} Waffe immer synchron mal sehen wer es wird","replies":[{"poster":"iZitro","date":"2015-08-20T09:16:02.555+0000","up_votes":1,"down_votes":0,"body":"Es sieht ja so aus wie ein Mensch also kann es nicht {{champion:58}}  sein wenn man sich den Kopf Anschaut\nMeiner meinung nach\n","replies":[{"poster":"Zero000","date":"2015-08-20T14:46:00.505+0000","up_votes":1,"down_votes":0,"body":"Welchen Kopf meinst du?\nDen der am Anfang der Seite gezeigt wird? http://euw.leagueoflegends.com/de/site/skins-project/\nWer sagt den das der zum oberen Teil gehört? Wir haben sechs Ecken mit möglichen Skins oder vielleicht auch Champions. Warum sollte der Kopf unbedingt zur oberen Ecke des Hexagons gehören?","replies":[{"poster":"ShinigamiDoragon","date":"2015-08-20T15:40:34.392+0000","up_votes":1,"down_votes":0,"body":"entweder es ist heckarim oder jax dabei bleibe ich jetzt ;)\nsehe nicht ein das es YI wird","replies":[{"poster":"Hayley Kiyoko","date":"2015-08-20T22:10:51.576+0000","up_votes":1,"down_votes":0,"body":"Es ist Yi wurde schon veröffentlich auf surr at 420 :)","replies":[]}]}]}]}]}]},{"poster":"Noxempire","date":"2015-08-19T19:23:21.456+0000","up_votes":2,"down_votes":1,"body":"Yi wäre ein wenig unepisch oder? So viel Wind um nen yi skin?   ^^\nIch hoffe ja ein neuer Champ zum Projekt theme. (Ich hab mal was von wegen Yone, also Yasuos Bruder gehört, aber alles nur Spekulation.)","replies":[{"poster":"EGRILLHUNTER69","date":"2015-08-20T16:27:49.827+0000","up_votes":1,"down_votes":0,"body":"Er wird ein legendary darum und League hat damit geschaft Reddit explodieren zu lassen","replies":[]}]},{"poster":"Perfect Idea","date":"2015-08-19T19:21:44.649+0000","up_votes":2,"down_votes":1,"body":"Das ist ein neuer Champion meiner meinung ^^","replies":[]},{"poster":"Pοpstar","date":"2015-08-27T13:40:43.334+0000","up_votes":1,"down_votes":0,"body":"Ich versaue euch mal den spass :D\n{{champion:11}} ist mit dem skin auf dem PBE verfuegbar :D","replies":[]},{"poster":"Killcat","date":"2015-08-19T20:52:12.304+0000","up_votes":1,"down_votes":1,"body":"Meine Vorschläge (von oben im Uhrzeigersinn):\n1. {{champion:11}} (Yi fast seine Klinge nicht ganz unten an, Die linke Erklärung spricht von der Einfassung der Klinge = Griff, J4 der ab und zu noch vorgeschlagen wird, besitzt eine Lanze und keine Klinge. )\n2. {{champion:89}} \n3. {{champion:236}} \n5. {{champion:91}} (Die Beschreibung passt eigentlich nur auf ihn, wobei ich mir nur die englische Seite angeschaut habe. Warum, Cutthroat ist eine seiner Fähigkeiten. Im Gegensatz zu Zed hat er wirklich 2 Klingen und keine Shuriken, die er wirft. )\n6. {{champion:114}} (Säbel, Duelist, Fiora)","replies":[{"poster":"Lasagnekönig","date":"2015-08-20T23:30:44.582+0000","up_votes":1,"down_votes":0,"body":"Talon hätte  ich persönlich super geil gefunden, da der ja (abgesehen vom ssw skin) lange keinen richtigen skin mehr bekommen hat, aber es ist halt zed und das is auch cool... Aber der Ganze Hype für nen Yi skin... tragisch tragisch","replies":[]},{"poster":"TBC JuzZtHEInEy","date":"2015-08-20T12:45:24.366+0000","up_votes":1,"down_votes":0,"body":"talon hat eine Klinge und Zed hat an jedem Arm ein so nen \"Apparat\" , Klinge kann man das ja nicht nennen :)","replies":[]},{"poster":"Ándhrimnir","date":"2015-08-20T06:26:34.790+0000","up_votes":1,"down_votes":0,"body":"zed wurde schon auf den pbe gebracht ^^","replies":[]},{"poster":"HooQueue","date":"2015-08-19T21:35:01.970+0000","up_votes":1,"down_votes":0,"body":"zu 5.: Ich glaube eher das es Zed ist, da Zed tatsächlich 2 Klingen hat (und 2 Shuriken auf seinem Rücken) und Talon nur eine hat.\nAnsonsten kann ich deine Überlegung gut nachvollziehen, obwohl ich eher zur neuen Champion Hypothese stehe (vor allem weil ich mich über einen neuen Champion freuen würde :P)... :D","replies":[]}]},{"poster":"Lasagnekönig","date":"2015-08-20T23:24:32.148+0000","up_votes":1,"down_votes":0,"body":"Das oberste ist Master Yi. Die Klinge wird zur Doppel-Klinge, wenn er Ult aktiviert. Wird ein 1820rp Skin, aber ich freu mich noch viel mehr auf Zed . Der hatte wirklich mal nen Neuen nötig","replies":[]},{"poster":"Xàyáh","date":"2015-08-20T21:20:11.901+0000","up_votes":1,"down_votes":0,"body":"NEW PROJECT ZED SKIN ! https://www.youtube.com/watch?v=ZDX-Rt-wu8E","replies":[]},{"poster":"Legend Hypaaahh","date":"2015-08-20T20:59:42.850+0000","up_votes":1,"down_votes":0,"body":"Es ist Yi, \"PROJECT: Yi Alpha\". Ist confirmed","replies":[]},{"poster":"iZitro","date":"2015-08-20T19:37:17.582+0000","up_votes":1,"down_votes":0,"body":"Der Oberer is Yi ;D\nAlso Alpha","replies":[]},{"poster":"knl","date":"2015-08-20T14:20:40.552+0000","up_votes":1,"down_votes":0,"body":"Ich denke es wird Zone und falls !Denke ich das er eine Art gestalten Wandler wird wegen der Klingenbeschreibung:An einzigartige molekulare Stadien Anpassbar. Evtl könnte er sogar 2 Einheiten gleichzeiti angreifen....","replies":[{"poster":"Tenjirou","date":"2015-08-20T15:23:57.380+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DragonOfEmsi,realm=EUW,application-id=L7E6lhzo,discussion-id=MsjqeMvN,comment-id=000d,timestamp=2015-08-20T14:20:40.552+0000)\n>\n> [...] wegen der Klingenbeschreibung:An einzigartige molekulare Stadien Anpassbar.\n\nFiora's und Zed's Waffe besitzen auch die \"SCHWARZE RR 'SOLID SMOKE' KLINGENSCHEIDE\" und diese haben auch die selbe Eigenschaft.","replies":[]}]},{"poster":"WhiteBCD","date":"2015-08-20T07:27:09.326+0000","up_votes":1,"down_votes":0,"body":"Warum denkt keiner an Irelia ?? Das erste an was ich gedacht habe bei der 2 Klingen waffe war Irellia . Die sieht doch genau so aus. xD","replies":[{"poster":"TBC JuzZtHEInEy","date":"2015-08-20T12:43:38.482+0000","up_votes":1,"down_votes":0,"body":"das sieht nicht mal annähernd aus wie die Waffe von Irelia :`D\nIrelias Waffe ist ne Kugel die von 4 einschneidigen- Klingen umgeben ist, welche sie bei ihrer Ulti einzeln wegschmeist :D","replies":[]},{"poster":"Sirrkas","date":"2015-08-20T07:50:51.528+0000","up_votes":1,"down_votes":0,"body":"Vermutlich, weil die Beschreibung zu dem Punkt neben den zwei Klingen nicht zu Irelia passt.","replies":[]}]},{"poster":"DarkRaín","date":"2015-08-20T10:29:10.509+0000","up_votes":1,"down_votes":0,"body":"Es wird kein neuer Champ da Riot schon sagte das vor den Worlds kein neuer Champ kommt da wie sie es auch schon in den Patchnotes zum neuen Patch sagten die nächsten zwei Patches sehr klein ausfallen werden und zur Überarbeitung für die Worlds stehen werden. Die nächsten zwei Pachtes kommt also kein neuer Champ erst mit 4.19. Projekt Fiora gibt es schon im PBE Shop also ist sie schon mal bestätigt bei den anderen sehen wir noch {{champion:89}} {{champion:236}} {{champion:238}} dazu kommt dann noch der Mysteriöse wo wir kaum Infos zu haben.","replies":[{"poster":"Nijuga","date":"2015-08-20T10:47:53.976+0000","up_votes":1,"down_votes":0,"body":"Kannst du mal bitte eine Verlinkung zu der Aussage von Riot machen, dass keine weiteren Champs mehr vor den Worlds kommen? Und außerdem haben wir ja noch 2 Patches vor und und es heißt ja auch nicht unbedingt das der letzte Projekt Skins/neuer Champ vor den Worlds rauskommen muss, oder?","replies":[{"poster":"DarkRaín","date":"2015-08-20T10:55:29.195+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nijuga,realm=EUW,application-id=L7E6lhzo,discussion-id=MsjqeMvN,comment-id=000b0000,timestamp=2015-08-20T10:47:53.976+0000)\n>\n> Kannst du mal bitte eine Verlinkung zu der Aussage von Riot machen, dass keine weiteren Champs mehr vor den Worlds kommen? Und außerdem haben wir ja noch 2 Patches vor und und es heißt ja auch nicht unbedingt das der letzte Projekt Skins/neuer Champ vor den Worlds rauskommen muss, oder?\n\nhttp://www.surrenderat20.net/2015/08/red-post-collection-next-champion-not.html Da wo das Bild von Tahm ist. Die Projekt Skins kommen in Patch 4.17 raus also vor den Worlds.","replies":[{"poster":"Nijuga","date":"2015-08-20T11:07:05.740+0000","up_votes":1,"down_votes":0,"body":"Ok, danke :)\nNaja, dann bleibts wohl spannend bis nach den Worlds, außer es wird nur ein \"normaler\" Skin, was ich eigentlich nicht hoffe.","replies":[]}]}]}]},{"poster":"DarkRaín","date":"2015-08-19T21:53:53.965+0000","up_votes":1,"down_votes":0,"body":"Es gibt keinen neuen Champ vor den Worlds das hat Rito selber gesagt. der nächste Champ wird erst nach den World kommen also ist das nur ein Skin für einen schon veröffentlichen Champ nach dem wie Riot den vorstellt denke ich mal das es ein Legendary Skin werden könnte.","replies":[{"poster":"ShinigamiDoragon","date":"2015-08-20T07:54:11.915+0000","up_votes":1,"down_votes":0,"body":"ja und welchen champ stellst du dir denn da vor?","replies":[]}]},{"poster":"Zêph","date":"2015-08-19T19:58:24.961+0000","up_votes":1,"down_votes":2,"body":"An alle die jetzt sagen:\"Das ist 100 pro ein neuer Champ\" Ich kann euch enttäuschen. Riot hat gesagt es wird kein neuer Champion sondern nur ein Skin für einen bereits existierenden Champ :^)","replies":[{"poster":"Vastayan Wings","date":"2015-08-19T20:46:14.110+0000","up_votes":1,"down_votes":1,"body":"Wäre doch iwie scheiße: Neuer Champ und sein einziger Skin= Legendary xd","replies":[{"poster":"HooQueue","date":"2015-08-19T21:40:50.680+0000","up_votes":1,"down_votes":0,"body":"Wiese sollte der Legendary sein?\nUnd nen 1350rp (falls du darauf hinauswolltest) als ersten Skin hatte zum Beispiel Rek'Sai.","replies":[{"poster":"The fabulous Oak","date":"2015-08-19T23:16:04.790+0000","up_votes":1,"down_votes":0,"body":"Kha hatte früher einen","replies":[]}]}]},{"poster":"SilverShadow1810","date":"2015-08-19T20:57:11.920+0000","up_votes":1,"down_votes":0,"body":"vielleicht existiert er schon aber nur bei ihnen im system und kommt noch auf den pbe und auf die live server, das wäre sehr schön weil es mal wieder zeit wird das ein neuer champ rauskommt","replies":[]}]},{"poster":"Dute Universe","date":"2015-08-19T21:51:14.171+0000","up_votes":1,"down_votes":0,"body":"Also Renekton macht keinen Sinn, wenn man sich das Bild anguckt. Welcher Renek sieht denn bitte aus wie n Mensch?. Und Yi kann ich mir nicht vorstellen, weil Yi keinen Zopf hat... :D","replies":[]},{"poster":"Balvor","date":"2015-08-19T19:58:44.174+0000","up_votes":1,"down_votes":0,"body":"Plottwist: Jarvan Skin...","replies":[]},{"poster":"FabinatorMC","date":"2015-08-20T10:05:47.985+0000","up_votes":1,"down_votes":2,"body":"Ich denke mal es wird ein neuer Champ. Vielleicht wird es ein Champion wie {{champion:126}} der Nah- und Fernkämpfer ist, weil man sieht:\n1. Eine Klinge\n2. Laserwaffen\n3. ein Schild\n\nAber was mich wundert das man da auf einen Bild Projekt Yasuo sieht?{{champion:157}}  Ich würde einfach mal sagen wir sollten uns überraschen lassen :D\n\nFabinatorMC","replies":[]}]}