{"poster":"Monkey D Snoopy","date":"2015-12-02T02:53:17.250+0000","title":"Uso de programas externos al jugar League of legends","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Como muchos sabran, existen una infinidad de programas que se pueden usar mientras se ejecuta league of legends, cada uno con su funcion, leyendo las normas dice en un articulo &#039;&#039;Se prohibe cualquier tipo de programa externo ajeno a league of legends que altere bla bla bla&#039;&#039;, okey, al leer eso lo primero que se me viene a la mente es MKLoL y esos programas que se utilizan para usar Skins Custom creadas por la comunidad.\r\nPero, existen programas que tambien alteran en poca pero cierta medida el uso de League of Legends, digamosles algo asi como &#039;&#039;Boosters&#039;&#039;, quisiera saber si el uso de Razer Cortex Game Booster, Hialgo booster, Hialgo SWITCH, entre otros&#039;&#039;boosters&#039;&#039; son \r\n&#039;&#039;penados&#039;&#039; por la mano dura de riot. Eso, gracias.","replies":[{"poster":"Runth","date":"2015-12-02T06:49:42.557+0000","up_votes":1,"down_votes":0,"body":"programas de mejorar de rendimiento de la pc es muy diferente q un programa de altearar al cliente q no es permitido tocarlo, no todos\n\nlos terminos ahi dice , ya lei como 32 veces xd","replies":[]},{"poster":"Darkfoe703","date":"2015-12-02T03:06:35.989+0000","up_votes":1,"down_votes":0,"body":"Sencillo: Lo que hacen estos programas es mejorar el rendimiento de tu PC, no del juego. Así que no, no están penado por el reglamento.\nSaludos","replies":[]},{"poster":"artistafracasado","date":"2015-12-02T03:04:48.934+0000","up_votes":1,"down_votes":0,"body":"Tengo entendido que no. \nPero en general he leído que realmente no hacen mucha diferencia. Más que nada depende de tu computadora. \nA veces sale mejor configurar bien todo y tener actitudes provechosas para el juego (lo típico; no correr programas en segundo plano, no descargar mientras juegas, no sobrellenar el pc de archivos y programas, mantenerlo lo más limpio posible, etc, etc)","replies":[]},{"poster":"Hwaxinghz","date":"2015-12-02T03:03:32.786+0000","up_votes":1,"down_votes":0,"body":"Los boosters que mencionas son solo para mejorar la calidad gráfica del juego (tipo apagar ciertos procesos y mejorar la resolución del juego a mayores frecuencias de FPS, etc. Esos programas no son ilegales. Hialgo Switch por ejemplo, te ayuda a mejorar los fps no te da ningun skin ni trampa para aprender a jugar, de hecho si vamos al caso, entonces el WTFast que mejora la calidad de la conexión a internet también será un programa de terceros que \"mejora (literalmente) la experiencia de juego\" al bajarte el ping. No tendría sentido penar por usar programas que no hacen nada raro. En cambio MKLoL sí, porque te da timers de la jungla, si lo quieres.\nLos boosters de gráficas solo sirven para quitar procesos de windows que no se usan en el momento de jugar, nada más, no le meten nada mágico al juego para hacer que funcione un 800% más rápido, es todo una cuestión de vaciar memoria y liberar espacio, nada más. Sería como penar por usar CCleaner, si lo quieres ver así, pero en vez de ser el disco duro libera memoria ram para ser usada por el juego.","replies":[]}]}