{"poster":"TB PliPlanEgon","date":"2018-03-12T18:43:53.707+0000","title":"Midlaner sucht Team für Flex-Q (Flex-Q Elo : Gold 3 )","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey,\r\nich suche ein Team f&uuml;r Flex-Q zum spielen war letzte Season Platin 3 und w&uuml;rde gerne mit Leuten zusammen mich verbessern und in der Flex-Q leiter climpen wenn ihr ein Team habt oder eins bilden wollte schreibt mich an spiele so gut wie alles Flame nicht und m&ouml;chte tryharden also keine Kinderclans\r\nbtw bin 18 :P\r\ningame: TB Schlumpen","replies":[{"poster":"LCG SkyRaw","date":"2018-03-13T01:43:57.285+0000","up_votes":1,"down_votes":2,"body":"Guten Morgen, Guten Tag oder doch Guten Abend meine lieben,\n\nihr seid auch genervt, dass wenn ihr einfach mal ne runde SoloQ zocken wollt und dann AFKler oder Troller dabei sind? Also ich bin es auf jeden fall genervt davon.\nIhr wollt im Team besser werden oder auch zusätzlich besser werden dadurch? Mehr gemeinsame Events zusammen unternehmen? Bei kleine Turniere mitmachen und vielleicht den Hauptpreis gemeinsam gewinnen?\nJa genau, ich möchte das auf jeden fall, vor allem besser werden oder auch einfach mal abends gemeinsam bei der LCS oder ähnliches Taktiken besprechen anschauen etc.\n\nMit dem Team will ich persönlich einiges erreichen. Und im nahmen der AEQ Community mit unteranderem bei Turnieren mit machen. (Zukunft\n\nWas ich vor habe. Ich möchte mit diesem Poste auf euch aufmerksam machen das ich ein Team eröffnen möchte.\n\nWie sieht die Planung aus.\n- 5 Spieler finden davon einer der Shot-Calling lernen möchte oder schon kann.\n- Namen Findung, gemeinsam\n- 3-4 Tage Trainingstage. Die wir zsm. Finden.\n- Coach finden oder nachfragen der uns unterstützt.\n- Zusammen verschiedene Taktiken bzw. Picks wählen die Zsm. Gut Skalieren\n- Champion Pool erweitern, generell gemeinsam lernen.\n- Pick und Bann Manager, der endscheidet was wir genau picken und wann.\n\nDas war es zu dem Thema wie ich das ganze vorhabe. Wenn ihr in das Team möchtet solltet ihr paar Kritikpunkte vorhanden haben.\n\nmin. Gold - Platin SoloQ Bereich sein.\n3-4 Tage Zeit nehmen für das Team ( Natürlich kein muss aber sollte 75% Aktivität von dem Monat)\nEngagiert sein.\nPünktlich und zuverlässig sein.\n3-5 Champion Pool für deine Lane.\nTilt Resistent\nCall is Call Wahrnehmung! (WICHTIG) auf das hören was der Shot-Caller CALLT!\nWas suche ich.\n\nMain:\n\nAktuell wird nur noch ein Mid-Laner oder ADC Gesucht!\n\nAuswechsle Spieler bräuchte ich 2-3 Allrounder ( Also wenn du ein Team suchst, aber hast nicht immer Zeit dann bist du genau richtig bei uns als auswechsle Spieler/in)\n\nSo das war meine Planung wer Interesse dran gefunden hat darf sich gerne hier drunter Melden oder auch generell bei mir!.\nAn die Coaches, wenn ich euer Interesse geweckt habe das du als Coach denkst uns da weiter zu helfen! 5 Spieler/innen weiter zu helfen oder generell besser zu werden dann darfst du dich natürlich auch gerne bei mir melden.\n\nWürde mich auf jeden fall freuen.\n\nMit freundlichen Grüßen\n\nEure / Syn Skyunicorn\n\nPs: Wenn ihr was dazugeben sollte oder ne Anregung mit einbinden möchte darf das natürlich auch gerne machen.!","replies":[]}]}