{"poster":"LemønPykë","date":"2017-03-23T14:58:22.014+0000","title":"Que tengo que mejorar? Algún High elo que me de una mano?","subforum":"Guias y consejos","up_votes":3,"down_votes":0,"body":"Hola me gustar&iacute;a si alguien me puede dar una mano y se d&eacute; una vuelta por https://las.op.gg/summoner/userName=gming96 y le pegue un vistazo a mis stats, para ver si a simple vista encuentra algo raro.\r\nCosas durante el game que hago, o suelo hacer, como main soporte.\r\nEs raro para mi perder la l&iacute;nea, y siempre me pego un buen feed, para mi la fase de lineas esta practicamente terminada cuando cae la torreta enemiga, desde ese momento empiezo a ir mid, o top hasta derribarlas, generalmente tengo un buen control de la visi&oacute;n en el mapa (depende de que tan snowball este la partida y a favor de quien), y en las tf hago full peel a mi carry casi siempre, a menos que otro integrante del equipo lo necesite m&aacute;s.\r\nOtras dudas que me surgen en determinadas partidas y me olvido de hacerlas..\r\nQu&eacute; hacer si mi equipo no quiere juntarse teniendo la ventaja?\r\nQue pasa si mi equipo no tiene intenciones de tomar objetivos?\r\ny por sobretodo, Que hago cuando se tiltean y empiezan a flamear a diestra y siniestra? como los calmo?\r\nDesde ya muchas gracias!","replies":[{"poster":"JayInc","date":"2017-03-24T00:21:23.430+0000","up_votes":3,"down_votes":0,"body":"Juega más rankeds. Tienes 64% win rate con Blitz y 69% con Soraka. ¿Qué mejor? lo único que te falta es jugar. Si te mantienes con esos champs y esos win rates, subes fácil. Además, deja de jugar tantos champs y enfócate en unos pocos, especialmente con los que te dan resultados.","replies":[{"poster":"Dogan King","date":"2017-03-27T04:21:06.733+0000","up_votes":1,"down_votes":0,"body":"Es palabra de Dios :v","replies":[]},{"poster":"Ahrmadyl","date":"2017-03-24T17:14:56.526+0000","up_votes":1,"down_votes":0,"body":"Palabra","replies":[]}]},{"poster":"9081913DEL1","date":"2017-03-23T17:31:44.695+0000","up_votes":2,"down_votes":0,"body":"Pues en oro lo que tenes que mejorar seria la velocidad con la que lees el macrojuego. Es decir que tan rapido te adaptas a lo que esta pasando y que tan rapido optas por ahcer una u otra cosa.\n\nTu equipo, error comun, tu equipo son otras personas que juegan con tigo, tu estas en un grupo, de tu grupo solo manejas un campeon, juega de tal forma que aportes, pero a la vez debes poder tomar riendas por ti mismo.\n\nTus campeones estan bien, pero un tresh, una karma, una morgana, una sona, pueden obligar A TU ALIADO a posicionarse. O le generan una posicion de ventaja. Como soporte es dificil subir si pickeas campeones dependientes del carry para el daño.\n\nUna cuestion del soloq, es que no debes confiar en lo que haran los demas, no sabes que haran la mayoria de las veces. Y no apuestes a que haran lo que tienes en mente.\n\nZyra por ejemplo, te van a flamear por el farmeo, pero si pones a tu enemigo bajo la torre pronto ya tienes posicion de ventaja.\n\nEn cuanto a que Pasa si alguien flamea, si no se juntan, si no siguen objetivos. Esto es la clave de lol, capitanea, toma los objetivos, o trata de que sea tan claro como la unica opcion posible.\n\nSi tenes todo correctamente wardeado como en la lcs y tus dagarracos estan correctamente protegidos y demas, hay noticias, tu equipo puede que ni mire el mapa.\n\nEntonces sigue eso, wardea lo que deberan hacer, o lo que crees que sera inevitablemente util. Por ejemplo sabes que tu linea esta segura, que vas ganando perdiendo, lo importante es el drake. Pushea la linea y si no se gana torre corre vos hacia el drake previamente wardeado. Forza la reaccion de tu equipo.\n\nEsto es mas dificil ya que en oro tambien te deben estar faltando nociones concretas y mecanicas especificas, pero lo mas importante es esto CERRAR PARTIDAS.\n\nSaludos!","replies":[]},{"poster":"Lucrexio","date":"2017-03-23T15:45:23.508+0000","up_votes":2,"down_votes":0,"body":"No encuentro nada raro más allá de que casi todas las partidas en las que perdiste tenes un lince fedeador con menos de 30% de contribución al equipo, me imagino las razones, en ese caso los campeones que usas están bien, podrías probar otros campeones si te sientes cómodo, cualquier otro campeón que esté en buen win rate.\nSi tu adc es un completo inútil podes optar por aportar el daño desde tu campeón, pero no te juegues la utilidad en lo posible ({{champion:16}} , {{champion:37}} y {{champion:40}} son de lo más simples para hacer peel y a mi parecer están rotos en lo que hacen).\nOtra cosa que podrías mejorar es la cantidad de wards, hay un par que pusiste la misma cantidad que alguno de tu otros compañeros, tendría que ver cómo pones los wards pero nada del otro mundo, simplemente con que sepas cuando y donde necesitaría visión tu equipo es suficiente.\nsaludos!","replies":[]},{"poster":"WKH4 Sans","date":"2017-03-23T15:23:24.766+0000","up_votes":2,"down_votes":0,"body":"Para calmarles, hace un cantico.","replies":[{"poster":"LemønPykë","date":"2017-03-24T02:38:53.757+0000","up_votes":1,"down_votes":0,"body":"xD lo voy a probar","replies":[{"poster":"WKH4 Sans","date":"2017-03-24T18:10:08.723+0000","up_votes":1,"down_votes":0,"body":"¿en el que la luz se funda\n\nen el que el desierto llore\n\ny los cielos se ondulen?","replies":[]}]}]}]}