{"poster":"LemønPykë","date":"2016-06-26T19:04:23.248+0000","title":"League of Legends hoy me Animo el dia y te lo cuento!","subforum":"Comportamiento del jugador","up_votes":5,"down_votes":2,"body":"Acabo de jugar una partida, se podr&iacute;a decir, 1 en 1000, pero para que sientan el entusiasmo que tengo debo contarles desde principio.\r\n\r\nUn dia como cualquiera juego una normal, como de costumbre, no lei el chat al principio as&iacute; que me quedo jungla, pickeo Lee Sin que es lo mejor que se usar en la jg. \r\nPero los problemas empiezan en la pantalla de carga, cuando un furioso 999ms naranja aparece, algo me pasaba con el internet y no me hab&iacute;a percatado, por lo que cuando entro digo: &quot;Tengo 1000 ms&quot;, y para mi sorpresa, nadie me insulto ni nada, al contrario, me dieron soluciones posibles a mi problema, ninguna me funciono al principio lamentablemente, entre intento e intento de apagar y reiniciar el modem, logre solucionar el problema de conexi&oacute;n, logr&oacute; entrar en la partida pero tengo otro problema, Minuto 15, todos eran lvl 11 y yo era 3 y el Score de la partida iba 12 / 1 abajo, sinceramente en ese momento me dije, esto esta perdidisimo...\r\nTrato de farmear algo subir de lvl un poco, para hacer tiempo hasta que nos tiren el nexo, pero ve que mi yasuo  hab&iacute;a dejado a poca vida a una zyra, a la cual le salto a lo loco con mi q, le empiezo a pegar y cuando ten&iacute;a 50 de hp, un shaco salvaje aparece y me borra de 3 hits, y siguio asi hasta que llegue a un 0/2/0, y me fui afk farming en la jg para sacar mas oro y exp, y a la vez dejar de fedear.\r\nLlegue a tener una diferencia de 4 lvl con los del otro team, y ya tenia 2 items armados, ya pod&iacute;a ser de ayuda a mi equipo, noto que ninguno de ellos estaba en el mapa y el heraldo todav&iacute;a estaba en pie, as&iacute; que fui a wardearlo (cabe recalcar que estaba del lado rojo), y alli habian 3 de ellos con 200 de vida cada uno y el heraldo a 2 golpes, no llegue a robarlo, pero logre entrar y hacer tiempo suficiente para que Twisted Fate tire su ulti y Yasuo llegue, ah&iacute; fue me mataron de nuevo, pero le di 3 kills a mi equipo.\r\nSeguimos as&iacute;, poniendo huevos entre todos, nadie me critic&oacute; de mala manera si quiera, hacemos 2 tf en las que ganamos con p&eacute;rdidas insignificantes comparado con lo ganado, y entonces se fueron 3 a pushear top, yo y Sona est&aacute;bamos flanqueando para entrar por el lado de la jungla, pero ocurre algo, ellos entraron a pelear antes de tiempo, y los mataron, yo justo hab&iacute;a entrado y por suerte me lleve al menos al adc, qued&oacute; solo Sona defendiendo, fue un baj&oacute;n porque llegaron a tirarnos el Inhibidor central, pero Todos con buena cara, seguimos adelante, wardeamos el bar&oacute;n (Que gracias a dios no lo hicieron) y toda su parte izquierda de la jungla, los esperamos en un bush, y cuando llegan BUUUUM, patada furiosa y Yasuo se levanta 5 en el aire con su Ulti, fueron 5x1 en esa pelea, hicimos bar&oacute;n y llegamos a tirar su inhibidor central, y mientras backeabamos Entre todos en el chat dec&iacute;amos: &quot;Gj&quot; &quot;wp&quot; unos a otros, luego, ya vamos todos juntos para tratar de ganar de una vez, y de pronto, mientras wardeaba su jungla derecha, sale shaco a loco tratando de matarme, logr&eacute; escapar pero &eacute;l me persigui&oacute; hasta el R&iacute;o, cuando justo llega Sona para salvarme, lo ultea, le tiro mi q y puum, 1 abajo, el momento perfecto para pushear con el bar&oacute;n, todos mid, los forzamos a pelear, ganamos esa tf, solo su adc estaba en pie pero ya no pod&iacute;a hacer mucho estando solo, era un Kog Maw, y entonces Tiramos las torres del Nexo y despu&eacute;s el nexo de una manera Gloriosa!\r\n\r\nRecalco: Nadie me dijo ni a durante toda la partida, cuando alguien marcaba un error lo hac&iacute;a de manera simp&aacute;tica y con respeto, y quien comet&iacute;a el error respondi&oacute; &quot;si, tenes razon&quot; o cosas por el estilo\r\n\r\nPuede que el Sistema no de tantos frutos como uno espera, pero hoy, por esto, estoy seguro de que est&aacute; funcionando.\r\nAs&iacute; como cuando me quejo de &eacute;l por diversos hechos, hoy les agradezco!\r\n\r\nPara quienes les interese les dejo la certificada.\r\nhttp://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/342606553/200526669?tab=overview\r\n\r\nGracias por pasar! Saludos GMING96!","replies":[{"poster":"SharePain","date":"2016-06-27T03:37:02.649+0000","up_votes":2,"down_votes":0,"body":"para hacer un resumen aca te dejo un tema de Instalok que es MUY parecido a lo que te sucedio a ti \n\nhttps://www.youtube.com/watch?v=ekAF1PBPMYY","replies":[{"poster":"LemønPykë","date":"2016-06-27T17:58:35.942+0000","up_votes":1,"down_votes":0,"body":"WOW si hubiera visto antes ese video ni escribía en el post, y lo ponía jajajajaja, te juro que es muy parecido, al menos la situación. solo que yo era el afk, y el lee al mismo tiempo xD","replies":[]}]},{"poster":"Mascheranox","date":"2016-06-26T21:18:25.992+0000","up_votes":1,"down_votes":0,"body":"Era normal, te quiero ver en ranked si te pasa eso","replies":[]},{"poster":"Ks Erwyn","date":"2016-06-26T20:37:21.442+0000","up_votes":1,"down_votes":0,"body":"Te hubiera dicho un Gj y wp al final de la partida e igual te hubiera reportado...como corresponde xD","replies":[{"poster":"LemønPykë","date":"2016-06-26T21:05:40.688+0000","up_votes":1,"down_votes":0,"body":"y yo no me hubiera quejado de ello, estas en tu derecho","replies":[]}]},{"poster":"Revòlver Ocelot","date":"2016-06-26T20:37:16.131+0000","up_votes":1,"down_votes":0,"body":"Linda historia, me dieron ganas de volver a jugar lol +1","replies":[]},{"poster":"TeemoTankeTiamat","date":"2016-06-26T19:26:50.243+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Bienzahar","date":"2016-06-26T21:15:00.603+0000","up_votes":1,"down_votes":1,"body":"que paja leer, un resumen por favor?","replies":[]}]}