{"poster":"GE Falke","date":"2015-05-02T08:42:49.125+0000","title":"Picks und Bans","subforum":"Level Up: Guides & Tipps","up_votes":2,"down_votes":0,"body":"Fall 1:\r\nHey ich habe in letzter Zeit in meinen Picks und Bans oft Leute die Last Pick sind und dann schreiben &quot;pls let me mid,i cant jungle,i cant sup etc...&quot;\r\nZum beispiel ich picke als 4 und freue mich schon endlich wieder mal in die Mid zu gehen doch dann schreibt einer das er nicht Support spielen kann.\r\nZu mir selbst ich kann alle Rollen spielen aber ich bin mir nicht sicher ob es besser ist den Leuten die Lane &uuml;brig zu lassen.\r\n\r\nFall 2:\r\nDie Leute schreiben nichts in den Chat und meinen dann im Spiel &quot;shaco first time because i never jungle&quot;.Zur Zeit habe ich ganz viele Leute die es einfach nicht juckt was man f&uuml;r Champs pickt oder wie gut man sie kann.Zum Beispiel hatte ich letztens einen Ezreal Support mit Smite und haben gewonnen ist zwar sch&ouml;n aber man merkt das die Leute keine Lust haben zu spielen.\r\n\r\nDaher meine Frage an euch wie verhaltet ihr euch bei den Picks und Bans und gibt es gewisse Tricks? \r\n\r\nMfG GeFalke","replies":[{"poster":"RapunzeI","date":"2015-05-02T09:09:19.668+0000","up_votes":2,"down_votes":0,"body":"Moinsen,\nDer beste Trick ist grundsätzlich Cool bleiben. Das gilt prinzipiell, wenn man die Championselection betritt. =)\n\n**Zu Fall 1:**\n\n\n> Fall 1:\n> Hey ich habe in letzter Zeit in meinen Picks und Bans oft Leute die Last Pick sind und dann schreiben \"pls let me mid,i cant jungle,i cant sup etc...\"\n> Zum beispiel ich picke als 4 und freue mich schon endlich wieder mal in die Mid zu gehen doch dann schreibt einer das er nicht Support spielen kann.\n> Zu mir selbst ich kann alle Rollen spielen aber ich bin mir nicht sicher ob es besser ist den Leuten die Lane übrig zu lassen.\n\n\nEs kann besser sein den Leuten ihre Rolle zu überlassen, muss es aber nicht.\nDu sagst über dich selbst das Du alle Rollen kannst, jedoch ist davon auszugehen das Du eine der 5 Rollen am schlechtesten oder gar nicht kannst. (Bei mir wäre das zum Beispiel die Top Lane)\nWenn Du dann diese Lane pickst, um den anderen ihre Lanes zu überlassen, kann es sein das Du:\n a) die Lane und damit das Game verlierst **oder\n** \nb) nicht carrien kannst, da du nicht vertraut genug mit der Rolle bist. \nEs kann aber genau so gut passieren das der Typ, dem du die Lane gegeben hast, dich Carried. \n\n**Kurz gesagt:** Es kommt darauf an, wie wohl du dich auf der Ausweichposition fühlst. =)\n\n\n**Zu Fal l2 :**\n\n\n> Fall 2:\n> Die Leute schreiben nichts in den Chat und meinen dann im Spiel \"shaco first time because i never jungle\".Zur Zeit habe ich ganz viele Leute die es einfach nicht juckt was man für Champs pickt oder wie gut man sie kann.Zum Beispiel hatte ich letztens einen Ezreal Support mit Smite und haben gewonnen ist zwar schön aber man merkt das die Leute keine Lust haben zu spielen.\n\nAbwarten und Tee trinken. :D\nEs wird immer solche Leute geben und dagegen kann man nichts machen.\nAber um dich zu beruhigen, die Wahrscheinlichkeit das Sie im Gegnerteam sind ist größer, als dass die im eigenen Team sind.\nDu könntest solche Games in der Champselection verlassen, jedoch verlierst du nicht nur 3 Punkte, sondern es besteht noch die Chance, dass du gebannt wirst.\nAußerdem weißt du ja nicht ob, ihr das Spiel gewinnt oder verliert. Ich habe schon viel Games mit ''Trollen'' gewonnen. =)\n\n\nIch hoffe ich konnte dir ein wenig helfen und weiterhin viel Saß auf der Kluft. =)\nDein Rapunzel. =)\n\nP.S. Wenn du noch Fragen hast frag. =)","replies":[{"poster":"Derrish","date":"2015-05-02T13:17:06.571+0000","up_votes":2,"down_votes":0,"body":"> Du könntest solche Games in der Champselection verlassen, jedoch verlierst du nicht nur 3 Punkte, sondern es besteht noch die Chance, dass du gebannt wirst.\n\nWenn ich mich nicht irre wird man für das Verlassen im Auswahlbildschirm nicht gebannt, man bekommt nur die anwachsende Zeitstrafe, in der man die Warteschlange nicht wieder betreten kann sowie Punktverluste. Deckt sich auch mit der englischen Wiki.\n\n>  **Ranked solo queue game penalties**\n1. A time penalty for the player (see above).\n2. A League Points penalty is applied to the player who dodges, 3 points for the first time and 10 for the second time before the timer reset.\n3. In a Qualifier Series the penalty is 10 League Points and it will count as 1 loss, this will end your series if you were 1 loss away from losing it. \n4. You will not lose MMR for queue dodging.","replies":[{"poster":"RapunzeI","date":"2015-05-02T21:11:34.261+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nJe nachdem wie oft du leavst. =)\nAlso ich hab ein in der Freundesliste der für mehrere Monate eine Zeitstrafe hatte. :D\nWobei das ja, wenn man es genau nimmt, kein Ban ist. (Wieder spricht sich ja nicht mit dem was du sagst =) )\nAber bei ein-zwei Games ist das nicht schlimm :)","replies":[{"poster":"GE Falke","date":"2015-05-03T10:21:12.872+0000","up_votes":1,"down_votes":0,"body":"Ich bin halt so ein freundlicher Spieler der nie dodget...aber in letzter Zeit habe ich halt das Gefühl das,dass Game schon durch die Pick&Ban Phase verloren ist das traurige dabei ist ich war kurz vor Gold 2 und mittlerweile Gold V 0 LP was aber auch an der Meta liegt.\nDenn seitdem Cinderhulk Patch hab ich übelst viele Spiele verloren oder was mich auch immer frustriert hat das ich 1 Spiel gewinne 1 verliere und immer mehr LP verliere.\n\nEs ist halt total übertrieben wen man einen Mundo mit 5k HP sieht,der wie Usain Bolt rennt und sich dabei wieder hoch healt.\nUnd in meinen Teams habe ich halt oft Jungler die auf DMG bauen also kein Cinderhulk und dann hat man einfach keine Frontline die den ADC oder MID Laner peelen kann.Meiner Meinung nach ist die Pick und Ban Phase viel stressiger geworden durch den Cinderhulk patch.","replies":[{"poster":"RapunzeI","date":"2015-05-04T10:46:44.585+0000","up_votes":1,"down_votes":0,"body":"Ich dodge auch nicht gerne, aber du hast schon recht das manche Games schon in der Champselection verloren sind, oder es stark danach aussieht.\n\nJa ja die denk Meta, ein Traum für jeden Carry. ;D\nZugegeben diese Art von Meta mehr als die Assassinen-Meta, aber ich kann verstehen was man gegen sie hat.\n\nUnd zudem Frustriert sein:\nEs gibt nichts weswegen du frustriert sein musst, auch wenn ich es verstehen kann denn verlieren macht keinen Spaß =D \nWenn du einfach spielst kommen die Punkte von alleine. Hab selbst in Silber 3 festgesteckt und bin immer wieder mit der Einstellung rein das ich gewinnen muss. Hab diesen Gedankengang abgelegt und dann ging es Berg auf.\n\nNoch eine Frage frustet dich das Spiel allgemein oder nur wenn du verlierst?","replies":[{"poster":"GE Falke","date":"2015-05-04T16:45:33.892+0000","up_votes":1,"down_votes":0,"body":"Naja habe S4 ja mit Rankeds angefangen und war dann mit 100 Games+ in Silber 4 stecken geblieben und dann habe ich wirklich an meinen Fehler gearbeitet und bin in der Pre Season 5 von Silber 4 bis zu Gold 3 aufgestiegen.Dann in S5 Placements Silber IV eingestuft worden weil meine MMR nicht so pralle war und ich 2 von 10 gewonnen habe (und ich übelst schlecht gespielt habe).\nDann habe ich mich aber direkt hoch gespielt bis in Gold 3 wieder und jetzt halt Gold 5.\n\nWas mich halt frustriert ist,dass ich auf meinen Smurf direkt in Gold V eingestuft worden bin mit 4/6 (da ich in der Pre Season die Placements 8/10 beendet habe und direkt in Gold 3 kam und eine Platin V-IV MMR hatte).\n\nUnd daher kommt das Problem weil ich immer im Hintergrund denken muss,das ich mal ganz nah an Platin dran war und jetzt mittlerweile fast Silber wieder.Und in S4 oder in der Pre Season glaub ich war ich in einem Ranked Team (justforfun) wo alle Gold V-3 waren und was mich halt so begeistert ist,dass ein Spieler aus unseren damaligen Team jetzt schon beinahe Diamond ist.\n\nAlso,um nochmal zu deiner Frage zurück zu kommen,ich denke das ich zu 90% frustriert bin über mich manchmal,weil ich weiß wenn ich das und das anders gemacht hätte,dass wir vielleicht hätten gewinnen können und zu 10% sind es halt manchmal meine Teammates.Damals war ich nur am flamen wirklich jedes Game auch wenn wir gewonnen haben aber es verbessert sich mittlerweile,da ich freundlich mit meinen Teammates umgehe und viel dazu gerlernt habe.\n\nDas einzigste was mich halt an LoL hält ist,dass es ein Teamspiel ist,ich selbst spiele nähmlich Fußball im Reallife und dort ist es ja genauso wenn einer nur rummeckert das man das Spiel im Endeffekt schon verloren hat weil man sich nicht mehr 100% auf das wesentliche konzentriert.","replies":[]}]}]}]}]}]},{"poster":"AyRe CoNteMpT","date":"2015-05-02T11:05:16.136+0000","up_votes":3,"down_votes":1,"body":"du solltest keine angst haben zu dodgen. dodge öfter, macht das leben deutlich angenehmer.","replies":[]}]}