{"poster":"Flamé","date":"2018-10-08T07:03:38.559+0000","title":"Mis propios amigos me robaron","subforum":"Off-topic y temas personales","up_votes":8,"down_votes":3,"body":"Independientemente de que en teor&iacute;a no deber&iacute;amos dar informaci&oacute;n de nuestras cuentas, est&aacute; bien sabido que compartimos nuestras cuentas con amigos, hoy dudo considerarlos como tales. Ten&iacute;a unos 3600 RP de 12000 que hab&iacute;a cargado antes de que subieran los precios, use la app de amigos de lol para ver quienes estaban conectados para saber si pod&iacute;a hablar con alguien y me doy cuenta de que ten&iacute;a un icono que yo no hab&iacute;a comprado. Digo bueno quisa se bugeo as&iacute; que fui a OP.gg a ver si tambi&eacute;n pasaba, al darme cuenta de que aparece el mismo icono me entr&oacute; un miedo muy grande, saqu&eacute; la PC, la prendo y abro el lol. Al hacerlo me doy cuenta de que mi rp actual era de 1600 y ten&iacute;a 3 notificaci&oacute;n de apertura de regalo. Fui. Al historial de compras y vi que se regalaron skins (cajas supongo) y me compraron un icono. \r\nA qu&eacute; voy con este post? No espero solucionar nada ya que es un error m&iacute;o pero la bronca me puede y tengo que exteriorizar esto, me siento traicionado por mis propios amigos, robado y desepcionado. \r\nSi, no gastaron todo pero ten&iacute;a planeado que hacer con cada uno, hab&iacute;a calculado cuanto gastar y cuando hacerlo. Los odio lo juro los odio me siento s&uacute;per mal y al borde del puto llanto quisa no sea un gran problema para otras personas pero para m&iacute; actualmente es enorme ya que incluso hace poco me pas&oacute; algo similar.\r\nPreste mi cuenta a otro amigo que quer&iacute;a jugar en ella, unos 4 d&iacute;as despu&eacute;s logeo y tengo una restricci&oacute;n de chat de 10 partidas y mi honor 5 en 0, saqu&eacute; la restricci&oacute;n de chat y no dije nada porque tambi&eacute;n fue mi culpa. \r\n\r\nYa no molesto mas, si alguien se tom&oacute; el tiempo de leer esto gracias, pero no comenten cosas como &quot;te pasa por pelotudo&quot; etc etc ya lo s&eacute; atte un imbecil que va a dejar de confiar hasta en sus propios amigos.","replies":[{"poster":"Yoen","date":"2018-10-08T07:26:02.255+0000","up_votes":5,"down_votes":0,"body":"En primera instancia, las consecuencias\n**son debidamente  tu responsabilidad**.\n\nPor ello **se recuerda siempre **\nque no hay que prestar las cuentas bajo ningún concepto.\nPorque viola los términos de uso y es motivo para\nbanear esa cuenta, si se constata que fue así.\n\nEn el sentido moral, en mi opinión personal, no creo\nque sean amigos de confianza, mas bien son\namigos oportunistas o por interés.\n\nEn todo caso uno mismo es uno solo :)\n\nLamento que te haya pasado por eso,\n\nBuenas Noches","replies":[{"poster":"Flamé","date":"2018-10-08T14:40:59.451+0000","up_votes":2,"down_votes":0,"body":"Gracias por el comentario, realmente me siento desepcionado de ellos pero bueno, que se le va a hacer","replies":[]}]},{"poster":"diabetín","date":"2018-10-08T07:09:58.512+0000","up_votes":3,"down_votes":0,"body":"lo que podes hacer es mandar tiket al soporte y cambiar la contraseña cuanto antes, el baneo se va a quedar, fue tu culpa prestar tu cuenta, no debiste hacerlo... ahora lo que si podes hacer es cambiarle la contraseña antes que tu \"amigo\" te la permabanee, ah, y ver en soporte si podes reembolsar lo que te robaron en rp","replies":[{"poster":"Flamé","date":"2018-10-08T14:39:08.009+0000","up_votes":1,"down_votes":0,"body":"Veré qué hago pero por ahora principalmente cambio la pass","replies":[]}]},{"poster":"Errør 404","date":"2018-10-08T07:13:53.275+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=sadbøy flame,realm=LAS,application-id=J8qpiO2I,discussion-id=AENdyikx,comment-id=,timestamp=2018-10-08T07:03:38.559+0000)\n> \n> Ya no molesto mas, si alguien se tom&amp;oacute; el tiempo de leer esto gracias, pero no comenten cosas como &amp;quot;te pasa por pelotudo&amp;quot; etc etc ya lo s&amp;eacute; atte un imbecil que va a dejar de confiar hasta en sus propios amigos.\n\nNo te castigues tanto, todos cometemos errores, lo importante es aprender de ellos y no volver a tropezar con la misma piedra. :)\n\nNo estés mal, mejorate. Un saludo! n.n\n\n{{sticker:vlad-salute}}","replies":[{"poster":"Flamé","date":"2018-10-08T14:38:26.898+0000","up_votes":1,"down_votes":0,"body":"Gracias, use el foro como forma de descarga y la verdad sirvio. Gracias igualmente","replies":[]}]},{"poster":"Pliosaurio","date":"2018-10-08T17:38:46.681+0000","up_votes":2,"down_votes":0,"body":"Deberías haber revisado bien los **temas del soporte oficial** que casi nadie le presta atencion:\n\nhttps://support.riotgames.com/hc/es-419\n\n**O mas bien especifico.**\n\nhttps://support.riotgames.com/hc/es-419/articles/201751664-Protecci%C3%B3n-de-cuentas\n\nYa esta, era tu de tu responsabilidad de hacerlo o no, sigue para adelante.\n\nUn saludo, Atte.","replies":[]},{"poster":"GStarREV","date":"2018-10-08T12:58:54.477+0000","up_votes":2,"down_votes":0,"body":"Te pasa por pelotudo...................bueno no :v \n\nNo prestes tu cuenta pibe, no se puede confiar en nadie, ni en los amigos\n\n{{sticker:zombie-nunu-bummed}}","replies":[{"poster":"Flamé","date":"2018-10-08T14:39:53.057+0000","up_votes":1,"down_votes":0,"body":"{{item:3070}}  sad life","replies":[]}]},{"poster":"Bud Dicec","date":"2018-10-14T17:17:57.940+0000","up_votes":1,"down_votes":0,"body":"Bro, a mi mis amigos me robaron en el truco. No sos el unico. Feelsbadman","replies":[]},{"poster":"LaReinaPingüino","date":"2018-10-10T21:14:48.903+0000","up_votes":1,"down_votes":0,"body":"Compartir cuenta es baneable. \n\nQue uds lo hagan no es la norma. Diciendole al soporte esto te van a permabanear a ti x compartir la cuenta, mejor borra este post y cambia la contraseña y olvídate de esos sinvergüenzas. \n\n","replies":[]},{"poster":"Shulys","date":"2018-10-08T17:41:53.393+0000","up_votes":1,"down_votes":0,"body":"Amigo, si a mi me hicieran eso no los perdono. Voy alla y lo muelo a golpes.\n\nhttps://www.mememaker.net/api/bucket?path=static/img/memes/full/2014/Mar/24/13/agarrame-que-lo-mato.jpg\n\nIgual yo no le presto la cuenta ni a mis hermanos.","replies":[]},{"poster":"TheKiller Justin","date":"2018-10-08T15:00:25.850+0000","up_votes":1,"down_votes":0,"body":"Creería que está prohibido compartir cuentas, en parte, por estas cosas. \nSiento mucho lo que pasó.\nSi no lo hiciste ya, cambiá la contraseña, y ya sabrás que hacer con esos \"amigos\".\nAunque, me gustaría pensar que solo es una broma y luego te devuelven la plata o te compran ellos las skins.\n\nAl margen, sirve para aprender. Supongo que nunca volverás a compartir una cuenta con otra persona, por mas confianza que haya :v","replies":[]},{"poster":"Paradisco","date":"2018-10-08T14:47:10.467+0000","up_votes":1,"down_votes":0,"body":"Yo no hubiera posteado esto, ahora hay evidencia tangible de que compartis cuenta, lo cual es baneable","replies":[]},{"poster":"defiejfie","date":"2018-10-08T14:30:57.095+0000","up_votes":1,"down_votes":0,"body":"Pero esos \"Amigos\" los conoces en la vida real?","replies":[{"poster":"Flamé","date":"2018-10-08T14:37:07.302+0000","up_votes":1,"down_votes":0,"body":"Si, vengo jugando con ellos desde la s5","replies":[{"poster":"defiejfie","date":"2018-10-08T14:45:22.390+0000","up_votes":1,"down_votes":0,"body":"Bueno pues con mas razon debes enfrentarlos y decirles sobre el por que o almenos cobrarles por lo debido si tu te compraste todo el Rp con tu dinero lo que te hicieron tus amigos es Robo total hasta es denunciable","replies":[]}]}]},{"poster":"ghost134","date":"2018-10-08T11:15:18.941+0000","up_votes":1,"down_votes":1,"body":"Si, te entiendo. Yo tambien tenia un amigo al que le deposite toda mi confianza y al dia siguiente me traiciono.  Y yo ahi, muy impactado y desilucionado. Pero bueno, que se le va hacer?","replies":[]},{"poster":"Jinxie","date":"2018-10-08T07:16:45.697+0000","up_votes":3,"down_votes":3,"body":"HACELA CORTAAA CANCELA EL PAGOO.\nTE BANEAN A TI Y A ELLOS (QUE RECIBIERON EL REGALO)\nPERO QUE SE VAYAN BAN ESOS #$%*@&$","replies":[]}]}