{"poster":"CreepyBasterd","date":"2015-10-06T23:52:02.502+0000","title":"Aufstiegschancen in Silber / Riot Balancing","subforum":"Champions & Gameplay","up_votes":1,"down_votes":13,"body":"Hallo zusammen,\r\n\r\nErstma die Situation, was mit dem Thread meine und wir ihr das so seht:\r\nIch finde, in Silber ist die Spielerqualit&auml;t einfach katastrophal schlecht. Ich bin Main Sup und sicher kein Meister, aber regt mich einfach auf mir den Arsch aufzurei&szlig;en, keiner bedankt sich und wenn man mir es dankt, dann nur indem man zum 10ten Mal re-engaged und stirbt oder in den unwarded Jungle rennt weil man so greedy ist und stirbt.\r\nHabt ihr da &auml;hnliche Erfahrungen? Ich finde mein Skill passt einfach &uuml;berhaupt nicht in Silber bzw. 50% der Leute geh&ouml;ren einfach nach Bronze.\r\n\r\nZu mir:\r\nIch bin spiele seit April (also ziemlich genau als S5 angefangen hat) und spezialisiert auf Sup. Als zweites hab ich Jungle &quot;gelernt&quot;, wo ich Yi bevorzuge. Mittlerweile lerne ich aber grad auch andere Lanes / Champions, wie z.B. Amumu Jgl (ggf. Sup) und Malphite Top/Jgl. Ich priorisiere bei einem ranked nur das was ich wirklich kann, also Sup und Jgl.\r\nAls ich unranked war, hatte ich nur mit ner Freundin zusammen gezockt und wir haben ungef&auml;hr genauso viele Spiele gewonnen wie verloren, bei den Quali-Games hab ich 5/10 Gewonnen und bin Silber II geranked worden. Zuvor hab ich auch regelm&auml;&szlig;ig mit und gegen Gold, teilw. Platin gespielt. Da waren die Matchups wirklich ausgeglichen. So jetzt der Witz:\r\nAls ich dann Silber II geranked wurde, haben wir erstmal 10/11 verloren und bin direkt in Silber 3 abgesackt und es lag nicht an mir bzw. meine Stats waren in 6 der 11 Spiele absolute Win Stats. Da stehst du mit 0-6-22 und 71% Assistrate da, w&auml;hrend alle anderen mindestens 2 Deaths mehr haben, teilweise doppelt so viel.\r\n**Was soll man da machen?**\r\n\r\nDas krasseste bisher war 2-1 KD und ca. 30 Sups. Das regt mich einfach auf.\r\nUnd das schlimmste ist, dass in mindestens jedem 8-10 Game einer dabei ist, der das Game total versaut, als AFK, Fail/Trollpick, Midlane feed 0-8 etc.\r\n\r\n\r\nGanz ehrlich:\r\nIch habe keinen Bock mehr auf diesen Mist. Die ganze Silber Elo ist einfach schlecht gebalanced, Riot muss da einfach was machen. Soll sie von mir aus ne Wooden 1-10 einf&uuml;hren oder so, aber Silber ist total &uuml;berf&uuml;llt mit Newbies, Ahnungslosen, Flamern und Leuten die einfach nicht im Team spielen (und trotzdem verkacken). Riot l&auml;sst meine Stats v&ouml;llig au&szlig;er Acht, das einzige was z&auml;hlt sind Siege und Niederlagen und das ist katastrophal.\r\nWenn das so weiter geht h&ouml;r ich einfach auf mit LoL, weil mich das wirklich ankotzt.\r\nEs gibt auch viele Silber die ganz gut sind, aber das ist echt die Minderheit, und irgendwie sind die Vollpfosten in 75% der F&auml;lle im eigenen Team.\r\n\r\n\r\nDas schlimmste ist einfach: Es macht keinen Spa&szlig;.\r\nMan will ja irgendwo Competition haben und sich vergleichen, aber wenn man wirklich meistens nur Deppen im team hat, selbst wenn man DuoQ (Bot) geht, hast du keine Chance wenn Top und Mid Lane total zusammenbricht. Ich bin auch nicht gecarried worden, noch nie. Wenn ich normal zocke, sind die irgendwie viel ausgewogener. Aber ranked silber ist eine Katastrophe.","replies":[{"poster":"Lord Vilich","date":"2015-10-07T04:34:42.572+0000","up_votes":2,"down_votes":0,"body":"Wieso soll Silber schlecht gebalanced sein? Silber ist einfach nun mal kein hohes Niveau, wo man ständig gute Spieler trifft.","replies":[{"poster":"Alustus","date":"2015-10-07T07:29:37.062+0000","up_votes":2,"down_votes":0,"body":"Weil Leute immer alles andere Kritisieren bevor sie es bei sich selber machen. (zumindest sehr viele)","replies":[{"poster":"Sikn3ss","date":"2015-10-07T07:49:47.344+0000","up_votes":1,"down_votes":1,"body":"Da kann man nichts anderes erwarten. Es sind immer die anderen die schlecht sind selber spielt man doch immer perfekt ;)","replies":[{"poster":"Alustus","date":"2015-10-07T07:59:28.851+0000","up_votes":7,"down_votes":0,"body":"Na klar eig. wäre ich Rang 1 in Challanger, aber meine Teammate sind einfach immer so schlecht und Sabotieren mich genauso wie das Matchmaking ;D\n(Ne die Meisten Silber Spieler denken ja nur das sie high Gold oder Platin wären, da sie diese öfters in Normal games besiegen :D)","replies":[]}]},{"poster":"Lord Vilich","date":"2015-10-07T07:37:29.992+0000","up_votes":1,"down_votes":0,"body":"Sowas triffst du in jeder Liga. Das hat doch nichts mit Silber zu tun.","replies":[{"poster":"Alustus","date":"2015-10-07T07:55:05.422+0000","up_votes":1,"down_votes":0,"body":"Ja ich wollte ja nicht sagen das Silber schlecht gebalanced ist.\nIch wollte nur erklären warum so viele Heulen. (ist vllt ewas unklar gewesen)\n\nEs gibt eben mehr Silber Spieler als Platin/Dia  = mehr Threads aus Silber.\n\n\nAußerdem behaupte ich das die höheren divisionen ein bisschen selbst kritischer sind, was nicht heißen soll das sie andere weniger kritisieren sondern auch sich selber und somit auch öfters verstehen, dass nicht nur das Matchmaking oder die Teammates das Problem sind.\nAuch wenn diese Trotzdem noch existieren.","replies":[]}]}]}]},{"poster":"NoxusKiller","date":"2015-10-07T01:05:52.502+0000","up_votes":6,"down_votes":0,"body":"Noch ein kleiner TIpp. Soraka ist absolut kein Champ um solo aufzusteigen. Sie ist ein Champ was das Team unterstützt, die \"plays\" müssen sie machen. Sprich deine Heals können noch so gut platziert sein, wenn die Vayne in 5 leute reinspringt zerplatzt sie. Falls du SOraka weiter spielen möchtest solltest du dir nen adc für duoq zulegen. Ansonsten gibt es noch einige Playmaker in der Supporter Rolle. Braum, Thresh(sehr zu empfehlen, da du greedy Spieler mit der lantern safen kannst), leona. Grundsätzlich Supporter die Selbst einen Kampf starten können oder ihn drehen können. \nDabei ist Kommunikation natürlich wichtig, schau wo man Objectives nehmen kann, wo ein Kill möglich ist und ping es oder schreib es. Und wenn du die pings spammen musst. \nEntscheidend ist aber vor allem der Spaß am Spiel, denn das ist es schlußendlich. Wenn dich soloq aufregt spiel es nicht, beschäftig dich anders. Sobald die Lust wieder kommt dann hast du auch ein viel besseres Mindset um weiter zu spielen. \nHab mir auch mal die stats deiner Teamkameraden angeschaut. So eine Irelia mit 19/6, Vlad mit 12/2 oder eine Tris mit 14/7 sollten eigentlich die kills dadurch bekommen haben dass sie carryin ;). Klar kann es frustrierend sein mal games mit leuten zu haben die gerade nen schlechten Moment haben, aber zu sagen dass du nur Deppen im Ranked hast ist ne Übertreibung. Da brauch ich nur auf deinen Spielverlauf schauen. \nWhups ist doch ein kleiner Wall of Text geworden. Hoffe du hast viel Glück im Ranked. Aber vor allem Spaß.","replies":[{"poster":"CreepyBasterd","date":"2015-10-07T19:44:45.200+0000","up_votes":1,"down_votes":1,"body":"Danke für die Antwort, ist sehr hilfreich :)","replies":[]}]},{"poster":"Kelomat","date":"2015-10-07T09:52:04.630+0000","up_votes":5,"down_votes":0,"body":"Das \"Problem\" an Silber ist, dass fast jeder dort einsteigt. Sowohl die, die nach Bronze gehören, als auch die anderen, die nur auf Durchreise sind. Das könnte der Grund für diese \"Balance\"-Wahrnehmung sein. Mal hast du die Bronze-Spieler, mal die besseren (nur das man meistens die schlimmen Games in Erinnerung behält und bei Siegen selten nachguckt, wer da bei den Gegnern reingefeedet hat).","replies":[]},{"poster":"MeDontEnglish","date":"2015-10-07T00:04:20.986+0000","up_votes":1,"down_votes":0,"body":"Silber finde ich ist echt die schlimmste Elo, da da so ein mix aus Gold und Bronze rumläuft..\n\nAber da musst du durch, ich leide mit dir, bin S2...\n\nDu hast halt als Supp das Problem, dass du keine wirkliche \" Carry \" Position hast.\nDas macht den Win nun mal sehr von deinen Mitspielern abhängig..","replies":[{"poster":"Shadowscreen","date":"2015-10-07T07:03:17.055+0000","up_votes":1,"down_votes":0,"body":"Wenn du auch Silver  bist, wie kannst du den Schluss ziehen, dass es die schlimmste ELO ist wenn du gold / plat / dia etc noch nicht erlebt hast?\nIch meine **bisher schlimmste ** ELO war Plat und da war meine Zeit in Silver echt nen Zuckerschlecken gegen.\n\nUnd jetzt zu meinem eigentlichen  Punkt,\nder Sup kann sehr wohl carrien!\nDie Zeiten in der der Sup ein purer ward Verteiler war sind vorbei.","replies":[{"poster":"Sirrkas","date":"2015-10-07T09:37:07.424+0000","up_votes":4,"down_votes":0,"body":"Das schlimmste Ranked das ich bisher hatte, war letzte Season als ich auch Gold 3 war und 4 Platin V Spieler im Team hatte. Die haben von Anfang an sich durchgehend gegenseitig \"you don´t belong to platin\" und dergleichen geschrieben. Als das Spiel vorbei war und sie gesehen habe, dass ich \"nur\" Gold war, kamen sofort ein paar Kommentare wie \"No wonder we lost, we got a goldplayer\" (Die Gegner waren allesamt nur Gold 1 und 2).\n\nIch schätze mal die waren gerade am absteigen.","replies":[{"poster":"Shadowscreen","date":"2015-10-07T11:46:03.252+0000","up_votes":2,"down_votes":0,"body":"Naja klar, die Arroganz die in Platin herrscht ist einfach unübertroffen sofern ich das bisher gehört habe.\n\nFreunde von mir behaupten, dass es in Dia schon wieder anders aussieht und da (meistens jedenfalls) auch der Skill von anderen anerkannt wird und weniger Leute sich für was überlegenes halten.","replies":[]}]},{"poster":"MeDontEnglish","date":"2015-10-07T12:06:45.461+0000","up_votes":1,"down_votes":0,"body":"In Platin ist denke ich das gleiche Problem, nur höher.\n\nPlatin Leute sind fühlen sich so eingebildet vor Gold aber sind zu schlecht für Dia..\n\nIch habe nicht gesagt, dass man mit Supp gar nicht carrien kann, aber mit anderen Positionen geht es einfach besser.","replies":[{"poster":"Ashuna","date":"2015-10-07T12:12:21.426+0000","up_votes":3,"down_votes":1,"body":"Ich finde das es der Toplaner am schwersten hat ein Spiel zu carryn. Der Supporter hat sogar richtig viel einfluss aufs Spiel. :)\n\nmfg Ashuna {{champion:1}}","replies":[]}]},{"poster":"Powerjen","date":"2015-10-07T12:26:40.779+0000","up_votes":1,"down_votes":0,"body":"> Die Zeiten in der der Sup ein purer ward Verteiler war sind vorbei.\n\nAber diese Denke dominiert in Silber noch.","replies":[{"poster":"Ashuna","date":"2015-10-07T12:30:54.514+0000","up_votes":2,"down_votes":1,"body":">Aber diese Denke dominiert in Silber noch.\n\nGlaub mir mal, nicht nur in Silber. ;-)\n\nmfg Ashuna {{champion:1}}","replies":[]}]}]}]},{"poster":"Sirrkas","date":"2015-10-07T00:13:33.612+0000","up_votes":5,"down_votes":1,"body":"Vielleicht solltest du beim Jungeln mit Yi keinen Sightstone mehr kaufen, sondern stattdessen das Trinket erweitern. Damit kann man ebenfalls permanent 3 Wards platziert haben, es ist günstiger und braucht keinen Itemslot.","replies":[{"poster":"MrHeash","date":"2015-10-07T01:22:35.409+0000","up_votes":4,"down_votes":0,"body":"Damit kommt man bestimmt instant aus Silber raus^^","replies":[]}]},{"poster":"Sikn3ss","date":"2015-10-07T07:18:30.344+0000","up_votes":1,"down_votes":5,"body":"Geht mir genau so ich habe dieses Jahr angefangen LoL zu spielen und habe vor ca 3 Monaten mit Ranked angefangen. 4/6 in den Placements bin Silber 3 eingeranked worden. So weit so gut ich war recht zufrieden. Bis ich dann angefangen habe weiter zu machen. Jedes Game ein feeder/Afk/Troll solche Leute machens einfach kaputt und komischerweise hat immer das Gegner Team super mates die zusammenarbeiten. Ich Flame nie in den Spielen und wen ich sehe jemand gibt early kills ab versuche ich nett zu überzeugen Safe zu spielen und einfach unter dem Tower zu farmen und trotzdem gehen die Leute noch full ham mit 0/5 stats.. naja mittlerweile Silver 5 angekommen ich bin Main Jungle und hab eig immer positive stats.. Kann man nichts machen :/","replies":[{"poster":"Andrej553","date":"2015-10-07T09:05:05.264+0000","up_votes":1,"down_votes":0,"body":"Du hast so viele Spiele mit Champs die du nur 1-2 Spiele im ranked gespielt hast und in beinahe allen davon hast ziemlich gefeedet.\nVi 1,5 zu 6,5\nshyvana 1,5 zu 7 etc etc\n\nselbst in den Spielen in denen du gute Stats hast sind sie nicht überragend. Nur\nNocturn 7,8 zu 5 ist gut.","replies":[{"poster":"CreepyBasterd","date":"2015-10-08T01:05:34.019+0000","up_votes":1,"down_votes":1,"body":"Stats sagen nicht direkt aus, dass man schlecht gespielt hat. Ich musste eben auch Ashe ADC gehen, weil alle anderen wieder meinen Top, Jgl und Sup wegpicken zu müssen. Da stand ich dann auch iwie 9-8-17. Davon waren 4 Kills aber mehr oder weniger luck bzw. gestealt.\nMan müsste schon den dmg output vergleichen und wenn das Team gefeedet ist wie er sagt, haste einfach keine Chance mehr.","replies":[{"poster":"Andrej553","date":"2015-10-08T11:49:56.563+0000","up_votes":2,"down_votes":0,"body":"Korrekt, seine Aussage war aber:\n\n> ... und hab eig immer positive stats...\n\nund dem ist nicht so.\n\n\nIch wollte damit nur aufzeigen, dass es sehr wohl etwas bereits an der Champmechanik für ihn zu verbessern gibt. Mapawareness etc lässt sich aus Stats noch schlechter rauslesen.","replies":[]},{"poster":"Lematique","date":"2015-10-09T05:25:51.556+0000","up_votes":1,"down_votes":0,"body":"Wieso denn \"weil alle anderen wieder meinen etwas wegzupicken\"? Was ist denn das für ne Einstellung?\nEs gibt halt nunmal mehrere Leute, die gerne dieselbe Rolle spielen. Da würd ich doch nicht von \"wegpicken\" reden. Und wenn du als Last Pick sagst, du möchtest gern Supp, aber der first pick ist schon Main supp, na dann ist das eben so. Genau darum sollte man ja nicht auf nur einer Lane der King sein und in den anderen reinfeeden, sondern alle möglichst lernen. (Kannst ja trotzdem in einer Rolle perfekt sein)\n\nZumindest, wenn du nicht in so eine Situation geraten möchtest. Ich spiele kein Ranked, einerseits wegen den Internetproblemen derzeit ^^ und andererseits, weil ich z.B. als ADC einfach nur nutzlos bin. Wenn ich wieder Ranked spiele, möchte ich aber am liebsten selbstverständlich aufsteigen. Und das geschieht mit Sicherheit nicht, wenn ich plötzlich ADC sein muss und von tuten und blasen keine Ahnung habe. Die Situation möcht ich vermeiden.","replies":[]}]},{"poster":"Sikn3ss","date":"2015-10-07T14:41:47.271+0000","up_votes":1,"down_votes":2,"body":"Ja logo ich habe auch nie behauptet das ich in gewissen Spielen nicht selbst schlechte Leistung erbringe solche Tage hat jeder. Bin schluss endlich auch noch sehr unerfahren mit meiner Anzahl an Spielen generell.\n\nDie nicht überragenden Stats von denen du redest, klar wie will man auch lange \"gute\" stats halten wenn das gefeedete Team jeden Teamfight einfach rippen kann, irgendwann wird man halt selber gefarmt.\n\nAber wie gesagt ich flame die \"feeder\" nicht eher versuche ich zu sagen safe zu bleiben ging in meinem Kommentar mehr darum das gewisse Leute nicht verstehen wann anzufangen defensiv zu spielen und nicht unnötig weiter feeden.","replies":[]}]}]},{"poster":"Lagbeard","date":"2015-10-07T10:24:14.958+0000","up_votes":1,"down_votes":0,"body":"Vielleicht überschätzt du die Silberliga auch. Es ist immer noch die zweitniedrigste.","replies":[{"poster":"Stealth Cat","date":"2015-10-07T15:45:18.028+0000","up_votes":1,"down_votes":0,"body":"Naja du musst bedenken dass 60-70% der Spieler Silber oder niedriger sind und der Durchschnitt Silber II ist.","replies":[{"poster":"Lagbeard","date":"2015-10-08T09:34:03.395+0000","up_votes":1,"down_votes":0,"body":"Ja. Wenn das Spielniveau in diesem Bereich liegt, ist das wohl so. Ich bin selbst S I, und mache noch die übelsten Fehler. Teilweise null Mapawareness, facechecking, absolute Failengages.... Ich glaube, dass ich schon auf Silberniveau Spiele, aber ich galube nicht, dass dieses Niveau besonders hoch ist.","replies":[{"poster":"Stealth Cat","date":"2015-10-08T11:23:45.497+0000","up_votes":1,"down_votes":0,"body":"Niemand spielt perfekt, nur umso niedriger die Liga ist, umso höher ist die Anzahl der Fehler.","replies":[{"poster":"Lagbeard","date":"2015-10-08T15:13:16.884+0000","up_votes":1,"down_votes":0,"body":"Eben darauf will doch die ganze Zeit hinaus :D","replies":[{"poster":"Stealth Cat","date":"2015-10-08T16:44:52.017+0000","up_votes":1,"down_votes":0,"body":"Wollte von Anfang an eigentlich nur sagen, dass \"die zweitniedrigste\" etwas übertrieben klingt, wenn man bedenkt, dass mehr als 2 Drittel der Spieler dort oder niedriger sind.","replies":[{"poster":"Lagbeard","date":"2015-10-08T17:05:37.594+0000","up_votes":1,"down_votes":1,"body":"Ich weiß... aber ich total unzufrieden mit mir :D für mich klingt Silber wie \"gerade mal eben so nicht Bronze\" ^^","replies":[]}]}]}]}]}]}]},{"poster":"Imaqtone","date":"2015-10-07T12:41:29.056+0000","up_votes":1,"down_votes":0,"body":"Silber ist nicht schlecht gebalanced... ganz und gar nicht, es ist auch einfach dort rauszukommen. Man muss nur besser spielen. Und Trolls und Afk´s gibt es so gut wie überall. \nBtw. Mit Soraka ist es echt schwer Solo zu Carrien. Mit Allistar geht das deutlich besser. Oder Amumu Jungle. Mit CC kommt keiner in Bronze- Silber zurecht","replies":[]},{"poster":"CreepyBasterd","date":"2015-10-08T22:21:47.435+0000","up_votes":1,"down_votes":1,"body":"Grad wieder nen Game gehabt wo der gegnerisch Yasuo AFK war und man trotzdem verloren hat.\nBrauch man einfach nichts zu sagen. Der ADC war 5 min AFK und konnte GAR NICHTS. Der hat gespielt, als wär das erst das 10 mal LoL Match oder so. Farm: Kalista 54, Caitlyn 9. Sowas gehört aus Silber gebannt ernsthaft. Kalista wurde einfach von Caitlyn und Veigar Mid zu Tode gefeedet.\n\nDAS meine ich mit, Silber ist schlecht gebalanced.","replies":[]},{"poster":"haha weed lol xd","date":"2015-10-07T10:39:47.658+0000","up_votes":2,"down_votes":2,"body":"Ich denke mal Silber kann man als Treppe zwichen Gold und Bronze ansehen. \nMan sieht wirklich gute Leute, die einfach zu faul für Rankeds sind und ins Hohe Gold - Lowe Plat gehören, man sieht überdurchschnittlich gute Spieler die zu 100 % Gold Niveau spielen und man sieht halt diejenigen, die Bronze gehören so hart es klingt. \n\nLeute fangen so langsam an, ihre Items situationsbedingt zu bauen, probieren und erlernen neue Taktiken usw. Es ist eben die schwerste Treppe und mMn die größte Elo-Hölle. Das heißt aber nicht, dass die anderen Ligen keine Elo-Hells sind :D Ganz im Gegenteil. \n\nIch denke mal, durch die wachsene Erfahrung der Silberspieler, spalten sich ein Großteil der Masse ab und ist in der Tat besser als der Rest. Durch Guides, YouTube und Twitch ist es leichter LoL zu lernen und man wird auch deutlich besser. Leider werden viele dadurch auch zu Besserwisser. Ich denke mal der Hauptgrund warum viele Low-Elo Spiele verloren werden ist, dass sie viel zu schnell und leicht den Faden verlieren. \n\nDer Account hier ist mein Smurf und ich zieh den grade Gold hoch. Hatte vor kurzem ein Spiel, in dem Shen Toplane einen Yasuo stark gefeedet hat und alle anderen Teammitglieder sofort kamen mit \" GG its lost, fed Yasuo \". \nDabei haben die übersehen, dass das Gegnerteam full AD war. Ich habe ihnen also klar gemacht, dass noch nichts verloren ist, dass wir uns konzentrieren müssen und als Team zusammen spielen. \nWir haben das Game schlußendlich relativ einfach gewonnen. \n\nDie nächste kommt dann wieder ab Platin. Dort denken alle, sie wären Dia-Master Götter, flamen dich zu, spielen viel zu greedy weil sie sich selbst überschätzen und wollen alles besser wissen.\n\nSilber ist nunmal die Einsteiger Division ( die Elo fängt immer ab 1200 sprich Silber 5 an ). Wenn man sich nicht ganz dumm anstellt, dann kommt man auch S5, auch wenn man rein Skilltechnich nicht da hin gehört. \n\n>Zu mir:\nIch bin spiele seit April (also ziemlich genau als S5 angefangen hat) und spezialisiert auf Sup. Als zweites hab ich Jungle \"gelernt\", wo ich Yi bevorzuge. Mittlerweile lerne ich aber grad auch andere Lanes / Champions, wie z.B. Amumu Jgl (ggf. Sup) und Malphite Top/Jgl. Ich priorisiere bei einem ranked nur das was ich wirklich kann, also Sup und Jgl. \n>Ich finde mein Skill passt einfach überhaupt nicht in Silber bzw. 50% der Leute gehören einfach nach Bronze.\n\nIch finde, mit einer Erfahrung von 6 Monaten ist Silber der Platz wo du dich am wohlsten fühlen solltest. Dass es genug \" Bronzespieler \" in Silber gibt, das ist ein anderes Thema.","replies":[{"poster":"CreepyBasterd","date":"2015-10-07T20:04:00.067+0000","up_votes":1,"down_votes":1,"body":"Ja ich denke auch, dass es gut sein kann das ich Silber bin. Ich hätte ja auch kein Problem damit, wenn alle wenigstens ernsthaft versuchen zu spielen. Aber viele spielen einfach wie in einem Normal oder teilweise sogar echt wie in Bot Games, einfach drauf und sterben.\nDa sehe ich halt nen Kritikpunkt, wo Riot gucken sollte, dass man diese hohe Konzentration an Spielern in Silber weiter aufteilt.","replies":[]}]},{"poster":"CreepyBasterd","date":"2015-10-07T20:01:41.106+0000","up_votes":1,"down_votes":1,"body":"Danke fürs Feedback.\nIch würde ja nie behaupten, dass ich Platin spiele oder so, dafür kann ich viel zu wenig Champs/Lanes. Ich bin einfach nur ein guter Silberplayer oder vermutlich auch unteres Gold mit meinem Main aktuell, wird mir manchmal auch gesagt ingame. Besonders die Leute die gut sind, mit denen kann man auch ne richtige Synergie eingehen weil die wirklich MIT DIR spielen und man selbst nich FÜR SIE. Da werd auch gesaved wenn ich im ganzen Game 2 schlechte Positionings hatte.\n\nDie Leute bilden sich das ja nicht ein und ich hab schon 3-4 Platin Leute in der FList die auch meinen, dass Silber halt am schwierigsten rauszukommen. Ich finde nur Riot sollte sich damit vllt. mal auseinandersetzen, weil ich kB habe mich von anderen Smurfs carrien zu lassen. Ich will ja selber aufsteigen.\n\nNur wenn man dann alles macht und die Games mitansehen muss, wie da engaged wird oder einfach von meinem Heal weggerannt wird statt 1sek zurückzulaufen und erst dann erneut zu engagen... ist einfach frustrierend. Und wie gesagt: Das ist nich ein paar Mal so, das ist wirklich in fast jedem Spiel so, also würden sie alle was neues ausprobieren und keine Ahnung haben. Ich versuche schon die Leute das ganze Game vor Deaths zu bewahren aber ihre Greedyness > mein Heal + Flash + Ult + E-disengage + runspeed (Aufstiegsamulett). Das ist bei guten Spielern nie der Fall, da kann ich mich auch noch auf andere Dinge konzentrieren.\n\nDas ist bei mindestens jedem 2ten Spiel der Fall, null Synergie, die Leute hacken auf dem Jgl rum wenn sie als Viktor Top 0-5 gegen Riven stehen usw. Keiner konzentriert sich wirklich aufs Spiel oder trollt einfach, flamed, feedet / solo moves.\nAber ich hab ja schon ein paar Anregungen bekommen.","replies":[]}]}