{"poster":"TOP 10 N WORDS","date":"2015-05-09T02:18:46.094+0000","title":"La solución a las peleas por lanes :D","subforum":"Charlas Generales","up_votes":4,"down_votes":3,"body":"Es algo muy b&aacute;sico y  la verdad es que no tengo idea de porque nunca se esforzaron en esto, adem&aacute;s de que no creo que lleve mucho trabajo. Podr&iacute;amos tener por favor un chat DECENTE en la sala de elecci&oacute;n, uno que no var&iacute;e desde el punto de vista de cada jugador, sino que todos vean lo mismo ya que muchas veces me paso (a todos seguro) que 2 personas en mi equipo pelean por la misma linea y ven diferente el orden en el que piden la linea, o siempre est&aacute;n con la excusa &quot;yo entre primero&quot;, creo que ya despu&eacute;s de estar tantos a&ntilde;os con ese problema, es tiempo de ponerle un fin , no? Creo que ser&iacute;a una buena iniciativa para poder acabar con tantos instalock {{champion:19}}","replies":[{"poster":"Desaroll","date":"2015-05-09T02:20:39.032+0000","up_votes":6,"down_votes":0,"body":"Lo que hicieron para terminar con esas peleas es poner el organizador de equipos.\n\nSi tienen problemas para clavar un clavo con una pinza, les dan un martillo, y ellos siguen usando la pinza, no pretendan que mejoren la pinza para que puedan clavar el maldito clavo.\n\nSuerte.","replies":[{"poster":"ALEXKOND","date":"2015-05-09T02:38:54.507+0000","up_votes":2,"down_votes":0,"body":"Iba a decir lo mismo. No vendría mal más gente en el creador de equipos de paso.","replies":[{"poster":"ZanahoriaAsesina","date":"2015-05-09T02:59:11.194+0000","up_votes":2,"down_votes":0,"body":"Los que juegan normales sin el organizador de equipos son masoquistas o sádicos que les gusta ver peleas o vivirlas todos lo días (?) es exactamente como escribió **Desaroll**.\n\nSaludos!","replies":[{"poster":"NOOB SLAYER","date":"2015-05-09T05:49:15.792+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kone18,realm=LAS,application-id=v7qsfXsE,discussion-id=EWBcw2pK,comment-id=000000000000,timestamp=2015-05-09T02:59:11.194+0000)\n>\n> Los que juegan normales sin el organizador de equipos son masoquistas o sádicos que les gusta ver peleas o vivirlas todos lo días (?) es exactamente como escribió **Desaroll**.\n> \n> Saludos!\n\nDeberian Hacer las normales y el creador de equipo uno solo asi las partidas se encontrarian mas rapido y todos seriamos felices..chao instalock y chao peleas y todo seria mucho mas rapido :D","replies":[{"poster":"kique1","date":"2015-05-09T07:00:19.406+0000","up_votes":1,"down_votes":0,"body":"Claro, y nadie querría ir support y las colas para emparejar serían eternas...","replies":[{"poster":"ALEXKOND","date":"2015-05-09T14:09:07.375+0000","up_votes":1,"down_votes":0,"body":"Porque nada mejor que obligar a alguien que no quiere ir soporte cuando no quiere. Luego trollea o lo flammean por un mal desempeño y terminan preguntandose \"¿Por que nadie quiere ir soporte?\"\n\nSi te molestan los tiempos de espera, vos podes ir soporte o jungla que por lo general son los que tardan en encontrarse, te aseguro que en menos de 3 minutos encontras un equipo.","replies":[{"poster":"kique1","date":"2015-05-09T23:37:31.019+0000","up_votes":1,"down_votes":0,"body":"Ya, pero a mí no me gusta jugar de supp, a los que les guste que vayan, pero estoy seguro que no son ni el 20% de LAS","replies":[{"poster":"ALEXKOND","date":"2015-05-10T00:27:43.864+0000","up_votes":1,"down_votes":0,"body":"Exactamente lo que te estoy diciendo ¿Te gustaría que te obligaran a ir soporte? Obviamente no. El creador de equipos es una excelente herramienta para que todo el mundo vaya el campeón que le gusta en la línea que le gusta ¿Se acaba el trolleo? No, los trolls siempre van a existir pero al menos ya no lo van a hacer por no poder ir lo que querían.\nIrónicamente, mucha gente cree que los tiempos de espera son \"eternos\" cuando en realidad es 1 o 2 minutos más respecto a los normales. Debido a eso no entran en cola de Creador y eso hace que tarde un poco más. Solo hace falta que la gente se quite ese \"miedo\" al creador y te aseguro que los tiempos van a ser iguales que en las normales.\nPor último, no tengo idea de donde sacas ese dato, yo te puedo decir que el 60% de los jugadores quieren ir de soporte y solo pasa a ser mi palabra contra la tuya.","replies":[{"poster":"kique1","date":"2015-05-10T02:11:20.910+0000","up_votes":1,"down_votes":0,"body":"Créeme que he estado en el creador de equipos por lo menos 10 minutos y sin completar emparejamiento, y eso que yo mismo voy de support. El sistema es malo y lento. \n\nY además, cómo vas a pretender que un lvl 1 que no sabe nada del juego vaya a jugar support? Simplemente no van a elegir ese rol hasta que lo conozcan y aprendan a jugar, pero vamos... que muchos lvl 30 todavía no lo saben hacer, tengo amigos que lo único que juegan es mid o top...","replies":[]}]},{"poster":"BlackStarDark","date":"2015-05-10T00:13:35.615+0000","up_votes":1,"down_votes":0,"body":"personalmente maineo Support y juego muy seguido en el Team Builder.\nDe todos modos, jugando en Blind Pick sigue siendo rentable, puesto que casi nadie juega support.","replies":[{"poster":"ALEXKOND","date":"2015-05-10T00:22:05.012+0000","up_votes":1,"down_votes":0,"body":"Sabias palabras de un hermano soporte","replies":[]}]}]}]},{"poster":"NOOB SLAYER","date":"2015-05-09T14:53:22.813+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kique1,realm=LAS,application-id=v7qsfXsE,discussion-id=EWBcw2pK,comment-id=00000000000000000000,timestamp=2015-05-09T07:00:19.406+0000)\n>\n> Claro, y nadie querría ir support y las colas para emparejar serían eternas...\n\nYo tengo varios amigos que les gusta ir soporte, dicen que juegan mejor en bot que en otras lineas :)","replies":[]}]}]}]}]}]},{"poster":"RNGesus","date":"2015-05-09T14:47:15.573+0000","up_votes":2,"down_votes":0,"body":"El blind esta pensado para otro tipo de comunidad...deberian quitarlo , dejar el draft y el creador de equipos nomas","replies":[]},{"poster":"LaReinaPingüino","date":"2015-05-11T01:09:17.672+0000","up_votes":1,"down_votes":0,"body":"yo si voy de soporte, tengo 3 soportes a karma jana y sona, ademas siempre hay suports gratis, please usen el creador de equipos, no sean tan impacientes, a mi no se me demora tanto e inviten a sus amigos en el servidor gringo no hay problemas con el creador de equipos porque lo usan y no se demora tanto eso de que nadie quiere ir de suport es un prejuicio de gente impaciente o gente que intento muy pocas veces o en horas malas (como martes a las 11 de la noche)","replies":[]},{"poster":"Runth","date":"2015-05-10T00:30:00.297+0000","up_votes":1,"down_votes":0,"body":"Voy soporte, pierdo como 5 partidas en 1","replies":[]},{"poster":"Rvillena","date":"2015-05-09T15:56:25.143+0000","up_votes":1,"down_votes":0,"body":"Yo pondría un detector de palabras en la sala, asi cuando alguien pide una linea, el juego le reconoce y lo pone en una seccion de la pantalla donde todos puedan verla.{{summoner:13}}","replies":[]},{"poster":"SilentRado","date":"2015-05-09T07:28:44.216+0000","up_votes":1,"down_votes":0,"body":"Se va a cambiar el meta a doble adc en bot lane antes de que saquen la cola \"normal\" de partidas :(","replies":[]},{"poster":"kique1","date":"2015-05-09T07:06:32.337+0000","up_votes":1,"down_votes":0,"body":"Es que, de partida no tendrían que haber peleas para ganar una línea, la fase de selección está pensada para organizarse y ver quién va a cuál línea. De hecho es bastante rata eso de cantar rápido para ganar línea, el ideal sería que todos eligieran su línea dialogando de forma civilizada y si alguien se empecina por ir a una línea, mejor dejársela... y si alguien instalockea se le puede reportar al final del juego por negarse a mantener comunicación...","replies":[]},{"poster":"Hwaxinghz","date":"2015-05-09T14:18:06.583+0000","up_votes":1,"down_votes":1,"body":"Bueno, muchos dicen \"Para algo existe el creador de equipos, es una herramienta para evitar esos problemas blablabla\" demora unos 20 minutos encontrar soporte y encima cuando lo encuentra se va afk.\nEl creador de equipos está bueno, pero nadie tiene en cuenta que mientras esté el blind pick nadie lo usa, y si hay gente, como yo que intenta jugar en él, siempre que quieres ir un rol distinto a Jungla o Soporte te demora 20 minutos encontrar equipo que encima le falta jungla y soporte (otros 10-15 minutos mas), no se pero a nadie le gusta ir soporte por lo que veo, recién jugué una partida 3 vs 5 porque a uno se le dio por instalockear Evelyn jungla y ya antes un Nocturne había ganado dicha línea (blind pick hablo) y había instalockeado, quedando así yo solo en bot y el mid un flammer asqueroso (no hay otra palabra para decirlo) se dedicó a trollear, pero claro, encima los enemigos te ponen gg izi, bueno, esos problemas con el emparejamiento obviamente se solucionarían con el creador de equipos, pero volviendo a lo mismo, quien se va a dignar a ir soporte? los únicos soportes que se encuentran rara vez son en aquellos casos donde está free Tresh (sin contar esta vez, al parecer nadie lo prueba), free Blitzcrank, Karma, Nami, etc. No puede ser que demore 20 minutos literales en encontrar un team cuando uno quiere jugar de ADC, MID o TOP, y que encima se te agote el tiempo de espera del creador (si esos 60 minutos que te ponen cuando le das a buscar equipo) cuando está a búsqueda de soporte y jungla.\n\nConclusión: Jugar creador de equipos SÓLO sí tienes ganas de practicar soporte, ahí el equipo lo encuentra en menos de 10 segundos o ir Jungla (por ahí demora 1 minuto encontrar equipo si vas de jungla). ADC, MID o TOP no se puede.\n\nSoportes y junglas no existen en el creador de equipos. Que tal si se fomenta el uso de soportes y junglas en vez de poner guías sobre ADC, MID o TOP?","replies":[]}]}