{"poster":"Gapybo","date":"2015-07-12T11:55:19.761+0000","title":"Captain Miss Fortune price","subforum":"Concepts & Creations","up_votes":2,"down_votes":7,"body":"I&#039;m tired of Riot trying to push us a skin priced at 975rp with nothing new but a recall animation. We&#039;ve had plenty of skins in the past at this price with a new recall and particles. How is this justified? It&#039;s even more fishy how you didn&#039;t give Miss Fortune a new recall animation with her VU. Only to justify this skin&#039;s price? \nJust give the new recall animation to all of her skins and price this 750rp so it won&#039;t feel like a halfassed, cashgrabbing move as it is.","replies":[{"poster":"Ratchet Fortune","date":"2015-07-12T12:36:03.389+0000","up_votes":2,"down_votes":0,"body":"So you tell me what the new particles should be for Captain Fortune. Because the only thing I can see is maybe 3 bullets on her auto attacks and maybe Q? (_that probably would be a clarity issue anyway_). I'm a creative person and I can't think of much for that skin. \n\nMe, personally, I look forward to this skin, but I won't be using it as much as my favorite skins which is Mafia and Cowgirl. All skins of Miss Fortune fits her perfectly in my opinion. I like how it looks also.","replies":[{"poster":"Legacy of Xion","date":"2015-07-12T15:24:43.961+0000","up_votes":1,"down_votes":2,"body":"He has nothing against its look, it's the price. Has nothing new and for the same price you could get a much better skin.","replies":[]},{"poster":"moonstones","date":"2015-07-13T16:45:04.963+0000","up_votes":2,"down_votes":3,"body":"Hiya Jinxynaenae, \n\nThanks for sharing your thoughts on this skin! \n\nYou're correct in that we felt the new VU particles fit well with Captain Fortune, and that having three bullets on her auto attacks would be a clarity issue. \n\nSince Miss Fortune's VU was minor, her base would not be receiving a new recall. We felt that adding a recall to Captain Fortune would add a bit more character to the skin thematic.","replies":[]}]},{"poster":"fisox","date":"2015-07-29T18:05:45.821+0000","up_votes":1,"down_votes":0,"body":"If you dont like the skin so dont buy it...","replies":[]},{"poster":"Hexs Fortune","date":"2015-07-29T18:04:28.410+0000","up_votes":1,"down_votes":0,"body":"Shouldn't all new characters and Visual updated characters at least have a default backing animation...","replies":[]},{"poster":"True Lizard","date":"2015-07-12T12:31:19.634+0000","up_votes":2,"down_votes":2,"body":"or you can stfu and be happy its not 1350, there are legendary skins with less difference then that skin quit bitching and get a job.","replies":[]}]}