{"poster":"Cyka Vlad","date":"2018-08-02T05:22:55.520+0000","title":"La gente toxica...tampoco sabe leer ?","subforum":"Charlas Generales","up_votes":11,"down_votes":0,"body":"Me refiero a que muchas veces, en el foro, veo gente poniendo post tipo &quot;Y ahora que hice?&quot; o &quot;riot desbaneame la cuenta ya&quot; o &quot;ban injusto&quot; y cosas as&iacute; y luego ponen la evidencia como diciendo &quot;es obvio que yo no dije nada malo&quot;, pero al parecer no leen porque en la evidencia sale que ellos dijeron cosas tipo\r\n\r\n**Pepito2025: c&aacute;llate hija de la gran puta\r\nPepito2025: que ahri hija de remil putas\r\nPepito2025: C&aacute;llate o trolleo\r\n**\r\n\r\ny cosas as&iacute;, onda, no leen o es que les gusta pasar verg&uuml;enza en el foro ?","replies":[{"poster":"rokushoger","date":"2018-08-02T11:25:17.598+0000","up_votes":5,"down_votes":0,"body":"Gran parte es debido al contexto cultural en el que nacieron. \nTal vez no saben expresarse de otra forma, o expesarse así es normal para ellos y tanto que pasa a no ser un insulto. Por ejemplo, en Argentina te dicen \"boludo\" cuando son amigos, y técnicamente es un insulto, tal como \"nabo\" en Uruguay, o los miles de significados que tiene \"weon\" en chile. Para muchos el decirle \"dale hija de p... move el ort... y defendé\" es normal, porque así se hablan con sus pares día a día.\nOtra gran parte son simples caraduras y ya, que \"si pasa pasa\".","replies":[{"poster":"C11H15NÖ2","date":"2018-08-02T14:31:16.803+0000","up_votes":1,"down_votes":10,"body":"Jajaja la culpa es de la gente y su \"contexto social\"  y no del matchmaking irrisorio que tiene el juego y los baneos poco efectivos. Pero no claro la culpa es del estrato cultural de la gente! jajaja. un clásico de la mediocridad culpar a la sociedad y no partir desde casa \n{{sticker:sg-lux-2}}","replies":[{"poster":"rokushoger","date":"2018-08-02T14:47:04.830+0000","up_votes":5,"down_votes":0,"body":"Man, yo hablo del tipo de respuesta que dan ante la situación, no a que el tenga culpa al enojarse... Lo que el autor del post pregunta es porqué no se dan cuenta de lo que hacen mal, no porque se enojaron. Un poco de comprensión lectora por favor.","replies":[{"poster":"C11H15NÖ2","date":"2018-08-02T14:51:54.790+0000","up_votes":1,"down_votes":7,"body":"El que no tiene comprensión lectora eres tu, porque mi critica no va al post, si no que tu comentario.\nPero se nota que eres un flammercito con tu respuesta de \"Un poco de comprensión lectora por favor.\" \njakjjka típica gente del LoL \n\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"rokushoger","date":"2018-08-02T14:57:39.747+0000","up_votes":4,"down_votes":0,"body":"Otra vez el cántaro al agua. Estoy respondiendo sobre porqué esas personas enojadas responden de la forma que responden, no porque se enojaron en primer lugar o si está justificado o no su enojo.\n\nTe lo explico:\nCuando uno se enoja, tiene varias posibles formas de manifestarlo:\n1- Putear, carajear, insultar, etc.\n2- Expresarlo como una persona racional y de forma civilizada.\n3- Aguantarse y seguir para adelante. \n\nDe esas tres opciones, hay dos socialmente aceptadas (2 y 3), y una que no lo es (la 1).\n\nNadie dice que no tenga razón en enojarse, ni siquiera se plantea ese tema, que es lo que tu estás diciendo con \" y no del matchmaking irrisorio que tiene el juego y los baneos poco efectivos\". \nLo que se platea es porque elige la opción 1 por sobre la 2 o 3, y te pido que comprendas lo que lees antes de opinar, cosa que es evidente que no hiciste dada la respuesta que me pusiste, cambiando el foco de la conversación. \nSi pedir centrar la conversación es para ti ser flamer, pues si, debo ser el más flamer del planeta, pero solo para tí, que sos el único que maneja esa definición.","replies":[{"poster":"C11H15NÖ2","date":"2018-08-02T15:19:57.096+0000","up_votes":1,"down_votes":7,"body":"Por dios, no sé si no quieres darte cuenta o simplemente eres así.\n1. Gran parte es debido al contexto cultural en el que nacieron. (Critica social, poco argumentativa)\n2. Tal vez no saben expresarse de otra forma, o expesarse así es normal para ellos y tanto que pasa a no ser un insulto. (Critica social)\nLo que no da das cuenta que no es contacto social el que te hace ser poco tolerante o frustrado, que es a lo que apunta el post. \n\nTe explico. la conducta funciona así. \n\nLa moral y otras formas de conducta humana. LA MORAL Y OTRAS FORMAS DE CONDUCTA HUMANA. Los seres humanos tienen diferentes tipos de comportamiento dependiendo de sus relaciones con el mundo exterior y entre los propios hombres, y también de acuerdo a la diversidad de sus necesidades.\n\nINDEPENDIENTE DEL CONTEXTO SOCIAL al que haces referencia en tu post. \n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Kenetto","date":"2018-08-02T15:39:58.195+0000","up_votes":6,"down_votes":0,"body":"Te juro que leo lo que escribiste una y otra vez y menos sentido le encuentro, ¿vos sabés lo que significan las palabras que estás usando?","replies":[]},{"poster":"rokushoger","date":"2018-08-02T16:29:05.307+0000","up_votes":4,"down_votes":0,"body":"Te paso un artículo sobre un concepto que veo todavía no has incorporado: [los agentes socializadores](https://es.wikipedia.org/wiki/Agente_de_socializaci%C3%B3n).\n\nAsí a grandes razgos, un humano aprende ética, moral, valores y costumbres gracias a 4 agentes socializadores que son los más importantes:\n\n1- Su familia, que es lo que tiene en el vínculo más cercano.\n2- Sus pares, que son la gente con la que se relaciona día a día y que tienen un nivel socioeconómico en general similar al suyo.\n3- Su lugar de estudio, donde aprende nociones básicas para sobrevivir la vida luego.\n4- Los medios de comunicación, donde lo bombardean de todo el resto de la info.\n\nDe estos 4 medios, dos de ellos van a tener un fuerte contenido que se relaciona a su nivel socioeconómico (la familia y los pares), y son estos justamente los dos que más influencian a la hora de inculcar los valores, que luego formaran el perfil ético y moral de una persona.\n\nPor eso, cuando se habla de la conducta de una persona, un gran pero gran porcentaje de las reacciones y expresiones de esta queda determinado por la estructura socioeconómica en la cual se crió.\n\nNo lo digo yo, lo dice la sociología.\n\nNo puedes de ninguna manera decir que el contexto social está desligado de como actúa una persona cuando es justamente lo contrario, el contexto social es lo que forma a los valores, la ética y la moral de la misma!\n\n{{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"MasterRightClick","date":"2018-08-02T16:06:02.078+0000","up_votes":3,"down_votes":0,"body":"Yo no se como  Roku se toma el tiempo de explicarte. En todo caso te hubieran explicado con manzanitas porque es algo tan basico","replies":[]},{"poster":"bombastico","date":"2018-08-02T15:50:54.462+0000","up_votes":2,"down_votes":0,"body":"Por favor, simplemente admite que te equivocaste y deja la discusión con dignidad, los demás también podemos leerte y es doloroso xD\n\nEl que no sabe comportarse flameará independiente del estado del juego, servers, comunidad, emparejamientos etc.","replies":[]}]}]}]}]},{"poster":"Kenetto","date":"2018-08-02T15:32:53.074+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-lux-2}} {{sticker:sg-lux-2}} {{sticker:sg-lux-2}}","replies":[]},{"poster":"bombastico","date":"2018-08-02T14:55:27.490+0000","up_votes":1,"down_votes":0,"body":"En tu día a día encontraras miles de motivos por el cual insultar a la gente, pero la gente con un mínimo de criterio logra comportarse, si el sujeto es toxico no importa el matchmaking, ni los baneos, se comportará igual.\nY por otro lado, riot no es psicólogo ni planea arreglar la sociedad. ¿No te comportas? Pues te vas.","replies":[]}]}]},{"poster":"TheBoss2190","date":"2018-08-02T15:27:47.834+0000","up_votes":1,"down_votes":1,"body":"Yo creo que hay gente que le falta visitar al BANamex para que se calmen\n{{sticker:poppy-wink}}","replies":[]},{"poster":"DJ ALEXXX","date":"2018-08-02T13:07:37.898+0000","up_votes":1,"down_votes":1,"body":"Mi nuevo nick en honor a esto va a ser Pepito2025 JAJAJAJAJA","replies":[]},{"poster":"SG naiko ","date":"2018-08-02T07:24:20.510+0000","up_votes":2,"down_votes":11,"body":"Hey, esta prohibido insultar en el foro o el lenguaje vulgar, o lo censuras o algo por el estilo antes que alguien aparte de yo lo denuncie.","replies":[{"poster":"MasterRightClick","date":"2018-08-02T16:07:05.773+0000","up_votes":1,"down_votes":0,"body":"No veo el post caido. Ni veo uso de lenguaje abusivo hacia nadie\n\nGood try bro","replies":[]}]}]}