{"poster":"roland539 2","date":"2016-07-28T19:32:43.121+0000","title":"Mit tegyek?","up_votes":1,"down_votes":0,"body":"Na az van hogy most vagyok s3-ban &eacute;s 2 nappal ezel&ouml;tt 71lp-m volt de most m&aacute; csak 0 van mert a meccseimben vagy trollok vagy afkok voltak most nagyon elbizonytalanottam ,mit tegyek mert nem akarok lebukni s4-be\r\nFolytassam a rankedez&eacute;st?\r\nSegitsetek l&eacute;tszives","replies":[{"poster":"Temp65432","date":"2016-07-28T19:47:00.108+0000","title":null,"up_votes":3,"down_votes":1,"body":"1. Ne indíts el új rankedet\n2. Menj még ~1000 normal gamet\n3. Vegyél még ~5 runa paget\n4. Töltsd fel\n5. Vegyél meg 50-60 karaktert\n6. Játsz le még 200 ranked gamet\n7. Gyere vissza fórumra, és lásd be, hogy mennyire felesleges volt 20game után sírni a trollok és afkerek miatt, amikor még messze messze nem is láttad a ladder igazi arcát.\n\nNo offense, de ha ennyi menet után azt fontolgatod, hogy egy időre szüneteltetned kellene a rankedet, akkor igazad van. Szüneteltesd.\n\nEdit: Ja és amúgy amíg tudod tartani az 50% winratet (ami eddig sikerült), addig jó vagy. Majd ha el kezd rohamosan csökkenni ez a szám, akkor kezdj el aggódni. Most még elég stabilan teljesítesz. Tehát +-1 diven belül fogsz mozogni.","replies":[{"poster":"roland539 2","date":"2016-07-28T20:37:03.450+0000","title":null,"up_votes":1,"down_votes":0,"body":"Köszi a segitséget","replies":[]}]},{"poster":"Shikaichi","date":"2016-07-28T19:44:29.751+0000","title":null,"up_votes":1,"down_votes":0,"body":"Leginkább azt tudom mondani, hogy játssz minél jobban! Add ki magadból a maximumot és ne kerülj feleslegesen rossz pozícióba! A legutóbbi játékaid nézve elég sokszor haltál meg. Talán a 3 meghalás volt az, amire azt mondom, hogy belefér, de ott is jócskán kivettek a játékból és kevés volt például Trundle-el is a farmod. Wardolj, törekedj a több farmra, a kevesebb halálra, stb.\nDe ezt csak a jövőben. Most én is leginkább azt tanácsolnám ennyi ranked vereség után, hogy kicsit pihentesd. Menj normalt, játssz más játékmódokkal, hogy ne ess ki a játékból, de ne rankedezz! Hidd el, ha tartasz egy kis pihenőt az agyadnak, akkor jobban is fog menni a játék, higgadtabban tudsz gondolkodni és csak a célodra figyelni.","replies":[{"poster":"roland539 2","date":"2016-07-28T20:39:46.653+0000","title":null,"up_votes":1,"down_votes":0,"body":"Köszi a tanácsot","replies":[]}]}]}