{"poster":"Aıejandro","date":"2017-11-11T00:02:18.374+0000","title":"Antes y Ahora PI vs EA","subforum":"Charlas Generales","up_votes":5,"down_votes":2,"body":"Antes:Cada vez que terminaba una partida ganaba un peque&ntilde;o porcentaje de PI(PERO GANABA SI O SI)\r\nAhora:Cada vez que termina una partida **solo** ganas EXP(ANTES PARA LVL BAJO PI Y EXP)\r\nAntes: comprabas campeones cuando juntabas PI en las partidas\r\nAhora:Tienes que subir de nivel y esperar que campe&oacute;n te toca y desencantarlo, pero si te salen campeones de 450 y 1350 no ganas casi **NADA**\r\nAntes:Te esforzabas por ganar la primera victoria del d&iacute;a para ganar PI para ese ansiado campe&oacute;n\r\nAhora: Te da **CASI** lo mismo ganar o perder una partida,solo te dar&aacute;n EXP\r\nAntes:Podias comprar un campe&oacute;n cuando ganabas partidas(consiguiendo PI)\r\nAhora:Tienes que esperar subir de lvl para ver que campe&oacute;n te sale y desencantarlo,juntar EA  y si no te alcanza subir de lvl otra vez","replies":[{"poster":"WhiteMax","date":"2017-11-11T00:16:34.942+0000","up_votes":2,"down_votes":0,"body":"> Ahora:Tienes que subir de nivel y esperar que campeón te toca y desencantarlo, pero si te salen campeones de 450 y 1350 no ganas casi NADA\n\nAmmm te salen varios campeones que al desencantarlos te da entre 720 EA (el minimo) a 1260 (maximo). O bien 1 solo campeon que te de directamente toda la EA.\n\nPD: si resulta que obtienes menos de 720 se supone que es un bug, lo tienen que arreglar.","replies":[{"poster":"Mazer Rakham","date":"2017-11-11T00:19:15.099+0000","up_votes":2,"down_votes":0,"body":"Agrego: Si te sale el fragmento del campeón que querías comprar tenés un descuento para craftearlo, por ende, te sale menos del valor en tienda.\n\n{{sticker:sg-ahri-2}}","replies":[]}]},{"poster":"lordeman10","date":"2017-11-11T00:05:04.477+0000","up_votes":3,"down_votes":1,"body":"firma, alguien que subió 1 solo nivel\n\ndenle tiempo al sistema muchachos tiran opiniones muy apresuradas ¿cuantos días lleva esto 3?","replies":[{"poster":"Cacu3x20","date":"2017-11-11T00:15:55.850+0000","up_votes":1,"down_votes":1,"body":"Nada que ver. Te dejo unos items que pusieron en otro post para que veas un poco la realidad.\n\n> -Han eliminado el rerroll de campeones para que los jugadores con todos los campeones no puedan acceder al campeon sin pagarlo.\n> -Han rebajado como un 60% la cantidad de esencias naranjas obtenidas al desencantar un fragmento de aspecto, pero siguen valiendo exactamente lo mismo hacerla permanente.\n> -Han quitado las recompensas a final de partida y ahora nos tendremos que conformar con un asqueroso fragmento de campeon cada 10 o 20 partidas.\n> -La tienda por EA tiene un precio prohibitivo para artículos que NO lo valen ni de lejos.\n> -Los jugadores que tienen todos los campeones no obtienen NADA productivo por subir de nivel.\n> -Upgradear un campeón es un 350% mas caro que antes.\n [](https://boards.las.leagueoflegends.com/es/c/charlas-generales/2v0HWPRi-mi-opinion-sobre-el-nuevo-sistema-de-ea)\n\nPor mi parte, no vi en ningun lado escrito anunciando estos cambios en especial el cambio tan repentino de las esencias naranjas.","replies":[{"poster":"WhiteMax","date":"2017-11-11T00:43:58.607+0000","up_votes":1,"down_votes":0,"body":"> -Han eliminado el rerroll de campeones para que los jugadores con todos los campeones no puedan acceder al campeon sin pagarlo.\n\nCreo que lo hicieron por el tema de que las capsulas dan fragmentos y lo reemplazaron con los descuentos de campeon (aunque era mejor el reroll).\n\n> -Han rebajado como un 60% la cantidad de esencias naranjas obtenidas al desencantar un fragmento de aspecto, pero siguen valiendo exactamente lo mismo hacerla permanente.\n\nEsto que tiene que ver con la EA? y creo que lo hicieron para que la gente use mas el reroll y menos el farmeo de Esencia para skins especificas.\n\n> -Han quitado las recompensas a final de partida y ahora nos tendremos que conformar con un asqueroso fragmento de campeon cada 10 o 20 partidas.\n\nDichos fragmentos puede tener un valor de 1240 EA.\n\n> -La tienda por EA tiene un precio prohibitivo para artículos que NO lo valen ni de lejos.\n\nSon skin y iconos, articulos que solo se podian obtener por RP. Y vienes a decir que no lo valen? ademas, el campeon misterioso forma parte de esa tienda, y puedes usarlo para conseguir campeones de 4800 y 6300 por... 3900? menos EA de lo que costaba comprar 3 monedas de campeon (5100) y hacer reroll.\n\n> -Los jugadores que tienen todos los campeones no obtienen NADA productivo por subir de nivel.\n\n???? Y la tienda especial de EA que es? digo en el sistema anterior lo productivo eran las runas y paginas de runas, ahora puedes comprar skins y iconos por EA.\n\n> -Upgradear un campeón es un 350% mas caro que antes.\n\nMentira. Sigue valiendo lo mismo que antes, y si tienes su fragmento puedes hacer descuento de 20%. Lo que aumentaron es la EA necesaria para M6 y 7 (eso si que fue malo).\n\n> Por mi parte, no vi en ningun lado escrito anunciando estos cambios en especial el cambio tan repentino de las esencias naranjas.\n\nEstaba en el \"!\" y hubo varios post avisando.","replies":[]}]},{"poster":"Zafphlyn","date":"2017-11-11T00:11:20.818+0000","up_votes":1,"down_votes":0,"body":"Lo peor es que hay cientos de bugs con la nueva actualización y esta gente desvía la atención de riot por esta boludez que todavía ni saben si sale rentable o no.","replies":[]}]},{"poster":"Bustatos xD","date":"2017-11-11T00:20:05.055+0000","up_votes":1,"down_votes":0,"body":"Si es cosa de \"suerte\" pero como sabemos esto es solo números la suerte no es de todo cierta o no de la forma fácil de entender, es cierto que hay muy poca recompensa o inexistente, pero el punto es que a larga tendrás el mismo EA que antes, sobretodo cuando das el salto de lvl 10 en 10 puesto que te da sobre los 2mil EA si o si o incluso más, para mi hay que esperar solamente y darle tiempo al sistema y verán que tendremos lo mismo en pi que antes y finalmente lo que si podría ser un poco molesto para la gente es que no tengas recompensas después de cada game pero prefiero mil veces eso a que estar estancado en lvl 30 durante muchos años. Es algo que le faltaba al sistema y espero que a ustedes le termine de gustar ya que todo se le tiene que dar tiempo.\nPD: Creí que la gente estaría peleando por las nuevas runas o dando opiniones o estableciendo conversaciones entre la comunidad de que opinan ya  que es un cambio realmente importante en le juego y se enfocan en pequeñeces? Realmente por esto el nivel de las es tan misero.","replies":[]}]}