{"poster":"Lothàrs Edge","date":"2017-03-06T22:43:23.755+0000","title":"Login Status: Authenticating...","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"Anybody else having this issue?\n\nEDIT: Nevermind... Firewall settings have to be on low for some ridiculous reason.\n\nAlso... Riot's advice is kinda funny:\n\nTURNING OFF YOUR FIREWALLS:\n**The quickest and easiest way to solve your problem is to uninstall and disable your firewalls.**\n\n\nHear that guys? If you have issues just uninstall and disable firewall!","replies":[{"poster":"Porocles","date":"2017-03-07T22:55:39.070+0000","up_votes":1,"down_votes":0,"body":"You don't have to disable or uninstall your firewall, that can be pretty on safe.  Our [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to configure your firewall settings without disabling it.  You can also just download our [hextech repair tool](https://support.riotgames.com/hc/en-us/articles/224826367) which will automatically do all of that for you.  Hope it helps!","replies":[{"poster":"moshy1234","date":"2017-05-04T00:32:06.251+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"Thomasisko","date":"2017-05-08T18:12:55.316+0000","up_votes":1,"down_votes":0,"body":"I sent ticket to riot. After a lot of ''suggestions'' they sent me this... didn't work to me but you can try:\n**_Hey there,\n\nThanks for the logs. I've checked them and it seems that you're using IPv6 and that might put a strain on your network. First you'll need to disable IPv6 by following these steps:\n\n• Go to this Microsoft website\n• Scroll down and press the download \"Disable IPv6\" button\n• Open the \"MicrosoftEasyFix20160.mini\" file\n• Press \"Next\" when the window pops-up and wait\n• Press \"Close\" and you're all set\n\nAlso I would like you to disable the Teredo Tunneling interface because it might cause connection problems and you might experience issues even after disabling IPv6. Here's how to disable the interface:\n\n• Open Start Menu\n• Type cmd and run it with administrator permissions\n• Type the following command:\nnetsh interface teredo set state disabled\n\nAdding to that, since you're having firewall enabled, try do disable it temporarily to see if that's the source of the problem. Follow these quick steps to disable it:\n\n• Press the keys \"Windows\" and \"R\" simultaneously.\n• Type \"services.msc\" in the field and hit enter.\n• Scroll down and find \"Windows Firewall\" in the list. -Right-Click on \"Windows Firewall\" and select \"Properties.\"\n• Change \"Startup type\" to \"Disabled.\"\n• Click \"Ok.\"\n• Follow these same steps for the \"Windows Defender\" Service.\n• Reboot your machine.\n\nIf the issue persists, let me know. Also please provide me a new batch of logs from the Hextech Repair tool and a Network Analysis.\n\nHave a nice day! ^_^\n\nKind Regards,\n\nDalek Skaros\nPlayer Support Specialist\n\n\"If you have problem, you come to me first!\"_**","replies":[{"poster":"Gihs","date":"2017-10-21T09:51:16.980+0000","up_votes":1,"down_votes":0,"body":"Please dude help me game stuck to me in authenticating i dont know what i need do","replies":[{"poster":"Exylle99","date":"2017-11-21T17:52:14.766+0000","up_votes":1,"down_votes":0,"body":"I have this problem too.. Nothing can help me.. Please someone say something\n","replies":[]}]}]}]}]}]}