{"poster":"Dissociated","date":"2017-03-24T10:54:34.988+0000","title":"qualche pro di ashe da cui possa imparare? o consigli spassionati.","subforum":"Discussioni generali","up_votes":3,"down_votes":5,"body":"come da titolo, vorrei giocare ashe al meglio.\r\n\r\nse aiuta, i miei problemi sono: se il team non &egrave; super protettivo con me non riesco a stare in fight a fare dps (tiro qualche q ma chiaramente 150 danni ai tank non sono nulla), la maggior parte delle volte vengo oneshottato prima di poter usare la q per kitare.\r\ninfo in pi&ugrave;: fighto solo con le summoner up, farmo decentemente, buildo le scarpe ad armor ogni volta che serve (graves, kha zix ecc),  starto di infinity seguita da statik, rune standard da adc e maestrie 18/0/12 warlord- e nel ramo tank prendo mov speed per kitare, vita contro gli all-in e cdr alle summoner (&egrave; la build pi&ugrave; safe che ho).\r\n\r\nquello che vorrei ottenere &egrave; alzare molto di pi&ugrave; i miei danni a fine partita e un consiglio su come ultare.","replies":[{"poster":"Dr LouD","date":"2017-03-24T11:01:30.432+0000","up_votes":3,"down_votes":3,"body":"Da esperto luminare nel ruolo del tiratore, posso dirti che la miglior strategia per far danni con un adc è spostare il cursore su una figura nemica e premere il tasto destro del mouse\n\n/thread","replies":[{"poster":"Dissociated","date":"2017-03-24T11:12:23.592+0000","up_votes":5,"down_votes":1,"body":"i casi sono due: o hai lo stesso senso dell' umorismo dei moderatori e quindi non ti bannano, oppure sei un moderatore con un secondo account, perché risposte così inutili sono da eliminare. anche negli altri thread scrivi cose a caso sparando giudizi non richiesti. \n\nogni volta che ti leggo scuoto la testa e piango...\n\nte lo chiedo per favore: smetti di rispondere ai miei thread con cose inutili. seriamente, smetti.","replies":[{"poster":"Dr LouD","date":"2017-03-24T11:29:38.315+0000","up_votes":3,"down_votes":1,"body":"Quando arriverai Challenjour grazie a questi consigli tornerai a ringraziarmi in ginocchio.\n\nPff, ingrato.","replies":[{"poster":"NiraBlade","date":"2017-03-24T16:11:26.682+0000","up_votes":4,"down_votes":0,"body":"#MESSAGGIO DI SERVIZIO:\n\nHo cancellato tutti i messaggi successivi a questo in quanto erano tutti OT con la discussione - sorry guys ma non potete scrivermi 10 messaggi tutti OT D: contenetevi!\n\n.\n---\n@ILoud ti ho lasciato i messaggi sia per spiegare la cancellazione dei messaggi sia per poter intervenire sui tuoi commenti: scherzare è cosa buona e giusta però evitate di \"pigliarvi per i capelli\" ogni volta che succede - @Dissociated se questo tipo di commenti non ti piacciono perfavore non mangiare la foglia, ma piuttosto segnala. Sarà nostra premura intervenire.","replies":[{"poster":"Dr LouD","date":"2017-03-24T16:27:22.417+0000","up_votes":2,"down_votes":4,"body":"Sono un comico incompreso :(","replies":[]}]}]}]}]},{"poster":"Ringiel","date":"2017-03-24T12:41:32.161+0000","up_votes":3,"down_votes":0,"body":"non riesci a giocarla perchè la buildi come 3 season fa ... ora ashe si rusha {{item:3153}} come primo item,che è straforte visto che ti da tutte le stats che hai bisogno,e poi il {{item:3085}} o {{item:3046}}; lo statikk è una pessima scelta perchè ha la passiva scarsa se lo confrontiamo a qualsiasi item che si fa con lo zeal ({{item:3094}} + range,{{item:3046}} - danni del nemico,{{item:3085}} danni aoe che funzionano con la Q).\nse la giochi con {{item:3153}} inoltre non conviene warlord,perchè tanto la lifesteal la prendi da quell'item,molto meglio fervor che ti da una marea di AD.","replies":[]},{"poster":"Frattaglia","date":"2017-03-24T19:59:21.022+0000","up_votes":1,"down_votes":0,"body":"Comunque non prendere le scarpe ad armor, resti comunque l'adc, quindi devi prendere danno.\n\nSe sei nei guai piuttosto pensa a {{item:3026}} o {{item:3139}} o simili.\nPiuttosto, soprattutto con campioni dipendenti dagli altri come Ashe, Kog'maw, Jhin etc, cerca di non rimanere mai da solo. Il support serve apposta per salvarti la vita.","replies":[]}]}