{"poster":"Dissociated","date":"2017-01-18T19:03:04.750+0000","title":"Camera locked","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Posso capire che qualcuno si senta dio con la camera mobile (proprio come i prooooOoOoOo!!1!)\r\n\r\nMa se poi tirate gli skillshot a occhi chiusi che senso ha?\r\n\r\n(Un pomeriggio fatto di bronzi in silver1)","replies":[{"poster":"AreyeZ","date":"2017-01-20T12:56:17.042+0000","up_votes":1,"down_votes":0,"body":"Camera fissa tutta la vita.(con un occhio alla mini mappa)","replies":[]},{"poster":"NiraBlade","date":"2017-01-18T19:05:04.649+0000","up_votes":1,"down_votes":0,"body":"boh, a me la telecamera fissa dava il mal di testa e mi dava fastidio non potermi muovere con il mouse utilizzandolo sui bordi. Penso di averla tolta dopo il mio primissimo game contro i bot. Sono totalmente impedita se la fisso.","replies":[{"poster":"markmask","date":"2017-01-19T12:40:48.586+0000","up_votes":1,"down_votes":0,"body":"Prova a giocare a Heroes Of The Storm. Poi vedi come e quanto impazisci. Tecnicamente non puoi togliere la visuale dall'eroe, o almeno, io non ci riuscivo. Credo di aver analizzato piu volte le opzioni per vedere se si potesse levare questa cosa, ma niente","replies":[]}]},{"poster":"Dantazzo","date":"2017-01-19T11:43:31.308+0000","up_votes":1,"down_votes":0,"body":"Non capisco come faccia la gente a giocare con la telecamera fissa, è come giocare coi paraocchi.","replies":[]},{"poster":"Killer SurpRyze","date":"2017-01-19T10:19:52.344+0000","up_votes":1,"down_votes":0,"body":"Io preferisco quella mobile, ma spesso mi rendo conto che con certi campioni (o in certe situazioni) dovrei imparare ad usare quella fissa, soprattutto quando ci sono grosse mischie e veloci cambi di posizione sulla mappa (magari perché “sbalzati via” dall’abilità di un campione). In oltre si perde tempo a spostare la visuale col mouse. Come hanno già detto, bisognerebbe imparare ad usare la barra spaziatrice","replies":[{"poster":"Dr LouD","date":"2017-01-19T10:35:21.378+0000","up_votes":1,"down_votes":0,"body":"Se metti il pollice sulla barra spaziatrice è abbastanza easy, appena perdi la visuale premi la barra e ti si centra automaticamente","replies":[{"poster":"Killer SurpRyze","date":"2017-01-19T11:34:58.103+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=RqKshki9,comment-id=00040000,timestamp=2017-01-19T10:35:21.378+0000)\n>\n> Se metti il pollice sulla barra spaziatrice è abbastanza easy, appena perdi la visuale premi la barra e ti si centra automaticamente\n\ngià, devo solo farmi entrare in testa il meccanismo, invece di dimenticarmi di avere quell'appendice inutilizzata alla mano sinistra :-(","replies":[]}]}]},{"poster":"Linkimaru OP","date":"2017-01-19T09:37:41.343+0000","up_votes":1,"down_votes":0,"body":"La telecamera fissa è un grosso impedimento c'è poco da fare, davvero non capisco come fate a giocare... ogni tanto mi capita di metterla per sbaglio e per quei pochi secondi impazzisco, mi sento super limitato peggio di uno amare di Morgana","replies":[]},{"poster":"Dr LouD","date":"2017-01-19T08:46:56.534+0000","up_votes":1,"down_votes":0,"body":"Faker gioca Riven con la camera lockata <.<","replies":[]},{"poster":"Khail the Crow","date":"2017-01-18T22:25:18.371+0000","up_votes":1,"down_votes":0,"body":"La telecamera fissa può creare degli strani glitch nel movimento rapido sul posto, e non permette di avere una adeguata visibilità prospettica nel movimento, mentre una rotazione a orbita intorno al personaggio ti permette di rimanere centrato ma spaziare di più. Basta allenarsi, per quando serve, a tenere parte del palmo della mano sulla barra spaziatrice.","replies":[]}]}