{"poster":"Jonathan Shooter","date":"2018-07-13T10:27:37.746+0000","title":"Gnar o Darius","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Allora, miei cari mattacchioni del forum, da main {{champion:24}} , {{champion:266}} , {{champion:41}} , {{champion:92}}  e soprattutto {{champion:91}} , mi chiedevo chi dei due avrei fatto meglio a prendere, se il piccolo e bastardissimo ranged {{champion:150}}  o se il mortale {{champion:122}} ...\r\nSe aveste voglia di spiegarmi il perch&eacute; della decisione e i pro e i contro di entrambi ve ne sarei infinitamente grato.\r\nGrazie in anticipo a chi avr&agrave; voglia di dedicarmi un paio di minuti della sua esistenza.\r\nCi si becca nella Landa \r\n\r\n{{sticker:vlad-salute}}","replies":[{"poster":"Garbaman","date":"2018-07-13T11:11:15.987+0000","up_votes":1,"down_votes":0,"body":"Darius è più in meta grazie ma al conqueror ma lo nerferanno quindi non so se più avanti sarà cosi forte.","replies":[{"poster":"Jonathan Shooter","date":"2018-07-13T11:52:09.153+0000","up_votes":1,"down_votes":0,"body":"Quindi cosa mi consigli di fare?","replies":[{"poster":"Garbaman","date":"2018-07-13T12:04:00.799+0000","up_votes":2,"down_votes":1,"body":"Prendi Darius, Gnar è più da gente che non ha le mani.","replies":[{"poster":"Jonathan Shooter","date":"2018-07-13T14:59:24.291+0000","up_votes":1,"down_votes":0,"body":"In che senso?","replies":[{"poster":"Garbaman","date":"2018-07-13T20:09:46.078+0000","up_votes":2,"down_votes":1,"body":"Nel senso che gnar è un pick neutro, va bene contro tutti ma non è un champion con cui puoi stompare. È un champion per fare fastidio in lane phase.","replies":[]}]}]}]}]},{"poster":"Darkinknight","date":"2018-07-14T11:01:09.338+0000","up_votes":1,"down_votes":0,"body":"Fra i 2 darius. Piu efficace,piu semplice,piu in meta e decisamente piu potenziale di carry. darius è un sempreverde rispetto a gnar che bazzica fra mediocre e fuori meta.\nFra malza e zed considerando ti piace talon zed è la scelta piu sicura (ma in ranked è spessissimo bannato da tipo 2 season),mentre malza ti da una controparte ap che magari ti manca. Sono entrambi messi discretamente atm. Considerando che i maghi sono sott'occhio per essere buffati e ritengo che gli assasin verrano presto nerfati, ti consiglio malza.","replies":[{"poster":"Jonathan Shooter","date":"2018-07-14T11:26:05.562+0000","up_votes":1,"down_votes":0,"body":"Grazie mille, hermano.\nUna cosa, contando che ho RP per prendermi Malz e un altro champ, consigli di prendere Darius così o Gnar che costa molte più EB? Cioè, prendere lo yordle sono RP sprecati che potrebbero essere meglio usati anche in senso economico con Darius o no?","replies":[{"poster":"Darkinknight","date":"2018-07-14T11:27:40.248+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jonathan Shooter,realm=EUW,application-id=MJVj50Jw,discussion-id=XYERRcu1,comment-id=00030000,timestamp=2018-07-14T11:26:05.562+0000)\n>\n> Grazie mille, hermano.\n> Una cosa, contando che ho RP per prendermi Malz e un altro champ, consigli di prendere Darius così o Gnar che costa molte più EB? Cioè, prendere lo yordle sono RP sprecati che potrebbero essere meglio usati anche in senso economico con Darius o no?\n\nA mio personale parere non vale proprio la pena di spendere RP per comprare i champ visto che sono un contenuto ottenibile gratuitamente in poco tempo.","replies":[{"poster":"Jonathan Shooter","date":"2018-07-14T13:20:24.155+0000","up_votes":1,"down_votes":0,"body":"Questa l'ho già sentita, non era questa la mia domanda...","replies":[{"poster":"Darkinknight","date":"2018-07-14T14:04:37.924+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jonathan Shooter,realm=EUW,application-id=MJVj50Jw,discussion-id=XYERRcu1,comment-id=0003000000000000,timestamp=2018-07-14T13:20:24.155+0000)\n>\n> Questa l&#x27;ho già sentita, non era questa la mia domanda...\n\nSe non ricordo male il prezzo in RP dovrebbe esserne proporzionale al prezzo in EB. Quindi meno costa un champ in EB meno costa in RP. Non hai un guadagno o una perdita maggiore a prendere uno rispetto a un altro.","replies":[{"poster":"Jonathan Shooter","date":"2018-07-14T14:11:07.186+0000","up_votes":1,"down_votes":0,"body":"No, però se le uso per uno non posso usarle per l'altro, ed arrivare a 6300 EB è più lunga che arrivare a 4800 EB. Per questo chiedevo se prenderci Gnar sarebbe stato un inutile spreco e se invece non avrei fatto meglio a prenderci un altro champ, magari anche più economico in EB come in RP.","replies":[{"poster":"Darkinknight","date":"2018-07-14T15:30:03.622+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jonathan Shooter,realm=EUW,application-id=MJVj50Jw,discussion-id=XYERRcu1,comment-id=000300000000000000000000,timestamp=2018-07-14T14:11:07.186+0000)\n>\n> No, però se le uso per uno non posso usarle per l&#x27;altro, ed arrivare a 6300 EB è più lunga che arrivare a 4800 EB. Per questo chiedevo se prenderci Gnar sarebbe stato un inutile spreco e se invece non avrei fatto meglio a prenderci un altro champ, magari anche più economico in EB come in RP.\n\nSe non prendi piu RP e non puoi prendere nient'altro e vuoi usarli per forza pee un champ si,conviene prendere quello che costa 6300","replies":[{"poster":"Jonathan Shooter","date":"2018-07-14T21:17:16.253+0000","up_votes":1,"down_votes":0,"body":"Bella, questo era ciò che volevo sapere.","replies":[]}]}]}]}]}]}]}]},{"poster":"MisogiKumagawa","date":"2018-07-14T19:41:42.298+0000","up_votes":1,"down_votes":0,"body":"Ovviamente,scegli Anivia","replies":[{"poster":"Jonathan Shooter","date":"2018-07-14T21:13:42.819+0000","up_votes":1,"down_votes":0,"body":"{{sticker:leblanc-funny}}","replies":[]}]},{"poster":"FireM1nd","date":"2018-07-13T21:32:30.881+0000","up_votes":1,"down_votes":0,"body":"Sono due pick diversi, e in maniera diversa funzionano. Gnar è un lane bully da corsia che nel late trova comunque un impiego come scuso umano nel caso non sia riuscito a snowballare efficacemente in fase iniziale. Darius invece, pecca molto nel late. Allo stato delle cose, ora Darius vanta un'early più solido dello yordle,  ma se non si riesce a capitalizzare sul vantaggio accumulato, esso si dissipa molto in fretta. Un Darius in tf fa sentire molto la sua mancanza di un vero cc, cosa che invece Gnar ha in abbondanza. D'altro canto, però,  Gnar è frenato dalla sua passiva, che condiziona pure alcune scelte nel team. Non sempre infatti (specialmente nelle prime partite) sarà disponibile la forma giusta al momento giusto. La gestione della rabbia per Gnar è fondamentale, e tornare mini (o diventare mega) al momento giusto può concorrere parecchio a salvarti la buccia.\n\nAnche vero quello che ti hanno già detto: in low elo,  negli ingaggi da mega gnar non potrai sempre contare sulla prontezza del team, quindi, rischi di fare la cosa giusta, ma che si trasforma rapidamente in quella sbagliata perché non avevi il team alle spalle.\n\nRiassumendo: Gnar un po più tecnico, può avere voce in capitolo anche in late e porta più utility al team. Darius punta molto sull'early,  meno tecnico, meno utility,  senti molto il suo contributo singolo ma in late se non capitalizzi rischi un 4v5 quasi incontrovertibile perché, appunto, hai danno ma non utility.\n\nFacendo un bilancio, consiglio prima darius e poi gnar.  È più facile (e questo fa molto pesare l'ago) e in low elo è più facile snowballare con darius piuttosto che con gnar perché c'è meno organizzazione nei team.\n\nFammi sapere, spero di esserti stato utile","replies":[{"poster":"Jonathan Shooter","date":"2018-07-13T21:48:01.674+0000","up_votes":1,"down_votes":0,"body":"Entiendo, entiendo.\nUna cosa soltanto: avevo in mente di prendere uno dei due con i RP visto che questo mese sono entrambi in sconto (ho RP per due champions ma metà volevo riservarla ad uno tra {{champion:90}}  e {{champion:238}}  (se hai voglia anche di darmi qualche consiglio tra loro due è molto ben accetto)) e quindi: chi mi becco (Gnar è molto più stronzo da prendere con le EB visto il suo costo assurdo)?","replies":[]}]},{"poster":"Maximise","date":"2018-07-13T10:53:47.360+0000","up_votes":1,"down_votes":0,"body":"Dipende, sei una pussy a cui piace attaccare da lontano oppure hai lo spirito da vero bruiser? (da come vedo) #SISCHERZA\n\nMeglio Darius, Gnar attualmente è utilizzato solo in competitivo, i suoi engages sono troppo rischiosi e sarai spesso abbandonato...","replies":[{"poster":"Jonathan Shooter","date":"2018-07-13T11:53:30.907+0000","up_votes":1,"down_votes":0,"body":"E tra Malzahar e Zed? Chi mi consigli di acchiappare (come detto maino {{champion:91}}  ma anche {{champion:38}} ,  {{champion:30}}  e {{champion:101}}  in midlane)","replies":[]}]}]}