{"poster":"xqL Ogu","date":"2018-06-08T20:48:58.181+0000","title":"Suche Spieler","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo zusammen!\n\nDa ich von meiner Leauge of Legends Pause wieder zur&uuml;ck bin und einiges an Patches verpasst habe (mein geliebter Jungle ist zerst&ouml;rt) und aufgrund meiner Inaktivit&auml;t sich meine Freundesliste gesenkt hat schreibe ich diesen Beitrag.\n\nZu mir / Uns:\n20/21 Jahre alt &amp; t&uuml;rkisch / durchschnittsalter liegt bei 20 Jahren\nRengar Main (Jungle und Top) / alle Rollen vorhanden\nHumorvoll (vorallem schwarzer Humor), respektvoll, tolerant (aber auch mit Grenzen) und leidenschaftlicher Gamer / gilt f&uuml;r beides\nElo: momentan Platin 1 - aufgrund der l&auml;ngeren Pause / durchschnittselo liegt bei ca. Gold 1 - Plat 4\nDie Leute mit denen ich &ouml;fter Spiele tilten gerne und haben auch eine menge Spa&szlig; dabei, sowie ich auch.\nDa ich &ouml;fters Pl&auml;tze f&uuml;llen will (warum zu 3. queuen wenn man auch zu 5. rein kann - you know?), will ich meine Freundesliste wieder aktuell und gef&uuml;llt haben.\n\nWir sind eine kleine Truppe und an konstanter Aktivit&auml;t mangelt es bei dem einen oder anderen, weshalb wir auch neue Leute dazu suchen.\nDie Uhrzeiten wann wir zocken ist immer spontan, kann sein dass wir bis tief in die Nacht zocken oder auch schon um 22-23Uhr aufh&ouml;ren, es ist immer auf die jeweilige Laune und Stimmung des Abends angepasst und real Life geht bei uns vor: Sprich wenn am n&auml;chsten Tag was sein sollte, ist man auch dementsprechend wieder fr&uuml;her weg.\n\nWas solltet ihr mitbringen:\n-18+ (da man auch schonmal ausfallend wird)\n-M&auml;nnlich oder weiblich ist egal - beides vertreten.\n-Headset sowie TS3 sollte vorhanden sein!\n--Humorvoll (schwarzer Humor gerne gesehen), respektvoll, F&auml;hig in Sachen einstecken, austeilen auch gern gesehen.\n-Ihr solltet nicht sensibel sein - da wir gerne tilten und der miss Ping bei uns eine andere bedeutung hat. Zu dem sollte eine freundschaftlliche Ebene herrschen d.h. wenn man mal zu dem einen Idiot sagt, sollte dieser nicht sofort beleidgt sein.\nNat&uuml;rlich hat jeder seine Grenzen, diese respektieren und tolerieren wir auch!\n\nAddet: xqL Ogu - nachdem ich euch angenommen habe bitte Rolle per Nachricht schreiben, damit ich euch einordnen kann!\n\nIch denke, dass sich einige finden lassen werden!\n\nMit freundlichen Gr&uuml;&szlig;en,\nxqL Ogu","replies":[{"poster":"xqL Ogu","date":"2018-06-14T20:22:37.369+0000","up_votes":2,"down_votes":0,"body":"Up","replies":[]},{"poster":"xqL Ogu","date":"2018-06-09T20:55:32.229+0000","up_votes":2,"down_votes":0,"body":"Up","replies":[]}]}