{"poster":"Insane Sir","date":"2016-02-11T10:24:56.755+0000","title":"Cansado del \"izi\"","subforum":"Charlas Generales","up_votes":68,"down_votes":7,"body":"Nada, eso, todas las partidas que jugue ayer y hoy TODAS habia un tipo que decia izi por todo, espero que hagan algo por que es muy molesto eso.","replies":[{"poster":"Makò","date":"2016-02-11T12:36:34.827+0000","up_votes":2,"down_votes":60,"body":"***","replies":[{"poster":"Neo Gaussrik","date":"2016-02-11T15:46:45.704+0000","up_votes":37,"down_votes":0,"body":"Estas equivocado! Izi es definitivamente reportable.\n\nVa en contra de los puntos 4 y 6 del [codigo del invocador](http://gameinfo.las.leagueoflegends.com/es/game-info/get-started/summoners-code/) y puede ser reportado como actitud antideportiva.","replies":[{"poster":"OkashiCS","date":"2016-02-11T17:47:23.243+0000","up_votes":4,"down_votes":53,"body":"y de que forma el ganador puede gosar al rival al terminar la partida? o esta penado eso?\nle quitan el chiste a ganar","replies":[{"poster":"Neo Gaussrik","date":"2016-02-11T17:54:51.687+0000","up_votes":40,"down_votes":0,"body":"Es necesario? Puedes hacer alarde con tu propio equipo y amigos al ganar, pero cuando le hablas al rival con el expreso proposito de hacer que se sienta mal, entonces estas siendo antideportivo.","replies":[{"poster":"Katastrofica","date":"2016-02-11T18:20:49.921+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=v7qsfXsE,discussion-id=ps95QX3c,comment-id=0004000200040000,timestamp=2016-02-11T17:54:51.687+0000)\n>\n> Es necesario? Puedes hacer alarde con tu propio equipo y amigos al ganar, pero cuando le hablas al rival con el expreso proposito de hacer que se sienta mal, entonces estas siendo antideportivo.\n\nUna pregunta, en ese caso si (por ejemplo) mi miss termina 999/3/1 puede decir \"jajajajja izi bot XD\" siempre y cuando no sea para chat global, me equivoco? \n\nEn todo caso sé que es mejor hacerlo con amigos que lo entiendan como una broma a con extraños que no les agrade pero... ¿Podría?\n\nDesde ya, Gracias {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Neo Gaussrik","date":"2016-02-11T20:00:04.280+0000","up_votes":14,"down_votes":0,"body":"No veo el problema.\n\nLa parte molesta del Izi es que estas ofendiendo a otros. Compartir con tu propio equipo tu opinion de que la partida que estan jugando es facil no debiera ofender a nadie.","replies":[{"poster":"Makò","date":"2016-02-12T10:49:37.206+0000","up_votes":1,"down_votes":4,"body":"Cuando el server no tiene lag el tio  Gaussrik sale a jugar XD","replies":[{"poster":"Neo Gaussrik","date":"2016-02-12T13:28:01.868+0000","up_votes":4,"down_votes":0,"body":"Lamentablemente si. :(\n\nCuando hay problemas tecnicos los jugadores quieren respuestas a sus problemas tecnicos, algo con lo que no puedo ayudar, y no quiero andar hablando de otras cosas y dando la impresion de que no me importan los problemas! :(","replies":[{"poster":"Makò","date":"2016-02-16T03:31:40.666+0000","up_votes":1,"down_votes":0,"body":"Pero si no te importan los problemas.\n\nVos queres estar tomándote un daiquiri en la playa con la camisa de graves veraniego xD","replies":[{"poster":"Neo Gaussrik","date":"2016-02-16T14:50:20.536+0000","up_votes":2,"down_votes":0,"body":"Creo que todos quisieramos estar haciendo eso, pero la verdad es que cuando el juego no funciona bien me siento pesimo.\n\nEs mas como que me quedo en mi escritorio o en mi casa sintiendome culpable por mi inhabilidad de ayudar.","replies":[{"poster":"agustern","date":"2016-02-16T22:54:29.479+0000","up_votes":2,"down_votes":0,"body":":v  yo quisiera estar con leona mas q con graves XD","replies":[{"poster":"davichost","date":"2016-02-17T07:30:28.468+0000","up_votes":1,"down_votes":0,"body":"SAPBE! {{champion:79}}","replies":[]}]},{"poster":"Makò","date":"2016-02-17T16:37:15.977+0000","up_votes":1,"down_votes":0,"body":"Pobre tio Gaussrik =(\n\nTe imagino tomándote un vodka en tu escritorio con música depre de fondo \n\n{{sticker:zombie-nunu-tears}}","replies":[]}]}]}]}]}]}]}]}]},{"poster":"DarkMoon011","date":"2016-02-11T17:01:39.756+0000","up_votes":4,"down_votes":10,"body":"Daaaaaaale (perdon por el 'tuteo' Gaussrik) como si realmente le hicieran caso a un reporte de \"Izi\".\nHoy por hoy reportar a un AFK o a un Troll pareciera que es inutil (porque esos jugadores continuan conportandose igual), mas irrelevante aun, sera un reporte por \"Izi\"\nTraducido seria: \"No hacen nada por un reporte de AFK, van a hacer algo por un \"Izi\"?\"\nSean sinceros con ustedes mismos","replies":[{"poster":"Neo Gaussrik","date":"2016-02-11T17:40:29.448+0000","up_votes":16,"down_votes":0,"body":"Si crees que el sistema de reportes no hace nada, entonces, bien- tenemos poco que discutir aca.\n\nSin embargo, si persistes en decir cosas en contra del reglamento, no te sorprendas despues cuando llegue un castigo.\n\nSaludos!","replies":[{"poster":"Ch4puLin","date":"2016-02-11T18:06:18.596+0000","up_votes":3,"down_votes":1,"body":"Sigue sin haber manera de \"subir el nivel de importancia\" de la ofensa?\nTengan en cuenta que cuando se implementó el sistema de autoaprendizaje, esta mala costumbre ya estaba muy arraigada y mucha gente no la reporta más. Es simple ver eso con este tipo de threads.","replies":[{"poster":"Neo Gaussrik","date":"2016-02-11T20:01:58.832+0000","up_votes":7,"down_votes":0,"body":"El sistema no para de aprender.\n\nEncuentro que es una buena metrica para el sistema: \"Que tan ofensivo es este termino?\"\n\nSi los jugadores no lo reportan, entonces probablemente no es muy ofensivo. Si lo reportan a menudo, molesta bastante. Es una manera para que la comunidad se auto-regule.\n\nDicho eso, siempre sera correcto reportar esta actitud, ya que va en contra del codigo.","replies":[{"poster":"Ks Erwyn","date":"2016-02-12T01:46:03.600+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=v7qsfXsE,discussion-id=ps95QX3c,comment-id=000400020002000000000000,timestamp=2016-02-11T20:01:58.832+0000)\n>\n> El sistema no para de aprender.\n> \n> Encuentro que es una buena metrica para el sistema: \"Que tan ofensivo es este termino?\"\n> \n> Si los jugadores no lo reportan, entonces probablemente no es muy ofensivo. Si lo reportan a menudo, molesta bastante. Es una manera para que la comunidad se auto-regule.\n> \n> Dicho eso, siempre sera correcto reportar esta actitud, ya que va en contra del codigo.\n\nNo es mas sencillo censurar el termino y listo ?, total, censuran cada cosa.........................a mi el termino no me molesta en lo mas mínimo, pero lo reporto por que teoricamente es lo correcto ya que es una conducta anti-deportiva como mucho dicen..................mas que nada lo hago por el malestar que les genera a mucho aliados, que aun si me parece infantil que se ofendan por eso, la provocación la genero el rival, y su intencion fue clara, generar malestar.","replies":[{"poster":"Neo Gaussrik","date":"2016-02-12T13:32:25.102+0000","up_votes":3,"down_votes":0,"body":"Censurar es una medida inefectiva para el problema. Los jugadores simplemente encontrarian otra manera de deletrear \"izi\" y usarian eso en vez.\n\nEs mucho mas efectivo castigar a los reportados por actitud antideportiva!","replies":[{"poster":"IneeDMoneYz","date":"2016-02-12T14:54:50.526+0000","up_votes":1,"down_votes":0,"body":"el problema de castigar por actitudes antideportivas, es que los reportes pueden darse por una jugada que no le gusto a tu adc, un tp que no realizo el top, un extenuar que no se uso, bla bla bla....pero donde esta la transparencia de los reports y las causales del baneo. Digo si yo hasto mi dinero en rp´s, dedico mi tiempo a jugar, es lo que nos merecemos todos los jugadores.\n\nAtencón RIOT que no les suceda lo de la compañia de mensajeria de celulares \"whatsapp\". Que comenzarón a sancionar a las personas bloqueadas y resulta que ahora hay una compañia que vende servicios de bloqueo. si eso, ellos tienen muchisimos numeros y agregan a la otra persona y bloquean sucesivamente y bueno todos sabemos el final.....la otra persona ya no puede utilizar mas el programa con ese numero de celular.\n\nBueno la comparación a los reports es que solo hace falta que muchas personas se dediquen a dar reports gratuitos y fin del juego.","replies":[{"poster":"Neo Gaussrik","date":"2016-02-12T15:00:35.044+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=IneeDMoneYz,realm=LAS,application-id=v7qsfXsE,discussion-id=ps95QX3c,comment-id=000400020002000000000000000100000001,timestamp=2016-02-12T14:54:50.526+0000)\n>pero donde esta la transparencia de los reports y las causales del baneo.\n\nCuando eres castigado, se te muestra los causales del castigo. Si incluso con la evidencia presentada sientes que es no justificado, puedes apelar al reporte- pero tambien quisiera hacer notar que nuestro sistema es extremadamente bueno identificando jugadores que merecen castigo y muy rara vez se equivoca.\n\n> Bueno la comparación a los reports es que solo hace falta que muchas personas se dediquen a dar reports gratuitos y fin del juego.\n\nLos reportes gratuitos no tienen efecto en el juego.\n\nDespues de todo, los jugadores reportados tienen que mostrar patrones de comportamiento comun para que el sistema lo identifique como una actitud castigable.\n\nDecir \"Izi\" en all chat durante y al final de la partida es relativamente facil de detectar y los jugadores reportados de esta manera tienen el comportamiento en comun. Si te dedicas a reportar jugadores aleatoriamente, lo unico que vas a lograr es que el sistema te identifique como alguien que reporta sin razon.","replies":[]}]}]}]},{"poster":"Keldor","date":"2016-02-12T04:33:25.012+0000","up_votes":2,"down_votes":0,"body":"Unas preguntas Gaussrik\n\n¿De qué sirve justificar un reporte si es el sistema el que lo interpreta?\n¿Es de mayor peso un reporte justificado?\n\nGracias de antemano {{champion:134}}","replies":[{"poster":"Neo Gaussrik","date":"2016-02-12T13:31:38.164+0000","up_votes":2,"down_votes":0,"body":"Se analiza tambien, aunque el sistema de castigos automaticos no es tan bueno interpretando textos cortos.\n\nSin embargo, cuando un jugador castigado pide que se revise el por que lo castigaron, estas justificaciones ayudan a la persona que lo revisa manualmente.\n\nEn otras palabras, tiene un valor, pero no tiene mayor peso.\n\nSaludos!","replies":[]}]}]}]}]}]},{"poster":"RainbowRabbit","date":"2016-02-11T17:26:47.147+0000","up_votes":3,"down_votes":10,"body":"y poner \"gg izi\" ? :v","replies":[{"poster":"Neo Gaussrik","date":"2016-02-11T17:41:07.452+0000","up_votes":12,"down_votes":1,"body":"Tambien reportable, por supuesto.","replies":[{"poster":"RainbowRabbit","date":"2016-02-13T01:41:37.809+0000","up_votes":2,"down_votes":0,"body":"y poner \"gg izi wp\"? :C","replies":[]}]}]},{"poster":"BiXe","date":"2016-02-14T04:56:43.991+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=v7qsfXsE,discussion-id=ps95QX3c,comment-id=00040002,timestamp=2016-02-11T15:46:45.704+0000)\n>\n> Estas equivocado! Izi es definitivamente reportable.\n> \n> Va en contra de los puntos 4 y 6 del [codigo del invocador](http://gameinfo.las.leagueoflegends.com/es/game-info/get-started/summoners-code/) y puede ser reportado como actitud antideportiva.\n\n¿y el ban de esa gente para cuando o de los trolls que entran a ranked y salen 1/12/0 y se ríen encima diciendo \"reportenme si total no me van a banear\"?","replies":[{"poster":"Depredamati","date":"2016-02-14T18:30:14.081+0000","up_votes":1,"down_votes":0,"body":"http://imgur.com/a/V17t9\nNo se si te sirva, pero cada vez que veo esas fotos me rio y me alegra saberlo.","replies":[{"poster":"TheXTrunner","date":"2016-02-17T17:22:17.132+0000","up_votes":1,"down_votes":0,"body":"http://i1.kym-cdn.com/photos/images/newsfeed/000/591/928/94f.png","replies":[]},{"poster":"BiXe","date":"2016-02-17T04:34:32.510+0000","up_votes":1,"down_votes":0,"body":"XD","replies":[]}]}]}]},{"poster":"Natchin","date":"2016-02-11T12:48:32.604+0000","up_votes":17,"down_votes":0,"body":"Eso es un tecnicismo sin sentido, es como que alguien te insulte con faltas de ortografía y que por eso no sea reportable.","replies":[{"poster":"Makò","date":"2016-02-11T13:07:19.739+0000","up_votes":1,"down_votes":36,"body":"es un tecnicismo de Riot games no mio.","replies":[{"poster":"Natchin","date":"2016-02-11T13:10:57.394+0000","up_votes":15,"down_votes":0,"body":"No. Los mismos rioters han dicho que escribir Easy, izi, o cualquiera de sus variables es reportable.","replies":[{"poster":"Makò","date":"2016-02-11T13:16:01.514+0000","up_votes":10,"down_votes":13,"body":"O vale te pido disculpas.\n\nNo sabia que Riot ya lo tomaba como un insulto lo cual ya era hora :3 \n\nGracias por aclarármelo así podre reportar con todo el rigor de la ley :D","replies":[{"poster":"Sirek","date":"2016-02-11T13:27:24.546+0000","up_votes":5,"down_votes":0,"body":"Efectivamente, Easy, Izi y cualquier derivación con intención de denigrar al rival es reportable (Ojo, es la intención y el contexto).","replies":[]}]}]}]}]}]},{"poster":"SL Forget","date":"2016-02-11T10:29:19.039+0000","up_votes":7,"down_votes":0,"body":"Reportalos.","replies":[{"poster":"Nitram Z","date":"2016-02-11T10:35:20.221+0000","up_votes":2,"down_votes":75,"body":"Por poner \"IZI\" ? es una expresión que forma parte de la comunidad latina en LoL no tiene nada de malo hasta se usa de forma irónica no se puede reportar por cualquier cosa que pongan y menos si no se trata ni siquiera de un insulto es ridículo tu comentario","replies":[{"poster":"Vastayan Grace ","date":"2016-02-11T11:55:01.492+0000","up_votes":21,"down_votes":0,"body":"izi hace referencia a la palabra inglesa \"easy\" que significa \"fácil\", se use como se use en una partida es un calificativo negativo para la misma. O lo que en la pantalla de reportes se traduce a \"actitud **POCO DEPORTIVA**\" \n\nSi somos tan permisivos dentro de nuestra comunidad como para que en cada partida se nos descalifique como jugadores por parte de nuestros homónimos como esperamos que el ambiente de los e-sports crezca en nuestra región y en el mundo. Al final vamos a terminar como en el futbol, insultándonos por estupideces e incapaces de apreciar el juego de los demás.","replies":[{"poster":"CapitanPalmito","date":"2016-02-11T14:46:14.218+0000","up_votes":1,"down_votes":4,"body":"***","replies":[{"poster":"2l2","date":"2016-02-11T14:54:04.254+0000","up_votes":19,"down_votes":2,"body":"> [{quoted}](name=CapitanPalmito,realm=LAS,application-id=v7qsfXsE,discussion-id=ps95QX3c,comment-id=0000000000000002,timestamp=2016-02-11T14:46:14.218+0000)\n>\n> \"Actitud poco deportiva\" pffffffffffffffffffffffffffffffffffffffffffffff es un juego jajajajaja.\n> \n> -¿a que te dedicas?\n> -Hago deportes.\n> -¿Sí? ¿Cual?\n> -Juego lol \n> \n> jajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajajaaja\n> \n> https://i.ytimg.com/vi/cEGSyED1MSg/hqdefault.jpg\n> \n> wetsop bichis (?)\n\n\nSi, aunque te duela el lol es un deporte.. El futbol tambien es un juego y es un deporte.. El ajedres tambien. \n\nEstamos en una era digital. Es obvio que los deportes de hoy en dia sean electronicos.. En Chile hace años se consideraban deportes como la rayuela, encumbrar volantin y subir el palo encebado.... Asi que si te parece estupido decir \"hago deporte\" recuerda que no todos los deportes son fisicos y que en tu pais aun se juega cosas tan estupidas como perseguir una pelota para meterla en un arco.","replies":[{"poster":"Novarum14","date":"2016-02-12T13:01:19.624+0000","up_votes":2,"down_votes":0,"body":"Eso es como decir que el lol es estúpido \"porque hay que apretar botoncitos\", bajo se punto de vista todo es estúpido.\n\n\nTodos los deportes son respetables.","replies":[]},{"poster":"AirMax15","date":"2016-02-11T19:12:53.446+0000","up_votes":3,"down_votes":2,"body":"Hermosa respuesta!","replies":[]},{"poster":"ZperKS","date":"2016-02-11T20:58:46.232+0000","up_votes":2,"down_votes":1,"body":"Completamente de acuerdo, hasta que dijiste \"cosas tan estupidas como perseguir una pelota para meterla a un arco\" No desmerescas a los otros deportes ;)","replies":[]}]}]},{"poster":"CapitanPalmito","date":"2016-02-11T14:28:38.124+0000","up_votes":1,"down_votes":17,"body":"***","replies":[{"poster":"Vastayan Grace ","date":"2016-02-11T14:39:17.894+0000","up_votes":13,"down_votes":0,"body":"\"gg\" \"wp\"... si lo que tenes que decir no es mejor que el silencio no tenes por que hablar. Cada uno sabe qeu hizo bien y mal en la partida, no es necesario rebajar a nadie ni desmoralizarlo. Vos no vas a ser mejor jugador por poner \"izi\" al final de la partida y al rival tampoco le aportas nada. \n\nDespués nos quejamos de la comunidad tóxica... Cambiando lo básico se empieza.","replies":[]}]},{"poster":"Summer Nights","date":"2016-02-11T12:09:54.569+0000","up_votes":9,"down_votes":0,"body":"Riot ya aclaro que usar ese tipo de expresiones anti-deportivas es motivo valido de report hace bastante lol","replies":[]}]}]}]},{"poster":"CapitanPalmito","date":"2016-02-11T14:19:14.318+0000","up_votes":2,"down_votes":22,"body":"***","replies":[{"poster":"2l2","date":"2016-02-11T14:40:45.411+0000","up_votes":14,"down_votes":1,"body":"> [{quoted}](name=CapitanPalmito,realm=LAS,application-id=v7qsfXsE,discussion-id=ps95QX3c,comment-id=000c,timestamp=2016-02-11T14:19:14.318+0000)\n>\n> No te esta insultando, solo esta diciendo que le fue, o le parecio facil... que tiene de malo eso, es una gaste, una burla, un chascarrillo, yo durante toda la partida estoy Ctrl 4 riendome del rival y burlandome, asi gane, pierda, o aun me este llendo pesimo en linea (peor si le estoy dando una paliza spameo Ctrl 4 a morir, bajo torre o en medio de la tf), no puede ser que sean tan suceptibles, que lloren por que les pusieron izi, ya se pasan... haganse hombres ! si no anda a jugar Mundo Gaturro, o Barby Girl.\n\nLas burlas del juego estan para eso y son parte del mismo. \n\nPero si ganas una partida y dices \"izi\" no estas siendo un buen ganador.. Estas denigrando a tu adversario, ojo no lo estas insultando, pero la actitud de \"sobrado\" es baneable por ser una actitud negativa  y eso  es lo que hay que eliminar en el juego. \n\nRecuerda que esto ya es un deporte y detras de las pantallas no hay robots, hay personas. Por lo que Riot sanciona a la gente que no aprendio a socializar bien y a los que aun creen que internet es anonimo y puedes insultar o actuar de manera hiriente.","replies":[]}]}]}