{"poster":"Azirious Mistake","date":"2015-10-17T00:33:59.895+0000","title":"Tahm Kench is a testament to the incompetence of Riots Balance Team","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"So you have a tank champion who does ridiculous damage but for some reason sat at a 38% win rate? So what do you do, you buff his damage? really? smh, even a bronzie could tell you if you have a champion who does damage you should buff their utility and not their already bonkers damage, and now he is pick or ban. Normally I&#039;m pro riot and support their decisions 90% of the time but this is ridiculous, how has such an OP champion not been nerfed yet? Or is he one of these juggernaut tank-sassin things i&#039;ve heard so much about?","replies":[{"poster":"Gravelord","date":"2015-10-17T01:13:53.243+0000","up_votes":1,"down_votes":0,"body":"So what is your opinion on Garen and Darius etc?","replies":[{"poster":"Azirious Mistake","date":"2015-10-17T01:37:23.010+0000","up_votes":1,"down_votes":0,"body":"Garen is fine if not a bit too strong at the moment because of his true damage and E damage and I haven't seen Darius after his nerf but people will still whine about him because of how his ult interacts with his passive.","replies":[{"poster":"JasonWazza","date":"2015-10-18T02:23:43.538+0000","up_votes":1,"down_votes":1,"body":"A bit too strong is garen?\n\nBack with the juggernaut patch i played Gnar W max into garen and made him 0/6 with 20 CS by end of laning phase, he was still relevant for the rest of the game because he eventually got levels and his true damage just made him relevant.","replies":[{"poster":"Azirious Mistake","date":"2015-10-18T02:53:59.593+0000","up_votes":2,"down_votes":0,"body":"Beating a pleb in a lane youre meant to win is not an accurate measurement of champion balance.","replies":[{"poster":"JasonWazza","date":"2015-10-19T06:45:28.205+0000","up_votes":1,"down_votes":0,"body":"No my point is that he got smashed and still was more relevant then me on gnar (who is a really relevant late game champion), how is that just a BIT too strong?\n\nThat's fucking ridiculous.","replies":[]}]}]},{"poster":"KidConfucius","date":"2015-10-17T05:32:49.587+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FioraTheExplorer,realm=OCE,application-id=Ntey9fRZ,discussion-id=lqXre5AP,comment-id=00000000,timestamp=2015-10-17T01:37:23.010+0000)\n>\n> Garen is fine if not a bit too strong at the moment because of his true damage and E damage and I haven't seen Darius after his nerf but people will still whine about him because of how his ult interacts with his passive.\n\ngaren is fine?? he may not be the strongest , but has one of the most over stuffed kits there is..at least darius has exploitable weaknesses  . \n\nPassive lets him regen , at least late game , at an alarming rate , even mundo doesnt regen passively like that , so killing him becomes a waste of time and resources. Q gives him a slow cleanse + speed boost + enhanced AA +silence.  W gives scaling bonus resistances + an activate for 30% reduction ( thats almost a third of the incoming damage ) . E isnt all that bad , apart from the fact it can critically strike , what makes it bad is that it is the general follow up to being hit by the Q silence , which means your stuck in the spin unable to properly respond for that period . And finally R , which is a large damage single target nuke , which DRASTICALLY increases its damage based on its targets missing hp , up to 40%.  And all this on a guy who is generally built mostly tank. which makes him extremely difficult to peel or kill late game. \n\nAnd your complaining about kench? He only has two aggressively usable abilities , his Q and W.  Q is a low damage poke which slows , W deals high hp% damage , but that is his only really attack . His E is just a sheild , and his ult is one of the most useless ults there is. Just a really really slow teleport. Of course his damage is going to seem high when it comes from just one source. You need to look at the kit as a whole. Garen is broken as he has far too much in his kit. Kench is just a meat sheild. He cant even use his main source of damage untill he has hit you three times ( which you get a warning sign of the stacks on you ). All kench can do is remove someone from the field for a few seconds.","replies":[{"poster":"Azirious Mistake","date":"2015-10-17T06:50:49.243+0000","up_votes":1,"down_votes":0,"body":"Garen is still heaps more fun to vs than Tahm and btw his ult damage didnt get changed, only change they made was that it does true damage to the villain which I agree is stupid.","replies":[]}]},{"poster":"Gravelord","date":"2015-10-17T02:03:34.014+0000","up_votes":1,"down_votes":0,"body":"I don't mind Darius now, i still dislike Garen a lot. Destroy him in lane in cs and kills. He basically gets rewarded for doing poorly. i don't like the concept of it at all. Does true damage to the person who is doing well in game, silences, super fast and just ulties at 1/3 health. Doesnt seem fair IMO.","replies":[]}]}]},{"poster":"SkarSkarSkarner","date":"2015-10-18T02:31:37.609+0000","up_votes":1,"down_votes":0,"body":"I played Garen once after his rework. I was up against another Garen. I built the tanky bruiser sort of build that's recommended and what Garen should be building. They built full AD assassin (Zed build basically) and wrecked. So I guess the rework was to turn him into that. An AD assassin.\n\nI haven't had any problems with Darius because I never see one. Same with Garen actually, rarely see him. But at least Darius builds like Darius still and plays like Darius.\n\nAbout Tahm Kench, he is strong and I am glad people are finally admitting it instead of saying he's super weak. By that logic, Thresh is super weak.","replies":[]},{"poster":"JasonWazza","date":"2015-10-17T01:58:56.273+0000","up_votes":1,"down_votes":0,"body":"47% win rate, 25% ban rate, 1.1% pick rate.\n\nWhy are you complaining?","replies":[{"poster":"Azirious Mistake","date":"2015-10-17T02:24:29.030+0000","up_votes":1,"down_votes":0,"body":"because hes an unhealthy champion.","replies":[]}]}]}