{"poster":"Krizalisz","date":"2018-06-20T19:05:19.843+0000","title":"Erre mia  counter most komolyan!!","subforum":"Csapat- és csapattagkereső","embed":{"description":null,"url":"https://cdn.discordapp.com/attachments/437346859233705984/459068447595298827/unknown.png","image":null},"up_votes":1,"down_votes":0,"body":"0.07 SEC alatt meghaltam megis mi ez a faszom balance a jatekban ?? o.o","replies":[{"poster":"Sylasi Elvtárs","date":"2018-06-21T16:57:10.208+0000","up_votes":2,"down_votes":0,"body":"Armor.","replies":[]},{"poster":"Nemin","date":"2018-06-20T19:08:15.596+0000","up_votes":2,"down_votes":1,"body":"Őszintén, ki nem one shottol, ha már >10 killje van? Mind iszonyú sokat haltatok, az rá a counter, hogy jobban vigyáztok az életetekre.","replies":[{"poster":"Krizalisz","date":"2018-06-21T09:12:59.197+0000","up_votes":1,"down_votes":4,"body":"Najo edes fiam de ez egy plat 3 mas game nem am bronz vagy silver szerinted csak ell lett fedelve hat kurvara nem söt mi vezettünk meg vett egy itemet es bazdmeg mindenkit 1 shotol es nem is baj ha 100 rol 0 megöl  a probléma a speedel van na de most komolyan 0.07 na nemar bazdmeg azert ezt ne magyarazd be nekem hogy ez balance föleg ugy ne hogy beta ota jatszom mert ezt kurvara nemtudom elfogadni. 1 itemmel ugyanezt megcsinalta  a faszert van egyire elkurva a jatek mostansag.","replies":[{"poster":"Nemin","date":"2018-06-21T09:16:31.015+0000","up_votes":3,"down_votes":1,"body":"Akkor miért nem pickelsz te Rengart és vered végig a mezőnyt csellengőig?","replies":[{"poster":"Krizalisz","date":"2018-06-21T10:12:42.890+0000","up_votes":1,"down_votes":2,"body":"Igazad van köszi hogy emlekeztettel miert nem irtam ide a beta ota :)","replies":[{"poster":"Nemin","date":"2018-06-21T10:32:59.940+0000","up_votes":2,"down_votes":0,"body":"Nézd, aki passzív-agresszív stílusban ír, az nem én vagyok.\n\nMilyen reakcióra számítottál? Riotosra? Nincs itt olyan, aki nézi a fórumot. Olyanokra, akik egyet fognak érteni? Rengo erős karakter, de szétfeedelve ki nem? Vagy a csapatmunkátok, vagy a teamcompotok vagy az egyéni teljesítményetek rosszabb volt. De csak nem kell ezt egy *platosnak* elmesélnem.","replies":[]}]}]}]}]},{"poster":"Temp65432","date":"2018-06-21T06:41:48.882+0000","up_votes":2,"down_votes":1,"body":"az a counter hogy nem adsz neki 10killt. te az 1. itemed farmolod ő neki 3.5 kész volt","replies":[{"poster":"Krizalisz","date":"2018-06-21T09:16:33.905+0000","up_votes":1,"down_votes":0,"body":"vicces vagy 1 item et se adjak neki :) mert ugyanezt megcsinalta {{item:3147}}  es nem csak en akadtam ki azon a jateokon  amit amugy kurvara nyertönk.","replies":[{"poster":"Temp65432","date":"2018-06-22T16:59:52.012+0000","up_votes":1,"down_votes":0,"body":"nem mindegy hogy 3. percben van meg neki a duskblade vagy 15.ben (főleg mivel evével kényelmesen el lehet lopkodni a campjeit, hogy ne tudjon farmolni olyan gyorsan). Mivel plat3as game ezért valószínűleg tudod, hogy rengarnak jelentős sebzése a passivejából jön, amit akkor kap meg ha megöl valamit. nem mindegy hogy 1 itemmel mennyi damage van. Arról nem is beszélve, hogy eve ultival lehet dodgeolni a rengarnak a sebzését, csak egy minimális reflex kell hozzá (persze ha leveszed arcal a morgana Q-t akkor kicsit nehéz. Gondolom morgana is tul op). Hogy ez neked nem jött össze már igazán nem a balance team hibája.\n\nAzt meg duplán nem értem, hogy ha béta óta játszol akkor minek a dráma. Ennyi idő alatt már igazán megszokhattad volna, hogy az assassinoknak az a dolguk hogy assassinkodjanak.\n\nJa és még annyi, hogy elég hülyén néz ki, amikor az az egyetlen vitaalapod, hogy bezzeg te plat3as vagy meg béta óta játszol szóval ennyire ne reklámozd.","replies":[]}]}]},{"poster":"SkUłł","date":"2018-06-28T08:27:15.874+0000","up_votes":1,"down_votes":0,"body":"bannolni kéne xd","replies":[]},{"poster":"B4zi Joe","date":"2018-06-25T16:20:13.964+0000","up_votes":1,"down_votes":0,"body":"Sajna ez egy csapat orientált játék. Ha a te int-elsz a csapatod meg fogalmatlan akkor go next....\nAzt tudod csinálni, hogy mélyebben vardlsz, hátha látsz valamit és passzívan játszol. \nAztán vagy akarnak nyerni a csapattársaid is vagy nem....","replies":[]},{"poster":"Levesente","date":"2018-06-21T00:24:05.889+0000","up_votes":1,"down_votes":0,"body":"{{item:3157}} {{item:3026}}","replies":[]},{"poster":"LMátyás","date":"2018-06-20T21:15:25.692+0000","up_votes":1,"down_votes":1,"body":"Meg bírom a Soraka-t.","replies":[]},{"poster":"LMátyás","date":"2018-06-20T21:14:31.207+0000","up_votes":1,"down_votes":1,"body":"Rengo, mi mást vártál?","replies":[]}]}