{"poster":"dolphinosplash24","date":"2017-03-16T00:12:18.302+0000","title":"counters to darius?","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"Ok so i was playing a ashe game and the enemy darius got really fed. You&#039;d think as ashe i would be able to kite him but he just grabbed me with e and killed me.And then i played another game where i was kind jg and met the same darius. and the same thing happened. can anyone give me counter tips against darius. Unrelated but the darius himself was extremely annoying constantly bming in game and the after he spammed something that said his account could not earn loot due to behavioral issues.","replies":[{"poster":"Lil Lewd Witch","date":"2017-03-16T00:14:35.573+0000","up_votes":2,"down_votes":0,"body":"Ashe can be a good counter to him outside of reach, if he grabs you and you don't get any peel from your team. He's going to wreck you, most likely. His Counters are kiting and peel, but Ashe doesn't really self-peel that well in a 1v1 situation, typically.","replies":[]},{"poster":"EbonyBladeJ88","date":"2017-03-16T01:01:41.815+0000","up_votes":1,"down_votes":0,"body":"Are you referring to counters to him when playing AS Ashe? Or are you looking for alternate champs to choose when going up against a Darius?\nI can give you PLENTY of suggestions on the latter, but not the former.","replies":[]},{"poster":"invisiblecat1","date":"2017-03-16T00:41:58.326+0000","up_votes":1,"down_votes":0,"body":"Ban him\nPeople only have the excuse of him having no mobility, but if you have no mobility too, he has a pull and more movespeed so you are dead\nalso \nPOINT AND CLICK TRUE DAMAGE","replies":[]},{"poster":"MagicFlyingLlama","date":"2017-03-16T00:24:21.001+0000","up_votes":1,"down_votes":0,"body":"The way to beat darius is to not fight darius.\nThis prevents him getting fed, and once fed, from killing you.","replies":[]},{"poster":"AFilthyCaitMain","date":"2017-03-16T00:19:23.525+0000","up_votes":1,"down_votes":0,"body":"As Ashe you need to waste his grab while kiting, so be careful, then when he does go full on kite mode. Or play Caitlyn and be far our of reach","replies":[]},{"poster":"1wolfpack","date":"2017-03-16T00:16:44.097+0000","up_votes":1,"down_votes":0,"body":"I find that when Im having trouble vs a champion playing that champion for a few games helps me understand there strengths and weaknesses\n\nwith that said I dont play top very often but I will suggest these two items depending on if you are an AP or AD champion\n\n{{item:3123}}  or {{item:3165}}","replies":[]}]}