{"poster":"NeoViolet ","date":"2020-01-17T19:47:47.005+0000","title":"RIOT ARREGLEN EL CLIENTE Y EL JUEGO POR FAVOR","subforum":"Problemas Técnicos","up_votes":5,"down_votes":0,"body":"Ya desde hace meses el cliente anda hecho un desastre, todo tipo de bugs y problemas de rendimiento dentro del cliente. Y por si fuera poco, desde que salió Aphelios el juego me comenzó a tirar system error cada una o cada dos partidas (esto se está volviendo al parecer común en América Latina y en maquinas con Linux), comencé también a tener problemas de fps super raros, podré estar jugando a mas de 60 fps tranquilamente pero de repente se me bajan 30 fps, crasheos constantes del juego después de la selección de campeón, la lista de amigos apenas funciona.\n¿Qué carajo están haciendo con el juego?\nAdemás el soporte al cliente apenas ayuda, ya que como todo se basa en respuestas prediseñadas, las soluciones dadas casi nunca funcionan ya que no necesariamente son para el problema que uno tiene. Es ridículo como estuve jugando este juego un buen tiempo ya, lo jugué en varias ocasiones en varios años distintos y nunca tuve este problema, siempre estuve a más de 60 fps estables, y sin embargo, ahora dicen que la culpa del system error es de mi pc ¿? Sí, es un asco mi computadora, y apenas llego a los requisitos mínimos, pero como dije, estuve todo este tiempo jugando a más de 60 fps estables con bajones ocasionales como los ocurridos en estos últimos parches. Dudo demasiado que sea culpa de mi PC, tengo amigos que a duras penas lo juegan y no se les crashea. Además el system error está ocurriendo también en PC's de gamma alta y en el subreddit de linux aparecieron algunos post respecto a este error. ¿Acaso cagaron algo en el anti-cheat?\nProbé todas las soluciones dadas, formateé la PC, modifiqué el firewall, llegué a jugar con el antivirus desinstalado, etc.\nRealmente, dan asco, a ver si pueden solucionar de una buena vez este cliente y el juego. Entiendo que no tenga muchos derechos a quejarme con esta pc basura, pero me parece ridículo que este error haya aparecido de la nada, ocurra de una manera super inconsistente (se crashea en algunas partidas, otras no) y que además le ocurra a gente de todo tipo. \nTodavía no me creo que con toda esa cantidad de dinero no puedan hacer algo decente con ese cliente.\n\nEDIT: Estuve averiguando un poco más y al parecer hay cierta incompatibilidad con Windows 7 desde hace \nunos parches. ¿En serio me tengo que cambiar el SO por solo un juego? xd lrpm\n","replies":[{"poster":"07 Ghost","date":"2020-01-17T20:07:38.996+0000","up_votes":2,"down_votes":0,"body":"ni te gastes en cambiar a win 10 si tenes problemas de fps vas a putear como nunca y tambien tira system error, te patea de la sala y demas cosas. el juego lo re cagaron desde que salio aphelios","replies":[{"poster":"NeoViolet ","date":"2020-01-17T21:07:03.754+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=07 Ghost,realm=LAS,application-id=X54mVVp0,discussion-id=yLhhrIWx,comment-id=0001,timestamp=2020-01-17T20:07:38.996+0000)\n>\n> ni te gastes en cambiar a win 10 si tenes problemas de fps vas a putear como nunca y tambien tira system error, te patea de la sala y demas cosas. el juego lo re cagaron desde que salio aphelios\n\nVos tenes W10 y te pasa eso?","replies":[{"poster":"07 Ghost","date":"2020-01-18T07:03:22.681+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NeoViolet ,realm=LAS,application-id=X54mVVp0,discussion-id=yLhhrIWx,comment-id=00010000,timestamp=2020-01-17T21:07:03.754+0000)\n>\n> Vos tenes W10 y te pasa eso?\n\ntengo win 10, me pasa los fps, ms, system error, los microcortes, el chat bug, la pantalla que nunca aparece, a veces se cuelga en la seleccion de campeon y demas, tambien tengo win 7 en otra pc y es injugable.\n\nProcesador: i7 720q\nRam: 12 GB\nTarjeta de video: amd 5850\nOS: W7 64bits\n--\nProcesador: i7 7700HQ de 2.81GHz\nRam: 12 GB\nTarjeta de video: GTX 1050\nOS w10 64bits","replies":[{"poster":"NeoViolet ","date":"2020-01-18T19:14:40.835+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=07 Ghost,realm=LAS,application-id=X54mVVp0,discussion-id=yLhhrIWx,comment-id=000100000000,timestamp=2020-01-18T07:03:22.681+0000)\n>\n> tengo win 10, me pasa los fps, ms, system error, los microcortes, el chat bug, la pantalla que nunca aparece, a veces se cuelga en la seleccion de campeon y demas, tambien tengo win 7 en otra pc y es injugable.\n> \n> Procesador: i7 720q\n> Ram: 12 GB\n> Tarjeta de video: amd 5850\n> OS: W7 64bits\n> --\n> Procesador: i7 7700HQ de 2.81GHz\n> Ram: 12 GB\n> Tarjeta de video: GTX 1050\n> OS w10 64bits\n\nAgh, que asco. Solo nos quedará o esperar, o cambiarnos de juego  {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]},{"poster":"ObscureAngel","date":"2020-01-17T22:25:37.506+0000","up_votes":1,"down_votes":0,"body":">Todavía no me creo que con toda esa cantidad de dinero no puedan hacer algo decente con ese cliente.\n\nNo es que no puedan hacer algo con esta basura de cliente, sino que les re chxpx un huevx, sólo quieren la plata, nada más","replies":[]},{"poster":"takeaimnow","date":"2020-01-17T21:42:56.004+0000","up_votes":1,"down_votes":0,"body":"yo bajo de win10 a 8.1 porque me andaba muy lento el 10","replies":[]},{"poster":"Deezko","date":"2020-01-17T20:00:25.307+0000","up_votes":1,"down_votes":0,"body":"Windows 7 dejo de recibir actualizaciones hace 3 dias, ya se encuentra sin soporte, te recomiendo actualizar a otro windows mas reciente","replies":[]}]}