{"poster":"4NoxiousHours","date":"2016-01-21T22:56:51.193+0000","title":"What's the estimated time for the new champion select to come back?","subforum":"Gameplay","up_votes":15,"down_votes":1,"body":"I don&#039;t want to put up with kids in this old champion select during my placements.","replies":[{"poster":"Xonra","date":"2016-01-22T03:54:08.397+0000","up_votes":2,"down_votes":1,"body":"If you get it by next week I would be surprised (I'm not being sarcastic). Lyte said (paraphrasing, etc) that they weren't as prepared to launch Dynamic queue as they thought (which we all knew I'm fairly certain). \n\nThey are working their butts off, but I think they tried way too hard to rush it out instead of making sure they were fully prepared first. They just wanted it out before the season started, but with the tons of other things going on, I think maybe they should have waited, or scaled some of it back.\n\nIf it does suddenly pop up tomorrow, I would very much expect it to be down by the end of the day.","replies":[{"poster":"LegendmakerGX","date":"2016-01-22T15:24:32.725+0000","up_votes":2,"down_votes":0,"body":"....\nNo they are not even working on it as hard as they should be. If I recall this was in PBE 2 times? definitely sure 2 times and for them to still fk it up when PEOPLE TELL THEM THERE ARE PROBLEMS then ya shows how much riot listens. There was another post where PBE players told riot about this but I can't find it, I think Riot took it down for being in (WRONG SECTION).","replies":[]}]},{"poster":"Hellioning","date":"2016-01-22T03:10:10.090+0000","up_votes":1,"down_votes":0,"body":"There's no ETA. They generally like to avoid those.","replies":[{"poster":"FrozenMistninja","date":"2016-01-22T04:05:28.657+0000","up_votes":2,"down_votes":0,"body":"They get better about eta's every year though, in season one they had more than one patch that was down for so long that they gave the entire community RP for free. Happened again in season 2, the fact was the tried to give eta's but it was just taking longer to fix issues than planned. I recall a large portion of the community blowing up the old League of Legends Forums Website saying they would rather have no eta than one that gets them excited all day to sit and wait at the computer hours and hours to not get to play. Ever since the eta's have been non existent for the most part, but this time Riot is right, we asked for it to be that way (I know I sure did)","replies":[{"poster":"iTekk","date":"2016-01-22T16:09:01.897+0000","up_votes":1,"down_votes":0,"body":"It's not an uncommon thing to not give ETAs that you cannot reliably meet. People get more frustrated when they get an ETA that keeps getting pushed back, than if they are not given an ETA at all. Additionally, the engineers working to solve the problem need to be focused on solving the problem, and not racing to meet some deadline, resulting in a broken product being released, which then needs to be taken down and repaired again, further distancing their customers.\n\nNot sure why this isn't blatantly obvious.","replies":[{"poster":"FrozenMistninja","date":"2016-01-23T02:03:08.624+0000","up_votes":1,"down_votes":0,"body":"So you basically repeated what I said, thanks for your time I guess.","replies":[]}]}]}]},{"poster":"Makneto","date":"2016-01-22T04:15:47.057+0000","up_votes":1,"down_votes":0,"body":"soontm.jpg","replies":[]},{"poster":"2B Father Servo","date":"2016-01-21T23:46:34.121+0000","up_votes":1,"down_votes":0,"body":"I don't think there is any yet Lyte would have updated his twitter if there was","replies":[]},{"poster":"4NoxiousHours","date":"2016-01-21T23:39:51.036+0000","up_votes":1,"down_votes":0,"body":"TIIIIIIIMEEEE","replies":[]},{"poster":"AnonymousPoro","date":"2016-01-21T23:14:45.772+0000","up_votes":1,"down_votes":0,"body":"Bumpity-bump.","replies":[]},{"poster":"Chaotic Sage","date":"2016-01-21T22:57:30.751+0000","up_votes":1,"down_votes":0,"body":"Bump cause I wanna know too.","replies":[]},{"poster":"SpecterVonBaren","date":"2016-01-22T06:36:17.333+0000","up_votes":1,"down_votes":3,"body":"I dunno, I'm currently loving it being down. It takes half the time and we have flexibility when someone sees a champ they're no good playing against on the enemy team and switch to a different role.","replies":[]}]}