{"poster":"4NoxiousHours","date":"2015-01-14T07:15:11.634+0000","title":"MEDDLER, one of these days you'll come to my thread, My Kingdom, My Sanctuary","subforum":"Gameplay","up_votes":34,"down_votes":1,"body":"And we will Discuss about Diana's plans and the Status on how you feel about Akali currently.\r\n\r\n\r\n\r\nOne day meddler, one day.","replies":[{"poster":"Meddler","date":"2015-01-14T08:28:12.292+0000","up_votes":38,"down_votes":1,"body":"My current thoughts/couple of general comments:\n\nAkali - Lot of fun and a good alignment between her kit and theme, Lacks sufficient counterplay, resulting in frustrating playing against experience especially when she's ahead. Removal of the mitigation stats from her W's reduced her dueling power against tankier champs which is a positive, squishy targets still struggle with a lack of options sometimes however. The live balance team's currently experimenting with her ult range to see if reducing that's an appropriate lever to put her into a better spot (her having high reliability's less of an issue if it's more practical to stay out of her zone of threat or at least force her to use another ult charge before getting to you).\n\nDiana - Would benefit from being more clearly an assassin or a fighter, rather than a generalized mixture of the two (a good fit for her personality that unfortunately results in her being hard to give sufficiently clear strengths and weaknesses when strong enough to be picked). In an ok state, would probably require that work be done to get her to what you'd call a really good state/be a character we felt was good for the game if a really common pick. Not currently being worked on. \n\nBoth of them - Bit much overlap between the two, both utilizing a similar combat approach through their ults, Q's and cleaves. Ensuring the two of them end up with a few more points of distinction would do both some good (which personally suggests Diana should be pushed towards being more of a fighter, though I can see the argument for assassin as well).","replies":[{"poster":"Hexten","date":"2015-01-14T09:22:22.649+0000","up_votes":22,"down_votes":1,"body":"Wouldn't nerfing her ultimate range be nerfing her strength? It doesn't really add any weaknesses, and the same problem still exists, if she gets within ult range, and has more stats, you will just die if you are squishy. \"Staying out of range\" is not good counterplay. You are reinforcing players to \"stay out of range' which isn't a good message. Nerfing her ult range makes her more feast/famine.\n\nHave you tried hitting her sustain instead? Because this is the stat that makes Akali very forgiving to play when she is ahead. Akali is frustrating to play against when she is ahead. Spellvamp directly scales with how far ahead you are in a game. She sustains alot against squishy targets because they don't build much resist, so hitting the sustain will give Akali more counterplay against squishies than just straight-out nerfing her ult strength. That way squishies can fight back since Akali is not out-healing the damage done to her.\n\nThis just nerfs Akali against high-elo players, and doesn't do anything against low-elo players at all. Just staying out of range is not a sufficient reason for counterplay. Hitting her sustain does.\n\n> (her having high reliability's less of an issue if it's more practical to stay out of her zone of threat or **at least force her to use another ult charge before getting to you**).\n\nThis can be achieved by removing Mark of the Assassin detonation via Crescent Slash. That adds metric loads of counterplay than nerfing the ult range ever could. More specifically a thread that was made by another player: http://boards.na.leagueoflegends.com/en/c/gameplay-balance/hMJmmtbp-a-really-simple-change-to-add-finesse-into-playing-akali , explains in much more depth. It's worth the look.","replies":[{"poster":"Knight SoIaire ","date":"2015-01-14T12:41:59.054+0000","up_votes":4,"down_votes":0,"body":"also staying out of range is not real counter play unless your range is bigger \nright now staying out of akalis range is the only counter play (they want to make it her counterplay but it already is) but her range is big enough to completly get you out of lane under a threat of death and allowing akali to snowball\n\nbut i dont agree on simply nerfing her sustain either, that thing is a core to someone who is both squishy and walks pre 6 \n\nwhat is the problem is that akali is 100% point and click meaning that any squish who i in her range is dead and said squish can blow all the skills and all the flashes he has but that does not change the outcome\n\nyou want to ballance akali then add interaction and allow her to fail bursting you down or allow her enemy to stop her from continuing to chunk you down\n\nrange change does not bring anything to the table \nall that it will accomplish will be either wrecking akali (unable to retaliate when enemies beat her down) or not changing anything (still lunges to you from miles away and you r dead)\n\n","replies":[{"poster":"Dantilq","date":"2015-01-14T13:50:53.864+0000","up_votes":2,"down_votes":1,"body":"Akali also deal very high amount of burst in a short amount of time, and there is very little timing window to handle her.\n\nHer Q have too high amount of up-time, and it together with her R E means the burst hits extremely fast, the travel-speed of her R is very high as well. As she is a highly reliable champion, if she is to stay that way I would instead add timing-windows to her.\n\nLower Q duration considerably, while increasing cooldown of it, but maybe buff damage. Lower travel-speed of her ulti to make it easier to react to her.\n\nAfter all that figure out other ways to make her work, but she might need a full rework. Her passive is not healthy for assassin, her E is extremely uninspiring, and her Q and R is too reliable.","replies":[{"poster":"Hexten","date":"2015-01-14T20:09:54.730+0000","up_votes":2,"down_votes":1,"body":"Removing the only depth Akali has is the wrong way to go.\n\nDouble-marking is less straightforward, than just R->Q whenever the cooldown is up. Lowering the duration of MoTA just makes her more braindead to play since all you have to think about is whenever Q is off cooldown, and dashing right in to proc it.\n\nIf the mark duration is the problem, then simply reducing the damage on the Q is the right way to go, so it means you have to achieve a double-mark to do most of Akali's damage.","replies":[{"poster":"Dantilq","date":"2015-01-15T10:54:41.431+0000","up_votes":1,"down_votes":0,"body":"Problem is she have no real downtime, except when she have to R stacks, and that is not visible at all right now.\n\nHer Q is constantly up, as it's 4 sec cooldown at max level, and it stays for 6 second. If you ever get within range of her she pop most of your health by jumping on you. If she ever get ahead prepare for some very unfun tower-hugging.\n\nDouble-marking is less straightforward, but not what I would call depth, she require some real depth, and some real way of failing with an assassination. She require either less reliability, or a timing window when you can attack her. She lack counterplay, and what you call depth is not enhancing her counterplay much at all..","replies":[]}]}]},{"poster":"Sire Hippington","date":"2015-01-14T17:04:52.820+0000","up_votes":1,"down_votes":0,"body":"Agree, less range would only reduce her viabillity while not changeing much about her low counterplay.\nLess sustain would only make her more feast or famin, even weaker pre 6, and more reliant in bursting down a target quickly in one combo as she can't sustain for prolonged fights(hello talon^^)\n\nThe probably esiest way to increase counterplay would be changeing her Q into a skillshot, or changeing the mark to work a bit like braums passive, dealing physical damage to the marked target adds a stack, at 3 stacks it gets triggert, which would force akali to add another aa to the normal R-Q-E-AA rotation.\nAditionally, i would shift some damage from her ult(currently at 300/525/750+1.5 with all 3 steps) onto her E and evt Q or passive, as those atleast need energy and have cd.","replies":[{"poster":"Hexten","date":"2015-01-14T20:04:34.805+0000","up_votes":1,"down_votes":0,"body":"Completely removing her sustain is not the suggestion. Merely lowering it won't make her more feast/famine. Spellvamp is only useful if you are ahead, it feels really bad when you are behind. So reducing the strength of spellvamp on Akali would reduce her feast side much considerably, since sustain doesn't really help much when you are behind.","replies":[{"poster":"Dantilq","date":"2015-01-15T10:56:44.854+0000","up_votes":1,"down_votes":0,"body":"If sustain doesn't help much when behind, why simply lower it, why not remove it altogether?","replies":[]}]}]}]},{"poster":"BluParadox","date":"2015-01-14T21:45:40.243+0000","up_votes":1,"down_votes":1,"body":"I'm an akali main, and I while I'd hate to see her nerfed, I think if I were to look for a space to add counter-play it would be increasing the cooldown on her ult. Right now you can ult to someone (say Caitlyn) and even if they blow all their escapes (net, flash, etc) you still can catch up to them, because you can ult in between each escape (or during the escape animation). You really feel the 2 second cooldown levels 6-10, and moving the cooldown to 1 second by level 16 definitely removes a lot of your opponents window to escape.","replies":[{"poster":"Hexten","date":"2015-01-14T23:07:20.737+0000","up_votes":1,"down_votes":0,"body":"As a squishy melee, she needs to take out high priority targets fast. The length of fights naturally are shorter as the game goes on, so it makes sense to have the cooldown in-between charges scale down per rank.\n\nSustain however, can be reduced, because if you play Akali correctly (i.e. go in the right time, avoid damage), you probably didn't need that much sustain in the first place.","replies":[]}]},{"poster":"Grimspeake","date":"2015-01-14T10:53:33.950+0000","up_votes":4,"down_votes":16,"body":"> [{quoted}](name=Hexten,realm=NA,application-id=3ErqAdtq,discussion-id=zXf6FiAF,comment-id=00000002,timestamp=2015-01-14T09:22:22.649+0000)\n\n> This just nerfs Akali against high-elo players, and doesn't do anything against low-elo players at all. Just staying out of range is not a sufficient reason for counterplay. \n\nthats like saying just because a tristana in bronze is constantly on the front line and dying so she needs a buff? being bad doesnt mean a champion should be nerfed it means u need to play better.","replies":[{"poster":"warpenguin555","date":"2015-01-14T14:18:02.524+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Grimspeake,realm=NA,application-id=3ErqAdtq,discussion-id=zXf6FiAF,comment-id=000000020000,timestamp=2015-01-14T10:53:33.950+0000)\n>\n> thats like saying just because a tristana in bronze is constantly on the front line and dying so she needs a buff? being bad doesnt mean a champion should be nerfed it means u need to play better.\n\ni agree with what you are saying, dont get me wrong. but Akali is also one of the most frustrating champions to see on the enemy team because no matter what you do, she will get fed and rape everything that moves. Its not a fun thing to play against.","replies":[{"poster":"TaylorGaylor","date":"2015-01-14T17:04:41.918+0000","up_votes":1,"down_votes":0,"body":"It doesn't matter \"what elo\" the changes will affect, all champion changes should be treated will respect to all elos. :s","replies":[]}]}]}]},{"poster":"Adalore","date":"2015-01-14T09:06:58.649+0000","up_votes":5,"down_votes":0,"body":"Also another reason to throw Diana into the \"Fighter\" category is that we have like...no AP fighters that can jungle.","replies":[]},{"poster":"4NoxiousHours","date":"2015-01-14T21:19:33.036+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=zXf6FiAF,comment-id=0000,timestamp=2015-01-14T08:28:12.292+0000)\n>\n> My current thoughts/couple of general comments:\n> \n> Akali - Lot of fun and a good alignment between her kit and theme, Lacks sufficient counterplay, resulting in frustrating playing against experience especially when she's ahead. Removal of the mitigation stats from her W's reduced her dueling power against tankier champs which is a positive, squishy targets still struggle with a lack of options sometimes however. The live balance team's currently experimenting with her ult range to see if reducing that's an appropriate lever to put her into a better spot (her having high reliability's less of an issue if it's more practical to stay out of her zone of threat or at least force her to use another ult charge before getting to you).\n> \n> Diana - Would benefit from being more clearly an assassin or a fighter, rather than a generalized mixture of the two (a good fit for her personality that unfortunately results in her being hard to give sufficiently clear strengths and weaknesses when strong enough to be picked). In an ok state, would probably require that work be done to get her to what you'd call a really good state/be a character we felt was good for the game if a really common pick. Not currently being worked on. \n> \n> Both of them - Bit much overlap between the two, both utilizing a similar combat approach through their ults, Q's and cleaves. Ensuring the two of them end up with a few more points of distinction would do both some good (which personally suggests Diana should be pushed towards being more of a fighter, though I can see the argument for assassin as well).\n\nFirst before we discuss I want to say, Welcome to my sanctuary (:\n\nNow, Akali is very beloved champions by many players and what people want here is her to be nerf'd because they feel like even if shes behind she can still snowball and catch up and become more of a deadly enemy. For me, I would consider her Resets on her ult AND the burst to be the problem because she's able to do it 3 times WITH a large range. I feel like it would be a better Idea to try out Akali in PBE by testing which benefits her more, the range or the fact that WITH range she's able to continuously burst the enemy to die. Many people who play league in bronze/silver/gold aren't mentally capable to have an \"option\" on how to defeat this champion because she's quick and unpredictable when she's under stealth. It could also be that her passive is the key to the insane burst that she creates with items.\n\nMoving on to Diana, Diana feels like an Assassin because she's squishy and is related to akali due to her ult. IronStylus made a thread asking the community how they would make Diana's kit without using numbers and ensuring that her kit relates to her personality. Basically he wants her kit to have that moon feel but since Diana's kit feels like more an Assassin due to her building AP and having that style of an Assassin she's more of a Jungle/Mid laner but at early game as a mid laner she struggles very hard because she can run out of mana quickly and her kit damage isn't enough what so ever early game/mid game. She has to rely on items to give her that boost too much. Not only that, if you compare Diana to other assassins such as Akali, Talon and Fizz there kit is fast and straight foward while Diana's Q is a skillshot that's a curve and easy to dodge and even if you're hit by it, it doesn't do much damage, Her W is one of my favorite skill on her, I like the Idea of how orbs can damage and give her a shield if you're close to her but the shield was nerf'd and so was the damage so what's the point of having it now? Her E doesn't do much at all, it just pushes the enemy back less than a second and slow them by 35%. It doesn't do damage and the cool down/mana cost is more than her ult, I find it to be the most weakest/useless skill on Diana. Finally her ult, I was expecting that when the enemy is hit with her Q it allows her to have an ult reset and refunds the mana cost or doesn't lose mana cost . Diana eats her mana too much for something that gives back so little which hopefully this year you guys consider the suggestion of the community on what you should do with Diana's kit and decide whether she should be an Assassin or a Fighter.\n\n\nPersonally, I would love Diana to be a Fighter because when I look at her model she seems the type to be ready for close combat but then again she's too squishy to be a fighter since she has to build AP and acts more of a Mage Assassin. So we should have  Riot to decide what Diana should be and what kind of Kit rework she will be having. If her E was switched with her R then what would Diana be considered? A mixture of Orianna and Akali? where is the unique concept Idea for Diana then if she's going to be considered a mixture of two champions? it's like saying she's copying other champion skills rather than having a creative own skills.","replies":[{"poster":"Jamnon","date":"2015-01-15T04:07:34.166+0000","up_votes":3,"down_votes":0,"body":"I actually love the idea of making her a fighter.","replies":[]},{"poster":"PrinceArchie","date":"2015-01-15T11:11:58.349+0000","up_votes":1,"down_votes":0,"body":"I dont feel Diana is too squishy at all to be a fighter, on the contrary she's surprisingly tanky even with 21/9/0 masteries incredibly tanky. She's an incredible jungler, moreso than a midlaner and you might want to get on that gravy train but I digress. Diana is very tanky and powerful, the problem with Diana is her Mana costs and her lack luster E. Diana would do well to be more of a fighter but in terms of thematic approaches to make her more effective and start going in that direction, swapping (E)Moonfall with (R)Lunar Rush would be an incredible start. Monnfall's range is absurdly low and it's cooldown is too long, Lunar Rush is a key thematic skill of Diana's that just isnt available to her as often as it should be. If she were able to get it in the earlier stages of the game she would benefit both as a jungler and as a midlaner greatly. Refunding Mana on Lunar Rush is also an interesting idea since she has a lot of mana issues without blue buff at any given point in the game.\n\nAs for Akali the issue is her sustain in fights whether they be teamfights or 1v1's. If Akali wasn't able to sustain all her health as early as getting lv6 and her hextech people wouldnt be as apalled. Her sustain at early levels is eerily reminiscent of late game adc's who have over 200 Ad and a bloodthirster.","replies":[]}]},{"poster":"Hyrum Graff","date":"2015-01-14T17:26:13.754+0000","up_votes":4,"down_votes":0,"body":"Guys, guys!\n\n#What Meddler said:\n\n>We're experimenting with her ult range to see if reducing it is the right place to nerf her.\n\n#What y'all are acting like he said:\n\n> Akali's ult range is definitely getting nerfed.","replies":[{"poster":"SmokingPuffin","date":"2015-01-14T21:24:21.381+0000","up_votes":2,"down_votes":0,"body":"Well said.\n\nLet me add that when they tried nerfing Diana's ult range (mechanically super similar to Akali) it absolutely destroyed the champion.","replies":[{"poster":"Hyrum Graff","date":"2015-01-15T03:54:20.302+0000","up_votes":1,"down_votes":0,"body":"It's a little different, though (Diana main here). Diana wants to hit her Q before she ults. Before, ult range was slightly longer than Q range, so if you hit a Q you could still ult afterwards, even if they started walking away.\n\nNow, more often than not, you hit a Q and your enemy walks out of your ult range because your ult range is slightly lower than your Q range.\n\nIt's also very frustrating not being able to Q-R to dragon/baron from the other side of the pit. I'd take a nerf elsewhere in her kit if her ult got enough range to do that again.","replies":[]}]}]},{"poster":"Ultîma","date":"2015-01-14T18:45:26.532+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=zXf6FiAF,comment-id=0000,timestamp=2015-01-14T08:28:12.292+0000)\n>\n> My current thoughts/couple of general comments:\n> \n> Akali - Lot of fun and a good alignment between her kit and theme, Lacks sufficient counterplay, resulting in frustrating playing against experience especially when she's ahead. Removal of the mitigation stats from her W's reduced her dueling power against tankier champs which is a positive, squishy targets still struggle with a lack of options sometimes however. The live balance team's currently experimenting with her ult range to see if reducing that's an appropriate lever to put her into a better spot (her having high reliability's less of an issue if it's more practical to stay out of her zone of threat or at least force her to use another ult charge before getting to you).\n> \n> Diana - Would benefit from being more clearly an assassin or a fighter, rather than a generalized mixture of the two (a good fit for her personality that unfortunately results in her being hard to give sufficiently clear strengths and weaknesses when strong enough to be picked). In an ok state, would probably require that work be done to get her to what you'd call a really good state/be a character we felt was good for the game if a really common pick. Not currently being worked on. \n> \n> Both of them - Bit much overlap between the two, both utilizing a similar combat approach through their ults, Q's and cleaves. Ensuring the two of them end up with a few more points of distinction would do both some good (which personally suggests Diana should be pushed towards being more of a fighter, though I can see the argument for assassin as well).\n\nI know this was talked about a while back, but I would personally love for Diana's E & R to be switched around so Diana has access to a unique ult-powered vacuum. Moving her into a fighter/initiator role would be a fantastic step towards giving her a proper identity and having her stop competing for real-estate with Akali. \n\nAs an aside, this would also probably encourage some looking-into AP bruisers since their itemization have always been wonky.","replies":[{"poster":"rinsujo","date":"2015-01-14T19:59:31.193+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=UltimaFatum,realm=NA,application-id=3ErqAdtq,discussion-id=zXf6FiAF,comment-id=0000000a,timestamp=2015-01-14T18:45:26.532+0000)\n> unique ult-powered vacuum.\n\nSooooo.... an Orianna ult?","replies":[{"poster":"Ultîma","date":"2015-01-15T03:23:35.519+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rinsujo,realm=NA,application-id=3ErqAdtq,discussion-id=zXf6FiAF,comment-id=0000000a0000,timestamp=2015-01-14T19:59:31.193+0000)\n>\n> Sooooo.... an Orianna ult?\n\nOrianna's ult functions more like an AOE flip... like Singed, but with the ball.","replies":[{"poster":"rinsujo","date":"2015-01-15T05:06:55.148+0000","up_votes":1,"down_votes":1,"body":"Towards the center. Which is exactly the same as Diana's e.","replies":[]}]}]}]},{"poster":"Gixia","date":"2015-01-14T14:12:52.195+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=zXf6FiAF,comment-id=0000,timestamp=2015-01-14T08:28:12.292+0000)\n> Diana - Would benefit from being more clearly an assassin or a fighter, rather than a generalized mixture of the two (a good fit for her personality that unfortunately results in her being hard to give sufficiently clear strengths and weaknesses when strong enough to be picked). In an ok state, would probably require that work be done to get her to what you'd call a really good state/be a character we felt was good for the game if a really common pick. Not currently being worked on. \n> \n> Both of them - Bit much overlap between the two, both utilizing a similar combat approach through their ults, Q's and cleaves. Ensuring the two of them end up with a few more points of distinction would do both some good (which personally suggests Diana should be pushed towards being more of a fighter, though I can see the argument for assassin as well).\n\nI am but one person, but my vote will forever go towards fighter Diana. It's the direction her current kit flows towards most naturally, and thus would require less fundamental changes to her kit and playstyle in order to make it work. It's also a direction I simply find more interesting and unique, because most AP characters are either mages/assassins or tanks, and there are very few true AP fighters.","replies":[]},{"poster":"Chromatic Eagle","date":"2015-01-14T17:13:45.446+0000","up_votes":2,"down_votes":1,"body":"Thematically Diana should be the opposite of Leona, which means an assassin for me. It sorta reflects her lore too as a loner against the Solari. If you have issues with her being an assassin and fighter, how do you feel about the other champions labeled as such? Rengar, Riven, and Lee Sin as examples.","replies":[]},{"poster":"TeriyakiTerry","date":"2015-01-21T05:42:08.758+0000","up_votes":1,"down_votes":0,"body":"Nerf Akali's ult range is ok, but can you please buff her laning ability?","replies":[]},{"poster":"he rips dabs","date":"2015-01-16T18:52:17.086+0000","up_votes":1,"down_votes":0,"body":"i say take the stacking of her ult off kills away so she kills the squishys and then she has to back off. which is more assassin like and puts her in a good place similar to talon.","replies":[]},{"poster":"InfernaI Diana","date":"2015-01-15T16:58:44.835+0000","up_votes":1,"down_votes":0,"body":"As a Diana main{{champion:131}} , I would like to say she is almost fine.she really really doesn't need a kit rework. she is always a Assassin with a decent sheid(after nerf) and good base stat but low base damage(Q W nerf). Overall she is fine ,what she require is like a better E or lower ult mana cost. her e got huge nerf back to end of S2,she doesn't need to revert her e but maybe increase the pull distance a bit. But overall she is a unique healthy assassin for me and I really enjoy!","replies":[{"poster":"Ultîma","date":"2015-01-15T21:03:09.321+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=S Diana 4,realm=NA,application-id=3ErqAdtq,discussion-id=zXf6FiAF,comment-id=0000000f,timestamp=2015-01-15T16:58:44.835+0000)\n>\n> As a Diana main{{champion:131}} , I would like to say she is almost fine.she really really doesn't need a kit rework. she is always a Assassin with a decent sheid(after nerf) and good base stat but low base damage(Q W nerf). Overall she is fine ,what she require is like a better E or lower ult mana cost. her e got huge nerf back to end of S2,she doesn't need to revert her e but maybe increase the pull distance a bit. But overall she is a unique healthy assassin for me and I really enjoy!\n\nI disagree almost completely - because of the similar patterns between Akali and Diana and their effectiveness as assassins this means that one of them will always be eclipsed by the other. Two characters filling the same role and that are also mechanical quasi-clones of each other leaves room for diversification, which is exactly what Riot should aim for when looking at Diana (because lets be real; Akali will always remain an assassin). Both also suffer from an extremely binary gameplay experience, where once they are ahead they completely stomp their opponents or when behind become useless. In both scenarios this yields a lot of frustration for either the person playing Akali/Diana, or the one playing against them. This isn't healthy, but problems that are/were exhibited by other problematic characters like Kat, Fizz, Kassadin, Leblanc, Talon, and Riven. Because of her kit, Diana cannot be buffed into a competitively viable state because she becomes downright impossible to deal with. \n\nI loved Diana since her release and continue to do so even though she's hurting quite a bit compared to other champions, but I welcome any new direction Riot intends on bringing to the table because I, for one, miss my favourite moon-gravity warrior.","replies":[{"poster":"InfernaI Diana","date":"2015-01-16T05:57:16.243+0000","up_votes":1,"down_votes":0,"body":"Riot cant make her to be an ap attacker(ap figher) since they never make up a champ like that sucessfully, as a mid laner she cant keep attacking the opponent, if riot want to replace her back to jungle, i would say most jungle is ad champ and ap cant really survive unless they make her become really strong.But when she become that strong they will overnerf her again because Riot balance team really lack of experience.So overall give Diana a bit buff on QW damage or E pull distance will be the best solution. Assassin with ok base stat and decent shield really make her unique in mid that why i play her, beside the R dash she isnt that similar with Akali, and akali has a better R mechanic with 3 stack and can reset when kill/assis.","replies":[{"poster":"Ultîma","date":"2015-01-16T14:47:26.621+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=S Diana 4,realm=NA,application-id=3ErqAdtq,discussion-id=zXf6FiAF,comment-id=0000000f00000000,timestamp=2015-01-16T05:57:16.243+0000)\n>\n> Riot cant make her to be an ap attacker(ap figher) since they never make up a champ like that sucessfully, as a mid laner she cant keep attacking the opponent, if riot want to replace her back to jungle, i would say most jungle is ad champ and ap cant really survive unless they make her become really strong.But when she become that strong they will overnerf her again because Riot balance team really lack of experience.So overall give Diana a bit buff on QW damage or E pull distance will be the best solution. Assassin with ok base stat and decent shield really make her unique in mid that why i play her, beside the R dash she isnt that similar with Akali, and akali has a better R mechanic with 3 stack and can reset when kill/assis.\n\nHum not to burst your bubble here but historically there has been plenty of AP junglers that had a *lot* of success, namely (but not limited to) Eve, Fiddlesticks, Elise, Maokai, Nunu and Zac. \n\nI'll reiterate what I said in a previous post; Diana cannot be buffed as an assassin as long as Akali exists in League since the two of them will always compete for the same position. If Diana's numbers allow her to deal similar damage to Akali, then she will overshadow the Ninja champion due to her sheer survivability and utility. If not, then Akali thrives and Diana disappears from play (like now). While I would like to see some buffs to her mana or lower costs on her spells, I don't believe Riot wants to go back to square-one with Diana and that they'll unveil a new direction for her. Hopefully that'll come sooner than later!","replies":[]}]}]}]},{"poster":"SmokingPuffin","date":"2015-01-14T09:00:26.562+0000","up_votes":1,"down_votes":0,"body":"I don't think you'll get very far on Akali without addressing the always hits nature of her kit.  There's just zero outplay potential in there, everything becomes a stat fight way too quickly.\n\nIt's a predictably sad update on Diana.  Clearly she's not as high priority as the stuff that really needs fixing.  It's been over 2 years since Diana was sent to purgatory though, and she's such a fun champion.  QQ =(","replies":[{"poster":"NEW M00N","date":"2015-01-15T22:09:02.175+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SmokingPuffin,realm=NA,application-id=3ErqAdtq,discussion-id=zXf6FiAF,comment-id=00000000,timestamp=2015-01-14T09:00:26.562+0000)\n>\n> I don't think you'll get very far on Akali without addressing the always hits nature of her kit.  There's just zero outplay potential in there, everything becomes a stat fight way too quickly.\n> \n> It's a predictably sad update on Diana.  Clearly she's not as high priority as the stuff that really needs fixing.  It's been over 2 years since Diana was sent to purgatory though, and she's such a fun champion.  QQ =(\n\nIt is a very sad season for Diana, she is hit or miss with her snowballing. I will always play Diana, but if she doesnt get some sort of important attention i would not be disappointed due to the fact that im already disappointed at her current state. One day she will shine.~","replies":[]}]},{"poster":"Neo Cyrus","date":"2015-01-15T16:34:29.777+0000","up_votes":1,"down_votes":0,"body":"Why is there still no one working on Diana? The patch that Diana'd her was when? Dec 2012? And she's been constantly nerfed, after a bit of that was reversed, to match the times ever since (due to reverse power creep, everything being nerfed). Those nerfs have been direct, itemization nerfs, ninja nerfs (thanks for shitting on her passive stack mechanic and never mentioning it in patch notes), etc. Even the \"buff\" she got in compensation for Lich Bane being nerfed didn't remotely come close to breaking even due to the obvious of 2 LB procs being easily used during the time of one of her passive procs. Yet Fizz of all things in the game got a real buff for it... wtf?\n\nIf I were a judge I'd sentence you to playing 100 games as Diana in ranked, then we'd see how \"okay\" you think it is. The stats are skewed. Heavily. Anyone who still plays Diana is very well versed in it (relative to their Elos), her garbage win rates are super inflated because of that. Subtract 15% if you want a number that's actually comparable to the average played champion.","replies":[]},{"poster":"xNitori","date":"2015-01-15T03:30:23.227+0000","up_votes":1,"down_votes":0,"body":"I would propose giving Akali a small, but not negligible cost on her R to make her actually think about using her ultimate repeatedly. It would encourage an Akali to focus on assassinating high-priority targets as opposed to face-tank everyone else.","replies":[]},{"poster":"SerBlaise","date":"2015-01-14T14:20:03.970+0000","up_votes":1,"down_votes":0,"body":"So what would it take to actually start working on Diana? I'm fine with either a fighter or a assassin role tbh.  It's honestly really hard to itemize with the current diana especially in the jungle because she needs zhonyas, CDR, a little burst if you're an assasin, and of course tons of mana if you don't want to back after two camps.","replies":[]}]},{"poster":"AccountaBilabudy","date":"2015-01-14T21:59:20.851+0000","up_votes":3,"down_votes":0,"body":"Reduce Akalis passive spell vamp and also make it so her Q cooldown starts once the mark has been proc'd instead of after it leaving her hand.  That way she cant Q, wait 3 secs then R, proc Q, Q again, proc Q","replies":[]},{"poster":"Grimspeake","date":"2015-01-14T17:44:44.056+0000","up_votes":3,"down_votes":0,"body":"people wont be happy until all assassins are gutted and adc's are untouchable","replies":[{"poster":"Chromatic Eagle","date":"2015-01-14T22:26:53.537+0000","up_votes":1,"down_votes":0,"body":"No one likes adcs either.","replies":[]}]},{"poster":"Emperor Fluffy","date":"2015-01-16T16:42:00.249+0000","up_votes":2,"down_votes":0,"body":"A visible {{champion:84}}  is a dead {{champion:84}} . Right now if Akali is behind, an advanced trinket (which costs almost nothing) stops her from being able to kill anything, or offer anything to a teamfight even if she isn't behind. Because trinkets/pinkward prevent her from having any defensive capacity at all, I don't even bother playing her in lane, I actually play her in the jungle now. She has decent clear speeds and enough sustain to just get through it skipping blue. Hitting her sustain would prevent jungling and take away her only other defensive capability besides using her ult to jump to a safer target. (Still dangerous though)\n\nI don't know how to fix it but, I view the problem with Akali as that she is feast or famine. In a very swingy way. If she is ahead of the squishy the squishy dies, if the squishy is ahead of Akali, Akali dies. There is very little skill involved in these trades besides Akali just bodily throwing herself at her target and hoping for the best because, 250 gold for a pink trinket says that her W is simply a useless skill now. Its not counter play when 250 gold entirely shuts down a quarter of a champion. I'm sorry that everyone else with me below gold can't figure that out but its still true. When you guys added trinkets, you made shroud only good for its resists, then you took those away. There is a reason it doesn't get leveled.\n\nBecause all Akali can do now is throw herself at her target there's no counter/interplay. Before, she could hide in her shroud and not want to leave because it offered her a lonely island of protection. This allowed for decisions to jump out or stay there, now it is simply a false safe-haven. Between TF, Rengar, Lee Sin, Talon, Trinkets, Wards and Mass AoE it is the opposite of safe, It is counter-intuitive.\n\nHer E, Crescent Slash, I find to be rather... Uninspiring. Aafter you have a Sheen/ Lich Bane, your AA does more damage than the slash, all it is useful for is to put a little bit more damage on your target or spellvamp a little from everything around you. In the end it's pretty much a waste of energy (the resource and literal) to even use it if you have CDR because, you will run out of energy before you run out of ult stacks.\n\nSome Ideas:\nMake shroud more like Graves' Smoke Screen, but with no vision in. (AoE damage is still effective, same with skillshots)\nRedesign Crescent Slash, its not unique anymore anyway (see Katarina)\nPut more interaction in her kit, all she does is throw herself at her target and hope to kill it, it is very Irelia-esque and boring with no interplay between champions to allow for counter play.\n\nAside: Still waiting for my beloved Warwick's rework.","replies":[]},{"poster":"Grimspeake","date":"2015-01-15T14:37:09.266+0000","up_votes":2,"down_votes":0,"body":"everyone complaining that fed akali shouldnt be able to carry, thats the dumbest thing ive heard, any champ that gets fed IS able to carry... not to mention if akali doesnt get fed shes completely useless","replies":[]},{"poster":"Grimspeake","date":"2015-01-15T14:34:58.006+0000","up_votes":2,"down_votes":0,"body":"{{summoner:14}} {{item:3165}} {{item:2043}} any type of cc... applying pressure pre6.... stop splitpushing... just some forms of counterplay","replies":[]},{"poster":"Grimspeake","date":"2015-01-14T17:45:52.145+0000","up_votes":2,"down_votes":0,"body":"in a {{item:3165}} meta where people complain bout sustain...","replies":[{"poster":"Chromatic Eagle","date":"2015-01-14T22:25:27.852+0000","up_votes":1,"down_votes":0,"body":"I don't see why people can't complain about both. Also people do complain about it. They only do so because Riot nerfed Athene's. I think they're going to nerf that as well.","replies":[]}]},{"poster":"Leti the Yeti","date":"2015-01-14T08:48:44.425+0000","up_votes":2,"down_votes":0,"body":"that day came fast...\n-hums my sanctuary- ^- ^","replies":[]},{"poster":"lDontLiftIcarry","date":"2015-01-15T01:38:03.464+0000","up_votes":2,"down_votes":1,"body":"after you gutt zed/fizz/every ADC item I'll gladly discuss any nerfs to an akali.\nUntil then.\nNope.\nPerfectly balanced.","replies":[]},{"poster":"DefenderOfFaith","date":"2015-01-14T09:34:40.146+0000","up_votes":2,"down_votes":1,"body":"The mountain of pink wards is unfun as well.","replies":[]}]}