{"poster":"The Bearded Bard","date":"2015-10-17T06:40:12.037+0000","title":"Y'all realize Morde's got very little to do with metal right?","subforum":"[ARCHIVED] Miscellaneous","up_votes":17,"down_votes":16,"body":"Like yeah, he's a spirit trapped in a suit of armor and he's got a few quotes about metal (the music, not the matter) but that's the extent of metal relatedness. He's way more closely related to death, torture, and anguish. \r\n\r\nThe dude's name is literally King of Death in German. \r\n\r\nSure the new name is dumb, but so is the old name. Let's think of better names.\r\n\r\nThe Soul Vanquisher\r\nThe Dread Knight\r\nKeep it goin'","replies":[{"poster":"Smitty Manjensen","date":"2015-10-17T09:50:38.731+0000","up_votes":7,"down_votes":0,"body":"He was a metal reference since forever, every ability he has is related to a metal song, his fuckin title is master of metal. I never liked playing him but I liked how he's metal(music) based and the names of his abilities.","replies":[]},{"poster":"Romans VI XXIII","date":"2015-10-17T06:57:10.620+0000","up_votes":5,"down_votes":0,"body":"King of Death: Lord of Death. Yes such a good name RIOT.\n\nAnd he had 100% to do with metal before his god awful rework.\n\nMordekaiser: The Paladin of Pain. Sounds so much better if they insist on changing his title.","replies":[{"poster":"The Bearded Bard","date":"2015-10-17T08:44:20.527+0000","up_votes":1,"down_votes":0,"body":"No, he didn't lol. this is his original lore.\n\n\nFrom the Shadow Isles comes a champion like no other. Standing eight feet tall, concealed within a razor-sharp armored shell is a creature known only as Mordekaiser. Some allege that he is a man, though none have actually seen what lies within the plates that encompass him. There are those who posit that he isn't a living being, but rather a particularly dark specimen of the undead rumored to infest his distant homeland - but such rumors are surely merely the ramblings of the paranoid or the whispers of the insane. What is known is this: Mordekaiser arrived unannounced at the Institute one day and, with the rasp of an echoing sepulcher, requested to join the League of Legends.\n\nAs if his fearful visage doesn't disturb enough, his touch bears a sinister plague. Those unfortunate enough to be caught within his grasp fall victim to incurable maladies. In fact, Mordekaiser seems mystically connected to sickness, as if it feeds and comprises part of his chilling essence. He has been seen stalking the slums of Noxus, drawn to the plague-ridden and diseased. However, there is something in his clever tactics, something in his noble stance, something in the tone of his unearthly commands that has led many to believe that Mordekaiser is more than just a foot soldier. Some see the distinguishing characteristics of a general. While many have learned to accept this unsettling possibility, a lingering question keeps them uneasily awake at the witching hour - If Mordekaiser is a general, what nightmarish army lurks at his command?\n\n\nYou're just another sheep.","replies":[{"poster":"Romans VI XXIII","date":"2015-10-18T01:25:51.681+0000","up_votes":1,"down_votes":0,"body":"Every ability related to a metal song,\n\nEvery skill except his ult had metal SFX, and visuals\n\nHe is nothing but a Spirit inside METAL armor.\n\nEverything about him has been metal related, until now.\n\nYou are blind if you cant see it, you took the time to go find his old lore, take the time and go watch old youtube vids of him, EVERYTHING IS METAL!","replies":[]},{"poster":"Weissritter","date":"2015-10-17T18:23:10.279+0000","up_votes":1,"down_votes":0,"body":"For someone who went back and found the old lore, I'm surprised you didn't go back and realize all his old SFX on skills were metal as well before they redid them before his rework, even. His Q used to fire shards of metal after the initial hit, his W used to basically be a shroud of metal, and his E had maces sprout from the ground to hit the enemy. Only his ult was originally NOT metal based and soul based.\n\nRiot has basically slowly been changing him over time away from his initial image, and iirc when his E changed people on the boards didn't like that either because even back then it strayed from the metal image. Essentially, they systematically changed him over time until the point that they can make the excuse of 'metal mage didn't fit' because they THEMSELVES are the ones that pushed it outward to make it less obvious.\n\nThe guy isn't a sheep, don't be silly. >: There are arguments for both sides lol","replies":[]}]}]},{"poster":"Count Zubat","date":"2015-10-17T09:24:21.496+0000","up_votes":4,"down_votes":0,"body":"So maybe instead of throwing Morde's connection with metal out through a window, Riot should try and direct Mordekaiser's identity more towards the metalish aspect instead of turning him into another generic Shadow Isles undead?","replies":[{"poster":"The Bearded Bard","date":"2015-10-17T10:00:35.784+0000","up_votes":2,"down_votes":2,"body":"Generic? No. They're all pretty different. Karthus was a boy that was obsessed with death, studied and overcame it. Yorick sought immortality to be remembered. Morde is a lich that binds his victims to his will through sheer force. His malice for the living is unrivaled. Hecarim is a fucking undead centaur. Elise was a regular person that was so enthralled by the shadow isles that she became a creature.","replies":[{"poster":"Count Zubat","date":"2015-10-17T10:50:11.754+0000","up_votes":3,"down_votes":0,"body":"Look at them from visual standpoint. Karthus is generic lich. Kalista is a spectre with spear. Thresh looks kinda interesting, but he is also a spectre, nothing else. Elise isn't undead. Yorick also doesn't look anything spectacular, just a gravedigger zombie thing. Althrough, I can agree, Hecarim looks badass.\n\nNow, look at Morde. He is the most mysterious of all Shadow Isles characters. You don't know what's lurking in that suit of armor. Nobody knows. All the old lores Morde had maybe weren't the best pieces of text, but they all were pointing out that who Morde is is a mystery. The old lores were speculating: maybe he was once a general? Maybe that armor Morde is in isn't protecting him from danger, but us from his terrifying powers? There was the atmosphere of mystery surrounding Mordekaiser. He is not a lich. He is not a spectre, nor skeleton, nor zombie. Nobody knows what he is, he is the being of pain and agony, that's the only thing we know about him. \n\nBy giving him ghosty VFX and such a generic title, it just seems like Riot is trying to make Morde into typical Shadow Isles undead champ. Instead, they could leave him as this super mysterious character, as well as focus on metallic aspects of Mordekaiser.","replies":[]},{"poster":"Romans VI XXIII","date":"2015-10-18T01:27:07.775+0000","up_votes":1,"down_votes":0,"body":"LMFAO, Lord of Death is as fucking generic as it comes.......","replies":[]}]}]},{"poster":"Big Lincoln","date":"2015-10-17T10:56:22.187+0000","up_votes":3,"down_votes":0,"body":"Have you ever considered we want him to be _more_ about metal, because it's a space that he and he alone can fill in the roster\n\nwe already have plenty of champs with those shitty teal colors, let's use metal and lightning to define our favorite undead","replies":[]},{"poster":"Stars Shaper","date":"2015-10-17T10:22:35.101+0000","up_votes":2,"down_votes":0,"body":"What keeps Morde from using metal based magic? We are sure that his armor is nothing like what Thresh and Hecarim wear (which is just a physical manifestation of them) but it's a tool to imprison a more devastating power, it's a powerful artifact.\n\nMordekaiser power comes from the harvest and control of Pain, this can be easily achieved with the control over metal debrids (Edit: From his own armor) for torturing his victims.\n\nMorde being not connected with metal is like saying that Ashe isn't connected with frost magic because she is an archer.","replies":[]},{"poster":"Brascus","date":"2015-10-17T07:54:08.007+0000","up_votes":3,"down_votes":1,"body":"Morde was imprisoned in metal, and his resolve and will turned the prison into a suit of armor. Please, tell me about another champ who manipulated their prison which is made of metal into a suit of armor?\n\nHis passive is literally called iron man\n\nHis Q is a literal reference to ace of spades \n\nHis W coats people in magnetic metal\n\nHis E drains the iron in peoples blood out of them\n\nPlenty of metal in all this.","replies":[{"poster":"The Bearded Bard","date":"2015-10-17T08:43:51.017+0000","up_votes":2,"down_votes":0,"body":"You're just making shit up lmfao 'His E drains the iron in peoples' blood out of them' \n\nFrom the Shadow Isles comes a champion like no other. Standing eight feet tall, concealed within a razor-sharp armored shell is a creature known only as Mordekaiser. Some allege that he is a man, though none have actually seen what lies within the plates that encompass him. There are those who posit that he isn't a living being, but rather a particularly dark specimen of the undead rumored to infest his distant homeland - but such rumors are surely merely the ramblings of the paranoid or the whispers of the insane. What is known is this: Mordekaiser arrived unannounced at the Institute one day and, with the rasp of an echoing sepulcher, requested to join the League of Legends.\n\nAs if his fearful visage doesn't disturb enough, his touch bears a sinister plague. Those unfortunate enough to be caught within his grasp fall victim to incurable maladies. In fact, Mordekaiser seems mystically connected to sickness, as if it feeds and comprises part of his chilling essence. He has been seen stalking the slums of Noxus, drawn to the plague-ridden and diseased. However, there is something in his clever tactics, something in his noble stance, something in the tone of his unearthly commands that has led many to believe that Mordekaiser is more than just a foot soldier. Some see the distinguishing characteristics of a general. While many have learned to accept this unsettling possibility, a lingering question keeps them uneasily awake at the witching hour - If Mordekaiser is a general, what nightmarish army lurks at his command?\n\n\nThat is Mordekaiser's original lore. Does that scream 'metal mage'? Hell no. It screams badass lich whose soul is encased in a suit of armor. No one said anything about imprisonment.","replies":[{"poster":"Ulquiorra995","date":"2015-10-17T11:27:08.846+0000","up_votes":1,"down_votes":0,"body":"Still, combined with his lore the metal in his abilities made perfect sense. A person who manipulated his metal prison/torture device into an armor utilizing that metal for bot offense in a form of metal shreds and blasts as well as defense is honestly much more interesting than generic deathknight we are getting.","replies":[]}]}]},{"poster":"Lintu Puck","date":"2015-10-17T07:43:03.121+0000","up_votes":2,"down_votes":0,"body":"surprised this posted isn't downvoted to hell yet XD\nBut I agree with you (and one of the few that will openly do so) about Morde not really being about metal. He is more death magic and the metal stuff just being a conduit.","replies":[]},{"poster":"Kotex","date":"2015-10-17T06:58:11.469+0000","up_votes":2,"down_votes":0,"body":"The Dragon Tamer :D","replies":[]},{"poster":"RogueWill","date":"2015-10-17T06:42:19.412+0000","up_votes":2,"down_votes":0,"body":"It should be just \"The master\"","replies":[]},{"poster":"Daen","date":"2015-10-17T17:16:41.523+0000","up_votes":1,"down_votes":0,"body":"The Iron Revenant is one I saw suggested, I think it would fit him well while also allowing Riot to have some room to play with his concept.","replies":[]},{"poster":"CasterGilgamesh","date":"2015-10-17T16:30:51.905+0000","up_votes":1,"down_votes":0,"body":"why not \"The Soul Conqueror\" also yes i agree i dont know where people got him to have metal as his main thing ","replies":[]},{"poster":"AzureInTheDark","date":"2015-10-17T14:26:05.069+0000","up_votes":1,"down_votes":0,"body":"The name \"The Iron Revenant\" from another thread always sounded pretty neat in my opinion.\n\nI also think we just rename Mordekaiser \"Alphonse.\"","replies":[]},{"poster":"Zair Umbras","date":"2015-10-17T07:10:19.696+0000","up_votes":4,"down_votes":4,"body":"Morde has a lot to do with metal. \n\nMorde's passive is him doing damage with his metal abilities to strengthen his armored exterior with their life force.\n\nMorde's Q is him smacking the person with a gigantic, spiked, metal mace. \n\nMorde's W has literal metal shards circling him.\n\nMorde's E super heats the floor with soul energy and turning it into metal.\n\nMorde's R uses the power of Metal to rip the soul from some one.\n\nThree of his abilities, passive, Q, and W, all are DIRECTLY related to Metal with his passive being his Suit of Metal, his Q being his Metal Mace, and his W having actual Metal flying around him and his partner. To say his kit isn't Metal related is like saying Heimer's kit isn't Turret based because only two of his abilities spawn a turret or that Ahri isn't the Nine-Tailed Fox because her abilities have nothing to do with her abilities (Her abilities all seem to be focused around that orb after all) or Bard isn't a Wandering Caretaker because his only actual ability to directly take care of his teammates is his W, the healing shrine, or Kalista isn't the Spear of Vengeance because she doesn't get any boost for taking vengeance on anyone. \n\nUltimately, titles are decided by Lore and there's nothing in his current lore or in the new lore that says Mordekaiser is the 'Lord of Death'. His current lore has him grow strength when around other's pain and sorrow and his new lore states he enslaves souls. I mean, if we were to keep this true to lore like the rest, he's the Lord of the Shadow Isles or Lord of Anguish or Iron Slaver (Since he's metal and he enslaves souls) or something... I mean, his kit is metal-based both Musically and Literally.","replies":[{"poster":"The Bearded Bard","date":"2015-10-17T08:00:06.213+0000","up_votes":1,"down_votes":2,"body":"You're really reaching here tbh. He's the closest thing we've got to a lich in this game. I'd rather focus the lich part of him than the metal. Keep the puns, most of them are about music, not physical metal.","replies":[{"poster":"Rendarkan","date":"2015-10-17T08:53:43.021+0000","up_votes":1,"down_votes":0,"body":"Karthus is actually the closest thing to a Lich being his passive... Morde is more Death Knight to me.","replies":[{"poster":"The Bearded Bard","date":"2015-10-17T09:15:10.732+0000","up_votes":1,"down_votes":0,"body":"Karthus isn't a lich at all. A lich is a being whose soul is bound to an inanimate object, usually with the goal of immortality. Irelia is closer to being a lich than Karthus.","replies":[{"poster":"Ulquiorra995","date":"2015-10-17T11:28:51.571+0000","up_votes":1,"down_votes":0,"body":"Then why couldn't lich be focused on metal if the thing that makes them a lich is being soul-bound to an object? I don't see Irelia walking around with rotting flesh and decaying skin.","replies":[]}]}]},{"poster":"Zair Umbras","date":"2015-10-17T09:39:25.493+0000","up_votes":1,"down_votes":0,"body":"Morde, through what we've seen over the years through teasers and the new lore, is a powerful being that suited himself in armor willingly to keep his form alive while he grew in power through other's suffering. His indomitable will and determination as well as his enjoyment of true affliction has kept him alive. He is not like a Lich where he's bound to an inanimate object, oh no. He's bound to the world of Runeterra by his own power, his own will, and most of all, through other's suffering. His weapon of choice of course is Metal. Prior to his recent rework, his E had maces fly up through the ground, which was in itself a bit silly, which is why the new one fits despite himself still being the Master of Metal.\n\nMordekaiser is not the Lord of Death, he is the Master of Death. He does not rain supreme over it, he controls it and keeps it under submission with his will and the sheer power of Metal, which is why his title as the Master of Metal was very suiting.","replies":[]}]},{"poster":"Unlucky Number7","date":"2015-10-17T07:18:54.029+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Zair Umbras,realm=NA,application-id=cIfEodbz,discussion-id=yAJio4Xl,comment-id=0005,timestamp=2015-10-17T07:10:19.696+0000)\n>\n> Morde has a lot to do with metal. \n> \n> Morde's passive is him doing damage with his metal abilities to strengthen his armored exterior with their life force.\n> \n> Morde's Q is him smacking the person with a gigantic, spiked, metal mace. \n> \n> Morde's W has literal metal shards circling him.\n> \n> Morde's E super heats the floor with soul energy and turning it into metal.\n> \n> Morde's R uses the power of Metal to rip the soul from some one.\n> \n> Three of his abilities, passive, Q, and W, all are DIRECTLY related to Metal with his passive being his Suit of Metal, his Q being his Metal Mace, and his W having actual Metal flying around him and his partner. \n\neven with you saying all of that.  I still don't get a \"metal\" feel from morde.  if he was even more like magneto sure, but he still looks like a huge guy in platemail that uses magic.","replies":[]}]},{"poster":"RyzeRework","date":"2015-10-17T08:44:52.826+0000","up_votes":1,"down_votes":0,"body":"Lord of death metal? Or too obvious","replies":[]},{"poster":"Daedalus871","date":"2015-10-17T07:33:39.637+0000","up_votes":1,"down_votes":0,"body":"InB4 massive amounts of downvotes and \"metal dude with abilities that reference metal songs make him a master of metal\".","replies":[]},{"poster":"redniwediS","date":"2015-10-17T06:48:16.471+0000","up_votes":1,"down_votes":0,"body":"It's a problem between how he was presented early on in the old lore, and the direction the current lore is going.  Combine this with the fact that his entire kit changed in a way many do not like and you've got a whole lot of really upset people who are not just QQing.\n\nPeople don't get over changes they don't like quickly, so while Riot may do an amazing job with Morde from here on out, particularly lore wise, it is still a blow to the people who loved him the way he was.","replies":[]},{"poster":"Dryad Soraka","date":"2015-10-17T06:52:52.455+0000","up_votes":1,"down_votes":1,"body":"lord of death sounds good tho","replies":[]},{"poster":"Unlucky Number7","date":"2015-10-17T07:14:10.776+0000","up_votes":1,"down_votes":2,"body":"to be fair the new name is dumb the old name is cheesy dumb.  cause of the puns and references.\n\nbut just from looking at morde \"metal\" was never the first thing to pop into my mind.  ","replies":[]}]}