{"poster":"Tutanchamunschwö","date":"2016-08-29T15:48:08.230+0000","title":"Gold II -  Platin II Support und Toplane gesucht","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Wir suchen f&uuml;r unser Rankedteam einen Supporter und Toplaner. Unser Team besteht aus:\r\n\r\nmir, Jungler, Platin II\r\nSkumbag Zelle, ADC, Gold 1\r\nTaken v1, Midlane, Platin II\r\nDas wichtigste f&uuml;r uns ist der Zusammenhalt, wir drei kennen uns schon sehr lange und haben viele Spiele miteinander gewonnen und verloren. Eine Losingstreak ist v&ouml;llig normal und sollte niemals ein Grund sein, ein Team aufzul&ouml;sen, den aus Fehlern lernt man.\r\nDaher steht an erster Stelle das wir gut mit dir auskommen ;).\r\n\r\nLG\r\n\r\nJerry\r\n\r\nBitte addet mich nicht sondern schreibt unten eine Bewerbung oder per PN:\r\n\r\nName:\r\n\r\nAlter:\r\n\r\nElo:\r\n\r\nSeit wann spiele ich:\r\n\r\nMain Champs:\r\n\r\nWas sind meine St&auml;rken:\r\n\r\nWas sind meine Schw&auml;chen:","replies":[{"poster":"hBithon","date":"2016-08-29T16:16:09.817+0000","up_votes":1,"down_votes":0,"body":"Name: Aaron\n\nAlter: 18\n\nElo: Gold 1\n\nSeit wann spiele ich: 4 Jahren\n\nMain Champs: Yasuo, Riven, Fiora spile gerne carry toplanes kann aber auch tanky spielen: Trundle, Darius, Shen, Gnar\n\nWas sind meine Stärken: snowballing, decition-making, teamerfahren, konstant gute laningphase\n\nWas sind meine Schwächen: - ich spiele Matchups wesentlich schlechter die ich nicht kenne \n                                                  - warding (auf den gegnerischen jungler achten)","replies":[]},{"poster":"RowIan","date":"2016-08-29T16:12:29.874+0000","up_votes":1,"down_votes":0,"body":"Name: Flo\n\nIGN: ComboWombat\n\nAlter: 20\n\nElo: Plat 5 ( Plat 3 vor einigen Tagen allerdings habe ich unglück mit dem Matchmaking)\n\nSeit wann spiele ich: Beta (mit Pause von jeweils einem Jahr S2 und S4)\n\nMain Champs: Bis auf Thresh und Braum (bin ich nicht eingespielt) kann ich alle supps recht gut Main :Ali Janna Zil Bard Soraka\n\nWas sind meine Stärken: Im Spiel bin ich eher ein \"Ruhequelle\", Mapawarnes, Killvorbereitung\n\nWas sind meine Schwächen: Nach den spielen bin ich meistens \"Aufgedreht/Unkonzentriert\" allerdings ist das nach 1-2 Minuten egalisiert^^ Kennt ihr bestimmt. Sonst wahrscheinlich das übliche kleinere Fehler ingame an denen man arbeiten kann. Gravierende Schwächen sehe ich bei mir nicht wirklich.","replies":[]}]}