{"poster":"BeatinWarDrumz","date":"2015-09-23T23:57:39.698+0000","title":"Worried about new lore","subforum":"Story, Art, & Sound","up_votes":9,"down_votes":4,"body":"&gt; For those of you  who don;t know, a couple of months ago LoL got a new head of lore who used to work on Warhammer 40k.  Since then, we have had two releases - tahm, and kindred (lore release at least - check it out, a little piece was written by Riot called a good death, nice read).  Both of them are really cool conceptually, and provide enough detail for speculation unlike some other  releases(cough cough bard cough cough), HOWEVER neither of these champions seem to tie into the existing universe very well.  With the retcon, i was under the impression that Riot&#039;s goal was to be able to have plot development - thus far the only real development we have gotten has been in the bilgewater event (which was really cool), and it doesnt seem like tahm or kindred tie much into Noxus/demacia or Shuriman civil war etc etc.\r\n\r\nThoughts?","replies":[{"poster":"RiotJaredan","date":"2015-09-24T01:37:21.245+0000","up_votes":11,"down_votes":1,"body":"The wonderful fellow you are referencing is not the new head of lore, let's not throw a bunch of stuff on his plate! Tahm Kench and Kindred were not worked on by Graham, though you'll be seeing some more of his work soon... (tease).\n\nTahm Kench and Kindred both deepen Runeterra's mythology so they're not really main antagonists or protagonists in the manner you reference.\n\nThat won't be the case for all champs, it's just worked out that way in this regard.","replies":[{"poster":"TurquoiseYoshi","date":"2015-09-24T02:59:30.258+0000","up_votes":3,"down_votes":0,"body":"So are you just getting all the mythical champions out of your system after the retcon, or will we see a lot more of these guys? In other words, what kind of champions do you have coming up soon?","replies":[{"poster":"Meddler","date":"2015-09-24T06:00:13.237+0000","up_votes":9,"down_votes":1,"body":"A few mythical champions in quick succession (Bard, Tahm Kench, Kindred) was a somewhat organic, somewhat planned process. We identified that there was a space there we hadn't fleshed out much, and could do some cool stuff with, as we were working on a couple of concepts that occupied somewhat similar spots. We concluded that was something to embrace, rather than a problem we needed to solve, hence three champs in quick succession with thematic overlap (internal name for a while was 'Year of the myth' as a result). \n\nHaving said that we'll generally be more concrete space for new champions for a while now. The upcoming champs we're working on still have a fairly fantastical nature to them (LoL's that sort of game), but in the more common 'lots of people know they're real and roughly where in the world they might be' sort of way.","replies":[{"poster":"Chromatic Eagle","date":"2015-09-24T14:40:26.121+0000","up_votes":7,"down_votes":0,"body":"I'm not against mythological champions in general. My issue is that instead of getting Aatrox and Lissandra, people who are either a looming threat, or have impacted the world, we keep getting vague champions who don't interact with anyone meaningful. I liked Kindred's story, but why should I care about one person, when there are entire nations at risk? Bard doesn't even have an allies or rivals page.","replies":[{"poster":"Dreamspitter","date":"2015-09-25T08:51:27.711+0000","up_votes":1,"down_votes":0,"body":"And if the Gambler in Tahm Kench's background HAD been Twisted Fate....would that have changed it for you? I mean he is allies with Aatrox at least.","replies":[{"poster":"Chromatic Eagle","date":"2015-09-25T12:01:29.306+0000","up_votes":1,"down_votes":0,"body":"When people thought Tahm just screwed the guy over? Yes. But I think Tahm ate the man so it wouldn't have made much sense.","replies":[{"poster":"Duke Anax","date":"2015-09-25T13:11:27.285+0000","up_votes":2,"down_votes":0,"body":"As I understood it Tahm ate everything but the man. The point was kinda to throw him in misery.","replies":[]}]}]}]}]}]},{"poster":"Chromatic Eagle","date":"2015-09-24T01:56:06.333+0000","up_votes":3,"down_votes":0,"body":"See, I have a question about this. From Kindred, Tahm Kench, and Aatrox, there have been quite a few champions that have legends told throughout Runeterra. Other champions, such as Amumu, Lissandra, etc., have more local lore. Is it intentional for some of these champions to be so famous across different cultures? The creatures of the Shadow Isles seem to have some infamy in Ionia, and Bilgewater. Will we see them more spread out across the world, or are they local terrors?\n\nA worry and criticism I have is that these champions are more mythological rather than movers of a story. You can't really expect Rek'Sai to ever interact with Kalista.","replies":[]},{"poster":"BeatinWarDrumz","date":"2015-09-24T01:38:36.181+0000","up_votes":1,"down_votes":0,"body":"tx for response","replies":[]}]},{"poster":"Amélie Cauchemar","date":"2015-09-24T00:13:57.107+0000","up_votes":6,"down_votes":0,"body":"They're not supposed. \n\nThey're called outside sources. \n\nDo crossroad demons pertain to anything about your life story? 98% chance no. Are they part of human culture's story? Yep.  Are you part of human culture's story? Yep. \n\nWhat is Tahm Kench? Technically he's the devil of League.\n\nAatrox is essentially the God of War.\n\nAnd Kindred is literally death. \n\nNone of these things pertain to really any person's one single story in the real world. But if you apply it culturally, realistically, they are what shaped all of human culture to the way it is today.","replies":[{"poster":"59Crowken","date":"2015-09-24T02:51:04.648+0000","up_votes":1,"down_votes":7,"body":"Technically Kindred is life and death. Their a pair of champions. Lamb represents life, Wolf represents death","replies":[{"poster":"Twiggles","date":"2015-09-24T03:13:20.305+0000","up_votes":10,"down_votes":0,"body":"> [{quoted}](name=59Crowken,realm=NA,application-id=6kFXY1kR,discussion-id=HnRvWzLX,comment-id=00000001,timestamp=2015-09-24T02:51:04.648+0000)\n>\n> Technically Kindred is life and death. Their a pair of champions. Lamb represents life, Wolf represents death\n\nActually, they both represent death. Lamb represents acceptance of death and a peaceful passing. Wolf represents the desperate and futile struggle against death followed by a grizzly fate.","replies":[{"poster":"59Crowken","date":"2015-09-25T03:45:35.770+0000","up_votes":2,"down_votes":0,"body":"That's really cool. Its amazing that Riot thought of all this with such creativity and detail.","replies":[]}]}]},{"poster":"LilQuacker","date":"2015-09-24T02:00:25.442+0000","up_votes":1,"down_votes":0,"body":"i thought karth was death","replies":[{"poster":"Ironclad Dragon","date":"2015-09-24T02:11:46.805+0000","up_votes":4,"down_votes":0,"body":"Karthus is a lich, someone who by definition spits on death.","replies":[]}]}]},{"poster":"Tesla Effect","date":"2015-09-24T00:17:33.536+0000","up_votes":5,"down_votes":1,"body":"They expand upon the mythos of the world a lot, also introducing interesting characters that arent Champions. I say {{champion:266}} {{champion:432}} {{champion:429}} {{champion:223}} {{champion:421}} and Kindred are all invaluable to the lore of the setting itself.","replies":[{"poster":"The Soulforged","date":"2015-09-24T02:09:42.978+0000","up_votes":7,"down_votes":2,"body":"I honestly have to say people like tamn and kindred don't really fit in with the current theme of Runeterra, and add to a different feel that I'm honestly not very fond of. They add all these random people with little relations to anybody with a different feel and they make no sense. It doesn't really build on the world too much.","replies":[{"poster":"Doctor Ivellius","date":"2015-09-24T02:47:45.701+0000","up_votes":5,"down_votes":0,"body":"This is well said, and I completely agree. If no one told me that the Kindred story was set in Runeterra, I would never have the slightest inkling that it might fit there.\n\nThe Bilgewater stories were pretty good, but it doesn't feel like Bilgewater should exist within the larger framework of Runeterra.\n\nAzir has a decent story, I guess, but it doesn't seem to impact the world at all (like an empire rising from the sand should).\n\nIt's the lack of these connections that make Runeterra no longer feel like a place. It's just a collection of unconnected stories that are all supposedly set in the same universe and occasionally drop some of the same names.","replies":[]}]}]},{"poster":"Only Play Darius","date":"2015-09-24T03:12:29.574+0000","up_votes":4,"down_votes":1,"body":"All the recent champions are independent and I don't really like it.\n\nKindred is some kind of Reaper who wanders the forest.\n\n{{champion:432}} is a cosmic entity.\n\n{{champion:223}} is implied to be somewhat connected to Bilgewater but he is officially independent.\n\n{{champion:429}} is technically from the Shadow Isles but isn't truly affiliated with them.\n\n{{champion:150}} is a wild animal who has no association with any of the factions.\n\n{{champion:421}} is technically from the void but is once again a feral animal who does not align herself with the faction.\n\n{{champion:268}} feels like the only recent release who has actually belongs to a faction.\n\nI mean seriously when was the last time we got a champ who fought under the banner of Noxus or Demacia?","replies":[{"poster":"Photos of Ghosts","date":"2015-09-24T12:28:36.689+0000","up_votes":3,"down_votes":0,"body":"Azir just introduced a faction, like that, because FKIN SHURIMA.","replies":[]},{"poster":"Cetri","date":"2015-09-25T17:36:23.327+0000","up_votes":1,"down_votes":0,"body":"Wasn't Gnar frozen by Anivia to help fight the Watchers when they return?","replies":[]},{"poster":"GreenLore","date":"2015-09-24T12:49:07.832+0000","up_votes":1,"down_votes":0,"body":"well rek'sai lives in Shurima,so she could be seen as a shurima-champ as well(sure she does her own thing in shurima and pretty much opposes everyone else,but the same goes for Kassadin and the void too)","replies":[]}]},{"poster":"lightdragoon88","date":"2015-09-24T01:39:50.813+0000","up_votes":1,"down_votes":0,"body":"Tahmn Kench is mention in the Bilgewater event. He is a legend there and many stories about him too.","replies":[]},{"poster":"Sharjo","date":"2015-09-24T01:15:15.884+0000","up_votes":1,"down_votes":0,"body":"> For those of you who don;t know, a couple of months ago LoL got a new head of lore who used to work on Warhammer 40k.\n\nGonna stop you there. Jaredan's currently heading Narrative's endeavours, Mr. McNeil is, as far as I know, been in Riot for less time than Jaredan's been at the helm, so Mr. McNeil is not the new head of lore. Just wanna make sure that at the very least is clear.","replies":[]}]}