{"poster":"Sr Joe","date":"2017-02-10T17:12:53.254+0000","title":"Error al descargar la repetición de una partida","subforum":"Discusiones sobre el Cliente","embed":{"description":"The easy way to save screenshots, GIFs, and websites. Make everyone happy by sharing smarter, faster, and with your point crystal clear.","url":"https://gyazo.com/55c25929a724edbb0650c890ad19b7e3","image":"https://i.gyazo.com/thumb/1200/_eac4fd963f0b3283449a15c6f5f25b22-png.jpg"},"up_votes":1,"down_votes":0,"body":"Hace ya mas de 1 mes me top&eacute; con este error y la verdad es que no le di importancia, pensaba que haber cambiado el idioma a ingles dentro del juego lo ocasionaba. Pero resulta que ayer me dio por descargar la repetici&oacute;n de una partida y el error sigue apareciendo.\r\nLa respuesta a un ticket que mande al soporte fue que el cambio de idioma y modificar los archivos provocaban el error y para corregirlo, deb&iacute;a desinstalar y eliminar cada rastro del juego e instalar League of legends nuevamente. A&uacute;n habiendo hecho esto, el error me sigue apareciendo... La verdad ya no se que hacer, use hasta programas como CCleaner para asegurarme de eliminar todo rastro del juego antes de reinstalar.\r\nAlguien sabe como puedo arreglar esto??? Apreciar&iacute;a la ayuda.","replies":[{"poster":"Khimea","date":"2017-02-10T17:25:14.199+0000","up_votes":1,"down_votes":0,"body":"El problema pasa que las \"repeticiones\" esta \"habilitadas\" por parche.\nPaso a explicar:\nPor ejemplo vos jugas una partida en la versión 7.2, pero al dia siguiente implementan la version 7.3, cambiando datos del juego, sea cual sea, y ahi va a saltar el error.\nIgual pasa cuando queres \"reproducir\" una repeticion ya descargada en un parche de cual no fue descargada.","replies":[{"poster":"Sr Joe","date":"2017-02-10T17:44:44.956+0000","up_votes":1,"down_votes":0,"body":"Mmmmmmm... \nPero aquí habría otra problemática entonces, y es que esta partida la jugué ayer como a las 4 de la tarde, cuando se supone que el parche ya estaba corriendo en nuestros clientes.\nEntiendo perfectamente lo que me explicas, pero dudo que justo cuando haya terminado esa partida, comenzó a correr el actual parche :/","replies":[{"poster":"Khimea","date":"2017-02-10T17:53:02.151+0000","up_votes":2,"down_votes":0,"body":"Tambien los Fix cuentan con modificaciones en el juego.\nLo mismo pasaba cuando se usaba el \"LolReplay\" que era ajeno a RIOT.\n\nHay otra cosa que no comente, tene encuenta que en la forma que estas partidas se guardan son como \"Logs\" temporales = LogsCache, y puede ser que luego  de cada login desaparezca.\n\nSi el problema es : Terminaste la partida, quisiste bajar la repetición y te tiro eso, \nSi es un problema y tiene que se reportado a soporte.\nTene en cuenta que las cosas son probadas por usuario hacen los mejor que pueden pero al fin y al cabo son usuarios comunes, no son \"tester profesionales\" y no realizan todas las pruebas necesarias.","replies":[{"poster":"Sr Joe","date":"2017-02-10T19:33:03.683+0000","up_votes":1,"down_votes":0,"body":"Entiendo, muchas gracias amigo. Se aprecian las respuestas :D","replies":[]}]}]}]},{"poster":"GuzH","date":"2017-02-10T17:20:52.144+0000","up_votes":1,"down_votes":0,"body":"Desde que es posible descargar las repeticiones de las partidas, a mi me tira ese error. Por eso uso páginas externas como replayGG para hacerlo, la verdad no sé que será lo que ocasiona el problema :s","replies":[{"poster":"Sr Joe","date":"2017-02-10T17:45:55.444+0000","up_votes":1,"down_votes":0,"body":"Pero tengo entendido que Replay gg se fue a la B. Que otras paginas del estilo existen???","replies":[]}]},{"poster":"Russells Viper","date":"2017-02-10T17:15:57.714+0000","up_votes":1,"down_votes":0,"body":"sierto","replies":[]}]}