{"poster":"Unlucky Palme","date":"2018-01-09T10:27:45.869+0000","title":"S7 Platin 2 Inaktiver Top(Main) sucht jetzt wieder ein team um durchzustarten für season 8","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Alter: 25\r\nSolo Que : Platin 3 Wegen inaktiv\r\nFlex Platin 5\r\nMain Top Lane \r\nChamp Pool :  Werde ich noch angeben\r\nZu mir : Ich war am ende der Season 7 Platin 2 dann inaktiv mal hier und da ein game in der pre-season flex aber nicht viel und habe ab heute (09.01.2018) entschieden das ich wieder Aktiv spielen M&ouml;chte und durchstarten m&ouml;chte  in der kommenden Season :)\r\n\r\nTeam Erfahrung : ich hab Solala Erfahrung da die Team niemals lange anhalten weil gleich alle so mad sind weil man verliert oder gleich ohne eingespielt zusein gleich Tuniere machen und dann noch untereinander nicht immer gute stimmung war.\r\n\r\nSt&auml;rken : Ich Pers&ouml;nlich bin ein rein Tryhard spieler ich spiele eigentlich nur Ranglisten Spiele weil ich finde normals und fun games machen f&uuml;r mich kein Sinn und ich versuche nach jedem game mich zuverbessern R-plays schaun was ich bei mir verbessern kann.\r\n\r\nSchw&auml;chen:  Ich Pers&ouml;nlich denke von mir ich bin nicht Perfect und ich bin auch nicht der  LcS player ich verliere auch mal runden aber ich versuche mich immer zuverbessern und Nehme auch Vorschl&auml;ge an und versuche sie auch umzusetzten \r\n\r\nErwartung An das Team: Ich suche ein Tryhard Team was etwas erreichen will im Team sowie in Solo que f&uuml;r die Season und auch f&uuml;r die Kommende Season Und auch denn willen haben an Tunieren teilzunehmen . Ihr solltet ein Shotcaller haben der ingame das sagen hatt . Ich pers&ouml;nlich Spiele nur Ranked da ich kein Sinn seh in Normals oder Aram ich h&ouml;ffe ihr seit auch der Meinung :) Ihr solltet am besten 3 Tage Trainings Zeiten haben damit es auch was wird Mit Dem team\r\n\r\nWas Ihr erwarten K&ouml;nnt von mir : Ich bin wie gesagt Tryhard spieler versuche mich immer zuverbessern mit mir Kann man auch mal schei&szlig;e labern aber auch serious Talken ich sage auch mal meine Meinung Bin aber auch sehr KritikF&auml;hig Bin immer P&uuml;nklich wen es um Trainings einheiten geht Mit dem Team. Erfahrung im Team ist auch Vorhanden.\r\n\r\nZu euch Allgemein:\r\n18+\r\nTs3\r\nMin. 3 mal die woche Training und ziele haben um an Turnieren Teilzunehmen \r\nEs muss ein shotcaller Vorhanden sein","replies":[]}