{"poster":"Der SpuK","date":"2015-04-24T13:49:54.415+0000","title":"MMR? Was soll das!","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":1,"body":"Moinsen,\r\n\r\nbin gerade mit meinem Smurf auf Dia 5 gekommen. Ich habe eine Win Ratio von 62% und so ca. 8 Games in Folge gewonnen. Nun verliere ich immer -23 Punkte und gewinne lediglich +13 (um den Dreh). Da frage ich mich, was soll das? Meine MMR kann doch gar nicht schlecht sein. Warum ist das so hart unfair? Muss ich jetzt nur noch gewinnen um aufzusteigen? Was k&ouml;nnt ihr mir so daszusagen?\r\n\r\nbeste gr&uuml;&szlig;e","replies":[{"poster":"Crazy Tactician","date":"2015-04-24T13:56:05.460+0000","up_votes":3,"down_votes":0,"body":"Da gibt es sehr viele Faktoren. Wenn du z.B. deine Teammitglieder sehr hohe MMR Werte haben, bekommst du weniger MMR für einen SIeg, das gleiche gilt für Gegner mit sehr niedriger MMR. Außerdem kursieren Gerüchte, dass noch andere Dinge eine Rolle spielen, das ist aber unbestätigt.\n\nAußerdem glaube ich, dass die MMR Anforderungen in DIa 5 einen recht hohen Sprung machen.\n\nAber das sind alles nur Vermutungen, genaueres könnten dir nur Riotler sagen, und die werden es nicht tun.\n\nWas du jetzt tun sollst? Gewinnen. Genau wie vorher auch. Ist ja nicht so, als würde das Spiel keinen Spaß mehr machen, nur weil man jetzt weniger LP kriegt, oder?","replies":[]},{"poster":"HyperionCH","date":"2015-04-24T14:05:14.138+0000","up_votes":2,"down_votes":0,"body":"Klare Sache:\n\nDein Rang ist durch die hohe winrate/längeren winstreaks massiv schneller angestiegen als deine MMR.\n\nMit der Zeit passt sich dies jedoch an.","replies":[]},{"poster":"Sanctuary2056","date":"2015-04-24T15:27:42.142+0000","up_votes":2,"down_votes":1,"body":"http://www.lolsummoners.com/stats/euw\nWas erwartest du? Irgendwann ist man halt am oben Ende angekommen... die MMR steigt nicht endlos. Wer oben mitspielt, der muss mehr riskieren für weniger Punkte, das ist einfach so.\n\nDas wird ab Dia5 auch nicht mehr groß besser... weil einfach nach obenhin viel weniger Spieler zur Verfügung stehen als nach unten. Folglich wirst du wohl sehr wahrscheinlich über der Durchschnittselo des Matches sein und dementsprechend mehr Punkte verlieren als du gewinnen kannst. Eine kleine Verbesserung erreichst du, wenn deine MMR zu hoch ist um mit Platinspielern gematched zu werden, aber dann steigt auch deine Wartezeit massiv an. Bei den anderen Ligen gibt es dann die Spieler aus höheren Bereichen, aber das bleibt hier aus.","replies":[]},{"poster":"Taihuang","date":"2015-04-24T13:57:01.328+0000","up_votes":2,"down_votes":1,"body":"Das liegt an einer momentanen Verzerrung durch die Meisterliga.\nEs trifft wohl so ziemlich jeden der in Diamant V ist.\nSobald du es auf Dia IV geschaffst hast wird es wieder \"normal\" sein.\nBis dahin ist es wohl sehr frustrierend ... hilft nichts außer 60%+ Winrate und \"schnell\" hochspielen.","replies":[]},{"poster":"Der SpuK","date":"2015-04-25T06:53:54.941+0000","up_votes":1,"down_votes":0,"body":"3 mal Sion. Ja aber ich rede von meinem Smurf. Da spiel ich adc only. So hab zwei Games verloren und jetzt wieder eins gewonnen und schon wieder +21. Also verstehe das wer will^^","replies":[]},{"poster":"Plsstophitme","date":"2015-04-24T14:01:02.274+0000","up_votes":1,"down_votes":1,"body":"3x Sion gespielt und 3x verloren ? \nwtf ?","replies":[]}]}