{"poster":"I Never ADC","date":"2016-07-13T20:29:34.529+0000","title":"Why wasn't Irelia nerfed?","subforum":"Gameplay","up_votes":1,"down_votes":6,"body":"Irelia wasn&#039;t touched, and currently nothing in the PBE is for her.\r\n\r\nShe can have 70 farm at 30 minutes, 0/10/0, and then climb back to 10/10 Atleast with just Triforce. \r\n\r\nFix the gaaame riot.","replies":[{"poster":"Calabok","date":"2016-07-13T20:34:38.425+0000","up_votes":3,"down_votes":0,"body":"She's good and requires nothing more,  nothing less","replies":[]},{"poster":"Votable Jester","date":"2016-07-13T20:30:50.523+0000","up_votes":4,"down_votes":1,"body":"They already nerfed her ult cd.","replies":[{"poster":"I Never ADC","date":"2016-07-13T20:32:48.596+0000","up_votes":1,"down_votes":2,"body":"And she's still ridiculously strong..? Her ult cd nerf was hardly a problem according to a bunch of people that play her.\n\nIt's Triforce, and she needs to be nerfed in order to compensate for the item buff.\n\nI also meant this patch, not previous ones.","replies":[{"poster":"Votable Jester","date":"2016-07-13T20:36:39.041+0000","up_votes":2,"down_votes":0,"body":"Idk, I haven't had too much difficulty with Irelia besides when my top laner feeds her 5-8 kills in the laning phase.  She's definitely strong, but I think it's a little exaggerated.","replies":[]}]}]},{"poster":"Embertine","date":"2016-07-13T20:45:34.052+0000","up_votes":2,"down_votes":0,"body":"They nerfed her last patch, literally the very patch after they buffed her. Not many champions get nerfed right after being buffed.","replies":[]},{"poster":"Swiftstrike4","date":"2016-07-13T20:42:41.366+0000","up_votes":1,"down_votes":0,"body":"I will say, Irelia is incredibly frustrating sometimes to play against. It is because you can shut her down in laning phase (0-3) and she can STILL come back and be incredibly dangerous for the rest of your team (not you).\n\nSince they raised the cooldown of her ultimate I have had an easier time in laning phase against her. She can't simply zone me off farm like she could in the past with simply sheen and make me back early because her ultimate would be off cooldown. Now, however, I still have noticed she still becomes a high level threat even after losing lane hard just by simply building triforce. \n\nI have just noticed is just seems ou can beat her down, but she will still hit a power spike and maybe not kill you (the top laner) if you win lane, but she will roam and murder your teammates effortlessly.","replies":[{"poster":"I Never ADC","date":"2016-07-13T20:53:47.957+0000","up_votes":2,"down_votes":1,"body":"Kind of my point. She can do anything she wants late game after being shut down. My point is that even after losing laning phase hard, she can 100-0 anyone she wants.\n\nIt's ridiculous.","replies":[]}]}]}