{"poster":"MeƒX","date":"2017-05-23T10:05:52.094+0000","title":"15napos felfügesztés után mennyi időnek kell eltelni hogy pár report után nekapjak perma bant?","up_votes":4,"down_votes":6,"body":"15napos felf&uuml;geszt&eacute;s ut&aacute;n mennyi időnek kell eltelni hogy p&aacute;r report ut&aacute;n nekapjak perma bant?","replies":[{"poster":"Vasipari Béla","date":"2017-05-23T10:28:25.778+0000","title":null,"up_votes":3,"down_votes":0,"body":"kb egy teljes szezon","replies":[]},{"poster":"Mind The Gap","date":"2017-05-23T11:27:04.522+0000","title":null,"up_votes":2,"down_votes":0,"body":"Ez a viselkedésed javulásától is függ, nem csak az időtől. Nem lehet tudni. A 12-15 napos büntetések már eléggé súlyosnak számítanak, én 1 évet mondanék példának. Nyílván ehhez az is társul, hogy mennyire javult a magatartásod a büntetésed óta, és hogy mennyire sűrűn csinálod. A lényeg, hogy nem éri meg odáig eljutni. Ha még most változtatsz a viselkedéseden, akkor nem fogsz odáig eljutni, hogy a fórumon létrehozod a \"jogtalan banos\" témákat, meg hogy \"már bánom, hogy így meg úgy viselkedtem, Riot unban pretty please?\", aztán ott van még a \"mekkora ____ a Riot, egy csomó időt meg pénzt fecséreltem a fiókomba\". Próbálj chillelni a meccseiden. A lényeg, hogy van enyhülési idő, ha változtatsz magadon.","replies":[{"poster":"MeƒX","date":"2017-05-23T11:30:53.218+0000","title":null,"up_votes":2,"down_votes":3,"body":"nyílván okkal kaptam a 15naposat (amúgy nem rage miatt) ha nemjátszom rajta ebben a seasonben akkor utánna már pár report miatt elv nemkaphatnák permát ügye?","replies":[{"poster":"Mind The Gap","date":"2017-05-23T11:36:28.892+0000","title":null,"up_votes":2,"down_votes":0,"body":"Ha nem játszol rajta, akkor szerintem alkalmazódik az elévülési idő (de ezt ne vedd készpénznek).","replies":[{"poster":"MeƒX","date":"2017-05-23T11:39:25.923+0000","title":null,"up_votes":2,"down_votes":2,"body":"oké köszi a segítséget","replies":[]}]}]}]},{"poster":"MeƒX","date":"2017-05-23T10:31:47.491+0000","title":null,"up_votes":1,"down_votes":5,"body":"köszi\namúgy ismerősömet olyanért banolták 15napos után h próbálta irányítani a teamet h menjenek baronra, menjenek topot pusholni és megkapta ezért a permát :D","replies":[{"poster":"kalamona90","date":"2017-05-23T10:39:20.463+0000","title":null,"up_votes":4,"down_votes":3,"body":"Egy kihágásért még soha senki nem kapott permát! Mindig van valami amit ilyenkor nem mond el az illető. Meg kap figyelmeztetést kivétel csalás vagy egyéb ilyen kivétel. Meg nem mindegy hogy ki hogy irányíthatja a csapatott, milyen szavakat használ.","replies":[{"poster":"MeƒX","date":"2017-05-23T11:04:52.475+0000","title":null,"up_votes":2,"down_votes":4,"body":"1kihágás miatt kapod a 15naposat és utánna gondolom én elég pár report és kapod a permát nem?","replies":[{"poster":"Sylasi Elvtárs","date":"2017-05-23T17:32:17.020+0000","title":null,"up_votes":3,"down_votes":0,"body":"Az első néhány reportnál a rendszer figyelmeztet, hogy mindenkinek lehet rossz meccse, de próbáld meg moderálni magad. Utána chat ban jár, végül a kitiltások. A Perma ban-hoz már rengeteg figyelmeztetés kell.","replies":[]},{"poster":"kalamona90","date":"2017-05-23T13:05:58.665+0000","title":null,"up_votes":3,"down_votes":1,"body":"Kisebb kihágásom nekem is volt egyszer össze omlott a kliens és afk voltam egyszer meg a gépem..... Nem kaptam büntit. Sose írok senkinek semmit bár régen volt rá példa egyszer egyetlen egyszer nem túl szépet és akkor se. Ahoz hogy valaki olyat tegyen hogy egy dologért ekkora bünti ahoz sokat kell tenni.","replies":[]}]}]}]},{"poster":"MeƒX","date":"2017-05-23T10:40:40.369+0000","title":null,"up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Sch1zophrenia","date":"2017-05-23T10:44:24.799+0000","title":null,"up_votes":1,"down_votes":3,"body":"Szövegértés ülj le 1-es.","replies":[{"poster":"MeƒX","date":"2017-05-23T10:48:07.922+0000","title":null,"up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"kalamona90","date":"2017-05-23T10:57:03.960+0000","title":null,"up_votes":4,"down_votes":5,"body":"Szerintem olvasd ell hogy kit miért lehet banolni. Ezt 90-es IQ felett megértik. Téged már a most leírt szövegeid miatt is lehet és remélem egyszer meg is kapod.","replies":[]}]}]}]},{"poster":"MeƒX","date":"2017-05-23T10:24:46.606+0000","title":null,"up_votes":2,"down_votes":5,"body":"olyan opció nincs mivel mindenképp reportolnak még ha kikapcsolom a chatet és nemírok semmit, nem feedelek :D tudod ebben a játékban már azis 1 ok hogy reportoljanak ha nem gankelsz, a junglered meghal a laneded és tevagy a hibás, nem followolsz vkit a halálba stb...és mivel kedves ritot nemigen érdekli minden esetben hogy jogos e a report így hát nemakarok permát kapni mivel elég sok pénzt öltem az accomban nemfogok kockáztaatni szval kb 1időt szeretnék h mennyi időnek kell eltelni","replies":[{"poster":"Mind The Gap","date":"2017-05-23T11:32:13.617+0000","title":null,"up_votes":2,"down_votes":0,"body":"Dehogynem érdekli! Elmondjam mennyire?\n\nAlapvetően, a kamu jelentések a jelentési rendszerrel való visszaélésnek számítanak. Folytattam már a supporttal és egy Riotössel is párbeszédet, és végeredményben válasznak azt kaptam, hogy visszafele is elsülhet a dolog. Két dolog történhet azokkal, akik hamis jelentéseket küldözgetnek (azok ellen, akik például nem szegték meg az [Idézők kódexét](http://gameinfo.eune.leagueoflegends.com/hu/game-info/get-started/summoners-code/) -):\n\n* büntetésre számíthat a hamis jelentést küldözgető: tiltást kaphat a fiókjára;\n* a jelentései egyre \"kevesebbet\" fognak érni, vagy akár teljesen el is veszthetik a jelentéseik jelentőségét.","replies":[]}]},{"poster":"kalamona90","date":"2017-05-23T10:13:34.582+0000","title":null,"up_votes":1,"down_votes":4,"body":"Ne reportoljanak időnek.","replies":[]}]}