{"poster":"EzeBlood","date":"2016-04-30T21:55:16.548+0000","title":"CCOS Equivalent: OCCC May 2016 (Pilot)","subforum":"Player Creations","up_votes":4,"down_votes":0,"body":"Hi all. Something that has been happening lately on other server boards is a thing called &#039;Champion Concept Open Series&#039;\nI&#039;d like to run an equivalent here on OCE.\nThe base idea is that a maximum of 20 Champion Concepts are entered by a set date each month, and then winners are announced in the following month. In the NA version, they have volunteer judges, who theorise literally every possible kink in the design of each Champion Concept. I&#039;m not going to do it like that. Instead, winners will be based on three categories:\n1: Individual gameplay aspects (Is the champion user friendly, or would it feel clunky and confusing? Would it provide a healthy gameplay experience for the player?)\n2: Team based gameplay aspects (Are the champions actions easily understood by teammates? Is there room to synergise with team compositions?)\n3: Foe based gameplay aspects (Is the champion going to feel fair to play against? Is there enough counterplay for the champion&#039;s ability?)\n\nNow for the rules. The OCCC (Oceania Champion Concept Contest) for each month will be open from the first of the month, to the 27th, with winners being announced on the 2nd of the following month. Each entry must have detailed tooltips for abilities, base stats, growth stats, and a proposed gameplay outline. A backstory may be included if the author wishes, though it will hold no sway in the judging process. Entries must be entirely the author&#039;s own work, though can be submitted on behalf of another person, with appropriate credit being given along with the link. To enter, post a link to the boards post containing your entry\nWith that, I declare the First Monthly (hopefully) Oceania Champion Concept Contest OPEN FOR ENTRIES!\n\nCurrent Entries\n1. : Rusken - The Scrapyard Horror - Corvis Colvein\n2. : Castor - The Justice Seeker - Newsonts\n3. : Kor'vein - The Volatile Soldier - Corvis Colvein\n4. : Avespira - The Hivemind - Caress of Venus\n5. : Tsuki and Taiyo - The Sun and Moon - CookedChickens\n6. : Phonos - Assassin of the Void - Fitzky\n7. : \n8. :\n9. :\n10. :\n11. :\n12. :\n13. :\n14. :\n15. :\n16. :\n17. :\n18. :\n19. :\n20. :\n\n\nUPDATE: Entries have now officially closed, It was great to see the reception that the comp received in its pilot month. Stay tuned for winners, as well as next month's competition!","replies":[{"poster":"ImFcKUp18","date":"2016-05-28T14:41:45.226+0000","up_votes":1,"down_votes":0,"body":"my entry \nhttp://boards.oce.leagueoflegends.com/en/c/player-creations/uR2u1zL6-champion-design","replies":[{"poster":"EzeBlood","date":"2016-05-28T19:51:39.569+0000","up_votes":1,"down_votes":0,"body":"Sorry, but entries closed 24hrs before you submitted this. You can resubmit for next month's competition though!","replies":[{"poster":"ImFcKUp18","date":"2016-05-29T02:49:00.244+0000","up_votes":1,"down_votes":0,"body":"T_T ok","replies":[{"poster":"EzeBlood","date":"2016-06-02T10:04:16.805+0000","up_votes":1,"down_votes":0,"body":"This month's entries are now open, feel free to jump on over and submit this now!","replies":[]}]}]}]},{"poster":"Caress of Venus","date":"2016-05-20T04:42:48.965+0000","up_votes":1,"down_votes":0,"body":"My Entry: (Hopefully the formatting works\n**Avespira, The Hivemind**\n\n\nDeep within Kumungu Jungle, a once human warrior emerges to protect Runeterra from the ever imposing threat of the Shadow Isles. She will be a deadly force of spammable spells and augmented auto’s making the Shadow Isles regret enraging Runeterra.\n\n\nOverview:\n\nPrimary: Mage\n\nSecondary: Jungler\n\n\nAvespria is a Mage or Jungler that will benefit immensely from auto attacking before, during and after her spell cycles. Through her passive she will be able to weave additional utility and damage through the application of her honey. She will gain burst potential not from her abilities alone, but through procking Lich Bane and obtaining decent cooldown reduction, to augement her E’s passive and to spam her W. Her strength in team fights will be AOE utility and the ability to burst down priority targets, whilst being able to kite the other enemies’ abilities.\n\n\nIn the Jungle, she offers good clears and decent ganking with her Q, into auto’s and a slow. She will also be able to duel decently well with her natural ability to kite and her range.\n\n\n**Base Stats:**\nBase Health: 390 (+82) ------- Attack Damage: 45 (+3)\n\nHP Regen: 4.6 (+0.5) ---------- Attack Speed: 0.625 (+2.0%)\n\nMana: 230 (+50) --------------- Base Armour: 12.6 (+3.3)\n\nMana Regen: 6.5 (+0.65) ----- Magic Resist: 30 (+0)\n\nMovement Speed: 335 ------- Range: 525\n\n\n**ABILITIES**\n\n\n**Passive: Infused Artillery **\nConsecutive auto attacks on the same target will apply a stack of honey (Max: 4), on reaching four stacks then enemy becomes 'Coated in Honey' and suffers a 5/10/15% Slow. Honey Stacks last 6 seconds and are refreshed on application of a new stack. Avespria's abilities gain additional effects on targets 'Coated in Honey', after 6 seconds of being 'Coated in Honey' all stacks expire.\n\n**Q: Pollinate**\n\nMana Cost:  80/90/100/110/120\n\nCooldown: 12/11/10/9/8\n\n\nActive: Using two of her hands Avespria lobs a Comb full of strange pollen, if this hits an enemy it will explode, dealing magic damage and rooting all enemies. If a target is 'Coated in Honey' the pollen will stick to them revealing them for a set duration.\n\n\n>Range: 700\n>Damage:  40/80/120/160/220 (0.6 AP)\n>Pollination AOE: 200\n>Reveal: 2/3/4/5/6 (for CiH targets)\n>Root: 1/1.25/1.5/1.75/2\n\n\n** W: Honey-Seeking Stinger**\n\nMana Cost: 40/50/60/70/80\n\nCooldown: 7/7/7/7/7\n\n\nActive:  Avespria launches her Stinger a distance; it will then home in on the target with the most honey stacks within 250 range from the spells end trajectory. If the target was an enemy Champion, Avespria gains a quick burst of speed. If the target is 'Coated in Honey' the Passive of Honeysuckle is doubled for this ability only.\n\n\n>Range: 100-600 (can be lengthened or shortened within this range)\n>Damage: 40/60/100/120/140 (0.5 AP)\n>Burst of Speed: 5/10/15/20/25% (for 1 second)\n\n\n**E: Honeysuckle**\n\nMana Cost: 80/90/100/110/120\n\nCooldown: 15/14/13/12/11\n\n\nPassive: Successful spell casts on targets ‘Coated in Honey’ Reduce Avespria’s cooldowns by 1 second.\nActive: Avespria draws in the energies from a targeted enemy coated in her enchanted honey, dealing magic damage, based on their honey stacks, and removing all stacks on the target. Killing a target ‘Coated in Honey’ with this spell refunds 150% of the mana cost, and heals her for 50% of the damage dealt (after resistances).\n\n\n>Damage: 1/1.5/2/2.5/3% of maximum health per stack (Minions and Monsters take a maximum of 400 Damage)\n>Maximum Damage (before resistances): 4/6/8/10/12% of Max health. \n\n\n**R: The Grand Harvest **\n\nMana Cost: 120/150/170\n\nCooldown: 170/150/120\n\n\nActive: Avespria launches a hive of bees to hunt down enemy champions with Honey stacks (this missile will prioritise those with more stacks). On passing through the enemy it will deal magic damage and remove all, but one honey stack. Once it has hit each affected Champion once, it dissipates and the spell goes on cooldown.\n\n\nNote: The Grand Harvest will only target champions who had stacks on them BEFORE the spell was cast, stacks can still be applied while The Grand Harvest is travelling, but it will not alter the spells course. However, if the stacks expire, The Grand Harvest will deal no damage and apply one stack.\n\n\n>Range: Global\n>Damage: 250/350/450 (+0.5 AP)\n\n\n** LORE:**\n\nDeep within Kumungu Jungle, there exists a world not that well known to most of Runeterra, a place where creature's like Zyra thrive. One particular Piltover Scientist made understanding the alien ecosystem her life's work. Avespria, was a prestigious student in the field of Biology and Botany, and for a Post-graduate thesis she headed deep into Kumungu to find a mythical flower, its pollen capable of raising the dead. \n\n\nAfter a week travelling in this new land, Avespria realised she was utterly lost, almost like the Jungle had conspired to lock her in, it was at this moment she noticed a strange happening, the Bees of the Jungle were turning on the Spiders, viciously ripping them apart, with little to no provocation. \n\n\nScared of what would happen next she ran blindly deeper into the jungle. When she finally calmed down she found her last greatest discovery, the Kumungu Hive, easily taller than most building the massive hive beckoned her to explore it. She felt herself attracted to the sweetest smelling honey and the complex array of combs within the Hive, until she reached the center.\n\n\nIt wasn't until a minute in the center that she realised what had happened, her feet were sunk deep within the honey that lined the floor, and slowly a couple at a time, bees came and started crawling over her. That's the last memory Avespria had of being human.\n\n\nShe now was a shadow of her former self, Half-human, half bee, and completely dedicated to the Hive. She spent monthes buzzing around Kumungu pollenating plants and creating honey for the Hive, until one day the Hive spoke to her.\n\n\n\"The Dark Isles stir, seeks help from all of Runeterra, do not let them invade.\"\n\n\nWith these mysterious orders Avespria left Kumungu and eventually wound up at the League of Legends, where she begun to gain allies to assist in her Quest.\n\n\n*”We fight for Runeterra summoner, not for you”*– Avespria","replies":[{"poster":"EzeBlood","date":"2016-05-29T01:05:44.315+0000","up_votes":1,"down_votes":0,"body":"This is really cool and I'd love to see some concept art, maybe see if Riot will actually notice it. The CiH mechanic is really nice!","replies":[{"poster":"Caress of Venus","date":"2016-05-30T03:36:41.716+0000","up_votes":1,"down_votes":0,"body":"Funny you say that :P\n\n[V.1](http://imgur.com/ggL1H5K)\n\n[V.2](http://imgur.com/ADylyEG)","replies":[]}]}]},{"poster":"CookedChickens","date":"2016-05-20T07:10:49.873+0000","up_votes":1,"down_votes":0,"body":"Here is my entry...\nhttp://boards.oce.leagueoflegends.com/en/c/player-creations/s0Bgxg9x-new-champion-concept-taiyo-and-tsuki-the-sun-and-the-moon?comment=0002","replies":[]},{"poster":"Fitzky","date":"2016-05-20T06:39:01.018+0000","up_votes":1,"down_votes":0,"body":"http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/sxdeEXZP-phonos-assassin-of-the-void","replies":[]},{"poster":"Caress of Venus","date":"2016-05-20T04:32:12.655+0000","up_votes":1,"down_votes":0,"body":"Well, I guess I'm digging up old concepts then, probably submit Avespria, since with the release of Ekko, Viruska is looking like a clone now :<","replies":[]},{"poster":"hazushikatta","date":"2016-05-09T02:21:24.306+0000","up_votes":1,"down_votes":0,"body":"I used to like doing these... maybe I'll start again since powercreep's come such a huge way in a few years, can come up with some more interesting ~~projectile blocking three hit %hp true damage knockup~~ mechanics without people saying \"that sounds ridiculously overpowered\"","replies":[]},{"poster":"Newsonts","date":"2016-05-08T16:17:22.283+0000","up_votes":1,"down_votes":0,"body":"What about this one? \n\nhttp://boards.oce.leagueoflegends.com/en/c/player-creations/1oj58HK2-new-champion-topjungle-castor-the-justice-seekerthe-head-chef","replies":[]},{"poster":"Corvis Colvein","date":"2016-05-07T14:44:38.755+0000","up_votes":1,"down_votes":0,"body":"Here's another!\n\n[Kor'vein](http://boards.oce.leagueoflegends.com/en/c/player-creations/JF4jPf0y-champion-concept-korvein-the-volatile-soldier)","replies":[]},{"poster":"Corvis Colvein","date":"2016-05-03T14:40:02.819+0000","up_votes":1,"down_votes":0,"body":"Here is the first Champion concept for the list\n\n[Rusken](http://boards.oce.leagueoflegends.com/en/c/player-creations/QwVcOQiE-champion-concept-rusken-the-scrapyard-horror-adc)\n\nHope you enjoy it","replies":[{"poster":"EzeBlood","date":"2016-05-06T04:05:35.614+0000","up_votes":1,"down_votes":0,"body":"Thanks! At this rate, we'll have a competition by the end of the year!","replies":[]}]}]}