{"poster":"NoTeamFound","date":"2016-02-11T10:01:54.743+0000","title":"Ist das ein Deal, Riot?","subforum":"Karten & Spielmodi","up_votes":3,"down_votes":15,"body":"Servus zusammen!\r\nMir kam nur Mal so ein Gedanke:\r\n\r\nWie w&auml;re es, da Riot jetzt die Dominion Warteschlange aus dem LoL-Leben nimmt, dass Riot uns als &quot;Ersatz&quot; oder &quot;Wiedergutmachung&quot;, nennt es wie Ihr wollt :D, den URF Modus als permanenten Spielmodus einf&uuml;hrt?.\r\n\r\nF&uuml;r die Beschw&ouml;rer, welche nicht wissen was URF ist:  [hier die Beschreibung zu diesem Modus](http://euw.leagueoflegends.com/de/news/game-updates/patch/urfs-ruckkehr)\r\n\r\nKlar werden einige sagen:&quot;Nein bitte nicht dieser Modus soll ein J&auml;hrliches event bleiben damit man den Spass daran nicht verliert.&quot;\r\n\r\nMein Argument, f&uuml;r diejenigen, welche auf der Seite der oben genannten Aussage sind:\r\nStellt euch Mal vor ihr habt einfach einen schlechten Tag und verliert ein Ranked nach dem Anderen.\r\nDann seid ihr demotiviert, habt kein Bock mehr auf das 5v5 geflame und gejaule anderer leute.\r\nIhr braucht dann definitiv Abwechslung!\r\nUnd hier kommt URF ins Spiel: Da es ja permanent zu spielen ist, kann man sich in diesem Fun-Mode so richtig austoben und \r\nmit seinen Freunden kaputtlachen. Denn dieser URF Modus meine Damen und Herren, dieser Modus ist einfach genial und zum \r\n&quot;Abschalten&quot; perfekt gemacht!\r\n\r\nAlso was sagt ihr dazu? was sind eure Gedanken zu diesem Vorschlag?\r\nTeilt sie mir in den Kommentaren mit!\r\n\r\nBitte beachtet: Es ist nur ein Vorschlag also kein hate und flame bitte. =)\r\n\r\nLG Saveshot","replies":[{"poster":"Sirrkas","date":"2016-02-11T10:16:19.118+0000","up_votes":3,"down_votes":0,"body":"Ich persönlich hätte es am liebsten, wenn häufiger einer der Spielmodi aktiv ist. Meinetwegen jede zweite Woche einer oder alle paar Tage wird gewechselt. \n\nMit Poroking, Ascension, Hexakill SR, Gewundener Wald Hexakill, URF, Bilgewasserevent, One for All SR, One for All ARAM und ab demnächst Dominion gibt es ja eigentlich genug Auswahl.","replies":[{"poster":"NoTeamFound","date":"2016-02-11T10:19:04.428+0000","up_votes":2,"down_votes":3,"body":"der Erste der nicht gegen mich schiesst  sondern eine konstruktive Kritik bringt :D.  Es gibt einen ganz kleinen Schimmer Hoffnung für diese Community.","replies":[{"poster":"Sirrkas","date":"2016-02-11T10:41:27.635+0000","up_votes":2,"down_votes":0,"body":"Um ehrlich zu sein, würde ich es Riot aber nicht übel nehmen, so etwas nicht umzusetzen. Ich fände es aber schön, wenn man die hin und wieder spielen könnte. Hauptsächlich weil ich es schade finde, dass ein Spielmodus entwickelt und dann nur 2 Wochen genutzt wird. ","replies":[]},{"poster":"SorisDynasty","date":"2016-02-11T10:19:58.233+0000","up_votes":2,"down_votes":3,"body":"Ah ja. Inwiefern war meines nicht konstruktiv? Weil ich nicht in kleinster Form zugestimmt habe?","replies":[{"poster":"pulledchicken","date":"2016-02-11T10:30:02.028+0000","up_votes":3,"down_votes":2,"body":"Hey Summoner ;) \n\nMag ja sein das deine Beiträge stimmen  ( enthalte mich ) , du schreibst aber in einem Passiv/Aggressiv Stil und merkst es vermutlich auch nicht .\n\nDu schreibst deine Sätze bzw einen Satz  wie einer der nach jedem Satz \" !!!!!!!!! \" macht und das macht das ganze für gewisse Leute unbeliebt . \n\nDas hier soll kein Hate sein :P \n\n\n\n\nhier der Satz von dir :\n\n\n> Nein, du willst einfach nur unter egal welchem Umstand Urf wieder haben. Ein Thema von hunderten.\n\n\nwie ich es vermutlich geschrieben hätte :\n\nDas Thema U.R.F. wurde schon sehr oft im Forum angesprochen , da wird sich nichts ändern, da Riot der Meinung ist es sei besser als Temporärer Mode beizubehalten .\n\n\nNaja ich klugscheisse schon wieder ^^\n\n\n\nhave a nicer dicer day {{sticker:slayer-jinx-wink}}","replies":[{"poster":"NoTeamFound","date":"2016-02-11T14:57:52.058+0000","up_votes":1,"down_votes":1,"body":"Ein Dankeschön an dich. =)\n\nLG Save","replies":[]}]},{"poster":"NoTeamFound","date":"2016-02-11T10:23:12.618+0000","up_votes":3,"down_votes":3,"body":"ich zitiere: \"Nein, du willst einfach nur unter egal welchem Umstand Urf wieder haben. Ein Thema von hunderten.\"\n\nWoher willst du wissen das ich diesen Modus unter egal welchem Umstan wiederhaben will =). Wie gesagt war nur ein Gedanke der mir so kam. Man muss nicht gleich persönlich werden :D. \n\nGG =)","replies":[{"poster":"SorisDynasty","date":"2016-02-11T10:25:16.416+0000","up_votes":1,"down_votes":2,"body":"\"Wieso ausgerechnet URF? Ich hätte lieber Ascension oder OFA.\n\nUnd genau da liegt eines der ersten Probleme.\"\n\nWo ist das nicht konstruktiv? Du sagtest ja, das da oben wäre das ERSTE.","replies":[{"poster":"NoTeamFound","date":"2016-02-11T10:33:37.180+0000","up_votes":2,"down_votes":2,"body":"ja dein erstes Feedback war ja OK. \nNur dein nächster Kommentar war persönlich. also bist du doch nicht mehr der konstruktive typ geblieben =)\n\naber ey, lassen wirs. mein thread ist ja nur ein vorschlag. braucht nicht gleich persönlich zu werden oder was weiss ich :D.\nIch sag doch noch lasst sein mit eurem gehate, flame.","replies":[]}]}]}]}]}]},{"poster":"Sree","date":"2016-02-11T10:20:13.625+0000","up_votes":4,"down_votes":1,"body":"Ich zitiere mal aus der News:\n> League entwickelt sich stetig weiter und unsere Vorstellungen für das Hauptspiel werden immer klarer, so dass wir heute [nach jahrelanger Erfahrung](http://euw.leagueoflegends.com/de/news/game-updates/features/vorgestellte-spielmodi-2014) wissen, dass alternative Spielmodi als kurzzeitiges Angebot besser funktionieren als mit eigenen Warteschlangen. \n\nDarum wird Riot nicht einen permanenten Modus durch einen anderen ersetzen.","replies":[]},{"poster":"dugg","date":"2016-02-11T10:22:21.803+0000","up_votes":2,"down_votes":0,"body":"Sämtliche MODs für die Kluft sollten als Event bestehen bleiben. \n\nDie Alternative zum 5v5 in der Kluft ist ARAM was nun eindeutig eine Funmap ist. Wenn man keine Lust auf 5v5 hat kann man auch 3v3 spielen.\n\nWenn einen Ersatz für Dominion, dann sollte es etwas ganz anderes sein, als die bisherigen Spielmodis. \n\nEine Karte die fast komplett leer ist und man Rundenbasiert Last Man Standing spielt oder Capture the Flag oder sonst etwas. (Die Vorschläge sind nicht ernst gemeint, sondern nur fluxe Ideen).","replies":[{"poster":"NoTeamFound","date":"2016-02-11T10:24:52.905+0000","up_votes":2,"down_votes":1,"body":"Genau! könnte man auch machen wär bestimmt witzig =)","replies":[]},{"poster":"Shiggyvara","date":"2016-02-11T16:29:56.470+0000","up_votes":1,"down_votes":0,"body":"Irgendwie traurig, dass man bei nem SPIEL ne Map als \"eindeutig Funmap\" klassifizieren muss....\n\nGibt allerdings auch genug ARAM mains, die selbst da keinen Spaß mehr sehen...","replies":[{"poster":"dugg","date":"2016-02-12T06:43:24.022+0000","up_votes":1,"down_votes":0,"body":"Das war von mir aber keines Wegs böse oder abwertend gemeint. Der richtige Wettbewerb findet eben in der Kluft statt (Ranked und E-Sport). Ich möchte damit auch niemanden herabwürdigen.\n\nZur Erklärung, ich komme ursprünglich aus einer anderen Gaming-Szene (Starcraft - Broodwar) und dort wären solche Maps halt Funmaps.","replies":[]}]}]},{"poster":"Zêph","date":"2016-02-11T13:39:16.088+0000","up_votes":3,"down_votes":2,"body":"Ich hab echt genug von Leuten,die sagen,dass man URF als permanenten Modus einfügen soll. Was wäre daran so toll?? Nach ca. 3 Tagen hat man eh keinen Bock mehr auf den Modus. URF ist und bleibt ein Event,das nur einmal im Jahr Spaß machen kann.","replies":[{"poster":"NoTeamFound","date":"2016-02-11T14:56:31.408+0000","up_votes":1,"down_votes":3,"body":"du mussts ja wissen :D","replies":[]}]},{"poster":"Streifi","date":"2016-02-11T10:35:29.425+0000","up_votes":2,"down_votes":4,"body":"völlig egal die konn von mir aus die ganzen casual game modes rauspatchen, die machen eh mehr kaputt als das sie nützen.","replies":[{"poster":"Sihari","date":"2016-02-11T11:03:47.317+0000","up_votes":1,"down_votes":0,"body":"In wie fern machen sie denn etwas kaputt? \nIch hab bisher nur Spaß bemerkt, wenn ich sie gespielt habe... Manchmal sogar mehr als im \"klassischen\" LoL, wo jeder jeden fertig macht und alles viel zu ernst nimmt!","replies":[{"poster":"XxX Nomad","date":"2016-02-11T12:11:02.696+0000","up_votes":1,"down_votes":1,"body":"Gestern wieder einen gehabt der sonst nur aram spielt und leider Bock auf ein normal hatte... Was soll ich sagen, schön das er am Ende 10 kills hatte... Und 10 Tode und immer Solo die Gegner im jungel suchte...","replies":[{"poster":"Sihari","date":"2016-02-11T12:47:49.336+0000","up_votes":2,"down_votes":1,"body":"Dann gehörst du wohl zu der Gruppe, die mal wieder alles zu ernst nimmt. \nEs war ein Normal und da geht es nun einmal um Spaß. schließlich ist LoL immer noch ein Spiel ;3\nUnd so oft passiert das nun auch nicht, dass man davon sprechen könnte, dass es allen den Spaß verdirbt.","replies":[]}]}]}]},{"poster":"AΝTON","date":"2016-02-11T10:04:35.744+0000","up_votes":2,"down_votes":1,"body":"NEIN \n\nurf ist gerade geil weil er ein seltenes \"Luxusgut\" ist! \nwir würden übersättigt werden wenn dieser Modus permanent auf den server wäre und er würde seinen reiz verlieren.","replies":[]},{"poster":"lKawaiiNeko","date":"2016-02-11T15:33:26.429+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"NoTeamFound","date":"2016-02-11T15:50:11.040+0000","up_votes":1,"down_votes":1,"body":"egal was einfach mal paar neue modis zum spielen ich mein 5v5 aram und 3v3 ist schon einbisschen mager :D","replies":[]}]},{"poster":"SorisDynasty","date":"2016-02-11T10:04:07.509+0000","up_votes":1,"down_votes":3,"body":"Wieso ausgerechnet URF? Ich hätte lieber Ascension oder OFA.\n\nUnd genau da liegt eines der ersten Probleme.","replies":[{"poster":"NoTeamFound","date":"2016-02-11T10:09:50.068+0000","up_votes":2,"down_votes":2,"body":"ha ja klar egal urf war mein erster gedanke weils mir am meisten spass gemacht hat :D aber einfach einen anderen Modus als Ersatz","replies":[{"poster":"SorisDynasty","date":"2016-02-11T10:12:55.385+0000","up_votes":2,"down_votes":4,"body":"Nein, du willst einfach nur unter egal welchem Umstand Urf wieder haben. Ein Thema von hunderten.\n\nSelbst, wenn man einen anderen Modus als \"Ersatz\" bringen würde, kämen andere mit der exakt selben Beschwerde wie ich - \"Wieso nicht X?\"\nZu mal, wie im Thema schon angemerkt wurde, die temporären Modi sehr schnell ihren Anreiz verlieren. Nach ~2 Wochen hatten ALLE Modi, auch dein geliebtes Urf, massiv an Beliebtheit verloren, da die Spielerschaft gesättigt war.","replies":[]}]}]},{"poster":"Patty91","date":"2016-02-11T10:05:08.746+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=Saveshot,realm=EUW,application-id=cGRapXds,discussion-id=sovyA5PT,comment-id=,timestamp=2016-02-11T10:01:54.743+0000)\n>\n> dass Riot uns als &quot;Ersatz&quot; oder &quot;Wiedergutmachung&quot;\n\nWofür willst du das? Du hast doch gar kein Dominion gespielt, also warum verlangst du jetzt dreist nach einer Wiedergutmachung?","replies":[{"poster":"NoTeamFound","date":"2016-02-11T10:14:59.263+0000","up_votes":3,"down_votes":2,"body":"In ersster Linie gehts nicht darum ob ich den Modus oft gespielt habe oder nicht, sonder der Punkt ist, dass immer mehr und mehr verschwindet und so stehen bleibt =).\n\nUnd dreist ists nicht, es ist ein Vorschlag und keine Forderung ;).\nWenn du weiterliest, steht da auch noch \"nennt es wie ihr wollt\" also reim dir die Sätze nicht so zu wies dir grad passt ;) \n\nLG Save","replies":[]}]}]}