{"poster":"Lord Butt Fumble","date":"2019-12-10T06:55:39.780+0000","title":"Dragon should spawn in alternate locations throughout the game","subforum":"Gameplay","up_votes":3,"down_votes":2,"body":"Why does this make sense? Because in games where one team's bot lane is just incompetent that team can still effectively contest objectives.\r\n\r\nIf dragon 1 spawns bot and your bot is losing, it's hard to get that dragon if you're not going for an attack speed jungler. But if your top lane is doing well, then you have a higher chance of securing the dragon if the second dragon were to spawn in the scuttle pit.\r\n\r\nI'm not sure how the map would look, but I think if there was a minor re-design that allowed the dragon to spawn in multiple locations it would add a lot more strategy to the game, and it would also prevent one team from getting all or most of the dragons just because one team's bot lane ints all game.","replies":[{"poster":"AIQ","date":"2019-12-10T14:41:48.524+0000","up_votes":3,"down_votes":1,"body":"Why wouldn't the teams just rotate? \nThe only reason bot is bot is because of dragon. If dragon moves so do they. Nothing changes since the map is identical.","replies":[]},{"poster":"MagicFlyingLlama","date":"2019-12-10T07:09:19.711+0000","up_votes":2,"down_votes":1,"body":"This would make toplane relevant, cant allow that!","replies":[{"poster":"xelaker","date":"2019-12-10T16:31:21.636+0000","up_votes":1,"down_votes":2,"body":"the lanes would just swap genius...","replies":[]}]},{"poster":"Dr Endeavor","date":"2019-12-10T16:46:40.023+0000","up_votes":1,"down_votes":0,"body":"Dont know why people are charging in here on a high horse being all butt hurt.\n\nOP never said anything about the dragon being in a static place for anyone to just \"change\" what lane they start in, and even stated about an idea to spawn in multiple spots. Also the map is mirrored, depending on what you are after as far as the river goes... one team gets a nice wall and the other gets the opening to the same pit (if it was identical then both pits would be on one side, or they would change the pit to be in the center of the river on each side).","replies":[]}]}