{"poster":"CéciDogg","date":"2015-02-05T15:33:55.480+0000","title":"Rémálom - Ismeretlen hiba","subforum":"Általános beszélgetés","up_votes":17,"down_votes":2,"body":"http://imgur.com/ubcDwIJ\n\nÜdvözlet mindenkinek!\n\nAz elmúlt két hétben rengetegen írtatok nekünk, hogy az \"Ismeretlen hiba\" üzenetet kapjátok este 7 és 11 óra között, mikor az EUNE szerveren próbáltok meg játszani. \n\nA problémát más európai országokból nem jelentették olyan arányban, mint otthonról. Emellett a probléma érdekes mivolta, és a bejelentett esetek közötti összefüggések miatt több otthoni internetszolgáltatóval is felvettük a kapcsolatot, hogy megtaláljuk a megoldást.\n\nA probléma pontos okát egyelőre még nem sikerült kideríteni. Több játékossal is együtt dolgozunk, hogy megfelelő adatokat tudjuk vizsgálni annak érdekében, hogy ennek a problémának a forrására minél hamarabb fény derüljön. Mindenkit szeretnénk megkérni, hogy várjon türelemmel, és amint lesz megoldás, mindenkit tájékoztatni fogunk róla.\n\nKöszönjük megértéseteket!\n\n**Frissítés (2015/02/12 - 12:38)**\n\nÜdvözlet újra mindenkinek!\n\nKöszönjük nektek az eddigi türelmet. Az utóbbi időben alaposan megvizsgáltuk a hibát, és a mi oldalunkon is leellenőriztünk mindent. \n\nSajnos úgy néz ki, hogy a hiba nem a mi oldalunkon van. Korábban írtam, hogy a többi országban a környezetünkben nem jellemző a probléma úgy, ahogy Magyarországon (tehát este 7/8-11 között). A probléma valószínűleg a szolgáltatónál van, mivel úgy néz ki, hogy este elérési útvonalat változtatnak. Így más útvonalon próbáltok csatlakozni a kiszolgálóinkhoz, és sok esetben itt lép fel a hiba.\n\nMindent megteszünk annak érdekében, hogy együtt dolgozzunk a szolgáltatóval ennek a problémának a megoldásán, azonban fontos, hogy a szolgáltató lássa, hogy ti nem tudtok csatlakozni a szervereinkhez.   {{champion:32}} \n\nArra kérünk titeket, hogy ezzel kapcsolatban vegyétek fel a kapcsolatot a szolgáltatóitokkal, és próbáljátok meg tisztázni velük, hogy mi a probléma, és melyik játékhoz nem tudtok csatlakozni. Így a szolgáltató látni fogja a rengeteg visszajelzést tőletek, hogy tényleg gond van.\n\nReméljük, hogy sikerül orvosolni a problémát, és mind feltámadunk újra az Igazság Mezőin! {{summoner:10}} \n\n\n\n","replies":[{"poster":"Dædalus","date":"2015-04-30T10:47:45.322+0000","up_votes":4,"down_votes":2,"body":"Sziasztok!\n\nÚgy látjuk, történt némi előrelépés a dologban az elmúlt néhány napban, viszont Dublinból mi nem tudjuk leellenőrizni a hálózatot. Itt lenne szükségünk egy kis segítségre: légyszi írjatok egy választ erre a hozzászólásra, hogy nálatok javult-e a kapcsolat az elmúlt pár napban.\n\nKöszönöm előre is!","replies":[{"poster":"Tomacsek","date":"2015-04-30T17:34:44.285+0000","up_votes":2,"down_votes":1,"body":"Már 4 napja tökéletesen működik!! *Pacsi*","replies":[]},{"poster":"Kifacsart Sors","date":"2015-05-07T07:08:29.394+0000","up_votes":1,"down_votes":0,"body":"Az előző héten most én sem érzékeltem a hibát.","replies":[]},{"poster":"Dzsime","date":"2015-05-01T19:23:56.740+0000","up_votes":1,"down_votes":0,"body":"***","replies":[]},{"poster":"Lady Kekec","date":"2015-05-01T14:28:19.770+0000","up_votes":1,"down_votes":0,"body":"Tegnap este nálam ismét leállt a szolgáltatás. A TV hamarabb kimered, mint ahogy az internet megszakadna, főleg játék közben zavaró, mivel utána hiába van újra netkapcsolat képtelen visszacsatlakozni a játkéban, ha harc közben vagyok.","replies":[]},{"poster":"MajonézMAN","date":"2015-05-01T11:49:37.380+0000","up_votes":1,"down_votes":0,"body":"Néha még előfordul, de ritkábban mint eddig. Köszi!","replies":[]}]},{"poster":"rasztanyul","date":"2015-03-31T09:46:12.718+0000","up_votes":7,"down_votes":0,"body":"Van ez a petíció, amivel talán kicsit előrébb lehet jutni a probléma megoldásáért. Ha sok aláírás összegyűlne és kiderülne, hogy mennyi embert érint a hiba, akkor kicsivel jobban foglalkoznának a probléma súlyosságával. Lehet nem publikusan is támogatni a petíciót.\n\n**http://www.peticiok.com/signatures/leagueoflegends/**","replies":[{"poster":"CéciDogg","date":"2015-03-31T16:57:55.895+0000","up_votes":9,"down_votes":1,"body":"Sziasztok, üdvözlet újra mindnekinek!\n\nAhogyan korábban is írtam, a kapcsolatot már felvettük a szolgáltatóval, hogy ne csak a ti részetekről érkezzen meg hozzájuk a probléma bejelentése.\n\nA legutolsó beérkezett üzenetben, amit a Telekomtól kaptunk, az szerepelt, hogy tudomásuk van a hibáról, és nemzetközi szinten vizsgálják a problémát, hogy megtalálják annak a forrását. Miután belátták, hogy a hiba náluk van, és dolgoznak rajta, a türelmünket kérték.  Egyelőre most mi sem tudunk többet tenni, mint várni arra, hogy a Telekom mérnökei kijavítsák a problémát. Bár sajnos ez most nem rajtunk múlik, remélhetőleg hamarosan minden megjavul!\n\nKitartás!","replies":[]}]},{"poster":"ProPitekusz","date":"2015-02-05T20:38:31.437+0000","up_votes":2,"down_votes":0,"body":"Sziasztok :) Hát nálam nem csak este van ilyen:S az egész nap sokszor elő szokott fordulni bár esténként többször, vagy nem lép be a kliensbe vagy, ha be lép nem működik sokáig a chat, vagy nem tudok rúnákat állítani se vásárolni a boltban.. ez még nem is izgatna annyira az már inkább, hogy van mikor be lépek ranked: hú nagyon jó játszanék választanánk a hőst és van mikor egyszer csak megáll minden:s majd pár perc és ki dob hogy nem választottam hőst ezt egyszer először elnéztem 5 perc wait és  -2lp aztán másodszorra olyan történt hogy +6lpről minusz 6 lett mondom wtf :o kövi meccs jó volt +28lp és lett beszartok de 22 o.O na mondom ilyet se láttam még kövi meccsen megint ilyen hiba -10lp és már 40percet kellett várni mert ez már a mai nap többször volt:S kérem szépen RIOT! hogy térül ez vissza nekem? nagyon szeretem a LOL-t és ha néha feedelek is élvezem a játékot de most nem így nem és egyre többször csak ezek a hibák és én tisztes polgár ki folyamatosan mindenre figyel csak ezt kapja:S kérlek oldjátok meg mert ez így nem állapot és így sok játékost fogtok elveszteni ezek miatt:S vannak képeim az esetekről és tanácsokat szívesen fogadok, amúgy T-home-s vagyok..:) 30megás net szóval azzal csak ne legyen már baj:S további szép estét remélem hamar megoldódik ez a probléma:S :)","replies":[{"poster":"CéciDogg","date":"2015-02-06T15:42:26.787+0000","up_votes":4,"down_votes":0,"body":"Mindegy. hogy éppen milyen csomagban vagy, mert ugyanazon az útvonalon haladsz át, mint valaki egy \"lassabb\" kapcsolattal. Itt úgy néz ki, hogy azzal lesz a probléma, hogy terhelés optimalizálás szempontjából milyen módon változtatja meg a szolgáltató a csatlakozási útvonalat (feltehetően az esti órákban). \n\nDe ezt sok oldalról kell megvizsgálni, és a szolgáltatóval is beszélnünk kell.\n\nTürelem játékot terem! ;) (reméljük!)","replies":[{"poster":"Gerathorn","date":"2015-02-07T12:18:44.339+0000","up_votes":1,"down_votes":0,"body":"Már leírtam az alábbi csetben, hogy mi a baj... \nhttp://boards.eune.leagueoflegends.com/hu/c/altalanos-beszelgetes/JAvg4kMr-az-eu-szerverekkel-kapcsolatos-terveink\n\nLehet ré kéne nézni, csinálni egy kis performancia + integrációs teszt kombi%%%%ót, ahogy le is írtam és a programozó csapat rájönne hol a hiba a kliensben.... :) De ahogy sejtem ez a posztom is törölve lesz, mert biztos sértő, rasszista, etc. :)","replies":[{"poster":"CéciDogg","date":"2015-02-09T12:37:33.851+0000","up_votes":3,"down_votes":0,"body":"Üdv Gerathorn,\n\nSokan küldtek nekünk hálózati naplófájlokat, és tracert naplókat, amiken egyértelműen látszik, hogy az esti órákban megváltozik az egyes szolgáltatók által biztosított elérési útvonal. Ennek következménye, hogy sok IP cím akadályokba ütközik, miközben hozzánk próbálna csatlakozni. A hiba nagyon úgy néz ki, hogy nem a mi oldalunkon van (hiszen akkor nem csak a magyar játékosok találkoznának a hibával, hanem a környező, EUNE régióba tartozó országok is). \n\nSzeretnénk még némi bizonyítékot gyűjteni állításunk helyességének alátámasztására, és utána megnézni, hogy a szolgáltatóval tudunk-e együttműködni annak érdekében, hogy javuljon a helyzet. \n\nTudom, hogy ez nagyon idegörlő, de igyekszünk megoldani a dolgot. Sajnos a mi kezünk sem ér el akármeddig...de nyújtózkodunk :)\n\nKitartás!","replies":[{"poster":"Tazsam","date":"2015-02-09T15:37:03.390+0000","up_votes":1,"down_votes":0,"body":"\n\nKitartásban nincs hiba, viszont az lp-nk fogy. Nem lehetne a magyarokat letiltani a rankedről a kritikus időszakokban addig is? Így kevesebb lenne az afk is úgyhogy a többi játékos is jobban járna és mi sem idegeskednénk annyit, hogy már megint ránk csap a leaver buster + vesztünk lpt is noha az előző meccsen még minden rendben ment.","replies":[{"poster":"R3wan","date":"2015-02-10T07:50:50.216+0000","up_votes":2,"down_votes":0,"body":"Nem kell senkit letiltani. Hetek óta van ez a probléma, akinek van egy kis sütnivalója, az érintett időszakban nem erőlteti a rankedezést. :) De láthatod magad is, hiába a hivatalos reakció a problémára, még mindig kínozzák magukat, aztán nyitogatják az újabb és újabb ezzel kapcsolatos témákat itt a fórumon. Mert olvasni lusták.","replies":[{"poster":"Tazsam","date":"2015-02-10T12:14:01.428+0000","up_votes":1,"down_votes":0,"body":"\n\nDe ha be vagyok jelentkezve 6-tól akkor honnan tudom, hogy most éppen biztonságos rankedezni vagy már jönnek a problémák?","replies":[{"poster":"R3wan","date":"2015-02-10T16:14:16.640+0000","up_votes":2,"down_votes":0,"body":"Szerintem a legegyszerűbb, ha az érintett időszakban hanyagolod a rankedet, míg nem jelzik a riotosok, hogy sikerült orvosolni a problémát.","replies":[]}]}]}]}]}]},{"poster":"Skecci","date":"2015-02-06T19:08:13.548+0000","up_votes":1,"down_votes":0,"body":"Mire jutottatok eddig? Már ha ez nem titkos dolog.. ;)","replies":[{"poster":"nmoreKharon","date":"2015-02-17T20:56:12.424+0000","up_votes":1,"down_votes":0,"body":"Udv, az iment tamadt nekm is ez a hibam login kozben, majd mire megnyitottam bolna a bongeszot, hogy megprobaljam a fentebb emlitett tippet, bejott VISZONT \"ismeretlen hiba\" folyamatosan, majd bezartam , nyitottam egy youtube-t es MEGY!  Tmobil.","replies":[{"poster":"Sz1ke","date":"2015-02-17T21:16:41.638+0000","up_votes":2,"down_votes":0,"body":"Én napok óta úgy játszok. Nem tudom számít-e, mert a múlthéten 5 napon keresztül gond nélkül ment minden, aztán vasárnaptól megint sz*r esténként a kliens, hiába van megnyitva, vagy hiába szól a youtube.","replies":[]}]}]}]}]},{"poster":"HUN L3ll3r","date":"2015-02-17T20:29:57.507+0000","up_votes":1,"down_votes":6,"body":"Sziasztok!\n\nMostanság tényleg tapasztaltam én is, hogy most jobb a helyzet, most volt egy kisebb akadás a játékban. Ranked után természetesen nem jött be a stat oldal, kiléptem, majd be és onnantól kezdve cirka 20-30 percen keresztül klienshalál. Most úgy tűnik jó. Az a baj, hogy ha itt szidjátok a Riot-ot azzal nem oldódik meg a probléma. Igen, lehet hogy tudtok lépni mondjuk EU westre, mert az (szerintem) más útvonalon lép kapcsolatba, mint a nordicossal. Lehet azért válaszolnak 1 héten egyszer, mert lehet tele vannak spamelve, pl ilyenekkel? Vagy bármi más egyéb lüke dologgal. DE! Azzal is foglalkozniuk kell, legyen az bármilyen hiba, mert rossz fényt vetne rájuk, ha valaki nem kapja meg azt a fajta támogatást, ami elvileg jár. Még egy dolog...lehetséges, hogy azért jelentkezik más szolgáltatóknál is a hiba, mert eredetileg ahova mondjuk UPC lett bekötve, az Telekomos hálózat volt, de a UPC megvette tőlük, mert igény volt rá? Sok sikert a továbbiakban, és köszönjük az eddig munkátokat!\n\nU.I.: Aki panaszkodik mert belefizetett a játékba: senki se kért meg rá, hogy fizess a játék után, ha nem tetszik el lehet menni.","replies":[{"poster":"DragonGodSlayer","date":"2015-02-18T17:13:33.565+0000","up_votes":5,"down_votes":0,"body":"Téged se kért meg rá senki, hogy ide kommentelj, szóval, ha nem tetszik, hogy valaki jogosan panaszkodik, akkor el lehet menni. Én is belefizettem a játékba nem kis összeget, szóval szeretném is élvezni. A supporttal már levelezgettem, így én türelmesen várom, hogy javítsák a hibát. Viszont az ilyenek mellett, mint te nem tudok szó nélkül elmenni.","replies":[{"poster":"HUN L3ll3r","date":"2015-02-18T17:20:45.391+0000","up_votes":1,"down_votes":3,"body":"\nÉs ha panaszkodsz, attól jobb lesz? Nem tudnak itt vele mit csinálni. Én is belefizettem a játékba, nem is keveset, mégse panaszkodok, mert tudnak a hibáról, és rajta vannak az ügyön. Ha itt rinyáltok, azzal nem jutnak előrébb a hiba kijavításában. Én elnézem nagyon szívesen, ahogy itt ragelnek, mert jót röhögök rajtuk.","replies":[{"poster":"DragonGodSlayer","date":"2015-02-18T21:26:42.465+0000","up_votes":3,"down_votes":0,"body":"Igen jobb, mert jelezted a hibát. Gondolom, ha 1 hónapig nincs neted, akkor beszólsz a szolgáltatónak, hogy na nincs internet elérés csináljatok valamit, nem az, hogy fogod és fizeted a díját, miközben nem is tudod használni. Vagy nálad ez így működik? Az már más kérdés, hogy egyes kis gyerekek itt anyáznak, meg hasonló szép szavakkal illetik a Riotot. Viszont, ha már például pénzt fektetek bele, akkor hadd jelezzem már a hibát és, ha kérnek bizonyos adatokat (amiket kért is a support), akkor tudjak segíteni a munkájukban, hogy újra működőképes legyen a játék. Például ma is jeleztem egy bugot, mivel a Vi Q képessége beragadt és a játék további szakaszában nem lehetett használni, így az egész csapatomnak hátránya lett belőle. Ha az ember nem jelzi, hogy valami hibás, akkor lehet nagyon sokára lenne csak javítva, mivel nem biztos, hogy akik a Riotnál dolgoznak éppen belefutnak ebbe.","replies":[{"poster":"HUN L3ll3r","date":"2015-02-18T21:36:29.183+0000","up_votes":2,"down_votes":5,"body":"\nÖrülök neki, ügyes vagy. Csak az emberek elfelejtik, hogy az online játéknál vásárolt in-game content vásárlása nem jogosít fel, arra hogy anyázz ha nem működik valami. :D Ez nem olyan mint, hogy megveszed a bkv bérletet havi 10-ért, és felszállhatsz akármilyen buszra. Ha mondjuk lenne gametime a LoL-ba, és valami hardveres hiba lenne a részükről, amit ők rontottak el, azt mondom oké, jogos mások felmenőjét szidni. Azzal, hogy itt vásároltál skint, vagy championt, semmilyen privilégiumot nem ad neked. :D Ettől nem leszel VIP. Hiába mondjátok, hogy \"De én pénzt fektettem bele, had legyen jogom már anyázni!\", senki se kötelezett rá, hogy vásárolj könyörgöm. Én is rengeteg pénzt belefektettem ebbe a játékba, mégse küldöm el őket melegebb éghajlatra. És az, hogy nincs internet az megint egy tökéletes példa volt ellened. Ott előre fizettél egy szolgáltatásért. Ismétlem: ELŐRE. Remélem érted.","replies":[{"poster":"DragonGodSlayer","date":"2015-02-18T22:26:51.458+0000","up_votes":5,"down_votes":0,"body":"Nagyon leragadtál az \"anyázós\" résznél, gratulálok neked, hogy pont a lényeget ragadtad ki. Azt azért írtam, hogy hozzak negatív példát a hiba jelentésre. De azt többnyire a 14 év alattiak csinálják, szóval említésre sem méltóak. Egyébként értem én, hogy te mit akarsz mondani, hogy ez nem olyan, ha fizetsz jónak is kell lennie. Viszont, ami felett te elsiklasz az az, hogy az emberek fizetnek azért, hogy jobban élvezhessék a játékot. Ebből a Riotnak bevétele van, amit a fejlesztésekre, javításokra kell, hogy költsenek, mivel meg kell tartaniuk a játékosokat, illetve újakat is vonzaniuk kell, hogy a bevételük megmaradjon. Ergo a játékosok elvárhatják, hogy a játék működőképes legyen, mert ha nem így lenne, akkor a Riot lehúzhatná a rolót. Szóval lehet, hogy nincs szerződésünk a \"szolgáltatásért\", viszont lényegében íratlan van, mert kölcsönösen függünk egymástól. A hibajelentési lehetőséget se azért hozta létre a Riot, hogy ott porosodjon és nem hiába alkalmazz erre embereket, hogy segítsenek a játékosoknak. Szóval remélem végre te is felfogtad én mit akarok mondani, mert már lassan egy 5 éves szintjére kell lemenni, hogy felfogd.","replies":[{"poster":"Sz1ke","date":"2015-02-18T23:39:55.861+0000","up_votes":5,"down_votes":1,"body":"Erről van szó, erről papolok mióta, hogy itt a riotnak kell lépni nem a felhasználóknak.\nŐ érdekük, hogy mi még pénzt fektessünk a játékukba, a T-home-nak is érdeke kellene, hogy legyen, hogy játszani tudj, mert aki teheti, ha ér neki annyit a játék, akkor szolgáltatót fog váltani, bár feltételezem \"visszaélnek\" azzal, hogy ez úgysem fog bekövetkezni, mert sajnos az országnak jelentős részén még mindig nem köthető be más szolgáltató netje.\nMint azt leírta itt egy illető korábban, ő megtette azt a lépést, hogy felhívta őket.\nEredmény: ez nem hiba, kértek/kaptak tőle egy tracert naplót (tehát sehova nem jutott vele)\nErgo, ha ezt nézzük, akkor ott van amit leírtam korábban.\nFeltételezem van több száz panaszlevél tracert naplókkal tele, ott a bizonyíték nem is egy.\nBeszéljék meg a \"nagyok\" ezt a problémát és találják meg az arany középutat.\n2 éven keresztül nem volt dolgom jóformán a supporttal, és ide meg aztán pláne nem jártam az észt osztani, mert NEM volt rá szükség, ellenben az utóbbi 1-1,5 hónappal.\nA legbosszantóbb ebbe csak az, hogy annyi reakciót se látok ezekre egy riotostól se, hogy \"igen, van benne valami, megpróbáljuk ; nem, nem jó ötlet, mert ezért és ezért\" Így tehát hajlamos vagyok arra gondolni, hogy ők is csak várják a csodát amíg a legfőbb vezető megoldja majd talán egyszer a problémát.\nAddig is, ha véletlen elolvasná mégis egy illetékes, felvetnék egy olyan lehetőséget, hogy amíg ilyen állapotok uralkodnak EUNE-n, lehessen ingyen transzferelni EUW-re, és amint a hibát elhárítják, lehessen ingyen vissza is jönni aki még szeretne.","replies":[]}]}]}]},{"poster":"Grady7","date":"2015-02-18T17:35:24.826+0000","up_votes":2,"down_votes":0,"body":"Ezért van ez a poszt, hogy aki akar itt panaszkodjon ember... mit kell itt osztani az észt., had panaszkodjunk már ha egyszer 1 hónapja játszhatatlan este a játék... Ha nem tetszik akkor ne nézzed.","replies":[]}]}]},{"poster":"Tazsam","date":"2015-02-17T20:35:21.500+0000","up_votes":4,"down_votes":0,"body":"\n\n/off Feri te vagy az? XD","replies":[]}]},{"poster":"I Play Zed","date":"2015-03-14T07:53:27.053+0000","up_votes":3,"down_votes":0,"body":"Kedves idézők!\nSemmi pánik! Csak maradjatok nyugodtak! {{summoner:13}} Ismerősöm a Telekomnál dolgozik és a következőket mondta el nekem. Mivel az itt használt technikák elavultak, így körzetenként minden egyes helyi szervergépet le kell kapcsolni és egy új programkód alatt rebootolni. Ilyenkor a kliensnek mindig új útvonalat kell keresnie (ahogy Riot CéciDog is mondta). Egyértelműen ezeket pedig a kései órákban teszik meg.\nA hiba valószínűleg még több ideig is fenn fog állni, de a 3 nagy hazai szolgáltatóval a Riot felelőssége lenne kapcsolatba lépni ugyanis a frissítési folyamat még túl sok ideig fog fenn állni, ahhoz, hogy ne tegyünk ( a Riot !!!) ellene semmit.\n\nBárki aki velem tart commenteljen és írjon. {{item:2044}}","replies":[]},{"poster":"Kaksimandarin","date":"2015-03-04T21:09:25.875+0000","up_votes":3,"down_votes":0,"body":"hihetetlen hogy fent áll egy ilyen hiba tudják hogy hol lehet a hiba és 2-3 hónap sem elég hogy orvosoljátok a problémát. Most buktam egy ranked meccset mert hősválasztás közben megint hibát írt ki. Visszalépni természetesen nem tudok . (t-home) Mikor fogjátok végre megoldani?\nAz ember megveszi az rp-ket költ egy játékra utána pedig hiába jelentik 100-an a hibát mindenki szarik rá..","replies":[{"poster":"Worina","date":"2015-03-05T06:55:51.653+0000","up_votes":1,"down_votes":0,"body":"\n\nA szolgáltatómnál a NAT-os IP-m átváltattam  dinamikusra + újratelepítettem a játékot. A hibák majdnem 100%-ban megszüntek.\n(nekem már szinte játszhatatlan volt a játék)","replies":[{"poster":"Sz1ke","date":"2015-03-05T09:19:57.065+0000","up_votes":2,"down_votes":0,"body":"1 perce nincs, hogy felhívtam őket, állítólag az én ip címem, \"nincsen NAT-olva\". Mégis 1-2 nap \"megfelelő\" működés után jön vagy 3 este amikor megint össze-vissza lehal a kliensem.","replies":[]}]}]},{"poster":"Omega Ω","date":"2015-02-26T07:10:28.968+0000","up_votes":3,"down_votes":0,"body":"Még mindig. :( este 9 után","replies":[]},{"poster":"Fireblade09","date":"2015-02-16T05:29:59.330+0000","up_votes":3,"down_votes":0,"body":"Srácok azért ez már komolyan kriminális, mutogatni a szolgáltatókra, hogy a hiba miattuk van. Tényleg csak arra vagyok kíváncsi, miért a 5.x frissítés óta jelentkezik a hiba? Előtte nem volt gond a szolgáltatókkal? Pontosan a szezon kezdés napja előtt módosítottak vmit, amiért a lol összeomlik. Úgy érzem azért a riot sem hiszi el. Ismét elmondom, nekem nincs dc vagy crash a játékban (szerencsére), de a ping egekbe ugrása igen,  viszonylag hamar helyreáll, mert mi az a 3-4mp tétlenség egy teamfight közepén??, Na ugye, hogy semmi. Túl lehet élni, vagy nem. Jellemzően utóbbi. \n\nAhol már észrevehető, hogy laggolni a fog az hős választó, számtalanszor csinálja, hogy választok hőst, de véglegesíteni már nem tudom, mert inaktív a gomb, a számláló lefut, és utána 1-2 mp-vel véglegesíti a választásom.\n\nPl mi lenne, ha vissza lenne frissítve 1-2 napra a lol 4.x-re és megnéznétek úgy is a hibát. Kérnétek visszajelzést a játékosoktól, akár a kliensen belüli üzenetküldő rendszerben szólnátok nekik, hogy srácok nyílt itt a thread ahol várnánk a jelenlegi állapotról visszajelzést. \n\n\n\nDe az sem igaz, hogy csak nálunk magyaroknál van gond ismétlem. Nem magyarokkal játszottam a hétvégén, és több alkalommal is vkinek másból sem állt a játék, hogy rc-zett, harc, lagg, meghalt, (hozzáteszem ha egyáltalán eljutott a harc szinhelyéig), majd dc, és aztán kezdte újra. Régen ezt az okos rendszer statisztikán kívüli vereségnek könyvelte el, most miért nem lehet ezt megcsinálni? Mikor folyamatosan 4v5-ben vagyunk kénytelenek egy meccsen szenvedni?\n\nNem találok rá tényleg jobb szót mint szánalmas.\n\nAzt is tudom, hogy kevesebben vagyunk ebben a régióban, mint a többiben, így le sem sz....ja itt riot ha máshol megy rendesen.\n\nDe csak megjegyzés képpen, DIGI-m van, teszteltem a netem az adott időszakban, és 2ms a pingem. \n\nNa azt hiszem én mindent elmondtam amit gondoltam.\n\nui: a kitartás és türelem már a végét járja.\nA hiba pedig napszaktól független.\n\n","replies":[]},{"poster":"rasztanyul","date":"2015-03-14T19:12:34.195+0000","up_votes":2,"down_votes":0,"body":"Most már megint ott tartunk, hogy este 7 órától kezdenek fellépni a hibák, először a kliensen belül a csevegési szolgáltatást nem tudja felépíteni, miután azzal próbálkozni az ember, hogy újraindítja a játékot vagy frissíti az internetes kapcsolatát és utána próbálni belépni, egyszerűen nem engedni be a játék, letudva egy ismeretlen hibával. Ha meg esetleg a véletlen miatt sikerül belépni és szeretne az ember netán játszani a barátaival, biztos előfordul az, hogy 4-ből 2-nek kliensen belüli hibája lesz, ami kellő frusztrációt okoz minden játékosnak. Már kezd elegem lenni, hogy csak ez az időszak jó nekem a játékra és nem tudok egyszerűen játszani. Már S1 óta játszok a LoL-lal és most kezd eljönni nálam az a pont, amikor letörlöm és nem fogom soha többé feltelepíteni.\n\nAz hogy a RIOT áthárítja a felmerülő problémát az internet szolgáltatókra az meg nonszensz. Joggal tehetnénk fel azt a kérdést, hogy a többi játéknál miért nincs ilyen hiba? Ha többi játék is képes stabilan működni attól függetlenül, hogy az internet szolgáltatóknál van a hiba forrása, az azt bizonyítja, hogy a **RIOT-nál sincs minden rendben**. \n\nNem a játékosokra kell áthárítani a feladatot, hogy ők oldják meg saját maguknak a problémákat azzal, hogy egyesével beszélnek pl. a Telekommal, hogy elmagyarázzák, hogy nem tudnak esténként játszani és örülhetnek ha az ügyfélszolgálat jól ki nem röhögik azzal, hogy náluk semmilyen gond nincsen. Ezt az ügyet csak a RIOT-nak kell elintéznie, mivel neki az a feladata, hogy működőképes és kifogástalan szolgáltatást nyújtson a játékosoknak vagy legalábbis törekedjen rá, amit legtöbben itt hiányolnak. \n\nMások nevében is remélem nem kell hónapokat várni arra, hogy a hibák megoldódjanak és újra tudjuk élvezni a játékot. {{summoner:1}}","replies":[{"poster":"DragonGodSlayer","date":"2015-03-15T18:23:22.524+0000","up_votes":4,"down_votes":1,"body":"Ha a szolgáltató lenne a hibás, akkor Westre miért enged fel egyből? Ott ismeretlen hibát sem írt még egyszer sem. Attól, hogy szervert váltok még a netem nem lesz másabb. Szóval a Riotnál van a bibi.","replies":[]}]},{"poster":"Lady tRuffLeS","date":"2015-04-09T21:01:31.391+0000","up_votes":2,"down_votes":0,"body":"Sziasztok!\n\nNálam tavaly decemberben kezdődött ez az \"ismeretlen hiba\" rémálom, ami napi szinten megkeserítette a játékom, a játékba bejelentkezésnél folyamatosan \"ismeretlen hiba\" üzenetet kaptam, nem tudtam belépni a kliensbe. Ez a probléma többnyire az esti órákban jelentkezett, órákig próbálkoztam belépni, és folyamatosan ezzel az \"ismeretlen hiba\" üzenettel szembesültem. Ha órák múlva végre sikerült belépnem a kliensbe, akkor épp a csevegési szolgáltatás nem működött, és a kliens sem töltődött be. A játékostámogatás oldalon a support nagyon kedvesen és segítőkészen állt hozzám, az általa kapott részletes útmutató alapján minden szükséges módosítást elvégeztem, de sajnos a probléma nem oldódott meg, március elején 4 órányi belépési próbálkozás után feladtam a harcot.\n\nIdőközben Ausztriába költöztem, internetszolgáltatót váltottam, és érdekes módon azóta a belépéssel kapcsolatos problémáim teljes mértékben megszűntek. Magyarországon az internetszolgáltatóm a Magyar Telekom volt. Én teljes mértékben meg vagyok róla győződve, hogy itt internetszolgáltatói hibáról van szó és nem RIOT hibáról. Amióta új internetszolgáltatóm van, semmilyen problémám nincs a játékkal, se lagg, se belépési probléma, remélem ez így is marad a jövőben! :-)","replies":[{"poster":"Tiburka","date":"2015-04-22T19:01:29.059+0000","up_votes":1,"down_votes":0,"body":"Mi is a Magyar Telekommal kötöttünk szerződést, és érdekes, hogy amikor szarakodik EUNE akkor átlogolok EUW-es accra minden rendben van...","replies":[{"poster":"Dædalus","date":"2015-04-30T10:52:26.710+0000","up_votes":2,"down_votes":0,"body":"Az EUNE Frankfurtban van, és más az IP címe, mint az Amszterdamban lévő EUW szervernek. A Telekom bérli a gerinchálózatát több külföldi szolgáltatótól, és az egyik ilyen külföldi szolgáltató nem engedi át a forgalmat este a frankfurti szerverünk IP címére. Ezért van, hogy az EUW-et el tudjátok érni, az EUNE-t pedig nem. Ezért vagyunk folyamatosan kapcsolatban a szolgáltatóval, de sajnos ezen kívül nem igazán tudunk mit tenni, mert a hiba nem nálunk van.\n\nViszont úgy hallottuk, az elmúlt pár napban javult a helyzet. Megnéznétek, és írnátok nekem egy választ [ide](http://boards.eune.leagueoflegends.com/hu/c/altalanos-beszelgetes/lNfzEoE7-raomaalom-ismeretlen-hiba?sort_type=recent&comment=0093)?\n\nKöszi!","replies":[]}]}]},{"poster":"Tazsam","date":"2015-04-07T19:45:18.490+0000","up_votes":2,"down_votes":0,"body":"Oké, korábban írták többen, hogy ha a meccs előzményeket behozza akkor minden ok. Na ennek vége. Látszólag jó a kliens de picknél ismeretlen hiba és nem tudok pickelni. kétszer is megszívtam most már 30 perces a várakozás, juhééééé :(","replies":[]},{"poster":"Csöves Nyuszi","date":"2015-04-02T18:53:10.709+0000","up_votes":2,"down_votes":0,"body":"Sziasztok!\n\nNekem csak annyi lenne a kérdésem hogy akkor az ilyen ismeretlen hiba miatt ha ledob a rendszer ranked karakter választó oldalról akkor is ugyan úgy megkapom a kilépésért járó büntetést. A kérdésem az lenne hogy ilyenek mellett hogy jusson fentebbi divízióba az ember?","replies":[]},{"poster":"rasztanyul","date":"2015-04-01T19:32:47.569+0000","up_votes":1,"down_votes":0,"body":"Már kezdtem reménykedni, hogy tegnap hibamentesen futott a kliens, de most megint sorban jelentkeznek a hibák...","replies":[{"poster":"Gerathorn","date":"2015-04-01T20:00:50.787+0000","up_votes":1,"down_votes":1,"body":"Eddig tartott az idill... :D Megint lenyúlta a zinternetet a csúnya szolgáltató! :DDD","replies":[{"poster":"Dzsime","date":"2015-04-01T20:56:19.796+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Gerathorn","date":"2015-04-01T21:00:35.539+0000","up_votes":1,"down_votes":0,"body":"Nálunk ingame csak kifagyott a support. Ki is kaptunk, aztán az egész kliens lehalt a pics*ba. I feel your pain.","replies":[]}]}]}]},{"poster":"mactasmaister","date":"2015-03-31T11:04:00.491+0000","up_votes":2,"down_votes":0,"body":"Alairva","replies":[]},{"poster":"Cigikave","date":"2015-03-31T10:37:44.678+0000","up_votes":2,"down_votes":0,"body":"Itt felszavaztam, ott aláírtam. Legyünk pár százan/ezren. Mondjuk bele kellene írni, hogy a végén mind a szolgáltatókhoz, mind a Riothoz el lesz juttatva a végeredmény.","replies":[]},{"poster":"HUN L3ll3r","date":"2015-03-28T18:05:32.361+0000","up_votes":2,"down_votes":0,"body":"Felhoznék egy példát, ami régebben történt velem. Régebben a T-nél volt olyan, hogy tönkrement valamelyik szerverük és CSAK bizonyos embereknél szünetelhet a szolgáltatás. Ez mit jelent? Azt, hogy nem mindenki egy switch-re van kötve valószínűleg. Vagy nem mindenki egy szerverre van kötve. Ez nem úgy működik, hogy Bp-n belül összefonódnak a kábelek, és mindenki azt használja. Szépen, minden egyes háztartásnak van egy külön kis csatlakozó pontja a szerverekhez. Szerintem, ezért nem akadozik mindenkinek. És leírom újra. Azért nem akadozik az EUW meg NA, mert teljesen más útvonalon éri el a két szervert. TELJESEN MÁS ÚTVONALON. Ezek a szerverek azért többes számba vannak, mert többen vannak, más-más helyen. Más útvonalon. Más proxykon, más ip címen, más a dns is (gondolom én). Valaki szóljon ha tévedek. Számomra ez logikus.","replies":[]},{"poster":"Naixx","date":"2015-03-28T11:05:04.904+0000","up_votes":1,"down_votes":0,"body":"Üdv.\n\nNálam nem jelentkezett a probléma. Nincs kifagyás, nincsen kidobálás. EUNE-n teszteltem este és nappal is. (Digi és Invitel és T-Home Mobil Nettel). Nem volt gond. EUNE-n is tökéletesen futott és Westen is tökéletesen fut. Régebben volt Westen probléma, de ez ritkán fordult elő az is szerver hiba miatt és ilyenkor eltörölt vereséget is kaptam, mert a szerver 90% kiesett a játékokból. Ergo, ha a szerverrel lenne probléma akkor nálam is jelentkezett volna a hiba úgy hogy 3 szolgáltatót is teszteltem. Frissítsétek a hálózati kártyátokat illetve a Bios-t is akár. Állítsátok be megfelelően a routereteket (Ha van!). Illetve, ha nem tetszik a szolgáltató váltsatok. Használjatok VPN-t (ingyenesek is vannak!). Illetve beszéljetek a szolgáltatóval. (Nem telefonon! Menj be személyesen és ha kell akkor csapkodd az asztalt. Azért vannak, hogy megoldják a problémát. Szép szóval nem fognak foglalkozni. De, ha rosszabb hangnemben szólsz azonnal utána néznek. Példa: Ismerősöm T-Home nál van és lassú lett a net. Felhívta a szolgáltatót és azt mondták neki, hogy nincs semmi probléma. De a probléma még mindig jelen volt. Utána bement személyesen és kb elküldte őket a f*szba. Miután ez megtörtént haza ment és lám-lám.. az internet sebessége felugrott. Csak egy kicsit oda kell szólni, nem beszarinak lenni. Ha meg tűröd akkor vess magadra.)","replies":[{"poster":"Flecksd","date":"2015-03-28T11:44:42.039+0000","up_votes":2,"down_votes":0,"body":"Akkor csak mondom h ezeken mind túl vagyok! Minden beállítást hibamegoldást megcsináltam amit te is meg a support is elmondott. Ennek ellenére a hiba fentáll továbbra is. Igen a Tnél nekem is volt netgondom ragaszkodtan hozzá h nézzenek rá és lásd megcsinálták ezt is jelenetetem már minden platfromon sőt ismerős Thome szerelő is  közben járt de a probléma még mindig fentáll. Am az is érdekes h nekem is van olyan T-s nettel rendelkező ismerősöm akinél minden rendben van. Akkor hol is a hiba? \nJa és ha te EUW szerveren játszl állandóan akkor honna tudod h mi itt mit élünk át minden nap ezzel a nyavajával","replies":[]}]},{"poster":"xzotya","date":"2015-03-28T09:58:12.532+0000","up_votes":2,"down_votes":0,"body":"Első alkalommal használtam a \"támogatás\" részleget, viszont letudtak annyival, hogy biztosan az én kapcsolatom instabil és ha nem szeretnék büntit akkor ne játsszak amíg stabil nem lesz. \n\nNagyon érdekes, hogy bármely más szerveren játszom, soha nem találkoztam még ilyen hibával. Kizárólag EUNE este 20:00-22:00 között, ahogyan HUNFlecksd is írta. \n\nEgyre többet gondolkodom azon, hogy törlöm a fenébe, mert többet idegeskedem a játék miatt mint amennyi szórakozást, kikapcsolódást nyújt...\n\n\nAzt azért megjegyezném, hogy érezhető volt a segítőkész szándék a support részéről.","replies":[]},{"poster":"Flecksd","date":"2015-03-28T08:27:03.330+0000","up_votes":2,"down_votes":0,"body":"Na én is kipróbáltam csúcsidőben van e gond másik szervereken. Jelzem thome 120as netem van. NA és EUW szervereken semmi de semmi gondom nincs megy minden mint a karikacsapás. EUNE szerveren még a meccskeresést sem tudom elindítani rendesen (este 20.00-22.00 közt). Akkor ez hol a szolgálgtató hibája? Csak kiegészítésként haverom teljesen más szolgáltatón(Alföldnet) szintén szenved ezzel a rémálommal!","replies":[]},{"poster":"Tazsam","date":"2015-03-22T19:11:31.627+0000","up_votes":2,"down_votes":0,"body":"Felvettük, kiröhögtek, megjavult?","replies":[]},{"poster":"Ronnieradke","date":"2015-03-15T21:21:43.669+0000","up_votes":2,"down_votes":0,"body":"Én egy egyetemre járó, és mellette dolgozó ember vagyok, aki örül, hogy este egy játékot le tud nyomni, de egy kicsit frusztráló, hogy amint az óra 19:30-ot üt a log in screent 20 percig nézem, vesztem az lp-ket champ selectnél, és közben az undefined errort spammolja a pofámba. Azt tudom, hogy a Riot nincs a helyzet magaslatán (Spagettikód -> valamit megjavítasz 30 dolog bebugolódik), de hogy egy olyan cég, ami a bevétele alapján világranglista dobogós, ennyire nem ért hozzá vagy nem is érdekli, az kicsit gáz. \nEgyszerűen minden logikát kimerít az az állítás, hogy a ti oldalatokon nincs semmi probléma, amikor mindenkinél ez Pre-season kezdeténél jelentkezett a dolog, és a többiek elmondása szerint csak EUNE-t érinti. Tudom, hogy ez nem ide tartozik, de nagyon sok pénzt fektettem már ebbe a játékba, és kicsit elszomorít, hogy kénytelen leszek EUW-ra átmenni(megint egy rakat pénzért), csak hogy tudjak játszani, mint bárki más. \n\nUtolsó megjegyzés: A T-Home mindig is keményen lefogja fosni, hogy milyen problémád van egy Internetes játékkal, akármennyi jelentés érkezik be hozzájuk, és tulajdonképpen engem se érdekelne, mivel az aláírt szerződés nem tér ki arra, hogy megoldja az ilyen kis inkompatibilitási problémákat, amit lefogadnék egy DJ Sona skinbe, hogy a Riot is megtudná oldani, ha nem csak pénze lenne rá, hanem esze és akarata.\nItt most nem a magyar staffról beszélek, mert hiába ők megtesznek mindent, csak egy nagyon pici fogaskerék a gépezetben.","replies":[]}]}