{"poster":"04200","date":"2016-08-14T19:13:22.498+0000","title":"literally perma banned after 1 bad game","subforum":"Player Behaviour","up_votes":1,"down_votes":2,"body":"so, i made a new account to lvl up and play some ranked with fresh mmr, i payed for all 4 boosts, (50 win xp boost, 3 day xp boost, and the same for ip) i played for roughly 12 hours, for 3 days in a row, i was doing really well, helping newplayer along the way, defending new players from the barrage of insults from the rest of my team, almost every game this happened, (when my games weren&#039;t filled with lvl up bots that is, which was almost every game btw you need to fucking do something about that riot.) so, i&#039;m lvl 28 almost finished, i get into a normal game, wait for my team to pick roles, then i filled in the jungle, i start top side. the lux top with a name like 828nhnbnf3nd, (a bot account i found out later in the game that is the mid laners account) which i didn&#039;t know at the time so i asked lux multiple times for help on krugs, i was completely ignored, minions came and she went ahead and started farming, i tried to solo the camp and died (obviously) i was instantly flamed by my bot lane and mid. of course i defended myself and actually got quite mad, (as anyone would in my position) i have just been completely ignored my my top lane, then died to jungle then get flamed by my team, normal games don&#039;t normally effect my mental state at all, but i felt like i was being completely mistreated and attacked by my team unfairly, after a few messages back and forth between my team and me, i decide to not play the game out due to further mental stress as i have some problems (ones where i am not forced to work and am advised to stay indoors by my government, i am payed for this, not much but enough to live) so instead of just leaving the game which would have been the right thing for me to do, (and i wouldn&#039;t be banned either if i did smh) instead i stayed in the game because i needed to exp, and i just kept defending myself as i felt like i was extremely mistreated by my team, also after trying to defend myself in all chat because my team were all trying to get me reported 9 times, the other team didn&#039;t like the fact i was trying to get my point across, and all agreed to report me after game. the result of this was me being perma banned for being toxic after 1 single game, if this isn&#039;t bad enough, not a single real person saw the game or even the logs, it was the result of a program automatically perma banning me because both team disliked me from 1 game where i said some mean things to kids on the internet, 1 game, i&#039;m honesty in shock, i&#039;ve been sat here for the past 2 hours trying to contact riot support, i&#039;m just so shocked they could do this to someone after 1 game, this can&#039;t be fair seriously? am i the only person this has happened to? i don&#039;t know what to do anymore honestly, like, fuck.","replies":[{"poster":"Bunny","date":"2016-08-15T02:22:52.174+0000","up_votes":2,"down_votes":0,"body":"USE PARAGRAPHS","replies":[]},{"poster":"Deep Terror Nami","date":"2016-08-15T00:33:14.184+0000","up_votes":1,"down_votes":0,"body":"Punishment is done through a system of escalation, moving from chat restrictions up to a temporary ban then a permanent ban each time you are punished if you continue exhibiting consistent negative behavior. Have you received punishment prior to the permanent ban? If you already had a 14 day account ban then a permanent ban was the next step regardless of the severity of the negative behavior that triggers another punishment.\n\nExtreme behavior may result in skipping punishment tiers. For chat offenses, this is usually things such as hate speech (racist/homophobic slurs etc.) or threats of violence (urging someone to suicide or threatening harm on yourself or others etc.) and other illegal activity. Intentionally ruining games through gameplay (trolling, feeding etc.) will always skip chat restrictions and go to a ban.\n\nYou should've received a reform card in-client and by email for your punishment, with chat logs if the punishment was dealt by the Instant Feedback System for chat offenses; did you receive one, and what did it say?\n\nIf you need more information or need to contest your ban you'll need to submit a [Support Ticket](https://support.riotgames.com/hc/en-us/requests/new). If you've already submitting one, please be patient and do not submit multiple tickets or bump it; bumping tickets pushes it to the back of the queue, and it can can a few days for Player Support to get to it.","replies":[]},{"poster":"04200","date":"2016-08-14T19:25:16.883+0000","up_votes":1,"down_votes":1,"body":"also, i have had no warning messeges or prior suspensions on this account, 2 days old, first game i flamed on this account at all, 95% of my games where me carrying scripting lvl up bots in 3v3 bots","replies":[]}]}