{"poster":"brandon2000","date":"2016-09-24T02:46:50.042+0000","title":"Ayuda con Lee","subforum":"Guias y consejos","up_votes":1,"down_votes":1,"body":"me dificulta el tema de late, en early todo bien, pero en late ganks por aca ganks por alla, caes a bot y el otro jg cae a mid, el mid te flamea, te flamea por no dejarle blue, a vecez sigo bien pero mi team no hace nada, y cuando me presionan me pongo nervioso y me pongo alto manco","replies":[{"poster":"K Í N G K U S H","date":"2016-09-24T02:58:49.748+0000","up_votes":2,"down_votes":0,"body":"Eso no tiene que ver con Lee, tiene que ver contigo, los mejores junglas siguen las jugadas del jungla rival y lo deniegan totalmente.","replies":[]},{"poster":"9081913DEL1","date":"2016-09-25T12:16:25.008+0000","up_votes":1,"down_votes":1,"body":"Bueno todos los campeones tienen un punto fuerte, lee es mas early que late por obvias razones.\nConsejos: \n- Hacete el castigo que da wards, no hace falta que seas asesino ya  hay muchos killers y tenes buen daño en early y gapcloser/escape decente. \n- Buidleate tanky, late no te da el daño de rek, seguir build daño u offtank te va a dar poco resultado si estan fullbuild, si llegaste hasta el minuto 40 te vas a arrepentir, si va todo bien y la podes terminar antesd e los 30 todo bien, si no.....\n- Los wards son tu forma de ayudar al equipo, pero tambien tu forma de rastrear al enemigo. Tu trabajo con lee es justamente el counter, anda marcando al jungla y anda donde va el. Siempre parece que te podes llevar el doble en bot, pero solo matando al jg en su gank fallido estas atrasando a dos tambien. y dps podes caer bot. La clave con los de buen early es justamente stompear, asique anda buscando la forma de darles daño.\n\nPinks, si todos ponen pinks ideal, si no vos pone el tuyo, que siempre este en el mapa, ese es tu lados \"seguro\" para caminar.\n\nCada vez que veas al jg, y estes lejos de el, lo marcas, tiras al alerta y vas a hacer daño o a una torre o a moelstar una linea.\n\nEn si es practica. Posicion posicion posicion es lo que el jungla tiene que manejar. Por eso rek te va a dar un dolor de cabeza si vas lee.\nSaludos.","replies":[]}]}