{"poster":"rana del ley","date":"2016-10-02T22:29:50.685+0000","title":"Morgana","subforum":"Creaciones de la comunidad","up_votes":21,"down_votes":2,"body":"La noche se recostaba sobre ella, bañando todo de una oscuridad casi total. Solo la luna, valiente y altiva alumbraba tenuemente las sombras del bosque, haciendo lucir todo aún más lúgubre. Ella ya no tenía a donde ir, sabía que acababa de ser exiliada para siempre del paraíso, el peso de sus acciones habían cavado su tumba, volver significaba correr el riesgo de que su padre pusiera fin a su fugaz existencia.\r\nSe abrazo a si misma, intentando defenderse del frío, pero fue inútil, este no estaba fuera, sino dentro de su alma. Todo en ella se estaba convirtiendo en hielo, poco a poco se estaba entumeciendo, olvidando todo rasgo de humanidad o bondad, Morgana se estaba retrayendo dentro de si misma, encerrando sus buenos sentimientos en una jaula de odio. Su alma estaba mutando, convirtiéndose en algo amorfo, horrible y perverso.\r\nSe recosto sobre un tronco seco y poso sus azules ojos en la luna, que poco a poco la fue cautivando. Su ensoñamiento fue interrumpido por el ruido de una rama al romperse. Ella no estaba sola, alguien la observaba desde las sombras, casi espectante.Pero, ¿qué esperaba?. No hizo falta que ella lo pensara por mucho tiempo, porque el hombre emergió desde las sombras.\r\nUna larga capa de terciopelo negro lo cubría por completo, dejando solo a la vista unas esqueléticas manos. El ser extraño se paro frente a ella y la miro por un largo tiempo a los ojos, acto seguido tomo una de las manos de la angelical joven y sin siquiera hablar le transmitió todo lo que quería decirle.\r\n''Sé cuanto los odias por exiliarte, sobre todo, sé el odio que tenes en particular por tu hermana, quien te hizo vivir toda la vida a su sombra. Oh querida, entiendo cada una de tus lágrimas. Nunca mereciste tanto dolor, naciste para algo mucho más grande. Lo que yo te ofrezco es dejar atrás todas tus buenas intenciones y quemar su paraíso.''\r\nMorgana lo miro seducida por la propuesta, era lo que había esperado toda su vida. Finalmente alguien la reconocía, por fin veían el poder que ella tenía, era el momento, ahora ella los haría sufrir.\r\nSonrió con malicia y tomo la mano de aquel extraño.\r\nhttp://2.bp.blogspot.com/-g2OAdcqw17o/U4hhwy3bHOI/AAAAAAAAByQ/JuNMDnvqYK8/s1600/lol__tell_me_your_wish___morgana_by_beanbean1988-d4yljri.jpg","replies":[{"poster":"Katastrophical","date":"2016-10-02T22:35:36.370+0000","up_votes":6,"down_votes":0,"body":"Linda redacción, aunque en un primer momento pensé que era alguna duda sobre el champ, jaajjaja","replies":[]},{"poster":"Ingratitud","date":"2017-08-15T04:22:50.695+0000","up_votes":2,"down_votes":0,"body":"+1 un poco viejo pero +1 sin duda","replies":[]},{"poster":"TheSystruction","date":"2016-10-03T12:53:20.736+0000","up_votes":2,"down_votes":0,"body":"taringuero level 5, hazme un resumen de 2 líneas {{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"Marnie","date":"2016-10-03T18:52:34.328+0000","up_votes":1,"down_votes":0,"body":"Espectacular, me encantó, aunque yo sea del bando de Kayle D:","replies":[]},{"poster":"Hendrix","date":"2016-10-03T12:22:36.722+0000","up_votes":1,"down_votes":0,"body":"Te ganaste el +1","replies":[]},{"poster":"Kanan","date":"2016-10-03T01:59:46.489+0000","up_votes":1,"down_votes":0,"body":"Pense que era un fanfic hentai cuando empece a leer uwu{{item:3151}}","replies":[]},{"poster":"Summer Nights","date":"2016-10-03T00:43:47.543+0000","up_votes":1,"down_votes":0,"body":"Good stuff","replies":[]}]}