{"poster":"Nevict","date":"2015-02-28T21:21:54.636+0000","title":"Le opinioni della maggioranza","subforum":"Discussioni generali","up_votes":1,"down_votes":2,"body":"Salve a tutti,\nsono consapevole che quello che sto scrivendo possa essere ritenuto come il lamento di un bambino, ma quello che mi è successo oggi mi ha fatto rattristare molto. Nonostante il mio comportamento da \"avversario onorevole\" ho ricevuto un report per \"abuso verbale\". Sono consapevole che queste cose non sono io a deciderle e che non ho assolutamente il diritto di lamentarmi, ma non mi piace essere accusato di \"abuso verbale\" quando tutto quello che scrivo sono complimenti.\nCercherò di esprimere il mio punto di vista nella maniera più chiara possibile nella speranza di non essere frainteso. Non mi piacciono le persone che si arrabbiano con i propri compagni quando una partita va male ed essendo consapevole di non poter fare nulla per farle smettere ho deciso di adottare una semplice regola che tutti conosciamo: \"non fare agli altri quello che non vuoi sia fatto a te\". Ho fatto di questa semplice regola il mio codice di condotta online, non ho mai rimproverato gli altri giocatori, né detto loro come dovrebbero giocare (esempio: \"sei un n00b! perché ti sei messo quell'oggetto?! impara a giocare!\") perché non mi piace che venga fatto a me.\nNonostante questa mia convinzione e i miei sforzi... al termine di una partita mi è comparso un pop-up: \"la maggioranza dei giocatori di LoL ti ha ritenuto colpevole del seguente reato: abuso verbale. Va bene essere arrabbiati, ma cerca di non esagerare\". Quando ho letto questo testo, mi sono sentito offeso, molto offeso e ho deciso di scrivere questo post. \nSecondo la logica di questo pop-up, devo smetterla di comportarmi sportivamente e cominciare a dare la colpa agli altri delle mie sconfitte perché il mio atteggiamento permissivo è sbagliato.\nPer farla breve, oggi sono stato profondamente offeso dalla community di League of Legends che si diverte a reportare gli altri e vorrei che mi scriveste delle parole di incoraggiamento perché a questo punto temo che un atteggiamento sportivo porti solo guai.","replies":[{"poster":"IamTheDream","date":"2015-02-28T22:28:54.894+0000","up_votes":2,"down_votes":0,"body":"Fa male per tutti quelli che si comportano bene, fa male per tutti quelli che notano \"*irregolarità*\" e poi vedono le proprie segnalazioni finire nel dimenticatoio, fa male quando noti che le persone \"negative\", quelle che trollano o insultano, fanno un report e chi ha dato l'anima subisce un report.\n\nDi ingiustizie ce ne sono e ce ne saranno sempre (qui come altrove), o si impara a convivere con esse o si abbandona. :(","replies":[{"poster":"Nevict","date":"2015-02-28T22:34:43.941+0000","up_votes":3,"down_votes":0,"body":"League of Legends mi piace troppo per abbandonarlo al momento, ma non mi sta bene accettare queste cose. Se proprio la gente deve comportarsi così, allora io farò l'opposto! D'altronde, andare contro corrente è sempre stato fico, no? Un giorno spero di diventare così \"popolare\" su League of Legends, da essere d'esempio a tutti.","replies":[{"poster":"IamTheDream","date":"2015-02-28T22:45:36.175+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nevict,realm=EUW,application-id=MJVj50Jw,discussion-id=GYjjGNj2,comment-id=00010000,timestamp=2015-02-28T22:34:43.941+0000)\n... Un giorno spero di diventare così \"popolare\" su League of Legends, da essere d'esempio a tutti.\n\nte lo auguro :D","replies":[]}]}]},{"poster":"LordSauron1990","date":"2015-02-28T21:28:57.973+0000","up_votes":1,"down_votes":0,"body":"se hai vinto è normale che ti abbiano reportato gli avversari. sono rosiconi.lasciali perdere...tanto segnalando cosi si rovinano soltanto, perche le loro segnalazioni perdono credibilità. se è questo quello che è successo.","replies":[{"poster":"Nevict","date":"2015-02-28T21:39:51.614+0000","up_votes":2,"down_votes":0,"body":"Il problema è che ho perso. Tutto quello che ho scritto è stato: \"congratulations for the win. despite the defeat, i had fun.\".","replies":[{"poster":"SideshowEMS","date":"2015-02-28T21:43:21.485+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nevict,realm=EUW,application-id=MJVj50Jw,discussion-id=GYjjGNj2,comment-id=00000000,timestamp=2015-02-28T21:39:51.614+0000)\n>\n> Il problema è che ho perso. Tutto quello che ho scritto è stato: \"congratulations for the win. despite the defeat, i had fun.\".\n\nE allora ti hanno reportato per aver scritto una frase di senso compiuto in inglese. Puoi scrivere solo GG. E' la regola.","replies":[{"poster":"Ucr0niA","date":"2015-02-28T21:56:01.518+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SideshowEMS,realm=EUW,application-id=MJVj50Jw,discussion-id=GYjjGNj2,comment-id=000000000000,timestamp=2015-02-28T21:43:21.485+0000)\n>\n> Puoi scrivere solo GG. E' la regola.\n\nNon incitiamo certe logiche.\nPoi beh, che i \"*certe nazionalità*\" non capiscano nulla di inglese è risaputo","replies":[{"poster":"Nevict","date":"2015-02-28T22:05:50.869+0000","up_votes":2,"down_votes":0,"body":"è che... fa male... molto male... soprattutto quando non capisci il perché. Forse starò esagerando, ma non si rendono conto di quanto faccia male essere accusati di qualcosa che non si è fatto? è come se ti accusassero di aver commesso un furto che non hai commeso. Perché le persone non hanno sensibilità? Poi sono quelli come me che soffrono...","replies":[]},{"poster":"SideshowEMS","date":"2015-02-28T22:53:31.011+0000","up_votes":1,"down_votes":0,"body":"> Non incitiamo certe logiche.\n\nSi capiva che ero ironico vero ? Se mi dai una risposta seria mi fai venire il dubbio. Avrei dovuto aggiungere un punto esclamativo !","replies":[]}]}]}]}]}]}