{"poster":"jaymc1130","date":"2016-10-04T23:35:15.925+0000","title":"Junglers, if you ever, once, ever utter the phrase \"I need leash, no leash no gank\"","subforum":"Gameplay","up_votes":16,"down_votes":128,"body":"You have no business jungling ever. Period.\r\n\r\nNo jungler should NEED a leash first of all, if you can't solo clear half a jg quadrant without any assistance then you have zero clue how to properly manage the camp aggro and micro your way around so you take the least dmg possible. There is not one single champion that cannot do this. Not one.\r\n\r\nSecondly, if you refuse to play the game properly after that and avoid a lane just because it didn't leash you when you fail to communicate effectively what you would like your opening 4 minutes to go like as the jg you should be perma'd on the spot for trolling. Period.\r\n\r\nStop acting like little bitches just becasue you fools can't figure out how to play your role properly, just stop playing it at all and do us all a favor.\r\n\r\nTroll the games just because you don't know where or how to start in the jg... sheez.","replies":[{"poster":"Randomonium","date":"2016-10-05T00:03:51.640+0000","up_votes":32,"down_votes":1,"body":"There are no words for how absurd this post is. Not giving your jungler a leash results in them being way far behind the other jungler, makes them incredibly susceptible to an invade, and makes them be at a much lower health if they go for a gank after 3 camps.\n\nI honestly don't blame any jungler who avoids your lane if you refuse to leash. Playing jungle is all about maximizing your resources. If a laner isn't willing to provide a leash, which is literally NO cost to the laner, then I wouldn't trust that guy to carry the game. That kind of person is usually so ignorant and toxic that they'll go on tilt over the tiniest things.","replies":[{"poster":"The Oasis","date":"2016-10-05T04:36:20.728+0000","up_votes":5,"down_votes":4,"body":"> [{quoted}](name=Randomonium,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=0007,timestamp=2016-10-05T00:03:51.640+0000)\n>\n>If a laner isn&#x27;t willing to provide a leash, which is literally NO cost to the laner\n\nWhat if they have some kind of Cheese planned?  Or what if they're in a difficult lane and getting the early push will help them win it?  There are circumstances where a jungler should be able to adapt.  ","replies":[{"poster":"Randomonium","date":"2016-10-05T10:43:26.061+0000","up_votes":4,"down_votes":0,"body":"You can provide a minor leash and still get to lane before the minion wave hits.  Spawn timers are specifically designed to allow for side laners to provide a leash and still get to lane by the time the minion waves collide.  Even if you get to the lane a couple seconds after your opponent it is still possible to outpush him and get level 2 first.  Furthermore, its also very easy to avoid level 2 or level 3 all ins if you play correctly.\n\nIf you are trying to cheese or are extremely worried about your lane then you should be communicating that with your jungler so he knows to start on the opposite side.  Not communicating and then ignoring his pings at 1:30 is simply not acceptable.\n\nIf you don't leash for your jungler that really sets them behind as I described above and severely gimps his ability to provide early pressure relief.  That's an extremely bad gameplan if you know you're already going into a bad lane matchup.\n\nI've never seen a jungler tilt if his laner communicated with him.  The only time the whole \"no leash, no gank\" stuff comes up is when you don't say a damn thing, the jungler thinks you're going to give him a leash, and you just ignore him.","replies":[{"poster":"jaymc1130","date":"2016-10-05T10:51:47.409+0000","up_votes":2,"down_votes":13,"body":"> [{quoted}](name=Randomonium,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=000700010001,timestamp=2016-10-05T10:43:26.061+0000)\n>\n> You can provide a minor leash and still get to lane before the minion wave hits.  Spawn timers are specifically designed to allow for side laners to provide a leash and still get to lane by the time the minion waves collide.  Even if you get to the lane a couple seconds after your opponent it is still possible to outpush him and get level 2 first.  Furthermore, its also very easy to avoid level 2 or level 3 all ins if you play correctly.\n> \n> If you are trying to cheese or are extremely worried about your lane then you should be communicating that with your jungler so he knows to start on the opposite side.  Not communicating and then ignoring his pings at 1:30 is simply not acceptable.\n> \n> If you don&#x27;t leash for your jungler that really sets them behind as I described above and severely gimps his ability to provide early pressure relief.  That&#x27;s an extremely bad gameplan if you know you&#x27;re already going into a bad lane matchup.\n> \n> I&#x27;ve never seen a jungler tilt if his laner communicated with him.  The only time the whole &quot;no leash, no gank&quot; stuff comes up is when you don&#x27;t say a damn thing, the jungler thinks you&#x27;re going to give him a leash, and you just ignore him.\n\nI found another player who completely lacks the ability to understand the point of this post and who thinks its actually about leashing! LOOK GUYS! I FOUND ANOTHER ONE!!!! LOOOOOOOOOOOOOK!!!!!!!!!!\n\nLol. Man, you low elo board users barely have 1st grade reading comprehension. 99% of you went straight for the leashing angle when it has nothing to do with this thread at all really. Well the one thing we can say bout yall G&B folks is at least yall is consistent. Consistently foolish with 1st grade reading comprehension, but consistent none the less and that deserves some Kudos.","replies":[{"poster":"Randomonium","date":"2016-10-05T11:43:00.328+0000","up_votes":10,"down_votes":1,"body":"You sure do talk a big game.  Next time post on an account that actually has some credibility rather than an account that hasn't played a ranked game since season 4.  You say you're one of the best junglers in NA is some of your other posts.  Back it up with some evidence or its just talk, talk, talk.\n\nIf you don't leash for your jungler then you're flat out wrong.  If you don't communicate with your jungler then you are flat out wrong.  You're right, people shouldn't troll.  However, not ganking for an uncommunicative asshole is not trolling.  Like I said, jungling is all about resources.  If you act like a dick then I don't blame your jungler for devoting his time somewhere else.\n\nYou know how you can spot an immature child on the boards?  He responds to a perfectly logical post by:\n1) commenting on a person elo (especially when he's on a troll account that hasn't played any games recently)\n2) he insults someone's intelligence\n3) he doesn't provide any counterarguments to what the person says.  \n\nCongratulations, you met all 3 criteria.  Now crawl back into whatever hole you came from and leave the real discussions to the adults.","replies":[{"poster":"jaymc1130","date":"2016-10-05T11:47:31.658+0000","up_votes":1,"down_votes":11,"body":"> [{quoted}](name=Randomonium,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=00070001000100000000,timestamp=2016-10-05T11:43:00.328+0000)\n>\n> You sure do talk a big game.  Next time post on an account that actually has some credibility rather than an account that hasn&#x27;t played a ranked game since season 4.  You say you&#x27;re one of the best junglers in NA is some of your other posts.  Back it up with some evidence or its just talk, talk, talk.\n> \n\nLol! Another person who thinks all those streams I'm on, the screenshots, the other posters and board users IN THIS THREAD are just also bsing him. Lmao. New kids to da boards. Always da same. Never gets old laughing at how silly they are.\n\n> If you don&#x27;t leash for your jungler then you&#x27;re flat out wrong.  If you don&#x27;t communicate with your jungler then you are flat out wrong.  You&#x27;re right, people shouldn&#x27;t troll.  However, not ganking for an uncommunicative asshole is not trolling.  Like I said, jungling is all about resources.  If you act like a dick then I don&#x27;t blame your jungler for devoting his time somewhere else.\n> \n\nIts like you don't even read. Just spam letters on the keyboard to respond without even taking the time to digest the words you are responding to mentally. Lol.\n\n> You know how you can spot an immature child on the boards? \n\nYah, we just identified you mate. Lol.","replies":[{"poster":"Randomonium","date":"2016-10-05T14:02:24.007+0000","up_votes":8,"down_votes":3,"body":"Talk, talk, talk. Time to put up or shut up.\n\nSince you're \"on so many streams\" link a video where you do what you claim. Better yet, record a custom game using plays.TV, obs, or another program.\n\nYou claim the following things:\n1. You don't need a leash.\n2. You can clear 3 camps.\n3. You'll be full health and have high enough mana after 3 camps for a successful gank (1 normal camp and 2 buff camps, not some cheese camps like double scuttle.)\n4. You can execute this first gank by 3:30.\n\nThese are the top 10 played junglers at plat+ elo according to champion.gg:\n1. Lee Sin\n2. Kha'zix\n3. Graves\n4. Zac\n5. Vi\n6. Elise\n7. Nidalee\n8. Amumu\n9. Hecarim\n10. Evelynn\n\nPick any 5 you want and upload your jungle clear showing you can do what you say you do. At 3:30 seconds per champion it'll take you less than 30 minutes to do all 5. If you're right then I'll admit it and gift you a skin to pay you for your time.\n\nIf you don't accept the challenge or you can't back up your claims then you're just a liar and a boards troll.\n\nTalk is cheap. Back up your claims with action. I personally think you're full of BS. I watch the best junglers in the world and all of them ask for leashes and none of them are full health after 3 camps (especially if they don't get a leash.) So either you're a better jungler than the guys at worlds or you're completely full of it.","replies":[{"poster":"jaymc1130","date":"2016-10-05T14:13:12.480+0000","up_votes":2,"down_votes":6,"body":"> [{quoted}](name=Randomonium,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=0007000100010000000000000000,timestamp=2016-10-05T14:02:24.007+0000)\n>\n> Talk, talk, talk. Time to put up or shut up.\n> \n> Since you&#x27;re &quot;on so many streams&quot; link a video where you do what you claim. Better yet, record a custom game using plays.TV, obs, or another program.\n> \n> You claim the following things:\n> 1. You don&#x27;t need a leash.\n> 2. You can clear 3 camps.\n> 3. You&#x27;ll be full health and have high enough mana after 3 camps for a successful gank (1 normal camp and 2 buff camps, not some cheese camps like double scuttle.)\n> 4. You can execute this first gank by 3:30.\n> \n> These are the top 10 played junglers at plat+ elo according to champion.gg:\n> 1. Lee Sin\n> 2. Kha&#x27;zix\n> 3. Graves\n> 4. Zac\n> 5. Vi\n> 6. Elise\n> 7. Nidalee\n> 8. Amumu\n> 9. Hecarim\n> 10. Evelynn\n> \n> Pick any 5 you want and upload your jungle clear showing you can do what you say you do. At 3:30 seconds per champion it&#x27;ll take you less than 30 minutes to do all 5. If you&#x27;re right then I&#x27;ll admit it and gift you a skin to pay you for your time.\n> \n> If you don&#x27;t accept the challenge or you can&#x27;t back up your claims then you&#x27;re just a liar and a boards troll.\n> \n> Talk is cheap. Back up your claims with action. I personally think you&#x27;re full of BS. I watch the best junglers in the world and all of them ask for leashes and none of them are full health after 3 camps (especially if they don&#x27;t get a leash.) So either you&#x27;re a better jungler than the guys at worlds or you&#x27;re completely full of it.\n\n...\n\n......\n\n..............\n\nDid you really give me a list of top junglers...\n\nTell you what. I'll upload a video of me doing it on just one champ. Just one. Raka. Thats it. Pffffft. Asks me to do all these champs that easily do this every single day in pro play like its a fuckin mystery they can do this.... If you give some one a fucking ultimatum challenge then make it a fuckin CHALLENGE. Not a cake walk. Sheez. Some people. Just clueless.","replies":[{"poster":"Randomonium","date":"2016-10-05T14:54:31.398+0000","up_votes":3,"down_votes":0,"body":"I eagerly await your video. And I don't want to see some bs where you finish the 3rd camp with less than 80% health and no mana.\n\nI know for a fact that what you claim isn't possible on some of the junglers I listed because I watch the pros jungle regularly. For example, Zac gets very low in the jungle even with a leash and most pros don't recommend you gank with him until level 4 when you have a second point in his E.","replies":[{"poster":"nm1010","date":"2016-10-05T15:09:07.693+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Randomonium,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=000700010001000000000000000000000000,timestamp=2016-10-05T14:54:31.398+0000)\n>\n> I eagerly await your video. And I don&#x27;t want to see some bs where you finish the 3rd camp with less than 80% health and no mana.\n> \n> I know for a fact that what you claim isn&#x27;t possible on some of the junglers I listed because I watch the pros jungle regularly. For example, Zac gets very low in the jungle even with a leash and most pros don&#x27;t recommend you gank with him until level 4 when you have a second point in his E.\n\nReally, Zac? LOL, I'll get you that video with ease. I'll add the link to this post of me clearing fully with no leash and no problems without even trying.\n\nhttps://www.youtube.com/watch?v=wFbp56t-7QA","replies":[{"poster":"Randomonium","date":"2016-10-05T15:14:18.038+0000","up_votes":4,"down_votes":1,"body":"It's not the issue of clearing, it the issue of clearing while staying at full health like the OP claims. With good kiting you can negate a lot of the damage jungle monsters deal, especially if you are playing a ranged champ, but you're not going to ever leave the jungle full health with no leash.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"LGBTCute","date":"2016-10-04T23:49:01.249+0000","up_votes":16,"down_votes":2,"body":"K I won't utter that phrase.  But I will still think it, and it will still be the truth.\n\nIf you're not leashing or at least offering a leash to your jg, then you are telling them you lack basic game knowledge.  A decent jg knows it's better to help good players then bad ones.  Bad players waste an advantage, good players will use it to win.\n\nYou're also displaying a selfish attitude, which tells your jg and entire team that you're not going to be considering them in teamfights and skirmishes.  If you aren't considering your jungler's needs, you're probably not going to think about helping them during a gank.  So ganking for someone who doesn't care about their team is risky to say the least.\n\nNot to mention, refusing to leash can put some junglers behind in HP, mana, clear time, and make it harder for them to gank.\n\nBottom line is if you don't leash, you're telling your team that you need to be carried.\n\nOP must be new to this game, probably still below level 30.","replies":[{"poster":"jaymc1130","date":"2016-10-04T23:56:09.930+0000","up_votes":2,"down_votes":12,"body":"> [{quoted}](name=Khurby,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=0003,timestamp=2016-10-04T23:49:01.249+0000)\n>\n> K I won't utter that phrase.  But I will still think it, and it will still be the truth.\n> \n> If you're not leashing or at least offering a leash to your jg, then you are telling them you lack basic game knowledge.  A decent jg knows it's better to help good players then bad ones.  Bad players waste an advantage, good players will use it to win.\n> \n\nThe worst players, in my 6 years of playing, have historically been junglers. They are flat out incompetent. Which is why I now play mostly jg. A bad jg is one that can't manage to gank a lane at 3:30 without a leash. Period. You should always, 100% of the time, be able to do this regardless of leash status.\n\n> Not to mention, refusing to leash can put some junglers behind in HP, mana, clear time, and make it harder for them to gank.\n> \n\nNo, complete bs. There isn't a single champion that I cannot play without a leash and still not make it to first ganks at 3:30 with full hp. Not a single champ. Every single champ can do this. There is no excuse.\n\n> Bottom line is if you don't leash, you're telling your team that you need to be carried.\n\nNo, a jungler saying he needs a leash is telling his team he needs to be carried. And he's the one in the most important role in the game.","replies":[{"poster":"LGBTCute","date":"2016-10-05T00:10:29.967+0000","up_votes":8,"down_votes":0,"body":"This is a troll post, it HAS to be.\n\nI've never seen anyone argue against leashing their jungler.  What's the benefit of not leashing?  None.\n\nYou are either:\n\n1)  Completely new to this game.\n\n2)  An idiot.\n\n3)  A troll.\n\nThere is no one in the history of LoL who doesn't leash for their jungler, unless they were one of those three things.","replies":[{"poster":"jaymc1130","date":"2016-10-05T00:25:52.617+0000","up_votes":1,"down_votes":8,"body":"> [{quoted}](name=Khurby,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=000300000000,timestamp=2016-10-05T00:10:29.967+0000)\n>\n> This is a troll post, it HAS to be.\n> \n> I've never seen anyone argue against leashing their jungler.  What's the benefit of not leashing?  None.\n> \n\nLOL. Yeah, you are low elo.\n\nHere's the advantage. I start enemy top side buff. My bot lane now gets krugs or gromp, they get level 2 advantage in bot lane. The enemy team also has no idea where I started my jungling, so my pathing is a complete mystery which opens various opportunities.\n\nThe benefit is huge for not leashing. Its game changing. It completely warps bot lane.\n\n> You are either:\n> \n> 1)  Completely new to this game.\n> \n\nOnly played for 6 seasons now.\n\n> 2)  An idiot.\n> \n\nThis might be true. But what does it say if I'm right and I'm the idiot? What does that make all yall?\n\nHmmmm....\n\n> 3)  A troll.\n> \n\nJust one the bests junglers on the entire NA server, but yeah, I'm trolling. Lol. Just about the only junglers better than me on this entire server are all professional players.\n\n> There is no one in the history of LoL who doesn't leash for their jungler, unless they were one of those three things.\n\nOr your just a low elo dufus with zero sense for how to jungle. I rather think this is obviously the correct answer here.","replies":[{"poster":"LGBTCute","date":"2016-10-05T00:30:35.485+0000","up_votes":8,"down_votes":1,"body":"One of the best NA junglers stuck in Silver 4.\n\nWhat a shame.\n\nYou must be pretty lonely if this is how you fill your time.","replies":[]}]}]}]}]},{"poster":"The Yetii Rider","date":"2016-10-05T00:33:41.734+0000","up_votes":7,"down_votes":0,"body":"\"first of all, if you can't solo clear half a jg quadrant without any assistance then you have zero clue how to properly manage the camp aggro and micro your way around so you take the least dmg possible\"\n\nUh, yeah. Plenty of people don't have this skill. That's why they get leashed.\n\nNot even 10% of the playerbase is Plat or higher. Saying \"git gud or don't jungle\" isn't realistic.","replies":[{"poster":"jaymc1130","date":"2016-10-05T00:36:38.694+0000","up_votes":1,"down_votes":8,"body":"> [{quoted}](name=The Yetii Rider,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=000a,timestamp=2016-10-05T00:33:41.734+0000)\n>\n> \"first of all, if you can't solo clear half a jg quadrant without any assistance then you have zero clue how to properly manage the camp aggro and micro your way around so you take the least dmg possible\"\n> \n> Uh, yeah. Plenty of people don't have this skill. That's why they get leashed.\n> \n> Not even 10% of the playerbase is Plat or higher. Saying \"git gud or don't jungle\" isn't realistic.\n\nUnderstanding basic fundamental elements of jungling like how to manage camp aggro and properly path while also properly prioritizing is just basic stuff. Any player at any level of play can learn to do these things. Refusing to do them is just straight up trolling or blatant apathy, neither of which has any place in this game.","replies":[{"poster":"The Yetii Rider","date":"2016-10-05T00:39:21.551+0000","up_votes":7,"down_votes":0,"body":"Apathy has no place in this game?\n\nIt's a video game. We play it to relax and relieve stress. Don't you know how games work?","replies":[{"poster":"jaymc1130","date":"2016-10-05T00:42:12.150+0000","up_votes":1,"down_votes":6,"body":"> [{quoted}](name=The Yetii Rider,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=000a00000000,timestamp=2016-10-05T00:39:21.551+0000)\n>\n> Apathy has no place in this game?\n> \n> It's a video game. We play it to relax and relieve stress. Don't you know how games work?\n\nDo you have any idea how competitive team sports work?\n\nLike... at all?\n\nOne member of the team pulls an Odel Beckham Jr and the whole team goes to shit. This ruins everyone's time. Don't be an Odel Beckham Jr type of teammate, don't be selfish, don't be lazy, when you play a competitive game where the point is the competition itself, then please, compete. Don't be an ass hat who refuses to do so just because you didn't like the way that other dude on the team looked at you funny.","replies":[{"poster":"The Yetii Rider","date":"2016-10-05T00:45:09.834+0000","up_votes":6,"down_votes":0,"body":"This isn't a competitive team sport. Competitive team sports involve a dedicated working relationship with your team mates. We are five people who queue up and ignore each other for forty minutes before doing it again.\n\nYou're comparing apples to oranges here.","replies":[]},{"poster":"L Psy Kongroo","date":"2016-10-05T00:46:21.306+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=jaymc1130,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=000a000000000000,timestamp=2016-10-05T00:42:12.150+0000)\n>\n> Do you have any idea how competitive team sports work?\n> \n> Like... at all?\n> \n> One member of the team pulls an Odel Beckham Jr and the whole team goes to shit. This ruins everyone&#x27;s time. Don&#x27;t be an Odel Beckham Jr type of teammate, don&#x27;t be selfish, don&#x27;t be lazy, when you play a competitive game where the point is the competition itself, then please, compete. Don&#x27;t be an ass hat who refuses to do so just because you didn&#x27;t like the way that other dude on the team looked at you funny.\n\nUnless you're an LCS player or full-time streamer, League is nothing more than a game. Anyone else only plays it recreationally. Just because there's a ranking ladder doesn't make it competitive.","replies":[]}]}]}]}]},{"poster":"Truly not Gay","date":"2016-10-05T01:51:04.065+0000","up_votes":6,"down_votes":0,"body":"I think you phrased this post extremely poorly.  Your main concept of there being no place for a jungler to ever say \"no leash, no gank\" is good.  However, the rest of the post basically calling anyone who can't jungle without a leash total garbage who shouldn't be playing jungle.  A person has to learn jungling somehow and there are only a select few champions who can easily jungle without a leash.  Most of the other ones you either have to be experienced with both the champion and the jungle roll or you need a leash to not fall behind.  While it is possible to solo the jungle with anyone, is it really a good thing to do?  If you solo on a champ who struggles early and get invaded you are 100% screwed.\n\nIf I am jungling and don't get a leash then don't expect a gank in the early game.  This isn't because I'm toxic or a trash player, it is because a gank from me with the champions I typically play will most likely result in me being too low on mana/hp or being 2 levels behind.  The only way a gank like that ever works is if the enemy is just asking to be ganked by pushing to the tower without a ward while being low on heath or mana.","replies":[{"poster":"jaymc1130","date":"2016-10-05T04:54:11.610+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Truly not Gay,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=000f,timestamp=2016-10-05T01:51:04.065+0000)\n>\n> I think you phrased this post extremely poorly.  Your main concept of there being no place for a jungler to ever say &quot;no leash, no gank&quot; is good.\n\nI'm aware\n\n>  However, the rest of the post basically calling anyone who can&#x27;t jungle without a leash total garbage who shouldn&#x27;t be playing jungle.\n\nI'm aware\n\n> A person has to learn jungling somehow and there are only a select few champions who can easily jungle without a leash.  Most of the other ones you either have to be experienced with both the champion and the jungle roll or you need a leash to not fall behind.  While it is possible to solo the jungle with anyone, is it really a good thing to do?  If you solo on a champ who struggles early and get invaded you are 100% screwed.\n> \n> If I am jungling and don&#x27;t get a leash then don&#x27;t expect a gank in the early game.  This isn&#x27;t because I&#x27;m toxic or a trash player, it is because a gank from me with the champions I typically play will most likely result in me being too low on mana/hp or being 2 levels behind.  The only way a gank like that ever works is if the enemy is just asking to be ganked by pushing to the tower without a ward while being low on heath or mana.\n\nSo, basically, what you seem to be saying here, is in the event that the enemy laner has pushed to the tower, is at less than half hp, closer to 1/3, and your jg, whom you did not leash for, who is still on that half of the map and in fact in the river taking the crab, and who is at full health, has no business saying \"no leash no gank\".\n\nThat would be correct sir. That should not ever have happened. That jungler is an ass hat and should be perma'd for deliberately trolling the team into a loss because he'd rather be a salty toxic ass hat than a real player.","replies":[{"poster":"Tentacle Advisor","date":"2016-10-05T12:55:03.205+0000","up_votes":2,"down_votes":0,"body":"I believe what \"Truly Not Gay\" was trying to say to you, before you got all butthurt and attacked while trying to defend your opinion, is that though a lot of champions have the CAPABILITY to clear a whole couple of camps alone, with minimal to no team participation required, it is still COMMON FLIPPIN' COURTESY to take 3 damn seconds of your time to help that champion clear the jungle FASTER. What they were pointing out had NOTHING to do with their individual mastery of their champion. What they were pointing out is that a leash is like a \"you scratch my back, I scratch yours\" kind of deal. It's common sense to anyone who plays the game beyond a Co-Op vs AI level. (And even then, they learn to understand this.)\n\nIf you don't have the common courtesy to give up 3 flippin' seconds of your time to leash the jungler's first camp, then why would you expect them to use any more of THEIR time to help you, specifically. A jungler sayin' \"no leash, no gank\" does not immediately mean they are trolling you. Nor is it immediately saying they want to lose the game. It is them tellin' you \"since you couldn't help me with a simple task, how can I expect you to be cooperative with ganks?\"\n\nIn situations where someone doesn't leash for a jungler, that jungler will usually go to snowball a lane OTHER THAN the laner who refused to leash. Does that mean he wants you to lose? No. Does that mean he thinks ignoring you would help you win? No. It means that they don't feel they can trust you. If giving up 3 seconds of your time is too much of a hassle for you, how could one possibly trust that you won't leave them hanging in ganks? How could one possibly trust you to help with dragon control? They can't.\n\nI don't care what champion my junglers are playing, nor do I care about how well they can clear the jungle alone. If you are starting your jungle route on my side of the map, assuming I'm either one of the bot laners or the top laners, I'm giving you a leash. UNLESS YOU ARE SHACO. That is literally the ONLY time I will not leash for you because your boxes will do that in my place. Why? Because it's common flippin' courtesy to do so and 3 seconds of my time WILL NOT COST ME A DAMN THING.","replies":[{"poster":"jaymc1130","date":"2016-10-05T13:06:53.708+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=SongsOfTheSea,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=000f00000000,timestamp=2016-10-05T12:55:03.205+0000)\n>\n> I believe what &quot;Truly Not Gay&quot; was trying to say to you, before you got all butthurt and attacked while trying to defend your opinion, is that though a lot of champions have the CAPABILITY to clear a whole couple of camps alone, with minimal to no team participation required, it is still COMMON FLIPPIN&#x27; COURTESY to take 3 damn seconds of your time to help that champion clear the jungle FASTER. What they were pointing out had NOTHING to do with their individual mastery of their champion. What they were pointing out is that a leash is like a &quot;you scratch my back, I scratch yours&quot; kind of deal. It&#x27;s common sense to anyone who plays the game beyond a Co-Op vs AI level. (And even then, they learn to understand this.)\n> \n> If you don&#x27;t have the common courtesy to give up 3 flippin&#x27; seconds of your time to leash the jungler&#x27;s first camp, then why would you expect them to use any more of THEIR time to help you, specifically. A jungler sayin&#x27; &quot;no leash, no gank&quot; does not immediately mean they are trolling you. Nor is it immediately saying they want to lose the game. It is them tellin&#x27; you &quot;since you couldn&#x27;t help me with a simple task, how can I expect you to be cooperative with ganks?&quot;\n> \n> In situations where someone doesn&#x27;t leash for a jungler, that jungler will usually go to snowball a lane OTHER THAN the laner who refused to leash. Does that mean he wants you to lose? No. Does that mean he thinks ignoring you would help you win? No. It means that they don&#x27;t feel they can trust you. If giving up 3 seconds of your time is too much of a hassle for you, how could one possibly trust that you won&#x27;t leave them hanging in ganks? How could one possibly trust you to help with dragon control? They can&#x27;t.\n> \n> I don&#x27;t care what champion my junglers are playing, nor do I care about how well they can clear the jungle alone. If you are starting your jungle route on my side of the map, assuming I&#x27;m either one of the bot laners or the top laners, I&#x27;m giving you a leash. UNLESS YOU ARE SHACO. That is literally the ONLY time I will not leash for you because your boxes will do that in my place. Why? Because it&#x27;s common flippin&#x27; courtesy to do so and 3 seconds of my time WILL NOT COST ME A DAMN THING.\n\nBottom line, (since you along with everyone else seems incapable of actually reading anything in this thread aside from the title) is that if you wander on down with your premade group to your bot side jungle and dick around in the enemy jungle until the 1:15 mark when minions spawn and then RANDOMLY decide to walk ALL the way over to top lane krugs AFTER they spawn all while saying not ONE damn thing in chat the entire time I have no idea you need, or even want, a leash.\n\nIts in the second fuckin paragraph of the op. There was no communication from this toxic preamde... They didn't inform me of their idiotic plans and what they needed. Then he randomly decides to walk ALL The way from bot lane on up to krugs for god only knows what idiotic reason and only made it there as the camps were spawning. Thats not in any way, shape, or form, MY fault for not knowing he wanted a leash. He just did 15 stupid and completely random things in the first 1 minute of the match. All without communicating one word. The VERY first things said in chat were \"no leash, I'm not ganking you fuck\" when I pinged for assist once after he got done stealing enemy blue and was coming to get the scuttle where I assumed his natural path would be to top lane next, the lane I had prepped for first blood taking all of Riven's pots and over half her hp while letting her push to my tower while his idiot premades in both mid and bot lane pushed ALL the way to the enemy towers.\n\nIf your top laner sacrifices half his farm in the first 3 waves to prep Riven for a level 3 gank and lets her push him to his tower and then doesn't GET the gank when shes exposed and the champions entire weakness lies in exposing her to an early gank and you refuse to go to the only lane you CAN gank and do the basic fundamental things, yes, you are fuckin trolling. Period.\n\nJesus you people are seriously dense. And NONE of you even read the op.","replies":[{"poster":"Tentacle Advisor","date":"2016-10-05T13:29:46.023+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=jaymc1130,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=000f000000000000,timestamp=2016-10-05T13:06:53.708+0000)\n> Bottom line, is that if you wander on down with your premade group to your bot side jungle and dick around in the enemy jungle until the 1:15 mark when minions spawn and then RANDOMLY decide to walk ALL the way over to top lane krugs AFTER they spawn all while saying not ONE damn thing in chat the entire time I have no idea you need, or even want, a leash.\nIts in the second fuckin paragraph of the op. \n\nUm..............No it isn't. You mentioned nothing about a premade in the original post. Nowhere in the original post did you mention anything about a premade. You didn't go into any real detail of anything that happened in game. All you basically put was \"no communication. jungler chose not to help. jungler is troll. don't play jungle if you troll like this.\"\n\n\n>There was no communication from this toxic preamde... They didn&#x27;t inform me of their idiotic plans and what they needed. Then he randomly decides to walk ALL The way from bot lane on up to krugs for god only knows what idiotic reason and only made it there as the camps were spawning. Thats not in any way, shape, or form, MY fault for not knowing he wanted a leash. He just did 15 stupid and completely random things in the first 1 minute of the match. All without communicating one word.\n\nThis would make anybody as suspicious as you, sure. I'll agree, this isn't your fault. Would have been nice had you actually inserted this tidbit of information in the original post. You know, where you said it was.\n\n>The VERY first things said in chat were &quot;no leash, I&#x27;m not ganking you fuck&quot; when I pinged for assist once after he got done stealing enemy blue and was coming to get the scuttle where I assumed his natural path would be to top lane next, the lane I had prepped for first blood taking all of Riven&#x27;s pots and over half her hp while letting her push to my tower while his idiot premades in both mid and bot lane pushed ALL the way to the enemy towers.\n\nYou actually TRUSTED that jungler after those ridiculous movements they made around the jungle, the first couple minutes (hell, seconds) of the game?\n\n> If your top laner sacrifices half his farm in the first 3 waves to prep Riven for a level 3 gank and lets her push him to his tower and then doesn&#x27;t GET the gank when shes exposed and the champions entire weakness lies in exposing her to an early gank and you refuse to go to the only lane you CAN gank and do the basic fundamental things, yes, you are fuckin trolling. Period.\n\nGiven what you mentioned about this jungler and their ridiculous movements around the jungle, at an earlier point within the game, this could be placed on you for trusting them to understand or even care to delete the exposed Riven early on. Is the blame totally on you? Of course not. Your jungler had a perfect opportunity to catch Riven out. However, you already mentioned that they were making many random movements throughout the game earlier on, so how could you trust them to take advantage of Riven?\n\n> Jesus you people are seriously dense. And NONE of you even read the op.\n\nYOU NEVER PUT ANY OF THESE DETAILS IN THE OP! MAYBE YOU SHOULD READ IT.","replies":[{"poster":"jaymc1130","date":"2016-10-05T13:39:43.653+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=SongsOfTheSea,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=000f0000000000000000,timestamp=2016-10-05T13:29:46.023+0000)\n>\n> Um..............No it isn&#x27;t.\n> \n\n\"Secondly, if you refuse to play the game properly after that and avoid a lane just because it didn't leash you when you fail to communicate effectively what you would like your opening 4 minutes to go like as the jg you should be perma'd on the spot for trolling. Period.\"\n\nI made it pretty clear, right there in the op, that the complete lack of communication regarding our opening strategy from the premade was not enjoyable. Utter silence. Not one thing said. At all.\n\nWhich is another thing in itself, but premades are the worst experience I EVER have playing this game. Practically 100% of the time this is what they do and how they act. Its unbearable to ever play with them as a solo.","replies":[{"poster":"Tentacle Advisor","date":"2016-10-05T13:54:18.306+0000","up_votes":2,"down_votes":0,"body":"There is literally nothing about a premade group in the original post. The only thing there is the mentioning of the lack of communication. Which is understandable, in your case, for the most part. I'm not saying that you are wrong for reacting the way you did to that jungle, in terms of how they acted at the beginning of the game, prior to the camps spawning. I'd be just as confused as you, had I been in a similar situation. Especially if I was the laner who was meant to leash for them (and ESPECIALLY if it wasn't even known that I was supposed to be the leasher to begin with).\n\nHowever, saying that the player should get permabanned for that is going pretty overboard. A warning or a possible few day suspension period (or whatever they call it) would be enough, unless the behavior continues.\n\nBut, again, mentioning the premade in the original post, like actually mentioning them directly, would have changed how I responded to this post. It still would have been a negative response, but it would have been less targeting as it is now clear that you were the victim of a ridiculous troll.\n\nHowever, what I cannot vouch for is the idea that nearly 100% of premades are toxic and/or trolls. I've been paired with and against 2-man, even 3-man premades and none were toxic at all. There was one 4-man premade I got paired up with in a normal game who wanted to troll, but they gave me fair warning in champ select that they would. So you know what I did, I joined them. It was a normals game and I felt better joining them in the troll than fighting them about it only to run to the boards to complain about it afterward. I don't play many ranked games so this scenario may play out differently for those that do, but premades, in my opinion, are only assholes when you treat them like they are, prior to even trying to communicate with them during champ select. If they don't speak in champ select, there is always the option to dodge. Better to lose a little bit of lp for dodging than have to wait through 20+ minutes of a game only to lose more, as well as, get tilted.","replies":[]}]}]}]}]}]}]},{"poster":"PhDs Nuts","date":"2016-10-05T00:43:12.412+0000","up_votes":5,"down_votes":0,"body":"I hope you get ganked at level 3 and your jungler is stuck going b to heal  instead of countering while it happens.","replies":[{"poster":"TequilaZombie","date":"2016-10-05T15:26:20.238+0000","up_votes":1,"down_votes":0,"body":"I hope he gets taxed into oblivion.\n\nOhh, look at that sexy cannon minion! Wait, what is that?\n\n{{summoner:11}}","replies":[{"poster":"jaymc1130","date":"2016-10-05T15:32:51.461+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TequilaZombie,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=000c0000,timestamp=2016-10-05T15:26:20.238+0000)\n>\n> I hope he gets taxed into oblivion.\n> \n> Ohh, look at that sexy cannon minion! Wait, what is that?\n> \n> {{summoner:11}}\n\nSo your response trolling... is to encourage more and harder trolling from your team?\n\nNo wonder you are whatever shabby rank you are mate. Ain't that much of a mystery when that's your priority...","replies":[{"poster":"TequilaZombie","date":"2016-10-05T16:35:30.363+0000","up_votes":1,"down_votes":0,"body":"My response to being a dickhead is being a dickhead to the original dickhead.\n\nAnd technically, I have to make up for being behind on farm somehow. After all, I got no leash.\n\n>No wonder you are whatever shabby rank you are mate. Ain't that much of a mystery when that's your priority...\n\nNah, I'm just finally getting into ranked and playing a bit more seriously instead of playing troll builds in normals. Gotta climb sometime.\n\nBut hey, nice trolling. You got plenty of people's panties in a bunch. 8/10","replies":[{"poster":"The Sword Saint","date":"2016-10-05T16:52:03.547+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=TequilaZombie,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=000c000000000000,timestamp=2016-10-05T16:35:30.363+0000)\n>\n> My response to being a dickhead is being a dickhead to the original dickhead.\n> \n> And technically, I have to make up for being behind on farm somehow. After all, I got no leash.\n> \n> Nah, I&#x27;m just finally getting into ranked and playing a bit more seriously instead of playing troll builds in normals. Gotta climb sometime.\n> \n> But hey, nice trolling. You got plenty of people&#x27;s panties in a bunch. 8/10\n\nThis whole thread was a test, and one that happens semi regularly here, and most people failed. You passed if you were able to either A) zoom in on the most actual topic in the op  (which was 'players who decide to screw over their teammates for a perceived slight are in the wrong') or B) take note of a high elo player sharing jungling tips and strategies and take the chance to learn from them and discuss them. You failed if you C) got stuck on the least important part of the op (leashing) or D) couldn't deal with getting condescended to by a diamond player and spent the whole time trying to claim he's a phony (despite mountains of available evidence and testimonials) instead of trying to understand what exactly the useful information in his posts is.\n\nMost people failed. Hopefully next year or so when he does this same thread again some of the people here will not fail that one too.","replies":[{"poster":"TequilaZombie","date":"2016-10-05T21:36:02.577+0000","up_votes":1,"down_votes":0,"body":"Well, I'm not sure how familiar are you guys with managing people, but there is a pretty popular theory that, in it's simplest form, states:\n\n\"If you act like an asshole, people will be much more likely to ignore what you have to say and focus on the negative aspects of it, no matter how right you are.\"\n\nIf there is some value on this threat (I particularly didn't found any because I didn't bothered to actually go through a shit load of BM to find what I can just look up on youtube), it was deemed to be ignored right from the beggining.\n\nI would particularly ignore it simply because fuck it, it's a hobby. It's not worth it to listen to an asshole to maybe get some useful information about something I do for fun. If it were about something with actual value for me (e.g. business management, sales, stock market), I'd gladly listen to any dickhead who knew their shit.\n\nBut that's the thing: you bring something that can be found elsewhere in a much better format, while making sure the reader is against you. People will always fail this test due to it's very nature.","replies":[{"poster":"jaymc1130","date":"2016-10-05T23:59:07.670+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=TequilaZombie,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=000c00000000000000000000,timestamp=2016-10-05T21:36:02.577+0000)\n>\n> Well, I&#x27;m not sure how familiar are you guys with managing people, but there is a pretty popular theory that, in it&#x27;s simplest form, states:\n> \n> &quot;If you act like an asshole, people will be much more likely to ignore what you have to say and focus on the negative aspects of it, no matter how right you are.&quot;\n> \n> If there is some value on this threat (I particularly didn&#x27;t found any because I didn&#x27;t bothered to actually go through a shit load of BM to find what I can just look up on youtube), it was deemed to be ignored right from the beggining.\n> \n> I would particularly ignore it simply because fuck it, it&#x27;s a hobby. It&#x27;s not worth it to listen to an asshole to maybe get some useful information about something I do for fun. If it were about something with actual value for me (e.g. business management, sales, stock market), I&#x27;d gladly listen to any dickhead who knew their shit.\n> \n> But that&#x27;s the thing: you bring something that can be found elsewhere in a much better format, while making sure the reader is against you. People will always fail this test due to it&#x27;s very nature.\n\nIt's not designed for the weak of mind and faint of heart. Only true heroes should pass it. Otherwise it would be worthless. You don't give the means to control destiny to everyone... you give it to those who prove they are WORTHY.\n\nYou sir, are not worthy. You've chosen... poorly.","replies":[{"poster":"TequilaZombie","date":"2016-10-06T09:10:26.727+0000","up_votes":2,"down_votes":0,"body":"I've chosen to not stress out about a hobby. You can call it whatever you want, but I'm gonna call it a pretty damn good choice.\n\nI have many more things to stress about.","replies":[]}]}]}]}]}]}]}]},{"poster":"Meep Man","date":"2016-10-05T13:55:11.913+0000","up_votes":4,"down_votes":0,"body":"I just say \"If you don't leash, don't expect me to be generous with your lane\"","replies":[]},{"poster":"Weathered","date":"2016-10-05T00:01:00.776+0000","up_votes":5,"down_votes":1,"body":"If you honestly think all junglers can do fine without a leash, you haven't played jungle nor have you played the game long enough. If you think clearing a quadrant and backing is jungling, I suggest coaching. If you decide you won't sit there for a few autos, which costs you nothing, then you obviously don't need my help if you don't help me. \n\nA Plat jungle main.","replies":[{"poster":"jaymc1130","date":"2016-10-05T00:22:14.278+0000","up_votes":1,"down_votes":9,"body":"> [{quoted}](name=SlayerTay6,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=0006,timestamp=2016-10-05T00:01:00.776+0000)\n>\n> If you honestly think all junglers can do fine without a leash, you haven't played jungle nor have you played the game long enough. If you think clearing a quadrant and backing is jungling, I suggest coaching. If you decide you won't sit there for a few autos, which costs you nothing, then you obviously don't need my help if you don't help me. \n> \n> A Plat jungle main.\n\nTrying to give advice and tips to a diamond player...\n\nRight...\n\nLol.\n\nIt's no wonder you're still in low elo and I've played in the top 1% for 4 straight seasons now.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-10-05T00:32:09.874+0000","up_votes":4,"down_votes":1,"body":"ok ill agree that it is toxic and creates a toxic environment for the game by saying if you dont leash i dont gank... and its bs... but to say you shouldnt need a leash as a jungler and shouldnt jungle unless you can do it with out a leash is kinda counter productive... the purpose of the leash is to help your jungler get to a safer and quicker 1st clear so they can make an earlier impact on the game. there are some champs that are better about not having a leash but others do benefit greatly from it... now a leash isnt meant for the laner to help bring it down to 50% hp typically is two autos and move along but basically you need to stagger the autos so no one is hit by the jungle creep you are leashing... and with in those autos the laner gives the jungler should be helping at the same time... if a laner stays longer then that then they are put at disadvantage of experience , wave control and sometimes a lane can be decided in the  1st two waves of creeps.","replies":[{"poster":"jaymc1130","date":"2016-10-05T00:34:48.643+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=MrFawknSunshine ,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=000600000001,timestamp=2016-10-05T00:32:09.874+0000)\n>\n> ok ill agree that it is toxic and creates a toxic environment for the game by saying if you dont leash i dont gank... and its bs... but to say you shouldnt need a leash as a jungler and shouldnt jungle unless you can do it with out a leash is kinda counter productive... the purpose of the leash is to help your jungler get to a safer and quicker 1st clear so they can make an earlier impact on the game. there are some champs that are better about not having a leash but others do benefit greatly from it... now a leash isnt meant for the laner to help bring it down to 50% hp typically is two autos and move along but basically you need to stagger the autos so no one is hit by the jungle creep you are leashing... and with in those autos the laner gives the jungler should be helping at the same time... if a laner stays longer then that then they are put at disadvantage of experience , wave control and sometimes a lane can be decided in the  1st two waves of creeps.\n\nFINALLY one single person understands the entire point of this thread.\n\nIt has nothing to do with leashing.\n\nIt has everything to do with the toxic trolling attitudes of scrub players who haven't the faintest idea how to play what they are playing.\n\n\"No gank cuz no leash\" should be instant perma ban. Period. That kind of attitude has no business even being allowed to play the game at all. Ban that shit out, get these toxic ass hats who throw games minute 4 because they are mad they are bad out of my games.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-10-05T00:37:25.587+0000","up_votes":4,"down_votes":0,"body":"yea but you know me by now the retarded troll who is unranked scrub scared to play rank whos has no hope and is high and apparently now toxic and sexist \n\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"jaymc1130","date":"2016-10-05T00:40:24.976+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=MrFawknSunshine ,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=00060000000100000000,timestamp=2016-10-05T00:37:25.587+0000)\n>\n> yea but you know me by now the retarded troll who is unranked scrub scared to play rank whos has no hope and is high and apparently now toxic and sexist \n> \n> {{sticker:slayer-pantheon-thumbs}}\n\nWhat they added sexist? When did this happen... Typical Gameplay and Bronze board. So typical.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-10-05T00:41:20.335+0000","up_votes":2,"down_votes":0,"body":"however i must say this is rare side of you getting all raged over something... having a bad day bro?","replies":[{"poster":"jaymc1130","date":"2016-10-05T00:46:27.335+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=MrFawknSunshine ,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=0006000000010000000000000000,timestamp=2016-10-05T00:41:20.335+0000)\n>\n> however i must say this is rare side of you getting all raged over something... having a bad day bro?\n\nI had some idiot who said he wasn't coming top to gank when I was Fizz into a Riven because I didn't leash him. He didn't ping for one, didn't ask for one, and I only later found out he was in a premade with the others. Riven, naturally pushed all the way to my turret, I traded well and won both the initial trades but she had ignite, no tp, and was under half hp which was about as much as I had myself and I was just about oom with enough mana for one full rotation. Shes sitting AT my turret, lee finished his invade at the enemy blu and I pinged for an assist. He straight up said \"no leash, no gank fuk head\". 3 seconds later Riven dove me, ignited, flashed out with 4 hp remaining.\n\nRip game. Not even worth playing after that. I already had to sacrifice half of the first 3 waves to set up for that play, and then lee refused to even play the game right and decided it would be more fun to troll the solo player with his premade ass hat friends. So I said sure, I can troll too. And I sat at my tower and didn't move the rest of the match. You wanna troll? Fine. Lets end this game as fast as possible so I can report you and move on. I'm not moving a muscle.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-10-05T00:48:11.859+0000","up_votes":2,"down_votes":0,"body":"http://imgur.com/58vnfpz http://imgur.com/58vnfpz http://imgur.com/58vnfpz http://imgur.com/58vnfpz","replies":[]}]}]}]}]}]}]}]}]},{"poster":"specter424","date":"2016-10-04T23:38:25.490+0000","up_votes":4,"down_votes":0,"body":"a leash is a mutually beneficial thing\n\nit helps the jungler clear faster, less chance of dying to an invade and more hp after the clear.","replies":[{"poster":"jaymc1130","date":"2016-10-04T23:44:15.690+0000","up_votes":2,"down_votes":9,"body":"> [{quoted}](name=specter424,realm=NA,application-id=3ErqAdtq,discussion-id=2zef7p4Q,comment-id=0000,timestamp=2016-10-04T23:38:25.490+0000)\n>\n> a leash is a mutually beneficial thing\n> \n> it helps the jungler clear faster, less chance of dying to an invade and more hp after the clear.\n\nOh no doubt. There's no disqualifying this. If you want the most efficient routing through the jg you should get a leash. My problem isn't with leashing. I certainly don't ever need one or get one, but I'm a high diamond player who knows how to solo clear, get my doubles, and get first blood at 3:30 pretty much every game. Its sometimes a requirement if I get spotted out that I have one on the bottom half of the map so I can do my thing, but never, under ANY circumstances, is any reasonable, half way intelligent player, going to troll a game and refuse to do his job just because he didn't get a leash he didn't need in the first place.\n\nIf you can't figure out where to start based on the opposing matchup and you can't figure out if you will be invaded or anything like that, well. quite simply you have no business playing that role.\n\nRefusing to gank a lane thats being hard pushed thats way overexposed and is pretty much a sure kill just because you didn't get a leash from that lane is flat out trolling. Period. No ifs, ands, or buts about it.","replies":[{"poster":"Tentacle Advisor","date":"2016-10-04T23:53:40.461+0000","up_votes":1,"down_votes":0,"body":"\"but I'm a high diamond player who knows how to solo clear, get my doubles, and get first blood at 3:30 pretty much every game.\"\n\n\"but I'm a high diamond player who knows how to solo clear....\"\n\n\"but **I'm a high diamond player**...\"\n\n\n\nI feel like this entire post of yours was just a way of telling people \"I am diamond player. If you aren't as good as I am, you shouldn't be playing the game.\"","replies":[]}]}]}]}