{"poster":"ztJackieChan","date":"2015-08-05T16:10:32.687+0000","title":"Motivi delle sconfitte, piccola analisi di coscienza","subforum":"Discussioni generali","up_votes":2,"down_votes":2,"body":"Vorrei provare a fare mente locale, ripensando alle mie ranked e ricordarmi tutti i motivi che hanno portato a perdere una partita.\r\nUna classifica delle ragioni principali in ordine di frequenza. Il primo che viene in mente &egrave; senz&#039;altro quello pi&ugrave; frequente.\r\n\r\n1) Il permajungler: ormai nutro un certo astio nei confronti di tutti i jungler perch&egrave; ho maturato questa lunga serie di delusioni da fiducia mal riposta. Dispiace fare di tutta l&#039;erba un fascio, ci sono dei jungler notevoli, veloci, aggressivi, ma il trauma da me subito da quei pochi disgraziati che dormono in giungla &egrave; senz&#039;altro il principale motivo delle mie sconfitte. Mi son capitati dei junglers che una volta distrutto l&#039;inibitor, avendo 30 secondi free-enemies, invece di prendere anche il nexus, se ne tornava in base a fare shopping o in giungla a prendersi un blue, cos&igrave;, tanto per vedersi il cdr schizzare da 40% a 50% (nella loro testina, ovviamente). Primo posto in classifica.\r\n\r\n2) Team full AD (o quasi): capita pi&ugrave; raramente, ma ogni tanto il team si dimentica di variare. Io gioco sempre AD mid (non &egrave; vero che non si ottiene la lane preferita, basta essere convincenti, e giocando in duo, col premade che mi aiuta nel pick order, io ottengo mid 8 volte su 10), e quando anche TOP e JUNGLE sono AD, il rischio di trovare 3 nemici full armor &egrave; reale. Non sempre succede, anzi, il pi&ugrave; delle volte il rischio &egrave; schivato, ma quando succede, la sconfitta &egrave; praticamente inevitabile. Secondo posto in classifica.\r\n\r\n3) Teammates feeder: capita di rado, e cmq ha un impatto abbastanza relativo, in quanto non &egrave; il team a cadere, ma solo una &quot;piccola&quot; parte. Nulla che non possa essere raddrizzato in fasi successive della partita da altri componenti pi&ugrave; in forma. Ma ogni tanto capita che l&#039;intero team perda pesantemente il confronto diretto in ogni ruolo. Terza posizione in classifica.\r\n\r\n4) AFK: vedere un giocatore in base dopo 1:00 minuto &egrave; qualcosa che preoccupa. Un giocatore in base a 1:45 ti allarma. A certi livelli, un giocatore AFK per i primi 5:00 minuti compromette gi&agrave; seriamente l&#039;esito della partita (c&#039;&egrave; sempre il fattore nemico, ma questo fattore c&#039;&egrave; in qualsiasi situazione). A me &egrave; capitato di giocarmela con un team 4v5 per 20 minuti, ovviamente senza riuscire a sfondare, e poi di vincere grazie a questo giocatore AFK per i primi 15 minuti, che era praticamente l&#039;ago della bilancia, da quanto i nemici facevano cacare. :D\r\nMa obiettivamente, partite con giocatori afk ne ho viste veramente poche. Quarta posizione in classifica.\r\n\r\n5) Smurfs: giocando in silver 5, capita di imbattersi ogni tanto in giocatori particolarmente veloci e abili, sopra la media. Non tanto un adc che riesce a prevalere sull&#039;altro e colleziona doppie kill ogni 4 minuti. Ma piuttosto dei junglers che scorazzano a velocit&agrave; esagerate e fanno devastazione in ogni punto della mappa. Bene o male, in lane, la vittima sacrificale, se ha un minimo di buon senso, pu&ograve; rintanarsi sotto la torre e contenere i danni. Ma se lo smurf &egrave; il jungler nemico, non ci sono molte contromosse da scegliere. Essendo anch&#039;io un&#039;ipocrita, spesso riesco a vincerle lo stesso, ma ogni tanto lo smurf nemico ha la meglio. Quinta posizione in classifica.\r\n\r\n6) Trolls: incontrati pochi. Quasi mai. A naso, su 100 ranked, forse 1 sola partita con troll, ma giusto per non escluderne l&#039;esistenza del tutto.\r\n\r\nQuesta &egrave; la mia esperienza in silver 5. In gold non era tanto diverso. In bronze, tuttavia, la componente team allo sbando (3) &egrave; forse probabilmente vincitrice a mani basse su tutte le altre motivazioni. Vedere partite con 10 junglers nelle partite dei bronze non &egrave; affatto raro. Tutti a rincorrersi in giungla come in pac-man. Uno spasso ! :D","replies":[{"poster":"Dantazzo","date":"2015-08-05T16:13:02.812+0000","up_votes":5,"down_votes":0,"body":"7) Ho giocato male. \n\nQuesto dovrebbe essere il punto più importante, poi ovviamente ci sono partite che giochi benissimo e perdi, come quelle dove giochi malissimo e vinci.","replies":[{"poster":"ztJackieChan","date":"2015-08-05T16:23:54.214+0000","up_votes":1,"down_votes":2,"body":"a parte che uno smurf gioca benissimo praticamente sempre, questi sono silver-bronze... è quasi come giocare in coop... non puoi giocare male in coop, no ?\n\ncmq è vero, ci sono state alcune partite in cui ero sovrappensiero, stavo mangiando, o ho fatto troppi errori in sequenza in early.\nPoi magari il team inizia pure a insultare, perchè i flamers ce ne sono in abbondanza.\nIeri, mi ero \"infastidito\" perchè l'adc andava sempre in giungla ed era stata appena killata, mentre prendeva il red. Criticai questa miss fortune, esortandola a pushare in lane, di evitare di perdere tempo in giungla, a prenderci il nexus (avevamo appena preso l'inibitor, minuto 20, forse).\n\npremesso che la partita era vinta, come quasi sempre, facendo il triplo dei danni del nemico, non c'è molto da discutere\nin una partita di ieri, se cerchi bene:\ndanni nemico tutti e 5: 38k\ndanni mio team senza wukong: 30k\ndanni wukong: 39k\n\ntornando alla partita:\nMiss Fortune: every smurfs know it's better fight in jungle\n\nquesta frase mi ha indotto a sabotare il match. Non lo faccio spesso, anzi, quasi mai, ma quando c'è palese maleducazione, io mi vendico. :D\nsono andato in permajungle col mio premade, e in 3v5 non c'è stato scampo, perso in 4 minuti.\n\nin che categoria rientra ? giocare male ? troll ?... non saprei :D","replies":[]}]},{"poster":"Frattaglia","date":"2015-08-05T23:12:15.243+0000","up_votes":4,"down_votes":0,"body":"Mi sa che parlare con sto ragazzo è tempo perso... il modo migliore per non salire è continuare a dare la colpa agli altri.","replies":[{"poster":"ztJackieChan","date":"2015-08-06T10:05:22.336+0000","up_votes":1,"down_votes":0,"body":"ma sai leggere ? :D\nanalizzo i motivi delle poche volte che perdo.\ntutti gli altri si lamentano di afk, troll e fantasmi vari.\nio analizzo le vere cause.","replies":[{"poster":"Frattaglia","date":"2015-08-06T12:11:16.641+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ztJackieChan,realm=EUW,application-id=MJVj50Jw,discussion-id=ooiAFoWB,comment-id=00070000,timestamp=2015-08-06T10:05:22.336+0000)\n>\n> ma sai leggere ? :D\n> analizzo i motivi delle poche volte che perdo.\n> tutti gli altri si lamentano di afk, troll e fantasmi vari.\n> io analizzo le vere cause.\n\nE tu invece sei perfetto, giusto?\nIo smurfavo una lega sotto la mia, e ti assicuro che se sei più bravo della gente con cui/contro cui giochi, le partite spesso le vinci anche avendo troll o giocando in 4v5.\nSmettiamo di scaricare le responsabilità sugli altri, pls.","replies":[{"poster":"ztJackieChan","date":"2015-08-06T12:13:36.634+0000","up_votes":1,"down_votes":0,"body":"Se tu giocassi le ranked con l'account del tuo amico bronze, non saresti perfetto anche tu ?\n\nVincere in 4v5 ? Assolutamente d'accordo. E infatti le vinco.\nVincere avendo i troll ? Il problema è che non ne trovo mai di troll, statisticamente.","replies":[{"poster":"Frattaglia","date":"2015-08-06T15:15:12.426+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ztJackieChan,realm=EUW,application-id=MJVj50Jw,discussion-id=ooiAFoWB,comment-id=0007000000000000,timestamp=2015-08-06T12:13:36.634+0000)\n>\n> Se tu giocassi le ranked con l'account del tuo amico bronze, non saresti perfetto anche tu ?\n> \n> Vincere in 4v5 ? Assolutamente d'accordo. E infatti le vinco.\n> Vincere avendo i troll ? Il problema è che non ne trovo mai di troll, statisticamente.\n\nNon sarei perfetta perché se fossi perfetta sarei challenger :P\n\nComunque capisco il fine del tuo post, cioè quello di spiegare che i famosi troll non sono questo grosso problema. Però quello che cercavo di farti notare è che è comunque sbagliato l'atteggiamento di spiegare le sconfitte dando sempre e solo la colpa agli altri.\nCapiamoci: ci sono partite non vincibili neanche dai challenger. Ma, statisticamente, sono veramente veramente poche. \nPer le altre sconfitte, è vero che può essere che la responsabilità di uno sia maggiore di quella di un altro, ma ciò non toglie che uno veramente forte le vince quasi tutte. \n\nNon ti sto flammando, cerco solo di farti notare che l'atteggiamento di \"perdo le partite solo per colpa degli altri\" è un atteggiamento sbagliato, specie se miri a salire. :)","replies":[{"poster":"ztJackieChan","date":"2015-08-06T18:12:42.092+0000","up_votes":1,"down_votes":0,"body":"dimentichi un piccolo particolare che non ho voluto sottolineare.\nio ho un account silver 5. Facendo vari duo, i nemici sono compresi tra silver e bronze, tutta gente che non sa nemmeno mettersi i pantaloni da soli. XD\n\nla mia percentuale di danno sul totale è spesso del 25%. (25% io, 45% il nemico, 30% gli altri 4 del mio team).\n\nma pure quando gioco di merda e infilo 5 errori iniziali, alla fine faccio cmq più danni di qualsiasi mio teammate.\n\nimmaginati xPeke che si diverte a smurfare in bronze. Vince 95% di partite. Ma quando mai in quel 5% di perse lui potrebbe avere qualche colpa ? Oltre a caricarsi sulle spalle 2-3 nemici ogni volta, non è sufficiente ? Il suo team ha fatto proprio pena e quella volta la sua colpa è di non aver sopperito ulteriormente alla niubbagine del team ? E' colpa sua che non si è caricato sulle spalle 4 nemici ? Suvvia.\n\nA volte è vero, alcune partite sono impossibili per alcuni sfortunati fattori.\nPer esempio, nel mio caso, quando STRAfeeda pure il mio premade. 4 giocatori letteralmente zero damage, o faccio penta o perdo la partita.\n\nIl mio atteggiamento in game è ottimo, credimi, non flammo mai. Sono dei silver, so già che giocano male, di cosa mi scandalizzo se feedano ? So già cosa mi aspetta e gioco in silver apposta per divertirmi in questo modo. :D\n\nIl mio post iniziale parla di motivi principale sulle sconfitte. Su 100 partite, 15 le perdo, e in queste 15, le principali ragioni sono queste. Questo fa sì che le partite con afk o troll, rasentano lo 0%.\n\nAnzi, vedo troppa gente fin troppo motivata che sclerano ad ogni storta. E che poi si accusano a vicenda di troll o feeding intenzionale.","replies":[{"poster":"twitchtv Vodky","date":"2015-08-06T19:59:41.071+0000","up_votes":1,"down_votes":0,"body":"Ne hai perse 10 su 19 (quelle visibili dal client). Te su 100 ne perdi minimo minimo 60 altro che 15 lel. Poi un ex gold 4 che finisce in silver 5 vuol dire che fa pena e niente più.","replies":[{"poster":"JRobich","date":"2015-08-07T11:39:31.781+0000","up_votes":1,"down_votes":0,"body":"No si chiama essere boostati in gold per prendere il bordino d'oro e la skin....","replies":[]},{"poster":"ztJackieChan","date":"2015-08-06T20:45:21.366+0000","up_votes":1,"down_votes":0,"body":"impegnati, ancora qualche ripasso e forse ci arrivi, non mollare. :D","replies":[{"poster":"twitchtv Vodky","date":"2015-08-06T22:08:23.812+0000","up_votes":1,"down_votes":0,"body":"Io almeno nella scorsa season ho scalato tutto il bronze classidicandomi silver 5. Te sei solo sceso e ora fai il saputello ma intanto con wukong non ne vinci manco mezza :). Per non parlare di questo post di lamentele inutile che spingono player frustrati a scrivere sul forum.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"IrrationalNumber","date":"2015-08-05T19:26:29.277+0000","up_votes":4,"down_votes":0,"body":"Dopo quasi 500 match sei silver V, sono abbastanza sicuro che il problema principale sei tu.\n\nGli smurfs, i trolls e gli afk comunque si trovano in qualsiasi elo, pure challenger (appena visto garen support con cleanse in uno stream).\n\nIl team full ad puo' essere un problema ma non e' impossibile vincere.\n\nPoi se ti va di dare la colpa al jungler, ho gia' capito il problema (e si ritorna all'inizio del messaggio).","replies":[{"poster":"ztJackieChan","date":"2015-08-06T10:55:40.863+0000","up_votes":1,"down_votes":0,"body":"ma cosa ti fa pensare che io abbia giocato 500 ranked per \"salire\" ?\ndal tono ti sembro uno disperato che non riesce a salire ? :D\n\nio faccio un'analisi di quelle \"poche\" volte che non riesco a vincere, mettendocela tutta o quasi.\nE viene fuori una realtà completamente diversa da come la stragrande maggioranza lo descrive.\nSempre afk, sempre trolls, sempre 4 feeders.\nNo, niente di tutto questo.\nSono fortunatissimo ? O sono solo l'unico che dice le cose come stanno con un pizzico di obiettività ?","replies":[{"poster":"IrrationalNumber","date":"2015-08-06T11:46:30.513+0000","up_votes":1,"down_votes":0,"body":"Ah si scusa, si giocano ranked per scendere.","replies":[{"poster":"ztJackieChan","date":"2015-08-06T12:01:35.878+0000","up_votes":1,"down_votes":0,"body":"di sicuro non si può scendere giocando le normal. :D","replies":[{"poster":"IrrationalNumber","date":"2015-08-06T12:29:46.460+0000","up_votes":1,"down_votes":0,"body":"i 500 match li hai in ranked eh.","replies":[{"poster":"ztJackieChan","date":"2015-08-06T12:46:19.438+0000","up_votes":1,"down_votes":1,"body":"sì sì, continua a guardare quel numerino. :D\n\nti racconto una storia:\n\npicko Malzahar mid. rune attack speed 41%, quindi 0 armor, 0 mres. maestrie azzerate.\nentro in game.\ncerco di non dare nell'occhio, guardo i raccomandati e scelgo il rod of ages {{item:3027}} .\ninizio con {{item:1028}} o con {{item:1027}} ? be', per essere oneshottati, è bene avere meno vita possibile, no ?\nscelgo {{item:1027}} .\n\ndopo 5 secondi, 3 membri del mio team mi chiamano TROLL.\n\nho pensato, azz, mi hanno sgamato, hanno guardato Lolnexus.\ncerco di fingere di non capire.\n\nio: Why you call me troll ?\n\nloro: You dont have {{item:1056}} .\n\nMINKIA CHE VOLPONI STI SILVER !! :D","replies":[{"poster":"Mala25","date":"2015-08-06T13:48:29.893+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=ztJackieChan,realm=EUW,application-id=MJVj50Jw,discussion-id=ooiAFoWB,comment-id=000600000000000000000000,timestamp=2015-08-06T12:46:19.438+0000)\n>\n> sì sì, continua a guardare quel numerino. :D\n> \n> ti racconto una storia:\n> \n> picko Malzahar mid. rune attack speed 41%, quindi 0 armor, 0 mres. maestrie azzerate.\n> entro in game.\n> cerco di non dare nell'occhio, guardo i raccomandati e scelgo il rod of ages {{item:3027}} .\n> inizio con {{item:1028}} o con {{item:1027}} ? be', per essere oneshottati, è bene avere meno vita possibile, no ?\n> scelgo {{item:1027}} .\n> \n> dopo 5 secondi, 3 membri del mio team mi chiamano TROLL.\n> \n> ho pensato, azz, mi hanno sgamato, hanno guardato Lolnexus.\n> cerco di fingere di non capire.\n> \n> io: Why you call me troll ?\n> \n> loro: You dont have {{item:1056}} .\n> \n> MINKIA CHE VOLPONI STI SILVER !! :D\n\nio per tanto tempo prendevo di proposito quell'item perchè così arrivavo prima al RoA. Poi ho scoperto che è meglio quello che ti consigliano loro D:","replies":[{"poster":"JRobich","date":"2015-08-06T14:31:33.316+0000","up_votes":3,"down_votes":0,"body":"direi che per iniziare il doran ring è un'attimo meglio.... e al primo recall ne poi prendere anche un altro...","replies":[]},{"poster":"twitchtv Vodky","date":"2015-08-06T22:09:07.570+0000","up_votes":1,"down_votes":0,"body":"500 non è un numerino. 2 è un numerino.","replies":[]}]}]},{"poster":"JRobich","date":"2015-08-06T14:34:10.101+0000","up_votes":1,"down_votes":0,"body":"lascia perdere è una guerra persa.... come diciamo a roma \"Quanno uno è de coccio è de coccio....\" oppure \"Se nasci rotondo nun poì morì quadrato...\"","replies":[]}]}]}]}]}]},{"poster":"Ste the ripper","date":"2015-08-06T10:09:45.784+0000","up_votes":3,"down_votes":0,"body":"Ovviamente ciò che dice tomato è sacrosanto ed è il vero motivo, ma ci aggiungo anche uno spunto secondario sulla tua lamentela riguardo al team full ad, giocare un mid ad attualmente è una pessima scelta, solo talon ( e varus) si salva, gli altri fanno schifo e costringe il team a determinati pick, non puoi poi lamentarti delle comp full ad se tu togli il principale ruolo ap","replies":[{"poster":"ztJackieChan","date":"2015-08-06T10:59:44.887+0000","up_votes":1,"down_votes":0,"body":"Il mio caso è leggermente diverso. Non stiamo tanto a discutere di me che in questa division faccio il bello e il cattivo tempo a piacimento.\nParlo di un'analisi oggettiva e imparziale dell'esito finale delle partite in sè.\n\nLe partite sono così \"difficili\" perchè è pieno di afk e trolls ?\nAssolutamente no.\nLa verità è che ne ho incontrati ben pochi.","replies":[]}]},{"poster":"CloudWidows","date":"2015-08-05T19:25:35.119+0000","up_votes":2,"down_votes":0,"body":"il pool di campioni da danni ap per la top/jungle è molto più ridotto di quelli che possono andare mid, sopratutto considerando che spesso sono tank.. dovresti essere tu quello a farsi da parte variegando il tipo di danno con l'adc, se poi ti interessano solo i champ da big plays allora è diverso\npoi più leggo tuoi post in questo topic più mi sembra rigiri tutto su se stesso, critichi persone per atteggiamenti che sei il primo ad avere","replies":[]},{"poster":"Menfrix","date":"2015-08-05T18:20:34.452+0000","up_votes":2,"down_votes":0,"body":"Son fenomenali i punti, riletti diversamente potrebbero essere la descrizione di un tuo probabile match xD\n\n8 volte su dieci prendi mid ad. Ti sarà capitato di essere Last Pick (punto due) e a causa del punto uno tu diventi un punto tre e da quel che scrivi alla fine ti comporti da punto sei.\n\nSembra una telenovela. :D","replies":[{"poster":"ztJackieChan","date":"2015-08-05T18:50:00.141+0000","up_votes":1,"down_votes":0,"body":"sì, una certa logica remota ci sta in questa situazione. :D\n\nè capitato così ? Sì, ma così raramente che non ne ricordo. Ma quasi sempre la soluzione pacifica la si trova, può sembrare strano, ma è vero. Io scrivo subito in chat, il tempo di leggere e ragionare ce l'hanno.\n\nIl Free win, ogni tanto viene accolto bene, qualche volta viene semplicemente deriso.\n\nPoi, se il team non mi lascia mid (raramente), e poi inizia pure da darmi del bugiardo (ancor più raramente), e questo è capitato varie volte, vai di punto 6. E questo è successo più di qualche volta. :D","replies":[]}]},{"poster":"kirchhoff","date":"2015-08-07T14:08:30.518+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ztJackieChan,realm=EUW,application-id=MJVj50Jw,discussion-id=ooiAFoWB,comment-id=,timestamp=2015-08-05T16:10:32.687+0000)\n\n> 1) Il permajungler\n\nAndare te giungla?\nNon capisco perchè devi dare colpa al jungler se perdi.\n\n> 2) Team full AD (o quasi): capita pi&ugrave; raramente, ma ogni tanto il team si dimentica di variare.\n\nLa frase sopra va in contaddizione con quella sotto\n\n>Io gioco sempre AD mid  \n\nquello che si dimentica di variare sei tu (non dirmi di no)\n\n>e quando anche TOP e JUNGLE sono AD, \n\nPerchè obbligare gli altri a cambiare e poi lamentarsi se non lo fanno? (Poi la meta è ap mid)\n\n>il rischio di trovare 3 nemici full armor &egrave reale\n\nAppunto, i tuoi avversari sono più furbi di te, le partite si vincono anche in selezione campioni.\n\n> 3) Teammates feeder\n\nNel tuo cervello sono feeder, invece nel loro stanno avendo una pessima partita.\n\n> 4) AFK\n> 5) Smurfs\n> 6) Trolls\n\nStatisticamente non rilevanti.","replies":[]},{"poster":"twitchtv Vodky","date":"2015-08-05T16:27:09.960+0000","up_votes":1,"down_votes":0,"body":"Se sei mid prenditi un fottuto mage. Non sei così forte da fare la differenza con un ad in mid o almeno il tuo elo basso non ti da team che ragionano come un gold alto e successivi.  Se ti prendi un talon un yasuo o un zed mid ti meriti la sconfitta e il tuo elo perché pensi solo a te stesso.","replies":[{"poster":"lucanomax1994","date":"2015-08-05T18:57:23.281+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"twitchtv Vodky","date":"2015-08-05T20:10:21.513+0000","up_votes":1,"down_votes":0,"body":"Nessuno ha detto che perdi la laning phase (è ovvio che un zed o un talon o un qualsiasi ad vincano la lane) ma poi nel mid e late game inizi a soffrire per poi essere massacrato una volta che gli avversari buildano tanta armor. Poi se dovete dirmi eh ma io piglio stocazzo e vinco la lane bla bla bla però ho il team di cacca che non mi fa arrivare a challenger xdxd sappiate che siete voi il problema. Perché io devo obbligare il top laner ad andare ap ( che di scelte ap tank in top sono ridottissime) mentre uno può andare top con un bel tank alla darius che non sia inutile in late game? Se poi è 2 season che anche i pro player prendono una determinata compo ci sarà un motivo. Per jackiechan: ma hai letto troll da qualche parte? La gente si inventa frasi giusto per dire più stronzate possibili....","replies":[]}]},{"poster":"ztJackieChan","date":"2015-08-05T16:32:55.315+0000","up_votes":1,"down_votes":1,"body":"430 ranked, ancora un passo che forse ce la fai a raggiungere gold, ancora un piccolo sforzo ! :D\n\nper te, talon, yasuo, zed mid significa troll :D\nquasi quasi devo iniziare a rivalutare quell'altro che chiedeva il ban account a chi pickava teemo ! :D\n\nse tu sapessi cosa uso io in mid, ti partirebbe l'embolo, meglio che non guardi il mio profilo, sei avvisato ! :D","replies":[{"poster":"twitchtv Vodky","date":"2015-08-05T17:50:25.742+0000","up_votes":1,"down_votes":0,"body":"Ma se ne hai 480 e sei un misero silver V. Vien via ammettilo che ti brucia il culetto. Da ex gold 4 boostato non mi aspetto di certo di essere compreso. Saluti","replies":[]}]}]},{"poster":"Zarath93","date":"2015-08-05T16:32:26.368+0000","up_votes":1,"down_votes":0,"body":"il punto  2 è sbagliato, se nn ci sono supertankeroni nella squadra nemica si vince anche full ad","replies":[{"poster":"ztJackieChan","date":"2015-08-05T16:36:20.869+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zarath93,realm=EUW,application-id=MJVj50Jw,discussion-id=ooiAFoWB,comment-id=0003,timestamp=2015-08-05T16:32:26.368+0000)\n>\n> il punto  2 è sbagliato, **se nn ci sono supertankeroni nella squadra nemica si vince anche full ad**\n\ninfatti ho scritto la stessa cosa. Anzi, sono andato pure oltre. Ho scritto che a volte vinco pure quando ci sono supertankeroni nel team nemico ! :D","replies":[]}]},{"poster":"R3lion","date":"2015-08-05T16:14:41.830+0000","up_votes":1,"down_votes":0,"body":"raga ci sono tipo 1k post di questo tipo, non è che potreste mettervi tutti su uno cosi limitiamo lo spam?","replies":[]}]}