{"poster":"Pablove90","date":"2016-01-29T02:31:27.302+0000","title":"Mi opinión de los nuevos cambios","subforum":"Charlas Generales","up_votes":9,"down_votes":1,"body":"Como dice el titulo.. encuentro cosas que no est&aacute;n funcionando para nada y subo esto en modo constructivo asi que no armen foro {{champion:432}} ...\r\n{{champion:29}} {{champion:29}} {{champion:29}} abstenerse por favor\r\n\r\n1ro y principal cambiaria el launcher...estos nuevos cambios tendr&iacute;an que haber venido con nuevo launcher.. ya esta muy bugeado... mucha gente no puede actualizar.. mucho bug en tiendas, en chat, en selecci&oacute;n de campe&oacute;n, en compra de rp, en cromas en much&iacute;simas cosas (sin ir mas lejos hasta en la tienda nueva que habilitaron hoy) esto es lo mas importante de todos los cambios que espero con much&iacute;simas ansias mas por la gente que no puede entrar que por mi... es un garr&oacute;n \r\n\r\n2do agregaria como era entes el boton &#039;&#039;buscar otro equipo&#039;&#039; en partidas normales creador de equipo... porque prueban cosas nuevas que uno no quiere y te queda salirte con una sancion de 5 minutos... un garr&oacute;n\r\n\r\n3ro sacaria que mas de 2 premades puedan jugar ranked... porque la mayoria de premades en team pueden hacer bulling y abuso a los jugadores rellono esto es un error catastrofico porque si tu team son 4 te pueden trolear y convencer al team enemigo de comerte  minimo 4 reports y si te banean la cuenta tardan muchisimo tiempo en comprobar que fue un acto de 4 o 3 premades que se ensa&ntilde;aron \r\n\r\n4to.. vista de ping antes de jugar.. se que hay maneras de saberlo... pero cansa jugar 1 personalizada o revisar foro o andar testeando todo tos santos dias por las dudas...\r\n\r\n5to mas cosas para el foro... nunca nadie toca el tema pero faltan cosas para el foro como:\r\n* mas variedad de reportes a posteos en donde se insulta,  se muetra hacks, se insita al maljuego o troleo  y esas cosas... es obsoleto el sistema de reportes del foro (si bien son MUY rapidos a la hora de sancionar y esto si me gusta)\r\n* rangos para los que si ayudan a la comunidad en el foro con grado como las maestrias.. algo asi por ejemplo\r\nhttp://i29.photobucket.com/albums/c291/jasperojo/fondo-con-los-rangos-eko.png\r\nhttp://librosweb.es/img/tutoriales/sensiolabs_insight_medallas.png\r\n*premios (no de dinero ni rp) a los que tienen muchos puntos positivos totales.. eh visto gente con 3k 4k y es una tonelada de TIEMPO invertido en ayudar a la gente, esto para mi merece ser premiado con algo que no se pueda comprar con dinero si no algo que represente el honor tanto en el foro como en el juego (que este vinculado) una tirita de honor que solo se consiga por medio del foro\r\n*Un chat general en el foro para unir mas a la comunidad pero que solo puedan entrar los que tengan buencomportamiento in the foro (para filtrar a los tipicos {{champion:29}} que entran a bardear y de mas) y en lo posible que algun rioter participe rara ves de este chat por que no...\r\n*y lo mas importante ...foto  deperfil.... solo aca en el foro no seria esto posible? en el juego es una locura pero en el foro es lo mas normal del mundo poner una imagen de perfil o al menos que sea del game.. un campeon, bicho de jgla, un sumonner u objeto algo....\r\n\r\na los pocos que leyeron y no esten de acuerdo en algun punto hagamelo saber.. que ver las cosas de un punto diferente esta buenisimo no me molesta en lo absoluto.\r\n\r\nAgradecimiento especial a esas personas que viven ayudando a la comunidad, esos que se quedan un poquito mas en el foro en ves de viciar para dar una opinion o una manito con algo... si a vos amiguito/a ...  &iexcl;te espera un muy buen queso! {{champion:201}}","replies":[{"poster":"FurchiDC","date":"2016-01-29T23:24:35.670+0000","up_votes":2,"down_votes":0,"body":"Estoy de acuerdo con las recompensas del foro, yo me paso todo el día posteando, leyendo, dando +1 a temas de interés y -1 al spam. Denuncio a quien lo merece y halago a quien también se lo merece.\nTengo 3.8k de votos positivos :D. No fue fácil ^_^;.\n\nhttp://i.imgur.com/coZYh6j.png\n\n--\nSaludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[]},{"poster":"Ks Erwyn","date":"2016-01-29T19:10:02.123+0000","up_votes":2,"down_votes":0,"body":"1° a mitad de año llega el nuevo cliente\n\n2° No!\n\n3° Meh...................\n\n4° llega con el nuevo cliente\n\n5° Ya aclararon que en algún futuro mejores la estructuras del foro y devuelvan tal vez los rangos","replies":[]},{"poster":"Eh Ameoooo","date":"2016-01-29T16:01:08.128+0000","up_votes":2,"down_votes":0,"body":"Coincido con todo menos con el 2. Cada uno tiene derecho a probar los campeones que quiera en la linea que le pinte. Que el meta sea uno no significa que un campeon con determinada build y maestrias mo lo pueda romper.\nMe diras, y en rankeds? Es verdad que una ranked no es ambito de pruebas, pero quizas ya lo probo en una normal y le fue bien.","replies":[{"poster":"Lysaru","date":"2016-01-29T16:21:52.574+0000","up_votes":2,"down_votes":0,"body":"\"en UNA normal\"","replies":[{"poster":"Eh Ameoooo","date":"2016-01-29T16:31:02.283+0000","up_votes":2,"down_votes":0,"body":"Si yo pruebo a Leona mid en 50 normales y me va bien (estoy exagerando con el ejemplo es obvio que Leona mid no sirve) me voy a sentir con confianza de hacerlo en rankeds. El problema es que mi team no va a saber que me funciono antes y van a creer que soy un troll cuando no lo soy.\nTe digo esto cuando no soy de hacer estas pruebas, pero entiendo a los que si.","replies":[]}]}]},{"poster":"Urellaxu","date":"2016-01-29T03:10:47.579+0000","up_votes":2,"down_votes":0,"body":"Solamente cambiaría dos cosas de todo lo que dijiste:\n1) Me parece bien que se pueda rankear con mas amigos, aunque no en premade de 4 o 5, me parece que el número ideal sería hasta 3.\n2) Lo de buscar otro equipo en cierta forma está bien, pero por otro lado ese era uno de los principales problemas de demoras en el creador de equipos. Aunque es cierto que a veces te tocan equipos troll y uno se tiene que bancar una cola de 5min o más si te tocan seguidos, capaz se podría poner algo que se pueda usar cada tanto que se cargue jugando como los dados en aram o una cosa así.\n\nPor todo lo demás coincido con vos.\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"Pablove90","date":"2016-01-29T03:28:53.315+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Urellaxu,realm=LAS,application-id=v7qsfXsE,discussion-id=HqZofBiT,comment-id=0000,timestamp=2016-01-29T03:10:47.579+0000)\n>\n> Solamente cambiaría dos cosas de todo lo que dijiste:\n> 1) Me parece bien que se pueda rankear con mas amigos, aunque no en premade de 4 o 5, me parece que el número ideal sería hasta 3.\n> 2) Lo de buscar otro equipo en cierta forma está bien, pero por otro lado ese era uno de los principales problemas de demoras en el creador de equipos. Aunque es cierto que a veces te tocan equipos troll y uno se tiene que bancar una cola de 5min o más si te tocan seguidos, capaz se podría poner algo que se pueda usar cada tanto que se cargue jugando como los dados en aram o una cosa así.\n> \n> Por todo lo demás coincido con vos.\n> {{sticker:zombie-brand-clap}}\n\ncoincido tolmente 3 seria ideal de premades...\n y lo otro del boton tenes razon tambien..  lo que desis seria una onda como lo de aram.. que despues de ciertas partidas jugadas te deja cambiar de champ con dado, en este caso cambiar de team... estaria buenisimo eso\n\ngracias por leer, pasar y opinar !!!\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}