{"poster":"Pablove90","date":"2018-01-17T05:03:29.843+0000","title":"Soluciones de RIOTers ... ineficiencia  ... seguimos esperando....","subforum":"Charlas Generales","up_votes":1,"down_votes":5,"body":"en el ultimo comunicado ponen :\r\n&#039;&#039;Las ranked se bajar&aacute;n 1 hora y media antes, para tener tiempo de terminar las partidas clasificatorias y evitar finalizar ranked abruptamente,&#039;&#039;\r\n- Que les cuesta dejar que los que est&aacute;n en sala terminen esa partida y cuando llegue el horario pactado bloquear el ingreso a los que quieran ingresar.. as&iacute; lo que entraron quedan y los que se pasan no pueden entrar y listo... es recontra programable esa es una solucion ... creo que es mejor hacer que un par de rioters esperen o laburen un poquito mas a que dejen a tanta gente afuera de un juego\r\n\r\ndespu&eacute;s dice... &#039;&#039; no as&iacute; las partidas normales.&#039;&#039; ???? sean claros... las partidas normales (reclutamiento) tampoco se pueden jugar asi que no pongan &#039;&#039;no as&iacute;&#039;&#039;\r\n\r\ny lo mas insolito : &#039;&#039;Por esto les recuerdo evitar jugar partidas, cerca de la hora de bajada de los servicios, para no perjudicar la experiencia de juego.&#039;&#039;\r\nasi que nosotros tenemos que calcular cuando dura una partida o una seleccion de campeones ... genios... diganme como usar ese poder asi &#039;&#039;evito&#039;&#039; jugar con afk, trolls y flammers ....\r\n\r\nmedia pila Rioters hagan mas por nosotros... entendemos que ustedes no manejan muchas programaciones y cosas del juego gral. pero defi&eacute;ndanos es una verguenza que en vacaciones no extiendan nada seguimos jugando con limitaciones en rankeds y normales en reclutamiento encima re temprano... reclu extiendan hasta las 2 y rank hasta las 3 por lo menos en verano \r\n\r\nya es tarde quedan pocos d&iacute;as de vacaciones (al menos en argentina) y hay gente para jugar (no es que no hay gente)...  ayuden a la comunidad que para eso est&aacute;n \r\n\r\nno suben estas cosas al cliente .. es una verg&uuml;enza que no informen por ahi es de picapiedras tener que entrar a un foro (si un foro -mayuscula-) para enterarte de los bugs o cosas que tienen &#039;&#039;programadas&#039;&#039; \r\n\r\naahhh pero cuando se buguea un ward..... el cartelito lo dejan un mes por las dudas.. para que todos se enteren y prevenir que pongan wards con skins estandar porque eso si es importante ... da&ntilde;a la estetica visual y previene muchos problemas psicologicos\r\n\r\ncuando hay problemas o se piden respuestas se esconden todos.. cuando la respuestas son sencillas ah&iacute; aparecen todos... como ahora respondiendo con los enlaces del mantenimiento y cosas que se responden solas .... \r\n\r\nmedia pila no pueden negar que cada ves mas gente deja el lol o juega menos horas.. esto esta cagando el juego (no solamente este juego)... al menos ac&aacute; en LAS pero ustedes tienen que ayudar a este juego y su comunidad ... mas en momentos donde el lol no es el juego del momento...","replies":[{"poster":"ZanahoriaAsesina","date":"2018-01-17T05:21:24.980+0000","up_votes":7,"down_votes":0,"body":"> asi que nosotros tenemos que calcular cuando dura una partida o una seleccion de campeones ... genios... diganme como usar ese poder asi ''evito'' jugar con afk, trolls y flammers ....\n\nEs simple, no juegues cerca de la hora de bajada de los servicios, si dicen que el mantenimiento es a la 1 AM, no te metas en una partida a las 00:00 hs.\n\nAdemás, estaba avisado hace 4 días y en el cliente desde ayer.\n\n\n> ya es tarde quedan pocos días de vacaciones (al menos en argentina) y hay gente para jugar (no es que no hay gente)... ayuden a la comunidad que para eso están\n\nEl mantenimiento es necesario sino lo hacen vas a tener aun menos días de LoL por problemas técnicos.\n\n>  Que les cuesta dejar que los que están en sala terminen esa partida y cuando llegue el horario pactado bloquear el ingreso a los que quieran ingresar.. así lo que entraron quedan y los que se pasan no pueden entrar y listo... es recontra programable esa es una solucion ... creo que es mejor hacer que un par de rioters esperen o laburen un poquito mas a que dejen a tanta gente afuera de un juego\n\nLes cuesta, porque es un mantenimiento tanto de Hardware como de Software, esto implica que tienen que apagar los servidores para instalar actualizaciones, hacer backups, limpiarlos, etcetera.","replies":[{"poster":"ñiñiñicampeatop","date":"2018-01-17T05:25:26.753+0000","up_votes":1,"down_votes":4,"body":"siempre el mismo verso del apagar servers solo en las estan desactivados ajajajajajajajajaj, y siempre es igual miras los otros servidores y andan de maravilla","replies":[{"poster":"GatóMonstruo","date":"2018-01-17T05:26:44.173+0000","up_votes":2,"down_votes":0,"body":"Es que el mantenimiento se está llevando en nuestro server bro n.n","replies":[{"poster":"Pablove90","date":"2018-01-17T06:01:53.856+0000","up_votes":1,"down_votes":2,"body":"pero el dia tiene muchas horas bro... por que cortar a la hora que hay mucha gente bro? si mas tarde esta la gente durmiendo y pueden laburara 10 horas que no se entera nadie bro...","replies":[{"poster":"I Love KaiSa","date":"2018-01-17T06:20:48.493+0000","up_votes":3,"down_votes":0,"body":"Los mantenimientos no duran media hora pa, pueden haber inconvenientes que lo retrasen.\nY se hacen de noche porque hay menos gente que a la mañana/tarde.\n\n\n","replies":[]},{"poster":"Excorpion","date":"2018-01-17T16:03:17.274+0000","up_votes":1,"down_votes":0,"body":"Lo hacen en los horarios que hay menos gente...","replies":[{"poster":"Pablove90","date":"2018-01-18T05:19:22.098+0000","up_votes":1,"down_votes":0,"body":"a la 1 AM no hay menos gente que a las  3, 4, 5, 6 8 10  am...","replies":[{"poster":"Excorpion","date":"2018-01-18T10:33:31.698+0000","up_votes":2,"down_votes":1,"body":"Entre las 1 y las 6 si hay menos gente que entre las 7 y las 12\nLos mantenimientos pueden alargarse y tener problemas, por lo  tratan de evitar que afecte a la mayoria. Pero aún asi puede complicarse la cosa como ahora.","replies":[{"poster":"Pablove90","date":"2018-01-19T01:37:54.892+0000","up_votes":1,"down_votes":0,"body":"mira tuve 2 server de Mu y mas de 4 servers de counter strike jugué y juego diariamente (todos los dias)  y el lol no es la excepcion de ningun juego, no cambia un paradigma de nada y no logra que la gente en vacaciones de verano se duerma a las 1am o antes  y se levante a las 6, 7, 8, 9, ni 10 am para jugar.... no hablen por hablar... no defiendan algo por fanatismo o porque les dan algo a cambio.... pongan jugar a la 1 am si tardan 20 segundos es mucho pongan jugar a las 8 am no van a encontrar partidas rapidas ni a palo\ndespues si quieren discutir otras cosas las discutimos si me queres cambiar el tema y salir con otra cosa todo bien \npero si jugas 2 juegos como mucho y no pasastes de ahi no hables por hablar no juega mas gente de 7 a 12 que de 1 a 4am ni a palo... pero ni en el maincra","replies":[{"poster":"Excorpion","date":"2018-01-19T02:25:56.333+0000","up_votes":1,"down_votes":0,"body":"> no hablen por hablar...\n\nSi tuviera modo de buscar el comentario del rioter que lo dijo... te lo pasaría.\nPero los horarios normales, y los de extendidos, son en esas horas por algo, no crees?\nSi tu crees que hay más jugadores en ciertos horarios que otros, no tienes como demostrarlo, solo puedes fiarte en lo que se ha dicho, y conformarte con ello.","replies":[]}]}]},{"poster":"bombastico","date":"2018-01-18T09:46:16.163+0000","up_votes":1,"down_votes":1,"body":"Ellos saben a que hora hay menos gente, tienen los datos, en cambio tu hablas por hablar.","replies":[]}]}]}]},{"poster":"ñiñiñicampeatop","date":"2018-01-17T05:29:19.874+0000","up_votes":1,"down_votes":6,"body":"ya se :/, mi comentario se refiere que los problemas y los apagones de servidores con mas horas de mantenimiento se ven aca en las no en NA KR etc etc... si se la vas a mamar a riot mamasela con conocimiento","replies":[{"poster":"ZanahoriaAsesina","date":"2018-01-17T05:38:25.674+0000","up_votes":2,"down_votes":1,"body":"Pero... no fue un apagón, es un mantenimiento programado xD\n\nIgual no te niego que este servidor tenga mil y un problemas pero el que público solo se esta quejando del mantenimiento, no de un problema o un apagón, yo conteste eso mismo, qué es y por qué lo hacen. :D","replies":[{"poster":"ñiñiñicampeatop","date":"2018-01-17T05:42:59.799+0000","up_votes":1,"down_votes":4,"body":"yo me pregunto si hay que explicarles las cosas dos o tres veces para que les entre en la cabeza... cuando DIGO: SOLO ACA EN LAS SE VEN MAS MANTENIMIENTOS Y APAGONES DE SERVIDORES QUE OTROS LUGARES, ES POR QUE SOLO PASA ACA Y¨ESO NO ME LO PUEDEN NEGAR... espero se entienda saludos","replies":[{"poster":"Pántheon","date":"2018-01-17T05:46:41.721+0000","up_votes":2,"down_votes":0,"body":"en el ultimo mes solo hubo 2 apagones de server y 2 mantenimiento,no recuerdo el server pero una vez hubo cerca de 3 apagones y 1 mantenimiento de casi 12 hrs.","replies":[]},{"poster":"ZanahoriaAsesina","date":"2018-01-17T05:45:16.284+0000","up_votes":2,"down_votes":0,"body":"https://i.makeagif.com/media/12-15-2014/oXytdg.gif\n\n","replies":[{"poster":"Pablove90","date":"2018-01-17T06:37:16.991+0000","up_votes":2,"down_votes":1,"body":"ves.. a esto me refiero..... pero no pierdo mas tiempo con vos.. no vales 2p amigo","replies":[{"poster":"ñiñiñicampeatop","date":"2018-01-17T22:08:28.382+0000","up_votes":1,"down_votes":1,"body":"compania seria riot? comunidad seria? por favor.. no que se rol ocupan estos que salen a defender a riot cuando claramente se ve que este server es quizas el mas problematico en todo.. con la respuesta de zanahoriaasesina te das cuenta que ningun rioter le da interes a la comunidad y sale cualquier nene a responder cosas que quizas se necesite un poco de madurez mental para hacerlo","replies":[]}]},{"poster":"ñiñiñicampeatop","date":"2018-01-17T05:47:52.546+0000","up_votes":1,"down_votes":2,"body":"uhh.. que groso sos cuando te retrucan las cosas respondes asi ? 16 o 15 o menos años tenes?","replies":[]}]}]}]},{"poster":"GatóMonstruo","date":"2018-01-17T05:42:11.567+0000","up_votes":2,"down_votes":1,"body":"Hey bro! Tranquilo :)\n\nPrimeramente, trabajo en Soporte, así que realmente conozco el por qué es el mantenimiento.\n\nSegundo, los mantenimientos de este tipo suceden en todos los servidores, solo que a vos te afectan únicamente los de LAS u.u","replies":[{"poster":"ñiñiñicampeatop","date":"2018-01-17T05:46:19.592+0000","up_votes":1,"down_votes":5,"body":"Yo estoy tranquilo, como podes suponer desde una pantalla que estoy enojado o algo por el estilo?... obvio que me afectan los de Las, porque juego aca no hay que aclararlo a eso no tengo 10 años, pero mi opinion se basa en que \"quizas\" el equipo de soporte de los otros servidores son un poco mas eficientes que los de las... lo entendiste o no ?","replies":[{"poster":"Excorpion","date":"2018-01-17T16:04:29.024+0000","up_votes":1,"down_votes":0,"body":"Puede que si, puede que no... pero la única solución a eso, sería cambiarse de servidor. Es como con las compañías de red.","replies":[{"poster":"ñiñiñicampeatop","date":"2018-01-17T22:05:23.271+0000","up_votes":1,"down_votes":0,"body":"es mas un puede que si sean menos eficientes... caidas de jugadores ahora jajajja","replies":[]}]}]}]}]}]}]},{"poster":"Pablove90","date":"2018-01-17T06:00:14.527+0000","up_votes":1,"down_votes":5,"body":"hablo de soluciones  y me salis con es simple no juegues.... soluciones no empiezan con un NO.... todo lo contrario....\nes mas simple que el mantenimiento se haga en un horario en el que jueguen muy pocos jugadores... quien va a estar ON a las 5 am o 4 am cuendo comoden en parche. ? \ncuando hay mas gente conectada a la 1 o a las 5 am?\n\nestaba avisado hace 4 dias en el foro perfecto...\n\nel mantenimiento es necesario porsupuesto  pero como te dije antes no a la 1 am en vacaciones abriendo a las 5 cuando ya nos fuimos a todos a jugar otro juego ... \n\nles cuesta lo mismo empezar a apagar sevidores (como vos decis a las 5 6 am cuando ya no juega nadie) tenes 4 5 hs para hacer lo que quieras con los server (porque juega muy poca gente a esa hora por no decir nadie)\n\n\nno entendes ni vas a entender al punto que voy.. las ''soluciones en LAS no son las mismas que en otros servidores'' el servicio es otro los horarios de laburo en server son otros para dejar afuera a la gente\n\n\nno te hablo como jugador te hablo como persona....  si vos tenes un negocio y laburas con colegios no podes ponerte a baldear a la hora en el que salen los pibes del colegio hacelo en un horario en el que no haya actividad porque dejas afuera a la gente y no podes decirle a la gente (como vos decis) no entres... entra en otro horario ahora estoy manteniendo la higiene del local ... se trata de respeto y de cuidar al cliente... \n\ntengo otros juegos no me jode jugar otra cosa pero me saca que los fanboys del lol bardeen a la gente nueva, que los que tendrian que escuchar te digan ''corta'' no hagas esto...  \n\n\ny te la seguiria con mas cosas hablando de rankeds y reclutamientos que nunca extendieron porque si pueden... pueden en otros servers pueden aca tambien... son largas las colas y por eso cortan antes para que no sean largas colas.. soluciones perfectas cortemos y listo... motivar y enseñar y jugar esos roles que no quieren ocupar? naaaa para que..?? corta no entren y fueeeee si no te gusta no te gusta... asi se soluciona... y eso es lo que me jode","replies":[{"poster":"Stars of Arcadia","date":"2018-01-17T06:11:37.326+0000","up_votes":2,"down_votes":0,"body":"> quien va a estar ON a las 5 am o 4 am cuendo comoden en parche. ?\ncuando hay mas gente conectada a la 1 o a las 5 am?\n\nLa gente normal se va a dormir antes de las 12.\n\n> les cuesta lo mismo empezar a apagar sevidores (como vos decis a las 5 6 am cuando ya no juega nadie) tenes 4 5 hs para hacer lo que quieras con los server (porque juega muy poca gente a esa hora por no decir nadie)\n\nSi empezaran a las 5/6AM, terminarían después de las 8 (Que es horario laboral)\n\n> no entendes ni vas a entender al punto que voy.. las ''soluciones en LAS no son las mismas que en otros servidores'' el servicio es otro los horarios de laburo en server son otros para dejar afuera a la gente\n\nEn realidad si lo hay, y es el mismo margen horario. Solamente que con la diferencia de 3hs que tenemos con NA, nadie está para fijarse si ellos tienen el mantenimiento en ese horario. Solo están para quejarse a la 1 AM.\n\n> el mantenimiento es necesario porsupuesto pero como te dije antes no a la 1 am en vacaciones abriendo a las 5 cuando ya nos fuimos a todos a jugar otro juego ...\n\nPuede que vos y yo tengamos vacaciones, pero el mundo sigue girando y no somos los unicos que juegan.\n\n> tengo otros juegos no me jode jugar otra cosa pero me saca que los fanboys del lol bardeen a la gente nueva, que los que tendrian que escuchar te digan ''corta'' no hagas esto...\n\nEse es un problema de la comunidad, y no solo de LoL, como comunidad joven de latinoamérica. En los colegios a los nuevos se les sigue acosando, o como ahora lo llaman, \"bullying\"\n\n> y te la seguiria con mas cosas hablando de rankeds y reclutamientos que nunca extendieron porque si pueden... pueden en otros servers pueden aca tambien... son largas las colas y por eso cortan antes para que no sean largas colas.. soluciones perfectas cortemos y listo... motivar y enseñar y jugar esos roles que no quieren ocupar? naaaa para que..?? corta no entren y fueeeee si no te gusta no te gusta... asi se soluciona... y eso es lo que me jode\n\nPrefieren llevarse un poco más de comisión que solucionar los problemas de fondo. Mientras que no afecte a las compras con RP, va a estar todo \"bien\" para ellos en ese sentido. \n\nEspero haber respondido tus dudas, y sinó, que tengas buenas noches igual","replies":[]}]}]},{"poster":"Stars of Arcadia","date":"2018-01-17T05:19:16.478+0000","up_votes":3,"down_votes":0,"body":"Dijeron que tenían para 4 horas, con PREAVISO. Si no reiniciaste el cliente, no se te va a actualizar la información en el \"?\" al lado del botón \"jugar\". El aviso estaba hace 4 días en el foro, y a las 12 estaba el anuncio en el Cliente. Siempre que avisan que hay mantenimiento para las clasificatorias, luego se cierra el server. Mucho habla, mucho habla, pero nadie lee. Por qué? Les da mucha pereza, al parecer. El día que baneen a los invocadores por postear innecesariamente, ahi quizá la comunidad ponga los pies en la tierra. Que tengas unas buenas noches.","replies":[]},{"poster":"Pántheon","date":"2018-01-17T05:44:14.483+0000","up_votes":2,"down_votes":0,"body":"c r y p o s t","replies":[]},{"poster":"BeamOeste","date":"2018-01-17T05:24:35.072+0000","up_votes":2,"down_votes":1,"body":"Hola... No tenes que jugar al limite tampoco, si sabes que hoy a la noche se cerraba el servidor por mantenimiento.. para que jugas? Es culpa tuya, No deberias quejarte de nada","replies":[{"poster":"Pablove90","date":"2018-01-17T06:08:41.987+0000","up_votes":1,"down_votes":1,"body":"yo no estaba jugando .... estoy diciendo que las soluciones nunca son eficientes.. los medios de comunicacion no son los mejores.. para muchas cosas tenes que tomarte el laburo de entrar a foro.. daaaaale esto es re precario.... no cuidan al juegador no respetan  en otros juegos vos ejecutas el juego y PUMMMM te tiran un cartel con el parche y si lo queres sacar tenes que darle aceptar no tenes que buscar ellos te lo muestran a vos...\ny en otros server de este mismo juego los parches no son en los horarios que los que ponen aca... en otros servers de este mismo juego no restringen las NORRRRMALES en reclu como aca... y asi pasan y pasan cosas que se solucionan muyyy facilmente bro... no es despegar un cohete de la nasa tienen que pedir por nosotros y para eso estan los rioters de LAS","replies":[{"poster":"BeamOeste","date":"2018-01-20T19:00:56.825+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pablove90,realm=LAS,application-id=v7qsfXsE,discussion-id=9FjN8Ap2,comment-id=00030000,timestamp=2018-01-17T06:08:41.987+0000)\n>\n> yo no estaba jugando .... estoy diciendo que las soluciones nunca son eficientes.. los medios de comunicacion no son los mejores.. para muchas cosas tenes que tomarte el laburo de entrar a foro.. daaaaale esto es re precario.... no cuidan al juegador no respetan  en otros juegos vos ejecutas el juego y PUMMMM te tiran un cartel con el parche y si lo queres sacar tenes que darle aceptar no tenes que buscar ellos te lo muestran a vos...\n> y en otros server de este mismo juego los parches no son en los horarios que los que ponen aca... en otros servers de este mismo juego no restringen las NORRRRMALES en reclu como aca... y asi pasan y pasan cosas que se solucionan muyyy facilmente bro... no es despegar un cohete de la nasa tienen que pedir por nosotros y para eso estan los rioters de LAS\n\nAcordate que estamos en Las","replies":[]}]}]},{"poster":"Patty2","date":"2018-01-17T05:13:38.518+0000","up_votes":2,"down_votes":1,"body":"La verdad, agradece que los Rioters hacen algo, te traen actualizaciones, hacen dinamicas, te responden y todo, ellos ayudan a la comunidad mucho y lo unico que hacen ustedes es solamente quejarse de esto, que Riot Fulanito lo otro, ellos tratan de traerte la mejor experiencia en el juego y hay muchos que lo valoran y otros que no, solo porque perdiste una ranked o te sacaron de una ranked porque no hicieron el mantemiento a tiempo o lo hicieron despues no es su culpa, ellos tienen ordenes de sus superiores y deben obedecerlas aunque eso traiga consecuencias en ciertas cosas. De todos modos mientras mas rapido la actualizacion sea puesta, mas tiempo para para jugar tendras.","replies":[{"poster":"Pablove90","date":"2018-01-17T06:34:02.894+0000","up_votes":1,"down_votes":2,"body":"hacen dinamicas? como nos ayudan ? por que no me responden ?\n\nNo confundas riot con rioters de LAS....\n\nyo no digo que no hay que mantener al server... yo digo que los horarios no son los adecuados... es una locura cerrar un juego a la 1AM 4 hs..... los riotes de LAS pueden laburar un poco mas tarde y no se le cae nada a nadie... no se va la gente del lol a otro juego... no pierden gente ... se esta llendo mucha gente de este juego (juego que me encanta) no esta bueno que echen a la gente asi... y te repito este post no es quejandome de un mantenimiento es quejandome de las medidas que toman en LAS de todo... por que tan diferente al resto de los servers?","replies":[]}]}]}