{"poster":"Der Käptn Balu","date":"2016-12-17T03:44:52.059+0000","title":"\"Rassismus\" gegenüber Deutschen","subforum":"Spielerverhalten & Moderation","up_votes":6,"down_votes":5,"body":"Ahoi,\r\n\r\nleider ist mir gerade kein besserer Titel eingefallen der dieses Thema aufgreifen k&ouml;nnte^^ Ich bitte euch dies mal au&szlig;er acht zu lassen:D\r\n\r\nEs geht um foglendes: Und zwar ist es mir schon oft passiert dass ich als ein Rechter beschimpft wurde. Da mein Beschw&ouml;rername leicht zu iden&shy;ti&shy;fi&shy;zie&shy;ren ist bemerken die meisten Spieler gleich dass ich Deutscher bin. Und oft passiert es dass, wenn ich mal ein schlechtes game habe, direkt als rechter beschimpft werde. Ich werde auf den 2.ten Weltkrieg angesprochen. Ob ich Adolfs Sohn sei. ob ich stolz sei was damals passiert sei etc etc. Weitere ausf&uuml;hren weden wohl nicht ben&ouml;tigt.\r\n\r\nMeine Frage ist, wie man dies Reprotet und ob auch solche Aussagen bestraft wrden. Ich sewlbst bin kein nazi, da diese mittlerweile so gut wie &quot;ausgestorben sind due &quot;neuen rechten&quot; nennt man meines wissens neona.zis. und ich zu damaliger zeit &uuml;berhaupt nicht auf der welt geschweige den Produziert gewesen bin^^:) (kleiner witz am rande) In wie weit werden da die Leute bestraft oder werden die &uuml;berhaupt bestraft? Ich als Deutscher, meinLeben lang gewesen, m&ouml;chte nat&uuml;rlich nicht als Rechter beschimpft werden da ich mit der damaligen zeit nichts zu tun habe. Werden die leute bei sowas &uuml;berhauot bestraft? Oder wie sieht dass aus? Falls nicht m&uuml;sst eman sowas nat&uuml;rlich &auml;ndern. Mich macht sowas einfach rasend wenn die Leute keine Ahnugn von der sache habe, ic hab auch nicht soviel ahnugnd avon kann aber behaupten ich sei keienr von denr echten,. und jeden deutschen als na.zi bezeichnen. \r\n\r\nIch pers&ouml;nlich empfidne sowas als beleidigung ja schon fast rassismus. Ich hoffe ihr k&ouml;nnt durhc meinen kauderwelsch lesen und euch denken worauf ich hinaus will:D","replies":[{"poster":"Humpelstilzche","date":"2016-12-17T06:43:55.784+0000","up_votes":6,"down_votes":0,"body":"> Meine Frage ist, wie man dies Reprotet und ob auch solche Aussagen bestraft wrden. \n\nRassismus. Und ja, sowas wird bestraft, und zwar, genauso wie alle anderen Formen von Rassismus, relativ hart. Kommt natürlich immer auf die Situation und auf die Vorgeschichte des Spielers an, aber tendenziell ist das ein Vergehen, das mit recht großer Sicherheit zu Strafen, manchmal sogar Bans führt. \n\nMein Name hat übrigens einen ähnliche Effekt^^","replies":[{"poster":"derBuddler","date":"2016-12-20T23:49:35.449+0000","up_votes":1,"down_votes":0,"body":"Yo, reimt sich ja auch auf \"Goebb...\" ;)","replies":[]},{"poster":"Memed On Ur Girl","date":"2016-12-17T11:34:01.006+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=KYnfKGf0,discussion-id=O6QeEzy1,comment-id=0000,timestamp=2016-12-17T06:43:55.784+0000)\n>\n> Rassismus. Und ja, sowas wird bestraft, und zwar, genauso wie alle anderen Formen von Rassismus, relativ hart. Kommt natürlich immer auf die Situation und auf die Vorgeschichte des Spielers an, aber tendenziell ist das ein Vergehen, das mit recht großer Sicherheit zu Strafen, manchmal sogar Bans führt. \n> \n> Mein Name hat übrigens einen ähnliche Effekt^^\n\nI dont know this feeling Kappa123","replies":[]}]},{"poster":"SchwarzerBimbo","date":"2016-12-17T08:27:31.867+0000","up_votes":2,"down_votes":13,"body":"***","replies":[{"poster":"Schlachtenhorn","date":"2016-12-17T09:56:23.640+0000","up_votes":8,"down_votes":0,"body":"Man muss aber auch sagen das dein Name in gewissen kreisen als Provokation gesehen werden kann.\n\nEdit. Gerade mal nachgeschaut ob ich das Wort Bimbo nicht falsch deute.\nAber nach den Bedeutungen kann man dir Rassismus oder Frauenfeindlichkeit vorwerfen.\n\nBimbo (Ethnophaulismus), Ethnophaulismus, d.h. abwertende Bezeichnung für Personen mit dunkler Hautfarbe (engl. darky)\nBimbo (englischer Slang), englische Bezeichnung für eine dumme, aber attraktive Frau","replies":[{"poster":"Megamaexx","date":"2016-12-17T11:38:47.214+0000","up_votes":2,"down_votes":0,"body":"Bimbo (ital.) Baby ;)\nIn seinem Fall würde aber die deutsche Definition zählen, also die eines Menschen mit schwarzer bzw dunkler Hautfarbe. Allerdings müsste er mal oft genug reportet werden, dann hat sich das Problem.","replies":[{"poster":"YugoParty","date":"2017-01-06T21:17:18.932+0000","up_votes":1,"down_votes":0,"body":"Also ich würde ihn jetzt ja schon für den Namen reporten","replies":[]}]}]},{"poster":"Megamaexx","date":"2016-12-17T11:36:46.652+0000","up_votes":3,"down_votes":0,"body":"Du hast Recht, nicht melden bringt nichts. Probier mal, die Spieler wegen Rassismus zu melden, dann kann man da was bewirken.","replies":[]}]},{"poster":"Schroppel","date":"2016-12-17T11:57:26.998+0000","up_votes":2,"down_votes":4,"body":"Wenn man ein Spiel spielt das von einer Firma entwickelt wurde deren Nationalität als erste und bisher einzige Atomwaffen einsetzte mit dem Ziel soviele wie nur möglich zu töten dann sollte man allein schon aus Gründen der Logik andere nicht wegen der Vergangenheit ihrer Nation beschimpfen.","replies":[{"poster":"clair de lune289","date":"2016-12-17T13:11:50.080+0000","up_votes":3,"down_votes":8,"body":"sry aber bei der Atombombe gab es wenigstens einen Sinn+Grund dahinter dem man verstehen kann im Gegensatz zu dem was Deutschland im 2WK getan hat.","replies":[{"poster":"OrangeBubble","date":"2016-12-17T13:29:53.033+0000","up_votes":5,"down_votes":2,"body":"Der Atombombenabwurf war so sinnvoll, wie der 2te Weltkrieg ~\nhttps://de.wikipedia.org/wiki/Atombombenabw%C3%BCrfe_auf_Hiroshima_und_Nagasaki\n\nEs gibt keinen legitimen Grund ein ganzes Land zu verseuchen und tausende von unschuldigen Leute umzubringen.\nOb ich nun millionen Juden oder tausende unschuldige Japaner umbringe + die Unwelt verseuche, macht kein Unterschied, es kommt nicht auf die Anzahl an, sondern lediglich auf die Sinnlosigkeit bei beiden Fällen. ","replies":[{"poster":"clair de lune289","date":"2016-12-17T15:11:28.097+0000","up_votes":2,"down_votes":5,"body":"Ich behaupte hier nicht das es gut war das die Atombombe abgeworfen wurde,dennoch macht es ein gigantischen Unterschied ob ich eine Atombombe abwerfe um eine Invasion und den hohen Verluste auf beiden Seiten zu vermeiden. wer kann schon sagen wie hoch diese gewesen währen wenn man bedenkt wie verbissen und teilweise lebensverachtend die Japaner gekämpft haben. (Kamikazepiloten und Co)\n\nZu sagen die Atombomben wäre genauso Sinnlose wie KZ/Todeslager die einzig und allein das Toten von so vielen Menschen die nicht ins Bild der Nazis passten zum Ziel hatten.\n\nps: Das beides zu den schlimmsten Dingen zählt die die Menscheiht jemals getan hat versteht sich denke ich mal von selbst","replies":[{"poster":"OrangeBubble","date":"2016-12-17T22:06:34.197+0000","up_votes":4,"down_votes":2,"body":"\"eine Invasion und den hohen Verluste auf beiden Seiten zu vermeiden\"\nSo haben nur die Japaner jahrelang noch große Verluste zwecks Verseuchung. Es ist ja auch net so, dass die bereit waren aufzugeben, wenn die USA nur eine Bedingung akzeptiert hätten.  Und ich bitte dich, 2 Abwürfge über große Gebiete mit Zivilbevölkerung? Das soll keine sinnlose Tötung gewesen sein? ....\n\nUm genau zu sein, ist der Atombombenabwurf sogar schlimmer, denn die Reichweite der Zerstörung tragen nicht nur Japaner, die in dem Jahrzehnt gelebt haben, sondern auch noch die, die Jahrzehnte lang danach leben werden und rein gar nichts mit dem Krieg zu tun hatten. \n\nAber ja, weils die USA war, ist es vollkommen nachvollziehbar und nicht ganz so schlimm, ja... ja.....\n\nhttps://de.wikipedia.org/wiki/Terrorismus\n\nEine Atombombe wird wohl sehr viel Angst und Schrecken verbreiten ....\nAuch wenn die Defintion perse umstritten ist ~","replies":[{"poster":"clair de lune289","date":"2016-12-18T11:43:58.630+0000","up_votes":3,"down_votes":4,"body":"du behauptest hier also ernsthaft  das die Atombombe schlimmer war als die KZ der Nazis wo es einzig und allein um die VERNICHTUNG von Menschen ging ? \nzu behaupten es wäre sinnloses Töten gewesen,wenn es zum ENDE der Kriegshandlung führte ....\nschöne Logik...\n\nJa die Strahlung ist schlimm\nJa die Bomben hätten nie abgeworfen werden sollen\nJa es gab zu viele und hauptsächlich zivile Opfer auch das ist ein Verbrechen\n\nMan darf dabei aber nicht vergessen, die Atombombe war eine neue Waffe deren Langzeitfolgen NICHT abzusehen waren, allein deshalb hätte sie nie eingesetzt wäre dürfen.\n\nAuch bei einer Invasion,die nötig gewesen wäre ohne die Bomben. hätte es durch normale Bombenangriffe und andere Kriegshandlungen eine enorm hohe anzahl an zivilen Töten gegeben.Dazu kommen noch die Opfer von übergriffen durch Soldaten die es leider in jedem Krieg gibt.\nKeiner kann sagen ob die Opferzahl dabei höher oder niedriger gewesen wäre,das hättet auch vorallem von der verbleibenden dauer des Krieges abgehangen.\n\nps: ich bin alles andere als ein Fan von Amerika und der Politik die dort betrieben wird.Dennoch wiegen die Verbrechen Deutschlands im 2WK wesentlich höher als die von Amerika","replies":[{"poster":"eingew","date":"2016-12-18T15:30:18.893+0000","up_votes":6,"down_votes":1,"body":"Ich persönlich bin ja der Meinung, dass jede Form von Tötung prinzipiell zu verurteilen ist und die moralischen oder anderweitigen Rechtfertigungen dahinter normalerweise als ziemlich egoistische Scheinheiligkeit zu erkennen sind.\n\nSo auch in diesem Fall. Die Atombombe ist ein Produkt einer gigantischen Zerstörungsmaschinerie, wie es KZs und ähnliche Arbeits- und Ausbeutungslager sind. Es geht jedes Mal darum, die eigene Position zu stärken und die der anderen schwächen oder am besten gleich zu vernichten.\n\nDiesem Grundprinzip folgen alle Kriege und sie sind immer gleich. Keine der Kriegsparteien unterscheidet sich darin.\n\nGesondert möchte ich noch auf folgende Punkte eingehen:\n\n> zu behaupten es wäre sinnloses Töten gewesen,wenn es zum ENDE der Kriegshandlung führte ....\n\nWenn ich eine Prügelei sehe und einer Person gezielt mehrfach gegen den Kopf trete, habe ich die Prügelei auch beendet.\n\nUnd auch einige seiner kognitiven Funktionen... aber die sind ja nicht umsonst zerstört worden, schließlich wurde auch die Prügelei beendet.\n\n> Man darf dabei aber nicht vergessen, die Atombombe war eine neue Waffe deren Langzeitfolgen NICHT abzusehen waren, allein deshalb hätte sie nie eingesetzt wäre dürfen.\n\nDas würde Oppenheimer aber anders ausdrücken und der war immerhin der führende Wissenschaftler beim Manhattan-Projekt.\n\n> If the radiance of a thousand suns / were to burst at once into the sky / that would be like / the splendor of the Mighty One and I am become Death, the shatterer of worlds.\n\n___\n\n> Auch bei einer Invasion,die nötig gewesen wäre ohne die Bomben. hätte es durch normale Bombenangriffe und andere Kriegshandlungen eine enorm hohe anzahl an zivilen Töten gegeben.Dazu kommen noch die Opfer von übergriffen durch Soldaten die es leider in jedem Krieg gibt.\n\nDas würde ich bezweifeln. Die Japaner mögen ja Hitler als Verbündeten gehabt haben, aber sie waren nicht irre. Hitler war irre. Der hat seine Kapitulation mit einem Kopfschuss vollstreckt und die völlige Vernichtung Deutschlands befohlen.\n\nDie Befehlshaber der Japaner waren offensichtlich nicht vom selben Schlag. Sonst hätten sie ja nicht aufgegeben, oder?","replies":[{"poster":"clair de lune289","date":"2016-12-18T17:24:00.210+0000","up_votes":3,"down_votes":2,"body":"Der Vergleich mit der Prügelei passt mMn absolut nicht,da im Normallfall keiner der Beteiligten stirbt. Man sollte dennoch versuchen diese zu beenden allerdings ohne sich selbst einer Gefahr auszusetzen. \n\nWaren die Japan wirklich so viel sagen wir mal Vernünftiger als Hitler? sie mögen zwar keine KZ gehabt haben,aber wen man schon \"bereit\" ist das eigene Leben bzw das der untergebenen wegzuwerfen (Kamikazepiloten), finde ich es schwer zu sagen ob und wie verbissen die Japaner gekämpft hätten.\n\nwie bereits in jedem Beitrag zuvor schreibe ich es auch gern nochmal : Die Atombombe war in keinster weise gut,sie war genauso ein Kriegsverbrechen wie vieles andere. Dennoch finde ich die Aussage sie wäre mit den KZ gleichzusetzen nicht richtig.\nDas die Japaner den Krieg mit den USA selbst begonnen haben spielt dabei auch noch eine (zwar sehr gering) Rolle.\n\nWenn ich sagen das ich den Grund hinter der Atombombe versteh heißt das nicht das die Entscheidung dazu gerechtfertigt wäre.\nBei manchen Informationen bin ich mir auch nicht sicher wie viel Wahrheit in ihnen steck,denn die Geschichte wird bekanntlich von den \"Siegern\" geschrieben. \n\nNichts rechtfertigt jemals einen Krieg und die Schrecken die damit einhergehen. Selbst wen man sich sagt,das es \"richtig\" ist sich bei einem Angriff zu Verteidigen ,stellt sich die Frage \"wo hört Verteidigung auf und ab wann wird man der Agrressor\"","replies":[{"poster":"eingew","date":"2016-12-18T18:51:18.909+0000","up_votes":2,"down_votes":1,"body":"> Der Vergleich mit der Prügelei passt mMn absolut nicht,da im Normallfall keiner der Beteiligten stirbt. Man sollte dennoch versuchen diese zu beenden allerdings ohne sich selbst einer Gefahr auszusetzen.\n\nDer Krieg ist nun mal meistens eine Prügelei auf Leben und Tot.\n\nIch sage nur: Wenn Amerika *wirklich* Frieden wollte, dann hätten sie keine Armeen geschickt. Armeen bedeuten niemals Frieden, sondern immer nur Krieg. Wer wirklich glaubt, mit einer Atombombe oder auch einem Kamikazeflieger irgendetwas jenseits von Zerstörung zu bewirken, der hat offensichtlich nur beschränkte kognitive Kapazitäten, da ihm scheinbar ein grundsätzliches Verständnis dafür fehlt, dass die Menschheit vor allem deshalb existiert, weil sie gemeinsam überlebt hat. Über den Punkt, wo wir wie die Wölfe über Teile unseres Rudels herfallen, um stärker zu werden, sind wir längst hinaus, denn außer unserem Rudel gibt es nichts mehr auf der Welt. Wir müssen nichts mehr trainieren, um uns gegen andere Tiere zu behaupten.\n\n> Nichts rechtfertigt jemals einen Krieg und die Schrecken die damit einhergehen. Selbst wen man sich sagt,das es \"richtig\" ist sich bei einem Angriff zu Verteidigen ,stellt sich die Frage \"wo hört Verteidigung auf und ab wann wird man der Agrressor\"\n\nWomöglich ist meine Einstellung unrealistisch und idealistisch, aber ich denke, dass Verteidigung in Diplomatie besteht, nicht in Feuergefechten.\n\nAber darin stimmen wir wohl bereits überein.\n\nWas ich nur meine ist...\n\n> wie bereits in jedem Beitrag zuvor schreibe ich es auch gern nochmal : Die Atombombe war in keinster weise gut,sie war genauso ein Kriegsverbrechen wie vieles andere. Dennoch finde ich die Aussage sie wäre mit den KZ gleichzusetzen nicht richtig.\n\nIch finde es eigentlich falsch, darüber zu diskutieren, wer schlimmer war. Eigentlich finde ich diese ganzen Debatten darum ziemlich daneben. Weil dahinter meistens nur der Kindergartengedanke steckt, den wir hier im Forum so oft gegenüber Flamern breittreten müssen: \"Der war aber schlimmer als ich!\" Das ist bei dir offensichtlich nicht der Fall. Ich will aber prinzipiell nicht darüber reden wer schlimmer war. Mir ist es völlig egal, ob wir jetzt Hitler, Stalin, Mao tze Tung oder von mir aus auch Harry Truman auf Platz eins der Bösewichte dieser Welt stellen und in welcher Reihenfolge die Plätze dahinter belegt werden.\n\nDeshalb setze ich die Atombomben mit den KZs gleich. Sie gehören beide zur Kategorie: \"Überflüssige Grausamkeiten jeglicher Ordnung.\" Ich setze das gleich und sehe es gleichermaßen als verwerflich an.","replies":[{"poster":"clair de lune289","date":"2016-12-18T20:16:36.398+0000","up_votes":4,"down_votes":1,"body":"Ich denke damit ist so ziemlich alles gesagt. Das Entscheidende ist doch ,und darin sind wir uns ja einige, beides ist überflüssig und grausam.\n\nmMn ist es wichtig sich mit der Geschichte auseinanderzusetzen  und manchmal diskutiere ich einfach gern.","replies":[]},{"poster":"Ozuraak","date":"2016-12-22T14:27:27.689+0000","up_votes":1,"down_votes":3,"body":"Dir ist schon bewusst, das Japan diesen Krieg begeonnen hat oder?\n\nSOllte man im Hinterkopf behalten.","replies":[{"poster":"eingew","date":"2016-12-22T14:32:03.159+0000","up_votes":2,"down_votes":1,"body":"> Womöglich ist meine Einstellung unrealistisch und idealistisch, aber ich denke, dass Verteidigung in Diplomatie besteht, nicht in Feuergefechten.\n\nNatürlich ist es irgendwo logisch, dass man sich verteidigt und ich würde womöglich selbst nichts anderes tun, aber ich halte es dennoch für falsch. Ich bin davon überzeugt, dass absoluter Pazifismus die einzige sinnvolle Lebensweise für uns Menschen ist.","replies":[]}]}]}]},{"poster":"Ozuraak","date":"2016-12-22T14:26:46.783+0000","up_votes":1,"down_votes":3,"body":"https://de.wikipedia.org/wiki/Schlacht_um_Okinawa\n\nVon ca. 119.000 Mann gehen gerade mal 7.400 in Gefangenschaft.\n\nhttps://de.wikipedia.org/wiki/Schlacht_um_Iwojima\n\nVon ca. 21.000 Mann gehen gerade mal 1.100 in Gefangenschaft.\n\nZum Vergleich:\n\nhttps://de.wikipedia.org/wiki/Schlacht_um_Berlin\n\nVon ca. 1 Mio Soldaten gehen fast 500.000 Mann in Gefangenschaft.\n\nDie japanischen Soldaten haben sich so gut wie nie ergeben (das war in ihren Augen der Verlust der Ehre).\n\nBei einer Invastion der japanischen Hauptinsel musste man daher zwingend mit weiteren hunderttausend, vielleicht sogar Millionen Toten rechnen. Da sind zwei schnelle Schläge (so schlimm sie auch waren) eindeutig die bessere Lösung. \n\nUnd es ist ja wohl ein Unterschied ob man eine Stadt bombardiert um einen Krieg zu beenden, oder ob am Eroberungskriege führt.","replies":[{"poster":"eingew","date":"2016-12-22T14:43:04.606+0000","up_votes":2,"down_votes":1,"body":"> Bei einer Invastion der japanischen Hauptinsel musste man daher zwingend mit weiteren hunderttausend, vielleicht sogar Millionen Toten rechnen. Da sind zwei schnelle Schläge (so schlimm sie auch waren) eindeutig die bessere Lösung.\n\nIch weiß nicht, ob das nötig gewesen wäre. Amerika war stärker und Drohungen auf dieser Basis können eine starke Wirkung zeigen.\n\n> Und es ist ja wohl ein Unterschied ob man eine Stadt bombardiert um einen Krieg zu beenden, oder ob am Eroberungskriege führt.\n\nWenn man über den Grad der Wirkung spricht durchaus. Ich bin aber der Meinung, dass jede negative Wirkung bereits *zu* negativ ist. Ich bin mir auch bewusst, dass man als Staatschef gerade in einer so schwierigen Zeit diesen hohen Ansprüchen seltenst gerecht werden kann. Dennoch gibt es keinen Grund, dem in irgendeiner Weise eine Ermutigung zukommen zu lassen. Es ist und bleibt zu verurteilen. Wenn Menschen sterben, gibt es immer nur Gründe, aber niemals Rechtfertigungen. Denn es widerspricht dem Grund unserer Existenz, das gegenseitige Überleben zu gefährden und zu verhindern.\n\nEs sollte im Gegenteil die höchste Priorität unser aller sein, für das Überleben und die Entwicklung unserer Rasse und unseres Lebensumfelds Sorge zu tragen.","replies":[{"poster":"Ozuraak","date":"2016-12-22T14:53:32.133+0000","up_votes":1,"down_votes":1,"body":"Das amerikansiche Militär wollte in erster Linie eigene Soldaten schützen. Diese Ansicht ist grundsätzlich erstmal legitim. \n\nZweitens, zeigen die von mir gewählten Beispiele, dass die japanische Armee nicht nach der gleichen Logik kämpfte, wie die amerikanische, die britische, die sowjetische, die deutsche, die französische oder die italiensche Armee.\n\nAll diese Armeen haben sich in aussichtloser Lage ergeben. Hunderttausende, Millionen Soldaten gingen auf dem europäischen und nordafrikanischen Kriegsschauplatz in die Kriegsgefangenschaft des Gegners.\n\nDie Japaner haben dies nicht getan. Gefagengennahme galt als Ehrverlust. Man hatte für Volk, Vaterland und Kaiser zu siegen oder zu sterben. \n\nUnter dieser Prämisse kann man nicht verlangen, seinen Soldaten einer Gefahr auszusetzen, wenn man auch eine Waffe hat, die diesen Krieg massiv verkürzen kann.\n\nZumal bei einer Invasion der japanischen Hauptinsel nicht nur amerikansichen und japanischen Soldaten sterben würden, sondern auch hunderttausende japanischen Zivilisten.\n\nDie A-Bomben haben letztendlich (so schrecklich sie auch waren) mehr Menschen gerettet als getötet.","replies":[]}]}]}]}]},{"poster":"Ozuraak","date":"2016-12-22T14:22:48.766+0000","up_votes":1,"down_votes":3,"body":"Dir ist bewusst, dass Hiroshima und Nagasaki seit Jahrzehnten wieder lebendige Großstädte sind?\n\nNichts mit großer Verseuchung und so. Und nicht vergessen, wer den Krieg im Pazifik begonnen hat (und zwar shcon 1937) der Millionen von Zivilisten (vorallem in China) das Leben gekostet hat.\n\nAber Japan hat es gut geschafft, sich nach dem 2 WK als Opfer darzustellen, obwohl sie in Asien der Täter waren.\n\nDiese Propaganda hat ja auch bei dir gefruchtet, wenn man sich deine KOmmentare so durchliest.","replies":[{"poster":"eingew","date":"2016-12-22T14:44:23.353+0000","up_votes":2,"down_votes":1,"body":"Jeder, der an einem Krieg teilnimmt ist auch Teil der Opfer.","replies":[{"poster":"Ozuraak","date":"2016-12-22T14:48:27.118+0000","up_votes":1,"down_votes":3,"body":"Gut nach der Logik gibt es nie Täter.\n\nDiese Meinung darfst du haben, ich teile sie nicht.","replies":[{"poster":"eingew","date":"2016-12-22T14:50:46.424+0000","up_votes":2,"down_votes":1,"body":"Inwiefern schließt das eine das andere aus? Man kann sowohl Täter als auch Opfer sein im Leben und das kann sich durchaus auch in derselben Situation überschneiden.","replies":[{"poster":"Ozuraak","date":"2016-12-22T14:55:03.770+0000","up_votes":1,"down_votes":2,"body":"Das japanische Kaiserreich hat ohne Not und Notwendigkeit seine Nachbarstaaten überfallen und die Zivilisten in den Länder brutal unterdrückt und zu Millionen ermordet.\n\nEs tut mir leid, aber Japan war kein Opfer im zweiten Weltkrieg, auch nicht durch die A-Bomben. Das hat sich Japan selbst zuzuschreiben.","replies":[]}]}]}]}]}]}]}]},{"poster":"Waldschrat86","date":"2016-12-17T15:15:48.044+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=clair de lune289,realm=EUW,application-id=KYnfKGf0,discussion-id=O6QeEzy1,comment-id=00050000,timestamp=2016-12-17T13:11:50.080+0000)\n>\n> sry aber bei der Atombombe gab es wenigstens einen Sinn+Grund dahinter dem man verstehen kann im Gegensatz zu dem was Deutschland im 2WK getan hat.\n\nLetztens ne Doku gesehen, die genau um Sinn und Grund der A-Bomben Abwürfe ging.\nDa wurde herausgearbeitet, dass die Amerikaner unbedingt eine bedingungslose Kapitulation wie in Europa erreichen wollten und von dieser Forderung keinen mm zurückwichen. Der Kaiser wäre auch vor den Bomben zur Kapitulation bereit gewesen, hatte aber eine Bedingung, welche die USA nicht bereit war zu billigen. Dann kamen die Bomben, doch auch dann war der Kaiser nicht dazu bereit.\nDanach gingen die USA auf die Bedingung ein und es wurde kapituliert.\nDie Bedingung war übrigens der Erhalt des Kaiserhauses...","replies":[{"poster":"Ozuraak","date":"2016-12-22T14:29:41.323+0000","up_votes":1,"down_votes":3,"body":"Eine Nation (Japan) die gegen seine Nachbarstaaten einen brutalen Eroberungskrieg führt und ca. 10-15 Mio. Menschen getötet hat, hat keine Bedinungen zu stellen.\n\nWie man hier die Täter des Pazifikrieges verteidigt, ist regelrecht ekelhaft.\n\nSchonmal was vom Massaker von Naniking gehört? Da starben mehr Zivilisten als in Hiroshima und Nagasaki addiert.\n\nOder was von der Einheit 731 gehört? Die hat schlimmste Menschenversuche durchgeführt und Biowaffen in China eingesetzt.\n\nAber alle Welt glaubt das Märchen vom \"Opfer\" Japan. Japan war der Täter in Ostasien.","replies":[{"poster":"Waldschrat86","date":"2016-12-22T16:00:57.204+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Ozuraak,realm=EUW,application-id=KYnfKGf0,discussion-id=O6QeEzy1,comment-id=0005000000010001,timestamp=2016-12-22T14:29:41.323+0000)\n>\n> Eine Nation (Japan) die gegen seine Nachbarstaaten einen brutalen Eroberungskrieg führt und ca. 10-15 Mio. Menschen getötet hat, hat keine Bedinungen zu stellen.\n\nHachja die verkohlten Babies interessiert es sicher, was ihre \"Nation\" so getan hat, dich auch, wenn dir einer ne Knarre an den Kopf hält und abdrückt, weil du halt zur Nation gehörst.\n> \n> Wie man hier die Täter des Pazifikrieges verteidigt, ist regelrecht ekelhaft.\n\nKeine Sau verteidigt hier \"Täter\"\n> \n> Schonmal was vom Massaker von Naniking gehört? Da starben mehr Zivilisten als in Hiroshima und Nagasaki addiert.\n\nUnd? Schonmal was von xyz gehört? Weißt du was spucken auf die Opfer ist? Aber der war schlimmer...\n\n> \n> Oder was von der Einheit 731 gehört? Die hat schlimmste Menschenversuche durchgeführt und Biowaffen in China eingesetzt.\n\nNö. Aber keine Ahnung, was das für eine Rolle spielt. Dass das imperiale Japan kein Waisenknabe in Sachen Kriegsverbrechen und Co. war hat niemand bestritten. \n> \n> Aber alle Welt glaubt das Märchen vom &quot;Opfer&quot; Japan. Japan war der Täter in Ostasien.\n\nDas glaubt hier keiner und hat auch keiner behauptet. Es ging ja darum, ob diese DokuMärchen erzählt oder eben näher an derWahrheit ist als die Version, wir mussten, um Bodentruppen zu vermeiden.\nAber wenn man glaubt, USA hätte im Krieg nur das gute für Welt gewollt und sei sakrosankt, weil die anderen schlimmer und menschenverachtender waren, glaubt wohl tatsächlich gern an Märchen.\nLass doch die Version stimmen, dass es unnötig war, macht das in irgendeinerweise die Taten der Japaner oder Nazis weniger schlimm?\nNein!","replies":[{"poster":"Ozuraak","date":"2016-12-22T18:21:47.523+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Waldschrat86,realm=EUW,application-id=KYnfKGf0,discussion-id=O6QeEzy1,comment-id=00050000000100010001,timestamp=2016-12-22T16:00:57.204+0000)\n>\n> Hachja die verkohlten Babies interessiert es sicher, was ihre &quot;Nation&quot; so getan hat, dich auch, wenn dir einer ne Knarre an den Kopf hält und abdrückt, weil du halt zur Nation gehörst.\n\nAchso, in Hiroshima und Nagasaki gab es nur Babies. Gut zu wissen. \n\n> Keine Sau verteidigt hier &quot;Täter&quot;\n\nWer hier einseitig die USA kritisiert, wegen der A-Bomben, aber die komplette Vorgeschichte, die dazu geführt hat, ignoriert, doch genau der verteidigt Täter.\n\n> Und? Schonmal was von xyz gehört? Weißt du was spucken auf die Opfer ist? Aber der war schlimmer...\n\nSchon mal was von Kausalität gehört? Jede Aktion erzeugt eine Reaktion. Oder glaubst du, die USA haben die A-Bombe abgeworfen, weil sie gerade Langeweile hatten?\n\nDie Japaner haben diesen Krieg im Pazifik begonnen, wesentlich brutaler geführt als alle andere beteiligten Kriegsparteien und bekommen, was sie verdient haben.\n\n> Nö. Aber keine Ahnung, was das für eine Rolle spielt. Dass das imperiale Japan kein Waisenknabe in Sachen Kriegsverbrechen und Co. war hat niemand bestritten. \n\nAktion>Reaktion. \n\n> Das glaubt hier keiner und hat auch keiner behauptet. Es ging ja darum, ob diese DokuMärchen erzählt oder eben näher an derWahrheit ist als die Version, wir mussten, um Bodentruppen zu vermeiden.\n\nDiese Doku erzählt Märchen. Mit den zwei Schlachten (Okinawa und Iwo Jima) kann man beweisen, dass die Bomben nötig waren.\n\n> Aber wenn man glaubt, USA hätte im Krieg nur das gute für Welt gewollt und sei sakrosankt, weil die anderen schlimmer und menschenverachtender waren, glaubt wohl tatsächlich gern an Märchen.\n\nNö das habe ich nie behauptet. Aber im Vergleich zu den Japanern waren die USA im 2WK Chorknaben. Und anders als die Japaner haben die USA für ihre Freiheit, statt für Unterdrückung gekämpft.\n\nWenn der eigenen moralischen Kompass noch funktioniert, kann man erkennen, was davon ein legitimer Grund ist zu kämpfen und was nicht.\n\n> Lass doch die Version stimmen, dass es unnötig war, macht das in irgendeinerweise die Taten der Japaner oder Nazis weniger schlimm?\n> Nein!\n\nNur macht es die Version auch nicht wahrer. Die Bomben waren a) notwendig und b) waren ihre Abwürfe auch richtig.","replies":[{"poster":"Waldschrat86","date":"2016-12-22T20:19:35.117+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Ozuraak,realm=EUW,application-id=KYnfKGf0,discussion-id=O6QeEzy1,comment-id=000500000001000100010000,timestamp=2016-12-22T18:21:47.523+0000)\n>\n> Achso, in Hiroshima und Nagasaki gab es nur Babies. Gut zu wissen. \n\nNein, aber auch du Schlaumeier und nach deiner Auffassungsind das dann ja auch Täter, weil sie leider in die falsche Nation geboren sind.\n\n> \n> Wer hier einseitig die USA kritisiert, wegen der A-Bomben, aber die komplette Vorgeschichte, die dazu geführt hat, ignoriert, doch genau der verteidigt Täter.\n\nIch bin nicht hier, um historische Abhandlungen zu schreiben, ganz ehrlich, komm mal klar. Wo willst du denn bei komplett anfangen?\n\n> \n> Schon mal was von Kausalität gehört? Jede Aktion erzeugt eine Reaktion. Oder glaubst du, die USA haben die A-Bombe abgeworfen, weil sie gerade Langeweile hatten?\n\nTut mir leid für dich, dass es in der Geschichte offene Fragen gibt und das einzige, was ich hier dazu eingebracht habe war, dass es da eben auch mittlerweile andere Erkenntnisse gibt, die mal nicht aus der revanchistischen Ecke kommen, sondern der seriösen Forschung.\n\n> \n> Die Japaner haben diesen Krieg im Pazifik begonnen, wesentlich brutaler geführt als alle andere beteiligten Kriegsparteien und bekommen, was sie verdient haben.\n> \n> Aktion&gt;Reaktion. \n\nDu bist so nah dran an deren Ideologie das ist unfassbar. Weißt du es geht hier immer noch um Menschen, das ist nicht wie C&C oder Risiko. Echt widerlich wie du drauf bist.\n\n> \n> Diese Doku erzählt Märchen. Mit den zwei Schlachten (Okinawa und Iwo Jima) kann man beweisen, dass die Bomben nötig waren.\n\nLol, was willst du damit beweisen, wenn die Quellen etwas anderes sagen und echt sind? Weißt du in der Geschichtswissenschaft gibt es sowas wie neue Forschungsergebnisse, da brechen öfters mal alte Thesen ein. Prüfs halt nach, wenn es dir so wichtig ist.\n\n> \n> Nö das habe ich nie behauptet. Aber im Vergleich zu den Japanern waren die USA im 2WK Chorknaben. Und anders als die Japaner haben die USA für ihre Freiheit, statt für Unterdrückung gekämpft.\n\nJa, hm da hätte ich einen Gegenbeweis mit derselben Aussagekraft wie deine Schlachten oben. Eisenhower hat Flugezettel verteilen und abwerfen lassen, auf denen stand: Wir kommen nicht als Befreier, sondern Eroberer. Fall abgeschlossen, wenn man deiner Argumentation folgt.\n\n> \n> Wenn der eigenen moralischen Kompass noch funktioniert, kann man erkennen, was davon ein legitimer Grund ist zu kämpfen und was nicht.\n\nJo, aber wenn man die Mittel über den Zweck stellt, routiert die Nadel aber gewaltig.\n\n> \n> Nur macht es die Version auch nicht wahrer. Die Bomben waren a) notwendig und b) waren ihre Abwürfe auch richtig.\n\nAch warst du dabei? Haste die Akten gewälzt? Just 4 Info, die Quellen der Doku, waren bis vor einiger Zeit noch gar nicht freigegeben.\nWie schon gesagt, müsste man überprüfen wie valide der Ansatz des Forschers da war.\nAber sich hinzustellen und zu sagen stimmt nicht, weil ich nur die alte und geläufige Forschungsmeinung kenne, ist einfach nur daneben.","replies":[{"poster":"Ozuraak","date":"2016-12-23T06:52:14.837+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Waldschrat86,realm=EUW,application-id=KYnfKGf0,discussion-id=O6QeEzy1,comment-id=0005000000010001000100000001,timestamp=2016-12-22T20:19:35.117+0000)\n>\n> Nein, aber auch du Schlaumeier und nach deiner Auffassungsind das dann ja auch Täter, weil sie leider in die falsche Nation geboren sind.\n\nKollateralschaden. Wer mit Hurra in den Krieg zieht, darf nicht hinterher seine eigenen Kinder (die man ja unverantwortlicher Weise mit in den Krieg gezogen hat) beweinen.\n\nIch sage es ganz deutlich. Die Kinder in Nanking (China) 1937 sind mir in dem Zusammenhang wichtiger, als die Kinder in Hiroshima und Nagasaki 1945.\n\n> Ich bin nicht hier, um historische Abhandlungen zu schreiben, ganz ehrlich, komm mal klar. Wo willst du denn bei komplett anfangen?\n\nDann sollte man sich zu historischen Zusammenhängen halt zurückhalten.\n\n> Tut mir leid für dich, dass es in der Geschichte offene Fragen gibt und das einzige, was ich hier dazu eingebracht habe war, dass es da eben auch mittlerweile andere Erkenntnisse gibt, die mal nicht aus der revanchistischen Ecke kommen, sondern der seriösen Forschung.\n\nAchso, alle Historiker, die die A-Bomben-Abwürfe für richtig halten kommen aus der „revanchistischen“ Ecke und alle anderen betreiben seriöse Forschung. \n\nSolides Weltbild.\n\n> Du bist so nah dran an deren Ideologie das ist unfassbar. Weißt du es geht hier immer noch um Menschen, das ist nicht wie C&amp;C oder Risiko. Echt widerlich wie du drauf bist.\n\nMenschen, die selbst verantwortlich sind für ihr Schicksal. Wer nicht will, dass die eigenen Städte bombardiert werden, soll halt keinen Krieg anfange. \n\nDie Schuld liegt bei Japan, nicht bei den USA.\n\n> Lol, was willst du damit beweisen, wenn die Quellen etwas anderes sagen und echt sind? Weißt du in der Geschichtswissenschaft gibt es sowas wie neue Forschungsergebnisse, da brechen öfters mal alte Thesen ein. Prüfs halt nach, wenn es dir so wichtig ist.\n\nMuss ich nicht, ich bin da auf recht aktuellem Stand. \n\n> Ja, hm da hätte ich einen Gegenbeweis mit derselben Aussagekraft wie deine Schlachten oben. Eisenhower hat Flugezettel verteilen und abwerfen lassen, auf denen stand: Wir kommen nicht als Befreier, sondern Eroberer. Fall abgeschlossen, wenn man deiner Argumentation folgt.\n\nAktion>Reaktion. Entkräftet nicht die Tatsache, dass Japan diesen Krieg begonnen hat. \n\n> Jo, aber wenn man die Mittel über den Zweck stellt, routiert die Nadel aber gewaltig.\n\nEigentlich nicht. Durch die A-Bombe sind weniger japanischen Zivilisten gestorben, als durch eine Hauptinvasion gestorben wären.\n\nInsofern war die A-Bombe auch für Japan gut. Eine Win-Win-Situation sozusagen :D \n\n> Ach warst du dabei? Haste die Akten gewälzt? Just 4 Info, die Quellen der Doku, waren bis vor einiger Zeit noch gar nicht freigegeben.\n\nAchso und diese eine Doku hat die Wahrheit gepachtet? Ich verneige mich vor dieser Wahrheit.\n\n> Wie schon gesagt, müsste man überprüfen wie valide der Ansatz des Forschers da war. Aber sich hinzustellen und zu sagen stimmt nicht, weil ich nur die alte und geläufige Forschungsmeinung kenne, ist einfach nur daneben.\n\nDer Vorwurf, die A-Bombe war unnötig ist aber so alt, wie der A-Bomben Abwurf selbst. Nichts neue Erkenntnis.","replies":[{"poster":"Waldschrat86","date":"2016-12-23T14:40:03.290+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Ozuraak,realm=EUW,application-id=KYnfKGf0,discussion-id=O6QeEzy1,comment-id=00050000000100010001000000010000,timestamp=2016-12-23T06:52:14.837+0000)\n>\n> Kollateralschaden. Wer mit Hurra in den Krieg zieht, darf nicht hinterher seine eigenen Kinder (die man ja unverantwortlicher Weise mit in den Krieg gezogen hat) beweinen.\n> \n> Ich sage es ganz deutlich. Die Kinder in Nanking (China) 1937 sind mir in dem Zusammenhang wichtiger, als die Kinder in Hiroshima und Nagasaki 1945.\n\nMir ist herzlich egal, um welche Kinder es geht. Wie gesagt viel Spaß mit deiner Meinung, wenn dein Land mal wieder böses tun sollte und dann der \"Retter\" deine Meinung vertritt.\n\n> \n> Dann sollte man sich zu historischen Zusammenhängen halt zurückhalten.\n\nDu denkst du bist so gutmenschlich und rennst dabei soweit nach links, dass du rechts wieder rausgekommen bist.\n\n> \n> Achso, alle Historiker, die die A-Bomben-Abwürfe für richtig halten kommen aus der „revanchistischen“ Ecke und alle anderen betreiben seriöse Forschung. \n\nHab ich nie behauptet, aber du kanzelst ja alles ohne Grundlage einfach als Märchen ab, was der langläufigen Meinung widerspricht. Wisch dir mal den Schaum ab. Im Endeffekt kam ich dir da mit Verständnis entgegen, weil die meisten Erkenntnisse/Meldung aus der Ecke \"Amis ist böse\" aus der revanchistischen rechten kommen.\n\n> \n> Solides Weltbild.\n\nSprach der Faschist, der Lebenswertigkeit von Nation abhängig macht.\n\n> \n> Menschen, die selbst verantwortlich sind für ihr Schicksal. Wer nicht will, dass die eigenen Städte bombardiert werden, soll halt keinen Krieg anfange. \n\nWieder widerwertig, menschenverachtend. Mal ne Frage, das Ding da drüben war fast ne absolutistische Monarchie und wie du selbst sagst verbrecherisch. Was hätte der Normalojapaner denn tun können, um den Krieg zu verhindern, außer hingehn und sich wegen Verrat abknallen lassen?\n\n> \n> Die Schuld liegt bei Japan, nicht bei den USA.\n\nDie Kriegsschuld ja und weiter? Hat immer noch keiner bestritten.\n\n> \n> Muss ich nicht, ich bin da auf recht aktuellem Stand. \n\nGottkomplex.\n\n> \n> Aktion&gt;Reaktion. Entkräftet nicht die Tatsache, dass Japan diesen Krieg begonnen hat. \n\nHat immer noch keiner bestritten.\n\n> \n> Eigentlich nicht. Durch die A-Bombe sind weniger japanischen Zivilisten gestorben, als durch eine Hauptinvasion gestorben wären.\n\nJo liest du eigentlich? Hast du überhaupt gelesen? Scheint nicht so, denn es ging nicht um Option A oder B, was dein Stand ist, sondern um die Möglichkeit von C. Denn auch das hat hier niemand verneint, auch nicht, dass das so passt, wenn es C nicht gab. Die Doku hat einfach nur einen Blick auf C gerichtet, das war interessant, nachvollziehbar, aber auch anzweifelbar, aber ganz sicher nicht einfach abzukanzeln wie du es hier die ganze Zeit tust.\n\n> \n> Insofern war die A-Bombe auch für Japan gut. Eine Win-Win-Situation sozusagen :D \n\nDeinen Faschosmiley kannst du dir sparen. Aber genau das war im Endeffekt die Fragestellung der Doku.\n \n\n> Achso und diese eine Doku hat die Wahrheit gepachtet? Ich verneige mich vor dieser Wahrheit.\n\nNö, aber da du ja scheinbar nicht liest, schreibe ichs ein drittes oder sogar schon 4. oder 5. Mal und versuche so einfach wie möglich zu erklären: Sie setzt einen neuen Blick auf den Abwurf. Dabei ging es 0 um die Frage, die dir hier als einzigem so wichtig erscheint, der Schuld, sondern vielmehr um den Blickwinkel. Dein bzw. der langläufige Blickwinkel ist der des US-Militärs, die Doku richtete den Blick aufs Kaiserhaus. Da sind dann Dokumente aufgetaucht, die beweisen (wenn sie denn echt sind-den Einschub hab ich übrigens öfters gemacht und du kommst an mit Wahrheit gepachtet und bist dabei der einzige, der sich so verhält hier), dass es Kapitulationsangebote vor den Abwürfen gab, deren einzige Bedingung eben auch nach Abwurf der Bomben erfüllt wurde und deshalb sollen sie unnötig gewesen sein. Desweiteren, soll es Korrespondenzen geben, die beweisen, dass der Kaiser eben auch noch nach den Bomben an der Nichtkapitulation festhielt und eben erst kapitulierte als der Ami demErhalt des Kaiserhauses zustimmte, aber er hätte sogar eben unter genau dieser Bedingung schon Monate und wohl hunderte Kampfhandlungen vor dem Abwurf kapituliert.\n\n> \n> Der Vorwurf, die A-Bombe war unnötig ist aber so alt, wie der A-Bomben Abwurf selbst. Nichts neue Erkenntnis.\n\nVlt. kommst du jetzt auf den Trichter, was ich mit revanchistische Ecke meinte, zu dem diese Erkenntnis der Doku eben nicht zu zählen ist.","replies":[]},{"poster":"eingew","date":"2016-12-23T10:20:06.243+0000","up_votes":2,"down_votes":1,"body":"> Kollateralschaden. Wer mit Hurra in den Krieg zieht, darf nicht hinterher seine eigenen Kinder (die man ja unverantwortlicher Weise mit in den Krieg gezogen hat) beweinen.\n> \n> Ich sage es ganz deutlich. Die Kinder in Nanking (China) 1937 sind mir in dem Zusammenhang wichtiger, als die Kinder in Hiroshima und Nagasaki 1945.\n\nDeshalb sollte man als Gegner unbedingt auf das Niveau fallen, welches man bekämpft und diesen \"Kollateralschaden\" mit einer Handbewegung wegwischen.\n\nIch wiederhole nochmal, was ich von Anfang an gesagt habe:\n\nDiese Argumentation ist egoistisch und vor allem *scheinheilig*. Das Problem bei Egoismus ist auch die Egozentrik, und wer egozentrisch ist, ist offensichtlich schlicht nicht in der Lage die volle Auswirkung seines Handelns zu verstehen. Wenn man amerikanische Handlungen nur mit Amerika im Zentrum sieht, fällt es leicht das ganze zu verteidigen.\n\nIch verstehe nicht, wie man das ganze so wenig reflektieren kann.\n\n> Achso, alle Historiker, die die A-Bomben-Abwürfe für richtig halten kommen aus der „revanchistischen“ Ecke und alle anderen betreiben seriöse Forschung.\n> \n> Solides Weltbild.\n\nDein Weltbild ist doch nur andersrum, du verurteilst die, die die Abwürfe für falsch halten. Du folgst exakt demselben Grundprinzip.\n\n> Menschen, die selbst verantwortlich sind für ihr Schicksal. Wer nicht will, dass die eigenen Städte bombardiert werden, soll halt keinen Krieg anfange.\n> \n> Die Schuld liegt bei Japan, nicht bei den USA.\n\nUnd eine Kollektivschuld ist deswegen eine sinnvolle Ansichtsweise? Ich glaube Waldschrat hat völlig recht, das hier ist *wirklich* kein Computerspiel. Wie kannst du dir anmaßen, all den Menschen dort eine Kollektivschuld anzulasten? Deine Behauptungen, sie hätten bekommen, was sie verdienen, weil sie zufällig dieselbe Nationalität haben oder zufällig von deren Truppen verschleppt wurden, ist mehr als unrealistisch. Ich glaube du hast ein Problem damit, die das Grundprinzip zu verstehen, was hier verteidigt wird. Es geht nicht darum, jemandem mehr oder weniger zu blamen oder irgendjemanden zu verteidigen. Es geht darum zu sagen, dass Krieg per se ekelhaft ist und auch der Abwurf der Atombomben damit zu verurteilen ist.","replies":[{"poster":"Ozuraak","date":"2016-12-23T10:37:22.799+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=O6QeEzy1,comment-id=000500000001000100010000000100000000,timestamp=2016-12-23T10:20:06.243+0000)\n>\n> Deshalb sollte man als Gegner unbedingt auf das Niveau fallen, welches man bekämpft und diesen &quot;Kollateralschaden&quot; mit einer Handbewegung wegwischen.\n\nKorrekt. \n\n> Ich wiederhole nochmal, was ich von Anfang an gesagt habe:\n> \n> Diese Argumentation ist egoistisch und vor allem *scheinheilig*. Das Problem bei Egoismus ist auch die Egozentrik, und wer egozentrisch ist, ist offensichtlich schlicht nicht in der Lage die volle Auswirkung seines Handelns zu verstehen. Wenn man amerikanische Handlungen nur mit Amerika im Zentrum sieht, fällt es leicht das ganze zu verteidigen.\n\nTue ich nicht, ich habe (mehr als einmal) die komplette Vorgeschichte dazu in einen Kontext gestellt. Im Gegenteil seid es eher ihr, die nur die A-Bombe völlig isoliert betrachtet, so als hätte es nie eine Vorgeschichte gegeben. \n \n> Ich verstehe nicht, wie man das ganze so wenig reflektieren kann.\n\nDas frage ich mich auch.\n\n> Dein Weltbild ist doch nur andersrum, du verurteilst die, die die Abwürfe für falsch halten. Du folgst exakt demselben Grundprinzip.\n\nWeil ich die stärkeren Argumente habe.\n\n> Und eine Kollektivschuld ist deswegen eine sinnvolle Ansichtsweise? Ich glaube Waldschrat hat völlig recht, das hier ist *wirklich* kein Computerspiel. Wie kannst du dir anmaßen, all den Menschen dort eine Kollektivschuld anzulasten? Deine Behauptungen, sie hätten bekommen, was sie verdienen, weil sie zufällig dieselbe Nationalität haben oder zufällig von deren Truppen verschleppt wurden, ist mehr als unrealistisch. Ich glaube du hast ein Problem damit, die das Grundprinzip zu verstehen, was hier verteidigt wird. Es geht nicht darum, jemandem mehr oder weniger zu blamen oder irgendjemanden zu verteidigen. Es geht darum zu sagen, dass Krieg per se ekelhaft ist und auch der Abwurf der Atombomben damit zu verurteilen ist.\n\nKlar ist Krieg ekelhaft, aber das gilt vorallem für den Angreifer, nicht für den Verteidiger.\n\nDeshalb ist nach internationalem Recht auch völlig klar, dass der Angriffskrieg verboten, der Verteidigungskrieg  erlaubt ist.\n\nUnd die A-Bombe-Abwürfe sind nicht zu verurteilen, sondern zu begrüßen. Sie haben den Krieg verkürzt und allen beteiligten Kriegsparteien in Ostasien viel mehr Leid und Tote erspart, als sie gebracht haben.\n\nLieber ein Ende mit Schrecken, als Schrecken ohne Ende.","replies":[{"poster":"clair de lune289","date":"2016-12-23T16:05:03.072+0000","up_votes":3,"down_votes":1,"body":"Ich wollte mich in diesem Thema eigentlich nicht mehr einmischen da die Diskussion etwas zu sehr aus dem Ruder lief für ein Spieleforum.\n\nDie A-Bombenabwürfe zu begrüßen und von Kollektivschuld zu sprechen halte ich im besten Fall für besorgniserregend wen nicht sogar gefährlich.\n\nNiemand , absolut Niemand ist dafür verantwortlich was ein andere tut oder getan hat, nur weil er in der Nähe , im gleichen Land oder als Blutsverwandter geboren wurde.\nAuch ein Soldat hat die **_PFLICHT!_**bestimmt Befehle zumindest in zweifel zu ziehen","replies":[]},{"poster":"Waldschrat86","date":"2016-12-23T14:56:19.553+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Ozuraak,realm=EUW,application-id=KYnfKGf0,discussion-id=O6QeEzy1,comment-id=0005000000010001000100000001000000000000,timestamp=2016-12-23T10:37:22.799+0000)\n>\n\n> Tue ich nicht, ich habe (mehr als einmal) die komplette Vorgeschichte dazu in einen Kontext gestellt. Im Gegenteil seid es eher ihr, die nur die A-Bombe völlig isoliert betrachtet, so als hätte es nie eine Vorgeschichte gegeben. \n\nBlöd nur, dass die komplette Vorgeschichte (immer noch im welchen Jahr magst du denn beginnen? Ich verlang dann auch die Vorgeschichte zu deinem Beginn, usw.) bei der Fragestellung gänzlich irrelevant ist, die einfach nur lautet: Gab es neben Option A (Invasion) und B (Abwurf) noch Option C (Zugeständnis an den Kaiser, das nach dem Abwurf ohnehin gemacht wurde, da dieser trotz(!) Hiroshima/Nagasaki ohne nicht bereit war zu kapitulieren/These der Doku).\n\n> \n> Das frage ich mich auch.\n\nDann fang mal an und schneid dir ein paar Scheiben bei eingew ab.\n> \n\n> Weil ich die stärkeren Argumente habe.\n\nDu hast noch nichtmal die Fragestellung kapiert, verteidigst Dinge, die keiner hier angegriffen hat, aber klar, deine Argumente, sind echt stärker. rofl\n\n> \n> Klar ist Krieg ekelhaft, aber das gilt vorallem für den Angreifer, nicht für den Verteidiger.\n\nAha\n> \n> Deshalb ist nach internationalem Recht auch völlig klar, dass der Angriffskrieg verboten, der Verteidigungskrieg  erlaubt ist.\n\nSchau mal nach, seit wann Angriffskriege \"verboten\" sind, kannst dann auch gleich mal schauen, was nicht so alles schon vorher und nachher getan wurde, um Angriffskriege zu verschleiern. Hat übrigens immer noch nichts mit der Sache zu tun, um die es hier geht.\n\n> \n> Und die A-Bombe-Abwürfe sind nicht zu verurteilen, sondern zu begrüßen. Sie haben den Krieg verkürzt und allen beteiligten Kriegsparteien in Ostasien viel mehr Leid und Tote erspart, als sie gebracht haben.\n> \n> Lieber ein Ende mit Schrecken, als Schrecken ohne Ende.\n\nTja und was, wenn ein Ende ohne weiteren Schrecken für beide möglich gewesen wäre? Das war ja die Frage.\nIgnorieren, um im Recht zu bleiben?","replies":[]},{"poster":"eingew","date":"2016-12-23T12:51:18.534+0000","up_votes":3,"down_votes":1,"body":"> Tue ich nicht, ich habe (mehr als einmal) die komplette Vorgeschichte dazu in einen Kontext gestellt. Im Gegenteil seid es eher ihr, die nur die A-Bombe völlig isoliert betrachtet, so als hätte es nie eine Vorgeschichte gegeben.\n\nWas ist mit dem kalten Krieg, für den die Atombombe eine Demonstration der Stärke war?\n\nEs gab nun mal einen Haufen Tote. Ich halte es für unsinnig, das einfach so als toll zu betrachten. Tod und Zerstörung ist niemals gut. Höchstens in der Situation notwendig.\n\n> Weil ich die stärkeren Argumente habe.\n\nTeilweise. Aber die von dir propagierte Kollektivschuld halte ich nicht gerade für ein starkes Argument, eher für Irrsinn.\n\n> die A-Bombe-Abwürfe sind nicht zu verurteilen, sondern zu begrüßen\n\n> Lieber ein Ende mit Schrecken, als Schrecken ohne Ende.\n\nBei dir hört sich das aber eher an wie \"Schrecken ist toll, wenn sich die verschreckten vorher als halbwegs schrecklich dargestellt haben\", wenn du da von \"begrüßen\" sprichst. Ich empfinde das als blutrünstig.\n\nMan kann das als notwendig betrachten. Aber als gut? Morde sind niemals gut.","replies":[]}]}]}]}]},{"poster":"eingew","date":"2016-12-22T19:25:26.154+0000","up_votes":2,"down_votes":1,"body":"> Wer hier einseitig die USA kritisiert, wegen der A-Bomben, aber die komplette Vorgeschichte, die dazu geführt hat, ignoriert, doch genau der verteidigt Täter.\n\nDu ignorierst allerdings, dass es hier nicht um eine geschichtliche Aufarbeitung der Gesamtsituation ging, sondern ausschließlich um die Erwähnung der Atombomben seitens Schroppel. Und die Japaner haben nun mal keine Atombomben geworfen. Das heißt nicht, dass sie sonst nichts getan haben. Das heißt nur, dass sie keine Atombomben hatten.\n\nWie gesagt, ich sehe hier vor allem Argumente gegen den Krieg. Wenn man den einen anklagt, heißt das nicht, dass man den anderen nicht auch anklagt. Und es ist nicht sachlich, einfach so darauf zu schließen.\n\n> Schon mal was von Kausalität gehört? Jede Aktion erzeugt eine Reaktion. Oder glaubst du, die USA haben die A-Bombe abgeworfen, weil sie gerade Langeweile hatten?\n> \n> Die Japaner haben diesen Krieg im Pazifik begonnen, wesentlich brutaler geführt als alle andere beteiligten Kriegsparteien und bekommen, was sie verdient haben.\n\nVerdient? Sie haben das verdient?\n\nHast du mir nicht eben geschrieben, dass das \"leider\" getan werden musste? Klingt inkonsistent.\n\nAußerdem kann ich dir mit 99%iger Gewissheit sagen, dass dein zugrunde liegendes Konzept der Kollektivschuld hier nicht funktioniert, selbst wenn Wikipedia mit der Behauptung, dass ein Großteil der Toten gefangene Zwangsarbeiter waren, falsch liegen sollte. Das waren Städte mit Zivilbevölkerung, zu vermuten, dass die Frauen und Kinder dort ausnahmslos eine positive Meinung vom Krieg hatten und womöglich sogar aktiv zum Kampf beigetragen haben ist absurd.\n\n> Diese Doku erzählt Märchen. Mit den zwei Schlachten (Okinawa und Iwo Jima) kann man beweisen, dass die Bomben nötig waren.\n\nWie? Ich will ja nicht den Miesepeter spielen, aber wenn die Beweise für ein positiveres Bild offenbar null und nichtig sind, wieso sind die Beweise gegen ein positiveres Bild plötzlich umso aussagekräftiger?\n\nWir Menschen neigen dazu, uns die Dinge so zurecht zu legen, dass sie unseren Auffassungen entsprechen. Auf welche Quellen berufst du dich also und inwiefern sind sie eher Valide als die entsprechende Doku?\n\n> Nur macht es die Version auch nicht wahrer. Die Bomben waren a) notwendig und b) waren ihre Abwürfe auch richtig.\n\nIch halte diese Pauschalisierungen für fragwürdig.\n\nDu kannst nicht einerseits die Quellen für die Untermauerung deiner Gegner als nichtige Propaganda bezeichnen, andererseits aber deine eigenen Quellen und Worte als Gesetz betrachten. Das ist nicht objektiv.\n\nWenn man sich schon über die Quellen und ihre Interpretation mokiert, dann ist nur eine Aussage zulässig:\n\nÜber den Abwurf sowie seine Abwägung mit möglichen Alternativen oder einer Rechtfertigung lässt sich heute keine eindeutiges Urteil mehr fällen.","replies":[]}]}]},{"poster":"eingew","date":"2016-12-22T14:49:36.319+0000","up_votes":2,"down_votes":1,"body":"Ich sehe hier vor allem Argumente gegen den Krieg, nicht gegen die USA.","replies":[{"poster":"Ozuraak","date":"2016-12-22T14:57:01.484+0000","up_votes":1,"down_votes":2,"body":"A) Dieser Krieg war nunmal Fakt und diesem Fakt musste sich Amerika stellen.\n\nB) Das hast du geschrieben \"Ich sage nur: Wenn Amerika *wirklich* Frieden wollte, dann hätten sie keine Armeen geschickt. Armeen bedeuten niemals Frieden, sondern immer nur Krieg. \"\n\nDeine Worte. Also Amerika wird überfallen und will keine Frieden, weil es Armeen schickt?\n\nWie hätte Amerika deiner Meinung nach reagieren sollen?","replies":[{"poster":"eingew","date":"2016-12-22T15:17:51.853+0000","up_votes":2,"down_votes":1,"body":"Primär mit Worten. \n\nIm Prinzip hast du Recht, um die japanischen Truppen zu stoppen musste irgendjemand militärisch aktiv werden. Denn es ist auch nicht besonders friedlich, zuzusehen, wie andere getötet werden.\n\nAndererseits wäre es ein wunderschöner Traum, wenn man die Japaner nur durch Diplomatie dazu hätte überzeugen können, etwas größeres zu werden, als sie es damals waren.","replies":[{"poster":"Ozuraak","date":"2016-12-22T15:34:19.385+0000","up_votes":1,"down_votes":2,"body":"Klar, wäre das schön. Und ich bin im Grunde bei dir, ich möchte auch in einer ideellen Welt leben, wo alle in Frieden leben. \n\nNur leider ist das aktuell nicht der Fall, und es war auch vor 70 Jahren nicht der Fall.\n\nGegen die Gewalt helfen Worte nicht immer. Manchmal muss (leider) Gewalt mit Gewalt bekämpft werden.","replies":[]}]}]}]}]},{"poster":"clair de lune289","date":"2016-12-17T15:22:52.729+0000","up_votes":4,"down_votes":3,"body":"ich kenne Dokus die etwas ganz anderes sagen und würde dich doch bitten mir den Titel dieser Doku zu nennen, nicht weil ich dir nicht glauben will, sondern weil es einfach schwer ist genau zu sagen was wirklich war.\n\nnach meinem wissen haben die Amerikaner sogar ihre Kapitulationsfordrungen angepasst. Sie forderten **_nicht!_** mehr die bedingungslose Kapitulation des jap. Kaisers sondern die bedingungslose Kapitulation der jap Streitkräfte,da der Kaiser (auch Tenno genannt) als \"Gott\" galt und somit unfehlbar war.","replies":[{"poster":"Waldschrat86","date":"2016-12-17T15:28:53.734+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=clair de lune289,realm=EUW,application-id=KYnfKGf0,discussion-id=O6QeEzy1,comment-id=0005000000010000,timestamp=2016-12-17T15:22:52.729+0000)\n>\n> ich kenne Dokus die etwas ganz anderes sagen und würde dich doch bitten mir den Titel dieser Doku zu nennen, nicht weil ich dir nicht glauben will, sondern weil es einfach schwer ist genau zu sagen was wirklich war.\n> \n> nach meinem wissen haben die Amerikaner sogar ihre Kapitulationsfordrungen angepasst. Sie forderten **_nicht!_** mehr die bedingungslose Kapitulation des jap. Kaisers sondern die bedingungslose Kapitulation der jap Streitkräfte,da der Kaiser (auch Tenno genannt) als &quot;Gott&quot; galt und somit unfehlbar war.\n\nPuh das weiß ich nicht mehr. Die war neuer lief auf ARTE, wenn ichs recht erinnere.\nDürfte auch recht umstritten sein die Meinung, aber ich fand es plausibel. War auf jeden Fall so, dass ich im Abspann der Doku gern ein Quellenverzeichnis gehabt hätte.","replies":[{"poster":"clair de lune289","date":"2016-12-17T16:38:54.416+0000","up_votes":3,"down_votes":3,"body":"Die wichtige Frage ist halt \"war es richtig den Krieg nur bei einer bedingungslose Kapitulation zu beenden\" und die Antwort darauf ist alles andere als einfach.\nEs gibt dabei so viele Faktoren z.B. wäre der 2WK durch eine bedingungslose Kapitulation im 1WK verhinder worden, die Art wie Japan in den Weltkrieg eintrat (Angriff auf Pearl Harbor).\nDabei sollte man immer berücksichtigen wer oder woher die Quelle kommt ,denn grade bei den \"Sieger\" wird oft genug über Verfehlungen geschwiegen.","replies":[]}]}]}]}]}]},{"poster":"Prod0x","date":"2016-12-23T12:38:12.913+0000","up_votes":2,"down_votes":0,"body":"Rechter ist keine Beleidigung, kids schaut weniger RTL.","replies":[]}]}