{"poster":"Krzn","date":"2015-02-19T03:17:12.996+0000","title":"Se puede modificar el idioma del juego?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Me gustaría saber si es posible cambiar el juego de español a ingles y que no sea penalizado.\r\n\r\nY si es que se puede, ¿como se hace el cambio?\r\n\r\nMuchas gracias.\r\n\r\n{{item:3078}}","replies":[{"poster":"Galiers","date":"2015-02-19T17:14:09.689+0000","up_votes":1,"down_votes":0,"body":"si se puede de manera legal\n\nC:\\Riot Games\\League of Legends\\RADS\\projects\\lol_patcher\\managedfiles\\0.0.0.0\n\n* dentro de esa carpeta busca el archivo regions.txt\n* busca las lineas\n\nla1,           la1,           es_MX,                 A\nla2,           la2,           es_MX,                A\n\n* Modificalas por lo siguiente\n\nla1,           la1,           es_MX|en_US,                 A\nla2,           la2,           es_MX|en_US,                 A\n\n* abre el launcher y en la esquina superior derecha donde dice Latino America Sur haz click\n* se abrira un recuadro donde puede seleccionar la región y el idioma\n* cambia el idioma a inglés y logea como de costumbre\n\nlo malo es que esto cambia todo el juego a ingles, no solo las voces\nsi quieres otros idiomas fijate en el mismo archivo por ejemplo para tener idioma ruso pones ru_RU\nrecuerda separar los idiomas con la barra vertical |","replies":[]},{"poster":"Jhin Freecss","date":"2015-02-19T05:41:57.620+0000","up_votes":1,"down_votes":0,"body":"No creo que sea ilegal ya que no da ninguna ventaja injusta contra otros , yose como cambiar las voces y el chat pero no lo ago no me gusta","replies":[]},{"poster":"Texter Redrum","date":"2015-02-19T04:21:42.377+0000","up_votes":1,"down_votes":0,"body":"No es legal y si te descubren que lo tenes en ingles te pueden sancionar ^^","replies":[]},{"poster":"Zirekc","date":"2015-02-19T03:19:08.844+0000","up_votes":1,"down_votes":1,"body":"Siii, yo igual quiero hacer el cambio, odio las voces en español, las prefiero en ingles, ademas ya me había acostumbrado a la tienda en ingles","replies":[]}]}