{"poster":"Riven Jungles","date":"2017-02-05T23:00:38.557+0000","title":"dat feel when your support is  never gonna  buy sightstone","subforum":"Gameplay","up_votes":4,"down_votes":2,"body":"{{sticker:slayer-jinx-unamused}}  guess I die then. &quot; sighstone is so last season&quot;  rip","replies":[{"poster":"winteriscoming97","date":"2017-02-05T23:03:37.936+0000","up_votes":3,"down_votes":0,"body":"Not as bad as them starting Doran's.","replies":[]},{"poster":"TS Media","date":"2017-02-05T23:54:18.634+0000","up_votes":2,"down_votes":0,"body":"{{champion:99}} : It'll be my next item, I swear!\n\n-Game Ends-\n\nLux Build: {{item:3165}} {{item:3089}} {{item:3157}} {{item:3135}} {{item:3027}} {{item:3089}} \n\n{{champion:42}} : You didn't even buy boots lux!","replies":[{"poster":"Riven Jungles","date":"2017-02-06T01:08:37.481+0000","up_votes":1,"down_votes":0,"body":"this^","replies":[]}]},{"poster":"Teémò","date":"2017-02-05T23:27:05.198+0000","up_votes":2,"down_votes":4,"body":"That feel when people complain of someone not buying sight stone , but they refuse to buy it either.  aka if you want something done do it yourself or don't blame others for it.","replies":[{"poster":"MagicFlyingLlama","date":"2017-02-05T23:48:35.231+0000","up_votes":1,"down_votes":0,"body":"And that is why some people need to be banned.\nIE anyone who says that while playing support.\n\nIt is not anyone else's fault that _you_ are bad. Please dont try to pass it off on them.","replies":[{"poster":"Teémò","date":"2017-02-06T00:24:19.076+0000","up_votes":1,"down_votes":2,"body":"dam triggered much xD, why do you just assume I'm bad? In a kill lane bot meta though wouldn't it make more sense to obtain more damage first? Between your control ward and adc control ward You shouldnt have to much to hassle for a while at least. And when you think of the amount of vision supposedly required for bot lane, wouldn't it then make sense to buy sight stone as a top laner? I mean it's pretty much the dark side of the moon over there. Shouldn't they ward the enemy jungle since they can be levels ahead, steal enemy jungle to further them behind etc.  I don't feel upset at my support for not building it if they are constantly being pushed in either. If your being pushed in there isn't much for you to roam to do. And in kill lanes if you aren't there you probably won't be able to save them and they get bursted and then u need to turn tail. Roaming is a good trait of supports as well as providing vision, It's just not always a viable option unless you know you can win with someone else being your carry. like roaming top and cc chaining as leona to help the darius kill and take the tower.","replies":[{"poster":"Attticus Finch","date":"2017-02-06T00:32:50.069+0000","up_votes":1,"down_votes":0,"body":"\"In a kill lane bot meta though wouldn't it make more sense to obtain more damage first?\"\n\nNo. One ADC and one support can not out-damage one ADC and one support with a ganking jungler and/or ganking mid-laner. \n\nIt boggles my mind that people bitch incessantly about unfair 4-5 man ganks bot yet in the same breadth their are also supports who don't want to buy vision. \n\nAnd we're not in a \"kill lane bot\" meta. Adjusting for low play-rates, the top five highest win-rate support slots are dominated by utility supports like Janna and Soraka.","replies":[]}]}]},{"poster":"Riven Jungles","date":"2017-02-05T23:56:00.508+0000","up_votes":1,"down_votes":0,"body":"i have in fact, spent the 800 as adc a few times where nearing mid-game .. it's 800 coin mang. easily attainable from our support, wouldnt kill them to just buy it so the whole team can have some sort of vision on the field. build whatever you want. (pls dont) at least give me vision","replies":[]}]},{"poster":"Lexyy","date":"2017-02-06T00:18:33.088+0000","up_votes":1,"down_votes":0,"body":"I hate people like that. How can they function in botlane with non stop ganks without wards?\n\nVision is important part of the game, and every teammate has it's own role in the game.","replies":[]},{"poster":"ScissorsNstuff","date":"2017-02-05T23:08:10.776+0000","up_votes":1,"down_votes":0,"body":":/ that feel when they wont buy sightstone but insist that you push and start using abilities on minions if you dont","replies":[]}]}