{"poster":"DerKardo","date":"2016-06-11T16:04:11.862+0000","title":"Team Individualisierung für Ranked Teams","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Hallo Community\r\n\r\nIch habe mich nach kurzer Zeit entschlossen ein Ranked Team zu erstellen mit 5 Freunden. Dies hat nat&uuml;rlich gut geklappt, aber irgendwie kann ich mich nur mit dem Namen nicht zufrieden stellen. Da ich bei anderen Spielen gesehen habe kann man dort sein Team individualisieren z.B. ein beliebiges Beschw&ouml;rer Symbol als Team Icon benutzten. Man kann allerdings nur die benutzten die der Teamleiter hat oder von allen Team Mitgliedern, kommt drauf an was die Community oder Rito will :3\r\nMan k&ouml;nnte so das Teamprofil wesentlich einladender gestalten und es so einzigartiger zu machen. \r\nAuf dem Teamprofil kann dann, wie beim Beschw&ouml;rerprofil, der Rank der Letzten Season angezeigt werden in Form eines Rahmen.\r\n\r\nWenn man sich in ein Teamranked begeben hat war es so das im Ladebildschirm von beiden Teams die Namen angezeigt wurden, dies kann man erweitern indem man das gew&auml;hlte Symbol jeweils daneben abbildet. Bringt keinen sonderlichen Vorteil sieht aber sch&ouml;n aus. :D\r\n\r\nTeamprofil mit Goldrahmen und Symbol: http://imgur.com/2yh9RxR\r\n\r\nLadescreen mit Symbol und Namen (Ladescreen von Hand of Blood Butzfrauen Folge: 52) : http://imgur.com/XIEvdrn\r\n\r\n\r\nDanke f&uuml;rs lesen \r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"HandIOfIZombie","date":"2016-06-13T13:54:05.388+0000","up_votes":2,"down_votes":0,"body":"schön wäre es ja schon aber die nachfrage ist da nicht so hoch, denke das so kleine wünsche und Verbesserungen wie diese einfach nur offen stehen, leider.","replies":[]},{"poster":"HandIOfIZombie","date":"2016-06-11T20:41:51.549+0000","up_votes":2,"down_votes":0,"body":"Team Erstellung hat schon was, da könnte man einiges ändern damit es Interessant wirkt, nicht so schön ist es wenn man Beschwörer Symbole hat die jedes Team zur Verfügung gestellt ist und wird. An der stelle sagen jetzt einige, da gibt es bestimmt Teams die nur Unsinn damit treiben und Symbole benutzen die Unpassend sind aber Spieler-namen kann man ja schon melden\"! Kenne ein Online Game was auch ab 12 Jahre ist, da ist so was für die Gilde erlaubt. Die Individualisierung der Teams ist leider sehr eingeschränkt und so weit ich das raus gelesen habe auch nur für Aktive Rank Spieler gedacht, falls das stimmen sollte, ich finds schade, man kann viel mehr daraus machen. lg","replies":[{"poster":"DerKardo","date":"2016-06-12T10:37:34.523+0000","up_votes":1,"down_votes":0,"body":"Es ist von mir auch noch nicht komplett durchgedacht, ich hab ja nur ein Konzept das so eins zu eins nicht ins Game passt. Allein schon mit dem Rank der letzten Season, falls man 3v3 ranked zockt und da z.B. Bronze ist und im 5v5 Silber ist die Frage welcher Rank wird in der nächsten Season als Rahmen angezeigt. \n\nZum Thema melden.\nDa kann man ganz einfach eine neue Kategorie einfügen die im Endscreen neben deren Team steht. Dort ist dann ein Knopf \"Team melden\" und dann kommt ein ganz normales Report Fenster wo man auswählen kann was den nicht so gut ist, wie Name, Symbol und Namen Kombo oder anderes eben. Das wäre , soweit ich jetzt sehe, gelöst.\n\nHoffe aber immer noch das Rito das Feature implementiert \n{{sticker:slayer-jinx-catface}}","replies":[]}]}]}