{"poster":"TheDarkKnight02","date":"2015-07-26T00:59:14.701+0000","title":"mid viables?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"estoy ahorranndo pi y quisiera saber que mids estan en el meta","replies":[{"poster":"iFailTheSkill","date":"2015-07-27T13:49:51.564+0000","up_votes":1,"down_votes":0,"body":"{{champion:112}} {{champion:131}} {{champion:31}} {{champion:1}} {{champion:103}} Estos son para mi los mas recomendables, pero si no queres tenes estos: {{champion:91}} {{champion:99}} {{champion:81}}","replies":[{"poster":"TheDarkKnight02","date":"2015-07-27T16:22:06.183+0000","up_votes":1,"down_votes":0,"body":"tengo a cho gat,lo podria tener de segunda opcion si banean a lux,¿como se usa en mid y como se buildea?","replies":[{"poster":"iFailTheSkill","date":"2015-07-31T15:25:03.942+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=xvAMkpd8ujE De este canal me fijo los campeones que están fuertes, hasta creo que tiene un pagina oficial.","replies":[]}]}]},{"poster":"Hwaxinghz","date":"2015-07-26T01:38:51.433+0000","up_votes":1,"down_votes":0,"body":"{{champion:103}} {{champion:1}} {{champion:131}} {{champion:55}} {{champion:7}} {{champion:99}} {{champion:238}} {{champion:157}}  estos están en el meta y creo que me faltan más, pero son los que más se ven, sobretodo Zed y Yasuo. Son Perma Ban (realmente Innecesarios, no hace falta ya que están fuertes pero sólo en buenas manos) en rankeds.\n\nsaludos","replies":[{"poster":"MarkoMC","date":"2015-07-26T04:25:33.988+0000","up_votes":1,"down_votes":0,"body":"Permaban? que liga sos xD","replies":[{"poster":"Hwaxinghz","date":"2015-07-26T13:45:14.005+0000","up_votes":1,"down_votes":0,"body":"Oro, ni bien entro a la selección de campeones salen 400 comentarios diciendo \"PLEASE BAN ZED YASUO!!!!!!\" y así todo el rato, cuando baneo yo, ni los toco a esos champs, al contrario, los baiteo para que me salgan del otro lado y reventarlos con una Ahri, Morgana, Lux o Diana, a mi no me molestan esos campeones, pero muchos le tienen miedo, eso es lo que pasa.\nEn Bronce y plata, como son \"carrito fácil\" igual que Fiora y Kata, son perma ban siempre, en oro también se los banea mucho, en platino también (¿Cuantas veces estuviste en platino? Haciendo DUO con mi compañero platino 3, unas 30 veces mas o menos me tocaron mínimo 3 platinos por team y los que banean eran platinos y siempre baneaban a Zed y del otro lado un Yasuo)","replies":[{"poster":"FUNES DIOS6","date":"2015-07-27T23:17:36.944+0000","up_votes":1,"down_votes":0,"body":"A zed lo desarmas con akali, yasuo contra champs como brand o cassiopeia.\n\nYo uso anivia, tiene mucha utilidad, listan solo chars asesinos razos, pero hay muchas variables.\n\nCassiopeia, Anivia, Lux, Lulu, Morgana, Karma, Viktor, etc. tienen su daño y sirven para hacer pelee.\n\nZed, Yasuo, Katarina, Fizz, Ezreal, Akali, Ahri, tienen buen bursty.","replies":[{"poster":"Hwaxinghz","date":"2015-07-27T23:27:41.714+0000","up_votes":1,"down_votes":0,"body":"Osea, lo sé, solo comento la situación.\n\nYo juego Mid, de hecho maineo Mid, como ya estoy acostumbrado a jugar en contra a los champs clásicos, ya es como que no me cuesta nada ganarles, al contrario, prefiero que me aparezcan porque sé exactamente como ganarles, Cosa que no pasa tanto con Anivia y Viktor o Cassiopeia, ya que al no ser muy usados, se ganarles pero por ahí cuesta un poco más.","replies":[]}]}]}]},{"poster":"TheDarkKnight02","date":"2015-07-26T19:42:31.491+0000","up_votes":1,"down_votes":0,"body":"estaba pensando en comprar a lux,¿es difícil de usar?","replies":[{"poster":"Hwaxinghz","date":"2015-07-26T21:34:01.899+0000","up_votes":1,"down_votes":0,"body":"No, no es difícil. Hay un vídeo que realizó un Rioter hace tiempo, que muestra como usarla. El link es este: https://www.youtube.com/watch?v=eSo4c180_v8 \n\nEs de la season 4, pero las mecánicas son las mismas y por ahí te puede ayudar a entender el personaje. Es muy fuerte y requiere algo de puntería pero con un poco de práctica podrás dominarla muy bien.","replies":[{"poster":"TheDarkKnight02","date":"2015-07-26T23:07:34.123+0000","up_votes":1,"down_votes":0,"body":"gracias,esa build es buena en la s5?\ncuando tenga pi voy a comprarla","replies":[{"poster":"Hwaxinghz","date":"2015-07-26T23:47:53.088+0000","up_votes":1,"down_votes":0,"body":"es muy buena, no te arrepentirás","replies":[]}]}]}]}]},{"poster":"H3rmiiT","date":"2015-07-26T01:22:15.984+0000","up_votes":1,"down_votes":0,"body":"Tier god: {{champion:1}} {{champion:91}} \nTier 1: {{champion:131}} {{champion:50}} {{champion:31}} {{champion:112}}","replies":[]}]}