{"poster":"microchip","date":"2016-09-13T09:58:01.516+0000","title":"requisitos para entrar a ranked","subforum":"Charlas Generales","up_votes":1,"down_votes":4,"body":"**los requisitos son minimos tener 16 campeones es un chiste cualquiera puede tener 16 campeones y empesar a mankear incluso pueden comprarselos hasta con rp. suban el requisito a 30 campeones como m&iacute;nimo,hay gente que no sabe nada de nada y lo &uacute;nico que hacen es perjudicar la experiencia de  los demas jugadores.**","replies":[{"poster":"EntrandoEnEsa","date":"2016-09-13T16:58:49.920+0000","up_votes":1,"down_votes":0,"body":"Primero que nada, los 16 campeones son por el caso en que los 6 bans y los 9 picks anteriores coincidan con tus campeones. Si tuvieras 15 por ejemplo se podria dar la chance  de que cuando te toque elegir no puedas elegir ninguno. \nNo es porque se tiraron un pedo y dijeron que tenia olor a 16 que pusieron ese limite.\nSegundo, no tiene nada que ver el nivel de un jugador con la cantidad de campeones que tenga. \nTercero, despedite de tu cuenta lince.","replies":[]},{"poster":"Lince Salvaje","date":"2016-09-13T12:09:08.940+0000","up_votes":1,"down_votes":0,"body":"la cantidad de campeones no tiene nada que ver con el nivel de juego de la persona, es mas actualmente no manejo mas de 10 campeones para rankear, puede haber gente que tenga 16 y los sepa jugar perfectaemente.\n\nademas como dices 30 campeones despues aparecera otro diciendo que son pocos campeones que mejor 60 y asi sucesivamente. esta bien como esta  :)","replies":[]},{"poster":"9081913DEL1","date":"2016-09-13T10:48:15.277+0000","up_votes":1,"down_votes":0,"body":"Que la gente no sepa nada de nada, pues eso fue la razon de dividir ligas en 5 niveles las mas bajas.\n\nPara mi a mas requisitos te autoimpones mejor vas a estar en rankeds, 16 campeones es ams que suficiente, mas alla de todo el problema no son los campeones, las runas, los skins, el problema es que muchos ven a las rankeds como deberian ver a las normales.\nLa experiencia de juego, cuando vas en equipo, es grandiosa, si vas solo q, o incluso duo, pues acepta que te pondran con OTRAS personas, y puede que vean el juego de otra manera.\n\nSaludos.","replies":[]}]}