{"poster":"Only Mid Veigar","date":"2015-10-25T07:16:34.061+0000","title":"Goodbye to League, and farewell to Riot.","subforum":"[ARCHIVED] General Discussion","up_votes":4,"down_votes":19,"body":"Well, since I&#039;m being unfairly punished and screwed by the likes of a shitty company I&#039;ve been boycotting since 2010/2011 when they sold out to Tencent and flipped the community a big fat middle finger, I&#039;m just about done.\r\n\r\nIt&#039;s been a crazy ride from closed beta all the way up until now. I&#039;ve seen the best of the worst go on to world tournaments and I&#039;ve seen the worst of the best get their walking papers for not kissing Riot&#039;s ass and &#039;following the summoner&#039;s code&#039; because they say what they want, how they want. I&#039;m a blunt person who doesn&#039;t sugarcoat things or coddle idiots when they fuck up. I tell it like it is, and if you don&#039;t like it, deal with it. I am the same way with my employees at my job, and I&#039;ve fired plenty of people who pissed moaned and whined to their mommy and daddy that their manager told them they were a bad employee!\r\n\r\nIt&#039;s always fun to see the reaction of parents when they hear their kid was lazy and did nothing all day. Everyone thinks they&#039;re a perfect special snowflake.\r\n\r\nWell no, you&#039;re not, and it&#039;s pretty clear that unless you play by Riot&#039;s rules of &quot;treat everyone as a winner, even if they&#039;re a loser&quot; you&#039;re not welcome here.\r\n\r\nI&#039;ve tried several times reasoning with them on the concept of semantics and how you need to honor what you say and not just post some arbitrary bullshit because &quot;hurr durr we said so&quot; but Riot, again, in spectacular fashion of having their head so far up their ass they need a window in their stomach to see, lies and screws the community over. If you don&#039;t think this is the case, on the old forum archive, you can find many posts about how Riot **LIED** about RP costs for new skins, changing costs of old skins, and further abused the player base with disgraceful business practices.\r\n\r\nIratus: Closed beta tester September 2009, got off the ride October 2015\r\n\r\nGood riddance, I&#039;ll be sending Tryndamere a personal letter, and maybe if a red decides to grace the good bye thread with their presence, the only way to correct this abuse of one of your oldest community members, is FAIR AND JUST TREATMENT LIKE ALL OTHER PLAYERS.\r\n\r\nI could give a rats ass about losing the rewards, but when you bait me and WASTE MY TIME WITH LIES AND MISLEADING WORDS, fuck that. You owe me an apology.","replies":[]}