{"poster":"Doomenator","date":"2016-11-19T14:20:38.651+0000","title":"Sobre el singed soporte baneado (algún rioter pls)","subforum":"Charlas Generales","up_votes":1,"down_votes":13,"body":"Nunca entend&iacute; por qu&eacute; lo banearon... ya que claramente dijeron que no estaba mal salirse del meta, pero no entiendo, o sea, no est&aacute; mal salirse del meta, pero no te salgas tanto o te baneamos??  o es que si te reportan injustamente porque no les gusta tu pick te terminan baneando igual? no comprendo, m&aacute;s que una cr&iacute;tica, soy genuinamente curioso en por qu&eacute; lo banearon.","replies":[{"poster":"Shion Archimago","date":"2016-11-19T14:30:37.095+0000","up_votes":5,"down_votes":0,"body":"segun entendi, el no jugaba suport, jugaba a hacer counter jg es decir no estaba presente en la fase de lineas y dejaba al adc solo en un 2v1","replies":[{"poster":"Doomenator","date":"2016-11-19T14:35:38.078+0000","up_votes":1,"down_votes":5,"body":"Ya, y eso es salirse del meta, no? por lo que NO es baneable, no??","replies":[{"poster":"Shion Archimago","date":"2016-11-19T15:08:46.716+0000","up_votes":4,"down_votes":0,"body":"dime lisa q acabas de ver??\nbanearon al pibe osea significa q es baneable","replies":[{"poster":"Doomenator","date":"2016-11-19T15:28:02.941+0000","up_votes":2,"down_votes":4,"body":"No se puede meter a alguien preso porque te cae mal.\n\nPero si alguien abusa de poder y lo hace, qué me vas a decir \"dime lisa q acabas de ver?? lo metieron preso osea si te pueden meter preso xq le caes mal o porque eres feo\"\n\n\nLol, sin comentarios","replies":[]}]}]}]},{"poster":"9081913DEL1","date":"2016-11-19T15:09:09.780+0000","up_votes":5,"down_votes":1,"body":"Cual es el objetivo del post? \nEs obvio que lo banearon por troll. Como a muchos otros, o que pensabas?\n\nToda actitud que vaya en funcion de arruinarle la experiencia de forma intencionada al resto de los jugadores en forma reiterada recibe sancion.\nEl Antimeta no importa, si hubiera ido ashe mid con smithe y tp y moria 500 veces no importaria. El tema es que claramente jugaba aproposito de una manera tratando de que al banearlo se pudiera justificar. No importa si no fedeas, si farmeas, si estas caminando por el mapa. La jodes, la pagas.\n\nSaludos.","replies":[{"poster":"Doomenator","date":"2016-11-19T15:32:06.377+0000","up_votes":4,"down_votes":2,"body":"Acabas de probar mi punto\n\n\"El antimeta no importa\" >> Claramente aquí si importó para el ban, cosa que no corresponde\n\"Lo banearon por troll\" >> El tipo jugaba para ganar\n\"Toda actitud que vaya en función de arruinarle la experiencia de forma intencionada al resto de los jugadores en forma reiterada recibe sanción\" >>>>>> El tipo no jugaba para joderle la partida a lo demás, te invito a que des una prueba porque no la vas a encontrar.\n\"El tema es que claramente jugaba aproposito de una manera tratando de que al banearlo se pudiera justificar.\" >>> No sé si no soy capaz de entenderlo o la redacción es simplemente malísima\n\n\"La jodes la pagas\" >> Define \"joderla\", porque acá claramente solo jugó un anti-meta y su intención no era joder a nadie.","replies":[{"poster":"9081913DEL1","date":"2016-11-19T19:22:23.087+0000","up_votes":1,"down_votes":0,"body":"Es de mala educacion responder a una pregunta con otra pregunta.\nRespondeme primero, cual es el objetivo de tu post.\n\nEl tipo no jugaba para ganar, eso no lo puedes contradecir salvo que seas esa persona, en cuyo caso sabes bien por que se te baneo.\nSaludos.","replies":[{"poster":"Doomenator","date":"2016-11-19T22:37:26.950+0000","up_votes":1,"down_votes":0,"body":"El tipo tenía win rate positivo con singed support, creo que eso responde el \"el tipo no jugaba para ganar\" Lol\n\nEntonces por qué me preguntas cual es el objetivo del post en primer lugar, o es eso responder una pregunta con otra? La hipocresía...","replies":[{"poster":"9081913DEL1","date":"2016-11-20T10:06:46.876+0000","up_votes":2,"down_votes":0,"body":"Cual es el objetivo del post? No debe ser tan dificil responder ;)","replies":[]}]}]}]}]},{"poster":"Sativa Rimbaud","date":"2016-11-19T15:23:20.245+0000","up_votes":2,"down_votes":0,"body":"Estos noob que no leen el foro.\n\nLo banearon por no cumplir su rol, yo lo reportaria tmb, esta bien que lo banearan.","replies":[{"poster":"Doomenator","date":"2016-11-19T15:34:19.846+0000","up_votes":1,"down_votes":6,"body":"Estos noob que no entienden que los roles no están dentro de las reglas del juego","replies":[{"poster":"NO THIS IS DOG","date":"2016-11-19T15:42:18.936+0000","up_votes":2,"down_votes":1,"body":"Estos noobs que no leen la nota ni el hilo oficial (?)\nIr con cualquier campeón está bien, ir con singed está bien, no comprar items de supp está bien, etc.\nLo que no está bien, es decir voy supp, o que te toque supp, e irte a cualquier otro lado SIN HABER COMPARTIDO TU ESTRATEGIA AL TEAM.\nSi digo por ejemplo voy mid, y aviso que me la voy a pasar matando al jg rival y nunca aparecer en linea, barbaro, si avise y nadie se salió ni se opuso, es una estrategia nueva, rara tal vez, pero si la compartis y tu team está de acuerdo (porque es un juego de equipo) joya\n\nEste invocador aparentemente no avisaba nada, se iba, dejando la linea sola y el adc no tenía ni dea de que iba a estar solo, por lo que arruinaba la jugabilidad de esa partida. Obvio, si no sabes que van a hacer tus compañeros como podés acompañar o hacer efectiva una estrategia?\n\nEn definitiva y como se dijo varias veces, no lo banearon por no ir con un supp, ni por no comprar items ni por no ayudar al adc... lo banearon por tomar un rol y sin avisar ni comunicar hacer cualquier otra cosa.","replies":[{"poster":"Doomenator","date":"2016-11-19T15:44:26.169+0000","up_votes":1,"down_votes":5,"body":"O sea que si voy viktor mid y no aviso que voy a jugar como todo el mundo lo hace me pueden banear? \n\n\nNo es como que la flex q o la ranked te de otra opción de rol","replies":[{"poster":"NO THIS IS DOG","date":"2016-11-19T16:14:58.006+0000","up_votes":2,"down_votes":0,"body":"No mirá, el sistema te asigna un rol, bárbaro, de ahí en adelante podes hacer lo que se te cante, queres no pisar mid nunca, joya, queres ir doble o triple top con tus amigos? joya, quieren ir 4 junglas y dejar las lineas en bolas? joya.\nTodo esto siempre comunicando lo que vas a hacer, porque el juego es en equipo!, no es solo tu partida y haces lo que te plazca, porque afectas a otros jugadores.\nSi entras y hacés lo que quieras sin decirle a nadie, le estás cagando la partida a otros, eso es baneable.\nSi te toca viktor mid y no avisas que vas a hacer X cosa, es baneable. ¿por qué?  si te va bien, no creo que nadie te diga nada, y va a pasar desapercibido, pero si por intentar algo cagás la partida, y se la arruinas a los demás, generaste una situación negativa para los otros.","replies":[{"poster":"Doomenator","date":"2016-11-19T16:27:25.761+0000","up_votes":1,"down_votes":3,"body":"Yaya, entiendo, pero tu punto lo que dice es que básicamente es reportable el no hablar en el chat\n\nO sea que si tengo un compañero que juega lo más bien del universo, no sé ps, un lee sin jg, que gankea todas las lineas, no taxea, deja las kills, ayuda con objetivos, saca todos los dragones etc etc etc... yo básicamente lo puedo reportar porque no me dijo que iba a hacer eso y a mi no me gustó?\n\nNo amigo lamentablemente así no tiene que ser... acá no se trata de que si a tus compañeros les complace o no como es mi forma de jugar, claramente no voy a correr mid a regalar kills, pero si juego una estrategia off meta lo mejor que puedes hacer es decir qué es lo que vas a hacer, comunicarte, PERO EL HECHO DE NO HACERLO NO ES MOTIVO DE BAN, ese es mi punto.","replies":[{"poster":"NO THIS IS DOG","date":"2016-11-19T17:13:13.760+0000","up_votes":4,"down_votes":0,"body":"No tiene que ver con que les guste a tus compañeros o no, sino que lo hayas comunicado o no.\nTus compañeros y vos pueden reportar a ese lee sin tranquilamente, estan en todo su derecho, ahora, nunca le van a dar a ban y los reportes no se van a tomar en cuenta si no hizo algo que no debía que perjudico el juego de los demas. Se entiende?\n\nNo es que te reportan y ban. Se analiza toda la situación. Se ve si hubo algún malestar para los compañeros y si hubo una situación negativa se castiga.  Y recalco lo de situación negativa porque es la parte que no estás viendo. No importa que su estrategia sea la mejor del mundo y estés garatizado tener un win-rate de 95% ..., porque si no la explicas, si no decis lo que vas a hacer, si dejas a tu equipo en banda para hacer lo que se te cante, se vuelve un ambiente choto, donde nadie te va a seguir ni ayudarte y vas a generar malestar.\n\nImaginate que vas adc y de la nada tu supp (por poner un ejemplo, puede ser cualquier rol) se va y empieza a hacer la jg a básicos,  el adc, el supp, y el jg enemigo se aprovechan y te hacen de goma, no te dejan farmear ni un creep y te tiran la torre a los 8 min, sos totalmente inservible y te enojas, por supuesto.\nEl chabon sale de la jungla a los 20 min con oro para hacerse una build de daño y PUEDE O NO, carrear la partida.\nSe pueden generar 2 situaciones:\n1- El chabon es un pro, sabe lo que hace y aun cuando no tengas ni el primer item puede remontar la partida, en ese caso por lo general nadie le va a decir nada, a lo mejor lo puteaste un rato, pero al fin y al cabo ganaste y no te importa nada.\nO\n2- El pibe sale de la jungla, el adc enemigo ya se lo voltea de 2 básicos, a vos tambien, roamea y mata a tu team. Qué pensas de ese supp? que piensa su team que lo estuvo pingueando media hora para que vuelva a su linea, para que ayude con la visión, para que al menos se aparezca y desanime a los enemigos a divearte como si estuviesen en su casa?\n\nES motivo de ban si no lo avisas, porque vos como adc, te vas a madear, los demas se van a madear, vas a jugar una partida re caliente, porque no sabes por qué cazzo el supp está haciendo lo que quiere, por qué justo te tocó a vos este chabon?, por qué te tiene que cagar la partida? por qué tenes aguantarte una partida asi si solo jugas una partida al día y entras a desestresarte al juego? ¿por qué rito me empareja con esta gente?, ¿ por qué lo hace?\nY seguramente el chat se va a spammear con \" /all report supp troll\"\n\nEl pibe no perdió todas las partidas, ganó un montón con su técnica, y seguramente en esas no lo reportaron, mas vale.\nPero la acumulación de reportes de las partidas en las que generó una situación que llevó a la derrota del team son las que le dieron ban.\n\nTL;DR: Cuando jugas por tu cuenta en un juego EN EQUIPO, podés generar una situaciones de malestar y enojo, y en el código del invocador está bien aclarado en muchos puntos:\n1- Apoya a tu equipo\n4- Disfruta, pero no a expensas de los demás\n5- Fomenta las relaciones\n\nEtc., que se pueden leer.","replies":[]}]}]},{"poster":"Sativa Rimbaud","date":"2016-11-19T15:56:50.060+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Doomenator,realm=LAS,application-id=v7qsfXsE,discussion-id=J2lP5AAA,comment-id=0004000000000000,timestamp=2016-11-19T15:44:26.169+0000)\n>\n> O sea que si voy viktor mid y no aviso que voy a jugar como todo el mundo lo hace me pueden banear? \n> \n> \n> No es como que la flex q o la ranked te de otra opción de rol\n\n**Sos re corto pibe, no entendes nada.**","replies":[{"poster":"Doomenator","date":"2016-11-19T16:24:30.171+0000","up_votes":1,"down_votes":6,"body":"tu no entiendes que el nunca dijo que iba a ir support, por ende no tienen que asumir que iba support simplemente porque era la posición que sobraba en el metagame inventado que está el lol ahora.\n\nPD: Buen argumento decirme que no entiendo nada, te refuté lo que te dijiste pero ahora me vienes con esto, con razón tengo tantos negativos en el post si estos pibes no razonan, se tragan lo básico nomás","replies":[{"poster":"9081913DEL1","date":"2016-11-19T19:36:59.219+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Doomenator,realm=LAS,application-id=v7qsfXsE,discussion-id=J2lP5AAA,comment-id=000400000000000000000000,timestamp=2016-11-19T16:24:30.171+0000)\n> asumir que iba support simplemente porque era la posición que sobraba en el metagame inventado que está el lol ahora\n\nThis.............. http://las.op.gg/summoner/userName=Doometor\n\nDiscutir retorica con un winrate del 50% siendo smurf ......\n\nTe merecias el ban y lo sabes ;)","replies":[]}]}]}]}]},{"poster":"9081913DEL1","date":"2016-11-19T19:29:19.346+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Doomenator,realm=LAS,application-id=v7qsfXsE,discussion-id=J2lP5AAA,comment-id=00040000,timestamp=2016-11-19T15:34:19.846+0000)\n>\n> Estos noob que no entienden que los roles no están dentro de las reglas del juego\n\nCon todo respeto, soy lo mas antimeta que vas a encontrar en mi elo (que es bastante decente). Para ser antimeta tenes que poder entender de que va el juego. Podes ir lo que vos quieras, armas una custom pones bots si queres y listo. Entrar a jugar domino con fichas de ajedrez no esta en las reglas, aun asi no deja de ser estupido, y por ende es logico que se sancione.\n\nSaludos.\n\nP.D.: Llamas noob a alguien que sigue los roles? Como llamas a alguien que trolea partidas? Proplayer? ...........","replies":[]}]}]},{"poster":"Xtatik","date":"2016-11-19T14:23:23.510+0000","up_votes":2,"down_votes":0,"body":"Es simplemente usar el buscador del foro y seguramente hallarás los varios temas que vienen al caso. Finalmente, al jugador no se le dio una sanción por \"salirse del meta\", más bien, los motivos fueron otros, habiendo quedado en claro cuales fueron.\nEstá a criterio personal verlo correcto o incorrecto.\n\nSaludos.","replies":[{"poster":"Doomenator","date":"2016-11-19T14:25:22.484+0000","up_votes":1,"down_votes":3,"body":"Si la verdad es que los comentarios de rioters me parecieron un poco ambiguos y estaban muuy metidos dentro de las respuestas de otros comentarios y tal... no busco generar discusión, solo le pido a algún rioter un poquito de claridad.","replies":[{"poster":"Tecnicomando","date":"2016-11-19T14:55:29.516+0000","up_votes":5,"down_votes":2,"body":"El baneo es por reportes... Actitud negativa no comunicación,etc...\n\nEl jugador no trolea,es su forma de jugar y ganaba si el equipo seguía su idea(ver el historial), y cuando el equipo no le comprendía o no quería seguir su estrategia se le reportaba(ver la info que el propio jugador explica)....\n\nAnti meta,pues si...Ilegal,pues no\n\nPor que es mediático...\n\nPor que rito se piso la cola y aunque fomenta las ideas innovadoras ,no respalda a usuario ,y entre los mismos rojos hay ideas confrontadas y para variar nadie se pone los pantalones(solo leer como se van por las ramas y argumentan sin mojarse el potito) y terminar a culpar a los usuarios por el baneo...\n\nY por lo mismo no vas a tener ninguna respuesta concreta de un rojo,ya que esta fomentaría una postura que claramente no quieren asumir..\n\nSi aparece alguien solo te va a dar otra respuesta ambigua y te va a remitir a los enlaces que ya viste\n\nsalu2","replies":[{"poster":"Doomenator","date":"2016-11-19T15:33:04.806+0000","up_votes":1,"down_votes":1,"body":"mejor respuesta no me podrían haber dado, estoy conforme, gracias <3\n\nTotal de 50 posts que he hecho, solo 2 lo han comentado rioters, y adivina, uno era sobre un comic y el otro sobre un meme, pero lo realmente importante no se asoman jamás","replies":[{"poster":"Shappaw","date":"2016-11-19T16:43:29.694+0000","up_votes":1,"down_votes":0,"body":"Es que muchas respuestas son lógicas y de sentido común. No van a venir a responder huevadas (aunque a veces lo hacen).","replies":[]}]}]}]}]},{"poster":"Xtatik","date":"2016-11-19T14:32:56.022+0000","up_votes":1,"down_votes":0,"body":"Claro, tampoco he dicho que haya algún ánimo de generar discusiones, comencemos por allí. Según lo que en su momento pude informarme, las justificaciones y demás quedaban claras; el jugador no estaba orientado hacia el soporte como le correspondería a la posición, no tomaba items para ayudar a su carrilero, le dejaba muchas veces en un 2vs1, etc, cosas así, que no son correspondidas con la posición que solicitaba jugar. Más allá de todo, reitero, cada uno tendrá su propia opinión personal acerca de si lo sucedido estuvo correcto o no.\n\nSaludos, suerte.","replies":[{"poster":"Doomenator","date":"2016-11-19T14:35:11.410+0000","up_votes":1,"down_votes":1,"body":"Si ese es el argumento me parece una estupidez con el debido respeto","replies":[{"poster":"EclipseOfWinter","date":"2016-11-19T14:39:07.234+0000","up_votes":1,"down_votes":0,"body":"Por qué lo sería? El jugador pedía ir soporte pero jugaba un rol totalmente distinto a lo que es soporte, no se le banea por usar a singed si no por que pedía ir un rol que no jugaba, un soporte con smite que no ayuda con la visión a su equipo, que deja constantemente a su adc solo en el carril y se va a hacer conterjungla no es un soporte, termina afectando a todo su equipo y aquí en el foro postearon información de un usuario de reddit que sacó las cifras correctas, ese usuario con singed support solo tiene un winrate de 37%, el porcentaje restante lo saca jugando singed en otra posición.","replies":[{"poster":"Doomenator","date":"2016-11-19T15:26:48.200+0000","up_votes":2,"down_votes":1,"body":"Me molesta que fuerzen el meta, pero no me rompe las *asteriscoss*** el que lo hagan la verdad, lo que me las rompe es que BANEEN GENTE PARA HACERLO.\n\n\nNadie dice que TIENE que haber un rol de soporte, nadie dice que TIENE que haber alguien ahí siendo la prostituta de el adc, es simplemente la manera más óptima y conocida de jugar lol.\n\nSi sale una manera nueva (ejm singed con smite romeando mientras el adc está 2v1), independiente de si es o no es óptima, no es baneable para nada.\n\nPasa que forzar el meta indirectamente con nerfs, buffs, cambios en los items, etc... es una cosa, y prohibirte el saltarte la posición de soporte es otra muy distinta.\n\n\nNo sé si entiendes mi punto, pero el resumen, es que en ninguna parte está por escrito el que soporte sea un rol obligatorio que haya que cumplir en el lol","replies":[{"poster":"EclipseOfWinter","date":"2016-11-20T13:29:05.966+0000","up_votes":1,"down_votes":0,"body":"SI entiendo tu punto y en cierto modo tienes razón, el prblema del lol es que no te dan opción a elegir un rol que reemplaze al soporte, a mi parecer de todos modos el soporte es un rol bastante importante, después de todo es quien más aporta a la visión del mapa, ahora bien tú podrías ir a jugar normales tratando de descubrir y reinventar el meta, pero si vas a rankeds con ese nuevo rol que sabes que no funciona le estás malogrando el juego a 4 personas más que tienen el derecho de reportarte por ello, hay que ponernos en perspectiva, dime de que te sirve ir un rol que sabes que no funciona en ranked? por que forzar algo que no sirve?","replies":[]}]},{"poster":"PWG Raeghast","date":"2016-11-19T15:27:54.102+0000","up_votes":1,"down_votes":2,"body":"El propio juego lo forzaba a ir soporte, quiero decir en algun momento la dynamic/flexQ daba la opcion de jugar doble jungla? Que yo recuerde no.","replies":[]}]}]}]},{"poster":"DarksWaves","date":"2016-11-19T19:49:06.576+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Doomenator,realm=LAS,application-id=v7qsfXsE,discussion-id=J2lP5AAA,comment-id=,timestamp=2016-11-19T14:20:38.651+0000)\n>\n> Nunca entend&amp;iacute; por qu&amp;eacute; lo banearon... ya que claramente dijeron que no estaba mal salirse del meta, pero no entiendo, o sea, no est&amp;aacute; mal salirse del meta, pero no te salgas tanto o te baneamos??  o es que si te reportan injustamente porque no les gusta tu pick te terminan baneando igual? no comprendo, m&amp;aacute;s que una cr&amp;iacute;tica, soy genuinamente curioso en por qu&amp;eacute; lo banearon.\n\n¿Y a vos que te importa por que lo banearon? O.o.\n\n¿Vos haces lo mismo o tenes pensado hacerlo?\n\n¿no se te da para usar tu curiosidad para mejorar como jugador?\n\n¿te troleamos asi te dejas de hacer crypost por tu cuenta?","replies":[{"poster":"Doomenator","date":"2016-11-20T21:17:31.233+0000","up_votes":1,"down_votes":0,"body":"El \"y a ti qué te importa\" es súper conformista\n\nSí mira, juego con teemo y no quiero que me baneen por eso\n\nQué?\n\nQué? XD","replies":[]}]}]}