{"poster":"fumatelatoda","date":"2017-11-05T00:30:34.038+0000","title":"Horarios RECOMENDADOS para jugar RANKEDS","subforum":"Charlas Generales","embed":{"description":"Image trolls hosted in imgbb.com","url":"https://ibb.co/iXgtiG","image":"https://image.ibb.co/g55axb/trolls.png"},"up_votes":16,"down_votes":5,"body":"Despues de haberme propuesto jugar 10 partidas del LOL por hora, diferentes dias (todas rankeds) decidi hacer una hoja de calculo en excel  e ir anotando si me salio algun afk, troll o flamer en la partida y el horario.\n\nEl experimento duro casi 2 meses pero no me llevo nada de esfuerzo, ya que solo a&ntilde;adia alguno de los comportamientos anteriores a su respectiva columna.\n\nSin mas preambulos les dejo estos graficos que yo mismo realize con datos 100% confiables*.\n\nHora vs AFKs\n\nhttps://ibb.co/fJvQxb\n\nHora vs Trolls\n\nhttps://ibb.co/iXgtiG\n\nHora vs Flamers\n\nhttps://ibb.co/cPPqVw\n\n*el numero de trolls, afks o flamers se representa 1 por partida y no por cada jugador (ya que habria 1000 jugadores)\n\n** los numeros se multiplicaron por 10 para lograr una estadistica mas cercana al 100 (redondeando al entero superior mas proximo)\n\n Como resultado se puede decir que:\n\n- la mayor parte de afks aparece en las horas de almuerzo (probablemente escuela o trabajo) entre 11 y 13 hs, y cena entre 9 y 11 hs.\n\n- los trolls no dependen de algun horario\n\n- los flamers tampoco parecen seguir un horario determinado, pero nunca se encontro una cantidad inferior al 50%","replies":[{"poster":"TeamSayori","date":"2017-11-05T10:03:21.405+0000","up_votes":2,"down_votes":0,"body":"a mi me gustaba jugar a las mañanas, la gente es mas paciente a esa hora, no hay mucho \"niños\" y no estan dormidos como en la madrugada","replies":[]},{"poster":"Thomas Griesa","date":"2017-11-05T00:40:14.314+0000","up_votes":2,"down_votes":1,"body":"Ninguna hora se salva {{sticker:sg-soraka}} \nEn lo personal a mí  me gusta jugar a la madrugada","replies":[{"poster":"Zafphlyn","date":"2017-11-05T01:43:17.222+0000","up_votes":2,"down_votes":0,"body":"A la madrugada es genial jugar, el unico problemas es que la gente está medio dormida pero a esa hora nadie usa internet y vuela para jugar lol, tampoco juegan niños y la gente suele ser mas competitiva y se va menos afk, yo noto muchísimo jugar a las 12-06 de la mañana que jugar en cualquier otro horario.","replies":[]}]},{"poster":"7Eien","date":"2017-11-05T01:01:33.467+0000","up_votes":3,"down_votes":1,"body":"A mi me gusta jugar en las manañas, generalmente hay gente amigable a esa hora.","replies":[]},{"poster":"Mazoku","date":"2017-11-05T00:44:02.936+0000","up_votes":3,"down_votes":2,"body":"Osea que mientras mas afks y trolls hay mejor es el horario.\n\nGracias por la info!","replies":[]},{"poster":"WhiteMax","date":"2017-11-05T00:40:30.547+0000","up_votes":3,"down_votes":2,"body":"Cuando los niños estan en la escuela, basicamente.\n\nPara mi la mejor hora es entre las 8 y las 10 AM o entre 13:30 y 4 PM.","replies":[]},{"poster":"Thotiana","date":"2017-11-05T01:25:39.502+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"fumatelatoda","date":"2017-11-05T02:03:09.374+0000","up_votes":1,"down_votes":0,"body":"El estudio es mas cuantitativo que cualitativo.\n\nIgual te comento algunos puntos:\n\n- entre los emparejamientos se encontraron las divisiones bronce, plata y hasta oro.\n- las primeras partidas fueron flex, hasta que al concluir la primer semana solo continuamos con partidas solo/duo.\n- el analisis es para la region de LAS, el video que linkeaste no se de donde toma esos datos por lo que las costumbres de cada pais son \n  distintas, por lo tanto no se conrresponden a nuestros horarios.\n\nDesde ya muchas gracias por comentar y aportar!","replies":[]}]},{"poster":"Raúl","date":"2017-11-25T02:26:52.686+0000","up_votes":1,"down_votes":0,"body":"Me parece una idea muy interesante, aunque es una lástima que la muestra sea tan pequeña. 10 partidas por cada hora no me parece que nos vaya a decir demasiado, puede verse afectado fácilmente por la casualidad.\nPero igualmente interesante.","replies":[]},{"poster":"OwenS","date":"2017-11-05T16:36:36.146+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Rasmus","date":"2017-11-05T23:14:12.343+0000","up_votes":1,"down_votes":0,"body":"Además no hay tanta gente flamer ni juegan 20 seguidas así llegar a oro 1 dia antes de cerrar la temporada","replies":[]}]},{"poster":"xDabax","date":"2017-11-05T05:52:35.881+0000","up_votes":1,"down_votes":0,"body":"No se por que generalizan a los niños {{sticker:zombie-nunu-bummed}}","replies":[{"poster":"Rasmus","date":"2017-11-05T23:13:13.232+0000","up_votes":1,"down_votes":0,"body":"Porque suelen ser mas inmaduros y la gran parte no juega de forma responsable ni en un alto rango. No estoy diciendo que todos sean así pero la gran parte si.","replies":[]}]},{"poster":"Insane Warlord","date":"2017-11-05T00:50:56.523+0000","up_votes":3,"down_votes":5,"body":"No se, a mi me tocan a cada hora y en el 90% de las partidas, si no es un troll es un afk o alguien sin cerebro. Estoy empezando a comprender porque se forma un flamer, es dificil mantenerse relajado cuando tienes una karma sin teclado, una sejuani que le tiene miedo al baron y un renek que se tira 1v5 en la misma partida. Estoy empezando a pensar que la victoria en este juego se define por pura suerte basado en el equipo que tenga menos de estos payasos.","replies":[{"poster":"Zafphlyn","date":"2017-11-05T01:45:27.325+0000","up_votes":1,"down_votes":2,"body":"Un poco sí, pero alfinal estas personas no te van a limitar tu elo, al final sube de elo quien es capaz de carrear a su equipo más que alguien que tenga buenas mecanicas, aunque van de la mano las dos cosas.","replies":[{"poster":"Gatito Jugon","date":"2017-11-05T12:05:50.239+0000","up_votes":1,"down_votes":0,"body":"El mismo DOPA ( uno de los mejores jugadores del mundo ) dijo en una entrevista, en la actualidad, el equipo que tenga menos mancos gana, asi esta lol hoy en dia","replies":[{"poster":"Zafphlyn","date":"2017-11-05T23:06:19.806+0000","up_votes":1,"down_votes":0,"body":"Pero si siempre es igual y es lógico quien tenga mas pros gana y quien tenga mas mancos pierde, es lógica básica y el es la prueba que si te lo mereces vas a subir tarde o temprano, agarra cualquier cuenta y la sube a challenger top 1 de korea en un mes.","replies":[]}]}]}]},{"poster":"Warwiick","date":"2017-11-05T19:46:55.120+0000","up_votes":1,"down_votes":0,"body":"ha buena entonces podre rankear el próximo año  :D\n\n\nha no muero en bronce \n\n{{sticker:cass-cry}}","replies":[]},{"poster":"Runth","date":"2017-11-05T06:03:14.598+0000","up_votes":1,"down_votes":0,"body":"cuando sacan el reclutamiento, es la mejor hora de rankear","replies":[]}]}