{"poster":"ArN Tretrix","date":"2017-07-06T12:06:38.664+0000","title":"Cosa si dicono i giocatori di un team organizzato in partita","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salve egregi signori,come da titolo vorrei capire  cosa differenzia un team organizzato da 5 persone che startano una partite per cazzeggiare in compagnia e insultarsi su teamspeak.\r\n\r\nFaccio un esempio per spiegarmi meglio: nella chat di un match ranked solo/duo dopo aver vinto un teamfight/fatto fuori un paio di nemici che passeggiavano in giungla,il primo che si sveglia scrive &#039;&#039;fast all baron&#039;&#039;, e di conseguenza il team si gruppa e fa l&#039;obbiettivo.\r\nMi &egrave; stato detto che invece nei team organizzati esiste &#039;&#039;il tizio delle calls&#039;&#039; colui che ogni qualvolta la situazione lo permette &#039;&#039;gestisce&#039;&#039; i compagni,mandandone per esempio un a splitpushare una lane mentre raggruppa i restanti a fare un qualsivoglia obbiettivo.\r\n\r\nIn parole povere:cosa accade nella chat vocale di un pro team durante un match?\r\nSpero ci abbiate capito qualcosa ^^&#039;","replies":[{"poster":"HaIIeIujah","date":"2017-07-06T12:18:24.078+0000","up_votes":5,"down_votes":1,"body":"In competitivo esiste uno o più shot-caller, un giocatore (il cui ruolo è irrilevante, ma solitamente jungle o supporto) che \"coordina\" il team in azione ed ha la parola definitiva sulle azioni da intraprendere.\n\nNon significa che controlla il resto del team direttamente: per esempio, è lo splitpusher a dover sapere quando può farlo o meno...ma è poi lo shotcaller a richiamarlo nel team quando necessario. Sempre in ambiente competitivo, ogni giocatore contribuisce con un flusso costante di informazioni al team, e spesso i singoli \" comandi\" sono condivisi piuttosto che imposti.  Lo shot-caller semplicemente ha l'ultima parola per vetare o dare il via ad una giocata.","replies":[]},{"poster":"NicFaser","date":"2017-07-06T12:55:37.464+0000","up_votes":2,"down_votes":0,"body":"Ho sentito una squadra dire HUNIII HUNIIII PENTA PENTA PENTA OOOOH HOOO OOOOOOOOOH ... ma non ricordo chi fossero ;-)","replies":[{"poster":"xBlitza","date":"2017-07-06T15:00:39.540+0000","up_votes":2,"down_votes":0,"body":"Anfaccia","replies":[{"poster":"NicFaser","date":"2017-07-06T15:03:08.109+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xBlitza,realm=EUW,application-id=MJVj50Jw,discussion-id=EjAbu9mR,comment-id=00030000,timestamp=2017-07-06T15:00:39.540+0000)\n>\n> Anfaccia\n\nPiù coreano del coreano !","replies":[]}]}]},{"poster":"Otivnaig","date":"2017-07-06T12:50:59.970+0000","up_votes":1,"down_votes":0,"body":"Coi miei amici di ts il più delle volte ci si lamenta dei compagni che fiddano, ci si insulta e cose simili. Però siamo felici","replies":[]},{"poster":"HeiKatarina","date":"2017-07-06T12:28:13.171+0000","up_votes":1,"down_votes":0,"body":"E non credo che non si facciano qualche risata durante i game xD","replies":[]}]}