{"poster":"Garenplank","date":"2016-09-22T06:42:27.146+0000","title":"Aurelion Sol ban rate?","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Aurelion Sol is one of the least picked champions, he is countered by most champions, especially all the popular AD mid laners.\r\nSo why is he banned 22% of the time.\r\nI know he is powerful, but why a 22% ban rate when he only has a 1.8% pick rate?\r\ni don&#039;t understand, is there something I&#039;m missing? \r\n\r\ncan someone please explain it to me?\r\nthanks","replies":[{"poster":"Freddymc","date":"2016-09-22T09:03:35.658+0000","up_votes":2,"down_votes":0,"body":"Aurelion is likely banned due to his potential to hypercarry and destroy entire teams by literally moving next to them. If you can get past his laning phase then you'll just demolish and outscale everyone.\nMost of his bans are likely in higher elo where more people will be skilled with him.","replies":[]},{"poster":"Nijel","date":"2016-09-23T02:07:14.322+0000","up_votes":1,"down_votes":0,"body":"Aurelion is the kind of champion that allows for a lot of mechanical and strategic expression. He can push in waves, roam, harass and do all sorts of other things I'm not going to pretend I understand (I mean, there are soooo many gank paths and angles most people never expect). Ultimately though, the high level of mastery required to play *as* and *with* him means Aurelion is an uncommon pick outside the higher end of the ladder where these elements really begin to collide. ","replies":[]},{"poster":"JimmyBoy","date":"2016-09-23T01:46:30.317+0000","up_votes":1,"down_votes":0,"body":"Hi, avid Sol player here.\nSol is just one of those champions that is extremely annoying to play against in lane (if the player is an experienced With Sol) and even if he goes up again against one of those ad mid laners(that if they make it past the ban phase) he still has the option to push out his lane very quick early levels and the play safe, until he is able to roam and carry though this side lanes. But once late game rolls around, and he has managed to survived, then it's simply game over.","replies":[]}]}