{"poster":"xAnGeLsTyLe","date":"2017-09-26T18:23:09.055+0000","title":"Sistema di honor e ban","subforum":"Discussioni generali","up_votes":2,"down_votes":2,"body":"Salve a tutti players, mi &egrave; successo circa un mese fa ormai di prendere 10 chat ristrette, quindi primo livello di ban. Premetto che io prima di questo ban gi&agrave; non riuscivo a salire di honor, infatti tutti i miei amici erano almeno al 4, io ricevendo i loro stessi identici honor ero ancora al 2 (prendendo almeno un honor a game da premade e non). Dopo il ban, nell&#039;arco di questo mese ho fatto circa 5-6 partite al giorno ricevendo ALMENO un 1 honor a partita (da premade e non), molte volte anche 2 o addirittura 3 quando carryavo ma non riesco a salire, sono bloccato al liv 1... Perch&egrave;?","replies":[{"poster":"ReyZør","date":"2017-09-26T18:50:09.072+0000","up_votes":3,"down_votes":0,"body":"Perchè il sistema funziona cosi. Non sei un giocatore sportivo? niente premi, dimostra per un periodo prolungato di esser cambiato e ti ridaranno i premi.\nEasy","replies":[{"poster":"xAnGeLsTyLe","date":"2017-09-26T18:54:07.707+0000","up_votes":1,"down_votes":0,"body":"Ma se ho scritto che anche prima di essere bannato non riucivo a salire pur prendendo honor, mi prendi in giro?...","replies":[{"poster":" HegeKyras","date":"2017-09-26T19:03:50.754+0000","up_votes":3,"down_votes":0,"body":"allora riguardo al lv honor pre punizione è possibile che ci sia stato un bug e dovevi contattare il supporto,dopo la punizione è abbastanza probabile che i tempi di risalita siano prolungati,nessuno di noi in realta sa bene come funziona,io ad esempio arrivato ad honor 3 mi sono preso un paio di mesi di pausa da lol e appena sono tornato a giocare in un paio di giorni di invasione(ne ho fatte piu o meno 40)sono passato ad onore 4 e oggi dopo un paio di settimane facendo 2/3 lande al giorno e non prendendo poi tanti onori(sono jng e nessuno ti onora se non li carry)sono passato al 5,ricordo invece che per arrivare ad onore 3 ci misi molto tempo venendo onorato spesso quindi è probabile che piu il lv è basso e piu i tempi di risalita si dilatano","replies":[{"poster":"Ser Nalor","date":"2017-09-27T07:01:08.551+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hege195,realm=EUW,application-id=MJVj50Jw,discussion-id=RJcrZb37,comment-id=000000000000,timestamp=2017-09-26T19:03:50.754+0000)\n>\n> allora riguardo al lv honor pre punizione è possibile che ci sia stato un bug e dovevi contattare il supporto,dopo la punizione è abbastanza probabile che i tempi di risalita siano prolungati,nessuno di noi in realta sa bene come funziona,io ad esempio arrivato ad honor 3 mi sono preso un paio di mesi di pausa da lol e appena sono tornato a giocare in un paio di giorni di invasione(ne ho fatte piu o meno 40)sono passato ad onore 4 e oggi dopo un paio di settimane facendo 2/3 lande al giorno e non prendendo poi tanti onori(sono jng e nessuno ti onora se non li carry)sono passato al 5,ricordo invece che per arrivare ad onore 3 ci misi molto tempo venendo onorato spesso quindi è probabile che piu il lv è basso e piu i tempi di risalita si dilatano\n\nup.\n\nda come si è visto più si è bassi di onore e più si ha la necessità di essere onorati molto per arrivare ai successivi livelli di Honor.\n\nHonor lvl 1 (o lvl 0 a volte) è sempre in seguito a delle punizioni, quindi credo che addirittura possa esserci tutto un primo periodo in cui puoi ricevere pure 4 Honor a partita ma essere questi ininfluenti alla scalata dei livelli Honor.","replies":[]}]},{"poster":"LoSnaso","date":"2017-09-26T21:00:21.971+0000","up_votes":1,"down_votes":1,"body":"Penso che un report per flame giustificato possa \"counterare\" una serie di honor. Non ti offendere, ma da come rispondi ai commenti di chi cerca di \"aiutarti\" ti meriteresti massimo l'honor 2. Insomma, qual è la risposta che vuoi? La riot ha sbagliato e tu meriteresti l'honor 5? No, sei un flamer, purtroppo non te lo meriti.","replies":[]}]}]},{"poster":"Nabbomaster","date":"2017-09-26T18:58:57.194+0000","up_votes":2,"down_votes":2,"body":"non ho capito, la gente ti onora perche' la flammi?","replies":[{"poster":"xAnGeLsTyLe","date":"2017-09-26T19:06:08.100+0000","up_votes":2,"down_votes":1,"body":"Non ho capito, tu commenti per sgranchirti le dita sulla tastiera? Quale parte di \"mi onoravano anche prima del ban\" non hai capito?","replies":[{"poster":"LoSnaso","date":"2017-09-26T20:54:22.574+0000","up_votes":2,"down_votes":0,"body":"No però davvero, tu flammavi (se no non avresti beccato le 10 chat ristrette) e la gente ti onorava comunque? \"LoL è strano Beppe\" -semi cit","replies":[]},{"poster":"Nabbomaster","date":"2017-09-26T20:34:34.215+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=xAnGeLsTyLe,realm=EUW,application-id=MJVj50Jw,discussion-id=RJcrZb37,comment-id=00010000,timestamp=2017-09-26T19:06:08.100+0000)\n>\n> Non ho capito, tu commenti per sgranchirti le dita sulla tastiera? Quale parte di &quot;mi onoravano anche prima del ban&quot; non hai capito?\n\nappunto se ti onoravano prima del ban vuol dire che ti onoravano quando li flammavi","replies":[]}]}]}]}