{"poster":"Arrionix","date":"2017-10-17T16:32:56.861+0000","title":"Clan / Gruppe / Team gesucht!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo :-)\r\n\r\nIch bin auf der Suche nach einem Clan / Team / Gruppe, die haupts&auml;chlich aus FUN LoL zockt und &ouml;fters mal, als Team in Spiele rein geht. Vielleicht auch ein Team was neu sich zusammen gestellt hat um n&auml;chste Season, als Gruppe antreten m&ouml;chte.\r\n\r\nZu mir: \r\n\r\nBin 30 Jahre alt\r\nBerufst&auml;tig ( Somit auch nicht dauer Online)\r\nSpiele selbst LoL ungef&auml;hr nen Jahr\r\nHab mich mal in Ranked versucht alleine und bin diese Season auf Bronze 1 gekommen. Hab aber nicht gro&szlig; gespielt weil es f&uuml;r mich alleine schwierig war da was zu machen, wenn man keinen Kontakt zum Rest des Teams hat und spiele dem entsprechend nur noch normals.\r\nHabe als ADC angefangen LoL zu spielen ( Ashe, MF, Lucian)\r\nHab mich dann auch mal an die Top und Mid versucht (Tyndra, Darius, Teemo,Nasus) (Ahri, Lux, Talon, Annie)\r\nWie es halt so ist habe ich gute und schlechte Spiele. Bin also auch kein Pro.\r\nAuch bei manchen Games begriffen bin ich noch Lernf&auml;hig. Da ich eigtl nicht so der Zocker bin und da halt noch nicht so die Erfahrung habe.\r\n\r\nDen Vorteil den ich aber habe ist: Auch wenn ich wenig Online bin, die Spiele die ich spiele, spiele ich zu 110% (Never Surrender!). Lernf&auml;hig und Teamplayer!\r\n\r\nAlso wenn Ihr einen Neuling (mehr oder weniger^^) gerne Nachhilfe geben m&ouml;chtet und auch neues und frisches Blut in euer Gruppe / Team / Clan sucht, dann habt Ihr mich gefunden! xDDD\r\n\r\nGr&uuml;&szlig;e Arrionix","replies":[{"poster":"Petra Paη","date":"2017-10-17T17:54:28.242+0000","up_votes":1,"down_votes":0,"body":"Hätte gerne frisches Blut in meiner Freundesliste xD\n- Ne im ernst;\n\nIch (25 Jahre alt) bin zwar kein Clan, aber besitze dennoch ein (eigenes) TS^^\nFreue mich eig immer wieder über nette Bekanntschaften, mit denen man gemütlich zocken kann und über Gott & Co zu reden (ok...über Gott eventuell nicht so :D )\n\nHab dich auch mal geaddet, aber eventuell gibt es ja noch was du vorher wissen möchtest,\ndaher schrieb ich mal hier noch rein :3\n\nLiebe Grüße\n\nPS: kannst auch gerne die Petra **Pań adden**, wenn du magst :)\n(Strich über dem \"n\" nicht vergessen^^)","replies":[{"poster":"Arrionix","date":"2017-10-19T05:09:57.924+0000","up_votes":1,"down_votes":0,"body":"Hallo :-)\n\nHab deine Anfrage angenommen. Hab allerdings selbst noch kein TS (Aber dann wird ich mir wohl ein Headset holen^^)\nKönnen ja dann mal schreiben wenn du online bist. \n\nliebe grüße","replies":[]}]},{"poster":"phildryzen","date":"2017-10-17T17:03:54.519+0000","up_votes":1,"down_votes":0,"body":"Hast du es mal auf [getsoj.com](http://www.getsoj.com) probiert? Ist ne Teamfinder App für LoL, ähnlich aufgerbaut wie Tinder und aktuell noch in der Beta. Da kannst du Spieler nach Elo, lieblings Lane, Alter, Geschlecht usw. filtern.","replies":[]}]}