{"poster":"FeeNeeX","date":"2017-03-03T03:09:34.220+0000","title":"Every-time i hit 35-37 min in a game i freeze for 5 sec ( why? )","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Sooo\r\n\r\nYeah this has been happening for a couple of months now and i don't know why\r\nI just freeze for 5 sec and then everything works again but i don't know why this is happening tho","replies":[{"poster":"Targons Blade","date":"2017-03-03T04:50:10.860+0000","up_votes":1,"down_votes":0,"body":"Does your entire PC freeze, or is it only certain elements in-game, such as champions, minions, health bars, etc? Are there any error messages or anything else that occurs when the freeze is actively going on?","replies":[{"poster":"FeeNeeX","date":"2017-03-03T13:52:16.027+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Targons Blade,realm=NA,application-id=osqw6G4M,discussion-id=K6uGKdwe,comment-id=0000,timestamp=2017-03-03T04:50:10.860+0000)\n>\n> Does your entire PC freeze, or is it only certain elements in-game, such as champions, minions, health bars, etc? Are there any error messages or anything else that occurs when the freeze is actively going on?\n\nWhen i reach 35-37 min time in any league game THE GAME freeze's for 5seconds and then it works normally again but before or after that time it works perfectly ( as perfectly as league can work )\n\nAnd no its not my pc everything else works \nBeen playing\nFar cry primal\nAssassin's creed syndicate\nDoom\n\nFor 4-6 hours straight and nothing like that ever happened so am assuming is your game that has the problem same with the match history website that i posted on my other thread and a Rioter thought it was my problem but when i send a support ticket to your technical stuff they said this\nhttp://i.imgur.com/1GbI5hP.png\n\nSo am 99% sure this is your problem too Riot\n\nPlease fix your game Riot","replies":[{"poster":"Targons Blade","date":"2017-03-05T21:35:02.457+0000","up_votes":1,"down_votes":0,"body":"While the Match History Page is an issue that we're aware of and are looking to fix, I've seen no other reports of your specific symptoms, so I think it's fair to assume this is caused by something local to your PC. A lot of freezes or system lock-ups are caused by a bad driver or hardware interaction. I strongly suggest working through the steps inside [**this guide**](https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes) to address the most common solutions for these symptoms.\n\nIf you continue to encounter this issue in-game after taking those steps, please let me know.","replies":[]}]}]}]}