{"poster":"oasterlukas","date":"2016-07-25T09:54:15.483+0000","title":"Welche Rolle passt zu mir?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo, \r\n\r\nIch wollte mal fragen wie ihr zu eurer Main Rollen gefunden habt. Seit dem ich LOL spiel, haben sich bei mir die Rollen nie ge&auml;ndert ich war immer MID/Supporter. Doch mittlerweile m&ouml;chte ich Support nicht mehr im Solo Ranked spielen und suche daher nach einer neuen Rolle. Leider wei&szlig; ich selber nicht weiter und beim ausprobieren der neuen Rollen in den letzten paar Wochen f&auml;llt mir immer mehr auf, dass ich einfach nicht mehr weiter wei&szlig; und nun sogar nach zwei neuen Rollen suche. Daher wollte ich mal wissen wie ihr zu euren Rollen gefunden habt oder was ihr in meiner Situation raten k&ouml;nnt?\r\n\r\nDanke im Voraus :D","replies":[{"poster":"Brynhíldr","date":"2016-08-01T13:54:05.059+0000","up_votes":1,"down_votes":0,"body":"Als ich damals mit League angefangen habe, wurde ich von meinen Freunden eiskalt zum Supporter degradiert, weil kein anderer die Lane spielen wollte. :D\nNach gut 3 Seasons, also jetzt Season 6, bin ich von der Position immer und immer mehr abgeneigt, obwohl ich eig. immer Spaß am Supporten hatte, auch in anderen Games (MMORPGs, Overwatch, ect)\nDa ich neben meinen schlecht bezahlten Job als Supporter sehr viel {{champion:103}} gespielt habe und sie nun Maine (vielleicht auch OTP), bin ich auf die Midlane gesprungen, da, wo ich eig, ursprünglich hinwollte. :D\nIch denke für Season 7, oder für Pre-Season 7 wird sich bei mir alles komplett ändern. Support-Medaille ablegen, mit Ahri in die Mitte hüpfen und vielleicht als 2. Role ADC nehmen, weil mir Toplane und Jungle nicht so gut liegen, vor allem Letzteres. (Zu bad für Objective-Control :3) Und vielleicht noch Namechange, um quasi DEN Neuanfang zu starten. :3\nBut for ever {{champion:117}} - Player!\n\nZum eigentlichen Thema: \nEinfach alle Positionen mehrmals durchgehen und die passenden Champions finden. Wer kein Interesse an Support-Champions hat, der wird auch auf der Support-Rolle nicht wirklich glücklich. \nJemanden einfach ne Position gut zuschreiben, wie bei mir, ist zwar ne Lösung, aber keine langfristige. \nTipp: Wenn du Bock z.B. auf Lee Sin hast, aber kein Bock auf Jungle, dann spiel ihn Toplane. Immer das machen, was einem Spaß macht und bei solch einer Entscheidung erst recht nicht auf die Meta achten, meiner Meinung nach.\n\nCheers Love {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Knightofthedawn1","date":"2016-07-27T00:58:07.260+0000","up_votes":1,"down_votes":0,"body":"Würd Top empfehlen.Musst dich nicht auf Jungle,ADC oder Supp umstellen die sich vergleichsweise relativ stark von Mid unterscheiden.","replies":[]},{"poster":"DBN Sishuki","date":"2016-07-26T14:57:09.100+0000","up_votes":1,"down_votes":0,"body":"Spielen, Spielen, Spielen mehr kann ich nicht sagen, irgendwann findest auch du Champs die dir auf einer bestimmten lane gefallen.{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"GAMEENZO","date":"2016-07-26T14:28:06.549+0000","up_votes":1,"down_votes":0,"body":"Das ist zwar im entdeffekt deine entscheidun aber probiere es mal mit adc bot oder jgl. . Ich war am anfang auch mid main und jtz mittlerweile spiele ich nur noch adc mit ezreal caitlyn etc.","replies":[]},{"poster":" 4 sec too late","date":"2016-07-26T11:19:09.118+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=oasterlukas,realm=EUW,application-id=Wj1wcocU,discussion-id=hdXFN52f,comment-id=,timestamp=2016-07-25T09:54:15.483+0000)\n>\n> Hallo, \n> \n> Ich wollte mal fragen wie ihr zu eurer Main Rollen gefunden habt. Seit dem ich LOL spiel, haben sich bei mir die Rollen nie ge&amp;auml;ndert ich war immer MID/Supporter. Doch mittlerweile m&amp;ouml;chte ich Support nicht mehr im Solo Ranked spielen und suche daher nach einer neuen Rolle. Leider wei&amp;szlig; ich selber nicht weiter und beim ausprobieren der neuen Rollen in den letzten paar Wochen f&amp;auml;llt mir immer mehr auf, dass ich einfach nicht mehr weiter wei&amp;szlig; und nun sogar nach zwei neuen Rollen suche. Daher wollte ich mal wissen wie ihr zu euren Rollen gefunden habt oder was ihr in meiner Situation raten k&amp;ouml;nnt?\n> \n> Danke im Voraus :D\n\nDie ersten 2 Seasons die ich aktiv gespielt habe war ich Supp/jungle in der Reihenfolge\n\nDoch habe ich  mich für die Kommende Season in die Rolle des AP Midlaners/Junglers entschieden.\n\nDIe Champion die du gerne Spielt entscheiden die Rolle in meinen Fall Vel'Koz/Brand(super Supp :D)\n\n> [{quoted}](name=Uranbrennstab,realm=EUW,application-id=Wj1wcocU,discussion-id=hdXFN52f,comment-id=0004,timestamp=2016-07-25T13:18:58.834+0000)\n>\n> War Main Sup und ab und zu Toplane, bis ich diese Season Bronze eingestuft wurde und schmerzlich erfahren habe, dass man als Support und Tank Toplaner nicht so Carryn kann, wie ich es gerne gehabt hätte. \n> \n> Deswegen bin ich jetzt Main ADC und Midlaner. War ein hartes Stück Arbeit den richtigen champion und die richtigen Mechaniken zu finden. Kiten, Sidesteppen, positioning usw. Aber mittlerweile bin ich von B3 zu S3 gekommen und hab lvl 7 auf Caitlyn.\n\nMage auf der Supplane picken  Brand/Vel/Zyra und du hast schon carry Potenzial :D","replies":[]},{"poster":"Uranbrennstab","date":"2016-07-25T13:18:58.834+0000","up_votes":1,"down_votes":0,"body":"War Main Sup und ab und zu Toplane, bis ich diese Season Bronze eingestuft wurde und schmerzlich erfahren habe, dass man als Support und Tank Toplaner nicht so Carryn kann, wie ich es gerne gehabt hätte. \n\nDeswegen bin ich jetzt Main ADC und Midlaner. War ein hartes Stück Arbeit den richtigen champion und die richtigen Mechaniken zu finden. Kiten, Sidesteppen, positioning usw. Aber mittlerweile bin ich von B3 zu S3 gekommen und hab lvl 7 auf Caitlyn.","replies":[]},{"poster":"YanKYhii","date":"2016-07-25T11:50:01.981+0000","up_votes":1,"down_votes":0,"body":"Spiel das worauf du bock hast,\n\nwas magst du für champs ?\nAp,Fernkampf,champs mit viel leben. etc \n\nder rest ergibt sich ja dann auf welcher position du spielst ;)","replies":[]},{"poster":"Time2Whine","date":"2016-07-25T10:56:04.751+0000","up_votes":1,"down_votes":0,"body":"Ich bin Main Support und 2nd Jungle. \nMeine Rolle habe ich gefunden, da ich schon immer derjenige war, der das Team unterstützt hat. \nProbiere einfach alle Lanes mal aus, jede hat ihre eigene Spielweise und Ansprüche. Da du selbst nicht sagst, was dir am ehesten liegt, kann man dir nur schwer weiterhelfen.","replies":[{"poster":"oasterlukas","date":"2016-07-25T11:06:28.403+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Time2Whine,realm=EUW,application-id=Wj1wcocU,discussion-id=hdXFN52f,comment-id=0002,timestamp=2016-07-25T10:56:04.751+0000)\n>\n> Ich bin Main Support und 2nd Jungle. \n> Meine Rolle habe ich gefunden, da ich schon immer derjenige war, der das Team unterstützt hat. \n> Probiere einfach alle Lanes mal aus, jede hat ihre eigene Spielweise und Ansprüche. Da du selbst nicht sagst, was dir am ehesten liegt, kann man dir nur schwer weiterhelfen.\n\nNunja wie erwähnt ich war bis jetzt seit dem ich Lol spiele, dass ist wirklich schon eine zeit lang seit dem ich spiele. Habe ich immer Support oder Mid gespielt. Früher war das nie ein Problem ich bekam ab und zu Mid und Support fast immer, da hatte ich noch den Vorteil das mein Gegener kaum Ahnung von Support hat. Aber seit der dyn q lande ich immer auf der Rolle Support und das reicht mir mittlerweile. Noch dazu spiele ich nun ungern in der Solo Q Support. Daher suche ich eine neue Rolle. Mid gefällt mir stark, doch da ich beim herum probiern einfach immer nur verweirrt wurde weiß ich nicht mehr was ich spielen soll.","replies":[{"poster":"Megamaexx","date":"2016-07-25T11:22:12.621+0000","up_votes":1,"down_votes":0,"body":"Die Frage, die sich mir stellt: Welche Rolle spielst du gern? \nBist du Tank-Supporter, kann Jungle gut was für dich sein, wenn du sehr gern CC nutzt, dann ebenfalls.\nLiegt Schaden bei dir gut im Rennen, lohnt es sich eher Mid und zzt. Top zu spielen.\nFarmst du gern safe oder bleibst allgemein mehr hinten, kommen ADC oder wieder ranged mid infrage","replies":[]}]}]},{"poster":"leonthefirefly","date":"2016-07-25T10:50:00.492+0000","up_votes":1,"down_votes":0,"body":"naja früher musste man ja alles halbwegs können ^^ bevor es  dyn q gab =). Da hab ich festgestellt das ich solo lanes bevorzuge (einfach leichter von da weniger kommunikation nötig) toplane fand ich doof weil ich weit weg vom geschehen war also mid und als sec jgl. Naja da ich aber kein guter laner bin...(zu agresiv verliere die minimap zu leicht aus den augen etc etc) bin ich jetzt mehr oder weniger bei jgl only gelandet.. aber top reizt mich auch mal wieder =)","replies":[]},{"poster":"h0ly jesiz","date":"2016-07-25T10:25:36.923+0000","up_votes":1,"down_votes":0,"body":"An deiner Stelle würde ich einfach etwas rumprobieren und testen, wenn du sagst du fühlst dich in der mitte wohl dann könnte auch top was für dich sein(wegen sololane) oder adc (wegen carry).\n\nGrundsätzlich ist hier wohl das beste viel auszuprobieren, spiel einfach mal normals wo du neue rollen testest.. Nach ein paar games wirst du bestimmt merken, obs dir gefällt oder nicht.","replies":[]}]}