{"poster":"Dr LouD","date":"2016-10-03T10:09:26.109+0000","title":"Una cosa che capita TROPPO spesso.","subforum":"Discussioni generali","up_votes":8,"down_votes":4,"body":"Quando gioco normal con altri premade, soprattutto se sono lowelo accade sempre la stessa cosa.\nGli faccio notare errori gravi che commettono e come risolverli, e loro con grande naturalezza mi flammano e mi dicono di rilassarmi perch&egrave; &#039;&egrave; una normal&#039;\n\nE spesso e volentieri dopo tutto questo le stesse persone commettono ancora ed ancora lo stesso errore, causando inevitabilmente la sconfitta, e accusandomi pure di essere tossico e di averla causata io quella sconfitta o.O\n\nQuello che mi chiedevo &egrave;: perch&egrave; questo comportamento?\nCapisco che &egrave; una normal, ma ogni momento &egrave; buono per imparare qualcosa in pi&ugrave;, e imho le normal servono proprio per imparare cose nuove. Essere testardi e non ascoltare gli altri &egrave; solamente controproducente.\n\nPoi praticamente sempre quelli che hanno questo comportamento sono anche gli stessi che si lamentano che non salgono perch&egrave; hanno &#039;i troll e gli afk&#039;, non perch&egrave; chasano il singed fino al nexus avversario.","replies":[{"poster":"Laiho88","date":"2016-10-03T13:36:49.976+0000","up_votes":1,"down_votes":0,"body":"magari trovassi io compagni che mi diano consigli, la chat la usano solo per dire\"u suck\" (detto da un blitz che 2 minuti dopo missa un grab su avversario stunnato)","replies":[{"poster":"Dr LouD","date":"2016-10-03T13:38:51.449+0000","up_votes":7,"down_votes":1,"body":"Un grab mancato è solo un predict che non ha mai smesso di sognare (?)","replies":[{"poster":"Laiho88","date":"2016-10-03T13:39:38.296+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=gHjnNHEg,comment-id=000e0000,timestamp=2016-10-03T13:38:51.449+0000)\n>\n> Un grab mancato è solo un predict che non ha mai smesso di sognare (?)\n\nun predict a un avversario stunnato per 2 secondi :D:D","replies":[]}]}]},{"poster":"Black Mantra","date":"2016-10-03T10:16:57.885+0000","up_votes":2,"down_votes":1,"body":"Non è necessario insegnare a gente random incontrata in normal come giocare meglio, a meno che non fai Madre Teresa di nickname.\nGo solo carry :D","replies":[{"poster":"Dr LouD","date":"2016-10-03T10:46:38.561+0000","up_votes":7,"down_votes":1,"body":"Ma mi da fastidio la gente stupida\n","replies":[{"poster":"xAle2x","date":"2016-10-03T12:39:05.261+0000","up_votes":3,"down_votes":0,"body":"Hai da soffrire in questa vita.","replies":[]},{"poster":"AnDGames","date":"2016-10-03T11:23:08.509+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=gHjnNHEg,comment-id=00020000,timestamp=2016-10-03T10:46:38.561+0000)\n>\n> Ma mi da fastidio la gente stupida\n\nè un bel problema","replies":[]}]}]},{"poster":"Dantazzo","date":"2016-10-03T11:28:04.843+0000","up_votes":5,"down_votes":1,"body":"Imad strikes again","replies":[{"poster":"Dr LouD","date":"2016-10-03T12:16:50.700+0000","up_votes":2,"down_votes":0,"body":"Ohh damn","replies":[]}]},{"poster":"JRobich","date":"2016-10-03T10:16:16.508+0000","up_votes":4,"down_votes":1,"body":"guardati questo video...\n\nhttps://www.youtube.com/watch?v=1-zf4lZsyJM\n\npaolocannone che cerca di fare il coach a un silver che dice di essere platino ma in silver perde..... \n\nil suo \n\"si ma tanto...\"\n\"ho preferito cosi...\"\n\"era uguale...\"\n\nsono veramente fastidiosi.... io dico un master ti da dei consigli e tu controbatti? cioè LOL...\n\ne lo stesso capita a te... ci sono persone che accettano consigli e persone che non li accettano...\n\nanche io ho fatto un game con te mi ricordo che ho fatto schifo.... che ti ho detto a fine partita? \"Scusa non ci stavo proprio....\" invece la maggior parte non capisce quando si perde per colpa loro...\n\nscusate ho scritto al volissimo","replies":[{"poster":"Sigmamoner","date":"2016-10-03T14:49:01.458+0000","up_votes":1,"down_votes":0,"body":"m'ha fatto morire...\n\nPC: \"allora, ripassiamo gli errori. Laning phase...\"\nR: \"il mid ha giocato bene!\"\n\nEpico!","replies":[{"poster":"JRobich","date":"2016-10-03T15:07:38.860+0000","up_votes":2,"down_votes":0,"body":"hahahahhahahahahahah \n\na me ha fatto morire quando alla fine dice\n\n\"devo scrivere un libro:  l'uomo che parlava ai francesi...\"","replies":[]}]},{"poster":"Menfrix","date":"2016-10-03T15:49:59.045+0000","up_votes":1,"down_votes":0,"body":"Secondo me la frase più bella è: PC \"ah, sei platino, dunque fai cag**e...\"\n\nEpica XD","replies":[]}]},{"poster":"Firenheit","date":"2016-10-03T23:39:10.777+0000","up_votes":2,"down_votes":0,"body":"http://ak-hdl.buzzfed.com/static/2014-08/29/16/enhanced/webdr10/anigif_enhanced-9754-1409344312-11.gif","replies":[]},{"poster":"zYaichi","date":"2016-10-03T10:39:10.885+0000","up_votes":1,"down_votes":0,"body":"Alla gente non piace farsi dire cosa fare e non capisce la differenza tra ordine e consiglio\nEppure non mi pare che se dico compra la qss contro malzhaar sia un ordine non sei costretto a farlo e non devi sentirti offeso tanto da offendere ma molti giocatori non lo caiscono e non mi stupisco perché la maggioranza dei giocatori sono bronzo e silver","replies":[{"poster":"Jaaaames","date":"2016-10-03T23:17:39.253+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=zYaichi,realm=EUW,application-id=MJVj50Jw,discussion-id=gHjnNHEg,comment-id=0005,timestamp=2016-10-03T10:39:10.885+0000)\n>\n> Alla gente non piace farsi dire cosa fare e non capisce la differenza tra ordine e consiglio\n> Eppure non mi pare che se dico compra la qss contro malzhaar sia un ordine non sei costretto a farlo e non devi sentirti offeso tanto da offendere ma molti giocatori non lo caiscono e non mi stupisco perché la maggioranza dei giocatori sono bronzo e silver\n\nHai detto una cosa **assolutamente** vera. A volte non importa ciò che dici, ma come lo dici.\n\nNon devi trattarli come se fossero in torto (anche se lo sono), trasmetti i tuoi consigli come una alternativa non come la verità assoluta.","replies":[]}]},{"poster":"DuckQuack0","date":"2016-10-03T16:08:00.726+0000","up_votes":1,"down_votes":0,"body":"Le ranked sono fatte per migliorare, non le normal.","replies":[{"poster":"Dr LouD","date":"2016-10-03T16:21:34.155+0000","up_votes":2,"down_votes":0,"body":"Se non sai la differenza tra pushare e freezzare le normal servono per migliorare, fidati\n\nTra l'altro, se sei low elo, le normal sono l'unica occasione per giocare contro e con gente di elo più alto, e quindi imparare da loro.","replies":[{"poster":"DuckQuack0","date":"2016-10-03T16:40:47.304+0000","up_votes":1,"down_votes":0,"body":"Per una parte concordo, dall'altra ci sono quelli come me che non giocano seriamente nelle normal, e non vedo come un low elo possa imparare da me non giocando seriamente\nSe mi trovassi almeno dei diamond contro magari giocherei un po' più seriamente, ma dato che la maggior parte è bronzo e silver...","replies":[]}]}]},{"poster":"Etoclas","date":"2016-10-03T12:21:22.464+0000","up_votes":2,"down_votes":0,"body":"Ciao,\nmi trovo nella tua stessa situazione. Cerco di essere sempre gentile, incoraggio la squadra, do consigli. La maggior parte delle volte (e non esagero) le persone se la prendono sul personale, metti che sono irritati perché è la quinta partita di fila che fanno, metti che sono morti pensando invece di prendere la kill.\nUltimamente cerco di incoraggiare solo quando i compagni fanno qualcosa di buono, di utile, mentre se muoiono, giocano da soli ecc.. cerco di non dire niente. Spesso non sentirsi criticati aiuta a pensare da soli all'errore e a migliorare.\nSempre \"wp, gj, nice\" alle kill delle altre lane, sempre incoraggiare gli altri. La chicca, secondo me, è non dire nulla quando sbagliano, sennò si sentono attaccati e vedo difficile riprenderli.\n\nEtoclas","replies":[]},{"poster":"Nabbomaster","date":"2016-10-03T11:02:13.230+0000","up_votes":2,"down_votes":0,"body":"non vedo il problema\nsapete che esista anche gente che gioca solo per passare il tempo, per sparare 4 cazzate su ts con gli amici mentri si fa una partita\nnon tutti perdono il sonno se non escono dal bronzo figuriamoci se perdono una normal\ne sinceramente quando gioco con gli amici preferisco divertirmi che vincere","replies":[{"poster":"Dr LouD","date":"2016-10-03T11:16:16.466+0000","up_votes":2,"down_votes":0,"body":"Ma infatti io semplicemente dico \"guarda qui hai sbagliato X, la prossima volta fai Y e vedi che va meglio\" e loro la prendono malissimo come se gli avessi insultato la madre o.O\n\nNon voler seguire i suggerimenti è una cosa, insultarmi perchè gli ho fatto notare un errore è un'altra","replies":[{"poster":"AnDGames","date":"2016-10-03T14:21:59.002+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=gHjnNHEg,comment-id=00070000,timestamp=2016-10-03T11:16:16.466+0000)\n>\n> Ma infatti io semplicemente dico &quot;guarda qui hai sbagliato X, la prossima volta fai Y e vedi che va meglio&quot; e loro la prendono malissimo come se gli avessi insultato la madre o.O\n> \n> Non voler seguire i suggerimenti è una cosa, insultarmi perchè gli ho fatto notare un errore è un&#x27;altra\n\nma il non seguire consigli dati ma non richiesti è un classico, non dei giochi online, ma della _real life_\nprobabilmente l'avrai fatto anche te, chissà quante parole dei prof ti sono scivolate via...\n\nnel mio lavoro mi sono reso conto di come la gente\n1. ignora i consigli, se non li ha chiesti.\n2. prende in scarsa considerazione i consigli dati nonostante te l'abbiano chiesto loro\n3. prende in grande considerazione i consigli dati su parcella\n\nfatti pagare, vedrai come ti danno retta\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Dr LouD","date":"2016-10-03T14:59:12.363+0000","up_votes":2,"down_votes":1,"body":"Sinceramente imho bisogna far tesoro di chi da consigli gratis (ovviamente se si ha la sicurezza che è una fonte sicura e affidabile) proprio perchè ormai chi ha conoscenze le elargisce agli altri solo dopo un comodo pagamento xD","replies":[]}]}]}]},{"poster":"SpideyPizza","date":"2016-10-03T10:51:27.532+0000","up_votes":2,"down_votes":0,"body":"in questo caso esiste l'omicidio u_u o il report anche se sono amici :D","replies":[]},{"poster":"vlakius","date":"2016-10-03T10:24:15.460+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=gHjnNHEg,comment-id=,timestamp=2016-10-03T10:09:26.109+0000)\n\n> \n> Quello che mi chiedevo è: perchè questo comportamento?\n>\n\nperchè la maggior parte della gente non è in grado di fare autocritica perchè significherebbe ammettere le proprie mancanze. Inoltre aggiungi il fatto che a cercare di fartele notare è un perfetto sconosciuto e che lo sta facendo di fronte a degli amici ed ecco che entra in gioco anche il fattore sociale dell' ostentazione di superiorità.\nPersonalmente preferisco aiutare solo chi lo chiede come qui sul forum e lasciare  questi elementi liberi di bronzeggiare per la landa.","replies":[{"poster":"Dr LouD","date":"2016-10-03T10:51:25.458+0000","up_votes":2,"down_votes":0,"body":"L'altro giorno mi hanno invitato 4 premade per una normal\n\n1 SIlver V e 3 Bronze II\n\nInutile dire che l'unica volta in cui stavamo per fare comeback è quando hanno ascoltato le mie call, il resto un tripudio di aram mid, chase di massa in jungle, fight ogni 2 minuti a random..\n\nE' stato un incubo... per fortuna ora è tutto finito.","replies":[{"poster":"vlakius","date":"2016-10-03T11:16:23.972+0000","up_votes":1,"down_votes":0,"body":"Bhe questa è la descrizione di una tipica partita in bronzo/silver e anche qualche gold xD","replies":[]}]}]},{"poster":"Frattaglia","date":"2016-10-03T10:15:00.997+0000","up_votes":2,"down_votes":0,"body":"Vogliamo parlare di quelli che \"eh ma io mi trovo meglio così\"? Eh? Eh? -_-","replies":[]},{"poster":"AnDGames","date":"2016-10-03T11:25:46.200+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=gHjnNHEg,comment-id=,timestamp=2016-10-03T10:09:26.109+0000)\n>\n> Gli faccio notare errori gravi che commettono e come risolverli...\n\nnon sei nuovo....quindi anni di lol ti hanno mostrato qual'è la conseguenza del dare suggerimenti....quindi perchè perseveri?","replies":[{"poster":"Dr LouD","date":"2016-10-03T12:16:27.406+0000","up_votes":3,"down_votes":1,"body":"Perchè di secondo nome faccio Ghandi","replies":[]}]},{"poster":"uFere","date":"2016-10-04T19:12:54.053+0000","up_votes":1,"down_votes":0,"body":"Ti prego maestro, insegnami\n\nNo dai sono serio ora, preferisco i player come te piuttosto che uno che flamma senza ritegno e senza manco dirti cosa avresti sbagliato","replies":[]},{"poster":"Olandèse Volante","date":"2016-10-03T23:08:52.133+0000","up_votes":1,"down_votes":0,"body":"Sai quante partite in normal ho perso per via di gente così? \nNon so se ti è di conforto ma non sei il solo... \nQuesta gente non si rende conto che a vincere la partita è il collettivo e mai il singolo, io posso fare pure score di 20/0/10 ma se dall'altra parte i 5 scarsoni collaborano meglio dei miei 4 cacciatori solitari la partita è persa a prescindere, vallo a far capire a questa gente!\nTi permetti di dire in chat \"go mid\" o \"all to the drake\"? Viene interpretato come un ordine che non va assolutamente eseguito manco fosse un segno di sottomissione, quando invece il succo è in base alle mia esperienza ti sto dicendo che pushare 3 lane in contemporanea da solo è impossibile e non ha senso stare tutti sulla stessa lane: vai a pushare altrove, oppure andate ora al drago perchè il momento è buono, tra poco passo e ce lo prendiamo dato che è il jungler che decide quando ingaggiare o meno draghi e barone... \nMa no: devono fare di testa loro tutto e il contrario di tutto con i risultati che conosciamo","replies":[]},{"poster":"SnowFlakeSkull","date":"2016-10-03T18:53:52.620+0000","up_votes":1,"down_votes":0,"body":"A me capita spesso che quando gioco con dei premade non distruggiamo manco una torre,arriviamo al 40° minuto con 0 torri distrutti e resistiamo e basta fino al 50° minuto perdendo il match ovviamente ahah!","replies":[]},{"poster":"Piemoo","date":"2016-10-03T17:01:56.484+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=gHjnNHEg,comment-id=,timestamp=2016-10-03T10:09:26.109+0000)\n> Poi praticamente sempre quelli che hanno questo comportamento sono anche gli stessi che si lamentano che non salgono perch&amp;egrave; hanno &amp;#039;i troll e gli afk&amp;#039;, non perch&amp;egrave; chasano il singed fino al nexus avversario.\n\nEhh, questi gobloddi. Son tutte perzone falze nella landa, per colpa loro non salgono.\n\nFai premade con me e insegnami tutto :3","replies":[]},{"poster":"Pls Buff Shen","date":"2016-10-03T16:26:04.394+0000","up_votes":1,"down_votes":0,"body":"Questione di testa, loro pensato a te come uno che vuole fare il forte ma secondo loro non lo sei. Lo dico per certo perchè pure io tempo fa lo pensavo, lo prendevo come un affronto un po come quando quando ti scrivono i simpaticissimi \"noob\" \"omfg\" se al primo consiglio fanno una cosa del genere bisogna ignorarli, c'è da dire che ci sono volte in cui li accettano, come in un mio game avevo l'ennessimo noc con la build atk speed che si lamentava di non fare danni ed io, dall'alto della mia mastery 6 gli ho detto in modo abbastanza stronzo che doveva andare ad per shottare invece che quello schifo di atk speed, mi ha risposto educatamente e poi mi chiedeva altri consigli su noc mentre eravamo in game, è stata una bella parentisi che fa capire che almeno c'è chi ha voglia di imparare.","replies":[]},{"poster":"Ringiel","date":"2016-10-03T13:30:24.777+0000","up_votes":1,"down_votes":0,"body":"ma questo succede in qualsiasi campo,non solo in lol ... i consigli quasi sempre vengono presi come insulti.\nnon so se guardi master chef(è il primo esempio che mi è passato per la mente)anche lì i comuni mortali dibattono e si incazzano ai consigli di chef internazionali,quindi figurati in un gioco ... la gente così è meglio non cagarla {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"wellyT93","date":"2016-10-03T12:32:51.751+0000","up_votes":1,"down_votes":0,"body":"Guarda te stesso e lascia stare gli altri, tutti sappiamo com'è la community in questo gioco. \nNon ne vale la pena, caso perso, se il 90% della community naviga tra il Bronzo 5 ed il Gold3 un motivo ci sarà.","replies":[]},{"poster":"NicogenFTW","date":"2016-10-03T10:17:26.085+0000","up_votes":1,"down_votes":0,"body":"Stfu io sono main yasuo silver, non accetto consigli da te visto che ho 300k punti maestria più di te, nabbo.","replies":[]},{"poster":"ilsimptico","date":"2016-10-03T17:44:52.267+0000","up_votes":1,"down_votes":1,"body":"Fanno così perchè X sbaglia, e Y, in pre con X, lo difende poichè è suo amico, X allora per non dirgli \"ehy Y non devi difendermi ho sbagliato io\" (per non dire che sta sbagliando all'amico che lo ha difeso quando lui ha sbagliato), dice \"Ehi nabbo te lo dice pure Y, fai schifo\" e così è come succedono parecchie di queste cose","replies":[]}]}