{"poster":"Cardmant","date":"2015-07-24T20:10:09.060+0000","title":"Are tier 2 runes ok at low level?","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"So, Im shocked how expensive tier 3 runes are. I&#039;ve been saving for two weeks and I&#039;ve finally got all the marks, seals and glyphs done. The quintessence&#039;s are still gonna be 3K. I know that tier 3 will always play better but tier 2 are 80% as effective and are a lot cheaper. Is it ok to use them at a lower level?","replies":[{"poster":"420Templar","date":"2015-07-24T20:15:03.115+0000","up_votes":2,"down_votes":0,"body":"Tier 2 runes are a complete waste of IP.\n\nTier 1 runes cost like 5 IP each so you should buy them until you can replace them with T3 runes.","replies":[{"poster":"Dr Poro","date":"2015-07-24T20:22:02.336+0000","up_votes":1,"down_votes":0,"body":"This guy is right. Tier 1 runes are virtually for free. If you buy 2 rune pages full of tier 1 runes, you wasted a 450ip champ, big deal. You'll get more ip simply by winning more games thanks to these runes.\n\nTier 2 runes are way more expensive for slightly better stats. They would be worth it if you used these runes for a long time, but you don't. You'll replace them with tier 3 which are again a lot more expensive for a bit more stats. These runes are very overpriced but since you use them for the rest of your time on this game, they're worth it. You can buy a few champions instead, but how often do you use those champs? You use your runepages EVERY game. So they're worth.\n\nBuy tier 1 first, as they're basically free, then skip straight to tier 3 for your long-term optimal runes.","replies":[]}]},{"poster":"InsaneSamurai","date":"2015-07-24T20:41:13.280+0000","up_votes":1,"down_votes":0,"body":"I think they took out the rune combiner.  Runes are basically just a forced IP sink so you get less champs.  The amount of low level players who use them are probably so low that it's not even worth the very reduced cost, since IP is so slow to gain.","replies":[]},{"poster":"Mr Hydde","date":"2015-07-24T20:38:53.483+0000","up_votes":1,"down_votes":0,"body":"If i recall correctly there is a rune combiner. not sure how efficient it is. but you can probably get some value back from t1/t2 runes that you have outgrown.","replies":[]},{"poster":"Cardmant","date":"2015-07-24T20:24:25.480+0000","up_votes":1,"down_votes":0,"body":"Thanks everyone :)","replies":[]},{"poster":"Names Are Scarce","date":"2015-07-24T20:20:19.616+0000","up_votes":1,"down_votes":0,"body":"T1 runes are extremely cheap. You can get a full set for a role after your first win of the day. The only downside is that they clutter your rune page once you have T3 runes.","replies":[]},{"poster":"EndlessSorcerer","date":"2015-07-24T20:14:57.103+0000","up_votes":1,"down_votes":0,"body":"T1 runes used to be worthwhile (extremely cheap for decent stats), but now that you can't use the Rune Combiner to get rid of them I wouldn't recommend it.\n\nI would recommend skipping T2 runes entirely.  They are too expensive for what they provide, especially since you'll just replace them with T3 runes eventually.\n\nJust save up for T3 runes.  It only takes about 16-18k IP to fill two basic pages that can adequately cover most champions.","replies":[]},{"poster":"MarkedOfKane","date":"2015-07-24T20:12:46.921+0000","up_votes":1,"down_votes":0,"body":"Basically. You grind til 30, once you are at 30, you play the game like everybody else.\n\nIts a beginner's trap to buy lower tier runes, just save for tier 3.","replies":[]},{"poster":"slippykitten","date":"2015-07-24T20:12:11.667+0000","up_votes":1,"down_votes":0,"body":"No, never buy tier 1 or 2 runes. They are a noob trap left in place by Riot so they can get more $$$ when you realize you wasted all your ip buying useless runes. \n\nI repeat - DO NOT BUY TIER 1 OR 2 RUNES EVER!!!!!!!!!!!!!!!!!!!!","replies":[]}]}