{"poster":"Frenzy","date":"2018-10-20T04:50:42.309+0000","title":"+1 Para que Riot vea esta propuesta interesante","subforum":"Charlas Generales","up_votes":4,"down_votes":18,"body":"Hola comunidad, Mi propuesta es la siguiente:\n\nNos les gustar&iacute;a ver mas campeones en el campeonato mundial? O solamente 20 o 30 de 100 y algo de champs en total.? \nMi propuesta es que el equipo que gano no puedo usar de vuelta a los campeones que usaron. Quiz&aacute;s 5 sea excesivo, pongamos 3. \nTenemos lo siguiente. Gana una partida un team, Son 5 campeones menos, La segunda, 10,etc. Que les parece? Abr&iacute;a mas variedad y seria mas interesante para el atractivo de la gente. Espero sus comentarios.\nSaludos {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Mazoku","date":"2018-10-20T05:13:41.709+0000","up_votes":4,"down_votes":2,"body":"Vote la opcion 2 porque es la que mas cerca esta de lo que pienso: Un rotundo NO.\n\nVeo las partidas del mundial para ver el mejor nivel de juego posible. Si quiero ver variedad de champs veo partidas de solo q.\n\n-1 al hilo BTW","replies":[]},{"poster":"Renekor","date":"2018-10-20T14:08:02.076+0000","up_votes":2,"down_votes":1,"body":"Te salio el tiro por la culata","replies":[]},{"poster":"Akari Kuro","date":"2018-10-20T13:33:44.116+0000","up_votes":2,"down_votes":1,"body":"este es de los años con mas variadad y te quejas?\ncomporalo con el año anterior y el mundial del pebetero ardiente; y te das cuenta que variedad sobra este año","replies":[]},{"poster":"Eternal Rain","date":"2018-10-20T20:18:06.283+0000","up_votes":1,"down_votes":0,"body":"La verdad me encanta está propuesta, se verían muchas más composiciones aunque el rendimiento bajaría en cuanto a mecanicas, por otro lado una lástima que a la gente no le suela gustar ver más variedad son muy insulso a la variedad.","replies":[]},{"poster":"Fransoi ","date":"2018-10-20T16:16:32.169+0000","up_votes":1,"down_votes":0,"body":"jajajaj 100 campeones xD son casi 150","replies":[]},{"poster":"wintermoon","date":"2018-10-20T14:06:26.711+0000","up_votes":1,"down_votes":0,"body":"¿Si sabes que en el mundial no son 5 randoms de SoloQ?","replies":[]},{"poster":"Zinc","date":"2018-10-20T06:49:47.732+0000","up_votes":1,"down_votes":0,"body":"No se podria, las composiciones, las estrategias, las rotaciones, los picks and bans, todo se entrena y se practica, lo cual seria algo tedioso si fuera cmo vos propones.","replies":[]},{"poster":"Jüstice","date":"2018-10-20T05:45:29.277+0000","up_votes":3,"down_votes":3,"body":"Rotundo no...\n\nEs como si a los jugadores de futbol les decis que en cada tiempo usen una pierna diferente para hacer pases o goles...","replies":[]}]}