{"poster":"Alice0o","date":"2015-03-01T14:04:58.877+0000","title":"Fehler beim aktualisieren vom Patch 5.4","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hey,\r\n\r\nich hoffe es kann mir jemand helfen. Beim Ermitteln der Unterschiede zum Patch 5.4 bekomme ich nach einigen überprüften Dateien (Anzahl immer Unterschiedlich) immer einen Fehler angezeigt. Es werden nicht alle Datein überprüft, ich bekomme nach einer gewissen Zeit die Meldung angeziegt :\r\n\"AKtualisierung fehlgeschlagen, Ein nicht spezifizierter Fehler ist aufgetreten. Bitte übermittle die Berichte, damit wir uns darum kümmern können. \"\r\nWeiß vlt. jemand von euch was ich da machen kann ? \r\nDanke schonmal für eure Hilfe.","replies":[{"poster":"Ray Hawks","date":"2015-03-25T08:19:26.965+0000","up_votes":1,"down_votes":0,"body":"Ich habe diesen Updatefehler regelmäßig bei den letzten größeren Updates. Meine Vermutung ist, daß es sich um ein Problem mit der Internet-Verbindung handelt. Ich bin bei mir mit UMTS von Vodafone online. Wenn ich meinen PC an eine Kabel-DSL-Leitung anschließe, läuft das Update völlig problemlos durch. Scheint also entweder an der UMTS-Verbindung, der langsameren UMTS-Geschwindingkeit, Den Verbindungsprotokollen oder einfach wiedermal an Vodafone zu liegen.\n\nDas Anstöpseln an eine Kabel-Leitung behebt bei mir zwar das Problem, allerdings hab ich wirklich keine Lust, jedesmal mein System ab- und aufzubauen und kilometerweit durch die Gegend zu kutschieren, wenn ein Update kommt.\n\nGrüße, Ray","replies":[]},{"poster":"Rkoturdo Ndo","date":"2015-03-01T14:43:24.824+0000","up_votes":1,"down_votes":0,"body":"Heya\n> \n    Stelle sicher, dass du alle Windowsupdates und Service Packs installiert hast\n    Achte darauf, dass LoL nicht unter C:\\Programme, C:\\Programme(x86) oder in User-Ordnern installiert ist\n    Öffne den Ordner C:\\Riot Games\\League of Legends\\RADS\\projects und lösche den Ordner lol_launcher\n    Lade diese Datei runter:\n        deutsch: http://wrenchbox.de/download/LoLRADS_EUW_german.zip\n        englisch: http://wrenchbox.de/download/LoLRADS_EUW.zip\n    Entpacke die Datei\n    Verschiebe die darin enthaltenen Dateien (lol.launcher.exe, lol.launcher.admin.exe und den Ordner RADS) in deinen Installations-Ordner von LoL.\n    Ersetze alle Dateien und Ordner\n        Solltest du nicht gefragt werden, ob du vorhandene Ordner oder Dateien ersetzen willst, hast du etwas falsch gemacht\n    Starte den Patcher\n\n> Der Patcher sollte nun wieder funktionieren. Das Spiel sollte also problemlos starten.\n\nMfG Rkoturdo","replies":[]}]}