{"poster":"Exedes1357","date":"2018-12-20T11:58:31.340+0000","title":"Coaching per un Gold?(o per chiunque ne cercasse uno)","subforum":"Reclutamento","up_votes":1,"down_votes":0,"body":"Salve, cerco un coaching per support possibilmente da un Plat II in su&#039; e anche gratis possibilmente xD\r\nVorrei anche che questa mia discussione venga utilizzata anche da altri utenti nel caso avessero bisogno di un coaching scrivendo un commento sotto questo post, in modo da dare possibilita&#039; a chi si vuole offrire ed a chi vorrebbe imparare un punto di incontro.\r\n2 anni fa c&#039;era un sito che faceva questo, che e&#039; stato anche postato sul Forum, ma purtroppo e&#039; stato abbandonato per ragioni a me ignote, non li condanno ma in parte e&#039; un dispiacere aver perso un opportunita simile.","replies":[{"poster":"Lord Shiver","date":"2018-12-22T01:36:15.949+0000","up_votes":1,"down_votes":0,"body":"se hai bisogno di un coaching addami su lol","replies":[]},{"poster":"Pykelicious","date":"2018-12-21T08:31:08.470+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Exedes1357,realm=EUW,application-id=n1bhmWE7,discussion-id=OKAuRn0l,comment-id=,timestamp=2018-12-20T11:58:31.340+0000)\n>\n> Salve, cerco un coaching per support possibilmente da un Plat II in su' e anche gratis possibilmente xD\n> Vorrei anche che questa mia discussione venga utilizzata anche da altri utenti nel caso avessero bisogno di un coaching scrivendo un commento sotto questo post, in modo da dare possibilita' a chi si vuole offrire ed a chi vorrebbe imparare un punto di incontro.\n> 2 anni fa c'era un sito che faceva questo, che e' stato anche postato sul Forum, ma purtroppo e' stato abbandonato per ragioni a me ignote, non li condanno ma in parte e' un dispiacere aver perso un opportunita simile.\n\nNon ho capito... vuoi essere coachato o dare lezioni?","replies":[]},{"poster":"zioposty","date":"2018-12-20T13:13:26.108+0000","up_votes":1,"down_votes":0,"body":"Io non capisco sta cosa del coaching online, perchè di questo si tratta, cercare di far imparare a qualcuno le cose e farsi pagare. A tal proposito ci sono i video, tutorial, partite intere caricate e giocate da pro player, c è di tutto su twitch e youtube, in particolare quest ultimo, dove puoi scegliere quale champion imparare , seguire, apprendere , spiegazioni su di esso ecc. Quindi mate, tu vuoi imparare blitzcrank? Guardati qualche video su blitzcrank e gioca, Fai Ranked, starta i game, devi sperimentare su te stesso. Se sei nabbo perderai sicuramente delle partite ma , se non sei stupido, capirai le basi, almeno quelle, del gioco, come comportarti in determinate situazioni e ovviamente la skill su determinati champ che andrai giocare e che vuoi mainare. Secondo te come ci sono arrivato a platino , facendomi seguire da qualcuno online e pagandolo? La cosa giusta sarebbe farsi ,al massimo, seguire fisicamente da un conoscente, un amico, che può spiegarti le cose da vicino, correggerti mentre giochi, ma ti ripeto, devi giocare, devi capire la mentalitá di questo gioco che, come tutti i giochi, non  è fatto per tutti. Se uno dopo 2, massimo 3 season non riesce almeno ad arrivare a gold ( un elo ormai sempre piu simile al bronzo dove per arrivarci si puo anche giocare senza mouse ) dovrebbe disinstallare , perchè è una scimmia e sta perdendo tempo. Si dice, quando ci si diverte non è mai tempo perso e concordo, ma se ranki e non sali e ti intossichi meglio smettere ! Comunque, per concludere, guardati qualche video, tutorial, italiano , americano che sia, e poi sperimenta, gioca, usa il cervello soprattutto perchè puoi essere meccanicamente forte quanto vuoi con un champ ma se sei stupido perderai e non salirai mai. Il discorso è sempre quello, ma molti fanno gli ipocriti, la gente gioca ranked perchè vuole salire ma poi capiscono di essere scarsi e non le giocano piu . I peggiori sono quelli che continuano a rankare non ottenendo risultati e pensando che la colpa sia degli altri xD Cervello, decision making, una volta usato e appreso ciò, riesci ad utilizzare qualunque champ e giocare qualunque ruolo però poi per salire e carriare ognuno ha i suoi champ e la sua lane, ognuno sa e ha un metodo di impatto sul game diverso da un altro. Io per esempio ti stompo un game giocando blitz supp, jax jung , yasuo mid \n( per citare 3 pick che uso di solito per carriare in 3 lane diverse) ma ovviamente sempre nei miei limiti nel senso che adesso riesco tranquillamente a competere con un diamond basso, ma sicuramente non con player superiori perchè , ti ripeto, io non sono forte, sono sopra la media dei player in generale ma non sono forte, i forti sono altri !","replies":[{"poster":"Ðeva","date":"2018-12-20T15:17:54.112+0000","up_votes":1,"down_votes":0,"body":"Stavo leggendo il tuo commento, dandoti ragione quasi in tutto... Poi leggo \"Yasuo mid\" e ... Niente, mi sei caduto male e non mi fido più di niente xD","replies":[{"poster":"zioposty","date":"2018-12-20T16:14:45.905+0000","up_votes":1,"down_votes":0,"body":"Non sono yasuo main però è il pick che uso spesso perchè mi piace e sono molto confident ma lo uso per lo piu in flex perchè in solo q gioco principalmente jung e supp.","replies":[]}]}]}]}