{"poster":"Neo Cyrus","date":"2014-09-30T20:27:29.598+0000","title":"Why do rework patches leave out info or straight-up lie?","subforum":"Gameplay","up_votes":72,"down_votes":28,"body":"The Sona rework patch left out all numbers to try to avoid backlash. This Cassiopeia rework straight up lies. If a rework nerfs a champion so badly that you have to lie about it, then for once stop and consider that maybe you screwed up. Which of course you did.\n\nThe patch notes - http://na.leagueoflegends.com/en/news/game-updates/patch/patch-416-notes\n\n**Q - Nerfed from 235 + 0.8 AP 3s CD 0.60s delay to 235 + 0.35 AP 4s CD 0.65s delay** - Mentions damage nerf but doesn't mention CD nerf which renders the passive CDR moot, nor does it mention that it has a larger delay.\n\n**W - Full damage nerfed from 585 + 1.35 AP 9s CD to 270 + 0.90 AP 10s CD** - Patch notes make it sound like it was just a tiny change from 65 + 0.15 to 30 + 0.1 and leave out the CD nerf. Most people don't realize it's 7 seconds + 2 more making it 9 total, the nerf is monstrous.\n\n**E - Nerfed from 190 + 0.55 AP 0.5s reset to 155 + 0.60 AP 0.7s reset** - Patch notes pretend the base was always 155. Later patch claims 0.7s nerf was a \"bug\" despite it being reported 9007 times during the PBE cycle long before the \"rework\" was released, just like Sona's Q range.\n\n**R - Nerfed from 450 + 0.60 AP 110s CD to 350 + 0.50 AP 100s CD** - Patch notes pretend nothing was changed except accuracy.\n\nHow stupid do you think the average player is? People notice these things, it just makes you look bad.\n\n10% Spell Vamp, 3% mana on kill, and E resetting on use rather than on hit doesn't make up for gutting her numbers. The rest of the bonuses aren't actual bonuses, they're lies, stats simply removed and added to a theoretical end-game that doesn't happen. That's not a rework, that's cutting out all her damage and restoring part of it after a 45 minute stacking game. This is the most atrocious \"rework\" I have ever seen. Waiting another week for more data will yield the same thing.\n\nEdit: To be clear the calculations have all been done already. Just dig up any of the threads or find it in the mega thread. Even after being pigeon-holed into a build that forces you to use Rabadon's to get a 77.45% boost in AP and if you somehow manage to get 400 stacks (1.3x1.3x1.05=1.7745) it's still a very heavily nerfed champion end-game. Particularly considering your damage is now all pretty much single-target rather than strong AoE. In any real scenario instead of a crazy imaginary one this nerf is massive even when taking into consideration the best cases of the realistic ones, as in all things being considered with that 77.45% boost which rarely  happens.\n\nYour lies/patch notes and your excuses in them sicken me and your contempt for your player base makes it sound like you need a new job. Now whenever we see patch notes we'll have to assume they're not true until we can confirm them, nice job, Riot really needed a reputation as liars.","replies":[{"poster":"Worgslarg","date":"2014-09-30T21:32:41.001+0000","up_votes":7,"down_votes":25,"body":"While you may be right about the patch notes, you made your point into a giant Cass rework sucks Q-Q thread. If you're gonna complain about the rework, at least make it a post about her.","replies":[{"poster":"Serpents Embrace","date":"2014-09-30T22:54:39.870+0000","up_votes":18,"down_votes":0,"body":"So you're saying we should wait until there's another case of this? Where they present a rework with missing, misleading or false numbers before mentioning that it's a huge transparency problem and has definitely ruined the game for some players?\n\nDo you really want Sion's rework to suffer just because you wanted to let them get away with it until it was more common problem?","replies":[]}]},{"poster":"Hyper Neon","date":"2014-09-30T23:17:13.597+0000","up_votes":9,"down_votes":2,"body":"Thank you for sacrificing your time and effort in order to bring light to Cassiopeia's \"rework\" and how it made her become worse in the end.","replies":[]},{"poster":"chriserit","date":"2014-09-30T20:52:25.217+0000","up_votes":5,"down_votes":0,"body":"Q:  Strike after 0,6 seconds delay --> Strike after 0,65 seconds delay","replies":[{"poster":"Neo Cyrus","date":"2014-09-30T20:58:18.684+0000","up_votes":6,"down_votes":3,"body":"I missed the change in delay, the sources I used to confirm the numbers didn't mention it. Do you have a source for that to confirm it so I can update my post?","replies":[{"poster":"chriserit","date":"2014-09-30T21:02:40.891+0000","up_votes":6,"down_votes":0,"body":"I don't remember where but i read it in lot of posts\nanyway even wiki says so http://leagueoflegends.wikia.com/wiki/Cassiopeia\n\nPatch History:\nNoxious Blast.png Noxious Blast\nNew ability animation.\nAP scaling reduced to (+35% AP) from (+80% AP).\nBonus movement speed changed to 10 / 15 / 20 / 25 / 30 % from 15 / 17.5 / 20 / 22.5 / 25%.\nCooldown increased to 4 seconds from 3.\nMana cost changed to 40 / 45 / 50 / 55 / 60 from 35 / 45 / 55 / 65 / 75.\nDelay increased to 0.65 seconds from 0.6\n\nEdit: http://boards.pbe.leagueoflegends.com/en/c/champions-gameplay-feedback/NmQ44cEA-cassiopeia-texture-and-gameplay-update\nHere is Stashu saying it too","replies":[{"poster":"Neo Cyrus","date":"2014-09-30T21:06:48.176+0000","up_votes":5,"down_votes":2,"body":"I can't believe I missed that. Thanks, I'll update my post.","replies":[]}]}]}]},{"poster":"Canastus","date":"2014-10-01T14:23:25.865+0000","up_votes":7,"down_votes":1,"body":"Let's not forget the biggest lie of them all:\n\n>Most importantly, I'd like to reassure all of our Cassiopeia players that **this is not intended as a nerf.** If anything, these changes seek to increase her viability.","replies":[]},{"poster":"Sintobus","date":"2014-09-30T22:00:26.555+0000","up_votes":12,"down_votes":13,"body":"So mind if I do some basic theory crafting here with you? Just to throw some numbers out there...\n\n*Cassiopeia gains a stack of Aspect of the Serpent for each second that an enemy champion is poisoned, for each poisoned unit that she kills and when she hits an enemy champion with Twin Fang, up to a max. of 400 stacks.*\n\nTheoretically just poisoning someone non-stop it would take just under 7 minutes to get 400 stacks (400 seconds / 60 = 6.66-6)\n>because it was missed the above less than 7 mins is based off someone purely being poisoned for that entire time solid which is obviously impossible\n\nThat is just landing poison on someone which is relatively simple the biggest weakness being the cast time between casting and the poison landing on the ground.\n\nYou **ALSO** get a stack for every twin fang landed \n\n{{champion:69}} \n> RANGE: 700 COST: 30 / 45 / 60 / 75 / 90 MANA COOLDOWN: 5\n> ACTIVE: Cassiopeia fires fangs at an enemy, dealing magic damage. If her target is poisoned, Twin Fang's cooldown is reduced to 0.5 seconds.\n> MAGIC DAMAGE: 55 / 80 / 105 / 130 / 155 (+ 40 / 45 / 50 / 55 / 60% AP)\n> If Twin Fang kills the target, refunds its mana cost plus 3% of her maximum mana\n\nIf I were to compare this to another champions basic farming spell it would have to be Annie.\n\n{{champion:1}} \n> Disintegrate\tRANGE: 625 COST: 60 / 65 / 70 / 75 / 80 MANA COOLDOWN: 4\n> ACTIVE: Annie blasts target enemy with a fireball, dealing magic damage.\n> MAGIC DAMAGE: 80 / 115 / 150 / 185 / 220 (+ 80% AP)\n> If Disintegrate kills the target, it refunds its mana cost and its cooldown is halved.\n\nLooking at these two I would have to say Cassio is more capable of DPSing and sustain off of twinfang than annie is with Disintegrate. She gets more mana back, a lower cooldown, longer range and not to mention the spell vamp essentially from her passive. That dosen't look that bad to me.\n\n\nNow lets look at her Q and W from what you posted\n\n>** Q - Nerfed from 235 + 0.8 AP 3s CD 0.60s delay to 235 + 0.35 AP 4s CD 0.65s delay**\n>** W - Full damage nerfed from 585 + 1.35 AP 9s CD to 270 + 0.90 AP 10s CD**\n\nQ had its AP ratio cut in over half oh boohoo its harder to land free aoe damage on someone~\n\nLets compare her Q her aoe near instant harass to another champion karthus.\n\n> Noxious Blast {{champion:69}}  RANGE: 850 COST: 40 / 45 / 50 / 55 / 60 MANA COOLDOWN: 4\n> ACTIVE: Cassiopeia hurls poison at the cursor's location, which strikes after a 0.65 second delay. All enemies within the 75-radius area are poisoned, taking magic damage over 3 seconds.\n> MAGIC DAMAGE PER SECOND: 25 / 38.33 / 51.67 / 65 / 78.33 (+ 15% AP)\n> TOTAL MAGIC DAMAGE: 75 / 115 / 155 / 195 / 235 (+ 45% AP)\n> Cassiopeia gains a movement speed boost for 3 seconds if Noxious Blast damages a champion.\n> MOVEMENT SPEED: 10 / 15 / 20 / 25 / 30%\n\nNow Karthus {{champion:30}}  and his MAIN harass in lane\n> Lay Waste\tRANGE: 875 COST: 20 / 26 / 32 / 38 / 44 MANA COOLDOWN: 1\n> ACTIVE: Karthus creates a point of unstable magic at the target location that detonates after a 0.5 second delay, dealing magic damage to enemies in a 200 radius area (the damage is doubled if only one enemy is hit).\n> MAGIC DAMAGE (MULTIPLE TARGET): 40 / 60 / 80 / 100 / 120 (+ 30% AP)\n> MAGIC DAMAGE (SINGLE TARGET): 80 / 120 / 160 / 200 / 240 (+ 60% AP)\n\nSo what do we see here? Cass has a harder time landing her Q in a smaller area alright. The delay is higher and the aoe is smaller. Is this her main DPS in lane? No it is suppose to be her E. Lets take a look at her damage her base numbers are pretty similar for damage versus karthus single target damage. The difference here? She lands that full damage in an AoE DoT. She also gains %Move speed for 3 seconds similar to {{item:3044}} \n\n\n> **Have to reply to myself my post is too long**","replies":[{"poster":"Sintobus","date":"2014-09-30T22:09:01.087+0000","up_votes":9,"down_votes":12,"body":"Now lets look at her W\n You have it as W - Full damage nerfed from 585 + 1.35 AP 9s CD to 270 + 0.90 AP 10s CD\n\n> Miasma\tRANGE: 850 COST: 40 / 50 / 60 / 70 / 80 MANA COOLDOWN: 14 / 13 / 12 / 11 / 10\n> ACTIVE: Cassiopeia throws a growing cloud of poison to a target location, granting sight of the area and growing from a radius of 125 to 250 over 7 seconds. Enemies in the area are poisoned, slowed, and take magic damage per second for 2 seconds. Continual exposure renews the poison.\n> MAGIC DAMAGE PER SECOND: 10 / 15 / 20 / 25 / 30 (+ 10% AP)\n> MAX. MAGIC DAMAGE: 90 / 135 / 180 / 225 / 270 (+ 90% AP)\n> SLOW: 25 / 30 / 35 / 40 / 45%\n\nThe only champion who has an AoE slow similar to this would be Anivia with her ultimate but I am not going to compare an ultimate with a basic skill even if it has a low CD.\n\nWhat I see here is that you can MASSIVLY slow in a growing area and your issue with it is the increase in CD as well as a drop in AP ratio\n\n\nIn fact your primary gripe is her passive where they adjusted her skills to have a higher CD and lower AP ratios..\n\nWell lets see here in each skill you presented they increased her cool down by roughly 10% but gave her a passive of 25% cooldown...\nYou complain about her Ap ratios being dropped about 30% but you don't know how her passive ap bonus works?\n\n> Aspect of the Serpent can effectively increase Cassiopeia's ability power up to 30%.\n> Aspect of the Serpent's stacks multiplicatively with both Rabadon's Deathcap and Archmage mastery Archmage. The three combined increase her ability power by 77.45% or by 70.625% when using Wooglet's Witchcap item.png Wooglet's Witchcap instead.\n\nNo other champion in league has that kind of ability to scale AP so high. \n\n**TL;DR** Her Q and W are no longer her primary harassment tools as they want to encourage play with E. Her passive more than makes up for it and if you are actually using your E it should not take 45 minutes as people claim to stack to 400 for more AP than most champions can obtain.","replies":[{"poster":"Gaston du Coteau","date":"2014-09-30T22:52:30.369+0000","up_votes":6,"down_votes":3,"body":"***","replies":[{"poster":"Neo Cyrus","date":"2014-09-30T22:55:46.571+0000","up_votes":8,"down_votes":2,"body":"You forgot to mention that it's all single target now and not AoE anymore, even while doing less.","replies":[{"poster":"Sintobus","date":"2014-09-30T23:43:47.284+0000","up_votes":4,"down_votes":7,"body":"Whats single target? Her Q and W are still aoe and damage all in the aoe... What have you been playing? Her E was never AoE \n\nI don't understand what your saying there Neo...","replies":[{"poster":"Neo Cyrus","date":"2014-10-01T00:01:48.241+0000","up_votes":8,"down_votes":1,"body":"The damage output of Q and W have been reduced the point that they don't do much compared to before even taking into consideration a 77.45% boost in AP which only occurs sometimes... very late game, in a best case scenario. Early to mid game their damage is quite negligible.\n\nIt's not like I want this to be bad. I WANT this to succeed. Before speaking at all I made an Excel spreadsheet to do the calculations myself because people tend to exaggerate or miss details. The result was a lot worse than I initially thought and are very troublesome considering you're pretty much locked into building Rabadon's and Seraph's now if you want results end-game.\n\nI hope I somehow missed something, forgot to calculate something, so it ends up being better than I think. But even if that was the case (I can't imagine I missed anything) that still leaves early and mid game decimated.","replies":[{"poster":"Sintobus","date":"2014-10-01T00:11:52.179+0000","up_votes":2,"down_votes":4,"body":"I get what your saying but can you share that spread sheet in a google docs or something? Much appreciated.\n\nAlso I still do not see where your talking about the AoE on her skills now being single target???\n\nAnd I sorta agree being locked into a build is not amazing but lets be honest 2 items is better than ADCs current build choices...","replies":[{"poster":"Neo Cyrus","date":"2014-10-01T00:37:09.970+0000","up_votes":7,"down_votes":1,"body":"Let me clarify, I never said her AoE abilities are now single target, I was saying now that Q and W are so heavily nerfed the great deal of her damage is now single target and she no longer does great AoE damage like before.\n\nAs for the spreadsheet I was thinking about sharing it but it's incomplete and I'm so sick and tired of this I don't know if I want to bother finish it. Here's a shot of it with everything being calculated with a flat 700 to make a quick comparison, which is why I turned off the modifiers in it (Rabadon's, Masteries, Passive). And yes I realize the combo I listed with the R rarely happens, I just wanted to give an example with lots of poison but few shots of E which happens if you get chased away while they stand in poison anyway. Parts of it were copy/pasted from another which I was including auto attacks in combos which is why it lists armour and base AD.","replies":[{"poster":"Sintobus","date":"2014-10-01T01:34:45.929+0000","up_votes":4,"down_votes":3,"body":"Thanks for the share and I can defiantly see where this is coming from. Looking at the raw numbers like that defiantly gives me the impression she is much weaker than she use to be. To me tho that is just looking at a small side of things. One of the biggest DPS factors is the change to E reset since you literally had about a second travel time prior take that along with the then reset upon landing and it would be 1.5 to 2 seconds slower between Q's.\n\nIMO two big gimps to casio if I had to suggest a \"fix\" is cast animations and her almost entirely DoT damage output.\n\nThey toned down other factors of her kit to not only make E the primary choice for DPS but to also give her a sudo buff. Skills overall received some minor and some major nerfs to compensate for this. Do I think that alone ideal justifies it? No but I do feel like they have a positive contribution to her long term kit. \n\nHer cast animations are probably one of the biggest gimps in 1v1 situations tho. Someone like syndra can easily out burst cass early mid game no question because of the raw functionality of her kit. Cassio get this sort of unwanted trade of utility in terms of a field sustained slow and a self movement speed buff.\n\nYou miss a Q while kiting tho and its over old cass or new.\n\nThat is why I feel at least in my opinion the numbers aren't her biggest issue.\n\n\nFocusing on the numbers tho you find out very quickly even mord getting a hyper fed kass as a ghost can't match her potential max AP. I can re-do it if need be but it was something along the lines of 1774 AP\nGranted in a NORMAL match or RANKED this is essentially impossible to get a build like that. What we want and what I am seeing people talk about here is the \"realistic\" 700 AP standpoint. I feel like too many of these calculations lack the entire point of view tho what is the utility cass have worth? What about her new passive versus her old and its interaction with her kit? Theoretically on raw numbers alone like in your spreadsheet her damage output would literally kill an entire enemy team in under 10 seconds. Yet we know even the most fed cass nothing like that happens. \n\nAlso I have a request can you pull up her entire old kit by chance? Like every aspect of it and all skills? I'd like to do some looking over but the issue is all the numbers I see for her OLD kit are just the shown changes in the patch notes. I agree riot does hidden changes now and then but things like cast animation times and delays are generally never spoken of anyway.","replies":[{"poster":"Champion Skin","date":"2014-10-02T10:28:59.461+0000","up_votes":2,"down_votes":0,"body":"The problem with having most of Cass damage on E is that while her damage while stationary or close to it while spamming E is greater (this is given the target is poisoned and that Cass has enough mana to be able to spam E) however while running/moving I would think that Cass damage is less as then I would think that Cass mostly rely on Q/W to speed up herself and slow down the enemy ( I believe this might be the case however I haven't tried how easy it is to run backwards while spamming E)\nAnd Cass will likely get less speed from Q as Q gives less speed at lvl 1-2 and you will likely not max Q as leveling E increases the AP ratio so this is kind of necessary to get more DPS though it is probably safer to max Q as it gives more speed and you don't need to be close to the enemy for so long\n\nAnd while Cass might do as much damage as before, I would think it was easier getting the gold and items before as you would get more damage earlier and would be able to control the lane or get kills easier\n\nAnd there is also this thing with being a late game carry which has few defensive measures against all in and is rather weak early and then being forced to get into the enemy's range to \"harass\" for stacks\n\nAnd her getting such insane amounts of AP can also be a disadvantage against Veigar given that he deals more damage with ult the more Ap you have","replies":[]},{"poster":"Neo Cyrus","date":"2014-10-01T01:56:54.188+0000","up_votes":3,"down_votes":1,"body":"The beef a lot of us have is that this rework makes an annoying mini game of getting stacks, we hate that, it essentially shits on her early and mid game and only gives you back some power if you manage to hit 400 stacks by late game. A lot of people have said even if this Cass was viable, even if it was strong, they'd still hate this rework.\n\nI find these reworks to be insanity, they're making wild changes, incredibly unpopular changes, for champions that didn't actually need reworks.\n\nThe reason the numbers are so huge in that screenshot is because they're not including any resistances which would cut the damage into a fraction. Mid champs often (always?) have 30 base MR, and ranged ones have scaling MR as well. Then there's MR runes and items.\n\nAs for Cass's old kit, whenever the numbers are not available you can go look archives of wikis to see what something was at a certain date.\n\nIIRC the only notable differences not listed here already are the mana costs and her Q giving 30% MS instead of 25%, and the W granting 45% slow instead of 35%. That's about it.\n\nHere's the one posted earlier:\n4.17 - http://leagueoflegends.wikia.com/wiki/Cassiopeia\n4.15 - http://leagueoflegends.wikia.com/wiki/Cassiopeia?oldid=2121881","replies":[]}]}]}]}]}]}]},{"poster":"Sintobus","date":"2014-09-30T23:33:49.541+0000","up_votes":5,"down_votes":8,"body":"So your going to cuss me out and get upvoted for it? I thought this board was separate from general discussion or did you leak over? \n\nAnyway insults aside and attempting to have a real conversation here. The 400 stacks is very manageable and I have done is in almost every game with the quickest time being 18 minutes an averaging 25 mins. I did the number crunching in my post with comparisons to champions with similar skills and showed how they compare with my opinion. All you did was cuss me out and cry to nothing but what everyone else has said. There is minimal reference to all these comparisons and you have done nothing to compare the changes to the nerfs. This is a discussion you want to reply then start by coming up with a point.","replies":[{"poster":"Gaston du Coteau","date":"2014-09-30T23:41:58.281+0000","up_votes":5,"down_votes":2,"body":"You're making up a scenario to make an argument, making up a case that doesn't exist and responding with a solution that doesn't exist. Such as Cass primarily harassing with Q and W in the past, that was never the case. You're stating things known to be false, then standing there and saying \"well, see\". Also known as a false dilemma straw man argument.\n\nNo. The reason more people haven't responded is because we know you're talking nonsense. There's a thread hundreds of pages long where every calculation has been done. Cass is weaker than ever before, even full build, proper build, end game with max stacks. No one is going to have a \"discussion\" with a troll.\n\nEdit: Apparently I'm breaking the \"don't be a jerk\" rule. My bad. I'm done here.","replies":[{"poster":"Riot King Cobra","date":"2014-09-30T23:54:21.792+0000","up_votes":3,"down_votes":4,"body":"> You're making up a scenario to make an argument, making up a case that doesn't exist and responding with a solution that doesn't exist. Such as Cass primarily harassing with Q and W in the past, that was never the case. You're stating things known to be false, then standing there and saying \"well, see\". Also known as a false dilemma straw man argument.\n> \n> No. The reason more people haven't responded is because we know you're talking out of your ass. There's a thread hundreds of pages long where every calculation has been done. Cass is weaker than ever before, even full build, proper build, end game with max stacks. No one is going to have a \"discussion\" with a troll. Take your false scenarios, false info, and generic strawman arguments and shove them up your ass.\n\nThe calculations that people have done are all incorrect. Here's some back of the envelope calcs to show that Riot succeeded in pushing her into the role of \"late game single target DPS monster\":\n\nAssume 700 AP (the break even point for Twin Fang)\n\nOld Cass combo at max range of Twin Fang (DPS in 3 seconds or the duration of Q):\nQ: 235 + .8 x 700 = 795\nW: (65 + .15 x 700) x 3 = 510\n3 Es: 190 + .55*700 = 1725 (remember CD reset is actually .5 seconds + travel time)\n\nTotal: 2235.8 to a single target\n\nNew Cass:\nQ: 235 + .45 x 700 = 550\nW: (30 +.1 x 700) x 3 = 300\n6 Es: 155 + .6 x 700 = 3450 (reset is on cast)\n\nTotal: 4300 per 3 seconds to a single target\n\nHer damage to single targets has almost doubled come late game from that simple fix to Twin Fangs.\n\nAlso, if you play Cassio enough, you will have no problem getting those 6 fangs in with how generous the new Twin Fang reset mechanic is. Her late game single target DPS is insane. Banshees doesn't even cut off Cassio's Twin Fang spam anymore if they are already poisoned (hello Miasma) because it resets on cast. She is doing exactly what Riot wants her to do. All she needs is some early game tweaks.","replies":[{"poster":"Neo Cyrus","date":"2014-10-01T00:23:40.319+0000","up_votes":6,"down_votes":1,"body":"I'm glad you feel alright with it, but her single target damage is not the issue, her overall power being reduced dramatically with the Q and W nerfs is along with the other issue that ties into that... her early and mid game are horrendous.\n\nOld:\nQ - 235 + 0.8 x 700 = 795\nW - Minimum -  65 + 0.15 x 700 = 170 | Maximum is x 9 (7s + 2s) = 1530\nE - 190 + 0.55 x 700 = 575\nR - 450 + 0.60 x 700 = 870\n\nRandom combo example (yes I know this is not great and it's flawed but I'm just giving random examples of how much the W and Q nerfs hurt) if you can't continue spamming E if you get chased off and they eat your poison anyway:\nR Q W Ex6 = 6645\n\nGeneric combo that often happens:\nQ Ex4 = 3095\n\nNew:\nQ - 235 + 0.45 x 700 = 550\nW - Minimum - 30 + 0.10 x 700 = 100 | Maximum (x 9) = 900\nE - 155 + 0.60 x 700 = 575\nR - 350 + 0.50 x 700 = 700\n\nR Q W Ex6 = 5600\nQ Ex4 = 2850\n\nDifference:\nQ - 245\nW - 630 Max\nE - 0\nR - 170\n\nR Q W Ex6 - 1045\nQ Ex4 - 245\n\nMaking the enemies eat poison is not that hard but staying in 700 range for Twin Fangs often is. I don't need to tell you that, you understand the champion better than pretty much anyone here. I think we'll all agree that her early game and even mid game are serious problems.","replies":[{"poster":"Riot King Cobra","date":"2014-10-01T01:41:53.769+0000","up_votes":2,"down_votes":3,"body":"> I'm glad you feel alright with it, but her single target damage is not the issue, her overall power being reduced dramatically with the Q and W nerfs is along with the other issue that ties into that... her early and mid game are horrendous.\n> \n> Old:\n> Q - 235 + 0.8 x 700 = 795\n> W - Minimum -  65 + 0.15 x 700 = 170 | Maximum is x 9 (7s + 2s) = 1530\n> E - 190 + 0.55 x 700 = 575\n> R - 450 + 0.60 x 700 = 870\n> \n> Random combo example (yes I know this is not great and it's flawed but I'm just giving random examples of how much the W and Q nerfs hurt) if you can't continue spamming E if you get chased off and they eat your poison anyway:\n> R Q W Ex6 = 6645\n> \n> Generic combo that often happens:\n> Q Ex4 = 3095\n> \n> New:\n> Q - 235 + 0.45 x 700 = 550\n> W - Minimum - 30 + 0.10 x 700 = 100 | Maximum (x 9) = 900\n> E - 155 + 0.60 x 700 = 575\n> R - 350 + 0.50 x 700 = 700\n> \n> R Q W Ex6 = 5600\n> Q Ex4 = 2850\n> \n> Difference:\n> Q - 245\n> W - 630 Max\n> E - 0\n> R - 170\n> \n> R Q W Ex6 - 1045\n> Q Ex4 - 245\n> \n> Making the enemies eat poison is not that hard but staying in 700 range for Twin Fangs often is. I don't need to tell you that, you understand the champion better than pretty much anyone here. I think we'll all agree that her early game and even mid game are serious problems.\n\nThose combos aren't realistic though. For the old Cassio, you would not get 6 Twin Fangs off unless you were literally on top of the enemy. Especially in a team fight! If you got 4 Twin Fangs off in 1 Q duration then you were also not at the maximum range for Twin Fang. Yes, old Cassiopeia did a lot of AOE damage with Q and W, but Riot SPECIFICALLY changed this about her in the rework. They WANT her damage to be vastly single target and they HUGELY increased that late game in terms of raw damage, reliability (Twin Fang check), and safety (CD on cast lets you get maximum single target DPS from max Twin Fang range and you get spell vamp). You really cannot compare just the numbers. \n\nI agree with you that her early game is probably too weak or that her stacks are too hard to stack - but her damage late game is absolutely fine. They just need to fine tune the path to get there.\n\nAnother example:\n\nYou are kiting a champion out. You have 300 AP. Let's look at the classic Q+E combo at 700 range (Twin Fang range):\n\nOld Cass: \nQ: 235 + .8 x 300 = 475\nE: 190 + .55 x 300 = 355\n\n3 Second combo at 700 range: Q E E E = 475 + 355 x 3 = 1540\n\nNew Cass:\nQ: 235 + .45 x 300 = 370\nE: 155 + .6 x 300 = 335\n\nNEW 3 second combo at 700 range: Q E E E E E E = 370 + 335 x 6 = 2380\n\nNew Cass deals 840 more damage at 300 AP in 3 seconds with 300 AP than old Cass does while having a higher movement speed on max Q simply because of the Twin Fang change.","replies":[{"poster":"Neo Cyrus","date":"2014-10-01T02:12:10.236+0000","up_votes":5,"down_votes":1,"body":"Landing 6 Es while they stand in poison was always possible. They won't do that in Diamond unless they're stuck in a position but in lower Elos they stand in poison all the time. And I already said I know that's heavily flawed, I just wanted to point out how heavy the poison nerfs were.\n\nI find your comparison of landing 6 Es now compared to 3 Es absolutely ridiculous though. The difference should be a single one at most. And I often did get off 4 Twin Fangs for 1 Q, and yes you're right, it was pretty much impossible staying at max range while doing that unless they were running.\n\nAnd again I'm not disputing her late game single target damage (though I do dispute your 6 Es Vs 3 Es claim), I'm saying her AoE damage has gone out the window.\n\nMy points are not anything any of us are arguing. We all agree her early and mid game are horrible and that she lacks AoE damage now.","replies":[{"poster":"Riot King Cobra","date":"2014-10-01T02:36:30.545+0000","up_votes":1,"down_votes":2,"body":"> Landing 6 Es while they stand in poison was always possible. They won't do that in Diamond unless they're stuck in a position but in lower Elos they stand in poison all the time. And I already said I know that's heavily flawed, I just wanted to point out how heavy the poison nerfs were.\n> \n> I find your comparison of landing 6 Es now compared to 3 Es absolutely ridiculous though. The difference should be a single one at most. And I often did get off 4 Twin Fangs for 1 Q, and yes you're right, it was pretty much impossible staying at max range while doing that unless they were running.\n> \n> And again I'm not disputing her late game single target damage (though I do dispute your 6 Es Vs 3 Es claim), I'm saying her AoE damage has gone out the window.\n> \n> My points are not anything any of us are arguing. We all agree her early and mid game are horrible and that she lacks AoE damage now.\n\n\nI mean it's basic math...\n\nTwin resets in exactly .5 seconds now. In 3 seconds....you get 6 Twin Fangs. The reason I use 6 seconds instead of 5 to be conservative is because they made the reset very forgiving - which makes the window for getting in 6 Twin Fangs a bit larger than 3 seconds.\n\nFor the old Cassiopeia, her Twin Fangs didn't reset to .5 seconds on cast, they reset on hit, which meant you got no more than 3 at max Twin Fang range. If you hit 4 you were getting pretty close to the enemy.\n\nI don't see how that's very disputable. \n\nHer rework made her stronger in terms of single target DPS than old Cassio as soon as you get a decent mana pool + max rank in Twin Fang (Level 9) unless you are point-blank in somebody's face.  Her AOE isn't as good until late game - which is intended. If Cassi had strong AOE damage in addition to her stupid single target damage then she'd be broken. \n\nIf people want her to do AOE damage then her Twin Fangs CAN'T do a lot of damage at all. If you want AOE damage though, you are better off going with Ziggs, Xerath, Karthus, etc. They put out more AOE DPS than Cassio from a much safer distance or with much more efficiency. \n\nCassiopeia's niche isn't AOE damage - it's single target. They only need to help her early game and she will be completely fine. :D","replies":[{"poster":"Neo Cyrus","date":"2014-10-01T02:57:36.488+0000","up_votes":3,"down_votes":1,"body":"I definitely would land 4 Es before, I could have sworn I used to land 5 often but now that I stop to think of it you're making me second guess myself. It's been a long time since I used to play Cassiopeia and as soon as I decided to pick her up again this rework appeared on the PBE, all feedback was ignored, and here we are.\n\nIf she's truly to be a hyper carry late game I don't see the problem even if she did larger AoE damage. But even ignoring that, going in a circle again my beef is her pathetic early and mid game. Twin Fangs really shouldn't start with a 0.4 ratio, she's already super weak early game... and she sure as hell shouldn't require 400 stacks unless they decide to give you more ways of getting stacks or more at a time. It sure as hell shouldn't be 75 200 400. 75 150 225 300 would be more realistic.\n\nCompare her to Ryze, his early and mid game is sunshine and rainbows compared to Cass. No other hyper carry in the game has to suffer through such a joke of an early game.","replies":[]}]}]}]}]},{"poster":"Sire Hippington","date":"2014-10-01T02:05:08.491+0000","up_votes":5,"down_votes":1,"body":"It's true that her singletarget dps in the late is higher due to faster resets, but it comes at a high price u seem to ignore.\nHer early laneing is far worse than before, as Q+W were the primary poke and waveclear tools. Her aoe damage in clashes got lowered alot, her overall damge early to mid is lower, and most off all the dmage she could do from a save range got lowered alot.\nIf u can stay 3 sec in e range u deal more damage than before, but in most fights that would mean u get in cc-range and short after die, as cassio usually is the focustarget of the enemy team.\nCassios problem never was a lack of potential lategame damage, she lacked the abillity to deal the damage without getting jumped on instandly.\nthx to Q+W, she had enough ranged aoe to be somewhat relevant, and could oportunistic go in with E for high dps.\nNow she barly does anything with Q in the late, and W is just a slw with not much damage, so all she has is the very risky E. While the new selfheal takes a bit risk from E, she still is way to vulnerable to cc and burst to reliable use the dps.\n\nSo even if u get through her now weak early and mid, u will still be less effecktive than old cassio in most games, as u lack the high aoe-dps from save range her old Q + W gave","replies":[]}]}]}]}]},{"poster":"Orbv","date":"2014-10-01T18:38:17.417+0000","up_votes":5,"down_votes":0,"body":"Not only are Q and W not harassment tools, they serve no beneficial feature to Cass in lane, even less so than before the rework. The buffs to her speed boost and slow only kick in when both skills are fully ranked, otherwise they're lower. Her wave clear is horrible, and her E only adds a stack on minions when that minion is killed while poisoned, so you spend more mana trying to get stacks than you actually receive from the first 2 fangs.\n\nThis rework RUINED Poke-styled Cass, ruined it. There is only 1 way to play her now, and as someone who played her tons in normals/ranked since '11, I hate that I'm limited. She can't be used for Dominion or Twisted Treeline because otherwise her stacks will never even reach 250. And if you incorporate Liandry's at all into your build, you are doing less damage.","replies":[]}]}]},{"poster":"Serpents Embrace","date":"2014-09-30T20:39:49.562+0000","up_votes":15,"down_votes":9,"body":"You've noticed, then, the sheer rate that they're peddling out this shit right now - yeah? I don't know why but \"quality\" was knocked off of Riot's priority recently.\n\nThanks for crunching all the numbers, though. It just gives further credence to the outcry on the Cassiopeia rework. In Cassi's case, though, it seems less to be Riot as a whole or a company and more about Stashu and his unprofessional conduct when it comes to communication. If you've checked out [this post](http://forums.na.leagueoflegends.com/board/showthread.php?p=50163542#50163542) he's basically saying he won't deal with anything said in his thread when he *finally* feels like getting back to us on it.","replies":[{"poster":"Neo Cyrus","date":"2014-09-30T20:50:02.978+0000","up_votes":9,"down_votes":3,"body":"How's this for a number; when comparing 155 to 190 that'd take 700 AP to equal out with a ratio difference of 0.05. It doesn't perfectly work out like that when everything else is calculated but I think you get my point.\n\nThe E is her only remaining real source of damage and they felt that nerfing that was appropriate as well despite the rest of her kit being essentially deleted. And they sit there wondering why her win rate dropped to 30% at high Elo.","replies":[{"poster":"Serpents Embrace","date":"2014-09-30T20:57:17.274+0000","up_votes":5,"down_votes":4,"body":"I'm surprised it stayed that high, tbh.\n\nI just think there's a lot conceptually wrong with the rework, even besides the sheer number loss. Why would you make a passive that gives incentive on building AP to get more AP - and the mutilate how well the champion uses AP? Yay, you can get higher amounts of AP and do less with it. :\\","replies":[{"poster":"Vellich0r","date":"2014-10-01T04:47:05.972+0000","up_votes":2,"down_votes":1,"body":"agreed, they need to give her a moderate improvement in ratios. What i feel would be a good idea is to increase ratio's, up base damage on q/w slightly, lower the rewards on the passive, but make them easier to obtain. All those stats are great, but if you cant obtain them or use them they are useless.","replies":[{"poster":"Serpents Embrace","date":"2014-10-01T22:08:06.338+0000","up_votes":5,"down_votes":0,"body":"Honestly, I'd really prefer a live revert until they sort it out.\n\nFalling short of that, though, the base damages and AP ratios need to be fixed in some way. The worst part is that the passive is garbage:\n\n* The AP% increase is only bad right now because of the ratios, but it's not really that appealing either - especially coming from a champion who was never really much of an AP stacker instead going for itemization like Rylai's/Liandry's or WotA to benefit from her already low cooldowns or high damage. \n* The CDR on the passive needs to be replaced. All it really does is limit her itemization choices. You want to get early CDR? You're wasting your money because at some random point in mid game your CDR is maxed out without items. (25% + 5% masteries + 10% blue buff/pot)\n* The sustain is the only *interesting* part of the passive but it falls short due to the lousy numbers.\n\nI also disagree on the obtaining part. They're easy to obtain in the sense that you get them for a lot of things you'd do anyway. Poisoning champions, killing minions and using your E. The **problem** with the stacking part is that the stacks are the **only** reward for doing those things because your poisons don't deal any significant damage, gold has a depreciated value on you because your scalings are extremely weak and your E isn't good until full build. \n\nMy vote would be to throw the passive out. If they insist on keeping it, it needs to be *less* of a focus and *more* of a bonus.","replies":[]}]},{"poster":"Neo Cyrus","date":"2014-09-30T21:19:20.883+0000","up_votes":6,"down_votes":2,"body":"Since the buff of 0.1 AP on the Q, 10 mana per level, and the 0.5s delay on the E rather than 0.7s here's the easiest to gather high Elo results from all the servers combined:\n25th - 46.64%\n26th - 37.97%\n27th - Data missing (don't know why, everything shows as 0% picked)\n28th - 44.65%\n\nThe rest of the data hasn't been updated yet. This shows that restoring the E to a 0.5s reset time did make a difference but it still averages out towards a 40% win rate. I'm confident when the data updates and we wait another week it'll be more of the same or lower after people remember how easy it is to shut down Cass, especially this relatively helpless one during early game.\n\nBetter charts show the win rate is so shit because she never reaches the 45 minute mark to have 400 stacks and enough AP to work. In fact it showed her win rate always averages below 50% UNTIL the 45 minute mark. The win rate under 25 minutes was something in the 20s. No surprise there. I can't find the link but if I do I'll update this and post the article.","replies":[]}]}]},{"poster":"Vellich0r","date":"2014-09-30T21:44:27.181+0000","up_votes":9,"down_votes":13,"body":"its not fair to say quality overall has been reduced. Just look at Sion's rework, it is currently looking fantastic. Not to say your other points arent necessarily valid, but look at the good AND the bad, don't tunnel vision.","replies":[{"poster":"Serpents Embrace","date":"2014-09-30T21:57:43.200+0000","up_votes":8,"down_votes":4,"body":"Skarner, Sona, Cassi, Essence Reaver...\n\nSion being a **possible** exception doesn't really nullify any of that, does it?","replies":[{"poster":"Vellich0r","date":"2014-10-01T04:39:31.985+0000","up_votes":5,"down_votes":8,"body":"first off, essence reaver was a new item that is still being improved upon, second skarner rework is currently in a fantastic state, sion IS an exception, viktor rework was awesome, soraka rework is high quality and very effective, sona rework is debatable, need i go further? you are looking at the bad 40% without giving the good 60% even an honorable mention.","replies":[{"poster":"Serpents Embrace","date":"2014-10-01T21:53:08.648+0000","up_votes":4,"down_votes":0,"body":"Optimism is such a horrible affliction.","replies":[]}]}]}]}]},{"poster":"Canastus","date":"2014-10-02T08:23:37.291+0000","up_votes":5,"down_votes":0,"body":"The recent PBE changes went up and once again Cass was left out of the loop.\n\nThey're simply mocking us at this point.","replies":[]},{"poster":"Canastus","date":"2014-10-08T20:27:05.642+0000","up_votes":3,"down_votes":0,"body":"[Looks like my fears were actually confirmed.](http://na.leagueoflegends.com/en/news/game-updates/patch/patch-418-notes) Not a single trace of any further Cass changes. They're simply going to pretend as if nothing ever happened and leave her to rot.\n\nDo not let them get away with this. Keep those threads up every single day until they give in.","replies":[{"poster":"Neo Cyrus","date":"2014-10-08T20:59:40.303+0000","up_votes":4,"down_votes":0,"body":"They might just be doing the classic \"wait 1 to 2 years until everything else has been nerfed several times\" tactic which was done many times before. A champion is left horribly undpowered with horrendous win rates, then two years later it's viable due to everything else being significantly nerfed and every idiot comes out saying \"see it was good all along\".\n\n\"We always admit our mistakes\" - Too bad it's always insincere and nothing is ever done about the mistakes.\n\nEven with the only games on record being mains and botters significantly inflating her win rates it's still incredibly low 2 weeks after the last \"buff\". I bet they thought they were seeing improvement with one day (at Diamond) hitting 47%, then bam back into the 30s.","replies":[]}]},{"poster":"Riot King Cobra","date":"2014-10-01T02:07:49.762+0000","up_votes":4,"down_votes":4,"body":"It can be argued that Cassiopeia's old passive was a chore as well. If you didn't main Cass it was an absolute pain in the ass to remember that you need to spam a spell every 5 seconds. For those who played her a lot, it became almost second nature, but her old passive was much less friendly than the new one. Additionally, her old passive basically become useless late game if you opted for Tear or, god forbid, Athene's. \n\nLooking beyond the numbers, the changes to Cassio weren't \"wild\" and they definitely were not \"incredibly unpopular\" (although the thread on general discussion would make you say otherwise). Her kit is largely the same. They just shifted her power around. There are about 20-30 (realistically it's something like 15 people) people on the forums here who are very vocally against the rework. However, I would say that the vast majority of players though are more than OK with the changes to Cass. And while it sucks that SOME of her mains have to suffer, in the grand scheme of the game, she's in a healthier and more balance-able position.","replies":[{"poster":"Neo Cyrus","date":"2014-10-01T02:37:15.791+0000","up_votes":4,"down_votes":2,"body":"You're one of the few Cass mains with tons of games on her so of course I believe what you're saying. But when I said wild changes I wasn't just referring to this rework, I was referring to the recent ones like the Sona one which I will never accept. It was the only support I would play and now to me it's dead even if someone else loves it. It's too unrealistic having to be on top of your teammates all the time and sets up too much potential for the enemy team especially in ranked team 5v5s which is where I would play her.\n\nI don't mind a shift in power, but it's not a shift that's a problem, it's a removal because it clearly does not equal out. Her win rate at Diamond wouldn't be like 40% right now compared to the old 48-52% numbers which were often the case. She needs straight up buffs, big ones, to her mid and early game. But they're stubborn as ever, just like with Sona I don't see them fixing the problems.\n\nThe time for \"adjustment\" is over for the players, as if much was needed, from here now the opposite effect happens, people adjust to Cass and remember how to shut her down. The win rates will gradually go down after initially going up for a bit.","replies":[{"poster":"Riot King Cobra","date":"2014-10-01T02:59:59.945+0000","up_votes":1,"down_votes":1,"body":"> You're one of the few Cass mains with tons of games on her so of course I believe what you're saying. But when I said wild changes I wasn't just referring to this rework, I was referring to the recent ones like the Sona one which I will never accept. It was the only support I would play and now to me it's dead even if someone else loves it. It's too unrealistic having to be on top of your teammates all the time and sets up too much potential for the enemy team especially in ranked team 5v5s which is where I would play her.\n> \n> I don't mind a shift in power, but it's not a shift that's a problem, it's a removal because it clearly does not equal out. Her win rate at Diamond wouldn't be like 40% right now compared to the old 48-52% numbers which were often the case. She needs straight up buffs, big ones, to her mid and early game. But they're stubborn as ever, just like with Sona I don't see them fixing the problems.\n> \n> The time for \"adjustment\" is over for the players, as if much was needed, from here now the opposite effect happens, people adjust to Cass and remember how to shut her down. The win rates will gradually go down after initially going up for a bit.\n\nI haven't really spent time looking at Sona's rework so I'm not fit to comment on that. I can understand your frustration though in that. \n\nShe most definitely needs buffs - not big ones though. She really becomes a monster once she gets her items. A few tweaks that allow her to get to late game easier will be great. I think they will come. The reason we see none of the PBE right now is because there isn't sufficient data with the Twin Fang fix in my opinion. \n\nI think it's why they put Cassio on free week again. It will encourage more people to play her and they will be able to get a lot more information on her current state.\n\nI assume we will see buffs to her in the coming week after Riot has time to go through the free week game data.","replies":[{"poster":"Serpents Embrace","date":"2014-10-02T00:52:31.288+0000","up_votes":5,"down_votes":1,"body":"\"Once she gets her items\" failing to mention that it will always be the same set of items because the rework restricted her possible build paths a lot. :\\ \"Monster\" or not they stripped away a lot of what made her fun to main, and it's really shocking that you of all people gloss over that.","replies":[]},{"poster":"Neo Cyrus","date":"2014-10-01T03:10:33.882+0000","up_votes":3,"down_votes":1,"body":"I should clarify, I meant she needs huge buffs to her early game and in turn buffs to her mid game but not ones that would heavily carry over to late, such as making her E start at a higher ratio. Even if she got huge buffs overall including her late game it'd be no more threatening than an ADC would be. Honestly the parallels between the two are hard to ignore. If late game she just melted faces of single targets within 700 range that's what an ADC does except with tons of Life Leech from items Vs Cass's 10% Spell Vamp and they have escape tools.\n\nIt's an absolute nightmare going to lane as Cass now... especially considering all I have early game is a damn Tear and a Doran's Ring. Just wave clearing is a pain in the ass, and roaming is now seemingly impossible.\n\nOh and I don't know why people are downvoting you, people are really pissed. I'm more upset over how stubborn Riot tend to be with these reworks and how they lied in the patch notes.","replies":[{"poster":"Riot King Cobra","date":"2014-10-01T03:26:23.913+0000","up_votes":1,"down_votes":2,"body":"> I should clarify, I meant she needs huge buffs to her early game and in turn buffs to her mid game but not ones that would heavily carry over to late, such as making her E start at a higher ratio. Even if she got huge buffs overall including her late game it'd be no more threatening than an ADC would be. Honestly the parallels between the two are hard to ignore. If late game she just melted faces of single targets within 700 range that's what an ADC does except with tons of Life Leech from items Vs Cass's 10% Spell Vamp and they have escape tools.\n> \n> It's an absolute nightmare going to lane as Cass now... especially considering all I have early game is a damn Tear and a Doran's Ring. Just wave clearing is a pain in the ass, and roaming is now seemingly impossible.\n> \n> Oh and I don't know why people are downvoting you, people are really pissed. I'm more upset over how stubborn Riot tend to be with these reworks and how they lied in the patch notes.\n\nHer late game is a lot more threatening than an ADC. They are comparable in that they do sustained single target DPS, but that is about where it ends. For one thing, magic damage is a lot more difficult to stack against. (Cass doesn't care about Banshee's Veils. Miasma poisons through them and her Twin Fang resets anyways because it resets on cast. The Veil can only stop 1 fang). \n\nAdditionally, her healing is a lot more significant than lifesteal from an ADC. Late game, she heals for over 100 HP per Twin Fang and it isn't affected by their resistances - an ADC's lifesteal depends on how much damage they are dealing and against tankier targets like Irelia is far less than 100 HP.\n\nFinally, an ADC's items are usually all offensive stats.\n\nLate game Cassio can potentially have a Seraph's Shield, Rod of Ages and Rylais - over 3,500 effective health (at least 3000 health), a permanent 35% slow on her \"autos\". Then she also gets a Zhonya's active. \n\nIn my last ranked game, we managed to stall until late game. Unlike an ADC, I was able to destroy an Irelia 1v1 and then take on a 13/4 fed Diana without my ultimate. The Twin Fang healing is just insanely huge because it is a guaranteed amount.","replies":[{"poster":"Neo Cyrus","date":"2014-10-01T03:50:08.232+0000","up_votes":2,"down_votes":0,"body":"Are you sure the Spell Vamp isn't affected by resistances? I added you because I wanted to ask you questions like this without having to make a billion posts.","replies":[]}]}]}]}]}]},{"poster":"Neo Cyrus","date":"2014-10-09T21:46:28.451+0000","up_votes":3,"down_votes":0,"body":"No numbers on the Sion rework. Better than lying I suppose. I don't know why they didn't bother release those numbers, it's not like it's 90% the same champion as before except with its numbers halved unlike a certain other example.","replies":[]}]}