{"poster":"Iam the Wanderer","date":"2015-11-18T14:28:04.961+0000","title":"Frage zur Corki E","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo \r\n\r\nIch habe eine frage zur Corki E und zwar ob sie critten kann?Und w&uuml;rde sich generell Stattics Shiv und Rapid Firekannon auf Corki lohnen?\r\n\r\nMFG Teemoflick","replies":[{"poster":"Imaqtone","date":"2015-11-18T14:31:15.442+0000","up_votes":2,"down_votes":0,"body":"Sie crittet nicht!","replies":[{"poster":"Iam the Wanderer","date":"2015-11-18T15:06:25.463+0000","up_votes":1,"down_votes":0,"body":"Ok vielen dank.Lohnt sich dann Stattics Shiv und Rapid Fire Cannon auf ihm oder nicht? (Sry wenn es eine dumme Frage sein sollte)","replies":[{"poster":"W0RN","date":"2015-11-18T15:23:29.706+0000","up_votes":2,"down_votes":0,"body":"Crit lohnt sich aufjedem ADC. Trinity ist sowieso Core auf ihm und wenn du nochn IE baust biste mit 40% gut dabei.","replies":[{"poster":"Imaqtone","date":"2015-11-18T15:37:41.579+0000","up_votes":2,"down_votes":0,"body":"Mhh ich weiß nicht so recht. Corki ist kein AA lastiger adc und beruft sich mehr über seinen burst.\nDabei finde ich Crit auf Corki nicht ganz so effektiv. Trinity für den Shen brock und ja IE geht noch. Aber auf Shiv würde ich verzichten.","replies":[{"poster":"XxKampflappenxX","date":"2015-11-20T10:04:52.719+0000","up_votes":2,"down_votes":0,"body":"Eigentlich ist die Rapidfirecannon geil auf Corki, sogesehen auf jedem ADC...\n\nCorki hat so schon eine gute Range, mit dem besagten Item kommt er auf eine Range von über 700 was schon echt krass ist wenn man bedent dass das Item auch noch burst gibt. So kann er aus einer Sicheren Range seine Fähigkeiten und Trinityprocs benutzen.\n\nZurZeit ist Rageblade aber ein besseres Item denke ich","replies":[{"poster":"Imaqtone","date":"2015-11-20T10:22:44.083+0000","up_votes":2,"down_votes":0,"body":"Habe ja nicht gesagt, dass die Rapidfirecannon schlecht ist. Oder kannst du das hier irgendwo lesen?\n\nIch hab nur gesagt, dass ich auf ein shiv verzichten würde, was für mich auch keinen Sinn macht es auf Corki zu kaufen.","replies":[]}]}]},{"poster":"Iam the Wanderer","date":"2015-11-18T15:36:02.321+0000","up_votes":1,"down_votes":0,"body":"Vielen dank :)","replies":[]}]}]}]}]}