{"poster":"Krispy Migraine","date":"2019-01-30T21:03:57.204+0000","title":"a rant on ranked","subforum":"Miscellaneous","up_votes":1,"down_votes":1,"body":"im mad salty at ranked, because of a game i just did. everyone won their lanes apart from top. nasus 1v9d. im only making this post because well he 1v9d. there was no counterplay whatsoever except from camping under turret and taunting him, but it&rsquo;s useless cuz he just presses q, one shots, and heals up. im completely aware of low elo blah blah blah dont know how to counter blah blah blah. imo it should be impossible to 1v5.","replies":[{"poster":"GamexOver","date":"2019-01-30T21:29:03.694+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheeKingKrispy,realm=OCE,application-id=Ntey9fRZ,discussion-id=UZPd5bmM,comment-id=,timestamp=2019-01-30T21:03:57.204+0000)\n>\n> im mad salty at ranked, because of a game i just did. everyone won their lanes apart from top. nasus 1v9d. im only making this post because well he 1v9d. there was no counterplay whatsoever except from camping under turret and taunting him, but it&amp;rsquo;s useless cuz he just presses q, one shots, and heals up. im completely aware of low elo blah blah blah dont know how to counter blah blah blah. imo it should be impossible to 1v5.\n\nI was and fighting to be again in silver. Low elo or not I can careless... Of cause you will always get some \" I am pro because I am plat \" but your post makes me laugh.\nLet me try and understand this.\n\n\n> [{quoted}](name=TheeKingKrispy,realm=OCE,application-id=Ntey9fRZ,discussion-id=UZPd5bmM,comment-id=,timestamp=2019-01-30T21:03:57.204+0000)\n>\n>  there was no counterplay whatsoever except from camping under turret and taunting him, but it&amp;rsquo;s useless cuz he just presses q, one shots, and heals up. \n\nWhy did you push to tower? Issue with nas isn't top lane nas. It is jungle nas ganking at 10 mins with 500 stacks. { Yes I know it is a over statement but that is what it feels like } Top lane nas in general is someone you never push lane on. You want him to push and then you freeze  near your tower. \n\nThis makes him walk all the way down the lane to cs. Then you gang up on him and just rip him apart.\nBut yes I have no clue why they buff nas the way they did... I guess it might have something to do with Riot high on drugs at the time. Played a game of nas and got melted. Then said \" I need more stacks to fight this game. LETS BUFF IT! \" \n\nBut also.. You really do need to learn to counter play a nas or do not go top in general. When I see a nas as {{champion:98}} . I laugh and melt him. \nI know my jungle will help me. I know my team will help me. They dont want free stacks nas.","replies":[]}]}