{"poster":"Krispy Migraine","date":"2019-01-10T20:34:04.429+0000","title":"constant lag spikes in 9.1","subforum":"Help & Support (OCE)","up_votes":2,"down_votes":0,"body":"ping spikes up to 1k sometimes, happens every 5 seconds","replies":[{"poster":"titixd","date":"2019-01-27T12:29:55.485+0000","up_votes":2,"down_votes":0,"body":"Same, here... After 9.1 and 9.2 at the very beginning of the game its okey, but later my ping jump up to 200-300 and then drop down to normal, then 5 seconds later it does again... I've tried everything to solve it... like deleted with all it contents, reinstalled my PC etc.. but nothing solved it... \nMy FPS is horrible as well as the ping... It works with permanent 120 fps and suddenly drops down to 0-5 fps and my screen totally freezes... for several seconds...\nSo.. are there any solution for this.. or we have to wait until the riot solve it?","replies":[]},{"poster":"Gragozz","date":"2019-01-27T12:45:33.565+0000","up_votes":1,"down_votes":0,"body":"yep i know how you all feel, god dam update","replies":[]},{"poster":"Solorevenge","date":"2019-01-19T16:21:36.167+0000","up_votes":1,"down_votes":0,"body":"This has been constant since that update on my end.","replies":[{"poster":"Im his ototo","date":"2019-01-26T01:27:23.284+0000","up_votes":1,"down_votes":0,"body":"Same!!! Dude my League worked perfectly fine before this stupid update. Now i cant even have a decent game when i play cuz the game would go so laggy, my mouse then loses control and is frozen and i can't do shit. Like my character will freeze in an animation frame and then walk in the wrong direction. Someone please undo the stupid update oml.","replies":[{"poster":"C3lebrimbor","date":"2019-01-29T16:17:17.018+0000","up_votes":0,"down_votes":1,"body":"Today I've tried to fix this issue by reinstalling the game and it didint work. So the problem is not within my pc. There is something Riot has to fix and i hope they'll fix it soon cuz there was a few matches i lost cuz this problem...","replies":[]}]}]}]}