{"poster":"RectoDePerro","date":"2015-05-19T20:21:38.529+0000","title":"Como se elije el lado del mapa para cada equipo en Solo Q","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"Bueno hoy jugue unas 6 rankeds y en todas me toco en el lado superior derecho, yo prefiero el izquierdo, ya que lo encuentro mas comodo por lo que me puse a pensar, &iquest;porque en todas me toco en el lado morado del mapa?\r\n\r\nBueno esa es mi pregunta si alguien me supiera decir se lo agradeceria","replies":[{"poster":"G4M3RN0B","date":"2015-05-19T23:02:57.259+0000","up_votes":1,"down_votes":0,"body":"Si no me equivoco en el pasado por un problema del ángulo de la camara el lado derecho era un poco mas complicado por lo que el equipo que tubiera un poco mas de mmr lo usaria. Rito dijo que con la nueva grieta diseñarian las torres y el terreno tratando de solucionar este problema del angulo, asi que supondria que ahora es al azar","replies":[{"poster":"Caraxes","date":"2015-05-20T00:51:12.509+0000","up_votes":2,"down_votes":0,"body":"Sigue estando balanceado con los equipos de mas mmr en el lado rojo, hay mas ventajas que el angulo de la cámara, ya que el mapa es asimétrico.\n\nY eso no afecta que sea al azar, ya que los equipos son asignados al azar con la condiciones del mmr.","replies":[]}]},{"poster":"Caraxes","date":"2015-05-20T00:49:08.623+0000","up_votes":1,"down_votes":0,"body":"Es al azar.","replies":[]},{"poster":"bowaaaNN","date":"2015-05-20T00:15:16.116+0000","up_votes":1,"down_votes":0,"body":"si te toca el lado morado es mejor amigo tienen mejor mmr los del lado rojo o morado como decis vos :P","replies":[]},{"poster":"Epik","date":"2015-05-19T20:56:55.644+0000","up_votes":1,"down_votes":0,"body":"no se puede elegir, es al azar.","replies":[]},{"poster":"FePa","date":"2015-05-19T20:48:56.312+0000","up_votes":1,"down_votes":0,"body":"que es menos coincidente: que te salga 6 veces el mismo lado del mapa o que te salgan 6 trolls/afk/feeders en tu equipo","replies":[]}]}