{"poster":"Gabling23","date":"2017-06-28T23:12:19.087+0000","title":"Che ne pensate di questi cambiamenti fatti a Diana","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Sembra che dalla prossima patch Diana subir&agrave; i seguenti cambiamenti: \r\n\r\n- la passiva non dar&agrave; pi&ugrave; 20% di attack speed\r\n- i cooldown della Q ai primi livelli saranno ridotti\r\n- la E oltre al suo solito effetto conferir&agrave; passivamente il 40/50/60/70/80% di attack speed ai prossimi 3 autoattacchi dopo aver usato una skill.\r\n\r\nDiana &egrave; uno dei pochi champion che gioco in ranked, penso che questo sia un buff per lei ma non so se nella direzione giusta. \r\nVoi cosa ne pensate? Quale sar&agrave; la miglior build per lei in seguito a questi cambiamenti? (io di solito vado ROA&gt;Nashor&gt;Deathcap/Zhonia)","replies":[{"poster":"Darkinknight","date":"2017-06-29T08:15:36.327+0000","up_votes":2,"down_votes":0,"body":"- bye jng\n- hahahha cd ridotti sulla Q,tanto early dopo 3 Q non rimane senza mana\n- questo è gia piu interessante,ma ho seri dubbi cambi realmente qualcosa..purtroppo rimane limitato su 3 AA e il cd della E è alto","replies":[{"poster":"SickAnto","date":"2017-06-29T08:55:56.022+0000","up_votes":1,"down_votes":0,"body":"I 3 AA potenziati li applica in tutte le spell, non solo sulla E.","replies":[{"poster":"Darkinknight","date":"2017-06-29T09:38:38.375+0000","up_votes":1,"down_votes":0,"body":"Cioe ogni spell che tira ha la As aumentata per 3 AA?","replies":[{"poster":"Gabling23","date":"2017-06-29T10:32:23.151+0000","up_votes":1,"down_votes":0,"body":"Esatto però la cosa non è cumulativa. ne hai 3 dopo ogni spell ma non è che sei usi Q>W>E ne hai 9.","replies":[]},{"poster":"SickAnto","date":"2017-06-29T10:06:08.040+0000","up_votes":1,"down_votes":0,"body":"Sì, ma non so se gli AA vengono aumentati o c'è un refresh della passiva se spammo le abilità.","replies":[{"poster":"Darkinknight","date":"2017-06-29T10:29:46.624+0000","up_votes":1,"down_votes":0,"body":"Probabilmente un refresh,altrimenti tanto valeva metterlo direttamente cone passiva fissa","replies":[]}]}]}]},{"poster":"Mystogan92","date":"2017-06-29T08:41:16.915+0000","up_votes":1,"down_votes":0,"body":"> hahahha cd ridotti sulla Q,tanto early dopo 3 Q non rimane senza mana\n\nInfatti ncora non capisco perchè non abbassano i costi delle spell. In lane rimane senza mana dopo aver tirato 3 Q come dici tu. E' una cosa abbastanza assurda","replies":[]}]},{"poster":"xxG1G4xx","date":"2017-07-01T22:46:59.989+0000","up_votes":1,"down_votes":0,"body":"Mah! Speriamo Bene.... \nIo amo Diana tantissimo ma non la gioco più perchè nelle ranked soffre tanto...\nSpero che queste modifiche bastino ma sono perplesso","replies":[]},{"poster":"SickAnto","date":"2017-06-29T08:00:11.783+0000","up_votes":1,"down_votes":0,"body":"Le migliorano il mid-late game, rendendola più forte nel 1vs1 e splitpush ma peggiorerà in early, rendendo più difficile pulire i campi/ondate(quindi rende meno viabile da jungler).","replies":[{"poster":"Gabling23","date":"2017-06-29T10:35:53.208+0000","up_votes":1,"down_votes":0,"body":"Sicuramente il mid game migliora molto, ora dal 6 penso diventi molto più forte negli 1 contro 1, non so in late game quanto migliori visto che magari splitpushare è più difficile senza la passiva e per farlo deve consumare mana","replies":[{"poster":"SickAnto","date":"2017-06-29T11:07:53.851+0000","up_votes":1,"down_votes":0,"body":"Non è tanto un problema visto che in late hai già stackato {{item:3027}} oppure {{item:3030}} /{{item:3001}} e hai pure il {{item:3100}}  in certi casi, quindi lo risolvi senza troppa difficoltà e non ci metti molto a buttare le torri.\n\nInsomma, potrebbe raggiungere i livelli di Jax, contando come item {{item:3115}} e forse rende più viabile l'utilizzo del {{item:3124}}","replies":[]}]}]},{"poster":"Mystogan92","date":"2017-06-29T07:15:47.637+0000","up_votes":1,"down_votes":0,"body":"Almeno per come la uso da assassin io di solito, attack speed non è che serva a tanto \n{{item:3100}}, {{item:3157}} e/o  {{item:3102}},   {{item:3111}}\n\nComunque è interessante il cambiamento, meglio ripsetto alla passiva di AS che su diana ritenevo quasi inutile","replies":[{"poster":"SickAnto","date":"2017-06-29T08:08:36.354+0000","up_votes":1,"down_votes":0,"body":"Non conosci il champ per dire che l'AS su Diana è inutile.","replies":[{"poster":"Mystogan92","date":"2017-06-29T08:39:26.054+0000","up_votes":1,"down_votes":0,"body":"La conosco sono io che la uso un po' diversamente, {{item:3115}} non la buildo mai. Assassin se ci sono molti personaggi squishi. Q W RR e addio a tutti. Se snowballa fa strage. Ti butti sull'ADC o support lo elimini easy. La sto portando a maestria 7 .\n\n","replies":[{"poster":"Gabling23","date":"2017-06-29T10:39:35.911+0000","up_votes":1,"down_votes":0,"body":"Da assassino secondo me è più difficile e meno sicura da giocare, soprattutto salendo di ELO.","replies":[]}]}]}]},{"poster":"Gabling23","date":"2017-06-29T10:38:07.821+0000","up_votes":1,"down_votes":0,"body":"In fin dei conti penso che sicuramente il suo win rate salirà di qualcosa (oramai sono troppe patch che sta sotto il 48%) però continuerà ad avere dei problemi (carenza mana, vel attacco per farmare diminuita quindi ci si dovrà fare l'abitudine). I miglioramenti si avranno sicuramente nel mid game tra il liv 6 e il 13-15, e forse più che un champion per mid/jungle diventerà un champion per mid/top, per il resto non so proprio come andrà. Vedremo quando i cambiamenti saranno live","replies":[]}]}