{"poster":"Kawatori","date":"2017-09-13T11:49:59.320+0000","title":"¿Que le hicieron a Rakan?","subforum":"Charlas Generales","up_votes":17,"down_votes":2,"body":"Literalmente ahora la hitbox si le da la gana detecta que tocaste al enemigo con la ultimate,si avanzas sobre el algunas veces no lo charmeas y otras veces avanzando igual si,Que es esto riot?\n\nEl nerf de la w me parece perfecto,pero el de la r? le quitaron una exageracion de rango de colision wtf\n\nEdit:encima tengo un problema que al usar la w y la r despues de que termina el ultimate me bajan 40 fps,siendo que tengo una pc de alta gamma wat","replies":[{"poster":"Kyousuke","date":"2017-09-13T13:16:57.781+0000","up_votes":1,"down_votes":9,"body":"lo hicieron un poco mas \"skilled\" y arriesgado al tener que acercarse mucho a los rivales para hacer el combo ya que normalmente con estar a su alrededor bastaba para meterles el charm a todos, igual puede que se hayan pasado y si es así pronto caerá un hotfix para que se pueda jugar en el mundial","replies":[{"poster":"furikake","date":"2017-09-13T13:25:27.362+0000","up_votes":19,"down_votes":1,"body":"ya es un campeón skilled porque si se inicia mal estas muerto. No entiendo el nerfeo a rakan solo porque se usa mucho en competitivo\n{{sticker:zombie-brand-facepalm}} \n\nSe pasa Riot con estos nerfeos innecesarios.","replies":[{"poster":"DICY pro","date":"2017-09-14T12:44:02.527+0000","up_votes":1,"down_votes":0,"body":"¨por que si se inicia mal estas muerto¨ en eso estas muy equivocado, el punto de rakan es que no importa la boludes que hagas si tenes un aliado cercano podes facilmente escaparte sin ningun problema(usando la E, creo). en otras palabras si   \ninicias bien sos un dios y te haces la TF (simpre teniendo en cuenta el team tuyo), pero si te sale mal podes retroseder sin mucha dificultad. Por eso creo que el cambio estuvo bien.","replies":[{"poster":"furikake","date":"2017-09-14T15:59:54.137+0000","up_votes":1,"down_votes":0,"body":"El problema de la iniciación de rakan es su corta duración. No es que siempre acabes muerto sino que muchas veces tu iniciación es medio inútil ya que en esos pocos segundos que aplicas CC, si tu equipo no te sigue, te quedas con todo en CD.\nLo veo un poco innecesario el nerfeo a la R.","replies":[]}]}]},{"poster":"Kawatori","date":"2017-09-13T13:28:16.134+0000","up_votes":4,"down_votes":1,"body":"Skilled?,pero si ya lo es,el inicio es lo mas importante que tiene porque si tardas mas de 1 sg y medio en agarrar 2 o 3 literalmente sos inutil en tfs y tenes que esperar al reinicio de la w,el de la w lo entiendo pero en el de la r se pasaron completamente,si ves el rango nuevo que tiene la r nada que ver,estas encima del champ y no lo toma como si lo hubieras charmeado...","replies":[{"poster":"Kyousuke","date":"2017-09-13T14:35:52.639+0000","up_votes":1,"down_votes":1,"body":"si no lo toma puede que se haya bugeado la habilidad , rakan es mi soporte favorito y el que mas domino es el champ que me mostró que el rol de soporte puede ser divertido y me encanta, pero es verdad que el ulti aveces era muy falso y el rango era muy grande, sin tocar a ninguno podías meterle el charm a los 5 y que se metan en tu W. ahora es mas difícil por que hay que acercarse mas pero sigue siendo lo mismo solo es cosa de practicarlo un poco, pero si es un bug y realmente anda mal la habilidad entonces pronto le meterán un hotfix.\nel ulti normalmente no lo vas a meter junto con la W (si el enemigo tiene almenos 2 neuronas XD) por algo el mejor combo es con flash al hacer flash+R+W y irte con la e a hacer peel a tu carry ","replies":[]},{"poster":"furikake","date":"2017-09-13T16:09:43.251+0000","up_votes":1,"down_votes":2,"body":"Rakan es pura iniciación. Si cambian algo en su W o R, se cargan al campeón.\nEstá bien en su estado actual, no necesita un nerfeo.","replies":[{"poster":"112416","date":"2017-09-13T20:16:22.335+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=furikake,realm=LAS,application-id=v7qsfXsE,discussion-id=wtvcA7aE,comment-id=000100010001,timestamp=2017-09-13T16:09:43.251+0000)\n>\n> Rakan es pura iniciación. Si cambian algo en su W o R, se cargan al campeón.\n> Está bien en su estado actual, no necesita un nerfeo.\n\nJAJA, no ves competitivo o partidas con nivel?","replies":[{"poster":"furikake","date":"2017-09-13T21:04:06.340+0000","up_votes":1,"down_votes":1,"body":"veo que tienes una opinión diferente ¿que pensas?","replies":[]}]}]}]},{"poster":"Ks Erwyn","date":"2017-09-13T15:57:04.340+0000","up_votes":3,"down_votes":0,"body":"no, si esta bug, le pase por entre las patas a un cho y no lo encante :b","replies":[{"poster":"furikake","date":"2017-09-13T16:06:45.689+0000","up_votes":1,"down_votes":1,"body":"hay que fallar la R con un cho'gat jajaja\nAlgo funciona mal","replies":[]}]}]},{"poster":"purgaa","date":"2017-09-13T16:29:54.232+0000","up_votes":1,"down_votes":3,"body":"no entiendo el nerf a rakan para nada , desde mi punto de vista incluso encontraba que necesitaba un buff ( buff a la W , si a la W , el tiempo de casteo del stun es absurdamente alto, le reduciria la hitbox de la W para disminuir el tiempo que se demora en stunear ) y un Nerf a la R , basicamente el charm es brutal pero encuentro un abuso el nerf de la R , yo le hubiera quitado tiempo de duracion y que solo pudiera tirar el charm a 3 campeones, de esa forma si seria mas skilled y no estaria roto en comparacion a otros supports","replies":[{"poster":"Ks Erwyn","date":"2017-09-13T19:23:45.210+0000","up_votes":3,"down_votes":0,"body":"que tiene de skilled no darle tiempo de reacción al rival haciendo que la W se castee mas rápido?, estos niños....","replies":[{"poster":"MolotovKiller","date":"2017-09-13T23:25:23.238+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Ks Erwyn,realm=LAS,application-id=v7qsfXsE,discussion-id=wtvcA7aE,comment-id=00040000,timestamp=2017-09-13T19:23:45.210+0000)\n>\n> que tiene de skilled no darle tiempo de reacción al rival haciendo que la W se castee mas rápido?, estos niños....\n\nRakan es un support agresivo y por ende, tiene que tener un kit veloz, no ser una tortuga para encadenar combos.  El nerf fue totalmente gratuito. Ademas si vamos por eso de \"no dar tiempo a reaccionar\" en este juego hay varios personajes que cumplen con ese patron asqueroso de aparecer y literalmente borrarte en un segundo.","replies":[]},{"poster":"purgaa","date":"2017-09-14T21:10:02.818+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ks Erwyn,realm=LAS,application-id=v7qsfXsE,discussion-id=wtvcA7aE,comment-id=00040000,timestamp=2017-09-13T19:23:45.210+0000)\n>\n> que tiene de skilled no darle tiempo de reacción al rival haciendo que la W se castee mas rápido?, estos niños....\n\nprecisamente tirarla bien, reducir el area de la W es un buen nerf y si le suman tiempo de enfriamiento seria mas viable el aplicar ese cambio\n\nanda a tratar a la gente asi a otro lado :) , es mas de niñito andar por la vida tratando asi a la gente !","replies":[]}]},{"poster":"Kawatori","date":"2017-09-13T21:39:24.795+0000","up_votes":1,"down_votes":0,"body":"La W esta bien porque si no seria permaban aparte de que la mayoria de supports counterean a rakan ya que alguien que tenga un levante o cc te cancela la habilidad,el cambio de la R esta mal,tener un rango mentiroso que ni el mismo juego sabe detectar es otra cosa.","replies":[]}]},{"poster":"El Impostor","date":"2017-09-13T16:21:15.663+0000","up_votes":3,"down_votes":0,"body":"Xayah, creo que trenemos un problema.","replies":[]},{"poster":"Turing Test","date":"2017-09-13T15:51:06.947+0000","up_votes":3,"down_votes":0,"body":"Al leer los cambios que le iban a hacer, me pareció que iba a ser difícil colocar bien una definitiva pero de difícil a bugueada ya es el colmo","replies":[{"poster":"Kawatori","date":"2017-09-13T17:38:57.003+0000","up_votes":1,"down_votes":0,"body":"Es que ese es el tema,si me decis que la dificultad de entrar a una tf iba a ser mas elevada con el pj lo aceptaba,pero literalmente fijate en el rango de la R de rakan,algunas veces estas encima de los enemigos y el hitbox no lo toma,mucho menos con los creeps..","replies":[]}]},{"poster":"MolotovKiller","date":"2017-09-13T13:07:24.803+0000","up_votes":1,"down_votes":0,"body":"¿Tan asi es? Lo pregunto por que no lo vi post nerf.","replies":[{"poster":"Kawatori","date":"2017-09-13T13:10:52.558+0000","up_votes":1,"down_votes":0,"body":"lo probe en entrenamiento con los creeps y enemigos,literalmente estas a 1 cm y algunas veces detecta el ultimate y otras no.","replies":[{"poster":"furikake","date":"2017-09-13T13:26:24.410+0000","up_votes":3,"down_votes":0,"body":"Se nota que a Riot no le gusta que algo se use mucho en competitivo","replies":[{"poster":"Crazy lyrics","date":"2017-09-13T13:47:05.222+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=furikake,realm=LAS,application-id=v7qsfXsE,discussion-id=wtvcA7aE,comment-id=000000000000,timestamp=2017-09-13T13:26:24.410+0000)\n>\n> Se nota que a Riot no le gusta que algo se use mucho en competitivo\n\nno es que no le guste es porque era permaban como niddale y syndra en el mundial pasado","replies":[{"poster":"furikake","date":"2017-09-13T13:51:15.362+0000","up_votes":2,"down_votes":1,"body":"Aunque se banee mucho, no esta roto ni cerca de eso. Solo es bueno con algunas combinaciones y nada más.\nSi estuviera roto, seria permaban sin embargo no lo es.\nVeo bastante partidas del competitivo y no es permaban.","replies":[]}]}]},{"poster":"Nísta","date":"2017-09-13T18:53:15.416+0000","up_votes":1,"down_votes":0,"body":"Si es \"algunas veces si y no\" entonces será un bug, no?","replies":[]}]}]},{"poster":"Kørean Boy","date":"2017-09-13T17:48:05.977+0000","up_votes":2,"down_votes":0,"body":"Lo acabo de usar recien y me parecia que le pase por encima a la jinx y no la charmie y justo entro y miro esto y ahora entiendo ... espero que lo solucionen rapido.","replies":[]},{"poster":"Treant del DOTA","date":"2017-09-14T02:29:35.920+0000","up_votes":2,"down_votes":1,"body":"Lo que se merece por pollerudo.","replies":[]},{"poster":"Bran","date":"2017-09-15T08:41:41.147+0000","up_votes":1,"down_votes":0,"body":"Fuiste bueno Rakan, lastima que lo tocaran al menos si le bajaban la W y la R que le subieran rango a la Q así quedaba más balanceado pero ahora no lo veremos ni contra bots xDDDDD\n\nFuiste bueno bb {{sticker:cass-cry}}","replies":[]},{"poster":"Eckerdt","date":"2017-09-13T17:04:32.642+0000","up_votes":1,"down_votes":1,"body":"alta gama, haber especifica más y te digo","replies":[{"poster":"Imagine Cannons","date":"2017-09-14T13:50:37.067+0000","up_votes":1,"down_votes":0,"body":"> haber\n\n\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Eckerdt","date":"2017-09-14T15:47:02.144+0000","up_votes":1,"down_votes":1,"body":"oye tranquilo viejo, no sabia que estaba frente a la RAE {{sticker:slayer-jinx-unamused}}","replies":[]}]}]},{"poster":"SirJuanma14","date":"2017-09-14T13:27:18.830+0000","up_votes":1,"down_votes":0,"body":"Para mi el nerf era innecesario,a Rakan lo counteras con cualquier campeón prácticamente,es muy débil en línea,no tiene nada de daño ya que para sacar todo su provecho se maxea la E.\nEl nerf a la W te lo puedo llegar a entender un poco nada más,por que cualquier campeón con CC contrarresta a Rakan automáticamente,pero el nerf al rango de la últi me parece ridículo,ya casi no sirve hacer el combo R W por que no entra el charm bien ya que con la reducción de rango es muy falso ahora,aveces lo encantas y aveces no,cuando le da la gana prácticamente,pero bueno espero un hotfix.","replies":[]},{"poster":"Cero404","date":"2017-09-14T01:26:57.233+0000","up_votes":1,"down_votes":0,"body":"juge con Rakan, pise a un teemo y no lo enamore :)\n\n\nPD: no es broma, asi de mal esta la hitbox ahora","replies":[]},{"poster":"davichost","date":"2017-09-13T22:44:05.786+0000","up_votes":1,"down_votes":0,"body":"Lo de la w me parece bien, el ulti nose... a veces tiraba ult + w y lo charmeabas igual estando re lejos\nEl tema es que Rakan deja muy poco tiempo de reacción y un cambio asi era nesesario\n\n","replies":[]},{"poster":"Anrho","date":"2017-09-14T17:54:59.021+0000","up_votes":1,"down_votes":1,"body":"Diria Algo pero Tengo un rio de arena atrás mio y tengo Miedo D:","replies":[]}]}