{"poster":"rokushoger","date":"2017-12-27T12:02:11.395+0000","title":"Recomendaciones de Anime!","subforum":"Off-topic y temas personales","up_votes":12,"down_votes":5,"body":"Buenas!\n\nHace poco respond&iacute; una solicitud de recomendaci&oacute;n con esta respuesta, y me pareci&oacute; que le podr&iacute;a servir a otra gente, as&iacute; que lo comparto.\n\nAclaración: Las series no están ordenadas de la mejor a la menor, es solo numeración. La única que si sería \"correcta\" es Death Note por ser mi favorita, pero no se si sea la mejor.\n\nVamos a eso!\n\n**1- Death Note**\n\nhttps://ugc.kn3.net/i/origin/http://i.ytimg.com/vi/Ky4dLY4qu10/maxresdefault.jpg\n\nHay un mundo de monstruos llamados shinigamis en el cual hay uno que est&aacute; aburrido y por diversi&oacute;n deja caer un cuaderno a la tierra muy especial. Este cuaderno lo toma un tipo llamado Yagami Light con aires de grandeza y descubre que puede matar a alguien con solo escribir su nombre en el cuaderno, as&iacute; que se dedica a limpiar el mundo de criminales.\n\nEste es mi &aacute;nime preferido de todos los tiempos, es m&aacute;s policial que otra cosa. No esperes peleas, a no ser batallas de intelecto, super recomendable.\n\n**2- Code Geass y Code Geass R2**\n\nhttp://img.jakpost.net/c/2017/05/03/2017_05_03_26324_1493811007._large.jpg\n\nUn flaco que es principe de un imperio pero vive escondido para que su padre, un tirano despota no lo encuentre se encuentra por casualidad con una mina que le da el poder de que aquel que lo mire a los ojos no pueda rechazar sus &oacute;rdenes, e inicia una rebeli&oacute;n por el control del imperio.\n\nBatallas &eacute;picas de mechas a la vez que de intelectos cual si fuera un tablero de ajedrez, intrigas pol&iacute;ticas, traiciones, etc, de los mejores anime que he visto.\n\n**3- Full Metal alchemist y Full Metal Alchemist: Brotherhood.**\n\nhttp://s4.thingpic.com/images/mg/NDbGYnzUGevQYZPn6ar6a8r2.png\n\nDos hermanos estudiantes de alquimia que pierden a su madre de peque&ntilde;os deciden quebrar el tab&uacute; y revivirla mediante la alquimia, pero por algo hay un tab&uacute; y uno pierde un brazo y una pierna y el otro todo su cuerpo (su alma queda atada a una armadura vac&iacute;a). El &aacute;nime trata de su busqueda por recuperar sus cuerpos y sus combates contra los malvados.\n\nFull metal alchemist est&aacute; dividida en dos: El antiguo trata la historia diferente al manga, y es mucho m&aacute;s dram&aacute;tico, aunque con menos acci&oacute;n. Por otro lado brotherhood tiene mucha m&aacute;s acci&oacute;n y es m&aacute;s apegado al manga, pero sigue teniendo momentos dram&aacute;ticos. Te recomiendo ver los dos, no te vas a arrepentir.\n\n**4- Boku no Hero Academia**\n\nhttp://i0.kym-cdn.com/entries/icons/original/000/017/282/wp1874080.png\n\nEn una realidad alterna todos los humanos tienen superpoderes excepto algunos pocos, y algunos se dedican a ser heroes.\nLa historia trata de un muchacho que sue&ntilde;a con ser heroe... a pesar de ser de los pocos que no tienen superpoderes, y de su aprendizaje.\n\nLo se, suena poco atractivo, me pas&oacute; lo mismo, pero dale una oportunidad porque sin duda es de los mejores anime que han salido en este ultimo tiempo junto con el siguiente de la lista.\n\n**5- Re: Zero**\n\nhttps://cdn-images-1.medium.com/max/2000/1*s-FWgJC5Gfcxiy7fEqNV5w.jpeg\n\nLa historia trata de un flaco que queda atrapado en un mundo donde cada vez que muere vuelve atr&aacute;s en el tiempo y revive, y de las aventuras y vivencias que pasa... y de lo enferma que puede quedar una persona que tiene este poder.\n\nEste anime es brutal. Si bien tiene chicas bonitas y el protagonista se enamora, no lo tratan desde la perspectiva tan pava que es normal en un anime, sino de la lucha del protagonista por cambiar los eventos, y de lo mucho que lo va afectando. El mejor anime de lo actual peleando con boku no hero.\n\n**6- Stains;Gate**\n\nhttps://cdn1.skgcl.com/wp-content/uploads/2017/07/online-maske_steinsgate_1600x900.png\n\nB&aacute;sicamente trata de un cientifico loco y sus amigos que descubren una forma de alterar el tiempo mediante mensajes de texto, y de como se desmadra el asunto.\n\nDebo empezar con las palabras obra maestra. Al principio te va a parecer un bolazo, pero todo tiene un porque, incluso los comportamientos raros del personaje principal. Vos esper&aacute; al capitulo 5 en adelante y vas a ver la maravilla que es steins gate y sus paradojas temporales.\n\n**7- Ergo Proxy**\n\nhttps://vignette.wikia.nocookie.net/vsbattles/images/1/1f/Ergo_Proxy.png/revision/latest?cb=20151213095748\n\nTe voy a copiar y pegar una rese&ntilde;a para esta porque me es dif&iacute;cil describirlo sin hacer spoiler:\nMientras investiga una serie de desconcertantes asesinatos, la detective del servicio de inteligencia Re-I Mayer recibe una cr&iacute;ptica advertencia acerca de que algo va a &ldquo;despertar&rdquo; y poco despu&eacute;s es atacada por una monstruosa criatura ni androide ni humana. En su intento por resolver el intrincado caso, un grito de guerra metaf&iacute;sico llevar&aacute; a Re-I m&aacute;s all&aacute; de los confines de Romdo&hellip;\n\nB&aacute;sicamente esta serie no la vas a entender de una, y no hay vuelta. Pero es una serie muy profunda, con mucha cr&iacute;tica, y un buen argumento. La coloqu&eacute; m&aacute;s que nada como referencia a una serie m&aacute;s oscura que las otras, para que tengas de todos los gustos.\n\n**8- Hellsing**\n\nhttps://pm1.narvii.com/5822/740c5926891d5cc9a6a6222f8923d480dc2ca9f3_hq.jpg\n\nTrata sobre la organizaci&oacute;n Hellsing que se dedica a cazar vampiros usando a su arma secreta, uno de los antiguos vampiros m&aacute;s poderosos: Alucard, y la irreverencia, brutalidad, y humor retorcido que lo caracteriza.\n\nAnime muy sangriento, con mucha acci&oacute;n y buen&iacute;sima trama. Te recomiendo ver Hellsing Ultimate que es el m&aacute;s completo, porque vas a econtrar una serie de 13 episodios tambi&eacute;n que est&aacute; incompleta. Eso si, cada capitulo dura casi una hora, pero vale la pena cada minuto.\n\n\n**9- xxxHolic**\n\nhttps://i.musicaimg.com/fotosb1/perfil_22203_3.jpg\n\nTrata sobre las peripecias que pasa un muchacho llamado Kimihiro Wuatanuki (un muchacho que puede ver esp&iacute;ritus y dem&aacute;s cosas paranormales) y su &quot;explotadora&quot; jefa que le asigna misiones para ayudar a la gente en apuros con lo paranormal.\n\nEste no es un anime de peleas, pero si hay partes de acci&oacute;n. Es una mezcla de terror (poco), con mucho humor, y el mundo de lo paranormal, con un toque de acci&oacute;n. Es un anime bastante at&iacute;pico y de los mejores que he visto.\n\n**9- Shiki**\n\nhttps://pm1.narvii.com/6027/de1641a2503d31c084bd8a858ef9592a6f2e8e38_hq.jpg\n\nTrata de la lucha de un peque&ntilde;o pueblo muy tradicionalista que intenta combatir a una plaga de vampiros que los usan como ganado.\n\nEs de terror, aunque m&aacute;s bien yo lo catalogar&iacute;a como suspenso. Un poco sangriento pero con muy buena trama.\n**\n10- Higurashi no naku koro ni y Higurashi no naku koro ni kai**\n\nhttp://images6.fanpop.com/image/photos/38500000/Higurashi-no-Naku-Koro-ni-When-They-Cry-erikasakura0812-38581905-1920-1200.jpg\n\nUn peque&ntilde;o pueblo donde existe el misterio que cuando cierto evento del a&ntilde;o llega siempre muere una persona.\n\nNo te dejes llevar por su arte, este es de terror, y de la vieja escuela, bien sangriento y violento. Es muy at&iacute;pico porque maneja algo as&iacute; como arcos, y en cada arco el asesino va variando. Es muy rara la forma en que lo hacen, tienes que verlo.\n\n**11- Tengen toppa gurren laggan**\n\nhttps://www.koi-nya.net/img/subidos_posts/2017/07/tengen-toppa-gurren-lagann.jpeg\n\nUn par de muchachos de un pueblo que vive bajo tierra para evitar ataques de una raza de lo que aparentan ser gigantes deciden que no quieren vivir m&aacute;s atrapados, y con la ayuda de un peque&ntilde;o robot se abren paso a la superficie y emprenden una aventura.\n\nEsta serie es un cl&aacute;sico, llena de acci&oacute;n, un momento muy emocionante, robots gigantes, personajes memorables, en fin, el final es un viaje astron&oacute;mico pero buen&iacute;simo. Miralo, no es perdida de tiempo.\n\n**12- Bleach**\n\nhttps://freakuotes.com/assets/img/categories/bleach-26.jpeg\n\nTrata sobre un tipo con sensiblidad para ver esp&iacute;ritus y dem&aacute;s que una noche presencia como un shinigami pelea con uno de esos bichos, y ella (porque el shinigami es una muchacha) pierde. El para salvarla decide tomar sus poderes y el mismo se convierte en un shinigami, y luego debe combatir a estos seres mientras aprende de sus poderes.\n\nLo que te cont&eacute; no es m&aacute;s que la punta del iceberg, es una serie larga, pero vale la pena, y tiene un excelente desarrollo, adem&aacute;s de uno de los mejores malos de todos los anime.\n\n**13- Rainbow: Nisha Rokubou no Shichinin**\n\nhttps://bangin.files.wordpress.com/2011/05/rainbow1.jpg\n\nTrata sobre un orfanato y un grupo de adolescentes que son llevados all&iacute;, sin saber que ser&iacute;a el mismo infierno, y todos los abusos y peripecias que pasan all&iacute; dentro.\n\nFlaco, si no llor&aacute;s al menos una vez con este anime, o sos de piedra o no sos humano. No apto para verlo si ten&eacute;s depresi&oacute;n, pero es uno de los mejores anime que he visto.\n\n**14- Sword art online**\n\nhttps://ibhuluimcom-a.akamaihd.net/ib.huluim.com/show/11876?region=US&amp;size=952x536\n\nTrata sobre un juego de realidad virtual inmersiva en la que b&aacute;sicamente en su apertura quedan todos los jugadores atrapados, y como tanto el principal como los dem&aacute;s terminan haciendo una vida dentro de este a su vez que se organizan para terminar el juego y regresar a la realidad. \n\nEs un anime b&aacute;sicamente de acci&oacute;n bastante bueno, tiene varias temporadas, la primera es la mejor, la segunda es bastante feota, y la tercera est&aacute; bastante bien.\n\n**15- Accel World**\n\nhttp://dis-rupt.tv/wp-content/uploads/2017/05/Wiki-background.jpg\n\nTrata sobre un futuro en que la realidad aumentada es cosa de todos los d&iacute;as y un pibe que es abusado obtiene una especie de juego en que puede transformarse en un avatar que pelean entre si por puntos... pero si pierdes todos tus puntos pierdes el juego para siempre. Puedes usar esos puntos para alterar ciertas cosas de la realidad.\n\nParecido a sao, pero con otro enfoque, y sobre todo las peleas son &eacute;picas. Buena trama tambi&eacute;n aunque no la mejor del mundo. Muy recomendable.\n\n**16- Log Horizon**\n\nhttps://elrefugiodelosincomprendidos.files.wordpress.com/2014/03/log-horizon.png\n\nTrata sobre un loco que se ve absorbido por su juego favorito, as&iacute; como otras personas, y aprenden a construir su vida dentro del mundo digital.\n\nSi bien este anime parece igual a SAO, nada que ver. Este para empezar tiene peleas pero no son ni ah&iacute; el centro del anime, al contrario, ac&aacute; es m&aacute;s que nada ver como sobreviven, el sistema e intrigas pol&iacute;ticas que empiezan a surgir, y la organizaci&oacute;n para sobrevivir.\n\nSaludos!\n\nEdit: Ya tenemos la 2.0!\nhttps://boards.las.leagueoflegends.com/es/c/off-topic-y-temas-personales/HQIatvG2-recomendaciones-de-anime-20","replies":[{"poster":"Bienzahar","date":"2017-12-27T12:24:16.169+0000","up_votes":4,"down_votes":0,"body":"Monstruos? los shinigamis son dioses xD","replies":[{"poster":"rokushoger","date":"2017-12-27T12:29:00.944+0000","up_votes":2,"down_votes":1,"body":"Monstruo:\n\n2. m. Ser fantástico que causa espanto.\n4. m. Persona o cosa muy fea.\n\nFuente:\nhttp://dle.rae.es/?id=PiY3lWL\n\nQue sea un monstruo no implica que no pueda ser un dios.","replies":[{"poster":"Bienzahar","date":"2017-12-27T12:34:26.982+0000","up_votes":1,"down_votes":0,"body":"Ya eso es en español pero en Japones es muy distinto xD","replies":[{"poster":"rokushoger","date":"2017-12-27T12:35:31.360+0000","up_votes":1,"down_votes":1,"body":"No estoy en japón hasta donde se XD","replies":[{"poster":"bombastico","date":"2017-12-27T13:00:27.302+0000","up_votes":4,"down_votes":0,"body":"No no no, nunca intentes contradecir a un otaku, sacas mas provecho discutiéndole a una planta.","replies":[]},{"poster":"Bienzahar","date":"2017-12-27T12:36:37.185+0000","up_votes":1,"down_votes":0,"body":"Pero hablamos de algo japones xD","replies":[{"poster":"rokushoger","date":"2017-12-27T12:39:50.651+0000","up_votes":2,"down_votes":0,"body":"O sea que si hago una descripción de un anime como es en japonés tengo que hablar en japonés? Cuack. Yo hablo en español, y el que lee habla en español, ergo las definiciones de lo que escribo son en español salvo las palabras que están explicitamente escritas en japones como Shinigami.","replies":[]}]}]}]}]}]},{"poster":"Dreth11","date":"2017-12-27T20:07:54.094+0000","up_votes":3,"down_votes":0,"body":"All hail lelouch!","replies":[]},{"poster":"Nuke","date":"2017-12-27T13:23:18.181+0000","up_votes":1,"down_votes":3,"body":"Ehh, yo los 2 únicos ánimes que vi son Naruto y Dragon Ball ;v\nEso fue cuando tenía como 7 años.\n\nNo se que le ven de increible al ánime, yo preferiría ver películas, que hay muchas y muy buenas.","replies":[{"poster":"rokushoger","date":"2017-12-27T13:30:08.495+0000","up_votes":3,"down_votes":0,"body":"Básicamente lo mismo que tu le ves a las películas, me gustan, son variados, y hay muchos y muy buenos, y de muchos generos, no solo shonen como naruto y dragon ball.","replies":[{"poster":"Nuke","date":"2017-12-27T13:44:51.621+0000","up_votes":1,"down_votes":3,"body":"Ah, ahora tienen distintos géneros. \nNo puedo con esto mejor me voy a USA ;v","replies":[{"poster":"rokushoger","date":"2017-12-27T13:47:11.338+0000","up_votes":1,"down_votes":0,"body":"Claramente, igual que las películas.","replies":[{"poster":"LaReinaPingüino","date":"2017-12-27T18:16:59.783+0000","up_votes":2,"down_votes":0,"body":"Na, ese es un trol ni le contestes","replies":[{"poster":"rokushoger","date":"2017-12-27T21:10:06.626+0000","up_votes":1,"down_votes":0,"body":"Es que es divertido dejar en evidencia XD","replies":[]}]}]}]}]}]},{"poster":"LaReinaPingüino","date":"2017-12-27T18:11:11.472+0000","up_votes":1,"down_votes":0,"body":"Me encantó ergo proxy ☺\n\nVi 3 episodios de steins gates y la abandoné, le daré otra oportunidad.\n\nY en mi opinión brotherhood es mejor que el otro de fma, pero bueno.\n\nSi quieren ver algo livianito les recomiendo working (o wagnaria como le dicen en otros países) es slice of life de un joven que trabaja en un restaurant lleno de personas chistosísimas, es entretenidísima, pero la original, el spin off (www.working, creo) no le llega ni a los talones.","replies":[{"poster":"rokushoger","date":"2017-12-27T18:15:27.816+0000","up_votes":2,"down_votes":0,"body":"Steins es un viaje y no entendés nada hasta el episodio 5 o 6, luego se pone bueno, dale una oportunidad. A mi también me gusta más brotherhood, pero la otra es buenísima también.","replies":[]}]},{"poster":"Icesoul","date":"2017-12-27T17:30:26.074+0000","up_votes":2,"down_votes":0,"body":"La mayoria me gusta, sao es muy sobrevalorada para mi, en mi opinion muy mala,  y bleach tiene bocha de relleno de mala calidad, pero bueno, me alegra que tengas tanta variedad de gustos, el ser exigente en tramas y personajes o simplemente que la historia este bien desarrollada es bastante dificil de encontrar. Por eso me sorprende que te guste xxholic y pongas en la lista otras series como el ya mencionado sao, es como tratar de pegar con moco jaja :P, no lo tomes a mal eh, pero para mi gustandome holic o code geas, death note para ser mas bondadoso no puedo poner un sao ni a palo.\n\nSaludos.","replies":[{"poster":"LaReinaPingüino","date":"2017-12-27T18:12:00.690+0000","up_votes":1,"down_votes":0,"body":"De acuerdo con lo de sao, le vi varios capítulos y no me cabe en la cabeza que le vaya tan bien","replies":[]},{"poster":"rokushoger","date":"2017-12-27T17:46:17.593+0000","up_votes":1,"down_votes":0,"body":"Es que son estilos diferentes y puedo disfrutar de ambos. Me faltaron igual un montón por poner como monster por ejemplo. \n\nSao me gusta porque a veces me gusta pensar menos y más acción, y hay veces que busco una trama más profunda, depende de en que \"modo\" me despierte XD.","replies":[{"poster":"Icesoul","date":"2017-12-27T17:49:56.520+0000","up_votes":1,"down_votes":0,"body":"Jaja ya veo\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]},{"poster":"Salvor","date":"2017-12-27T13:09:21.339+0000","up_votes":2,"down_votes":0,"body":"Muy buen post! incluso recordé animes que vi, pero me había olvidado xD\nTe olvidaste de Mirai Nikki\nhttps://gyazo.com/23e36353e1c009457b196066ba382335.png\nY Angel Beats\nhttps://myanimelist.cdn-dena.com/images/anime/10/22061.jpg\n\nSaludos!!!","replies":[{"poster":"Hísøka","date":"2017-12-27T16:38:22.162+0000","up_votes":2,"down_votes":0,"body":"Que final triste de Angel Beats","replies":[{"poster":"Salvor","date":"2017-12-27T16:39:47.684+0000","up_votes":2,"down_votes":0,"body":"https://scontent-sea1-1.cdninstagram.com/t51.2885-15/s480x480/e15/10809466_802163176515305_969194820_n.jpg?ig_cache_key=ODUzOTc2MjI4ODQ5NjQ5OTg4.2\n\nDeja que lo vean y se les parta el cora.","replies":[{"poster":"Hísøka","date":"2017-12-27T16:50:44.371+0000","up_votes":2,"down_votes":0,"body":"Jajaja eso es despiadado mi querido amigo {{sticker:sg-soraka}}","replies":[]}]}]},{"poster":"rokushoger","date":"2017-12-27T13:11:54.727+0000","up_votes":2,"down_votes":0,"body":"Ambos muy buenos! Sobre todo mirai nikki me gusto más que angel beats.","replies":[]}]},{"poster":"Hísøka","date":"2017-12-27T16:48:37.712+0000","up_votes":2,"down_votes":0,"body":"Te Recomiendo ver Gangsta https://vignette.wikia.nocookie.net/gangstamanga/images/a/a3/Gangsta_cover2.jpg/revision/latest/scale-to-width-down/509?cb=20140820095729\n\nA pesar de tratarse de \"Gangters\" como dice su nombre tiene una buena trama aunque tiene un final muy abierto para otra temporada","replies":[{"poster":"rokushoger","date":"2017-12-27T17:25:18.874+0000","up_votes":1,"down_votes":0,"body":"Gangsters y buena trama, excelente combinación. Gracias!","replies":[{"poster":"Hísøka","date":"2017-12-27T21:05:54.188+0000","up_votes":1,"down_votes":0,"body":"Aunque seria mas como Hitman (Personas a las cuales les mejoraron ciertas capacidades para que sean mejor luchando)\n\nLastima que solo tiene 12 capitulos","replies":[]}]}]},{"poster":"ParedSinRevoque","date":"2017-12-27T12:32:04.682+0000","up_votes":2,"down_votes":0,"body":"Te falto este...\n\nhttp://blablaocio.com/wp-content/uploads/sites/7/2017/06/DURARARA-ACCI%C3%93N-Y-MISTERIO-SOBRENATURAL-1.jpg\n\ny este...\n\nhttp://4.bp.blogspot.com/-CranYxZUq2k/VCcJSpODFWI/AAAAAAAABd8/7vckRlkwvtY/s1600/GenocyberCover.jpg\n\ny este...\n\nhttp://anime.es/wp-content/uploads/2013/02/Berserk_wallpaper_by_Wizmaster.jpg\n\nete...\n\nhttp://img1.ak.crunchyroll.com/i/spire3/cbb55a6382682bf71e91f685c6473c5a1487736090_full.jpg\n\ny ete...\n\nhttps://www.animenewsnetwork.com/thumbnails/hotlink-full/encyc/A605-55.jpg\n\noto mas...\n\nhttps://upload.wikimedia.org/wikipedia/en/thumb/a/a4/DTB_DVD.jpg/220px-DTB_DVD.jpg\n\ny oto...\n\nhttp://img1.ak.crunchyroll.com/i/spire2/127db1f9004cc0e4a515790475d9e2631473191104_full.jpg\n\nmas...\n\nhttps://mooseanime.files.wordpress.com/2010/12/trigun1.jpg\n\nya me paso de verga...\n\nhttps://2.bp.blogspot.com/-0KogPzheuRk/WZII0nWQ2bI/AAAAAAAAHNU/FggnJAzprZ8JeRZXvuYHB7l7Ezz1yJzFQCLcBGAs/s1600/ghost_in_the_shell_anime.jpg\n\nque mas da...\n\nhttp://cdn.jkanime.net/assets/images/animes/image/kagewani-shou.jpg\n\nel ultimo...\n\nhttps://myanimelist.cdn-dena.com/images/anime/10/80271l.jpg\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"nkitooo00","date":"2017-12-27T16:00:01.798+0000","up_votes":1,"down_votes":0,"body":".Hack no es algo que se pueda recomendar así como así.","replies":[{"poster":"ParedSinRevoque","date":"2017-12-27T16:17:45.480+0000","up_votes":1,"down_votes":0,"body":"Como se recomienda?\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"nkitooo00","date":"2017-12-27T16:31:05.336+0000","up_votes":1,"down_votes":0,"body":"Me refiero a que no es un anime que se recomiende como por ejemplo Death Note por poner uno, no sé si se entiendo a lo que me refiero. Tiene un principio muy lento y aburrido, cosa que puede ser diferente para otras personas.","replies":[{"poster":"ParedSinRevoque","date":"2017-12-27T16:51:05.928+0000","up_votes":1,"down_votes":0,"body":"Mira capo recomiendo lo que se me de la gana recomendar, si al que lo ve no le gusta no lo va a ver y se le gusta lo seguira viendo es asi de simple y cambiando de tema cuantas copa tenes maestruli?\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"nkitooo00","date":"2017-12-27T17:50:39.346+0000","up_votes":1,"down_votes":0,"body":"3 trofeos y 1 copa de bowling capo, cúantos tenés vos?","replies":[]}]}]}]}]},{"poster":"Icesoul","date":"2017-12-27T17:32:16.533+0000","up_votes":1,"down_votes":0,"body":"Trate hace un tiempo de darle una oportunidad a trigun, me vi 13 caps y lo deje, le di muchas oportunidad y si en 13 caps me parecio tipo power ranger la serie, pues bueno...la deje con ganas jaja","replies":[]},{"poster":"Hísøka","date":"2017-12-27T16:36:55.671+0000","up_votes":1,"down_votes":0,"body":"Me vi todos estos animes, son muy buenos (Trigun es bastante viejo jaja es de cuando yo naci) 1995 creo pero muy bueno aun siendo actualmente ","replies":[]}]},{"poster":"THEBIGBOSS2099","date":"2017-12-28T12:21:04.989+0000","up_votes":1,"down_votes":0,"body":"Muy buenas tus recomendaciones, para un público más dirigido a la acción sobretodo, pero los animes que recomendaste están todos geniales.\nMi favorito es Full Metal Alchemist: Brotherhood","replies":[]},{"poster":"Ozarcus","date":"2017-12-27T21:49:27.862+0000","up_votes":1,"down_votes":0,"body":"Yo soy muy fino con los animes, en mi opinion es como buscar entre la basura a la espera de encontrar oro. \nSin embargo los temas que recomendaste me conosco la mayoría y son muy buenos. Así que voy a echarle un buen ojo a tu lista.\n\nGracias por compartir!\nY te faltó este ;)\n\nhttps://i.gyazo.com/33e5efa0566f3103d0ac2c30194ecfe6.jpg","replies":[{"poster":"rokushoger","date":"2017-12-28T11:05:53.646+0000","up_votes":1,"down_votes":0,"body":"Sabés que parasyte es uno que tenía pensado recomendar y no pude meterlo en el comentario original. Pero creo que voy a sacar una parte dos porque me dejé demasiado afuera.","replies":[]}]},{"poster":"Bizantine","date":"2017-12-27T22:11:51.152+0000","up_votes":1,"down_votes":0,"body":"Alguien vio Devilman, es recomendable de ver?.","replies":[{"poster":"rokushoger","date":"2017-12-28T11:03:25.884+0000","up_votes":1,"down_votes":0,"body":"No la conozco sinceramente, le hecharé un vistazo.","replies":[]}]},{"poster":"Pialsato","date":"2017-12-28T03:53:54.308+0000","up_votes":1,"down_votes":0,"body":"Te recomiendo clannad, hunter hunter y macross delta","replies":[{"poster":"rokushoger","date":"2017-12-28T11:02:40.044+0000","up_votes":1,"down_votes":0,"body":"Clannad no me gustó tanto, hunter x hunter está muy bueno, y macross delta me la anoto porque no la vi.","replies":[]}]},{"poster":"Challenger15","date":"2017-12-28T06:22:52.416+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"rokushoger","date":"2017-12-28T11:01:29.085+0000","up_votes":1,"down_votes":0,"body":"La primera viene a ser SAO mismo, la segunda es la que transcurre en Alfheim, y la tercera es la que están en phantom bullet.\nAunque en realidad originalmente la dividen como que sao y alfheim son una temporada y phantom bullet es la segunda, en realidad las novelas están divididas entre si (que es en lo que se basa SAO).","replies":[]}]},{"poster":"Shion Archimago","date":"2017-12-27T14:45:44.760+0000","up_votes":1,"down_votes":0,"body":"yo recomiendo shigatsu wa kimi no uso (your lie in april)\nuna serie muy linda, colorida, emocionante, buena musica etc","replies":[{"poster":"Pialsato","date":"2017-12-28T03:51:18.642+0000","up_votes":1,"down_votes":0,"body":"Es  sobrevalorada a MI OPINION, si quiero algo triste mejor me veo clannad o macross dekta que es triste y con mejor musica","replies":[]},{"poster":"rokushoger","date":"2017-12-27T14:59:59.686+0000","up_votes":1,"down_votes":0,"body":"No lo conozco, pero leí una reseña y promete bastante, anotado y gracias!","replies":[]}]}]}