{"poster":"dadevarG","date":"2016-12-26T23:54:43.424+0000","title":"Voto de kick en Champion Select de Ranked.","subforum":"Charlas Generales","up_votes":82,"down_votes":19,"body":"Al ver el titulo ya uno pensara que probablemente esto sea abusado por premades, pero a&ntilde;adir un voto para kickear un jugador y asi volver a cola sin dodges necesarios podria servir en varios casos.\r\nHago este post despues de haber dodgeado en champ select en una ranked, nuestro support habia lockeado Zed con cleanse y ghost, tuve que dodgear para evitar una derrota inminente.","replies":[{"poster":"support girl uwu","date":"2016-12-27T02:01:52.758+0000","up_votes":27,"down_votes":1,"body":"Meh, ya me imagino el ''wtf no quiero un {{champion:63}} sup omg te voy a kickear men'' o ''lol un {{champion:30}} mid? eso no esta en meta, y jugas mal con el champ vamos a kickearlo'' o ''pls kickeen a X me trolleo la anterior'' o ''-somos duo bot nos dejas lane? -no sorry -bueno entonces kickeenlo porque somos malos en las otras lanes y vamos a perder'' o la clásica donde den por hecho que van a kickear a un troll y se pongan todos a trollear y terminen perdiendo por eso, y etc.","replies":[{"poster":"Icesoul","date":"2016-12-27T03:20:58.555+0000","up_votes":3,"down_votes":1,"body":"Pero el kick no conlleva nada, o sea, de ultima si pasa eso, el que fue echado vuelve a buscar cola simplemente.","replies":[{"poster":"support girl uwu","date":"2016-12-27T05:40:06.073+0000","up_votes":4,"down_votes":0,"body":"Pero de por si hay que esperar que encuentre una partida, y con lo lenta que es la selección del lol son como otros 5 minutos ahí, si tengo que hacer eso 20 veces por partida (porque si como decís, no conlleva a nada, si veo que mi adc tiene 50% winrate y quiero uno con 60%+ trolleo para que me kickeen hasta que me toque el que quiero) pos gg.","replies":[{"poster":"Icesoul","date":"2016-12-27T10:58:34.808+0000","up_votes":2,"down_votes":1,"body":"Bueno, no te pases tampoco, jaja, como te va a pasar 20 veces, a lo mucho como dos probablemente nomás, hay que ser bastante rata como para ver el winrate y comportarse así, puede ser posible lo que decís, sí, pero no frecuente, el ejemplo que das sería el peor de los casos pienso yo simplemente.","replies":[{"poster":"Yazuò","date":"2016-12-27T16:15:30.935+0000","up_votes":1,"down_votes":0,"body":"si hay muchos bronces así y platas = {{champion:157}} {{champion:238}} {{champion:92}} {{champion:67}}  isi","replies":[]}]}]}]},{"poster":"G0RDO OTAKU","date":"2016-12-27T02:44:36.325+0000","up_votes":1,"down_votes":4,"body":"si se te viene todo eso a la mente es porque lo vas a hacer xD o sufriste mucho :'v","replies":[]},{"poster":"Mugii","date":"2016-12-27T02:15:21.714+0000","up_votes":2,"down_votes":5,"body":"Por eso voto, es una votación, si ves un troll, el resto probablemente también voten por sacarlo.","replies":[]}]},{"poster":"Darksolex","date":"2016-12-27T00:57:45.696+0000","up_votes":6,"down_votes":0,"body":"No hay forma de que no sea abusado por premades. Aparte encerraria demasiado el meta. Porque tranquilamente puede ir zed con ghost y cleanse en ranked y no jugar mal. O inclusive jugar mal, pero no a drede, y no es ilegal en ningun caso (como MF support en el mundial).\nCuando termina la partida los 9 lo pueden reportar y ahi se lo sancionara.\nA lo sumo, lo que pueden hacer es mejorar el sistema de reportes y sanciones.","replies":[]},{"poster":"Dildo de Moria","date":"2016-12-27T10:46:44.270+0000","up_votes":6,"down_votes":1,"body":"Yo no entiendo a la gente con estos post, osea, depende el nombre le meten 80 negativos u 80 postivos, yo estoy completamete a favor así que tomá tu +1.","replies":[{"poster":"Salvor","date":"2016-12-27T11:32:43.317+0000","up_votes":2,"down_votes":1,"body":"Jajaja si, si lo subía furchi reventaba.","replies":[]},{"poster":"resnov15","date":"2016-12-27T10:56:39.903+0000","up_votes":2,"down_votes":1,"body":"Depende de como sea el post y de la gente","replies":[]}]},{"poster":"Bronze Style","date":"2016-12-28T02:50:32.799+0000","up_votes":3,"down_votes":0,"body":"No me pinta, si permiten kickear en ranked los unicos champs que se van a ver van a ser 2 o 3 por cada lane, y a la minima de romper el meta te van kickean. \nAdemas, incluso kickeando van a aseguir apareciendo gente con lag y personas con ganas de trollear. En mi caso la mayoria de la veces el que mas trollea es el que se la da de bueno o el que se la da de jefe en la seleccion de campeones y no quien rompe el meta...","replies":[]},{"poster":"Ghalen","date":"2016-12-27T03:41:07.724+0000","up_votes":3,"down_votes":0,"body":"Si fuese aplicable a una cola SoloQ donde no se pueda jugar ni siquiera en dúo, podría ser conveniente, de lo contrario, se presta a abusos como ya explicaron.\n\nAlgo parecido ocurría con el viejo TeamBuilder (y estamos hablando de partidas normales), cuando te metías a determinada posición con un campeón poco convencional, muchas veces te pateaban inmediatamente, o si eras el capitán, los que se metían a tu partida, se iban en cuanto veían una combinación de posición - campeón poco ortodoxa.\n\nCon lo prejuiciosa, ignorante y paranoica que es una parte de la comunidad, implementar una votación en las colas Ranked actuales, generaría más problemas que soluciones.","replies":[]},{"poster":"BeamOeste","date":"2016-12-27T01:23:26.843+0000","up_votes":3,"down_votes":0,"body":"Seria un sistema sin control y los premades echarian a los que no les parece","replies":[]},{"poster":"Im Her Oni san","date":"2016-12-27T00:57:31.541+0000","up_votes":3,"down_votes":0,"body":"sera usado por premades contra alguien que no hace nada malo :/","replies":[]},{"poster":"PATH Kamui","date":"2016-12-27T20:58:36.680+0000","up_votes":2,"down_votes":0,"body":"No, la propia comunidad abusaría del mismo y se prestaría para malos entendidos y situaciones desagradables, sobre todo  cuando no eres el premade de la mayoría.","replies":[]},{"poster":"rockokok","date":"2016-12-27T02:36:58.669+0000","up_votes":3,"down_votes":3,"body":"Eso siempre pasa capo, no tendría sentido crear todo un sistema para todos los servidores solo porque a vos y a 10 gatos locos mas los quisieron trollear. Saludos","replies":[{"poster":"G0RDO OTAKU","date":"2016-12-27T02:45:52.521+0000","up_votes":3,"down_votes":2,"body":"no creo que solamente le pase a pocos. Somos numerosos y mientras mas somos mas alto es el porcentaje","replies":[]}]},{"poster":"SenpaiDeathx","date":"2016-12-27T03:50:54.622+0000","up_votes":2,"down_votes":1,"body":"de nada te serviria ir con premade para kickear a alguien dos votos no es mayoría, al menos no en soloQ, en la flexible quizas no deberian ponerlo, pero en soloQ sería necesario algo así","replies":[]},{"poster":"PBE","date":"2016-12-27T02:20:05.732+0000","up_votes":2,"down_votes":1,"body":"el votekick estaria bueno in game.  y posteriormente poder tirar remake. \n\ny quizas el enemigo prodria votar si ve q uno trolea ?","replies":[]},{"poster":"Rroncon","date":"2016-12-27T18:42:36.299+0000","up_votes":1,"down_votes":0,"body":"A mi me parece bien, que sea con 4 votos, que no den cola a nadie, ustedes diran \"ay pero el trolll vuelve a buscar partida\" y bueno, que busque, con que no este conmigo no tengo problemas, y si sigue troleando va a buscar partida eternamente, lo van a kikear siempre, y si no te dejan ir urgot mid (que no me parece un mal pick pero bue), y bue, yo prefiero que me kickeen antes que jugar con gente que me va a flamear toda la partida por mi pick.","replies":[{"poster":"RING0","date":"2016-12-27T18:48:32.195+0000","up_votes":1,"down_votes":0,"body":"que comentario egoísta,mientras no me trolee a mi no me importa. Que pena de comunidad","replies":[{"poster":"Rroncon","date":"2016-12-28T19:23:58.923+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=x JackTheRipper,realm=LAS,application-id=v7qsfXsE,discussion-id=Np4M5Wkx,comment-id=00160000,timestamp=2016-12-27T18:48:32.195+0000)\n>\n> que comentario egoísta,mientras no me trolee a mi no me importa. Que pena de comunidad\n\nPero a lo que me refiero s, si alguien decide trolear no va a poder jugar nunca, lo que esta bien, y si decide no trolear va a poder jugar, y aunque no sea bueno sl menos se pierde por algo del juego y no por que alguien no queria ir supp","replies":[]}]}]},{"poster":"SpectacledBearer","date":"2016-12-28T12:39:37.583+0000","up_votes":1,"down_votes":0,"body":"Sería más sano que dodgear cuando el problema es claramente solo uno de los teammates","replies":[]},{"poster":"GabtanGamer","date":"2016-12-28T12:12:58.853+0000","up_votes":1,"down_votes":0,"body":"Hay personas que usan campeones en otro rol que el debido y lo usan bien, a lo mejor el tipo ese llevaba 2 años jugando con zed supp, cada persona tiene su estrategia y puede llevar el campeón que quiera a la linea que quiera si así es como mejor lo maneja.\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"DelVamoo","date":"2016-12-28T06:26:10.822+0000","up_votes":1,"down_votes":0,"body":"En ranked no debería haber penalización por tiempo al dodgear, solo la de sacarte LP. Eso de esperar los 5 minutos está perfecto en normal, donde si te toca un troll jugás igual y lo reportas al final de la partida, total es una normal, da igual perderla. Pero en ranked nadie quiere perder...","replies":[]},{"poster":"DelVamoo","date":"2016-12-28T06:22:22.374+0000","up_votes":1,"down_votes":0,"body":"No sé, me preocupa más que pierdas la promo por dodgear, te toca un troll en promo y te lo tenés que fumar igual (yo dodgeo igual, para no perder ELO).","replies":[]},{"poster":"SKT Sofia ","date":"2016-12-27T18:53:12.183+0000","up_votes":1,"down_votes":0,"body":"Se puede hacer que los premades no abusen de esto.\nLas duo/solo son para un premade máximo de 2. Por lo tanto se necesitarían 4 votos para kikear a una persona, y esto del kik solo se usaría en ranked solo/duo, eliminando el kik de las flexibles. de ese modo alguien inteligente no querrá kikear (ya que dudo que lo hagan a propósito ya que los bans y picks tardan mucho)\n\nEn resumen:\n\n-Solo se haría en duo/solo Q\n-Se podría kikear a un aliado SOLO después de pickear y banear (Asi la gente no tiene ganas de esperar toooodo de nuevo, y solo en caso de emergencia kikear a un troll desde la selección)\n-Se necesitarían 4 votos para kikear a alguien, ni 3, ni menos. 4!","replies":[{"poster":"XsR reddaS","date":"2016-12-28T03:53:03.201+0000","up_votes":1,"down_votes":0,"body":"eres el/la de hmmmm izi? el/la fanatico/a de draven?","replies":[]}]},{"poster":"Sunday Holiday","date":"2016-12-28T00:37:28.729+0000","up_votes":1,"down_votes":0,"body":"Los buenos Kick de votación? +1","replies":[]},{"poster":"Send Núdes","date":"2016-12-28T00:25:55.405+0000","up_votes":1,"down_votes":0,"body":"El kick estaria muuuy bien si los 4 votan que si.. Si no. el kick no cuenta y seria muuy abusado por los estupidos.\nporque siempre que juge. siempre hay 1 que si sabe las cosas y no ira a kickear alguien que no sea troll y quiera jugar de enserio.\n\n+1 pero Solo si se nececitan 4 para kickear al 5to jugador(al troll)","replies":[]},{"poster":"Zinc","date":"2016-12-27T19:56:37.939+0000","up_votes":1,"down_votes":0,"body":"Entiende el concepto, pero discrepo totalmente. Ya de por si BASTANTE demoras en jugar entre la fase de seleccion/bloqueo, el que no elegi xq se queda viendo porno, el que se queda afk y tenes q mandar remake, etc. Seria estar2hs para jugar una partida.\n\nRepito, entiendo el concepto y m agrada, pero aplicarlo seria mas canceroso q no tenerlo.","replies":[]},{"poster":"WKH4 Sans","date":"2016-12-27T18:18:02.264+0000","up_votes":1,"down_votes":0,"body":"Es simple, lo KICKEAN, a la tercera que lo kickean en la misma cola le dan un ban de tiempo para esperar de 5 minutos, que obviamente es progresivo, no creo que te toquen \"100 premades\", toxicas todas las partidas.","replies":[]},{"poster":"CordobezEverdeen","date":"2016-12-27T03:56:09.209+0000","up_votes":1,"down_votes":0,"body":"Claro fomentemos aun más el meta asqueroso y aburrido.\n¡No es suficiente conque Riot balancee el juego alrededor de la escena competitiva y que centenares de miles de jugadores imiten y usen builds o campeones porque lo vieron en competitivo!\nNo. Amo el antimeta mucho y no quiero que porque pickear {{champion:86}}  jungla me kickeen porque a ellos no les gusta (Soy maestría 7 con Garen jg yay)","replies":[{"poster":"WKH4 Sans","date":"2016-12-27T18:16:55.612+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CordobezEverdeen,realm=LAS,application-id=v7qsfXsE,discussion-id=Np4M5Wkx,comment-id=000e,timestamp=2016-12-27T03:56:09.209+0000)\n>\n> Claro fomentemos aun más el meta asqueroso y aburrido.\n> ¡No es suficiente conque Riot balancee el juego alrededor de la escena competitiva y que centenares de miles de jugadores imiten y usen builds o campeones porque lo vieron en competitivo!\n> No. Amo el antimeta mucho y no quiero que porque pickear {{champion:86}}  jungla me kickeen porque a ellos no les gusta (Soy maestría 7 con Garen jg yay)\n\nBueno, comunicale a tu TEAM que no eres un troll y ya.","replies":[]}]},{"poster":"Khada J","date":"2016-12-27T16:15:46.333+0000","up_votes":1,"down_votes":0,"body":"Estaría bastante bueno que con 4 votos se pueda kickear a un jugador que va a trolear, obviamente no cuando aya premades de a 4, pero si en soloQ o Blind pick (repito, sin premades).","replies":[]},{"poster":"MrAres","date":"2016-12-27T11:27:42.137+0000","up_votes":1,"down_votes":0,"body":"Va a terminar siendo mas contra producente que bueno, por todos los \"especialitos\" que van a empesar a kickear por \"ayshhh dehame adc, zoi meiñ veiñ, ehhh dehame li zin, karreo\"","replies":[]},{"poster":"Hørcrux","date":"2016-12-27T04:20:45.573+0000","up_votes":1,"down_votes":0,"body":"Que solo este en solo/duo Q y listo :p asi no se podria abusar tanto","replies":[]},{"poster":"lordeman10","date":"2016-12-27T04:00:55.753+0000","up_votes":1,"down_votes":0,"body":"sería un horror re abusable, las partidas no empezarían nunca\n\nel dodge con su pequeño precio es el mal menor","replies":[]},{"poster":"EEL EUQ LE 0TUP","date":"2016-12-27T23:15:30.876+0000","up_votes":1,"down_votes":1,"body":"Yo pienso que debería existir una opción como reportar al lado del jugador en la seleccion, una vez que los 4 jugadores reportan a ese jugador se revela el pick y la linea al equipo enemigo si este jugador pickeo troll el equipo enemigo termina la votacion. Esto seria una forma segura de confirmar si es realmente un pick troll por ejemplo brand supp no es la mejor opcion pero es un pick aceptable en la linea.. un teemo supp es diferente.. con los 4 jugadores del equipo del troll mas los del equipo enemigo se detiene la cola el jugador recibe un llamado de atencion y los jugadores q reportaron y los enemigos reciben algun tipo de recompensa por ser jugadores ejemplares ... es mas diria q los del equipo enemigo reciban esta recompensa ya que a ellos les convendria tener un troll en el equipo enemigo.. puede ser un plus de pi por 1 partida puntos de buen jugador se puede pensar eso... tambien pense que si se juntan los 4 reports pero del equipo enemigo ninguno la partida se juega peroo! estaria en \"revision\" para verificar q paso.. por ejemplo si los 4 jugadores son trolls q querian molestar, sancion! y si el equipo enemigo lo unico q queria era beneficiarse del jugador troll, sancion !","replies":[]},{"poster":"Le Terrible","date":"2016-12-27T05:36:10.838+0000","up_votes":1,"down_votes":1,"body":"ahh no me toco la linea que deseaba, listo te kickeo y vuelvo a probar suerte","replies":[]},{"poster":"Icesoul","date":"2016-12-27T03:19:44.485+0000","up_votes":1,"down_votes":1,"body":"Mejor perder puntos que mrr, en otros juegos esta eso, no estaria mal que lo pusieran.","replies":[]},{"poster":"G0RDO OTAKU","date":"2016-12-27T02:43:56.734+0000","up_votes":1,"down_votes":1,"body":"Apoyo la noción. Ya me tocaron un par de trolls que pickean cualquier cosa o gente que juega su primera ranked y no tiene ni maestria con campeon.","replies":[]},{"poster":"Thails SirYordle","date":"2016-12-27T02:12:13.644+0000","up_votes":1,"down_votes":1,"body":"Tiene sus pro y sus contras, habría que evaluarlo muy bien","replies":[]},{"poster":"Mosh","date":"2016-12-27T00:33:36.823+0000","up_votes":1,"down_votes":1,"body":"Si, algo tienen que hacer. Encima el troll puede iniciar otra partida mientras que el que salio por el bien del team piede los PL y se como el tiempo de penalización.","replies":[]},{"poster":"Maycoltf2","date":"2016-12-27T00:03:34.229+0000","up_votes":1,"down_votes":1,"body":"Me parece muy buena la idea , y que el afectado tenga una sanción de 30 segundos de espera.","replies":[]},{"poster":"Ode to dark","date":"2016-12-27T01:15:51.468+0000","up_votes":3,"down_votes":4,"body":"En el S4 lo hacían y era excelente para hechar a los hackers y los que insultaban mucho. Sin embargo, habría que afinar muy bien una idea así, ya que no solo como dices, sería abusado por las premades, también generaría que si alguien quiere ir algo fuera del meta como Urgot top, Garen mid (pray 4 Xpeke) haría que estos jugadores se vieran muy perjudicados sin estar troleando ni intentando perder a propósito. Pero la idea base es muy buena así que te dejo mi positivo {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}