{"poster":"Packungsmeister","date":"2015-02-27T07:46:57.013+0000","title":"Mr.Braum Skin Vorschlag","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":1,"body":"Hallo ich würde hier gerne einen Skin vorschlagen für den Champion Braum.\r\n\r\nKosten: 1350 RP\r\nAussehen: Läuft rum mit Rollator vor sich\r\n\r\nBackport: Drückt auf einen Knopf schiebt seinen Rollator rein und geht selber hinein. Danach schließt sich der Aufzug und dieser fährt nach oben.\r\n\r\n\r\nQ: Schießt den Rollator nach vorne (Rollator dreht sich dabei um 360 Grad)\r\nW: Wie normale W nur mit anderer Farbe\r\nE: Hält Rollator vor sich und blockt damit Schaden ab\r\nR: Haut seinen Rollator auf den Boden und die Erde spaltet sich (mit entsprechender Farbe wie bei W und Q, E mir fällt nur gerade keine ein)\r\n\r\nSorry, dass ich keine Bilder zeige, weil ich dafür zu schlecht bin um es zu malen.\r\nAufjedenfall finde ich die Idee ganz gut. \r\n\r\nLG TheyCallMeRider","replies":[{"poster":"Humpelstilzche","date":"2015-02-27T08:12:33.150+0000","up_votes":1,"down_votes":0,"body":"Riot achtet bei Skins immer sehr darauf, dass die grundlegenden Charakteristika eines Champs erhalten bleiben. Bei Braum ist das wohl der Schild, d.h. Braum wird definitiv immer irgendwas großes flaches in der Hand halten. Ein Rollator passt da eher weniger ins Konzept. Dazu kommt noch Braums grundlegender Charakter als großer, starker Beschützer...auch da passt das Konzept, dass Braum nicht alleine Laufen kann, nicht wirklich rein.","replies":[{"poster":"Packungsmeister","date":"2015-02-27T16:20:13.561+0000","up_votes":1,"down_votes":0,"body":"Gut, kann ich verstehen das mit dem beibehalten des Konzepts. Aber gucken wir mal bei Xin Zhao? Er hat auch einen unpassenden Skin Special Agent Xin Zhao. Er ist kein Assasin.","replies":[{"poster":"Gelban der Reihe","date":"2015-02-27T16:31:29.863+0000","up_votes":1,"down_votes":0,"body":"Das ergibt keinen Sinn.","replies":[]}]},{"poster":"pLâce","date":"2015-02-27T13:39:34.682+0000","up_votes":1,"down_votes":0,"body":"Dann nehmen wir den Homeless Braum.\n\nRecall geht er in seine Papphütte rein und schläft.\nDer Q wird Pfandflaschen.\nDer W bleibt wie bisher.\nDer E hält Braum seine Pappe vor sich.\nDer R wirft ganz viel Müll unter anderem Pfandflaschen, Teemo, Papier, Pappe, Teemo um sich.\n\nWie wäre es damit ? Es bleibt im Konzept :b","replies":[{"poster":"Packungsmeister","date":"2015-02-27T16:17:28.713+0000","up_votes":1,"down_votes":0,"body":"Haha :)","replies":[]}]}]}]}