{"poster":"G2 Mrk","date":"2015-03-31T16:13:36.186+0000","title":"Ranked y Servidor Cayéndose a cada rato","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Reci&eacute;n acabo de jugar una partida. La cual estaba en ranked duo... El servidor se cayo como 4 veces y estaba ganadisima... 4 veces se cayo el servidor... 4!!! eramos 4 argentinos en el team y 1 chileno. El chileno nunca se le cayo y a nosotros 4 si (Distintos proveedores). No puede ser que despu&eacute;s de estos inconvenientes hayamos perdido 3 tf por culpa del servidor y no nos cuenten derrota evitada la verdad no lo puedo creer. Cada vez me dan menos ganas de jugar. Por lo menos que nos cuente derrota evitada y no nos quite lp. Nunca juego ranked NUNCA. Hoy juego y el servidor como siempre andando para la mierda +10. \r\n\r\nOjala nos cuenten como derrota evitada, esto suced&iacute;a en NA y te daban rp. Cada vez peor este sv, prefiero jugar en NA con 200 de ping y que no me pase estas bludeses. Asi quieren mantener la comunidad? de todos mis amigos que juegan el 40% esta en NA y nunca una queja. Yo que juego en este servidor todos los d&iacute;as me anda para el orto, bajones de fps, no tenemos todos los modos de juego, etc. \r\n\r\nPerd&oacute;n por mi vocabulario pero ando con bronca por que no es lindo perder por que el servidor no anda en la condiciones que deber&iacute;a andar. Ojala nos devuelvan el lp y arreglen esto. Ya no dan ganas de jugar.\r\n\r\nDesde ya, gracias. Espero que no eliminen este post por que seria el colmo.","replies":[{"poster":"Raúl","date":"2015-04-01T19:28:21.481+0000","up_votes":1,"down_votes":0,"body":"Ahora mismo estoy sufriendo una desconexión tras otra... estará relacionado a URF?","replies":[]},{"poster":"leionikz","date":"2015-03-31T16:20:48.803+0000","up_votes":1,"down_votes":0,"body":"Me paso lo mismo, estaba jugando ranked y se cayo facil 4 veces, obviamente perdimos, no puede ser que siempre los argentinos tengamos estos problemas de reconexion, estaria bueno que lo arreglen de una vez por todas, asi ni ganas te dan de jugar","replies":[]}]}