{"poster":"SPX Levi","date":"2017-04-24T23:09:41.978+0000","title":"Consigli Toplane","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Buonasera, parto dicendo che sono mesi che provo a trovarmi un ruolo, quello che preferivo di pi&ugrave; era l&#039;adcarry, ma per vari motivi e tilt quando venivo shottato ho provato ad andare jungle, solo che non riuscivo ad aiutare a dovere il mio team. Infine sono arrivato in toplane e considerando che oggi ero partito con quasi 0 lp silver 5, sono arrivato in silver 4 giocando solo toplane, il problema &egrave; che non so quasi nulla. Non so quando continuare a split pushare, quali sono i migliori champ al momento e come counterarli, so poco. Qualche consiglio? Grazie mille in anticipo :){{summoner:12}}","replies":[{"poster":"DivusAugustus","date":"2017-04-25T09:33:43.689+0000","up_votes":2,"down_votes":0,"body":"Ti consiglio di dare un'occhiata al canale youtube di _SoloRenektonOnly_ che, come immagino sia intuibile, è un Renekton otp ma gioca molti altri champions (praticamente la maggior parte dei top laners). Oltre a spiegare bene come funzionano alcuni match-up in base anche a summoners/maestrie è molto competente per quanto concerne la wave management. Se ne hai tempo e voglia facci un salto!","replies":[]},{"poster":"schodlees","date":"2017-04-25T07:41:09.359+0000","up_votes":2,"down_votes":0,"body":"Sono dal telefono appena apro Il comp to addo","replies":[]},{"poster":"XMegaBlaster","date":"2017-04-26T11:50:36.001+0000","up_votes":1,"down_votes":0,"body":"Allora , io sono b1 adesso ma la scorsa season ero silver.\nHo fatto la scalata da b5 a b1 giocando _Top/Mid_ solo con Yasuo.\nFinivo e finisco ancora oggi sempre Top e vado Yasuo (maestria7 320k mastery points ) e con Renekton. All inizio subito appena prendi il 2 (con tutti e 2 i champ ) fai un trade perchè a questi livelli diciamo che solo riven è cosi skillata da ammazzarti al lvl2.\nNon dimenticarti di farmare sempre e fai il primo back appema hai 1300gold minimo.\nVai in base e ti compri un altra Doran(spada) e poi degli oggetti del primo item e 2/3 pozze.\nA quel punto oneshotterai e facendo kill ti fiedderai. Quando muore devi sempre pushare e appena lui viene tu backi o lo tryhardi ancora un po. Da poco poi , anch io sto sperimentandoun nuovo oggetto :{{item:1083}} che praticamente ogni minion che uccidi di ta 1 gold in piu e quando uccidi 100 minion con questo oggetto , lui to droppa 350gold ( ti da un po di danno e 3 di vita quando attacchi edifici , minion o nemici) . \nSpero di esserti stato di aiuto perchè io sto salendo un casino con questo modo, se vuoi addami agli amici per Duo","replies":[{"poster":"1Baltazar1","date":"2017-04-27T19:51:05.993+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=XMegaBlaster,realm=EUW,application-id=MJVj50Jw,discussion-id=ede1MgAH,comment-id=0003,timestamp=2017-04-26T11:50:36.001+0000)\n>\n> Allora , io sono b1 adesso ma la scorsa season ero silver.\n> Ho fatto la scalata da b5 a b1 giocando _Top/Mid_ solo con Yasuo.\n> Finivo e finisco ancora oggi sempre Top e vado Yasuo (maestria7 320k mastery points ) e con Renekton. All inizio subito appena prendi il 2 (con tutti e 2 i champ ) fai un trade perchè a questi livelli diciamo che solo riven è cosi skillata da ammazzarti al lvl2.\n> Non dimenticarti di farmare sempre e fai il primo back appema hai 1300gold minimo.\n> Vai in base e ti compri un altra Doran(spada) e poi degli oggetti del primo item e 2/3 pozze.\n> A quel punto oneshotterai e facendo kill ti fiedderai. Quando muore devi sempre pushare e appena lui viene tu backi o lo tryhardi ancora un po. Da poco poi , anch io sto sperimentandoun nuovo oggetto :{{item:1083}} che praticamente ogni minion che uccidi di ta 1 gold in piu e quando uccidi 100 minion con questo oggetto , lui to droppa 350gold ( ti da un po di danno e 3 di vita quando attacchi edifici , minion o nemici) . \n> Spero di esserti stato di aiuto perchè io sto salendo un casino con questo modo, se vuoi addami agli amici per Duo\n\nOddio...main yasuo e non ti vergogni?\nComunque se quello che si dice è vero, piu sali e piu pickare yasuo si rivelerà una scelta sbagliata.\nE poi dai, onestamente, mi vengono in mente almeno 5 champion con cui counterare yasuo in top.\nTi consiglio di metterlo nel cassetto e dedicarti a qualche altro champion.","replies":[{"poster":"XMegaBlaster","date":"2017-04-29T16:01:25.095+0000","up_votes":1,"down_votes":0,"body":"Scusa , prendi come esempio Yassuo ( youtuber e streamer di twitch ) è challenger ed ha fatto tutto solo con Yasuo.\nOgnuno puo scegliere di mainare quello che vuole e uno non si deve vergognare per un champion , se no perché la riot non lo elimina o lo nerfa? se non lo eliminano o non lo nerfano il motivo è perché è bello e piace a molte persone e non ci si deve vergognare.\nPure se tu sai dei counter , son significa che tu vinca la lane , peche qualsiasi Yasuo potrebbe pure farti un outplayed e tu morire e feedarlo\n(non è vero che più si sale più Yasuo viene meno pickato) io per esempio seguo Terenas (Diamond Italiano ) che su 5 partite , 3 incontra Yasuo, quindi Just shut up.\nE poi parli tu maestria 7 Garen e ancora non sei uscito dal Bronzo.\nPrpprio ora facendo solo Yasuo/Kled/Renekton sono salito Silver quindi non mi dire di vergognarsi di mainare Yasuo perché tu maini Garen un dei NB più forti del mondo quindi visto che io non ti ho chiesto pareri sul mio main  ho solo dato un consiglio al ragazzo , ti consiglio di finirla. ^^\n","replies":[]}]}]},{"poster":"Angelus0x","date":"2017-04-26T07:54:06.387+0000","up_votes":1,"down_votes":0,"body":"io pusho quando killo l'avversario, meglio ancora con il jungle insieme da fare insieme a caso tutti i minion. prima dei minuti 10 non ti consiglio di attaccare la torre ma piuttosto di tornare in base, comprare oggetti e tornare in torre senza tp\nio sta cosa del miglior champ non la capisco. volibear è il mio main e non lo caga nessuno, ma killo tutti. l'importante è non regalare kill. se vedi che non ce la fai e stai perdendo, gioca safe o aspetta il jungle. parle per mia esperienza","replies":[{"poster":"vondarck","date":"2017-04-26T11:35:46.466+0000","up_votes":1,"down_votes":0,"body":"Volibear top? \n\n\nRispetto fratello :O","replies":[]}]}]}