{"poster":"SonaGate","date":"2016-02-06T07:11:43.981+0000","title":"Como farmear con ahri","subforum":"Nuevos jugadores","up_votes":2,"down_votes":1,"body":"Bueno, estaba probando a ahri y me di cuenta que los b&aacute;sicos casi no hacen da&ntilde;o y me cuesta horrores farmear(lasthitear).\r\nCasi siempre fui support y ahora estoy intentando ir otras l&iacute;neas, si me pueden dar consejos para farmear bien con ahri.","replies":[{"poster":"SonaGate","date":"2016-02-06T10:39:55.881+0000","up_votes":2,"down_votes":1,"body":"Gracias a todos por los consejos :D\nJusto hace en una partida Coop vs IA me dijeron que los magos eran los mas difíciles.","replies":[]},{"poster":"NerfAutoFill","date":"2016-02-06T08:22:15.029+0000","up_votes":2,"down_votes":1,"body":"Trata de no usar la q los primeros lvl porque el daño es muy poco y mas dejar muy disparejo el hp de cada a minion y te vas a empezar a denegar vos sola el farm. espera que tengan muy poco hp para dar el basico.","replies":[]},{"poster":"NoxusOP15","date":"2016-02-06T07:58:04.023+0000","up_votes":2,"down_votes":1,"body":"Consejos haber no hay creo, pero es mejorar la practicidad y ver videos. La mayoria de los magos casi no tienen daño suficiente al inicio de la partida, lo que dificulta extremadamente el farmeo si no sos muy bueno en eso. Lo que yo hago es simple, clickeo en el minion a matar, veo su vida restante, miro mi daño de ataque, y hago cuentas, demoro 0.50 segundos asique es facil pensar, ejemplo: \nMinion tanque: 112 de vida\nDaño actual del campeon: 64\n\nCuando el minion llegue a 64 o menos ataco para {{champion:86}}tizar el minion. Pero ojo, no es el mejor metodo ni el mas sencillo, cuesta obvio. Con annie no sufres tanto por la Q, te devuelve mana si eliminas una unidad, lo que hace una ventaja ventajosa siempre. Espero haberte ayudado. Saludos","replies":[]},{"poster":"Karrie","date":"2016-02-10T21:23:16.404+0000","up_votes":1,"down_votes":0,"body":"Ahri tiene un basico como de 60 aprox (dependiendo runas y maestrias) \nEs mejor darle unos golpecitos hasta bajarles la mitad de vida y luego esperar para el lasthit\nTe lo aconsejo por los mid laners agresivos que no esperan el last hit\nLa Q no la ocupes para farmear 1 sólo, no vale la pena ya que ahri gasta mucho maná.\nAsegura las Q cuando hayan 2 minions bajos de vida y aprovecha de darle un golpecito al mid enemigo.\n\nNo sabría que más decirte con Ahri, se aprende con practica :) Pero me agrada que uses ese campeón","replies":[]},{"poster":"Dildo de Moria","date":"2016-02-06T16:19:54.749+0000","up_votes":1,"down_votes":0,"body":"Consejo, no empeces a pegar al minion hasta matarlo, esperá a que se le baje la vida y le das el último golpe, con Ahri no te conviene mucho empujar la linea a principios :l","replies":[]},{"poster":"Master Revan","date":"2016-02-06T14:00:38.118+0000","up_votes":1,"down_votes":0,"body":"Además de lo que te dijeron en otros comentarios, ponte la maestría de astucia que te da 5 de daño más a súbditos y monstruos\nViene muy bien para lasthitear, especialmente con magos\nSaludos!","replies":[]},{"poster":"Waninoko Main","date":"2016-02-06T11:22:09.185+0000","up_votes":1,"down_votes":0,"body":"debes observar el ataque de los súbditos (cuando empiezas descarta a los súbditos cuerpo a cuerpo) concéntrate en los de rango y si hay tanqueta prestale atención pues dependiendo de que súbdito enemigo es atacado sabrás cuál es el primero en caer y por lo tanto a cual debes atacar para que el oro extra no se pierda. No soy un pro farmeando pero en las prácticas logro hacer un poco mas de 80 a minuto 10. Si necesitas algún consejo no dudes en preguntar o si quieres agregame en el juego. Saludos invocador","replies":[]},{"poster":"Jota312","date":"2016-02-06T09:10:44.759+0000","up_votes":1,"down_votes":1,"body":"Intenta practicar con bots , los ap son los personajes mas dificiles para farmear en early .","replies":[]}]}