{"poster":"SonaGate","date":"2016-01-13T18:00:27.670+0000","title":"¿Que opinas de la artesania Hextech?","subforum":"Off-topic y temas personales","up_votes":4,"down_votes":1,"body":"Bueno, luego de que Riot haya explicado mejor como funcionara el sistema, &iquest;Qu&eacute; les parece?\r\nA mi me parece bastante bueno, aunque no termine de entender bien la parte de las skins(lo de los campeones lo entend&iacute;, pero me parece que falto algo sobre las skins).\r\nLuego era obvio que iban a poner una restricci&oacute;n en la cantidad de cajas que se pod&iacute;an conseguir lo cual no me parece mal.\r\nLas llaves... Parece que si jugamos solo nunca conseguiremos una :V","replies":[{"poster":"DeigoHMD","date":"2016-01-13T18:49:14.603+0000","up_votes":1,"down_votes":0,"body":"Creó que genera más preocupación. Por el kDa, que tampoco esta bien pues la gente se molestara, flameara, etc,etc. Además creó que entre obtener una caja, una llave, completar fragmentos, y lograr mejorarlos para hacerlos permanentes, costara demasiado, considerando que cada campeón te da una caja por trmporada.","replies":[{"poster":"Ks Erwyn","date":"2016-01-13T19:41:48.677+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=dahumadaxd12,realm=LAS,application-id=J8qpiO2I,discussion-id=Fkac4mO9,comment-id=0002,timestamp=2016-01-13T18:49:14.603+0000)\n>\n> Creó que genera más preocupación. Por el kDa, que tampoco esta bien pues la gente se molestara, flameara, etc,etc. Además creó que entre obtener una caja, una llave, completar fragmentos, y lograr mejorarlos para hacerlos permanentes, costara demasiado, considerando que cada campeón te da una caja por trmporada.\n\nson mas de 100 campeones, lo consideras pocas cajas?..........................","replies":[]}]},{"poster":"erwinchelo","date":"2016-01-13T18:33:10.907+0000","up_votes":2,"down_votes":0,"body":"Fomenta un poco mas el juego en premades y recompensa a la larga el buscar jugar bien y ganar, lo que no me convence es, no es tan difícil lograr una S+, juegas un juego mezquino, buscas no morir , ganas un par a asist, robas una   q otra kill y bang una S+, caja......habrá gente que encuentre un método de abusar de esto.","replies":[]},{"poster":"nicotikoxd","date":"2016-01-14T14:09:02.562+0000","up_votes":1,"down_votes":0,"body":"Yo creo q esta OP","replies":[]},{"poster":"De4d Man Walking","date":"2016-01-13T22:00:52.817+0000","up_votes":1,"down_votes":0,"body":"Yo creo que hay algo oculto atrás de todo eso, no creo que riot regale skin así por que si. Seguramente los drops van a ser difícil de conseguir y vas a terminar gastando RP como siempre.","replies":[{"poster":"Yrox the Third","date":"2016-01-14T06:06:22.374+0000","up_votes":1,"down_votes":0,"body":"Para conseguir una Caja vas a necesitar ganar una partida (creo que con rango S de maestria), y para conseguir llaves (que se consiguen por fragmentos) vas a necesitar jugar premades y que alguien de tu grupo saque una S.\nAl abrir las cajas con las llaves puedes conseguir Campeones, Skins o Skin de wards temporales, que son como \"fragmentos\".\nCada fragmento funciona de la siguiente forma:\n- Puedes desencantar los de campeones para conseguir \"Cristales de campeones\" o de skins de campeones o de wards para conseguir \"Cristales cosmeticos\".\n- Teniendo cierta cantidad de cristales puedes tomar un fragmento y hacerlo permanente, osea, si tienes un fragmento de Rengar por ejemplo, usando cierta cantidad de cristales, lo desbloqueas permanentemente, lo mismo con los skins.\n- Tambien, puedes juntar 3 fragmentos de una misma categoria (3 campeones, 3 skins, 3 skins de wards) para conseguir una recompensa aleatoria permanente de la categoria que elegiste (osea, si pusiste campeones ganas campeon, pones skins ganas skins, asi).\n\nUna caja la puedes conseguir con 125 de Rp, una llave tambien con 125 Rp, un pack de Caja con Llave 195 Rp, eso si estos precios pueden cambiar.","replies":[]}]},{"poster":"Yrox the Third","date":"2016-01-13T20:49:49.038+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=cWxh9lGOeqQ","replies":[]},{"poster":"iCharZ","date":"2016-01-13T19:06:05.130+0000","up_votes":1,"down_votes":0,"body":"En las cajas Hextech (Que te la dan si uno de tu equipo o vos se gana una -S en su maestria de campeon) te vienen campeones, skins de campeones o centinelas. Esas las abris con llaves que las ganas en las victorias en tus partidas. \nDe esa cajita magica Hextech sale alguna de esas cosas, pero no son permanentes, en caso de un campeon, por lo que entendi, es que si vos pones 3 campeones que te dio la caja (cabe shecalcar que esas cosas que te dan no son permanenteeees) te dan uno permanente, te lo quedas.\nY con las skins, vos vas completandola con esencias y te la dan permanente, no me acuerdo si es lo mismo con un campeon, me parece que si, pero lo lei todo apurado, aunque eso es lo que entendi.\nSalu2","replies":[]},{"poster":"Novarum14","date":"2016-01-13T18:48:42.619+0000","up_votes":1,"down_votes":0,"body":"Aún no se saben muchos detalles","replies":[{"poster":"SonaGate","date":"2016-01-14T07:28:28.351+0000","up_votes":1,"down_votes":1,"body":"Ya revelaron todo....","replies":[]}]}]}