{"poster":"Snappynator","date":"2017-04-29T15:33:26.596+0000","title":"Im Moment nervt mich diese Chat-Nachricht wirklich... \"Don't ban \"Xayah\" or report!\"","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":1,"body":"Einige Spieler von euch kennen wahrscheinlich diese Nachricht bereits. Seitdem im Moment das Spielmodus &quot;Legend of the Poro King&quot; l&auml;uft, wollen alle den neuen Champion spielen und ausprobieren: Xayah.\r\n\r\nHabe ich im Champauswahl die M&ouml;glichkeit, Champs zu bannen, f&auml;ngt oder fangen viele sofort an diese Nachricht zu versenden: &quot;Don&#039;t ban Xayah or report!&quot;. Ban ich &quot;Xayah&quot;, f&auml;ngt ein oder mehrere Personen an zu heulen, fangen an zu flamen und schreiben in Chat: OMFG! YOU NOOB! REPORT HIM!&quot;.\r\nIngame dann: Troll und feed.\r\n\r\nDas Spiel macht einem keinen Spa&szlig; mehr und am Ende des Spiels im Chat dann: Report him!\r\nIrgendwie unlogisch... . Die Leute trollen und feeden und zwingen anderen Mitspieler, mich zu reporten. Das finde ich irgendwie lustig und unlogisch. Hat man nicht die andere M&ouml;glichkeit, Leute zu reporten, nur weil man nicht mehr die M&ouml;glichkeit hat, Xayah zu spielen?","replies":[{"poster":"Humpelstilzche","date":"2017-04-29T15:51:37.464+0000","up_votes":2,"down_votes":1,"body":"Zwei Dinge:\n\nErstens: Grundlose Reports haben keinerlei Wirkung, das kann dir doch sonstwo vorbeigehen. \n\nZweitens: Wie du selbst überdeutlich festgestellt hast, ist es keine sonderlich gute Idee den Willen deiner Teammates zu ignorieren und ihnen ihre Picks wegzubannen, da das im Endeffekt darin resultiert, dass das Spiel für dich ruiniert wird, weil du das getan hast. Daher mein Vorschlag: Lass es doch einfach bleiben. Das ist im Prinzip ein rein egoistisches Argument. Du schadest dir selbst, wenn du Leuten ihren Champions wegbannst, weil du damit die Wahrscheinlichkeit massiv erhöhst, dass sie verärgert sind und das Spiel ruinieren. Natürlich ist das was diese Leute tun nicht richtig, aber  du bist dennoch die Ursache und könntest das Problem jederzeit beheben indem du einfach nicht stur bleibst und NICHT anderer Leute Champs wegbannst. Oder ist dir dein Ego wichtiger als ein gutes Spiel?","replies":[]},{"poster":"Adiiva","date":"2017-04-29T20:45:54.355+0000","up_votes":1,"down_votes":0,"body":"Ich versteh das ehrlich gesagt grade auch nicht wirklich?? O.o\nWenn jemand nen Champ spielen will und du das weißt und den dann trotzdem bannst ist es ja klar das es ärger gibt auf welche Art auch immer..\nKlar kann man es netter ausdrücken und ned gleich mit (dont bann XY or Report) drohen aber naja..\nOder hab ich da jetzt etwas falsch verstanden? ^^''","replies":[{"poster":"WC9 Umbra","date":"2017-05-03T14:16:45.340+0000","up_votes":1,"down_votes":0,"body":"Sehe ich auch so. Warum sollte er ohne Folgen anderen Leuten das Spiel verderben dürfen. Ich finde die reports angebracht und es sollte endlich mal auch ein von Riot anerkanter Grund werden.","replies":[]}]},{"poster":"TerrorRaven","date":"2017-04-29T15:42:33.983+0000","up_votes":1,"down_votes":0,"body":"Deine Frage verstehe ich nicht ganz.\nIm Prinzip kann man jeden Reporten, wie man will. Allerdings kommt nur eine Strafe dabei herum, wenn der Betreffende auch tatsächlich was verbrochen hat (Flamen, absichtlich feeden, ect.). Da es (soweit ich weis) nicht verboten ist, einen Champ zu bannen, den ein Mitspieler spielen. Zum Reporten aufzurufen dagegen zählt als \"Negative Einstellung\" und ist reportbar.","replies":[]}]}