{"poster":"IntusMaximus9","date":"2015-05-13T18:56:18.638+0000","title":"was ist mit den Servern los  ? -.-","subforum":"Hilfe & Support","up_votes":4,"down_votes":2,"body":"schon das zweite mal diese woche fliege ich aus einer runde raus und kann nicht reconnecten","replies":[{"poster":"Schlichzer","date":"2015-08-03T15:02:18.789+0000","up_votes":1,"down_votes":0,"body":"Bei mir ist das auch so dass ich mich nicht Anmelden kann . Was ist da los Riot ?","replies":[]},{"poster":"Lady Bloed","date":"2015-05-14T00:22:10.548+0000","up_votes":1,"down_votes":0,"body":"Ich hab gerade auch einen Fall, dass ich mich nicht einloggen kann.. direkt im Loadingscreen bis auf 50% geladen, dann Spielabsturz und seit über 30 Minuten kann ich nicht reconnecten.. Und da hilft wirklich rein gar nichts, weder Internet neu starten (zumal Internet super läuft), Spiel an anderem Rechner gestartet etc etc...\n\nWill man mal wieder Ranked spielen, dann sowas >.<. Sorry an mein Team, auch wenns keiner lesen wird :/","replies":[]},{"poster":"Dairolol","date":"2015-05-13T21:15:22.723+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nich glaube auch, dass das Problem bei den Servern liegt und wahrscheinlich etwas mit dem neuen Patch zu tun hat. \n\nSeit Patch 5.8 (anfang Mai)  habe ich auch immerwieder DCs, sowohl im Ranked als auch in normalen Games und als folge wird ein wiedereinstieg unmöglich (Ghostgames). Drophacks (musste mich auch erstmal informieren was das ist) denke ich sind nur ein Teil des Problems, da die DCs zum Teil bereits direkt im Auswahlfenster beginnen, ein paar Sekunden ist die Verbindung zum Server getrennt, ein kurzer Wahrnungshinweis wird gegeben und dann geht alles weiter. Nach der Definition fangen Drophacks erst ingame an. \n\nWenn man aus den Spielen rausgeworfen wird kann man für gewöhnlich nach ca. 20mins sich wiedereinwählen (siehe ähnliche Forenposts).\n\nDas Gute ist das diese Games nicht gewertet werden, aber trotzdem ist inzwischen es fast unmöglich ein Spiel zum Abschluss zu bringen.\n\nIch hoffe das wird spätestens dem nächsten Patch/Hotfix wieder besser.","replies":[]},{"poster":"Princess Potter","date":"2015-05-13T21:08:21.314+0000","up_votes":1,"down_votes":0,"body":"Ich hab ein noch schöneres Problem. Mein Mate und ich haben grade ein Spiel verloren, inklusive zerstörtem Nexus (also kein Surrender) und als wir in den Klienten zurück kommen, steht dort wir hätten_ ein laufendes Spiel verlassen_. Immer noch. Seit **20** Minuten. ","replies":[]},{"poster":"High im Seb","date":"2015-05-13T19:16:40.011+0000","up_votes":1,"down_votes":0,"body":"Hey Estorm13 :)\n\nDies liegt wahrscheinlich daran, dass Riot derzeit (mal wieder) Probleme mit ihren Servern haben.\nFalls dies öfter vorkommt schreibe doch mal den Support (https://support.riotgames.com ) an.\n\nLG Sebastian  -  SebPlayZz\n\nFear is the path to the dark side of the Force  -  Master Yoda \n──────────────────────  \n────────┌┴┴┐──────────  \n────▀▀█═╡▀▀╞═█▀▀──────  \n────────└╥╥┘──────────  \n─────────╝╚───────────","replies":[{"poster":"GG Izzie","date":"2015-05-13T19:42:18.486+0000","up_votes":1,"down_votes":0,"body":"Danke habe ich gerade getan. Hoffe mir wird das Game jetzt nicht voll angerechnet da ich dafür überhaupt nichts kann.","replies":[]}]},{"poster":"o0Puschel0o","date":"2015-05-13T19:28:07.868+0000","up_votes":1,"down_votes":0,"body":"Ich komme weder in das Game, noch aus dem Game raus. Bei mir steht nur \"Verbindung wieder herstellen\". Kann mir wer helfen?","replies":[{"poster":"GG Izzie","date":"2015-05-13T19:41:40.288+0000","up_votes":1,"down_votes":0,"body":"warte kurz. hatte ich auch. war nach 20min weg... danach war das game auch in der matchhistory","replies":[]}]},{"poster":"GG Izzie","date":"2015-05-13T19:05:54.693+0000","up_votes":1,"down_votes":0,"body":"jo hatt ich auch eben. in de rpromo, geil geil geil\nreconnecte endlich nach 10min pushen die grad uunseren nexus wuhuuu","replies":[]}]}