{"poster":"Kapparoth","date":"2017-06-04T00:15:46.023+0000","title":"Game randomly freezes","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"I have a mid-tier gaming PC with a good processor and 8GB of VRAM and over the past few weeks, I've been randomly freezing while in game. I haven't let my FPS run uncapped in a while, but the last time I did, it ran at 120FPS but I capped it to 60FPS. When the freeze happens, I will drop from 60FPS to 0FPS for several seconds and the most recent time, it resulted in a crash which subsequently _broke_ my League client.\n\nI'm currently reinstalling now to try to see if that fixes the problem but this issue might have cost me a Ranked game earlier (my ADC somehow managed to win lane 1v2, bless his soul...still lost though, FeelsBadMan) but I'm not entirely sure what to do if the problem persists.\n\nEDIT: After reinstalling I'm still getting this error:\n\"LeagueClient.exe - Bad Image\nC:\\Riot Games\\League of Legends\\libssl-1_1.dll is either not designed to run on Windows or it contains an error. Try installing the program again using the original installation media or contact your system administrator or the software vendor for support. Error status 0xc000012f.\"\n\nI just want to play League of Legends. Someone please help me.","replies":[{"poster":"Broporo","date":"2017-06-04T01:19:24.721+0000","up_votes":1,"down_votes":0,"body":"It's likely that when your game crashed, some of the actual game files themselves were damaged or lost. Typically a repair through the client options should be able to fix up that weird Bad Image error, but if that doesn't work go ahead and update your [**permission guide**](https://support.riotgames.com/hc/en-us/articles/204134104-Setting-up-your-Permissions) as well, since that was fixed this issue in the past for other players. Definitely hit me back up if neither of those are helping though!","replies":[{"poster":"Kapparoth","date":"2017-06-04T01:25:14.006+0000","up_votes":1,"down_votes":0,"body":"I managed to get it working, but thank you for trying to help nonetheless!","replies":[{"poster":"TxClutcH25","date":"2017-08-01T16:31:26.522+0000","up_votes":1,"down_votes":0,"body":"How did you get it working? I'm having the same problem.","replies":[]}]}]}]}