{"poster":"JlNXNXX","date":"2015-10-18T20:28:31.816+0000","title":"Windwos 10 CPU Probleme","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"Ich habe mir vor ca 2 Monaten Windows 10 gehohlt.\r\nIm zweiten Monat habe ich angefangen FPS dropps zu bekommen.\r\nWenn ich die FPS nicht auf 60 cape habe ich ca 120-200 FPS, aber w&auml;hrend den dropps 15-50.\r\n\r\nNach ner Weile hab ich den Grund f&uuml;r die Dropps gefunden, unswar wird meine CPU 100&deg; Warm.\r\nBeim Zocken wird meine cpu von ca 85&deg; bis auf 100&deg; Warm, ab den 100&deg; geht meine CPU von 1,97Ghz auf 0,87Ghz runter.\r\n\r\nDer L&uuml;fter von meinen Laptop sollte gut laufen da die GPU nicht &uuml;ber 75&deg; hinnaus geht.\r\n\r\nDie CPU Auslastung ist eig immer unter 40%\r\n\r\nGPU: GTX 540M\r\nCPU: Intel Core i7 2639QM @ 2.00GHz\r\n\r\n\r\np.s. Austausch der W&auml;rmeleitpaste wurde mir schon vorgeschlagen, aber leider ist das f&uuml;r mich nicht m&ouml;glich.","replies":[{"poster":"OSaftKiller","date":"2015-10-18T20:33:54.500+0000","up_votes":1,"down_votes":0,"body":"> p.s. Austausch der Wärmeleitpaste wurde mir schon vorgeschlagen, aber leider ist das für mich nicht möglich.\n\nJa doch, du traust dich nur nicht, an einem ca. 2 Jahre altem Lappi Hand an zu legen.\n\nWarum du deinen letzten Thread gelöscht hast, erschließt sich mir grad nicht.\n\nDas einzige was dir dann noch bleibt ist, die FPS zu limitieren auf 45 oder 60 z. B. damit deine GPU/CPU nicht mehr so stark ausgelastet werden und dadurch keine so hohen Temperaturen erzeugen. Sehe ich zwar nicht als Lösung aber naja, was anderes bleibt nicht übrig.","replies":[{"poster":"JlNXNXX","date":"2015-10-18T20:45:41.918+0000","up_votes":1,"down_votes":0,"body":"Wurde von nem Riot Mitarbeiter gelöscht^^\nIch solle es noch mal unter Hilfe und Support auf machen.\n\n\"für mich nicht möglich\" ich würde den laptop zu 95% schortten da ich auch handwerklich sehr unbegabt bin :D\n\nFPS sind schon auf 60 gecapt","replies":[{"poster":"OSaftKiller","date":"2015-10-18T20:50:12.089+0000","up_votes":1,"down_votes":0,"body":"Dafür brauchst du kein handwerkliches Geschick, ich bin auch Handwerklich unbegabt und habe ohne Probleme eine Wasserkühlung in meinem Rechner einbauen können.\n\nBrauchst nur einen kleinen Kreuz Schrauben Zieher, eventuell noch einen großen und neue WLP.\n\nHast du den die FPS Probleme mit dem Cooling Pad nicht mehr?","replies":[{"poster":"JlNXNXX","date":"2015-10-18T20:58:14.421+0000","up_votes":1,"down_votes":0,"body":"Eben nicht so häufig^^\n\nPC und Laptops sind immer so ne Sache :D\n https://www.youtube.com/watch?v=tcwEQXm_cwM","replies":[{"poster":"OSaftKiller","date":"2015-10-18T21:17:10.689+0000","up_votes":1,"down_votes":0,"body":"JA nice, hast ja direkt ein passendes Tutorial.^^ Damit sollte das kein Problem mehr sein. Gerät scheint auch recht simpel aufgebaut zu sein, hab da schon schwerere Geräte in Händen gehabt.;)\n\nhttps://i.gyazo.com/d7a4ae41c6ca6a54ddab764574a9ae9e.jpg\n\nDas ist mein Schatz und ich bin eine handwerkliche Katastrophe, du kriegst das hin;)","replies":[]}]}]}]}]},{"poster":"legofreak1","date":"2015-10-18T20:34:00.467+0000","up_votes":1,"down_votes":0,"body":"75° ist für eine Laptopgrafikkarte auch nicht gut. Das ist so die obere Grenze, die du erreichen solltest. Sieh zu, dass du die Kühlung verbesserst, am besten den Laptop aufschrauben, sämtlichen Staub entfernen und wenn irgendwie doch möglich die Wärmeleitpaste erneuern. Ansonsten kannst du dir auch bei Amazon ein Coolingpad für deinen Laptop kaufen, kostet in etwa 20-30€.","replies":[{"poster":"OSaftKiller","date":"2015-10-18T20:36:41.748+0000","up_votes":1,"down_votes":0,"body":"Bringen diese cooling Pads was? Wenn die Hitze nicht schnell genug vom Headspreader der CPU/GPU zum Kühler abgeführt wird, weil die WLP z. B. vertrocknet ist, wird das fürchte ich kaum etwas bringen, weil die Hitze ja am DIE des Chips, bzw. am Headspreader bleibt und nicht gescheit auf den Kühler übertragen wird.","replies":[{"poster":"JlNXNXX","date":"2015-10-18T20:46:25.795+0000","up_votes":1,"down_votes":0,"body":"So ein Pad hab ich, aber es ist Realtiv unbequem damit lol zu spielen.","replies":[]}]}]}]}