{"poster":"Raayy","date":"2016-11-22T00:43:29.601+0000","title":"Club Tag","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hey,\r\n\r\nvor nen paar Wochen gabs ja eine menge Probleme mit den Clubs.\r\nBis heute sind meine Clubs verschwunden, meine Freunde wiederrum sind noch in diesen Club und ich stehe auch noch in diesen Club als Leader drinne. (Keiner hat invite Rechte oder dergleichen)\r\nWie kann ich wieder in diesen Club joinen bzw. Ihn mir anzeigen lassen?\r\nSowohl beim alten, als auch beim neuem Client sehe ich den Club nicht, und ich habe mich mal von einem anderen Club einladen lassen und da geht alles wie gewohnt.\r\n\r\nZu erw&auml;hnen w&auml;re noch wenn wir in einer Lobby f&uuml;r ein Spiel sind hatte ich mal gefragt wie ich im Club angezeigt werde, in den Club werde ich permanent als offline angezeigt.\r\n\r\nKann mir da jemand helfen?","replies":[{"poster":"silibum","date":"2016-11-22T09:39:34.314+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist bekannt und es wird seit einiger Zeit an einer Lösung gearbeitet - Ihr müsst Euch leider noch etwas gedulden. Details sind mir nicht bekannt.","replies":[{"poster":"Anstupsen","date":"2016-11-22T09:46:59.821+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank ^.^ nun habe ich gewissheit\nHabe das problem ja inzwischen länger als ein Monat und mir sowas schon gedacht.\nDa ist einfach verlass auf Riot.","replies":[{"poster":"silibum","date":"2016-11-22T12:11:20.845+0000","up_votes":1,"down_votes":0,"body":"Kleiner (freudiger) Nachtrag für Dich: Wende Dich bitte mit deinem Problem (gib gerne die URL zu diesem Forenbeitrag an) an den Support -> https://support.riotgames.com/hc/de/requests/new","replies":[]}]}]},{"poster":"Anstupsen","date":"2016-11-22T05:31:50.670+0000","up_votes":1,"down_votes":0,"body":"Habe das selbe Problem bin Leader von nem Club in dem ich nicht mehr drin bin.\nBei anderen Mitgliedern bin ich aber noch da drin weswegen mich keiner einladen kann, habe das problem seit ich den alpha client getestet habe.","replies":[]}]}