{"poster":"Fututor2710","date":"2015-12-25T00:17:47.724+0000","title":"Rengar, PLS!!!","subforum":"Melde einen Bug","up_votes":1,"down_votes":2,"body":"Hey liebe Community,\r\n\r\nIch h&auml;tte mal eine Frage bez&uuml;glich Rengar zu countern.\r\nIch hatte n&auml;mlich das Problem, dass ich als adc einfach Garnichts gegen ihn machen konnte. Ich hatte eine Poppy im Team, die ihn sogar mit W aufgehalten hat (aus ult - jump), habe E benutzt (war lucian), habe geflasht, poppy hat ihn weg geschupst, aber er hat mich trotzdem get&ouml;tet, ohne dass ich irgendwas tun k&ouml;nnte!\r\nHabt ihr irgendwelche tipps, was man gegen Rengar tun k&ouml;&ouml;nt aus eigener Ehrfahrung oder so, generell jetzt, nicht nur als adc (da kann man meiner Meinung nach relativ wenig tun, au&szlig;er ga zu bauen und zu beten)","replies":[{"poster":"Travelion","date":"2015-12-29T21:37:33.651+0000","up_votes":1,"down_votes":0,"body":"Zu oneshot:\nIst es bei einer Leblanc, bei einem Zed oder Lhazix etwas anderes? :P\nsteh am besten bei deinen tanks oder supporter, alistar oder lee sin countern rengar weil die ihn instant ccn können\n","replies":[]},{"poster":"FDG DragonSlayer","date":"2015-12-25T11:54:33.564+0000","up_votes":1,"down_votes":0,"body":"Ga kaufen ;) einzige möglichkeit als adc. oder bei der poppy im w drinn stehen xD","replies":[]},{"poster":"Enderized","date":"2015-12-25T00:55:53.091+0000","up_votes":1,"down_votes":0,"body":"Töte es, bevor es dich tötet.\nTrage einen Pinkward bei dir- auch wenn es dich ein Item kostet.\n\nOder alternativ: Nimm Rengar aus dem Spiel, bevor er überhaupt seine ganzen Kills und Items und somit das One-Shot-Potential bekommt.","replies":[]},{"poster":"Fututor2710","date":"2015-12-25T00:18:31.592+0000","up_votes":1,"down_votes":0,"body":"Falscher Betreff, sry {{item:3022}}","replies":[]},{"poster":"BlutSpuren","date":"2015-12-25T00:24:20.002+0000","up_votes":1,"down_votes":1,"body":"Du kannst nichts machen xD rengar ist da um adc/apc weg zubursten(apc's können sich dagegen zhonyas bauen). Kauf dir dornenpanzer und bete das dein team ihn schneller killt als er dich.","replies":[]}]}