{"poster":"Fututor2710","date":"2015-07-07T20:25:45.414+0000","title":"Wie countert man am besten Rengar?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"Ich wollte mal fragen, wie man am besten den &uuml;berall bekannten Captain No-Skill-Rengar am besten countern kann!\r\nUnd jetzt net so was wie &quot;bau dir thornmail oder so&quot;, ich meine was man als ADC, bzw. APC gegen dieses &quot;Unget&uuml;m&quot; machen kann.\r\n\r\nUnd falls ein Riot Mitarbeiter das hier zuf&auml;llig liest:\r\nNERFT {{champion:107}}  ANSTATT{{champion:245}} ZU NERFEN (klar Ekko geht auch aufen sack, aber rengar ,achste nur R-(E)-Q-Q)","replies":[{"poster":"DarkYolord","date":"2015-07-08T14:20:45.536+0000","up_votes":2,"down_votes":0,"body":"Milch und ein Wollknäuel.","replies":[{"poster":"Ηastur","date":"2015-07-08T18:19:09.076+0000","up_votes":1,"down_votes":0,"body":"bester Konter :D","replies":[]}]},{"poster":"XxFeedMeMore","date":"2015-07-08T10:16:42.280+0000","up_votes":1,"down_votes":0,"body":"no skill rengar alein da hört bei mir schon auf xD spiel mal rengar auf top gegen eine riven gegen ryze oder darius und gewinne der champ braucht sehr viel skill und ist dementsprechend richtig gepsielt eine kill maschine und rengar wurde schon genervt rengar ist komplet balanced also spiel ihn selbst und versuch mal im early game irgendwas zu machen und solage du das net hast fresse halten ;)","replies":[]},{"poster":"HyperionCH","date":"2015-07-08T07:10:45.742+0000","up_votes":1,"down_votes":0,"body":"Wie bereits geschrieben ist Vision sehr wichtig. Pinkwards und ausgebaute rote Trinkets helfen sehr. Normale Wards tiefer im Jungle ebenfalls, da Rengar nicht ewig unsichtbar heranschleichen kann.\n\nSieht man Rengar, so ist er erst einmal sehr allergisch auf CC und kann so schnell aus dem Spiel genommen werden. Natürlich könnte Rengar auch Def-Items bauen. Dann wird er jedoch viel weniger Schaden machen.\n\nGegen seinen Burst helfen auch diverse Items und Spells.\nMorganas Blackshield kann den ersten Angriff bereits gut abfangen. Mit Sivir habe ich auch gute Erfahrungen gemacht, wenn Rengar mich angreift. Damit bekomme ich noch zusätzlich Mana zurück. :D\n\nEin ADC kann sich auch QSS kaufen. Klingt jetzt seltsam, weil das Item MR und nicht Armor gibt. Doch gegen die Bola kann man sich so wieder rasch lösen (ein Mage-Sup könnte Mikaels bauen und so den Carry befreien).\nEin APC könnte Zhonyas bauen. Gerade wenn Rengar voll auf AD baut, wird er so Probleme bekommen. Er muss das Ziel ändern und bis er dort die Spell-Rotation durch hat, wird er wohl dahingeschmolzen sein.","replies":[]},{"poster":"Wìcked Clown","date":"2015-07-08T06:49:52.816+0000","up_votes":1,"down_votes":0,"body":"Rengar ist nicht OP und auch kein No-Skill-Champion. So Leid es mir tut. Riven übrigens auch nicht. \nAnsonst hast findest du hier bereits alle wichtigen Tipps. Kann als Support ebenfalls Janna und Thresh empfehlen.","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-07-08T00:31:31.889+0000","up_votes":1,"down_votes":0,"body":"mit Janna. Gegen nen guten Janna Support macht der Junge nichts.","replies":[]},{"poster":"Ηastur","date":"2015-07-07T23:03:39.070+0000","up_votes":1,"down_votes":0,"body":"Generft werden muss der nicht. Is halt n typischer Assassine, wie auch Kata, Ekko oder Akali usw. Die nimmt man am besten aus dem Spiel mit CC und etwas bedachtem Spiel.\n\nNicht allein unterwegs sein (Farm und Buffs sind Rengars bait), für gute Sicht sorgen und wenn nötig das rote Trinked kaufen und ausbauen. Wenn du das Ausrufezeichen siehst, dann kannst du damit sehen wo er ist und ihn exhausten (lassen). Dann wird er nutzlos. Spiel ihn mal selbst. Seit ich das gemacht habe habe ich viel über seine Schwächen gelernt.","replies":[]},{"poster":"SuperplexP","date":"2015-07-07T21:58:33.623+0000","up_votes":1,"down_votes":0,"body":"Rengar counterst du einfach, indem du lernst wie du gegen ihn spielen musst.\n\nDer Hauptgrund, wieso man gegen Rengar, Shaco und Eve verliert ist nämlich einfach, dass die Leute massiv overstayen.\n\nEinfache Faustregel: Deep warden und safe stehen wenn Rengar Ulti hat. Die Abklingzeit beträgt im Early nämlich gefühlt ne Stunde.\nUnd ein ungefeedeter Rengar, der auf Full Dmg geht ist vollkommen nutzlos. (ein gefeeter Rengar auch, wenn  man ihn nämlich einfach focused)","replies":[]},{"poster":"Wekra","date":"2015-07-07T20:34:12.098+0000","up_votes":1,"down_votes":0,"body":"Rengar counterst du am besten mit einem Pinkward in der Lane und dem ausgebauten Trinket im TF. Rengar ist stark, wenn er seine Combo durchbringt, das heißt, wenn er eröffnet und zerreißen kann.\n\nSobald du im TF deine Warnung bekommst, platziert einen oder zwei Pinkwards und ihr seht eine relativ harmlose Mieze genau auf euch zulaufen und könnt ihr in den pelzigen Allerwertesten treten.","replies":[]}]}