{"poster":"PhysicalGraffiti","date":"2017-11-23T16:36:04.844+0000","title":"Rito hace algo","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Esta injugable el servidor, juega cualquiera de cualquier cosa, dos afk por partida... No puede ser que tengamos tremendo server horrible, ojo si decis la palabra que empieza con p, te bannean, pero si salis 0/22 te dan un premio.\n\nUna partida con dos afk, lucian top feedeando, vayne mid, soraka jg... Dejense de joder un poco, o ponganle el nombre a las normal ''partidas troll''","replies":[{"poster":"LightDagger","date":"2017-11-23T16:38:49.142+0000","up_votes":1,"down_votes":1,"body":"Qué tiene que alguien salga 0/22? Justo en esa partida le pudo haber ido mal, entonces el report que le hagas no es suficiente como para sancionarlo.","replies":[{"poster":"Estoy AFK","date":"2017-11-23T16:43:26.239+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LightDagger,realm=LAS,application-id=v7qsfXsE,discussion-id=BlOssKga,comment-id=0001,timestamp=2017-11-23T16:38:49.142+0000)\n>\n> Qué tiene que alguien salga 0/22? Justo en esa partida le pudo haber ido mal, entonces el report que le hagas no es suficiente como para sancionarlo.\n\nde hecho.... es reportable, porque si ese jugador vuelve a salir 0 22... y otra vez 0 22... estamos hablando de un troll y no de mal jugador","replies":[{"poster":"PhysicalGraffiti","date":"2017-11-23T19:08:00.001+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Estoy AFK,realm=LAS,application-id=v7qsfXsE,discussion-id=BlOssKga,comment-id=00010000,timestamp=2017-11-23T16:43:26.239+0000)\n>\n> de hecho.... es reportable, porque si ese jugador vuelve a salir 0 22... y otra vez 0 22... estamos hablando de un troll y no de mal jugador\n\nSi pickeo sona top es muy posible que me vaya 0/20 y no es la cuestion, mucha gente juega normales para practicar y es dificil practicar cuando te cae el top 10/0 y te viola al min 12...\n\nDeberian habilitar en el sistema el Bann de normales a mi juicio por morir mucho, si tenes un KDA de 2/10 es por que algo mal haces, 10 partidas con los bots, educar al server para que jueguen sin tirarse de cabeza...\n\nEl tema es que el trolleo en las es extremo, por ejemplo la otra vez estaba jugando una partida en preseleccion, me sale mid (Mi main) y uno pide mid, se lo doy de onda y pickea vayne mid para usar la skin de proyecto... eso es las...","replies":[]},{"poster":"LightDagger","date":"2017-11-23T16:50:02.369+0000","up_votes":1,"down_votes":0,"body":"Ahí sí, pero deberían reportarlo en todas las partidas, pero hay 2 problemas:\n\n1. Si el team enemigo se beneficia de él, la mayoría de las veces no lo reportan.\n2. La mayoría de las veces se cree que es por una mala partida o mal día, y no se lo reporta.\n3. Si realmente es un troll, te das cuenta entonces ahí sí lo reportas. \n\nComo que no es muy difícil saber quién es troll y quien no, de lo acostumbrados que estamos a tener trolls en las partidas. Como un rakkan que quiso trollearnos una ranked dejándole 3 kills al mid enemigo y aún así rompimos todas las líneas xD","replies":[]}]},{"poster":"Tortuguita","date":"2017-11-23T16:55:47.680+0000","up_votes":1,"down_votes":0,"body":"... Eso es trolleo , no es ir mal brother. Mal es morir 0/11 min 22 otra cosa es en menos de 15 min estar haciendo ratio muerte/minuto como un condenado xD","replies":[]}]},{"poster":"FNC SSumday","date":"2017-11-23T18:42:56.023+0000","up_votes":1,"down_votes":0,"body":"El server va super mal al menos en Uruguay , tengo 75 ms y el personaje se queda congelado , es definitivamente problema de ellos. Por lo otro de las posiciones y jugadores raros es porque es pre-temporada y la gente prueba cosas nuevas , el elo da igual si pierdas o ganas se va a reniciar cuando se acabe la pretemporada","replies":[]},{"poster":"Painstrike","date":"2017-11-23T16:38:48.060+0000","up_votes":1,"down_votes":1,"body":">pero si salis 0/22 te dan un premio.\n\nSeguramente tuvo una mala partida, hay que recompensarlo! Kappa\n\n>Esta injugable el servidor,\n\nYo estoy jugando ahora mismo con 32Ms","replies":[]}]}