{"poster":"Altricad","date":"2015-05-03T02:11:50.105+0000","title":"Why does Gragas have a 73% ban rate? Is LCS influence that strong? o_O","subforum":"Gameplay","up_votes":12,"down_votes":4,"body":"Last time I checked, nidalee was approaching 60% ban rate ( and worthy of it), and now she&#039;s dropped to 14%\r\nHave people forgotten the ICMB spears from fog-of-war or is it &quot;Nuclear barrels&quot; now?","replies":[{"poster":"Nucleophilic atk","date":"2015-05-03T02:14:58.610+0000","up_votes":13,"down_votes":0,"body":"LCS has a big influence in the way that a bunch of 12 year olds will play what they do, even though they have never played the champ before. That is why many, including me, ban champs that are popular in the LCS. I don't want a \"lol tsm played this itz op so im going to try it in ranked\" player.","replies":[{"poster":"Budupops","date":"2015-05-03T17:42:41.272+0000","up_votes":1,"down_votes":1,"body":"same reason i still ban yasuo","replies":[]}]},{"poster":"4nth0l0gy","date":"2015-05-03T03:28:44.359+0000","up_votes":11,"down_votes":0,"body":"He has a very strong kit. High mobility, solid CC, decent damage, great tankiness with the damage reduction of his W...he is strong, but mostly annoying because of how hard he is to lock down and how easy it is for him to engage.","replies":[{"poster":"CubedJustice","date":"2015-05-03T16:47:28.773+0000","up_votes":2,"down_votes":0,"body":"Not to mention, Gragas has one of two teamfight disengages in the game, along with Janna.","replies":[]}]},{"poster":"Stonington","date":"2015-05-03T03:20:29.294+0000","up_votes":9,"down_votes":1,"body":"He's pretty strong. His banrate is justified.","replies":[{"poster":"Phoenix Kotori ","date":"2015-05-03T04:46:35.059+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Sonnington,realm=NA,application-id=3ErqAdtq,discussion-id=Qf3jc0zO,comment-id=0007,timestamp=2015-05-03T03:20:29.294+0000)\n>\n> He's pretty strong. His banrate is justified.\n\nThis jungle gragas is debately strong as if not strong than Sej.","replies":[{"poster":"Icestar1186","date":"2015-05-03T05:13:26.656+0000","up_votes":1,"down_votes":0,"body":"Not stronger, but definitely as strong.","replies":[]}]}]},{"poster":"LankPants","date":"2015-05-03T13:43:14.641+0000","up_votes":2,"down_votes":1,"body":"Personally I don't like banning champs who are far less popular in soloque than in the LCS. I think Grag and Sej are two of the best examples of this right now.\n\nIMO they're not worth banning because your chance of running into a Sej main or a Gragas main who has a high mastery of their champion is extraordinarily low. I'd always prefer to ban out champs who have high playerbases and are strong at the same time.\n\n I feel that the 3 most impact-full bans at the moment are Zed, LB and Kat in no particular order. All of these champions have a high number of mains playing them in soloque and are at least in my opinion far more broken than any other champs.","replies":[{"poster":"Zair Umbras","date":"2015-05-03T16:25:46.016+0000","up_votes":5,"down_votes":0,"body":"Honestly? Gragas doesn't need to be mastered to be used in SoloQ. His entire kit has pretty high bases, a slow, two displacements, damage reduction, passive heal when using an ability every few seconds, and his W does % of health damage, allowing him to be a threat at all times of the game with or without AP.","replies":[]}]},{"poster":"DanLikesBacon","date":"2015-05-03T03:51:55.446+0000","up_votes":5,"down_votes":0,"body":"I dont ban him because of lcs. I ban him cause after playing against him in 2 ranked games it is the most infuriating champ to play against. Even though i beat gragas in both games it was hell to play against.","replies":[]},{"poster":"Epilogue of Life","date":"2015-05-03T21:33:27.787+0000","up_votes":3,"down_votes":0,"body":"Americans don't want to see what they look like in real life come into their games. We play to escape reality, after all.","replies":[{"poster":"Teemo x Katarina","date":"2015-05-10T06:43:57.551+0000","up_votes":1,"down_votes":0,"body":"\"Proud to be an American, just don't like things that look like me!\" True lyrics to the song bro.","replies":[]}]},{"poster":"atomicwit","date":"2015-05-03T20:36:05.168+0000","up_votes":2,"down_votes":0,"body":"Bans are often due to an annoyance factor more than actual strength. Even in Diamond, there are many JGs who perform better than Gragas but have lower ban rates. Gragas is just annoying with his displacement and CC. I'd still say he's top 3 though. \n\nThe same thing happened with Yasuo because his WW and dashing was and still is super annoying. LB is still banned a lot and she's more annoying than she is dominant in terms of winning games. Kalista is banned a ton too because of how hard she is to catch and her ults. having a lot of disruption. However, there are ADCs like Jinx with 4% higher winrate which are banned 10x less. The more predictable a champion's kit, the less they will be banned in general. The highest banned champs tend to have a lot of outplay potential even if they are not objectively strongest.","replies":[]},{"poster":"Remlap1223","date":"2015-05-03T03:07:09.420+0000","up_votes":3,"down_votes":4,"body":"It is the fact that the boards are as inattentive as they are fickle.  All that's got to happen is for Graggy to get played often, and all of the millions of tears shed over Nidalee get forgotten about overnight.  Oh, and the boards are also notoriously wrong about many issues, including, but not limited to...\n\n* {{champion:105}} AP Fizz isn't OP guys, the fact that he instagibbed with his troll pole and Q just means you need to get gud scrub.\n* {{champion:105}} WTF RITO, AD Fizz is the most OP thing ever.  Not even release Xin Zhao and Yorick can compare to this bullshit!  HACKS!\n* {{champion:104}} Graves is just a shit Lucian, he needs to have all of his values doubled in order to compare.\n* {{champion:59}} Riot ffs were you high when you made such an OP champion?  J4 can build straight tanks and insta kill mundo!  HACKS!  ITS THE LCS BIG PLAYZ!\n* {{champion:429}} Bunch of fuqqing noobs complaining about Kalista.  She's super weak yo.  She needs all the buffs!\n* {{champion:64}} We all know that Lee Sin is the most OP thing ever in a video game.  Or should I say FREE WIN!  HAH I'm SO CLEVER!\n* {{champion:127}} Wow, what a shit passive.  Riot, this is the worst passive in the game, even worse than Ashes!\n* {{champion:76}} Another one of Rito's favories!  Her old kit was more balanced, you just made her OP for the LCS BIG PLAYS!\n* {{champion:91}} Wow Riot really?  Talon had tons of counterplay!  You RUINED HIM!\n* {{champion:18}} Wow Riot Raelly?  Tristana had tons of coutnerplay!  YOU RUINED HER!  HER NEW E IS SHIT AND DOESN'T GO WITH HER KIT AT ALL!","replies":[{"poster":"BluePolarizer","date":"2015-05-03T07:13:14.062+0000","up_votes":2,"down_votes":0,"body":"J4 got gutted with that armor removal. Lucian also got gutted while Graves was untouched. Only Nidalee and Lissandra's change in popularity was the result of a meta shift, the rest were because their competitors got gutted or they got hugely buffed.","replies":[{"poster":"CubedJustice","date":"2015-05-03T16:54:28.128+0000","up_votes":2,"down_votes":0,"body":"Nidalee's popularity wasn't a meta shift, though. She got popular when she got some number tweaks and the ability to root jungle creeps.","replies":[{"poster":"BluePolarizer","date":"2015-05-03T16:57:45.153+0000","up_votes":1,"down_votes":0,"body":"i meant her no longer being popular.","replies":[]}]}]},{"poster":"Remlap1223","date":"2015-05-03T22:05:38.778+0000","up_votes":1,"down_votes":0,"body":"Wow, from all the replies I've gotten, it shows how many people on the boards are illiterate as well.  I don't believe in any of the things I listed, I'm highlighting what has been on the front page of the boards because people upvoted them so much.","replies":[]},{"poster":"MalzaharAnyLane","date":"2015-05-03T04:13:37.976+0000","up_votes":1,"down_votes":1,"body":"You've overgeneralized, and the boards aren't a hivemind or regular consensus. That pretty much means you need to wash the sand out of your vagina, regardless of who agrees with you.","replies":[]},{"poster":"Ahurath","date":"2015-05-03T19:54:08.439+0000","up_votes":1,"down_votes":1,"body":"Are you serious? \nBoth Graves and Lucian are still very very good. The Graves nerfs didn't change anything really and he's still very very strong in lane.\n\nLucian is still super good since he's a lanebully but he requiers skill to play.\n\nI do agree with tristana tho, she's still kinda good since her E is very good at sieging but she doesn't do enough damage without her cooldowns.","replies":[]}]},{"poster":"Keithioapc","date":"2015-05-03T02:20:46.087+0000","up_votes":2,"down_votes":0,"body":"His winrate is good (~51.7%) which is good but only 55th overall.  However since he is so extremely popular (people will in fact play him if you don't ban him) he is an okay ban.  I made a post over on Reddit today about bans http://www.reddit.com/r/summonerschool/comments/34o9ib/my_opinion_on_best_bans_for_current_meta/","replies":[]},{"poster":"Rueciel","date":"2015-05-03T08:38:28.494+0000","up_votes":2,"down_votes":1,"body":"I believe gragas to be a fairly strong champion, but in no way do i see him as an overpowered champion.\nThis is especially true in lower elo like silver. Gragas isn't really that scary in the hands of an average player, yet people still ban him just because he was popular in LCS.\nPersonally right now, in solo play, i always lean my bans on what is overpowered right now, (not who everyone wants me to ban)\nAt the moment that means most of the cinderhulk tanks. I find that the tanky champions right now are becoming very unkillable faster than they should be. Champions who scale on health are especially overpowered right now, volibear especially. (Im really suprised i haven't seen shen jungle come back yet.) \n\nIts always been this way though. A few years ago, people looked at skarner like he was garbage, dont touch that guy, he is useless.\nThen he got played in the LCS and literally even though he had no buffs made, everyone started banning him. \"Skarner is OP\".","replies":[{"poster":"BrutalCabbage","date":"2015-05-03T13:14:07.269+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Rueciel,realm=NA,application-id=3ErqAdtq,discussion-id=Qf3jc0zO,comment-id=0011,timestamp=2015-05-03T08:38:28.494+0000)\n>\n> I believe gragas to be a fairly strong champion, but in no way do i see him as an overpowered champion.\n> This is especially true in lower elo like silver. Gragas isn't really that scary in the hands of an average player, yet people still ban him just because he was popular in LCS.\n> Personally right now, in solo play, i always lean my bans on what is overpowered right now, (not who everyone wants me to ban)\n> At the moment that means most of the cinderhulk tanks. I find that the tanky champions right now are becoming very unkillable faster than they should be. Champions who scale on health are especially overpowered right now, volibear especially. (Im really suprised i haven't seen shen jungle come back yet.) \n> \n> Its always been this way though. A few years ago, people looked at skarner like he was garbage, dont touch that guy, he is useless.\n> Then he got played in the LCS and literally even though he had no buffs made, everyone started banning him. \"Skarner is OP\".\n\nHe's actually almost undeniably overpowered (and his banrate is not only due to LCS), but it's most likely due to Cinderhulk being broken than the champion itself (he also got buffed along with the release of Cinderhulk, which made the whole even more OP). He is also actually quite easy to use, and even if he wasn't he would still be overpowered, because low elo is not to be considered in balance matters. If stuff were to be balanced around low elo, it would seriously mess up competitive and high elo gameplay, which is generally not good, since lower elo players should strive to improve as much as they can, while the game should not evolve around them being bad. Each player is also supposed to naturally improve over time. Lastly, it is extremely hard to balance around low elo because of the huge variance in skill level down there. While in higher elo players are usually \"the best\" and can use each of their favorite champions at near-maximum potential, while low elo is much more differentiated.\n\nAlso, I really can't see how Voli is overpowered. Sure, he has health scaling and that improves A LITTLE (not much actually, especially given the fact Voli was really weak pre Cinderhulk already), but his array of disables is actually quite limited. What he offers that other tanks don't is more damage, which is not really necessary since pretty much every tank can do a crapload of damage nowadays thanks to Cinderhulk. This means highly disruptive thanks like Sej, Grag and Zac are great because while their damage and tankiness were OK before, now they get MORE tankiness and MORE damage for a very low price. Other tanks like Shyv and Hecarims who go tankier lack CC (well, Hec has that but definitely not as much), but are awesome early duelists and do A LOT of damage overall. Voli stands in the middle, he's nothing special. He lacks the damage to be as good as the toplane tanks, he lacks the CC to be as good as the jungle tanks.\n\nAbout Skarner, you're not quite right. He was mostly a SoloQ pick all along and was outclassed by the early aggro junglers in the LCS. He was picked whenever the others were banned but was really not that popular in competitive play at all. In SoloQ he was a monster though, and it was due to his second rework, which was indeed a much needed buff. He got some slight nerfs the patch afterwards and he was never heard of again. My feeling is that his lack of mobility and good damage make him good only when his numbers are broken. His CC is outclassed I guess.","replies":[{"poster":"Rueciel","date":"2015-05-03T14:22:02.192+0000","up_votes":2,"down_votes":2,"body":"If you think volibears damage is lower than other tanks, then you obviously are not a volibear player. \nIn nearly every single game ive played this week with a volibear in it (And there has been quite a few, at least 10), the volibear has been the biggest problem on the enemy team to deal with. In my last game just 30 minutes ago even, the volibear on my team went 15/1.\n\nAs for skarner, im talking about two seasons ago. He was played in the LCS (successfully so) and everyone went bonkers the next few weeks over skarner. Im talking original skarner, pre-rework.\nAs skarner stands right now, he definitely isnt one of the STRONGEST junglers in the game, but he is far from useless.\nA few days ago i played skarner and i had the most damage on my team. I was full tank skarner, the only offensive item i had was an iceborn gauntlet. And i wasn't fed either. Considering that he can put out so much easy damage in a teamfight, peel the shit out of people, and supress a single enemy, i would say he can easily be put to good use in the right team comp.\n\nI really dont get why everyone is all worked up over gragas right now. Ive played against quite a few recently as well and i can't think of any that really felt too overpowered. His ult is extremely easy to mess up, his barrels arent that hard to dodge. Especially jungle gragas, he doesnt do nearly as much damage as lane gragas since they go cinderhulk, they wont have enough ap to blow anyone up, and he just becomes some tanky fatass that can slow you and throw you around with his ult. Theres plenty of people who can do the same stuff but better.","replies":[{"poster":"CubedJustice","date":"2015-05-03T17:00:55.834+0000","up_votes":1,"down_votes":0,"body":"He never said Voli's damage was lower than other tanks. But he doesn't do anything else, really.","replies":[]}]}]}]},{"poster":"Rinky Dinky","date":"2015-05-03T23:10:12.051+0000","up_votes":1,"down_votes":0,"body":"Meta thumpers.jpg","replies":[]},{"poster":"GuiltyGecko","date":"2015-05-03T21:04:37.804+0000","up_votes":1,"down_votes":0,"body":"A large portion of the player base are slaves to LCS. Example:\nNo one gave two fucks about Cho until Bjergsen played him for one game. \n\nAfterward? His ban and pick rate went up.\n\nYes I'm salty because Cho is my second favorite champion and I hate seeing him banned -_-","replies":[]},{"poster":"Ahurath","date":"2015-05-03T19:48:39.457+0000","up_votes":1,"down_votes":0,"body":"I don't really mind LCS to be honest just what I've experienced is that a gragas either does two things.\nCarry the game and win every lane.\nPlay ok and sitll do good stuff for the team.\n\nI've never seen a gragas do poorly since the jungle changes and that's a big warning sign for me. If a champion dosn't have a downside there isn't a reason not to pick him. He can peel, engage, gank early, is very very tanky, does decent damage and very sticky.","replies":[]},{"poster":"Kingsgrave","date":"2015-05-03T18:03:41.426+0000","up_votes":1,"down_votes":0,"body":"Gragas is being played for the same reasons Sejuani is. Hes just not nearly as good as her in Solo Queue.","replies":[]},{"poster":"Nebuul","date":"2015-05-03T17:57:41.948+0000","up_votes":1,"down_votes":0,"body":"nidalee banrate was reduced because her jungle clear time was gutted.   What made her dangerous was that she could full-clear faster than the enemy jungler,  then she could gank while out-leveling her counterpart","replies":[]},{"poster":"AtheosisX","date":"2015-05-03T03:13:34.258+0000","up_votes":1,"down_votes":0,"body":"A good Gragas is really scary right now.  His ganks are nuts and his damage is quite high even when going full tank.  I'm assuming LCS is the main influence in his high ban rate though.","replies":[{"poster":"CubedJustice","date":"2015-05-03T17:11:42.597+0000","up_votes":1,"down_votes":0,"body":"His ganks are silly in my opinion for one reason. His E has such a low cooldown that even if you don't have enough damage to kill the enemy laner in the first stun, you can hit them again in a few seconds to finish them off.","replies":[]}]},{"poster":"Solidair3","date":"2015-05-03T12:59:22.714+0000","up_votes":1,"down_votes":0,"body":"Yes and no to lcs influence. Before he was picked up in the LCS he wasn't played very much, and thus there was no reason to ban him.\n\nNow everyone is playing him and so he is a threat which can be banned. Whether or not he is truly deserving of such a ban rate remains to be seen, but I personally think he is a bit too burst even when building as a tank. We'll see what happens and if he becomes the new sejuani.","replies":[]},{"poster":"AHeroNamedHawke","date":"2015-05-03T06:31:02.280+0000","up_votes":1,"down_votes":0,"body":"{{item:3717}}","replies":[]},{"poster":"Astropanda","date":"2015-05-03T06:26:04.169+0000","up_votes":1,"down_votes":0,"body":"I haven't been sure who to ban in a long time to I just go with the flow.","replies":[]},{"poster":"BluePolarizer","date":"2015-05-03T04:51:32.918+0000","up_votes":1,"down_votes":0,"body":"Gragas is actually stronger than Sej, since his ult at its best is a Blitz grab on both the enemy ADC and support, and at worse splits the enemy team for you to pick off. He also does way more damage than Sej, is far burstier, and is just as mobile.\n\nI have never banned Nidalee before because if the enemy picks Nid, I just pick a champ that can chase her down and vaporize her. If she doesn't snowball she falls off pretty hard.","replies":[]},{"poster":"Kikirino","date":"2015-05-03T04:07:51.942+0000","up_votes":1,"down_votes":0,"body":"If something is played in the LCS and has a decent winrate then it generally means the champion is in a good spot. If you have a decent concept of how to play that champion it only makes sense to start playing it yourself if you want to climb. \n\nIt is really unlikely that someone would have a 50%+ ban rate just because someone picked it in the LCS.","replies":[]},{"poster":"MrBuffington","date":"2015-05-03T03:38:07.898+0000","up_votes":1,"down_votes":0,"body":"Nidalee's fallen out of favor because of the tank meta. Gragas doesn't even build AP in jungle, he's just like a Sejuani substitute because Sejuani has a 90% ban rate in plat+ http://champion.gg/statistics/#?sortBy=general.banRate&order=descend","replies":[]},{"poster":"Buttigieg 2020","date":"2015-05-03T03:21:14.393+0000","up_votes":1,"down_votes":0,"body":"Sadly since gragas jungle is permanently banned, I can't play mid gragas :(","replies":[]},{"poster":"ChargeItDownMid","date":"2015-05-03T03:09:30.810+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"kcStranger","date":"2015-05-03T03:15:00.918+0000","up_votes":1,"down_votes":0,"body":"Nidalee also got her health nerfed.","replies":[]}]},{"poster":"kcStranger","date":"2015-05-03T03:19:42.824+0000","up_votes":1,"down_votes":1,"body":"I think a big part of the problem is that you don't know what your opponents play in solo queue, so bans become much less strategic. The only good strategies then are:\n\n1. Ban the most powerful champs that your team doesn't play. (In practice, this often is just \"ban the most powerful champs,\" but people really should learn what their team plays before randomly banning things.)\n\n2. Ban counters to champions people on your team (usually you) like.\n\nPersonally, I wouldn't prefer to ban Gragas under most circumstances since I'd rather just ban the champs that actually have the highest win rates in solo queue (so long as my team doesn't play them). Champions like Amumu, Malzahar, and Heimerdinger are actually bigger threats from that perspective.","replies":[]},{"poster":"Narasimha","date":"2015-05-03T03:05:28.582+0000","up_votes":1,"down_votes":1,"body":"Don't ever underestimate the influence that pro players have on most people. Why do you think tele/smite became a thing?\n\nThat being said, I don't know why Gragas is on the rise, but Nida's fall was expected. She can't compete in this tanky meta anymore. Her spears are useless with a cougar follow up, and thats death for her at the moment.","replies":[]},{"poster":"TenSlashTen","date":"2015-05-03T04:45:27.997+0000","up_votes":1,"down_votes":2,"body":"I dont watch any pro games besides worlds.\n\nHas nothing to do with my hate for that stupid kit that has a true damage ability with almost zero down time with max cdr.\nFucking dumb champion.\nHe's like the second or best AP tank right now because of that stupid percentage damage auto attack with almost no CD..like wtf.\n\nSeriously fuck him.\nHe was annoying pre rework and he's still annoying now.\n\n\nHis kit is just too easy to fuck your team over with its just a pain in my ass.\n\n","replies":[]}]}