{"poster":"RyzeHokage","date":"2019-01-26T22:01:40.944+0000","title":"revert the ranked changes for a rank in each role","subforum":"Gameplay","up_votes":25,"down_votes":12,"body":"its terrible it sounds good but the way you went about it is god awful half the champions you can top can go mid lane like ryze so i could be a diamond top laner playing the same champion and in mid lane it will say your plat 3 and on top of that you have to do a ranked provisional on each role to move up a rank the splash is trash you get 30lp splashes 3 lp and your skill carries over into other roles","replies":[{"poster":"MasterDClone","date":"2019-01-27T05:18:43.845+0000","up_votes":10,"down_votes":8,"body":"i love being abled to play other champions in ranked now without it killing my main rank, this change has been so enjoyable","replies":[{"poster":"TeCoolMage","date":"2019-01-27T06:39:02.428+0000","up_votes":6,"down_votes":1,"body":"How dare you feel differently from us *get him boys*","replies":[]},{"poster":"ﬂoo","date":"2019-01-27T09:57:25.027+0000","up_votes":4,"down_votes":3,"body":"Play normals then","replies":[{"poster":"MasterDClone","date":"2019-01-27T22:14:13.686+0000","up_votes":4,"down_votes":0,"body":"what a stupid thing to say lol, by that logic maybe the op should just play normal's as well if he doesn't like the new system","replies":[{"poster":"ﬂoo","date":"2019-01-27T23:08:15.272+0000","up_votes":2,"down_votes":4,"body":"No\nChamps you're not familiar with and wanna learn have no place in ranked. It's competetive, not your practice mode.\nIf you enjoy playing multiple lanes/champs on different ranks then I'm glad you like it, just not ones that are new to you.","replies":[{"poster":"Ifneth","date":"2019-01-28T01:28:35.365+0000","up_votes":1,"down_votes":0,"body":"I practiced Taliyah for half an hour in Practice Tool in Bronze III, went straight to Ranked, won my first game and was Silver by the end of the season.","replies":[{"poster":"ﬂoo","date":"2019-01-28T07:50:15.150+0000","up_votes":1,"down_votes":2,"body":"Congrats, I played a normal game with Cait after not playing her for a while, won and went on for a 8 win streak in ranked.\nOfc you can do well with champs you don't play as much. But such examples don't really matter, compared to the majority. If you're not familiar with your champ, you're effectively putting your team at a disadvantage.","replies":[{"poster":"Ifneth","date":"2019-01-28T14:01:06.835+0000","up_votes":2,"down_votes":0,"body":"Every champ you play in Ranked, you play for the first time in Ranked at some point.  Whether that’s after a bunch of Normal games or not, it’s true, and requiring players to have Mastery etc. would just slow down the meta.","replies":[{"poster":"ﬂoo","date":"2019-01-28T19:06:30.556+0000","up_votes":1,"down_votes":3,"body":"I'm not talking about first time playing ranked. I'm talking about playing ranked and picking a champion you haven't played before, regardless of ranked or normal. You are putting your team at a disadvantage because you don't have any experience with them, period.","replies":[{"poster":"Ifneth","date":"2019-01-29T06:52:29.556+0000","up_votes":2,"down_votes":0,"body":"I’d never played Taliyah outside the Practice Tool and won the game.","replies":[{"poster":"ﬂoo","date":"2019-01-29T11:04:01.519+0000","up_votes":1,"down_votes":2,"body":"Again, one example out of many is no evidence.","replies":[{"poster":"Ifneth","date":"2019-01-29T15:28:26.042+0000","up_votes":1,"down_votes":0,"body":"You made a categorical statement.  Also, at higher elo, the meta shift often requires players to shift champs suddenly.  If Zilean becomes meta, then, well, it’s time for Zilean, boys!","replies":[{"poster":"ﬂoo","date":"2019-01-29T19:35:56.846+0000","up_votes":1,"down_votes":0,"body":"Alright then, explain to me why most new released champs or vgu's have a low winrate in the first days after their release. Because people don't know how to play them right away. If you bring them into ranked, you put your team at a disadvantage.\nMeta is also something different again. Stronger champs tend to have it easier to win because of whatever reasons. In this case I can see that no knowledge of the champ might not have that much of an influence. However, metaslaves also lose with champs they think they can easily win with, just because they're strong, but end up losing and dragging down the overall winrate.","replies":[{"poster":"Ifneth","date":"2019-01-29T20:02:36.148+0000","up_votes":1,"down_votes":0,"body":"Plenty of people just try them out, too.  Not everyone in Ranked, if you can believe it, is someone who’s playing every game for the win.  That means sitting down, looking back on past games, recognizing mistakes, watching pro streams, and reading about how to improve.  Some people just want to play a competitive game.","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Sheemo on e621","date":"2019-01-27T06:31:27.382+0000","up_votes":2,"down_votes":2,"body":"i hope you're being sarcastic","replies":[{"poster":"MasterDClone","date":"2019-01-27T22:11:10.324+0000","up_votes":1,"down_votes":0,"body":"why would i be being sarcastic lol","replies":[]}]}]},{"poster":"haaaaaaalp","date":"2019-01-27T09:58:51.389+0000","up_votes":4,"down_votes":0,"body":"This is so much better than last season when you could have random autofill games count fully against your main mmr.","replies":[]},{"poster":"Glaricion","date":"2019-01-27T06:35:21.947+0000","up_votes":4,"down_votes":0,"body":"Other roles rubberband to your primary role and should be factored into your placements as well.\n\nPlaying mid and top is also very different, so sharing a champion pool only gives you so many gains.\n\nThe ranked change is in beta, so I would change the title/desire from 'just get rid of the system entirely' to 'increase initial splash' (as they should change on win/loss sprees and if the system thinks you might be soft-inting in your off-roles).","replies":[{"poster":"RyzeHokage","date":"2019-01-27T18:49:12.692+0000","up_votes":2,"down_votes":1,"body":"I would feel better if the splash was increased i think it can be a good system the way they went about it i feel is terrible. mid and top are very similar roles if you can play mid you can play top pretty well and same goes for the bot lane i personally think that top and mid should be combined roles and bot and support should as well but with jung i think it should splash quite a bit of lp into all of the other roles since they have to observe all of their lanes","replies":[]}]},{"poster":"YOU SO BAD","date":"2019-01-27T05:25:15.903+0000","up_votes":6,"down_votes":2,"body":"I said this when they first announced it. It basically amounts to every game your not playing on you main role as totally pointless and a waste of time. Which is going to lead to people just throwing games in their off roles cuz they dont care.\n\nAn that doesnt even go into the fact that most people barely have enough time to rank up an account and now you have to rank up by role meaning if you dont get your main your wasting your time and it will actually take even MORE games to rank up. \n\nMark my words at the end of this season people will be on average 2 tiers lower then last year simply because of these issues and not having time to play more games. ","replies":[{"poster":"Vyntrius","date":"2019-01-27T15:56:08.841+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=YOU SO BAD,realm=NA,application-id=3ErqAdtq,discussion-id=WtWxOUkE,comment-id=0002,timestamp=2019-01-27T05:25:15.903+0000)\n> Mark my words at the end of this season people will be on average 2 tiers lower then last year simply because of these issues and not having time to play more games.\n\nDo you mean 2 divisions lower? Because if you actually believe people will be 2 tiers lower on average then that is just silly. Even if you go 0-8 in your placement matches, you probably won't be 2 tiers lower than where you were before. I was D2 and my provisional rank was P2 after my first placement game.","replies":[{"poster":"YOU SO BAD","date":"2019-01-28T05:04:10.312+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Vyniadus,realm=NA,application-id=3ErqAdtq,discussion-id=WtWxOUkE,comment-id=00020000,timestamp=2019-01-27T15:56:08.841+0000)\n>\n> Do you mean 2 divisions lower? Because if you actually believe people will be 2 tiers lower on average then that is just silly. Even if you go 0-8 in your placement matches, you probably won&#x27;t be 2 tiers lower than where you were before. I was D2 and my provisional rank was P2 after my first placement game.\n\nYeah i ment division not tier lol my bad.  2 tiers is overkill","replies":[]}]}]},{"poster":"Extalia","date":"2019-01-27T01:47:30.668+0000","up_votes":8,"down_votes":4,"body":"This. Seriously screw this nice position rank bs. It's such a fking waste of a game when you get filled your second role. You get no progress and the stupid splash lp gain is abysmal. On some days I don't wanna go my main role but I'm forced to now since I won't make any progress if I wanna play the other role.","replies":[]},{"poster":"Imbetterthanmoe","date":"2019-01-27T20:45:30.212+0000","up_votes":2,"down_votes":0,"body":"Easy fix: Allow people to manually disable it. It wont break the game since theres the people who like getting matched with their skill while theres people who just want to be one rank. If there are any downfalls to being able to manually disable it please inform me.\n\nPlus if you swap lanes too much it disables the skill rating but you still have to rank up 5 roles. Instead of this just allow people to disable the skill rating and the rank roles ","replies":[]},{"poster":"Coolbuddman730","date":"2019-01-27T20:37:59.450+0000","up_votes":1,"down_votes":0,"body":"I could be a gold 2 top lane meaning that I have gold 2 mechanics and knowledge of the champions in other lanes and then go into my mid lane where I am a Silver 3 and go destroy kids that are silver 3 in the other lanes? it just doesn't make any sense.","replies":[{"poster":"ElvlS","date":"2019-03-24T00:14:11.505+0000","up_votes":1,"down_votes":0,"body":"that means you're better than silver 3 in mid lane you fuck. so yes thats how it works...","replies":[]}]},{"poster":"Kairoptra","date":"2019-01-27T18:40:55.716+0000","up_votes":1,"down_votes":0,"body":"It’s only been a couple days. Wait a while before you make your final judgements. I’d say about a month and a half, maybe two. If you’ve got critiques, feel free to share them. However, you only have your first impression, so you are in no position to be calling for a revert and will not be for quite some time.","replies":[]}]}