{"poster":"RB Zubat","date":"2015-12-26T03:20:36.356+0000","title":"Diamond Top mit viel Teamerfahrung sucht Team","subforum":"Clans & Teams","up_votes":2,"down_votes":1,"body":"Gr&uuml;&szlig;e Beschw&ouml;rer,\nnachdem ich mich nun nach meiner 3-monatigen Pause wieder vern&uuml;nftig eingespielt habe, bin ich nun auf der Suche nach einem Ranked Team, bei dem ich die Toplane &uuml;bernehmen k&ouml;nnte. Derzeit befinde ich mich in Diamant 5, konnte im Laufe der Season 5, allerdings auch schon eine Peak League von Diamant 3 erreichen, zudem verf&uuml;ge ich &uuml;ber ausreichend Teamerfahrung, was genau ihr von mir erwarten k&ouml;nnt und was ich von euch erwarte  m&ouml;chte ich im folgenden etwas n&auml;her ausf&uuml;hren.\n\nMein Name ist Max, ich bin 20 Jahre alt und studiere Informatik, dh., dass auch unter der Woche an den Abenden  gen&uuml;gend Platz zum Zocken ist. Mit League of Legends habe ich in Season 3 angefangen und endete in meiner ersten Season in Bronze 1, in Season 4 ging es dann bis Platin 2, in Season 5 bis Diamond 3. \nNachdem es mit meinem alten Team (Teamrankedelo: Diamant 5 zu diesem Zeitpunkt), allerdings vorbei ging, folgte eine l&auml;ngere Pause von 3 Monaten, die mich nicht nur was die LP, sondern auch die Mechanics angeht nat&uuml;rlich etwas zur&uuml;ckgeworfen hat.\n\nWas bringe ich mit:\n- Teamranked Erfahrung &uuml;ber 2 Seasons (h&ouml;chste Liga: Diamant 5), mehrere Cups (Hardknocks Cup, Tryforce, Tournois Turniere gewonnen etc.)\n-  kein Mainshotcaller, aber im allgemeinen recht kommunikativ (TP Timings, Warding, Targetansage in Teamfights,...)\n- in der Regel ausreichender Championpool, in den letzten Metas konnte ich eigentlich jeden Champ mit Ausnahme von Gnar auf einem vern&uuml;nftigen Level  \n- absolut kein &quot;Teamhopper&quot;\n\n\nWas suche ich:\n- SoloQ Elo egal, bei einem bestehenden Team, dieses sollte sich dann aber im Teamranked zumindest im hohen Platin befinden, ansonsten High Plat+\n- Serious Ranked Team \n- das Team sollte auch wirklich ein &quot;Team sein&quot;, oder werden wollen. Finde es unangenehm, wenn man sich nur zu den Trainingszeiten trifft und                 ansonsten nix zusammen macht, deswegen auch gerne Aktivit&auml;ten au&szlig;erhalb des Teamrankeds gesehen. Au&szlig;erdem habe ich auch keine Lust auf st&auml;ndige Rosterswaps/Benches etc. \n- Turnierteilnahmen\n- mindestens 3 mal w&ouml;chentlich Training (und das auch zuverl&auml;ssig)\n\nSollte euch mein Post angesprochen haben bin ich gerne f&uuml;r Tryouts bereit. Addet mich dazu einfach Ingame: HKn Aileri\nGr&uuml;&szlig;e\nAileri","replies":[{"poster":"Lynnette","date":"2015-12-26T15:17:36.357+0000","up_votes":1,"down_votes":0,"body":"Wenn du willst und bock hast kannst ja mal hier reinschaun http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/EUfOEqkN-team-inpanic-esports-black-sucht-mitglieder-ab-platin-5 . Wenn dir das nicht zu low ist, würden wir uns freuen mit dir ein probegame machen zu können.","replies":[]},{"poster":"EOU Heaventime","date":"2015-12-26T15:09:38.221+0000","up_votes":1,"down_votes":0,"body":"Deine Freundesliste ist voll, wäre nett wenn du mich ingame adden könntest, EOU Heaventime","replies":[]}]}