{"poster":"pookíe","date":"2016-12-11T06:21:46.682+0000","title":"Disconnected","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"I was in player selection and we were going to the loading screen but as soon as i reached the loading screen a messaged popped up I don't remember what it said but I clicked ok and then it took my back to the league of legends page where it said reconnect i clicked reconnect and it did the same thing so then I exited out the client and restarted my pc. Then I launched the client back up and clicked reconnect then it actually put me ingame and now i have 5 low priorty queue's can you please remove them there like 20 minutes each and it's not my fault the client is buggy.","replies":[{"poster":"Targons Blade","date":"2016-12-12T05:11:01.673+0000","up_votes":1,"down_votes":0,"body":"Do you think the message you saw was a network connection error? If so, this may be the issue listed in the client (next to the Home button) and on the [**Service Status Page**](http://status.leagueoflegends.com/#na). Regardless what the issue was, a 5-game low-priority queue is the result of a *trend of disconnections* and would not have been for a single disconnection such as this. We are unable to modify or remove these penalties, as it ensures the integrity of the game is upheld and that abuse of the system cannot occur.\n\nLet me know if your issue was different.","replies":[{"poster":"hypnoso","date":"2016-12-12T21:05:44.936+0000","up_votes":1,"down_votes":0,"body":"Hey Targons Blade,\n\nSimiliarly I have been having this problem, but I was already fulfilling the 5-game low priority queue, which I had rightfully deserved from not going into a previous game a couple of days before (something personal came up and I had to go, it happens). However, this problem then happened while I just did about my third wait out for the 5 games, and now I have a whole new 5 games to wait out. With the times I was going into game you can see I was doing this on purpose as there's literally no reason I would load into a game, just to disconnect and remake, to wait the time and go into another game just to remake, especially as it would count as a lost in my placements series, which they did. Is there anything that can be done about this?\n\nOpen to any feedback, I more so just really want a response, thanks.","replies":[]}]},{"poster":"WildCrow","date":"2016-12-11T20:20:33.805+0000","up_votes":1,"down_votes":0,"body":"It's not you they changed something this patch, it's horrible, it happens to me every 1-2 games, i click cancel then reconnect and game works fine, but doing this every time .....","replies":[]}]}