{"poster":"th3 gostex","date":"2016-12-22T12:25:58.528+0000","title":"come manadre un ticket per segnalare qualcuno","subforum":"Discussioni generali","embed":{"description":"Ogni partita è una storia a se stante; dai un'ochiata alla nuova cronologia delle partite di League of Legends per saperne di più e per capire come funziona.","url":"http://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/2985020211/52330","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":1,"down_votes":4,"body":"puntualmente mi trovo queste persone in team normal/ranked e la riot non fa niente........ io posso solo segnalarle per&ograve; mi sono roto le scattole(per non dire parole volgari)di perdere tempo e giocare con questi persone (animali)......volevo sapere com mandare un ticket alla riot con la partita.","replies":[{"poster":"BeardSergio","date":"2016-12-22T13:24:56.668+0000","up_votes":3,"down_votes":1,"body":"Come già spiegato più volte il supporto non ha il compito di gestire le segnalazioni di giocatori scorretti o comportamenti reportabili tramite il sistema già presente.\nIl sistema di report a fine partite è più che sufficiente e più dettagli ci metti, meglio sarà verificabile la tua segnalazione.","replies":[{"poster":"th3 gostex","date":"2016-12-22T14:18:31.040+0000","up_votes":1,"down_votes":0,"body":"quindi se a fine game scrivo un poema lo prendono piò in considerazione?\ncomunque grazie della risposta","replies":[{"poster":"BeardSergio","date":"2016-12-22T14:21:58.803+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=th3 gostex,realm=EUW,application-id=MJVj50Jw,discussion-id=7gm7NGJW,comment-id=00000000,timestamp=2016-12-22T14:18:31.040+0000)\n>\n> quindi se a fine game scrivo un poema lo prendono piò in considerazione?\n> comunque grazie della risposta\n\nViene preso in considerazione come qualsiasi report ma più dettagli dai meglio potranno essere fatte le verifiche\nesempio : un mio compagno di squadra va afk dal minuto 5 al 25? lo reporto e scrivo da che minuto a che minuto è stato assente in modo che venga considerato e venga verificato il game","replies":[]}]}]},{"poster":"Dr LouD","date":"2016-12-22T16:00:21.114+0000","up_votes":1,"down_votes":0,"body":"Un consiglio\nNon sprecare report su chi effettivamente non lo merita così tanto altrimenti le tue segnalazioni perdono di valore\n\nIo reporto solo chi realmente merita di essere reportato ed ha dimostrato in game chiari atteggiamenti tossici/troll\n\nDi solito su 10 report 1 viene punito grazie alla mia segnalazione, quindi il sistema di punizione imho funziona abbastanza bene, non c'è bisogno di mandare screen al support e altri sbattimenti del genere","replies":[]}]}