{"poster":"sers","date":"2016-08-31T14:31:07.240+0000","title":"Suche einen Mitspieler als \"zockkumpel\" b3-S1","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Guten Tag Leute \r\n\r\nich such einen Mitspieler der ziemlich cool ist und nicht flamed wenn man einmal schei&szlig;e spielt gibts immer mal schlechtes spiel...\r\n\r\nich suche einen der &uuml;ber 18 ist und eine lustige art bzw offen ist weil ich eigentlich einer bin der viel redet wenn das spiel nicht gut l&auml;uft :D\r\n\r\nEiner der mir hilft aus den schei&szlig; Bronze raus zu kommen.. die Spieler sind manchmal so beschissen ... feeder oder einfach nur dann hartes geflame wenn man wirklich nur ein fehler macht und mal schei&szlig;e gankd.. Da hat man echt keine Lust zu spielen wenn dann Kiddis gleich beleidigend werden oder voll das rum flamen wegen ein Fehler..\r\n\r\nIch versteh wenn jemand rumflamed und ich 0/4 hab... \r\n\r\n(&Uuml;ber Gegner oder Mitspieler beschweren und lustig dr&uuml;ber labern keine Ahnung)\r\n\r\nMeine Lanes sind eigentlich: Jede Lane :D\r\n\r\nMain Char:\r\n\r\nQuinn (Jungle, Top, ADC) in der reihenfolge ;)\r\nYasou(Top!! mid verkack ich echt hart oft probiert und oft verkackt)\r\nDianna(Jungle nur Jungle und alle weg killen)\r\nEkko(Mid)\r\nAkali(Mid)\r\n\r\nja das sind meine mains aber ich kann noch andere spielen so ist es nicht\r\n\r\nSuche auch einen mit den man auch &uuml;ber Handy (Whatsapp) schreiben kann zwecks zocken wann genau und auch mal so wie es geht.\r\n\r\nAlso mehr eine Art Kumpel zum Zocken, Da leide Meine Kumpels in den Alter nicht spielen :D\r\n\r\nIch bin 23 bin vor 3 Wochen Papa geworden und eig oft gut drauf und mit mir kann man schon gut spielen \r\n\r\naber wer testen will schreibt mich an =)","replies":[{"poster":"TrustIMe","date":"2016-09-01T12:42:22.607+0000","up_votes":1,"down_votes":0,"body":"Hab dich mal geaddet :)","replies":[]},{"poster":"AndreyDelany","date":"2016-08-31T16:26:26.627+0000","up_votes":1,"down_votes":0,"body":"Klar warum nicht? Bin zurzeit B2, wenn de bock hast. IGN: AndreyDelany","replies":[]}]}