{"poster":"CristianLoco15","date":"2016-01-09T06:54:49.722+0000","title":"sona puede ir jg","subforum":"Guias y consejos","up_votes":2,"down_votes":2,"body":"{{champion:37}}  puede ir jg y si  va jg cual  opgeto seria","replies":[{"poster":"SonaGate","date":"2016-01-09T06:57:57.731+0000","up_votes":2,"down_votes":1,"body":"Si puede ir JG, pero es muy blandita tenes que saberla usar. Y luego los objetos para jungla no te puedo ayudar, lo siento.","replies":[{"poster":"CristianLoco15","date":"2016-01-09T07:15:34.461+0000","up_votes":1,"down_votes":0,"body":"gracias","replies":[]}]},{"poster":"ALEXKOND","date":"2016-01-09T15:26:29.983+0000","up_votes":1,"down_votes":0,"body":"Poder puede. Tal vez no sea la mejor opción pero si vos queres llevarla jungla entonces llévala jungla.\nSeguramente vas a tener muchas invasiones en tu jungla (ya que es frágil y solo posee un hechizo de daño, haciendo de ella un blanco tentador para los junglas enemigos). \n\nDiría que Espada del Acechador le vendría bien por el tema de maná aunque en el próximo parche tendremos un objeto pensado para magos jungleros, el cual hace daño en área contra monstruos similar a Eco de Luden.","replies":[]},{"poster":"Dim Light","date":"2016-01-09T13:17:20.992+0000","up_votes":1,"down_votes":1,"body":"porque no usar algún chap que de verdad sea un jg? porque usar un champ que no esta echo para la jg en la jg? tu eres el que uso un bardo jg en una partida y perdimos por eso? porque la necesidad de usar supp de sustain en la gj he?","replies":[{"poster":"Hell Darking","date":"2016-01-09T14:47:56.329+0000","up_votes":1,"down_votes":0,"body":"Cualquier champ puede ir jg, es solo cosa de conocer el champ (valga la redundancia) y tener un equipo que coopere\ncon mis amigos (siempre jugamos de 5) fuimos con una soraka jg y ganamos por paliza.\n\nEl que quiere puede","replies":[]},{"poster":"geralf","date":"2016-01-09T13:39:23.143+0000","up_votes":1,"down_votes":0,"body":"Creo que el que escribió esto claramente no sabe hablar.","replies":[]}]},{"poster":"Hugarto","date":"2016-01-09T13:48:55.451+0000","up_votes":1,"down_votes":0,"body":"Cualquiera puede ir jungla, pero para eso primero necesitas conocer bien al campeon, y a la jungla. Sos nivel 19, así que.. yo te recomendaría ir con algo más viable por el momento","replies":[]},{"poster":"Sir Crucifix ","date":"2016-01-09T13:28:56.190+0000","up_votes":1,"down_votes":0,"body":"jg no se, es dificil , pero top mid adc y supp si","replies":[]},{"poster":"Tecnicomando","date":"2016-01-09T11:05:39.503+0000","up_votes":1,"down_votes":0,"body":"Todo campeón puede junglear...\n\nAhora que sea viable o no, depende de la pericia con la que lo uses...\n\nSOlo mirate los usuarios que estan en ligas altas usando junglas no convencionales\n\n\nsalu2","replies":[]},{"poster":"DestroyAgC","date":"2016-01-09T10:11:19.041+0000","up_votes":1,"down_votes":0,"body":"es un troll o uno que recien comienza , pero sona jg tenes mejores opciones","replies":[]},{"poster":"SenpaiDeathx","date":"2016-01-09T09:35:59.204+0000","up_votes":1,"down_votes":0,"body":"antes podias usarla jg con el smite morada, que hacia daño en area y los dejaba stuneados. Ahora creo que morirás intentándolo y te quedaras sin mana.","replies":[]}]}