{"poster":"Dantazzo","date":"2015-02-24T09:51:45.592+0000","title":"Tipi di Adc","subforum":"Discussioni generali","up_votes":12,"down_votes":0,"body":"Dopo:\ntipi di tank http://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/olpdm1tB-forum-nuovo-vecchi-post-d\ntipi di jungler http://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/cPb8A7Nb-tipi-di-jungler\ntipi di support http://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/z9wjl4GQ-tipi-di-support\nEcco a voi i tipi di Adc\n\n**Rambo**: Beh penso che il nome dica tutto, quest'individuo è un one man army, fucilerà chiunque gli capiti a tiro e risulterà incolpibile dal team nemico, nonostante tutte le skill che gli tireranno, persino quelle che non sono skillshot falliranno nel colpirlo. Oltre a non mancare un last-hit eliminerà tutte le volte che sarà possibile la botlane nemica da solo, facendo risultare il suo support più inutile di Yamco di Dragon ball.\n**La prima donna isterica**: Il fatto di essere prime donne è una caratteristica comune a tutti gli adc, ma in questo caso la prima donna è una pazza isterica: perde un minion e flamma, perde due minion e flamma il support, perde 3 minion e scrive in all chat di reportare il top, perde una wave e flamma la botlane nemica, perde 2 wave e gli viene fatto notare che come adc fa cagare, a quel punto feedderà ed andrà afk. Nel rarissimo caso in cui questa persona venisse coinvolta in qualche kill e non dovesse essere lei a prendere le kill griderà al KS, nonostante il suo danno fosse uguale al danno che fa un colibrì ad una portaerei, quindi starà in base 10 minuti a flammare ed ad augurare ogni tipo di malattia terminale a chiunque.\n**Il last-hittatore**: Questa persona è un pò troppo fissata con i last hit, infatti non solo applicherà questo concetto ai minions ma lo farà anche con i campioni avversari, in parole povere in botlane avremo un support che dovrà fare il 90% dei danni alla botlane nemica, in quanto l'adc darà solo l'ultimo colpo ed in teamfight vedremo questo essere stare nascosto fino all'ultimo quando entrerà in scena e dispenserà last hit facendo una penta, o meglio questo è ciò che si aspetta, in realtà il suo team senza i suoi danni perderà il teamfight e l'adc verrà seviziato in 5v1\n**Il punteggiomane**: No, non è un grammar nazi, è una persona che crede di stare giocando ancora a call of duty, per lui il KDA è più importante della vittoria, quindi non parteciperà mai ai teamfight, oppure lo fara da chilometri tirando una o due abilità, questa specie si distingue perchè è tanto brava in linea quanto inutile in teamfight.\n**L'altruista**: Data not found.\n**LEEROY JENKINS**:Per chi ha giocato a Wow non serve una spiegazione, per chi non ci ha giocato eccola, questo tizio non appena vedrà il nemico caricherà a testa bassa, cercando il bianco dei loro occhi, inutile dire che verrà annichilito e con lui ovviamente tutto il resto del team.\n**Il quasi last-hittatore**: Non si sa se per sfiga, o magari perchè sta usando un nuovo champ, o magari la sua skin ha un'animazione di aa diversa, o magari soffre di ansia da prestazione, o magari è solo una schiappa, fatto sta che costui sbaglierà ogni singolo last-hit, in genere lasciando i minion con 1 di vita. Questo tipo di adc si riconosce perchè applicherà questo concetto anche ai campioni, quindi il suo team avrà il support in serie di uccisioni e l'adc con palate di assist.\n\nPer ora è tutto, se verranno scoperte nuove specie verranno aggiunte in seguito.\nA presto con \"tipi di mid\"","replies":[{"poster":"Zorby","date":"2015-02-24T16:07:33.662+0000","up_votes":3,"down_votes":0,"body":"Gioco veramente poco ADC, ma quando lo gioco mi ispiro a Leeroy Jenkins.\n\nhttps://www.youtube.com/watch?v=hooKVstzbz0\n\nLEEEEEEEEEEEEEROY JENKINSSSSSSSSSSSSSSSSSSSSSSSSSSS","replies":[]},{"poster":"Dantazzo","date":"2015-02-24T16:05:23.719+0000","up_votes":2,"down_votes":0,"body":"Aggiunto **Il quasi last-hittatore**","replies":[]},{"poster":"Nibbio Bianco","date":"2015-02-24T14:51:33.671+0000","up_votes":1,"down_votes":0,"body":"Manca l'Urgot. Colui che non sa giocare adc, se lo deve fare quindi picka Urgot e perde il 60% delle partite.","replies":[]},{"poster":"ChipDouglas1","date":"2015-02-24T12:33:44.967+0000","up_votes":1,"down_votes":0,"body":"Lerroy Jenkins il mio Idolo.","replies":[]},{"poster":"Alendir","date":"2015-02-24T11:13:14.680+0000","up_votes":1,"down_votes":0,"body":"Troppo bello:\n> in realtà il suo team senza i suoi danni perderà il teamfight e l'adc verrà seviziato in 5v1\n\nOvviamente quando gioco adc sono un last-hittatore!\n\nL'altruista potrebbe essere quell'adc immaginario che compra anche qualche ward o fa l'upgrade del trinket giallo {{item:3361}} ","replies":[]},{"poster":"Firenheit","date":"2015-02-24T10:20:04.494+0000","up_votes":1,"down_votes":0,"body":">\"nonostante il suo danno fosse uguale al danno che fa un colibrì ad una portaerei\"\n\nTe se ama\n\nPunteggiatore anche io, con qualche pizzico di last-hittatore! ahah","replies":[]},{"poster":"Darki200","date":"2015-02-24T10:00:52.636+0000","up_votes":1,"down_votes":0,"body":"Io mi sa che sono il punteggiomane ma non lo faccio apposta XD\nin lane perdo raramente e in tf non sono altrettanto bravo :v","replies":[]},{"poster":"Stigran","date":"2015-02-24T09:56:20.857+0000","up_votes":1,"down_votes":0,"body":"Perchè mi capitano quasi sempre prime donne isteriche/lasthittatori quando vado support...perchèèè!!","replies":[]}]}