{"poster":"Dantazzo","date":"2017-03-21T18:17:29.012+0000","title":"Ciclicità delle ranked","subforum":"Discussioni generali","up_votes":3,"down_votes":2,"body":"Volevo sapere se anche ad altri capita questa cosa, nel corso degli anni mi &egrave; capitato spesso in soloQ questo ciclo: si scala con winrate decente, poi ciclo di partite, dalle 10 alle 20 dove tu ed il tuo team venite stompati di brutto, poi si torna alla normalit&agrave; e dopo ancora ciclo negativo e cos&igrave; via.\r\nQuesta season mi &egrave; successo gi&agrave; due volte, poco dopo l&#039;inizio con 17 sconfitte su 20, ed ora con 9 su 10 serie ancora in corso, alla fine neanche perdo divisioni o leghe, tipo ora sono oro 1 0 lp da tipo 6/7 sconfitte, per&ograve; &egrave; abbastanza seccante farsi 10/20 partite dove puoi startene benissimo afk tanto verrai arato comunque.\r\nAd altri succede questa cosa? A me personalmente almeno un paio di volte a season succede.","replies":[{"poster":"HaIIeIujah","date":"2017-03-21T18:18:49.510+0000","up_votes":2,"down_votes":0,"body":"E' abbastanza normale. A lungo termine, la statistica divora tutto il resto, vittorie e sconfitte tendono a bilanciarsi a meno che il tuo skill levle non sia superiore al posto in cui sei.","replies":[{"poster":"Dantazzo","date":"2017-03-21T18:21:04.567+0000","up_votes":1,"down_votes":0,"body":"Sì lo so è che mi fa strano come al di fuori di queste serie negative ne vinca anche 2 su 3 o anche 3 su 4 per un pò, poi ancora serie negativa e così via. Cioè non so ancora al livello ne vinco circa il 50%, e trovo curioso che questi stomp pesanti arrivino tutti in fila.","replies":[{"poster":"wildfox99","date":"2017-03-21T19:08:47.068+0000","up_votes":1,"down_votes":1,"body":">e trovo curioso che questi stomp pesanti arrivino tutti in fila.\n\nin parte è dovuto al fatto che una volta tiltato giochi male senza nemmeno accorgertene,quando è così stacca per un po' e poi riprendi\n\nanche se devo ammettere che a volte mi sembra di vedere un sistema presente su alcuni giochi del genere: quando cominci a vincere ti matcha con avversari molto più forti di te (o in giochi di team anche con alleati più scarsi) per farti perdere qualche game e non farti salire troppo in fretta,costringendoti a giocare di più\n**QUESTA è SOLO UN'IPOTESI SENZA FONDAMENTI SE NON QUALCHE IMPRESSIONE PERSONALE**,ma delle volte sembra che sia davvero così (quel che è sicuro che in alcuni giochi lo fanno,di LOL non posso dirlo con certezza)","replies":[{"poster":"BruschettaFelice","date":"2017-03-23T08:51:12.465+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=wildfox99,realm=EUW,application-id=MJVj50Jw,discussion-id=QBVoIUR0,comment-id=000000010000,timestamp=2017-03-21T19:08:47.068+0000)\n\n> anche se devo ammettere che a volte mi sembra di vedere un sistema presente su alcuni giochi del genere: quando cominci a vincere ti matcha con avversari molto più forti di te\n\n\nCi credo, se fai una serie di 9 win o cose così il tuo mmr sale notevolmente, arrivando in promo per esempio ti matcha con gente più forte, di una divisione o due in più, per esempio. (Divisione, non lega.) Il sistema riconosce che tu stai salendo, che forse quella non è la tua divisione a livello di skill etc e quindi prova a matcharti con gente più forte. La lose streak deriva dal fatto che come hai detto dopo un paio di lose parti demoralizzato.","replies":[{"poster":"wildfox99","date":"2017-03-23T16:33:02.142+0000","up_votes":1,"down_votes":1,"body":"ma dovrebbe comunque matcharti con gente di quel livello anche nel **tuo** team,appunto ad intervalli cominci ad avere una differenza di elo enorme fre i due team,per fare un esempio teorico: nel tuo team ti mette tutti platino 5 e in quello avversario platino 1/2 o ex diamond,una volta capita ma se succede di fila ad intervalli sembra meno casuale,poi era solo tanto per dire visto che eravamo in tema,non credo nemmeno io sia vero","replies":[{"poster":"BruschettaFelice","date":"2017-03-23T19:25:18.604+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=wildfox99,realm=EUW,application-id=MJVj50Jw,discussion-id=QBVoIUR0,comment-id=00000001000000010000,timestamp=2017-03-23T16:33:02.142+0000)\n>\nper fare un esempio teorico: nel tuo team ti mette tutti platino 5 e in quello avversario platino 1/2 o ex diamond,una volta capita ma se succede di fila ad intervalli sembra meno casuale,poi era solo tanto per dire visto che eravamo in tema,non credo nemmeno io sia vero\n\ntutti platino 5 e contro plat 1/2 è impossibile. Se sei plat 5 ti becchi contro i plat 5/4 e al massimo un 3 in caso il tuo mmr è davvero alto","replies":[{"poster":"wildfox99","date":"2017-03-24T15:38:42.280+0000","up_votes":1,"down_votes":0,"body":"non so come sia potuto succedere (solo la riot conosce a fondo i loro algoritmi spaghettosi),ma è successo","replies":[]}]}]}]},{"poster":"Dantazzo","date":"2017-03-21T19:41:34.023+0000","up_votes":1,"down_votes":0,"body":"Sono spalmate su più giorni, e solo in soloq.","replies":[]}]}]},{"poster":"Floppyz","date":"2017-03-21T18:20:03.182+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ø Tera Ø,realm=EUW,application-id=MJVj50Jw,discussion-id=QBVoIUR0,comment-id=0000,timestamp=2017-03-21T18:18:49.510+0000)\n>\n> E&#x27; abbastanza normale. A lungo termine, la statistica divora tutto il resto, vittorie e sconfitte tendono a bilanciarsi a meno che il tuo skill levle non sia superiore al posto in cui sei.\n\nThis.","replies":[]}]},{"poster":"FuryTheFenix ITA","date":"2017-03-22T15:37:39.013+0000","up_votes":1,"down_votes":0,"body":"Si, capita anche a me; nella mia accidentata corsa all'Oro V (partendo da Bronzo III, sono quasi Silver III) sono partito con winstreak da 6-7 alternate a 3-4 sconfitte, e poi 2 vittorie 1 sconfitta....\nArrivato ad una winstreak di 17 (momento in cui ho trovato il mio main!) sono sprofondato in una losestreak mostruosa (e visto che vinco 18 punti e ne perdo 20 a partita) sono volato dal silver III al IV e adesso sono tornato in promo.\nÈ ciclico, basta che le winstreak rimangano più forti delle losestreak.\n\nP.s. non giocherò mai più Akali","replies":[]},{"poster":"Ermes Mezzelfo","date":"2017-03-21T22:05:17.217+0000","up_votes":1,"down_votes":0,"body":"E' successa la cosa identica a me.\nIn questa Season ho beccato 2 cicli estremamente negativi(durati 2 settimane l'uno circa in cui perdevo una marea di punti) in cui ho trovato la peggio gente in team da quando ho iniziato 4 anni fa :/","replies":[]}]}