{"poster":"Dantazzo","date":"2017-11-20T12:11:49.766+0000","title":"De Xaviness coniuratione","subforum":"Discussioni generali","up_votes":15,"down_votes":7,"body":"Beh, alla fine &egrave; successo, Xaviness (Polarize) &egrave; stato permabannato da questo forum, un membro storico di questa community non ne far&agrave; pi&ugrave; parte.\r\nNon sono qui per difendere ed accusare, sono qui solo per fare constatazioni.\r\nConstatazione: la community non esiste pi&ugrave;, e non lo dico solo perch&egrave; ne &egrave; stato bannato un pilastro, ma &egrave; un dato di fatto, quanti membri attivi ed &quot;importanti&quot; del forum, mod esclusi,  vi vengono in mente di primo acchito? A me personalmente solo Tera (HaIIeIujah) che per&ograve; da quanto ho letto negli ultimi giorni si &egrave; stufato pure lui. Non c&#039;&egrave; pi&ugrave; nessuno di identificabile, nessuno che crei contenuti (gente come Tera e Giovarco) proponga iniziative, come il torneo interboard, dove abbiamo partecipato solo una volta, ed ironicamente &egrave; stato proprio Xavi a trascinarci dentro, gli anni successivi le proposte di riproporlo sono state ignorate e neanche pubblicizzate. Anche di gente che semplicemente se ne intende abbastanza gameplay ne &egrave; rimasta pochissima, personalmente non me ne vengono neanche in mente, ma spero che qualcuno ci sia, i vari Iloud, Yasha, Ven, sono tutti spariti. Diavolo non &egrave; rimasto nemmeno nessuno che crea contenuti trollosi, solo per farsi due risate, questa in effetti era un p&ograve; la mia specialit&agrave;. Sono, siamo, tutti stufi ormai e mi dispiace davvero molto, perch&egrave; io, come xavi, come altri, ora etichettati come &quot;elementi tossici, gente che &egrave; solo qui per fare polemica&quot; ci tenevamo davvero a questo forum, a questa community, che ormai non esiste pi&ugrave;.\r\nNon &egrave; un thread per litigare, accusare o fare polemica, &egrave; semplicemente un thread triste perch&egrave; ci&ograve; che una volta mi divertiva, una cosa a cui tenevo anche tanto, ormai non esiste pi&ugrave;.","replies":[{"poster":"NiraBlade","date":"2017-11-20T13:53:52.091+0000","up_votes":3,"down_votes":0,"body":"dantazzo non è mai stato mio interesse quello di ettichettarvi come tossici o altro. \n\nOrmai penso sia inutile recriminare questo e quello, quindi veniamoci incontro: datemi feedback che siano reali feedback e non righe e righe di insulti senza nulla di costruttivo e vediamo cosa si può fare per permettere uno spazio a tutti senza soffocare quella che può essere la tua - o l'altrui voglia - di scherzare o fare post troll. Perché sinceramente penso sia possibile uno spazio in cui c'è il posto per la risata ma si possa allo stesso tempo non trasformare in una gara a chi insulta meglio.","replies":[{"poster":"Exardeo","date":"2017-11-20T14:06:20.240+0000","up_votes":2,"down_votes":5,"body":"Non servono feedback, non serve niente.\nSemplicemente il forum era un posto migliore quando c'era meno moderazione, il fatto che la community attualmente sia abbastanza scarna e che le due \"fazioni\" che battibeccano adesso siano appunto discendenti della comunity del forum originale mostra che la parte \"buona\" è appunto nel passato.\nI mod attuali personalmente vanno semplicemente cambiati in toto visto che stanno occupando posti di persone che potrebbero farlo meglio(es ste e altri).\nSiete volontari, non avete saputo fare il vostro lavoro, semplicemente venite rimpiazzati, avete sbagliato, basta finito, non è che avete qualificazioni che vi rendono superiori ad un qualsiasi altro utente del forum a gestire la moderazione.\nAnzi, visto il lavoro che avete fatto probabilmente avete anche MENO qualificazioni ad essere mod, visto che avete dimostrato essere oltre le vostre competenze.\n\nOra, potete permabannare anche questo account, ma come ho letto in passato \"i ban possono essere rimossi\", e sono fiducioso che quando finalmente vi leverete dalla carica di mod per volere del popolo o per punizione divina vi ricorderete di sbannarmi.\n\nConcludo dicendo che permabannarmi per un post ogni 2 mesi in cui critico l'operato di mod globalmente criticati fa sorgere due domande sulla visione distorta del vostro operato","replies":[{"poster":"NiraBlade","date":"2017-11-20T14:11:09.840+0000","up_votes":2,"down_votes":0,"body":">Semplicemente il forum era un posto migliore quando c'era meno moderazione\n\nOh vedi che c'è un punto di incontro allora? Dimmi come e dove secondo te, perché se mi mandi messaggi pieni di insulti senza farmi capire una ceppa di cosa secondo te non va non si migliora un bel nulla.\n\n>Concludo dicendo che permabannarmi per un post ogni 2 mesi in cui critico l'operato di mod globalmente criticati fa sorgere due domande sulla visione distorta del vostro operato\n\nRipeto come nell'altro thread: sono 1000% open verso messaggi in cui mi si dice in maniera critica e **costruttiva** cosa va cambiato, altrimenti se vedo un account con 0 o poco più messaggi all'attivo il cui primo messaggio è carico di insulti quell'account semplicemente salta.","replies":[{"poster":"Exardeo","date":"2017-11-20T14:30:30.730+0000","up_votes":2,"down_votes":2,"body":"La parte di cosa rendeva il forum speciale l'ho messa sopra.\nLa critica+insulti sono sterili solo se l'oggetto si ritiene sempre corretto.\n\nAdesso dimmi nira, secondo te il forum è migliorato o peggiorato da quando è entrata in azione la mod squad?\nDantazzo ha citato il torneo interboard:parte italiana gestita interamente da me(votazione, coordinazione con gli organizzatori francesi e tutto) e in seguito la parte dei game da ste, evento che ha unito molto la community, basti pensare le varie proposte per i ruoli, votazione e tutto, possibili commentatori.\nVoi mod che vi siete posti non solo come \"vigili\" ma anche come leader della community, siete riusciti a fare di qualcosa vagamente simile?\n\nInoltre: ho proposto più e più volte l'integrazione di mod un po' più lascivi e comunque molto oggettivi(sarò ripetitivo ma ste sarebbe molto bravo) ma non mi pare di aver MAI sentito una possibile risposta che considerasse il ricambio di alcuni e l'elezione di nuovi mod, quindi io sono molto sicuro che nel vostro agire l'orgoglio personale abbia superato il \"bene del forum\" di un po'.","replies":[{"poster":"NiraBlade","date":"2017-11-20T14:41:20.663+0000","up_votes":3,"down_votes":1,"body":"La critica+insulti sono sterili solo se l'oggetto si ritiene sempre corretto.\n\nGuarda per gli insulti mi tange molto poco quando rivolti a me francamente, quel che mi interessa è farmi un'idea il quanto più possibile della tua opinione e su che cosa secondo te si può migliorare. Quel che ti faccio presente è che non posso aiutarti se leggo solo insulti perché non posso sapere nello specifico che cosa li ha causati - o farmi un'idea totalmente sbagliata.\n\n>Adesso dimmi nira, secondo te il forum è migliorato o peggiorato da quando è entrata in azione la mod squad?\n\nPenso sia migliorato da un certo punto di vista - si evita di aspettare giorni o anche settimane prima del ban di una persona che non fa altro che insultare. Però penso ci siano cose su cui non è migliorato affatto (creazione di contenuti primi fra tutti e malcontento generale sulla moderazione) ed è appunto per questo che voglio sentire la vostra.\n\n.\n---\n.\n>Inoltre: ho proposto più e più volte l'integrazione di mod un po' più lascivi e comunque molto oggettivi(sarò ripetitivo ma ste sarebbe molto bravo) ma non mi pare di aver MAI sentito una possibile risposta che considerasse il ricambio di alcuni e l'elezione di nuovi mod, quindi io sono molto sicuro che nel vostro agire l'orgoglio personale abbia superato il \"bene del forum\" di un po'.\n\nPotremmo iniziare una nuova fase di reclutamento finito di stilare il nuovo regolamento - ho messo i link al documento di proposta, se volete aggiungerci qualcosa ve lo lascio qua [PROPOSTE Regolamento](https://docs.google.com/document/d/1gSpQlKBN6aEdgbQr3Ap2S7TXZ1OvlI4nLHWrISvh63w/edit#) + [aggiunte forum](https://docs.google.com/document/d/19xAV2A8Wzarj3uqZkMuL0sekLZI7T0D2hewpe9PnXHA/edit) \"EDIT: oppure se preferite mettere i commenti sul forum [qua](https://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/PEGPoHOA-nel-forum-che-vorrei) c'è la discussione in merito \". Non posso prometterti il tutto al 100% in quanto devo discuterne con il Rioter che ora si occupa di questo aspetto - mi dispiace non poterti fornire ulteriori dettagli in merito alla persona ma come avrai già letto in precedenza sono in fase di transizione, quindi molte cose sono coperte da NDA. Quel che posso fare è che lo farò presente in sede apposita il prima possibile e vi farò sapere in merito.","replies":[{"poster":"iBox360","date":"2017-11-20T15:37:09.065+0000","up_votes":9,"down_votes":0,"body":"Buona giornata\n\nIo in primis, sono molto triste per la sezione Creazioni dei contenuti\nE' ormai un anno che scrivo \"storielle\" e con molto dispiacere ho visto che pochi\nscrivono qualcosa di interessante/divertente. Ma non penso sia colpa dei Mod...\nA mio parere è dovuto al mancato interesse generale che porta a una carica di -1 sui suddetti post ...\n\nIl mio sogno è vedere questa sezione \"resuscitare\" dalle sue stesse ceneri \ne tornare come i bei vecchi tempi ;D","replies":[{"poster":"HaIIeIujah","date":"2017-11-20T16:17:59.408+0000","up_votes":4,"down_votes":0,"body":"Scrivere in Creazione dei Contenuti è un massacro.\n\nNon appena pubblicata una cosa qualunque arrivano istantaneamente 2, 3 downvote. Una volto caduto giù nella \"Hot List\" riprendere visibilità è un miracolo.\n\nDetto francamente, scrivere qualunque cosa più di un di una \"storiella\" è poco efficiente in quanto a tempo. La community ha silenziosamente fatto valere la sua opinione sulle storia più \"complesse\", in particolare se non sono di natura comica.\n\nPersino quelle \"grosse\" hanno difficoltà a ricevere commenti con critiche utile.\n\nE' semplicemente la morfologia della community. Quando una fanart di una gif a due frame fa lo stesso successo di una roba per cui ci sono voluti due mesi, perché continuare?\n\nOvviamente tutto ciò era _prima_ che la sezione venisse invasa dai Google Translators, che ormai penso abbiano anche distrutto l'idea di postare video dal proprio canale.\n\nResuscitare la sezione richiederebbe uno sforzo dall'alto, un hub più efficace di diffusione di video, incentivi a creare guide, rotazione di sticky threads utili al momento, più iniziative volte a coinvolgere la community, e così via.\n\n","replies":[{"poster":"NiraBlade","date":"2017-11-20T23:51:57.324+0000","up_votes":1,"down_votes":0,"body":">Resuscitare la sezione richiederebbe uno sforzo dall'alto, un hub più efficace di diffusione di video, incentivi a creare guide, rotazione di sticky threads utili al momento, più iniziative volte a coinvolgere la community, e così via.\n\nSembra interessante, puoi essere più specifico in merito?  te l'ho aggiunta [qua](https://docs.google.com/document/d/19xAV2A8Wzarj3uqZkMuL0sekLZI7T0D2hewpe9PnXHA/edit) se vuoi aggiungi pure tramite commento o suggerimento, così te lo inserisco in automatico domani!","replies":[{"poster":"HaIIeIujah","date":"2017-11-20T23:54:51.590+0000","up_votes":1,"down_votes":0,"body":"> Da questo momento, me ne lavo le mani. Non c'è alcun modo di stabilire un dialogo con Ciack presente, e dunque non ho intenzione di provarci.\n> \n> Che questo forum vada dove deve andare, sia esso spam di Google Translatorini o permachiusura di ogni thread che critichi Ciack personalmente.","replies":[{"poster":"NiraBlade","date":"2017-11-21T01:00:16.539+0000","up_votes":1,"down_votes":0,"body":"A tua preferenza!","replies":[]}]}]}]},{"poster":"Dodop","date":"2017-11-20T16:12:18.609+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Nibbio Bianco,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=0000000000000000,timestamp=2017-11-20T13:45:16.688+0000)\n>\n> &quot;Regolamento: Appena uscirà rimpiangerete di avercelo chiesto.&quot;\n\nCaro Nibbio, questa uscita l'ho letta anche nello scorso post in cui non ho risposto, ma voglio farlo qui: ovviamente per una singola frase non voglio farne un caso di stato e non so neanche con quale accezione hai voluto scriverla (forse anche un po' ironica), però come ha detto Tera sembra davvero una minaccia o comunque un gesto di sfida da parte di voi modder nei confronti di noi utenti e credo che sia totalmente fuori luogo, soprattutto di fronte ad una situazione abbastanza delicata del forum come quella attuale.\n\n> [{quoted}](name=iBox360,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=000500000000000000000001,timestamp=2017-11-20T15:37:09.065+0000)\n>\n> Buona giornata\n> \n> Io in primis, sono molto triste per la sezione Creazioni dei contenuti\n> E&#x27; ormai un anno che scrivo &quot;storielle&quot; e con molto dispiacere ho visto che pochi\n> scrivono qualcosa di interessante/divertente. Ma non penso sia colpa dei Mod...\n> A mio parere è dovuto al mancato interesse generale che porta a una carica di -1 sui suddetti post ...\n> \n> Il mio sogno è vedere questa sezione &quot;resuscitare&quot; dalle sue stesse ceneri \n> e tornare come i bei vecchi tempi ;D\n\nAnche a me piacevano quelle \"storielle\", ora in quella sezione l'unico contenuto rimasto è la serie di video spam dello stesso tizio che traduce con Google Translate...\n\n\nÈ un peccato perché mi è sempre piaciuto questo forum e ho sempre provato a dare il mio contributo per renderlo migliore, ma avrete sicuramente notato che sono stato anche io completamente inattivo per 2-3 mesi (anche per questo motivo non mi ero accorto che Tera, uno dei pilastri e uno dei player più attivi di questo forum, aveva cambiato nome xD) un po' perché mi ero stancato io e perché con l'inizio della scuola preferivo investire il mio poco tempo libero a giocare su League, un po' per la mancanza di contenuti.\nIo però non punterei il dito contro la moderazione. Magari non avranno gestito la situazione in maniera perfetta (e ne stiamo discutendo molto in questi ultimi giorni), magari per il ritiro di Judge (che a me, come ho ribadito precedentemente, non fa né caldo né freddo), magari per la poca visibilità dal client (citando Ser Nalor), o magari la colpa è nostra, della stessa community, che non valorizza al meglio questo sito.\nQuesto io non lo so ma oggettivamente il calo c'è stato e ciò è innegabile.\nIo, e spero anche i modder (soprattutto Nira, che al momento è il modder che si impegna maggiormente a migliorare il forum e che ha maggiore fiducia verso noi utenti) e gli altri membri più attivi di questo forum, Tera in primis, mi impegnerò al massimo per contribuire a migliorare questo forum e vediamo in futuro cosa succederà.\n\n","replies":[]},{"poster":"UltraLion","date":"2017-11-20T15:52:14.444+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=iBox360,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=000500000000000000000001,timestamp=2017-11-20T15:37:09.065+0000)\n>\n> Buona giornata\n> \n> Io in primis, sono molto triste per la sezione Creazioni dei contenuti\n> E&#x27; ormai un anno che scrivo &quot;storielle&quot; e con molto dispiacere ho visto che pochi\n> scrivono qualcosa di interessante/divertente. Ma non penso sia colpa dei Mod...\n> A mio parere è dovuto al mancato interesse generale che porta a una carica di -1 sui suddetti post ...\n> \n> Il mio sogno è vedere questa sezione &quot;resuscitare&quot; dalle sue stesse ceneri \n> e tornare come i bei vecchi tempi ;D\n\nLe storielle non è detto interessino, le persone che son qui sono spinte a star qui per il gioco, quello che sarebbe più bello è utile sarebbe organizzare partite e mini tornei con persone del forum ecc","replies":[]}]}]}]}]},{"poster":"Saibbo","date":"2017-11-20T14:11:10.198+0000","up_votes":3,"down_votes":0,"body":"Questo non e' esattamente un forum community creato in automatico... e' un forum ufficiale della riot... ti pare lo lasciano senza/poca moderazione??","replies":[{"poster":"Exardeo","date":"2017-11-20T14:22:47.724+0000","up_votes":3,"down_votes":2,"body":"Il forum è stato per anni con un singolo moderatore che appunto gestiva i casi estremi, ed era un posto fantastico, e tanti tantissimi utenti che ne facevano parte ai tempi adesso sono (a distanza di anni) ancora in gruppi solidi.\nPoi è arrivato riot judge che ha portato e istruito i mod a operare con livelli di politically correct estremo, e tutto il senso di appartenenza è andato a monte, visto che il flame lieve, l'ot e la sfrontatezza sia per i nuovi che per i vecchi(che era divertente a ammalgamava il tutto) sono state sradicate in tempo zero.\nMica mandavamo il cancro alla madre tutto il tempo,anzi, ma era un posto tosto per gente tosta 8).\n Ma appunto la magia della quasi autogestione è morta e con essa il lato intrigante del forum.","replies":[]}]}]},{"poster":"Dantazzo","date":"2017-11-20T15:04:51.786+0000","up_votes":7,"down_votes":3,"body":"Il feedback che ho visto da utente.\nSelezione dei mod poco chiara, noi utenti normali non abbiamo idea dei metodi di selezione, del perchè alcuni sono diventati mod ed altri no, perchè alcuni mod hanno lasciato, come i mod di rimpiazzo sono stati scelti? Io mi ricordo la prima selezione dei mod, anche quella poco chiara in base ai criteri determinanti per la selezione se proprio vogliamo dirla tutta, ma almeno ci sono stati thread a post a riguardo , ma quelli entrati dopo sembrano davvero entrati solo per favoritismi vari perchè non sappiamo i criteri ed il perchè siano stati scelti, sono solo spuntati dal nulla.\n\nMod inadeguati, cioè dai non prendiamoci in giro, in particolare, ma non solo, l'ultimo arrivato dei mod (sappiamo tutti chi) si è inimicato tanti utenti, storici e non. Ora, non saremo mica tutti scemi...\n\nDifferenza di trattamento dei vari utenti, anche qui poco da dire, sono cose oggettive, non faccio nomi ovviamente, ma chi era più a contatto coi mod al massimo veniva richiamato sul client in chat privata, per gli altri ban, ho anche gli screen da qualche parte nel caso servano.\n\nZero contenuti, qua è un'interpretazione personale, a me l'atmosfera che mi sembra si sia creata coi mod verso gli utenti storici sia stata di \"ora ci siamo noi e comandiamo noi\" questo oltre a creare zizzania ha fatto in modo che molti utenti storici smisero di partecipare in modo attivo nel lungo andare, il fatto è che molti contenuti venivano creati proprio da loro, che sia fan fiction, traduzioni, gameplay, iniziative, insomma un pò tutto. Come detto però è un'interpretazione personale. Il fatto che non ci siano contenuti non lo è però.\n\nMancanza di trasparenza, come già detto per esempio nelle selezioni dei mod, o nella partenza di judge. Ovvio che se fai le cose senza trasparenza si crea sfiducia.\n\nMancanza di rioter, anche quando c'era judge non si faceva vedere spesso.\n\nMancanza di buon senso ed onestà intellettuale, cioè è un forum dove già ai tempi d'oro c'erano 4 gatti, se ti metti ad applicare il regolamento in maniera rigida ovvio che perdi gente, senza contare che ogni tanto ci sono stati dei ban almeno discutibili, mai un mod che avesse le palle di aprire un thread e dire \"ho sbagliato (anche) io in quella situazione, mi sucso e ti tolgo il ban/mi autobanno\", questi sono gesti piccoli ma che pesano.\n\nEd ovviamente come scritto all'inizio, mancanza di una community.","replies":[{"poster":"NiraBlade","date":"2017-11-21T00:05:41.904+0000","up_votes":1,"down_votes":0,"body":">Selezione dei mod poco chiara\n>Mancanza di trasparenza, come già detto per esempio nelle selezioni dei mod, o nella partenza di judge. Ovvio che se fai le cose senza trasparenza si crea sfiducia.\n\nY direi che qua possiamo fare delle selezioni quanto meno più chiare nelle varie fasi di selezione di modo tale da spiegare meglio le nostre ragioni a tal proposito. Sto anche considerando l'eventualità di parlarne prima con il forum in generale sulle varie fasi di processo per vedere se escono fuori idee carine in merito.\n\n\n>Mod inadeguati\n>Differenza di trattamento dei vari utenti\n\nQua vorrei sinceramente approfondire molto la cosa e visto che ci sarà parecchio da discutere ti va di trovarci su ts così mi elenchi tutto nel dettaglio, mi segno tutti i casi che non ti tornano e vedo di approfondire la faccenda controllando all'interno del nostro sistema? Dopodiché vedo di riassumere il tutto nel futuro thread di discussione della moderazione.\n\n>Zero contenuti\n>a me l'atmosfera che mi sembra si sia creata coi mod verso gli utenti storici sia stata di \"ora ci siamo noi e comandiamo noi\" questo oltre a creare zizzania ha fatto in modo che molti utenti storici smisero di partecipare in modo attivo nel lungo andare, \n\nnon saprei confermarti o smentirti la cosa francamente, sicuramente non era l'obiettivo arrivare a far smettere la creazione di contenuti da parte di determinati utenti - che poi il risultato sia stato anche questo, in parte o meno è sicuramente da tenere conto. Può anche esser stata una mancanza di comunicazione chiara e precisa in merito o incomprensione generale.\n\n\n>Mancanza di rioter, anche quando c'era judge non si faceva vedere spesso.\n\npurtroppo sono d'accordo con te, ma non posso costringere un rioter ad interfacciarsi con il forum se non lo vuole fare.\n\n\n>Mancanza di buon senso ed onestà intellettuale, cioè è un forum dove già ai tempi d'oro c'erano 4 gatti, se ti metti ad applicare il regolamento in maniera rigida ovvio che perdi gente, senza contare che ogni tanto ci sono stati dei ban almeno discutibili, mai un mod che avesse le palle di aprire un thread e dire \"ho sbagliato (anche) io in quella situazione, mi sucso e ti tolgo il ban/mi autobanno\", questi sono gesti piccoli ma che pesano.\n\nlo inserisco come punto da discutere nel futuro thread di discussione della moderazione, finito il regolamento ne parliamo meglio nel thread apposito!","replies":[{"poster":"Dantazzo","date":"2017-11-21T07:31:30.358+0000","up_votes":2,"down_votes":1,"body":"Quando mi vedi on fammi un fischio, oggi non penso di riuscire, ma in questi giorni sicuramente ci incrociamo","replies":[{"poster":"NiraBlade","date":"2017-11-21T19:14:29.134+0000","up_votes":1,"down_votes":0,"body":"Perfetto! Oggi temo neanche io di riuscirci, avrò dormito si e no 3 - 4 ore in questi 3 giorni e necessito un minimo di riposo e relax xD appena ci becchiamo vediamo tutto per bene, considera che abbiamo 2 settimane prima del thread sulla moderazione quindi se vuoi prepararti un attimo un file e rivederti i casi di cui vuoi parlarmi fai pure con calma!","replies":[]}]}]}]}]},{"poster":"Samel Seifer","date":"2017-11-20T15:27:17.035+0000","up_votes":8,"down_votes":0,"body":"Da 4-5 anni, forse più ma sicuramente non di meno, passo per il forum ogni singolo giorno, anche più volte al giorno, ma sono sempre stato per lo più uno spettatore, non ho partecipato davvero, ci sono nomi che riconosco come di vecchia data ma nessuno conosce me perché non ho contribuito, commento raramente ed ancor più di rado apro discussioni ed ora che siamo in questo stato devo dire che mi pento di essere stato così passivo.\n\nAh, e mi dispiace davvero per come l'utenza ed i moderatori si sono divisi, ho sempre trovato piacevole la presenza degli Emissary e dei Wrenchman così come quella degli utenti più caotici ed irriverenti, perché indipendentemente da cosa portavano al forum, quello che davano a me era un senso di familiarità che sta svanendo piano piano.","replies":[]},{"poster":"UltraLion","date":"2017-11-20T14:29:42.905+0000","up_votes":1,"down_votes":0,"body":"Comunque rivolto ai moderatori volontari o no, io non entro nel merito della faccenda, perchè semplicemente non so da cosa nasca tutta questa discussione, se ci siano stati ban ingiusti o no; quello che però posso dire, è che essere troppo fiscali con regolamenti, rende i forum molto meno piacevoli.\nPer esempio, se scoppia una lita fra 2 utenti che si insultano, prima si interviene e si dice di smettera, poi si banna.\nIl ban dovrebbe essere la misura super estrema, quasi mai applicata, e si dovrebbe chiudere un occhio spesso e volentieri, certo questo è il mio pensiero, ma siamo sul forum di League Of Legends, il forum di un gioco strapieno di flame e comportamenti scorretti, eppure la Riot non banna \"nessuno\" se la riot iniziasse a bannare realmente in modo così fiscale tutti quelli che lo meritano, diventerebbe una strage, e cadrebbero in punizione anche utenti prevalentemente sani, per magari un episodio di sclero, una cosa che non avrebbe alcun senso","replies":[{"poster":"Frattaglia","date":"2017-11-20T17:02:50.559+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=UltraLion,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=0007,timestamp=2017-11-20T14:29:42.905+0000)\n>\n> Comunque rivolto ai moderatori volontari o no, io non entro nel merito della faccenda, perchè semplicemente non so da cosa nasca tutta questa discussione, se ci siano stati ban ingiusti o no; quello che però posso dire, è che essere troppo fiscali con regolamenti, rende i forum molto meno piacevoli.\n> Per esempio, se scoppia una lita fra 2 utenti che si insultano, prima si interviene e si dice di smettera, poi si banna.\n> Il ban dovrebbe essere la misura super estrema, quasi mai applicata, e si dovrebbe chiudere un occhio spesso e volentieri, certo questo è il mio pensiero, ma siamo sul forum di League Of Legends, il forum di un gioco strapieno di flame e comportamenti scorretti, eppure la Riot non banna &quot;nessuno&quot; se la riot iniziasse a bannare realmente in modo così fiscale tutti quelli che lo meritano, diventerebbe una strage, e cadrebbero in punizione anche utenti prevalentemente sani, per magari un episodio di sclero, una cosa che non avrebbe alcun senso\n\nE' stato praticamente sempre fatto così, e i permaban sono arrivati sempre dopo che l'utente mostrava di non cambiare atteggiamento.\nNel caso di Xavi... beh aveva detto lui stesso mesi fa di non voler più partecipare al forum, condendo con una frase omofoba, sinceramente ero convinta fosse stato già permabannato là (non ho seguito molto perché in quel periodo ero in ospedale, per questo potrei non ricordarmene bene)\nhttps://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/4wcnFErP-parliamo-del-regolamento?show=flat&comment=00080000\n\nIn generale diamo molte possibilità, ma non infinite.\n\np.s. mi pare scontato dire come nel caso di Xavi quello non fosse stato né il primo richiamo né il primo ban.","replies":[{"poster":"UltraLion","date":"2017-11-20T18:16:42.242+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=00070000,timestamp=2017-11-20T17:02:50.559+0000)\n>\n> E&#x27; stato praticamente sempre fatto così, e i permaban sono arrivati sempre dopo che l&#x27;utente mostrava di non cambiare atteggiamento.\n> Nel caso di Xavi... beh aveva detto lui stesso mesi fa di non voler più partecipare al forum, condendo con una frase omofoba, sinceramente ero convinta fosse stato già permabannato là (non ho seguito molto perché in quel periodo ero in ospedale, per questo potrei non ricordarmene bene)\n> https://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/4wcnFErP-parliamo-del-regolamento?show=flat&amp;comment=00080000\n> \n> In generale diamo molte possibilità, ma non infinite.\n> \n> p.s. mi pare scontato dire come nel caso di Xavi quello non fosse stato né il primo richiamo né il primo ban.\n\nScusa non so dove devo guardare, nel link non vedo il nick xavi, leggo Polarize, e non trovo nulla di omofobo nel post.\nComunque se davvero avvisate prima và bene, però il concetto che volevo esprimere era, anche se uno se lo merita, a meno che non abbia insultato la mamma a qualcuno e sia andato giù davvero pesante, chiudete un occhio più volte, se anche c'è un pò di caos è sempre il forum di lol, se già lo fate bene così.","replies":[{"poster":"Vileblood Pyke","date":"2017-11-20T18:26:45.249+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=UltraLion,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=000700000001,timestamp=2017-11-20T18:16:42.242+0000)\n>\n>nel link non vedo il nick xavi, leggo Polarize.\n\nXaviness = Polarize","replies":[{"poster":"UltraLion","date":"2017-11-20T19:12:13.142+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wraith Lord,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=0007000000010000,timestamp=2017-11-20T18:26:45.249+0000)\n>\n> Xaviness = Polarize\n\nImmaginavo, anche se mi sfugge la frase omofoba\nse è \"lata fagz\" non ne conosco il significato lol","replies":[{"poster":"Floppyz","date":"2017-11-20T19:22:01.800+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=UltraLion,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=00070000000100000000,timestamp=2017-11-20T19:12:13.142+0000)\n>\n> Immaginavo, anche se mi sfugge la frase omofoba\n> se è &quot;lata fagz&quot; non ne conosco il significato lol\n\nhttps://en.wikipedia.org/wiki/Faggot_(slang)\n\nMa tanto se chiedi alle persone _giuste_ ti diranno che _era solo un modo simpatico e carino di salutare, e chi se ne frega se è offensivo verso altre persone_.\n\n> Il dito era puntato verso judge, e adesso judge non c&#x27;è più, segno che forse il dito non indicava il nulla.\n\n\nJudge se n'è andato di sua volontà per ragioni che non hanno niente a che fare con questo forum, quindi non mi sembra il caso di fare disinformazione verso chi non può replicare solo per alimentare i tuoi attacchi.\n\n> Adesso il dito è su di voi mod.\n\nLe minacce, che ti qualificano ulteriormente se qualcuno avesse ancora dubbi, puoi tenertele per te.","replies":[{"poster":"Ste the ripper","date":"2017-11-20T19:26:18.773+0000","up_votes":1,"down_votes":3,"body":"Leggi almeno gli articoli che posti...\n\n> It may also be used as a generic insult, for example, \"idiot\", although more offensive in nature.\n\nE dare del \"fro_io\" ad una persona che non è gay e non ha comportamenti assimilabili a loro è decisamente stupido, invece darvi dei \"cre_ini\" aveva senso secondo il senso del suo post. ( lo scrivo perché non vorrei che \"leggeste male :)\" non sono idee mie, sto spiegando il senso delle parole che ha usato xavi)\nEra chiaramente questo il significato, ma di nuovo torno al mio commento di qualche ora fa: avete le capacità linguistiche di un'oloturia.","replies":[{"poster":"Floppyz","date":"2017-11-20T19:27:19.278+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Ste the ripper,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=0007000000010000000000000000,timestamp=2017-11-20T19:26:18.773+0000)\n>\n> Almeno leggi gli articoli che posti...\n\nC'è scritto che può essere usato come un insulto generico, peraltro molto offensivo. Dobbiamo intavolare una polemica anche su questo fino ad arrivare a dire che non era un insulto, oppure possiamo andare oltre?","replies":[]}]}]}]}]}]},{"poster":"Ste the ripper","date":"2017-11-20T17:20:07.895+0000","up_votes":2,"down_votes":4,"body":"Bene, se volevi permabannarlo potevi farlo in quel commento, non lo fate in un commento a caso successivo perché vi eravate dimenticati prima.\nIo ho letto cosa aveva scritto e trovo davvero ridicolo questo perma, ma è il vostro modus operandi, ancora una volta dimostrate inefficienza e inettitudine: prima dimenticate di sanzionare quando è giusto sanzionare ( ti credo sulla parola perché il commento da te linkato o è editato o non è da sanzionare) e poi date la stangata doppia in un commento successivo.\nUn po' come se io facessi un omicidio, non vengo arrestato, poi mi fermano perché passo con il rosso e mi becco l'ergastolo. Che senso ha? Lo sapete solo voi.","replies":[{"poster":"Nibbio Bianco","date":"2017-11-20T17:31:45.910+0000","up_votes":6,"down_votes":3,"body":"> [{quoted}](name=Ste the ripper,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=000700000000,timestamp=2017-11-20T17:20:07.895+0000)\n>\n> Bene, se volevi permabannarlo potevi farlo in quel commento, non lo fate in un commento a caso successivo perché vi eravate dimenticati prima.\n> Io ho letto cosa aveva scritto e trovo davvero ridicolo questo perma, ma è il vostro modus operandi, ancora una volta dimostrate inefficienza e inettitudine: prima dimenticate di sanzionare quando è giusto sanzionare ( ti credo sulla parola perché il commento da te linkato o è editato o non è da sanzionare) e poi date la stangata doppia in un commento successivo.\n> Un po&#x27; come se io facessi un omicidio, non vengo arrestato, poi mi fermano perché passo con il rosso e mi becco l&#x27;ergastolo. Che senso ha? Lo sapete solo voi.\n\nEra un commento farcito di critiche distruttive, insulti e messaggi di incitamento all'odio, il tutto dopo in un thread dove il primo messaggio di un moderatore diceva di essere costruttivi. Visti i suoi trascorsi siamo stati in 3 a optare per il permanent, quindi nessun vittimismo, per favore.","replies":[]},{"poster":"Frattaglia","date":"2017-11-20T17:25:16.443+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Ste the ripper,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=000700000000,timestamp=2017-11-20T17:20:07.895+0000)\n>\n> Bene, se volevi permabannarlo potevi farlo in quel commento, non lo fate in un commento a caso successivo perché vi eravate dimenticati prima.\n> Io ho letto cosa aveva scritto e trovo davvero ridicolo questo perma, ma è il vostro modus operandi, ancora una volta dimostrate inefficienza e inettitudine: prima dimenticate di sanzionare quando è giusto sanzionare ( ti credo sulla parola perché il commento da te linkato o è editato o non è da sanzionare) e poi date la stangata doppia in un commento successivo.\n> Un po&#x27; come se io facessi un omicidio, non vengo arrestato, poi mi fermano perché passo con il rosso e mi becco l&#x27;ergastolo. Che senso ha? Lo sapete solo voi.\n\nMi cito perché forse non hai letto bene:\n\n> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=00070000,timestamp=2017-11-20T17:02:50.559+0000)\n>\n> (non ho seguito molto perché in quel periodo ero in ospedale, per questo potrei non ricordarmene bene)\n\nTi sembra sensato bannare qualcuno mesi dopo a caso, sempre se non me ne sono dimenticata?\nSeguivo e seguo quasi sempre le discussioni dal cellulare, e dal cellulare non ho accesso al tool di moderazione, ed è anche uno dei motivi per cui posto poco.\n\nPer il resto, non vado a contare la quantità di infrazioni che aveva precedenti ma ti assicuro che erano parecchie, di cui parecchie fatte unicamente per il gusto di farle. ","replies":[{"poster":"Ste the ripper","date":"2017-11-20T17:27:58.683+0000","up_votes":2,"down_votes":3,"body":"Cavoli vostri, siete 28 mod, se nessuno è in grado di sanzionarlo quando è ora fatevi delle domande, ma non tenete l'astio per 2 mesi per poi bannarlo al primo commento.\n\nChe poi se foste onesti togliereste pure la carica da mod a chi non segue per più di un mese, troppo facile stare via e poi tornare come se nulla fosse, perché anche se volontari questo è un lavoro e vi siete proposti voi di farlo. Fatelo seriamente.","replies":[{"poster":"Nibbio Bianco","date":"2017-11-20T17:36:02.024+0000","up_votes":2,"down_votes":5,"body":"> [{quoted}](name=Ste the ripper,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=00070000000000000000,timestamp=2017-11-20T17:27:58.683+0000)\n>\n> Cavoli vostri, siete 28 mod, se nessuno è in grado di sanzionarlo quando è ora fatevi delle domande, ma non tenete l&#x27;astio per 2 mesi per poi bannarlo al primo commento.\n> \n> Che poi se foste onesti togliereste pure la carica da mod a chi non segue per più di un mese, troppo facile stare via e poi tornare come se nulla fosse, perché anche se volontari questo è un lavoro e vi siete proposti voi di farlo. Fatelo seriamente.\n\nNoi non siamo moderatori noi siamo VOLONTARI e come indica la parola stessa ognuno fa quel che può col tempo che può. C'è gente che fin dall'inizio è arbitro e, purtroppo, non è mai uscita allo scoperto per via del ruolo andato in disuso, ci sono wrenchman e emissary che non hanno mai (credo) scritto un commento, ma questo non è un buon motivo per cacciarli, nel senso che a stare inattivi non danneggiano nessuno... se poi dovessero accettare saremmo sempre lieti a farli rientrare nel gruppo, così come, nonostante tutto, avremmo sempre una visione anche per far entrare qualcuno di nuovo.","replies":[{"poster":"kernel panic","date":"2017-11-21T06:24:35.390+0000","up_votes":3,"down_votes":0,"body":"Solo perchè siete volontari non è che avete diritto ad operare quando potete.\n\nSe avete deciso di prendervi questa responsabilità è vostro onere svolgere il compito nel miglior modo possibile.\n\nEssere volontari e quindi non reitribuiti, non vi scusa per le vostre eventuali mancanze. Per niente.","replies":[]},{"poster":"Ste the ripper","date":"2017-11-20T18:02:33.395+0000","up_votes":3,"down_votes":4,"body":"A me questo dimostra solo la poca serietà con cui prendete questo lavoro. Non vi è stato imposto, vedendo che non riuscivate a stare dietro al real e a questo una persona seria si sarebbe dimesso e un rioter serio avrebbe fatto in modo che il numero di mod attivi rimanesse sempre costante.\n\nEdit:\n\n> Noi non siamo moderatori noi siamo VOLONTARI \n\n> il tutto dopo in un thread dove il primo messaggio di un moderatore diceva di essere costruttivi\n\nSiete anche bipolari, siete moderatori quando vi fa comodo e volontari nel caso contrario.\nLo hai scritto 30 minuti fa, non 6 mesi fa lol\n\n","replies":[{"poster":"Frattaglia","date":"2017-11-20T18:05:41.256+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Ste the ripper,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=0007000000000000000000010000,timestamp=2017-11-20T18:02:33.395+0000)\n>\n> A me questo dimostra solo la poca serietà con cui prendete questo lavoro. Non vi è stato imposto, vedendo che non riuscivate a stare dietro al real e a questo una persona seria si sarebbe dimesso e un rioter serio avrebbe fatto in modo che il numero di mod attivi rimanesse sempre costante.\n\nHo già detto altrove che per la mia situazione personale sto valutando cosa fare, con la situazione attuale di riorganizzazione devo comunque aspettare di capire che succede.\nOra, la possiamo piantare di additare i volontari o vuoi trovare qualche altra caccola a cui attaccarti?\nTra l'altro abbiamo già chiarito che gli emissari non sono unicamente i moderatori del forum, ma si occupano di fare anche altro, aiutano nelle fiere, etc.\n\np.s. si, si può essere un moderatore volontario. Certo stare sul forum non mi paga il mutuo di casa.","replies":[]}]}]}]}]}]}]}]},{"poster":"Ste the ripper","date":"2017-11-20T12:28:59.701+0000","up_votes":6,"down_votes":4,"body":"Ne è valsa la pena?\nTrovo davvero triste che vi siate inimicati molti dei vostri vecchi amici per i poteri da moderatore in uno schifosissimo forum che ora state procedendo pure a distruggere.\n\nle vostre porcherie sono sotto gli occhi di tutti, negli ultimi 2 anni vi siete presi solo insulti sempre da gente diversa, forse non vi viene da farvi domande sul vostro operato? Tutto il forum è stato gestito con un dilettantismo e un menefreghismo esagerato sia da riot judge che da voi e ora che non c'è più nessun rioter a cui dovete far riferimento preparate pure un regolamento che a detta di risotto \"gli utenti rimpiangeranno di aver chiesto\".\nMa che scherzate? Guardate che voi dipendete dagli utenti, come vi permettete di minacciarli? Senza utenti non esiste il forum e trovo ironico che ormai voi stessi li vediate come nemici.\nAlla prima critica cercate sempre di nascondere tutto sotto il tappeto con regole stupide come quella dell'ot con bannaste anche me, chiudete i topic a caso come successo a me e a tera e ora permbannate.\nMa cosa vi tiene così attaccati a questo stupido ruolo che vi ha fruttato solo insulti? Vi sentite realizzati a pensare che magari avete avuto solo fallimenti  ma per lo meno siete i prestigiosi moderatori del forum italiano?\nBoh io al posto vostro vedendomi così odiato me ne sarei andato da un pezzo ( e infatti non sono più sul forum).\n\nOra bannate anche a me, tanto ormai è questo il modus operandi, non sapete accettare il fatto che non site tagliati per questo lavoro.\n\nEdit: che poi la cosa divertente è che anziché diminuire il flame è aumentato esponenzialmente ed ora è tutto diretto nei confronti vostri e della riot ( riot judge), quindi per assurdo siete pure riusciti a peggiorare la situazione.","replies":[{"poster":"Nibbio Bianco","date":"2017-11-20T13:36:10.104+0000","up_votes":2,"down_votes":9,"body":"> [{quoted}](name=Ste the ripper,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=0000,timestamp=2017-11-20T12:28:59.701+0000)\n>\n> Ne è valsa la pena?\n> Trovo davvero triste che vi siate inimicati molti dei vostri vecchi amici per i poteri da moderatore in uno schifosissimo forum che ora state procedendo pure a distruggere.\n> \n> le vostre porcherie sono sotto gli occhi di tutti, negli ultimi 2 anni vi siete presi solo insulti sempre da gente diversa, forse non vi viene da farvi domande sul vostro operato? Tutto il forum è stato gestito con un dilettantismo e un menefreghismo esagerato sia da riot judge che da voi e ora che non c&#x27;è più nessun rioter a cui dovete far riferimento preparate pure un regolamento che a detta di risotto &quot;gli utenti rimpiangeranno di aver chiesto&quot;.\n> Ma che scherzate? Guardate che voi dipendete dagli utenti, come vi permettete di minacciarli? Senza utenti non esiste il forum e trovo ironico che ormai voi stessi li vediate come nemici.\n> Alla prima critica cercate sempre di nascondere tutto sotto il tappeto con regole stupide come quella dell&#x27;ot con bannaste anche me, chiudete i topic a caso come successo a me e a tera e ora permbannate.\n> Ma cosa vi tiene così attaccati a questo stupido ruolo che vi ha fruttato solo insulti? Vi sentite realizzati a pensare che magari avete avuto solo fallimenti  ma per lo meno siete i prestigiosi moderatori del forum italiano?\n> Boh io al posto vostro vedendomi così odiato me ne sarei andato da un pezzo ( e infatti non sono più sul forum).\n> \n> Ora bannate anche a me, tanto ormai è questo il modus operandi, non sapete accettare il fatto che non site tagliati per questo lavoro.\n> \n> Edit: che poi la cosa divertente è che anziché diminuire il flame è aumentato esponenzialmente ed ora è tutto diretto nei confronti vostri e della riot ( riot judge), quindi per assurdo siete pure riusciti a peggiorare la situazione.\n\nChi si è sentito tirato in ballo dalla frase che ho scritto si deve porre qualche domanda. Io non giudico nessuno, siete voi che giudicare voi stessi.","replies":[{"poster":"HaIIeIujah","date":"2017-11-20T13:41:50.474+0000","up_votes":1,"down_votes":0,"body":"Quale sarebbe la frase che hai detto, dato che mi sono perso lo scambio?","replies":[{"poster":"Nibbio Bianco","date":"2017-11-20T13:45:16.688+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=HaIIeIujah,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=000000000000,timestamp=2017-11-20T13:41:50.474+0000)\n>\n> Quale sarebbe la frase che hai detto, dato che mi sono perso lo scambio?\n\n\"Regolamento: Appena uscirà rimpiangerete di avercelo chiesto.\"","replies":[{"poster":"HaIIeIujah","date":"2017-11-20T13:46:00.465+0000","up_votes":8,"down_votes":2,"body":"Quella suona al 100% come una minaccia, Nibbio.","replies":[{"poster":"GragasTheCatfish","date":"2017-11-20T18:01:39.877+0000","up_votes":2,"down_votes":0,"body":"se prima il forum serviva per farsi amici, divertire, condividere opinioni, fanart oppure chiedere consigli adesso è diventato solo una montagna di flame senza senso. non ho mai visto così attrito tra i moderatori e utenti da quando sono sul forum. prima c'era un rapporto di amicizia adesso si sta perdendo questo clima.","replies":[]}]}]}]}]},{"poster":"Power Mac","date":"2017-11-20T15:19:05.807+0000","up_votes":1,"down_votes":1,"body":"Dopo aver letto e visto abbastanza, pur essendo partito con un certo favor moderatoris in testa, sono giunto alla conclusione che il modus operandi della maggior parte di loro si possa riassumere nella nota frase \"Molti nemici, molto onore\".","replies":[{"poster":"Dantazzo","date":"2017-11-20T15:23:32.879+0000","up_votes":2,"down_votes":1,"body":"Il nostro è \"primi a caricare, primi a cadere\" :D","replies":[]}]}]},{"poster":"Easlay","date":"2017-11-21T00:45:25.404+0000","up_votes":4,"down_votes":0,"body":"avevo scritto un wall of text enorme, e per 3, TRE volte mi si è refreshata la pagina, mannaggiapelor!\nnon starò a riscrivere per la quarta volta, riassumerò dicendo solo un paio di cose:\n\nsono stato mod su wowis dove c'era molto più flame e utenza che qui, e bannare per un \"faggot\" che può avere significati totalmente opposti tra di loro è nosense; va contestualizzato nel dove viene usato, tralasciando che in Italia 99/100 manco sanno che vuol dire e lo usano con tutt'altro significato.\nMa detto ciò, se xavi (col quale mai avuto problemi, anzi..ci ho giocato/scherzato spesso) avesse rotto le palle anche me mod tramite pm, ogni due per tre, con insulti su insulti, lo avrei bannato; tuttavia, magari, e dico MAGARI, prima avrei cercato un dialogo per capire il perchè di questo atteggiamento, non mi sarei arroccato sulla difensiva, specie in un clima dove la separazione è nettà in due sponde: utenza vs mod.\n\nOra, non darei però la colpa al corpo mod per QUESTO particolar problema, almeno non direttamente: il problema è che il forum è un mortorio, il che porta a sfociare il malcontento sull'unica figura di \"riferimento\" che a sua volta entra nel circolo vizioso di stressarsi sempre di più e finire per alimentare il malcontento. Ma ciò è, a mio avviso, tutta una conseguenza del problema iniziale.\nPerò ragazzi, ciò non vuol dire che si può flammare/che altro a iosa senza conseguenze, il regolamento cmq sempre li è, anche se il clima creato porta all'esasperazione e una maggior inflessibilità, e ciò che prima era ok ora è diventato tabù.\n\nMa la colpa imho, è nel progetto emissary; ora, io ricordo che inizialmente era ben più della mera moderazione del forum, e a parte fratta con la quale son sempre stato in buoni rapporti (e forse nibbio se è ilrisotto) ignoro completamente chi ci sia dentro, quindi non prendetela sul personale, però fermatevi due secondi a guardare il forum: è un mortorio, ciò vuol dire che il sistema non ha funzionato / non funziona.\nVuoi per colpa della assenza della Riot (che imho fa tantissimo), vuoi perchè non avete tempo (si siete volontari, ma il tempo è ciò che si chiedeva, se non si ha si molla, non muore nessuno), vuoi anche perchè la maggior parte degli italiani si è lobotomizzata su moba con terenas/paolocannone/italiandog, ma la sensazione che traspare è quella, specie guardando la board NA; non c'è nulla che fa intendere che facciate qualcosa per ravvivare l'attenzione ne sul forum, ne altrove.\nE ripeto, non sto puntando il dito su di voi nello specifico (ma siete parte della causa, non si può scappare, la vostra parte è assente a sua volta o cmq non ha funzionato), ma le tante cose assieme fan trasparire questo: un forum che se prima era semi-morente ora è messo anche peggio, quindi sarebbe da farsi un paio di domande sia sul modus operandi, sia sull'utilità del ruolo stesso a questo punto della storia.\n\n\nè un riassunto, magari qualcosa risulterà meno connesso di altre cose perchè son quasi le 2 e non avevo voglia di riscrivere per intero per la quarta volta tutto quanto, ma il senso spero sia chiaro.","replies":[]},{"poster":"Dr LouD","date":"2017-11-20T12:31:34.378+0000","up_votes":6,"down_votes":2,"body":"Il mio interesse per la community è morto un bel po di tempo fa","replies":[{"poster":"Laiho88","date":"2017-11-20T12:52:46.055+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=0001,timestamp=2017-11-20T12:31:34.378+0000)\n>\n> Il mio interesse per la community è morto un bel po di tempo fa\n\nIdem, loggo solo per quotare, oramai è solo un forum per attaccare qualsiasi utente alla minima occasione....","replies":[]}]},{"poster":"UltraLion","date":"2017-11-20T13:43:05.530+0000","up_votes":4,"down_votes":2,"body":"Be grazie per la considerazione, nessuno pensa alla presenza di UltraLion.... lol\nCazzate a parte, se gli unici nomi da ricordare sono quelli di 3 utenti bannati, non avete bisogno di questo forum, vi basta vedervi in game o farvi un gruppo whatsapp con queste persone, non lo sto dicendo per flammerare a caso, mi sembra solo più logico e funzionale a ciò che volete\nSe invece amate stare su un forum dove ci sono molte più persone, potete sempre rilanciarlo aprendo nuove discussioni, ed interagendo di più con altri utenti.","replies":[{"poster":"Dantazzo","date":"2017-11-20T14:03:07.183+0000","up_votes":1,"down_votes":0,"body":"In realtà solo xavi è stato bannato, gli altri hanno solo perso interesse. Già ci giochiamo assieme e simili, ed è proprio grazie a questo forum che ci siamo conosciuti, e come io personalmente ho conosciuto e mi sono fatto conoscere negli anni da tutti. Sinceramente non ne ho più la voglia di provare a recuperarlo.","replies":[{"poster":"UltraLion","date":"2017-11-20T14:23:02.241+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Dantazzo,realm=EUW,application-id=MJVj50Jw,discussion-id=xaG9dyZe,comment-id=00040000,timestamp=2017-11-20T14:03:07.183+0000)\n>\n> In realtà solo xavi è stato bannato, gli altri hanno solo perso interesse. Già ci giochiamo assieme e simili, ed è proprio grazie a questo forum che ci siamo conosciuti, e come io personalmente ho conosciuto e mi sono fatto conoscere negli anni da tutti. Sinceramente non ne ho più la voglia di provare a recuperarlo.\n\nSe è un'ambiente che ti piace, non devi lasciarlo per via di moderatori non graditi, usatelo come meglio credete, i ban non penso siano eterni, e forse nemmeno i moderatori, se davvero siete nel giusto e venite bannati, scrivete alla riot tramite il supporto, perchè il problema fondamentale qua è solo che non esiste un regolamento imposto dalla Riot stessa.","replies":[]}]}]}]}