{"poster":"Dantazzo","date":"2015-07-30T07:22:07.611+0000","title":"Insulti e flammate memorabili","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Ciao a tutti, quali sono stati gli insulti e le flammate pi&ugrave; memorabili che avete sentito nella landa? Intendo quel genere di insulti che vi hanno strappato un sorriso, o che nonostante fossero rivolti a voi (o fatti da voi) vi abbiano ammazzato dalle risate?\r\nIo ne ho un paio che mi ricordo:\r\nPersonalizzata tra amici, Pantheon entra in un cespuglio dal quale &egrave; appena uscito il Donger, il cespuglio era ovviamente farcito di torrete, Pantheon ci entra e muore, in seguito in chat comparve la scritta &quot;Ma cazzo ti ha baitato peggio di un {{champion:236}}  in un campo di cotone, pensavi di trovarci le margheritine in quel cespuglio?&quot;\r\nIl secondo che mi ricordo &egrave; mio ed &egrave; stato rivolto ad il solito pirla che stava 0/tanto/0 e continuava a flammare, &egrave; stata una cosa del tipo &quot;i bet your mom wishes she had swallowed you&quot; (cit). Per chi non masticasse l&#039;inglese la traduzione &egrave; &quot;Scommetto che tua madre avrebbe preferito ingoiarti&quot;.\r\nQuali sono state le flammate pi&ugrave; epiche a cui avete assistito?","replies":[{"poster":"Vileblood Pyke","date":"2015-07-30T12:28:41.037+0000","up_votes":6,"down_votes":0,"body":"\"easy\" - CommonDotaPlayer, after 61min match","replies":[{"poster":"miki2212","date":"2015-07-30T14:14:36.124+0000","up_votes":1,"down_votes":0,"body":"AHAHAHAHAHAH hai vinto xD","replies":[]}]},{"poster":"Dantazzo","date":"2015-08-03T08:27:33.143+0000","up_votes":2,"down_votes":0,"body":"\"Sei come Forrset Gump senza la parte del correre\" \n\"E quindi che sarei?\"\n\"In pratica un ritardato\"","replies":[]},{"poster":"Sorcio84","date":"2015-07-30T11:26:26.886+0000","up_votes":2,"down_votes":0,"body":"io non flammo, scrivo boiate incredibili, e a volte ne escono di epiche.\n\n{{champion:55}} pulisce tutte le lane , ninja le kill a tutti, e non pusha\nomg kata go diet you fat like a wrecking ball, stop taking my sandwich\n\n{{champion:11}} si frega tutti i campi della giungla\nyi come here COME HERE YOU THIEF, giv me bak moni from my jungle, GIV MONI NOW or i report ya\n\nio support {{champion:25}} con {{champion:67}} contro {{champion:201}} {{champion:104}} \n{{champion:201}} avversario pesta la torre perdendo vita a nastro mentre {{champion:67}} corre dietro a {{champion:104}} . tiro un last hit e prendo una kill sotto torre. ovviamente vayne inizia a flammarmi.\n\nio : braum was on our tower hug, your were running after graves for nothing. you jealous coz i took the BEST man of the two, gnè gnè\n\ne tanto altro :P","replies":[]},{"poster":"IST Dima123","date":"2015-07-30T07:32:15.839+0000","up_votes":2,"down_votes":0,"body":"le mie xD","replies":[]},{"poster":"LionHeartV","date":"2015-08-03T09:20:14.534+0000","up_votes":1,"down_votes":0,"body":"mi ricordo di un vladimir che inslutava il jungler chiamandolo \"DIRTY MUSLIM\"","replies":[]},{"poster":"Nibbio Bianco","date":"2015-08-03T08:34:40.549+0000","up_votes":1,"down_votes":0,"body":"Ero sul ts con un mio amico rumeno che stava inseguendo un warwick\n\"VIENI VORVIC, VIEEENIIII\"\nWarwick is legendary. \n\"STU MERDILOOOOOOOOOOOOOOOOOOOOOOOOOOOO\"","replies":[]},{"poster":"miki2212","date":"2015-07-30T14:23:12.854+0000","up_votes":1,"down_votes":0,"body":"ricordo una volta in cui mi sono trovato un duo top, un gp e un darius. Io ero fiora top, a nove minuti stavo 11/0. Mi sono arrivati dietro i peggio insulti su quanto fosse op-noob champ fiora da quei due ed io alla fine non riuscivo nemmeno a roammare, volevo stare a killarli  proprio per sentirli flammare.....quel game è stata una cosa bellissima xD. Oppure un'altra volta, abbastanza recente (si va offtopic amici yeee) in cui starto una bot e vado mid cassiopea. Una ashe prende adc e un braum va supp. uno locka kalista, ma dice \"top\". Iniziamo il game e kalista va bot, ma solo per prendersi una doppia e dare gli assist appunto all'adc e al support. Braum scrive in chat \"go away, don't ks our lane\" e io gli rispondo \"come on, just a bot game, no one care about ks\". Quel braum ha passato un quarto d'ora a inventare storie SENZA SENSO, ma io continuavo a rispondergli perch stavo morendo dalle risate xD.","replies":[]},{"poster":"Capoz","date":"2015-07-30T12:26:33.476+0000","up_votes":1,"down_votes":0,"body":"Non erano proprio flammate:\nIn ranked ero xin jungle e c'era ez mid nemico che mi bestemmiava dietro;\nA volte per caso, altre per istigarlo ulteriormente, ma facevo le azioni giuste sempre dove c'era lui e scriveva \"YOU HACKER, YOU ALWAYS KNOW WHERE I AM, YOU HACKER, I REPORT YOU NOOB HACKER!!!! BABYSIT + HACK!\"\ne ogni volta che facevo un'azione che ne counterava una sua \"SEEEEE????? HE KNOWS WHERE I WAS!!!! HE CHEAT!!!!!!!!!\" xD","replies":[]}]}