{"poster":"ePiCIKiYoshi","date":"2017-12-09T01:42:21.955+0000","title":"Neue Datenschutzgrundverordnung und Riot","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Guten Abend,\n\nich h&auml;tte da mal eine Frage bzg der neuen Datenschutzgrundverordnung welche EU Weit n&auml;chstes Jahr in Kraft tritt:\n\nLaut dieser neuen Verordnung, haben wir dann das Recht zu Nachfragen zu d&uuml;rfen was mit unseren Daten gemacht wird, und haben noch dazu erweiterte Rechte sobald diese &uuml;ber ein autmatisiertes System (Profiling) erfolgen.\n\nBasierend auf diesem Wissen, hei&szlig;t dann, dass alle EU Spieler auskunft dar&uuml;ber verlangen d&uuml;rfen wie Ihre Daten genaustens verarbeitet werden.\nDa stellt sich mir dann die Frage: Nachdem ich bei der Erstellung meines LoL Accounts Meinen Namen + Geburtsdatum eingeben musste, darf ich dann eigentlich aufkl&auml;rung &uuml;ber das GESAMTE Profiling System welches bei Riot games mit 90%er Warscheinlichkeit auch das Ban System, Honor System, usw. betrifft. verlangen und muss es auch bekommen.\nSehe ich das richtig?\nIch bin kein IT Rechtsexperte, aber sobald meine Daten wie Name oder Geburtsdatum bei dem Profiling mit geht, habe ich doch Anspruch darauf mehr &uuml;ber die automatische Datenerfassung und verarbeitung zu wissen welche im Hintergrund geschieht oder?","replies":[{"poster":"ePiCIKiYoshi","date":"2017-12-09T02:04:38.837+0000","up_votes":1,"down_votes":0,"body":"Das ich jederzeit Auskunft über meine Accountdaten verlangen kann. Was hab ich davon naja ganz einfach: nehmen wir mal an du flamest in nem match und weißt dann nicht wie du dran bist, kannste einfach hergehen und punkt genau fragen: Wieviele Reports habe ich in diesem Zeitraum bekommen, welche auswirkungen hatte dies auf mein Honorlvl im Sinne von wie Hoch ist meine Honorpunktezahl derzeit, usw. usw.\nGenauso wie bei nem Ban den du kassierst weil du gegen Nutzungsbedingungen usw. verstoßen hast. Sie müssen dir Auskunft darüber geben warum wieso und das dann auch noch genau erklären.","replies":[{"poster":"Enderized","date":"2017-12-09T02:42:23.132+0000","up_votes":3,"down_votes":0,"body":"Ich wüsste nicht was der Datenschutz mit derart Regelverstößen zu tun hätte :D\n\nDie Rechte zu Erfahren was mit deinen Daten geschiet ist im Bezug auf Verwendung in zB Handel an 3. zurückzuführen und nicht um deinen Accountstatus abzufragen.\n\nDas System dahinter ist nämlich schon so transparent wie es nur geht:\nDu hälst dich oft nicht an Regeln =》du wirst gesperrt.\n\nEin wirkliches Profiling besteht nicht und schon gar nicht im Zsh. mit deinem Geburtsdatum in dessen Feld du ja einstellen könntest was du wolltest.\nEs geht lediglich um die Frage: Was schreibst du in den Chat und finden sich Teile davon in den Strafkatalog wieder.\n\n\nRiot würde schon aufgrund der Tatsache, dass das System zukünftig ebenso funktional sein soll wie heute, eh keineb derartigen Einblick in das Instant Feedback System gewähren, denn sonst könnten bald Leute tun was sie wollen ohne dafür bestraft zu werden, da diese wissen würden wie das System funktioniert.\n\n(Aus dem Grund werden auch u.a. 3rd Party Tools immer nur in Wellen und nicht instant gebannt)","replies":[{"poster":"eingew","date":"2017-12-09T12:30:50.031+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheOrnnandOnly,realm=EUW,application-id=7hciEY9w,discussion-id=yBsm8Fac,comment-id=00010000,timestamp=2017-12-09T02:42:23.132+0000)\n>\n> Ich wüsste nicht was der Datenschutz mit derart Regelverstößen zu tun hätte :D\n\nGehört aber scheinbar dazu. Wie Sidia bereits geschrieben hat, eine Zusammenfassung der verteilten und erhaltenen Reports kann man (neben weiteren Informationen) gegen eine Gebühr von 5$ (+ Porto) abfragen, [hier](http://privacy.riotgames.com/en_US/stage2).\n\n> Es geht lediglich um die Frage: Was schreibst du in den Chat und finden sich Teile davon in den Strafkatalog wieder.\n> \n> Riot würde schon aufgrund der Tatsache, dass das System zukünftig ebenso funktional sein soll wie heute, eh keineb derartigen Einblick in das Instant Feedback System gewähren, denn sonst könnten bald Leute tun was sie wollen ohne dafür bestraft zu werden, da diese wissen würden wie das System funktioniert.\n\nDa hast du völlig recht, allerdings gehören auch die Chatlogs der letzten drei Monate zu eben diesen privaten Informationen, die man bei Riot abfragen kann.\n\nDie Seite ist afaik eine Reaktion auf die europäischen Datenschutzgesetze. Riot gibt uns diesen Zugriff, weil sie dazu bereits jetzt gesetzlich verpflichtet sind (jedenfalls je nach Region).","replies":[]}]}]},{"poster":"Sidia","date":"2017-12-09T11:55:52.444+0000","up_votes":2,"down_votes":0,"body":"Du darfst alle Daten die Relevant zu deinem Account sind anfragen, das geht bereits, du bekommst dann auch alle Reports die du erhalten hast aufgelistet.\nAnfragen kannst du dies über: https://privacy.riotgames.com\nAlle Daten wie deine versteckte MMR müssen nicht herausgegeben werden weil diese nichts mit deinen persönlichen Daten zu tun haben (Alter, Geburtsdatum, Name etc)\n\nMit freundlichen Grüßen\nSidia","replies":[{"poster":"ePiCIKiYoshi","date":"2017-12-09T16:24:08.999+0000","up_votes":1,"down_votes":0,"body":"Da warte ich lieber noch bis Mai, dann kann ich eben genau diese Infos gratis beziehen. Aber wie ich finde schon recht nett zu wissen\n\n#Edited: Von März auf Mai","replies":[]}]},{"poster":"hi im seb","date":"2017-12-09T10:19:00.178+0000","up_votes":2,"down_votes":0,"body":"Ich meine das das dann auch die API beinhaltet, folglich also auch Spielzeit etc, welche ja derzeit zurückgehalten wird. Würd mich freuen diese vllt hierüber wieder einsehen zu können, auch wenn das wahrscheinlich ein Wunsch bleiben wird :D","replies":[]},{"poster":"Alustus","date":"2017-12-09T05:31:01.736+0000","up_votes":2,"down_votes":0,"body":"Ich denke sie müssen dir sagen welche Daten erhoben werden und wozu sie verwendet werden.\nDas heißt aber nicht, dass sie bis ins kleinste Detail sagen müssen wie das System genau funktioniert.\n\nUnd die groben Rahmenbedinungen für das Honor und Bannsystem kennen wir ja.\n\nDas Gesetz ziehlt eher darauf ab zu erfahren welche Daten erhoben werden und was für auswirkungen das hat.\nDamit man beispielsweise Dinge wie z.B.: bei der US wahl verhindern/überprüfen kann.(gezielte Themen/werbungen/Artikel zu bestimmten Menschen schicken damit man ihre Meinung verändert)\nBzw. Generell Daten die zu uns als Reale Personen erhoben werden, da das Internet teilweise mehr über uns weiß als wir selber.\n(Durch einkaufsverhalten Schwangerschfaten festgestellt bevor es die Schwangere Person selber wusste usw.) und was mit diesen Daten geschieht.\n(Banken usw. im bezug auf Kreditwürdigkeit, benutzerspezifische Preise(gibt es schon)....)","replies":[{"poster":"ePiCIKiYoshi","date":"2017-12-09T10:12:16.086+0000","up_votes":1,"down_votes":0,"body":"Ich ziehe kurz einen Auszug daraus:\nDarunter versteht die DSGVO jede Art der automatisierten Verarbeitung personenbezogener Daten, die darin besteht, dass diese personenbezogenen Daten verwendet werden, um bestimmte persönliche Aspekte, die sich auf eine natürliche Person beziehen, zu bewerten, insbesondere um Aspekte bezüglich Arbeitsleistung, wirtschaftliche Lage, Gesundheit, persönliche Vorlieben, Interessen, Zuverlässigkeit, Verhalten, Aufenthaltsort oder Ortswechsel dieser natürlichen Person zu analysieren oder vorherzusagen.\n\nDas Profiling unterliegt den Vorschriften der DSGVO, wie etwa der Rechtsgrundlage für die Verarbeitung, den Datenschutzgrundsätzen, der Informations- und Auskunftspflicht und besonderen Regeln, wenn damit eine automatische Generierung von Einzelentscheidungen verbunden ist.\n\n\nUnd ich denke schon, dass Riot in diesem Sinne profiling betreibt. Aus diesem würde ich folgendes Ableiten, unsere Personenbezogenen Daten(Name und Geburtsdatum und warsch last seen by IP Location) sind warsch hinter einer Profile ID hinterlegt. Somit wird diese ID in deren System zu all deinen Personenbezogenen Daten. Falls Riot nun Profiling im Sinne von, eigenen Leistungsbewertungen, \"Gut\" Punkte, \"Böse\" Punkte, usw. (mir fällt grade nicht noch mehr ein was ich profilen könnte außer das Skin kaufverhalten). Dann sollte man eigentlich auch über das Auskunft erhalten dürfen, da es eben wie gesagt unter diese neue Regelung fällt oder verstehe ich das falsch?","replies":[{"poster":"MeMyselfandBaal","date":"2017-12-09T13:50:12.616+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ePiCIKiYoshi,realm=EUW,application-id=7hciEY9w,discussion-id=yBsm8Fac,comment-id=00030000,timestamp=2017-12-09T10:12:16.086+0000)\n>\n> Ich ziehe kurz einen Auszug daraus:\n> Darunter versteht die DSGVO jede Art der automatisierten Verarbeitung personenbezogener Daten, die darin besteht, dass diese personenbezogenen Daten verwendet werden, um bestimmte persönliche Aspekte, die sich auf eine natürliche Person beziehen, zu bewerten, insbesondere um Aspekte bezüglich Arbeitsleistung, wirtschaftliche Lage, Gesundheit, persönliche Vorlieben, Interessen, Zuverlässigkeit, Verhalten, Aufenthaltsort oder Ortswechsel dieser natürlichen Person zu analysieren oder vorherzusagen.\n> \n> Das Profiling unterliegt den Vorschriften der DSGVO, wie etwa der Rechtsgrundlage für die Verarbeitung, den Datenschutzgrundsätzen, der Informations- und Auskunftspflicht und besonderen Regeln, wenn damit eine automatische Generierung von Einzelentscheidungen verbunden ist.\n> \n> \n> Und ich denke schon, dass Riot in diesem Sinne profiling betreibt. Aus diesem würde ich folgendes Ableiten, unsere Personenbezogenen Daten(Name und Geburtsdatum und warsch last seen by IP Location) sind warsch hinter einer Profile ID hinterlegt. Somit wird diese ID in deren System zu all deinen Personenbezogenen Daten. Falls Riot nun Profiling im Sinne von, eigenen Leistungsbewertungen, &quot;Gut&quot; Punkte, &quot;Böse&quot; Punkte, usw. (mir fällt grade nicht noch mehr ein was ich profilen könnte außer das Skin kaufverhalten). Dann sollte man eigentlich auch über das Auskunft erhalten dürfen, da es eben wie gesagt unter diese neue Regelung fällt oder verstehe ich das falsch?\n\nJa... aber... die Frage ist: Was hast du davon, wenn die Nutzung der Daten im Falle eines Bannes so derart eindeutig ist. Also Riot schickt dir dann nochmal deine Chatlogs für die Spiele, in denen du reported worden bist und teilt dir mit, dass diese Chatlogs jetzt der Chatanalyse hinzugefügt wurden. Warum? Damit die dazu lernt. Und ja, die Daten werden gesammelt und es werden Profile erstellt. Aber der Zweck ist erschreckend eindeutig: Man will erkennen, was toxisch ist und gebannt werden soll.\nWas macht Riot sonst mit diesen Daten? Vielleicht gibt es irgendwo einen Fetischisten, der sich toxische Chatlogs kauft... an sonsten kann man damit wohl eher weniger anfangen.\n\nMit dem neuen Gesetz kannst du jetzt natürlich Riot fragen, was sie mit den von dir angegebenen Daten wollen... die wahrscheinliche Antwort: Deinen Account im Zweifelsfall verifizieren. Das wird zumindest ihre Antwort sein. Aber ganz ehrlich... meinen Namen und Geburtstag kennen so viele Leute... Riot hat ja noch nicht mal meine Adresse... Da werden mich andere verraten.\n\nDie wirklich spannende Frage ist ja: Erstellt Riot eigentlich anhand unserer Skin-Sammlungen Profile und verscherbelt die dann... also... wenn du dir haufenweise VelKoz und Illaoi Skins kaufst, findest du dann demnächst Hentai Angebote in deinem Postfach... Hey, immerhin kannst du dann deiner Mutter erklären, wo die herkommen... \n\nJetzt muss ich natürlich erst Mal meine Skinsammlung durchforsten und mich fragen, wie ich den Riot Profiler am effekivsten verwirren kann...","replies":[]}]}]},{"poster":"Gwadon","date":"2017-12-09T09:27:05.884+0000","up_votes":1,"down_votes":0,"body":"Du kannst einige Infos über deinen Account anfordern ( Geld ausgegeben, Zeit gespielt, Chatlogs, Reports, IPs über die dein Account genutzt wurde, ect. ) dies kostet dich allerdings 5$ und du musst einen Brief an Riot schicken. Hier der Offizielle Link: https://privacy.riotgames.com/de/","replies":[]},{"poster":"Rudeltreiber","date":"2017-12-09T02:16:11.702+0000","up_votes":1,"down_votes":3,"body":"So ein Quatsch x) benimm dich halt, dann brauchst weder deine noch die Zeit der Mitarbeiter zu verschwenden. Die haben wohl besseres zu tun als nem toxic kiddie hinterherzurennen.","replies":[{"poster":"Roxãs","date":"2017-12-09T06:47:39.001+0000","up_votes":2,"down_votes":0,"body":"Hatte jetzt irgendwie nichts damit zutun was der TE wollte.","replies":[]},{"poster":"ePiCIKiYoshi","date":"2017-12-09T09:59:41.031+0000","up_votes":1,"down_votes":0,"body":"Ich bin kein toxic kiddie, ich würde lediglich die Rechte die mir die EU gibt(oft passierts ja nicht) nutzen.","replies":[]}]},{"poster":"Rudeltreiber","date":"2017-12-09T01:50:17.433+0000","up_votes":1,"down_votes":2,"body":"Wen juckt's? Was hast du dann davon?","replies":[]}]}