{"poster":"TheGrayTea","date":"2015-08-28T22:52:48.271+0000","title":"Proposta campione:  Rayn, il custode del mana","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Rayn, il custode del mana\r\n\r\nRUOLO:\r\nTiratore/assassino\r\nAttacco:⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙\r\nAbilit&agrave;:⊙⊙\r\nDifesa:⊙\r\n\r\nSKILLS:\r\nPassiva:\r\nDono della fonte&nbsp;\r\n\r\nRayn non pu&ograve; infliggere critici.\r\nOgni terzo attacco infligge il 6,5% +(0,5% x lvl) della vita max del bersaglio come danni magici bonus ad area\r\n\r\nQ&nbsp;\r\nSigillo\r\n\r\nCD:10/9.5/9/8.5/8 sec\r\nRange: 1250\r\nRayn lancia un kunai con un sigillo che danneggia tutti i nemici attraverso cui passa e si ferma al primo campione colpito, marchiandolo e infliggendo i danni. (30/45/60/75/80 + 100%AD + 2.5% mana max)\r\nIl marchio si attiva dopo 2 secondi, silenziando per 2 secondi il campione.\r\nSe il bersaglio mentre &egrave; marcato subisce un attacco potenziato dalla passiva il marchio&nbsp;esplode immediatamente stordendolo per la met&agrave; del tempo.\r\n\r\nW\r\nScatto cinereo\r\n\r\nCD: 14/13/12/11/10 sec\r\nRange:400\r\nCompie uno scatto verso la posizione bersaglio. Il prossimo attacco base colpir&agrave; due volte. Il secondo colpo non infligge danni ma applica gli effetti sul colpo\r\nGli attacchi base riducono la ricarica di 1 secondo.\r\n\r\nE&nbsp;\r\nFurto dello spirito\r\n\r\nCD: 15 sec\r\nRange: 1000\r\nRuba una parte della velocit&agrave; di movimento dell ultimo bersaglio attaccato per 2,5 sec, pari al 25/27.5/30/32.5/35%\r\n\r\nR\r\nLeggenda della sorgente\r\n\r\nPassiva: Gli attacchi base infliggono il 5/7.5/10% del mana massimo come danni puri sul colpo.\r\nRayn pu&ograve; comprare un solo oggetto che conferisce mana.\r\nAttiva: Raddoppia i danni passivi dell ultimate per 8/9/10 sec, e la passiva si attiva ogni 2 attacchi, anzich&eacute; 3\r\n\r\n\r\nLORE:&nbsp;\r\n\r\nLe leggende di Valoran narrano delle pi&ugrave; disparate vicende e dei pi&ugrave; valorosi eroi, di misteri sepolti sotto le sabbie e dei loro&nbsp;custodi millenari.\r\nTuttavia quella che sto per raccontarvi non &egrave; una leggenda, e nemmeno una storia per bambini. &Egrave; la verit&agrave;.\r\nSi dice che nelle foreste del Nord, che fanno da confine con il frejlord, si nasconda una fonte. Gli abitanti del posto si riferiscono ad essa con nomi diversi, vi &egrave; chi la chiama sorgente della vita, chi fonte della eterna giovinezza, ma ci&ograve; che essa contiene non &egrave; noto a nessuno. Nessuno tranne Rayn.\r\nProbabilmente millenario, ma con l aspetto di un ragazzo dai bianchi capelli e occhi cobalto, il custode sorveglia la fonte sin dalla notte dei tempi, quando una dea rivers&oacute; le sue lacrime sulla terra creando cos&igrave; quella che i pi&ugrave; oggi conoscono come Fonte del Mana.&nbsp;\r\n\r\n\r\nASPETTO E GAMEPLAY:\r\n\r\nRayn &egrave; un tiratore incentrato sul mana, che paga la sua debolezza in linea e nelle prime fasi di gioco con un late game devastante, grazie ai danni puri e alla passiva. Sebbene sia provvisto di danni elevati e una discreta capacit&agrave; di kiting manca totalmente di qualsiasi forma di resistenza, che fa di lui carne da macello se preso fuori posizione.\r\nRayn &egrave; un tiratore inusuale, in quanto non pu&ograve; infliggere critici, ma grazie alla sinergia con item quali muramana o botrk riesce comunque a mantenere o a superare lo standard di danni di un adc per il late.\r\nPer quanto riguarda l&#039; aspetto si presenta come un ragazzo sui 17 anni, dai capelli bianchi e occhi cobalto, che risaltano su una carnagione pallida. Indossa una tunica bianca con ricami blu scuro, e come armi utilizza dei kunai simili a quello che si vede nell&#039; art della muramana.\r\n\r\nSpero vi piaccia, e che in numerosi commentiate, anche con critiche, se costruttive. :3","replies":[{"poster":"Samel Seifer","date":"2015-08-29T22:48:06.597+0000","up_votes":2,"down_votes":0,"body":"Mi piace:\n- La storia\n- Le meccaniche\n\nNon mi piace:\n- L'aspetto del personaggio: ma solo perchè è praticamente uguale a quello che proposi io nel vecchio forum {{champion:35}} \n- \"E - Furto dello spirito\": diversità dei campioni {{champion:54}} \n\nDa rivedere gli scales e i valori base.\n\n{{champion:99}} \"Decisione tattica, evocatore\"","replies":[]},{"poster":"Oinegue","date":"2015-08-28T23:50:10.742+0000","up_votes":2,"down_votes":1,"body":"Sgravo, e la limitazione del singolo oggettoche da mana non ha senso, tantovale abbassargli gli sclales","replies":[]},{"poster":"Tr0nt0n","date":"2015-08-30T06:14:25.313+0000","up_votes":1,"down_votes":0,"body":"Si chiama custode del mana > può custodire massimo un oggetto di mana.\nQuesta è la parte che non ha senso, secondo me. Anche il fatto che non possa fare critici  non è tanto coerente: è pur sempre un assassino, io farei una cosa che i danni critici ci siano ma facciano solo il 110% dei danni e gli attacchi base facciano il 90% dei danni (come Kalista, insomma)","replies":[]},{"poster":"Neon Flamingo","date":"2015-08-28T23:47:57.228+0000","up_votes":1,"down_votes":0,"body":"Secondo me il fatto che non può avere critici, e che può comprare solo un oggetto mana va oltre gli standard del gioco e per di più sono troppo esagerati, poi come lo descrivi sembra quasi un ezreal,per il resto ggwp.","replies":[{"poster":"TheGrayTea","date":"2015-08-29T08:29:49.838+0000","up_votes":1,"down_votes":0,"body":"Bhe, in teoria per i critici non credo che sia un problema, visto che ad esempio yasuo riesce ad ottenere il doppio di critici chance, per la limitazione ad un unico oggetto era ideata perché volevo evitare che si ottenessero danni elevati senza buildare ad, ma oggetto tipo frozen heart o iceborn....\nComunque, sono d'accordo che gli scaling siano magari esagerati, ma volevano solo essere indicativi.\nPerché Ezreal? O.o\nGrazie per la risposta :3","replies":[]}]}]}