{"poster":"TheGrayTea","date":"2015-04-08T14:44:55.854+0000","title":"Aiutino da esperti <3","subforum":"Discussioni generali","up_votes":1,"down_votes":2,"body":"ATTENZIONE: CONTENUTO ABBASTANZA COMPLICATO^^\r\nAllora, prendiamo un rylai {{item:3116}}\r\nPoi prendiamo una liandry&#039; s torment{{item:3151}} \r\nInfine aggiungiamo un bel malzaharino{{champion:90}} \r\nA questo punto lanciamo la nostra bella E sul primo target che vediamo. Essa infligger&agrave; danni ogni 0.5 per 4 secondi, e in teoria applicando 8 volte l effetto passivo della liandry, potenziato dallo slow del rylai che quindi toglier&agrave;: ( considerate / come segno di ogni volta che si applica il danno magico della E e quindi anche della liandry e - come i secondi in cul la liandry infligger&agrave; i suoi normali danni.)\r\n/4%/4%/4%/4%/4%/4%/4%/4%-4%-2% della salute massima del bersaglio, per un totale del 42% della vita massima del bersaglio + i danni base. (l ultimo &egrave; un 2% perch&eacute; il bersaglio non sar&agrave; pi&ugrave; slowato dal rylai)\r\nSe quest a cosa funzionasse, e non vedo perch&eacute; non dovrebbe, in quanto sembra tutto perfettamente logico , non sarebbe un po&#039; OP come cosa?\r\nSpero di Non avervi mandato in pappa il cervello^^ \r\nBaci&lt;3","replies":[{"poster":"Ucr0niA","date":"2015-04-08T15:57:23.411+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=TheGrayTea,realm=EUW,application-id=MJVj50Jw,discussion-id=sGZtpfdE,comment-id=,timestamp=2015-04-08T14:44:55.854+0000)\n>\n> /4%/4%/4%/4%/4%/4%/4%/4%-4%-2% della salute massima del bersaglio, per un totale del 42% della vita massima del bersaglio\n\nhttp://media.giphy.com/media/cUzerNAgCft0A/giphy.gif\n\nE' il momento della nostra rubrica preferita:\n\n**LOLMATH MOMENT!**\n\nAllora, **quasi nessun calcolo percentuale del gioco stacca additivamente** (Ribadisco il quasi, le eccezzioni sono veramente pochissime e particolari); pertanto, pur considerando i vari contributi percentuali, il gioco tende a esplicare quanto questi non vadano considerati addizionabili a priori;\n\nEsempio:\n2xTogli 50% della vita= 100%?\n0%Vita rimanente?\nNO!\n\nCome funzionerebbe\n1)Togli 50%= 50%100=50\n2)Togli 50%= 50%50=25!\n25%vita rimanente\n\nNon ho fatto il calcolo sulle barre vita a caso, difatti è il più calzante, prendi ad esempio la \"lama del re in rovina\" {{item:3153}} ;\nEffetto: toglie l'8%della vita **attuale**\n\n1° colpo: 100-8%100= 100%-8%=92%\nVita residua: 92%\n2° colpo: 92-8%92= 92-7.36= 84.64%\nVita residua: 84.64%\nEtc...\n\nIl \"tormento di Liandry\" dice:\n_Abilità passiva UNICA: infliggere danni magici applica un effetto di danni nel tempo per 3 secondi che infligge danni magici bonus pari al 2% della salute del bersaglio (**intende attuale**) al secondo. Questi danni bonus raddoppiano contro le unità ostacolate con un limite di 100 danni al secondo contro i mostri._\n\nIn realtà però, sappiamo che i danni percentuali OT (over time), vengono letti dal gioco (per motivazioni che poi vedremo) a intervalli di 0,5 secondi; ciò è confermato dalla sua meccanica di funzionamento da wiki:\n> -  Mechanic\n> Liandry's Torment item.png Liandry's Torment ticks will tick 6 times at half second intervals. Each tick does 1% of enemy current health as magic damage. Damage from each tick is calculated individually. \n\n     Fonte: http://leagueoflegends.wikia.com/wiki/Liandry%27s_Torment\n\nCome vedi, non parla di 3 \"colpi\" da 2% per 3 secondi (uno al secondo), ma bensì di 6 attivazioni.\nNoterai come, anche la E di Malzahar è un danno OT, e si attiene a quanto detto, infatti il gioco recita:\n>     Magic damage per **half-second**: 10 / 17.5 / 25 / 32.5 / 40 (+ 10% AP) \n\n     Fonte: http://leagueoflegends.wikia.com/wiki/Malzahar\n\nOra, per quanto detto, a ogni sua attivazione, il gioco aggiorna il suo calcolo alla barra di vita in quell'istante, ciò fa si, che per intervalli di tempo minori, lo scarto percentuale è ancora più preciso, in un contesto ove invece, se si fosse attenuto a barre di vita precedenti la % sarebbe stata più alta.\n\nInoltre va detto, che i danni flat, si applicano prima dei danni percentuali, quindi, la passiva di Liandry, procca ogni mezzo secondo come il danno stesso della skill, ma calcola solo consecutivamente (in quell'intervallo) al danno di questa.\n\nQuindi, ricapitolando, la mossa fa:\n1) Secondo 0:\n    Danno della E: 10/17.5/25/32.5/40 [A seconda del livello della skill ovviamente] (+ 10% AP) \n    Passiva di Liandry: 2%(x2, per via di Rilay) di 100%- Danno precedente\n2) Secondo 0,5:\n etc etc etc....\n\nCapirai come quindi, siamo lontanissimi da quella cifra, poichè questo calcolo, rappresenta per buona approssimazione, l'esponenziale di un numero fratto, ergo, una funzione decrescente:\n0.5 elevato a 2 = 0.25\n0.5 elevato a 3 = 0.125\n0.5 elevato a 4 = 0.0625...\n\n**A tutto ciò inoltre, va considerata come denominatore, la MR!**\n\nP.S: Pur stando ai tuoi calcoli, non verrebbe comunque 42%","replies":[{"poster":"kirchhoff","date":"2015-04-08T22:56:31.169+0000","up_votes":1,"down_votes":0,"body":"Segnalato, come ho fatto a non accorgermi fino ad adesso ...\n\nhttp://boards.euw.leagueoflegends.com/it/c/a-runeterra-si-parla-italiano-it/Uw03E9Qy-specificare-salite-corrente-nel-liandry","replies":[]},{"poster":"TheGrayTea","date":"2015-04-08T16:53:46.641+0000","up_votes":1,"down_votes":0,"body":"Grazie Milena comunque per la risposta completa e ben fatta, adesso ho capito dove sbagliavo: consideravo il danno della liandy come basato sulla salute massima.(Mi sembrava strano infatti che fosse possibile^^)\nPS : continuerò a considerare la liandry come un oggetto inutile +ω+{{item:3151}}","replies":[]},{"poster":"TheGrayTea","date":"2015-04-08T16:39:46.891+0000","up_votes":1,"down_votes":0,"body":"Ops😅","replies":[]}]},{"poster":"kirchhoff","date":"2015-04-08T22:30:19.270+0000","up_votes":1,"down_votes":0,"body":"Il forum mi trolla?\nCi sono 2 discussioni identiche?\nhttp://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/cvaN8ZPJ-aiutino-da-esperti3","replies":[]},{"poster":"Fappelion Dong","date":"2015-04-08T15:05:59.085+0000","up_votes":1,"down_votes":2,"body":"Devi contare la resistenza magica del bersaglio, comunque in generale fare il {{item:3151}} su i campioni che mettono Dot è un'ottima cosa perchè i danni si alzano tanto. Ora, il 42 % è un pò alto e la resa non è così elevata, per esperienza dico ciò, infatti il {{item:3116}}  non si fa più in accoppiata con la maschera per usarli in combo :)","replies":[]}]}