{"poster":"takumi nanabi","date":"2016-09-25T03:27:32.811+0000","title":"¿Que opinan del minijuego urf con seleccion aleatoria ?","subforum":"Charlas Generales","up_votes":1,"down_votes":19,"body":"sinceramente creo que esta un poco mal hecho el minijuego, debido a que tiene ciertos &quot;errores&quot; (por decirlo de alguna manera) o exageraci&oacute;n con la poca duraci&oacute;n del enfriamiento de las habilidades y ultis de ciertos campeones, la desnivelada selecci&oacute;n de campeones, el da&ntilde;o y vida de campeones y los bufos de los itens  y/o el de los monstruos de la jungla y su vida, ya que caen muy r&aacute;pido al igual que las torres y su da&ntilde;o hacia los campeones que no hacen mucho da&ntilde;o. Otra cosa que quiero agregar es la cantidad ilimitada de ward que se pueden poner en el mapa y principalmente los {{item:3363}}  ya que es exagerada la cantidad.\r\nCon lo del enfriamiento de las habilidades me refiero ha de ciertos campeones como por ejemplo:\r\n.{{champion:22}} que su ulti puede ser disparada cada 15 segundos\r\n.{{champion:75}}  la E y su rango para ponerlo es execivo\r\n.{{champion:45}} su habilidad de la c&aacute;rcel se puede poner demasiado seguido y el stun es muy largo\r\n. {{champion:10}} al igual que ashe puede tener su ulti a cada 15 segundos y el da&ntilde;o que hace es exagerado \r\nHablando ya de la vida y el da&ntilde;o de ciertos campeones, ning&uacute;n iten te podr&iacute;a ayudar en medio de un combate ( ni teniendo los itens mas tanques posibles), ni el {{item:3157}} o el {{item:3026}} te ayudar&iacute;an a aguantar 5 segundos en el combate. \r\nOtra cosa que quiero destacar son los hechizos de invocador como {{summoner:12}} que su enfriamiento es poco y combinando esto con la cantidad ilimitada de wards, podr&iacute;as tener a todo el equipo enemigo rode&aacute;ndote en cuesti&oacute;n de segundos.\r\nLos monstruos de la jungla como los dragones, el heraldo de la grieta y el baron nashor no aguantan mucho frente a los campeones y su duraci&oacute;n de bufo dura demasiado. Lo mismo pasa con las torres ya que no aguantan mucho.\r\nNo solo con lo que dije, tambi&eacute;n la selecci&oacute;n esta demasiado mal hecha ya que en un equipo puede tener campeones &quot;rotos&quot; y en el otro campeones cuyas habilidades no podr&iacute;an hacerle frente a estos. \r\nAhora quiero saber que opinan ustedes ante lo que acabo de decir.","replies":[{"poster":"Yrox the Third","date":"2016-09-25T03:35:55.643+0000","up_votes":3,"down_votes":0,"body":"El URF ha sido asi siempre, ahora, respecto a lo de los campeones, me encanta totalmente el hecho de que ahora sea random, sin embargo, tambien seria util poder banear ciertos personajes.","replies":[{"poster":"takumi nanabi","date":"2016-09-26T01:44:19.177+0000","up_votes":1,"down_votes":0,"body":"pues que yo recuerde el enfriamiento en el urf no era exageradamente corto, pero en parte tienes razon con lo de bañear","replies":[{"poster":"Yrox the Third","date":"2016-09-26T13:48:29.281+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=takumi nanabi,realm=LAS,application-id=v7qsfXsE,discussion-id=gYLZKwUT,comment-id=00000000,timestamp=2016-09-26T01:44:19.177+0000)\n>\n> pues que yo recuerde el enfriamiento en el urf no era exageradamente corto, pero en parte tienes razon con lo de bañear\n\nEl enfriamiento siempre fue de 80%, quizas tu lo estas sintiendo diferente.","replies":[]}]}]},{"poster":"Runth","date":"2016-09-25T03:38:57.168+0000","up_votes":1,"down_votes":0,"body":"bueno, pero no haber bans a los champ mas rotos q son invencibles lo rompio el modo\n\nes para puro pasar muertes y diversion,","replies":[{"poster":"takumi nanabi","date":"2016-09-26T01:48:39.475+0000","up_votes":1,"down_votes":0,"body":"si pero pica un poco el hecho de que vas a jugar una partida para divertirte con un amigo y directamente ya a nivel 1 ya te revienten 10 veces en un segundo con ciertos campeones ya que no duras nada XD","replies":[]}]},{"poster":"Numerítos","date":"2016-09-25T03:41:03.987+0000","up_votes":1,"down_votes":0,"body":"yo lo dejo a un 50-50 ya que el modo de juego no es bueno, pero tampoco es malo.","replies":[{"poster":"takumi nanabi","date":"2016-09-26T01:46:21.774+0000","up_votes":1,"down_votes":0,"body":"si eso es cierto, no es bueno ni es malo pero creo que se pasaron un poquito esta ves con ciertas cosas XD","replies":[]}]},{"poster":"Hizoka7","date":"2016-09-25T04:50:30.039+0000","up_votes":1,"down_votes":0,"body":"Eso de random no lo es tanto, por lo menos a mi me tocan siempre 6 campeones solamente de los mas de 16 que tengo.","replies":[{"poster":"takumi nanabi","date":"2016-09-26T01:45:05.384+0000","up_votes":1,"down_votes":0,"body":"si por la rotacion aleatoria de campeones gratis","replies":[]}]}]}