{"poster":"ByakuyaTwerkami","date":"2016-05-16T05:03:51.746+0000","title":"No chest when teammate gets an S?","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":1,"body":"So I haven't earned a chest in about 2 weeks. Which just means that neither me and my team-mates haven't gotten an S or I get an S with someone I already earned one on. Except today I just played a game as a brand-new gragas jungler, and our support earned an S but I didn't get a chest?\r\n\r\nIt broke my heart ","replies":[{"poster":"RiotBok","date":"2016-05-16T22:52:59.479+0000","up_votes":2,"down_votes":0,"body":"Having some troubles loading your account information at the moment, but were you queued with the support?  Keep in mind that to get the S for a teammate, they need to be a part of your pre-made group.  Can check out all the requirements on our [Hextech Crafting Guide](https://support.riotgames.com/hc/en-us/articles/207884233-Hextech-Crafting-Guide)!","replies":[{"poster":"NotxToxic","date":"2016-05-17T01:25:36.892+0000","up_votes":1,"down_votes":0,"body":"ive gotten about 14 S in the past 2 days and I got 1 chest","replies":[{"poster":"RiotBok","date":"2016-05-17T02:22:21.870+0000","up_votes":3,"down_votes":0,"body":"I actually see you earned one late Saturday night on Dr. Mundo and don't currently have any available chests.  They are time-limited in the sense that you get an additional chest slot every week, with up to 4 stored at once.   You've pretty much been earning them as soon as they become available so could be why you don't see the chest slots regenerating.","replies":[{"poster":"BADxW0LF","date":"2016-05-17T16:32:32.473+0000","up_votes":1,"down_votes":0,"body":"Is there we can get a bit of clarity on this in the client?  Maybe put how many you have stored somewhere at the top or on the button to get to your chests?  Or even where you have the ARAM reroll points racked up.  Something for a bit of clarity for users.","replies":[{"poster":"webkr3b5","date":"2016-05-17T16:54:10.036+0000","up_votes":1,"down_votes":0,"body":"http://i.imgur.com/nwfKwZn.png Like it is right now?","replies":[{"poster":"BADxW0LF","date":"2016-05-17T17:31:40.844+0000","up_votes":1,"down_votes":0,"body":"Huh...guess I missed that.  I guess I would just prefer some kind of marker just on the main page rather than going into my profile.  Call me lazy lol.","replies":[]}]}]}]}]},{"poster":"ByakuyaTwerkami","date":"2016-05-17T05:28:53.622+0000","up_votes":2,"down_votes":0,"body":"Ohhhh, that was my problem, I guess. That's weird, since I never noticed that part until now. \n\nWell, at least that got resolved. Thanks for taking your time to answer my problem. xD","replies":[]}]}]}