{"poster":"TMaD LiL Zôkï","date":"2018-01-12T11:04:22.658+0000","title":"Jax Báculo Divino. Esperaba algo.. \"más\"","subforum":"Charlas Generales","up_votes":1,"down_votes":7,"body":"gast&eacute; 1350 rp en una skin en la cual  esperaba algo m&aacute;s. esparaba un cambio de voz.. algunas nuevas interaciones con otros campeones ,el bakeo la skin en si y demas esta muy bonito ,pero un cambio en la voz era esencial en una skin de 1350 rp,me parece media cara para lo que es en si la skin ,no se.. es mi simple opini&oacute;n porque como dice el t&iacute;tulo.. esperaba algo m&aacute;s luego de pagar 1350 rp.","replies":[{"poster":"Hnk Kenshiro","date":"2018-01-12T11:42:21.776+0000","up_votes":8,"down_votes":0,"body":"Te recomiendo ver la skin antes de comprarla.\n\nBueno, en verdad revisar todo lo que vayas a comprar alguna vez.","replies":[{"poster":"Bienzahar","date":"2018-01-12T13:10:22.557+0000","up_votes":1,"down_votes":0,"body":"This...","replies":[]}]},{"poster":"DinosaurioFumado","date":"2018-01-12T11:28:55.160+0000","up_votes":2,"down_votes":0,"body":"Por lo que tengo entendido, cuando van a sacar una skin de 1350 rp se enfocan en cambiar la apariencia, el sonido y animación de backeo. En las skins de 1820 rp, las legendarias, cambian todo, animación de habilidades, backeo, muerte, diálogos, baile, etc.","replies":[{"poster":"TMaD LiL Zôkï","date":"2018-01-12T11:41:18.823+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=DinosaurioFumado,realm=LAS,application-id=v7qsfXsE,discussion-id=jZaqNLXt,comment-id=0000,timestamp=2018-01-12T11:28:55.160+0000)\n>\n> Por lo que tengo entendido, cuando van a sacar una skin de 1350 rp se enfocan en cambiar la apariencia, el sonido y animaciónte  de backeo. En las skins de 1820 rp, las legendarias, cambian todo, animación de habilidades, backeo, muerte, diálogos, baile, etc.\n\ntengo skins de fizz a ese precio de 1350 y cambia tooodo también tengo de brand y otros champs más en los cuales cambian las voces y parde cosas más exigidas en este post sobre la skin de jax,igualmente muchas gracias por tu comentario ,no sabia eso","replies":[{"poster":"Champi4UP","date":"2018-01-12T12:15:01.585+0000","up_votes":3,"down_votes":0,"body":"Los skins de 1350 son los actuales de 975.\n\nYa no cambian la voz, no ponen diálogos ni un baile nuevo. \n\nSólo ponen unos cuantos efectos y un back.","replies":[{"poster":"giotatengue","date":"2018-01-12T14:12:17.951+0000","up_votes":1,"down_votes":0,"body":"En que skin de 1350 de antes cambia algun baile o cosas asi? que yo sepa eso es solo en las de 1820","replies":[{"poster":"Kyousuke","date":"2018-01-12T16:13:08.614+0000","up_votes":1,"down_votes":0,"body":"en algunas \"especiales\" cambiaron bailes o alguna frase, tengo entendido por ejemplo que la de xayah y rakan tendrán algunas nuevas interacciones en la de san valentin (no estoy 100% seguro pero eso escuche)","replies":[]}]}]}]},{"poster":"Mørdekaıser","date":"2018-01-13T17:13:29.773+0000","up_votes":1,"down_votes":0,"body":"Compré el Lee Sin de 1820RP, y más allá de que tiene muchas cosas bonitas, el baile es el mismo de Van Damme así como también los demás movimientos.","replies":[]}]},{"poster":"Juice Wrld","date":"2018-01-12T16:59:35.579+0000","up_votes":1,"down_votes":0,"body":"Pero que dice ._.","replies":[]},{"poster":"faster51","date":"2018-01-12T16:31:19.611+0000","up_votes":1,"down_votes":0,"body":"me apena que los 4 brazos extras solo aparezcan en el backeo \nuna pena, cuando la ví por primera vez pensé que sería legendaria","replies":[]},{"poster":"Urxnium","date":"2018-01-12T16:02:28.119+0000","up_votes":1,"down_votes":0,"body":"Como dijo alguien, las skins de 1350 son iguales a las de 975, no esperes mucho, tampoco es de 1820 rp.","replies":[]}]}