{"poster":"Madhunter1908","date":"2016-10-22T22:29:57.827+0000","title":"Afk's und Dc's versauen Spiele, Spiel Free2Leave machen?","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":7,"body":"Hall&ouml;chen!\r\n\r\nIch schreibe das hier nach einem (weiteren ._. ) Zwischenfall auf. Es geht mir darum, Spiele Free2Leave, NICHT MEHR!!!!, zu machen.Dies w&auml;re der Fall, wenn ein Spieler Disconnected und auch nach einiger Zeit nicht mehr auftaucht. Die &quot;surrender&quot; Option ist da nat&uuml;rlich die erste Wahl, aber mir ist aufgefallen, dass es Tryhard teams etc. gibt, welche nicht surrendern wollen. \r\nEs ist mmn schlichte Zeitverschwendung, sich durch ein 4 vs 5 zu qu&auml;len, welches nicht mehr zu gewinnen ist. Klar kommt jetzt der Gedanke &quot;Das fehlende Free2Leave gibt dir doch den Extra-Kick, dich anzustrengen!&quot;.....Ja, wohl wahr, das ist auch in 8/10 F&auml;llen so. Aber in den restlichen 20% komme ich mir vor wie im Toten Meer..\r\nBitte kein Hate, sondern ernste Kommentare, dank&ouml;&ouml;&ouml;&ouml;.","replies":[{"poster":"Nohgolgh","date":"2016-10-23T01:02:15.750+0000","up_votes":3,"down_votes":1,"body":"Habe schon 4v5 gewonnen. In 19 von 20 Fällen verlieren wir, wenn jemadn in userem Team afk geht. Aber das heißt widerum, dass man in einem von 20 Fällen im ranked keine LP verliert sondern sogar gewinnt. Wieso sollte ich so eine Chance wegwerfen? Und irgendeinen Blödian, der aufgeben will, selbst wenn das Game even steht, gibt es immer.","replies":[]},{"poster":"Antiqui","date":"2016-10-22T23:25:44.442+0000","up_votes":3,"down_votes":2,"body":"Ich habe letztens ein 4vs5 gewonnen. Unser midlaner meinte in der 4.!!!! Minute afk zu gehen. Unser team hat alles gegeben, wir haben  Spli push betrieben, uns koordiniert. Passende items gegen den Gegner gekauft. Wir haben so lange gespielt das jeder von uns full equip hatte (ich war sogar so reich das ich 4 mal ! GA auf Rapidfire gewechselt habe sobald GA auf CD war). Zu belohnung gabs ein S+ und aus der Kiste sprang mir ne \"Schlächter Jinx entgegen.\n\nKlar manchmal es fühlt sich frustrierend an in der unterzahl zu spielen, aber ein sieg ist immer möglich. Also zusammenreißen, die Carryhosen auspacken und dem Gegner Zähne zeigen. Und selbst wenn die Partie verloren geht, kämpfe bis zur letzten sekunde damit der Gegner nur noch sagen kann :\"GG WP\"","replies":[]},{"poster":"Sirrkas","date":"2016-10-22T22:40:16.851+0000","up_votes":3,"down_votes":2,"body":"Ich habe schon einmal ein 5vs3 verloren, bei dem die beiden Gegner zurückkamen, als wir uns gerade an ihre Inhibitoren gearbeitet haben. Danach hatten wir keine Chance mehr.","replies":[]},{"poster":"Nightmare Azir","date":"2016-10-23T08:27:17.435+0000","up_votes":2,"down_votes":1,"body":"Ich habe schon ein 3v5 gewonnen...","replies":[]},{"poster":"BallaDingDong","date":"2016-10-24T11:52:47.469+0000","up_votes":1,"down_votes":3,"body":"Fühl mich auch ziemlich verarscht von den ganzen afkler/dcler >.> eben lvl 4 lee 15 min weg kommt wieder janna bis ende des games weg und das game ging bis Minute 54 ... >.> und dann ist zwischen durch sogar unser midlaner für 4 min dct ... ja das macht fun fun fun NOT! \ndie Gegner waren so schlecht und wäre locker win gewesen ohne diese hardcore afkler/dcler ... ist echt kein wunder warum man low elo silber für immer stackt ...\nich mein, es spielen zisch Millionen LoL, da kann es doch nicht sein das man jedes 2tes, 3tes game sone Leute im Team hat? \nIch versteh das einfach nicht, hab ich scheiß Internet/Pc dann spiel ich verdammt noch mal nicht ranks >.> ...","replies":[{"poster":"Temudschinn","date":"2016-10-24T12:35:09.994+0000","up_votes":1,"down_votes":0,"body":"> ist echt kein wunder warum man low elo silber für immer stackt ...\n\nStatistisch gesehen sind die AFKler öfter bei den Gegnern und helfen die so beim Aufstieg (was natürlich nicht bedeutet dass sie nicht mühsam sind).","replies":[]}]},{"poster":"Pilze","date":"2016-10-23T08:27:02.821+0000","up_votes":1,"down_votes":0,"body":"Wurde schon mehrfach vorgeschlagen, funktioniert nicht. \nTeam verliert einer geht Afk und leaved, alle haben die Möglichkeit zu gehen. So kann man den Gegner um den Sieg bringen.\nDavon mal ab entstehen die meisten 4vs5 weil man den vermeindlichen Feeder zu tote flamed.","replies":[]},{"poster":"NoWayØut","date":"2016-10-23T00:49:54.351+0000","up_votes":1,"down_votes":0,"body":"gute einstellung :) antiqui","replies":[]}]}