{"poster":"ColdNuggets","date":"2018-09-16T12:01:44.112+0000","title":"Got suspended for 14 days for 1 'kys' that was directed to my friend.","subforum":"Player Behavior","up_votes":4,"down_votes":25,"body":"Tl;dr = i dont think someone should get suspended on the spot when they have a clean account and say 'kys' once. What if a friend comes over and writes it in your chat while you re not looking?\r\n\r\nDisclaimers: 1) I agree with most of the decisions that riot makes, i also agree for the reason of my ban, but considering i wasn't toxic before, i think it was a bit too early, apart from that I've always had good experiences with riot employees in the past, and this time was the first time i felt a bit.. confused\r\n                      2) I'm not really salty that I got banned, I'm just kinda irritated because of what made me get banned, and cuz of the response that i got from a rioter when i asked him about further detail to my ban.\r\n\r\n\r\nI've played league for 5 years now, and I've never gotten a single ban, suspension or even chat restriction, all of my accounts were always clean. I tried to be as positive as possible and didn't say anything negative cuz 1) i don't wanna lose all the content that I've worked for over the years 2) negativity is useless, makes you lose more games\r\n\r\nYea, riot is very sensitive to words like kys, which is understandable, so i dont say it. I still say it to my friends as a joke, cuz ik they can take it as a joke.\r\n\r\nI was in a lobby with my friend for duoq, and we had a conversation. We got into champion select, and i forgot to switch to private chat for the rest of our convo, so i slipped in a little \"pls kys xd\".\r\n\r\nI then had a normal game, and at the end of the game i got banned. Reason: \"pls kys xd\", and thats literally it. The rest of the chat log was just normal in game chat. Y'know, harmful messages like \"good job\" or, \"lol, i had no enrgy for w\", and even worse \"careful, {{champion:79}}  might dive you\". I mean, ok, maybe i did get a little salty that our {{champion:89}}  kept on going in 1v5 and then flamed me for still being alive, but i went back to not being tilted after a minute.\r\n\r\nFurthermore, i explained my situation to a rioter by sending a ticket to riot support. He told me that \"The reason you received a 2 week suspension before a Chat Restriction is that we have a zero tolerance policy when it comes to racism/homophobia/xenophobia/wishing harm upon others. These can highly impact a player which is why they can jump over to a harsher punishment.\" I mean hey, fair enough. But, i still dont agree that i should get suspended on the spot for saying it once. Yea, they can't really tell that it was meant to be directed at my friend, who i knew wouldnt get offended, and that i accidentally wrote it in public chat and not private, but still.. maybe you should ease up a bit. Suspending someone for saying the word just once? So what, if a friend of mine comes over to my house and tries to have a little laugh and says kys under my account, will i just get instantly banned because i was toxic in 1 second out of 4000 hour playtime?\r\n\r\nHe then further said that he d like me to understand that riot doesnt consider one players' action to justify anothers'. Yea. I totally agree with that, in fact, to clarify that i wasn't defending my ban over other toxic players who say kys 50 times per game, i even wrote that in my initial ticket that i sent. So i dont know why he's telling me that im trying to defend myself in that way. He then proceeded to give me advice on tilting less in game. Like? what? That wasn't even the reason for my ban. Im not a delusional toxic player who insists that he s not toxic. Its just that im not. I dont call people by insults after they've taken my bot lane wave and left it in a complete mess for the enemy to freeze. Yea, sure i might get a bit tilted, but i dont call them anything bad.\r\n\r\nTelling someone who's tried their best staying positive in-game for the past 5 years to reform is just absurd. It's as if you've got a maths proffessor who's been studying maths for god knows how long, and he miscalculated something and gave it out to his students, and as soon as he's done that 1 mistake, you proceed to suspend him from the uni, and tell him to maybe go back to elementary school to learn some basic maths. Like, it's just ridiculous, and i actually find it rather insulting.\r\n\r\nNow, i really dont care if the account gets suspended, its the lowest ranked account that i have, so this post really isnt about how much i value my account , but rather about how much you can say before you get banned. I don't feel like losing my main (which has content worth about 200k rp, which is 1,4k€) account because of 1 mistake.","replies":[{"poster":"Evangele","date":"2019-04-27T08:23:08.399+0000","up_votes":1,"down_votes":0,"body":"{{champion:267}} Locking up a necro here.","replies":[]},{"poster":"Shukr4n","date":"2018-09-16T12:04:11.000+0000","up_votes":11,"down_votes":0,"body":"U may be clear all life.\nShooting a friend may lead u jail, regardless.\n\nRiot put rules.\nOne of them is the no no words and acronyms.\n\n\nWhat kind of friend doesnt join discord?\n\nWhat kind of cleverness is required to break rules on purpose?","replies":[{"poster":"Mc Truck","date":"2018-09-16T12:37:18.319+0000","up_votes":3,"down_votes":6,"body":"> [{quoted}](name=Shukr4n,realm=EUW,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=0000,timestamp=2018-09-16T12:04:11.000+0000)\n>\n> U may be clear all life.\n> Shooting a friend may lead u jail, regardless.\n\nNot if it's a water pistol.","replies":[{"poster":"Umbral Regent","date":"2018-09-16T12:55:44.537+0000","up_votes":6,"down_votes":0,"body":"Shukr4n didn't specify what kind of gun one would shoot a friend with in their analogy - nor did they even mention a gun, for that matter. Thankfully, their analogy isn't lost due to random passers-by trying to insert their own terms for it.\n\nIt's safest to assume that, since we're talking about an analogy relating to punishments and, particularly, jailtime, they're not talking about a water pistol.\n\nI get that you wanna go around and talk about how you believe the zero tolerance policies shouldn't exist, but don't try to push your own stuff into someone else's comments.","replies":[{"poster":"Mc Truck","date":"2018-09-16T13:22:21.181+0000","up_votes":2,"down_votes":4,"body":"> [{quoted}](name=Umbral Regent,realm=NA,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=000000000000,timestamp=2018-09-16T12:55:44.537+0000)\n>\n> It&#x27;s safest to assume that, since we&#x27;re talking about an analogy relating to punishments and, particularly, jailtime, they&#x27;re not talking about a water pistol.\n\nIn this case we are, because two friends speaking on their own terms know that their \"kys\" is neither important nor serious or, to rephrase it in a more understandable way, none of your fucking business.\n\n>I get that you wanna go around and talk about how you believe the zero tolerance policies shouldn't exist, but don't try to push your own stuff into someone else's comments.\n\nWell, this is one of the clearest cases why they shouldn't. Actually, riot should lift it.","replies":[{"poster":"Shukr4n","date":"2018-09-16T13:32:44.179+0000","up_votes":5,"down_votes":1,"body":"Ok, but the infrastructure uare using to \"joke\" with your friend has clear rules that states tha word is no safe to be used.\nAnd.u know it\nAnd.u did it.\n\nLike carrying a weapon in countries that dont allow them","replies":[{"poster":"Mc Truck","date":"2018-09-16T14:08:38.151+0000","up_votes":2,"down_votes":4,"body":"> [{quoted}](name=Shukr4n,realm=EUW,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=00000000000000000000,timestamp=2018-09-16T13:32:44.179+0000)\n>\n> Ok, but the infrastructure uare using to &quot;joke&quot; with your friend has clear rules that states tha word is no safe to be used.\n> And.u know it\n> And.u did it.\n> \n> Like carrying a weapon in countries that dont allow them\n\nI like it that you mentioned countries. There are countries where you get your head chopped off for cheating on your spouse or simply displaying dislike to the national leader.\n\nWhile we agree that not liking your national leader is a terrible unforgivable offence and you should never commit such crimes(And.u know it.And.u did it.), getting shot for it MIGHT be slightly overboard, so such countries are generally frowned upon.","replies":[{"poster":"Shukr4n","date":"2018-09-16T16:38:09.890+0000","up_votes":3,"down_votes":0,"body":"I like how u extremize a mild example to carry water to your mill.\nBut no","replies":[{"poster":"Mc Truck","date":"2018-09-16T16:39:47.521+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Shukr4n,realm=EUW,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=0000000000000000000000000000,timestamp=2018-09-16T16:38:09.890+0000)\n>\n> I like how u extremize a mild example to carry water to your mill.\n> But no\n\nWhy no? I am talking about exactly the same situation - arguable rule, inappropriately harsh punishment for violating it, worldwide practice of not enforcing it/lower scale punishments. This is the same on so many levels.","replies":[{"poster":"Shukr4n","date":"2018-09-16T16:54:09.509+0000","up_votes":2,"down_votes":1,"body":"I dont know if u are too young to understand or just obtuse..or rrolling me.\nBut i last time reiterate.\n\nU agreed a rule riot did put in game,  agreeIng them u say,that u are aware about rule and relative punishment.\nArguable?why u agreed?\nInappropriately harsh? Why u agreed?","replies":[{"poster":"Mc Truck","date":"2018-09-16T17:48:08.868+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Shukr4n,realm=EUW,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=000000000000000000000000000000000000,timestamp=2018-09-16T16:54:09.509+0000)\n>\n> I dont know if u are too young to understand or just obtuse..or rrolling me.\n> But i last time reiterate.\n> \n> U agreed a rule riot did put in game,  agreeIng them u say,that u are aware about rule and relative punishment.\n> Arguable?why u agreed?\n> Inappropriately harsh? Why u agreed?\n\nI am 25, I am a developer, graduated as an engineer. You might consider me too young, but I am definitely not obtuse. I have no intention to troll you, even though my critical thinking is at its peak.\n\nI am totally aware about the rules, I have no issues following them, but:\n1. I am not entirely sure they should exist at all, leaning towards \"they shouldn't\", even though there are pros and cons for both sides,\n2. I am absolutely sure current punishment system is oppressive, abusive, inadequate to the problem it tries to solve, like a jackhammer when you need a scalpel. \n\nStatistically speaking, I will not change Riot, even if I am 100% right, but considering the severity of issues infesting the punishment system of the game I love, it's worth a try.\n\nIt's not just the issue of harsh policies having collateral damage, like this guy. It's also an issue of presenting their vision on what online communication is and what it should be as unquestionable truth. \n\nIt can kill people's ability to think critically and when it happens, we are going to end up in some very dark pit.","replies":[{"poster":"Shukr4n","date":"2018-09-16T19:00:24.821+0000","up_votes":2,"down_votes":1,"body":"Az much as iu appreciate this way of being professional, lol is a game,not a government educational system.\nPotentially we re all whiny children that scream,at mommy we,want that cookie.\nSince riot is a business and.not a nursery, they put rules. But we re still children whining and as much as.they say \"stop crying im not your mommy\" we keep on going on. And they put in action harsher rules\n\nI mean who is guilty? Riot taking action on rules they previously wrote\nOr\nPlayers that abuse and go over rules?","replies":[{"poster":"Mc Truck","date":"2018-09-16T21:06:35.387+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Shukr4n,realm=EUW,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=00000000000000000000000000000000000000000000,timestamp=2018-09-16T19:00:24.821+0000)\n>\n> Az much as iu appreciate this way of being professional, lol is a game,not a government educational system.\n> Potentially we re all whiny children that scream,at mommy we,want that cookie.\n> Since riot is a business and.not a nursery, they put rules. But we re still children whining and as much as.they say &quot;stop crying im not your mommy&quot; we keep on going on. And they put in action harsher rules\n> \n> I mean who is guilty? Riot taking action on rules they previously wrote\n> Or\n> Players that abuse and go over rules?\n\nFrom this perspective, yes, Rito can't be blamed for one of us, players, violating those rules and we can't blame Rito for enforcing them. We may not like those rules, but we have to follow them or we get punished. As you mentioned, it's business and not a nursery.\n\nBut why does it look like a nursery, swim like a nursery and quack like a nursery? Considering that Rito is not the only successful videogame business in the world, we can look at the others and notice that they don't abuse their power over players. \n\nRiot is going way overboard and it doesn't look like it has something to do with money. It looks like something that Kathleen Kennedy would do - they are pushing some weird-ass agenda, are not even subtle about it. And people(yes, they violated the rules, but they didn't become subhuman because of it) are suffering more than they have to.","replies":[{"poster":"Shukr4n","date":"2018-09-17T04:46:00.271+0000","up_votes":1,"down_votes":0,"body":"Why?\nPegi 13\nMoreover it s a videogame on internet so even grown up players become kids.\nInternet make everything separated grom reality so abusers finds fun and.not regret being unknown and being toxic.\n\nAgonysm adds that more saltiness.\n\nAs long as their business goes ans their deciaion follows it, riot so what he please to keep community alive and money come.","replies":[{"poster":"Shukr4n","date":"2018-09-17T05:31:32.998+0000","up_votes":1,"down_votes":0,"body":"Yes i assume so.\n\nItbs a private business. They could be a restaurant that doesnt have vegan stuff losing customers, their decision.\nAbout gambling i agree that should be a better ruling.\nAs about client property and.banning system.\nBut in the meantime, we have this","replies":[]},{"poster":"Mc Truck","date":"2018-09-17T05:25:40.842+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Shukr4n,realm=EUW,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=0000000000000000000000000000000000000000000000000000,timestamp=2018-09-17T04:46:00.271+0000)\n>\n> Why?\n> Pegi 13\n> Moreover it s a videogame on internet so even grown up players become kids.\n> Internet make everything separated grom reality so abusers finds fun and.not regret being unknown and being toxic.\n> \n> Agonysm adds that more saltiness.\n> \n> As long as their business goes ans their deciaion follows it, riot so what he please to keep community alive and money come.\n\nDo you presume that they would lose more money if chat was unregulated or had less severe punishments(like, completely removing zero tolerance stuff)? \n\nAnd \"they have legal grounds to do that\" doesn't mean that they are in the right. It just means that game industry is too new to be regulated properly, which we see in lootbox controversy (you see, it's gambling).","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Umbral Regent","date":"2018-09-16T14:22:36.132+0000","up_votes":3,"down_votes":0,"body":"> In this case we are, because two friends speaking on their own terms know that their \"kys\" is neither important nor serious...\n\nExcept, that is the case. If you have someone shooting at someone else with a gun - even if they only use blanks - that's cause for punishment. Bystanders don't know what the fuck is going on between the guy with the gun and the guy getting shot - so even if the gun doesn't actually hurt the other guy - as is the case of someone using hate speech or encouragements of self-harm with a friend who's okay with that - that doesn't mean the rest of their team is okay with it.\n\n> ...or, to rephrase it in a more understandable way. none of your fucking business.\n\nHuh, funny thing, that, if something's none of other people's business, then it shouldn't be put in the public channels, now shouldn't it?\n\nIf it's none of other people's business, the OP shouldn't have _made_ it other people's business. By putting their \"kys\" into the chat, they made it everyone else's business.\n\nSo, don't pull the \"none of your business\" card when personal business should be kept out of public channels.\n\n> Well, this is one of the clearest cases why they shouldn't.\n\nNo, it really isn't. Telling someone to kill themselves isn't okay, period. Doesn't matter if it's a \"joke\", doesn't matter if it's a friend, doesn't matter if they're not actually going to do it. You don't tell someone to kill themselves, full stop, period, end of discussion.","replies":[{"poster":"ColdNuggets","date":"2018-09-16T18:35:58.779+0000","up_votes":1,"down_votes":3,"body":"> Except, that is the case. If you have someone shooting at someone else with a gun - even if they only use blanks - that&#x27;s cause for punishment. Bystanders don&#x27;t know what the fuck is going on between the guy with the gun and the guy getting shot - so even if the gun doesn&#x27;t actually hurt the other guy - as is the case of someone using hate speech or encouragements of self-harm with a friend who&#x27;s okay with that - that doesn&#x27;t mean the rest of their team is okay with it.\n\nSomeone in the champion select did tell me that he can report me for saying kys (in your analogy, a bystander said that he'll call the police for the use of guns) - to which we immediately told them that we're premade, -friends. (The guns are fake)","replies":[{"poster":"Xidphel","date":"2018-09-16T20:10:48.290+0000","up_votes":3,"down_votes":0,"body":"Except, someone would see your fake gun and see it as a real gun.","replies":[{"poster":"ColdNuggets","date":"2018-09-17T22:43:18.810+0000","up_votes":1,"down_votes":0,"body":"Well yes, that would be the case with guns..\nthe analogy isn't perfect, guns are much more serious than a word.\n\nIt may be mistaken as a real gun, which is why right after i said it, i assured them that it wasnt, by pulling the trigger and showing them that it just shoots water.\n\nYes, there is no joking around with guns, because they have the power to immediately take lives. But some people still have fun shooting, even if they dont have any fun in killing others, they still have fun in using the gun. (I have fun using the word kys with my friends). I usually use my gun in a private setting, so when i realised i had for once made the mistake of being in a public place, i immediately assured my surrounding environment that they're just water guns.\n\nAgain, the whole point of this post is just to argue about the zero tolerance policy. \"Kys\" doesnt have an immediate threat like guns do. If you 'accidentally' walk into a high school with a gun, of course you ll immediately get punished. We're online, and an accident such as this can happen.","replies":[]}]}]}]}]}]}]},{"poster":"Vlada Cut","date":"2018-09-16T15:25:19.022+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Shukr4n,realm=EUW,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=0000,timestamp=2018-09-16T12:04:11.000+0000)\n> What kind of friend doesnt join discord?\n\nThose who don't have discord.\nLmao.","replies":[{"poster":"Imperial Pandaa","date":"2018-09-16T16:48:01.618+0000","up_votes":3,"down_votes":2,"body":"Discord is free to download and even has a browser dor those that don't want ro download it","replies":[{"poster":"Vlada Cut","date":"2018-09-16T16:57:34.003+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Imperial Pandaa,realm=NA,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=000000020001,timestamp=2018-09-16T16:48:01.618+0000)\n>\n> Discord is free to download and even has a browser dor those that don&#x27;t want ro download it\n\nSo what if it's free? It doesn't mean you should install it if you don't need it.","replies":[{"poster":"Imperial Pandaa","date":"2018-09-16T17:01:04.986+0000","up_votes":4,"down_votes":2,"body":"You don't need to install it. You can use it with an internet browser.","replies":[{"poster":"Vlada Cut","date":"2018-09-16T18:03:11.339+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Imperial Pandaa,realm=NA,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=00000002000100000000,timestamp=2018-09-16T17:01:04.986+0000)\n>\n> You don&#x27;t need to install it. You can use it with an internet browser.\n\nFor the last time. Why would I use an application if I DON'T need it or DON'T want to use?! What is wrong with people not reading questions. Geez.\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Imperial Pandaa","date":"2018-09-16T18:08:13.318+0000","up_votes":4,"down_votes":1,"body":"See, now you are actually being clear. \n\nYour initial thing was about those who don't have it.\nSo I pointed out it was a free download and also browser friendly.\n\nThen you talked about not wanting to install it.\nSo I restated that you don't have to install it as it works on browser.\n\nSo to answer your question, the problem was the lack of clarity. My bad, I'm not a minf reader.","replies":[{"poster":"Xidphel","date":"2018-09-16T20:08:44.828+0000","up_votes":1,"down_votes":0,"body":"Even if you were, you'd be trying to read the mind of someone who's on another continent.","replies":[]}]}]}]}]}]},{"poster":"Shukr4n","date":"2018-09-16T16:39:02.797+0000","up_votes":1,"down_votes":1,"body":"2018\nRemove your parental controll if u cant download that simple programm","replies":[{"poster":"Vlada Cut","date":"2018-09-16T16:58:53.973+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Shukr4n,realm=EUW,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=000000020000,timestamp=2018-09-16T16:39:02.797+0000)\n>\n> 2018\n> Remove your parental controll if u cant download that simple programm\n\n2018, people tell you to install programs you don't need or don't want to install. Lmao who are you to tell me what to install? Get a PC of your own and do what you want with it.","replies":[{"poster":"Shukr4n","date":"2018-09-16T17:01:03.425+0000","up_votes":1,"down_votes":1,"body":"Im not the.one who got banned for breaking rules u agreed previously","replies":[{"poster":"Vlada Cut","date":"2018-09-16T18:06:23.929+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Shukr4n,realm=EUW,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=00000002000000000000,timestamp=2018-09-16T17:01:03.425+0000)\n>\n> Im not the.one who got banned for breaking rules u agreed previously\n\nWhat are you talking about? I'm not the OP who wrote this post and neither I had ever recieve a ban. Turning away from a topic like this means you ran out of arguements to use, so you lose.\nHave a nice day.\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Shukr4n","date":"2018-09-16T18:52:48.107+0000","up_votes":1,"down_votes":0,"body":"Omg i lost.\nNow i cant live.\n\nNoseriously \"u\" was refered to \"everyone\" not like you.\nU won. Go party","replies":[{"poster":"Vlada Cut","date":"2018-09-17T15:28:51.748+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Shukr4n,realm=EUW,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=0000000200000000000000000000,timestamp=2018-09-16T18:52:48.107+0000)\n>\n> Omg i lost.\n> Now i cant live.\n> \n> Noseriously &quot;u&quot; was refered to &quot;everyone&quot; not like you.\n> U won. Go party\n\nAt least be civilized and mature to admit your mistakes and apologize for inconveniently mislead actions you've made.\nOr is that all you have to offer? \n{{sticker:slayer-pantheon-popcorn}}","replies":[]}]}]}]}]}]}]},{"poster":"ColdNuggets","date":"2018-09-16T13:32:33.192+0000","up_votes":1,"down_votes":1,"body":"That's a pretty harsh analogy you're using there.\nIf you want to use analogies, let me give you a more accurate one.\n\nRiot doesn't tolerate those bad words in public chats, but it's none of their concern what people say in private chat (unless of course, its excessive and one of the two people reports each other). I know the person that i was talking to very well. I was talking to him in lobby chat before the game started, which doesn't make it public chat anymore. I then accidentally proceeded to talk badly when the champion select already started, but this was just right after i had left the private chat.\n\n In some places, consuming alcohol is illegal outside of your private property. So, in this case, it is like as if i had just stepped outside of my door and drank a little outisde. It happened only once.\n\nIn some cases, zero tolerance policies are indeed good. Like how you said with shooting someone, of course that is very bad.\nBut what if someone comes over to my place and says \"kys\" in my chat while im not looking?\n(that would be, someone shooting someone else in my place) - does that mean im supposed to guard my league acc as much as i would guard my gun? no. because it isn't as serious of an offense, so the punishment also shouldnt be so harsh.","replies":[{"poster":"Shukr4n","date":"2018-09-16T13:52:28.977+0000","up_votes":2,"down_votes":1,"body":"The only chat riot should not care about EXCEPT if someone open a ticket with proof is \nThe 1-1 chat (private message)\nThat chat is a private conversation and u should be allowed to say what u prefer (as long as someont dont report u).\n\nPre match, during match and post match chat are PUBLIC CHATS since there are 5 players in it.\n\nNow, there are two ways to describe your situation\n\n1) your friend reported u about the private chat and got u banned\n\n2) u were in those three chats i listed and someone disnt like your joke / riot instantly ban that word utilization.\n\nAnyway, regardless u did a fatal error:\n\nWhat u may agree or didagree about riot rules is no debatable since u agreed thise rules when u, created your account.","replies":[{"poster":"ColdNuggets","date":"2018-09-16T14:49:53.642+0000","up_votes":1,"down_votes":0,"body":"\"What u may agree or didagree about riot rules is no debatable since u agreed thise rules when u, created your account.\"\n\nYea, of course it's up to them. but that doesnt mean its not up for debate lol\nYea, theres laws irl too, people can still debate about them.\n\nThe only thing here that i dont agree with is just that i instantly get suspended for a one time offense. Of course its up to riot to suspend me, they already did so, and there's no undoing that. I'm just questioning the harshness of that. I'd agree that they d suspend you if you had any past offenses but i didnt, I've actively been positive throughout my games","replies":[{"poster":"Shukr4n","date":"2018-09-16T16:41:56.889+0000","up_votes":2,"down_votes":1,"body":"If a rule states \"no death wishes\"and. U write death wishes, is it harsh?\nWhy always looking at others and never at your fault?","replies":[{"poster":"R107 Games","date":"2018-09-16T16:57:28.465+0000","up_votes":2,"down_votes":0,"body":"Rules can be harsh","replies":[]}]},{"poster":"Mc Truck","date":"2018-09-16T14:58:51.380+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ColdNuggets,realm=EUW,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=0000000100000000,timestamp=2018-09-16T14:49:53.642+0000)\n>\n> &quot;What u may agree or didagree about riot rules is no debatable since u agreed thise rules when u, created your account.&quot;\n> \n> Yea, of course it&#x27;s up to them. but that doesnt mean its not up for debate lol\n> Yea, theres laws irl too, people can still debate about them.\n> \n> The only thing here that i dont agree with is just that i instantly get suspended for a one time offense. Of course its up to riot to suspend me, they already did so, and there&#x27;s no undoing that. I&#x27;m just questioning the harshness of that. I&#x27;d agree that they d suspend you if you had any past offenses but i didnt, I&#x27;ve actively been positive throughout my games\n\nAnd the fun part is that now riot is pointing a shotgun at your account and is like \"Please, misbehave\".\n\nYou might actually get perma'd for as little as arguing how bad nashor call was. That's quite ridiculous, isn't it?","replies":[{"poster":"Modi","date":"2018-09-16T15:04:48.108+0000","up_votes":1,"down_votes":0,"body":"> And the fun part is that now riot is pointing a shotgun at your account and is like \"Please, misbehave\".\n\nIt is not a threat to misbehave, it is a threat **IF** you misbehave. The better analogy for that situation is probation.","replies":[{"poster":"Mc Truck","date":"2018-09-16T15:27:25.878+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Modi,realm=NA,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=000000010000000000000000,timestamp=2018-09-16T15:04:48.108+0000)\n>\n> It is not a threat to misbehave, it is a threat **IF** you misbehave. The better analogy for that situation is probation.\n\nHe is open to losing his account to very minor stuff because of his victimless crime. Does it feel right to you?","replies":[{"poster":"Modi","date":"2018-09-16T16:31:49.060+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mc Truck,realm=EUW,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=0000000100000000000000000000,timestamp=2018-09-16T15:27:25.878+0000)\n>\n> He is open to losing his account to very minor stuff\n\nMy uncle was at risk (at one point in time) for losing his driver's license *permanently* for one minor driving infraction. Seems to be a similar situation to anyone with a recent 14-day, but of a more significant implications.\n\nThe situations are both meant to be a final chance. Riot is saying (as the department of motor vehicles said to my uncle) \"this is your final warning; you are on a strict probation. Any more infractions will incur severe penalties, with lasting repercussions.\"\n\n>  because of his victimless crime. Does it feel right to you?\n\nI find it interesting that you say it is victimless. I can think of another \"victimless\" crime that is punished harshly as well (at least in the US): drunk driving. If you drive home drunk, and make it home without causing any damage or injury, you could argue that it is victimless, as \"nothing bad happened\". No one got hurt, nothing was destroyed by the action. Should you still be punished? Is it fair? I say yes.\n\nMy reason for using this example is because in both situations you are committing an act that has the *potential* to cause harm. Putting the offender's account at risk is meant to help them see that a change is needed. The behavior is unacceptable, and must change. Riot's only real recourse is to take action on an account. The penalty needs to be severe enough to dissuade the behavior in the future. The only severe enough penalty is a permanent ban.\n\nI agree that it is a hard lesson to learn, but life is full of hard lessons.","replies":[{"poster":"Mc Truck","date":"2018-09-16T16:46:10.782+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Modi,realm=NA,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=00000001000000000000000000000000,timestamp=2018-09-16T16:31:49.060+0000)\n>\n> My uncle was at risk (at on...\n> ...arn, but life is full of hard lessons.\n\nYes, I can see this point. \n\nUp until we realise that the risk from drunk driving is real(supported by tens of thousands confirmed deaths every year) and the risk from saying \"kys\" in mmo chat is imaginary(supported by riot saying \"this is not okay\").\n\nEspecially considering the fact that it was said to a friend and caught by by a bloody zero tolerance bot.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"KnightsKemplar","date":"2018-09-16T16:40:22.801+0000","up_votes":8,"down_votes":1,"body":"I get why your case is especially infuriating.\n\nHowever, *anyone* typing kys in game contributes to a negative environment. Your teammates can't tell if you're kidding around; this could just as easily be a post about a teammate that reported you and checked your match history to see you didn't get banned. And then everyone would be up in arms about how inconsistently Riot bans people. I believe the system still only checks games when you're reported. So someone was offended by you saying that. And rightfully so, imo.\n\nYou could argue there isn't a good way to handle speech like this in games. I think Riot handles it the best way possible, though, by being essentially zero tolerance (it's not actually zero, or you'd be perma'd). I don't think it's wrong to joke around with friends, and if you decide that \"kys\" is something you can safely joke about (I still don't recommend that, btw, for *many* reasons), you still have to respect the environment around you. \n\nLeague games are a public space. There's lots of stuff that you can't do in public without getting arrested, despite it being perfectly legal otherwise. This is a concept in law and society. To avoid future punishments, start treating phrases like that with the severity they deserve.","replies":[{"poster":"Mc Truck","date":"2018-09-16T16:48:29.363+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=KnightsKemplar,realm=NA,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=0004,timestamp=2018-09-16T16:40:22.801+0000)\n>\n> So someone was offended by you saying that. And rightfully so, imo.\n\nOr someone reported him out of spite, because he lost a lane, took a blue buff or didn't obey a stupid call. You don't know why exactly was he reported, you just know what \"zero tolerance\" bot clinged onto.","replies":[{"poster":"KnightsKemplar","date":"2018-09-16T18:19:52.095+0000","up_votes":5,"down_votes":0,"body":"That's a fair point.\n\nBut when you're in a public space, that argument doesn't really matter. Anyone with knowledge about the system knows that \"kys\" will get you banned, instantly, and anyone who wants to report you and get you banned can do so.\n\nI have, with no regrets, reported someone for using hate speech even when it wasn't against me and it didn't even particularly \"bother\" me emotionally. I think it's right to have words that aren't acceptable to use publicly. Just typing the word is enough to get a report from me, because I'd rather send a strong message and correct behavior when I see it. If I don't, they could keep using that word until it *did* hurt someone.\n\nThat's why it's important to stay vigilant. \"Offensive language\" is so named because it's offensive to *someone*, even if that someone isn't you.","replies":[{"poster":"ColdNuggets","date":"2018-09-16T19:00:22.451+0000","up_votes":1,"down_votes":0,"body":"Yes yes, i agree with what you say, like, pretty much 100%. I do report people too when they're offensive, even if it doesn't particularly affect me. No one likes people that are **consistently** negative, just like no one likes afk's or griefers.\n\nKys is publicly a bad word, people can't really know what i mean by it. Me saying that in a public chat was an accident. If i would say kys with negative **or even neutral/friendly** intent over a longer period of time, I would totally agree with it. \n\nI am not just arguing for my own sake either. When i report someone for being offensive, i hope that that report improves the community. I can't tell how often people are offensive in their other games if i have just met them, so i wouldnt want my report to ban them instantly. I'd want riot to collect a number of reports and evaluate the player over a number of games.\n\nMy point is, It was an accident, and accidents just happen, im no robot. The way i communicate with my friends privately is by no means acceptable by riot guidelines, and yet i've obeyed them without getting a single ban or chat restriction over the years. But yea, making one mistake in 5 years really shouldn't put me at risk of getting perma banned. That isn't something i agree with.","replies":[{"poster":"KnightsKemplar","date":"2018-09-18T02:00:05.873+0000","up_votes":2,"down_votes":0,"body":"I can understand that. Only consolation I can offer is that if it's a one time thing, you won't have to worry. Just be extra careful from now on! \n\nYou can always try to submit a ticket. I'm not a Rioter, so I can't exactly speak for them, but my impression is that they are pretty strict on their zero-tolerance phrases.","replies":[]}]}]}]},{"poster":"CharDeeMcDenniz","date":"2018-09-16T17:48:52.488+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=KnightsKemplar,realm=NA,application-id=ZGEFLEUQ,discussion-id=2adEup9Y,comment-id=0004,timestamp=2018-09-16T16:40:22.801+0000)\n>\n> I get why your case is especially infuriating.\n> \n> However, *anyone* typing kys in game contributes to a negative environment. Your teammates can&#x27;t tell if you&#x27;re kidding around;** this could just as easily be a post about a teammate that reported you and checked your match history to see you didn&#x27;t get banned. And then everyone would be up in arms about how inconsistently Riot bans people. **I believe the system still only checks games when you&#x27;re reported. So someone was offended by you saying that. And rightfully so, imo.\n> \n\nso much yes","replies":[]}]},{"poster":"Stars Shaper","date":"2018-09-16T13:35:43.209+0000","up_votes":1,"down_votes":0,"body":"How thick is your skull? Don't type it... EVER!\n\nWhat is this compulsion you guys have towards writing those 3 letters?","replies":[{"poster":"ColdNuggets","date":"2018-09-16T15:00:53.125+0000","up_votes":1,"down_votes":2,"body":"Of course they're bad letters, i know that. The meaning behind it is quite harsh, you re literally telling someone to go end their life, and that's harsh. I don't mean it like that though, and That's why i dont say it to people i dont know, i only say it to people that i know share the same mindset as me, and don't see it as the true meaning. \nBetween friends, we just use it as completely different meaning like, wow what you just said was lame or embarassing or just stupid. but instead of saying that, which is rather rude, we just say 'kys' which we just mean in a joking way. I guess the next closest thing which you could say which wouldnt be as offensive would be 'smh'.\nThe official definition of the term is very offensive and harmful, but I don't use it in such a way.\nIt's just a quick little term that we use between friends, so as long as it's private, it's pretty much of no ones business that we do say it. But i did accidentally say it in public, which got be instantly banned.","replies":[]}]}]}