{"poster":"NicogenFTW","date":"2015-12-09T19:06:09.486+0000","title":"Presunto Bug aggro dei minion (?)","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Salve forum, volevo chiedere se quello che ho riscontrato in alcuni game recenti sia effettivamente un bug o meno.\r\nMi &egrave; capitato alcune volte che un minion della prima wave (ho fatto caso a quello), inizi ad aggrarmi se supero la linea dei minion, e fin qui tutto normale, per&ograve; poi questo continua a &quot;chasarmi&quot; ed aggrarmi anche dopo che sono tornato &quot;al mio posto&quot;, e continua fino a che non lo uccido.\r\nNon so se sia un bug e se anche voi abbiate riscontrato questa cosa.\r\n\r\nFatemi sapere.","replies":[{"poster":"Pasticcionex","date":"2015-12-10T13:10:25.668+0000","up_votes":1,"down_votes":0,"body":"Penso sia un bug anche a me succede spesso... Questi minion assassini che ti inseguono fino alla morte... che poi avviene sotto torre haahha","replies":[]},{"poster":"DoubleT","date":"2015-12-09T23:48:19.231+0000","up_votes":1,"down_votes":0,"body":"Lo ha notato anche Scarra nel suo streaming...in pratica con a prima wave ha perso mezza vita prima di accorgersi che un minion caster lo stava aggrando senza tregua, che dire: minion OP! XD\n\n{{sticker:slayer-jinx-catface}} ","replies":[]},{"poster":"lucanomax1994","date":"2015-12-09T19:23:47.632+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"NicogenFTW","date":"2015-12-09T19:34:46.497+0000","up_votes":1,"down_votes":0,"body":"sarò nabbo, ma non credo fino a questo punto XD\n\nE' da poco tempo a questa parte che è presente questo fenomeno del minion super arrabbiato ^^\n\nSo bene che basta andare nel bush, ma secondo me è comunque un bug, anche perchè non è normale che quell'unico minion continui a chasarti anche se passi in mezzo alla tua wave di minion, girandoci in torno, saltando su te stesso e qualunque altra cosa.\n\nE dico \"non è normale\" inteso che è una cosa che non avveniva prima ed ho invece notato che avviene ADESSO, pertanto chiedevo.\nMagari è un'implementazione della Riot, anche se, più presumibile, un bug ;)","replies":[{"poster":"ForFockSake","date":"2015-12-09T22:45:45.874+0000","up_votes":1,"down_votes":0,"body":"Onestamente anche prima i minion ti chasavano nella jungla xD, ho sempre provato a portare un minion dalla bot a mid, ma a metà strada mi mollava, dici che ora riesco?","replies":[]}]}]}]}