{"poster":"NicogenFTW","date":"2015-08-01T17:09:48.661+0000","title":"Cosa si cela dietro il \"trust me i'm smurf\".","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salver forum, finalmente dopo lungo tempo, e dopo averne sentito a lungo parlare, &egrave; capitato anche a me un paio di volte, il fantomatico tizio che dice &quot;don&#039;t worry guys i&#039;m smurfing&quot;.\r\nSenza voler stare a fare i soliti discorsi, mi chiedevo, ma qual &egrave; la ragione per la quale una persona dovrebbe dichiarare una cosa del genere?\r\nPer farsi lasciare la lane? Per rafforzare in qualche modo il proprio ego? Non mi spiego davvero.\r\n\r\nAnche perch&egrave; solitamente chi &egrave; smurf davvero se ne sta zitto, e magari &egrave; in duo con qualcuno e fine.\r\n\r\nVoi che ne pensate? Sapreste dirmi cosa si nasconde dietro questa affermazione?","replies":[{"poster":"Thix","date":"2015-08-01T17:20:13.595+0000","up_votes":5,"down_votes":0,"body":"> Cosa si cela dietro il \"trust me i'm smurf\".\n\nAl 100% non uno smurf","replies":[]},{"poster":"Capoz","date":"2015-08-01T17:22:16.671+0000","up_votes":3,"down_votes":0,"body":"\"TU-FI-DA-TI-DI-ME\" {{champion:34}}","replies":[]},{"poster":"kirchhoff","date":"2015-08-01T22:39:48.840+0000","up_votes":2,"down_votes":0,"body":"Non è un vero smurf e vuole farsi notare.\nI veri smurf carriano con chiunque e ovunque e non hanno bisogno di dirlo, loro agiscono.","replies":[]},{"poster":"73668109_DEL","date":"2015-08-01T17:29:40.657+0000","up_votes":2,"down_votes":0,"body":"Esatto dietro a quell'affermazione si cela al 99% una persona piena di se che pero' è totalmente incapace .","replies":[]},{"poster":"Lotus Senpai","date":"2015-08-01T17:53:58.322+0000","up_votes":2,"down_votes":1,"body":"Semplicemente, quando l'affermazione è veramente detta da uno smurf, vuol dire: \"lasciami il mio ruolo, segui le calls e lasciati carryare easy senza rompere le scatole che sicuramente ne so più di te di questo gioco\". :)","replies":[]},{"poster":"Jay Kenton","date":"2015-08-01T17:24:00.167+0000","up_votes":1,"down_votes":0,"body":"Se io sono jungler chiedo sempre chi è lo smurf della partita; se uno mi risposnde mi concentro su di lui, guardo il suo start ed inizio a guardare come gioca e soprattutto cosa scrive e cosa pinga. In 10 secondi capisci se è veramente smurf.\n\nSe capisco che è smurf lo babysitto tutto il tempo e sto nel suo lato di mappa; e questo è il modo più rapido per vincere in SoloQ.\n\nQuindi magari uno dice di essere smurf perché vuole essere babysittato e peraltro la cosa dal mio punto di vista ha senso.","replies":[{"poster":"JRobich","date":"2015-08-03T08:29:18.418+0000","up_votes":1,"down_votes":0,"body":"oddio di solito lo smurf lo lascio solo per 20 min tanto la sua lane la vince lo stesso quindi posso concentrarmi su altre lane... ma anche il tuo discorso è valido, del tipo se ha riven bastano due gank prende 2 kill e ha snowbollato :)","replies":[]}]},{"poster":"ztJackieChan","date":"2015-08-01T17:40:02.661+0000","up_votes":1,"down_votes":0,"body":"Il suo main è ADC. Come adc spacca. E' giusto dirlo al team, così, un minimo di teamwork. Per il bene comune, no ?\nChi è realmente smurf, lo dice. Perchè star zitto e rischiare di andare support ?\n\nSe uno è una sega e vuole vincere, cosa può fare ? Niente.\nUno smurf che vuole vincere, cosa può fare ? Prendere le redini del team e dare qualche direttiva. Perchè dovrebbe stare zitto ?\n\nCerto, qualche volta può anche starsene zitto perchè magari non gliene frega più di tanto o non vuole scrivere, certo, tutto è possibile.\n\nIo comunque, chiedo sempre mid, perchè tutte le volte che mi tocca top, poi mi tocca distruggere SIA top e poi ANCHE mid, perchè il bronze di turno è una lumaca.\n\nCmq, le reazioni sono varie. C'è chi ti lascia il posto e c'è chi inizia a insultarti con un bel \"LIER!\".\nQualcuno sa spiegarmi questo comportamento ? Troppi traumi ? Troppe delusioni ?","replies":[]},{"poster":"Sorcio84","date":"2015-08-01T22:30:42.085+0000","up_votes":1,"down_votes":0,"body":"<< Cosa si cela dietro il \"trust me i'm smurf\" >>\n\nse riesco a kickarlo bene, sennò rischia il report e conseguente blacklist. questo indipendentemente dal fatto che giochi bene o male, e dalla vittoria/sconfitta.\n\nlo smurf nel 90% dei casi è un essere che non merita di esistere.\nCi ho messo mezza stagione passata a livellare perdendo anche 20 game di fila per colpa di smurf o gente con team 30-30-30-30-livello inferiore al mio.\n\necco, gli smurf sono una delle poche cose che mi rendono {{champion:17}}","replies":[]},{"poster":"Nabbomaster","date":"2015-08-01T20:15:46.363+0000","up_votes":1,"down_votes":0,"body":"sono come i mid or afk, gli lasci il mid e si fanno killare per primi","replies":[]},{"poster":"DeathJehuty","date":"2015-08-01T18:45:44.888+0000","up_votes":1,"down_votes":0,"body":"Solitamente quelli che se ne escono fuori con ste frasi nei miei game danno il fisrt blod XD","replies":[]},{"poster":"Player A","date":"2015-08-01T18:28:21.683+0000","up_votes":1,"down_votes":0,"body":"io lo interpreto un po' come , se perdiamo reportatemi xd","replies":[]}]}