{"poster":"Kumiho Ahri","date":"2017-07-23T16:43:24.285+0000","title":"Mobilität in League","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":2,"body":"Ich habe das Thema [hier](https://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/TXEEVIyL-lol-spielt-sich-so-langsam) schon einmal angesprochen. Nun w&uuml;rde ich mich gerne nur auf den Mobilit&auml;t-Teil beschr&auml;nken: Mehr Lauftempo f&uuml;r alle (z.B.:+25 oder +1,5 pro Lv), Boots Enhantments und Windalt&auml;re.\r\nZitat:\r\n&gt; Die Explosiven Pflanzen durch die Windalt&auml;re aus Dominion ersetzten. Nur die Alt&auml;re im eigene Jungle erh&ouml;hen das Lauftempo aber werden schw&auml;cher mit jedem zerst&ouml;rten verb&uuml;ndeten &auml;u&szlig;eren Turm (-33% Effektivit&auml;t pro Turm)\r\n\r\nMich w&uuml;rde interessieren ob es auch andere Spieler gibt die sich in diesem Bereich Ver&auml;nderung w&uuml;nschen und was Sie von meine Vorschl&auml;gen halten bzw. ihre eigenen Vorschl&auml;ge hier niederschreiben.","replies":[{"poster":"Kind Prow","date":"2017-07-23T17:06:27.313+0000","up_votes":1,"down_votes":1,"body":"Niemals, Veränderung ist Gift für jedes Leben! Erst die beknallten Pflanzenfrüchteteilchen einführen dann glei wieder wad anderes, des hält doch nur n Pinguin aus, der bis zum Hals im Eiswasser chillt.\n\nNe, jetz ma im Ernst: ich bin dafür dass die Pflanzen bleiben, sie bieten auch abseits vom eigenen Championkit strategische Vielfalt, escapes, warding und Heal, den ich bereits nicht mehr missen möcht :>","replies":[{"poster":"Kumiho Ahri","date":"2017-07-23T17:54:16.887+0000","up_votes":1,"down_votes":0,"body":"Ich will nicht alle Pflanzen ersetzten, sondern nur die explosiven. Ich finde Windaltäre könnten den Job dieser Pflanzenart (escape) besser erfüllen:\n-Man muss sie nicht AAen (allein das hat mich hin und wieder das Leben gekostet)\n-Man ist Manövrierfähig bei Windaltären (fühlt sich weniger steif an und macht es den Gegner Schwerer Skillshots zu landen)","replies":[{"poster":"Sihari","date":"2017-07-23T22:45:09.936+0000","up_votes":1,"down_votes":0,"body":"Auch wenn mir die Idee, die Möglichkeiten der Pflanzen unabhängiger von Autoattacks zu machen gefällt, muss ich mich gegen die Windaltäre als Ersatz aussprechen.\nDie Pflanzen sind ja nicht nur als Escape da, sondern helfen auch bei wichtigen Spielzügen rund um die Drachen und den Baron! Ohne sie sind weniger mobile Junger wieder deutlich stärker im Nachteil.","replies":[{"poster":"Kumiho Ahri","date":"2017-07-23T23:29:08.678+0000","up_votes":1,"down_votes":0,"body":"> Die Pflanzen sind ja nicht nur als Escape da, sondern helfen auch bei wichtigen Spielzügen rund um die Drachen und den Baron! Ohne sie sind weniger mobile Junger wieder deutlich stärker im Nachteil.\n\n\nIst das nicht unfair gegenüber den mobilen Junglern. Dieser Nachteil war bei der Entwicklung von weniger mobilen Champions doch beabsichtigt.\nÜbrigens sind Windaltäre  nicht nur für den escape hilfreich sonder ermöglichen auch den schnellen Lane wechsel (nützlich wenn man z.B.: 2 Innentürme verteidigen muss) und die Gegner, die sich im early im eigenen jungle aufhalten, besser zu verfolgen. Außerdem können Windaltäre nicht verbraucht werden.","replies":[{"poster":"Sihari","date":"2017-07-24T00:28:48.330+0000","up_votes":1,"down_votes":0,"body":"Die mobilen Jungler haben schon bei Ganks und Co. einen Vorteil. Den Unmobilen nun auch noch die Drachenkontrolle zu erschweren fände ich nicht gut.\n\nDas mit dem schnellen Lanewechsel ist ein zweischneidiges Schwert finde ich. Einerseits ist es natürlich sehr angenehm, wenn man sich Anfangs besser verteidigen kann, aber andererseits ist es auch denen gegenüber fies, die sich entscheiden zu roamen, da man selbst wenn man es zu spät bemerkt, noch immer schnell genug folgen kann um den Nachteil auf einer anderen Lane wieder auszugleichen.","replies":[{"poster":"Kumiho Ahri","date":"2017-07-24T01:30:04.739+0000","up_votes":1,"down_votes":0,"body":"Mir scheint die Entscheidung zwischen Windaltären und explosiven Pflanzen ist wohl eher Geschmackssache. Ich finde eigentlich   immer noch das Windaltäre die besser Wahl wäre, aber ich kann deine Bedenken verstehen. Nun gut, ignorieren wir mal den Punkt \"Windaltäre\". Was hältst du generell von einer Lauftempoerhöhung und der Wiedereinführung der Boots Enhantments? Hast du eigene Vorschläge zum Thema?  Oder möchtest du lieber alles beim alten belassen?","replies":[{"poster":"Ma1days","date":"2017-07-25T19:43:15.728+0000","up_votes":1,"down_votes":0,"body":"also ich finde pflanzen sollen bleiben bis auf den heal \nwas das lauftempo  angeht hab ich das flasch verstanden oder willst du das du nur in deinem eigenem jungle den speedbuff bekommst? wenn ja dann find ich die idee richtig schlecht da sie agresives spielen wie invaden erschweren würde und das spiel selber daher langsamer würde\nwenn beide es benutzten könnten find ich es immer noch nicht besser als die pflanzen da sie einfach viel mehr playpotenzial haben hab letzte woche zb in der lcs gesehen wie ein spieler zu einer pflanze geflasht ist und damit ein lee q geblockt hat oder heute bin ich auf eine pflanze geflasht um ihn zu hindern über die wand zu springen und hab ihn so gleichzeitig noch in mein team reingeworfen \ngleichzeitig kann nur einer die pflanze benutzen was sie wiederum zu einem objekt machen kann um das man kämpfen muss weil es sonst der gegner benutzt\nspeedbuffs können so etwas nicht bieten","replies":[{"poster":"Kumiho Ahri","date":"2017-07-25T20:18:49.134+0000","up_votes":1,"down_votes":0,"body":"Die Windaltäre kommen mit ihren eigene Pros und Cons. Sie werden neue Spielzüge ermöglichen. Es ist leicht sich auf die Seite der explosiven Pflanzen zu stelle da diese sich bereits bewehrt haben. Wie schon vorhin erwähnt ist die Entscheidung Geschmackssache.","replies":[{"poster":"Ma1days","date":"2017-07-25T20:33:14.966+0000","up_votes":1,"down_votes":0,"body":"ich sehe aber nicht wirklich viele vorteile gibt ja jetzt schon die krabben wer sie hat bekommt einen großen vorteil im kampf aber wirklich plays oder spielzüge entstehen dadurch nicht viele","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Epic Melons","date":"2017-07-24T06:42:49.308+0000","up_votes":1,"down_votes":0,"body":"Habe mir 2 fancy Rollatoren gegönnt. Seitdem bin ich endlich wieder mobil im Rift.","replies":[]}]}