{"poster":"TF Moonfall","date":"2018-05-15T06:32:46.858+0000","title":"Diana in season 8","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"&Egrave; da ormai mesi che diana mantiene un win rate negativo anche se &egrave; usata solo dagli otp(quindi gente che presuppongo la sappia giocare).\r\n\r\nMolti main diana in high elo hanno smesso di giocare il champ a causa della sua posizione davvero orrenda all&#039;interno del meta da quasi un anno.\r\nQuindi,volevo sapere,perch&eacute; riot non fa nulla per la situazione del champ?Ormai non ha pi&ugrave; match ups positivi e ne ha davvero troppi di negativi,se riesce a vincere la lane viene outscalata anche da lee sin support,anche se &egrave; impossibile che diana riesca a  vincere la lane visto che &egrave; un champ senza nessun tipo di mobility che tende ad essere il campo della giungla preferito di ogni main jungle\r\n\r\n&Egrave; il mio primo post sul forum di league of legends in cui mi lamento di un champ,ma penso sul serio che riotgames dovrebbe fare qualcosa\r\n\r\nFatemi sapere cosa ne pensate,magari datemi qualche idea su come aiutare il champ che ormai &egrave; ingiocabile","replies":[{"poster":"Rohan97","date":"2018-05-15T10:18:04.866+0000","up_votes":2,"down_votes":0,"body":"Per quanto è fuori meta resta comunque forte per me.. è tipo akali, al 6 riesci a fare tutto quello che vuoi , quindi dove sono i match up difficili? ovvio ci sono dei counter ma tu la fai sembrare proprio scarsa quando invece non è.. in late è forse il champion che fa più danni in cosi poco tempo.. (carichi 2 AA sul minion e poi fai Q+R+AA+W) con questa combo fai fuori qualsiasi mago/assassino/adc","replies":[{"poster":"TF Moonfall","date":"2018-05-15T17:17:37.054+0000","up_votes":1,"down_votes":0,"body":"Il problema è che la combo di diana non è eseguibile per intero in late game per esempio,a meno che non ti trovi in situazioni particolari e riesci a dare il terzo aa a qualcosa\n\nComunque un adc armato di hexdrinker sopravvive con circa 400 hp dalla FULL combo di diana\n\nLa full combo di diana,su un bersaglio con 100 mr(diana full build ovviamente)infligge circa 1700 danni\n\nIl problema è che con full combo intendo diana con luden-rabadon-void-spellbinder-zonya-scarpette mpen(con eventuali cambi di build,questa è quella che uso di solito per smurfare) il totale di ap con rune ecc ecc è 800+,nonostante questo diana a meno che non riesce a fare q aa aa aa rwer ma per esempio va per la combo che si usa di più in late,quindi rweq o wreq o rewq,quinsi non prevede il reset della ulti,beh,nell'80% dei casi diana muore,forse riesce a fare una kill ma muore qualche istante dopo\n\nOra però rifletti su questo,diana su un bersaglio con 0mr,ha effettivamente il danno burst più alto del gioco(si avvicina a 5000),il problema è che tutti ormai se vedono una diana feeddata buildano i mercury,o l'hexdrinker,o se sono ap la banshee che letteralmente annulla una delle preziose spells di diana\n\nE tra l'altro,ora l'abyssal mask è usata da davvero molti champs,e questo porta diana a perdere ancora più poteredi\n\nE non ho ancora parlato sei supports e dei loro items,basti pensare che una janna,una soraka,una lulu,possono LETTERALMENTE rendere inutile una diana 50-0","replies":[{"poster":"Rohan97","date":"2018-05-16T11:31:42.769+0000","up_votes":2,"down_votes":0,"body":"comunque se la full combo di diana su un bersaglio con 100mr(50%riduzione danni magici) fa 1700 di danno come può fare 5000 su un bersaglio con 0 resistenza magica?","replies":[]},{"poster":"Rohan97","date":"2018-05-15T18:24:13.739+0000","up_votes":2,"down_votes":0,"body":"Io fatto che non riesci a oneshottare ci può anche stare dato che il tuo kit è come quello di akali. . Si basa molto sull'Aa. Ora che ottieni velocità di attacco per 3 colpi su ogni abilità che usi la rende un bruiser AP. i duelli contro gli squishy li vinci quasi sempre\n\nComunque provala con la pistola.. ti permette di sopravvivere grazie al ruba vita ","replies":[{"poster":"TF Moonfall","date":"2018-05-15T22:18:05.203+0000","up_votes":1,"down_votes":0,"body":"Infatti akali è tra i champs peggiori atm,anche lei è un champ da otp  ridotto parecchio male","replies":[{"poster":"Rohan97","date":"2018-05-16T10:54:10.194+0000","up_votes":2,"down_votes":0,"body":"Beh comunque akali rispetto a Diana se la cava molto meglio. Per il fatto di aver un sustain infinito e che puoi buildare quello che ti pare e piace (rune comprese)e puoi giocarla mid e top senza nessuno problema. \nIl problema sono i primi livelli ma ripeto uno bravo con questi champions riesce a giocarsi bene la laning fase. \n\n\n\n","replies":[]}]}]}]}]},{"poster":"vondarck","date":"2018-05-15T07:14:33.167+0000","up_votes":2,"down_votes":0,"body":"Diana sta patendo e pure da tanto tempo\nÈ un champ estremamente binario one-shot/usless.\n\nHa un kit pensato per un fighter ma gli scailing e i cd la forzano a giocare assassin\nSubirà un indiretto buff con la nuova mastery che le aumenta la velocità di movimento dopo aver utilizzato la ulti (così da facilitare il 3th attacco)\n\nIl problema basilare di diana è che non ci sono item AP che supportano la sua configurazione di ap fighter\n\nPer quanto sembra stupido lichbane+nashor sono 2 oggetti AP che se unitamo le loro utility in versione AD otteniamo la trinity..\n\nNon ci sono oggetti veramente core su diana che la fanno campare in fight..","replies":[{"poster":"TF Moonfall","date":"2018-05-15T17:06:45.573+0000","up_votes":1,"down_votes":0,"body":"Penso la stessa cosa,ormai ho anche smesso di buildare la litch da parecchio tempo,ormai però anche i match ups considerati ''skill match ups'' hanno un 49% win rate o 50\n\n\nAd esempio zed,che prima veniva counterato,o kassadin","replies":[{"poster":"vondarck","date":"2018-05-16T08:57:44.558+0000","up_votes":2,"down_votes":0,"body":"Sto pensando ad una serie di cose con le nuove mastery\n\nIl ramo dominazione con la.nuova mastery dei 3 hit pitrebbe aiutare diana jung\n\nSperando che mettano anche la mastery che aumenta la MS dopo aver ultato","replies":[]}]}]},{"poster":"SickAnto","date":"2018-05-15T08:46:09.692+0000","up_votes":2,"down_votes":0,"body":"Non la toccano semplicemente perché Diana è uno dei campioni più instabili di LoL. Il suo kit, come è già stato detto, è binario e inoltre frustrante da giocare contro. Diana è una Akali 2.0, in breve.\n\nUn altro motivo per cui non viene toccata è perché è in lista per un rework parziale(GU). Anche se, dovremmo attendere un bel po'.","replies":[{"poster":"TF Moonfall","date":"2018-05-15T17:20:21.038+0000","up_votes":1,"down_votes":0,"body":"Secondo me,questo non è giusto,l'attuale situazione di diana mi impedisce di salire o di vincere giocando il mio champ,è davvero assurdo che io con 400k su diana ho un carry potential su champs come aurelion,zed o ekko,e se sommo i games giocati con questi champs,arrivo alla metà di quelli giocati con diana!","replies":[{"poster":"SickAnto","date":"2018-05-15T17:43:23.831+0000","up_votes":1,"down_votes":0,"body":"Certa gente era arrivata in Challenger con Yorick, pre-rework.\n\nDiana è un ottimo carry, se saputa usare per bene, sopratutto in low elo. Non ci vedo il problema qui.\nIl problema nasce in High Elo dove la gene sa cosa vuol dire stompare Diana e non è idiota che si fa prendere dal panico alla prima Q.\nChe poi, riesci a carriare con Sol e non con Diana? Mi sembra un po' strano visto che il Drago lo considero messo molto peggio. Forse non sei più a tuo agio con il champ.\n\nLa Riot può darle solo dei buff leggeri ma provarla a darle una spinta in più(esempio a caso, più tankiness), la renderebbe molto bilanciata e per questo stanno aspettando per reworkarla.","replies":[{"poster":"TF Moonfall","date":"2018-05-15T22:16:04.088+0000","up_votes":0,"down_votes":0,"body":"Fino a qualche mese fa ero in top 30 diana in euw,il sol è messo MOOOLTO meglio di diana semplicemente perché se saputo giocare può vincere letteralmente da solo camminando e andando bot,per non parlare del suo danno e la sua utility in late game\n\nDiana è una calamita per junglers in un meta con davvero tanti midlaners che danno problemi al champ","replies":[]}]}]}]}]}