{"poster":"Just Play 4 Fun","date":"2019-02-23T11:33:17.454+0000","title":"¿Cómo reportar esto?","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":0,"body":"Necesito reportar a un jugador que a minuto 5, yendo 2-0 como adc y ganando la línea, \"se fue afk\", procediendo a quedarse en base caminando desde las torres del nexo a las tier 3. Cuando ya estaban a 3 básicos de romper el nexo, \"resucitó\". No hizo nada, tenia{{item:1053}}{{item:1001}}{{item:1042}} nivel 6 sin subirse la ulti.\r\nCon nuestras últimas fuerzas conseguimos evitar que rompan y procedimos a ganar 3 tf seguidas, que resultaron en nosotros sacando baron, ganando 2 tf mas y ganar una última tf peleando un dragón. Sí, tomaron 6 Teamfights para poder ganar la partida, a pesar de que yo estaba feed y mi Yorick tenía items (No le había ido bien en línea pero en definitiva eso no importa).\r\nDicho adc terminó la partida yendo 5-5-14, con 52 CS.\r\nNo me molestaría si hubiese jugado mal, todos tenemos partidas malas y no hubiese sido su culpa, si no que deliberadamente no hizo nada hasta que estabamos por perder la partida. \r\nNecesito ayuda ya que no sé como reportar esto, aparte de que el sistema de tickets es complicado y continuamente te redirige a enlaces que no son lo que necesitas, NECESITO JUSTICIAAAAA (?){{sticker:garen-swing}}","replies":[{"poster":"Eslowsinho","date":"2019-02-23T23:48:57.045+0000","up_votes":2,"down_votes":0,"body":"@Kukulcan73 me respondió hace como 2 semanas un soporte de riot en al cual no le dio nisiquiera un poco de lectura, copio y pego lo que sale en sus manuales que el dan","replies":[]},{"poster":"TvTLucio22","date":"2019-02-23T14:07:42.060+0000","up_votes":1,"down_votes":0,"body":"reportalo como afk y listo, ya que se miran tambien las estadisticas. si el partido dura 40 minutos, tu equipo termino tipo 40 a 40 y el tipo estuvo en 3 kills (entre kill y asistencias) o hizo muuuuuuuuuuuuy poco daño o cc segun su rol, se considera afk","replies":[]},{"poster":"UltiAlMinion","date":"2019-02-23T12:29:55.794+0000","up_votes":1,"down_votes":0,"body":"bienvenido a las, como diria riot, solo reportalo, pero suerte en tu proxima partida que va a ser alguien diferente que te haga eso :)","replies":[]}]}