{"poster":"Exeron","date":"2015-04-22T17:19:28.361+0000","title":"Die beste Lane,um das Spiel zu \"carrien\"","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Hallo liebe Community,\r\n\r\nIch h&auml;tte da mal so eine Frage. Was ist eurer Meinung nach die beste Lane  bzw. dort auch die besten Champs, um ein Spiel carrien zu k&ouml;nnen ( Gold/Platin Ranked)?Klar brauch man dann auch Skill und Erfahrung f&uuml;r diese Champs und man sagt ja eigentlich auch: Spiel das, was du am besten kannst, aber ich h&ouml;re halt auch des &Ouml;fteren mal, dass es gewisse &quot;Positionen&quot; gibt, bei denen es einfacher ist als bei anderen. \r\nMfG","replies":[{"poster":"Evenrider","date":"2015-04-24T10:12:53.933+0000","up_votes":1,"down_votes":0,"body":"Die Frage wäre eher, wie und zu welchem Zeitpunkt willst du das Team carrien?\nWillst du sie im Earlygame füttern? Dann dürften Jgl und Support recht gut sein.\nWillst du zwar gefüttert werden, diese Fütterung in Schaden umwandeln und dann wie eine 1-Mann-Armee unter dem Gegnerteam aufräumen? Dann wäre der ADC wohl die passendste Position.\nIst dir ein Mischmasch aus den beiden vorherigen Antworten recht? Dann könnte Midlane deine Lane sein.\nOder suchst du das ewige 1onX, wobei X möglichst viele sind, damit das eigene Team es leichter hat? Dann wäre ein Splitpush Top etwas für dich.\n...","replies":[]},{"poster":"Arió","date":"2015-04-24T10:00:40.213+0000","up_votes":1,"down_votes":0,"body":"Die gängigste Meinung unter den \"pro's\" und Highelospielern sieht dazu ,soweit ich das sehe, wie folgt aus:\n\nVon am einfachsten zu am schwersten:\n\nJungle\nMid\nSupport\nADC\nTop\n\nFind ich so auch erfahrungsgemäß zutreffend.\n\nLG Arió","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-04-22T18:06:10.329+0000","up_votes":1,"down_votes":0,"body":"Support? Also ich carry am besten als Support... Mata und Yellowstar auch... Dann wiederum gibt es Leute, die als Support ums verrecken nicht carrien können... \nDafür kann ich zum Beispiel auf keinen Fall als ADC das Spiel entscheident beeinflussen. Wenn ich diese Rolle im Ranked zugewiesen bekomme, muss ich auf jeden Fall getragen werden.\n\nWas aber zu der eigentlichen Antwort führt: Mit der Rolle, die dir am meisten Spaß macht, kannst du auch am besten carrien. Denn die Rollen sind so \"gebalanced\", dass sie alle angemessenen Einfluss auf ein Spiel haben. Muss ja, sonst würde der Support einfach abgeschafft und durch einen 2ndary Carry ersetzt werden (in Bronze nebenbei durchaus eine brauchbare Taktik.. brauchbarer als blind einen Support zu picken, den man dann nicht spielen kann)... stattdessen gibt es spezielle Champs, die genau diese Aufgabe am besten erfüllen, aber in anderen Rollen sinnlos sind... wie Soraka oder Sona... \nUnd wenn einer (egal wer) seine Aufgabe gar nicht erfüllt, bricht das Teamkonzept zusammen.","replies":[]}]}