{"poster":"tilting Yamaru","date":"2015-08-26T15:47:58.998+0000","title":"Teammember gesucht","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Guten Morgen/Mittag/Abend (oder wann auch immer ihr das lest :3),\n{{summoner:14}}  Ein paar Freunde von mir und ich haben mittlerweile die Schnauze voll von Ranglisten Teams in denen nichts funktioniert und in denen man nichts sagen darf bzw einem nie einer zuh&ouml;rt! {{summoner:14}}  Deshalb gr&uuml;nden wir ein neues Team. Eins in dem jeder das Recht hat etwas zu sagen und zu kritisieren, oder um Tipps zu geben. Wahrscheinlich denkt ihr euch: Warum labert der sowas?! (ok dem Betreff entsprechend nicht :D) {{summoner:6}} Aber ich sags euch jetzt direkt und trete euch damit in die T&uuml;r. {{summoner:6}}  Wir suchen Leute f&uuml;rs Team! Wie bereits gesagt darf sich jeder der im Team is frei &auml;u&szlig;ern. {{summoner:2}}  Wir haben bereits einen \"Shortcaller\", sprich jemanden der Ingame die Ansagen macht, einen Top-Laner, Jungler und ADC. Wir suchen allgemein Spieler aller Positionen falls mal einer nicht kann, aber dringend einen Mid-Laner und einen Supporter. {{summoner:2}}  Die Spieler sollten so im Bereich Silber bis Gold sein. Es sind aber auch Spieler h&ouml;herer Division sein, zwar nicht f&uuml;rs Team an sich aber als eine Art Trainer. Also Beschw&ouml;rer und Beschw&ouml;rerinnen Vielen Dank f&uuml;rs zuh&ouml;ren.\nMit freundlichen Gr&uuml;&szlig;en\n{{summoner:30}} Chris aka Yamaru {{summoner:30}} \n{{summoner:31}}  Und das Team <3 {{summoner:31}} \nPS: Bei Fragen oder Interesse pls add me: tiling Yamaru (Name entspricht nicht der Wahrheit :D)\nPSS: ICH WERDE NICHT MEHR DER LEADER SEIN ALSO PLS ADD benxple007 ICH BIN NUR NOCH SUB, DA ICH MICH LIEBER AUF DIE SCHULE KONZENTRIER","replies":[{"poster":"OG Haru","date":"2015-08-26T18:11:37.543+0000","up_votes":1,"down_votes":0,"body":"Also ich wäre an der Supportposition interessiert\nZu mir: \n18 jahre alt \n\nElo: Silber 4 (bin aber auch nicht an meiner Elo interssiert)\n\nChamps: Thresh!, Leona, Braum (behersche auch andere aber das sind meine besten) \n\nWas ich mitbringe: Sehr Teamorientiertes Spielen, Aggresives so wie passives Laning, passe mich aber den Spielstil meines AD's an \n\nZum Notfall kann kann ich auch die AD Rolle übernehemen\n\n\nKann jedoch bis Samstag nicht spielen und bin nur per LoL Messenger online \nBei Interesse addet mich einfach :)","replies":[{"poster":"tilting Yamaru","date":"2015-08-27T14:43:34.683+0000","up_votes":1,"down_votes":0,"body":"Ähm ja kleine Planänderung und zwar werde ich mich erst auf die Schule konzentrieren. also bitte adde benxsple007 (er is der neue leader) ich werde aber immernoch als sub agieren :D","replies":[]}]}]}