{"poster":"1995 2017RiP Eva","date":"2017-05-24T02:56:53.554+0000","title":"20 Mana cost increase boys 20 MANA COST INCREASE","subforum":"Gameplay","up_votes":66,"down_votes":29,"body":"{{champion:236}} The most broken ADC atm huge pick ratio and good win ratio too (remember lee sin? same thing)\n\nEveryone from pro to bronze agree that he need nerfs\n\nWhat pro have say that make him powerfull\n\nA the no cast animation that allow him to do his abilities faster than he should riot should revert that buff \n\nB his Ulti range and minion wave clear is way too good and strong and the range is too big and gets a very good synergy wth BC\n\nC his double shot passive that allow him to outrade any other ADC without an effort\n\nD His mobility that got further buffed with BTRK \n\nSo what is riot gonna nerf ?\n\nThey ADD 20 extra mana cost on his Q RANK 5\n\nYAY \n\nAnd the best part? it was +30 but they though that it was too harsh so they you know they drop it to 20!\n\nThat riot balance for you i guess he is selling many skins atm so we cant actually balance the game we gotta wait till he is not selling skins so riot can actually nerf him!","replies":[{"poster":"Doodlzzz","date":"2017-05-24T03:02:40.987+0000","up_votes":7,"down_votes":24,"body":"similar pattern with a ton of other OP champs\n{{champion:427}}  tiny nerf that didn't do much\n{{champion:64}}  negligible nerf to R damage\n{{champion:103}}  AP ratios away from W and ult but compensation buff on E makes her nerf minor\n\nand now dis","replies":[{"poster":"Fondling Gems","date":"2017-05-24T06:33:18.983+0000","up_votes":50,"down_votes":5,"body":"I like how often people critique nerfs such as the Lee Sin movespeed changes + slight ult CD change, acting like Riot has no idea what they are doing.  Lets just ignore that Lee had an almost 3% drop in winrate from those changes.\n\nAt least let the changes go through before screaming.\n\nAs a side note Ahri changes went like this>\n\nW 10% less AP scaling, across all 3 fires (which hit at 30% damage on additional bolts at the same target).  That is 30% less AP scaling across 3 targets, 23% Less scaling across 2, and 16% less Ap scaling vs a single target.\n\nR: 5% less AP scaling, across her 3 bolts, which fire 3 times.  Up to 3 bolts can hit one target meaning that her ult caused a 15-45% AP scaling drop depending on the number of targets.\n\nE: 10% AP scaling increase on the ability with 1.5 - 2.4 times the CD of W\n\nIn a full rotation of her spells Ahri lost 21% AP scaling vs a single target.  In team fights she lost 65% AP scaling lost.  Over a 10 second rotation of all of her abilities (So 2 Foxfires) she lost 27-95% AP scaling depending on the number of targets.\n\nJust because it feels like a small nerf does not make it a small nerf.  \n\n-------------------------------------\n\nThink about how frequently Lucian goes OOM in lane, it is very often for an ADC, especially if they spam.  They use Q anywhere from 2-5+ times in a bit fight, most bot lane fights early on are 2-3 unless they are very short trades.  hitting the mana cost means he can use it less, which means less waveclear and less bullying.  That means he can't capitalize are strongly on won trades, and pushing him in hurts him a lot as he has to burn even more mana just to keep up, and as well already covered he burns more mana than just about any other adc.  \n\nHitting him in the mana hits him exactly where he needs it, but hurting his flexibility and limiting his ability to trade all the time.  Lucian is meant to deal damage, that is fine.  By limiting his mana pool you keep lucian strong in terms of power, but hit his laning phase quite hard and give incentive for him to go down the essence reaver path which weakens his laning phase further as well as focusing him around the mid-late game more so he can't run away with games so early.","replies":[{"poster":"CØulrophobia","date":"2017-05-24T09:06:10.573+0000","up_votes":3,"down_votes":0,"body":"They are just going to rush a E.R. on Lucian to compensate, and Ahri nerf reinforces LichTech build. Because Less AP ratios= more AA to kill target early.","replies":[{"poster":"OyddAWqJ5r","date":"2017-05-24T09:20:59.054+0000","up_votes":8,"down_votes":1,"body":"Which are in turn a weaker and stronger build respectively which if they are building those the majority of the time that would mean the nerfs were meaningful and made an impact on their performance.\n\nE.R. has a cost and is a major setback to his most effective build. So that'd be great if he had to build it.","replies":[{"poster":"Wheatloaf","date":"2017-05-24T15:08:47.928+0000","up_votes":7,"down_votes":0,"body":"Reinforcing ER while nerfing his current BorK/BC build was actually the point of the change, since one build is out of line and the other isn't used.","replies":[{"poster":"OyddAWqJ5r","date":"2017-05-24T23:33:17.629+0000","up_votes":2,"down_votes":0,"body":"still a net nerf","replies":[{"poster":"Wheatloaf","date":"2017-05-25T02:06:30.700+0000","up_votes":2,"down_votes":0,"body":"It's still a net nerf, but so long as it increases the strength of his ER build path relative to his current one, it does what they set out to do. Even better, it differentiates the two paths more sharply - ER will give him plenty of spell-slinging, as per usual, while BorK/BC will allow him fewer casts, but more powerful ones.","replies":[{"poster":"OyddAWqJ5r","date":"2017-05-25T02:12:36.714+0000","up_votes":2,"down_votes":0,"body":"Definitely a better Lucian overall agreed.","replies":[{"poster":"Wheatloaf","date":"2017-05-25T02:36:02.295+0000","up_votes":2,"down_votes":0,"body":"Praise be unto tradeoffs in build paths \\o/","replies":[]}]}]}]}]}]}]},{"poster":"Funkin Dunkin","date":"2017-05-24T14:34:40.444+0000","up_votes":1,"down_votes":4,"body":"A 3% drop could also just be a natural drop from playing habits. 3% isn't enough to say squat about jack.","replies":[{"poster":"Baron of Bread","date":"2017-05-24T16:16:17.753+0000","up_votes":1,"down_votes":0,"body":"Actually it is pretty big, especially considering how popular Lee Sin is.  A 50% win rate is a fine champion, but a 47% winrate is a bad champion in a lot of people's eyes.","replies":[{"poster":"woodvsmurph","date":"2017-05-24T21:34:49.081+0000","up_votes":1,"down_votes":0,"body":"But you need to factor in how many 0 skill players picked lee up because he was THE OP jungler according to YouTube and streamers. These guys tend to underperform on the new champ they pick up and deflate it's winrate even if the champ is overtuned. Only when the champ is undeniably FREELO broken does winrate increase despite many new low skill players picking up the champ. That is when you see Riot stepping in right away with a hotfix.","replies":[{"poster":"Glory ln Death","date":"2017-05-24T22:31:11.746+0000","up_votes":2,"down_votes":0,"body":"But there was no sudden increase in play rate... There wasn't a huge influx of new Lee players that would have pulled his winrate down. The nerfs are the only major change that could explain the sudden drop.","replies":[]}]}]},{"poster":"Fondling Gems","date":"2017-05-24T16:04:27.650+0000","up_votes":2,"down_votes":0,"body":"A 3% drop after very few changes in his winrate for quite a while and with no nerfs to the items he uses.  Considering there wasn't much else that would have impacted him that patch other than Zac getting overbuffed I would say that it is safe to say his nerfs were responsible.\n\nYou generally don't see 3% drops in winrates after a general positive trend in a champ for the past few patches and attribute it to other stuff that wouldn't have directly affected him instead of the direct nerfs he received.","replies":[]}]},{"poster":"FilDaFunk","date":"2017-05-24T21:42:05.974+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fondling Gems,realm=NA,application-id=3ErqAdtq,discussion-id=lIeAnAup,comment-id=00010002,timestamp=2017-05-24T06:33:18.983+0000)\n> \n> R: 5% less AP scaling, across her 3 bolts, which fire 3 times.  Up to 3 bolts can hit one target meaning that her ult caused a 15-45% AP scaling drop depending on the number of targets.\n\nLinear scaling doesn't change proportion of AP lost (R hits one target with one bolt).","replies":[{"poster":"Fondling Gems","date":"2017-05-25T02:35:06.056+0000","up_votes":1,"down_votes":0,"body":"That is why I provided the damage as X-X% where first X is total loss vs one target and second is total loss when hitting 3 targets.","replies":[{"poster":"FilDaFunk","date":"2017-05-25T09:07:41.191+0000","up_votes":1,"down_votes":0,"body":"Ah, I thought you meant proportion of damage lost that was from AP, not just pure point damage of AP (so if it hit 20 targets, there'd be 300% AP scaling drop).\n\nApologies.","replies":[{"poster":"Fondling Gems","date":"2017-05-25T18:52:13.012+0000","up_votes":1,"down_votes":0,"body":"No worries, just a simple misunderstanding.","replies":[]}]}]}]}]},{"poster":"1995 2017RiP Eva","date":"2017-05-24T03:08:32.282+0000","up_votes":10,"down_votes":6,"body":"At least Lee got some MS nerf some CDR nerf and a damage nerf which all together are some NERFS \n\nincreasing 20 mana cost on an ADC that would effect when the adc is LVL 9...its just nothing its like nothing..","replies":[{"poster":"MIC Cavalry","date":"2017-05-24T11:54:05.571+0000","up_votes":5,"down_votes":2,"body":"I don't think you realize how important mana is for Lucian early on, going OOM much quicker requires him to build ER early. That's a huge change to his early game power, BoTRK is the biggest part of Lucians power right now, if he doesn't build it early then his early game power drops significantly.\n\n\n\nI'll still go the build I've been going, which is BoTRK > zeal item >ER > IE","replies":[]}]}]},{"poster":"Rewt","date":"2017-05-24T04:03:52.818+0000","up_votes":19,"down_votes":0,"body":"{{item:1400}} 5 ad","replies":[{"poster":"Ashen Rider","date":"2017-05-24T05:50:46.829+0000","up_votes":9,"down_votes":0,"body":"{{champion:59}}  2 armor","replies":[{"poster":"Darksun Dragoon","date":"2017-05-24T06:21:46.973+0000","up_votes":9,"down_votes":0,"body":"{{champion:67}} 3 ad","replies":[{"poster":"AirKingNeo","date":"2017-05-24T22:44:38.543+0000","up_votes":1,"down_votes":0,"body":"{{champion:10}} 5 AD\n\nNerfed because of Devourer, then not buffed after it's removed. Balance at it's finest.","replies":[]}]}]}]},{"poster":"Akaviri","date":"2017-05-24T03:16:26.955+0000","up_votes":15,"down_votes":0,"body":"They're just trying to push him towards Essence Reaver. Honestly a buff to that item combined with the upcoming bork nerfs and maybe it'll happen.","replies":[{"poster":"Skins Project","date":"2017-05-24T08:09:12.591+0000","up_votes":8,"down_votes":0,"body":"SHHHHHH\n\nBringing logic to Circle-jerks is going to get you burned at the stake!","replies":[]},{"poster":"LordGeovanni","date":"2017-05-24T10:21:53.234+0000","up_votes":1,"down_votes":3,"body":"If they wanted to push him too a crd and mana based item they would make his combo unviable at base cooldown due to cdr and make his spells cost real amounts of mana but then ne would be the only ranged champion  like that except current {{champion:127}}","replies":[{"poster":"Ralanr","date":"2017-05-24T11:56:28.776+0000","up_votes":4,"down_votes":0,"body":"Thing is, Lucy is a lane bully so they don't want to weaken his power before items.","replies":[]}]}]},{"poster":"Packun Flower","date":"2017-05-24T03:01:30.229+0000","up_votes":4,"down_votes":1,"body":"Are you honestly surprised?","replies":[{"poster":"1995 2017RiP Eva","date":"2017-05-24T03:07:23.949+0000","up_votes":11,"down_votes":3,"body":"To be honest yeah because meddler was saying 2 patches 2 PATCHES ago that lucian is problematic and they are gonna nerf his ulti and some of his kit\n\nAnd now all they did was 20 MANA COST this is joke...","replies":[{"poster":"Packun Flower","date":"2017-05-24T03:11:56.263+0000","up_votes":4,"down_votes":2,"body":"Well you shouldn't be.\n\nRiot is notorious for pulling 180's.","replies":[{"poster":"General Esdeath ","date":"2017-05-24T06:44:55.639+0000","up_votes":5,"down_votes":0,"body":"It wouldn't be a Riot patented change without some sort of catch to it.","replies":[]},{"poster":"PB4UAME","date":"2017-05-24T04:53:24.072+0000","up_votes":5,"down_votes":1,"body":"Especially with their pet champions and ADCs in particular.","replies":[]}]},{"poster":"Academy Kayn","date":"2017-05-24T06:13:26.419+0000","up_votes":4,"down_votes":1,"body":"No, they said they were *looking* at possibly nerfing his ult. They did not promise to nerf anything in particular, they said what they were thinking about hitting.","replies":[]}]}]},{"poster":"Cosmic Warper","date":"2017-05-24T15:40:31.556+0000","up_votes":7,"down_votes":0,"body":"I don't think you realize what 20 mana does to his Q. His Q has a very low cooldown and fuels his damage combo because as long as its up his passive is up, and his passive fuels his E reset. Using Q twice is an extra 40 mana, and on a low mana regen champ it adds up if he uses it too often during and before a fight. Mana cost nerfs for low cooldown abilities are bigger than people think.","replies":[]},{"poster":"devdev463","date":"2017-05-24T13:10:30.598+0000","up_votes":7,"down_votes":2,"body":"Mana is a gate that limits how much a champion can do. This effects everything about lucian... He uses Q a LOT so 20 mana is significant. Will this be enough to knock him out of meta? Who knows, but this is a good nerf and I think you should think about why a little more.","replies":[{"poster":"GULAG 4 U","date":"2017-05-24T20:02:12.702+0000","up_votes":2,"down_votes":1,"body":"Op doesn't like thinking. He also said all the nerfs on Yasuo were pulled off when they only reverted E.","replies":[]}]},{"poster":"Sugar Momma","date":"2017-05-24T10:20:01.813+0000","up_votes":4,"down_votes":1,"body":"Lucian isn't that far off from balanced atm, his win rate is only a bit above 50%; he is just played far too much.\n\nHe might need more than just this nerf, but Riot has gone too far with Lucian and made him trash-tier FAR too many times before (which isn't fair either).","replies":[{"poster":"MIC Cavalry","date":"2017-05-24T11:57:05.649+0000","up_votes":3,"down_votes":1,"body":"If he's played far too much, that isn't grounds for a nerf.\n\nGod forbid Riot suceeds at making a champion that's fun to play and feels rewarding.","replies":[{"poster":"Spârky","date":"2017-05-24T18:02:50.788+0000","up_votes":2,"down_votes":0,"body":"{{champion:202}}  {{champion:202}}  {{champion:202}}  {{champion:202}}","replies":[]}]}]},{"poster":"Tobias Brackner","date":"2017-05-24T09:13:15.717+0000","up_votes":4,"down_votes":1,"body":"I'm of the mind that people gotta git gud.","replies":[]},{"poster":"coldwingzz","date":"2017-05-24T22:56:13.618+0000","up_votes":1,"down_votes":0,"body":"Let me explain something, Go look at the Damn botrk changes, then tell me it was a small nerf. This nerf to 20 mana was unwarranted and just gates luc more and more, not to mention hes only strong because of the botrk item. That item gets nerfed, then luc gets nerfed. Same shit happens to every champion, with the changes to botrk I imagine luc is going to be the weakest if not the second weakest marksmen in the game.  Looks like your just a low elo player, thatdoesn't understand how to face him and if you go ahead and do what you did to show he's op then go ahead and do that to every champion. {{champion:69}} INSANE DPS, HEALING ON Q NO COOLDOWN, HER W MAKES IT SO YOU CANT MOVE AND OMG HER POISON MAKES HER INSANE PLUS HER ULT IS SO EASY TO HIT AOE STUN OP OP. {{champion:12}}  HE HAS SOOO MUCH CC SO MANY STUNS AND KNOCKUPS YOU CANT HIT HIM HES OP NOT TO MENTION HIS ULT MAKES HIM IMPOSABLE TO KILL AND TAKES AWAY CROWD CONTROL, PLUS HE HAS A HEAL THAT HE SPENDS NO MANA TO USE OP OP OP! Circle jerk more boards padawan.","replies":[{"poster":"1995 2017RiP Eva","date":"2017-05-24T23:42:50.944+0000","up_votes":1,"down_votes":1,"body":"First i am  higher than you you pathetic goldie...(Which is silver because you are gold 3..) so have some respect\n\nSecond 20 mana cost would drop lucian to Kalista/Urgot lvl?\n\nDo this game a favor and quit league of legends it would be better for the game","replies":[{"poster":"King of Demons","date":"2017-05-25T10:30:15.428+0000","up_votes":2,"down_votes":0,"body":"Holy shit did you just use your low elo to make an argument? Lmao","replies":[]},{"poster":"coldwingzz","date":"2017-06-10T01:34:36.834+0000","up_votes":1,"down_votes":0,"body":"Mind you this was a smurf I use for meme's and dreams. Get with the program buddy ;)  also posted this when the botrk nerf was making botrk deal half dmg for ranged champions.","replies":[]}]}]},{"poster":"BoilTheOil","date":"2017-05-25T05:49:50.707+0000","up_votes":2,"down_votes":0,"body":"honestly the mana increase is quite a bit since he spams the spell so much","replies":[]},{"poster":"HaIlMonitor","date":"2017-05-25T02:36:27.955+0000","up_votes":2,"down_votes":0,"body":"They are double nerfing him though if the bork changes go through. So he will be nerfed pretty hard imo.","replies":[]},{"poster":"woodvsmurph","date":"2017-05-24T21:27:26.039+0000","up_votes":2,"down_votes":0,"body":"Higher mana cost does sound like a solid solution to begin with - how much increase, I don't know. But increasing the mana cost and/or dropping his mana regen value mean's he can't mindlessly spam spells forever and he does lose much of his power when he runs out of mana. Thus Riot reinforces the sivir build - triple crit, armor pen, and lifesteal with essence reaver being a must as one of your crit items","replies":[]},{"poster":"2Charmnot2Charm","date":"2017-05-24T14:17:21.342+0000","up_votes":3,"down_votes":1,"body":"They are pushing him to building ER {{sticker:zombie-brand-facepalm}} \n\nIf you nerf a champ's mana cost their builds will be less flexible because they have to build something to offset the mana they are going to burn through.","replies":[]}]}