{"poster":"Astrophysicality","date":"2016-09-29T02:36:47.124+0000","title":"Unable to login to riot support??","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"As i was attemping to send in a ticket for being unable to login to league (Login server did not respond), it asked me to log in. So, i do. It says something along the lines of \"you must confirm your email address. A confirmation has been sent. Please check in a few minutes\". I get no email. It is also weird since i have been actively receiving emails from league of legends, so there would be no need to confirm.\r\n\r\n All i'm trying to do is log in to  league {{item:3070}} \r\n\r\nsend help","replies":[{"poster":"Targons Blade","date":"2016-09-29T20:44:59.115+0000","up_votes":1,"down_votes":0,"body":"In order to login to the support site, you have to be email verified. Check your spam folder to ensure the verification email isn't landing there. \n\nLet me know if you still aren't getting the verification email.","replies":[{"poster":"Astrophysicality","date":"2016-09-30T02:54:19.755+0000","up_votes":1,"down_votes":0,"body":"Finally figured out how to get the verification email. Now for the part of the not being able to log in. Tried uninstalling, patching, switching wifis, hextech tool, nada. :(","replies":[{"poster":"Targons Blade","date":"2016-10-02T15:24:58.425+0000","up_votes":1,"down_votes":0,"body":"Can you let me know exactly what error message you get when you try? Or can you [send me a screenshot](https://gyazo.com/) of the error?","replies":[{"poster":"Astrophysicality","date":"2016-10-03T12:29:30.150+0000","up_votes":1,"down_votes":0,"body":"Hey, sorry i never responded. I eventually brute forced my way in by trying to log in multiple times. The error message I got was \"did not recieve response from the server Attempt 1....2....3....4... Error\"\n\nIts all good, got logged in.","replies":[]}]}]},{"poster":"BlackGodDeath","date":"2016-09-29T23:25:24.203+0000","up_votes":1,"down_votes":0,"body":"hi can you help me. i go to log in and this is the messeges\nThis account has been permanently suspended. Please check the email address associated with your League of Legends account for additional details.","replies":[{"poster":"Targons Blade","date":"2016-10-02T15:24:09.943+0000","up_votes":1,"down_votes":0,"body":"For your specific issue, you'll want to reach out to our support team via a [support ticket](https://support.riotgames.com/hc/en-us/requests/new) so we can provide context as to why you're seeing that.","replies":[]}]},{"poster":"Astrophysicality","date":"2016-09-30T01:37:59.293+0000","up_votes":1,"down_votes":0,"body":"I attempted to change my email to see if i had entered it wrong, and it says that that is already my email. So, my email is fine, checked junk folder, nothing there. Unable to login to either the game itself or support site.","replies":[]}]},{"poster":"BlackGodDeath","date":"2016-09-29T06:20:27.290+0000","up_votes":1,"down_votes":0,"body":"Hey me too is like someone else using mi acount","replies":[{"poster":"BlackGodDeath","date":"2016-09-29T06:21:11.004+0000","up_votes":1,"down_votes":0,"body":"they say i permenaly bannen :(","replies":[]}]}]}