{"poster":"Drake Persia","date":"2016-05-14T11:31:09.389+0000","title":"Shurima","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"ciao a tutti ragazzi. questo &egrave; la mia prima discussione aperta quindi pls non flammate :&#039;)\r\nvorrei parlare di Shurima, o meglio, dei campioni provenienti a quella citt&agrave;. tutti conosciamo i campioni presenti in league of legend&#039;s provenienti da Shurima quali sono, per&ograve;, direi che ne manca qualcuno, con il nuovo campione &egrave; stato creato un nuovo mid laner quindi siamo a 3 per la mid, 2/3 per la top, 2 per la giungla,e un solo adc d&#039;altronde senza un support proveniente da Shurima. non sono in grado di creare qualche idea ma penso che a chiunque farebbe piacere fare delle custom con campioni della stessa zona, faccio un esempio, quanti di voi avete mai pensato di creare un team di Shurima?! [tra cui: Azir, Xerath, Nasus, Renekton, Sivir, rammus, Skarner e il nuovo champ (di cui non ricordo il nome)]. non pensate ci manca qualcosa? Es. Mi trovo in ts con altri nove ragazzi e vorremmo fare Shurima &quot;Azir contro Xerath&quot; e tutti gli alleati dei rispettivi comandanti. (Azir, Nasus, Sivir vs Xerath, Renekton e?!?!?!) non essendoci un altro adc e due support resta impossibile creare il team quindi siamo costretti ad abbandonare l&#039;idea e cambiare regione, come ad&#039;esempio, Ionia, Noxus, Demacia, che sono molto pi&ugrave; complete ed&#039;organizzate e che se si vuole fare un game (noxus vs noxus) &egrave; possibile farlo. \r\nditemi cosa ne pensate e chi ha una fervida immaginazione che si mettesse a lavoro per creare il campione mancante per la nostra cara citt&agrave; Shurima. {{champion:268}}","replies":[{"poster":"SickAnto","date":"2016-05-14T11:48:05.855+0000","up_votes":1,"down_votes":0,"body":"A dire il vero Talyiah per quel che mi sembra, potrebbe benissimo essere un supporto e non un midlaner. Se dobbiamo fare i pignoli, l'unica categoria di campione che manca di Shurima è l'assassino, poi c'è pure Cassiopeia da considerare, visto che ha avuto una parte non poco rilevante nelle lore di Azir e Sivir ; )","replies":[{"poster":"Drake Persia","date":"2016-05-14T13:12:54.455+0000","up_votes":1,"down_votes":1,"body":"ma c'è comunque il problema che il team non è completo, quindi un team completo di tutto ovvero:tank, assassin, mage, adc e supp, non si può creare in ne in uno ne in due team in vs.\n\nps. antooo da quanto tempooo! ","replies":[{"poster":"SickAnto","date":"2016-05-14T16:14:48.175+0000","up_votes":1,"down_votes":0,"body":"Nasus e Renekton top\nSkarner e Rammus jungle\nAzir e Xerath mid\nTalyiah e Amumu support \nSivir adc\nBeh, un team di Shurima si potrebbe fare, non due ma tanto ne usciranno altri più in la. P. S. Nemmeno con Noxus si potrebbe fare due team visto che c'è solo come adc Draven e nessun support.\nAnnie la sto escludendo perché nonostante la sua attuale (e non più canonica) lore dica che sia di origine di Noxus, il suo concept non c'entra un bel niente e in un futuro aggiornamento sarà sicuramente collocata tra le città di Piltover o Zaun.\nP. P. S. Ricordo il tuo nome ma non ricordo su cosa avevamo discusso tempo fa -w-.","replies":[{"poster":"Vileblood Pyke","date":"2016-05-14T23:34:01.778+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SickAnto,realm=EUW,application-id=MJVj50Jw,discussion-id=OjU8ABAM,comment-id=000000000000,timestamp=2016-05-14T16:14:48.175+0000)\n>\n> Annie la sto escludendo perché nonostante la sua attuale (e non più canonica) lore dica che sia di origine di Noxus, il suo concept non c&#x27;entra un bel niente e in un futuro aggiornamento **sarà sicuramente collocata tra le città di Piltover o Zaun**.\n\nSe volessimo proprio essere precisi, sono i suoi genitori ad essere di Noxus, lei è nata nelle Lande Voodoo. Inoltre, non citando la Lega da nessuna parte, potrebbe ancora essere canonico,\nE poi queste notizie dove le hai prese? Anche perché mi suona un po' strano che una bambina con poteri magici risieda tra le due città più tecnologiche di Valoran,,,","replies":[{"poster":"SickAnto","date":"2016-05-15T09:05:14.000+0000","up_votes":1,"down_votes":0,"body":"Ma pur sempre il suo concept non c'entra niente alle Lande Voodoo, insomma, è vestita come una bambina dei nostri tempi xD\nGià tempo fa (non ricordo dove e quando) il rioter Iron Stylus aveva fatto intendere che con la sua futura nuova lore sarà collocata tra le due città più tecnologiche di Valoran.\n\n> Anche perché mi suona un po' strano che una bambina con poteri magici risieda tra le due città più tecnologiche di Valoran,,,\n\nLa tecnologia Hextech è alimentata da cristalli magici e la Tecnomaturgia unisce tecnologia e magia, quindi non ne vedo alcun problema nel collocare Annie li, dove di magia non ne manca : D","replies":[{"poster":"Vileblood Pyke","date":"2016-05-15T09:18:10.285+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SickAnto,realm=EUW,application-id=MJVj50Jw,discussion-id=OjU8ABAM,comment-id=00000000000000010000,timestamp=2016-05-15T09:05:14.000+0000)\n>\n> Ma pur sempre il suo concept non c&#x27;entra niente alle Lande Voodoo, insomma, è vestita come una bambina dei nostri tempi xD\n\nFa parte di una colonia di gente scappata da una città, non di una tribù di stregoni Voodoo. È normale che abbia abiti di questo tipo.\n\n> Già tempo fa (non ricordo dove e quando) il rioter Iron Stylus aveva fatto intendere che con la sua futura nuova lore sarà collocata tra le due città più tecnologiche di Valoran.\n\nSenza link mi suona un po' difficile da credere, senza offesa.\n\n> La tecnologia Hextech è alimentata da cristalli magici e la Tecnomaturgia unisce tecnologia e magia,\n\nSì, ma sono completamente diversi. Stiamo parlando di doti magiche contro oggetti inventati dall'uomo caricati a magia.\nSarebbe come paragonare un uomo capace di creare fiamme ad un altro con un lanciafiamme.","replies":[]}]}]},{"poster":"Drake Persia","date":"2016-05-14T18:24:04.490+0000","up_votes":1,"down_votes":0,"body":"se conosci la lore di Shurima, azir era contro Xerath dopo il tradimento, mentre nasus e renekton furono divisi per combattere Xerath. (nasus rimase nella città di shurima mentre renekton fu trascinato nel sigillo insieme a Xerath, che poi col tempo uscì fuori di testa {{champion:58}} e andò dalla parte di quest'ultimo) quello che io ho inteso è che creare una custom tra le due fazioni di shurima per adesso non è per niente possibile, e questa è una cosa che non mi va a genio dato che i campioni di shurima sono quasi tutti stupendi.\nP.S. noxus non ha un supp?! si deve creare allora.\nP.P.S. sono Drake!!! quello del ts insieme a gemini e gli altri!!! -.-\"\nP.P.P.S. due team di ionia uno contro l'altro e seguendo le rispettive lore è possibile, e io è questo che chiedo. fare dei team seguendo le rispettive lore.","replies":[{"poster":"SickAnto","date":"2016-05-14T20:04:46.046+0000","up_votes":1,"down_votes":0,"body":"> noxus non ha un supp?! si deve creare allora.\n\nNon che sia una cosa obbligatoria, ma di sicuro un giorno lo faranno.\n\n> sono Drake!!! quello del ts insieme a gemini e gli altri!!! -.-\"\n\nHo una pessima memoria.\n\n> due team di ionia uno contro l'altro e seguendo le rispettive lore è possibile, e io è questo che chiedo. fare dei team seguendo le rispettive lore.\n\nEscluso Varus non ci sono altri ioniani Adc : / a meno che non metti Kennen in quel ruolo xD\n\nComunque, sì, sarebbe bello creare delle squadre per le fazioni in maniera completa, visto che a me piacerebbe fare un \"Artiglio d'Inverno Vs Avarosani\" ma i primi sono in pochi xD","replies":[{"poster":"Vileblood Pyke","date":"2016-05-14T23:27:25.007+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SickAnto,realm=EUW,application-id=MJVj50Jw,discussion-id=OjU8ABAM,comment-id=00000000000000000000,timestamp=2016-05-14T20:04:46.046+0000)\n>\n> Escluso Varus non ci sono altri ioniani Adc : /\n\nJhin.","replies":[]}]}]}]}]}]},{"poster":"Subundu","date":"2016-05-14T13:18:30.208+0000","up_votes":1,"down_votes":0,"body":"Io è da un bel pò che propongo ai miei amici di fare il team pentakill, ma nessuno sa usare {{champion:30}}...chi ha pane...","replies":[{"poster":"Drake Persia","date":"2016-05-14T13:42:08.864+0000","up_votes":1,"down_votes":0,"body":"ho commentato male hahaha mi ero dimenticato che c'era un team pentakill di SKIN e non di ultimate hahaha","replies":[]}]}]}