{"poster":"Hibiki Yamazaki","date":"2017-07-30T21:20:00.793+0000","title":"I am Done","subforum":"Ligen & gewertete Spiele","up_votes":0,"down_votes":8,"body":"So liebe Leute wie der Titel schon sagt I am done. Ich will dieses Spiel  nicht mehr spielen .\r\n1. Die ach so intelligenten Patches ( ich hoffe ihr merkt die Ironie)\r\n2. Das wundervolle Matchmaking( ach so sch&ouml;n du hast in der Regel immer einen Inter oder einen super netten tollen spieler der sich richtig m&uuml;he gibt pro minute einmal zu sterben)\r\n3. Die beiden oberen Komponenten dienen dazu aus guten Spielern die f&uuml;r ihr team spielen und alles tun  folgendes zu machen:\r\nfolgendes: einen mega toxischen negativ schlechten und voller Hass eingestellten Spieler!!!!!\r\nIch habe keine Lust mehr meine Nerven als auch mich mit so einem Schei&szlig; zu belasten und deshalb lege ich das hier mal so &ouml;ffentlich nieder und mir ist auch egal was andere denken. An jeden feeder Inter oder hochbegabten Spieler (ironie) ich hoffe f&uuml;r diese genannten Personen ich hoffe ihr werdet mit den schlechtesten Spielern der Welt gematched , ich hoffe das ihr nie wieder Spa&szlig; an diesem Spiel haben werdet und ich w&uuml;nsche solchen Spielern das schlechteste was man solchen Spielern nur w&uuml;nscehen kann.\r\n\r\nPS: Nur weiter so das ist der richtige weg um Leute sauer zu machen und zu ver&auml;rgern","replies":[{"poster":"Gordalf","date":"2017-07-30T21:23:32.896+0000","up_votes":6,"down_votes":0,"body":"Tilt lvl over 9000:D\nBeruhig dich und mach ne Lol Pause^^","replies":[{"poster":"Hibiki Yamazaki","date":"2017-07-30T21:32:00.178+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Gordalf,realm=EUW,application-id=ip27PlEH,discussion-id=T1AGHBIp,comment-id=0000,timestamp=2017-07-30T21:23:32.896+0000)\n>\n> Tilt lvl over 9000:D\n> Beruhig dich und mach ne Lol Pause^^\n\nNe gibt keine Pause mehr ich rechne ab mit diesem Spiel und auch mit diesen ganzen Leuten egal wo ich unterwegs bin ob ich einen spectate oder selber am spielen bin es sind solche braindead   Spieler unterwegs wo du dich einfach fragst alter was macht er in dieser ELO.  Und ja bevor gleich wieder ein schlauer  Mensch schreibt prozentual gesehen erlebt das jeder Spieler wie du ..... Nein tut er nicht er hat keinen thresh  der  in 4 Leute reingeht nein er hat keinen adc der in die Mitte läuft und das ganze Spiel lang flamt mein letztes Game hat mir den Rest gegeben es hat sich so viel angestaut am liebsten würde ich jetzt bis in Bronze runtertrollen und allen heimzahlen aber so ein Mensch bin ich nicht weil andere dafür nichts können....","replies":[{"poster":"PKSquid","date":"2017-07-30T21:48:50.490+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Hibiki Yamazaki,realm=EUW,application-id=ip27PlEH,discussion-id=T1AGHBIp,comment-id=00000000,timestamp=2017-07-30T21:32:00.178+0000)\n>\n> Ne gibt keine Pause mehr ich rechne ab mit diesem Spiel und auch mit diesen ganzen Leuten egal wo ich unterwegs bin ob ich einen spectate oder selber am spielen bin es sind solche braindead   Spieler unterwegs wo du dich einfach fragst alter was macht er in dieser ELO.  Und ja bevor gleich wieder ein schlauer  Mensch schreibt prozentual gesehen erlebt das jeder Spieler wie du ..... Nein tut er nicht er hat keinen thresh  der  in 4 Leute reingeht nein er hat keinen adc der in die Mitte läuft und das ganze Spiel lang flamt mein letztes Game hat mir den Rest gegeben es hat sich so viel angestaut am liebsten würde ich jetzt bis in Bronze runtertrollen und allen heimzahlen aber so ein Mensch bin ich nicht weil andere dafür nichts können....\n\n\nDann scheinen Onlinespiele einfach nicht dein Ding zu sein","replies":[{"poster":"zLives","date":"2017-07-30T22:46:56.295+0000","up_votes":2,"down_votes":0,"body":"Naja alles was er beschrieben hat hatte ich schon ... und mein prem8 hatte auch kein Bock mehr auf mich weil immer nur solche Leute mit mir spielen xD (aber meistens nur wenn er mit mir spielt aber hey) aber man findet nette und \"gute\" Spieler hin und wieder, sie einfach mal adden und mit dennen zusammen spielen macht um einiges mehr Spaß dann oder mach es direkt schlau und Spiel in einer Gruppe aus 5 leuten","replies":[{"poster":"PKSquid","date":"2017-07-30T23:48:29.620+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=zLives,realm=EUW,application-id=ip27PlEH,discussion-id=T1AGHBIp,comment-id=0000000000000000,timestamp=2017-07-30T22:46:56.295+0000)\n>\n> Naja alles was er beschrieben hat hatte ich schon ... und mein prem8 hatte auch kein Bock mehr auf mich weil immer nur solche Leute mit mir spielen xD (aber meistens nur wenn er mit mir spielt aber hey) aber man findet nette und &quot;gute&quot; Spieler hin und wieder, sie einfach mal adden und mit dennen zusammen spielen macht um einiges mehr Spaß dann oder mach es direkt schlau und Spiel in einer Gruppe aus 5 leuten\n\nNaja oder man achtet nicht auf den Chat und wird durch solche Sachen nicht gleich zum Hulk ^^\nAber das schaffen viele wohl einfach nicht.","replies":[{"poster":"zLives","date":"2017-07-31T01:51:12.797+0000","up_votes":1,"down_votes":0,"body":"Naja lässt sich nichts dran tun ... und dadurch hat man direkt 2-3 Spieler die sich nicht mehr konzentrieren oder überhaupt alles Solo machen und nur tower farmen obwohl man ez mit ihrer Hilfe das Game gewonnen hätte (war zwar ein normal aber plz wie kommen solche Leute in Platin rein)","replies":[]}]}]}]}]}]},{"poster":"Pridedreamer1","date":"2017-07-31T15:07:19.312+0000","up_votes":4,"down_votes":0,"body":"Wenn du so reagierst, solltest du dich mal mit dem begriff Soloq befassen. Es wird immer schwerer so höher du kommst die Leute zu carrien. Wenn du mad wirst das du nicht in high elo kommst, dann solltest du vielleicht wieder das spiel zum Spaß spielen und den Gotteskomplex langsam abzubauen. Btw in soloq kannst du nicht jedes Game gewinnen, du wirst immer irgendwann verlieren. Du kannst auch nicht erwarten das in Soloq alles so koordiniert ist wie in Teamranked. Clownfiesta gibts immer und wenn die leute in deinem Team mad werden ist das ganz normal, da ja jeder mal nen schlechten Tag hat. Hilft dir auch nicht weiter den Leuten alles schlechte dieser Welt zu wünschen. Schau dir am besten dopa oder so an und schaue wie wenig er tiltet. Und am Ende des Tages ist lol auch nur ein spiel. Hoffe das du bald wieder Spaß an lol findest und deine attetude besser wird:)","replies":[]},{"poster":"Pure Cynicism","date":"2017-07-30T22:44:16.232+0000","up_votes":5,"down_votes":1,"body":"Ja, dann hör doch halt auf. Aber warum hast du so ein Mitteilungsbedürfnis. Deinstallieren, Accountlöschung beantragen, fertig.","replies":[]},{"poster":"Sirrkas","date":"2017-07-31T11:34:37.438+0000","up_votes":3,"down_votes":0,"body":"Aber warum sagst du uns das?\n\nNiemand hier kennt dich. Deshalb interessiert es hier niemanden ob du LoL spielst oder nicht und jeder hier kann erkennen, dass deine Meinung über LoL sehr subjektiv geprägt ist. Dazu dann noch die wahllosen Verwünschungen an zufällige Leser.","replies":[]},{"poster":"BenitoMalzzolini","date":"2017-07-31T08:43:42.393+0000","up_votes":2,"down_votes":0,"body":"ich geb dir recht, es sind imer die anderen #kappa. imaqtpie und co müssen einfach nur glück haben, mehrere accs in challenger und das nicht weil sie gut spielen... nein nein nein, sondern weil die gute teammates hatten.","replies":[]},{"poster":"Necromant","date":"2017-07-31T07:09:25.071+0000","up_votes":2,"down_votes":0,"body":"Ich muss dir leider sagen, das auch ich manchmal 0/3 oder 0/4 von der Lane gehe. Jeder macht Fehler, jeder. Auch du.\nDas Ding ist es jedoch dann als Team zusammen zu arbeiten und jenen Fehler gemeinsam auszubügeln.","replies":[]},{"poster":"FABOBABO","date":"2017-08-01T14:14:38.413+0000","up_votes":1,"down_votes":0,"body":"Was soll an den Patches nicht stimmen?\n\nWas soll am Matchmaking nicht stimmen? \nDie Leute die absichtlich feeden werden schon bestraft. Nur weil man 10 mal stirbt bedeutet es nicht, dass man das mit Absicht macht.\nUnd reporte doch einfach Leute die toxisch sind. Ich bekommen fast alle 2 Woche die Meldung, dass jeman den ich reportet habe bestraft wurde.","replies":[{"poster":"Only Renekton","date":"2017-08-01T16:28:12.641+0000","up_votes":1,"down_votes":0,"body":"ich hab mal ne woche lang jeden tag so eine Meldung bekommen xD aber seit der honor umstellung keins mehr","replies":[]}]},{"poster":"i3IackCat","date":"2017-07-31T10:53:41.281+0000","up_votes":1,"down_votes":0,"body":"Wer nicht gut genug ist sich entweder zu verbessern, oder zu akzeptieren dass er einfach schlecht ist, muss mit League Rankeds wohl aufhören oder weitertilten und irgendwann Permabanned werden.\n\nGute Entscheidung aufzuhören.","replies":[{"poster":"Hibiki Yamazaki","date":"2017-07-31T14:59:42.014+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=End of the World,realm=EUW,application-id=ip27PlEH,discussion-id=T1AGHBIp,comment-id=0004,timestamp=2017-07-31T10:53:41.281+0000)\n>\n> Wer nicht gut genug ist sich entweder zu verbessern, oder zu akzeptieren dass er einfach schlecht ist, muss mit League Rankeds wohl aufhören oder weitertilten und irgendwann Permabanned werden.\n> \n> Gute Entscheidung aufzuhören.\n\nwer nicht gut genug ist um sich zu verbessern .... finde ich ne geile aussage echt hat was. du bist platin 3 und machst so eine aussage ich bin dia und ich kann von einem dia spieler erwarten das er farmt und nicht nach 10 min. 0:6 steht das kann ich von oberen platin spielern erwarten. Die frage die ich mir stelle wie ist er nach diamond  gekommen wenn er ein spielverständnis von einer erbse hat","replies":[{"poster":"Dreadlord Mike","date":"2017-07-31T19:44:18.745+0000","up_votes":1,"down_votes":0,"body":"Erstens mal Platin 3 auf Dia 5 ist ja sooooo ein großer Unterschied...Not.\nBis man wirklich richtig high dia ist kann man von seinen Mitspielern nichts erwarten. \nBesonders in plat 3 - Dia 5 elo ist der skillunterschied in vielen Fällen wirklich enorm.\nMerk man besonders wenn du gegen nen Autofill laner spielst.\n Es gibt genug Leute die einfach dia kommen durch game gespamme oder durch abusen eines \"op\" champs der wird dann generft und dann sind sie hardstuck dia 5.","replies":[]}]}]},{"poster":"Hibiki Yamazaki","date":"2017-08-04T15:26:20.852+0000","up_votes":1,"down_votes":2,"body":"Also RIOT bevor ihr wieder schwachsinn patcht solltet ihr euch mal mehr Zeit nehmen und mehr und bessere testen bevor ihr einen patch abspielt.Und nicht omg 2 wochen sind um wir müssen patchen was machen wir ..... ehm jaa ach buff einfach tnak pass shaco angeblich an ach würfel mal bei der zahl 3 buffen wir die tank meta..... ein brain muss man scheinbar nicht sein um in der entwicklungsabteilung zu sitzen","replies":[]}]}