{"poster":"heartbr0ken","date":"2015-06-13T10:50:40.545+0000","title":"Bring back the Rune Combiner","subforum":"Miscellaneous","up_votes":2,"down_votes":0,"body":"^title says it all^\n\nWhen you have runes that you don't need just collecting dust in your virtual chest of useless runes full of AD Glyphs and Gold Quints (I don't play supp anymore), you'd wish you had the rune combiner back, right?\n\nForgive me if I placed this is the wrong category of Boards, it&#039;s not like I haven&#039;t been accused of that before on different tech forums.\nDiscuss if needed, I&#039;ll reply if I have something to add onto if your comment is significant enough.","replies":[{"poster":"Ediwir","date":"2015-06-14T03:25:19.930+0000","up_votes":1,"down_votes":0,"body":"As it was, the rune combiner was nothing more than a noobtrap. I'm sure Riot had good intentions with it, but it just didn't work, too chance-based... Basically the only way to use it was spending tons of IP, getting 30-40 lv1 runes, and then stay _up all night_ combining, hoping _to get lucky_ and get a decent rune (that you could probably get for less IP at the shop).\nIf there was anything similar, i guess it should work a lot differently, like... Let's try writing a tentative change...\n\n{{item:3190}} RuneCombiner v1.Ed\n_Updated rune combiner to provide higher performance to mid-high level summoner in every respect, including appreciation, speed and strenght. The aim is for the RuneCombiner to be a useful tool for summoners to keep their beginner runes useful trough their leveling career._\n\n{{summoner:21}} **Harder:** The Rune Combiner is now unlocked at summoner level 10 and upgraded to use T2 runes at summoner level 20 and T3 runes at summoner level 30. Requires 6 T1 runes, 9 T2 runes or 3 T3 runes to be combined, from 5 of any kind.\n\n{{summoner:13}} **Better:** now includes a bin to discard unused or unwanted runes, allowing you to recollect 75% of their IP value. Buyback is available for 24 hours or until the first IP purchase.\n\n{{summoner:6}} **Faster:** right-clicking on one rune now fills all empty spots in the combiner with the same type of rune. If any rune slots are empty after this, Rune Combiner will also suggest same-type runes to fill empty spaces and allow purchase from the same screen.\n\n{{summoner:12}} **Stronger:** now gives you a higher level rune of the same kind of the runes used in the combiner. If you use multiple type of runes, the resulting rune type will be based on how many runes of each type were combined, assigning a percentage chance to each type. Combining three T3 runes results in a random T3 Quintessence.\n\nDiscuss.\n{{champion:74}} ","replies":[{"poster":"heartbr0ken","date":"2015-06-15T07:17:55.979+0000","up_votes":1,"down_votes":0,"body":"good enough to take over the whole thread, i look like a mole hill compared to this mountain","replies":[{"poster":"Ediwir","date":"2015-06-15T09:07:46.653+0000","up_votes":1,"down_votes":0,"body":"*tips fedora*","replies":[]}]}]},{"poster":"Alamo","date":"2015-06-15T08:52:58.462+0000","up_votes":1,"down_votes":0,"body":"That thing wasted my ip. Pls rito dont tempt me again!!","replies":[]},{"poster":"JasonWazza","date":"2015-06-14T00:57:17.070+0000","up_votes":1,"down_votes":0,"body":"Why?","replies":[{"poster":"heartbr0ken","date":"2015-06-15T07:18:57.991+0000","up_votes":1,"down_votes":0,"body":"rhetorical question","replies":[]}]},{"poster":"She Loves Me","date":"2015-06-14T03:40:46.979+0000","up_votes":1,"down_votes":0,"body":"this has to be one of molendo's smurfs. Only he would bait this hard.","replies":[{"poster":"heartbr0ken","date":"2015-06-15T07:17:25.317+0000","up_votes":1,"down_votes":0,"body":"wat da fk","replies":[]},{"poster":"Ediwir","date":"2015-06-14T03:47:50.962+0000","up_votes":1,"down_votes":0,"body":"I bit.\nAnd i bite hard.\nLet's see if he can pull :)","replies":[]}]}]}