{"poster":"Tusutaki","date":"2017-07-10T23:14:58.967+0000","title":"In this season, Meta Picks > Team Composition","subforum":"Gameplay","up_votes":2,"down_votes":2,"body":"One of the aspects I value the most when playing a game is team composition. What champion would work best for my team and against the enemy team. My team is all ranged? I could pick Nautilus and peel as much as I can or I can pick Soraka to make up the lack of tanks while at the same time keeping the damage advantage.\r\n\r\nNow in this season? They are significantly less viable even when their&#039;s synergy. Thats because generalist champions dominate since they can do everything you want and champs who fulfill a specific role/playstyle keeps getting nerfed. \r\n\r\nTake a look at Galio for example. He can effectively fulfill 4 roles. Mid, top, jung, and supp. Why? \r\n\r\n* Has %max hp ranged damage/waveclear without investing any damaging items\r\n* Damage reduction AOE taunt that cannot be interrupted and mobile\r\n* AOE damage reduction knockup Ult for your allies that can be used across the map with shorter channel time than Panth and Shen.\r\n* Enhanced AOE autos \r\n* Passive magic shield\r\n* Can take Stonebound fulfill as a Soraka\r\n\r\nHe literally has everything you want and is never a bad pick. He&#039;s objectively better than 90% of his counterparts. This season is where the safest picks are also the strongest picks. \r\n\r\nNow im not saying meta picks never existed but the gap between viable champs is ever so increasing at an alarming rate.","replies":[{"poster":"Critmaster Garen","date":"2017-07-10T23:22:35.745+0000","up_votes":3,"down_votes":0,"body":"false. support itemization and adc items is what wins games.\n\ni just won a game on cho that i turned around entirely on my own back just by pressing locket for a 1500 aoe health shield in a fight.\n\neveryone on my team literally had his own health pool in shielding. except tristana who had double her health bar in shielding, because she was also shielded by the support... while she had g.a. ... and then everyone got redemption.","replies":[]},{"poster":"TehNACHO","date":"2017-07-10T23:18:55.159+0000","up_votes":2,"down_votes":1,"body":"Mrw post starts off actually alright, then reverts to a gameplay meme.\n\nSigh...Something something let's just list and over exaggerate all of a champion's strengths with no contexts or weaknesses.\n\nHell you're even late to the party. Statistics suggest that Galio's statistically at his weakest in solo Q. I don't pay attention to competitive matches, but if Galio's still a premier pick in the LCS or whatever, might I suggest it may be because he rounds out the teamcomp well and it isn't just because he's an op pick?","replies":[{"poster":"Tusutaki","date":"2017-07-10T23:57:37.727+0000","up_votes":1,"down_votes":0,"body":"Then what is Galio's weakness? What would someone be sacrificing or even risking when picking Galio, Kled, Lee, Warwick, Fiora, Zac, and Cait? You can mix in any meta champs in a team and it will be superior over a proper team composition. \n\nPeople would choose Riven for her offensive capabilities while sacrificing defense so someone would have to make up for that.  Even though Riven has high offense, she is a feast or famine type champ so you can shut her down thus adding risk. With that saying, why would you pick her when there's Kled who has the same offensive capabilities while being arguably more mobile and makes up Riven's weaknesses? \n\nWhy would one ever choose Shyvana or even Yi when Warwick accomplishes the same task without having the weaknesses of the former?\n\nTeam composition matters less this season because the gap between meta and nonmeta champs is the biggest i've ever experienced.","replies":[]}]},{"poster":"C9 Squeeky ","date":"2017-07-11T03:08:43.838+0000","up_votes":1,"down_votes":0,"body":"lol fine go to champion.gg, put together the top champ in each role, I guarantee you they won't win vs a teamfight wombo combo or teams that how to 1-3-1 split correctly.","replies":[]},{"poster":"Primal Fear","date":"2017-07-10T23:36:29.475+0000","up_votes":1,"down_votes":0,"body":"When I play seriously I can actually climb pretty fast. I am just spamming Miss Fortune and Miss Fortune is not considered a meta pick. Yesterday I was Plat V with 0 LP. Now I am Plat III with 0 LP. I mainly spammed Miss Fortune. I got from Gold V to Plat V in 9 days by spamming Miss Fortune. \n\nYou don't need overpowered meta picks to climb. Atleast not before diamond 2","replies":[]},{"poster":"HaIlMonitor","date":"2017-07-10T23:29:53.542+0000","up_votes":1,"down_votes":0,"body":"{{champion:412}} {{champion:64}} {{champion:51}}{{champion:103}}  (before it was Lucian and her) Those are always safe picks, and fit into any comp. They have been like that for a long time, and it isn't new to this season.","replies":[]},{"poster":"KoKoboto","date":"2017-07-10T23:24:46.869+0000","up_votes":1,"down_votes":1,"body":"The only meta is win before 10 minutes.","replies":[]}]}