{"poster":"Tusutaki","date":"2017-05-21T23:38:27.961+0000","title":"Is there any reason to choose Ancient Coin over Frost Queen's Claim?","subforum":"Gameplay","up_votes":62,"down_votes":6,"body":"The original purpose of the support item trio was to complement a champion&#039;s kit and playstyle. Targon giving sustain and health for melee supports, Frost giving damage for damage supports, and Coin giving health for passive supports. With the new quest system, Targon and Frost has seen an upgrade however the Coin lineup got reworked and it&#039;s quest reward is almost worthless when compared with Targon and Frost. \r\n\r\nInstead of Coin giving health, it gives a random chance of gold or mana that drops from minions like Thresh&#039;s soul mechanic and like Thresh, you have to approach them to receive them. Who is supposed to benefit from this item now? Why would a passive support choose this item now over Frost when Frost gives better stats and rewards all around? \r\n\r\nThe quest reward for Coin, Elixir of Skill, while neat in concept, its poor in execution. Could we perhaps get another quest reward or maybe buff Elixir to where it increases your ult rank by 1 if not already maxed out? And can we please change the passive of Talisman of Ascension&#039;s &quot;Point Runner&quot;? Im not saying I dont like Point Runner at all it just that there are multiple items I build that also has Point Runner which makes them a waste of value. Maybe replace the passive to where it increases movement speed by 5%, that increases to 10% when out of combat? \r\n\r\nI dont know, what do you guys think?","replies":[{"poster":"Choten","date":"2017-05-22T00:02:40.029+0000","up_votes":23,"down_votes":6,"body":"I don't like Ancient Coin dropping the coins.  When I'm trying to play a passive healer, it defeats the purpose if I have to run near the enemy ADC and Support to pick up the coins and risk getting destroyed.  On Healers it's safer to just go {{item:3303}}","replies":[{"poster":"Myozthirirn","date":"2017-05-22T00:27:00.414+0000","up_votes":14,"down_votes":4,"body":"***","replies":[{"poster":"Tranoze","date":"2017-05-22T00:29:34.463+0000","up_votes":17,"down_votes":2,"body":"> [{quoted}](name=Myozthirirn,realm=EUW,application-id=3ErqAdtq,discussion-id=VP9HKVxa,comment-id=00020000,timestamp=2017-05-22T00:27:00.414+0000)\n>\n> Its actualy the other way around:\n> {{item:3301}}  - &gt; You have to run into dead minions for income, pickup range scales with your range.\n> {{item:3303}}  -&gt; You have to run into enemy and hit them for income.\n\nuh, beside {{champion:44}} , all healer are ranged, so basically you dont need to run into enemy to hit them  for income, you poke them from afar.","replies":[{"poster":"Myozthirirn","date":"2017-05-22T00:47:08.921+0000","up_votes":4,"down_votes":13,"body":"***","replies":[{"poster":"Mysticman89","date":"2017-05-22T01:01:24.482+0000","up_votes":14,"down_votes":0,"body":"MF support is happy to have ap for her e (and to a lesser extent her ult). Make it rain is also pretty reliable stacks (albeit not as reliable now since theres a little over a second cd on getting stacks from the same ability).\n\n...What even is kalista support supposed to do?\n\nedit: Also, rakan can get 3 spellthiefs procs easy enough. W in (1), AA(2), Q(3), E out, repeat with minimal risk.","replies":[]},{"poster":"Tranoze","date":"2017-05-22T01:30:05.333+0000","up_votes":4,"down_votes":0,"body":"Who tf pick {{champion:412}} if they want to play passive?\n{{champion:267}} can poke well, she can W auto (like sona Q auto) every 15 seconds, so {{item:3303}} is a good option.\nThe only 2 champions really build {{item:3301}}  are {{champion:16}}  and {{champion:40}} , Janna need it for the extra mana (her ability cost tons of mana) and the bonus movement speed. Soraka need it for the heal, since it the only item provide steady health for her.\nAll mele support should build {{item:3302}} , cuz they provide much better heal and way more gold.\nEven Yasuo can proc {{item:3303}}  https://www.youtube.com/watch?v=NPiHYs-ObE8&t=2s","replies":[{"poster":"Awoof","date":"2017-05-22T09:08:53.105+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Tranoze,realm=NA,application-id=3ErqAdtq,discussion-id=VP9HKVxa,comment-id=00020000000000000002,timestamp=2017-05-22T01:30:05.333+0000)\n>\n> The only 2 champions really build {{item:3301}}  are {{champion:16}}  and {{champion:40}}. \nSoraka need it for the heal, since it the only item provide steady health for her.\n\nExcept it doesn't anymore, that's kind of the point of this thread. Even Soraka can rather go for {{item:3303}}","replies":[]},{"poster":"FridgesArePpl2","date":"2017-05-22T14:21:09.679+0000","up_votes":2,"down_votes":0,"body":"{{item:3098}}  is infinitely better on soraka","replies":[]},{"poster":"Blade of Justic","date":"2017-05-23T16:33:41.673+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tranoze,realm=NA,application-id=3ErqAdtq,discussion-id=VP9HKVxa,comment-id=00020000000000000002,timestamp=2017-05-22T01:30:05.333+0000)\n>\n> The only 2 champions really build {{item:3301}}  are {{champion:16}}  and {{champion:40}} , Janna need it for the extra mana (her ability cost tons of mana) and the bonus movement speed. Soraka need it for the heal, since it the only item provide steady health for her.\n\nI build {{item:3301}} on {{champion:26}} because I need to get to my team members and revive/speed them up as quickly as possible.","replies":[]}]},{"poster":"It Hertz When IP","date":"2017-05-22T04:31:42.485+0000","up_votes":5,"down_votes":0,"body":"I can pretty reliably poke at least once every ten seconds with both Janna and Nami. You have to play pretty damn passive with them to not be able to (hint: you have AAs, use them).","replies":[]}]}]}]}]},{"poster":"doodlebob666","date":"2017-05-21T23:40:59.952+0000","up_votes":12,"down_votes":1,"body":"its in your recommended items and your too lazy to try anything else","replies":[]},{"poster":"DeathBurst","date":"2017-05-22T05:18:51.703+0000","up_votes":10,"down_votes":0,"body":"Sooo, I don't really disagree with you, but there are a few technical mistakes in what you say, so I'm gonna address that first.\n\n> With the new quest system, Targon and Frost has seen an upgrade however the Coin lineup got reworked and it's quest reward is almost worthless\n\n1. Coin getting reworked and the quest system being added are two different and unrelated things. You could get the new Coin dropping loot from minions without a Quest system at all.\n2. +1 skill point is a very, very under-rated reward. It doesn't **feel** impactful, and yet it **is**. The main problem is that it's useless post-level 17, whereas the other rewards are still very useful, but games rarely go long enough for supports to reach level 18. So mostly, it's a problem on paper, but not in reality.\n\n> Instead of Coin giving health, it gives a random chance of gold or mana that drops from minions [...] Who is supposed to benefit from this item now? Why would a passive support choose this item now over Frost when Frost gives better stats and rewards all around?\n\nAll support items give roughly the same amount of Gold, so what you really have to consider is actually the mana from Coin versus the damage from Spellthief. Passive supports who don't aim to kill their opponents in lane don't care about the damage and prefer the mana to use more spells for sustain/defensive CC/etc.\n\n___\n\nOverall, I do agree that Ancien Coin feels bad, but the item is actually better than it feels, you can't really straight buff it.","replies":[{"poster":"Tusutaki","date":"2017-05-22T23:02:25.435+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=DeathBurs7,realm=EUW,application-id=3ErqAdtq,discussion-id=VP9HKVxa,comment-id=000f,timestamp=2017-05-22T05:18:51.703+0000)\n>\n> Sooo, I don&#x27;t really disagree with you, but there are a few technical mistakes in what you say, so I&#x27;m gonna address that first.\n> \n> 1. Coin getting reworked and the quest system being added are two different and unrelated things. You could get the new Coin dropping loot from minions without a Quest system at all.\n\nI literally dont know how they are unrelated when the whole purpose of the quest system was to improve the support items and the said quests are supposed to compliment their corresponding item. \n\n> 2. +1 skill point is a very, very under-rated reward. It doesn&#x27;t **feel** impactful, and yet it **is**. The main problem is that it&#x27;s useless post-level 17, whereas the other rewards are still very useful, but games rarely go long enough for supports to reach level 18. So mostly, it&#x27;s a problem on paper, but not in reality.\n> \n\nIt doesnt feel impactful because it isnt. By the time you get your Skill Elixer, you most likely already maxed out your main skill that has the most impact like Soraka's heal and Janna's shield. Its not like you're actually getting a level up where you get additional stats so ranking Soraka's Q from 1 to 2 is not going to make a big difference. \n\n> All support items give roughly the same amount of Gold, so what you really have to consider is actually the mana from Coin versus the damage from Spellthief. Passive supports who don&#x27;t aim to kill their opponents in lane don&#x27;t care about the damage and prefer the mana to use more spells for sustain/defensive CC/etc.\n> \n\nFrost Queen gives mana regen. Although not as much as Coin's however there is minimal mana management involved with Meditation mastery making the two support items mana regen difference not that big.","replies":[{"poster":"DeathBurst","date":"2017-05-23T16:26:57.148+0000","up_votes":1,"down_votes":0,"body":"They are unrelated, because you could remove the Quest system, and still keep the dropping coins system to get gold. They were two changes that tried to achieve the same goal, but they still are two **independent** changes. Relic Shield and Spellthief received a Quest too, without changing how they collect gold. How Coin collects gold and the Quest it received are two independent things.\n\nAnd +1 Skillpoint is impactful, yes. One rank up in Soraka's Q is +40 damage. Compare that to the shield you get from the Relic Shield line, and you don't need a lot of Q hitting to get a bigger benefit. But when you hit a Q, you don't realize, you don't see that damage coming from the Elixir, you just see your Q hitting. So you don't *feel* the impact, but it's still there.\n\nAnd if you don't have mana regen problem with Spellthief, yes, do take Spellthief instead of Ancient Coin. But if you are regularly OOM, keep in mind you have that other option. You asked who is supposed to use Ancient Coin, I answered. Maybe it's not for you, but it has its uses.","replies":[]},{"poster":"TeCoolMage","date":"2017-05-23T13:41:58.211+0000","up_votes":1,"down_votes":0,"body":"Soraka's Q actually does huge damage if you rank it up.","replies":[]}]}]},{"poster":"undesirable team","date":"2017-05-22T04:40:01.031+0000","up_votes":10,"down_votes":1,"body":"{{item:3301}} is 1890 gold less then {{item:3092}} \nxd","replies":[]},{"poster":"Oleandervine","date":"2017-05-22T00:28:19.097+0000","up_votes":8,"down_votes":1,"body":"The Coin is pretty much garbage now. I like Talisman and Point Runner, that is fine, but the new income mechanic *does not* compliment the playstyle of the supports who take it, unlike the Shield and Edge. \nI would much rather have them rework the Coin again into something useful, instead of this pointless thing it is now.","replies":[{"poster":"RavenMagus","date":"2017-05-22T22:10:16.313+0000","up_votes":1,"down_votes":0,"body":"Well, the main problem is that Coin's old targeted playstyle is \"sit back and do nothing and be as passive as possible\", which isn't really a playstyle they are looking to promote (because it is, by definition, non-interactive).","replies":[{"poster":"Oleandervine","date":"2017-05-22T23:20:32.244+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RavenMagus,realm=NA,application-id=3ErqAdtq,discussion-id=VP9HKVxa,comment-id=00040001,timestamp=2017-05-22T22:10:16.313+0000)\n>\n> Well, the main problem is that Coin&#x27;s old targeted playstyle is &quot;sit back and do nothing and be as passive as possible&quot;, which isn&#x27;t really a playstyle they are looking to promote (because it is, by definition, non-interactive).\n\nI get that, but there are ways to encourage interaction without demanding that inherently squishy as fuck supports fling themselves at enemies to make a buck.","replies":[]}]}]},{"poster":"Myozthirirn","date":"2017-05-22T00:22:29.132+0000","up_votes":7,"down_votes":6,"body":"***","replies":[{"poster":"Steelflame","date":"2017-05-22T01:12:21.610+0000","up_votes":6,"down_votes":0,"body":"Actually, Rakan would absolutely love the Relic item, the issue is he is actually technically ranged.  Seriously, check it, he can buy Hurricane and can't buy Hydra items.   This means he has to land last hits with his base AD because unlike Thresh, he doesn't have a tool in his kit that can act as a secondary damage source for last hitting for Relic shield purposes.\n\n\nSeriously, if Rakan was classified as a melee champion I think it would go most of the way to fixing his problems as a champion, his extra 125 range over most other melees actually is screwing him over, because it doesn't give him enough range to be worth it, but cost him the melee item and mastery interactions that would help him so much such as Bandit mastery or the Relic shield and Knight's Vow's melee specific clauses.","replies":[{"poster":"Arsenic Sulfur","date":"2017-05-23T01:26:10.935+0000","up_votes":1,"down_votes":0,"body":"However having this super mobile and incredibly slippy/annoying bird man ALSO being really hard to kill is just OP.  It's the same reason why Yasuo has his double crit; so that the super mobile champion doesn't build like a tank.","replies":[]}]},{"poster":"Acheron16","date":"2017-05-22T11:01:41.649+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Myozthirirn,realm=EUW,application-id=3ErqAdtq,discussion-id=VP9HKVxa,comment-id=0003,timestamp=2017-05-22T00:22:29.132+0000)\n>\n> You get it when\n> a) You are melee but not a tank, so you cant proc spoils of war without dying.{{champion:497}} \n> b) You are ranged but dont need ap/ cant proc the dagger consistenly.{{champion:412}} {{champion:267}} {{champion:40}} {{champion:21}} {{champion:429}} \n> c) You know you are going to lose/roam and need the health regen/the &quot;+1 level&quot;.{{champion:432}} \n> \n> Coin niche is very clear, slightly weaker but generalist and way more safer than the other two.\n\nA) Rakan isn't melee\nB) Janna and Nami can proc Spellthief's just fine: Janna shields herself and autos, Nami can use W or E to proc it. Tresh uses better Targon's, despite being ranged.\nC) Bard also uses spellthief's well, even if he roams a lot. He roams, then comes into a lane and harasses the enemy, before going back to roaming.","replies":[{"poster":"Arsenic Sulfur","date":"2017-05-23T01:29:35.238+0000","up_votes":1,"down_votes":0,"body":"You can use your shield to get the coin as well.\n\nThe synergy with his passive means Thresh might pick it up a lot more often.  He was gonna run in anyway for souls and is an option for more aggressive Thresh players.  Talisman is just better than the other 2 options for engaging.","replies":[]}]}]},{"poster":"58697132DEL1","date":"2017-05-22T17:40:48.827+0000","up_votes":3,"down_votes":0,"body":"I've been only playing ancient coin. Like idk why people think it's so bad, long as your not killing the minions they drop pretty well, got buffed this path so cannon minions always drop a coin now, and grabbing them isnt too hard.\n\nAnd i like the skill point now that its fixed. Getting my lvl 2 ult or a rank 5 skill 1 level before everyone is more potent than people think. IDK honeslty I hate new frost.","replies":[]},{"poster":"PokladnicaZla","date":"2017-05-22T07:27:14.259+0000","up_votes":3,"down_votes":0,"body":"A few notes.\nWhy doesn't {{item:3069}}  build out of {{item:3096}}  and {{item:3114}} ?\nThe quest it gives isn't really something interesting or on par with {{item:3092}}  and {{item:3401}}","replies":[]},{"poster":"MysterQ","date":"2017-05-21T23:44:13.910+0000","up_votes":1,"down_votes":1,"body":"I really don't feel like one extra point in my ult is worth that much, especially if it isn't going to be like 5 levels early. Maybe a level 3 ult at level 11 would be nice. But a level 2 ult at level 10.... ok..... I'm still 2 levels behind everyone else anyways.\n\nI'm a bad player. But like what the hell does leveling my ult even do. Maybe reduce my cooldown. Not that impactful, especially over longer games imo.","replies":[{"poster":"Starboyˇ","date":"2017-05-22T02:44:04.206+0000","up_votes":3,"down_votes":0,"body":"level 3 ult at level 11 would be broken, being able to rank up your ult at level 10 and 15 can actually be important","replies":[]}]},{"poster":"ChaddyFantome","date":"2017-05-22T01:34:59.935+0000","up_votes":3,"down_votes":0,"body":"1. in matchups where you can't harass as reliably, Coin is better because you will get more gold.\n2. Coin provides more lane sustain via mana and its reward provides more longevity mid to lane game because you get free mana on assist and kill.\n3. Talisman of ascension is the best active of the 3 support items.\n4. You get CDR at level 1\n5. You can get some nice armor and speedboost near turret.\n\nCoin's whole shritck is to be a fallback option when you can't make the most of either Relic shield or SpellThief in your given matchup.","replies":[]},{"poster":"Weasel Kensei","date":"2017-05-22T21:44:52.283+0000","up_votes":2,"down_votes":0,"body":"You mean Spellthiefs Edge {{item:3303}} ...\n\nThis is Frost Queens Claim {{item:3092}} \n\nThis is Ancient Coin{{item:3301}} \n\nUpgrades to Talisman of Ascension {{item:3069}} the tier equivalent of FQC...\n\nSo if you somehow had a choice between a tier 3 sup item vs a tier 1 I would imagine that wouldnt be much of a choice.\n\nI know this picks on the letter of the topic as opposed to the spirit, but is it really that hard to know what things are called?","replies":[]},{"poster":"The Yetii Rider","date":"2017-05-22T02:46:18.719+0000","up_votes":4,"down_votes":2,"body":"Coin gives significantly more mana regeneration than Frost Queen's Claim, and that's good when you combine it with the Chalice of Harmony passive.\n\nTalisman of Ascension builds out of the same item as Zzrot Portal, so no, you can't change the name. That's why the passive is unique, to discourage people from building multiple Raptor's Cloaks.","replies":[{"poster":"Awoof","date":"2017-05-22T09:16:40.712+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=The Yetii Rider,realm=NA,application-id=3ErqAdtq,discussion-id=VP9HKVxa,comment-id=000a,timestamp=2017-05-22T02:46:18.719+0000)\n>\n> Coin gives significantly more mana regeneration than Frost Queen&#x27;s Claim, and that&#x27;s good when you combine it with the Chalice of Harmony passive.\n\nIt doesn't give any mana regeneration actually. It restores your mana, sure, but chalice converts your mana regeneration, it doesn't work with the coin's passive. So {{item:3303}} actually synergizes more with Chalice.","replies":[{"poster":"The Yetii Rider","date":"2017-05-22T13:47:36.860+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=YouCanMilkThose,realm=EUW,application-id=3ErqAdtq,discussion-id=VP9HKVxa,comment-id=000a0000,timestamp=2017-05-22T09:16:40.712+0000)\n>\n> It doesn&#x27;t give any mana regeneration actually. It restores your mana, sure, but chalice converts your mana regeneration, it doesn&#x27;t work with the coin&#x27;s passive. So {{item:3303}} actually synergizes more with Chalice.\n\nSorry, I was referring to the final items, not Coin itself. So - wait...\n\nWait, what? They don't give mana regen anymore?! \n\nHoly crap, I didn't realize. Good health regen though. \n\nWell, in that case, the reason to choose Coin over Edge is simply that Talisman active is way stronger than Eye of the Oasis is way cheaper. Both good reasons.\n\nAlso armor. Armor is way more useful than a bit of AP for a support. ","replies":[{"poster":"Champion Skin","date":"2017-05-22T14:30:16.090+0000","up_votes":1,"down_votes":0,"body":"{{item:2302}} is cheaper yes... \nBut {{item:2303}} only cost 400 more gold but gives +300 hp and +75% hp regen which is a pretty good deal ({{item:1028}} costs 400 gold and only gives 150 hp)\n{{item:2301}} only costs 300 more gold and gives +35 AP and +50% mana regen (it does have 125% LESS hp regen though)","replies":[{"poster":"The Yetii Rider","date":"2017-05-22T14:53:26.664+0000","up_votes":1,"down_votes":0,"body":"There are very few supports that have to choose between {{item:3301}} and{{item:3302}} . It's usually just a question of \"are you melee? If so take {{item:3302}} \". \n\nThe only exception to this is {{champion:412}} and that was a bad situation anyway, neither item suits Thresh's unique blend well because Thresh is just a mess of a champion. He really just needs to have his auto range cut to 175 and changed to a melee champion already, not getting the full benefit of {{item:3109}} really hurts what he as a warden is supposed to do.\n\nSo then the real competition is between Eye of the Oasis and Eye of the Watchers. 35 AP is absymally low. Most supports have 50% or less AP ratios on their skills, with some skills going as low as 10%. So you gain +3 - +17 actual benefit to your skills from Eye of the Watchers. It's not significant. \n\nThe question then becomes - is the mana regeneration or the health regeneration more important? Considering that Eye of the Oasis does give you mana every time you get an assist, it's actually pretty strong.","replies":[{"poster":"TheGoomyGamer","date":"2017-05-22T17:44:58.453+0000","up_votes":1,"down_votes":0,"body":"They should make thresh count as melee and his melee-range autos count as melee (They already have unique animations)","replies":[{"poster":"The Yetii Rider","date":"2017-05-22T20:13:32.795+0000","up_votes":1,"down_votes":0,"body":"No, Thresh doesn't need 425 range on his autos at all. It adds nothing to his kit, it's just part of an attempt from way back in Season 2 to make a support who could survive without buying items because back then we had Philosopher's Stone and wards.","replies":[]}]}]}]}]}]}]},{"poster":"o hec","date":"2017-05-22T02:41:24.776+0000","up_votes":2,"down_votes":0,"body":"I had an experience where a Sorakka support I was playing with had to walk up to pick up her coins against the opposing Draven, after the first back, he was quarter shoting her whenever she tried to pick up a coin and eventually, to prevent herself from dieing, she had to stop picking up the coins altogether. \n\nHowever, the argument can be made that which support items you buy should be matchup based (don't take coin into Draven, but maybe against some other ADC, it'd be less punishing) But even with that in mind, it seems that Coin is not worth the health cost you suffer for picking up the drops. I think this problem would be solved with some minor buffs to range of pickup and reword for getting them.","replies":[]},{"poster":"Exercise85","date":"2017-05-22T03:20:41.573+0000","up_votes":3,"down_votes":1,"body":"A major problem is that the other two items depend on your ability to do an action (poke or execute minions) while the coins are totally up to someone else (the adc) to provide a safe lane for you to pick them up.  As someone who plays a fair amount of support, picking up the coins is actually really easy... if your adc is better than the enemy adc and can help zone.  But again, the type of support who would take this item isnt known for zone pressure, so again its up to the adc to make or break the item for you.\n\nTerrible idea for an item.","replies":[]},{"poster":"R18","date":"2017-05-23T18:53:36.590+0000","up_votes":1,"down_votes":0,"body":"FQC is a completed item. Ancient coin cost 350. wat","replies":[]},{"poster":"The King Discord","date":"2017-05-23T06:18:11.558+0000","up_votes":1,"down_votes":0,"body":"i pick it up as {{champion:41}}  gives me great sustain ORANGES FOR DAYS","replies":[]},{"poster":"Misticaltom","date":"2017-05-23T05:58:14.547+0000","up_votes":1,"down_votes":0,"body":"That extra level tho bro.","replies":[]},{"poster":"invisiblecat1","date":"2017-05-23T00:02:46.057+0000","up_votes":1,"down_votes":0,"body":"{{item:2302}} >{{item:2301}} \nBUT\n{{item:3092}} >{{item:3069}} \nThis is my opinion, but I feel it can be justified\nI build coin when I want to have an extra slot for items, but frost queens when I want to deal some damage\nBut obviously, you are going to just want to get spelltheifs for the movespeed AND damage","replies":[{"poster":"rtbf221651412","date":"2017-05-23T01:37:03.438+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=invisiblecat1,realm=NA,application-id=3ErqAdtq,discussion-id=VP9HKVxa,comment-id=0027,timestamp=2017-05-23T00:02:46.057+0000)\n>\n> {{item:2302}} &gt;{{item:2301}} \n> BUT\n> {{item:3092}} &gt;{{item:3069}} \n> This is my opinion, but I feel it can be justified\n> I build coin when I want to have an extra slot for items, but frost queens when I want to deal some damage\n> But obviously, you are going to just want to get spelltheifs for the movespeed AND damage\n\nYou can't seriously believe that 60% movement speed (40% reliably on everyone every 60 seconds, 20% if near fallen) <  50% movement speed for one second (you need one entire minute after the first stack for it to be 3 seconds, with a 1.25 second cd between each proc.)\n\nIf we add the movement speed decrease, the active itself counters the coin active for only two people.","replies":[]}]},{"poster":"DuskDaUmbreon","date":"2017-05-22T23:53:33.845+0000","up_votes":1,"down_votes":0,"body":"The reason is because not every support can execute minions (not melee) or can't reliably proc tribute (see {{champion:497}} and {{champion:16}} for prime examples). It lets you be more safe regardless (you don't need to step on the coins. You can stand a minion or two away from it and pick it up. They also last for a while), and doesn't require as much mana to use (important on Janna, who takes a TON of mana to cast Q or W).","replies":[]},{"poster":"ForeverLaxx","date":"2017-05-22T22:22:07.812+0000","up_votes":1,"down_votes":0,"body":"It's just Riot's latest failure in trying to make supports \"interesting\" to encourage more people to play the role. Maybe if they were actually a threat during the early lane phase, more people would play them. Players tend to like killing other players, which explains why mages are finding their way into the support role again.","replies":[]},{"poster":"Stacona","date":"2017-05-22T22:13:44.101+0000","up_votes":1,"down_votes":0,"body":"The problem with 3 gold items is that supports are only made of two broad classes, mages and tanks, so there should only be two gold items because of that (relic for tanks, and the stronger between coin or spell thief for mages).","replies":[]},{"poster":"4th3t0s","date":"2017-05-22T18:37:11.643+0000","up_votes":1,"down_votes":0,"body":"IMO, it's mostly dependent on {{item:3069}} being better than {{item:3092}} on certain supports; it just sucks until you get there","replies":[]}]}