{"poster":"Tusutaki","date":"2018-11-06T17:58:21.948+0000","title":"Can we please do something about Shyvana?","subforum":"Gameplay","up_votes":2,"down_votes":0,"body":"I dont know for how long but it feels like she&#039;s been weak for years. Its not her kit thats holding her back persay but more along the lines of her numbers on her skills. \r\n\r\nHer passive is heavily dragon reliant. In worst case scenarios it will become literally non existent. In more favorable scenarios you will most likely obtain 2 dragons for a grand total of 10 armor and MR. \r\n\r\nQ has been gutted by 20% across the board on top of having a high CD of 9 seconds which is almost always leveled last. The .5 CDR hardly helps until you have items with attack speed.\r\n\r\nW is fine for the most part. Would rather have a gradual speed boost than a decay and the duration to be just 7 seconds rather than 4-7 via extending it. \r\n\r\nE is probably the most frustrating due to it&#039;s initial cooldown being 12 seconds but most of all being a delayed ability. Meaning it has a cast time. With it being her primary source of damage, it is way too punishing for the benefits it provides.\r\n\r\nR is fine the way it is. \r\n\r\nSo what is her general purpose that other champs couldn&#039;t already fulfill and does her job better? As for what to change to not make it feel like you&#039;re gimping yourself by playing her? I dont know atm. For sure change the passive and make E&#039;s cast time more instant but thats all I got. Oh and would also revert the Q nerf but thats me personally.","replies":[{"poster":"Noor Sakata","date":"2018-11-06T18:02:00.672+0000","up_votes":2,"down_votes":0,"body":"She was pretty strong this season until they nerfed Press the Attack because she was REALLY abusing that key stone","replies":[{"poster":"Profirix","date":"2018-11-06T19:29:01.339+0000","up_votes":1,"down_votes":0,"body":"Now I am not even sure what Keystone to go now. I want to say Dark Harvest but they are nerfing it into to ground next season and it doesn't synergize with her movement and attack speed as much. Hail of blades doesn't really benefit her. It seems to me that PTA is still the best option, even if it is a tiny fraction of its former power.","replies":[]}]},{"poster":"Bisaknosp","date":"2018-11-07T00:02:10.952+0000","up_votes":1,"down_votes":0,"body":"everytime shyvana is in a game shes just giga useless\nbuffing her numbers wont help i think she needs some kind of update\na different passive would be nice","replies":[]},{"poster":"The Ecdysiast","date":"2018-11-06T18:02:38.378+0000","up_votes":1,"down_votes":0,"body":"That's just how it is, man. They can't make all 137 champions have truly unique strengths because they need to have these defined classes to balance their items. \nAnd what we end up with is champions who are at the top of their respective classes, leaving others in the dust. Unfortunately we also can't have champions that are too similar in their ability sets, or they lack individuality and bans mean nothing. \n\nSo what you're asking, that an AA based fighter be shoved higher up in her class, is going to land on deaf ears. The fact is, she doesn't do her job the best. And she isn't supposed to.","replies":[{"poster":"Tusutaki","date":"2018-11-06T18:31:47.270+0000","up_votes":1,"down_votes":0,"body":"Im not asking for Shyvana to do her job the best per say, but to have actual strengths with weaknesses balancing her out. She is supposed to be a tanky on-hit champ from looking at her kit, but her numbers combined with the needed items doesnt support that. If you compare that to someone like Warwick or Vi with a somewhat similar kit and playstyle, you would see Shyvana not doing anything better than them. And by anything I mean just that, anything. \n\nAnd even though Warwick and Vi functions similarly, they both can do something better over the over. Both can fulfill a niche that the other doesnt provide. Shyv doesnt fulfill any niche and thats my main gripe. Most of all is that there is nothing stopping them from experimenting since they have PBE and thousands upon thousands willing to give feedback and suggestions.","replies":[{"poster":"The Ecdysiast","date":"2018-11-06T23:07:29.510+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tusutaki,realm=NA,application-id=3ErqAdtq,discussion-id=8BJu9Nx1,comment-id=00010000,timestamp=2018-11-06T18:31:47.270+0000)\n>\n> Im not asking for Shyvana to do her job the best per say, but to have actual strengths with weaknesses balancing her out. She is supposed to be a tanky on-hit champ from looking at her kit, but her numbers combined with the needed items doesnt support that. If you compare that to someone like Warwick or Vi with a somewhat similar kit and playstyle, you would see Shyvana not doing anything better than them. And by anything I mean just that, anything. \n> \n> And even though Warwick and Vi functions similarly, they both can do something better over the over. Both can fulfill a niche that the other doesnt provide. Shyv doesnt fulfill any niche and thats my main gripe. Most of all is that there is nothing stopping them from experimenting since they have PBE and thousands upon thousands willing to give feedback and suggestions.\n\nShe does have one major strength, but the problem is it doesn't synergize with her own kit. 10% bonus damage to dragons can be huge if the right dragons spawn, and the 5 MR and armor from each dragon slain on top of the dragons' buffs is powerful as well. The problem with it, though, is that she doesn't even take dragons the best. That _should_ be _her_ thing. But Yi, Warwick, and Udyr can all take dragon earlier than her because of their healing. \n\nWhat she needs, in lieu of a soft or hard rework, is simply bonus healing against dragons. That's really all she'd need to shine with her unique strength.","replies":[]}]}]},{"poster":"Leto GT","date":"2018-11-06T22:39:19.091+0000","up_votes":1,"down_votes":0,"body":"What are shyv core items?","replies":[]},{"poster":"Profirix","date":"2018-11-06T19:25:19.623+0000","up_votes":1,"down_votes":0,"body":"I have to disagree, I think her kit IS the problem. The only other champion in the game without any form of inherent CC is Mordekaiser (and yes, I know her ult has a short knock-back but really, its not  useful for anything but interrupting channels). Especially at low ELO, where players only play carries that are inherently lax on hard CC, Shyvana struggles to gank in a meta where ganking at level 2 is almost a necessity. This is almost entirely because Riot thought it was a good idea to nerf jungle experience and gold early on this season in an ironic attempt to force junglers to jungle for longer and have less lane impact (as if).\n\nDon't interpret this as me saying that she is weak. She has a very strong mid game. But Shyvana is the embodiment of \"farm your jungle, invade, and primarily  ignore your lanes until 6.\" It isn't fun or engaging gameplay and it really doesn't work well in this meta unless your team is already winning their lanes. The only reason I end up winning my Shyvana games is because I basically just outfarm and outscale their jungler. And don't even get me started about her passive. I will just leave it at: if Shyvana is going to be forced to fight over dragon to even have a passive, she better be getting much more power for it. 10% bonus damage to dragon is really a pretty shitty passive on top of some 5mr/armor per dragon. At least let that bonus damage extend to baron and herald. Just saying.","replies":[]},{"poster":"LeftyRaydy","date":"2018-11-06T18:39:03.076+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tusutaki,realm=NA,application-id=3ErqAdtq,discussion-id=8BJu9Nx1,comment-id=,timestamp=2018-11-06T17:58:21.948+0000)\n>\n> I dont know for how long but it feels like she&amp;#039;s been weak for years. Its not her kit thats holding her back persay but more along the lines of her numbers on her skills. \n> \n> Her passive is heavily dragon reliant. In worst case scenarios it will become literally non existent. In more favorable scenarios you will most likely obtain 2 dragons for a grand total of 10 armor and MR. \n> \n> Q has been gutted by 20% across the board on top of having a high CD of 9 seconds which is almost always leveled last. The .5 CDR hardly helps until you have items with attack speed.\n> \n> W is fine for the most part. Would rather have a gradual speed boost than a decay and the duration to be just 7 seconds rather than 4-7 via extending it. \n> \n> E is probably the most frustrating due to it&amp;#039;s initial cooldown being 12 seconds but most of all being a delayed ability. Meaning it has a cast time. With it being her primary source of damage, it is way too punishing for the benefits it provides.\n> \n> R is fine the way it is. \n> \n> So what is her general purpose that other champs couldn&amp;#039;t already fulfill and does her job better? As for what to change to not make it feel like you&amp;#039;re gimping yourself by playing her? I dont know atm. For sure change the passive and make E&amp;#039;s cast time more instant but thats all I got. Oh and would also revert the Q nerf but thats me personally.\n\nShe needs some type of CC in her kit probably a slow she feels terrible to teamfight with.","replies":[]},{"poster":"Brutalitops01","date":"2018-11-06T18:29:09.845+0000","up_votes":1,"down_votes":0,"body":"Shyvana gets better the higher rating that you go because your teammates will be more active in trying to get dragons. That being said, she can very easily be a strong champion in lower rating, too. People won't actively try to deny you dragons as much and you can take over the game with relative ease if you play her well. Ganking from behind lanes is very effective, especially after you hit level 6, and her clear speed is so ridiculous that she can keep her own and her opponent's jungles basically permanently cleared if you focus on that. She's also strong enough to fight a lot of other competitors, with her W and E both providing consistent damage. Granted, you will want to have your Bloodrazor, or at least the Recurve Bow for it, before you actively try fighting the enemy jungler too much. But once you have them, both jungles are yours and there's nothing your opponent can do to tell you otherwise in a 1v1.","replies":[]}]}