{"poster":"Tusutaki","date":"2017-08-02T16:30:49.911+0000","title":"Opinions on current state of Kayn?","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"What does everybody think of Kayn so far after his Shadow buffs? Is he in a good position? Is Shadow form actually viable now? \r\n\r\nFor me personally, while the &quot;fix&quot; to have his Shadow passive amplify all forms of damage is nice and very much needed, I still feel he&#039;s somewhat lacking. Like something is holding him back but I cant point my finger on it. Is it the 3 second window? Damage output? Utility? I cant find a reason to pick Shadow over Rhaast when Rhaast can have the same items as Shadow but is 2x more effective. I honestly cant find any reason to pick Shadow over Rhaast.","replies":[{"poster":"nm1010","date":"2017-08-02T16:57:14.811+0000","up_votes":1,"down_votes":0,"body":"Rhaast has a coherent kit and purose. In a fight he flanks with e (or just uses it to chase down fleeing enemies), w for knock up and solid damage, q to get some healing/good AoE damage/stick to squishies, r to heal up/wait for cooldowns while your team cleans up on your initiation.\n\nShadow assassin doesn't have that coherent flow. You also can flank with e, but it is much better used to rotate off of a split push or to catch someone out. W is great damage, but is easily flashed and you get turned on if you used e to get in position because of how squishy you are. Q feels awful in this form, the damage is good but breaking fluidity in an assassin is just bad game design. R does good damage now, but feels lacking because of the severe lack of consistent damage in the rest of his kit mid-late game.\n\nGranted I have ~10 games on him so far (7 shadow, 3 rhaast I believe) but to me once the dft/red smite nerf goes through shadow assassin is dead and rhaast is balanced/a little weak.","replies":[{"poster":"Tusutaki","date":"2017-08-02T19:07:42.662+0000","up_votes":1,"down_votes":0,"body":"I think you just put everything I feel into words lol. I 110% agree of his Q feeling awful in every way. I feel that it would be a significant improvement if his Shadow's Q doesnt have recovery time and maybe some additional CDR to grant him additional mobility. Im still bothered with the 3 second gap window though because the difference of damage between the two forms isnt that significant. \n\nHonestly, the only thing Shadow has over Rhaast is the damage from ult.","replies":[]}]},{"poster":"xxxMadLionxxx","date":"2017-08-02T16:55:28.050+0000","up_votes":1,"down_votes":1,"body":"lol you guys are wrong. Master the champ. I often take shadow form and go for the adc back line. I usually kill them with w q and duskblade while saving my ult for a second target.\n\nIf all goes well i get 2 kills and escape.\n\nAlso, I don't jg kayn. You're wasting your time like that because you can only get duskblade as a second item. With Death fire touch in mid lane, you can transform to shaodw form in 8-10 mins, plus duskblade as first item","replies":[{"poster":"Tusutaki","date":"2017-08-02T18:52:59.038+0000","up_votes":1,"down_votes":0,"body":"Does Deathfire fill up your transformation bar? Interesting. \n\nGoing back to the point, why not go as Rhaast since he can accomplish the same with similar if not, better results?","replies":[]}]},{"poster":"Sohleks","date":"2017-08-02T16:57:30.587+0000","up_votes":1,"down_votes":0,"body":"I think the gap has closed between the two forms but I feel both types of Kayn are not that great","replies":[]},{"poster":"Handy Sandy ","date":"2017-08-02T16:44:02.830+0000","up_votes":1,"down_votes":0,"body":"imo he needs more buffs or something, while he does have the damage to oneshot you the way he does it is really slow and he's kinda useless when behind","replies":[]}]}