{"poster":"Tusutaki","date":"2017-04-28T17:13:32.600+0000","title":"Shen Suggestion","subforum":"Gameplay","up_votes":4,"down_votes":2,"body":"I was once a dedicated Shen player back before his rework. I loved almost everything about him and how versatile he is. He was my favorite champion to play if my team needed more defense. Another plus was how safe he was due to his poke and healing abilities but not oppressive. I can see some having issues at the time even though Mundo, Renekton, and Riven was a lot more problematic back then. \n\nEver since his rework, I have been essentially turned off from playing him ever again. Its like they tried to make him a duelist while keeping his defensive capabilities and the result was that he became nothing more than a walking ult more so than ever. His lane phase became a lot worse as his Q is awkward to work with and obnoxiously hard to pull off with full effect on top of him being bullied easily with his non existent W.  Even with the almost overbearing weaknesses he now has, he still sees constant nerfs because of the LCS meta of &quot;safeplay&quot; is what I like to call it despite having low win rates for months.\n\nSo here are some of my suggestions to Make Shen Great Again. {{champion:98}}  MSGA! {{champion:98}}  The biggest change I want to advocate for would be his Q mechanics and his W. The suggested changes will be in in bold and italics.\n\n> &gt; Twilight Assault\tRANGE: 「 800 」 COST: 140 / 130 / 120 / 110 / 100 ENERGY COOLDOWN: 8 / 7.25 / 6.5 / 5.75 / 5\n> &gt; \t\n> &gt; Twilight Assault 1\n> &gt; _**ACTIVE: Shen throws his Spirit Blade to target location.  Shen can recast Twilight Assault again within 3 seconds to recall his Spirit Blade. Enemies that the recalled blade collides with are slowed by 35%. Minions below 100 - 300 health (based on level) are executed instead.**_\n> &gt; Twilight Assault 2\t\n> &gt; Once it arrives, Shen empowers his next 3 basic attacks within 8 seconds to gain bonus range and 15 - 40 (based on level) plus a percentage of his target&#039;s maximum health magic damage _**and gains 25% bonus attack speed.**_\n> &gt; 「 MAGIC DAMAGE: 2 / 2.5 / 3 / 3.5 / 4% (+ 1.5% per 100 AP) of target&#039;s maximum health 」\n> &gt; Twilight Assault 3\t\n> &gt; If the Spirit Blade collides with an enemy champion, the empowerment is enhanced, dealing 2% (+ 0.5% per 100 AP) of target&#039;s maximum health bonus damage and _**gain 50% bonus attack speed instead.**_\n> &gt; 「 INCREASED DAMAGE: 4 / 4.5 / 5 / 5.5 / 6% (+ 2% per 100 AP) of target&#039;s maximum health 」\n> &gt; Empowered attacks against monsters instead deal 30 - 80 (based on level) base damage, but their total damage is capped.\n> &gt; MAXIMUM MONSTER DAMAGE: 75 / 100 / 125 / 150 / 175\n\n\nContext: Twilight Assault&#039;s tight and strict conditions makes the ability clunky and frustrating as you would have to position the blade in such of a predictable and precise angle that you will rarely pull off it&#039;s full potential. I also added in the minion execution mechanic to allow him to farm minions more safely. Note that recalled Spirit Blade does no damage and the execution mechanic can only work within 3 seconds of initial casting. This also allows him to actually prepare set ups for trades by having the ability to position the blade to the desired location. \n\n\n> &gt; Spirit&#039;s Refuge\tCOST: 40 ENERGY COOLDOWN: 18 / 16.5 / 15 / 13.5 / 12\n> &gt;\n> &gt; ACTIVE: _**Shen causes his Spirit Blade to project a mist-like zone around it for 4 seconds causing any nearby champions to be both invisible and nearsighted while in the zone.**_\n\nContext: I have never been a big fan of his W in both versions. I personally feel this being worse than the former due to its very short active and its limitations of being only to dodge autos only. It honestly feels like a wasted skill slot. So pondered how to keep this ability&#039;s theme but make it more strategic. And so I thought it would be a neat idea to combine both Graves and Akali&#039;s smoke abilities but applying it to all champions. Like one scenario, you can toss your Q to the enemy carry and use your W to make them nearsighted but at the cost of making them invisible too. Or do the same thing to your carry to make them invisible with the cost of vision. \n\n--------------------\nWhat do you guys think? Have any suggestions of your own?","replies":[{"poster":"Akenero","date":"2017-04-28T18:31:11.046+0000","up_votes":2,"down_votes":0,"body":"I've been playing a TON of Shen recently, and i, too was turned off after his rework, but it's not as bad as you'd think. His q really rewards balancing aggression and falling back, though o have to agree his w needs changes, it feels like such a waste, since you can usually only block 1-2 autos, and on such a high cooldown, it is not worth the slot. But overall, Shen is in a much better place, and has MUCH more interesting ways to play him, you just have to stick with it for a bit :)","replies":[{"poster":"Tusutaki","date":"2017-04-28T19:21:14.000+0000","up_votes":1,"down_votes":0,"body":"I honestly cant see how he's in a better place. In what perspective? Because I know that its not his lane strength. The removal of his sustain/poke made him much harder to succeed with. He was originally a passive/defensive champion. Sacrificing pressure for map presence. Now it feels like they tried to make him an awkward mix offense and defense that mesh well in my eyes. I used old Shen top, jungle, and support. Currently? They buffed his jungling a bit but thats about it. \n\nI mean really, I didnt see the need for a Shen rework. Hell in my opinion, they can just bring back old Shen with his current visuals and use his Warlord skin as a new champ, rename it, and change his ult to something else. \nFor reference\nhttps://static.lolwallpapers.net/2016/01/Warlord-Shen.jpg\n\nAnd the more I look at his Warlord wallpaper/skin, the more I feel that Shen's current abilities was built around it thematically. \n\nAnother reason why I would want old Shen back is because of the new items out there that would greatly synergies with him.  \n{{champion:98}} + {{item:3109}} + {{item:3504}} + {{item:3174}} + Stonebound\nEven though the mana regen would be a waste of stat, his Q healing synergies with all of those items. Just theory crafting but something I would've loved to test out in the support role.","replies":[{"poster":"TurquoiseYoshi","date":"2017-04-29T03:55:34.961+0000","up_votes":1,"down_votes":0,"body":"I'd say Shen is better in terms of game health and interactivity now. Shen used to be a champion that could use Q a bunch to poke and zone, farm well, and never really have a major disadvantage in lane while being at an advantage overall because of the monster threats that are his ult and taunt. Now, due to his low range, he has to stay back in lane to farm and only capitalize on enemy aggression early on with taunts under tower or E-Q-W-AA punish combos. As the game gets later, he gets tankier and more capable to 1v1 enemies that come by, depending on the matchup, and is more able to push forward in lane and take an aggressive stance. \n\nI think the important thing to remember for Shen is that he is a tank champion with a global TP and a very massive taunt. His late game is very strong (like all tanks with useful CC), and his mid game can still be explosive if he uses ult/taunt well. His early game should not be really strong unless he's crazy far ahead. Even tanks like Nautilus and Mao just stay back and farm for most of laning. To be fair. they do have AoE abilities to do that, but Shen also operates on energy (so he doesn't have to really conserve ability use) and has a more impactful ult than the others (so he gets more reward for getting to the level 6, meaning that logically, more risk/weakness should be involved in the earlier stages).","replies":[]}]}]},{"poster":"Asayake 5150glow","date":"2017-04-28T19:09:40.235+0000","up_votes":1,"down_votes":0,"body":"I'd like Q to slow at all times, right now it only slows when they're running.","replies":[]},{"poster":"And A Real Hiero","date":"2017-04-28T19:04:48.905+0000","up_votes":1,"down_votes":0,"body":"As a fellow Shen main I'm always interested to see the views of other Shen mains, and its kinda funny how alike it is with the suggestions I made before the rework. My initial experience with the new Q was alike, but now that ive gotten more comfortable with it it doesn't bother me as much. While farming I place the sword as close to enemy caster minions as possible, then back off and last hit (if your enemy is too strong to aproach I place it near melee minions). Then as soon as the enemy tries to get in a last hit I will pull Q through them and attack, making them choose between getting chunked or grabbing that melee/cannon. Shen's early level dueling is pretty strong, though some champs flat out win.\n\nI have mixed feelings about his W, I had a similar suggestion as yours before the rework. But it generally would just combine Graves blind zone with Akali's stealth, nothing really new. Though his W timed at the right moment can have just as a devastating impact as a riposte though less overbearing (think braum shield vs yas wall), takes a lot of practice to be able to use and even then sometimes its just useless. It would be nice if it gave allies in the zone your passive shield as well as the AA block, making it slightly less useless vs AOE comps. Or when Shen ults, send the sword ahead of Shen and let him cast W while channeling.\n\nWhat Shen needs (IMO): Real scaling, noone will ever build ap on Shen so it doesn't matter how good of a scaling his skills have. Ap Shen just doesn't work.\nIf I had to choose a scaling for his Q it would be attack speed, making Wits End/Tri-force/BOTRK a more appealing choice for Shen and allowing him to be a threat to higher health targets.\n\nBetter passive activation, it needs to activate upon cast not upon the sword reaching Shen. Same with E, upon cast to make up for the loss of damage reduction. Sharing its shield with allies through W would be helpful.\n\nE needs a small CD buff of -2 seconds across all levels (his old CD) since it already lost 50% of the energy it used to return on targets hit, though the buffs it recently received are quite decent too. Its probably in a ok spot at this point.\n\nR activation of W during channeling would be all it needs atm, it already got nerfed severely and though I hoped low hp allies would get a higher net shield, they just get old values. I would not be opposed to Shen getting a completely new ult, if his kit finally would be good like it used to be.\n\nIts pretty clear that Riot doesn't want Shen to have waveclear, and I am ok with that. Let it be his weakness, so he can excell in other areas.","replies":[]},{"poster":"HalcyonDweller","date":"2017-04-28T17:17:11.653+0000","up_votes":1,"down_votes":0,"body":"Cool ideas, I hope this gets noticed!\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}