{"poster":"Tusutaki","date":"2017-03-20T22:26:47.711+0000","title":"Please dont release PBE Warlords","subforum":"Gameplay","up_votes":6,"down_votes":10,"body":"http://www.surrenderat20.net/p/current-pbe-balance-changes.html#bal4\r\n\r\n&gt; heal for 5-40% of your total Attack Damage (amplified by Critical Strikes) from 1-50% lifesteal\r\n\r\nYou do realize that this practically breaks Jhin, right? With Jhin easily being able to achieve 500 total AD and having crit shot...\r\n\r\nAssuming Warlord isnt affected by crit amplification\r\n .8 * 500 AD = 400\r\n\r\nIf it&#039;s included in Jhin&#039;s crit reduction case\r\n .6 * 500 AD = 300\r\n\r\nWithout crit\r\n .4 * 500 AD = 200\r\n\r\nNow if its only affected by positive crit amplification (w/IE)\r\n 1.0 * 500 AD = 500\r\n\r\nw/IE and +33% crit dmg runes I usually run. (283% crit dmg)\r\n1.132 * 500 = 566\r\n\r\nNow that is NOT LIFESTEAL which could be reduced by armor. You heal 100% of that ability. Now if you would to include actual lifesteal into the mix, you could easily heal for over 500hp with crit and ability combined. All this does it makes Jhin more of a pick or ban more so than he already is. This also makes Yasuo harder to kill than he already is.","replies":[{"poster":"SilentBomber","date":"2017-03-20T22:28:00.395+0000","up_votes":3,"down_votes":2,"body":"Only Jhin?What about Tryndamere?","replies":[{"poster":"Tusutaki","date":"2017-03-20T22:38:17.993+0000","up_votes":1,"down_votes":3,"body":"Because Trynd cant obtain 500+AD like Jhin can. \n\nIn worst case scenario in the last example, Jhin could easily heal for half his health.","replies":[{"poster":"Ok sure but why","date":"2017-03-20T22:46:57.522+0000","up_votes":2,"down_votes":1,"body":"Trynd kinda can- and he also attacks much faster\n\n{{item:3031}} {{item:3508}} {{item:3046}} {{item:3072}} {{item:3812}} {{item:3153}}","replies":[{"poster":"Tusutaki","date":"2017-03-20T23:31:05.470+0000","up_votes":2,"down_votes":2,"body":"If assuming that you're at 1% life left then I stand corrected. The only issue I have is the ER since you're not mana dependent and usually Shiv take's it's place. \n\nHowever my point still stands in terms of Jhin where he is easily able to obtain 500AD. With full build Jhin you're able to have 700-800AD depending on your runes and masteries. So when you apply the full build Jhin with 800AD, do you want to imagine how much health he's able to recover? Go ahead and apply the above calculations and see why I have a huge issue with this. This change hurts more than it does helps.","replies":[{"poster":"Ok sure but why","date":"2017-03-21T00:12:40.362+0000","up_votes":2,"down_votes":1,"body":"Well, at least it balances out, since he can't do shit with Fervor, which also stacks well in his favour","replies":[]}]}]}]}]},{"poster":"MissingKayo","date":"2017-03-21T00:33:34.515+0000","up_votes":2,"down_votes":1,"body":"It doesn't fucking matter when Jhin can't even attack one full time per second at level 18 (it's 0.94375 at level 18).\nThe Warlord's only procs on one single autoattack.\nHe also only has 4 autoattacks before he is FORCED to go through a 2.5 second reload he cannot bypass or reduce by ANY MEANS.\n\nOh cool, Jhin finally has his charged Warlord's. Oh wait, he's 100% fucking max health and it's goddamn useless because he's full health or close to it.\nOh whatever, let's just autoattack or something, oh wait, we can't unless we want to lose the fucking Warlord's.\n\nLet's just ask the enemy team to nicely stand still so I can run into short range and Q them. Or hope it's a good time to use my ultimate that I only have once every minute and some. Or ask them nicely to stand still so I can run into short range and throw a trap. Or land a W that I only get once every 14 fucking seconds without CDR at any rank. Which is also coincidentally, extremely thin and blockable by any enemy champion just like his ultimate.\n\nOh neat, I'm being sliced apart by enemy champions. Maybe I can finally use my Warlord's. Let me just ask them to stop hitting me for like 30 seconds so I can run around and charge up my autoattack, thanks.\n\nOut of all the possible fucking champions, Jhin is literally _THE_ last champion that you should be worried about with new Warlord's. \n\n# This thread is an utter _**fucking**_ joke.","replies":[{"poster":"Tusutaki","date":"2017-03-21T01:16:18.917+0000","up_votes":1,"down_votes":3,"body":"Lol someone is sure salty and has literally no idea what he's talking about or even how Jhin works in general. But you keep doing you buddy and dont be shocked when this becomes the case. \n\nBut entertain me, what other champion would abuse this the most aside from Yas and Trynd?","replies":[{"poster":"MissingKayo","date":"2017-03-21T01:31:01.370+0000","up_votes":2,"down_votes":2,"body":"And you have no idea how Jhin works at all, so don't bother talking on a matter you know literally nothing on.\n\nJust sit and listen and enjoy the education.\n\nAll attack-speed carries would. It doesn't matter if the % AD scale heal is low when they can proc it over and over extremely quickly. And it's not like it's going to be that low either. Not to mention they'll have lifesteal (and usually crit and more attack speed) on top of that.","replies":[{"poster":"Tusutaki","date":"2017-03-21T01:50:58.235+0000","up_votes":1,"down_votes":3,"body":"Are you implying Jhin doesnt have lifesteal or crit himself? And yeah it does kinda matter since 800AD you can recover 640 hp when you crit assuming Warlord isnt affected by crit amplification. And since you would also have lifesteal now lets say 15%. With IE thats 1.5k dmg. Now you may be against someone with 100 armor. So 750 dmg. 750*.15 = 112. 112 + 640 = 752. And since the crit I also got a huge movement speed boost.\n\n752 health recovered and thats not even including missing % dmg. \n\nAlso to further make your point moot, theres this thing called kiting which you will learn the more you play the game.","replies":[{"poster":"MissingKayo","date":"2017-03-21T02:01:16.633+0000","up_votes":2,"down_votes":1,"body":"Christ how stupid can you get.\n\nIt doesn't fucking matter if he can get a potentially massive heal or he knows how to kite.\n\nHe only has 4 autos, out of which he can't even technically make one full attack a second because one full attack takes longer than one second.\nAfter 4 autos, he is forced to go through a 2.5 second reload he can't avoid or reduce the duration of by any means.\n\nScenario A, he runs around and gets Warlord's. Cool, he's also 100% health or pretty damn close to it. Charging it takes a long time by the standards of active teamfight (AKA, he's not going to have time to charge it in a split-second life-or-death situation). It's fucking useless.\n\nScenario B, he has low health and coincidentally has Warlord's and a target at same time. Neat, he gets a chunk of health back. Now what? He doesn't have any more lifesteal. Buying lifesteal on Jhin is a fucking garbage decision because he can't sustain fast enough for it to matter so he can draintank, which is the purpose of lifesteal on the ADC. The only other alternatives being Lifesteal Quints or the mastery. Literally none of his standard builds have lifesteal. And there's a good reason for that. Hooray, you healed back 750 something health. Too bad you're still going to die in a second later anyways after that.\n\nScenario C, he's low health and doesn't have Warlord's. Well that's just fucking dandy, let's ask the enemy team to not use their gapclosers or CC or burst and just delete me while I try to run around and charge it up.\n\nScenario D, let's assume the Jhin player is a complete fucking dumbass and buys a Bloodthirster or Death's Dance or what have you. Yay, autoattack once and heal back a bit. Now, let's just ask the enemy team nicely to wait for over an entire full second so I can autoattack again and then heal more. Tell me how that goes, will ya buddy?\n\nIt's fucking hilarious how you try to talk down about understanding the game when you are the ignorant donkey, bud.\nJhin's kiting and bonus MS aren't going to do shit against anyone that actually wants him dead and is meant to kill the ADC in the first place.\n\nAnd for your information, I'm an M6 bordering M7 Jhin onetrick.\nNow continue to pull stuff out of your ass because frankly, you're quite an entertaining circus show for me.","replies":[]}]}]}]}]},{"poster":"NGNL Asian","date":"2017-03-20T22:51:18.456+0000","up_votes":2,"down_votes":3,"body":"The jhin and tryn mains be downvoting this.\n\nYasuo is going to be op af too.....\n\nYasuo and tryn are always good with warlords somewhat ever since it came out anyway","replies":[{"poster":"Yaśuo Main","date":"2017-03-21T00:32:17.851+0000","up_votes":2,"down_votes":1,"body":"i'd rather take fervor because dorans is already enough to lifesteal off of minions, so warlords is just losing damage","replies":[]},{"poster":"Tusutaki","date":"2017-03-21T01:29:43.087+0000","up_votes":1,"down_votes":3,"body":"I honestly dont know why people are downvoting this hard when my post has merit and numbers to prove my case. If someone is going be \"downvote\" at least dispute it with actual reasoning and explain why the PBE version would be better than it currently is.","replies":[]}]},{"poster":"RexSaur","date":"2017-03-21T01:31:14.231+0000","up_votes":1,"down_votes":3,"body":"How about just nerf jhin passive so 1 champion stops breaking keystones?","replies":[]}]}