{"poster":"Gig GOD OF DEATH","date":"2015-07-23T10:43:45.828+0000","title":"Multicuentas y 400 RP","subforum":"Problemas Técnicos","up_votes":2,"down_votes":0,"body":"Hola Riot y foreros, tengo una duda sobre las multicuentas y los 400 puntos Riot gratis que te dan a nivel 3 o 5, ya no me acuerdo. La cosa es as&iacute;: en mi cuenta principal me gast&eacute; gran parte de mis RP comprando a Sona (bien de novato), y en la otra (que habilit&eacute; tarde por problemas con el correo de activaci&oacute;n) ya tengo nivel 15 y los 400 RP ah&iacute; enteritos para gastarlos a gusto y placer.\r\n\r\nPrimero, cabe destacar que ya le coment&eacute; de esto a un miembro del equipo de soporte hace mucho tiempo, y me mencion&oacute; que en este juego no se hacen problema por tener multicuentas (recuerdo que le hab&iacute;a escrito con motivo de borrar la que no uso).\r\n\r\nAhora, mi duda es esta... &iquest;puedo usar los RP gratuitos de mi multicuenta para hacerme regalos en la oficial? o sea, tengo ya tres aspectos en total en mi cuenta principal, y no quisiera perderla por cometer fraude, as&iacute; que antes de meterme en l&iacute;os prefiero consultarlo.","replies":[{"poster":"xHolsa","date":"2015-07-23T16:35:32.830+0000","up_votes":1,"down_votes":0,"body":"Yo  creo que si dan 400 rp por algo es, para gastarlos, Riot va a \"perder\" lo mismo tanto si gastas esos rp en tu smurf como si los gastas enviandote regalos :p ese es mi punto de vista.\nAh, otra cosa, yo llegue a lvl 10 con 1 smurf el penultimo dia en que estaba en oferta la skin que yo queria, me envie solicitud de amistad y  me salto el mensaje de que no era amigo x suficiente tiempo, busque en internet y lei que habia que esperar por 2 personas.\nAl otro dia, a pesar de haber leido eso, se me paso x la mente volver a intentar enviarme la skin... y pude :v","replies":[]},{"poster":"NoSoyCarlanga3","date":"2015-07-23T15:59:55.655+0000","up_votes":1,"down_votes":0,"body":"amigo para regalarse una skin a uno mismo es necesario tenerse de amigo por no menos dos semanas y eso sin contar que solo te puedes regalar las skin que están de oferta, pero no te banean la cuenta por hacerlo ,pero requiere mucho tiempo y conocer las ofertas que quieres y esperarlas . Por lo que me han contado xD","replies":[]},{"poster":"Waninoko Main","date":"2015-07-23T11:28:02.128+0000","up_votes":1,"down_votes":0,"body":"A ver las cuentas smurf están totalmente permitidas por Riot Games incluso los profesionales juegan con Smurf para que no les sigan las partidas. Segundo punto lo que hagas con esa cuenta es resposabilidad tuya si quieres quedarte sin RP en una para regalarte una skin barata en otra puedes hacerlo. Tercer punto ¿por qué borrar una cuenta que planeas no utilizar mas?","replies":[{"poster":"Gig GOD OF DEATH","date":"2015-07-23T11:40:59.139+0000","up_votes":1,"down_votes":0,"body":"En tu pregunta esta la respuesta, si no la voy a utilizar, veo la opción de borrarla antes que conservarla.","replies":[{"poster":"Waninoko Main","date":"2015-07-23T14:29:15.145+0000","up_votes":1,"down_votes":0,"body":"Claro pero me refiero a que si no la usas es como si no estuviera es decir no hay necesidad de tomarse la molestia de eliminarla XD en mi opinión","replies":[]}]}]},{"poster":"lordeman10","date":"2015-07-23T14:25:56.255+0000","up_votes":1,"down_votes":0,"body":"hay un \"vacio legal\" que te lo permite, si bien no rompes ninguna regla no es bueno para riot que uses así los 400 rp gratuitos es explotar el sistema, por eso nadie lo aconseja ni se habla del tema si esto se volviese popular lo más probable es que lo eliminen","replies":[]},{"poster":"Knife Skull Edgë","date":"2015-07-23T10:57:12.568+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gig GOD OF DEATH,realm=LAS,application-id=X54mVVp0,discussion-id=qMBGY1Eo,comment-id=,timestamp=2015-07-23T10:43:45.828+0000)\n>\n> Hola Riot y foreros, tengo una duda sobre las multicuentas y los 400 puntos Riot gratis que te dan a nivel 3 o 5, ya no me acuerdo. La cosa es as&iacute;: en mi cuenta principal me gast&eacute; gran parte de mis RP comprando a Sona (bien de novato), y en la otra (que habilit&eacute; tarde por problemas con el correo de activaci&oacute;n) ya tengo nivel 15 y los 400 RP ah&iacute; enteritos para gastarlos a gusto y placer.\n> \n> Primero, cabe destacar que ya le coment&eacute; de esto a un miembro del equipo de soporte hace mucho tiempo, y me mencion&oacute; que en este juego no se hacen problema por tener multicuentas (recuerdo que le hab&iacute;a escrito con motivo de borrar la que no uso).\n> \n> Ahora, mi duda es esta... &iquest;puedo usar los RP gratuitos de mi multicuenta para hacerme regalos en la oficial? o sea, tengo ya tres aspectos en total en mi cuenta principal, y no quisiera perderla por cometer fraude, as&iacute; que antes de meterme en l&iacute;os prefiero consultarlo.\n\nNo te hacen nada amiguico!! yo ya me regale como 10 skins XD","replies":[{"poster":"Gig GOD OF DEATH","date":"2015-07-23T11:31:31.051+0000","up_votes":1,"down_votes":0,"body":"Ok, muchas gracias por comentar hace rato necesitaba saber esto, hasta ahora, la conclusión mas acertada es que se puede hacer sin recibir amonestaciones... es raro, pero hasta que no se demuestre lo contrario parece legal lo que si se requiere mucho más tiempo nivelar una cuenta que antes.  Me surgió una duda ¿Cuanto tiempo le has dedicado a nivelar por esas 10 skins?","replies":[{"poster":"Knife Skull Edgë","date":"2015-07-23T11:48:09.650+0000","up_votes":1,"down_votes":0,"body":"En 1 día y medio la subís a 10 {{champion:36}}","replies":[{"poster":"Neoburstx","date":"2015-07-23T13:54:21.477+0000","up_votes":1,"down_votes":0,"body":"esto es cierto, yo me demoro lo mismo :3\nahora me regalare la skin de {{champion:69}} que esta a un precio muy accesible","replies":[]}]}]}]},{"poster":"Grituz","date":"2015-07-23T10:47:34.190+0000","up_votes":1,"down_votes":0,"body":"{{item:2044}} {{item:2043}} {{item:3340}} {{item:3361}} {{item:3362}} \n#Ward","replies":[]}]}