{"poster":"Kingdom Corn","date":"2016-11-10T02:39:36.264+0000","title":"\"Assassins do too much damage\"","subforum":"Gameplay","up_votes":107,"down_votes":23,"body":"Well maybe if your dumass built armor or mr then you wouldn&#039;t die. What are you expecting? Build full ad and crit and still be tanky?","replies":[{"poster":"MunchCrunchLunch","date":"2016-11-10T03:15:09.052+0000","up_votes":28,"down_votes":13,"body":"OMG RENGAR KILLED ME IN 1.5 SECONDS. \n\nwell your dumbass needs to grab a dead mans plate and some more armor like the rest of us.","replies":[{"poster":"DemainaNyx","date":"2016-11-10T03:29:16.290+0000","up_votes":43,"down_votes":8,"body":"> [{quoted}](name=MunchCrunchLunch,realm=NA,application-id=3ErqAdtq,discussion-id=gU1QRmwJ,comment-id=0001,timestamp=2016-11-10T03:15:09.052+0000)\n>\n> OMG RENGAR KILLED ME IN 1.5 SECONDS. \n> \n> well your dumbass needs to grab a dead mans plate and some more armor like the rest of us.\n\nMore like 0.5 seconds.  And when he does that under two nexus towers in the middle of my entire team, somethings wrong with that.","replies":[{"poster":"Melledoneus","date":"2016-11-10T05:17:04.995+0000","up_votes":11,"down_votes":1,"body":"What team? They all disappeared too.","replies":[{"poster":"Phelas","date":"2016-11-10T06:26:05.417+0000","up_votes":2,"down_votes":6,"body":":3 Dat name!","replies":[{"poster":"Ralanr","date":"2016-11-10T12:38:15.055+0000","up_votes":3,"down_votes":0,"body":"I don't get it. Is Mel's name a reference?","replies":[{"poster":"Melledoneus","date":"2016-11-10T13:44:14.296+0000","up_votes":11,"down_votes":0,"body":"He tracks down my comments and lets me know that he likes my name.","replies":[{"poster":"dragon1xx","date":"2016-11-10T23:20:33.897+0000","up_votes":3,"down_votes":0,"body":"I like your name...","replies":[]}]}]},{"poster":"Melledoneus","date":"2016-11-10T07:12:57.393+0000","up_votes":2,"down_votes":0,"body":"https://68.media.tumblr.com/tumblr_lvavkdCV7b1qbifwuo1_400.gif","replies":[{"poster":"Phelas","date":"2016-11-10T08:14:40.921+0000","up_votes":4,"down_votes":4,"body":"I'm trying to make this a meme.","replies":[{"poster":"Ireliavence","date":"2016-11-10T14:49:44.014+0000","up_votes":5,"down_votes":0,"body":"WEIRD.","replies":[]}]}]}]}]},{"poster":"Kingdom Corn","date":"2016-11-10T04:33:52.533+0000","up_votes":7,"down_votes":15,"body":"Something is wrong with your team and using their cc ^_^ seriously if u want to counter any assassin you need good reaction time to use your cc correctly. Not saying it is ez... but it is possible with practice.","replies":[{"poster":"DemainaNyx","date":"2016-11-10T04:44:19.431+0000","up_votes":13,"down_votes":3,"body":"> [{quoted}](name=Kingdom Corn,realm=NA,application-id=3ErqAdtq,discussion-id=gU1QRmwJ,comment-id=000100010000,timestamp=2016-11-10T04:33:52.533+0000)\n>\n> Something is wrong with your team and using their cc ^_^ seriously if u want to counter any assassin you need good reaction time to use your cc correctly. Not saying it is ez... but it is possible with practice.\n\nI completely agree.  Getting 1 shot by an assassin as I stand middle of the lane by myself overstaying, that's my fault.  However, if the assassin can literally just walk up to the ADC in the middle of their team and the only counter play for the ADC is \"hope someone else CC's him before he bursts me\", it's kinda frustrating from the ADC standpoint when your called \"garbage ADC... can't position properly.\"","replies":[{"poster":"President Swa1n","date":"2016-11-11T22:47:56.089+0000","up_votes":1,"down_votes":0,"body":"Why is the ADC in the middle of the team and not behind? I'm terrible at ADC,but I thought they're supposed to be backliners.","replies":[{"poster":"DemainaNyx","date":"2016-11-12T00:15:34.604+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=OnlyBourger14,realm=NA,application-id=3ErqAdtq,discussion-id=gU1QRmwJ,comment-id=00010001000000000002,timestamp=2016-11-11T22:47:56.089+0000)\n>\n> Why is the ADC in the middle of the team and not behind? I&#x27;m terrible at ADC,but I thought they&#x27;re supposed to be backliners.\n\nClearly you've never had a Rengar jump you before.  When you see the icon, you run towards teammates to save you.  Otherwise it's ensured you're dead.","replies":[]}]},{"poster":"Naomi CoffeeGoat","date":"2016-11-10T12:26:17.669+0000","up_votes":3,"down_votes":1,"body":"This kind of shit pisses me off when I play ADC. Had a Jhin game where I'm constantly trying to back off and do whatever damage I can. I was the sole carry on the team, but it wasn't enough when I get people constantly fucking rushing my ass down every opportunity right through my team just to one shot me. Only to get insulted and called out for \"bad positioning.\"","replies":[]}]}]}]},{"poster":"Troll for Trump","date":"2016-11-10T05:00:16.152+0000","up_votes":8,"down_votes":1,"body":"He still kills you too fast even with some armor. Unless you have specialized pure armor like Malph or Ramm, he will kill you before you have time to react, and you can't cc him during ult/uses W. His burst window is the only one that hasn't been cut down as significantly as the others.","replies":[]},{"poster":"Kingdom Corn","date":"2016-11-10T03:17:15.498+0000","up_votes":3,"down_votes":1,"body":"haha.","replies":[]}]},{"poster":"Akali is SO HOT","date":"2016-11-10T03:55:29.683+0000","up_votes":25,"down_votes":3,"body":"Yeah.  Guardian Angel, a support + peel from other teammates, mobility, heal, damage reduction from items and masteries, qss, and more isn't enough.  Instead they need Assassins to be gutted so they can be dumber than monkeys and still win.","replies":[{"poster":"Kingdom Corn","date":"2016-11-10T04:38:01.843+0000","up_votes":3,"down_votes":2,"body":"Lmao I see you everywhere it is crazy, ur a funny person man I look up to u :P.","replies":[{"poster":"Akali is SO HOT","date":"2016-11-10T05:00:07.519+0000","up_votes":5,"down_votes":2,"body":"ecks dee","replies":[]}]}]},{"poster":"Aurelius Maximus","date":"2016-11-10T02:40:13.995+0000","up_votes":1,"down_votes":3,"body":"who are you talking to?","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-10T02:43:07.041+0000","up_votes":7,"down_votes":8,"body":"He's mocking how they nerfed half the assassins so they don't burst... I mean it's not like mages, adcs and brusers don't do the assassins work now even better ,but whatever...","replies":[{"poster":"Kingdom Corn","date":"2016-11-10T03:13:19.236+0000","up_votes":2,"down_votes":7,"body":"assassins are inferior fighters I main wukong and rengar and right now with how rengar is... wukong can out burst him easily. {{item:1412}} {{item:3142}} {{item:3814}} {{item:3147}} {{item:3071}} {{item:3009}} just try this build on wukong for urself and u will see. :)","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-10T03:19:08.731+0000","up_votes":4,"down_votes":15,"body":"8 years katarina main... a bloody soraka can outburst me now...","replies":[{"poster":"Kingdom Corn","date":"2016-11-10T03:21:09.508+0000","up_votes":2,"down_votes":4,"body":":/ Sorry man feels bad.","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-10T03:23:19.103+0000","up_votes":4,"down_votes":13,"body":"dw. Riot doesnt care... they never did and never will... Welcome to the League of Tanks and ADCs... That's why Im ending my Tale 6 months earlier... Their carelessness to one of the biggest Katarina mains ever, is killing me...","replies":[{"poster":"Kingdom Corn","date":"2016-11-10T03:26:23.692+0000","up_votes":3,"down_votes":9,"body":"and the thing is that katarina was ALREADY BALANCED like why tf nerf her? makes literally no sense.","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-10T03:27:14.756+0000","up_votes":3,"down_votes":13,"body":"IKR... She had most potential and balance of all champs in the game, but RIP... lets have hell naow.","replies":[{"poster":"TheHappyReaperz","date":"2016-11-10T04:39:47.431+0000","up_votes":17,"down_votes":0,"body":"How was Kat balanced? She was either 0/10, and completely shit, or 10/0 and completely bullshit. With the rework no real damage was buffed or nerfed, Kat just got a higher skill ceiling and more options.","replies":[{"poster":"CookyPrince","date":"2016-11-10T05:01:59.553+0000","up_votes":10,"down_votes":0,"body":"well yknow before kat was just clean up honestly, the new kit diversifies her into more than just go in feed/kill Flyerbek seems to like the changes","replies":[]},{"poster":"zrWQMdGHtY","date":"2016-11-10T11:40:49.815+0000","up_votes":1,"down_votes":5,"body":"I went 0/10 and still got fed and won my games with my old kit. I've gotten 10/0 and Jax still OSed mea nd carried his game... You literally said nothing correct and people who understand 0 go upvote you, so shush. And no, she didn't get more skilled... she got more unskilled and more luck base, on how stupid your enemy is.... You wont play Bronze/Silver your whole life, so stop making her look good in there... In Gold+ she's horrible because people have at least half a brain.","replies":[{"poster":"TheHappyReaperz","date":"2016-11-10T14:07:09.122+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kitty Katarina,realm=EUW,application-id=3ErqAdtq,discussion-id=gU1QRmwJ,comment-id=0000000000000000000000000000000000000001,timestamp=2016-11-10T11:40:49.815+0000)\n>\n> I went 0/10 and still got fed and won my games with my old kit. I&#x27;ve gotten 10/0 and Jax still OSed mea nd carried his game... You literally said nothing correct and people who understand 0 go upvote you, so shush. And no, she didn&#x27;t get more skilled... she got more unskilled and more luck base, on how stupid your enemy is.... You wont play Bronze/Silver your whole life, so stop making her look good in there... In Gold+ she&#x27;s horrible because people have at least half a brain.\n\nYou literally just said, you were 0/10, then got fed. That means you weren't 0/10 anymore.","replies":[]}]}]}]}]}]}]},{"poster":"Lewd Loli Thighs","date":"2016-11-10T10:37:00.266+0000","up_votes":2,"down_votes":0,"body":"I felt the same way at first, having mained kata since she was still a pure ad champion.  You have to change your approach to playing her though. You can't play her the same way you could in the past and instagib people. Once you figure out her rotation she is amazing, what they did to her kit gives her tons of different approach options too. Picking up daggers is important, those suckers can deal 1k dmg once you get fed. Approach I learned work really well in the laning phase for example was to e to a target, w where we fought, pick up the dagger and when the target tried to run hit them q e dagger e combo. Was usually enough to kill them pre 6 just by using that combo alone. Really changed the way laning felt and highlighted where her dmg really shines.","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-10T11:50:31.200+0000","up_votes":2,"down_votes":5,"body":"\"once you get fed\" factor 1. Which is nearly impossible because every is more mobile and more bursty and with more CC.\n\n\"you wont play as before\" factor 2, she played the same 8 years now suddenly doesn't, fact that she got gutted and forces Kata mains to stop playing her and make ADCs feel better because now only Talon and Zed can OS them (and Kha)\n\n\"Pick up the sucker\" factor 3, people aren't as stupid as bots, they run away from the daggers. pplus mid TF you die while you wait for them to fall, because 1.25 secs is loads of time and u eat loads of damage and u cant waste time waiting while everyone is basic attacking you or bashing you with nearly no CD spells which have CC (annie)\n\n\"Lane phase is with E\" factor 4. If your enemy has 10 IQ, you're dead, because every time you go in with E on a dagger to get CS you get 3 sec CD on the shunpo and your enemy destroys you. You cant run propelly because your MS was nerfed  from 345 to 340 and now you're slower, proving my point more that she's like a cripple now. \n\nHer kit is horrible, she has lost her assassination potential. The idea was to make her viable at higher elo, now she's less viable in plat + because ppl there aren't the same level as bronze/silver.\n\nKatarina's problem was always the low ranks, but most low ranks are anyway perma bans who keep making or buying new accounts so I still fail to see why they had to destroy the game for people who play to enjoy and not to be A BLOODY QQING ADC THAT CANT HANDLE HIMSEFL EVEN IF HE GOT ALL THE MOBILITY IN THE WORLD IN THIS SEASON...","replies":[{"poster":"THE RlVER KlNG","date":"2016-11-10T12:36:01.199+0000","up_votes":4,"down_votes":1,"body":"Are you drunk? You're barely speaking English and your statements are hugely exaggerated and false.","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-10T13:23:46.810+0000","up_votes":1,"down_votes":4,"body":"How to be false. \n\nStep 1. Play Katarina for 8 years and only her and nobody else\nStep 2. Read patch notes and see the changes\nStep 3. Test it whole day ingame\nStep 4. Use your old experience and judge the new guttening\nStep 5. A random guy who has 0 idea of what you mean, because he doesn't even play Katarina says you exaggerate and you're false. \nStep 6. Repeat. Steps 1 to 5.\n\nEdit. Step 1.5, write in English and be told you don't write in English. ","replies":[{"poster":"THE RlVER KlNG","date":"2016-11-11T00:20:24.890+0000","up_votes":5,"down_votes":0,"body":"How to be a whiny champion main who can't adapt to an update:\n\nStep 1: Play x champion for 7 years (Katarina was released in September of 2009.....) and develop a sense of entitlement and arrogance that you are the very best x champion in the world and only your opinion matters.\nStep 2: Skim patch notes and see that Riot is slowing down burst, cry from there.\nStep 3: Lose with new changes because they are new and you are not fully comfortable with them.\nStep 4: Use your entitlement and arrogance to decide that x champion is now useless because you can't oneshot people anymore, despite now having more mobility and combat tools.\nStep 5: A boards user calls you out on your bullshit, make passive-aggressive checklist in response.\nStep 6: Rinse and repeat.\n\nEdit. Step 1.5, write in broken English with several mispelled words.","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-11T00:47:41.070+0000","up_votes":1,"down_votes":2,"body":"Spellcheck said I didn't misspell. QQ\n\nPlus I literally got called a brainless no champ 20 mins ago after I won my mid vs azir with 8/1. So pretty much that just makes you look worse than you are with your offensive statements. And Katarina was released during beta period 2008, officially released 2009 with the game official release out of beta... >.> Originally at beta with Merc skin as the original default model wasn't yet ready and needed tweaks... Cheers.\n\nP.S I'm a Katarina main, obviously I'll main the champion closest to my attitude, so calling me arrogant isn't even offensive. ","replies":[{"poster":"THE RlVER KlNG","date":"2016-11-11T01:19:15.902+0000","up_votes":2,"down_votes":0,"body":"you can't run propelly\nCANT HANDLE HIMSEFL\nbecause every is more mobile\npplus mid TF\nyou play correctly and good\nlets have hell naow.\nAnd no, she didn't get more skilled... she got more unskilled and more luck base\n\n.......along with many others.\n\nBut please, continue digging yourself a deeper hole to Crazytown. Your statements are blown out of proportion and come across as confrontational, rude, paranoid, and arrogant. If that's the type of person you like to be, then good luck with life dude.","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-11T01:21:50.174+0000","up_votes":2,"down_votes":1,"body":"Worked well with Trump. Didn't it?","replies":[{"poster":"THE RlVER KlNG","date":"2016-11-11T01:47:33.809+0000","up_votes":3,"down_votes":0,"body":"If you're pleased to be alike to Donald Trump then I'm afraid this conversation is now over","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Fairyfleur","date":"2016-11-10T13:07:37.003+0000","up_votes":2,"down_votes":0,"body":"Katarina can still do a lot of damage but now you have to actually think where and when to use it.","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-10T13:21:32.128+0000","up_votes":1,"down_votes":2,"body":"I never said she cant do it, she just cant land the damage to do it, as she needs to wait 1h and the enemy just right clicks out of it .","replies":[{"poster":"Ireliavence","date":"2016-11-10T14:55:46.882+0000","up_votes":3,"down_votes":0,"body":"its gonna be hard i know. \n\nbut now assassins are closer to the fantasy of how an assassin is irl, mainly  masterful with reaction time, decision making, and general knowledge of all the factors that go into the kill and escape.\n\nsoon, new assassin mains will rise and they will just be fundamentally better than the old ones. Times change, accept it m8","replies":[]}]}]}]},{"poster":"TheHappyReaperz","date":"2016-11-10T04:40:18.275+0000","up_votes":4,"down_votes":1,"body":"That's an assassin Wukong build.","replies":[{"poster":"Kingdom Corn","date":"2016-11-10T04:41:50.697+0000","up_votes":2,"down_votes":3,"body":"Yes it is. And that is my point. Fighters can build just like an assassin and get the job done and have more impact which is why I said Assassins are just inferior to fighters ^_^","replies":[{"poster":"NineTailedMystic","date":"2016-11-10T07:48:03.514+0000","up_votes":4,"down_votes":1,"body":"As defined by Riot, Assassins have outs. Fighters/Divers don't.","replies":[{"poster":"Who Feeded You","date":"2016-11-10T09:23:27.453+0000","up_votes":3,"down_votes":0,"body":"wukong at late game has his clone ability up every 4-5 seconds. I've literally outplayed entire enemy team 1v5 by going in, and escaping with clone in cycles.\n\nNot to mention even half tank Wukong can ult most of enemy team down.","replies":[]}]}]}]}]},{"poster":"YoungFarmer","date":"2016-11-10T04:48:24.974+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kitty Katarina,realm=EUW,application-id=3ErqAdtq,discussion-id=gU1QRmwJ,comment-id=00000000,timestamp=2016-11-10T02:43:07.041+0000)\n>\n> He&#x27;s mocking how they nerfed half the assassins so they don&#x27;t burst... I mean it&#x27;s not like mages, adcs and brusers don&#x27;t do the assassins work now even better ,but whatever...\n\nThey don't burst lol? have you see the 1100 talon Q damage lol","replies":[{"poster":"Who Feeded You","date":"2016-11-10T09:24:06.837+0000","up_votes":8,"down_votes":0,"body":"Marksmen can crit 2K... at 2,... attacks a second.","replies":[]}]}]}]}]}