{"poster":"Raw Diamond ADC","date":"2015-04-24T21:40:26.164+0000","title":"NoGravity - Europe West - Summoners - League of Legends","subforum":"Clans & Teams","embed":{"description":"Create & discover new Champion builds/strategies, check your Summoner statistics and try our powerful LoL charts.","url":"http://www.lolking.net/summoner/euw/19760005","image":"http://lkimg.zamimg.com/images/logo-urf.png"},"up_votes":1,"down_votes":1,"body":"Hey Zusammen,\r\n\r\nwie man der &Uuml;berschrift entnehmen kann suche ich ein Ranked Team. Ich bin Konstantin alias NoGravity und spiele seit Season 1 League und mein Alter ist 23 Jahre sprich ich bin kritikf&auml;hig. Meine Hauptrolle ist ADC\r\n\r\nLieblings ADC\r\n{{champion:236}} {{champion:42}} {{champion:81}} \r\n\r\nADC die ich auch gut kann\r\n{{champion:119}} {{champion:51}} {{champion:104}} {{champion:222}} {{champion:429}} {{champion:21}} {{champion:96}} {{champion:133}} {{champion:18}} {{champion:29}} {{champion:110}} {{champion:67}} \r\n\r\nADC die ich nicht mag\r\n{{champion:22}} \r\n\r\nAnsonsten hab ich auch alle Champions. Ich besitze nat&uuml;rlich ein gutes Headset und verwende nat&uuml;rlich auch Skype bzw. Teamspeak kann aber auch curse Voice runterladen wenn es ben&ouml;tigt wird. \r\n\r\nZu mir/ was ihr erwarten d&uuml;rft.\r\n\r\nName: Konstantin\r\nAlter: 23 Jahre\r\nRolle: ADC\r\nSpiele seit: Season 1\r\nErfahrung im Team: Habe mit einem Team schon &ouml;fters in der ESL teilgenommen und m&uuml;sste bei diesen Turnieren auch gegen h&ouml;here elos spielen was mir auch gelangt. Leider war ich nur der Reserve Spieler und bin dadurch rausgegangen um ein eigenes Team auf die Beine zu stellen dies lief nicht so gut wie erhofft und jetzt bin ich hier. Ich bin kritikf&auml;hig, Teamf&auml;hig und freundlich. Bitte erschreckt nicht von meiner jetzigen Elo im Team trete ich anders auf lasst mir deshalb eine Chance mich zu beweisen.\r\n\r\nWas ich erwarte Suche:\r\n\r\nEin Team mit Zielen und dem Willen sich weiter zu verbessern. Ich bevorzuge erst Leute ab 18 Jahre da die Reife schon eher vorhanden ist als bei 16- j&auml;hrigen (wie ich finde). Ich bin kein Fan von geflame untereinander aber ich will trotzdem das man eine Analyse f&uuml;hrt nach jedem spielt und die &quot;Fehler sucht&quot;.\r\n\r\nIch denke das ist alles was ich sagen wollte wenn noch Fragen vorhanden sind einfach fragen (Ingame oder Hier).\r\n\r\nDanke f&uuml;rs lesen :) hier ist ein Keks {{item:2009}}","replies":[{"poster":"Raw Diamond ADC","date":"2015-04-25T05:56:02.989+0000","up_votes":1,"down_votes":0,"body":"Push","replies":[]}]}