{"poster":"Royal Phøenix","date":"2018-08-19T18:20:17.996+0000","title":"Eingespielte Platin botlane sucht Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Servus liebe/r Beschw&ouml;rer/in,\n\nMein Duo-Mate und ich suchen ein Team, welches sich im Platinbereich oder h&ouml;her befindet.\nWir beide teilen uns schon seit einem l&auml;ngeren Zeitraum (9 o. 10 Monate) die Botlane und haben es zusammen nach Platin geschafft. Er ist auf seinen Main Acc Platin 2 w&auml;hrend Ich in Platin 5 rumchille :3. Wir beide waren schon in diversen Teams und haben auch schon an Turnieren seitens Riotgames oder ESL teilgenommen. Wir beide haben einen gewissen Ehrgeiz, welcher uns &uuml;ber die Monate begleitet hat aber dennoch sind wir auf der Suche nach Kritik, die uns Zeigt wie wir uns Verbessern k&ouml;nnen. Unser Humor ist &uuml;ber den Zeitraum nicht verschwunden aber dennoch wird Ingame nur das n&ouml;tigste zum Spiel besprochen. Unsere Champions sind vielseitig, weshalb wir auch mal den ein oder anderen Pick auf der Botlane ausprobieren und gerne spielen! Wir sind beide Liebevolle Menschen und hoffen auf gleichgesinnte, die uns ein neues Zuhause  und Asyl gewehren :3\n\nMit lieben Gr&uuml;&szlig;en,\n\n**_Chirashami_**\n**_Pretty Sad_**   bzw. **_Shai LFT_**\n\n**_Sollten Sie Augenkrebs aufgrund der Rechtschreib- und Grammatikfehler bekommen, wenden Sie sich bitte an Ihrem Arzt oder Apotheker_**","replies":[{"poster":"AG Incredible","date":"2018-08-19T18:31:55.940+0000","up_votes":1,"down_votes":0,"body":"Hätte sonst n team für euch wenn ihr mich adden könntet weil ich grad ingame bin :D ? ansonsten adde ich euch nach meinem game \nLiebe grüße :)","replies":[{"poster":"Royal Phøenix","date":"2018-08-19T18:50:44.766+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EkkoStoleMySight,realm=EUW,application-id=ElKI1ocy,discussion-id=7A4HFTFd,comment-id=0000,timestamp=2018-08-19T18:31:55.940+0000)\n>\n> Hätte sonst n team für euch wenn ihr mich adden könntet weil ich grad ingame bin :D ? ansonsten adde ich euch nach meinem game \n> Liebe grüße :)\n\nAdd ist raus :P","replies":[]}]}]}