{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2017-04-07T04:24:29.572+0000","title":"Client Beta Update #3: Closer to Completion","subforum":"The News Hour","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"CoolJayJay","date":"2017-04-08T01:59:22.454+0000","up_votes":9,"down_votes":0,"body":"When will you bring item sets to the updated client? I got information way back in patch 7.0 that item sets will be released in the updated client in around patch 7.1 or 7.2.. but i havn't seemed to find it happen just yet... have i missed them somewhere or is item sets still a thing to be released later on","replies":[{"poster":"groottt","date":"2017-04-08T02:02:24.020+0000","up_votes":3,"down_votes":0,"body":"This guy ask the right question, where is our item sets in new client?","replies":[{"poster":"Mindstar","date":"2017-04-08T03:03:03.468+0000","up_votes":3,"down_votes":0,"body":"Item sets are on the to-do list, but the focus right now is on getting the updated client released fully.  There's a bit more info & context around item sets in the Ask Riot post here - http://nexus.leagueoflegends.com/2017/03/ask-riot-movie-voice-item-sets/\r\n\r\nCheers!\r\nMindstar","replies":[{"poster":"Lord Sesshomaru","date":"2017-04-08T23:45:50.812+0000","up_votes":4,"down_votes":0,"body":"While i can see your reasoning, personally I think your priorities are muddled there.\r\n\r\nWe have survived on both clients for months now with little issue.\r\nThere is no drastic need to update immediately.\r\n\r\nRemoving one client without compensating for features on the other however, WILL cause problems for players, and above all create animosity for the new client.\r\n\r\nWhat possible harm could come from adding Item sets into the new client before retiring the old one?\r\n\r\nItems sets surely aren't rocket science for the coding team. Even just an alpha-stage option that can be updated at your leisure, would be more than enough for most players at this point.\r\n\r\nI was in the new client Alpha (and have used it ever since), and once you're used to it, its clear how much better it is from the old one. But forcing people into it BEFORE making sure that features people rely on have moved over as well, is a mistake.","replies":[]},{"poster":"Apivorous","date":"2017-04-08T09:53:16.329+0000","up_votes":1,"down_votes":0,"body":"Hold up, if you are moving to phase two, where Oceanic players will not be able to use legacy client (to create item sets) where does that leave me trying new characters? especially if you \"run into a bug\" where i'll indefinitely not be able to try new things...","replies":[]},{"poster":"TheJumpingBean","date":"2017-04-08T22:07:18.989+0000","up_votes":2,"down_votes":1,"body":"What's the point of releasing the client fully when you havent fully finished the client yet. Not being able to create item sets is a pretty annoying thing to just be forced onto. It's like saying \"we just created this new game but we hevent finished it yet, but here lets just release it anyways\". A Beta is made so that people can try the new client and find any bugs with it, that you guys need to fix before releasing the client to everyone. otherwise there was not much point to even having a beta version.","replies":[{"poster":"Mindstar","date":"2017-04-10T01:06:47.864+0000","up_votes":1,"down_votes":0,"body":"Hi\r\nWe've just put out a slightly more detailed FAQ this morning which might answer this better than me... but...\r\n\r\nFor item sets - we actually were originally planning not to port them over at all (not that many players use the feature).  Thanks to a lot of feedback, we have changed that plan an will bring them back, once LCU is launched.  In the interim there *are* ways to manage them using the API and third-party sites.  So you won't be totally in the dark.\r\n\r\nA note about Beta - you're exactly right it has been made available for players to test, find bugs and give feedback.  We're now confident that it is ready for prime-time and that the benefits to players will certainly outweigh the drawbacks.  \r\n\r\nNew features for League (e.g practice tool) will require the updated client, and the longer we keep the legacy client alive for, the slower this development will be.","replies":[{"poster":"TheJumpingBean","date":"2017-04-10T09:07:21.715+0000","up_votes":2,"down_votes":0,"body":"thanks for replying, i understand where your coming from and now have a clearer picture of whats going on. But for future refrence i would rather not be forced to use unfinished content and i am sure many players would agree. I understand that it is hard juggling the two clients and forcing the client onto players may speed up the improvements and changes that are being made to the new client but going that route does not particuarly make your playerbase very happy.\nBut i guess were just gunna have to roll with it.","replies":[]}]}]},{"poster":"ItsRafaXD","date":"2017-04-09T04:21:53.040+0000","up_votes":1,"down_votes":0,"body":"Is there any estimated patch for when items sets could possibly be re-added into the client?","replies":[]}]}]}]},{"poster":"Twenty Six","date":"2017-04-08T02:04:56.709+0000","up_votes":6,"down_votes":0,"body":"are you guys working on fixing up the new clients chat? its the only thing thats really annoying me. eg\r\n\r\ni preferred chat tabs at the bottom of my screen like in old client\r\n\r\nand also i cant message someone while in champion select unless i have recently talked to them. (cant see friends list while in champion select)\r\n\r\nI also found i never use my club chat anymore since the updated client.\r\nJust my opinions :D","replies":[{"poster":"OutMagic","date":"2017-04-08T04:11:19.090+0000","up_votes":4,"down_votes":0,"body":"yeah dude theyve said before in one of those ask posts, that once this whole phase is over theyre gonna work on chat so that you can see your friends list in champ select, and im sure many other epic features","replies":[{"poster":"Numemon","date":"2017-04-08T11:00:16.329+0000","up_votes":4,"down_votes":1,"body":"Yeah, real epic. Screw the new client.","replies":[{"poster":"STS Storm","date":"2017-04-08T14:32:32.316+0000","up_votes":2,"down_votes":0,"body":"agree with this,the client chat needs to be done BEFORE this stupid client gets put into effect","replies":[]}]}]}]},{"poster":"Hailwood","date":"2017-04-08T02:44:41.701+0000","up_votes":3,"down_votes":0,"body":"When will the language filter option in the new client actually affect the in game chat? Currently there's no way to turn it off!","replies":[{"poster":"The Liability","date":"2017-04-08T02:52:18.616+0000","up_votes":5,"down_votes":0,"body":"Type /chatfilter in game and it will fix this problem.","replies":[]}]},{"poster":"C4R4M31","date":"2017-04-09T08:28:01.362+0000","up_votes":2,"down_votes":0,"body":"Well it's nice to know Riot is giving us something besides Ocean Week. Even if we are their guinea pigs.","replies":[]},{"poster":"NP illusion","date":"2017-04-08T13:33:21.496+0000","up_votes":2,"down_votes":0,"body":"{{sticker:zombie-brand-mindblown}} ","replies":[]},{"poster":"dragon2004","date":"2017-04-08T10:25:22.842+0000","up_votes":1,"down_votes":0,"body":"Please fix the bug i am going through each time i play i get some sort of lag its not the ping but something else i checked my internet but still didn't work its some sort of pausing of the moment i attack a champion i don't know what to do?","replies":[{"poster":"TheJumpingBean","date":"2017-04-08T22:14:10.116+0000","up_votes":1,"down_votes":0,"body":"i used to get that too, i would have 25 ping, 150+fps yet everytime id attack something my game would freeze for 3 seconds then id be dead. Idk how but the problem sorta fixed itself so im unsure of how to help you","replies":[{"poster":"Trickster","date":"2017-04-17T02:18:03.490+0000","up_votes":1,"down_votes":0,"body":"So next patch it will probably fix it self yeah? Cause support saying i'm having packet loss lolz. but when I use newer modem I get higher ping of 60, where as this old packet loss modem still gives 33, which it use to give 22 until this new client was forced on us.","replies":[]}]},{"poster":"Trickster","date":"2017-04-17T02:16:09.663+0000","up_votes":1,"down_votes":0,"body":"This is the problem I have been getting! But my normal ping use to be 22 and now its 33.  U'd think 33 wouldn't be bad either but yeah what you are describing happens all the time. There's a pause at times even at last hitting the minions. I full reinstalled, nothing. I still don't know why my ping increased. I thought there servers are having congestion","replies":[]}]},{"poster":"Fug","date":"2017-04-08T11:44:33.706+0000","up_votes":1,"down_votes":0,"body":"with the new beta client whenever i finish a match, the re-loading of the client takes  ages and ages and i'm not so sure whether it's because of my low spec computer but i'd love it if you guys could help me at all or fix this since i love this game so much","replies":[{"poster":"Frìed","date":"2017-04-08T13:53:43.085+0000","up_votes":1,"down_votes":0,"body":"If you open up your general tab in settings in client, youll find something called close client during game and you have to untick it if you dont want post game screen to take so long to load. It's to help if you have a pc that has too poor performance etc. Hope you fix your problem man :P","replies":[{"poster":"Fug","date":"2017-04-10T10:30:47.056+0000","up_votes":1,"down_votes":0,"body":"Thanks so much for the help hahaha, i completely overlooked that, that could have been the reason for this problem, thanks so much!\n{{sticker:slayer-jinx-wink}}","replies":[]}]}]},{"poster":"Seigfried","date":"2017-04-09T11:17:39.635+0000","up_votes":1,"down_votes":0,"body":"Jokes on riot, April fools was last week {{summoner:3}} {{item:3070}} ","replies":[]},{"poster":"XeMurder","date":"2017-04-09T10:00:37.723+0000","up_votes":1,"down_votes":0,"body":"Does this mean the performance issues are going to be resolved soon?\r\nI'd rather enjoy not being forced to operate on 10-15FPS, when the original client gives me 30-40.","replies":[]},{"poster":"Dimpl","date":"2017-04-09T09:58:54.497+0000","up_votes":1,"down_votes":0,"body":"This isn't exactly related to the new client per-say, but synchronous chat in champ select would reduce a lot of flame in normals! If the player's own chat was treated the same way as the chat for all other players (i.e. it doesn't appear in the client until it's reached the server and bounced back) calls would be much less ambiguous. Currently, a player can call first on their screen but no one else's, which can lead to a bad game for everyone.","replies":[]},{"poster":"Yecob","date":"2017-04-09T06:45:22.895+0000","up_votes":1,"down_votes":0,"body":"I don't know why they're calling it finished when it doesn't even have all the features from the legacy client...","replies":[]},{"poster":"CadoAzazel","date":"2017-04-09T05:18:09.036+0000","up_votes":1,"down_votes":0,"body":"The profile page doesnt even count down time till next daily win,  you load it up, says 3 hours till daily win, 3 hours later still says 3 hours till daily win,  and this shits leaving beta ?  wow.....","replies":[]},{"poster":"ZAPAJ","date":"2017-04-09T03:52:24.201+0000","up_votes":1,"down_votes":0,"body":"why cant u guys start it in another server lol leave oceania my comp can barely run the new client even on low spec mode u %%%gs","replies":[]},{"poster":"Triffle","date":"2017-04-09T01:02:33.477+0000","up_votes":1,"down_votes":0,"body":"Good memes rito {{champion:157}} ","replies":[]},{"poster":"ChunkyBeef2","date":"2017-04-09T00:23:47.269+0000","up_votes":1,"down_votes":0,"body":"rip new client","replies":[]},{"poster":"Vitklim","date":"2017-04-08T23:45:10.658+0000","up_votes":1,"down_votes":0,"body":"One thing that I hadn't heard mentioned much before: Ranked statistics. One thing I miss more than item sets, is the ability to just look up my statisticks and performance on specific champions. Honestly wish that would be on the to-do list as well.\r\n\r\nAlso on the side note, I hope that sometime in the next patch, Rek'Sai, Vlad, Swain and Nidalee will get buffed. Like, I'm sorry, but it's friggin' impossible to play them, just cause how weak they are. There's literally no point in playing those champs, cause they don't offer much in terms of unique uselfullness, and a lot of other champs are just stronger than them.","replies":[]},{"poster":"BeemanAU","date":"2017-04-08T14:20:28.295+0000","up_votes":1,"down_votes":0,"body":"so what about me my computer is really old and am not able to get a new one any time so when I'm on the new client it runs really slow and glitchy I cant play on it and I highly dislike it is there anyway anyone can help me make it not so glitchy and laggy thanks \r\n","replies":[]},{"poster":"Best TwitchtvGFX","date":"2017-04-08T03:20:06.365+0000","up_votes":1,"down_votes":0,"body":"Can't wait to no longer have access to Item sets for months until they're done after all of the more important things are complete. :/\r\nAs much of a hassle it was to go to the legacy client to fix things about my sets, it'll suck without it at all for ages.","replies":[]},{"poster":"Twixiepupperz","date":"2017-04-08T10:14:47.967+0000","up_votes":1,"down_votes":0,"body":"why another new client so quickly after the last one tho? \r\n\r\nwill their be an easier way to look at owned skins? i forget what i have ","replies":[{"poster":"Numemon","date":"2017-04-08T11:13:56.843+0000","up_votes":1,"down_votes":0,"body":"I'd actually like a toggle to disable the skin window from popping up after locking in champions... :(","replies":[]}]},{"poster":"Tomatoes4Ever","date":"2017-04-08T06:14:27.836+0000","up_votes":1,"down_votes":0,"body":"After we finish a match, the loading screen takes way too long. Fix this","replies":[{"poster":"camull","date":"2017-04-08T06:57:21.272+0000","up_votes":1,"down_votes":0,"body":"turn off the option in the settings menu\r\n\r\nIts caused as the client has been closed completely to free up memory for lower spec machines. The client is reloading from scratch each time you finish a game as if your opening it for the first time ","replies":[]}]},{"poster":"CadoAzazel","date":"2017-04-08T06:05:50.304+0000","up_votes":1,"down_votes":0,"body":"How's my list of problems going that ive posted lots previously? \r\nLike random champ select button being missing.\r\nAnd being able to drag change lobby window size instead of 3 fixed sizes.","replies":[]}]}