{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-08-12T00:08:47.861+0000","title":"Ethernet vs. WiFi: Ping, Packets, & Playing Better","subforum":"The News Hour","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"DerpyHerpy","date":"2016-08-12T20:49:00.724+0000","up_votes":30,"down_votes":2,"body":"NBN! NBN! Flipping Abbott government should've done the job properly. ","replies":[{"poster":"EternalEntegrity","date":"2016-08-13T01:35:59.845+0000","up_votes":4,"down_votes":25,"body":"*cough* cough* Abbott government would of done it sooner but it was the Labor government that forced liberal into fixing other country debt issues that Labor caused","replies":[{"poster":"Trinity","date":"2016-08-13T03:10:37.064+0000","up_votes":13,"down_votes":3,"body":"Err, wow what a dumb comment. The liberals are about as backwards as you can get when it comes to internet infrastructure.","replies":[{"poster":"EternalEntegrity","date":"2016-08-13T05:37:27.941+0000","up_votes":3,"down_votes":13,"body":"***","replies":[{"poster":"nikoLOLas","date":"2016-08-13T08:40:30.705+0000","up_votes":15,"down_votes":2,"body":"You are entitled to your opinion but just know you have no idea what you are talking about and are wrong. Liberals did not come in and have to fix anything. In fact they came in and increased our debt while cutting services and pretty much downgrading the countries quality of living standards. Labor does its fair share wrong, but ever since the 60's they have been the superior government in pretty much every single aspect of governance.","replies":[]}]}]},{"poster":"Sir Ebonwolf","date":"2016-08-13T01:55:24.233+0000","up_votes":6,"down_votes":2,"body":"Haha, the labour government is ranked worldwide as one of the strongest economic governments and the liberal one is ranked close to the worst. The doublethink you idiots employ is ridiculous...","replies":[{"poster":"Gesteppie","date":"2016-08-13T05:17:26.982+0000","up_votes":2,"down_votes":0,"body":"maybe you have to double think the double think that everyone double thinks. coz basically when the goverments swap over they pick up off each others arguments for not having/ doing things anyway.","replies":[]}]}]},{"poster":"hiroshima1945","date":"2016-08-13T13:43:12.856+0000","up_votes":4,"down_votes":0,"body":"Two years after being announced it was coming, NBN is finally starting to be rolled out in my area.","replies":[]},{"poster":"Gesteppie","date":"2016-08-13T05:15:57.199+0000","up_votes":2,"down_votes":0,"body":"I one of the lucky people who got the fibre to the house and omg.... It's like a lifestyle change; everything happens when you want it to. You don't have to wait for your downloads to finish before you can jump into a game of league and still sit on a stable 20-30 ms ping.","replies":[{"poster":"Lady Fortuness","date":"2016-08-14T19:04:28.478+0000","up_votes":1,"down_votes":0,"body":"I HATE NBN! We used to be able to download roughly 3 movies at a time, duo league in the same room, listen to music on youtube, be signed into fb on both computers and have youtube playing on the tv simultaneously. NBN was installed outside our house and ever since, we've had to close our browsers, pause all downloads and can't watch youtube on the tv just so we could duo... _while_ hitting major ping spikes. Installation of NBN was the worst thing ever and we were \"upgraded\" to the fastest speed... pffft if we were on the fastest speed, wonder what the low speed would be like... dial up? \r\n\r\nAny way, using Ethernet cable helped. But that meant the main bedroom was turned into the gaming room and the lounge turned into our bedroom. That dedication {{sticker:slayer-pantheon-thumbs}} ","replies":[{"poster":"RavenZ","date":"2016-09-24T11:13:08.288+0000","up_votes":1,"down_votes":0,"body":"NBN comes in several different speeds. 100Mbps being the highest. Check with your ISP if you got the fastest one.","replies":[]},{"poster":"Gesteppie","date":"2016-08-14T19:44:14.688+0000","up_votes":1,"down_votes":0,"body":"If they're still installing NBN in your neighbourhood, yea you'll get disruptions. I had that while they were building around my place. But since that stopped, everything has been smooth.","replies":[]}]},{"poster":"Derpy McMuffins","date":"2016-08-13T14:14:06.526+0000","up_votes":1,"down_votes":0,"body":"Ours is 12ms solid, without fail. NBN da bomb (especially considering we were on 1M crappy Telstra DSL before that).\r\n\r\nPersonally I can't comment on difference between Ethernet and Wifi, because I don't trust wifi enough to try playing over it...","replies":[{"poster":"Gesteppie","date":"2016-08-14T19:46:19.144+0000","up_votes":1,"down_votes":0,"body":"I play on ethernet, but my housemate plays on wifi coz hes on a laptop. we're connected to the same modem/ router, but he always has connection issues and it's a damn good router too, not a little $50 thing, like a $500 thing. The wifi is fine for services that use loading and buffering, but anything streaming is a no no.","replies":[]}]}]},{"poster":"Lemøngraß","date":"2016-08-12T23:20:49.435+0000","up_votes":3,"down_votes":2,"body":"Sorry bro","replies":[]},{"poster":"TeCoolMage","date":"2016-08-13T13:08:52.911+0000","up_votes":2,"down_votes":1,"body":"Let's all agree that regardless of country and votes, the government always does a terrible job.\r\n\r\nThe question is, who's the least painful to deal with","replies":[]},{"poster":"Tetris Is Unreal","date":"2016-08-13T01:55:50.188+0000","up_votes":3,"down_votes":13,"body":"***","replies":[{"poster":"Sonan","date":"2016-08-13T03:17:49.349+0000","up_votes":1,"down_votes":0,"body":"This guy's comments are the reason i come here. It's always a different advertisement linked to the same place. kek","replies":[{"poster":"Wuks","date":"2016-08-15T08:12:44.413+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sonan,realm=OCE,application-id=pEj6Ee6n,discussion-id=5HKX0A7q,comment-id=000100020000,timestamp=2016-08-13T03:17:49.349+0000)\n>\n> This guy&#x27;s comments are the reason i come here. It&#x27;s always a different advertisement linked to the same place. kek\n\nIt's been taken care of. Sorry for the late action.","replies":[{"poster":"Sonan","date":"2016-08-25T01:50:39.115+0000","up_votes":1,"down_votes":0,"body":"lame","replies":[]}]}]}]},{"poster":"The Mark Show","date":"2016-08-18T11:38:54.532+0000","up_votes":1,"down_votes":0,"body":"Anonymous for government! ","replies":[]}]},{"poster":"shakenrobot","date":"2016-08-13T03:44:30.116+0000","up_votes":10,"down_votes":0,"body":"It would be cool if riot could relate players reporting each other for dc's and ping/packet loss so punishments will be less harsh for those affected by lag. Riot could also warn players before getting into a game that they're lagging thus having players knowing if they should play or not. {{sticker:slayer-pantheon-thumbs}} Just my opinion :)","replies":[{"poster":"Gesteppie","date":"2016-08-13T05:20:40.012+0000","up_votes":1,"down_votes":0,"body":"yea itd be great if they could set up a simulation ping server, so you could see you ping on the client. But it does open to the idea of people being able to ddos the servers. But if there were only a way people could know BEFORE they get into a game that their game is going to be crappy >_<","replies":[{"poster":"WeaponizedAutizm","date":"2016-08-13T12:28:27.895+0000","up_votes":1,"down_votes":0,"body":"I used to ask people why they insisted on queuing up for games (ranked or normal) if they know they have a crap connection (based on people who say they *always* have lag rather than just those who only lag when they die *huehue*), and after most responses went along the lines of \"because I want to\" or \"because I can\", I've given up asking. \r\nShitty connection or not, inclient ms testing ability or not, people with selfish shitty attitudes will continue to play anyway because they don't give a fat rats about anyone else.","replies":[{"poster":"DanceDanceNinja","date":"2016-08-14T11:36:00.033+0000","up_votes":2,"down_votes":0,"body":"Actually, most of those people started out answering your type of questions with \"Well my connection is shitty, I can't do anything about that as I can't afford a better connection or move to a better area, family's gotta eat. So I make do with my connection and try to contribute to the team as best as I can because otherwise it would mean giving up LoL.\"\r\n\r\nBut after the 200th game in a row they get asked the same question it becomes \"Because FU THAT'S WHY! I DO WHAT I WANT TO!\"","replies":[{"poster":"Gesteppie","date":"2016-08-14T19:50:21.713+0000","up_votes":2,"down_votes":0,"body":"If only the Libs didnt spend more money to make our internet crappier instead of just following through with the Labours NBN","replies":[]}]}]},{"poster":"Accountancy","date":"2016-08-14T17:58:57.605+0000","up_votes":1,"down_votes":0,"body":"Just run a custom game for yourself and see what your ping is like then.","replies":[{"poster":"Gesteppie","date":"2016-08-14T19:49:13.498+0000","up_votes":1,"down_votes":0,"body":"The thing about that is, one hour your ping might be fine, but then your ISP might hit a peak hour on its network, basically bottle necking anyone on that service. You can't plan for that unfortunately, and having to load up a custom every time you want to check your ping is just a horrendous waste of time.","replies":[]}]}]},{"poster":"Kuro Josh","date":"2016-08-14T05:36:29.129+0000","up_votes":2,"down_votes":0,"body":"You should try using this program called \"LoLReplay 2\" it has a feature that can tell you your ping before you go into game, as well as other things such as recording your games(doesnt make a noticable difference in game when using it either, unlike a lot of other programs, when you play it it plays the game back in spectator mode) also has other features like showing who you are up against in game and changing the login screen with the click of a button and adding customized champion filters for in champ select, really cool program (also you wont get banned for using it or anything, rito says its all good, can look it up if you want as well, i have) but its a real lifesave when someones downloading something which will cause me to lag out, and there are sure people who will play anyway, but i feel a lot of people would not, if they knew they were gonna lag, as it can be very frustrating playing and losing mainly due to you lagging and not being able to do what you want, would be nice though if rito added in all these features into the actual client though so we wouldnt need to rely on a 3rd party program but oh well, will be a while from now till that happens ","replies":[]}]},{"poster":"Pook","date":"2016-08-12T22:25:07.612+0000","up_votes":6,"down_votes":0,"body":"i thought Ethernet being better was obvious.","replies":[]},{"poster":"Lemøngraß","date":"2016-08-12T23:19:13.930+0000","up_votes":1,"down_votes":0,"body":"I usually sit on 20ms and Ive been using a gigabit Ethernet cable and STILL receiving massive spikes and lag related to server issues or peak times, just gotta call this one as shit happens lads, LOL!","replies":[{"poster":"Gesteppie","date":"2016-08-13T05:26:13.444+0000","up_votes":4,"down_votes":0,"body":"I think the game may recognise your name and is trying to tell you something >_<","replies":[]},{"poster":"Accountancy","date":"2016-08-14T17:59:44.623+0000","up_votes":2,"down_votes":0,"body":"Shoulda made the NBN better Tone","replies":[]}]},{"poster":"Bogart","date":"2016-08-12T19:28:40.909+0000","up_votes":4,"down_votes":1,"body":"Wireless anything is a bad idea for gaming, imo.","replies":[{"poster":"DragonOfTheVoid","date":"2016-08-12T20:51:29.386+0000","up_votes":1,"down_votes":1,"body":"not if you have 1000 megabyte per sec lol note i do have like 20 ms on WiFi so id have like 2 on Ethernet ","replies":[{"poster":"AChronicle X","date":"2016-08-13T04:16:08.195+0000","up_votes":2,"down_votes":0,"body":"I have 15 ping with WiFi, then I wanted to test on Ethernet and it went from 15 to 8. hehe xd","replies":[{"poster":"Bogart","date":"2016-08-15T19:46:09.019+0000","up_votes":1,"down_votes":0,"body":"lol almost cut it in half hahahaha","replies":[{"poster":"AChronicle X","date":"2016-09-12T12:30:20.044+0000","up_votes":1,"down_votes":0,"body":"Living in Sydney also helps your ping, or Melbourne.","replies":[]}]}]}]}]},{"poster":"Aria of War","date":"2016-08-12T21:14:38.821+0000","up_votes":3,"down_votes":1,"body":"You missed a great chance to write:\r\n\"After untangling my cat from the cat 6...\"","replies":[]},{"poster":"sihtsitahw","date":"2016-08-13T04:11:31.295+0000","up_votes":1,"down_votes":0,"body":"To everyone using wifi, PLEASE LOOK INTO \"ETHERNET OVER POWER\" It uses the electrical lines in the walls as an Ethernet cable. No need for wifi! ","replies":[{"poster":"Koncan5","date":"2016-08-18T09:17:14.293+0000","up_votes":1,"down_votes":0,"body":"Please don't do this.","replies":[{"poster":"sihtsitahw","date":"2016-08-30T22:23:56.226+0000","up_votes":1,"down_votes":0,"body":"What? why?  I've been using it for over a year now.  No packet loss or loss in connection what so ever.","replies":[{"poster":"Koncan5","date":"2016-10-09T09:49:40.129+0000","up_votes":1,"down_votes":0,"body":"You're on the same electrical circuit then. My house, for example, has six or seven different electrical circuits, each with their own breaker (and I can't imagine it being anything other than average as its only 20 years old). If you're not, then it's not going to work.","replies":[]}]}]}]},{"poster":"DiamondAries","date":"2016-08-13T02:28:02.567+0000","up_votes":1,"down_votes":0,"body":"While I do play on Ethernet, I still got around 80 average ping. Sometimes I would load into a game on 20, but as soon as the game starts goes straight up to 80. I also get random DC spikes where my ping shoots up to 2k+ which is really weird because it only happens on LoL.","replies":[{"poster":"Gesteppie","date":"2016-08-13T05:23:53.189+0000","up_votes":1,"down_votes":0,"body":"thast probably your ISP's connection to the servers in Sydney then.","replies":[{"poster":"DiamondAries","date":"2016-09-12T07:34:14.731+0000","up_votes":1,"down_votes":0,"body":"Probably. I filed a support ticket and they said much the same thing.","replies":[{"poster":"Gesteppie","date":"2016-09-16T08:16:57.201+0000","up_votes":1,"down_votes":0,"body":"Not much you can do about it.\nYou could email the communications minister or Shadow minister to tell them Turnbull should hurry up and finish the damn NBN XD","replies":[]}]}]}]},{"poster":"TheReliableShoe","date":"2016-08-13T00:26:32.111+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"TheReliableShoe","date":"2016-08-16T03:51:34.239+0000","up_votes":1,"down_votes":0,"body":"Haha thanks for help guys ;). I was kinda exaggerating with the every game/ all the time part and it is because of my modem. But I still get queues if I do lag. {{item:3070}}","replies":[]}]}]}