{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-08-04T05:40:57.486+0000","title":"Behavior, bugs, and more in Ask Riot","subforum":"The News Hour","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Aggredion","date":"2016-08-04T22:42:17.256+0000","up_votes":2,"down_votes":1,"body":"Your summs are there to use, just because someone used them both to get a kill out of you, doesn't make it an even trade.","replies":[{"poster":"EShadeSlayer","date":"2016-08-06T04:21:31.231+0000","up_votes":1,"down_votes":0,"body":"That depends on what happens after the fact, if them burning both summs to kill you means they dont have them up for the massive game-changing teamfight that happens 60sec later then its huge, early game it can be even bigger as burning both summs leaves you wide open for ganks over and over and over until they are back up","replies":[]}]},{"poster":"Shishimato","date":"2016-09-14T00:21:42.435+0000","up_votes":1,"down_votes":0,"body":"question, I just had a game where i was playing aram like normal, i realised that the other four were in a premade and they decided to all hide in bush cause the enemy were playing like bots, because i didnt do the same and do exactly as they told me to the started flaming swearing and everything then when i said i was just playing the game stop with the damn pings ect they went crazy swearing and everything then said all 4 were going to report me, even though i was doing nothing wrong. when they said dont push i stop and just ran around our minions but they continued with the flaming till i muted them, i kept playing and was even haling them ect just with them muted\nbut now do i need to be worried about being punished by riot from their reports even though they were the ones flaming? are solo players protected from premades bullying us? any advice?","replies":[]},{"poster":"Joerick","date":"2016-08-09T14:52:31.638+0000","up_votes":1,"down_votes":0,"body":"I'm sorry, but I couldn't hear you over the lack of anything actually changing...\r\n\r\nSorry guys, but you've been saying this for 5 years and literally nothing has changed, if anything it's gotten worse.","replies":[]},{"poster":"Folklore","date":"2016-08-09T12:20:08.567+0000","up_votes":1,"down_votes":0,"body":"If URF was a permanent mode, my problems would be rectified. ","replies":[]},{"poster":"HHTGH","date":"2016-08-05T06:46:29.238+0000","up_votes":1,"down_votes":1,"body":"I need help with my account, I want to change my email but my old email was stolen and I don't have access to it anymore, I cannot change my email to a new one and I also want to become a alpha client tester.","replies":[{"poster":"Algatress","date":"2016-08-08T09:48:50.005+0000","up_votes":1,"down_votes":0,"body":"Hey. Have you tried putting a ticket in with Riot Support? I'm sure they'd be willing to help you.\r\n\r\nYou can find them here.\r\n\r\nhttps://support.riotgames.com/hc/en-us","replies":[]},{"poster":"TAKORA ULTIMATE","date":"2016-08-07T08:53:03.220+0000","up_votes":1,"down_votes":0,"body":"im in the same boat, mine was hacked and now to change it i can't {{item:3070}} ","replies":[]}]},{"poster":"Algatress","date":"2016-08-08T09:31:56.511+0000","up_votes":1,"down_votes":0,"body":"I actually really enjoy these posts, especially the section about the bugs. I think people give Riot too hard a time when it comes to content, but I feel this is a good example of at least some kind of communication, even if it isn't entirely immediately relevant to content in the game.","replies":[]},{"poster":"Bjessen","date":"2016-08-07T13:56:22.854+0000","up_votes":1,"down_votes":0,"body":"ALL %%%%%%S SHOULD BE CULLED LMAO XD :3\r\n","replies":[]},{"poster":"dumbledank","date":"2016-08-07T06:49:13.866+0000","up_votes":1,"down_votes":0,"body":"Where be urf at? :( ","replies":[]},{"poster":"juzzykuzzy","date":"2016-08-07T01:11:30.776+0000","up_votes":1,"down_votes":0,"body":"ASK THIS: \r\nWHERE THE FUCK IS URF?\r\n","replies":[]},{"poster":"IM XD HUSTLa","date":"2016-08-06T12:05:51.605+0000","up_votes":1,"down_votes":0,"body":"{{champion:121}} {{summoner:14}} {{summoner:14}} ","replies":[]},{"poster":"Hippo31","date":"2016-08-06T11:29:38.543+0000","up_votes":1,"down_votes":0,"body":"love how this is called 'ask riot' ut riot doesnt respond to amyone\r\ngreat work guys","replies":[]},{"poster":"Ezekielbrodie","date":"2016-08-06T08:43:18.115+0000","up_votes":1,"down_votes":0,"body":"Nobody gives a fuck about super duper great sportsmanship. Encouraging the top end of the bellcurve of behaviour to get better does absolutely nothing about the toxic bottom 10% ruining everyone's day. Can we get a functional tribunal, actual bans rather than just chat restrictions, and some  attention to addressing toxicity in a direct manner that isn't just bullshit buzzwords. An RP giveaway doesn't stop the 13 year old riven who just died 3 times blaming the jungler and afking. ","replies":[]},{"poster":"GravesNoCigar","date":"2016-08-06T06:58:33.202+0000","up_votes":1,"down_votes":0,"body":"{{champion:80}} {{champion:245}} {{champion:76}} {{champion:420}} {{champion:37}} ","replies":[]},{"poster":"Zexcceed","date":"2016-08-06T05:52:22.906+0000","up_votes":1,"down_votes":0,"body":"the biggest bug i have encountered still hasn't been fixed. it when your hitbox is 10 times the size of the character model ","replies":[]},{"poster":"Fuhqyoo","date":"2016-08-07T04:44:18.402+0000","up_votes":2,"down_votes":2,"body":"You know, not all of us are a bunch of soft, cry-baby pussies, that need Riot to protect us from some in-game shit talking. Why can't they make a \"over 18\" mode, so I can BE MYSELF and not have to worry about triggering some feminized, politically correct, social-justice, millenial, by speaking my mind in chat and not get a 100 game chat restriction as soon as I come off the last one.  Why don't you just make a safe space for these douchebags at their home nexus, since you seem so intent on placating a bunch of sensitive snowflakes?  \"I swear, Riot could fuck up a wet dream.\" - Tryndamere  ","replies":[]},{"poster":"WinnieTheJew","date":"2016-08-06T00:17:02.935+0000","up_votes":1,"down_votes":1,"body":"On a completely unrelated note, that image looks a lot like a Minecraft convention. God be with you, Riot. May he give you the strength to endure.","replies":[]},{"poster":"DrakeSpear429","date":"2016-08-08T11:33:38.514+0000","up_votes":0,"down_votes":0,"body":"I have a question for Riot:\r\nWhen I played my ranked games, I was placed in a game where I was against a Gold level adc, whilst I only got to Silver 5 last season. Also, we had a former Platinum in one of our games. Now I'm in Bronze 4, but I'm just wondering why there's such a mix in the ranks when it comes to ranked play?","replies":[]},{"poster":"Exarch Leona","date":"2016-08-05T07:29:34.514+0000","up_votes":1,"down_votes":2,"body":"You get rewarded no matter what you do in terms of behaviour. I'm amazed my questions still being avoided, but same time I'm not surprised. ","replies":[]}]}