{"poster":"Report Urgot Pls","date":"2017-08-20T21:26:53.444+0000","title":"No entiendo nada.","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":1,"body":"Estaba en el men&uacute; de selecci&oacute;n de ARURF, y veo que uno tiene a Akali, por lo que se la trato de cambiar, pero termina rechazando (Soy M6 con Akali). Cuando empieza la partida, la Akali se empieza a mover dentro de base, pero no se va ni compra. 4 minutos despu&eacute;s, se va a linea. Yo estaba en top con TF. y ten&iacute;a en mi team y en la linea a un Amumu. Le pregunto de buena forma a la Akali qu&eacute; se estaba armando, porque la quer&iacute;a ayudar a ganar linea dandole la mejor build posible. Entonces, me dice, literalmente &quot;Me estoy armando a tu hermana&quot;. Le pregunt&eacute; por qu&eacute; contestaba as&iacute;, pero sigui&oacute; flammeando. Apenas pasa eso, el Amumu se tira contra un Malphite, se est&aacute; por morir, pero le tiro el stun de la W al Malp y le salvo la vida al amumu. Le pongo &quot;De nada&quot;, y se pone a flammear de forma agresiva y se va a molestar a bot. Al final, los de bot se fueron a top, yo me tuve que ir a bot, la Akali sigui&oacute; flammeando con una build mal&iacute;sima y con 0/9/0 de score, y encima me dice que es imposible de jugar y divertirse con gente como yo. \r\nAlguien me explica, hice algo mal? (fuera del de nada, pero no fue  con la intenci&oacute;n de vacilar, si no de, literalmente, decir de nada.)","replies":[{"poster":"TSW Rorschach","date":"2017-08-20T23:05:39.644+0000","up_votes":2,"down_votes":0,"body":"Entender a un lolero promedio es más difícil que entender por qué la tostada siempre cae del lado de la mermelada. Ni te gastes(?","replies":[]},{"poster":"martincarp","date":"2017-08-20T23:29:50.135+0000","up_votes":1,"down_votes":0,"body":"Al momento de comunicarte en una partida con los otros 9 desconocidos debes ser consciente de que estás chateando con alguien en internet, tú no sabes ni quién es ni cómo está en su vida la persona que está leyendo tu mensaje. Es texto, la comunicación no es igual que en una charla cara a cara o una conversación con voces de por medio, la gran mayoría de las veces el receptor del mensaje escrito le pone \"el tono\" en base a lo que siente uno en lugar de interpretarlo con la intención que el emisor del mensaje le quería dar.\n\nPara decirlo menos técnico, uno al hablar puede poner un tono de voz amigable a un \"che Akali, ¿por qué sacaste ese objeto? Te recomiendo este otro ítem porque se ajusta mejor por esto y esto\"... pero por chat la Akali puede tomarlo como le parezca (no lo digo de mala manera). Entonces, si decides hablarle sobre sus objetos a la Akali que ya va perdiendo la fase de líneas, el muchacho o muchacha estará algo frustrad@, por lo que tu mensaje será interpretado como un \"Akali wn, ¿que xuxa esa build? ¿No cachai como se juega tu mono?\", entonces lo terminarás poniendo a la defensiva y perderás totalmente la confianza y la afinidad de tu compañero de equipo.\n\nAsí que básicamente eso puede que haya sido lo que hiciste mal, por más que tus intenciones fueron buenas, fallaste en analizar cómo estaban tus compañeros más allá de su rol en la partida, \"\"\"te olvidaste\"\"\" de hablarle a la persona detrás del campeón.\n\nLo mismo va con el \"de nada\", si bien tal vez lo hiciste como algo automático, puede que tus compañeros lo hayan interpretado como un \"¿encima que hago todo por vos no me lo agradecés? GG\", haciendo que los pongas a la defensiva, lo mismo que en el caso anterior, les quitas las ganas de \"ayudarte\", y en el caso de que el jugador ya venga frustrado por andá a saber qué, sos la gota que rebalsa de la toxicidad, haciendo que moje la mesa con todo el flameo que venía acumulando.","replies":[]}]}