{"poster":"TheRealSekkonds","date":"2017-11-23T08:15:22.742+0000","title":"Gebannt wegen beleidigenden Kommentaren. Ich habe eine andere Meinung.","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":11,"body":"Morgen allerseits,\n\nich habe bis jetzt noch nie eine Strafe bekommen...\nVor ein paar Tagen kam dann die erste Chateinschr&auml;nkung rein.\nDie war noch nicht zu ende, da kam schon die n&auml;chste.\nUnd nun kommt der 14Tage Bann.\n\nIch habe mich in der Zeit genauso wie all die Jahre zuvor verhalten.\n\nLeute drehen in den Spielen durch, spampingen usw.\nIch spiele eine aggressive Ekko midlane und wenn jemandem mein Spielstil nicht gef&auml;llt, flamet er schon rum. Wenn ich dann antworte, werd ich also reportet? Wenn in meinem Spiel einer inted.. feeded.. und schei&szlig; treibt und ich ihn frage wieso, dann werde ich daf&uuml;r gebannt?!\nDas kann es doch nicht sein..\nKlar tilted man nach dem ersten Chatbann ein wenig, wenn man gerade seine Honor5-Stufe verloren hat nur weil man jemanden gefragt hat warum er feeded (0/10 und 6x Tr&auml;ne gekauft) und daf&uuml;r dann bestraft wird.\n\nWie auch immer hier ist der Chatlog des jetzigen BANNS:\n\nSpiel 1\nTheRealSekkonds: stop poking or u wont be able to farm\nTheRealSekkonds: lucky day when he tries to 3v1?\nTheRealSekkonds: +\nTheRealSekkonds: guys play defensive dont let them snowball\nTheRealSekkonds: if u dont go like 04 or sth i will carry\nTheRealSekkonds: pls dont die more\nTheRealSekkonds: gj\nTheRealSekkonds: i&acute;ll def top jax\nTheRealSekkonds: keep pushing dont die to syndra ult\nTheRealSekkonds: i fkn hit tower\nTheRealSekkonds: xd\nTheRealSekkonds: why did u die to syndra i told u\nTheRealSekkonds: i just told u\nTheRealSekkonds: y thats why i told u\nTheRealSekkonds: y and i told u\nTheRealSekkonds: shes gonna try to kill u\nTheRealSekkonds: why not go back so greedy\nTheRealSekkonds: y cuz u dont go back\nTheRealSekkonds: i killed top\nTheRealSekkonds: smarty\nTheRealSekkonds: damn man lee always where i am\nTheRealSekkonds: 5times ganked by lee now that turns annoying xd\nTheRealSekkonds: can i have blue rengar\nTheRealSekkonds: to push without losing hp\nTheRealSekkonds: so lucky lee\nTheRealSekkonds: just the tip of my e range\nTheRealSekkonds: u calculate nothing dude\nTheRealSekkonds: dude sotp feedin fio\nTheRealSekkonds: she was full hp when u died\nTheRealSekkonds: play defensively\nTheRealSekkonds: y and ur jax\nTheRealSekkonds: then go to ur turret\nTheRealSekkonds: jax inting\nTheRealSekkonds: enemy does baron u flame\nTheRealSekkonds: why u dont def bot botlane\nTheRealSekkonds: like my cs more?\nTheRealSekkonds: but i can\nTheRealSekkonds: also no pro can carry 4\nTheRealSekkonds: if that true pros would have 100% winrate\nTheRealSekkonds: faker doesnt even have 70% winrate\nTheRealSekkonds: kid\nTheRealSekkonds: k\nTheRealSekkonds: no team no win\nTheRealSekkonds: muted\nTheRealSekkonds: whole team flames\nTheRealSekkonds: thats hard 2 carry gg guys\nTheRealSekkonds: wait what\nTheRealSekkonds: u are flaming lol not me\nTheRealSekkonds: lol this kiddies man\nTheRealSekkonds: flame me and when i tell u they say im the one xd\nTheRealSekkonds: sona just said i am noob and cant carry\nTheRealSekkonds: but whatever\nTheRealSekkonds: i dont need to proof myself.. lol\nTheRealSekkonds: kiddy team cant carry these trash flamers. all muted\nSpiel 2\nTheRealSekkonds: lee dont come top i can 2v1 soon\nTheRealSekkonds: care for drake\nTheRealSekkonds: omg tf 20hp\nTheRealSekkonds: unlcuky xd\nTheRealSekkonds: now he cant run away\nTheRealSekkonds: ;)\nTheRealSekkonds: freekill btw\nTheRealSekkonds: omg\nTheRealSekkonds: no ult zil\nTheRealSekkonds: feels good to get carried tf? ;)\nTheRealSekkonds: u better win fast\nTheRealSekkonds: 20more minutes and u cant 3v1 me\nTheRealSekkonds: wow lb\nTheRealSekkonds: ur kidding\nTheRealSekkonds: cmon lee\nTheRealSekkonds: dont panic :-D\nTheRealSekkonds: holy\nTheRealSekkonds: why always outnumbered\nTheRealSekkonds: group up guys\nTheRealSekkonds: use ur wards\nTheRealSekkonds: and ping miss\nTheRealSekkonds: go to ur lanes\nTheRealSekkonds: if we have no pressure they keep 3v1 me\nTheRealSekkonds: sivir morg go bot be careful\nTheRealSekkonds: lb go mid\nTheRealSekkonds: lee care bout drake\nTheRealSekkonds: i push top to bait udyr top\nTheRealSekkonds: u cant contest\nTheRealSekkonds: dont try it\nTheRealSekkonds: dont ff\nTheRealSekkonds: we can win\nTheRealSekkonds: play smart\nTheRealSekkonds: stop panicing\nTheRealSekkonds: we will win\nTheRealSekkonds: u cant improve if u dont learn how to change when they have advatntage\nTheRealSekkonds: overextend?\nTheRealSekkonds: the problem is u cry like a baby\nTheRealSekkonds: instead of play\nTheRealSekkonds: we are winning\nTheRealSekkonds: shut up and play\nTheRealSekkonds: with what\nTheRealSekkonds: with saying we can win?\nTheRealSekkonds: my throw?\nTheRealSekkonds: u mean 12vs3 ganks?\nTheRealSekkonds: can u fkn shut up\nTheRealSekkonds: and play\nTheRealSekkonds: instead of cry and flame\nTheRealSekkonds: we are winnning\nTheRealSekkonds: texting wont help us win\nTheRealSekkonds: im not feeding\nTheRealSekkonds: im not 1/4\nTheRealSekkonds: but im outnumbered\nTheRealSekkonds: now shut up and play\nTheRealSekkonds: overextending or expecting ppl to be better?\nTheRealSekkonds: u think flaming and crying helps u to win?\nTheRealSekkonds: u have to concentrate\nTheRealSekkonds: then u will win\nTheRealSekkonds: tilt=lose\nTheRealSekkonds: wow\nTheRealSekkonds: ur kiddy right?\nTheRealSekkonds: u could steal baron but u go soio bot\nTheRealSekkonds: thats feeding\nTheRealSekkonds: stop tilting lee\nTheRealSekkonds: and we can win\nTheRealSekkonds: i didnt feed udyr\nTheRealSekkonds: i died once\nTheRealSekkonds: you fed him\nTheRealSekkonds: because he ganked and u not\nTheRealSekkonds: muted now\nTheRealSekkonds: u wont improve or learn\nTheRealSekkonds: hopeless case\nTheRealSekkonds: kiddy\nTheRealSekkonds: no he just constant better than u\nTheRealSekkonds: u will see\nTheRealSekkonds: dont speak big when u get carried\nTheRealSekkonds: things will turn u wont see it \nTheRealSekkonds: hm it was lose\nTheRealSekkonds: unluckyly they had baron\nTheRealSekkonds: good job team stil\nTheRealSekkonds: we tried\nSpiel 3\nTheRealSekkonds: make sure to report fizz\nTheRealSekkonds: gj\nTheRealSekkonds: atleast say miss\nTheRealSekkonds: leona\nTheRealSekkonds: atleast say miss or ward pls\nTheRealSekkonds: getting a fizz ahead is bad\nTheRealSekkonds: ^\nTheRealSekkonds: perma ganks man :(\nTheRealSekkonds: bot doesnt say miss\nTheRealSekkonds: i bought 4 wards now\nTheRealSekkonds: pls learn\nTheRealSekkonds: enemy jungler clears my wards\nTheRealSekkonds: unlike u\nTheRealSekkonds: 3 mid again\nTheRealSekkonds: no camille\nTheRealSekkonds: camille spampings me haha\nTheRealSekkonds: so funny u get 7 times ganked she gets a lot of kills out of it and spampings like a kid\nTheRealSekkonds: tahm\nTheRealSekkonds: u pinged top\nTheRealSekkonds: tahm\nTheRealSekkonds: u spamping top\nTheRealSekkonds: and then spamping me if i go there\nTheRealSekkonds: funny\nTheRealSekkonds: we woulve won taht fight\nTheRealSekkonds: why did u recall\nTheRealSekkonds: and now u lose it..\nTheRealSekkonds: unbelievabvle\nTheRealSekkonds: dont help me recall and then do this\nTheRealSekkonds: ofc more imapct than u and 8times ganked\nTheRealSekkonds: u need some gamesense\nTheRealSekkonds: muted\nTheRealSekkonds: doesnt u ask urself why morga is 4 times mid\nTheRealSekkonds: ^no challenge\nTheRealSekkonds: nice ult\nTheRealSekkonds: all that tristana can is flame xd\nTheRealSekkonds: i mean why def base when u can have a kill\nTheRealSekkonds: DUDE\nTheRealSekkonds: well gg\nTheRealSekkonds: flamers and trolls in my team\n\nwie man unschwer erkennen kann, ist das schlimmste, was ich tat zu fragen warum jemand etwas tut, obwohl ich gesagt habe das es passieren wird.\nUnd das auch nur weil die Typen es mit Absicht machten um das Spiel zu verlieren! Ich habe in diesen Tagen mindestens 6 Mitteilungen bekommen, dass meine Reports diese Spieler bestraft hat. Sie haben mich teilweise b&ouml;se beleidigt. Die meisten meine Todeszeiten gespampingt und son Mist. Und wenn man dann antwortet, wird man bestraft? Hallo wenn man sich nicht wehren darf, dann erlaubt doch bitte den Chat+Pings zu DEAKTIVIEREN\nBitte spart euch mir zu sagen, dass ich sie ignoriert oder gemutet h&auml;tten sollte. Einige Menschen k&ouml;nnen sich nicht einfach Beleidigen lassen. Deshalb sollte man den Chat deaktivieren k&ouml;nnen. Und die provozierenden Pings gleich mit.\n\nSeid ihr der Meinung meine Strafe ist gerechtfertigt? Ich habe immer nur versucht, zu gewinnen. Ich habe niemanden grundlos beleidigt.\nIch wurde b&ouml;se beschimpft und habe h&ouml;chstens kiddy oder so geantwortet.\nIch denke, dass ich nicht der bin, der bestraft werden sollte!\nIch habe niemals gefeedet. Niemals war ich rassistisch ich sage meinem Team immer, dass sie einen guten Job macht, wenn es denn so ist.\nAber ich sehe es nicht ein, wenn mich irgendwelche Kinder beleidigen!\nWas haltet ihr davon?\nBeim Lesen solltet ihr im Hinterkopf behalten, dass ich zu 80% geantwortet habe. ich schreibe nicht einfach &quot;bot doesnt say miss&quot;... die Botlane hat mich zugepingt und mich daf&uuml;r verantwortlich gemacht, dass wir verlieren. Bot war 0/3 0/4 ich war 4/1 mitte und botlane hat 3 mal mitte geganked und meine wards gecleared. Kleines Beispiel...\n\nPS: Bitte zählt die Rechtschreibfehler und Grammatikfehler nicht, ich bin müde und habe gerade keinen Kopf dafür. Ist ja keine Bewerbung ich hoffe es ist kein Problem :-D","replies":[{"poster":"Allerbester Biss","date":"2017-11-23T08:31:12.681+0000","up_votes":3,"down_votes":1,"body":"Absolut gerechtfertigter Ban.\nDu solltest mal lernen nicht alles an dich ran zu lassen!\n\nChat ausstellen = Pings und Chat muten\n\nSo schwer zu verstehen ist das doch nicht!","replies":[{"poster":"TheRealSekkonds","date":"2017-11-23T08:34:24.961+0000","up_votes":1,"down_votes":11,"body":"Doch es ist schwer. Ich habe keine Lust bei jedem Spiel am Anfang alle zu muten.. was ist aus dieser Community geworden..","replies":[{"poster":"CYPHΕR","date":"2017-11-23T09:14:37.854+0000","up_votes":10,"down_votes":0,"body":"Ironischerweise sind die einzigen die sich so über die Community äußern diejenigen, die einen 14-Tageban oder gar Permaban erhalten haben.\n\nWusstest du, dass sich z.B. diejenigen Spieler die sich am meisten über Flamer und negative Stimmung aufregen und beschweren selber stark zu Flame neigen?\n\nSpieler wie du, die sich über die negative Stimmung in Matches beschweren provozieren diese fast immer selber. Durch dein permanentes gespamme und verbreiten von negativer Stimmung bist du in den meisten deiner Matches der Auslöser der Probleme die du schilderst. Gerade Spieler wie du die alles und jeden kommentieren müssen nerven mit am meisten.\n\nVersuch einfach mal folgendes:\nGL & HF zu Beginn eines Matches, ab und zu ein wp oder gj und sonst nichts in den Chat schreiben. Glaub mir du wirst sehen wie friedlich der Chat plötzlich wird.","replies":[{"poster":"TheRealSekkonds","date":"2017-11-23T09:20:26.027+0000","up_votes":1,"down_votes":8,"body":"ich sagte bereits\nICH ANTWORTE\nich bin der auslöser wenn ich jemandem antworte der mich gerade nigger nennt. schon verstanden ;)\n0/5 botlane nennt mich silver trashcan weil sie meinen missping nicht beachten und sterben und ich antworte pls just paly defensive\nich bin auslöser. ist schon klar\nich habe versucht nur gl hf zu schreiben und auch versucht gar nichts zu schreiben\nentweder die flamen sich gegenseitig oder mich trotzdem, völliger quatsch","replies":[{"poster":"CYPHΕR","date":"2017-11-23T09:52:47.602+0000","up_votes":4,"down_votes":0,"body":"Und dein Gegenüber wird genau das selbe sagen. Er habe ja schließlich auch nur auf deine Provokationen geantwortet. Fast jeder Flamer behauptet er habe lediglich auf Flame anderer reagiert bzw. sich provozieren lassen.\n\nAber wenn du selber nicht in 3 Matches mehr schreiben würdest als ich in über 300 wäre das kein Problem. So triggert ihr euch aber gegenseitig immer weiter und es eskaliert immer mehr.","replies":[{"poster":"Sirrkas","date":"2017-11-23T11:03:29.722+0000","up_votes":6,"down_votes":0,"body":"Ich würde mal gerne einen Thread sehen, in dem 2 Spieler mit einem Bann aufeinander treffen, die sich gegenseitig geflamt haben und diese Einstellung vertreten. Ich stelle mir das etwa so vor:\n\nA: Ich habe ihn nur Fag genannt, weil er mich Retard genannt hat.\nB: Retard habe ich geschrieben, weil du Noob geschrieben hast.\nA: Aber davor hast du mich Bronzetrash genannt!\nB: Weil du einer bist, wie soll ich denn mit 100 HP noch dir gegen den Jhin helfen?\nA: Achja? Dafür hast du mir dauernd vorgehalten, ich wäre blind!\nB: Ich hab doch nur 3 mal gepingt, dass der Jungler bei dir ist und gleich gankt und gefragt, warum du nicht weg bist. Außerdem hast du über meinen Itembuild gejammert!\nA: Ich hab doch nur gefragt, warum du Frozen Heart gegen die baust?!?\nB: Das war ganz klar Blame! Und du hast die Mitte gefeedet!\nA: Das waren nur 2 Tode bis Minute 8, weil ich 2 mal gegankt wurde!","replies":[{"poster":"Homunculi","date":"2017-11-23T11:26:07.882+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=YFps3mgk,comment-id=000000000000000000010000,timestamp=2017-11-23T11:03:29.722+0000)\n>\n> Ich würde mal gerne einen Thread sehen, in dem 2 Spieler mit einem Bann aufeinander treffen, die sich gegenseitig geflamt haben und diese Einstellung vertreten. Ich stelle mir das etwa so vor:\n> \n\n> A: Achja? Dafür hast du mir dauernd vorgehalten, ich wäre blind! \n\n\nSagte er zum Lee Sin\n\n\nIch würde so eine Unterhaltung auch mal gerne erleben xD.\n\nZum TE:\n\nMit dem \"Antworten\" fangen deine Probleme an und es klingt ein wenig nach \"Aber die haben angefangen\" und das zieht seit dem Kindergarten nicht mehr.\nZur Überschrift; Meinungen sind wie Afterausgänge, wir wissen jeder hat einen, aber interessieren tut es die wenigsten.","replies":[]}]}]},{"poster":"Sirrkas","date":"2017-11-23T10:09:14.356+0000","up_votes":4,"down_votes":0,"body":"Du bist nicht unbedingt der Auslöser dafür. Aber den anderen zuspammen, dass er unnötig gestorben ist, löst bei dem genau das aus, worüber du dich beschwerst. Jemand greift dich persönlich an, und du musst darauf antworten. Das sieht der andere den du als Kid bezeichnest und vorwirfst seinen Job nicht zu machen genau so. \n\nDamit eskalierst du die Situation leider immer nur weiter, du verbesserst sie nicht. In den über 6 Jahren, die ich LoL Spiele, habe ich bisher nur ein Spiel gehabt, bei dem an mich Worte von dem Kaliber wie \"Fag\" \"Nigger\" oder \"Kill yourself\" gerichtet waren. Das liegt daran, dass ich im Spiel meist nur \"gl hf\" \"gj\" \"np\" und \"gg\" schreibe. Wenn ich nicht toxisch bin, sind das meine Mitspieler auch deutlich weniger.","replies":[]}]}]}]}]},{"poster":"Global Noc Out","date":"2017-11-23T08:33:40.031+0000","up_votes":6,"down_votes":0,"body":"Nimm mir das jetzt nicht zu krumm, aber solche Fragen sind doch total dämlich. Zum Einen ist doch wohl offensichtlich, dass dein gegenüber es für eine gute Idee hielt und nicht absichtlich scheiße gebaut hat. Und wenn doch ist die Frage ebenso unsinnig, da man sieht, ob jemand absichtlich mist macht oder nicht. Und desweiteren was stellst du dir denn für eine antwort vor? Willst du das spiel erstmal für zehn Minuten pausieren, damit ihr in ruhe drüber reden könnt, welche Gedanken er sich gemacht hat, was du davon hältst und hinterher vllt noch ein kleines fazit ziehen, wie man das beim nächsten mal machen könnte? Am besten sagst du vorher noch den gegnerischen Team Bescheid, dass sie die nächsten Minuten bitte nichts anstellen sollen, weil ihr zwei erstmal etwas miteinander chatten müsst und deshalb nicht spielen könnt.\nWenn du konstruktive Kritik hast oder das zumindest meinst, hau es raus und fertig. Es ergibt eh keinen Sinn darüber zu diskutieren. Entweder dein gegenüber nimmt es an oder nicht. Und wenn nicht kannst du ihn mit einer diskussion eh nicht überzeugen xD","replies":[]},{"poster":"TheRealSekkonds","date":"2017-11-23T13:42:06.518+0000","up_votes":1,"down_votes":7,"body":"Das sind nun ziemlich viele Antworten. Ich wiederhole mich gerne nocheinmal...\nIch bin mir bewusst, dass mein verhalten toxisch war.\nWie gesagt sind das ALLES antworten.\nViele von euch picken Zeilen aus dem Verlauf und stellen mich als den bösen da. Als Beispiel:\n\nTheRealSekkonds: i´ll def top jax  (jax war getiltet weil er mit nem anderen rumgeflamed hat und weil unser jungler nicht top geganked hat und er schon 3 mal starb, kam er einfach midlane und wollte dort weiterfeeden. naja wie auch immer ich habs gelassen genommen und zwangsmäßig die lane getauscht.)\n\nTheRealSekkonds: keep pushing dont die to syndra ult (ich hatte top pressure 2gegen1 gewonnen, sagte er soll pushen keine angst vorm jungler haben die syndra war 2level behind oder so\n\n\nTheRealSekkonds: i fkn hit tower (hmm hatte fast nen doppelkill leider mit dem letzten schlag vor der ulti (ekko) den turm getroffen hehe\nTheRealSekkonds: xd\n\n\nTheRealSekkonds: why did u die to syndra i told u  (jax hat im chat weiter mit dem jungler gestritten, sich beleidigt usw. jungler fragte warum er mitte gedived hat, er sagte, weil er nicht wusste, dass ich noob syndra gefeeded hatte (hatte positiven score+ cs/lvl advantage. deshalb fragte ich ebenfalls und sagte nochmal das ich ihm gerade sagte, was passieren wird\n\n\nTheRealSekkonds: i just told u (er sagte sowas wie \"stfu noob i didnt know her ult was rdy)\n\nTheRealSekkonds: y thats why i told u (ja deshalb sagte ich es)\n\nTheRealSekkonds: y and i told u \nTheRealSekkonds: shes gonna try to kill u (keine ahnung erinnerung verblasst er hat irgendiwe behauptet, dass er hätte nichts machen können dagegen und das es junglers schuld sei\n\n\nTheRealSekkonds: why not go back so greedy (seine schuld, deshalb warum nciht back? (so viel wie bitte das nächste mal zurück) er hatte schon 0/5 oder so keine ahnung\n\n\nTheRealSekkonds: y cuz u dont go back  (sowas wie what should i do when she towerdives me? ja zurückgehen, hallo? hatte 300hp rennt unter den turm und dann wieder zurück muss man sich ja nicht wundern^^\n\nTheRealSekkonds: i killed top  (beleidigt mich von wegen was hätte ich denn in der zeit gemacht.. doppelkill toplane.. naja\n\n\nIst nur ein kleines Beispiel. Ich wurde in diesem Spiel heftig provoziert und beleidigt. Fakt ist alle Lanes außer mir haben kläglich versagt. Ich rede vom klassischen ich 4/1 team 0/8 sowas in der Art habs vergessen.\nDann rennt mein 0/8 team in das gegnerische Team, ich weiß, dass der Kampf nicht gewonnen werden kann, also zerstöre ich lieber Toptower und pinge sie weg. Wird ignoriert, Kamp verloren und ich werde von 4 Feedern geblamed, beleidigt, gespampingt und reportet. Ob ich geflamet habe oder nicht tut da nicht viel zur Sache. Also ich persönlich bin sogar froh darüber in der Situation nicht beleidgt zu haben.\n\nEs ist einfach hart mit diesen ganzen \"Spielern\" die eben nicht so gut sind und zu viele Videos schauen.\nMir muss keiner erklären, dass ich etwas falsch mache und was es ist. Es ist mir schon klar. Nur meint ihr nicht, dass es fair ist, im \"Rahmen\" zu antworten? Man sollte das GANZE betrachten und nicht nur meine Zeilen. Ist mir schon klar, dass ein automatisiertes System weitaus günstiger und effizienter im Ganzen ist, aber kommt schon... ich denke nicht, dass ich eine Sperre verdient habe, weil ich einem 0/5er der meine Lane ruiniert und mich dafür verantwortlich macht, dass er gegen Fiora aus maul bekommt sage er soll nicht gegen syndra diven und nachdem er es tut und andere dafür verantwortlich macht frage warum er es tat (sah halt für mich nach inting aus.. ich mein wer geht 0/4 und rennt dann unter nen turm???????)\n\nIch finde Riot ist da zu oberflächlich.\nIch weiß ich hätte muten sollen aber manchmal geht es einfach nicht!\nEs gibt Menschen, die können das nicht einfach ignorieren.. das muss Riot verstehen.\nEs gibt Charakterzüge, die schwer sind komplett abzuschalten.\nAls Beispiel mal Tyler1... er beleidigt auch nicht mehr.. hat sich gebessert. Feedet intet nicht mehr.. trotzdem würde jeder account gebannt werden, da er immernoch zeugs wie \"...\" usw schreibt.. eben provoziert und dann auch antwortet.\n\nIch finde, dass das gegnüber entscheidet, ob er mich hören möchte oder nicht.\nEr kann mich doch auch muten, wenn ihm meine \"kommandos(wie ihr sie nennt)\" nicht gefallen...\nIch finde, dass man nur wegen beleidigungen gebannt werden sollte. wegen so etwas doch nicht... ich habe 400skins auf meinem account und soll sie verlieren weil ich zu jemandem kind gesagt habe, der mich hart beleidigt und nen anderen gefragt habe wieso er 0/5 mitte und top inted und uns dann dafür blamed\nKOMMT SCHON\n\nkommt mir vor wie ein kindergarten.. und wenn eins frech ist, bekommts paar böse worte vom onkel... und wenn ich dann \"toxic\" bin.. naja dann bitte nimmt mir die chance zu antworten\nwenn doch der chat schuld daran ist und ich alle muten soll, warum kann ich ihn nicht deaktivieren.. was hat das für einen sinn :-D\nich kann den allchat deaktivieren und den teamchat nicht. macht auch keinen sinn.\nriot solte einfach eine funktion implementieren, den chat und die pings zu deaktivieren.\nmanche spieler (ich inklusive) haben es nicht einfach jedes spiel aufs neue die leute zu muten usw. ich finde es schade ich würde gerne freundlich mit meinem team umgehen und spaß haben, wie früher... aber das ist mit der heutigen community einfach nicht mehr möglich. ich habe mehrere accounts und mehrere freunde die mit und ohne mich im diamond bereich spielen. erfolgreich. dort ist es leider auch nicht mehr anders. dasselbe spielchen nur anders formuliert. es ist so schade um das spiel. als wäre ich ein schwerverbrecher lol\njedes dritte spiel beleidigt einer und ich lese kys oder son scheiß... in den oben benannten spielen waren mehrere leute die schrieben müll wie zb. i fk your mother\naaaaaaaaalter? und das soll ich dann so hinnehmen und auf mute drücken? ICH kann das nicht. tut mir leid.\ndas ist mein charakter und damit bin ich nicht alleine. deshalb gibt doch den leuten, die eigentlich positiv sind aber sich gerne provozieren lassen die chance, diese vollidioten zu ignorieren..","replies":[{"poster":"Vogeljunges","date":"2017-11-23T13:48:59.087+0000","up_votes":7,"down_votes":0,"body":"Naja, die Zeilen, die wir uns hier rauspicken triggern nunmal die Chatüberwachung und haben zu deiner Strafe geführt. Und da du fragst, ob wir das gerechtfertigt finden mit der Strafe führt wohl zwangsweise dazu, dass wir uns jene Sätze herausnehmen und hier anführen.\n\nUnd da Spieler mit deinem Problem ja auch immer gerne darauf verweisen \"der und der hat das und das geschrieben.\", auch die Hinweise, dass du nicht wissen kannst, ob jene Bösewichte nicht auch bestraft wurden/werden... \n\nEs geht um dein Fehlverhalten und das ist offensichtlich.\n\nEdit: Wenn du das nicht hinnehmen kannst und du über keinerlei Selbstdiziplin verfügst und dich nicht am Riemen reissen kannst, wenn du so sehr von der Kommunikation anderer abgelenkt und getriggert wirst und du die Schuld daran nicht dir selbst sondern einzig und allein Riot gibst, dass die keine Funktion zum Abstellen des Chats _** für dich**_ bereit stellen - dann wirst du wohl deinen Account verlieren.","replies":[]},{"poster":"Sirrkas","date":"2017-11-23T14:02:00.907+0000","up_votes":6,"down_votes":0,"body":"> ich denke nicht, dass ich eine Sperre verdient habe,\n\nDas beißt sich hiermit:\n\n>Ich bin mir bewusst, dass mein verhalten toxisch war.\n\nEntweder, du warst toxisch und hast eine Strafe verdient oder du warst nicht toxisch und hast keine Strafe verdient. Toxisch bei einer Reaktion auf schlimmere toxische Sachen, ist keine Entschuldigung dafür, selber Fehlverhalten zu zeigen. Wenn sie dich beleidigen, mute sie. Ab da ist deren Chat meist eh zu nichts mehr zu gebrauchen. Das beste, was ich bis jetzt von Leuten gesehen habe, die geflamt haben war, dass sie irgendwann damit aufgehört haben. Da kam noch nie etwas nützliches von denen im Chat. \n\nDie sehen sich selbst ebenfalls so, wie du dich siehst. Besser als die anderen, wissen wie man richtig spielen muss und was einem dem Sieg näher bringt. Nur wenn ein paar mit dieser Einstellung aufeinandertreffen, kommt es eben zu Streit und jeder macht sein eigenes Ding.\n\n>Es gibt Menschen, die können das nicht einfach ignorieren.. das muss Riot verstehen.\nEs gibt Charakterzüge, die schwer sind komplett abzuschalten.\n\nWenn es Leute gibt, die immer selber toxisch werden müssen, muss das nicht Riot oder die Community verstehen. Die Leute müssen verstehen, dass niemand mit ihnen spielen will und Riot sie nicht in LoL haben möchte, weil die Community sich an solchen Leuten stört. \n\n>Als Beispiel mal Tyler1... er beleidigt auch nicht mehr.. hat sich gebessert. Feedet intet nicht mehr.. trotzdem würde jeder account gebannt werden, da er immernoch zeugs wie \"...\" usw schreibt.. eben provoziert und dann auch antwortet.\n\nWarum nimmst du den als Beispiel? Das ist ein Streamer, der sich absichtlich toxisch verhalten hat, um seinen Zuschauern zu gefallen. Mit etwa 20 permanent gesperrten Accounts hat er dann auch einen Personenbann erhalten. Das ist so etwas wie ein Berufsverbot. Jeder Account, der öffentlich bekannt wird, wird auf Sicht gebannt. \n\nDu kannst nach einem Permabann einen neuen Acc erstellen, dich auf dem benehmen und wirst nie wieder belangt. Den Luxus hat jemand mit einem aktiven ID-Bann nicht mehr. Wobei Tylers ID-Bann wohl demnächst aufgehoben werden soll oder vielleicht schon ist.\n\n>Ich finde, dass das gegnüber entscheidet, ob er mich hören möchte oder nicht.\n\nDas machen sie, ein Teil davon ist eben der Report, der zu Banns führen kann. \n\nAber zu sagen, \"ja die anderen sollen das halt ignorieren/mich muten\" wenn du selber schon meinst, du kannst das nicht, ist seltsam. Mit einem ähnlichen Argument könnte man auch sagen, jeder sollte in der Öffentlichkeit mit Waffen wahllos auf Leute schießen dürfen (ja ich weiß, ein Extrembeispiel), die könnten sich ja schusssichere Westen holen, damit sie nicht gleich sterben. Die anderen sind aber nicht dafür verantwortlich, sich abzusichern, niemals von dir gestört zu werden, du bist dafür verantwortlich, wenn du andere störst. \n\n>Ich finde, dass man nur wegen beleidigungen gebannt werden sollte. wegen so etwas doch nicht... ich habe 400skins auf meinem account und soll sie verlieren weil ich zu jemandem kind gesagt habe, der mich hart beleidigt und nen anderen gefragt habe wieso er 0/5 mitte und top inted und uns dann dafür blamed\nKOMMT SCHON\n\nDu kannst meinen was du willst. Das steht dir frei. Das setzt dich aber nicht über die Interessen der Gemeinschaft hinweg. Man kann auch der Meinung sein, nur Mord sollte bestraft werden. Aber das ist auch nicht gerade sinnvoll. Zudem hast du ja beleidigt. \nOb und wie viel RP du gekauft hast, ist auch egal. Alle werden beim Bannsystem gleich behandelt. Egal ob der Account 1 oder 7 Jahre alt ist, man 0, 10 oder 1000 € ausgegeben hat. \n\nZudem wurdest du nicht für einmal Kind gebannt. Noch ist dein Account nicht weg. Du warst sehr lange störend im Chat. Deshalb hast du 2 CRs und nun den 2 Wochenbann erhalten. Es liegt an dir, ob du so weiter machst und den Perma erhältst oder nicht. Also komm schon, reiß dich am Riemen und rette deinen Account, solange es noch geht.\n\n>kommt mir vor wie ein kindergarten.. \n\nJa, so benimmst du dich hier. Du jammerst gerade \"der andere hat aber angefangen\" während Riot dir versucht zu erklären, dass es nicht in Ordnung ist, mit Sand um dich zu werfen, auch wenn der andere dir vorher die Zunge rausgestreckt hat. \n\n>wenn doch der chat schuld daran ist und ich alle muten soll, warum kann ich ihn nicht deaktivieren.. was hat das für einen sinn :-D\n\nEigentlich sollst du nicht alle muten, du sollst dich nur benehmen. Wenn du das nicht schaffst oder willst, steht es dir frei, stattdessen alle zu muten. Aber warum soll Riot die Option einführen, den Chat zu deaktivieren, weil ein paar Flamer sich nicht benehmen wollen?\n\n>ich finde es schade ich würde gerne freundlich mit meinem team umgehen und spaß haben, wie früher... aber das ist mit der heutigen community einfach nicht mehr möglich. \n\nDas ist noch immer möglich und bei mir der Normalfall. Ich sehe eher selten jemanden in meinem Team, der flamt. Aber ich halte denen auch nicht vor, dass sie dauernd sterben oder kein SS pingen. Du sorgst mit deinem Chat leider selber dafür, dass dein Team häufiger toxischer wird, als sich zu beruhigen.\n\n>jedes dritte spiel beleidigt einer und ich lese kys oder son scheiß... in den oben benannten spielen waren mehrere leute die schrieben müll wie zb. i fk your mother\n\n\"Kys\" habe ich jetzt einmal in über 6 Jahren gelesen. Der meiste Flame den ich sehe, kommt im Allchat von den Gegnern, die sich gegenseitig vorwerfen toxisch zu sein. Meistens kommt von den ADCs die ich supporte so etwas wie \"my bad\" wenn sie gestorben sind. Wenn ich auf die paar schwarzen Schafe die \"why you no help!\" schreiben aber so antworten würde wie du, würde ich sicher auch regelmäßig \"Kys\" lesen dürfen.\n\nIch fürchte, hier hat sich nicht die Community zum schlechten um dich herum gewandelt, sonder du hast dich im Laufe der Jahre immer mehr zum schlechten Entwickelt und \"wie man in den Wald ruft, so schallt es heraus\" scheint bei dir gut zuzutreffen. Die Leute antworten eben wie du, auf Toxicity mit mehr Toxicity. Dadurch schüttest du Öl ins Feuer, bis daraus ein Flamewar wird und als Resultat sieht man jetzt leider einen 2 Wochenbann bei dir. \n\n>aaaaaaaaalter? und das soll ich dann so hinnehmen und auf mute drücken? ICH kann das nicht. tut mir leid.\n\nDann such dir ein Spiel, in dem Fehlverhalten nicht geahndet wird. In LoL erhältst du den Perma, wenn du zurück flamst.\n\n>das ist mein charakter und damit bin ich nicht alleine. deshalb gibt doch den leuten, die eigentlich positiv sind aber sich gerne provozieren lassen die chance, diese vollidioten zu ignorieren..\n\nDie hast du, Mutefunktion ist dein Freund. Du willst sie aber scheinbar nicht wirklich nutzen.","replies":[{"poster":"Awsane","date":"2017-11-23T15:45:29.300+0000","up_votes":2,"down_votes":0,"body":"Ich stimme dir over all zu\n\nDer TE hat ein Fehlverhalten gezeigt und bekommt dafür auch gerechtfertigt seine Strafe.\n\nAber ich finde er hat einen Punkt, nämlich, dass sein Verhalten im Kontext zur Gesamtsituation gesehen und auch davon bewertet wird. So wie es ja sonst auch in der Justiz meines Wissens nach Standard ist, da bekommt nämlich nicht jeder die selbe Strafe für ein Identisches Vergehen.\n\nIch will jetzt hier gar nicht seine Umstände genauer unter die Lupe nehmen. Aber ist die Bitte nach einer Differenzierung der Strafe nicht gerechtfertigt? Weil momentan wird das ja kaum gemacht vom automatischen System.\n\nOb das jetzt umsetzbar ist, ist dann noch was anderes aber wenigsten darüber zu diskutieren wird doch erlaubt sein?\n\nAlso ich wäre für eine Differenzierung von Strafen je nach Ausgangssituation, weil wenn ich betrachte was der TE gemacht hat im Verhältnis zu anderen Tätern mit identischen Strafmaß finde ich das System nicht fair. \nIch will nicht sagen, das der TE keine Strafe oder weniger erhalten soll, sondern nur darüber mal zu diskutieren.","replies":[{"poster":"Sirrkas","date":"2017-11-23T16:17:02.426+0000","up_votes":2,"down_votes":0,"body":"Man kann gerne darüber reden. \n\nDie Gesamtsituation wird im Grunde mit betrachtet. Nur eben nicht auf das einzelne Spiel, sondern auf seine Gesamtsituation. Er ist sehr oft störend, über viele Spiele hinweg. Er wurde nicht einfach für die 3 Spiele mit dem 2 Wochenbann bestraft, sondern dafür, dass er oft genug negativ auffällt, um die 2 CRs durchlaufen zu haben, sich nicht gebessert hat und jetzt den 2 Wochenbann erhält. \n\nWenn jemand in einer Diskothek Opfer eines Schlägers wird, kriegt der sicher auch kein Hausverbot. Wenn der Typ aber jede Woche verprügelt wird, weil er die Leute dauernd dazu provoziert, kriegt der auch mal sein Hausverbot. Nicht dafür, dass er geprügelt hat, sondern eben dafür, dass er dauernd Prügeleien heraufbeschwört. \n\nRiot hat hier das Hausrecht, wenn die sagen, sie wollen ihn nicht mehr als Kunden, kriegt er einen Permabann. Dafür muss man sich bei LoL aber schon einiges geleistet haben. Den kriegen nicht umsonst nur 0,006 % aller Accounts. \n\nNatürlich war er nicht so schlimm wie ein Troll, int Feeder oder Rassist. Die kriegen aber als erste Stufe den 2 Wochenbann und danach den Perma. Der TE kriegt noch 2 weitere Stufen. \n\nDas Problem das sich ergibt, wenn man das Verhältnis der toxischen Spieler im Vergleich zu dem Verhalten der anderen in Relation setzen will ist dann auch, dass der andere auch seine Gründe hatte. Für Selbstverteidigung würde niemand bestraft werden, solange sie im Rahmen ist, hier ist das eben muten und melden.\n\nWenn der TE eine Bewährungsstrafe hätte und dann wieder verurteilt wird, kriegt er ja auch im Grunde eine härtere Strafe, da er sich nicht gebessert hat.","replies":[{"poster":"Awsane","date":"2017-11-23T16:53:09.797+0000","up_votes":2,"down_votes":0,"body":"Ich persönlich hätte gerne eine Ingame Berücksichtigung, weil es gibt mMn Spielerisch gute Verhaltensweisen, wie z.B. agressiv eine Lane zu spielen, die wenn es nicht klappt öfter zu unmut im eigenen Team führt als wenn man z.B. passiv spielt. Nur um mal ein ganz Plattes Beispiel zu nennen.\nUnd ich finde dann sollte man das Verhalten des Teams berücksichtigen, weil ja, der Täter (ich rede hier nicht vom TE sondern von einem allgemeinen Fall) hat etwas getan, dass sein Team provziert, aber es ist ok vom Verhalten her es zu tun. Und wenn dieser nun häufiger dadurch geflamt wird und so er irgendwann dadurch Fehlverhalten zeigt (Stichwort Induktion)finde ich ist das definitiv davon abzugrenzen von jemanden der unabhängig davon ob er oft geflamt wird (zu unrecht) Fehlverhalten zeigt.\n\nIch rede hier nicht von Strafbefreiung sondern davon das die beiden Fälle unterschiedlich bestraft werden.\n\nAlso ich finde das Disco Beispiel nur dann gut, wenn der Täter bewusst provoziert. Tut er es nicht oder kann nichts dafür (sagen wir er hat ein Muttermal im Gesicht das andere als Anlass nehmen oder sonst irgendetwas, wofür er nix kann) wird es die Disco es schwer haben wenn er sich immer deeskalierend verhält ihn Hausverbot zu geben, weil man kann nämlich nicht einfach so Leuten Hausverbot geben, wenn es öffentlich(Disco) ist.\n\n> Natürlich war er nicht so schlimm wie ein Troll, int Feeder oder Rassist. Die kriegen aber als erste Stufe den 2 Wochenbann und danach den Perma. Der TE kriegt noch 2 weitere Stufen.\n\nIch habe hierbei auch nicht an die Überspringer(von Strafstufen) gedacht, sondern an diejenigen, die exakt den gleichen Strafverlauf haben.\n\n> Das Problem das sich ergibt, wenn man das Verhältnis der toxischen Spieler im Vergleich zu dem Verhalten der anderen in Relation setzen will ist dann auch, dass der andere auch seine Gründe hatte. Für Selbstverteidigung würde niemand bestraft werden, solange sie im Rahmen ist, hier ist das eben muten und melden.\n\nJa, aber es gibt dennoch Gründe die mMn härter wiegen als andere und zwischen denen sollte man unbedingt Vergleichen und Bewerten. Jemand in einer dauer/chronischen Stress Situation wird anders Bestraft als jemand der aus niedrigen Beweggründen handelt oder im Affekt etc pp. \n\nUnd ja es gibt nicht so viele Täter und man muss sich einiges Leisten um Bestraft zu werden. Dennoch sehe ich nicht, warum man nicht dennoch die Umgebungsfaktoren dabei berücksichten sollte.\n\nIch persönlich finde, dass bei allen Strafen zu sehr nach Schema F bewertet wird (nach dem Motto jede Ausgangslage ist gleich und das ist ja nicht so) und zu wenig die Ausgangslage IM SPIEL betrachtet wird um vllt. daraus auch Rückschluss warum Fehlverhalten ensteht zu finden und so vllt. möglichkeiten zu finden Fehlverhalten effektiver zu reduzieren.","replies":[]}]}]}]}]},{"poster":"Wernicke","date":"2017-11-23T10:25:42.661+0000","up_votes":4,"down_votes":0,"body":"> und wenn jemandem mein Spielstil nicht gefällt, flamet er schon rum. Wenn ich dann antworte, werd ich also reportet? Wenn in meinem Spiel einer inted.. feeded.. und scheiß treibt und ich ihn frage wieso, dann werde ich dafür gebannt?!\n\n> wie man unschwer erkennen kann, ist das schlimmste, was ich tat zu fragen warum jemand etwas tut,\n\nDu wurdest für dein negatives Verhalten im chat bestraft, und ja, du warst wirklich sehr negativ.\nAber bei der Menge an chat hätte ich dich sowieso reported, und zwar völlig unabhängig vom Inhalt. Du sollst dich aufs Spiel konzentrieren und nicht chatten wie ein kleines Mädchen in whattsapp und dich und alle anderen ablenken!\n\nNun noch ein Paar Bsp für negatives Verhalten, da dir das ja nicht ganz klar zu sein scheint.\n\nTheRealSekkonds: why did u die to syndra i told u\nTheRealSekkonds: i just told u\nTheRealSekkonds: y thats why i told u\nTheRealSekkonds: y and i told u\n\nTheRealSekkonds: kid\nTheRealSekkonds: k\nTheRealSekkonds: no team no win\nTheRealSekkonds: muted\nTheRealSekkonds: whole team flames\n\nTheRealSekkonds: lol this kiddies man\n\nTheRealSekkonds: kiddy team cant carry these trash flamers. all muted\n\nTheRealSekkonds: the problem is u cry like a baby\n\nTheRealSekkonds: shut up and play\n\nTheRealSekkonds: make sure to report fizz\n\nSind nur ein Paar Beispiele. Man braucht eben keine direkten beleidigungen um zu flamen. Es geht um negatives Verhalten und nicht explizit um eben Beleidigungen. Besonders nach einer Vorstrafe sollte einem das spätestens bewusst sein.\n\n> Seid ihr der Meinung meine Strafe ist gerechtfertigt?\n\nJa.","replies":[]},{"poster":"Qbert","date":"2017-11-23T08:38:25.977+0000","up_votes":4,"down_votes":0,"body":"Gut, du hast eine andere Meinung, es sei dir gegönnt.\nDiese interessiert Riot jedoch nicht.\n\nIch würde dir zwar zustimmen, dass hier kein \"harter\" Flame gefallen ist, aber es ist schlichtweg viel. Sehr viel Geschreibe mit sehr wenig Inhalt. Informationen die keiner benötigt, blame und Report-Aufrufe.\nWenn ich mir vorstelle, dass ein Großteil deiner Spiele so laufen, ist das aufsummiert durchaus einen Bann wert.\n\nDu solltest innerhalb der 14 Tage drastisch an deinem Chatverhalten arbeiten, denn sonst bist du deinen Account kurz danach für immer los. Denn nach dem Bann reicht ein \"stfu noob\" und der Permabann folgt.","replies":[{"poster":"TheRealSekkonds","date":"2017-11-23T08:43:03.131+0000","up_votes":1,"down_votes":7,"body":"ist einfach schade, dass Spieler wie ich, die gewinnen wollen es nur mit vollidioten aushalten müssen, die einen beleidgen und reporten\nso sind im moment 90% der Community drauf und das war früher nicht so!","replies":[{"poster":"Qbert","date":"2017-11-23T08:45:54.049+0000","up_votes":3,"down_votes":0,"body":"Du musst das anders sehen.\nJeder will gewinnen, der eine macht's gut der andere schlecht ... vielleicht einfach nur weil er einen schlechten Tag/ein schlechtes Game hat.\nDu kannst auch darüber meckern und wettern wie du möchtest ... nur, mach es für dich.\n\nTeilweise sind sehr dünnhäutige Menschen im Spiel unterwegs und ein simples \"hug Tower, try to not die and we will do this\" regt die Peron so auf, dass geflamet/getrollt wird.\n\nDeshalb wirklich der Rat.... hör auf zu schreiben.\nSag vllt. mal \"gj\" oder \"bot no f, easy gank\" was auch immer, reine Informationen. Sage weder deine Meinung noch versuche Spielern Tipps zu geben. Auch Tipps werden schnell als Flame deklariert \"weil der sich für etwas besseres hält\".","replies":[{"poster":"TheRealSekkonds","date":"2017-11-23T09:12:53.395+0000","up_votes":2,"down_votes":2,"body":"ich weiß das\nich schaffe es nur nicht, mich daran zu halten.. deshalb frage ich auch nach einer funktion, die das ermöglicht.\nmenüpunkt alles permanent ignorieren ;)\nes ist traurig, dass wir uns so verhalten sollen\n\nist es denn wirklich im sinne von riot allen zu raten sich gegenseitig zu muten? schwachsinn\nspielt mal nen tag lang rust, dann wisst ihr, was schlimm ist","replies":[{"poster":"eingew","date":"2017-11-23T09:46:07.263+0000","up_votes":4,"down_votes":0,"body":"Wieso sollte Riot eine Funktion einführen, die das mit der Selbstkontrolle für dich übernimmt. Wozu soll das gut sein? Reiß dich halt einfach zusammen. Kann ja wohl nicht so schwer sein, die Finger vom Chat  zu lassen.\n\nAbgesehen davon, ich bin zwar Support, habe entsprechend auch mehr Zeit auf der Lane, aber ich versuche meine Mapawareness immer für das komplette Team zu nutzen. Wenn ich den Jungler sehe, wie er über den River zur Mid gelaufen kommt, pinge ich das für die Mid. Für die Top seltener, weil ich nicht immer so weit gucke und die Gegend dort häufig beschissen gewarded ist, weil ich ja nicht bis zur Top laufen kann um dort Wards aufzustellen, aber für Mid und Bot kann ich ruhig zusammen auf die Map gucken. \n\nVersuch das auch zu machen. Du solltest immer wissen, wo dein Lanegegner ist und das dem Team entsprechend mitteilen. Und wenn du gut bist, weißt du auch, wo der gegnerische Jungle ist. Und dann feedet deine Toplane auch seltener rein ;).\n\nIch meine, du bist hier im Ranked. Hier gehts nicht darum, dass du gute Mitspieler hast, sondern darum das verdammte Spiel zu gewinnen. Wenn du dafür deinem Team die verdammten Windeln wickeln musst, dann ist das eben notwendig. Ihnen das im Chat auf die Nase zu binden hilft dir aber nicht. Das führt bloß dazu, dass das Baby unbequem wird und anfängt zu strampeln, was es schwieriger macht, die Windeln zu wechseln. Also musst du ihm, wie bereits gesagt wurde, einfach gut zu reden und alles für es machen.","replies":[]},{"poster":"Sirrkas","date":"2017-11-23T10:18:02.877+0000","up_votes":2,"down_votes":0,"body":"Ich mute so gut wie niemanden und komme damit gut zu recht. Das einzige was Riot erwartet ist, dass man sich anständig benimmt. Dazu muss man niemanden muten. Das hilft sicher einigen, aber anderen reicht es zu wissen, dass sie niemals für ihr Verhalten bestraft werden oder zu wissen, der Flamer kriegt eins auf den Deckel, wenn er sich nicht in Zukunft besser benimmt.","replies":[]}]},{"poster":"Awsane","date":"2017-11-23T10:26:39.233+0000","up_votes":2,"down_votes":1,"body":"Es ist eine Kunst komplett so zu schreiben/kommunizieren, dass der Gegenüber es emotionslos sieht\n\nAuch sowas wie \"enemy bot is pushing\" oder alternativ ein help Ping zu dem bot turret der gerade angegriffen wird kann von deinem Team als \"warum verteidigt ihr da jetzt nicht (wie doof seid ihr eigentlich)\" interpretiert werden. (und ist mir auch schon passiert dass es so aufgefasst wurde, obwohl das überhaupt nicht meine intention gewesen ist)\n\nWie der klassiker \"Da ist was grünes in der Suppe\" was ein Mann zu seiner Frau sagt, das ja auch auf sehr viele Arten interpretiert werden kann, was nun die intention dahinter ist (4 Ohren Modell).\n\nUnd so eine wirkliche Kommunikationrichtlinie dazu gibt es ja nicht welche Aussage welche Interpretation bedeuten soll. Gerade weil so wenig und so kurz geschrieben wird, wird viel zwischen den Zeilen dazuinterpretiert. \n\nWas zu dem Konflikt soll ich nun Kommunizieren oder lass ich es bleiben(weil ich nicht weiß wie mein Gegenüber es interpretiert und dann darauf reagiert, selbst bei komplett harmlosen Aussagen) führt. Was eigentlich Schade ist, da es ja ein Teamgame ist und guter informationsaustausch oft sehr hilfreich ist.\n\n> Teilweise sind sehr dünnhäutige Menschen im Spiel unterwegs und ein simples \"hug Tower, try to not die and we will do this\" regt die Peron so auf, dass geflamet/getrollt wird.\n\nhierzu will ich sagen, dass so etwas ja eigentlich auch nicht sein sollte. Ok das ist noch etwas bevormundend aber das lässt sich ja auch noch netter umformulieren. Aber wenn mir komplett die Möglichkeit genommen wird einen Gameplan abzusprechen bzw das oft als Flame gewertet wird,  finde ich sehr Schade.","replies":[{"poster":"eingew","date":"2017-11-24T08:01:19.138+0000","up_votes":1,"down_votes":0,"body":"Ich glaube du siehst das zu pessimistisch. Klar kann das alles negativ aufgenommen werden, das bedeutet aber ja nicht, dass das auch tatsächlich passiert. Und selbst wenn wird man ja noch lange nicht dafür bestraft, dass sich irgendeine Person angegriffen fühlt. Dafür muss schon ein deutlich größerer Teil der Spielerschaft die Situation ebenso bewerten.","replies":[{"poster":"Awsane","date":"2017-11-24T12:25:13.121+0000","up_votes":2,"down_votes":0,"body":"> Ich glaube du siehst das zu pessimistisch. Klar kann das alles negativ aufgenommen werden, das bedeutet aber ja nicht, dass das auch tatsächlich passiert.\n\nAlso ich habe da echt andere Erfahrung gemacht aber gut, vllt hatte ich nur Pech.\n\n> Und selbst wenn wird man ja noch lange nicht dafür bestraft\n\nEs ging mir tatsächlich nicht darum, dass man bestraft wird, sondern was die beste Vorgehensweise zum gewinnen ist. Weil wenn ich jemand unabsichtlich durch so etwas triggere senke ich meine Gewinnchancen. \n\nDaher steht quasi auf der einen Seite der Waage, mein Team kann mit der Information die ich ihnen gebe was anfangen und so steigere ich meine Gewinnchancen und auf der anderen Seite steht ich triggere mein Team dadurch sie werden tiltet und ich senke meine Gewinnchancen.\n\nUnd ich persönlich habe die Erfahrung gemacht besser nicht schreiben, gerade in Games die nicht so gut laufen, als Informationen zu geben. Also die Tilt Seite ist stärker.\n\nAlso ich habe support gespielt ne weile und bin mehrfach in Spielen hintereinander dafür beleidigt worden, dass ich den enemy Jgl gepingt habe wenn ich ihn sehe auf der Karte oder vor einem Gank warne durch ihn, seit dem lasse ich das.","replies":[]}]}]}]}]}]},{"poster":"Nordwolf87","date":"2017-11-23T09:01:25.085+0000","up_votes":4,"down_votes":0,"body":"\"Texting wont help us win\" \nIst meine lieblingszeile.\n\nAber mal im ernst, man sieht, dass su grundsätzlich eine positive einstellung hast (\"we can win this\") aber du schreibst extrem viel und das nervt auch gewaltig. \n\nIch will das nicht ausrechnen aber du hast jew mind 1/3 der spielzeit nur mit chatten verbracht.\n\nAußerdem beginnst du wenns nicht gut läuft sehr schnell zu blamen und die leute rumzukommandieren (go bot, go mid, go drake etc) das mag zwar für dich ok sein, da du denkst das dpiel zu koordinieren, aber manche stört das.\n\nAlles in allem machts wohl wie schon gesagt wurde mehr die quantität, als die qualität. Warum textest du alle nach ner CR so zu? Hast du während der CR ohne chatten so viel weniger gewonnen?","replies":[{"poster":"TheRealSekkonds","date":"2017-11-23T09:09:22.715+0000","up_votes":1,"down_votes":2,"body":"natürlich habe ich eine positive einstellung ich versuche immer zu helfen und zu gewinnen\nund ich blame auch nicht einfach\nwie gesagt die blamen mich und mir rutscht dann sowas wie 0/7 camille spampings me (5/1 im 7/20 game) raus\nich chatte nur während ich zur lane laufe ich bleibe nie stehen um zu schreiben. außerdem tippe ich blitzschnell\nja ich habe während der cr mehr verloren.","replies":[{"poster":"Nordwolf87","date":"2017-11-23T10:18:28.363+0000","up_votes":2,"down_votes":0,"body":"Die camille ist ein gutes beispiel.\n\nWo schreibst du das? \n\nIm allchat? Die gegner geht das nichts an, die habens nur leichter wenn sie wissen, dass ihr euch streitet oder wer flamed.\n\nIm teamchat? Da kanns jeder selbst lesen bzw sieht den ping span selbst, also unnötig.\n\nDu schreibst nur beim laufen aufdie lane, das ist schon mal gut. Hab ich eine zeitlang auch gemacht. Nachdem ich dadurch aber unaufmerksam im \"autorun-modus\" war, wurde ich immer wieder gecatcht (gegnerjgler machte grad die stein-dinger)...dann hab ichs gelassen. Die laufzeit nutzt man besser für die map (seh ich vl den gegnerjgler, wie stehts um die lanes) und einen \"Tab-blick\" (was sind die timer, was ist up, was bauen die gegner, wie stehts um die CS - fällt wer zurück? Könnt ich da mal roamen/ganken).","replies":[]}]}]},{"poster":"Vogeljunges","date":"2017-11-23T08:31:30.278+0000","up_votes":4,"down_votes":0,"body":"Tja, in deinem Fall macht´s dann wohl die Menge. \nUnd da du ja nicht bereit bist, dein Chatverhalten zu überdenken, trotz kurz aufeinander folgenden Strafen, wirds dann ja wohl nicht mehr lang zum Perma dauern. \nWas du schreibst ist zwar nicht krass beleidigend aber bist einfach mega nervig. Du verbringst deine Matches damit, deine Mates zu belehren und sie mit der Nase auf ihre Fehler zu drücken. \n\nIch würde deine \"andere Meinung\", wie du in der Überschrift mal ganz schnell überdenken, sonst bist du den Account bald los.","replies":[{"poster":"TheRealSekkonds","date":"2017-11-23T08:36:03.980+0000","up_votes":1,"down_votes":1,"body":"Es ist mega nervig, wenn man 5/0 hat, das team 0/10 und du bist derjenige, der beleidigt wird, weil er als einziger nicht zum drake geht(weil er weiß, dass man den teamfight verlieren wird und deshalb lieber toptower zerstörst). Deshalb fragte ich ja, warum nicht einfach Chat und pings deaktiviert werden können. Mit dem Allchat ist es ja auch möglich ;)","replies":[{"poster":"Vogeljunges","date":"2017-11-23T08:39:28.635+0000","up_votes":4,"down_votes":0,"body":"/mute all - kannste selber eingeben und schon ist das Thema durch.","replies":[{"poster":"TheRealSekkonds","date":"2017-11-23T08:41:29.070+0000","up_votes":1,"down_votes":1,"body":"falsch. Pings werden nicht berücksichtigt.","replies":[{"poster":"Vogeljunges","date":"2017-11-23T08:51:53.691+0000","up_votes":4,"down_votes":0,"body":"Ich glaube, mit Pings zugeballert werden ist durchaus zu 99% das Resultat unflätigen Verhaltens im Chat als Ausdruck der Genervtheit...\n\nErgo - nicht chatten heisst in deinem Fall keine negativen Vibes ins Team bringen mit dem Resultat dass man dich auch nicht mit Pings belästigt. \n\nWenn du jedoch selber so ein absolut unerträglicher Ping-Ping-Ping-Ping Abuser bist, dann ist dir wohl auch nicht zu helfen.","replies":[]},{"poster":"hshtagniemehrcdu","date":"2017-11-23T10:23:31.157+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TheRealSekkonds,realm=EUW,application-id=KYnfKGf0,discussion-id=YFps3mgk,comment-id=0001000000000000,timestamp=2017-11-23T08:41:29.070+0000)\n>\n> falsch. Pings werden nicht berücksichtigt.\n\n**Deine **Pings vielleicht nicht.\nWenn jemand einen auf Cpt. Obvious macht und sich permanent passiv agressiv im Chat verhält, ist es echt nicht verwunderlich, dass die Leute deine Calls ignorieren.","replies":[]},{"poster":"XxRobin WoodxX","date":"2017-11-23T09:53:00.834+0000","up_votes":2,"down_votes":0,"body":"/fullmute all \nist die einzige Möglichkeit. Dadurch werden Chat und Pings stummgeschaltet.","replies":[]},{"poster":"D4rki3","date":"2017-11-23T09:36:16.156+0000","up_votes":2,"down_votes":0,"body":"Drück mal tab man kann pings und sticker mittlerweile auch muten meine ich\nUnd so viel wie du in einem game chattestis dein ban kein wunder du stehst ja das halbe game afk rum und schreibst","replies":[]}]}]}]}]},{"poster":"Veezey","date":"2017-11-23T13:58:58.104+0000","up_votes":3,"down_votes":0,"body":"Man kann Emotes, Pings und den Chat muten. Wenn einer dich beleidigt -> mute, wenn einer spampiingt -> mute. Kann doch nicht so schwer sein. Es bringt dir absolut nichts mit Leuten zu diskutieren, die dich nur tilten wollen. Mute sie und du hast ein angenehmeres Spiel.","replies":[]},{"poster":"Sirrkas","date":"2017-11-23T10:05:30.554+0000","up_votes":3,"down_votes":0,"body":"Ich kann durchaus verstehen, dass der Bann störend ist. Mir würde das auch nicht gefallen, wenn man Jahre lang genutzter Account gesperrt wird und womöglich bald für immer futsch ist. Am besten kann ich dir wohl helfen, wenn ich dir erkläre, was zum Beispiel als störend angesehen werden kann und wie das System funktioniert. \n\n>Wenn ich dann antworte, werd ich also reportet?\n\nGemeldet vielleicht, aber bestraft wurde noch niemand fürs Antworten.\n\n>ich habe bis jetzt noch nie eine Strafe bekommen...\nVor ein paar Tagen kam dann die erste Chateinschränkung rein.\nDie war noch nicht zu ende, da kam schon die nächste.\nUnd nun kommt der 14Tage Bann.\n>\n>Ich habe mich in der Zeit genauso wie all die Jahre zuvor verhalten.\n\nEs könnte sein, dass du die letzten Jahre immer nur ganz knapp unter der Schwelle zur Strafe warst, die jetzt überschritten hast und da du genau so weiter machst, eben jetzt ständig bestraft wirst. \n\n>TheRealSekkonds: why did u die to syndra i told u\nTheRealSekkonds: i just told u\nTheRealSekkonds: y thats why i told u\nTheRealSekkonds: y and i told u\nTheRealSekkonds: shes gonna try to kill u\nTheRealSekkonds: why not go back so greedy\nTheRealSekkonds: y cuz u dont go back\n\nKlingt stark nach Blaming. Ihm einmal zu sagen, dass er bei Syndra aufpassen soll wäre mehr als ausreichend gewesen. Nach seinem Tod dann ein halbes Dutzend mal und mehr zu schreiben, dass du es ihm ja gesagt hast, ist ziemlich sicher negativ.\n\nWenn sich\n\n>Wenn in meinem Spiel einer inted.. feeded.. und scheiß treibt und ich ihn frage wieso, dann werde ich dafür gebannt?!\n\nauf den Abschnitt bezogen hat, da war kein int. Feeder in deinem Spiel. Bei der Runde gegen Syndra und Lee und dem Rengar und Jax in deinem Team, das ich auf OP.GG finden kann, sieht zumindest keiner nach einem Troll oder int. Feeder aus.\n\n>TheRealSekkonds: kid\n\nBeleidigung.\n\nIn Spiel 1 bist du oft am Blamen und auch etwas beleidigend. \n\n>TheRealSekkonds: the problem is u cry like a baby\n\nWar das wirklich angebracht? Ist nämlich negativ.\n\n\n\n>TheRealSekkonds: ur kiddy right?\nTheRealSekkonds: u could steal baron but u go soio bot\nTheRealSekkonds: thats feeding\n\nWieder beleidigend und Blaming.\n\n>TheRealSekkonds: u wont improve or learn\nTheRealSekkonds: hopeless case\nTheRealSekkonds: kiddy\n\nDazu muss ich wohl nichts mehr sagen.\n\nDu warst in Spiel 2 auch wieder negativ. Am Anfang wolltest du vielleicht noch helfen, aber später war es auf jeden Fall unangebracht.\n\n>TheRealSekkonds: atleast say miss or ward pls\nTheRealSekkonds: bot doesnt say miss\n\nDu hast auch eine Karte, die du ansehen kannst. Botlane ist nicht Schuld, wenn du Mitte besuch kriegst. \n\n>TheRealSekkonds: i bought 4 wards now\n\nBei dem Spiel mit Leona, Tahm und Camille in deinem und Fizz im gegnerischen Team, hast du nur 2 gekauft. Das war jetzt vielleicht nicht unbedingt störend, aber falsch. \n\n>TheRealSekkonds: so funny u get 7 times ganked she gets a lot of kills out of it and spampings like a kid\n\nWieder beleidigend.\n\nIn Spiel 3 warst du auch wieder oft genug neagativ hast geblamt und etwas beleidigt.\n\n>wie man unschwer erkennen kann, ist das schlimmste, was ich tat zu fragen warum jemand etwas tut, obwohl ich gesagt habe das es passieren wird.\n\nDamit stimme ich nicht überein. Du hast da nicht gefragt, warum jemand stirbt, du hast es ihm unter die Nase gerieben, das nennt man dann Blaming. Dazu hast du ziemlich oft deine Mitspieler als Kinder bezeichnet. Das nennt man Beleidigung. \n\n>Und das auch nur weil die Typen es mit Absicht machten um das Spiel zu verlieren! Ich habe in diesen Tagen mindestens 6 Mitteilungen bekommen, dass meine Reports diese Spieler bestraft hat. Sie haben mich teilweise böse beleidigt. \n\nDas stimmt auch nicht. Ich habe in den Spielen keinen einzigen Troll gesehen. Vielleicht Leute, die ein schlechtes Spiel hatten, aber nichts, was auf absichtliche Tode schließen lässt. \nOb die anderen auch gemein waren, ist unwichtig. Du hast sie gemeldet, sie wurden bestraft, dann passt das doch.  Allerdings warst du selber auch toxisch, hattest schon 2 CRs, warst weiterhin toxisch und hast deshalb einen 2 Wochenbann kassiert. Nach dem 2 Wochenbann, kannst du vielleicht schon für eine einzige negative Zeile permanent gesperrt werden. Wenn du also in 2 Wochen noch einmal einen Chatlog ablieferst, wie in einem der Spiele, war es das wohl für deinen Account. \n\n\n>Und wenn man dann antwortet, wird man bestraft? \n\nWie schon gesagt, für antworten wird niemand bestraft. Du hast aber mit deinem Chat auch oft genug gestört, um ebenfalls bestraft zu werden. Ich kann verstehen, dass du deinen Chat, im Vergleich zu den anderen, nicht als schlimm betrachtest. Aber ganz objektiv bist du auch nicht. \n\n>Hallo wenn man sich nicht wehren darf, dann erlaubt doch bitte den Chat+Pings zu DEAKTIVIEREN\n\nDas geht, durch muten. \n\n>Bitte spart euch mir zu sagen, dass ich sie ignoriert oder gemutet hätten sollte. Einige Menschen können sich nicht einfach Beleidigen lassen. Deshalb sollte man den Chat deaktivieren können. Und die provozierenden Pings gleich mit.\n\nNein, den Chat einfach deaktivieren würde die Leute bestrafen, die sich benehmen können. Wenn auf jemanden der Teil mit dem, man kann sich nicht beleidigen lassen zutrifft, sollte der vielleicht daran arbeiten. \n\n>Seid ihr der Meinung meine Strafe ist gerechtfertigt? Ich habe immer nur versucht, zu gewinnen. Ich habe niemanden grundlos beleidigt.\n\nDie Strafe empfinde ich als angemessen, da du schon 2 CRs hattest. Du hast beleidigt und es gibt keinen Grund dafür. Auch wenn du nur zurück beleidigt hast, es ist egal, wer da anfängt. Entweder du hast dich falsch verhalten oder nicht. Da gibt es kein, ja aber der andere hat angefangen.\n\n>Ich wurde böse beschimpft und habe höchstens kiddy oder so geantwortet.\nIch denke, dass ich nicht der bin, der bestraft werden sollte!\nIch habe niemals gefeedet. Niemals war ich rassistisch ich sage meinem Team immer, dass sie einen guten Job macht, wenn es denn so ist.\nAber ich sehe es nicht ein, wenn mich irgendwelche Kinder beleidigen!\nWas haltet ihr davon?\n\nMan muss nicht extrem schlimm sein, um bestraft zu werden. Man kann auch für dauerhaften negativen Chat einen Permabann erhalten. Die Rassisten würden direkt bei dem 2 Wochenbann einsteigen und hätten damit weniger Gelegenheiten sich zu bessern. Du hast aber, weil du nicht so schlimm warst, bisher alle Stufen durchlaufen. Jetzt musst du dich aber mal am Riemen reißen, sonst verlierst du deinen Account.","replies":[{"poster":"Qbert","date":"2017-11-23T10:07:33.550+0000","up_votes":1,"down_votes":0,"body":"Auch für das Antworten wirst du bestraft, wenn du dich im Ton vergreifst :)","replies":[{"poster":"Sirrkas","date":"2017-11-23T10:50:35.554+0000","up_votes":2,"down_votes":0,"body":"Flame und Blame würde ich hier von Antworten unterscheiden. Man kann ja schließlich auch antworten ohne toxisch zu sein.","replies":[{"poster":"Qbert","date":"2017-11-23T10:51:42.349+0000","up_votes":2,"down_votes":0,"body":"Wir beide tun das ... der TE scheinbar aber nicht :)\n\nEr gehört derzeit noch zur Kategorie quit pro quo","replies":[]}]}]}]},{"poster":"Abasin","date":"2017-11-23T09:34:05.071+0000","up_votes":3,"down_votes":0,"body":"Was ist leichter? Der eine passt sich den anderen an und ist compliant oder er erwartet, dass sich alle ihm unterordnen und anpassen, was man gemeinhin Diktatur nennt?\n\nGanz so harmlos, wie Du es darstellst, ist Dein Chat übrigens nicht, die schiere Länge ist auch indiskutabel. Und Du hast einen Fakt übersehen. Ab der ersten CR wirst Du sehr genau beobachtet. Bis dahin hat sich eine unterkritische Masse aufgebaut, aber der letzte Chat, der die 10er CR ausgelöst hat, der hat bei RIOT schon mal gelben Alarm ausgelöst. Ab da zählt jeder kleine Ausrutscher, die Lawine rollt. Was Du wem warum geschrieben hast, ist dabei nicht entscheidend. Wichtig ist nur, dass Du jetzt mit offenem Licht in einer ungesicherten Pulverkammer angekommen bist...\n\nWenn Du den Acc behalten willst, dann bleibt Dir nur eines: Chat nicht mehr benutzen, nicht inten, nicht afk stehen. Und nicht auf nur irgendwas einsteigen. Sonst Perma.{{sticker:poppy-wink}} {{sticker:sg-ahri-3}} {{sticker:sg-lux-2}}","replies":[]},{"poster":"BlackAjani","date":"2017-11-23T09:12:39.336+0000","up_votes":3,"down_votes":0,"body":"Mir hilft es, wenn es schlecht läuft, dass ich mich nur auf mein Gameplay schaue und wie ich jetzt noch am meisten machen kann fürs Team, am besten ohne zu sterben.","replies":[]},{"poster":"iwannadolucyliu","date":"2017-11-23T17:11:09.473+0000","up_votes":1,"down_votes":2,"body":"ich finde riot ist zu hart, fürn bissl flame sollte man kein perma bann bekommen! CR ist ja ok aber n bann für \"++++ u! u ruined my lane, never come back pls\" ist zuviel! in keinem anderen manschaftsport gibts solche \"mimosen schutz maßnahmen\" bann sollte es nur geben wenn man mutwillig das spiel sabotiert, und vielleicht auch wenn jemand nicht nur flamed sondern anfängt zu drohen wie \"i kill u in rl\" da ist dann auch ne grenze überschritten aber für ein \"++++ u\" hier oder ein \"why does riot matchmaking hate me so much that it punishes me with unskilled +++++ like u?!\" sollte man nur eine kleinen klaps auf die hand bekommen, kein tritt in den allerwertesten...\n\naber am ende des tages isses egal was der kleine sehr intelligente mann denkt (ich meine mich damit!), es zählt nur was riot denkt ;D","replies":[{"poster":"Homunculi","date":"2017-11-24T10:35:23.098+0000","up_votes":3,"down_votes":1,"body":"Ein Flamer oder jemand der massiv den Chat für unwichtige Sachen missbraucht, sabotiert ein Spiel. Die Moral des Teams ist am Boden, die Aufmerksamkeit ist nicht mehr da wo sie sein sollte.\n\nAlso ist dein gewünschter Tatbestand schon erfüllt und somit Bannwürdig :).\n\nDu nennst da was ganz nettes: \"Mannschaftssport\" LoL ist ein Teambasierendes Spiel, meistens mit völlig unbekannten Menschen. In anderen Sportarten in denen man mit einem Team antritt, kennen sich die Leute oder sollten es zumindest. Da einen Vergleich zu ziehen ist etwas hackelig.","replies":[{"poster":"iwannadolucyliu","date":"2017-11-24T11:02:59.457+0000","up_votes":1,"down_votes":4,"body":"ein flamer sabotiert nicht das spiel durch flamen, er lässt nur sein frust raus, die meisten flamer wollen nämlich gewinnen, deshalb flamen sie... und jeder kann den flamer muten, leider gibts in lol viele ++++ die das nutzen des mute buttons als zeichen der schwäche empfinden und dank mutterhenne riot games lieber öl ins feuer gießen anstatt den flamer zu muten um ihm nach dem spiel so richtig schön reporten zu können.\n\nmit sabotieren meine ich mid runterlaufen oder im all chat positionen von teammates preisgeben etc aber das ist dir sicher schon bewußt gewesen... ++++\n\ndas man sich in lol nich kennt bekräftigt mein argument nur noch mehr, was kümmerts mich wenn ein 30 jähriger no lifer dem ich nie wieder begegne mich anflamed?! nichts...","replies":[{"poster":"Homunculi","date":"2017-11-24T11:34:14.579+0000","up_votes":3,"down_votes":0,"body":">ein flamer sabotiert nicht das spiel durch flamen, er lässt nur sein frust raus, die meisten flamer wollen nämlich gewinnen, deshalb flamen sie...\n\nKann sein, kann aber auch ganz anders sein. Wenn jemand anfängt seine Teamkameraden anzugehen, erreicht er meistens das Gegenteil. Oft genug erlebt.\nAus meiner Sicht (!), ist Flaming Sabotage. Wer absichtlich andere zur Schnecke macht, nur um sich besser zu fühlen oder es nicht einmal merkt das er die Moral und die Lust zu gewinnen bei seinen Teamkameraden gen Null zupft, ist einmal zu oft vom Wickeltisch gefallen. Gerne sind dann auch die \"die so ungebdingt gewinnen wollen\", durch trollen, dumme Aktionen usw. die die das Spiel verlieren.\n\n>dank mutterhenne riot games lieber öl ins feuer gießen anstatt den flamer zu muten um ihm nach dem spiel so richtig schön reporten zu können.\n\nIch verstehe nicht ganz was da der Angriff auf RIOT soll, ich glaube weniger das bei RIOT irgendjemand da sitz und die Flamer auch noch anfeuert weiter zu machen. Ja RIOT hat den Chat eingebaut, aber die Spieler zweckentfremden ihn für allerlei Unsinn. Natürlich sind die, die dann auch noch zurück Schreiben und provozieren keinen Deut besser und gehören aber auch zur Kategorie Flamer.\n\n>mit sabotieren meine ich mid runterlaufen oder im all chat positionen von teammates preisgeben etc aber das ist dir sicher schon bewußt gewesen...\n\nManchmal resultierend auf jemanden der unbedingt gewinnen wollte und ein auch \"Next-Faker-Tactics-Genius\" macht und meint das nur er das Spiel verstanden hat und somit berechtigt ist allen anderen zu sagen wie schlecht sie doch sind.\nJa es gibt auch Individuen die sowas als Hobby betreiben oder aus anderen Gründen.\n\n>das man sich in lol nich kennt bekräftigt mein argument nur noch mehr, was kümmerts mich wenn ein 30 jähriger no lifer dem ich nie wieder begegne mich anflamed?! nichts...\n\nGeht genauso umgekehrt o_O, warum muss ich jemanden zur Sau machen den ich nicht kenne, nicht weiss was passiert ist, nicht in den Kopf schauen kann etc. und danach sehr wahrscheinlich nie wieder sehen werde.","replies":[]},{"poster":"Qbert","date":"2017-11-24T11:16:17.072+0000","up_votes":2,"down_votes":0,"body":"Ich gebe dir tlw. Recht.\nEs gibt sicher Leute, die wollen sich nur Luft machen.\nLeider gibt es aber auch genug Leute, die andere damit verletzen möchten. Und sei es nur um ihre Dominanz zu demonstrieren oder damit sie sich größer fühlen, oder da sie sich schlichtweg am Leid anderer erfreuen.\n\nUnd das kann viele Menschen schon sehr aus der Fassung bringen, sodass deren Spielvermögen schwer beeinträchtigt wird.\nMute hilft da nur bedingt, da Mute ja nur eine Reaktion ist. Präventiv zu muten halte ich persönlich für blöd, aber wer psychisch nicht soooo stark ist, sollte das wohl nutzen.","replies":[{"poster":"iwannadolucyliu","date":"2017-11-24T12:05:59.113+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=KYnfKGf0,discussion-id=YFps3mgk,comment-id=0011000100000000,timestamp=2017-11-24T11:16:17.072+0000)\n>\naber wer psychisch nicht soooo stark ist, sollte das wohl nutzen.\n\nhat nichts mit psychischer stärke zu tun, in wieviel games taktierst du mit deinem team im chat? ich in 0, in wieviel games gibts kleine flamer? in über der hälfte^^ also preemtiv muten würde mich nicht benachteiligen, jeder is natürlich anders aber ich denke mal den meisten gehts wie mir","replies":[{"poster":"Qbert","date":"2017-11-24T12:13:39.745+0000","up_votes":2,"down_votes":0,"body":"ich versuche im Chat schon einige wichtige Dinge mitzuteilen, wer Flash hat bzw. dass es kurz davor ist wieder verfügbar zu sein, wenn ich den Jungler tracken kann, tippel ich das auch mal \n\nAlso ich teile schon einiges im Chat mit\n\nLeider hast du Recht, dass es mehr Flamer als Taktiker gibt ^^","replies":[]}]}]}]}]}]}]}