{"poster":"Nahuky99","date":"2015-02-11T22:34:45.732+0000","title":"que campeón me recomiendan de 1350 PI ???","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Estaba buscando un campeón de 1350 PI, yo ya tengo a tryndamere de ese valor tambien tengo a pantheon a garen a kayle tristana y a maestro yi, a garen y tristana los conseguí gratis por si dicen q son malos, bueno volviendo a lo de antes, la mayoría q tengo son luchador y todo eso pero prefería otro, me recomiendan a alguien (no quiero a teemo) yo pensaba en fiddlesticks ¿me lo recomiendan? o algun tirador??","replies":[{"poster":"Mr Bard Times","date":"2015-02-11T22:42:06.738+0000","up_votes":1,"down_votes":0,"body":"Campeones buenos de 1350: yo te recomiendo a {{champion:4}}  si no queres otro luchador. Funciona tanto de adc como mago de ap","replies":[{"poster":"Skyllnex","date":"2015-02-12T05:07:59.382+0000","up_votes":1,"down_votes":0,"body":"Creeme, NO SIRVE de adc. Por esa mentalidad me hicieron perder muchas partidas porque el adc enemigo salio de linea 10 0","replies":[{"poster":"Mr Bard Times","date":"2015-02-12T05:12:57.019+0000","up_votes":1,"down_votes":0,"body":"Porque nunca tuvo un nautilus support que lo fedease","replies":[{"poster":"Skyllnex","date":"2015-02-13T17:07:40.767+0000","up_votes":1,"down_votes":0,"body":"O_O Sin palabras xD, por primera vez  veo funcionar a esa aberración anti meta funcionar, si le pones AD a TF los escalados de todas sus habilidades se van a la basura por que solo su W escala con AD y, ademas, su R es un tp, por lo que en bot es useless en duelos. Cualquier adc le gana sin problemas a menos que tenga un supp muy bueno.","replies":[{"poster":"Mr Bard Times","date":"2015-02-14T03:10:25.944+0000","up_votes":1,"down_votes":0,"body":"No estoy diciendo que tf sea el rey de los adc, dije que funcionaba. Tiene cosas últiles: la pasiva le da en promedio 4 de oro por minion, más que la E de ashe, tenes un stun cada 6 segundos, tenes slow, recuperas mana, la E te da hasta 30% de velocidad de ataque extra, la R la podes usar tanto por la visión verdadera (contra campeones como rengar o kha sirve) o para escapar. Una trinidad debe ser interesante.","replies":[]}]}]}]},{"poster":"Nahuky99","date":"2015-02-11T22:44:20.599+0000","up_votes":1,"down_votes":0,"body":"ya lo vi y no me gusto tanto me gusto mas udyr, pero bueno gracias por la respuesta","replies":[{"poster":"Mr Bard Times","date":"2015-02-11T22:47:24.555+0000","up_votes":1,"down_votes":0,"body":"Personalmente no me gusta udyr. Aparte de que es otro luchador y no quiero recomendarte uno. Es simple de usar por lo que no deberías esperar ni grandes complicaciones.","replies":[{"poster":"Nahuky99","date":"2015-02-11T22:50:32.913+0000","up_votes":1,"down_votes":0,"body":"a cho gath me lo recomendas??","replies":[{"poster":"Ditronic","date":"2015-02-11T22:54:33.963+0000","up_votes":1,"down_votes":0,"body":"mmmmm no se usa mucho...pero un cho bien usado rompe","replies":[{"poster":"Nahuky99","date":"2015-02-11T23:21:59.254+0000","up_votes":1,"down_votes":0,"body":"ok gracias","replies":[{"poster":"Mr Bard Times","date":"2015-02-12T02:00:24.001+0000","up_votes":1,"down_votes":0,"body":"Cho'gath esta bueno. Mete y aguanta.","replies":[]}]}]}]}]},{"poster":"Ditronic","date":"2015-02-11T22:54:59.401+0000","up_votes":1,"down_votes":0,"body":"udyr es uno de los campeones con las mecanicas mas dificiles del juego no te lo recomiendo....pero gastar 1350 no hace daño a nadie se recupera facil esa cantidad","replies":[]}]}]},{"poster":"Briell","date":"2015-02-13T23:11:16.026+0000","up_votes":1,"down_votes":0,"body":"Alistar... no hay nada mas duro que el con su ulti activada :v sino TF, xin shao, cho o jax, jax es una pesadilla en late","replies":[]},{"poster":"SS SchutzstaffeI","date":"2015-02-13T01:22:06.056+0000","up_votes":1,"down_votes":0,"body":"Por 1350 PI tienes bastantes campeones buenisimos con gran potencial, a mi en lo personal me gustan mas los campeones melé, luchadores o asesinos, pero por esa cantidad tenes a Tryndamere que tiene un late de las pelotas, un Xin Zhao que si esta bien armado es OP tanto en mid como en late, otro que no es mele pero me gusta mucho, Veigar, tiene mucho cc lo cual sirve para asegurar kills en las tf, un saludo!","replies":[]},{"poster":"Nahuky99","date":"2015-02-11T23:37:46.083+0000","up_votes":1,"down_votes":0,"body":"Listo decidí por fiddle igual gracias a todos!!!!","replies":[]},{"poster":"Einqueror","date":"2015-02-11T23:15:30.143+0000","up_votes":1,"down_votes":0,"body":"{{champion:9}} \nTe recomiendo a fiddlesticks, las mecanicas de este campeon no son tan complicadas como aparenta y tengo que admitir que es muy divertido usarlo y vamos que por 1350pi por este pedazo de champ lo vale.\nFidd es un champ con un sustain increible en jungla por lo que no sera muy dificil limpiarla con 1 {{item:1056}}  o el {{item:1039}} \n\nTu Q es un fear el cual dura muchisimo y le puedes cortar el combo a campeones como {{champion:55}}  y salvarle la vida a un aliado o tambien puedes atrapar campeones que espaen y BUKAKE!\nTu W es tu fuente de sustain y de daño a un objetivo fijo, aunque no lo parezca hace muchisimo daño y te rellena la vida! La desventaja de esta cae en que quedas suceptible a un CC que te corte la canalizacion\nTu E es un silence donde tiras 1 cuervo el cual **rebota** en los objetivos mas cercano sin priorizar campeones. Se le puede sacar mucho jugo a esta habilidad si el enemigo esta pegado a un minion u otro campeon, haciendo que el cuervo golpee hasta 2 veces cada uno. Algunos subestiman el daño de esta habilidad y les sale caro\nFinalmente tu R, para esta tienes que tener cabeza pero una buena ulti con fidd es kill seguro tanto en ganks como en TF\n\nEspero haberte ayudado saludos!","replies":[{"poster":"Nahuky99","date":"2015-02-11T23:22:33.085+0000","up_votes":1,"down_votes":0,"body":"gracias la verdad alta explicacion te lo agradesco y supongo q me voy a comprar a fiddle o a veigar no se cual pero creo q fiddle!!saludos a vos tambien!","replies":[]}]},{"poster":"Ditronic","date":"2015-02-11T22:44:05.186+0000","up_votes":1,"down_votes":0,"body":"tienes a sion, twisted fate,singed,janna,veigar,y zilean :P\n\nte recomiendo a veigar personalmente,con buen farm carreas partidas puedes llegar facil a los 1000 ap con un buen farm{{summoner:12}}","replies":[{"poster":"Nahuky99","date":"2015-02-11T22:49:26.111+0000","up_votes":1,"down_votes":0,"body":"ok grax voy a verlo","replies":[]}]}]}