{"poster":"Bunny","date":"2016-04-21T06:10:47.258+0000","title":"Unrewarding Gameplay - The Climb","subforum":"Miscellaneous","up_votes":3,"down_votes":0,"body":"So I&#039;ve been up and down the ranks this season from Silver 4 to Gold 5 to Silver 3 to Gold 4 now back to Silver 1 on the edge of Silver 2. I like playing support, it&#039;s my favourite role, but I&#039;m being pushed out of it because no matter how well I do as a support I can&#039;t win. The game is so inconsistent with who it matches you with and who it matches you against. Some days I feel like I have some great games  where they&#039;re at least pretty even and we can give it a good go. But recently most of my games have been filled with feeders. Perhaps after my glorious climb to Gold 4 as a support the system assumes I&#039;m good enough to carry my team who end up going 1/8 at 15 minutes. I&#039;m left there wondering what the hell how did I just win 14 in a row now I&#039;m losing 20 in a row. \n\nAlthough I like the system in place where it gives you a free win if you have been in that bracket before but now only receiving 14 for a win and 22  for a loss I feel to deflated to even push through again. Everyone talks about the climb but then when you have to make it several times over and over again the game isn&#039;t fun any more. \n\nTruthfully the only reason I continue to play this game even now is because of all the skins I&#039;ve bought at the peak of my excitement for the game.  It really isn&#039;t like spending money on &#039;World of Warcraft&#039; for example because you will always have the progression and you can see how much time you&#039;ve put into the game. But with League of Legends you put so much time into the game just to be knocked down over and over again.\n\nI can try to make the climb again back to Gold but what&#039;s the point if I will just go on another losing streak that&#039;s completely out of my hands. And I say it&#039;s out of my hands because I want to play support but I&#039;m forced to play other roles so at least if I&#039;m ADC/APC I have a better chance at being the guy who doesn&#039;t feed in the important roles.\n\nI know this is long and most of you probably didn&#039;t make it to the end because it&#039;s mostly my ranting and half of it doesn&#039;t make sense. But really all I want to know is, is it worth it? Have any of you experienced something like this and decided to keep going, finally reaching that rank, and was it worth it? \n\nTL;DR - Up and down the ranks, losing streaks, winning streaks, feeders, and spending to much money. Should I just bloody quit and never look back or is it worth it.","replies":[{"poster":"Erøse","date":"2016-04-21T08:34:40.137+0000","up_votes":1,"down_votes":0,"body":"Omg! I thought I was the same!\nI was silver 3 last season and I'm bronze 2 atm. I find it really hard to climb this season, I win my lane and try to help other lanes but they just do so much mistake that I actually can't help it. I suggest you get a premade instead of going solo and only go solo when you are gold+.  My highest rank is gold 3 ( another account) and honestly it's so much easier to win games in gold but really tough in bronze and silver. In gold most of the people you are playing with actually has the basic knowledge of the game like if they should go for the tower or baron and stuff like  that. Gold+ knows how to ward and warn other players that an enemy is incoming while bronze rarely wards and dragon seems like an god objective. The only bad thing I noticed in gold is that there are many afks. I understand that I am not good enough to carry all 4 players to victory, it's just so hard. Like  my last 3 ranked match (Rammus, Zed and Annie)\nThe rammus game was completely my fault since I engaged in really bad fights where my team mates were still not in position however the Zed and Annie game. I was actually doing decently well but when the enemy team was pushing my team was splitpushing (this was the annie game) For the Zed game I could have carried but they didn't listen to me, I knew the enemy was doing dragon so I told my team to come and do baron and not contest dragon since it was the enemy's 2nd dragon but they chose to contest it without me and all died. I had to defend the base and eventually die as well. Long story short, just get a premade to play with you until you are gold +","replies":[]},{"poster":"Slowdownn","date":"2016-04-21T06:17:31.802+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bunny,realm=OCE,application-id=Ntey9fRZ,discussion-id=sbkyhw97,comment-id=,timestamp=2016-04-21T06:10:47.258+0000)\n>\n> So I&amp;#039;ve been up and down the ranks this season from Silver 4 to Gold 5 to Silver 3 to Gold 4 now back to Silver 1 on the edge of Silver 2.\n> I like playing support, it&amp;#039;s my favourite role, but I&amp;#039;m being pushed out of it because no matter how well I do as a support I can&amp;#039;t win.\n> The game is so inconsistent with who it matches you with and who it matches you against. Some days I feel like I have some great games \n> where they&amp;#039;re at least pretty even and we can give it a good go. But recently most of my games have been filled with feeders. Perhaps\n> after my glorious climb to Gold 4 as a support the system assumes I&amp;#039;m good enough to carry my team who end up going 1/8 at 15 minutes. \n> I&amp;#039;m left there wondering what the hell how did I just win 14 in a row now I&amp;#039;m losing 20 in a row. \n> \n> Although I like the system in place where it gives you a free win if you have been in that bracket before but now only receiving 14 for a win and 22 \n> for a loss I feel to deflated to even push through again. Everyone talks about the climb but then when you have to make it several times over \n> and over again the game isn&amp;#039;t fun any more. \n> \n> Truthfully the only reason I continue to play this game even now is because of all the skins I&amp;#039;ve bought at the peak of my excitement for the game. \n> It really isn&amp;#039;t like spending money on &amp;#039;World of Warcraft&amp;#039; for example because you will always have the progression and you can see how much \n> time you&amp;#039;ve put into the game. But with League of Legends you put so much time into the game just to be knocked down over and over again.\n> \n> I can try to make the climb again back to Gold but what&amp;#039;s the point if I will just go on another losing streak that&amp;#039;s completely out of my hands. \n> And I say it&amp;#039;s out of my hands because I want to play support but I&amp;#039;m forced to play other roles so at least if I&amp;#039;m ADC/APC I have a better chance\n> at being the guy who doesn&amp;#039;t feed in the important roles.\n> \n> I know this is long and most of you probably didn&amp;#039;t make it to the end because it&amp;#039;s mostly my ranting and half of it doesn&amp;#039;t make sense. But\n> really all I want to know is, is it worth it? Have any of you experienced something like this and decided to keep going, finally reaching that rank, and\n>  was it worth it? \n> \n> TL;DR - Up and down the ranks, losing streaks, winning streaks, feeders, and spending to much money. Should I just bloody quit and never look back or is it worth it.\n\nGreat post! This is exactly how I feel about this game as I also play support main in bronze and silver elo. The best I have got to is silver with another account but I can't even get out of B5 with this account! I guess if you can't solo get to gold, don't put any money to this game! Play normal for fun and only be very selective when playing ranked.","replies":[]}]}