{"poster":"ChaosJuda","date":"2017-04-01T20:59:09.866+0000","title":"Vayne","subforum":"Discussioni generali","up_votes":2,"down_votes":2,"body":"Secondo voi, Vayne &egrave; un adc forte attualmente? Va rivisto qualcosa o va bene cos&igrave; com&#039;&egrave;? Per quello che &egrave; il mio parere, trovo che allo stato attuale sia un po&#039; troppo forte, complice anche un kit abbastanza sovraccarico per quello che riguarda il danno, ha molta mobility e troppi danni, soprattutto non ha bisogno di buildare chiss&agrave; quali item per fare danno, in pi&ugrave; ha anche una passiva che le aggiunge ms e l&#039;ulti che le da l&#039;invisibilit&agrave;, e il fatto che sia un adc da late non regge neanche pi&ugrave; di tanto visto che anche in early fa dei danni eccessivi. \nQuesto &egrave; il mio parere, voi cosa ne pensate?","replies":[{"poster":"Jeanne dˆArc","date":"2017-04-01T21:24:16.053+0000","up_votes":4,"down_votes":1,"body":"Ma ancora con 'sta favoletta che non ha bisogno di item per fare danno? Ma per favore, dai. Vayne ha bisogno esattamente degli stessi item degli altri ADC per fare i \"buchi\" in late, altrimenti risulterebbe poco più che un classicissimo ADC in quanto a danni. Per quanto possa odiarla come champ, non la reputo broken. È probabilmente l'ADC che più soffre la lane phase, prendendo schiaffi praticamente da chiunque. È piuttosto semplice stomparla in lane, però se poi le si dà il tempo di recuperare, beh ve la sarete cercata la sconfitta.\n\n@Edit: che li cancelli a fare i post di risposta? ^^\nIo dico le cose così come le penso, senza peli sulla lingua. Non sono un challenger, anzi, sono consapevole di essere spesso il primo dei maiali, ma cerco di essere obiettivo sui campioni e sui loro kit.","replies":[{"poster":"Don Draven","date":"2017-04-02T12:19:30.227+0000","up_votes":2,"down_votes":0,"body":"se le dai il tempo di recuperare??? ma se hanno top tahm e mid tf quando mai lo forzi il nashor anche se lei e debole??\n\n\nun late hyper carry come vayne non deve avere la possibilità di outplayare in lane,DEVE SUCARE esattamente come kog maw e sivir,sono debolissimi all'inizio.","replies":[]}]},{"poster":"DonCavallo","date":"2017-04-01T21:18:31.490+0000","up_votes":2,"down_votes":0,"body":"Personalmente credo che un ADC, per essere sano, debba avere una cosa tra un dash e un cc pesante.\nVayne ne ha \"quasi\" 2, dato che ha la capriola E la spell sul muro. Ma nonostante ciò e i suoi danni non è che faccia i buchi più di tanto in questo momento. Io credo non debbano proprio toccarla.","replies":[{"poster":"Ardens33","date":"2017-04-01T23:28:45.478+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DonCavallo,realm=EUW,application-id=MJVj50Jw,discussion-id=GXVv8sJ3,comment-id=0001,timestamp=2017-04-01T21:18:31.490+0000)\n>\n> Personalmente credo che un ADC, per essere sano, debba avere una cosa tra un dash e un cc pesante.\n> Vayne ne ha &quot;quasi&quot; 2, dato che ha la capriola E la spell sul muro. Ma nonostante ciò e i suoi danni non è che faccia i buchi più di tanto in questo momento. Io credo non debbano proprio toccarla.\n\nla capriola di vayne è n escape molto debole e lo stun beh...","replies":[{"poster":"Don Draven","date":"2017-04-02T12:20:31.925+0000","up_votes":1,"down_votes":0,"body":"scherzi spero,un invisibilità che non può esser svelata manco dal true sight.","replies":[]}]}]},{"poster":"Master Caos98","date":"2017-04-02T12:53:45.726+0000","up_votes":2,"down_votes":1,"body":"Vayne va nerfata,cavolo in late game io ho 4000 hp con 250 di armor e mi fa 2500 true dmg e 1500 danni fisici,ma scherziamo?\nIn early non è poi cosi messa male come si dice,3 autoattacchi e ti leva 300 hp,ha troppa moblità,invisibilità e non puoi manco prenderla.","replies":[]},{"poster":"VeSpaccoTutti","date":"2017-04-03T06:13:26.092+0000","up_votes":1,"down_votes":0,"body":"Quindi come mi dovrei comportare con vayne ? Ho intenzione di mainarla","replies":[]},{"poster":"Dodop","date":"2017-04-02T10:39:27.516+0000","up_votes":1,"down_votes":0,"body":"Concordo con gli altri, Vayne allo stato attuale è a metà tra il top tier e il tear peggiore, infatti il suo win rate si aggira intorno al 50%. Era molto OP nel tank meta, quello della preseason con il Colossous broken. È probabilmente l'ADC più forte contro i tank anche grazie al true damage e se arriva in late con un po' di vantaggio fa i buchi. La cosa negativa è che soffre tantissimo in laning phase e se in mid game è in svantaggio (anche di poco) viene distrutta dalla maggior parte degli altri ADC.\n\nE comunque non ha proprio molta mobility, ha solo la Q che è un mezzo dash e la E che non è un CC diretto, certo più di alcuni ADC ma non esagerata.","replies":[]},{"poster":"Ringiel","date":"2017-04-01T21:00:25.157+0000","up_votes":1,"down_votes":0,"body":"nel meta attuale è meh,se torna un meta tankoso con il rework dei tank sarà op","replies":[{"poster":"Ardens33","date":"2017-04-01T21:15:22.587+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ringiel,realm=EUW,application-id=MJVj50Jw,discussion-id=GXVv8sJ3,comment-id=0000,timestamp=2017-04-01T21:00:25.157+0000)\n>\n> nel meta attuale è meh,se torna un meta tankoso con il rework dei tank sarà op\n\nvayne è anche un buon anti-assasin, e contro gli squishy si usa la build crit/one shot, io mi rovo bene ad ora","replies":[]}]}]}