{"poster":"jackisgreen","date":"2016-02-11T04:24:12.358+0000","title":"LeaverBusters","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"I have been punished twice previously for afking during games and have subsequently received leaverbusters punishments. For these actions I assume full responsibility.\r\nHowever, I recently disconnected throughout a game periodically and as a consequence received a leaversbuster punishment again, this time for 20 minutes per game, for a total of 5 games. This punishment is significantly too much, and given that I was merely disconnecting, and not going afk, as can be referenced by my periodic &quot;player has reconnected&quot; - I was wondering how I could get this punishment revoked.","replies":[{"poster":"Ninox","date":"2016-02-11T05:14:15.215+0000","up_votes":1,"down_votes":0,"body":"Unfortunately, even if the disconnect is unintentional, you've still affected the game for the other players, and thus will still receive punishments whether you are intentionally dcing/afking or not. The punishment will not be revoked either,\n\nYou can find out more about the system [HERE on the FAQ](https://support.riotgames.com/hc/en-us/articles/201752714-LeaverBuster-FAQ#h2q1)","replies":[{"poster":"Laksid","date":"2018-05-13T11:01:23.278+0000","up_votes":1,"down_votes":0,"body":"Hello Seras, \n\nI am in a similar situation, and I am assuming full responsibility for leaving any game. The issue is that I have been playing for 5+ years, but took a 1 year break. I have recently resumed playing for about a month, well over 20 games with no afks. \nYesterday I had connectivity issues at the start of a game, unstable ping. I told my team that I was unable to continue and afkd at start allowing them to remake. I now return and have a 20min / 5 game queue. Will this ever reset to the 5game/5min or will I have 5g/20min for eternity? \n\nIf it decays over time/games played, how can I find out what my leaverbuster level is? \n\nBelow is all the info on this from the faq:\n\n\"HOW LONG WILL I REMAIN IN THE LOW PRIORITY QUEUE?\nYou will be placed in the low priority queue for 5 games. If you continuously leave, the low priority queue timers increase from 5 minutes per game to 10 minutes per game and then capping out at 20 minutes per game.\"","replies":[]}]}]}