{"poster":"Omnem Occido","date":"2015-12-01T14:56:58.337+0000","title":"Assassin Masteries: Why Thunderlord's Decree is better than Deathfire Touch.","subforum":"Gameplay","up_votes":4,"down_votes":1,"body":"This is strictly an assassin mastery. It is absolutely gorgeous on champions that have multiple instances of damage on spells (LeBlanc&#039;s Sigil of Malice, for example), as it proc&#039;s on each moment of damage for these spells. In the case of LeBlanc, she can do her simple Q+W combo, and proc it, providing a beautiful damage boost no matter the level. It is an excellent trade tool for assassins, as well as a boon to their burst damage output.\r\nNow, as to what you are missing by going for this keystone: as you can have a 12/18/0 versus an 18/12/0, the only masteries you are missing out on are the last two tiers of the Ferocity Tree. As an AP Assassin, like LeBlanc, you would invest your Magic Penetration into Piercing Thoughts. Now, if you are up against a champion that likes Magic Resist, like Galio, this is probably a better move, as the higher Magic Resist means that you are ignoring more due to the percent ignore. However, for most carry champions, your primary targets as an assassin, you will more than likely not go up against anyone with more than the base 30 Magic Resist, or with flat Magic Resist glyphs to put them up to 42 Magic Resist maximum. Now, the max percent Magic Penetration off of Piercing Thoughts is 7%, so, when you take into consideration the enemy&#039;s Magic Resist, that is 2.1 Magic Penetration for 30 Magic Resist and 2.94 for 42 Magic Resist.\r\nCompare these numbers to the Cunning Mastery Precision. At full mastery rank, at champion level 1, this mastery provides 3.3 Magic Penetration regardless of the enemy&#039;s Magic Resist, and at level 18, this total reaches a total of 8.4 Magic Penetration, a total that the enemy would need to have 120 Magic Resist for Piercing Thoughts to equal. Therefore, unless you are fighting a team of tanks and bruisers that build 50+ Magic Resist per champion, Precision is always going to outstrip Piercing Thoughts in Magic Penetration.\r\nThis doesn&#039;t even include the ever-so-useful Armor Penetration that you get from Precision on top of the Magic Penetration. As with Piercing Thoughts, Battering Blows is a percent defense penetration, except that it is for Armor. Now, most carry champions start with around 20-25 Armor, which increases to 29-34 with flat Armor seals. With Battering Blows, which are 7% at max rank, this translates into 1.4-1.75 Armor Penetration for Armor within the 20-25 Armor range and 2.03 to 2.38 within the 29-34 Armor.\r\nAgain, compare these numbers to the Cunning Mastery Precision, which have the same numbers for the Armor Penetration as they do for the Magic Penetration. Again, unless you are fighting a team of tanks and bruisers that build 50+ Armor per champion, Precision will always outstrip Battering Blows in Armor Penetration. Thus, for an Assassin, regardless of damage type, and especially for hybrid assassins, Precision is far and away a better mastery.\r\nNot only does Precision outclass the individual Ferocity counterparts in their respective defense penetration, it also is better than them combined. So, the next logical comparison after this is the Keystone abilities. Thunderlord&#039;s Decree deals (10*Champion Level)(+20% Bonus AD)(+10% AP) once every 30 seconds. Now compare this to Deathfire Touch, which deals 6(+50% Bonus AD)(+20% AP) over 3 seconds for single target spells, or 3(+25% Bonus AD)(+10% AP) over 1.5 seconds for AoE and DOT spells. The question you need to ask yourself as a player of an assassin is: do I want to deal large amounts of damage now, or over a period of time. Well, as an assassin, more damage now is the name of the game. \r\nAn even better question, however, is when in the game do you want to deal the most damage? For mage champions like Morgana, or Brand, you are building for a strong mid to late game, but when you are Talon, Zed, or LeBlanc, you want to have your strongest moments early. This is where Thunderlord&#039;s Decree outstrips Deathfire Touch. Let&#039;s say you just hit level 6, got your ultimate, and haven&#039;t backed as LeBlanc. You probably have around 20-30 AP based on your runes. With Deathfire touch, you don&#039;t deal too much damage, as you haven&#039;t had the chance to really build AP yet, probably dealing around 6-10 damage over 3 seconds with your Q, 3-5 damage with your W. On the other hand, with your simple Q+W combo, Thunderlord&#039;s Decree deals a whopping 60-64 damage before you even back. In fact, if you can land three basics for poke over a max of 15 seconds, you can also proc it off of that alone (not as effective, but far safer). To deal this amount of damage with Deathfire Touch with the same stats, you would have to hit that enemy a minimum of 6 up to 10 times (based on AP from runes) times over a span over the next 30 seconds with a single target spell, or once every 5 to 3 seconds. Not only would that be far less effective as an assassin, it would require you to waste resources and place you in a position where you are constantly spamming spells at a regular interval, and landing said spells. Thus, in every way imaginable, Thunderlord&#039;s Decree is better than Deathfire Touch for Assassins.\r\nMaximizing your masteries is the difference between winning and losing a game. With optimized masteries that fit your champion and playstyle, you boost your ability to win situations, which further allows you to win games. By choosing a mastery tree of 12/18/0 as an assassin, you optimize your damage output and your ability to win fights over someone who chose 18/12/0. For champions who snowball, this is a make or break stat that changes the outcome of games.","replies":[{"poster":"IronwallJackson","date":"2015-12-01T15:11:27.894+0000","up_votes":4,"down_votes":1,"body":"I thought that this well already well-known.\n\nDfT's damage is kind of so-so and works best with champions who can space out their damage, which is something burst champions don't do at all. They receive only a portion of the capstone's potential damage, which TlD gives them damage up front.\n\nI feel like you just told me \"{{item:3087}}  is a carry item.\"","replies":[{"poster":"Omnem Occido","date":"2015-12-01T15:15:25.115+0000","up_votes":4,"down_votes":0,"body":"The amount of builds I have seen people use DfT on a Zed... well, it's not a pretty sight when you have a Platinum ELO player using that in their build...","replies":[{"poster":"YuGiHo","date":"2015-12-01T15:33:39.386+0000","up_votes":1,"down_votes":0,"body":"that may just be because dft favors single target ad spells like zed ult and thunder lord is hard to trigger on zed unless you ult and if you just want the mastery that favors your ult dft may be the better choice since it would also trigger on any of your poke not just a 3 hit combo.","replies":[{"poster":"VasilisGreen","date":"2015-12-01T15:56:42.094+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=YuGiHo,realm=NA,application-id=3ErqAdtq,discussion-id=8IYRBiZF,comment-id=000000000001,timestamp=2015-12-01T15:33:39.386+0000)\n>\n> that may just be because dft favors single target ad spells like zed ult and thunder lord is hard to trigger on zed unless you ult and if you just want the mastery that favors your ult dft may be the better choice since it would also trigger on any of your poke not just a 3 hit combo.\n\nDecree is hard to proc on zed??? What?? Do you even Zed bro??? Decree is by far better that touch on zed and every other assassin... You need burst, it is on a 20 second cooldown and you can proc it on pretty much every shadow combo, boosting your poke significantly. Even in late game, it has a base value of 180. touch has base 6. So, building full AD, having let's say, 400 bonus AD, you will only proc 100 damage with Q and E and the timer will just reset on that, it doesn't stack damage. So, if you hit every spel you will do 2  seconds of damage? that's how much, 150 damage and 6 base. that's 156. Decree has 180 base. And it scales with 20% Bonus AD. That is 80 more. Next patch it will scale with 30% bonus AD. So, Let's do some math. we have 400 bonus AD. In order to do 200 damage from the scale we need to hit 1 q now and one more spell after 1.5 seconds. So, you do W-E and Q after 1.5 sec. The 2 Qs will hit to fast one after the other and that will only refresh the mastery without adding any more damage. S, then you do 212  damage. Now, with decree, You just need to do W-E and hit the 2 Qs and then you will do 180+80=260  damage. That is a lot more... To match that damage, you need to Ult, land spells and proc the Touch from the ult after the the timers from earlier spells are done. Unless they have Qss, then the ult won't trigger and the only damage done from the touch will be the minor one from the other spells that will hit too fast to actualy do a noticeable amount of damage. Also, note that with the armor pen from precision and with youmu's and 19 pen in runes you will do very much damage with your own spells, a lot more than what you would do if you went for battering blows. Both the mastery itself and the tree path is better for zed and with the items as they are now, the more flat pen you have, the better your damage output will be.\n\nAlso, You can proc the Decree with your ult as well. Just ult and W-Q for damage and walk away, when the mark pops, the decree will proc with it.","replies":[{"poster":"Meep Man","date":"2015-12-01T17:44:07.422+0000","up_votes":2,"down_votes":0,"body":"To simplify, TLD is easy to proc on Zed.","replies":[{"poster":"VasilisGreen","date":"2015-12-01T19:16:00.704+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Inept Maverick,realm=NA,application-id=3ErqAdtq,discussion-id=8IYRBiZF,comment-id=00000000000100000000,timestamp=2015-12-01T17:44:07.422+0000)\n>\n> To simplify, TLD is easy to proc on Zed.\n\nWhat are you doing???? You ruin all my efforts with that simplification!!! Y U DO DIS? You hate me, how can you hurt me this way????\nI put so much effort in explaining how much better the Decree is on zed than dft. \nI am in great pain now :'(\n\n{{sticker:zombie-nunu-tears}}","replies":[]}]}]}]},{"poster":"IronwallJackson","date":"2015-12-01T15:31:03.849+0000","up_votes":1,"down_votes":0,"body":"Fair point. I suppose there are a lot of players who tunnel vision on what was traditionally the offensive tree and largely disregard the other two tree's potential.","replies":[]}]}]},{"poster":"Ionian","date":"2015-12-01T15:40:14.317+0000","up_votes":3,"down_votes":1,"body":"{{sticker:zombie-brand-facepalm}} Every time I see a burst mage using DFT.","replies":[{"poster":"VasilisGreen","date":"2015-12-01T15:57:40.992+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=If Ahri Was Real,realm=EUW,application-id=3ErqAdtq,discussion-id=8IYRBiZF,comment-id=0001,timestamp=2015-12-01T15:40:14.317+0000)\n>\n> {{sticker:zombie-brand-facepalm}} Every time I see a burst mage using DFT.\n\nikr\n{{sticker:slayer-jinx-unamused}}","replies":[]}]},{"poster":"Omnem Occido","date":"2015-12-02T01:18:31.924+0000","up_votes":1,"down_votes":0,"body":"Now, to be certain, on a champion like Urgot, DfT is disgusting (holy hell the damage on his e...).","replies":[]},{"poster":"YuGiHo","date":"2015-12-01T15:40:42.898+0000","up_votes":1,"down_votes":0,"body":"While Thunderlord's Decree is great on assassins sometimes Stormraiders Surge may benefit you more than some extra damage. i like it on fizz and talon.","replies":[{"poster":"MetaCosmos","date":"2015-12-01T15:45:12.418+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=YuGiHo,realm=NA,application-id=3ErqAdtq,discussion-id=8IYRBiZF,comment-id=0002,timestamp=2015-12-01T15:40:42.898+0000)\n>\n> While Thunderlord's Decree is great on assassins sometimes Stormraiders Surge may benefit you more than some extra damage. i like it on fizz and talon.\n\nthe only effective use of stormraiders I've seen was on nasus and it was fucking disgusting","replies":[{"poster":"elon wątroba","date":"2015-12-01T18:53:04.654+0000","up_votes":1,"down_votes":0,"body":"i've seen it used on ad wukong. It was funny too.","replies":[]},{"poster":"VasilisGreen","date":"2015-12-01T15:59:17.352+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MetaCosmos,realm=NA,application-id=3ErqAdtq,discussion-id=8IYRBiZF,comment-id=00020000,timestamp=2015-12-01T15:45:12.418+0000)\n>\n> the only effective use of stormraiders I've seen was on nasus and it was fucking disgusting\n\nWhen you try to run from nasus and he lands a Q and gets the surge ms boost... \n_\"Bitch i don't even need to slow you\"_ :D  \n      _Nasus preseason 2015_","replies":[{"poster":"Ionian","date":"2015-12-01T16:04:31.101+0000","up_votes":1,"down_votes":0,"body":"Talon also uses it well, for example.","replies":[{"poster":"VasilisGreen","date":"2015-12-01T16:07:12.755+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=If Ahri Was Real,realm=EUW,application-id=3ErqAdtq,discussion-id=8IYRBiZF,comment-id=0002000000000000,timestamp=2015-12-01T16:04:31.101+0000)\n>\n> Talon also uses it well, for example.\n\nImo, that mastery was made for him. Tho his burst can be ultra high with decree.","replies":[]}]}]},{"poster":"Abyssphere","date":"2015-12-01T16:04:21.224+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MetaCosmos,realm=NA,application-id=3ErqAdtq,discussion-id=8IYRBiZF,comment-id=00020000,timestamp=2015-12-01T15:45:12.418+0000)\n>\n> the only effective use of stormraiders I've seen was on nasus and it was fucking disgusting\n\nI think it's a pretty niche mastery. I like the sound of it on people like Talon who need help escaping after they've done their combo and people like Evelynn who are at risk of being kited after their initial burst is done.","replies":[]}]}]},{"poster":"Restless Slumber","date":"2015-12-01T17:03:40.705+0000","up_votes":1,"down_votes":0,"body":"100% agree with this statement. Swapped to thunderlords recently on Elise and can 1 shot adcs consistently after 2 items. DFT overall is useless unless used with a DOT champ.","replies":[]},{"poster":"Ryùuzaki","date":"2015-12-01T16:01:05.781+0000","up_votes":1,"down_votes":0,"body":"i'm pretty sure zed will be able to kill every single midlaner once he hits lvl 6 even if they were full\ncuz of the new buffs on his early ult dmg and ofc this mastery is just perfect on him","replies":[]}]}