{"poster":"GrReaper96","date":"2017-01-29T01:58:05.867+0000","title":"Kindred Changes","subforum":"Gameplay","up_votes":3,"down_votes":1,"body":"Kindred is currently what we would call to be &quot;azir-ed&quot; or &quot;kalista-ed&quot;. Meaning she gets a rather obnoxious kits, gets nerfed to the ground, and then the meta shifts making her even worse. I really like Kindred, by far one of the most amazing lores in LoL and hate seeing her in the dumpsters. So i came up with some change ideas that might help her get on her feet (or hooves) again.\n\n---\n\n>**Passive: Mark of the Kindred**\n\nFollow Chogaths footsteps. Make early stacks give more but later stacks give less.\n\nStack 1-6 : 1.5% current hp\nStack 7-10 : 1% current hp\nStack 11+ : 0.5% current hp\n\nMeaning she would get slightly higher % current hp early game, around the same at 10 stacks, which is usually around mid-late game, and less after. This would help her currently horrid early game in exchange for  slightly reduced damage on her late game.\n\nAlternatively, make her stacks grant % max health damage instead and lower the damage (VERY risky change here)\n\nStack 1-6 : 1% max hp\nStack 7-10 : 0.5% max hp\nStack 11+ : 0.25% max hp\n\nSo at 10 stacks she gets 9% max hp on-hit compared to 13% current hp on-hit (12.5% current hp live). Once again rather risky change and would need some testing.\n\n>**Q : Dance of Arrows**\n\nRemove the 5 damage per stack. Honestly most of the time you barely feel that extra damage. Instead, make it deal 1/3 of her passive damage. Since it fires 3 arrows its kinda self-explanatory why it should deal 1/3 her passive. At 10 stacks live that would be around 4% current hp every 2 seconds, which is a reasonable amount since Botrk give like 8% current hp every second or so ( with Runaans to 3 targets too!).\n\n>** W : Wolf&#039;s Frenzy**\n\nRemove the as slow and return the heal . It was one of her signature identities and replacing it just made feel like she was copying Shaco. And with how hard the jungle is now she needs all the help she can get. One problem that did arise was how she could easily heal in lane. Hence, make it so that she heals only half the amount when attacking minions.\n\n>**E : Mounting Dread**\n\nAll i can say is either leave this skill alone or change it completely. It is by far the most stale and linear thing of her kit, barely reflecting any part of her identity. I would happily see it go in return for a more interactive and interesting skill, something more &quot;wolfy&quot;.\n\n>**R: Lambs Respite**\n\nIn a pretty good state right now. A thought i had was to make it heal Kindred only an extra (3/4/5 X stacks count)%. Meaning at max rank with 10 stacks Kindred would heal an extra 50% of the 300 heal (150 health). Just a small change to make her ult more interesting. Its actually fine the way it is now.\n\n---\n\nI&#039;m not suggesting ALL these changes to be implemented, perhaps a little pick-and-mix. I really really LOVE Kindred lore and would hate to see her lost and forgotten by time. Kindred is a very unique and special champion, and deserves some love and attention.","replies":[{"poster":"Spârky","date":"2017-01-29T02:15:19.225+0000","up_votes":1,"down_votes":0,"body":"Ok with the W on kindred. Dont bring back the heal. Her kit is supposed to make you kite monsters which is so easy with the m/s and a/s slow on her w. The reason they got rid of it was because if made her to healthy so nobody could fight her early game.","replies":[{"poster":"GrReaper96","date":"2017-01-29T02:47:54.803+0000","up_votes":1,"down_votes":0,"body":"Well perhaps lower the heal but even with the heal back then she still needed to kite monsters. And with the new more deadly jug changes its even harder for her to do so.","replies":[{"poster":"Spârky","date":"2017-01-29T04:53:05.874+0000","up_votes":1,"down_votes":0,"body":"I see where your coming from i love kindred but the heal just makes her to healthy so nobody can fight her at early levels.","replies":[{"poster":"GrReaper96","date":"2017-01-29T04:55:33.653+0000","up_votes":1,"down_votes":0,"body":"Yeah i also stated half the heal from minions so she cant abuse it in lane for free heals","replies":[{"poster":"Aptest","date":"2017-01-29T04:59:39.967+0000","up_votes":1,"down_votes":0,"body":"he means nobody could fight her IN THE JUNGLE.\n\ni am not certain if my memory is correct, but kindred used to basically mark enemy jungler at beginning of the game and simply go jungler his camps instead of hers...\n\n...and if he comes just kill him.\n\n<>\n\nIn any case, I expect kindred to be able to 1v1 any of the jungle assassins. I'm ok with her not being able to 1v1 any other jugnler but I want her to be able to 1v1 khazix, and i want her to be able to 1v1 rengar at any point in the game. ","replies":[{"poster":"Mewthree","date":"2017-01-31T16:56:37.776+0000","up_votes":1,"down_votes":0,"body":"actually. the heal was impressive in that it meant she could do every role. period. ever.","replies":[{"poster":"Mewthree","date":"2017-01-31T16:58:28.571+0000","up_votes":1,"down_votes":0,"body":"that being said. we need SOME kind of sustain. every jungler has some way to keep jungling. kiting is not an efficient way to jungle, you end up going out of range far too easy and then that monster gains life FAST what are we to do with that? lol","replies":[{"poster":"Aptest","date":"2017-01-31T17:06:28.441+0000","up_votes":1,"down_votes":0,"body":"> we need SOME kind of sustain\n\nno. The amount of sustain you need for jungling is 0.\nactually this is true for ALL junglers, not just kindred.\nbasically you should lose hp on camps, no gain it.\nthe jungler's way to keep jungling should be to click B and heal in base.  that way there's a lot of gameplay around jungler's downtime if you can figure out when it's gonna be.","replies":[{"poster":"Mewthree","date":"2017-01-31T17:10:04.800+0000","up_votes":2,"down_votes":0,"body":"i mean yea....but no. not when khazix can clear the jungle and be at full life at 4, not to mention, kindreds base stats are pretty terrible in the early game without marks. so yea, she does need some kind of sustain so she doesnt have to go to base at 2, then at 4, while kha and rengar and voli and udyr and shaco are already a kill in and now jungling your camps and taking marks","replies":[{"poster":"Aptest","date":"2017-01-31T17:16:51.032+0000","up_votes":1,"down_votes":0,"body":"well i guess removing sustain from rengar khazix lee and every other jungler is a bit too much. \n\nok so how about this:\nsustain is through reaching 100 on a bar that can only be built attacking jungle camps. \nthe bar depletes fast if you're not attacking a camp (i.e. you cant build it on one camp and then go proc the mark in a fight)?","replies":[{"poster":"Mewthree","date":"2017-02-06T16:37:46.338+0000","up_votes":1,"down_votes":0,"body":"i like this idea. i have to say that i was wrong though and its not really needed, it would be really nice to have so that dueling isnt as hard as it is early game, but a far a jungling, the passive change from a heal to major slow and decrease in attack speed on jungle camp i highly effective in being able to kite monsters and take almost no damage. with that being said, i think the w slow that we got should in some way effect other players, maybe not as hard, but some kind of effect.","replies":[{"poster":"Aptest","date":"2017-02-06T17:06:32.139+0000","up_votes":1,"down_votes":0,"body":"while this chimes in with kindred's theme as a \"territorial\" champion that is strong specifically inside W, i see this as a fairly irritating addition, combined with kindred's already over-the-top mobility inside w. \n\notoh I think kindred lacks CC, and I would rather if she had a smidgen more.","replies":[{"poster":"Mewthree","date":"2017-02-09T13:28:51.849+0000","up_votes":1,"down_votes":0,"body":"update: been playing her heavy lately and no longer need heal, BORK combined with blue smite is all the cc you need. (in addition to her kit) combined with keystone that allow you serious movement for 2 second if you do enough damage (30%) of total in a few second. means i'm out dueling champion like ww simply because he cant touch me. DIFFICULT THO AND TAKES SERIOUS CONCENTRATION","replies":[]}]}]}]},{"poster":"Mewthree","date":"2017-01-31T17:17:05.556+0000","up_votes":1,"down_votes":0,"body":"just read patch notes, didnt realize we got a maim on monsters, i guess that changes things. i guess you just have to be good at kiting, which to be honest im not fuckkk hhaha","replies":[{"poster":"Aptest","date":"2017-01-31T17:30:27.126+0000","up_votes":1,"down_votes":0,"body":"well. \ni tried kindred on bot games a couple times.\ndidn't actually lose any relevant hp doing camps.","replies":[]}]}]}]}]},{"poster":"Aptest","date":"2017-01-31T17:04:19.286+0000","up_votes":1,"down_votes":0,"body":"trying to harass her on bottom lane felt like bullshit. auto-cast on a big heal twice per wave. Yey your mana gone.","replies":[{"poster":"Mewthree","date":"2017-01-31T17:07:04.278+0000","up_votes":1,"down_votes":0,"body":"yea. she was amazing top lane as well, especially when you could grab marks from jungle get that g and exp, and return to lane near full life. im not saying, give it all back. but we need some kind of sustain. return it but only on aa at mobs?","replies":[]}]}]}]}]}]}]}]},{"poster":"AgeOfTheMage","date":"2017-01-31T17:02:39.378+0000","up_votes":1,"down_votes":0,"body":"personally, i think kindreds abilities are fine, same for the passive. My only problem(when I play them) is base stats, they're too  slow for my liking, not saying they don't need buffs, just saying I love playing them right now and i'd rather not have riot overbuff them","replies":[]},{"poster":"reaperteaser","date":"2017-01-29T03:02:01.661+0000","up_votes":1,"down_votes":0,"body":"i like the idea withthe passive, lets her keep up with whats meta right now, but the rest of her kit is just fine ehere its at imo","replies":[{"poster":"GrReaper96","date":"2017-01-29T03:52:32.579+0000","up_votes":1,"down_votes":0,"body":"Well she is proven to be a bit weak now so a little help wouldnt hurt.","replies":[]}]}]}