{"poster":"Frasus","date":"2015-11-15T20:26:50.816+0000","title":"Graves y la cota de espinas","subforum":"Charlas Generales","up_votes":10,"down_votes":0,"body":"Hola, estaba en una ranked jugando con {{champion:89}}  teniendo equipada la {{item:3075}} notando que {{champion:104}} pareciera no recibir da&ntilde;o, picado por la curiosidad decido ir con mi hermano a una custom donde era {{champion:89}}  solo con {{item:3075}} contra {{champion:104}} solo con velocidad de ataque. El resultado fue extra&ntilde;o, no importara a la distancia que estuviera {{champion:104}} yo reflejaba el mismo da&ntilde;o de la {{item:3075}}, obviamente a melle el {{champion:104}} metia mas da&ntilde;o, pero yo segu&iacute;a reflejando exactamente el mismo, lo mas probable es que sea un bug donde la cota no toma en cuenta mas un perdig&oacute;n pero agradezco cualquier explicaci&oacute;n razonable.","replies":[{"poster":"Nombre ofensivo","date":"2015-11-15T20:44:30.698+0000","up_votes":2,"down_votes":0,"body":"lo mas probable es que el juego asuma como efecto de impacto (no como basico) a la pasiva de graves, y la cota de espinas solo es con basicos","replies":[{"poster":"Frasus","date":"2015-11-16T15:34:41.889+0000","up_votes":2,"down_votes":0,"body":"Aunque sea área de impacto debe reflejarla porque eso sigue siendo su ataque básico.","replies":[]},{"poster":"Rohaerlynn","date":"2015-11-16T00:00:17.566+0000","up_votes":1,"down_votes":0,"body":"es al revez, el juego no considera los perdigones como efecto de impacto, si fuera como vos decis ezreal tampoco deberia recibir daño de cota de espinas cuando golpea a su usuario con su Q, pero si lo recibe.","replies":[]}]},{"poster":"Mader","date":"2015-11-17T01:19:28.989+0000","up_votes":1,"down_votes":0,"body":"Yo hice la prueba con el, a max distancia le hacia 42 y la cota me devolvía 32, a mele le hacia 76 pero la cota seguía haciéndome 32, no importaba la distancia la cota me hacia el mismo daño por golpe aunque el daño del básico aumentara.","replies":[]},{"poster":"Fenrito","date":"2015-11-16T02:33:26.736+0000","up_votes":1,"down_votes":0,"body":"El AA de graves ahora sale de la pasiva, seguro que devuelve el daño original y no el aumentado o disminuido por la distancia de graves. Le metieron muchos cambios al champ que de seguro alguno se rompio para variar","replies":[]},{"poster":"Desaroll","date":"2015-11-15T20:32:31.707+0000","up_votes":1,"down_votes":0,"body":"Sería interesante ver cuanto daño le devuelves, y hacer la cuenta de si le devuelve lo de 1 perdigón o lo de todos los perdigones.\n\nDe cualquier manera, es algo que debería mirarse.\n\nSuerte!","replies":[]}]}