{"poster":"0x67 0x61 0x79","date":"2015-02-28T14:56:29.279+0000","title":"Sollte E-Sports anerkannt werden ?","subforum":"Allgemeiner Chat","up_votes":5,"down_votes":1,"body":"Hallo liebe Community,\r\n\r\nseit nun schon mehreren Jahren existieren Spiele mit einem stark wettkampforientierten Hintergrund, um einige Beispiele zu nennen Counter Strike: Global Offensive, League of Legends, Dota2 ... etc. , mit dem Erfolg dieser Spiele kam auch der Wunsch der Community sich mit anderen auf Turnieren zu messen.\r\n\r\nAls bestes Beispiel fungiert hier League of Legends, Season 1 ( 2011) fand damals auf der DreamHack (Lan-Veranstaltung) statt, das Preisgeld lag bei knapp **100.000 €** und die Zuschauermenge war noch relativ übersichtlich. Doch je weiter wir in der Zeit voran schreiten desto größer werden die Zahlen, Season 3 fand nicht mehr als kleines \"*Eventchen*\" statt sondern wurde im Los Angeles Staples Center abgehalten, auch die Preisgelder sind enorm angestiegen, von nicht einmal 100.000 € auf knapp **2 Millionen Dollar** im Jahr 2013. Auch die Begeisterung der Menschen wurde immer größer,  2013 verfolgten knapp 32 Millionen Zuschauer die Weltmeisterschaft !. Doch wir sind noch nicht am Ultimatum angekommen, vor knapp vier Monaten fand die Weltmeisterschaft der 4. Season statt und diesmal in einem ehem. Fußballstadion in Seoul. Ich hoffe diese kleine Zeitreise in der Historie von League of Legends lässt Anlass zum nachdenken über die Zukunft. E-Sports ist keine kleine \"*Randsportart*\" mehr sondern eine in schon vielen Ländern unterstütze Bewegung, wieso dann nicht auch in Deutschland, ein Land was in so vielen Sachen als Vorreiter gilt ( Energiewende etc.) wieso dann nicht toleranz gegen neues zeigen.\r\n\r\nEs ist andererseits auch verständlich, dass E-Sports nicht anerkannt wird, Sport ist für den DOSB ( Deutschen Olypischen Sport Bund) eine körperliche Anstrengung die ausgeübt wird, zu sowas zählen keine Mentalen bzw. motorischen Betätigungen, dewegen wird laut DOSB E-Sports aufgrund momentaner Definition von Sport nicht zugelassen. Als Gegenbeispiel des Argumentes der DOSB kann man Schach nehmen, eine akzeptierte Sportart, welche dennoch keine körperliche Anstrengung anstrebt, sondern wie E-Sports mehr den mentalen Sektor fordert. Als Begründung hierfür gilt die Historie des Schachs, für mich dennoch kein Grund wieso Schach anerkannt wird und E-Sports nicht.\r\n\r\nZusammenfassend muss ich für mich selbst sagen, dass ich finde es ist die Zeit gekommen in der was geändert werden sollte. E-Sports ist eine immer weiter wachsende \"Sportart\" des 21. Jahrhunderts. Es gibt schon viele gute Beispiele dafür, dass es funktioniert es einfach anzuerkennen ( Asien, USA, Großbritannien) wieso nicht in Deutschland. \r\n\r\n*Zusatz: Jeder muss sich selber seine Meinung bilden, wieso es gut bzw. schlecht wäre, in diesem Beitrag wird lediglich von meiner Meinung berichtet.*\r\n\r\n**Danke für euer Interessen**\r\n\r\nmfg  ProZedd\r\n\r\nQuellen: http://mein-mmo.de/league-legends-esports239/  (Aufrufdatum 28. Februar 2015)","replies":[{"poster":"MeMyselfandBaal","date":"2015-02-28T16:40:40.959+0000","up_votes":5,"down_votes":0,"body":"braucht der e-Sports das überhaupt? Also der DOSB funktioniert ja hauptsächlich als Förderung für Sportarten, die, Förderung brauchen. Was bei einer derart schnell wachsenden (und einer derart einfach verfügbaren) \"Sportart\" wie LoL einfach nicht nötig ist... ich sag mal Moderne Fünfkämpfer brauchen den DOSB, wir brauchen den nicht und uns kann das egal sein...\n\nIch denke eher, dass sich der E-Sports unabhängig vom DOSB irgendwann zusammen schließen wird... also eine eigene FiFa gründen wird... ob das dann wieder gut ist, ist die andere Frage...\n\nWelche Möglichkeiten dass dann eröffnen würde... also mich würden eine Art Elympics schon interessieren, in denen in 2 Wochen in Nationalmannschaften die besten Counterstiker, Dotas und LoL Spieler ihren Olympiasieger (1. wird in jeder Disziplin Korea, 2. wer auch immer die meisten Koreaner einbürgern konnte...) ausspielen...\n\nAber allein schon der Fakt, dass solche \"Nationalmannschaftsturniere\" beim E-Sports völlig außen vor sind (obwohl jeder, der sich mit Sport beschäftigt, weiß, dass das immer die Events sind, die sich am besten vermarkten lassen), zeigt doch, dass E-Sports einfach völlig anders funktioniert als die Sportarten, die der DOSB koordiniert und dieser Verband für E-Sportler dementsprechend völlig egal sein wird...","replies":[{"poster":"0x67 0x61 0x79","date":"2015-02-28T16:56:43.461+0000","up_votes":2,"down_votes":0,"body":"Damit hast du Recht, es würde \"locker\" ohne Unterstützung  des DOSB funktionieren, dennoch wäre eine größere Toleranz gegenüber dieser Sportart dennoch angebracht. In Deutschland gibt es einfach zu viele Menschen die, wenn sie an E-Sport denken, nur \"Killerspiele\" in den Sinn bekommen, was einfach nur ignorant und falsch ist.\nEs wäre ein Schritt in Richtung des E-Sports wenn es keine so starke gegen Kritik von der ü40 Bevölkerung geben würde ( sehe ich persönlich als Grenze) , da einfach jeder damit dieses Vorurteil des \"dicken, hobbylosen, sozial abgeschnittenen Stubenhocker\"für die Spieler assoziiert.\n\nIch wäre für mehr Offenheit gegenüber diesem Thema in der Öffentlichkeit, da durch technische Änderung es früher oder später sowieso dazu kommen wird, dass sich e-Sports durchsetzten werden ( einfach meine Meinung).\n\nDanke für deine Antwort zu diesem Thema, dies ermöglicht mir und anderen wieder mehr über alles nachzudenken.\n\nmfg ProZedd","replies":[{"poster":"MeMyselfandBaal","date":"2015-02-28T22:12:30.488+0000","up_votes":1,"down_votes":0,"body":"ich glaube nicht, dass man bei der Ü40 Generation überhaupt eine Chance hat... die werden sich das angucken, nur bunte Bilder sehen, die sie nicht verstehen und sich dann Fragen \"Das soll Sport sein?\" Und da gehe ich von meinen eigenen Eltern aus, die sonst eigentlich sehr aufgeschlossen sind, aber an Computer Spiele einfach nicht rankommen...\n\nUnd zur Ausstrahlung im Fernsehen: Das lohnt sich wahrscheinlich auch einfach nicht... weil die LoL Spieler nicht die Zielgruppe \"Fernsehgucker\" sind... deswegen kriegt man in Werbepausen auch nur Spots für \"Casual Browser Games\" und nicht für LoL. Plus: Jeder, der selber LoL spielt (was meines erachtens irgendwie auch die Grundlage fürs gucken ist, weil man sonst keine Chance hat, beim gucken irgendwas zu verstehen... deswegen gucke ich z.B. kein Dota2 oder Starcraft... da sehe ich halt nie durch), hat halt auch Internet. Und für die ist es dann auch völlig normal, die Spiele im Internet und im Zweifelsfall als VOD zu sehen... da hat man als klassischer Fernsehsender einfach keine Chance gegen, deswegen werden die da auch nie für Geld ausgeben... ist ja auch kein Problem...","replies":[{"poster":"0x67 0x61 0x79","date":"2015-03-01T00:15:30.602+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=YnZkMR0R,discussion-id=PLE8ap7h,comment-id=000200000001,timestamp=2015-02-28T22:12:30.488+0000)\n>\n> ich glaube nicht, dass man bei der Ü40 Generation überhaupt eine Chance hat... die werden sich das angucken, nur bunte Bilder sehen, die sie nicht verstehen und sich dann Fragen \"Das soll Sport sein?\" Und da gehe ich von meinen eigenen Eltern aus, die sonst eigentlich sehr aufgeschlossen sind, aber an Computer Spiele einfach nicht rankommen...\n> \n> Und zur Ausstrahlung im Fernsehen: Das lohnt sich wahrscheinlich auch einfach nicht... weil die LoL Spieler nicht die Zielgruppe \"Fernsehgucker\" sind... deswegen kriegt man in Werbepausen auch nur Spots für \"Casual Browser Games\" und nicht für LoL. Plus: Jeder, der selber LoL spielt (was meines erachtens irgendwie auch die Grundlage fürs gucken ist, weil man sonst keine Chance hat, beim gucken irgendwas zu verstehen... deswegen gucke ich z.B. kein Dota2 oder Starcraft... da sehe ich halt nie durch), hat halt auch Internet. Und für die ist es dann auch völlig normal, die Spiele im Internet und im Zweifelsfall als VOD zu sehen... da hat man als klassischer Fernsehsender einfach keine Chance gegen, deswegen werden die da auch nie für Geld ausgeben... ist ja auch kein Problem...\n\nAn sich hast du Recht, dennoch bin ich eine solche Person ( ich denk es gibt auch mehr) die gerne abends mal ruhig vor dem Fernseher sitzen und das anschauen was gerade so interessantes kommt. Da die großen TV Unternehmen RTL, ProSieben etc. sehr daran interessiert sind möglichst viele Zuschauer mit einem Alter zwischen ich glaube 14 und 49 Jahren anzulocken, wären Programme mit E-Sports Anteil gar nicht mal so falsch.\nWenn ich mich in meinen momentanen Kursen in der Schule umgucken ( 11. Klasse) zocken knapp 90% Games, wie LoL oder CS:GO und davon sind meiner Schätzung nach ,und nach dem was ich höre, wieder knapp 50% interessiert an diesem Thema.\nDeswegen würde es besonders für TV Unternehmen einen riesen Gewinn machen, oder ich werde irgendwann so ein Unternehmen gründen ( natürlich spaß ^^ )","replies":[{"poster":"MeMyselfandBaal","date":"2015-03-01T08:29:59.610+0000","up_votes":2,"down_votes":0,"body":"Ich glaube ja, dass das Konstrukt des Fernsehens wie wir es kennen eigentlich schon ein Relikt aus der Vergangenheit ist... das macht man eigentlich nur noch für die Ü50 Generation, für die Das Internet wirklich noch Neuland ist... und in 5-10 Jahren wirst du keinen Fernseher mehr kaufen, sondern einen Mediaanschluss fürs Internet. Der dir dann vorschlägt, welche deiner Lieblingssendungen gerade ein Update bekommen hat... \nDas mag aber auch daran liegen, dass ich keinen Fernseher, aber trotzdem mittlerweile einen festen \"Serienplan\" habe... und das nicht über Kinox.to sondern Channelawesome.com und arte.tv...\n\nOb RTL dann in den Wettbewerb um LoL einsteigt... ist ne spannende Frage. Ich denke, stand jetzt, eher nein. Denn das Problem ist doch: so eine richtige LoL Produktion ist verdammt teuer. Und für RTL würde es halt nicht reichen, wie Maxim, seine Stimme über einen Clean-Feed zu legen. Und trotzdem stehen sie in permanenter Konkurrenz zum Englischen Originalstream... in einer \"Sportart\" die extrem englisch geprägt ist und in der einen Deutsche Kommentare (er blitzt? genaugenommen ja...) komisch vorkommen...\n\nUnd um mal die Zahlen zu relativieren: Maxim freut sich über 20.000 Zuschauer... dass ist keine Quote, die für RTL relevant ist. Und ich bezweifele, dass Riot ihren eigenen englischen Stream überhaupt aus der Hand geben will... Und mit dem würde RTL permanent konkurrieren... \n\nWas aber nur so nebenbei nicht das eigentliche Thema (sollte das als Sport gelten?) sondern eher ein \"Wie wird es sich vermarkten?\" ist...","replies":[{"poster":"MayaChan","date":"2015-03-01T11:19:22.559+0000","up_votes":2,"down_votes":0,"body":"Anstatt immer mit allem konkurieren zu wollen könnte man natürlich auch erstmal damit anfangen, überhaupt erstmal diese Sachen zu streamen oder auch könnte man Maxim irgendwie seine Sendezeit geben ohne ihm jetzt alle paar Monate ein noch größeres Studio aufzubauen. Muss dann ja auch nicht gleich zur Primetime sein, aber so gegen Mitternacht findet sich sicher der eine oder andere Sendeplatz.\n\nUnd weiterhin zeigen Sendungen wie Game One, dass man die Leute auch ohne viel Geld sehr gut unterhalten kann. Es ist hier also wirklich eher der reine Konkurenzgedanke, der das ganze aufhalten wird und weniger die Machbarkeit.","replies":[]}]}]}]},{"poster":"eingew","date":"2015-02-28T18:18:02.565+0000","up_votes":1,"down_votes":0,"body":"Naja, mehr Offenheit haben wir schon. Also es geht definitiv in die richtige Richtung. Über die letzte GC wurde sehr positiv berichtet, vor allem wegen dem großen Andrang und die letzten Worlds haben auch einen sehr objektiven (und dadurch positiven) Bericht vom Spiegel bekommen.","replies":[{"poster":"0x67 0x61 0x79","date":"2015-02-28T19:07:41.947+0000","up_votes":1,"down_votes":0,"body":"Das ist komplett richtig, muss mich da aber MayaChan anschließen, dass man anfängt diese Gemeindschaft der \"Gamer\" allein aus dem Grund, dass es viele sind, zu unterstützen. Ich glaube nicht das Riot für die Studios in Berlin einen Zuschuss vom Staat bekommt.\nAls ich einen kurzen Austausch mit einer englischen Schule hatte, zeigte mir mein Austauschpartner einen englischen TV Sender, welcher zu gewissen Zeiten Live Übertragungen abspielte oder einfach so wdhl. von früheren Spielen.","replies":[]}]},{"poster":"Shiggyvara","date":"2015-03-01T09:18:51.790+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ProZedd,realm=EUW,application-id=YnZkMR0R,discussion-id=PLE8ap7h,comment-id=00020000,timestamp=2015-02-28T16:56:43.461+0000)\n>\n> Damit hast du Recht, es würde \"locker\" ohne Unterstützung  des DOSB funktionieren, dennoch wäre eine größere Toleranz gegenüber dieser Sportart dennoch angebracht. In Deutschland gibt es einfach zu viele Menschen die, wenn sie an E-Sport denken, nur \"Killerspiele\" in den Sinn bekommen, was einfach nur ignorant und falsch ist.\n> Es wäre ein Schritt in Richtung des E-Sports wenn es keine so starke gegen Kritik von der ü40 Bevölkerung geben würde ( sehe ich persönlich als Grenze) , da einfach jeder damit dieses Vorurteil des \"dicken, hobbylosen, sozial abgeschnittenen Stubenhocker\"für die Spieler assoziiert.\n> \n> Ich wäre für mehr Offenheit gegenüber diesem Thema in der Öffentlichkeit, da durch technische Änderung es früher oder später sowieso dazu kommen wird, dass sich e-Sports durchsetzten werden ( einfach meine Meinung).\n> \n> Danke für deine Antwort zu diesem Thema, dies ermöglicht mir und anderen wieder mehr über alles nachzudenken.\n> \n> mfg ProZedd\n\nNaja bezüglich des Vorurteils mit dem \"dicken, hobbylosen, sozial abgeschnittenen Stubenhocker\" mag das für echte professionelle Spieler nicht gelten. \nWas ist aber mit den vielen (Millionen) Spielern, die sich in Solo durch Bronze/Silber/Gold/Platin/Diamant spielen?\nNicht jedes einzelne Vorurteil mag zutreffend sein aber die Gefahr, dass sie zutreffend sind ist bei einem Computerspiel im allgemeinen deutlich größer als bei den etablierten Sportarten, in denen man quasi gezwungen wird sich tatsächlich mit anderen Leuten auseinander zu setzen (In Solosportarten zumindest mit dem Trainer) oder sich Bewegung zu verschaffen. \nIm Solo in LoL könnte ich alle Leute muten und weil ich ja Rangliste spiele behaupten \"Sport\" zu machen, dann gegebenenfalls ohne Bewegung und soziale Interaktion.  Und diese Argumentation gefällt mir nicht. \n\nIn Teamspielen ist das schon wieder ein bisschen was anderes, da hier ja zumindest Kommunikation und Interaktion mit dem Team vorhanden ist.","replies":[{"poster":"eingew","date":"2015-03-01T11:04:33.514+0000","up_votes":1,"down_votes":1,"body":"Ja, rein theoretisch kann das zutreffend sein... Aber nicht jeder der gerne und viel liest ist blass und trägt eine Brille. Ich kenne einen ganzen Haufen Menschen die gerne zocken (mein Bekanntenkreis besteht quasi daraus) und 95% davon sind eher schlaksig als zu dick. Ja, die Gefahr besteht, weil zocken keinen sportlichen Körperbau fördert, aber das heißt noch lange nicht, dass man das auf alle übertragen kann. Vor allem, weil zocken nur ein Hobby ist, man kann nebenbei durchaus noch Sport treiben.\n\nUnd Tennis spiele ich auch alleine, ohne soziale Interaktion, nur 1v1, sowie diverse andere Sportarten... Ich glaube nicht, dass das etwas ist, womit man gegen LoL als Sport argumentieren kann.","replies":[]}]}]}]},{"poster":"Marethyu7","date":"2015-02-28T18:36:35.981+0000","up_votes":2,"down_votes":0,"body":"Naja, Computerspiele bzw. Online Wettkämpfe werden in Deutschland wohl so schnell nicht auf öffentlichen Sendern wie etwa ARD, ZDF, RTL und Co. ausgestrahlt, das steht fest. Der Grund dafür ist, dass in vielen Köpfen (hauptsächlich Leute, die keine Online Spiele spielen) immer noch das Bild vom \"dummen und verwahllosten Zocker\" vorherrscht. Klar trifft dieses Voruteil leider Gottes auf eine Minderheit der Online-Spieler zu, aber wir alle werden in der Gesellschaft zu sehr verallgemeinert. Als Beispiel: Computer spielen bei einer Bewerbung als Hobby anzugeben, ist wohl einer der größten Fehler, die man als Bewerber um eine Ausbildungsstelle tun kann. Die Chefs lesen das und denken sich \"Verwahlloster Kerl, der eh nix drauf hat - weg damit!\" \n\nUnd solange dieses Vorurteil nicht besiegt ist, wird E-Sports in Deutschland auch nicht anerkannt, das ist meine Theorie zu dem Thema. Flamed mich oder macht was ihr wollt, aber einige von euch werden mir wohl leider recht geben müssen. Und zwar mit der Tatsache, dass einige unserer Landsleute einfach nichts im Hirn haben aber sich über Zocker auslassen als gäbe es kein Morgen. \n\nZum Thema: Klar. Warum nicht? E-Sports ist zwar in dem Sinne kein körperlicher Sport wie Fußball, Handball oder Kampfsport, aber warum sollte man einer Fanbase von mehreren Millionen Menschen nicht die Chance geben, öffentlich ihr Publikum zu gewinnen?","replies":[{"poster":"0x67 0x61 0x79","date":"2015-02-28T19:02:55.529+0000","up_votes":3,"down_votes":0,"body":"Bin gleicher Ansicht wie du, man sollte etwas mal ausprobieren bevor man darüber urteilt. Es ist genauso, wie ganzen Talkshows über das \"zocken\" die eine Seite mag es bzw hat schon mal gezockt, die andere Seite oft Politiker etc ( welche nicht mit sowas aufgewachsen sind) kritisieren es immer an irgendwelchen Einzelfällen.\nBeste Beispiel ist immernoch, dass einige Menschen denken durch Ego Shooter wird man zu einem Killer.","replies":[]},{"poster":"Bolgash","date":"2015-02-28T21:41:39.335+0000","up_votes":2,"down_votes":0,"body":"Zum Thema Ausstrahlung, es wurde bereits ein LoL Turnier der ESL im Fernseher gezeigt, sollte auf ZDF Kultur gewesen sein.\nDas ganze ging von Mittag bis Abends waren jedenfalls mehr als 6h.\nJedoch sah das Ganze etwas semi professionell aus. Z.B. fehlten an den Rändern jeweils Teile.\nVon Werbung dafür habe ich nichts mitbekommen, ich bin auch bloß zufällig darauf gestoßen.","replies":[{"poster":"0x67 0x61 0x79","date":"2015-02-28T22:03:47.397+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bolgash,realm=EUW,application-id=YnZkMR0R,discussion-id=PLE8ap7h,comment-id=00030001,timestamp=2015-02-28T21:41:39.335+0000)\n>\n> Zum Thema Ausstrahlung, es wurde bereits ein LoL Turnier der ESL im Fernseher gezeigt, sollte auf ZDF Kultur gewesen sein.\n> Das ganze ging von Mittag bis Abends waren jedenfalls mehr als 6h.\n> Jedoch sah das Ganze etwas semi professionell aus. Z.B. fehlten an den Rändern jeweils Teile.\n> Von Werbung dafür habe ich nichts mitbekommen, ich bin auch bloß zufällig darauf gestoßen.\n\nIch habe es auch mal dort gesehen, aber genau wie du beschrieben hast, hätte es mal kurz Werbung dafür gegeben, irgendein kurzer Hinweis hätte ja schon gereicht. Dann hätten dieses Event mehrer Menschen gesehen, bin nämlich da auch nur zufällig drauf gestoßen.","replies":[]}]}]},{"poster":"Nebeltänzer","date":"2015-02-28T15:27:55.672+0000","up_votes":3,"down_votes":0,"body":"Ich persönlich sehe das wie der DOSB, mir fehlt hier die körperliche Betätigung. Beim Nachdenken über die Fragestellung kam mir auch Schach in den Sinn - allerdings haben Schach und \"E-Sports\" einige Unterschiede.\n\nSchach ist komplett \"mental\", alles Strategie und Vorausberechnung von Zügen. Zudem ist es ein einziges, spezifisches Spiel (so wie Fußball, Volleyball, Eishockey, .....)\nE-Sports erfordert mehr als nur Strategie (was dem Gedanken der 'Anerkennung' nun allerdings nicht entgegenstehen würde - nur als 'side fact'). E-Sports bezeichnet jedoch kein spezifisches Spiel, keine spezifische Disziplin. Das ist, wie wenn ich \"Ballsport\" anerkennen wollen würde. (Ob das nun Fußball, Völkerball, Tischtennis oder sonstwas ist)\n\nIn dem Fall müsste man eher jedes einzelne Spiel (Dota2, LoL, ...) als Sportart für sich anerkennen. Und da ist die nächste Frage, wo man dort die Grenzen zieht. Sonst könnte/müsste man einen großen Teil von Mehrspieler-Spielen als (E-)Sport anerkennen. Mir persönlich wäre das ganze doch etwas schwammig, dementsprechend kann ich mich spontan mit dem Gedanken der \"Anerkennung\" von E-Sports als Sportart weniger anfreunden. Auch, wenn ich den Grundgedanken durchaus nachvollziehen kann. :D","replies":[{"poster":"MayaChan","date":"2015-02-28T18:08:01.411+0000","up_votes":2,"down_votes":1,"body":"Es geht hierbei wohl weniger darum, dass es tatsächlich eine Sportart wird, die per Definition körperliche Betätigung braucht, sondern vielmehr, dass einfach die eSportler vergleichbare Förderung und eine faire Medienpresänz bekommen. Hier und da gibt es zwar die eine oder andere Sendung, aber größtenteil wird es noch immer sowohl von den Medien als auch von den Politikern deutlich unterschätzt und von zweiteren auch ziemlich oberflächlich beurteilt. Ich kann mir gut vorstellen, dass irgendwann auch reine eSports-Stadien gebaut werden und eigene TV-Sender für solche Dinge gemacht werden, aber bis dahin muss man wohl darauf warten, dass unsere Genereration auch mal etwas mehr zu sagen hat.","replies":[]}]},{"poster":"SmallAndHandsome","date":"2015-02-28T20:20:21.404+0000","up_votes":1,"down_votes":0,"body":"Aufjedenfall.","replies":[]},{"poster":"0x67 0x61 0x79","date":"2015-02-28T15:36:12.396+0000","up_votes":1,"down_votes":0,"body":"Mit der Anerkennung von E-Sports meine ich die allgemeine Anerkennung von einer \"Sportart\" , welche mit technischen Hilfsmitteln ( PC , Konsole ) funktioniert. Um diese dann in den Kategorien Einzelspieler- und Teamspiele einzuteilen, dann bräuchte man keine Eingliederung der verschiedenen Genren.\n\nAls bessere Hilfe zu meiner These der Definition kann man sich die Äußerung bzw Definition von Wikipedia heranziehen \n> E-Sports bezeichnet den sportlichen Wettkampf zwischen Menschen mit Hilfe von Computerspielen  (http://de.wikipedia.org/wiki/E-Sport)\n\ndanke für deine Rückmeldung\n\nmfg ProZedd","replies":[]}]}