{"poster":"Arhig","date":"2017-09-11T00:22:39.829+0000","title":"porque es tan complicado saber que comprar para cada campeon?","subforum":"Charlas Generales","up_votes":3,"down_votes":8,"body":"me parece que las runas los puntos de maestria y encima tener que saber que comprar durante el juego es un verdadero dolor de cabeza tendria que ser mas facil la manera de elegir que comprar tendria que estar separado por campeon y no andar estudiando que tenes que comprar se pierde la diversion por andar estudiando si quisiera estudiar iria a la escuela ja el juego es adictivo pero cansa eso de que cuando tenes ganas de cambiar un campeon tenes que hacerte un curso nuevo para llegar a dominarlo ...","replies":[{"poster":"Deigex","date":"2017-09-11T00:36:17.430+0000","up_votes":5,"down_votes":0,"body":"Y que clase de juego de estrategia no se requiere estudio? El lol es mucho mas simple que otros mobas, si queres algo asi este no es tu tipo de juegos.\nLas builds son situacionales dependen no solo del campeon y su sinergia con ellos sino de como esten actualmente los objetos.\nPara una persona nueva arrancar en un juego que ya tiene mas de 7 años de recorrido es dificil hay millones de cosas, campeones y mecanicas, pero como tenes esta dificultad tambien tenes la facilidad de encontrar todo lo posible para ayudarte en google, youtube y mil paginas cosas que cuando todos los veteranos empezamos tuvimos que experimentar, calcular y aprender solos.","replies":[]},{"poster":"Hendrix","date":"2017-09-11T02:01:43.171+0000","up_votes":2,"down_votes":0,"body":"No lo crucifiquen, esta en nivel 6...\n\nMira, al principio todo te puede parecer un lio. Que tipo de daño tiene mi campeon? El campeon que tenes enfrente es AD o AP? Me convene comprar algo agresivo o algo de defensa? En que orden comprar segun me va? Que runas me convienen? Que maestrias? Que hechizos? Al principio te marea un poco, pero con el tiempo es casi automatico. \nDominar realmente un champ lleva tiempo y MUCHA practica. \nNo te frustres, no te desanimes, juga, divertite y segui adelante!","replies":[]},{"poster":"Defg45333","date":"2017-09-11T00:45:02.845+0000","up_votes":2,"down_votes":0,"body":"¿Y que propones? ¿Que todos tengan una build determinada y que no se pueda elegir cambiarla?\nSi no quieres estudiar mucho el juego, te buildeas lo que está en \"recomendado\" y listo, la mayoría de las veces te va a ir medianamente bien con esos items.\nUn saludo.","replies":[]},{"poster":"Danshid","date":"2017-09-11T02:15:30.310+0000","up_votes":1,"down_votes":0,"body":"Consejos para buildearte\n\n1-. Usa maestrías fijas y cambialas según el campeón (yo tengo ad, ap, supp, tanque y gp, casi siempre modifico según el champ que eleji)\n\n2-. Runas no hagas mucho (ap y ad) ya que las cambiaran pronto\n\n3-. Haste los items recomendados (de a uno, no hagas dos items a la vez) y aprendete los items situacionales (heridas graves, anti tanques, anti ap, tabis, mercurys y poco mas)\n\n4-. Aprende a jugar unos pocos campeones, aprende sus builds y listo, todo mas fácil\n\nRecuerda que buildearse bien lleva mucha practica y experiencia y que todo es situacional, saludos y suerte en al grieta","replies":[]},{"poster":"Nehalem","date":"2017-09-11T01:24:51.603+0000","up_votes":1,"down_votes":0,"body":"En heroes of the storm no tienes items y en Smite tienes ciertos items dependiendo del personaje (si es mágico o de daño). Quizás estos te resulten mas cómodos.","replies":[]},{"poster":"Pollo al Ornno","date":"2017-09-11T01:14:00.603+0000","up_votes":1,"down_votes":0,"body":"Nadie te dice de comprar algo en especifico, si vos queres anda tryndamere ap adc con redencion, total si te divertis asi no esta mal :)\n\n\n\n\n\nNO LO HAGAS xd","replies":[]},{"poster":"SmokeyShauna","date":"2017-09-11T00:43:57.609+0000","up_votes":1,"down_votes":0,"body":"no es tan dificil,solamente tenes que buscar en google \"build (x champ) (x linea)\" la pones en un conjunto de objetos personalizado y listo xd.","replies":[]},{"poster":"Verandis","date":"2017-09-11T00:41:09.871+0000","up_votes":1,"down_votes":0,"body":"por que todo absolutamente todo.. es situacional... vos te armas y usas runas y maestrias dependiendo de que campeon uses y de contra que campeones te vas a enfrentar.. y en que mapa te encuentras... mira que soy bronce y lo se :v","replies":[]},{"poster":"Urxnium","date":"2017-09-11T00:37:09.365+0000","up_votes":1,"down_votes":0,"body":"Puedes personalizar lo que puedes comprar con un campeón en específico.","replies":[]}]}