{"poster":"S1lverWolf","date":"2019-11-05T16:11:24.177+0000","title":"Meine Meinung - Produktive Gedanken ob positiv neutral oder negativ sind willkommen - ☺","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":5,"body":"Hallo Leute, zuerstmal achtet bitte nicht auf meine Rechtschreibung und Grammatik beides ist grauenhaft. Das weiß ich bereits. Das hier ist ein Forum und ich würde mich gerne ein bisschen äußern. Ich möchte hier nicht irgendwen angreifen sondern einfach Meinung in die Welt entsenden. Und Entschuldigung für die Moteratoren falls ich hier in die Falsche Kategorie schicke hab keine Ahnung und das ist mein erster Beitrag.\r\n\r\nIch spiele seit Kayn rausgekommen ist und bin Vel'koz Main (Lieblingsrolle Support oder Top). Ich bin letzte Season Silber 5 (gibt es jetzt ja nicht mehr) gewesen und bis jetzt bin ich Silber 4. UND ich bin stolz drauf mal neben bei bemerkt. Ich melde mich zu Wort weil mir immer mehr sehr negative Beiträge auffallen. Zwar gibt es auch positivie oder Informative aber viel mehr negative. \r\n\r\nZuerstmal was mich stört ist das immernoch viele von low-elo (für die meisten eisen bis silber) und von high-elo (gold bis keine ahnung wie hoch das geht ich glaube challenger.) Jeder hat einmal \"unten\" angefangen wirklich Jeder. Außer vielleicht bei Naturtalenten da kann ich das nicht so einschätzen die sind aber SEHR selten. Es stört mich ziemlich. Klar ich habe auch Schubladen aber die sind folgende : LOW-ELO -> Alle Ränge bis rauf zu Challenger. HIGH-ELO -> Alle Spieler die an E-Sports Turnieren teilnehmen. Ich bin mir sicher das sehr viele mir Wiedersprechen werden. Aber überlegt mal auch sehr viele von euch machen sich über \"Low-Elo\" lustig. Aber wenn ihr euch über die Lustig macht wie Fühlen die sich ? Wie habt ihr euch damals gefühlt wenn ihr als \"Low-Elo\" beleidigt wurdet ? Ich verabscheue sowas und hab darunter auch viel zu Leiden auch wenn ich das hier nicht wirklich gut ausdrücken kann. Vielleicht sind meine \"Schubladen\" viel zu groß aber wenn mal ein Ranked von irgendwem egal welche elo ob hoch oder niedrig und dann die E-Sports Spiele vergleicht für mich sind das zwei verschiedene Welten. Das wars erstmal zu dem Thema denkt einfach mal darüber nach.\r\n\r\nZweitens beschweren sich viele über Flame und das man sich nicht verteidigen könne weil man sonst einen Ban oder etc bekommt. Ich finde seit neuestem das es ein wunderbares System gibt das Riot uns zur Verfügung stellt. Man kann nähmlich bei Optionen den Team und All-Chat deaktiveren und dann selber nichts mehr reinschreiben. Davor war es echt Ätzend aber ganz ehrlich DAS ist eure Verteidigung. Dieses Verteidigen habe ich gelernt wo ihr SCHREIBT ist Falsch und Kontraproduktiv. Ich habe letzte Season 2 Chat Sperren bekommen weil ich einmal meine premates beschützt habe und selber ziemlich hart geflamt habe. Ich bin bis heute überzeugt das Riot diesbezüglich vollkommen richtig gehandelt hat. Mit Worten kann man nicht verteidigen nur angreifen. Für die Kommuniktation sind Pings da. Werden diese Missbraucht muten. Shit happens. Außerdem ist es nur ein Game wer es so ernst nimmt das er Tastatur Maus etc zerstört sollte sich ein neues Hobby suchen.\r\n\r\nDann wären wir auch schon bei Punkt 3 und somit den letzen Punkt. Immer wieder beschweren sich bestimmte Leute \"ja Riot hat mich süchtig gemacht sie schulden mir jetzt Geld oder mein 2000 € wurde gebannt\" Wasn das fürn Schmarrn. Wenn ihr süchtig seid oder mehrere Tausend Euro reinstecken (Soviel geld hätte ich auch gerne) dann seid ihr selber Schuld. Riot hat nur was mit dem Game zu tun nicht mit euren Fehlern oder eurem Verhalten. Und wenn ihr jetzt kommt mit \"nicht mal das kriegen sie hin\" ich würde es nicht schaffen so eine Community und so ein Spiel zu verwalten. Beziehungsweiße das Fehlerfrei zu tun. Also Respekt für Riot Games von meiner Seite. Vielen Dank für alle die sich meine Meinung durchgelesen haben und nochmals entschuldigung wegen der Deutschen Sprach-Mutation ;)","replies":[{"poster":"Fìnn","date":"2019-11-05T18:16:12.702+0000","up_votes":2,"down_votes":0,"body":"Moinsen, ich misch mich hier auch mal ein.\n\nIch bin der Meinung, dass jeder Low- und High-Elo anders definiert, weil sie für jeden anders ist. Für mich zum Beispiel, als Platin Spieler, ist alles unter meiner Elo Low-Elo und alles darüber High-Elo. Klingt vielleicht komisch, aber ergibt auch irgendwie Sinn. Warum Spieler Mitspieler als Low-Elo bezeichnen, obwohl sie früher mit hoher Wahrscheinlichkeit auch auf dieser waren, hängt vermutlich damit zusammen, dass sie damals auch als Low-Elo bezeichnet wurden und das halt einfach so weiterleiten.\nNur Beschwörer, die auf E-Sport Events jeglicher Art spielen als High-Elo zu betiteln ist meiner Meinung nach falsch. Elo bezieht sich ja auf den in-game Rang und nicht auf das Teamplay. Der Unterschied zwischen \"deiner\" Low-Elo und competitive Games ist selbstverständlich sehr hoch. Du wirst auch nie ein High-Challenger Game so erleben, wie ein Spiel bei z.B. den Words - wie du sagtest sind halt verschiedene Welten.\nIch finde persönlich auch, dass man nicht unbedingt alle Chats deaktivieren sollte. Ich rate dazu den All-Chat immer zu muten und beim eigene Team nur die einzelnen Spieler, sollte sie die nerven. Da Kommunikation eben auch schriftlich und nicht nur über Pings erfolgen kann. Ich spiele League nun auch lange genug um mit dem Flame klar zu kommen und nicht alle muten zu müssen. Für neue Spieler aber definitiv ein Tipp!\nStimme dir bei deiner Meinung zu Bans auch komplett zu. Die Leute denken halt einfach wenn sie viel Geld investieren, ist ihr Account gesichert und sie können nicht bestraft werden. Dann flamen sie Riot, dass sie nur provoziert wurden, realisieren aber nicht dass es bei Online-Spielen keine Notwehr gibt und man nur für seine Taten belangt werden kann.","replies":[{"poster":"S1lverWolf","date":"2019-11-05T19:12:00.332+0000","up_votes":1,"down_votes":0,"body":"Bezüglich meines Schubladensystems gebe ich dir Recht. Auch in dem Punkt das jeder \"Low und High\" Elo unterschiedlich definiert stimme ich dir zu. Für mich ist es so das für mich High-Elo nicht nur Teamplay da ist. Sondern auch das Farmen und Entscheidungen. Wenn ich nähmlich sämtliche Spieler beobachte fällt mir bis auf Ehrgeiz kaum Unterschiede auf. Deswegen habe ich alle immer in eine Kategorie eingestuft. Es ist mittlerweile ziemlich eindeutig das mein High-Low-Elo System nicht funktionsfähig ist zumindest für alle anderen. Für mich wird es allerdings so bleiben warum habe ich ja erklärt. Es freut mich allerdings das Ich deine Meinung bezüglich Bans vertrete. Vielen Dank für dein Feedback und deine Kritik kann beides gut gebrauchen^^","replies":[]}]},{"poster":"Divin1ty","date":"2019-11-05T16:43:25.316+0000","up_votes":1,"down_votes":2,"body":"Mein Peak war Diamond 1 mit 87 LP, hab jedoch auch in Bronze angefangen, gab da auch ab und an Sprüche, was mir aber eher als motivierend vorgekommen ist.\n\nWenn es dich stört das jemand dich als 'low elo' betitelt, werd einfach besser.\nSolange du weißt das du improven sollst, ist immer Luft nach oben, fang an dein Team für die Elo zu blamen ist es vorbei.\n\nOder du bist ein casual Spieler und dann kann dir Elo herzlich egal sein, gibt tatsächlich Leute denen League zu *spielen* alleine Spaß macht, egal was der Endscreen, oder der Rang sagt. ^-^","replies":[{"poster":"S1lverWolf","date":"2019-11-05T17:28:10.026+0000","up_votes":2,"down_votes":1,"body":"Es geht auch nicht um \"Elo-Hell\" oder improven oder auf Diamant oder Gold kommen. ich bin auch kein casual player da ich wenn ich freizeit habe lol spiele. Wenn das für dich Casual ist weiß ich auch nicht. Und selbst wenn ist das doch egal meine Meinung ist genauso wertvoll wie jede andere auch. Und selbst wenn ich ein ranked verliere ist doch egal ich habe spaß sonst würde ich es nicht als Hobby / Freizeitvertertreib haben. Ich jammere auch nicht das ich Silber bin wie gesagt ich bin Stolz das ich Silber 4 bin. Außerdem stört es nicht nur mich mal nebenbei bemerkt. Du solltest dir für eine ernsthafte Diskousion nochmal den Text durchlesen den dein Kommentar ist mehr oder Weniger eine Thema Verfehlung. Und Produktiv ist er auch nicht","replies":[{"poster":"Divin1ty","date":"2019-11-05T18:20:19.537+0000","up_votes":1,"down_votes":2,"body":"> Zuerstmal was mich stört ist das immernoch viele von low-elo (für die meisten eisen bis silber) und von high-elo (gold bis keine ahnung wie hoch das geht ich glaube challenger.) Jeder hat einmal \"unten\" angefangen wirklich Jeder. Außer vielleicht bei Naturtalenten da kann ich das nicht so einschätzen die sind aber SEHR selten. Es stört mich ziemlich. Klar ich habe auch Schubladen aber die sind folgende : LOW-ELO -> Alle Ränge bis rauf zu Challenger. HIGH-ELO -> Alle Spieler die an E-Sports Turnieren teilnehmen. Ich bin mir sicher das sehr viele mir Wiedersprechen werden. Aber überlegt mal auch sehr viele von euch machen sich über \"Low-Elo\" lustig. Aber wenn ihr euch über die Lustig macht wie Fühlen die sich ? **Wie habt ihr euch damals gefühlt wenn ihr als \"Low-Elo\" beleidigt wurdet ?** \n\nBin hierauf eingegangen.\nDas du ist eigentlich nur symbolisch für den Leser, gibt hier genug die an die Elo Hell glauben.\n\nLies doch mal deinen eigenen Text. :)","replies":[{"poster":"S1lverWolf","date":"2019-11-05T18:50:08.870+0000","up_votes":2,"down_votes":1,"body":"Es geht nicht um die Elo-Hell du hast das Thema nicht verstanden. Es geht darum jetzt sehr einfach erklärt das die Besseren Spieler nicht gerade selten über schlechtere Spieler herziehen. DAS ist gemeint und ich kenne meinen Text sehr gut da ich heute ne halbe stunde allein zur Formulierung dran saß. Die sogenannte Elo-Hell existiert wenn überhaupt in den Köpfen von Spielern wie jetzt zum Beispiel dir (kein Angriff). In der Realität hängt die Elo von mehreren Kalkulierbaren Faktoren ab. Aber wie gesagt DARUM geht es nicht. Es geht nicht um die Elo AN SICH sondern darum das Bessere oder Stärkere sich über die Schlechteren oder Schwächeren herziehen. Das brauch keiner egal wer und egal welche Elo","replies":[{"poster":"Divin1ty","date":"2019-11-05T18:52:07.867+0000","up_votes":1,"down_votes":2,"body":"Liest du überhaupt was ich schreibe?\nHabe sogar hervorgehoben auf was genau ich eingehe. \n\nIch habe dargelegt wie ich mich fühlte als ich als low Elo bezeichnet wurde und als Erfahrungsbericht dargelegt warum Elo Hell nicht existiert, bzw. wie sie entsteht.\n\nGlaube die Weiterführung dieser Unterhaltung ist sinnlos, da bei dir das Lesen und Verstehen fehlt.","replies":[{"poster":"S1lverWolf","date":"2019-11-05T19:18:11.537+0000","up_votes":1,"down_votes":1,"body":"> Ich habe dargelegt wie ich mich fühlte als ich als low Elo bezeichnet wurde und als Erfahrungsbericht dargelegt warum Elo Hell nicht existiert, bzw. wie sie entsteht.&lt;\n\n\nDeine Worte sind nirgends Produktiv noch ein Erfahrungsbericht noch wiederlegst du das es die \"Elo-Hell\" gibt. Wenn du nicht schreibst was du meinst kann ich ja gar nicht verstehen was du ansprechen möchtest. Solltest du Wert drauflegen kannst du ja nochmal von vorne anfangen und exakt hinschreiben was du meinst.","replies":[{"poster":"S1lverWolf","date":"2019-11-05T19:33:46.842+0000","up_votes":1,"down_votes":1,"body":"Außerdem ist der Vorwurf Lesen und Verstehen ziemlich heftig vor allem weil ich hier fast sämtliche Gedankenvorgänge versuche so gut es meine Rechtschreibung zulässt mitzuteilen. Ich habe deinen Text jetzt mehrmals durchgelesen und du sagst nur wenn ihr es nicht mögt beleidigt oder gemobbt zu werden (leicht übertrieben) dann werdet besser. Das ist deine erste Nachricht. Hinzuzufügen wäre das mit dem Casual aber dazu sag ich lieber nichts. In der zweiten Nachricht ist am ende der Begriff \"Elo-Hell\" aufgetaucht. Damit diesbezüglich aber keine weiteren nicht relevanten Diskousionen auftauchen habe ich da etwas klar gestellt. Außerdem ist wie man in deiner dritten Nachricht sieht hinterlegt das du nicht an die Elo-Hell glaubst wird aber aus Nachricht 2 nicht KLAR ersichtlich. Außerdem ist ein ErfahrungsBericht kein \"ich werde scheiße behandelt ich werde Besser\" sondern zum Beispiel so habe ich mich gefühlt die Optionen hatte , ich für die habe ich mich entschieden.","replies":[]}]}]}]}]}]}]},{"poster":"G2 Slippi","date":"2019-11-05T16:42:45.874+0000","up_votes":2,"down_votes":1,"body":"Hi\n\nAls erstes muss ich mal sagen, dass dein Text gut geschrieben ist und auch kaum Fehler aufweist (im Gegensatz zu den meisten Beiträgen hier im Forum, wo man einen Kryptologen zum übersetzen braucht).\nDanke, dass du dich da so bemüht hast :)\n\nZu deiner Meinung:\n\nIch finde es großartig, dass du das leidige Thema \"Low-Elo\" \"High-Elo\" so offen ansprichst. Im Großen und Ganzen bin ich hier deiner Meinung, jedoch würde ich die Schubladen doch ein klein wenig anders aufteilen:\nLow-Elo: Alle Spieler ab Iron bis Diamond II\nHigh-Elo: Diamond I bis Challenger\nAber das ist halt wirklich nur subjektive Einschätzung, denn für andere beginnt High-Elo erst ab Master oder gar Grandmaster.\nChallenger ist der höchste Rang, in dem sich auch die meisten Profis befinden.\n\nWas das Thema Flame angeht, bin ich auch komplett bei dir ;)\nIch habe den All-Chat generell gemutet und wenn jemand aus meinem Team meint, er muss persönlich werden, dann wird auch der gemuted.\n\nPunkt 3 ist nichts mehr hinzu zufügen. Genauso wie du es sagst (schreibst) ist es auch. Danke dafür.\n\n\nAlles in Allem, ein großartiger Text. Danke dir :)\n\nLG Slippi","replies":[{"poster":"S1lverWolf","date":"2019-11-05T17:39:12.266+0000","up_votes":1,"down_votes":1,"body":"Hallo Slippi1\n\nIch kenne mich Elo mäßig nicht so aus da ich wie gesagt alle nicht E-Sport Leute als Low-Elo eingestuft habe. Danke für die Info mit Challenger hab echt kaum Ahnung bezüglich der Namen von den Rängen. Vielen Dank für deinen Beitrag und die Kritik ^^ hat mich beides gefreut. Vielleicht können wir ja mal ein bisschen zusammen League of Legends spielen wenn du möchtest ;)","replies":[{"poster":"G2 Slippi","date":"2019-11-05T19:46:01.126+0000","up_votes":1,"down_votes":0,"body":"Kannst mich gerne adden, bin immer für ne gemütliche Runde League zu haben ;)","replies":[]}]}]},{"poster":"Izaya Kumiho","date":"2019-11-05T16:38:23.482+0000","up_votes":2,"down_votes":1,"body":"> und von high-elo (gold bis keine ahnung wie hoch das geht ich glaube challenger.) \n\nAlles unter Dia wird häufig eher als \"low elo\" angesehen. Alles ab Dia ist dann \"high elo\".\n\n> Aber überlegt mal auch sehr viele von euch machen sich über \"Low-Elo\" lustig.\n\nKommt darauf an, ob die Person mich versucht zu shittalken und zu meinen Freunden gehört. :P\nSonst kann mir die Elo doch ziemlich egal sein, no?\n\n'gibt eigentlich keinen Grund, um die Elo einer anderen Person als negativen Punkt zu sehen.\n\n>Aber wenn ihr euch über die Lustig macht wie Fühlen die sich ? \n\nAs i said: shittalkt mich einer, weil ich jede Season nur bis Gold spiele, sucht er den Streit :v\n\n_Platin ist auch nur ungepflegtes Silber._ :> \n\"Change my mind.\"\n\n______________________\n\n>Mit Worten kann man nicht verteidigen nur angreifen.\n\nDas stimmt nicht ganz. \nDu kannst zwar mit Worten viel mehr Schaden anrichten, aber ebenfalls neutral bleiben, ohne die Situation schlimmer zu machen.","replies":[{"poster":"S1lverWolf","date":"2019-11-05T17:34:58.539+0000","up_votes":2,"down_votes":3,"body":"Du hast in einigen Punkten Recht allerdings muss ich dir auch wiedersprechen. Vielleicht habe ich keine Ahnung was \"High\" oder \"Low\" Elo ist aufgrund dessen da ich ein anderes Schubladensystem verwende. Mit dem \"Shittalken\" damit hast du Recht. Aber es geht nicht jeden so und das habe ich versucht anzusprechen. Viele Trifft das nähmlich ziemlich heftig auch wenn sie es sich nicht anmerken lassen. Und ich finde das sowas mitzuteilen langsam immer wichtiger wird. Bei dem Punkt mit den Worten muss ich dir allerdings vehement wiedersprechen. Denn klar es besteht die möglichkeit neutral zu bleiben nur schafft das fast keiner oder wenige Ausnahmen halt. In den meisten Situationen ist es halt wie es vom Support meistens betittelt wird \"Feuer mit Feuer\" bekämpfen und das funktioniert nicht. Vielen Dank für deinen Beitrag und die Kritik kann ich beides verwerten ^^.","replies":[{"poster":"Ráyleigh","date":"2019-11-05T17:48:10.684+0000","up_votes":1,"down_votes":0,"body":"Wenn man Worte mit Verstand benutzt ist es kein Feuer mit Feuer bekämpfen.\nUnd das sollten im Grunde die meisten drauf haben.\n\nMan kann seine Teams motivieren usw.\nWenn jemand Flamen will soll er es tun den kann man dann muten.\nAber das man mit Worten nur angreifen kann ist völliger Quatsch.","replies":[{"poster":"S1lverWolf","date":"2019-11-05T18:57:42.262+0000","up_votes":1,"down_votes":1,"body":"Ja die meisten sollten das können. Jeder geht davon aus. Aber wer kann das tatsächlich? Wer ist in der Lage auf 180 kluge und neutrale Worte zu finden ? Klar kann man motivieren und so habe ich schon einige games mit sehr schlechten Stats gecarryed nicht mit skill oder so sondern mental. Allerdings dringt das immerweniger zu den Spielern durch. Und ich bin mir zu 100% sicher das nicht nur ich das Gefühl habe. Sehr viele Menschen denken und behaupten auch sie können es aber die Wirklichkeit sieht anders aus. Das ist mit \"Feuer mit Feuer bekämpfen\" gemeint. Extrem viele Spiele sind nähmlich nicht so wie du ausgehst. Wäre der Standard wie der von dem du ausgehst vorhanden hätte ich den Punkt nicht reingeschrieben weil er sich selbst erledigen würde. Aber demnach ist es nicht so was mitunter das Problem ist. Und das ist auch der Grund  warum ich die Worte gewählt habe die oben stehen. Vielen Dank für dein Feedback ich nehme es mir zu Herzen.","replies":[{"poster":"Ráyleigh","date":"2019-11-05T19:39:32.126+0000","up_votes":1,"down_votes":0,"body":"Wer in Lol oft auf 180 ist sollte das Spiel löschen^^\nUnd selbst dann sollte der Verstand noch laufen.","replies":[]}]}]}]}]},{"poster":"611FVNKBlv","date":"2019-11-06T00:34:46.213+0000","up_votes":1,"down_votes":1,"body":"> Zuerstmal was mich stört ist das immernoch viele von low-elo (für die meisten eisen bis silber) und von high-elo (gold bis keine ahnung wie hoch das geht ich glaube challenger.) Jeder hat einmal \"unten\" angefangen wirklich Jeder. Außer vielleicht bei Naturtalenten da kann ich das nicht so einschätzen die sind aber SEHR selten.\n\n Naja theoretisch hat JEDER egal ob Talent oder nicht beim gleichen Anfangspunkt angefangen.\n\nAllerdings ist Low und High-Elo eben berechtigt zu Unterscheiden in einer Rangliste. Sonst wären alle Spieler halt prinzipiell gleich gut aufgefasst egal ob da nun Bronze oder Challenger steht. Zudem ist die definition halt bei jedem anders . Vieles ist beeinflusst durch sogenannte Meme-Elos wie Platin 4 oder Dia 4 und wenn man diese Grenze überschritten hat ist man zb High-Elo. Viele jedoch würden auch sagen alles was schlechter als man selber ist = Low und was besser ist = High\n\nIch selber mach es an Erfahrungswerten fest und wenn man sieht was sowohl in Bronze spielt als auch in High Dia mittlerweile da kannst du mittlerweile von gar nichts mehr sprechen außer Würfelspiel.\n\nTheoretisch könnte man zb auch Sagen das alles unter der aktuellen Middle-Elo (Gold 4-3) alles drunter low und drüber high elo wäre . Ist halt ne Frage der Definition  . Das man es aber eindeutig abtrennt finde ich in einer Rangliste verständlich und sogar fast schon notwendig.\n\n> Klar ich habe auch Schubladen aber die sind folgende : LOW-ELO -> Alle Ränge bis rauf zu Challenger. HIGH-ELO -> Alle Spieler die an E-Sports Turnieren teilnehmen.\n\nIm Prinzip machst du das gleiche was alle anderen auch machen . Du Grenzt ab . Wie du das machst ist deine Sache. Da es aber auch e-turniere für Bronze zb gibt ist es im Prinzip fast schon dumm zu sagen das diese Spieler High-Elo sind nur weil die an einem Turnier teilnehmen . Das macht halt einfach absolut keinen Sinn.  Oder wenn du jetzt nen Challenger für Low -Elo hälst weil er nicht an Turnieren teilnimmt i mean ist zwar deine Meinung aber der Sinn ist einfach gegen 0.\n\n\n\n> Aber überlegt mal auch sehr viele von euch machen sich über \"Low-Elo\" lustig. Aber wenn ihr euch über die Lustig macht wie Fühlen die sich ? Wie habt ihr euch damals gefühlt wenn ihr als \"Low-Elo\" beleidigt wurdet ? Ich verabscheue sowas und hab darunter auch viel zu Leiden auch wenn ich das hier nicht wirklich gut ausdrücken kann.\n\nIch mach mich an für sich nie über Low-Elo lustig an sich denn jeder ist mal angefangen oder hat keine Zeit um diese hier reinzustecken. Wenn ich aber sehe das Dia 4 Spieler Spiele abschneiden mit 0:20:3 dann bezeichne ich den durchaus mal als Low-Elo-Spieler weil mit diesen Stats hat er nunmal wirklich nichts dort zu suchen. Wenn jetzt aber jemand in Bronze ist und 0:20:3 geht omg shit happens. Es ist ein Ranglisten-system aber was mich absolut ankotzt sind einfach Spieler die wesentlich höher in der Rangliste stecken aber schlechter spielen als Leute die wesentlich tiefer stecken. Low-Elo ist nicht zwingend ein begriff der benutzt wird um leute in tieferen Ligen fertig zu machen finde ich  sondern eher um höhere Ligen zu blamen. Es ist einfach ne art Meme.\n\n> Vielleicht sind meine \"Schubladen\" viel zu groß aber wenn mal ein Ranked von irgendwem egal welche elo ob hoch oder niedrig und dann die E-Sports Spiele vergleicht für mich sind das zwei verschiedene Welten. Das wars erstmal zu dem Thema denkt einfach mal darüber nach.\n\nDas ist auch ganz einfach zu erklären. im E-Sport trainieren diese Teams oft monatelang im Akkord um die Herausforderungen zu meistern . Die gehen jeglich erdenkliche Kombination durch was diese um einiges besser macht. Im SoloQ bist du eben alleine , hast keine Kommunikationsmöglichkeit außer den Chat (Der zu lange brauchen würde um alles abzusprechen) und hast niemals zusammen trainiert im schlimmstfall . Dementsprechend fällt das Gameplay auch deutlich anders aus . Heißt aber lange nicht das diese Spieler schlecht sind zumal fast jeder Challenger in irgendeiner Form im E-Sport vertreten ist.\n\n\nZu deinem 2. Punkt muss ich ganz klar sagen das ist das System komplett unterstütze , ich würde mir lediglich wünschen das andere Vergehen in League die wesentlich härteren einfluss haben genauso oder noch stärker bestraft werden wie Flame.\n\n> Außerdem ist es nur ein Game wer es so ernst nimmt das er Tastatur Maus etc zerstört sollte sich ein neues Hobby suchen.\n\nDas stimmt eben nicht. Es gibt Leute die haben dieses Spiel zu ihrem Beruf gemacht. Viele haben sich u.a auch ein Image dazu aufgebaut wozu bei gewissen Leuten das zerstören von Eigentum zählt. Vielleicht gibt es dementsprechend auch Leute die genau das gleiche Ziel verfolgen . Das hobby zu ihrem Beruf machen. Vielleicht wollen die also dementsprechend auch ein gleichwertiges Image aufbauen oder aber die sind frustriert weil sie das Ziel nicht erreichen mit jedem weiteren Fehler den die machen. Kaum wer würde jemandem zusehen der zb  in Bronze spielt da sich eine Community über das gleiche Thema unterhalten möchte nämlich über League of Legends. Ein Bronze-Spieler kann bei diesem Thema kaum mithalten wodurch ein Stream unattraktiv wird. Ein gewisser Standart ist einfach notwendig und je länger es dauert den zu erreichen desto getilteter .\n\nPunkt 3 ist zwar deine Meinung , viele würden dir hier aber nur zum Teil zustimmen. Der erste Teil dieses Punktes stimmt natürlich vollkommen\n\nder 2. Punkt ist zum Teil berechtigt. Ja wir würden es nicht hinkriegen das Spiel und die Community Fehlerfrei zu verwalten . Wir haben aber auch keine 3 91293219231921392139 angestellte die das tun und dafür bezahlt werden. Die Leute werden gerade für diese Fähigkeiten eingestellt und wenn es dann immer noch nicht klappt und häufig zu Komplikationen kommt dann bekommt man als Community nicht das Gefühl das dieses Spiel verwaltet wird. Immer noch unzählige Bugs im Client zb , Es wird nicht einmal wirklich versucht das zu fixxen oder gravierende Bugs beim Patchen die eine neuinstallation des spiels fordern oder sogar das abwarten des nächsten Patches. Solche Bugs müssten doch an für sich als hotfix entfernt werden vor allem wenn man abteilungen hat die nur auf das spezialisiert sind und vor allem mitarbeiter die dafür gut bezahlt werden. Natürlich ist es eine art zweischneidiges schwert. Ich finde man sollte Riot loben für die guten Dinge genau so wie man schlechte Dinge kritisiert. Allerdings fehlt generell die Kommunikation zur Community , von schwerwiegender häufiger Kritik wird der Schluss gezogen das man genau das Gegenteil umsetzen müsste ( Stichwort Pyke-Buff Kappa) und noch viele anderen kleinen Dinge. Was ich aber am schlimmsten finde sind einfach die Dinge die  von Riot entweder komplett unbeantwortet bleiben trotz aufkommender Kernproblematik oder als falsch bzw als Fehler des Nutzers dargestellt werden und das kommt in den letzten Monaten vermehrt vor. Das finde ich geht einfach gar nicht und so etwas ist schlichtweg desinteresse gegenüber der Community. Soll man Riot dafür dann etwa loben? ","replies":[]},{"poster":"Yuiwara","date":"2019-11-05T19:49:54.331+0000","up_votes":2,"down_votes":2,"body":"Low elo und high elo sind nichts wertendes (zumindest für mich nicht). es sind nur beschreibende begriffe für elobereiche. Nicht jeder spieler im low elo bereich ist schlecht und nicht jeder im high elo gut.\n\nNatürlich gibt es leute, die die begriffe abwertend benutzen oder auch begriffe wie silber oder bronze spieler abwertend einsetzen, aber ehrlich lass die idioten reden...meld sie und fertig ist.","replies":[]}]}