{"poster":"Thomas14091","date":"2015-04-25T18:21:48.738+0000","title":"HILFE!","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo Riot .\r\n\r\nIch hab mir vor ein paar Tagen Riot Punkte im Wert von 5 &euro; gekauft, weil ich mir bald einen Skin kaufen wollte. Jetzt stellte ich fest, dass diese Weg waren. Nach langem R&auml;tseln und verzweifeln entdeckte ich, dass ich angeblich einem gewissen FearX97 2 Skins und eine LCS 2015 TIP(ka was des ist) geschenkt hab. Aber ich hab das zu 100% nicht gemacht. Daraus schlussfolgerte ich , dass er meinen Account gehackt haben muss. Hiermit bitte ich euch diese Geschenke irgendwie r&uuml;ckg&auml;ngig zu machen. Vielen Dank","replies":[{"poster":"Veezey","date":"2015-04-25T18:36:39.509+0000","up_votes":1,"down_votes":0,"body":"Ahja. Man muss doch erst eine gewisse zeit befreundet sein, damit man etwas schenken kann.","replies":[{"poster":"Red Mage","date":"2015-04-25T19:02:15.490+0000","up_votes":1,"down_votes":0,"body":"nein, co-op spielen miteinander und dann end of game gifting nutzen, geht auch ohne dabei freunde zu sein","replies":[]}]},{"poster":"Donzen","date":"2015-04-25T18:33:04.384+0000","up_votes":1,"down_votes":0,"body":"Also erstmal pack den Namen aus dem Forum, denn es ist verboten Namen zu nennen und wenn du gehackt worden bist dann änder erstmal dein Passwort und wende dich bitte an den Riot-Support, denn die Riot-Mitarbeiter sind die einzigen, die dir bei solchen Problemen helfen können, da nur diese auf deinen Account zugeifen können.\nMfG Donzen\n\nEdit:\nHier der Link zum Support: [>>Klick Mich<<](https://support.riotgames.com/hc/de)\nNachweis, dass du den Namen nicht nennen darfst:\n> Andere Spieler melden\nBitte meldet einen möglichen Fall von Fehlverhalten eines Spielers nicht in diesen Foren. Wenn ihr mitbekommt oder hört, dass eine andere Person gegen die Regeln verstößt, nutzt die Report-Funktion oder schickt uns ein Ticket, so dass wir den Vorfall untersuchen und entsprechend vorgehen können. Wir wissen, dass Spieler andere mit besten Absichten öffentlich anzeigen, aber oftmals führt das nur zu Hexenjagden und kaum jemals zu positiven Diskussionen. Wir werden Maßnahmen gegen Spieler ergreifen, die gegen Regeln verstoßen haben, also meldet diese Spieler bitte auf korrekte Weise.\n>\nModeratoren halten nach Folgendem Ausschau:\n● Beiträge, die andere Spieler des miesen Verhaltens im Spiel bezichtigen\n● Beiträge, in denen anderen böswilliges Verhalten vorgeworfen wird\n● Beiträge, in denen anderen Cheaten, Betrügen oder die Inanspruchnahme unerlaubter Dienstleistungen vorgeworfen wird\n● Beiträge, in denen Anderen Rumtrollen in Foren vorgeworfen wird (dafür gibt es die Meldefunktion)\n\nQuelle: http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/NAoZxZxA-allgemeine-regeln\n","replies":[]},{"poster":"Thomas14091","date":"2015-04-25T18:26:14.559+0000","up_votes":1,"down_votes":0,"body":"OK. Er hat grad zurück geschrieben, dass er meinen Account nicht gehackt hat, aber ich glaub ihm nicht. Ich denke jeder würde es abstreiten.","replies":[]}]}