{"poster":"Lika SunRyze","date":"2016-08-15T22:44:25.867+0000","title":"League FPS drops (Help!)","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"So windows 8 worked perfect for me then i upgraded to 8.1 where i got BugSplat errors so i factory reset back to 8 where i got d3dx9_39.dll is missing which i fixed but downloading a package from microsoft.\r\n\r\nHowever now i can play fine but i get fps drops/freezes and if i dont connect to an ethernert cable i get 600+ ping.\r\n\r\nI have already tried updating my drivers.\r\n\r\nHope you can help, Thanks in advance","replies":[{"poster":"Lika SunRyze","date":"2016-08-24T12:00:39.789+0000","up_votes":1,"down_votes":0,"body":"Thank for the help guys my fps is fixed now! yay\ni reinstalled the game and it seemed to work just fine.","replies":[]},{"poster":"SephirothSG","date":"2016-08-17T07:04:22.413+0000","up_votes":1,"down_votes":0,"body":"Hey there,\n\nHave you tried reinstalling your network drivers?\n\nRegarding your FPS drops, you said you've tried updating your drivers but have you tried rolling them back? It's possible a newer driver version might be causing you issues.","replies":[{"poster":"         Swhyper","date":"2016-08-24T07:10:33.675+0000","up_votes":1,"down_votes":0,"body":"SephirothSG's statement on the new driver could be causing the issue is also believable/truth. If this was the case I would suggest you to try up my method first of downloading the fix tool from Microsoft http://ccm.net/download/download-14957-microsoft-fix-it and then if the issue continues, roll back to a older version of the driver. Let me know if you need help rolling back to an older driver as I am happy to help :).","replies":[]}]},{"poster":"         Swhyper","date":"2016-08-24T07:07:33.357+0000","up_votes":1,"down_votes":0,"body":"Hi friend :) ,\n\nI think your PC may be corrupted or that the registry's might have been damaged. I would suggest you to download this and run it and see if this helps :). \n\nhttp://ccm.net/download/download-14957-microsoft-fix-it","replies":[]}]}