{"poster":"Welpe21","date":"2017-12-28T11:57:32.339+0000","title":"Ranked / zuviele Feeder unterwegs","subforum":"Ligen & gewertete Spiele","up_votes":3,"down_votes":4,"body":"Hi,\r\n\r\nan was kann es liegen das man eig. bei fast jeden 2. Spiel einen Feeder im Team hat?\r\n\r\nUm aufzusteigen in Silver 4 m&uuml;sste ich die 3 Spiele gewinnen. Da schrieb ich schon zu meinem Bruder das ich bestimmt am Ende bei 0 LP bin. Und siehe da? 0 LP.\r\n\r\nWenn man am Ende 1/5 oder so hat aber richtig mitspielt habe ich ja nichts dagegen. Aber da hat man welche im Team die versuchen den anderen Altar zu holen obwohl man selber ewig weit weg ist und von den Gegner noch alle leben.\r\n\r\nLiegt es daran das Vorsaison ist? Weil so macht es keinen Spa&szlig; mehr.","replies":[{"poster":"MrJon Stark","date":"2017-12-28T12:00:38.852+0000","up_votes":1,"down_votes":4,"body":"Junge ich stimme dir so zu man ich kriege jedes game JEDES GAME man muss nur einmal in meinen verlauf gucken und du findest feeder","replies":[{"poster":"OT Riku","date":"2017-12-28T12:53:07.343+0000","up_votes":5,"down_votes":0,"body":"Ja wenn du in deinen Games feedest das kein Wunder.\n","replies":[{"poster":"Oriius","date":"2017-12-30T00:00:34.527+0000","up_votes":1,"down_votes":0,"body":"xd mademyday","replies":[]},{"poster":"CarminesStar","date":"2017-12-29T11:04:07.461+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=OT Riku,realm=EUW,application-id=ip27PlEH,discussion-id=b3vAVgEI,comment-id=00000000,timestamp=2017-12-28T12:53:07.343+0000)\n>\n> Ja wenn du in deinen Games feedest das kein Wunder.\n\nXD Sry, but it was a good one.","replies":[]}]}]},{"poster":"Oriius","date":"2017-12-30T00:32:27.139+0000","up_votes":1,"down_votes":3,"body":"Ich sags mal so ..... feeder habe ich in silber wirklich SOGUT wie nie . hab vllt wirklich alle 50 Games der wirklich feedet und feeden ist eben für mich wenn jemand bewusst seine kda runterzieht. Alles andere sind vielleicht leute die schlecht spielen oder sich aufopfern damit das Team draufballern kann.\n\nIch finde die afks dort viel schlimmer ^^ \n\nIch freue mich aber für die Leute die dieses Pech nicht haben. Es ist ziemlich frustrierend ^^\n\nIn Aram Master mmr in Normals Dia 1-master mmr und selbst in rankeds gewinne ich zwischen 30 und 35 lp wodurch ich bei einem promosieg sogar bereits divisionen überspringen würde, aber rauskommen kann man ja dann leider doch vergessen als supporter :3  Finde ich schade das ich champs/positionen spielen muss die ich nicht möchte nur um aufzusteigen damit ich selber den sieg herbeiführen kann. Als supporter in s4 kann man das ja leider recht häufig vergessen.\n\nMache zwar auch noch viele Fehler aber ich habe mich innerhalb der letzten paar monate um mindestens 2 Elos verbessert (was die auf einmal wesentlich stärkeren Gegner plausibel macht) und dann aufgrund der naja teils schlechten Teammates wobei schlechte Teammates eher seltener ,sowie afk spielern keinerlei fortschritt zu bemerken außer der hidden elo ist für mich mehr oder weniger eine empfundene ungerechtigkeit. Wenn ich wirklich nach silber gehören würde dann hätte ich wesentlich weniger lp zuwachs und wesentlich schwächere gegner als mittlerweile regelmäßige high dias und je nach dem ob ich mal ne winningstreak habe auch ganz selten mal gegen nen master/challenger.\n\nZudem habe ich halt ein sehr großes Ego und dann immer als S4 spieler anzukommen der gegen high dia spielen darf klingt für leute ziemlich unglaublich und das ist es für mich selber eigentlich auch, aber irgendwann achtet man da einfach drauf weil man meinen sollte das man nach 3k Games mehr doch mal langsam wenn auch nur eine division höher sein sollte. dann schau ich auf einmal regelmäßig meine gegner an und merke ja gg da dia 2 da dia 1 da master oh nice ich durfte sogar schon gegen challengergegner spielen. Wie viele silber spieler können behaupten gegen challengers gequeued zu werden? ich denke nichtmal 2 stellig.\n\nAuch wenn man hier wieder behaupten kann das man aufsteigt wenn man wirklich besser spielt oder das es keine elohell gibt es ist einfach nur reiner optimismus. Ich finde schon das die Elohell irgendwo teilsexistent ist jedoch muss man sich hier fragen was für jemanden die Elohell genau bedeutet.\nIst es der Punkt an dem dein Skillcap erreicht ist? Oder ist es wirklich aufgrund unbeeinflussbarer Ereignisse für jemanden eine Elohell.\n\nja ich würde sagen definitiv ist mein Skillcap aktuell erreicht an dem Punkt wo ich zwischen Dia1/Master gegnern schwanke ist meine stärke für den Moment aufs Vollste ausgereizt. Empfinde ich daher die Silberelo als Elohell ? nein  da ich zwar mein Skillcap erreicht habe, ich aber gegen die in Ranked zugeteilten Gegner selber problemlos ankomme. Die Elohell ist für mich existent wenn man wirklich aufgrund selber unbeeinflussbaren Ereignissen endlos in dieser Elo gefangen ist worunter eben afks/Trolls zählen. Hier kann man einfach nicht sagen das jeder selbst fürs versagen verantwortlich ist. Ich finde halt das man gegen solche Regelverstöße wesentlich aktiver vorgehen MUSS denn sonst kann man das Ranked-System auch ganz sein lassen und einzig & allein ein Gruppenranked einführen wo nur 5er Gruppen teilnehmen dürfen.","replies":[{"poster":"Pure Cynicism","date":"2017-12-30T20:02:03.071+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Oriius,realm=EUW,application-id=ip27PlEH,discussion-id=b3vAVgEI,comment-id=0005,timestamp=2017-12-30T00:32:27.139+0000)\n>\n> ja ich würde sagen definitiv ist mein Skillcap aktuell erreicht an dem Punkt wo ich zwischen Dia1/Master gegnern schwanke ist meine stärke für den Moment aufs Vollste ausgereizt. Empfinde ich daher die Silberelo als Elohell ? nein  da ich zwar mein Skillcap erreicht habe, ich aber gegen die in Ranked zugeteilten Gegner selber problemlos ankomme. Die Elohell ist für mich existent wenn man wirklich aufgrund selber unbeeinflussbaren Ereignissen endlos in dieser Elo gefangen ist worunter eben afks/Trolls zählen. Hier kann man einfach nicht sagen das jeder selbst fürs versagen verantwortlich ist. Ich finde halt das man gegen solche Regelverstöße wesentlich aktiver vorgehen MUSS denn sonst kann man das Ranked-System auch ganz sein lassen und einzig &amp; allein ein Gruppenranked einführen wo nur 5er Gruppen teilnehmen dürfen.\n\nDas ist so ein Bullshit. Ein Master-Spieler würde in Silber 1-5 gewinnen, ein 4-5 ist für ihn immer noch ein Spaziergang. Wenn dein Skillcap wirklich Dia1+ wäre, dann spiel mal eine Runde SoloQ und stompe deine Gegner so richtig weg. Gerne auch in einem 5-5. Solange das nicht passiert, kannst du dir gerne einreden, du seist ein Masterspieler, der in Silber feststeckt. Wie plausibel das ist, musst du dann selbst wissen.","replies":[]},{"poster":"Sirrkas","date":"2018-01-02T11:36:26.432+0000","up_votes":2,"down_votes":0,"body":"Ich hoffe dir fällt irgendwann auf, wie verzerrt deine Wahrnehmung ist. Jedes mal, wenn du behauptet hast, gegen Master und Dia 1 zu spielen, habe ich in deinen Spielverlauf gesehen. Da war nie ein Anzeichen von Master und Dia 1 zu erkennen. Lediglich ein paar Siege im ARAM gegen Dia 5 lassen sich dann finden. Aber auch die sind da selten.\n\nDas Problem daran ist dann, dass du nicht weißt, auf welcher Wertung du bist. Die Diaspieler können auch einfach Platin MMR im ARAM und Normal haben. \n\nAls ich mal mit meinen Freunden ein 3er Rankedteam aufgemacht habe, haben wir da auch Platin- und Diagegner gestompt, laut einem war das höchste sogar 2 mal Dia 1 mit einem Challenger bei den Gegnern. Dadurch waren wir aber nicht auf Challengerniveau im 3vs3. Das war lediglich der Rang der Gegner im Soloranking. Man hat da auch gut gemerkt, dass die das Spiel nicht so wirklich ernst genommen haben und dazu wohl die Karte nicht so gut kannten. Die haben ein paar Noobstomper wie Yi und Trynda gespielt und waren damit unserer Teamfightkombo unterlegen. \n\nUm noch mal zu betonen, dass man durch so ein Spiel nicht auf Challenger Niveau ist: Später haben wir dann gegen richtige, ebenbürtige Gegner antreten dürfen. Die waren Gold in SoloQ und im 3vs3. Wir hatten also eine Goldwertung. Der Challenger mit seinen Diakumpels hat im 3vs3 also nur wie Silber gespielt.","replies":[]}]},{"poster":"Maexle","date":"2017-12-28T13:31:53.677+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Welpe21,realm=EUW,application-id=ip27PlEH,discussion-id=b3vAVgEI,comment-id=,timestamp=2017-12-28T11:57:32.339+0000)\n>\nDa schrieb ich schon zu meinem Bruder das ich bestimmt am Ende bei 0 LP bin. Und siehe da? 0 LP.\n> \n>\n\nGute Einstellung {{sticker:slayer-pantheon-thumbs}} \n{{champion:17}}","replies":[{"poster":"Welpe21","date":"2017-12-28T13:54:37.766+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Maexle,realm=EUW,application-id=ip27PlEH,discussion-id=b3vAVgEI,comment-id=0002,timestamp=2017-12-28T13:31:53.677+0000)\n>\n> Da schrieb ich schon zu meinem Bruder das ich bestimmt am Ende bei 0 LP bin. Und siehe da? 0 LP.\n> \n> Gute Einstellung {{sticker:slayer-pantheon-thumbs}} \n> {{champion:17}}\n\n\nDies war mein Gefühl aber nicht meine Einstellung :)","replies":[]}]},{"poster":"Welpe21","date":"2018-01-02T21:02:30.811+0000","up_votes":1,"down_votes":3,"body":"Soll ich jetzt jeden Feeder  hier kommentieren?^^\n\nDas lustigste heute war eine Zoe in meinem Team. Der habe ich versucht zu erklären wie man Q richtig benutzt.\n\nWeil die hat Q nie \"aufgeladen\" sondern ist direkt auf den Gegner drauf. Dementsprechend hatte Sie nach 35 min 66 Vasallen und 5/18 .^^","replies":[{"poster":"Nordwolf87","date":"2018-01-03T12:21:11.222+0000","up_votes":3,"down_votes":0,"body":"Falls das auf meinen kommentar bezogen war: nein es ging mir eher darum, dass der mensch die eigenheit hat sowas nur im eigenen team wahrzunehmen. In meinen Beispielen (kayn und ekko) wurdest du/ihr von den gegnern gefeedet, aber das nimmt man nicht so wahr und denkt nur zu gerne, dass man so gut ist ;)","replies":[]},{"poster":"Sirrkas","date":"2018-01-02T21:25:16.333+0000","up_votes":2,"down_votes":0,"body":"Und direkt danach hast du Zoe gespielt und warst auch sehr schwach im Vergleich zum Rest deines Teams.","replies":[]}]},{"poster":"Untouchable ProX","date":"2017-12-28T12:16:11.638+0000","up_votes":2,"down_votes":1,"body":"Erstaunlich... \n\nWundert mich dass immer nur ein kleiner Teil über sowas \"jammert\".\nDie anderen kommen da locker flockig aus der ELO raus.\n\nHab mein smurf von s5 auf G3 in drei Tagen gespielt. Hatte nicht ein Freder oder Troll, weder im eigenen noch Gegnerteam..\n\nWunder mich immer wie diese \"Statistiken\" von wegen \"min jedes zweite Team ein Freder\" zustande kommen.\n\nWer schon von vornherein mit der Einstellung ins Spiel geht \"wird doch eh nichts, einer verbockts\" hat schon den ersten Fehler gemacht.","replies":[{"poster":"Herr Hübsch","date":"2017-12-28T13:27:54.695+0000","up_votes":1,"down_votes":0,"body":"ist in der tat erstaunlich, wo doch alle sagen das silvers schlecht spielen und normal oft feeden wodurch sich ja zeigt das sie in diese\"elo\" gehören o.0","replies":[{"poster":"Cenâreth","date":"2018-01-03T21:43:28.178+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=BreakYourHeadxD,realm=EUW,application-id=ip27PlEH,discussion-id=b3vAVgEI,comment-id=00010002,timestamp=2017-12-28T13:27:54.695+0000)\n>\n> ist in der tat erstaunlich, wo doch alle sagen das silvers schlecht spielen und normal oft feeden wodurch sich ja zeigt das sie in diese&quot;elo&quot; gehören o.0\n\nVollkommener Quatsch die spielen in Plat/Dia genauso schlecht wie in Silver. Schau dir div. Streams mal an. Der Unterschied liegt darin dass da oben Meta gespielt wird.","replies":[{"poster":"Sirrkas","date":"2018-01-03T21:49:34.798+0000","up_votes":1,"down_votes":0,"body":"Dann solltest du doch eigentlich keine Probleme haben, Dia 1 zu erreichen. \n\nZudem widerspricht deiner Aussage, das Onetrickponies auch ins mittlere Dia kommen und das mit Champions, die nicht in der Meta sind.","replies":[]}]}]},{"poster":"Welpe21","date":"2017-12-28T13:14:21.413+0000","up_votes":1,"down_votes":0,"body":"Mit der Einstellung gehe ich nie in ein Spiel rein. Selbst wenn zwei von meinem Team auf einer Lane sind und der Jngl quasi offen ist. \n\nDa versuche ich so gut es geht meine Lane zu verteidigen und den anderen Jngler das Leben schwer zu machen.\n\nBloß schau dir mein Spielverlauf mal an.\n\n\nIch habe in meinem Team und im anderen Team immer wieder Feeder. Ich hoffe meine Reports bringen etwas.\n\n\nSowas macht für mich den Spielspass kaputt. Wenn der Gegner nicht mal versucht dich im seinen Dschungel am farmen zu hintern und du hast Master Yi, da ist nur eine Frage offen: Wann gewinnst du?\n\nKeine Ahnung wie du es siehst aber so macht es keinen Spaß.","replies":[{"poster":"Cenâreth","date":"2018-01-03T21:42:26.265+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Welpe21,realm=EUW,application-id=ip27PlEH,discussion-id=b3vAVgEI,comment-id=00010001,timestamp=2017-12-28T13:14:21.413+0000)\n>\n> Mit der Einstellung gehe ich nie in ein Spiel rein. Selbst wenn zwei von meinem Team auf einer Lane sind und der Jngl quasi offen ist. \n> \n> Da versuche ich so gut es geht meine Lane zu verteidigen und den anderen Jngler das Leben schwer zu machen.\n> \n> Bloß schau dir mein Spielverlauf mal an.\n> \n> \n> Ich habe in meinem Team und im anderen Team immer wieder Feeder. Ich hoffe meine Reports bringen etwas.\n> \n> \n> Sowas macht für mich den Spielspass kaputt. Wenn der Gegner nicht mal versucht dich im seinen Dschungel am farmen zu hintern und du hast Master Yi, da ist nur eine Frage offen: Wann gewinnst du?\n> \n> Keine Ahnung wie du es siehst aber so macht es keinen Spaß.\n\nWas soll ich sagen, dass Demote Shield ruiniert deine komplette mmr und dann kommst du nur noch schwer raus. dito hier.","replies":[]},{"poster":"Untouchable ProX","date":"2017-12-29T23:53:00.055+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Welpe21,realm=EUW,application-id=ip27PlEH,discussion-id=b3vAVgEI,comment-id=00010001,timestamp=2017-12-28T13:14:21.413+0000)\n>\n> Mit der Einstellung gehe ich nie in ein Spiel rein. Selbst wenn zwei von meinem Team auf einer Lane sind und der Jngl quasi offen ist. \n> \n> Da versuche ich so gut es geht meine Lane zu verteidigen und den anderen Jngler das Leben schwer zu machen.\n> \n> Bloß schau dir mein Spielverlauf mal an.\n> \n> \n> Ich habe in meinem Team und im anderen Team immer wieder Feeder. Ich hoffe meine Reports bringen etwas.\n> \n> \n> Sowas macht für mich den Spielspass kaputt. Wenn der Gegner nicht mal versucht dich im seinen Dschungel am farmen zu hintern und du hast Master Yi, da ist nur eine Frage offen: Wann gewinnst du?\n> \n> Keine Ahnung wie du es siehst aber so macht es keinen Spaß.\n\n\nIst ja alles richtig...\nAber das Problem ist (auch wenn es jetzt sich erstmal doof oder so anhört) in der Solo Q und vorallem im low elo Bereich, wenn du verlierst (und das oft) such die Fehler nicht bei anderen.\nEs ist egal ob jemand feedet, trollt oder afk ist. Sowas passiert, auch in der High elo.\nBist du aber gut genug um auszusteigen und beherrscht somit deine Champion, wirst du auf lange Sicht immer aufsteigen.\n\nIch hab die Erfahrung gemacht, dass viele durch trolls ec prinzipiell eine negative Einstellung haben. Auch wenn man es nicht zu gibt, innerlich ist man mad. Und bei den kleinsten Anzeichen von feed oder so, schaltet man schon wieder ab.\n\nIch spiele immer so: Selbst wenn jemand feedet, gebe ich mein besstes - man lernt nie aus. Irgendwann bist du einfach besser als die anderen und carrys dann auch mal ein gefeedetes Spiel.\n\nKlingt alles immer so ''simpel'' und hört man oft.\nAber es ist wahr.\n\nKenne soviele Spieler die behaupten immer ihr besstes zu geben und dergleichen, aber einfach schon beim First-blood des gegnerischen Team das Spiel innerlich abhaken.\n\nIch spiele, wenn es denn mal passiert, nach einer loos-Serie einfach was anderes. Komplett weg von Lol.\n\nMit diesen Worten, wünsche ich noch ein guten Schrutsch und hoffentlich eine schöne neue Season.\n\nLg","replies":[]}]},{"poster":"MrJon Stark","date":"2017-12-28T12:29:57.898+0000","up_votes":1,"down_votes":4,"body":"junge was bist du eigentlich für ein alman ?","replies":[{"poster":"Qbert","date":"2018-01-02T11:42:19.211+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MrJon Stark,realm=EUW,application-id=ip27PlEH,discussion-id=b3vAVgEI,comment-id=00010000,timestamp=2017-12-28T12:29:57.898+0000)\n>\n> junge was bist du eigentlich für ein alman ?\n\nWas ist das bitte für ein dummer Satz?\n\n\"junge was bist du eigentlich für ein deutscher(alman)?\" .... soll das etwa eine Beleidigung sein?\nDu bist echt eine Schande für jeden in Deutschland Lebenden mit türkischen Wurzeln.","replies":[{"poster":"eingew","date":"2018-01-02T14:20:26.235+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=ip27PlEH,discussion-id=b3vAVgEI,comment-id=000100000000,timestamp=2018-01-02T11:42:19.211+0000)\n>\n> &quot;junge was bist du eigentlich für ein deutscher(alman)?&quot; .... soll das etwa eine Beleidigung sein?\n\nAlso wenn du mich fragst ist das ganz klar ein Kompliment aus Neid.","replies":[{"poster":"Qbert","date":"2018-01-02T14:27:13.395+0000","up_votes":1,"down_votes":0,"body":"Könnte man tatsächlich auch so interpretieren :D\n\nAber meist ist der Hinweis auf eine Nationalität kein Kompliment. Im Deutschen kommt so etwas ja oft einher mit dem Wort \"typisch\".\nBspw. \"Typisch Franzosen, können alle kein Englisch\".^^","replies":[{"poster":"eingew","date":"2018-01-03T18:44:56.269+0000","up_votes":1,"down_votes":0,"body":"Naja ich glaube auch eigentlich nicht, dass MrJon Stark (jetzt hätte ich doch glatt Snow geschrieben) es tatsächlich positiv meint. Bloß anstelle von TX Xerxes würde ich es dennoch als Kompliment nehmen, weil ich glaube dass MrJon Stark auf sein Selbstvertrauen und Vertrauen in die Fairness des Systems neidisch ist.","replies":[]}]}]}]}]}]},{"poster":"Welpe21","date":"2018-01-23T09:53:35.317+0000","up_votes":1,"down_votes":1,"body":"So Leute...\n\nNeue Saison neues Glück. Leider scheinbar nicht mit mir. Wenn man sich meine Stats anschaut dann denkt man \"Krass der hat von den letzten 20 Spielen bestimmt 16 gewonnen.\" Leider genau andersrum. 12 Verloren und 8 Gewonnen. Scheinbar je guter man wird desto öfters bekommt man dann gefühlt die Afkler und Feeder ins Team. Klar hat der Gegner auch manchmal die Probleme. \n\nAber mich fragen die Gegner schon ob es mein Smurf Acc ist. Teilweise haben die sogar Mitleid und versuchen mich aufzubauen weil ich der einzige gute in meinem Team war.\n\nVielleicht versuche ich es mit einem neuen Acc. Weil aus Bronze rauszukommen ohne einen 2. guten Spieler ist sehr schwer.","replies":[{"poster":"Angel Ayume","date":"2018-01-23T20:19:06.038+0000","up_votes":1,"down_votes":0,"body":"Gute Stats alleine reichen aber oft nicht. \nNein, damit meine ich nicht, dass du auch gute Teammates haben musst. ^^ \nIch kann am Ende 21/3 stehen und dennoch das Game verlieren und das liegt sicher nicht nur an den Teammates die vllt schlechter stehen als man selbst. ^^\n\nEdit: Du spielst auch offenbar Champions, die dir nicht besonders gut liegen, denn du hast auf allen eine ziemlich schlechte Winrate. Lass lieber die Finger von Zoe, scheinbar ist sie noch zu schwer für dich um sie im Ranked zu spielen. Yasuo scheint dir auch nicht besonders gut zu liegen, auch wenn du da noch nicht so viele Spiele drauf gespielt hast. \n\nWenn du aufsteigen willst, dann spiele nur einen einzelnen Champion den du wirklich gut kannst. \nAnnie ist einfach und empfiehlt sich da am Besten. Sie ist schnell zu lernen und selbst wenn du nicht gut im Game stehst, kannst du mit einer gut gesetzten Flash>Ult einen Teamfight entscheiden und eventuell sogar das Game. \n\nMalzahar könntest du auch versuchen. Er ist momentan ziemlich stark und seine Ultimate kann auch vieles entscheiden. Er hat seine Passive mit der du eventuell einem Stun oder dergleichen ausweichen kannst und somit einen Positioningfehler von dir verzeiht. \n\nMorgana wäre ansich auch ein sicherer Pick. Sie hat ihr Spellshield und kann dich aus so manch gefärhlicher Situation retten. Zudem ist sie dadurch schwer zu ganken, da du, wenn du schnell genug reagierst, nicht gestunned oder dergleichen werden kannst. Und eine Q+W kann einen Adc im Lategame ziemlich schnell von 0 auf 100 töten. \n\nUnd noch zuletzt ein gut gemeinter Tipp: Gewöhn dir an mehr zu warden. Du wardest extrem wenig, sogar als Support. \nIch hab jetzt nicht geschaut, ob du Pinkwards setzt, aber gewöhne dir auch da an, dass du immer einen auf der Map stehen hast und wenn keiner mehr da ist, dann kaufst du einen neuen und placed ihn neu. Solltest du glauben, dass ein Ward in der nächsten Zeit zerstört werden wird und du grade in der Base bist, dann kaufe ruhig einen neuen Pinkward auch wenn der andere noch steht. :) \n\nEdit 2: Und du musst lernen, besser zu last hitten. Dein Farm ist oft nicht sehr gut. Einmal hast du obwohl du ziemlich gefeedet warst nur 97 CS bei Minute 28 gehabt. DAS ist richtig schlecht. Also als 2. Tipp: Achte darauf, dass du die Minions auch last hittest. :) ","replies":[]}]},{"poster":"Nordwolf87","date":"2018-01-02T09:47:29.376+0000","up_votes":1,"down_votes":0,"body":"Aber über den gegnerischen kayn (9 tode) der in deinem yasuo match gefeedet hat oder den gegnerischen ekko (9 tode) der in deinem zoe spiel gefeedet hat beschwerst du nich nicht? Komisch...","replies":[]},{"poster":"Welpe21","date":"2017-12-28T20:34:06.687+0000","up_votes":1,"down_votes":0,"body":"https://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3474178224/36330031?tab=overview\n\n\nIst das noch normal?","replies":[]},{"poster":"AceLaughUpdate","date":"2017-12-28T17:34:23.644+0000","up_votes":1,"down_votes":1,"body":"alles unter Master ist müll abfall {{champion:17}}","replies":[]}]}