{"poster":"Aesthetic Curse","date":"2015-05-24T02:12:19.707+0000","title":"@RiotLyte and any other members of the behavioral team","subforum":"[ARCHIVED] General Discussion","up_votes":3,"down_votes":4,"body":"I just received a 14 day ban over one match. I don't get it. I was frustrated because my team refused to listen to me and did nothing but die in lane and then proceed to not take objectives without me spamming pings and in caps. Like, I understand I shouldn't call my teammates fucking r%%%%%s, but when they actually should not be in a game type that exists solely to gain rank and WIN GAMES, because they don't have a basic understanding of the concept of this game, then they should be punished for ruining other players games. \r\n~~~~~~~~~~~~~~~~~~~~~\r\ni'm new to ahri\r\nnice please\r\nIt's really not\r\nbut i'm not going to tell you how to play it\r\nNot when there are no tanks on either team\r\ndont make the game salty because you're a metasheep\r\nhow long\r\nsuuuuure\r\nthats fine\r\nno amount of camp will save xerath\r\nxerath you can't let me double your cs\r\nyou dont have a chance in this lane like that\r\nreally\r\nyou didnt smit\r\nyou didnt smite\r\nin otherwords\r\nnext time stand in fromt of the spear\r\nidc if you die for us taking drag\r\ncan you stop feeding so i can carry\r\nits really easy\r\njust dont leave tower\r\nand i'll come kill them\r\nSTAY\r\nUNDER\r\nTOWER\r\nholy fucking shit\r\nget out of ranked\r\nbot\r\nplease\r\nseriously\r\nand most definitely\r\nget out of my lane\r\nright noew\r\ngo bot\r\nfarm\r\nand i'll carry\r\nplease report morgh\r\n-This was a few minutes of bot letting the enemy adc free farm and take a tower at least, and me literally begging them to listen\r\ntroling\r\nxer isnt bar\r\nbad\r\nhe just doesnt know the maatchup like i do\r\nnid please\r\nDO SOMETHING TEAM\r\nTHERE ARE 5 MID\r\nWHAT ARE YOU DOING\r\nPUSH BOT AND TOP{\r\nGO TO YOUR GODDAMN LANES AND PUSH\r\nHOLY SHIT\r\nmorgana\r\nleave\r\nand do not come back\r\nDO YOU SEE ME 3v1'ing?\r\ndo you?\r\nif you just push\r\ni will win you this game\r\n-more pleading\r\npleasse god\r\ngive me strength\r\nFUCKING FIGHT THEM RIGHT NOW\r\nthis team\r\nis giving me a migrane\r\ni dont deserve this loss\r\n-Instagib enemy sivir and lux, team proceeds to run from a leona and xerath who has 11 or 12 deaths and no kills.\r\nwhy should i\r\ni'm trying so hard\r\nplease push side laned\r\ni8'm fucking on my knees beggging you\r\npop\r\njinx can you please\r\nplease\r\npelase\r\nleave my lane\r\nand take bnot\r\nplease\r\nim fucking begging you\r\njust take bot tower\r\nPLEASEW\r\n-final attempt at asking nicely for my team to be useful, after this i'm just pissed that they won't listen to anything\r\nwelcome to silver\r\nwhere the 20-4 ahri doesnt know how to play the game\r\nTHANK YOU\r\nWU DRAG\r\nHEIMER NO\r\nDONT PUSH MID\r\nWHY\r\nINHIB IS DOWN\r\nWHY THROW\r\nWHYYYYYYYYYYYYY\r\nWERE\r\nYOU\r\nMID\r\nAT\r\nALL\r\n-not negative, a legitimate question since heimer got caught out pushing a lane that had no inhibitor, then responded to this question with \"I was looking at another lane\"\r\nTAKE THE FUCKING DRAGON\r\nSOMEONE\r\nFUCKING TAKE THE DRAGON\r\n-I killed the enemy carries, started dragon while low after pinging no less than 15 times, and it took me dying for a teammate to take the objective. Apart from that, chat filter exists, so negative language isn't a real point to ban people on.\r\nSTOP FUICKING PUSHING MID YOU FUCKING IDIOTS\r\nGOD DAMN THIS GAME ISNT THAT AHRD\r\n-at this point, i had taken the enemy inhibitor, but my team just wanted to walk around mid instead of taking baron, or towers\r\ni'm going to get so many reports for harassment\r\nand it's because my team has no business in ranked\r\nit's hard to do\r\nnow we need to group and stop getting caught\r\nmorgana\r\nshield me in every fight\r\nif i go down we lose\r\nreport my team\r\nliterally fuck all of you\r\nreport every person on my team for refusal to communicate and assisting enemy team\r\nno fuck you8\r\nnot a gg\r\nnot even a little\r\nreported\r\n-this is just salt that my team was being stupid.\r\n\r\n\r\nIn this single games chat log, the vast majority of what I was saying was trying to get my team to do anything with the pressure i was applying, and they just didn't. There wasn't an overabundance of me calling my team trash, though I did say a few times that they should not be in ranked, and much of my vulgarity was in an attempt to express my exasperation with their refusal to be in the least bit useful.\r\n\"But it's toxic to tell people they shouldn't play ranked!\"\r\nNo, it actually is not in the slightest toxic to tell people that they should be playing in normals until they understand the fundamentals of the game. Riot does this themselves with the level requirement to play ranked. Sadly, it is undercut by the ability to pay for experience boosts.\r\n So can you please explain to me how me trying to get my team to cooperate and getting increasingly agitated is worthy of a two week ban when it's from one game?\r\nYour report warning says something along the lines of \"we realize players have bad days etc etc.\" Seems a bit hypocritical to punish players for trying to win in a gametype meant to be played to win and becoming agitated in one game.\r\n\r\nThe point i'm trying to make here is that Ranked is an inherently competitive game type. It is meant for players to be competitive. When players are not playing to win, or don't know enough about the game to play to win, they should be punished.\r\nYour current system treats the symptoms of toxicity, not the cause.\r\n\r\nI tried every avenue I knew to get my team to do what I said and win the game, but they just wouldn't do it. Of course that is frustrating. If your subordinate at Riot games did the same to you, you might be punished in some minor way, but he/she would be out of employment for refusal to do their job. The point I'm trying to make is that you can't expect people to remain happy and calm in a competitive game type when they have a team of people who simply shouldn't be in that game type.\r\n\r\nThe best solution to the problem of the community's toxicity is to make ranked solely for people who want to win and climb. Playing ranked \"for fun\" should be a ban-able offense, or at least lead to a ranked restriction. Apart from that, there should be a minimum requirement of normal games before queuing for ranked in the first place, say a thousand. This gives players time to get runes after hitting level 30, familiarize themselves with more in-depth mechanics, learn different matchups, and altogether make ranked a better experience.\r\n\r\nThese two solutions would go much further than this silly automated tribunal at removing toxic players.","replies":[]}