{"poster":"Dragon DisD","date":"2016-08-26T03:11:03.139+0000","title":"Riot, stop punishing me for your garbage client","subforum":"Report a Bug","up_votes":1,"down_votes":0,"body":"Every time I try to play a game of league of legends, I&#039;ve been having a coin flip happen. One side says I&#039;ll be playing league just fine, then the next match I&#039;ll be having the match remade because I can&#039;t connect to the game fast enough.\r\n\r\n    Recently, I decided to uninstall and reinstall league, thinking maybe a couple of things were missing. After the whole deal was done, I launched the game and patched. Hopped into a game and was off trying to play Quinn mid because I like cancer. \r\n\r\n    Except when the game was going into the loading screen, an error popped up telling me I didn&#039;t have cgGL.dlll installed and I would have to reinstall the game. Wow, thanks, not even reinstalling league stops me from crashing and instead created more problems. Not o ly is this a problem that&#039;s been happening before, it&#039;s been getting worse. I really hope the new client works smoother than this, because I&#039;m seriously sick and tired of getting punished for this bull.","replies":[{"poster":"MagicFlyingLlama","date":"2016-08-26T03:22:10.425+0000","up_votes":1,"down_votes":0,"body":"Sounds more like computer issues than LoL issues, missing DLLs after a fresh install suggest some sort of security (shitty antivirus, or badly configured OS) messing with the install.\n\nWhat OS and background programs are involved?","replies":[{"poster":"Dragon DisD","date":"2016-08-26T03:39:55.896+0000","up_votes":1,"down_votes":0,"body":"Viper, though I usually never have a problem with it. It's entirely possible that it might have happened, but I still find it absurd that I would be allowed to queue without the necessary files. I'm already in a low priority queue and now I have to reinstall league in less than 3 minutes if I want to avoid the remake, which is just not even possible.","replies":[]}]}]}