{"poster":"Lyanna","date":"2016-12-07T23:13:03.497+0000","title":"Violencia en LoL","subforum":"Comportamiento del jugador","up_votes":10,"down_votes":4,"body":"Quisiera empezar preguntando si hay alguna forma de saber qué pasa con cada reporte enviado. Porque seamos honestos, todos hemos reportado alguna vez a un pobre hombre que se le cortó la luz y nos hizo perder la partida, o al que salió 0/10/0 bajo la excusa de \"es troll\". **El tema es que hay reportes que me parecen un poco más serios que otros y estaría bueno saber qué es lo que pasa con ellos.**\r\n\r\nConozco mucha gente que ha recibido castigos por afk. Sinceramente, a todos nos molestan, pero **no les parece que actitudes como la xenofobia, el racismo y el machismo son más repudiables?** Al menos a mí me ha tocado sufrir comentarios que, en broma o no, me resultaron de un alto grado de violencia. Un \"_andá a lavar los platos_\" es chocante, es incorrecto y es violento, pero soy una persona razonable. Lo tomo como lo que es: un simple comentario. Puede ser en broma o por un momento de enojo, lo entiendo. Pero de ahí a meterse con una situación tan delicada como es un **asesinato** diciendo \"_después se quejan cuando aparecen en un descampado_\" sólo porque se me fue el adc... Me parece que Riot debería prestar un poco más de atención a estas actitudes.\r\n \r\nObviamente en el reporte escribí por qué lo hacía pero, alguien lo lee? Algún día voy a enterarme si esa persona fue penalizada? En algún momento sabré cuál es la posición de Riot respecto a un tema tan importante como este? \r\n\r\nNo tengo claro cuál me parece el castigo más justo para estos casos. Tal vez un bloqueo temporario del chat? Que con la reincidencia aumente el tiempo de restricción hasta, en casos extremos, hacerse permanente. No lo sé. \r\n\r\nNo me importa ser atacada por esto, mi reclamo es justo, y me gustaría saber qué opina la comunidad. Y hablo de machismo porque es lo que a mí me toca sufrir, pero cualquier situación de violencia hacia un grupo de personas, ya sea xenofobia, homofobia, etc, es igualmente grave.","replies":[{"poster":"vaVav","date":"2016-12-07T23:24:49.770+0000","up_votes":4,"down_votes":0,"body":"Yo creo que los reportes enviados a \"Expresiones de odio\" deberían ser leídos por personas, esos reportes supuestamente son los mas graves y por ende merecen ser castigadas rápidamente las personas que lo dicen.","replies":[]},{"poster":"Ghalen","date":"2016-12-08T04:00:37.338+0000","up_votes":2,"down_votes":0,"body":"Estás en internet, no hay filtro de ningún tipo. El lado bueno de eso es que la información está al alcance de todos, el lado malo, son estas situaciones en foros, juegos, etc, donde siempre hay algún \"Richi Phelps\" tratando de amedrentar a base de amenazas vacías.\n\nConcuerdo que lo ideal sería que un equipo de empleados de Riot revisara regularmente todos los reportes catalogados como abuso verbal o expresiones de odio, que es donde posiblemente se vean las peores ofensas, pero dudo que un sistema así se materialice.","replies":[]},{"poster":"Cookies and fun","date":"2016-12-08T00:53:51.588+0000","up_votes":2,"down_votes":2,"body":"***","replies":[{"poster":"Lyanna","date":"2016-12-08T01:27:19.069+0000","up_votes":2,"down_votes":0,"body":"No me tilteo por las cosas que me dicen. Es más, aclaro que ni siquiera reporto comentarios machistas como lo de mandarme a lavar los platos o decirme que juego mal por ser mujer, porque no me interesa que castiguen a la gente por un momento de enojo que puede tener cualquiera. Pero los comentarios que hacen referencia a algún delito, sea asesinato o violación, me parece que no deberían dejarse impunes. Se están viviendo situaciones muy delicadas en la sociedad hoy en día como para decir esas cosas por UN JUEGO.","replies":[{"poster":"Cookies and fun","date":"2016-12-08T02:09:15.351+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Lyanna","date":"2016-12-08T02:16:20.662+0000","up_votes":1,"down_votes":0,"body":"Sí, ya sé que internet es la basura que es porque en el anonimato todos son \"malotes\". Si realmente son nenes de esa edad dudo mucho que personalmente me dijeran nada, pero bueno, es lamentable que a esa edad tengan una mente tan vacía.","replies":[{"poster":"Cookies and fun","date":"2016-12-08T02:37:52.998+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Lyanna","date":"2016-12-08T04:02:12.794+0000","up_votes":1,"down_votes":0,"body":"De todas formas la edad no es una excusa para ser un idiota. Yo también tuve esas edades alguna vez y no andaba diciendo cosas así a la gente. No pretendo que deje de haber tóxicos, ya sé que no va a pasar, pero bueno...Me parece que Riot debería ser más firme en ciertos casos. No estaría bueno que estos niños trasladen esa forma de pensar a la vida real y creo que en algunos casos una llamada de atención puede hacerte ver que hacés las cosas mal. Más de una vez logré que me pidieran disculpas después de la partida.","replies":[]}]}]}]}]}]},{"poster":"Hnk Kenshiro","date":"2016-12-08T00:02:45.930+0000","up_votes":2,"down_votes":1,"body":"Bien, ademas del reporte por partidas, en ciertos casos conviene sacar una captura ( F12 por defecto ) y ver que opina el soporte :p\n\n\n¿Sabes enviar peticiones?","replies":[{"poster":"Lyanna","date":"2016-12-08T00:05:40.491+0000","up_votes":2,"down_votes":0,"body":"Sí, sabía que se podía hacer pero en el momento no me di cuenta. Y eso sí lo leen y responden o es como con los reportes?","replies":[{"poster":"Hnk Kenshiro","date":"2016-12-08T00:15:53.802+0000","up_votes":2,"down_votes":0,"body":"Si, lo leen, y responden en menos de tres días.\n\nSi el caso es normal, te dirán que con el reporte basta, pero si es como suele afectarte, generan un reporte del jugador.","replies":[]}]}]},{"poster":"AKA Jim Carry","date":"2016-12-07T23:22:47.578+0000","up_votes":2,"down_votes":1,"body":"Hay muchos posts en el foro respecto a estos temas, que si es machismo, xenofobia, racismo, etc. y la única respuesta que dan es la típica \"mutea y reporta al final de la partida\" pero sinceramente yo creo que nadie sabe si el report funcionó o no, dicen que si juntas pruebas y mandas un soporte con ellas y denuncias al flaco que te insulta, hacen algo... Pero claro \"DICEN\", de acá a que sea verdad es otra cosa.","replies":[{"poster":"Lyanna","date":"2016-12-07T23:26:46.035+0000","up_votes":2,"down_votes":1,"body":"Sí, todos dicen que reporte, pero nunca me enteré si alguno de los que reporté por estos motivos tuvo algún castigo o simplemente hacen oídos sordos...Lo que para mí es equivalente a fomentar estas actitudes. Porque la gente tiene la filosofía de que si sale impune lo va a seguir haciendo.","replies":[{"poster":"AKA Jim Carry","date":"2016-12-07T23:34:16.077+0000","up_votes":3,"down_votes":1,"body":"Me atrevo a decir que el 80% de la comunidad es tóxica, y Riot como es una empresa cuyo fin es lucrar, no va a castigar al 80% porque se va a ir a la mierda, debe castigar a unos cuantos y aparentar que hace algo al respecto pero la realidad es que no hacen nada con esos casos, nunca hicieron nada...","replies":[{"poster":"Lyanna","date":"2016-12-07T23:40:35.989+0000","up_votes":1,"down_votes":0,"body":"Obvio, estoy de acuerdo con lo que decís. Por eso trato de marcar la diferencia en el grado de toxicidad. No me interesa que castiguen a uno que le dice al otro que es manco por ser diferente nacionalidad, por ejemplo. Pero sí me parece que es más grave meterse con cuestiones culturales de esa nacionalidad. No es cuestión de castigar por castigar, sino de poner un límite.","replies":[]}]}]}]},{"poster":"bertox","date":"2016-12-07T23:51:49.980+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Lyanna","date":"2016-12-08T00:02:55.548+0000","up_votes":2,"down_votes":1,"body":"No me afecta el comentario, no voy a ponerme a llorar porque un chico sin cerebro me dice eso. Pero creo que quedarse callado, o de parte de Riot hacer oídos sordos, es ser cómplice de estas actitudes.","replies":[{"poster":"bertox","date":"2016-12-08T00:18:00.923+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"KRAT0S","date":"2016-12-08T00:40:16.454+0000","up_votes":3,"down_votes":2,"body":"No creo q sea perseguir una \"venganza\". Si fuera algo q sucede muy poco uno lo puede dejar pasar pero cuando es algo diario y tan repetitivo como es ultimamente cansa ver q no se haga nada y ni saber si se tienen en cuentas los reports o simplemente no les importa.","replies":[]}]}]}]},{"poster":"DevilNeverCry","date":"2016-12-08T05:34:58.089+0000","up_votes":2,"down_votes":1,"body":"https://pbs.twimg.com/media/CmF2KpIWYAAR9i5.jpg","replies":[]},{"poster":"Bae Joo Hyun","date":"2016-12-08T18:30:13.461+0000","up_votes":1,"down_votes":0,"body":"Alguien elimino un post donde nos estabamos quejando de la blind pick y los flamers con todo el respeto del mundo ._.\nGG RIOT GG","replies":[]},{"poster":"NahuelG","date":"2016-12-08T15:14:40.796+0000","up_votes":1,"down_votes":0,"body":"es todo dinero, a riot no le importa si la pasas mal si hay muchos troll o lo q sea, si tuvieran q ser serios y banear a la gente q hace cosas asi se irian quedando sin jugadores ya q hay mucha gente asi. con respecto a los nenes de 10 a 14 años de dicen cosas disparatadas, hoy en dia son muchisimos eso les genera muchas ganancias a los de riot. Todo es dinero. Sino riot ya lo hubiese solucionado ya q si lo pensas bien tenien como hacerlo y no es dificil. Riot en q decision q toma lo q intenta es ganar mas dinero y ser mas duros con los reportes y cosas asi parece q les quitaria dinero. Asi yo no esperaria ninguna solucion. Ademas en especial este juego tiene  problemas machistas enormes simplemente mira los esports. Saludos","replies":[]},{"poster":"Rompelotas","date":"2016-12-08T01:14:14.031+0000","up_votes":1,"down_votes":0,"body":"si funciona. yo flamíe hace un par, y me banearon. despues volví a flamear, y me volvieron a banear como por 25 partidas.\n\nigual yo no digo cosas tipo lo del descampado jaja.","replies":[]}]}