{"poster":"Augušt","date":"2016-11-02T13:29:24.719+0000","title":"Rylai changes would be apart of the Preseason","subforum":"Gameplay","up_votes":5,"down_votes":3,"body":"Meddler mentioned Rylai&#039;s Crystal Scepter would be recieving changes this Preseaon, but I haven&#039;t seen anything yet on PBE.\r\n\r\nAre we waiting for the patch after the Preseaon update to seperate the Rylai&#039;s changes from all the other changes, or has something changed with the plan for Rylai&#039;s?","replies":[{"poster":"Meddler","date":"2016-11-03T06:37:58.725+0000","up_votes":9,"down_votes":1,"body":"We were originally looking to get some Rylai's changes into patch 6.22. We haven't hit on changes we're confident are right for the item long term though, so will be holding off until we've got a direction we're confident is correct (could be 6.23, could be later).","replies":[{"poster":"Linna Excel","date":"2016-11-03T18:32:56.586+0000","up_votes":3,"down_votes":0,"body":"Why has rylai's been so hard for you guys to fix, is this pretty normal when reworking an item?\n\nIs it time for you guys to make a mini-rylais (ap and slow spell hit) that builds into 2-3 items?","replies":[{"poster":"Meddler","date":"2016-11-03T22:13:10.323+0000","up_votes":8,"down_votes":0,"body":"Timeline on Rylai's hasn't been as urgent as other work, given it's not particularly connected to the other pre-season changes, in contrast with other things on the same time like assassin kits, balance and items. At the same time it's also an item that's been used by a lot of champs this year, so cost of getting it wrong's noticeable. Don't want to rush it as a result. Couple that with some lack of agreement on exactly who should or shouldn't have access to slows on all their spells in the first place, or whether a more limited approach is needed instead, and you get a process that takes longer than usual.\n\nI'd expect 2-3 different versions of Rylai's to exacerbate the current problems with it, not fix them. Allowing champions to choose even more optimal stat profiles for it makes it more attractive, and therefore universal, rather than limiting it to those it should be a tool on. Branching items like that can be a great approach if the thing being provided's baseline functionality for the class (e.g. % armor pen for ADCs, Sightstones for supports etc). With things like 'all spells slow' that are meant to be optional on most possible users, and something you should make some form of trade off for, branching items can fight against what you're trying to accomplish.","replies":[{"poster":"Malicious Metal","date":"2016-11-03T22:32:16.541+0000","up_votes":7,"down_votes":1,"body":"Well, no rush, take your time and try finding the best possible solution.\nJust don't let my man Morde hanging, that's all I ask for ^^''","replies":[]},{"poster":"Solidair3","date":"2016-11-03T22:17:40.199+0000","up_votes":5,"down_votes":0,"body":"What about giving the slow effect an internal cooldown? this way it's not as strong on spammers.","replies":[]},{"poster":"WiegrafOfValor","date":"2016-11-04T06:20:38.673+0000","up_votes":2,"down_votes":0,"body":"IMO the problem is the amount of AP it gives, Rylai wasn't a problem when it was a low AP item, since not every mage wants to trade an early powerspike for tankiness + CC. \n\n40~55AP seems a good range, have you ever consider this? It's really necessary to change it to a CDR item?","replies":[]},{"poster":"Krabby","date":"2016-11-04T12:24:39.322+0000","up_votes":1,"down_votes":1,"body":"isn't it better to completely remove rylai? as you are not completely sure what to do with the item and a permaslow just doesnt fit in the game as it makes many champions feel unfair.\n\npossible solutions are:\n\n* Give it a cooldown: every 5 seconds you can slow an enemy for 3 seconds. \n\n* Removing the item completely and try to give mages another tanky ap item, the slow doesnt realy fit \n\n* as slows are really nasty on tank champions make the slow scale on ap... starting at 20% with like a 0,05% ratio or something similar.\n\n* Hire me to change the item _**insert evil laugh**_","replies":[{"poster":"OneManFailSquad","date":"2016-11-04T23:54:09.719+0000","up_votes":1,"down_votes":0,"body":"The problem is a lot of champions are balanced around its inclusion right now so just getting rid of it will indirectly nerf a number of champions.","replies":[{"poster":"Krabby","date":"2016-11-08T15:34:43.474+0000","up_votes":1,"down_votes":0,"body":"well... so?\n\nmages were balanced around Deathfire Grasp, they removed it as it was toxic...\n\nthis item is also toxic... its alright the champions get nerfed, as its preseason now anyway... Riot can buff them afterwards.","replies":[]}]}]},{"poster":"Anonagon","date":"2016-11-04T12:41:03.282+0000","up_votes":1,"down_votes":0,"body":"Have you considered simply removing it instead of continuing to let people itemize into permaslows?\n\nI think if they hadn't been in the game from the start, I don't think the Riot of today would think Rylais and Frozen Mallet are acceptable designs.","replies":[]},{"poster":"Coballz","date":"2016-11-04T00:51:18.229+0000","up_votes":1,"down_votes":0,"body":"First off, if Rylai's can be directly compared to Frozen Mallet (which it can) then it shouldn't get an internal cooldown, as many suggest. That's nonsensical. Secondly, when looking at Rylai's as a branching item, couldn't it be an item that provides movespeed-altering effects? The little one could just give MS when you hit an enemy with an ability, and then 3 bigger items it builds into could be an equivalent to Trifo/Cleaver - a decent boost of movespeed on ability hit; an item akin to Youmuu's that gives a cooldown-gated amount of movespeed, often useful on mages (and it may or may not remove the need for Ghost all the time); and a third one that functions as a weaker version of the current Rylai's - more akin to the old one, perhaps?","replies":[]},{"poster":"Hadriel","date":"2016-11-03T23:34:29.876+0000","up_votes":1,"down_votes":0,"body":"What about changes to other preseason-expected things like Blade of the Ruined King or Bond of Stone?","replies":[]},{"poster":"Sun Wu Ryuumoku","date":"2016-11-03T23:08:49.428+0000","up_votes":1,"down_votes":0,"body":"now u mention it armor pen... Any plan for %pen on Dominik and other last whisper ?","replies":[]},{"poster":"Sailor Mint","date":"2016-11-03T22:47:19.478+0000","up_votes":1,"down_votes":0,"body":"Have you considered simplifying spell effect rules by only making the DoT application proc them instead of individual ticks?  And a once per target per cast for multi-hit spells (i.e.: Morgana's Tormented Soil).  \n\nAt the very least, slow shouldn't linger for more than 0.5 sec after leaving a puddle.","replies":[]},{"poster":"Decrit","date":"2016-11-03T22:30:05.186+0000","up_votes":1,"down_votes":0,"body":"In few words, have a tree that can branch into a GLP or a Rilay for example?","replies":[]},{"poster":"Linna Excel","date":"2016-11-04T00:59:06.530+0000","up_votes":1,"down_votes":1,"body":"Okay, thanks for the reply.  So which group of AP champs does riot feel rylai's is a tool they need to get?\n\nI just hope when it's all done, there will be an 80-100 AP, 400-500 health option for mid laners.","replies":[]},{"poster":"Adalvar","date":"2016-11-03T22:35:02.482+0000","up_votes":1,"down_votes":1,"body":"what about changes to other AP items? Large Rod upgrades have been mostly disregarded (Luden's Echo and Seraph's Embrace) even by champions that it should synergize with. ROA is another item left in the dirt since the payoff for the stack timer is negligable at best (at max stacks you get the same AP as anyother NLR item and the health is only 100 more than Rylai's).\n\nAdd to that the introduction of items such as Edge of the Night and the ever present Maw and it looks like AP mages and assassin will be left to dry a bit. SO if you could throw us a bone, i'd very much enjoy this.","replies":[]}]}]},{"poster":"Malicious Metal","date":"2016-11-03T09:34:31.802+0000","up_votes":3,"down_votes":2,"body":"Have you considered giving it MS on spell hit with only a minor slow?\nI'd rather see it give 15% slows and some MS seeing that slows would be less oppressive yet the kiting aspect would still be preserved","replies":[{"poster":"DrCyanide","date":"2016-11-03T18:53:04.257+0000","up_votes":1,"down_votes":0,"body":"I know what I like best about Rylai's on Xerath is being able to set up multiple shots of my ultimate, and being able to slow enemy's down from across the map. I've set up several engages and peeled for several allies using Rylai's + Ult.\n\nFrom a purely selfish perspective (peeling is selfish?), I'd prefer the full slow to a slow + MS boost. I can assume from a purely selfish perspective you'd like the MS boost, as it would help you close the gap on targets you didn't hit with the spell (you could hit a minion to get the boost). Azir would likely prefer the full slow, as it would keep targets in soldier range longer, while Viktor and Cass could go either way (Viktor might prefer the full slow for his ultimate). Singed would prefer the MS + slow. \n\nI suspect these conflicting use cases are why it's such a hard problem to pin down. Creating two items might serve each party better, or repurposing the No-one Buys Me (or remembers my name) 8000 to fit one role better, but it runs the risk of keeping slows just as prevalent.","replies":[{"poster":"HazyCloud7","date":"2016-11-03T23:46:31.520+0000","up_votes":2,"down_votes":0,"body":"Tbh, I feel like Xerath is one of the main culprits that _shouldn't_ be building this item and wouldn't if it provided less AP. He has a skill shot stun + AoE slow on W, and his range is long enough that doesn't need to worry about kiting bruisers/fighters/tanks, his positioning should prevent them from getting to him.","replies":[]}]}]},{"poster":"Shíny","date":"2016-11-03T07:53:19.396+0000","up_votes":2,"down_votes":1,"body":"Is frozen mallet up for changes in the near future?","replies":[]},{"poster":"Anomander","date":"2016-11-23T18:26:35.492+0000","up_votes":1,"down_votes":0,"body":"A simple fix for rylais is to prevent reapplication of the slow for period of time.    You could even up the slow to 60% for 1 sec but it can't be reapplied to the same target for 6-8 secs.    This allows people to escape ganks or to initiate one but doesn't allow the perma slow effect which is what is making Rylai a negative gaming experience.","replies":[]},{"poster":"Carnicore","date":"2016-11-04T02:37:14.253+0000","up_votes":1,"down_votes":0,"body":"Is Youmuu in the same boat at all? I know it was initially planned to block a basic attack or something, but that was pulled before it could go on the PBE.","replies":[]},{"poster":"SonicÐeHedgedawg","date":"2016-11-03T11:47:39.547+0000","up_votes":1,"down_votes":1,"body":"Only thing I ask is: since she doesn't have the burst of other assassins, Evelynn almost REQUIRES a Rylai's to stick to her targets, so please leave it in a place that Evelynn feels good buying it or give her some other strong way to stick to enemies (like a mage phage)","replies":[]},{"poster":"Rune Keg","date":"2016-11-03T06:58:01.263+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=lG1JvHdi,comment-id=0003,timestamp=2016-11-03T06:37:58.725+0000)\n>\n> We were originally looking to get some Rylai&#x27;s changes into patch 6.22. We haven&#x27;t hit on changes we&#x27;re confident are right for the item long term though, so will be holding off until we&#x27;ve got a direction we&#x27;re confident is correct (could be 6.23, could be later).\n\nWhats the discussion regarding just nerfing it straight up? I feel maybe knocking it down to 80 AP and maybe shaving some home hp off would be good. That's just me though.","replies":[]}]},{"poster":"Waffletimewarp","date":"2016-11-02T16:36:31.428+0000","up_votes":3,"down_votes":1,"body":"Glad I got level seven with Singed before he got gutted then.","replies":[{"poster":"Talisid","date":"2016-11-03T10:03:28.397+0000","up_votes":4,"down_votes":0,"body":"For all you know the change could be Less AP and more Health so that not every mage champion buys it, but would be a buff for {{champion:27}} .","replies":[]}]},{"poster":"Wulf Helhammer","date":"2016-11-02T13:37:53.417+0000","up_votes":3,"down_votes":0,"body":"The preseason isn't only one patch","replies":[]},{"poster":"Hyperiön","date":"2016-11-02T13:42:16.794+0000","up_votes":2,"down_votes":0,"body":"There is 6.22, which is the assassin update, hopefully here in a week or two.\n\nAnd then theres like 2 or 3 more patches after that.\n\nThats how it was last year anyways. If they did everything on 1 patch, there would be a lot of things that would need to be changed again.\nIt would be a balancing nightmare to have everything in 1 patch. So they space it out in multiple patches.","replies":[{"poster":"Augušt","date":"2016-11-02T13:48:18.033+0000","up_votes":1,"down_votes":0,"body":"Gotchya, thats what I was asking. Thanks for clarifying.","replies":[{"poster":"Hyperiön","date":"2016-11-02T14:11:54.882+0000","up_votes":1,"down_votes":0,"body":"Yup, no problem.","replies":[]}]}]},{"poster":"Asura Gonza","date":"2016-11-09T13:39:54.811+0000","up_votes":1,"down_votes":0,"body":"The problem is not the slow... the problem is teh AP and the HP it gives to AP mids. if they slow people, they shoudnt be more durable and damaging on top of it.\n\nNerf the AP hardcore...like to 50 or so, and the HP if needed. Then adjust the cost accordingly.\n\nThat way, you will never see Mid bursters building it again.","replies":[]},{"poster":"PyroPls","date":"2016-11-04T00:21:07.538+0000","up_votes":1,"down_votes":0,"body":"Any plans for frozen mallet? items is only used by like 2 champs, and is horrible to play against. All its done this season is make gnar annoying and get yasuo nerfed","replies":[]},{"poster":"Shuyin178","date":"2016-11-03T22:43:49.513+0000","up_votes":1,"down_votes":0,"body":"Honestly all they need to do is have it proct once per spell cast on DOT abilities (Cass's Q poison, Singed poison, etc) but have it proct off of re-applied damage (Cass's W, Rumble Q, etc).\nThis way champions that are \"Hit and forget\" don't get a free CC lockdown.","replies":[]},{"poster":"ADC5LUT","date":"2016-11-04T12:50:51.192+0000","up_votes":1,"down_votes":1,"body":"Love these people who are like just delete it, it's fine. Ignoring the fact that there are many immobile mages that depend on a perma slows in the hyper mobility meta we're constantly in.","replies":[]}]}