{"poster":"bibokun4","date":"2017-06-27T23:01:15.757+0000","title":"Main adc silber sucht Team für flex. und duoQ.","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Hallo ich bin Marcus,\r\n\r\n30 Jahre alt und m&ouml;chte mit einem Team oder anderen Spielern besser werden taktiken und combos &uuml;ben und dabei Spa&szlig; haben .\r\n\r\nSpiele schon seit einigen Jahren LOL. Momentan bin ich auf s5. \r\n\r\nIch spiele nicht nur adc sondern kann mich auch auf anderen Lanes behaupten.","replies":[{"poster":"NGC Polyxena","date":"2017-06-28T05:52:32.242+0000","up_votes":1,"down_votes":0,"body":"Guten Morgen Marcus und Max,\n\nwenn ihr neben der reinen Teamsuche außerdem Lust habt ein paar neue Zocker-Bekanntschaften für League of Legends zu knüpfen, dann schaut doch Mal in der ü18 Community \"**Nerds Go Casual**\" vorbei.\n-----\nAlternativ könnt ihr euch natürlich auch gerne bei uns einem Team anschließen oder eines selbst aufbauen, gerne auch mit unserer Unterstützung. Wichtig ist uns vor allem der respektvolle Umgang miteinander! Man trifft bei uns Spieler/innen unterschiedlicher Level und Elos an, daher werden Diskriminierungen in jedweder Art nicht geduldet.\n---\nNähere Informationen zu uns findet ihr in unserem Forenbeitrag --> [KLICK](https://boards.euw.leagueoflegends.com/de/c/clans-teams-de/YqF3KgIn-oi-nerds-go-casual-18-community-laadt-zum-zocken-ein-oi)\n\nZudem lasse ich euch beiden noch eine Anfrage über den Clienten zukommen um eventuelle Rückfragen und Anregungen klären zu können =) .\n\nLiebe Grüße,\nNGC Polyxena | Julia","replies":[]},{"poster":"CaptainEnton","date":"2017-06-28T04:35:23.859+0000","up_votes":1,"down_votes":0,"body":"Guten Tag,\nich heiße Max bin 20 Jahre alt (falls dies ein Kriterium darstellt),\nMaine Support (Thresh, Blitzcrank, Nautilus..... kann eigtl jeden support einigermaßen) Edit: Bard und Nami nicht\nNebenlane Top: Nautilus, Tryndamere, Nasus, Garen,Irelia\nbin aktuell Silber 3 sowohl in Solo als Flex\nIch denke man wird auch ein Team finden","replies":[]}]}