{"poster":"Shaakray","date":"2015-10-06T18:19:10.500+0000","title":"Srive Reportar jugadores en LAS?","subforum":"Charlas Generales","up_votes":3,"down_votes":3,"body":"Hola,\r\n\r\nSoy algo nuevo en League of legends, llevo jugando poco menos que 2 meses y estoy nivel 20 con casi 100 victorias, la gran mayor&iacute;a de ellas jugando SONA SUP mix AP o ADC con Jinx etc.\r\n\r\nEl problema es que el 80% de los casos tengo alguna clase de jugador TOXICO, inmaduro (mejor dicho retrasado ) que se dedica a grifear las partidas  ya sea qued&aacute;ndose  AFK/CRY. Estoy perdiendo mucho en realidad y no es por que sea YO el problema. Vengo jugando mobas desde Warcraft III (Dota 1 ) y  deje de lado DOTA 2 por el nefasto estado del juego y sistema de emparejamiento.\r\n\r\nSe que LOL tiene la comunidad mas toxica del gaming online pero quer&iacute;a saber si los reports que mando para esta clase de jugares, realmente sirven para algo. Al menos en otros mobas te llegaba un mensaje diciendo que se hab&iacute;an tomado ciertas medidas cotnra X player reportado.","replies":[{"poster":"artistafracasado","date":"2015-10-06T18:20:38.571+0000","up_votes":6,"down_votes":0,"body":"Sí","replies":[{"poster":"Curtedz","date":"2015-10-06T19:09:31.553+0000","up_votes":1,"down_votes":0,"body":"Como indican aquí, los reportes sirven mucho y hay varios post ya indicando la gente BANEADA por abuso verbal o por AFKs.","replies":[]}]},{"poster":"Bienzahar","date":"2015-10-06T18:58:11.210+0000","up_votes":2,"down_votes":0,"body":"Mutea viejo, mutea!!","replies":[]},{"poster":"Shaakray","date":"2015-10-06T19:27:07.099+0000","up_votes":1,"down_votes":0,"body":"Me gusta el juego en si, es muy bueno . No digo que sea malo, pero lamentablemente hay gente que se rinde rápido, y prefiere no solo fastidiar si no que también a flamear. Yo estoy en contra completamente de estas actitudes ya que yo no las aplico,  el teamwork y la buena convivencia es la clave en este juego pero es una pena que haya tanta gente que no se da cuenta de ello.\n\nGracias por todas sus respuestas.","replies":[]},{"poster":"The Inkanus","date":"2015-10-06T19:23:31.068+0000","up_votes":1,"down_votes":0,"body":"https://500px.com/chirimbola\n\nPasate por ahí y formate alguna idea al respecto :)","replies":[]},{"poster":"Xonxzender","date":"2015-10-06T18:39:12.335+0000","up_votes":1,"down_votes":0,"body":"Si sirve, Y tengo la prueba\n\nhttp://imgur.com/hqjOmHj","replies":[]},{"poster":"Moctesuma","date":"2015-10-06T18:54:50.801+0000","up_votes":1,"down_votes":6,"body":"te recomiendo que no te gastes en reportes porque no sirve de nada. si riot multara a todos los jugardores se quedarian sin gamers. te toca gente toxica y muchos troll en todas las partidas tanto en ranked como en normal. y siempre es culpa de otro o simplemente \"es un normal\". pero es un game disfrutalo mientras te guste y listo. ademas de que te censuran el mensaje de seguro. bueno el mio seguro porque riot no acepta criticas duras. jaja.","replies":[]}]}