{"poster":"Bilobana","date":"2015-02-14T12:01:43.693+0000","title":"Account bannato fino al 2203.... senza nessuna spiegazione...","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"ho appena provato a loggare e dice che il mio account è sospeso per duecento anni... senza nessuna spiegazione..... di seguito la mail che mi è arrivata\r\n\r\n\r\nGreetings bilobana,\r\n \r\nActions that have been performed on your account are in violation of the League of Legends Terms of Use. You can review these terms at http://www.leagueoflegends.com/legal/termsofuse\r\n \r\nDue to the severity of this violation, your League of Legends account has been banned until Tue Feb 22 22:22:22 UTC 2203\r\n \r\nIf you have any questions, contact our Player Support team at https://support.leagueoflegends.com/home\r\n \r\nRiot Games Player Support\r\n\r\nnon lo loggavo da parecchi giorni penso proprio sia un errore.... se qualche admin del forum mi può dare una mano sarei davvero grato","replies":[{"poster":"SideshowEMS","date":"2015-02-14T13:14:22.298+0000","up_votes":2,"down_votes":0,"body":"Non pensavo si potesse essere bannati per 200 anni ! Vedila così, ti stanno augurando una lunga, lunghissima vita !","replies":[]},{"poster":"Zorby","date":"2015-02-14T12:07:27.473+0000","up_votes":2,"down_votes":0,"body":"Dovrebbero, ma non essendo mai stato bannato non so.\nComunque vedrai che il supporto saprà darti maggiori informazioni.","replies":[]},{"poster":"Bilobana","date":"2015-02-16T10:19:55.907+0000","up_votes":1,"down_votes":0,"body":"Grazie dell'intervento Ediwir, dal supporto nessuna risposta dopo 2 giorni....\n\nallora niente raga ci si vede tra duecento anni, lo lascerò in eredità al mio discendente. \n\nUn saluto alla community","replies":[]},{"poster":"Ediwir1","date":"2015-02-15T00:19:47.250+0000","up_votes":1,"down_votes":0,"body":"Utilizzo di programmi di terze parti o modifiche non permesse al client di gioco.\nNon è una conferma al 100%, devi chiedere al supporto per la certezza, ma per 200 anni c'è quasi solo quello. Gli altri fanno 120, 220, 400, 105 e cose così... Dopo un po' ci si fa l'occhio ;)\n\nps. no, non ti diranno \"quale\" programma è stato rilevato, al massimo possono confermarti che è stato rilevato qualcosa. Questo per evitare casi in cui, per esempio, qualcuno utilizza tre diversi programmi, ne vengono sgamati due, e sull'account dopo continua a utilizzare quello non rilevato.\n\npps. una cosa molto comune in questi giorni con questo tipo di ban è gente che viene bannata per uso di programmi di terze parti pur non avendoli usati, ma avendo comprato l'account da qualcuno che usava dei bot per livellarli. Il che è bannabile uguale, ma in più ci hai perso soldi.","replies":[]},{"poster":"Zorby","date":"2015-02-14T12:04:24.300+0000","up_votes":1,"down_votes":0,"body":"C'è anche scritto nella mail:\n> If you have any questions, contact our Player Support team at https://support.leagueoflegends.com/home\n\nContatta il supporto, sapranno aiutarti. \nI rioter che sono qui sul forum non hanno a che fare con ban sul gioco.","replies":[{"poster":"Bilobana","date":"2015-02-14T12:06:16.519+0000","up_votes":1,"down_votes":0,"body":"ho scritto al supporto ma avrebbero dovuto già dirmi il motivo nella mail o sbaglio?","replies":[{"poster":" Asylum","date":"2015-02-14T23:51:23.721+0000","up_votes":1,"down_votes":0,"body":"Inutile. Ti diranno che non possono e non vogliono togliere il ban. Perché sei tossico. Non chiedere le info riguardanti il ban. Non te le sanno fornire. Quindi tu puoi essere bannato senza sapere il motivo. Questa è la giustizia nelle arene della giustizia. Io ho solo ricevuto 75 chat e 35 draft. Era tipo due mesi che non usavo la chat. Lol","replies":[]}]}]},{"poster":"sunbeam85","date":"2015-02-14T14:13:35.726+0000","up_votes":1,"down_votes":0,"body":"Ti ha detto bene, tra duecento anni potrai rigiocare, io ancora non so il motivo e sono stato permabannato...","replies":[]},{"poster":"Sky Striker Ace","date":"2015-02-14T12:30:16.457+0000","up_votes":1,"down_votes":0,"body":"Non saprei proprio,supporto.\nPer fortuna su questo forum non è molta la gente che viene bannata (ah,dove sono finiti Oinegue e SOGEKINGSONOUNTARDO1!!1PL0X,bei tempi.) ,ma in questo caso non serviamo a nulla...:/","replies":[]}]}