{"poster":"jÖn SlÖW","date":"2016-01-02T12:38:58.137+0000","title":"Hasta cuando los 150-200 de ping riot?","subforum":"Problemas Técnicos","up_votes":6,"down_votes":2,"body":"Desde el mi&eacute;rcoles estoy as&iacute;, no puedo jugar ni contra los bots.","replies":[{"poster":"2l2","date":"2016-01-02T17:07:06.616+0000","up_votes":1,"down_votes":2,"body":"Mira toma tu telefono, marca el número de tu isp y quejate con ellos, el servidor anda muy bien actualmente, es tu isp la que tiene malas conexiones a Chile. Ojalá las reparen.\n\nSaludos","replies":[{"poster":"jÖn SlÖW","date":"2016-01-02T19:18:00.869+0000","up_votes":3,"down_votes":0,"body":"Me quejo acá, primero porque se ve que no soy el único o sino mira los otros comentarios, segundo: llame a mi proveedor de Internet y no ven nada raro y tercero, na mentira no hay tercero... esta pagina, esta para hablar y quejarte, si no vas a contribuir con una ayuda mejor deja que hable otro por favor porque lo hice para que los de riot vean que todavía no se soluciono el problema y gracias por querer ayudar.{{item:2009}}","replies":[{"poster":"2l2","date":"2016-01-02T22:45:58.243+0000","up_votes":1,"down_votes":2,"body":"No ven nada raro? Hace ping a www.sii.cl es la página de impuestos internos de Chile. Si te arroja mas de 100ms con perdida de paquetes es porque es tu isp\n\nLos chilenos tenemos 30ms sin lag, por lo que el servidor esta bien.\n\nEsta página no es para quejarte ni para avisar, para eso tienes el sistema de ticket. Riot esta al tanto hace dias del problema.","replies":[{"poster":"jÖn SlÖW","date":"2016-01-03T00:39:34.986+0000","up_votes":2,"down_votes":0,"body":"A ver como te explico... si a vos te funciona bien, bien por vos, a mi no me funciona y listo, tengo todo el derecho de quejarme, porque gaste plata en este juego y lo que menos espero es que al menos funcione bien... y te equivocas esta pagina tiene un lugar donde dice a quien te referís cuando haces un post, y yo puse \"ayuda y soporte\", por lo tanto estoy buscando ayuda o que alguien se haga cargo de esto, no que vengas vos y me digas \"a mi me anda bien, debe ser problema de tu isp\", si te dije que me funciona bien el Internet, es mas estoy usándolo a mas no poder, es por algo mi niño... Y si, tenes razón el ticket sirve para eso, pero los soportes tardan 2 días en contestar, acá por lo menos avisas que te sigue funcionando mal y quizás un \"Rocofu\" salvaje te contesta... quizás...","replies":[{"poster":"2l2","date":"2016-01-03T02:08:53.109+0000","up_votes":1,"down_votes":0,"body":"1.- A los Chilenos no nos va lag, eso quiere decir que el servidor funciona bien. Lo que provoca el lag son conexiones EN ARGENTINA, riot puede pedir que lo reparen pero eso depende netamente de las ISP argentinas, Además por estas fechas la mayoría de empresas no trabajan, por lo que las reparaciones se han extendido para la proxima semana.\n\n2.-  Si, puedes quejarte, pero si ves 40 post con lo mismo e incluso un post explicando lo sucedido detalladamente, ¿Para que creas otro? Eso es repostear, spamear el mismo tema una y otra vez.\n\n3.-No tienes idea como funcionan las redes, hijo mio. Hay conexiones saturadas entre Chile-Argentina. Tu internet va bien, si, pero va bien para conectarse al norte y al este (EEUU y Brazil) y el servidor esta al oeste de Argentina (en Chile) por eso te dije que hicieras ping a una pagina Chilena y vieras con tus propios ojos lo mal que esta tu isp al conectarse a Chile. Si no sabes hacer ping, busca en google.\n\n4.- Reitero, llama a tu ISP y diles que al hacer ping a Chile tienes perdidas de paquetes, que juegas online y el servidor esta en Chile, ellos desde la central haran ping a Chile y se darán cuenta del problema.","replies":[]}]},{"poster":"TortugaConMuleta","date":"2016-01-02T23:52:47.824+0000","up_votes":1,"down_votes":0,"body":"claro chile nunca tiene problemas de conexion, sin embargo los otros paises si tienen.\nque raro \"chile el pais donde nada malo puede pasar\"","replies":[]}]}]},{"poster":"Sopa Yisus","date":"2016-01-02T23:50:19.138+0000","up_votes":1,"down_votes":0,"body":"Hace menos de 2 días RITO pedía disculpas porque los servidores estaban teniendo  problemas con diferentes ISP's","replies":[{"poster":"2l2","date":"2016-01-03T02:21:17.856+0000","up_votes":1,"down_votes":0,"body":"Les piden disculpas porque es la manera cordial de enfrentar la situacion, pero estoy seguro que los rioters [~~abofetearian~~ ](https://i.imgflip.com/wqnzx.jpg)a cada Argentino que viene de manera prepotente a decir que tiene lag y que deben arreglarlo.\n\n","replies":[{"poster":"Sopa Yisus","date":"2016-01-03T21:51:39.164+0000","up_votes":1,"down_votes":0,"body":"Como muchos Argentinos, compramos RP para comprar lo que se nos de la gana dentro del juego. \nAdemas de gastar dinero para el juego, proporcionan un mal servicio,  ¿no podemos quejarnos y exigir que arreglen el problema?\nSi en Chile no se quejan por nada es problema de ustedes, pero si brindan un servicio lo tienen que brindar en perfectas condiciones.","replies":[]}]}]}]},{"poster":"WaDeX","date":"2016-01-02T21:58:40.444+0000","up_votes":1,"down_votes":0,"body":"encerio riot.. no se puede jugar tengo muchisimos ms y me flamean diciendo q juego mal y tengo que soportar eso cada partida , cuando ni siquiera es culpa mia.. 150 de ms, en team fight me sube hasta 500 aveses , y incluso e visto gente que directamente no puede ni jugar se le cae todo el tiempo.. y no es culpa de su internet. Me baje un test y me baja a 1 mb/s osea q mi internet no es..","replies":[]},{"poster":"Ascr0w","date":"2016-01-02T20:59:08.098+0000","up_votes":1,"down_votes":0,"body":"ahora estoy jugando con  250-300-400 -500-600-4000 de ms cuando debería tener 90-100 de ms","replies":[]},{"poster":"pipiripau","date":"2016-01-02T20:32:36.241+0000","up_votes":1,"down_votes":0,"body":"Reviviendo todo esto, nadie sabe para cuando lo arreglan? . soy de Arg Jujuy y no puedo jugar tampoco :(","replies":[]},{"poster":"feed no jutsu","date":"2016-01-02T19:13:16.987+0000","up_votes":1,"down_votes":0,"body":"No es culpa del ISP ya dijieron 70 millones de veces que se rompió una fibra y eso es lo que causa que Argentina y Uruguay tenga lag, Chile no lo tiene, ay si el servidor anda perfecto! no hables sin saber CA-PO.","replies":[]},{"poster":"Darkwolft","date":"2016-01-02T18:44:06.132+0000","up_votes":1,"down_votes":0,"body":"me uno sigue el lag y mi operador anda perfecto, no es el unico juego online que juego, pero es el unico que anda mal  :P desde Bs AS\n{{champion:119}}","replies":[]},{"poster":"Sonya Kyron","date":"2016-01-02T13:24:04.275+0000","up_votes":1,"down_votes":0,"body":"De que ciudad sos? mira que yo estoy en Buenos Aires y ya lo tengo solucionado, juego con 51-55ms.","replies":[{"poster":"jÖn SlÖW","date":"2016-01-02T14:14:00.310+0000","up_votes":1,"down_votes":0,"body":"De Buenos Aires también..","replies":[{"poster":"Sonya Kyron","date":"2016-01-02T14:40:10.199+0000","up_votes":1,"down_votes":0,"body":"contactate conmigo ingame, que te lo pongo como te tiene que ir","replies":[{"poster":"pochitonegresito","date":"2016-01-02T17:54:31.852+0000","up_votes":1,"down_votes":0,"body":"Me ayudas ami tambien me anda aveses a 160 ms {{champion:53}}  Soy de argentina buenos aires","replies":[{"poster":"Sonya Kyron","date":"2016-01-02T18:05:10.948+0000","up_votes":1,"down_votes":0,"body":"dale, contactame en el juego que te lo arreglo via skype","replies":[]}]}]}]}]},{"poster":"BigVoys","date":"2016-01-02T14:48:18.495+0000","up_votes":1,"down_votes":0,"body":"Yo no puedo ni jugar tengo 80 de ping cuando de normal tengo 60 o 70 como mucho y aparte no me puedo mover en algunas partidas con poco ping es una verguenza el server .","replies":[{"poster":"jÖn SlÖW","date":"2016-01-02T15:27:14.442+0000","up_votes":1,"down_votes":0,"body":"A mi me funcionaba con 35-40 de ping y ahora me va 160 hasta el punto de desconexion. Esta pasando lo mismo que a principio del año pasado, estuvo como un mes entero hasta que se arreglo.","replies":[]}]},{"poster":"Brooklyn Baby","date":"2016-01-02T13:46:54.333+0000","up_votes":1,"down_votes":0,"body":"150 de ping tengo soy de Uruguay, todos mis amigos que tienen antel tambien están igual. 5 días ya van que no se puede jugar ni 1 game porque las 24 horas hay 200 de ping o peor, packet loss tan asqueroso que no se ve ni tu propio champion.","replies":[]}]}