{"poster":"Gene Freakz","date":"2016-06-30T00:29:47.558+0000","title":"Can I opt out of playing with premades","subforum":"Gameplay","up_votes":117,"down_votes":22,"body":"I&#039;m really tired of it.","replies":[{"poster":"SwiftKitten88","date":"2016-06-30T00:32:09.375+0000","up_votes":13,"down_votes":1,"body":"if only...","replies":[]},{"poster":"ntbcool","date":"2016-06-30T14:29:22.887+0000","up_votes":8,"down_votes":0,"body":"play hearthstone no premades there","replies":[{"poster":"Supreme Senpai69","date":"2016-06-30T22:46:33.894+0000","up_votes":1,"down_votes":0,"body":"I actually haven't played league in a month and downloaded Hearthstone. Losing a game because stupid RNG sucks and it happens a lot. But losing a game because YOU made a mistake is the most glorious thing ever. And if you play well you can actually WIN. You don't lose because a teammate is bad or boosted or AFK or feeding. There's  no toxicity because you can't talk to your opponent, games are only like ten minutes long. It's so great. There's no promos either, it's literally just win a little bit over half of your games and you infinitely climb. \n\nI'll go back to league soon probably, I don't think I quit. I just haven't had the urge to play in awhile and that might change. But in the meantime, Hearthstone is filling my spare time.","replies":[]}]},{"poster":"34271009DEL1","date":"2016-06-30T12:17:14.644+0000","up_votes":10,"down_votes":2,"body":"I wish I could play with and against other solo players, would be a really neat idea.","replies":[]},{"poster":"LatetotheRace","date":"2016-06-30T18:43:59.184+0000","up_votes":7,"down_votes":0,"body":"Aaaaand DQ grinds to a halt. Sadly riot's trashy little system can't work without \"filler\" players.","replies":[]},{"poster":"StrokeMyHammur","date":"2016-06-30T09:24:10.742+0000","up_votes":8,"down_votes":1,"body":"really miss solo Q  T_T","replies":[]},{"poster":"J Epstein","date":"2016-06-30T03:53:02.419+0000","up_votes":9,"down_votes":2,"body":"I would wait 2 hours to play if it meant I didn't get paired with or against premades","replies":[]},{"poster":"MonkeyMadness","date":"2016-06-30T17:59:25.736+0000","up_votes":4,"down_votes":0,"body":"Honestly, the premades suck, but I'm having a much bigger problem with the boosted animals that I get matched with that DO NOT deserve their rank. They inevitably end up losing the game either by feeding relentlessly or by having 0 game sense and not really playing the end game properly.","replies":[]},{"poster":"Alorrin01","date":"2016-06-30T17:34:38.435+0000","up_votes":6,"down_votes":2,"body":"Save your -3 daily dodge for this scenario. Just be sure use your entire countdown clock before locking in Teemo, then dodge at 1 second left before game starts. If Riot wants to troll me, I'll troll right back.","replies":[]},{"poster":"Gosh Darn","date":"2016-06-30T16:37:36.976+0000","up_votes":3,"down_votes":0,"body":"Been asking for this since before dynamic queue. I don't like playing with premades because they're toxic, they act like I'm not a part of the team, and trying to get them to work with you is harder than getting random unranked people to cooperate. \n\nI don't like playing against premades because teams should not be killing baron at 20:30 in Bronze 5 and unranked games. I hate dealing with 5 man ganks 7 minutes into the game where they easily shred my turret to pieces.","replies":[]},{"poster":"Cenobite Azaziel","date":"2016-06-30T04:44:15.181+0000","up_votes":4,"down_votes":1,"body":"Sure you can honey.... just drop the game.\nYou'll never see a premade ever again.\n\nRiot isn't going to bring back soloq to us. \nHell, they even made a STICKER trying to patch up the crave for solo queue.","replies":[{"poster":"VvVVvV","date":"2016-06-30T16:51:57.021+0000","up_votes":2,"down_votes":0,"body":"where is this sticker i see mentioned...ive never seen it..just want to see what it looks like.","replies":[]}]},{"poster":"Yaśuo Main","date":"2016-06-30T14:54:33.950+0000","up_votes":6,"down_votes":3,"body":"I was in a premade of 4\n\nmy 3 other friends were MEGA toxic. You can't tell me premeds aren't toxic.\n\n(they got toxic because one of the lanes our friend wanted was taken and the solo player got bullied)","replies":[{"poster":"DeathBurst","date":"2016-06-30T17:51:24.599+0000","up_votes":4,"down_votes":3,"body":"Were YOU toxic? No? then I guess it's not the premading that made your \"friends\" toxic, it's just their natural character. At least if they are all grouped together they only ruin 1 game, not many at the same time.","replies":[{"poster":"Yaśuo Main","date":"2016-07-01T01:07:03.713+0000","up_votes":1,"down_votes":1,"body":"Oh my god you ignorant species. I said its because one of them didn't get the lane they wanted so it instantly got horrible. They were never like this, and I wasn't toxic as i wouldn't be saying this at all if I was. And you obviously don't get the scale of toxicity here. Kill yourself, your moms a whore, and fuck you were obviously a part of the arsenal my friends threw at one poor guy, who called top first and got flamed mega hard.","replies":[{"poster":"DeathBurst","date":"2016-07-01T04:42:20.309+0000","up_votes":3,"down_votes":1,"body":"Because there wasn't ANY Solo players going \"Mid or Feed\" mode in good ol' time when we had Solo/Duo Q? If your friends are toxic because they didn't got their favored lane, then they ARE toxic, it's not an excuse. But it's not because of Dynamic Q, it's just that they are bad people.\n\nYou, of all people, should be able to realize it's not because of Dynamic Q, since YOU were in the same premade as them and yet you didn't \"flame the poor guy\". So blame your \"friends\", not Dynamic Q... Dynamic Q is not creating more toxicity.","replies":[{"poster":"Yaśuo Main","date":"2016-07-01T06:14:29.628+0000","up_votes":1,"down_votes":1,"body":"didn't i talk about premades not DQ?\n\ndon't think you understand, i obviously blamed my friends\n\nedit: your probably one of those ass kissers for riot so i understand why you even brought up DQ\n\n","replies":[{"poster":"macromite","date":"2016-07-01T12:35:14.010+0000","up_votes":1,"down_votes":0,"body":"this is a post tied to dynamic queue.\n\nand he used logic and reason.\n\nI suggest you stop using the sportsmanship icon, you don't deserve it anymore.","replies":[{"poster":"Yaśuo Main","date":"2016-07-01T17:38:34.369+0000","up_votes":1,"down_votes":0,"body":"The only thing in this reply is \" This comment is unrelated, you don't deserve the right to have that icon. \"\n\nI'll give you props for the unrelated part, but you don't control me.\n\nEdit: He perceived premades as DQ, and I was at fault for using it because it was related to DQ.\n\nBut yeah, this reply you made is pointless.","replies":[{"poster":"macromite","date":"2016-07-01T17:50:50.025+0000","up_votes":2,"down_votes":0,"body":"no, it's just the sportsmanship icon. you shouldn't use it unless you are generally a good person. based on the fragment that I see here, you aren't. not saying you shouldn't use an icon, but you shouldn't use that icon unless you want to be what it represents. it is literally among the only icons that mean anything, don't soil it.","replies":[{"poster":"Yaśuo Main","date":"2016-07-01T17:55:11.375+0000","up_votes":1,"down_votes":0,"body":"I actually fixed the \"Right to change icons\" to \"To have that icon\".\n\nOver time, league's been making me change in a tiny way, which is why you don't see me living up to my icon. Sorry 'bout that.","replies":[{"poster":"macromite","date":"2016-07-01T19:36:58.270+0000","up_votes":1,"down_votes":0,"body":"Well, then I apologize as well. and perhaps I can give you something to remember, that I too need to keep in mind.\n\nPlay Kind, Play well, and Play to win.","replies":[]}]}]}]}]},{"poster":"DeathBurst","date":"2016-07-01T14:21:26.074+0000","up_votes":1,"down_votes":0,"body":"So let's get back to your original post, shall we?\n\n> my 3 other friends were MEGA toxic. You can't tell me premeds aren't toxic.\n\nThese 2 sentences are absolutely not logical. There is no logical connection between the 2, and yes, I can tell you premades aren't toxic, or more precisely, not more toxic than solo players. Your 3 other friends were \"mega toxic\" because they are bad people, not because they were in a premade. So stop blaming premades...\n\nSo yeah, OK, sue me, I made an amalgam between \"premades\" and \"DQ\". Because, like, DQ is the thing that allows you to play with premades, you know? It's not because you didn't use the word that it's not related... <_<\n\nBut sure, insult me, you're only embarrassing yourself.","replies":[{"poster":"Yaśuo Main","date":"2016-07-01T17:41:38.771+0000","up_votes":1,"down_votes":0,"body":"Sorry bout that edit though, lol.\n\nBut yeah, I don't have an intention to insult you.\n\n\nAnd I've seen premades outside of DQ, if you wanna bring that up.\n\nbut yeah, differences aside, gg no re I was at fault and so were you.","replies":[{"poster":"DeathBurst","date":"2016-07-01T18:44:48.391+0000","up_votes":1,"down_votes":0,"body":"In case you missed it, the \"sue me\" was completely sarcastic. Dynamic Q **IS** the thing that allows you to go into a game as a group of people instead of alone. So no, you haven't seen any premade outside of DQ, by definition. I wasn't at fault.\n\nOh, and you can be sorry about that Edit, but since your very first reply you called me \"you ignorant species\". I don't really care, I can appreciate the irony in that, but maybe YOU should care, 's all I'm sayin'.","replies":[{"poster":"macromite","date":"2016-07-01T19:35:37.939+0000","up_votes":1,"down_votes":0,"body":"*Cough* *Cough* Blind isn't Dyna *Cough* *Cough* You might want to re analyze yourself. *Cough* *Cough*\n\nFor the most part I'm on your side here, but the other guy has got some good points.","replies":[{"poster":"DeathBurst","date":"2016-07-01T19:52:29.691+0000","up_votes":1,"down_votes":0,"body":"Well, yes it is. It totally is, to the point that Riot used the Normal Draft Q as a control group to differentiate the effects of Dynamic Q versus New Champion Select on the Ranked Draft Q.\n\nThe *word* was coined with the recent introduction of the concept to Ranked, but the stuff it describes is the same stuff whether you are in Blind/Normal Draft/Ranked, that doesn't matter.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Jimmyyy","date":"2016-06-30T18:02:36.971+0000","up_votes":2,"down_votes":0,"body":"Ha...","replies":[]},{"poster":"Calabok","date":"2016-06-30T04:56:28.390+0000","up_votes":4,"down_votes":2,"body":"Hammer your computer to bits. Problem solved.","replies":[{"poster":"Lirik","date":"2016-06-30T17:48:21.767+0000","up_votes":2,"down_votes":0,"body":"thats actualy a legit nice advice, at least its a better thing to do than keep playing this pile of crap named league.","replies":[]}]},{"poster":"macromite","date":"2016-06-30T16:01:42.589+0000","up_votes":1,"down_votes":8,"body":"No, want to know what you can do?\n\nhttp://ih0.redbubble.net/image.213329126.5433/fc,220x200,black.jpg","replies":[{"poster":"OxyPoro","date":"2016-06-30T16:29:28.285+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=macromite,realm=NA,application-id=3ErqAdtq,discussion-id=jqLKBVOb,comment-id=0009,timestamp=2016-06-30T16:01:42.589+0000)\n>\n> No, want to know what you can do?\n> \n> http://ih0.redbubble.net/image.213329126.5433/fc,220x200,black.jpg\n\nHow git so gud rekked bronze? Please tell me moar, you're a God! Kreygasm\n\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"macromite","date":"2016-06-30T17:33:13.402+0000","up_votes":1,"down_votes":4,"body":"Not even gonna try to translate this.","replies":[{"poster":"OxyPoro","date":"2016-07-01T07:01:57.838+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=macromite,realm=NA,application-id=3ErqAdtq,discussion-id=jqLKBVOb,comment-id=000900000000,timestamp=2016-06-30T17:33:13.402+0000)\n>\n> Not even gonna try to translate this.\n\nTranslates into: \nScraping by bronze with mediocre stats does not entitle you \nto be telling others to \"git gud\" or \"git rekt\".\nAs the vast majority of players in this game still outrank/outskill/outteamwork you, \nwith or without premaking.\n\n\"Git it\"?\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]}]}]},{"poster":"Have a Nice Game","date":"2016-07-01T00:01:50.002+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=HcSUJd3PXNs&t=1m25s","replies":[]}]},{"poster":"Tobias Brackner","date":"2016-07-01T01:06:02.698+0000","up_votes":2,"down_votes":1,"body":"I don't understand the whole premade hate thing.  I've only played against a few people who seem to have coordination on point enough that it is obv they are usin good voice chat.  Most of the time I can't tell the difference.","replies":[{"poster":"TrapinProgress","date":"2016-07-01T01:49:58.383+0000","up_votes":2,"down_votes":2,"body":"I play with 2-3 people just about every game and almost never play without 1 person im queued with, I can only count like 3 instances in months that I went against a premade that was toxic like how all these boards usually end up complaining about. When I play with said 2-3 people they are probably the nicest people in chat, and the most toxic thing I do is tell one of my laners they need to group more or type \"WTF\" when I try to spoon feed a kill to our behind vayne","replies":[{"poster":"Tobias Brackner","date":"2016-07-05T08:26:49.246+0000","up_votes":1,"down_votes":0,"body":"Yeah, I can't help but feel people just want to flip out over a few isolated cases (all of which can be solved by mute&report)","replies":[]}]}]},{"poster":"Bârd","date":"2016-07-01T17:11:36.918+0000","up_votes":1,"down_votes":0,"body":"Nope.","replies":[]},{"poster":"Sidestep","date":"2016-07-01T11:41:41.414+0000","up_votes":1,"down_votes":0,"body":"If only this was the case. Then I could play top lane again with less coordinated dives! :)","replies":[]},{"poster":"spombjop","date":"2016-06-30T04:45:43.239+0000","up_votes":1,"down_votes":4,"body":"Get MS runes, \nmasteries? Full MS.\n\nPick Rammus. Start boots.\n\nYou know the rest.","replies":[{"poster":"Mig89","date":"2016-06-30T17:37:28.372+0000","up_votes":2,"down_votes":0,"body":"{{champion:33}} Okay","replies":[]}]},{"poster":"Subject 5","date":"2016-07-01T01:09:22.530+0000","up_votes":1,"down_votes":1,"body":"Just got done with a game that was a 4 premade vs 4 premade.\n\nIt was horrible.\n\nFuck. Riot.\n\n\"We heard ya'll wanted ranked 5's!\" ~Gives ranked 5's back\n\"We heard you wanted DQ back!\" ~Gives a fucking sticker.\n\nSeriously, please, somebody reincarnate Hitler so we can install him into LoL, that way, at least the only thing we can complain about is toxicity.","replies":[]}]}