{"poster":"Firemage","date":"2015-09-26T08:17:29.537+0000","title":"Vakmerő Ahri kinézet","subforum":"Általános beszélgetés","up_votes":1,"down_votes":0,"body":"Sziasztok !\r\nArra lenn&eacute;k kiv&aacute;ncsi hogy a Season 4 kezdetekor megjelent kihiv&oacute; Ahri kin&eacute;ztek lesz-e m&eacute;g &uacute;jra el&eacute;rhet&ouml; a j&aacute;t&eacute;kosok sz&aacute;m&aacute;ra , \r\nvagy m&aacute;r nem lehets&eacute;ges megszerezni ? A k&eacute;rd&eacute;s el&eacute;g fontos mivel Ahri a kedvenc h&ouml;s&ouml;m &eacute;s sajnos id&eacute;n lemaradtam\r\na kin&eacute;zet megv&eacute;tel&eacute;r&ouml;l :/\r\nA v&aacute;laszokat előre is k&ouml;sz&ouml;n&ouml;m !","replies":[{"poster":"Mind The Gap","date":"2015-09-26T09:06:28.505+0000","up_votes":2,"down_votes":0,"body":"A Lunar Revel alkalmával lehetett elérni, Február másodikától azt hiszem. A kinézet egyébként idén jött be, Season 5-ben. Én le is csaptam a kinézetre. Jövőre is elérhető lesz szerintem.","replies":[{"poster":"Shikaichi","date":"2015-09-26T09:24:21.436+0000","up_votes":1,"down_votes":0,"body":"Az Ahri skin egy patch-el előrébb volt, mint a Lunar Revel. :)","replies":[]}]},{"poster":"SportzMan","date":"2015-09-28T07:39:03.985+0000","up_votes":1,"down_votes":0,"body":"Az ahri skinnek nem volt köze a lunar revelhez.. És limited skin mint pl. a Világbajnok Riven, tehát ha így marad  akkor csak valami speciális alkalommal lesz elérhető majd, vagy majd sok év múlva, mint ahogy a Kiscica Katarina is elérhető lett és ahogy majd 2016-ban a Világbajnok Riven is lesz.\n\nEdit: Utána néztem. Nem a limitált skinek hanem a legacy skinek közé van sorolva a skin, tehát olyan mint a Világbajnoki Thresh, azaz zsákbamcskából megszerezhető, és biztos hogy későbbiekben viszont fogjuk látni. Továbbá még annyi, aki elfelejtette volna már, hogy ez egy új skin téma lesz, ami a szezonnyitást ünnepli meg, azaz januárban újabb 'Vakmerő' (az angol Challenger sokkal találóbb) skin fog érkezni, és valószínű a Vakmerő Ahri is visszatér.","replies":[{"poster":"Firemage","date":"2015-09-29T13:23:59.712+0000","up_votes":1,"down_votes":0,"body":"Köszönöm a válaszodat , arra lennék még  kiváncsi ( ha nem veszed tolakodásnak ) honnan tudod hogy a világbajnok riven ujra elérhetö lesz?\nÉs biztos ez az infromácio ?","replies":[{"poster":"SportzMan","date":"2015-10-07T09:38:07.928+0000","up_votes":1,"down_votes":0,"body":"Hippalus nyilatkozta ezt tavaly valamikor, de itt az idézet és a link is:\n\nhttp://www.surrenderat20.net/2014/10/red-post-collection-ecommerce-q-recap.html?m=1\n\n'When asked about Championship Riven returning to the store, Hippalus noted:\n\n    \"Yes I think Championship Riven will come back someday. Most limited edition skins took four years to come back after release, and it's been two years for Riven so far.\" '\n\nTovábbá egyértelmű, hogy akarnak csomagot kiadni ezekből a skinekből is, szóval úgy készülj 2016 őszére, hogy ha Világbajnok Rivent szeretnél, akkor az összeset meg kell venned majd.","replies":[]}]}]},{"poster":"Kaltesonne","date":"2015-09-28T07:48:01.967+0000","up_votes":1,"down_votes":0,"body":"Giftből bármikor megkaphatod csak szerencse kell hozzá azt hogy megvehető mikor lesz ... hát jó kérdés :D{{champion:103}}","replies":[]}]}