{"poster":"LuckyStrike123","date":"2018-08-23T04:56:52.570+0000","title":"Twisted Fate desbalanceado","subforum":"Jugabilidad, balance y narrativa","up_votes":5,"down_votes":1,"body":"Cuando empeze a jugar en julio del 2017 jugue por 1ra vez a twisted fate {{champion:4}}  y era muy bueno tanto que una vez termine una partida 33/0 pero desde que cambiaron las runas ni lo puedo jugar, no sirve practicamente de nada hasta armarte por lo menos 2 objetos sus habilidades tienen mucho cd sus basicos hasta con la pasiva de la E no pegan nada y por si fuera poco durante todo el 2018 la unica vez que lo tocaron en un parche fue cuando hicieron los cambios de man&aacute; cada vez que hay un nuevo parche reviso a ver si aparece TF por si le hicieron unos cambios pero nunca lo veo y honestamente no lo puedo ni jugar, en el unico lugar en donde lo puedo jugar es en support tirando puras cartas amarillas, no juzgo a nadie pero creo que le hace falta un buff urgente Gracias por su atencion.\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Maedme","date":"2018-08-23T06:42:21.969+0000","up_votes":3,"down_votes":0,"body":"...mejor aprende a usarlo.","replies":[]},{"poster":"Zinc","date":"2018-08-23T05:15:02.195+0000","up_votes":3,"down_votes":0,"body":"Es Tier 1 ahora mismo, y es el 8tabo mid con mas win rate, yo lo juego, es mi main con 290k de pts de maestria, y esta muy fuerte.","replies":[{"poster":"Hnk Kenshiro","date":"2018-08-23T12:04:48.024+0000","up_votes":2,"down_votes":0,"body":"Nunca me gusto con {{item:3027}} con el, si lo burstean morirá igual y la pasiva no creo que la note tanto, rusheo un {{item:3285}} y después liche y reloj.\n\n¿Que tan mal estoy? xd","replies":[{"poster":"Zinc","date":"2018-08-23T15:33:25.374+0000","up_votes":1,"down_votes":0,"body":"Mira, si te soy sincero yo solo uso la build core el 50% del tiempo, dado que m acostumbre a mi propio estilo de juego previo a que op gg publicara como jugaran los pro, por eso se m hace \"raro\" cuestionar otra build \"no standard\", sinembargo...\n\n\n> [{quoted}](name=Hnk Kenshiro,realm=LAS,application-id=xQmJPO8F,discussion-id=x1yNIZGG,comment-id=00020000,timestamp=2018-08-23T12:04:48.024+0000)\n>\n> Nunca me gusto con {{item:3027}} con el, si lo burstean morirá igual y la pasiva no creo que la note tanto, rusheo un {{item:3285}} y después liche y reloj.\n> \n> ¿Que tan mal estoy? xd\n\nNo entiendo el orden. Cual seria la justificacion del Eco antes del liche?\nAl margen de eso no veo nada malo.\n\nEdit: El objetivo de la Vara es aguantar la fase de lineas por un lado, y obtener vida y mana mientras te vas preparando para el mid/late que es donde brillas por otro, no tanto para sobrevivir la bursteo... a no ser que sea el bursteo del 1 vs 1 en linea q si sobrevivirias. ","replies":[]},{"poster":"por el Ñackson","date":"2018-08-23T13:51:10.331+0000","up_votes":1,"down_votes":0,"body":"tampoco me gusta {{item:3027}} pero todos los pro lo hacen y yo solo queria ser popular","replies":[]}]}]},{"poster":"Yitán","date":"2018-08-23T06:38:46.170+0000","up_votes":2,"down_votes":0,"body":"segun challengers fue el mid mas balanceado del año, es mas, segun dopa en todo momento del año siempre fue uno de los 3 o 5 mejores campeones de mid de cada parche, y ese no lo dice solo por ser main, ya que tambien es main viktor pero acepta que estuvo en una etapa de bajo rendimiento el champ.","replies":[]},{"poster":"Renekor","date":"2018-08-23T05:10:27.000+0000","up_votes":2,"down_votes":0,"body":"Esta bien como esta","replies":[]},{"poster":"Cris300","date":"2018-08-24T21:49:56.376+0000","up_votes":1,"down_votes":0,"body":"no tienes ni idea de las runas mijo","replies":[]},{"poster":"wolfie","date":"2018-08-23T18:59:09.618+0000","up_votes":1,"down_votes":0,"body":"{{champion:4}} no es un champ de daño, es un roamer. Es decir usas tu presencia global para ganar peleas y snowballear a tu team.","replies":[]},{"poster":"SolidDisk","date":"2018-08-23T18:23:32.361+0000","up_votes":1,"down_votes":0,"body":"Buenas!\n\nUnos tips:\nPrimero rushea algo de cd y sustain incluso movilidad no te enfoques en el ap bruto de arranque.\n2 busca aprender a pararte en linea, el error grave de todos los tfs es jugar a pokear con habilidades. Como cualquier champ deberias de pokear y farmear a la vez y sobre todo abusar de tus basicos que poco a poco desgastan.\nLuego mas alla del daño el impacto es el roam que tiene.","replies":[]},{"poster":"fenixerege","date":"2018-08-23T11:58:44.002+0000","up_votes":1,"down_votes":0,"body":"tal vez te faltaria aprender mas tips de como aprovechar el champ.........","replies":[]},{"poster":"ToxicRunner","date":"2018-08-23T05:00:25.764+0000","up_votes":1,"down_votes":1,"body":"Opinó igual, lo jugue muy pocas veces debido a que me sentía con muy poco daño.\nCreo que es un campeón de utilidad, y eso explicaria el por qué de ese daño.","replies":[]}]}