{"poster":"DogIsGod","date":"2015-11-21T15:36:02.583+0000","title":"Annoying =/= OverPowered. I cannot stress this enough","subforum":"Gameplay","up_votes":114,"down_votes":28,"body":"Please, stop confusing these two terms. Just because a champion is not fun to play against, annoying, it does not mean that particular champion is some broken, OP character who should be gutted and nerfed into oblivion until it no longer sees play.\n\nAlso, too often I see mains who have clearly mastered a champion, who know its ins and outs trying to explain its weaknesses and how to capitalize on them and instead of paying attention and taking into account the pieces of advice that have been given to them, some players would much rather just do nothing about improving their own gameplay and just ask for nerfs, since that is the easy way out.\n\nAll I&#039;m asking you to do is take the time to look into the champion you most despise, play a few games with it and maybe watch someone play it and get to know their strengths and weaknesses. I promise you, this will make your gameplay much more enjoyable and who knows, maybe it will open up some opportunities. \nTake me for example, I used to hate Yasuo&#039;s guts so much that I would just complain about him over and over again for being annoying and OP until I decided I should try him out and see what he&#039;s about and what his power is and how I can work around it. Well, as it turned out he&#039;s quite a lot of fun to play and he&#039;s only recently become a tad bit stronger, but a few months ago I used to find him OP then once I tried him out it was clear to me that he was not the source of my problems, but me being close minded.\n\n* **EDIT**: _I gave Yasuo just as an example as to why you shouldn't judge a book by its covers. Don't take it so seriously. The point of the post has nothing to do with Yasuo alone, but rather with every champion that might be getting hate or what not_\n* **EDIT2**: _Typos_","replies":[{"poster":"Stars Shaper","date":"2015-11-21T15:38:16.749+0000","up_votes":13,"down_votes":49,"body":"Well you summed up each and every \"Yasuo whine\" thread since the last 84 years.","replies":[{"poster":"Penns","date":"2015-11-21T16:04:01.584+0000","up_votes":65,"down_votes":5,"body":"Annoying =/= immunity to being op\neZ","replies":[{"poster":"Stars Shaper","date":"2015-11-21T16:05:33.700+0000","up_votes":3,"down_votes":21,"body":"Wat?","replies":[{"poster":"Sevixys","date":"2015-11-21T17:40:17.688+0000","up_votes":50,"down_votes":6,"body":"Yasuo definitely is op. He is annoying too but that doesn't exclude him being op. Got it? {{summoner:2}}","replies":[{"poster":"YumaS2Astral","date":"2015-11-21T21:34:39.338+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Sevixys,realm=EUNE,application-id=3ErqAdtq,discussion-id=ABYXqd5j,comment-id=0000000000000000,timestamp=2015-11-21T17:40:17.688+0000)\n>\n> Yasuo definitely is op. He is annoying too but that doesn't exclude him being op. Got it? {{summoner:2}}\n\nOn my opinion Yasuo actually became OP now due to Warlord's Bloodlust and the fact that he can get 100% crit chance with only 2 items (compare this to the time where he had to build Statikk, Trinity, and Infinity Edge to have 100% crit chance, and all those items were more expensive).","replies":[]}]}]}]},{"poster":"Redaga","date":"2015-11-21T18:00:47.631+0000","up_votes":39,"down_votes":9,"body":"no, 1 champ with 2 passives\n2 shields\nnext to 0 cool down\ncan reach 100% critical with 2 items\n1 spell has 1200 range and does critical\nand have that much mobilty\n\n{{champion:74}} and {{champion:17}} are annoying, windy samurai of unbalance is broken","replies":[{"poster":"KaisadiIIa","date":"2015-11-21T20:54:16.416+0000","up_votes":14,"down_votes":7,"body":"I wanna play that game too:\n{{champion:78}} \n50% damage reduction when taking, at least, 10% of your current health as damage.\n2 passives.\nMore passive damage and armor on W.\nA basic attack empowerment that scales with AD, AP and % of your opponent's health.\nDamage amplification.\nImmunity to all effects.\nA dash that drags and stuns enemies.\n\n{{champion:9}} \n4.95 AP scaling on two abilities.\nPoint and click fear.\n2.25 AP on an AoE that teleports you.\nPoint and click silence.\nPoint and click 2.25 AP DoT.\n80% spell vamp.\nInnate magic resistance shred.\n\nI can do this with literally every champion.","replies":[{"poster":"junglerboy16","date":"2015-11-21T23:03:52.539+0000","up_votes":3,"down_votes":8,"body":"2 Damage amps\n2 Slows\n400% Bonus AD ratio across all abilities\nPoint and click blink\nStealth+Bonus MS\nAuto attack reset\nRanged nuke\nAoE Burst\n\n{{champion:91}} :D\n\n2 passives\nFree tenacity\n650 range Gap closer\n2 second Stun/slow+nuke\n340% Bonus AD and 250% AP across all abilities\nTrue damage on hit\nHeal on-hit\n25/10% Spellvamp\n\n{{champion:39}} \n\nreduces enemy damage\n1200 range auto targeted nuke\nShield\nArmor shred\n1 second suppression\n850 range gap closer\n50% damage reduction\non-hit 40% slow\n850 range enemy pull\n\n{{champion:6}}","replies":[{"poster":"RetroRage96","date":"2015-11-21T23:49:46.795+0000","up_votes":18,"down_votes":2,"body":"{{champion:119}} \n\n- Super cool\n- The best champion\n- Better than you\n- Can pentakill by just typing \"/laugh\"\n- Most damage\n- Most CC\n- Most safety\n- Most engage\n- Most tank\n- Draaaaven","replies":[]}]},{"poster":"ChaoticPinecone","date":"2015-11-22T02:30:01.973+0000","up_votes":1,"down_votes":2,"body":"OK - first of all, Poppy is pretty OP. And as many have said before me, if she ever becomes popular in the LCS she will be reworked instantly. \n\nAnd how about glaring weaknesses? Fiddle has 2 channels as part of his abilities. Getting full damage out of his drain requires a 5 second channel. He is also pretty immoble - his only mobility spell is linked to his ult and it requires a 1.5 second channel to activate, which, if interrupted, gets put on a full CD. And speaking of his ult cooldown, it has one of the longest cooldowns in the game (I can only think of Shen and Karthus as longer).","replies":[{"poster":"TotalJerk","date":"2015-11-22T04:01:13.080+0000","up_votes":6,"down_votes":1,"body":"Poppy isn't OP, but she *is* broken, there's a difference.","replies":[]}]}]},{"poster":"Oshlet","date":"2015-11-21T18:29:01.172+0000","up_votes":10,"down_votes":9,"body":"2 passives isn't really a valid excuse. Several champions have more than 1 passive and aren't really complained about. When was the last time someone whined about J4 being op?\nI don't think Yasuo's windwall has 'Next to 0 cooldown' Unless you count weird and 16 or whatever the cooldown is, is next to 0.\nThe 100% crit with two items is iffy, not gonna lie, but do remember to mention that his crits do less damage than other champions.\n1 spell does have 1200 range and does critical. You have to hit it twice first though and it has pretty crap base damage, meaning you have to itemize towards damage for it to be effective which leaves you squishy.\nHe does have lots of mobility but its situational, he can only go towards targets and thus has somewhat less safety than say zed (to make an assassin comparison) or fiora (to make a melee hypercarry comparison).\n\nYasuo is pretty crazy, not gonna lie but listing off vague bullshit to make him seem OP doesn't assist your argument.","replies":[{"poster":"Xengre","date":"2015-11-21T18:44:10.627+0000","up_votes":8,"down_votes":2,"body":"> [{quoted}](name=Oshlet,realm=EUW,application-id=3ErqAdtq,discussion-id=ABYXqd5j,comment-id=000000010000,timestamp=2015-11-21T18:29:01.172+0000)\n>\n> 2 passives isn't really a valid excuse. Several champions have more than 1 passive and aren't really complained about. When was the last time someone whined about J4 being op?\n> I don't think Yasuo's windwall has 'Next to 0 cooldown' Unless you count weird and 16 or whatever the cooldown is, is next to 0.\n> The 100% crit with two items is iffy, not gonna lie, but do remember to mention that his crits do less damage than other champions.\n> 1 spell does have 1200 range and does critical. You have to hit it twice first though and it has pretty crap base damage, meaning you have to itemize towards damage for it to be effective which leaves you squishy.\n> He does have lots of mobility but its situational, he can only go towards targets and thus has somewhat less safety than say zed (to make an assassin comparison) or fiora (to make a melee hypercarry comparison).\n> \n> Yasuo is pretty crazy, not gonna lie but listing off vague bullshit to make him seem OP doesn't assist your argument.\n\nI'm not on the hate train for Yasuo, I think Jax is far worse atm. That said...\n\n-He has two POWERFUL passives that are very meaningful at all points of the game. J4 has seen a LOT of hate in League, maybe not right now but that was a really poor example.\n-Yasuo's Q has nearly 0 CD, as does his E depending on usage.\n-Yasuo's crit is slightly less than others but his overall DPS is FAR higher, especially early on when they can't crit as often making even his normal hits far more powerful before considering his DPS combo. He can also put out 3 autos-6 autos in the time another champ can auto 1-2x nullfying any argument of \"reduced damage\" because of nonsense like auto->Q/E->canceling. His ult does a crazy amount of damage and gives MASSIVE armor penetration on all targets for a rather long period of time meaning no one really beats his damage. In the end... Tons of damage!\n-It has crap damage before considering that it will crit every time almost, it can reset his auto attacks, it is extremely extremely spammable, and can reach 3 charges in about 6 or less seconds at max reduction, also procs Shiv which will hurt even more than usual because it is almost guaranteed to crit every activation. Yasuo has a Wind Wall to negate obscene amounts of damage, he has a shield, he does extremely high damage and can further survive by healing off his crazy damage or outright insta-kill a target, and he has his dash for substantial mobility to outplay with. He can grab 2-3 offensive items and go full tank and still obliterate, and he can ignore armor penetration items unlike other ADCs due to his crazy ult.\n-His mobility can be used over walls to escape to jungle camps, it can be used to dash around in lane forcing minion harass or just to kite an enemy or create significant distance. While his mobility is situational it definitely has uses for keeping him alive rather than just sheer offensively charging the target. Zed is an unfair comparison. No one really has Zed's safety.\n\nI would watch your own comment before you start making further inaccurate claims about other people's.","replies":[]},{"poster":"Redaga","date":"2015-11-21T18:40:02.961+0000","up_votes":7,"down_votes":4,"body":"everything on its own its cool, but when you combine all that (range, mobility, 2 shields, Critical %) yasuo is among the most OP champs in the game","replies":[]}]},{"poster":"Verxint","date":"2015-11-21T20:27:21.444+0000","up_votes":7,"down_votes":3,"body":"See OP, this is why you can't argue with these people.\n\nThe only response you ever get it \"see, the champ can do this therefore he's broken\"","replies":[{"poster":"Spacesuit Spiff","date":"2015-11-22T03:20:52.481+0000","up_votes":2,"down_votes":0,"body":"Nothing nuanced will fly here. The ppl who actually care about such things are off actually learning more about the game","replies":[]}]}]}]},{"poster":"LVL 5 PORO","date":"2015-11-21T16:39:56.904+0000","up_votes":39,"down_votes":5,"body":"People hate Yasuo because he's overpowered **AND** annoying. If he was just annoying, people wouldn't complain. Teemo is annoying, but he isn't overpowered. If annoying = overpowered, there would be 100 post a day about nerfing Teemo and Heim. Riot literally gave Yasuo a third passive with the crit/heal mastery, the ADC itemization changes heavily favor him, and he was by no means weak before, but now he is just horrendous in all aspects. \n\nHe is quite literally a walking tumor and makes playing unfun for everyone. He's a resourceless, highly mobile, high utility, hyper carry ... and if that wasn't enough, he now has high sustain. So don't sit here and lie like he isn't as broken as Riven's sword, when we all know for a fact he is. If he wasn't, Riot wouldn't be targeting him for nerfs.","replies":[{"poster":"Spoofghoul","date":"2015-11-21T17:54:58.536+0000","up_votes":21,"down_votes":3,"body":"Yasuo isn't just overpowered AND annoying but he also has a broken kit.","replies":[{"poster":"DogIsGod","date":"2015-11-21T18:04:23.549+0000","up_votes":2,"down_votes":24,"body":"***","replies":[{"poster":"LVL 5 PORO","date":"2015-11-21T18:28:26.968+0000","up_votes":18,"down_votes":2,"body":"> [{quoted}](name=DogIsGod,realm=EUNE,application-id=3ErqAdtq,discussion-id=ABYXqd5j,comment-id=000900000000,timestamp=2015-11-21T18:04:23.549+0000)\n>\n> If he's so broken, then why do you have a 66% win-rate against him out of 26 games? And L ANGE NOIR VON has 60% out of 5.\n\nBecause I learned how to outplay him. I got tired of him a long time ago and learned how to deal with him, but that doesn't change the fact that he is broken as all hell. If I want to win a game against Yasuo, I **HAVE** to lane against him, and if I cant do that, I have to jungle because 9 times out of 10 he will crush my team and I do not trust them enough to lane against him.","replies":[{"poster":"CptPic4rd","date":"2015-11-21T23:33:07.873+0000","up_votes":4,"down_votes":10,"body":"If you've learned to beat him, then anyone can learn to beat him. The problem isn't with yasuo, it's with noobs who don't know how to lane against him.","replies":[{"poster":"RetroRage96","date":"2015-11-21T23:56:44.113+0000","up_votes":14,"down_votes":2,"body":"By that bullshit reasoning, every champion in the game is balanced.\n\"If someone else practiced and figured out how to beat a champion, everybody should know how to beat them, so therefore they are balanced and it is the opponent's fault for losing to a broken champ.\"\nYeah okay.","replies":[{"poster":"flibitydoo","date":"2015-11-22T05:10:51.674+0000","up_votes":3,"down_votes":3,"body":"Now let's read that comment without bias.\n\n> [{quoted}](name=RetroRage96,realm=NA,application-id=3ErqAdtq,discussion-id=ABYXqd5j,comment-id=000900000000000100000000,timestamp=2015-11-21T23:56:44.113+0000)\n>\n> By that reasoning, every champion in the game is balanced.\n> \"If someone else practised and figured out how to beat a champion, everybody should know how to beat them, so therefore they are balanced and it is the opponent's fault for losing to a champ.\"\n\nIt actually makes a lot of sense. And seems to be quite a fair statement. I don't see why you would attack that point in their argument seeing how logical it is.\n\nIf player X (consistently) loses against champion Y, but player Z (consistently) wins against champion Y despite both having access to the same given tools, then it's quite clear that player X does not know how to play against a champion Y, and that player Z does, and the issue is that player X needs to figure out how to play like player Z in order to be successful.\n\nFor example, Blitzcrank, most high level players in understand that the best way to counter blitz in lane, is to put a minion (an allied one) between you and the robot, and if he walks into the bush, to ward that bush (and then put a friendly minion between you and the robot). Late game, the solution is quite similar, make sure someone else (like your team's amumu) is between you and blitz. But there's a lot of low level players out there who don't know that and that's one of the reasons why they struggle against him. And a lot of these players who fail complain on the boards about him. The issue is that they don't know how to play against the champion rather than the champion being broken or OP. It's punishing a mistake that the player should learn to not make.\n\nAs another example, Katarina, most high level players understand that much of Katarina's damage comes from her ultimate which is channelled and requires her to stand still, but can be disrupted through the use of hard cc. her natural item build encourages her to forego defenses meaning that if she dives into a large group of champions and is immediately stunned, then she will die before the stun ends. And again, in low levels of play, players don't hold onto their cc abilities and instead rely on firing every button at the same time at the start of a teamfight resulting in katarina punishing her enemies for making the mistake of not prioritizing her as a dangerous threat and preparing accordingly (mentally or physically).","replies":[{"poster":"Malix Farwin","date":"2015-11-22T13:25:16.124+0000","up_votes":3,"down_votes":0,"body":"There is a huge flaw in your reasoning and there are several points that need to be addressed. First of all, overpowered does not mean unbeatable, it means over-tuned in one area or another or even several aspects. If Player X can consistently win against Yasuo however Player Y cannot for example, simply means Player X average champion pool are made up of counters for Yasuo while Player Y is not. You can beat yasuo with Zed or constant ganks but it does not mean that he is balanced.\n\nOh i noticed you have compared low end players to high end ones however what you fail to realize is that high end players are well aware of their champions weaknesses and are able to adjust accordingly so using player skill in this argument is invalid unless it is champions like zed and syndra that take a great deal of skill to master. Do you for example honestly believe that a high elo blitzcrank doesn't know that their opponent knows about minion's ability to block his hook, they not only know but have ways around it and much more precise with their skillshots, timing, and ability hitboxes. Same deal with katarina, she knows you want to CC her however she can use that to her advantage to bait out your CC, force you to hold it while her team goes in and so fourth.","replies":[]}]}]},{"poster":"LVL 5 PORO","date":"2015-11-22T00:22:28.055+0000","up_votes":6,"down_votes":1,"body":"I literally spents months in PvS games playing against a diamond Yasuo main to learn how to outplay him. Even with all that practice I still cringe going against him. No, people arent \"noobs,\" Yasuo is just insanely broken.","replies":[{"poster":"CptPic4rd","date":"2015-11-22T03:03:17.727+0000","up_votes":4,"down_votes":3,"body":"Well in silver elo, the Yasuo's aren't that good. It's not that hard to beat them. Yet most of the people I see doing the complaining are around Silver. So those people really do just need to practice and use their brain a little.","replies":[]}]}]}]}]}]}]},{"poster":"HatMan2","date":"2015-11-21T16:00:05.799+0000","up_votes":25,"down_votes":0,"body":"I think this post relates to {{champion:74}} \n\nHe is annoying but he can be beat if you play it correctly. Not op but just annoying.","replies":[{"poster":"HayRoss","date":"2015-11-21T17:11:47.449+0000","up_votes":14,"down_votes":1,"body":"Or {{champion:17}}\n\nHe's really not that strong, but his entire kit is based off of annoying the hell out of whoever you are against","replies":[]},{"poster":"OverpoweredSoap","date":"2015-11-21T16:01:11.675+0000","up_votes":7,"down_votes":1,"body":"> [{quoted}](name=HatMan2,realm=NA,application-id=3ErqAdtq,discussion-id=ABYXqd5j,comment-id=0003,timestamp=2015-11-21T16:00:05.799+0000)\n>\n> I think this post relates to {{champion:74}} \n> \n> He is annoying but he can be beat if you play it correctly. Not op but just annoying.\n\nHis annoying factor is more from Zhonya's than anything else, if Zhonya's wasn't an item he'd be a lot less annoying.","replies":[]}]},{"poster":"Dominick Destine","date":"2015-11-21T16:07:25.121+0000","up_votes":31,"down_votes":13,"body":"Janna is annoying, but not overpowered.\nCho Gath is annoying, but not overpowered.\nTeemo is annoying, but not overpowered.\n\nYasuo is overpowered.\nLee Sin is overpowered.\nThresh is overpowered.","replies":[]},{"poster":"iainB85","date":"2015-11-21T19:56:48.016+0000","up_votes":16,"down_votes":2,"body":"{{champion:157}} : Can it... can it be both?","replies":[]},{"poster":"Punkkee","date":"2015-11-21T18:00:32.824+0000","up_votes":15,"down_votes":2,"body":"yasuo tryn op \nheim lux annoying","replies":[{"poster":"Melledoneus","date":"2015-11-21T23:44:34.975+0000","up_votes":5,"down_votes":0,"body":"Fiora, Tahm OP.\n\nAny person good at a champion is annoying.","replies":[]}]},{"poster":"GhastlyGhoulMan","date":"2015-11-21T16:22:51.792+0000","up_votes":11,"down_votes":0,"body":"So how DO you play against a Yasuo? Wondering what you've found most useful.\n\nEdit: Assume I'm playing a fairly immobile mage.","replies":[{"poster":"DogIsGod","date":"2015-11-21T18:47:54.326+0000","up_votes":2,"down_votes":6,"body":"***","replies":[{"poster":"RasCaelestis","date":"2015-11-21T20:27:33.894+0000","up_votes":6,"down_votes":2,"body":"> [{quoted}](name=DogIsGod,realm=EUNE,application-id=3ErqAdtq,discussion-id=ABYXqd5j,comment-id=00070000,timestamp=2015-11-21T18:47:54.326+0000)\n>\n> ...but usually what you wanna do against a Yasuo is to work around his brain pretty much. If you know what he's about to do you can easily out-trade him.\n\n\nAnd that's the main reason why people have a problem with Yasuo.  When facing most champions, you can set up things yourself with the tools provided by your own kit.  When facing a Yasuo, you need wait for HIM to set things up, and he's not going to do that unless he thinks he can win.  You need to work around other champions too, don't get me wrong, but for Yasuo it's a whole new level.  \n\nYou need to wait for him to make a mistake, but with his shield and wall and mobility, he can make a few and still be okay overall.  However, if you make even a small mistake against Yasuo, in most cases, you're not going to get out alive.","replies":[]}]},{"poster":"LVL 5 PORO","date":"2015-11-22T00:14:14.858+0000","up_votes":4,"down_votes":2,"body":"I don't play many immobile mages, sorry. But the ones I do ... Lissandra, Syndra, Morgana, and Zyra all have a similar trait. They can all heavily punish his mistakes (excluding Syndra, to a degree). One of the things I hate about Yasuo is that he completely dictates the lane. Your play style revolves around how good or bad he is. But the number one thing you can carry over to all matchups is trading ability. **Learn to harass with Auto Attacks and you have a significantly higher chance of winning lane. **\n\nThe first thing you do against Yasuo is talk to your jungler. As soon as the game starts you tell him, \"Hey, Yasuo is going to push the lane, if you gank mid it'll be an easy kill.\" If your jungler isn't a complete potato he will be ready to gank your lane 24/7. Yasuo likes to push the lane, that's what he does, he pushes and pushes and pushes to apply pressure. But any half-competent jungler will punish him hard for doing so. If I jungle against Yasuo, I camp him. As soon as he is locked in my jungler senses go: first gank already determined. Remember this, toxic players are attracted to toxic champions. I've camped Yasuo's so hard that they tilted off the face of the Earth. They've raged and called me everything under the sun. I love it. \n\nWhich brings us to our next \"ability\" ... tilting. As bad as it sounds, trying to tilt someone is a legitimate strategy and it actually works. Yasuo is broken, and as such, anyone that plays him will go into a match thinking they will stomp hard and is Faker-incarnate. You need to play off this ego. I wont go into details but all chat is a weapon. \n\nIf you are going to play an immobile mage against Yasuo, they need hard CC and peel: \n\nYasuo gets close to Liss? Root him, wreck him. \nYasuo gets close to Lux? Root him, wreck him.\nYasuo gets close to Morgana? Root him, wreck him.\nYasuo gets close to Zyra? Root him, wreck him. \nYasuo gets close to Syndra? Knockback-stun him, wreck him.\n\nSee the common theme here? If he gets within melee range of any of them they can punish him heavily without taking much damage. \n\nFinally, **conserve your mana and learn to farm under the turret!** This is the most important thing. Lets assume you are going against a REALLY aggressive Yasuo and he is pushing you under the turret and chucking tornado's at you. Most people will panic and throw out every spell they have to kill the minions. DO NOT DO THIS! If Yasuo is going to push the lane, let him. Conserve your mana and relax. He is screwing himself by doing this. All you have to do is let the tower do the work and wait for your jungler to come. He cant kill you under the tower, so he cant snowball. All he's doing is making himself an easy gank target. If you blow all your mana trying to keep the lane even, you lose. Game over. Once you have no mana, it becomes hard to cs and you can no longer harass, even if your jungler does come you cant help him with no mana. \n\nIf he is determined to push you under the turret, and you are panicking, let the current minion wave die. Dont even try to kill any of the minions. Walk under your turret. Take a deep breath, and wait for the lane to reset. Then remember this:\n\nMelee minions = 2 turret shots + 1 Auto Attack\nCaster minions = 1 Auto Attack + 1 turret shot + 1 Auto Attack\n\nMissing one wave is better than staying in panic mode, burning through all your mana, and losing lane. Just relax. I would go into more detail but this post is already an essay so I wont turn it into a novel. Good luck.","replies":[]}]},{"poster":"Akali is SO HOT","date":"2015-11-21T18:22:46.837+0000","up_votes":12,"down_votes":5,"body":"lol I love how everyone is ignoring the OP and skipping right to the Yasuo QQ","replies":[]},{"poster":"Profirix","date":"2015-11-21T19:22:50.665+0000","up_votes":6,"down_votes":0,"body":"Well, what if their ability to annoy someone and cause them to play poorly is giving them too much power. For example, the new champion, Illaoi will be particularly annoying in lane because of how much zone control she has over the opponent with her tentacles. The tentacles may not be particularly powerful, but when you are forced to play a certain way simply because a champion exists with a certain archetype (Evelynn is another excellent example), the two are correlated.","replies":[]},{"poster":"Ch0c0lateJesus","date":"2015-11-21T16:21:43.643+0000","up_votes":2,"down_votes":8,"body":"I think if a champion is legendarily unfun to play against {{champion:17}} then it represents and essential{{champion:157}} problem with{{champion:223}} design in a game that is{{champion:53}} meant to be enjoyable at least{{champion:74}} .\n\nThere is also a difference between something being \"balanced\" and being healthy for the game.","replies":[{"poster":"Anidan","date":"2015-11-21T18:00:08.836+0000","up_votes":2,"down_votes":1,"body":"Is that post meant to imply that 'healthy' should largely be taken to mean 'not annoying'? Because that's the implication I could grab, and that's inaccurate. Something annoying can still be healthy, you just won't like it.\n\nVaccination shots are annoying as all hell to many people (they hurt to receive, scary sudden pain), but they're still healthy.","replies":[{"poster":"Boulderox","date":"2015-11-21T18:32:58.319+0000","up_votes":6,"down_votes":0,"body":"{{champion:92}} e, annoying, unhealthy gameplay wise when fighting her, short distance mobility, thematically stupid for giving an ad shield... And is on a really low cd..\n\nAnnoying may not mean op\n\nBut annoying can mean unhealthy gameplay and has little counterplay...\nShield and stun.. Gl trying to trade with riven...","replies":[{"poster":"Anidan","date":"2015-11-21T19:37:12.453+0000","up_votes":1,"down_votes":0,"body":"Are you sure it's that unhealthy? She's a skirmisher in a game that largely doesn't revolve around 1v1s, she needs a defense of some sort, just like pretty much every other close-range fighter has. I mean, it sucks to play against her because she's so snowbally, but that's what mediocre bases with high scaling is going to do - make her snowbally. She actually seems fairly in line with other close-range fighters, if not for the fact she has no resource to manage.","replies":[{"poster":"Boulderox","date":"2015-11-21T20:28:51.037+0000","up_votes":2,"down_votes":0,"body":"thank you for the response, you make some nice points, but the idea that she can choose to max shield in lane phase, over q and still be able to win trades based on the shield alone, that is the only problem i have with riven (AOE stun is up there but i digress) at all is that she has a 100% ad scaling shield that is on a 6 second CD, which with riven you build 40% cdr asap so that 6 becomes 3.6 seconds between 210 +100% bonus ad shield. Mind you that shield i have found for many champions CANNOT break its BASE values with there abilities...\n{{champion:76}} Q= 150 ap + 40% ap ratio... can't break it... in base damages\n Or e for that matter... E = 200 + 50% ap...\n{{champion:103}} Q=140 + 35% ap if she hits both CAN break her shields base value, but 100% ad value makes it less likely due to most of rivens high value ad items.\n{{champion:3}} the only champ that i feel can break her shield reguardless with one q with 300 + 60% ap.\n\nThe reason i am saying it is too strong for one ability because the fact that you have to blow more than one ability to negate ONE NON ULT ability of the opponent is not fair imo from a balance and gameplay standpoint..\n\nBut the HUGE problem with riven, is if you CAN get that top lane counter, where she cannot beat you and it is a stalmate, she can still pop a carry without any trouble because of her insane ratios, all it takes is a stun W to secure an adc kill, that is why i can't stand her, I can {{champion:54}} and stop her up and down the street, but she can kill a carry faster than many can react to cc her .\n\nI feel her shield needs something changed, Everything else is doable but that shield is just out of place and too strong on a champion that is supposed to ONLY do damage, why does she need an Insane shield on top of the mobility that it gives her, no matter how short it is, mobility is strong.","replies":[{"poster":"Anidan","date":"2015-11-21T20:59:58.340+0000","up_votes":2,"down_votes":0,"body":"I think the problem with the shield is the scaling of the shield itself, from what I've seen. Not the fact that she gets access to a scaling shield, but just that it scales at a 1:1 ratio. If it was 1:0.5 or something more similar, it'd be much easier to deal with her snowballing, and it'd be easier for a champion to pop her shield and make damage stick. Just remember that the main drawback to nerfing her shield is basically forcing her into being a pure 1v1 champion, because in a teamfight setting a lot of AoE can go out and pop her shield on accident. Also, if she's CC'd by anything that prevents movement, she loses access to half of her kit outright (including her main defensive tool, as a largely squishy melee champion, and her main offensive gap-closer), unlike a lot of champions, which makes her more vulnerable to CC than you'd initially think. Now, I know most champions are vulnerable to CC, but several of them hurt Riven even more. \n\nThere's also the animation cancelling thing, which I don't have enough insight on high-level Riven play to properly weigh-in on, I'll admit. So if you have more insight to that (and thus, the speed she unlocks to pop squishies at her vaunted speed), please inform me because I'll listen to someone willing to talk rationally about Riven like you have so far.","replies":[]}]}]}]}]},{"poster":"chipndip1","date":"2015-11-21T19:17:52.505+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Ch0c0lateJesus,realm=NA,application-id=3ErqAdtq,discussion-id=ABYXqd5j,comment-id=0006,timestamp=2015-11-21T16:21:43.643+0000)\n>\n> I think if a champion is legendarily unfun to play against {{champion:17}} then it represents and essential{{champion:157}} problem with{{champion:223}} design in a game that is{{champion:53}} meant to be enjoyable at least{{champion:74}} .\n> \n> There is also a difference between something being \"balanced\" and being healthy for the game.\n\nBroken is in relation to balance, not if something's healthy or not. You can't be broken without being strong as fuck, and even one thing that's broken can be in an overall balanced kit. At least, that's how the word's used for gamer lingo.\n\nYasuo isn't overall broken, but he snowballs way too hard when he wins. Outside of his heavy as fuck snowballing, I think he's fine as a champ. Teemo needed a rework for AGES, and he's only decent when he gets fed. Blitz is just outdated as hell, being from a time when a combo of tanks and fighters went bot lane rather than adcs and supports, so now he's used as a support since he's designed to duo lane, but he has nothing that actually supports anyone since he wasn't designed as a support. Tahm is ridiculous against melee champs by design due to how his W and R works. Heimer is modeled after the most annoying class in ANY FUCKING ONLINE GAME EVER (fucking inventor/mechanic). Seriously, watch game play from other games. Any game that has something along the lines of an inventor or mechanic will have a character do nothing but spawn shit and walk around. Why do people keep making these types of characters?\n\nOnly Tahm might make a case for being broken out of all these guys. The rest are just annoying or are only broken when any other champ would probably be broken.","replies":[{"poster":"Ch0c0lateJesus","date":"2015-11-21T21:19:07.404+0000","up_votes":1,"down_votes":1,"body":"Interestingly I never once used the term \"broken\".\n\nThe champs I listed arent broken (with the exception of TK at the moment) but their design allows them to create a level of pressure that is vastly greater than the skill and effort required to create it. Unhealthy and simply bad design.","replies":[{"poster":"chipndip1","date":"2015-11-22T03:59:42.575+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Ch0c0lateJesus,realm=NA,application-id=3ErqAdtq,discussion-id=ABYXqd5j,comment-id=000600010000,timestamp=2015-11-21T21:19:07.404+0000)\n>\n> Interestingly I never once used the term \"broken\".\n> \n> The champs I listed arent broken (with the exception of TK at the moment) but their design allows them to create a level of pressure that is vastly greater than the skill and effort required to create it. Unhealthy and simply bad design.\n\nI'd remove Yasuo from that list, but you're right.\n\nYasuo isn't for the faint of heart, bois. It's when he's fed that he's ridiculous, but otherwise he's alright.","replies":[]}]}]}]},{"poster":"TheAwesomeJ","date":"2015-11-21T18:28:36.273+0000","up_votes":7,"down_votes":1,"body":"{{champion:64}} Annoying and even OverPowered","replies":[{"poster":"RyzeRework","date":"2015-11-21T18:47:37.632+0000","up_votes":1,"down_votes":10,"body":"lee is actually a weak champ he has a broken kit and hasnt seen much play the only thing that makes a leesin good is if u have good mechanics for example. a bronze playing veigar takes almost no skill you press r too kill your laner, a bronze lee sin wouldnt be able to abuse the full kit because its hard, a challenger veigar still doing the same thing as the bronze veigar sense viegar doesnt have much outplay potential, but a challenger lee sin can make ur life hell. you get what im saying?","replies":[]}]}]}