{"poster":"chinoyap","date":"2017-09-29T09:17:39.597+0000","title":"injugable","subforum":"Comportamiento del jugador","up_votes":35,"down_votes":6,"body":"las normal y ranked estan injugables, al final ya no es habilidad, solo es azar, ganas si no te tocan el equipo &quot;que no sabe jugar&quot; por no decir otra cosa","replies":[{"poster":"xX TuOniichan Xx","date":"2017-09-29T10:44:59.526+0000","up_votes":11,"down_votes":0,"body":"Si he aprendido algo de las rankeds, es que tus mejores posibilidades están en mitad de temporada, al inicio todos quieren subir rápido y al final es igual, incluso si eres bueno, tienes presión de que se acaba la season y juegas mal, te tilteas, etc, y lo mismo para el resto. Y hay horarios, generalmente un lunes por la noche solo hay viciosos que juegan para ganar, no niños ni gente que por un consejo piensan que les insultaste a la madre xD. Si eres realmente bueno, subes igual, pero si tu nivel es solo un poco mas alto que tu actual posición, te aconsejo que mires cuando jugar, por ejemplo, Viernes y Sábado es malo todo el día xD","replies":[{"poster":"Mazoku","date":"2017-09-29T13:45:52.664+0000","up_votes":2,"down_votes":16,"body":"Tipico comentario de alguien que no entiende de lo que esta hablando.\n\nPor que querrias jugar cuando hay mas gente que juega para ganar? Eso no tiene sentido. Si queres subir juga en el horario que mas ratas hay.","replies":[{"poster":"Deigex","date":"2017-09-29T17:11:27.419+0000","up_votes":4,"down_votes":0,"body":"Las ratas que empiezan mal una partida y no se dejan carrear? Obviamente es mejor jugar con gente competitiva y que juegan todos para ganar. Seguramente sean mas complicadas las partidas pero si realmente tenes nivel vas a marcar la diferencia y ganar o por lo menos si perdes no te vas a frustrar todos los match por la diferencia de experiencia. Buscar el camino fácil para subir es una estupidez.\nY jugando con ratas no te veo subir, 1400 ranked en una temporada para subir una sola división haciendo int todos los match.","replies":[{"poster":"Mazoku","date":"2017-09-29T20:50:13.713+0000","up_votes":1,"down_votes":2,"body":"> Las ratas que empiezan mal una partida y no se dejan carrear?\n\nSi, las mismas ratas que estan en los dos teams. Si vos +4ratas pierden vs 5 ratas entonces el problema claramente sos vos.\n\n> Y jugando con ratas no te veo subir, 1400 ranked en una temporada para subir una sola división haciendo int todos los match.\n\n1 division? 1400 matchs?\n\nNo te estaras confundiendo amiguito?\n\nDeja, lo dice un aram player jajaja.","replies":[{"poster":"Deigex","date":"2017-09-30T00:53:09.780+0000","up_votes":1,"down_votes":0,"body":"Fijate cuantas ranked jugaste esta season habiendo terminado platino 5 la season anterior y ahora estando en platino 4 :)\n\nCasi ni juego lol y asi y todo en menos de 150 ranked subi a diamond en ambas colas mientras vos con 500 ranked minimas por season seguis en platino hace 3 temporadas. Un aram player sabe y juega mejor que vos parece. Con solo las ranked que tenes en esta season ya jugaste mas que yo desde la s3 sumando todas mis cuentas y ágata que llegas a tener el elo de la smurf que menos pelota le doy. \n\nDeberias jugar mas Arams a ver si aprendes algo y despues de 4 seasons mejoras un poco.\n\n\t\nPlatinum 4\n21 LP / 698V 719L \nPorcentaje de victoria 49%\nLas Águilas de Jax\n\nTe enseño a sumar cuantas partidas jugaste?","replies":[{"poster":"Mazoku","date":"2017-09-30T00:55:22.573+0000","up_votes":1,"down_votes":1,"body":"> Fijate cuantas ranked jugaste esta season habiendo terminado platino 5 la season anterior y ahora estando en platino 4 :)\n\nLo siento pero no viste todos los games que jugue en NA con esta cuenta?\n\n> Un aram player sabe y juega mejor que vos parece.\n\nNah, ni que un diamanco supiera jugar. Si estuvieras en master o challenger te concedo el punto, pero diamanco 5 really?","replies":[{"poster":"Deigex","date":"2017-09-30T01:13:59.418+0000","up_votes":1,"down_votes":0,"body":"Triste es que alguien se crea que es mejor en el juego que alguien de una liga superior con una gran diferencia de desempeño y segundo si fuera un jugador regular no estaria en D5 donde subi y deje la cuenta por que nunca me intereso subir de elo, tranquilamente podria subir mas pero no vale la pena esforzarme, el reconocimiento sobre mi juego me lo dan challengers que estan en el top 20 de LAS hace 3 años seguidos, el tuyo no me va ni me viene.\n\nSuerte subiendo la proxima season, espero que mejores como jugador :)\n\n{{sticker:vlad-salute}}","replies":[{"poster":"Mazoku","date":"2017-09-30T01:37:03.027+0000","up_votes":1,"down_votes":1,"body":"> Triste es que alguien se crea que es mejor en el juego que alguien de una liga superior\n\nSi, das tristeza.\n\nEl resto ni lo lei, sory.","replies":[]}]}]}]}]},{"poster":"xX TuOniichan Xx","date":"2017-09-29T20:33:07.420+0000","up_votes":1,"down_votes":1,"body":"Gracias, estaba pensando en responderle utilizando manzanas xD.","replies":[{"poster":"Mazoku","date":"2017-09-29T20:39:59.212+0000","up_votes":1,"down_votes":2,"body":"Hacelo, su respuesta no tiene sentido.","replies":[]}]}]}]},{"poster":"BiXe","date":"2017-09-29T22:29:35.209+0000","up_votes":1,"down_votes":0,"body":"Viernes, sábado y domingo, desde la tarde del viernes hasta 5 AM del domingo aprox el 100% de las partidas hay un tóxico, troll o AFK. Igualmente aunque haya reportes da igual me ha tocado gente que literalmente dice \"jg de mi3rd4 . Por qué no te mueres de cáncer?\". Reporto por Violencia extrema, y adivina qué pasa?... Adivinaste, nada...\nLas colas clasificatoria de Flex, me tocó muchas veces Challengers (en solo Q) que entran a trollear o insultar y te dicen yendo 0/8/0 \" Claro yo no carreo y no hacen nada petes\" y \" Las Flex no sirven de nada me da igual perder yo entro a probar ping\" \nSi reportas por muerte intencional, Tampoco pasa nada, y si la gente de Elo \"más alta\" piensa que una cola que es clasificatoria, solo por el hecho de no ser \"soloQ\" no sirve... ¿Cómo jugarán las normales?\nEs simple, si la gente encargada del comportamiento no se pone a leer en serio los reportes y permabanear, desde bronces a Challenger, esto nunca va a cambiar. Pero si preguntas te dicen \"es mucho leer los reportes, así que si una cuenta tiene muchos reportes, el sistema automático lo castigará\". Véase debes esperar a que arruine e insulte de forma violenta a todos y esas personas se digne a reportarlas, y no cierren el juego ni bien termine la partida.\nSomos la peor región, en actitud y en nivel competitivo, hasta en el chat de Youtube durante la emisión del worlds se notaba, y nadie ni siquiera modero el chat de YT ni Twitch.","replies":[]},{"poster":"Darwin","date":"2017-09-29T16:36:46.166+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MakrosKiller,realm=LAS,application-id=PJAKt7ph,discussion-id=o8twGXMK,comment-id=0002,timestamp=2017-09-29T10:44:59.526+0000)\n>\n> Si he aprendido algo de las rankeds, es que tus mejores posibilidades están en mitad de temporada, al inicio todos quieren subir rápido y al final es igual, incluso si eres bueno, tienes presión de que se acaba la season y juegas mal, te tilteas, etc, y lo mismo para el resto. Y hay horarios, generalmente un lunes por la noche solo hay viciosos que juegan para ganar, no niños ni gente que por un consejo piensan que les insultaste a la madre xD. Si eres realmente bueno, subes igual, pero si tu nivel es solo un poco mas alto que tu actual posición, te aconsejo que mires cuando jugar, por ejemplo, Viernes y Sábado es malo todo el día xD\n\nCheahora que leo tu comentario es verdad. siempre a mitad de tempoada subi mas divisiones que al comienzo o al final. Habria que ir a estadisticas oficiales, pero es cierto.","replies":[{"poster":"xX TuOniichan Xx","date":"2017-09-29T20:37:29.872+0000","up_votes":1,"down_votes":0,"body":"Ojalá te sirva para decidir cuando jugar xD. En mi caso, ya no estoy jugando rankeds. Tengo mas probabilidades de terminar bajando que subiendo en este punto, ahora estoy disfrutando del Mundial, y conforme con mi progreso. En Abril/Mayo retomo, cuando el meta este mas organizado y balanceado luego de los cambios que hagan en la pretemporada xD.\n\nNo es por nada, pero esto ultimo también es a tomar en cuenta, si haz rankeado en pretemporada se hace mas evidente. Es cosa de recordar la pretemporada pasada...¿La temporada de los ADC's?...Ahí lo dejo xD.","replies":[{"poster":"Darwin","date":"2017-09-29T21:20:32.188+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MakrosKiller,realm=LAS,application-id=PJAKt7ph,discussion-id=o8twGXMK,comment-id=000200010000,timestamp=2017-09-29T20:37:29.872+0000)\n>\n> Ojalá te sirva para decidir cuando jugar xD. En mi caso, ya no estoy jugando rankeds. Tengo mas probabilidades de terminar bajando que subiendo en este punto, ahora estoy disfrutando del Mundial, y conforme con mi progreso. En Abril/Mayo retomo, cuando el meta este mas organizado y balanceado luego de los cambios que hagan en la pretemporada xD.\n> \n> No es por nada, pero esto ultimo también es a tomar en cuenta, si haz rankeado en pretemporada se hace mas evidente. Es cosa de recordar la pretemporada pasada...¿La temporada de los ADC&#x27;s?...Ahí lo dejo xD.\n\nsin dudas la temporada que viene va a ser especial. Las rankeds van a tener que esperar a esas fechas que decis tipo mayo, junio,,, hasta diria agosto! pero la ansiedad me va a ganar antes de esa fecha jaj. saludos!","replies":[]}]}]}]},{"poster":"Eniripsa","date":"2017-09-29T16:36:19.479+0000","up_votes":5,"down_votes":0,"body":"3 temporadas en oro y te sigues quejando? yo en la pasada subir a puro suporte mijo y llegue de plata a platino si eres bueno puede hacer la diferencia aunque tu adc o equipo sea regular c: esa escusa generalmente la encuentro con gente que quiere ser carriada..","replies":[{"poster":"RedKi","date":"2017-09-29T23:01:10.778+0000","up_votes":1,"down_votes":0,"body":"Ah, pero explicame que haces cuando te toca alguien que fedea al propósito y se va afk, o dos afks ?","replies":[]}]},{"poster":"Mazoku","date":"2017-09-29T09:57:34.008+0000","up_votes":18,"down_votes":13,"body":"Esa es la excusa de los malos.","replies":[{"poster":"ShadowReverse","date":"2017-09-29T16:27:54.701+0000","up_votes":3,"down_votes":12,"body":"Y lo que vos respondes son la respuesta de la gente toxica ;)","replies":[{"poster":"El Impostor","date":"2017-09-29T16:54:30.837+0000","up_votes":9,"down_votes":3,"body":"Porque?\nSi alguien es bueno, sube.\nSi alguien es malo, baja.\nNo es una logica complicada.","replies":[]},{"poster":"Mazoku","date":"2017-09-29T20:39:30.692+0000","up_votes":1,"down_votes":0,"body":"Decir la verdad no es toxicidad.","replies":[{"poster":"Mordrëd","date":"2017-09-29T22:58:53.069+0000","up_votes":1,"down_votes":0,"body":"Si es toxicidad.\nQue el insulto sea verdad no lo hace menos ofensivo, al contrario es mas ofensivo.","replies":[{"poster":"La corrupción","date":"2017-09-30T16:27:39.262+0000","up_votes":1,"down_votes":0,"body":"Si malo fuera un insulto sería toxicidad, pero no.","replies":[]},{"poster":"Mazoku","date":"2017-09-30T00:07:23.018+0000","up_votes":1,"down_votes":0,"body":"Que sea ofensivo (para vos) no significa que sea toxico.","replies":[{"poster":"Mordrëd","date":"2017-09-30T02:33:25.669+0000","up_votes":1,"down_votes":0,"body":"Por ejemplo si te digo Gorreado y es verdad como reaccionarias ? probablemente te molestarías.  \n\nEn ese caso fui Toxico , pero es verdad no? así que según tu lógica simplemente debes aguantarte que te diga eso.","replies":[{"poster":"Mazoku","date":"2017-09-30T02:54:41.254+0000","up_votes":1,"down_votes":0,"body":"> Por ejemplo si te digo Gorreado y es verdad como reaccionarias ? probablemente te molestarías.\n\nSi fuera verdad con mi mujer, si. Por el hecho de que me gorreo, no porque me llamaron asi.\n\n> En ese caso fui Toxico\n\nNo, no fuiste toxico.\n\n>  pero es verdad no?\n\nSi, es verdad.\n\n> así que según tu lógica simplemente debes aguantarte que te diga eso.\n\nSiempre y cuando sea verdad, no tengo ningun inconveniente. \n\nLa proxima vez no asumas mis respuesta. Puede salirte mal como en este caso.","replies":[{"poster":"Mordrëd","date":"2017-09-30T03:13:42.879+0000","up_votes":1,"down_votes":0,"body":"Tu eres tu no todas las personas reaccionan igual la mayoría reaccionan mas \"primitivamente\"  y se molestan solo por que a ti no te molesta no significa que a los demás no les moleste.\n\nSaludos","replies":[{"poster":"Mazoku","date":"2017-09-30T10:56:51.195+0000","up_votes":1,"down_votes":0,"body":"> Tu eres tu no todas las personas reaccionan igual la mayoría reaccionan mas \"primitivamente\" y se molestan solo por que a ti no te molesta no significa que a los demás no les moleste.\n> \n> Saludos\n\nMe molesta lo que dijiste en esta cita, eso te transforma en toxico?","replies":[]}]}]}]}]}]}]},{"poster":"Fan de safi","date":"2017-09-29T20:22:38.164+0000","up_votes":1,"down_votes":1,"body":"-1 xd","replies":[]}]},{"poster":"Rubitox","date":"2017-09-29T23:59:25.718+0000","up_votes":1,"down_votes":0,"body":"claro, como se puede ganar una partida en la que una riven va 0/4 contra un nasus a minuto 10 y le hecha la culpa al jungla, con toxicos trolls afks ratas y en especial lagueros esta imposible subir de liga","replies":[{"poster":"Mazoku","date":"2017-09-30T00:08:00.344+0000","up_votes":1,"down_votes":1,"body":"Si fuera facil todo el mundo lo haria.","replies":[{"poster":"La corrupción","date":"2017-09-30T16:28:19.160+0000","up_votes":1,"down_votes":0,"body":"todo el mundo lo hace","replies":[{"poster":"Mazoku","date":"2017-09-30T16:30:07.869+0000","up_votes":1,"down_votes":1,"body":"OP.GG te contradice. En este momento solo veo 200 challengers.","replies":[{"poster":"La corrupción","date":"2017-09-30T16:33:09.924+0000","up_votes":1,"down_votes":0,"body":"sos ----- o le tiras piedras a los aviones?","replies":[{"poster":"Mazoku","date":"2017-09-30T16:34:12.522+0000","up_votes":1,"down_votes":1,"body":"Dificil entenderte cuando pones guiones en medio de las oraciones.\n\nDado que no te entendi limito mi respuesta a esto.","replies":[]}]}]}]}]}]}]},{"poster":"El Impostor","date":"2017-09-29T14:39:08.441+0000","up_votes":3,"down_votes":0,"body":"Git gud","replies":[]},{"poster":"RedKi","date":"2017-09-29T22:58:50.634+0000","up_votes":2,"down_votes":0,"body":"Ganas si no te tocan afks o trolls, lrpm me tocaron más de 4 afks en partidas ayer y hoy, y RIOT NO HACE NADA.","replies":[]},{"poster":"KrN TosZio","date":"2017-09-29T15:40:17.886+0000","up_votes":3,"down_votes":1,"body":"Tienen que ser mas estrictos con las penas, si el pibe es un jugador normal obviamente puede llegar a tener una mala partida como cualquiera, pero si ya es la 3era partida q se muere 15 veces tienen q hacer algo y penarlo, por lo menos con 1 dìa de ban, cosa que le moleste. No sirve de nada juntar penas y a las decima novena vez q se manda una cagada banearlo.","replies":[]},{"poster":"Muñekko","date":"2017-09-29T17:01:12.615+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=chinoyap,realm=LAS,application-id=PJAKt7ph,discussion-id=o8twGXMK,comment-id=,timestamp=2017-09-29T09:17:39.597+0000)\n>\n> -  al final ya no es habilidad, solo es azar \n\n\n> [{quoted}](name=chinoyap,realm=LAS,application-id=PJAKt7ph,discussion-id=o8twGXMK,comment-id=,timestamp=2017-09-29T09:17:39.597+0000)\n>\n>  - ganas si no te tocan el equipo \"que no sabe jugar\" por no decir otra cosa\n\n\n{{sticker:sg-lux-2}}","replies":[]},{"poster":"Mecaniks","date":"2017-09-29T16:14:59.125+0000","up_votes":2,"down_votes":1,"body":"Yo no se si es que me tomo el juego muy enserio o que.. Pero me gusta jugarlo bien y que mi team sea acorde al juego, es decir si perdes una partida que sea porque el otro team tenia mejor composicion, mejores jugadores o bueno una tf que se perdio, pero que se pierda dignamente como tiene que ser. No que perder implique que tenias un troll un afk o ambas.. El viernes pasado jugue.. 5 partidas tuve 6 afk... si 2 en una de las partidas. Decidi jugar normal las cuales utilizo para practicar porque para eso estan para practicar, pero nadie se las toma enserio te trollean siempre, ojo no pido que todos se las tomen en serio pero despues los cruzas esos mismos en ranked usando campeones porque dicen que estan op y no tienen idea como utilizarlos. Y si todos tenemos partidas malas pero se supone que tenemos que saber que hacer, como buildear si te fue mal en linea que utilidad tener en la partida, quizas no la carrees pero si haces peel a otro o tratas de ir por objetivos termines ganando.. pero es mas facil rajarlo a puteadas o irse afk porque el top fedeo.. son posibilidades pero hay que saber afrontarlas, la verdad que el viernes tome la decisicion de ir dejando el juego progresivamente hasta no jugarlo mas. Es un vicio y cada vez me hace mas mal que bien, creo que es hora de ir dejandolo.","replies":[]},{"poster":"Thank ü Next","date":"2017-09-29T15:59:54.885+0000","up_votes":2,"down_votes":1,"body":"Es completamente ciento, no solo las ranked sino todo el juego en si se reduce a quien tiene mas afk o trolls en el equipo. La verdad es una pena porque le saca la gracia al juego. El el único juego que conozco que la gente no quiere jugar \"con las reglas del juego\". Es decir, en otros juegos no veo que haya gente que juega como quiere, es como que te inviten a jugar al truco y vos empeces a juntar 3 cartas iguales para gritar chacho xD \n\nCreo que en las diez ultimas ranked que jugué solo una fue un juego real, las otras solo perdí o gane porque había un troll en los equipos. Eso me hace pensar hasta que punto es cierto que \"subís si mereces subir\". Sumado a que hay mucha hipocresía de quienes están en elos altos y \"nunca ven trolls ni afk\" xd","replies":[]},{"poster":"OneHourPhoto","date":"2017-09-29T09:19:15.944+0000","up_votes":2,"down_votes":1,"body":"dodge super saiyayin","replies":[]},{"poster":"EDDDDDDDDDDDDDD","date":"2017-09-29T20:11:43.959+0000","up_votes":1,"down_votes":0,"body":"- primero y principal: este juego NO se trata de ser MEJOR que el otro, si no de aprovecharse de SUS ERRORES para asi poder sacar ventaja... por eso se toma en cuenta demasiado la toma de decisiones, el buildeo, team comp, la situacion, etc. no es tan al azar como decis\n- mentalizate que entras a una partida donde es 1v5. con el transcurso de la partida vas a ver que deciden hacer tus compañeros, si ser aliados u enemigos (3v7, 2v8, 4v6... pocas veces me toco posta 5v5) \n- no te puedo explicar todo lo que consiste carrear una partida porque es un monton... pero si sabes carrear, carreás. y si no, perdes. o tomás la partida en tus manos o espera un milagro","replies":[{"poster":"chinoyap","date":"2017-10-01T06:15:12.120+0000","up_votes":1,"down_votes":0,"body":"Esta claro, pero siempre toca el equipo que no sabe que hacer y ya en la fase de picks se nota","replies":[]}]},{"poster":"Ado1f0 El M1t13r","date":"2017-09-29T19:10:31.561+0000","up_votes":1,"down_votes":0,"body":"Obviamente si te toca un equipo de malos tenes mas probabilidades de perder con uno bueno...\n\nPero si tu eres un poco mejor que el resto, destacaras, y siempre habra algo asegurado teniendote a ti... Por lo tanto las probabilidades de que tu ganes si eres mejor son mayores...\n\nSolo tienes que jugar mucho para que se note la diferencia","replies":[{"poster":"chinoyap","date":"2017-10-01T06:14:23.581+0000","up_votes":1,"down_votes":0,"body":"Creeme e jugado de todo, y siempre es lo mismo, es todo al azar","replies":[]}]},{"poster":"Errør 404","date":"2017-09-30T01:03:22.092+0000","up_votes":1,"down_votes":1,"body":"Como no lo ven? RITO ES EL VERDADERO TROLL AQUI! O_O Mientras nosotros intentamos rankear, Rito se caga de risa de como somos trolleados partida tras partida D':\n\nTodo esto forma parte de un plan secreto del gobierno de Estados Unidos, en asociación con Rito para \"reducir\" la población de la tercera edad y así ahorrar miles de millones en jubilaciones. Si plan es que a los 50 años, tras miles de partidas con trolls y afk, nos caguemos muriendo todos de un infarto al grito de: **\"DALE VOLIIII, DALEEEEE!!!\"** O.o\n\nEn fin... Hablando en serio, Rito banea a los flamer como si no hubiese mañana, pero a los afk y a los trolls ni los toca ¡¿por qué Rito, por qué?! Será acaso que son **infiltrados de Riot**???? e.e","replies":[{"poster":"La corrupción","date":"2017-09-30T16:30:54.909+0000","up_votes":1,"down_votes":0,"body":"''hablando en serio''","replies":[]}]},{"poster":"Space Dragon","date":"2017-09-30T02:16:53.497+0000","up_votes":1,"down_votes":0,"body":"y, ganas si el otro equipo no sabe jugar y perdes si el tuyo no sabe, incluyendote\nes exactamente lo que dijiste","replies":[]},{"poster":"ShootingLK","date":"2017-09-29T20:05:42.180+0000","up_votes":1,"down_votes":0,"body":"me pasa lo mismo depende que almenos comprendan las habilidades del campeon lo que algunos no les interesa{{sticker:sg-shisa}}","replies":[]},{"poster":"Cero404","date":"2017-09-29T19:56:44.253+0000","up_votes":1,"down_votes":0,"body":"Bienvenido a el casi final de temporada, donde todos los que se olvidaron de subir de ligas al inicio suben ahora estando desesperados y jugando agresivo, si quieren subir de liga suban al inicio, yo en el inicio de temporada subi tanto en SoloQ como FlexQ a Oro 5 ambas ligas y no me costo nada, pero a un amigo ahora se esta matando por todos los jugadores que le tocan desesperados por subir antes de que se acabe la temporada, es tanto culpa de la gente como la tuya por empezar a subir ahora, si era por problema de PC como mi amigo fue mala suerte, ahora si es que al inicio no quieres y ahora subes porque quieres llegar a oro u otra liga mas alta tuviste que pensar en las personas desesperadas por subir, en todos los años de LoL siempre pasa esto xD","replies":[]}]}