{"poster":"Bananenbieger09 ","date":"2017-09-17T20:56:06.317+0000","title":"Gameplay Analyse (Hilfe) komme aus Bronze nicht raus...","subforum":"Level Up: Guides & Tipps","embed":{"description":"Hallo, Ich möchte meine Skills verbessern.. Könnt ihr mir helfen, was für Fehler ich mache?? Über Anregungen im Chat würde ich mich freuen. Danke! :)","url":"https://www.youtube.com/watch?v=jARHiAW1O00","image":"https://i.ytimg.com/vi/jARHiAW1O00/hqdefault.jpg"},"up_votes":1,"down_votes":0,"body":"Hey Community,\r\n\r\nIch bin Bronze und komme leider nicht raus.. Habe nun ein Video geuploadet um zu gucken, was f&uuml;r Fehler ich mache. Ich denke, ich bin eigentlich besser als Bronze, aber komme irgendwie nicht raus. K&ouml;nnt ihr mir da helfen? Ich w&uuml;rde mich freuen &uuml;ber paar Kommentare.\r\n\r\nGru&szlig;","replies":[{"poster":"Pure Cynicism","date":"2017-09-18T10:39:49.124+0000","up_votes":2,"down_votes":0,"body":"Du benutzt deine Q, um in den Gegner reinzurollen, anstatt von ihm weg. Dieses Verhalten ist typisch für Vayne-Spieler in Bronze und Silber. Wenn du climben willst, lass die Finger von Vayne. \n\nZu dem Rest will ich gar nicht so viel sagen. Typisches Beispiel für Selbstüberschätzung. Denke Bronze V passt aktuell ganz gut.","replies":[]},{"poster":"DerSmiter","date":"2017-09-18T10:35:39.998+0000","up_votes":2,"down_votes":0,"body":"Dieser Thread ist doch ein Troll {{sticker:sg-miss-fortune}} \nAnders kann man das nicht erklären ... hab Freunde von mir gesehen die auf Lv 20 schon besser gefarmt und gespielt haben xD","replies":[]},{"poster":"Scriptisloading","date":"2017-09-17T20:59:41.118+0000","up_votes":2,"down_votes":0,"body":"Hey ich habe dich geaddet und würde wenn du Lust hast gerne mit dir über bestimmte Fehler sprechen falls du Interesse hast :)","replies":[]},{"poster":"Vaninder","date":"2017-09-17T21:00:14.268+0000","up_votes":2,"down_votes":1,"body":"Nach 5 minuten hab ich abgebrochen. Dieser ganze Thread ist doch ein Scherz?\n\nDu hast schlecht gefarmt - benutze als Hilfe die A-Taste.\nDu bist Mad geworden, in die Mitte gegangen und hast einem weiteren Spieler das Game zunichte gemacht! \nIm Grunde genommen hast du dich Report-mäßig benommen und fragst dich warum du nicht climben kannst? Du soltest auch deine Einstellung überdenken :/","replies":[{"poster":"Bananenbieger09 ","date":"2017-09-17T21:04:37.487+0000","up_votes":1,"down_votes":0,"body":"Ja deswegen brauch ich ja eure Hilfe..","replies":[{"poster":"Vaninder","date":"2017-09-17T21:10:22.146+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bananenbieger09 ,realm=EUW,application-id=vatevpvi,discussion-id=Ioq1AAcl,comment-id=00010000,timestamp=2017-09-17T21:04:37.487+0000)\n>\n> Ja deswegen brauch ich ja eure Hilfe..\n\nUff...da du es wohl doch ernst meinst:\nWie gesagt, nimm die A-Taste zum farmen.\n\nWenn du früh stirbst - gib nicht auf! Das game geht noch locker 20 Minuten und die Gegner machen auch Fehler!\nSpiel nicht so aggressiv - Du musst deinen Champion verstehen. Eine Vayne will nicht nach 5 Minuten 10 Kills haben - sie nimmt sich nach ca 25-30 Minuten einfach alle^^\n\nSpring nicht einfach in Gegner rein - Du hast am Anfang dein Q benutzt um anzugreifen, dadurch hast du aber auch keine Möglichkeit wieder raus zu kommen. Sowas mach bitte nicht wenn du noch sehr früh im Spiel bist oder dir nicht 100% sicher bist das die Gegner die nicht den Schädel einhämmern.\nAnsonsten musst du einfach mehr spielen - das du nicht sofort danach in die Mitte gehst sollte dir jetzt klar sein, bleib unten bis Tower weg sind, die meisten deiner Fehler kommen, weil du zu wenig Erfahrung hast und die musst du dir erkämpfen!","replies":[{"poster":"Bananenbieger09 ","date":"2017-09-17T21:14:00.008+0000","up_votes":1,"down_votes":0,"body":"Ah ok gut danke :)","replies":[]}]},{"poster":"Scriptisloading","date":"2017-09-17T21:10:33.717+0000","up_votes":1,"down_votes":0,"body":"Wie bereits erwähnt habe ich dich geaddet ^^ {{sticker:slayer-jinx-catface}}","replies":[]}]}]},{"poster":"hshtagniemehrcdu","date":"2017-09-19T09:07:14.976+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bananenbieger09 ,realm=EUW,application-id=vatevpvi,discussion-id=Ioq1AAcl,comment-id=,timestamp=2017-09-17T20:56:06.317+0000)\n>\n\nErst einmal..\nFähigkeiten über STRG+Q/W/E/R aufwerten (bei Lvl Aufstieg).\nDas ist deutlich schneller, und für das ausnutzen eines früheren lvlups essentiell.\n\n0:58 ist ein typischer, schwerer Fehler, der dir permanent passiert.\nDu nimmst völlig unnötig Schaden. Als Vayne haben deine Autoattacks eine bestimmte Reichweite, die du nutzen musst.\nD.h., du gehst nicht in den Nahkampf, sondern du versuchst immer auf der maximalen Auto-Attack Reichweite zu bleien.\nSowohl zu Champions, als auch zu  Minions. Das reduziert den Schaden, den die Gegner dir zufügen können.\nDu stehst unnötig nahe an dem Minion, dass du lasthitten willst.\nDAs macht es leichter für die Gegner, dich beim lasthitten zu harassen.\n\nJetzt kommt Orn auf dich zu.\nDu gehst auch auf ihn zu. Dadurch ist er in Reichweite für seinen Flammenwerfer.\nKorrekt wäre, zurückzugehen, und nicht in seine Flammenwerfer Reichweite zu laufen, und dann auf maximale Reichweite anzugreifen.\nWenn er seinen Gapcloser nutzt, weichst du mit dem Q aus.\nDeine Autoattacks haben eine höhere Reichweite, und diese hast du null genutzt.\nAls Folge nimmst du viel zu viel Schaden, was dir später das Leben kostet.\n\nund bitte, nicht mitten in der Lane Tab drücken, wtf...\n\n1:15 Genau derselbe Fehler.\nDu gehst in den Nahkampf, wodurch du Orn die Möglichkeit gibst, dich mit seinem Flammenwerfer zu treffen.\nDu nimmst wieder unntigen Schaden von ORN und begibst dich in Reichweite von Ashe.\nKorrekt wäre hier wieder, auf maximale AA Distanz zurückzugehen. Dann hättest du ORn ohne Probleme angreifen können, und weder Ashe noch Orn hätten zurück angreifen können.\nOrn hat ein miserabeles positioning, d.h. du kannst ihn permanent mit AAs angreifen, während Ashe nur Farmen will und dich nicht harrassen möchte.\nIhr habt eine Free Lane - das machst u mit deinen eigenen Fehlern kaputt.\n\n2:00 WTF machst du in der Mitte?\nIhr könnt den Turm nicht pushen, und ihr teilt lasthits - Goldverschwendung.\nDu verpasst im Endeffekt 2 Minionwaves Bot... \nSehr, sehr schlechte Entscheidung, die sowohl dich als auch deinen Midlaner in Gold/XP zurückwirft (dich, weil du einen längeren Weg zu Bot hast).\nDer Schaden, den du am Mid Turm machst, den kassiert dein Turm Bot.\nEure Gegner haben das noch stärker versaut, aber sobald die das halbwegs vernünftig Spielen, gibst du deinem Team nen riesigen Nachteil.\n\n3:20, du hasst Lux wirklich.\nDie wave pusht langsam in ihre Richtung, d.h., Lux bekommt 2 Waves, und die Gegner verliren 2, da ihre Minions eure töten.\nDas versaust du für Lux.\nDu wirfst deinen Midlaner unfassbar weit zurück.\n\n4:20, du bestehst auf 2 Leute, die Mitte um lasthits kämpfen.\nWARUM!?!?","replies":[]},{"poster":"Night Lead","date":"2017-09-18T10:03:37.640+0000","up_votes":1,"down_votes":0,"body":"Was das lasthitten angeht, wurde schon viel gesagt, da ich als zweit  Posstion ADC habe gehe ich bevor ich in Ranked gehe 10 min Lasthitten im Sandbox modus. Das ganze ohne items, masteries, runen und skills. Das ganze hilft dir dein Lasthitten zu verbessern da du extrem genau Lasthitten musst. Ebenso solltest du dich ein bisschen mehr bewegen während dem Lasthitten. Bzgl des Matchups das du hattest, ihr hattet es recht entspannd, der  Orn und auch die Ash hätten euch um einiges mehr punishen können.\n\nWenn eure wave zb am gegner Tower ist und im side bbush kein ward steht geh dahin warden denn wenn ihr so nah am turm steht seid ihr leichte opfer für den Jungler. Am besten Picke für den Anfang des Climbens keine Vayne ich als Main sup hasse es jetzt noch zum Großteil mit einer Vayne zu lanen, da es von beiden seiten(support und ADC) einen extrem hohen skillcap benötigt um die Lane effektiv zu gewinnen und nciht nur zu outfarmen(was auch gut ist aber recht oft mich das turret fb gekostet hat). \n\nWenn ich mal auf der ADC posstion lande Spiele ich meist wenn sie offen sind Tristana,MF oder Sivir. Diese sind recht easy zu spielen und ua Sivir verzeit viele Fehler und ist auch wenn du behind bist nützlich.\n\nUnd wie es schon gesagt wurde deine aufgabe ist es zu farmen das ist das wichtigste als ADC","replies":[]},{"poster":"HHaie tabbian","date":"2017-09-18T09:57:55.297+0000","up_votes":1,"down_votes":0,"body":"Hast du dich eigentlich mit dem Heimerdinger abgesprochen, dass du adc gehst und er Support? Weil du nach der Zuordnung als Support eingeteilt wurdest. Ich habe mich das direkt gefragt, weil der Heimerdinger ja auch versucht hat, zu farmen, was mich zu der Vermutung kommen lässt, dass du gewissermaßen reingetrollt hast.\nÜbrigens kannst du relativ froh sein, dass du noch nicht für inting gebannt wurdest. Ich meine, wenn du als Lee Sin 2/25/0 gehst, dann kann das eigentlich nicht nur ein schlechtes Spiel sein. Und auch in diesem Spiel: Was willst du eigentlich von uns hören? Ich kann dir nur raten, aufzuhören zu trollen. Was soll es, dass du nach deinem ersten Tod direkt Mitte rennst und da einfach die ganze Zeit bleibst? Es kann doch nicht deine Meinung sein, dass das effektiv ist. Dass ihr dafür nicht komplett untergeht, kannst du eigentlich nur der Tatsache verdanken, dass du in Bronze V spielst. Außerdem vergraulst du damit deine Mitspieler extrem mit solchen Aktionen, was dir für das Gewinnen eines Spiels einfach nicht weiterhilft.\nIch werde mir jetzt nicht die Mühe machen, und das restliche Spiel irgendwie zu analysieren, weil ich mir irgendwie nicht sicher bin, ob du absichtlich trollst oder das einfach der Tatsache geschuldet ist, dass du einfach gar keine Ahnung hast. Nur eine Sache: Da du dich offenbar extrem darauf konzentrieren solltest, _was_ du tun solltest, solltest du nicht auch noch Champions spielen, bei denen es schwierig ist, _wie_ du etwas tust. Daher würde ich dir davon abraten, mechanisch anspruchsvolle Champions wie Vayne oder Lee Sin zu spielen.","replies":[]},{"poster":"soloquebeast","date":"2017-09-18T22:27:23.728+0000","up_votes":1,"down_votes":1,"body":"immer diese gümpel mit *bannen**report* :))))))))))))))))))))  rules lesen plsssssssssss ist just a game kann man so spielen wie man will ihr tryharder","replies":[]},{"poster":"EmperorNemo","date":"2017-09-18T09:46:49.966+0000","up_votes":1,"down_votes":1,"body":"Moin,\n\nich habe mir dein Video soeben auch angesehen, zumindest die ersten paar Minuten...\n\nNichts für ungut, aber bei deiner Spielweise überschätzt du dich etwas mit der Aussage \"ich bin eigentlich besser als Bronze\". \n\nDie erste Frage, die sich mir stellt: Weißt du, wann dein Champion seinen Powerspike hat bzw. wann dieser erst so richtig stark ist?\nVayne ist ein Lategame-Hyper-Carry, du hast auf der Lane nur die Aufgabe zu Farmen, deine Items zu bauen, um dann enorm viel Schaden zu machen.\n\nDein Lasthitten musst du auf jeden Fall - und damit meine ich auf jeden Fall !!!!!!!!!!! - verbessern. Teilweise stehst du nur und machst AA, in der Hoffnung den Lasthit zu kriegen. Das funktioniert aber so leider nicht, zumal du mit jedem AA auf einen Minion deine Wave in den Tower vom Gegner pushst, was dich zu einem sehr einfachen Ziel des gegnerischen Jgl macht.\n\nWieso lässt du dich nicht pushen, farmst entspannt auf deiner Seite der Lane und wartest ab?\n\nUnd die nächste Sache sorgt bei mir für absolutes Unverständnis und ist ein ganz klarer Beleg dafür, dass du schlicht nicht besser als Bronze bist:\n\nWieso gehst du, nachdem du getötet wurdest in die Mitte?\nIch verstehe das beim besten willen nicht. Du zerstörst dadurch das Game deines Midlaners und das Game deines Supporters.\nVom Spielverständnis her ist das katastrophal. Anders kann man das nicht sagen.\n\nEinfach auf der Lane bleiben und farmen, farmen, farmen... \nSelbst wieder zurück ins Spiel kommen und dann deinen Powerspike nutzen.\n\nAls du dann in der Mitte warst, haben dich Shaco und Lux dazu aufgefordert wieder auf die Botlane zu gehen, keine Reaktion von dir.\nIch weiß nicht, was da in deinem Kopf vorgegangen ist, aber so hilfst du weder deinem Team, noch dir selbst beim climben.\n\nGuck dir Videos an, lies dir Guides durch, wann du dich wie verhalten musst um das Spiel zu gewinnen und zu carrien (als Vayne auch mit 0/5/0 noch möglich!!!!).\n\nZum anderen, wenn du schon in der Mitte bist und die Lux von 2 Gegnern abgeholt wird, dann steh nicht einfach nur da und mach nichts, sondern hilf ihr, holt zusammen die beiden Gegner ab und geht wieder auf eure Lane (also du auf die Botlane)!\n\nZum Einkaufen: \nWenn du noch 130 Gold übrig hast, dann geh nicht einfach wieder auf die Lane. Du hattest zwar noch einen Trank, aber nimm ruhig einen zweiten mit und auf jeden Fall einen Pinkward. Geld dafür hattest du auf jeden Fall.\n\nWenn du weißt, dass gleich ein Fight stattfinden wird bzw. ihr traden wollt, dann instant n Trank nehmen. Dadurch erschaffst du dir einen HP-Vorteil, den du als Vayne auf jeden Fall nötig hast.\n\nIch habe nur bis 6:30 geguckt und dann ausgemacht, weil ich es mir nicht mehr ansehen konnte.\n\nSorry, wenn das alles etwas direkt ist, aber es ist ein ehrliches Feedback. \n\nLG\nEmperorNemo","replies":[]},{"poster":"Moosshadow","date":"2017-09-18T08:49:04.621+0000","up_votes":1,"down_votes":1,"body":"Hey, also hier mal ein paar Tipps von mir:\n1. Du bist Vayne, Vayne ist ein sehr starker Late Game Champ, mit eher geringer Reichweite, jedoch außergewöhnlich hohem Schaden, wenn du ausreichend Items hast. \n2. Vayne's Laning Phase ist gerade gegen Longe Range Champions nicht die beste, deswegen konzentriere dich aufs Farmen und last hiten. \n3. Pushe nicht deine Lane raus, wenn Ihr keine Wards auf der Botlane habt, ihr seid dadurch Opfer für Jungler Ganks. In diesem Game, hast du natürlich schlechte Karten, da du einen ,,Support\" hast, dessen Geschütze Schaden an Minions veruarsachen und dadurch automatisch für Push sorgen\n4. Rotiere nicht sinnfrei herum bzw. verlasse nicht grundlos deine Lane. Wenn du vor hast beispielsweise in die Mitte zu rotieren um den Gegnerischen Midlaner zu töten, dann mache das 1. in dem du am besten deinen Support mitnimmst 2. in dem du deinem Midlaner vorher bescheid gibst, damit er sich ggf. darauf einstellen kann und das pushen einstellt 3. rotiere garnicht, wenn die gegnerischen Botlaner noch da sind und deine Lane nicht ausgepusht ist, da du sonst jede Menge CS (Farm) verlierst und dein Supporter alleine Probleme bekommen könnte bzw. euch im schlimmsten Fall noch der Tower flöten geht.\n5. Nutze deine Summoner Spells! Du hast in sehr vielen Solo Fights, die ich gesehen habe, sowohl Flash, wie auch Heal noch rdy.\n6. Erzwinge keine Kämpfe, außer du weißt, dass du eine realistische Chance hast, diese auch zu gewinnen.\n7. Spiele mit deinem Support, nicht gegen ihn. Das bedeutet das ihr euch nach Möglichkeit zusammen bewegen solltet und euch dadurch gegenseitig schützt bzw. helft\n8. Gebt nicht auf, wenn ihr ein starkes Late Game Team habt! So ein früher Surrender, macht einfachen keinen Sinn. Lee Sin war zwar gefeedet, ist aber im Late Game, bei weitem nicht mehr stark und sollte für dich, wenn du ausreichend Farm und Items hast kein Problem mehr darstellen.\n9. Lerne farmen bzw. last hiten!!! Gold=Items=Items auf Vayne=GG\nIch denke das wären erstmal mit die Wichtigsten Dinge. Dein Itembuild bzw. deine Masterys und Runen habe ich hier jetzt mal außen vorgelassen. Wenn du zumindest einen Großteil dieser Dinge beherzigst, solltest du es zumindest auf Silber schaffen.","replies":[]},{"poster":"DieguteDame","date":"2017-09-18T03:16:27.871+0000","up_votes":1,"down_votes":1,"body":"Hey, ich bin zwar selbst Bronze, aber ich wollte mich trotzdem gerne beteiligen.\n\nIch finde es gut, dass du aufrichtig nachfragst und dich wirklich bessern möchtest. \n\nIch muss dazu sagen, dass ich das Spiel ehrlich gesagt auch nicht sehr lange angeschaut habe.\n\nHier wurde eigentlich alles schon gesagt, das Verhalten ist wirklich nicht produktiv und du solltest wirklich das Farmen üben, aber eine wichtige Sache ist auch, dass LoL teilweise reine Kopfsache ist. \n\nWenn du auf der Gewinnerseite stehst und jemand sagt \"Don't end, I want penta\" und ihr verliert am Ende, weil ihr den Gegnern zu viel Zeit gegeben habt, ist das ein Verlust aus Hochmut. \n\nWenn du das Spiel nach kurzer Zeit im Grunde schon aufgibst, zwar weiterspielst, aber letztlich eben verlierst, weil du dich dementsprechend verhältst (bzw. spielst) dann verlierst du, weil du das Spiel sowieso als verloren ansiehst.\n\nBeides sind zwei sehr unangenehme Varianten, das Eine weil man eigentlich schon gewonnen hat, das Andere, weil es noch so viele Möglichkeiten gegeben hätte, wie das Spiel ausgehen könnte, die man aber alle direkt aufgegeben hat. \n\nVersuch an deiner Einstellung zu arbeiten und wenn du nur verlierst, dann spiele ein paar Normals oder mach eine Pause. Der erste Schritt ist die Einstellung, mit der richtigen Menge an Übung und Selbstreflexion kommen die Siege mit der Zeit ganz von selbst. \n\nIch wünsche dir noch viel Erfolg und viel Spaß im Ranked :)","replies":[]},{"poster":"KledRekt","date":"2017-09-17T21:10:04.518+0000","up_votes":1,"down_votes":1,"body":"Bronze ist sogar zu hoch für dich :D. U belong to Wood.","replies":[]}]}