{"poster":"Mischaa","date":"2016-12-14T07:41:31.911+0000","title":"placements solo/duoq und flex","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"moin leute, habe gestern meine placements in flex que gemacht und musste echt lachen. :D Hab mich gefragt ob das System kaputt ist.\r\nLetzte Season dia4 mit platin mmr nur gegen plat2-dia5 gespielt, bin in Soloq bin ich in gold 2 gelandet verst&auml;ndlich nur am feeden gewesen, weil ich mega schei&szlig;e bin zurzeit. 3 wins 7 loses wurdens am Ende. \r\nGestern dann flex que mit 4 wins 6 loses abgeschlossen und in plat3 gelandet. In der Preseason nur doch placements plat 2 gelandet.\r\n\r\nAlso wieso bin ich jetzt trotz meiner drecks mmr in solo/duoq mit so einem w/l verh&auml;ltnis in gold gelandet und wieso in flex in plat 3\r\nbtw hab zurzeit von 25 games eine 25% winrate hahahahahaha","replies":[{"poster":"The Lotus Monk","date":"2016-12-17T00:07:05.490+0000","up_votes":1,"down_votes":0,"body":"Ich beende League of legends. Ich habe main Support gespielt und war in Gold II. \nJetzt spiele ich in den Placements in einem team wo der ADC Bronze II ist und der Rest Bronze I bis Silber V. Ist unspielbar als support, macht genau Null Spaß einen ADC zu supporten der aus der ersten Wave des Spiels genau 1 Minion lasthitted.\nHabe dann mal zyra support gespielt und fast doppelt so viel Damage wie der Midlander gefahren. Muss ich erst ADC oder Midlane spielen um mich dann nach Gold zu spielen um dann auf support zu wechseln? Nee Leute, danke das wars. 7 Seasons und das matchmaking ist immer noch das schlechteste, was ich jemals in einem Spiel gesehen habe. \nAuf so etwas habe ich keine Lust. Wie kann man in seinem 2. Placement game als ehemaliger Gold II Spieler in einem reinen Bronzeteam landen.\nNaja, viel Spaß euch noch. League ist over für mich.","replies":[]},{"poster":"Maíko","date":"2016-12-14T08:59:35.561+0000","up_votes":1,"down_votes":0,"body":"Ich glaube bei der FlexQ wurde ziemlich stark auf deinen alten Rang geachtet...\n\nWar in FlexQ in der Preseason Bronze 1 und nach 3/7 Placements immer noch Bronze 2 :|\nIn der SoloQ habe ich noch nicht die Placements..aber ich denke als Gold 5 werde ich da wohl in Bronze 2 - Silber 5 landen ^^","replies":[]},{"poster":"Nico21","date":"2016-12-14T07:55:14.371+0000","up_votes":1,"down_votes":0,"body":"weil deine alte mmr mit einberechnet und einbezogen wird","replies":[]}]}