{"poster":"Cocofote","date":"2015-12-29T02:41:09.490+0000","title":"Eloboosters","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":1,"body":"En esta semana recientemente estuve jugando muchas rankeds, y vi que hab&iacute;a mucha gente que decia &quot;estoy subiendo esta cuenta&quot;, &quot;no es m&iacute;a, estoy eloboosteando por $$&quot;, esta permitido eso? es que todas partidas que hay eloboosters pierdo... :/ {{summoner:2}} {{summoner:13}}","replies":[{"poster":"Yrox the Third","date":"2015-12-29T02:48:47.421+0000","up_votes":3,"down_votes":0,"body":"No, no es legal, reportarlos.","replies":[{"poster":"Cocofote","date":"2015-12-29T02:55:28.818+0000","up_votes":1,"down_votes":2,"body":"No hay razón ahí para reportarlos, y encima no creo que pase nada por reportarlos de esa razón","replies":[{"poster":"Yrox the Third","date":"2015-12-29T02:59:48.972+0000","up_votes":1,"down_votes":0,"body":"Para empezar, Elo boost es que alguien (de una liga alta generalmente como Master o Challenger) se meta en la cuenta de un jugador de liga baja (como Bronce o Silver) y empieze a jugar rankeds por el, asi subir su liga, el fin de esto es que el Elo booster (el de liga alta) consiga dinero por esto, como un servicio.\nEsto es totalmente ilegal, ya que para empezar compartir cuenta va en contra del codigo de invocador, y para que decir jugar rankeds por uno.","replies":[{"poster":"Das Penitu","date":"2015-12-29T07:34:44.606+0000","up_votes":1,"down_votes":0,"body":"No juego ranked normalmente asi que probablemente la respuesta sea obvia para otros, pero para mi no. ¿Porque alguien habria de pagarle a otra persona para que los suban de liga? ¿Es tan importante tener el borde del champion con un color bonito ?","replies":[{"poster":"Yrox the Third","date":"2015-12-29T17:17:15.560+0000","up_votes":1,"down_votes":0,"body":"Es basicamente por las recompensas y por el \"orgullo\" de estar en cierta liga.\nSi por ejemplo, llegas a Diamante o Master ya eres considerado un buen juegador y ademas el skin victorioso generalmente es bastante bueno (dejando afuera a Sivir Victoriosa), la cosa es que hay muuuuuuuchos bronces o platas que dicen \"merezco estar en Platino o Diamante por lo menos pero estoy atrapado en Bronce por mis compañeros sin habilidad\", bueno para que decir que es lo mas estupido que alguien puede decir, pero estan tan confiados en su habilidad que van a una pagina de elo boost (osea no todos, la gran mayoria sigue solo creyendo que va a hacer algo o por lo menos lo intentan y algunos lo logran) y contratan este servicio, es simplemente para eso, aun asi cuando lleguen a su liga querida, el servicio termina y ya estan ahi, pero luego ellos empiezan a jugar y terminan perdiendo tanto que llegan otra vez a su liga principal.\nEs simplemente estupido, no lo hagas.","replies":[]}]}]}]}]}]}