{"poster":"Naxo Brewmaster","date":"2018-04-21T21:10:58.724+0000","title":"4K EN LOL!!","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"Bueno, lo que pasa es que desde febrero mas o menos, el juego me empezo a andar super mal, trate de repararlo y nada... Trate reinstalando y nada! Trate formateando el pc e instalando el juego y nada! Trate con gameboosters y nada de nada! La cosa es que antes me andaba a 50fps con todo bajo y para mi no son problemas los graficos en los juegos pero la cosa es que ahora me anda asi http://imgshare.free.fr/uploads/9f87c30462.png \r\nMi pc no es una maquina superpotente pero podia jugar tranquilamente al lol, la cosa es que ahora andando en la jungla o estando en la linea me anda a esos fps y los demas juegos que tengo (Battlefield 3, wow, cod) me andan super bien, &iquest;Le metieron alguna resolucion mayor al game?","replies":[{"poster":"Kurokiba Ryö","date":"2018-04-22T09:01:59.286+0000","up_votes":1,"down_votes":0,"body":"Limpia tu pc (la tierra) {{sticker:sg-lux-2}}  (igual no es eso pero nunca viene mal)","replies":[{"poster":"Naxo Brewmaster","date":"2018-04-22T19:24:50.104+0000","up_votes":1,"down_votes":0,"body":"Dia a dia lo hago bro","replies":[]}]},{"poster":"ToxicRunner","date":"2018-04-21T22:13:38.426+0000","up_votes":1,"down_votes":0,"body":"Fíjate tus drivers, mi pc no me corre el left 4 dead a 30 fps y el lol con todo en bajo me va a 40/30 fps","replies":[{"poster":"Naxo Brewmaster","date":"2018-04-21T23:04:50.610+0000","up_votes":1,"down_votes":0,"body":"actualizados bro","replies":[]}]},{"poster":"CoronavirusC0V","date":"2018-04-21T21:54:29.744+0000","up_votes":1,"down_votes":0,"body":"si ami igual me anda para le miseria, no sabia si era mi internet pero antes me andaba re bien, ahora nose si es problema de mala optimizacion o si tengo que ir a fibertel","replies":[{"poster":"Naxo Brewmaster","date":"2018-04-21T23:04:40.337+0000","up_votes":1,"down_votes":0,"body":"Lo peor es que el pc de mi vecino esta casi para echarlo a la basura y le sigue funcionando igual, la unica diferencia es que el tiene win8 y yo 10, pero dudo que eso sea el inconveniente si no soy al unico que le pasa.","replies":[]}]},{"poster":"pepi99 manc0","date":"2018-04-21T21:46:13.235+0000","up_votes":1,"down_votes":0,"body":"si la resolucion de que no saben parchear ni optimizar un moba","replies":[]}]}