{"poster":"Godzocker","date":"2015-05-27T19:37:52.805+0000","title":"Dia V aka. Endboss elo","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":1,"body":"Ich denke,dass dieses Thema schon oft angesprochen wurde.Allerdings ist es mir noch nicht ganz klar,weshalb ich euch um Rat bitte.Ich bin aktuell dia V und habe festgestellt,dass ich seit meinem Aufstieg doppelt so viel lp verliere wie ich gewinne.Nun ist die Frage: wovon wird mein lp income ausgemacht,denn ich habe ne recht solide winrate mit 56,5%  und ich habe gedacht die MMR wird  von der winrate ausgemacht :c . Bitte um schnelle Hilfe,denn ich bin echt frustriert.\r\n\r\nLG Godzocker","replies":[{"poster":"Minamitsu Murasa","date":"2015-06-01T16:09:56.764+0000","up_votes":1,"down_votes":1,"body":"Der Grund ist einfach.\nRiot hat unerklärlicherweise die Grund-MMR von Dia V hochgeschraubt.Ich glaube der jetzige Wert liegt bei 2250.So,wenn du aber mit einer sehr guten Platin I MMR Dia V kommst,hast du immernoch die MMR von Platin I.Der Unterschied beträgt 200(!) Punkte,was der Grund dafür ist,dass du keine LP bekommst.","replies":[{"poster":"Danny89","date":"2015-06-01T20:13:20.441+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Minamitsu Murasa,realm=EUW,application-id=ip27PlEH,discussion-id=WswYilIB,comment-id=0002,timestamp=2015-06-01T16:09:56.764+0000)\n>\n> Der Grund ist einfach.\n> Riot hat unerklärlicherweise die Grund-MMR von Dia V hochgeschraubt.Ich glaube der jetzige Wert liegt bei 2250.So,wenn du aber mit einer sehr guten Platin I MMR Dia V kommst,hast du immernoch die MMR von Platin I.Der Unterschied beträgt 200(!) Punkte,was der Grund dafür ist,dass du keine LP bekommst.\n\nNein. Ich bin diese Season Platin->Dia5, danach Lossstreak Dia5 und Lossstreak wieder wettgemacht... Das System hat sich genau so verhalten, wie es sollte und wie es sich immer verhält.","replies":[{"poster":"Minamitsu Murasa","date":"2015-06-02T20:58:00.915+0000","up_votes":1,"down_votes":0,"body":"Ich sollte doch anmerken,das die Daten die ich habe,von verschiedenen Threads aus Reddit sind,und die Zahl 2250 immer wiederholt wird.\nMich interessiert,wie sich das System denn bei dir verhalten hat,wenn du so sprichst.Wieviele LP hast du in Platin I bekommen?Wieviele dann in  Dia V?Wie viele Leute ind einer Liga stecken in Dia V unter 50 LP?Also als mein Kumpel Dia V kam,waren 196 in Dia V und 5 in Dia IV.","replies":[]}]}]},{"poster":"Minamitsu Murasa","date":"2015-06-02T11:18:17.543+0000","up_votes":1,"down_votes":0,"body":"Mein Kumpel gewann in Platin I 30 Lp.Nun ist er Dia gewesen und hatte eine lange Zeit nur 6 LP bekommen.So wie ich das gesagt habe stimmt es schon.\nDer MMR-Unterschied zwischen Dia V und Platin I ist zu groß.","replies":[{"poster":"Danny89","date":"2015-06-02T16:02:07.560+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Minamitsu Murasa,realm=EUW,application-id=ip27PlEH,discussion-id=WswYilIB,comment-id=0003,timestamp=2015-06-02T11:18:17.543+0000)\n>\n> Mein Kumpel gewann in Platin I 30 Lp.Nun ist er Dia gewesen und hatte eine lange Zeit nur 6 LP bekommen.So wie ich das gesagt habe stimmt es schon.\n> Der MMR-Unterschied zwischen Dia V und Platin I ist zu groß.\n\nNein ist er nicht. Es gibt nahe zu keine Begründungen / Beweise dazu. In 99,9% der Fälle ist es eine negative Winrate nach erreichen von Dia5.\n\nDas Thema verfolge ich nun schon seit Monaten und hab schon jede Menge Accounts überprüft... wie gesagt, 99,9% sind leichtestens zu erklären/nachzuvollziehen.","replies":[{"poster":"Minamitsu Murasa","date":"2015-06-02T16:33:51.315+0000","up_votes":1,"down_votes":0,"body":"Achso.Du willst mir also sagen das mein RL-Kumpel mit dem ich immer über TS bin und er mir seinen fortschritt sagt,lügt.Du willst mir also klarmachen das es keinen MMR Unterschied zwischen Platin I und Dia V gibt.\nBitte,sei einfach still.Du hast scheinbar gar keine Ahnung.Der Grund das du in Dia V zu wenig LP gewinnst liegt ganz klar an der Tatsache,dass wenn man von Platin I nach Dia V kommt,die eigene MMR **VIEL** zu niedrig ist.\nEs gibt keinen anderen Grund.Mein Kumpel hat mit unter 100 Wins Dia V geschafft,gewann in Platin I 25-30 LP mit nem Win und als er Dia war nur noch 6 pro Win.Ist mir egal ob du es nun glaubst oder nicht,aber deine W/L Ratio sagt überhaupt nix aus,wieviel du an LP gewinnst.\nMöglicherweise erkundest du dich mal.Platin I liegt bei knapp 2k MMR,während Dia V 2250 MMR hat.\nSollte eigentlich klarstellen wieso man keine LP bekommt.","replies":[{"poster":"Danny89","date":"2015-06-02T19:09:40.501+0000","up_votes":1,"down_votes":0,"body":"Normal ist das nicht nötig, aber ich machs mal:\n\nIch will hier nur kurz erwähnen, dass ich der Autor dieses Threads (und des Vorläufer Threads im alten Riotforum (einziger Nicht-Rioter Sticky, über 200.000 Views)) hier bin: \n\nhttp://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/IqBzFyO9-der-informationsthread-aber-ligen-mmr-und-hidden-elo\n\n, der Informationen seit Season 2 geschrieben, gepflegt und up to date hält. Es gibt, im deutschsprachigen Raum (vllt. auch weltweit), zu 99,9% niemand anderen (außer Rioter), der über das Ranglistensystem besser bescheid weiß als ich.\n\n\n\nAlso, nochmal zu dir zurück: In 99,9% der Fälle ist der LP Gain völlig nachvollziehbar. Auch in Dia5. Auch die letzten Monate. Das habe ich mitverfolgt und oftmals überprüft.\n\nNein, ich kenne dich, deinen Freund und den konkreten Fall nicht. Aber die Wahrscheinlichkeit, dass es eine \"Ausnahme\" sein könnte, ist nahe zu 0.\n\n\nWas ich nicht leiden kann sind erfundene Behauptungen wie imaginäre MMR Zahlen, die in keinster Weise nachvollziehbar sind. Oder hast du Riotquellen mit Angaben, die ich noch nicht kenne? Bitte her damit!","replies":[{"poster":"Minamitsu Murasa","date":"2015-06-02T19:45:47.253+0000","up_votes":1,"down_votes":1,"body":"Natürlich sind die MMR Berechnungen alles Schätzungen.Aber da es auf Op.gg Lolking einen Standard gibt,wird dadurch ein eigener Wert errechnet,der halt einfach funktioniert.\nSo,ich glaube wir beide reden aneinander vorbei.Ich meine nicht das das was du sagst absolut falsch ist.Aber geh mal auf Reddit oder sonstige Foren.Die Leute mit einer hohen Winrate in Platin,bekommen und Dia V so unfassbar wenig LP,und dies liegt einfach daran,das Riot die MMR von Dia hochgeschraubt hat,als sie die Anzahl der Spieler die in Dia sein können von 2% auf 2,5% gesetzt haben.Es besteht einfach ein MMR Unterschied zwischen Platin I und Dia V,der ähnlich wie der von Gold V nach Platin V ist(gefühlt auf jedenfall).\nDAS kann dir jeder der nach Dia V gekommen ist bestätigen.Deine Winrate?Sie sagt absolut garnichts aus.\nSonst würde ich in Gold III nicht 18LP+ und 18LP- machen,obwohl ich 7er Winstreaks habe,und meine Winrate bei 55,2 % liegt(Wo ich dringend einen Thread aufmachen muss,um mal zu fragen wie das kommt.).\n\nWas aber klar ist,der LP-Gain in Dia V ist absolut broken.Es ist falsch mit hoher Winrate und guter MMR in Platin I plötzlichw enn man Dia ist nur 6 LP zu bekommen,aber das soll scheinbar nur die guten Spielern nach Dia V 50LP und hinaus lassen.","replies":[{"poster":"Danny89","date":"2015-06-02T20:35:05.512+0000","up_votes":1,"down_votes":0,"body":"Ich glaube ich bin die ganze Diskussion falsch angegangen. Ich ging davon aus, dass du über das Elo/MMR/Ligensystem bescheid weißt. Mein Fehler.\n\nBitte zuerst den schon oben geposteten Link durchlesen:\n\nhttp://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/IqBzFyO9-der-informationsthread-aber-ligen-mmr-und-hidden-elo\n\nSo als Tipp, was da drinnen stehn und für deine \"Argumentation\" wichtig sein könnte: LoLking, op.gg und andere \"tolle\" Webseiten. Sogar mit Riot Statement.\n\nNachdem du das gelesen hast und du dich up to date gebracht hast, können wir weiter reden.\n\nViel Spaß beim Lesen.\n\nDanny","replies":[{"poster":"Minamitsu Murasa","date":"2015-06-02T20:55:34.680+0000","up_votes":1,"down_votes":1,"body":"ich denke du verstehst nicht was ich meine.Der MMR Wert auf Seiten wie Op.gg ist ganz klar nicht von Riot.Aber man kann einen ungefähren Wert ausrechnen,der zwar nicht mit den Daten von Riot übereinstimmt,aber dennoch als ein gewisses Maß angesehen werden kann.Bei Lolking liegt der LKS(der von der Community erstellte Wert) bei 1500.Trotzdem weiß man das jemand mit 1900 LKS bei Platin liegt.Es sind keine offiziellen Daten,aber dennoch können bei OP.gg die Daten von einem Dia V mit einem anderem Dia V Spieler verglichen werden,sodass man weiß wer den höheren MMR-Wert hat.Natürlich alles Werte die auf diese Standards passen.Soviel dazu.Ich halte mich auch weniger an Op.gg,aber es ist eine kleine Hilfe.\n\nWas ich zu dem OP sagen möchte ist ganz klar,das seine Winrate ihm nicht hilft.Der Grund daran liegt einfach,das der MMR Unterschied zwischen Dia V und Platin I so groß ist,das man mit einer guten Platin I MMR dennoch wenig LP in Dia gewinnt,wenn man dann reinkommt.\n**Diese** Aussage ist unwiederlegbar.Die Winrate ist bloß eine nebensache die entsteht wenn man seine MMR durch vermehrtes Gewinnen steigert.Sie bestimmt nicht den LP-Gain in Dia V.Sobald er in Dia V seine Winrate weiter steigert,wird seine MMR halt erhöht,aber das ist ja selbstverständlich.\nIch bezweifle das du mir was anderes erzählen könntest.Wenn jeder der nach Dia V kommt,plötzlich fast keine LP gewinnt und das 3-fache verliert,ist das nur auf die erhöhte MMR zurückzuführen,die man benötigt.","replies":[]}]}]}]}]}]}]},{"poster":"Danny89","date":"2015-05-28T14:47:18.097+0000","up_votes":1,"down_votes":0,"body":"Ohne mir deinen Fall (der auf den ersten Blick 0/8/15 ist und fast täglich hier vorkommt) im Detail anzusehen, findest du deine Antworten zu 99,9% hier:\n\nhttp://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/IqBzFyO9-der-informationsthread-aber-ligen-mmr-und-hidden-elo","replies":[]},{"poster":"i had fun once","date":"2015-05-28T09:42:53.348+0000","up_votes":1,"down_votes":0,"body":"Ich bin grade erst in Dia angekommen und bekomme noch genau so viele Punkte wie in Plat 5 damals. Hat sich nichts geändert.\nDeine hohe Winrate kommt viel eher davon, dass du dich durch die unteren Ligen gespielt hast. Aber wenn du auf deiner jetztigen Elo halt 50/50 spielst ist das nicht mehr so.","replies":[{"poster":"Godzocker","date":"2015-05-28T12:56:48.765+0000","up_votes":1,"down_votes":0,"body":"ich spiele aktuell so,dass ich 2-3 gewinne und dann 1 verliere,jedoch werden mir dann mindestens 2 siege denied durch den lp income.... Bin immer noch nicht schlüssig {{champion:32}}","replies":[]}]}]}