{"poster":"DW Ökotante","date":"2018-04-07T20:31:34.563+0000","title":"LF Jungle and ADC Gold +","subforum":"Clans & Teams","embed":{"description":"So liebe Freunde und Clanmember, mal wieder neigt sich ein Jahr dem Ende und bietet uns die Chance zurückzuschauen auf Erlebtes und Geschafftes, auf positive Dinge und deren Kehrseite, auf gute wie auch schlechte Zeiten. Denn niemals ist es möglich, jeden Weg reibungslos zu bestreiten und Steine die einen Pfad kreuzen mit Leichtigkeit zu überspringen.","url":"http://404-multigaming.one/","image":"http://404-multigaming.one/index.php?media/2-bild2-png/&thumbnail=tiny"},"up_votes":1,"down_votes":0,"body":"Liebe Beschw&ouml;rer,\r\n\r\nwir sind ein relativ neues Team und auf der suche nach einem Jungler und ADC. \r\n\r\nWir spielen unter dem Namen 404 Funky Fishes, wie man sieht sind wir Mitglieder des 404 Multigamingclans, wo auch gewisse Regeln beachtet werden m&uuml;ssen. Nach beitritt des Clans musst du innerhalb von 6 Wochen deinen Namen mit einem 404 versehen haben, wir nehmen Potenziell nur Bewerber anfragen an die bereit sind auch nach beitritt ihren Namen zu &auml;ndern.\r\n\r\nZu unseren Zielen als Team geh&ouml;rt der Spa&szlig; an erster Stelle, jedoch m&ouml;chten wir uns alle verbessern und auch zusammen aufsteigen. Wir sind sehr freundlich und Tilten so gut wie nie, das zusammenspielt sowie auch das Sozialverhalten innerhalb der Gruppe ist uns wichtig.\r\n\r\n\r\nUnser Team:\r\n\r\nTop: 404 No i am Not (Gold V)\r\nJungle: /\r\nMid: 404 Ayato (Silber ll) \r\nADC: /\r\nSupp: 404 He is my Duo (Gold lV)\r\n\r\nSolltest du dich angesprochen f&uuml;hlen darfst du dich gerne bei uns vorstellen!!\r\n\r\nAdde am besten mich da ich Teamleiter bin und alles Organisiere: 404 He is my Duo\r\n\r\nP.S. bei Fragen oder sonstigen Sachen k&ouml;nnt ihr mich gerne anschreiben oder auf dem TS&sup3; anstupsten. \r\n\r\nTS&sup3;: ts.404-multigaming.one\r\n\r\nIch freu mich auf euch \r\n404 He is my Duo / Isa\r\n {{sticker:sg-lux-2}}","replies":[{"poster":"DV Ayato","date":"2018-04-08T11:46:34.388+0000","up_votes":1,"down_votes":0,"body":"Push","replies":[]},{"poster":"Hi im Schäfer ","date":"2018-04-07T20:32:13.728+0000","up_votes":1,"down_votes":0,"body":"Hi ich würde mich gern Melden.","replies":[]}]}