{"poster":"Mirk0RQ","date":"2016-04-15T02:20:29.197+0000","title":"Como usar bien a Nasus? ","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Necesito tips! Lo se usar pero quiero mejorar máss!  {{champion:75}} ","replies":[{"poster":"erwinchelo","date":"2016-04-15T03:32:43.812+0000","up_votes":1,"down_votes":0,"body":"El error típico de situar a Nasus como un campeón que solo es util farmeado es un absoluto error, todos los campeones farmean y se benefician de eso, nasus tiene el plus de que ademas logra una diferencia de poder con ello mediante su Q, nada mas...\n\nSiempre a tenido herramientas para ayudar o ejecutar algun gank, condicionar a los AD, ser un tanke natural aportar daño hibrido y en dps...","replies":[]},{"poster":"arielsebastian","date":"2016-04-15T03:15:49.005+0000","up_votes":1,"down_votes":0,"body":"La clave real de nasus, es saber cuando farmear y cuando aportar al equipo, nasus necesita de muchisimo farm para poder stompear una partida, pero su early no es tan mediocre, si farmeas de una forma decente, tu Q va a hacer siempre buen daño, tu W es muy buena en tf para el asesino o adc rival, por ende si no tenes la Q muy farmeada, usa esta para hacerle peel a tu adc o el que mas daño de tu team haga.\nTrata siempre, SIEMPRE, que estes \"fedeado\" de pushear muchisimo, esto va a hacer que el rival te vaya a buscar xq sino se les cae la base y tu team saque ventajas.\n\nCLAVE ABSOLUTA: ITEMIZACION CORRECTA, mucha gente se buildea nasus de la misma forma por lo que vio en una guia, pero no es asi, nasus es un hiper carry de late game, si se sabe buildear... A todo esto, siempre depende del team, hay partidas que son inganables, pero con un nasus, nunca es recomendado el surrender, no sabes cuando podes oneshotear al team rival.","replies":[]},{"poster":"danye15000","date":"2016-04-15T02:25:29.392+0000","up_votes":1,"down_votes":0,"body":"FARMEA","replies":[]},{"poster":"Kyo Hatori","date":"2016-04-15T02:24:28.873+0000","up_votes":1,"down_votes":0,"body":"Farmea, farmea, farmea\n\n\nFelices Pesadillas ;D","replies":[]},{"poster":"ZeNch","date":"2016-04-15T02:23:51.362+0000","up_votes":1,"down_votes":1,"body":"No salgas de TOP hasta minuto 40 (un año despues de empezar la partida)","replies":[]}]}