{"poster":"SEKAI","date":"2015-05-16T12:06:58.477+0000","title":"So I played this song to a friend who doesn't watch a lot of animes,","subforum":"Miscellaneous","embed":{"description":"This is also known as Spread Your Small Wings. Ishida Youko sings this I believe. DISCLAIMER I DO NOT OWN THIS ANIME NOR THE SONG THAT ACCOMPANIES IT. However I make no profit what so ever. This AMV is merely demonstrating my appreciation for the work.","url":"https://www.youtube.com/watch?v=oj-gT2kqeEw","image":"https://i.ytimg.com/vi/oj-gT2kqeEw/hqdefault.jpg"},"up_votes":3,"down_votes":2,"body":"And he said \" Sounds like some shietty arse track used in some random dating site\", which he then asked me about where the song is from,\n\nAfter I told him about the source and briefly described the content and the purpose/theme of this particular elegant yet stunning anime to him, he said\n\n\"Sounds like something that appeals to no life otakus, giving them the illusion that they might have a chance in life.\"\n\nI disagree, ladies and gentlemen,\n\n**_I disagree._**\n\nStill though, I cried a bit inside listening to him criticising one of my fav shows like that.\n\n____________\n\n___________\n\n**Here is the serious stuff,**\n\n\"Ah! My Goddess!\" is imo one of the Best anime out there. Similar to how the entirety of \"Aria\" is the physical manifestation of relaxation, Ah My Goddess is the artist&#039;s personal impression/definition on what \"love\" actually means to him. \n\nI disagree with my friend&#039;s second comment completely because the entire show started off in a somewhat quick and ridiculous fashion and the story sets in an impossible condition to begin with, being in relationship with an actual god and all. \n\nHence we can see the female lead's status of being a god isn&#039;t the main goal of this title, but simply a tool to be used to the author&#039;s advantage, in order to clearly illustrate his theme about love through a character who is absolutely pure by definition.\n\nTo him, **true love does not involve any rituals, traditions**, rules or roles. But instead he strips the idea apart into its very bare minimum in the absolute simplest form of **unconditional tolerance, understanding, mutual-appreciation and care for each other from both parties**. As cheesy as it may sound at first glance, the writer puts his own definition of love through the series in order to both illustrate and test its strength and importance, while simultaneously expressing his utter desires to know and touch this form of completely innocent and untainted form of relationship.\n\nHowever just like what the author has realised since the very beginning, this kind of love relationship just like man and god, they will never meet in real world. It&#039;s a pretty bitter conclusion really, however even with that, he nevertheless completed the story.\n\nI thoroughly deny when someone says this show is a thing to watch for when you need something feel good about yourself. No, this anime is a piece of art, one that is very close if not already, sitting as a masterpiece in my very honest opinion.\n\nGood day to you all folks.","replies":[{"poster":"DeathPhoenix9001","date":"2015-05-17T10:54:13.912+0000","up_votes":2,"down_votes":2,"body":"song is shit, looks like a shit anime, even your name is japanese, fucking weeaboo with no life, your friend is right.\n\n\"Sounds like something that appeals to no life otakus, giving them the illusion that they might have a chance in life.\"\n\" Sounds like some shietty arse track used in some random dating site\"","replies":[{"poster":"SEKAI","date":"2015-05-17T15:00:17.618+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=DeathPhoenix9001,realm=OCE,application-id=Ntey9fRZ,discussion-id=jqEAg7t1,comment-id=0002,timestamp=2015-05-17T10:54:13.912+0000)\n>\n> song is shit, looks like a shit anime, even your name is japanese, fucking weeaboo with no life, your friend is right.\n> \n> \"Sounds like something that appeals to no life otakus, giving them the illusion that they might have a chance in life.\"\n> \" Sounds like some shietty arse track used in some random dating site\"\n\nMuch assumptions bro, much assumptions.\n\nThe music is pretty awesome to be frank, unless you have a thing against both traditional European (dunno where exactly is the style taken from though, I think it's Norse inspired) and Japanese music since this song has both.\n\nThe anime itself, one might say it's just some fan service crap, however it really isn't the case if you can look past the surface. Never judge a book from its cover, this is one of those anime that is deeper than what it would lead others to believe and will bring you endless nostalgia whenever you think about it in the future.\n\nAlso the reason why my name is in Japanese is because \n\n1. \"The World\" and \"World\" were both already taken when I was renaming my account as it was a really shiet and completely uninspired name.\n2. I like the sound of this particular word when it's pronounced in Japanese, it has a weight to it, more so than its English and my mother tongue's counterparts.\n\nBut hey I guess some just really like going around trash talking to people online, I like it sometimes too.","replies":[{"poster":"xDarkRavenx","date":"2015-05-17T15:04:08.319+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SEKAI,realm=OCE,application-id=Ntey9fRZ,discussion-id=jqEAg7t1,comment-id=00020000,timestamp=2015-05-17T15:00:17.618+0000)\n> But hey I guess some just really like going around trash talking to people online, I like it sometimes too.\n\nB-baka!","replies":[{"poster":"SEKAI","date":"2015-05-17T15:14:01.341+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=xDarkRavenx,realm=OCE,application-id=Ntey9fRZ,discussion-id=jqEAg7t1,comment-id=000200000000,timestamp=2015-05-17T15:04:08.319+0000)\n>\n> B-baka!\n\nhttp://vignette1.wikia.nocookie.net/cowboybebop/images/0/07/Bang..gif/revision/latest?cb=20130731194605","replies":[]}]}]}]},{"poster":"Talon12","date":"2015-05-16T12:19:10.510+0000","up_votes":3,"down_votes":1,"body":"so its about some guy who steals goddesses hearts? what sort of sick twisted demented anime is this","replies":[{"poster":"SEKAI","date":"2015-05-16T12:32:27.362+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Talon12,realm=OCE,application-id=Ntey9fRZ,discussion-id=jqEAg7t1,comment-id=0000,timestamp=2015-05-16T12:19:10.510+0000)\n>\n> so its about some guy who steals goddesses hearts? what sort of sick twisted demented anime is this\n\nJust 1 goddess, rest are kinda just there for their own reasons, this anime remain as a love story and not a harem.\n\nThe reason behind why the main guy and girl even get to be with together is done to be intentionally sudden, bizarre and nonsensical, many may see it as a cheap plot device which to be fair it is, but it's also there to prove a point.\n\nTo the auther, the truest form of love should be completely innocent and pure without any schemes, which just as he knows, it's utterly impossible in the real world hence why the entire story is staged/constructed and started like that.\n\nHowever he doesn't give up on his ideals and encourages others to struggle and achieve this form of mutual relationships, understandings, peaceful and responsible kind of love.\n\nAnd I dig his ideas, I really do.","replies":[{"poster":"Talon12","date":"2015-05-16T12:35:59.039+0000","up_votes":2,"down_votes":1,"body":"you. scare me. Watch anime with action. Not about a guy trying to get ins with a goddess","replies":[{"poster":"xDarkRavenx","date":"2015-05-16T16:42:20.522+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Talon12,realm=OCE,application-id=Ntey9fRZ,discussion-id=jqEAg7t1,comment-id=000000000000,timestamp=2015-05-16T12:35:59.039+0000)\n>\n> you. scare me. Watch anime with action. Not about a guy trying to get ins with a goddess\n\nYou. Scare me. Watch anime other than action for a change. Not about Kirito pwning shit in Sword Art Fuckline.","replies":[{"poster":"Talon12","date":"2015-05-18T00:18:30.925+0000","up_votes":1,"down_votes":2,"body":"I don't watch that, its boring, they need to have a proper story line as well as some action. I just cant watch anime that 100% love story and nothing else.","replies":[{"poster":"SEKAI","date":"2015-05-18T10:24:21.906+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Talon12,realm=OCE,application-id=Ntey9fRZ,discussion-id=jqEAg7t1,comment-id=00000000000000010001,timestamp=2015-05-18T00:18:30.925+0000)\n>\n> I don't watch that, its boring, they need to have a proper story line as well as some action. I just cant watch anime that 100% love story and nothing else.\n\nThis series has a bit of everything really, it just puts emphasis on the romance aspect of it, and since it's a more mature approach (here I don't mean \"real\", but \"in-depth\") on the topic I really don't mind it.\n\nIt has some actions, nice amount of comedy, steadily pacing story/plot, no fillers, the conversations are about the right length so you won't get mentally bored hearing about things (although yes the plot can be slow sometimes), not the best but definitely capable visuals (released about a decade ago mind you), interesting and diverse character sets, warming and touching story, and more.\n\nWith all that, you already have a recipe for creating a series that is unique, enjoyable and potentially something can truly hold a special place in people's heart.\n\nEDIT: Talking about Ah My Goddess here, forgot to add.","replies":[{"poster":"Talon12","date":"2015-05-18T13:02:54.904+0000","up_votes":1,"down_votes":0,"body":"but not enough focus on a few aspects + I saw the \"rape\" scenes on adds on youtube, that** REALLY** did not help either","replies":[{"poster":"SEKAI","date":"2015-05-18T13:24:09.140+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Talon12,realm=OCE,application-id=Ntey9fRZ,discussion-id=jqEAg7t1,comment-id=0000000000000001000100000000,timestamp=2015-05-18T13:02:54.904+0000)\n>\n> but not enough focus on a few aspects + I saw the \"rape\" scenes on adds on youtube, that** REALLY** did not help either\n\nI don't really recall Ah My Goddess having any suggestive scenes except on like 1 or 2 occasions where it was done in comical and _somewhat _ plot related purposes.\n\nOr was it you were thinking that my last post was talking about Sword Art Online? Since I just realised I didn't specify which anime I was talking about there.\n\nAh My Goddess completely destroys Sword Art Online in terms of plot and romance category though, which are what Sword Art Online is meant to be about mostly, the only thing it has better than the former show is that it has nicer graphics that's all.","replies":[]}]}]}]},{"poster":"SEKAI","date":"2015-05-17T02:37:38.937+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=xDarkRavenx,realm=OCE,application-id=Ntey9fRZ,discussion-id=jqEAg7t1,comment-id=0000000000000001,timestamp=2015-05-16T16:42:20.522+0000)\n>\n> Watch anime other than action for a change. \n\nIndeed.","replies":[]}]},{"poster":"SEKAI","date":"2015-05-16T12:41:44.949+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Talon12,realm=OCE,application-id=Ntey9fRZ,discussion-id=jqEAg7t1,comment-id=000000000000,timestamp=2015-05-16T12:35:59.039+0000)\n>\n> you. scare me. Watch anime with action. Not about a guy trying to get ins with a goddess\n\nI see anime as entertainment, I also see them as literature to be examined.\n\nA show like this that analyses Platonic and spiritual love (and it doesn't go into the extreme, simply tap onto it and explores the idea a little) holds a very high place in my heart indeed.","replies":[]}]}]}]},{"poster":"xDarkRavenx","date":"2015-05-17T11:56:16.184+0000","up_votes":1,"down_votes":0,"body":"You'll soon see the light of being an Otaku! I PROMISE YOU! {{champion:26}}","replies":[{"poster":"SEKAI","date":"2015-05-17T15:09:13.936+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=xDarkRavenx,realm=OCE,application-id=Ntey9fRZ,discussion-id=jqEAg7t1,comment-id=0003,timestamp=2015-05-17T11:56:16.184+0000)\n>\n> You'll soon see the light of being an Otaku! I PROMISE YOU! {{champion:26}}\n\nSomeone who understands!\n\nhttp://33.media.tumblr.com/tumblr_ma05qcS8xs1qjl74r.gif\n\nYes bro, you bet!\n\nhttps://33.media.tumblr.com/a6545e5b6c2120a7b327a2c4acfd48c2/tumblr_mlhlft8Lbh1rj24vho1_400.gif\n\nHue.","replies":[]}]},{"poster":"Talon12","date":"2015-05-16T12:19:34.844+0000","up_votes":1,"down_votes":0,"body":"ps. I like anime","replies":[]}]}