{"poster":"SEKAI","date":"2015-09-22T17:49:52.963+0000","title":"Tryndamere's Ultimate","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":1,"body":"Here is his ultimate.\n\n> **Undying Rage**\n> COOLDOWN: 110 / 100 / 90\n> Active: Tryndamere instantly gains Fury and becomes** immune to death for 5 seconds**, during which his health cannot fall below 1. Undying Rage **can be used even when affected by crowd control**.\n> **Fury Gained: 50 / 75 / 100**\n> If Tryndamere is **below 3% maximum health when Undying Rage ends, he heals to that amount.**\n\nIs this ultimate OP in your opinion? I used to think otherwise, but atm imo it is, or at least I feel it&#039;s way too problematic to deal with.\n\nI mean most teamfights rarely even last 10 seconds how come he gets access to a guaranteed 5 second immunity, guaranteed maximum damage and guaranteed HP refund on a somewhat short CD of 100 sec or so with 0 resource cost?\n\nIt&#039;s not like he has zero utility like say Yi who is quite useless beyond winning a match that he has already won, or Nasus who effectively needs a long time to properly ramp up and can not kill people on a second basis. Trynd on the other hand outside of his potential ridiculous damage, has a reliable gapcloser and an unreliable but powerful slow (and has a AoE AD reduction in it), all on top of his instant heal. \n\nI don&#039;t mind the rest of his kit THAT much, but the ulti definitely needs to get a look at.\n\nIt lasts way too long and costs too much to pin him in place and kill him properly. It&#039;s not like it&#039;s Sion&#039;s Passive where just kiting alone actually kills the damn thing, no you still have to somehow kill Trynd after devoting a huge chunk of your resource just to prevent him from 2 shotting your entire team (let's not mention he could just E away after ulti). You can't just burst him dead either, unlike again Sion's Zombie Run or Master Yi's Highdunker, or even Nasus's \"I WIn\" in some cases given if you have someone who scales well with BotRK.\n\nAlso, once he gets beyond 2 to 3 items, it becomes impossible to duel him without at least moving 2 to 3 people on him at once every single time.\n\nThat in my opinion, is quite BS.\n\n**Knock 1 or 2 seconds from that ultimate, at the very least.**","replies":[{"poster":"SorakaXHealBoT","date":"2015-09-22T18:00:41.870+0000","up_votes":1,"down_votes":0,"body":"Just CC him when he ult. He may be immune to damage but he is not immune to CC its just that if you got warwick ulted as tryndamere you can use your ult to get out of it alive. Hard CC will still destroy Tryndamere and i don't think there is a need for nerfs. If there is something that needs to be nerfed it would be his rage bar and passive which grants him free 35% crit chance and if you are lucky in lane at early levels u can crit your enemies to death which is kinda op.","replies":[{"poster":"DragonOfTheVoid","date":"2015-09-22T18:23:40.896+0000","up_votes":1,"down_votes":0,"body":"just cc him cos all champs have cc","replies":[{"poster":"BadLuckFollowsMe","date":"2015-09-22T22:23:11.766+0000","up_votes":1,"down_votes":0,"body":"The odds of nobody on your team having cc is basically zero.\nIf he picks after you and picks trynd, your team should be helping you with it.\nIf you pick after him and don't take someone with cc, that's your problem.","replies":[{"poster":"DragonOfTheVoid","date":"2015-09-23T05:34:58.168+0000","up_votes":1,"down_votes":0,"body":"{{champion:122}} {{champion:86}} {{champion:41}} top lane picks {{champion:266}} {{champion:11jg picks {{champion:131}} {{champion:7}} {{champion:76}} mid lane {{champion:222}} {{champion:236}} {{champion:67}} adc {{champion:53}} {{champion:412}} {{champion:201}} sup all these champs will be in lane 9 out of 10 times as they are meta picks now if we look at the possible out comes we have about 4seconds of cc on about a 10 sec cd now for a tryind to ult he needs to get to about 300 hp 100 if you are good with him now in a team fight a sup will not remember to save cc for the tryind now to start the fight a champ must be a: court out b: forced c: cc now lets say the sup missis the tryind then he cant cc for 10 sec ok ok lets say you have a off meta pick hahahah and they have cc if they miss tryind will be fine lets say that there is a yi and a tryind both fed ether 1 can ko your team your team wont have enof cc to stop them and if you do the players in the game will not have the brain to do so as I have played tryind many times I was lets say 10 0 0 come 20 min the fest of my team all lets say 4 3 0 now im the most fed on my team yet the cc all goes on the adc mid or jg and a good tryind will only go in if a: all cc is used b: he knows that the enemy team are all nubs and wont cc him or c: he is so fed he can just 1v5","replies":[{"poster":"BadLuckFollowsMe","date":"2015-09-23T10:01:57.929+0000","up_votes":2,"down_votes":0,"body":"That entire argument, as hard as it was to read because that certainly wasn't English, entirely revolves around the Trynd getting fed, your team being useless, incorrect targeting of cc, or all the above. That applies to literally any top lane champion, not just Trynd.","replies":[]}]}]},{"poster":"GigaPube","date":"2015-09-23T11:29:42.742+0000","up_votes":1,"down_votes":0,"body":"if you stopped playing yolo assassins like kat and akali you'll see hes incredibly easy to deal with","replies":[{"poster":"DragonOfTheVoid","date":"2015-09-23T12:00:40.926+0000","up_votes":1,"down_votes":0,"body":"I don't have alkali and I don't play kat","replies":[]}]}]}]},{"poster":"JasonWazza","date":"2015-09-22T18:47:18.179+0000","up_votes":1,"down_votes":0,"body":"The only thing i have never understood is why it can be used while under CC, other then that it's fine in my opinion.","replies":[{"poster":"SEKAI","date":"2015-09-22T23:29:18.693+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JasonWazza,realm=OCE,application-id=FjGAIbRv,discussion-id=OwZbKp3U,comment-id=0002,timestamp=2015-09-22T18:47:18.179+0000)\n>\n> The only thing i have never understood is why it can be used while under CC, other then that it's fine in my opinion.\n\nYeah it shouldn't be usable under all CCs.\n\nIf the CCs we're talking about is say slow then by all means, should be usable, but when he is stunned, silenced etc the spell shouldn't be available tbh.","replies":[{"poster":"ƒamous","date":"2015-09-25T15:22:58.386+0000","up_votes":1,"down_votes":0,"body":"Same deal as everyone elses. I've had ults cancelled because of a silence or other CC. The same should apply to Tryndamere's, I don't see why he's any different.","replies":[]}]},{"poster":"GigaPube","date":"2015-09-23T11:31:22.290+0000","up_votes":1,"down_votes":0,"body":"cos then he'd be useless obviously lol. also realistically if you think about it if you're close to death and you're induced with undying rage its not like being stunned or blinded could stop you. maybe if you were polymorphed though.....","replies":[]}]},{"poster":"Zorphiax","date":"2015-09-22T21:32:27.929+0000","up_votes":1,"down_votes":0,"body":"\"CD: 110 / 100 / 90\nActive: Tryndamere instantly gains Fury and becomes immune to death for 5 seconds, during which his health cannot fall below 1. Undying Rage can be used even when affected by crowd control.\nFury Gained: 50 / 75 / 100\nIf Tryndamere is below 3% maximum health when Undying Rage ends, he heals to that amount.\"\n\nI reckon that is immune to death should scale with level so 3/4/5 this only changes things early game but it's enough to make Tryn a bit less 'Over Powered'","replies":[{"poster":"SEKAI","date":"2015-09-22T23:33:41.900+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=mutley,realm=OCE,application-id=FjGAIbRv,discussion-id=OwZbKp3U,comment-id=0003,timestamp=2015-09-22T21:32:27.929+0000)\n>\n> I reckon that is immune to death should scale with level so 3/4/5 this only changes things early game but it's enough to make Tryn a bit less 'Over Powered'\n\nI would agree on this one.\n\nConsidering facing a just turned lvl6 Trynd in lane is an absolute nightmare, and since that spell is inarguably stronk as hell, giving it 5 sec immunity from the get go at 6 isn't really the way to go imo.\n\nIt saves the enemy team from a lot of hair loss as well.","replies":[{"poster":"ninjaIRL ","date":"2015-09-23T11:55:03.537+0000","up_votes":1,"down_votes":0,"body":"It's basically a Kayle ult. Should be treated with similar care.","replies":[{"poster":"Zorphiax","date":"2015-09-24T07:48:50.068+0000","up_votes":1,"down_votes":0,"body":"Yes I agree with you, but Kayle ult only last for 2.5 or 3 seconds and targets any allied champion. Tryn is stronger because it's 5 seconds and provides him with 100 fury so when or just b4 his ult ends hit q gain 250/300 hp.(if still 100 fury)","replies":[{"poster":"ninjaIRL ","date":"2015-09-24T15:14:47.165+0000","up_votes":1,"down_votes":0,"body":"I don't disagree.","replies":[]}]}]}]}]},{"poster":"The Spawn Man","date":"2015-09-23T08:33:30.110+0000","up_votes":1,"down_votes":0,"body":"I used to have an issue with Tryn when I mained top and versed him frequently. He'd always tower dive me and destroy me. His ultimate seemed to last too long, with a very quick cool down. But now I main support and jungler, and I verse him late game, and with a tiny bit of CC, he maybe kills one champion before being a free kill. So although I think his cool down on his ult could use maybe a tiny bit longer, I think his lack of ability in late game team fights on offence means he's more or less balanced.\n\nThat said, if anyone wants to argue he is degenerate, I will not argue against that. In lane I have felt his horror, so will not deprive anyone of a good gripe at the bugger.","replies":[]},{"poster":"Jink","date":"2015-09-22T17:58:34.836+0000","up_votes":1,"down_votes":0,"body":"{{summoner:3}}\n\nYour 600 damage Crits are now 300 Damage crits and 150 damage autos.\n\nYou can get in and that's it. Your engage is reduced for 2.5 seconds, so by the time you've hit ulti you have to all in with no escape mechanism besides flash and you will be low HP by now being a squishy melee Carry and your only option is to flash onto enemy carry for a kill but if their support has exhaust and enemy laner has exhaust you will be exhausted on entering the fight and exhausted on flashing to the enemy ADC so will be dead or you can disengage and not play a Champion that is completely shut down by 1 summoner spell on your enemy laner.","replies":[{"poster":"SorakaXHealBoT","date":"2015-09-22T18:01:37.573+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Level1Pentakill,realm=OCE,application-id=FjGAIbRv,discussion-id=OwZbKp3U,comment-id=0000,timestamp=2015-09-22T17:58:34.836+0000)\n>\n> {{summoner:3}}\n> \n> Your 600 damage Crits are now 300 Damage crits and 150 damage autos.\n> \n> You can get in and that's it. Your engage is reduced for 2.5 seconds, so by the time you've hit ulti you have to all in with no escape mechanism besides flash and you will be low HP by now being a squishy melee Carry and your only option is to flash onto enemy carry for a kill but if their support has exhaust and enemy laner has exhaust you will be exhausted on entering the fight and exhausted on flashing to the enemy ADC so will be dead or you can disengage and not play a Champion that is completely shut down by 1 summoner spell on your enemy laner.\n\n{{summoner:1}} {{item:3140}}","replies":[{"poster":"DragonOfTheVoid","date":"2015-09-23T05:35:51.423+0000","up_votes":1,"down_votes":0,"body":"you forgot {{item:3102}} stops 1 ability","replies":[]},{"poster":"Jink","date":"2015-09-22T18:54:31.220+0000","up_votes":1,"down_votes":0,"body":"30 Minutes into the game {{item:3140}} \nStill can't remove a secondary exhaust so still cutting his damage by 40% for 2.5 seconds rather than 40% for 5 seconds.\n{{summoner:1}} over {{summoner:14}} /{{summoner:12}} nty.\n\nQSS is way better for removing a stun because at least then you'll still do some damage, whereas you can wait out a stun and cleanse the exhaust but by that time their AD carry or w/e will be outta range.\n\nIf you have nothing better to use cleanse on then w/e but if they have 2 exhausts it's really not gonna help you.","replies":[]}]}]},{"poster":"Garens Harem","date":"2015-09-23T01:53:32.798+0000","up_votes":1,"down_votes":0,"body":"i hate his RNG the most\n\nrandom crits winning lane lol","replies":[]},{"poster":"Olee","date":"2015-09-22T23:44:10.548+0000","up_votes":1,"down_votes":0,"body":"He is fine apart from the fact that his ult needs a few seconds knocked off of it and it needs to not be usable under hard cc","replies":[]}]}