{"poster":"AjabikiFTW","date":"2015-12-16T21:06:16.481+0000","title":"Petition to Nerf Yasuo","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":2,"body":"The only nerf Yasuo needs is a lower difficulty rating in his champion page.\r\n\r\nAs it stands the difficulty on Yasuo&#039;s champion page states that not only is he a high difficulty champion, but he is the highest difficulty champion of all the resource-less champions. I personal do not think he deserves such a high difficulty rating because of two reasons, he is a resource-less champion with low cooldowns and he is a lane bully. As a resource-less champion with low cooldowns, Yasuo isn&#039;t limited in decisions as much as a resource champion. A resource champion has to decide the best way to use his resource (mana, energy, rage, etc.) and not using the resource the best way can limit options. For Example, Once while playing syndra I was poking my opponent with Q whenever he came to CS, but because I was poking so much (and as a noobie syndra player not hitting every time) I didn&#039;t have enough mana to escape or fight the gank. Since a yasuo doesn&#039;t have a resource to worry about, he can reliably go HAM and not worry about not having enough resources to burst or escape. Second, Yasuo is a lane bully which gives him a strong early game. Riot has stated that a slight advantage in the early game snowballs to a big advantage into the late game (at least that&#039;s the logic for the Veteran&#039;s Scar changes). \r\n\r\nNow I&#039;m not saying Yasuo is easy, there is a skill floor to play a yasuo well and a Huge skill ceiling  to master Yasuo Mecahnics. What I I&#039;m saying is that Yasuo is as difficult to play as Lee Sin and the difficulty in his champion page should match.\r\n\r\nTL;DR - Reduce Yasuo&#039;s difficulty stat to be around the same difficulty as Lee Sin.","replies":[{"poster":"Hyde","date":"2015-12-17T08:34:09.013+0000","up_votes":1,"down_votes":0,"body":"I think Riot messed up on making him resource-less.. his low cool downs are not something you usually see on champions with no mana (Garen and Kat) they have to do things right or wait for the right moment before striking... however Yas just goes and goes and goes and kills people and we weep from it. Perhaps if they gave him energy like zed where he could go and go and go for a little bit but have to stop and recharge after that so other players have a chance to escape :3","replies":[]},{"poster":"Gentleman Gnar","date":"2015-12-16T22:15:39.976+0000","up_votes":1,"down_votes":0,"body":"{{champion:157}}  isn't that Op, as long as u don't feed him, (what most people do) because they don't know what there doing against{{champion:157}}","replies":[]}]}