{"poster":"giantheone","date":"2019-05-16T22:49:44.889+0000","title":"Problemi conessione al gioco eolo","subforum":"Discussioni generali","up_votes":3,"down_votes":0,"body":"Allora.. come a molti di voi successo o succede tutt'ora, dopo la champ select non si riesce a conntere alla partita (nemmeno alla schermata di caricamento dove si vedono i 10 champ). dopo aver studiato parecchie ore, contattato la riot per sapere come risovere ho capito che è un problema che molti (se non tutti) i clienti EOLO hanno, ma non solo loro.\r\nil fatto sta tutto nel ip pubblico che eolo NON da di default (ovviamente) quando sottoscrivete un contratto, e cio si ripercuote sul nat della connessione. \r\nA questo punto ho deciso di contattare proprio eolo sia su facebook che telfonicamente. Dopo aver sudato un pochino sono riuscito ad avere una risposta: se volete un ip pubblico dovete pagare un sovrattassa di 7.20 euro al mese (se ricordo bene), e non esistono metodi ad oggi per averlo gratuito. \r\novviamente quando mi è stata data questa risposta non ho fatto altro che cercare altri metodi. avevo gia impostato la DMZ sul mio ip dal router ma nulla, avevo gia aperto tutte le porte consigliate per lol ma nulla ancora.\r\nalla fine sono riuscito a rislvere (almeno per ora) comprando per davvero poco una vpn on line. per la mia esperienza vi consiglio Nordvpn, mi sono trovato benissimo, problema risolto all'istante con moloti meno euro.\r\nSe non avete capito qualcosa o se posso essere d'aiuto scrivete pure qua sotto ( anche se avete delle critiche a quello che ho scritto ofc) \r\ndetto questo ci si vede sulla summoners rift","replies":[{"poster":"x Narkotek x","date":"2019-05-20T10:29:02.629+0000","up_votes":2,"down_votes":0,"body":"Stesso problema da un paio di giorni.. La rito non può fare niente al riguardo vero? \nNon sono per niente ferrato con il computer e non ho capito la metà delle cose che hai detto quindi non saprei cosa fare\nTi ho aggiunto in game, avrei bisogno di un aiuto {{sticker:cass-cry}}","replies":[]},{"poster":"Patheticc","date":"2020-02-19T21:26:13.771+0000","up_votes":1,"down_votes":0,"body":"Ciao! Ho riscontrato lo stesso problema, e sto considerando l' idea di utilizzare una VPN, tuttavia sono un po' ignorante in materia e vorrei capire meglio, come l'ultilizzo di una VPN risolva il problema e se richieda una qualche specifica configurazione (es. porte del router).\nInoltre vorrei sapere se con la vpn dovrei anche richiedere un IP dedicato ecc.","replies":[]},{"poster":"WhiteTulip","date":"2020-01-29T12:55:40.358+0000","up_votes":1,"down_votes":0,"body":"Quindi basta usare un vpnper risolvere la situazione ?","replies":[]},{"poster":"beppedessi","date":"2019-05-16T22:54:45.983+0000","up_votes":1,"down_votes":0,"body":"Ricordo il tuo vecchi post e mi è dispiaciuto non poterti aiutare. Per caso hai mai provato a fare un trace route pingando il server EUW? Giusto per capire dove il segnale si interrompe.","replies":[{"poster":"giantheone","date":"2019-05-17T08:03:21.358+0000","up_votes":1,"down_votes":0,"body":"si ma non ho trovato nulla di rilevante purtroppo.. {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"beppedessi","date":"2019-05-17T09:26:59.580+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=giantheone,realm=EUW,application-id=MJVj50Jw,discussion-id=vijPXFP8,comment-id=00000000,timestamp=2019-05-17T08:03:21.358+0000)\n>\n> si ma non ho trovato nulla di rilevante purtroppo.. {{sticker:slayer-jinx-unamused}}\nPerò immagino che si blocchi ad un certo punto del percorso. Esattamente a che punto si blocca? Ancora meglio sarebbe se tu riuscissi a darmi l'intero trace route (magari in privato su Discord). In questa maniera posso passarlo direttamente ad un tecnico del supporto e magari mi dice qualcosa in più.","replies":[]}]}]}]}