{"poster":"sneezing slug","date":"2016-05-13T16:59:27.085+0000","title":"[Champion Concept] Zone, the Opportunist (Work in Progress)","subforum":"Concepts & Creations","up_votes":18,"down_votes":16,"body":"#**Zone, the Opportunist**\n\nhttp://i.imgur.com/CkR8XaN.jpg\n\nhttps://www.youtube.com/watch?v=Xjq5jkd5wVg\n\n>_Primary Role_: **Marksman**\n>_Secondary Role_: **Assassin**\n\nhttp://2.bp.blogspot.com/-mELauXLseGQ/UuwIlmo7ZAI/AAAAAAAABC4/ThiNybzMSgY/s1600/Trenner_gears_wei%25C3%259F.png\n\n#**General Information/Gameplay**\n\n> **Base Stats--------------------------------------Growth per/level-------------------------------Stats @ 18**\n> **Health:** 500--------------------------------------------------(+65.5--------------------------------------1613.5\n> **Mana:** 250--------------------------------------------------------(+55-----------------------------------------1185\n> **AD:** 72------------------------------------------------------------------(+4--------------------------------------------140\n> **AP:** 0---------------------------------------------------------------------(+5----------------------------------------------85\n> **HP/5:** 3.55-------------------------------------------------------(+0.8------------------------------------------13.6\n> **MP/5:** 7.5-------------------------------------------------------------(+2------------------------------------------41.5\n> **Range:** 500 (Ranged)---------------------------------------(+0-------------------------------------------500\n> **AS:** 0.5---------------------------------------------------------------(+2%-----------------------------------------0.67\n> **Armor:** 15---------------------------------------------------------(+1.5------------------------------------------40.5\n> **Magic Resist:** 30------------------------------------------------(+0-----------------------------------------------0\n> **Movement Speed:** 335------------------------------------(+0-------------------------------------------335\n\n**Zone** is a high damage marksman who makes sure his shots meet their target in a timely manner. He's rather squishy and can't take too many hits, but as long as he can damage you first, he won't have any problems. Zone is also an expert at hitting all his enemies at once, with his Q ricocheting back and forth at enemies to hit them more than once with the same shot. His E allows him to clear waves fairly well in the late game, as well as scouting around to check bushes, around walls, and dishing out hurt in teamfights when the enemy is scrunched up into a single area. Need to take a step back to get a clear shot, or is the enemy laner getting a little too close for comfort? Zone's W takes care of that by teleporting a short distance with a very short distance, and for a small window, cripples ability-driven champions with a quick silence just enough time for you to get away or squeeze in a few more shots for the trade. Finally, Zone's ultimate ability allows him to make sure he always hits his target with a controllable skillshot with high damage output, allowing for Zone to smack down a finisher on one or more enemies trying to run away, or even put a dent to a large group in a teamfight.\n\n>**Design Philosophy: General Information/Gameplay**\n>\n>Zone overall has been quite a challenge to design in concept. Gun-wielding champions in League are overall very hard to get right, without going overboard and making it seem out of place in the game. And with a rifle, it was very hard to make a differentiation between Zone and Caitlyn, two rifle wielding Marksmen. With that, I wanted to focus more on _zoning_ (I like to think I'm funny sometimes) the enemy laner and keeping the pressure on, but also keeping in mind balance, so also keeping him a tad squishy. \n>\n>Overall, Zone is meant to excel in fighting against a group, as opposed to a single target, but can still fight solo just as efficiently. However, beyond his W, Zone is a very low mobility marksman, and can easily be ganked if the Zone player is not taking mind into warding or scouting around with his E.\n\nhttp://2.bp.blogspot.com/-mELauXLseGQ/UuwIlmo7ZAI/AAAAAAAABC4/ThiNybzMSgY/s1600/Trenner_gears_wei%25C3%259F.png\n\n#**Favorable items on Zone**\n\n{{item:3085}} : Runaan's is a must on Zone. With his passive and his E, clearing waves and hitting absolutely everything at once has never been easier.\n\n{{item:3072}} : Sustain is something that Zone really lacks, and with Bloodthirster this will make sure that Zone stays on the battlefield.\n\n{{item:3046}} : Attack Speed for that extra damage rate.\n\n{{item:3031}}/{{item:3508}} : Investing in damage/crit chance is never a bad idea, and would definitely allow additional hurt to be dished out with Zone's E.\n\nhttp://2.bp.blogspot.com/-mELauXLseGQ/UuwIlmo7ZAI/AAAAAAAABC4/ThiNybzMSgY/s1600/Trenner_gears_wei%25C3%259F.png\n\n> #**Passive: Hex-Tech Piercing Rounds**\n\n----\n>**\"Taking the shot.\"**\n\n**Zone**&#039;s basic attacks fire extremely fast rounds, instantly striking the target. Additionally, the shots pierce targets, extending 250 units past the unit hit or until it hits another target, dealing physical damage equal to 50% of **Zone**&#039;s attack damage. If a single basic attack kills two units, Zone gains 100% more gold from both kills.\n\n>**Design Philosophy: Passive**\n>\n>Whenever I create a champion concept I want to follow in on one thing always: Is this bringing something new to the League of Legends? A common folly among concepts is being far too similar to existing champions, and since we all have our favourite champions which mold our playstyles, which can more or less effect how we design champion concepts, this is an easy trap to fall upon. Zone's passive focuses around lining up his targets to output the most damage possible. Enemies who stand directly behind their minions will find themselves in a tight situation when Zone begins harnessing minion kills for gold, making sure they keep back or at least move around the line of fire to avoid the most damage possible.\n\nhttp://2.bp.blogspot.com/-mELauXLseGQ/UuwIlmo7ZAI/AAAAAAAABC4/ThiNybzMSgY/s1600/Trenner_gears_wei%25C3%259F.png\n\n> #**Q: Rubberized Shells**\n_Cost:_ **70/75/80/85/90**\n_Cooldown:_ **11/10/9/8/7 seconds**\n_Casting Range:_ **725 units**\n_Skillshot Width:_ **115 units**\n_Skillshot Speed:_ **1500**\n\n----\n>**\"Dodge _this_.\"**\n\nZone shoots out a linear shot from his railgun, dealing **75/95/115/135/155 (+60% AD) physical damage** to each enemy it passes through. If the shot hits a wall, it ricochets off, resetting the distance of the skillshot. The skillshot will bounce 1/1/2/2/3 times before fading. After the first bounce, the skillshot deals 30% more damage, and moves twice as fast.\n\n>**Design Philosophy: Q**\n>\n>Zone's Q has to be one of my favourite abilities in his kit besides his ultimate ability. I've always yearned for an ability that could bounce around walls, allowing for interesting bank shots onto enemies and landing unexpected hits in trades. One thing I'd like to note that for people who do not use quickcast, the blue outline of the skillshot would also show where it would bounce off to, allowing you to use this to your advantage. This ability is also a nightmare in the jungle, where walls are sandwiching in on people. Using this in the right spot can ensure that each shot hits, putting out a lot of damage.\n\nhttp://2.bp.blogspot.com/-mELauXLseGQ/UuwIlmo7ZAI/AAAAAAAABC4/ThiNybzMSgY/s1600/Trenner_gears_wei%25C3%259F.png\n\n> #**W: Cognitive Dysfunction**\n_Cost:_ **100/110/120/130/140 Mana**\n_Cooldown:_ **21/20.5/20/19.5/19 seconds**\n_Casting Range:_ **425 units**\n_AOE Radius:_ **250 units**\n\n----\n>**\"Not worth my paycheck.\"**\n\n**Zone** blinks a small distance, dealing **65/90/115/140/165 (+60% AP) magic damage** to enemies nearby his original location and blinding them for 2 seconds.\n\n>**Design Philosophy: W**\n>\n>One thing that annoys me about any champion design is when people forget to include some form of mobility. Champions that don't have at least one form of dash, speed buff, flash-like ability or at least some form of CC to lock down incoming targets really puts a cripple on champions, making them almost sitting ducks if they're out of position when the jungler comes in. With that, I made a solution that gives off mobility but also is not a superbly overpowered ability. It allows Zone to create some distance between him and his target, as well as temporarily crippling them so that he can get a clear shot.\n\nhttp://2.bp.blogspot.com/-mELauXLseGQ/UuwIlmo7ZAI/AAAAAAAABC4/ThiNybzMSgY/s1600/Trenner_gears_wei%25C3%259F.png\n\n> #**E: Hexdrone**\n_Cost:_ **85/95/105/115/125 Mana**\n_Cooldown:_ **16/15/14/13/12 seconds**\n_Casting Range:_ **1100 units**\n_AOE Radius:_ **450 units**\n\n----\n>**\"I guess I'll just have to hit all of you at once.\"**\n\nPassive: **Zone**'s basic attacks have +15%/+20%/+25%/+30%/+35% attack range against stationary non-turret targets.\n\n**Zone** throws a scout drone at the target area, landing after a 1 second delay. It reveals the area for 5 seconds, as well as revealing stealth traps, wards and champions. If a target remains in the area for 2.5 seconds, **Zone** assesses the target's weak points and fires upon them, dealing **110/160/210/260/310 (+50% AD) physical damage** to the target.\n\n>**Design Philosophy: E**\n>\n>This is also a very unique ability concept wise but once you get down to it, it's pretty basic. It's a small clairvoyance-based ability that does some damage in the area if someone in the said area is being a dumby and hasn't yet moved out of it yet. This ability overall gives Zone some wave clear (and some camp clear if you really would want to go Zone jungle, it wouldn't be a super bad idea and his W would provide some pretty hefty ganks now that I think about it.) and also allows him to have a little more map awareness as his W does take a bit to charge up. \n\nhttp://2.bp.blogspot.com/-mELauXLseGQ/UuwIlmo7ZAI/AAAAAAAABC4/ThiNybzMSgY/s1600/Trenner_gears_wei%25C3%259F.png\n\n> #**R: .256 Caliber Hex-Tech Scorpio Harpoon mk-7**\n_Cost:_ **150/200/250 Mana**\n_Cooldown:_ **120/110/100 seconds**\n_Casting Range:_ **Global**\n_Skillshot Width:_ **80 units**\n_Skillshot Speed:_ **1000**\n_AOE Radius:_ **500 units**\n\n----\n>**\"Where have you to run?\"**\n\n**Zone** charges up his railgun for a high-energy attack, channeling for 2.5 seconds, then launching a hex-rocket in a target direction. **Zone** may reactivate this ability any amount of times during the duration of the ability to redirect the direction of the rocket, causing it to turn and move towards that direction, which takes a full 1 second to make the turn if it's in a completely different direction, but no time at all to shift slightly in a different direction.\n\nAfter 10 seconds or upon the rocket hitting an enemy champion, the rocket explodes, dealing **125/225/325 (+125% AD)** physical damage to that champion and surrounding units in an area, and dealing an additional **5% (+50% AP) magic damage** for each second the rocket was in air.\n\n>**Design Philosophy: R**\n>\n>I honestly find this being the ability that makes Zone what he is. A controllable skillshot has never been done in League, not to mention global, and it's ability to be redirected makes Jinx/Ashe/Ezreal's global ults a far-cry as to what this ultimate ability is capable of. For one, it deals no damage to minions on the way, felt like it's high damage output+explosion radius/redirectability already fit quite a bit into the package, and secondly, I put a 10 second timer on it (which is subject to change, as I might lower that a bit) that ensures no one just infinitely has a rocket going.\n>\n>All in all, this ability is exactly what it's supposed to be: Nearly undodgeable. To make sure it doesn't hit you, you'd either have to outrun it, or keep playing tricks on the rocket until it's timer goes out, as it does take some time to make a full turn. A high mobility trickster like Fiora or Fizz will find no problem in avoiding this ultimate if they can outplay the man behind the rocket.\n\nhttp://2.bp.blogspot.com/-mELauXLseGQ/UuwIlmo7ZAI/AAAAAAAABC4/ThiNybzMSgY/s1600/Trenner_gears_wei%25C3%259F.png\n\n#**Lore**\n\n**Friends:** {{champion:163}} \n\n**Enemies:** {{champion:268}} {{champion:245}} \n\n> With the rise of the glaring sun, **Zone**, a young boy among the nomadics of the desert, would be sent to hunt for food each day. His remarkable blessing of superb sight was gifted to him at birth, allowing one eye to see as clear as day without any delusions, but with the other eye completely blind. With this gift, he would often make use of a bow to strike down an animal in the distance, dragging it home before sundown for the rest to dine. Eventually, he saved up enough to buy off an old, rustic rifle from a traveling merchant. The rifle had a scope, however it was only in the way of Zone's superior vision, so he tore it off. \n> \n> Years later, with the return of Shurima-- And Azir, Zone was one of the few who were skeptical of Azir's seemingly self-proclaimed authority. It only got worse upon Azir taxing his \"citizens\", whether they chose to be his citizens or not, of their food, water and wealth. With Zone coming home after a long day of hunting a large beast for supper, only to have half of it stowed away as soon as he arrived, not only irritated him, but enraged him. He attempted to fire a shot at the ascended Azir during one of Azir's speeches to his people. The shot pierced the side of his neck, wounding him but not killing him. As a result, Azir sentenced Zone to death, sending his soldiers after the boy. His parents, although frustrated that he would put himself and his family in a situation like this, sent their child off to the distant city of Zaun to escape Azir's wrath. \n> \n> Over the course of a year, Zone affiliated himself with many of the underlives of Zaun, as well as several run-ins with the authorities. It was very wide-spread of Zone's sight capabilities throughout all of Zaun, and through that, many sought out to chip off a bit of their wealth to Zone in exchange to make specific people disappear. Although Zone's morals detested against it, he did what he could to survive in a harsh, new urban environment.\n> \n> However, time caught up to Zone, and Zaunite authorities had overcame him and his assets. As punishment, he was sentenced to a life's sentence for killing limitless amounts of people in his time. He was only in prison for a short time, as word of his capabilities, and his specific situation, had finally reached the corporate ears of Zaun's largest corporation: Hex-Tech. Hex-Tech offered Zone a pardon on his sentence but only on the agreement that Zone would carry out their wishes and demands, and would supply him with top of the line prototypes of Hex-Tech equipment for him to do the job. Reluctantly, Zone agreed to these terms, once again evading his fate.\n> \n> His first mission-- and his currently ongoing mission, was simple. A young boy had invented a device which has transcended Hex-Tech in every way, and has become a thorn in their side as this boy refuses to cooperate with a form of partnership. His invention has not only directly impacted sales, but also turned customers back to Hex-Tech with anger, as their devices have been rendered faulty against his own design. Back in the day, the Zaunite officials would be able to take care of some thug boy running amok the streets without batting an eye, but Hex-Tech believes the authorities have gotten too soft, and have decided to take it into his own hands. While at first Zone resisted the demand, he was gravely reminded of how easily he could be put right back in jail-- or to his grave.\n\nhttp://2.bp.blogspot.com/-mELauXLseGQ/UuwIlmo7ZAI/AAAAAAAABC4/ThiNybzMSgY/s1600/Trenner_gears_wei%25C3%259F.png\n\n#**Quotes**\n\n**Upon Selection**\n_\"A man's gotta do... what a man's gotta do.\"_\n\n**Moving**\n_\"Affirmative.\"_\n_\"Over and out.\"_\n_\"Copy that.\"_\n_\"Transmission received.\"_\n_\"On schedule.\"_\n_\"Getting in position.\"_\n_\"I'm not one for chance; I like my results defined.\"_\n\n**Attacking**\n\n_\"Taking the shot.\"_\n_\"Executing orders.\"_\n_\"It's a dirty job.\"_\n_\"Don't worry, it'll be over soon.\"_\n_\"As long as I'm getting paid...\"_\n_\"I seeeeee youuu...\"_\n\n**Joke**\n\n*Hums to the Iron Man song*\n_\"Wish this suit had some air conditioning... whew..\"_\n_\"I'm... in the zone.... What? I thought it was good.\"_  (**Courtesy of [Sir ArmaMalum](http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/Z3y6AE0Z-ccos-may-entries-here-also-some-important-news?comment=00120000)**)\n\n**Taunt**\n_\"I'll see you, before you see me.\"_\n_\"This won't hurt much. Promise.\"_\n\n**Interactions with {{champion:268}}**\n\n_\"I'm going to enjoy this.\"_\n_\"Your birthrite will fit nicely in my paycheck.\"_\n_\"This time, I won't miss.\"_\n\n**Interactions with {{champion:245}}**\n\n_\"I don't like killing kids, but if it pays, I'll do what I need to do.\"_\n_\"Ekko, huh? Sorry about this.\"_\n_\"You're a good lad, but it's me or you, and I've got no intention of biting the dust anytime soon.\"_\n\n**Interactions with {{champion:34}}**\n\n_\"Eugh, birds.\"_\n\n**Interactions with {{champion:101}}**\n\n_\"The enemy of my enemy is my friend, I guess.\"_\n\n----\n----\n\nAs always folks, feedback and criticism is all very much appreciated!","replies":[{"poster":"sneezing slug","date":"2016-06-03T00:27:59.968+0000","up_votes":2,"down_votes":0,"body":"Also can I just say that it is very, very questionable how immediately after saying that I do not appreciate someone's rude feedback, my concept goes from 9 upvotes to none-- something that indeed makes me question what is at work here.\n\nThat, or by happenstance, 9 people actually downvoted this.","replies":[{"poster":"DesolationKaizer","date":"2016-06-03T13:25:59.798+0000","up_votes":2,"down_votes":0,"body":"Yeah, for a while this had like 4 upvotes or whatever, then suddenly it dropped.","replies":[{"poster":"sneezing slug","date":"2016-06-03T16:47:19.067+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Qzhnbnb,realm=NA,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=00190000,timestamp=2016-06-03T13:25:59.798+0000)\n>\n> Yeah, for a while this had like 4 upvotes or whatever, then suddenly it dropped.\n\nMhm, something is definitely up.","replies":[{"poster":"Vorazun","date":"2016-06-03T17:32:01.509+0000","up_votes":4,"down_votes":1,"body":"I would just like to establish that while Regonas says that there are phantom downvoters run by some secret head of something, his posts are always upvotes no matter their content, and his critics downvoted by the same amount. Now...I'm not doing any finger-pointing but...that's some correlation, no?","replies":[{"poster":"sneezing slug","date":"2016-06-03T17:37:49.446+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Vorazun,realm=OCE,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=0019000000000000,timestamp=2016-06-03T17:32:01.509+0000)\n>\n> I would just like to establish that while Regonas says that there are phantom downvoters run by some secret head of something, his posts are always upvotes no matter their content, and his critics downvoted by the same amount. Now...I&#x27;m not doing any finger-pointing but...that&#x27;s some correlation, no?\n\nNow that you say it, I have noticed this too.  That is quite peculiar.","replies":[{"poster":"regonas","date":"2016-06-04T13:30:12.130+0000","up_votes":1,"down_votes":5,"body":"Yes, http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/Z3y6AE0Z-ccos-may-entries-here-also-some-important-news?comment=0020 numbers of downvotes and upvotes speak for themselves.","replies":[{"poster":"Lonely Flame","date":"2016-06-04T14:39:21.815+0000","up_votes":4,"down_votes":0,"body":"They really do. You were being antagonistic. People don't tolerate it. They downvoted you.","replies":[]},{"poster":"Bobo113","date":"2016-06-04T19:18:28.760+0000","up_votes":3,"down_votes":1,"body":"That awkward moment when you don't have enough accounts or a big enough voting pose to dig yourself out of downvote hell.","replies":[{"poster":"regonas","date":"2016-06-04T19:37:43.075+0000","up_votes":1,"down_votes":4,"body":"That awkward moment, when yo have 1 account, while other guy have more than 5, yet after being downvoted, you are getting called downvoter. Truly awkward.\n\nEdit: well well, so whose alt is this?","replies":[{"poster":"Bobo113","date":"2016-06-05T04:41:47.965+0000","up_votes":4,"down_votes":1,"body":"I don't have any other accounts - I just see bullying, and act upon it. My only other account is for the PBE. You'd better get a big-ass ladder - downvote hell is deeper than you think.","replies":[]}]}]}]}]},{"poster":"Bobo113","date":"2016-06-04T17:35:26.641+0000","up_votes":2,"down_votes":0,"body":"He has frequently commented on my creations too, and he usually has other people follow him to downvote, or has multiple accounts at his disposal. I'm glad I'm not the only person to notice this. . .","replies":[]}]},{"poster":"Bobo113","date":"2016-06-04T14:40:47.266+0000","up_votes":2,"down_votes":0,"body":"Happens to all of mine. It's just the nature of the boards. . .","replies":[]}]}]}]},{"poster":"regonas","date":"2016-05-30T10:27:25.647+0000","up_votes":4,"down_votes":5,"body":"#CCOS review\n\nFirst off, with your thread design style, you make it very hard for people to quote your concept, thus making it frustrating to comment on it.\n\n> **Zone**&amp;#039;s basic attacks fire extremely fast rounds, instantly striking the target. Additionally, the shots pierce targets, extending 250 units past the unit hit or until it hits another target, dealing physical damage equal to 50% of **Zone**&amp;#039;s attack damage. If a single basic attack kills two units, Zone gains 100% more gold from both kills.\n\nAmm, no? What is this? Is this like Kayle's E, when there is no projectile, just damage? Does his basic attacks go through Windwall and similar effects? How does that work. You need to specify how or why it works like that. This is simply confusing.\nNow, double gold is, how do i put it, INSANE. Activate ability with long or average cooldown - maybe. Passive with no cooldown - COMPLETELY INSANE. I get that you need to get in the right position, carefully aim and so one, but, mate, this is simply broken. New and not very skilled people would struggle with aligning, but skilled people would easily make double gold from nearly all creeps. This champions would be banned more than Zed in higher tier. Double gold, are you serious? Nope, no, never, nah, ninada, niet, spanish for no, italian for no, nih, nat, no no no.\nEnemy could farm up about 200 creeps with 4200 gold and buy {{item:3031}} + {{item:1001}}, while you with 200 creeps could be carrying this: {{item:3031}} + {{item:3094}} + {{item:3085}}. Not only this unfair, this is COMPLETELY INSANE.\n\n> Zone shoots out a linear shot from his railgun, dealing **75/95/115/135/155 (+60% AD) physical damage** to each enemy it passes through. If the shot hits a wall, it ricochets off, resetting the distance of the skillshot. The skillshot will bounce 3/3/4/4/5 times before fading. After the first bounce, the skillshot deals 60% less damage, but moves twice as fast.\n\nIn lane - meh. In jungle - from strong to OH GOD THE BOUNCES. Nothing much here. Seen many better bounce ideas suggested, done many of them myself. This is pretty average, nothing much. Also, it deals pretty low damage, but if deals even less damage after first bounce, it will deal very low damage. Only real reason to even look at this ability is to use it in jungle. In the lane, this deal nearly no damage, especially after first bounce. Not really sure what you wanted to do with this.\nIf you wanted to add bouncing from wall aspect, then you failed. Outside of jungle and very special builds, this ability would be ranked the last, because it doesn't do anything significant (outside of those certain built paths).\n\n> After 1.5 seconds, Zone activates the active camouflage on his hex-suit, stealthing for 1.5 seconds and teleporting to a nearby area, dealing **40/60/80/100/120 (+100% AP) magic damage** to enemies nearby his original location and silencing them for 1 second.\n> \n> If **Zone** basic attacks, uses an ability, or is revealed while in stealth, he gains +20%/+25%/+30%/+35%/+40% movement speed and +25%/+35%/+45%/+55%/+65% attack speed for 2 seconds.\n\nWhat is this? So you stand still for 1.5 sec, then turn invisible, then you teleport somewhere? This is a mess. You need to sort it out. This is simply too random, chaotic and (i want to say dumb) uncertain.\nCan you move during those 1.5 sec?\nDo you teleport after or before you become invisible?\nHow do you chose area to teleport?\nWhich part can be or can't be interrupted?\nWhen does stealth start?\nIs it ground targetable or what?\nAre you sure about the silence? Riot is removing nearly all silences from the game.\n\nYou need to \"beautify\" this ability and make it more clear.\n\n> Passive: **Zone**&#x27;s basic attacks have +15%/+20%/+25%/+30%/+35% attack range against stationary non-turret targets.\n> \n> **Zone** throws a scout drone at the target area, landing after a 1 second delay. It reveals the area for 5 seconds, as well as revealing stealth traps, wards and champions. After a 2 second delay, Zone marks everyone still within the scanning range, autoattacking each one of them from wherever Zone currently is three times in a row each within the duration of 1.5 seconds.\n\nSorry, but passive is just dumb. How will game recognize against which enemies you gain bonus range, when you gain bonus range? Enemy stopped to perform a basic attack, will you gain bonus range? Enemy started moving when you target him/her, will you get bonus range? Ally knocked enemy, will you lose bonus range? Endless frustration right here, because only 100% to be sure that enemy is not moving is through a stun or a root, but you don't have any of those. In other words - just don't, remove it.\nActive is equally bad. Revealing and scanning are normal, but you went INSANE again. You can be more than 800 units away and still hit ALL enemies in the radius 3 times. What?? Not only early you can have double gold, but now you can destroy enemies from any place you see fit?\nTake {{champion:25}} as support + throw this on top of the enemies = get kills from anywhere. Seriously? 3 auto attack to EVERYONE within radius? Lets say each AA deals around 800 damage (crits included), so if you scan 3 enemies, then damage will be 3x3x800=7200. Not that much, if you are COMPLETELY INSANE.\nYes, you need to hold enemies in the certain area. Yes, it have delays and what not. But even if a single enemy get \"scanned\", he/she will get his face ripped off, and that could happen from the other side of the map, because 3 AA happens from any place. Ohh, and those AA also triggers passive, so....\n \n> **Zone** charges up his railgun for a high-energy attack, channeling for 2.5 seconds, then launching a hex-rocket in a target direction. **Zone** may reactivate this ability any amount of times during the duration of the ability to redirect the direction of the rocket, causing it to turn and move towards that direction, which takes a full 1 second to make the turn if it&#x27;s in a completely different direction, but no time at all to shift slightly in a different direction.\n> \n> After 10 seconds or upon the rocket hitting an enemy champion, the rocket explodes, dealing **125/225/325 (+125% AD)** physical damage to that champion and surrounding units in an area, and dealing an additional **5% (+50% AP) magic damage** for each second the rocket was in air.\n\nMeh. Scalings are broken, but ability is functional, practical, doesn't fir ADC though. This works much better for Mid or.... Nope, doesn't know where it works. Channeling takes too long for ADC to use it properly, you don't have any reliable slows or CC to keep enemy in the same place to use this ability. Others ADC with this type of abilities have something to compensate for the long channeling time:\n{{champion:202}} can root, can put traps to reveal enemies, his R can take your all health, his attacks reveal enemies and slow them;\n{{champion:51}} tracks your location and acts as a homing missile;\n{{champion:21}} deals massive damage in a cone.\nYours is practically a sitting duck, waiting to be killed, while you miss your R.\n\n**OVERALL.** Your design is, well, you see, bad. Things range from broken to INSANE. Passive bizarre and brokenly good - go top, farm a ton, gain much gold, destroy anyone = win the game. Q range from minion attack power to pretty strong, but only in jungle. W is just strange pile of text. E is broken in every aspect. R is meh version of {{champion:222}}'s R.\nHaven't read the lore, because this is not a game aspect and creative story can't be simply be judged as good or bad.","replies":[{"poster":"sneezing slug","date":"2016-05-31T04:55:13.737+0000","up_votes":3,"down_votes":3,"body":"> First off, with your thread design style, you make it very hard for people to quote your concept, thus making it frustrating to comment on it.\n\nIt's meant to look easy to read and organized, so everything isn't in a clump of borderless/unformated mumbo jumbo.\n\n> Amm, no? What is this? Is this like Kayle&#x27;s E, when there is no projectile, just damage? Does his basic attacks go through Windwall and similar effects? How does that work. You need to specify how or why it works like that. This is simply confusing.\n\nIt's not that hard to understand? It just means that his attacks have zero travel time. And yes, they would be stopped by Windwall.\n\n> Now, double gold is, how do i put it, INSANE. Activate ability with long or average cooldown - maybe. Passive with no cooldown - COMPLETELY INSANE. I get that you need to get in the right position, carefully aim and so one, but, mate, this is simply broken. New and not very skilled people would struggle with aligning, but skilled people would easily make double gold from nearly all creeps. This champions would be banned more than Zed in higher tier. Double gold, are you serious? Nope, no, never, nah, ninada, niet, spanish for no, italian for no, nih, nat, no no no.\n> Enemy could farm up about 200 creeps with 4200 gold and buy {{item:3031}} + {{item:1001}}, while you with 200 creeps could be carrying this: {{item:3031}} + {{item:3094}} + {{item:3085}}. Not only this unfair, this is COMPLETELY INSANE.\n\nDouble gold is insane, but also understand how frustrating and painful it is to actually land this. This is insanely rare to land, and incredibly hard to time. It's not something you'll be getting constantly, especially since none of his abilities have the power to perfectly position minions. Even a skilled person will find it hard, because landing one cs is hard enough, imagine trying to land two, one of which is taking much less damage. It's very hard to land, not insane.\n\n> In lane - meh. In jungle - from strong to OH GOD THE BOUNCES. Nothing much here. Seen many better bounce ideas suggested, done many of them myself. This is pretty average, nothing much. Also, it deals pretty low damage, but if deals even less damage after first bounce, it will deal very low damage. Only real reason to even look at this ability is to use it in jungle. In the lane, this deal nearly no damage, especially after first bounce. Not really sure what you wanted to do with this.\n> If you wanted to add bouncing from wall aspect, then you failed. Outside of jungle and very special builds, this ability would be ranked the last, because it doesn&#x27;t do anything significant (outside of those certain built paths).\n\nIt's not meant to deal large amounts of damage after the first bounce, it's supposed to land hits from afar, and be used to bank shot off walls to land at least a little bit of damage to your enemy. If you manage to land all of the bounces AND the main shot, bravo, but other than that, it's for bank shots and damage.\n\n> Can you move during those 1.5 sec?\n\nIt isn't a channel, so yes. It does not say that is a channel, as a channel would imply he cannot move.\n\n> Do you teleport after or before you become invisible?\n\nSimilar to Shaco's Q, you teleport and become invisible \n\n> How do you chose area to teleport?\n\nBy activating the ability and selecting an area?\n\n> Which part can be or can&#x27;t be interrupted?\n\nIf you get stunned/snared/immobilized before the teleport??\n\n> When does stealth start?\n\nSame as the other question, you become stealthed as soon as you teleport, causing them to not know your location, again, similar to Shaco's Q\n\n> Is it ground targetable or what?\n\nUh? What? What do you mean by this?\n\n> Are you sure about the silence? Riot is removing nearly all silences from the game.\n\nIf they were removing all silences, then explain why Malzahar still has his silence on his Q after a major rework update just recently? That doesn't add up.\n\n> Sorry, but passive is just dumb. How will game recognize against which enemies you gain bonus range, when you gain bonus range? Enemy stopped to perform a basic attack, will you gain bonus range? Enemy started moving when you target him/her, will you get bonus range? Ally knocked enemy, will you lose bonus range? Endless frustration right here, because only 100% to be sure that enemy is not moving is through a stun or a root, but you don&#x27;t have any of those. In other words - just don&#x27;t, remove it.\n\nThey would be marked with a small little thing above their forehead that you could see if they're in range of this bonus. If they are moving in any way shape or form, you cannot hit them. It's simple.\n\n> Active is equally bad. Revealing and scanning are normal, but you went INSANE again. You can be more than 800 units away and still hit ALL enemies in the radius 3 times. What?? Not only early you can have double gold, but now you can destroy enemies from any place you see fit?\n\nDo you realize how much of a delay there is before this goes off? You'd have to be CC'd/insanely oblivious to get hit by it, or walking into it from a bush. You're considering the perfect case scenario, which, for any champion, is going to deal a lot of damage. \n\n> Take {{champion:25}} as support + throw this on top of the enemies = get kills from anywhere. Seriously? 3 auto attack to EVERYONE within radius? Lets say each AA deals around 800 damage (crits included), so if you scan 3 enemies, then damage will be 3x3x800=7200. Not that much, if you are COMPLETELY INSANE.\n\nIt wont deal 7200 damage to each target, you're doing your math wrong. It's one person takes 3 auto attacks (ADx3, that simple) after a LONG LONG LONG delay.\n\n> Meh. Scalings are broken, but ability is functional, practical, doesn&#x27;t fir ADC though. This works much better for Mid or.... Nope, doesn&#x27;t know where it works. Channeling takes too long for ADC to use it properly, you don&#x27;t have any reliable slows or CC to keep enemy in the same place to use this ability. Others ADC with this type of abilities have something to compensate for the long channeling time:\n\nYou. You do realize that it's redirectable, right?\n\nThat's why you know, kinda have to channel it. It's a trade off.\n\n> **OVERALL.** Your design is, well, you see, bad. Things range from broken to INSANE. Passive bizarre and brokenly good - go top, farm a ton, gain much gold, destroy anyone = win the game. Q range from minion attack power to pretty strong, but only in jungle. W is just strange pile of text. E is broken in every aspect. R is meh version of {{champion:222}}&#x27;s R.\n> Haven&#x27;t read the lore, because this is not a game aspect and creative story can&#x27;t be simply be judged as good or bad.\n\nOkay.\n\nI am trying to be as civil as possible here, because I understand that constructive criticism is a thing, but what you are giving me, is by no means constructive criticism. Instead, you have blatantly insulted my concept, told me to remove this and remove that, however suggested zero ways to improve it. You have not provided any means to make this a better concept. I spent time reviewing yours, told you what was wrong with it, and gave you ample ways to improve upon it-- you barge in, trash my concept and insult my concept, and through that insulting me. This is _**not**_ constructive criticism.\n\nNot to mention you keep referring to every part of my concept to be blatantly overpowered ***in the perfect, christmas miracle circumstance that everything is lined up, your opponents are, for some reason, standing still, and are not thinking whatsoever.***\n\nThe only thing I can respect about your reply is that you took the time to make a lengthy paragraph reply, but even that is hardly respectable considering you've absolutely suggested nothing beyond removals and insulted this entire concept.","replies":[{"poster":"Vanic998","date":"2016-06-03T01:46:21.514+0000","up_votes":1,"down_votes":3,"body":"He's the Simon Cowell of lol so that makes him fine.","replies":[{"poster":"Lonely Flame","date":"2016-06-03T07:38:02.277+0000","up_votes":3,"down_votes":2,"body":"Rego isn't the 'Simon Cowell' of League. He just spams the forums a lot. Sure every now and then an idea of his is alright, but he's more of a Kanye West. He's not actually talented, but his ego is so big he **thinks** he is.\n\nI can't even count the amount of times one of Rego's concept threads has derailed into an argument because he insults the people that tell him something is overpower or doesn't seem good. If you were to make comments like he has made on this thread in one of his, he would know doubt say that it is a 'good joke' and he got many laughs from it.\n\nHe hasn't given **constructive** feedback. As Metal has pointed out, he's given almost no suggestions as to improvements. Chances are the only reason Rego commented on this thread at all was to get bonus marks for his champion concept in the competition (hence the giant, bolded \"CCOS review\" at the start of his comment). I honestly don't think I've ever seen him not belittle someones concept. He basically just insults the competition.","replies":[{"poster":"Bobo113","date":"2016-06-05T16:17:25.904+0000","up_votes":3,"down_votes":0,"body":"^Truth.","replies":[]},{"poster":"sneezing slug","date":"2016-06-03T16:45:34.975+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lonely Flame,realm=OCE,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=0017000000010001,timestamp=2016-06-03T07:38:02.277+0000)\n>\n> Rego isn&#x27;t the &#x27;Simon Cowell&#x27; of League. He just spams the forums a lot. Sure every now and then an idea of his is alright, but he&#x27;s more of a Kanye West. He&#x27;s not actually talented, but his ego is so big he **thinks** he is.\n> \n> I can&#x27;t even count the amount of times one of Rego&#x27;s concept threads has derailed into an argument because he insults the people that tell him something is overpower or doesn&#x27;t seem good. If you were to make comments like he has made on this thread in one of his, he would know doubt say that it is a &#x27;good joke&#x27; and he got many laughs from it.\n> \n> He hasn&#x27;t given **constructive** feedback. As Metal has pointed out, he&#x27;s given almost no suggestions as to improvements. Chances are the only reason Rego commented on this thread at all was to get bonus marks for his champion concept in the competition (hence the giant, bolded &quot;CCOS review&quot; at the start of his comment). I honestly don&#x27;t think I&#x27;ve ever seen him not belittle someones concept. He basically just insults the competition.\n\nReally? That's kind of disappointing to think about actually.","replies":[]}]},{"poster":"sneezing slug","date":"2016-06-03T01:58:14.858+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Vanic998,realm=NA,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=001700000001,timestamp=2016-06-03T01:46:21.514+0000)\n>\n> He&#x27;s the Simon Cowell of lol so that makes him fine.\n\nNo, that's Echoing, but he actually gives suggestions on how to improve something.","replies":[{"poster":"Vanic998","date":"2016-06-03T02:19:27.043+0000","up_votes":1,"down_votes":0,"body":"Is echoing another famous judge? If not, then I don't know what you mean by \"its echoing.\"","replies":[{"poster":"sneezing slug","date":"2016-06-03T04:29:56.142+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Vanic998,realm=NA,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=00170000000100000000,timestamp=2016-06-03T02:19:27.043+0000)\n>\n> Is echoing another famous judge? If not, then I don&#x27;t know what you mean by &quot;its echoing.&quot;\n\nEchoing is a Judge, yes.","replies":[]}]}]}]},{"poster":"regonas","date":"2016-05-31T14:49:18.563+0000","up_votes":4,"down_votes":3,"body":"> [{quoted}](name=Metal Gear Roses,realm=NA,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=00170000,timestamp=2016-05-31T04:55:13.737+0000)\n>\n> I am trying to be as civil as possible here, because I understand that constructive criticism is a thing, but what you are giving me, is by no means constructive criticism. Instead, you have blatantly insulted my concept, told me to remove this and remove that, however suggested zero ways to improve it. You have not provided any means to make this a better concept. I spent time reviewing yours, told you what was wrong with it, and gave you ample ways to improve upon it-- you barge in, trash my concept and insult my concept, and through that insulting me. This is _**not**_ constructive criticism.\n\nNope. I gave you perfectly good review on what is wrong on your concept. If i focus on negative aspects of your concept, that is still constructive criticism. You are free to ignore, but i don't believe those major flaws will slide easily. I revealed flaws in your concept, but if you see them as \"insults\", then it is your problem.","replies":[]}]}]},{"poster":"Daen","date":"2016-05-15T17:53:50.124+0000","up_votes":3,"down_votes":0,"body":"Hey, I wanted to give you some feedback on your design. :)\n\n>Passive: Hex-Tech Piercing Rounds\n>\n>Zone's basic attacks fire extremely fast rounds, instantly striking the target. Additionally, the shots pierce targets, extending 250 units past the unit hit or until it hits another target, dealing physical damage equal to 50% of Zone's attack damage. If a single basic attack kills two units, Zone gains 100% more gold from both kills.\n\nThis passive, while thematically accurate, brings up two questions in my mind:\n\n1) Could this passive potentially be frustrating for the enemy due to low interactivity?\n2) Does this passive help guide the playstyle of the champion?\n\n> Q: Rubberized Shells\n>\n>Zone shoots out a linear shot from his railgun, dealing 75/95/115/135/155 (+60% AD) physical damage to each enemy it passes through. If the shot hits a wall, it ricochets off, resetting the distance of the skillshot. The skillshot will bounce 3/4/5/6/7 times before fading. After the first bounce, the skillshot deals 60% less damage, but moves twice as fast.\n\nI very much like the idea of a bouncing skillshot, because there is a relatively high skill ceiling on geometric ability design.  That being said, I do wonder if 7 bounces could feel oppressive.  If we take into account the ability has 750 range, this extends to 5,250 if taken to the logical extreme.  With the right trajectories in place this skillshot could be bounced all the way from an outer turret to an inhibitor or around the entire inside of the enemy jungle, which could actually *lower* the skill required due to ease of use.\n\n>W: Cognitive Dysfunction\n>\n>After 1.5 seconds, Zone activates the active camouflage on his hex-suit, stealthing for 1.5 seconds and teleporting to a nearby area, dealing 40/60/80/100/120 (+100% AP) magic damage to enemies nearby his original location and silencing them for 1 second.\n\nIs the 1.5 second period a channel time, or similar to Twitch's stealth where you click the button and can still move around while the stealth comes into effect?  Would the effect be telegraphed during that 1.5 seconds, and would the target location be shown to allies/the enemy?\n\n>If Zone basic attacks, uses an ability, or is revealed while in stealth, he gains +20%/+25%/+30%/+35%/+40% movement speed and +25%/+35%/+45%/+55%/+65% attack speed for 2 seconds.\n\nWhat is the gameplay reason for this aspect of the design, specifically?  What does the champion gain from the large MS/AS steroid, and could a different effect offer the same benefits in a more unique way?\n\n>E: Hexdrone\n>\n>Passive: Zone's basic attacks have +15%/+20%/+25%/+30%/+35% attack range against stationary non-turret targets.\n\n1) Is it possible this passive could be relatively useless for the most part during play, especially high level?  While his targets are under the effect of hard crowd control he'd gain this effect, but he doesn't have any hard CC in his kit and people move around most of the time when able.  Minions would be an exception here, but even they move a decent amount.\n2) Could it be frustrating to both Zone and his enemies that his attack range would be constantly changing during a fight?\n\n>Zone throws a scout drone at the target area, landing after a 1 second delay. It reveals the area for 5 seconds, as well as revealing stealth traps, wards and champions. After a 2 second delay, Zone marks everyone still within the scanning range, autoattacking each one of them from wherever Zone currently is three times in a row each within the duration of 1.5 seconds.\n\n1) Would these autoattacks have a leash range, and would they interrupt whatever else Zone is doing?\n2) By three times in a row each are you saying that every target still in the scanning range would be hit by three autoattacks each?\n3) What happens if he tosses the scout drone then leaves lane or recalls to base with Baron buff?  Would he still be able to autoattack targets still in range from that far away?\n\n>R: .256 Caliber Hex-Tech Scorpio Harpoon mk-7\n>\n>Zone charges up his railgun for a high-energy attack, channeling for 2.5 seconds, then launching a hex-rocket in a target direction. Zone may reactivate this ability any amount of times during the duration of the ability to redirect the direction of the rocket, causing it to turn and move towards that direction, which takes a full 1 second to make the turn if it's in a completely different direction, but no time at all to shift slightly in a different direction.\n\nTo me, this ability sort of feels like a Jinx ult that has been tampered with rather than a fully unique champion ability.  Do you feel the abilities are different enough to be signature moves for these two wildly disparate champions?","replies":[]},{"poster":"DesolationKaizer","date":"2016-05-25T19:13:59.330+0000","up_votes":2,"down_votes":0,"body":"##CCOS Review\n\nFirst and foremost, I like his aesthetic of a high-tech marksman.  His lore for me is a bit iffy.  How does a young boy manage to wound an Ascended Being?  I somehow doubt that's possible.  Question though, is he still a boy, or is he grown up now.  The lore isn't anything spectacular for me personally, but it works aside from that wounding Azir bit.\n\nNow onto the nitty gritty.\n\nPassive-  So these do not have a travel time I'm assuming.  I could see his auto attacks being extremely frightening, but this is a neat idea.  Though RIP Windwall.  The gold generation feels like it might be possibly a bit too high.  I feel like 50% extra gold would be more suitable, but I might be nitpicking.  The extended range if another target is behind is interesting and can definitely make him a dangerous teamfighter, especially in confined areas.\n\nQ- A wall bouncing skillshot? Sounds pretty neat.  I like that even though the damage gets lower, it becomes significantly faster from the ricocheting.  The initial speed of 500 might be a bit slow.  For reference, I think Ezreal's Mystic Shot has a missile speed of about 1600 or so.  I could be wrong.  Maybe bump it up to 750?  Otherwise it might be hard to hit anything?  Though it might be fine with the ricocheting speed.\n\nW-  This might be a bit too strong.  It grants him stealth, allows him to teleport and then inflict a silence on any enemy within the target area.  The stealth and teleportation are fine, but combined with the silence, it's a bit too much.  I'd ditch the silence for another form of crowd control.  Also, the movement speed boost might be a tad bit high.  Maybe lower each level by 1/4.\n\nE- The passive might actually be kind of scary.  His poke range with it and his actual passive could be pretty fearsome if some is standing behind a minion.  But then again, they have to be standing still.  Which doesn't happen all that often in lane.  The active is pretty interesting, kind of like a multi-target Shaco box.  I like the reveal part as well, though this a deceptively powerful ability.\n\nR- This is really cool. A skillshot that can have its direction changed in a limited capacity.  Would make for some very interesting plays.  Also, I like that you have to choose whether or not you want to damage someone immediately, or wait for a bigger payoff.  Then you have to remember that you don't have infinite time.  Overall, I have nothing but good things to say about this.\n\nOverall, I really like this kit.  A couple of slight balance issues in my opinion, but it has a lot of flavor, is pretty cohesive, and fits his thematics.  Great work and I hope to see more of your designs in the future.\n\nAlso, if you aren't too busy, mind checking out my concept?\n\n[Eiron, Conviction's Arcane Edge](http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/PysI6GoM-eiron-convictions-arcane-edge)","replies":[{"poster":"sneezing slug","date":"2016-05-26T17:01:52.194+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Qzhnbnb,realm=NA,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=0013,timestamp=2016-05-25T19:13:59.330+0000)\n>\n> ##CCOS Review\n> \n> First and foremost, I like his aesthetic of a high-tech marksman.  His lore for me is a bit iffy.  How does a young boy manage to wound an Ascended Being?  I somehow doubt that&#x27;s possible.  Question though, is he still a boy, or is he grown up now.  The lore isn&#x27;t anything spectacular for me personally, but it works aside from that wounding Azir bit.\n\nFrom the Q&A with the new Shurima lore, it was implied that an Ascended being could be injured and even killed, Ascended just means that they will not grow old and die and have immense power, they could still be injured/killed.\n\n> Now onto the nitty gritty.\n> \n> Passive-  So these do not have a travel time I&#x27;m assuming.  I could see his auto attacks being extremely frightening, but this is a neat idea.  Though RIP Windwall.  The gold generation feels like it might be possibly a bit too high.  I feel like 50% extra gold would be more suitable, but I might be nitpicking.  The extended range if another target is behind is interesting and can definitely make him a dangerous teamfighter, especially in confined areas.\n\nNo travel time, no. I feel like the gold gain is worth the actual positioning, since landing it would be hard.\n\n> Q- A wall bouncing skillshot? Sounds pretty neat.  I like that even though the damage gets lower, it becomes significantly faster from the ricocheting.  The initial speed of 500 might be a bit slow.  For reference, I think Ezreal&#x27;s Mystic Shot has a missile speed of about 1600 or so.  I could be wrong.  Maybe bump it up to 750?  Otherwise it might be hard to hit anything?  Though it might be fine with the ricocheting speed.\n\nWill fix speed.\n\n> W-  This might be a bit too strong.  It grants him stealth, allows him to teleport and then inflict a silence on any enemy within the target area.  The stealth and teleportation are fine, but combined with the silence, it&#x27;s a bit too much.  I&#x27;d ditch the silence for another form of crowd control.  Also, the movement speed boost might be a tad bit high.  Maybe lower each level by 1/4.\n\nWill do.\n\n> E- The passive might actually be kind of scary.  His poke range with it and his actual passive could be pretty fearsome if some is standing behind a minion.  But then again, they have to be standing still.  Which doesn&#x27;t happen all that often in lane.  The active is pretty interesting, kind of like a multi-target Shaco box.  I like the reveal part as well, though this a deceptively powerful ability.\n\n\n> R- This is really cool. A skillshot that can have its direction changed in a limited capacity.  Would make for some very interesting plays.  Also, I like that you have to choose whether or not you want to damage someone immediately, or wait for a bigger payoff.  Then you have to remember that you don&#x27;t have infinite time.  Overall, I have nothing but good things to say about this.\n\nThanks!\n\n> Overall, I really like this kit.  A couple of slight balance issues in my opinion, but it has a lot of flavor, is pretty cohesive, and fits his thematics.  Great work and I hope to see more of your designs in the future.\n\nAgain, thank you so much, really appreciated.\n\n> Also, if you aren&#x27;t too busy, mind checking out my concept?\n> \n> [Eiron, Conviction&#x27;s Arcane Edge](http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/PysI6GoM-eiron-convictions-arcane-edge)\n\nWill do! Thanks.","replies":[]}]},{"poster":"Riot Lutzburg","date":"2016-05-25T17:51:56.346+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Metal Gear Roses,realm=NA,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=,timestamp=2016-05-13T16:59:27.085+0000)\n>\n> \"Taking the shot.\"\n\nhttp://i199.photobucket.com/albums/aa126/GC_rokz/Randomness/IamWindextor.jpg","replies":[{"poster":"sneezing slug","date":"2016-05-26T17:07:51.250+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lutzburg,realm=NA,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=0012,timestamp=2016-05-25T17:51:56.346+0000)\n>\n> http://i199.photobucket.com/albums/aa126/GC_rokz/Randomness/IamWindextor.jpg\n\n:^)","replies":[]}]},{"poster":"sneezing slug","date":"2016-05-15T08:34:48.853+0000","up_votes":2,"down_votes":0,"body":"*goes through blood, sweat and tears trying to make this concept*\n\n*no replies*\n\nhttps://66.media.tumblr.com/cb9391a7a4ce597ede9d87c7ae320b4c/tumblr_inline_o751lkCC1G1s63289_500.gif\n\n{{item:3070}}{{item:3070}}{{item:3070}} \n{{item:3070}}{{item:3073}}{{item:3070}}\n{{item:3070}}{{item:3070}}{{item:3070}}","replies":[{"poster":"Raxistaicho","date":"2016-05-25T01:20:24.789+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Metal Gear Roses,realm=NA,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=0005,timestamp=2016-05-15T08:34:48.853+0000)\n>\n> *goes through blood, sweat and tears trying to make this concept*\n> \n> *no replies*\n> \n> https://66.media.tumblr.com/cb9391a7a4ce597ede9d87c7ae320b4c/tumblr_inline_o751lkCC1G1s63289_500.gif\n> \n> {{item:3070}}{{item:3070}}{{item:3070}} \n> {{item:3070}}{{item:3073}}{{item:3070}}\n> {{item:3070}}{{item:3070}}{{item:3070}}\n\nHeheh, I know that feeling.","replies":[{"poster":"DesolationKaizer","date":"2016-05-25T04:01:11.397+0000","up_votes":2,"down_votes":0,"body":"Lmao right? One time I had a concept go for like one month with no responses.","replies":[]},{"poster":"sneezing slug","date":"2016-05-25T03:47:42.776+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Raxistaicho,realm=NA,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=00050000,timestamp=2016-05-25T01:20:24.789+0000)\n>\n> Heheh, I know that feeling.\n\nRip in pepperoni","replies":[]}]}]},{"poster":"sneezing slug","date":"2016-05-15T10:43:04.369+0000","up_votes":2,"down_votes":0,"body":"tfw someone downvotes but doesn't give feedback\n\nhttp://previews.123rf.com/images/joebelanger/joebelanger0905/joebelanger090500034/4864121-A-mother-gets-ready-to-swing-her-frying-pan-in-anger--Stock-Photo.jpg","replies":[]},{"poster":"CJ Entus Apdo","date":"2016-05-15T08:36:53.052+0000","up_votes":2,"down_votes":0,"body":"It seems to be great. {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"sneezing slug","date":"2016-05-14T01:30:37.765+0000","up_votes":2,"down_votes":0,"body":"fucking hell, I had this all typed out and google chrome decided to crash on me\n\nI'll work on this later, but right now I'm just frustrated that literally 6 pages worth of stuff just got deleted.","replies":[]},{"poster":"Big Bad Minion","date":"2016-05-31T15:58:26.538+0000","up_votes":2,"down_votes":1,"body":"Bad things and way you can improve them:\n1) Passive is too RNG. You can't control minion movement, you can't do anything about it. Either you will get tons or gold or you get no gold, as you will be pushing your lane either you want it or not. Also, instant AA is bad for ADC, because that makes certain champions not viable to play against you, when they are designed to play against ADC. I would Remove penetration, make bonus gold similar like Gangplank's, but with very lower bonus gold and make his AA into projectiles.\n2) Q is worthless. It doesn't do damage, and lets face it, bouncing ins't gonna work as a good thing. There is no reason to this champion to have this ability and there is no reason for anyone to use it. Simple AA does more damage than this ability. I would increase damage and range, while removing absurd bouncing mechanics.\n3) W is bad in everything. It is have casting time, so you either target area, move around and then teleport, or stand still, take damage and then teleport. Now teleport+stealth+silence+absurd AP scaling+absurd buffs. There is no way to redesign this into anything. I would just remove it completely and change into something else.\n4) E is too situational. It either worth nothing as enemies move outside of your E or they get hit by 3 instant AA from ADC. Early game this looks like completely useless ability, while late game this pretty much wins you any fight, because enemies will be forced to retreat or they will get killed. I would recommend removing 3 AA completely from this ability and instead make it to deal magic damage with AP scaling.\n5) R is boring and unpractical. Not only you don't know where are you firing, but it takes tons of time to get ready to fire or  change directions. I would also redesign it completely.","replies":[{"poster":"sneezing slug","date":"2016-06-03T00:26:24.473+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Big Bad Minion,realm=NA,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=0018,timestamp=2016-05-31T15:58:26.538+0000)\n>\n> Bad things and way you can improve them:\n> 1) Passive is too RNG. You can&#x27;t control minion movement, you can&#x27;t do anything about it. Either you will get tons or gold or you get no gold, as you will be pushing your lane either you want it or not. Also, instant AA is bad for ADC, because that makes certain champions not viable to play against you, when they are designed to play against ADC. I would Remove penetration, make bonus gold similar like Gangplank&#x27;s, but with very lower bonus gold and make his AA into projectiles.\n> 2) Q is worthless. It doesn&#x27;t do damage, and lets face it, bouncing ins&#x27;t gonna work as a good thing. There is no reason to this champion to have this ability and there is no reason for anyone to use it. Simple AA does more damage than this ability. I would increase damage and range, while removing absurd bouncing mechanics.\n> 3) W is bad in everything. It is have casting time, so you either target area, move around and then teleport, or stand still, take damage and then teleport. Now teleport+stealth+silence+absurd AP scaling+absurd buffs. There is no way to redesign this into anything. I would just remove it completely and change into something else.\n> 4) E is too situational. It either worth nothing as enemies move outside of your E or they get hit by 3 instant AA from ADC. Early game this looks like completely useless ability, while late game this pretty much wins you any fight, because enemies will be forced to retreat or they will get killed. I would recommend removing 3 AA completely from this ability and instead make it to deal magic damage with AP scaling.\n> 5) R is boring and unpractical. Not only you don&#x27;t know where are you firing, but it takes tons of time to get ready to fire or  change directions. I would also redesign it completely.\n\nThe thing that baffles me the most is that this is the exact opposite of most the reviews I've gotten on this guy, and through that, I'm at an impasse on what to believe.\n\nIll take your word for it because you took the time to make a lengthy response and gave me a large sum of criticisms without saying \"this is stupid\" and moving on.\n\nDo you have any suggestions on what you would rework some of these abilities into? I'd prefer to keep the ult in it's framework as a controlled skillshot in some form.","replies":[{"poster":"Big Bad Minion","date":"2016-06-03T09:39:30.545+0000","up_votes":2,"down_votes":1,"body":"No idea. This is your concept, you decide.","replies":[{"poster":"sneezing slug","date":"2016-06-03T16:44:16.990+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Big Bad Minion,realm=NA,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=001800000000,timestamp=2016-06-03T09:39:30.545+0000)\n>\n> No idea. This is your concept, you decide.\n\nOkay! I was just curious, that's all. Thanks anyways!","replies":[]}]}]}]},{"poster":"Raxistaicho","date":"2016-05-25T04:23:13.591+0000","up_votes":2,"down_votes":1,"body":"Oh lordy lordy. I hate to say it, but I freely admit that this one should win first place on May's CCOS :O\n\nI just hope I get second :) Losing to this concept is a loss I can accept (last time I entered I lost to a knockoff of Galadriel from LOTR : I )\n\n>Stats\n\nFairly standard. He's seriously on the squishy side (15 base armor!) and low (450) range.\n\nHe shouldn't have 20 base magic resist and 1 growth, though. Ranged champs *always* have 30 base and 0 growth.\n\n>Skills\n\n*Passive*: He'd definitely require some practice csing, since you generally have to get used to a ranged champ's projectile speed. His passive is an interesting way to \"extend\" his attack range to harass enemies standing behind their minions without overdoing it. His squishy nature and low range would keep him from being overly abusive. The bonus gold could *easily* get to be too much, though.\n\n*Q*: 500 projectile speed is *incredibly* slow, you definitely wanna increase that. For comparison, Anivia's Q is the slowest-moving skillshot in the game and it still has a project speed of 850. Projectile's also very narrow. Base damage might actually be too high considering it has total AD scaling. If you check other champs, skills that have total AD scaling rather than bonus AD usually have lower base damage.\n\nThe bouncing mechanic is nifty but I honestly can't imagine many scenarios where that actually comes in handy outside the Baron and Dragon pits. Hitting anybody more than once would require rather specific orientation next to a wall, kinda similar to Poppy's E. How far does the projectile travel in total before fizzling? \n\nCooldown and cost look fine.\n\n*W*: Can he move while preparing to cast this? I'm kinda uncertain on the delay. I kinda think the delay is actually too generous. It limits his ability to outplay and mind game enemies while escaping, and some assassins could kill him during the cast time. I'd hate dealing with this guy when I'm Irelia, though :p\n\n*E*: Not sure what to say about the passive. 35% increase is pretty big, but you shouldn't just be standing around in general in this game. Honestly I get confused if I ever an enemy just stand around in lane. \n\nE Active is a neat little trick. The delay's probably too long to ever catch anybody that isn't cc'ed, but the punishment for it is appropriate.\n\n*R*: Most ultimates cost 100 mana, just putting that out. I have to admit, I love this one XD it's so unique. What's the \"5%\" part of the bonus damage? Does that mean it deals up to 50% of the original damage but as magic damage? If the 50% AP part stacks up with duration as well, you might want to change something there, otherwise he deal 500% of his AP with this, lol. You might want to cut the duration a bit, though, I can easily see this being VERY annoying to keep dodging for an enemy you're trying to hit it with. Useless at point-blank, though, what with length channel to start it up.\n\n>Lore\n\nAzir, why you so evil? :U I don't think he's quite back to being the emperor of anybody just yet, as Taliyah's opinion of him kinda implies that the people still living in Shurima aren't just gonna accept his return and rule again so easily.\n\nI'm pretty sure Hextech is just a generic name for magically-infused technology in League's setting. It's definitely not Zaun-based, as plenty of Piltover champions make extensive use of Hextech.\n\n>General\n\nMy biggest concern is I think he'd struggle to actually work in any role. His range is too low and he's extremely squishy, so he'd have a difficult time functioning as an adc, and he doesn't have enough mobility or cc to survive in top lane. You should probably buff his stats a bit so he could work as an adc.\n\nOverall, you put a lot of work into this, nicely done :)","replies":[{"poster":"sneezing slug","date":"2016-05-26T16:57:49.021+0000","up_votes":1,"down_votes":0,"body":"> Oh lordy lordy. I hate to say it, but I freely admit that this one should win first place on May&#x27;s CCOS :O\n> \n> I just hope I get second :) Losing to this concept is a loss I can accept (last time I entered I lost to a knockoff of Galadriel from LOTR : I )\n\nThanks a bunch dude! C:\n\n> Fairly standard. He&#x27;s seriously on the squishy side (15 base armor!) and low (450) range.\n> \n> He shouldn&#x27;t have 20 base magic resist and 1 growth, though. Ranged champs *always* have 30 base and 0 growth.\n\nGot it, fixing the MR and I'll bump up the range ever so slightly to help with range.\n\n> *Passive*: He&#x27;d definitely require some practice csing, since you generally have to get used to a ranged champ&#x27;s projectile speed. His passive is an interesting way to &quot;extend&quot; his attack range to harass enemies standing behind their minions without overdoing it. His squishy nature and low range would keep him from being overly abusive. The bonus gold could *easily* get to be too much, though.\n\nI feel like the gold gain is fine as it would be really, REALLY hard to land a double cs/kill with his autoattacks, but if he did I feel like the reward should be worth it. The idea for Zone is all about positioning, or literally _zoning_ the enemy (I promise his name came before his kit was designed, pinky promise) \n\n> *Q*: 500 projectile speed is *incredibly* slow, you definitely wanna increase that. For comparison, Anivia&#x27;s Q is the slowest-moving skillshot in the game and it still has a project speed of 850. Projectile&#x27;s also very narrow. Base damage might actually be too high considering it has total AD scaling. If you check other champs, skills that have total AD scaling rather than bonus AD usually have lower base damage.\n\nOh golly, yeah I'll have to fix that.\n\n> The bouncing mechanic is nifty but I honestly can&#x27;t imagine many scenarios where that actually comes in handy outside the Baron and Dragon pits. Hitting anybody more than once would require rather specific orientation next to a wall, kinda similar to Poppy&#x27;s E. How far does the projectile travel in total before fizzling? \n\nThe range itself is measured as \"Skillshot Length\" under the ability title, and whenever it bounces the range resets.\n\n> \n> Cooldown and cost look fine.\n> \n> *W*: Can he move while preparing to cast this? I&#x27;m kinda uncertain on the delay. I kinda think the delay is actually too generous. It limits his ability to outplay and mind game enemies while escaping, and some assassins could kill him during the cast time. I&#x27;d hate dealing with this guy when I&#x27;m Irelia, though :p\n\nYes he can move during this, and I was going to buff this a little bit but someone also has stated that it's overpowered, even with the delay/low damage (with AP scaling on an AD champion)\n\n> *E*: Not sure what to say about the passive. 35% increase is pretty big, but you shouldn&#x27;t just be standing around in general in this game. Honestly I get confused if I ever an enemy just stand around in lane. \n\nYeah, honestly if anyone is standing still this passive is just \"uh lol ok\"\n\n> E Active is a neat little trick. The delay&#x27;s probably too long to ever catch anybody that isn&#x27;t cc&#x27;ed, but the punishment for it is appropriate.\n\nAgain, it's a huge punishment if you're that much of an idiot to stand in there for that long.\n\n> *R*: Most ultimates cost 100 mana, just putting that out. I have to admit, I love this one XD it&#x27;s so unique. What&#x27;s the &quot;5%&quot; part of the bonus damage? Does that mean it deals up to 50% of the original damage but as magic damage? If the 50% AP part stacks up with duration as well, you might want to change something there, otherwise he deal 500% of his AP with this, lol. You might want to cut the duration a bit, though, I can easily see this being VERY annoying to keep dodging for an enemy you&#x27;re trying to hit it with. Useless at point-blank, though, what with length channel to start it up.\n\nYeah, it's +5% magic damage per second its up, totaling up to 50% magic damage, and AFTER it all totals up that's when the AP scaling occurs, so it would be 50% extra magic damage (+AP scaling)\n\n> Azir, why you so evil? :U I don&#x27;t think he&#x27;s quite back to being the emperor of anybody just yet, as Taliyah&#x27;s opinion of him kinda implies that the people still living in Shurima aren&#x27;t just gonna accept his return and rule again so easily.\n\nThat's what I really wanted to imply with his lore as well.\n\n> I&#x27;m pretty sure Hextech is just a generic name for magically-infused technology in League&#x27;s setting. It&#x27;s definitely not Zaun-based, as plenty of Piltover champions make extensive use of Hextech.\n\nI wanted to portray Hex-Tech as a company based in Zaun, even if their appliances reach outside of Zaun in places such as Piltover or Bandle City I wanted to influence the idea of a corporate scheme trying to market the tech.\n\n> My biggest concern is I think he&#x27;d struggle to actually work in any role. His range is too low and he&#x27;s extremely squishy, so he&#x27;d have a difficult time functioning as an adc, and he doesn&#x27;t have enough mobility or cc to survive in top lane. You should probably buff his stats a bit so he could work as an adc.\n\nI'm aiming for an ADC role so I'll definitely do that. \n\n> Overall, you put a lot of work into this, nicely done :)\n\nThanks a lot dude, I'm glad you took the time to check this out.","replies":[{"poster":"Raxistaicho","date":"2016-05-26T17:29:37.548+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Metal Gear Roses,realm=NA,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=00100000,timestamp=2016-05-26T16:57:49.021+0000)\n>\n> Thanks a bunch dude! C:\n> \n> Got it, fixing the MR and I&#x27;ll bump up the range ever so slightly to help with range.\n> \n> I feel like the gold gain is fine as it would be really, REALLY hard to land a double cs/kill with his autoattacks, but if he did I feel like the reward should be worth it. The idea for Zone is all about positioning, or literally _zoning_ the enemy (I promise his name came before his kit was designed, pinky promise) \n> \n> Oh golly, yeah I&#x27;ll have to fix that.\n> \n> The range itself is measured as &quot;Skillshot Length&quot; under the ability title, and whenever it bounces the range resets.\n> \n> Yes he can move during this, and I was going to buff this a little bit but someone also has stated that it&#x27;s overpowered, even with the delay/low damage (with AP scaling on an AD champion)\n> \n> Yeah, honestly if anyone is standing still this passive is just &quot;uh lol ok&quot;\n> \n> Again, it&#x27;s a huge punishment if you&#x27;re that much of an idiot to stand in there for that long.\n> \n> Yeah, it&#x27;s +5% magic damage per second its up, totaling up to 50% magic damage, and AFTER it all totals up that&#x27;s when the AP scaling occurs, so it would be 50% extra magic damage (+AP scaling)\n> \n> That&#x27;s what I really wanted to imply with his lore as well.\n> \n> I wanted to portray Hex-Tech as a company based in Zaun, even if their appliances reach outside of Zaun in places such as Piltover or Bandle City I wanted to influence the idea of a corporate scheme trying to market the tech.\n> \n> I&#x27;m aiming for an ADC role so I&#x27;ll definitely do that. \n> \n> Thanks a lot dude, I&#x27;m glad you took the time to check this out.\n\nNp :) i know how annoying it is to put a lot of effort into a concept and get no replies.\n\nReview mine for the CCOS contest to return the favor ;)","replies":[{"poster":"sneezing slug","date":"2016-05-26T17:34:19.298+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Raxistaicho,realm=NA,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=001000000000,timestamp=2016-05-26T17:29:37.548+0000)\n>\n> Np :) i know how annoying it is to put a lot of effort into a concept and get no replies.\n> \n> Review mine for the CCOS contest to return the favor ;)\n\nOf course! Next chance I get I'll be sure to do so.","replies":[]}]}]}]},{"poster":"sneezing slug","date":"2016-06-19T03:10:45.684+0000","up_votes":1,"down_votes":0,"body":"Remember guys, I'm completely open to any feedback. Brutally honest/blunt? That's totally fine, in fact I prefer honesty over sugar-coated feedback, since that allows me to make my concept better ;P","replies":[]},{"poster":"sneezing slug","date":"2016-06-18T23:41:48.389+0000","up_votes":1,"down_votes":0,"body":"Reworked the monsterousity that was his W, and tweaked his Q. Less bounces, more damage.","replies":[]},{"poster":"sneezing slug","date":"2016-06-09T20:02:25.621+0000","up_votes":1,"down_votes":0,"body":"Sorry for the lack of updates, finals are kicking my hind.\n\nI'm going to try and do some edits this weekend.","replies":[]},{"poster":"AWorryingTrendC9","date":"2016-05-25T17:30:50.524+0000","up_votes":1,"down_votes":0,"body":"So just a few things. Zone's W is incredibly overpowered its essentially a charge up kass ult with a silence..... if it didn't have silence i think it would be pretty balanced. his e also seems really strong i mean 3 auto's late game is going to do alot of damage. his ult as stated by others is incredibly close to other adc's ults but i feel like its just a better jinx ult..... like its a directional jinx ult, pretty much the only difference, which isnt really fair to jinx to just have someone with the same ult just better in the same class of characters. otherwise i really like this champion the lore Q passive and overall the W,E, and R are good, just to strong.","replies":[{"poster":"sneezing slug","date":"2016-05-26T16:59:29.633+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AWorryingTrendC9,realm=NA,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=0011,timestamp=2016-05-25T17:30:50.524+0000)\n>\n> So just a few things. Zone&#x27;s W is incredibly overpowered its essentially a charge up kass ult with a silence..... if it didn&#x27;t have silence i think it would be pretty balanced. his e also seems really strong i mean 3 auto&#x27;s late game is going to do alot of damage. his ult as stated by others is incredibly close to other adc&#x27;s ults but i feel like its just a better jinx ult..... like its a directional jinx ult, pretty much the only difference, which isnt really fair to jinx to just have someone with the same ult just better in the same class of characters. otherwise i really like this champion the lore Q passive and overall the W,E, and R are good, just to strong.\n\nI really want to work towards keeping the silence-- the idea is an ability that distances himself away from the enemy, disabling them for a short moment, so that he can get a clear opportunity to hit them.\n\nI feel like it's not Kassadin's ult because it's not on an absurdly low cooldown, doesn't do much damage (not to mention AP scaling on an AD champion) and it silences, along with a delay to cast.\n\nWhat would you suggest?","replies":[{"poster":"AWorryingTrendC9","date":"2016-06-06T12:33:43.645+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Metal Gear Roses,realm=NA,application-id=A8FQeEA8,discussion-id=dnHYi0dB,comment-id=00110000,timestamp=2016-05-26T16:59:29.633+0000)\n>\n> I really want to work towards keeping the silence-- the idea is an ability that distances himself away from the enemy, disabling them for a short moment, so that he can get a clear opportunity to hit them.\n> \n> I feel like it&#x27;s not Kassadin&#x27;s ult because it&#x27;s not on an absurdly low cooldown, doesn&#x27;t do much damage (not to mention AP scaling on an AD champion) and it silences, along with a delay to cast.\n> \n> What would you suggest?\n\none suggestion is to make it do no damage and possibly make it have no chargeup, although i love the charge up part. other idea lower the ratio by like .5 or 50% and it would be more balanced.\n\n(sorry i forgot to upvote when i first looked at this i did now :D)","replies":[]}]}]},{"poster":"sneezing slug","date":"2016-06-05T06:39:11.778+0000","up_votes":1,"down_votes":0,"body":"That moment when you don't have to bump your own thread because people are arguing on your thread so you can just sit back and relax\n\nhttps://media.giphy.com/media/XreQmk7ETCak0/giphy.gif","replies":[]},{"poster":"sneezing slug","date":"2016-06-04T20:25:22.590+0000","up_votes":1,"down_votes":0,"body":"If I have time this weekend, I'll make some touch-ups to this concept.","replies":[]}]}