{"poster":"ObsceneSquidward","date":"2019-02-08T06:04:36.184+0000","title":"Mataron a Galio y con el mis ganas de jugar.","subforum":"Jugabilidad, balance y narrativa","up_votes":3,"down_votes":4,"body":"Los &uacute;ltimos nerfeos y &quot;ajustes&quot; que le dieron a galio terminaron de matar a un champ moribundo.\r\nSoy main Galio desde hace un buen tiempo pero &uacute;ltimamente perd&iacute; todas las ganas de jugar el champ, le quitaron la utilidad y limpieza de oleadas por darle da&ntilde;o para luego quitarle ese da&ntilde;o que le dieron. Galio se volvio un champ in&uacute;til que lo &uacute;nico bueno que tiene es su taunt en zona, preferiria que lo dejaran como  estaba antes de su &quot;ajuste&quot; donde nadie lo jugaba y el champ tenia ultilidad por su r y una limpieza decente con su e. Por favor devu&eacute;lvame a mi main :c","replies":[{"poster":"Que choto q soy","date":"2019-02-08T06:27:00.709+0000","up_votes":8,"down_votes":0,"body":"jajaja amo estos crypost, te nerfean un campeon rotisimo del cual abusaste para poder subir elo, y ahora que tenes que volver a jugar con campeones que estan balanceados no te sirven de nada. Te acostumbraste a jugar un campeon tan roto que ni siquiera te molestaste en aprender del juego en general.\nTe quedaste sin un campeon que te salvaba de tu pesimo farmeo y ahora no podes ganar games.","replies":[{"poster":"ObsceneSquidward","date":"2019-02-08T06:33:34.321+0000","up_votes":1,"down_votes":4,"body":"\nno abuse de galio para subir de elo, lo usaba cuando todavia era el peor mid laner del juego, de lo que me quejo auqi no es de que le nerfearan su daño, yo nunca jugue a galio por su daño, yo jugaba galio por la increible ultilidad que tenia y que se la quitaron y no solo le quitaron la utilidad que tenia tambien su daño","replies":[{"poster":"F2T Sköll","date":"2019-02-08T13:28:21.950+0000","up_votes":2,"down_votes":0,"body":"Su utilidad sigue intacta, en que le cambiaron en tu opinion","replies":[{"poster":"ToxicRunner","date":"2019-02-08T16:11:10.201+0000","up_votes":2,"down_votes":0,"body":"Tengo entendido que ahora tu R no le aumenta la defensa al tipo a que el caes.\nIgual no estoy 100% seguro.","replies":[]},{"poster":"ObsceneSquidward","date":"2019-02-08T17:55:01.785+0000","up_votes":1,"down_votes":0,"body":"le quitaron la utilidad e su r, ya no da redducion dde daño ni  y levanta mas a los eenemigos del centro e su r","replies":[]}]}]},{"poster":"ObsceneSquidward","date":"2019-02-08T06:37:44.176+0000","up_votes":1,"down_votes":3,"body":"ademas no entiendo por que te pones a hablar de mi nivel como jugador cuando el post era para hablar del nerf abusivi que sufrio galio y para saber que opinaba la gente al respecto, y ademas dice que era un champ rotisimo cuando galio es super facil de counterear, pero quizas tu eras e esos que pickeaban yasuo, kata o fizz vs un galio y luego se quejaban de que no le podian ganar idk","replies":[{"poster":"Que choto q soy","date":"2019-02-08T08:08:16.865+0000","up_votes":2,"down_votes":0,"body":"No juego midlane.","replies":[]}]},{"poster":"Just Play 4 Fun","date":"2019-02-08T06:39:46.765+0000","up_votes":2,"down_votes":1,"body":"Esto es exactamente lo que pensaba mientras leía el post. Lo mismo pasó con Irelia hace unos días","replies":[{"poster":"ObsceneSquidward","date":"2019-02-08T06:42:59.160+0000","up_votes":1,"down_votes":1,"body":"A Irelia le sucedió lo mismo pere no fue tan bruto como lo de galio, galio fue top tier en la milane y ahora vuelve a estar en los ultimos puestos, pero no me molestaría que galio sea el peor midlaner si aun conservarse su antigua utilidad. Sad :c","replies":[{"poster":"Just Play 4 Fun","date":"2019-02-08T07:05:45.482+0000","up_votes":1,"down_votes":1,"body":"Pues sí, lo de Galio fue mas bruto, pero en elos bajos sigue estando fuerte y no te olvides que en competitivo era casi pick o ban, y lo que Riot quiere es que varíen lo que usan en competitivo. Seguro en 1 mes lo volves a ver como antes pero menos roto","replies":[]}]}]},{"poster":"Deigex","date":"2019-02-09T01:36:36.042+0000","up_votes":1,"down_votes":0,"body":"Farmear? Te referis a farmear campeones cierto? Cierto? CIERTOO? Kappa.","replies":[]}]},{"poster":"Estøy Sad","date":"2019-02-08T06:12:11.725+0000","up_votes":3,"down_votes":0,"body":"Bueno, espero que en tu historial no haya partidas nuevas eh","replies":[{"poster":"ObsceneSquidward","date":"2019-02-08T06:17:55.151+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Estøy Sad,realm=LAS,application-id=xQmJPO8F,discussion-id=QAwivZ5w,comment-id=0000,timestamp=2019-02-08T06:12:11.725+0000)\n>\n> Bueno, espero que en tu historial no haya partidas nuevas eh\n\ncon galio no las habrá :c","replies":[]}]},{"poster":"Martin75","date":"2019-02-08T14:12:00.775+0000","up_votes":1,"down_votes":0,"body":"Yo lo sigo usando y me va bien","replies":[]},{"poster":"F2T Sköll","date":"2019-02-08T13:27:09.074+0000","up_votes":1,"down_votes":0,"body":"Es muy distinto el nerfeo de irelia al de galio, ambos se lo merecian, galio era un tanque que pegaba mas que un carrie, absurdo, pero su jugabilidad se dejo intacta, es distinto al nerff de irelia que directamente le sacaron los debuff que colocaba.","replies":[]},{"poster":"BKDT Rainbow","date":"2019-02-08T09:12:51.799+0000","up_votes":1,"down_votes":1,"body":"QWE","replies":[]}]}