{"poster":"Emma Mirra","date":"2016-10-13T13:21:02.594+0000","title":"Cansado?","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":0,"body":"No s&eacute; si cansado, pero si &quot;aburrido&quot; y frustrado de la clase de gente con la que nos tenemos que topar d&iacute;a a d&iacute;a. Gente que desde el minuto 1 empieza a flamear.\r\n\r\nHoy no fui a trabajar, y pens&eacute;: &quot;Voy a aprovechar a jugar un par de Aram&#039;s&quot; Dicho y hecho, solo fue un par. En la segunda me toco X jugador que cada vez que mor&iacute;a nos agred&iacute;a al resto. Y uno se tiene que quedar callado o no responder del mismo modo, porque eso es lo que pide Riot, y sobretodo es lo que mis viejos me ense&ntilde;aron. \r\nEn fin, me quedaba la mitad de la ma&ntilde;ana para seguir divirti&eacute;ndome, pero las ganas se van. Es injusto para los jugadores que intentamos tener un comportamiento normal tener que bancarnos a gente as&iacute;.\r\n \r\n**El reclamo de siempre, la historia de siempre. **","replies":[{"poster":"Ufaaaaaaaaaa","date":"2016-10-13T19:36:50.247+0000","up_votes":4,"down_votes":0,"body":"aram? ayer jugué en mi smurf.\n\nArranco con una normal para distender, al minuto 7 jugando con cho gath viene el voli jungla y me bajka media vida de un mordisco, aprieto tab y me sacaba 3 niveles e iba 6-0, a la mierda todo.\nDigo, \"buen, por ahi en ranked se lo toman mas en serio\". Primera partida, minuto 6, el supp le empieza a decir a los rivales donde estaba nuestro jungla, izi pizi gg minuto 20.\nSegunda partida, premade de 4, rumble jungla. Obviamente después de mandarse todas las cagadas habidas y por haber (incluyendo iniciar baron sin adc), la culpa era mia por jugar con jayce y no \"ser tanque\" (cabe aclarar que fuí segundo pick y el rumble tercero).\nTercera partida, no se que habrá hecho el jungla de ellos, se recontra aburrió porque el jungla nuestro linea que pisaba, linea que feedeaba.\nAhí si que me cansé, veremos que traen en la nueva temporada y muy posiblemente desinstale.","replies":[{"poster":"Emma Mirra","date":"2016-10-15T04:37:53.977+0000","up_votes":1,"down_votes":0,"body":"Vengo recien de un Aram en donde a un Zed se le canto quedarse afk y asi fue. Perdimos. \n\nNo se Riot que es lo que hace. Le importa mas el dinero que otra cosa. No pueden poner mano firme porque se le va la mitad de los usuarios y la mitad del dinero.","replies":[]}]},{"poster":"Sonya Kyron","date":"2016-10-13T13:26:52.412+0000","up_votes":2,"down_votes":0,"body":"A mi me emparejo con 3 AFK Flamers, que porque me toco sup y jugué mejor que ellos me flamearon, de hecho al minuto 15 yo tenia 4 kills y ninguno del team estaba mas fedeado y con mejores ítems que yo porque fui el que mas oro saco siendo sup y defendiendo mid a la vez con el mid afk.","replies":[{"poster":"Paakelogosézh","date":"2016-10-13T13:51:18.478+0000","up_votes":3,"down_votes":0,"body":"pero no sos el mejor kartus del mundo? aun con 3 afk tenes q ganar","replies":[{"poster":"Sonya Kyron","date":"2016-10-13T14:06:37.130+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Paakelogosézh,realm=LAS,application-id=PJAKt7ph,discussion-id=amqAlEWu,comment-id=00000000,timestamp=2016-10-13T13:51:18.478+0000)\n>\n> pero no sos el mejor kartus del mundo? aun con 3 afk tenes q ganar\n\ncon karthus tengo chances de ganar, con zyra sup no tengo ninguna, ni siquiera tengo la maestria 5, a demás no figuro entre los 10000 mejores todavía con ese champ.","replies":[]}]}]},{"poster":"Spellhowler","date":"2016-10-13T13:47:02.366+0000","up_votes":2,"down_votes":0,"body":"Bloqueo de chat y a otra cosa... Alfinal de cuentas toda partida te enseña algo vos juga lo mejor que puedas y deja que los otros se manejen en su complicado mundo.\nSaludos","replies":[{"poster":"Emma Mirra","date":"2016-10-13T14:16:29.502+0000","up_votes":2,"down_votes":0,"body":"Si, pero no es la solucion. El resto de los chabones eran piolas...","replies":[]}]},{"poster":"fenakz","date":"2016-10-13T13:32:58.138+0000","up_votes":2,"down_votes":0,"body":"Hace cuanto jugas ? yo juego hace más de 6 años y está la misma gente, en NA era peor.","replies":[{"poster":"Emma Mirra","date":"2016-10-13T14:17:01.826+0000","up_votes":1,"down_votes":0,"body":"Dos años y algo. Creo...","replies":[]}]},{"poster":"BERT1","date":"2016-10-13T13:31:37.615+0000","up_votes":2,"down_votes":0,"body":"Todos cansados y aburridos de esos jugadores mala clase, pero que se le va hacer , solo un reporte para tratar de que hagan algo y por ningún motivo seguir el juego a estos tipos.","replies":[{"poster":"Emma Mirra","date":"2016-10-13T14:17:23.992+0000","up_votes":1,"down_votes":0,"body":"Creo que Riot deberia de ser mas estricto. Y chau","replies":[{"poster":"BERT1","date":"2016-10-13T15:18:40.692+0000","up_votes":1,"down_votes":0,"body":"Si lo es estoy seguro, pero el problema es el numero de cuentas imagino es tan grande que parece nunca ser suficiente.","replies":[]}]}]},{"poster":"KR Hunk","date":"2016-10-13T13:52:09.051+0000","up_votes":2,"down_votes":1,"body":"Pedile a uno de tus amigos que juegue con vos, vas a ver como se nota la diferencia de jugar solo contra 9 boludos y jugar con alguien que se toma a risa todo.\n\n_Si queres agregame, no flameo, soy un jugador normal como vos jaja un saludo. _","replies":[{"poster":"Emma Mirra","date":"2016-10-13T14:15:42.920+0000","up_votes":1,"down_votes":0,"body":"Normalmente juego en equipo, estoy en un grupo que juegan mucho Aram... Pero a la mañana no estan conectados jaja En fin, una paja.","replies":[]}]},{"poster":"chinoyap","date":"2016-10-15T21:45:30.031+0000","up_votes":1,"down_votes":0,"body":"siempre es lo mismo los report no sirven de nada, comentas aca en el foro te borran el posteo, sinceramente una basura, mejor que saquen el sistema de reportes si al final no sirve de nada, y seguiran exisitiendo jugadores que les da lo mismo","replies":[]},{"poster":"Akusai","date":"2016-10-13T14:38:34.754+0000","up_votes":1,"down_votes":0,"body":"tengo mas de 2k de aram jugados y te digo que hay menos flamers que en la grieta","replies":[{"poster":"Emma Mirra","date":"2016-10-13T18:16:26.595+0000","up_votes":1,"down_votes":0,"body":"Eso es cierto. Pero hoy me tocó uno que me sacó las ganas.","replies":[]}]},{"poster":"Mecha Sétt","date":"2016-10-13T14:17:43.138+0000","up_votes":1,"down_votes":0,"body":"Hoila, primero la actitud parte por cada uno. \n\nFijate: juegas varias partidas, y varias las pierdes por algun jugador troll afk etc. a diferencia del enemigo que juega y gana. \n\n--- Que tienen en comun? tu estando en todas esas partidas. AHORA TE DARE UNOS CONSEJOS PARA MEJORAR TU VIDA, y ayudar al SERVIDOR. \n\n1- Si no vas a decir algo positivo, mejor no escribirlo. \n2- Si ves gente autolokeando, o troleando, no tengas miedo juega y pierde si toca perder o gana si puedes, lo IMPORTANTE ES: REPORTAR A ESTE JUGADOR. (la gente que trolea, tiene la tendencia de seguir troleando, si acomula report terminara siendo baneado), piensa que ese noble sacrificio ayudara a identificar a estos jugadores.\n3- Practica deporte escucha musica y trata de jugar con amigos, asi es mas divertido el jugar. :)","replies":[]}]}