{"poster":"YumaS2Astral","date":"2015-07-27T03:51:43.001+0000","title":"\"Solution to balance Vayne\" I open the thread \"Delete her\"","subforum":"Gameplay","up_votes":113,"down_votes":24,"body":"Seriously, stop with that shit. I am totally in favor of nerfs for {{champion:67}} and a bunch of other champions like {{champion:92}}, and by no means I create threads with a title that would mislead you into believing that there are actual points written about why those champions should be nerfed, only to see that the actual content is just \"Delete her/him\".\n\nThose threads do not explain why those champions are broken and serve just to spam the boards. You can hate a champion, but if you think that this champion is broken, at least provide a reasonable explanation to why.","replies":[{"poster":"360D3GR3SS","date":"2015-07-27T04:08:00.706+0000","up_votes":6,"down_votes":27,"body":"The only nerf vayne MIGHT need is her attackspeed per level reduced slightly.","replies":[{"poster":"YumaS2Astral","date":"2015-07-27T04:55:32.918+0000","up_votes":9,"down_votes":13,"body":"> [{quoted}](name=360D3GR3SS,realm=NA,application-id=3ErqAdtq,discussion-id=cpVaFEYg,comment-id=0000,timestamp=2015-07-27T04:08:00.706+0000)\n>\n> The only nerf vayne MIGHT need is her attackspeed per level reduced slightly.\n\nReduce her base attack speed and remove the flat true damage component from her Silver Bolts, and there is a balanced Vayne.\n\nEDIT: I would also propose to change her % max hp true damage to % bonus HP true damage. However, this might be too much of a nerf to her unless her attack speed is not changed.","replies":[{"poster":"360D3GR3SS","date":"2015-07-27T05:15:03.776+0000","up_votes":4,"down_votes":16,"body":"Lol and you made here the worst ADC by doing that. Her percent true damage is fine, it takes 3 hits and with those 3 hits she must AUTO ATTACK YOU, meaning thornmail and frozen heart shut her down extremely hard.","replies":[{"poster":"Gorgiolio","date":"2015-07-27T05:29:56.053+0000","up_votes":17,"down_votes":5,"body":"Not against a devourer vayne :')","replies":[{"poster":"360D3GR3SS","date":"2015-07-27T06:06:22.380+0000","up_votes":2,"down_votes":21,"body":"Which isn't a thing.","replies":[{"poster":"lB2kGRlc8y","date":"2015-07-27T08:22:43.082+0000","up_votes":27,"down_votes":2,"body":"Then I must have imagined those 5 games in teambuilder with devourer vayne. Thanks for clearing that up.","replies":[{"poster":"I Miss Cannon","date":"2015-07-27T11:24:51.411+0000","up_votes":5,"down_votes":18,"body":"yeah, NA teambuilder is full of bronze V people with 20 cs at 10 minutes. no wonder. even ad nami works there.","replies":[{"poster":"Rinky Dinky","date":"2015-07-27T12:04:35.359+0000","up_votes":26,"down_votes":0,"body":"What does that make EUW Teambuilder? Salt V?\n\n:3","replies":[{"poster":"CubedJustice","date":"2015-07-28T02:58:29.103+0000","up_votes":5,"down_votes":0,"body":"\"So, I just finished my placements, and got put in EUW...\" \"Sorry about that, man. Might as well make a new account.\"","replies":[]}]}]},{"poster":"outranged","date":"2015-07-28T00:10:52.120+0000","up_votes":1,"down_votes":0,"body":"You can run literally anything in normals and still have a fair chance of a win.\n\nBack before Vayne was considered \"OP\", I won games with AP and Jungle Vayne. (she has absolutely no AP ratios)\n\nYou shouldn't use a non-competitive environment as a basis for anything.","replies":[{"poster":"lB2kGRlc8y","date":"2015-07-28T06:33:16.289+0000","up_votes":1,"down_votes":0,"body":"Not necessarily, non ranked isn't non competitive, it just doesn't reward you with points on a leaderboard. Also ranked is a cesspool of trolls, so games can actually require more skill in some circumstances. I'm completely unranked, and have beaten teams with multiple diamonds and even been matched against masters, so don't try to pull the flimsy skill level argument. Even if non ranked isn't ranked, there's still a method in place to match up players with people of their skill level, so running obscene strategies like full ad soraka and winning just says you're against baddies, not that everyone else in non ranked is.","replies":[]}]}]}]}]},{"poster":"Ventira","date":"2015-07-27T12:15:23.007+0000","up_votes":8,"down_votes":4,"body":"> [{quoted}](name=360D3GR3SS,realm=NA,application-id=3ErqAdtq,discussion-id=cpVaFEYg,comment-id=000000000000,timestamp=2015-07-27T05:15:03.776+0000)\n>\n> Lol and you made here the worst ADC by doing that. Her percent true damage is fine, it takes 3 hits and with those 3 hits she must AUTO ATTACK YOU, meaning thornmail and frozen heart shut her down extremely hard.\n\nMan, a 300 armor, FH, Randuin's and Thornmail equipped Malphite just died in <5 seconds to a vayne.\n\nThere is no shutting down a Vayne's damage. There really isn't.","replies":[{"poster":"O Fallen Scholar","date":"2015-07-27T12:31:47.671+0000","up_votes":4,"down_votes":3,"body":"> [{quoted}](name=Metarid,realm=NA,application-id=3ErqAdtq,discussion-id=cpVaFEYg,comment-id=0000000000000001,timestamp=2015-07-27T12:15:23.007+0000)\n>\n> Man, a 300 armor, FH, Randuin's and Thornmail equipped Malphite just died in <5 seconds to a vayne.\n> \n> There is no shutting down a Vayne's damage. There really isn't.\n\nThen blame the Malphite who missed the ultimate.","replies":[{"poster":"Ventira","date":"2015-07-27T13:24:36.269+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Gachimuchi,realm=EUW,application-id=3ErqAdtq,discussion-id=cpVaFEYg,comment-id=00000000000000010000,timestamp=2015-07-27T12:31:47.671+0000)\n>\n> Then blame the Malphite who missed the ultimate.\n\nWhat if I told you he landed his ultimate?","replies":[{"poster":"OwlMechanic","date":"2015-07-27T20:03:25.727+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Metarid,realm=NA,application-id=3ErqAdtq,discussion-id=cpVaFEYg,comment-id=000000000000000100000000,timestamp=2015-07-27T13:24:36.269+0000)\n>\n> What if I told you he landed his ultimate?\n\nI'd have trouble believing this went down the way you described, Malph's E (which he ALWAYS follows the ultimate with) is the most massive vayne counter in the game next to nasus, between that and frozen heart her attacks are going to be snailing into him at far too little time for her passive to even make a bit of difference.","replies":[{"poster":"Kuroi86","date":"2015-07-27T22:19:01.038+0000","up_votes":2,"down_votes":0,"body":"Tumble resets Vaynes auto attack and Condemn has no cast time.  Auto, condemn, tumble, auto.\nMalphites E slow only lasts 3 seconds, after that her attack speed goes back to normal.\nI think he's exaggerating how quickly the Malphite fell, but it's no exaggeration that at full build Vayne can burn through a tank pretty quickly, it's largely how her kit is designed to work.\nIt also doesn't help that Malphite lacks killing potential against full health enemies.","replies":[]},{"poster":"KONO RUBICK DA","date":"2015-07-28T12:52:39.128+0000","up_votes":1,"down_votes":0,"body":"AA->tumble->condemn, oh no malphite just lost 15% of his HP and well his AA slow has finished","replies":[]}]},{"poster":"EvilRabbitt","date":"2015-07-27T14:52:40.473+0000","up_votes":4,"down_votes":2,"body":"I'd ask why he didn't follow up. And why he engaged as a full tank into an adc who was in her late game, and notoriously powerful for it? And why he didn't send an assassin on her instead of himself?","replies":[]}]}]},{"poster":"doombotMECHA","date":"2015-07-27T15:59:43.785+0000","up_votes":2,"down_votes":1,"body":"the problem isn't the tru damage. it's that every ad carry has access to enough arpen to invalidate a tank's armor.","replies":[{"poster":"Kuroi86","date":"2015-07-27T22:29:31.052+0000","up_votes":1,"down_votes":0,"body":"Um... no it doesn't.  Most ADC only get {{item:3035}} which negates 35% of a tanks armor.\nHowever, at just 155 armor, a tank still has 100 armor even with {{item:3035}} negating 35% of it.\n\nYour average tank has between 23 to 80 armor based on lvl.\n{{item:3068}} 45 ar\n{{item:3143}}  70 ar\n{{item:3075}}  100 ar\n{{item:3110}}  100 ar\n{{item:3025}}  60 ar\n{{item:3047}}  25 ar and blocks 10% damage from basic attacks\n{{item:3512}} 60 ar\n\nPick one, pick two, even after the ADC gets {{item:3035}} you will still be cutting their auto attacks in half.\nHeck, maybe even more if you get {{item:3047}} and Reinforced Armor on top of {{item:3143}}","replies":[]}]},{"poster":"Psi21","date":"2015-07-28T02:19:24.090+0000","up_votes":1,"down_votes":0,"body":"You know if Riot never ridiculous pumped tanks to the strengths they are now.  We wouldn't be seeing players and Riot's means of Band-Aiding them.  \n\nPlayers just as in 2010 used Kog to deal with tanky dps.  Take it from a player who played from beta who has watched it all.\n\nLater as Riot was repairing their faults about tankie dps adding Madred and DFG and later Vayne we saw this more in 2011.\n\nLeaving in those items to deal with Tanky dps was just fine and ...\n\nFinally Tanky DPS was some what under control.\n\nBut starting this year 2015 we have Riot balancing team (new perhaps) learning nothing from the past.  They introduced a new armor that provided both form of resists and cinderhulk.  Changes to mages... They show no understanding of balance.\n\nAnd now just as we have in 2010-11 the player and Riot are adapting.\n\nIt would be silly for Riot balancing team to admit they F'ed up.\n\nBut whats done is done.  We all know a lot of things really should be rolled back.   The failures have been mounting up.\n\nSalvaging well what they have done.... they keep trying...\n\nIt is really too bad.   A company that never learns from the mistakes of the past.  Doubles down on the wrong process.  At least we see some of those companies being fixed finally.   Comcast comes to mind.\n\nLooking forward to Spike.","replies":[]},{"poster":"Hellish Prophecy","date":"2015-07-27T17:09:47.088+0000","up_votes":1,"down_votes":0,"body":"Oh, come on. Be fucking realistic.....\n\nIf a Malph truly did have those 3 items he has around 400-500 armor. Not 300.","replies":[{"poster":"Ventira","date":"2015-07-27T17:44:19.828+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RemnantsOfAsylum,realm=NA,application-id=3ErqAdtq,discussion-id=cpVaFEYg,comment-id=00000000000000010002,timestamp=2015-07-27T17:09:47.088+0000)\n>\n> Oh, come on. Be fucking realistic.....\n> \n> If a Malph truly did have those 3 items he has around 400-500 armor. Not 300.\n\nNot accounting for base and (his old) W active, those three items amount to 280 armor. Which is by no means a small amount. The fact that, accounting for base armor, and his W, Malphite has a crazy high amount of armor that Vayne *still* tears right through with minimal effort is a problem.","replies":[]}]}]}]}]}]},{"poster":"ShinobisDemon","date":"2015-07-27T11:16:12.818+0000","up_votes":6,"down_votes":0,"body":"While I don't think she is OP to begin with because she can be zoned and has a high skill cap like yasuo. IF we needed a fair buff on her, we could get rid of her true damage on silver darts. IF this was done she would be considered as bad as quinn and would have to be played top lane to squash tanks because that would be all she can do. I honestly don't think that vayne is that OP, speaking of OP teemo is getting buffed. \n\nTEEMO IS GETTING BUFFED...\n\nI Think champs need to be nerfed before vayne is even considered, Zed feels like he is in a good place right now. I don't know about leblanc because I suck at her lol.  Ekko doesn't feel toooooo OP anymore. Fizz is annoying by nature but I don't think he is that OP anymore. blitz hitbox on Q could be a little more accurate. They can lower the scaling on Yi true damage (e).  Oh and if you guys want riven nerfed make animation canceling either impossible or time limited (can't animation cancel more than once in ((.33 miliseconds?))","replies":[{"poster":"MohawkBird","date":"2015-07-27T14:41:48.333+0000","up_votes":3,"down_votes":1,"body":"***","replies":[{"poster":"Hensetsu","date":"2015-07-27T16:05:26.557+0000","up_votes":3,"down_votes":1,"body":"Most champions complained about are hard to play though these days. People hate on Riven but very few can play her. \n\nIt's also annoying when people say things such as \"Oh you main the champion that's why you feel like they're balanced\". Almost as if knowing a champion inside and out means that now you know less about your champion than people who play against it without your level of knowledge. \n\nCommonly complained about champions:\n\n{{champion:67}}  {{champion:92}}  {{champion:105}}  {{champion:268}}  {{champion:39}}  {{champion:238}} {{champion:64}} \n\nThere are a few exceptions (Irelia is alright) but the trend is clear, these are hard champions that are very rewarding when played well, but most people don't know what to do when these champions are played well and thus bring out the pitchforks and rant about how horrid these guys are.\n\nHave you never played with an 0/10 vayne? 0/10 riven? 0/10 zed? They're bloody useless.","replies":[{"poster":"TheI3igDaddy","date":"2015-07-28T06:56:34.465+0000","up_votes":1,"down_votes":0,"body":"Yeah, that little sidenote in parentheses saved me from straight up saying YOU THINK IRELIA IS HARD?!?","replies":[]}]}]},{"poster":"Godaren","date":"2015-07-27T18:02:08.576+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ShinobisDemon,realm=NA,application-id=3ErqAdtq,discussion-id=cpVaFEYg,comment-id=0006,timestamp=2015-07-27T11:16:12.818+0000)\n>\n> While I don't think she is OP to begin with because she can be zoned and has a high skill cap like yasuo. IF we needed a fair buff on her, we could get rid of her true damage on silver darts. IF this was done she would be considered as bad as quinn and would have to be played top lane to squash tanks because that would be all she can do. I honestly don't think that vayne is that OP, speaking of OP teemo is getting buffed. \n> \n> TEEMO IS GETTING BUFFED...\n> \n> I Think champs need to be nerfed before vayne is even considered, Zed feels like he is in a good place right now. I don't know about leblanc because I suck at her lol.  Ekko doesn't feel toooooo OP anymore. Fizz is annoying by nature but I don't think he is that OP anymore. blitz hitbox on Q could be a little more accurate. They can lower the scaling on Yi true damage (e).  Oh and if you guys want riven nerfed make animation canceling either impossible or time limited (can't animation cancel more than once in ((.33 miliseconds?))\n\nzed and leblanc are not op right now or even close, yi i can agree with you on tho","replies":[]}]},{"poster":"Saianna","date":"2015-07-27T04:17:10.074+0000","up_votes":6,"down_votes":0,"body":"Imo that threat was just a joke, I've seen few other similar threats about Riven, Riven and Riven :P\n\nMajor issue with Vayne is her passive % max hp true damage, as it should deal higher damage against tanks than squishes, yet it works otherwise.\n\nChange that, and she'll be back in right spot imo :)","replies":[{"poster":"YumaS2Astral","date":"2015-07-27T04:54:54.824+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Saianna,realm=EUNE,application-id=3ErqAdtq,discussion-id=cpVaFEYg,comment-id=0001,timestamp=2015-07-27T04:17:10.074+0000)\n>\n> Imo that threat was just a joke, I've seen few other similar threats about Riven, Riven and Riven :P\n> \n> Major issue with Vayne is her passive % max hp true damage, as it should deal higher damage against tanks than squishes, yet it works otherwise.\n> \n> Change that, and she'll be back in right spot imo :)\n\nThe problem is that % max hp true damage is as effective against squishies than against tanks. However it also has a flat true damage component. Not to mention, Vayne still has her normal auto-attacks, as well as Blade of the Ruined King passive. So basically she ends up murdering squishies while killing tanks. And squishies will actually die faster tanks because they are, well... squishies.","replies":[{"poster":"Seenan","date":"2015-07-27T05:15:25.651+0000","up_votes":2,"down_votes":4,"body":"> [{quoted}](name=YumaS2Astral,realm=NA,application-id=3ErqAdtq,discussion-id=cpVaFEYg,comment-id=00010000,timestamp=2015-07-27T04:54:54.824+0000)\n>\n> The problem is that % max hp true damage is as effective against squishies than against tanks. However it also has a flat true damage component. Not to mention, Vayne still has her normal auto-attacks, as well as Blade of the Ruined King passive. So basically she ends up murdering squishies while killing tanks. And squishies will actually die faster tanks because they are, well... squishies.\n\nNot to mention how she lifesteals it all back because..well..bork.\n\n(I'm not sure if the true damage portion gets absorbed too as lifesteal, but if it does, then that's just too broken.)\n\nDelete her max hp%, make it current hp magic damage or something, so she's actually in-line with other adcs.","replies":[{"poster":"Anidan","date":"2015-07-27T07:00:43.129+0000","up_votes":6,"down_votes":0,"body":"If you replace her max hp% with magic damage, you'd better be ready for some numbers buffs because Kog'maw does magic %hp damage... but 6% PER HIT, as opposed to 8% + base every 3 as it is for Vayne. \n\nJust doing a straight damage-type shift and no other buffs would literally gut her - she is balanced around Silver Bolts - Silver Bolts is the main part of her identity. Vayne busts tanks, period. \n\nPlus, if you make it into magic damage then you, again, make it more effective against squishies who aren't going to be building much magic resistance as compared to a tank who will have at least 150-175.","replies":[{"poster":"LionelLeon","date":"2015-07-27T22:52:28.095+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Anidan,realm=NA,application-id=3ErqAdtq,discussion-id=cpVaFEYg,comment-id=0001000000000001,timestamp=2015-07-27T07:00:43.129+0000)\n>\n> If you replace her max hp% with magic damage, you'd better be ready for some numbers buffs because Kog'maw does magic %hp damage... but 6% PER HIT, as opposed to 8% + base every 3 as it is for Vayne. \n> \n> Just doing a straight damage-type shift and no other buffs would literally gut her - she is balanced around Silver Bolts - Silver Bolts is the main part of her identity. Vayne busts tanks, period. \n> \n> Plus, if you make it into magic damage then you, again, make it more effective against squishies who aren't going to be building much magic resistance as compared to a tank who will have at least 150-175.\n\nChanging it to magic damage will make it hell to itemize against her","replies":[]}]},{"poster":"Sightless66","date":"2015-07-27T06:33:56.741+0000","up_votes":2,"down_votes":2,"body":"No, then she sucks hard.\n\n%health true damage is fine on her kit. It gives her a tankbusting mechanic that isn't more effective against squishies the way that %health physical or magical damage tends to be. The flat true damage on it could arguably be lowered to decrease her effectiveness against squishes, but there is nothing wrong with her the % value. It's a good mechanic for fulfilling her role, and she does have kit weaknesses to make up for it (she's a bit too strong right now, but it can't be denied that she does lack a lot of things other AD carries have, and those absences can be exploited against her).\n\nYes, I know you can't build to directly counter it. No, that isn't a problem. You can still build against the majority of her damage with armor. You can build against all of her damage with attack speed slows. You can counter Vayne with actual counter play instead of just counter building, and counter play is by far the more important trait to have.\n\nAlso, to answer your question, the true damage does not proc lifesteal. It's an ability effect, not on-hit damage, so lifesteal won't apply to it. As a general rule, lifesteal only applies to autoattacks and physical on-hit effects unless otherwise noted.","replies":[{"poster":"MalzaharAnyLane","date":"2015-07-27T11:09:04.139+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Sightless66,realm=NA,application-id=3ErqAdtq,discussion-id=cpVaFEYg,comment-id=0001000000000000,timestamp=2015-07-27T06:33:56.741+0000)\n>\n> Also, to answer your question, the true damage does not proc lifesteal. It's an ability effect, not on-hit damage, so lifesteal won't apply to it. As a general rule, lifesteal only applies to autoattacks and physical on-hit effects unless otherwise noted.\n\nIncorrect.\n\nTest it on dragon sometime.","replies":[]}]}]}]}]},{"poster":"Monsta Moo","date":"2015-07-27T09:38:02.530+0000","up_votes":8,"down_votes":2,"body":"I posted this elsewhere, so I'll drop it here too.\nSo Silver Bolts deals flat damage+ HP%  in true damage.\nI propose we beef up the flat damage a bit and make it the only part that deals true damage.\nThe HP% will deal standard AD damage, opening up some counter play and making your armor actually matter\n\nEdit: We can also make it deal HP% AD damage with a true damage DOT at a lower degree. \n_\"Vayne tips her bolts with a rare metal, toxic to evil things.\"_","replies":[]},{"poster":"Curling Veigar","date":"2015-07-27T15:27:57.739+0000","up_votes":3,"down_votes":0,"body":"thats why i highlight the thread and read what it says before clicking it\n\nalso, implying that deleting vayne is a bad thing","replies":[]},{"poster":"The Lexer","date":"2015-07-27T13:47:06.712+0000","up_votes":3,"down_votes":0,"body":"Yet they get the most upvotes....","replies":[]},{"poster":"Samflash3","date":"2015-07-28T04:38:49.539+0000","up_votes":2,"down_votes":0,"body":"Relevant(Saw this post not too long ago):\n\nhttps://www.youtube.com/watch?v=RmVEbNOES9E","replies":[]},{"poster":"brad","date":"2015-07-27T17:31:09.892+0000","up_votes":2,"down_votes":0,"body":"mods need to start removing shit that is \"low effort\" on more places than just gd\n\nits honestly a joke","replies":[]},{"poster":"Iamawalrus","date":"2015-07-27T10:19:01.268+0000","up_votes":3,"down_votes":1,"body":"Am I missing something? What reason is there to nerf Vayne over say Jinx?","replies":[{"poster":"YumaS2Astral","date":"2015-07-27T12:09:27.627+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Iamawalrus,realm=EUW,application-id=3ErqAdtq,discussion-id=cpVaFEYg,comment-id=0004,timestamp=2015-07-27T10:19:01.268+0000)\n>\n> Am I missing something? What reason is there to nerf Vayne over say Jinx?\n\nJinx is nowhere nearly as mobile as Vayne and does not have true damage based on the enemy's max health, not to mention, Jinx's attack speed gain per level does not even come close to how much attack speed Vayne gains per level.","replies":[]}]},{"poster":"Aboylova92","date":"2015-07-28T12:49:08.102+0000","up_votes":1,"down_votes":0,"body":"While I agree with you, you do realize it was simply a joke right?","replies":[]},{"poster":"aeVoWXYKH0","date":"2015-07-28T08:57:24.380+0000","up_votes":1,"down_votes":0,"body":"Vayne needs a nerf , no doubt about it. Unlike other adcs the only way to weaken her is buying Randuin's and Frozen Heart but it forces you to buy items you would normally not buy instead of other important items just to reduce her AS by a small amount. Mix that with only point and click skills , huge mobility , stealth and a pretty easy cc to pull off and you get cancer. People say she needs skill to kite and position correctly but that is common adc knowledge and even ranged mages use that knowledge so Vayne is not any more special . If aa resetting is  that skill intensive then you should know that she is not the only one that can do that and it is learned by playing some games then it is just muscle memory. The best way to nerf her is to make her w damage physical or even magical.","replies":[]},{"poster":"FistOfSharkiesha","date":"2015-07-27T20:29:39.514+0000","up_votes":1,"down_votes":0,"body":"It doesn't make any sense because when I explain the issues with a particular champion such as Riven's ability to be played like an assassin with 1.5 seconds of hard CC, being resourceless, and having 4 dashes and a spammable shield, then propose a fix such as making her shield scale with AP over AD, I get downvoted and told I'm an idiot. Then a thread pops up saying delete her and it has 100 upvotes.","replies":[{"poster":"Pledgie","date":"2015-07-27T22:38:19.180+0000","up_votes":1,"down_votes":1,"body":"why tf would you build ap on riven. the best way to beat riven is to just drop some bows {{champion:86}}","replies":[{"poster":"FistOfSharkiesha","date":"2015-07-28T08:19:27.025+0000","up_votes":1,"down_votes":0,"body":"That's the point. Several AD champions have AP ratios to balanced them out. Corki, Miss Fortune, Xin Shao. They have abilities that would be overpowered if they scaled with AD. Riven's spammable resourceless shield scaling with AD is overkill.","replies":[]}]}]},{"poster":"Vàýńé","date":"2015-07-28T06:14:59.397+0000","up_votes":1,"down_votes":0,"body":"I've got Riot ShadowStorm ( Yes hes not in character design but he knows a lot of rioters) to spread the word of this thread. http://boards.na.leagueoflegends.com/en/c/gameplay-balance/Vp6drv3e-vaynes-rework-what-the-community-is-trying-to-say-meddler \nPost your ideas there like @Shockforce","replies":[]},{"poster":"Fredart","date":"2015-07-28T06:00:09.022+0000","up_votes":1,"down_votes":0,"body":"Take away her invisibility like that of twitch or eve.","replies":[]}]}