{"poster":"YumaS2Astral","date":"2015-10-18T17:47:53.697+0000","title":"Honestly, I think that Jinx's rockets should have their mana cost increased","subforum":"Gameplay","up_votes":164,"down_votes":47,"body":"I think that part of reason why Jinx is so powerful is that she can spam Fishbones rockets with little to no consequence, especially during the early game.\n\nShe is supposed to have a weak early game and to become OOM if she spams rockets. However, in reality, she can spam rockets during the early game to harass the enemy from a safe distance (that&#039;s why Jinx seems to be strong during the early game) - and then spam rockets during teamfights and deal high AoE damage.\n\n20 mana per rocket is a very small cost, I think that increasing it by 5 per level would be enough to tone down her power. After all, Jinx is supposed to save her rockets for important situations such as teamfights, and not to spam them carelessy. However, Riot should take care with how much they increase the mana cost, otherwise Jinx will end up gutted.","replies":[{"poster":"BlunterMonk","date":"2015-10-18T20:24:24.603+0000","up_votes":71,"down_votes":3,"body":"I think you have it backwards, early game her rockets drain her mana pretty quickly. It's late game where jinx players don't have to worry about mana usage at all.","replies":[{"poster":"chipndip1","date":"2015-10-18T21:20:30.447+0000","up_votes":7,"down_votes":25,"body":"> [{quoted}](name=BlunterMonk,realm=NA,application-id=3ErqAdtq,discussion-id=Jf8TaEhE,comment-id=0001,timestamp=2015-10-18T20:24:24.603+0000)\n>\n> I think you have it backwards, early game her rockets drain her mana pretty quickly. It's late game where jinx players don't have to worry about mana usage at all.\n\nA lot of adcs don't worry about mana late game so why does Jinx have to be the only one?","replies":[{"poster":"My Waifu Vanilla","date":"2015-10-18T21:30:35.818+0000","up_votes":39,"down_votes":9,"body":"A lot of ADCs can also not crit upwards of 5 people with one auto attack.....that already does 110% damage. For free.","replies":[{"poster":"chipndip1","date":"2015-10-18T21:42:21.118+0000","up_votes":9,"down_votes":19,"body":"> [{quoted}](name=My Waifu Chocola,realm=NA,application-id=3ErqAdtq,discussion-id=Jf8TaEhE,comment-id=000100000000,timestamp=2015-10-18T21:30:35.818+0000)\n>\n> A lot of ADCs can also not crit upwards of 5 people with one auto attack.....that already does 110% damage. For free.\n\nBut EVERY adc has a much higher attack rate on ONE target, and taking out one target is usually better than doing decent damage on a group.","replies":[{"poster":"Sinlaire","date":"2015-10-18T22:30:42.278+0000","up_votes":53,"down_votes":2,"body":"{{champion:119}}  is this the part where my boy over here steps on scene to demonstrate that every auto does 180% damage on a single target for 0 cost with lvl 5 Q in comparison to a 110% damage auto at 20 per auto?\n\none is single target and one is splash ( and one also requires you to catch it afterwards) but this biggest factor is that everyone is always happy to jump on what makes a champ strong in a certain situation without pointing weaknesses.\n\nfor example. in a team fight, {{champion:222}}  wrecks a team faster. in a 1v1 {{champion:119}}  eats her alive and moves on to her mage, her assassin, and finishes with her tank for style.\n\nit's called a defined role and purpose people. some champs do things differently than others. if they didn't, then im pretty sure every single one of you whiners would be asking why the hell we have 130 champs and all of them fulfill their 5-6 roles in the exact same way.","replies":[{"poster":"Boulderox","date":"2015-10-19T05:56:31.868+0000","up_votes":1,"down_votes":6,"body":"Yes, but aoe is always better late game, and yes although correct, you must have used 90 mana at a point to get two axes and  to keep resetting by catching them. Draven is made to kill. Jinx can kill self peel with 2 abilities, has a steroid passive that helps her snowball more. But an aoe rocket crit on 5 man team is more devastating than one target  for 75% hp. More hp overall is taken from aoe.","replies":[{"poster":"Sinlaire","date":"2015-10-19T09:22:49.668+0000","up_votes":13,"down_votes":0,"body":"your logic is undeniable. but one question.\n\nwhich is better. More DPS laid out in a team fight, or more DPS laid out on priority targets in a shorter amount of time?\n\nJInx's entire character revolves around her twisted personality and penchant for shenanigans and explosions. SHe blows stuff up left and right but her splash damage just creates a wide field of mayhem with her only real focus being whomever the rockets are specifically aimed at.\n\ndraven on the other hand throws a minimum of two axes that hit nearly as hard as 4 autos at the onset of a fight before starting to juggle. meaning 4 attacks from a super high DPS source in half the time of other ADCs. I had a fed draven game just a few days ago where i could 2 shot a master yi and the enemy adc.\n\ncould an equally fed jinx kill them just as quickly? no. but just as definitively? yes. it would just take 1-2 more autos.\n\nthe capacity for jinx to just cause widespread damage that allows herself to spread mayhem for her team to capitalize on with a giant executing rocket is her schtick.\n\ndraven unloading near burst levels of damage with the inclusion of consecutive crits on single targets with an ult that is slightly more reliable for team damage is his.\n\nher autos are aoe with a snipe execute ult. His is single target elimination with a long range execute/ team wide splash damage ult. they all do it differently and it makes their values situational as well as unique. complaining about a power that jinx has while no one else does is opening anyone to a long list of complaints about any champion that has a unique feature.\n\nthese are defining characteristics, not arguably unfair advantages. her rockets arent free. should they be tuned? maybe. but calling the entire situation more advantageous than another for one reason is simply subjective and can easily be destroyed at any time.","replies":[{"poster":"Nsqui","date":"2015-10-19T12:31:16.945+0000","up_votes":2,"down_votes":3,"body":"If we're being completely honest here, a Jinx Crit Rocket hits just as hard as a Draven Q, and it splashes to others. It also has longer range and is not gated by the \"Axe-Catch\" mechanic.","replies":[{"poster":"Sinlaire","date":"2015-10-20T03:01:37.771+0000","up_votes":4,"down_votes":0,"body":"using simple math a {{champion:222}}  rocket does 110% damage. with a crit and no {{item:3031}} it deals 200% damage which with fishbones makes it 220%. with {{item:3031}}  it does 275% damage.\n\nWith {{champion:119}}  lvl 5 Q he does 185% damage on every auto before crits. with a crit and no {{item:3031}}  that puts him at 370% damage. with {{item:3031}}  he now does 462% damage per crit.\n\nthis means that a lvl 5 draven Q will do 35% of an auto worth of less damage on an un crit attack as a CRIT fish bones attack, excluding infinity edge. When JInx has infinity edge herself her attacks will do even less damage than a draven without infinity edge and a draven with infinity edge will deal almost 200% more damage on crit than she does.\n\nso no. her rockets dont even come close to catching {{champion:119}}  axes (pun intended) because riot likes you to work for the exceptional levels of power and utility that they place within a champions kit. Draven's 462% is gated by catching axes, otherwise fishbones out damages him, correct. but she wont even touch him if he does.\n\n{{champion:119}}  doesnt need long range. he just needs \"in range\" and he can handle the rest.","replies":[]}]}]}]}]},{"poster":"FistOfSharkiesha","date":"2015-10-18T22:25:41.483+0000","up_votes":5,"down_votes":3,"body":"The range is the issue though. 700 range + 175% movement speed if she gets a kill or assist makes her extremely difficult to zone or kill. She's free to shred entire teams while the fighters/mages/assassins clean up.","replies":[{"poster":"chipndip1","date":"2015-10-19T03:32:55.777+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=FistOfSharkiesha,realm=NA,application-id=3ErqAdtq,discussion-id=Jf8TaEhE,comment-id=00010000000000000000,timestamp=2015-10-18T22:25:41.483+0000)\n>\n> The range is the issue though. 700 range + 175% movement speed if she gets a kill or assist makes her extremely difficult to zone or kill. She's free to shred entire teams while the fighters/mages/assassins clean up.\n\nAnd if she can't keep at that range because someone breaks through her team, catches her out, or whatever else...she's got VERY little in the form of self-peel. Her E needs to arm, and LoL team fights are done in seconds anyway. She excels on offense, and fails quite hard on defense, and that design philosophy is fine. This is a team game, and you use your team mates to cover your weaknesses. You can't blame Jinx for being good on offense when her defense is nearly non-existent once the enemy gets close.","replies":[{"poster":"Boulderox","date":"2015-10-19T05:59:53.376+0000","up_votes":2,"down_votes":1,"body":"Yet she has 2 self peeling spells, they take time, but usually adcs don't have 1 at all or just one.","replies":[{"poster":"chipndip1","date":"2015-10-19T15:52:04.839+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Boulderox,realm=NA,application-id=3ErqAdtq,discussion-id=Jf8TaEhE,comment-id=0001000000000000000000000001,timestamp=2015-10-19T05:59:53.376+0000)\n>\n> Yet she has 2 self peeling spells, they take time, but usually adcs don't have 1 at all or just one.\n\nThe fact that they take time means that she can't use them for people that get too close (like, a dash's distance or so). You can't use Zap to get out of a bad situation if they already got too close. You CAN use Cait's net, or Vayne's Tumble + Condemn, or Trist's jump or ult, or Graves's dash over a wall, or Lucian's dash over a wall...yea, a lot of people have good options for escaping when people are \"danger close\". Jinx doesn't.\n\nNow, if she sees danger brewing, she can use Zap from long-range and it'll diffuse a situation before it starts, but it's not good when she's actually IN trouble.","replies":[]}]}]}]},{"poster":"junglerboy16","date":"2015-10-19T00:07:41.063+0000","up_votes":2,"down_votes":2,"body":"Not entirely true, since the Pow-Pow AS buff lingers after switching she can actually get her full boost from both rockets and Pow-Pow at the same time, and she only has to switch every few seconds to refresh the buff, effectively allowing her to maintain Rocket output at an absurd rate of fire.","replies":[{"poster":"Cloud Potato","date":"2015-10-19T02:14:05.603+0000","up_votes":4,"down_votes":1,"body":"Using Pow Pow isn't something that's possible in a teamfight without great risk (unless your mid laner hasn't cleared nearby minion waves or something). Which coincidentally is exactly what Riot wanted when designing Switcheroo. Jinx as a champion has limited damage potential with her abilities compared to the majority of other ADCs, so having pretty sweet basic attacking power is perfectly reasonable. But she doesn't get to keep up Pow Pow for free.","replies":[]},{"poster":"JustMyBassCannon","date":"2015-10-19T02:17:37.549+0000","up_votes":2,"down_votes":0,"body":"That's not totally accurate.\n\nHere's how it works.\n\nJinx stacks up her AS on Pow-Pow to 3 stacks. After attacking, she switches to Fishbones and fires one rocket. Now her attack timer is resetting on Fishbones' AS instead of Pow-Pow's, so it takes until that timer is reset before she can attack, whether she stuck with Fishbones or switched back to Pow-Pow.\n\nWow, it feels really weird phrasing it with the weapons' names.","replies":[]}]}]}]},{"poster":"Heckin Support","date":"2015-10-18T23:56:34.047+0000","up_votes":16,"down_votes":0,"body":"> [{quoted}](name=chipndip1,realm=NA,application-id=3ErqAdtq,discussion-id=Jf8TaEhE,comment-id=00010000,timestamp=2015-10-18T21:20:30.447+0000)\n>\n> A lot of adcs don't worry about mana late game so why does Jinx have to be the only one?\n\n{{champion:110}} {{champion:15}} {{champion:104}} {{champion:21}}","replies":[{"poster":"doiminat0r3600","date":"2015-10-19T00:28:39.459+0000","up_votes":4,"down_votes":4,"body":"I wish people would realize that {{item:3508}} is an item that **restores mana from autos**","replies":[{"poster":"Heckin Support","date":"2015-10-19T00:36:07.626+0000","up_votes":30,"down_votes":2,"body":"> [{quoted}](name=doiminat0r3600,realm=NA,application-id=3ErqAdtq,discussion-id=Jf8TaEhE,comment-id=0001000000020000,timestamp=2015-10-19T00:28:39.459+0000)\n>\n> I wish people would realize that {{item:3508}} is an item that **restores mana from autos**\n\nI wish people would realize that that item *sucks*.\nIt's really a waste of money.","replies":[{"poster":"doiminat0r3600","date":"2015-10-19T00:36:41.570+0000","up_votes":6,"down_votes":3,"body":"Restores Mana *and* HP. Seems like its worth it for me.","replies":[{"poster":"YumaS2Astral","date":"2015-10-19T01:54:52.266+0000","up_votes":14,"down_votes":0,"body":"> [{quoted}](name=doiminat0r3600,realm=NA,application-id=3ErqAdtq,discussion-id=Jf8TaEhE,comment-id=000100000002000000000000,timestamp=2015-10-19T00:36:41.570+0000)\n>\n> Restores Mana *and* HP. Seems like its worth it for me.\n\nIt is worth for that, but overall it is outclassed by {{item:3072}} which gives far more lifesteal and survivability.","replies":[]}]}]}]}]}]},{"poster":"Theorchero","date":"2015-10-18T21:35:02.418+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=BlunterMonk,realm=NA,application-id=3ErqAdtq,discussion-id=Jf8TaEhE,comment-id=0001,timestamp=2015-10-18T20:24:24.603+0000)\n>\n> I think you have it backwards, early game her rockets drain her mana pretty quickly. It's late game where jinx players don't have to worry about mana usage at all.\n\nShe doesn't mindlessly spam them early, but she CAN harass with them with little consequence. I'd rather have an Ammo system where when activated she gets 3 shots with her rockets for 60 mana.\n\nEven if that doesn't happen I'd rather the damage modifier be reversed. Aoe damage should deal less to single targets, not more. Her rockets should scale with 90% of her ad.","replies":[{"poster":"kile147","date":"2015-10-19T00:16:27.281+0000","up_votes":4,"down_votes":0,"body":"That would remove a certain depth to her play though, since right now switching between rockets and machine gun can actually slightly increase her DPS if used correctly, whereas with that change she would just leave her machine gun for max DPS. Not saying that this wouldn't be a justified nerf, but it'd be nice if they could dial her back without hurting her depth of play.","replies":[]}]}]},{"poster":"AD Yuumi","date":"2015-10-19T04:34:10.558+0000","up_votes":61,"down_votes":7,"body":"So Jinx's rockets having a mana cost that falls off in significance is actually intended.  I prefer the decision making mechanism behind Jinx's weapon swap to be \"What is the best gun for this situation?\" instead of, \"Am I worried about mana?\" The reason the mana cost is there at all is to gate rockets a bit in lane where the low attack speed is much less of a downside. Mid-late game there's reasons to use minigun.  In early lanes (especially sustain and poke matchups) the cost gets her playing the swapping game when she might normally just use rockets.\n\nThat said, I do feel like Jinx's early mana constraints might not be expressing themselves as much as they should.  \n\nWell then why not increase them?  This really comes down to the question of where are the best places to buff or nerf a champion.  In a world where you can set any champion's win rate between 45-55% purely by adjusting their base health you always have to look and ask, \"While changelist A is a good nerf would change list B be even better?\"\n\nFor Jinx specifically, IF we were going to nerf her (not saying we will or will not), I'd probably want to look at rocket DPS early in a fight.  Jinx is intended to be kind of a force-multiplier sort of hyper carry.  My vision is that you draft a damaged focused team with Jinx that all tries to contribute to getting that first kill ( so 1 support, 1 tank, 3 damage, as opposed to a protect the Kog comp that only defends with 3 supports, 1 tank, 1 damage).  Once someone pops, Jinx gets excited and kills everything.  WOOOO SNOWBALLS.  \n\nRight now it feels like rockets might want to be coming out slower, seems like it's a bit too easy for Jinx to get the first long range kill on her damage alone.  Crazy idea.  What if her Base AS on rockets was waaaaaaay lower, but as she Gets Excited! from kills her damage or AS starts to ramp and get stronger! Dunno, just spit-balling at this point.  \n\nRegardless, things are about to change up pretty heavily with the preseason and there's another part of me that feels Jinx's current strength is simply a product of the hyper-carry, double TP meta.  In a world where any and all early aggression is heavily punished why WOULDN'T characters like Jinx and Vayne be taking over.","replies":[{"poster":"Deep Terror Nami","date":"2015-10-19T04:41:42.602+0000","up_votes":7,"down_votes":2,"body":"I think I saw someone suggest earlier that her Rockets collide with the first unit on the way to the target, so that while there's nothing between them there is no change, but a tank can intercept them and minions can be used to get in the way.\n\nWhat do you think of that? I personally don't mind Jinx's Rockets, but I thought the idea was interesting.","replies":[{"poster":"AD Yuumi","date":"2015-10-19T04:46:18.997+0000","up_votes":41,"down_votes":1,"body":"Actually tried that on her for a couple weeks during development.  Ended up just feeling suuuuper awkward for both parties involved.  Jinx couldn't last hit and couldn't really tell what her rockets would actually do, and enemies had a hard time telling if rockets were going to hit them (or if jinx had even aimed at them in the first place).  On top of that, the rockets already splash so a number of successful blocks would just turn into failures anyways.  Basically a counterplay mechanic that didn't end up feeling good for anyone.","replies":[{"poster":"Lord OwlBear","date":"2015-10-19T14:03:14.033+0000","up_votes":10,"down_votes":1,"body":"honestly while I disagree with some of your ideas here I must point out this is exactly what I feel league needs more of in the forums and elsewhere.... this kind of idea \"spitballing\" with the community I don't see nearly enough of it.... and I understand some people  could be negative and their ideas might not be chosen I think if there were more of what I'm seeing here the community could be a much happier place.","replies":[]}]}]},{"poster":"Jesus is Savior","date":"2015-10-19T09:54:51.007+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=gypsylord,realm=NA,application-id=3ErqAdtq,discussion-id=Jf8TaEhE,comment-id=001f,timestamp=2015-10-19T04:34:10.558+0000)\n>\n>  What if her Base AS on rockets was waaaaaaay lower, but as she Gets Excited! from kills her damage or AS starts to ramp and get stronger! Dunno, just spit-balling at this point.  \n\nI would go with no. Most of the time Jinx \"gets excited\" and gets a pentakill, it's because all 5 targets have one autoattack worth of health remaining, and she just runs up and shoots everyone once. (ie: she has already done most of her DPS for the entire teamfight before killing anyone, and then she cleans up because one dude was out of position, and his death allows her to catch his allies who would have otherwise got away)\n\nIt would basically be a direct nerf with no real benefit","replies":[{"poster":"JnFnRu","date":"2015-10-19T11:09:37.477+0000","up_votes":6,"down_votes":0,"body":"Another option would be to NOT have her stack her q on turrets. \n\nShe's already good at everything, isn't {{champion:18}}  role to blow up turrets?!","replies":[]}]},{"poster":"fasega","date":"2015-10-19T06:33:52.362+0000","up_votes":3,"down_votes":0,"body":"Why not have Q have a higher base mana cost that reduced per rank. So Q would cost 28/26/24/22/20 this way her early laning phase is mana capped but come mid to late game the \"mana cost that falls off in significance\" just like you want.","replies":[]},{"poster":"Saixos","date":"2015-10-19T10:22:03.200+0000","up_votes":5,"down_votes":2,"body":"The way that I see Jinx's strength is quite simple: Out of every single ADC currently in the game, she deals the most late game damage by far, ignoring everything else. And she does that with pretty much no limiter - Kogmaw is super strong, but his W downtime gives windows where the enemy can outdamage him. Twitch can deal massive damage, but is very positioning reliant and thus can be thwarted. Vayne is short ranged and single target. And so on and so forth. Jinx just shoots AOE crit rockets at everyone whenever her team needs her to.\n\nIMO what would really help Jinx would be some kind of limiting factor to her lategame DPS - moving AS onto Get Excited! sounds like one possibility, or shifting rockets over to a charge system from a mana system like corki's ult, anything really. If my team plays it right, I can outdamage Vayne as Sivir late game, but Jinx is just a brick wall of damage late game. **Losing by being outstatted is never fun for me, especially if I know that I'll always be outstatted.**\n\nJust my 2 cents, IMO as long as this specific aspect presists Jinx will always be (possibly too) strong. I hope this was insightful for you in some way c:","replies":[{"poster":"Celeste Benal","date":"2015-10-19T15:44:24.037+0000","up_votes":2,"down_votes":0,"body":"You're being \"out-statted\" because you fell behind. Not because Jinx is OP.","replies":[]}]},{"poster":"Photos of Ghosts","date":"2015-10-19T08:33:41.434+0000","up_votes":2,"down_votes":1,"body":"I think that with all the \"all around\" tools Jinx has for her laning phase, she'd be better off NOT BEING A HYPERCARRY AT ALL.\nI'd see her better with higher base damage on rockets but inability to crit, huge increase in mana cost, higher attack speed from minigun at level 1 and lower at level 18, etc.","replies":[{"poster":"Partholonian","date":"2015-10-19T10:26:14.259+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Photos of Ghosts,realm=EUW,application-id=3ErqAdtq,discussion-id=Jf8TaEhE,comment-id=001f0006,timestamp=2015-10-19T08:33:41.434+0000)\n>\n> I think that with all the \"all around\" tools Jinx has for her laning phase, she'd be better off NOT BEING A HYPERCARRY AT ALL.\n> I'd see her better with higher base damage on rockets but inability to crit, huge increase in mana cost, higher attack speed from minigun at level 1 and lower at level 18, etc.\n\nEither that, or actually weaken her in lane; I feel like the hypercarries that are really dominating right now are dominating because their laning phase isn't actually punishable by people like Lucian (who have fallen out altogether as a result).  Kog and Trist don't see nearly as much play because they actually have weaknesses that offset their strengths.  Why play someone who is weak early and amazing late when you can play someone who is average early and amazing late?","replies":[{"poster":"High5","date":"2015-10-19T19:01:33.562+0000","up_votes":2,"down_votes":0,"body":"That diesn't seem to be the meta at all or Trist was just a bad example.\n\nWe've seen Trist in regional playoffs and at worlds a few times.  She provides a lot b of value in the right team comp.","replies":[{"poster":"My Waifu Vanilla","date":"2015-10-19T19:09:47.089+0000","up_votes":2,"down_votes":0,"body":"The problem is the current meta is just pick a hyper carry adc and win because when both teams have late game adcs....there is no \"bad\" laning phase anymore. The only reason this is allowed is because almost every early game lane bully adc has seen nothing but nerfs  (Graves, Lucian, Corki) which just hives all the \"late game\" adcs a free pass against them since their early games are so close that if they avoid dying more than a few times they will just out scale them.\n\nTl;Dr don't nerf vayne, jinx, trist, etc and instead revert some of the nerfs to the \"bullies\" so they can at least be SOMEWHAT viable picks. Like why would I pick Lucian or Graves who's late game is far worse than jinx/vayne on a gamble I MIGHT be able to snowball against them which probably will not happen.","replies":[]}]}]}]},{"poster":"Sire Hippington","date":"2015-10-19T13:31:35.450+0000","up_votes":2,"down_votes":0,"body":"While i think lowering her Rocket dps wouldn't bee a bad idea, as 90% of the time it is certainly the right gun for the situation, i don't think we should add to such damage boosts to that passive.\nI hate snowball(reset) passive in conjunction with high objective damage, and jinx is a close contender to highest objective damage.\nEven now, if jinx gets to win a fight, she wins it hard, meaning she will cleanup alot kills, leaving her opponents with little defense, and then shred away on any objective with ease, always getting a massive adavantage from a won fight(similar with tristana)\n\nlowering her impact in a no-succes case and increaseing it in a succes case would exagerate that pattern, so you could do well vs her till she gets one good fight 30 min in and sudenly takes a penta and 3 objectives...\nIt's prettymuch the same problem that darius has right now, he has a mechanic with very specific confitions(noxian might and to some extend the heal) and waay to much power is put into it.\nYou see him do not much atall all game long, and then he gets that one fight where he gets an early proc off his passive and just kills everyoe.\nGangplank and his barrles might be another such case.\nHaveing a hard to achive succe scase with way exaggerated payoff isn't healthy for the game imo. It gets close to the '10 width 10missslespeed 1 sec cast time, but 150%maxhealth-truedamage skillshot'.","replies":[]},{"poster":"Athenes Lulu","date":"2015-10-19T07:21:24.763+0000","up_votes":2,"down_votes":0,"body":"The problem here, though, is that she is able to replace the use of minigun completely later game, especially when built enough AD, crit, and atkspd, which throws the decision-making of \"should I use minigun or rockets\" question out of the window especially when she doesn't have to worry about mana later game.\n\nExtra range PLUS AoE crits alone are already excessive, and what, 110% damage? Damn.\n\nEven though I'll put it to this way: any changes on her Q so that players *have* to decide which gun to use, instead of replacing minigun with rocket launcher mid-late game?","replies":[]}]},{"poster":"DontBanMeImDrunk","date":"2015-10-18T19:20:37.707+0000","up_votes":5,"down_votes":29,"body":"If you are increasing her Mana for rockets, you are making it so she can't lay E down as much. I'm all for that. What actually makes jinx incredibly OP is that she has a great self peel mechanic, her E. Its basically as useful as an Ashe ult in most situations, and it has like a 10 second CD.","replies":[{"poster":"commit an hero","date":"2015-10-18T19:52:56.525+0000","up_votes":34,"down_votes":0,"body":"> [{quoted}](name=DontBanMeImDrunk,realm=NA,application-id=3ErqAdtq,discussion-id=Jf8TaEhE,comment-id=0000,timestamp=2015-10-18T19:20:37.707+0000)\n>\n> If you are increasing her Mana for rockets, you are making it so she can't lay E down as much. I'm all for that. What actually makes jinx incredibly OP is that she has a great self peel mechanic, her E. Its basically as useful as an Ashe ult in most situations, and it has like a 10 second CD.\n\nMore like 24 seconds rank 1 and scales down to 16 at rank 5. I am not going to sit here and say that Jinx isn't oppressive at the moment. But if you are going to try to justify a nerf actually look at numbers not a \"like\" so and so.","replies":[]}]},{"poster":"Lugg","date":"2015-10-18T21:47:56.471+0000","up_votes":5,"down_votes":6,"body":"I just love that fact that Jinx's **basic** attack rockets do more damage than Corki's **ultimate** rockets and she can fire them three times as fast.","replies":[{"poster":"The Taco Kat","date":"2015-10-18T22:14:53.223+0000","up_votes":11,"down_votes":1,"body":"Corki has several hundred range on hers, and Corki's does magic damage. He has also been on the slightly weak side for ADC's this season, so it's not even the greatest comparison.","replies":[{"poster":"Lugg","date":"2015-10-19T01:52:02.000+0000","up_votes":3,"down_votes":3,"body":"Corki's rockets at max range aren't that hard to dodge, Jinx's rockets don't miss. Plus her rockets damage per minute makes Corki's damage look laughable. Jinx's rockets can take out a whole team in less that 3 seconds. Corki would take 10 seconds minimum to do the same. \n\nThere is no planet or parallel universe where Corki's rockets are better than Jinxs.","replies":[{"poster":"Dunkrius2g","date":"2015-10-19T02:38:29.402+0000","up_votes":5,"down_votes":0,"body":"You are looking at it on paper. Each have their own purposes. Corki's rocket is on a 2 second cd which can slay towers with Tri force procs. Jinx Rocket can't destroy towers in that manner. Corki is not as heavily reliant on aa than Jinx. Corki has pretty big burst if he lands his Q and R. Jinx is mainly Physical damage. Corki is has all at the same time, True, Physical, and magical. And you will just have to wait for the marksman update and see if Jinx can really get the nerf she deserves or not.","replies":[]}]}]}]},{"poster":"MohawkBird","date":"2015-10-18T21:24:45.442+0000","up_votes":11,"down_votes":5,"body":"***","replies":[{"poster":"FantasySniper","date":"2015-10-18T21:42:14.570+0000","up_votes":4,"down_votes":1,"body":"Besides for the fact that Pow-Pow has much better DPS and attack-move.","replies":[{"poster":"MohawkBird","date":"2015-10-18T22:01:31.552+0000","up_votes":4,"down_votes":2,"body":"***","replies":[{"poster":"The Taco Kat","date":"2015-10-18T22:13:47.056+0000","up_votes":6,"down_votes":1,"body":"Until you have an assassin jump on you and you need to stutter-step away. Have fun doing that with rockets.","replies":[{"poster":"My Waifu Vanilla","date":"2015-10-18T22:35:35.100+0000","up_votes":3,"down_votes":4,"body":"damn i have to instant cast to switch weapons and then once my team either peels him off me or kills him i can switch right back to the rockets.","replies":[{"poster":"Narasimha","date":"2015-10-18T23:45:37.915+0000","up_votes":6,"down_votes":2,"body":">  i have to instant cast to switch weapons\n\nAgainst any competent assassin? Good luck living long enough to do that.","replies":[]}]}]}]}]}]}]}