{"poster":"YumaS2Astral","date":"2015-08-12T21:14:29.012+0000","title":"Is there any problem with solo-lane Lulu?","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"In times and times, I see people complaining about Lulu, saying that she isn&#039;t healthy... And if I am not mistaken, Riot is about to make support itemization changes, once they finish with the ADC itemization changes.\r\n\r\nIs there any problem with solo lane Lulu? Because she has already been nerfed and on my opinion she is balanced... I mean... despite the fact that she has a lot of bullying potential and can scale well on the game and never actually fall off due to her insane utility, she has some weakness that must be noted.\r\n\r\nFirst, her damage potential is low when compared to other mages. In a meta where everything is tanky, Lulu struggles to do noticeable damage against tanks, and due to her lack of damaging abilities and low ratios, it is easy to make her damage laughable with just one magic resistance item. On some matches, I have to rush Void Staff and/or items like Lich Bane and/or Luden&#039;s Echo to be able to boost her damage potential. You can&#039;t just blind pick Lulu. Even though she is technically a safe pick, her low damage potential means that you must think twice before picking her instead of other champions that do more burst damage.\r\n\r\nSecond, she must carefully operate her mana bar. Otherwise she will become OOM because she is very mana hungry early game.\r\n\r\nThird, she has problems against champions that can outrange her or have sustain. On mid lane, Syndra and Xerath are pretty difficult matchups due to their long range. On top lane,  Vladimir is difficult due to his sustain, despite him having shorter range.","replies":[{"poster":"Meddler","date":"2015-08-13T06:14:07.781+0000","up_votes":7,"down_votes":0,"body":"We think solo lane Lulu's in a reasonable spot at the moment. She has been pretty overpowering at times in the past, when she's brought solo lane damage + support levels of utility (rather than a appropriate degree of both), doesn't seem to be an issue with her current state though. Would be nice to see her a bit more in a duo lane again, wouldn't want to bring that about in ways that break her solo laning though.","replies":[{"poster":"Lwnt","date":"2015-08-20T06:37:24.425+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=A5pbVJ2t,comment-id=0001,timestamp=2015-08-13T06:14:07.781+0000)\n>\n> We think solo lane Lulu's in a reasonable spot at the moment. She has been pretty overpowering at times in the past, when she's brought solo lane damage + support levels of utility (rather than a appropriate degree of both), doesn't seem to be an issue with her current state though. Would be nice to see her a bit more in a duo lane again, wouldn't want to bring that about in ways that break her solo laning though.\n\nWell that is what happen when you scale both damage and utility with Ability power; you get a very powerful champion with strong damage and utility. And how you dealt with that problem (that you brought with the Ability power utility scaling) I would always disagree with it. You took away the double q after E which was so useful for lulu support and was being abused by solo lane lulu so you removed it. Reduce the base damage by 80 points on E and the duration of vision of E from 6 second to 4 second. Made the move speed scale on W. Then to top it off the biggest reason what made solo lulu so strong was the slow scaling on her q so you just remove it. Than I dont know why you give her mana scaling as a solo laner rather than a balance for both role. If you see all you did was made support lulu weaker just to balance solo lane lulu. Yes, lulu is viable as a support which didnt make sense because in this meta anybody is viable as support so can you keep nerfing her and she would still be viable. People been complaining about giving us some sort of compensation for all these nerfs but we got nothing even though you guys mention that you are making support lulu weaker. This all started when the whole Ap utility scaling came in and allow support to scale with a stat that you get very little of in very few support items on top of that it is expensive (In other words it was just a huge buff to solo laner lulu because they have the money and they can get a lot of AP). As someone who played support lulu since it came out this pretty much made lulu early game supporting less fun maybe that why you see less duo lane lulu and more solo lane lulu. Well 2 or 3 months ago after waiting more than year for support lulu buff you finally increased her early mana so its balance for support and solo lulu (That riot memeber who made that decision thank you because you actually help support lulu after it has been so long).","replies":[]},{"poster":"UndergroundGod13","date":"2015-08-14T23:44:38.911+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=A5pbVJ2t,comment-id=0001,timestamp=2015-08-13T06:14:07.781+0000)\n>\n> Would be nice to see her a bit more in a duo lane again, wouldn't want to bring that about in ways that break her solo laning though.\n\nSo why not just kill her solo lane?  She was made as a support, and she was one of the most fun ones.  But ever since she got nerfed into the ground because of her solo lane, it's just not worth it to try to play her as support.  I loved lulu, she brought me back to the game after a long break, and she was so exciting and interesting to play.  But now she's been shoved out of the role I loved playing her in and I really miss it.","replies":[]},{"poster":"SpecterVonBaren","date":"2015-08-13T18:49:15.230+0000","up_votes":1,"down_votes":1,"body":"Give her back the ability to shield minions? OuO","replies":[]}]},{"poster":"disregardable","date":"2015-08-12T21:17:35.308+0000","up_votes":2,"down_votes":2,"body":"Having utility doesn't mean you scale well. It means you fall off but still having something else to do. Lulu has a very small window where she is strong enough to actually be a solo laner. If she doesn't get a few kills that period, then bringing her was a waste.","replies":[{"poster":"Lord Dusteon","date":"2015-08-12T21:21:16.417+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=The AFK Farmer,realm=NA,application-id=3ErqAdtq,discussion-id=A5pbVJ2t,comment-id=0000,timestamp=2015-08-12T21:17:35.308+0000)\n>\n> Having utility doesn't mean you scale well. It means you fall off but still having something else to do. Lulu has a very small window where she is strong enough to actually be a solo laner. If she doesn't get a few kills that period, then bringing her was a waste.\n\n...Or the fact her utility scales on AP and she has undodgeable harass and massive amounts of utility means you pick her in a solo lane and get a free ticket to an amazing lategame peel machine with the ratios to provide more utility than support Lulu and enough damage to be a threat by herself.","replies":[{"poster":"YumaS2Astral","date":"2015-08-12T21:23:43.563+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Dusteon,realm=NA,application-id=3ErqAdtq,discussion-id=A5pbVJ2t,comment-id=00000000,timestamp=2015-08-12T21:21:16.417+0000)\n>\n> ...Or the fact her utility scales on AP and she has undodgeable harass and massive amounts of utility means you pick her in a solo lane and get a free ticket to an amazing lategame peel machine with the ratios to provide more utility than support Lulu and enough damage to be a threat by herself.\n\nSo why Riot doesn't just balance Lulu around being a solo-laner instead of trying to make her work as a support?","replies":[{"poster":"Derp Princess","date":"2015-08-12T21:31:28.011+0000","up_votes":1,"down_votes":0,"body":"Because she was intended to be a support who could also be a mage so she'll be balanced like one as she should be... ? Since those are her two intended roles all changes made should reflect those so neither is directly hurt from the other or benefit one side leaving the other side in the dust.","replies":[{"poster":"YumaS2Astral","date":"2015-08-13T16:02:07.879+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Neko Kagami,realm=NA,application-id=3ErqAdtq,discussion-id=A5pbVJ2t,comment-id=0000000000000000,timestamp=2015-08-12T21:31:28.011+0000)\n>\n> Because she was intended to be a support who could also be a mage so she'll be balanced like one as she should be... ? Since those are her two intended roles all changes made should reflect those so neither is directly hurt from the other or benefit one side leaving the other side in the dust.\n\nWell, {{champion:121}} and {{champion:120}} were intended to be top/mid laner and jungler, respectively. However, they were balanced around being a jungler and a top laner, respectively.","replies":[]}]}]},{"poster":"disregardable","date":"2015-08-12T21:24:40.934+0000","up_votes":1,"down_votes":1,"body":"I suppose I'm confused about why you think being a support with a mid laner's gold count is a good thing. There's already an actual support in the game.","replies":[{"poster":"Lord Dusteon","date":"2015-08-12T21:34:26.718+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The AFK Farmer,realm=NA,application-id=3ErqAdtq,discussion-id=A5pbVJ2t,comment-id=000000000001,timestamp=2015-08-12T21:24:40.934+0000)\n>\n> I suppose I'm confused about why you think being a support with a mid laner's gold count is a good thing. There's already an actual support in the game.\n\nBecause as I said her UTILITY SCALES WITH AP. The more AP she has, the better her movement speed buff is, the better her shield is, the better her ultimate's health buff is. If Lulu goes top or mid, she gets a free pass to AP items (doesn't need to rush support item upgrade + sightstone + mobi boots and be 3.5k+ gold in support itemization) to have much higher utility. Additionally, while her damage isn't particularly high it is guaranteed reasonably long ranged point and click. She doesn't need massive damage when her damage WILL hit everytime. So, when she has more gold her guaranteed damage hurts even more and her utility is even greater.\n\n> [{quoted}](name=YumaS2Astral,realm=NA,application-id=3ErqAdtq,discussion-id=A5pbVJ2t,comment-id=000000000000,timestamp=2015-08-12T21:23:43.563+0000)\n>\n> So why Riot doesn't just balance Lulu around being a solo-laner instead of trying to make her work as a support?\n\nProbably because solo lane Lulu is entirely based on undodgeable damage and massive safety. Her laning phase has very low risk and reasonably high reward (as a support style champion you make an assassin or bruiser's job hell. As a support style champion with lots of gold and AP, you make an assassin or bruiser no longer exist while making your adc almost unkillable).","replies":[]}]}]}]},{"poster":"Android Cowboy","date":"2015-08-13T12:48:28.931+0000","up_votes":1,"down_votes":0,"body":"I run AD lulu from time to time, \"machine gun lulu\" has its moments. when {{champion:7}} goes ham on you, then you R > W > Q > E shield yourself, she goes *poof*.... but not the way she wanted to, haha. {{item:3085}} {{item:3153}} {{item:3031}} {{item:3046}} {{item:3091}} {{item:1305}} ","replies":[]}]}