{"poster":"CéciDogg","date":"2014-04-28T14:04:10.952+0000","title":"Üzenet a játékosok magatartásával foglalkozó csapattól","up_votes":3,"down_votes":1,"body":"**Kedves Idézők!**\n\nMi vagyunk a játékostámogatás játékosok magatartásával foglalkozó csapata, és üdvözlünk benneteket a magyar fórumokon! Ebben a bejegyzésben azt szeretnénk összefoglalni, hogy mi a dolgunk, miért kell mindezzel foglalkoznunk, és hogy ti mit tehettek azért, hogy minden idéző jól szórakozzon a játékban. \n\nAz alábbi hivatkozásokon elérhető az összes olyan forrás, amely segít a pozitív hozzáállás kialakításában, illetve útmutatással szolgál azzal kapcsolatban, hogy a League of Legends játékosai mivel járulhatnak hozzá egy pozitív közösség kiépítéséhez.\n\nA kérdések és válaszok fóruma ezen bejegyzés alatt lesz található. A játékosok magatartásával kapcsolatos kérdéseket április 30., szerdán 14:00 óráig várjuk.  A válaszokat május 1-én, csütörtök este tesszük közzé. \n\nAz egyes fiókokra vonatkozó kérdésekre nem válaszolunk. A saját fiókokkal kapcsolatos olyan kérdések esetében, amelyekre az alábbi témakörök nem adnak választ, [itt](https://support.leagueoflegends.com/anonymous_requests/new) tudtok nekünk hibajegyet küldeni.\n\nAddig is vessetek egy pillantást a League of Legends fórumán és a Tudásbázisban már elérhető anyagokra.\n\n**Az Idézők kódexe**\n\nhttp://gameinfo.eune.leagueoflegends.com/hu/game-info/get-started/summoners-code/\n\n**Mi az a Törvényszék, és hogyan működik?**\n\nhttps://support.leagueoflegends.com/entries/32355840-T%C3%B6rv%C3%A9nysz%C3%A9kkel-kapcsolatos-k%C3%A9rd%C3%A9sek\n\nhttp://forums.eune.leagueoflegends.com/board/showthread.php?t=592257 \n\n**Mikor kell jelenteni egy másik játékost?**\n\nhttps://support.leagueoflegends.com/entries/27663580-Egy-j%C3%A1t%C3%A9kos-jelent%C3%A9se\n\n**Mi az a viselkedéssel kapcsolatos értesítő?**\n\nhttps://support.leagueoflegends.com/entries/30661874-Viselked%C3%A9ssel-kapcsolatos-%C3%A9rtes%C3%ADt%C3%A9sek\n\n**Mi az a kitüntetési rendszer?  Hogyan válhatok kitüntetésre érdemes idézővé?**\n\nhttps://support.leagueoflegends.com/entries/31867444-Kit%C3%BCntet%C3%A9si-rendszer-GYIK\n\n**Mitől számít egy játékos pozitív hozzáállásúnak?**\n\nhttps://support.leagueoflegends.com/entries/27198480-H%C5%91sh%C3%B6z-ill%C5%91-viselked%C3%A9s-\n\n**Hogyan működik a LeaverBuster?**\n\nhttps://support.leagueoflegends.com/entries/25974224-J%C3%A1t%C3%A9kok-elhagy%C3%A1sa-A-Leaver-Buster-GYIK\n\n**Mi az a korlátozott csevegés?**\n\nhttps://support.leagueoflegends.com/entries/27663870-Korl%C3%A1tozott-cseveg%C3%A9si-%C3%BCzemm%C3%B3d\n\n**Miért függesztettétek fel a fiókomat?**\n\nhttps://support.leagueoflegends.com/entries/25974414-Felf%C3%BCggesztett%C3%A9k-a-fi%C3%B3komat\n\n**Miért tiltottak ki a fórumokról?**\n\nhttps://support.leagueoflegends.com/entries/30665734-F%C3%B3rum-felf%C3%BCggeszt%C3%A9sek\n\n**Mik a használati feltételek?**\n\nhttp://eune.leagueoflegends.com/hu/legal/termsofuse\n\nVárjuk kérdéseteitek! :)","replies":[{"poster":"Licher1","date":"2014-05-03T14:00:15.333+0000","title":null,"up_votes":3,"down_votes":1,"body":"Azokat a nyomorult magyarokat akik csak anyáznak egész nap meg oktatnak reportolom állandóan érdekes sosem kapnak bant ne ez hogy lehet ezt magyarázzátok meg!;) Ezzel teszik tönkre az egész játék élményt hogy mást sem olvasok csak a sok anyázós hozzá szólást játék közben tudom van ignor de akkor is idegesíti az embert!!! De itt az a legszörnyűbb hogy évek óta játszom és sosem láttam azt hogy akit én reportoltam ilyesfajta hozzászólásokért eltiltásra kerüljön pár napra!! ;)","replies":[{"poster":"Zooty","date":"2014-05-05T14:10:16.296+0000","title":null,"up_votes":3,"down_votes":0,"body":"A mute csodákra képes.:)","replies":[]}]},{"poster":"STYXII1337ER","date":"2014-05-03T16:02:08.307+0000","title":null,"up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"R3wan","date":"2014-05-04T08:19:39.763+0000","title":null,"up_votes":3,"down_votes":0,"body":"Szerintem ha nem megy nekik a játék, te meg lehozod és a végén még beléjük is rúgsz azzal, hogy megköszönöd, hogy amúgy feedeltek, teljesen jogos, hogy elküldenek a náthásba. \n \nA rendszer pedig igenis működik, csak a Riot nagyon türelmes. Nem permabanolnak senkit, mert 1-2 ember reportolta. Először figyelmeztetik, aztán adnak neki pár nap pihenőt stb. Tudom, mert én is csinálgatom néha ezt a törvényszékezést és nagyon kevés esetben volt végleges tiltás. Inkább jellemző a figyelmeztetés és a pár napos szünidő.\n\nEgyébként meg hozzáállás kérdése az egész. Ha flamelsz rájuk, nem lesz jobb, csak felbosszantod őket és magadat is, ami még rontja a helyzetet. Inkább ne is szólj semmit, még az is jobb.","replies":[{"poster":"STYXII1337ER","date":"2014-05-04T08:44:55.672+0000","title":null,"up_votes":2,"down_votes":1,"body":"[](http://www.youtube.com/watch?v=eZ9pQfkShJc)","replies":[]}]},{"poster":"benstone326","date":"2014-05-04T14:45:42.586+0000","title":null,"up_votes":2,"down_votes":0,"body":"A rendszer működik. Hogy nézne ki az, hogy mondjuk te mondasz valamit valakinek, az bereportol és te egyből kapnád érte a time bant? Ha látogatod a Tribunalt, tudhatod, hogy 3,5,6 report után kerülsz be oda és azok a meccsek alapján döntik el, mi lesz a sorsod. Nem nagyon örülnél, ha valakinek nem tetszik a játékstílusod és kapnád a reportot. Kezdő meg mindenki volt és nem lehet mindenki azonos szinten. Megértem, hogy ha valaki nem tud játszani, az maradjon csendben, de ha valaki feedel, mert kezdő, nem feltétlenül kell reportolni. Az, hogy átmentél, a te döntésed volt. Skint nem kötelező venni, ezért is FREE TO PLAY a játék. EUW-nek is megvannak a maga lengyelei/magyarjai, LOW ELO itt is ugyan az. Ugyan úgy EUW-n is vannak feederek, trollok, leaverek stb. Ez a játék, el kell fogadni, ha nem tetszik, reportolod a végén, majd megkapja a büntetését.","replies":[]}]},{"poster":"Sir Wolfud","date":"2014-12-05T01:56:44.425+0000","title":null,"up_votes":1,"down_votes":0,"body":"Sose lesz válasz....","replies":[]},{"poster":"Úristen","date":"2014-06-17T23:38:33.057+0000","title":null,"up_votes":1,"down_votes":0,"body":"Személy szerint sértőnek tartom, hogy egy (elnézést de nincsen jobb szó rá) idóta meg a haverja jelent egy meccs után, mire én azonnal kapok egy dorgálást, hogy \"ejnye-bejnye, oké, hogy éppen rossz napod van, de ne legyek már ennyire rossz arc\".\nPláne bosszantó ez akkor, amikor éppen engem szidott az említett 2 tag. Biztos vagyok benne, hogy a figyelmeztetés arra a meccsre vonatkozott, ebben az esetben nem volt késedelem.\nEzért, szerintem ez a figyelmeztetés felesleges, vagy ebben a formában nem megfelelő. Amíg a törvényszék elé nem kerül az ügy, addig hadd legyek már ártatlan. Köszi.","replies":[]},{"poster":"Kardix","date":"2014-05-22T10:49:25.969+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem is tudom hogyan álljak hozzá... na mind1 valahogy elkezdem:\n\nnemrég kaptam csodaszép 31 meccs erejéig egy chat-bant mondván hogy a rendszer tökéletes és egy szimpla: you are stupid retard miatt ez jár... legyen , ám arról egy rohadt szó nem esett hogy mivan a csapatom 4 tagjával akik 7/24 -es feedbe kezdtek már az első perctől kezdve ráadásul mint mindig egy ranked solo Q-ról van szó..aztán még 2 solo ranked meccsen a jóisten ugyanezeket a feeder barmokat bedobja az én teamembe igaz hogy én az eslő lejátszott meccs után automatikusan megkaptam a büntimet.. szal igen nem értem, mint többek közt azt sem hogy milyen baromság a sima SOLO-Q  ha belegondoltok , tegyük fel kiválóan játszasz a csapatod többi tagja egy agyhalott 20-ad rangú fogyatékkal élő hüllőszármazék akkor mesélje már el valaki, hogy a nyomorúságos életbe hozzam le a meccset mikor olyan feedet kaptak mint, te vagy én 3 adag BigMac menu után? Komolyan RIOT pls , erre a SOLO-Q -ra találjatok már ki egy normálisabb pontozási rendszert mert ez a WIN-ért kapsz LP-t már rohadtul szánalmas. Na köszönöm a figyelmet. Mindenkinek jó játékot!","replies":[{"poster":"benstone326","date":"2014-05-22T20:20:38.018+0000","title":null,"up_votes":1,"down_votes":0,"body":"Welcome to EUNE!\n\nMost lett megújítva a pontrendszer. Eddig az volt, hogy győzelemért kapsz 24 pontot pl., vereségnél levonnak 24-et de volt, hogy 26ot... szal most az van, hogy 20-30 között kapsz valahol pontot és 10-20 között levonnak.","replies":[]}]},{"poster":"DeX TeR HuN Capi","date":"2014-05-12T14:47:06.852+0000","title":null,"up_votes":1,"down_votes":0,"body":"egy olyan kerdessel fordulok hozzatok hogy a holnapi patchbe ki lesz javitva a transzfer ocaniarol valo bug mert mar 3 hete nem kapok valaszt a supportol holnap mar fogok tudni transzferelni ingyen?","replies":[{"poster":"Kardix","date":"2014-05-22T10:52:34.360+0000","title":null,"up_votes":1,"down_votes":0,"body":"Oceania? Kezdem érteni szerintem te az elsüllyedt atlantiszi support teamnek irtál..... XDXD","replies":[]}]},{"poster":"Zooty","date":"2014-05-10T21:10:56.655+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ahogy nézem nem nagyon van hozzászólás/kérdés, csak pár random qq. És igazából én sem értem hogy mit vártok ide.. Kérdéseket hogy a magatartás csapat mivel tölti a mindennapjait, vagy hogy konkrétan mit csinálnak a gonosz és csúnya játékosok megnevelése érdekében? Vagy csak ötleteljünk itt közösen hogy hogyan csinálhatnánk egy szebb és jobb közösséget? Szóval számomra nem egészen világos, hogy mit vártok ide..","replies":[]},{"poster":"NesThaesis","date":"2014-04-28T17:17:52.508+0000","title":null,"up_votes":1,"down_votes":0,"body":"Úgyértitek Május 2ig várjátok a kérdéseket és Május 3 teszitek közzé :) Nem pedig április :)","replies":[{"poster":"CéciDogg","date":"2014-04-28T17:42:06.981+0000","title":null,"up_votes":1,"down_votes":0,"body":"Köszi az észrevételt ! ;)","replies":[{"poster":"NesThaesis","date":"2014-04-28T17:46:54.245+0000","title":null,"up_votes":1,"down_votes":0,"body":"Kicsit hosszú lenne várni 1 évet azokkal a válaszokkal :D","replies":[]}]}]}]}