{"poster":"CéciDogg","date":"2015-06-04T19:15:47.623+0000","title":"Rangsorolt korlátozások","subforum":"Hivatalos bejelentések","up_votes":7,"down_votes":4,"body":"**Sziasztok!**\r\n\r\nEgy ideje a Versenyszerű j&aacute;t&eacute;kkal &eacute;s a J&aacute;t&eacute;kosok viselked&eacute;s&eacute;vel foglalkoz&oacute; csapatok egy&uuml;tt dolgoztak annak &eacute;rdek&eacute;ben, hogy a Rangsorolt meccsek t&ouml;bb sz&oacute;rakoz&aacute;st biztos&iacute;tsanak, &eacute;s kem&eacute;nyebbek legyenek. A Rangsorolt korl&aacute;toz&aacute;s n&eacute;vre keresztelt rendszer korl&aacute;tozza a rossz viselked&eacute;sű j&aacute;t&eacute;kosok meccsbeli cseveg&eacute;s&eacute;t, valamint ideiglenesen eltiltja őket a Rangsorolt meccsektől, am&iacute;g le nem j&aacute;tszanak egy megadott sz&aacute;m&uacute; egy&eacute;b j&aacute;t&eacute;kot. A fejleszt&eacute;st m&aacute;r t&ouml;bb szerveren sikerrel bevezett&uuml;k, ez&eacute;rt az elk&ouml;vetkezendő napokban az EUNE szerverre is elhozzuk azt.\r\n\r\nMiut&aacute;n a Rangsorolt korl&aacute;toz&aacute;s &eacute;letbe l&eacute;p az EUNE szerveren, a b&uuml;ntet&eacute;sre szorul&oacute; j&aacute;t&eacute;kosok addig nem j&aacute;tszhatnak Rangsorolt meccseket, am&iacute;g le nem j&aacute;tszanak egy megadott sz&aacute;m&uacute; Norm&aacute;l draft m&eacute;rkőz&eacute;st. Azt mindenk&eacute;pp szem előtt akartuk tartani, hogy a Rangsorolt meccsektől eltiltott j&aacute;t&eacute;kosok cseveg&eacute;se az egy&eacute;b j&aacute;t&eacute;km&oacute;dokban korl&aacute;tozott legyen, valamint hogy az egy&eacute;b j&aacute;t&eacute;km&oacute;dokban ugyan&uacute;gy lehessen őket jelenteni, ha nem jav&iacute;tanak a viselked&eacute;s&uuml;k&ouml;n. Ugyan&uacute;gy, mint a Cseveg&eacute;si korl&aacute;toz&aacute;sn&aacute;l, az adott sz&aacute;m&uacute; meccs lej&aacute;tsz&aacute;sa ut&aacute;n megn&eacute;zz&uuml;k, hogy javult-e az egyes j&aacute;t&eacute;kosok viselked&eacute;se. Hogyha nem, akkor tov&aacute;bbra is eltiltjuk őket a Rangsorolt meccsektől, eg&eacute;szen addig, am&iacute;g jobb bel&aacute;t&aacute;sra nem t&eacute;rnek. \r\n\r\nN&eacute;h&aacute;ny k&eacute;rd&eacute;s, amit m&aacute;r kor&aacute;bban feltettetek nek&uuml;nk:\r\n\r\nK.: Nem gondolj&aacute;tok, hogy a Norm&aacute;l draft meccsek sz&iacute;nvonala ettől esni fog?\r\nV.: Az adataink azt mutatj&aacute;k, hogy a j&aacute;t&eacute;kosok viselked&eacute;se nagyban megv&aacute;ltozik att&oacute;l f&uuml;ggően, hogy milyen j&aacute;t&eacute;km&oacute;dot j&aacute;tszanak. Mivel a norm&aacute;l meccseken nincs akkora nyom&aacute;s, nem sz&aacute;m&iacute;tunk arra, hogy a j&aacute;t&eacute;km&oacute;d minős&eacute;ge cs&ouml;kkenne. Ennek ellen&eacute;re meg fogjuk figyelni a Norm&aacute;l draft m&eacute;rkőz&eacute;seket, &eacute;s ha &uacute;gy l&aacute;tjuk, cs&ouml;kkenne a sz&iacute;nvonal, l&eacute;pni fogunk.\r\n\r\nK.: Az eltiltott j&aacute;t&eacute;kosok nem fognak trollkodni, feedelni, vagy AFK-zni ezeken a norm&aacute;l meccseken? \r\nV.: Nem, m&eacute;ghozz&aacute; az&eacute;rt nem, mert a Rangsorolt korl&aacute;toz&aacute;s elt&ouml;rl&eacute;s&eacute;hez meg kell nyerni&uuml;k egy bizonyos sz&aacute;m&uacute; meccset, teh&aacute;t a trollkod&aacute;ssal csak magukkal sz&uacute;rn&aacute;nak ki. A Rangsorolt korl&aacute;toz&aacute;s lej&aacute;rta előtt ism&eacute;t leellenőrizz&uuml;k a j&aacute;t&eacute;kosok viselked&eacute;s&eacute;t, &eacute;s ha &uacute;gy l&aacute;tjuk, nem t&ouml;rt&eacute;nt javul&aacute;s, akkor megerős&iacute;tj&uuml;k az eltilt&aacute;st.\r\n\r\nK.: Lejjebb eshetnek inaktivit&aacute;s miatt azok a j&aacute;t&eacute;kosok, akik el vannak tiltva a Rangsorolt meccsektől?\r\nV.: Igen, ez a b&uuml;ntet&eacute;s r&eacute;sze.\r\n\r\n-Riot Socrates","replies":[{"poster":"Tazsam","date":"2015-06-16T14:28:05.876+0000","up_votes":6,"down_votes":1,"body":"Örülök neki ha szépen tisztul az indokolatlan sértegetés/trollkodás/afkolás a rankedről bár az igazi az lenne ha idővel a normál játéktól és úgy eleve a közösségből is kilöknék az arra érdemeseket.","replies":[{"poster":"HubaVok16","date":"2015-06-16T16:28:45.820+0000","up_votes":1,"down_votes":0,"body":"Szerintem az utóbbi viszont hülyeség. Normál játékban az afkolós emberek már büntetve vannak, sértegetés úgyszintén, de had  \"trollkodjanak\" normal game-ben, ilyenkor lehet új hősöket, új metákat kipróbálni, teremteni xD","replies":[{"poster":"Michael King","date":"2015-06-16T23:09:12.296+0000","up_votes":1,"down_votes":0,"body":"Szerintem a feedereket kéne kilökni még. Mert igaz, új metákat lehet ott gyakorolni vagy csak hülyülni. Énis szeretek ott néha hülyéskedni és próbálgatni valamit (néha emiatt vesztünk, de volt már hogy én hoztam le emiatt a játékot).","replies":[{"poster":"Szuzoltó","date":"2015-06-17T06:37:39.738+0000","up_votes":1,"down_votes":0,"body":"Barátom. Mindenkinek lehet rosz meccse. Az lcs is mutat be olyan kiegyensúlyozatlan meccseket, amelyekben a másik félben elég gyenge karakter státuszok vannak. Ha azokra a játékosokra gondolsz, akik csak cipőt, csak egy felszerelést alkalmaznak, vagy szándékosan befutnak turret alá, akkor egyetértek.","replies":[{"poster":"Michael King","date":"2015-06-17T21:20:27.369+0000","up_votes":1,"down_votes":0,"body":"Akkor egyetértesz velem. Mert tudom mindenkinek vannak szarabb meccsei, de amikor szó szerint odahív valakit belelőnek 1-2-t befut turret alá és szándékosan meghall az szánalmas (csak azért mert mondjuk nem mehetett midre és adc-nek kellett lennie). Velem is volt már, hogy first pick voltam, vittem main karakterem, azt hozták a legerősebb counterem, ráadásul tudott is játszani vele =/ így azon a mecsen nemvoltam jó, míg általában hozom a lane-t. De nem adtam free kill-t 1x-sem. Szóval tudom mien. Mondjuk ha szól a csapat 1 embernek, hogy ne menjen vhova egyedül mert pappír és már így is 5x meghalt de csak azért is csinálja bármennyire is kérjük szépen az szintén idegesítő. ((fotóztam már olyat is ranked után, hogy 6db könycseppje volt a srácnak, szóval ment a report oda, hiába nyertünk (enemy-be meg szándékos feeder volt nálunk meg 1 troll, nem volt élvezetes játszani) ))","replies":[]}]}]},{"poster":"RatLoader","date":"2015-06-17T17:53:29.574+0000","up_votes":1,"down_votes":0,"body":"Szerintem Tazsam nem az általad leírt \"trollkodásra\" gondolt, hanem amikor az illető szándékosan öleti meg magát, segít az enemy-nek stb.","replies":[]}]}]},{"poster":"Λ Z R Λ Z Σ L","date":"2015-06-17T10:17:14.741+0000","up_votes":4,"down_votes":1,"body":"Csinálhatnának egy olyat is,hogy ha  valaki Afk-akkor a rendszer vagy a játékosok (x idő után) kidobja és keress egy beugrót a helyére. Erre jelentkezni lehetne  a játékosoknak válallva ,hogy kevesebb lp-t kapnak (bukhatnak) ,mármint aki beugrik. Mondjuk felugrana egy ablak ,hogy ebből a gameből kiléptek,valami infó mellé ,hogy milyen champ-hanyas szinten-stattal hagyta el a gamet,aztán gyors  champ select és megkapná kezdésnek azt a gold mennyiséget amit az afk felszerelése ér,plusz szintben is ott jelenne meg a játékban a beugró. Jönne egy értesítés az ellenfél csapatnak is ,hogy új fiú jött és kb ennyivel meg ennek a módszernek  persze a csiszolásával szerintem el lehetne tüntenni  a 4 v 5 -töt mint okot a bukott meccseknél.","replies":[{"poster":"R3wan","date":"2015-06-17T14:00:38.843+0000","up_votes":1,"down_votes":0,"body":"Sajnos ez nem működne. Te beugr%%%% olyan játékba kiegészíteni, ami már a látható stat alapján veszett ügy? Nem hiszem. Ha valaki szándékosan lép ki, annak oka van. Általában azért, mert reménytelennek látja a helyzetet. Szerintem 10-ből 9 ember elutasítaná, hogy egy ilyen játékba kelljen csatlakoznia. \nAz, hogy megkapná a meglépett játékos aranyát, szintén nem segítene. Ha az ellenfél csapata kövérre van feedelve, ott már semmilyen beugró nem segít. A csapatmorál is jó eséllyel romokban. Szóval nem, ez a beugrós dolog nem életképes, ha jobban belegondolsz.","replies":[]}]},{"poster":"GÁRÉ","date":"2015-06-17T07:51:11.575+0000","up_votes":1,"down_votes":1,"body":"Hát ez kicsit érdekes amúgy mert az az egyetlen probléma hogy sokan kamuból reportolnak és a rendszer ezt nem tudja ellenőrizni , viszont  oké hogy kiszedik a trollok nagy részét viszont a kamu report gáz mivel már mindenért reprortolnak ha írsz ha nem ha vesztett ha nyert ha kseltél és még sorolhatnám és a rendszer ezt telibefossa. Mert csak összegyűlik  egy adott számú report és good bye ranked szóval véleményem szerint ezt kéne valahogy megoldani.","replies":[{"poster":"S0ldierOfAllah","date":"2015-06-17T12:01:51.143+0000","up_votes":1,"down_votes":0,"body":"Még jó hogy, mindenki reportot kap. ha én vesztek egy meccset, a sok %%%%%% feeder, és noob miatt még szép hogy az enemy is reportot kap nem csak a csapattársaim. Hisz ha azt nézed, az ellenfél nem azért nyert mert annyival jobbak voltak ha nem mert az én csapatom volt szar. így ők nem érdemlik a wint. szal mehet nekik a report.","replies":[{"poster":"Conander","date":"2015-06-17T13:47:42.619+0000","up_votes":2,"down_votes":0,"body":"Hát én téged se engednélek addig rankedezeni, amíg azt az alap dolgot nem tanulod meg, hogy mindig van egy győztes és vesztes CSAPAT. Természetesen minden ember más, vannak a szintjükhöz képest erősebb és persze gyengébb játékosok. Most csak azért reportolni valakit, mert épp nem ment jól neki baromság. Abba nem gondolsz bele, hogy lehet az a \"feeder\" akit te annak gondolsz csak azért kap ki ennyire látványosan, mert lehet az enemybe van egy smurf? Vagy mert egyszerűen csak gyengébb, és még tapasztalatra van szüksége? Ez egy csapatjáték fel kéne fognia ezt végre mindenkinek, és ha látjuk, hogy valakinek nem megy annyira, nem reportolni, hanem tanácsokat adni kéne neki, hogy jobban menjen neki legközelebb. Persze a másikat cseszegetni, meg lenézni sokkal könnyebb mint segíteni, de ne feledd te is voltál kezdő, te is voltál friss rankedes. Te mit szóltál volna hozzá, hogy ha az első pár rosszabb meccsed után letiltanak rankedről, vagy a játékból, mert mindenki reportolt volna? Először gondolkozni kéne, és csak aztán neki állni itt osztani a jónépet arról, hogy ki miatt vesztesz. Le merek fogadni, nem is a feederek és a noob-ok miatt vesztesz, hanem mert ha látsz egy gyengébb játékost azonnal ráfüggsz a chat-re mint majom a faágra és nem a játékra koncentrálsz. Kicsit gondolkodj el ezen, hogy akkor kik és miért is érdemelnek reportot. Remélem tudtam segíteni a szemléleteden és nincs harag az őszinteségem miatt. :)","replies":[]},{"poster":"Solinna","date":"2015-06-17T12:43:01.605+0000","up_votes":1,"down_votes":0,"body":"Ez hülyeség. Az ellenfél csapatát mégis minek kellene reportolni, amikor nem az ők hibájuk, hogy a másik csapatban van egy olyan kedves, értelmes játékos aki afk? Ők az okosak, ha kihasználják. Ugyanúgy ha te játszol, akkor te is örülsz ha Ti vagytok azok akik előnnyel indulnak a másikokkal szemben..","replies":[]}]},{"poster":"Great Pasa","date":"2015-06-17T08:30:12.579+0000","up_votes":1,"down_votes":0,"body":"Nagyon igaz amit irtal. En sem ertem miert kell normal gameben reportal fenyegetozni...eleve nem ertem igazabol. Tegnap epp  tortent h a csapathet miatt forumon keresztul meghivtak csak magyarokkal jatszottunk es elveszti a leanyzo a lanet ami nem baj meg senkit nem is izgatott de meg o kezdi el szidni a tobbi csapattagot h miert nem segitunk (segfejezes es stb) egy jo 10 percen keresztul csak szidott mindenkit tortenetessen testverem megunta es elkuldte oda ahova valo es a jatek vegen a nagylany reportolta a tesom akinel ki is irta h zaklatas miatt lett reportolva. nah akkor itt hol is fair ez a rendszer?( Bar igazabol 27 win volt neki normalban ugy h szerintem meg abban a fazisban van h o a legjobb es ha elront valamit mas a hibas.)","replies":[]}]},{"poster":"Ricse","date":"2015-06-17T13:21:53.666+0000","up_votes":2,"down_votes":0,"body":"nekem egy olyan kérdésem lenne hogy ha úgy kapom a reportot hogy nem érdemlem meg azt is számba veszik ?","replies":[]},{"poster":"Khorne Flakes","date":"2015-06-17T09:22:04.623+0000","up_votes":2,"down_votes":0,"body":"Sziasztok!\n\nNagyon helyes, végre valami bünti, már kellett. Mi is szoktunk trollkodni tegnap pl csak adc-vel mentünk 5v5-re a poén az hogy 5ből 3at nyertünk de ranked az más.   Az a probléma hogy dájmondtól kezdve van a jó gamelés még platba is olyan szerencsétlenek vannak hogy nem értem hogy jutnak fel, pl. plat 2-es adc, ütik a nexusunkat elmegy farmolni, a következő játékba biztos jól jön az a +cs vagy én nem tudom. Most az ilyet hogy reportoljam? És beírja hogy ő funolni jön.","replies":[]},{"poster":"Scheliux","date":"2015-06-16T20:49:19.857+0000","up_votes":2,"down_votes":1,"body":"Még azért lehetne valami olyan hogyha valaki AFK-ol a mi csapatunkban akkor ne vonjon le lp-t, mert nem a csapat hibája, hogy bukjuk, hanem csak azé az egy emberé...","replies":[{"poster":"Nerium69","date":"2015-06-17T09:08:19.937+0000","up_votes":2,"down_votes":1,"body":"Nézz meg egy Dota meccset minden meccsen kilépkednek. Undorító szerinted itt mi lenne ha vesztésre állsz valaki kilép azt cső. Tönkre tenné a játék élményét. az AFk kérdés igen kényes téma, hogy lehetne jól kezelni","replies":[]}]},{"poster":"Hencila","date":"2018-04-04T16:32:19.064+0000","up_votes":1,"down_votes":0,"body":"Hát nagyon jól megoldjátok.... egy egyszerű kérésem volt az egyik társam felé aki elkezdett velem vitatkozni konkrétan a semmin, majd másik két társa is elkezdett nekem flamelni mert kiderült, hogy 3 premade játszik a csapatban és akkor én kapom a bant...\nA történet annyi, hogy a master yi junglerünk gankelt boton csak a killekért, mire MEGKÉRTEM hogy hogy ne ő vigye el az összes killt mert ha late gameben ő meghal akkor simán vesztünk mert a többi nincs feedelve és akkor erre kezdtek el nekem flamelni megállás nélkül  és akkor én kaptam 10 meccsre szóló csevegési korlátozást.","replies":[]},{"poster":"Oil55","date":"2015-06-17T07:36:53.375+0000","up_votes":1,"down_votes":0,"body":"Hálás vagyok, kezdett kiakasztani az állandó rettegés -ami miatt már rankedozni sem volt kedvem-, hogy megint egy destruktív csapattárs miatt bukok vissza, vagy ismét egy toxikus hozzáállású egyén teszi tönkre a morált és vele együtt a játékot is. Nem az a fontos, hogy megnyerjem az összes játékot, de az fontos, hogy minden játékot legyen esélyem megnyerni, legalább az elején. És az a meglátásom nekem és az ismerőseimnek, hogy a legutóbb játszott rangsorolt mérkőzéseink minimum felén (!!) volt afk, troll, vagy valami hasonló viselkedésű játékos. Így eléggé ellehetetlenített minket az előrébb jutástól. (megemlítem, hogy Silver 2-ben vagyok)\nÍgy ismét csak köszönetemet tudom kifejezni, hogy léptetek ez ügyben. ;)","replies":[{"poster":"csilinko","date":"2015-06-17T19:12:57.816+0000","up_votes":1,"down_votes":0,"body":"Nem kötözködésképp írom, de a te szavaidból az jön le, hogy 0%-ban vagy hibás azért mert S2-ben vagy és egy meccs se miattad ment el.. Nem hiszem hogy pont te vagy a tökéletes lény aki sosem hibázik :D ha ezen elgondolkozol akár egy percre is, talán jobban odafigyelsz és vesztett meccsnél inkább próbálsz tanulni a jobbtól/saját hibáidból. Ha ezt megteszed és az első rossz szónál inkább muteolod a csapattársad és kikapcsolod az all chatet, előrrébb fogsz jutni. Ha pedig ragaszkodsz ahhoz, hogy nem rajtad múlik a meccs (mert ugye one man carryt senki sem látott még csapatjátékban..) csak mindig más bassza el, ott fogsz maradni silverben.","replies":[{"poster":"Oil55","date":"2017-01-30T22:14:22.857+0000","up_votes":1,"down_votes":0,"body":"Akkor egyáltalán nem értetted meg amit írtam. Mondjuk ez látszik is abból amit válaszoltál...\nNem azzal van gond, hogy valaki hibázik. Én is szoktam, de még mennyit. Hanem ha valaki direkt szánt szándékkal öleti meg magát számtalanszor egy meccsen, mert ezt élvezi, vagy elmentek neki otthonról. Ilyenből akadt túl sok akkoriban, és ezt írtam le.\nSajnálom, hogy nem tudtad megérteni amit leírtam, legközelebb majd talán sikerül. :)","replies":[]}]}]},{"poster":"lensz","date":"2016-02-14T13:58:27.453+0000","up_votes":1,"down_votes":0,"body":"Ahogy itt olvastam a hozzáoszlásokat  nekem is megfogalmazódott pár gondolat a fejembe. Szeretem nagyon a játékot, de a közösség  viselkedése egymással sokszor mérhetetlenül ocsmány. Én pl azt utálom mikor 10 másodpercnél már megy az agyázás, mert össze kaptak valamin,  pl: valaki nem azt a varázslatot   választotta, amit neki elképzeltek.  vagy van a csapatba egy menőmanó, akit te támogatsz be is véded, de ennek elenére mivel nem fogta fel, hogy ő mindjárt kinyúl és kenet kevesek vagyunk adott szituációban kidől és engem szidd, hogy mért nem segítettem neki. sokan csak eszetlenül a kiilletek gyülemlik és a csapatott szidják jön össze. Ha viszont taktikusan jól kommunikálva egymáshoz türelmesen játszunk, akkor jó meccs szokott kerekedni. Én  akkor szoktam jelenteni, ha valaki agresszív a csapattal, de  az esetek 90%-ba olyan csapatba kerülök ahol valaki szídd valakit Ez teszi rosszá az amúgy jó játékot!","replies":[]},{"poster":"drén","date":"2015-08-06T23:30:20.245+0000","up_votes":1,"down_votes":0,"body":"Hát én nem tudom,hogy ezt hova kéne írjam...de most már ideje leírnom,hogy naponta a 20-30 meccsemből minimum a 40%-án olyan embereket kapok,akik direkt: \" i go troll i don't care\" stb stb stb...játékélmény 0...Köszönöm riot,hogy még mindig nemlehet kiszúrni az ilyen szerencsétlen vadbarom,állatokat,akik ennyire elcseszik a játékélményt és kedvet...én most letörlö egy ideig,talán egyszer feltelepítem,h majd jobban kilehet szúrni az ilyen szarházi senkiket...már elnézést az obszcén szavakér.További sok szépet és jót.","replies":[]},{"poster":"Setroom","date":"2015-07-20T09:52:47.116+0000","up_votes":1,"down_votes":0,"body":"Hello , egyszer már le játszottam a 35 draft ( win-t) mire újra tudtam rangsorolt  játékot játszani tegnap mentünk 5-6 mecset mire meglett hajnalban a promom és erre megint kapok 1 chatban-t (75 játékkal) és a rangsorolt felfüggesztést... jó lenne tudni hogy miért kaptam semmi indok nincs megadva és nagyon nem tartom helyesnek hogy ilyeneket kapok... Támogató  vagyok ,ha negatívan viselkedem annak megvan az oka, azért mert idiótákkal vagyok és megmondom nekik, hogy mit vegyenek ,nézzék vissza a mecset vagy nem tudom de én ebből így nem kérek hogy havonta ez el játsszuk. Örülnék ha eltávolítanák ezeket a \"büntetéseket\" .","replies":[]},{"poster":"SBSzilárd","date":"2015-06-28T17:15:02.503+0000","up_votes":1,"down_votes":0,"body":"Koszonom szepen  rito hogy egy gamen keresztul nem csatlakozhattam a jatekhoz allitolag valamilyen problema supportba a vegen meg kapok 5 meccses leaver bustert ???? hol itt az igazsag ??? varom a valaszt riot tarsasag !!!!","replies":[]},{"poster":"P6atrk","date":"2015-06-17T15:37:12.482+0000","up_votes":1,"down_votes":0,"body":"Egy problémám van csak ezzel. Még így is kommunikálni kell a csapattársakkal, így én vlmilyen kezdetleges chatrendszert hoznék létre a játékon belűl azok számára akik erről le vannak tiltva. Megadott betűkre/ikonokra a képernyőn kattintva megadott szöveget írnának/íratnának be a chatbe.\npl: gj / ggwp / gank etc.","replies":[{"poster":"TheMostLegend","date":"2015-06-18T01:23:46.137+0000","up_votes":1,"down_votes":0,"body":"Az ötlet nem is lenne rossz, de ez a gj / ggwp felesleges.\n\nNem a legfontosabb dolog ami meghatározná a csata kimenetelét. A gank az például nem egy hülyeség.","replies":[{"poster":"P6atrk","date":"2015-06-19T19:26:27.672+0000","up_votes":1,"down_votes":0,"body":"Persze ezek csak példák voltak, gondolom a Riot (ha eljut vlmilyen varázslatos modozatban ez a komment hozzájuk) akkor szakártő kezekkel fognak hozzányulni.","replies":[]}]}]},{"poster":"ToxicalHUN","date":"2015-06-17T06:53:39.974+0000","up_votes":1,"down_votes":0,"body":"szerintem a rendszeren van mit fejleszteni, Bőven.\nRengeteg ember nem csinált semmit a világon mely eltiltást érdemelt volna, mégis Rengeteg ember kapott eltiltást.\nVan még ezen fejleszteni való bőven","replies":[{"poster":"Shirodrake","date":"2015-06-18T13:47:16.911+0000","up_votes":1,"down_votes":0,"body":"Ha valaki jogosan kap büntetést, akkor azt fogja hangoztatni a fórumokon és közösségi oldalakon, hogy: \"Sajnálom, hogy rosszat tettem és megérdemlem a büntetésem\"\nVagy pedig azt, hogy: \"Hát nem csináltam semmi rosszat,  mégis bannoltak\"\n\nAz érintettek 95%-a úgy vélem az utóbbit fogja.","replies":[{"poster":"TheMostLegend","date":"2015-06-18T20:12:10.392+0000","up_votes":1,"down_votes":0,"body":"Vagy van az a személy mint én aki a kettő keveréke.\n\nSajnálom hogy rosszat tettem és megérdemelném a büntetésem, de nem csináltam olyan sok rosszat, hogy oly horribilis kezdőbüntetést kapjak, mint amennyit kaptam.\n\nÉs ezzel nem csak én értek egyet, de a rendszer ilyen. Ezen változtatni senki sem fog.","replies":[]}]}]},{"poster":"Shirodrake","date":"2015-06-18T15:20:21.056+0000","up_votes":1,"down_votes":0,"body":"Érdekes hozzászólásokat sikerült olvasnom mind a főoldali hírnél, mind pedig itt a fórumon.\n\nA két leggyakoribb:\n> \n> Sok ember jogtalanul kap most korlátozást.  \n\nMár az elmúlt években is nagyon sokan kaptak bant, chat korlátozást, vagy egyéb büntetést mindezt természetesen jogtalanul.\n\nVallják az érintettek. \n\nTermészetesen van némi hiba százalék, de véleményem szerint, ez elég csekély.\nÁm akár milyen kicsi, a tény, hogy létezik adja a lovat azok alá, akik felháborodnak az amúgy jogos büntetésük miatt.\n\n---\n> Miért a flamereket büntetik, amikor ők hívják fel a figyelmet a trollokra és a feederekre?\n\nHa ketten a küszöbre szarnak, akkor te is? Hátha akkor már elég nagy lesz a kupac, hogy a házmester megfontolja  a feltakarítását?\n\nA másik dolog, hogy nem is olyan rég olvashattunk egy hírt amiben a trollok és feederek kiszűrése volt a téma.\n\nA harmadik, hogy néhányan a flame-ek miatti sértődések okán kezdenek el trollkodni, illetve feedelni.\n\nSzóval a Riot foglalkozik mindkét problémával, csak hát ezeket külön kezeli.\n\nA másik másik dolog, hogy egy olyan nagy elem számú rendszer esetében, mint  a League of Legens játékosok közössége voltaképpen lehetetlen a hibaszázalék nélküli megoldás. \n\n\n\n> az adott számú meccs lejátszása után megnézzük, hogy javult-e az egyes játékosok viselkedése. \n\nÁm úgy néz ki egy ellenőrzés alatt álló rendszerről van szó. Remélhetőleg az ítéletet emberek hozzák.\n\n\n---\n> Dehát én csak annyit mondtam, hogy noob \n\nSzóval flémeltél. Ez van fogadd el  a büntetésed.\n\nAz egész oylan mint a pillangó hatás, az egyszerű sértésekből igen durvák keletkezhetnek\n\n---\n\n> 20-30 normál draft win és 60-70 chat korlátozás egy kicsit sok\n\nA büntetések egyik  célja alapvetően az elrettentés.   A másik pedig a nevelés.\n\nHa már csak a tény ismeretében a játékosok csupán egy része visszafogja a vérmérsékletét, az máris javulásnak tekinthető.\n\nAki meg már megkapta, rá van kényszerítve a pozitív irányú változásra és van lehetősége gyakorolni.\n\nA másik dolog (Hát már megint egy?), hogy habár a League of Legends ingyenes, rendelkezik fizetős szolgáltatásokkal is. (amik nem nyújtanak előnyt)\n\nÉn pl eddig majdnem 20.000Ft-ot költöttem a skinekre. Magyar szemmel ez nem egy rossz pénz, de világszínvonalban igen csak alsó kategória. \n\nTehát sokan költöttek rá sok pénzt és hát köztük is vannak bomlasztó egyének.\n\nHa ez elrettenti őket a negatív viselkedéstől, akkor elkerülhetik a perma bant és, hogy a befektetésük kárba vesszen.\n\n---","replies":[]},{"poster":"TheMostLegend","date":"2015-06-18T01:21:02.482+0000","up_votes":1,"down_votes":0,"body":"Csak tisztázzuk az értelmét ennek a chatban és korlátozás dolognak. Talon irogatta nekem (ashe), hogy szoktam-e használni ultit. Gondoltam leírom neki, nézd azt a zöld pöttyet ott, most is szürke. Nem sikerült.\n\nMegvártam azt a 10 sec betöltődési időt, és átlőttem a társamon azaz Talonon, hogy ha már írni nem tudok neki hagy lássa. De azért a biztonság kedvéért még egyszer lőttem egyet talon közelében, ott az űrt céloztam meg.\n\nÍgy is lehet játszani. De ha egy karakter káromkodik, vagy flamel, akkor ott a Mute. Ti ezt \"bomlasztásnak\" hívjátok, és azt mondjátok rontja a csapat morált, amit azzal jutalmaztok, hogy adtok egy chatbann illetve korlátozást ajándékot, ami már alapon azzal kezdődik, hogy az én morálomat rontja el.\n\nTény hogy jó játékos vagyok, és 1-10-ről is visszahozom a meccset 12-16-ra, de ez nem mentség általánosságban. Ha valakit 0 morállal küldtök be játszani, ott nem lesz jó vége.\n\nu.i: Síró görcsöt kaptam a röhögéstől amikor valaki elkezdett flamelni, miközben rajta is chatbann volt, így ezzel azt kockáztatván hogy a büntije megújul :D\n\nHa nem felejtem el mindig úgy kezdem hogy 00:00 mindenki mute. => ez is rontja a csapat morált rendesen.\n\nEgy olyan eset is előfordult, hogy írtam volna hogy XY megy midre... aztán \"következő üzenetet ekkor küldhetsz.. \". Mondom magamban na jól van, akkor RIP... és bele is halt a mides.\n\nPingelni hiába pingelek, azt nem mindig veszik komolyan.","replies":[{"poster":"TheMostLegend","date":"2015-06-18T01:23:09.880+0000","up_votes":1,"down_votes":0,"body":"Mondjuk azt rendesen elfelejtettem leírni hogy Draft Pick normal a játékosok legalább 50%-a akikkel játszottam \"i can't write, cause i got chatbann\".","replies":[]}]},{"poster":"Nerium69","date":"2015-06-17T09:06:25.484+0000","up_votes":1,"down_votes":0,"body":"Szerintem ez egy remek kis funkció és teljes mértékben szükséges is. Csak ha utolsó rangsorolt meccsemre gondolok ahol az ADC 4 cipőt vett mert miért ne, Bár a midesről is beszélhetnénk aki minket szid mert kikap miden :) Az ilyen játékosoknak nem szabad rangsorolt meccseken lenni, mert ugyan ez egy játék azért fel tud agyilag küldeni a plafonra és nem a vereség. Szerintem tisztességes kikapni természetes és ösztönző, hogy legközelebb jobban játsszak de így kikapni ... Tehát én örülök ennek és legyen minél szigorúbb,","replies":[{"poster":"TheMostLegend","date":"2015-06-17T20:42:58.495+0000","up_votes":1,"down_votes":0,"body":"Ez a büntetés kifejezetten csak \"bomlasztó\" játékosoknak van.\n\nHa nem szólal meg chaten nem fog korlátozást kapni.","replies":[]}]},{"poster":"MrNexusZ","date":"2015-06-17T16:22:16.326+0000","up_votes":1,"down_votes":0,"body":"Egy ötlet: Növeljük a Ranked színvonalát azzal hogy az új HŐSISMERET rendszerrel kiegészítjük azt a lvl30 16 champet....Mondjuk legyen lvl30 16champ ami minimum 5ös színtű, és csak 5ös színtű champet lehessen pickelni. Kevesebb feeder kevesebb flame!\n\nTovábbá ha ennyire fejleszteni akarnak a report rendszeren, legyen már Trollkodásért is report, mert akkor talán nem érdekelne ha lvl3mon úgydönt a jungelesünk hogy bejön mellém midre farmolni mert nem segített neki a toppos elkezdeni a frogot, és akkor még én kaptam 4 reportot mert feddeltem a pénzhiány miatt ! És ilyenkor persze én kapok 4 reportot a jungeles 1et tőlem és máris mit lát a rito \" te ez a gyerek kapott 4 reportot bűntessük meg, a másik gyerek csak egyet kapott őt hagyjuk\"......\n\nNa meg még mindig a legnagyobb gondom: tudok játszani hétvégente kb 6 meccset, most kaptam 35 ranked eltiltást, amit persze CSAK WINel tudok ledolgozni, ha mondjuk 50% win ratel lejátszom az összeset akkor szeptemberben már tudok is játszani rankedet ;( addigra meg milesz visszadob bronze5be inaktivitás miatt vagy mi? azért jólenne ha erre is gondoltak volna nem csak a nolifer kockákkal számolnának akik 0-24ben verik a billt.\n\nJa és mégegy bökkenő....mostantól mindenki verbal abuse reportot fog küldeni mindenkinek hogy meg sz**assa... természetesen erre már énis rájöttem, úgyhogy megy az instantreport mindenkinek bosszúból amiért egy meccsért kaptam 35 ranked eltiltást! ennyit erről....","replies":[{"poster":"csilinko","date":"2015-06-17T19:00:08.249+0000","up_votes":1,"down_votes":0,"body":"jah, lvl 5-ös 6 AP carry és 10 ad carry esetén ha supportot kell hoznia pickel egy dravent? :D","replies":[]}]},{"poster":"firefist","date":"2015-06-17T07:08:43.303+0000","up_votes":1,"down_votes":0,"body":"Ez mind szép és jó lenne nem is lenne vele problémám, csak nem egészen megnyugtató, sőt ... Mikor azelőtti nap este alig használom a chatet megnyerem a promómat, sikeresen feljutottam én hoztam le sivirrel 100 hp-n múlt a pentám, de nem ezen van a hangsúly, hanem hogy másnap délelőtt arra kell feljönnöm hogy 35 ranked eltiltás és 75 chatban, mégis miért mert reportoltak mikor lehoztam és nem is flameltem ? tegnap is premade botot játszottunk egyszer nem szóltam senkihez, mondjuk chatbannal elég nehéz is... és erre jön a report hogy zaklatás sértegetés mikor semmit nem csináltam csak lehoztuk a játékot újra, akkor kérdezem én hogy kaphatok reportot és figyelmeztetést ha nem is használtam a chatet ?","replies":[{"poster":"HunOrionHun","date":"2015-06-17T17:09:30.434+0000","up_votes":1,"down_votes":0,"body":"Sokan jelezték, hogy ok nélkül kaptak, így feltételezhető, hogy még hibás a rendszer.\nReméljük hamar megoldják.\nEngem most ez ijesztett meg, hogy mindenki ok nélkül kap, így most nem merek rankedezni, mert félek, hogy én is kapok xD","replies":[{"poster":"csilinko","date":"2015-06-17T18:58:23.548+0000","up_votes":1,"down_votes":0,"body":"Aki ok nélkül kap reportot az nem fog punisht kapni... napi 10-20 reportolt embert lehet elbírálni ha elértél soloQ-ban egy szintet. Van Pardon/Punish/Pass gomb, teljes chat stb stb.\n\nHa kapsz verbal reportot de semmit se írtál nem kapsz majd bant.. szimplán ennyi\n\n3/7-re hiába reportolták szegény feedre, mikor átolvasva a chatet kiderült, hogy a jungler volt aki elbaszta és minden lane kikapott, ellenben a 0/32-es teemo topnál nem volt szükség elolvasni semmit :D","replies":[]},{"poster":"MrNexusZ","date":"2015-06-17T17:16:22.666+0000","up_votes":1,"down_votes":0,"body":"Nem ok nélkül, én pl azért kaptam emrt elkezdett flamelni a csapattársam én meg visszírtam neki h okokok, aztán kb minden osztására ennyit írtam h okokokok, meg amikor meghalt írtam h gg, és mindez aramon. ennyi, már megvédeni se szabad magad, szóval játsz nyugodtan csak kussolj :D De lehet azért mert előtte rankeden 3 percnél megölte pirosnál a jungelesem az enemy jungeles( miközben én épp kezdőn voltam) és engem kezdett el osztani a saját csapattársam hogy nem segítettem neki és meghalt, úgyhogy ő elmegy afkolni, amire én csak annyit tudtam írni hogy ok go afk... fél perc múlva csak annyit láttam hogy csávó leave a maradék 3 csapattársam meg engem oszt hogy miért flamelek report mindenki... :D","replies":[{"poster":"firefist","date":"2015-06-17T18:39:43.623+0000","up_votes":1,"down_votes":0,"body":"Hát az a helyzet hogy én már a chatet sem fogom használni ugye chat ban van meg minden próbálom leküzdeni a 75 meccset ... annyit irtam előző játékba hogy miért nem vártál meg és reportot kaptam zaklatásért mi van itt emberek már komolyan ? a chatet sem szabad már használni ?","replies":[]}]}]}]},{"poster":"Rαpe Of Sirens","date":"2015-06-16T14:05:53.175+0000","up_votes":0,"down_votes":0,"body":"***","replies":[{"poster":"Vampire HUN 96","date":"2015-06-17T11:14:10.270+0000","up_votes":1,"down_votes":0,"body":"0 Csak lvl 30 és 16 champ kell... ez a baj","replies":[{"poster":"HunOrionHun","date":"2015-06-17T16:35:38.667+0000","up_votes":1,"down_votes":0,"body":"250 normál wines korlátozást betehetnének :D\nVan egy ismerősöm akinek 12 normal winje van, level 30, és most kezdett bele a rangsorolt játékokba (természetesen a sikertelenségek tömege várt rá, mivel hozzászokott a kezdőbotokhoz-Bronze V)... na tudom ez egy elég extrém eset, mivel amíg elérte a 30as szintet, az addigi játékainak 95%-a botok ellen volt(elég ritka eset), viszont vannak akik ~80 winnel indulnak rankedezni amint elérték a 30as szintet.. ez nekik sem jó, és másoknak sem :/","replies":[]}]}]},{"poster":"TheMostLegend","date":"2015-06-14T00:01:56.119+0000","up_votes":1,"down_votes":1,"body":"Mielőtt betesztek egy ilyet érdemes lenne megfelelően megbütykölni és ne úgy, hogy kapjak egy ilyen ajándékot:\n\n35 ranked és 75 sima chatban a semmiért.\n\nMost felmerülhet benned a kérdés, vagy bennetek, hogy: \"Na persze, a rendszer úgy sem osztogat feleslegesen\". Erre a válaszom: dehogynem.\n\nCsak pozitív dolgokat kaptam eddig, érdekes hogy most elsőre kaptam egy negatívat. Egyfajta megalázásként ért ez tőletek.","replies":[{"poster":"Mchalszvaze","date":"2015-06-17T14:32:52.499+0000","up_votes":1,"down_votes":0,"body":"Mindig ez van... a RIOT  próbál valamit kitalálni, minél gyorsabban mert sok a panasz erre meg arra.\nGyorsan bedobnak valami  f,st és azt hiszik ezzel minden probléma megoldva.\nAkármilyen divízióban vagy átlagosan 10 emberből  a mérkőzés végén  5 reportol. \nEbből az 5 ből kb 1 igazságos a többi kamu report.... ha egy kicsit matekozunk hamar kilehet számítani ha egy nap mondjuk 5 rankedet játszom/játszol mennyi az esélye hogy már aznap megkapod/om  ezt az új fincsi rendszert.... ennyit erről. {{champion:107}}","replies":[]}]},{"poster":"Bundi","date":"2015-06-17T12:41:27.685+0000","up_votes":1,"down_votes":0,"body":"Én nem teljesen értek azzal egyet hogy minél szigorúbb a büntetés annál kevesebb akit meg kell büntetni. És azért, mert szerintem van az akinek megmondod hogy ez rossz és hallgat rád, belátja és befejezi vagy van az akit akármennyire megbüntetsz, akármit mondasz nem változik. Azért remélem nincs teljesen igazam és a rendszer segíteni fog abban, hogy a meccsek jobb hangulatban teljenek.","replies":[]},{"poster":"EveryDayPlay","date":"2015-06-17T11:39:29.441+0000","up_votes":1,"down_votes":0,"body":"Én vasárnap kaptam rankedról való eltiltást de fogalmam sincs hogy miért,mikor mindig tisztességesen játszok és megprobálok nem flamelni,se afkolni,se trollkodni","replies":[]}]}