{"poster":"Runic Blood","date":"2016-09-27T03:34:55.891+0000","title":"@Riot, Game crashes after champ selelct","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"This game is getting on my damn nerves after playing it for 4 years and having no clue as to why my game just started recently crashing. I would submit a support ticket but it takes 2 weeks to get a response to an e-mail. I tried to do some fixes that I searched on google and none of them work. I also tried the frequent problems list but that didn't help either. I uninstalled, restarted my computer reinstalled. Still doesnt work. I tried to have the client repair itself and it doesnt work. Can someone help me fix this shit before I go insane please.","replies":[{"poster":"QUANTEYES","date":"2016-09-27T05:24:03.582+0000","up_votes":2,"down_votes":0,"body":"Did you do the Windows 10 Anniversary Update ? And do you have an NVIDIA GeForce graphics card?","replies":[{"poster":"Hingedmosquito","date":"2016-09-27T16:01:14.855+0000","up_votes":1,"down_votes":0,"body":"Yes. Do you have the solution? There is one update that it is not allowing me to uninstall.","replies":[{"poster":"Runic Blood","date":"2016-09-27T16:07:32.904+0000","up_votes":1,"down_votes":0,"body":"I have both nvidia card and newest update to windows 10. I do not have a solution. Do you know how to fix this?","replies":[{"poster":"QUANTEYES","date":"2016-09-27T16:43:33.946+0000","up_votes":2,"down_votes":0,"body":"Check out the response up there that I put, sorry I'm pretty new to the forums so idk if I was supposed to type this as a \"reply\" to you guys to get an alert message or if you guys still got it just as another part of the thread. Once again, good luck ! Drove me bananas all weekend and yesterday lol.","replies":[]}]}]},{"poster":"Runic Blood","date":"2016-09-27T05:58:15.163+0000","up_votes":2,"down_votes":0,"body":"yes to both","replies":[]}]},{"poster":"QUANTEYES","date":"2016-09-27T16:39:13.030+0000","up_votes":2,"down_votes":0,"body":"http://boards.na.leagueoflegends.com/en/c/help-support/NAXe6XfY-i-may-have-figured-out-the-crashing-problem-guys\n\nTry this, I made this thread yesterday when I got League to work for me. Good luck ! :)","replies":[{"poster":"QUANTEYES","date":"2016-09-27T16:40:09.966+0000","up_votes":2,"down_votes":0,"body":"Also, sorry for not getting back to you guys sooner !","replies":[{"poster":"Runic Blood","date":"2016-09-27T17:50:50.440+0000","up_votes":1,"down_votes":0,"body":"Thank you","replies":[{"poster":"QUANTEYES","date":"2016-09-27T19:51:00.389+0000","up_votes":1,"down_votes":0,"body":"No worries, my friend ! Here to help other LoLers out haha :)","replies":[]}]}]}]},{"poster":"Porocles","date":"2016-09-27T22:54:56.879+0000","up_votes":1,"down_votes":0,"body":"I'd really like to help you out, but I need more information on what exactly is happening.  What do you mean by crash?  Are there any error messages?  What are you seeing exactly and when?  Let me know, and I can try to help!","replies":[{"poster":"Runic Blood","date":"2016-09-28T03:31:49.590+0000","up_votes":1,"down_votes":0,"body":"Its already been fixed. But after champ select I would get bug splat. As soon as the loading screen was about to pop up I would get bug splat","replies":[]}]}]}