{"poster":"Mczerokid","date":"2015-06-14T19:15:01.408+0000","title":"Weniger LP verlieren wenn man mit afk leuten verliert !","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":13,"body":"Also.. ich habe grade ein Ranglistenspiel gestartet und was passiert ? Nach 2 Minuten waren die ersten 3 AFK. Dann hab ich nat&uuml;rlich verloren weil es am ende 2 vs 5 war. UND ICH VERLIERE 20 LP !\r\nSo sollte es sein bei Lose ! :\r\n\r\n1 AFK : 6 - 8 LP weniger verlieren \r\n2 AFK : 9 - 11 LP weniger verlieren\r\n3 AFK : 12 - 15 LP weniger verlieren\r\nUnd bei 4 Leuten die Afk sind einfach garnichts verlieren.","replies":[{"poster":"Kaitri","date":"2015-06-15T06:46:48.901+0000","up_votes":2,"down_votes":0,"body":"es gibt leute die verlieren nichtmal 15 lp. \nkrieg ich dann lp dazu wenn ich 3 afk'ler habe? lol","replies":[]},{"poster":"Temudschinn","date":"2015-06-14T20:02:03.405+0000","up_votes":2,"down_votes":0,"body":"Da du mehr Punkte durch afks kriegst als verlierst (weil sie öfter bei den Gegnern sind) hilft dieser Vorschlag absolut gar nichts...\n\nEr birgt aber die riesige Gefahr von zuisätzlichen flaming (\"omg ahri, go afk already. YOu suck so hard, pls die or go afk, i dont want to lose lp\"). Darum klar abzulehnen.","replies":[]},{"poster":"0815xand0r","date":"2015-06-14T19:49:56.837+0000","up_votes":2,"down_votes":0,"body":"Da du im Schnitt weniger AFK'ler im eigenen Team als bei den Gegnern hast, bringt es dir gar nix. Zusätzlich gibt es die Gefahr, dass es ausgenutzt wird (Premades, Smurfs, Leute zum Leaven mobben, etc).","replies":[]},{"poster":"e621 Rengar","date":"2015-06-14T19:30:21.309+0000","up_votes":2,"down_votes":0,"body":"Das System wurde schon so oft als Vorschlag gegeben  und wird eigentlich immer abgelehnt weil man das viel zu leicht ausnutzten kann.\nZ.b mit einem Premade Smurf , dem Smurf wird es kaum interessieren wie viel LP er verliert weil er so oder so aufsteigen wird","replies":[]},{"poster":"Manker00","date":"2015-06-14T19:22:41.247+0000","up_votes":1,"down_votes":1,"body":"Gute Idee,\n\nergänzung: afk'ler sollen mehr verlieren","replies":[]}]}