{"poster":"Stälin","date":"2019-03-16T01:18:22.829+0000","title":"No entiendo... de que sirve?, de que sirve esforzarse y jugar bien?, diferencia de oro.","subforum":"Off-topic y temas personales","up_votes":2,"down_votes":3,"body":"Cuando termino una partida, generalmente veo los daños, oro etc etc.\r\n\r\nhttps://imgur.com/a/BRRjzzk\r\n\r\nAhi se ve como, la kindred enemiga termina 7/6/6 y con 12.464 de oro.\r\n\r\nYo, que sali 15/1/0 termine con 13.279 de oro.\r\n\r\nLe saque farm toda la partida, la mate varias veces, le robe campamentos etc etc.\r\n\r\nPero terminamos con de 815 de oro de diferencia, lo cual, a mi parecer, me parece casi una burla.\r\n\r\n¿Que sentido tiene esforzarse en salir bien en una partida, en no fedear, enfocarse en hacer las cosas bien, si otro que se la paso muriendo esta igual que vos de oro?.\r\n\r\nMedio ilogico... para eso la proxima partida ni me caliento en gankear, en sacar torres, en hacer objetivos nada, trolleo y listo, total al final voy a terminar con los mismos items que el laner enemigo.","replies":[{"poster":"lordeman10","date":"2019-03-16T01:52:18.300+0000","up_votes":3,"down_votes":0,"body":"> Ahi se ve como, la kindred enemiga termina 7/6/6 y con 12.464 de oro.\n\nClaro, al morir tenés una penalización de tiempo y por lo tanto se te deniega oro, ese es el balance que se hace\n\n> Yo, que sali 15/1/0 termine con 13.279 de oro.\n\nEl motivo es simple, tenias del otro lado unos jugadores que morian a cada rato y no mataban ni una mosca, al punto que ya ni daban oro\n\n> Le saque farm toda la partida, la mate varias veces, le robe campamentos etc etc.\n\nY sin duda gracias a eso no pudo tener presencia en las lineas, eso llevo a que pierdan objetivos y probablemente ganes la partida, si no fue así te sugiero que aprendas a capitalizar las victorias \n\n> Pero terminamos con de 815 de oro de diferencia, lo cual, a mi parecer, me parece casi una burla.\n\nEsto es porque vos matabas feeders mientras el mataba gente fedeada, es muy razonable.. son las reglas del lol es parte de su identidad, la unica forma de cambiar eso es quitarle el oro de las kill y eso lo volvería aburrido, el juego está planteado de forma que siempre haya oportunidad de volver a la partida, lo que importa es saber aprovechar esos momentos donde estás por encima de tu enemigo para tomar objetivos\n\n> ¿Que sentido tiene esforzarse en salir bien en una partida, en no fedear, enfocarse en hacer las cosas bien, si otro que se la paso muriendo esta igual que vos de oro?.\n\nEN ORO, pero el juego se termina cuando cae el nexo, está bien que para lograrlo se necesita oro pero fijate que ese tiene mucho porque tiene todo el oro del team los demás no se pero da la impresión de que no aportaban mucho al menos mucho no creo que hayan hecho tenian uno o 2 item menos cada uno\n\n> Medio ilogico... para eso la proxima partida ni me caliento en gankear, en sacar torres, en hacer objetivos nada, trolleo y listo, total al final voy a terminar con los mismos items que el laner enemigo.\n\nporque tanta obseción por los item, lo que importa es lo que hacés con ellos! después de todo no te los podes llevar de la partida solo importa haberlos usado para ganar","replies":[]},{"poster":"Celebi","date":"2019-03-16T03:07:57.376+0000","up_votes":1,"down_votes":0,"body":"Tuvo suerte con las rachas, tu team tiene demasiadas kills, me lo dicen mucho tambien (y casualmente soy main kindred) quizas hasta haya sido yo quien te salio en contra XD el caso es que racha a racha he hecho bastante mas oro que gente que va muy feed, al final resulta mucho mas eficiente cazar esta gente que ponerte a farmear toda la partida etc, pero por supuesto es mas riesgoso.","replies":[]},{"poster":"Zhearun","date":"2019-03-16T01:31:17.654+0000","up_votes":1,"down_votes":0,"body":"También deberías fijarte el hecho que vos farmeaste 183 monstruos y la Kindred 177, una diferencia de **únicamente seis creeps**. Esos 815 de Oro vienen realmente de la diferencia de KDA entre los dos, ya que el jungla enemigo jugó un papel un tanto menos agresivo, con la participación de 13 asesinatos contra 15. La cantidad de Oro extra que vos conseguiste, van de la mano conque las 15 kills en las cuales participaste, las 15 fueron tuyas, contrastando contra el 7K-6A de Kindred. Realmente fue una partida pareja entre los dos junglas, no hubo tanta distinción en habilidad.","replies":[{"poster":"Zhearun","date":"2019-03-16T01:33:38.804+0000","up_votes":1,"down_votes":0,"body":"En vez de pensar que el problema viene de Riot, deberías ver vos mismo, en el historial de partida, las estadísticas completas y analizar que fue lo que Kindred hizo para alcanzarte en el Oro. Quizás haya hecho muchas más cosas de las cuales no te estás enterando ya que solamente te estás fijando en el resultado final (Oro vs Oro) y no en la partida completa. Quizás encuentres muchas cosas que te sorprendan.","replies":[{"poster":"Stälin","date":"2019-03-16T02:22:44.090+0000","up_votes":1,"down_votes":2,"body":"Lo que hizo kindred en la partida fue:\n-Morir\n-Ir a su jg a buscar campamentos que yo ya habia hecho\n-Dejar de intentar a ir por su jg, y clavase en top donde estaba el inhibidor roto.\n\nEso es todo...","replies":[]}]}]},{"poster":"Chinizuelo","date":"2019-03-16T01:24:34.231+0000","up_votes":1,"down_votes":0,"body":"Puede ser que:\nKindred obtuvo oro extra de shutdowns en tu equipo.\nLas asistencias tambien dan oro. Vos tenes 0, ella 6.\nFarmeo apenas 10 cs aprox. menos que vos, asi que considerando que murio 6 veces, y vos 1, farmeo mucho mejor que vos.\nPor el score, matar al garen,zed o a la morgana no te daba tanto oro ya que no paraban de morir.\nQuizas saco placas en bot.\n\nComo ves, hay muchos motivos por los cuales solo las kills no sirven para sacar diferencia de oro.","replies":[{"poster":"Stälin","date":"2019-03-16T01:28:31.988+0000","up_votes":2,"down_votes":2,"body":"- Primer torre la saque yo.\n- Primera sangre la saque yo.\n- Kindred llego a ese farm, clavandose en la linea que tenian roto un inhibidor porque estaba muchisimo peor, no le deje campamentos practicamente toda la partida.\n- Las asistencias, no dan ni siquiera para una pocion. Varias veces recomende subir el oro de las asistencias.\n- Shutdown se llevo uno solo de Yorick, y que tampoco llegaba a los mil de oro, iba 3/0 si mal no recuerdo.\n\nNo hay logica para nada.","replies":[]}]}]}