{"poster":"Little T","date":"2016-09-07T20:15:32.063+0000","title":"alguien me explica por que juego tan mal?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"ya ni se que hacer, intento e intento y solo pierdo y pierdo, hago todo lo posible y nunca es suficiente, siempre me pasa lo mismo voy a top y bot la pasa mal o si voy de soporte el top o el mid van mal, y esto es humillante, no puede ser que tire tp&#039;s a bot o haga roaming de soporte y aun asi no puedo lograr que las lineas ganen, y en tf todos se posicionan mal y no se como ayudar...\r\na veces incluso me olvido de mi linea y trato de ayudar y nunca alcanza... creo que es mi culpa por no ayudar lo suficiente\r\nnecesito alg&uacute;n concejo o algo, estoy podrido de jugar partidas y ganar linea y despu&eacute;s que el top me diga &quot;gg izi top&quot; y yo sin poder defenderme por que perd&iacute; la partida y siento que soy un inservible \r\nesto no es un crypost, solo quiero alg&uacute;n consejo para ganar partidas, y tiene que a ver alguna forma m&aacute;gica de ganar, si no los profesionales como hacen para llevar una cuenta unranked a platino en 15 dias?...","replies":[{"poster":"9081913DEL1","date":"2016-09-07T20:51:13.702+0000","up_votes":5,"down_votes":0,"body":"No trates de hacer que los demas hagan cosas, centrate en lo que vos podes hacer.\n1- vision, podes generar vision al equipo, aunque sea el unico que mire el mapa.\n2- cumpli tu rol, si eres support, se el mejor, que tu adc juegue tan comodo como sea posible, y adaptate, si es un afkfarm, dejalo no trates de engajear si el loco no va a ir trata de que no muera al final de casualidad va a pegar. si eres top se lo que vas, tank asesino etc, vos a lo tuyo. mid, provee daño. jg jode al contrario aunque no maten en 20 minutos, vos molesta si el otro gasta algo pierde farm xp ya ganas algo.\n\nHagas lo que hagas el objetivo es el nexo, y por ende las torres, no sigas consejos tontos si le podes dar un hit se lo das. Evita morir a toda costa, evitar morir genera kills, ya veras eso.\n\nDespues las tf, es sencillo ahi es en equipo, que no sepan que hacer es normal, vos lo mismo desgasta, genera vision y espera una oportunidad, mantene pusheadas las lineas y aprovecha cada bait posible.\n\nAl fin y al cabo solo no se gana.\n\nLos que hacen de bronce a platino, estan haciendo una subida a ligas en que el concepto gral es malo, no creas que estan carreando, generalmente es en duo (conozco varios que hacen eso). Si fuera tan facil te llevarian a challenger, tener una smurf challenger ya es diificil si el tiempo que lleva ganar pl y mantenerse arriba es bastante de por si XD.\n\nPractica, actitud positiva, y mas que anda diviertete, cuando te empieza a pesar algo estas mal, un tip es tratar de sonreir cada 10 minutos XD.\n\nSaludos.","replies":[{"poster":"ZanahoriaAsesina","date":"2016-09-07T20:58:56.098+0000","up_votes":4,"down_votes":1,"body":"Buenos consejos.\n\nhttp://i.dailymail.co.uk/i/pix/2013/03/20/article-2296269-18CD29B1000005DC-967_634x423.jpg","replies":[]},{"poster":"Little T","date":"2016-09-08T10:35:30.311+0000","up_votes":1,"down_votes":0,"body":"al igual que lKINGl te agradezco, me gusta que respondan de una forma tan objetiva y con una explicación larga, les agradezco su tiempo n.n","replies":[]}]},{"poster":"lKINGl","date":"2016-09-07T21:14:57.258+0000","up_votes":4,"down_votes":0,"body":"Aprende a usar 1 o 2 campeones, juégalos siempre o casi siempre, mira las runas de los pro y copiales, mira los items y el orden en el que los emplean, mira cuando el campeón que elegiste le es conveniente atacar o defenderse, farmea bien osea controla tu farming por el tiempo y la cantidad de mininos asesinados, controla el oro y los items que compras ( se ordenado ).\nEn las tf siempre tienes que pensar 1 sola cosa antes, COMO ESCAPAR y donde posicionarte para no estar inútil en una team fight o simplemente no estar en un lugar muy vulnerable si tus compañeros de equipo no te pueden ayudar.\nTodo lo que dije se practica, hasta que lo piensas instantáneamente y no lo tienes que razonar, porque para ser sinceros si tienes que pensar mucho en medio de un combate... vas a morir igual y no harás nada de daño.\nConsejos.\n1. Farming ( controla tiempo y cantidad de minions, se ordenado)\n2. Items ( dependiendo si estas siendo outplayed o viceversa debes comprar items defensivos respectivos a tu personaje y ser pasciente de lo contrario te matan y toman provecho de eso, en el caso contrario sigues una build normal)\n3. Mecanicas para matar o escapar ( con esto me refiero a una forma de actuar ordenada que o te saca de problemas o matas efectivamente al enemigo por ejemplo con twisted fate lo que hago es (sabiendo cuanto sacan mis ataques) hacer algo de harras y cuando tiene cierta cantidad de vida efectuo una mecanica flash>stun(junto a su pasiva)>ignite>wildcards>ataque basico( de esta manera le saco 650 de vida en early en menos de 1 segundo literal lo cual deletea a mi oponenete) luego habiendo obtenido 1100 de oro backeo y compro mis items.\n4. Mira a tus oponentes como actuan, Defensivos..Agresivos...Extraños (aparentes suicidas o que toman demasiado riesgo, esto aveces lo acompañan jugadores que o son expertos engañando con un jungla en un bush sin ward o novatos que no controlan su nivel de hp y piensan que pueden escapar) esto se ve con la practica pero no es algo para no tenerle presente.\n5. Wardea!!!! siempre wardea y mira el mapa para saber donde estan los otros y presta atencion a la señales.\n6. Nunca hagas persecuciones largas si no sabes como escapar si aparece un enemigo o no sabes donde estan sus compañeros de equipo, en general NUNCA persigas!!!\n7. NO HAGAS diveos! si no sabes como escapar a la perfección!\n8. MATAR y morir no sirve de nada a no ser que hagas una triple-cuadra-pentakill de otra manera no tiene sentido 8-10 minions son equivalente en oro a una kill.. solo pierdes tiempo muriendo con el fin de obtener una kill.\n9.Cuando hacen Baron o Dragon y estas solo...y sabes que lo estan haciendo el team enemigo.... no divees en la mitad de su cazeria...solo resulta con ellos obteniendo el dragon y una kill... lo e visto mil veces.\n10- Ayuda siempre a los de tu team, si en una situacion en la que debes decidir si matar a un enemigo o evitar que muera uno de tu team, SALVA a tu compañero!!! ,esto hace que tu team sea mas unido y se protejan entre todos, osea... un team que va 0 muertes con 15 kills es arrollador y afecta la moral del enemigo resultando en que ellos se rindan, peleen, no coordinen, o se vaya alguno afk.\n11.Ten en cuenta las habilidades de tu enemigos para preverlas.\nNo soy ningun experto pero es lo que me va resultando y cuando pierdo por lo general no sigo estas reglas, me di cuenta cuando habia dejado de jugar y perdia muchisimo cuando volvi a jugar nuevamente.\nJugar bien no es una habilidad magica que aparece de la nada, son cosas simples que al practicarlas las puedes aplicar simultanemente sin esfuerzo, es lo que hacen los pro, y por eso jugan tantas horas para ser mejores....porque tienen muchiiiisimas reglas y formas de actuar.\nSOLO jugar no sirve de nada y aunque paresca un tedio tener que aplicar \"reglas\" \"mecanicas\" o lo que sea, termina por ser divertido ver que tengan efecto y comienzas a querer aprender mas y mas como pequeñas habilidades para tus campeones jajaj,\nSuerte!!!","replies":[{"poster":"Little T","date":"2016-09-08T10:34:15.243+0000","up_votes":1,"down_votes":0,"body":"wow, te agradezco mucho los concejos, pero lo que mas me sorprende es que hayas usado tu tiempo para contestarme, muchas gracias <3","replies":[]}]},{"poster":"Wense Mcfly","date":"2016-09-07T20:36:13.802+0000","up_votes":3,"down_votes":9,"body":"Pq no tienes  manos","replies":[{"poster":"Ingratitud","date":"2016-09-07T22:36:30.614+0000","up_votes":5,"down_votes":0,"body":"El (TheKnightRaime) por lo menos es Plata II y tu has estado en bronce desde la temporada 4. \n\nEl tiene por lo menos más manos que vos y que yo. Tenle más respeto alque que quiere mejorar, que pide consejos para progresar.","replies":[{"poster":"Wense Mcfly","date":"2016-09-07T23:48:57.413+0000","up_votes":1,"down_votes":4,"body":"Respeto por que ?XD porque juega mejor un \"juego\"? xD anda a bañarte xD","replies":[{"poster":"Ingratitud","date":"2016-09-08T03:45:54.127+0000","up_votes":4,"down_votes":0,"body":"\"Tenle más respeto alque que quiere mejorar, que pide consejos para progresar.\"\n\nContestarle que no tiene manos, es insultar. Eso no ayuda a nadie. \n\nPor lo menos TheKnightRaime, parece mejor invocador y persona, que tu, reconoce que no lo hace bien, pide ayuda para mejor. Tu solo lo insultas ¿? Es como, que no tiene sentido tu actuación de insultar.","replies":[]},{"poster":"rokushoger","date":"2016-09-08T11:47:24.731+0000","up_votes":3,"down_votes":0,"body":"Tenle más respeto porque es una persona, no por jugar un juego, toda persona merece respeto, en especial una que a todas luces es mejor que vos.","replies":[]}]}]}]},{"poster":"rokushoger","date":"2016-09-08T11:33:46.193+0000","up_votes":1,"down_votes":0,"body":"Bueno, en primer lugar, te recomendaría que no te quedes afk, con eso seguro que no ganás.\n\nSegundo, la visión, fijate este game:\nhttp://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/365801991/201574822?tab=stats\n\nFijate la visión del equipo enemigo y la de ustedes, y eso que ninguno de los dos parece entender la importancia del ward pink! Un pink te da visión permanente sobre una zona, compra uno cada vez que eliminen el que pusiste, y colocalo en puntos clave.\n\nTercero, está bien ayudar, pero no a costa de sacrificar objetivos. Obviamente vos jugás tanque, así que probablemente no seas justo el que va a tirar la torre, pero enfocate en ayudar a una sola linea, y luego del gank pusheen y tiren torre, o por lo menos dañenla mucho! Ojo con ayudar a los que van demasiado atrás, porque es probable que no se recuperen y estás cediendo tu ventaja en una causa perdida.","replies":[]},{"poster":"PYKETERO","date":"2016-09-08T01:42:57.035+0000","up_votes":1,"down_votes":0,"body":"O B J E T I V O S, eso es todo, podes ayudar todo lo que quieras, pero si tu team no hace objetivos no hay nada que hacer, me ha pasado muchisimas veces que mi team gana todas las lineas y a partir de ahi empiezan a boludear, y acto seguido perdemos por no aprovechar la ventaja que teniamos. Creo que el primer paso ya lo diste y fue aceptar que parte de la culpa la tenes vos, si no fuese así no perderías siempre y solo perderías algunas partidas. Mi unico consejo es que sigas ayudando en otras lineas y sigas tratando de apoyar a tu team para que gane sus respectivas lineas, a partir de ahí concentrarte en los objetivos. Sale un dragon en 20 seg? pinguealo 20 veces para que todos sepan que queres hacer ese dragon, sale baron en 10 seg? lo mismo, se va le heraldo? LO MISMO;  hacete escuchar, hacele saber a tu team que es lo que queres hacer y conseguí que te ayuden a concretarlo, así se ganan las partidas, no solo hace falta ganar lineas. \n\nUn saludo {{champion:412}}","replies":[]},{"poster":"KShyGuy","date":"2016-09-08T00:13:49.644+0000","up_votes":1,"down_votes":0,"body":"Si pierdes un game, el siguiente te pondran con gente peor. Si pierdes una partida, deja de jugar por ese dia, e intentalo el proximo.","replies":[{"poster":"KShyGuy","date":"2016-09-08T00:17:04.703+0000","up_votes":1,"down_votes":0,"body":"Por el contrario, si ganas, sigue jugando. \nNOTA IMPORTANTE: Si ganas un game, esta regla ya no aplica si cambias de modo de juego.","replies":[]}]},{"poster":"MrWhite17","date":"2016-09-07T23:40:40.799+0000","up_votes":1,"down_votes":0,"body":"rankea más, perdiste 3 seguidas rankeds nomás","replies":[]},{"poster":"ACris5503","date":"2016-09-07T20:32:13.337+0000","up_votes":1,"down_votes":2,"body":"La solución es afrontar la situación,no digo que vaya a ser fácil y menos con tanta presión.\n¿Que harian los demas si estuvieran en tu situacion?\nNo aguantarian ni de coña lo que tienes que aguantar.","replies":[{"poster":"Help Support","date":"2016-09-07T20:42:04.684+0000","up_votes":1,"down_votes":0,"body":"Porta","replies":[]}]},{"poster":"Help Support","date":"2016-09-07T20:40:02.160+0000","up_votes":1,"down_votes":0,"body":"Creo que usan champ que en juego temprano meten mucho daño y si se fedean pueden ganar en 1 vs 2 o 3 para hacer full push de su línea obligando que descuiden las demás. Y sacar más objetivos. Pero no se la verdad te tiro una vaga idea que recién pensé. Igual no te frustres. Juga y divertirte. Juga con amigos que sepas que juegan a tu mismo nivel o similar. Igual recordar que ninguna partida está perdida asta que cae el nexo.   Siempre se puede dar vuelta una partida si se estira lo suficiente.","replies":[]}]}