{"poster":"Little T","date":"2016-05-27T06:59:37.981+0000","title":"no se si lol me aburre o no encuentro mi campeón...","subforum":"Off-topic y temas personales","up_votes":1,"down_votes":0,"body":"la verdad llevo mucho tiempo jugando lol, pero siento que esto se esta volviendo aburrido, y gran culpa la tengo de que no encuentro un campeon que me divierta y que diga: &quot;waw este campe&oacute;n me encanto, lo voy a mainear y voy a tratar de mejorar con este&quot;, pero ya no siento eso, ahora mismo es: &quot;tengo 6300 de pi, que me compro? &ntilde;e me compro darius&quot; entienden? ya no siento que ning&uacute;n campe&oacute;n me atraiga...\r\ny en parte es mi culpa, soy muy quitismiquis sobre mis campeones, no me gusta que un campe&oacute;n este tan popularizado, quiero usar algo que sea divertido y sirva de mucho, mi linea main es top.\r\nquiero un campe&oacute;n con lo siguiente:\r\ntanque.\r\nsin muchos skillshots.\r\nda&ntilde;o razonable.\r\ncc.\r\ny aporte a team fights.\r\nestaba pensando que quiz&aacute; {{champion:14}} sea mi personaje... espero respuestas","replies":[{"poster":"LeonardoSB","date":"2016-05-27T07:08:09.244+0000","up_votes":1,"down_votes":0,"body":"skillshots de top?, no estoy muy seguro a que te refieras pero un skillshot es un disparo de habilidad que depende del jugador tan bien lo haga, por ejemplo ezreal es un personaje de skillshot, nidalee es un personaje de skillshot, en top casi ningun tank cumple eso.\n\ndaño razonable....pues eso depende tu modo de juego y a lo que llames razonable, para mi estas jugando mal la linea y no has probado mucha variedad de build.\n\ny CC....si te referis a stuns hay 2 o 3 que dudo mucho que no hayas probado... en consistencia a slows casi todos los tanks deben tener 1 minimo...\n\naporte a tfs...no se a que te referirás a esta en concreto, el aporte a teamfights es desempeñar tu rol correctamente...por ejemplo, un tryndamere no es buen aporte en lo que a tf refiere, pero mas de una vez puede tu equipo llegar a ganar una tf porque 1 o 2 fueron a parar tu splitpush...\n\nlos tanks con aporte a las tfs estan orientados a 2 cosas, o iniciacion (engage) o a desenganche (disengage) y todos tienen lo que vos decis, menos lo de \"daño razonable\" que lo explique anteriormente.","replies":[{"poster":"Little T","date":"2016-05-27T07:10:40.122+0000","up_votes":1,"down_votes":0,"body":"es verdad no me explique bien, a daño razonable me refiero a que con un objeto o incluso sin daño logren hacer estragos","replies":[{"poster":"LeonardoSB","date":"2016-05-27T07:18:53.545+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=TheKnightRaime,realm=LAS,application-id=J8qpiO2I,discussion-id=6qTAUXjJ,comment-id=00000000,timestamp=2016-05-27T07:10:40.122+0000)\n>\n> es verdad no me explique bien, a daño razonable me refiero a que con un objeto o incluso sin daño logren hacer estragos\n\nimposible sin daño ...convengamos que el AD basico de un top laner ronda los 75 con dorans blade, y marcas de daño fisico plano, no podes hacer daño y ser tank, es como que estas buscando ser todo el equipo vos solo y no se puede, cada campeon tiene su mecanica para aprovechar al maximo su daño, por ejemplo, con maokai es el pimpollo + el root que se te tira encima, si queres tener daño explosivo como un adc de burst, o un mid laner asesino o ap, cagaste...por algo sos la top lane, y si bien en elos bajos no se le toma mucha importancia, en elos altos es obligatorio contar con alguno de los 2 tipos que mencione antes (engage y disengage) por ejemplo, gragas top es una buena opcion, pero si queres que pegue lo vas a tener que armar mas ap que tanque, si queres que aguante vas a tener que armarlo tank,\n\ny sino haces la tipica, teemo top ap con un par de item tank y cojete al que venga xD","replies":[{"poster":"Kyousuke","date":"2016-05-27T08:08:09.372+0000","up_votes":5,"down_votes":0,"body":"cof cof* alguien dijo imposible sin daño?? {{champion:86}} {{champion:122}} {{champion:420}} {{champion:78}} {{champion:62}} {{champion:48}} {{champion:102}} {{champion:98}} {{champion:2}} \nXD lo que busca el chico es un coloso","replies":[{"poster":"Darvex","date":"2016-05-27T16:17:49.329+0000","up_votes":1,"down_votes":0,"body":"{{champion:223}} {{champion:106}} {{champion:31}} {{champion:39}}{{champion:150}}   hacen bastante daño y son bastante tanques, quizá Irelia no sea tan tanque pero hace mas daño que los demas","replies":[]}]}]},{"poster":"Help Support","date":"2016-05-27T11:42:01.214+0000","up_votes":1,"down_votes":0,"body":"Shen","replies":[]}]},{"poster":"Narwhal","date":"2016-05-27T11:35:36.544+0000","up_votes":1,"down_votes":0,"body":"Nautilus tiene skillshot","replies":[{"poster":"Narwhal","date":"2016-05-27T11:37:58.507+0000","up_votes":1,"down_votes":0,"body":"Tambien Ryze, que se juega ap off tank... Olaf tambien se juega tanque y tiene skillshot, Gnar tambien... en fin son varios :v","replies":[]}]}]},{"poster":"Help Support","date":"2016-05-27T11:39:59.695+0000","up_votes":2,"down_votes":1,"body":"Anda sup y juga alistar o el sapo son divertidos. Podes salvar al enemigo alejandolo o comiendo a tu adc, serias medio troll pero podes alegar se me lagueo y no lo pude levantar O que se te cruzo el adc y lo comiste por error, y cosas asi. Y mas cuando el server anda mal, podes troleaR a todo tu team y por mas que te reporten los 9 no pasa nada, ya que fue por causa ajena a vos y \" no fue aproposito \". Ya que son cosas que suelen pasar.","replies":[]},{"poster":"Hísøka","date":"2016-05-27T16:02:26.694+0000","up_votes":1,"down_votes":0,"body":"Yorick divierte a pesar de estar fuera del meta {{champion:83}}","replies":[]},{"poster":"Cyclosarin","date":"2016-05-27T14:46:34.046+0000","up_votes":1,"down_votes":0,"body":"Karthus tiene ese winrate pero con un porcentaje, no bajo, inexistente (0,16%) de jugabilidad. Ekko está entre los primeros tanto en winrate como en champ utilizado en top. Además de ser un campeon mucho mas versatil y que ofrece mas utilidad para el team que un karthus.","replies":[]},{"poster":"Franja","date":"2016-05-27T13:52:09.720+0000","up_votes":1,"down_votes":0,"body":"Es dificil encontrar a mi parecer campeones divertidos sin muchos skillsshots :(","replies":[]},{"poster":"Cyclosarin","date":"2016-05-27T12:08:49.531+0000","up_votes":1,"down_votes":0,"body":"Hoy en dia, el campeon mas roto de top, tanque pero con daño, aporte en TF  o 1vs1, divertido para jugar y a la vez flexible (puede ir top/jg/mid), free elo  SIN DUDAS es... EKKO \n\nNadie te lo nombro y es Godtier en todas las lineas.","replies":[{"poster":"Narwhal","date":"2016-05-27T13:48:14.986+0000","up_votes":1,"down_votes":0,"body":"Bajar del puesto 1 a 24 te parece godtier? .__. ya paso ekko, es Karthus top.... esta por llegar al 60% winrate...","replies":[]}]},{"poster":"Kyousuke","date":"2016-05-27T08:12:21.625+0000","up_votes":1,"down_votes":0,"body":"cualquier campeón denominado COLOSO cumple con tus expectativas (menos cc) la gracia es buscar un pj que te atraiga por mecánicas o lore, ejemplo mi main es {{champion:203}} y me encanta por sus skills y su lore tan fantástico y su significado, también por mecánicas tengo  a {{champion:5}}  y {{champion:254}} de respaldo, igualmente un main solo significa un personaje que manejes bien y te guste pero aun asi es mejor jugar todos para no aburrirte y variar lineas.\ntambién te puede gustar un pj por una skin como me paso con {{champion:268}} y la skin de señor de los muertos","replies":[]},{"poster":"ThunderFOX","date":"2016-05-27T07:47:48.803+0000","up_votes":1,"down_votes":0,"body":"Sion es MUY divertido, yo tampoco sabia que usar en top, viendo tanto darius, gnar, y cosas \"mainstream\" por decirlo de una manera jajaja xD con Sion te divertis, y sos una cosa que no bajan  con nada en Late si farmeaste bien algo de vida :P estube entre los 5 enemigos, todos dandome con todo lo que tenian y me lograba escapar xD jajaja","replies":[]}]}