{"poster":"Little T","date":"2016-03-22T07:34:52.205+0000","title":"consejos para varus?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"la verdad llevo usando a varus un tiempo de hecho es el &uacute;nico adc q uso xd pero todavia no logro encontrar buildearme los objetos necesarios D:\na veces no se si comprarme la statick o el uracan de runan, la sanguinario o el rey arruinado, llegue hasta el punto de no saber si comprarme una cimitarra mercurial o un angel guardian xd, a parte q soy nuevo como adc\ntambien me gustaria saber si varus sirve con el meta actual y con que campeones suport juega bien.\nles pido consejos a la gente que sea main varus :D\nnota: tampoco se si la danza de la muerte le vendria mejor q la sanguinaria","replies":[{"poster":"rokushoger","date":"2016-03-22T18:52:51.125+0000","up_votes":1,"down_votes":0,"body":"{{item:3094}} Cuando precisas alcance y poke.\n{{item:3085}} Cuando querés hacer daño en área y/o aplicar efecto de impacto a varios.\n{{item:3087}} Cuando querés limpiar rápido oleadas y más burst\n{{item:3046}} Cuando precisas más capacidad de duelo 1vs1\n\nVarus se especializa en volar barras de vida en forma porcentual gracias a las marcas que aplica con la W, por tanto tu opción idea es el runaan, aunque si vas por detrás la stattick te puede ayudar a recuperar farm y buildearte mejor.\nRealmente el revolver no lo veo muy útil, dado que para poke tenes tu Q que pega más, y por encima de eso perdés potencia en tus AA en comparación con una stattick o un runaan (marcas para todos wiiiiii). \nLa phantom definitvamente no la veo para él dado que tu objetivo no es ir uno contra uno sino destrozar su front line en teamfights. Si te vas 1vs1 prácticamente cualquier ADC le pasa el trapo a varus.\n\n{{item:3072}} Más daño + mucha curación + escudito.\n{{item:3153}}  Mucha velocidad de ataque + porcentaje de daño por vida + activable que te cura y enlentece al otro.\n\nPara mí varus es un adc efectivo contra tanques, y la botrk tiene una sinergía enorme ayudando a stackear W más rápido, curando en el proceso, y pegando por porcentaje de vida en cada básico. Cuando la front line de ellos está dura este item es el indicado. \nSolo si son todos squishy del otro lado me inclino por la sanguinaria.\n\n{{item:3026}} Buen mix de resistencias + te revive luego de unos segundos\n{{item:3139}} Da un poco más de daño + te quita cc.\n\nEl angel guardian solo es realmente útil si tenés un equipo que sabés que puede y se va a quedar al lado tuyo protegiendote cuando revivas, sino es un gasto de oro al santo boton para revivir entre 5 bestias sedientas de sangre.\nLa cimitarr por otro lado no da armadura pero da AD, y te puede salvar de ese stun de taric, o ese ulti de malza o WW, salvandote de morir por comerte todo el daño post cc de sus compañeros.\nAmbos son items situacionales, y aún más en varus, porque vos no deberías estar demasiado expuesto al peligro dado el buen rango que tiene.\n___\n\nLo mejor en varus es básicamente stackear mucha velocidad para pegar el combo básico que son 3 hits + Q + 3 hits + E + 3 hits + R, con eso volás a cualquier tanque. El runaan y la botrk deberían ser items core en tu build (a menos que sean muchos squishys en cuyo caso sanguinaria reemplaza a botrk, y de ser así no te recomendaría pickear varus), y la idea en tf es desgastar a base de explosiones de las marcas de W a todas las lineas frontales del enemigo para exponer a los squishy en cuanto el tank empieza a retirarse.","replies":[]},{"poster":"Ks Erwyn","date":"2016-03-22T12:39:12.108+0000","up_votes":1,"down_votes":0,"body":"A ver, si tienes problemas con el last hit, inicia con la W te ayudara en los últimos golpes, para tradeos tempranos, si bien la Q  es la que mas quita, la E suele ser mejor para asegurar explotar las marcas.\n\nVarus carece de  movilidad, métodos de escape y tiene un early bastante flojo, depende de un CC potente o mas bien constante para las marcas de su W. Supp que le brinden ya sea peel, movilidad y CC le viene bien, de los mejores : {{champion:37}} , {{champion:267}} , {{champion:40}}, {{champion:117}} y {{champion:412}} .\n\nLo primero sobre los items, es que casi ningun ADC tiene un armado estandard todas varian en orden o armado segun tu team y el del rival, asi como la estrategia de equipo acorde a tu team, los items son para potenciar una falta o un fuerte del campeon. \n\n{{item:3508}}  o {{item:3031}}  el por cual ir depende de tu compo, si es a asedio el {{item:3508}} , dado que podrás pokear mas mientras asedias con tu team y recuperaras el mana con subditos, en compo. de team fight es mejor el {{item:3031}} dara mejor dps y criticos.\n\n{{item:3009}} en compo de asedios , {{item:3006}} en de team fight, por que la de movilidad? es clave evadir skill-shot cuando asedias y retroceder rápido si les inician a su team y no les conviene hacer TFs, si no desgastar y hacer objetivos, estas botas ayudan a las rotaciones rápidas....\n\n{{item:3087}} , varus no tieene mal wave clear pero si tu team carece de buena limpiza y empuje de oleadas no hay mejor item.\n\n{{item:3085}}  este items esta orientado a peleas en equipo, sirve para puhsear, pero debes tener que para explotar el item deberás pegar mucho y de gratis, para esto tu equipo debe estar compuesto de una estrategia de ¨proteger al carry¨ que es cuando hay al menos 2 tankes front-line y 3 de tus aliados tienen herramientas de peel dedicadas a tí.\n\n{{item:3139}} útil cuando el cc abunda en los rivales, pero tmb para quitarte marcas como las del {{item:3147}}  y de {{champion:238}} .\n\n{{item:3072}} util contra equipos de desgaste y asedio y para si tu equipo es el que asedia, el escudo evita un gran desgaste rival cuando asedia o tu asedias, al ser el item que mas cura, te recuperaras rápido tambien.\n\n{{item:3153}}  siempre a tenido gran sinergia con la W de varus, pero tal item actualmente no es coste-eficiente así que lo mejor no seria armarlo jamas de primer item, es un item orientado a contrarrestar tankes que stackeen vida, pero tmb sirve para sacarte de encima por su activa, a ciertos campeones con engage (ej. {{champion:106}} )\n\n\nitems defensivos:\n\n{{item:3026}} este item, hay que sacarlo cuando el rival tiene mucho poder de iniciación o hard engage, pasara que podran saltar tu front line y llegar a ti para matarte.\n\n{{item:3053}} este item a pasado por mejores momentos en los ADC, pero en compo de ¨proteger al carry¨ es muy bueno ya que da daño, vida y un escudo por si las dudas, como tendras mucho peel difícilmente mueras con facilidad y el escudo ayudara a que te mantengas pegando....\n\ncontra Aps, no recomendaria la {{item:3156}} , ya tienes {{item:3139}} , {{item:3072}} , {{item:3053}}  y {{item:3026}} para contrarrestarlos de una u otra manera....\n\n\nespero que te haya servido todo, saludos...༼つಠ益ಠ༽つ =≡ΣO","replies":[]},{"poster":"DonSai","date":"2016-03-22T07:53:13.029+0000","up_votes":1,"down_votes":0,"body":"no es necesario que te guies por una build que debas llevar si o sí lo mismo, suele variar. \n{{item:3031}} necesario para casi cualquier carry\n{{item:3087}} daño+velocidad de ataque, además del rayito xD\n{{item:3139}} ¿mucho cc?¿necesitas quitarte de encima una ulti de {{champion:32}}  o {{champion:113}} ? entonces esta es buena opción.\n{{item:1300}} Las botas que suelo armarme con casi cualquier carry\n{{item:3072}} buen daño y un escudo, suele gustarme más que el rey arruinado, a menos que pase lo explicado a continuación\n{{item:3153}} ¿muchos tanques? vease una composición que tenga en el mismo equipo a, por ejemplo:  {{champion:36}} , {{champion:106}} y  {{champion:89}}  el rey sería buena opción para joderselos en base a su vida máxima.\n{{item:3036}} ¿algún tanque? lo necesitarás.\n{{item:3033}} ¿no hay tanques? suelo elegir este item \n{{item:3026}} ¿te borran muy rápido y quieres sobrevivir? te sirve.\n{{item:3085}} Este item en particular hace mucho que dejé de usarlo, aunque creo que solo lo vería viable si necesito hacer split push, aunque sigo prefiriendo una statick, es cosa de ir probando que item te acomoda más.\n{{item:3156}} este item puede estar raro en la build de un adc, pero suelo hacermelo cuando necesito la resistencia mágica pero no necesito quitarme algún cc, o de plano hay algún personaje que me burstee de ap, el escudito puede salvarte la vida en más de alguna ocasión.\nMas o menos esto es lo que me baso para elegir un item por sobre otro, espero te sirva de algo.\n\npd: se me olvidaba responder tu otra pregunta, según algunos amigos en el meta actual no está tan bien, pero es cosa de adaptarse no más.\nsobre los soportes, a mi me suelen gustar personajes como  {{champion:201}} {{champion:89}} te brindan el cc necesario para hacer tu daño mientras los personajes están sin poder hacer mucho, además junta su stun con tu r y ni su madre los sacará de ese lugar donde quedaron clavados.\n{{champion:99}} {{champion:25}} {{champion:37}}  pockeo, no hay mucho más que explicar, desgastas desde lejos, y cuando los ves bajos de vida es muy probable que si enganchas bien puedas llevarte alguna kill sin problemas. eso :D ","replies":[{"poster":"Little T","date":"2016-03-22T07:59:30.776+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias probare esos consejos ;D{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}