{"poster":"Little T","date":"2018-01-14T06:09:08.282+0000","title":"Lore de campeón creado  - Cap 1: \"Maleficio de corazón\"","subforum":"Creaciones de la comunidad","up_votes":7,"down_votes":1,"body":"Algunas leyendas nacen de la luz... y otras desde los rincones profundos de las sombras...\n\n     En una era olvidada, conocida por aquellos que la vivieron como &quot;el milenio de marfil&quot;, se alzo un gran Rey que naci&oacute; y desapareci&oacute; al final de esta era... su nombre resonaba por todo el mundo, fue reconocido como el mas sabio y grande de su extirpe... Voreas Barham.\nEl Rey fue conocido por traer una gran cantidad de conocimientos al mundo y creaciones de gran poder... \n\n     Voreas era ya una persona adulta, pero jamas pudo concretar su amor hacia la mujer que anhelaba, sus mas cercanos no entend&iacute;an por que no buscaba a una princesa o una reina de otros pa&iacute;ses, pero Voreas no aceptaba que sus sentimientos fueran impuestos, pero tambi&eacute;n le dol&iacute;a el hecho que sus familiares y amigos no aceptaran lo que el sent&iacute;a... a la verdadera mujer que amaba.\n\n     El Rey cay&oacute; enfermo luego de un terrible invierno que trajo consigo vientos repletos de enfermedades y que destruyo campos enteros de siembra.\n     Pero para fortuna del Rey all&iacute; estaba... la mujer que amaba, una enfermera del castillo... Voreas miraba su cabello casta&ntilde;o, sus pecas en sus mejillas y sus labios tan resplandecientes, la forma en que la miraba era entre lujuriosa y amorosa... \n     El Soberano y la enfermera se conoc&iacute;an desde ni&ntilde;os, ellos sol&iacute;an reunirse en los patios del castillo y jugaban todo el d&iacute;a... su nombre... Asiel.\n     Debido a que los sirvientes del castillo no ten&iacute;an apellido, tanto de Asiel y su madre solo se sabia su nombre.\n     Luego de esa enfermedad en la que el Rey cay&oacute; enfermo, Asiel y Voreas recordaron sus momentos de j&oacute;venes y una vez mas... naci&oacute; una chispa en sus corazones...\n\n     Por desgracia en toda historia hay un &quot;pero&quot;...\n     El reino comenz&oacute; a perder recursos y alimentos, todo debido a ese invierno tan hostil... \n     El Rey no tuvo otra opci&oacute;n que pedir ayuda a un pa&iacute;s vecino, aunque Voreas sabia que no seria sencillo... el reino vecino era dominado por una Reina Bruja conocida como &quot;Caliope&quot;, portadora de una belleza y poder inmenso... la Reina estaba extremadamente enamorada de Voreas, pero el Rey no tenia coraz&oacute;n para ella... pero ahora la Reina Bruja encontr&oacute; una forma de apoderarse del coraz&oacute;n del Soberano.\n     Caliope solo aceptar&iacute;a entregar recursos al reino si Voreas contra&iacute;a matrimonio con ella...\n     Las semanas pasaban y el Rey ve&iacute;a como su gente mor&iacute;a de hambre... no tuvo elecci&oacute;n.\n     Caliope y Voreas estuvieron casados durante 5 a&ntilde;os, todo parec&iacute;a estar en paz en los 2 reinos... pero el Rey no pod&iacute;a enga&ntilde;ar a su coraz&oacute;n, el amaba a otra persona... y el era amado por esa persona tambi&eacute;n.\n\n     Luego de a&ntilde;os de casados el Soberano comenz&oacute; a tener un amor&iacute;o con Asiel, se encontraban en los s&oacute;tanos del castillo, un lugar donde cre&iacute;an nadie los encontrar&iacute;an... y all&iacute; concretaban su amor...\n    No paso mucho tiempo hasta que fueron descubiertos por uno de los esclavos... \n    La sirvienta quedo embarazada unos meses despu&eacute;s, la felicidad de la pareja era infinita... \n    Chismeo tras chismeo, no tardo mucho hasta llegar a los o&iacute;dos de Caliope, y ella llena de furia maldijo a los hijos de Voreas y Asiel...\n&quot;Condeno a tus dos hijos a vivir entre desgracias... uno nacer&aacute; con su sombra adherida a la carne y huesos , y el otro jamas sabr&aacute; si es humano&quot;\n    Luego de pronunciar estas palabras la bruja se retiro con una sonrisa burlona en su rostro y en tranquilidad volvi&oacute; a su pa&iacute;s...\n    Esas palabras hicieron temblar tanto a Voreas como a Asiel... \n\n    Pasaron 6 meses y por fin nacieron, los futuros herederos del trono... pero... \n     El primer ni&ntilde;o naci&oacute; completamente normal, a excepci&oacute;n de un detalle... el ni&ntilde;o naci&oacute; sin largar un signo de vida, al principio se pens&oacute; que habia nacido muerto... pero a los pocos segundos reacciona y sin largar un llanto se tranquiliza... a este se le puso de nombre Balthazar\n     El segundo claramente fue muy distinto... pero no por su parto, si no... por su apariencia f&iacute;sica... tenia... caracter&iacute;sticas animales, como de algun felino... a este se le nombro como Vastaya\n\ny este fue el comienzo de la ca&iacute;da de la Edad de Marfil... con el nacimiento de los hermanos Balthazar Barham y Vastaya Barham...\n\nhttp://1.bp.blogspot.com/-S555B8LzXfU/VPC8cMxnVYI/AAAAAAAAA6U/6siT8HvkQIk/s1600/Ann%C3%BAminas_LOTRO.jpg\n\n\nespero que les guste, es mi primera vez que creo una historia tan extensa para un personaje creado por mi... y de hecho, es mi primera vez escribiendo una historia, as&iacute; que cualquier critica constructiva es bienvenida.\ntambi&eacute;n tengo pensado dibujar al campe&oacute;n, y las habilidades ya tengo una idea... pero por ahora me preocupo en darle un origen.\nrecuerden que esto solo es para saber de donde viene mi personaje (que por cierto, no voy a decirles cual es jeje)\n\nsalu2 {{champion:39}} {{item:3643}} {{champion:141}}","replies":[{"poster":"Nisinunglacert","date":"2018-01-14T08:00:41.417+0000","up_votes":2,"down_votes":0,"body":"Solo dos cosas: Hasta ese punto de la historia es muy genérica, supongo que con el tema de los hermanos vas dar más  giros interesantes. Y lo otro, ¿Por qué Balthazar(como tu champ, lo sé) y Vastaya?","replies":[{"poster":"Little T","date":"2018-01-14T08:09:22.235+0000","up_votes":1,"down_votes":0,"body":"> Hasta ese punto de la historia es muy genérica\n\nsi, mas o menos, pero necesitaba una base... y como hace poco me leí un libro que me gusto mucho, me base bastante en eso (Stephen King Los Ojos del Dragón)\n\n> Por qué Balthazar(como tu champ, lo sé)\n\ncorrecto, quise cambiar un poco el origen de mi personaje... la historia que tenia antes no me convencía del todo, así que quise explayarme un poco mas.\n\n> y Vastaya?\n\neso lo veremos en el próximo episodio de dragon ball ;v","replies":[{"poster":"Nisinunglacert","date":"2018-01-14T20:31:18.069+0000","up_votes":1,"down_votes":0,"body":"Lo de genérica no lo digo como algo muy malo, como tu dices es una base y lonque quiero ver es como lo sigues.\n¿Si te pago puedo subir un adelanto en mi canal de Youtube para estar en tendecias?","replies":[]}]}]}]}