{"poster":"Little T","date":"2016-07-21T16:31:53.763+0000","title":"riot me trolea o es que tengo muuuy mala suerte...","subforum":"Off-topic y temas personales","up_votes":1,"down_votes":5,"body":"hoy estaba jugando y en una serie de partidas me toco gente de lo mas graciosa:\r\n\r\nprimera partida- yo con shen: ya venia con la mentalidad de usarlo para ayudar al equipo y hacer objetivos, bien, todo iba bien, hasta que llego a \r\nlvl 6 y decido tirar ulti a bot, primer gank un fail, segundo intento fail, tercer intento faaaaail, el problema era que los tipos eran muuuy maricas y yo por dentro estaba que explotaba, lugo como al min 13 el jungla se retira... derrota\r\n\r\nsegunda partida- voy con taric todo bien, hasta que... jhin: &quot;perd&oacute;n chicos pero tengo lag sta wea no me anda&quot; y yo me quede como -________- otra vez no, en el otro equipo un lee y en el nuestro un lee, a que no adivinan quien no gankeo! :D el que lo adivina saca el \r\ntrofeo de lo obvio... derrota\r\n\r\ntercera partida- voy con shen (de nuevo -__-), un nasus en el otro equipo, lo mismo me paso lo de shen que en la otra vez, pero esta vez con el mid y el jungla a que por cierto tambi&eacute;n era un lee. min 3 de la partida, primera sangre de nasus con ayuda de lee sin y encima en el otro equipo un lee sin, le pido gank al lee y me dice que espere, min 24 de la partida lee no aparece y nasus con 2 kills y un mont&oacute;n de farm... derrota\r\n\r\ncuarta partida- me pudr&iacute; y dije voy a ir con nasus por que en mi interior dije &quot;bueno, ya que uso a nasus supongo que el jungla me vendr&aacute; a ayudar para que pueda ir bien&quot; jungla afk... partida abandonada y yo con la yugular que me explota.\r\n{{champion:17}}","replies":[{"poster":"Hwaxinghz","date":"2016-07-21T22:59:18.019+0000","up_votes":1,"down_votes":0,"body":"Peor me pasó a mi que en la ultima partida para llegar a promo a platino 2 se me corta la luz 2 minutos antes de que ganemos, cuando me pude reconectar PUM derrota (en realidad mi team había ganado pero cuenta como derrota por el AFK) y GG. Y luego seguí jugando para ver si podía volver a entrar en promo (algún día) y 3 partidas seguidas con afk's y trolls. Doble GG.\n\nSi, por cierto son días y días, no siempre pasa eso, es solo mala suerte.","replies":[]},{"poster":"Karont3 Le0","date":"2016-07-21T20:34:26.441+0000","up_votes":1,"down_votes":0,"body":"¿Riot te trolea?\n¿Qué, qué y más qué?\nEs solo una racha mala. Que onda","replies":[]},{"poster":"UmTi","date":"2016-07-21T17:37:25.934+0000","up_votes":1,"down_votes":0,"body":"Solo tienes una racha de derrotas y listo. {{champion:12}} {{champion:201}}","replies":[]},{"poster":" Acantha","date":"2016-07-21T17:05:00.990+0000","up_votes":1,"down_votes":0,"body":"Bueno...así es la vida en el lol... creó!","replies":[]}]}