{"poster":"ShooterCarlos","date":"2016-03-16T11:55:09.129+0000","title":"Voglio arrivare a bronzo V","subforum":"Discussioni generali","up_votes":2,"down_votes":22,"body":"ho questa curiosita di arrivare a bronzo V almeno per farmi un paio di risate e per vedere se con tanto sforzo riesco ad uscirci, il problema &egrave; come ci arrivo? ho giocato soraka senza maestrie e rune e ho vinto, kata con una build troll e ho vinto, anche con la mucca full ap  ho vinto uguale  cosa devo fare!!! non voglio andare afk .un champ cosi scarso da rovinare il game anche se ce la metto tutta o cosa altro mi consigliate ?","replies":[{"poster":"Danioku","date":"2016-03-16T12:00:25.103+0000","up_votes":13,"down_votes":0,"body":"Perdere di proposito non è molto \"sportivo\". \n\nPer realizzare il tuo obiettivo finisci per rovinare il game ad altre persone e vai ad infoltire le infinite schiere dei troll dell'Elohell....  Pensa ad un povero bronzo che sta facendo di tutto per salire e lo fai perdere apposta :) Quanto può essere grande il suo odio verso di te ? \n\nTra l'altro sei anche passibile di sanzioni per questo comportamento.... \n\nFesta rovinata, sry ma è così....","replies":[{"poster":"Floppyz","date":"2016-03-16T12:05:36.694+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Danioku,realm=EUW,application-id=MJVj50Jw,discussion-id=VLTiNR5z,comment-id=0001,timestamp=2016-03-16T12:00:25.103+0000)\n>\n> Perdere di proposito non è molto \"sportivo\". Per realizzare il tuo obiettivo finisci per rovinare il game ad altre persone e vai ad infoltire le infinite schiere dei troll dell'Elohell.... \n> \n> Tra l'altro sei anche passibile di sanzioni per questo comportamento.... \n> \n> Festa rovinata, sry ma è così....\n\nEcco appunto, mi sembra proprio una cosa brutta da fare... Ti rendi conto che penalizzi ingiustamente altri giocatori, che magari vorrebbero (e meriterebbero) di vincere?","replies":[{"poster":"Drakethehero","date":"2016-03-16T15:32:18.179+0000","up_votes":2,"down_votes":0,"body":"infatti è grazie a sti dementi se non si riesce a uscire da da l bronzo/silver, sono main supp e quando non vado io supp, curiosamente o trovo un supp scarso, oppure trolla perché voleva un'altra lane, tipo un fizz che mi rubava la jungla, o un'altro che stava mid con me","replies":[{"poster":"Frattaglia","date":"2016-03-16T16:27:22.665+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Drakethehero,realm=EUW,application-id=MJVj50Jw,discussion-id=VLTiNR5z,comment-id=000100000000,timestamp=2016-03-16T15:32:18.179+0000)\n>\n> infatti è grazie a sti dementi se non si riesce a uscire da da l bronzo/silver, sono main supp e quando non vado io supp, curiosamente o trovo un supp scarso, oppure trolla perché voleva un'altra lane, tipo un fizz che mi rubava la jungla, o un'altro che stava mid con me\n\nQuesta del support che trolla la trovo irreale con la coda dinamica. \nLe rare volte che non sono capitata support ho sempre chiesto di switchare e il tipo non ha mai voluto in quanto era main support anche lui. Poi magari giocava peggio di me, però di solito nelle stagioni passate chi ti trollava perché non voleva andare support era sempre gente che era stata obbligata ad andarci perché erano last pick.\n\np.s. comunque hai un buon win rate con i campioni che hai più giocato... se smettessi di giocare champ a caso (hai una quarantina di champ giocati in ranked) e continuassi a giocare quei 2-3 con cui hai dei buoni risultati, saliresti più velocemente","replies":[]}]}]}]},{"poster":"Caliban90","date":"2016-03-16T14:00:31.575+0000","up_votes":5,"down_votes":0,"body":"Io non ho parole... è proprio uno schiaffo in faccia a persone che si impegnano per uscirci, dal B5","replies":[{"poster":"B3L14R","date":"2016-03-16T18:55:45.202+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Tsuki no Faith,realm=EUW,application-id=MJVj50Jw,discussion-id=VLTiNR5z,comment-id=0007,timestamp=2016-03-16T14:00:31.575+0000)\n>\n> Io non ho parole... è proprio uno schiaffo in faccia a persone che si impegnano per uscirci, dal B5\n\nSe fossi in b5 e non riuscirei ad uscirne, anche impegnandomi, cambierei immediatamente gioco. Non ho bisogno di qualcosa che mi deprima l'autostima, specie se non necessaria come lol.","replies":[{"poster":"Frattaglia","date":"2016-03-16T19:22:43.741+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=B3L14R,realm=EUW,application-id=MJVj50Jw,discussion-id=VLTiNR5z,comment-id=00070001,timestamp=2016-03-16T18:55:45.202+0000)\n>\n> Se fossi in b5 e non riuscirei ad uscirne, anche impegnandomi, cambierei immediatamente gioco. Non ho bisogno di qualcosa che mi deprima l'autostima, specie se non necessaria come lol.\n\nPer alcuni l'autostima è arrivare in argento 5 a fine stagione.\nAd altri piace semplicemente giocare e non tryhardano.\n\nInsomma, ognuno ha i suoi fini. C'è anche gente che si gasa perché in una normal una volta ha battuto un oro 5 eh :)","replies":[]}]},{"poster":"Floppyz","date":"2016-03-16T14:01:39.435+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tsuki no Faith,realm=EUW,application-id=MJVj50Jw,discussion-id=VLTiNR5z,comment-id=0007,timestamp=2016-03-16T14:00:31.575+0000)\n>\n> Io non ho parole... è proprio uno schiaffo in faccia a persone che si impegnano per uscirci, dal B5\n\nEsatto, e te lo dice uno che in bronze IV ci è nato (ma fortunatamente non cresciuto).","replies":[]}]},{"poster":"Boldstriker","date":"2016-03-16T12:29:40.473+0000","up_votes":5,"down_votes":0,"body":"Ognuno merita il livello _più alto_ che raggiunge, non il più basso, come citato in altri commenti, sono proprio le persone come te che rovinano l'esperienza di gioco a chi giustamente importa di voler vincere per ottenere un certo prestigio (?) o solamente per una soddisfazione personale (much better), almeno evita di scrivere dei post così sul forum di gioco...\n\nA meno che a te non freghi proprio nulla del suddetto.\n\nAllora sei solo una persona priva del senso di rispetto per gli altri, non mi stupisco per questo.\n\nMa a mamma Riot quelli come te non piacciono! \n\nIn ultima analisi, se proprio tu avessi voluto raggiungere il bronzo, lo avresti potuto tranquillamente fare \" giocando male \" di proposito, senza dire niente a nessuno, sai, il rapporto per il giocatore inesperto non comporta ban o sentenze particolari.\n\n> \"_A nessuno è mai nociuto essere stato zitto._\"","replies":[{"poster":"Ste the ripper","date":"2016-03-17T00:02:11.254+0000","up_votes":2,"down_votes":0,"body":"> Ognuno merita il livello più alto che raggiunge, non il più basso, come citato in altri commenti\n\nNon sono d'accordo, lol è pieno di gente che ha raggiunti livelli medi - alti in seguito a immense botte di fortuna e poi è scesa, c'è gente che è arrivata in diamond sfruttando congiunzioni favorevoli del meta e di winstreak e poi è scesa in gold.\nInoltre soprattutto a elo alto l'inizio season è una vera clownfiesta dove semplicemente spammando partite a caso si può fare il challenger ( paolocannone coff coff) per poi ridiscendere in diamond, se tu prendi un challenger alla prima settimana e un challenger all'ultima settimana della season ( non preseason!) talvolta possono esserci differenze a dir poco abissali di skill.\nNon parlo nemmeno di preaseason perché lì avviene tutto e il contrario di tutto, basti pensare che la preseason 6 al primo posto in challenger c'era uno che aveva chiuso la season in master 100lp... Questo tipo in 1 mese è passato da master 100lp a challenger 970lp superando gente come rekkles semplicemente perché più nessuno giocava seriamente ( inteso per grindare la classifica)","replies":[{"poster":"Boldstriker","date":"2016-03-17T08:31:03.969+0000","up_votes":1,"down_votes":0,"body":"Hmm! {{champion:74}}  \nValido argomento, non sono esperto di come funzioni il sistema di valutazione delle partite classificate, ma stando a quello che dici, c'è chi approfitta di una particolare situazione (periodica a quanto sembra) per arrivare a livelli più alti con meno fatica.\n\nCosa posso dire? La mia frase che citi fa riferimento al post più in alto, e l'ho scritta pensando \"all'utente medio\" in una situazione \"tipica\", ma per essere precisi, era riferita ad un argomento molto _simile_.\n\nTu giustamente mi hai portato esempi validi di persone che hanno raggiunto un alto _elo_ sfruttando delle ... falle? Dico falle ok, falle del sistema, ora io non sono nessuno per giudicare come Mamma riot ci dispone nella lega, però anche tu hai detto:\n\n> Non sono d'accordo, lol è pieno di gente che ha raggiunti livelli medi - alti in seguito a immense botte di fortuna e poi è scesa, c'è gente che è arrivata in diamond sfruttando congiunzioni favorevoli del meta e di winstreak e poi è scesa in gold.\n\nÈ quel _\"scesa\"_ ad essere importante, poiché in un sistema di valutazione (lo dico ancora una volta) imperfetto può capitare questo genere di cose [E tu giustamente lo fai notare] chi si ritrova ad un elo più alto, per il quale sicuramente non è preparato, è destinato a scendere, a meno che non impari in fretta. Personalmente trovo questo un sistema di correzione alla _\"selezione naturale\"_ :\n\n* arrivi nell'arena dei lombrichi ~~dove ci sono io!~~? Affila la tua spada di legno.\n* UH! se finito nell'arena dei leoni per colpo di fortuna? Impara in fretta amico mio!\n\nIn ultima analisi credo che la mia frase che citi sia _corretta_ SSE la riformulo in questo modo:   \n> **A parità di condizioni** ognuno raggiunge il livello più alto che si merita.\n\nPerché chiaramente non ero a conoscenza di questi periodi dell'anno dove si sale e scende come la ~~rudera~~ marea.\nChiederò scusa a mamma Riot per la mia ignoranza. {{item:3108}} {{item:3152}} {{item:3041}} {{item:1052}}","replies":[]}]}]},{"poster":"NotAJunglerMain","date":"2016-03-16T12:14:55.712+0000","up_votes":4,"down_votes":1,"body":"Secondo me se proprio vuoi scendere approffitta della dinamic Q per trovare altri 4 smurf. Quando sarete 5 vi basterà startare e stare in base dicendo open mid. Ogni 10 minuti vi fate una ranked e così, senza rovinare partite a nessuno, arriverai in bronzo.","replies":[{"poster":"Re Sombra","date":"2016-03-16T12:18:03.955+0000","up_votes":1,"down_votes":0,"body":"Questo sarebbe l unico metodo che appoggerei.","replies":[{"poster":"Danioku","date":"2016-03-16T12:23:06.735+0000","up_votes":2,"down_votes":0,"body":"Una volta arrivato in bronzo V, pensa a quelli che poi si trovano a giocare con un player che non è di quell'elo e che li stompa per il gusto di sentirsi forte contro i deboli .... Neanche loro vivrebbero una bella esperienza di gioco mi sà.... \n\nNel Reddit che ho linkato è spiegato molto bene","replies":[{"poster":"Re Sombra","date":"2016-03-16T12:31:00.893+0000","up_votes":1,"down_votes":0,"body":"Io infatti lo appoggerei solo per arrivarci; è ovvio pero che sojo contro ste cose.","replies":[]}]}]},{"poster":"Danioku","date":"2016-03-16T12:17:28.465+0000","up_votes":1,"down_votes":0,"body":"Ti consiglio di non farlo mai. Riot si è espressa riguardo questa faccenda e rischi di andare incontro a ban e sanzioni. \n\nhttps://www.reddit.com/r/leagueoflegends/comments/21dem4/regarding_players_intentionally_losing_games_to/","replies":[{"poster":"Floppyz","date":"2016-03-16T12:23:22.712+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Danioku,realm=EUW,application-id=MJVj50Jw,discussion-id=VLTiNR5z,comment-id=00030000,timestamp=2016-03-16T12:17:28.465+0000)\n>\n> Ti consiglio di non farlo mai. Riot si è espressa riguardo questa faccenda e rischi di andare incontro a ban e sanzioni. \n> \n> https://www.reddit.com/r/leagueoflegends/comments/21dem4/regarding_players_intentionally_losing_games_to/\n\nE fanno bene, anche se mi farebbe molto piacere vedere applicate pene così severe anche per altri genere di comportamento altrettanto (se non più) dannosi.","replies":[]}]}]},{"poster":"Yamero Senpai","date":"2016-03-16T12:31:20.924+0000","up_votes":1,"down_votes":0,"body":"\"Se sei forte sali\"-cit. Tranne se trovi gente così","replies":[{"poster":"Drakethehero","date":"2016-03-16T15:36:20.285+0000","up_votes":2,"down_votes":0,"body":"se sei forte sali è un concetto relativo, poiché in una squadra di 5 persone conta la forza di tutti non del singolo o meglio, quella del singolo conta fino a un certo punto, che è fissato da quanto sono abili quelli con cui giochi e quelli contro cui giochi","replies":[]}]},{"poster":"Re Sombra","date":"2016-03-16T12:14:43.903+0000","up_votes":2,"down_votes":0,"body":"È per colpa di gente come te che molta gente non sale ed è ferma in low elo.","replies":[{"poster":"Drakethehero","date":"2016-03-16T15:33:51.665+0000","up_votes":1,"down_votes":0,"body":"tralasciando gli smurf che boostano i bimbiminkia che ovviamente quando non sono nella TUA squadra, sono un grosso ostacolo","replies":[]}]},{"poster":"MechaBeast","date":"2016-03-16T12:14:58.090+0000","up_votes":2,"down_votes":1,"body":"con la nuova patch è parecchio più facile e veloce salire di livello...quindi io ti consiglierei di fare un account smurf per questa tua idea.\nquando arrivi al 30 fai giocare le renked di piazzamento al cane o al fratellino piccole, e gg helobronze","replies":[]},{"poster":"Niklide","date":"2016-03-21T23:03:58.371+0000","up_votes":1,"down_votes":0,"body":"{{champion:83}}  docet\n\ne poi recalla alla cazzo.....","replies":[]},{"poster":"Elle C","date":"2016-03-17T16:39:21.836+0000","up_votes":1,"down_votes":2,"body":"Per quello che hai scritto nel post è cercato di fare nelle ranked fatto sei un _Teemo_ :D comunque... Comprendo la curiosità... Il modo che io ritengo più \"corretto\" in modo da rovinare meno partite possibili agli altri giocatori è creare uno smurf... O comprarlo se vuoi ma tieni presente che va contro il regolamento della riot e quell account potrebbe essere bannato... Una volta arrivato al trenta perdi intenzionalmente le dieci partite di piazzamento e quell account verrà piazzato in bronzo qualcosa\n\n\n_edit by NiraBlade - Emissary: linguaggio please_","replies":[{"poster":"Elle C","date":"2016-03-21T15:58:51.904+0000","up_votes":1,"down_votes":0,"body":"Se mi rispondo da solo nira legge il commento? Boh comunque buona la correzione ma a leggere il post come fai a non dirgli qualcosa? 😂","replies":[{"poster":"Giovarco","date":"2016-03-21T19:20:37.059+0000","up_votes":1,"down_votes":0,"body":"No, non gli arriverà la notifica. In ogni caso, non c'è da preoccuparsi, visto che il thread ha raggiunto ben 22 downvote.","replies":[{"poster":"Elle C","date":"2016-03-21T22:40:49.398+0000","up_votes":1,"down_votes":0,"body":"La cosa strana è che ho beccato un meno uno pure io .-. Mi sembra di aver dato una risposta piuttosto pacata tutto sommato","replies":[]}]}]}]},{"poster":"ShooterCarlos","date":"2016-03-16T18:11:48.188+0000","up_votes":1,"down_votes":0,"body":"grazie per i consigli eee... mi dispiace per le persone che si sono infastidite in grosso modo e si avete ragione, ma era solo una curiosità. non sono riuscito nel mio obiettivo nel arrivare a bronzo 5 però pazienza era piu forte di me. Dovevo wardare, comprare il trinket blu o quello rosso ,aiutare le altre linee , farmare come cristo comanda hahahha alla fine tutto questo 5 perse e 5 vinte adesso puntero a oro 5 anche se è molto peggio da quello che mi dicono xD","replies":[{"poster":"Floppyz","date":"2016-03-17T09:24:23.361+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ShooterCarlos,realm=EUW,application-id=MJVj50Jw,discussion-id=VLTiNR5z,comment-id=0009,timestamp=2016-03-16T18:11:48.188+0000)\n>\n> adesso puntero a oro 5\n\nBravo, ed in futuro evita esperimenti di questo genere :)\n\nBuona fortuna!","replies":[]}]},{"poster":"serpe97","date":"2016-03-16T14:36:37.732+0000","up_votes":1,"down_votes":0,"body":"se proprio devi dodgia game di continuo e 3 lp per volta pian piano scendi, almeno non fai perdere nessuno lol","replies":[]},{"poster":"IRIDE96","date":"2016-03-16T11:58:37.576+0000","up_votes":1,"down_votes":1,"body":"Che elo sei ora?","replies":[]}]}