{"poster":"Darth Fayeskole","date":"2017-07-27T01:26:08.113+0000","title":"League of Duskblade","subforum":"Champions & Gameplay","up_votes":3,"down_votes":5,"body":"Hey Leute und hey Riot\r\n\r\nUm direkt auf den Punkt zu kommen League of Legends ist nicht mehr League of Legends sondern League of Duskblade.\r\nEs macht einfach kein Spa&szlig; mehr zu spielen, aus den Grund das jeder verdammte tank (z.b. garen) oder jeder verdammte Jungler der keine Assassine ist sich Duskblade holt.Ich sage nur Lee Sin hat sich das vorher nie gekauft und jetzt gehen fast alle lee sins auf Full Lethality und es ist einfach nervt&ouml;tend.\r\nEs ist ein gott verdammtes Assassinen Item und nicht ein Item was sich jeder verdammte champ holen soll.\r\nUnd Riot Ihr habt sehr viel Mist gebaut mit den Duskblade es ist einfach viel zu unbalanced allgemein Lethality ist wieder zu stark.\r\nIch bin nicht der einzige mit dieser Meinung das Lethality und Duskblade das Game wieder kaputt gemacht haben.\r\nJetzt k&ouml;nnen die &quot;Oberpros&quot; wieder ankommen und behaupten was se wollen aber es ist einach die Wahrheit und raubt einen verdammt den Spielspa&szlig;.\r\nAlso meine League Zeit ist damit erstmal vorbei und nicht nur meine sondern auch von vielen anderen Leuten die ich kenne bis Lethality und Duskblade wieder gefixed worden sind.\r\n\r\nMit nicht freundlichen Gr&uuml;&szlig;en\r\n\r\nDestronex","replies":[{"poster":"TerrorRaven","date":"2017-07-27T01:32:48.273+0000","up_votes":3,"down_votes":0,"body":"Der tödlichkeitsfaktor an sich ist nicht das Problem. Lediglich die Dämmerungsklinge ist das Problem. Ich finde, die hätten den Schaden noch weiter senken können (besonders für Fernkämpfer)","replies":[]},{"poster":"Fresh Dumbeldore","date":"2017-07-27T05:58:50.307+0000","up_votes":3,"down_votes":1,"body":"Hab ich mir gedacht, dass du ein [ADC Main](https://euw.op.gg/summoner/userName=++Destronex) bist, da du so rumgeheult hast, weil momentan Lethality wieder stark ist und ADC nicht mehr so stark sind wie die letzten paar Patches ;)\n\n> Jetzt können die \"Oberpros\" wieder ankommen und behaupten was se wollen aber es ist einach die Wahrheit und raubt einen verdammt den Spielspaß.\n\nDu postest etwas in einem Forum **wo man unter den Posts diskutiert** aber schreibst, dass man nichts schreiben soll, da es ja \"sowieso der Wahrheit entspricht\".\n\n> Es macht einfach kein Spaß mehr zu spielen, aus den Grund das jeder verdammte tank (z.b. garen) oder jeder verdammte Jungler der keine Assassine ist sich Duskblade holt.Ich sage nur Lee Sin hat sich das vorher nie gekauft und jetzt gehen fast alle lee sins auf Full Lethality und es ist einfach nervtötend.\n\nVorher gab es auch Lee Sin's die Lethality bzw. Duskblade gebaut hatten, auch wenn nur selten. Und Lethality ist im Moment stark und deshalb kaufen es viele Fighter auch. Und sollte man einfach alle Items der Klasse Y für die Championklasse X einfach nicht kaufbar machen? Nein, denn genau so entsteht eine grosse Varianz was LoL auch ausmacht.\n\nDa du dich hier ja so lautstark darüber beschwerst, dass Assasins (Lethality) ja zu stark sind, eine Gegenfrage: Als vor nicht allzu langer Zeit Botrk geändert wurde, waren fast ausnahmslos alle ADC gut spielbar und an die ungenerfte Caytlin will ich gar nicht denken. Haben die Tank damals auch nur ansatzweise so stark rumgeheult wie ADC, da man als Tank gegen eine (gute) Caytlin im Late und vielfach auch schon Mid gespielt hat, die auch nur ein wenig vom Team protectet wurde, eine Chanche gehabt? Generell wurde man von vielen (guten) ADC einfach nur weggekitet, wenn diese ein wenig Schutz des Team genossen haben.\n\nUnd etwas was ich mir schon länger überlege, wieso sind es eigentlich fast immer die ADC Mains, die man am lautesten und am meisten rumheulen hört? Und die Ausrede \"Weil sie zu schwach sind und von jedem fertig gemacht werden\" gilt nicht, da es schon Zeiten gab, wo es definitiv nicht so war.\n\nFazit: Calm mal deine Boobies, nur weil jetzt nicht mehr deine Klasse die stärkste ist.\n\nEdit: Die Grammatik zweitletzten Abschnitt ist ein bisschen komisch aber ich denke man kann verstehen, was ich sagen möchte.","replies":[]},{"poster":"Uranbrennstab","date":"2017-07-27T05:35:21.455+0000","up_votes":3,"down_votes":1,"body":"Lee Sin ist doch ein Assasin, ich sehe das Problem nicht. Und irgendwie waren Duskblade Fernkämpfer nicht das Problem.","replies":[{"poster":"Fresh Dumbeldore","date":"2017-07-27T05:59:43.516+0000","up_votes":1,"down_votes":0,"body":"Da gebe ich dir Recht.","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2017-07-27T10:54:01.170+0000","up_votes":1,"down_votes":0,"body":"Ähm... ist das Item nicht schon generft worden... also auch nach dem Hotfix? Und wie das jetzt auf dem 7.15er Patch auswirkt... kann halt keiner Vorhersagen. Es ist durchaus möglich, dass Duskblade auf Lee Sin jetzt wieder total ineffizient ist, das aber noch keiner gemerkt hat...","replies":[]},{"poster":"BEAR IRL","date":"2017-07-27T09:02:08.354+0000","up_votes":1,"down_votes":0,"body":"spiel tank problem solved","replies":[]},{"poster":"Necromant","date":"2017-07-27T06:47:04.124+0000","up_votes":1,"down_votes":0,"body":"So als Tipp, selbst als Adc gibt es gewisse Dinge die du unternehmen kannst aktuell um nicht ge-one-shottet zu werden. Ala Masteries. Nur so als Anhaltspunkt ;)","replies":[]},{"poster":"OT Riku","date":"2017-07-27T04:04:48.514+0000","up_votes":1,"down_votes":1,"body":"Ich esse so lange nicht hat bis ich das bekomme was ich will .....","replies":[]}]}