{"poster":"Jellycake Demon","date":"2015-03-08T00:17:00.448+0000","title":"[Champion Concept] Aris, Child of the Frost.","subforum":"Concepts & Creations","up_votes":3,"down_votes":2,"body":"Please leave a Comment, Reply, any Feed Back or Thoughts on this Concept down bellow, i look forward to reading what you leave down in the Comment section.\n\nPrimary: Support. Secondary: Mage. Additional Roles: Player Choice. \nStatistics: Attack Power: 2. Defense Power: 5. Ability Power: 7. Difficulty: 8.\nPlace of Origins: Freljord.\nUpon Selection: whistling tone.\n\n**Friends:** None.\n**Enemies:** None.\n\n**Appearance:** Aris is a 4’4ft tall teenage Caucasian girl that has pale skin, light blue eyes & dark navy blue mid-length hair. on her arms, legs & her back are blue Freljord markings. Aris wears an animal belt coat that covers the majority of her upper torso, she wears leather pants & boots & she has a wolf pelt wrapped around her waist covering her right leg.\n\n***Summoner Spells:***\n{{summoner:4}} & {{summoner:3}}.\n\n***Item Builds:\nStarting Items:***\n{{item:2003}}/{{item:3303}}/{{item:2044}}/{{item:3341}}.\n***Essential Items:*** \n{{item:3092}}/{{item:2049}}/{{item:3222}}.\n***Offensive Items:*** \n{{item:3116}}/{{item:3025}}/{{item:3174}}/{{item:3027}}.\n***Defensive Items:*** \n{{item:3110}}/{{item:3190}}/{{item:3075}}/{{item:3102}}.\n\nHealth: 369(+30). Health Regen.: 2.9(+0.40)\nMana: 264(+29). Mana Regen.: 1.9(+0.39)\nRange: 520(Range). Attack Damage: 25(+2.4)\nArmor: 14(+2.1). Magic Res.: 30(+0)\nAttack Speed: 0.630(+2.2%). Move. Speed: 342.\n\n***Passive: Winters Embrace.***\nAfter Aris has activated an Ability she will be encased in a thin armor of ice that increases Aris’s Armor & Magic Resist by 10% for 3.5 seconds while also Healing Aris by 3% of her Missing HP, once this Passive is used it will go on a 7.5 second Cool Down. \n\n***Q-Ability: Northern Sentinel.*** \nRange: 500. \nCool Down: 22/21.5/21/20.5/20.\nCost: 100.\nHealth: 250/300/350/400/450(+30% bonus AP).\nDamage: 80/100/120/140/160(+40% bonus AP).\n**Activate:** after Aris has chosen a 100-radius location within this Abilities Casting Range then upon its activation she will create an ice statue, once she creates the statue she must chose the direction it faces by choosing an 80-degree 400-range cone. After selecting the direction of the cone the statue will become fully active by providing Vision within 300-radius of itself while its alive, every 0.75 seconds the statue creates a burst of cold air that will deal Magic Damage to all enemies within the cone while also applying a 25% Movement Speed Slow 1.25 seconds. Now Aris can only have 2 statues active at once if she creates a new statue the oldest 1 will shatter being destroyed.\n\n***W-Ability: Biting Cold.*** \nRange: 400. \nCool Down: 16/15.5/15/14.5/14.\nCost: 60/70/80/90/100.\nMagic Damage: 30/40/50/60/70(+50% bonus AP).\n**Activate:** after Aris has either chosen a 185-radius location within this Abilities Casting Range then upon its activation Aris will create a snow patch at the targeted area, when an enemy Champion enter within the 55-radius of the area then the snow patch will turn into a massive icy bear trap that will Stun all enemies within the area for 1.5 seconds & will deal Magic Damage to all Stunned enemies every 0.5 seconds.\n\n***E-Ability: Blinding Blizzard.*** \nRange: Total 600. \nCool Down: 18.5/18/17.5/17/16.5.\nCost: 25 Mana per tick.\nMagic Damage: 25/30/35/40/45(+40% bonus AP).\nBlind Duration: 0.75/1.25/1.75/2.25/2.75.\n**Activate:** after Aris has chosen a broad path with this Ability 400-Range in front of her & 200-Range behind her then upon its activation she will conjure up a powerful gust of snow & freezing cold air to travel in the path, while the snow & wind are traveling down the path any enemies within the path will continue to take Magic Damage every 0.5 seconds while also being Blind for the 2 second duration of this Ability, now enemies will only be Blind if they remain in the path & for a set duration after leaving the path. Now while this Ability is active it will drain Mana every tick of damage the Ability deals also Aris remains stationary while its active but if she moves the Ability will end then it will go on its Cool Down.\n\n***R-Ability: Snow Globe.*** \nRange: Self-Cast.\nCool Down: 195/185/175.\nCost: 110.\nMagic Damage: 160/320/480.\n**Activate:** after Aris has activated this Ability she will encase herself in ice & will start Channeling for 1.5 seconds while remaining Stationary, while Aris is Channeling she is Immune to all Damage but can still be affected by Crowed Control effects like Silence, Knock Up, Knock Back, Stuns & Roots. while this Ability is Channeling Aris will gather large quantities of freezing cold air & ice into a small sphere between her hands, at the end of the Channel Aris will emerge from her icy coat & releasing the stored ice magic which will seek out any active enemy Champion on the Map deal Magic Damage & Root the target for 1.25 seconds.","replies":[{"poster":"Riot Lutzburg","date":"2015-03-10T21:00:48.190+0000","up_votes":1,"down_votes":0,"body":"Another \"cool\" concept, Jelly.  I think the passive is neat but I actually disagree with Squeaky- the first thing I thought of when I saw it is that it needed some sort of internal cooldown.\n\nI like her R and how it seems like the Spooky Ghosts item cranked to 11.  Very  neat to think about it spreading ice along the ground as it travels.\n\nI actually came up with a similar concept for a Freljord support (that even uses ice statues!) named Yura.  [Check her out if you get the chance!](http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/r9aJJyGt-yura-winters-herald)","replies":[{"poster":"Jellycake Demon","date":"2015-03-11T00:02:53.970+0000","up_votes":2,"down_votes":0,"body":"thanx for your feedback again Lutzburg, i knew i should've kept the Cool Down on her main passive, either wise she can spam 3 abilities at once for a very good Heal to negate pretty much any hard damage she took. i'll check out your 2 concepts & leave my feedback.\n\ni also made another Champion after Aris, her name is Gosuto, the Haunting Specter. here's a link if you want to review her:\nhttp://boards.na.leagueoflegends.com/en/player/NA/JellyJackJak22?content_type=discussion","replies":[]}]},{"poster":"Jellycake Demon","date":"2015-04-11T23:13:40.685+0000","up_votes":1,"down_votes":0,"body":"bump","replies":[]},{"poster":"Jellycake Demon","date":"2015-03-16T22:22:28.427+0000","up_votes":1,"down_votes":0,"body":"bump","replies":[]},{"poster":"Jellycake Demon","date":"2015-03-10T20:35:50.971+0000","up_votes":1,"down_votes":0,"body":"bump","replies":[]},{"poster":"Squeekems","date":"2015-03-08T16:05:57.409+0000","up_votes":1,"down_votes":0,"body":"The blind-duration should scale as she levels the ability.\nI do not think the statue should do damage. I like the slow. I like the vision, but the damage might be a bit much. Maybe if it had a timed duration, I would understand the damage. \n\nI would like to know the lore. \n\nI think (my opinion) you are getting a little bit too wordy with your abilities too.","replies":[{"poster":"Jellycake Demon","date":"2015-03-08T20:20:37.389+0000","up_votes":1,"down_votes":0,"body":"thank you for your reply i look forward to what people have to say about my work. i'm sorry if i get wordy with my Abilities its just that people always keep telling me to add more context to what the Ability actually dose even if i simplify it, as for the Q damage i'll put it on a timer.\n\nas for Aris's lore i'm still working on it. but what i have so far is that she is a sort of like a ghostly apparition taking the form of a human girl, both Ashe, Sejuani & Lissandra catch glimpses of her but they just shrug it off. she's been seen dancing in battlefields of dead soldiers always whistling a joyful tune, that's why she doesn't talk, so the 3 sisters started thinking that Aris is some sort of omen.","replies":[]}]},{"poster":"Squeaky101","date":"2015-03-08T00:49:40.903+0000","up_votes":1,"down_votes":0,"body":"Her W is mord's W, and her ult is almost identical to Lissandra's. I'd consider remaking those abilities. Also, the passive is extremely weak, remove the cooldown and it will work.","replies":[{"poster":"Jellycake Demon","date":"2015-03-08T02:50:12.953+0000","up_votes":1,"down_votes":0,"body":"made the changes.","replies":[]}]}]}