{"poster":"Larvenya","date":"2015-02-25T01:38:09.049+0000","title":"Zilean's 5.4-Überarbeitung / Offener Brief an Riot Games","subforum":"Champions & Gameplay","up_votes":3,"down_votes":13,"body":"Kompetenz sucht man seit Jahren bei \"Riot Games Inc(luding Incompetence)\" ja vergeblich, das ist kein Geheimnis.\r\nAber mit dem Patch 5.4 wird Zilean als Supporter vollkommen zerstört.\r\nNach der Vergewaltigung von Sona und Soraka war es ja auch nur eine Frage der Zeit bis Riot sich des Zeitmagiers annimmt\r\n\r\nEffektive Nischentaktikspieler können Zilean jetzt getrost ins Grab werfen.\r\nMan würde meinen wollen Riot würde erstmal die seit Release existierenden Bugs von Azir fixen wollen, aber da mangelt es - wie zuvor bereits erwähnt - vorn und hinten an der fachlichen Kompetenz; jeder Indieentwickler hängt den durchschnittlichen Riot-Developer inzwischen um Längen ab.\r\n\r\nDas hier ist sicher kein Aufruf, aber ich hoffe inständig, dass DerpTrolling mal wieder ihre 400 GBit gegen eure Infrastruktur pressen.\r\nVerdient hättet Ihr es für diese Blasphemie gegen den Meister der Zeit.","replies":[{"poster":"Gelban der Reihe","date":"2015-02-25T16:13:24.416+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Larvenya,realm=EUW,application-id=Wj1wcocU,discussion-id=kY3oFcgL,comment-id=,timestamp=2015-02-25T01:38:09.049+0000)\n>\n> Kompetenz sucht man seit Jahren bei \"Riot Games Inc(luding Incompetence)\" ja vergeblich, das ist kein Geheimnis.\n> Aber mit dem Patch 5.4 wird Zilean als Supporter vollkommen zerstört.\n> Nach der Vergewaltigung von Sona und Soraka war es ja auch nur eine Frage der Zeit bis Riot sich des Zeitmagiers annimmt\n> \n> **Effektive Nischentaktikspieler können Zilean jetzt getrost ins Grab werfen.**\n\n\nEine Geschmacksfrage, die ich nicht teile(n kann).\nIch sehe eher das Gegenteil.","replies":[]},{"poster":"1337 Awly","date":"2015-02-25T06:47:30.711+0000","up_votes":3,"down_votes":1,"body":"Hi,\n\nals aller erstes habe ich den offenen Brief in deinem Post gesucht, jedoch nichts als Anschuldigungen und Beleidigung gefunden. Kannst du den Brief bitte nachreichen, damit dein Threadtitel Sinn ergibt?\n\nWeiterhin verstehe ich deinen Ärger nicht wirklich. Bevor du verallgemeinerst, worauf es schwer ist einzugehen, erklär uns doch bitte, was genau dich stört oder ärgert. Niemand anderes ist für den eigenen Ärger verantwortlich. Wenn du RIOT dafür verantwortlich machst, dass mit Zilean nun etwas nicht stimmt, dann ärgerst du dich vermutlich eigentlich darüber, dass du nun mit dem Champion nicht mehr zufrieden bist, weil er deinem Spielstil nicht mehr entspricht. Was du hierbei vergisst: RIOT macht dieses Spiel und sie machen es nicht, damit sich Spieler ärgern. Sie machen das Spiel auch nicht, weil sie denken, dass ein mittelmäßiges Spiel reichen würde, sondern RIOT will, meiner Meinung nach, wirklich Qualität. Zu Qualität gehört nun mal, dass immer wieder Dinge angepasst werden, damit sie in das Gesamtbild passen. Es sitzt ja niemand in deren Office, dreht Däumchen, sucht sich einen Buchstaben aus, landet per Zufall bei Z und denkt sich: \"Der ist jetzt fällig!\".","replies":[{"poster":"Larvenya","date":"2015-02-25T13:55:28.308+0000","up_votes":3,"down_votes":6,"body":"Ehrlich gesagt glaube ich inzwischen schon, dass Riot es so oder zumindest so ähnlich entscheidet wie du es im letzten Satz beschrieben hast.\n\nWie ein Brief, egal welcher Art, verfasst wird, obliegt wohl allein dem Autoren.\n\nWenn man mit offenen Augen dieses Spiel und dessen Entwicklung verfolgt, dann sieht man technische Inkompetenzen an allen Ecken.\nDie Serverinfrastruktur befindet sich in einem miserablen Zustand, der Wechsel auf das neue Rechenzentrum hat nur auf dem Papier wirkliche Vorteile für die Spieler gebracht.\nIm Gegenteil; die Anzahl der Vorkommnisse, durch die ein Spiel bereits im Anfang durch äußere Einflüsse einseitig begünstigt wird, hat sich in den letzten 2 Jahren deutlich erhöht.\nIch beginne sehr oft mit mehreren anderen Spielern ein Spiel gemeinsam und ich überwache während des Spiels die Stabilität der Internetverbindung dieser Mitspieler. Und wenn dann regelmäßig bereits beim Betreten des Ladebildschirms die selben Mitspieler mit dem mysteriösen Champion \"Keine Verbindung\" antreten und eine Verbindung auch erst wiederhergestellt werden kann, wenn der Spieler nicht nur die eigentliche Spielanwendung beendet, sondern den gesamten Launcher gekillt und neugestartet hat und dabei hoffentlich in keine Warteschlange gerät, dann, ja doch, sehe ich ein sehr großes Kompetenzproblem bei Riot Games.\nUnd das betrifft nur allein den Ladebildschirm.\n\nViel zu oft erhalte ich via Voice die Meldung: \"Super, Atempting to Reconnect!\", was wohl nicht an der Interverbindung der jeweiligen Spieler liegen kann, wenn mir ein Blick auf den zweiten Monitor verrät, dass die Internetverbindung des Mitspielers stabil ist; es also nicht durch einen kurzen Verbindungsabbruch oder gar der 24h-Neuverbindung lag. \nDas selbe gilt für plötzlich auftretende hohe Latenzen von Mitspielern, während mir der selbe Blick auf den zweiten Monitor verrät, dass seine Latenz zu einem Nicht-Riot-Server durchgängig stabil bei ~50ms liegt.\n\nDoch, 1337 Awly, ich sehe meinen Unmut als berechtigt an über diesen inkompetenten Haufen, die in ihrer Firma offenbar die Qualitätssicherung nach China ausgelagert haben.\n\nUnd wenn dann anhaltend an der Balance von Champions herumgedoktort wird, welche stabil ins Spiel passen und teilweise auch \"empfohlene\" Champions für Neuankömmlinge des Spiels sind, diese dann aber - wie Soraka - durch ihre Überarbeitung ungleich schwerer für neue Spieler zu meistern sind, während Riot die schier endlosen tatsächlichen Fehler im Spiel (grüße herzlichst Azir an dieser Stelle!), sowohl in der Technik als auch im Gameplay, ignoriert, dann sehe ich die Inkompetenz erneut bei Riot Games.\n\nRiot Games aktuelle Firmenpolitik scheint \"1 Schritt vor, 9 Schritt zurück\" zu sein, denn das scheint ungefähr das Verhältnis zwischen guten Weiterentwicklungen und der Folge an Fehlern, die sie implementieren, zu sein.\nBestätigt sehe ich die meisten meiner Argumente in Riot's eigenen Patch Notes, in denen sie in der jüngeren Zeit regelmäßig ihre eigenen Fehler und eigene Inkompetenz zugeben - zu eben freundlicher formuliert.\n\nFehler machen ist menschlich, aber wenn die Fehler den PBE verlassen, dann ist dies Inkompetenz auf technischer Seite.\n\nAusnehmen von meinen Inkompetenzunterstellungen möchte ich aber ausdrücklich die Graphic- und Sound Artists bei Riot Games.","replies":[{"poster":"HyperionCH","date":"2015-02-25T16:51:38.376+0000","up_votes":1,"down_votes":0,"body":"Also ich persönlich habe wesentlich weniger Probleme seit dem Umzug des EUW-Servers nach Amsterdam (bis auf Kinderkrankheiten damals natürlich). Eine Verbesserung ist bei mri klar spürbar.\nNur an \"Patch-Tagen\" ist das System zum Einloggen etwas schwieriger. Aber da wollen auch immer alle rein. ;)\n\nZu Zilean:\nZil wurde ja kaum noch gepickt. Die Aufgaben als Supporter konnte er kaum noch erfüllen. Selbst in der LCS - falls er überhaupt gepickt wurde - kam er selten und nicht selten dann Mid.\n\nNun nimmt man ihn DMG weg und gibt ihm mehr CC.\nDies bedeutet: auf Mid ist Zilean nicht mehr so brauchbar, dafür sind seine \"echten\" Sup-Fähigkeiten besser.\nWer Zilean als Support spielt, müsste eigentlich zufrieden mit den Änderungen sein (im Gegensatz zu den Zil-Mid-Spielern ;) ).\nDie Ulti ist nur eine geringe Abschwächung (bzw. dass das W nicht mehr CDR für die Ulti bietet). Selbst in Low Elo (wo btw. Zilean sehr, sehr selten gespielt wird) gibt es nicht alle 30 Sekunden einen TF, wo man seine Ulti benötigt. ;)","replies":[]},{"poster":"4 R4nd0m N008","date":"2015-02-27T07:22:10.311+0000","up_votes":1,"down_votes":0,"body":"Also ich habe GAR KEINE Probleme seit dem Umzug in das neue Rechenzentrum. Meine Freunde mit denen ich spiele haben auch viel viel weniger Probleme.\n\nDen neuen Zilean finde ich viel besser als den alten, endlich kann der mal gefährlich auf der Botlane werden. Früher haste eine Bombe bekommen, bist kurz zurück gegangen und das wars. Der hatte gar keinen Nutzen.","replies":[]}]}]},{"poster":"MeMyselfandBaal","date":"2015-02-25T06:27:53.972+0000","up_votes":2,"down_votes":1,"body":"warte, regst du dich gerade darüber auf, dass ein Champ mit einer Beliebtheit von kurz hinter Yorick UND einer Siegrate von kurz vor Urgot nen Rework bekommt? Weil du anscheindend nicht nur der einzige Spieler in EUW warst, der nicht nur Spaß daran hatte seinen \"W\" Skill zwischen den Ultis zu spammen, sondern der auch noch gut damit war?\n\nFakt ist: Schlechter kann Zilean kaum geworden sein. Nur weil er jetzt als \"Nischensupporter\" tot ist... vielleicht ist er dafür als echter Supporter brauchbar... was ein entscheidender Fortschritt für ihn wäre...","replies":[{"poster":"Larvenya","date":"2015-02-26T01:24:15.395+0000","up_votes":1,"down_votes":1,"body":"Soweit ich das bisher beurteilen kann: Nö, ist er nicht. Spielt sich jetzt genauso wie Sona und Soraka. Fühlt sich beim Spielen an als hätte man ihm die Beine gebrochen.","replies":[]}]},{"poster":"Iron IV dude","date":"2015-03-04T07:10:42.711+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Larvenya,realm=EUW,application-id=Wj1wcocU,discussion-id=kY3oFcgL,comment-id=,timestamp=2015-02-25T01:38:09.049+0000)\n> Effektive Nischentaktikspieler können Zilean jetzt getrost ins Grab werfen.\n> Man würde meinen wollen Riot würde erstmal die seit Release existierenden Bugs von Azir fixen wollen, aber da mangelt es - wie zuvor bereits erwähnt - vorn und hinten an der fachlichen Kompetenz; jeder Indieentwickler hängt den durchschnittlichen Riot-Developer inzwischen um Längen ab.\n\nLol, welcher denn?\nZugegeben, seit Season 5 bauen die irgendwie nur Mist ein, aber welches andere Indieentwicklerteam hat denn etwas vergleichbar komplexes emporgebracht wie Riot?\nAußer QQ und Rage finde ich absolut NICHTS konstruktives in deinem Beitrag.","replies":[]},{"poster":"1337 Awly","date":"2015-02-26T05:47:53.931+0000","up_votes":1,"down_votes":0,"body":"Und woher möchtest du das wissen, dass sie nur Feedback von LCS Profis aufnehmen? Meiner Meinung nach totaler Quatsch.","replies":[{"poster":"Larvenya","date":"2015-02-27T01:51:20.853+0000","up_votes":1,"down_votes":0,"body":"> Und woher möchtest du das wissen, dass sie nur Feedback von LCS Profis aufnehmen? \n\nLesen!\n\n> Wenn, dann nehmen sie **scheinbar** nur den Input der sogenannten \"LCS-Pro's\" auf.","replies":[]}]},{"poster":"Wolkenfuß","date":"2015-02-25T15:59:23.504+0000","up_votes":1,"down_votes":0,"body":"Probiert es doch erstmal aus.\nich bin mir sicher ein veränderter Champ ändert nichts an den Spieler Qualitäten. \nHätte Riot einen Neuen Champ mit den selben Fähigkeiten raus gebracht, hätte niemand sich beschwert das der Champ komisch ist. \nIch z.b finde es nicht gut was mit Jannas Passiver gemacht wurde. Aber ich werde mich damit anfreunden.\nUnd mit sicherheit werde ich dadurch als Spieler nicht schlechter!\nLG","replies":[{"poster":"Larvenya","date":"2015-02-26T00:03:50.441+0000","up_votes":1,"down_votes":2,"body":"Janna ist ein genauso gutes Beispiel für eine Supporter-Vergewaltigung. Dabei stört mich weniger die Beschneidung der passiven Fähigkeit, sondern viel mehr die Verschmählung der Q. Damit ist sie per se als Mid Laner oder Notfall-Lane-Pusher auf der Bot nutzlos.\n\nVielleicht verfolgt Riot derzeit ja auch die Taktik sämtliche Supporter nutzlos zu machen und auf lange Sicht nur noch unterstützende Angriffshelfer an der ADC-Seite zu etablieren.","replies":[]}]},{"poster":"1337 Awly","date":"2015-02-25T14:21:17.882+0000","up_votes":1,"down_votes":0,"body":"Ich sehe worauf du hinaus möchtest. Und kann sicher auch deine Gedankengänge verstehen. Allerdings wissen weder du noch ich (vll. noch RIOT), wie sich der Patch, welcher auf dem PBE ist, im Livebetrieb auswirkt, auf dem 4mio aktive Spieler spielen. Das erinnert mich ein bisschen an den Launch von H1Z1 von SOE. Das Spiel wurde vor kurzem gelaunched und der Launch war einfach eine Katastrophe. Ich habe es selber nur am Rand mitbekommen, doch Testumgebungen heißen so, weil sie Testumgebungen sind und eben nicht das Livesystem. Auf dem PBE und anderen Testservern (ich bezweifle, dass RIOT nur den PBE hat) lassen sich einfach nicht die selben Bedingungen Simulieren, wie sie sich im Endeffekt auf dem Livesystem darstellen.\n\nZu den Verbindungsproblemen, die du beschrieben hast: Ich habe selber hin und wieder mal Lagspikes und natürlich nervt es mich. Allerdings frage ich mich, ob es nicht vielleicht noch schlimmer wäre, wenn wir immer das alte Rechenzentrum noch benutzen würden. Who knows? Vielleicht wäre es dann auf Grund des Wachstums, überhaupt nicht mehr spielbar und man arbeitet aktuell weiterhin daran, dass es wieder besser wird.\n\nNicht umsonst machen z.B. auch viele MMO's mittlerweile riesige Stresstests, bevor sie ein Spiel live nehmen. Wir reden hier natürlich nicht davon, dass LoL vor dem Release steht, sondern lediglich von Patchserien, in denen Fehler passieren.\n\nWas du hier beschreibst ist sehr sehr subjektiv. Dir gefällt nicht, was RIOT mit Zilean gemacht hat und es mag sicher so aussehen, als ob das alle Spieler genauso sehen, wenn sich noch 25 weitere in diesem Thread melden und dir beipflichten. Doch ich traue RIOT zu, dass sie schon auf die Community hören und sicher ihre Quellen und Auswertungen haben, die sie bei einem Umbau von Champions zu Rate ziehen. Versteh mich bitte nicht falsch, ich möchte dir nicht das Recht absprechen, das, was RIOT hier geändert hat, doof zu finden. Ich finde manche Sachen auch doof. Aber ich frage mich dann eher, was die Intention dahinter war. Uns beiden fehlt der Einblick, um diese Situation zu 100% erfassen zu können.\n\nDu siehst die aktuelle Firmenpolitik als 1 Schritt vor und 9 Zurück an. Ich sehe sie als X Schritte vor und X zurück an. Ich kann keine Äußerung dazu treffen, was das langfristige Ziel der Firma ist und wieso sie meinen, dass der Schritt den sie gegangen sind, für sie ein richtiger war.\n\nViele Grüße\n\nAwly","replies":[{"poster":"Larvenya","date":"2015-02-26T04:19:36.651+0000","up_votes":1,"down_votes":1,"body":"> Doch ich traue RIOT zu, dass sie schon auf die Community hören und sicher ihre Quellen und Auswertungen haben, die sie bei einem Umbau von Champions zu Rate ziehen.\nIch kann mich irren und meine Meinung ist selbstverständlich nicht stellvertretend für die gesamte oder ganze Teile der Community, aber ich habe nie das Gefühl, dass Riot sich jemals auch nur im geringsten dafür interessiert hat was Spieler denken, obgleich ich regelmäßig Feedback einsende.\n\nWenn, dann nehmen sie scheinbar nur den Input der sogenannten \"LCS-Pro's\" auf.\n\nDie LCS ist auch so etwas, was mich extrem an Riot nervt. Warum gibt es nirgendwo eine Einstellungsmöglichkeit wie etwa\n\"[X] Bitte jeden LCS-Müll im Launcher ausblenden, da mich dieser Mist nicht interessiert\".","replies":[]}]},{"poster":"Suppœrt","date":"2015-02-25T09:44:51.236+0000","up_votes":1,"down_votes":0,"body":"Q Q Q\n\nZilian ist so nervig geworden als Gegner als Gegner kann man nirgends wo mehr stehen oder hingehen ich Find ihn gut !!","replies":[]},{"poster":"Titanium70","date":"2015-02-25T03:30:30.021+0000","up_votes":1,"down_votes":0,"body":"Ich halte das Zilean-Rework eigentlich für gelungen (tatsächlich mag ich den ganzen Patch), weniger DMG und höheres Skill-Cap dafür tonnenweise CC. Was mich an dem Patch stört.. oder eher verwirrt ist der pseudo Nerf für Kata* sowie der Veigar-NERF! \n\n\n*Naja in manchen Mid-Game-Fights mag es evtl nützlich ein, aber am Kernproblem Kata ändert sich dadurch kaum etwas - naja ich bin ja schon froh, dass die ursprünglich geplanten Änderungen nicht durchgekommen sind. ^^'","replies":[]},{"poster":"Bergelmir32","date":"2015-02-25T02:47:19.147+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Larvenya,realm=EUW,application-id=Wj1wcocU,discussion-id=kY3oFcgL,comment-id=,timestamp=2015-02-25T01:38:09.049+0000)\n>\n> Kompetenz sucht man seit Jahren bei \"Riot Games Inc(luding Incompetence)\" ja vergeblich, das ist kein Geheimnis.\n> Aber mit dem Patch 5.4 wird Zilean als Supporter vollkommen zerstört.\n> Nach der Vergewaltigung von Sona und Soraka war es ja auch nur eine Frage der Zeit bis Riot sich des Zeitmagiers annimmt\n> \n> Effektive Nischentaktikspieler können Zilean jetzt getrost ins Grab werfen.\n> Man würde meinen wollen Riot würde erstmal die seit Release existierenden Bugs von Azir fixen wollen, aber da mangelt es - wie zuvor bereits erwähnt - vorn und hinten an der fachlichen Kompetenz; jeder Indieentwickler hängt den durchschnittlichen Riot-Developer inzwischen um Längen ab.\n> \n> Das hier ist sicher kein Aufruf, aber ich hoffe inständig, dass DerpTrolling mal wieder ihre 400 GBit gegen eure Infrastruktur pressen.\n> Verdient hättet Ihr es für diese Blasphemie gegen den Meister der Zeit.\n\nMan könnte jetzt darüber reden das Sona und Soraka sich durchaus gut machen, was genau ein \"Nischentaktikspieler\" ist oder ein bisschen über Leute ranten die von zerstörten, toten etc Champions sprechen aber weist du was,\nwenns dich so ankotzt dann spiel doch einfach was anderes. Wo doch \"jeder Indieentwickler\" sowieso viel besser ist als die Leute bei Riot wirds dir da doch sicher viel besser gehen und alle haben ihre Ruhe.","replies":[{"poster":"Larvenya","date":"2015-02-25T03:46:16.240+0000","up_votes":2,"down_votes":5,"body":"> [{quoted}](name=Dupree0991,realm=EUW,application-id=Wj1wcocU,discussion-id=kY3oFcgL,comment-id=0000,timestamp=2015-02-25T02:47:19.147+0000)\n> wenns dich so ankotzt dann spiel doch einfach was anderes. Wo doch \"jeder Indieentwickler\" sowieso viel besser ist als die Leute bei Riot wirds dir da doch sicher viel besser gehen und alle haben ihre Ruhe.\n\nLangweilig, das Argument liest man viel zu oft von Nutzern, die einfach nur irgendwas schreiben wollen um irgendetwas geschrieben zu haben.","replies":[]}]},{"poster":"Dispnoe","date":"2015-03-03T23:58:33.245+0000","up_votes":1,"down_votes":1,"body":"Erstmal - nicht schön geschrieben, aber im Grunde gebe ich dir recht.\nSoraka ist aus meiner Sicht ein Totalausfall, Sona in etwa so spannend zu spielen wie Tetris ohne Bildschirm.\nDer angedachte Schwerpunkt darauf wichtige \"Entscheidungen\" fällen zu können, wurde bei beiden Characteren ad absurdum geführt,\nund nebenbei: weder ist ihr CC stärker als der CC von den meisten \"Tanky\" Supports (Blitz, Alistair, Leona, Taric, Thresh), noch haben Sona oder Soraka ein effizientes Schadenspotential im Mid- oder Lategame. In die Reihe kann man auch die zu Tode genervte Lulu stellen, damit sie BLOSS NICHT TOP gespielt. Schließlich gehören da Bruiser hin.\nJetzt also Zilean. Die Änderungen waren an mir vorbei gegangen, ich hatte die Patch Notizen bisher nicht gelesen und wollte einfach nur Zilean im Teamersteller als Support spielen. Konsequenz? Ich hab circa eine halbe Stunde lang wütend auf Riot geflucht. Die Bomben die tatsächlich den Gegner trafen (und nicht ein gegnerisches Minion, ein eigenes Minion, einen verbündeten Champion o.ä.) beliefen sich auf... vielleicht 20? in 30 Minuten? Doppelbomben auf Champions: 0!\nOkay, ich bin kein besonders guter Skillshooter, nie gewesen. Darum meide ich Charaktere mit einem solchen Schwerpunkt. Aber ich bin auch nicht hundsmiserabel. \n\nWarum treffen die Bomben also nicht?\n1. Der Radius in dem sie am Gegner haften bleiben ist relativ gering. Zudem haften sie an JEDER anderen Einheit die dichter ist. Vor allem in der Laningphase ist an Harassment nicht mehr zu denken\n2. Die Zeit vom Cast bis die Bombe an Ort und Stelle ist, ist vergleichbar mit der guten alten Heimerdinger Granate. Oder diesem schönen Eiszauber von Anivia. Selbst wenn ich vorhersehe wohin sich der Gegner bewegt - er hat alle Zeit der Welt der Bombe auszuweichen.\n3. Der Glücksfall tritt ein und ich habe getroffen! Und muss enttäuscht feststellen, dass ich obwohl es deutlich schwieriger geworden ist, weniger Schaden mache. Achja... stimmt die Bomben haben ja jetzt CC Potential! Das nur leider nicht in Erscheinung tritt. Besonders lustig sind Zilean Bomben übrigens gegen Fizz. Der springt munter durch gelegte Bomben.\nEXTREMER NERV\n\nDas E verlangsamt jetzt um **99% !!!!!111elf** Tolle Sache? Nein.\n1. Da mein Schaden nicht mehr verlässlich ist und meine Ulti als Supporter besser nicht für mich draufgehen sollte - welchen Sinn hat es nach vorn zu stürmen um jemanden zu verlangsamen? Hey ich könnte DANN ja meine Bombe werfen...\nDumm nur das Zilean eben KEIN Tank ist und NICHT in der vorderen Reihe stehen sollte - die Reichweite vom E ist für ein aggressives Verlangsamen nutzlos. \n2. Bleibt noch das Verlangsamen der gegnerischen Tanks, die in 99% der Fälle einen Gapcloser haben werden (Grüße an Vi, Jarvan, Xin, Pantheon, Malphit...) was also nützt ein 99% verlangsamter Tank der mitten im eigenen Team steht? Nicht viel. Aber HEY DEN KÖNNTE ICH DOPPELBOMBEN! was gibt es Schönereres als mein ohnehin minimales Schadenspotential auf Tanks zu werfen... Und dann ist er nicht nur 99% verlangsamt sondern auch 1,5 Sekunden gestunt! Nur als Vergleich - Alistair, Taric, Leona, Thresh, selbst Annie stellen diesen CC problemlos in den Schatten.\n3. Schön wäre eine skalierung von Beschleunigungs und  Verlangsamungseffekten auf AP (oder AD. oder Leben. oder irgendwas) gewesen. Gibts aber nicht. Danke Riot.\nAlles in allem - minimaler BUFF\n\nDas W wirkt nicht mehr auf die Ultimative Fähigkeit - dafür wurde die Abklingzeiten reduziert! Hey, kein sinnloses W drücken mehr - Super? Nein.\n1. Klar ein bisschen sinnlos war das immer mit dem W. Aber ich hatte zumindest eine Entscheidung im Verlauf des Spiels zu treffen - erst W maxen um die Ulti schneller zu bekommen, oder erst E für Beschleunigung/Verlangsamen, oder Q für Schaden?\nDie Entscheidung wurde mir jetzt abgenommen von RIOT, die Skillorder ist im Grunde komplett vorgeschrieben.\n2. Wenn die Ulti jetzt im Lategame die gleiche Abklingzeit hätte, wie vor dem mit maximiertem W unter Dauereinsatz - hat sie aber nicht. Von daher ist das ein klarer NERV.\n\nUnd als letztes:\nDie Abklingzeiten der Bomben wurden geändert. Nicht mehr durchgehend 10 sondern jetzt 12 Sekunden auf level 1 und 8 auf level 5. Da Zilean vor allem im Early und Midgame seine Stärken hatte - vom Schadenspotential - auch hier ein klarer NERV.\n\nFazit:\nZilean hat nun überhaupt keine klare Kontur mehr. Weder ist er ein aggressiver Earlygame Support - das Schadenspotential wurde ihm genommen -\nnoch ist er ein überragender Midlaner - er konnte schon vorher vom Schadenspotential nicht mit gängigen Midlanern mithalten.\nWas bleibt? Ein Nischenischenmagier, die eventuell gegen einige Nahkampf-ohne-Mobilität Charaktere MID oder TOP interessant sein könnte. Sein Spielgefühl ist (genau wie bei Soraka) grundlegend zerstört.\nEs mag einige Spieler geben, die (auch auf Grund ihres Alters, mit 32 ist meine Reaktionsgeschwindigkeit schlicht langsamer als die eines 14 Jährigen) sehr gut vorrausahnend Skillshots anbringen können jetzt ihren Spaß mit dem Magier haben. Wäre schön. Ich zweifle da aber sehr stark dran. Das Zoningpotential der Bomben kann mit vergleichbaren Champions (Zyra, Maokai) nicht ansatzweise mithalten.\n\nFür mich?\n\nR.i.P. Zilean. Ich hatte lange Zeit viel Spaß mit dir. Und leider, leider bist du ein weiterer Indikator dafür geworden, dass die (neue) Spielphilosophie von RIOT mir keine Freude bereitet.","replies":[]}]}