{"poster":"Joerlius","date":"2014-09-29T15:17:27.414+0000","title":"Meccselőzmények!","up_votes":2,"down_votes":0,"body":"Sziasztok. \r\nSzeretnék érdeklődni, hogy tapasztalt-e valaki ilyen hibát , amit én ?! \r\nMár hetek óta nem tudom megnézni a meccselőzményeimet! Írtam a Supportnak is, de az a válasz érkezett, hogy valószínű a böngészőmmel lehet valami baj. Kipróbáltam másik gépen is és ott se működött! Azért csináltam meg a Topicot, mert remélem olvassa valaki, aki ez ügyben tudna segíteni! \r\nRemélem sikerül ezt megoldani.\r\nÜdv mindenkinek. Joerlius {{champion:121}}","replies":[{"poster":"iSPZ","date":"2014-09-29T15:34:13.694+0000","title":null,"up_votes":2,"down_votes":0,"body":"Valószínűleg [ez](http://boards.eune.leagueoflegends.com/hu/c/altalanos-beszelgetes/mluWu61l-ezreal-nak-miaort-nincs-jobb-passzauvja?comment=0000000000000000) Neked is segít.","replies":[{"poster":"Joerlius","date":"2014-10-01T11:54:03.116+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szia! Sajnos nekem ezek se segítettek ! Kitöröltem mindent! Kipróbáltam másik gépen is kipróbáltam telefonon, iPad-en más böngészővel is és semmi! egyszerűen ez a fehér kép jön be. Sok haverom is erre a hibára panaszkodik!","replies":[{"poster":"M4dr4c","date":"2014-10-02T11:10:57.871+0000","title":null,"up_votes":1,"down_votes":0,"body":"Én még azt is megkérdem, hogy már a kereső se jön be vagy csak a saját statod? Illetve, ha a kereső rész bejön akkor, ha másra keresel rá az bejön?","replies":[{"poster":"Joerlius","date":"2014-10-20T19:36:34.306+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szia ! Már a kereső sem jön be ! Mellékeltem a képet mit látok! Írtam a Supportnak, de semmi megoldás, gyorsítótár törléssel se. Másik gépen a cégnél, ahol dolgozok megnéztem és ott se megy ! Az összes társam erre panaszkodik de semmi nem történik !!! HAHÓÓÓ VALAKI CSINÁLJA MEG !","replies":[]}]},{"poster":"iSPZ","date":"2014-10-01T14:55:56.484+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hát ez érdekes, nem tudom mi lehet a probléma, 98%-ban a gyorsítótár törlés megoldja a problémát már ha van... Nekem amióta kijött azóta semmi nem volt vele, most is 1-2 másodperc alatt betöltött, a gyorsítótár is tele van, nem volt mostanában törölve. Böngésző mennyire friss? Böngésző újratelepítése? Megnyitás után próbáltátok hogy vártok 1-2 percet? Se vírusirtó se a böngészőben nincs letiltva az oldal? Esetleg a böngészőben található kiegészítők nem blokkolják, frissek, Adobe Flash?\n\nUtánanézek mélyebben, mindenesetre kicsit vizsgálódj ezek terén.","replies":[]}]}]},{"poster":"IVIugen","date":"2014-10-20T00:22:42.819+0000","title":null,"up_votes":1,"down_votes":0,"body":"Én Eune szerveren vagyok, ugyan ez a hiba van nálam is. Ahogy átváltok Euwest-re ott egyből bejön a meccselőzmény ablak eune ben meg csak ez a fehér képernyő....  Valaki írhatna valami okosat :)","replies":[]},{"poster":"OneLittleLioN","date":"2014-10-18T22:57:42.046+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nálam is ugyan ez a hiba! Érdekes módon, az EUW-es oldallal működik csak az EUNE-es oldallal nem. Nem valószínű, hogy az embereknél lenne a probléma.","replies":[]},{"poster":"Meterbacsi","date":"2014-10-05T17:36:47.338+0000","title":null,"up_votes":1,"down_votes":0,"body":"Én az egész windowst újra raktam és így sem működik :/","replies":[{"poster":"iSPZ","date":"2014-10-05T20:01:03.224+0000","title":null,"up_votes":1,"down_votes":0,"body":"Passz, egyszerűen 2-3 Riot ember is azt mondta a gyorsítótár törlés megoldja a problémát, vagy a vírusirtó. Külső programot sem használ, ezt is megkérdeztem, tehát nincs különleges bővítményre szükség, működnie kellene, írj a [játékostámogatásnak](https://support.leagueoflegends.com/anonymous_requests/new) ők hátha tudnak valami okosat mondani.","replies":[]}]}]}