{"poster":"BeeBoy","date":"2019-08-14T03:54:45.063+0000","title":"Parece un chiste","subforum":"Charlas Generales","up_votes":5,"down_votes":1,"body":"Los Rioters no aparecen NUNCA a resolver absolutamente NINGUNA duda ........... pero ojo !\r\n\r\nQue crean un post para avisar que tienen de sponsor a COCA COLA !!!!!\r\n\r\nA NADIEEEEEEEEEE LEEEEEE IMPORTAAAAAAAAA RIOOOOOOOOOOTTTTTTT\r\n\r\n\r\nGracias ya me descargue :)","replies":[{"poster":"Esulc","date":"2019-08-14T04:10:10.383+0000","up_votes":3,"down_votes":1,"body":"A ellos les importa ya que les da plata. Tu duda no da plata, tu no dar plata si no es con RP, tu ser ignorado por los rioters.","replies":[{"poster":"Errør 404","date":"2019-08-14T04:30:23.086+0000","up_votes":2,"down_votes":0,"body":"¿Dios será como los rioters? Lo pregunto porque al rezar me siento ignorado :'(\n\nIgual no creo que los rioters no nos lean, sino no nos censurarían xD ¡El tema es que es imposible responder al inmenso numero de post que se publican a diario! \n\nLo mas probable es que nos lean y nos ignoren porque _\"eso corresponde al soporte tecnico, no al foro\"_, y gg izi.","replies":[{"poster":"VenganceZ","date":"2019-08-14T04:34:23.540+0000","up_votes":1,"down_votes":0,"body":"Por lo de rezar... No tiene nada que ver con el juego pero un sacerdote me dijo que con Dios hay que negociar en el buen sentido: \"Dios necesito esto si me lo das haré esto\" a mí me funcionó me ayudó a sacar 2 veces la misma materia que me lleve durante años en la secu","replies":[{"poster":"Errør 404","date":"2019-08-14T04:39:04.994+0000","up_votes":1,"down_votes":0,"body":"¿Y si mejor lo extorsiono? :O \n\n_\"¡¡Dios, ayudame a aprobar el examen de matemática o voy a trollear 10 partidas seguidas!! >:(((((\"_ Jajajjaa!! xD\n\nBueno, nada, gracias por tu comentario. Te quiero mucho &lt;3\n\nUn abrazooo!! -3-","replies":[{"poster":"Esulc","date":"2019-08-14T06:17:12.684+0000","up_votes":2,"down_votes":0,"body":"O mejor, \"Dios si no me das lo que quiero les dire a todos que no fue la paloma quien embarazo a Maria\".","replies":[]}]}]}]}]}]}