{"poster":"Swiftcast","date":"2018-10-17T18:01:00.019+0000","title":"Mein etwas anderer Nachmittag","subforum":"Allgemeiner Chat","up_votes":5,"down_votes":3,"body":"Tag 1 ohne League of Legends{{sticker:slayer-jinx-catface}} :\n\nAls ich heute nach der Schule heim ging, fragte ich mich traurig{{item:3070}}  wie ich mein Leben ohne LoL leben kann. \nWas soll ich jeden Tag nach der Schule machen? Sport? Bah! \nWas soll ich morgens gegen 1 uhr machen? Etwa schlafen? J&auml;mmerlich ...\nIch habe beschlossen den ersten Tag ohne League mit etwas simplen, yet doch nutzbringendem zu starten. Also direkt nachdem ich 15uhr zuhause war - Jap, habe es endlich mal geschafft mein Zimmer aufzur&auml;umen. Damit meine ich Saugen, Wischen, Zeugs wegschmei&szlig;en usw. Nach ungef&auml;hr 5 Stunden Aufr&auml;umen, musste ich erstmal meine unz&auml;hlbaren wieder entdeckten Sch&auml;tze durchz&auml;hlen (2).\n\nIch habe beim Aufr&auml;umen eine unbenutzte Spotify Karte und ein wenig Kleingeld gefunden! Hat sich also aufjedenfall gelohnt! Ich war erstaunt wieviel ich in so kurzer Zeit geschafft hatte! Das sind ca. 3 League Games ._. \n\nIch dachte es w&auml;re mein Schiksal gewesen, herauszufinden wie effizient und besser mein Leben ohne League w&auml;re. Demnach bin ich gegen halb 5 erstmal zu Edeka gegangen um mir Zeugs zu kaufen{{item:2319}} . Geplant habe ich ne Packung Kaugummies und etwas zu Trinken f&uuml;r die Schule.\n\nIch bin jetzt um 53.98&euro; &auml;rmer. Egal, f@!% league.\n\nEigentlich hoffte ich, dass Gott mir als Zeichen der Richtigkeit meiner neuen Erkenntis -\n\n&gt;  wie effizient und besser mein Leben ohne League w&auml;re\n\nmeine Traumfrau gleich dazu schickt. W&auml;re das nicht ne coole Story, an dem Tag an dem ich mit Videospielen aufgeh&ouml;rt habe, traf ich mein Soulmate!? F Yeah, beste Liebestory ever! Fast.\n\nDas einzige weibliche Wesen dort war leider in meinem Alter, wenn man es mal 3 n&auml;hme. Also, ich habe sie nicht nach ihrem SC gefragt, rip. Ich bin noch immer leicht entt&auml;uscht, Gott.\n\nZur&uuml;ck @home bin ich erstmal f&uuml;r gef&uuml;hlt 3h auf Whatsapp und Snapchat gewesen. Das Resultat war auch eher nicht so sch&ouml;n.\n\nAm Freitag habe ich eine Verabredung in einem Bordell mit einem guten Freund namens Viktor.\nDa ich noch nicht 18 bin muss ich das sowieso auf n&auml;chstes Jahr verschieben.\nMorgen muss ich mit jemanden &uuml;ber TS einen Horrofilm zusammen anschauen.\nMorgen muss ich desweiteren auf das Dach von so nem Club in meiner N&auml;he ... schneidet sich mit dem Horrorfilm (beide Sachen machen nur Abends spa&szlig;).\nFreitag komischerweise nichts yet.\nUnd noch so Kleinigkeiten ... ich kann halt nie Nein sagen ... au&szlig;er, wenn ich nein sage.\n\nIch habe desweiteren eine Hantelbank f&uuml;r 129.95&euro; bestellt ...{{champion:36}} \n\nAu&szlig;erdem habe ich mir von meiner Mutter ein wenig Obst gesnacked, da ich mich seit heute gesund ern&auml;hre.\n\nMein Leben hat und wird sich von jetzt an, ohne League, stark &auml;ndern (zum Besseren)!\n\nBest Regards\n\nSwiftcast\n\nedit: Habe grade beschlossen wieder LoL zu spielen \n\nBest Regards\n\nIIIlllIllIllIIIl\n","replies":[{"poster":"Noxempire","date":"2018-10-18T11:34:20.710+0000","up_votes":2,"down_votes":0,"body":">edit: Habe grade beschlossen wieder LoL zu spielen\n>\n\nOh welche schweren Fehler du an diesem Tage begingst, als du die Kluft verließest und dich dem schändlichen ECHTEN Leben widmetest. \nDie Jungfrauen weinen, der Boden tut sich auf und ein elendes Gejammer des Wehklagens wird sich auf immer verfolgen. \nDas unausweichliche ist somit bestätigt, League of Legends STIRBT und das nur wegen dir Ketzer. \n\n*hust*\n\nÄh, klang doch nach nem ganz spannenden Tag.","replies":[]},{"poster":"IIlIlIllIII","date":"2018-10-17T18:05:37.704+0000","up_votes":1,"down_votes":0,"body":"yikes","replies":[]}]}