{"poster":"Zeirøx Notwênd","date":"2018-02-04T04:46:36.346+0000","title":"Únete a <FBI> Reclutamiento Activo ✓","subforum":"Reclutamiento","up_votes":6,"down_votes":2,"body":"##**(Reclutamiento cerrado, próximo reclutamiento 4/4)**\nBienvenido/a al post de Reclutamiento de FireBirds. \n\n**Características de nuestro grupo:**\n**✱** Entérate de noticias importantes y curiosidades del juego con las secciones del grupo.\n**✱** Participa de Torneos, Sorteos, entre otras cosas que se realizan en FireBirds.\n**✱** ¡Comparte tus experiencias, jugadas y consejos!\n--------------------------------------\n--------------------------------------\n\n#**Contáctanos**\nAdministradores:\n**Dina5u5** (Dueño de FireBirds)\n**DanielMKT** (Oficial)\n**ElguerreroWtf** (Oficial)\n**Eldnoran Start** (Oficial)\n---------------\n_______\n\n> #Respuestas a tus preguntas:\n> \n\n ## **¿Qué son las secciones de FireBirds?**\nPues, las secciones del grupo son como “etiquetas” cada una muestra diferente tipo de información. Estas se crearon con el fin de organizar las noticias y notificaciones entregadas al grupo, según el interés.\n\nPodemos destacar tres secciones importantes, las cuales serían las más frecuentes:\n\n- **ℕews ℳini ➣** La primera sección de , presenta temas interesantes y noticias relevantes. (ej. Reworks, nuevos campeones, aspectos, post, etc)\n- **Gestión☑ ➣** Por esta sección te notificamos de eventos, mantenimiento de miembros o temas sobre la administración. (Todo esto dentro del grupo)\n- **Resumen ➣** Una sección con la intención de recopilar datos para saber que campeones son recomendables y cuales no lo son. (Disponible en cada Versión)\n\n## **¿Qué tipo de eventos se realizan?**\nEn el grupo planeamos Sorteos o Torneos entre los administradores, para participar de algunos Sorteos solo tienes que llevar la etiqueta y estar pendiente de las notificaciones que se realizan en el grupo. Algunos Sorteos destacados: \n\n- ‘**Primer Cumpleaños del grupo**’ (24/10/17), el ganador recibió un aspecto elegible de valor 1350 o 1820 RP.\n- ‘**La Navidad llego a FireBirds**’ (19/12/17), el ganador recibió un aspecto elegible de valor 1350 + un icono.\n\nPara participar en los Torneos del grupo tienes que ser miembro e inscribirte en una página donde solo escribes tu nombre de invocador y en que liga clasificaste la última o la actual temporada, además de agregar en que horario estarás disponible para la fecha de dicho torneo. Cada Torneo tiene reglamentos y temáticas distintas.\n\n- **Próximo Torneo**: Aún se está evaluando que Torneo se hará próximamente.\n\n     \n---------------------------\n---------------------------\n> #Reglamentos del grupo:\n \n- **Expresiones de odio, amenazas e insultos justifican una expulsión.**\n- **Realizar spam de links desconocidos con el fin de perjudicar a otros también justifica la expulsión.**\n- **(~~FireBirds no se entrometerá en los problemas que sucedan entre miembros en partidas fuera del grupo~~)** **El 10/2 hubo cambios con respecto a este tema, si quieres saber más pregunta a los administradores.**\n\n     \n------------------------------------------\n##Si quieres unirte añade a tu lista de amigos a cualquiera de los administradores de FireBirds y pídeles que te inviten al club, es posible que tu solicitud sea contestada tarde en cualquier caso manda otra solicitud a otro Admin.\n##Y si nos eliges…\nhttps://imgur.com/8KLFidy\n\n##            **¡Esperamos darte la Bienvenida! ^^**","replies":[{"poster":"Rakan Wawita","date":"2018-02-04T07:24:44.969+0000","up_votes":4,"down_votes":0,"body":"FBI Lei eso y pensaba que era un grupo que buscaba a las personas que les gustaban las campeonas menores xD\n\n>Saludos y suerte en las partidas!!!!:D:{{champion:150}} Adc Junto a {{champion:497}} Supp y El Gank de {{champion:142}} &lt;3","replies":[]},{"poster":"HypnoVgVg","date":"2018-02-07T02:44:03.189+0000","up_votes":2,"down_votes":0,"body":"Cuanto apoyo {{sticker:sg-kiko}}","replies":[]},{"poster":"Laloz12","date":"2018-02-05T01:42:53.905+0000","up_votes":2,"down_votes":0,"body":"v:","replies":[]},{"poster":"Katastrofica","date":"2018-02-04T08:40:06.440+0000","up_votes":2,"down_votes":0,"body":"Ahi envie solicitud al dueño.\n\nGuardenme un espacio, pls >.<","replies":[{"poster":"Zeirøx Notwênd","date":"2018-02-04T15:16:38.058+0000","up_votes":2,"down_votes":0,"body":"Genial!\nEn cuanto se conecte el dueño del grupo aceptara tu solicitud {{sticker:sg-ahri-2}}","replies":[]}]},{"poster":"FacuUzumaki","date":"2018-02-27T14:53:45.001+0000","up_votes":1,"down_votes":0,"body":"yo quiero entrar","replies":[]}]}