{"poster":"TribbleT","date":"2017-07-09T22:08:52.906+0000","title":"Boosting herausfinden?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":1,"body":"Hey Leute,\r\n\r\ng&auml;be es evtl. eine M&ouml;glichkeit zu sehen, ob sich jemand geboosteD hat?\r\nWeil ein Freund von mir war letzte Saison Silber und hat in dieser 42 Wins und 41 Loses, wurde mit Bronze 5 eingerankt und ist jetzt frisch ein Silber 2 gekommen. Ist das &uuml;berhaupt m&ouml;glich? Ich habe 30 Wins und 46 Loses, wurde in dieser Saison Bronze 3 eingeranked und sitze immernoch dran. \r\nWenn man die Loses und WIns zusammenrechnet h&auml;tte er doch neutrale Games, also Win-Lose-Win-Lose wo dies ja nich viel bringt. Also wie kann es sein dass er so weit oben ist?\r\nDanke schonmal f&uuml;r R&uuml;ckmeldungen.\r\nN&auml;here informationen\r\n\r\nhttps://euw.op.gg/summoner/userName=hexxe2002 - Freund\r\n\r\nhttps://euw.op.gg/summoner/userName=TribbleT - Ich\r\n\r\nMfg\r\nTribbleT","replies":[{"poster":"MBausK","date":"2017-07-21T13:51:56.300+0000","up_votes":1,"down_votes":0,"body":"Wer nach 112 Spielen mit einem Champion eine Winrate von 47% hat, sollte diesen nicht mehr spielen.\n\nDann steigst du auch auf.","replies":[]},{"poster":"Ηastur","date":"2017-07-13T07:36:22.100+0000","up_votes":1,"down_votes":0,"body":"Erstaunlich. Als ich ein ähnliches Thema aufgemacht habe wurde ich ohne irgend einen Kommentar für eine Woche aus dem Forum gesperrt, weil Namecalling nicht erlaubt sei. Hier wird offensichtllich mit zweeierlei Maß gemessen und das empfinde ich alles andere als gut geleitet.\n\nIch sehe laufend Beiträge in denen Namen geschrieben werden, aber bei mir ist das offenbar ganz besonders schlimm.","replies":[]},{"poster":"noch ein Brett","date":"2017-07-10T05:27:56.147+0000","up_votes":1,"down_votes":0,"body":"Wenn Boosting, dann machen das die richtigen Leute.\nDas würde sofort auffallen:\nFarm KDA Sichtwertung Killbeteiligung","replies":[]},{"poster":"Alustus","date":"2017-07-10T00:40:05.817+0000","up_votes":1,"down_votes":0,"body":"Die letzen 18 Spiele sehen normal aus.\nAuch sieht es nicht so aus als sei er Bronze V eingeranked worden zumindest laut op.gg war er nie niedriger als Silber 3.\nVllt war er im FlexQ Bronze 5  (hier gibt es keinen Tier Graph, daher kann ich es nicht prüfen) aber auch da sehe ich keine Spiele die nach einem Boosting service aussehen (letzen 8 Spiele)\nAuch ist es normal das man mit 50% Winrate aufsteigt da man mit einer \"normalen\" MMR mehr punkte bekommt als man verliert  ca. 20 zu 15 .\nIch habe mich auch von Silber 3 nach Gold5 mit 90 (49/41) Spielen hochgespielt.\n\nAlso nein ich denke nicht das er geboostet wurde, da hätte er dann eher eine 70% winrate bzw. Spiele in denen er 17/2 kda hat (was zumindest die letzten 18 Spiele nicht vorkommt)","replies":[]},{"poster":"Nycaria","date":"2017-07-09T22:21:54.887+0000","up_votes":1,"down_votes":0,"body":"Du hast eine mehr als negative Winrate, dass du nicht aufsteigst ist also nicht verwunderlich.\n\nWas deinen Freund angeht... solange man eine positive Winrate hat kann man gut climben und in den ersten 100 Rankeds oder so, bekommt man auch meines Wissens nach mehr LP.\n\nNur weil er aufsteigt und vielleicht einfach besser ist als du, heißt das nicht, dass er sich boosten lässt ^^","replies":[]},{"poster":"Revilous","date":"2017-07-10T08:14:05.910+0000","up_votes":1,"down_votes":1,"body":"Dein Freund wurde nicht in Bronze 5 eingerankt, sondern in Silber 3. Von Silber 3 auf Silber 2 zu kommen, ist nicht gerade viel, das würde man auch mit negativer Winrate schaffen. Zudem sind professionelle Booster Spieler in high Diamond bis Challenger, die haben in Silber 90% winrate und 4+ KDA, bei deinem Freund sieht das nicht danach aus.","replies":[]},{"poster":"VP Genji","date":"2017-07-09T22:58:24.918+0000","up_votes":1,"down_votes":1,"body":"Guck verlauf dann merkst du ob jemand geboostet wird","replies":[]}]}