{"poster":"Tucanking","date":"2015-02-24T19:49:05.752+0000","title":"Proposta Nuovo Campione : Beater","subforum":"Aiuto e supporto","up_votes":3,"down_votes":1,"body":"Premessa:Le seguenti descrizioni e punteggi sono delle idee personali quindi,se fuori misura o non giuste, adattatele come credete meglio.\r\nPer quanto riguarda l’aspetto grafico spero che possiate accontentarmi. \r\nCon questo vi auguro buona lettura e spero che accettiate la mia proposta.\r\nGrazie a prescindere\r\n\r\n\r\nNome campione: Beater,portatore di equilibrio\r\n\r\nLa storia:\r\n\r\n“È CRESCIUTO!” -Rammus quando racconta l’incontro con Beater-\r\n\r\n                                                                                                        \r\nUn giorno, le terre a sud della Grande Barriera si videro spazzare via da terribili tempeste magiche, che devastarono ogni villaggio umano che vi risiedeva.Durante la strage un bambino venne salvato;Beater.\r\nVenne salvato da una strana creatura con cui ha trascorso i primi anni della sua vita,un’armadillo di nome Rammus.\r\nLui durante il suo viaggio di salvezza portò il bambino con se,finchè un giorno si vidde costretto ad affidarlo ad un’anziano eremita abitante della giungla di Kumungu; Butukari.\r\nL’anziano si innamorò della storia del bambino e anche di lui, decidendo così di insegnare tutto ciò che sapeva al piccolo orfano.\r\nRammus riprese il suo intrepido viaggio alla ricerca del posto in cui sarebbe potuto passare inosservato.\r\nBeater crebbe,imparando le arti del combattimento usando il bambù (abbondante nella giungla di Kumungu), ed imparando le tecniche di sopravvivenza estrema.\r\nButukari,ormai soddisfatto degli insegnamenti dati al suo inaspettato figlio si sentì soddisfatto, e ormai vecchio morì, felice…\r\nBeater fece una promessa al suo padre di vita:” Ti prometto che realizzerò il tuo sogno di portare avanti la stirpe e l’arte del butu jutsu espandendola e rendendoti onore”\r\nCosì,armatosi della canna di bambù che gli regalò il maestro si mise in cammino, portando con se la conoscienza della sacra ricetta della longevità preparata da Butukari. \r\n\r\nViaggiando per terre senza confini insegnò le basi del butu jutsu in giro per il mondo,finchè un giorno arrivò a League of Legends.\r\nAl suo arrivo incontrò una strana creatura,rimase stupefatto;incontrò di nuovo Rammus.Lo riconobbe grazie alla storia che gli raccontò Butukari sul suo arrivo a Kumungu.Da quel giorno si unirono per affrontare le dure prove nelle arene della giustizia.\r\n\r\n\r\n\r\n\r\nBeater graficamente: \r\n\r\nTipo:Umano\r\nAltezza:1,70m\r\nOcchi:Verdi\r\nCorporatura:Robusto\r\nCapelli:Castano chiaro\r\nColore carnagione:Mediterranea\r\n\r\nPorta con se una canna di bambù verde appoggiata dietro al collo sorreggendola con la mano destra all’estremità più grande.\r\n\r\nSi veste sempre con vestiti color verde scuro. (Questo per quanto riguarda l’aspetto classico)\r\n\r\n\r\n\r\nCarattere:\r\n\r\nRiesce a fare battute su le altre persone senza farle arrabbiare.Amichevole con tutti.\r\nIl suo motto:” Chi colpisce nella ragione lede maggiormente”\r\n\r\n\r\n\r\n\r\n\r\nCaratteristiche base-Abilità\r\n\r\n\r\nCaratteristiche base:\r\n\r\nAttacco: 58 (+3.2 per livello)\r\nPotere magico: 0\r\nVelocità di attacco: 0.7/sec (+2,5 per livello)\r\nVelocità di movimento: 345\r\nArmatura: 18 (+3.6 per livello)\r\nResistenza magica: 28 (+1.5 per livello)\r\n\r\nRigenerazione mana: 7 (+0.7 per livello)\r\nRigenerazione salute: 12 (+0.75 per livello)\r\n\r\nSalute base: 450 (+85 per livello)\r\nMana base: 200 (+25 per livello)\r\n\r\n\r\n\r\n\r\n\r\nAbilità passiva: (Fervore dinamico) Quando la salute di Beater arriva al disotto del 30% guarisce del 15% rispetto alla sua salute massima in 5 secondi e la velocità di movimento aumenta del 20% per 3.5 secondi.\r\n\r\n\r\nQ:(Bambù inatteso  mana:50/50/50/50/50) Infligge 40/60/70/80/90+ 10% del potere magico ad un unità nemica rallentandolo del 10% per 3 secondi,se il bersaglio(solo campioni)è girato di schiena infligge il 20% del danno totale in più come danni magici bonus.\r\n\r\nTipo:Ranged-Singolo bersaglio-click direzionale-oltrepassa_minion(simile alla W di Ezreal)\r\n\r\n\r\nW:(Antica essenza del Bambù mana:70/70/70/70/70)Bevendo l’antica essenza del bambù Beater recupera  il/l' 7%/9%/11%/13%/15% della sua salute massima in 5 secondi.\r\n\r\nTipo:Su se stessi.\r\n\r\n\r\nE: (Foresta letale 40/50/60/70/80) Gettando a terra una goccia di essenza crescerà improvvisamente una piccola foresta di bambù. I nemici che si trovano o passano nell’area della foresta vengono rallentati del 25% e ricevono 50/60/70/80/90 danni subito + il 16% del potere magico come danni bonus al secondo.Per ogni unità nemica che viene intrappolata in essa il bonus aumenta del 2.5%.\r\nLa foresta dura 3/3.5/4/4.5/5 secondi.\r\n\r\nTipo:Danno ad area-danni per secondo-rallentamento-centro dell’area sul proprio champ-zona circolare\r\n\r\n\r\nR:(Randellata della nemesi 100/125/150)Con la sua fedele canna di bambù Beater sfoga la sua rabbia repressa caricandosi per 3 secondi e colpendo il terreno causando 80/130/180 danni + il 10% della sua salute mancante in danni magici bonus alle unità nemiche nella traiettoria recuperando salute pari al 15% dei danni totali in salute.\r\n\r\nTipo: Area di danno tipo conico-click direzionale\r\n \r\n\r\n\r\nTempi di ricarica delle skill a voi.\r\n\r\n\r\n\r\n\r\n\r\nAbilità (graficamente):\r\n\r\nAttacco base:Con la sua fedele canna di bambù colpisce il nemico verticalmente.\r\n\r\nQ:Parte un pezzo di bambù in direzione indicata dal evocatore;il pezzo lascia una scia verde dietro di se.\r\n\r\nW:Beve da una borraccia fatta di bambù.\r\n\r\nE:Prende la borraccia fatta di bambù e butta a terra una goccia di essenza,Spunterà una foresta (graficamente trasparente) di forma circolare dalla posizione del campione oppure (su scelta vostra) il centro dell’abilità è dove decide l’evocatore con il puntatore in un’area ristretta vicino al campione.\r\n\r\nR: Solleva lentamente la canna di bambù portandola dietro di se sorreggendola con 2 mani.Mentre compie quest'azione una nube verde lo avvolge risalendo la canna di bambù e quando la nube arriva su la cima della canna parte il colpo sferrato con rabbia.\r\n\r\n\r\nUn campione che se viene buildato full healt avrà problemi di mana. Se viene buildato Ap avrà problemi contro i danni ingenti. Insomma mi sembra abbastanza fattibile.\r\n\r\nGrazie a prescindere.\r\n\r\n-Tucanking-EUW","replies":[{"poster":"Lorgoglio","date":"2016-02-02T11:48:59.013+0000","up_votes":1,"down_votes":0,"body":"\"Se buildato ap avrà problemi di danni ingenti\".\nMetà delle sue skill lo curano in perentuali. LOL","replies":[{"poster":"Frattaglia","date":"2016-02-02T13:34:17.239+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lorgoglio,realm=EUW,application-id=98NGV4Al,discussion-id=mnO5eWHo,comment-id=0003,timestamp=2016-02-02T11:48:59.013+0000)\n>\n> \"Se buildato ap avrà problemi di danni ingenti\".\n> Metà delle sue skill lo curano in perentuali. LOL\n\nNon ritirare su topic vecchi di 11 mesi, per favore. Si chiama necroposting e non è ben vista come pratica.","replies":[{"poster":"Lorgoglio","date":"2016-02-04T13:11:44.236+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=98NGV4Al,discussion-id=mnO5eWHo,comment-id=00030000,timestamp=2016-02-02T13:34:17.239+0000)\n>\n> Non ritirare su topic vecchi di 11 mesi, per favore. Si chiama necroposting e non è ben vista come pratica.\n\nOk scusa sono abbastanza nuovo nella community (gioco da settembre) e non sapevo che commentare vecchi post (o \"necroposting\", come l'hai chiamato tu) fosse una cosa vista male. \nPer altro, se mi capitava di commentare vecchi post aggiungevo sempre all'inizio del commento che, nonostante commentassi, sapevo della vecchiaia di quel post ma che non potevo fare a meno di dire la mia.\nQui non l'ho fatto perché, sinceramente, non avevo visto la data di questo topic. XD","replies":[{"poster":"Frattaglia","date":"2016-02-04T13:26:22.190+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lorgoglio,realm=EUW,application-id=98NGV4Al,discussion-id=mnO5eWHo,comment-id=000300000000,timestamp=2016-02-04T13:11:44.236+0000)\n>\n> Ok scusa sono abbastanza nuovo nella community (gioco da settembre) e non sapevo che commentare vecchi post (o \"necroposting\", come l'hai chiamato tu) fosse una cosa vista male. \n> Per altro, se mi capitava di commentare vecchi post aggiungevo sempre all'inizio del commento che, nonostante commentassi, sapevo della vecchiaia di quel post ma che non potevo fare a meno di dire la mia.\n> Qui non l'ho fatto perché, sinceramente, non avevo visto la data di questo topic. XD\n\nNon c'è problema :)\n\nTra l'altro noto anche che il topic è nella sezione sbagliata... lo chiudo. L'utente è pregato di riaprirlo nella sezione corretta \"Creazioni della Community\" :)","replies":[]}]}]}]},{"poster":"Tucanking","date":"2015-02-27T00:54:33.452+0000","up_votes":1,"down_votes":0,"body":"Ma parlate in italiano please. Mi sembra di essere stato abbastanza accurato. c'è gente che propone:\n \" luigi, il cane zoppo\" \nQ: Diventa immortale per 50 ore\nW:Ti fa il caffè\nE:Ti spiccia casa\nR:Vincerai le prossime 40 partite.\n\nRisposte serie per favore. {{item:3075}}","replies":[]},{"poster":"Yes0d30","date":"2015-02-24T23:15:17.678+0000","up_votes":1,"down_votes":1,"body":"kirito is here","replies":[]},{"poster":"Nibbio Bianco","date":"2015-02-24T22:21:56.208+0000","up_votes":1,"down_votes":1,"body":"Sampei made in pizzeria.","replies":[]}]}