{"poster":"Tucanking","date":"2016-02-07T14:24:20.002+0000","title":"[Proposta Campione] Beater, portatore di equilibrio","subforum":"Creazioni della community","up_votes":3,"down_votes":1,"body":"Premessa:Le seguenti descrizioni e punteggi sono delle idee personali quindi,se fuori misura o non giuste, adattatele come credete meglio.\r\nPer quanto riguarda l&rsquo;aspetto grafico spero che possiate accontentarmi.\r\nCon questo vi auguro buona lettura e spero che accettiate la mia proposta.\r\nGrazie a prescindere\r\n\r\nNome campione: Beater,portatore di equilibrio\r\n\r\nLa storia:\r\n\r\n&ldquo;&Egrave; CRESCIUTO!&rdquo; -Rammus quando racconta l&rsquo;incontro con Beater-\r\n\r\nUn giorno, le terre a sud della Grande Barriera si videro spazzare via da terribili tempeste magiche, che devastarono ogni villaggio umano che vi risiedeva.Durante la strage un bambino venne salvato;Beater.\r\nVenne salvato da una strana creatura con cui ha trascorso i primi anni della sua vita,un&rsquo;armadillo di nome Rammus.\r\nLui durante il suo viaggio di salvezza port&ograve; il bambino con se,finch&egrave; un giorno si vidde costretto ad affidarlo ad un&rsquo;anziano eremita abitante della giungla di Kumungu; Butukari.\r\nL&rsquo;anziano si innamor&ograve; della storia del bambino e anche di lui, decidendo cos&igrave; di insegnare tutto ci&ograve; che sapeva al piccolo orfano.\r\nRammus riprese il suo intrepido viaggio alla ricerca del posto in cui sarebbe potuto passare inosservato.\r\nBeater crebbe,imparando le arti del combattimento usando il bamb&ugrave; (abbondante nella giungla di Kumungu), ed imparando le tecniche di sopravvivenza estrema.\r\nButukari,ormai soddisfatto degli insegnamenti dati al suo inaspettato figlio si sent&igrave; soddisfatto, e ormai vecchio mor&igrave;, felice&hellip;\r\nBeater fece una promessa al suo padre di vita:&rdquo; Ti prometto che realizzer&ograve; il tuo sogno di portare avanti la stirpe e l&rsquo;arte del butu jutsu espandendola e rendendoti onore&rdquo;\r\nCos&igrave;,armatosi della canna di bamb&ugrave; che gli regal&ograve; il maestro si mise in cammino, portando con se la conoscienza della sacra ricetta della longevit&agrave; preparata da Butukari.\r\n\r\nViaggiando per terre senza confini insegn&ograve; le basi del butu jutsu in giro per il mondo,finch&egrave; un giorno arriv&ograve; a League of Legends.\r\nAl suo arrivo incontr&ograve; una strana creatura,rimase stupefatto;incontr&ograve; di nuovo Rammus.Lo riconobbe grazie alla storia che gli raccont&ograve; Butukari sul suo arrivo a Kumungu.Da quel giorno si unirono per affrontare le dure prove nelle arene della giustizia.\r\n\r\nBeater graficamente:\r\n\r\nTipo:Umano\r\nAltezza:1,70m\r\nOcchi:Verdi\r\nCorporatura:Robusto\r\nCapelli:Castano chiaro\r\nColore carnagione:Mediterranea\r\n\r\nPorta con se una canna di bamb&ugrave; verde appoggiata dietro al collo sorreggendola con la mano destra all&rsquo;estremit&agrave; pi&ugrave; grande.\r\n\r\nSi veste sempre con vestiti color verde scuro. (Questo per quanto riguarda l&rsquo;aspetto classico)\r\n\r\nCarattere:\r\n\r\nRiesce a fare battute su le altre persone senza farle arrabbiare.Amichevole con tutti.\r\nIl suo motto:&rdquo; Chi colpisce nella ragione lede maggiormente&rdquo;\r\n\r\nCaratteristiche base-Abilit&agrave;\r\n\r\nCaratteristiche base:\r\n\r\nAttacco: 58 (+3.2 per livello)\r\nPotere magico: 0\r\nVelocit&agrave; di attacco: 0.7/sec (+2,5 per livello)\r\nVelocit&agrave; di movimento: 345\r\nArmatura: 18 (+3.6 per livello)\r\nResistenza magica: 28 (+1.5 per livello)\r\n\r\nRigenerazione mana: 7 (+0.7 per livello)\r\nRigenerazione salute: 12 (+0.75 per livello)\r\n\r\nSalute base: 450 (+85 per livello)\r\nMana base: 200 (+25 per livello)\r\n\r\nAbilit&agrave; passiva: (Fervore dinamico) Quando la salute di Beater arriva al disotto del 30% guarisce del 15% rispetto alla sua salute massima in 5 secondi e la velocit&agrave; di movimento aumenta del 20% per 3.5 secondi.\r\n\r\nQ:(Bamb&ugrave; inatteso mana:50/50/50/50/50) Infligge 40/60/70/80/90+ 10% del potere magico ad un unit&agrave; nemica rallentandolo del 10% per 3 secondi,se il bersaglio(solo campioni)&egrave; girato di schiena infligge il 20% del danno totale in pi&ugrave; come danni magici bonus.\r\n\r\nTipo:Ranged-Singolo bersaglio-click direzionale-oltrepassa_minion(simile alla W di Ezreal)\r\n\r\nW:(Antica essenza del Bamb&ugrave; mana:70/70/70/70/70)Bevendo l&rsquo;antica essenza del bamb&ugrave; Beater recupera il/l&#039; 7%/9%/11%/13%/15% della sua salute massima in 5 secondi.\r\n\r\nTipo:Su se stessi.\r\n\r\nE: (Foresta letale 40/50/60/70/80) Gettando a terra una goccia di essenza crescer&agrave; improvvisamente una piccola foresta di bamb&ugrave;. I nemici che si trovano o passano nell&rsquo;area della foresta vengono rallentati del 25% e ricevono 50/60/70/80/90 danni subito + il 16% del potere magico come danni bonus al secondo.Per ogni unit&agrave; nemica che viene intrappolata in essa il bonus aumenta del 2.5%.\r\nLa foresta dura 3/3.5/4/4.5/5 secondi.\r\n\r\nTipo:Danno ad area-danni per secondo-rallentamento-centro dell&rsquo;area sul proprio champ-zona circolare\r\n\r\nR:(Randellata della nemesi 100/125/150)Con la sua fedele canna di bamb&ugrave; Beater sfoga la sua rabbia repressa caricandosi per 3 secondi e colpendo il terreno causando 80/130/180 danni + il 10% della sua salute mancante in danni magici bonus alle unit&agrave; nemiche nella traiettoria recuperando salute pari al 15% dei danni totali in salute.\r\n\r\nTipo: Area di danno tipo conico-click direzionale\r\n\r\nTempi di ricarica delle skill a voi.\r\n\r\nAbilit&agrave; (graficamente):\r\n\r\nAttacco base:Con la sua fedele canna di bamb&ugrave; colpisce il nemico verticalmente.\r\n\r\nQ:Parte un pezzo di bamb&ugrave; in direzione indicata dal evocatore;il pezzo lascia una scia verde dietro di se.\r\n\r\nW:Beve da una borraccia fatta di bamb&ugrave;.\r\n\r\nE:Prende la borraccia fatta di bamb&ugrave; e butta a terra una goccia di essenza,Spunter&agrave; una foresta (graficamente trasparente) di forma circolare dalla posizione del campione oppure (su scelta vostra) il centro dell&rsquo;abilit&agrave; &egrave; dove decide l&rsquo;evocatore con il puntatore in un&rsquo;area ristretta vicino al campione.\r\n\r\nR: Solleva lentamente la canna di bamb&ugrave; portandola dietro di se sorreggendola con 2 mani.Mentre compie quest&#039;azione una nube verde lo avvolge risalendo la canna di bamb&ugrave; e quando la nube arriva su la cima della canna parte il colpo sferrato con rabbia.\r\n\r\nUn campione che se viene buildato full healt avr&agrave; problemi di mana. Se viene buildato Ap avr&agrave; problemi contro i danni ingenti. Insomma mi sembra abbastanza fattibile.\r\n\r\nGrazie a prescindere.\r\n\r\n-Tucanking-EUW","replies":[{"poster":"Ryuk1980","date":"2016-02-08T10:17:04.339+0000","up_votes":1,"down_votes":0,"body":"Sicuramente la riot ne terrà conto, come altri centinaia che son stati creati...","replies":[]},{"poster":"ximox00","date":"2016-02-08T10:06:24.928+0000","up_votes":1,"down_votes":0,"body":"l'idea mi piace molto, però tu per che lane lo vedi ? sinceramente non mi sembra ne carne ne pesce non ha danni sufficentemente alti per stare da solo in lane e neanche abbastanza utility per giocarlo ottimamente support, ma comunque queste sono le opinioni di un bronzino xD","replies":[]},{"poster":"DuckQuack0","date":"2016-02-07T17:38:52.559+0000","up_votes":1,"down_votes":0,"body":"> portatore di equilibrio\n\nNon ci sarà mai equilibrio su LoL.","replies":[]}]}