{"poster":"Rush Recklessly","date":"2014-10-08T19:48:53.156+0000","title":"I really want a Red to take the time and explain to me why they believe the slow on Talons E is fair","subforum":"Gameplay","up_votes":7,"down_votes":3,"body":"I might not be the best player, but Talon has been my most played champion since the middle of season 2 (yes i was one of the 2% who played Talon.) His silence was balanced. It was attached to his gapcloser and was on a moderate cooldown. Its not like he was Kassadin or LeBlanc who could silence and then simply jump around due to their absurd mobility. I dont agree with Riot taking the stance that silences promotes low interaction, its the rest of the kit in conjunction with CC that causes low interaction, not the CC itself. (Kass/ Lb playing god jumping away after they silence and burst you.) Trading his silence for a slow is not fair, especially with the slow being as insignificant as it is. Not to mention HE ALREADY HAS A SUPERIOR SLOW. Riot doesn't like Talon for whatever reason (yes i remember the cleaver nerfs AND the nerfs you gave to his Q in the beginning of season 3) and all i want is for my favorite assassin to get a fair deal if they dont want assassins to have silences. If you gave him a stun for the same duration as his slow would that promote the same problem? He needs something more than what you gave him this patch.","replies":[{"poster":"redniwediS","date":"2014-10-08T19:54:28.981+0000","up_votes":8,"down_votes":1,"body":"If he needs something more he will get something more.  The point of having a balance team is that a single nerf or buff is not the end, and the point of waiting a while afterward is to see the full impact of said nerf or buff.  You can't just make change after change without seeing the full impact or things will never get close to any sort of balance.","replies":[{"poster":"Constantine22","date":"2014-10-08T20:33:26.719+0000","up_votes":4,"down_votes":1,"body":"i agree on that BUT. you cant take away something CORE from a kit and leave as he is just so you can test things. they should have done some kind of rework to compensate for the loss of silence. I'll tell you why its CORE on his kit.\nHe is the only assassin with only one gap closer. \nright now if Talon E's a syndra he will get insta pushed away. or she can just use her targeted ult nuke and the character will chase you to get in range to use it. if Talon E's her he gets nuked. The moment he E's her he loses the trade and also he has no escape tools. the moment he uses ulti syndra will just put a pink ward and kill him.\ntha same can be said with anyone with targeted abilities. (malzahar, syndra, lissandra etc) also any one who has a blink or dash to get away from him the moment he blinks to them, makes talon useless. (ezreal, vayne (can push him too), lucian, Tristana (can push him too), Gragas (can push him with ulti too), shaco, kassadin, leblanc, zed, kha'zix etc) .\nAlso any one with a stun or snare (lux, morgana, lulu, Taric etc)\nAll this things can happen to zed too. but zed has way to escape with his Ult shadow or if he gets pushed to go in again with his W shadow.\nleblanc has W to go in and mimic it to go in again or W back again.\nFizz can Q in and E in again or E out.\nAkali can ult 3 times.\nTalon cant do any of that. you see Riot when they made talon they thought of a low mobile assassin. an assassin with only ONE gap closer but that gapcloser should be enough to stick to his enemy. one second of silence is enough. but now they removed it. Why E someone now? to die? mages are gonna burst him and adcs are gonna kite him to death. They should rework him so that he doesnt NEED a silence. cause right now without it he is trash. and as far as i know removing something that defines a kit from an assassin isnt the way to go.\nthey removed kassadin and leblancs silence too but they have mobility to chase their targets or to get away.so i can see why they did it. but on Talon? Talon is like a Brand but melee. he has no escapes and he is aoe. you dont just remove the stun from a brand! yes you can dodge it but if he misses it he is still not in melee range. Talon IS though. he needs something to be safe. silence is out of the question so i suggest giving him something else. like having charges on his E so that he can use it twice like akali. or after E he could get 0.5 seconds of stealth just in order to avoid targeted abilites like zed can dodge everything the moment he ults.","replies":[{"poster":"redniwediS","date":"2014-10-08T20:45:01.732+0000","up_votes":6,"down_votes":0,"body":"> you cant take away something CORE from a kit and leave\n\nThis right here is the key to my point.  They did not leave, they took one step back in order to take a good, long look at the result of their changes.  I would almost bet you my account that they have been looking at the data and testing things internally ever since the nerf went out.  Just be patient.","replies":[{"poster":"Constantine22","date":"2014-10-08T21:13:08.300+0000","up_votes":2,"down_votes":2,"body":"But thats what pbe is for. how can anyone play Talon right now? he is not viable.","replies":[{"poster":"redniwediS","date":"2014-10-08T21:27:15.969+0000","up_votes":1,"down_votes":0,"body":"The PBE is for bug testing, not long term balance changes.","replies":[{"poster":"Constantine22","date":"2014-10-08T21:45:47.544+0000","up_votes":1,"down_votes":0,"body":"BUT it doesnt need testing. its common sense.\nhigh mobility with low cc (zed) \nOR\nLow mobility with high cc (Talon)\n\nZed cant silence his target but he can go in again if they dash away,\nTalon can only go in once but with silence its enough to do his job.\nWithout silence he goes in once and the enemy blinks away. he doesnt have another gap closer to compensate.\n its common sense. what is there to test. but ok i'm not here to argue with YOU about Talon. i'm here to make this post more know so that Riot can see it. because for a whole year Riot has posted only five times on talon threads. for a year! 5 times! sigh","replies":[{"poster":"redniwediS","date":"2014-10-08T21:49:44.215+0000","up_votes":1,"down_votes":0,"body":"But it really does need testing.  We all know the slow does little to nothing, but it is part of the test.  It is a test to see just how much Talon relied on his silence, as no one, not even players who main Talon truly understood it's value until it was removed.\n\nIt is not quite obvious how much he relied upon it, and it will take more than replacing it with another CC to get him back where he needs to be.  Be patient but expect more buffs.","replies":[{"poster":"wolfax","date":"2014-10-09T23:42:21.029+0000","up_votes":1,"down_votes":1,"body":"I doubt he'll be getting any sort of hard CC. Any kind of hard CC poses the same issue as the silence did. His slow is basically a root that allows him to get an empowered AA off.","replies":[{"poster":"Rush Recklessly","date":"2014-10-11T07:17:32.117+0000","up_votes":1,"down_votes":0,"body":"too bad Noxian Deplomacy was nerfed along with black cleaver in the beginning of season three. and roots prevent things like flash, his 99% slow does not. ","replies":[]}]}]}]}]},{"poster":"wolfax","date":"2014-10-08T21:47:31.138+0000","up_votes":1,"down_votes":0,"body":"Except he is. The small group that played him before has not taken a hit to their winrates at all. In fact, it seems to have even risen slightly, which might be a small statistical anomaly, but it's definitely not a large drop like you would expect if he wasn't viable.\n\nAlso, PBE doesn't have the sample size needed to be 100% all the time. It's a relatively small community who aren't even guaranteed to test out the changed champions. They made a change to make him a healthier assassin and if he does need more changes they will find something that's not as severe as silencing to give him.","replies":[]}]},{"poster":"Constantine22","date":"2014-10-08T21:38:24.399+0000","up_votes":1,"down_votes":0,"body":"they dont answer any posts that mention talon though. just search the boards. put Talon in the search box and tick the \"has riot comments\" option and search for the past year... not a week or a month where all these posts about talon happened but a YEAR AGO. you are gonna find 5 posts only. they dont give him enough attention.\nfrom the moment he was released his E was bugged and it didnt amplify his damage at all.  and they fixed it one year later. all this time i played a bugged champion. ONE YEAR LATER. they just dont care about him because people dont play him. they are trying to make all the other people who cry about him happy so they nerf him.they go for the masses. just check the log on wiki about the changes on him. only nerfs. he never got a buff. but zed who everyone loves got a buff recently. i dont want to be one of those guys who just whine about every little thing but this isnt a little thing. i've never actually used the forums at all all this time. this isnt a \"minor change\" as Riot mentioned it on that patch notes. this is huge. yes its only 1 second of silence but its the only think talon had to do his damage. now no matter how much they increace his damage it wont matter because he will still be vurnerable the moment he blinks in. i mean cant they figure that out? that doesnt need testing. it needs common sense. more mobility for less cc (zed) or less mobility for more cc (talon WITH silence) right now talon has nothing of those. just a soft cc that a zed also has and a stealth which is used for damage cause its unreliable for escapes due to pink wards. damn i couldnt help it and posted another wall of text. you dont have to answer. i just want Riot to give talon some attention. some answers. lets in their thought process a bit. does anyont from riot play Talon at all? i doubt it. i probably know more about talon than those who made him -_-","replies":[{"poster":"redniwediS","date":"2014-10-08T21:55:57.299+0000","up_votes":1,"down_votes":0,"body":"Do they have to answer posts?  When any group besides the moderators gets on here in an unorganized fashion they are here to post as players, not as developers or artists.  They wait to answer the big questions in a single, organized post so that they don't have to reply to 200 different threads made by different people with similar questions.\n\nWhat you call common sense is really hindsight.  You would have a wildly different answer if I asked you how much Talon relied on his silence a year ago.  These things must be tested on a large player base, which can only be realistically found on the live servers.  The PBE would need a truly massive overhaul to support a large enough group of players to test balance, and even then they would need players who actually play the champions they are testing.","replies":[{"poster":"Constantine22","date":"2014-10-09T14:21:51.877+0000","up_votes":1,"down_votes":1,"body":"call it whatever. but you dont remove a core thing from a champion that makes him work.\nyou can remove the silence from leblanc. she can still do damage without it since she can still close in to  targets even if they blink away. but talon without silence cant burst anyone. \nwhat is core on leblanc is her burst and her mobility to stick to targets or be elusive. not her silence. \nTalon's core on the other hand is aoe burst damage and a silence to stick to his target. they removed something core from him without a rework. leblanc doesnt need silence. Talon does, i call that common sense.","replies":[{"poster":"redniwediS","date":"2014-10-09T16:54:37.992+0000","up_votes":1,"down_votes":0,"body":"It would be common sense if everyone saw this for what it was before it was done.  My point is that both the overwhelming majority of Talon players and the balance team did not understand the significance of Talon's silence until it was removed.\n\nAs you said it helps him stick to people, but it honestly did far more than that.  Garen's Q helps him stick to people, Talon's silence prevented his opponents from making any move to get away.  The new slow is there to see if it was a sticking issue or not, and from all the evidence I've seen (which is far less than what Riot has seen) it is not really a sticking problem.\n\nThe silence HAD to go, but without actual testing to figure out what exactly will be good enough to take it's place Talon will not be a good pick.  If balance was a common sense problem no one would be over or under powered.","replies":[{"poster":"Rush Recklessly","date":"2014-10-09T21:57:48.688+0000","up_votes":1,"down_votes":1,"body":"three percent pick rate. three. know what that means? He wasnt pickban everygame, he wasnt broken or he would be picked more than he was. Hell he wasnt even good all the time, hes a niche pick. Ever since they gave him the tiny buff to cutthroat with the placement relative to the target he was BALANCED. You know what you do to balanced champions with three percent pickrate? you DONT NERF THEM.","replies":[{"poster":"wolfax","date":"2014-10-09T23:41:01.524+0000","up_votes":1,"down_votes":2,"body":"SILENCE REMOVAL WAS NOT MEANT AS A NERF. Get that through your head. They removed it because the playstyle it enforced was bad. No champion should be able to stop the opponent from doing everything while being able to 100-0 that opponent. Notice how all the other assassins are getting it removed from their kit? That's because it sucks that you only get killed because you have to sit there and hope the opponent screws up their combo or just doesn't have enough damage.","replies":[{"poster":"Rush Recklessly","date":"2014-10-11T07:13:23.112+0000","up_votes":1,"down_votes":0,"body":"> SILENCE REMOVAL WAS NOT MEANT AS A NERF\n\ncan i get some of what you are smoking, sir?","replies":[]}]},{"poster":"redniwediS","date":"2014-10-09T22:01:26.321+0000","up_votes":1,"down_votes":0,"body":"Talon was not the reason for the nerf, the silence was.  They have changed their view on how silence should be used, and Talon's silence no longer fit that view.\n\nThey don't have anything against Talon and as such they will fix the problem.  I would recommend a little patience, as this is not something they can just fix over night.","replies":[]}]}]}]}]},{"poster":"Rush Recklessly","date":"2014-10-08T22:09:31.886+0000","up_votes":1,"down_votes":0,"body":"were in this together homie\n\nhttps://www.silverfishlongboarding.com/forum/attachment.php?attachmentid=89525&d=1344451421&s=32814ffd96c2c7e6463fc01303aeb09b","replies":[]}]}]},{"poster":"Rush Recklessly","date":"2014-10-08T20:34:25.696+0000","up_votes":2,"down_votes":1,"body":"> i agree on that BUT. you can take away something CORE from a kit and leave as he is just so you can test things. they should have done some kind of rework to compensate for the loss of silence. I'll tell you why its CORE on his kit.\n> He is the only assassin with only one gap closer. \n> right now if Talon E's a syndra he will get insta pushed away. or she can just use her targeted ult nuke and the character will chase you to get in range to use it. if Talon E's her he gets nuked. The moment he E's her he loses the trade and also he has no escape tools. the moment he uses ulti syndra will just put a pink ward and kill him.\n> tha same can be said with anyone with targeted abilities. (malzahar, syndra, lissandra etc) also any one who has a blink or dash to get away from him the moment he blinks to them, makes talon useless. (ezreal, vayne (can push him too), lucian, Tristana (can push him too), Gragas (can push him with ulti too), shaco, kassadin, leblanc, zed, kha'zix etc) .\n> Also any one with a stun or snare (lux, morgana, lulu, Taric etc)\n> All this things can happen to zed too. but zed has way to escape with his Ult shadow or if he gets pushed to go in again with his W shadow.\n> leblanc has W to go in and mimic it to go in again or W back again.\n> Fizz can Q in and E in again or E out.\n> Akali can ult 3 times.\n> Talon cant do any of that. you see Riot when they made talon they thought of a low mobile assassin. an assassin with only ONE gap closer but that gapcloser should be enough to stick to his enemy. one second of silence is enough. but now they removed it. Why E someone now? to die? mages are gonna burst him and adcs are gonna kite him to death. They should rework him so that he doesnt NEED a silence. cause right now without it he is trash. and as far as i know removing something that defines a kit from an assassin isnt the way to go.\n> they removed kassadin and leblancs silence too but they have mobility to chase their targets or to get away.so i can see why they did it. but on Talon? Talon is like a Brand but melee. he has no escapes and he is aoe. you dont just remove the stun from a brand! yes you can dodge it but if he misses it he is still not in melee range. Talon IS though. he needs something to be safe. silence is out of the question so i suggest giving him something else. like having charges on his E so that he can use it twice like akali. or after E he could get 0.5 seconds of stealth just in order to avoid targeted abilites like zed can dodge everything the moment he ults.\n\ni like this guy","replies":[{"poster":"wolfax","date":"2014-10-08T20:44:47.075+0000","up_votes":1,"down_votes":3,"body":"Because he only mentions if the enemy plays with near perfect reaction times to everything Talon does. He's literally saying Talon is trash because if they manage to target you the second you land on them you're dead. He ignores the fact that during a fight they likely won't have the cooldown up to immediately kill you or are probably not completely focused on you and can get gibbed before they have the frame of mind to hit you.\n\nBasically, he's setting up unrealistic scenarios for the majority of fights and calling Talon weak because there's a fraction of the time the enemy might be able to do something to stop him (gasp). Sacrilege.\n\nAlso, I don't think Zed can blink back if he's rooted, CCed, or silenced, so he's just as unsafe as Talon according to him.","replies":[{"poster":"TheBestFalcon","date":"2014-10-08T21:13:01.498+0000","up_votes":3,"down_votes":1,"body":"> Because he only mentions if the enemy plays with near perfect reaction times to everything Talon does. He's literally saying Talon is trash because if they manage to target you the second you land on them you're dead. He ignores the fact that during a fight they likely won't have the cooldown up to immediately kill you or are probably not completely focused on you and can get gibbed before they have the frame of mind to hit you.\n> \n> Basically, he's setting up unrealistic scenarios for the majority of fights and calling Talon weak because there's a fraction of the time the enemy might be able to do something to stop him (gasp). Sacrilege.\n> \n> Also, I don't think Zed can blink back if he's rooted, CCed, or silenced, so he's just as unsafe as Talon according to him.\n\nSo what your saying is no can really react in the first second talon is on you 95% of the time anyway..... so then why the fk did he need to lose the silence in the first place is the vast majorty of the time it wouldnt have mattered either way.","replies":[{"poster":"wolfax","date":"2014-10-08T21:40:47.553+0000","up_votes":2,"down_votes":0,"body":"What I'm saying that he's giving the absolute worst situation for Talon and saying because he is not 100% guaranteed in the absolute worst scenario he is worthless. The silence made it so that no matter what the enemy was forced to not be able to respond even in they could have. It basically said screw your skill, you just have to hope I can't 100-0 you.\n\nI could conversely say that when the squishy enemy is out of cooldowns and Talon jumps on them he's basically guaranteed the kill, and thus he's in need of more nerfs. It's the same argument because I'm setting up the best situation for him.","replies":[]}]},{"poster":"Constantine22","date":"2014-10-08T21:19:29.591+0000","up_votes":2,"down_votes":0,"body":"yes thats why i said a decent Talon vs a decent lux. Its not that hard to bait talon. its 700 range on his E. if you know that you know where and when he gonna blink. only thing you have to do is smartcast your abilities. also i put lux but i could have put lissandra or syndra. they just click you with their ult and their champ just chases Talon until he is in range so that the moment he E's on them he gets bursted. zed though has his ult immunity. so zed has a way to deal with targeted abilities AND skillshots. but the main point here is that Talon has no way to get out of a fight. stealth from his ult in this game is nothing compared to mobility. stealth gets hard countered by pink wards and red trinkets. but if zed goes in and something goes wrong he can get back to safety. an assassin has to either have strong all in and no escapes or weak all in but with escapes. talon has nothing of those.","replies":[]}]}]},{"poster":"wolfax","date":"2014-10-08T20:38:51.924+0000","up_votes":1,"down_votes":3,"body":"I like how you call him trash when according to the numbers he's still more than fine. 51+% across the board. That doesn't sound like he's trash to me. Sounds like he's still very alive and kicking butt. But let's just ignore facts shall we.","replies":[{"poster":"Rush Recklessly","date":"2014-10-08T20:51:44.311+0000","up_votes":2,"down_votes":0,"body":"> I like how you call him trash when according to the numbers he's still more than fine. 51+% across the board. That doesn't sound like he's trash to me. Sounds like he's still very alive and kicking butt. But let's just ignore facts shall we.\n\nIf your going to throw out number lets go to his pickrate shall we? that he never saw more than 10% pickrate at any given week since his release, in fact, 3% has been his median pickrate but lets just ignore facts shall we.","replies":[{"poster":"Constantine22","date":"2014-10-08T21:22:00.657+0000","up_votes":2,"down_votes":1,"body":"his pick rate is like 3 percent. that means that those who pick him are Talon players. so that means that if those players havent played him since his nerf the winrate isnt gonna drop that much. lets wait for those 3% players to play him and lose some matches and we will see","replies":[{"poster":"wolfax","date":"2014-10-08T21:31:01.902+0000","up_votes":2,"down_votes":0,"body":"Those 3% that are playing him have already had their results shown. If you notice between the change and now their winrate hasn't gone down. It has remained stable. So obviously the removal of his silence has not \"gutted\" him. If there was a noticeable drop of a few percentage points I might agree, but they've proven that they can and already have adapted to the changes.","replies":[{"poster":"Nucleophilic atk","date":"2014-10-08T22:00:25.152+0000","up_votes":1,"down_votes":1,"body":"Get out of here. Why are you trying to use logic in a board post? Don't you know that people don't understand logic here?","replies":[]}]},{"poster":"Rush Recklessly","date":"2014-10-08T21:22:47.413+0000","up_votes":1,"down_votes":0,"body":"> his pick rate is like 3 percent. that means that those who pick him are Talon players. so that means that if those players havent played him since his nerf the winrate isnt gonna drop that much. lets wait for those 3% players to play him and lose some matches and we will see\n\nthis","replies":[]}]},{"poster":"Nucleophilic atk","date":"2014-10-08T21:59:39.779+0000","up_votes":1,"down_votes":0,"body":"What does pick rate prove? Not to mention, lolking has talon's pick rate above 50 champs and op.gg has talon rated like 50th for \"picks per game\" or something like that.","replies":[]}]},{"poster":"Constantine22","date":"2014-10-08T21:23:15.962+0000","up_votes":1,"down_votes":0,"body":"his pick rate is like 3 percent. that means that those who pick him are Talon players. so that means that if those players havent played him since his nerf the winrate isnt gonna drop that much. lets wait for those 3% players to play him and lose some matches and we will see","replies":[{"poster":"wolfax","date":"2014-10-08T22:11:26.147+0000","up_votes":1,"down_votes":1,"body":"Except if you look there's already data from those 3% playing him and they're doing just as well if not even just a tiny bit better. It hasn't dropped.","replies":[{"poster":"Constantine22","date":"2014-10-09T14:14:47.667+0000","up_votes":1,"down_votes":0,"body":"you dont get it. if a talon does the same WITH the silence AND without it then why remove it? if it changes nothing then why remove it? are you telling me that people will still qq about him? because thats what happened. people die from him and they qq because of the silence. if he kills them now without it and qq again then what are they gona blame it to? his damage? \nNO the silence did matter thats why they removed it. to drop his winrate. thats what nerfs are for.","replies":[{"poster":"wolfax","date":"2014-10-09T23:44:03.420+0000","up_votes":1,"down_votes":1,"body":"No, it means the compensation for the silence removal was enough.","replies":[]}]}]}]}]}]},{"poster":"Rush Recklessly","date":"2014-10-08T20:30:42.964+0000","up_votes":1,"down_votes":5,"body":"> If he needs something more he will get something more.  The point of having a balance team is that a single nerf or buff is not the end, and the point of waiting a while afterward is to see the full impact of said nerf or buff.  You can't just make change after change without seeing the full impact or things will never get close to any sort of balance.\n\nYou dont need to be a genius to see that a .25 second slow does not equal a 1 second silence. In any way, shape, or form. Hell, id even take increased crit chance over the slow.","replies":[{"poster":"wolfax","date":"2014-10-08T20:35:47.974+0000","up_votes":8,"down_votes":3,"body":"It's not meant to. A 1 second silence on a champion that can burst you down in that 1 second is too much. Assassins should *not* be able to kill you before you can react at all.","replies":[{"poster":"336KMlmYm9","date":"2014-10-09T00:32:09.446+0000","up_votes":2,"down_votes":0,"body":"The point being that giving him an even crappier version of a CC he already has was a bad call. I don't agree that he needed to lose the silence, but if they were going to take it there was absolutely no point in the compensatory buff he got. It was basically just so they could say they gave him something, even though they really didn't.\n\nChampions rarely want two slows, much less one good slow and one ridiculously bad one.","replies":[]},{"poster":"Constantine22","date":"2014-10-08T21:26:38.913+0000","up_votes":1,"down_votes":1,"body":"yeah but his silence was for Talon to stick to his target. every assassin has something to stick to their target. but with 0.25 second slow  talon wont stick to his target. enemy vayne will just push him away and kite him to death. its not like zed who still will have his W to chase her again.","replies":[{"poster":"wolfax","date":"2014-10-08T22:10:10.177+0000","up_votes":2,"down_votes":2,"body":"That's not what it did though. It basically said your only chance at living was not a skilled play or use of your abilities in a tiny window, it was crossing you fingers and hoping he didn't just delete you before you could do anything.","replies":[]}]},{"poster":"redniwediS","date":"2014-10-08T20:47:04.977+0000","up_votes":1,"down_votes":1,"body":"Exactly this.  While the slow was put in to replace the silence it was not designed to be equal in strength.  The silence was too strong, and so they put in something weaker.  If it proves to be too weak they will put something a bit stronger in, and so on.","replies":[]}]}]}]},{"poster":"ccseancc143","date":"2014-10-09T05:58:27.685+0000","up_votes":3,"down_votes":0,"body":"The nerf killed Talon, one of the easiest matchups Talon has was Veigar , (squishy and immobile) now it one of more or less frustrating matchups since without the silence Veigar can put his stun down and walk away or just beat you down with his full combo. I personally think the 1 second  silence was op but, a 99% .25 slow is garbage. without the silence Talon isn't Talon.","replies":[{"poster":"wolfax","date":"2014-10-09T23:44:43.213+0000","up_votes":1,"down_votes":2,"body":"So, the fact his winrate hasn't changed at all is indication he's ruined? Obviously you just don't know how to play Talon.","replies":[{"poster":"ccseancc143","date":"2014-10-11T16:11:12.852+0000","up_votes":3,"down_votes":0,"body":"What are you even saying. You make such stupid assumptions just because I say that Talon actually goes even with Veigar now? Talon used to fucking demolish Veigar in lane and teamfights, now Veigar can literally throw down his stun and run away because without the silence you cant stick to him. You know its bad when one of the hardest counter to another champion starts to go even with them.","replies":[{"poster":"Rush Recklessly","date":"2014-10-11T19:39:56.720+0000","up_votes":1,"down_votes":0,"body":"Literally feel useless with his E now. The silence was the reward for using your gapcloser, we have no such rewards anymore or ANY reward for putting ourselves in harms way for that matter.","replies":[]}]}]}]},{"poster":"junglerboy16","date":"2014-10-09T14:42:00.981+0000","up_votes":2,"down_votes":0,"body":"I'm glad someone finally put together a reasonable argument why Talon's silence is different from Kass and LB. I don't play any of them, but you are totally right. Talon's silence isn't a get out of jail free/no retaliation card like LB's or Kassadin's because he has to walk away, and even with his ult stealth (nothing if they have a pink), you still are in a lot more risk during your whole assassination attempt in comparison to any other assassin, like Zed or Fizz. I mean, really Riot? you remove Talon's only consistent way to keep from taking damage, but you let Zed keep his shadows and Fizz keep his Troll Pole? how is a measly 1 second silence stronger than dodging all incoming damage while waiting for cool downs? Talon's silence fits thematically into the skill, and for not dealing damage, a 1 second silence is not that long for an ability.","replies":[]},{"poster":"Dunderflump","date":"2014-10-08T19:56:02.971+0000","up_votes":2,"down_votes":2,"body":"Assassins being incapable of performing their role is always fair. I mean, just look at LeBlanc! Her gutting was the epitome of 'fair'. \n\nBut don't worry, guys! She can jump back to her pad longer! :^))))","replies":[{"poster":"wolfax","date":"2014-10-08T20:39:40.409+0000","up_votes":1,"down_votes":2,"body":"You know, just ignore the fact his winrate is still very much unchanged from what it used to be and it's still above 50% across the boards. Just worthless, right?","replies":[]}]}]}