{"poster":"Battle Cry First","date":"2018-02-01T13:00:55.059+0000","title":"Mein League of Legends Patch downloadet nur mit 150 kb/s; während alles andere besser lädt.","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich habe folgendes Problem;\r\nund zwar downloadet mein Client nur mit 150 kb/s. w&auml;hrend andere Spiele z.B. WoW mit 2,5 mb/s. downloaden, \r\n\r\nbin ziemlich &uuml;berfragt, habe die firewall tempor&auml;r deaktviert sowie auch mein Virenschutz, trotz allem downloadet es nur mit 150 kb/s. \r\n\r\ndas interessante ist, die ersten 10 sec. downloadet der client konstant mit 2,5 mb/s. dann f&auml;llt die Downloadrate rapide auf 100-200 kb/s. \r\n\r\nworan k&ouml;nnte es liegen? \r\nbitte um Hilfe","replies":[{"poster":"DrYatty","date":"2018-02-01T15:24:22.666+0000","up_votes":1,"down_votes":0,"body":"Du kannst dir den Fertiggepachtend-Client hier herunterladen ->(ACHTUNG: Der Download startet direkt, 7,8GB) http://client.wrenchbox.de/ , wird auch immer Up-to-Date gehalten. \n\nDer Ordner Nadadrin ist der normale \"League of Legends\"-Ordner welcher nur einen anderen Namen trägt.  ","replies":[{"poster":"Battle Cry First","date":"2018-02-01T16:08:03.920+0000","up_votes":1,"down_votes":0,"body":"danke dafür. wie passierts mit dem Patch? also wenn nen update kommt? muss ich das denn wieder \"deinstallieren\"?  weil der patch ja bei mir irgendwie am harken ist..","replies":[{"poster":"DrYatty","date":"2018-02-01T16:53:52.813+0000","up_votes":1,"down_votes":0,"body":"Wenn du Glück hast spinnt das Patchen danach nicht mehr, sonst kannst du es immer wieder dort Downloaden. Normalerweise dauert, bis der aktuellste Patch dort verfügbar ist, 1-3 Werktage. D.h. Da Dienstags der Patchday ist sollte es spätestens Freitag/Samstag geupdated sein.","replies":[{"poster":"Battle Cry First","date":"2018-02-01T18:06:39.286+0000","up_votes":1,"down_votes":0,"body":"okay vielen dank! :) es downloadet jetzt, dauert nur noch 20 min. der Patch war bis jetzt erst bei 31% angelangt..","replies":[]}]}]}]},{"poster":"Gin","date":"2018-02-01T13:10:31.821+0000","up_votes":1,"down_votes":0,"body":"Der Client installiert oder entpackt Pakete, dementsprechend lädt er in dem Moment nichts/wenig herunter. Das heißt dass es durchaus möglich ist dass deine Downloadrate auf bis zu 0 kb/s fällt, das heißt allerdings nicht das dein Patch währenddessen nicht weiterläuft.","replies":[{"poster":"Battle Cry First","date":"2018-02-01T13:14:32.290+0000","up_votes":1,"down_votes":0,"body":"dies macht er seit knapp 2 stunden, bin dadurch auch erst auf sage und schreibe 12 % des Fortschritts gekommen..\nnicht das irgendwas an einem Laptop ist?","replies":[{"poster":"Qbert","date":"2018-02-01T13:18:20.985+0000","up_votes":1,"down_votes":0,"body":"sowas kann durchaus auch am anderen Ende liegen, nicht unbedingt an dir.\nIch weiß nicht, wie der Client arbeitet, ob über Torrent oder direkten DL.\n\nManchmal hilft auch ein Neustart des Downloads. Also Client zu -> (vllt. PC neustarten) -> Client neustarten und er macht dort weiter, wo er aufgehört hat.","replies":[{"poster":"Battle Cry First","date":"2018-02-01T13:24:09.648+0000","up_votes":1,"down_votes":0,"body":"den Neustart habe ich schon hinter mir, auch nen Routerneustart. das problem ist, dass mein Patch nicht dort weiter macht wo ich aufgehört habe sondern, von vorn beginnt. Also kann ich das auch abharken, hab's mit vielen mitteln probiert, Netzwerktreiber auch aufgefrischt, Client Repair durchgeführt, das Game nochmal deinstalliert und neu herunter geladen, pmb.exe auch runter geschmisse, quasi alles in meiner mir erdenklichen Macht stehende getan, doch leider hat nichts geholfen. \ndeshalb bin ich ja hier, hoffe das mir soweit irgendjemand helfen kann. \n\ndas geht mittlerweise seit 2 tagen so, ich durchforste das Internet um irgendwie mehr rauszufinden, doch das meiste ist ist dann so formuliert, dass ich das nicht verstehe oder ich es schon angewandt habe.","replies":[{"poster":"Homunculi","date":"2018-02-01T13:39:41.643+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\nes kann sein das dir deine Firewall/das Antivirenprogramm in die Parade fährt, suche mal nach deinem Programm und wie man \"Ausnahmen\" hinzufügt. \n\nLass auch das Setup/den Client mal \"als Administrator starten\".\n\nEvtl. sind auch die Ports im Router nicht richtig freigeschalten.","replies":[{"poster":"Battle Cry First","date":"2018-02-01T13:57:44.369+0000","up_votes":1,"down_votes":0,"body":"da ich mein Virenprogramm/Firewall temporär deaktiviert habe, weiß ich nicht wie ich das verstehen soll, \n\nClient startet automatisch mit Administrator rechten. \n\nwie kann ich die Ports denn öffnen, bzw. wieso haben sie bis letzte woche noch super fungiert und jetzt nicht mehr?","replies":[{"poster":"Homunculi","date":"2018-02-01T14:41:47.997+0000","up_votes":1,"down_votes":0,"body":">da ich mein Virenprogramm/Firewall temporär deaktiviert habe, weiß ich nicht wie ich das verstehen soll,\n\nGekonnt überlesen. Wenn man die Software Firewall ausschaltet,springt normalerweise die Windows Firewall automatisch an.\n\n>Client startet automatisch mit Administrator rechten.\n\nAlso hast du in den Eigenschaften das Häckchen gesetzt?\n\n>wie kann ich die Ports denn öffnen, bzw. wieso haben sie bis letzte woche noch super fungiert und jetzt nicht mehr?\n\nWas für einen Router nutzt du? Kann gut möglich sein das ein Update lief und dir die Konfig zerlegt hat, muss nicht, aber kann.\n\nDu hast zwar Ingame keine Probleme, aber trotzdem würde ich gerne mal einen Tracert sehen^^.\n\n>Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\nZusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\nEin gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download:\nhttps://www.pingplotter.com/download.html \nUm ein Log zu erstellen, ladet das Programm bitte runter und stellt es dann folgendermaßen ein:\n\n>Trace Interval: 1 second\nFocus Time: all\nTarget Name: 185.40.65.1\nStartet das Programm dann über den grünen Button oben links und lasst es laufen, während ihr im Spiel seid.\nWenn während des Spiels Probleme aufgetreten sind, ist das Log verwertbar und kann folgendermaßen im Forum geteilt werden:\n\n>Edit -> Copy as Text\nGeht nach Pastebin.com\nFügt das kopierte Log unter \"New Paste\" ein und klickt auf \"Create new Paste\"\nKopiert den Link zum Log auf Pastebin aus der Adressleiste und fügt diesen in euren Forenpost ein.","replies":[{"poster":"Battle Cry First","date":"2018-02-01T15:14:59.339+0000","up_votes":1,"down_votes":0,"body":"Windows Firewall ist auch aus.\n\nja genau, dass Häckchen ist gesetzt. \n\ngerade gesehen, die Ports sind offen ^^\n\nhttps://pastebin.com/TtPRia8R","replies":[{"poster":"Homunculi","date":"2018-02-01T15:45:09.623+0000","up_votes":1,"down_votes":0,"body":"Schick den Pingplotter bitte mal an deinen Provider und frag nach obs  bei ihnen irgendwelche Probleme gibt. Ganz sauber ist die Providerseite nämlich nicht.","replies":[{"poster":"Battle Cry First","date":"2018-02-01T16:08:29.514+0000","up_votes":1,"down_votes":0,"body":"dank dir, werde ich machen. hoffe mal die können mir antwort geben! :)","replies":[]}]}]}]}]}]}]}]}]}]}]}