{"poster":"A Waterbottle","date":"2017-07-21T00:25:58.270+0000","title":"URGENTLY NEED HELP! I BED you guys to give me some answers to my questions","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"I&#039;m currently at sliver 5, I main top and support (j4, Shen/Morgana, nautilus, thresh) been stuck here for 3 months now, this post is NOT about toxic behaviour, flaming, etc. it&#039;s about my personal gameplay. I listed problems that I could not generate any solution for. I want to know if that&#039;s my team problem which is just bad luck or it&#039;s my problem, if it is my problem I really wanna improve it but don&#039;t know where to start. please someone give me mercy and tell me the answer. I&#039;m at the point of desperate now.\r\n\r\n1) why sometimes I got more kills in top lane but still loose my tower and get pressured a lot? I&#039;m playing J4 against a garen, I&#039;m able to win early game 6-2 and garen is 1-6. Since I have the advantage I got top first tower and immediately roam to mid (mid and bot isn&#039;t doing well) but the Garen will never leave top lane, all he wants is to attack my towers. At that time I&#039;m still able to 1v1 him to a point I&#039;m 9-3, he&#039;s 2-8. But still he never leave top lane. He just non stop coming back despite I killed him so many times. But then he got tanky and I couldn&#039;t burst him down anymore and his wave clearing and sustain demage eventually pushes me out and able to kill me also taking my towers. But I&#039;m fed I should be helping other lanes but in fact the JG have to help me. This make me feel horrible that I&#039;m able to help the team but I can&#039;t cause he&#039;s pushing too hard, as the result we loose all lanes and lost the game. ( same situation apply to when againsting a tryndamere. )  is this is my problem or my teams problem? If it&#039;s my problem what should I do next time?\r\n\r\n2) sometime when I decided to do demage to their tower after a kill, but then when the laner came back I&#039;m in a disadvantage cause he&#039;s full health and I&#039;m half, should I recall or play safe？(considering jg isn&#039;t free for gank and no TP) if I recall he will do demage to my tower if I play safe I&#039;ll loose a lot of farm and give enemy kill potential.  I think knowing when to recall and when to push is actually a crucial part of the game.\r\n\r\n3) what&#039;s the best way to counter a top laner with a fast clearing speed and a \r\nJ1v1 dominate kit that doesn&#039;t leave top lane even after he die many times from ganks. \r\n\r\n4) is it I didn&#039;t play aggressive enough when I should? \r\n\r\nThere are too many unsure, self doubt, frustration, I just don&#039;t understand the game enough. How can I understand the game more and acknowledge the small mistake I made or my opponent made. I really need an enlightenment so that I have pass this stage.\r\nIt would be extremely helpful if some of you can spectate me for a few games and gimme some feedbacks or even coach me. Super desperate, dying to understand and learn but don&#039;t know how.","replies":[{"poster":"A Coiled Viper","date":"2017-07-21T03:24:10.841+0000","up_votes":1,"down_votes":0,"body":"Hi.\n\nLet me start by saying i am by no means an expert or even claim to be a better player then you are but any feedback could be helpful for you and im bored so here we go.\n\n1) Sadly for you this is the nature of Jarvan v Garen. If the game goes long enough he will outscale and dumpster you despite the score line. I have a couple of things that may help you.\n\na) Play a different champ.\n\nNow this may sound like an obvious idea but if you are a decent laner and you can transfer your skills to a scaling monster like Jax, Fiora or Nasus to a name a couple you would have no problem beating up on a Garen later into the game and be able to stop his split push.\n\nb) Forsake your team.\n\nAgain this may sound silly but sometimes the only thing you can do to help is by absolutely demolishing your lane opponent and taking 1,2 or even 3 towers top.  (remember towers give the entire team gold). This way you will draw an enormous amount of pressure from the rest of the enemy team and help your other lanes to take their towers if they had a bad early game. This way also if your opponent is a heavy scaler you will keep him down for longer and possibly be able to 2v1 or even 3v1 when the enemy comes to help him.\n\nc) Roam effectively\n\nThis will take practice and the ability to see into the state of the game. Try and learn where the best place to roam is and look for TP ganks. Don't always look to help the losing lane as this is sometimes a lost cause. If mid is getting wrecked but bottom is about even, look to TP bottom and push your bot lane ahead in their matchup. As you may notice this is the opposite of point B so you need to make the call on what is best based on your knowledge. This will only come with practice. As an example if your top opponent is Nasus and you are destroying him, continue to do so. Take his towers and make him useless for as long as possible. Get as much gold out of him and away from him as possible before you roam. If your opponent was someone like a kennen, take his tower and roam around and help your team. Even late game you will be able to blow up the little yordle so giving him some free farm or even a tower while you help your other lanes is an ok trade off.\n\n2)\n\nThis one is a bit more simple. If you grab a kill early shove the wave into their tower and immediately back. If you are a j4 you aren't going to take the tower on 1 or even 2 minion waves and the chip damage you will do isn't worth a late recall. If you shove and recall immediately you will get back to lane at approximately the same time as your opponent as he has to wait for his death timer as you are shoving. \n\nBy doing this you will have denied them cs and shopped and bought an item to help you further snowball the lane. \n\nIf your jungler helped with the kill and you have a large wave and you are sure you can take the tower it may be worth it. But even then if you are winning lane heavily its never a bad thing to keep your opponent in lane and continue to deny him farm and get a few kills before taking the tower. Again its all about experience.\n\n3)\n\nJarvan is no slouch in the pushing game or the 1v1 game early on. If your opponent is constantly dying to ganks take his tower, deny him farm. See point C of answer 1 for a slightly more detailed response. I think that covers it.\n\n4)\n\nAggression is one thing but knowing how to push your advantage is entirely another. The previous points i made may help with this. Remember Silver is a low standard game and games can easily be won just by good decision making and knowing when and where to push. Split pushing is usually effective and ties in with point B of Question 1.\n\nIn conclusion League is a very complex game with 1000 decisions to be made every game. Watching some YT vids on how to snowball or split push may help you out. Silver is all about hard carrying your team to victory sometimes but there are many ways to do this.\n\nI wish you luck friend and hope you gather something from this.","replies":[{"poster":"A Waterbottle","date":"2017-07-21T07:00:12.829+0000","up_votes":1,"down_votes":0,"body":"Thank you so much, you have no idea how much you helped","replies":[]}]},{"poster":"TheDemonEmperor","date":"2017-07-21T03:43:09.431+0000","up_votes":1,"down_votes":1,"body":"Add me in game for help.","replies":[]}]}