{"poster":"HAPKOMAH","date":"2017-06-23T11:34:19.166+0000","title":"Level 3 Honor","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":3,"body":"Hi there I have a couple of questions to ask you guys, first off do honors from bot games count? (I am considering spamming bot games and helping people out to improve on mastering champions and helping with builds). And also does anyone know some one who is level 3 honor already?","replies":[{"poster":"ToweringThunder","date":"2017-06-29T23:13:57.103+0000","up_votes":2,"down_votes":1,"body":"My friend told me there was a way to get it faster, go in a lobby of 5 and 4 of you honor the same person and rotate who you guys honor each game, it gives you the multi honor and full team honor boost. meaning you can get level 3 slightly quicker.","replies":[{"poster":"Project Xayah","date":"2017-06-30T00:54:32.810+0000","up_votes":2,"down_votes":0,"body":"Actually, this would likely mean you progress *slower*, not quicker. Riot knew that people would try to \"game the system\" by grouping together and honouring each other, so designed Honour to ensure that they gain \"literally no benefit\" in doing so.\n\nYou can check out the [Honour FAQ](https://support.riotgames.com/hc/en-us/articles/115008474148) for more info.","replies":[{"poster":"AnataBakka","date":"2017-06-30T21:13:28.196+0000","up_votes":2,"down_votes":0,"body":"This is only if a teamate gets honore by more premades right? If i solo duo with a friend and we both honor each other we don't gain much at all?","replies":[{"poster":"Project Xayah","date":"2017-07-01T01:28:26.058+0000","up_votes":1,"down_votes":0,"body":"From what I understand, this should apply to all group-queued players, regardless of the size of the group. From what I understand, the Honour system is about standing out and showing positive attitudes, not so much for the benefit of your friends, but for the benefit of the overall community. That said, it makes sense for Riot to enforce a \"lesser weight\" on Honours received from people you've queued with.","replies":[]}]}]}]},{"poster":"Sp1rit Rush","date":"2017-06-23T14:27:20.066+0000","up_votes":2,"down_votes":0,"body":"Also you dont need to receive honours to level up, You can climb just by sticking to the summoners Code and not receiving any punishments (This includes low Priority Queue)","replies":[{"poster":"HAPKOMAH","date":"2017-06-23T14:32:46.280+0000","up_votes":1,"down_votes":0,"body":"I just thought there might be a faster way of earning it by helping others out","replies":[]}]},{"poster":"helovietnam","date":"2017-10-15T02:21:51.328+0000","up_votes":1,"down_votes":0,"body":"helo","replies":[]},{"poster":"xXMissMattyXx","date":"2017-07-29T12:50:13.325+0000","up_votes":1,"down_votes":0,"body":"I just reached honor level 3 out of nowhere.","replies":[]},{"poster":"aaron24711","date":"2017-07-27T14:08:31.587+0000","up_votes":1,"down_votes":0,"body":"I am level 3 in the honor system just got it","replies":[{"poster":"Legazyzz","date":"2017-07-27T15:49:59.353+0000","up_votes":1,"down_votes":0,"body":"Any idea on how you got it? I was playing a game earlier today and an enemy {{champion:81}} had the Honor 3 flair in loading screen.","replies":[{"poster":"aaron24711","date":"2017-07-29T12:36:25.671+0000","up_votes":1,"down_votes":0,"body":"It takes a long time to get it around 1 month of standard play I would say I got around 100-200 honors before I leveled up but it is also affected through bans and games you quit out of that loses a lot as well so it","replies":[]}]}]},{"poster":"HAPKOMAH","date":"2017-07-01T23:40:32.673+0000","up_votes":1,"down_votes":0,"body":"http://imgur.com/LjKKZf8","replies":[{"poster":"HAPKOMAH","date":"2017-07-01T23:41:46.808+0000","up_votes":1,"down_votes":0,"body":"at least its a cool looking tat :D","replies":[]}]},{"poster":"Project Xayah","date":"2017-06-23T12:27:19.117+0000","up_votes":1,"down_votes":0,"body":"> do honors from bot games count?\n\nI'm not sure if honours from bot games count, though I would think they most certainly do (maybe with a lesser \"weight\", though). I'll see if I can find out more about that.\n\n> does anyone know some one who is level 3 honor already?\n\nOne thing to consider about the Honour system is that it is more about *consistency* than quantity. Based on the FAQ, it would seem that advancing each honour level would take several weeks, if not months, even if you are regularly receiving honours. That said, I doubt it would be possible to hit Honour level 3 this soon, as the system has only been live for a bit over a week.","replies":[{"poster":"HAPKOMAH","date":"2017-06-23T12:54:49.160+0000","up_votes":1,"down_votes":0,"body":"Thank you very much for your info kind sir :)","replies":[{"poster":"Project Xayah","date":"2017-06-23T22:56:16.678+0000","up_votes":1,"down_votes":0,"body":"Quick update on the Coop honours, they should give as much progress regardless of the game mode they're received in, so you should be fine to earn them like that.","replies":[{"poster":"HAPKOMAH","date":"2017-06-26T08:41:27.061+0000","up_votes":1,"down_votes":0,"body":"You are a Legend :P unfortunately I am having a surgery on my right hand tomorrow so Rip LoL and the honors haha","replies":[{"poster":"Elytra","date":"2017-06-28T16:36:25.747+0000","up_votes":1,"down_votes":0,"body":"Hope it went well haha ;o","replies":[]},{"poster":"PrimalAsuna","date":"2017-06-27T08:20:24.907+0000","up_votes":1,"down_votes":0,"body":"You could always queue up and tell  people what happened and get sympathy honours? xD","replies":[]}]}]}]}]},{"poster":"Naut lnstalocked","date":"2017-06-30T22:35:44.207+0000","up_votes":0,"down_votes":4,"body":"!!","replies":[]}]}