{"poster":"ilsimptico","date":"2018-01-24T19:35:30.905+0000","title":"League of legends: un gioco sempre meno per divertirsi ma sempre più competitivo","subforum":"Discussioni generali","up_votes":2,"down_votes":9,"body":"Sono l&#039;unico che se ne &egrave; accorto? Pi&ugrave; andiamo avanti e pi&ugrave; il gioco diventa competitivo, e meno aperture ci sono al divertimento.\nRicordo quando avevo iniziato a giocare, che ci divertivamo inventandoci le peggio cose, combo blitz thresh nautilus, nunu ap mid ad aspettare gente nei cespugli ed esploderla, thresh full ad top, mordekaiser adc che shottava di terzo colpo della Q. \n\nMa io sono una persona sola e non conto molto, prendo qualcuno di pi&ugrave; famoso, Siv HD per esempio.\nForse non tutti ve lo ricordate, magari i nuovi non l&#039;hanno nemmeno conosciuto, ma se avete mai visto un suo video vedevate che lui si divertiva giocando in modo alternativo e non trollandoo intando, leblanc con 6 mejai o con 6 roa, sion full hp regen, nunu full ap, janna full ad mid, nasus full ap, ww ap, bard full attack speed, i juke con la copia di leblanc e altre 3000 cose \n\nE adesso? Cosa &egrave; cambiato? Perch&egrave; non si vede pi&ugrave; niente di simile? Le rune hanno meno combinazioni possibili, sono pi&ugrave; mirate al competitivo e non ti permettono pi&ugrave; di andare magari full as, adesso usare rune alternative porta al trolling. I campioni sono stati nerfati, gli item sono stati selezionati e modificati in modo da impedire che qualsiasi configurazione &quot;alternativa&quot; (come scritto sopra per esempio 6 mejai o 6 roa, o magari 6 spade dell&#039;occulto per chi se le ricordasse ancora) funzioni e sia divertente da giocare; &egrave; venuto a mancare quella possibilit&agrave; di essere speciale e unico, col tuo champ magari fuori posizione con la tua configurazione, che tutti quanti ti dicevano non funzionasse ma con cui te vincevi lo stesso\n\nCapisco che League of legends si stia evolvendo e stia creando un mondo di gioco competitivo, Esports, a cui si sta dando sempre pi&ugrave; importanza, magari &egrave; un bene, ma a me manca il vecchio lol\n\nScusate ma non sono mai stato molto bravo a scrivere e non ho la pi&ugrave; pallida idea di come finire questo post, quindi chiudo qua, spero di avervi ricordato i bei vecchi tempi magari, con qualche momento di &quot;uaaaahh &egrave; vero, come vola il tempo, e poi quando facevamo ..., te lo ricordi????&quot; insieme ai vostri amici che giocano a questo gioco; ditemi cosa ne pensate e buona serata evocatori","replies":[{"poster":"FireM1nd","date":"2018-01-24T19:56:51.944+0000","up_votes":5,"down_votes":1,"body":"Sui moba il divertimento è COMPETERE. Se non competi per migliorare, SEMPRE, te stesso, le tue abilità,  le tue conoscenze tattiche, vuol dire che non hai ben capito qual'è l'idea chiave su cui lol è concepito. La riot ha fatto uscire, l'anno scorso, un video dove raccoglieva le testimonianze dei suoi primi stagisti, e raccontava agli utenti, noi, come è nato il gioco, quali erano i concetti chiave, quali i problemi,  etc..\n\nLoro hanno detto, chiaramente, che volevano creare un gioco APPOSITO per gli hardcore gamers,   tutto, se possibile, incentrato sull'aspetto competitivo. Questo è lol, competizione pura, punto. O almeno, lo è secondo la riot,  e in tal senso si svilupperà.","replies":[]},{"poster":"Darkinknight","date":"2018-01-24T20:46:37.305+0000","up_votes":3,"down_votes":0,"body":"Non capisco cosa ci sia di divertente a buildare 6 Roa o 6 mejai o simili onestamente. Anche volendo Le combinazioni alternative sono diventate molte di piu, prima le rune erano praticamente standard ed erano relativamente influenti. I campioni sono stati nerfati..wut?nerf e buff,anzi,se proprio in generale li hanno potenziati di danno,CC e resistenze decisamente superiori ora rispetto a prima.\nEsempio Nasus full ap funziona meglio di prima ora che qualsiasi cosa ti tira dietro cdr e mana. Janna full ad pure,le rune attuali la aiuterebbero molto di piu dandole as aggratis o danni potenziati da tutte le fonti. bard full as pure. Mordekayser che esplodeva alla 3 Q come adc non era troll,era solo rotto.\n Non è che ora manchi il trollaggio,è che è gia stato fatto e rifatto e non è cosi entusiasmante da provare.\nVa verso sempre piu al competitivo rispetto al puro divertimento,questo sicuramente. Ma come mentalita dei player non tanto quanto il poterlo fare nel game.","replies":[]},{"poster":"Due spade","date":"2018-01-24T19:51:06.924+0000","up_votes":3,"down_votes":0,"body":"Io continuo ad usare la mia cara miss fortune AP mid. °w° O, la mia amata Leona giugla, o ancora Soraka top/mid per dirne alcune. \nE quando mi chiedono se trollo, rispondo sempre allo stesso modo. \n\nNon trollo mai, ma schifo spesso. {{sticker:slayer-pantheon-thumbs}} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n...certo 10-15 fps non aiutano alla causa. {{champion:28}}","replies":[]},{"poster":"Linkimaru","date":"2018-01-24T21:11:44.005+0000","up_votes":1,"down_votes":1,"body":"Il vero divertimento era in season 2/3, master Yi ap Mid quello sì che era divertente...mi son fermato quando ho letto mordekaiser adc ed ho capito che i tuoi “vecchi tempi” sono iin realtà tempi molto recenti per me.. quando hai iniziato a giocare in season 5?...","replies":[{"poster":"astenar","date":"2018-01-25T09:40:15.642+0000","up_votes":2,"down_votes":0,"body":"Che tempi, quanto era bella tristana full ap, che one hittava con w r. Bha le generazioni di adesso non ci capiscono più nulla","replies":[]},{"poster":"ilsimptico","date":"2018-02-08T21:41:50.936+0000","up_votes":1,"down_votes":0,"body":"Ok ho circa 2 settimane di ritardo, comunque ho iniziaro poco dopo che è uscito vel'koz, quindi patch 4.3","replies":[]}]},{"poster":"astenar","date":"2018-01-25T09:39:04.012+0000","up_votes":2,"down_votes":0,"body":"Il gioco punta ad essere competitivo, quindi è giusto che venga bilanciato. Il fatto che non tu diverti più non deriva da questo, ma da una tua condizione mentale che ti sei imposto. Io continuo a divertirmi, gioco nunu full ap, fiddle top rakan ap mid... ma mi diverti un casino anche a giocare in meta. Quando gioco blitz mi sfascio sempre di risate ( e ogni tanto sembro matto poichè rido da solo). Il bilanciamento del gioco è solo un bene e anzi ci permette di divertirci appunto perché è bilanciato, in un gioco in cui ( esempio a casa) darius preme e e ti grabba anche se flashi via a 2000 unità di distanza non è divertente, perché? Perchè non esiste counter- play, non puoi fare nulla e quindi non ti diverte. Anzi adesso che il gioco è più bilanciato ci si può divertire di più. Le rune sei tu che le vedi come una forma di restrizioni, a me hanno aperto un mondo. Le vecchie rune era molte più da pro player di adesso e toglievano scelte ai giocatori. Infatti cosa so faceva se si voleva essere competitivi, copia e incolla dei proplayer. Adesso, anche se questo non è completamente diverso, hai più possibilitàndi libertà. Tutti giocano bard con dominazione e elettrocshoc, io mi posso divertire ( e vincere) anche con bard con determinazione.","replies":[]},{"poster":"ReyZør","date":"2018-01-24T20:03:58.458+0000","up_votes":2,"down_votes":1,"body":"LoL è sempre uguale, ha sempre offerto una modalità competitiva (ranked) e modalità in cui divertirsi (normal/aram/modalità a rotazione).\nLe combo con Thresh/Blitz/Nauti le puoi ancora fare, Nunu AP mid lo puoi ancora fare (dopo questa patch poi...vabbè), Thresh full crit lo puoi ancora fare ecc...\nNon puoi fare 6 roa? ma perchè dove sarebbe il divertimento in questo? Cosa hai perso nel non poter fare 6 roa/mejai?\nIn normal puoi fare quello che ti pare e le nuove rune ti permettono di fare molte cose divertenti, c'è un ramo apposta addirittura.","replies":[{"poster":"ilsimptico","date":"2018-01-24T20:09:33.536+0000","up_votes":1,"down_votes":0,"body":"Non è un ramo apposta, lo stopwatch lo usano anche agli lcs, molte maestria hanno un attuale uso che non sia per divertirsi. Nauti blitz thresh si può ancora fare, ma i danni di thresh sono stati nerfati e anche quelli di nautilus ap, e poi Blitz non può più prendere la lanterna di thresh, quindi lo puoi fare ma finiresti per intare in 3 su 5","replies":[{"poster":"ReyZør","date":"2018-01-24T20:18:11.378+0000","up_votes":1,"down_votes":0,"body":"Non ho detto che lo stopwatch sia divertente e troll, ho detto che usando quel ramo puoi fare cose divertenti (infatti è stato presentato come il ramo che ti permette di rompere gli schemi del gioco), l'hexflash ne è un esempio lampante.\nTi do ragione sulla combo di thresh-blitz, lo avevo dimenticato. Ma per il resto se vuoi divertirti puoi fare tutto","replies":[]}]}]},{"poster":"Sorcio84","date":"2018-01-25T22:30:35.428+0000","up_votes":1,"down_votes":0,"body":"Benvenuto su league of legends :p\n\noh guarda, anche qui è pieno di gente ignorante che preferisce mettere i -1 piuttosto che metterre la faccia in un commento :D","replies":[]}]}