{"poster":"Denyyyy","date":"2015-02-09T15:06:10.794+0000","title":"Ich hasse dieses neue Forum","subforum":"Allgemeiner Chat","up_votes":5,"down_votes":5,"body":"Furchtbar. \r\nWas soll dieses sinnlose Forum?\r\n\r\nManche interessierten sich nie für Dinge, die im \"Vorschläge für neue Champs\" Forum geschrieben wurde (da die ja eh zu weniger als 1% jemals umgesetzt werden) und ansonsten ist das Forum unübersichtlicher als früher...\r\n\r\nHasse es","replies":[{"poster":"Hyperintuition","date":"2015-02-09T15:26:21.824+0000","up_votes":1,"down_votes":0,"body":"Du verwendest die Ansicht mit der du alle Foren gleichzeitig einsehen kannst.\nMöchtest du nur ein bestimmtes Forum betrachten, so wähle es doch einfach in der linken Spalte aus.","replies":[{"poster":"eingew","date":"2015-02-09T15:28:57.761+0000","up_votes":3,"down_votes":1,"body":"Naja, der Vorschlag, dass man einige Foren \"abonnieren\" kann und dann nur diese auf der Hauptseite angezeigt werde, wäre durchaus eine ziemlich praktische Verbesserung.","replies":[{"poster":"Hyperintuition","date":"2015-02-09T15:32:20.097+0000","up_votes":3,"down_votes":0,"body":"Ja das wäre sehr praktisch und wurde auch schon ein paar mal Vorgeschlagen. Wenn wir Glück haben, dann kommt das sogar.\nIch finde aber, dass diese neue komplett Übersicht ein Schritt in die richtige Richtung ist.","replies":[]}]}]},{"poster":"Hüxün","date":"2015-02-09T15:29:34.027+0000","up_votes":3,"down_votes":0,"body":"Ich bin auch nicht sehr begeistert ~.~","replies":[]},{"poster":"Kind Prow","date":"2015-02-09T18:46:56.436+0000","up_votes":2,"down_votes":0,"body":"Stimme zu, hier isses sehr unübersichtlich, und es brauch soooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo lange zum laden... :(\n\nAber ansonsten isses gut :)\nIzo Alex","replies":[]},{"poster":"Ragequit Account","date":"2015-02-09T16:14:00.725+0000","up_votes":2,"down_votes":0,"body":"Ich stimme mal zu.\nDieser Mist hier taugt nicht viel.","replies":[]},{"poster":"Hakkuu","date":"2015-02-09T16:10:46.354+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Denyyyy,realm=EUW,application-id=YnZkMR0R,discussion-id=z5qsQmNX,comment-id=,timestamp=2015-02-09T15:06:10.794+0000)\n\n> Manche interessierten sich nie für Dinge, die im \"Vorschläge für neue Champs\" Forum geschrieben wurde (da die ja eh zu weniger als 1% jemals umgesetzt werden) und ansonsten ist das Forum unübersichtlicher als früher...\n\nDann solltest du wohl nicht in diesem Teil des Forums aufhalten, da kann ich dir auch nicht helfen. Und wenn du auf der Startseite bist, siehst du doch sofort neben einem neuen Thread, in welcher Kategorie er geschrieben wurde und wenn der Titel \"Champion Vorschlag\" ist, sollte das auch so ersichtlich sein.\n\nZur Übersichtlichkeit: Ich weiß wirklich nicht, was man an diesem Forum irgendwie übersichtlicher machen könnte. Man sieht immer wo man ist, links hat man geordnet alle Bereiche des Forums und darunter die aktuellen Riot Posts. Die Neuigkeiten Box oben rechts aktualisiert sich automatisch, man kann sofort zum entsprechenden Kommentar springen und antworten.\n\nWer damit nicht klar kommt, soll mir zeigen warum das alte Forum besser gewesen sein soll. Außerdem gibt's das ja immer noch, also bleibt dort wenn's euch nicht gefällt...","replies":[]},{"poster":"Miscalculated","date":"2015-02-09T18:44:07.528+0000","up_votes":1,"down_votes":2,"body":"Hallo Denyyyy,\n\nich finde auch, dass das neue Forum nicht sehr gelungen ist.\nDas Alte fand ich um längen besser!\n\n\nMit freundlichen Grüßen\n\nxRekt by Jason","replies":[]}]}