{"poster":"Tele","date":"2015-11-04T02:13:06.514+0000","title":"Foreseeable problems with Season 6 in OCE","subforum":"Gameplay & Strategy","embed":{"description":"This upcoming season we're replacing the solo/duo queue with a dynamic group queue, where you'll be able to climb the ladder with any number of teammates, going from single participation all the way to a full team comp. There's no longer a penalty for players ranking together, so the benefits of grouping up will always prevail.","url":"http://na.leagueoflegends.com/en/site/2016-season-update/ranked-improvements.html","image":null},"up_votes":4,"down_votes":1,"body":"How is the new Dynamic Group system going to work on OCE? Rioters here constantly say that we can&#039;t have Normal Draft due to our low player base, but you plan to implement Dynamic Group system?\n\nIn case anyone doesn&#039;t know, basically, you can queue up for ranked as a 5 man team in Season 6. Of course to keep this balanced there&#039;s a new system called Dynamic Grouping, this is how riot described it;\n\n_The system is designed so that groups will almost always play against similarly grouped opponents (so if you&#039;re in a premade five, there&#039;s a 95% chance you&#039;ll run into another premade five). _\n\n**How is this going to work in OCE?** Since we have such a low player base wont the chance be much lower than 95%? Either that or 20 minute queue time at certain hours in the day.","replies":[{"poster":"Olee","date":"2015-11-04T02:18:48.965+0000","up_votes":2,"down_votes":0,"body":"I'm actually really interested to know more about this. At the moment, I'm not a fan. I don't duo let alone will I 5man ranked unless it's a legit Ranked 5s team which I have done before and was quite happy doing so. I just really like the idea of climbing Solo and relying on almost only yourself to get through the ranks. \n\nI would like to know how this would affect those who are queueing up solo, like is it possible to have a team of 5 strangers against a team of two duos and a solo or even a trio and a duo?","replies":[{"poster":"fattyhotdogs","date":"2015-11-04T02:30:16.681+0000","up_votes":1,"down_votes":0,"body":"I feel like it will 'dynamically' place grouped teams against other groups. Inevitably those situations will occur with a group of 5 vs 5 solo's, but we will have to wait and see how good the system is with avoiding that","replies":[]}]},{"poster":"Euphener","date":"2015-11-04T06:38:54.426+0000","up_votes":1,"down_votes":0,"body":"For the new champ select, it'll be annoying when someone else in ur party gets the lane that u wanted, since he chose to be mid aswell as yourself, but by chance your friend gets it.","replies":[]}]}