{"poster":"Tele","date":"2016-01-12T19:30:34.494+0000","title":"Welp, I think Jhin is broken.","subforum":"Gameplay & Strategy","embed":{"description":"The Virtuoso Jhin's assembling his gun and orchestrating his grand entrance onto the Rift. He's meticulous and calculating - League's slowest marksman yet. But when the murderous artist gets you in his sights, when he catches you off-guard, there's not much that'll save you from an inevitable, perfect death.","url":"http://oce.leagueoflegends.com/en/page/champion-reveal-jhin-virtuoso","image":"http://news.cdn.leagueoflegends.com/public/images/pages/2016/january/jhin/img/Jhin_E.jpg"},"up_votes":3,"down_votes":0,"body":"This guys looks OP. I think he has the longest range CC in the game. If he's weak on release, it'll be his numbers, like we had with Kalista.","replies":[{"poster":"a lesbian","date":"2016-01-12T19:35:15.670+0000","up_votes":2,"down_votes":0,"body":"they have to make him broken or nobody will buy him","replies":[{"poster":"Tele","date":"2016-01-12T19:38:44.933+0000","up_votes":3,"down_votes":0,"body":"True ahah, but he's actual going to be such a problem. That passive, looks beast in lane.","replies":[{"poster":"lordofrage","date":"2016-01-12T20:26:35.120+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Telecasterdude,realm=OCE,application-id=FjGAIbRv,discussion-id=maZLAJ1u,comment-id=00010000,timestamp=2016-01-12T19:38:44.933+0000)\n>\n> True ahah, but he's actual going to be such a problem. That passive, looks beast in lane.\n\nyas can block half of his stuff lol","replies":[]}]}]},{"poster":"Malkavszorn","date":"2016-01-24T09:13:49.106+0000","up_votes":2,"down_votes":1,"body":"New champ is edgy as fuck? -check\nNew champ has a retardedly overloaded kit? -check\nNew champ has retarded minigames that add absolutely nothing to the gameplay and are nearly impossible to properly balance? -check\nNew champ has %maxlife dmg that is laughably easy to apply to the enemy? -check\nNew champ has mechanics that are nothing more than powercreep? -check\nNew champ has little to no weaknesses and loads of strengths? -check\n\n\nSeems like the typical screwup from Riot in order to earn some dosh\nHe will either be UP as fuck or OP as fuck, Riot literally can't design champs anymore that are actually balanced\nnothing new to see here","replies":[]},{"poster":"BarryButcher","date":"2016-01-13T03:26:59.437+0000","up_votes":1,"down_votes":0,"body":"Giving an ADC a root seems kinda dumb, but I don't think he will be OP. If he could root more than 1 champ at a time then maybe, but since the root stops at the first champion hit should be ok.\n\nIt will all come down to the passive numbers as to whether or not hes broken. How much AD will he get per Attack Speed.","replies":[{"poster":"Tele","date":"2016-01-13T09:26:17.389+0000","up_votes":1,"down_votes":0,"body":"Quick explanation. \n\n+ **Passive:** Basically a better version of Caitlyn's passive. He gets 3 auto-attacks early game, and will zone you until he needs to last hit the next creep. Basically a \"fight me\" ability. \n\n If you trade with him, he crits, you loose. If you allow yourself to get zoned, you loose minions.\n\n He just has to auto-attack to get this control, that's powerful.\n\n\n+ **Q:** You're right, nothing crazy here. \n\n It's a nice wave clear ability, with some strong poke added in. But there's lots of counter-play. It will make him a little overloaded in teamfights though. Sniper with AOE?\n\n Whatever, this ability isn't that bad.\n\n\n+ **W:** I thought this ability was fine too. Until I read what it said.\n\n _\"Enemy champions that have been struck by Jhin’s basic attacks, Captive Audience, or **any allied damage** are marked for a few seconds.\"_\n\n That's right, any allied damage. \nYou took one auto from lux? Might get rooted from halfway down river.\nThe cast time isn't that slow either. Looks a just slightly slower than {{champion:101}} **Xerath** Q to me.\n\n\n+ **E:** Just unnecessary to make him overloaded IMO.\n\n The traps will make him hard to gank and shut down. Also it looks like you might be able to TP to them as well (they have health bars). \n\n Will also serve for some nice zoning, pick potential and more AOE damage in teamfights.\n\n\n+ **R:** Honestly, this is the only balanced ability. Damage will be too high on release, but they actual concept is good and follows his champion design.\n\nAlso they forgot too add it on the champion release page, but he has a second passive. Basically whenever you kill someone it spawns a flower that AOE slows and then detonates for damage. Read more about it [here](https://www.reddit.com/r/leagueoflegends/comments/40oev2/the_reveal_is_missing_something_gypsylord/).\n\nThe only thing that might keep him balanced is the attack speed and critical strike thing on his passive. Less critical strike damage wont be an issue with items like Infinity Edge. The attack speed is another story though, but I still think he has enough broken abilities to make up for this.\n\n**TL;DR**\nHe's got {{champion:51}} Caitlyn's poke and ranged executes, with {{champion:21}} Miss Fortune's AOE. Looking overloaded to me.","replies":[{"poster":"JasonWazza","date":"2016-01-13T10:23:37.493+0000","up_votes":1,"down_votes":0,"body":">That's right, any allied damage.\n\nHe'd most likely have to be in a certain range for a mark to apply.","replies":[]},{"poster":"BarryButcher","date":"2016-01-13T10:02:08.525+0000","up_votes":1,"down_votes":0,"body":"yeh I like the Ult. I like the idea of a sniper picking off people as they run away form the fight. Seems legit. But like Caitlyn Ult, will be only useful in certain situations (cast time and all).\n\nW is strong dont get me wrong, I just think its power will be relative to its CD and Root time. I mean, right now im thinking, level 1. Morg bind into Jhin root... G G. Could be ridic.\n\nE seems garbage. I mean, its ok if you can like drop a slow field behind you so you can run away. Guess thats what they gave him instead of a dash. (like MF make it rain)\n\nInteresting they describe him as the \"slowest marksman\". So his movespeed will be interesting to see if it adds some real weakness to him.\n\nHe'll be fun, he'll be broken for 2 weeks, he'll get nerfed to hell and everyone will forget about him.","replies":[]}]}]},{"poster":"RookPusher","date":"2016-01-12T21:29:49.225+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Telecasterdude,realm=OCE,application-id=FjGAIbRv,discussion-id=maZLAJ1u,comment-id=,timestamp=2016-01-12T19:30:34.494+0000)\n>\n> This guys looks OP. I think he has the longest range CC in the game. If he's weak on release, it'll be his numbers, like we had with Kalista.\n\nI didn't get that from his preview. Whats going to make him OP? It seems like anyone who can anticipate his moves should be fine.","replies":[]},{"poster":"lordofrage","date":"2016-01-12T19:33:35.933+0000","up_votes":1,"down_votes":0,"body":"its a new champ what do  u think they are not going to make  him broken haha","replies":[]}]}