{"poster":"Pequeño Billy","date":"2016-07-26T18:15:11.325+0000","title":"¿¿¿¿¿¿¿¿en donde quedo la diversión???????","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":4,"body":"que paso con este juego... cada d&iacute;a mas aburrido... ratas, afk, flamers, ratas, remakers, llorones, ratas, 40 minutos para jugar una partida, ratas y mas ratas... donde quedo campear en un arbusto y morirnos todos por no quitar el ward enemigo, donde quedo robar bar&oacute;n o drag&oacute;n solo para re&iacute;rse un rato, donde quedo hacer chistes por el chat? quiz&aacute; me puse viejo ajjajaj pero no es por eso que ya no me divierte este juego, es por el cambio de jugabilidad donde todos se creen pro cuando es un videojuego, si queres ser pro lee, estudia y se alguien... un videojuego es diversi&oacute;n, entretenimiento, risas y mas risas. o quiz&aacute; ya sea hora de desinstalar esto. si hay alguno de la vieja generaci&oacute;n de LOL va entender esto. cuando jug&aacute;bamos para olvidarnos de un mal pasar, cuando jugabas para matar un d&iacute;a de lluvia o para estirar el tiempo antes de hacer la tareas del colegio.\r\nsi aun hay alg&uacute;n rebelde al sistema Riot me encuentran con el nick Dolores Delorto y juguemos a lo antiguo solo por diversi&oacute;n","replies":[{"poster":"Excorpion","date":"2016-07-26T18:17:59.685+0000","up_votes":6,"down_votes":1,"body":"Te pusiste viejo y amargo...\nyo aún soy lolein y hago todas esas cosas y más","replies":[]},{"poster":"Khimea","date":"2016-07-26T18:26:48.957+0000","up_votes":2,"down_votes":1,"body":"De jugar 5 a 8 partidas al dia pase a jugar 1 o 2.\nNo solo por tienpo sino, por que cada vez tengo menos ganas, el juego se vuelve una bazofia con la comunidad actual.","replies":[]},{"poster":"Warisan","date":"2016-07-26T18:20:29.623+0000","up_votes":2,"down_votes":1,"body":"La diversión está en jugar con 4 amigos más, y si son 9 mejor aún así salen sus personalizadas geniales xd","replies":[]},{"poster":"Akio san","date":"2016-07-26T19:18:46.556+0000","up_votes":1,"down_votes":0,"body":"+1 papu ya estamos viejos ...es tiempo de otra cosa men xdd","replies":[]},{"poster":"Nutria Lucida","date":"2016-07-26T19:14:32.324+0000","up_votes":1,"down_votes":0,"body":"todo cambio el dia que no te esperaron todos los del otro team en el arbusto de bot","replies":[]},{"poster":"Natashaaa","date":"2016-07-26T18:18:49.024+0000","up_votes":1,"down_votes":0,"body":"No hay diversion amigo, recien acabo de carrear una partida, que tambien recientemente subi el penta que hice en esa partida, fui Rumble jg, hice 3 drakes, penta, tire torres, hice baron, no fedee a nadie termine 16/1/9, y aun asi, 2 de mi team me flameaban porque ellos se morian, segun ellos todo es mi culpa, siempre es la culpa del jg, asi hagas las cosas mal, bien, o perfectas, siempre va a haber flameo del tipico sin manos que muere, o el que muere y se va afk porque magicamente tambien es la culpa de los demas, siempre, este juego hace mucho dejo de ser divertido :)","replies":[]}]}