{"poster":"FlixusPetronus","date":"2020-01-29T16:34:24.606+0000","title":"Ich bin zu schlecht :(","subforum":"Champions & Gameplay","up_votes":3,"down_votes":1,"body":"Hallo,\r\n\r\ndas klingt jetzt vielleicht bescheuert, aber ich bin einfach zu schlecht in LoL. Ich bin erst Level 38 und inte trotzdem in jedem Spiel. Zwar mache ich auch Kills und Assists und bin oft gegenüber dem Enemy Jungler Ahead, aber meine KDA ist sehr schlecht (2/6;1/9;2/8 usw.). Das Spiel macht auch keinen Spaß mehr. Da ich weiß das es auch anders geht, möchte ich aber auf gar keinen Fall aufhören. Ich weiß aber auch nicht, wie ich mich effektiv verbessern kann. Bitte Tipps schreiben, ich weiß echt nicht was ich machen soll. \r\nDie ganzen \"Basic\"-Tipps kenne ich schon, wie Pro.Games schauen, Defensiv spielen und so... Hilft mir aber trotzdem nicht :(\r\n\r\nLG\r\nFlixus\r\n\r\nPS: Ich bin Jungler","replies":[{"poster":"Yuiwara","date":"2020-01-29T18:53:34.122+0000","up_votes":3,"down_votes":0,"body":"lvl 38 ist gar nichts. musst mehr spielen, mehr erfahrungen sammeln. man muss sich halt mit den champs auseinandersetzen, seine grenzen ggüber den champs mit dem eigenen kennen usw. (auch ich bin noch lange nicht gut drin).\n\nZum beginn würd ich dir vorschlagen einfach mal alle skills aller champs und ihre passiven durchzulesen. dann informier dich über mögliche equips und dann musst du lernen die fights richtig einzuschätzen (das schwerste).","replies":[]},{"poster":"Bananenschnder","date":"2020-01-29T16:44:26.639+0000","up_votes":2,"down_votes":0,"body":"Spiel ranked. Da wirst du womöglich erstmal einige Spiele ordentlich auf den Sack kriegen, aber nach vielen Spielen wirst du mit Leuten deines Skilllevels gematcht und dann fühlt sich das Spiel deutlich besser an.","replies":[{"poster":"FlixusPetronus","date":"2020-01-31T19:25:42.487+0000","up_votes":2,"down_votes":0,"body":"Naja, in meinem bisher einzigem Ranked-Game haben mich alle für meinem Chamion (Warwick) geflamt und sich fast alles aufgeregt was ich gemacht hatte. Danach hatte ich keinen Bock auf Ranked mehr.{{champion:32}}","replies":[]}]},{"poster":"Tatze137","date":"2020-01-29T17:21:41.418+0000","up_votes":2,"down_votes":0,"body":"naja der level muss nichts heisen  schau doch erstmal paar guides  deffensives spielen ist nicht das einzige musst auch wissen wo der enemy jgl sein könnte wo er ganken geht ect viosion macht auch einiges aus","replies":[{"poster":"FlixusPetronus","date":"2020-01-31T19:24:20.298+0000","up_votes":1,"down_votes":0,"body":"Guides habe ich schon sehr viele geschaut..\nDie wichtigsten Tipps hängen auch am Bildschirmrand.\n\nIch denke aber das ich genug theoretisches und eher weniger praktisches Wissen(sowas wie korrektes und schnelles Einschätzen vom Itembuild und Teamfight bzw. 1v1 Situation) habe und dass es daran scheitert.","replies":[{"poster":"Tatze137","date":"2020-01-31T22:41:46.541+0000","up_votes":1,"down_votes":0,"body":"na wenn das wissen theoretisch vorhanden ist hilft nur das praktische üben oder eben caochen lassen wenn du das machen willst/musst","replies":[{"poster":"FlixusPetronus","date":"2020-02-01T04:44:35.073+0000","up_votes":1,"down_votes":0,"body":"oder eben caochen lassen wenn du das machen willst/musst\n\nwie lasse ich mich denn coachen?\nindem ich mir Guides durchlese und Leute frage was ich falsch mache (so wie hier)?","replies":[{"poster":"Tatze137","date":"2020-02-02T14:15:47.425+0000","up_votes":1,"down_votes":0,"body":"nein gibt doch genug coatches schau mal nach bootchamp oder so kostet zwar was aber wenn es dir wichtig ist wäre das eine möglichkeit","replies":[]}]}]}]}]},{"poster":"NDS Ninjarjar","date":"2020-01-31T08:07:21.689+0000","up_votes":1,"down_votes":1,"body":"1. Spiel Ranked, da dort das Matchmaking besser ist. Im Normal kann es passieren, dass auf der Midlane ein Dia-Spieler gegen einen Bronze-Spieler ran darf. Der Snowballed dann vermutlich so stark, dass du als Jungler eher wenig machen kannst.\n\n2. Spiel weniger Champions. Zu Beginn würde ich mich hier auf einen Champion festlegen und diesen dann auch mal min. 10-20 Games hintereinander spielen, damit du dich mehr auf die Gamemechanics und Winconditions konzentrieren kannst. Ich persönlich wähle hier immer gerne Warwick, da er mit seiner W-passive vorschlägt, wo du hingehen könntest. Außerdem ist er aktuell ziemlich strong\n\n3. Ich persönlich finde es als Jungle-Main ziemlich gut zwischendurch auch mal auf einer Lane zu spielen. Man lernt so die Champions besser kennen und weiß somit später als Jungler, worauf man bei Ganks evtl. achten sollte. Außerdem kann man so seine Mechanics verbessern, da man durchgehend einen menschlichen Gegenspieler vor sich hat und nicht allein durch den Wald tanzt","replies":[{"poster":"Chaquzo","date":"2020-02-03T10:57:20.872+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Gnitch,realm=EUW,application-id=Wj1wcocU,discussion-id=3ati8Nrf,comment-id=0007,timestamp=2020-01-31T08:07:21.689+0000)\n>\n> 1. Spiel Ranked, da dort das Matchmaking besser ist. Im Normal kann es passieren, dass auf der Midlane ein Dia-Spieler gegen einen Bronze-Spieler ran darf. Der Snowballed dann vermutlich so stark, dass du als Jungler eher wenig machen kannst.\n> \n> 2. Spiel weniger Champions. Zu Beginn würde ich mich hier auf einen Champion festlegen und diesen dann auch mal min. 10-20 Games hintereinander spielen, damit du dich mehr auf die Gamemechanics und Winconditions konzentrieren kannst. Ich persönlich wähle hier immer gerne Warwick, da er mit seiner W-passive vorschlägt, wo du hingehen könntest. Außerdem ist er aktuell ziemlich strong\n> \n> 3. Ich persönlich finde es als Jungle-Main ziemlich gut zwischendurch auch mal auf einer Lane zu spielen. Man lernt so die Champions besser kennen und weiß somit später als Jungler, worauf man bei Ganks evtl. achten sollte. Außerdem kann man so seine Mechanics verbessern, da man durchgehend einen menschlichen Gegenspieler vor sich hat und nicht allein durch den Wald tanzt\n\n\n\nspiele bloß kein ranked.. wenn dann nur champions mit denen du mindestens Mastery 4 hast. Dia vs. Bronze: Perfekt: Genau das ist gut wenn du gegen \"bessere\" spielst, so wird man nämlich besser nicht wenn man mit gleich-starken spielt bzw. gegen sie spielt..","replies":[{"poster":"NDS Ninjarjar","date":"2020-02-03T19:15:27.737+0000","up_votes":1,"down_votes":2,"body":"Mastery-Stufen unter 6 sagen absolut nichts darüber aus, ob man einen Champion kann oder nicht, da diese einfach nur Spielzeit und keinen Skill erfordern. Die Stufen 6 und 7 kann mit ausreichend Spielen ebenfalls jeder Iron 4 Dude erspielen, da jeder zwischendurch mal ein Lucky Game hat und nen S bekommt. Bei fehlendem Können dauert es nur entsprechend länger.\n\nMir geht es nicht darum selbst auf der Lane gegen einen Dia-Spieler zu spielen. Dies kann durchaus hilfreich sein.\nAls Jungle-Anfänger durchgehend vom gefeedeten Dia-Talon-Midlaner invaded zu werden hilft einem nur dabei zu tilten und den Spaß am junglen zu verlieren.","replies":[{"poster":"Chaquzo","date":"2020-02-05T18:14:55.242+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gnitch,realm=EUW,application-id=Wj1wcocU,discussion-id=3ati8Nrf,comment-id=000700020000,timestamp=2020-02-03T19:15:27.737+0000)\n>\n> Mastery-Stufen unter 6 sagen absolut nichts darüber aus, ob man einen Champion kann oder nicht, da diese einfach nur Spielzeit und keinen Skill erfordern. Die Stufen 6 und 7 kann mit ausreichend Spielen ebenfalls jeder Iron 4 Dude erspielen, da jeder zwischendurch mal ein Lucky Game hat und nen S bekommt. Bei fehlendem Können dauert es nur entsprechend länger.\n> \n> Mir geht es nicht darum selbst auf der Lane gegen einen Dia-Spieler zu spielen. Dies kann durchaus hilfreich sein.\n> Als Jungle-Anfänger durchgehend vom gefeedeten Dia-Talon-Midlaner invaded zu werden hilft einem nur dabei zu tilten und den Spaß am junglen zu verlieren.\n\nwas redest du... klar ist es in iron leichter auf m7 zu kommen, aber dennoch kann ich behaupten und da kannst du sagen was du willst, dass je höher die m ist, desto mehr erfahrung hat er mit dem champion gemacht. hat doch nichts mit mastery 6 oder 7 zu tun, aber man sollte nicht nach fünf spielen mit einem champion ins ranked rein..","replies":[]}]}]},{"poster":"FlixusPetronus","date":"2020-01-31T19:27:43.435+0000","up_votes":1,"down_votes":0,"body":"> 2. Spiel weniger Champions.\n\nWas genau verstehst du unter weniger Champions? Aktuell spiele ich ca. 15 verschiedene in 100 Games, hauptsächlich aber Master Yi, Warwick und Jarvan, da die sehr einfach zu spielen sind.","replies":[{"poster":"NDS Ninjarjar","date":"2020-02-01T12:07:31.687+0000","up_votes":1,"down_votes":0,"body":"Hatte mir nur die letzten paar Games angeschaut. Da hast du in 10 Jungle-Spielen 7 verschiedene Champions gespielt, was mir schon relativ viel erscheint...\n\nIm Jungle kann man meiner Meinung nach sehr viel vom allgemeinen Spielverständnis profitieren. Im Optimalfall kann man erahnen was der gegnerische Jungler gerade macht und dies mit entsprechenden Gegenmaßnahmen countern. Dieses Spielverständnis erhält man am schnellsten, wenn man immer den gleichen Champion spielt und sich somit nicht mehr auf die Championmechanics konzentrieren und den Gameplan anpassen muss.\n\nAuch wenn Yi und Warwick prinzipiell sehr einfach sind, unterscheidet sich ihr Spielstil schon ziemlich stark, da sie in verschiedenen Spielphasen stark sind. Wenn man diese Champs nun abwechselnd spielt, muss man sich jedes Game wieder umgewöhnen, was natürlich wieder das Erlernen des allgemeinen Spielverständnisses verzögert. Daher der Vorschlag erstmal nur einen Champion zu spielen um die Rolle des Junglers besser zu verstehen.","replies":[]}]},{"poster":"FlixusPetronus","date":"2020-01-31T19:29:04.035+0000","up_votes":1,"down_votes":0,"body":"> 3. Ich persönlich finde es als Jungle-Main ziemlich gut zwischendurch auch mal auf einer Lane zu spielen. \n\nAlso ich spiele immer die Free-to-play Champs durch (entweder Botgame oder Blindpick) und sammle so neue Erfahrungen..\nOder ist das der falsche Weg?\n\nIch weiß es nicht :(","replies":[]}]},{"poster":"TakeMyChillPill","date":"2020-02-04T11:16:26.583+0000","up_votes":1,"down_votes":0,"body":"Also ich würde dir abraten ranked zu spielen aus folgenden gründen du wirst härter geflamt und du zerstört deine mmr \n\nmein tipp such dir leute die das spiel schon länger spielen spiele oft normals mit ihnen und lern erstmal mehr über das spiel etc und wenn du dann 2-4  champs wirklich gut beherscht fange an ranked zu spielen aber vorher bist du einfach noch nicht bereit fürs ranked \n\nauch wenn rito das so in der werbung darstellen will wie (ezy)  und einsteiger freundlich das spiel ist xd","replies":[]},{"poster":"Phoenixale","date":"2020-02-03T23:07:52.941+0000","up_votes":1,"down_votes":0,"body":"Spiele nie nach nutzlosen Youtube Builds, oder Builds, die dir auf diversen Seiten vorgeschlagen werden. Du kannst dich daran orientieren, solltest aber auch das Gegnerische Team im Auge behalten. Kaufe die für dich passenden Items, die eventuell alle, oder die meisten Gegner countern würden (entweder den Champion selbst, oder die Items). Hast du beispielsweise eine Vayne und einen Zed als Gegner, so ist es ratsam als zweites oder Drittes Item \"Randuins Omen {{item:3143}} \" zu bauen. ;)\n\nDiese Youtube Builds kannst du kaufen wenn du mal von Anfang an ein sehr gutes Spiel hast - solltest aber beachten, dass selbst wenn du beispielsweise 5/1 stehst, du immer noch locker ein one on one verlieren kannst. Da ist auch der Tod mit einem Jump ins gegnerische Team vorprogrammiert.\n\nUnd der beste Tipp: Beobachte stets sie Minimap. Diese ist nämlich am Wichtigsten. So behältst du den Überblick und kannst die Positionen der Gegner und deren Vorhaben meistens ziemlich genau vorausberechnen! ;)","replies":[]},{"poster":"Eroticat Nimar","date":"2020-01-29T17:03:01.616+0000","up_votes":1,"down_votes":0,"body":"Du schaust dir jetzt einen witzigen Youtuber an und versuchst die Gülle nachzuspielen die vorgemacht wird.\n\nRIP solwolf","replies":[{"poster":"FlixusPetronus","date":"2020-01-31T19:33:51.877+0000","up_votes":1,"down_votes":0,"body":"Joa, ich schau Maxim und Sola..\n\nMission completed ^^","replies":[{"poster":"NDS Ninjarjar","date":"2020-02-01T12:39:45.464+0000","up_votes":1,"down_votes":0,"body":"Virkayu finde ich für den Jungle ziemlich hilfreich","replies":[]}]}]},{"poster":"Kekzen","date":"2020-01-30T14:49:51.334+0000","up_votes":1,"down_votes":0,"body":"Welche Champions spielst du denn?\nVielleicht solltest du einfachere Champions wählen und dich damit erstmal auf den Jungle &amp; Ganks konzentrieren. Denn wenn du nicht so viel über deinen Champion nachdenken musst, kannst du dich eher auf dein Jungle-Pathing &amp; Ganks fokusieren.\nFreundliche Grüße\nKekzen","replies":[{"poster":"FlixusPetronus","date":"2020-01-31T19:32:55.207+0000","up_votes":1,"down_votes":0,"body":"Hauptsächlich spiele ich {{champion:19}} {{champion:11}} {{champion:59}} \n\n1. Falls sich  ein Counterpick anbietet, auch manchmal{{champion:32}} {{champion:131}} {{champion:36}} {{champion:245}} {{champion:60}} {{champion:9}} {{champion:104}} {{champion:24}} {{champion:203}} {{champion:20}} {{champion:33}} {{champion:72}} {{champion:77}}","replies":[{"poster":"Zavolta","date":"2020-01-31T21:36:24.269+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlixusPetronus,realm=EUW,application-id=Wj1wcocU,discussion-id=3ati8Nrf,comment-id=00050000,timestamp=2020-01-31T19:32:55.207+0000)\n>\n> Hauptsächlich spiele ich {{champion:19}} {{champion:11}} {{champion:59}} \n> \n> 1. Falls sich  ein Counterpick anbietet, auch manchmal{{champion:32}} {{champion:131}} {{champion:36}} {{champion:245}} {{champion:60}} {{champion:9}} {{champion:104}} {{champion:24}} {{champion:203}} {{champion:20}} {{champion:33}} {{champion:72}} {{champion:77}}\n\nAlle sagen zwar, dass Yi und WW einfach wären (\"noob champs\"), aber mir liegen die gar nicht, egal was alle sagen. Gleiches mit Ekko, Lee, Jax, Udyr, Rengar, Darius, GP, etc.\n\nEgal wie oft ich die auch \"übe\", Anleitungen lese, in Spielen gegen diese Helden sehe, wie stark die sein können... die sind einfach nix für mich.\n\nWenn du denkst, du stirbst zu oft oder so... probier doch mal Helden, die dich von weiter weg kämpfen lassen... ich meine nicht ADs, die sind ja trotz allem recht nah, auf Auto-angriffs-Entfernung... Magier... die mit ihren Fähigkeiten farmen... und dabei schön weit weg bleiben können... Malzahar mit seinem E und den Leerlingen... Morgana mit ihrem W... dazu noch das Shield als Schutz und den \"Snare\"... Cassiopaia mit ihrem Gift ebenso.... oder Nasus auf AP...","replies":[{"poster":"FlixusPetronus","date":"2020-02-01T04:42:18.498+0000","up_votes":1,"down_votes":0,"body":"> Alle sagen zwar, dass Yi und WW einfach wären (\"noob champs\"), aber mir liegen die gar nicht, egal was alle sagen. Gleiches mit Ekko, Lee, Jax, Udyr, Rengar, Darius, GP, etc.\n\nTrifft auf mich eher nicht zu. Vor allem mit Yi oder Warwick gibt es auch solche Runden https://matchhistory.euw.leagueoflegends.com/en/#match-details/EUW1/4302992919/2295580333396160?tab=overview","replies":[{"poster":"Zavolta","date":"2020-02-01T06:53:37.746+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlixusPetronus,realm=EUW,application-id=Wj1wcocU,discussion-id=3ati8Nrf,comment-id=0005000000000000,timestamp=2020-02-01T04:42:18.498+0000)\n>\n> Trifft auf mich eher nicht zu. Vor allem mit Yi oder Warwick gibt es auch solche Runden https://matchhistory.euw.leagueoflegends.com/en/#match-details/EUW1/4302992919/2295580333396160?tab=overview\n\nSorry... solche Stats in einem regulären Spiel sind unmöglich :)","replies":[{"poster":"FlixusPetronus","date":"2020-02-01T07:47:41.064+0000","up_votes":1,"down_votes":0,"body":"> Sorry... solche Stats in einem regulären Spiel sind unmöglich :)\n\nDas Game hatte ich wirklich..^^\n","replies":[]}]}]}]}]}]},{"poster":"Gengchen","date":"2020-01-30T10:15:38.604+0000","up_votes":1,"down_votes":0,"body":"Spiel Rangliste, da wirst du früher oder später mit Leuten gematched die dein Skill haben und du lernst dort mehr. Außerdem ist es besser wenn du wenige Champs spielst, die dann aber gut beherrschst. \nViel Glück\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"FlixusPetronus","date":"2020-01-31T19:33:23.349+0000","up_votes":1,"down_votes":0,"body":"hm, okay{{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"Icebergslasher","date":"2020-01-30T22:36:10.983+0000","up_votes":1,"down_votes":0,"body":"1. mach dich selbst nicht runter. wir sind alle auf eine art schlecht im spiel.\n\n2. spiele solche champs die wenig skill brauchen und die in der meta hoch sind.  ich finde zb sejuani oder volibear sehr einfach und safe pics. \n\n3. die richtigen runen items und skillorder immer brav nachschauen vorm spiel, das machts sehr viel einfacher.\n\ndu schaffst das schon","replies":[{"poster":"FlixusPetronus","date":"2020-01-31T19:30:12.897+0000","up_votes":1,"down_votes":0,"body":"Danke &lt;3{{sticker:katarina-love}}","replies":[]}]}]}