{"poster":"AgentOO8","date":"2016-11-28T03:58:56.702+0000","title":"Please Rectify","subforum":"[ARCHIVED] Help & Support","embed":{"description":"The easy way to save screenshots, GIFs, and websites. Make everyone happy by sharing smarter, faster, and with your point crystal clear.","url":"https://gyazo.com/b001fa35562338edcb2267d0c23e9c17","image":"https://i.gyazo.com/thumb/1200/_cdbfae5b39c8554b9a0ee5822e67d334-png.jpg"},"up_votes":1,"down_votes":0,"body":"League's new client continuously crashing is costing me 30 minute wait times and now negative lp.... this is getting annoying. Even the legacy client is crashing. I never Queue dodge and now I'm having to wait 30 minutes for something that's not my fault? Please fix this..\n\nAnd I wouldn't recommend telling me to switch clients. It's you who encourages players to try your new client. It would solve nothing and would definitely cause a scene in the boards.\n\nhttps://gyazo.com/d226ad9c139f7ed79d36a2aac90da90f","replies":[{"poster":"Targons Blade","date":"2016-11-29T04:21:45.961+0000","up_votes":1,"down_votes":0,"body":"Can you let me know where these crashes are occurring and what behavior/error messages you see when it happens? I'll need a bit more information to understand what's going on and how to fix it.","replies":[{"poster":"AgentOO8","date":"2016-11-30T18:45:33.183+0000","up_votes":1,"down_votes":0,"body":"When the game switches into champion select, the game then gives the \"Not responding\" message and then never actually connects to the room. It forces you to close the client, ending in an unwanted dodge.\n\n\nAt this point I'm already up almost an entire division so I'm less apt to really care that it happened. The NaCl in my statement has passed and it's merely reporting it. But if you decide to reimburse my elo I won't say no lol.","replies":[{"poster":"Targons Blade","date":"2016-11-30T23:57:26.177+0000","up_votes":1,"down_votes":0,"body":"Well, I can't reimburse your Elo (actually not possible) but I appreciate you letting me know what's going on. This is a pretty common issue if your connection to the servers is pretty unstable. Our [connection guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) includes steps that usually resolve these sorts of issues, so I'd strongly recommend giving them a go.\n\nLet me know if this helped.","replies":[]}]}]},{"poster":"Im that DUCK","date":"2016-11-28T05:25:35.075+0000","up_votes":1,"down_votes":0,"body":"The new client is in beta, you can't blame them for bugs. Switch to the legacy client if you don't want to POTENTIALLY deal with bugs. The point of the beta client is to FIND these bugs and report them, and to test it out. Not for it to be a completely functional masterpiece.","replies":[{"poster":"AgentOO8","date":"2016-11-28T07:15:43.734+0000","up_votes":1,"down_votes":0,"body":"Again telling me to switch clients when people are complaining about both clients crashing recently since the update is pointless.","replies":[]}]},{"poster":"AgentOO8","date":"2016-11-28T04:32:34.875+0000","up_votes":1,"down_votes":0,"body":"Oh I'm definitely bumping this fam.","replies":[]}]}