{"poster":"ZzVollstreckerzZ","date":"2018-01-10T08:06:21.308+0000","title":"Spielannahmeproblem","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Werter Support!\r\n\r\nMir ist aufgefallen dass wenn ich ein Spiel über die Gegnersuche suche, der automatische Sucher auch eines findet, dass es zeitweise mit dem Annehmen Button Schwierigkeiten gibt. Ich klickte auf \"Annehmen\" dann darf ich recht lange warten und dann steht dass ich den Bereitschaftsdienst abgelehnt hätte. \r\n\r\nNun wollte ich mich erkundigen ob dies irgendwelche Konsequenzen wie Leaver Booster Strafe oder Ähnliches für mich hat, oder ob dies einfach nur ein Spielfehler ist. Wenn dies ein Spielfehler ist und ich dafür nicht bestraft werde bin ich beruhigt. Es wäre dennoch schön wenn dies behoben werden könnte. \r\n\r\nLiebe Grüße\r\n\r\nZzVollstreckerzZ","replies":[{"poster":"DrYatty","date":"2018-01-10T08:50:04.610+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nhast du das Problem seit dem heutigen Patch oder ist dies schon vorher öfter aufgetreten? Zu deiner Frage ob du Strafen bekommst ist die Antwort: Ja, du wirst Strafen bekommen wenn du zu oft den Bereitsschaftscheck nicht bestehst. \n\n> ##BEREIT-ABFRAGE UND RANGLISTENSPIELE\nWenn das Matchmaking-System passende Gegenspieler findet, wird eine „Bereit-Abfrage“ durchgeführt. Es erscheint ein „Match gefunden“-Fenster, um zu bestätigen, dass du bereit bist zu spielen. Um Missbrauch zu vermeiden, wird eine Strafe verhängt, wenn die Bereit-Abfrage zu oft nicht beantwortet wurde. Dies führt dann zu einer vorübergehenden Sperre und dem Verlust von LP, wenn du in einer Ranglisten-Warteschlange spielst. Die genauen Strafen sind unten aufgelistet:\n>\n* Das zu häufige Ablehnen oder Unbeantwortetlassen einer Bereit-Abfrage in einer Ranglisten-Warteschlange führt zu einer 6-minütigen Sperre für alle Warteschlangen und dem Verlust von 3 LP.\n* Die Strafe wird auf 10 LP erhöht, wenn Bereit-Abfragen weiterhin nicht beantwortet werden.\n* Jedes darauffolgende Versäumnis erhöht die Dauer der Warteschlangensperre und zieht eine Strafe von 10 LP nach sich.\n>\n######Hinweis: Strafen im Zusammenhang mit Bereit-Abfragen aus jeder Warteschlange haben auf das gesamte Konto Auswirkungen. Alle Strafen aus normalen Warteschlangen weiten sich auf Ranglisten-Warteschlangen aus und können in härtere Strafen münden.\n\nMehr Informationen findest du hier -> https://support.riotgames.com/hc/de/articles/201751844","replies":[{"poster":"ZzVollstreckerzZ","date":"2018-01-13T08:11:15.092+0000","up_votes":1,"down_votes":0,"body":"Ei Ei Ei Ei Ei, Lesen sollte man schon wenn man was kommentiert.\n\nAlso noch einmal:\n\nIch drücke auf ANNEHMEN und ab und zu, nicht oft aber dennoch ab und zu, steht dann trotzdem da, ich hätte den Bereitschaftsdienst abgelehnt. Und dafür werde ich also bestraft? Das Spiel hat ne Macke und ich darfs ausbaden sozusagen, hab ich das jetzt richtig verstanden? Denn genau darum gehts in meinem Kommentar.\n\nDass wenn ich mutwillig/absichtlich ablehne ne Strafe krieg ist mir klar, bin ja nicht in der Nudelsuppe aufgewacht, aber dass ich auch bestraft werde wenn es seitens Riot einen Spielfehler gibt, auch bestraft werde, Leuz bisschen eingebildet seit ihr schon oder? Was kann ich dafür wenn ihr nicht in der Lage seit, es richtig zu machen?","replies":[{"poster":"DrYatty","date":"2018-01-13T09:21:58.079+0000","up_votes":1,"down_votes":0,"body":"Deinen Beitrag habe ich gelesen sonst hätte ich bestimmt nicht geantwortet. \n\nWenn du auf \"Annehmen\" klickst und du trotzdem aus der Warteschlange fliegst hat der Client wohl nicht registriert das du \"Annehmen\" gedrückt hast. Sowas kann vorkommen und dafür gibt es unten rechts im Client einen kleinen Button \"Einen Fehler melden\", aber um deine Frage nochmal direkt zu beantworten: Ja, du wirst dafür bestraft, aber nur wenn du öfter hintereinander den Bereitschaftscheck nicht bestehst nicht wenn es dir einmal jeden Tag passiert. Ich rate dir nachdem du nicht annehmen konntest einfach den Client neuzustarten. \n\n> bin ja nicht in der Nudelsuppe aufgewacht, aber dass ich auch bestraft werde wenn es seitens Riot einen Spielfehler gibt, auch bestraft werde, Leuz bisschen eingebildet seit ihr schon oder?\n\nNunja der Fehler ist das der Client nicht registriert das du auf Annehmen gedrückt hast und das System zum Bestrafen läuft auch komplett automatisch, wie also soll der Client es herausfinden das du einen Fehler hast/hattest? Wenn es dir 2/3 mal passiert das du nicht annehmen konntest bist du selbst Schuld wenn du es weiter versucht ohne deinen Client neuzustarten. Ja es ist ein Fehler seitens Riot melde den Fehler und es wird sich drum gekümmert. \n\n> Was kann ich dafür wenn ihr nicht in der Lage seit, es richtig zu machen? \n\nIch bin ein Volunteer und kein Riotler. Die Volunteers sind eine Gruppe von Spielern, die auf freiwilliger Basis und in Zusammenarbeit mit Riot die LoL-Community unterstützen, wo es nur geht. Mehr dazu findest du hier -> https://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/N6PuqreE-die-volunteers-rekrutieren","replies":[{"poster":"Hodiefar","date":"2019-08-13T16:14:30.682+0000","up_votes":1,"down_votes":0,"body":"Das Problem kenne ich so ähnlich auch. Nur mit dem Unterschied, dass das Fenster zum annehmen nur eine Sekunde offen ist und die Anfrage automatisch abgelehnt wird. Wie das passieren kann versteh ich nicht. Jeden Tag passiert das ca 8 mal bzw jede 3.-4. anfrage. Client Reparatur usw hab ich alles schon probiert. Auch neustarten bringt da nix. Passiert auch teilweise, dass ich bei der Championwahl rausfliege obwohl ich den Champion schon ausgewählt habe. Kommt auch vor, wenn der Gegner in dem Moment den Champion auswählt und der Timer oben abläuft. Dann kommt ne Meldung ich hätte die Championwahl verlassen obwohl ich das nicht habe. Das ist echt nervig, weil ich deswegen eine Sperre bekam für Spiele suchen. Wäre ja echt toll, wenn das Problem behoben werde könnte seitens Riot, Dess das Problem hat definitiv mit dem Spiel bzw. evtl den Servern zu tun.","replies":[{"poster":"Pedro Shuffle","date":"2020-02-02T08:09:29.101+0000","up_votes":1,"down_votes":0,"body":"Ich habe Aktuell das Selbe Problem , Entweder lehnt er Automatisch ab oder ich kann annehmen , was aber ewig im Annehmen Fenster bleibt , als wenn jemand nicht annimmt. Bis es dang abbricht und da steht das ich nicht angenommen habe. Hilfe Bitte.\nHabe schon neu Installiert und auch Das Hextech repair Tool benutzt .,","replies":[]}]}]}]}]},{"poster":"Scotlandman","date":"2018-06-05T18:14:23.162+0000","up_votes":1,"down_votes":0,"body":"Ich hatte das jetzt schon öfters und es geht mir langsam ziemlich auf die Nerven. Manchmal gehts und manchmal nicht. \nIch klicke auf annehmen und dann warte ich, des wird dann auch angenommen, es dauert dann ein wenig und mir wird angezeigt das ich die Bereitschaftsanfrage abgelehnt haben soll. Ich komme halt nicht wieder in die Warteschlange und kann auch nichts annehmen.\nIch will nicht irgendwann ne Sperre bekommen weil das nicht geht. \nEs liegt an euch nicht bei mir . Internet ist immer da und 50 K Leitung ist auch nahezu vorhanden. ist erst seit nen paar Patches aufgetreten. \nEs dreht sich auch alles dieser blaue Kreis halt solange wie er normalerweise dreht wenn alle angenommen haben und man dann in die Auswahl kommen würde.\nAber da dreht sich der blaue Kreis solange bis die Anzeige kommt das man nicht angenommen hat .\n\nWürde mich über eine Antwort freuen","replies":[]},{"poster":"blackmamba89","date":"2018-03-31T08:31:19.143+0000","up_votes":1,"down_votes":0,"body":"Hallo \n \nIch habe seit gestern dasselbe Problem, immer versuche ich auf annehmen zu klicken dann kommt eine Fehlermeldung während der Bereitschaftsabfrage ist ein Fehler aufgetreten, bekomme dann Zeitstrafen usw, das nerft echt...\n\nLG  blackmamba89","replies":[]}]}