{"poster":"CharlieLOQ","date":"2020-02-03T15:07:16.596+0000","title":"Idea para una Runa nueva de Inspiraci칩n","subforum":"Jugabilidad, balance y narrativa","up_votes":11,"down_votes":2,"body":"Me gustar칤a la idea de una Runa para Soportes 100% de dedicada a ellos.\nEsta solo servir칤a si en el carril hay 2 campeones (en pocas palabras la Bot lane)\n{{sticker:sg-miss-fortune}} \nTratar칤a de una Runa principal de la Rama de inspiraci칩n, se llamar칤a \"Mochila del Escudero\" y que trate de un aumento de 2 slots extras en el inventario de los items para campeones pero estos solo podr칤an usarse para llevar pociones y wards {{item:2055}} {{item:2139}} {{item:2140}} {{item:2138}} {{item:2031}} {{item:2033}} {{item:2003}}  y que se tenga la posibilidad de poder compartir un uso para un aliado cercano (osea gastar la poci칩n normalmente pero que el aliado reciba el beneficio) y poder cederle Wards tambi칠n.\n{{sticker:slayer-jinx-wink}} \n\nPROS:\n-Le dar칤a una nueva relevancia a las pociones re utilizables. {{item:2033}} {{item:2031}} \n-Ayudar칤a a evitar ganks a otras lineas cedi칠ndoles wards. {{item:2055}} \n-Evitar칤a la necesidad de volver a base cuando se acabe el efecto de las pociones de mejoras {{item:2139}} {{item:2140}} {{item:2138}} , una ventaja para el Team de evitar perder tiempo en vueltas a base. \n-Una opci칩n interesante para esos campeones Supp sin curaci칩n {{champion:53}} {{champion:201}} {{champion:89}} ,etc.\n-Buena sinergia con la runa Mercado del futuro y Fuente de Vida. \n-Poder llevar Wards y/o pociones incluso estando full build el Supp.\n-Facilitar el armado de items, ya que los wards ni pociones ocuparan espacio en tu inventario de items.\n\nCONTRAS: \n-Un mal uso de la runa puede retrasar tu armado de build.\n-El campe칩n que la utilice tendr치 que ganar mas oro para cubrir los gastos extras de esta runa.\n-Los Wards cedidos pueden ser mal utilizados por los compa침eros.{{champion:157}} \n-Runa restringida para campeones que tengan solo un compa침ero en linea para usarla al m치ximo.\n-La runa no tendr칤a un impacto directo como el de otras, sino uno m치s pasivo.\n \nMi humilde opini칩n. {{champion:24}} \n\nBesos, abrazos y KS`s, atentamente un Main Supp &lt;3 .\n{{sticker:sg-janna}}\n\nEDIT:\n\nAdmito que me entretiene mucho escribir estas ideas, as칤 que esta sera la parte 1 de 5 sobre ideas de Runas, har칠 1 por cada rama de Runas que hay ( Inspiraci칩n, Valor, Precisi칩n, Dominaci칩n y Brujer칤a).\nDejare los Links al final de cada post (cuando publique las otras partes que faltan) as칤 puedan visitar todas mis ideas de Runas.\n{{sticker:slayer-pantheon-popcorn}} \n\nLista de mis ideas de runas nuevas:\nhttps://boards.las.leagueoflegends.com/es/c/creaciones-de-la-comunidad/9WvcdJ0e-lista-de-ideas-para-nuevas-runas\n\nNos vemos prontamente {{summoner:12}} ","replies":[{"poster":"TheKiller Justin","date":"2020-02-03T16:51:07.714+0000","up_votes":4,"down_votes":0,"body":"Me parece muy interesante la parte del ward, m치s de una vez me encuentro con el inventario lleno y la necesidad de comprar un {{item:2055}}","replies":[{"poster":"CharlieLOQ","date":"2020-02-03T17:30:28.934+0000","up_votes":3,"down_votes":0,"body":"Entiendo tu dolor {{item:3070}} , me pasa lo mismo estando en Late y no poder vender nada para el Ward {{item:2055}}","replies":[]}]},{"poster":"Oblivion awaits","date":"2020-02-03T15:20:07.330+0000","up_votes":4,"down_votes":0,"body":"Es una buena idea, aunque esto permitiria un sustain muy basto al ADC. Quiz치 estaria bueno si las pociones est칠n \"nerfeadas\", y con respecto al otro slot (el de los wards) estaria bien. Me gust칩 y no se me habia ocurrido.","replies":[{"poster":"CharlieLOQ","date":"2020-02-03T15:29:01.932+0000","up_votes":2,"down_votes":0,"body":"La efectividad de la Poci칩n sea del 50%.\n쯈ue tal esa condici칩n?.\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"chanchapepo","date":"2020-02-04T03:52:20.399+0000","up_votes":3,"down_votes":0,"body":"si llegasen a meter ese tipo de runa pyke se va a comer un nerf super enfermo en la R xD","replies":[{"poster":"CharlieLOQ","date":"2020-02-04T10:08:15.126+0000","up_votes":1,"down_votes":0,"body":"Obvio. {{champion:119}} \n{{sticker:sg-lulu}}","replies":[]}]},{"poster":"Pancakeswx0","date":"2020-02-04T00:37:17.961+0000","up_votes":3,"down_votes":0,"body":"Si esto se hace, ir 2 en Top ya no seria ilegal xD","replies":[{"poster":"doomguy2003","date":"2020-02-04T03:43:10.131+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Pancakeswx0,realm=LAS,application-id=xQmJPO8F,discussion-id=ZBb0dAzA,comment-id=0004,timestamp=2020-02-04T00:37:17.961+0000)\n>\n> Si esto se hace, ir 2 en Top ya no seria ilegal xD\n\nOjal치 amigo, me encantar칤a que lol se convierta en un Dota2, en el que ir 3 top, 2 jg, etc pueda ser viable","replies":[]},{"poster":"CharlieLOQ","date":"2020-02-04T01:47:37.816+0000","up_votes":1,"down_votes":0,"body":"Ya no seria ilegal pero sin Jg, el otro Junglero haria un Snowball brutal por tema de poder sacar objetivos (Dragon, Heraldo y Baron) lograr robarlos facilmente y tener el poder de presionar las 2 lineas de Mid y Bot...\n{{sticker:sg-zephyr}} \nGanan la partida por destruir todo Top o el Jg enemigo les gana por destruir todo Mid y Bot xD\n{{sticker:sg-syndra}} \nLo tengo todo Lissandramente calculado\n{{champion:127}} \nSuerte es tus partidas 游","replies":[{"poster":"Yanx99","date":"2020-02-04T03:15:16.723+0000","up_votes":2,"down_votes":0,"body":"Creo que no estuviste en el meta de Kayle y Yi top \n{{sticker:sg-lulu}}","replies":[{"poster":"CharlieLOQ","date":"2020-02-04T10:03:01.482+0000","up_votes":1,"down_votes":0,"body":"Yo llegue cuando Camille salio como nuevo campe칩n.\n{{sticker:zombie-nunu-bummed}} {{sticker:sg-ezreal}}","replies":[]}]}]}]},{"poster":"DragonFelgrand8","date":"2020-02-03T17:48:16.302+0000","up_votes":3,"down_votes":0,"body":"Como main supp, NECESITO esa runa, seria genial tener otro slot para los pinks en late.","replies":[{"poster":"CharlieLOQ","date":"2020-02-03T17:55:57.847+0000","up_votes":2,"down_votes":0,"body":"Tu si que entiendes la necesidad de los Main supp de Pinks en el late game.  \n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"BlackXCroma","date":"2020-02-08T07:22:48.322+0000","up_votes":2,"down_votes":0,"body":"Yo creo que con un slot basta, 2 seria demasiado, mas haya de que solo se puedan comprar pociones, con un slot estaria genial, ya tenes demasiados wards con tu item de supp, y si queres podes utilizar el slot para comprarte wards","replies":[{"poster":"CharlieLOQ","date":"2020-02-11T10:59:33.149+0000","up_votes":1,"down_votes":0,"body":"El por el tema que los objetos de supp son baratos pero suelen tener muchas piezas para armarlos y mas los wards\nHace que aveces tengas que no comprarte ese Amuleto de las hadas{{item:1004}} por llevar wards verdaderos o pociones.\nY que en el late puedas llevar pociones y wards sin tener que sacrificar 2 espacios que puedan llevar items.\n{{sticker:sg-ezreal}}","replies":[]}]},{"poster":"dnt tch my akali","date":"2020-02-04T02:23:26.752+0000","up_votes":2,"down_votes":0,"body":"Este post es tipico de un main soporte, ya cuando lei el primer parrafo me di cuenta.","replies":[{"poster":"CharlieLOQ","date":"2020-02-04T10:06:22.335+0000","up_votes":1,"down_votes":0,"body":"Siempre Supp nunca insupp xd\n{{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"LaBananaDeLimon","date":"2020-02-03T19:05:51.745+0000","up_votes":2,"down_votes":0,"body":"y que te parece que convierta los wards gratis en centinelas de vision rojos? buajajaja  {{champion:7}}","replies":[{"poster":"CharlieLOQ","date":"2020-02-03T19:48:58.664+0000","up_votes":1,"down_votes":0,"body":"Es muy buena esa idea, pero deberia tener alguna contra-parte, como por ejemplo: Sacrificar 2 wards normales del item supp, para crear uno de Visi칩n Verdadera. {{summoner:13}} \n쯈ue tal la idea?.","replies":[]}]}]}