{"poster":"Lauricella3","date":"2014-12-10T11:00:03.782+0000","title":"new jungle (balancing clearing with ganking)","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"I am having a bit of trouble with the new jungle, I often jungle {{champion:28}}  {{champion:106}}  and {{champion:64}}  and after 4 camps i can't even gank, if i try to go chickens camp after my 4th camp they always 4v1 me (op chickens) and I get executed. anyway on a serious note. is anyone else finding it difficult to do early clears and a gank?\r\n\r\nalso I like the new jungle despite my doubts but im finding alot of the extra gold they put into the jungle end up just going towards more health pots. anyway I hope they reduce the price of hunters machete for another health pot and add some armor or %max hp damage to the juggernaut enchantment. RIP in peace {{item:3207}}","replies":[{"poster":"hillbill1e","date":"2014-12-10T18:28:07.622+0000","up_votes":2,"down_votes":0,"body":"try using junglers with sustain. if you wanna use champions like {{champion:33}} be prepared to not take a 3rd camp before you b. however if you use champions with sustain that can keep themselves going early like {{champion:19}} {{champion:77}} , and {{champion:107}} , well, who needs items anyway?","replies":[{"poster":"Lauricella3","date":"2014-12-10T22:39:05.534+0000","up_votes":1,"down_votes":0,"body":"yeah it seems that junglers that we're bad at clearing and not getting picked are getting left behind with the new jungle :/","replies":[{"poster":"Zaps","date":"2014-12-11T05:57:06.803+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lauricella3,realm=OCE,application-id=FjGAIbRv,discussion-id=EYR8638n,comment-id=00010000,timestamp=2014-12-10T22:39:05.534+0000)\n> yeah it seems that junglers that we're bad at clearing and not getting picked are getting left behind with the new jungle :/\n\nMy personal opinion, I think it's just more that the different jungle styles will have different patterns of play, rather than most junglers following the same timing / location attacks in previous seasons. Some champions are going to be more effective at very early ganks, and this is accentuated by Jungle Item (e.g. Ranger's Trailblazer is choosing to farm up vs Skirmisher/Stalker who want to gank/countergank).\n\nBasically, it's more of a choice to pick a champion to gank early and trade something else for it, rather than every champion having early gankability at different levels.","replies":[]},{"poster":"RNG Remilia","date":"2014-12-10T23:28:38.271+0000","up_votes":1,"down_votes":0,"body":"If you aren't already I suggest buying Ranger's Trailblazer on every jungler because it seems really meta ATM from the sustain and clear speed it provides but I think it may get nerfed in future.","replies":[]}]}]},{"poster":"ElysiumManifests","date":"2014-12-13T00:34:05.672+0000","up_votes":1,"down_votes":0,"body":"Yeah am seeing a lot of emphasis on champs such as Udyr, Warwick, FIdd and Vi..... All other junglers seem second par to these four on my opinion.","replies":[]},{"poster":"TheTourist","date":"2014-12-12T07:23:16.245+0000","up_votes":1,"down_votes":0,"body":"I think it's people's ability to adapt to change really. Yea sustain junglers excel this change but that doesn't mean other junglers won't work. \n\nBlue side start: Start gromp with top lane leash smite it early get the poison buff. Hp pot Fight blue then proceed to red. Smite will be up, smite red for instant health. Now you should be in position use last hp pot to finish the other camps. Maybe depending on the champ. \n\nRed side start: Start the Brolems with a leash. Smite early for the stun buff. Hp pot to red. Finish red head over to blue. Unload on blue smite it if you need mana to finish it off. You may be able to do one more camp afterwards. \n\nFollowing this you could do jungle with most of the junglers. After your first backing you should be able to buy your machete upgrade and some more pots or a ward.","replies":[{"poster":"Lauricella3","date":"2014-12-12T12:07:15.594+0000","up_votes":1,"down_votes":0,"body":"actually with non sustain junglers, i tend to buy a {{item:1029}}  and some pots instead so that i can build tabi later, because especially with {{champion:28}} who is one of the squishiest junglers in the game, it really buffs my second clear more than the mahete upgrade. but yeah sustain jungler, typically the feral flare junglers are too good in this new jungle.","replies":[]}]},{"poster":"Faelaren","date":"2014-12-10T13:39:57.787+0000","up_votes":1,"down_votes":0,"body":"I think one of the things Riot was trying to target was the early ganks because they don't want it deciding the lane. I don't recall where I heard that but I do remember something about it.","replies":[]}]}