{"poster":"GrandeLeone98","date":"2017-05-05T01:19:33.813+0000","title":"Salto di Divisione","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Buongiorno, in questi giorni ho ripreso in mano le Ranked dal mio Accaunt Smurf (Che &egrave; questo che sto usando per scrivervi) che avevo lasciato in Bronzo5 con l&#039;intento di scalare, ora mi chiedo... Ma esiste ancora la possibbilit&agrave; di saltare le divisioni con un buon Elo?\r\n\r\nVi chiedo perche sono a 20 Vittorie di FILA con un Elo (Secondo OP.GG --&gt; https://euw.op.gg/summoner/userName=GrandeLeone98 ) da Silver medio-basso, ma nonostante questo da Bronzo 5 all&#039;attuale Bronzo 2 non ho mai saltato nulla...\r\n\r\nPer carita, &egrave; uno Smurf non mi importa cosi tanto, mi chiedo solo se esista ancora questa opzione\r\n\r\nCoordiali saluti","replies":[{"poster":"Jeanne dˆArc","date":"2017-05-05T03:25:25.782+0000","up_votes":3,"down_votes":0,"body":"Si, esiste ancora questa possibilità. Essendo però ora in Bronzo 2, non puoi saltare divisioni, in quanto la promo da una lega all'altra è obbligatoria. Se mantieni questa win rate, probabilmente una volta arrivato in Silver, con la prima promo salterai il Silver 4 andando poi direttamente in Silver 3. Per ogni lega, il salto di divisione è possibile una sola volta.","replies":[{"poster":"FuryTheFenix ITA","date":"2017-05-05T21:08:43.154+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chìtoge,realm=EUW,application-id=MJVj50Jw,discussion-id=3Eqrl1j6,comment-id=0000,timestamp=2017-05-05T03:25:25.782+0000)\n>\n> Si, esiste ancora questa possibilità. Essendo però ora in Bronzo 2, non puoi saltare divisioni, in quanto la promo da una lega all&#x27;altra è obbligatoria. Se mantieni questa win rate, probabilmente una volta arrivato in Silver, con la prima promo salterai il Silver 4 andando poi direttamente in Silver 3. Per ogni lega, il salto di divisione è possibile una sola volta.\n\nConfermo, ero Silver V e mi ha fatto passare direttamente al Silver III","replies":[]}]}]}