{"poster":"nuvi","date":"2017-07-19T06:14:19.594+0000","title":"Quería que me sacaran el baneo de 14 dias","subforum":"Problemas Técnicos","up_votes":5,"down_votes":16,"body":"Hola riot, amo el lol y me gusta mucho jugarlo, resulta que me vino un baneo por 14dias por &quot;trollear&quot; en una partida, resulta que esa partida habia un afk, y para divertirnos nos tirabamos asi nomas sin miedo que nos maten, pero todo el team lo hizo, pensamos que es un juego y tenemos derecho a divertirnos, en fin al menos quee bajen a siete dias o me lo saquen, porque estoy cansado de no poder jugar, sin mas que decirles, un abrazo y nos vemos em los campos de justicia !!","replies":[{"poster":"August","date":"2017-07-19T06:56:42.040+0000","up_votes":6,"down_votes":1,"body":"\"Tenemos derecho a divertirnos\" JAJA","replies":[{"poster":"nuvi","date":"2017-07-19T17:17:41.008+0000","up_votes":1,"down_votes":0,"body":"<3","replies":[]}]},{"poster":"ZanahoriaAsesina","date":"2017-07-19T07:42:09.213+0000","up_votes":4,"down_votes":0,"body":"Y en esa partida de 40minutos donde moriste 14 veces con Lee y no farmeaste ni hiciste más daño que el soporte tanque de tu equipo .\n\n¿que pasó ._.?\n\nTal vez eso también tuvo que ver.","replies":[{"poster":"nuvi","date":"2017-07-19T17:15:25.704+0000","up_votes":1,"down_votes":0,"body":"Estuve afk al principio por un bug, después me habían robado toda la jungla y estaban muy fedeados, mas que no se usar bien al lee, si revisas el chat nunca dije que trolleaba ni mada parecido","replies":[]}]},{"poster":"rokushoger","date":"2017-07-19T11:44:12.658+0000","up_votes":3,"down_votes":0,"body":"Te comento que si nadie te reporta, el sistema no te habría baneado, ergo, alguien te reporto en esa partida, y por ende había alguien que no estaba de acuerdo en que hicieras/hicieran eso. Por tanto le jodieron la partida a alguien que sí quería jugar, y el ban es merecido.","replies":[]},{"poster":"stonerock","date":"2017-07-19T07:12:53.219+0000","up_votes":2,"down_votes":0,"body":"Si todo el team lo hizo porque te reportaron entonces? ademas, el baneo de 14 dias viene despues de varias sanciones y vos seguiste con esa actitud, y cuando terminen los 14 dias el sistema se va a poner mas riguroso con tu caso y cualquier cagada que te mandes te banean permanentemente, asique bueno, o te calmas y haces caso, y jugas como se debe sin flamear y trollear, o anda creandote otra cuenta y a arrancar de 0","replies":[{"poster":"nuvi","date":"2017-07-19T17:19:11.990+0000","up_votes":1,"down_votes":0,"body":"A mi no me sancionaron ni me dijeron nada,bde repente me vino ese ban","replies":[]}]},{"poster":"Hwaxinghz","date":"2017-07-19T14:30:51.581+0000","up_votes":1,"down_votes":0,"body":"Creeme que no es divertido ver a alguien, en el team, que se muera 30 veces porque \"se quiere divertir y jugar sin miedo\". Yo juego sin miedo y no por ello voy a suicidarme 20 veces.","replies":[]}]}