{"poster":"eazymakaveli3","date":"2017-04-19T15:29:16.589+0000","title":"Responsibility","subforum":"Player Behavior","up_votes":2,"down_votes":26,"body":"It is YOUR responsibility to not get offended by flamers.\r\n\r\nIt is NOT MY responsibility to protect your fragile, insecure little feelings.\r\n\r\nMaybe one day Riot will realise this and the whole community will be better for it. Instead, Rito decides to grow a community of oversensitive wusses just for the sake of etiquette.","replies":[{"poster":"elduris","date":"2017-04-19T15:34:19.311+0000","up_votes":13,"down_votes":1,"body":"It is YOUR responsibility to manage your attitude and the things you say to others.\n\nIt is NOT YOUR TEAMMATES responsibility to deal with your instability.\n\nMaybe one day you will realize this and the whole community will be better for it. Instead, you decide to push off your own frustrations on your teammates just for the sake of shifting blame.","replies":[{"poster":"eazymakaveli3","date":"2017-04-19T15:59:08.114+0000","up_votes":1,"down_votes":10,"body":"yes it is my teammates responsibility to deal with my instability since they have no choice. How come LoL is the only gaming community that suffers so much from \"toxicity\"? Where saying \"GG EZ\" can get you banned. When you can get banned for flaming, yet there is a mute button. People choose not to use it. People choose to get offended and frustrated by flamers.\n\nRiot makes flamers a problem by promoting being insecure and oversensitive. but oh well, gotta keep dem 10 year old kids buying skins.","replies":[{"poster":"The Djinn","date":"2017-04-19T16:09:51.000+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=eazymakaveli3,realm=NA,application-id=ZGEFLEUQ,discussion-id=ANnN5cGq,comment-id=00010000,timestamp=2017-04-19T15:59:08.114+0000)How come LoL is the only gaming community that suffers so much from &quot;toxicity&quot;? Where saying &quot;GG EZ&quot; can get you banned. \n\nBecause *League* is one of the few that has made it a priority to address toxicity, and that means you're going to find a lot more of it (since you're looking for it) and raise awareness to it.\n\n>When you can get banned for flaming, yet there is a mute button\n\nThink of the Mute Button like a shield -- it can help you avoid an attack, but that doesn't mean the attacker should be allowed to attack you.","replies":[]}]}]},{"poster":"Zezockary","date":"2017-04-19T16:34:04.652+0000","up_votes":6,"down_votes":0,"body":"Ah, you seem to be mistaken. I am not offended by you, or anything you can possibly say. Being offended is stupid in general. I am annoyed by you and don't want to play games with you for an extended period of time.\n\nYou can't hurt my feelings, you don't hold that power over me. You can only get on my nerves, I won't even remember you in a couple of days.","replies":[{"poster":"eazymakaveli3","date":"2017-04-19T16:42:12.951+0000","up_votes":1,"down_votes":6,"body":"lel","replies":[]}]},{"poster":"Colgate Gator","date":"2017-04-19T16:11:38.108+0000","up_votes":6,"down_votes":0,"body":"Is this what stupid sounds like?","replies":[{"poster":"Primaquarius","date":"2017-04-19T17:24:58.191+0000","up_votes":3,"down_votes":0,"body":"Absolutely, and its a horrible sound like claws on a chalkboard","replies":[]}]},{"poster":"EvilDustMan","date":"2017-04-20T08:06:13.552+0000","up_votes":4,"down_votes":0,"body":"See. You are making a mistake here.\n\nNo one is offended by you. They are annoyed. You are not some hero battling the safe space liberals.\n\nYou are a yappy dog. A little yappy dog. People are trying to play and every time they make a mistake you start yapping as loudly as you can. And no one can concentrate or play.\n\nIt's annoying. And Riot removes annoying yappy dogs.","replies":[]},{"poster":"The Djinn","date":"2017-04-19T15:45:53.836+0000","up_votes":3,"down_votes":0,"body":"You are sort of correct that neither is your responsibility -- you do not have to protect someone's feelings, and everyone can benefit from learning to control their emotions better.\n\nHowever, is it not OUR responsibility to protect you from the consequences of your actions, which have been clearly laid out by Riot. It is not OUR responsibility to cater to your inability to behave in a civilized fashion by saying that you're free to say whatever you want without consequence. It is not our responsibility to sit quietly by and listen to every form of abuse you wish to spew forth.\n\nWhether we're offended or not is immaterial. Personally? I find most flamers kind of adorable, since I can brush it off easily and that tends to frustrate them. That still doesn't mean I want them as part of my community.","replies":[]},{"poster":"AeroWaffle","date":"2017-04-19T15:35:16.309+0000","up_votes":3,"down_votes":0,"body":"Nope. It's your responsibility to behave with civility. If you can't do that then don't act surprised when Riot bans your accounts.","replies":[]},{"poster":"o Maui o","date":"2017-04-19T15:33:08.833+0000","up_votes":3,"down_votes":0,"body":"You are given the responsibility when you sign up to play to not be a jerk to other members of the community. You don't have to go out of your way to protect peoples' feelings, but it also won't be tolerated if you go out of your way to hurt peoples' feelings.","replies":[]},{"poster":"Hawckey","date":"2017-04-20T02:43:59.574+0000","up_votes":2,"down_votes":0,"body":"The amount of people who fall prey to your shitposts is really pathetic... lolboards filled with sunfish just waiting to bite the bait no matter how many times the same one is dropped","replies":[{"poster":"TrulyBland","date":"2017-04-20T15:10:05.904+0000","up_votes":1,"down_votes":0,"body":"The problem is that there are enough people that actually hold such opinions.\nAnd letting such statements stand unchallenged makes such people think they are not the minority they are.\n\nSo either you give the troll the attention they crave, or you give assholes the wrong impression that they are in the majority.\nIt's a lose/lose situation, honestly.","replies":[]}]},{"poster":"Diatonix","date":"2017-04-19T15:44:08.210+0000","up_votes":2,"down_votes":0,"body":"When toxic dickheads complain about getting banned <3","replies":[]},{"poster":"This Is Your Dad","date":"2017-04-20T04:02:45.875+0000","up_votes":2,"down_votes":1,"body":"The biggest issue is that while you think the community would be better if everyone were less sensitive, I can imagine your ideal world being a bunch of raging turdblossoms filling up chat with death threats and suicide requests. At that point it's not a matter of me being sensitive. It's a matter of how god damn annoying it would be to see 4 ragers on my team trying to make each other feel like absolute shit. How is telling someone to kill themselves logical competitive banter? If they die, they'll be afk.... I think what you need to realize is, instead of people being too sensitive, maybe mental health issues have been on the rise such as to create a norm for that kind of annoying behavior. It's like your asking everyone to live in dumpsters with flies and maggots all over and when we ask for a cleaner living space you call us sensitive. I have my own interpretation of what sensitive is, and to me it's logical. If someone is trying to upset me because they don't want me to be happy in life, I have a right to rid myself of them. Simple.","replies":[{"poster":"eazymakaveli3","date":"2017-04-20T06:13:03.393+0000","up_votes":1,"down_votes":3,"body":"lel u the type of guy to report when people say gg ez and ur analogy about living in dumpsters is retarded.","replies":[{"poster":"This Is Your Dad","date":"2017-04-20T07:59:21.359+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=eazymakaveli3,realm=NA,application-id=ZGEFLEUQ,discussion-id=ANnN5cGq,comment-id=00080000,timestamp=2017-04-20T06:13:03.393+0000)\n>\n> lel u the type of guy to report when people say gg ez and ur analogy about living in dumpsters is retarded.\n\nMaybe a guy that types \"lel\" and \"u the type of guy\" instead of typing \"You're the type of guy\" is actually the retarded one.","replies":[{"poster":"SnakDatSmilesBak","date":"2017-04-20T08:11:21.715+0000","up_votes":1,"down_votes":0,"body":"Don't say he's retarded. It's ok to say the things he's saying are retarded (imo they 100% are) but nonetheless try to stay civil towards one another. After all, you are the one who is arguing for civility :)","replies":[]}]}]}]},{"poster":"DemonCrow","date":"2017-04-20T15:00:41.359+0000","up_votes":1,"down_votes":0,"body":"Classic double standard toxic players. Playing the blame game when they themselves cannot accept their own mistakes and responsibilities. This when the community start laughing at you back instead of backing you up.","replies":[]}]}