{"poster":"Lindaaa","date":"2019-02-24T14:26:12.369+0000","title":"Losing Streak... Silver 4, 0 LP","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":1,"body":"Heyyyy, \r\n\r\nIch war letzte Season Silver 5 und wurde diese Season Bronze 3 eingeranked. Hab mich dann innerhalb von 2 Wochen zu Silber 4 hochgespielt und habe dann eine Woche lang Pause gemacht. \r\n\r\nJetzt hab ich wieder angefangen Ranks zu spielen da mein großes Ziel ist, Gold zu kommen. Ich bin Katarina OTP bzw. Seid dieser Season, und spiele eigentlich fast nichts anderes außer sie. Es hat ja alles ganz gut geklappt. Ich hatte eine 58% Winrate auf ihr bei 100 Spielen und hatte auch insgesamt eine 57% winrate... Ist ja alles schön und gut aber jetzt bin ich hard Stuck Silver 4 und habe 3 Losingstreaks hintereinander mit 7-8 Spielen... Meine MMR ist inzwischen in Bronze angelangt werde aber nicht downgeranked. Ich hab alle verschiedene Rollen noch ausprobiert ob’s besser wird, aber wird es nicht. Mittlerweile habe ich eine Winrate von 48% und weiß nicht was ich machen soll. \r\n\r\nIch will ja nicht sagen das es allein nur meiner Mades ihrer Schuld ist, aber ich verstehe nicht ganz was ich falsch mache. Ich hatte vorhin ein Game wo ich die lane hard gewonnen habe. Ich Stande 7/1 und habe beide Midlane Tower gemacht. Dann habe ich geschrieben dass alle Toplane gehen sollen damit ich die Botlane pushen kann. Und was machen sie? Die Botlane kommt mit mir auf die Botlane for no Reason weil der Tower eh fast schon weg war, und der Sion geht Midlane obwohl die Turrets ja schon weg waren, und stirbt dann... \r\n\r\nOder irgendein Toplaner feedet dann kommt der Gegnerische Toplane Mitte obwohl ich die Lane gewonnen hatte, und Killt mich Instant. \r\n\r\nUnd ja ich schreibe gleich immer ff weil es für mich einfach keinen Sinn ergibt es weiter zu spielen. Es ist einfach nur frustrierend weil ich gar nicht mal so schlecht spiele. Und ja ich bin ziemlich tilted dann immer, aber was soll ich denn auch machen?! Ich hab ein bisschen Ahnung wie man Pressure aufbaut etc. Aber wenn nur ich immer mein Senf abgebe kann ich halt auch nichts machen. Die Leute in der Elo haben keine Ahnung von dem Spiel. Sie gehen einfach die ganze Zeit Mitte und wollen fighten... Es macht halt einfach keinen Sinn. Ich schaue sehr viele Highelo Streamer und Youtuber. Ich weiß dass Objekte das wichtigste ist usw. Aber mein Team rafft es einfach nicht. Ich weiß jetzt kommt sowas dass wenn ich die Spiele nicht Carrien kann und die Gegner zu gut sind dass ich da reingehöre in die Elo, aber ich kann halt nicht nur alleine die Games machen. Was kann ich machen wenn der ADC gefeedet ist und mich 1 Shotet weil er 15 Kills hat nach 24 Minuten?! Ich komme halt auch nicht immer dran weil dann meistens des Team dabei ist, und sobald ich reinspringe ich Instant gestunt bin. \r\nEs wäre mega wenn ihr was dazu sagen könntet... \r\n\r\nIch bin erstmal fertig mit League of Legends. \r\n\r\nLiebe Grüße,\r\n\r\nLindaa","replies":[{"poster":"Pure Cynicism","date":"2019-02-24T15:28:12.883+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Lindaa22,realm=EUW,application-id=ip27PlEH,discussion-id=EAgtuQ4c,comment-id=,timestamp=2019-02-24T14:26:12.369+0000)\n>\n> Und ja ich schreibe gleich immer ff weil es für mich einfach keinen Sinn ergibt es weiter zu spielen. \n\nTja, dann stimmt offenbar deine Einstellung nicht. Du surrenderst in low Elo niemals. Jedes Spiel passieren Throws, du musst sie nur ausnutzen. Wenn die Gegner einen riskanten Baron starten, kannst du mit Kata komplett aufräumen.","replies":[{"poster":"Lindaaa","date":"2019-02-24T17:42:07.363+0000","up_votes":1,"down_votes":1,"body":"Es macht für mich einfach nach so vielen Games dann gar kein Sinn mehr... Weißt du wie ich mein... Wenn du 7 Games nacheinander verlierst, weil dein Team gefeedet hat, und du eigentlich gar nicht so schlecht warst, dann bist du nach einer Weile einfach nur frustriert, und denkst dir dass sie es eh nicht verdienen gecarried zu werden. Falls du weißt wie ich mein? Normalerweise surrender ich nie, aber wenn ich 7 Games nacheinder verliere, obwohl es meist überhaupt nicht meine Schuld ist, und ich mega gut war, dann habe ich einfach keine Lust mehr das noch weiter zu spielen. Und ja jetzt sagst du bestimmt ich soll mal Pausen machen aber des mache ich ja auch. Ich spiele dann am nächsten Tag weiter oder nächste Woche und verliere trotzdem... Ich hab 3 mal 7 Games hintereinander verloren von innerhalb 2 Wochen. Sag mir wer da nicht frustriert wäre.","replies":[{"poster":"Pure Cynicism","date":"2019-02-24T18:04:23.434+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lindaa22,realm=EUW,application-id=ip27PlEH,discussion-id=EAgtuQ4c,comment-id=00010000,timestamp=2019-02-24T17:42:07.363+0000)\n>\n> Es macht für mich einfach nach so vielen Games dann gar kein Sinn mehr... Weißt du wie ich mein... Wenn du 7 Games nacheinander verlierst, weil dein Team gefeedet hat, und du eigentlich gar nicht so schlecht warst, dann bist du nach einer Weile einfach nur frustriert, und denkst dir dass sie es eh nicht verdienen gecarried zu werden. Falls du weißt wie ich mein? Normalerweise surrender ich nie, aber wenn ich 7 Games nacheinder verliere, obwohl es meist überhaupt nicht meine Schuld ist, und ich mega gut war, dann habe ich einfach keine Lust mehr das noch weiter zu spielen. Und ja jetzt sagst du bestimmt ich soll mal Pausen machen aber des mache ich ja auch. Ich spiele dann am nächsten Tag weiter oder nächste Woche und verliere trotzdem... Ich hab 3 mal 7 Games hintereinander verloren von innerhalb 2 Wochen. Sag mir wer da nicht frustriert wäre.\n\nGuck dir mal deinen Farm, deinen Schaden und deine Deaths an. Du hast die Losses ebenso verdient wie dein Team.","replies":[{"poster":"Lindaaa","date":"2019-02-25T07:59:58.075+0000","up_votes":1,"down_votes":0,"body":"Was hat denn der Farm damit zu tun? Du kannst ja nicht anhand von stats sagen wie mein Game war... Ja es kann sein dass mein Farm nicht obtimal ist, aber es gibt auch seine Gründe dafür. Und meine Tode: Wenn ein gefeedeter Toplane zu dir runter kommt Beispielsweise und dein Toplaner nicht Pingt und ich super agressiv spiele da ich die Lane gewonnen habe, und der dich dann 1-Shotet und des mega oft, dann erzähle mir mal bitte ob du auch nicht reinsucken würdest. Und in Team fights ohne Zhonyas wenn dein Team wie Müll spielt, dann sag mir mal wie man das überleben soll? Ja ich bin nicht die beste Katarina was ich auch nicht gesagt habe, aber ich habe etwas Ahnung von den Champion. Schau dir mal mein letztes Spiel an: 16/10 mit Katarina. Du würdest mir nicht glauben das ich die Lane mit 2 Tower und 6/1 verlassen habe, und das Game verloren habe. Erzähl mir mal bitte was ich verbessern kann, und ich mach’s. Aber nicht auf die Stats schauen und sagen: „Aha 130 Farm in 30 Minuten, die ist ja mal kacke...“ Es ist nämlich nicht so einfach zu Farmen wenn jeder immer Mitte geht und dein Team dauernd  fighten will. Und die Premades meinten alle das die in meinem Team noch schlechter sind als normalerweise, obwohl ich Silver 4 bin und die Bronze... Meistens bekomme ich eh Leute die Second Time einen neuen Champion ausprobieren. Ich hab das Gefühl das ich den letzten Rotz bekomme. Naja vielleicht will mich Riot einfach Bronze haben. :/","replies":[{"poster":"Pure Cynicism","date":"2019-02-25T08:27:53.776+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lindaa22,realm=EUW,application-id=ip27PlEH,discussion-id=EAgtuQ4c,comment-id=0001000000000000,timestamp=2019-02-25T07:59:58.075+0000)\n>\n> Was hat denn der Farm damit zu tun?\n\nMan kann auch, wenn man schlechte Teammates hat, sauber farmen.\n\n>Wenn ein gefeedeter Toplane zu dir runter kommt Beispielsweise und dein Toplaner nicht Pingt und ich super agressiv spiele da ich die Lane gewonnen habe, und der dich dann 1-Shotet und des mega oft, dann erzähle mir mal bitte ob du auch nicht reinsucken würdest. \n\nDein Fehler besteht dann darin, trotz eines gefeedeten Toplaners, der nicht auf der Karte sichtbar ist, aggressiv zu spielen. Ein typischer Throw also.\n\n> Naja vielleicht will mich Riot einfach Bronze haben. :/\n\nJeder, der die Grundlagen von League beherrscht, kommt problemlos nach Gold. Du arbeitest aber an diesen Grundlagen offenbar nicht, sondern bist es zufrieden, allein deinem Team die Schuld zu geben. So kommst du aber nicht raus. Die Tatsache, dass deine Winrate auf Kata nach weit über 100 Spielen negativ ist, sagt einfach aus, dass deine Kata für deine Elo unterdurchschnittlich ist. Also musst du entweder deine Kata verbessern oder andere Dinge wie Makrogameplay. Aber der Umstand, dass dein Gegner in deinem letzten Game, in dem du angeblich gut gespielt und ihn gestompt hast, er noch mehr Farm hatte als du, lässt darauf schließen, dass du gewaltige Probleme bei Lasthitting und Wave Management hast.","replies":[{"poster":"Lindaaa","date":"2019-02-25T18:08:17.218+0000","up_votes":1,"down_votes":0,"body":"Jeder hat irgendwann in irgendeinem Game einen schlechten farm. Und ich schaue sehr viel Streams und Youtube und kann nur eins sagen, dass sie auch nicht den besten Farm haben. Zudem die Leute nur mitte gehen und fighten. Soll ich also als 9/1 Katarina Toplane gehen, von insgesamt 13 Kills? Ich bin mir nicht sicher... Als ich das letzte mal mit einem Freund gespielt habe und er Platin ist, hat er mich immer angemotzt das ich Botlane gegangen bin und die Wave gepushed habe. Es war auf sein smurf, also die Leute waren genau so schlecht. Und was machen sie? Immer und immer fighten... Als ob ich dann mit einer Katarina mit 10 kills botlane gehe. Das geht vielleicht in einem Gold spiel aber in Bronze nicht. \n\nEs war ein Beispiel. Er hatte mich damals getower dived. Es war ein 8/1 Renekton der auf mich zu gerast kam, und mich schwind unter dem Tower weg gefegt hat. Ja ich hatte ihn nicht auf der Karte gesehen, war dennoch am Tower. Ich kann es nicht mehr ganz genau sagen wie es war. Aber Punkt ist, er hat das Game 1 vs 9 gemacht. Zudem hat der jungler auch noch ihn gefeedet. Und schau in meiner Match History nach der Jax stand ungelogene 0/10.\n\nUnd wenn du mir zu gehört hättest wusstest du dass ich eine 58% winrate auf sie hatte. Was nun mal jetzt nicht mehr der Fall ist da ich eine Losing Streak habe. Und mit viel üben und spielen hat dass lange nicht mehr im vergleich mit der Elo zu tun. Das ist unfair. Sorry, aber ist einfach nicht angemessen. Hast du je ein Spiel von mir angeschaut? Man kann schlecht eine winrate von jemanden anschauen der 21 Games fast hintereinander verloren hat. Sorry, aber das gehört sich einfach nicht. Und bevor du irgendwas weiter schreibst schau einfach mein 16/10 Katarina Gameplay an, oder lass es einfach. :/ \n\nUnd ja vielleicht ist mein Wave Management nicht das beste, weil es in der Midlane auch bisschen schwieriger ist, aber ich weiß wie und wann ich sie Freeze oder pushe. Und Probleme mit dem Lasthitting ist nun mal auch eine Sache für sich... Wenn die Lane schwer ist, spielt man eben vorsichtig, oder man gecamped wird von dem jungler etc. Und wie du es glaub auch weißt ist es dann nicht so einfach für ein Nahkämpfer zu farmen wenn der Gegner die Lane bsp. freezed. Ich glaube du weißt was ich meine... Zudem bist du auch Silver und hast somit auch keine höhere Elo. Achja und dein 1/9 Irelia Game und das 1/12 Riven Game ist echt nicht zu übersehen x) \n\nVielleicht sollten wir lieber Sachlich bleiben. Und hör mal auf immer nur einzelne Sachen rauszupicken... \n\n\nIch wollte eigentlich nur eine Sachliche Meinung hören wie man da wieder rauskommt, aber naja wie es der Herr halt möchte...","replies":[{"poster":"Pure Cynicism","date":"2019-02-25T18:29:56.162+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lindaa22,realm=EUW,application-id=ip27PlEH,discussion-id=EAgtuQ4c,comment-id=000100000000000000000000,timestamp=2019-02-25T18:08:17.218+0000)\n>\n> Ich wollte eigentlich nur eine Sachliche Meinung hören wie man da wieder rauskommt, aber naja wie es der Herr halt möchte...\n\nGanz ehrlich? Das stimmt nicht. Dir geht es nur darum zu behaupten, dass dein Team immer schlecht sei. Meine sachliche Meinung dazu ist: Mit dieser Einstellung kommst du aus dieser Losing Streak nicht raus. Du musst aktiv an DEINEN Fehler arbeiten und nicht an denen deiner Mates. Und wo diese Fehler konkret liegen, kannst nur du wissen. Oder ein Coach, der sich alle deine Spiele anschaut.","replies":[{"poster":"Lindaaa","date":"2019-03-01T10:05:36.030+0000","up_votes":1,"down_votes":0,"body":"Ich bin raus gekommen aus meiner Losing Streak. :) DuoQ hat echt was gebracht, aber es ist wirklich so. Ich bin momentan Silver 4 mit 96 LP und bekomme immernoch Iron bis Bronze Dudes. Das gute ist, die meisten sind grad zur Zeit eh Smurfs die aber ehrlich gesagt auch nicht besser sind... Ich hab grad wieder Winning Streaks, aber bekomme immer nur 15-18 LP. Liegt einfach daran dass meine MMR kacka ist... Bringt es eigentlich wenn man Dodged? Wenn ich mit meinen Mate spiele der auch Silver 4 ist, ist des Team im Durchschnitt Silver 3. Wenn ich alleine Spiele Bronze 3. Er hat halt eine mega gute MMR, aber meine Frage ist jetzt wie kann ich meine verbessern?! Meine WR ist mittlerweile wieder bei 50%. Aber glaub mir mit den Leuten wo ich SoloQ gespielt habe, waren nicht aus dem Planeten. Wirklich. Damit meine ich nicht nur mein Team sondern auch die Gegner. Da kann man echt manchmal einfach nur lachen. Will ja ned sagen dass Silber so viel besser ist, aber wirklich. Mit einem Mate der gut ist, geht es wirklich zu carrien, aber alleine... Habe gestern 23 Kills gebraucht und 2 1 vs 4 um das Spiel zu carrien. Aber ich habe halt im early dauernd nur ge- roamt. Also wundere dich nicht über mein Farm und meine Tode.","replies":[]}]}]}]}]},{"poster":"Cenâreth","date":"2019-02-25T17:08:54.054+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Verwaltungsakt,realm=EUW,application-id=ip27PlEH,discussion-id=EAgtuQ4c,comment-id=000100000000,timestamp=2019-02-24T18:04:23.434+0000)\n>\n> Guck dir mal deinen Farm, deinen Schaden und deine Deaths an. Du hast die Losses ebenso verdient wie dein Team.\n\nFarm gewinnt keine Spiele. Dmg geb ich dir Recht gehört aber definitiv dazu und KdA-Stats immens wichtig.","replies":[{"poster":"Lindaaa","date":"2019-02-25T18:16:58.169+0000","up_votes":1,"down_votes":0,"body":"Ich finde so etwas einfach nur lächerlich dass aus einem Spiel zu picken und zu sagen: \"Aha, da hatte sie schlechten schaden und keinen guten Farm.\" Ich hab sooo oft am meisten dmg, auch wenn ich verloren habe. Und finde es nicht fair gegenüber mir das es einem Game zu sagen. Und ja kda- stats sind immens wichtig. Aber meiner Meinung nach nicht mehr im Late- Game. Ich versuche zwar wirklich nicht immer auf stats zu spielen, weil mir der win viel wichtiger ist. Da schlucke ich auch gerne ein par Tode solange wir den fight gewinnen. Aber die Tatsache ist, dass mein Team dann nicht Objekte holt, bringt mich jedes mal zum Frustrieren. Sorry, aber dann geht meistens meine Konzentration komplett den Bach runter und fange an zu Flamen etc. Und bitte sagt mir nicht dass ihr das überhaupt nicht kennt. Und ja Flamen zieht es noch mehr runter, aber irgendwann am Ende muss es halt raus. Und es heißt damit nicht das flamen gut ist und K/D/A nicht wichtig ist, denn ich versuche es jedes Game. Aber was bringt es am Ende wenn das team reinsuckt?! Ich habe meine 20% abgegeben aber dann fehlen noch 80%, falls du weißt wie ich mein...","replies":[{"poster":"Pure Cynicism","date":"2019-02-25T18:31:12.974+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lindaa22,realm=EUW,application-id=ip27PlEH,discussion-id=EAgtuQ4c,comment-id=00010000000000010000,timestamp=2019-02-25T18:16:58.169+0000)\n>\n>Aber was bringt es am Ende wenn das team reinsuckt?! \n\nGenau das meine ich. Du willst gar keine Tipps für dein Gameplay. Du willst eigentlich nur hören: Ja, du hast Recht, dein Team ist immer mies, du bist viel besser, kannst aber nix alleine machen. #Elohell","replies":[]}]}]}]}]}]},{"poster":"Darth Lumiya","date":"2019-02-25T19:12:40.653+0000","up_votes":1,"down_votes":0,"body":"Hier mein Account: https://euw.op.gg/summoner/userName=Darth%20Lumiya\n\nGestartet bin ich von Silber 5 und nun bin ich Gold 4. Ich musste mich durch die selben AFKler, Flamer, Ragequitter und Trolls prügeln wie du auch. Wieso bin ich jetzt in Gold und du nicht? Hatte ich 70 Games permanent Glück mit meinen Teammates? Aus erster Hand kann ich sagen: Ach du kacke nein!\n\nWoran liegt es also bei dir? Zwei Dinge fallen sofort ins Auge, wenn ich mir dein Profil anschaue.\n\nCS\nKDA\n\n1. Vergleicht man uns beide, sieht man sehr schnell, dass ich im Durchschnitt etwa 30CS mehr farme als du. Sind schon einmal 450G die ich mehr auf der Tasche habe. Zudem spielt noch der Fakt mit rein, dass Midlane Creeps schneller die Lane erreichen(Midlane ist kürzer-> weniger Laufweg).\nDaher habe ich weniger Creeps zur Verfügung, farme diese aber besser, als du mit wesentlich höherer Creep Anzahl. Allein dieser Fakt ist schon sehr dramatisch und ausschlaggebend dafür, dass du hardstuck bist.\n\n2. Deine schlechte KDA ist unter anderem auch dem Fakt geschuldet, dass du viel Gold im Bereich des CS liegen lässt. Im direkten Vergleich sieht man deutlich, dass eigentlich immer, wenn du einen 1,6 Kills machst (also 1-2 Kills je nachdem) stirbst. Generell gesagt: Du bist einfach viel zu oft tot. \n\n\nGenerell kann man sagen, dass du deinen eigenen Impact viel zu sehr überschätzt. Du redest von Dingen wie Pressure und Objectives, hast aber noch extreme Schwächen in den absoluten Basics, kannst Situationen und Zahlen, aufgrund deiner Selbstüberschätzung, nicht mehr objektiv beurteilen und suchst die Schuld stattdessen bei Mitspielern.\nDu spielst nicht gut, ja nicht einmal durchschnittlich für deine Elo. Wenn du aufsteigen möchtest, lerne das Grundgerüst des Spiels. Verabschiede dich von Pro Play Games und vergiss das, was du dort erzählt bekommst. Das ist für unsere Elo nicht einsetzbar und kann ignoriert werden. Von Silber-High Platin kommt man quasi nur die Mechaniken. Erst dann werden Dinge wie Strategie wirklich relevant\n\n\nMehr kann man dir nicht sagen. Es liegt an dir und nicht an deinen Mates, sondern an deiner individuellen Leistung. Der Beweis dafür, dass es möglich ist, habe ich dir ja schon oben verlinkt.","replies":[{"poster":"Cenâreth","date":"2019-02-28T08:54:17.421+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Darth Lumiya,realm=EUW,application-id=ip27PlEH,discussion-id=EAgtuQ4c,comment-id=0002,timestamp=2019-02-25T19:12:40.653+0000)\n>\n> Hier mein Account: https://euw.op.gg/summoner/userName=Darth%20Lumiya\n> \n> Gestartet bin ich von Silber 5 und nun bin ich Gold 4. Ich musste mich durch die selben AFKler, Flamer, Ragequitter und Trolls prügeln wie du auch. Wieso bin ich jetzt in Gold und du nicht? Hatte ich 70 Games permanent Glück mit meinen Teammates? Aus erster Hand kann ich sagen: Ach du kacke nein!\n> \n> Woran liegt es also bei dir? Zwei Dinge fallen sofort ins Auge, wenn ich mir dein Profil anschaue.\n> \n> CS\n> KDA\n> \n> 1. Vergleicht man uns beide, sieht man sehr schnell, dass ich im Durchschnitt etwa 30CS mehr farme als du. Sind schon einmal 450G die ich mehr auf der Tasche habe. Zudem spielt noch der Fakt mit rein, dass Midlane Creeps schneller die Lane erreichen(Midlane ist kürzer-> weniger Laufweg).\n> Daher habe ich weniger Creeps zur Verfügung, farme diese aber besser, als du mit wesentlich höherer Creep Anzahl. Allein dieser Fakt ist schon sehr dramatisch und ausschlaggebend dafür, dass du hardstuck bist.\n> \n> 2. Deine schlechte KDA ist unter anderem auch dem Fakt geschuldet, dass du viel Gold im Bereich des CS liegen lässt. Im direkten Vergleich sieht man deutlich, dass eigentlich immer, wenn du einen 1,6 Kills machst (also 1-2 Kills je nachdem) stirbst. Generell gesagt: Du bist einfach viel zu oft tot. \n> \n> \n> Generell kann man sagen, dass du deinen eigenen Impact viel zu sehr überschätzt. Du redest von Dingen wie Pressure und Objectives, hast aber noch extreme Schwächen in den absoluten Basics, kannst Situationen und Zahlen, aufgrund deiner Selbstüberschätzung, nicht mehr objektiv beurteilen und suchst die Schuld stattdessen bei Mitspielern.\n> Du spielst nicht gut, ja nicht einmal durchschnittlich für deine Elo. Wenn du aufsteigen möchtest, lerne das Grundgerüst des Spiels. Verabschiede dich von Pro Play Games und vergiss das, was du dort erzählt bekommst. Das ist für unsere Elo nicht einsetzbar und kann ignoriert werden. Von Silber-High Platin kommt man quasi nur die Mechaniken. Erst dann werden Dinge wie Strategie wirklich relevant\n> \n> \n> Mehr kann man dir nicht sagen. Es liegt an dir und nicht an deinen Mates, sondern an deiner individuellen Leistung. Der Beweis dafür, dass es möglich ist, habe ich dir ja schon oben verlinkt.\n\nWarum bist du eigentlich nicht Platin, wenn dein CS im Schnitt höher als ihrer ist?\n\nDu bist seit 3 Season hardstuck Gold, da sollte ja Platin kein Problem darstellen.","replies":[{"poster":"Lindaaa","date":"2019-04-26T19:55:41.754+0000","up_votes":1,"down_votes":0,"body":"Leider, sehe ich nicht wirklich deine Stats etc. auf deinen Vorgegeben Account, also hab ich mal den Account mir angeschaut mit dem du geschrieben hast. Du bist da auch Silver 4 also passt es ja :)\n\nMeine KDA in den letzten 10 Spielen: 2.84:1\nDeine KDA in den letzten 10  Spielen: 2.29:1\n\nMerkst was? Ist bisschen besser gell? Und du hast genauso eine 47% winrate wie ich... Also wenn du des können so ablesen möchtest bitte. Aber in meinen Augen hat die KDA nicht wirklich was mit climben zu tun. League of Legends ist ein Team bedingtes Spiel, somit muss das ganze Team beisteuern um zu gewinnen. Ist also ein Spieler raus aus dem Game, weil er bsp. trollt, feedet oder AFK ist, hat das gegnerische Team also eine höhere Chance zu gewinnen. Ist doch logisch oder? Also wenn ich dann mit meinen 14/2 komme und mit meinen restlichen \"3\" Teammates haben wir trotzdem noch eine schlechtere Chance. Hat das Gegnerische Team also auch einen gefeedeten Spieler ist die Chance zu gewinnen noch geringer. Was ich mir also wünschen würde, ist eine bessere Chance auf 1 vs 9. Du kannst so oft roamen wie du willst, und deinem Team helfen, bringt es etwas wenn du mit Holzköpfen spielst? Nein.","replies":[]},{"poster":"Darth Lumiya","date":"2019-03-03T12:43:37.119+0000","up_votes":1,"down_votes":0,"body":"Du solltest vielleicht auch mein PRofil komplett angucken. Dann würdest du sehen, dass ich nie mehr als 100Games pro Season mit Rankeds verbracht habe. Ich denke bei 200+Games ist Platin durchaus drin. Bisher bekommne ich +24 und -16. Daher ist auch MMR mäßig noch was zu holen.","replies":[]}]}]},{"poster":"Angel Ayume","date":"2019-02-27T06:41:47.365+0000","up_votes":1,"down_votes":0,"body":"Versteh ich das richtig? Du schreibst sofort \"ff\" weil du einmal ggn nen gefeedeten Gegner gestorben bist? Oder hab ich das missverstanden?","replies":[]},{"poster":"Valdis17","date":"2019-02-24T14:40:38.800+0000","up_votes":1,"down_votes":1,"body":"dein Icon ist knuffig","replies":[{"poster":"Lindaaa","date":"2019-02-24T17:41:43.012+0000","up_votes":1,"down_votes":0,"body":"Haha danke! Aber ist ned des Thema :D","replies":[]}]}]}