{"poster":"GodlyBane","date":"2017-11-10T00:55:44.327+0000","title":"Why did i not get my 30 champion capsules when i lvled up?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"In PBE when i lvled up, i recieved all 30 champion capsules as i should, since i was level 31. But when pre season came out, all i wanted was to lvl up and get those capsules.\r\n\r\nPlayers that are lower level get 5 capsules every 2 days minimum. in 3 days i got 1. Basically what im saying is that lower level players will recieve 30 more capsules then long time, hard grinding, people. This is NOT fair. I know some people will disagreee with me and say \"its too broken\" well its not. We would get the same amount of capsules as a new player would anyway, so it would be perfectly fine\r\n\r\nif Riot sees this and thinks about the level up fix,  I will continue to play league. However, for now...\r\n\r\nI think I'll quit","replies":[{"poster":"Xaeros","date":"2017-11-10T01:04:57.191+0000","up_votes":1,"down_votes":0,"body":"This has been [covered extensively](https://support.riotgames.com/hc/en-us/articles/115012640908). Your reward for leveling was 30 levels worth of IP, that you got to keep and/or use. New players will be earning tailored rewards from levels 1-30 that are replacements for the IP-value that an existing level 30 player already has. \n\n>**Q**: I’m already level 30. Will I retroactively get the leveling capsules for climbing from 1–30?\n\n>**A**: No. Remember that the new leveling system is a replacement for the IP you get after games now. You already got rewarded for all the games you played when you leveled from 1–30, but it was in the form of IP. So new players aren't going to get anything you didn't already get for playing the game.\n\n>It will still take new players a long time to climb to level 30 and get the 30 capsules along the way. If you spend that time instead on your level 30 account, you'll get a bunch of capsules as well and you'll be well on your way toward unlocking one of the exclusive cosmetic rewards at the milestone levels.\n\ntl;dr: You already got your level 1-30 rewards.","replies":[{"poster":"Broporo","date":"2017-11-10T01:42:17.061+0000","up_votes":1,"down_votes":0,"body":"^ This. Players who played consistently before the preseason update got loads of IP which still transferred over into the new system, it just got a bluer name. We're definitely open to the feedback, and if you're still unhappy with it I'd suggest posting those thoughts [**over here**](http://boards.na.leagueoflegends.com/en/c/gameplay-balance).","replies":[{"poster":"Mr Wind Up Bird","date":"2017-11-10T14:40:39.123+0000","up_votes":1,"down_votes":0,"body":"Um, we spent that IP on runes. Seems kind of gross to make this argument while only refunding 20% on rune purchases.","replies":[]}]}]}]}