{"poster":"Hjalmar Schacht","date":"2017-07-15T07:25:58.373+0000","title":"Se puede crear otro motivo de report a un jugador?","subforum":"Problemas Técnicos","up_votes":6,"down_votes":1,"body":"Lo que estaba pensando es en un Report por estar &quot;bajo el control de estupefacientes&quot;  porque me ha tocado en varia partidas que alguien dice &quot;perd&oacute;name, es que estoy ebrio&quot;. Realmente a mi me da igual si es verdad o mentira, o si se drogan o emborrachan pero quisiera saber si podria haber un motivo as&iacute; ya que, no siempre, pero hay veces que juegan muy mal ya pareciendo que no saben ni como se utilizan las habilidades o incluso ni juegan pero siguen estando en partida.\r\nO al menos especificar un poco mejor los reports ya que hay veces que ayudan a los enemigos pero no &quot;suicid&aacute;ndose&quot; sino que dando informaci&oacute;n de los objetivos o de los campeones en el mapa y eso que yo sepa no entra en los motivos de report.\r\nCreo que los reports (al menos en LAS) se est&aacute;n quedando un poco atr&aacute;s y no es sorpresa que haya tanta cantidad de gente toxica arruinando la experiencia de juego.\r\nSi no es posible esto quisiera saber alguna opini&oacute;n, &iquest;ustedes como mejorar&iacute;an el tema de los &quot;trolls&quot;?","replies":[{"poster":"stonerock","date":"2017-07-15T14:42:59.577+0000","up_votes":1,"down_votes":0,"body":"apoyo la idea, siempre los viernes y sabados estan los giles que rebotan en los boliches o vuelven de algun bar y se ponen a jugar ebrios.","replies":[]},{"poster":"iEban","date":"2017-07-15T07:32:57.574+0000","up_votes":2,"down_votes":5,"body":"También podrían hacer uno para la gente que no usa ropa abrigada en invierno, que te dicen \"perdón tengo las manos frías\" y para los que tienen teléfono porque a veces los llaman.","replies":[{"poster":"Kanade Jigsaw","date":"2017-07-15T18:42:33.091+0000","up_votes":1,"down_votes":0,"body":"Nuoo xDD que grande tu comentario, me mate de la risa. pero falta que hagan tambien ese de que no duermen porque a veces dicen; me estoy quedando dormido o estoy jugando dormido","replies":[]}]}]}