{"poster":"IamKeyi","date":"2015-09-04T20:27:23.502+0000","title":"Schlechter Ping seit Server Verbesserung","subforum":"Hilfe & Support","embed":{"description":"Hey, ihr tollen Leute! TL;DR: Es gab die vergangenen Monate &uuml;ber Verbindungsprobleme auf den EU-Servern (einschlie&szlig;lich Drophacks). Wir haben einige Verbesserungen umgesetzt und wir haben noch einige weitere Anpassungen in Arbeit. Mehr Details &hellip; Die letzten Monate &uuml;ber war die Verbindung zu den EU-Servern f&uuml;r einige Spieler instabil.","url":"http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/a3rhuZ3s-allgemeine-eu-verbesserungen-juli-2015","image":"http://cdn.leagueoflegends.com/apollo/assets/vb/boards-wallpaper.jpg"},"up_votes":1,"down_votes":1,"body":"Hallo liebe Community \r\n\r\nIch schreibe zum ersten mal hier etwas und tue das nur da ich hoffe aufmerksamkeit zu bekommen und das dieser Fehler somit behoben wird. \r\nBei dem beigef&uuml;gten Link geht es um die Server Verbesserung. Diese hat anscheinend auch wirklich einigen Leuten geholfen aber mir ist aufgefallen das bei mir seit dem der Ping viel schlechter geworden ist. Ich hatte ein Jahr lang einen 37er Ping und nun seit circa 3 Wochen ( kann mehr oder weniger sein ) ist er mindestens bei 60 aber nicht nur das er bei 60 bleibt er schwingt auch noch die ganze Zeit zwischen 60 und 125 hin und her. Ich habe geh&ouml;rt das mehrere Spieler seit diesem Zeitraum verbindungsprobleme mit dem Server haben und ich weiss das es auch an LoL liegt da ich mit meinem Anbieter geredet hatte meinen PC neu aufgesetzt habe und meinen Router auf Werkseinstellung zur&uuml;ck gesetzt habe. Ich habe ja auch &uuml;berall einen normalern 30er Ping nur in LoL ist er richtig schlecht und das war vorher nie so. Ich m&ouml;chte einfach das jemand von Riot hier drauf aufmerksam wird und diesen Fehler behebt da vorher es wirklich viel besser war und eins chwankender Ping laggt mehr als ein konstant schlechter. Hoffe das hier zu schreiben hat was gebracht","replies":[]}