{"poster":"Dildo de Moria","date":"2015-03-01T15:42:43.076+0000","title":"Smite es una copia de LOL?","subforum":"Charlas Generales","up_votes":3,"down_votes":17,"body":"Hola, eh visto a unos chicos Estadounidenses jugar mucho a un MOBA llamado Smite y aunque no entendia nada de lo que decian, pude apreciar de que hay personajes que tienen habilidades MUY similares a campeones de aca del LOL, ademas de que hay un personaje llamado Sun Wukong que tambien es un mono y tiene un báculo identico al Wukong de LOL, eh visto mucha similitud con los personajes de aca. Un ejemplo de a lo que me refiero es que hay una diosa llamada Athenea que se parece mucho a {{champion:89}}  ademas de que tiene el ulti de {{champion:98}}, la diosa freya tiene su similitud con {{champion:10}} ademas de ganar ataques a distancia y que el ulti la haga invulnerable, el dios Ymir tiene el ulti de {{champion:20}} y el muro de {{champion:34}}, el dios Loki tiene la invisibilidad de {{champion:35}} y no hablemos de el dios Fenrir que tiene el mismo baile y apariencia que {{champion:19}} ademas de que tiene habilidades muy parecidas y la lista sigue, no se yo y tampoco soy experta ni me voy a poner a comparar dos MOBAS pero creo que no hay mucha ``originalidad´´ por asi decirlo.","replies":[{"poster":"Ryoga","date":"2015-03-01T16:54:08.996+0000","up_votes":2,"down_votes":0,"body":"les falto decir que twisted fate es una copia de gambito  o le habran comprado los derechos a marvel?","replies":[{"poster":"Dildo de Moria","date":"2015-03-01T16:56:27.705+0000","up_votes":2,"down_votes":0,"body":"Era una duda, no entienden o q.","replies":[]},{"poster":"Yazuò","date":"2016-07-12T04:47:46.652+0000","up_votes":1,"down_votes":0,"body":"No son derechos de marvel especificamente los X-Men Le Pertenecen a FOx.","replies":[]}]},{"poster":"Dark Helel","date":"2015-03-01T16:04:19.102+0000","up_votes":4,"down_votes":2,"body":"El tema es q tenes q informarte mas, sino te llenan a -1 x decir esas cosas.\nTodos los mobas descienden de un padre y madre, q son DOTA 1 + Aeon of Strife.\nDe ahi salieron DOTA2 y LOL aunque el termino MOBA lo creo y popularizo el LOL asi q seria el \"MOBA original\".\nComo tal se volvio un genero, y comparte similitudes con el resto de mobas, asi como por ejemplo todas las peliculas del genero comedia son de risas y asi,es un genero.\n\nEntonces todo juego en algun punto se parece a otro sin excepcion...como las peliculas se parecen entre si, como por ejemplo death note y code geass son lo mismo, o batman y punisher o iron man, thanos y darkseid,etc, googlealo.\n\nPara responder lo otro, Sun wukong es un personaje mitologico chino, riot no tiene copyright sobre una leyenda y como tal hasta si yo quiero puedo hacerme una historia sobre un personaje exactamente igual {{champion:62}} ... es mas para q entiendas, GOKU esta inspirado en sun wukong, incluso capcom tiene un personaje llamado son son q es lo mismo y hasta en naruto existe un personaje llamado son goku...y como notaras, WUKONG vendria a ser una plagio de GOKU en ese caso xq goku salio primero...pero como ambos salieron de sun wu kong nadie plagio a nadie xq no tienen los derechos de esa leyenda.\n\nLo demas te lo explicas solo googleando...fenrir es un lobo, no es copia de WW,\nLa athena original se supone es parecida a leona asi q podriamos decir q leona esta inspirada en athena y asi...\nLo demas son mecanicas y no podes discutir mucho xq la mayoria proviene de juegos como el Warcraft 3...","replies":[{"poster":"Dildo de Moria","date":"2015-03-01T16:42:11.289+0000","up_votes":3,"down_votes":1,"body":"Si si entiendo, pero quiero que ustedes entiendan que solo pregunte, era una duda, no estaba afirmando nada, solo eso, ya se que son mobas y tal, pero no se me amarguen tanto.","replies":[{"poster":"Dark Helel","date":"2015-03-01T16:55:33.725+0000","up_votes":1,"down_votes":0,"body":"Si,ya se,por eso no te dije nada malo,era para que entiendas la diferencia, y si te interesaba, q googlearas las referencias,q para algunas personas sono interesantes.\nPasa q caiste en la clasica \"quien copio a quien\" y bueno, a la gente le cansa eso y....pasan esas cosas...","replies":[]}]}]},{"poster":"AustinAries","date":"2016-07-12T04:56:36.962+0000","up_votes":1,"down_votes":0,"body":"No entiendo como pueden decir que el LOL es una copia del DotA 2 si salio un par de años antes... \nEl lol esta basado en un mapa de W3 TFT llamado DotA, los diseñadores de ese mapa se pelearon en un momento (Cuando el juego era MUY popular) y se separaron en 2 grupos, uno armo el LOL y el otro siguió dando soporte al Dota y trabajando en lo que seria el DotA 2.\nTODOS los MOBAS de la actualidad están basados en el Starcraft.","replies":[{"poster":"Dildo de Moria","date":"2016-07-12T05:31:13.659+0000","up_votes":1,"down_votes":0,"body":"Che sin ganas de ofender pero medio que el post lleva un año y medio como que ya fue","replies":[{"poster":"AustinAries","date":"2016-07-12T05:47:29.318+0000","up_votes":1,"down_votes":0,"body":"Me di cuenta después que lo postee, pero como otro ya lo había revivido antes no me gaste en eliminarlo.\nSaludos","replies":[]}]}]},{"poster":"Yazuò","date":"2016-07-08T03:41:32.876+0000","up_votes":1,"down_votes":0,"body":"Pueden tener sus parentescos de hecho todo lo que te preguntas me lo llegue a preguntar hasta Fafnir el nuevo dios se transforma en dragon igual que {{champion:102}}  pero no es exactamente igual pueden tener simulitudes pero no son lo mismo o el mismo shaco y lokki si te lo piensas {{champion:35}} parece una copia del joker de batman y ademas hasta se parece un poco a lokki en el casco ese raro bueno tu entenderas no?\nhasta ahy habilidades parecidas una llamada fantasma identica a nuestro querido {{summoner:4}} pero debian tenerlo eso ayuda a atraer a personas de lol como tiene cosas parecidas les gustara :D","replies":[{"poster":"zelaya19","date":"2016-07-08T08:41:11.060+0000","up_votes":1,"down_votes":0,"body":"Que haces reviviendo post de hace un año? ._.","replies":[{"poster":"Yazuò","date":"2016-07-12T04:48:14.624+0000","up_votes":1,"down_votes":0,"body":"Aburrimiento?\ncola de 20 minutos","replies":[]}]}]},{"poster":"SemenDinger","date":"2016-07-08T15:02:17.118+0000","up_votes":1,"down_votes":0,"body":"es como una aplicación móvil que también tiene mucha similitud con el lol xD ese mono wukong esta en todas partes jaja.\n\n{{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"Runth","date":"2016-07-08T07:18:27.520+0000","up_votes":1,"down_votes":0,"body":"el smite es solo un deposito de ratas y baneadores por jugar mal","replies":[]},{"poster":"Excorpion","date":"2015-03-01T15:54:12.938+0000","up_votes":1,"down_votes":0,"body":"smite copia de lol y lol copia de dota ??? otra vez con los mismos temas... Smite es un Moba basado en Dioses, si bien las habilidades se parecen, esto no tiene importancia de donde sacaron las habilidades de los campeones, Smite es un moba igual que Dota y LoL, la unica diferencia, es que se juega en first person","replies":[{"poster":"Dildo de Moria","date":"2015-03-01T16:42:25.194+0000","up_votes":1,"down_votes":1,"body":"si, entende que era una duda nada mas, no afirme nada","replies":[{"poster":"RedDare","date":"2016-04-05T23:38:22.669+0000","up_votes":1,"down_votes":0,"body":"para que preguntas si no queres que te respondan? .-. saca tus concluciones igual, ambos juegos son buenos para mi, la unica diferencia es que nunca pero nunca le dare dinero a rito por sus skins de mierda","replies":[]}]}]},{"poster":"PsychoMen","date":"2016-03-06T23:08:59.855+0000","up_votes":1,"down_votes":0,"body":"se nota que no sabes lo que decís wukong esta basado en un dios por eso lo pusieron ademas el lol se copio de otros mobas para crear su juego no es que es el primer moba del mundo  ademas sabias que la r de imyr esta basada en una historia ?? y que los de lol usaron esa historia para crear la r de nunu¿? Edit: El lol no se copio para crearse digamos que tomo ideas por que copiar es una palabra muy fuerte ","replies":[]},{"poster":"xX TuOniichan Xx","date":"2015-03-01T19:34:57.017+0000","up_votes":1,"down_votes":0,"body":"Como opinión personal, todos los MOBA's tienen alguno que otro parecido, tanto mecanicas como apariencias, para que comenzar a jugar sea \"familiar\". Creo que SMITE por ejemplo, tiene a su Wukong con la voz de Mario Castañeda (No me violen verbalmente si me equivoco :( xD), que es quien dobló la voz de Gokú en Dragon Ball. Este detalle, por muy basico que sea, lo hace familiar. En LOL no lo hicieron así, pero hay un Xin Zhao que en cualquier momento podria transformarse en Super Sayayin xD.\n\nComo ya explicaron, los MOBA´s son un genero y entre si, se parecen mucho. Originalidad hay poca en algunas cosas, ya que los juegos de Dioses estan demasiado vistos. Pero todos tienen cosas distintas, LOL tiene un numero decente de personajes con \"skins\" diferentes, es gratis, y tiene un desarrollo constante. SMITE tiene algo poco visto que es su camara en tercera persona y por ende, mejor grafica (Si los personajes se vieran como los del LOL en tercera persona, pensariamos que es un juego de PS1 xD). Heroes of the Storm, además de tener un gran numero de personajes por ser casi un Crossover xD, tiene una gran cantidad de modalidades de juego, su desventaja es que sigue estando en Beta y lo quieran o no sus creadores, es MOBA por donde se le mire xD. Tambien interactua distinto a LOL, ya que no compras articulos para potenciarte, tus habilidades tienen distintos desarrollos y tu escoges cual te combiene al momento de subir de nivel, ya sea potenciando un disparo o aumentar el numero de disparos.\n\nDicho esto, cada quien escoge que juego cumple mejor sus intereses como jugador. Yo me quedo con LOL por que me gusta, y si algo me gusta no busco algo mas, ya que si estoy comodo en un sofá, no voy a comprarme uno que haga masajes si el que tengo me mantiene bien xD.\n\nPreguntar no esta mal ConejoNeskui, tu lo dijiste en uno de tus comentarios, el peor lugar para comparar a LOL con otros juegos, o otros juegos con LOL, es aquí, donde se supone, todos prefieren LOL xD. Pero no es tu culpa que nadie entienda que el desconocimiento no es un error, y que ellos son mas ignorantes por no comprender el por que de tu duda. A si que no te lo tomes a mal, y no hagas caso de lo que te digan. Tu disfruta el juego, saludos ;)","replies":[{"poster":"Dildo de Moria","date":"2015-03-01T19:38:58.261+0000","up_votes":1,"down_votes":0,"body":"-....-","replies":[]}]},{"poster":"Ryoga","date":"2015-03-01T17:25:02.715+0000","up_votes":1,"down_votes":0,"body":"y ahora se pone a hacer spam?\n\ndios ._.","replies":[]},{"poster":"Vastorn","date":"2015-03-01T17:06:29.023+0000","up_votes":1,"down_votes":0,"body":"Te quejas de que se molesten cuando preguntas de una forma tan agresiva como \"Smite es un plagio de LoL\"? Entenderás que no fue la mejor manera de preguntar algo, así que es completamente normal que moleste a mas de alguien.","replies":[]},{"poster":"Mr Bard Times","date":"2015-03-01T17:01:46.139+0000","up_votes":1,"down_votes":0,"body":"smite es una copia del buscaminas","replies":[]},{"poster":"Delt Dragon","date":"2015-03-01T15:52:46.016+0000","up_votes":1,"down_votes":0,"body":"Primero que nada Wukong esta basado en la leyenda del rey mono y el libro \"Un viaje al oeste\" que cuenta el viaje de Son Wukong... smite y lol no son los unicos juegos con ese personaje, HoN tambien y otros juegos de diferentes generos, de hecho Dota tiene un item llamado \"El baston del rey mono\". Incluso Goku esta basado en dicho personaje (Wukong se puede pronunciar como \"Goku\")\n\nhttp://es.wikipedia.org/wiki/Sun_Wukong\nSegundo, la jugabilidad de smite es COMPLETAMENTE diferente a LoL, Dota, HoN, Dota 2 y otros mobas.\n\nWarwick tiene el baile de Thriller (Michael jackson), no lo invento Riot. En el video, Michael Jackson es un hombre lobo (y zombie) al igual que Warwick y Fenrir.\n\nhttps://www.youtube.com/watch?v=nZTuNtRUT2I\n\nY si quieres hablar de copias, casi todas las habilidades de los primeros champs estan basados en las habilidades de Dota1  (Guinsoo (miembro de Riot) fue uno de los que diseño Dota1).\n\nEl moba que SI es copia directa de LoL es el juego chino llamado \"300 heroes\"\n\nhttps://www.youtube.com/watch?v=yoOEaeHpejE\n\nAdemas Loki, en la leyenda efectivamente tiene la habilidad de hacerse invisible. (todos los personajes de Smite son leyendas mitologicas)","replies":[{"poster":"Dildo de Moria","date":"2015-03-01T16:43:21.937+0000","up_votes":1,"down_votes":1,"body":"Entende que era una duda nada mas, no conozco el juego, solo pregunte para sacarme la duda, pero se me amargan mucho chicos.","replies":[]}]},{"poster":"Ryoga","date":"2015-03-01T15:48:51.526+0000","up_votes":1,"down_votes":0,"body":"ahora cualquier moba es copia de lol?\n\n._.","replies":[{"poster":"Dildo de Moria","date":"2015-03-01T16:43:48.580+0000","up_votes":1,"down_votes":1,"body":"No dije eso, simplemente era una duda, mi duda, no estaba afirmando nada, solo pregunte, dios.","replies":[]}]},{"poster":"Kakuja","date":"2015-03-01T19:52:06.293+0000","up_votes":1,"down_votes":1,"body":"{{summoner:13}} LoL es una copia de Dota 2 y Smite es una copia de LoL... asi lo veo yo. {{champion:119}}","replies":[]},{"poster":"Dildo de Moria","date":"2015-03-01T16:58:41.367+0000","up_votes":1,"down_votes":1,"body":"Gente, se nota que ustedes solo leen el titulo y dos parrafos, simplemente era una duda que queria saltar, no dije que LOL sea mejor,  tenia una duda y por lo visto elegi el peor lugar para intentar sacarmela de encima, no puedo creer que ni sacarse una duda se pueda aca ya que te llenan de negativos porque si.","replies":[]},{"poster":"Tocxic man","date":"2015-03-01T15:51:51.984+0000","up_votes":1,"down_votes":2,"body":"Cállate si no sabes no preguntes estupideces se nota que eres un {{champion:48}}","replies":[{"poster":"Dildo de Moria","date":"2015-03-01T16:44:44.900+0000","up_votes":1,"down_votes":1,"body":".-. Por eso pregunte, no sabes interpretar o que, era una duda que queria saltar y cometi un error al crear un post precisamente aca, ya que responden como quieren y solo insultan.","replies":[]}]},{"poster":"NuclearWAR","date":"2016-01-10T14:42:06.022+0000","up_votes":0,"down_votes":0,"body":"En mi opinion digo yo digo que el smite es una gran copia del wow mas que de Lol y el Lol esta 100% comprobado que es casi una copia del Dota2 practicamente Dota y Lol son hermanos aparte hay muchos dioses en el smite que tienen muchas copias a las habilidades de campeones del Lol y el modo de juego , la camara de jugador y los moviminetos son super similares a los del wow puedo decir que los aspectos no tiene mucha importancia ya que los dioses existieron mucho antes que el Lol -_- pero los bailes te creo que sea una copia aparte . Y bueno tendremos que aceptar que el dueño del smite no tenia una mejor idea que juntar 2 juegos y ponerle dioses.","replies":[]},{"poster":"LynkAurum","date":"2015-03-01T16:14:52.377+0000","up_votes":1,"down_votes":2,"body":"Puede que sea una copia, puede que no lo sea. Como dijiste, Smite tiene muchas cosas y características que la hacen poco original y la viva imagen de LoL. Este tipo de juegos son los que toman ciertas cualidades de otros juegos por carencia de ideas por parte de los creadores, sin embargo, despues de un tiempo empiezan a desarrollar su propia historia y su propio estilo hasta convertirse en un juego mediana o completamente original. Por ejemplo, LoL originalmente iba a ser una extensión de WoW, sin embargo, Riot considero de que al ser WoW un juego P2P (Pay to Play) eso no atraería a muchos jugadores, por lo que decidió ser un juego independiente, claro que al hacer eso las caracteristicas de WoW se le habian quedado pero modificadas. Y hoy en dia, 7 años después de su lanzamiento oficiales un juego que posee sus propias y unicas características. Smite es un juego recien salido del horno, solo dale tiempo y se volvera mas original ;)\n\n{{champion:4}}","replies":[]}]}