{"poster":"Pika310","date":"2014-12-20T02:15:13.472+0000","title":"Hashtag Better Nerf Sona","subforum":"Gameplay","up_votes":45,"down_votes":19,"body":"You've already heard everything Sona lost, seen all the numbers and math.  It's time to talk about how the changes nerfed Sona's **TEAMMATES**.  As a team-based champ that relies on assisting her allies, it's very important we take some time seeing how the \"rework\" affected them.\n\nLet's start with her auras: they had a 1000-unit radius and would apply to allies even when a teamfight split up.  They've been completely removed and replaced with 1-off AoE effects.\n\n**Who got nerfed:** Long-range champions, mid-range champions\n**Who got buffed: **Enemy teams with AoE, *Nami*\n\nHymn of Valor used to give a permanent buff of 20 AD and 20 AP.  This was always relevant to all teammates at all times.  Even better, any champion with dual-scaling on their kits especially loved this ability, it gave just a little extra to many champs like Sivir, Katarina, Renekton, etc. that have AD/AP scalings they typically don't build into.  This was replaced with a weak on-hit that can only be procced by basic attacks and does not apply to structures.\n\n**Who preferred old Hymn: **Dual-scaling champs, attack speed champs, crit-chance champs, sustained-damage champs\n**Who got nerfed: **Mages, siege champs, assassins, ability-based champs\n**Who got buffed: ** Enemy shields, enemy sustain, *Nami*\n\nAria of Perseverance gave a team-wide Armor and MR buff.  The more HP and shields your allies had, the more effective it became.  Better yet, on activation she gave herself and an injured teammate twice as much defense for a full 3 seconds.  Aria currently applies a temporary short-lived shield of very weak strength.\n\n**Who preferred old Aria:** Injured allies, shields, siege champs\n**Who got nerfed:** Bruisers, tanks, HP items\n**Who got buffed: **Sustained-damage enemies, *Nami*\n\nCelerity's passive has been completely removed.  There was no compensation made to this ability, your teammates get the exact same amount of movement speed for the initial 1.5 seconds, then the ability disappears for 1/5 of a full minute.\n\n**Who got nerfed: **Engage champs, disengage champs, pick-comps, chase comps, lane minions\n**Who got buffed: **Enemy junglers, enemy roamers, *Nami*","replies":[{"poster":"HowPlayGAEM","date":"2014-12-20T10:28:23.834+0000","up_votes":30,"down_votes":3,"body":"While I agree with you that Sona's rework sucks total ass, I disagree with your nostalgia of her auras.\n\nYes they were good, but this is one of those cases where Riot's buzzword \"INVISIBLE POWER\" actually applies.  \n\nUltimately, it's a lost battle.  The PBE feedback and initial release feedback was nearly universally negative yet the rework went through, and now there are too many non-mains and trolls who \"like\" current Sona and think she's \"totally op\".  \n\nEvery Sona discussion goes like this (generalization of course):\n- Sona mains think her rework sucks and was a huge nerf\n- non-Sona mains support the rework, say she's more fun to play and totally OP and can one shot squishies\n- Sona mains point out the ACTUAL facts: Little to no pro play, she gets one shot by anyone with working eyesight.\n- non-Sona mains mock Sona mains, pretend that winrate matters (except when it inconvenient right? if Sona's 53% is OP, Lee's 45% is UP)\n- Riot never responds\n\n\nThat's how this goes every single time without fail.\n\nTL;DR - rework sucks and is an insult to Sona","replies":[{"poster":"Chaotic Reks","date":"2014-12-20T14:48:24.376+0000","up_votes":12,"down_votes":0,"body":">  Sona mains point out the ACTUAL facts: Little to no pro play, she gets one shot by anyone with working eyesight.\n\ntherefor she can never die from {{champion:64}}, making her OP","replies":[{"poster":"DrCyanide","date":"2014-12-21T21:57:38.589+0000","up_votes":4,"down_votes":0,"body":"That explains the repeated nerfs! No one can be stronger than Lee Sin!","replies":[]}]},{"poster":"Pika310","date":"2014-12-20T10:47:50.055+0000","up_votes":13,"down_votes":2,"body":"I cannot disagree with you, that assessment is perfect.\n\nYes, their goal was to remove \"invisible power,\" but the one feedback that is slightly more agreed upon is that her new non-\"auras\" are still invisible power.  Players don't realize they have a Hymn proc to use and her spells are just as unnoticeable as before.\n\nIn other words, it was all for naught.  Riot nerfed her kit, removed her identity and ruined her skins all in the name of clarity that they ultimately failed to accomplish.  All 3 sides of the \"rework\" were failures.  If Riot had just kept it solely to a visual effects update and left everything else untouched, at least we wouldn't be here in this situation.\n\nSadly, in their arrogant, self-proclaimed all-knowing wisdom, they wanted to fix something that wasn't broken, solely on a whim.","replies":[]}]},{"poster":"Sohleks","date":"2014-12-20T05:42:37.981+0000","up_votes":7,"down_votes":20,"body":"Sona is actually pretty good, especially as a counter to Janna or Lulu lanes who packs no sustain or natural engage to counter Sona. Sona poke and sustain adds a lot of pressure against those who have to time their shield especially if Sona's AD knows how to play too.\n\nI don't know what it is about Sona where her players are never satisfied unless she is the strongest support in existence like she was for the longest time in season 2 and 3 (a while ago admittedly). Back then nobody cried Sona OP (even though she very much was). Seems the rework *did not* address this issue.\n\nBelieve it or not Sona is a support you have to take care to play well. Since she is squishy you cannot make mistakes around enemy CC or ganks and all the while you have to abuse the fact you have the poke you do. You cannot really afford to sit back and play an easy reactive game like Nami can who almost always maxes her heal spell that has damage too and in addition she has CC to ruin enemy plays. But just because Sona is harder to play does not mean her potential power is not there. She is getting plenty of play at the highest levels of competitive gameplay right now.\n\n**Although I think there is an issue between supports who have multiple *desirable* (not viable) skill paths. Sona and Lulu have to choose between shield/heal or an actual damage presence in lane. This can really affect laning effectiveness even though their kit has different tools...** This is not as bad for Sona as it is for Lulu because a little permanent healing is better than a temporary tiny shield. Nami is easy because heal is always a strong choice to max. Although I suppose Lulu can get damage from E it's very much a sub optimal use of the skill (for a support Lulu with 1 rank in Q)","replies":[{"poster":"IlyaK1986","date":"2014-12-20T06:05:06.973+0000","up_votes":27,"down_votes":1,"body":"Strongest support in existence?\n\nYou spelled Thresh wrong.","replies":[{"poster":"It Is I Emoto","date":"2014-12-20T14:12:32.232+0000","up_votes":7,"down_votes":1,"body":"Honestly, just play Thresh as AP support and get a lich bane on him, he would technically do more damage than Sona LMAO","replies":[{"poster":"kanacho","date":"2014-12-21T18:21:48.542+0000","up_votes":1,"down_votes":9,"body":"Have you ever played AP mid sona... It's hilarious how broken the scaling is lol. Your damage is quite high for a large majority of the early-mid game, then you become super support late game being able to heal/shield people for huge numbers, your movement speed buff is really funny when combined with a Rylai's making Sona become a Kite master all while doing quite good damage late and super supporting her team big time.\n\n","replies":[{"poster":"A Wild AP Sona","date":"2014-12-21T20:16:09.593+0000","up_votes":7,"down_votes":1,"body":"> [{quoted}](name=kanacho,realm=NA,application-id=3ErqAdtq,discussion-id=V7A1o0zV,comment-id=0002000000000000,timestamp=2014-12-21T18:21:48.542+0000)\n>\n> Have you ever played AP mid sona... It's hilarious how broken the scaling is lol. Your damage is quite high for a large majority of the early-mid game, then you become super support late game being able to heal/shield people for huge numbers, your movement speed buff is really funny when combined with a Rylai's making Sona become a Kite master all while doing quite good damage late and super supporting her team big time.\n\nevery mid laner has more burst/higher damage than sona\n\nPS: if you you have 500+ ap you can heal for about 220\nare you trying to imply that healing for 200 hp is \"huge numbers\"? every other support doesnt need anywhere near 500ap to heal for a piss poor 200\n0 ap nami = heals as good as 500 ap sona","replies":[{"poster":"kanacho","date":"2014-12-21T20:21:05.800+0000","up_votes":2,"down_votes":8,"body":"Every TRADITIONAL* mid-laner yes. Because they are DESIGNED to do burst damage, that's what they do, they are mages/assassins. Sona's advantage is that she has tremendous early game poke power, coupled with ridiculous late-game sustain/buffs and CC (power chord, ulti, rylai's etc...)\n\nAlso Sona's healing increases with missing health and is NOT supposed to be used primarily for healing max health targets. Also she heals 2 targets at once, and has a fast CD on the heal. Don't try to just throw numbers around without looking at everything else surrounding them.","replies":[{"poster":"FFirebrandd","date":"2014-12-21T22:22:13.382+0000","up_votes":4,"down_votes":0,"body":"I love how you put in Rylai's in the list of her CC...\n\nAlso I see your Sona mid and raise you a Lux mid.\n\nLux has superior burst, superior wave clear, superior range, superior CC pre 6, a far more powerful AoE shield, and finally Lux's Q and E are both far better than Sona's E if you are either engaging or disengaging.  Literally the only thing Sona has on her is a heal and ult stun.","replies":[{"poster":"kanacho","date":"2014-12-21T22:24:39.380+0000","up_votes":1,"down_votes":5,"body":"Rylai's is quite useful IMO, and I'm not trying to argue that sona is the best MID ever. Lux is an ACTUAL mid, who was picked A LOT as a mid-lane carry not too many seasons ago and still is a pretty solid mid pick. She's got great poke and CC.","replies":[{"poster":"FFirebrandd","date":"2014-12-21T23:01:59.785+0000","up_votes":5,"down_votes":0,"body":"I'm not saying Rylai's is a bad item.  I'm saying you added the CC an item gives her into her list of CC when anyone can build it and arguably use it far better than her, seeing as her Q counts as an AoE ability and her ult's stun lasts the same amount of time as the slow.\n\nMy point about bringing up Lux mid is basically to say this.  Even if you really really want a mid with lots of utility, Sona is still a pretty poor choice.\n\nThat said if you pick her simply because you like her character/lore/playstyle then keep going for it.  I mean that's why I still play Lulu support.","replies":[]}]}]},{"poster":"Origami Kaiju","date":"2014-12-21T21:23:32.273+0000","up_votes":4,"down_votes":0,"body":"The person you are engaged in this Sona debate with is A Wild AP Sona   --> [Lolking](http://www.lolking.net/summoner/na/47540501)\n\nThey have over 1000 Sona games and is currently in diamond 1. \n\nI don't know how many sona games you have, but I think we can agree that personal experience with this champion alone should warrant some validity to their argument, wouldn't you say?\n\nJust something to think about...","replies":[{"poster":"kanacho","date":"2014-12-21T21:35:31.125+0000","up_votes":1,"down_votes":7,"body":"I rather not take a single person's word over numbers in this circumstance. He has shown no respect nor reason for me to actually believe him. Still not going to change my mind as of right now even if he was challenger tier and had 10k Games with Sona. High Elo people can be just as wrong as low elo. Personal experience has some merit, but doesn't give someone a free pass to say whatever they want and have it deemed to be 100% true.","replies":[{"poster":"TheSaltyScourge","date":"2014-12-21T22:38:21.687+0000","up_votes":3,"down_votes":2,"body":"Man youre fucking stupid.","replies":[{"poster":"kanacho","date":"2014-12-21T22:39:23.462+0000","up_votes":2,"down_votes":4,"body":"No I'm not, but you being toxic isn't an argument. Whenever people are on the other side of contentious arguments, it seems too often that way too many people degenerate to name-calling and other ridiculous things like this rather than discussing the topic. It doesn't even progress the conversation in any direction. First Lee and his nerfs, then Cassiopeia and her rework, now Sona and her discussion of more nerfs? I don't think it's ever warranted to act so disrespectful.","replies":[{"poster":"A Wild AP Sona","date":"2014-12-21T22:45:09.713+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=kanacho,realm=NA,application-id=3ErqAdtq,discussion-id=V7A1o0zV,comment-id=0002000000000000000100010001000000020000,timestamp=2014-12-21T22:39:23.462+0000)\n>\n> No I'm not, but you being toxic isn't an argument. Whenever people are on the other side of contentious arguments, it seems too often that way too many people degenerate to name-calling and other ridiculous things like this rather than discussing the topic. It doesn't even progress the conversation in any direction. First Lee and his nerfs, then Cassiopeia and her rework, now Sona and her discussion of more nerfs? I don't think it's ever warranted to act so disrespectful.\n\nyeah because anyone that says a champion that has literally been nothing but bullied since their release with 0 buffs and 10+ nerfs needs to learn how to play against the champion properly instead of asking them to be made completely unviable \n\njust because people cant land skillshots on a champion more squishy than a melee minion doesnt mean they can take it out on poor sona k thx\n\nanybody that goes into mid lane with sona  \"harasses\" someone out of lane could literally have done the same shit by going ap nami in mid","replies":[]}]}]},{"poster":"Origami Kaiju","date":"2014-12-21T21:51:00.100+0000","up_votes":5,"down_votes":0,"body":">High Elo people can be just as wrong as low elo.\n\nOkay, well fair point. \n\nI just wanted you to be aware of this information, in case you already weren't.","replies":[]}]}]}]}]}]}]}]},{"poster":"Pika310","date":"2014-12-20T06:33:22.328+0000","up_votes":17,"down_votes":3,"body":"> I don't know what it is about Sona where her players are never satisfied unless she is the strongest support in existence\n\nThis is just blatant harassment and libelous.  Before the \"rework\" (nerf), Sona was a C-class champion.  Not strong or weak, just there.  She served a fairly niche role that could be played as a comfort pick.  Nobody complained, not like we've seen these past 24 weeks.  Then she took a \"rework\" to the knee that robbed her of her identity and viability as a playable champ.\n\nMathematical facts can't be disproved, math is the only absolute in the universe.  At this point, I'd rather have a Taric on my team.  He still has his aura identity, pre-6 hard CC and double Sona's \"heal.\"","replies":[{"poster":"Meep Man","date":"2014-12-20T09:13:39.984+0000","up_votes":4,"down_votes":12,"body":"But can he put a 1.5 stun on the entire enemy team from a distance? And is he ranged? Calculate that.","replies":[{"poster":"Pika310","date":"2014-12-20T09:56:47.439+0000","up_votes":11,"down_votes":1,"body":"Congratz, you found the one object on Sona's entire kit that remained untouched by Fearless' nerfs.  I bet you probably want a cookie now.  However, it's not \"from a distance,\" especially if you're tagging \"the entire enemy team.\"  Why in this scenario the whole enemy team is clumped together, I have no idea.  No real players would do this.  Or even better, why did all 5 not jump on the squishiest champ in the game as she strolled up to them?  I'm so confused at how incompetent this hypothetical enemy team you created is.\n\nTaric's stun is 625 units, so yes.  He is ranged.  Especially considering Sona's slow is 550 units.  Taric has better range than Sona.","replies":[]}]}]},{"poster":"SecretAgentHulk","date":"2014-12-20T14:15:11.157+0000","up_votes":5,"down_votes":8,"body":"FFS, why all this outright hate for a dissenting opinion?! With pre-rework Sona, once I had {{item:3100}} {{item:3089}} could out-damage the ADC and almost out-burst the mage, and about the only champ I couldn't outrun in a pickle was Rammus. I think the rework was healthy, although I appreciate neither the mismatching cooldowns nor the subsequent nerfs.\n\nReworks that nerf are only a problem if the champion was in a good place to begin with. My experience is that she was OP.","replies":[{"poster":"It Is I Emoto","date":"2014-12-20T14:31:14.034+0000","up_votes":8,"down_votes":1,"body":"You're talking about her powerchord, and we're talking about her quite hard to utilize auras. As well, her second role is a mage, she's supposed to do tons of damage, so your argument is invalid in my opinion.","replies":[{"poster":"SecretAgentHulk","date":"2014-12-20T15:00:00.112+0000","up_votes":3,"down_votes":1,"body":"I didn't touch on her auras but I used them far more effectively than I've ever used power chord. Q for extra damage, W for reduced incoming damage, E to engage or disengage—all for the whole team. How is that hard?\n\nAlso the only viable build was mage. We can debate utility vs offensive mage, but she was worthless without AP, for casting, power chord, *and* auras. (Final edit: although with current nerfs she is now worthless *with* AP too, yay.)","replies":[{"poster":"It Is I Emoto","date":"2014-12-20T18:31:48.235+0000","up_votes":4,"down_votes":0,"body":"Are you talking about the previous or current auras?\nHer previous auras didn't scale with AP, but helped much more than her current ones, thats something I agree with you, and I'm complaining about the current auras being extremly weak and useless.\nI'm pretty sure you're talking about her pre-work auras, though, she was also aviable as utility/ap support, getting a mikaels and lich bane would've helped alot, and with the new version of the banner, she can be still be build as utility/ap supports whats great.. if her auras/kit would be any great now lmao","replies":[{"poster":"SecretAgentHulk","date":"2014-12-20T19:17:43.477+0000","up_votes":2,"down_votes":4,"body":"Her current auras are more powerful now to compensate for the fact that they are not permanent. (They seem to fall off late-game though. Q is arguably about the same at level 5 depending on your ADC's attack speed [and also doesn't buff mages \\*sad face\\*], W does not buff tanks as comparatively much, and E is much more powerful but only lasts 1.5sec.)\n\nThe only reason that the old auras were better was because they were permanent and further-ranged. In theory, I have no problem with moving the power to a shorter duration and range in exchange for more power. The meta today is to take an objective and run, and Sona's new auras excel at facilitating that. (Soraka is now more useful in a siege comp.) Like most of us, though, I don't understand why nerfs are still happening.\n\ntl;dr Sona's kit is mostly fine conceptually, it just needs to be tuned *up*, not nerfed *down*.","replies":[{"poster":"It Is I Emoto","date":"2014-12-21T14:07:05.852+0000","up_votes":6,"down_votes":0,"body":"I think small changes should be still made, like\nthat her Q aura damage applies on turrets,\nand make the shield actually any worth to be used. \n\nRight now, Sona is in a uncomfortable spot, mostly because she can't do anything except ulting in a enemy team, wich requires most the time a flash. I still play with her rework, and I need to spam my heal only to give my adc 50% of his max health. Basically, even the relic shield outheals Sonas heal if all charges are used.\n\nSonas kit has no focus on something, not in poke, not in heal, and not in speedboost. She's in need of utility buffs, otherwise Sona won't be a better pick than Nami.","replies":[{"poster":"SecretAgentHulk","date":"2014-12-21T14:37:40.665+0000","up_votes":4,"down_votes":0,"body":"Agreed.","replies":[]}]}]}]}]}]}]}]},{"poster":"Diostukos","date":"2014-12-20T04:26:25.589+0000","up_votes":2,"down_votes":1,"body":"It'd be cool if they gave her her passive stance effects back, but have them only apply to herself.","replies":[{"poster":"Pika310","date":"2014-12-20T04:37:29.269+0000","up_votes":14,"down_votes":1,"body":"Art is meant to be appreciated and enjoyed by other people.  Like a trumpeter, her purpose is to rally her team and boost their morale.  It'd be pointless if her music couldn't be heard by allies.  Buffing only herself sounds more like she has a song stuck in her head.","replies":[{"poster":"Diostukos","date":"2014-12-20T04:44:32.338+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Pika310,realm=NA,application-id=3ErqAdtq,discussion-id=V7A1o0zV,comment-id=00010000,timestamp=2014-12-20T04:37:29.269+0000)\n>\n> Art is meant to be appreciated and enjoyed by other people.  Like a trumpeter, her purpose is to rally her team and boost their morale.  It'd be pointless if her music couldn't be heard by allies.  Buffing only herself sounds more like she has a song stuck in her head.\n\nNo, I meant to give her the passive stance *on top of* the active auras she currently has.\n\nRight now she doesn't feel like a stance champion, which I miss.","replies":[{"poster":"Pika310","date":"2014-12-20T04:56:24.140+0000","up_votes":14,"down_votes":1,"body":"Yes, I assumed this is in fact what you implied.  I'm sticking to my previous response, but I will add onto it:\n\nSona's old kit was not \"toxic\" or difficult to balance.  Many champions give AD/AP/Def/MS, including: {{champion:267}} {{champion:61}} {{champion:40}}  and etcetera.  They aren't considered \"toxic,\" this was just an excuse Riot used to blatantly nerf Sona and remove her identity.  Even if her full auras were re-added on top of her current kit, she would still end up slightly weaker than before.  Her auras weren't the only thing she lost, the base stats on all of her abilities and her own individual base stats have also been nerfed as well.\n\nHypothetically, if they undid every nerf, kept her new on-activation non(auras) in addition to her real auras and formally apologized to her fanbase, she may just become competitively viable for the first time since mid-season 3.  She'd still be weaker than Thresh though.","replies":[]}]}]}]},{"poster":"Origami Kaiju","date":"2014-12-20T12:42:41.005+0000","up_votes":12,"down_votes":0,"body":"I sure do miss speeding up my little minions with Song of Celerity. :(","replies":[{"poster":"SecretAgentHulk","date":"2014-12-20T15:08:10.388+0000","up_votes":8,"down_votes":0,"body":"RIP 500-movespeed minions. I always bought the Captain's boot enchantment just for you. \\*sniff\\*","replies":[]}]},{"poster":"Diostukos","date":"2014-12-20T08:41:16.816+0000","up_votes":11,"down_votes":0,"body":"I actually just played as Sona/Corki vs Leona Ashe. \n\nBasically, once level 6 every time Leona had her ult all it took was either an Ashe R at point blank range, then followed by Leona's E+R.  Even if Ashe didn't have her ult Leona had to just land one little E then Ashe was free to kill me. \n\nOf course, Leona is one of Sona's hardest counters, so it makes sense the laning phase won't be a piece of cake. What does suck is that with the most recent nerfs on the pbe, trying to poke down leona will be much harder if not impossible. Any damage will just be mitigated by her natural defense+targon stacks.","replies":[{"poster":"AbodyHUN666","date":"2014-12-20T19:21:37.017+0000","up_votes":1,"down_votes":6,"body":"I think too much of her power is focused into her undodgable Q. I mean it's fair that a non skillshot ability shouldn't be so strong, but if you get jumped on you would hit a skillshot anyway.","replies":[{"poster":"A Wild AP Sona","date":"2014-12-20T20:00:51.086+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=AbodyHUN666,realm=EUNE,application-id=3ErqAdtq,discussion-id=V7A1o0zV,comment-id=00070000,timestamp=2014-12-20T19:21:37.017+0000)\n>\n> I think too much of her power is focused into her undodgable Q. I mean it's fair that a non skillshot ability shouldn't be so strong, but if you get jumped on you would hit a skillshot anyway.\n\n\"nonskill shot ability\"\n\nmeanwhile syndra/talon/zed point and click and instagib people\n\nskillshots dont count as skillshots when you are pointblank sorry","replies":[{"poster":"AbodyHUN666","date":"2014-12-20T21:48:10.240+0000","up_votes":1,"down_votes":5,"body":"I know it. All I'm saying is that, when sona is stronger than you she will dominate you unless you can jump at her reliably, and if you jump at her she will be dead.","replies":[{"poster":"Emmy Cha0s","date":"2014-12-21T04:07:08.816+0000","up_votes":10,"down_votes":1,"body":"> when sona is stronger than you \n\nExcept that a Sona can never be stronger than you.  Even a fed Sona is still a shit-poor useless champ.","replies":[]}]}]},{"poster":"Pika310","date":"2014-12-21T03:53:26.120+0000","up_votes":7,"down_votes":0,"body":"Sona's \"undodgable Q\" as you put it is 40 damage.  Nami's undodgable W is 70 damage.\n\n> I think too much of her power is focused into her undodgable Q. \n\nLOGIC.","replies":[]}]}]},{"poster":"Diostukos","date":"2014-12-20T07:44:14.195+0000","up_votes":10,"down_votes":0,"body":"At this point winrates shouldn't mean everything. Thresh has a 47% winrate; should he get buffs? Fuck no. He's been near pick or ban for the longest time in competitive scenes, and has the highest pick rate in the game. \n\nYes Sona has a good winrate, but her pick rate isn't like other supports. Supports like Leona, Janna, Thresh, Blitz have double or more her pickrate, while maintaining a good winrate.","replies":[]},{"poster":"Quort","date":"2014-12-20T03:40:03.287+0000","up_votes":10,"down_votes":0,"body":"I cant tell if youre arguing for buffs to Sona or nerfs to Nami. :P","replies":[{"poster":"Pika310","date":"2014-12-20T03:45:23.391+0000","up_votes":10,"down_votes":2,"body":"That's a fair assessment.  However, nerfing Nami won't make Sona viable.  That would just be a buff to Soraka, Taric, Alistar... Sona is so far down the list, it's absurd.  Besides, I'm tired of Riot's new motto: \"NERF! NERF! NERF!\"  It's been ages since we've seen a single champion get anything that can only be labeled as a \"buff.\"","replies":[{"poster":"EffectFX","date":"2014-12-20T05:12:27.821+0000","up_votes":6,"down_votes":5,"body":"Actually several champions have gotten straight buffs.","replies":[{"poster":"Williwaw87","date":"2014-12-20T05:48:19.936+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=EffectFX,realm=NA,application-id=3ErqAdtq,discussion-id=V7A1o0zV,comment-id=000000000000,timestamp=2014-12-20T05:12:27.821+0000)\n>\n> Actually several champions have gotten straight buffs.\n\nYeah! Like Lee and Yasuo and Lucian!!!","replies":[{"poster":"Pika310","date":"2014-12-20T06:35:00.642+0000","up_votes":5,"down_votes":1,"body":"> Yeah! Like Lee and Yasuo and Lucian!!!\n\nTouche, I meant it more in a metaphorical sense rather than a literal one, but I'll admit you've proven me wrong.","replies":[]}]},{"poster":"Rinky Dinky","date":"2014-12-20T08:49:42.936+0000","up_votes":6,"down_votes":3,"body":"idk why people are downvoting this. Its true.","replies":[{"poster":"Pika310","date":"2014-12-20T10:01:56.523+0000","up_votes":9,"down_votes":2,"body":"Except for the facts that:\n\n1. he's a player infamous on both the old forums and the current boards for intentionally trolling for at least the past half year unceasingly\n2. and he's attempting to disprove a metaphor, or rather a general rule.  Rules have exceptions, that goes without saying, yet he's saying it regardless as though it somehow is discrediting in some sort of way.","replies":[{"poster":"EffectFX","date":"2014-12-20T10:38:45.555+0000","up_votes":3,"down_votes":7,"body":"I don't think you know the definition of trolling. You made a false statement and I corrected you (again). \n\nA better phrase would have been \"Besides, I'm tired of Riot's new motto: \"NERF! NERF! NERF!\" since nowadays it feels like we see more nerfs than buffs.\"\n\nI still disagree with that notion, but that would have been better.","replies":[]}]}]}]}]}]}]}