{"poster":"ZWÄG","date":"2016-11-15T20:12:48.536+0000","title":"Syndra Nerf?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Syndra zu OP? W&uuml;rde gerne eure Meinung h&ouml;ren!\r\n {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"1951298","date":"2016-11-15T22:34:45.993+0000","up_votes":2,"down_votes":1,"body":"Finde es ein wenig unfair, dass sie für das Verfehlen von Spells nicht allzu krass bestraft wird. Meistens genügt es schon einen Spell zu treffen und R zu drücken, um nen Squishy ausm Leben zu pusten... fühlt sich einfach nur sehr unfair an, dagegen zu spielen.","replies":[{"poster":"Sakuraveil","date":"2016-11-18T01:56:52.671+0000","up_votes":3,"down_votes":0,"body":"Das ist quatsch. Wenn du dein zeug verfehlst bist du tot. Dann ist alles auf cd und du hast kein escape. Selbst wenn ich r Drücke tötet dich das nicht.\nIm late entscheidet dein stun ob du tötest oder getötet wirst.\n\nWas mir allerdings auffällt ist das verhalten wenn man gegen syndra spielt (maine sie). Die laner merken teilweise nicht dass man offensichtlich seine ulti vorbereitet. Das argument mit R=Tot ist totaler quatsch. Du musst deine q´s erstmal hinlegen. Und es tut mir leid wenn du mich seelenruhig 3x mal q´s hinlegen lässt und dann noch auf die idee kommst zu engagen bist du selber schuld das du eine ult+3 bälle frisst. Wenn ich gegen sie spiele weis ich ganz genau wie sie wann was machen will und ziehe mich zurück bei zu viel q oder nem w bait. Der rest ist dodge, da gibts bedeutend einfachere stuns die ich anbringen kann mit anderen champs.\n\nFakt ist du stirbst bei allen champs wenn sie die volle rotation auf dich treffen. Ne lux ballert dich 4 mal zurück zum inhib wenn du alle 2 spellst frisst und die ulti reingedrückt bekommst. Gleiches spiel. Dodge oder stirb, so wie bei fast jedem mage.\n\nDas einzige eventuell fragwürdige ist die derzeitige lage mit dem W. Wenn 3 bälle in der hand hast ist für dich rennen angesagt sonst bist weg.\nAber selbst da gibt es atm 10-15 champs die das gleiche können","replies":[]}]},{"poster":"Cayce","date":"2016-11-16T00:50:23.708+0000","up_votes":3,"down_votes":0,"body":"Ich könnte mir vorstellen, dass Riot sich mit einem Syndra Nerf zurückhält, um abzuwarten, wie sie sich gegen die neuen Assassins behauptet und wie das Meta sich verändert.\n\nIch hoffe nur, dass wenn sie Syndra nerfen, sie es bei Zahlen belassen. Ich erinnere mich da an das Ende von Season 4, als sie den Champion effektiv getötet hatten, weil sie die E-Hitbox ein bisschen schmaller machen wollten. Ergebnis war, dass man selbst Gegner die auf einer Kugel draufstanden nicht sicher stunnen konnte. Als damaliger Syndra-Main tat das echt weh :'D","replies":[{"poster":"Staatsanwalt","date":"2016-11-16T12:10:53.355+0000","up_votes":1,"down_votes":1,"body":"Ich finde, es sollte einfach der Schaden der Ulti verringert werden. Sie muss momentan nur eine Kugel treffen, eventuell nen Stun und danach die Ulti. Da kippen Adcs und Assassinen aus den Latschen. Für eine Point und Klick ulti defintiv zuviel schaden finde ich. Aber Veigar is ja genauso.","replies":[]}]},{"poster":"V3IG4R HQ","date":"2016-11-16T12:06:08.032+0000","up_votes":1,"down_votes":0,"body":"Würde nicht sagen OP, aber krebsfördernd. Als würde dir jemand noch etwas Salz in die offene Wunde streuseln. \nUnd das liegt imo einfach nur an der Ult. Eine Ult, die nichtmal ein Skillshot ist und kein Counterplay bietet (abgesehen von Zhonyas und nein, ich baue als ADC nicht Zhonyas) darf nicht 80% DMG machen. Wie dumm ist das denn? Reicht schon wenn man schön sick alles dodged und dann trotzdem plötzlich der long range stun into death kommt (LRSID).  Deshalb bin ich der Meinung, dass man ihre Ult reworken sollte. Alles andere kann man von mir aus so belassen.","replies":[]},{"poster":"Kata Ga Kill","date":"2016-11-15T21:15:01.579+0000","up_votes":1,"down_votes":1,"body":"Finde sie ok. \nSie hat dafür auch 0 Escape und 0 DEF.\n\nUnd das sie so OP ist liegt daran das die meisten keine MR bauen auf der Lane\n {{item:3156}} {{item:3814}} {{item:3001}} {{item:3065}} {{item:3111}} ","replies":[]},{"poster":"CCG Juuzou","date":"2016-11-15T20:45:17.495+0000","up_votes":2,"down_votes":2,"body":"Wäre mal langsam angebracht ja","replies":[]}]}