{"poster":"CLAÁÁAAAAAAAAAAA","date":"2018-02-12T01:23:18.686+0000","title":"Si van a cambiar algo haganlo bien.","subforum":"Charlas Generales","up_votes":3,"down_votes":3,"body":"Cuando llegaron las runas nuevas algo me incomodo no es la jugabilidad si no que es la falta de creatividad y dise&ntilde;o\r\nPor ejemplo al ver &quot;Electrocutar&quot; me puse mal ya que de pasar a Decreto se&ntilde;or del trueno y su icono a pasar a un rayo todo rojo y de nombre electrocutar me ha incomodado bastante ya que yo soy bastante visual.\r\n\r\nOtro tambien ha sido el cambio de la Tabla de puntuacion cuando llego el 8.3 vi la tabla y me quede mal porque el dise&ntilde;o lo empeoraron letras mas chicas y ese signo de interrogacion cuando un enemigo no esta en vision es algo que se me hizo feo ya que ese dise&ntilde;o no viene al juego al igual que los hechizos de invocar los achicaron .\r\n\r\nCuando un aliado o enemigo hace un asesinato en racha o un simple asesinato, objetivos se achicaron las letras de la informacion y siento que no destaca en la partida al igual que el icono de cualquier campeon al hacer objetivos se sale del marco azul o rojo dependiendo del equipo\r\n\r\nBueno se que puede ser exagerado este foro pero pienso que en el dise&ntilde;o lo empeoraron y deseaba sacar lo que sentia al respecto de esto bueno bai.{{champion:141}}","replies":[{"poster":"Hnk Kenshiro","date":"2018-02-12T01:28:13.089+0000","up_votes":4,"down_votes":0,"body":"> un rayo todo rojo y de nombre electrocutar me ha incomodado bastante \n\n\nLos rayos electrocutan :p","replies":[{"poster":"CLAÁÁAAAAAAAAAAA","date":"2018-02-12T01:29:35.062+0000","up_votes":1,"down_votes":3,"body":"De pasar a decreto señor del trueno a electrocutar xDDD lo que digas","replies":[]}]},{"poster":"pepi99 manc0","date":"2018-02-12T03:16:01.918+0000","up_votes":1,"down_votes":0,"body":"el signito ese no tiene ni sentido, es mejor mirar el mapa que guiarte por el tab si el enemigo esta en vision o no","replies":[]},{"poster":"GDPhyros","date":"2018-02-12T02:44:05.434+0000","up_votes":1,"down_votes":0,"body":"si hablas de diceño el cliente nuevo no me gusta desde el principio, an cambiado cosas y mejorado pero aun no me gusta.\ncon respecto a la interface me gustaria mover cosas con mas libertad.\n\ny con respecto a lo del rayo... me parecio un desborde de creatividad el nombre y el icono.","replies":[]}]}