{"poster":"Wolf ToddStar","date":"2019-01-12T11:13:18.915+0000","title":"My problem with AR modes","subforum":"Gameplay","up_votes":1,"down_votes":1,"body":"OK HERE WE GO:\r\nI start of by getting the EXACT champion i have been waiting for throughout the day right playing maybe 14 games of urf or aram and then this ONE person gets janna or something and leaves the game. Then i enter another game where i am placed as soraka, rerolls and ends up with another bad or &quot;notfuntoplay&quot; champion \r\n\r\nSOO MY GREAT BRAIN CAME UPP WITH:\r\n\r\nIf a person leaves your game you should have the option to pick the champion u had the last time u were in a lobby but ONLY if someone nonpremade left the game:)","replies":[{"poster":"Sister meow","date":"2019-01-12T16:27:57.883+0000","up_votes":1,"down_votes":0,"body":"it would be nice if they could have actual urf instead of reddit urf on the rotation of modes","replies":[]},{"poster":"KFCeytron","date":"2019-01-12T11:19:45.744+0000","up_votes":1,"down_votes":1,"body":"People who want to play a certain champion shouldn't be playing modes where they can't do that.","replies":[{"poster":"Wolf ToddStar","date":"2019-01-12T11:49:29.950+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KFCeytron,realm=NA,application-id=3ErqAdtq,discussion-id=ZbXuLd6q,comment-id=0000,timestamp=2019-01-12T11:19:45.744+0000)\n>\n> People who want to play a certain champion shouldn&#x27;t be playing modes where they can&#x27;t do that.\n\nwell im mainly hinting to my experience in urf here, i realy enjoy the mode (besides the new cannon which is breaking the game) but people keep quitting because they didnt get a champ that they wanted whilst i get the EXACT one i want and then right after soraka...","replies":[{"poster":"KFCeytron","date":"2019-01-12T12:13:16.487+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wolf ToddStar,realm=EUNE,application-id=3ErqAdtq,discussion-id=ZbXuLd6q,comment-id=00000000,timestamp=2019-01-12T11:49:29.950+0000)\n>\n> well im mainly hinting to my experience in urf here, i realy enjoy the mode (besides the new cannon which is breaking the game) but people keep quitting because they didnt get a champ that they wanted whilst i get the EXACT one i want and then right after soraka...\n\nInstead of thinking of it as a mode you like with some components you dislike, think of it as a mode you're not interested in with some components you might possibly have liked.","replies":[]}]}]},{"poster":"Dynikus","date":"2019-01-12T11:25:38.918+0000","up_votes":1,"down_votes":0,"body":"If would be nice if they would put champions you rolled before someone dodged in the pool you could pick from at the top of the screen, but I'm not sure how feasible that really is.","replies":[]}]}