{"poster":"DonObelixx","date":"2015-05-05T14:01:47.024+0000","title":"Lösung Leaver Problem Ranked","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":12,"body":"so hier mal ein l&ouml;sungsansatz:(im ranked) \r\nafk/leave  ab einer dauer von 5 minuten  bedeuten - 30 lp oder die promo ist verloren. diejenigen die in der promo sind d&uuml;rfen das spiel wiederhohlen. wenn man sich nicht in der promo befindet verliert man 10 lp oder so.\r\nf&uuml;r den duoq partner des leavers gellten die selben strafen.\r\nwenn man 2 mal hintereinander afk geht verliert man statt 30, 60 lp und bekommt obendrauf 1 tag nen bann.\r\nnach 3 mal afk/ leaven inerhalb von 3 tagen krigt man eine woche bann und wird eine division zur&uuml;ck gesetzt. bzw eine ganze liga wenn man z.B. silber V ist.\r\n\r\nund f&uuml;r diejengen, die einfach dumm rumstehen und sich ab undzumal bewegen:\r\nwenn diese person sagen wir mal 4 lvl (als midlaner) unter den anderen ist und einen dementsprechenden farm hat \r\n sollte das system das als afk einstufen und eine dementsprechnde warnung anzeigen. \r\nwenn sich nichts am lvl , an der kd und am farm ver&auml;ndert hat checkt das das system und mann wird als leaver betrachtet.\r\n\r\nalles unter 5 minuten sollte noch nicht bestraft werden, da es sich um einen dc handeln k&ouml;nnte. \r\nkomm nun jemand auf die tolle idee 100000 mal auf altf 4 und reconect zu spammen, merkt es das system auch wieder.\r\n\r\n\r\ndas ist mein l&ouml;sungsansatz. \r\nes kann nat&uuml;rlich alles diskutiert werden\r\nalso haut mal eure meinung raus\r\n\r\nmit freundlichen gr&uuml;&szlig;en","replies":[{"poster":"HyperionCH","date":"2015-05-05T14:09:37.185+0000","up_votes":2,"down_votes":0,"body":"Der Vorschlag hat viele Nachteile:\n\n- Wenn der Spieler technische Probleme hat, dessen Behebung etwas länger als 5 Min. dauerte, dann wird er keine Motivation mehr haben, zu reconnecten. Es ist jedoch möglich, z.B. weil man in Führung lag, das Game zu retten. Aber dies hilft ihm ja dann nicht mehr.\n\n- Der DuoQ-Partner wird auch zusätzlich bestraft, nur weil dieser Spieler ein technisches Problem hatte.\n\n- Ein temporärer ban hilft oft nicht. Dies kann mit einem smurf ausgesessen werden.\n\n\nZudem hast du dies hier nicht berücksichtigt:\n\n- Wer öfter leaved, wird bereits jetzt bestraft (mit längerer Warteschlange)\n\n- Der Leaverbuster erkennt bereits jetzt alle Spieler, die nur in der base (oder sonst wo) herum laufen.","replies":[{"poster":"drexxsack","date":"2015-05-05T14:27:59.617+0000","up_votes":2,"down_votes":0,"body":"Hinzu kommt, dass ein massives Eingreifen in die LP-Verteilung eigentlich immer eine MMR-Koppelung benötigt. In die  MMR wird manuell allerdings nicht eingegriffen, da die Nachteile einfach zu massiv sind.","replies":[{"poster":"HyperionCH","date":"2015-05-05T14:48:18.516+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=drexxsack,realm=EUW,application-id=KYnfKGf0,discussion-id=6vOKlQb4,comment-id=00000000,timestamp=2015-05-05T14:27:59.617+0000)\n>\n> Hinzu kommt, dass ein massives Eingreifen in die LP-Verteilung eigentlich immer eine MMR-Koppelung benötigt. In die  MMR wird manuell allerdings nicht eingegriffen, da die Nachteile einfach zu massiv sind.\n\nNein, es ist nichts zwangsweise eine MMR-Kopplung nötig.\nAber ohne MMR-Kopplung ist jeder LP-Abzug sinnlos, da die LP-Verteilung den Trend hat, den Spieler möglichst an seine wahre MMR (Hidden Elo) zu ziehen.\n\nBeispiel beim Autofahren:\n\n- Alle Spieler fahren mit 150 km/h 2h lang.\n- Spieler X wird bestraft und darf die erste Stunde nur 100 km/h fahren, dann hingegen fährt er eine Stunde lang mit 200 km/h (z.B. da kaum mehr Autos auf der Strasse)\n\nNach 2h Fahrtzeit sind alle Spieler (inkl. Spieler X) 300 km gefahren. Trotz der Bestrafung ist Spieler X nicht weiter hinten.\n\nBei der LP-Verteilung wäre es (ohne MMR-Kopplung) gleich:\nDer zusätzliche LP-Abzug (aka Strafe) wirkt sich für die nächsten Spiele positiv auf die LP-Verteilung aus (mehr LP bei Sieg, weniger LP-Verlust bei Niederlage). Nach einigen Rankeds ist die Strafe wieder völlig eliminiert.","replies":[{"poster":"drexxsack","date":"2015-05-05T14:54:57.680+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"HyperionCH","date":"2015-05-05T15:03:44.504+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=drexxsack,realm=EUW,application-id=KYnfKGf0,discussion-id=6vOKlQb4,comment-id=0000000000000000,timestamp=2015-05-05T14:54:57.680+0000)\n>\n> Es ist interessant, dass du den Grund, der die Koppelung nötig macht, selbst nennst und dennoch sagst, dass es nicht so ist ;)\n\nTechnisch gesehen (bzw. auch kurzfristig) ist eine MMR-Kopplung nicht zwingend nötig. Sie macht einfach längerfristig nur keinen Sinn.\n\nWir haben uns offensichtlich nur missverstanden, ob die Notwendigkeit der MMR-Kopplung technischer Natur ist (aka Machbarkeit) oder effektiver Natur (aka damit überhaupt ein (langfristiger) Effekt entsteht).\n\nIch dachte, du meintest ersteres (technische Machbarkeit). Bei Letzterem sind wir uns natürlich einig.","replies":[{"poster":"drexxsack","date":"2015-05-05T15:16:47.444+0000","up_votes":3,"down_votes":0,"body":"Deswegen hatte ich es gelöscht. Mir ist aufgefallen, dass ich vllt. etwas genauer hätte sein sollen","replies":[]}]}]}]}]}]},{"poster":"Temudschinn","date":"2015-05-06T09:14:31.449+0000","up_votes":2,"down_votes":0,"body":"Der leaverbuster ist doch ausreichend? Wiederholtes leaven wird schon jetzt sehr schnell bestraft. Und das erste leaven ist nicht vorhersehbar und lässt sich somit nicht verhindern.","replies":[]},{"poster":"eingew","date":"2015-05-05T17:21:54.804+0000","up_votes":2,"down_votes":0,"body":"Höhere Strafen sind nicht immer sinnvoll.\n\nVergleich mal die Kriminalitätsrate in Amerika mit der in Deutschland.\n\nUnd jetzt das Strafmaß.\n\nFällt dir was auf?","replies":[{"poster":"hshtagniemehrcdu","date":"2015-05-06T08:29:46.650+0000","up_votes":1,"down_votes":1,"body":"Mir fällt vor allem auf, dass dieser \"Vergleich\" eigentlich ziemlich bescheuert ist.\nEs gibt weitaus mehr Einflussfaktoren auf die Verbrecherrate als das Strafmaß, wie in diesem.... Vergleich... vorgeschlagen wird.\n\nEin Beispiel: In Deutschland kann man Arbeitslosengeld beziehen wenn man seinen Job verliert, in Amerika wird das soweit ich weiß etwas schwieriger. Ohne Einkommen ist die Versuchung ein Verbrechen zu begehen weitaus höher als mit ALG, oder?\nInteressant wäre es wenn man Staaten mit sehr ähnlichen Lebensstandart und Gesetzen mit Todesstrafe mit einem anderem Staat ohne Todesstrafe z.b. vergleicht, vielleicht könnte man daraus eine Aussage ableiten.\n\nHöhere Steuern z.b. können sowohl zu höheren als auch zu niedrigeren Einnahmen führen, je nachdem, auf welchem Punkt der Lafferkurve man sich befindet.\nhttp://www.fuw.ch/wp-content/uploads/2014/06/Laffer_Kurve_28062014_klein.jpg\n\nMit dem Strafmaß wird es ähnlich sein.\n\nEinfach zu sagen: Höhere Strafen führen nicht zu niedrigerer Verbrechensrate, siehe Amerika! ist eine Aussage völlig ohne Wert,\nda viel zu allgemein und viel zu viele Faktoren unberücksichtigt werden.","replies":[{"poster":"eingew","date":"2015-05-06T10:07:43.585+0000","up_votes":1,"down_votes":0,"body":"Genau darum geht es doch... es bringt nichts einfach das Strafmaß zu erhöhen und deshalb ist Amerika für mich immer ein gutes Beispiel gewesen, gerade weil hohe Strafen nichts an der Situation ändern. Dazu muss man eben mehr tun, bei Verbrechen sind das andere Dinge, in LoL müssen die \"Verbrecher\" eben einsehen, dass sie etwas falsch gemacht haben. Deshalb zielen alle Systeme von Riot schließlich auf Verbesserung ab, statt einfach zu bestrafen und möglichst schnell permanent zu bannen. Genau das ist ja gemeint.\n\nEs müssen immer mehr Faktoren als die Strafe berücksichtigt werden. Nicht umsonst gibt es bei LoL noch zusätzlich den Weg der Beschwörer, der immer verlinkt wird, und natürlich das Tribunal mit den Reformkarten, um die Rückmeldung möglichst ausführlich zu machen. Dazu kommen noch die kleinen Sprüche im Ladebildschirm, die btw überraschend viel ausmachen, ich glaube das waren teilweise bis zu 10% weniger Reports pro Spiel.\n\nDeshalb habe ich Amerika genommen, eben weil dort sehr hohe Strafen existieren, Übertreibungen wie Gefängnisstrafen für zu schnelles Fahren helfen nun mal nicht wirklich. (Und sowas hat btw nur wenig mit schlechtem Sozialsystemen zu tun. Auch die Todesstrafe für Mord, der eben nicht nur als Raubmord geschieht, ist absurd hoch, Racheakte helfen eben nicht. Und das sind die Gründe, weshalb ich Amerika gerne als Beispiel nehme. Resozialisierung, möglichst schon vor der Tat wäre dort eine Möglichkeit. Oder bessere Aufklärung bei Verkehrssündern. In Deutschland klappt das schließlich auch recht gut.\n\nIch meine, ich will den Einfluss der Sozialssysteme gar nicht absprechen, aber um diese Verbrechen ging es mir nicht primär.)","replies":[{"poster":"hshtagniemehrcdu","date":"2015-05-06T15:21:07.397+0000","up_votes":1,"down_votes":0,"body":"Okay, dann wähle ich einen anderen Ansatz...\n\nDeine Aussage ist, das eine Erhöhung eine Erhöhung des Strafmaßes keinen Einfluss auf die Verbrechensrate hat, richtig?\nDiese Aussage belegst du damit, dass es in Amerika höhere Strafen, z.b. die Todesstrafe gibt, die Verbrechensrate dennoch höher ist, korrekt?","replies":[{"poster":"eingew","date":"2015-05-06T15:39:33.109+0000","up_votes":1,"down_votes":0,"body":"Nicht keinen, aber oft eben nicht den gewünschten der Abschreckung. Zu geringe Strafen sind schließlich keine Ursache von schlechtem Verhalten, deshalb helfen zu hohe Strafen auch nicht, weil sie falsch Ansetzen. Amerika war ein Beispiel dafür. Wobei ich natürlich kein Experte bin, der immer das perfekte Beispiel herauspickt ;)","replies":[]},{"poster":"drexxsack","date":"2015-05-06T15:31:13.292+0000","up_votes":1,"down_votes":0,"body":"Du missverstehst die Aussage ganz gewaltig. Die Aussage ist:\nDie Höhe der Strafe beeinflusst nicht direkt die Höhe der Kriminalitätsrate.\nDas ist eigentlich Humpels bereich, weshalb er eigentlich der Richtige für diese Art der Diskussion wäre(und auch direkt Quellen hätte :/ ).\nEs ist ziemlich gut untersucht, dass höhere Strafen nicht nur nicht zwangläufig für weniger Straftaten sorgen, sondern auch den gegenteiligen Effekt haben können(wenn man nichts mehr zu verlieren hat und so weiter). \nIm Grunde sagt ihr beide das Gleiche: Es gibt mehr Faktoren, als nur die Höhe der Strafe, die die Effektivität der Strafe bestimmen.\nBestes Beispiel: Die Chatrestriktion.\nEigentlich eine mildere Strafe als ein Bann, ist sie effektiver, wenn es um \"Besserung\" geht.","replies":[]}]}]}]}]},{"poster":"DonObelixx","date":"2015-05-05T17:52:24.517+0000","up_votes":1,"down_votes":1,"body":"die hohe kriminalitätsrate in den usa hat nichts mit zu hohen strafen zu tun.","replies":[{"poster":"eingew","date":"2015-05-05T18:16:42.312+0000","up_votes":1,"down_votes":0,"body":"Das ist die Erkenntnis die ich wollte! Genau richtig! :)\n\nHohe Strafen führen eben nicht zu einer Besserung, im Gegenteil, viel öfter führen sie zu Trotz und damit zu einem Auflehnen gegenüber der Strafe, was zu noch mehr Fehlverhalten führt. Viel besser sind also kleinere und nicht so harte Strafen, die aber dennoch einen Einfluss auf einen haben. Dadurch führt man die Spieler viel eher zur Einsicht, was natürlich das hauptsächliche Anliegen ist, um eine Besserung zu erzeugen.\n\nIch denke also, du setzt falsch an um Leaves zu verringern. Viel sinnvoller wäre es, dem Thema mehr Aufmerksamkeit zu schenken und dafür zu sorgen, dass jeder weiß, dass dies falsch ist, denn Strafen haben wir bereits.","replies":[]}]},{"poster":"Sirrkas","date":"2015-05-05T14:25:22.129+0000","up_votes":1,"down_votes":0,"body":"Was ist wenn man ohnehin nur 10 LP bei einer Niederlage verlieren würde? Solche Spieler hätten nicht einmal einen Vorteil von deinem Vorschlag.","replies":[]},{"poster":"DonObelixx","date":"2015-05-05T16:19:16.451+0000","up_votes":1,"down_votes":3,"body":"klar haben leute mit schlechten internet nachteile.\naber warum spielt man dann überhaupt wenn man weiß das in 10 min wieder nichts geht.\ndas ist einfach unfair wegen solchen leuten unnötig zeit zu vergeuden. ich hab ja nichts gegen verlieren. aber bei sowas ist es einfach nur nervig\nda hätte ich inder zwischenzeit auch lernen können oder einen film schuane/trainieren etc. aber stattdessen spielt man 20 min, liegt vorne und dann leaved jemand und kommt nimmer wieder.\nda finde ich diese strafen angemessen.\ndenn sind wir mal ehrlich, es ist fast unmöglich  ein 4 vs 5 zu gewinnnen.\nda müssen sich die 5 schon verdammt blöd anstellen.\n\ndas mit der mmr hast du recht\ndie sollte dann natürlich auch angepasst werden.\nobwohl ich denke das das nicht nötig ist.\nbei strengen strafen werden es die leute schon lernen hehe ^^","replies":[{"poster":"HeTossMySalade","date":"2015-05-07T13:01:54.694+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DonObelixx,realm=EUW,application-id=KYnfKGf0,discussion-id=6vOKlQb4,comment-id=0002,timestamp=2015-05-05T16:19:16.451+0000)\n>\n> klar haben leute mit schlechten internet nachteile.\n> aber warum spielt man dann überhaupt wenn man weiß das in 10 min wieder nichts geht.\n> das ist einfach unfair wegen solchen leuten unnötig zeit zu vergeuden. ich hab ja nichts gegen verlieren. aber bei sowas ist es einfach nur nervig\n> da hätte ich inder zwischenzeit auch lernen können oder einen film schuane/trainieren etc. aber stattdessen spielt man 20 min, liegt vorne und dann leaved jemand und kommt nimmer wieder.\n> da finde ich diese strafen angemessen.\n> denn sind wir mal ehrlich, es ist fast unmöglich  ein 4 vs 5 zu gewinnnen.\n> da müssen sich die 5 schon verdammt blöd anstellen.\n> \n> das mit der mmr hast du recht\n> die sollte dann natürlich auch angepasst werden.\n> obwohl ich denke das das nicht nötig ist.\n> bei strengen strafen werden es die leute schon lernen hehe ^^\n\nNein werden sie nicht. Was juckt mich mein Smurf wo nur 2 Wochen Levelzeit drin stecken mehr nicht. Wenn ich das System konsequent ausnutzen wöllte, wie du es ´beschrieben hast, hab ich dadurch eher Vorteile als Nachteile.","replies":[]}]}]}