{"poster":"Blezzy","date":"2016-07-12T15:05:52.896+0000","title":"Team sucht Jungle MAIN Gold","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hi, wir sind Team Vordex, bereits 4 premades und suchen noch einen MAIN jungler, der seine Rolle verstanden hat und gut beherrscht. Wir sind alle mindestens 16 Jahre alt und haben einen TS3 server und eine eigene Whatsapp Gruppe. Du solltest auch am besten whatsapp haben, da wir dort immer alles was wichtig ist besprechen und Ts ist pflicht.\r\n\r\nDu solltest:\r\n-Am besten gold sein\r\n-Deine Rolle sehr gut beherrschen, richtiger Jungle main sein\r\n-16+ Jahre alt sein\r\n-TS besitzen\r\n-Am besten whatsapp f&uuml;r die gruppe\r\n-Mindestens im guten silber bereich sein\r\n-Jeden tag online sein (wichtig)\r\n-Die meta im &uuml;berblick haben\r\n-ggf. shotcallen\r\n-Viel reden, da es sonst lw ist, wenn es so still ist\r\n-Unser Ziel ist f&uuml;rs erste Gold 5 (sind silber 2 und Silber 1)\r\n-Wenn wir 5 sind, machen wir feste Trainingszeiten (dynamicQ) und feste zeiten f&uuml;r Teamranked ab\r\nBitte adde mich nur, wenn du diese voraussetzungen wirklich erf&uuml;llst :)\r\nWenn du bock auf ein Team hast, welches aktiv ist, tryhardet und spa&szlig; am spiel hat, adde mich bitte ingame.\r\nBlezzy","replies":[{"poster":"iTzPentaEz","date":"2016-07-12T15:11:22.064+0000","up_votes":1,"down_votes":0,"body":"Ich bin Challenger und würde mich als jngler in meinem smurf der Unranked ist anbieten: iTzPentaEz","replies":[{"poster":"Blezzy","date":"2016-07-12T15:18:24.828+0000","up_votes":1,"down_votes":0,"body":"haha ne danke ^^","replies":[]}]},{"poster":"TheBigBug","date":"2016-07-12T18:21:22.397+0000","up_votes":0,"down_votes":1,"body":"Ich würde mich gerne dafür anbieten da mein jetziges Ranked Team ziemlich inaktiv geworden ist. Ich bin 16 Jahre alt, hardcore {{champion:79}}  main, kann aber auch noch ein paar andere Jungler. Zur Not spiel ich auch auf der Midlane. Ich bin warscheinlich jeden Tag online außer im Urlaub (15.07-25.07).\nIch würde mich über eine Antwort sehr freuen","replies":[]}]}