{"poster":"Lord Babkonzerv","date":"2019-07-24T22:23:24.004+0000","title":"Veterán fórumozók, mi hoz vissza még mindig a fórumra?","subforum":"Általános beszélgetés","up_votes":3,"down_votes":0,"body":"Őszintén kérdezem ezt mindazon fórumozóktól, akik már több mint 2 éve járnak fel ide, ha nem is rendszeresen, de mondjuk pár hetente egyszer: mi miatt jártok még mindig vissza a fórumra? \r\n\r\nRégebben én is sokat jártam errefelé, aki 2 éve fórumozott még emlékezhet a gagyi kis champion koncepcióimra meg fanfiction kísérleteimre. Nem voltak különösebben jók, de mindig érkezett visszajelzés a közösség felől: építő jellegű kritika, pár dicsérő szó vagy egy kis baráti csevej. Úgy éreztem, hogy volt értelme visszajárni, egy közösség részének éreztem magam. Számos barátot is szereztem a fórumon, akikkel Discordon mai napig beszélek. \r\n\r\n2 éven keresztül gyakori látogatója voltam a fórumnak, aztán pedig valahogy abbamaradt ez a szokásom. Daedelusék távoztak a cégtől, a közösség pedig szép lassan elfogyott. Nemin próbálta még életben tartani a fórumot (ha más modok nem is), de az már nem volt az igazi. Aztán kilépett ő is és azóta halott az egész, pang a fórum. Ebben a helyzetben semmi értelmét nem látom annak, hogy bárki bármikor is felnézzem. \r\n\r\nSzóval ezért kérdelek titeket, veterán fórumozókat, mi hoz még mindig vissza benneteket?","replies":[{"poster":"Shikaichi","date":"2019-07-25T12:03:54.898+0000","up_votes":3,"down_votes":2,"body":"Az igazság az, hogy én még mindig itt vagyok, és próbálom valamennyire fenntartani a fórumot, akinek tudok és lehet annak segíteni. Szóval az, hogy Nemin volt az utolsó, aki megpróbálta életben tartani a fórumot, ez nem igaz.\nAzzal viszont egyetértek, hogy kevesebb az aktivitás már itt. Ennek szerintem egyszerűen az lehet az oka, hogy az emberek sokkal kényelmesebb megoldásokat találnak, ahol például nem kell folyton frissíteni az oldalt, hogy lásd az új üzeneteket vagy sokkal egyszerűbb hozzászólni egy adott témához/poszthoz.","replies":[{"poster":"AsD The Dreamer","date":"2019-07-25T21:55:57.465+0000","up_votes":2,"down_votes":6,"body":"Már nem azért de ha összevetjük a te általad indított témákat és Nemin által indított témákat akkor látszik, hogy ez nem teljesen igaz.","replies":[{"poster":"Zooty","date":"2019-07-25T22:00:52.266+0000","up_votes":6,"down_votes":2,"body":"Már nem azért de Shikaichi rengeteget dolgozik a fórumon, hatalmas időmennyiséget szán arra hogy válaszoljon lehetőleg mindenkinek.","replies":[{"poster":"AsD The Dreamer","date":"2019-07-26T06:32:06.500+0000","up_votes":2,"down_votes":6,"body":"Mivel ez a dolga? Az életben tartás kicsit különbözik attól (legalábbis szerintem), hogy válaszol kérdésekre és problémákra, ami az ő feladata. Nem azt mondom, hogy szart se csinál de szerintem Nemin messze jobb volt benne.","replies":[{"poster":"Shikaichi","date":"2019-07-26T11:35:35.784+0000","up_votes":5,"down_votes":1,"body":"Tegyük hozzá, hogy ez egy önkéntes munka, amit a saját szabadidőmben csinálok, egyáltalán nem kötelességem az egész. De úgy érzem, hogy az ide fellépő embereknek szükségük van segítségre, támogatásra, amit én szívesen adok meg nekik, hiszen lételemem az ilyesmi. :)","replies":[]}]}]}]}]},{"poster":"Zooty","date":"2019-07-25T21:50:51.278+0000","up_votes":2,"down_votes":0,"body":"Néha van finom süti! 🍪","replies":[]},{"poster":"Jack Eron","date":"2019-07-26T16:05:10.702+0000","up_votes":1,"down_votes":0,"body":"Könyvjelző, ráadásul felbukkan néha egy-két vitás helyzet.","replies":[]},{"poster":"Gregori","date":"2019-07-25T20:41:11.155+0000","up_votes":1,"down_votes":0,"body":"Csakis a crypostok miatt! Régen persze ezekből is több volt, de a sok 90 alatti IQ-s emberen még mindig lehet nevetni (vagy sírni) egyet... :D","replies":[]},{"poster":"kalamona90","date":"2019-07-25T12:26:35.144+0000","up_votes":1,"down_votes":0,"body":"Halvány lila fingom sincs miért járok ide vissza. Talán csak a megszokás. Majdnem minden nap felnézek de kb hetente egyszer szólok hozzá valamihez. Bár hogy azt is minek?","replies":[]},{"poster":"Sch1zophrenia","date":"2019-07-25T07:37:27.793+0000","up_votes":1,"down_votes":0,"body":"Nekem ki van rakva könyvjelzőbe a weboldal,azt amikor felnézek megnézni,mi jött az új patch-ben,akkor már át kattolok ide is. Megnézem az első 5-10 cikk,címét,aztán ha érdekesnek tűnik megnézem,ha nem megyek tovább :D.","replies":[]},{"poster":"kiskeni","date":"2019-07-24T22:54:37.090+0000","up_votes":1,"down_votes":0,"body":"Mindig van valami probléma, ami megoldásra vár :D Mások dolgával nem szeretek foglalkozni, viszont problémákat szeretek megoldani és nálam ez utóbbi erősebb, mint az előbbi. Tehát végülis csak ott kötök ki, hogy mások dolgaival foglalkozom itt a fórumon, mikor hozzászólok itt bárhol, még ha nem is akarom :D\n\nA fórum maga viszont tényleg elég halott, de ez van. Van erre egy mondás-szerű, de most eszembe nem jutna (valami nem tragikus, de nem is rossz) :D","replies":[]},{"poster":"AsD The Dreamer","date":"2019-07-25T21:54:40.470+0000","up_votes":3,"down_votes":5,"body":"Nem tudom miért járok vissza. Szar hely tbh. Régen (és itt 2014-től beszélek tehát take my word) voltak vicces inside mémek meg crypostok. Az utóbbi most is van csak nem viccesek hanem szokványos pleb sírás, ami nem vicces. Halott közösség tbh.","replies":[]}]}