{"poster":"xXTheFalloutXx","date":"2016-11-26T21:58:27.689+0000","title":"Matchmaking","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":12,"body":"Ich wei&szlig;, ich wei&szlig;, Ihr h&ouml;rt den Schei&szlig; den ganzen Tag und mich nervt er auch. Posts &uuml;bers Matchmaking sind unbeliebt und werden meist mit enorm vielen Downvotes begr&uuml;&szlig;t.\r\nAber, ich habe ernste zweifel am System. Vor dem Ende der Season war ich Promo Gold 5. Ich spiel nicht auf Diamant oder Master kenne aber die Spielmechaniken, die Champions und Spielz&uuml;ge mit diesen. Was mich nervt ist das ich kaum, oder gar nicht, in der Lage bin aufzusteigen. Ich bin nun in den letzten Wochen von Gold 5 auf Silber 5 gefallen. Egal welche Position egal welchen Champion, Ich verliere. Es ist egal wie gut ich Spiele, ich verliere.\r\nIch verliere ein Spiel als Rammus Supp. Als einziger der einen Angepasten Build hat und nicht &quot;Recommended&quot; baut.\r\nIch kann kein komplettes Team Carrien, und im Moment denke ich kann man nur als Premades erfolgreich aufsteigen.\r\nMeine Statistik:\r\nhttp://www.leagueofgraphs.com/summoner/euw/xXTheFalloutXx\r\n\r\nEine 48,4% Winrate im Ranked, obwohl die meisten Spiele von meinen Stats ausgesehen gut verliefen.\r\nIch w&uuml;rde gerne zum Seasonbeginn einen harten Reset bekommen, vielleicht bekomme ich dann, faire teams.","replies":[{"poster":"Berserker Cookie","date":"2016-11-27T00:01:01.040+0000","up_votes":5,"down_votes":0,"body":"Ich hab mir ein paar deiner games angesehen und hier meine Tipps. Ob due die annehmen willst oder nicht überlasse ich dir :)\n\n\n- ich geb dir den selben Rat den mir ein Dia1 Spieler gegeben hat. Du spielst zu viele Champions weil du dich selbst überschätzt.  Das mag zwar gut sein fürs Allrounden aber gerade in Bronze/Silber/Gold ist es besser du beherrscht maximal 3 Champs wie deine eigenen Hände. \nSuch dir deinen besten Champ aus und spam den. Egal wo. Du wirst den Champ irgendwann hassen aber vertrau mir du wirst so unfassbar besser das glaubst du gar nicht. \nSo ca 30 Games wirst du den champ schon spammen müssen. \n\n-  Farm dir die Seele aus dem Leib. Ich weiß das klingt so 0815 aber ich hatte ein Game mit über 400 Farm bei Minute 37. ich sag nur GE GE! Ich konnte 1 vs 5 und ich hab sie alle zerlegt. Vertrau mir da. Wenn du wirklich gut farmst und jeden CS mitnimmst den du kriegen kannst ist das wie 5 kills die du vorne liegst. Der Gegner wird dich regelrecht hassen. \n\n- Sei bei jedem Teamfight dabei. Farm nicht und push nicht irgendwo während dein Team 4 vs 5 kämpft.  Du bist der Spielentscheidende Faktor also sei bei den Teamfights dabei und stompe deine Gegner. \n\n- Spielst du Assassine wie Talon (scheint dein Favorit zu sein)  töte den gegnerischen ADC oder APC! Aber der Gegnerische Tank ist 10/0. Ignorieren. APC/ADC ist deine Aufgabe in jedem Teamfight. Einen der beiden musst du umhauen. Völlig egal ob du dann drauf gehst Hauptsache ist die machen keinen schaden mehr.\nIch seh das ständig der gegnerische Tank (Poppy) ist gefeedet und jeder haut da drauf als obs kein morgen gäbe. Während die 0/12 Ashe einen kill nach dem anderen bekommt weil keiner den Focus auf sie legt weil die ist ja 0/12. Damit das so bleibt muss die umfallen. \n\n- Jedes spiel fängt mit 1 vs 9 zu deinem Nachteil an. Ja ja ich weiß aber bevor du das in frage stellst hier ist wieso. \nDu bist die Konstante. Wenn du immer eine positive KDA hast und vom Farm her auch immer sehr gut dabei bist wirst du aufsteigen. Das wird zwar dauern 120 Games aufwärts aber die Mathematik arbeitet für dich. \nAber du musst aufhören dich auf deine Teammates zu verlassen. Verlässt du dich auf die bist du verlassen und zwar zur gänze. \n\nDu musst daher davon ausgehen das der Gegner 5 Faker hat und du 4 Teammates hast die aus der Sperrholz Division 5 stammen.\nSpiel daher immer so als ob du alleine wärst und keinerlei Hilfe von anderen erwarten kannst. \n\n\n- Sehr wichtig. \nFlame nicht. \nRage nicht. \nTilte nicht. \nWenn du 3 Games in folge verloren hast aber anstatt einer pause dennoch weiterspielen möchtest bekomme den Kopf frei. Es gab die 3 letzten games nicht. Spiel jedes Game konstant um dich zu verbessern und nicht um zu gewinnen. \n\n\n- Hol dir LoL Replay. \nSpiele 5 Games. \nSuch dir das beste raus und sieh dir an warum du da so gut warst. (Schreib dir auf was du gut gemacht hast) \nSuch dir das schlechteste raus und sieh dir an warum du da so schlecht warst. (Schreib dir auf was du schlecht gemacht hast)\n\nKonzentriere dich auf das was du gut gemacht hast und versuche es zu wiederholen während du das was schlecht gelaufen ist versuchst zu vermeiden oder zu verbessern. \n\nSpiele wieder 5 Games. Wiederhole den Prozess. \n\n\nHoffe das ein oder andere war für dich dabei :)","replies":[{"poster":"xXTheFalloutXx","date":"2016-11-27T09:44:29.940+0000","up_votes":2,"down_votes":1,"body":"Danke für die Konstruktive Kritik.\nLoL Replay besitze ich bereits und verbessere mich so wie du es gesagt hast bereits.\nFlamen, Ragen, Tilten, ist nicht so meins. Bin er der Ruhige Hoffnungsvolle Typ. (Jetzt aber weniger Hoffnungsvoll :P)\nIch Spam jetzt die nächsten 150 Spiele Talon, Yasuo und Kled. Diese sind meine besten Champions.","replies":[]}]},{"poster":"Alânte","date":"2016-11-26T22:35:27.450+0000","up_votes":3,"down_votes":0,"body":"Vielleicht solltest du einfach deine jetzige Elo annehmen. Du bist nach über 300 Rankedgames dort angekommen, wo du hingehörst.","replies":[]},{"poster":"MeMyselfandBaal","date":"2016-11-27T01:32:38.251+0000","up_votes":2,"down_votes":0,"body":"Warte was? Du spielst Rammus Support ohne Sightstone (so viel zum angepassten Build) und wunderst dich, dass du verlierst? Und gibst dann dem Matchmaking die Schuld? Wenn du in den 2 Rammus Support Spielen einfach was ordentliches pickst und vernünftig spielst, kriegst du auch ne bessere Winrate...","replies":[{"poster":"xXTheFalloutXx","date":"2016-11-27T09:34:36.103+0000","up_votes":1,"down_votes":3,"body":"Rammus ist ein recht starker pick als supporter, seine Q macht von anfang an recht viel schaden, seine W macht ihn ,im zusammenhang mit dem Neuen Keystone, so gut wie unverwundbar. Seine E gbt dem Adc genug zeit den gegnerischen Adc anzugreifen. Auf Rammus Sightstone zu bauen ist nicht notwendig. Besser ist es das Support item auszubauen sowie {{item:3222}} und {{item:3190}}. Damit kann Rammus auch den support dann unterstützen.","replies":[{"poster":"Nivoras","date":"2016-11-27T12:39:17.448+0000","up_votes":3,"down_votes":0,"body":"Ein Sightstone ist auf JEDEM Supporter notwendig, es sist völlig egal ob du dabei Rammus oder Brand spielst. Und wenn du keinen Bock zu warden hast dann spiel halt nicht Support. Darüber hinaus ist der Peel dem du deinem ADC geben kannst quasi nicht vorhanden und Schaden machst du, im Gegensatz zu einem Brand/Vel auch nicht. Bitte höre auf über das Matchmaking zu weinen, wenn du mit solchen Aussagen deutlich beweist, dass du genau da bist wo du hingehörst","replies":[]},{"poster":"Patter1991","date":"2016-11-27T09:37:00.537+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=xXTheFalloutXx,realm=EUW,application-id=KYnfKGf0,discussion-id=a3dvEmiv,comment-id=00030000,timestamp=2016-11-27T09:34:36.103+0000)\n>\n>  Sightstone zu bauen ist nicht notwendig.\n\nSagte der Low Silverspieler zum Platinspieler.\nEs wird schon einen Grund haben, warum ALLE High Elos auf Vision schwören.","replies":[{"poster":"Berserker Cookie","date":"2016-11-27T13:53:11.554+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Patter1991,realm=EUW,application-id=KYnfKGf0,discussion-id=a3dvEmiv,comment-id=000300000000,timestamp=2016-11-27T09:37:00.537+0000)\n>\n> Sagte der Low Silverspieler zum Platinspieler.\n> Es wird schon einen Grund haben, warum ALLE High Elos auf Vision schwören.\n\nDas mag zwar sein aber wenn du verlierst und es auf den Sightstone schiebst hättest du ohnehin verloren. Vision heißt das jeder sich ne Pink kauft oder sein Trinket wechselt und sich die Seele aus der Map warded. \n\nDer SIghtstone ist sozusagen der Bonus des Supps dafür.","replies":[{"poster":"eingew","date":"2016-11-27T17:19:35.157+0000","up_votes":1,"down_votes":0,"body":"Die beiden Thesen \"je mehr Vision, desto besser\" und \"entweder maximale Vision oder gar keine\" sind allerdings widersprüchlich.","replies":[]}]}]},{"poster":"MeMyselfandBaal","date":"2016-11-27T15:00:29.436+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=xXTheFalloutXx,realm=EUW,application-id=KYnfKGf0,discussion-id=a3dvEmiv,comment-id=00030000,timestamp=2016-11-27T09:34:36.103+0000)\n>\n> Rammus ist ein recht starker pick als supporter, seine Q macht von anfang an recht viel schaden, seine W macht ihn ,im zusammenhang mit dem Neuen Keystone, so gut wie unverwundbar. Seine E gbt dem Adc genug zeit den gegnerischen Adc anzugreifen. Auf Rammus Sightstone zu bauen ist nicht notwendig. Besser ist es das Support item auszubauen sowie {{item:3222}} und {{item:3190}}. Damit kann Rammus auch den support dann unterstützen.\n\nAha. Ich vertraue da mal deinem Urteil und probiere das nicht selber aus. \nIch möchte dich aber mal auf ein allgemeines Problem beim Mikaels hinweisen: Dieses Item holt man sich eigentlich, wenn man selber nicht der Frontline Support ist. Denn das Item gibt dir halt im Wesentlichen Manaregeneration und etwas bessere Schilde. Das führt dann dazu, dass du unfassbar Weich bist, wenn du in den Kampf reingehst. \nDazu kommt, dass dein Verhalten absolut vorhersehbar ist. Die Morgana wird einfach ihr Q in denen Weg werfen und dann kassierst du, weil du nicht genügend Rüstung hast, unfassbar viel Schaden vom ADC für nichts.\n\nDazu kommt, dass du dir es mit einem Rammus pick, der in der Lane gegen nen Range Support mit CC (Nami, Sona, Morgana) nichts macht, nicht leisten kannst zurückzufallen. Denn du brauchst (im Gegensatz zu einem Alistar mit seiner mächtigen Ulti) ganz dringend Items, damit du Tanky wirst. Dann wirst du gegen ein ALL AD TEAM auch unfassbar Tanky. Aber halt auch nur dann.\n\nVertrau mir da einfach mal, ich spiele schon länger Support, als es diese Rolle gibt: Rammus Support ist Müll.\nDie einzige Möglichkeit, die ich sehe, ist... dass die neue Keystonemasterie wirklich so unfassbar broken ist. Aber selbst dann ist ein Alistar immer noch wesentlich effektiver...","replies":[{"poster":"xXTheFalloutXx","date":"2016-11-27T16:23:30.390+0000","up_votes":1,"down_votes":1,"body":"Seht in Meine Statistik:\nIch habe vielleicht 6 Games als Support im Ranked gespielt, Warum? Weil ich kein MAIN Support bin. Trotzdem schaffe ich es ein relativ gutes spiel herauszuhauen. Ich habe Rammus Support nur als Beispiel genommen. Ich habe gerade einmal 2 Games mit Rammus im Ranked als support gespielt und gerade einmal 10 insgesamt. Wenn ihr schon rumheulen musst. Dann seht euch meine Spiele mit meinem Mains An:\nTalon\nKled\nTwisted Fate","replies":[{"poster":"MeMyselfandBaal","date":"2016-11-27T16:54:28.742+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xXTheFalloutXx,realm=EUW,application-id=KYnfKGf0,discussion-id=a3dvEmiv,comment-id=0003000000030000,timestamp=2016-11-27T16:23:30.390+0000)\n>\n> Seht in Meine Statistik:\n> Ich habe vielleicht 6 Games als Support im Ranked gespielt, Warum? Weil ich kein MAIN Support bin. Trotzdem schaffe ich es ein relativ gutes spiel herauszuhauen. Ich habe Rammus Support nur als Beispiel genommen. Ich habe gerade einmal 2 Games mit Rammus im Ranked als support gespielt und gerade einmal 10 insgesamt. Wenn ihr schon rumheulen musst. Dann seht euch meine Spiele mit meinem Mains An:\n> Talon\n> Kled\n> Twisted Fate\n\nich bin doch nicht der, der über das Matchmaking heult. Ich bin derjenige, der dir einen sehr einfachen Hotfix für dein Problem liefert: Spiele nicht mehr Rammus Support sondern gucke dir mal Sona an. Und du hast angefangen uns zu erklären, dass Rammus ein guter Supportpick ist. Im Gegensatz zu Talon, Kled und Twisted Fate, mit denen ich nur unwesentlich besser bin als du, kann ich dir beim Support Rammus erklären, warum du da falsch liegst.","replies":[]}]}]},{"poster":"Waldschrat86","date":"2016-11-27T10:08:48.273+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xXTheFalloutXx,realm=EUW,application-id=KYnfKGf0,discussion-id=a3dvEmiv,comment-id=00030000,timestamp=2016-11-27T09:34:36.103+0000)\n>\n> Rammus ist ein recht starker pick als supporter, seine Q macht von anfang an recht viel schaden, seine W macht ihn ,im zusammenhang mit dem Neuen Keystone, so gut wie unverwundbar. Seine E gbt dem Adc genug zeit den gegnerischen Adc anzugreifen. Auf Rammus Sightstone zu bauen ist nicht notwendig. Besser ist es das Support item auszubauen sowie {{item:3222}} und {{item:3190}}. Damit kann Rammus auch den support dann unterstützen.\n\nMit nem Pre ADC oder Jungle vlt.\nDie CDs, sind auf allen 3 Spells ziemlich hoch, E muss gemaxed werden, um die Stundauer relevant zu machen. Wenn du sie überhaupt auf den ADC bekommst bringt das nur etwas, wenn der gegnerische Support so blöd ist auf dich zu gehen statt deinen ADC zu bedrängen oder nur zu peelen. Das sollte schon in Silber öfter schief ausgehen als erfolgreich. Dazu kommt noch, dass du damit Minionaggro auf dich ziehst und mit W automatisch die Wave pushst. Gut er hat noch Roampotential, aber wenn man sich den Sightstone spart, wird das in der Regel auch nichts werden, mal ganz abgesehen davon, dass in der Situation dein ADC einfach nur Futter ist, wenn der Gegner bemerkt, dass ihr kaum Vision habt. Das fast unverwundbar würde ich übrigens gerne mal sehen, vorallem gegen AP-lastige Teams und im early, ich komm da grob überschlagen auf max. um die 300 Schaden, die du mehr einstecken kannst als ohne w und Mastery, was über poke und Visionvorteil leicht auszugleichen ist. Wenn dann der Gegner noch auf die Idee kommt {{item:3222}} zu bauen...starker Support-Pick ist echt was anderes.","replies":[]}]}]},{"poster":"xXTheFalloutXx","date":"2016-11-27T09:47:35.116+0000","up_votes":1,"down_votes":3,"body":"Was mich nervt hier, sind diese Unnötigen beinah schon beleidigenden Kommentare, sowie diese die Nur Downvoten ohne Grund. Ich habe hier ein Problem und habe nach Hilfe gefragt. Bisher hat nur 1 Konstruktive Hilfe gebracht alle anderen, nur nervige Kommentare. Weshalb ich bitten möchte, wenn ihr etwas Posten möchtet, dann Konstruktive Hilfe und/oder Kritik. Ich brauche keine Posts mit der Kern-aussage: \"Du bist Scheiße\"","replies":[{"poster":"Sirrkas","date":"2016-11-27T11:45:17.101+0000","up_votes":2,"down_votes":0,"body":">Was mich nervt hier, sind diese Unnötigen beinah schon beleidigenden Kommentare\n\nDie kannst du gerne Melden. Rechts unten an jedem Beitrag ist eine Meldefunktion. Wenn jemand deiner Ansicht nach sich unpassend verhält, kannst du die gerne nutzen. Die Mods schauen sich das dann später an.\n\n>Ich habe hier ein Problem und habe nach Hilfe gefragt. \n\nIch glaube die Leute könnten dir eher helfen, wenn du in deinem Post auch etwas entsprechendes schreiben würdest. Dein Eröffnungspost enthält leider keine erkennbare Frage, nur Infos, wie \"mein Team ist schlecht und der Grund dafür, dass ich verliere\". Wenn das alles ist, was du den Leuten im Startpost lieferst, werden sie auch nur darauf antworten können und das sind dann am ehesten Beiträge wie \"selbst schuld\".","replies":[{"poster":"xXTheFalloutXx","date":"2016-11-27T16:26:03.192+0000","up_votes":1,"down_votes":1,"body":"Im startpost habe ich mein Problem geschildert aber keine Direkte frage geschildert. Diese kann man aber herauslesen:\n\"Was benötige ich um Aufzusteigen/Wie ist es mir möglich aufzusteigen?\"","replies":[{"poster":"eingew","date":"2016-11-27T17:30:45.213+0000","up_votes":1,"down_votes":0,"body":"> \"Was benötige ich um Aufzusteigen/Wie ist es mir möglich aufzusteigen?\"\n\nVerbessere dich. Dazu kannst du zum Beispiel mithilfe [dieser Seite](http://school.egg-one.com/lolprofiler/profile?summoner_id=XXTHEFALLOUTXX&region=euw#tab_Action) deine Leistung im Allgmeinen bewerten.\n\nDu stirbst zu oft. Versuche jedes Spiel mindestens 2 Mal weniger zu sterben. Du hast zu wenige Assists. Versuch jedes Spiel mindestens 2 Mal öfter zu roamen. Du bist zu selten am Firstblood beteiligt. Achte im Early besser auf die Map und scheue dich nicht, auch mal deine Lane zu verlassen um deinem Team in den ersten Trades den entscheidenden Vorteil zu verschaffen.\n\nDu machst viel zu wenige Objectives. Du holst dir zu selten den ersten Tower. Wenn du im Early geroamt hast, bleib nach einer erfolgreichen Aktion mit den anderen auf der Lane und pushe den Tower. Dasselbe gilt für Inhibs. Mehr pushen! Du machst den Baron ein bisschen zu selten. Achte öfter darauf, dein Team öfter in seine Richtung zu locken. Dasselbe gilt für den Drachen. Der ist vielleicht sogar noch wichtiger. Den solltest du jedes Spiel mindestens einmal öfter machen. \n\nDein Farm auf der Lane ist gut. Aber wenn dein Jungler gerade woanders ist, kannst du zwischen den Waves auch gerne mal ein Camp holen um deinen Goldertrag zu steigern. \n\nDu setzt minimal zu wenige Wards. Versuch jedes Spiel mindestens einen mehr zu stellen.\n\nAber eigentlich machst du schon sehr viele Sachen richtig gut für deine Elo. Bei den meisten Leuten muss ich deutlich mehr Sachen aufzählen. Dir fehlt vermutlich nicht mehr so viel.","replies":[]}]}]},{"poster":"Mornexa","date":"2016-11-27T10:17:58.410+0000","up_votes":1,"down_votes":0,"body":"Lern sowas einfach zu ignorieren! Du kannst das nicht verhindern also isses Zeitverschwendung und Streß sich darüber gedanken zu machen.\nAnfangs schwer klar aber du merkst nach ner Zeit das es keinen Nachteil hat :)","replies":[]}]},{"poster":"Nivoras","date":"2016-11-27T00:24:06.176+0000","up_votes":1,"down_votes":0,"body":"> Ich verliere ein Spiel als Rammus Supp. Als einziger der einen Angepasten Build hat und nicht \"Recommended\" baut.\n\nUuuund? Rammus Support ist erstens nicht optimal um deinen AD Carry zu unterstützen und zweitens wäre ich grade in Low Elo froh, wenn die Leute da bauen was empfohlen ist. Dann passieren nicht solche Dinge wie ein Zac mit 2x Warmogs oä.  Klar muss man lernen sich in der Reihenfolge und bei manchen Items anzupassen, aber grundsätzlich sind die empfohlenen Items doch gar nicht mehr so ein Müll sondern passen einigermaßen bei den meisten","replies":[{"poster":"xXTheFalloutXx","date":"2016-11-27T09:40:20.645+0000","up_votes":1,"down_votes":2,"body":"es macht wenig Sinn Ninja-Tabi zu bauen wenn dein gegnerteam Full Ap ist. Ich habe vieles gesehen. Ein Shen Toplane gegen ein Full Ad team mit 200MR. Ein Talon Mid der 0/7 behind ist und kein Armor pen baut obwohl das gegner team fast nur aus tanks besteht.\n\nSeine Builds anzupassen ist eigentlich das wichtigste. \nWenn ich Talon Mid Spiele baue ich z.b normalerweise:\n{{item:3117}} {{item:3074}} {{item:3142}} {{item:3072}} {{item:3071}}  {{item:3026}} \nAber auch folgendes steht zur auswahl:\n{{item:3512}} {{item:3078}} {{item:3156}} {{item:3748}} {{item:3814}} {{item:3153}} {{item:3060}} {{item:3158}} {{item:3053}} etc.","replies":[]}]}]}