{"poster":"ciccio77","date":"2015-04-07T18:41:23.953+0000","title":"Caitlyn, CONSIGLI?","subforum":"Campioni e gameplay","up_votes":2,"down_votes":0,"body":"Mi consigliate una build? Come comportarsi in lane? Contro chi è bene prenderla, mentre chi sono i suoi counter?\nI migliori supp per una combo?","replies":[{"poster":"Axelney","date":"2015-04-15T16:57:24.108+0000","up_votes":1,"down_votes":0,"body":"Tasto destro del mouse.","replies":[]},{"poster":"Phanix","date":"2015-04-08T10:47:32.542+0000","up_votes":1,"down_votes":1,"body":"cait e' la piu long rage fra gli adc praticamente, sikke il suo consiglio non e' sviluppatla sulla velocita' d attacco ma su i danni e il critico, difatti e' un ottima pokkatrice e normalmente uno o due colpi cosi li massimizzi (senza dimenticarsi della passiva che in early game se usato per pokkare e' qualcosa di bestiale)\n\nidem vale per la sua ulti applica danno e critico, inoltre essendo un long rage in team fight non ha bisogno di sparare come una pazza ma deve fare tanti tanti ma tanti danni \n\nsikke ti consiglio\n\n{{item:3031}}  {{item:3250}}  {{item:3046}}  {{item:3072}}  {{item:3035}}  e poi un oggetto a tua scelta difensivo io non esculdo affatto il {{item:3022}}  segui questo ordine","replies":[{"poster":"kirchhoff","date":"2015-04-08T12:45:44.844+0000","up_votes":1,"down_votes":0,"body":"ahhhhhhhhh\nla sua R mica applica il crit ...\nma perchè nessuno compra mai prima ste benedetto sussurro fatale? Vi sta antipatico?","replies":[{"poster":"Phanix","date":"2015-04-10T07:57:47.166+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kirchhoff,realm=EUW,application-id=cAOZwaUi,discussion-id=4zxzqevv,comment-id=00030000,timestamp=2015-04-08T12:45:44.844+0000)\n>\n> ahhhhhhhhh\n> la sua R mica applica il crit ...\n> ma perchè nessuno compra mai prima ste benedetto sussurro fatale? Vi sta antipatico?\n\ndipende dalla situazione ma come primi due oggetti hai troppo bisogno dell gladio dell infinito e del danzatore fantasma puoi metterlo apposto del massacro in base a come si sta sviluppando la partita non si sa mai;)","replies":[]}]}]},{"poster":"Ste the ripper","date":"2015-04-07T22:13:24.672+0000","up_votes":1,"down_votes":0,"body":"Non ascoltare kirchhof la sua build è moooolto discutibile...\n\nFai in ordine: IE, PD, BT, LW, oggetto difensivo che varia da partita a partita. Gli stivali li fai in early, dipende da quanto devi girare per la mappa, comunque chiudili almeno prima del pd.\n\nIn lane **devi** giocare aggressivo, hai più range e il tuo momento di massima forza è l'early se perdi l'early difficilmente recupererai, usa il range per pokkare e zonare e cerca di tirare giù la torre nemica per primo.\nI migliori supp sono tutti quelli che ti permettono di andare molto aggressivo fin da subito vanno bene sia quelli da all in ( a patto che l'adc nemico non sia un draven) che da poke\nè l'adc più semplice, è quello che viene consigliato ai nabbi per iniziare, non dovresti avere troppi problemi, se conosci le meccaniche degli adc sai come usarla","replies":[{"poster":"kirchhoff","date":"2015-04-07T22:58:26.639+0000","up_votes":1,"down_votes":0,"body":"OOOOOOOOPS, corretto XD\n\nlw ultimo oggetto difensivo è un no-no, a quel punto i tank hanno così tanta armatura che fai fatica pure a tirarli giù.\n\nhttps://www.reddit.com/r/leagueoflegends/comments/1opxab/the_last_whisper_theory/\nhttp://imgur.com/a/HxFEu","replies":[{"poster":"Ste the ripper","date":"2015-04-08T07:47:41.412+0000","up_votes":1,"down_votes":0,"body":"Dipende dalle partite, delle volte in soloq ( soprattutto a basso elo) nemmeno trovi i tank, ma poi il problema era che adesso hai editato, ma prima avevi messo anche 2 bt non la ie\n\nInoltre dal buff al pd sono poche le occasioni in cui effettivamente conviene buildare la statik, ma questo è non un grosso errore, alla fine i 2 oggetti sono quasi identici, quindi i vantaggi che dà uno non sono molto diversi dà quelli dell'altro","replies":[{"poster":"kirchhoff","date":"2015-04-08T12:43:32.019+0000","up_votes":1,"down_votes":0,"body":"Ho cercato \"gladio\" e poi ho cliccato senza guardare ... sono usciti 2 gladii del massacro XD","replies":[]}]}]}]},{"poster":"ciccio77","date":"2015-04-08T11:25:25.169+0000","up_votes":1,"down_votes":0,"body":"St{{item:3072}}  stavo pensando, si puo fare prima  qiesta della infinity?","replies":[{"poster":"Frattaglia","date":"2015-04-08T11:46:43.664+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ciccio77,realm=EUW,application-id=cAOZwaUi,discussion-id=4zxzqevv,comment-id=0004,timestamp=2015-04-08T11:25:25.169+0000)\n>\n> St{{item:3072}}  stavo pensando, si puo fare prima  qiesta della infinity?\n\nÈ più conveniente iniziare con la infinity, se hai bisogno di più lifesteal ti prendi una seconda lama di doran.\n\nSe hanno gente che ti può saltare addosso (es: katarina), durante i fight a volte è una buona idea mettersi una trappola proprio sotto ai piedi, in modo che restino inchiodati là. :)","replies":[]}]},{"poster":"kirchhoff","date":"2015-04-07T21:54:51.705+0000","up_votes":1,"down_votes":0,"body":"{{item:3072}} {{item:3006}} {{item:3087}} {{item:3035}} {{item:3102}} {{item:3031}}  {{item:2140}} \n\nL'unico counter che mi viene in mente è {{champion:15}} .\nMigliori supporti non penso ci siamo essendo molto versatile, quelli meta vanno bene sempre.","replies":[]},{"poster":"Pasticcionex","date":"2015-04-08T06:14:41.442+0000","up_votes":1,"down_votes":2,"body":"Io xcm counter ti dico quinn che la ara e i burst damage perché cait nn ha skill che fanno danno in late game quindi devi essere bravo nello sfruttare il range che ha perché é l' unico vantaggio a parità di build","replies":[]}]}