{"poster":"Badmax Warrior","date":"2019-04-15T00:13:31.824+0000","title":"Trolling wegen Autofill","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":4,"body":"Ich hatte gerade ein Ranked game mit einer Elise supp weil sie Autofill bekam. Dadurch habe ich -18 lp verloren. Ich finde dies sehr unfair. Ich hätte zwar die Champ select verlassen können aber dann hätte ich 30 Minuten warten müssen. Ich finde das man bei solchen Games viel weniger LP verlieren sollte. Wie steht ihr dazu?","replies":[{"poster":"611FVNKBlv","date":"2019-04-16T01:53:23.033+0000","up_votes":2,"down_votes":0,"body":"Nur weil sie elise sup pickt ist die schuld ? Immer wieder traurig das solche Leute ne höhere Liga  haben als ich weil se kein supmain sind und weniger afks haben lul. Ich spiel lieber mit ner guten elise sup als mit ner schlechten sona xd Btw die elise hat ganz normal versucht zu spielen wards gekauft gesetzt etcund hat ihre aufgbe versucht zu erfüllen. Schau dir hingegen mal den adc in dem game an. Da kannste als supporter egal ob elise oder sona otp nix machen.  Oder dein Jungler der hatte auch nicht die besten eigenschaften also an der elise würde ich mal sagen lag es ganz bestimmt nicht xd jedenfalls nicht alleine. Als mainsupporter hätte die auch nix machen können wenn 2 leute hart inten (anders kann ich das nicht nennen wenn ad jungler und caitlyn adc weniger schaden zsm austeilen als nen tank toplaner) da euch in jedem fall der damage gefehlt hätte bei so behind auch wenn du als malphite das game hättest turnen können. merkste das deine bot verkackt geh roamen dafür ist malphite da. Sei dir deiner rolle bewusst und helfe deinem team. Selbst wenn du verlierst ist doch egal du hast es versucht und das zählt. So wirst DU besser. An deinen Mates kannst du ohnehin nichts ändern und schuld jemand anderem zu geben ist leicht aber zu sehen was du besser machen kannst das macht aus dir einen guten Spieler. Man kann nicht jedes game gewinnen und nicht jeder kann das game gleichgut spielen. Selbst wenn es an deinen mates lag dann ist es so. Ändern kannst du es eben nicht. Aber an der elise gab es jetzt nichts zu kritisieren auf den ersten blick.","replies":[]},{"poster":"ObeyTheCode","date":"2019-04-15T04:15:08.130+0000","up_votes":1,"down_votes":3,"body":"Sehe es positiv, habe wieder mal einen 14 Tageban bekommen - ich bin nicht toxic, bin nur mit der Hand ausgerutscht - und jetzt habe ich wieder Spaß an League, auf meinem Smurf, ich kann Mundo Support spielen und keiner beschwert sich. Wenn ich verlieren sollte, juckt es mich auch nicht, denn ich kann für den Pick nicht gebannt werden. Als Zusammenfassung, höre auf zu tryharden Riot verbietet es, du sollst Spaß haben, also ignoriere die Elise und pick einfach deine Op Krit ADC (KAPPA).","replies":[]}]}