{"poster":"SexualBard","date":"2019-11-08T16:54:33.784+0000","title":"Hierro IV para la season 10","subforum":"Guias y consejos","up_votes":2,"down_votes":0,"body":"Lo del titulo, cuando empezo esta season y me entere de que existia esta nueva division quise tener mi cuenta main ahi. Pero ya estaba en oro, y no tenia ganas de intear por 100 partidas sin que me baneasen la cuenta, mucho trabajo. \r\n Ahora que termina la season, en preparacion para la que viene. ¿Que tengo que hacer para quedar en hierro 4?","replies":[{"poster":"No Feed pls UwU","date":"2019-11-08T17:39:43.739+0000","up_votes":1,"down_votes":0,"body":"ni  siendo unranked y perdiendo las 10 es posible quedar en hierro, lo minimo que te dejan es bronce perdiendo todas.","replies":[{"poster":"Snatchie","date":"2019-11-08T21:22:07.726+0000","up_votes":1,"down_votes":0,"body":"Cuando yo llegue al nivel 31 me mande a ranked y termine en hierro 2, ahora estoy en plata 4, y no subo porque me tilteo facil xD","replies":[{"poster":"No Feed pls UwU","date":"2019-11-08T21:31:19.982+0000","up_votes":1,"down_votes":0,"body":"es raro, seguramente fue apenas se implemento la liga hierro, que todos los unranked quedaban en hierro. yo jugue en 2 cuentas unranked perdiendo la  primera quedaba en bronce 2, y por mas que pierda el resto no descendias ni te descontaban lp. asi que era imposible bajar mas que eso en las 10 posicionales","replies":[]}]}]},{"poster":"TecheX","date":"2019-11-08T20:13:40.869+0000","up_votes":1,"down_votes":0,"body":"Posiblemente si perdes todas tus partidas con 0/10 mas o menos estarías en Hierro y también ganarías el odio de todas esas personas que jugaron con vos...en eso es otra cosa...\nAhora te respondo, es alpedo que bajes o intentes llegar a Hierro ya que ahora el sistema Automáticamente si se nota como jugas te saltea pero mansamente zarpado las divisiones y ligas, para dejarte mas cerca de tu \"elo\" actual, aaahh,,, pero a partir de plata + esta herramienta se las pasa por los H#ev0s y te toca cada banana galactica...\nMi cuenta secudaria estaba hierro 4, gane una me dio como 47 pl luego gane otra y directamente me paso a hierro 1, seguidamente perdi 2 y luego gane 1 y de allí me salto a bronce 3 sin promociones ni nada, ya gane otra mas y me salteo a  bronce 1., entonces si queres mantenerte jugando muchas partidas en esa liga, tenes que jugar mal intencionalmente muchas partidas...y creo que eso no esta bien, la personas que esta allí de verdad necesitan pasar por ahí para entender los mas básico pero básico del juego, no es justo abusarse de esas personas...no me toco ningún flammer, feeder intencional o mala actitud, nada de eso... son personas que de verdad es bueno que les enseñen que hacer... o almenos darles una pequeña guía...\nOjo mi cuenta secundaria tuvo en esa liga porque no lo rankee durante 2 años y se la habia regalado a un sobrino que queria aprender a jugar, lo deje en plata 3 pero se frustraba demasiado rapido ademas de mega flammer y afk (todo el paquete) lo bajo a bronce 5., ni se imaginan lo que tuve que hacer para recuperarlo, honor 0, 30 partidas de 35 min. baja prioridad(lo maximo que me dieron una vez fue 5 partidas de 20min.),20 partidas de chat bloqueadas, y el \"elo\" super bajo., ni idea porque no banearon la cuenta, misterios de RIOT.","replies":[]},{"poster":"Assassin Whisper","date":"2019-11-08T17:31:39.921+0000","up_votes":1,"down_votes":0,"body":"Create 1 cuenta nueva con 2 o 3 skin y tradeasela a alguno de los 4 o 5 millones de cuentas en hierro 4 que hay seguro y te la aceptan jaja","replies":[{"poster":"No Feed pls UwU","date":"2019-11-08T17:44:18.335+0000","up_votes":1,"down_votes":0,"body":"es las hay un total 671.453 cuentas que juegan ranked. en hierro 4 solo hay 397 cuentas\nIron III \t1,937 \nIron II \t4,341 \nIron I \t6,790 \n\nsolo es 2% del server es hierro","replies":[{"poster":"Robin Hoody","date":"2019-11-08T18:22:41.291+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=No Feed pls UwU,realm=LAS,application-id=8sKIclmi,discussion-id=TEa4B21m,comment-id=00010000,timestamp=2019-11-08T17:44:18.335+0000)\n>\n> es las hay un total 671.453 cuentas que juegan ranked. en hierro 4 solo hay 397 cuentas\n> Iron III \t1,937 \n> Iron II \t4,341 \n> Iron I \t6,790 \n> \n> solo es 2% del server es hierro\n\nque orgullo ser de LAS no?","replies":[]}]}]},{"poster":"Soy carabinero","date":"2019-11-08T17:01:03.194+0000","up_votes":1,"down_votes":0,"body":"Esto no se ve todos los días, pero bueno lo mejor seria crearte una cuenta nueva.","replies":[{"poster":"Perturbado2","date":"2019-11-08T17:15:42.721+0000","up_votes":1,"down_votes":0,"body":"digamos que la mayoría lo hace pero con las smurf xD, al menos todos los que conosco trolean en las primeras 10 total son cuentas secundarias","replies":[]}]}]}