{"poster":"specter424","date":"2017-07-12T06:23:51.015+0000","title":"why is playing drunk and ruining the game with terrible plays not punishable?","subforum":"Player Behavior","up_votes":1,"down_votes":3,"body":"???","replies":[{"poster":"YokoNomi","date":"2017-07-12T06:26:55.138+0000","up_votes":8,"down_votes":0,"body":"You really want to request a CS from Riot to track down the player, break into his house/apartment, and force a breathalyzer on him, based on a report that's a minimum of hours if not days following the supposed claim?\n\nA person can say they're high or drunk all they want, but there's literally no way to prove it, so why pretend we can?","replies":[{"poster":"NLGG3R BEATER","date":"2017-07-12T06:58:41.274+0000","up_votes":1,"down_votes":0,"body":"Does playing while drunk actually violate the rules though?","replies":[{"poster":"MUSHROOM MIDGET","date":"2017-07-12T07:20:51.303+0000","up_votes":1,"down_votes":0,"body":"no.","replies":[]},{"poster":"Pierce The Veal","date":"2017-07-12T07:09:34.328+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ReformedWhiteMan,realm=EUW,application-id=ZGEFLEUQ,discussion-id=oeV1Tgfw,comment-id=00000000,timestamp=2017-07-12T06:58:41.274+0000)\n>\n> Does playing while drunk actually violate the rules though?\n\nTechnically it's not giving it your all, or could even be intentionally feeding, but it's hard to prove if they're not outright inting.","replies":[]}]}]},{"poster":"The Djinn","date":"2017-07-12T15:45:14.187+0000","up_votes":2,"down_votes":0,"body":"Even if you say with 100% certainty that playing while drunk is not acceptable, that creates a BIG slippery slope.\n\nPlayers play worse when distracted, upset, angry, tilted, anxious, depressed...any NUMBER of circumstances can lead to worse play. Should it be against the rules to play when you have a headache and are in pain as a result? What if you just had a break-up and are a bit preoccupied? What if you have kids that may -- but normally don't -- have a crisis that requires your attention, or a cat that occasionally walks on your keyboard?\n\nAll of that can lead to bad play, so should we say that isn't allowed either?\n\n----------------------\n\nIn effect, there's no punishment for playing poorly as long as you're trying to win, precisely because Riot can't possibly prove or enforce all the things that might cause someone to play poorly. Playing drunk/high is perfectly fine, so long as you're not INTENTIONALLY throwing the game.","replies":[]},{"poster":"DrCyanide","date":"2017-07-12T06:29:01.405+0000","up_votes":1,"down_votes":0,"body":"Does your computer have a breathalyzer attached to it?\n\nIf someone makes bad plays consistently, they get placed with those who similarly make bad plays. What \"bad plays\" are depends on the skill you're comparing them to is. What's terrible to a Diamond 1 might be acceptable or even good for Bronze 5.","replies":[{"poster":"rework trundle","date":"2017-07-12T06:34:24.595+0000","up_votes":1,"down_votes":2,"body":"What is terrible in D1 is godlike in B5.\nFor example, 130 cs at 15 mins.","replies":[{"poster":"idubbztv","date":"2017-07-12T07:15:03.043+0000","up_votes":2,"down_votes":0,"body":"130cs in 15 minutes is good even for Diamond. PERFECT farm is around like 148cs at 15 minutes. Go into practice mode, put turrets invincible, buy max items, max level, tp just outside the enemy nexus, and kill every single minion for 1 lane for 15 minutes, and this will show you what perfect cs would be for different times in the game. 130 cs is great for 15 minutes regardless of your division.","replies":[{"poster":"rework trundle","date":"2017-07-12T16:45:13.841+0000","up_votes":1,"down_votes":0,"body":"It is great, but I'm pretty sure D1 players can average 10 cs/min.\n\nNot getting that means you'll be outfarmed, have less gold, less items.\n\nThen if you're roaming a lot this doesn't apply to you.","replies":[]}]}]},{"poster":"I suck at Jhin","date":"2017-07-12T14:44:31.569+0000","up_votes":1,"down_votes":0,"body":">If someone makes bad plays consistently\n\nWhat? To get better teammates all I have to do is do something very good in a game, but not really win the game as that doesn't even matter?\n\nI'm serious, are you high or drunk? Or something? Because last time I checked MMR is affected by nothing but wins and losses, you lose, it goes down, you win, it goes up...","replies":[{"poster":"DrCyanide","date":"2017-07-12T15:08:23.231+0000","up_votes":1,"down_votes":0,"body":"If you're making bad plays consistently you'll lose more, thus your MMR will drop, thus you'll be matched with worse players.\n\nDidn't think I had to write out the one in between step, I assumed people here were smart enough to figure that one out.","replies":[{"poster":"I suck at Jhin","date":"2017-07-12T15:17:08.919+0000","up_votes":1,"down_votes":0,"body":"Gbay99.","replies":[]}]}]}]},{"poster":"Geauxx","date":"2017-07-12T07:19:22.782+0000","up_votes":1,"down_votes":0,"body":"Ruining the game with terrible plays...\n\nSo what's the difference between Drunk and Bronze then?","replies":[{"poster":"Zelorxon","date":"2017-07-12T14:46:35.800+0000","up_votes":1,"down_votes":0,"body":"Asking the real questions here.","replies":[]}]},{"poster":"Sarutobi","date":"2017-07-12T11:53:49.014+0000","up_votes":1,"down_votes":0,"body":"I mean like others have pointed out, how exactly would you prove that they are Drunk? I mean if they just claim it in Chat i doubt anyone would be that stupid, but still you need to be able to prove that they are or else anyone can make that excuse.","replies":[]},{"poster":"Winters Dawn","date":"2017-07-12T07:26:01.955+0000","up_votes":1,"down_votes":0,"body":"i use to play ranked after taking my ambien i didnt do it to intentionally ruin games i just wasnt thinking straight .  but i got off the ambien last year.. i do wish i could make up for the games i ruined...\n\nthey were bronze 5 games tho so i was prob actually  playing  as good as everyone  else","replies":[]},{"poster":"TheViper7911","date":"2017-07-12T06:53:13.011+0000","up_votes":1,"down_votes":0,"body":"Hes talking about people who announce they are drunk and or high and then play poorly. The best thing you can do is bait them into using foul lamguage. It is the only chance for a ban.","replies":[]}]}