{"poster":"Isaak001","date":"2019-09-15T21:15:58.652+0000","title":"eu server suck, un normale giorno nella riot-eu ^^","subforum":"Discussioni generali","up_votes":5,"down_votes":2,"body":"quanti dislike prenderà sto post? (cmq è vero dai .-.)","replies":[{"poster":"Térence Fill","date":"2019-09-16T11:47:28.189+0000","up_votes":1,"down_votes":0,"body":"Ancora a due miei premade compare quotidianamente il bugsplat al primo Game del giorno.","replies":[{"poster":"Retardo DiCaprio","date":"2019-09-17T10:50:52.153+0000","up_votes":4,"down_votes":0,"body":"Siete consapevoli del fatto che il bugsplat non ha nulla a che vedere con il funzionamento dei server, vero?","replies":[{"poster":"Udohorn","date":"2019-09-17T11:56:10.620+0000","up_votes":4,"down_votes":0,"body":"Sembra sia difficile capirlo.","replies":[{"poster":"Térence Fill","date":"2019-09-18T08:37:43.008+0000","up_votes":1,"down_votes":0,"body":"Fino a questo momento no, pertanto deduco sia inerente al Client.","replies":[]}]}]}]},{"poster":"XPY99","date":"2019-09-15T22:05:47.745+0000","up_votes":3,"down_votes":2,"body":"Gli unici momenti in cui i server hanno dato veramente problemi sono stati con l'introduzione di tds e con clash, per il resto in anni di gioco i problemi con i server li posso contare sulle dita di una mano, poi ci sono i problemi di client etc ma quello è un altro discorso","replies":[{"poster":"KÐβ Śarah Iημ","date":"2019-09-16T13:53:00.820+0000","up_votes":3,"down_votes":0,"body":"Concorco, a parte in season 2-3-4 nei quale i server EUW erano stra memati per quanto fossero pessimi ed andavano off ogni settimana","replies":[]},{"poster":"Isaak001","date":"2019-09-16T16:07:40.154+0000","up_votes":1,"down_votes":1,"body":"in realtà ho scritto questo post appunto perchè i server sono esplosi stile clash/tds a caso, non succede sempre e solo durante gli eventi ma anche altre volte immotivatamente (o almeno non so perchè è successo come tutte le persone che conosco a cui è esploso il client)\nè impossibile negare questa cosa quando lo hanno dimostrato innumerevoli volte, i server sono scarsi","replies":[{"poster":"Retardo DiCaprio","date":"2019-09-17T10:54:45.184+0000","up_votes":2,"down_votes":0,"body":"Beh non proprio a caso, sono esplosi soltanto durante il periodo di introduzione di clash e tds (e vorrei far notare come, nonostante ci si prepari per questi eventi, non si può prevedere il futuro e non si aspettavano un flusso che a tratti ha raggiunto le **50 volte** il flusso regolare sui server), tutti gli altri sono stati problemi minori legati ogni tanto a qualche patch dove al massimo si è dovuto disabilitare un champion o le ranked per qualche ora.\n\nOnestamente non capisco cosa la gente si aspetti, il fatto che la Riot faccia tanti soldi non gli permette di avere il magico server supremo che non ha punti deboli, e le fasi di testing esistono proprio per questi motivi.","replies":[]},{"poster":"XPY99","date":"2019-09-17T10:24:54.347+0000","up_votes":2,"down_votes":0,"body":"Client e server sono due cose ben diverse, per quanto riguarda clash/tds stiamo parlando di un numero di persone spaventoso, rispetto a quelle solite e i numeri di lol sono già di loro assurdi specialmente euw che è il server più grande","replies":[]}]}]}]}