{"poster":"Isaak001","date":"2018-07-03T17:45:15.454+0000","title":"UNA DIMENTICATA STORIA INFINITA prologo: \"il viaggiatore scomparso dal tempo\"","subforum":"Creazioni della community","up_votes":1,"down_votes":3,"body":"&quot;non ricordo da dove vengo, ricordo solo che mi era stata assegniata una missione importante da compiere............... non so cosa sto cercando ma &egrave; molto importante, so che lo sapr&ograve; quando lo vedr&ograve;.......non ricordo il mio nome.... &egrave; passato troppo tempo dall&#039;ultima volta che lo ho sentito nominare...........ho molti nomi di conseguenza..... stati dati a me per via delle mie &quot;apparizioni&quot; in tutta runeterra........ \nricordo...... il divoratore degli abissi... si, cos&igrave; mi chiamano a bilgewater sono passati anni ma ricordo........ credo mi chiamarono cos&igrave; perch&egrave; ho ucciso a mani nude un gigantesco serpente marino....... solo per procurarmi del cibo........ o era l&#039;ancestrale???..........aspetta.........no..........mi chiamavano cos&igrave; a shurima.....si &egrave; cos&igrave;............\nho affrontato il vuoto senza difficolt&agrave;..... dimostrando quasi pi&ugrave; forza dei loro guerieri migliori.......come li chiamavano??\n...........sono confuso, forse DEI.....no, cos&igrave; si definivano loro, la gente li chiamava ascesi?? avevano anche un&#039;altro nome alcuni di loro...................credo fossero malvagi...................................non importa, sta di fatto che li non ho trovato niente, senza contare che con il vuoto ad infastidirmi potrei aver tralasciato qualche cosa nelle rovine......ci torner&ograve;..............\nnoxus.....quello si che era un posto divertente...................il folle sanguinario.....non lo dimenticher&ograve; quel periodo.........ma non avevano nulla di quello che cercavo......si, &egrave; li che ho iniziato a dimenticare..........credo.........500 anni f&agrave; ho iniziato...........\nsolo da demacia in poi i miei ricordi sono limpidi............li ero conosciuto come il golem nero.....per qualche motivo erano convinti che pi&ugrave; combattevo pi&ugrave; diventavo forte..............strano.......credevano fosse magia nera, non ero bene accetto in quella citt&agrave;................\nil freljiord......... sono andato via da li solo 40 anni fa eppure ne ricordo ancora il freddo.....li venivo chiamato cuore del ghiaccio ...........non ne capivo il motivo all&#039;inizio, lo trovavo quasi dispregiativo............ poi cap&igrave;...........io aiutavo le persone che si perdevano sulla cima delle montagne o si ferivano.......il freljiord &egrave; convinto che il freddo abbia una volont&agrave; propria ed erano convinti che io fossi la volont&agrave; del freddo..........che assurdit&agrave;.\nho passato gli ultimi anni a zoun, non perch&egrave; fossi in cerca di qualcosa li..........dato che non ricordo cosa cerco...... ma per pensare a me per un breve periodo....... stando li ho ascoltato e visto cosa succede a runeterra per capire dove andare a cercare di preciso........la guerra che c&#039;&egrave; stata li qualche anno fa ha scaturito un briciolo di curiosit&agrave; in quel luogo... credo che andr&ograve; li a controllare.......vediamo....si ecco......mi concentrer&ograve; su alcune persone in particolare........il demone d&#039;oro, kada jhin..........si dice che abbia un&#039;arma magica.........una ragazza noxiana.....interessante......uno spadone runico?? potrebbe essere ci&ograve; che cerco?? .......................................ah mi sono messo a parlare da solo di nuovo........diamine.................ero sempre solo anche prima di tutto questo??? non lo so........&egrave; passato troppo tempo................la mia mente non riesce a reggere tutto questo tempo.........tutti questi anni......la cosa peggiore... &egrave; che anche il tempo si &egrave; scordato di me.. non solo io di lui......nessuno sa chi sono o cosa devo fare...cosa sto cercando........sono solo.......... ma &egrave; importante che io resti solo, che continui per la mia strada nella mia ricerca....probabilmente ancora lungimirante, solo alla fine...avr&ograve; il diritto di morire&quot;\n\n\n\nprossimamente: UNA DIMENTICATA STORIA INFINITA\ncapitolo uno: la speranza in una lama spezzata\n\n\n\n\n\nciao, questo è il secondo tentativo di un prologo per una storia creata da me, spero che sta volta attiri l'attenzione ^^\ndatemi dei consigli se ne ritenete necessari \nps: se vedete degli errori nei tempi verbali segnalateli subito nei commenti, ne faccio parecchi quindi chiedo scusa in anticipo","replies":[{"poster":"Ser Nalor","date":"2018-07-03T22:54:11.598+0000","up_votes":2,"down_votes":0,"body":"Carissimo, anche l'occhio vuole la sua parte. Si fa proprio fatica a leggere il testo se impostato in questo modo. \n\nOltre al consiglio di Hallelujah riguardo i punti di sospensione (che, grammaticalmente e correttamente parlando, se ne scrivono tre e non a dozzine), anche paragrafare maggiormente staccando di un rigo e non solo andando a capo.\n\nIn questo modo è anche difficile che qualcosa ti rimanga impressa nella mente, ci si ricorda solo di un immenso wall of text mezzo in braille e mezzo scritto.\n\nPer rendere più facile il concetto e passartelo sotto forma di consiglio: leggi qualche libro, sfogliane le pagine e guarda com'è impostato tutto. Non solo i tempi verbali che, a confronto, passano in secondo piano.\n\nSe fossi Chef Barbieri e questo testo fosse un piatto di cucina, sicuramente ti saresti già aggiudicato di diritto la valutazione del famigerato \"mappazzone\" xD (a buon intenditor...)","replies":[{"poster":"Isaak001","date":"2018-07-04T12:25:17.376+0000","up_votes":0,"down_votes":1,"body":"forse potrei avere esagerato con i puntini, ma non so in che altro modo posso far intendere una specie di riflessione tra una parola e l'altra (dato che dovrebbe essere una caratteristica del protagonista), potresti dirmi come fare?? sempre se te ne intendi","replies":[{"poster":"Ser Nalor","date":"2018-07-04T19:21:41.315+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=isaak001,realm=EUW,application-id=P9Wi6QlB,discussion-id=e21cssz1,comment-id=00010000,timestamp=2018-07-04T12:25:17.376+0000)\n>\n> forse potrei avere esagerato con i puntini, ma non so in che altro modo posso far intendere una specie di riflessione tra una parola e l&#x27;altra (dato che dovrebbe essere una caratteristica del protagonista), potresti dirmi come fare?? sempre se te ne intendi\n\n[Internet](http://www.treccani.it/enciclopedia/puntini-di-sospensione_(La-grammatica-italiana)/) è pieno di piccole guide sulla punteggiatura, sulle parti del periodo e così via.\n\nUn monologo o un soliloquio si scrivono come si scrive un qualsiasi testo: usando la punteggiatura che tu useresti per un tema. Se, nella tua testa, il protagonista ha un modo di riflettere misterioso, tetro o simili non vuol dire che questo debba essere esplicato con tanti puntini quanto lui ammicca tra una riflessione e l'altra.\n\nE metterne così tanti non darà questo effetto a chi legge, anzi rende solo il testo faticoso.\n\nLo scritto è nettamente più lineare del parlato. Se vuoi descrivere meglio la scena puoi anche interrompere la riflessione tra le virgolette, immettere un testo più narrativo e descrittivo di come il protagonista vive quel particolare momento per poi riprenderla sempre usando le virgolette.\n\nEs.\n>\"Eppure... a quella Katarina una bottarella gliela darei.\" Pensò, ridacchiando tra sé e sé e lisciandosi i baffi con i polpastrelli.","replies":[{"poster":"Isaak001","date":"2018-07-05T14:46:36.442+0000","up_votes":1,"down_votes":0,"body":"ti ringrazio, cercherò di migliorare su questo ambito, intanto (se hai avuto il coraggio di leggerlo tutto xD) come ti sembra il protagonista?","replies":[]}]}]}]},{"poster":"HaIIeIujah","date":"2018-07-03T19:46:08.489+0000","up_votes":0,"down_votes":0,"body":"> datemi dei consigli se ne ritenete necessari\n\n\"L'uso scriteriato di punti di sospensione non è un valido sostituto per una corretta punteggiatura né per le lettere maiuscole\"","replies":[{"poster":"Isaak001","date":"2018-07-04T12:22:52.487+0000","up_votes":0,"down_votes":1,"body":"era per inserire una riflessione tra un pensiero e l'altro, è una creatura millenaria che dice ad alta voce quello che pensa ed essendo molto vecchio fa molta fatica ad collegare le frasi in modo istantaneo se nemmeno lui è sicuro di quello che sta dicendo, i punti erano per intendere questo... forse ho esagerato","replies":[]}]}]}