{"poster":"ActuallyªPotato","date":"2019-05-28T04:14:54.676+0000","title":"Flaming after game?","subforum":"Player Behavior","up_votes":2,"down_votes":0,"body":"**I only added this person to get an understanding as to why he was flaming me so bad**\r\n\r\nSo after a game this really toxic top laner is flaming all of chat. (I do not have the full screen shot while in game). But come on man, everyone has bad games but that doesn't give you the right to be a terrible human. now Riot queued this team 2 times, the first game he was also toxic in team chat and I reported him after game. The second one is where he/she escalated to the point oh harassing me out of game . Now he was under the assumption that I was queued with the ADC and Support (screenshots prove I wasn't). \r\n\r\nThis post is only to show how crazy stupid some people can get, also telling me to report them is redundant since I have already done so.\r\n   **Total of 5-6 screenshots**\r\n*Gyazo*  Wow 1.0  https://gyazo.com/collections/37b82234fb9c594191f1a0f9e5da8259\r\n\r\n**New game entirely** \r\nEnemy team mid laner was reported for unsportsmanlike conduct ( I feel heavily on this seeing that is the main reason new people stop playing the game over). And I informed him I reported him and this is the response I received. (not pictured is spam friend requests and game invite to continue flaming me\r\n**total 2 screenshots**\r\n*Gyazo* Wow 2.0 https://gyazo.com/collections/0aa1e18a2f288609c65e2bf540b2a2ed\r\n\r\nnow this is just to show you guys how ridiculous people can be, and why reports should always be looked into and followed on. \r\nthanks for stopping by!","replies":[{"poster":"Ph03n1xb1rd","date":"2019-05-28T12:34:07.173+0000","up_votes":1,"down_votes":1,"body":"> now this is just to show you guys how ridiculous people can be, and why reports should always be looked into and followed on.\n\nI totally agree, it ridiculous people add flamers as friends after the game and complain about more flaming.. Kinda absurd, like they were asking for it, just to put it somewhere for some internet points...","replies":[{"poster":"ActuallyªPotato","date":"2019-05-28T14:42:02.422+0000","up_votes":2,"down_votes":0,"body":"they spam added me so I finally said yes just to see what they wanted to say. I wasn't tilted at all, I just wanted to see if he had a point to it.","replies":[{"poster":"Lemexis","date":"2019-05-29T16:23:40.916+0000","up_votes":1,"down_votes":0,"body":"Well usually they don't. You're assuming there is some rationale into it, but you're just wasting your time, really. Stupid people act stupidly, that's all there is to understand. \n\nBut anyway, thanks for the post, there is some weird cathartic virtue in seeing how truly r%%%%%ed flamers are. I've never been tilted by a flamer since I started seeing them as nothing more than mentally challenged 12 years old, I just laugh at them or feel pity, depending on my mood.","replies":[]}]}]},{"poster":"The Anivia OTP","date":"2019-05-28T05:41:21.893+0000","up_votes":1,"down_votes":1,"body":"Yes people are idiots, most of them are offensive and they don't even know it\nthere is nothing much else we can do apart from reporting them.\n\nif you find yourself in front of VERY toxic behavior and faces something that you believe IS unacceptable and really shouldn't be overviewed by the system , keep a \"to ban\" folder on your computer and gather proof against people acting unacceptable ways.\n\nusually , a ban takes between 15 minutes to several hours before being reviewed by the system\n\nif the player is NOT banned in that time (check op.gg for recent games) AND you have sufficient proof to Show someone have misbehaved , Please send support a ticket : https://support.riotgames.com/hc/en-us\n\nremember that the report system is VERY efficient and it really should not be a habit to do so.\n\nkeep this measure for extreme and unpunished cases.","replies":[{"poster":"KFCeytron","date":"2019-05-28T12:56:22.449+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Anivia OTP,realm=EUW,application-id=ZGEFLEUQ,discussion-id=Y3rwwyhU,comment-id=0000,timestamp=2019-05-28T05:41:21.893+0000)\n>\n> Yes people are idiots, most of them are offensive and they don't even know it\n> there is nothing much else we can do apart from reporting them.\n> \n> if you find yourself in front of VERY toxic behavior and faces something that you believe IS unacceptable and really shouldn't be overviewed by the system , keep a \"to ban\" folder on your computer and gather proof against people acting unacceptable ways.\n> \n> usually , a ban takes between 15 minutes to several hours before being reviewed by the system\n> \n> if the player is NOT banned in that time (check op.gg for recent games) AND you have sufficient proof to Show someone have misbehaved , Please send support a ticket : https://support.riotgames.com/hc/en-us\n> \n> remember that the report system is VERY efficient and it really should not be a habit to do so.\n> \n> keep this measure for extreme and unpunished cases.\n\nRiot support considers keeping tabs on a fellow player to see if they've received a punishment to be harassment. I'm not sure why that's worse than, say, flaming, inting, summoner names referring to child rape, etc., but that's how it is, unfortunately.","replies":[]}]}]}