{"poster":"GemelloDug","date":"2018-02-22T00:51:42.921+0000","title":"proposta nuovo champ","subforum":"Creazioni della community","up_votes":4,"down_votes":1,"body":"ho gi&agrave; fatto una proposta ieri su un nuovo champ dicendo che avrei scritto di un&#039;altro \r\n\r\nvedendo tutti i non bronzi vantarsi dei loro bordi colorati o delle skin regalate a fine stagione o pensato di inventare un champ che venisse regalato a tutti i giocatori bronzi \r\n\r\nho pensato cosi perch&eacute; ha un carattere che prende molto ispirazione da un tipico giocatore bronzo \r\n\r\njonathan &egrave; un meccanico di piltover che &egrave; riuscito a farsi odiare da tutta la citt&agrave;. dopo una delle sue ennesime cattiverie verso il popolo &egrave; riuscito ad ottenere una pena di morte.\r\nfortunatamente per lui aveva ancora un vecchio amico d&#039;infanzia che era disposto ad aiutarlo.\r\ndopo esser stato aiutato dal suo amico a simulare la sua morte con una gigantesca esplosione ha vagato per zaun come barbone professionista.\r\n\r\nappena raccimulati odio e soldi sufficienti a viaggiare di nuovo si imbarco di nascosto per ionia dove incontr&ograve; un gentile maestro che gli offri alloggio, \r\nrimase miracolosamente in buoni rapporti con il maestro ma dovette partire perch&eacute; il maestro era l&#039;unico di ionia che era rimasto amico con lui..\r\ngli fu data una barca e l&#039;indicazione di andare dritto per almeno 2 giorni.\r\n\r\naddormentatosi venne brutalmente svegliato da una barca che era passata attraverso alla sua piccola barchina, venne tirato a bordo da un capitano molto &quot;vissuto&quot;.\r\nvenne portato ad una locanda di bilgewater, bevve con il suo amico capitano ma una volta sbronzo si addorment&ograve; sul tavolo si svegli&ograve; in mare aperto..\r\n\r\nappena toccata la riva un piccolo essere con la cresta blu gli punzecchi&ograve; la faccia con una chiave inglese, ricambi&ograve; con un pugno che lo fece volare via vista la piccola statura. fece finta di dimenticare il momento ma poi gli torn&ograve; in mente appena tutta una massa di yordle lo stava inseguendo.\r\n\r\ncadde in un buco e cadde per cosi tanto che si stanc&ograve; di urlare.\r\natterr&ograve; puntualmente di faccia e alzato lo sguardo una signora con la lancia lo aiut&ograve; ad alzarsi. venne portato in una capanna per medicarsi.\r\n\r\nappena si rimise in sesto purtroppo gli si aggiust&ograve; anche il carattere e venne cacciato da kumungu altrettanto rapidamente.\r\n\r\ncammin&ograve; nel deserto senza cibo per almeno 200 anni, o almeno cosi sembr&ograve; a lui.\r\nsvenne dopo appena un giorno di cammino in realt&agrave;.. una carovana lo raccolse da terra per venderlo come schiavo.\r\nraccont&ograve; di saper aggiustare ogni tipo di cosa e venne comprato da una donna viaggiatrice che non lo voleva come schiavo ma solo liberarlo perch&eacute; credeva la schiavit&ugrave; orribile.\r\nincredibile ma nonostante il caratteraccio si innamorarono.\r\n\r\n&quot;l&#039;amore &egrave; bello ma mai eterno&quot; disse lui un giorno a lei.. lei in lacrime sollev&ograve; la terra sotto i piedi di lui e lo fece volare via.\r\n\r\nsopravvisse ma la roccia sfond&ograve; le possenti pareti di demacia. raccont&ograve; tutta la storia al principe, lui comprese che non era proprio colpa sua e non gli diede la pena di morte.\r\n\r\ndovette solo riparare il muro da solo e poi era libero di andarsene senza fare ritorno. \r\n\r\npassarono mesi e mesi. una volta finito gli diedero un mezzo per andarsene e lui non sapendo nemmeno dove si trovasse poggi&ograve; un sasso a terra per vedere in che direzione rotolasse per prendere la direzione.\r\n\r\ne boh, alla fine si ritrov&ograve; in mezzo alla neve.\r\npens&ograve; di morire congelato e che un giorno avrebbero trovato il suo corpo nel ghiaccio.\r\nsi lasci&ograve; cadere nella neve arreso.\r\n\r\nvenne svegliato da una voce possente che disse &quot;un vero uomo muore in battaglia, non fare il poppante&quot;.\r\nvenne afferrato e buttato sulle spalle.\r\n\r\n&quot;come hai fatto a sollevarmi con un braccio solo?&quot; e l&#039;uomo rispose &quot;il mio braccio destro &egrave; molto pi&ugrave; forte del sinistro&quot; e jonathan disse &quot;**** *** ***?&quot; l&#039;uomo scoppi&ograve; a ridere e continu&ograve; a camminare.\r\n\r\nrimase a freljord, l&#039;uomo apprezzava il suo umorismo e si fece degli amici. ma aveva viaggiato cosi tanto che dovette partire di nuovo.\r\n\r\ncammin&ograve; fino a trovare del terreno nero e confuso si chiese dove fosse finito.\r\n\r\nvide un gruppo di soldati passare e dopo aver chiesto dove fosse venne arrestato.\r\n&quot;raccontami tutto o ti servo la specialit&agrave; di draven&quot;\r\nriconobbe il carattere del ragazzo davanti a se e decise di alimentare il suo egocentrismo e di vedere come andava a finire, credeva sarebbe morto e voleva divertirsi un po.\r\n\r\ndivennero migliori amici nel giro di pochi giorni e fece successo come meccanico.\r\nscopri che li la gente cattiva come lui era normale.\r\ndopo aver girato il mondo decise di stabilirsi a Noxus.\r\ndraven gli parl&ograve; di league of legends e si iscrisse all&#039;arena per divertirsi con il suo migliore amico.\r\n\r\n\r\n\r\nabilit&agrave;\r\n\r\npassiva - onniscenza \r\n\r\nfuori dal combattimento jonathan solleva le cuffie dal collo per ascoltare della musica in santapace.\r\nperde visione di tutta la mappa compresi i lumi e gli alleati.\r\nma ottiene una velocit&agrave; di movimento esagerata e schiva automaticamente fino a 4 abilit&agrave; nemiche (il numero di abilit&agrave; schivate e la velocit&agrave; di movimento extra aumentano con il livello)\r\n\r\nl&#039;evocatore potr&agrave; sentire canzoni provenienti dalla playlist di jonathan (musica che cambier&agrave; in base alla skin)\r\n\r\n\r\n\r\nQ - aumento di collezione\r\n\r\njonathan &egrave; molto possessivo, cosi tanto da volere le cose degli altri.\r\nblocca il bersaglio e lo colpisce 4 volte per ottenere la sua roba facendo danni magici.\r\n\r\nse il bersaglio usa il mana gli ruba parte del mana e lo tramuta in mana\r\nse il bersaglio usa energia gli ruba parte dell&#039;energia e la tramuta in salute\r\nse il bersaglio usa rabbia gli ruba parte della rabbia e la tramuta in salute\r\nse il bersaglio &egrave; stupido e non usa niente allora gli ruba salute e la tramuta in salute\r\n\r\nQuesta abilit&agrave; da delle cariche colorate in base a cosa colpisce\r\nnemico carica rossa\r\nmostro della jungla carica verde\r\ndrago carica gialla\r\nbaron carica viola\r\n\r\n\r\n\r\nW - odio mondiale\r\n\r\njonathan ormai conosce tutti nel mondo ed in grado di insultare gravemente le persone.\r\n\r\ncolpire un nemico con odio mondiale lo rallenta e silenzia \r\ncolpire un mostro nella jungla con odio mondiale lo blocca\r\ncolpire un alleato con odio mondiale lo sprona a dimostrare il contrario e gli azzera il costo delle abilit&agrave; per diversi secondi.\r\n\r\nE - non avere paura di me\r\n\r\njonathan ha avuto un&#039;overdose di interesse verso gli altri con tutti i viaggi fatti.\r\ncolpisce un nemico con il rampino non facendo danni. riattivare l&#039;abilit&agrave; porta jonathan sul bersaglio.\r\n\r\nl&#039;abilit&agrave; non viene ostacolata da pareti o minion.\r\ncolpire un nemico non permette a jonathan di uscire dall&#039;area fino allo scadere del tempo a meno che il bersaglio non usa il flash o si sposta pi&ugrave; velocemente di jonathan\r\n\r\nR - io sono meglio di voi.\r\n\r\njonathan trasforma il suo zaino in una enorme torretta noxiana e spara le cariche della Q.\r\n\r\nl&#039;abilit&agrave; si ha gi&agrave; dal livello 1 e non ha livelli sucessivi. i punti verranno suddivisi nelle altre abilit&agrave;.\r\nsi possono usare le cariche ogni volta che si vuole, arrivati a 10 cariche per&ograve; si attiver&agrave; in automatico e dovranno essere sparate tutte.\r\n\r\nattivata la R non ci si potr&agrave; muovere ma soltanto ruotare su se stessi.\r\nil range &egrave; ogni punto di visione della mappa.\r\n\r\nrosso\r\nricopre il bersaglio di energia rossa che lo immobilizza.\r\nha un massimo di 3 cariche, dopo le 3 cariche il bersaglio subir&agrave; danni lo steso ma potr&agrave; essere bloccato di nuovo dopo 20 secondi\r\n\r\nverde\r\nricopre il bersaglio di roba verde schifosa che lo avvelena.\r\nnon ha limite di cariche. dopo ogni colpo aumenter&agrave; il danno in modo incredibile.\r\n\r\n\r\ngiallo\r\nricopre il bersaglio di sostanze illegali provenienti dai draghi.\r\nrallenta il bersaglio e da velocit&agrave; di movimento agli alleati verso il bersaglio colpito.\r\n\r\nviola\r\nricopre il bersaglio di paura.\r\nil bersaglio viene accecato e spaventato per 10 lunghi secondi.\r\navr&agrave; champion provenienti dalle isole dell&#039;ombra che lo rincorreranno e gli faranno danni magici, se viene colpito si prolunga l&#039;effetto.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nho scritto davvero tanto ma spero piaccia a tutto il mondo e che venga creato per noi bronzi. \r\nse viene creato voglio che il suo modo di parlare faccia sembrare kled un boyscout ritardato.\r\n\r\n\r\n\r\ngood luck a tutti voi che leggete, ma solo se siete bronzi.","replies":[{"poster":"Juuzen","date":"2018-03-16T22:22:27.675+0000","up_votes":1,"down_votes":0,"body":"Carino come concept! Però a mio avviso la passiva potrebbe essere perfezionata, perché così com'è crea molti squilibri all'interno del concept:\n1) la passiva toglie vision fuori dal combattimento, ma se volessi usare la ultimate (che ne so, per contrastare un obiettivo da lontano stile Jhin) avrei assolutamente bisogno di avere visione, cosa che però mi viene negata dal champion stesso;\n2) se non hai vision, non puoi utilizzare il tuo kit correttamente. Mettiamo caso che corro come una furia in mid e volessi acchiappare il jungler nemico con la E... non posso usarla perché, appunto, non ho visione fino a quando non sono in combattimento;\n3) se schivo abilità nemiche, viene ancora considerato fuori dal combattimento? Come faccio effettivamente ad uscire dal combattimento se non posso usare le skill di Jonathan su un campione, e se loro non possono usarle su di me?\n\nPer il resto, mi piace molto il concept di caricare la ultimate tramite l'uso della Q! Cosa accade quando utilizzo la Q su un minion? Infliggo danno ma non ottengo cariche? Hai pensato eventualmente a come contrastare un eventuale all-in al livello 1 fortissimo, dal momento che Jonathan ha a sua disposizione ben 3 skill a differenza dell'avversario? Se aiuta il jungler di Q e riesce ad usarla due volte ad esempio, ha una R che può già utilizzare due volte. Se lo giochi top, dove molti champion sono melee, ti viene praticamente immediato riuscire a buttare qualche Q ed accumuli ancora più cariche. Se poi utilizzi le cariche rosse (che hai già accumulato), non solo fai molti danni ma blocchi anche il nemico, causandogli ancora più danni.\n\nCosa accade quando utilizzi la W su di te? Non è contemplato come caso?\n\nCome base sembra divertente e frenetico, forse un po' simile a Kled (Q di Jonathan ->  W di Kled, E di Jonathan -> Q di Kled), però come base non è affatto male!","replies":[{"poster":"GemelloDug","date":"2018-08-18T18:31:12.035+0000","up_votes":1,"down_votes":0,"body":"è un po che non entro sul forum comunque era solo un'idea non penso lo faranno mai","replies":[]}]},{"poster":"fra8breaker","date":"2018-02-23T09:34:42.032+0000","up_votes":1,"down_votes":0,"body":"...la passiva è inattuabile non penso che nessuno lo cagherá mai pure se era un bel concept","replies":[]},{"poster":"Aurelion Shmoll","date":"2018-02-22T01:44:13.692+0000","up_votes":1,"down_votes":0,"body":"Regalato ai bronzi, ma acquistabili da tutti, deduco, spero.\n\nIl suo kit è broken AS FAST BOI.  Dipende molto dal suo scaling, dal cdr, dalla tipologia di cast e range. Ma se non con uno scaling infimo sarebbe ingiocabile, essendo ban or pick.\n\nLa passiva ha un concept che mi piace parecchio, ma se si attiva fuori combattimento rimane tale finché non entra in tale? Sarebbe cieco finché non sbatte contro qualcuno \\o/ In ogni caso sarebbe irrilevante essendo molto abusabile con una buona comunicazione vocale, non essendo un proprio binding ma un semplice fumogeno globale.   Sarebbe bilanciata se il resto non fosse broken as FAQ.\n\nLa sua ultimate ha effetto la dove si ha vision. Twsited Fate & Ashe mate, sarebbe ridicolmente stupido averli insieme.\n\nLa W azzera i cd alleati? Se lo fa pure sulle ultime sarebbe inconcepibilmente divertente e broken. \nMordekaiser che clona due nemici, Karthus che con 2 ult toglie il 90% degli hp nemici, Kayle che rende immortale un adc per 6 secondi, wtf \\o/. Nel caso riducesse il cd potrebbe passare, ma anche azzerando tutte le abilità ad esclusione delle ultimate sarebbe osceno.\n\nLa E ignora muri e minion? Gesù mate, sarebbe comprensibile come gap closer nel caso avesse un range estremamente basso (E di Ekko), ma in quel caso sarebbe strano come concept essendo un rampino <-<\n\nLa Q \"blocca\" il nemico, suppongo sia un tipo di cc, se intendi snare come blocco sarebbe inutile come concept, perché qualcuno dovrebbe attaccarti se a conoscenza della sua passiva? Se per \"blocco\" intendi stun o suppress, non può attaccarti che senso avrebbe?  Al di la del concept no sense di questa abilità il resto dipende dalle sue statistiche.\n\nLa storie non fanno per me, ho solo letto un riferimento a Tryndamereeee, anche se non lo facevo un tipo da risatine sarcastiche. \n\nGJ man, il concept della passiva mi piace assai, sembra molto divertente.","replies":[{"poster":"GemelloDug","date":"2018-02-22T02:09:45.458+0000","up_votes":1,"down_votes":0,"body":"non credevo davvero potesse piacere cosi tanto xd \n\nvolevo mettere più citazioni nella storia ma più la facevo dettagliata più sarebbe stata lunga e visto che nemmeno a me piace leggere ho optato per allusioni ad alcuni dei personaggi delle varie zone.\n\nla W c'è scritto che azzera il costo non il tempo ma la tua idea è anche più divertente \n\nla passiva è fuori dal combattimento come tante altre abilità passive di alcune abilità o oggetti, se attacchi o vieni colpito: dai champ, i minion le torri e altro si interrompe. forse non mi sono spiegato bene nel testo ma non schiva gli auto attacchi, solo le abilità\n\ne si regalato ai bronzi e comprabile dagli altri, l'avevo omesso perché pensavo fosse ovvio..\n\nho pure dimenticato di dire che è un champ corpo a corpo \n\nhai ragione a dire che sarà pick o bannato ma è cosi anche yasuo e tanti altri champ. Quindi non credo sia un problema vero.\n\ngrazie per i complimenti, i suggerimenti e tutto il resto\n\n\nmolto ridicolo come champ ma se hanno fatto zoe non vedo perché non possono fare anche lui xd","replies":[]}]}]}