{"poster":"ZetsubouKami","date":"2018-01-20T09:55:54.585+0000","title":"Another post sull' hell of bronzo","subforum":"Discussioni generali","up_votes":5,"down_votes":3,"body":"Allora cari mamma e pap&agrave; riot, o signior mario riot che tu sia, premetto che ho l&#039;elo che merito, sicuramente, e pure il mio mmr e tutto il mio profilo &egrave; un concentrato di ci&ograve; che merito e ci&ograve; che ho guadagnato.. E capisco che essendo un multigiocatore di massa non pu&ograve; essere troppo rigido, ma, se per caso, ci fossero player che raggiunto il 30 e comprato i 20 champ meno costosi si buttassero in rank, non credo si meritino di poterlo fare.. E capisco che un buon player deve saper affrontare ogni avversit&agrave; senza farsi scoraggiare, ma spiegatemi una cosa.. PERCHE ?\r\nPerch&eacute; non mettere un minimo maestria od un qualche sorta di missione prima di affrontare le ranked ? Perch&eacute; &egrave; cos&igrave; essenziale che bisogna incontrare con tanta facilit&agrave; certi giocatori se si entra in bronzo ?.. Perch&eacute; va bene che dopo le prime due kill filate a tempo giusto di tornare in lane la squadra dovrebbe aiutare la lane in difficota, ma c***o siamo seri ? In bronzo certi player li vedi andare in maniera sconfusionata contro champ che non conoscono a skillare a caso e flammare perch&eacute; nessuno li aiuta, o forse sono tristi di essere morti da soli, questo non lo so.. Ma quindi spero che qualcuno mi dica perch&eacute; &egrave; cos&igrave; essenziale conoscere il problema e non filtrare meglio i giocatori che possono partecipare o no alle ranked. Va bene che &egrave; un multigiocatore di massa e tutti devono avere una possibilit&agrave;, ma siete i voi a dire che per prima cosa &egrave; il nostro sport, e io non vedo molte cinture bianche andare a fare sfide ufficiali.. Se rendo l&#039;esempio..\r\nScusate lo sfogo ma erano cose che dovevo dire, io tanto credo, o per lo meno spero,  di uscirne a breve, mi spiace solo per tutti quelli che ci passano, me compreso\r\n{{sticker:zombie-nunu-bummed}}                        {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"BabacioLegend","date":"2018-01-21T11:06:29.381+0000","up_votes":2,"down_votes":0,"body":"Beh effettivamente non sarebbe male inserire un girone principiante sotto al bronzo che non significa essere scarsi ma semplicemente inesperti, nelle rank cambiano molte cose, dai premade che ti rektano con morgana jungl alla vayne top che non credevi sciogliesse il tuo renekton in 3 colpi. Un girone di 2 rank Principiane ed intermedio, dopo di che' si ha l'accesso al bronzo senza promo, magari come il master si fa la somma dei punti e non si rimuovono alla sconfitta ma semplicemente si ha un +0. Questo aiuterebbe chi non ha tempo da dedicare al gioco e suo malgrado si ritrova b5 con ragazzi che effettivamente non conoscono le basi ed inoltre aiuterebbe i principianti ad affrontare una classifica.","replies":[{"poster":"ZetsubouKami","date":"2018-01-21T15:37:22.710+0000","up_votes":1,"down_votes":0,"body":"Io perà parlavo appunto di una soluzione per i principianti, ma più che un girone, un metodo di allenamento interno al gioco, in modo che le strategie, qualche tecnica oppure qualche metodo di gioco non li scopra solo lo stronzo che apre Google ma riesca a migliorare anche il bastardo che gioca da due settimane e fa solo ranked xD","replies":[]}]},{"poster":"Dr LouD","date":"2018-01-20T10:21:00.340+0000","up_votes":2,"down_votes":0,"body":"Se pensi che si possa migliorare giocando normal sei totalmente sulla strana sbagliata\nAl tempo mi buttai in ranked appena fatto il 30 e conclusi la stagione in silver alto pur avendo giocato ranked per nemmeno 3 mesi\n\nE' normale che in bronzo si giochi a caso, e per mia esperienza un neofita appena arrivato al 30 ha molte più probabilità di salire di un giocatore di lunga data bloccato da sempre in low elo","replies":[{"poster":"ZetsubouKami","date":"2018-01-20T15:08:37.244+0000","up_votes":1,"down_votes":0,"body":"Si e no, anche io mi piazzai silver, smisi di giocare, ripresi stagione successiva bronzo (te la danno sempre inferiore alla precedente) ho rovinato l'mmr e vincevo 13 pl perdendone 23 circa.. Ora ho rincominciato. \nMa non so se l'mmr si resetti con le stagioni ma lo spero\nE comunque neofita che vuole migliorare ok, io parlo di quelli che li vedi dai, giochiamo allo stesso gioco sai di cosa parlo.","replies":[{"poster":"Dr LouD","date":"2018-01-20T17:00:11.221+0000","up_votes":2,"down_votes":0,"body":"Il bronzo esiste appositamente per quelli che non sanno giocare e non vogliono migliorare, il silver è un elo di transizione ed è li che si decide se hai la voglia di imparare e salire o viceversa\n\nSemplicemente un nuovo giocatore parte in silver, da li sale o scende a seconda della skill e della voglia di imparare a giocare\n\nQuindi non ha senso lamentarsi di loro in bronzo, sono quelli che fanno meno danni","replies":[{"poster":"ZetsubouKami","date":"2018-01-20T17:17:43.519+0000","up_votes":2,"down_votes":0,"body":"In sostanza ho fatto una stronzata ad abbandonare la mia preama season poco dopo i piazzamenti :/","replies":[{"poster":"Dr LouD","date":"2018-01-20T17:26:59.110+0000","up_votes":2,"down_votes":0,"body":"Non è mai una buona idea smettere di rankare se si vuole migliorare","replies":[{"poster":"ZetsubouKami","date":"2018-01-21T15:37:55.768+0000","up_votes":1,"down_votes":0,"body":"Già già me ne sono reso conto ahah","replies":[]}]},{"poster":"Frattaglia","date":"2018-01-21T14:16:26.329+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZetsubouKami,realm=EUW,application-id=MJVj50Jw,discussion-id=Eq1ul1X0,comment-id=0001000000000000,timestamp=2018-01-20T17:17:43.519+0000)\n>\n> In sostanza ho fatto una stronzata ad abbandonare la mia preama season poco dopo i piazzamenti :/\n\nSi. \nInsisti e gioca ragionando su quello che fai. Qualcun altro ti suggeriva di copiare gli altri, di solito chi è in alto usa delle rune/summoners/build fatte in un certo modo perché semplicemente sono le ottimali in quella patch, per quel campione e per quel ruolo.\nCopia ma usando la testa.\n\nSecondo me hai l'atteggiamento giusto, insisti. :)","replies":[{"poster":"ZetsubouKami","date":"2018-01-21T15:39:45.175+0000","up_votes":1,"down_votes":0,"body":"Si effettivamente me ne sono reso conto che è cambiato anche il modo in cui gioco, la cosa che mi da fastidio è che in low elo non si gioca per dare meno kill possibili ma per farne quante più se ne riesce \n{{sticker:slayer-jinx-unamused}}\nVhr lo capisco anche io giocavo così, infatti in bronzo ci sono bloccato per una ragione, ma infatti mi ero fermato a rankare una volta capito che non andavo lontano per come giocavo xD ","replies":[]}]}]}]}]}]},{"poster":"Fogato","date":"2018-01-20T15:45:04.582+0000","up_votes":2,"down_votes":0,"body":"Capisco cosa intendi.\nIl problema è che la gente vuole essere carriata, non ragiona che se vuole vincere deve metterci il suo contributo e non parassitare sugli altri!","replies":[{"poster":"ZetsubouKami","date":"2018-01-20T17:19:33.440+0000","up_votes":1,"down_votes":0,"body":"Si fra gente che non sa giocare e gente che gioca per noia o addirittura per perdere perché flamma con un compagno va beh, sto pensando di mollare l'account e riprovare con un piazzamento fresco :/\nChe poi va beh, a volte capita che sbaglio di brutto e feedo qualcuno, ma, credo non così spesso rispetto alla roba che trovo.. Poi magari ora come ora è solo un po di soggezione..","replies":[{"poster":"Fogato","date":"2018-01-20T18:20:15.245+0000","up_votes":1,"down_votes":0,"body":"Non ha senso rifare i piazzamenti, alla fine sono elo bassi dove vinci più LP di quanti ne perdi, se hai piu vittorie che sconfitte sali anche con un 40% di winrate.\nDevi insistere e migliorare così tanto da vincere ad occhi chiusi contro un bronzo, non dovrebbe mai capitarti di perdere contro un bronzo/silver.\nPraticamente devi vincere velocemente la tua lane e andare a vincere quella degli altri che stanno perdendo, è una cosa che fa schifo in un gioco che professa il \"teamwork op\" dato che teamwork vuol dire che anche gli altri fanno qualcosa (di diverso dal feddare).","replies":[{"poster":"X9Twitch","date":"2018-01-21T10:55:27.798+0000","up_votes":1,"down_votes":0,"body":"Non ha senso rifare i piazzamenti, alla fine sono elo bassi dove vinci più LP di quanti ne perdi e ~~se hai più vittorie che sconfitte~~ sali anche con un 40% di winrate.\nAltrimenti il discorso è in contraddizione.. 40% di winrate significa più sconfitte che vittorie e quindi devi guadagnare più LP da una win che da una lose.\nSe ogni giocatore ha più vittorie che sconfitte sale per forza prima o poi.","replies":[{"poster":"Fogato","date":"2018-01-25T23:41:09.232+0000","up_votes":1,"down_votes":0,"body":"si quella parte di discorso era da cancellare, stavo scrivendo \"sali se hai piu vittorie che sconfitte\" ma poi ho pensato che non è vero dato che guadagni piu LP di quanti ne perdi e volevo cambiare con \" sali anche con un 40% di win rate\"","replies":[]}]}]}]}]},{"poster":"Aurelion Shmoll","date":"2018-01-20T13:24:40.372+0000","up_votes":2,"down_votes":0,"body":"Non puoi pretendere niente dal bronzo.\n****\nSe fosse una cintura, sarebbe di plastica comprata ai cinese, non cintura bianca.","replies":[{"poster":"ZetsubouKami","date":"2018-01-20T15:04:04.238+0000","up_votes":1,"down_votes":0,"body":"lol va beh era per interderci xD","replies":[]}]},{"poster":"CasualNoobITA","date":"2018-01-20T19:46:16.130+0000","up_votes":1,"down_votes":0,"body":"Ciao !\nPer te \"le cinture bianche\" dove dovrebbero stare ?\nStai parlando dell'ultima lega , è ovvio che i \"meno bravi\" si trovino li :P .\n\n\nhttps://www.youtube.com/watch?v=7-oFte8cGHc\n\nP.S. non credere che nelle altre leghe la situazione sia migliore :P !\n\n\n\"But now I realize\nFrom challenger to bronze 5\nNo matter where you are\nYou're in elo hell\"","replies":[{"poster":"ZetsubouKami","date":"2018-01-20T20:27:00.001+0000","up_votes":1,"down_votes":0,"body":"Si effettivamente ieri ci stavo pensando ad una cosa, molte volet (Molte non vuol dire tutte) non è un cattivo giocatore ma solo in una cattiva partita ed aiutarlo potrebbe risollevare la situazione e poi prosegue da solo, ma altrettante volte la gente inizia il game e si stufa, e credo e dico credo, in bronzo siano moltissimi di più i player che se la ragionano così.....","replies":[{"poster":"CasualNoobITA","date":"2018-01-20T20:54:55.809+0000","up_votes":2,"down_votes":1,"body":"Io la vedo in un'altra maniera ancora ! \nPerchè pensi che sia il giocatore nel tuo team ad essere \"scarso\" o ad avere una brutta giornata ? Semplicemente l'avversario era piu' forte o aveva una buona giornata !\n\nHonor the enemy and go next .","replies":[{"poster":"ZetsubouKami","date":"2018-01-21T15:52:05.934+0000","up_votes":1,"down_votes":0,"body":"Credo che sia direttamente proporzionale :) \nRispetto sempre (o quasi) il team nemico in chat globale dopo una bella azione xD \nEd altro canto provo anche sempre a risollevare il morale della mia squadra o la complimento quando gioca bene (Provando a seguire il consiglio di mamma riot e vedere se anche io ho quel fottuto 27% di partite vinte in più) xD","replies":[]}]}]}]},{"poster":"Frattaglia","date":"2018-01-20T10:13:33.436+0000","up_votes":1,"down_votes":0,"body":"Il bronzo è la lega più in basso, quindi è possibilissimo che ci siano persone che giocano in maniera sconclusionata. Tendenzialmente fanno un sacco di errori, chi più in una cosa chi più in un'altra.\nPensi di essere meglio? Continua a giocare ed escine! \nSe non ci riesci, ripensa invece a quali sono gli errori che fai tu perché sono quelli che ti tengono inchiodato là. \n\nDai che hai tutta la stagione per arrivare in oro! :)","replies":[{"poster":"ZetsubouKami","date":"2018-01-20T15:11:49.648+0000","up_votes":1,"down_votes":0,"body":"Si si per carità se leggi non sto dicendo di essere il top gamma bloccato per i compagni di squadra, solo che secondo me il passaggio tra new bie e scalatore è troppo sottile, tutto li.\nE non credo di essere l'unico a pensarlo credo, anche perché la bronzo ora come ora è il fondo di barile (citando un commento in alto) penso solo che dovrebbe essere invece un punto di partenza per ci si impegna. Poi magari mi sbaglio ed è tutto come vuole la riot, invece che semplicemente ignorino certe leghe, che comunque, sono sempre di sua proprietà.","replies":[{"poster":"mansitkd","date":"2018-01-21T00:25:34.490+0000","up_votes":1,"down_votes":0,"body":"leggi guide, gioca con amici ed usa champion in meta, e non nasus jungle che non lo vedo dalla season 2...","replies":[{"poster":"ZetsubouKami","date":"2018-01-21T15:49:29.113+0000","up_votes":1,"down_votes":0,"body":"Effettivamente sono l'unico stronzo che io abbia mai visto usare nasus in jng, ma prende delle stack con la q molto velocemente ho notato, comunque si mi hanno anche consigliato un sito da andare a guardare che credo ci siano le meta le build e consigli utili, mi aggiornero patch per patch, alla fine credo che sia fondamentale per un buon player ^^' mb","replies":[{"poster":"Power Mac","date":"2018-01-23T15:44:41.880+0000","up_votes":1,"down_votes":0,"body":"Intervengo tardi, ma per quanto riguarda le build, se non lo conosci scarica Championify e scegli le build di Champion.gg (e op.gg se sei interessato alla frequenza d'uso degli oggetti e ad esplorare alternative patch per patch), aggiornando ad ogni patch: sono comodissime, da quando le uso le mie build sono migliorate esponenzialmente!","replies":[]}]}]}]}]},{"poster":"Power Mac","date":"2018-01-21T12:25:07.438+0000","up_votes":1,"down_votes":0,"body":"Credo che la migliore soluzione, non solo per il Bronze ma soprattutto, sia introdurre come requisito per giocare i campioni il livello di maestria 4, di modo da avere una garanzia minima sul fatto che l’utente sappia almeno come si usa.","replies":[{"poster":"Phrasant","date":"2018-01-21T14:10:05.751+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Power Mac,realm=EUW,application-id=MJVj50Jw,discussion-id=Eq1ul1X0,comment-id=000a,timestamp=2018-01-21T12:25:07.438+0000)\n>\n> Credo che la migliore soluzione, non solo per il Bronze ma soprattutto, sia introdurre come requisito per giocare i campioni il livello di maestria 4, di modo da avere una garanzia minima sul fatto che l’utente sappia almeno come si usa.\n\n\nNon penso che la maestria sia una garanzia adeguata in quanto basta giocare qualche partita (senza bisogno di vincere e/o giocare bene) per far salire un campione di livello. Un esempio è il classico main Yasuo maestria 7 con 500k che non esce dal bronzo. \nIn più, saper giocare giocare un campione, anche il minimo richiesto per \"non perdere la lane\" (bada, nemmeno necessariamente vincere) , non significa sapere come vincere una partita.\nE comunque ,fare i primi 30 livelli di un account,_** credo**_ siano sufficienti per portare qualche campione a maestria alta...","replies":[{"poster":"Power Mac","date":"2018-01-22T15:53:25.709+0000","up_votes":1,"down_votes":0,"body":"Eh lo so, la penso allo stesso modo, per questo ho parlato di garanzia minima. Però almeno, una maestria 4 (o addirittura 5) potrebbe finalmente avere un senso ed iniziare a scremare i first time e chi gioca un campione da troppe poche partite. Oggi ci vuole la metà del tempo per arrivare al lvl 30 rispetto a quando abbiamo cominciato a giocare, quindi in realtà non è assolutamente detto che un utente nuovo, specialmente se compra diversi campioni, ci arrivi (o almeno, con un buon numero).\nVincere la partita è in effetti tutt'altra cosa, e quello non lo si può mai dare per scontato, perché alla fine la vittoria risulta dal lavoro di tutto il team, perciò il massimo che si può chiedere è avere vinto perlomeno una ventina di partite con quel campione: lo so, significa poco ma sarebbe meglio di niente, perché non si possono mettere chissà quanti vincoli alla fine.","replies":[]}]}]},{"poster":"Sibillam","date":"2018-01-21T17:58:11.123+0000","up_votes":1,"down_votes":0,"body":"Ed i \"First time\" in ranked dove li mettiamo? Mamma riot salvaci tu...","replies":[{"poster":"ZetsubouKami","date":"2018-01-21T18:46:13.941+0000","up_votes":1,"down_votes":0,"body":"Ecco appunto, secondo me è proprio il meccanismo delle ranked ad essere difettoso, anche perché dai commenti generali sembra che nelle leghe successive non migliorare la gente xD","replies":[]}]},{"poster":"mansitkd","date":"2018-01-20T15:21:09.911+0000","up_votes":1,"down_votes":0,"body":"basta pensare prima di fare una cosa e dal bronzo si esce, anche senza mani","replies":[{"poster":"ZetsubouKami","date":"2018-01-20T17:22:51.938+0000","up_votes":1,"down_votes":0,"body":"Ma a furia di guardare video, trainarmi i champ, provare nuovi champ e nuove cose quello è vero, ma spesso io non so cosa fare quando vedo la mia squadra che si lascia a se stessa per una brutta partenza, ed in bronzo sono cose che capitano ad ogni brutta partenza dopo il soli mega flame xD","replies":[{"poster":"mansitkd","date":"2018-01-20T23:47:30.298+0000","up_votes":1,"down_votes":2,"body":"sei bronzo 5 ed un motivo c'è","replies":[{"poster":"ZetsubouKami","date":"2018-01-21T15:52:52.084+0000","up_votes":1,"down_votes":0,"body":"Oddio qualcuno che sa leggere e ripetere ciò che scrivo!!!! Devi assolutamente avere una medaglia te... \n{{sticker:slayer-jinx-unamused}}\nSarcasmo a parte, no si è vero, infatti ho aperto un post per ricevere consigli da chi bronzo 5 non è xD Anche se all'inizio era solo uno sfogo verso riot dopo una brutta partita","replies":[]}]}]}]},{"poster":"Nabbomaster","date":"2018-01-20T10:21:49.140+0000","up_votes":1,"down_votes":1,"body":"giochi dalla season 6 e ancora giochi con il tp al posto del flash\ne poi chiedi alla riot di non buttare i nabbi in ranked? \nma fargli fare un minimo di esperienza?\nsi vedono i risultati dell'esperienza con te","replies":[{"poster":"ZetsubouKami","date":"2018-01-20T15:05:07.737+0000","up_votes":1,"down_votes":0,"body":"Gioco col tp al posto del flash con trynda che ha un suo flash non farlo sembrare prassi '-'\nE si gioco dalla season 6 nei piazzamenti e poi mollato la, piazzato a bronzo nella season 7 e rimollato la sempre perché non mi reputavo all'altezza di iniziare a scalare, ed eccoci alla season 8 in cui ho deciso che forse posso iniziare a provarci.\nE visto che ti senti critico se hai consigli li accetto sia ben chiaro, ma magari un po meno pungenti, che ne dici ? \n","replies":[{"poster":"MisogiKumagawa","date":"2018-01-20T21:58:10.514+0000","up_votes":1,"down_votes":0,"body":"Resta comunque un errore,quello di trynda è un dash è può essere stoppato,mentre il flash è un blink e non può essere stoppato dato che è instantaneo,di champ che non hanno bisogno del flash sono Heca ,Shaco o al massimo gente come Yi e Ww per i gank","replies":[{"poster":"ZetsubouKami","date":"2018-01-21T15:47:12.623+0000","up_votes":1,"down_votes":0,"body":"Si effettivamente è vero, per carità e lo sapevo anche, che un silencs uno stun o simili mi svantaggia, ma forte del fatto che in bronzo la gente non è così studiata non mi ha dato particolari difficolta per ora, e con tp riesco magari ad arrivare di nascosto nella lane del feedone (Quando non capita a me perch+ a volte capita eh) e magari aiutarlo un po più spesso.\nInfatti era mia piena intenzione non abituarmici troppo xD","replies":[]}]},{"poster":"Darkinknight","date":"2018-01-21T00:38:57.223+0000","up_votes":1,"down_votes":0,"body":"Se vuoi un consiglio te lo do molto semplice. Smetti di giocare con teorie tue,ed adeguati a chi di questo gioco ne sa di piu. Fai dei copia e incolla (o quasi) finche non impari le basi. Attualmente usi champ in ruoli sbagliati,summoner sbagliate, rune sbagliate, build sbagliate. Prendi un sito come op.gg e attieniti a cio che ti riporta li","replies":[{"poster":"ZetsubouKami","date":"2018-01-21T15:44:11.428+0000","up_votes":1,"down_votes":0,"body":"Ci farò un salto e poi risponderà sicuramente qualcosa di più adeguato, per ora posso solo dire che si che ho visto qualche video di partite fatta da gente brava ma mai per copiare champ e build effettivamente ma più per imparare trucchi e posizionamento per lo più, ma grazie del consiglio :)","replies":[]}]}]}]},{"poster":"Zekutsu","date":"2018-01-21T11:59:01.756+0000","up_votes":1,"down_votes":0,"body":"E' vero che in bronzo trovi quelli \"bravini\" e delle scimmie da circo, ma proprio per questo ti devi concentrare su te stesso più che sugli altri.\nIo per uscirne ho spammato MF e ci ho messo poco più di un mese (da B4 a S5), quindi ti consiglio di scegliere UN ruolo ed uno o due champ in meta (non troppo difficili magari). Dovresti uscirne :\\","replies":[{"poster":"ZetsubouKami","date":"2018-01-21T15:42:16.565+0000","up_votes":1,"down_votes":0,"body":"Ho tutte le più grandi aspettative del mondo sul fatto che questa season ne esco !\nAnche se il tuo nick è un po simile al mio eh.. xD","replies":[]}]},{"poster":"mikellazzo","date":"2018-01-20T12:45:35.794+0000","up_votes":1,"down_votes":0,"body":"Perchè il bronzo è il fondo del barile","replies":[{"poster":"ZetsubouKami","date":"2018-01-20T15:13:52.680+0000","up_votes":1,"down_votes":0,"body":"Mai messo in dubbio. Mai, manco una volta. Zero proprio. xD","replies":[]}]}]}