{"poster":"RlP K0BE","date":"2016-12-07T04:44:21.667+0000","title":"@KateyKhaos About Warring Kingdoms Vi","subforum":"Story, Art, & Sound","up_votes":4,"down_votes":2,"body":"I know its really early and this might be a dumb question but do you guys have anything planned for Vi&#039;s passive W? The skin is pretty much an insta-buy for me but the red and blue circles are kind of hard to look at.","replies":[{"poster":"Riot LoveStrut","date":"2016-12-09T21:56:15.249+0000","up_votes":6,"down_votes":1,"body":"Hellooooo~\n\nWe actually got the okay to change the circle indicators on Vi's Denting Blows (W), so you can see some updates soon! We weren't able to change the 3rd hit's red indicators for gameplay clarity, however. I'm still in talks between gameplay and vfx though, so there could be more updates coming as well!","replies":[{"poster":"RlP K0BE","date":"2016-12-10T02:05:49.456+0000","up_votes":1,"down_votes":0,"body":"Thanks, I just saw some of the new changes to her W and R on the PBE and they look amazing. The skin was already an insta-buy for me but now I really can't wait!","replies":[]},{"poster":"Ralanr","date":"2016-12-09T22:14:38.616+0000","up_votes":1,"down_votes":0,"body":"I hope we can get some VFX changes to make it sound like a Chinese gong.","replies":[]}]},{"poster":"DwarvenGiant","date":"2016-12-07T06:14:26.973+0000","up_votes":2,"down_votes":0,"body":"Carl (Riot LoveStrut) [said](https://twitter.com/RiotLoveStrut/status/806297060018270208) that they can't significantly change the W circles particles.\nHe even [explained](https://twitter.com/RiotLoveStrut/status/806297163881775104) why _they were_ able to do it for Demon Vi.\n\nHowever, he's currently taking a player's suggestion to the team- [He's looking into](https://twitter.com/RiotLoveStrut/status/806306861766979584) the possibility of changing the blue tint of the W circles into a Jade-green one (while keeping the red).","replies":[{"poster":"RlP K0BE","date":"2016-12-07T07:21:25.274+0000","up_votes":2,"down_votes":0,"body":"Thank you. I hope they can do something.\n\nMaybe they could change the shape from circles to the same shape as the shield in her w animation.","replies":[]}]}]}