{"poster":"8n3dqa4Y7M","date":"2016-11-01T09:17:50.664+0000","title":"Riot banning and muting falsely is getting out of hand.","subforum":"Player Behavior","up_votes":2,"down_votes":20,"body":"I&#039;ve had multiple friends and myself banned and muted for short duration simply from toxic and raging people reporting me from premades. I was banned for a whopping 14 days, no warning nothing, for QUOTING what a toxic player said to me, in after game chat. This game is a joke when so many people are being punished under a false system that can be abused simply by toxic people reporting you just for not liking how you play, or doing poorly in a match. The fact it doesn&#039;t take quotations into account is sad as well. This game has now become a game where the toxicness is encouraged by the report system, and this community has become pure filth. The fact automated bans even happen is a joke. No appeal is an even bigger joke. So I get faslsely banned because a few people in a normal game didn&#039;t like the way i jungled with tryndamere? Guess I get banned. The amount of money and time I&#039;ve put into this game and the treatment I receive back is disgusting. i haven&#039;t been able to play a single game of league in probably months now without at least 1-2 people on my team or enemy team flaming, raging, being passive aggressive, and trying to get reaction out of others. You know why? They can get away with it. &quot;just mute them&quot; you say?. Not everyone wants to play a multiplayer communication based game just to be forced to mute everyone who has one small issue with you, or rags on one mistake you make. Anyway I&#039;m done spending any money on this game for good. It doesn&#039;t deserve it with such a horrible system and community. I don&#039;t care if my small amount of money I used to spend on this game doesn&#039;t matter to Riot, but sooner or later more and more people will stop as well, and many people are already very well aware of how terrible of a community and report system this game has. Fix your awful system Riot, this used to be a fun game to play, but not anymore.","replies":[{"poster":"Riot Tantram","date":"2016-11-02T00:55:22.247+0000","up_votes":9,"down_votes":0,"body":"> I was banned for a whopping 14 days, no warning nothing, for QUOTING what a toxic player said to me, in after game chat.\n\nThe 2 chat restrictions you received were warnings.\n\nIf you feel your penalty is unjustified, you can post the chat logs provided in your reform card and I'd be happy to take a look for you.","replies":[{"poster":"Zelorxon","date":"2016-11-03T01:20:39.335+0000","up_votes":1,"down_votes":0,"body":"Hey, Mr Rito Senpai, just a curiosity, is it toxic making sarcasm such as \"welp, you suicided\", \"there goes baron...\", \"Please, keep going 1v5, i'm sure you'll get em champ!\" or remarking someone's mistakes like \"you died for no reason\", \"your recall after the ace was the reason that lost us the match\", \"i told you to push, why you didn't do it?\" and \"you fucked up my gank\"?\nNot that i'm willing or tempted to commit thoughtcrime, far from it, but you know, just in case so i know what are the limits i can move in, right now i'm a huge fan of the /mute all in every match that matters, since they're not worth my time and it isn't worth to feel bad because a IE/statikk varus calls you a noob because you do stuff that he doesn't comprehend, for every other match, let the kids talk and have fun (unless i'm really tired, in that case the /mute comes for you too, you know, i'm not getting paid to hear nonsense in a videogame when all i'm trying to do is to just have a good time).","replies":[]},{"poster":"NastyMcOutplay","date":"2016-11-02T03:15:37.371+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Tantram,realm=NA,application-id=ZGEFLEUQ,discussion-id=hvBWNJMt,comment-id=000b,timestamp=2016-11-02T00:55:22.247+0000)\n>\n> The 2 chat restrictions you received were warnings.\n> \n> If you feel your penalty is unjustified, you can post the chat logs provided in your reform card and I&#x27;d be happy to take a look for you.\n\ni got a 10 game mute once for saying kappa was a dead meme and that our kayle was toxic","replies":[{"poster":"CooL Ice Tea","date":"2016-11-02T07:14:27.958+0000","up_votes":1,"down_votes":0,"body":"Post your chatlogs in another thread then. People often think \"kayle was toxic\" is the only thing they did wrong.\n\n\"report Kayle\" <- Toxic\n\"lul kayle better keep going in with your 1/9 noob\" <- toxic\n\"kayle stfu and group idiot\" <- toxic\n\"9x kayle please\" <- toxic\n\nPost your chatlogs, maybe we find more then you think.","replies":[]}]}]},{"poster":"Sarutobi","date":"2016-11-01T09:26:39.361+0000","up_votes":5,"down_votes":0,"body":"Why do you need to repeat what they said is my question? Like what is the point of just repeating what they said? It holds no barrin to you and just make it seems like you are just as toxic. \n\nBut like others have said post your logs. You cannot claim that they are banning you falsely when you hide your chatlogs. Also note your warning are when you read the ToS after every patch, as well as your chat restrictions. So you cannot say you weren't warn when you said it yourself that you gotta chat restricted and then ban after that. You are breaking the rules and refusing to learn from it!","replies":[]},{"poster":"Sona Ping","date":"2016-11-01T11:04:03.290+0000","up_votes":4,"down_votes":0,"body":"TNL;DR\n\nToo \"No logs\"; Didn't Read","replies":[]},{"poster":"BeatzBoyFTW","date":"2016-11-01T09:18:43.173+0000","up_votes":4,"down_votes":0,"body":"Chat logs. Post them, not this paragraphic crap.","replies":[]},{"poster":"NiamhNyx","date":"2016-11-01T09:35:35.320+0000","up_votes":1,"down_votes":6,"body":"You wont get banned for post game chat unless people screenshot and write a ticket, and riot would be able to tell if you were \"quoting\" something. \nI find that 99% of people who get a temp ban and don't post the chat logs, are liars.","replies":[{"poster":"EvilDustMan","date":"2016-11-01T09:38:09.475+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=NiamhNyx,realm=NA,application-id=ZGEFLEUQ,discussion-id=hvBWNJMt,comment-id=0003,timestamp=2016-11-01T09:35:35.320+0000)\n>\n> You wont get banned for post game chat unless people screenshot and write a ticket, and riot would be able to tell if you were &quot;quoting&quot; something. \n> I find that 99% of people who get a temp ban and don&#x27;t post the chat logs, are liars.\n\nIncorrect, all you need to write is 'post game chat' in the report, they recorded the post game chat but it isn't checked by the bot.","replies":[{"poster":"llillllilllllill","date":"2016-11-02T06:39:05.016+0000","up_votes":1,"down_votes":0,"body":"Can a Riot admin verify that post game chat is recorded? Because I feel like there isn't a single match in years where someone hasn't said something terrible in post game chat, and I would like to know if I really can report people for this.","replies":[]}]}]},{"poster":"Limmie","date":"2016-11-02T00:31:59.745+0000","up_votes":2,"down_votes":0,"body":"This was so long that I thought there was a chat log somewhere. I was disappointed.","replies":[]},{"poster":"Bídoof","date":"2016-11-01T19:35:31.615+0000","up_votes":2,"down_votes":0,"body":"Sounds like you and your friends are all a bunch of toxic players that I wouldn't want on my team","replies":[]},{"poster":"Kei143","date":"2016-11-01T10:07:22.851+0000","up_votes":2,"down_votes":0,"body":"ncie, wall of text too stronk.\n\nbut I can tell what. he wanted to say in the first sentence, \n\nchat logs or it didn't happen.","replies":[]},{"poster":"CrazyBear1987","date":"2016-11-01T09:19:28.847+0000","up_votes":2,"down_votes":0,"body":"if you have nothing to hide, you have nothing to fear.\n\nChat logs please tqvm","replies":[]},{"poster":"McFatal","date":"2016-11-01T10:22:06.466+0000","up_votes":2,"down_votes":1,"body":"What the hell could you say that could get u a 2 week ban without other punishments . We're you punished before?","replies":[]},{"poster":"CrazFight ","date":"2016-11-03T00:27:41.563+0000","up_votes":1,"down_votes":0,"body":"http://marlon-wayans.s3.amazonaws.com/mw_gallery/Shits-getting-out-of-hand-BIG.jpg","replies":[]},{"poster":"Manwalrus","date":"2016-11-01T12:24:35.217+0000","up_votes":2,"down_votes":3,"body":"I really do hate having to comment on these kinds of posts but occasionally one of them is so braindead I have to say something: \n \nA. In order to get a 14 day ban you need to have been punished in the past and you admit you have been, so why does the escalation to 14 days surprise you?\nB. You can't really report people for what they say in the end of game chat (similar to how you can't report people for what they say in champ select) \nC. It doesn't matter how many times people report you, you could get banned for being reported 9 times, or only one time, or visa versa and not get banned for being reported 9 times in one game. The volume of reports doesn't matter, it's what you actually say, so there's no reason to get mad at anyone for reporting you if you don't have any reason to be reported because nothing will happen. \nD. As I said above, you can't abuse the system because volume of reports doesn't matter, meaning if you didn't do anything you shouldn't have anything to be afraid of but since you didn't post chat logs I assume you said something worthy of being reported, even if you were just \"quoting\" like you said. \nE. If the bot were to take quotations into account, then anyone could just write whatever they want in chat provided it has quotation marks. \nF. While the report system does encourage toxicity, it doesn't really matter because if you're as fine as you say and all reports against you are false you should never get banned. \nG. People who actually get banned for being toxic are in the top 1% of toxic players anyway, so wouldn't you be the pure filth of our community, then? It isn't that \"so many people are being punished\" It's that so many people come whine about it on the boards once they get banned. \nH.  \"The amount of money and time I've put into this game and the treatment I receive back is disgusting.\" You do realize that the amount of money you've put in means absolutely nothing? League is a free game so the money you spend is 100% your choice and **Riot doesn't have to let you play their game**, they owe you absolutely nothing and you agreed to their terms of service when you installed the game and to their EULA every time you patch the game. \nI. The league report system has to be automated because of the size of the game, Riot can't just go through every single game manually and decide who is and isn't toxic, in fact if they were to magically find a way to do this the amount of people being banned for being passive aggressive would probably go up. In order to get banned Riot needs to have enough evidence against you to 100% prove something and you can write them a ticket if you think it was a false positive (which it probably wasn't) out of all these \"HALP ME RITO MY ACCOUNT WUZ FALSELY BAND!?!?!\" posts I've only ever seen two that were false positives and those actually gained traction and a Rioter commented on them and fixed the ban, they didn't get downvoted into oblivion like this post will be. \n\nTL;DR: You're super toxic and Riot doesn't owe you jack, your being banned and in the top 1% of toxic players isn't proof that everyone is out to get you and your getting banned has nothing to do with the community. The day I'll know the community has gone to shit is the day I see posts like this gain traction. Enjoy your ban, I doubt you'll learn from it and you'll probably end up getting permabanned. Good riddance.","replies":[{"poster":"llillllilllllill","date":"2016-11-02T06:49:53.491+0000","up_votes":1,"down_votes":0,"body":"\"C. It doesn't matter how many times people report you, you could get banned for being reported 9 times, or only one time, or visa versa and not get banned for being reported 9 times in one game. The volume of reports doesn't matter, it's what you actually say, so there's no reason to get mad at anyone for reporting you if you don't have any reason to be reported because nothing will happen.\" \nI'm really not so sure... I have had instances of getting the same toxic player 2 matches in a row, along with multiple other players from the previous match, and all of us reported the same player both matches, and after the second match we got an immediate notification that the player had been punished. So it may be that only one of us needed to report the player and it would have gone through, but I'm not so sure. Do you have proof?\nTL:DR I think the number and frequency of reports is part of the system.","replies":[{"poster":"Manwalrus","date":"2016-11-02T13:34:45.279+0000","up_votes":1,"down_votes":1,"body":"They've stated multiple times that the amount of reports doesn't matter, I'll link an example from Riot Tantram, the very Rioter who commented on this post: http://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/9VrUtrJo-being-solo-and-having-a-team-report\n\nThe example proves nothing other than the fact that he trolled multiple times instead of once which is probably what got him banned.\n\nAlso, you could check out this post if you want more on how reports work: http://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/tvviuURj-multiple-reports-and-other-misconceptions","replies":[]}]},{"poster":"Attysu The Poro","date":"2016-11-02T00:36:36.083+0000","up_votes":1,"down_votes":0,"body":"... Well said, I was going to respond but... you just about covered it on your own! Just one thing I'll go into detail in:\n\n\"To give you brief glimpse into what one experiment is testing, first, we have to understand that the Reporting system is different than the Tribunal system. The Reporting system's sole job is to calculate a player's report accuracy, and a lot of fancy math has gone into the system to make sure that a report is only taken into account when it is accurate. So, if a player is a consistently negative player themselves, their reports might be worth less because the system may consider them a bad judge of others' behaviors. If a player troll reports and gets their 3 friends to troll report, the system will completely toss the reports out. All of the experiments that use reports benefit from the above system to make sure that players aren't able to just abuse someone with random reports.\" Ulanopo, Riot-Official Arbiter.\n\nAKA; like he said, if the reports really were invalid, you would not have been banned. There HAVE been mistakes however. If you post your chat logs in full, and they're not toxic, it would probably trigger Riot to re-review the ban and possibly revoke it if the ban system was wrong.","replies":[]}]},{"poster":"Weathered","date":"2016-11-01T13:22:21.355+0000","up_votes":1,"down_votes":0,"body":"Sorry bud, you're not gonna get any support here untill you post those logs.","replies":[]}]}