{"poster":"RoseburyNoire","date":"2017-06-28T01:17:48.823+0000","title":"Making Jinx's Switcheroo smoother to use","subforum":"Gameplay","up_votes":55,"down_votes":5,"body":"Hi folks, i&#039;m posting an idea with hopes that a rioter could see it.\n\nThe thing could be considered as a tiny buff regarding how often you could switch stances with Jinx&#039;s Q. Let me explain the problem :\nSometimes, usually in the later stages or the game of if you get *really* excited early, you would want to switch stances just for 1 auto then go back to the other. However, when you have a huge AS, the 0.9s static cooldwon doesn&#039;t allow you to auto once then switch back, the next auto comes out before the CD goes off.\nAlright, it **might** not seem a lot to you while reading this, but I&#039;ve encountered the situation often enough for me to make a post about it. The thing is, maybe if you are a Jinx user, you would want to  use in an optimal manner her different attack animations (for kiting mainly).\n\nLet&#039;s say you are kiting a Kassadin with pow pow in a huge teamfight and an ennemy Darius isn&#039;t very far from you, then the Kassa became so low that he teleports away with less than one of your auto worth of hp. However he is in Fishbones range. You would like to get in Fishbones stance to execute Kassa, then go back to pow pow to kite Darius. Whether you get your reset or not (Kassa has zhonya or a sudden shield or anything), you will need to have your next auto to be from your minigun. And if you feel, like me, than the toggle is more intuitive than it is, you might believe that you&#039;re back to pow pow, but you aren&#039;t, and you have lost the bonus AS from the first rocket so your attack animation is too slow, the Darius gets you with his grab and R.I.P.\nI agree it is a very special situation, but it can happen multiple times in one game and it might occur during the decisive fight.\n\nThat is why i&#039;m proposing something to make Switcheroo feel more responsive : **Make the Toggle CD scale down with attack speed**.\nLet me clarify :\n-I believe the technology for this is on point, as Yasuo&#039;s Q is a clear example of what i propose. Also, these little &#039;scales down with AS&#039; changes seem to be quite popular right now (Xayah, Lucian (or is it with level?)).\n-It would make easier to use Switcheroo to get something like a reset (the situation i just described), or something else (poke someone in lane with Fishbones then grab that juicy gold with pow pow on the 2hp-left minion next to you without damaging nearby minions, etc.)\n-Also, i do think this would make the ability feel more intuitive. Smoother. As a Jinx lover myself, who likes to think that she is my spirit animal, I have to say I feel like the CD *should* scale down with AS to truly fulfill her fantasy of Gun-crazy-chick-who-yells-and-murder in teamfights or when excited.\n\nLittle disclaimer, but I don&#039;t know if it&#039;s even relevant : I understand that some could fear that Q-spamming could cause mistakes regarding the stance you are in/you think you are in (i&#039;m not asking for a zero second CD though, i heared it could be OP, neither an auto reset when switching, just a reasonably decrease with AS). However, I remember that there was a (short) time, a year ago or so, when Jinx could use Switcheroo while hard CCed. Not only do I find it a good idea, but also it could prevent someone from spamming Q after the hard CC and thus making a stance mistake. It was eventually removed, though. Having it back could be a solution in case my proposition is accepted (and even if not! ;)).\n\n\n**In short : Make Switcheroo&#039;s cooldown scale down with attack speed.** What do you think? Have a good day everyone :)\n\n\nEDIT : {{sticker:slayer-jinx-wink}} \n\n\n\nEDIT 2: I just answered this to a comment, to be clearer about the issue i'm targeting as opposed to a potential 'intended weakness' which is not the point here :\nThe main issue here is not being able to choose which will be you 2nd auto just after you switched a stance when ou have high attack speed. When you're locked in one stance but you don't get to auto yet, it doesn't matter because Q will get off CD before your next auto (that is in early game) so it smooth and all. However, as the game progresses (and your passive procs), you litteraly **lose** that smoothness : whenever you switch stances you are locked in one stance for the two or three next autos, and this can hurt a lot your\n-positionment : as you were used to get the attack animation you wanted for the 20 minutes of the game, and Fishbones' is way longer than Pow Pow's.\n-timing : same thing with attack animation being different\n-CSing or anything related to 'i used a splash damage auto because i had to not because i wanted to'.\n\nThe issue is, when you have high attack speed and the autos after the first are not necessarily of the type you want (whereas for all the rest of the game it was the case), and if you have to micromanage your autos, whether you have to wait and lose one or two autos (which is 1000+ worth of damage lategame (before armor mitigation)) or you just put yourself in danger without expecting it because you act as if you did switch stances.\nIn my case (as a psycopath-lover myself) i'm not that rarely surprised to see that i didn't switch stances, because when I play a very excited Jinx i feel like it would be 'normal' for her to quickly switch weapons when she attacks at a high rate, which is not the case, that is why is feel a little QoL would be really nice!\n\nSorry for the loooong post :D Have a good day!","replies":[{"poster":"AD Yuumi","date":"2017-06-28T20:26:56.749+0000","up_votes":21,"down_votes":0,"body":"Hi Roosebury,\nSaw your thread and thought I'd stop in and explain the reasoning behind the fixed CD on her Q.\n\nWhen I was designing {{champion:222}} 's kit one of the first major decisions I made on her Q was whether she was going to be a **stance dancer** or a **stance chooser**. Stance dancers are characters like Udyr and Sona, who are heavily encouraged through things like their passive to constantly be swapping stances regardless of in game circumstances.  Stance choosers are characters like Elise and Jayce who try to pick the right stance based on what's happening around them and stay in it until the situation changes.\n\nWhile thematically, stance dancing feels like it would be a great fit for Jinx (she is a manic gun nut after all), I ended up making her a stance chooser because it gave more weight to Pow-Pow and Fishbones as individual weapons.  I wanted each of her guns(friends?) to feel like it's own special entity with a clear purpose, instead of one being tied to the other as a combo piece where you were constantly forced to switch to gain optimal DPS.  \n\nThis is the reason for the fixed CD.  Because of range, splash, and bonus damage Fishbones rockets are strictly better than Pow-Pow bullets for a single attack in all situations.  The only thing holding them back is the mana cost and AS decrease after using more than one.  If the Q had a CD lower than Jinx's attack speed the optimal play would be to constantly swap between Fishbones and Pow-Pow every attack to ensure you got the attack speed benefits of the first AND the range, splash, and damage benefits of the second.\n\nThere are ways to make a fast swap less optimal, like making it so the first rocket after the swap LOSES Pow-Pow's AS bonus, but in testing that made rockets feel super clunky.  I started getting really positive feedback about the \"smoothness\" of the swap after I ensured that the first rocket maintained Pow-pow's attack frame.  I'd be scared to go back on that, especially after seeing players' negative reaction to the super slow level 1 rockets we added to her during the marksman update (and later removed).\n\nAll that said, if we did want to make Jinx a stance dancer in the future, a suggestion like yours (Q CD scales with AS) is a pretty good one.  Thanks for thinking about her :D Hope this context helps.","replies":[{"poster":"RoseburyNoire","date":"2017-06-28T21:12:28.154+0000","up_votes":3,"down_votes":1,"body":"Wow, first i must say Riot Jinxylord you are kind of a father to Jinx, so you are my Senpai {{sticker:slayer-jinx-wink}} , I'm actually really glad (not to say honored :)) that you took the time to give such a nice and long answer :) Thank you\n\nI understand that making her a stance dancer would create that optimal combo and everyone would play her that same way. I'm glad that at least you heared the idea and maybe will use it one day if necessary. I guess this is not going to be any time soon though? ^.^ I'm reffering to your judgement, however. And if you say that you considered every other options regarding the way Switcheroo's CD works.\n\nThere *is* something clunky though with the situation i exposed, so just in case i'll say a couple things.\n-Maybe, it would remove the 'optimal' combat pattern *and* retain her smoothness if the first rocket only benefitted from half the bonus AS from Pow-Pow (as a trade for Q CD scaling down with AS). Just an idea, but I don't know if this would be viable in any way\n-As for clunkyness, what about the Switcheroo toggle avaible when hard CCed? Woulnd't be bad considering it's not taken into account for spellblade and Force Pulse. Maybe :)\nBut as I fully understand your statement, that was just some ideas just in case :)\n\nTo finish with, while I have the chance : Thank you for creating Jinx, she litteraly *is* the reason why I started playing League and one of the main reasons why I still play today. She is a true pleasure to play and to play against, not to mention her design/lore/model/VFX are a masterpiece imo.\nThank you again for the answer :) and if you ever think about changing her i hope my idea could help :)","replies":[{"poster":"AD Yuumi","date":"2017-06-28T21:35:44.162+0000","up_votes":9,"down_votes":0,"body":"Thanks :D the whole team working on her really crushed it.  I'm so lucky to have worked with them.  Glad she's keeping you around :3\n\nThe Switcheroo while hard CC'd is something we added with good intent, but it ended up causing a nasty bug that required a revert. :(","replies":[{"poster":"Ahristocats","date":"2017-06-28T22:27:10.474+0000","up_votes":2,"down_votes":0,"body":"gypsy pls when is ur next champ, me wanna play champs made by u","replies":[{"poster":"Limmie","date":"2017-06-29T14:45:18.626+0000","up_votes":1,"down_votes":0,"body":"Unfortunately he moved on from designing champions to gameplay R&D.","replies":[]},{"poster":"Chromatic Eagle","date":"2017-06-29T00:09:32.568+0000","up_votes":1,"down_votes":0,"body":"Yeah gimme that 3 hit passive","replies":[]}]},{"poster":"RoseburyNoire","date":"2017-06-28T22:19:20.761+0000","up_votes":2,"down_votes":0,"body":"Then I must say : Thanks to\n\n**All**\n\n**Of**\n\n**You**\n\nMore than crushed it, you guys made a character who flies above every other crazy-themed character in any other game! If it could mean anything I would say that I'm proud of you and your work^^ Jinx is a complete success as a character and as a champion. She inspires me and makes me love this game even more.\nVoilà :)\n\n\nOh that's such ashame, hope it will return someday though :)","replies":[]}]}]},{"poster":"Hyrum Graff","date":"2017-06-29T11:14:56.414+0000","up_votes":3,"down_votes":0,"body":"What if we allowed Jinx to buffer her next Q switch during the last .3ish seconds of the .9 second fixed lockout? I think this would address OP's issue with the responsiveness of the toggle without actually affecting the tradeoffs involved in swapping stances.\n\nEdit: maybe just the last .2 seconds, as you *really* wouldn't want to accidentally double tap and be forced to switch.","replies":[]},{"poster":"Terozu","date":"2017-06-28T20:32:14.495+0000","up_votes":1,"down_votes":6,"body":"This is pretty much what I was thinking when I saw this post...","replies":[]}]},{"poster":"Schiffer van Art","date":"2017-06-28T01:41:19.672+0000","up_votes":6,"down_votes":0,"body":"Nice idea man, upvoted! :)","replies":[{"poster":"RoseburyNoire","date":"2017-06-28T01:43:09.655+0000","up_votes":2,"down_votes":0,"body":"Thank you i really appreciate the help to get this idea to Riot^^\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Akkiiii","date":"2017-06-28T11:47:20.072+0000","up_votes":5,"down_votes":0,"body":"It's a good idea, actually I love it :)","replies":[{"poster":"RoseburyNoire","date":"2017-06-28T12:30:32.881+0000","up_votes":2,"down_votes":0,"body":"Thank you a lot for the support man! :){{sticker:slayer-jinx-catface}}","replies":[]}]},{"poster":"Skorch","date":"2017-06-28T05:28:33.592+0000","up_votes":5,"down_votes":0,"body":"Yeah even before late game i sometimes am annoyed with this in laning when im around 1.3 attack speed.","replies":[{"poster":"RoseburyNoire","date":"2017-06-28T11:15:09.524+0000","up_votes":2,"down_votes":0,"body":"Thank you for the support :) I hope we will all be able to play a smoother Jinx soon {{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"Forger of Days","date":"2017-06-28T03:33:03.718+0000","up_votes":4,"down_votes":0,"body":"Glad I'm not the only one with this problem, I experience it a lot in the early game, I love to poke my lane opponent with Fishbones but at 20 mana, that can be costly early game (before first back). Not to mention the splash damage really messes up my cs timing if I'm not expecting it. It always frustrates me, cause I am like .1 second early. Upvoted, hope Riot agrees.","replies":[{"poster":"RoseburyNoire","date":"2017-06-28T11:19:57.931+0000","up_votes":2,"down_votes":0,"body":"No you're not the only one lol!\nYou are so true, being locket in rocket form for another attack can cause unintended splash damage not to mention the attack animation is not the one you expected so the timing is just f*cked up^^ I agree this case also shows how clunky current Q's CD can be.\n\nThank you for helping! :) {{sticker:slayer-jinx-catface}}","replies":[]}]},{"poster":"Poro adorable","date":"2017-06-28T01:37:35.624+0000","up_votes":3,"down_votes":0,"body":"Really good point imo! I hope someone at Riot sees it.\nLogged in just to upvote.","replies":[{"poster":"RoseburyNoire","date":"2017-06-28T01:38:47.148+0000","up_votes":2,"down_votes":0,"body":"Ty man I hope too {{sticker:slayer-jinx-catface}}","replies":[]}]},{"poster":"HeeroTX","date":"2017-06-28T19:24:07.793+0000","up_votes":1,"down_votes":5,"body":"A) If you are justifying your idea by saying \"For example, Yasuo...\" then just stop.  No.  Bad idea to use one of the most hated and banned champions IN THE ENTIRE GAME as your basis of comparison.\n\nB) No.  I read your comments, I get your point.  But no.  No, I don't think it is fair or right that Jinx be able to toggle between speed and range with perfect timing simply because it \"feels\" better.  I'm a Tristana main and it'd \"feel\" a lot better if I could jump OVER your traps (or Caitlyn's) but I CAN'T because \"LOL, Riot\".  It'd also feel great if my Q let me toggle between max passive and current Q with no cooldown, but it doesn't\n\nRockets are for harass and minigun is for tower burn and cs.  Too damn bad if you think they're not \"super duper\" for handling a 2v1 situation.  New champs get prettier toys than you?  Yeah, welcome to the club.","replies":[{"poster":"Poro adorable","date":"2017-06-28T19:45:01.977+0000","up_votes":4,"down_votes":0,"body":"'LOL, Riot' is NOT a real argumentation... not even a reason to try to stop a QoL change for a champion that is fluid to use early and then becomes clunky in the lategame.\nAs for your 'welcome to the club', just go post something about making trist jumping over traps and stop trying to kill people's hopes here please.","replies":[{"poster":"HeeroTX","date":"2017-06-28T20:15:43.547+0000","up_votes":1,"down_votes":3,"body":"Tristana's jump not being a \"jump\" (but instead, a totally interruptable \"dash\") has been a complaint for YEARS, probably for the entire existence of the champion.  It hasn't been a \"complaint\" for a long time because it is \"how things are, and will be\" and like some have said to you \"part of her balance\".  More than anything, the primary answer has been \"that's the code and they're not gonna retool the coding just for that\".  So that's why \"LOL, Riot\".\n\nAs for your point about fluidity, and how it's a \"minor buff\".  Jinx can currently toggle between \"no mana cost, no duration limit\" AS buff, and longest AA range with AoE damage, and the ONLY cost for that toggle is a 0.9 sec flat cooldown.  That cooldown means you actually have to look ahead **slightly** and plan for/predict how people will behave, rather than simply hot-swapping to what is instantly most effective at the time of selection.","replies":[]}]}]},{"poster":"Academy Kayn","date":"2017-06-28T04:31:30.047+0000","up_votes":5,"down_votes":3,"body":"That seems like it's an intended weakness.","replies":[{"poster":"RoseburyNoire","date":"2017-06-28T11:36:45.131+0000","up_votes":2,"down_votes":0,"body":"The thing that she should not be able to switch with no CD between stances is not the point i'm focusing on. Maybe I was unclear.\n\nI'm going to add an EDIT with wht i'm going to explain to be clearer :\nThe main issue here is not being able to choose which will be you 2nd auto just after you switched a stance when ou have high attack speed. When you're locked in one stance but you don't get to auto yet, it doesn't matter because Q will get off CD before your next auto (that is in early game) so it smooth and all. However, as the game progresses (and your passive procs), you litteraly lose that smoothness : whenever you switch stances you are locked in one stance for the **two** or **three** next autos, and this can hurt a lot your\n-positionment : as you were used to get the attack animation you wanted for the 20 minutes of the game, and Fishbones' is way longer than Pow Pow's.\n-timing : same thing with attack animation being different\n-CSing or anything related to 'i used a splash damage auto because i **had** to not because i wanted to'.\n\nThe issue is, when you have high attack speed and the autos after the first are not necessarily of the type you want (whereas for all the rest of the game it was the case), and if you have to micromanage your autos, whether you have to wait and lose one or two autos (which is 1000+ worth of damage lategame (before armor mitigation)) or you just put yourself in danger without expecting it because you act as if you did switch stances.\nIn my case (as a psycopath-lover myself) i'm not that rarely surprised to see that i didn't switch stances, because when I play a very excited Jinx i feel like it would be 'normal' for her to switch weapons when she attacks at a high rate, which is not the case, that is why is feel a little QoL would be really nice!\n\nSorry for the loooong post :D Have a good day!","replies":[]},{"poster":"Rexxiee","date":"2017-06-28T05:10:26.710+0000","up_votes":5,"down_votes":5,"body":"> [{quoted}](name=Dr Mercy,realm=NA,application-id=3ErqAdtq,discussion-id=gX7saAUi,comment-id=0003,timestamp=2017-06-28T04:31:30.047+0000)\n>\n> That seems like it&#x27;s an intended weakness.\n\nJinx is supposed to be strong late game, shes literally shit for the first 30 minutes of the game and very vulnerable at all stages of the game (no escapes has to get in close to use minigun if you want high dps), a small late game QoL buff would be welcome.","replies":[{"poster":"RoseburyNoire","date":"2017-06-28T11:14:22.793+0000","up_votes":2,"down_votes":0,"body":"Her being strong lategame truly is one of the main reasons why I think my proposition is justified. Making her more fluid where she shines would be a great idea imo. Thank you for the support good sir :)\n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Academy Kayn","date":"2017-06-28T08:51:00.161+0000","up_votes":2,"down_votes":1,"body":"Just because she's strong late doesn't mean she can have a opening in her armor.","replies":[{"poster":"Poro adorable","date":"2017-06-28T17:10:54.732+0000","up_votes":1,"down_votes":1,"body":"It's not what the author of the thread is speaking about though. The proposition of making Q cooldown go down with attack speepd seems a good idea to me, and it's fair considering the fantasy of the champion.","replies":[{"poster":"Academy Kayn","date":"2017-06-28T20:01:06.872+0000","up_votes":1,"down_votes":0,"body":"Wasn't replying to the OP, was refering to the other dude. Regardless, it still sounds like an intended weakness, considering the impact of Fishbones.","replies":[]}]}]},{"poster":"Carteeeer","date":"2017-06-28T10:09:30.177+0000","up_votes":2,"down_votes":0,"body":"she can be really strong early game as long as the jinx player knows how to play matchups correctly. \n\nand if shes winning laning phase, her damage to turrets is just dumb","replies":[]},{"poster":"It Hertz When IP","date":"2017-06-28T06:41:18.261+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Rexxiee,realm=NA,application-id=3ErqAdtq,discussion-id=gX7saAUi,comment-id=00030000,timestamp=2017-06-28T05:10:26.710+0000)\n>\n> shes literally shit for the first 30 minutes of the game \n\n....wat. What the hell are you doing with her to be shit early on? Ya, she's vulnerable to lane bullies, but she certainly holds her own.","replies":[]},{"poster":"Poro adorable","date":"2017-06-28T17:07:54.541+0000","up_votes":1,"down_votes":0,"body":"Wouldn't say she is 'litteraly shit' early, she can be quite useless in skirmishes and all though. And she doesn't offer much of a very good laning either.\nI agree with giving her a QoL change where she is supposed to pop off - that is to say in lategame when she can AA at high rate.","replies":[]}]}]},{"poster":"StarGuardianWeeb","date":"2017-06-28T17:35:21.335+0000","up_votes":3,"down_votes":1,"body":"I agree. Xayah got a lockout added to her Q before using an AA and then they found that late game \"it was hindering her performance if you built AS heavily\"\n\nwell this is essentially the same issue and should be addressed. Oh and speaking of similarities between Xayah and Jinx i'd like her W to scale in crit like Xayahs E since you'd think a Tazer would be more \"critically painful\" than a bunch of feathers.\n(thats a personal thing tho)","replies":[{"poster":"RoseburyNoire","date":"2017-06-28T18:34:55.758+0000","up_votes":3,"down_votes":1,"body":"Yes that is exactly why I think it would be fair to give Jinx kind of the same tweaks :)\nThank you for the support ! Jinx appreciates it!\n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Poro adorable","date":"2017-06-28T18:38:27.207+0000","up_votes":1,"down_votes":0,"body":"The W scaling with crit has been looked in PBE and it was really OP if i remember well. So i doubt this would ever come to live unless they gut her W before so that crits don't do crazy damage.\nHowever i'm 100% with you on the comparison between Xayah's and Jinx's cases. They should be treated the same.","replies":[{"poster":"StarGuardianWeeb","date":"2017-06-28T20:43:12.858+0000","up_votes":1,"down_votes":0,"body":"I think it was they just made it Crit ala MF Q (which was cool, but thats 200% extra damage on an ability with 110%(I think) ad scaling, which got to like 1K in damage.\nI meant more like instead of Zap scaling on AD, make it scale off crit. Or reduce the AD ration on it so the damage would be about half as much as the PBE tested. I just think a highly telegraphed skillshot that can be minion blocked should do more than just early-mid game damage and a slow.","replies":[{"poster":"Poro adorable","date":"2017-06-28T22:57:48.059+0000","up_votes":1,"down_votes":0,"body":"This could be nice yeah :)","replies":[]}]}]}]},{"poster":"TheChaoticSwede","date":"2017-06-28T05:08:07.188+0000","up_votes":2,"down_votes":2,"body":"I've been playing Jinx since her release and have over 100's of games on her and I can tell you for a fact that Jinx's switcheroo cast time is used as a balancing mechanic ever since her rockets got reworked to work with Runaan's.\n\nBefore that you could actually switch from Pow-Pow to Fishbones and the cast time wouldn't really matter if you had an AS over 1.8 because the AA would override the animation and just attack normally during the switch. But when they reworked her rockets they stealth nerfed the bug and pretty much streamlined every Jinx build from then on to rush IE and Runaans before anything else otherwise you're suffering heavily on damage output. Bork a little while ago was pretty okay to build before IE or Runaans but then they nerfed it which was called for tbh.\n\nHonestly I'd rather them just take away the Rocket+Runaan's interaction and give her animation cancelling bug back. Just revert her back to the original version because back then it was actually okay to build lifesteal instead of crit early since you had faster scaling AS in earlier levels.\n\nI'm just sick and tired of being a glorified turret that gets hit once by any form of CC and I'm dead because Jinx is one of the slowest adcs in the game with no escapes and she's basically free gold to any semi-coordinated team strike pre 14 because the only way she can kite as fast as any other adc in the game right now is if she stays on her Pow-Pow and that has one of the lowest ranges in the game combined with her no escapes and low mobility.\n\nJinx really has a lot of negatives about her that could be looked into but no one cares or wants to because every now and again you get a Jinx who has a competent team that can peel for her so she can blow your team up and even then that's a maybe.","replies":[{"poster":"RoseburyNoire","date":"2017-06-28T12:39:44.108+0000","up_votes":1,"down_votes":0,"body":"The real point is not exactly what you explained, even though I agree with a lot of your comment. I put an EDIT 2 to be clearer about the issue I'm targetting.\nThe thing is not that her Q CD is used as a balance thing, the thing is that early game it is smooth because you never get to auto before CD goes off, but that intuitive part is gone when you have high AS and you are locked in the later stages of the game in one or the others stances for a few autos. This might cost you a lot and really doesn't feel smooth at all (which should to keep the feeling from earlygame). But i recommend reading my EDIT 2 for a real explanation, that was just a quick answer x)\n\nHave a good day!","replies":[{"poster":"Poro adorable","date":"2017-06-28T17:13:39.111+0000","up_votes":1,"down_votes":0,"body":"Yes, if the point here is a QoL change to keep the consistency of a 'smooth switcheroo' i don't see why Riot wouldn't agree.","replies":[]}]}]},{"poster":"Call Me Nana","date":"2017-06-28T23:19:02.659+0000","up_votes":1,"down_votes":2,"body":"imo she doesnt really need the 'smoothness'\n\nshe already gets 750+ range on an auto, that does plash damage and allows to crit.\nShe should be punished in some way for that.","replies":[]}]}