{"poster":"Valkýrija","date":"2016-08-27T20:53:53.077+0000","title":"Idee für einen Skin","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":6,"body":"Aloha =)\r\n\r\nIch h&auml;tte da mal eine wohl sehr tolle Idee f&uuml;r einen Skin den ich Riot vorschlagen m&ouml;chte. Nur m&ouml;chte ich nicht das meine Idee (wenn die Idee noch was wert sein sollte) in mein geistiger Eigentum bleibt. Daher w&uuml;rde ich mich gerne auf diesen Weg direkt an Riot wenden und euch meine Idee zu einem Skin unterbreiten^^\r\n\r\nW&uuml;rde mich freuen wenn die Idee verwirklicht werden k&ouml;nnte ;)\r\n\r\n{{champion:412}}","replies":[{"poster":"KleineQualle","date":"2016-08-27T21:41:58.658+0000","up_votes":2,"down_votes":0,"body":"Denke du wirst da nichts finden. Skinvorschläge sollen offiziel über das Forum eingereicht werden. Und denkst du echt, dass so Skinvorschlag irgendwie was wert ist? Du bekommst eh nichts wenn dein Skin irgendwie angenommen wird (was halt eh eig nie passiert) und wer sollte den die Idee klauen - bzw. was sollte diese Persohn dann mit der Idee machen?","replies":[]},{"poster":"KleineQualle","date":"2016-08-27T21:11:54.524+0000","up_votes":2,"down_votes":0,"body":"Dann schreib Riot doch einfach direkt ne Mail, anstatt hier ein Forumpost zu schreiben? ._.","replies":[]},{"poster":"lKawaiiNeko","date":"2016-08-27T21:22:01.305+0000","up_votes":3,"down_votes":1,"body":"***","replies":[{"poster":"Valkýrija","date":"2016-08-27T21:41:46.740+0000","up_votes":1,"down_votes":3,"body":"Hauptsache was sagen? Hätte ich was gefunden hätte ich mich hier garnicht geäußert^^ Keine Sorge","replies":[]}]},{"poster":"Zanlan","date":"2016-08-27T21:49:04.262+0000","up_votes":1,"down_votes":0,"body":"Die Leute die bei Rito arbeiten treten ihr geistiges Eigentum auch an die Firma ab. Und du nicht?\nbtw. ganz oben steht \"Support\", versuchs doch mal dort","replies":[]},{"poster":"Valkýrija","date":"2016-08-27T21:35:40.033+0000","up_votes":1,"down_votes":0,"body":"Wenn ihr mir sagen könnt wo ich eine Addy finde!? Ich habe bislang nix weiter gefunden als hier im Forum im Skinbereich und dachte auf dem Wege gehts dann^^","replies":[]},{"poster":"Valkýrija","date":"2016-08-27T21:59:27.913+0000","up_votes":1,"down_votes":2,"body":"Ne da kommt man auch nicht viel weiter^^ Ja sicher geben die bei Mitwirkenden ihr en geistigen Eigentum ab, jedoch denke ich das diese auch dafür bezahlt werden. Den Skin dan Gratis zu erhalten wäre ja wohl noch mal ne Träumerei wert xD","replies":[]}]}