{"poster":"OyddAWqJ5r","date":"2017-06-13T09:58:07.707+0000","title":"PSA: Divers and Assassins are two completely different classes","subforum":"Gameplay","up_votes":53,"down_votes":10,"body":"I see alot of people throwing the term Assassin around but using it to define completely _Diver_ related champions and concepts. It seems that the majority envisions an Assassin to simply be someone that deletes a single target.\n\nAssassins however are not the only class defined by single target deletion. You also have Divers whose role is to target a single enemy and Dive past resistance using tankiness, some form of CC immunity and some form of single target CC lockdown to completely obliterate it. Following this, Divers then proceed to brawl in the midst of the enemy team. Divers also just so happen to be some of the best gankers in the game since they specialize in single target lockdown and deletion. Just look at {{champion:254}} {{champion:120}} {{champion:56}} {{champion:164}} .\n\nAn Assassin&#039;s role however is to wait until they see an opening where CC/damage won&#039;t keep them from their target and use their gap closing tools to catch it and delete it with a full spell rotation before using an escape tool to get out and look for another opening. Assassins do _not_ want to charge head on and they don&#039;t want to stick around in the midst of 4 enemies after deleting a target as that&#039;s basically suicide.\n\nDivers and Assassins tend to dip into each others skillsets sometimes just like any other archtype does (such as Ahri being a pseudo-Assassin) but it&#039;s fairly simple to see what their true identity is (such as Ahri is still a Burst Mage).\n---\n---\nSo onto a more recent misuse of the term Assassin lets look at Rengar and the things he has that Assassins don&#039;t have and Divers do.\n\n1. Great ganking potential due to single target lockdown and deletion capabilities.\n2. The ability to continue brawling in the midst of the enemy after killing his target.\n3. The ability to dive past resistance tactically using stealth and the ability to either lock his target down with E or ignore incoming CC and some damage with W.\n---\nNow let&#039;s look at the traits that align him with the Assassin archtype.\n\n1. He can escape after a kill with empowered W (maybe) and Stormraider if he&#039;s running it.\n2. Can&#039;t literally dive head on as he has to keep his distance during his ult to remain unseen.\n\nNot much huh? And even then what's there is pushing it.\n---\nSo when you all say that you want Rengar to be an Assassin are you saying you want his plethora of Diver tools removed in exchange for proper Assassin escape tools or are you just misusing the term &quot;Assassin&quot; when what you really mean to say is &quot;reliable burst&quot;?","replies":[{"poster":"BananaSlayerAMO","date":"2017-06-13T12:03:01.955+0000","up_votes":8,"down_votes":5,"body":"The line becomes a bit blurred when you look at champions like {{champion:131}}, who are classified as Divers but often played like Assassins.","replies":[{"poster":"Ralanr","date":"2017-06-13T13:38:55.459+0000","up_votes":32,"down_votes":0,"body":"She's played more like a WW2 Japanese fighter pilot than an assassin simply because she has no escape. That's the key difference of assassins honestly, having or having multiple escape options. \n\nDiana has none. When she goes in it's kill or be killed. That's a diver.","replies":[{"poster":"DuskDaUmbreon","date":"2017-06-13T15:33:02.411+0000","up_votes":31,"down_votes":0,"body":"Diana has a great escape route. It's called a pentakill. /s","replies":[{"poster":"Auz the Ripper","date":"2017-06-13T23:49:39.117+0000","up_votes":6,"down_votes":0,"body":"http://i.imgur.com/ErcqU9K.jpg?noredirect","replies":[]}]},{"poster":"Saianna","date":"2017-06-14T01:21:03.006+0000","up_votes":1,"down_votes":1,"body":"> That's the key difference of assassins honestly,\n\nUm... Assassins didn't have escapes untill Riot started making every new assassin super-safe to play\n\nSo... I'm just kinda against calling safe picks as assassins just cause they were made in powercreep era..","replies":[{"poster":"Atanchan","date":"2017-06-14T10:53:32.804+0000","up_votes":3,"down_votes":0,"body":"You're talking about an entirely different set of assassins. That's the old champion tag \"assassin,\" which really just meant anyone who could destroy a single target in a flash, even if they had 0 mobility.\n\nIt wasn't even used that well, because champions like Yi and Trynd had it, despite being DPS characters until they went supercritical.","replies":[{"poster":"The Kill Robber","date":"2017-09-06T11:46:01.921+0000","up_votes":1,"down_votes":0,"body":"Assassins and the new \"Skirmishers\" fall into a category known as Slayers.\n\nAssassins have escape routes and EXTREME close-up damage,\nlike {{sticker:leblanc-funny}} {{sticker:katarina-love}}\n\nSkirmishers instead have defensive tools to help them survive a LITTLE while longer, but they aren't as bursty.\nConsider {{sticker:fiora-cool}}\nShe has high damage, but only over a period of time.\nShe heals off of her passive and Ult, and her W makes her immune to CC.\nBut she doesn't necessarily have a solid escape ability.","replies":[]}]}]},{"poster":"The Kill Robber","date":"2017-09-06T11:10:24.413+0000","up_votes":1,"down_votes":0,"body":"\n{{champion:19}} {{item:3083}} {{item:3022}} {{item:3110}} = {{sticker:galio-happy}} \n{{champion:19}} {{item:3083}} {{item:3742}} {{item:3153}} = {{sticker:garen-swing}} \n{{champion:19}} {{item:3072}} {{item:3031}} {{item:3026}} = {{sticker:fiora-cool}} \n{{champion:19}} not learning Blood Hunt = {{sticker:cass-cry}}","replies":[]}]},{"poster":"Zerenza","date":"2017-06-13T13:07:59.695+0000","up_votes":2,"down_votes":8,"body":"Yeah she was also designed to initially be a fighter/diver but people played her as an assassin instead due to her high base damage/scaling. She also lacks the CC to be a proper diver like Camille, Vi or Hecarim, she still builds like a diver though, most diana games i play i end the game with atleast 3000 health while building mostly damage, even if i have 0 resistance items it's a lot of health so you can see where riot wanted diana to be.","replies":[{"poster":"OyddAWqJ5r","date":"2017-06-13T14:18:00.921+0000","up_votes":11,"down_votes":1,"body":"I feel like people aren't reading the post >_>\n\nDivers can build 100% glass cannon and still be Divers. Sure they'll be pretty bad at it since they'll either nuke their target or die before they do but even still.\n\nDivers can one-shot people and still not be an Assassin at all.\n\nAn Assassin put simply one who kills and gets out. She can't reliably use her R as an escape so Diana whether full damage or full defense is a Diver by nature.","replies":[{"poster":"Julius Evola","date":"2017-06-13T14:50:21.445+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"macromite","date":"2017-06-13T15:02:04.313+0000","up_votes":17,"down_votes":0,"body":">Since you have invented your own class called \"divers\"\n\nYou lack the prior information requirment to join this conversation.\n\nhttp://na.leagueoflegends.com/en/news/game-updates/gameplay/taking-another-look-subclasses\n\nSubclass is defined by kit, not defined by build, and champions are permanantly their subclass, it doesn't shift during games.","replies":[]},{"poster":"Terchio","date":"2017-06-13T15:54:42.688+0000","up_votes":5,"down_votes":0,"body":"This is no invention of his, bud. This is Riot's exact definitions for the class, and how they balance champions. If Nocturne is building Lethality sometimes, Black Cleaver sometimes, then Riot figures out whether both can be healthy for his kit, and if not, chop what's not fitting in a healthy way, or find a method to leave good balance.\n\nThat said, Both of those Nocturnes are still divers. They both function by focusing a priority target, and then tend to be stuck in the fray, with varying degrees of success on each part. He can't generally hop back out in a teamfight, at least if he's prioritized, so he is classified as a diver. Divers *do not necessarily excel at tankiness nor CC* {{champion:60}} {{champion:56}} (though it's clearly quite common within the class).\n\nOverall, champion kits determine a general champion playstyle, and what their class is overall. If you're playing them a bit outside those guidelines, like \n{{champion:64}} {{item:3142}} {{item:3147}}  vs {{champion:64}} {{item:3156}} {{item:3071}}  vs {{champion:64}} {{item:3068}} {{item:3143}} , your goals vary just a bit, but you're still utilizing the kit in generally similar ways. As a clarification, even tank is no longer a class, because there are different ways of doing it. Now, instead, we have \nwardens ({{champion:32}} {{champion:57}} {{champion:111}}) who disrupt as they tank, and juggernauts ({{champion:86}} {{champion:82}} {{champion:102}})  who lack CC while they tank (with generally low mobility compared to divers and assassins). The champion damage and tankiness is generally not part of a class, simply because it's easy to build out of those subclasses. However, kit-based classes are more commonly accurate, as kits are designed to scale in that direction.\n\nOverall point: This is not DotA. You can't make a stunner out of just anybody, and you can't buy assassin mobility (Yeah, there's {{summoner:4}} for free, and {{item:3078}} {{item:3285}} {{item:3142}} , but assassins generally still have an edge). Champion kits have more general purposes to them, and off-builds aren't as well suited unless those constraints are put into consideration. You play Nocturne like you do Talon, or even off-build, you should expect to die a lot, as he isn't getting out of battle as readily as Talon can.","replies":[{"poster":"LordForrest","date":"2017-06-14T02:46:42.393+0000","up_votes":2,"down_votes":0,"body":"Uh, You made a mistake tanks are split into Wardens and Vanguards. Wardens({{champion:3}}) defend and Vanguards({{champion:54}}) initiate.\n\nJuggernauts are part of the fighter subclass along with Divers.","replies":[{"poster":"Terchio","date":"2017-06-14T16:46:26.483+0000","up_votes":1,"down_votes":0,"body":"Yeah, true. I can never get those straight. Truth be told, I don't really understand the Warden/Vanguard split (particularly with Galio... maybe the change?). If you're a tank, chances are that you want to initiate. Also, if you've got the CC to peel for your carry, you've probably got enough to pick off the enemy carry.\n\nAs an example, I used to play Skarner back before all the reworks. They call him a Diver now, but he used to function as more of a \"Vanguard\" to me, as his job was usually to pick off the opposing carry, and relentlessly bring him down with your tankiness to force the aggro on you. I still don't think he goes in fast enough (nor kill fast enough) typically to be a true diver. However, I always typically played him the Warden model instead; initiate with the smaller CC abilities, and save the only reliable hard CC in his kit for either peeling the \"Vanguard\"/assassin/diver, or for breaking the channel on champs like Malz/Kat/WW.\n\nThere are a couple of legit Wardens, but even they tend to have support abilities that are stronger than merely tanking. I mean, not all of the lines are completely solid between the classes, but I don't understand when they assume I'm going to use my CC for good or bad generally. As an example, I feel {{champion:111}} makes a far better Warden than {{champion:78}} . Her CC is just too limited, and she builds strong enough to pick off a squishy moreso than protecting people. Naut meanwhile has CC all over the place, but limited mobility in and no reliable ranged CC, so he's better off peeling until he can find that sweet hook spot, if he can afford to hold that. Sometimes you can ult them down, but most carries can outrun that thing a very long distance, if they even feel threatened by your rooting abilities alone.","replies":[{"poster":"McAllister","date":"2017-06-14T22:49:04.309+0000","up_votes":1,"down_votes":0,"body":"{{champion:111}} 's ult and hook are both great for starting fights, so he's definitely a Vanguard.  {{champion:78}} 's charge and ult are both great for peeling, I see her as clear Warden.  Sure, most CC could either initiate or peel, but being long ranged/AoE/pulling enemies is better initiate, and being short ranged/long duration/pushing away is better peel.\n\n{{champion:72}}  feels like a Warden/Juggernaut.  When your initiation is running up to people and using your short-ranged ult on one target, you're not a damn Vanguard, much less a Diver.  Low mobility, high tankiness, good damage (although typically more AoE than single target)?  That says Juggernaut.  Two medium-short ranged hard CCs, one of which is an absolute boatload of \"get off my carry\" says Warden.\n\n's how I see it, anyhow.","replies":[{"poster":"Done25","date":"2017-09-06T13:29:59.288+0000","up_votes":1,"down_votes":0,"body":"The way I see it is that Vanguard = Offensive Tank while Warden = Defensive Tank.\n\nRammus, Amumu, and Sejuani are Vanguards. \n\nThresh, Braum, and Taric are Wardens.","replies":[]}]}]}]}]},{"poster":"OyddAWqJ5r","date":"2017-06-13T15:25:08.813+0000","up_votes":4,"down_votes":0,"body":"Hecarim with Frozen Heart = Diver\nHecarim with Ghostblade = Diver\n\nOh and btw Diver is an official subclass according to Riot. Look it up.","replies":[]}]},{"poster":"Ralanr","date":"2017-06-13T14:23:29.464+0000","up_votes":8,"down_votes":0,"body":"People have trouble understanding that burst does not define an assassin alone.","replies":[{"poster":"OyddAWqJ5r","date":"2017-06-13T14:53:09.099+0000","up_votes":4,"down_votes":1,"body":"Seriously","replies":[]}]}]}]}]},{"poster":"Doctor Jarvis","date":"2017-06-13T14:23:45.021+0000","up_votes":1,"down_votes":0,"body":"The problem with calling Nocturne a Diver is that he doesn't build more than, like, one defensive item, meaning that the main use of his abilities is to catch someone out rather than go to the back line in a team fight, because he can't deal with being focused like Vi or Hec can","replies":[{"poster":"OyddAWqJ5r","date":"2017-06-13T14:55:59.024+0000","up_votes":5,"down_votes":0,"body":"There are only 3 definitions for \"diving\" type champions.\n\nVanguards - Tanks that initiate fights with big AoE CC\nDivers - Fighters that focus down a single target then transition into a fighter\nAssassins - Slayers that focus down a single target then escape and wait for their next opportunity\n\nWith those said, he definitely fits more into the Diver category.","replies":[{"poster":"Doctor Jarvis","date":"2017-06-13T15:20:00.599+0000","up_votes":1,"down_votes":0,"body":"The problem is that, in a practical sense, he DOESN'T transition into a fighter. He just dies. He isn't like other Divers, whose diving tool is CC. Therefore he has to build full damage to be able to do any amount of fighting, since his CC is so delayed. He doesn't have the escape tools of an assassin, granted, but that's why he has to catch people rather than team fight.","replies":[{"poster":"OyddAWqJ5r","date":"2017-06-13T15:28:40.414+0000","up_votes":2,"down_votes":0,"body":"What the kit is _trying_ to do is have him ult into one target and fear them yadda yadda but sadly with damage creep over the many years he can no longer stay alive long enough to do it.\n\nI can see that labeling making sense though in a sort of Kha Zix way--especially since it's on a semi-global level.","replies":[{"poster":"Doctor Jarvis","date":"2017-06-13T16:13:27.550+0000","up_votes":2,"down_votes":0,"body":"Honestly the spooky dude needs a rework to sort that out. Is he supposed to be a Boogeyman that comes out of the shadows and swiftly murders you, or is he supposed to be a more hulking Boogeyman that appears and thrashes wildly at a group of people? Both of those things are in his kit in some way, but he isn't enough of either of them to be easily classified.","replies":[{"poster":"volvagia46","date":"2017-06-14T17:34:30.226+0000","up_votes":1,"down_votes":0,"body":"Please do not suggest a noc rework, his kit is fine the way it is. I would be grateful for some reduced mana costs on his q/e/r  (he runs out of mana way too much, especially when running up against meta jgs such as lee and elise) and a more reliable e, but a complete rework? please don't kill my favorite champ.","replies":[]}]}]}]},{"poster":"Sukishoo","date":"2017-06-13T15:05:51.499+0000","up_votes":3,"down_votes":2,"body":"He fits it kit wise but due to the way people build him Riot classes him as an Assassin. \n\nhttp://na.leagueoflegends.com/en/news/game-updates/gameplay/taking-another-look-subclasses","replies":[{"poster":"Sun Wu Ryuumoku","date":"2017-06-13T16:47:03.084+0000","up_votes":2,"down_votes":1,"body":"No, they classed him as an assassin cause his theme fit more in assassin... But they'll rework him for it.","replies":[]}]}]}]},{"poster":"Shahamut","date":"2017-06-13T14:44:55.865+0000","up_votes":3,"down_votes":0,"body":"Hooray for logic!!!","replies":[]},{"poster":"DuskDaUmbreon","date":"2017-06-13T15:40:18.452+0000","up_votes":1,"down_votes":0,"body":"So. Question: Does this mean that {{champion:84}} is a diver, and not an assassin? Her escape tools are basically nil (W is less an escape and more a breather, R requires an enemy target), and her common builds _almost_ support a diver playstyle. Yet, at the same time, she's squishy as hell, and typically instakilled by CC.","replies":[{"poster":"Ralanr","date":"2017-06-13T16:06:25.724+0000","up_votes":4,"down_votes":1,"body":"Riot probably wants her to be more of an assassin (hence her W blink) but she does currently play like a diver imo. She's a candidate for a full VGU in the future however.","replies":[]}]},{"poster":"lCantPauseltMom","date":"2017-06-13T10:19:00.558+0000","up_votes":2,"down_votes":1,"body":"It may just be an observation, but the Divers you've mentioned as well tend to be played as a form of Off-Tank as often as they are played full damage. Rengar, Vi, Hecarim, Camille - Although you do see a lot of full damage versions of these, in Rengar's case (just as an example) there seems to be a lot who build tankier with items such a Spirit Visage and Dead Man's Plate. You don't see many assassins built off-tank like you do the Divers.\n\nNot sure if that observation was 100% accurate, but that's just what I noticed.","replies":[{"poster":"OyddAWqJ5r","date":"2017-06-13T11:36:22.316+0000","up_votes":4,"down_votes":1,"body":"Just to further clarify builds only slightly change the nature of a champion. Whether Vi builds full damage or full tank she is still a Diver. If you just look at how the kit plays out when built both ways you can clearly tell this.\n\nHere's why.\n\nWhen Vi builds full damage she still is looking to ult her primary target and delete them. Only this time her damage is much higher and probably capable of going beyond simply one-shotting. She may die immediately afterwards or possibly take another champ too.\n\nWhen Vi builds full defense she _still_ is looking to ult her primary target and take them out of the fight--whether she kills them or not. Afterwards her goal is to pressure them away from the fight or kill them.\n\nIn both cases you can clearly see that she's still fulfilling her role as a Diver.\n\nJust because a champion builds full damage and can one-shot doesn't change the nature of their kit which still remains focused on their primary subclass. As I said in the OP, the ability to 100-0 isn't the defining attribute of an Assassin champion. The reason Ahri is considered to fulfill that subclass as well is because she can go in, 100-0 a target and then escape easily--which is essentially the definition of an Assassin.","replies":[]}]},{"poster":"Tusutaki","date":"2017-06-14T12:11:46.408+0000","up_votes":2,"down_votes":0,"body":"In short, the new class systems are needlessly more complex than before. The line between divers and assassins is so blurry that there's practically no difference between them due to how similar they function and defined save for a select few. All it does is confuses players more than it helps them.","replies":[{"poster":"Ralanr","date":"2017-06-14T13:50:50.406+0000","up_votes":1,"down_votes":2,"body":"To be fair, the old class system had useless terms as well. \n\nFighter was completely homogenized.","replies":[{"poster":"Tusutaki","date":"2017-06-14T14:09:34.623+0000","up_votes":2,"down_votes":0,"body":"Fighter at least gives you an idea of how the champion operates. Medium to high offense with medium utility. The only class additions I do like and agree with are Juggernauts and Enchanters. Both gives you a clear idea of what the champion is and does from the get go.","replies":[]}]}]},{"poster":"WinTheWarOnPants","date":"2017-06-13T21:51:58.242+0000","up_votes":2,"down_votes":0,"body":"annnnd then you have {{champion:64}}....\n","replies":[{"poster":"OyddAWqJ5r","date":"2017-06-14T02:12:05.237+0000","up_votes":2,"down_votes":0,"body":"Well Lee Sin is actually a ranged, melee, tanky dps, assassin, mage, tank, support, jungler according to the April 1st Champion Spotlight.","replies":[{"poster":"WinTheWarOnPants","date":"2017-06-14T03:21:40.763+0000","up_votes":2,"down_votes":0,"body":"The real joke is that it's kinda true lol","replies":[]}]},{"poster":"TotalJerk","date":"2017-06-14T13:48:41.339+0000","up_votes":1,"down_votes":0,"body":"Early game he's an assassin, and late game he either transitions into a diver if he got ahead, or a pseudo tanky support if he didn't.","replies":[]}]},{"poster":"sardiniii","date":"2017-06-13T19:11:17.194+0000","up_votes":2,"down_votes":2,"body":"Divers are not necessarily assassins but assassins are always almost divers","replies":[{"poster":"Variks the Loyal","date":"2017-06-13T20:46:40.404+0000","up_votes":2,"down_votes":2,"body":"Divers are a subclass, a Fighter variant. Assassins are also a subclass, a variant of Slayer. No Divers are Assassins and no Assassins are Divers. It's a distinction that Riot defined.","replies":[{"poster":"sardiniii","date":"2017-06-13T21:08:35.855+0000","up_votes":2,"down_votes":0,"body":"Well I mean, many assassins can effectively dive and escape.\n\nTake zed or talon","replies":[]}]}]},{"poster":"Standgrounding","date":"2017-06-13T16:46:53.224+0000","up_votes":2,"down_votes":0,"body":"Divers? You forgot {{champion:64}} in the list, especially considering his state now. And {{champion:5}}","replies":[]},{"poster":"Terchio","date":"2017-06-13T15:16:03.932+0000","up_votes":2,"down_votes":0,"body":">Assassins however are not the only class defined by single target deletion. You also have Divers whose role is to target a single enemy and Dive past resistance using tankiness, some form of CC immunity and some form of single target CC lockdown to completely obliterate it. \n\nThis is true. However, it's also conflating the class, because even that is not a necessity. {{champion:60}} is now one of the squishiest champions in the game, and a diver, and not reliable enough on her Cocoon to be a true CC threat.\n\nThe key to the class is the mobility. If you can get in and out, in theory, we peg you as an assassin. If getting in is easy, but getting out tends to be an issue, you're a diver. By this definition, Rengar may be the poster child diver in the game, and probably why he has been shoved the tankier direction. Having such high damage threat without an escape nor reliable CC leaves you being difficult to make viable in later game without being a delete bot, and yet being a delete bot (and being able to hand pick that deletion with ease) makes for a champion who can shake up an enemy team strategy with very limited counterplay. At least Elise is easy to follow in order to shut her down. Rengo is basically locked by his ultimate into either being OP in unfair ways, or being useless if you can't fill that delete role. With some tankiness in the mix, he at least has something to fall back on.","replies":[]},{"poster":"Pierce The Veal","date":"2017-06-13T20:41:46.900+0000","up_votes":2,"down_votes":1,"body":"Well Nocturne is officially classified as an Assassin.\n\nI'd say both divers and assassins in some cases play almost identically. It's bullshit that people keep going around trying to separate all of them.","replies":[{"poster":"OyddAWqJ5r","date":"2017-06-14T02:18:16.190+0000","up_votes":2,"down_votes":1,"body":"Very similar but perform very different functions.\n\nAs say Vi or Camille you're going to dive on an enemy and pummel them to death, sometimes in a single rotation sure but then you're stuck there but can still contribute to the fight through either decent DPS, tankiness, CC or a combination of the three.\n\nAs Talon or Zed you're going to dive on them and kill them with a spell rotation then zoom back out and not contribute as much to the fight after until your CD's are back up and you dive your next target. Though in Zed and Talon's cases they can toss Q and W respectively on relatively short CD's while they await their next opportunity.","replies":[{"poster":"Pierce The Veal","date":"2017-06-14T03:58:07.426+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Sleeper Cell,realm=NA,application-id=3ErqAdtq,discussion-id=o8ztwzIE,comment-id=00140000,timestamp=2017-06-14T02:18:16.190+0000)\n>\n> Very similar but perform very different functions.\n> \n> As say Vi or Camille you&#x27;re going to dive on an enemy and pummel them to death, sometimes in a single rotation sure but then you&#x27;re stuck there but can still contribute to the fight through either decent DPS, tankiness, CC or a combination of the three.\n> \n> As Talon or Zed you&#x27;re going to dive on them and kill them with a spell rotation then zoom back out and not contribute as much to the fight after until your CD&#x27;s are back up and you dive your next target. Though in Zed and Talon&#x27;s cases they can toss Q and W respectively on relatively short CD&#x27;s while they await their next opportunity.\n\nAs Nocturne you're going to dive and enemy and burst them to death, and, perhaps pull off some dps. But you shouldn't be expected to tank anything. Plus, Nocturne has about as good of a get away as most of the assassins. In the case of Vi and Camille, they have better getwayas than almost ALL of the assassins (except say, Kassadin). \n\nThe problem is this classification is bullshit. There is a range of champions, from those who dps to those who burst, from those who have no get aways to those have many get aways that are all split up and almost randomly called divers or assassins based on Riot's \"vision\" of the game. This is a spectrum, not some binary system where you're either a diver or an assassin.\n\nSad thing is, in this day and age, almost all divers are better assassins than assassins are.","replies":[{"poster":"OyddAWqJ5r","date":"2017-06-14T05:31:31.918+0000","up_votes":1,"down_votes":0,"body":"Nocturne is currently an outlier. He may as well be in the unique playstyle subclass.","replies":[{"poster":"Pierce The Veal","date":"2017-06-14T09:42:29.469+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sleeper Cell,realm=NA,application-id=3ErqAdtq,discussion-id=o8ztwzIE,comment-id=0014000000000000,timestamp=2017-06-14T05:31:31.918+0000)\n>\n> Nocturne is currently an outlier. He may as well be in the unique playstyle subclass.\n\nFair enough,\n\nThough I would put Akali in that class as well. No real escape, no real tankyness, no real dps, just burst sustain in combat mobility.","replies":[]}]}]}]}]}]}