{"poster":"Zero Shingetsu","date":"2019-07-20T04:43:52.229+0000","title":"Is Cait's ult unblockable?","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"I SWEAR I walked right in front of her ult today and it sailed right through me. Is this a change, a bug, or just weird hitboxing?","replies":[{"poster":"MagicFlyingLlama","date":"2019-07-20T04:56:06.237+0000","up_votes":2,"down_votes":0,"body":"Probably network latency or weird hitboxes.","replies":[{"poster":"Kazekiba","date":"2019-07-20T05:13:01.276+0000","up_votes":1,"down_votes":0,"body":"This. It's usually ping when I see it happen to me, I was 0.07 seconds slow to the punch due to 70ms ping but that projectile is *fast*, so sometimes it happens. \nUnless, of course, this occurs in Korea or pro games, which have near or literal 0 ping. Then I'm wrong and its a weird hitboxing","replies":[]}]},{"poster":"Daddy Ants","date":"2019-07-20T14:17:42.534+0000","up_votes":1,"down_votes":0,"body":"Caitlyn ult is blockable.","replies":[]},{"poster":"Best Ekko NA","date":"2019-07-20T05:11:16.348+0000","up_votes":1,"down_votes":0,"body":"It's more than likely a matter of timing, or like MagicFlyingLlama said, lag on your end or theirs. Buffer inputs accounts for latency from both their input and yours so if they were lagging you might not have been in front of the ultimate on their screen when the ultimate actually fired (even though it looks like you were on yours). There's a ton of strange interactions around the buffer inputs in league (such as champions like Tristana being able to jump while CC'd, Ezreal E'ing during a Blitzcrank hook, etc) and Cait's ultimate has issues with it as well.","replies":[]},{"poster":"Agent Corgi","date":"2019-07-20T05:06:11.778+0000","up_votes":1,"down_votes":0,"body":"It has one of those wierd hitboxes that you THINK you can body block it, but it can &amp; will miss you.\nIf they could make any Ability a bit more clear (so a got a pretty good idea where to stand), it'd be Caitlyn's Ultimate.","replies":[]}]}