{"poster":"lich Roland","date":"2017-10-05T06:00:46.411+0000","title":"A proposito di Sword Art Online","subforum":"Off-topic","up_votes":2,"down_votes":1,"body":"L&#039;anime l&#039;ho visto molto tempo quindi non mi ricordo molto,per&ograve; poco fa l&#039;ho visto citato in un post.\r\nQuindi ho voluto un thread apposto per parlarne un p&ograve;  e vorrei sapere quali sono I vuoti di trama","replies":[{"poster":"Jeanne dˆArc","date":"2017-10-05T06:03:13.636+0000","up_votes":8,"down_votes":0,"body":"I vuoti di trama sono riempiti dalle tette di Asuna.","replies":[{"poster":"UnknownEV","date":"2017-10-05T13:18:52.942+0000","up_votes":1,"down_votes":0,"body":"waifu","replies":[{"poster":"Jeanne dˆArc","date":"2017-10-05T13:22:37.876+0000","up_votes":3,"down_votes":0,"body":"Waiting for Ordinal Scale blu-ray ( ͡° ͜ʖ ͡°)","replies":[{"poster":"UnknownEV","date":"2017-10-05T15:29:53.927+0000","up_votes":3,"down_votes":0,"body":"{{sticker:sg-jinx}} yeeeees..","replies":[]}]}]}]},{"poster":"HaIIeIujah","date":"2017-10-05T06:33:45.700+0000","up_votes":5,"down_votes":2,"body":"https://68.media.tumblr.com/749cfecb4512f0dd775c6cfae516dca7/tumblr_n2zyvuauRy1sazdlqo1_500.gif\n\n\n* L'idea che in qualche modo la connessione di chiunque sia nel gioco vada avanti per due anni senza mai perdere connessione ad un server per dieci minuti, dunque friggendoli. \n* L'idea che in qualche modo il sistema per intrappolare i giocatori sia andato online senza che nessun dataminer se ne rendesse conto.\n* L'idea che il governo o le entità internazionali non abbiano in alcun modo fermato l'assurdità in corso per due anni, nonostante avessero accesso diretto e fisico ai server ed il creatore del gioco fosse bloccato nel gioco stesso ed impossibilitato a fermarli nel mondo esterno.\n* Qualunque cosa che riguardi le meccaniche del gioco. No, seriamente. SAO come videogioco è incomprensibile. \n* Il comportamento della community davanti ai beta tester è ridicolo. Non perché sia incomprensibile che diano la colpa a persone a caso (del resto, i forum online dimostrano chiaramente questo livello di illogicità) ma perché una volta morti gli imbecilli nei primi mesi il resto avrebbe letteralmente _venerato_ i beta tester rimasti in quanto una delle loro migliori chance di sopravvivenza.\n* Apparentemente, è possibile nascondere il proprio livello persino a _membri del tuo stesso gruppo_, nonostante questo dia vantaggi statistici.\n* Apparentemente, i membri della prima gilda di Kirito non si rendono conto del suo livello nonostante abbiano giocato con lui per un periodo esteso.\n* IL fatto che Kirito riesca in qualche modo a rimanere in cima al gioco nonostante sia un Solo Player in un mondo basato sui contenuti di gruppo è folle. Nessun ammontare di abilità personale può permetterti di outgearare-o outlivellare - una gilda ammesso che il gioco segua un qualunque set di regole consistenti. Se invece essere in Solo ha qualche vantaggio che ti permette di fare ciò allora _chiunque altro_ è un'idiota per aver anche solo pensato di partecipare ad una gilda.\n* Ancora una volta il fatto che Kirito uccida Gleam-Eyes praticamente in solo (per quanto sia una scena magnificamente animata e con un'ottima soundtrack) non può essere accettato. Per una questione di numeri, Kirito dovrebbe avere la tankyness o il DPS di 20 persone, cosa che per quanto possibile ( partendo dal principio che sia una decina o ventina di livelli sopra gli altri) va a rafforzare il mio punto precedente sul divario solo/gruppo.\n* Qualunque cosa riguarda la motivazione di Kayaba. Nulla grida \"non ho pensato ad un motivo valido per il villain.\" come \"Me lo sono scordato.\"\n* Volevo limitarmi alla prima parte della prima serie dato che è l'unica che ricordo nel dettaglio, ma aggiungo qui il metodo di uccisione di Death Gun. E' una follia.\n* Quello che per me è il punto in cui la serie ha rinunciato ad ogni parvenza di credibilità: la mai-prima-di-allora capacità dimostrata da Kirito di riscrivere il codice di SAO imparando ad usare una console da amministratore _in meno di un minuto._\n* Il fatto che un'intero skill-tree (Dual Wielding) sia accessibile ad un solo giocatore. Ancora peggio, il fatto che l'intero skill-tree sia basato su qualcosa di astratto come _i tempi di reazione,_ che in un mondo online come un MMO significano semplicemente \"chi ha meno Ping sul server\". \n* Il discorso sulla paralisi spezzata e sull'attacco finale di Kirito a 0 HP. In un fantasy avrei tranquillamente creduto ad un'ultimo atto di volontà che permette di superare per un istante le regole del mondo. In un MMO? No, grazie. Il codice è il codice, e non viene spezzato semplicemente perché vuoi farlo.\n\nPiccolo dettaglio sull'ultimo punto: SAO aveva un modo semplice, sensato, e francamente abbastanza furbo per risolvere la battaglia finale che non è stato usato. Una cosa che io ero _certo_ sarebbe successa, con l'uso dell'item di Revival mostrato all'inizio della serie. Ho trovato quella scena una sintesi delle mie aspettative per l'anime: alzate e deluse, in favore del minimo sforzo necessario per creare una serie che compiacesse i più bassi desideri di potere dello spettatore medio.","replies":[{"poster":"Floppyz","date":"2017-10-05T07:17:02.378+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ł Tera ł,realm=EUW,application-id=Un6AGJq2,discussion-id=l2dv5Tv1,comment-id=0001,timestamp=2017-10-05T06:33:45.700+0000)\n>\nSolo per diletto (e non per polemica) provo a fare l'avvocato del diavolo:\n\n**premessa: l'ho visto qualche tempo fa e potrei ricordare male, nel caso no report x9 plz.**\n\nPremetto anche che quando si fruisce di un'opera di fantasia (film/libri/anime/etc.) ci si aspetta che il fruitore metta in atto la c.d. _sospensione dell'incredulità_, perché altrimenti credo che qualsiasi di queste opere, documentari esclusi, sia questionabile. Questo non vuol dire che non esistano regole, ma che l'importante è che quello che viene mostrato sia coerente con i princìpi fisici e le regole che l'opera stessa detta.\n\nEsempio scemo: se non volessimo applicare questo concetto, dovremmo criticare Star Wars per (senza alcuna spiegazione, se non il divertimento e la godibilità del film) tutti i suoni durante le scene ambientate nello spazio, dove non essendoci atmosfera/aria il suono non si può certo propagare. Però ci sarebbe piaciuto uno Star Wars mezzo muto? :P O un Ghostbusters senza fantasmi?\n\n> * L&#x27;idea che in qualche modo la connessione di chiunque sia nel gioco vada avanti per due anni senza mai perdere connessione ad un server per dieci minuti, dunque friggendoli. \n\nMi pare che durante la serie venga accennato che in tanti sono morti proprio per problemi del genere (mancanza FEM o connessione). Si suppone (ma si vede anche in una scena e viene detto, mi pare) che buona parte di quelli ancora vivi siano stati trasferiti in strutture appositamente attrezzate (reparti d'ospedale _ad hoc_?) onde tenerli sotto controllo, nutrirli ed evitare problemi del genere.\n\n> * L&#x27;idea che in qualche modo il sistema per intrappolare i giocatori sia andato online senza che nessun dataminer se ne rendesse conto.\n\nSi suppone (almeno io così ho capito/realizzato) che il server sfrutti un bug (o un'apposita funzione nascosta, non ricordo bene) del firmware dei dispositivi VR. In alternativa è proprio tutto hardcoded nel dispositivo stesso, e non è detto che ci si possa mettere il naso o sia facile farlo.\n\n> * L&#x27;idea che il governo o le entità internazionali non abbiano in alcun modo fermato l&#x27;assurdità in corso per due anni, nonostante avessero accesso diretto e fisico ai server ed il creatore del gioco fosse bloccato nel gioco stesso ed impossibilitato a fermarli nel mondo esterno.\n\nSe non ricordo male si parlava di server all'estero o comunque non accessibili fisicamente, e il tizio stesso non si sapeva dove stesse.\n\n> * Qualunque cosa che riguardi le meccaniche del gioco. No, seriamente. SAO come videogioco è incomprensibile. \n\nBeh diciamo che è un MMO semplificato di cui non ci vengono spiegate tutte le meccaniche, principalmente cosa non ti torna?\n\n> * Il comportamento della community davanti ai beta tester è ridicolo. Non perché sia incomprensibile che diano la colpa a persone a caso (del resto, i forum online dimostrano chiaramente questo livello di illogicità) ma perché una volta morti gli imbecilli nei primi mesi il resto avrebbe letteralmente _venerato_ i beta tester rimasti in quanto una delle loro migliori chance di sopravvivenza.\n\nVero, diciamo che è funzionale a come han voluto sviluppare la trama. È anche vero, sempre se non ricordo male, che con l'avanzare della serie, l'immagine che i giocatori hanno dei beta tester muta, e forse è proprio questo che volevano scrivere: la classica situazione dove qualcosa/qualcuno è visto in un modo, ma poi con le azioni che compie qualcuno, questo qualcosa/qualcuno viene gradualmente visto diversamente. Credo sia un _topos_ comune.\n\n> * Apparentemente, è possibile nascondere il proprio livello persino a _membri del tuo stesso gruppo_, nonostante questo dia vantaggi statistici.\n\nImba. Rito plz fix. Insomma, possiamo criticare la scelta di design, ma non è un'incongruenza.\n\n> * Apparentemente, i membri della prima gilda di Kirito non si rendono conto del suo livello nonostante abbiano giocato con lui per un periodo esteso.\n\nSi suppone che non abbia fatto niente per far trasparire questa informazione. Non credo sia impossibile.\n\n> * IL fatto che Kirito riesca in qualche modo a rimanere in cima al gioco nonostante sia un Solo Player in un mondo basato sui contenuti di gruppo è folle. Nessun ammontare di abilità personale può permetterti di outgearare-o outlivellare - una gilda ammesso che il gioco segua un qualunque set di regole consistenti. Se invece essere in Solo ha qualche vantaggio che ti permette di fare ciò allora _chiunque altro_ è un&#x27;idiota per aver anche solo pensato di partecipare ad una gilda.\n\nL'idea che mi sono fatto è che giocare in solo dia vantaggi in termini di exp (non devi shararla) e di loot. L'altra faccia della medaglia è che è più difficile, e considerando la situazione, più pericoloso. Considerato quindi che il protagonista ci viene venduto con capacità straordinarie e abilissimo, direi che quadra. Inoltre devi considerare, che come IRL, entrare in una gilda ti subordina a certi obblighi e regole, dandoti meno autonomia, o nella peggiore delle ipotesi facendoti perdere tempo magari dietro o con pesi morti.\n\nPiccolo aneddoto: l'exp funziona in quel modo anche a _Ragnarok Online_ e quando ci giocavo avevo un amico che non riuscivo quasi mai a convincere a fare party perché _prendo meno exp_.\n\n> * Ancora una volta il fatto che Kirito uccida Gleam-Eyes praticamente in solo (per quanto sia una scena magnificamente animata e con un&#x27;ottima soundtrack) non può essere accettato. Per una questione di numeri, Kirito dovrebbe avere la tankyness o il DPS di 20 persone, cosa che per quanto possibile ( partendo dal principio che sia una decina o ventina di livelli sopra gli altri) va a rafforzare il mio punto precedente sul divario solo/gruppo.\n\nMi sembra che ti sia risposto da solo: in qualsiasi MMORPG, e mi viene in mente WOW, con una decina di livelli in più di tanti boss puoi farteli in solo.\n\n> * Qualunque cosa riguarda la motivazione di Kayaba. Nulla grida &quot;non ho pensato ad un motivo valido per il villain.&quot; come &quot;Me lo sono scordato.&quot;\n\nLa spiegazione che mi ero dato io, basandomi sul personaggio, è che, per quanto folle possa sembrare (ma negli anime quale personaggio non è folle?) quello che voleva era vivere quell'avventura: un mondo emozionante e pericoloso dove lui potesse guidare persone inizialmente disperate verso un obiettivo comune e di importanza vitale, e contemporaneamente avere il controllo completo su questo mondo.\n\nNon suona come qualcosa di divertente? :)\n\n> * Volevo limitarmi alla prima parte della prima serie dato che è l&#x27;unica che ricordo nel dettaglio, ma aggiungo qui il metodo di uccisione di Death Gun. E&#x27; una follia.\n\nRicordo molto vagamente, ma in generale, quando si tratta di azione e combattimenti, la logica lascia spazio alla spettacolarità, credo praticamente in qualsiasi opera di fantasia.\n\n> * Quello che per me è il punto in cui la serie ha rinunciato ad ogni parvenza di credibilità: la mai-prima-di-allora capacità dimostrata da Kirito di riscrivere il codice di SAO imparando ad usare una console da amministratore _in meno di un minuto._\n\nInnegabile, però di nuovo, sono esigenze di scrittura, come il tizio che mette un virus in un sistema **alieno** in _Indipendence day_ o il classico smanettone informatico che in tutte le storie fa delle cose impossibili su sistemi che non ha mai visto (e questa cosa la si vede in prodotti che si vendono anche come molto più seri eh). È assurdo ma puoi solo accettarlo.\n\n> * Il fatto che un&#x27;intero skill-tree (Dual Wielding) sia accessibile ad un solo giocatore. Ancora peggio, il fatto che l&#x27;intero skill-tree sia basato su qualcosa di astratto come _i tempi di reazione,_ che in un mondo online come un MMO significano semplicemente &quot;chi ha meno Ping sul server&quot;.\n\nGame design. Riguardo ai tempi di reazione, **credo** che in qualche modo vengano misurati al netto del ping. Ad ogni modo, se non sbaglio i tempi di reazione di un essere umano in media sono nell'ordine dei 100~500 ms, e in un mondo tecnologico come quello che ci viene mostrato, mi azzardo a dire che il ping probabilmente sarebbe bassissimo, quindi praticamente ininfluente.\n\n> * Il discorso sulla paralisi spezzata e sull&#x27;attacco finale di Kirito a 0 HP. In un fantasy avrei tranquillamente creduto ad un&#x27;ultimo atto di volontà che permette di superare per un istante le regole del mondo. In un MMO? No, grazie. Il codice è il codice, e non viene spezzato semplicemente perché vuoi farlo.\n\nSorry, non ricordo.\n\n> Piccolo dettaglio sull&#x27;ultimo punto: SAO aveva un modo semplice, sensato, e francamente abbastanza furbo per risolvere la battaglia finale che non è stato usato. Una cosa che io ero _certo_ sarebbe successa, con l&#x27;uso dell&#x27;item di Revival mostrato all&#x27;inizio della serie. Ho trovato quella scena una sintesi delle mie aspettative per l&#x27;anime: alzate e deluse, in favore del minimo sforzo necessario per creare una serie che compiacesse i più bassi desideri di potere dello spettatore medio.\n\nAnche qui ho un ricordo confuso.\n\nChiudo dicendo che, con questi accenni di spiegazione non voglio dire che sei scemo o non hai capito niente: sto solo provando a trovare giustificazioni plausibili a cose che magari sono solo accennate o lasciate alla fantasia dello spettatore, ma che non credo possano essere considerati errori, a meno di non voler mettere in discussione qualsiasi opera di fantasia (cosa che mi sembrerebbe un po' controproducente se se ne vuole fruire).\n\nInsomma, non vedo errori madornali, dal punto di vista della coerenza/fisica/credibilità che dovrebbero pregiudicare la qualità dell'opera (a meno di non voler giudicare come pessimo qualsiasi altro prodotto di fantasia, perché non risponde a tutte le regole logico-fisiche del mondo reale), anche se IMHO i problemi di quest'anime sono altri.","replies":[{"poster":"HaIIeIujah","date":"2017-10-05T08:05:10.021+0000","up_votes":2,"down_votes":0,"body":"> Esempio scemo: se non volessimo applicare questo concetto, dovremmo criticare Star Wars per (senza alcuna spiegazione, se non il divertimento e la godibilità del film) tutti i suoni durante le scene ambientate nello spazio, dove non essendoci atmosfera/aria il suono non si può certo propagare. Però ci sarebbe piaciuto uno Star Wars mezzo muto? :P O un Ghostbusters senza fantasmi?\n\nStar Wars è un'epica di fantasia. Si, i suoni nello spazio non ci sono, l'FTL non esiste, e le spade laser sono inconsistenti. Il motivo per cui non vengono criticate è perché il setup della storia non è realistico, e come tale non pone enfasi sulle incongruenze di servizio.\n\nSAO è l'opposto. Dal primo episodio di martella in testa su come questo è un'MMO in cui i giocatori sono intrappolati, un VR, una realtà che potrebbe succedere nell'immediato futuro. Se non ci fossero scene come Kirito che discute di game design (Sword Skill) non parlerei di Game Design. Se non ci fosse un'enfasi sulle sue statistiche fatte in solo play non parlerei dello split solo/party. \n\nStar Wars non ha la pretesa di essere realistico, mentre un'altro sci-fi come The Martian si. Che è il motivo per cui dire che il vento su Marte era  strano in The Martian ha senso, mentre dire che i suoi nello spazio di Star Wars sono irreali non ne ha.\n\n_Per quel che vale, ho adorato The Martian._\n\n> Mi pare che durante la serie venga accennato che in tanti sono morti proprio per problemi del genere (mancanza FEM o connessione). Si suppone (ma si vede anche in una scena e viene detto, mi pare) che buona parte di quelli ancora vivi siano stati trasferiti in strutture appositamente attrezzate (reparti d'ospedale ad hoc?) onde tenerli sotto controllo, nutrirli ed evitare problemi del genere.\n\nNo, si parla di come sono morti per errori idioti o per non aver preso sul serio la minaccia di morte. Non c'è mai un riferimento ad errori di connessione.\n\n> Si suppone (almeno io così ho capito/realizzato) che il server sfrutti un bug (o un'apposita funzione nascosta, non ricordo bene) del firmware dei dispositivi VR. In alternativa è proprio tutto hardcoded nel dispositivo stesso, e non è detto che ci si possa mettere il naso o sia facile farlo.\n\nAncora peggio se è harcodato nel casco, dato che implica che nessuno di coloro che lo hanno fisicamente creato o venduto se ne siano resi conto durante la distribuzione. Lo trovo ancora peggio di ipotizzare, per così dire, una patch al Day 1.\n\n> Se non ricordo male si parlava di server all'estero o comunque non accessibili fisicamente, e il tizio stesso non si sapeva dove stesse.\n\nI server sono in Giappone e vengono poi riutilizzati da un'altra compagnia per intrappolare Asuna ed altri giocatori.\n\n> Vero, diciamo che è funzionale a come han voluto sviluppare la trama. È anche vero, sempre se non ricordo male, che con l'avanzare della serie, l'immagine che i giocatori hanno dei beta tester muta, e forse è proprio questo che volevano scrivere: la classica situazione dove qualcosa/qualcuno è visto in un modo, ma poi con le azioni che compie qualcuno, questo qualcosa/qualcuno viene gradualmente visto diversamente. Credo sia un topos comune.\n\nLe cose possono essere funzionali alla trama e consistenti senza problema alcuno. Per esempio, se avessimo visto gli altri beta tester abbandonare i niubbi o abusarne per ottenere un vantaggio, rendendolo quindi credibile. Cosa che non succede.\n\n> Imba. Rito plz fix. Insomma, possiamo criticare la scelta di design, ma non è un'incongruenza.\n\nCerto che è un'incongruenza, perché ancora una volta è un caso in cui l'autore non si è informato o curato abbastanza di creare un mondo consistente con regole stabilite. Questo non viene mai commentato nell'anime ed è assolutamente inconcepibile in un gioco moderno, figurarsi nel futuro a venire. Un'altro esempio di come l'autore non si è curato di creare un mondo virtuale credibile, che è un'errore in questo caso di worldbuilding e non di \"design\", dato che il gioco è la sua ambientazione.\n\n> Si suppone che non abbia fatto niente per far trasparire questa informazione. Non credo sia impossibile.\n\nSi, è assolutamente impossibile. Come parte del gruppo gioca con loro. Anche se immaginassimo che HP, Mana, Effetti di spell e tutto altro fossero nascosti, lui comuqneu colpirebbe per danni di ordini di magnitudine superiore ai suoi compagni, indosserebbe gear ed userebbe abilità di un livello superiore, per non parlare di casi palesi come la sua HP regen (mostrata più volte)che è immensamente superiore alla media dei suoi amici livellini.\n\n> L'idea che mi sono fatto è che giocare in solo dia vantaggi in termini di exp (non devi shararla) e di loot. L'altra faccia della medaglia è che è più difficile, e considerando la situazione, più pericoloso. Considerato quindi che il protagonista ci viene venduto con capacità straordinarie e abilissimo, direi che quadra. Inoltre devi considerare, che come IRL, entrare in una gilda ti subordina a certi obblighi e regole, dandoti meno autonomia, o nella peggiore delle ipotesi facendoti perdere tempo magari dietro o con pesi morti.\n\nNo, non quadra, perché ci sono mostri chiaramente tarati per essere affrontati in gruppo (come persino il primo boss) con meccaniche da Raid, che implica contenuti di gruppo. Heathcliff/Kayaba stesso, che ha assoluta conoscenza del gioco _avendolo creato,_ ha strutturato la progressione tramite gilde come parte del suo piano (cosa che ammette lui stesso una volta scoperto.) \n\n> Mi sembra che ti sia risposto da solo: in qualsiasi MMORPG, e mi viene in mente WOW, con una decina di livelli in più di tanti boss puoi farteli in solo.\n\nKirito dopo il burst iniziale di livelli è soltanto pochi livelli sopra gli altri giocatori delle gilde di Frontiera. In particolare Asuna è 5-6 livelli sotto di lui. Il motivo per cui appare oscenamente overlivellato è perché molte scene sono ambientate nei piani inferiori e contro PK di basso livello, che sono intorno al 40 mentre lui è al 70. Quando arrivano contro Gleam-Eyes sono già nell'avanguardia, contro i Boss che permettono di sbloccare i piani successivi. Non c'è tutto questo divario.\n\n> La spiegazione che mi ero dato io, basandomi sul personaggio, è che, per quanto folle possa sembrare (ma negli anime quale personaggio non è folle?) quello che voleva era vivere quell'avventura: un mondo emozionante e pericoloso dove lui potesse guidare persone inizialmente disperate verso un obiettivo comune e di importanza vitale, e contemporaneamente avere il controllo completo su questo mondo.\n> Non suona come qualcosa di divertente? :)\n\nLa spiegazione che ti sei dato tu è un tuo tentativo di riempire il vuoto lasciato dalla storia. Io ho la mia spiegazione, diversa dalla tua, ma entrambe sono cerotti messi sulla ferita aperte della mancanza di motivazione. Se vogliamo parlare di \"mia spiegazione\" possiamo giustificar qualunque cosa.\n\nE ti prego di non tentare l'argomento di \"è una scelta intenzionale per lasciarne discutere\", perché ho letto le novel e l'autore. non ha l'acume per giustificare certi virtuosismi.\n\n> Ricordo molto vagamente, ma in generale, quando si tratta di azione e combattimenti, la logica lascia spazio alla spettacolarità, credo praticamente in qualsiasi opera di fantasia.\n\nParlo del metodo di uccisione di Death Gun delle sue vittime nella vita reale. Che non ha nulla a che fare con la spettacolarità, sfortunatamente.\n\n> Innegabile, però di nuovo, sono esigenze di scrittura, come il tizio che mette un virus in un sistema alieno in Indipendence day o il classico smanettone informatico che in tutte le storie fa delle cose impossibili su sistemi che non ha mai visto (e questa cosa la si vede in prodotti che si vendono anche come molto più seri eh). È assurdo ma puoi solo accettarlo.\n\nPrimo, quello infatti è una delle scene più criticate di Indipendence Day. Secondo, è un Deus-Ex-Machina che ci priva di quella che sarebbe stata una delle poche morti significative in SAO. Un momento emozionale in cui un personaggio si sacrifica per gli altri, negato da una scelta dell'autore di tenerlo in vita arbitrariamente. \n\nEsigenza di trama? No, è semplicemente una scelta fatta all'ultimo minuto per privare le azioni di Yui di qualunque conseguenza.\n\n> Game design.\n\nSe il tuo mondo è un gioco, il game design è worldbuilding. Ne ho già parlato.\n\n> Insomma, non vedo errori madornali, dal punto di vista della coerenza/fisica/credibilità che dovrebbero pregiudicare la qualità dell'opera (a meno di non voler giudicare come pessimo qualsiasi altro prodotto di fantasia, perché non risponde a tutte le regole logico-fisiche del mondo reale), anche se IMHO i problemi di quest'anime sono altri.\n\nI mondi di fantasia non devono rispondere alle regole del mondo reale, ma devono rispondere a _delle regole interne di coerenza e logica._\n\nSe cerchi di dire a me, lettore, che la tua storia è ambientata in un gioco online, e questo gioco online ha delle regole precise che il tuo protagonista conosce e sa abusare, queste devono avere un senso. \n\nQuello di SAO non è universo libero, come può essere quello di Guren-Lagan governato da \"regole\" come la forza di volontà e la capacità stessa di romperle. SAO è un mondo virtuale basato su leggi, ma a differenza di Matrix nessuno è l'Eletto. C'è un intero arco narrativo volto a spiegare come funzionano i concetti di safe zone e PK o scomparsa degli item, persino utilizzando le regole del gioco per creare un mistero interno. Questo crea l'aspettativa che siano consistenti.\n\nPer tirare in ballo un'esempio opposto: Log Horizon, un'anime con un concetto simile, fa molto spesso l'affermazione che c'è qualcosa di sovrannaturale nel fenomeno che li ha intrappolati, e che i suoi effetti si stanno ancora rivelando. LH non va spesso contro le regole stabilite e quando lo fa tende ad essere più un discorso di \"trovare un modo per aggirare una limitazione\" che \"romperla\", ma se dopo tre stagioni qualcuno facesse qualcosa di completamente impossibile potrebbe giustificarlo facendo riferimento ad un concetto stabilito all'inizio della serie.","replies":[{"poster":"Floppyz","date":"2017-10-05T09:15:08.790+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ł Tera ł,realm=EUW,application-id=Un6AGJq2,discussion-id=l2dv5Tv1,comment-id=000100000000,timestamp=2017-10-05T08:05:10.021+0000)\n>\n> Star Wars è un&#x27;epica di fantasia. Si, i suoni nello spazio non ci sono, l&#x27;FTL non esiste, e le spade laser sono inconsistenti. Il motivo per cui non vengono criticate è perché il setup della storia non è realistico, e come tale non pone enfasi sulle incongruenze di servizio.\n> \n> SAO è l&#x27;opposto. Dal primo episodio di martella in testa su come questo è un&#x27;MMO in cui i giocatori sono intrappolati, un VR, una realtà che potrebbe succedere nell&#x27;immediato futuro. Se non ci fossero scene come Kirito che discute di game design (Sword Skill) non parlerei di Game Design. Se non ci fosse un&#x27;enfasi sulle sue statistiche fatte in solo play non parlerei dello split solo/party. \n> \n> Star Wars non ha la pretesa di essere realistico, mentre un&#x27;altro sci-fi come The Martian si. Che è il motivo per cui dire che il vento su Marte era  strano in The Martian ha senso, mentre dire che i suoi nello spazio di Star Wars sono irreali non ne ha.\n> \n> _Per quel che vale, ho adorato The Martian._\n\n\nPerdonami ma non sono d'accordo, io non ho riscontro di questa auto-elevazione di SAO a _storia possibile IRL_, e ora capisco che forse è questo il punto da cui nascono queste tue critiche. Prova invece a considerarlo alla pari di tutte le opere di fantasia, che non pretendono di essere reali, ma _lontanamente realistiche_.\n \n> No, si parla di come sono morti per errori idioti o per non aver preso sul serio la minaccia di morte. Non c&#x27;è mai un riferimento ad errori di connessione.\n\nDovrei cercare, ma ricordo abbastanza bene almeno una singola scena in cui veniva data quest'informazione. Googlando alla veloce ho trovato questo (che vabbè non è una fonte primaria):\n\n>The Nervegear had a battery backup in case of powercut, etc. It allowed just enough time to drag them to hospital and hook them up. IIRC it is mentioned in an episode, showing a few flashbacks of people slumped lifeless in the streets while they were disconnected.\n\ne in effetti ricordo una scena o con un notiziario o che comunque parlava di questo trasporto dei giocatori, e del fatto che molti erano morti.\n\n> Ancora peggio se è harcodato nel casco, dato che implica che nessuno di coloro che lo hanno fisicamente creato o venduto se ne siano resi conto durante la distribuzione. Lo trovo ancora peggio di ipotizzare, per così dire, una patch al Day 1.\n\nNon capisco cosa vuoi dire. Non credo comunque sia del tutto impossibile inserire del codice (per quanto ne sappiamo potrebbero bastare poche righe) in una cosa così complessa.\n\nÈ famoso il caso degli animatori di _Le avventure di Bianca e Bernie_ che hanno infilato (in alcuni fotogrammi) una donna nuda in un film Disney. Nessuno se n'è accorto prima del rilascio, e probabilmente nessuno spettatore se n'è accorto per parecchio tempo.\n\n> I server sono in Giappone e vengono poi riutilizzati da un&#x27;altra compagnia per intrappolare Asuna ed altri giocatori.\n\nAllora forse la spiegazione potrebbe ricondursi al fatto di rischiare di uccidere tutte le persone collegate in caso di errore o disconnessione.\n\n> Le cose possono essere funzionali alla trama e consistenti senza problema alcuno. Per esempio, se avessimo visto gli altri beta tester abbandonare i niubbi o abusarne per ottenere un vantaggio, rendendolo quindi credibile. Cosa che non succede.\n\nTutto dipende dalla storia che vuoi raccontare, evidentemente nella storia che l'autore ha voluto raccontare, non si voleva dare questa connotazione oggettivamente negativa a quei personaggi. Non lo ritengo per questo meno credibile.\n\n> Certo che è un&#x27;incongruenza, perché ancora una volta è un caso in cui l&#x27;autore non si è informato o curato abbastanza di creare un mondo consistente con regole stabilite. Questo non viene mai commentato nell&#x27;anime ed è assolutamente inconcepibile in un gioco moderno, figurarsi nel futuro a venire. Un&#x27;altro esempio di come l&#x27;autore non si è curato di creare un mondo virtuale credibile, che è un&#x27;errore in questo caso di worldbuilding e non di &quot;design&quot;, dato che il gioco è la sua ambientazione.\n\nNon credo che il poter nascondere alcune statistiche (diciamo pure la maggior parte, se vuoi) sia un'incongruenza o un errore. È semplicemente una scelta di design (non direi _world building_ visto che si tratta di qualcosa relativo al giocatore e non a quest/ambienti/NPC). Inoltre anche questo è funzionale alla trama.\n\nInsomma, come per tutte le altre opere, è necessario fare scelte magari poco logiche (ma non per questo assurde o impossibili), altrimenti _Breaking Bad_ finirebbe al primo episodio o Lupin smetterebbe di rubare una volta accumulato abbastanza denaro.\n\n> Si, è assolutamente impossibile. Come parte del gruppo gioca con loro. Anche se immaginassimo che HP, Mana, Effetti di spell e tutto altro fossero nascosti, lui comuqneu colpirebbe per danni di ordini di magnitudine superiore ai suoi compagni, indosserebbe gear ed userebbe abilità di un livello superiore, per non parlare di casi palesi come la sua HP regen (mostrata più volte)che è immensamente superiore alla media dei suoi amici livellini.\n\nNo se può decidere (e si suppone possa, vista l'ampia libertà fisica che il gioco offre) l'intensità con cui colpire e/o usare una determinata skill. Il gear, armi a parte, non sono sicuro che abbia effettivamente un riscontro visivo, non sempre almeno, e comunque si suppone sia possibile nasconderne le statistiche una volta equipaggiato.\n\n> No, non quadra, perché ci sono mostri chiaramente tarati per essere affrontati in gruppo (come persino il primo boss) con meccaniche da Raid, che implica contenuti di gruppo. Heathcliff/Kayaba stesso, che ha assoluta conoscenza del gioco _avendolo creato,_ ha strutturato la progressione tramite gilde come parte del suo piano (cosa che ammette lui stesso una volta scoperto.) \n\nÈ il protagonista, davvero ti stupisce che sia così tanto più bravo o riesca a fare cose che, nel gioco, sono progettate per gruppi di persone?\n\nA questo punto penso possiamo prendere ad esempio una qualsiasi storia d'azione per trovare le stesse incongruenze, quindi sono tutte pessime?\n\nBlack Lagoon dove 2/3 persone riescono praticamente a schivare proiettili e a ucciderne una moltitudine?\n\nQuesto si rifà alla mia premessa iniziale, senza la quale, come dicevo, tutte le opere di fantasia sono criticabili per queste esagerazioni evidentemente impossibili.\n\n> Kirito dopo il burst iniziale di livelli è soltanto pochi livelli sopra gli altri giocatori delle gilde di Frontiera. In particolare Asuna è 5-6 livelli sotto di lui. Il motivo per cui appare oscenamente overlivellato è perché molte scene sono ambientate nei piani inferiori e contro PK di basso livello, che sono intorno al 40 mentre lui è al 70. Quando arrivano contro Gleam-Eyes sono già nell&#x27;avanguardia, contro i Boss che permettono di sbloccare i piani successivi. Non c&#x27;è tutto questo divario.\n\nTu stesso hai scritto che in quell'occasione ha 10-20 livelli più del richiesto (io mi son fidato perché non ricordo). In questo caso non mi sembra un'impresa impossibile, come ho detto.\n\n> La spiegazione che ti sei dato tu è un tuo tentativo di riempire il vuoto lasciato dalla storia. Io ho la mia spiegazione, diversa dalla tua, ma entrambe sono cerotti messi sulla ferita aperte della mancanza di motivazione. Se vogliamo parlare di &quot;mia spiegazione&quot; possiamo giustificar qualunque cosa.\n> \n> E ti prego di non tentare l&#x27;argomento di &quot;è una scelta intenzionale per lasciarne discutere&quot;, perché ho letto le novel e l&#x27;autore. non ha l&#x27;acume per giustificare certi virtuosismi.\n\nIl fatto che un personaggio non espliciti le sue motivazioni non vuol dire che queste non esistano o sono assurde. Se qualcosa non viene raccontato non vuol dire che debba essere _giustificato_, nessuna storia ti racconta tutto, c'è sempre qualcosa che viene lasciato alla tua immaginazione ed è deducibile da elementi della storia, questo perché non è mai possibile raccontare tutto, quindi si fanno delle scelte su cosa inserire, cosa tralasciare, e cosa lasciarti immaginare. È normale.\n\n> Parlo del metodo di uccisione di Death Gun delle sue vittime nella vita reale. Che non ha nulla a che fare con la spettacolarità, sfortunatamente.\n\nOk, non ricordo la scena, quindi a meno di non andarmela a rivedere, non so risponderti.\n\n> Primo, quello infatti è una delle scene più criticate di Indipendence Day. Secondo, è un Deus-Ex-Machina che ci priva di quella che sarebbe stata una delle poche morti significative in SAO. Un momento emozionale in cui un personaggio si sacrifica per gli altri, negato da una scelta dell&#x27;autore di tenerlo in vita arbitrariamente. \n> \n> Esigenza di trama? No, è semplicemente una scelta fatta all&#x27;ultimo minuto per privare le azioni di Yui di qualunque conseguenza.\n\nNon sono d'accordo, non è che la storia la scrivi all'ultimo minuto; anche se non sembra c'è tanto lavoro dietro e tutto viene ben pianificato, per portare sullo schermo esattamente quello che l'autore (o meglio la produzione) vuole. È un _deus ex machina_? Probabilmente sì. Il _deus ex machina_ è un espediente sbagliato? No, è di uso comune. Se non ti piace (a me solitamente non piace) suggerisco Game of Thrones, anche se ultimamente mi pare che se ne faccia un po' troppo uso anche lì.\n\n> Se il tuo mondo è un gioco, il game design è worldbuilding. Ne ho già parlato.\n\nMi sa che abbiamo due definizioni diverse di _game design_ e _world building_, per la mia ti rimando un po' più in alto nel post.\n\n_CONTINUA SOTTO_","replies":[]}]}]},{"poster":"lich Roland","date":"2017-10-05T14:36:23.249+0000","up_votes":1,"down_votes":0,"body":"wow,io quando lo guardavo non ci avevo minimamente pensato!\nI personaggi invece?","replies":[]}]},{"poster":"Nabbomaster","date":"2017-10-05T12:23:15.543+0000","up_votes":2,"down_votes":1,"body":"molto meglio Overlord","replies":[{"poster":"Giorgio di villa","date":"2017-10-05T13:36:08.894+0000","up_votes":1,"down_votes":0,"body":"Si può dire che overlord è già un passo avanti rispetto a Sao","replies":[]}]},{"poster":"Floppyz","date":"2017-10-05T09:15:31.628+0000","up_votes":1,"down_votes":0,"body":"> I mondi di fantasia non devono rispondere alle regole del mondo reale, ma devono rispondere a _delle regole interne di coerenza e logica._\n> \n> Se cerchi di dire a me, lettore, che la tua storia è ambientata in un gioco online, e questo gioco online ha delle regole precise che il tuo protagonista conosce e sa abusare, queste devono avere un senso. \n\nMi sembra che questi requisiti siano rispettati. Tieni anche conto che sono poche le regole ben precise e sicure che vengono spiegate relativamente al gioco. Quelle dubbie o superabili può essere siano state screditate, ma anche questa è una cosa normale, per creare l'_effetto wow_ o dei colpi di scena.\n\n> Quello di SAO non è universo libero, come può essere quello di Guren-Lagan governato da &quot;regole&quot; come la forza di volontà e la capacità stessa di romperle. SAO è un mondo virtuale basato su leggi, ma a differenza di Matrix nessuno è l&#x27;Eletto. C&#x27;è un intero arco narrativo volto a spiegare come funzionano i concetti di safe zone e PK o scomparsa degli item, persino utilizzando le regole del gioco per creare un mistero interno. Questo crea l&#x27;aspettativa che siano consistenti.\n\nPerlopiù mi sembrano consistenti...\n\n> Per tirare in ballo un&#x27;esempio opposto: Log Horizon, un&#x27;anime con un concetto simile, fa molto spesso l&#x27;affermazione che c&#x27;è qualcosa di sovrannaturale nel fenomeno che li ha intrappolati, e che i suoi effetti si stanno ancora rivelando. LH non va spesso contro le regole stabilite e quando lo fa tende ad essere più un discorso di &quot;trovare un modo per aggirare una limitazione&quot; che &quot;romperla&quot;, ma se dopo tre stagioni qualcuno facesse qualcosa di completamente impossibile potrebbe giustificarlo facendo riferimento ad un concetto stabilito all&#x27;inizio della serie.\n\nNon ho ancora visto _Log Horizon_ (lo vedrò quando sarà doppiato in italiano), quindi non posso esprimermi, se non sul fatto che IMHO mi sembra più una ~~paraculata~~ soluzione un po' troppo comoda/da pigri una premessa del genere, **se** poi venisse effettivamente sfruttata.\n\nInsomma, neanche a me è piaciuto tanto SAO (per motivi diversi), però mi sembra un po' pignolo attaccarsi a questi dettagli, comuni perlopiù a tutte le opere di fantasia, per demolirlo. A meno che non si vogliano considerare tutte pessime/sbagliate per il medesimo motivo.\n\n\n\nP.S.\n\nGrazie a chi ha messo -1 solo perché ho provato a intavolare una discussione, per puro divertimento. Se poi volesse anche partecipare... :D","replies":[{"poster":"HaIIeIujah","date":"2017-10-05T18:20:25.847+0000","up_votes":1,"down_votes":0,"body":"> Insomma, neanche a me è piaciuto tanto SAO (per motivi diversi), però mi sembra un po' pignolo attaccarsi a questi dettagli, comuni perlopiù a tutte le opere di fantasia, per demolirlo. A meno che non si vogliano considerare tutte pessime/sbagliate per il medesimo motivo.\n\nQui stai fraintendo, Ciack. Se qualcuno mi avesse chiesto \"quali sono i plot hole del signore degli Anelli\" o \"quali sono i plot hole di Game of Thrones\" avrei fatto lo stesso un post chilometrico, nonostante adori entrambi. Questi non sono i motivi per demolirlo, queste sono le inconsistenze nel suo setting.\n\nI motivi per demolirlo sono molto, molto più gravi, sia in quanto personaggi che in quanto a trama.\n\n> Non ho ancora visto Log Horizon (lo vedrò quando sarà doppiato in italiano), quindi non posso esprimermi, se non sul fatto che IMHO mi sembra più una paraculata soluzione un po' troppo comoda/da pigri una premessa del genere, se poi venisse effettivamente sfruttata.\n\nAccetto tutto, ma non fare assunzioni su roba che non hai visto. Può essere la tua impressione o meno, ma è inauditamente sbagliata.\n\n>  È un deus ex machina? Probabilmente sì. Il deus ex machina è un espediente sbagliato? No, è di uso comune. \n\nPer _definizione_ lo è. Il fatto che sia di uso comune non vuol dire che sia giustificato. Scrivere pessimi personaggi femminili è di uso comune negli anime, ciò non rende il trattamento di (esempio a caso) Sakura in Naruto meno pessimo.\n\n> Non sono d'accordo, non è che la storia la scrivi all'ultimo minuto; anche se non sembra c'è tanto lavoro dietro e tutto viene ben pianificato, per portare sullo schermo esattamente quello che l'autore (o meglio la produzione) vuole.\n\nDiciamo soltanto che qui si vede che non conosci il modo in cui funziona la produzione di Light Novels in Giappone, ed ancora più chiaramente che tu non abbia letto quelle di SAO o anche solo visto l'anime di recente. _Ben pianificato_ non è un aggettivo che può essere applicato a nessuno dei due.\n\n> Il fatto che un personaggio non espliciti le sue motivazioni non vuol dire che queste non esistano o sono assurde. Se qualcosa non viene raccontato non vuol dire che debba essere giustificato, nessuna storia ti racconta tutto, c'è sempre qualcosa che viene lasciato alla tua immaginazione ed è deducibile da elementi della storia, questo perché non è mai possibile raccontare tutto, quindi si fanno delle scelte su cosa inserire, cosa tralasciare, e cosa lasciarti immaginare. È normale.\n\nDedurre e speculare sono due cose diverse. \n\n> Tu stesso hai scritto che in quell'occasione ha 10-20 livelli più del richiesto (io mi son fidato perché non ricordo). In questo caso non mi sembra un'impresa impossibile, come ho detto.\n\nIn relazione al mio punto precedente: se è veramente 20 o anche solo 10 livelli sopra gli altri come solo player, il fatto che la maggior parte degli avventurieri di frontiera siano riuniti in gilde è idiotico. Specie considerando che Heathcliff stesso aveva ideato il contenuto per essere affrontato da gilde, dato che voleva \"clearlarlo\" con loro.\n\nQuesto è un'altro esempio di cattiva pianificazione. Se avesse voluto seguire questo plot dall'inizio, tutto ciò che l'autore avrebbe dovuto fare sarebbe stato introdurre l'idea che l'abilità personale conta molto più di numeri et similia, e montare dall'inizio l'idea che per quanto Kirito sia da solo non sono le sue statistiche a contare, ma il fatto che sia ridicolmente bravo ad usare il suo personaggio. Cosa che non è valida in quanto Kirito stesso ammette che \"I numeri ti rendono invincibile\" in una scena nell'anime.\n\n> No se può decidere (e si suppone possa, vista l'ampia libertà fisica che il gioco offre) l'intensità con cui colpire e/o usare una determinata skill. Il gear, armi a parte, non sono sicuro che abbia effettivamente un riscontro visivo, non sempre almeno, e comunque si suppone sia possibile nasconderne le statistiche una volta equipaggiato.\n\nSi, il gear equipaggiato ha sempre un riscontro visivo. Vediamo Kirito equipaggiare il mantello nell'episodio 1, potenziare le spade ed usare sempre la stessa e di alto livello.\n\nTutto il resto della risposta non è altro che un tuo tentativo di coprire buchi di trama, ma di questo parlerò alla fine del commento.\n\n> Tutto dipende dalla storia che vuoi raccontare, evidentemente nella storia che l'autore ha voluto raccontare, non si voleva dare questa connotazione oggettivamente negativa a quei personaggi. Non lo ritengo per questo meno credibile.\n\nQuesto è anche noto come _fallire miseramente nello Show Not Tell_ 101.\n\n> Non credo che il poter nascondere alcune statistiche (diciamo pure la maggior parte, se vuoi) sia un'incongruenza o un errore. È semplicemente una scelta di design (non direi world building visto che si tratta di qualcosa relativo al giocatore e non a quest/ambienti/NPC). Inoltre anche questo è funzionale alla trama.\n\nIl worldbuilding è la creazione di un mondo in cui è ambientata una storia.\n\nSAO è ambientato nel mondo del videogioco SAO. Pertanto, le regole di SAO sono le regole del mondo, e le regole del mondo sono worldbuilding. Stiamo parlando della storia, non dell'ipotetico videogioco.\n\n> Perdonami ma non sono d'accordo, io non ho riscontro di questa auto-elevazione di SAO a storia possibile IRL, e ora capisco che forse è questo il punto da cui nascono queste tue critiche. \n\nIl fatto che tu non lo abbia riscontrato è più un tuo problema che un mio. \n\n\nQuesta è la mia ultima risposta in questo thread, non perché io abbia finite le cose negative da dire sull'Anime, ma perché ancora una volta le tue risposte ai miei commenti sono semplicemente difese a spada tratta ( o meglio, prese di posizione opposte alle mie) che francamente mi sembrano una perdita di tempo, specie nel momento in cui hai tentato ripetutamente di coprire la mancanza di informazioni presentate o deducibili con le tue speculazioni con la pretesa che sia \"perfettamente normale\". Se hai intenzione di ri-discutere dei dettagli, o del perché la penso così, sei libero di farlo sul client dove ti ho già inviato la richiesta....dopo che tu abbia rivisto l'Anime almeno una volta, dato che da quel che sembra hai ricordi abbastanza confusi dell'intera serie.\n\nBye.","replies":[{"poster":"Floppyz","date":"2017-10-05T18:53:21.703+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ł Tera ł,realm=EUW,application-id=Un6AGJq2,discussion-id=l2dv5Tv1,comment-id=00020000,timestamp=2017-10-05T18:20:25.847+0000)\n>\n> Qui stai fraintendo, Ciack. Se qualcuno mi avesse chiesto &quot;quali sono i plot hole del signore degli Anelli&quot; o &quot;quali sono i plot hole di Game of Thrones&quot; avrei fatto lo stesso un post chilometrico, nonostante adori entrambi. Questi non sono i motivi per demolirlo, queste sono le inconsistenze nel suo setting.\n\n> I motivi per demolirlo sono molto, molto più gravi, sia in quanto personaggi che in quanto a trama.\n\nMi pare che il tuo post iniziale andasse un po' oltre i _plot hole_...\n\n> Accetto tutto, ma non fare assunzioni su roba che non hai visto. Può essere la tua impressione o meno, ma è inauditamente sbagliata.\n\nNon ho fatto assunzioni, ho preso una cosa che hai detto tu (quindi non un assunzione) e ho detto che **se** usata in un certo modo, sarebbe un pessimo espediente. Ho aggiunto IMHO (In My Humble Opinion - secondo la mia modesta opinione) e la parola _se_ in grassetto appositamente. Non l'ho fatto per caso, ma proprio perché il mio era un discorso ipotetico, proprio perché non potrei certo esprimermi su una cosa che non ho visto. Non vedo quindi perché una risposta così aggressiva, che fraintende quel che ho detto...\n\n> Per _definizione_ lo è. Il fatto che sia di uso comune non vuol dire che sia giustificato. Scrivere pessimi personaggi femminili è di uso comune negli anime, ciò non rende il trattamento di (esempio a caso) Sakura in Naruto meno pessimo.\n\nNon so che definizione conosci tu, ma quella che conosco io di _deus ex machina_ non comprende il fatto che sia un espediente sbagliato. Allo stesso modo teemo ci sia stato un fraintendimento: non mi passa neanche per la testa dire che se una cosa è comune allora è giusta. Sto solo dicendo che se una cosa è comune, allora per coerenza, se ti fa schifo qui ti deve far schifo da tutte le parti. Mi confermi che per te è così? Ho posto il problema perché in realtà mi sembra strano...\n\n> Diciamo soltanto che qui si vede che non conosci il modo in cui funziona la produzione di Light Novels in Giappone, ed ancora più chiaramente che tu non abbia letto quelle di SAO o anche solo visto l&#x27;anime di recente. _Ben pianificato_ non è un aggettivo che può essere applicato a nessuno dei due.\n\nNon l'ho letto e non l'ho visto di recente (mi sembra di averlo detto più volte), però non capisco come fai ad essere così certo che non sia ben pianificato, se non per tue supposizioni derivanti da presunti buchi che hai rilevato. Poi oh, certo, se l'autore stesso o chi ci ha lavorato l'ha detto chiaro e tondo, non insisto oltre, anche se mi sembra un po' anomalo; diversamente, è una tua speculazione, che in quanto tale è contestabile.\n\n> Dedurre e speculare sono due cose diverse. \n\nUhm... sì, però per speculare parti da un ragionamento deduttivo, altrimenti non stai speculando ma tirando a indovinare, che è una cosa diversa ancora :D\n\n> In relazione al mio punto precedente: se è veramente 20 o anche solo 10 livelli sopra gli altri come solo player, il fatto che la maggior parte degli avventurieri di frontiera siano riuniti in gilde è idiotico. Specie considerando che Heathcliff stesso aveva ideato il contenuto per essere affrontato da gilde, dato che voleva &quot;clearlarlo&quot; con loro.\n\nNo, non è _idiotico_ (sic), perché evidentemente da soli è più pericoloso, e, visto cosa è in gioco, pochi se la sentirebbero di correre un rischio simile. A me sembra invece verosimile. Insomma, io capisco anche il tuo ragionamento, ma non puoi pensare che tutti i personaggi di una storia adottino i tuoi stessi criteri e i tuoi stessi ragionamenti, e se non lo fanno, non vuol dire che sono idioti, come ho appena dimostrato.\n\n> Questo è un&#x27;altro esempio di cattiva pianificazione. Se avesse voluto seguire questo plot dall&#x27;inizio, tutto ciò che l&#x27;autore avrebbe dovuto fare sarebbe stato introdurre l&#x27;idea che l&#x27;abilità personale conta molto più di numeri et similia, e montare dall&#x27;inizio l&#x27;idea che per quanto Kirito sia da solo non sono le sue statistiche a contare, ma il fatto che sia ridicolmente bravo ad usare il suo personaggio. Cosa che non è valida in quanto Kirito stesso ammette che &quot;I numeri ti rendono invincibile&quot; in una scena nell&#x27;anime.\n\nChe plot? Da quello che è il risultato direi che l'autore voleva queste gilde per fare da background e apparecchiarci qualche episodio e trama secondaria, facendo nel contempo spiccare l'abilità di singoli, proprio tirandoli fuori da questo schema e facendoli brillare per conto loro. Non ti piace? Va bene, però un senso ce l'ha.\n\n> Si, il gear equipaggiato ha sempre un riscontro visivo. Vediamo Kirito equipaggiare il mantello nell&#x27;episodio 1, potenziare le spade ed usare sempre la stessa e di alto livello.\n\nHo scritto chiaramente _armi a parte_, va bene, anche mantello a parte. Vuoi però dirmi che quindi tutti i giocatori che vediamo indossare sempre lo stesso equip, **armi a parte**, non abbiano mai cambiato un pezzo? Mi sembra improbabile, forse è stato semplicemente più comodo non disegnarlo/progettarlo, e questo se vuoi è un punto a sfavore.\n\n> Tutto il resto della risposta non è altro che un tuo tentativo di coprire buchi di trama, ma di questo parlerò alla fine del commento.\n\nNon è vero, a me sembra invece che sia tu a prenderla troppo a cuore, cercando difetti anche dove non ci sono (e questo anime ne ha parecchi IMHO).\n\n> Questo è anche noto come _fallire miseramente nello Show Not Tell_ 101.\n\nPerché mai? Perché non han scritto questa parte come volevi te? O.o\n\n> Il worldbuilding è la creazione di un mondo in cui è ambientata una storia.\n\n\n> SAO è ambientato nel mondo del videogioco SAO. Pertanto, le regole di SAO sono le regole del mondo, e le regole del mondo sono worldbuilding. Stiamo parlando della storia, non dell&#x27;ipotetico videogioco.\n\nCosì mi confondi... provo a semplificare: con worldbuilding ti riferisci al mondo dell'anime o al mondo virtuale nell'anime?\n\n> Il fatto che tu non lo abbia riscontrato è più un tuo problema che un mio. \n\nPremesso che io non lo vedo come un problema per nessuno dei due, vorresti dirmi da cosa ti è stata trasmessa tale certezza? Non mi sembra sia mai esplicitato durante l'anime, ma visto che tu ricordi meglio, puoi indicarmelo?\n\n> \n> Questa è la mia ultima risposta in questo thread, non perché io abbia finite le cose negative da dire sull&#x27;Anime, ma perché ancora una volta le tue risposte ai miei commenti sono semplicemente difese a spada tratta ( o meglio, prese di posizione opposte alle mie) che francamente mi sembrano una perdita di tempo, specie nel momento in cui hai tentato ripetutamente di coprire la mancanza di informazioni presentate o deducibili con le tue speculazioni con la pretesa che sia &quot;perfettamente normale&quot;.\n\nNon ti offendere, ma secondo me la prendi troppo sul personale, mentre io volevo solo fare una chiacchierata su un anime, che non ho motivo di difendere a spada tratta o darti contro a prescindere (a che pro?)\n\nUna discussione comunque funziona così: ognuno spiega il proprio punto di vista, e mi spiace che tu lo trovi una perdita di tempo (anche se ammetto che sono un po' prolisso nel rispondere, ma non lo faccio per esser molesto).\n\nNon mi sembra di aver coperto niente con speculazioni, ti ho solo fatto notare che, fra l'altro, hai indicato dei problemi che non esistono, o che rientrano nella _normale economia dello storytelling_, perlopiù ignorando selettivamente il principio che ho esposto inizialmente.\n\n\n> Se hai intenzione di ri-discutere dei dettagli, o del perché la penso così, sei libero di farlo sul client dove ti ho già inviato la richiesta....dopo che tu abbia rivisto l&#x27;Anime almeno una volta, dato che da quel che sembra hai ricordi abbastanza confusi dell&#x27;intera serie.\n> \n> Bye.\n\nBoh, a me faceva piacere far due chiacchiere qui, con comodo, quando ho il tempo di farlo e magari di controllare (per quel che è possibile) di non scrivere boiate, proprio perché non ricordo perfettamente. Purtroppo non ho tempo di riguardarlo solo per farci due chiacchiere, ora però sto guardando _Twin Peaks_, quindi se vuoi di quello ho un ricordo più fresco :D\n\nComunque a parte tutto, spero non te la sia presa, e nel caso rilassati, perché io non ho niente contro di te, solo che come diceva il Signor G\n\n_Sarà che gli italiani\nper lunga tradizione\nson troppo appassionati\ndi ogni discussione._\n\n:)","replies":[]}]}]}]}