{"poster":"JusticePauldrons","date":"2015-07-31T14:11:22.567+0000","title":"Garen kit changes confirmed to be on the schedule. Speak up fellow Demacians!","subforum":"Gameplay","embed":{"description":"This morning's red post collection includes a heads up that Darius, Garen, Mordekaiser, and Skarner have all been added to the champion update schedule, Riot Rayven on several HUD changes coming in patch 5.15, a reminder that Gangplank is still dead, and more! Continue reading for more information!","url":"http://www.surrenderat20.net/2015/07/red-post-collection-darius-garen.html","image":"http://3.bp.blogspot.com/-M_ecJWWc5CE/Uizpk6U3lwI/AAAAAAAACLo/xyh6eQNRzzs/s640/sitethumb.jpg"},"up_votes":9,"down_votes":2,"body":"Welp it is official. {{champion:86}} is on the list of champions to be worked on with a gameplay update following Fioras. So far all we that can be confirmed is that \n\n* They will not be removing his silence\n\n>That&#039;s pretty accurate as to our thinking on silences (can be a good fit on champs where there are things you can do to avoid the silence, generally not appropriate on characters who have the tools to silence you with really high reliability). Garen&#039;s keeping his silence as a result, for while it&#039;s click to hit it&#039;s also a melee ability and he doesn&#039;t have a dash/jump/blink.\n\n* His changes will be reflecting itemization changes. \n\n* They plan on giving/changing something with Garen&#039;s Kit that doesn&#039;t overlap with other champions roles (such as being able to ult objective monsters) \n\n> Very with you on the value of distinct benefits for bringing a particular champion to a team. We&#039;ve got something else in mind for Garen though that doesn&#039;t overlap with other objective controllers (ult on monsters would give a very Cho/Nunu sort of feel).\"\n\nSo how is everone feeling so far? Without numbers or hinting at what the changes will be I am riding the edge of excitement and fear right now folks. Could he possibly be getting the changes he needs to actually perform well outside of blind pick? Or will his changes be negligible at best or remove all of his power at worst? \n\nFrom what I can see so far I can tell you that the decision to keep his silence and the reasoning behind it speaks volumes on it&#039;s own. With this in mind we can tell they will _not_ be giving him any increased level of mobility/gap closers (like the ever popular suggestion to \"add a leap to the end of his Q\"). To be honest I suppose this is a good thing, while I can say one of Garens main problems is his ability to get into a fight, his silence is more or less essential in his role in a teamfight and is his only form of crowd control.\n\nI am also glad to see they will not be making Garens ult usable on objectives such as Baron and Dragon, while I agree that his ult definitely needs **_SOMETHING_** to be worthy of the ultimate status/cooldown I always felt like ulting monsters was a cheap bandaid to the problem that would increase his viability only in certain clutch moments but add nothing else. \n\nAs for the part about his changes reflecting itemization changes, this part concerns me. Garen has always been extremely reliant on his early game items in order to function. With this in mind his is stuck with costly fighter options in order to have any semblance of power outside of his silence. While I don&#039;t have problems with them wanting to make sure he stays balanced with current itemization it also raises concerns over what could happen in the future if those items are changed. It seems like a temporary solution to a long term issue. \n\n**What do you want to see?**\n\nThe big thing I feel we should get out there while these changes are on the table is what as players want to see added/changed from his kit. What do you feel is necessary to make Garen function, what are his main weaknesses and what issues about his kit should be addressed?\n\nFor me the biggest issue of all his the problem with his ultimate: Judgement. Now don&#039;t get me wrong here folks, I love the ability. What I don&#039;t love is how little impact it has for an ultimate ability on a large cooldown.  _Every_ other execute ultimate in the game has serious advantages in comparison to judgement and because of this I don&#039;t see where Garens fits in. \n\n{{champion:122}} Most similar in function and cooldown. Deals True damage, has an AD Scaling, repeated dunking, longer range.\n{{champion:222}} Literally a **5%** difference in missing health scaling, but has a global range, is an aoe, has a lower cooldown (by a lot), has an AD Ratio.\n{{champion:92}} Longer Range, AOE Cone,  AD Ratio, AD boost to aid in autos and the rest of her abilities.\n\nNow I am not going to pretend these champions have_ nothing but _ advantages over Garen here. But in terms of their ultimates they all used as an execute to finish off low health targets. While Garens missing health scaling is higher (in a whopping 5% in jinxes case but with higher base damage) it doesn&#039;t justify the lack of versatility in its use. \n\n**Suggestions**\n\n* Make the ability have an aoe knockback or slow effect. Simple, it already has the animation for it, change the functionality to something similar to a {{champion:5}} ultimate (would also be cool to have a similar theme to their ultimates), enemies are knocked away from the ulted target. This would allow it to have both increased functionality, the ability to err, and provide more options for it. Do you waste your ult on a high health target in perfect position for knocking the enemy team backwards towards your own or save it for a low health target for maximum effect? (Hell, maybe both if the positioning is right) Does your ultimate knock an untargeted enemy to safety over a small wall by mistake? All of these options are opened from this small change. \n\n* Make the ability have aoe damage at a reduced percent. Same concept as the above minus the crowd control but with aoe damage instead. Simple buff overall but doesn&#039;t really fix the problems with his kit (namely lack of crowd control).\n\n* Give the ability an AD ratio or increase the percentage. Please,**_ at the very least _**do this if nothing else, it is sad to see what is supposed to be such a powerful finisher tossed behind others simply because it lacks this simple scaling mechanic. It would allow offensive builds to function better when finishing off a single target without harming anything else in his kit.","replies":[{"poster":"Hasztalan2","date":"2015-07-31T14:57:58.508+0000","up_votes":5,"down_votes":7,"body":"Chill your tits added to rework schedule means it'Ll be likely 1-1.5-2 years till it sees a daylight.","replies":[{"poster":"TheVishual","date":"2015-07-31T17:06:25.672+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Hasztalan2,realm=EUW,application-id=3ErqAdtq,discussion-id=bliYRgR8,comment-id=0000,timestamp=2015-07-31T14:57:58.508+0000)\n>\n> Chill your tits added to rework schedule means it'Ll be likely 1-1.5-2 years till it sees a daylight.\n\nPeople downvoted him but he's right though... but as far as the time frame I'd probably say it'll be at least 6 months before we maybe see a change on him\n\nHe's not that horrible currently but could use a buff since he has no gap closer and gets kited fairly easily","replies":[{"poster":"Meddler","date":"2015-08-01T00:12:23.492+0000","up_votes":10,"down_votes":3,"body":"It's very likely you'll see Garen hit PBE within the next couple of patches.","replies":[{"poster":"TheVishual","date":"2015-08-01T00:36:56.567+0000","up_votes":3,"down_votes":7,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=bliYRgR8,comment-id=000000010000,timestamp=2015-08-01T00:12:23.492+0000)\n>\n> It's very likely you'll see Garen hit PBE within the next couple of patches.\n\nhttp://i.imgur.com/ffd6P4N.jpg\n\"During pre-season many competitive features will be added to the PVP.net multiplayer platform including: Replays\"\n_October 27, 2009_\n\nhttps://www.reddit.com/r/leagueoflegends/comments/38pgvi/nick_allen_announces_the_replay_system/\nNick Allen announcing the new replay system _Feb 15, 2013_\n\nhttps://www.youtube.com/watch?v=2G0e-G_AOQw&feature=youtu.be&t=60\n\nWhat day is it today Meddler\n\nI won't hold my breath on Riot announcements about time frames for game content :)","replies":[{"poster":"Meddler","date":"2015-08-01T01:36:09.603+0000","up_votes":9,"down_votes":1,"body":"We've been wrong, occasionally massively so, about some of the timeframes we've talked about in the past. I get that that's frustrating, the only way we can be sure we'll avoid that in future is by never talking about timeframes until something's finished though. Alternatively we can provide estimates sometimes and, if stuff changes and we're proved wrong, try and provide an update. In Garen's case I'm sufficiently confident we'll see him on PBE within a patch or two I figured it was worth sharing that with people who'd be interested. Should that change, we'll offer context on what's changed and why.","replies":[{"poster":"Archenz","date":"2015-08-01T02:51:37.505+0000","up_votes":5,"down_votes":2,"body":"Sorry about having to deal with people like him. We like your transparency meddler on these things, please continue as you are :)","replies":[]},{"poster":"JusticePauldrons","date":"2015-08-01T06:55:08.294+0000","up_votes":1,"down_votes":0,"body":"Thanks for the update. It is always good to hear from rioters on the forums especially when it comes to things like champion updates and time frames. Always cool to see you guys actually reading suggestion/change threads like this :D \n\nPsst. Hey, while these other guys are distracted gimme a hint on the update, you know you wanna :P","replies":[]}]},{"poster":"Slamurai Jack","date":"2015-08-01T01:30:19.198+0000","up_votes":1,"down_votes":0,"body":"We've already been given an answer for why there isn't one. Enough already.","replies":[]}]},{"poster":"Hasztalan2","date":"2015-08-01T07:58:25.739+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=bliYRgR8,comment-id=000000010000,timestamp=2015-08-01T00:12:23.492+0000)\n>\n> It's very likely you'll see Garen hit PBE within the next couple of patches.\n\nI'd be happier if you guys would take your time for some quality work instead of ruining another champ like your previous reworks. We won't be be ahead if u \n\na) do a skarner like rework wich doesn't solve any of his problems just creates new ones \n\n - OR -\n\nb) Mf like rework where you add something nice and take back 3 times as much from the kit in return resulting in an even lower quality gameplay than before.","replies":[]}]},{"poster":"Rinky Dinky","date":"2015-08-03T03:47:38.297+0000","up_votes":1,"down_votes":0,"body":"It's literally hitting the pbe next week but okay","replies":[]}]},{"poster":"JusticePauldrons","date":"2015-07-31T15:10:29.581+0000","up_votes":4,"down_votes":0,"body":"Doesn't mean it isn't worth talking about.","replies":[{"poster":"9001","date":"2015-07-31T15:40:19.107+0000","up_votes":3,"down_votes":1,"body":"Garen is **always** worth talking about","replies":[]}]}]},{"poster":"Colgate Gator","date":"2015-07-31T15:08:09.797+0000","up_votes":5,"down_votes":0,"body":"Bring back the punch animation!","replies":[{"poster":"JusticePauldrons","date":"2015-07-31T15:11:56.574+0000","up_votes":5,"down_votes":0,"body":"I feel like he might become op then, who can take a punch that manly? League champs once were used to it, but all this time without the punch has made them soft.","replies":[]}]},{"poster":"DragoonRuin","date":"2015-07-31T23:03:41.120+0000","up_votes":2,"down_votes":3,"body":"I hate to be the \"negative nancy\" in the bunch, but its not going to make a difference with what Riot does to Garen.  Just look at the recent MF mini-tweak/update.  MF players got exactly ZERO things they've been asking for literally for years.  (Strut to get the Garen treatment at lvl 9/11, and/or Q logic cleaned up to prioritize champs).  What Riot did with MF, wasn't on ANYONE's radar for MF requests.  So don't fool yourselves thinking that your inputs on these boards, or Reddit, are going to make one lick of difference in what they do/change with Garen.\n\nAgain, I am not trying to be disrecpectful to anyone, I still love and play the game, but they are going to do what they want to with the champions, regardless of what the majority of its player base says.","replies":[{"poster":"Doctor Dyment","date":"2015-07-31T23:59:51.060+0000","up_votes":2,"down_votes":0,"body":"Yep. The boards have no impact on Riot's decisions at all. Just look at the most recent Fiora splash art. Riot didn't change anying based on community askings.","replies":[{"poster":"AbsoluteSadman","date":"2015-08-01T02:25:45.176+0000","up_votes":2,"down_votes":1,"body":"+1 for sarcasm.","replies":[]},{"poster":"JusticePauldrons","date":"2015-08-01T06:51:04.480+0000","up_votes":1,"down_votes":1,"body":"You are a hero.","replies":[]}]}]},{"poster":"MrBuffington","date":"2015-07-31T17:14:54.661+0000","up_votes":3,"down_votes":1,"body":"There's so much on Garen's kit that's iconic, I don't think there's any way they're changing his E, and they already confirmed his Q and ult are pretty similar. His W could probably afford to be more interesting (it's not a bad ability, it's just kind of boring). If most of the changes are meant to be in line with the new fighter item updates, I don't see it being too bad; they updated BC for fighters and it works beautifully on Garen.\n\nGaren's supposed to be this tanky champion that leads the charge, shrugging off poke and stuff, so it'd be cool if he had something to support that, kind of Sion-ult feel where he just runs at you deflecting stuff, maybe something like taking reduced damage + tenacity when he's running at you?","replies":[{"poster":"AbsoluteSadman","date":"2015-08-01T02:26:56.305+0000","up_votes":1,"down_votes":0,"body":"Imagine if he has a sion type ult right, but any projectiles that hit him bounce back off and back towards the enemy.\n\nSounds really fun but i highly doubt ittl happen.","replies":[{"poster":"MrBuffington","date":"2015-08-01T02:29:34.063+0000","up_votes":1,"down_votes":0,"body":"Haha yea I was thinking of that too; they already have somewhat similar tech in Braum shield and Yasuo windwall","replies":[]}]},{"poster":"Kingsgrave","date":"2015-07-31T20:12:58.088+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=MrBuffington,realm=NA,application-id=3ErqAdtq,discussion-id=bliYRgR8,comment-id=0004,timestamp=2015-07-31T17:14:54.661+0000)\n>\n> There's so much on Garen's kit that's iconic, I don't think there's any way they're changing his E, and they already confirmed his Q and ult are pretty similar. His W could probably afford to be more interesting (it's not a bad ability, it's just kind of boring). If most of the changes are meant to be in line with the new fighter item updates, I don't see it being too bad; they updated BC for fighters and it works beautifully on Garen.\n> \n> Garen's supposed to be this tanky champion that leads the charge, shrugging off poke and stuff, so it'd be cool if he had something to support that, kind of Sion-ult feel where he just runs at you deflecting stuff, maybe something like taking reduced damage + tenacity when he's running at you?\n\nThe only iconic things about Garen are Passive, ER. Q and W could easily be replaced.","replies":[{"poster":"MrBuffington","date":"2015-07-31T20:34:58.317+0000","up_votes":1,"down_votes":0,"body":"...which I discussed, or did you not read my comment?","replies":[]},{"poster":"JusticePauldrons","date":"2015-08-01T06:49:23.695+0000","up_votes":1,"down_votes":1,"body":"Q is pretty iconic for the mad crit dunks that silence.","replies":[]}]}]},{"poster":"Ultîma","date":"2015-08-01T05:13:30.603+0000","up_votes":2,"down_votes":1,"body":"Two different ways I could see Garen changing with regards to an ultimate; \n\nAoE melee execute; if Darius is a guillotine, then Garen is a propeller - his signature \"spin to win\" is used for one massive swing that cuts down enemies in an arc for huge damage. The ability no longer deals damage based on missing health, but gains AoE as a result. Would make Garen less frustrating to play against when building defense, and give him some additional team-fight power. \n\nThe commander; The might of Demacia commands his allies forward, giving them a movement-speed boost and armor/resist based on his bonus defenses.  This would give Garen massive team-fight utility, play into his theme as a great general of Demacia. Suddenly his strength wouldn't entirely lie on his ability to kill a single target, but also in how he leads his allies to victory with a group ultimate. A bit of overlap with Sivir here, but given that she's the only champion in the game with a team-steroid, Garen might be good candidate for another.","replies":[]},{"poster":"Schreg da Slayer","date":"2015-08-01T01:17:45.899+0000","up_votes":1,"down_votes":0,"body":"Why try to fix what isn't broken :( #RIPGaren","replies":[]},{"poster":"Shandrake","date":"2015-07-31T21:58:57.904+0000","up_votes":1,"down_votes":0,"body":"I kinda want to see them go with an AoE skill shot Ult.  Imagine it like the Twist of Fate cinematic. \n\nAbout the size of Xeraths W.  Maybe with a slight delay to give it a little more counter play.  Making up for the fact it could possible multi execute.","replies":[]},{"poster":"Slamurai Jack","date":"2015-07-31T21:47:02.177+0000","up_votes":1,"down_votes":0,"body":"I love Garen's ult and I think people vastly underestimate it's value. Just use it as a zoning tool in a teamfight. Enemies will be extremely wary to be anywhere near you when below half health and your ult is still up.","replies":[]},{"poster":"Ser Garland","date":"2015-07-31T15:55:09.571+0000","up_votes":1,"down_votes":1,"body":"\"Performing well outside of blind pick\" nigga, Garen is stupid strong right now. He's received nothing but buffs for a whole year now. He's equipped to deal with Teemo's and other former lane counters as he stands. Has ridiculous health regen that makes Mundo blush.\n\nAnd it sounds like all they're doing to his kit is giving him some -more- jungle viability, that just sounds like tentative buffs to me.\n\nAs he stands, Garen is a walking ball of stats. I wouldn't say he's in the Darius Zone as he's practically unkitable atm with Black Cleaver. Garen's in a good position but buff him any more and he'll turn into old Kassadin","replies":[{"poster":"JusticePauldrons","date":"2015-07-31T16:49:25.087+0000","up_votes":1,"down_votes":0,"body":"I will say that he has definitely gotten some love with the movement speed addition to black cleaver but he is by no means immune to counters. His early game regen is still very tame and really only gets excessive at level 11 where it doubles. Before acquiring a black cleaver he is very susceptible to any form of slow and is **always** vulnerable to ranged harass. As such he is an incredibly easy champion to counter and thus really only excels in blind picks. Smart teams will toss anyone with ranged crowd control top and simply watch him fall flat on his face against someone like {{champion:67}} {{champion:13}}  or {{champion:17}}  (I have no idea where you get the idea that he can destroy Teemo. Almost everything about teemos kit counters Garen -_- maybe if he forgot he to put a point into movequick or was just dumb in general?)\n\nAnyway, like I was going into detail about in my post I don't disagree that Garen is in a decent place,( against other major top laners he can usually do pretty well depending on the matchup) but rather focus on the things that are stopping him from having a real place as an offensive focused bruiser. Keep in mind, that Garen doesn't have any form of hard crowd control, because of this he can't displace, engage or force focus onto himself like other bruisers can (Darius pull, Riven stun etc). So what can we do to change that? Well if giving him crowd control buffs to his main kit would be too powerful (like hard CC on his q instead of the silence) then where can we direct our attention to allow him to have so kind of boon to his main failure? His ultimate. By limiting changes to his ultimate we can ensure that those changes aren't always available at any given time and don't take up a huge amount of his power budget. \n\n* Adding a slight knockback to the area around his ult as I suggested before would help with his crowd control issues but it wouldn't always be available and it could easily go the wrong way or force him to pick and choose his targets. \n\n* Adding an AD scaling to his ultimate would make sure it does the job correctly and feel like it is satisfying and growing in power as the game goes on. For the most part it wouldn't change anything because it is still primarily going to be used as an execute and the scalings don't usually affect the early game, but it would certainly help it scale better into the late game. Take into account that unlike Darius' ult, Garens ult is both affected by resistances and static in the amount of damage it will do to an enemy at certain health levels. You eventually do reach a ceiling where you have to realize \"yup, it doesn't matter what I do or build from here, this is how much damage it will do\" and that is a really crappy feeling when you realize the enemy is only going to be getting more health and resistances and further limiting the damage your ultimate will do.","replies":[{"poster":"MikePeck","date":"2015-07-31T18:16:16.398+0000","up_votes":1,"down_votes":0,"body":"Make his ult get percentage magic pen per every point of crit.  Works in three ways.\n\n1. Now allows his ult to scale as the game progresses.  A current problem with his ult being magic damage is that as enemies buy MR you ult does less and less damage and there is absolutely nothing you can do about it.  This makes a Garen that is putting points in offense by buying crit getting some way to increase his ult's effectiveness as the game progresses.\n\n2. Prevents snowball/cheese.  If Garen's ult just had a ratio, the player could just decide to stuff it with AD and just drop it as more burst rather than using it as a finisher.  It'd become more like Vayne's silver bolts true damage, where the flat scaling just makes it better against squishies (who Garen already explodes) and it wouldn't solve the problem of enemies with MR just shrugging it off.  Crit is both expensive and non-rewarding early game which will help balance against any sort of \"rush crit do true damage\" ult shenanigans.  And a Garen who still tries to do so will be much easier to kill due to the lack of defensive items.\n\n3. It further reinforces crit as being a good stat on Garen.  Garen is fairly unique in the fact that he is a bruiser how likes to buy crit and I think it'd be a shame for it to go away.  Making his ult scale with crit gives Garen further reason to spend the gold to buy what is often a luxury stat.  It'd also make for an interesting off-build of crit-garen who absolutely will murder anything he gets the jump on but will explode just as easily if the tables are turned.","replies":[]},{"poster":"MetalGearTeemu","date":"2015-07-31T17:55:01.339+0000","up_votes":1,"down_votes":0,"body":"might as well add Jayce to that list too. That lanes more unwinnable then any that are up there currently, due to his self speed buff, ability to poke from long distance ( his nid spear ball makes even staying well back under tower to regen unreliable ) and a near instantly activating knockback to easily knock Garen away and out trade him as a result, \n\nA low Ping jayce can leap/auto/knockback before strike finishes animating. the considerable activation time of the melee strike is something people rarely bring up when talking about Garen counterplay","replies":[]}]}]},{"poster":"9001","date":"2015-07-31T15:30:55.281+0000","up_votes":1,"down_votes":0,"body":"I wonder what it would be like to change his ult to being an AoE short range skill shot so it would be able to be whiffed but it could hit multiple targets for execute damage. Or at least they could give it some splash damage around the target that's ulted and leave it as a point-click.","replies":[{"poster":"Ser Garland","date":"2015-07-31T15:55:30.144+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=9001,realm=NA,application-id=3ErqAdtq,discussion-id=bliYRgR8,comment-id=0002,timestamp=2015-07-31T15:30:55.281+0000)\n>\n> I wonder what it would be like to change his ult to being an AoE short range skill shot so it would be able to be whiffed but it could hit multiple targets for execute damage. Or at least they could give it some splash damage around the target that's ulted and leave it as a point-click.\n\nSo Riven?","replies":[{"poster":"9001","date":"2015-07-31T16:03:31.772+0000","up_votes":1,"down_votes":0,"body":"Nah, same size visually as Garen's ult now, but a Circle AoE that maybe gets the execute in the very middle on any targets hit and some splash damage on the outer part of the circle. Either that or give him some AD scaling on the ult","replies":[{"poster":"JusticePauldrons","date":"2015-07-31T16:26:59.811+0000","up_votes":1,"down_votes":0,"body":"Pretty much exactly what I was saying on my second suggestion for it, while it doesn't really help with his problems of crowd control and mobility it is a definite plus for him and would make his ultimate seem more like a ultimate and less like something you could have pulled off with a Q crit.","replies":[]}]}]}]}]}