{"poster":"Firenheit","date":"2017-01-26T12:23:33.891+0000","title":"Perché l'ultima sconfitta mi da fastidio?","subforum":"Discussioni generali","up_votes":3,"down_votes":2,"body":"Dopo una serie di vittorie, ecco che arriva una sconfitta, in ARAM. Perch&eacute; mi fa arrabbiare e non mi sono goduto la partita? \nFrustrazione. \nAnalizzandola, ci sono state diverse cause, bravura nemica, errori personali e alleati, team-comp, ecc., ma tutto il mio odio &egrave; stato indirizzato verso Garen: Ucciso sotto torre con la sua vita immacolata, curandosi in un battito di ciglia, inarrestabile, Silenzio, ecc.\nLa chiudo qui perch&eacute; non &egrave; un post contro Garen. \nE&#039; una discussione contro la frustrazione. \n\nTralasciando i miei lati caratteriali, perdere a LoL &egrave; brutto, perch&eacute; raramente riesco a imparare qualcosa di diverso dal &quot;come vincere quel campione pericolosissimo&quot;, questo perch&eacute; dal momento che qualcuno prende vantaggio, la mera strategia da campagna terrestre lascia il passo alla strategia da boss-fight. \n\n&gt; &quot;crediamo che sia pi&ugrave; giusto aiutare Akali a concatenare un&#039;uccisione dopo l&#039;altra una volta che ha preso il via&quot;\n\nRiot stessa incentiva il &quot;feed&quot; come meccanica di gioco, ma ogni qual volta che questo accade, spesso al mio livello, l&#039;obiettivo primario delle partite, distruggere il Nexus nemico, lascia il posto al &quot;sopravvivere al nemico&quot;, il che ha un&#039;accezione ben diversa dalla prima frase. \nMolti campioni sono divertentissimi da giocare e quasi tutti funzionano da questo lato, ma cosa succede se analizziamo un campione quando ci &egrave; contro? \nE&#039; questo che mi fa saltare i nervi, il perdere per cose che prescindono dalla bravura, dalle mere statistiche. O meglio... Se il mio avversario in lane ha 2 livelli sopra di me, quasi sicuramente &egrave; stata la bravura a portarlo ad avere questo vantaggio, ma nell&#039;attimo della battaglia vince chi ha le statistiche pi&ugrave; alte. Vedere uccidere con una Q anzich&eacute; con una combo, o sopravvivere  sotto la torre nemica, &egrave; frustrante, non divertente.\nIl mondo del competitivo e la mia esperienza personale mi conferma il divertimento di giocare una partita equilibrata e poter pensare &quot;il mio avversario mi ha vinto perch&eacute; ha usato una combo migliore&quot;, e poterlo dimostrare in modo evidente, &egrave; bello. \nSolo un&#039;analisi.\n\nVoi cosa ne pensate?","replies":[{"poster":"ChaosJuda","date":"2017-01-26T14:39:23.276+0000","up_votes":3,"down_votes":0,"body":"Un conto è dare fastidio, un altro essere eccessivamente opprimente superando in danni anche l'adc che dovresti supportare con la tua utility, non con i danni.","replies":[]},{"poster":"Dr LouD","date":"2017-01-26T12:52:57.945+0000","up_votes":4,"down_votes":2,"body":"Qualsiasi tipo di feed va a farsi benedire quando subentra un buon teamplay\n\nCosa se ne fa un assassino di 20 kill se poi quando va ad ingaggiare il carry nel fight si trova davanti ad un ottimo peeling che annulla totalmente i suoi danni?\n\nLa cosa principale per vincere non è il feddarsi, ma essere meccanicamente superiori all'avversario. Non bisogna fare per forza 10 kill in 5 minuti per essere meccanicamente superiori, basta saper giocare bene il proprio ruolo nei fight, avere una buona visione di gioco e saper fare le call giuste\n\nSaper outplayare > sapersi feeddare","replies":[{"poster":"Firenheit","date":"2017-01-26T13:57:55.117+0000","up_votes":1,"down_votes":0,"body":"Non sto analizzando il cosa fare, ma il cosa accade. Se X arriva sotto torre e non perde neanche 1/4 di vita in un fight, c'è il modo di giocarci contro, ma rimane fastidioso. Un esempio è Shaco, un campione mai in meta da ere, ma comunque molto fastidioso. Come la Q del vecchio Zilean e moltissimo altro. \nNon si parla di bilanciamento, ma di gameplay. \nEd è una cosa che la Riot stessa ammette, difatti quest'anno sono stati annunciati mensili mini-rework alla Shyvana, cosa ottima e giusta, ma, IMO, non riescono a c'entrare l'obiettivo della non-frustrazione.","replies":[{"poster":"Dr LouD","date":"2017-01-26T14:04:59.872+0000","up_votes":2,"down_votes":1,"body":"Ma è impossibile da sistemare questa cosa.\nSe solo ci provi crei un gioco piatto, antifun, in cui non puoi fare nulla.\n\nImho le cose che VERAMENTE sono stressanti e senza counterplay vengono sempre aggiustate e/o modificate nel breve/medio periodo.\n\nUn tank può e deve poter tankare colpi di torre in un fight, è parte del suo ruolo, ovvero tankare.","replies":[{"poster":"ChaosJuda","date":"2017-01-26T14:28:13.669+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=26WafUPY,comment-id=000100010000,timestamp=2017-01-26T14:04:59.872+0000)\n>\n> Ma è impossibile da sistemare questa cosa.\n> Se solo ci provi crei un gioco piatto, antifun, in cui non puoi fare nulla.\n> \n> Imho le cose che VERAMENTE sono stressanti e senza counterplay vengono sempre aggiustate e/o modificate nel breve/medio periodo.\n> \n> Un tank può e deve poter tankare colpi di torre in un fight, è parte del suo ruolo, ovvero tankare.\n\nCome dici tu, le cose stressanti e senza counterplay vengono sempre aggiustate nel breve periodo allora perché {{champion:143}}  sta ancora li indisturbata a fare il bello e il cattivo tempo in bot?","replies":[{"poster":"Dr LouD","date":"2017-01-26T14:31:30.206+0000","up_votes":3,"down_votes":0,"body":"Zyra non ha counterplay? LOL\n\nZyra è un champ da poke, è NORMALE che da fastidio, se le togli il poke cosa le rimane? nulla","replies":[]}]},{"poster":"Firenheit","date":"2017-01-26T14:13:13.635+0000","up_votes":1,"down_votes":0,"body":"Parlando prettamente di tank, dovrebbero essere bilanciati molto più sul gioco di squadra, esattamente come il nuovo Coraggio del Colosso suggerisce. \nUn tank deve poter tenere i colpi di torre, ma nel frattempo non deve poter uccidere senza avere il proprio team dietro.\nE ribadisco, c'è il counterplay per questo, ma non vuol dire che questo sia \"sano\".","replies":[{"poster":"Dr LouD","date":"2017-01-26T14:22:28.026+0000","up_votes":3,"down_votes":2,"body":"I tank hanno generalmente stat offensive base alte con basso scaling > i carry hanno generalmente statistiche offensive discrete con alti scaling\n\nQuesto vuol dire che un tank in early è molto più forte di un carry e può ucciderlo tranquillamente anche divando per poco tempo, mentre i ruoli si invertono in late game.\n\nTank =/= personaggio difensivo che non fa danni a prescindere, mettetevelo in testa, un tank può tranquillamente giocare aggro in determinati punti del game e fare danni.","replies":[{"poster":"Firenheit","date":"2017-01-26T14:46:48.394+0000","up_votes":2,"down_votes":1,"body":"Anche per come hai risposto a @ChaosJuda, \"Zyra non ha counterplay? LOL Zyra è un champ da poke, è NORMALE che da fastidio\"\nNessuno ha detto che non ci sia il counterplay, ma si parla, appunto, del fastidio. \n\nIn un gioco dove bisogna fare scelte tattiche anche nella formazione di una squadra, i personaggi devono avere classi ben definite. I tank devono essere tank e \"Questo vuol dire che un tank in early è molto più forte di un carry e può ucciderlo tranquillamente\" è vero ma sbagliato. \nCosì come sarebbe sbagliato non riuscire a uccidere un carry, cosa che può succedere in caso di feed. \nA tutto ciò c'è, o cerca di esserci, il counterplay, ma fuorviano dalla via del \"divertimento\". \n\nHai detto che togliere il feed creerebbe un gioco poco divertente e piatto. \nSbagliato, lo renderesti scacchistico e non per questo non divertente. Rendere un gioco,  o uno sport, con delle meccaniche di squadra accessibili a tutti non ne ucciderebbe il gioco. Non è un segreto che nella SoloQ viga il detto del \"devi vincere da solo\". \nUn qualcosa che permette una tale meccanica è fallata, se punta al divertimento, perché se tu ti diverti a non farti toccare usando Fizz, io che lo subisco non mi diverto molto. \n\nIn ultimo...\n> Tank =/= personaggio difensivo che non fa danni a prescindere\n\nLeggendo dal dizionario di LoL:\n>Tank  un Tank è un personaggio estremamente durevole, ma generalmente dotato di poco danno, che è in grado di attirare su di sé gli attacchi nemici tramite abilità di Crowd Control o Iniziazione. vedi Amumu, Alistar, Rammus.\n\ne senza triggersi sul generalmente, quanti tank possiamo trovare in LoL che si basano sui danni e la resistenza e non sull' utility? \nForse Illaoi ne sa qualcosa...\nDescrivimi il gameplay di Garen.","replies":[{"poster":"Dr LouD","date":"2017-01-26T17:12:47.049+0000","up_votes":2,"down_votes":1,"body":"Illaoi e Garen sono Juggernaut, sono combattenti, non sono tank\n\nPS: il fastidio è relativo. Ci sono champ che usano il 'fastidio' come arma per la vittoria. Vedi Singed, Teemo, Zyra, ecc.\n\nPSS: Togliere il feed, ovvero uno dei (tanti)  fattori con cui un giocatore bravo può dimostrare di saper fare la differenza da solo, un minimo lo toglie il divertimento, fidati.","replies":[{"poster":"Firenheit","date":"2017-01-26T17:38:14.906+0000","up_votes":2,"down_votes":1,"body":"Mi chiedo quanto possa essere resistente un tank se Garen non lo è...\nRimuovere il feed toglie il divertimento al giocatore feeddato, mediamente 1/10 dei componenti di una partita, semplicemente non c'è bisogno di distaccare le proprie statistiche da quelle nemiche a dismisura per essere giocatori migliori, perché se riesci a sopraffare l'avversario al minuto 3, puoi farlo anche al minuto 30.\n\nTuttavia, rimuovere completamente il fattore \"feed\" cambierebbe totalmente LoL e per quanto a me piacerebbe, richiederebbe una quasi ricostruzione totale. Quindi, IMO, la soluzione non è rimuoverlo, ma frenarlo. In S6 si sono fatti cambiamenti per incentivare l'effetto valanga, lo si legge chiaramente e letteralmente nei blog e nelle patch, è stata una scelta ben precisa e mirata. \nDa cosa nasce questo bisogno, quindi, di favorire l'effetto valanga? \nFrancamente? Io ultimamente sto vedendo passi indietro. Quest'anno siamo tornati alla vecchia giungla pre-smite, quella della S4 (mi sembra), aggiungendo le piante, si parla dei mini-rework tra cui Aurelion Sol, Kalista e Rek'Sai, nonostante siano campioni relativamente nuovi, Kog con un rework cancellato e un Ryze che lo ha preceduto. Hanno rimosso da qualche tempo le solite \"cose\" degli eventi e vista la larga scontentezza dell'utenza hanno deciso che gli sconti personalizzati torneranno indietro così come rivedranno tutte queste casse hextech speciali. Insomma, un passo avanti e dieci a tornare.\nCredo, quindi, che rivedremo un ritorno della lotta contro l'effetto valanga nelle prossime stagioni.","replies":[{"poster":"Dr LouD","date":"2017-01-26T17:46:55.468+0000","up_votes":2,"down_votes":1,"body":"Guarda, tra l'effetto valanga e il far durare ogni partita 50 minuti francamente preferisco il primo.","replies":[{"poster":"Firenheit","date":"2017-01-26T17:52:58.881+0000","up_votes":2,"down_votes":1,"body":"Non serve far durare una partita 50 minuti, basterebbe diminuire il tempo di crescita!","replies":[{"poster":"Dr LouD","date":"2017-01-26T19:27:02.141+0000","up_votes":2,"down_votes":1,"body":"A questo punto vado a guardarmi un'opera al teatro. Almeno ho un buon sottofondo mentre mi addormento","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"JRobich","date":"2017-01-26T12:56:47.755+0000","up_votes":1,"down_votes":0,"body":"ILoud FOR PRESIDENT!","replies":[]},{"poster":"Piombo Savage","date":"2017-01-26T15:14:56.249+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=26WafUPY,comment-id=0001,timestamp=2017-01-26T12:52:57.945+0000)\n>\n> Qualsiasi tipo di feed va a farsi benedire quando subentra un buon teamplay\n> \n> Cosa se ne fa un assassino di 20 kill se poi quando va ad ingaggiare il carry nel fight si trova davanti ad un ottimo peeling che annulla totalmente i suoi danni?\n> \n> La cosa principale per vincere non è il feddarsi, ma essere meccanicamente superiori all&#x27;avversario. Non bisogna fare per forza 10 kill in 5 minuti per essere meccanicamente superiori, basta saper giocare bene il proprio ruolo nei fight, avere una buona visione di gioco e saper fare le call giuste\n> \n> Saper outplayare &gt; sapersi feeddare\n\nEsatto!!!","replies":[]}]},{"poster":"JRobich","date":"2017-01-26T12:43:34.569+0000","up_votes":2,"down_votes":0,"body":"15V 5L e ti da fastidio.... vai sul mio match history poi ne riparliamo hahahhahahah\n\nio ho \n\n5V 15L io sono profondamente frustrato! ","replies":[]},{"poster":"ChaosJuda","date":"2017-01-26T18:05:14.077+0000","up_votes":1,"down_votes":0,"body":"Io preferisco le partite di 50 minuti, LoL è uno strategico, ed è giusto che le partite durino un bel po', se volessi dei game corti giocherei ad un single player","replies":[]},{"poster":"Khail the Crow","date":"2017-01-28T17:58:42.601+0000","up_votes":1,"down_votes":2,"body":"http://na.leagueoflegends.com/en/page/gameplay-update-juggernauts\n\nQuesto riassume più o meno il tutto. Tra l'altro Garen è veramente senza un vero CC, a differenza di Darius o Skarner. Senza considerare un Malphite ben feedato. Quello ti zompa addosso e saluti tutti, e ne esce ancora con lo scudo della passiva.\n\nQuello che hai tu è il raggio e il burst di danno (se escludi Malphite), e ovviamente le opzioni per fuggire.\n\nSe un juggernaut diventa un problema bisogna contro buildare, per esempio {{item:3116}} e {{item:3151}}  o l'equivalente per gli adc.","replies":[]}]}