{"poster":"XXXX D Misaki ","date":"2016-05-11T13:50:13.034+0000","title":"Fragen zu Preisen des Gewinnspiels: Spielt wie die Profis Zockt die Teamkompositionen des MSI!","subforum":"Turniere & Veranstaltungen","embed":{"description":"Wir haben uns zwei Teams vom MSI ausgesucht! Holt euch vier Freunde, gewinnt ein Spiel mit einer der vorgeschlagenen Kompositionen und habt die Chance auf Preise! Die folgenden Sachen solltet ihr beachten: Mobilisiert vier Freunde, sucht euch eine der beiden Kompositionen aus und gewinnt ein Spiel.","url":"http://euw.leagueoflegends.com/de/page/spielt-wie-die-profis-msi-2016","image":"https://am-a.akamaihd.net/image?f=http://news.cdn.leagueoflegends.com/public/images/pages/2016/may/de/PLP_MSI/comp-RNGU.jpg"},"up_votes":1,"down_votes":0,"body":"Hallo liebe Mitbeschw&ouml;rer, \r\n\r\n&gt; F&uuml;r jede erfolgreiche Partie mit passender Teamkomposition werden wir unter allen Teilnehmern f&uuml;nf Gewinner ziehen. Jeder Spieler aus einem Gewinnerteam wird 2000 RP gewinnen. Die Spieler aus weiteren 5 Gewinnerteams werden jeweils einen geheimnisvollen Skin gewinnen. Zus&auml;tzlich werden wir auch noch zuf&auml;llig eine ganze Reihe von EP-Boosts verteilen. Die gl&uuml;cklichen Sieger werden dann am 23. Mai in einem Forenpost ver&ouml;ffentlicht. \r\n\r\nRiot hat dieses gro&szlig;artige Gewinnspiel angek&uuml;ndigt, jedoch verstehe ich einfach nicht wer genau was gewinnt^^\r\nEvtl versteht ja jemand hier mehr oder einer der Wrenchmen/Riotler wei&szlig; genau was damit gemeint ist^^\r\n\r\nBIsher habe ich nur rausgefunden, dass man ein Spiel mit der Kombo mit nem Full Premade Team gewinnen muss um am Gewinnspiel teilnehmen zu k&ouml;nnen.\r\nMan kann Ranked, Abwechselnde Wahl oder Freie Wahl spielen. \r\nAlle Spieler m&uuml;ssen aus Deutschland, &Ouml;sterreich oder der Schweiz kommen. **(was ist eigentlich, wenn einer der 5 Spieler aus zbsp den Niederlanden kommt? Z&auml;hlt das Spiel dann gar nicht oder kann der einzelne Spieler dann nix bekommen?)**\r\n\r\nDann meine Fragen: \r\n- Ich verstehe es so: Ein Team gewinnt ein Spiel mit der Kombo, 5 Spieler aller Teilnehmer(gewinnenden Leute) werden ausgelost.\r\n**Hei&szlig;t das dann nicht eigentlich, dass jeder Spieler, der gewinnt 2000 RP gewinnt?**\r\n- Es werden EP-Boosts zuf&auml;llig verteilt und geheimnisvolle Skins an Spieler aus weiteren 5 Gewinnerteams verteilt\r\n**Hei&szlig;t das, man kann mehrmals geheimnisvolle Skins bekommen?**\r\n\r\nLg Mus1c","replies":[{"poster":"Fluffy Totoro","date":"2016-05-11T15:35:36.221+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\nIch habe es so verstanden:\n\nUnter allen Teilnehmern, welche dieses Event erfolgreich\nabsoviert werden, wird **1 Team (á 5 Spieler)** mit\n2000 Riot Points beglückwünscht.\n\nAußerdem bekommen **5 weitere Teams (á 5 Spieler)**\njeweils einen mysteriösen Skin.\n\nEbenso bekommen **viele weiter Teams** EP-Boosts.\n\nFalls jemand aus den Niederländen mitmacht, und Riot\ndies durch die IP rausbekommen (schaffen die normalerweiße),\nso wird das Spiel vermutlich nicht in das Gewinnspiel mit\naufgenommen.\n\nLg\nFlorian","replies":[]}]}