{"poster":"DMS Nalguita","date":"2020-01-03T02:11:04.313+0000","title":"Se busca jugadores para terminar las escuadras de Dark Minds.","subforum":"Reclutamiento","up_votes":2,"down_votes":0,"body":"Hola que tal.. Espero que esten bien :)!\r\n\r\nSe estarian buscando 2 Junglers, 1 Adc 1 Mid, 1 Top\r\nBueno la idea de crear esta Segunda escuadra de League Of Legends, es ir progresar y mejorar todo lo posible con el tiempo! Con el tiempo ganar torneos, scrims, etc..\r\n\r\nNo es una escuadra suplente\r\nLa idea de armar esta segunda escuadra, es que puedan ir jugando scrims entre ustedes, mientras mejoran su rendimiento poco a poco, en los dias de entrenamiento. y que vayan jugando torneos.\r\n\r\nEs una muy buena oportunidad para ustedes, para los que aspiran llegar a ser profesionales, a los que aspiran ser los mejores!\r\n\r\nRequisitos:\r\nElo: Platino 1 o + ( S9 )\r\nEdad: +17años\r\nSer tolerante, responsable, paciente, tener compañerismo, y no ser toxico!\r\nTener Discord\r\n\r\nContactenme a travez de nuestro Servidor de discord. https://discord.gg/G96rBke\r\n(En el discord canal #postulacion ) y cualquier duda en el canal #Dudas","replies":[{"poster":"AguSGoD","date":"2020-01-03T04:37:32.563+0000","up_votes":3,"down_votes":0,"body":"***","replies":[{"poster":"Ocanoo","date":"2020-01-03T04:38:44.132+0000","up_votes":3,"down_votes":0,"body":"Capo baja un cambio, se va a suicidar el pibe, las verdades duelen","replies":[]}]},{"poster":"Pitúsas","date":"2020-01-03T04:47:51.998+0000","up_votes":1,"down_votes":1,"body":"crack eso que pones de descripcion es una invitacion a que te caguen a puteadas y troleando, mira con un team de elo platino 1 o d4 te estas yendo directamente a la mierda, estan todos los elobosteados y los mas petes, buscate un team bronce que seguro que te va mejor, yo participaria pero estoy desinstalando este juego de virgos, se nota que sos un pibe copado, buena onda, te sugiero que dejes este antro de mogolicos y la vayas a poner por ahi o estudia, que de jueguitos no se vive, baja de esa nube de pedos, encima las es una region re de mierda para jugar, un plata de korea seguro se los coge de parados a todos, te seria mas rentable ir a constitucion y hacerte reventar el orto por un señor con plata, tu vieja me  conto que te compro la compu para que vicees asi y no me parece mala idea. desde ya te deseo felices fiestas capo y desinstala esta garcha, salu2 {{sticker:slayer-jinx-catface}}","replies":[]}]}