{"poster":"Filteredname582","date":"2017-08-17T13:10:29.501+0000","title":"Inting teammates in a premade ganged up and reported me.","subforum":"Player Behavior","up_votes":2,"down_votes":3,"body":"I just got a chat ban for complaining about 2 people inting. They reported me after the game. I saw the chat log after I got the suspension. I don&#039;t think it was deserving of a ban. These two people were premade and set out to ruin people&#039;s games, yet I&#039;m the one who gets punished?","replies":[{"poster":"Chermorg","date":"2017-08-17T13:29:03.355+0000","up_votes":4,"down_votes":0,"body":"You may not think it's worthy of a punishment, but it may well be. If you post the chat logs here we can identify why you were punished.\n\nFurther, as others have said, it only takes one report to punish you - more don't do anything. One report flags the game for review, nine reports flags the game for review. Others actions don't give you the right to do similar things.","replies":[]},{"poster":"Killer3000189","date":"2017-08-17T14:22:44.453+0000","up_votes":3,"down_votes":0,"body":"Logs?","replies":[]},{"poster":"Zezockary","date":"2017-08-17T13:26:46.418+0000","up_votes":2,"down_votes":1,"body":"It doesn't matter how many people report you, if you get reported in a game the game is reviewed, more reports does not make the system review your game any harder.\n\nOther people doing bad things does not give you an excuse to. You were punished for what you did, not what they did. If your argument is that the exact things that you said should not be punished, then post your chat logs and we can discuss that.","replies":[]},{"poster":"Shadowynn","date":"2017-08-17T21:12:29.040+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=A RectumWrecker,realm=NA,application-id=ZGEFLEUQ,discussion-id=MWNmMzkm,comment-id=,timestamp=2017-08-17T13:10:29.501+0000)\n>\n> I just got a chat ban for complaining about 2 people inting. They reported me after the game. I saw the chat log after I got the suspension. I don&amp;#039;t think it was deserving of a ban. These two people were premade and set out to ruin people&amp;#039;s games, yet I&amp;#039;m the one who gets punished?\n\nI'm 100% certain that when you defended yourself in chat, you were probably as toxic as the 2 inters.  They probably got banned along with you.  Next time mute and play your game. If they int, so let them.  You do as best as you can.","replies":[{"poster":"Baka Red","date":"2017-08-18T07:11:41.419+0000","up_votes":1,"down_votes":0,"body":"And after the match is over, don't forget to report the inters. \n\nMute and report. That is the way how things are supposed to be done. No talking back. It only leads to negative results.","replies":[]}]},{"poster":"Periscope","date":"2017-08-17T20:27:30.090+0000","up_votes":1,"down_votes":0,"body":"You could take your case to support. You can also post your logs and we can weigh in on them. Keep in mind, it only takes 1 report to trigger a review. This rule is in place specifically to avoid abuse by premade groups.","replies":[]},{"poster":"General Esdeath ","date":"2017-08-17T17:54:11.528+0000","up_votes":1,"down_votes":0,"body":"post the logs","replies":[]}]}