{"poster":"Ronnald ","date":"2017-04-22T11:23:14.019+0000","title":"new client","subforum":"Help & Support (OCE)","up_votes":0,"down_votes":0,"body":"is there a way to bring back the old client? im having lag difficulties with this new client","replies":[{"poster":"Wuks","date":"2017-04-22T22:30:53.363+0000","up_votes":1,"down_votes":2,"body":"To address the first part of your question, unfortunately, no. There's no way to return to the legacy client. It requires a lot of upkeep to maintain two separate clients, so in order to focus on improving one client, the legacy client has to be retired. If you have feedback on the new client, you can post them in the Client Discussion sub-board, or if you're having technical issues, we can work with you to resolve them.","replies":[{"poster":"paul  b1art","date":"2017-05-03T10:26:12.322+0000","up_votes":1,"down_votes":0,"body":"I have seen nothing but issues about the new client, no many summoners seem happy! Will riot listen to the player base? alot of people seem to prefer the old..... Maybe riot should listen and admit that the new client isn't ready?","replies":[]},{"poster":"Taliyahs huge","date":"2017-04-25T10:58:02.495+0000","up_votes":1,"down_votes":1,"body":"Your new client is garbage and you can't argue otherwise, you don't need to maintain 2 separate clients, just give us the option to configure the new client so its not that like piece of shit your trying to force us to use pls","replies":[]}]},{"poster":"JeahUnit","date":"2017-04-25T14:26:54.096+0000","up_votes":1,"down_votes":0,"body":"Definitely agree. I had major issues with the new client lagging during the character select screen. I never get the lane I want anymore. I even struggle to even select a character at times.\nI raised this issue when I first started using the new client last year and was told to get around it by loading the old client. Now I can't really even play this game anymore. Does anyone have any ideas of how to get around this?","replies":[]},{"poster":"Ninox","date":"2017-04-22T12:14:13.434+0000","up_votes":1,"down_votes":0,"body":"Lag in client or in game?\n\nEither way, enable “Low Spec Mode” and “Close Client During Game”. This ought to fix client lag and will remove the vast majority of LCU’s influence from in game performance. If problems persist then they can be investigated further.\n\nIn game issues are not caused by the LCU as the LCU does not have any impact on in game files since the splash client and game client are separate, and the game client has not changed. The only impact is negated by turning on “Close Client In Game”. If the problem persists then it lies elsewhere.","replies":[]}]}