{"poster":"ΞNoGanks4USirΞ","date":"2018-07-06T03:05:20.411+0000","title":"[Vorschlag] Dodge Button","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":4,"body":"Hey ich nutze mal meine 5 Minuten Sperre um hier nen Vorschlag zu t&auml;tigen. Was w&uuml;rdet ihr davon halten einen Dodge Button einzuf&uuml;gen ? W&uuml;rde das ganze angenehmer machen und es w&uuml;rde evtl. &ouml;fter genutzt was sehr hilfreich sein kann wenn in der Champ Select schon rumgeflamet wird weil man die gleichen wie im letzten Game hat.","replies":[{"poster":"manial fly","date":"2018-07-06T06:08:42.311+0000","up_votes":5,"down_votes":0,"body":"Denken manche Leute eigentlich vorher mal nach bevor sie mit solchen Ideen ankommen?\nIch weiß nicht ob du dich noch an den alten Teamersteller erinnern kannst, aber genau so würde dann ablaufen. I.wem passt ein bestimmter Champ nicht und schon wird gedoged - ist ja erlaubt.\nIm Endeffekt würde es dann ewig dauern bis dann überhaupt mal ein Spiel zustande käme - aber hey du wolltest ja mit deiner tollen Idee Zeit sparen ;)","replies":[]},{"poster":"Megamaexx","date":"2018-07-06T04:24:12.527+0000","up_votes":3,"down_votes":2,"body":"Dodge ist keine eingebaute Funktion in LoL! Was denkst du denn, warum du deswegen auch Strafen erhältst.","replies":[{"poster":"ΞNoGanks4USirΞ","date":"2018-07-06T04:30:39.531+0000","up_votes":1,"down_votes":3,"body":"Genau da seh ich das Problem wozu soll ich 30 Minuten meiner Lebenszeit verschwenden und 16LP verlieren wenn ich genau so gut dodgen kann und nur 3 verliere außerdem vermute ich mal das einige nichtmal von der \"Funktion\" wissen und da wäre es angebracht.","replies":[{"poster":"Megamaexx","date":"2018-07-06T06:06:33.150+0000","up_votes":1,"down_votes":0,"body":"Warum willst du fördern, dass Leute die Championauswahl verlassen? Das werden dann nämlich auch deine Gegner wahrnehmen und in Situationen, in denen du dir denkst, dass das ein schneller Sieg wird, werden eben die Gegner die Championauswahl verlassen. Am Ende wird sich nichts an der Gesamtsituation verändern, außer dass man länger benötigt, um ins Spiel zu kommen.","replies":[]},{"poster":"OT Riku","date":"2018-07-06T04:43:21.175+0000","up_votes":2,"down_votes":1,"body":"Es soll ja keine Funktion sein es ist halt ein Ding was sich nicht ändern lässt.","replies":[]},{"poster":"LiebesWölkchen","date":"2018-07-06T10:16:11.242+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GIVEMEAGOODSUPP,realm=EUW,application-id=YnZkMR0R,discussion-id=uLFj7F3E,comment-id=00000000,timestamp=2018-07-06T04:30:39.531+0000)\n>\n> Genau da seh ich das Problem wozu soll ich 30 Minuten meiner Lebenszeit verschwenden und 16LP verlieren wenn ich genau so gut dodgen kann und nur 3 verliere außerdem vermute ich mal das einige nichtmal von der &quot;Funktion&quot; wissen und da wäre es angebracht.\n\nDamit du lernst , zu kämpfen und nicht in champ select schon aufzugeben.\nHat alles mit Disziplin und Wille zu tun.","replies":[]}]}]},{"poster":"Kind Prow","date":"2018-07-06T08:59:27.724+0000","up_votes":1,"down_votes":0,"body":"Aus \"Die 14 und Brot Gebote der Antje\"\n\nNr 7: Sei zufrieden mit dem, was du hast.\n\nNr 3: Ignoriere die Arschlöcher.\n\nKonklusion: Du sollst nicht dodgen! **NICHT** dodgen.","replies":[{"poster":"MahmudGetsYoAss","date":"2018-07-06T20:53:14.163+0000","up_votes":2,"down_votes":1,"body":"Climben erfordert Dodgen. Fazit: Dodge wenn nötig!","replies":[]}]},{"poster":"Send Νudes","date":"2018-07-06T12:52:03.239+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Marksmansitter","date":"2018-07-06T16:00:36.493+0000","up_votes":1,"down_votes":0,"body":"meh wenn jemand etwas spielt was nicht so meta ist kann man das schon ausnutzen","replies":[]}]},{"poster":"Hakkuu","date":"2018-07-06T11:06:54.017+0000","up_votes":1,"down_votes":0,"body":"Unpopular opinion:\n\nDodgen ist eine eingebaute und auch gewollte mechanic im Ranked. Deswegen verliert man auch kaum LP und die MMR bleibt sogar gleich, ergo mehr LP für nachfolgende Spiele.\nWenn Riot mit allen Mitteln verhindern wollte, dass Leute dodgen, hätten sie in den letzten 5 Seasons die Strafe dafür schon längst angehoben. Dodgen ist total fine bei Trolls etc. - selbst wenn die Gegner einfach eine deutlich stärkere Teamcomp haben. Daran ist nichts verwerflich :)\n\nDer Vorschlag ist mMn aber trotzdem nicht gut. Jeder weiß wie man dodged, und mehr Anreize zu geben sollte nicht das Ziel sein.","replies":[]}]}