{"poster":"Quebin","date":"2015-07-10T10:13:02.578+0000","title":"Skins de legado - Visual Update","subforum":"Charlas Generales","up_votes":1,"down_votes":1,"body":"Ante todo Buenas ¿Que tal? \n\nMi pequeña queja es que gente que pago al menos 1820 RP por una skin de legado como en este caso podr&iacute;a ser Twisted Fate el Magnifico(no es por qu&eacute; me llame Random Fate en el juego xD) o Corki o Tristana con sus respectivas skins de 1820 lo &uacute;nico que consigamos es un simple cambio de texturas(en el caso de Tristana despu&eacute;s del rework pues mejor&oacute; en algo la skin de Bombera) pero donde quedan los dem&aacute;s campeones? Que tienen skins de legado que parecen mas skins de poco mas de de 720 RP, yo se que para eso entonces que sacaron dichas skins, era en si lo mejor de lo mejor, pero en esos tiempos, ya ser&iacute;a hora de que vayan poco a poco d&aacute;ndoles un VU a cada una de las skins de legado (empezando por las mas caras) por qu&eacute; de que sirve gastarse 1820 RP en una skin que no le cambia practimanete nada mas que el modelo.. Ser&iacute;a bueno que empiecen con esto ahora que est&aacute;n actualizado todo el LoL en cuesti&oacute;n de texturas de personajes y dem&aacute;s. \nYo vengo diciendo esto desde que es estaba en el servidor de EUW. \nEspero alg&uacute;n d&iacute;a un Rioter lo lea y me comente que pasara respecto a este tema y si ser&aacute; cuesti&oacute;n de esperar un VU a dichos campeones como sucedi&oacute; con Tristana. \n\n{{item:3070}} {{champion:4}} {{item:3070}}.... {{item:3070}} {{champion:42}} {{item:3070}}","replies":[{"poster":"T4T421","date":"2015-07-10T11:11:07.260+0000","up_votes":2,"down_votes":0,"body":"yo no me quejo.. me toco en una caja de 490 el tf.. tira facha a la hora de jugar, pero si vamos con los que pagaron \"1820\" tendrias razon porque tecnicamente es un legendario y no cambia nada y hasta un skin de 750 actual es mejor que ese tf.. xD","replies":[]},{"poster":"GinTaicho","date":"2015-07-10T11:41:44.349+0000","up_votes":1,"down_votes":0,"body":"Han dicho que entre todos los planes que tienen de actualizaciones (splash art, reworks, etc) ese tema está en una prioridad muy baja, ya que hay cosas que toman más trabajo y al parecer son más importantes (nuevas skins, campeones, eventos, etc)\n\nYo espero que le agreguen más cosas a Finísimo Caballero {{champion:31}}  :c el Blindaje Superior vale lo mismo y lo supera por lejos.","replies":[{"poster":"Quebin","date":"2015-07-10T15:43:19.607+0000","up_votes":1,"down_votes":0,"body":"Y esas skins como la de chogat y tf, tiene muy buena temática para hacer VU a sus skins y hacer que sean únicas en todo aspecto.","replies":[]}]}]}