{"poster":"Cl0kw0rk","date":"2016-05-23T15:33:57.381+0000","title":"Sta per iniziare il Summer Split! Cosa guardare?","subforum":"Esport","embed":{"description":"Let me guess: you are a Lolesports fan, but not too much. You like to watch professionals games of Europeans, North Americans, Koreans, Chinese or whatever, but not every one of them. You like to spectate the best and exciting games, but not the boring ones.","url":"http://lolwhattowatch.altervista.org/","image":"http://lolwhattowatch.altervista.org/wp-content/uploads/2016/05/cropped-Freljord_Wallpaper-1-2.jpg"},"up_votes":4,"down_votes":2,"body":"Se anche voi siete come me grandi fan dei circuiti professionali di League of Legends ma non sapete quali partite saranno le migliori da seguire, date un&#039;occhiata a What to Watch! Consiglio ogni domenica i &quot;Best Matches&quot; della settimana ventura, e per gli indecisi c&#039;&egrave; anche il &quot;Viewer&#039;s Buffet&quot;, dove potrete trovare consigli specifici a seconda dei vostri gusti!\r\n\r\nOgni tipo di feedback &egrave; apprezzato, grazie mille per il vostro tempo!","replies":[{"poster":"d1ffraction","date":"2016-05-23T22:45:29.818+0000","up_votes":2,"down_votes":0,"body":"Ottimo sito, aggiunto ai preferiti! Almeno sul forum non ho visto un grande interesse per gli esports viste le date degli ultimi post ma apprezzo ogni iniziativa disposta ad orientarsi in questa giungla, specie visto l'alto numero dei match. Keep up the good work :)","replies":[{"poster":"Cl0kw0rk","date":"2016-05-24T10:31:02.168+0000","up_votes":1,"down_votes":0,"body":"Grazie bro, l'ho realizzato esattamente con questa idea in mente! Spero di continuare a portarlo in questa direzione e di aiutare a diffondere la cultura degli eSports anche in Italia, che solitamente ha una mentalità più arretrata e tradizionalista rispetto al resto dell'Europa!\n\nI will do my best! :D","replies":[]}]},{"poster":"Bronze II","date":"2016-05-23T17:00:31.033+0000","up_votes":1,"down_votes":0,"body":"Ottima Iniziativa ;-)...Segui solo Euw? Chiedo per il fatto che manchi Na","replies":[{"poster":"Cl0kw0rk","date":"2016-05-23T17:26:48.177+0000","up_votes":1,"down_votes":0,"body":"Seguo (o cerco di seguire) NA, EU, LPL e LCK. L'analisi dei team l'ho fatta (per ora) solo per EU siccome li seguo più da vicino e guardo tutte le partite; inoltre aspettavo che i team bannati in NA dichiarassero le nuove org/roster (Renegades/Impulse ecc). Non appena annunciano tutto lo faccio anche per i team NA!","replies":[{"poster":"Bronze II","date":"2016-05-23T18:25:18.532+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Cl0kw0rk,realm=EUW,application-id=wqlqxm93,discussion-id=fWKmcEHr,comment-id=00030000,timestamp=2016-05-23T17:26:48.177+0000)\n>\n> Seguo (o cerco di seguire) NA, EU, LPL e LCK. L&#x27;analisi dei team l&#x27;ho fatta (per ora) solo per EU siccome li seguo più da vicino e guardo tutte le partite; inoltre aspettavo che i team bannati in NA dichiarassero le nuove org/roster (Renegades/Impulse ecc). Non appena annunciano tutto lo faccio anche per i team NA!\n\nOk xd...comunque davvero i miei complimenti :-D","replies":[]}]}]},{"poster":"PND Magretto","date":"2016-05-23T16:51:44.334+0000","up_votes":2,"down_votes":0,"body":"Non mi sembra male.","replies":[]},{"poster":"Liuck27","date":"2016-05-23T15:57:24.537+0000","up_votes":1,"down_votes":0,"body":"Ma lo hai fatto tu?\n{{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"Cl0kw0rk","date":"2016-05-23T16:37:57.913+0000","up_votes":1,"down_votes":0,"body":"Sì! Creato la settimana scorsa, ma in realtà ci stavo pensando da qualche settimana. Sono contento che ti piaccia, spero anche sia comprensibile e coinvolgente! Se hai consigli/critiche non esitare a parlarne, essendo appena all'inizio ho bisogno di feedback!","replies":[{"poster":"Floppyz","date":"2016-05-23T16:40:58.352+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Cl0kw0rk,realm=EUW,application-id=wqlqxm93,discussion-id=fWKmcEHr,comment-id=00000000,timestamp=2016-05-23T16:37:57.913+0000)\n>\n> Sì! Creato la settimana scorsa, ma in realtà ci stavo pensando da qualche settimana. Sono contento che ti piaccia, spero anche sia comprensibile e coinvolgente! Se hai consigli/critiche non esitare a parlarne, essendo appena all&#x27;inizio ho bisogno di feedback!\n\nIl layout è molto molto semplice (suppongo abbia toccato poco o nulla il CMS che ci hai buttato)... e questo è bene, visto che ora va di moda fare siti web che pesano più di un blu-ray.\n\nSe lo curi costantemente e ne hai la capacità, credo che il tuo sia un buon progetto.","replies":[{"poster":"Cl0kw0rk","date":"2016-05-23T16:49:07.932+0000","up_votes":2,"down_votes":0,"body":"Essendo totalmente negato con l'informatica ho usato Altervista, che è facile da personalizzare e gestire. \n\nSpero di continuare ad avere il tempo per scrivere un articolo a settimana, e poi in caso di tempo libero extra scrivo cose in più (ad esempio il team breakdown degli EU LCS); comunque mi diverto molto a fare previsioni sulle partite a venire, quindi penso continuerei a curarlo anche se lo visitassero in pochi.\n\nGrazie mille per il supporto!\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]},{"poster":"Sky Striker Ace","date":"2016-05-23T19:18:21.265+0000","up_votes":1,"down_votes":0,"body":"I G2 dovrebbero essere T1, i Fnatic T2. Mithy-Zven è una lane della madonna, mentre i Fnatic seppur la bot sia tornata buona, Gamsu e Spirit non reggono il confronto con gente come Trick e Kikis. Ma sono opinioni, so ok.\nP.s. Perkz prima di entrare ai G2 era ai Millennium, dove spammava mage del genere in soloQ, quindi può adattarsi bene.","replies":[]},{"poster":"Nibbio Bianco","date":"2016-05-23T16:51:44.350+0000","up_votes":1,"down_votes":0,"body":"Manca NA LCS...","replies":[]}]}