{"poster":"The Best Fizz","date":"2015-11-04T23:54:18.560+0000","title":"Season 6 marks the starting point of the end of League of Legends if Riot doesn't get smart.","subforum":"[ARCHIVED] Miscellaneous","up_votes":5,"down_votes":3,"body":"RIOT! WHAT ARE YOU DOING!\r\n\r\nI just saw all the new items you are going to place in Season 6. The visual reworks are ok, but all the new items you have, are just PLANE STUPID. I don't like them one bit, and a bunch of other League players might feel the same way.\r\n\r\nNow, this addition to League of Legends is probably the dumbest in League history. The Rift Herald? The name, first of all is insulting. Riot's given some great names, and it is discouraging to see a company that has done this so well so many times fumble it now. The buff of the Rift Herald is just dumb. First of all, it makes things too op. Riot, your love for Attack Speed and countering tanks is really showing this season, because not only does this buff give you these things, but ALL the new items you made have attack speed and tank counter aspects in them. The whole point of Baron Buff, is a team fight against a crazy creature that will give an advantage over the other team. Why would you add the Rift Herald to give it to one champ and then leave in two minutes. Like...\r\n\r\nRiot, I know you might like these new items and buffs, but please don't make it apart of the REAL League of Legends. Season 5 really helped polish it, but now you are going to the extreme and putting things that just don't make sense. Make this a game mode or something.\r\n\r\nSorry Riot, I just had to say that.\r\n\r\nPS: Masteries shouldn't change either!","replies":[{"poster":"Sir Simba","date":"2015-11-14T13:42:56.893+0000","up_votes":1,"down_votes":0,"body":"EVERYONE HAS THEYR BOARDS BUT I DONT! WTF","replies":[]},{"poster":"The Best Fizz","date":"2015-11-05T00:35:01.390+0000","up_votes":1,"down_votes":0,"body":"Yet. ;D\n\nI just don't like this new Jungle thing, I could care less about the items for ADC, I don't play it much.","replies":[]},{"poster":"IronwallJackson","date":"2015-11-05T00:00:33.299+0000","up_votes":1,"down_votes":0,"body":"\"It's different and therefore it's bad.\"\n\nThat's pretty much what I read. Dude, attack speed is a lot harder to stack in the current PBE build and the new Last Whisper items only affect bonus armor, making it so that something has to stack a whole mess of armor before the arpen is high enough to match the values found in the live build.\n\nSettle down; Riot hasn't gone full retard yet.","replies":[]},{"poster":"Legal Wrights","date":"2015-11-04T23:54:36.106+0000","up_votes":1,"down_votes":0,"body":"Plane Stupid\n\nYa ok.\n\nAnd Rift Herald has a decent enough name. Especially when you consider that the other one is Dragon. Just...Dragon. They  literally just named it what it is. That's like naming Volibear...Bear...oh wait they did name him Bear.\n\nAnyway, Their love of shredding tanks? HAVE YOU FORGOTTEN THE LEAGUE OF TANKS?\n\nThat was the most miserable time in recent memory, to the point that I'm totally okay with ADCs being good again. I can at least kill those. And masteries have changed a few times in the past. This is nothing new.","replies":[]}]}