{"poster":"Sakujun","date":"2016-09-03T06:25:20.344+0000","title":"screen resolution problem - no game.cfg file located","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Can anyone tell me how to change screen resolution both outside of the game (the login screen takes up 90% of my destop) and in game , my screen resolution is 3840 x  2160 and it does not work well with the game. There is no game.cfg file anywhere in the riot games folder for me to usually fix this, closest thing i found was only persistentsettings.json file. Was able to fix it before I factory reset my laptop by finding the game.cfg file but this game is making it frustratingly harder to customize things.","replies":[{"poster":"Sakujun","date":"2016-09-05T22:02:49.479+0000","up_votes":1,"down_votes":0,"body":"I know it's not supported (not sure why they haven't gotten around to it yet with the amount of support this game got, it's been years) but i can still play by changing the resolution of the game, did that already after I created a custom game and it works fine now in game (cursor not too small and map size not microscopic or the game screen not hanging off the edge of my monitor anymore). Still can't change the client size outside of the game which is why i'm asking where the heck is the game.cfg file? and NO it's not under C:\\Riot Games\\League of Legends\\RADS\\solutions\\lol_game_client_sln\\releases\\0.0.1.143\\deploy\\DATA\\cfg where it's suppose to be.","replies":[]},{"poster":"Porocles","date":"2016-09-03T21:09:34.446+0000","up_votes":1,"down_votes":0,"body":"Are you using a 4K?  It's not something that's currently supported, and you resolution may be a bit too high.  I wouldn't recommend modifying your game files as it could end up causing more problems.  Your best bet may be to reduce your resolution settings.  \n\nIf it's not related to your 4K, you can also adjust this through DPI settings:  Right click the LoL icon -> Properties -> Compatibility Tab -> Check the \"Disable Display Scaling on High DPI Settings\" Box.\n\nHope that helps!","replies":[]}]}