{"poster":"Quinn der Woche","date":"2016-02-17T19:38:26.580+0000","title":"mein erstes jahr","subforum":"Champions & Gameplay","up_votes":8,"down_votes":2,"body":"Hallo \nAngefangen hat das ganze im Dezember 2014 das erste mal auf Grund von Gruppen zwang LoL gespielt \nAshe bot game ohne items ....GG\nDanach habe ich mich wirklich nur an Ashe geklammert bis ich mir endlich Janna leisten konnte (war damals gef&uuml;hlt ne ewig Keit da das Spiel noch kaum Spa&szlig; gemacht hat)\nUnd dan ging es los Janna auf atk. Speed... Man das habe ich so lange gespielt :D ({{champion:40}} und{{item:3085}} musste damals ja gut sein)\nIrgendwann so lv.13 sto&szlig; ich auf Sona die ich dan auch bis Sommer 2015 fast only gespielt habe ob ranked normal immer Sona ...doch dan kamm Langeweile ....ich habe keinen einzigen support mehr gespielt und auf jeder lane ein bisschen bis ich dan (kurz nach dem champion meisterschafts system) auf Quinn gesto&szlig;en bin (sie war free und es war liebe auf den ersten Blick :D) 3 Tage sp&auml;ter ein Video von maxim (lrsb) mit dem Titel &quot;warum suckt Quinn&quot; ... Ich dachte nur holy shit Quinn ist doch mega nice doch mit Ende der season musste ich val lebwohl sagen ... Viel frust ist in mir hoch gekommen als das rework kam ... &gt;:[ also spielte ich wieder das was ich am besten konnte : support ... Und nicht irgendwen nein es war wieder Sona der champ der die meiste meiner LoL Zeit an meiner Seite stand und nach 3 Wochen war auch Quinn wieder da !\nNur dan erkannte ich ein Problem ! Ich war So lange support gewesen das ich lasthiten nie gelernt hatte ! Und ich wollte schnell besser werden also spielte ich Ende November Quinn jgl und sona support und ich habe damals schon ein paar Lacher bekommen wenn ich Quinn lockte ... Nun ist es mehr als ein Jahr her das ich mit LoL angefangen habe ... Ich habe dieses Jahr mich von vielen champs getrennt (Sona fr&uuml;hjahr_Sommer  , akali anfang sommer -Ende Sommer , atk. Speed Janna im Fr&uuml;hjahr, tarik Anfang Sommer - im Herbst , sivir anfang sommer - herbst , und Quinn Ende Sommer - per season ) doch zu den besten kann ich nicht nein sagen auch wenn sie &Auml;nderungen erfahren haben (Quinn) oder einfach zwischen durch langweilig waren (Sona)\n\n\nAlles im allen ein tolles erstes Jahr ... Danke riot , riot support, danke auch an meine Freunde bzw. Community und danke an den Rest der LoL Spieler ... Auch wenn einige von euch sicherlich nicht so nett zu mir waren als sie atk. Speed Janna gesehen haben ... Damals im Fr&uuml;hjahr\n\nMFG Lizart \n&quot;Schau Val, Fr&uuml;hst&uuml;ck&quot;{{champion:133}}","replies":[{"poster":"eR Yatrazz","date":"2016-02-18T17:11:26.237+0000","up_votes":2,"down_votes":0,"body":"Man muss wirklich sagen, Rito macht ein geiles Spiel! :)","replies":[]},{"poster":"Bergelmir32","date":"2016-02-17T23:41:58.238+0000","up_votes":2,"down_votes":0,"body":"Die alte Fiora als Tank, ... man hat mich schlicht ignoriert.{{sticker:zombie-nunu-tears}}","replies":[{"poster":"Quinn der Woche","date":"2016-02-18T05:32:06.753+0000","up_votes":2,"down_votes":1,"body":":D meine Janna hat auch jeder ignoriert","replies":[]}]},{"poster":"TerrorRaven","date":"2016-02-17T23:05:07.468+0000","up_votes":2,"down_votes":0,"body":"Es ist schön, mal zwischen den ganzen Heul-Thread wie \"Nerf Champ X\" oder \"Ich wurde zu unrecht gebannt (wobei es meistens zurecht ist)\" mal sowas zu lesen.\n\nIch habe Anfangs Renekton auf Attack-Speed gespielt. War schon irgendwie Lustig. Und das mit der \"Liebe auf den ersten Blick\" kenne ich nur zu gut. Nur in meinen Fall war es Teemo, den ich bis heute noch sehr gerne mag. Habe dadurch sicherlich viel Hass auf mich gezogen (sowohl bei Mit- als auch Gegenspieler), aber das war es mir wert.","replies":[{"poster":"Quinn der Woche","date":"2016-02-18T05:31:35.166+0000","up_votes":2,"down_votes":1,"body":"Haha das glaube ich dir :D","replies":[{"poster":"Ηastur","date":"2016-02-19T11:25:53.406+0000","up_votes":1,"down_votes":0,"body":"Dem schließe ich mich mal an. Bei mir wars Annie die ich nach wie vor liebe.\nIch weiß noch damals wurd ich von meinen Bekannten auf die Botlane gezwungen und hatte keine Ahnung vom Farmen oder sonst irgendwas. Ich kann mich noch richtig daran erinnern, wie ich von Lane zu Lane gerannt bin um zu helfen und immer keine Ahnung hatte wie wir gewonnen haben, mich aber immer gefreut habe. :D","replies":[]}]}]},{"poster":"onegameup","date":"2016-02-18T16:34:57.259+0000","up_votes":1,"down_votes":0,"body":"ich habe sehr lange versucht kassadin ad zu spielen als ich in s2 oder so angefangen habe mit der begründung das er ja ein schwert hat also auch ad gehen kann xD war ne tolle zeit vorallem da ich für jeden kill ca 5 tode hatte.","replies":[{"poster":"TerrorRaven","date":"2016-02-18T17:26:19.643+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=onegameup,realm=EUW,application-id=Wj1wcocU,discussion-id=H8jH7moo,comment-id=0004,timestamp=2016-02-18T16:34:57.259+0000)\n>\n> ich habe sehr lange versucht kassadin ad zu spielen als ich in s2 oder so angefangen habe mit der begründung das er ja ein schwert hat also auch ad gehen kann xD war ne tolle zeit vorallem da ich für jeden kill ca 5 tode hatte.\n\nHatte Kassadin nicht mal Rüstungsdurchdringung gehabt auf irgendeiner Fähigkeit?","replies":[]}]},{"poster":"Shadow l Eagle","date":"2016-02-18T15:04:59.399+0000","up_votes":1,"down_votes":0,"body":"Kha Zix Top ftw. xD","replies":[]},{"poster":"kuchenbro","date":"2016-02-18T13:58:41.987+0000","up_votes":1,"down_votes":0,"body":"Hach die guten alten Zeiten als man mit LoL angefangen hat \nRIP full ad malph q.q {{item:3072}}  {{item:3074}} {{item:3031}} {{item:3153}}","replies":[{"poster":"Petite pipe svp","date":"2016-02-18T14:15:16.809+0000","up_votes":1,"down_votes":0,"body":"AP Warwick {{sticker:slayer-jinx-wink}}","replies":[]}]}]}