{"poster":"aBitBerger","date":"2018-06-15T07:41:26.165+0000","title":"disconnection ohne ende ohne grund","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"ich habe st&auml;ndig dc&acute;s mehrere pro game, obwohl die internet verbindung steht.\nirgendwelche typs woran das liegen k&ouml;nnte oder ist das ein problem seitens riot?\n\nich zocke jetzt erstmal nicht mehr sonst gibts noch &quot;aufn deckel&quot;{{champion:79}}  vom lieben herr leaverbuster\n\nlg","replies":[{"poster":"silibum","date":"2018-06-15T10:59:09.681+0000","up_votes":1,"down_votes":0,"body":"Grundlegen deutet das auf eine schlechte Verbindung zum Server hin - mach mal bitte ein MTR:\n\n>Um ein WrenchMTR Log zu erstellen, lade das Programm **WrenchMTR** bitte auf folgender Seite runter:\n\n>[https://wrenchbox.de/downloads/](https://wrenchbox.de/downloads/)\n\n>Starte dann das Programm und füge folgende IP in das Feld **Host / IP** ein:\n\n>**185.40.65.1**\n\n>*   Während du in einem LoL Spiel bist klicke auf **Start**\n*   Lass das Ganze nun so lange laufen bis du zum ersten Mal Probleme im Spiel bemerkst\n*   Klicke auf **Stop** um den Vorgang zu beenden\n*   Klicke auf **Upload Result** um dein Ergebnis hochzuladen\n*   Klicke auf **Copy Link** um den Link zu deinem Ergebnis zu kopieren\n*   Füge den Link in deinem Kommentar mit ein\n\nEs schadet sicher auch nicht wenn Du mir mal ein HRT-Archiv erstellst: https://support.riotgames.com/hc/de/articles/224826367-Automatisierte-Fehlerbehebung-Hextech-Repair-Tool\n\nZum hochladen einer Datei verwende einfach unser [Upload-Portal](https://files.wrenchbox.de). Dort hochgeladenen Dateien können nur von uns [Wrenchmen](https://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/EhBWl18X) eingesehen werden und nach 3 Tagen automatisch gelöscht. Solltest Du eine Linkwarnung erhalten (externer Link) musst Du die URL dieser Seite auf der Datei-Upload-Seite eingeben und am besten die Funktion zur Warnung vor externen Webseiten deaktivieren, dann funktioniert das in Zukunft direkt :-)","replies":[]}]}