{"poster":"Csfuser","date":"2015-03-24T13:36:41.977+0000","title":"\"Wards win games.\"","subforum":"Tips & Tricks","up_votes":58,"down_votes":2,"body":"At the beginning of one of my games, the jungler said \"wards win games\". Surpisingly enough, there was actually a lot of warding from everyone in that game (except for adc, but I don't really expect wards from them anyway). I said that in the beginning of my next 2 games, and again, to my pleasant surprise, people were actually warding a lot more than normal. If you just remind people to ward, it'll be in the back of their mind, but they'll remember to pick up a ward here and there more often. (Also, upgrade yer dang trinkets){{item:3361}} {{item:3364}} \r\n{{item:2044}} {{item:2043}}  {{item:2044}}","replies":[{"poster":"Riot Renders","date":"2015-03-25T01:39:58.627+0000","up_votes":23,"down_votes":0,"body":"I feel the most valuable asset in League of Legends games is knowledge. Wards provide that more than any other item or skill in the game. I always recommend buying at least 1 every time you back, and a pink every time you can afford to. The only time I go against this philosophy is if it is at the expense of achieving an important power spike, and buying a ward would prevent me from getting the upgrade.\n\nVision is a team effort - and everybody should be contributing to it!","replies":[{"poster":"High5","date":"2015-03-25T05:24:17.022+0000","up_votes":4,"down_votes":0,"body":"**> [{quoted}](name=Riot Fenyx,realm=NA,application-id=WEuoGbmp,discussion-id=E3rFANZs,comment-id=000f,timestamp=2015-03-25T01:39:58.627+0000)\n>\n> I feel the most valuable asset in League of Legends games is knowledge. Wards provide that more than any other item or skill in the game. I always recommend buying at least 1 every time you back, and a pink every time you can afford to. The only time I go against this philosophy is if it is at the expense of achieving an important power spike, and buying a ward would prevent me from getting the upgrade.\n> \n> Vision is a team effort - and everybody should be contributing to it!\n**\n\nPlease post this on the front page.  \n\nIt's the little things like junglers killing crabs and helping to ward mid (pink wards benefit jungle ganks too) that snowball games very quickly.  LCS isn't the be all and end all, but a lot of people could learn about good vision control (placing wards and denying wards) from just watching one game.","replies":[]},{"poster":"Chromatic Eagle","date":"2015-03-25T02:04:15.560+0000","up_votes":3,"down_votes":0,"body":"Do you think you can make this a tip on the loading screen? Or when a game starts? Or in the recommended items list?","replies":[{"poster":"Riot Renders","date":"2015-03-28T02:29:46.825+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chromatic Eagle,realm=NA,application-id=WEuoGbmp,discussion-id=E3rFANZs,comment-id=000f0000,timestamp=2015-03-25T02:04:15.560+0000)\n>\n> Do you think you can make this a tip on the loading screen? Or when a game starts? Or in the recommended items list?\n\nI think vision may actually be one of the tips - I could be wrong though and would have to get back to you on that!","replies":[{"poster":"Chromatic Eagle","date":"2015-03-28T03:18:49.353+0000","up_votes":1,"down_votes":0,"body":"Does it say that you should upgrade them?","replies":[]}]}]},{"poster":"Thefriendlyorc","date":"2015-03-25T17:39:32.668+0000","up_votes":1,"down_votes":0,"body":"This is the reason I was so delighted to see the vision trinket have its cost reduced to 250.","replies":[]}]},{"poster":"DatPikachuTho","date":"2015-03-24T14:15:43.485+0000","up_votes":11,"down_votes":0,"body":"Whenever I'm on a team that wards well, we win. It's an incredibly consistent thing down here in Bronze - if you can convince your team to ward well, you'll beat the other team, just because they're probably not warding worth shit.","replies":[{"poster":"junglerboy16","date":"2015-03-24T22:37:02.412+0000","up_votes":3,"down_votes":0,"body":"This^ 8 times out of 10 when I check match history, the team that had the higher ward count won the match.","replies":[{"poster":"grimreefa","date":"2015-03-26T06:58:04.443+0000","up_votes":2,"down_votes":0,"body":"Part of this is also that that team had more gold with which to buy said wards to begin with.\n\nBut arguing how more wards = more wins for the stated reason becomes a catch 22.\n\nYou are on the losing team, things are going badly, do you spend money on wards for vision when 8/10 players will be using yellow trinket anyways? Or do you spend that money on upgrades.\n\nHere is an unrelated link, but it demonstrates my point well.\nhttp://playspent.org/html/","replies":[{"poster":"junglerboy16","date":"2015-03-26T12:02:55.718+0000","up_votes":2,"down_votes":0,"body":"While I agree, I think that having that extra gold to spend is usually a side effect of them getting ahead off of better warding throughout the game. It is sort of a self sustaining cycle, where the more wards they can buy, the more often they get further ahead, the more they can spend on wards, the more they get even further ahead etc.\n\nWards are one of the most snowbally mechanics in the whole game if you ask me. the only thing that is different between them and a mejai's is that they keep you from dying (usually) instead of rewarding kills.","replies":[]}]}]},{"poster":"Nucleophilic atk","date":"2015-03-28T13:28:52.835+0000","up_votes":2,"down_votes":0,"body":"I will say one thing here on your \"whenever im on a team that wards well, we win\". If you have players warding, they are probably better than those who are not warding, therefore you will win lol.","replies":[]},{"poster":"sp52pi","date":"2015-06-26T22:16:52.418+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DatPikachuTho,realm=NA,application-id=WEuoGbmp,discussion-id=E3rFANZs,comment-id=0003,timestamp=2015-03-24T14:15:43.485+0000)\n>\n> Whenever I'm on a team that wards well, we win. It's an incredibly consistent thing down here in Bronze - if you can convince your team to ward well, you'll beat the other team, just because they're probably not warding worth shit.\n\nSame at the level ladder, which I'm in. Most people don't ward, so if I can get my team to ward, we are so much smarter about things thanks to the vision we have, and almost always win.","replies":[]},{"poster":"Feathermane","date":"2015-03-25T08:56:33.999+0000","up_votes":1,"down_votes":0,"body":"Or because the team that's winning is not punished for warding in dangerous areas and has more money to spend on wards.","replies":[]}]},{"poster":"Madman357","date":"2015-03-24T15:48:37.836+0000","up_votes":9,"down_votes":0,"body":"It really is shocking how people devalue wards at lower elos (and honestly, even some people in higher elos ive come to find). If youre keeping your lane warded, there is literally no reason you should ever die to a gank unless its from a Pantheon/Nocturn ult or something.\n\nAnd honestly, even though they might not be placing the most wards, ADCs can have hugely impactful ward placements if theyre running with the upgraded blue trinket. Whenever im ADCing I always replace my yellow trinket with the blue one at level 9, even if I cant upgrade it immediately, because it allows me to scout  out brush and whatnot without having to get close it. And once you upgrade it you have the ability to tactically place wards in locations that would otherwise endanger your teams moves (whether its pushing mid lane or taking dragon/baron) if someone else was to just run over there and place a ward.\n\nThe tactical value of an ADC with an upgraded blue trinket is massive and even more underrated than standard warding I think.","replies":[{"poster":"Ayame Isaki","date":"2015-03-25T14:21:09.636+0000","up_votes":1,"down_votes":0,"body":"I never though of swapping to the blue trinket when I ADC (I usually just get the upgraded yellow); I am going to try this out next time I find myself in the ADC role. Thanks for the advice!","replies":[]},{"poster":"High5","date":"2015-03-25T05:27:03.981+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Madman357,realm=NA,application-id=WEuoGbmp,discussion-id=E3rFANZs,comment-id=0005,timestamp=2015-03-24T15:48:37.836+0000)\n>\n> It really is shocking how people devalue wards at lower elos (and honestly, even some people in higher elos ive come to find). If youre keeping your lane warded, there is literally no reason you should ever die to a gank unless its from a Pantheon/Nocturn ult or something.\n> \n> And honestly, even though they might not be placing the most wards, ADCs can have hugely impactful ward placements if theyre running with the upgraded blue trinket. Whenever im ADCing I always replace my yellow trinket with the blue one at level 9, even if I cant upgrade it immediately, because it allows me to scout  out brush and whatnot without having to get close it. And once you upgrade it you have the ability to tactically place wards in locations that would otherwise endanger your teams moves (whether its pushing mid lane or taking dragon/baron) if someone else was to just run over there and place a ward.\n> \n> The tactical value of an ADC with an upgraded blue trinket is massive and even more underrated than standard warding I think.\n\nAnother great comment!","replies":[]}]},{"poster":"Serevas","date":"2015-03-24T13:37:47.196+0000","up_votes":9,"down_votes":0,"body":"You got lucky, the last time I said that at the beginning of one of my games the response was \"F off I'm not wasting my hard earned gold on wards.\"","replies":[]},{"poster":"taleofsonata","date":"2015-03-24T15:30:02.280+0000","up_votes":1,"down_votes":12,"body":"Remember what happen when you buy too many wards ? You will never reach that late game sooner","replies":[{"poster":"TehNACHO","date":"2015-03-24T15:42:58.655+0000","up_votes":12,"down_votes":0,"body":"Remember that warding is distributed among five people.\n\nIt is not one person providing thirty wards, but five people providing six. Even ignoring the support or trinket wards, that is a 450 gold investment that is such a *tiny* amount compared to the +15K Gold it takes to get to your late game build.\n\nThis argument may have applied when we didn't have a literal limit to the wards we can buy at once, but especially now that they are mediated, this is a pretty poor argument.\n\nBesides that, I imagine the gold saved from not dying, and the gold earned by catching people out with your surplus of vision, will totally make up for the initial cost of wards.","replies":[]},{"poster":"Mecha MaIphite","date":"2015-03-24T21:44:30.044+0000","up_votes":9,"down_votes":0,"body":"Remember that item {{item:3361}} that is pretty much a mini-Sightstone for 250g and no slot?","replies":[{"poster":"taleofsonata","date":"2015-03-25T16:20:26.750+0000","up_votes":1,"down_votes":1,"body":"Remember that its free to use for us but not only that its free gold for their jungler.","replies":[{"poster":"Ariel the Cruel","date":"2015-03-26T04:03:44.850+0000","up_votes":3,"down_votes":0,"body":"I'd rather give him/her 10 gold for the ward, than 100 gold for my head.","replies":[]}]}]}]},{"poster":"Sanguine Law","date":"2015-03-24T16:38:00.557+0000","up_votes":7,"down_votes":0,"body":"I always remind people to pick up trinket upgrades whenever the team is above level 9.","replies":[]},{"poster":"SociopathFriend","date":"2015-03-24T21:36:16.942+0000","up_votes":3,"down_votes":0,"body":"I like my version better\n{{champion:90}} *Visions win battles*","replies":[{"poster":"Only Play Darius","date":"2015-03-24T23:38:37.202+0000","up_votes":4,"down_votes":0,"body":"{{champion:254}} {{champion:14}}","replies":[]}]},{"poster":"LastWildWonder","date":"2015-03-24T19:15:27.760+0000","up_votes":4,"down_votes":0,"body":"when a game starts I usually say \"wards win wars\", but whisper *Squidward *to myself.","replies":[]},{"poster":"Sirin Gioro","date":"2015-03-25T21:23:11.655+0000","up_votes":3,"down_votes":0,"body":"TFW you're support when you're the only one warding...\n{{item:3070}} {{champion:267}} {{item:3070}} \n\nRegards,\nhttp://www.auplod.com/u/daulpo4ff88.png","replies":[]},{"poster":"Wullf","date":"2015-03-25T09:02:42.787+0000","up_votes":3,"down_votes":0,"body":"But type \"upgrade your trinkets\" five times in a game, and no one will.","replies":[{"poster":"DynamicDouchebag","date":"2015-03-25T18:29:51.923+0000","up_votes":1,"down_votes":0,"body":"this ^","replies":[]}]},{"poster":"4nth0l0gy","date":"2015-03-25T02:17:05.980+0000","up_votes":2,"down_votes":0,"body":"My ranked team's support used to have to remind me. Now he and I light up the map without a word about it.","replies":[{"poster":"Ariel the Cruel","date":"2015-03-25T02:37:32.675+0000","up_votes":3,"down_votes":0,"body":"I had a Yolo Q team the other day (I main support).\nWe lit up the map like it was S2. Warding was never brought up, it was simply done.\n\nIt was beautiful.\n*{Insert \"in awe\" face here}*","replies":[]}]},{"poster":"Daedalus871","date":"2015-03-24T18:19:30.761+0000","up_votes":2,"down_votes":0,"body":"When {{item:3361}} got buffed, I bought it every game as soon I could. I was placing like 30 wards a game and they seemed to be good wards too. And then I went on a major losing streak. About 50% of low elo players are allergic to wards.","replies":[]},{"poster":"Takeuchi 17","date":"2015-03-24T17:44:04.985+0000","up_votes":2,"down_votes":0,"body":"i swear in almost all the games i lose as a support I hear one of two things. 'I don't need to ward' (from mid laners and junglers) or 'why arent you warding?' the last one pisses me off so much. I place wards like a mad man and they dont understand I can only place 3 at a time with 1 pink. and when you're behind I can only place so many without risking being caught out by fed enemies.\n\nwards do win games, or at least help increase your chances. more vision = more awareness = more time to collaborate with team = more kills = more objectives = winning","replies":[]},{"poster":"bad arcade kitty","date":"2015-03-24T13:43:29.250+0000","up_votes":3,"down_votes":7,"body":"no, it's damage wins games","replies":[{"poster":"Only Play Darius","date":"2015-03-24T15:46:41.959+0000","up_votes":1,"down_votes":3,"body":"^","replies":[{"poster":"Crate of Cobras","date":"2015-03-24T23:14:38.956+0000","up_votes":2,"down_votes":0,"body":"Or splitpushing, just as readily. Maybe in Bronze, where people literally fuck around in mid waiting to teamfight. But then, the OP is expecting that the people reading this aren't complete fucking gutter trash.","replies":[]}]}]},{"poster":"sp52pi","date":"2015-06-26T22:14:44.292+0000","up_votes":1,"down_votes":0,"body":"Yes, I love it when people ward. I'm still climbing the level ladder, so people typically don't, but I always do. As a jungler, vision is the best thing you can have, and since I jungle, I know firsthand that warding is power.","replies":[]},{"poster":"ChromeFluxx","date":"2015-03-30T05:14:57.076+0000","up_votes":1,"down_votes":0,"body":"I was in my promo's for silver 2 just yesterday, and our nautilus jungle placed multiple vision wards at key locations all throughout the game, Me being thresh support rushing sightstone before targon's brace, I usually place one at tri, river, and the outside of drag pit so that i'll see the blue side entrance, and dragon.\n\nWhen i went to ward these places naut placed a vision ward at drag, so instead i placed a ward at sion's red. We then proceeded to kill sion 3v1, get drag, and then go bot for a double kill.\n\nI'm just now realizing that we probably would not have won that game if he had not warded the first dragon with a sight ward, and that made me ward sion's red.\n\nWards win games. holy shit guys. epiphany, i swear.","replies":[]},{"poster":"ZylotheWolfbane","date":"2015-03-28T20:43:52.725+0000","up_votes":1,"down_votes":0,"body":"You know how there's some silly stuff in the store search bar? Like when playing Cassiopea and looking up 'hat' you find Boots?\n\nThere should be one for wards. If you search 'Victory' 'Win' 'Winning' or 'Knowledge' it should have all the wards/trinkets show up.","replies":[]},{"poster":"Krigjer","date":"2015-03-28T13:40:51.279+0000","up_votes":1,"down_votes":0,"body":"\"Wards win games' was true before they gave us the three ward limit. I often helped win games simply by having everything that was important warded.\n\nNow it's much more difficult. The change to warding and addition of trinkets was supposed to help the entire team share the burden of warding. \nNow I get top laners buying sweeper asap and still yelling at me for not warding enough, or people that just forget to use their trinket/place it in terrible spots.\n\nThe only people in my ELO I see that buy wards are the ones that deserve to be higher anyway.","replies":[]},{"poster":"Llanite","date":"2015-03-26T19:01:41.783+0000","up_votes":1,"down_votes":0,"body":"Confirmation bias.\n\nSince you specifically look for ward, any amount of wards become noticeable and you feel like \"everyone was warding\". Fact is, they ward just as often as they always do.","replies":[{"poster":"Csfuser","date":"2015-03-28T13:25:09.080+0000","up_votes":1,"down_votes":0,"body":"These games weren't confirmation bias. When I can see anyone who goes to do any camp on the enemy side and see where they go from there, that is definitely way more warding than the majority of games where it's only me warding (support main).","replies":[]}]},{"poster":"Ironclad Dragon","date":"2015-03-28T02:36:42.875+0000","up_votes":1,"down_votes":0,"body":"{{item:3362}} This item is awesome. I was afraid to buy this upgrade because you can only place one Vision Ward at a time and they otherwise cost a bit of pocket money, but this thing? Awesome. I never feel restricted when I placed wards with this thing, no red sign cautioning that I'm at my limit. They just reveal enemy wards and by the time they're destroyed, I can place another. It's a great investment.","replies":[]},{"poster":"Sinister Snail","date":"2015-03-26T19:12:37.666+0000","up_votes":1,"down_votes":0,"body":"Even warding badly is better than never warding. As long as you aren't wandering into their jungle alone just to place vision, I'll always appreciate you warding random bushes as you go.","replies":[]},{"poster":"LoRdJeSuS6969420","date":"2015-03-26T06:58:16.759+0000","up_votes":1,"down_votes":0,"body":"Wards also lose games.  It depends on the value you get from them.  If it doesn't tell you much, or you don't actually act based on the information the ward gives you, you just wasted your money.  It's about warding at the right times in the right places.  Warding for the sake of warding is not good.","replies":[]},{"poster":"JimmyNtheKudos","date":"2015-03-26T02:57:58.935+0000","up_votes":1,"down_votes":0,"body":"I always buy pinks and stealth wards, but I forget to upgrade my trinket :(","replies":[]},{"poster":"ObiWan Kenobi","date":"2015-03-25T14:49:32.538+0000","up_votes":1,"down_votes":0,"body":"This is not coincidence:\n\nhttp://www.elophant.com/league-of-legends/charts/tier","replies":[{"poster":"ThePlasticSpork","date":"2015-03-25T15:41:19.962+0000","up_votes":1,"down_votes":0,"body":"I'm actually pretty surprised at how *little* difference there is in wardage from gold-diamond. Maybe plats and diamonds just use the wards they do place better, but in terms of sheer numbers, gold-diamond is almost the same. \n\nStill pretty telling that the line of best fit is moving upwards from bronze - challenger.","replies":[]}]},{"poster":"SmknWdl","date":"2015-03-25T13:31:37.734+0000","up_votes":1,"down_votes":0,"body":"My issue is sometimes ill just go tryhard and buy like 30 wards and have complete vision of the enemy jungle and just counter jungle whenever i feel like and some games ill be like \"I NEED THE EXTRA GOLD\" and go all stingy and buy nothing ;_;","replies":[]},{"poster":"177A Bleecker St","date":"2015-03-25T11:40:40.817+0000","up_votes":1,"down_votes":0,"body":"even when im duoing with my friend and i tell him upgrade your trinket and ward he never does it. no one is bronze ever wards the support doesn't even ward most of the time. i tend to buy tons and tons if wards every game and it isn't enough\n'","replies":[]}]}