{"poster":"blessedbutcursed","date":"2015-10-22T10:57:23.962+0000","title":"Jungler e sightstone.","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Buongiorno a tutti!\r\nGuardando i mondiali mi sono resa conto che su qualsiasi jungler, praticamente, buildavano {{item:2049}}  (e, successivamente, {{item:2045}} ), quindi mi sono venuti dei dubbi: Su quali jungler si builda? Si deve buildare sempre, in qualsiasi caso? &Egrave; worth? Se il team &egrave; indietro si fa comunque? E domande del genere. Vorrei saperne e capirne di pi&ugrave;.","replies":[{"poster":"blessedbutcursed","date":"2015-10-24T17:44:00.625+0000","up_votes":1,"down_votes":0,"body":"E su Vi si può fare oppure no?","replies":[]},{"poster":"Tankerous","date":"2015-10-23T21:56:37.951+0000","up_votes":1,"down_votes":0,"body":"Beh, alto elo o basso elo, su {{champion:64}} è utilissima.","replies":[]},{"poster":"PolloPowa","date":"2015-10-23T21:31:44.075+0000","up_votes":1,"down_votes":0,"body":"Io la trovo  utile molto spesso,ma evito di farla su champ il quale se fai 2 oggettini da danno in più si sbilanciano totalmente.\n\nsu lee dipende come mi sento,conviene sempre perchè puoi wardare jumpare e usare il trinket rosso per levare le ward..ma francamente ci sono game in qui vado completamente full glass cannon fregandomene con i mobility e il trinket evoluto via,\n\nè potenzialmente worth quando intendi counterjunglare i buff nemici costantemente","replies":[]},{"poster":"kirchhoff","date":"2015-10-22T20:12:14.430+0000","up_votes":1,"down_votes":0,"body":"I l'ho visto fare su: {{champion:64}} {{champion:60}} {{champion:113}}","replies":[]},{"poster":"One Tax Man","date":"2015-10-22T11:32:06.806+0000","up_votes":1,"down_votes":0,"body":"È un oggetto di utility : in SoloQ è troppo rischioso. In un ranked team dove sai con chi stai giocando è molto utile (WWG , ricordatelo) , ma da solo non ti puoi affidare agli altri..","replies":[]},{"poster":"Quocka","date":"2015-10-22T11:27:38.219+0000","up_votes":1,"down_votes":0,"body":"Ti parlo da ci in giungla ci va sempre quando è possibile, avendo bisogno di visione purtroppo non si può contare sul povero supporto che va in giro a piazzare ward da solo quindi la scelta più ragionevole è buildare la sighstone anche su un altro campione e a rigor di logica viene in mente il jungler per vari motivi:meta dei tank(quindi bisogno di salute),è quello che va in giro di più sulla mappa e ha bisogno di visione per i suoi spostamenti,un adc o un mid hanno bisogno di danno e sacrificare una slot per la sighstone piuttosto che per un altro strumento che ti dia potere magico o attacco ingenti non è un buon compromesso,il top laner sta su nel suo mondo e si fa vedere per lo più in tf quindi non potrebbe andare in giro a wardare,ecco perchè la si fa sul jungler.\nLa visione è importante quindi worth non credo alla fine il compito del jungler non è principalmente carriare la squadra con tonnelate di danni ma aiutare le lane,fare pressione e si dare visione e controllo sugli obbiettivi come il drago e il baron,io personalmente la buildo sempre(dopo l'oggetto da giungla) e sento davvero tanto le differenze da quando non la facevo ad adesso.","replies":[]},{"poster":"EmptyHole","date":"2015-10-22T11:23:34.666+0000","up_votes":1,"down_votes":0,"body":"Secondo il mio parere, la fanno perchè muovendosi in giro per la mappa possono mantenere wardata la jungla avversaria grazie al top/jungler, e la bot/jungla grazie al support/mid, e considerando che in team si vince sapendo dove sono i nemici per andargli addosso in settordici ci sta che il jungler compri la sightstone, PERO', io credo che in soloQ non ne valga la pena, avere l'utilità della sighstone senza che gli alleati siano organizzati non ha senso, se invece giochi in team potrebbe starci.\n\nQuesto secondo me eh...","replies":[]},{"poster":"Frattaglia","date":"2015-10-22T11:21:33.590+0000","up_votes":1,"down_votes":0,"body":"Si builda nelle team ranked di alto livello, di solito non in soloQ.\n\nLa buildano perché su un jungler da utilità permette di avere più visione sulla mappa, cosa fondamentale in ranked team soprattutto ad alto livello.\n\n\nIn normal o soloQ la sightstone va bene solo su Lee Sin :P","replies":[]},{"poster":"Whommy","date":"2015-10-22T11:03:39.384+0000","up_votes":1,"down_votes":0,"body":"generalmente su jungler tank con mobility (reksai, jarvan, gragas,...) se si ha necessità di ulteriore visione o banalmente su lee sin.\npuò sostituire un oggetto HP anche se non da stats aggiuntive","replies":[]}]}