{"poster":" Mýself","date":"2019-03-09T00:49:01.673+0000","title":"Como uso la E de yasuooo??","subforum":"Jugabilidad, balance y narrativa","up_votes":3,"down_votes":0,"body":"Vi que algunos jugadores muy buenos con ese champ tiran la E demasiado rapido si deslizan libremente a mi tambien me sale pero en algunas partidas :c y otras no.","replies":[{"poster":"SrShadowSenpai","date":"2019-03-09T01:00:45.028+0000","up_votes":3,"down_votes":0,"body":"Vive en la ignorancia, lo último que queremos es otro main yasuo...{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Less Zero","date":"2019-03-09T18:51:53.087+0000","up_votes":1,"down_votes":0,"body":"La E de Yasuo puede usarse de muuucha formas, para tradear, escapar, esquivar o acercarse. En fase de líneas se usa para esquivar habilidades importantes y tradear con el combo E+Q/AA+E retrocediendo asi vas desgastando toda la linea, después en teamfight puede usarse para surfear por el team enemigo haciendo dificil que te focuseen fácil. Lo de usar la E muy rápido se debe a que está maxeada o no, la E a lvl 1 tiene 0.9 s de cd y a lvl 5 tiene 0.1 y creeme que esa diferencia se nota muchisimo(aparte la e a lvl 1 no puede usarse en el mismo target durante 10s y la e a lvl 5 solo durante 6), lo que yo suelo hacer es ponerle 4 pts a la e y después todo a la q. También podes usar la e para pasar paredes targeteando un pj o un campamento de la jungla","replies":[]},{"poster":"HopelessRomantic","date":"2019-03-09T01:24:28.774+0000","up_votes":1,"down_votes":0,"body":"Quick-cast y maxeando la E primero, le reduce el cd para castear E otra vez en otro objetivo.\nhttps://leagueoflegends.fandom.com/wiki/Yasuo","replies":[]},{"poster":"Excorpion","date":"2019-03-09T01:03:07.932+0000","up_votes":1,"down_votes":1,"body":"- Durante las líneas\nEn fase de líneas utiliza el CS para acercarte o alejarte, especialmente luego de que el enemigo use su habilidad principal. Puedes acercarte usando los minions, y atacar con Q, para luego alejarte usando otros minions.\nEsto se repite bastante hasta poder usar la R y matar al otro.\n\n- Durante las TeamFights\nUn tanto más complejo, dependiendo de la zona, puedes usar a los champs como los minions y meterte en medio o asediar a uno solo (focusear). Lo ideal es siempre agarrar a varios con la Q para ultearlos con la R.\n\nEso es lo más básico de Josue.","replies":[]}]}