{"poster":"Dodge my critic","date":"2017-01-02T12:53:54.339+0000","title":"Trolls, afk, gente toxica. Dejar de jugar?","subforum":"Charlas Generales","up_votes":1,"down_votes":1,"body":"Buenas, es mi primer post y quiero alguna respuesta, porque sinceramente ya directamente pierdo mi tiempo jugando, en varios casos me replanteo aguantar y no decir nada, intentar carrear o intentar persuadir para que coopere el equipo, el cual desafortunadamente termina flameandome y haciendo todo lo contrario que ayudar. En este caso me toco un duo, el cual tengo un support que pickea adc, avisando en picks y ban que va a pickearlo (flameando a todos) tengo un jungla que tambien me flamea en el juego temprano sin motivos. Tengo a mi equipo en contra, por motivos incoherentes. Entonces, en estos casos te colma la paciencia viejo, yo entiendo que la gente tenga malos dias y malas partidas y todas las excusas, pero que hago si tengo que perder elo por estas personas? toca cerrar la boca y aguantarse los 30 minutos (porque no aceptan el ff) y listo, porque si yo quiero subir tengo que aguantar esta clase de personas fastidiosas, las cuales reportas y en cuestiones de 5 horas te responden en tu reporte ( respuesta predise&ntilde;ada del administrador) que estan haciendo lo posible y bla bla bla, quedando en la nada el reporte. Me parece injusto dejar de jugar por esta clase de gente, pero si esto no cambia abandono todo y listo. (EJEMPLO)   \n {{item:3070}} {{item:3136}}\n   https://gyazo.com/00cfe3483c3ef7d26f9b4d1a2b830e44","replies":[{"poster":"9081913DEL1","date":"2017-01-02T13:02:12.964+0000","up_votes":2,"down_votes":1,"body":"Es una pena.\nAclaro algo por las dudas, lol es un juego de equipo, pero tu solo manejas un campeon.\nTu maximo desempeño es cumplir bien tu funcion, para carrear o no tienes que partir de cumplir con tu rol. \nEsto va de la mano con ser un buen jugador, siendo idealistas tu solo deberias hacer lo correcto sin importar el equipo que te toque, ni mires al resto, si tienen una actitud negativa o positiva tu solo puedes hacer tu parte.\nEs cierto si todos jugaran correctamente seria mas ameno, pero aun si esto no se da puedes hacer tu parte y ser mejor jugador, al fin y al cabo, si juegas correctamente y tratas de superarte a ti mismo, subiras y dejaras atras a esa gente.\n\nOtra cosilla, puedes evitar malos ratos jugando en equipo con amigos.\n\nSaludos.","replies":[{"poster":"Dodge my critic","date":"2017-01-02T13:05:59.285+0000","up_votes":1,"down_votes":1,"body":"Obviamente, llegue a platino, no me considero buen jugador, tengo buenas mecanicas y se que me cuesta mucho el desarrollo de objetivos, pero se torna muy frustrante el hecho de recibir penalizaciones por simplemente un duo que se desquita contigo, el simple hecho de tratar de jugar para mejorar es imposible por alguien que te madea desde la seleccion. Saludos","replies":[{"poster":"9081913DEL1","date":"2017-01-02T13:40:40.112+0000","up_votes":2,"down_votes":1,"body":"Jugar para mejorar es enfocarte en TU desempeño, se que siempre aclaro que es un juego de equipo, pero el equipo es formado por los 5. \nPara mejorar tenes que aprender a jugar de manera coordinada y aprender a susbsistir a pesar de la contra que te puedan hacer.\nSi son 3 vs 7 pues juegas 3 vs 7. Cuando te toque una 5 vs 5 la capitalizaras seguro. Eso es enfoque. No quita que esta muy visto flammers, feders trolls y demas. \nPero tu mismo eres el ejemplo, hay gente en bronce que se queja que no puede salir por los demas, ya en platino sabras que tu puedes hacer mucho por tu propio elo, de ahi en adelante es igual de valido. (Llega un punto que deberas tener una buena racha para subir) Incluso en challenger si te tocan malos equipos bajaras lps, pero no asi tu nivel. \n\nMi consejo es sencillo, esto en general es para platas y bronces pero funciona igual siempre, si alguien esta flammeando fedeando etc, tienen actitud negativa, lo que hay que hacer es ignorarlos, si los podes usar bien, pero acordate que no son confiables, si los ignoras, si jugas como si no estuvieran ves realmente lo que tenes enfrente y que podes hacer.\n\nMuchos cometen el error de esperar algo de alguien que esta siendo toxico, esto es un juego de equipo, si juntas 5 personas tenes un grupo no un equipo, el equipo son los que esten tratando de juagr para ganar, aquellos en los que vas a confiar para tus plays, cuantas veces te mandaste y el toxico te dejo solo? cuantas veces le dejaste la kill y se puso a bailar, cuantas veces te baiteo el heal, es una cuestion erronea poner la confianza en alguien que en ese momento es un enemigo mas.\n\nSaludos.","replies":[]}]}]},{"poster":"xaerials","date":"2017-01-02T19:02:53.568+0000","up_votes":1,"down_votes":0,"body":"Hola invocador. ¿Podrías reubicarlo en la sección \"Comportamiento del jugador\"?. Arigato de ante mano :)","replies":[]}]}