{"poster":"Worbid","date":"2015-07-08T16:37:33.485+0000","title":"Suche geduldigen und freundlichen Midlanecoach","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo geehrte Beschw&ouml;rer,\r\n\r\nmein Name ist Worbid und ich spiele leidenschaftlich gerne LoL. Ich war Season IV Gold und bin nun Silber II ( Promo SI ). Ich spiele meistens Jungle oder Top w&uuml;rde aber liebend gerne Main-Midlaner werden. Dazu suche ich vor allem jemanden, der mich Coachen kann und mir Tricks und Trips auf den ein oder anderen Champion zeigt. Ich w&uuml;rde auch gerne meinen Skill verbessern, weshalb ich gerne im freien Spiel auch 1v1 Matchs austragen w&uuml;rde, da mir die dauernde Suche f&uuml;r Teambuilder zu lange dauert. Deshalb suche ich eine Art Meister^^, der mich anleitet und sein Wissen mit mir teilt.\r\nIch hoffe ich habe euer Interesse gewegt\r\nMit freundlichen Gr&uuml;&szlig;en \r\nWorbid","replies":[{"poster":"Kashiwa","date":"2015-07-08T16:42:32.964+0000","up_votes":1,"down_votes":2,"body":"an sich kann man niemanden \"beibringen\" auf der midlane zu spielen. es ist einfach nur eine sache der erfahrung in verschiedennen matchups. du musst, genauso wie in den anderen rollen wissen, wann dein champ viel schaden macht und wann nicht/du dich zurückziehen soltest. Klar, kann man ein paar Tipps geben, zb unterscheidet sich Midlane von der Toplane um einiges, da man auf einer kurzen Lane mit sehr vielen ein/aus-gängen arbeitet. Deshalb ist ward coverage sehr wichtig. außerdem darf man niemals zeit verschwenden und immer auf seinen kontrahenten achten, da man entweder ihm bei einem roam folgen muss oder den turm nimmt. ich selbst würde nicht behaupten dass ich der perfekte midlaner bin aber falls du fragen hast kannst du sie mir ruhig stellen :)","replies":[{"poster":"Droggy","date":"2015-07-08T18:35:28.084+0000","up_votes":2,"down_votes":0,"body":"Was denis behauptet hat ist zum grötenteil unsinn.\nNatürlich kann man jemandem etwas beibringen, es gibt sogar jede Menge zu beachten, das er sagt das soetwas nur eine sache der erfahrung ist zeigt eigentlich nur das er selber nicht sehr erfahren ist.\nWard coverage ist z.b. in einem 1v1 in der midlane größtenteils unwichtig.Wichtig wird es erst wenn der gegnerische Jungler präsenz zeigt.Und das nur beispiele fürs roamen und pushen genannt wurden zeigt ebenfalls das er die midlane nicht richtig beherrscht.Sachen wie Lane-manipulation sind , gute CS'ing methoden ,gute recalls setzen, und vorallem das salvagen der gegnerischen fehler sind punkte die angesprochen werden müssen.Ich empfehle dir (falls du der englischen sprache mächtig bist) das du dir die Videos von \"lastshadow9\" auf youtube ansiehst.Er ist der coach von team gravity und lädt die coaching sessions hoch die er mit diamant spielern durchführt.(schau dir die videos mit azoh an , dort werden midlane mechanics gut erklärt.","replies":[]},{"poster":"Tabi","date":"2015-07-08T16:48:13.812+0000","up_votes":1,"down_votes":0,"body":"Ich denke du hast sein Anliegen nicht ganz verstanden. Er möchte nicht irgendwelche Fragen stellen oder die Grundtechniken der Midlane erlernen, sondern wohl eher mit Jemanden, vor allem im 1 vs 1, zusammen trainieren, um so feststellen zu können wo er Nachholbedarf hat und wo er dran arbeiten muss. Sowas bekommt sehr schlecht nur mündlich hin.","replies":[{"poster":"Worbid","date":"2015-07-08T16:50:04.711+0000","up_votes":1,"down_votes":0,"body":"Genau :D","replies":[{"poster":"PugnatoreRex","date":"2015-07-08T17:43:02.656+0000","up_votes":1,"down_votes":0,"body":"Könnte dich coachen wenn du willst","replies":[]}]}]}]},{"poster":"Worbid","date":"2015-07-08T18:57:07.888+0000","up_votes":1,"down_votes":0,"body":"Ersteinmal ein dickes Danke, da sich so viele hilfsbereit gemeldet haben.\nIch habe jedoch jetzt jemanden gefunden, denke ich, der mir sehr gut bei meinem Problem helfen kann. \nSollte ich weitere hilfe brauchen, melde ich mich aber ansonsten schließe ich erstmal diese Diskussion\nEuch noch viel Erfolg in der Kluft","replies":[]}]}