{"poster":"DuckHunt","date":"2016-03-07T15:54:07.004+0000","title":"Acoso por seleccionar a Teemo","subforum":"Comportamiento del jugador","up_votes":43,"down_votes":11,"body":"Me ha tocado muchas partidas en las cuales cuando pickeo a Teemo me insultan a mas no poder, me trolean las partidas, me dicen cosas constantemente de porque lo elijo, hasta tal punto de que empiezan a meterse conmigo mismo a mas no poder.\r\nNo entiendo el grado de infantilidad que hay en esta comunidad con respecto a la selecci&oacute;n de este campe&oacute;n, entiendo que cada vez hay mas pubertos rondando sin educaci&oacute;n, y entiendo que existe el mute all, pero si elijo a Teemo es porque me gusta jugar con el y se termina la discusi&oacute;n ah&iacute;, en todas las partidas tengo que soportar ese terrible acoso que por m&aacute;s que termine muteandolos, ya es inaguantable la situaci&oacute;n. Lo peor de todo, es que me llueven los reportes por mas que salga 15/0 y haya tirado todas las torres y el nexo enemigo.\r\nNo solo la lluvia de reportes si no que Riot ya me dio dos sanciones disciplinarias por defenderme de esta gente porque no puedo dejar que me digan cualquier cosa todo el tiempo. Esta comunidad esta demasiado podrida y todos creen que son buenos, todos creen que si no hacen lo que ellos dicen se enojan y te la trolean o te insultan, nunca va avanzar esta comunidad porque las sociedades aca en el cono sur tambi&eacute;n son as&iacute;, creen que pueden hacer lo que quieren con quien quieran, y no solo eso si no que la mayor&iacute;a son ni&ntilde;atos de 14 a&ntilde;os que no saben que del otro lado hay gente mayor de edad que sinceramente no esta para aguantar pavadas. Si van a comentar este post que sea con sentido alguno y sin venir a creerse la gran cosa o el papi filosofo que viene a llevarme la contra. Lo que digo tengo much&iacute;sima raz&oacute;n, y los que juegan con Teemo saben muy bien lo que estoy diciendo.\r\nY por las sanciones, me cans&eacute; de denunciar en support.riotgames.com todos los que hacen eloboost, que supuestamente esta prohibido pero nunca les hacen nada, porque veo el historial y juegan todos los d&iacute;as, en cambio si te llueven los report por jugar con Teemo te sancionan en un parpadeo.","replies":[{"poster":"StraLiXs","date":"2016-03-07T17:56:19.403+0000","up_votes":6,"down_votes":0,"body":"Una lastima, no creo que Riot quiera gastar $5 de sus €5.00000000000000.00000000000000 (aclaro que esto ganan al segundo) en un administradores que vean las partidas y elijan bien a quien sancionar. \n\nA mi también ya me han sancionado varias veces los bots automatizados por no se... por comerme 5 reports de una premade y no decir nada durante el juego. Por decirle para de trollear a esa ratita que va 0/15 que no para de suicidarse en la torreta enemiga y encima se enoja y te dice de todo, llegan sus premade a defederlo y entre todos dicen en /all report [campeón que uso] por \"flamer\". \n\nUna asco el sistema de reportes. Y un asco la comunidad.","replies":[]},{"poster":"Yinsufu","date":"2016-03-08T13:30:55.367+0000","up_votes":3,"down_votes":4,"body":"Aguantatela pa, y si no mutealos, ¿que tenes 12 años? como te afecta lo q te digan pibitos a traves de internet","replies":[{"poster":"DJ Peligro","date":"2016-03-08T17:09:30.482+0000","up_votes":5,"down_votes":0,"body":"No es eso, lo sancionaron dos veces sin motivo","replies":[{"poster":"Icesoul","date":"2016-03-09T01:13:30.282+0000","up_votes":1,"down_votes":0,"body":"A mi me acaban de sancionar sin motivos, da bronca que la supuesta justicia que hay les sirva a los toxicos mas que a las personas decentes. Yo ya no voy a hablar mas en el chat, voy a mutear a todos siempre y juego, porque sino no se disfruta el juego y si hablas o lo que sea, te reportan igual, porque si nomas, es más, no se si voy a dejar de jugar por esta gente porque ya me tienen re podrido.","replies":[]}]}]},{"poster":"Rock the Climber","date":"2016-03-08T12:24:57.646+0000","up_votes":3,"down_votes":0,"body":"a mi me pasa lo mismo cuando juego con karthus, o me dicen que hace tiempo que no lo ven o que me lo saque y elija otra cosa. Lamentablemente la comunidad es así, les gusta ver lo mismo de siempre en todas las partidas y le temen a lo poco visto.","replies":[]},{"poster":"FacuArmo","date":"2016-03-07T22:09:01.952+0000","up_votes":3,"down_votes":0,"body":"Me considero a mí mismo un fanático y jugador activo y decente de Teemo, sinceramente, debo decir que tienes razón. Es imposible jugarlo sin que te insulten, no hay forma. Simplemente lo pickeas y ya comienza el flameo...\n\nCreo que es hora de darnos cuenta de lo que es esto:\n\n_**UN JUEGO**_\n\ny nada lo cambiará.\n\n-----------------------\n\n{{sticker:slayer-jinx-wink}} \n\n¡Saludos!","replies":[{"poster":"osxu","date":"2016-03-08T17:11:22.178+0000","up_votes":1,"down_votes":3,"body":"Por que todos los que tienen Teemo con mucha masterie y comentan son máx. Oro? Es un champ que no rinde. Por eso la gente se queja. Obviamente no estoy justificando el lado de los insultos/acoso, eso no deberia darse en ningun caso, pero es feo perder partidas por gente que hace picks que no estan rindiendo (teemo, taric, yorick, por ejemplo)... Pickeen cosas que rindan y que den buenos resultados y la gente los va a tratar bien. De todas formas repito que no deberia haber insultos ni nada por el estilo, pero es lo que hay","replies":[{"poster":"angeloide","date":"2016-03-09T02:03:53.291+0000","up_votes":2,"down_votes":1,"body":"wtf, te das cuenta que tu comentario no tiene ni medio sentido? no rinde? hay una ley que es la de \"si esta ahi, por que no pickearlo\" Taric no rendir? que TU no lo sepas usar es otra cosa. Quien te da el poder a vos de que elijan los que vos quieras? la gente lo va a tratar bien? dios mio, no puedo leerte, me da tanta rabia ver lo que pones que me dan ganas de irme corriendo a pegarte un cacheton en la cabeza bolu2... no podes tener ese pensamiento.","replies":[{"poster":"Beonor","date":"2016-03-10T12:32:18.181+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"angeloide","date":"2016-03-10T15:17:57.783+0000","up_votes":2,"down_votes":0,"body":"vos y el otro niñito tienen la culpa de que la comunidad, sea un asco. Vos me vas a decir que puedo pickear o que no puedo pickear? pero andate bien a la mismisima m****","replies":[{"poster":"FacuArmo","date":"2016-03-23T00:21:26.895+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=angeloide,realm=LAS,application-id=PJAKt7ph,discussion-id=G61v6gLW,comment-id=00190000000000000000,timestamp=2016-03-10T15:17:57.783+0000)\n>\n> vos y el otro niñito tienen la culpa de que la comunidad, sea un asco. Vos me vas a decir que puedo pickear o que no puedo pickear? pero andate bien a la mismisima m****\n\nHonores.\n\n¡Saludos!\n\n{{sticker:slayer-jinx-wink}}","replies":[]}]}]}]},{"poster":"park224","date":"2016-03-09T22:10:58.827+0000","up_votes":1,"down_votes":0,"body":"Ahi estas dejando en claro que es inservible solo porq es teemo , Mira si a vos te rinde teemo jugalo porq si lo jugas bien (De que te sirve jugar cosas que no sepas usar), ya sea taric , yorick son champ que estan fuera del meta pero por chaboncitos que vean que es mal pick si a vos te rinde jugalo si en todo caso vas a ganar y tratar de carrear de la misma manera , Son champs que utilizamos ¿y si estan en la lista de champ porq no usarlos ? ¿Acaso es una ley ? \n\nNo, Aprende que por mas que este fuera del meta si vos lo sabes usar y te rinde podes ganar todas las rankeds y llegar a master en 1 segundo. \n\nA mi parecer no tiene sentido tu comentario pero bueno, Tengo un amigo que le gusta usar teemo y solo por jugarlo (Le tengo que decir que no lo juegue porq es un champ sin ninguna fase le linea) , Esta actitud no se les dice a personas a la cual les gusta un champ por tal motivos, Pero como aveces digo esta comunidad aveces puede ser muy mala en sentido de acoso.\n\n\nSaludos espero que retomes tus ideas y comentar de buena forma {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]},{"poster":"Haviforg","date":"2016-03-08T02:59:56.047+0000","up_votes":4,"down_votes":1,"body":"No cambies de champ, si te molestan  \"mute all\". Sino, la otra es \"mute all\" desde el principio de la partida y concentrarte de esa manera y solo usar las señales. Lamentablemente es asi. Es injusto, si. Es la unica solucion? A mi me parece que si. Suerte con Teemo {{champion:17}} nuestro super tejon que todos si o si deberiamos querer un poquito","replies":[{"poster":"matutes1","date":"2016-03-09T17:41:46.636+0000","up_votes":1,"down_votes":0,"body":"Teemo its sempai YOLO {{champion:17}} {{summoner:4}}","replies":[]}]},{"poster":"juuby","date":"2016-03-07T15:58:36.301+0000","up_votes":1,"down_votes":8,"body":"me pasa lo mismo cuando me pongo a teemo jg u_U pero lo que no saben es que soy bueno con el en la jg D:","replies":[{"poster":"lordeman10","date":"2016-03-07T16:18:16.390+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=juuby,realm=LAS,application-id=PJAKt7ph,discussion-id=G61v6gLW,comment-id=0000,timestamp=2016-03-07T15:58:36.301+0000)\n>\n> me pasa lo mismo cuando me pongo a teemo jg u_U pero lo que no saben es que soy bueno con el en la jg D:\n\npasa que dejo de ser viable cuando le quitaron el tiamat","replies":[{"poster":"juuby","date":"2016-03-07T17:31:50.837+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=lordeman10,realm=LAS,application-id=PJAKt7ph,discussion-id=G61v6gLW,comment-id=00000000,timestamp=2016-03-07T16:18:16.390+0000)\n>\n> pasa que dejo de ser viable cuando le quitaron el tiamat\n\nmalditos insensibles le sacaron la tiamat :c","replies":[{"poster":"resnov15","date":"2016-03-07T19:19:16.363+0000","up_votes":2,"down_votes":0,"body":"Volvere...ya lo veran {{champion:17}} {{item:3077}}","replies":[]}]},{"poster":"matutes1","date":"2016-03-09T17:42:59.274+0000","up_votes":1,"down_votes":0,"body":"Esta viable me puedo mandar un dragon yo solo con teemo","replies":[{"poster":"lordeman10","date":"2016-03-09T18:00:24.364+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=matutes1,realm=LAS,application-id=PJAKt7ph,discussion-id=G61v6gLW,comment-id=000000000002,timestamp=2016-03-09T17:42:59.274+0000)\n>\n> Esta viable me puedo mandar un dragon yo solo con teemo\n\nhasta que no lo use un asiático dudo que sea considerado un pick serio xD","replies":[]}]},{"poster":"Sir Crucifix ","date":"2016-03-07T17:06:44.598+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=lordeman10,realm=LAS,application-id=PJAKt7ph,discussion-id=G61v6gLW,comment-id=00000000,timestamp=2016-03-07T16:18:16.390+0000)\n>\n> pasa que dejo de ser viable cuando le quitaron el tiamat\n\nEl nuevo guinsoo se lo crearon para teemo ,es como viktor con su arma personal","replies":[{"poster":"Frank295","date":"2016-03-08T02:04:22.302+0000","up_votes":1,"down_votes":0,"body":"El problema, que la Guinsoo se carga con 8 básicos (al 9 recién aplica su pasiva)... Nerfeo indirecto a Teemo (?","replies":[]}]}]}]},{"poster":"Sir Crucifix ","date":"2016-03-07T17:03:17.577+0000","up_votes":2,"down_votes":0,"body":"Cuando el noob de faker pickee a teemo , será god tier  y serás aceptado como jugador normal","replies":[]},{"poster":"Alcheon","date":"2016-03-07T16:28:43.478+0000","up_votes":2,"down_votes":0,"body":"Ami me paso algo similar con malzahar JG lo mejor es cuando vos vas 11/1/8 y igual te van a reportar por que para ellos vos sos el que cago la partida, aunque los demas mueran al minuto 3 y te echen la culpa ati, yo normalmente no les contesto y si lo ago es cuando se pasan de la raya y me voy de boca.","replies":[]},{"poster":"lordeman10","date":"2016-03-07T16:16:49.904+0000","up_votes":2,"down_votes":0,"body":"suele pasar me acuerdo que una vez se me dio por mainear teemo y llegue a tener un ban de chat jajaja y eso que soy re tranquilo pero cuando se metian con el teemo nono","replies":[]},{"poster":"warrior530","date":"2016-03-07T16:07:13.168+0000","up_votes":2,"down_votes":0,"body":"la verdad nose porque se considera teemo como un troll, tambien me ha pasado que empiezan con\nNOOOO TEEMO NOOO NOOB PLSSS REPORT \nASCO COMO VAS TEEMO\nDAT TROLL\nGG NO TOP TROLL\n\nY te reportan cuando son ellos los que estan trolleando\n\nahora me gustaria pedir que runas y maestrias usas con teemo\ngracias n.n","replies":[]},{"poster":"Cachorro Castaña","date":"2016-03-08T08:01:03.104+0000","up_votes":3,"down_votes":1,"body":"Ha de ser por la calor","replies":[]},{"poster":"Squealer","date":"2016-03-08T00:48:20.253+0000","up_votes":3,"down_votes":1,"body":"Siempre que me toca un Teemo es derrota segura y si me toca en contra estoy seguro que le gano la línea. En tf es casi un 4c5 porque necesita un terreno preparado y poner los hongos estratégicamente pero que a la vez no sean predecibles, y para llevarlo de AD hay personajes que hacen lo mismo pero infinitamente mejor, Vayne por ejemplo. Simplemente está fuera de meta, ahora de ahí a flammear es un problema de la comunidad que se cree challenger y que paradójicamente se quejan de que LAS está lleno de mancos y flammers, muy irónico todo.","replies":[]},{"poster":"Emma Mirra","date":"2016-03-07T16:14:31.456+0000","up_votes":3,"down_votes":2,"body":"Si trolean, si flamean, solo queda reportarlos. No ganas nada descargandote en el chat. \nY si lo haces, te pones a su mismo nivel ante Riot. Es muy simple.","replies":[{"poster":"DuckHunt","date":"2016-03-07T16:25:33.223+0000","up_votes":1,"down_votes":0,"body":"Después de pasar muchísimas partidas con Teemo, y aguantarte todas las colas de selección de campeon, dodgeando etc,para evitar el flameo, juegos sin ayuda del equipo, y un sin fin de actitudes odiosas por parte de la comunidad, me parece que tu paciencia termina, todos tenemos un limite y ese criterio sobrevalorado de mute/win ya lo escuche cientos de veces, y no siempre es la solución, juegue 5 partidas seguidas con Teemo y se dará cuenta de lo que le estoy diciendo, lo invito a que pruebe hacer el intento. He ganado partidas porque llevé el equipo al hombro, y muteados o no muteados podes ver la actitud de los invocadores que no se te acercan a tu linea por mas señales que tires por el echo de que pickeaste un supuesto campeon troll al cual la comunidad le tomó odio, solo puedo jugar en equipo en las TF porque yo me acerco y quiero ganar. Y quiero saber porqué tengo que aguantar tal acoso a elegir ese campeón? me parece que tu comentario es pobre y monótono.","replies":[{"poster":"Emma Mirra","date":"2016-03-07T20:07:57.212+0000","up_votes":3,"down_votes":1,"body":"Todos vienen con un motivo de que no aguantan mas el acoso (flameo, afk, trolleo) , Y la verdad no se si esperas una respuesta de qué se puede hacer o si solo queres desahogarte y que otros te acompañen en el sentimiento. Si es lo ultimo, está bien, que se yo. Pero si es lo primero, solo queda reportar, y por eso te resulta monotono... Tu post tambien es monotono quejandote de la gente toxica que existe. Y a la vez es unico. He jugado partidas con Teemo's en mi equipo... NUNCA les hicieron problema por el solo echo de elegirlo. \nDecis que ganas porque te llevas el equipo al hombro ¿cuando perdes es porque los demas jugaron mal? Eso siempre se lee. \nSuerte...","replies":[]}]}]},{"poster":"rokushoger","date":"2016-03-07T16:39:51.300+0000","up_votes":3,"down_votes":1,"body":"Totalmente de acuerdo, el tema que se asoció a teemo con los trolls porque antes era moda usarlo con revivir y teleport y todos los trolls pickeaban eso, pero no se puede juzgar a cada persona que lo usa con que sea troll solo por pickearlo XD. En fin, te entiendo totalmente, pero no deberías responder a los insultos, y más si sos mayor de edad, deja que los niños hablen como niños y tu como adulto mutealos y seguí tu vida, porque de otro modo te van a sancionar a vos también.\nTambién te recomiendo que no digas lo de que sabés que tenés muchísima razón, porque si bien la tenés, aquellos que no simpaticen con lo que dices se van a agarrar de eso para tirarte abajo (porque no tienen otra cosa).\nBuena suerte y que te toquen mejores partidas!","replies":[]},{"poster":"tobias19","date":"2016-03-07T18:56:27.419+0000","up_votes":4,"down_votes":2,"body":"Así es LAS, flamean a los Teemos, pero hay un Zed, Yasuo, Vayne, Lee, Riven y todos esos noobchamps en cada partida y nadie les dice nada...","replies":[{"poster":"EdxxEdxx","date":"2016-03-07T19:13:13.137+0000","up_votes":1,"down_votes":3,"body":"zed no es tan facil como se cree toda la comunidad, yasuo es mas jodido en ciertos aspectos, igual de dificil, vayne cualquiera sabe spamear click derecho y matar, nadie sabe como posicionarse bien mas que los buenos jugadores, lee es el segundo campeon mas dificil del juego segun una encuesta que se le hizo a la comunidad entera, riven otra mas, todos saben spamear skills y matar, yo puedo spamear skills de volibear y matar, cosa muy distinta es aprender a cancelar animaciones para resetear basicos, hacer los combos, saberse el tiempo que toma dar el salto del stun para matar a alguien bajo torre haciendo un baiteo. ninguno es noob champ, noob champ son todos mejor dicho, ya que cualquier campeon puede ser spameado y matar a alguien. si alguna vez te encontras un yasuo realmente bueno, te vas a dar cuenta, y vas a decir: \"mierda, este si es bueno de verdad\". con respecto a teemo, la verdad da asco como flamean no voy a mentir. pero no tanto el flameo, mas bien es la actitud. yo tengo maestria 5 con teemo hace mucho porque la primera vez que lo use me gusto bastante sus habilidades. actualmente aprendi que teemo no es solo spamear la Q para pokear a lo estupido, tirar setas en tu culo por si las dudas etc, etc. teemo es como cualquier otro, todo el mundo gasta la Q para pokear, y la Q es para defenderte si te quieren hacer un all-in, las setas son wards, WARDS, y si queres hacer un buen trade, a nivel 2 de las setas, usarlas contra minions para que exploten y pokear. una vez perdi linea y partida con teemo en top, contra una illaoi (cuando recien salio), pedi ayuda mil veces, iba 1/3 mas o menos. que paso? \"naa sos teemo no te voy a gankear\"-jg   \"sos teemo, nadie te quiere :v\"-mid  \"jajaja un teemo pidiendo ayuda\"-adc  \"voy\"-supp\nSi, un blitzcrank, el unico que me quizo ayudar y no pudo porque todos los demas le dijeron que se quedara con el adc, que sino se iba report.","replies":[{"poster":"Hexplosivo","date":"2016-03-07T22:09:48.213+0000","up_votes":1,"down_votes":0,"body":"Por favor compadrito, cuando alguien dice que esos campeones son noobchamps definitivamente no habla del grado de control que hay que tener para ser bueno con ellos, sino del porcentaje de los jugadores que son realmente malos detrás del teclado pero que solo subsisten porque el campeón es lo suficientemente poderoso de por sí como para no fallar.\nDefinitivamente los campeones mencionados son un infierno de DOMINAR, pero mucha gente sin habilidad los juega igual solamente por la calentura de ver a los profesionales jugarlos, y como NO tienen el grado de DOMINIO que tienen ellos, se frustran, atacan e insultan al resto de su equipo con excusas baratas como:\n\"Ustedes tienen que darme todo en bandeja de plata para que este campeón funcione\" -Mil Jugadores de Vayne.\n\"Report al jungla que no me ha hecho baby-sitting contra mi rival\" -Mil Jugadores de Yasuo.\nTodos saben eso; no es el campeón que sea fácil, sino que el jugador promedio que lo juega es un noob de por sí.\nDr. Mundo es un campeón fácil, y abusivo, por eso sacó unos win-rates celestiales hace un tiempo y hubo que nerfearlo; todos saben que este no es el caso de Rengar o Zed que de hecho tienen win-rates bajos precisamente por lo que dice Tobias, porque son campeones USADOS por noobs.","replies":[{"poster":"EdxxEdxx","date":"2016-03-09T19:59:28.455+0000","up_votes":1,"down_votes":0,"body":"depende del significado que cada quien tenga sobre noob-champ. para empezar noob-champ no significa que sus jugadores sean malos, mas bien hace referencia a que cierto campeon es el clasico \"cabezaso contra el teclado pum pentakill\". hay gente que literalmente dice noob-champ yi. una vez en una partida, un yasuo nuestro se fedeo contra mm creo que era una ahri si no me equivoco. empezaron a decir los del otro equipo \"report jungla no gankea\". (ahri fue quien mas spameo eso) yasuo le respondio que el jungla no podia salvarla si ella era una noob que no sabia ni burstear, a lo que la ahri le contesto: \"calla la pu** boca, solo eres un yi que sale mas caro\". el yasuo paso del tema y no le contesto mas. lo que quiero decir es que hay gente, que porque ven que cierto personaje mata por dps (basicos) les dicen automaticamente noob-champ. lo que dijiste tambien tiene mucha razon, ese es bastante el motivo por el que nos insultan. hace no mucho empece a usar mucho a bardo de support, no solo por el rol, sino porque literalmente me divertia jugar con bardo, me parece un gordito muy op con todo y zukulenzia incluida. y sinceramente es bastante molesto cuando, carreas a tu adc a 2x3,14 al cuadrado, cuando flasheas para salvarles el culo y entregas el tuyo de atributo para que pueda escapar, y se queden a intentar kitear cosa que no tienen ni pta idea de como hacer, mueran, y digan por chat /all \"REPORT SUP NO ME PROTEGE\". normalmente pasa mucho con vaynes, o con jinx tambien bastante. y te doy la razon en cuanto a que ven a los jugadores profesionales usar a yasuo o zed, intentan copiarlos, mueren, y se frustran, fuera de joda se piensan que nose, instalaron el juego hace 20 minutos, se miraron una partida de faker, y ya son faker wtf... no saben ni lo que significa objetivos E-E. {{item:3151}} . pero volviendo al tema, ya te digo, para mi el termino noob-champ en si esta mal dicho, igual para alguien mas hace referencia a que lo usan noobs, para otros a que son campeones que pegas cabezados y gg pentakill porque estan \"rotos\", etc etc.","replies":[]}]}]},{"poster":"Apocrypha","date":"2016-03-07T23:07:32.332+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=tobias19,realm=LAS,application-id=PJAKt7ph,discussion-id=G61v6gLW,comment-id=000d,timestamp=2016-03-07T18:56:27.419+0000)\n>\n> Así es LAS, flamean a los Teemos, pero hay un Zed, Yasuo, Vayne, Lee, Riven y todos esos noobchamps en cada partida y nadie les dice nada...\n\nLes dices noobChamp porque siempre te rompen el culo con eso campeones? xD","replies":[{"poster":"tobias19","date":"2016-03-07T23:18:12.632+0000","up_votes":1,"down_votes":0,"body":"No, porque siempre que hay una Vayne enemiga les gano y por mucho.\n\nTiene la Q esa con invisibilidad cada 3 segundos y aun asi se posicionan mal, no me imagino a esos tipos jugando Jhin o algo sin movilidad, no duran ni 2 segundos...","replies":[{"poster":"FedecarboneroUY","date":"2016-03-08T02:37:23.136+0000","up_votes":1,"down_votes":0,"body":"Sin ofender, pero que podes esperar de una Vayne de ELO Bronze 5 ? pls, pensa un poco antes de hablar ¿No?\n\nPD: no vas a ver una buena vayne que este por debajo de platino, un conocido era buenisimo con vayne (en su momento Oro 3) ahora llego a Diamante 4 :v","replies":[]}]}]}]},{"poster":"Torke","date":"2016-03-08T00:35:02.270+0000","up_votes":2,"down_votes":1,"body":"te recomiendo buildear a {{champion:17}}  de otra manera. en 5 partidas que jugaste con este campeon hiciste 16 kills y moriste 22 veces. fijate aca: http://www.probuilds.net/champions/details/Teemo \njamas le ponen {{item:3085}}","replies":[]},{"poster":"DieOrSovngarde","date":"2016-03-10T16:34:33.327+0000","up_votes":1,"down_votes":0,"body":"Existe algo llamado \"meta\" y es el error mas grabde que tienen todas las comunidsdes de gamers de todos los juegos. Y es en base, el problema de los novatos y los nuevos jugadores. Ver LCS y Campeonatos, en parte esta bueno para analizar y en otra parte es un error porque quieren IMITAR a los jugadores de las dichas competiciones. \"rinde\" es una mentira implementada por los midmos pro. Pir ejemplo, en los partidos de futbol la meta general es 4-3-3. Pero si aparece un 5-4-2 diran \"con tanta defebsa no tenes ataque\" y es relativo, por una jugada o un contragolpe. Yo uso rengar con statik/cañon rapido y no me interesa si no es meta, pero a mi modo de ver al campeon es aumentar velocidad de ataque y critico. La estatik me asegura el critico con Q cargada y cañon me mas rango con el salto.\n\nSi no troleaste y no moriste estupidamente, despreocupate de los reports. Ahora si te da mala espina, algo hiciste entonces. Salu2!","replies":[]},{"poster":"lordeman10","date":"2016-03-09T18:01:36.762+0000","up_votes":1,"down_votes":0,"body":"les dejo un cuento que subi después de mirar este post \n\nhttp://boards.las.leagueoflegends.com/es/c/off-topic-y-temas-personales/6NWQyJNT-y-ahora-un-cuento-sobre-teemo","replies":[]},{"poster":"sumoreno12","date":"2016-03-09T17:53:37.292+0000","up_votes":1,"down_votes":0,"body":"Como hago para poner la imagen de un campeón? Fizz","replies":[{"poster":"sumoreno12","date":"2016-03-09T17:53:58.934+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=sumoreno12,realm=LAS,application-id=PJAKt7ph,discussion-id=G61v6gLW,comment-id=0036,timestamp=2016-03-09T17:53:37.292+0000)\n>\n> Como hago para poner la imagen de un campeón? Fizz\n\nFizz","replies":[]}]},{"poster":"matutes1","date":"2016-03-09T17:39:43.623+0000","up_votes":1,"down_votes":0,"body":"Chico agregame \nMe trollearon ranked por ir teemo Y Ademas quiero jugar algun jungla que no este el el meta (Akali zed ejemplos)","replies":[]},{"poster":"Icesoul","date":"2016-03-09T00:21:13.114+0000","up_votes":1,"down_votes":0,"body":"Me pasa constantemente eso, pero no por pickear a teemo, sino porque se mueren o tienen un monton de errores y lo culpan siempre a uno, da pena muchas veces los nenitos que te tocan y no se aguantan de lo muy mañosos que son y maleducados.","replies":[]},{"poster":"II Thanatos II","date":"2016-03-09T00:05:20.334+0000","up_votes":1,"down_votes":0,"body":"Teemo top si, Teemo mid ñeeee algunos asesinos te violan, pero teemo jg no me vengan con cosas eso es troleo del puro y duro xD","replies":[]},{"poster":"Exit","date":"2016-03-08T20:04:44.979+0000","up_votes":1,"down_votes":0,"body":"el buen teemo jungla","replies":[]}]}