{"poster":"SP41636D471","date":"2018-08-19T17:55:57.427+0000","title":"Skill shot oder nicht Skill shot? Das ist hier die Frage!!","subforum":"Champions & Gameplay","embed":{"description":null,"url":"https://cdn.discordapp.com/attachments/404377510239797274/477823432961163274/20180811_070707.jpg","image":null},"up_votes":1,"down_votes":5,"body":"Hallo liebe LoL (Salz) Community. \r\nHeute schreibe ich wieder &uuml;ber die dinge, wo ich finde das diese Riot nicht gut gemacht hat. \r\nIch m&ouml;chte mich heute &uuml;ber diese &quot;Skill shots&quot; beschweren. Zuerst aber mal meine eigene Definition davon. Ihr k&ouml;nnt mich hier gerne Verbessern.\r\nSkill Shot: Etwas was nur Trifft wenn du es in die Richtige Richtung &quot;Schie&szlig;t&quot; und der Gegner auch Die M&ouml;glichkeit hat es auch auszuweichen. Weil es nicht ein Point to Click Spell ist, sollte es auch mehr Schaden als dieser Point to Click anrichten. \r\nIch finde das beschreibt Skill Shot sehr gut. ABER jetzt kommt das was mich wirklich aufregt. Die Wahrheit ist, das LoL eigentlich nicht so viele davon hat. Den Kaum hat ein Champion einen Skill Shot (Zoe,Brand;Ahri....etc) gibt man ihn einen weiteren Spell der hard CCen kann damit du diesen &quot;Skill Shot&quot; 100% treffen kannst.\r\n\r\n Meine Frage ist warum? Zoe&acute;s Q macht unheimlich viel Dmg. Es macht so viel Dmg das es ADC One Shooten kann (oder Support,Jgl,Mid). Und Riot gibt dann der erw&auml;hnten Zoe einen Spell der daf&uuml;r sorgt das Zoe eigentlich so gut wie immer Trifft und es sogar Noch Mehr Dmg macht weil dieser dann wieder kein Skill Shot mehr ist.\r\n H&ouml;rt sich f&uuml;r mich nicht fair an. Nat&uuml;rlich kann man sagen das der hart CC dann wieder rum ja selber ein SS (skill Shot) ist aber.... gibt das einen Champion die Berechtigung einen Zu One Shoten? Und das ein anderen SS der schon genug Dmg macht noch Mehr Dmg macht? Bitte schreibt mir eure Meinung dazu.\r\n\r\nIch Selbst spiele sehr oft ADC, ich selbst weis das AA&acute;s keine Skill shot&acute;s sind, aber sie trz jemanden die H&auml;lfte an leben entziehen k&ouml;nnen. Aber auch nur Im late game oder wenn man Gefeded ist. Bei Zoe (brand, ahri, Zed.....) k&ouml;nnen die einen immer Sofort t&ouml;ten wenn die mal einen Spell treffen. Und das zu jeder zeit. (&uuml;bertrieben gesehen) \r\n\r\nDann gibt es finde ich diese Champs die echte SS&acute;s haben. Blitzcrank, Thresh oder Nautilus. Deren Spells sind nur auf Skill aufgelegt und Treffen nur dann wenn Sie auch treffen. Gut das war ein guter Witz. Ich Bitte euch allen jetzt mein Bild anzugucken welches ich verlinkt habe (das bin ich der Getroffen wurde). Das ist mein N&auml;chstes Thema,\r\n Die Auslegung und der Spielraum der SS&acute;s \r\nKann man etwas wirklich einen SS&acute;s nennen wenn er nur in die Richtige Richtung gehen soll und nicht treffen? Wie man beim Bild Sieht hat Nautilus mich nicht getroffen. Aber weil es einen Spielraum bei solchen Spells gibt hat er. Warum? Diese Spells von Thresh, Blitzcrank oder Nauti k&ouml;nnen Ganz Spiele umdrehen oder entscheiden. Warum gibt man denen dann ausgerechnet diesen Spielraum? Ich finde das Zerst&ouml;rt einfach diesen begriff von &quot;Skill&quot; bei diesen Chmaps.\r\n\r\nWas ist dieser Dmg?\r\nSkill shots m&uuml;ssen mehr dmg machen als PtC Spells das ist klar aber warum den so viel mehr? Es hat finde ich nichts mit Skill zutun wenn du einmal einen SS triffst und damit deinen Gegner sofort ohne das er sich w&auml;ren kann t&ouml;ten. Das ist viel zu viel Dmg f&uuml;r EINEN oder auch Zwei Spells. Nat&uuml;rlich wenn man 7/0 steht und man einen deutlichen Vorsprung hat ist es irgendwo vielleicht Okay aber nicht wenn ein 2/1 gegen einen 2/0 k&auml;mpft und der 2/1 gewinnt weil dessen Spell einfach &quot;Skilliger&quot; ist (also mehr Dmg macht). \r\n\r\nDas Letzte Thema hier, meine &quot;L&ouml;sung&quot;\r\nMann sollte diesen Spielraum von manchen Spells finde ich einfach Wegtun. Ich weis das sie dann Noch viel schwerer zutreffen sind aber das ist ja das Ziel eines solchen Spells. \r\nMann sollte auch den Dmg finde ich Regulieren oder besser gesagt Runter tuen weil Champs wie Ahri, Band, Zoe....... etc M&uuml;ssen nicht ihren &quot;Skilligen&quot; spell so benutzen als w&uuml;rden sie sich m&uuml;he geben, nein sie Hard CC&acute;en den Gegner und treffen dann mit Ihrer Jeweiligen Atombombe (&uuml;bertreiben gesehen). Und das f&uuml;r mich schlimmste, mann sollte nicht so tun als w&uuml;rden manche Spells auf Skill basieren den die Wahrheit ist das es einfach nur Sehr wenige auf Skill basierende Spells gibt. \r\nAlso was meint ihr? Bin ich ein Verr&uuml;ckter der einfach nur Dummes zeug redet oder Steckt in meinen Aussagen auch ein Funken Wahrheit?\r\nVielen Dank das ihr das Durchgelesen habt und Viel Spa&szlig; euch noch beim Ranked.","replies":[{"poster":"Alpacana","date":"2018-08-19T19:15:07.627+0000","up_votes":4,"down_votes":1,"body":"Der Grund warum es meistens eine Ability gibt, die einer anderen Ability \"hilft\" (nehmen wir z.B. Zoe E die ihrer Q hilft) ist der, das es zum Kit des Champions gehört. \nWenn du einem Champions 3 Fähigkeiten gibst die nicht miteinander synergieren, kannst du den Champion nicht flüssig spielen, was die Spielerfahrung wiederum negativ beeinflusst, was wiederum schlecht für Riot ist.\n\nZum Punkt mit dem Spielraum und den Hooks (ob Blitz, Thresh, Nautilus ist hier egal):\nJeder Champion hat eine Hitbox, das weißt du sicher. Diese Hitbox **braucht** jeder Champion, damit Fähigkeiten mit diesem Champion interagieren können.\nDas hängt mit dem Coding zusammen.\nEin Coding kannst du nicht auf ein Model packen, deshalb brauchst du eine Hitbox. Das Coding weiß dann \"Wenn Skillshot (Ezreal Q) Champion Hitbox trifft, dann drücke Dmg\" und du bekommst von der Ezreal Q Dmg.\nSo jetzt habe ich erklärt wie eine Hitbox funktioniert, aber nicht warum diese manchmal so \"broken\" ist.\nNunja, eine Hitbox ist ein Viereck, welches um den Champion herum gelegt ist. Das menschliche Auge sieht dann, wie der Thresh-Hook am Bauch des Models vorbeifliegt und denkt dann nur \"broken Hitbox\", aber in Wirklichkeit ist es einfach die extrem große Hitbox, die von einem Bein zum anderen Bein des Models geht.","replies":[{"poster":"SP41636D471","date":"2018-08-20T11:02:17.791+0000","up_votes":1,"down_votes":0,"body":"Wer bestimmt was mit einander \"Synergiert\"? Draven hat keinen Hart CC aber alle seine Spells Synergien Perfekt. Wie bei Ashe, Kaisa, Zed, Garen, Dr Mundo,...........etc.  Also was hat das jetzt mit meinem Beitrag zutun? \nEs gibt unendlich viele Videos wo einer sichtlich nicht getroffen wird er aber trotzdem \"getroffen\" wird. Also verstehe ich deinen Punkt immer noch nicht da du mir eigentlich nicht geantwortet hast sondern einfach nur was erklärt hast was nicht von belangen ist.","replies":[{"poster":"Alpacana","date":"2018-08-20T12:03:51.088+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SP41636D471,realm=EUW,application-id=Wj1wcocU,discussion-id=MZXMptNO,comment-id=00010000,timestamp=2018-08-20T11:02:17.791+0000)\n>\n> Wer bestimmt was mit einander &quot;Synergiert&quot;?\n\nRiot tut das.\n\n> Draven hat keinen Hart CC aber alle seine Spells Synergien Perfekt. Wie bei Ashe, Kaisa, Zed, Garen, Dr Mundo,...........etc.  Also was hat das jetzt mit meinem Beitrag zutun? \n\nDas war lediglich eine Ausführung warum es so etwas gibt. Riot entwickelt jeden Champ einzigartig mit einem (mehr oder wengier) einzigartigem Kit.\n\nAber wo du diesen Punkt hier ansprichst, lass mich den doch einfach mal ein bisschen weiter ausführen:\nNehmen wir einfach mal einen von deinen Beispielen: Dr. Mundo.\nAuch er hat ein einzigartiges Kit, auch ganz ohne Hard-CC wie du es schon richtig erkannt hast. Seine Q verlangsamt Gegner, was ihn gut hinter seinen Targets herlaufen lässt um seine E zu benutzen (einfach mehr AD auf einem AA), außerdem hat er eine W für etwas mehr Waveclear und DPS. Wie du an diesem einfachen Satz schon erkannst hast, ist Mundos Kit sehr simpel gehalten, was ihn recht clunky macht. Mit Mundo machst du keine sicken Outplays, ist bei seinem Kit und der Art von Champion aber auch gar nicht nötig. Mundo ist ein Meat-Shield und Slow-Bot, nicht jemand der jemanden outplayen möchte und sein Mastery 7 spammt.\n\nBrands Kit dagegen:\nEr hat eine E, die seine Spell-Rotation initiaten lässt, eine Q die den Gegner stunnt um daraufhin seine W sicher treffen zu können. Diese 3 Fähigkeiten lösen dann seine Passive aus, welche noch einmal einen Dmg-Spike vermerken lässt.\nSo, dieser Satz war schon etwas länger, woraus sich auch schon schließen lässt, dass Brands Kit etwas komplizierter ist (aber auch nicht nicht **wirklich** kompliziert). Alle seine Fähigkeiten werden benötigt um sein Kit vollkommen auszunutzen.\n\nIn letzter Zeit möchte Riot das Spiel allerdings etwas mobiler und schneller gestalten, daraus resultieren dann z.B. Champions wie Zoe oder die reworked Akali.\nDie Kits dieser Champions sind um einiges komplizierter und bieten viel mehr Möglichkeiten wie und in welcher Reihenfolge du sie einsetzt.\n\nZum Glück muss ich darauf nicht weiter eingehen da \"Amycos Cyrus\" das Ganze schon sehr schön beschrieben hat. Selbst die Zoe Bubble oder der Ahri Charm ist ein Skillshot. Deine Antwort darauf war \"Ein Skillshot der jeden weiteren Spell zu einem Point to Click-Spell macht. Damit hast du mehr oder weniger Recht.\nWenn der Ahri Charm sitzt, dann hast du es um einiges leichter die anderen Spells zu treffen, allerdings gibt es da auch mehr als genug Gegenmaßnahmen.\nHat der Gegner z.B. Cleanse dabei, ist deine komplette Spell-Rotation nutzlos, genau so wie mit einem Morgana Shield. Dies sind Dinge die man vielleicht nicht immer im Spiel dabei hat (jedenfalls wenn man Blind Pick spielt), aber selbst dann gibt es noch Optionen wie Boots früh auszubauen um eine größere Dodge-Chance zu haben oder das gute alte QSS, wodurch du mit 1300 Gold die Spell-Rotation eines kompletten Champions auseinander nehmen kannst.\nAuch sagst du, dass dieser eine Skillshot der alle anderen zum Point to Click-Spell macht einem Champion die Möglichkeit gibt, jemanden zu one-shotten. Dazu sage ich: In der Laning-Phase auf keinen Fall (außer derjenige ist schon fed), Im Late-Game ist sowas durchaus möglich, liegt aber daran, dass solche Kits meistens Assassinen oder Mages besitzen, deren Aufgabe ist, jemanden zu oneshotten ;)\n\nBevor du mir jetzt ankommst mit \"Aber das ist doch viel zu OP\", werfen wir doch gleich mal einen Blick auf die Winrates solcher Champions im Vergleich zu Winrates von Champion ohne Hard-CC\nBeispiel ohne Hard-CC:\nGaren, seine Winrate schwankt momentan zwischen 51-54%\n\nBeispiel mit Hard-CC:\nBrand, seine Winrate schwankt momentan wischen 50-52%\n\nAlso wie du siehst, nein, solche Champions sind auch nicht OP, andernfalls wären ihre Winrates bei weit über 55%.\n\n\n> Es gibt unendlich viele Videos wo einer sichtlich nicht getroffen wird er aber trotzdem &quot;getroffen&quot; wird. Also verstehe ich deinen Punkt immer noch nicht da du mir eigentlich nicht geantwortet hast sondern einfach nur was erklärt hast was nicht von belangen ist.\n\nDas ist eigentlich genau das, was ich erklärt habe. Erst habe ich dir erklärt was eine Hitbox genau ist (ein Viereck, welches um den Champion, also das Model des Champions, gelegt ist) und warum es sie gibt.\nDanach habe ich dir erklärt warum solche Hitboxen manchmal \"broken\" erscheinen.\nNehmen wir dazu wieder einmal das Nautilus-Beispiel.\nSchau dir den Hook von Nautilus einfach mal ganz genau an. Es ist ein richtig großer Anker, der nach vorne fliegt, mit einer relativ kleinen Kette, die die dementsprechende Linie anzeigt. Die Hitbox des Hooks (auch Abilities haben eigene Hitboxen, das hätte ich vielleicht erwähnen sollen) ist nicht so groß wie die Kette, sondern wie die größte Distanz innerhalb des Ankers und dann noch einmal leicht vergrößert, um grafische Fehler zu vermeiden.\n\nSo, falls du meine Punkte jetzt immernoch nicht verstehst, schau dir einfach dieses Video an, da ist alles noch einmal zusammengefasst:\nhttps://www.youtube.com/watch?v=z7xMIRzIDpU","replies":[{"poster":"SP41636D471","date":"2018-08-20T16:47:32.658+0000","up_votes":1,"down_votes":0,"body":"Danke das du dir weider Zeit genommen hast um auf meine Antwort zu antworten. \nIch habe nie gesagt das ich das mit den Hitboxen nicht verstanden habe, ich weis schon seit Jahren was das ist (Ich glaube alle Menschen die spielen wissen was das ist) bitte erkläre es nicht nochmal... \nDu verstehst meine und deine Aussage nicht. Du kennst Z.b. Zoe jetzt nur mit dem Hart CC Spell. Deshalb entfindest du das alle spells synergien. Was wäre wenn Riot das nie gemacht hätte? Dann würdest du das andere als perfekt Synergiert betrachten und weist du auch warum? Weil Riot seine Arbeit bei sowas IMMER gut macht und meine frage war warum sie ausgerechnet das haben soll wenn es doch so viele andere Möglichkeiten gibt. \nIch hoffe du hast dich selbst und mich jetzt verstanden.\nAußerdem habe ich nie gesagt das was OP ist ich habe nur gesagt das mann nicht immer alles einen SKill Shot nennen soll ","replies":[{"poster":"Alpacana","date":"2018-08-20T17:04:09.355+0000","up_votes":1,"down_votes":0,"body":"Naja so wie du es beschrieben hast hat es sich angehöhrt als würdest du nicht wissen was Hitboxen genau machen (was übrigens sehr sehr viele Menschen zwar wissen, aber nicht richtig verstehen).\nDeinem Beispiel mit Zoe stimme ich voll und ganz zu, wir kennen sie wie sie nunmal erstellt wurde.\n\nDeine Frage ist jetzt also warum Zoe die Spells besitzt, die sie nunmal besitzt?\nNaja, das kann dir glaube ich niemand beantworten. Irgendwo sitzt da jemand bei Riot der Ideen für Champions raushaut, allerdings lassen sich Fähigkeiten nur begrenzt so entwickeln, wie sie geplant waren.\nRiot besitzt eine bestimmte Palette an Sachen, wie sie ihre Fähigkeiten entwickeln (z.B. Stuns, Roots, Slows etc.).  Diese Palette ist bei Riot zusammengefasst und Riot hat auch bestätigt, dass sie diese Palette auch aktuell halten möchten, also nichts neues dazu erfinden, was wiederum bedeutet dass alle neuen Champions Fähigkeiten aus nur dieser Palette erhalten können, nichts anderes.\nIst deine Frage jetzt also, warum es diese Palette gibt?\nWenn nicht dann nein, habe ich dich immernoch nicht verstanden (mich habe ich allerdings durchgehend verstanden).\n\n\nAußerdem dachte ich du beschwerst dich darüber, wieso der Nautilus getroffen hat und nicht, warum es bestimmte Fähigkeiten gibt. (Das impliziert jedenfalls der Titel \"Skill shot oder nicht Skill shot? Das ist hier die Frage!!\" deines Threads)","replies":[{"poster":"SP41636D471","date":"2018-08-22T15:19:25.257+0000","up_votes":1,"down_votes":0,"body":"Danke für deine Antwort. Diese Antwort die du jetzt gegeben hast war echt gut und mit tatsächlich dinge beigebracht die ich nicht wusste. Vielen Dank Dafür.\nGenau meine Frage ist warum z.b. dafür ausgelegt worden ist und Zu One shoten. Das st einfach Dumm war doch offensichtlich das man sie nicht mögen wird. Außerdem nerven mich die Belohnungen wenn mann mahl was trifft unheimlich (siehe Zoes E, ahris E, Brands Q......)","replies":[{"poster":"Alpacana","date":"2018-08-22T15:45:28.540+0000","up_votes":1,"down_votes":0,"body":"Die Frage kann ich dir auch nicht genau antworten, ich kann aber eine Vermutung aufstellen.\nStell dir ein Game vor, wo es nur Tanks gibt. Wäre ziemlich langweilig, hm? Also hat Riot mehrere Klassen implementiert, die eben verschiedene Dinge machen.\nEs gibt Tanks, die 20 Sekunden im Fight überleben, dafür aber niemanden oneshotten können und es gibt Assassinen, die jemanden oneshotten können, dafür aber auch selbst platzen. (und dann gibt es natürlich noch die anderen 369 Klassen)","replies":[]}]}]},{"poster":"Amycos Cyrus","date":"2018-08-21T13:40:48.814+0000","up_votes":1,"down_votes":0,"body":"> (...) meine frage war warum sie ausgerechnet das haben soll wenn es doch so viele andere Möglichkeiten gibt.\n\nWie stellst du dir denn diese anderen Möglichkeiten vor?\n\nInteraktion und Synergie ist übrigens in fast allen Fällen geplant. Dazu gabe es übrigens zum Zoe-Release einen [Post von Riot](https://nexus.leagueoflegends.com/de-de/2017/11/ask-riot-cute-champs-and-e-flashes/)\n\n> (...) ich habe nur gesagt das mann nicht immer alles einen SKill Shot nennen soll\n\nDer Begriff: Skillshot beschreibt grundsätzlich nur Spells, die kein Ziel benötigen. Die also in Abwesenheit eines Gegners oder auch Verbündeten genutzt werden können.\nSomit ist ein Skillshot definitionsgemäß das Gegenteil von Point'n'Click, welches Spells sind, die bei ihrer Ausführung ein Ziel benötigen und somit nicht nutzbar sind, wenn kein Ziel da ist.\n\n=> Ein Spell, der ein Skillshot ist wird also in jedem Fall ein Skillshot sein, egal wie das erhoffte Ziel aussieht.","replies":[{"poster":"SP41636D471","date":"2018-08-22T15:20:59.833+0000","up_votes":1,"down_votes":2,"body":"\"=> Ein Spell, der ein Skillshot ist wird also in jedem Fall ein Skillshot sein, egal wie das erhoffte Ziel aussieht\"\neinfach wow wie du jedes Fünkchen von \"Witz\" oder \"Übertreibung\" ignoriert hast.","replies":[]}]}]}]}]}]},{"poster":"Amycos Cyrus","date":"2018-08-19T22:22:15.091+0000","up_votes":2,"down_votes":0,"body":"1. Ich schließe mich den Ausführungen bezüglich der Aspekte zur Hitbox  von \"Alpacana\" an.\n2. Das Spielchen mit den Skillshots (CC und DMG) können wir gern spielen.\n\n___\n\nSo lasst uns beginnen:\n\nEin wesentlicher Anteil deiner Kritik beruht darauf, dass ein Großteil der Champions, die über Skillshots verfügen, welche ihren Hauptschaden darstellen, gleichzeitig über Möglichkeiten verfügen den Gegner zu hard-ccen (dämlich Konjugation XD)\nAllerdings sollte man sich die Mittel und Weg des Hard-CCs ebenfalls angucken.\n\n - {{champion:103}} : Ahri verfügt über 2 Skillshots. Ihr Q, welcher ihren Hauptschaden darstellt, da er zur Hälfte in True-DMG verrechnet wird und ihr E, welches ihren einzigen CC darstellt. Somit muss ein Ahri-Spieler, egal wie er/sie/es traded mindestens ein Skillshot auf ein uneingeschränktes Ziel treffen. (Bestenfalls das E). Wenn sie das E trifft ermöglicht es ihr das Q leichter zu treffen, reduziert also den Aufwand nach dessen treffen, mindert jedoch nicht die Tatsache, dass es sich bei dem E auch in diesem Trade um einen Skillshot laut deiner Definition handelt.\n(Das Q ist technisch gesehen weiterhin ein Skillshot, auch wenn das Ziel eingeschränkt ist, da das E nicht die Charakteristik des Qs verändert und das Q auch ohne das E wirken kann.) \n\n - {{champion:142}} : Zoe verfügt in gewisser Hinsicht über das selbe Kit wie Ahri. (2 Skillshots, eine zielsuchenden Zauber und eine Utility-Ult), wobei die Ausprägungen selbstverständlich grundsätzlich verschieden sind. Jedoch ist auch Zoes Hard-CC auf einem Skillshot, welcher zusätzlich diesen CC nicht instantan anbringt und es somit Zielen ermöglicht sich nach eintreffen des CCs weiterhin gegen Zoe zu schützen. (Zhonyas, Flash etc.) Aus diesem Grund ist die mit ihrem CC verbundene Schadenserhöhung auch weitreichender als die von Ahri.\n \n- {{champion:63}} : Hier komme ich mit deiner Definition von Skillshot nicht sonderlich weiter, denn entsprechend dieser verfügt Brand nur über einen einzieg Skillshot (sein Q), welcher aber auch hier wieder der einzige Zauber in seinem Kit ist, der Hard-CC erzeugen kann. Also muss auch Brand einen Skillshot treffen, um weiterhin Schaden anbringen zu können. (+ Brand muss dank seiner Passiven bereits sein E oder R getroffen haben und mit der W follown, um ähnlich wie Ahri oder Zoe eine Schadensehöhung aus dem CC zu erfahren, da dieser Effekt nur die W von Brand betrifft und nicht vom CC-Spell ausgeht.)\n\n___\n\nUm jetzt noch mal etwas zu übertreiben:\n\nChampions, deren Hard-CC ein Skillshot ist:\n{{champion:266}} {{champion:103}} {{champion:84}} {{champion:32}} {{champion:34}} {{champion:1}} {{champion:22}} {{champion:136}} {{champion:432}} {{champion:53}} {{champion:63}} {{champion:201}} {{champion:164}} {{champion:69}} {{champion:31}} {{champion:122}} {{champion:119}} {{champion:245}} {{champion:60}} {{champion:105}} {{champion:3}} {{champion:150}} {{champion:79}}{{champion:74}} {{champion:39}} {{champion:427}} {{champion:40}} {{champion:202}} {{champion:141}} {{champion:89}} {{champion:99}} {{champion:25}} {{champion:267}} {{champion:111}} {{champion:516}} {{champion:555}} {{champion:497}} {{champion:113}} {{champion:98}} {{champion:102}} {{champion:14}} {{champion:37}} {{champion:16}} {{champion:50}} {{champion:134}} {{champion:223}} {{champion:163}} {{champion:44}} {{champion:412}} {{champion:110}} {{champion:45}} {{champion:161}} {{champion:254}} {{champion:112}} {{champion:19}} {{champion:101}} {{champion:157}} {{champion:154}} {{champion:115}} {{champion:26}} {{champion:142}} {{champion:143}} {{champion:54}} {{champion:57}} {{champion:6}} {{champion:429}} {{champion:240}} {{champion:107}} {{champion:7}} {{champion:78}} \n\nChampions, deren Hard-CC kein Skillshot ist:\n{{champion:12}} {{champion:32}} {{champion:1}} {{champion:201}} {{champion:51}} {{champion:131}} {{champion:3}} {{champion:86}} {{champion:40}} {{champion:24}} {{champion:126}} {{champion:222}} {{champion:43}} {{champion:85}}  {{champion:64}} {{champion:89}} {{champion:127}} {{champion:117}} {{champion:90}} {{champion:57}} {{champion:111}} {{champion:56}} {{champion:80}} {{champion:78}} {{champion:497}} {{champion:33}} {{champion:421}} {{champion:58}} {{champion:92}} {{champion:13}} {{champion:113}} {{champion:35}} {{champion:72}} {{champion:223}} {{champion:18}} {{champion:4}} {{champion:77}}{{champion:67}} {{champion:254}} {{champion:106}} {{champion:19}} {{champion:27}} {{champion:9}} {{champion:240}} {{champion:17}} {{champion:5}} {{champion:62}} {{champion:133}} \n\nChampions, die keinen Hard- CC besitzen:\n{{champion:36}} {{champion:81}} {{champion:41}} {{champion:104}} {{champion:420}} {{champion:145}} {{champion:30}} {{champion:38}} {{champion:55}} {{champion:10}} {{champion:141}} {{champion:121}} {{champion:203}} {{champion:96}} {{champion:236}} {{champion:11}} {{champion:21}} {{champion:82}} {{champion:75}} {{champion:76}} {{champion:20}} {{champion:2}} {{champion:68}} {{champion:15}} {{champion:91}} {{champion:48}} {{champion:23}} {{champion:29}} {{champion:8}} {{champion:238}} \n\nChampions, die in Folge von Terrainbeschwörung Hard-CC wirken können:\n{{champion:83}} {{champion:48}} {{champion:34}} {{champion:59}} {{champion:516}} {{champion:163}} \n\nChampions, bei denen man sich je nach Definition aussuchen kann, welcher Kategorie sie angehören:\n{{champion:268}} {{champion:114}} {{champion:28}} {{champion:72}} {{champion:117}} \n\n___\n\nAuffällig ist übrigens, dass vor allem Damage-Dealer Skillshot-CC nutzen und Frontliner/Tanks über Point'n'Click-Hard-CC verfügen.\n\n- Ich habe in dieser Liste Champions, der Mobilität (Dash etc.) einen Hard-CC herbeiführt als Skillshot angegeben, da es sich entsprechend deiner Definition um einen solchen handelt.\n- Ich habe nicht nur mobilitätseinschränkende CC-Wirkungen betrachtet, sonder Hard-CC an sich. (Ansonsten, wären Champions wie {{champion:17}}  ohne Hard-CC)\n- Ich habe Champions, die sich nur selbst in einen Hard-CC versetzen können, jedoch keinen Gegner hard-CCen können unter \"Kein Hard-CC\" gelistet. (e.g. {{champion:81}} )\n___\n\nMfG. Amycos Cyrus\n\n{{sticker:sg-jinx}} \n\nPS: Der Tod als Hard-CC ist nicht berücksichtigt worden XD\n\n___\n\nEs gab mal vor recht langer Zeit einen Champion, der genau das getan hat, was du hier beschreibst. Er hat einen Skillshot getroffen un infolge dessen, wurde sein Hauptschadens-Zauber von einem Skillshot zu einem Point'n'Click-Spell.\nDie galt für den alten {{champion:6}} , dessen Q gegenüber Zielen, die er mit der E getroffen hatte zu einem Point'n'Click-Spell wurde.","replies":[{"poster":"I love you Malon","date":"2018-08-20T08:35:20.743+0000","up_votes":1,"down_votes":0,"body":"Wieso führst du unter Hard CC Skillhot bspw. Lux mit einem Root aber nicht Rengar mit seinem Empowered E auf?","replies":[{"poster":"Amycos Cyrus","date":"2018-08-20T09:03:10.131+0000","up_votes":1,"down_votes":0,"body":"Weil ich bei Rengar nicht an das E gedacht habe. (Ist jetzt geändert.)\n\nWenn weitere Fehler auftreten gern kommentieren. Ich denke auch nicht an alles.","replies":[{"poster":"I love you Malon","date":"2018-08-20T09:20:52.668+0000","up_votes":2,"down_votes":0,"body":"ansonsten super liste :U","replies":[]},{"poster":"Mjölnir Kind","date":"2018-08-20T09:30:23.349+0000","up_votes":2,"down_votes":1,"body":"Champions, deren Hard-CC kein Skillshot ist:\n{{champion:7}} ist ein Skillshot\n{{champion:86}} Garen hat Hard-CC?\n\nChampions, die keinen Hard- CC besitzen:\n{{champion:62}} Ult?\n{{champion:48}} Knockup bzw. Knockback mit E\n{{champion:83}} W (Iwie ja auch HardCC, zumindest wurde früher die Mastery, mit dem Schield bei HardCC, getrieggerd\n\n\nSry wollte auch mal ein Klugscheisser sein <3","replies":[{"poster":"Amycos Cyrus","date":"2018-08-20T21:03:05.764+0000","up_votes":1,"down_votes":1,"body":"- LeBlanc Wukong ist korrigiert.\n- Garen hat einen Silence, der in die Kategorie Hard-CC gehört. Er wurde entsprechend der unter der Liste formulierten Bedingungen eingeordnet.\n- Bezüglich Yorick und Trundle eröffne ich eine neues Register und ergänze es durch alle Verwandten.","replies":[{"poster":"NamiCurry","date":"2018-08-21T11:46:55.105+0000","up_votes":1,"down_votes":0,"body":"Als es Courage of the Colossus noch gab, das nur durch hard cc ausgelöst werden konnte, wurde es bei silences NICHT getriggert -> kein hard cc","replies":[{"poster":"Amycos Cyrus","date":"2018-08-21T12:48:39.321+0000","up_votes":1,"down_votes":0,"body":"Die offizielle Beschreibung von \"Courage of the Colossus\": \"Gain a shield for 3 - 54 (based on level) (+ 5% maximum health) per nearby enemy champion for 3 seconds after hitting an enemy champion with a stun, taunt, snare, or knock up.\"\n\nEs wurde also nicht durch Hard-CC ausgelöst sondern, durch explizite CC-Formen. (Wenn man dieser Liste folgt konnte die Yasuo-R (Airbone) auch kein Schild auslösen und auch Fears Charms Sleeps etc. sind nicht in der Lage das Schild auszulösen.)\n\nHard-CC ist CC, der den Gegner daran hindert bestimmte Aktionen auszuführen. (Silence = Nutzung von Fähigkeiten, Blind = Autoattacks, Stun = Bewegen, etc.)\n\nDem entgegen ist Soft-CC die Form von CC, die den Gegner in bestimmten Bereichen ausbremst. (Slow Cripple Nearsight etc.)","replies":[]}]}]}]}]}]},{"poster":"SP41636D471","date":"2018-08-20T10:46:14.469+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank das du dir Zeit Genomen hast um auf meinen Beitrag zu Antworten. ich werde mir jetzt auch mal Zeit nehmen. \nDas Problem was ich aber habe ist, und was ich vielleicht nicht so gut zum ausdruck gebracht habe ist das wenn Champions wie Zoe oder Ahri oder Brand oder..... ihren Hart CC treffen, sie Viel zu Stark belohnt werden. Nähmen wir mal Ahri als beispiel. Alle ihre spells machen dann 20% mehr Dmg und alle spells treffe eigentlich zu 100% (klar gibt es viele fälle wo das nicht der Fall ist aber seine wir mal ehrlich, ab einen bestimmten Skill lvl. ist man dazu in der Lage). Das bedeutet doch das der Charm von Ahri alle anderen Spells eigentlich zu Point to Click Spells (weil sie ja \"immer\" treffen) macht (jedenfalls in der Laning Phase) und sie deswegen sogar noch mehr Dmg machen (Das ist nicht fair!) Eine viel zu Starke Belohnung mahl etwas getroffen zuhaben. Bei Zoe ist es noch schlimmer (muss ich glaube ich nicht erklären). Bei Brand ist es einfach Dumm. Mit seiner E die PtC ist verbrennt er sofort Gegner und kann sie dann sofort mit Der Q treffen und dann mit der W, die Passive Triggered sich und der adc ist Tod weil man die Q getroffen hat. \"Skill\".\nSS = Skill Shot\nDeine Hard CC liste hat Fehler. Quinn kann einen für 0,5 Sekunden Hart CCen mit der E. Kayn kann in seinen Roter Form einen Hart CCen. Kleds hart CC st ein SS. WW hart CC ult ist ein SS. Vi Q ist ein SS. Vaynes E ist auch ein SS. Tham kench hart CC bei vollen Stacks ist ein SS. Sejus ult ist ein SS. Rakans E ist ein SS. Poppys hart CC ist auch ein SS. Beide sogar. Lulu ult ist ein skill shot da sie nicht point to click auf ein Gegner ist. Nautlius Q ist ein SS. Beim Rest bin ich eigentlich zufrieden. Ich habe die Chaps nicht erwähnt die die anderen jetzt erwähnt haben.","replies":[{"poster":"Amycos Cyrus","date":"2018-08-20T21:57:29.007+0000","up_votes":1,"down_votes":0,"body":"> ihren Hart CC treffen, sie Viel zu Stark belohnt\n\nWie würdest du dir die Belohnung denn vorstellen?\n\n> (...) Alle ihre spells machen dann 20% mehr Dmg und alle spells treffe eigentlich zu 100% (klar gibt es viele fälle wo das nicht der Fall ist aber seine wir mal ehrlich, ab einen bestimmten Skill lvl. ist man dazu in der Lage).\n\nIch würde dir empfehlen bei Ahri etwas zu recherchieren. Es existieren nämlich ein mathematischer und ein entwicklungstechnischer Fehler in deiner Aussage.\n\n> Das bedeutet doch das der Charm von Ahri alle anderen Spells eigentlich zu Point to Click Spells (weil sie ja \"immer\" treffen) macht (jedenfalls in der Laning Phase) und sie deswegen sogar noch mehr Dmg machen\n\nNur weil ein Ziel sich nicht bewegt oder die Bewegung vorhersehbarer ist, ändert sich nicht die Charakteristik eines Zaubers. Skillshots werden nie zu Point'n'Click-Spells egal wie das Ziel reagiert. (Ich meine wenn ein Spieler nicht dodged wird ein Skillshot auch nicht zum Point'n'Click-Spell)\n\nWeiterhin bin ich verwundet, warum ein Zauber mehr Schaden machen soll, wenn er statt ein Skillshot ein Point'n'Click-Spell ist. Oder habe ich dahingehend etwas falsch verstanden.\n\n> Bei Zoe ist es noch schlimmer\n\nWarum. Ihr Effekt ist sogar nur einmalig abrufbar und nicht für eine Zeit festgesetzt und durch Zauber nicht entfernbar, wie es bei Ahri der Fall ist. Weiterhin gelten alle bereits angesprochenen Schwächen des Zaubers.\n\n> Mit seiner E die PtC ist verbrennt er sofort Gegner und kann sie dann sofort mit Der Q treffen und dann mit der W, die Passive Triggered sich und der adc ist Tod weil man die Q getroffen hat. \"Skill\".\n\nE ist Point'n'Click: Richtig. Weiterhin ist der Q somit auch in deiner Perspektive weiterhin ein Skillshot, der also getroffen werden muss. Die W und Passive sind selbstverständlich weiterer Schaden, jedoch sind beide nicht an den CC gebunden und somit in keinerlei Hinsicht mit ihm in Bezug zu setzen. (Die R kann die Passive alleine auslösen und die W kann ebenso gegen beliebige Ziele getroffen werden und erhält in Folge der Passiven den Bonus-Schaden und nicht aufgrund des Stuns.) Brand ist daher unter diesen 3 Champions derjenige, der am wenigstens Profit oder Belohnung aus dem Stun erfährt.\n\n> Deine Hard CC liste hat Fehler.\n\nIch habe nicht behauptet, dass sie stimmt, sondern stellte sie als grobe Übersicht auf. Weiterhin bin ich aber gern da, um sie zu korrigieren.\nNun zu deinen Kritiken:\n\n - Quinn: Ist korrigiert.\n - Kayn: War bereits korrekt. (Er ist etwas paradox notiert, da er unter Skillshot und kein-CC gelistet ist)\n - Kled: War bereits korrekt. (R: kein Skillshot. Q: Skillshot)\n - WW: Gleich Kled. (R: Skillshot. E: Kein Skillshot)\n - Vi: Gleich Kled (R: kein Skillshot. Q: Skillshot)\n - [Vayne-E](http://leagueoflegends.wikia.com/wiki/Vayne/Abilities) ist tatsächlich nur ein Point'n'Click-Spell. (Somit ist sie bereits korrekt)\n - Tahm: Gleich Kled (Q: Skillshot. W: Kein Skillshot)\n - Sejuani: Gleich Kled (E: Kein Skillshot. R: Skillshot)\n - Poppy: Ist korrigiert\n - LuLu: Kommt ist \"Interpretationssache\"\n - Nautilus: Gleich Kled (R und P: Kein Skillshot. Q: Skillshot)\n \nIm wesentlichen waren also nur zwei Fehler und dafür so ein riesen Absatz: Respekt!\n\n>[ Rakan E](http://leagueoflegends.wikia.com/wiki/Rakan/Abilities) ist ein SS\n\nDa erklär mir mal folgendes:\n\n - Wo ist das E ein Hard-CC?\n - Wo ist das E ein Skillshot?\n\nEs ist ein Point'n'Click Schild für den gewählten Verbündeten und ein Dash für Rakan.\n\nAn dieser Stelle korrigiere ich ebenfalls die Aspekte nach denen ich die Liste formuliert habe. (Unter der Liste)","replies":[{"poster":"SP41636D471","date":"2018-08-22T15:16:07.597+0000","up_votes":1,"down_votes":1,"body":"Ich meine Rakans W sry. Müsste aber eigentlich klar sein was ich meine....\nSie hat Fehler weil es so aussieht als hätte kled (und alle anderen Champs die ich aufgezählt habe) einen Point to click Hart CC. haben die nicht also habe ich recht und du solltest bitte die liste Korrigieren oder einfach gleich gar nicht machen wenn du die keine Mühe gibst. \nKann es sein das du Zoe nicht kennst? Wenn sie die buble trifft macht der nächste spell am Target % an Hand vom post-mitigation damage True dmg. Das ist einfach nicht fair. Die Q macht damit one Shot dmg. einfach nur weil du eine E getroffen hast... \"Skill\"\nDu hast glaube ich nie gegen Brand gespielt oder mit ihn deshalb kann ich es dir nicht so gut erklären warum er sehr sehr sehr Bescheuert ist mit seinem Skill Shots. \nWas meist du mit ahri? was ich geschrieben habe stimmt. \n\"Nur weil ein Ziel sich nicht bewegt oder die Bewegung vorhersehbarer ist, ändert sich nicht die Charakteristik eines Zaubers. Skillshots werden nie zu Point'n'Click-Spells egal wie das Ziel reagiert. (Ich meine wenn ein Spieler nicht dodged wird ein Skillshot auch nicht zum Point'n'Click-Spell)\"\nhast du geschrieben aber... ich meinte das nur bildlich gesehen... es ist doch klar das es immer noch ein SS ist.... die Treffer rate steigt halt um 90% also..... PtC....... das meinte ich ich dachte das wäre offensichtlich genug...","replies":[{"poster":"Amycos Cyrus","date":"2018-09-29T12:50:08.480+0000","up_votes":1,"down_votes":0,"body":"> Ich meine Rakans W sry.\n\nHat bereits gestimmt. Rakan ist unter Skillshot (W) und kein Skillshot (R) gelistet.\n\n> Müsste aber eigentlich klar sein was ich meine....\n\nWenn du E schreibst soll ich W denken? Aha. Merke ich mir, wenn wir uns mal wieder begegnen.\n\n> Sie hat Fehler weil es so aussieht als hätte kled (und alle anderen Champs die ich aufgezählt habe) einen Point to click Hart CC.\n\nDas sagt die Liste gar nicht aus. Die Kategorien sind: \"Skillshot\" und \"kein Skillshot\". Es gibt sehr viele Wege CC anzubringen, wenn es nicht über einen Skillshot passiert.\n\n- Rakan benötigt nur das Passieren des Gegners, um ihn zu charmen.\n- Kled sucht sich sein Ziel selbstständig.\n- Warwick feared AoE.\n- Vi, Tahm und Sejuani haben Point'n'Click-CC\n\n> haben die nicht also habe ich recht und du solltest bitte die liste Korrigieren oder einfach gleich gar nicht machen wenn du die keine Mühe gibst.\n\nIch habe mir sogar die Mühe gemacht Champions nicht pauschal zu ordnen, sondern mehrfache Nennungen für alle Champions durchzuführen, die Fähigkeiten unterschiedlicher Charakteristika auf sich vereinen.\ne.g. Amumu: Skillshot Q und \"kein Skillshot\" R bzw. Kayn, der in der Base- und Blue-Form keinen Hard-CC besitzt und in der Red-Form über einen AoE-Skillshot verfügt.\n\n> Kann es sein das du Zoe nicht kennst? Wenn sie die buble trifft macht der nächste spell am Target % an Hand vom post-mitigation damage True dmg.\n\nIch kenne sie recht gut. Bin ihr zum Release recht oft in der Toplane begegnet und durfte auch schon häufiger in der Midlane gegen sie antreten.\nÜber die Funktion des E's bin ich mir durchaus bewusst. Wie kommst du darauf, dass ich sie nicht kennen würde?\nIn dem Text über Zoe habe ich ja beschreiben, dass ihre Schadenserhöhung deutlich höher ist, als die von Ahri. (Ahri +20% ohne Cap. atm. in magischem Schaden und Zoe +100% mit Cap. E-DMG in True-DMG) somit muss Ahri 103% mehr Schaden durch ihre Folgezauber machen, um gegen 38,5 MR den selben Schaden zu machen, wie Zoe mit einer E-Q Combo.\n\n**Für Interessierte:** Zoe verdoppelt Schaden gegen Ziele des E, wobei das E und Q selbst magisch bleiben. Um das Maximum des Caps zu erzielen, machen als E und Q exakt gleich viel Schaden. => 200% Q-DMG in magischem Schaden und 100% in True-DMG\nUm nun auf den Schadenswert zu kommen nutzen wir die Level 18-Base-MR Ranged 38,5: 244% des Q-DMG werden als angerechnet. \n\nDa True-DMG von Schadensvarianzen unabhängig ist erhöht das Ahri-E nicht die Rückkehr der Q. Um also auf die selbe Schadensverstärkung ihres Q zu kommen, wie sie Zoe zugänglich ist muss also die 20% Schadensverstärkung der E den Selben absoluten Wert erzielen, wie die E von Zoe. => 244% - 50% (die Rückkehr des Ahri-Q) = 194%\nNun benötigen wir die MR 38,5 => 269,25%\nNun teilen wir durch 1,2 (die Verstärkung des E) => 224,375%\nAhri muss also für die selbe Verstärkung ihres Q mit ihrem Q-Hinflug 224,375% des Schadens machen, den Zoe mit ihrem Q macht.\nNun nochmal im Vergleich. Ahri Q-Hinflug: 40-140 + 35% AP vs. Zoe Q: 57-500 + 60-150% AP\nFür den gleichen Schaden müsste Ahri also mehr 961,6% der AP von Zoe besitzen. (150/35 x 2,24375 in % = 961,6...%)\nMan gut, das Ahri nicht nur einen Zauber verstärken kann und man vor Zoe auch noch wegkommt, wenn man am einschlafen ist. XD\n\n> Das ist einfach nicht fair.\n\nFür das E wie es aktuell ist teilweise ja. Die Zoning-Area, wenn Zoe verfehlt ist zu viel des Guten, weshalb im Raum steht sie möglicherweise zu entfernen. Die bloße Verstärkung, wenn sie das E auch tatsächlich trifft, finde ich in Ordnung, da sie anders als nahe zu jeder andere Hard-CC-Skillshot 1,4 Sekunden auf den CC warten muss.\n\n> Die Q macht damit one Shot dmg. einfach nur weil du eine E getroffen hast... \"Skill\"\n\nDa gibt es recht viele Champions.\nWeiterhin cappt die Q das E-Cap nahe zu immer, da das Cap des E maximal 440 + 40% AP ist, währen die Q einen Schaden von bis zu 200-500 + 60-150% AP anrichtet. Also cappt das Q in Melee-Range bei 720 AP, wobei der Base-DMG des max-Q bereits das E cappt. (Da man jedoch fast immer mindestens die halbe Distanz der Q nutzt und das E nicht als erstes maximiert sind die geringen Schadenswerte der Q und die hohen Kapazitäten der E bis Level 13 irrelevant)\nDiese \"One-Shots\" würden in der Regel auch ohne das E funktionieren. XD\n\nDieses Problem ist vielleicht einigen noch von der alten Nidalee bekannt, die mit ihrem Human-Q dasselbe konnte.\n\n> Du hast glaube ich nie gegen Brand gespielt oder mit ihn deshalb kann ich es dir nicht so gut erklären warum er sehr sehr sehr Bescheuert ist mit seinem Skill Shots.\n\nIch liebe Brand zu spielen und ich hasse es gegen ihn zu spielen. Das Problem sehe ich jedoch nicht in seinen 2 tatsächlichen Skillshots (Q und W) sonder in der R, der Passiven und dem mangelndem Willen vieler Teams, Distanz zu erzeugen, um den Schaden zu reduzieren.\n\n> Was meist du mit ahri? was ich geschrieben habe stimmt.\n\nWir können das jetzt mal für Leute machen, die keine Lust zum googlen haben oder keine Ahri spielen.\n\nDeine Aussage: \"Alle ihre Spells machen dann 20% mehr Dmg und alle spells treffe eigentlich zu 100%\"\n\nEntwicklungstechnisch: Es sollte aufgefallen sein, dass es Zauber in Ahris Kit gibt, die nicht verstärkt werden können, da sie nicht up sein können. (Die E wird nie verstärkt.)\nDadurch das das W durch sich selbst gegen ein einzelnes Ziel um 140% geschwächt wird puffert die E diesen Effekt, sodass sie nur noch um 108% verringerten Schaden macht, statt dass sie 20% mehr Schaden macht. Das einzige was man hier gewinnt ist eine Priorisierung, sodass die W keine Minions wählt.\nDie R priorisiert jedoch keinen Champions, sodass die R selbst mit dem W in keinem Fall zu 100% trifft.\n\nMathematisch:  Deine Recherche zum Thema True-DMG hat ja hoffentlich ergeben, dass True-DMG von Schadensmultiplikation ausgenommen ist. Weder Reduktionen (Alistar-R o.Ä.) Resistenzen (MR oder Armor) noch Schadenserhöhungen (Ahri-E) werden auf True-DMG angewandt. Die Ahri Q wird also nur auf ihrem Hinweg verstärkt.\n\nGrammatikalisch fällt auf, dass du die Aussage sogar im Zweifel formuliert hast (hattest, sofern nach dem 29.9.18 geändert), weil du sie mit \"eigentlich\" formuliert hast.\n\n> das meinte ich ich dachte das wäre offensichtlich genug\n\nSo viel wie hier im Forum geschrieben wird, nehme ich inzwischen alles so war, wie es formuliert wurde. Wenn du es anders meinst, DANN SCHREIB GEFÄLLIGST WAS DU WIE UND WARUM SO MEINST, WIE DU ES DARSTELLST!!!!!!\n\n___\n\nMfG. Ein Leser, der diesen Artikel in weiteren Diskussionen verlinken wird.","replies":[]}]}]}]}]},{"poster":"xDelightify","date":"2018-08-20T06:59:40.500+0000","up_votes":2,"down_votes":1,"body":"Junge, hast du die Größe von Nautilus Anker mal gesehen? Die hit Box ist die gesamte Flasche davon, so wie es realistisch ist. Die animation ist seltsam, getroffen hat er aber zu 100% ;)","replies":[{"poster":"SP41636D471","date":"2018-08-20T10:55:33.166+0000","up_votes":1,"down_votes":0,"body":"nur mal so, weil es mich \"getroffen\"hat bin ich in die Richtung Gemoved. Das heißt ich stante weiter links aber weil es \"getroffen\" hat, hat es mich weiter nach recht verschoben damit ich vor Nautillus lande den der Spell macht ja das ich vor hin bin. Das haben auch alle hier die Antworten realisiert bis auf dich...","replies":[]}]},{"poster":"Uranbrennstab","date":"2018-08-19T21:33:07.339+0000","up_votes":2,"down_votes":1,"body":"Ist das ein von Bildschirm abfotografiertes Bild? \nI am out.","replies":[{"poster":"SSI CptHaunted","date":"2018-08-20T06:20:38.844+0000","up_votes":2,"down_votes":1,"body":"Natürlich. Genau so muss das...","replies":[{"poster":"SP41636D471","date":"2018-08-20T10:52:38.953+0000","up_votes":1,"down_votes":0,"body":"Genau richtig Beschert euch über das Foto anstatt den Beitrag zu lesen. Ihr habt das System Gecheckt!\n......","replies":[{"poster":"SSI CptHaunted","date":"2018-08-20T13:12:28.009+0000","up_votes":1,"down_votes":0,"body":"Hab den Beitrag gelesen. Dir wurde allerdings schon alles erläutert, das muss ich nicht noch wiederholen.","replies":[{"poster":"SP41636D471","date":"2018-08-20T16:51:01.115+0000","up_votes":1,"down_votes":0,"body":"Dann beschwere dich auch nicht über sowas belangloses es hilft niemanden sowas zusagen/schreiben.","replies":[{"poster":"SSI CptHaunted","date":"2018-08-21T06:10:07.167+0000","up_votes":1,"down_votes":1,"body":"Wer weiß...","replies":[]}]}]}]}]}]},{"poster":"SvenniGod2004","date":"2018-08-21T02:26:06.674+0000","up_votes":1,"down_votes":1,"body":"Ist einfach nur ein Anzeigebug, das gibts halt bei älteren Champs, Thresh hat das auch recht übel.\nUnter Diamond brauch sich hier eigentlich niemand über Details zu unterhalten, da nur Topspieler das Balancing einschätzen können.\n\nDas in low Elo Spieler Champs oder Spells nicht respektieren ist keine Ausnahme, sondern Standard, daher kann sind Aussagen von solchen Leuten \"XYZ ist zu op weil\" auch uninteressant.","replies":[{"poster":"SP41636D471","date":"2018-08-22T15:05:08.753+0000","up_votes":1,"down_votes":0,"body":"..... was?\nalso weil ich kein Pro palyer bin sind alle meine aussagen falsch? Also auch alle aussagen von allgemein jeden Spieler der keiner ist? okay wenn du meinst...","replies":[{"poster":"SvenniGod2004","date":"2018-08-22T19:37:27.212+0000","up_votes":1,"down_votes":0,"body":"Nein uninteressant, weil alle Leute immer von Allgemeingültigkeit sprechen. Ja mag sein das irgendwas zu OP ist was eigentlich gar nicht OP ist, das leigt aber daran das derjenige nicht spielen kann. Punkt.","replies":[{"poster":"SP41636D471","date":"2018-08-22T20:46:43.795+0000","up_votes":1,"down_votes":0,"body":"Aso aber wenn Pros das sagen das stimmt es ahhh verstehe","replies":[{"poster":"SvenniGod2004","date":"2018-08-25T01:18:33.829+0000","up_votes":1,"down_votes":2,"body":"Nein nichtmal dann muss es stimmen, deswegen bildet man sich auch ne eigene Meinung.\nMeinungsfreiheit heißt nicht, dass man auch zu allem was sagen muss. Wenn man keine Ahnung von Elektrotechnik hat, dann sagt man auch nix dazu.\nMan kann ja seine Meinung sagen aber glaub nicht dass es wirklich leute interessiert die was daran ändern können wenn du so eine Wall of Text hier verfasst.\n\nAllein wie der eine versucht hier Brand zu beschreiben, 90% falsch was er da schreibt.\nIch seh hier halt nur \"aber wieso macht XYZ soviel dmg mimimi eigentlich sollte doch mimimi und das ist unfair mimimi\".","replies":[]}]}]}]}]},{"poster":"Pilze","date":"2018-08-20T09:02:54.327+0000","up_votes":1,"down_votes":0,"body":"Einige Hit Boxen sind wirklich schlecht programmiert das weiß eigentlich jeder. Wer mehrere Skins für einen Champion besitzt weiß das es sogar innerhalb der Skins zu Hit Box Veränderungen kommt. Da gibt es massenweise Videos zu im Net. Deswegen sind einige Skins in den Profi Matches auch deaktiviert, weil sie Einem einen Vorteil verschaffen. Ich glaube das populärste war der Morgana Skin 2013 ( glaube ich ) wo die Hit Box ziemlich groß war und man die Fähigkeit kaum gesehen hat. Er wurde für die WM gesperrt. \nEin gutes Beispiel ist auch der IBlitzcrank der mehr Reichweite hat als alle anderen Skins, der BumBum Skin hat eine größere Hit Box als alle anderen. So gut viele Skins auch sind wenn man auf Nr. Sicher gehen will ist es besser das Orginale zu nehmen.","replies":[{"poster":"SP41636D471","date":"2018-08-20T10:56:13.466+0000","up_votes":1,"down_votes":0,"body":"Das wusste ich nicht. Vielen Dank für die Antwort hat mir weitergeholfen.","replies":[]}]},{"poster":"PeterPepper","date":"2018-08-21T08:50:51.114+0000","up_votes":2,"down_votes":2,"body":"Als Ahri Main muss ich jetzt einfach mal etwas sagen... Du hast überhaupt keine Ahnung von Ahri. Weisst du wie schwer es ist einen Charm überhaupt zu treffen?  Wenn ich deinen Text so lese, wohl eher nicht. Wenn ich 50 % meiner Charms treffe ist das seeeeeehr viel. Jedes Spiel eine solche Quote zu erreichen ist unmöglich und es braucht zwei Spell-Rotationen (E,Q,W) um einen Laner zu töten. Mit der Ulti hast du zwar die Möglichkeit mit einer Rotation einen Kill zu holen, aber die hat 1. einen sehr hohen CD am Anfang (Zed, Fizz, Talon etc. haben ihre Ulti vor dir wieder). Mages spielen dann meistens mit {{summoner:21}} oder {{item:3029}} und dann sind da noch Mages mit Schilden und diese kannst du in der Lane nicht von 100 auf 0 bringen mit einem Charm und dann kommt noch hinzu, dass die meisten von denen eine ziemliche easy Lane gegen dich haben. \n\nWenn du als Ahri, dann halt trotzdem den Oneshot auf dem ADC bekommst, ist es nur aus dem Grund, weil du entweder Feed bist oder einen Exp Lead und 2-3 Level über dem ADC bist und dein Basisschaden entsprechend schon höher ist oder du praktisch Fullbuild hast. Aber das ist ja genau das, was jeder gute Assassine macht, Oneshots. \n\n\nDas einzige was bei letzten Buff ein bisschen übertrieben war sind die 0.4 Sekunden zusätzliche Basis-CC-Dauer. Das gibt dir unter dem Strich schneller höheren Schaden, da du gleich die W maxen kannst ohne zuerst zwei Punkte in den Charm zu investieren für eine anständig lange CC-Dauer.","replies":[{"poster":"SP41636D471","date":"2018-08-22T15:03:55.313+0000","up_votes":1,"down_votes":0,"body":"Ich habe ahri schon öfters gespielt. Den E zutreffen ist wirklich sehr einfach. Vielleicht bist du auch nicht so gut wie ich mit Ahri aber der spell E gehört finde ich zu den einfachsten SS´s die es in dem Game gibt. Super viel Range und fliegt super schnell. Der Rest du du schreibst ist belanglos.","replies":[]}]},{"poster":"ImTheFox115","date":"2018-08-19T18:47:17.652+0000","up_votes":2,"down_votes":3,"body":"1. man\n2. Positioning \n3. Wenn du etwas op findest spiel es selber\n4. „Du bist ein Verrückter der einfach nur dummes Zeug redet“ Check!\n5. Zoe kann jetzt immerhin nicht mehr neben dir Summs einsetzten und ohne irgendwas zu treffen sich killen :)","replies":[{"poster":"SP41636D471","date":"2018-08-19T20:20:02.187+0000","up_votes":1,"down_votes":2,"body":"wow das war eine Antwort dich ich löschen will.... das hat einfach nicht mit dem zutun was ich schreibe","replies":[]}]}]}