{"poster":"Sir Bratze","date":"2015-05-27T10:37:50.015+0000","title":"Archiv","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Sch&ouml;nen guten Tag.\r\nIch w&uuml;rde gerne eine Anfrage stellen bez&uuml;glich des Archives.\r\nIch w&uuml;rde gerne darum bitten \r\nhttp://forums.euw.leagueoflegends.com/board/showthread.php?t=2083658&amp;page=1\r\ndiesen Thread von mir zu l&ouml;schen, da ich noch haufenweise Anfragen reinbekomme diesbez&uuml;glich.\r\nDa dieser schon lange nicht mehr aktuell ist, kann man diese Anfragen unter nervig verbuchen.\r\nIch w&auml;hren ihnen sehr verbunden wenn wir da etwas machen k&ouml;nnten.\r\nVielen Dank im Voraus f&uuml;r die M&uuml;he.\r\nMit freundlichen Gr&uuml;&szlig;en\r\nSir Bratze","replies":[{"poster":"Sir Bratze","date":"2015-05-28T20:46:44.164+0000","up_votes":1,"down_votes":0,"body":"ich hatte diesbezüglich eine Email geschickt, da kam nur zurück ich solle doch bitte hier einen thread aufmachen weil es nicht ihr Gebiet ist dagegen was zu unternehmen. Jetzt höre ich hier dass es hier niemand was machen kann xD\nLOGIC!","replies":[{"poster":"Rkoturdo Ndo","date":"2015-05-28T20:49:16.439+0000","up_votes":1,"down_votes":0,"body":"Heya\nDer Support kann das nicht machen und die Forenmoderation kann das nicht machen. Das heißt nicht das niemand das machen kann. Nur die die es machen können haben halt vermutlich besseres zu tun.\n\nMfG Rkoturdo","replies":[]}]},{"poster":"Evenrider","date":"2015-05-28T11:06:48.307+0000","up_votes":1,"down_votes":0,"body":"Klar kann Riot dies entfernen. Ist ja nicht so, dass die Seiten nicht auf ihren Servern gespeichert sind und unsere Browser sie sich von dort holen.\nDas was mich vorallem wundert ist, dass manche nach einem Team im Archiv suchen. Also nicht, dass du einen Thread dort erstellt hast, als das noch ging, sondern dass man in einem Archiv die Threads durchsucht und sich daraufhin beim TE meldet.\nArchiv heißt doch gerade, dass es nur noch als lesbarer Wert für die Nachwelt aufgehoben wird und man nicht davon ausgehen darf, dass diese noch aktuell sind.","replies":[{"poster":"Rkoturdo Ndo","date":"2015-05-28T11:10:54.532+0000","up_votes":1,"down_votes":0,"body":"Heya\nIch meinte, die Moderatoren können es nicht löschen.^^ Und warum sollte Riot sich um einen Thread aus dem Archiv bemühen....\n\nMfG Rkoturdo","replies":[{"poster":"Evenrider","date":"2015-05-28T11:17:08.311+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rkoturdo Ndo,realm=EUW,application-id=7hciEY9w,discussion-id=i496AcFY,comment-id=00030000,timestamp=2015-05-28T11:10:54.532+0000)\n>\n> Heya\n> Ich meinte, die Moderatoren können es nicht löschen.^^ Und warum sollte Riot sich um einen Thread aus dem Archiv bemühen....\n> \n> MfG Rkoturdo\n\nWerden sie nicht. Viel zu viel Arbeit 1 Thread rauszusuchen und zu entfernen. Und klar unsere Mods, ob nun Grün oder Orange angemalt, können das nicht.\n\nDas, was ich für wahrscheinlicher halte, ist wenn genügend Support-Anfragen ankommen, dass solche Threads dichtgemacht werden, da man selbst keinen Einfluss mehr hat, ist dass Riot zwar den Rest des Archivs behält, aber die dortige Abteilung \"Clan- und Teamrekrutierung\" entfernt. So sollte, selbst wenn die Posts selbst nicht gelöscht werden, nur noch Leute draufkommen, die den direkten Link dazu kennen, da die Verlinkung im Archiv fehlt.","replies":[]}]}]},{"poster":"Sir Bratze","date":"2015-05-28T11:01:01.363+0000","up_votes":1,"down_votes":0,"body":"naja Riot wird da doch bestimmt was machen können. Die setzen doch nicht etwas unlöschbares ins netz^^","replies":[]},{"poster":"Sir Bratze","date":"2015-05-27T19:32:31.488+0000","up_votes":1,"down_votes":0,"body":"ich suche ja spezifisch hier im forum nach etwas anderem als ich dort gesucht habe logischerweise. SOnst würde ich sowas nicht schreiben.\nDiese Spieler posten mir auch diese Links von dem alten Thread deshalb kann ich diese Behauptung verneinen.\nEs ist eher unwahrscheinlich dass ich sowas schreibe ohne Grund oder?\nich meine schon was ich geschrieben habe.\nSämtliche Spieler posten mir den Link zum Archiv in welcher mein Thread ist.\n!!","replies":[{"poster":"Rkoturdo Ndo","date":"2015-05-27T20:30:00.908+0000","up_votes":1,"down_votes":0,"body":"Heya\nÄndert nichts daran, dass man es nicht löschen kann.\n\nMfG Rkoturdo","replies":[]}]},{"poster":"Sree","date":"2015-05-27T12:48:34.221+0000","up_votes":1,"down_votes":0,"body":"Soweit ich das in deiner History sehe, hast du im neuen Forum bereits verdammt viele Beitraege verfasst, welche sich um die Teamsuche drehten. Sogar vor 4 Tagen einen Thread deswegen eroeffnet: http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/3wK5wbhw-gold-allrounder-sucht-ranked-team\n\nDaher brauchst du dich nicht wundern, wenn du Anfragen bekommst.\nIch halte es fuer extrem unwahrscheinlich, dass viele Spieler ueber deinen alten Post stolpern. Davon mal abgesehen: Es ist nicht moeglich etwas aus dem Archiv zu loeschen.","replies":[]}]}