{"poster":"Devilshroom","date":"2018-06-29T13:06:01.472+0000","title":"Eine Bitte an alle zwischen Bronze und Platin","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":5,"body":"Hallo liebe Mitbeschw&ouml;rer,\r\n\r\nich habe eine kleine Bitte an euch, die vielleicht die ein oder anderen Nerven retten k&ouml;nnte.\r\n\r\nLERNT VERDAMMT NOCH MAL DIE BES*****ENEN SPIELE SAFE ZU BEENDEN, WENN IHR EINEN GOTT VERDAMMTEN LEAD AUFGEBAUT HABT!\r\n\r\nEs gibt tausende von Tutorials und es ist doch wohl mit jedem normal funktionierenden Hirn m&ouml;glich eine logische Schlussfolgerung zu finden, die das Game safe...ich wiederhole...SAFE beendet.\r\n\r\nDanke f&uuml;r eure Aufmerksamkeit und einen angenehmen Tag in der Kluft\r\nJG Darkin\r\n\r\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Aseryo Hasagi","date":"2018-06-29T13:09:40.514+0000","up_votes":2,"down_votes":0,"body":"Wie auch du denken viele leute ihre calls seien die besten\nalle sind dickköpfig und von ihrem eigenen talent überzeugt\nmich eingeschlossen\nlern das es zum spiel dazu gehört dann tiltest du auch nicht","replies":[{"poster":"OPChampsSucks","date":"2018-06-29T13:38:36.171+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Fattest Panda Eu,realm=EUW,application-id=YnZkMR0R,discussion-id=KUxABQrE,comment-id=0000,timestamp=2018-06-29T13:09:40.514+0000)\n>\n> Wie auch du denken viele leute ihre calls seien die besten\n> alle sind dickköpfig und von ihrem eigenen talent überzeugt\n> mich eingeschlossen\n> lern das es zum spiel dazu gehört dann tiltest du auch nicht\n\nwenn du nen plat 5 thresh hast der only geulteten alistar hooked dann fragste dich aber wirklich wie solche leute plat 5 und nicht plastik 5 sind.","replies":[{"poster":"Megamaexx","date":"2018-06-29T14:32:37.163+0000","up_votes":1,"down_votes":0,"body":"Immer noch besser als ein full ap Garen.","replies":[]}]}]},{"poster":"Devilshroom","date":"2018-06-29T13:29:27.982+0000","up_votes":1,"down_votes":1,"body":"Jo, hab mich auch wieder abgeregt. Aber ich wüsste dennoch gerne eure Einschätzung. Folgende Situation:\n\nDie Gegner haben einen Viktor, eine Vayne, Garen, Leesin und thresh. Vayne natürlich gefeedet nachdem die 30ste Minute anfing.\nWir hatten alle Inhibitoren frei, die Gegner hatten einen super Waveclear mit Viktor, Garen und Vaynes Statik, dementsprechen wird aus siegen nichts. Fighten konnten wir allerdings auch nicht, weil die Vayne viel zu gut von der Frontline (Lee, Garen, thresh) geschützt wurde. Wir waren auf der Topside, ich habe mich also auf die Botside geschlichen und Lee sowie Garen folgten mir, somit ein 4v3 auf der Toplane, mit Morgana, Lucian, Aatrox sowie Diana. Sprich eigentlich, wenn alle sofort auf Vayne gehen ein einfacher fight für die. Sie verlieren 4 zu 1, haben lediglich thresh erwischt und flamen mich, weil ich weggeangen bin. \nAngeblich hätten wir den Fight ja gewinnen können...","replies":[{"poster":"Ηastur","date":"2018-06-29T13:38:11.674+0000","up_votes":1,"down_votes":0,"body":"Wenn sie ohnehin jeden Fight gewinnen, warum dann überhaupt kämpfen? Alle Inhibs sind down, klingt an und für sich nach nem easy Baron, oder zumindest nen Bait um jemanden safe zu catchen.\n\nAch ja, ich kenne das aber. Jeder will immer fighten, selbst wenn das eigene Team 5 Tower und 20 Kills hinten liegt. Das ist halt das dumme an low Elo.","replies":[{"poster":"Devilshroom","date":"2018-06-29T13:49:09.388+0000","up_votes":1,"down_votes":0,"body":"Ne, die waren offen, nicht down.  Das witzigste ist dabei ja wir hatten Baron UND Elderdrake xD","replies":[{"poster":"Ηastur","date":"2018-06-30T08:50:06.606+0000","up_votes":1,"down_votes":0,"body":"Dann kanns mans erst recht easy beenden. Denke das 4-1 is schon nicht verkehrt gewesen. Unlucky wenns dann trotzdem nicht klappt.","replies":[]},{"poster":"RainerKilltKeina","date":"2018-06-29T13:59:23.289+0000","up_votes":1,"down_votes":0,"body":"Meiner Ansicht nach, hast du es richtig gemacht, da du quasi für einen TF Vorteil für dein Team gesorgt hast.\nwenn die zwei sich um dich kümmern, dann müsste dein Team einen fight forcen und lucian Atrox und diana müssten einen All-In auf die Vayne gehen und eigentlich auch gewinnen.","replies":[]}]}]}]},{"poster":"RainerKilltKeina","date":"2018-06-29T13:09:41.643+0000","up_votes":1,"down_votes":0,"body":"Nur funktioniert nicht jedes Hirn gleich.\nOder der eine findet einen Weg schwachsinnig, obwohl die Mehrheit ihn als den besten Weg anerkennt.","replies":[]}]}