{"poster":"Vollani","date":"2015-02-08T02:24:21.875+0000","title":"Hacer lo que mas te guste","subforum":"Off-topic y temas personales","up_votes":1,"down_votes":0,"body":"Saludos Comunidad!!!!\r\nNo soy de subir muchas discusiones en el foro pero siento que ahora necesito la opinión y apoyo de la comunidad.\r\nVerán ya hace un año que termine la secundaria ( Por un lado estoy feliz pero por otro me siento algo mal, no poder juntarse ni verse con tus amigos todos los días e iniciar la vida de un adulto casi ). Lo cual da inicio a lo siguiente: ¿QUE DEMONIOS VOY A ESTUDIAR? ¿ALGO QUE ME ASEGURE UN BUEN FUTURO? O ESTUDIAR Y TRABAJAR EN ALGO QUE ME GUSTE Y ME HAGA FELIZ. \r\nMis padres y amigos siempre me dicen que estudie en algo que de verdad me guste pero... lo que a mi me gustaría estudiar y trabajar en mi futuro no se si sera posible; se que esto sonara tonto, estúpido, típico y de seguro ya se a posteado. A mi me encantaría trabajar en la parte de desarrollo de Riot Games (crear champs, skines, mapas, eventos TODO) siento que... no no siento ESTO ES LO MIO!!! tengo muchísimas ideas y aportes a este juego. \r\nSi algo humillante y típico no ???? \r\nBueno no me importa yo quiero hacer algo que me gusta y esto es lo que me gusta no me importa se gano o mucho es lo que quisiera hacer en mi vida, pero todo buen camino tiene posos, palos y piedras. {{item:3151}}  Esos obstáculos para mi son: ¿Que necesito para esta carrera? ¿Podre algún día trabajar en Riot Games ?\r\nA esto va mi Post, Discusión o como la quieran llamar amigos. Por eso les pido su ayuda. Quiero que me digan lo que sepan sobre el tema si mi sueño es posible, si hay algún administrador que se interese en este Post le pido que me ayude. \r\nEh averiguado mucho sobre el tema se que en cada sucursal de Riot Games hay una pagina donde muestran los puestos de trabajos que la empresa necesita pero no quería confiarme del todo quiero averiguar todo lo que sea necesario para esto. \r\nSi alguien sabe algo y desea compartirlo le estaré sumamente y eternamente agradecido. Muchas gracias.","replies":[{"poster":"GaßY","date":"2015-02-08T03:21:30.469+0000","up_votes":1,"down_votes":0,"body":"Y, si no es el caso que empieces directamente por Riot, vas a tener que empezar por otros medios.\nPrimero fijate qué tipo de cosas podes hacer: Diseñador digital, gráfico, ilustrador, músico, programador, etc... \nAnotate en alguna universidad, busca un trabajo de medio tiempo, si es relacionado aunque te exploten, vas a adquirir experiencia.\nHace trabajos propios, y cosas así. Y por ese lado seguramente te llamarán o Riot o alguna empresa parecida.\n\nEdit: Pero no hagas años sabáticos, que te haces más viejo y muchas empresas buscan gente de menos de 25 y y que tengan como 30 años de experiencia.","replies":[{"poster":"Vollani","date":"2015-02-08T04:01:00.278+0000","up_votes":1,"down_votes":0,"body":"Gracias :) me pondré a ver las carreras :D eso si no fue del todo sabático el año trabaje casi todo el año jaja necesitaba separarme un tiempo del ámbito escolar xD","replies":[]}]}]}