{"poster":"xTheTeox","date":"2018-09-26T06:52:25.237+0000","title":"consiglio su Miss Fortune","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Ciao a tutti ultimamente sto provando MF con la runa attacco sostenuto e mi stavo chiedendo se &egrave; meglio buildarla con letalit&agrave; o con oggetti critico tipo rasoio delle tempesta e frammento dell&#039;infinito. Cosa ne pensate ?","replies":[{"poster":"Fujiko Mine","date":"2018-10-08T11:14:40.545+0000","up_votes":1,"down_votes":0,"body":"{{item:3142}} {{item:3147}} {{item:3009}} {{item:3071}} {{item:3026}} \nPer ultimo scegli tra\n{{item:3080}} questo per avere rubavita oppure se sei contro un team tanky opta per {{item:3036}} o questo contro tank che si curano tanto {{item:3033}} \n\nLe rune che utilizzo sono quelle con la cometa arcana, in early fanno un buon poke e anche dopo la cometa aiuta a far danni visto che MF si basa molto sulle abilità","replies":[]},{"poster":"Sılver","date":"2018-09-26T09:40:03.822+0000","up_votes":1,"down_votes":0,"body":"Io la vedo spesso giocata con Raccolto oscuro che ti da un buon poke con la q in laning phase, ma c'è anche chi la gioca con la cometa arcana. Per la build secondo me la più gettonata è Youmuu + Black Cleaver seguita poi da quello che più ti serve nel game come per esempio Guardian Angel per statistiche più difensive, oppure Rapid Firecannon oppure ancora Lord Dominik per la penetrazione armatura.\nComunque se guardi sul sito  Probuilds puoi trovare le build e le rune utilizzate dai pro player e dei challenger consultando anche il match up dei vari game, come maxano le spell, puoi cercare in base al ruolo/champion specifico/giocatore... insomma per me è abbastanza utile sopratutto quando hai dei dubbi su qualcosa, lo uso spesso. (Anche per \"spiare\" cosa stanno giocando i pro al momento)","replies":[{"poster":"xTheTeox","date":"2018-09-26T10:13:52.257+0000","up_votes":1,"down_votes":0,"body":"il problema è che non sono un pro XD gioco con raccolto oscuro solo che il problema è che devi uccidere un minion cannone e fare subito un attacco in 20 secondi e per come gioco io questa runa mi è praticamente inutile. Ed è proprio per questo motivo che pensavo di puntare più sul danno che sulla letalità","replies":[{"poster":"pinkmanTS","date":"2018-09-28T23:44:59.498+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xTheTeox,realm=EUW,application-id=cAOZwaUi,discussion-id=cMxl6Eoj,comment-id=00000000,timestamp=2018-09-26T10:13:52.257+0000)\n>\n> il problema è che non sono un pro XD gioco con raccolto oscuro solo che il problema è che devi uccidere un minion cannone e fare subito un attacco in 20 secondi e per come gioco io questa runa mi è praticamente inutile. Ed è proprio per questo motivo che pensavo di puntare più sul danno che sulla letalità\n\nnon devi per forza ucciderlo basta che sei vicino quando muore, prendi un'anima pure dal tuo carretto quando muore, puoi proccarlo anche solo facendo la q su un minion.. a meno che non sta farmando in uganda l altra bot prima o poi lo procchi","replies":[{"poster":"xTheTeox","date":"2018-09-29T10:42:48.734+0000","up_votes":1,"down_votes":0,"body":"si ma se non si riesce a sfruttare la morte del carretto allora la runa è praticamente inutile o mi sbaglio? cioè se non colpisci nessuno in quei 20 secondi","replies":[]}]}]}]}]}