{"poster":"SnowMan335","date":"2016-02-19T07:54:14.957+0000","title":"Mis Reportes sirven?","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Ya se que me mucha Gente postea que sus reportes han servido,Pero,Yo he reportado a mucha gente toxica he puesto los motivos y Todo, aun asi, No me llega el mensaje de sancion, Por eso pido que me expliquen pofavor si Mis reportes Han servido o no, Porque si mis reportes no sirven Para que seguir Reportando?\r\n\r\n\r\nPD:No digo que sea necesario que apliquen sancion a los que reporte si no quieren solo pido que me expliquen pls si han servido mis Reportes{{sticker:slayer-jinx-wink}} \r\nBueno eso es lo que queria decir Gracias y adios.{{summoner:4}}","replies":[{"poster":"Jota312","date":"2016-02-19T08:07:03.461+0000","up_votes":3,"down_votes":0,"body":"El mensajito de \"tus reportes han echo que alguien sea baneado\" es bastante random , osea no les llega a todos los que reportaron a un baneado (lo dijo un Rioter ) asi que no te preocupes si no te  llega , sigue reportando , esta lleno de gente que es baneada es solo cosa de buscar en este foro como los permabaneados lloran . \n\nEjemplo : http://boards.las.leagueoflegends.com/es/c/charlas-generales/BgOfnUr8-una-maaana-mas-en-el-foro-de-las\n\nTus report siven :D , son el granito de arena que ayuda a que la lacra de este juego sea menor.\n\n_____________________________________________\nNunca olvides reportar a quien lo merece , y dar honor respectivamente.\nSaludos","replies":[{"poster":"SnowMan335","date":"2016-02-19T08:15:42.252+0000","up_votes":1,"down_votes":0,"body":"+1 para ti :)","replies":[]}]},{"poster":"TheDieGooGle","date":"2016-02-19T08:00:29.076+0000","up_votes":2,"down_votes":0,"body":"Tengo un amigo (bueno tenia) que era bastante flamer y trolleaba en bastantes partidas , y era tan pesado que el team contrario y el nuestro se ponia deacuerdo para reportarlo le llegaba el aviso y todo pero en la siguiente no trolleaba ni nada y en la subsiguiente volvia a fedear y todo eso .\n\nsegun yo los reports no estan cumpliendo su funcion , yo creo que el invocador tendria que ser reportado minimo en 3 partidas para que lo sancionen siquiera con la cola de baja prioridad.\n\npero no pierdas la fe sigue reportando","replies":[{"poster":"SnowMan335","date":"2016-02-19T08:04:03.376+0000","up_votes":3,"down_votes":0,"body":"Gracias por comentar,Buen hombre! como dices, Seguire reportando  A ver si los reportes funcionan,Gracias.{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"The Inkanus","date":"2016-02-19T16:47:39.395+0000","up_votes":1,"down_votes":0,"body":"Vos seguí reportando, la galería tiene que crecer!\nhttp://imgur.com/a/V17t9","replies":[]}]}]},{"poster":"Warshen","date":"2016-02-19T13:55:10.117+0000","up_votes":2,"down_votes":0,"body":"Yo tambien estoy en la misma pensando que mis reports no sirven de nada, Riot dijo que si reportamos en exceso nuestros reportes tendran menos peso pero yo soy de los que solo reportan cuando un jugador es insoportablemente flamer, y aun asi nunca me llego el aviso.","replies":[]},{"poster":"JACKY FANBOY","date":"2016-02-19T12:23:18.309+0000","up_votes":2,"down_votes":0,"body":"Cuando reportes tomate el tiempo de escrbir el report, ya que hay mucha gente que reporta sin escribir nada, como riot sabrá lo que hizo el jugador sin escribirlo?","replies":[{"poster":"SnowMan335","date":"2016-02-19T12:29:19.024+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}} {{champion:86}}","replies":[]}]},{"poster":"MainPyke13","date":"2019-07-05T15:32:42.124+0000","up_votes":1,"down_votes":0,"body":"recien vengo de que un jax (theproudstalker), jugador de las, me robe toda la jg linea que yo estaba jugando y ademas el eligio soporte y no supo respetar su linea y por si esto fuese poco troleo y fedeo como quiso en vez de ayudar a su team, pido por favor q sea baneado del servidor debido a que esta gente es la que contamina un juego tan lindo como ser el league opf legends pido por favor que este problema sea solucionado porque de verdad es frustrante querer sentarte a jugar unos minutos en busca de diversion y tranquilidad y esta gente te saca esa poca ganas de hacer algo espero que me escuchen y desde ya muchas gracias...","replies":[]}]}