{"poster":"RedJohhnn","date":"2016-10-19T21:05:21.343+0000","title":"Since we are probably getting item sets.. make the item-sets-system sharable.","subforum":"Client Discussion","up_votes":8,"down_votes":1,"body":"Since you say that only a low percentage use item sets, then make the system so we can share our item sets with people.\r\n\r\nEither make them public in each user&#039;s profile. And from there to have a button for each item set page, called &quot;Add Page&quot;. This way people will be able to &quot;download&quot; item set pages.\r\n\r\nOr allow users to recommend item set pages to other users. (accept/decline)\r\n\r\nSo i assume that this would increase how many people use item set pages at least by 5% (AKA: hundred of thousands)\r\n\r\nJust sharing my idea, since i kept it for so long, and it seemed like a good time to mention, since everyone is protesting about not having item sets in the new client.","replies":[{"poster":"Riot a huevo","date":"2016-10-19T21:08:56.587+0000","up_votes":6,"down_votes":1,"body":"Sounds like a good idea, I can see how that would be valuable for many users. At the moment our first goal is to reach parity with the legacy client, once we get there, we'll be able to start conversations about new features. Not there yet, but not too far either!","replies":[{"poster":"Daetnas","date":"2016-10-19T21:38:54.951+0000","up_votes":4,"down_votes":1,"body":"I mean that's cool, but systems like that have been in place in competing games for years now, and only now do you want to start to catch up?\n\nIt'd be so easier for new players to understand how to play specific champions If guides were integrated into the game like in DOTA 2.\n\nIt'd be so much easier to teach the game to low level friends If they had access to all the summoner spells, Runes and Masteries right away, and weren't at a numerical disadvantage against players that are better than them player skill wise as well.\n\nHow useful would it be If you could rent a champion for a week like you can in Smite to decide If you like it before buying, and not have to wait for sometimes literally months for it to go on the free rotation?","replies":[]}]},{"poster":"UltraInventor","date":"2016-10-20T15:58:13.254+0000","up_votes":1,"down_votes":0,"body":"I think that the renting champion idea is ingenious. I got onto this page though because I really agree with sharing item sets. It is typically very difficult to share item sets, and for someone who likes trying out \"odd\" and unusual builds (like me) it would be tons easier if we could share item sets. I would however really appreciate it if we could attach notes to it (either item by item if desired or to a specific set or something more than just a few words, like as a sort of subheading or something.) Thank you for all of this.","replies":[]}]}