{"poster":"Mjolnir","date":"2015-07-20T20:56:52.376+0000","title":"Are we going to ignore this? Or follow it? You decide","subforum":"Miscellaneous","embed":{"description":"I want you all to memorize this, and I want you all to understand. League Of Legends - https://www.youtube.com/playlist?list=PLEv0FdrspR-1xRI8qX9dOAwT84WTxVx3l EUW Challenge - https://www.youtube.com/playlist?list=PLEv0FdrspR-3Kao2gbySo40tk79kCdg7n Q&A Playlist - https://www.youtube.com/playlist?list=PLEv0FdrspR-19igp7QR_j2kDsPdvBLK2c LoL Arams - https://www.youtube.com/playlist?list=PLEv0FdrspR-1niaJ8C35xKLWcO5e_eL6z LoL Moments - https://www.youtube.com/playlist?list=PLEv0FdrspR-2R9pDYJQ40YZT0VpMdLTxt","url":"https://www.youtube.com/watch?v=ikLbnLdrm_Q","image":"https://i.ytimg.com/vi/ikLbnLdrm_Q/hqdefault.jpg"},"up_votes":3,"down_votes":2,"body":"I honestly don&#039;t know...","replies":[{"poster":"Revelations 13","date":"2015-07-21T05:39:11.889+0000","up_votes":1,"down_votes":1,"body":"I'm with him this game is garbage, they have basically given up balancing this game and it is true they cater to LCS, I've been playing since Season 2 and I agree with everything, everything they do is profit driven, nothing is for the community, and don't give me that \"oh they are cumpanie they moost mek moniez someh0w\" no, every. single. thing. they release is 100% to maximise profit. I wont go on anymore the video is very good and I enjoyed.\n\nGame is Toxic, Makes you angry, sht graphics, low skillcap game (it is by comparison to other competitive games), zero community events, everything is for profit, game is balanced around DA PR0Z. Sht game, needs to die.","replies":[{"poster":"TeCoolMage","date":"2015-07-21T07:49:01.772+0000","up_votes":1,"down_votes":0,"body":"Low skill cap but balanced for pros, terrible graphics but made for money, how does Riot profit from LCS??? Most of them already bought all the champs and skins, while the players in really competitive play actually gain money from tournaments, not Riot. I'm just glad it's not DoTA 2. They're a much worse community, trust me. MOBA games are always toxic anyway.","replies":[{"poster":"Revelations 13","date":"2015-07-21T08:38:15.890+0000","up_votes":1,"down_votes":0,"body":"\"how does Riot profit from LCS???\"\n\n\"how does Riot profit from LCS???\"     \"how does Riot profit from LCS???\"  \n\n\"how does Riot profit from LCS???\"\n\nGuis how d0s rito prifit from lcz?","replies":[{"poster":"TeCoolMage","date":"2015-07-21T10:04:18.172+0000","up_votes":1,"down_votes":0,"body":"I really don't know. I don't even know what LCS stand for since I used to read it as LQS (league qualifier series was my guess until some time ago) and now I'm too lazy to search it up, I'm guessing it's League championship series or something. How DOES Riot benefit from LCS?\n\nOk did research. People buy tickets or something to watch these guys. I think this is the part where I stop believing in the tooth fairy and wonder how someone can bear to pay money to watch a free game being played while not even playing it yourself.","replies":[]}]}]}]},{"poster":"VENI VIDI VICI","date":"2015-07-20T23:40:18.954+0000","up_votes":1,"down_votes":2,"body":"Toolazydidn'tlisten, someone shorten it for me. My un-entertainment threshold can't let me go any further","replies":[]}]}