{"poster":"D4rkSoul77","date":"2016-05-22T21:02:44.424+0000","title":"Bug melden","subforum":"Melde einen Bug","up_votes":2,"down_votes":0,"body":"Wenn man eine Marke bekommt um einen Champion auf level 6 zu machen ist in der meldung die man bekommt ein fehler da steht n&auml;mlich : verdiene eine weiter Marke um level 6 f&uuml;r diesen Champion. Da fehlt noch was :D","replies":[{"poster":"TheParøx","date":"2016-05-22T21:07:04.853+0000","up_votes":1,"down_votes":0,"body":"...zu erreichen {{summoner:4}}","replies":[{"poster":"D4rkSoul77","date":"2016-05-22T21:15:45.934+0000","up_votes":3,"down_votes":0,"body":"Genau das fehlt","replies":[{"poster":"Enderized","date":"2016-05-22T22:29:16.833+0000","up_votes":2,"down_votes":0,"body":"verwende doch nächstes mal eine passende Thread Überschrift. <<.","replies":[]}]}]},{"poster":"Morgenstern689","date":"2017-08-11T12:42:38.182+0000","up_votes":1,"down_votes":1,"body":"Also ich weiß ja nicht, was ihr bei Riot den ganzen Tag so macht - aber offensichtlich nichts Nützliches.\n\nSeit eurem letzten Update hat man die härtesten Lags ever - man kann teilweise das ganze Spiel nichts machen - nichteinmal Monster töten mit Warwick.\n\nUnd jetzt hab ich aufgrund eures Versagens von euch auch noch die Strafe bekommen 5 Spiele mit niedrigerer Priorität (jedes Spiel 10 Min. warten) in die Warteschlange eingereiht zu werden.\n\nIch empfinde das als bodenlose Unverschämtheit und auch, dass ihr es in 24 Std. nicht schafft diese Fehler mal endlich zu beheben, lässt mich wirklich sehr an euren Softwarekompetenzen zweifeln.\n\nWeiter verstehe ich nicht, warum ihr ständig Änderungen macht, die total unnötig sind (wie z.b. der neue Kartenskin, der nebenbei bemerkt auch noch pothässlich ist) und nur zu immer noch mehr Bugs und Fehlern führen... Der Client ist mittlerweile beinahe unbenutzbar - er buggt die ganze Zeit rum, ist vollkommen unübersichtlich strukturiert, vollgepackt mit überflüssigen Funktionen, das Design ist grauenhaft, die Zeiten in der Championauswahl zur Auswahl von Bans und Champs sind unglücklich gewählt (deutlich zu kurz, wenn man viele Champs hat und vielleicht erst überlegen muss, wen man angesichts der Gegner am besten pickt und diesen Champ dann noch unter seinen 100 Champs raussuchen muss) - alles in allem ist der neue Client fürchterlich...\n\nWenn euch langweilig ist, warum nehmt ihr euch dann nicht endlich mal die Zeit, den Client soweit weiter zu entwickeln, dass er flüssig läuft und das Spiel nicht dauernd (trotz super Internetverbindung) hardcore rumbuggt, so, dass man zwangsläufig dauernd afk sein muss, weil man sonst nur feeden würde/kann - oder was soll man machen, wenn man irgendwo hinklickt und erst 3 Minuten später fängt der Champ an sich zu bewegen?...\n\nAlso wenn sich nicht bald gewaltig was zum Positiven ändert an eurem Client ist LOL für mich gestorben... Ich arbeite 60 Std. die Woche als Redakteur und habe sicher nicht die Zeit wegen eurer offensichtlichen konzeptionellen Inkompetenz stundenlang vor dem Client zu sitzen (aufgrund eurer ungerechtfertigten Strafen, die nicht ich sondern ihr verschuldet habt), um dann nach ner Stunde Wartezeit in ein Spiel zu kommen, das ich nicht spielen kann, weil der Client das ganze Spiel über buggt, als würde man versuchen das Spiel auf nem Pentium 4 zu spielen mit 1 GB DDR-1 RAM...\n\nIch weiß nicht was bei euch los ist - mit Rechtschreibung und Formulierung habt ihrs ja auch nicht so (wie sich vielerorts im Client leicht erkennen lässt) - arbeitet mal an euren Kompetenzen, daran, dass der Client flüssig und fehlerfrei läuft oder stellt bessere Leute ein, die nicht die ganze Zeit nur rumstümpern...\n\nUnmöglich echt, was ihr den Leuten erst anbietet und dann aufzwingt... Dass ihr euch nicht schämt... Was soll man angesichts solcher Inkomptenz (man wartet ja schon mindestens ein Jahr auf Besserung aber ihr macht alles immer nur noch schlechter) noch sagen?...\n\nIhr bei Riot habt einfach nichts drauf - das ist der Eindruck der bleibt, wenn man LoL spielt.","replies":[{"poster":"Morgenstern689","date":"2017-08-11T12:51:15.791+0000","up_votes":1,"down_votes":1,"body":"Ha 20 Minuten muss ich mittlerweile sogar schon vor jedem Spiel warten - und dann wenn dann einer aus der Championselect rausgeht oder abbricht darf man nochmal 20 Minuten warten...\n\nWas ihr glaubt den Leuten zumuten zu können ist einfach nur der Hammer... Lol ist für mich definitiv gestorben... Selten so eine Zeitverschwendung erlebt, wie euch und euren Produkten Aufmerksamkeit zu schenken...\n\nTotalversager seid ihr  bei Riot...\n\nSchöne Zeit euch Vollpfeifen noch mit eurem Stümperspiel... Wahnsinn echt was man sich bei euch geben muss...","replies":[]}]}]}