{"poster":"MajinLukas","date":"2016-09-01T12:42:11.861+0000","title":"Support Championpool finden","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo Leute,{{sticker:slayer-jinx-catface}} \r\nich brauche Hilfe einen Championpool f&uuml;r die Supporter Position zu finden. Ich kann mich nicht entscheiden welchen ich ausw&auml;hlen soll.\r\nDer Championpool soll alle Supporter typen abdecken, w&auml;re echt nett, wenn Ihr mir weiter helft.\r\n{{champion:12}} {{champion:1}} {{champion:136}} {{champion:53}} {{champion:63}} {{champion:201}} {{champion:3}} {{champion:43}} {{champion:40}} {{champion:89}} {{champion:117}} {{champion:99}} {{champion:20}} {{champion:267}} {{champion:25}} {{champion:78}} {{champion:223}} {{champion:44}} {{champion:16}} {{champion:37}} {{champion:412}} {{champion:143}} {{champion:26}}","replies":[{"poster":"Evenrider","date":"2016-09-02T08:46:04.086+0000","up_votes":1,"down_votes":0,"body":"Als Tanksup spiele ich momentan {{champion:14}}. Am Anfang hält er zwar weniger aus als z.b. Leona oder Braum, hat dafür andere Vorteile.\nz.b. ist sein Poke und sein Peeling besser als Leona dank E und Knock Ups. Trotz dessen gehört er immer noch zu den Engage Sups, du rennst rein und CCs den Gegner. Das kann Sion auch meisterhaft.\nNur hat er gegen sehr mobile Champions probleme, da diese dem Q und R ausweichen können. Aber wenn man wen in seiner Chain hat.....\n\nUnd sein Schaden wird nicht von Morgana geblockt. Klar, der Cc wird wie auch bei den anderen durch das Black Shield gestoppt, aber Q und R machen physischen Schaden. Dies bedeutet allerdings auch, dass man das Black Shield niemals brechen wird, wenn man keine APler dabei hat.","replies":[]},{"poster":"Alekra","date":"2016-09-02T06:32:51.489+0000","up_votes":1,"down_votes":0,"body":"Ich weiß nicht, ob es dir weiterhilft, aber ich spiele gerade viel Braum, Lulu und Janna wobei ich auch manchmal Morgana, Taric oder Karma picke.\n\nBei einem Mage als Support empfehle ich Brand. Die Ult ist perfekt für 2 botlaner ;D\n\nIch richte mich meistens nach dem Pick meines ADC oder unsere/die gegnerische Teamcomp.\n\nMfg. Alekra\n\nP.s. BRAUM & KOG'MAW OP","replies":[]},{"poster":"LegendaryXenon","date":"2016-09-01T15:33:52.831+0000","up_votes":1,"down_votes":0,"body":"Ich persönlich habe von jeder Gattung 2-3\n\nTanks: \n\nBraum\nAli \nNauti\n\nPeel:\n\nSona\nKarma\nMorgana \n\nDmg;\n\nAnnie \n(Bald) zyra\nSona/Morg full dmg","replies":[]},{"poster":"ELOW Cronos","date":"2016-09-01T13:14:40.668+0000","up_votes":1,"down_votes":0,"body":"Nun entscheiden muss jeder für sich selber welche Champions er gerne spielen würde. Ich empfehle dir 3 unterschiedliche Champions auszuwählen von denen mindestens einer ein Tank sein sollte. \nVon den Champions Annie, Aurelion, Blitzcrank, Galio, Lux, Nunu & Poppy würde ich dir abraten da diese keine richtigen Supporter sind und/oder sehr schwer zu spielen sind um effektiv zu sein.\n\nPS: Ich z.Bs. spiele Morgana, Thresh und Braum ^^.","replies":[]},{"poster":"N3CROW","date":"2016-09-01T12:57:02.714+0000","up_votes":1,"down_votes":0,"body":"Sona ist ein recht guter supporter, heal viel poke und eine tolle ultimate...sie spielt sich sehr flüssig in ihren fähigkeiten der nachteil das sie unmobil ist gut den hat fast jeder support...nicht besonders tanki und ein wenig manahungrig geht aber\n\nJanna ist super mit early schwachen adc's gegen all in lanes ansonsten ist ein heal supporter irgendwie angenehmer meiner meinung nach\n\nLulu nami morgana sind allrounder die gehen eigentlich immer klar\n\nThresh leona blitz braum sind halt tank supporter thresh davon am wenigsten...kommt ganz auf die gegner und das gegnerteam dann im midgame an was besser ist...\n\nIch mag zb amumu...bei nem engage tankt seine e gut minions und ist auch dann oft einsatzbereit...q reichweite ist super...w naja nutzlos auf der lane...ulti stark aber early nen sehr hohen cooldown ich spiel ihn gern mal weil der q cd extrem niedrig ist und ich notfalls auch mal andersweitig farmen kann wenn ich gold brauch und gerade alles friedlich ist","replies":[]},{"poster":"KleineQualle","date":"2016-09-01T12:51:40.223+0000","up_votes":1,"down_votes":0,"body":"Entscheide doch einfach selbst, du weißt doch am besten selbst welche dir gut gefallen und mit welchen du umgehen kannst...","replies":[]}]}