{"poster":"Est칮y Sad","date":"2019-02-08T11:18:38.668+0000","title":"Wtf Riot con el RP?","subforum":"Charlas Generales","up_votes":76,"down_votes":9,"body":"La ultima vez que cargue RP, me cargue 50 mil RP y estaban 35 dolares el pack mas grande de RP, fue en octubre creo, mas o menos por esa fecha.\r\n\r\nYo desde ese dia, nunca mas vi los precios ni toque RP, tambien ignoraba a todos los que hacian 600 post por dia quejandose del precio, por dentro decia: \"Meeh habra aumentado 5 dolares nomas, algo asi\", hoy digo despues de mucho \"ESTOY ABURRIDO ME VOY A CARGAR 50.000 MAS DE RP\", veo el precio 66 DOLARES, SESENTA Y SEIS DOLARES el pack de 14500 RP, una locura, en 4 meses aumentaron mas de 30 dolares.\r\n\r\nAhora entiendo por que se quejaban tanto, ni en pe2 pongo tanta plata en un juego que ni siquiera se disfruta, solo se pasa el tiempo.\r\n\r\nLiteralmente, prefiero gastarme esa plata en cualquier jueguito de facebook, se fueron al re carajo jajaja.\r\n\r\nPD: Donde se manifestaban con mayor intensidad los movimientos del barco. Cuando un marinero comet칤a una falta se lo mandaba al \"Carajo\" en se침al de castigo (o se lo ataba al palo mayor). Cuando el marinero bajaba del \"Carajo\", estaba tan mareado que no serv칤a para nada.\r\nPorque seguro me vas a querer borrar el post por esto...","replies":[{"poster":"Royal Bandit","date":"2019-02-08T14:53:09.052+0000","up_votes":38,"down_votes":0,"body":"Gasten su dinero en steam(aprovechen las ofertas). Es preferible comprar un par de juegos antes que gastar tanta $$ en un par de skins. A lo sumo solo compren para su Main, si es que quieren darse un gusto.","replies":[{"poster":"immm","date":"2019-02-09T20:24:12.682+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Joker7,realm=LAS,application-id=v7qsfXsE,discussion-id=RMWxqO9q,comment-id=0005,timestamp=2019-02-08T14:53:09.052+0000)\n>\n> Gasten su dinero en steam(aprovechen las ofertas). Es preferible comprar un par de juegos antes que gastar tanta $$ en un par de skins. A lo sumo solo compren para su Main, si es que quieren darse un gusto.\n\nLo bueno de mainear kindred es que la original es mucho mejor que las skins asi que LUL","replies":[{"poster":"N3f3rt4r1","date":"2019-02-09T20:30:57.807+0000","up_votes":1,"down_votes":0,"body":"Xd","replies":[]}]},{"poster":"ETTORI","date":"2019-02-10T04:20:37.417+0000","up_votes":1,"down_votes":0,"body":"Tal cual, chab칩n","replies":[]}]},{"poster":"Mascheranox","date":"2019-02-08T13:12:03.680+0000","up_votes":20,"down_votes":0,"body":"Si yo no cargue mas, hay buenos skin pero ni eso me tienta a comprar,es una terrible estafa se fueron al re carajo \nY no te digo que gasto en otros juegos por que este es el unico que tengo jajaja\nOsea aprendi ahorrar gracias a la estafa de este juego xD","replies":[{"poster":"shadowalmeida","date":"2019-02-08T16:12:53.600+0000","up_votes":4,"down_votes":2,"body":"No es la estafa de este juego si no me equivoco es porque m칤nimo ac치 en Argentina el d칩lar subi칩 un mont칩n","replies":[{"poster":"Finnwei","date":"2019-02-08T22:35:58.866+0000","up_votes":5,"down_votes":0,"body":"no tiene nada que ver eso, si sube el dolar en arg sale mas pesos comprar rp pero los dolares nunca cambian","replies":[{"poster":"Matu020","date":"2019-02-09T01:16:09.568+0000","up_votes":2,"down_votes":0,"body":"A lo cual, tu observaci칩n es correcta, lo que hizo mal Riot, que monetaria mente para ellos est치 bien, pero para nosotros los consumidores est치 mal es, cambiar el valor de la moneda de Peso Arg. a D칩lar. Porque que si sacamos una cuenta el pack m치s peque침o que si no mal recuerdo es de 21 d칩lares, ser칤an unos 900 y algo de pesos. El cual antes costaba unos 500 a 700 pesos, lo que hizo mal Riot fue cagarnos cambiando la moneda, solo para hacer que su comercio crezca. Y estoy seguro que solo nos cag칩 a nosotros. (LAS). \nY sigo insistiendo en que t칰 observaci칩n est치 bien, pero para m칤 Riot se quiso aprovechar de una desventaja en un pa칤s para llenarse los bolsillos, porque el juego sigue igual, no hay cosas nuevas, solo skins y campeones, pero ya no hay contenido como antes. Y la verdad da pena, porque antes era un juego divertido y entretenido, ahora es solo un pasatiempo para los ni침os. Ya que la gente que en verdad quer칤a jugar, se fue hace tiempo o se est치 yendo.","replies":[]}]},{"poster":"Mascheranox","date":"2019-02-08T16:23:46.700+0000","up_votes":1,"down_votes":0,"body":"igualmente no lo subieron por eso\nlo subieron por que la gente de NA se cambiaba de regi칩n,osea cambiaban su cuenta a LAS para comprarse las skin a menor precio\npor que ac치 en LAS estaba muy barato, a comparaci칩n de NA. \n\nentonces, como riot se dio cuenta de que ven칤an a comprar Rp a este servidor y se volv칤an a ir,subi칩 el precio de Argentina y Uruguay para estar nivelados\ny nivelados est치n, pero no tuvieron en cuenta la billetera de los usuarios de Argentina y Uruguay... \n\nespero se den cuenta que lo 칰nico que tienen que hacer es restringir la compra de otros pa칤ses, si No sos de la regi칩n de LAS..\nno se como estar치n Peru, Paraguay y bolivia\ntengo entendido que en chile no aumento","replies":[{"poster":"lamand칤a","date":"2019-02-08T17:43:51.435+0000","up_votes":2,"down_votes":0,"body":"No pensaron que la inflaci칩n subir칤a tanto en estos a침os","replies":[]}]}]},{"poster":"Kingran","date":"2019-02-08T19:02:40.163+0000","up_votes":5,"down_votes":13,"body":"Estafa ser칤a si perdieras ventajas por no comprar  skins pero este juego gracias a la empresa es free to play. Ademas porque regalarian algo que llevo horas de esfuerzo creativo y de programaci칩n para que te lo vendan a un precio que hasta hace poco era increiblemente injusto comparado a otros servidores.","replies":[{"poster":"TheShaderX","date":"2019-02-08T21:46:51.220+0000","up_votes":4,"down_votes":1,"body":"Riot games es una empresa internacional sabias osea que no pierde ni un peso ni d칩lar ni turco y ni euro tienen tanta plata que se puede abastecer bastante bien a los creativos dise침adores y programadores es un juego que alcanzo una popularidad mundial y es uno de los pilares de E-Sports.","replies":[{"poster":"skylex157","date":"2019-02-09T03:45:29.360+0000","up_votes":2,"down_votes":5,"body":"Vos tenes acceso a las cuentas de riot para asegurarme eso? Vos sos el CEO o el que maneja la plata de riot para demostrar que les podes pagar bien y aun te sobra plata? O solo crees que porque es una empresa grande tiene dinero infinito?","replies":[{"poster":"TheShaderX","date":"2019-02-09T06:18:44.514+0000","up_votes":2,"down_votes":1,"body":"nada es infinito pero la plata que manejan las empresas de este calibre no tenes idea de lo que se mueve internamente son monopolios que controlan una gran parte de algo o sobre algo abarcan con un mercado y tienen los recursos suficientes para mejorar el juego y darle productos de calidad al consumidor que compra sus productos tantos f칤sicos como virtuales en el caso de LOL.\n\ny si tienen tantas infraestructuras en tantos pa칤ses es una empresa que controla bastante Recursos y es bastante autosuficiente hasta que se demuestre lo contrario o entre en bancarrota.","replies":[{"poster":"skylex157","date":"2019-02-10T17:30:50.620+0000","up_votes":1,"down_votes":1,"body":"No funciona asi, no puedes asumir que algo funciona de tal manera y despues comprobarlo con cosas que encuentras, tienes que buscar la informacion y el resultado de esa union de datos PUEDE ser la respuesta real, decir \"riot es una empresa grande que tiene mucha gente\" no es lo mismo que \"riot puede hacer un huego perfecto, pagar bien a todos sus empleados y mantenerse economicamente\"","replies":[{"poster":"TheShaderX","date":"2019-02-11T11:40:58.776+0000","up_votes":1,"down_votes":0,"body":"Si funciona asi adem치s riot no esta sola tiene a tencent que es el l칤der en ocio-electronico de china y tiene de afiliados a ea games,activision,epic games y blizzard y mucho otros grandes desarrolladores en el continente americano hasta casi todos los juegos para dispositivos moviles controlan asi que tiene los suficientes recursos para mejorar y darle pago a muchos empleados por mucho tiempo y pagas muy bien pagadas es econom칤a b치sica eso no significa que tencent le otorga todo a riot si no que si esta en un estado de emergencia economomica u quieren empezar un proyecto nuevo pueden acudir a tencent para tener los recursos necesarios para concretar algo.","replies":[{"poster":"skylex157","date":"2019-02-12T00:43:50.580+0000","up_votes":1,"down_votes":0,"body":"Una cosa es tener relacion con todos esos y otra cosa es que EA, epic, blizzard, etc, inviertan dinero en riot XD\n\nCon el unico que tienen algo real es tencent y ahora estan medio peleados porque tencent queria que saquen no recuerdo si una peli o un MMO de lol y riot se nego porque no podian garantizar la calidad","replies":[{"poster":"TheShaderX","date":"2019-02-15T11:16:17.437+0000","up_votes":1,"down_votes":0,"body":"Yo nunca dije que iban a invertir dinero para riot xD\n\nadem치s andan peleados porque tencent como en esos d칤as estaba todo ah칤 como popular en todos lados los ports de juegos grandes hacia celulares como pubg y todo eso y tencent les dijo que hagan un port de lol para distribuirlo asi y riot dijo que no porque el lol debe jugarse en pc y esta hecho para pc eso es lo que dijeron en su dia y que no pod칤an aplicar las mecanicas del juego a un dispositivo m칩vil pero te aseguro que el contrato de socios de tencent,riot sigue en vigencia xD.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Gogeta SSJ Blue","date":"2019-02-08T15:57:09.426+0000","up_votes":10,"down_votes":0,"body":"Yo la 칰ltima vez que cargu칠 fue en Agosto, antes que aumentara en ese momento, luego de ese aumento no he cargado, ni pienso hacerlo despu칠s de este ultimo que es una estafa, sin m치s. \nPero tengo que agradecerles, al aumentar tanto y no gastar m치s plata en el lol, pude comprarme una PC decente/buena y comprar bastantes juegos en Steam. \nAs칤 que gracias Riot, la plata que destinaba para el lol ahora la aprovecho mejor :).","replies":[]},{"poster":"Gryphus One","date":"2019-02-08T16:31:28.683+0000","up_votes":9,"down_votes":1,"body":"> ni en pe2 pongo tanta plata en un juego que ni siquiera se disfruta, solo se pasa el tiempo.\n\nHe gastado dinero en este juego (lamentablemente) pero nunca hice tal compra jajajajaja\n\nAhora en serio, ojal치 alg칰n d칤a Riot Games quede en quiebra. Se lo merecen por paup칠rrima administraci칩n.\n\nCon lo que sale un mugroso skin de 1350 me pago el Netflix y la paso mejor.","replies":[{"poster":"skylex157","date":"2019-02-09T03:47:45.202+0000","up_votes":3,"down_votes":4,"body":"CLARO QUE SI, desear que cientos de personas se queden sin empleo y que desaparezca uno de los juegos mas globalmente aclamados porque una skin cuesta plata EN UN JUEGO GRATIS, bravo...","replies":[{"poster":"KT Marksman","date":"2019-02-09T04:38:21.857+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=skylex157,realm=LAS,application-id=v7qsfXsE,discussion-id=RMWxqO9q,comment-id=000b0000,timestamp=2019-02-09T03:47:45.202+0000)\n>\n> CLARO QUE SI, desear que cientos de personas se queden sin empleo y que desaparezca uno de los juegos mas globalmente aclamados porque una skin cuesta plata EN UN JUEGO GRATIS, bravo...\n\nAmigo deja de andar queriendo justificar a RIOT en todo, no tienen necesidad de haber hecho lo que hicieron habia soluciones mucho mas simples y que beneficiaban a ambas partes como por ej restringir la compra de rp por x tiempo al cambiarte de region o algo por el estilo no es como si hubiera decaido la venta de rp y la empresa estuviera perdiendo dinero al contrario, cada a침o ganan mas y esta mas que comprobable con 9 temporadas y contando, mundiales con cada vez mas viewers, mas streamers mas contenido no solo in-game y asi podria seguir escribiendo, que sea f2p no quiere decir que se caguen tanto en la comunidad porque es lo que hacen, son como los politicos no les interesa el pueblo, solo llenarse los bolsillos no te van a regalar nada por hacer semejante deep throat tranquilo, deberia hacer un meme de los simpson que diga \"sino me gano una skin gratis con esto me muero\"","replies":[{"poster":"Maineo Late","date":"2019-02-09T18:22:33.328+0000","up_votes":2,"down_votes":0,"body":"JAJAJAJA este pibe si no es zurdo le pegue en el palo.\n\n> el pueblo\n\njaja\n\n>cada a침o ganan mas y esta mas que comprobable con 9 temporadas y contando\n \ny que por eso tendrian que dejar de hacerlo?\n\npapa te explico,que vos seas pobre no es problema de la empresa.","replies":[]}]},{"poster":"Gryphus One","date":"2019-02-10T04:31:33.977+0000","up_votes":1,"down_votes":0,"body":"No se침or, ha malinterpretado mi comentario. Yo no estoy buscando que las skins sean gratis. Lo que quise decir es que en un principio el juego me ha gustado tanto que me he animado a donarle, sin embargo tras pasar el tiempo vi que ha deca칤do much칤simo y la administraci칩n PEDORRA que tiene, no parece demostrar querer mejorar. Sino todo lo contrario. Y todo esto ocurri칩 desde la adquisici칩n del magnate chino, Tencent. Por eso s칠 que ya no van a cambiar.","replies":[{"poster":"skylex157","date":"2019-02-10T17:33:26.120+0000","up_votes":1,"down_votes":2,"body":"Aja, y en que momento entra desear que una empresa caiga en tu moral? Puede tener todo lo malo que quieras, pero sus numeros siguen creciendo, si fuera tan malo, nadie lo jugaria","replies":[{"poster":"Gryphus One","date":"2019-02-11T05:59:09.842+0000","up_votes":1,"down_votes":0,"body":"El juego no es malo, al contrario es uno de los mejores en la actualidad, por eso lo sigo jugando. Pero confiar en la empresa que lo mantiene se me hace dif칤cil. Y no me voy a morir si deja de existir, ya que juego muchos otros juegos m치s.","replies":[{"poster":"skylex157","date":"2019-02-12T00:40:36.777+0000","up_votes":1,"down_votes":0,"body":"Me parece perfecto que te valga madre si riot existe o no, pero digas \"no me importa\" cuando antes dijiste \"por mi que se queden en banca rota\"","replies":[{"poster":"Gryphus One","date":"2019-02-12T20:38:04.917+0000","up_votes":1,"down_votes":0,"body":"Toqu칠 Ctrl + F para buscar d칩nde dije \"no me importa\" pero no lo encuentro. A lo mejor quisiste responder otro comentario.\n\nOjal치 queden en bancarrota, he dicho.","replies":[{"poster":"skylex157","date":"2019-02-16T04:51:19.984+0000","up_votes":1,"down_votes":0,"body":"\"y no me voy a morir si dejan de existir\" equivale a \"no me importa\"","replies":[]}]}]}]}]}]}]}]},{"poster":"Yamisuke","date":"2019-02-08T17:36:35.858+0000","up_votes":5,"down_votes":0,"body":"Con 66 dolares te compras todo Steam, que se guarde Riot sus skins y sus nerfeos.","replies":[]},{"poster":"Laikan","date":"2019-02-08T17:27:33.813+0000","up_votes":4,"down_votes":0,"body":"yo ya no compre mas rp desde los aumentos , ya no rinde para nada ... pero bueno eventualmente cuando la gente deje de comprar ir치n a bajar los precios supongo que preferir치n venderlo mas barato a que no vender nada xD","replies":[]},{"poster":"JuanGhost","date":"2019-02-08T16:54:55.933+0000","up_votes":6,"down_votes":2,"body":"El problema es que el RP tambi칠n subi칩 el precio en D칩lares, yo no me quejo mucho del precio actual, gracias a esto Riot sigue sacando contenido y me ha solucionado muchos problemas, no olviden que Riot es una compa침칤a grande, su fuente principal de ingresos es el RP, sino funden una empresa de juegos gratuitos y me cuentan c칩mo les fue. Gracias al RP tendremos rework de Kayle, Morgana, Mordekaiser, 3 campeones nuevos, un mundial espectacular, una serie de c칩mics y de historias cortas y mejoras al rendimiento. Los patrocinios tambi칠n son una fuente de ingresos pero no es tan grande como el RP. Tambi칠n usen la Oferta y la Demanda a su favor si quieren disminuir el precio, s칤 siguen comprando a montones obvio que a Riot le conviene subir el precio para conseguir m치s ingresos, s칤 quieren que baje simplemente p칩nganse de acuerdo y dejen de comprar, a Riot no le quedar치 otra que disminuir el precio. \n\nPD: Nunca he puesto dinero en el juego pero los precios actuales no me parecen tan abusivos, injustos puede ser, pero no abusivos y tampoco para desearle la quiebra a Riot, eso es de enfermos. Tampoco soy millonarios as칤 que no puedo decir que los precios sean bajos est치n un poco pasados simplemente y que con una peque침a disminuci칩n estar칤a mejor.","replies":[{"poster":"asdmaskldmnkfl","date":"2019-02-08T23:41:38.188+0000","up_votes":2,"down_votes":0,"body":"Mira ac치 en chile no ha afectado en nada los cambios de precios, pero disfrute bastante comprando rp antes de que cambiaran los precios de argentina.\nPero ac치 riot comete un error grave, quiz치s riot deber칤a pensar que debieron dejar los precios como estaban o quiz치s a un precio razonable, para una empresa es preferible vender barato que no vender nada y probablemente eso est치 pasando en argentina. Deben vender poco o nada. Esas decisiones empresariales dejan mucho que desear y para el servidor de las, Argentina es el mercado m치s importante, deber칤an asegurar la calidad de servicio y buenos precios a ese mercado importante m치s que por ejemplo a chile. Aunque yo soy feliz con los 10 ms que tengo, no estoy tan feliz viendo c칩mo los jugadores de mis partidas est치n con ms espantosos porque no puede asegurar buen servicio a argentina. Saludos","replies":[]}]},{"poster":"shadowalmeida","date":"2019-02-08T16:11:40.488+0000","up_votes":1,"down_votes":4,"body":"Creo que es culpa de rigor es porque ac치 en Argentina el d칩lar crecio mucho","replies":[{"poster":"Celebi","date":"2019-02-08T18:06:37.557+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=shadowalmeida,realm=LAS,application-id=v7qsfXsE,discussion-id=RMWxqO9q,comment-id=0009,timestamp=2019-02-08T16:11:40.488+0000)\n>\n> Creo que es culpa de rigor es porque ac치 en Argentina el d칩lar crecio mucho\n\nSi, en Argentina es problema porque la moneda se devalu칩, pero de todas formas, con o sin moneda devaluada, el RP es la moneda virtual MAS COSTOSA de todos los juegos, carajo que poco mas va a competir con el bitcoin a este paso, con 5 dolares (no interesa que moneda de que pais sea) con 5 dolares no te compras ni 1 skin en lol, en cualquier otro juego compras varias skins E INCLUSO JUEGOS ENTEROS, y estamos hablando de 5 dolares que no llegan a una skin.","replies":[]}]},{"poster":"intierenu2","date":"2019-02-08T23:15:28.125+0000","up_votes":3,"down_votes":0,"body":"En mis tiempos con 100 pesos te comprabas una legendaria :,v","replies":[]},{"poster":"Sh칤ru","date":"2019-02-08T13:21:30.725+0000","up_votes":3,"down_votes":3,"body":"Ese aumento de precio es por la inflaci칩n en Argentina o por qu칠? Alguien sabe?","replies":[{"poster":"oh nahoten","date":"2019-02-08T16:42:03.044+0000","up_votes":3,"down_votes":0,"body":"Eso no tendr칤a sentido, la inflaci칩n afecta el valor del peso en base al d칩lar, osea que un d칩lar puede valer 30 pesos o 5000 pesos y el valor del producto va a seguir siendo 1 d칩lar. No influye nuestra econom칤a","replies":[{"poster":"Sh칤ru","date":"2019-02-08T23:35:32.556+0000","up_votes":2,"down_votes":0,"body":"Entonces realmente no tiene sentido poner 1000 de RP a 10 d칩lares si despu칠s en otros pa칤ses pondr치n la misma cantidad a 20. Huele como todos dicen, a estafa xD","replies":[]}]}]},{"poster":"Bloshan","date":"2019-02-08T14:48:44.421+0000","up_votes":3,"down_votes":0,"body":"Ni blizzard aumento, se quedo con el precio de siempre y riot lo aumenta. No me importa mucho el aumento pero si vas a aumentarlo que aumente el rp que te da. Ahi te das cuenta que quieren dinero facil","replies":[{"poster":"shadowalmeida","date":"2019-02-08T16:13:45.452+0000","up_votes":1,"down_votes":7,"body":"Creo que no era culpa de rigor m칤nimo ac치 en Argentina el d칩lar subi칩 un mont칩n y tambi칠n est치 lo de la iva creo que era","replies":[{"poster":"BLINK25","date":"2019-02-08T19:38:20.449+0000","up_votes":2,"down_votes":0,"body":"El d칩lar es el d칩lar no importa cu치nto valga en argentina . El tema es q antes costaba 35 los y ahora 66 d칩lares . 30 d칩lares m치s entend칠s游뱂","replies":[]}]},{"poster":"skylex157","date":"2019-02-10T17:40:14.120+0000","up_votes":1,"down_votes":1,"body":"Cual es la gracia de aumentar el precio del RP si van a aumentar la cantidad?\n\nEs como decir \"el kilo de tomate esta 30 pesos, si van a aumentarle el precio, aumenten la cantidad, los dos kilos de tomate esten 60\" :/","replies":[{"poster":"Bloshan","date":"2019-02-11T19:40:10.494+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=skylex157,realm=LAS,application-id=v7qsfXsE,discussion-id=RMWxqO9q,comment-id=00040002,timestamp=2019-02-10T17:40:14.120+0000)\n>\n> Cual es la gracia de aumentar el precio del RP si van a aumentar la cantidad?\n> \n> Es como decir &quot;el kilo de tomate esta 30 pesos, si van a aumentarle el precio, aumenten la cantidad, los dos kilos de tomate esten 60&quot; :/\n\nAlgo fisico como lo es un tomate no se puede comparar a algo virtual como una moneda dentro del juego. Es obvio que con la comparacion del tomate nada que ver porque en ese caso seria cualquier cosa, porque estaria gastando stock. En este caso la moneda es virtual entonces hay stock infinito, no puede ser que hace 1 a침o atras con 100 pesos te comprarbas (por decir) 720 rp y ahora por 100 pesos te compres 220 rp (es un ej no me se los precios verdaderos exactos)","replies":[{"poster":"skylex157","date":"2019-02-12T00:46:44.386+0000","up_votes":1,"down_votes":0,"body":"Si se puede comparar, riot no puso cualquier precio, sino que doralizo el RP, ahora pagamos lo que estadounidenses, lo que pasa es que aca somos pobres a comparacion de ellos, asi que como esta ahora es lo mas justo para todo el mundo","replies":[]}]}]}]},{"poster":"Salvor","date":"2019-02-08T14:20:50.054+0000","up_votes":3,"down_votes":0,"body":"En comparaci칩n a otros juegos se fueron al carajo, ayer me entro justo un ticket de 75% de descuento en moneda de Warframe, con la plata que te compras una skin de 1350 RP te compras muchos skins en otros juegos.","replies":[]},{"poster":"Peacefu켹 Riven","date":"2019-02-08T13:31:22.254+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"Est칮y Sad","date":"2019-02-08T13:46:43.484+0000","up_votes":5,"down_votes":12,"body":"Como cuando no entendes que el dolar tiene distintos valores en todos los paises...\n\nSi era hace 4 a침os, 66 dolares no era nada...","replies":[{"poster":"EpicHit","date":"2019-02-08T15:11:37.503+0000","up_votes":6,"down_votes":12,"body":"En realidad el dolar vale lo mismo en todos lados xd","replies":[{"poster":"Est칮y Sad","date":"2019-02-08T15:46:26.870+0000","up_votes":7,"down_votes":5,"body":"Bueno... aca me olvido que hay que hablar todo con sentido infantil, porque decis UH LOCO HACE 400 GRADOS DE CALOR ESTA INBANCABLE y viene uno y te dice: Oiee es impozivle 400 grados de kalor jeje xdxdxd.\n\nMe olvido que hay muchos chicos...","replies":[]}]}]}]}]}