{"poster":"SW Diamond Beast","date":"2016-08-28T18:18:21.221+0000","title":"Baneos insolitos","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":16,"body":"Hay gente idiota que se sale de la partida para atrasar a los dem&aacute;s, estuve como 1 hora esperando una ranked, hasta que entro y se me hace la hora de almorzar me tengo que salir y me dan un ban reci&eacute;n saliendo de otro por la misma situaci&oacute;n, &iquest; que excusas me dar&aacute;n para esta situaci&oacute;n?. los ni&ntilde;os ratas siguen libremente en este juego y hacen cosas peores que yo d&aacute;ndoles sanciones m&iacute;nimas o ninguna. Ojala me digan una soluci&oacute;n correcta a este problema, porque con la cantidad de jugadores que existen no soy el &uacute;nico que le ha pasado y en todo &aacute;mbito aburre esto.\r\nSaludos summoners\r\nToru Kokonoe","replies":[{"poster":"TaitoTikaro","date":"2016-08-28T18:24:57.910+0000","up_votes":3,"down_votes":0,"body":"osea que siempre te salis me parece que la rata sos vos","replies":[]},{"poster":"Yitán","date":"2016-08-28T22:31:03.245+0000","up_votes":2,"down_votes":0,"body":"la solucion es dejarte de ir afk, ojala el ban pronto sea permanente","replies":[]},{"poster":"Mazer Rakham","date":"2016-08-28T18:34:49.746+0000","up_votes":2,"down_votes":0,"body":"Si sabes cuanto dura promedio una partida y que antes de eso vas a tener que ir a almorzar, para qué jugás? esperá a terminar de almorzar y jugá ahí. Sino lo que conseguís es arruinarle la partida a los demás. A no quejarse macho y hacerse cargo de sus actos.","replies":[]},{"poster":"Hoobes","date":"2017-08-04T06:37:52.315+0000","up_votes":1,"down_votes":0,"body":"Pero vos sos un nene mal educado!!!\nRecién me tocó en partida con vos, y te pasaste de imbécil, te tengo unas ganas, me bloqueaste porque que sos un nene cobarde y sinvergÜenza. Y resulta que vengo a encontrarme acá con un post tuyo haciendote el santo. \nVos sos un sinvergÜenza, leíste?\nSINVERGÜENZA!!!","replies":[]},{"poster":"Sirek","date":"2016-08-29T14:56:19.427+0000","up_votes":1,"down_votes":0,"body":"Si te van a dar almuerzo a las 13 horas, no te pongas a jugar a las 12:45... Lo mínimo es saber que una partida se puede extender desde 20 a 60 minutos (incluso más).","replies":[]},{"poster":"BeamOeste","date":"2016-08-28T22:04:57.483+0000","up_votes":1,"down_votes":0,"body":"Antes de jugar una partida, Tenes que tener en cuenta que puede llegar a durar hasta 1 hora, Asique cuando te pongas a jugar , asegurate de que tenes tiempo libre","replies":[]},{"poster":"ThisNear","date":"2016-08-28T19:59:00.954+0000","up_votes":1,"down_votes":0,"body":"la solución correcta a este problema es: Cambiar tu actitud \n\nsaludos","replies":[]}]}