{"poster":"Holokom","date":"2016-02-18T16:33:16.793+0000","title":"Fill = Support im Dyn Q.","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":0,"body":"Hey ich wollte nur mal fragen wie ihr mit der Dyn que zurechtkommt, jetzt wo sie ne weile drau&szlig;en ist.\r\nIch pers&ouml;nlich hab irgendwie ein Support Problem.\r\nHab seit Season 4 immer gern Support gespielt und w&uuml;rde ja auch nach wie vor im ranked gern Support spielen aber...manchmal w&uuml;rd ich auch gern was anderes spielen und wenn mann um 8 Uhr Abends am Samstag (Silber Elo) nach ner viertelstunde die (normal!) Que abbrechen muss weil sich keiner findet der Support spielt find ich das irgendwie traurig.\r\nHab mich Schluss endlich geopfert f&uuml;r meine trio que partner und dann Support angegeben wodurch sofort ne Meldung kam (wir hatten alles au&szlig;er Support angegeben ). \r\n\r\nWunsch: Was w&auml;re mit einem Belohnungssysthem wenn mann Support / was auch immer gerade nur mit 0.x % im Finder sitzt angibt so dass die Ques ein bisschen schneller durch kommen.\r\n\r\nIch hab zur Zeit n&auml;mlich den EIndruck sobald mann es irgendwie m&ouml;glich macht Support zu werden wirst du es auch so dass dieses ganze 1 / 2 Wahl komplett unter den Tisch f&auml;llt. (Du bist 1 Wahl midlane...ok versuchs n&auml;chstes Jahr...und 2 Wahl Support ...wir h&auml;tten hier ein paar Tausend Stellen die Leer mit Support Beschriftet sind ....k&ouml;nnen sie bitte mal ein Jahr Spielzeit opfern um den armen Zed Mains ein Spiel zu erm&ouml;glichen die seit der Lol Beta in der Que hocken ?)","replies":[{"poster":"Saphierot","date":"2016-02-21T17:56:39.576+0000","up_votes":1,"down_votes":0,"body":"Versuch einfach platin zu ereichen nirgends gibt es mehr support mains als dort :D\nNur im unteren bereich wie Bronze -> Silber -> Gold will irgendwie keiner supporten.\n\nHabe das selber gemerk, wobei eignetlich grade der support die höchste chance hat das spiel für das team zu entscheiden.\n(Du denkst du kannst dein team carryn? Pick Blizzcrank, Grab im teamfight den ADC, midlaner oder squhishy jungler und schau zu wie dein team sich durchmetzelt. Ausser es sie haben keine ahnung vom spiel , du grabst den Adc und trotzdem greift jeder den rammus an und stirbt :( )","replies":[]},{"poster":"Holokom","date":"2016-02-20T01:16:21.210+0000","up_votes":1,"down_votes":0,"body":"bin ja auch Sup main aber manchmal will ich auch was anderes ^^","replies":[]},{"poster":"MeMyselfandBaal","date":"2016-02-18T17:20:26.992+0000","up_votes":1,"down_votes":0,"body":"Dass diese Problem so kommen würde, war doch für jeden, der mehr als 10 Spiele im Teambuilder (und nichts anderes ist das ja) verbracht hat , abzusehen. \n\nMan muss natürlich an der Stelle auch zugeben, dass es als 3er Que, die keinen Support angibt, wirklich schwer wird. Es dürfte eh schon nicht ganz einfach sein, die passende Konstellation für euch zu finden... und dann schließt ihr einen Großteil der möglichen Spiele auch noch aus, weil ihr euch auf die beliebten Rollen stürzt...\n\nWobei natürlich an der Stelle gefragt werden könnte, ob die 3er Que nicht als Basis genutzt werden sollte, der dann 2 zusätzliche Spieler hinzugefügt werden... die dann halt als 2. Fill angegeben haben...\n\nAber hey, für mich als Sup Main ist es das Paradis... ich habe bisher nur 1 Mal meine Main Rolle nicht bekommen und da habe ich einfach Lulu (also einen Support) Mid gespielt...","replies":[]}]}