{"poster":"Holokom","date":"2017-02-19T12:51:04.669+0000","title":"pre selekted (champion hovern vor dem bannen)","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":2,"body":"Hey ich spiele in letzter Zeit regelm&auml;&szlig;ig yi top lane, klar ist erstmal ungew&ouml;hnlich aber ich bin damit erfolgreich und am ende ist ja auch nicht anders als tryndamere und jax welche auch oben gespielt werden.\r\nneulich hatte ich ein game wo mein support malphite meinte yi einfachz u bannen, ich hatte first pick und yi preselekted.\r\ner war der last ban also hatte 100% einfach nur gesehen, yi top, kein tank muss gebannt werden damit er was anderes spielt, \r\nhab jax genommen (den ich schlecht kann) und auf die fresse bekommen war aber am ende super gl&uuml;cklich das ranked verloren zu haben so dass der malphite keine LP bekommt bei so einem verhalten. ( hat mich ingame dann auch drauf angesprochen das yi top etc ich ei ntroll sei)\r\n\r\nhabe dieses Problem aber schon mehrfach gehabt deswegen wollte ich fragen, da wir anscheinend eine so klein geistige community haben, sollte es unm&ouml;glich gemacht werden die preselekteden champions zu bannen ? also einfach das die ausgegraut sind so dass jeder mitbekommt, das sind die champions die dein team spielen will und das die nicht gebannt werden k&ouml;nnen.\r\n\r\nso w&uuml;rde auch das von manchen leuten ausversehen gebannt nicht mehr vorkommen ( wenn etwa yasou gebannt wurde und alle 5 was zeigen kann es ja sein das jemand nicht genau hingeguckt hat und standard m&auml;&szlig;ig yasou bannt, die entschuldigen sich aber auch)\r\nMFG Holokom","replies":[{"poster":"Frankydude","date":"2017-02-19T12:53:20.956+0000","up_votes":2,"down_votes":0,"body":"oder du preselctest einfach nicht wenn du angst davor hast dass dein champ gebannt wird? niemand zwingt dich zu zeigen was du spielen willst und du willst jemand picken mit ner niedrigen banrate... problem gelöst","replies":[{"poster":"Holokom","date":"2017-02-21T21:52:19.409+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Frankydude,realm=EUW,application-id=ip27PlEH,discussion-id=E3lNGUw1,comment-id=0000,timestamp=2017-02-19T12:53:20.956+0000)\n>\n> oder du preselctest einfach nicht wenn du angst davor hast dass dein champ gebannt wird? niemand zwingt dich zu zeigen was du spielen willst und du willst jemand picken mit ner niedrigen banrate... problem gelöst\n\nmein Problem ist das verbündete gezielt die eigenen Champions weg bannen, nur weil sie dafür bekannt sind viel zu split pushen und weniger im Team spielen. (BSP, YI, Tryndamere) die haben keine Hohe ban rate es ist nur das verbündete schlicht weg es nicht wollen das sie diese champions im team haben udn sie weg bannen , anderer Grund wäre wenn sie sie für zu schlecht halten (Urgot ,Lethalityop...Nunu)","replies":[]}]},{"poster":"Supportsmanlike","date":"2017-02-21T22:07:04.632+0000","up_votes":1,"down_votes":0,"body":"Ach Holo, von dir hätte ich eigentlich erwartet, dass du ein wenig weiter denkst. \nSagen wir mal eine Camille 2.0 kommt raus und jeder möchte sie spielen, weil sie einfach viel zu stark ist, aber Riot hat die Möglichkeit, von Teammates preselectete Champion zu bannen, entfernt. Nun möchte also jemand aus deinem Team unbedingt diesen Champion spielen, dieser jemand ist aber last Pick und niemand anders aus dem Team besitzt diesen Champion bereits, um mit ihm zu tauschen. Was passieren wird, ist, dass ihr diesen Champion nicht bannen könnt und die Gegner ihn bekommen, er snowballed und ihr verliert nur deshalb.\n\nWie immer nur ein Beispiel, aber es sollte reichen um aufzuzeigen, warum dies keine Lösung sein kann.\n\nWas das Bannen aus Versehen betrifft, so könnte Riot die bereits existierende Funktion, dass vom Team preselectete Champs leicht ausgegraut erscheinen, deutlicher sichtbar machen.","replies":[{"poster":"Holokom","date":"2017-02-27T08:26:31.698+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Supportsmanlike,realm=EUW,application-id=ip27PlEH,discussion-id=E3lNGUw1,comment-id=0001,timestamp=2017-02-21T22:07:04.632+0000)\n>\n> Ach Holo, von dir hätte ich eigentlich erwartet, dass du ein wenig weiter denkst. \n> Sagen wir mal eine Camille 2.0 kommt raus und jeder möchte sie spielen, weil sie einfach viel zu stark ist, aber Riot hat die Möglichkeit, von Teammates preselectete Champion zu bannen, entfernt. Nun möchte also jemand aus deinem Team unbedingt diesen Champion spielen, dieser jemand ist aber last Pick und niemand anders aus dem Team besitzt diesen Champion bereits, um mit ihm zu tauschen. Was passieren wird, ist, dass ihr diesen Champion nicht bannen könnt und die Gegner ihn bekommen, er snowballed und ihr verliert nur deshalb.\n> \n> Wie immer nur ein Beispiel, aber es sollte reichen um aufzuzeigen, warum dies keine Lösung sein kann.\n> \n> Was das Bannen aus Versehen betrifft, so könnte Riot die bereits existierende Funktion, dass vom Team preselectete Champs leicht ausgegraut erscheinen, deutlicher sichtbar machen.\n\n\nnein die situation war es nicht\nbei camille ja ist klar was du meinst, aber wenn z.b. im normal dein first pick nunu adc angibt, dann ist das seine sache und du solltest wie ich finde ohnehin for free dogen sollen, aber es sollte unmöglich sein champs zu bannen die das team spielen soll, oder vlt bekommste nen bann wenn das regelmäßig auftritt einfach wegen unsportlichem verhalten.","replies":[]}]}]}