{"poster":"Holokom","date":"2016-08-07T00:14:29.578+0000","title":"Gedanken über Tank Ekko / Balancing ideen.","subforum":"Champions & Gameplay","up_votes":1,"down_votes":3,"body":"Hey, also &uuml;ber die letzten gef&uuml;hlten 20 Patchnotes wurde Ekko ja kontinuierlich auf Tank generft und auf ap gebufft, wenn mann sich aber das neueste ekko build (Triforce fulltank) anschaut hat sich irgendwie nix ge&auml;ndert die selbe mechanik wie vor den nerfs ist immer noch da und das nach wirklich einer ganzen reihe von Nerfs.\r\nMeine Gedanken dazu sind : Ekkos kit ist einfach zu gut f&uuml;r einen Tank es bietet extrem viel cc und tanky wird er zur Not auch nur &uuml;ber items.\r\nDer Schaden scheint ja wie mann sieht auch wenn er fast 0 betr&auml;gt noch irgendwie zum 2 shot reichen. Deswegen meine idee:\r\n1: &Auml;nderung der Ulti heilung : nur &uuml;ber ap+ base wert, nicht abh&auml;ngig vom Leben\r\n2: W ist kein Stun mehr. /Schaden hoch / gibt sicht\r\n3: e Schaden hoch  \r\n4: Q schaden Runter \r\n5: Passiv schaden und speed boost hoch/ bei t&ouml;tungen automatisch speed boost\r\n\r\nBei diesen &Auml;nderungen w&uuml;rde ich beim Schaden nur die Skalierungen angehen nicht die base werte.\r\ndurch die &auml;nderung der ult w&auml;re full tank ekko unm&ouml;glich weil die ulti nur mit ap n&uuml;tzlich ist, und der base wert f&uuml;r nen tank zuwenig heilt,\r\ngr&ouml;&szlig;te &auml;nderung ist die w aber echt jetzt: ein assasin braucht keinen cc der nem malphite konkurrenz macht.\r\nDes weiteren w&uuml;rde ich schaden UMVERTEILEN, weniger auf dem Q daf&uuml;r mehr durch e und passive das bedeutet vor allem einzel ziel oneshot der aber auch gepunished werden kann weil die e f&uuml;r die kombo gebraucht wird, save ist er immer noch durch den w schild und die ulti.\r\nSowie resett funktion mit der passive da er doch als melee etwas verwundbarer ist und f&uuml;r nen kill belohnt wird.\r\n\r\nWas haltet ihr davon ?\r\n\r\nMFG Holokom","replies":[{"poster":"Oyasumi Punpun","date":"2016-08-07T16:37:34.322+0000","up_votes":2,"down_votes":0,"body":"Warum soll denn bitte Tank Ekko noch generft werden? Ekko-Top sitzt auf einer rund 50% Winrate, was für mich relativ gebalanced klingt und mit Trinity sogar nur bei 49%. Nur weil er momentan oft so gespielt wird, ist das doch kein Grund um das Build noch weiter zu nerfen.","replies":[]},{"poster":"Good Guy Putin","date":"2016-08-07T15:01:38.565+0000","up_votes":1,"down_votes":0,"body":"Es reicht einfach aus, dass die W Passive entfernt wird.","replies":[]},{"poster":"wolf454","date":"2016-08-07T02:00:28.395+0000","up_votes":1,"down_votes":0,"body":"Warum ein normalerweise damals Champ Tank gehen kann liegt an einen einzigen effekt: %life damage \nder Rest unterstützt das (cc/ jumpmöglichkeiten etc) \nEine Kindred mit 10 stacks  (12.5%life damage per auto) geht auch voll tank/attackspeed/lifesteal und ist fast untötbar^^\nUnd ich finde das gut:D das das geht(okay Kindred ist etwas extrem aber es gibt genug andere (mir fallen nur keine ein._.))\nSuch mal nach diesen Effekt und es wird fast immer ne tankbuild dazu geben^^","replies":[]},{"poster":"ClAO KAKAO","date":"2016-08-07T00:42:32.518+0000","up_votes":1,"down_votes":0,"body":"Die W wäre dann ziemlich useless zumal sie auch hohe Manakosten hat, die Ult Heilung würde ich verstehen, E Schaden hoch.. warum ? Das ist auch in favor vom Tank Ekko ( außer du meinst lediglich das scaling.. ? ) .. Q Schaden runter.. klar wenn man den Basedmg nerft wird somit tank Ekko generft aber man muss da wirklich aufpassen sonst schadest du dem AP Ekko zu sehr.. \nDer letzte Punkt ist allerdings gerade das was Tank Ekko atm ausmacht also wenn du das noch buffen willst gehst du genau in die falsche Richtung.","replies":[]},{"poster":"sabonav739","date":"2016-08-07T07:37:06.767+0000","up_votes":1,"down_votes":1,"body":"Wenn ekko nicht als tank gespielt werden soll geht das einfacher als ihr alle denkt :  ab einem leben von 3000 kassiert er true demage und schon ist das problem gelöst und ob das fair ist ? falls sein kit für einen tank zu stark sein sollte dann ja .... ich weis zwar das  ihr ( ritooooo) alternative spielweisen möglichst offen lassen wollt  aber es ist eigentlich 100% undmöglich einen champion vernünftig zu balancen der auf mehrere arten gespielt werden kann : :)  \n\n\nFree RP?\nGute  Idee !!!","replies":[]}]}