{"poster":"DeMostHated","date":"2018-06-07T02:40:01.668+0000","title":"riot issued instant 14 day bann, NO 5 GAME CHAT BANN, NO 25 GAME CHAT BANN, was level 3 honor.","subforum":"Player Behavior","up_votes":1,"down_votes":10,"body":"Game 1\r\nIn-Game\r\nDeMostHated: ??\r\nDeMostHated: im done, such a noob champ\r\nDeMostHated: ur making my point for me\r\nDeMostHated: yep\r\nDeMostHated: 100-0 in 2 hits\r\nDeMostHated: lol\r\nDeMostHated: i dont get how u can say ur more skilled then me\r\nDeMostHated: cus ur not\r\nDeMostHated: okt hen\r\nDeMostHated: its 90% champs\r\nDeMostHated: but ok\r\nDeMostHated: ur lucky adc got nurfed\r\nDeMostHated: plat adc\r\nDeMostHated: ok muted and rperorted\r\nDeMostHated: i get 0 help jungle?\r\nDeMostHated: means nothing for top lane are you dumb??\r\nDeMostHated: fine jungle\r\nDeMostHated: u lost this game\r\nDeMostHated: yet u say skill. lmfao you dont even know the meaning of the word\r\nDeMostHated: wow\r\nDeMostHated: u report me fo being dove?\r\nDeMostHated: ok\r\nDeMostHated: ur so toxic its unbelieveable\r\nDeMostHated: 100%\r\nDeMostHated: dont care to play with both toxic teams\r\nDeMostHated: why should i keep going?\r\nDeMostHated: lol muting me?\r\nDeMostHated: love pathing\r\nDeMostHated: just loive it\r\nDeMostHated: u recalled?\r\nDeMostHated: r;y?\r\nDeMostHated: rly?\r\nDeMostHated: i hope u all realize this attitude isnt helping team play, but who knows ur all bonze anyways\r\nDeMostHated: if u wernt toxic? ye for sure would have been fun\r\nDeMostHated: do i care?\r\nDeMostHated: oh wait nope, ik what i am and no one can tell me dif\r\nDeMostHated: u act like i care? and like im even trying?\r\nDeMostHated: lol\r\nDeMostHated: leona ur the onlyone not talking shit\r\nDeMostHated: sorry butblame the otehr 3\r\nDeMostHated: once my team trashes like this i stop helping\r\nDeMostHated: no just to not helping\r\nDeMostHated: never been banned for inting but cool\r\nDeMostHated: if i had a mom\r\nDeMostHated: but why would u care?\r\nDeMostHated: i hope yiu guys realize ur more likely to be insta banned then me being im just having a bad game and you all are issueing threats and attacking me for not having parents.\r\nDeMostHated: the fact you guys cant even understand how messed up you have to be to do that proves whats going on here\r\nDeMostHated: lol if u wish to think that u can\r\nDeMostHated: i hope you relaier\r\nDeMostHated: i hope you realize not helping isnt the same and running under tower\r\nDeMostHated: as&#039;\r\nDeMostHated: i havnt run under tower once\r\nDeMostHated: so no i wont get banned but ty for your vote\r\nDeMostHated: ive gone 2-25 bwfore\r\nDeMostHated: trying to get b5\r\nDeMostHated: and never been banned\r\nDeMostHated: for what?\r\nDeMostHated: honestly for what?\r\nDeMostHated: what have i done thats worse then what you guys are doing\r\nDeMostHated: ?\r\nDeMostHated: threats and family attacks arnt worse?\r\nDeMostHated: lol\r\nDeMostHated: insaults and slurs and all u can come up with?\r\nDeMostHated: are&#039;\r\nDeMostHated: i like how ashe is the one telling me to grow up xD\r\nDeMostHated: wow shaco\r\nDeMostHated: nice job cyber bullying\r\nPost-Game\r\nDeMostHated: willi get a bann no\r\nDeMostHated: but will u guys?\r\nDeMostHated: 100%\r\nDeMostHated: ruin?\r\nDeMostHated: first off i was at tower everytime i died\r\nDeMostHated: 2nd\r\nDeMostHated: did you help?\r\nDeMostHated: no\r\nDeMostHated: welp\r\nDeMostHated: now ill add that to the report\r\nDeMostHated: u rly think what ur saying is ok?\r\nDeMostHated: making attacks on someone?\r\nDeMostHated: i rly wish u would lol\r\nDeMostHated: ur taking  A GAME over a perosns life\r\nDeMostHated: for ur info (not that it matters) im 24\r\nDeMostHated: lol\r\nDeMostHated: leona\r\nDeMostHated: i would lose that adc\r\nDeMostHated: very toxic\r\nDeMostHated: sorry u have to deal with him\r\nDeMostHated: LOL\r\nDeMostHated: wow\r\nDeMostHated: life threats and degrading someone IRL isnt being toxic? buy saying im done and im not helping you for calling it out is?\r\nDeMostHated: but&#039;\r\nDeMostHated: u just issued 3\r\n\r\nnon stop threats on me and my family all game by both teams ( my parents, me and bassicly anyone related to me.). riot has claimed over and over again that &quot;mob&quot; banns don&#039;t happen. well once again proof they riot is infact lieing to us and they do.","replies":[{"poster":"Jamaree","date":"2018-06-07T02:45:13.809+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=DeMostHated,realm=NA,application-id=ZGEFLEUQ,discussion-id=OAksyabX,comment-id=,timestamp=2018-06-07T02:40:01.668+0000)\n\n> Post-Game\n> DeMostHated: willi get a bann no\n\nAh ha ha ha ha ha ha","replies":[]},{"poster":"Modi","date":"2018-06-07T04:09:32.565+0000","up_votes":2,"down_votes":0,"body":"One of three things happened:\n\n1. This is a false positive, and you should contact support\n2. You have had a recent punishment, such as a 25 game suspension (recent being within the last 2-3 months)\n3. This is not the entire log, and it is either edited or is missing other games\n\nIf it is #1, please do go make a support ticket. Also, Tantram would take in interest in these kinds of false positives, hopefully he can weigh in here. Though, my experience here leads me to believe that it was most likely #2 or #3.","replies":[]},{"poster":"Aneirin","date":"2018-06-07T03:41:31.920+0000","up_votes":2,"down_votes":0,"body":">  riot has claimed over and over again that \"mob\" banns don't happen. well once again proof they riot is infact lieing to us and they do. \n\nHardly proof of \"lieing\". One report is all it takes. Nothing you've pasted proves that more reports did anything.","replies":[]},{"poster":"sweetrules","date":"2018-06-07T03:22:07.799+0000","up_votes":1,"down_votes":0,"body":"So, considering you were toxic from pretty much the start of that match, I wonder if you are actually that oblivious, or just another one of the people playing dumb like so many others each day. And if they were as toxic as you say, they were probably banned right along side you. Them being toxic doesn't excuse you being toxic. You being toxic(Which everyone can see you were from the very start) doesn't excuse them being toxic either. Honestly, even if you aren't lying about the chat bans, you were extremely toxic in that game. I'm not surprised you got a 14-day ban. You also mentioned personal information, which is advised against as well.","replies":[{"poster":"DeMostHated","date":"2018-06-07T03:36:59.058+0000","up_votes":1,"down_votes":6,"body":"if yout think this is toxic and deserves a insta or perma bann then idk how you do anything IRL I rly don't. I see way way worse all the time and nothing ever happends","replies":[{"poster":"fatherdarius","date":"2018-06-07T04:46:28.227+0000","up_votes":3,"down_votes":0,"body":"People don't act that way IRL. I don't know what you do IRL but in my RL people don't act anything like that. I think your IRL and my IRL might be in parallel universes or something. I'm glad I'm in mine and not in yours. Yours doesn't sound very positive (I mean, in your IRL universe someone who has an opinion about what is toxic, or what deserves a instant or permanent ban can't do anything or function in society, simply because they have an opinion on what is unacceptable). In my IRL universe, people have a wide variety of things they find acceptable or unacceptable, or toxic, or forbidden, or halal or haram, etc. This doesn't keep them from doing much of anything (other than, for example, avoiding alcohol of their culture/religion/societ/soberness requires it).\n\nYou IRL universe sounds very rigid indeed. I hope you're merely prone to hyperbole and over-generalization.","replies":[]}]}]},{"poster":"Geauxx","date":"2018-06-07T02:46:58.435+0000","up_votes":2,"down_votes":4,"body":"Holy shit, its kids on a game, stop getting butthurt and ignore them\n\nStop crying about a punishment when you can get some thick skin and ignore them\n\nNo one cares about your ego thinking you need to respond to everything, you nor whoever you're arguing with is shit, shut up and play.","replies":[]}]}