{"poster":"Lulses","date":"2017-09-24T17:26:00.686+0000","title":"¿Cómo jugar contra Teemo y Garen con Tryndamere?","subforum":"Guias y consejos","up_votes":6,"down_votes":0,"body":"No me ha ido mal con {{champion:23}}, pero estos dos campeones me han hecho la vida imposible, &iquest;Alg&uacute;n consejo?\r\nGracias de antemano.","replies":[{"poster":"Warwiick","date":"2017-09-24T18:45:53.348+0000","up_votes":6,"down_votes":0,"body":"si no puedes contra teemo , unete a teemo y si no puedes contra el gordo comunista de garen , LLAMA A PINOCHET V:","replies":[]},{"poster":"Turing Test","date":"2017-09-24T17:35:52.323+0000","up_votes":2,"down_votes":0,"body":"El blind pick es una adivinanza. Si jugás algún modo de draft: Si Teemo arranca con la pasiva de la E , necesitás runas de velocidad de ataque y warlord de maestría. El plan es tradearle de entrada. Si empieza la Q, lo mejor es tener fervor y botas. Obviamente no podés saber qué puta va a sacar Teemo pero lo normal es que saque la E. Necesitás movilizarte por los arbustos. \"Don del árbol padre\" es a tu favor. Si entra a un bush seguilo. Que no se aproveche de la pasiva. A level 2 esperá que intente utilizar el dardo cegador. Tratá de que sea lejos de sus minions. Incluso si lo acierta sobre vos, la ventaja es tuya. Seguilo y tradeale. De nuevo, la importancia de las botas y las maestrías correctas.\n\nGaren ¿qué te da problemas del demaciano?","replies":[]},{"poster":"Fortín de Villal","date":"2017-09-25T02:38:12.277+0000","up_votes":1,"down_votes":0,"body":"C garen no sabría decirte, pero siempre q tengas un teemo enfrente y tu champ sea cuerpo a cuerpo, armate resistencia magica de primeras (en el caso de trynda un malmortius, o resistencia espiritual para pura defensa, ambos tienen sinergia c trynda)","replies":[]},{"poster":"señor xin zhao","date":"2017-09-25T00:34:34.973+0000","up_votes":1,"down_votes":0,"body":"es mas contra con {{champion:103}} {{sticker:sg-ahri-2}}","replies":[]},{"poster":"Liche Vam","date":"2017-09-24T22:28:09.787+0000","up_votes":1,"down_votes":0,"body":"particularmente yo contra teemo jugaria de lvl 1 a 5 con los arbustos, de tal forma en que puedas ocultarte rapido ahi para que pierda vision de ti y no pueda tradearte, lo mismo con la q de teemo, si te la pega rapido al arbusto, intenta aguantar hasta lvl 6 y luego podras hacer tradeos mas eficientes, y bueno, con respecto a la linea siempre atras de tus subditos para que si te quiere golpear se coma daño de ellos ya que tu no se lo podras hacer, guardate siempre la e y juega mucho con la vision de el. si ves que gasta la q tu tienes un buen pool de vida puedes usar la e ofensiva para tradearle. pero cuidado en ese caso con los subditos enemigos.\n\nContra garen...  es cuerpo a cuerpo, evita confrontamientos tempranos, timea su ulti y si tiene ulti aprox a tus 20%-25% de vida ya te ejecuta, si sos su marca es aun mas el daño. un objeto de penetracion de armadura como tercer item no es algo loco y ten en cuenta que si se hace cuchilla negra su e aplica stacks de penetracion de armadura, pero no quita que unas tabi de ninja ayuda a reducir su daño ya que es todo fisico salvo su ulti que es magico o verdadero.\n\nen fin suerte","replies":[]},{"poster":"Azirlian","date":"2017-09-24T17:39:28.209+0000","up_votes":1,"down_votes":0,"body":"Termo te va a hacer la vida imposible ya que es adc y te va a joder mucho más ya que trynda no tiene early, siendo Main jungla mi consejo contra este es dejarlo avanzar hasta la torre y que se coma un gank lv3, o más tarde, total no tiene escape ni aguanta\n\nContra Garen igual, pero no tengo mucha idea ya que soy Main jg y top es lo menos que tocó","replies":[{"poster":"Dog Bulling","date":"2017-09-24T19:30:19.445+0000","up_votes":1,"down_votes":0,"body":"Tirador no es lo mismo que ADC. Para ser ADC debes tener un buen daño sostenido y pegar por la parte física (Se llama AttackDamageCarry por una razón). Teemo es más bien un asesino AP, cuya principal arma es la ceguera y el daño insano proporcionado por sus hongos. Dicha ceguera y el rango lo hace el mejor counter posible para Tryndamere, pero si, lo mejor es hacer una carpita cerca de el y matarlo 2 veces seguidas antes del nivel 6.\n\nEn cuanto a Garen, pues no pelees contra el, y de ser posible usar la E (el giro ese) de manera defensiva. Garen tiene unos excelentes daños  base, un silencio, buena mitigación de daño y una regeneración fuera de combate muy elevada. Simplemente debes esperar hasta nivel 6, porque dudo seriamente que ese bruto pueda matar a alguien que se vuelve inmortal con su R. Hacer Roaming podría ser buena idea también, porque durante los primeros 15 minutos es casi imposible sacar de batalla.","replies":[]}]},{"poster":"Jigøku","date":"2017-09-24T18:32:06.148+0000","up_votes":1,"down_votes":0,"body":"No les des kills porque te fuiste alv si lo haces, farmea, espera el gank y hazte gromp o rocosos cuando esten así consigues tus items, tu velocidad de ataque y que comience la diversión","replies":[]},{"poster":"SKT T1 Bank","date":"2017-09-24T17:32:55.031+0000","up_votes":1,"down_votes":0,"body":"Pues segun me dijo un amarillo son los reyes de top en soloq, no hay chance o los metes bajo torre o quedate bajo torre y no gastes tu destello hasta que tengan su ult.","replies":[]},{"poster":"Tomas3D","date":"2017-09-24T17:28:46.912+0000","up_votes":1,"down_votes":0,"body":"metete bien bajo torre y farmea lo maximo que puedas,solo espera al jg","replies":[]},{"poster":"faster51","date":"2017-09-24T23:06:25.160+0000","up_votes":1,"down_votes":1,"body":"baneandolos","replies":[]},{"poster":"Treant del DOTA","date":"2017-09-24T18:30:52.733+0000","up_votes":1,"down_votes":2,"body":"No hay ayuda porque son counterpicks. Saludos.","replies":[]}]}