{"poster":"Lulses","date":"2017-09-24T03:50:57.925+0000","title":"¿Cómo mainear a Tryndamere?","subforum":"Guias y consejos","up_votes":5,"down_votes":3,"body":"He estado jugando mucho con trynda, pero a&uacute;n me cuesta mucho ocuparlo, hace poco termin&eacute; una partida 7/10/6, creo que me fue mal, aunque igual ganamos, pero bueno, me gustar&iacute;a mainearlo tanto como maineo a Nasus.\r\nGracias de antemano.","replies":[{"poster":"P4inkiller","date":"2017-09-24T05:51:03.564+0000","up_votes":1,"down_votes":0,"body":"Dale al click derecho y gg","replies":[]},{"poster":"Jinxie","date":"2017-09-24T04:10:24.149+0000","up_votes":1,"down_votes":0,"body":"Tener el brazo derecho mucho mas desarrollado que el izquierdo","replies":[]},{"poster":"Defg45333","date":"2017-09-24T04:10:09.698+0000","up_votes":1,"down_votes":0,"body":"Tryndamere es un champ relativamente sencillo, no lo maineo pero te diré lo básico.\nEs un campeón basado en autoataques, es muy importante que estés autoatacando constantemente, y que te hagas items con daño de ataque, velocidad de ataque, robo de vida y probabilidad de crítico.\nEs muy vulnerable al CC enemigo, ya que no aguanta mucho que digamos si no se está curando, y no se puede curar mientras estás stuneado, procura esquivar en la medida de lo posible el CC o entrar cuándo ya lo hayan gastado.\n\nEs un splitpusher, tu función no es ir con tu equipo y pelear 5vs5, lo ideal sería que tu equipo se junten de a 4 en top o bot, y tu vas a pushear y tirar torres en la linea contraria. Esa presión hará que alguien del equipo enemigo deba defender, y si vas bien, necesitarán a 2 o 3 ya que eres un duelista con ventaja en la mayoría de 1vs1 (por supuesto que hay excepciones y counters).\nPD: Recuerda comprar wards, para ver venir a los enemigos, probablemente tu pusheo los atraiga.\n\nEs un champ de late, nada de surrenders tempranos con Trynda, tarde o temprano conseguirás objetos, y estos te harán fuerte aunque no hayas tenido el mejor comienzo.\n\nSobre las habilidades...\nLa Q a veces es mejor guardarla, sobre todo en early, pues en combate, esa chance de crítico extra puede ser más valiosa que un poco de vida, aunque depende de la suerte, ya que al principio tu chance de crítico no es muy alta.\n\nLa W además de ralentizar a los que huyen, reduce el daño que te hacen, muy importante lanzarla para pelear y no solo para perseguir.\n\nSobre la E no hay nada que explicar, puedes usarla para perseguir o para escapar (ten en cuenta el enfriamiento).\nPD: Supongo que lo sabías, pero puedes atravesar muros con ella.\n\nY la R, es tu habilidad de supervivencia, asegúrate de tener los reflejos de castearla a tiempo, si lo haces antes podrías durar menos en batalla, y si te tardas, tendrás que ver la pelea en blanco y negro, mientras esperas para volver a la partida.\n\nMás allá de la explicación básica del campeón (que supongo que la mayor parte ya lo sabías), el consejo definitivo para mainear cualquier champ, es practicarlo mucho, seguí jugando partidas y si querés complementar mirá videos de mains Tryndamere (de momento no se me ocurre ningún nombre), y vas a ver que de a poco mejorarás.\n\nUn saludo y srry por extenderme tanto.","replies":[]}]}