{"poster":"Linkimaru","date":"2018-02-15T19:17:25.801+0000","title":"Come fare a non incazzarsi","subforum":"Discussioni generali","up_votes":9,"down_votes":0,"body":"Voi avete un metodo per mantenere la calma e non tiltare in game qualsiasi cosa accada?\n\nPremesso che, pi&ugrave; si sale di elo pi&ugrave; ci si incazza, questo perch&egrave; si notano molti pi&ugrave; errori e ci si fa il sangue marcio, soprattutto quando si viene insultati dal compagno random che sta 0/10/0 ma si sente nella posizione di incolparti per qualche assurdo motivo (sicuramente vi sar&agrave; capitato spesso).\n\nIo ci riesco a periodi, ci son volte che la prendo totalmente con filosofia e volte che invece mi incazzo come una bestia e mi vien voglia di quittare il game, soprattutto durante le serie di sconfitte consecutive.\n\n** attenzione non parlo di flame o del fatto di scrivere o flammare  in chat, parlo solo di incazzarsi e tiltare al di la del fatto che poi scriviate o meno qualcosa per sfogarvi **","replies":[{"poster":"Pellah","date":"2018-02-15T20:42:02.101+0000","up_votes":13,"down_votes":4,"body":"Non appena il mio cuore vacilla mi ricordo che ci sono un sacco di eroi su cui posso contare.\n\nhttps://78.media.tumblr.com/06f0d5cf2e7491acc2fbe2e39031c1b1/tumblr_n9cnttf1FZ1ty0fy0o4_500.gif https://vignette.wikia.nocookie.net/bravefrontierglobal/images/f/fd/Omake_Gif_Anime_-_Boku_no_Hero_Academia_-_Episode_1_-_All_Might_Sparkling_Smile.gif/revision/latest?cb=20160501163038 https://pa1.narvii.com/5778/a062c45b4d790a5c4902f95d7dac26ff207a8691_hq.gif\n\nE loro sorridono anche nei momenti peggiori, quindi perché non dovrei farlo io?\n\nhttps://img00.deviantart.net/d4da/i/2015/118/9/1/one_piece_____i_left_all_of_it_at_that_place___by_sergiart-d8ef3z6.png","replies":[{"poster":"A Yordle ln Heat","date":"2018-02-15T21:04:46.395+0000","up_votes":8,"down_votes":1,"body":"Non ho mai letto una risposta tanto weaboo.\nE in questo forum ci sono IceFoxEren e Giorgio di Villa.","replies":[{"poster":"Giorgio di villa","date":"2018-02-15T22:30:49.587+0000","up_votes":2,"down_votes":0,"body":"Andiamo non sono poi così weeb\nNon ho mai comprato nessuna action figure, non leggo manga, Non ho nessuna waifu\n\n......insomma...non sono un weeb del cazzo vero? VERO? **VERO?**","replies":[{"poster":"MisogiKumagawa","date":"2018-02-16T08:24:41.567+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Giorgio di villa,realm=EUW,application-id=MJVj50Jw,discussion-id=u2cUJfuZ,comment-id=000b00000001,timestamp=2018-02-15T22:30:49.587+0000)\n>\nNon ho nessuna waifu\n\n\nE Speedwagon dove lo metti?","replies":[{"poster":"Giorgio di villa","date":"2018-02-16T08:35:59.978+0000","up_votes":3,"down_votes":1,"body":"Speedwagon è la rappresentazione della waifu perfetta\ntuttavia io **NON**  sono uno weeb e quindi non sento il bisogno di amare qualcosa che non esiste......ma nonostante questo ho comunque giocato ad una quantità sconcertante di eroge","replies":[{"poster":"Power Mac","date":"2018-02-16T08:40:43.305+0000","up_votes":6,"down_votes":0,"body":"Sì, ma ovviamente agli eroge ci si gioca per la trama... \n... giusto?","replies":[{"poster":"Giorgio di villa","date":"2018-02-16T08:51:42.649+0000","up_votes":3,"down_votes":0,"body":"Beh in molti di essi mi sono dovuto sorbire 19 capitoli di trama prima di arrivare alla parte hentai.....Però devo ammettere che ho imparato più inglese dagli eroge che dalla scuola","replies":[{"poster":"Power Mac","date":"2018-02-16T09:07:45.722+0000","up_votes":1,"down_votes":0,"body":"Scherzi a parte, concordo, anche se preferisco più le visual novel vere e proprie, tipo Higurashi (la mia preferita in assoluto). Infatti, oltre ad allargare il vocabolario, si imparano un sacco di phrasal verbs americani che a volte non trovi manco su wordreference ahahahah: se non sapessimo l'inglese ci perderemmo quelli che, di fatto, sono libri d'intrattenimento (o light novel in un certo senso) con background e sprites, belli e spesso scritti veramente bene.","replies":[{"poster":"Giorgio di villa","date":"2018-02-16T12:39:54.731+0000","up_votes":1,"down_votes":0,"body":"Non so bene la differenza tra eroge e visual novel ma se voglio un eroge di solito con la serie _sakura_ so sempre di andare sul sicuro\nPer ora il mio preferito è stato _princess evangile_  \n\nMa come siamo passati da un argomento come \"il non incazzarsi\" a \"videogiochi per pervertiti\"","replies":[{"poster":"Power Mac","date":"2018-02-16T12:52:04.520+0000","up_votes":2,"down_votes":1,"body":"La visual novel classica è solo testo, niente scelte o altro (tipo appunto Higurashi); altrimenti, assai più di frequente, possono essere degli eroge senza scene ecchi (esempio, Rewrite). Non la conoscevo come saga, lo proverò! A me invece è piaciuto parecchio Yume miru kusuri come eroge, ultimamente: old but good.\n\nÈ per via del Regolamento, quando lo abbiamo riscritto abbiamo inserito regole meno rigide sugli off-topic che \"nascono naturalmente\": la conseguenza è che ora parliamo di eroge. Devo ancora decidere se esserne soddisfatto o meno.","replies":[{"poster":"TheDanik","date":"2018-02-17T08:59:50.720+0000","up_votes":2,"down_votes":0,"body":"Ragazzi lo sapete che questa discussione ha risollevato il morale ad una persona triste?{{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"MisogiKumagawa","date":"2018-02-16T12:43:42.195+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"MisogiKumagawa","date":"2018-02-16T12:44:03.086+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IceFoxEren,realm=EUW,application-id=MJVj50Jw,discussion-id=u2cUJfuZ,comment-id=000b000000010002000000010001000000000000,timestamp=2018-02-16T12:43:42.195+0000)\n>\n>  quello lo hai fatto tutto da solo","replies":[]}]}]}]}]}]}]}]},{"poster":"mangialavandini","date":"2018-02-16T07:55:06.272+0000","up_votes":4,"down_votes":0,"body":"Non ho nessuna waifu...\n\nNon ho nessuna waifu...\n\nCOSA!??!?!","replies":[{"poster":"Ardens33","date":"2018-02-16T10:18:03.147+0000","up_votes":2,"down_votes":4,"body":"Ma una ragazza vera?","replies":[{"poster":"mangialavandini","date":"2018-02-16T10:21:35.211+0000","up_votes":3,"down_votes":0,"body":"L'utilità del commento qual'è? (non sto usando un tono aggressivo)\n\nAvere una ragazza vera non mi ferma nell'immaginare una pazza psicopatica sexy jinx o una attraente, intelligente Bulma con i capelli VERDI CHE OMMIODDIO.....\n\nE poi c'è Rem - questo commento potrebbe generare guerre future","replies":[{"poster":"MisogiKumagawa","date":"2018-02-16T10:52:33.258+0000","up_votes":1,"down_votes":0,"body":"Nah,meglio Trish Una o Yukako Yamaghishi da jojo","replies":[{"poster":"Giorgio di villa","date":"2018-02-16T11:07:41.366+0000","up_votes":1,"down_votes":0,"body":"Sai icefox......a volte penso che averti fatto conoscere Jojo ti abbia fatto più male che altro","replies":[{"poster":"MisogiKumagawa","date":"2018-02-16T11:14:20.582+0000","up_votes":1,"down_votes":0,"body":"Perchè?","replies":[{"poster":"Giorgio di villa","date":"2018-02-16T11:34:25.938+0000","up_votes":1,"down_votes":0,"body":"Era una battuta per indicare che ora sei ossessionato da Jojo","replies":[{"poster":"MisogiKumagawa","date":"2018-02-16T11:46:48.996+0000","up_votes":1,"down_votes":0,"body":"Ovvio,è questo l'effetto che fa jojo","replies":[]}]}]}]}]}]},{"poster":"Vileblood Pyke","date":"2018-02-16T11:21:11.938+0000","up_votes":1,"down_votes":0,"body":"https://i.imgur.com/lnqX67N.gif","replies":[{"poster":"Ardens33","date":"2018-02-16T17:10:31.402+0000","up_votes":1,"down_votes":0,"body":"Mah nelle fumetterie che frequentoo conosco certa gente che é fuori dalla realtà (o invischiata in una alternativa) a livelli patologici però, oltre a un' altra serie di comun denominatori che legano questa.. community. \nTrovo triste fantasticare su dei disegni, non per le situazioni che possono rappresentare, ma trovare attraente _il disegno in sé_, poi a me non cambia nulla, but still..","replies":[]}]}]}]},{"poster":"MisogiKumagawa","date":"2018-02-16T06:35:54.863+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Giorgio di villa,realm=EUW,application-id=MJVj50Jw,discussion-id=u2cUJfuZ,comment-id=000b00000001,timestamp=2018-02-15T22:30:49.587+0000)\n>\n> non leggo manga\n\nEd è questo il motivo per cui non sei un vero jojo fan,te l'ho detto, WRYYYEad the manga!","replies":[]}]}]},{"poster":"CasualNoobITA","date":"2018-02-15T21:15:28.493+0000","up_votes":1,"down_votes":3,"body":"https://memegenerator.net/img/instances/500x/80977458/che-cazzo-ridi.jpg","replies":[{"poster":"Pellah","date":"2018-02-15T22:41:00.247+0000","up_votes":4,"down_votes":1,"body":"https://vignette.wikia.nocookie.net/bravefrontierglobal/images/f/fd/Omake_Gif_Anime_-_Boku_no_Hero_Academia_-_Episode_1_-_All_Might_Sparkling_Smile.gif/revision/latest?cb=20160501163038","replies":[]}]},{"poster":"Power Mac","date":"2018-02-16T08:42:16.406+0000","up_votes":1,"down_votes":0,"body":"Tutti questi quattro messi assieme (di cui conosco solo il buon Rubber, pur non piacendomi One Piece), crollerebbero dopo neanche tre minuti di fronte all'unico vero eroe e guerriero mai esistito: Bud Spencer.","replies":[{"poster":"MisogiKumagawa","date":"2018-02-16T11:33:49.350+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Power Mac,realm=EUW,application-id=MJVj50Jw,discussion-id=u2cUJfuZ,comment-id=000b0002,timestamp=2018-02-16T08:42:16.406+0000)\n>\n> Tutti questi quattro messi assieme (di cui conosco solo il buon Rubber, pur non piacendomi One Piece), crollerebbero dopo neanche tre minuti di fronte all&#x27;unico vero eroe e guerriero mai esistito: Jean Pierre Polnareff\n\n\n\n\nFixed,polnareff è la vita\n\n\nhttps://vignette.wikia.nocookie.net/jjba/images/8/8f/JP_Polnareff.png/revision/latest/scale-to-width-down/341?cb=20170316071821\n\nhttps://vignette.wikia.nocookie.net/vsbattles/images/6/6b/Jean_Pierre_Polnareff_Anime.jpg/revision/latest?cb=20140627193556\n\nhttps://vignette.wikia.nocookie.net/jjba/images/a/a4/Polnareff_tongue.png/revision/latest?cb=20150403192750\n\nhttps://i.pinimg.com/originals/0b/cf/98/0bcf98691f2738654a5e2fc6ed2857db.png","replies":[{"poster":"Power Mac","date":"2018-02-16T12:54:51.369+0000","up_votes":1,"down_votes":0,"body":"Non scherzare col fuoco, che Bud usa l'ultra istinto:\n\nhttps://i.ytimg.com/vi/pqStEjpZU-A/hqdefault.jpg","replies":[{"poster":"MisogiKumagawa","date":"2018-02-16T13:09:33.984+0000","up_votes":1,"down_votes":0,"body":"Il potere del Chariot Requiem di Polnareff è superiore a qualsiasi altra cosa che non sia un Requiem","replies":[{"poster":"LoLSlade","date":"2018-02-16T23:13:30.675+0000","up_votes":1,"down_votes":0,"body":"Non è NULLA di fronte a Saitama. Ok.","replies":[{"poster":"MisogiKumagawa","date":"2018-02-17T06:26:18.653+0000","up_votes":1,"down_votes":0,"body":"Saitama finirebbe addormentato ancora prima di potersi avvicinare,poi la sua anima finirebbe in qualche animale random,rendendolo easy da uccidere,nemmeno saitama può fare molto con un corpo di rana o di passerotto","replies":[]}]},{"poster":"Dr LouD","date":"2018-02-16T17:10:54.317+0000","up_votes":1,"down_votes":0,"body":"no.","replies":[{"poster":"MisogiKumagawa","date":"2018-02-16T17:27:51.751+0000","up_votes":1,"down_votes":0,"body":"Invece si","replies":[{"poster":"Dr LouD","date":"2018-02-16T17:47:16.281+0000","up_votes":1,"down_votes":0,"body":"Posso capire l'ossessione e il fanatismo.. ma no.","replies":[{"poster":"MisogiKumagawa","date":"2018-02-16T18:06:24.329+0000","up_votes":1,"down_votes":0,"body":"Invece si","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Myþhz","date":"2018-02-15T19:42:04.750+0000","up_votes":6,"down_votes":0,"body":"Io mi incazzo molto raramente perché ho capito che League of Legends è solamente un gioco. Ci sta lamentarsi (a voce, o pensato) di qualche compagno, ma addirittura arrabbiarsi mi sembra eccessivo. Ho capito che l'opinione di altri 9 player che mi giudicavano e mi insultano perché (secondo loro) ho sbagliato vale meno di zero. \n\nCome fare quindi a non arrabbiarsi? \n1) Devi capire che league of legends è solamente un gioco e non cambierà nulla nella tua vita se vinci o perdi, se il tuo jungler ganka o meno la tua lane\n2) Devi capire che gli insulti di persone che non ti conoscono e ti giudicano per 1 partita non valgono nulla\n\nSe poi i loro insulti ti danno fastidio e non riesci a rimanere indifferente, esiste il /mute all.","replies":[]},{"poster":"A Yordle ln Heat","date":"2018-02-15T19:26:50.895+0000","up_votes":3,"down_votes":0,"body":">quando si viene insultati dal compagno random che sta 0/10/0 ma si sente nella posizione di incolparti per qualche assurdo motivo (sicuramente vi sarà capitato spesso).\n\nCredo che capiti in ogni elo, lel.\nA me è capitato giusto oggi, con un GP che mi dava del brainless e dell'afk perché non lo seguivo quando lui andava deep nella giungla nemico (si parla di deep a livello lupi e krug) ben sapendo che nella stessa zona circolassero jungler, toplaner e midlaner nemici, e invece stavo east-side a fare il drago. :^)\n\nPremetto che a me non piace mutare, semplicemente perché lo sento come un enorme handicap nella cooperazione del team (sì, anche se lo metto solo agli alleati che fanno solo i tossici e non aiutano), quindi quando un alleato tilta e flamma decido di sorbirmelo. In questi casi, quello che mi aiuta tantissimo è lamentarmene, però fuori dal game: che ci sia un amico su Discord nello stesso momento (poco importa se nel mio stesso match o meno) o che debba andare fin su WhatsApp o Telegram nei periodi in cui sono morto a scrivere un walltext molto salato, di solito lamentarmi e riderne con qualcuno mi aiuta ad abbassare molto il tilt.\n\nIl motivo per cui funziona credo sia perché inibisce molto la sensazione di impotenza che viene quando sai che un alleato non vuole collaborare, non vuole vincere, e poco puoi fare per fargli cambiare idea.","replies":[]},{"poster":"ILoveTiramisu","date":"2018-02-15T22:57:31.271+0000","up_votes":2,"down_votes":0,"body":"Ci tengo a dire che è impossibile non incazzarsi mai a sto gioco, però si può ridurre di molto capendo il motivo per cui ti arrabbi. Quando te entri in ranked o in partita punti a vincere, il fatto che non riesci ti da voglia di flamare, ma se tu entri in partita con la mentalità più sul voglio migliorare e raggiungere la perfezione quando gioco X inizia a cambiare un po tutto. Non sto scherzando. Il problema è che il tilt puo iniziare a venire per sbagliare il lasthit 3 volte di fila, ma non flami. Dipende molto da come vedi le cose.\n\nUn altra cosa che usavo era di pensare che i miei nemici volevano che io mi arrabbiassi e di conseguenza non lo facevo.\n\nComunque è una cosa normalissima, devi solo cambiare il tuo pensiero quando entri in game. \n\nDifferenza delle due mentalità è che uno si arrabbia per gli errori degli altri e l altro per i suoi, ma dato che maini quel campione, non ti arrabbierai quasi mai, ma puoi tiltare per 3 minions persi di fila.","replies":[]},{"poster":"Aurelion Shmoll","date":"2018-02-15T20:01:47.770+0000","up_votes":2,"down_votes":0,"body":"Realizzare quali siano le cose per le quali valga la pena incazzarsi.","replies":[]},{"poster":"BrattishSolid6","date":"2018-02-15T19:36:43.262+0000","up_votes":2,"down_votes":0,"body":"Guardo soprattutto ciò che faccio io.\n\nQuella persona sbaglia? Può darsi. Magari sì. Magari è colpa di quella persona se abbiamo perso il fight. Magari è colpa di quella persona se perdiamo questa partita. Ma io in quel fight ho fatto tutto ciò che potevo fare? Ma io in questa partita ho preso davvero tutte le scelte migliori? La risposta è sempre no. \n\nSe gioco per migliorarmi (in ranked quindi) mi concentro su di me e su quello che posso fare meglio.\nSe gioco per divertirmi (ARAM, draft, normal) mi frega poco della partita.\n\nIo comunque spessissimo gioco con amici. Questo implica che oltre al criticarci e migliorarci (critiche costruttive, consigli veri) alleggeriamo molto di più la tensione. Si ride, si scherza. E soprattutto ho notato che quando qualcuno di noi si tilta (perché comunque arrabbiarsi di tanto in tanto capita, è umano) gli altri difficilmente sono tiltati nello stesso identico momento, e quindi tranquillizzano il tilted.","replies":[]},{"poster":"mikellazzo","date":"2018-02-16T00:08:05.975+0000","up_votes":3,"down_votes":1,"body":"Oggi mi sono incazzato così tanto che sono andato in ranked con gp ap mid e la cosa bella è che quel game l'ho pure vinto LUL","replies":[]},{"poster":"Bluishlion","date":"2018-02-15T19:52:28.139+0000","up_votes":3,"down_votes":1,"body":"Ti capisco e ripeto sempre questa frase:\" Ma con chi cazzo sto giocando?\". Sono platino 3 e quando vede certe oscenitá mi faccio una belva però ormai ho capito che non devo piú incazzarmi, alla fine è un gioco, non mi frutta niente economicamente ed anche se arrivassi diamond/master ecc. cosa avrei concluso? Un cazzo xD","replies":[]},{"poster":"Giorgio di villa","date":"2018-02-15T19:28:54.089+0000","up_votes":3,"down_votes":1,"body":"Io prima di scrivere mi dico sempre \"può effettivamente servire a qualcosa?\"\nMa Incazzarsi è umano e credo sia impossibile mantenere sempre la calma\nSemplicemente io accanto alla scrivania dove gioco ho un peluches di Arceus con il quale.......**parlo** per sfogarmi....si è abbastanza strano","replies":[]},{"poster":"SPARATEVI","date":"2018-02-16T10:25:14.221+0000","up_votes":2,"down_votes":1,"body":"si io ho un metodo molto valido, però non ha funzionato quando ho letto l'eresia grammaticale nel titolo di questo post","replies":[]},{"poster":"Jon Moxley","date":"2018-02-15T19:59:02.946+0000","up_votes":2,"down_votes":1,"body":"Non gioco per carriare. Preferisco giocare qualcosa di più mellow tipo rammus, sejuani, shen, e non prendere champ da carry tipo evelynn o warwick. Giocare champ da carry fa avvelenare il sangue.","replies":[]},{"poster":"Aurelion Shmoll","date":"2018-02-18T03:12:27.465+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=kAI9LZHMoZA","replies":[]},{"poster":"Nabbomaster","date":"2018-02-16T21:31:16.261+0000","up_votes":1,"down_votes":0,"body":"... ah i problemi della vita\ncome erano fortunati nel medioevo, loro non avevano tutti i nostri problemi","replies":[]},{"poster":"CesoiePlastiche","date":"2018-02-15T19:28:21.038+0000","up_votes":1,"down_votes":0,"body":"si, muto tutti e metto a palla running in the 90's o dejavu, hanno un effetto gasante su di me e mi fanno dimenticare le brutte giocate o il flame dei compagni.","replies":[]}]}