{"poster":"Linkimaru","date":"2018-04-01T18:23:54.530+0000","title":"10 cose che mi fanno sorridere","subforum":"Discussioni generali","up_votes":4,"down_votes":4,"body":"1) Gente che chiede &ldquo; quale champ mi consigli per uscire dall&rsquo;elo X?&rdquo;. Come se il champ facesse la differenza piuttosto che la bravura come player XD.\r\n\r\n2) Gente che parla da &ldquo;espertone&rdquo; usando termini tecnici e tirandosela anche un po&rsquo; e poi scopri che &egrave; bloccata in gold 5 da anni (se va bene).\r\n\r\n3) Gente che considera lol un gioco di pura fortuna, per carit&agrave; la fortuna fa anche la sua parte ma solo nel breve periodo. \r\n\r\n4) Gente che dice &egrave; impossibile uscire dall&rsquo;elo X a causa del team e anche degli smurf. Peccato che gli smurf sono esseri umani tali e quali a voi, se loro salgono non vedo perch&eacute; non pu&ograve; farlo chiunque.\r\n\r\n5) Gente che parla di &ldquo;noob champ&rdquo; e poi magari &egrave; bloccata in bronzo. Se pensi che esistano champ facili che aumentano le tue probabilit&agrave; di vincere allora usali e diventa challenger e solo allora potrai dire che sono &ldquo;noob champ&rdquo;.\r\n\r\n6) Gente incoerente, segue il meta dei vari pro player finch&eacute; fanno stronzate situazionali (vi ricordate i tempi di Miss fortune support per dirne una) ma adesso che agli lcs pickano solo sejuani/olaf/skarner/trundle in giungla ad esempio io continuo a incontrare solo shaco/lee sin/kha zix.\r\n\r\n7) Gente che &egrave; convinta di imparare a giocare guardando gli stream di elo alto. L&rsquo;unico modo per imparare in questo gioco &egrave; giocare. Guardare Gente pi&ugrave; brava ti pu&ograve; dare qualche spunto per migliorare ma il 90% &egrave; tutta pratica.\r\n\r\n8)Gente che si lamenta dei Ban pur sapendo e ammettendo di aver infranto il regolamento in uno o pi&ugrave; punti. &ldquo;Ehi per&ograve; ho speso 500&euro; di skin non possono bannarlo XD&rdquo;.\r\n\r\n9)Gente che &egrave; convinta che Vincere sia dovuto, che tutti devono salire, altrimenti c&rsquo;&egrave; qualcosa che non va. Avete mai pensato che se tutti arrivassero a challenger non esisterebbe pi&ugrave; una classificca ne sarebbe pi&ugrave; considerabile un gioco competitivo? \r\n\r\n10) Gente che considera il d5 il punto di arrivo e non di partenza. Scusate se ve lo dico ma tra bronzo e gold la differenza &egrave; minima e si &egrave; come bambini all&rsquo;asilo, a platino si inizia a imparare le basi, a diamond si ottiene la consapevolezza di fare schifo ma di avere potenzialit&agrave; di fare bene e da master in poi si pu&ograve; dire di essere bravi a questo gioco.","replies":[{"poster":"SacreD20","date":"2018-04-01T22:39:38.108+0000","up_votes":2,"down_votes":1,"body":"A me fanno sorridere due cose:\n\n\n1) Post di sfogo;\n\n2)Sfogo sui post di sfogo.","replies":[]},{"poster":"Dodop","date":"2018-04-01T19:50:38.551+0000","up_votes":2,"down_votes":1,"body":"Anche io sorridevo leggendo i tuoi post di sfogo.","replies":[]},{"poster":"Rohan97","date":"2018-04-02T10:32:19.323+0000","up_votes":1,"down_votes":4,"body":"Bronzo e gold non sono PER NIENTE LA STESSA COSA.\nLe basi le impari in silver, non in platino... che stai dicendo ?","replies":[{"poster":"ImSmurfnHolyPogz","date":"2018-04-02T19:36:56.220+0000","up_votes":1,"down_votes":0,"body":"Per arrivare a platino basta spammare un campione per 2000 partite. Per arrivare a diamond devi capire le basi del gioco..\n\nA imparare 4 skill per campione ci metti poco, poi arriva tutto il resto","replies":[{"poster":"Rohan97","date":"2018-04-02T19:59:39.847+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Moonacre,realm=EUW,application-id=MJVj50Jw,discussion-id=Kd8f3WqL,comment-id=00030000,timestamp=2018-04-02T19:36:56.220+0000)\n>\n> Per arrivare a platino basta spammare un campione per 2000 partite. Per arrivare a diamond devi capire le basi del gioco..\n> \n> A imparare 4 skill per campione ci metti poco, poi arriva tutto il resto\n\ninsisto. le basi del gioco le impari in silverII/I. se poi tu sei arrivato diamond e le hai imparate li , beh sei molto fortunato :P","replies":[]}]}]},{"poster":"Aurelion Shmoll","date":"2018-04-01T18:26:54.184+0000","up_votes":1,"down_votes":0,"body":"Sorridi un poco per tutto insomma, beatitudine.","replies":[{"poster":"Linkimaru","date":"2018-04-01T19:06:49.490+0000","up_votes":1,"down_votes":0,"body":"A Pasqua puoi","replies":[]}]}]}