{"poster":"Linkimaru","date":"2018-09-17T07:18:18.179+0000","title":"Finite tutte le missioni odissea da solo Ma...","subforum":"Discussioni generali","up_votes":2,"down_votes":3,"body":"Ma un appunto su quanto fa SCHIFO la community, mi mancava solo la missione dei 2 potenziamenti a massacro, entro in stanza e sia io che un altro chiediamo per favore di prendere 2 potenziamenti in modo di fare la missione. 3 premade in stanza dicono va bene, entriamo i gioco &egrave; noto che quei 3 premade hanno 4 potenziamenti anzich&eacute; 2.... Gli chiediamo gentilmente di surrendare in modo da poter evitare di perdere tempo e loro che fanno? \r\nNon solo Si rifiutano ma aspettano tutti fuori dal cerchio per farci perdere pi&ugrave; tempo possibile a me e all&rsquo;altro sconosciuto che aveva la missione come la mia... a quel punto io e lui stiamo fermi sperando che in tre perdano ma invece quegli emeriti pezzi di ***** continuano a tryhardare da soli e arrivano addirittura al boss finale (aspettando sempre il massimo di tempo tra un livello e l&rsquo;altro ballando e ridendo fuori dal cerchio). Morale ho perso 30 minuti di tempo per colpa di 3 bambini dispettosi che piuttosto che fare un semplice e rapido surrender dopo averci ingannato al pick, hanno deciso di farci &ldquo;soffrire&rdquo; per divertirsi e poi perdere al boss finale ovviamente (non sapete quando ho goduto, almeno hanno perso tempo anche loro).\r\nChe SCHIFO. \r\nIl Game successivo ho trovato persone per bene ed abbiamo vinto easy. Ho preso la borsa pollo ed ho trovato tutte le skin invernali .-. .","replies":[{"poster":"Vähn","date":"2018-09-17T13:51:58.691+0000","up_votes":1,"down_votes":0,"body":"I tre del premade hanno sbagliato a non dire che sarebbero partiti con 4 potenziamenti, ma voi due siete in torto marcio, chi gioca quella modalità deve capire che se qualcuno non prende i potenziamenti che uno vuole deve giocare comunque, siete in torto marcio a non aver giocato e siete tossici quanto e peggio di chi vi ha detto che avrebbe giocato con due potenziamenti.","replies":[{"poster":"Linkimaru","date":"2018-09-17T15:13:07.174+0000","up_votes":1,"down_votes":0,"body":"Considerando che si può surrendare fin da subito senza danneggiare nessuno direi che i tossici sono stati loro a farci ostruzionismo solo per il gusto di far perdere tempo, sapendo che comunque in 3 non avrebbero potuto vincere. A me pure una volta è capitato di sbagliare e mettere troppi potenziamenti e sono stato il primo a scusarmi e surrendare, anzi è successo diverse volte anche ad altri ed abbiamo sempre surrendato per il “bene comune”. Senza contare l’utilizzo scorretto ed ingannevole della chat pre-Game da parte loro. ","replies":[]}]},{"poster":"TheDarkLordITA","date":"2018-09-17T13:12:47.774+0000","up_votes":1,"down_votes":0,"body":"se ti va potresti darmi una mano...sono solo alla quest dei 3 augments...","replies":[]},{"poster":"Matteo00","date":"2018-09-17T11:27:29.668+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Linkimaru","date":"2018-09-17T11:34:29.001+0000","up_votes":1,"down_votes":0,"body":"Il potenziamento se appare lo fa quasi subito, loro stavano attorno al cerchio a ballare e spammare emote fino allo scadere del tempo per sfottere...","replies":[]}]},{"poster":"sxrrxwland","date":"2018-09-17T11:07:46.391+0000","up_votes":1,"down_votes":0,"body":"Almeno sei stato fortunato a trovare qualcuno per bene dopo \"solo\" una partita. Ci ho provato anche io ma difficilmente trovo qualcuno che sia d'accordo per fare quella missione o che sia disposto a prendere una build decente. Probabilmente neanche ci proverò a finire quella quest","replies":[]}]}