{"poster":"Player A","date":"2016-08-11T08:29:49.779+0000","title":"Kled","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Ormai &egrave; gi&agrave; uscito il champ Kled, apro il post per iniziare una discussione riguardo Kled il nuovo campione sia per chi l&#039;ha incontrato contro sia per chi lo ha usato, per scambiare qualche informazione. Cosa ne pensate di questo campione? In quale lane va meglio? Va buffato o nerfato e perch&eacute;? Consigliate (a me e altri) di acquistarlo o non ne vale la pena? Quali campioni sono pi&ugrave; efficaci contro di lui in ranked?","replies":[{"poster":"vondarck","date":"2017-02-06T16:13:13.067+0000","up_votes":1,"down_votes":0,"body":"{{champion:240}}  non ho visto praticamente nessuno snowballarci in early, ma non conosco nessuno che sappia giocarlo veramente bene, quindi la mia opinione è aleatoria, sta di fatto che ha un poke che non costa mana, una passiva che da AS e un doppio grap closer a media distanza, la ulti è molto buona\n\nin late diventa veramente forte per via della sua passiva\n\nla build:\n\nrosse: ad\n5th: ad\ngialle: arm\nblu: 6 cdr x level+3 MR x level\n\n{{item:3071}} {{item:3748}} {{item:3742}} {{item:3156}} {{item:3111}} {{item:3026}} \n\nP.S. a stare su OP.gg la sua % + alta di win è entro il minuto 25 quindi non ha poi un early così scandaloso a quanto pare..","replies":[]},{"poster":"ignoranza italia","date":"2016-08-12T09:24:55.509+0000","up_votes":1,"down_votes":0,"body":"Kled ora come ora non lo vedo molto forte me lo sono trovato sia contro in ranked che sia con in normal,nella ranked non dava problemi a nessuno anzi ha feddato il nostro jax di 2 kil poi ha iniziato a vincere, quando me lo sono trovato con ha perso malissimo la lane contro un rene quindi da quello che posso dire è buono late game e in early stai attento contro vari champ es {{champion:114}} {{champion:24}} {{champion:58}} {{champion:92}}  non l'ho giocato ma da come vedo in game non è tutto sto granchè. io non ti consiglio di comprarlo per ora ci sono champ migliori. buon game :D","replies":[{"poster":"LYT Meteor5","date":"2017-02-06T15:38:35.677+0000","up_votes":1,"down_votes":0,"body":"Primo Kled è un counter di Riven, poi prova a fiddare un bravo Kled... Semplicemente non andrà mai giù. {{champion:240}} {{champion:240}} {{champion:240}}","replies":[]}]},{"poster":"Nyskinight","date":"2016-08-14T19:31:05.208+0000","up_votes":1,"down_votes":0,"body":"io l'ho comprato e lo uso in top lane e ho notato che è molto forte all'inizio del game e non cambia molto andando avanti con la partita. per quanto riguarda nerfarlo o baffarlo la mia opinione è che ora come ora è apposto così perché se viene nerfato la combo perde di intensità e di potenza mentre se viene buffato diventerebbe troppo forte e quindi sempre bannato e se per caso entra in partita chi l'ha contro può già dichiarare lane persa. come champ la sua difficoltà maggiore è quando perde skarl perché rimane con poca vita e con 2 abilità soltanto inoltre è da calcolare approssimativamente quando recuperare skarl perché funziona in questo modo: nella barra della vita hai sia la vita di skarl e quella di kled che più o meno è l'80% di skarl e quando perdi skarl e cominci a subire danni su kled quando recuperi skarl a kled non viene repristinata la sua intera vita ma viene bloccata e sommata al 70% circa la vita di skarl. esempio kled ha 800 hp e skarl 1000 hp, skarl scappa e kled subisce danni e arriva a 125/800 di vita, quando recupera skarl viene fuori 125/800 715/1000 quindi sarebbe meglio che kled recuperasse tutta la vita prima di riprendere skarl anche se rischia molto. ovviamente di base ha il 5% di rubavita.\nin lane ho trovato delle difficoltà con {{champion:54}}  e con {{champion:74}} ma per il resto mi diverto come un matto e lo consiglierei a tutti quelli che piace far innervosire l'avversario {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Eidunn","date":"2016-08-11T09:39:16.040+0000","up_votes":1,"down_votes":0,"body":"provalo se ti piace e se sei perplesso vedi video di you tube e di twich","replies":[]}]}