{"poster":"Player A","date":"2016-08-20T18:50:15.900+0000","title":"Aatrox, domandina","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Siamo sinceri ragazzi, ma in questa season quanto &egrave; inutile aatrox? Va bene, va bene, non &egrave; male in early game e in alcune situazioni, ma in confronto agli altri champ &egrave; troppo debole, non &egrave; che un buffatino &egrave; in arrivo? oppure lo state reworkando? Qualcuno sa qualcosa?","replies":[{"poster":"Darkinknight","date":"2016-08-20T19:50:18.978+0000","up_votes":1,"down_votes":0,"body":"Verra reworkato quindi non aspettarti buff..non è inutile in questa season,è inutile da quando è uscito (subito dopo i nerf),certo gli oggetti che infliggono ferita grave proprio non lo aiutano..\nPro:ipoteticamente vince le lane con il 90% dei champ di lol,realmente vince 1 vs 1 contro il 100% dei champ di lol nel late game(cosa particolarmente inutile)\nContro:hp base bassi + costi in %salute per 2 skill,difese basse,nessuna skill difensiva,cd infiniti su q ed e,non esiste build che gli colmi tutti i suoi punti di forza,cc scarsi,nessu power spike abbinato a un item esistente,per quanto sia feedato non puo mai buttarsi di ignoranza e sperare di vincere,se invece perde la lane puo pure andare afk..\nMa se ti piace usarlo e impari bene le tempistiche ci carri tranquillamente da solo,ma devi vincere alla svelta la lane e mettere subito pressione alle altre lane","replies":[{"poster":"DuckQuack0","date":"2016-08-20T19:58:17.241+0000","up_votes":1,"down_votes":0,"body":"realmente hai un po' esagerato xD","replies":[{"poster":"Darkinknight","date":"2016-08-21T09:37:24.208+0000","up_votes":1,"down_votes":0,"body":"Ho piu di 200 k su aatrox,penso davvero uno dei pochi su lol a usarlo..ormai l'ho provato piu volte contro tutti e con qualsiasi build..il suo kit questo gli permette\nMa magari sbaglio,dimmi su cosa secondo te 😊","replies":[{"poster":"DuckQuack0","date":"2016-08-21T10:20:14.475+0000","up_votes":1,"down_votes":0,"body":"> realmente vince 1 vs 1 contro il 100% dei champ di lol nel late game\n\nmi riferivo solo a questo","replies":[{"poster":"Darkinknight","date":"2016-08-21T11:46:11.494+0000","up_votes":1,"down_votes":0,"body":"Il motivo è molto molto semplice,anche matematicamente parlando.. Per come lo buildo io (poi qualcosa cambia situazionalmente),raggiunge circa i 3300 hp e intorno ai 200 nelle difese (piu o meno poi dipende dal team avversario se è piu ad o ap),nel late praticamente ogni 3 colpo (quindi ogni 1.2 secondi circa) se sta sotto al 50% di vita ritorna sempre sui 50-70% di vita,quindi dai 1650-2100 circa hp..nessuno 1 vs 1 è in grado di togliergli quel quantitativo senza che prima si refulli..i melee (tryndamere,jax,xin,ww,riven e via dicendo) non avranno mai abbastanza danno per non esplodere e fare tutto quel danno in 1.2/1.5 secondi..i mage e assasin hanno la combo,che non basta a fare tutto quel danno,gli adc lo avrebbero piu che altro con il kite ma aatrox ha la Q+ulti e prima che l'adc riatterri è gia morto,i tank invece li scioglie per lo stesso motivo dei melee...e non sto nemmeno contando l'ipotetica passiva nel caso in cui per qualsiasi motivo morisse(possibile solo con una combo con danno elevatissimo,dopo la quale non sarebbe piu possibile utilizzarla)..la sua versatilita nella build non gli consente di eccellere in nulla,ma di adattarsi contro qualunque avversario efficacemente...ovviamente poi entra in gioco anche la skill,una vayne che ti dodgia la Q e sa kitare non la prendi piu,ma li sta nel player a non sprecarla..pero come ti ho detto vale solo per gli 1 vs 1,e in late è particolarmente raro","replies":[{"poster":"DuckQuack0","date":"2016-08-21T12:30:54.159+0000","up_votes":1,"down_votes":0,"body":"Ma jax fa danni misti, in più con la E non gli fai niente, non credo jax sia battibile in un 1v1 contando la ulti diventa doppio del tank, se per questo manco un tryn è battibile in un 1v1, 200 armor se li beve uno come tryndamere coi danni che ha, al massimo con Riven ok, neanche Xin con la build Jungle è battibile, gli basta botrk claws e poi tank","replies":[{"poster":"Darkinknight","date":"2016-08-21T14:26:39.055+0000","up_votes":1,"down_votes":0,"body":"Gia provati tutti questi vs questi,in full build non si avvicinano nemmeno a batterlo..lo arano per 75% del match,ma in full build non riescono nemmeno lontanamente..jax,trynda ecc possono anche resistere 20 secondi,ma non riusciranno mai a fargli 2000 danni in 1.2/1.5 secondi..va avanti a loop finche non muoiono..a grandi linee trynda lo si outscala a parita nell 1 vs 1 al 4 item, jax a 5xin non ricordo se al 4-5..fra tutti questi quello che si avvicina di piu a batterlo è ww,ma sta lontano anche lui...se ci fosse una modalita per arrivarci velocemente a full build senza perdere tempo ti farei anche vedere,altrimenti ti basta la matematica 😊..semplicemente loro fanno piu danno ma non abbastanza per killarlo prima che torni oltre il 50% di hp,e non hanno lifesteal sufficiente per non perdere hp a loro volta\nPs : in combattimento finche usa la e nemmeno lui mi fa nulla","replies":[]}]}]}]}]}]},{"poster":"Player A","date":"2016-08-20T20:05:52.126+0000","up_votes":1,"down_votes":0,"body":"per la verità, prima di una patch che non ricordo di qualche mese fa era forte contro alcuni champ in early ma anche con qualch triplekill e doublekill superfedato non fai quasi nulla in teamfightperché con un pochino di cc ti sciolgono, non puoi nemmeno aspettare che loro consumino tutti i cc perché con 5 personaggi avversari appena uno esaurisce un cc l'altro lo tiene per te.","replies":[{"poster":"Darkinknight","date":"2016-08-21T09:41:15.613+0000","up_votes":1,"down_votes":0,"body":"Ma anche ora..parlando di lane phase sono alcuni campioni lo mettono in seria difficolta (jax,renekton e wukong dopo il 6 precisamente)..con gli altri li puo battere tutti anche ora\nIl suo problema principale è che per essere utile deve vincere per forza la lane,se la perdi è inutile..se si feedacomunque non è nulla di che...in tf non porta una gran utilita,per pushare è buono ma nulla di che,come tank non rende,il danno è buono ma nulla di che.. ad esempio l'ho usato molto perche mi piace il champ,ma oggettivamente non ha senso usare lui al posto di chiunque altro se non for fun","replies":[]}]}]},{"poster":"CicciaBauBau","date":"2016-08-20T19:35:07.361+0000","up_votes":1,"down_votes":0,"body":"Boh, ieri me l'hanno dato in nemesis draft e facicio i buchi in testa alla gente ogni volta che lo uso, poi non so","replies":[{"poster":"Sexy Win","date":"2016-08-20T19:43:34.479+0000","up_votes":1,"down_votes":0,"body":"In nemesis draft pff","replies":[]}]},{"poster":"DuckQuack0","date":"2016-08-20T19:05:41.125+0000","up_votes":1,"down_votes":0,"body":"Ci sarà un rework l'anno prossimo, Aatrox è probabilmente il campione più inutile del gioco, non penso interessi minimamente attualmente alla Riot di Aatrox\nIl suo rework sarà collegato al rework dei combattenti/divers la prossima stagione, penso verso marzo","replies":[]},{"poster":"SickAnto","date":"2016-08-20T19:05:37.099+0000","up_votes":1,"down_votes":0,"body":"Penso che non ci sarà alcun buff per Aatrox finché non ci sarà l'Update per i Divers, che ancora non si sa quando lo faranno, ma credo che sarà la classe dopo quella degli Assassini, comunque sono solo mie supposizioni.","replies":[]},{"poster":"ILoveTiramisu","date":"2016-08-20T18:53:18.852+0000","up_votes":1,"down_votes":0,"body":"Penso che vada giocato col critico. Io ho provato a buildare critico e non mi fermava nessuno, poi non so.","replies":[]},{"poster":"BrioStorm","date":"2016-08-20T18:52:49.730+0000","up_votes":1,"down_votes":0,"body":"Nessuno sa niente, sicuramente per ora non c'è previsto il rework di aatrox ma potrebbe esserci un buff.","replies":[]}]}