{"poster":"MrAres","date":"2017-08-05T22:49:41.635+0000","title":"Por que la gente odia tanto los asesinos?","subforum":"Charlas Generales","up_votes":3,"down_votes":1,"body":"A lo que me refiero es, un tanke tiene un da&ntilde;o muy alto y aguanta un monton (vease {{champion:36}} {{champion:31}} {{champion:2}} {{champion:14}} ) y nadie dice nada, AHHH pero un asesino cumple su funcion que es hacer una gran cantidad de da&ntilde;o,  todos lloran, lo nerfean y nerfean los items de letalidad (exceptuemos a {{champion:157}} porque ya dijeron que le van a hacer un rework aunque no sabe que hacerle).\nLo que quiero decir es, no tendria que ser como en otro juegos que los tankes aporten cc y digamos carne de ca&ntilde;on, y los asesinos y adc aporten el da&ntilde;o?  Si, esto parece un Cry-post, pero el problema es que el meta que mas estuvo prevaleciendo estos ultimos a&ntilde;os es el de tankes, desde el rework de colosos si no me equivoco, me encantaria escuchar sus opiniones al respecto.","replies":[{"poster":"El Impostor","date":"2017-08-05T23:24:07.796+0000","up_votes":3,"down_votes":0,"body":"De esos que usaste de ejemplo, solo Sion está clasificado como tanque y solo te pega si eres lo suficientemente idiota como para comerte su Q (Su R es discutible), (Cho es un intermedio entre vanguardia y coloso).\nLos otros son colosos, o sea, solo te van a hacer daño considerable si se te ocurre ponerte en su rango (El quiteo entra en juego aca).\n\nY en el caso de los asesinos, es su trabajo acabar rápido con el carry enemigo, aquí es donde entra en juego tu support (o jungla) si es un champ de peel ({{champion:40}} {{champion:37}} {{champion:43}} etc)","replies":[{"poster":"MrAres","date":"2017-08-06T00:14:21.028+0000","up_votes":1,"down_votes":1,"body":"A lo que yo me refiero es que, no tiene sentido pickear un asesino que va a entrar, deletear al carry y morir, o salir a poca hp, si puedes pickearte , a {{champion:36}} o algun otro, armarte full tanke, entrar matar al carry y quedarte haciendo daño, y en cuanto al peel, un buen supp te puede proteger tanto del tanke como del asesino, asi que en ese caso no hay mucha diferencia","replies":[{"poster":"El Impostor","date":"2017-08-06T02:30:25.582+0000","up_votes":2,"down_votes":0,"body":"o quitearlo y no dejar que te pegue\no que tus tanques o compas con cc lo retrasen","replies":[]}]}]},{"poster":"Hell Darking","date":"2017-08-05T23:02:16.321+0000","up_votes":1,"down_votes":4,"body":"A los asesinos no le puedes hacer counter play, se buildean y ya puedes pensar en hacerte una casita en base porque no saldras de ahi nunca mas\n#ADCsIn2017","replies":[{"poster":"Ahristócrata","date":"2017-08-05T23:07:16.203+0000","up_votes":4,"down_votes":0,"body":"Será porque en un 1 v 1 debería ganar el asesino contra el carry? Es lo natural, es un juego en equipo, y quién debería estar para salvarte del asesino es el soporte. El AdCarry no está diseñado para ganar duelos (salvó Vayne que tiene sus debilidades claras en el juego temprano), si no para ser la mayor fuente de daño físico continuo del equipo.","replies":[]},{"poster":"Hell Darking","date":"2017-08-05T23:02:59.590+0000","up_votes":1,"down_votes":2,"body":"PD: Como riot no arregle eso de que los \"tankes\" hagan daño en base a su vida o armadura, la meta de tankes no terminara nunca","replies":[{"poster":"MrAres","date":"2017-08-06T00:05:46.651+0000","up_votes":1,"down_votes":1,"body":"Oh sera que hay muchos items que son \"Ofensivo defensivos\"? no se, por ejemplo {{item:3748}} {{item:3071}} {{item:3053}} {{item:3026}} ?","replies":[]}]}]},{"poster":"Satori Komeiji","date":"2017-08-05T23:25:48.565+0000","up_votes":2,"down_votes":0,"body":"Porque piensan en que van a morir si o si contra un asesino, cuando en realidad hoy en dia hay muchas formas de evitarlo\nel peel que pueden hacer los supports + sus items, GA, Zhonya's y otras cosillas\nmas tambien porque el rework a los asesinos cambio la forma en que estos hacen su daño y el counterplay","replies":[]},{"poster":"Demonish","date":"2017-08-06T18:46:05.608+0000","up_votes":2,"down_votes":1,"body":"Es mi indignación constante en este juego. Cómo puede ser que, por ejemplo, un Malphite FULL tanque te reviente? Se supone que tiene que aguantar, no hacer daño también. Si quiere reventarte con la ulti, puede. Si lo emboscas y quiere escaparse con la ulti, puede. Este tipo de campeones tienen demasiadas fortalezas y pocas debilidades.","replies":[]},{"poster":"Sir Crucifix ll","date":"2017-08-07T00:24:54.743+0000","up_votes":1,"down_votes":0,"body":"a mi me encanta yasuo , los que se quejan son los adcs , pero si te pones a ver sus items son puro daño ,critico y velocidad de ataque .. al final sacan un GA para defensa pero nada mas , la mentalidad de un main adc es reventar a todos de 1 o 2 hits pero lloran cuando los matan de 1 o 2 hits y culpan al support","replies":[]},{"poster":"WhiteMax","date":"2017-08-05T23:04:51.263+0000","up_votes":1,"down_votes":2,"body":"> un tanke tiene un daño muy alto y aguanta un monton y nadie dice nada\n\nAmm a principios de este año (no me acuerdo si del año pasado tambien) hubo un spam constante de posts diciendo basicamente \"los tanques pegan mas que el adc\" y hoy en dia algunos siguen pensando asi pero la mayoria ya acepto que si juegas cuerpo a cuerpo contra un tanque obviamente vas a morir, la idea es desgastarlo.\n\n> Por que la gente odia tanto los asesinos?\n\nCon respecto a los asesinos, nada, es la tipica gente que como no sabe jugar vienen a pedir nerf, cuando el trabajo de los asesinos es eso, tirar el burst y sacar kill, no quieren morir? tienen {{summoner:21}} {{summoner:7}} {{summoner:4}} {{summoner:1}} {{item:3026}} .","replies":[]}]}