{"poster":"Valanyr","date":"2015-01-08T15:30:17.587+0000","title":"Account Ban","up_votes":1,"down_votes":0,"body":"Sziasztok!\r\nAz a problémám az accountomal hogy egyszerűen nem enged fel azt írja ki hogy perma bant kaptam,de az útán mikor meg vettem az winter wonder orianna skint semmi mást nem csináltam,azt szeretém tudni hogy mik ilyenkor a teendők? (2 gamet nyomtam vele,másnap már kaptam is ezt a perma bant)\r\nKöszönöm előre a segítséget","replies":[{"poster":"Valanyr","date":"2015-01-08T15:30:44.772+0000","title":null,"up_votes":1,"down_votes":0,"body":"segítsetek légy szíves!!!!!!!","replies":[{"poster":"Valanyr","date":"2015-01-10T00:20:54.401+0000","title":null,"up_votes":1,"down_votes":0,"body":"Köszönöm a segítséget ispz nagyon rendes vagy,már meg oldódott azt küldték hogy kártya viszaélés lényegtelen 1600 forintba fog fájni.A többieknek meg anyit üzenek hogy soha nem raigeltem és nem leaveltem chat banot kaptam mert köszöntem meg meg kérdeztem hogy mit csinált és chat banott kaptam a leg további tilásom az maxx 1 hét volt 2-3 éve ezelőtt mert mennem kellet el itthonról.Amúgy meg segítséget kértem nem kritizálást,SEGÍTSÉGET de létszik hogy itt panaszkodsz nem is ismert azt itélkezel látszik hogy olyan maxx 10-12 éves lehetsz.mindegy akki tényleg segített annak köszönöm a többinek meg üzenem hogy olvasátok el a dolgokat és utána írjatok számoljatok magatokba 10 másdopercig. XD","replies":[]}]},{"poster":"PandaCukorPL","date":"2015-01-08T16:36:36.436+0000","title":null,"up_votes":1,"down_votes":3,"body":"Élő példa. És még mindenki mondja hogy \"A riot lesz*rja a reportot nem is érdekli azt hogy mennyi report érkezik semmit se tesznek\" és ezért a sok kis 9 éves azt hiszi hogy azt csinálhat amit akar. Bárcsak minden nagyképű feeder pondró ilyen sorsra jutna ahelyett hogy szándékosan keserítik meg mások életét és játékát... plusz még élvezik is a legtöbben","replies":[{"poster":"VampVik","date":"2015-01-08T23:10:30.193+0000","title":null,"up_votes":2,"down_votes":0,"body":"Ugye tisztában vagy vele, hogy ha \"nagyképű feeder pondró\" -nak nevezel másokat azzal bőségesen kimeríted a sértegetés, mint jelentési lehetőség fogalmát.\nTalán ha te is kissé kulturáltabban formálnál vélemény kevesebb flamer lenne. Legalábbis 1-el biztosan.","replies":[{"poster":"PandaCukorPL","date":"2015-01-09T15:44:01.028+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ez igaz, viszont amikor én elkezdtem a játékot és elértem a 30-as szintet még nem rageltem soha játékosokat. És ha mondjuk valaki rossz akkor semmi indokom nincs rá. Viszont aki ***** anyázik, meg rákosozik, csöves, drogos stb cuccokat mondanak és EMELLÉ még van képe pl full ap yasuot építeni rankeden és tower alá bemenni 20x csak mert nem mehetett Karma junglet akkor legalább ő is érezze a törődést :)","replies":[{"poster":"VampVik","date":"2015-01-09T17:46:01.619+0000","title":null,"up_votes":1,"down_votes":0,"body":"Félre értés ne essék. Én is örülnék ha az ilyen játékosok eltűnnének. Akár úgy ha bannolják őket, akár úgy ha ráébresztik, hogy nem így kéne viselkedni és \"megjavulnak\"; most viszont csak arra akarok rámutatni, hogy az ellenük való küzdelem eszköze nem lehet a negativitás, mert azt csak téged is átállít a sötét oldalra.","replies":[]}]}]}]},{"poster":"iSPZ","date":"2015-01-08T16:28:59.050+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hát ezzel kapcsolatban itt nem tudunk segíteni. A perma ban végleges, tudomásom szerint nem oldják fel. Valószínűleg sok tiltásban részesültél, napokra tiltották a fiókot a sok kilépés vagy a negatív viselkedés miatt, esetleg valami illegális \"segítséget\" használtál a játékhoz (például srcipt). Pontosabb információt a [játékostámogatás](https://support.riotgames.com/hc/hu/requests/new) fog tudni mondani, de feloldani nem fogják (ha csak nem tévedésből lett tiltva, de ennek az esélye nagyjából egyenlő a nullával).","replies":[]}]}