{"poster":"Dannÿ","date":"2016-11-03T12:11:21.675+0000","title":"Doom for all","subforum":"Karten & Spielmodi","up_votes":17,"down_votes":0,"body":"Da der modus &quot;Doombots&quot; bald enden wird habe ich mir gedacht dass &quot;Doom for all&quot; eine lustige Idee w&auml;re.\n\nIm Prinzip w&uuml;rde das ganze so aussehen das die so genannten Doom-f&auml;higkeiten f&uuml;r die spieler w&auml;ren und beide seiten diese Doom-F&auml;higkeiten haben. **(KEIN PVE SONDERN PVP)\n**Ziel ist es nat&uuml;rlich den gegnerischen nexus zu zerst&ouml;ren.\n\neine gute Idee w&auml;re denke ich auch das man punkte sammeln kann um diesen riesen Teemo zu beschw&ouml;ren **[Bitte siehe weiter unten]** (weitere Ideen?  bitte in die Kommentare!)\n\nwobei ich den namen &quot;Doom for all&quot; irgendwie irref&uuml;hrend finde wegen &quot;One for all&quot; (Ideen in die Kommentare)\n---\nunteranderem dachte ich auch über eine alternative map für diesen Modus nach und fand diesen post über die [MagmaKammer](http://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/RHXuqyEf-wiederaufgreifen-der-magmakammer-idee)\n\n\n\n>_**genaueres**_\n> \nin zusamenarbeit mit **Mescryze** (EUW) kamen wir auf folgende Idee/n\n\n>Für die Teemo Beschwörung/Transformation werden punkte benötigt und das Team welches als erstes _50_ Punkte erreicht Beschwört/Trasnformiert Devil Teemo\nJeder Sammelt punkte für sein Team\n\n>Ihr erhaltet Punkte für...\nKill:       _4_ Punkte\nAssist: _2_ Punkte\nFarm (_20_ minions= _1_ Punkt\nIhr verliert Punkte für...\nTod: -_50_ % --  _10_ % (je nach dauer des spiels)\n\n>Alle Sammeln und verlieren Punkte aus dem gleichen \"Topf\" wodurch man gezwungen ist als Team zu agieren um möglichst viele Punkte zu sammeln\n---\n**_Alle angegebenen Zahlen sind fiktiv und brauchen möglicherweise eine Anpassung_**\n\n\n\nWir sind für Ideen und Anregungen offen und hoffen auf eure zusammen Arbeit :)\n\n*Weitere Ideen* 04.11.16\n\nDie gesammelten punkte werden in der mitte der Magmakammer abgegeben (das wird dann so ähnlich aussehen wie das einnehmen eines turmes im Dominion).\nAm oberen Bildschirm rand sind dann 2 uns bekannte balken (Dominion) die diesmal allerdings gefüllt werden, das Team dem es als erstes gelingt ihn zu füllen erhält  einen DevilTeemo, es wird so sein wie im Poro-King dass das andere Team seine punkte behält und nach der \"vernichtung\" des gegnerischen Teemos haben sie die Möglichkeit ihren balken zu ende zu füllen.\n---\nwenn ihr den letzten teil kommentieren wollt wäre es gut den kommentar mit \"kommentar zum (oben genanntes Datum)\" schreiben würdet, ich beabsichtige auf jeden einzugehen und die mode Idee anzupassen und zu vollenden (mit dem kleinen Hoffnungsschimmer das er es ins spiel schafft)\n---\ndanke das du bis zum ende gelesen hast, wenn dir die Idee gefällt leite sie bitte weiter an alle die auch an neuen modes interessiert sind :) ","replies":[{"poster":"CustomKunibert","date":"2016-11-03T12:20:04.020+0000","up_votes":2,"down_votes":0,"body":"Hey,\n\nich finde die Idee cool, aber wahrscheinlich wird es am Anfang ähnlich unbalanced sein wie das erste URF. Das ist erstmal kein Problem, da es ein Fun-Modus ist - wird aber zu einem, wenn der Modus schon einige Tage oder Male draußen war. Dann müsste man viel rumschrauben. Die ersten Tage, in denen extrem viel herumexperimentiert wird, würden bestimmt ziemlich genial werden ^^\n\nZum Thema Teemo-Beschwören: Ich musste da an Poro-King denken, wo man diesen ja auch durch das Treffen von Poros bekommt. Eventuell kann man das hier ähnlich machen... ooooooder man muss eine bestimmte Anzahl an Kills in einer bestimmten Zeit erreichen (als Team natürlich). Das ganze decayed natürlich, sodass es im Earlygame kaum möglich sein wird, dieses Vieh zu beschwören, später nach einem gewonnenen Teamfight allerdings fast schon zusammen ist. Dadurch würde das spiel nicht so lange dauern und die Leute, die einen Teamfight gewinnen, können sich danach auch bequem den Sieg TROTZ der kleinen Respawntimer gönnen.\nWas hälst du von dieser Lösung zum Beschwören des Teemos?","replies":[{"poster":"Dannÿ","date":"2016-11-03T12:42:59.543+0000","up_votes":1,"down_votes":0,"body":"Super idee :D  ich denke man könnte das so machen das man für einen kill 2-4 punkte fürs team sammelt und für eine assist 1-2 damit wird untermalt das es ein team spiel bleibt und es nicht reicht wenn ein champ zu stark ist, denmach verliert man am Anfang des games für einen tod noch ca 50% der gesammelten punkte und später sinken die prozente \n\nvieleicht gibt es auch am anfang einfach nur einen ganz normalen teemo bot für beide teams und man macht ihn mit diesen punkten stärker und welches team ihn als erstes transformiert pusht aufs  übelste die midlane rein (und es kann nur einer \"transformiert\" sein \n\nund es muss ja auch keine teemo bot sein ;)  (es kann auch abgestimmt werden was für ein bot es sein wird :D) der spawnt dann minute 10 oderso ^^","replies":[{"poster":"CustomKunibert","date":"2016-11-03T12:47:47.155+0000","up_votes":2,"down_votes":0,"body":"Doch es muss ein Teemo sein! Sonst wäre es ja überhaupt kein Doombot mehr ;)\nUnd dieser muss auch kein direkter Bot sein, sondern könnte alle 2 Minuten als eine Art NPC in der Mitte mit den Minions spawnen. Und je mehr Punkte man hat, desto größer + furchteinflößender wird das Vieh und bekommt bessere Stats. Und wird irgendwann zum Giant-Teemo-Tilterino... Stimmts? ^^","replies":[{"poster":"Dannÿ","date":"2016-11-03T16:53:12.761+0000","up_votes":1,"down_votes":0,"body":"nebenbei \"Doombots\" gab es früher ohne Teemo ;) und es war trotzdem geil! :D{{champion:103}}","replies":[{"poster":"CustomKunibert","date":"2016-11-04T08:25:30.237+0000","up_votes":2,"down_votes":0,"body":"Ja, hab ich auch gespielt ^^\nAber ich finde die Änderung mit dem Doom-Teemo sehr cool. Deswegen würde ich es auch hier \"bereichernd\" finden","replies":[{"poster":"Dannÿ","date":"2016-11-04T23:16:29.324+0000","up_votes":1,"down_votes":0,"body":"Ok, das kann ich nicht leugnen ;)","replies":[]}]}]}]}]}]},{"poster":"Provocátion","date":"2016-11-03T19:36:24.610+0000","up_votes":2,"down_votes":0,"body":"Find ich cool.\n{{champion:67}}","replies":[]},{"poster":"Alustus","date":"2016-11-03T12:28:24.664+0000","up_votes":1,"down_votes":2,"body":"Wäre nicht so toll, da die Bots einem Normalen Spieler normalerweise sehr stark unterlegen ist.\n\nSprich das ganze wäre dann zu einfach, wenn ich bedenke das man Spiele gegen normale Bots 1 vs 5 relativ leicht gewinnt.\nDie Bots brauchen einfach den vorsprung durch die Skills um eine gefahr darzustellen.","replies":[{"poster":"Dannÿ","date":"2016-11-03T12:30:08.221+0000","up_votes":1,"down_votes":0,"body":"Es ist so gedacht das du nicht gegen bots spielst sondern gegen andere Spieler ;)","replies":[{"poster":"Alustus","date":"2016-11-03T12:48:51.577+0000","up_votes":1,"down_votes":2,"body":"Oh das ist natürlich etwas anderes.\n\nHabe wohl zu oft Doombots gelesen ;)\n\n\nHätte nicht gegen so einen Modus :D .","replies":[]}]}]}]}