{"poster":"FakerDeCatamarca","date":"2018-12-13T16:21:11.538+0000","title":"Alguien me da consejos para ir al gimnasio?","subforum":"Off-topic y temas personales","embed":{"description":"Post with 0 views.","url":"https://imgur.com/a/T8iEWoT","image":"https://i.imgur.com/8L4rpWv.jpg?fb"},"up_votes":3,"down_votes":8,"body":"Eso gente voy a empezar a ir al Gimnasio por que ami si me importa mi imagen y no como ustedes que viven jugando a lol todo el dia. un cordial saludo.","replies":[{"poster":"WhiteMax","date":"2018-12-13T16:24:13.088+0000","up_votes":7,"down_votes":2,"body":"Mira que el Gym es para el cuerpo, la cara la vas a seguir teniendo igual.{{sticker:sg-miss-fortune}}\n\n> viven jugando a lol todo el dia.\n\nNivel 186.","replies":[{"poster":"FakerDeCatamarca","date":"2018-12-13T16:26:33.787+0000","up_votes":2,"down_votes":1,"body":"https://imgur.com/a/ajfcj10","replies":[]}]},{"poster":"Mioen","date":"2018-12-13T16:25:21.040+0000","up_votes":4,"down_votes":0,"body":"Ir al medico de confianza antes de asistir al Gym, es muy importante hacerte controles de salud antes de empezar para que te puedan recomendar que trabajos puede hacer y cuales no.\n\nTambien puedes ir consultar con un nutricionista, desde horarios para comer según tu rutina o dietas especificas para ciertos ejercicios.\n\nSiempre consultar con el encargado del piso en el Gym si sos nuevo.\n\nVariar entre distintas maquinas o rutinas.","replies":[{"poster":"FakerDeCatamarca","date":"2018-12-13T16:28:11.834+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias amigo por el consejo. te deseo un bonito dia y una prospera navidad. {{champion:17}}","replies":[{"poster":"Mioen","date":"2018-12-13T16:37:40.406+0000","up_votes":1,"down_votes":0,"body":"Ningún problema.\n\nAcordate que si tenes alguna duda, preguntale al encargado del piso o del salon del Gym para que te guie y te pueda enseñar el funcionamiento de las maquinas.\nEn los Gym, suelen ir personas que se enojan cuando usan mal las maquinas. Ya que el que la persona que la este usando, puede dañar el equipo o lastimarse a ellos mismos, trata de tener cuidado cuando comiences.\n\nY otra recomiendación, fijate si en el Gym hablan bastante o no hablan, si hablan genial. Puede ser un Gym bastante social, pero si no hay mucha charla entre ellos, pasa de iniciar un conversación a menos de que ellos la entablen.","replies":[]}]}]},{"poster":"Magodrogbi","date":"2018-12-13T16:33:52.306+0000","up_votes":3,"down_votes":0,"body":"Soy el unico que reconoce al dios3p?{{champion:79}}","replies":[{"poster":"Salvor","date":"2018-12-13T16:36:44.740+0000","up_votes":1,"down_votes":1,"body":"Ayer mi vi un vídeo del tipo y no le encontré la gracia ni el sentido. u.u","replies":[{"poster":"FakerDeCatamarca","date":"2018-12-13T16:39:17.816+0000","up_votes":1,"down_votes":0,"body":"https://imgur.com/a/lwDdNyk\n\nTenes algun problema con el facha3p?","replies":[{"poster":"Salvor","date":"2018-12-13T16:42:09.172+0000","up_votes":1,"down_votes":1,"body":"No, solo que no entendí bien de que va.","replies":[{"poster":"FakerDeCatamarca","date":"2018-12-13T16:43:51.881+0000","up_votes":1,"down_votes":0,"body":"Disculpa pero july3p hace contenido de calidad que los normie no entienden. un cordial saludo","replies":[{"poster":"Salvor","date":"2018-12-13T16:45:05.377+0000","up_votes":1,"down_votes":1,"body":"Que paja, tenia ganas de entender dicho contenido.\nUn saludo mas cordial todavía.","replies":[]}]}]}]}]}]},{"poster":"EpicHit","date":"2018-12-13T16:29:35.233+0000","up_votes":1,"down_votes":4,"body":"Si te importa tu imagen labura y arreglate la cara porque sos mas feo que patada en los huevos","replies":[{"poster":"FakerDeCatamarca","date":"2018-12-13T16:34:34.862+0000","up_votes":3,"down_votes":0,"body":"https://imgur.com/a/hE6cJwb","replies":[]}]},{"poster":"Chockad","date":"2018-12-13T22:46:43.307+0000","up_votes":1,"down_votes":0,"body":"No pagues un GYM,mejor ayuda todos los días a tu vieja con las compras del chino (Compren cosas pesadas) y te ofreces para llevar todas las bolsas.\nUn saludo {{champion:80}}","replies":[]},{"poster":"Tomasnnz","date":"2018-12-13T22:39:55.511+0000","up_votes":1,"down_votes":0,"body":"Lo mejor es el poster de bakugan en el fondo","replies":[]},{"poster":"Marco","date":"2018-12-13T18:32:48.024+0000","up_votes":1,"down_votes":0,"body":"Puedes tener buen físico y jugar lol igual.","replies":[]},{"poster":"LaReinaPingüino","date":"2018-12-13T17:37:38.204+0000","up_votes":1,"down_votes":0,"body":"Si sabes inglés te recomiebdo el canal de youtube  picturefit que habla de fitness y de gimnasios y de como ganar masa muscular","replies":[]},{"poster":"Jinx KDA","date":"2018-12-13T17:18:14.747+0000","up_votes":1,"down_votes":0,"body":"hongo3p es un pepepedofilo que ya no tiene canal de iutube","replies":[]},{"poster":"POD2 Midnight","date":"2018-12-13T16:36:39.045+0000","up_votes":1,"down_votes":1,"body":"Pues asístete con profesionales de la salud (nutricionistas, kinesiólogo, cardiólogo de ser necesario), sigue sus indicaciones, encuentra tu zona de comodidad (nadie inicia haciendo 500 repeticiones de nada, solo piensa que es mejor poco que nada), no pierdas el hacer ejercicio constantemente (me ha pasado, es complicado retomar pero se puede) y si puedes complementa el gimnasio con algún deporte, porque al tener una recompensa visible te vas a motivar aún más (por ejemplo con el fútbol, te vas a motivar más a ir al gimnasio si te das cuenta que pateas más fuerte el balón, tienes más control del mismo, posees mayor tasa de posesión del balón, etc).\n\nEso más que nada, saludos ;)\n\nEdit: Si puedes encontrarte un amigo o algún otro interesado para que vayan juntos mucho mejor. La automotivación es genial, pero de esta manera se genera el incentivo de sana competencia que te da el deporte, en el gimnasio. La sana competencia hace cosas muy curiosas.","replies":[]}]}