{"poster":"RayThunder21","date":"2015-06-12T20:55:55.735+0000","title":"Me considero el \"Jugador más novato de la historia del LOL\"","subforum":"Nuevos jugadores","up_votes":6,"down_votes":1,"body":"Hola, primero antes de empezar. Pongo esto en Nuevos Jugadores, ya que es como empezar de nuevo seg&uacute;n yo. Soy un invocador de nivel 12, con {{champion:11}} nivel 5, tambi&eacute;n he jugado con {{champion:58}} , y raramente con {{champion:86}} . Vengo para recibir respuestas muy amplias y consejos.\r\n\r\nSin m&aacute;s empecemos:\r\nLes contar&eacute; mi historia y luego mis preguntas y dudas.\r\nHe empezado a jugar hace casi 1 mes, el 18/05 para ser exactos. Se termina de descargar el juego, yo con una emoci&oacute;n por jugar y hacer los tutoriales. Tutorial con {{champion:22}} sobre lo b&aacute;sico, todo bien para m&iacute;. Luego de completarlo, empiezo cooperativo con {{champion:58}} que estaba en la rotaci&oacute;n semanal, me gust&oacute; bastante este campe&oacute;n y segu&iacute; practicando con este. Obviamente ganaba en cooperativo. As&iacute; que cre&iacute; que estaba bien como para empezar a jugar Normal (A ciegas). Perd&iacute; pero me gust&oacute; igual la partida. El 21/05 gano mi primera partida en Normal con un 15/2/11, lo que me pone muy feliz y me anima a seguir, pensando en que estoy mejorando. Un d&iacute;a jugando con {{champion:58}} , descubr&iacute; a {{champion:11}} . Este era mi rival, y me destrozaba bastante, por lo que pens&eacute; que era un buen campe&oacute;n y lo compr&eacute;. Antes de esto jugu&eacute; con {{champion:107}} , ya que uno de mis amigos lo usaba y era muy bueno. Me gust&oacute; pero era dif&iacute;cil manejarlo as&iacute; que lo dej&eacute;. As&iacute; que empec&eacute; a practicar con {{champion:11}}  y me gust&oacute; la forma de jugar con &eacute;l. Primera partida Normal con {{champion:11}} el 24/05 y no me fue bastante bien. El 25/05 obtuve mi primera victoria con {{champion:11}} lo cual vi mejora en m&iacute;, o eso pensaba. Sigo jugando para mejorar con {{champion:11}} , por ah&iacute; ganaba por ah&iacute; no, pero no me importaba por el momento. He probado {{champion:43}} {{champion:114}} {{champion:86}} {{champion:10}} aunque a m&iacute; me segu&iacute;a gustando jugar con {{champion:11}} . El 31/05 tengo mi primera partida con {{champion:11}} en jungla, sin saber la build para jugar en este. Una victoria, aunque mi build fue horrible, ganamos gracias a mi team. El 04/06 compr&eacute; a {{champion:58}} que lo hab&iacute;a usado anteriormente y me hab&iacute;a gustado jugar con &eacute;l. Algunas noches jugaba con un amigo y me dec&iacute;a que jugaba horrible pero que ya mejorar&iacute;a, aunque creo que era mentira. Solo una vez logr&eacute; ganar con &eacute;l pero las otras perd&iacute;amos. Yo en cada partida que ganaba me daba &aacute;nimos para seguir jugando, pensando en que estoy mejorando. Hasta hoy, que mirando mi manera de jugar veo que soy un desastre total en comparaci&oacute;n de los dem&aacute;s (mi team), e intentado jugar 2 partidas hoy, en jungla y fueron horribles, y mi equipo me echaba toda la culpa. Por lo que al verme jugar as&iacute; he venido a buscar respuestas y consejos. He visto 2 o 3 gu&iacute;as pero tampoco mejoro con esto. La build com&uacute;n que uso con {{champion:11}} es {{item:1055}} {{item:3153}} {{item:3142}} {{item:3087}} {{item:3031}} {{item:3026}} as&iacute; en orden. Hechizos: {{summoner:4}} {{summoner:11}} en jungla y {{summoner:4}} {{summoner:14}} en top, raramente juego en mid en caso de perder top o jungla y con {{champion:11}} . La verdad es que le doy poca importancia la build, siempre intento ir a atacar y nunca me fijo la build del rival. Al jugar en jungla nunca se a donde ir, siempre veo a los otros con vida llena, y cuando voy para un lado, !pum! el que est&aacute; al oooootro lado tiene menos de la mitad de vida, voy all&aacute; y muere el aliado por no llegar a ayudar. Al jugar en top siempre estoy en mi l&iacute;nea, nunca voy a ayudar a los dem&aacute;s y creo que deber&iacute;a hacerlo.\r\n\r\nPor lo que ahora con estos problemas me veo como \"El jugador m&aacute;s novato de la historia\", estoy a nivel 12 y no mejoro nada. Seg&uacute;n entend&iacute;, al subir de nivel, la dificultad es mayor, que te ponen con otros jugadores m&aacute;s dif&iacute;ciles de ganar o algo as&iacute;. Por lo que antes de seguir jugando y subir de nivel quisiera tener ayuda para mejorar y no llegar a nivel 30 y ser como un jugador de nivel 4.\r\n\r\nPor lo que mis preguntas son estas:\r\n* A m&iacute; me gustan los campeones con gran cantidad de da&ntilde;o, como {{champion:11}} , pero este no dura nada o yo no s&eacute; usarlo bien, por lo que quisiera que me recomendaran cual elegir. Tengo 2964 de PI para gastar.&iquest;Qu&eacute; campe&oacute;n me recomiendan?\r\n\r\n* El tema de las runas lo dejo muy de lado (reci&eacute;n me acorde de este), por lo que quisiera saber &iquest;C&oacute;mo saber (no, no me confund&iacute;) que runas usar para determinados campeones? Seg&uacute;n le&iacute; {{champion:11}} necesita runas de velocidad de ataque, armadura y velocidad de movimiento.\r\n\r\n* &iquest;Qu&eacute; tengo que tener en cuenta al jugar una partida Normal? Es decir mi build, la build del rival, cuando atacar y cuando no, etc.\r\n\r\n* &iquest;C&oacute;mo me recomiendan practicar con un campe&oacute;n nuevo para m&iacute;?\r\n\r\n* Mucha veces peleo con un rival pero lo que pasa es que se me escapan justo con al menos 20 HP o no se. Tambi&eacute;n creo que no se hacer muy buenos combos.\r\n\r\n* Si hay alguna gu&iacute;a que les ayud&oacute;, tambi&eacute;n me gustar&iacute;a ver.\r\n\r\nTambi&eacute;n otra de las dudas que tengo es sobre el VOCABULARIO DEL LOL. Por los foros y el chat del juego he visto expresiones como IZI, PREMADE, FEDEAR, CAMPE&Oacute;N FEDEADO, BLUE, RED (No s&eacute; si lo mencion&eacute; antes), PUSHEAR, entre otros. Quisieran que me den todas las expresiones que sepan para ya tener entendido, pero varias veces me pasa que me las olvido, me se hace dif&iacute;cil recordarlas.\r\n\r\n*** Si a alguno quiere ayudarme en el propio juego, me quiere agregar como amigo y tal, yo acepto su ayuda. No es obligatorio, solo si quieren.**\r\n\r\nCreo que esto es &uacute;til para otros Nuevos Jugadores que puedan estar en mi situaci&oacute;n, por lo que esto si es respondido les podr&aacute; servir\r\n\r\nPor ahora hasta aqu&iacute; son mis preguntas, si hay alguna que otra la agregar&eacute;.\r\n\r\nEspero respuestas extensas,amplias y entendibles para todo lo que escrib&iacute;. Acepto opiniones, respuestas, consejos pero de buena manera, a nadie le agrada que le est&eacute;n insultando ;)\r\n\r\nHasta aqu&iacute; me despido. RAYTHUNDER21 ;)","replies":[{"poster":"TeCagoMatando1","date":"2015-06-13T04:49:34.196+0000","up_votes":3,"down_votes":0,"body":"Todos fuimos malos alguna ves, vos intenta divertirte y mejorar, no te dejes influenciar por flamers si alguien te molesta silencialo y reportalo al final.\nno vas a ser mejor de un dia para el otro con consejos, pero ya vas a ir tomandole la mano al juego :D","replies":[{"poster":"Cipher","date":"2015-06-13T04:58:27.584+0000","up_votes":4,"down_votes":0,"body":"La manera de jugar al LoL es con el comando \"/mute all\".","replies":[{"poster":"RayThunder21","date":"2015-06-13T05:49:51.976+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cipher,realm=LAS,application-id=njUm58At,discussion-id=o1MVIf0B,comment-id=00080000,timestamp=2015-06-13T04:58:27.584+0000)\n>\n> La manera de jugar al LoL es con el comando \"/mute all\".\n\nLa razón de no hacerlo para mí es simple: si necesitan ayuda ir a ayudarlo, aunque sea un pesado XD Gracias igualmente.","replies":[]}]},{"poster":"RayThunder21","date":"2015-06-13T05:47:49.501+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TeCagoMatando1,realm=LAS,application-id=njUm58At,discussion-id=o1MVIf0B,comment-id=0008,timestamp=2015-06-13T04:49:34.196+0000)\n>\n> Todos fuimos malos alguna ves, vos intenta divertirte y mejorar, no te dejes influenciar por flamers si alguien te molesta silencialo y reportalo al final.\n> no vas a ser mejor de un dia para el otro con consejos, pero ya vas a ir tomandole la mano al juego :D\n\nGracias, sé que no mejorare de un dia para otro, pero me gustaría ver alguna que otra mejora no? xD bueno, yo solo tengo una razón para no silenciar a alguien molesto, si silencio a ese jugador y quiere ayuda o algo de eso, no podré saberlo. Quiero saber todo lo que pasa, tanto minimapa como chat, aunque es dificil osea dejar de enfocar el combate por el chat o minimapa, solo puedo hacerlo al estar quieto xD Como dije, gracias :D","replies":[]}]},{"poster":"SrElite","date":"2015-06-12T21:11:41.977+0000","up_votes":4,"down_votes":0,"body":">A mí me gustan los campeones con gran cantidad de daño, como  , pero este no dura nada o yo no sé usarlo bien, por lo que quisiera que me recomendaran cual elegir. Tengo 2964 de PI para gastar.¿Qué campeón me recomiendan?\n\nA tu nivel, Yi es bueno, pero si quieres otro campeón con GRAN daño, te recomiendo a \nJax, Trynda, Xin Zhao.\n\n>El tema de las runas lo dejo muy de lado (recién me acorde de este), por lo que quisiera saber ¿Cómo saber (no, no me confundí) que runas usar para determinados campeones? Según leí  necesita runas de velocidad de ataque, armadura y velocidad de movimiento.\n\nEspera a lvl20 cuando tengas desbloqueadas las runas de Grado 3, las de Grado 2 y 1 las vas a terminar odiando xD.\n\n>¿Qué tengo que tener en cuenta al jugar una partida Normal? Es decir mi build, la build del rival, cuando atacar y cuando no, etc.\n\nTu build debe depender del equipo rival, si tu enemigo va muy fedeado, después de 2 o 1 item de daño, objeto defensivo, NUNCA debes hacer una build  que sea lo mismo, por ejemplo, si vas con Yi, y en el equipo enemigo hay un AP (Campeón que pega con daño mágico) te haces una Sorbechizos, etc. Ataca cuando el enemigo haya usado sus habilidades, después de intercambiar daño, farmear con habilidades, etc. NUNCA ataques o empujes la línea (Matar a todos los minions y estar adelantado al río de donde puede venir un enemigo) si no tienes visión (Guardianes y la baratija).\n\n>¿Cómo me recomiendan practicar con un campeón nuevo para mí?\n\nUnos cooperativos vs IA para ver builds y sus habilidades.\n\n>Mucha veces peleo con un rival pero lo que pasa es que se me escapan justo con al menos 20 HP o no se. También creo que no se hacer muy buenos combos.\n\n1, no los persigas bajo torre o por todo el mapa, recuerda, Objetivos y matar minions delante de los asesinatos.\n2, busca la sinergia entre tus habilidades o guárdate unas para los contraataques rivales.\n\n>Si hay alguna guía que les ayudó, también me gustaría ver.\n\nmobafire.com es una página de guías que están en inglés, pero incluso jugadores profesionales hacen sus guías ahí, elige las guías que aparezcan en \"FR\" o que estén preferiblemente arriba de platino.\n\n>También otra de las dudas que tengo es sobre el VOCABULARIO DEL LOL. Por los foros y el chat del juego he visto expresiones como IZI, PREMADE, FEDEAR, CAMPEÓN FEDEADO, BLUE, RED (No sé si lo mencioné antes), PUSHEAR, entre otros. Quisieran que me den todas las expresiones que sepan para ya tener entendido, pero varias veces me pasa que me las olvido, me se hace difícil recordarlas.\n\nhttp://www.taringa.net/comunidades/lolhispano/2486120/Vocabulario-LOL.html.\n\nBueno, esto es todo en lo que te puedo ayudar, solo soy Plata V así que no soy gran cosa! xD.\n\nPD: Un consejo para Yi, recuerda, tu Q te hace invencible, aprovéchalo para esquivar habilidades, la W reduce un 70% DE DAÑO A CON LA HABILIDAD A NIVEL 5! Trata de usarlo cuando te va a dar un ataque de torreta o te están pegando mucho.","replies":[]},{"poster":"Main Lee Cýrus","date":"2015-06-20T01:01:07.601+0000","up_votes":3,"down_votes":0,"body":"RayThunder21 sinceramente no te conviene comprarte champs siempre la prioridad son las runas antes era horrible solo gastaba los IP para los champs y siempre me ganaban ,pq empezaban con una diferencia y esa diferencia son marcadas por las runas te recomiendo hacerte unas AP y unas AD busca guias \n\nSUERTE","replies":[{"poster":"RayThunder21","date":"2015-06-23T03:33:19.676+0000","up_votes":2,"down_votes":0,"body":"Me recomendaron no usar hasta nivel 20, aunque tengo algunas ya que antes no sabía eso :P Igual gracias por tu respuesta :D Todo ayuda :D","replies":[]}]},{"poster":"Codarus","date":"2015-06-13T01:12:24.505+0000","up_votes":3,"down_votes":0,"body":"¿Sabes por qué serás un buen jugador? Por tu autocrítica, sí, te criticaste desde un momento, puedo oler desde aquí tu perseverancia y las ganas de mejorar que tienes. Sigue así,  critícate, ponte metas, mira gameplays de jugadores más experimentados, imítalos, prueba campeones, entiende sus habilidades, lee acerca de ellos, lee los objetos, te aseguro que serás un muy bueno jugador en poco tiempo, respeta a tu equipo, pídeles consejos, no tengas verguenzas. No te quede callado! **Cúlpate por tus errores y no a tus compañeros**, cuando mueras pregúntate ¿Qué hice mal? No le reproches nada a tu equipo, si ves fallas en su juego ayúdales, aconseja tu también","replies":[]},{"poster":"Luthiery","date":"2015-06-21T07:20:21.725+0000","up_votes":2,"down_votes":0,"body":"Creo que nunca había leído algo tan sincero como esto... A pesar de que tambien soy de un lvl bajo y manqueo mucho, puedo ayudarte un poco con el vocabulario de LoL, te agregué, saludos! :3","replies":[{"poster":"RayThunder21","date":"2015-06-23T03:30:10.292+0000","up_votes":1,"down_votes":0,"body":"Ok gracias, perdón, no sabia que eras de aquí y rechaze la solicitud :( después te la mando :D","replies":[]}]},{"poster":"ZorroDorado","date":"2015-06-20T03:54:01.044+0000","up_votes":2,"down_votes":0,"body":"Tranquilo, todos fuimos nuevos en el juego. Recuerdo que a nivel 3 contra bots me metía bajo su torre para atacarlo y la torre obviamente me atacaba mientras que yo pensaba \"Tengo que ser especial o el mejor de la partida porque la torre me pega a mi y no al enemigo\"... Jeje.\n\nDe a poquito vas a ir mejorando, aunque algunos no estén de acuerdo deberías jugar como mínimo 50 partidas cooperativas vs IA para ir adaptándote a como es el juego y demás cosas y luego entrar a jugar normales porque siendo sincero, uno no aprende a jugar bien o probar el máximo potencial de un campeón contra la IA (Inteligencia Artificial). \nHabla con tus compañeros y explícales que aun estas aprendiendo, algunos te van a ayudar y otros no (a quienes se dediquen a insultarte y denigrarte te recomiendo que los silencies haciendo click en el icono de \"viñeta o texto \"no se como describirlo xD que se encuentra a la derecha del nombre del invocador)\n\nDe a poquito vas a ir mejorando, vos solo dale con ganas (y)","replies":[{"poster":"RayThunder21","date":"2015-06-23T03:32:23.753+0000","up_votes":1,"down_votes":0,"body":"Ok gracias, justito ahora una jugué una partida de ADC (porque era Top pero otro me lo quitó asi porque sí :( ) y me ganamos, pero me dijeron que soy malísimo con ASHE :( pos bueno, soy así :( Gracias por tu respuesta :D","replies":[{"poster":"ZorroDorado","date":"2015-06-27T15:54:21.999+0000","up_votes":1,"down_votes":0,"body":"Yo soy malisimo con Tristana pero bueno, siempre que intento mejorar con ella me insultan a mas no poder xD Lo mejor es silenciar a todos y jugar!","replies":[]}]}]},{"poster":"paulo1088","date":"2015-06-15T00:48:08.081+0000","up_votes":2,"down_votes":0,"body":"Oye, si quieres yo te ayudo un poco en el juego, agregame como amigo (ya te envie la solicitud) y te ayudare en lo que mas pueda (in game)\ny te explico el vocabulario del LOL","replies":[{"poster":"RayThunder21","date":"2015-06-15T01:38:01.206+0000","up_votes":1,"down_votes":0,"body":"Ok, ya te agrego ;) Y gracias :D","replies":[]}]},{"poster":"DkA Darkito","date":"2015-06-13T02:06:24.187+0000","up_votes":2,"down_votes":0,"body":"Te dejo una \"Guía rápida\" por aquí, y si tienes más dudas, agregame dentro del juego y no tengas miedo de preguntar, tengo mucha paciencia explicando así que si no entiendes algo a la primera, no dudes en volverme a preguntar y apenas pueda te respondo n.n.\n\nAntes de comenzar, quiero que tengas **muy**, **muy** presente algo: De repente hay enemigos/aliados que son gente que tiene cuentas ya en lvl 30, por lo que son experimentados y obvio te van a ganar fácil, no te desanimes si esto pasa, porque lo he visto, así que no te frustres y sigue con tu juego.\n\nBueno acá vamos: \n  \n*  Yo te recomendaría para empezar campeones que tengan baja dificultad y que te atraigan, así aprendes lo básico, te dejo unos para cada rol que no son muy difíciles: \n\nTop: Jax, Pantheon, Nasus. Esos son bastante fáciles para comenzar en top ya que no requieren de **tanta** habilidad, puedes ver antes unos videos en Youtube para ver cómo son y no comprar a ciegas.\n\nMid: Annie\n\nJg: Amumu, Yi.\n\nAdc: Ashe, Tristana, Caitlyn.\n\nSupp: Leona, Soraka.\n\n\n*  Las runas, como bien te dijeron abajo, no las compres hasta lvl 20 o más, y ahí puedes armarte unas estándares que servirán con muchos campeones. \n\n\n* Igualmente como ya te dijeron, tu build se construye dependiendo de su equipo, y del tuyo también, eso lo aprendes con el tiempo. Por darte un ejemplo: Si tienen un equipo con mucha vida, armate Rey Arruinado (siendo AD, como Yi), o un Lyandri (siendo AP, un mago), etc.\n\n   Otro factor a tener en cuenta a la hora de jugar es el \"push\", o sea, qué tan adelantada tienes tu linea (Los Creeps, Minions, etc), si pusheas     demasiado, tienes que asegurarte de poner \"centinelas\" (o Wards, si lees \"ward\" se refiere a esos) para que no te venga un enemigo por sorpresa y te mate, lo ideal es que no pushees tu, ni que te pusheen a ti, esto se logra dándole sólo el último golpe a los creeps, para que te de el oro.\n\n   A la hora de intercambiar daño con tu oponente tienes que tener esto en cuenta: Su vida, la tuya, sus minions y los tuyos (si él tiene más, olvídate de pegarle, te van a matar los minions), su daño y el tuyo, y ambas builds, ésto tienes que verlo siempre antes de intercambiar, o puedes salir perdiendo bastante mal.\n  \n   Asegúrate de comprar cada vez que vuelvas a base por lo menos un centinela, para evitar que te venga un enemigo de la nada.\n\n\n* Cuando compres un campeón nuevo, lo ideal es que lo pruebes contra bots (en cooperativo) hasta que veas bien como funcionan sus habilidades, y si te animas, llevarlo a normal.\n\n\n* Bueno esto está más  menos en el otro punto que puse, y recuerda, nunca priorices el matar un enemigo sobre el tirar una torre o hacer algún otro objetivo importante, generalmente los asesinatos son lo menos importante, recuerda: 12 minions equivalen a un asesinato, así que prioriza tener más creeps muertos que tu enemigo.\n\n* En Salsalol.com hay muchas guías que te vienen bien cuando no sepas como usar algún campeón, hay más páginas como MobaFire.com o Lolking.com.\n\nEso sería todo, recuerda, agregame si tienes más dudas y te responderé siempre que pueda :3.\n\nEDIT: Lo de los términos no lo puse porque ya te dieron una página muy completa, te recomiendo verla.","replies":[{"poster":"RayThunder21","date":"2015-06-13T05:36:40.201+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Darkito Nexus,realm=LAS,application-id=njUm58At,discussion-id=o1MVIf0B,comment-id=0006,timestamp=2015-06-13T02:06:24.187+0000)\n>\n> Te dejo una \"Guía rápida\" por aquí, y si tienes más dudas, agregame dentro del juego y no tengas miedo de preguntar, tengo mucha paciencia explicando así que si no entiendes algo a la primera, no dudes en volverme a preguntar y apenas pueda te respondo n.n.\n> \n> Antes de comenzar, quiero que tengas **muy**, **muy** presente algo: De repente hay enemigos/aliados que son gente que tiene cuentas ya en lvl 30, por lo que son experimentados y obvio te van a ganar fácil, no te desanimes si esto pasa, porque lo he visto, así que no te frustres y sigue con tu juego.\n> \n> Bueno acá vamos: \n>   \n> *  Yo te recomendaría para empezar campeones que tengan baja dificultad y que te atraigan, así aprendes lo básico, te dejo unos para cada rol que no son muy difíciles: \n> \n> Top: Jax, Pantheon, Nasus. Esos son bastante fáciles para comenzar en top ya que no requieren de **tanta** habilidad, puedes ver antes unos videos en Youtube para ver cómo son y no comprar a ciegas.\n> \n> Mid: Annie\n> \n> Jg: Amumu, Yi.\n> \n> Adc: Ashe, Tristana, Caitlyn.\n> \n> Supp: Leona, Soraka.\n> \n> \n> *  Las runas, como bien te dijeron abajo, no las compres hasta lvl 20 o más, y ahí puedes armarte unas estándares que servirán con muchos campeones. \n> \n> \n> * Igualmente como ya te dijeron, tu build se construye dependiendo de su equipo, y del tuyo también, eso lo aprendes con el tiempo. Por darte un ejemplo: Si tienen un equipo con mucha vida, armate Rey Arruinado (siendo AD, como Yi), o un Lyandri (siendo AP, un mago), etc.\n> \n>    Otro factor a tener en cuenta a la hora de jugar es el \"push\", o sea, qué tan adelantada tienes tu linea (Los Creeps, Minions, etc), si pusheas     demasiado, tienes que asegurarte de poner \"centinelas\" (o Wards, si lees \"ward\" se refiere a esos) para que no te venga un enemigo por sorpresa y te mate, lo ideal es que no pushees tu, ni que te pusheen a ti, esto se logra dándole sólo el último golpe a los creeps, para que te de el oro.\n> \n>    A la hora de intercambiar daño con tu oponente tienes que tener esto en cuenta: Su vida, la tuya, sus minions y los tuyos (si él tiene más, olvídate de pegarle, te van a matar los minions), su daño y el tuyo, y ambas builds, ésto tienes que verlo siempre antes de intercambiar, o puedes salir perdiendo bastante mal.\n>   \n>    Asegúrate de comprar cada vez que vuelvas a base por lo menos un centinela, para evitar que te venga un enemigo de la nada.\n> \n> \n> * Cuando compres un campeón nuevo, lo ideal es que lo pruebes contra bots (en cooperativo) hasta que veas bien como funcionan sus habilidades, y si te animas, llevarlo a normal.\n> \n> \n> * Bueno esto está más  menos en el otro punto que puse, y recuerda, nunca priorices el matar un enemigo sobre el tirar una torre o hacer algún otro objetivo importante, generalmente los asesinatos son lo menos importante, recuerda: 12 minions equivalen a un asesinato, así que prioriza tener más creeps muertos que tu enemigo.\n> \n> * En Salsalol.com hay muchas guías que te vienen bien cuando no sepas como usar algún campeón, hay más páginas como MobaFire.com o Lolking.com.\n> \n> Eso sería todo, recuerda, agregame si tienes más dudas y te responderé siempre que pueda :3.\n> \n> EDIT: Lo de los términos no lo puse porque ya te dieron una página muy completa, te recomiendo verla.\n\nOk gracias, más tarde leeré la página. Pero ya con una de las primeras respuestas me animé a comprar a Jax y Trynda(Este aún no probé). Y la verdad probé solo 2 cooperativos. Luego fui al normal, porque me parecía muy fácil manejarlo, el primer normal perdí pero culpa de un YI ausente en la batalla, si estuviera y fuera un poquito más bueno, habríamos ganado, pero vi que jugaba bien. Ahora jugué mi segunda partida normal con Jax y he ganado, con 13 asesinatos y 8 asistencias y no se cuantas muertes. Gracias por tus consejos y respuestas.","replies":[{"poster":"DkA Darkito","date":"2015-06-13T17:20:39.467+0000","up_votes":2,"down_votes":0,"body":"Genial, te felicito :), y lo probar en coop es sólo para conocer a tu campeón, si lo entiendes a la primera partida, es mejor xD, suerte.","replies":[]}]}]},{"poster":"PabloBad","date":"2015-06-13T16:05:24.877+0000","up_votes":2,"down_votes":0,"body":"Buenas amigo. \nVas por un camino inmejorable, el de jugar para mejorar, en vez de para ganar. Eso te llevará lejos, no abandones ese camino porque hasta los profecionales juegan para mejorar y no para ganar. En el camino te encontrarás con mucha gente que cree saber todo respecto a lol, pero no te unas a ellos. \nTe dejo la \"mejor Guia de LoL\" que he encontrado hasta ahora. Es extensa pero esta muy bien explicada. Siguela al pie de la letra y sacaras ventaja. Hay cosas que son algo avanzadas pero con el tiempo iras comprendiendo todo.\n\nhttps://drive.google.com/file/d/0B1YmQ7AnpduJYmdubGtMZ2hkTEU/view?pli=1\n\nDe paso, agregame a tu lista de amigos y hacemos unas partidas contra I.A. o contra gente, me da igual. \n\nUn solo consejo que me parece importante saber desde el inicio: \"FARMEA COMO DIOS\". Enfoca tu juego en matar todos los subditos que puedas.\nPara practicar esto:\n1º crea una partida personalizada solo sin bots aliados ni enemigos. Te elijes un mago que y sin runas ni maestrias entras a la partida y **te vales solo de tu ataque básico** para darles el golpe de gracia. Debes llegar al menos a 90 subditos antes de los 10:30 min. Verás que es dificil sin usar habilidades. \n2º Una vez que logres el anterior, has lo mismo pero con un bot enemigo (el bot ira a la linea de abajo, así que ve ahí tu también. No ataque nunca al bot, solo farmea los subditos, sin que te mate. Un buen bot para practicar esto es Ziggz, ya que te hostigará todo el tiempo y pondrá a prueba tus reflejos. \n  \nUn saludo y espero que nos encontremos en los campos de batalla","replies":[{"poster":"RayThunder21","date":"2015-06-15T01:37:31.521+0000","up_votes":1,"down_votes":0,"body":"Gracias por tus consejos y respuestas, ya te agrego ;)","replies":[]}]},{"poster":"goro111","date":"2015-06-12T22:12:37.477+0000","up_votes":2,"down_votes":0,"body":"Hola creo que lo que te falta es mejorar la mecánica del campeón; primero el primer objeto es {{item:1039}}  y {{item:2004}} x2, luego lo mejoras al machete azul con devorador; y luego te haces tu build.\n\nEspero que te sirva soy lvl 22 agregame :D\n\nSigue Jugando con {{champion:11}} seras bueno.\n\nY si quieres algo con daño comprate a sivir se juega adc :D\n\nAdios\n\nEmpieza Por sapo luego el blue luego red y luego golems, despues de eso te haces dragarracos y golems 2 potas de vida :D","replies":[{"poster":"Cipher","date":"2015-06-13T05:04:53.012+0000","up_votes":2,"down_votes":0,"body":"Mi opinión:\nCreo que sería mejor 1 poción de vida y 1 de mana en el monstruo rojo.\n\nEn el caso de empezar en azul sería mejor 2 de vida.","replies":[{"poster":"RayThunder21","date":"2015-06-13T05:51:45.464+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cipher,realm=LAS,application-id=njUm58At,discussion-id=o1MVIf0B,comment-id=00030000,timestamp=2015-06-13T05:04:53.012+0000)\n>\n> Mi opinión:\n> Creo que sería mejor 1 poción de vida y 1 de mana en el monstruo rojo.\n> \n> En el caso de empezar en azul sería mejor 2 de vida.\n\nGracias por tus consejos y opinión. Ahora te doy una mía, intenta escribir todo lo que quieres decir en un solo comentario, es simple y práctico en mi opinión, igual está bien :D","replies":[{"poster":"Cipher","date":"2015-06-15T23:57:31.886+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RayThunder21,realm=LAS,application-id=njUm58At,discussion-id=o1MVIf0B,comment-id=000300000000,timestamp=2015-06-13T05:51:45.464+0000)\n>\n> Gracias por tus consejos y opinión. Ahora te doy una mía, intenta escribir todo lo que quieres decir en un solo comentario, es simple y práctico en mi opinión, igual está bien :D\n\nNo, porque respondía a Goro111 (en este caso presentaba una opinión personal a su comentario). Decir lo de las pociones no tendría sentido en el otro comentario.","replies":[{"poster":"RayThunder21","date":"2015-06-23T03:36:46.380+0000","up_votes":1,"down_votes":0,"body":"Ah ok, pero estaría bien dejar un espacio y luego escribir... mejor me cayo xD","replies":[]}]}]}]},{"poster":"RayThunder21","date":"2015-06-13T05:42:57.354+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=goro111,realm=LAS,application-id=njUm58At,discussion-id=o1MVIf0B,comment-id=0003,timestamp=2015-06-12T22:12:37.477+0000)\n>\n> Hola creo que lo que te falta es mejorar la mecánica del campeón; primero el primer objeto es {{item:1039}}  y {{item:2004}} x2, luego lo mejoras al machete azul con devorador; y luego te haces tu build.\n> \n> Espero que te sirva soy lvl 22 agregame :D\n> \n> Sigue Jugando con {{champion:11}} seras bueno.\n> \n> Y si quieres algo con daño comprate a sivir se juega adc :D\n> \n> Adios\n\nGracias por tu respuesta y consejo :D","replies":[]}]},{"poster":"hello","date":"2015-06-12T21:30:35.830+0000","up_votes":2,"down_votes":0,"body":"mi duda es, usas teleport cuando vas a top? ayuda mucho por si se arma una pelea en bot y necesitan ayuda. Nunca probaste un tanque? malphite es bueno para iniciar una tf y no es caro","replies":[{"poster":"RayThunder21","date":"2015-06-12T21:33:31.106+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Un campeón,realm=LAS,application-id=njUm58At,discussion-id=o1MVIf0B,comment-id=0001,timestamp=2015-06-12T21:30:35.830+0000)\n>\n> mi duda es, usas teleport cuando vas a top? ayuda mucho por si se arma una pelea en bot y necesitan ayuda. Nunca probaste un tanque? malphite es bueno para iniciar una tf y no es caro\n\nSi he usado varias veces. Me sirvió, unas ves estaba en top, y bot habia un enemigo, use teleport y lo maté :D Que recuerdos no tan lejanos :D\nGaren no se si es tanque, pero lo he usado, muy poco.","replies":[{"poster":"Cipher","date":"2015-06-13T05:01:42.331+0000","up_votes":2,"down_votes":0,"body":"Dependiendo de lo que te compres puedes hacerlo tank o daño. Pero en el meta actual se utilizan campeones que tengan algo de control de masas (estuneos, ralentizaciones, etc.).\n\nEj: Renekton, Maokai, Malphite.","replies":[{"poster":"RayThunder21","date":"2015-06-13T05:50:19.545+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cipher,realm=LAS,application-id=njUm58At,discussion-id=o1MVIf0B,comment-id=000100000001,timestamp=2015-06-13T05:01:42.331+0000)\n>\n> Dependiendo de lo que te compres puedes hacerlo tank o daño. Pero en el meta actual se utilizan campeones que tengan algo de control de masas (estuneos, ralentizaciones, etc.).\n> \n> Ej: Renekton, Maokai, Malphite.\n\nGracias por tus consejos :D","replies":[]}]},{"poster":"goro111","date":"2015-06-12T22:17:34.266+0000","up_votes":2,"down_votes":0,"body":"Garen es tanque :D debes armarlo OP {{item:3068}} {{item:3143}} {{item:3083}} {{item:3102}} , etc","replies":[]}]}]},{"poster":"byga24","date":"2015-06-13T02:18:25.690+0000","up_votes":2,"down_votes":0,"body":"Te voy a decir lo que hice yo para mejorar y que aún me ayuda: Mirar como juegan los mejores, si te interesa algún champ, trata de buscar un gameplay de él (preferiblemente en español) observar que es lo que hace y lo que no, compararlo con lo que haces vos, y para complementar busca un top de las mejores plays del personaje.","replies":[{"poster":"RayThunder21","date":"2015-06-13T05:39:01.994+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZeroMegami,realm=LAS,application-id=njUm58At,discussion-id=o1MVIf0B,comment-id=0007,timestamp=2015-06-13T02:18:25.690+0000)\n>\n> Te voy a decir lo que hice yo para mejorar y que aún me ayuda: Mirar como juegan los mejores, si te interesa algún champ, trata de buscar un gameplay de él (preferiblemente en español) observar que es lo que hace y lo que no, compararlo con lo que haces vos, y para complementar busca un top de las mejores plays del personaje.\n\nGracias por tu respuesta, pero no tengo tiempo para ver gameplays de estos, porque tengo tiempo apenas para jugar 2 o 3 partidas, o sino 1, y luego mirar gameplays de otras cosas. :D Como dije, gracias, todo ayuda.","replies":[]}]},{"poster":"Nemireg","date":"2015-06-12T23:38:20.214+0000","up_votes":2,"down_votes":0,"body":"Te recomiendo seguir jugando con {{champion:58}}  si es que te gusta la linea de top, ya que este se puede armar Ad/offtank o full tank y tiene buen sustain en linea, como te dicen no te fijes en las runas hasta llegar a lvl 20 y desbloquear las de grado 3 y para orientarte con ellas hay muchos videos que explican sobre como armar paginas de runas \"generales\", lo que debes mejorar y te recomiendo hacerlo contra bots y despues ponerlo en practica en partidas normales, es el lasthiteo(matar al minion/creep de un solo golpe cuando este tiene poca vida) asi evitas pushear(empujar) tu linea y te ahorras ganks enemigos y posibles muertes tuyas, si este no es el caso y tu linea esta pusheada siempre recuerda que eres un gankeo facil si no tienes flash por lo que te recomendaria estar atento al minimap ( si vez que el jungla enemigo paso por mid posiblemente suba a top) o si este parte en el buff contrario a tu lado del mapa (Si estas del lado rojo(arriba)y el jungler enemigo parte en blue(Golem grande azul) el primer gank posiblemente siempre seas tu, ya que al terminar el segundo buff la linea mas cercana eres tu)\n\nAhora sobre la Build del enemigo: esta siempre es importante ya que si estas contra un full ad como por ejemplo {{champion:92}} es recomendable sacar armadura para asi reducir su daño en el caso de que el campeon que ocupes sea tank o offtank, lo mismo pasa del lado contrario, si te armas ad y el enemigo tiene armadura es recomendable sacar objetos con penetracion de armadura tales como {{item:3134}} o {{item:3071}}. \n\nAhora si vas contra un top laner AP {{champion:68}} {{champion:57}} {{champion:8}} {{champion:13}} {{champion:127}}  que quizas sean los mas comunes que veas cuando subas mas de nivel, es recomendable sacar armadura magica si vez que te estan ganando la linea o te han matado así evitas seguir muriendo, un item recomdable contra estos si quieres jugar con un poco mas de daño es el {{item:3155}} ya que te da un buen escudo magico cuando tienes poca vida y buen daño.\n\nSobre master YI este al ser un asesino AD y por los items que deberas sacarle, siempre sera un poco mas \"papel\" que los demas pero con una gran capacidad de asesinato (Por su pasiva,ulti y Q) lo que debes tener en cuenta siempre es tratar de disminuir la mayor cantidad de daño posible que recibas con su W ya que esta te deja estatico en tu lugar por unos segundos, pero te regenera vida y disminuye bastante el daño recibido (Util contra ultis como los de {{champion:238}} {{champion:8}} ) ademas de servirte para evitar que te \"lasthiteen\" puesto que al usarla antes de recibir el ultimo golpe disminuiras la mayor parte de el daño y posiblemente no mueras. \n\nLuego con el tiempo iras ocupando mas campeones y descubriras tu rol favorito o tu tipo de campeon favorito y te centraras en este, pero no debes dejar de lado las demas lineas ya que no siempre podras jugar la linea que quieras.\n\nUn consejo de parte mia y es como yo aprendi a ocupar a los campeones es fijarte en como juega tu adversario con los campeones, que habilidad upgradea, que build ocupa y en que orden ocupa sus habilidades así aprendes el \"combo\" de ese campeon y tambien aprendes a jugar en contra del, ademas de siempre leer la descripcion de las habilidades del campeon, asi descubres que es lo que hacen y cual es mas util.\n\nOtro consejo es que **No jueges ranked apenas subas a nivel 30 y tengas los 16 campeones** no es para nada recomendable, el ambiente de estas partidas es mas \"Deportivo\" por lo que el ambiente de competencia aumenta y si aun no eres muy buen jugador todos te insultaran ademas de que te evitaras quedar en una divicion como bronce y quedar \"atrapado en bronce\" (jajajaja) lo mas recomendable es que sigas jugando partidas normales y tengas bastantes campeones y minimo 2 paginas de runas (Desde mi punto de vista, mejor 3 \"generales\" Una AD,otra AP y una tercera para supports (que sera la linea que posiblemente te toque jugar bastante al principio de tus rankeds aunque no te guste) o tanks, luego iras armandote mas paginas de runas especificas como para junglers, adc o toplaners especificos.\n\nSaludos!\n\nPd: las ganas de aprender siempre, por ejemplo yo, siempre me ando fijando en los streamers \"high elo\" o viendo los campeonatos como LCS para intentar aprender las jugadas que hacen, siempre es bueno aprender más e intentar jugadas mas complejas, hace poco descubri que con {{champion:67}} se puede usar el combo E+flash para empujar al contrincante contra una muralla y stunearlo y eso que estoy en diamante, la ocupo bastante y me considero bueno con ella y no tenia idea que podia hacer eso jaja.","replies":[]},{"poster":"16 Years old","date":"2015-06-12T21:33:27.390+0000","up_votes":2,"down_votes":0,"body":"Amigo, no le hagas caso, demás son \"Smurfs\" De bronce que se creen Pros por ganarle o ser mejor qué alguién que lleva 1 mes jugando, \"mutealos\"  se disfruta más el juego, Yo juego hace 1 año y todabia no se jugar al 100%.\n\n\nLo otro, {{champion:58}}  Fue mi primer champ main, hasta ahora lo uso en ranked, Se podría decir que tengo un KDA \"Decente\".\n\nSobre la build siempre empiezo con {{item:1055}} Ya qué  {{champion:58}} Tiene un muy buen \"Early\" pero en late decae así que tienes que ganar la linea o sacarle mucho farm, siguiendo con la build después me hago {{item:3077}} Después{{item:3751}}  (Depende, si me fedeo mucho sigo con la {{item:3074}} o si la lane estuvo \"normal\" me armo tanke) Las botas me hago {{item:3111}}  Luego Termino la {{item:3068}} ,{{item:3143}}, {{item:3065}} y {{item:3026}} .\n\nTambién Compra Runas pero espera a Lvl 20 para comprarte las de grado 3, porque las de grado 1 y 2 No sirven xD Creo que todas las runas AP y AD (Son las mas estándar) Salen unos 8.000 de PI.\n\nSaludos-{{champion:117}}","replies":[{"poster":"RayThunder21","date":"2015-06-12T21:36:37.298+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lv 1 Magikarp,realm=LAS,application-id=njUm58At,discussion-id=o1MVIf0B,comment-id=0002,timestamp=2015-06-12T21:33:27.390+0000)\n>\n> Amigo, no le hagas caso, demás son \"Smurfs\" De bronce que se creen Pros por ganarle o ser mejor alguien que lleva 1 mes jugando, \"mutealos\"  se disfruta más el juego, Yo juego hace 1 año y todabia no se jugar al 100%.\n> \n> \n> Lo otro, {{champion:58}}  Fue mi primer champ main, hasta ahora lo uso en ranked, Se podría decir que tengo un KDA \"Decente\".\n> \n> Sobre la build siempre empiezo con {{item:1055}} Ya qué  {{champion:58}} Tiene un muy buen \"Early\" pero en late decae así que tienes que ganar la linea o sacarle mucho farm, siguiendo con la build después me hago {{item:3077}} Despues{{item:3751}}  (Depende, si me fedeo mucho sigo con la {{item:3074}} o si la lane estuvo \"normal\" me armo tanke) Las botas me hago {{item:3111}}  Luego Termino la {{item:3068}} ,{{item:3143}}, {{item:3065}} y {{item:3026}} .\n> \n> También Compra Runas pero espera a Lvl 20 para comprarte las de grado 3, porque las de grado 1 y 2 No sirven xD Creo que todas las runas AP y AD (Son las mas estándar) Salen unos 8.000 de PI.\n> \n> Saludos-{{champion:117}}\n\nGracias, pero me serviría más que me expliques todas las expresiones como champ main, ya que solo entendí el 50% de lo que dijiste XD","replies":[{"poster":"16 Years old","date":"2015-06-12T21:54:53.207+0000","up_votes":2,"down_votes":0,"body":"Bueno, Tradear mucho en lane, Entrar con la E en un minion, W, Q y salir con la E de tal forma que hagas un trade sin que el rival te de 1 golpe (Luego de hacer eso tendrás en CD Toda las Habilidades y estarás muy vulnerable Asi que juega muy pasiva hasta que se resetee el cd) Y nuevamente repites el combo.\n\nSiempre cuando inicies un trade inicia con E, Ya que Reduce armadura, cuando tengas furia pega la W hace un daño ridiculo ademas aumenta la duracion del stun, la Q con furia solo sirve para el sustain en linea  y la E con furia no sirve mucho.\n\nDisculpa si la \"explicación\" no es lo que buscas pero en http://www.mobafire.com Hay muchas guias pero en ingles xD pero son muy completas.","replies":[{"poster":"RayThunder21","date":"2015-06-13T05:43:50.309+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lv 1 Magikarp,realm=LAS,application-id=njUm58At,discussion-id=o1MVIf0B,comment-id=000200000000,timestamp=2015-06-12T21:54:53.207+0000)\n>\n> Bueno, Tradear mucho en lane, Entrar con la E en un minion, W, Q y salir con la E de tal forma que hagas un trade sin que el rival te de 1 golpe (Luego de hacer eso tendrás en CD Toda las Habilidades y estarás muy vulnerable Asi que juega muy pasiva hasta que se resetee el cd) Y nuevamente repites el combo.\n> \n> Siempre cuando inicies un trade inicia con E, Ya que Reduce armadura, cuando tengas furia pega la W hace un daño ridiculo ademas aumenta la duracion del stun, la Q con furia solo sirve para el sustain en linea  y la E con furia no sirve mucho.\n> \n> Disculpa si la \"explicación\" no es lo que buscas pero en http://www.mobafire.com Hay muchas guias pero en ingles xD pero son muy completas.\n\nPor lo que veo es para Renekton :D","replies":[]}]}]}]},{"poster":"Geeik","date":"2016-04-17T18:50:19.929+0000","up_votes":1,"down_votes":0,"body":"Amigo, tu historia me llego al corazon y seguramente te sientes un fiasco, a todos nos paso, en especial cuando justo nos toca con el tipico nivel 29 que va de sobra y flamea como si fuera un challenger que esta ahi por error.\n**Intenta encontrar tu Rol:**Los campeones suelen tener roles. (luchador, tanque, asesino, tirador, soporte, mago, etc. Suelen tener dos roles asi que mejor) A mi me gustan mucho los tanques y los soportes, intenta buscar tu punto fuerte y ve probando campeones por el estilo, maestro yi es asesino, intenta con ellos!","replies":[{"poster":"Geeik","date":"2016-04-17T18:54:41.655+0000","up_votes":1,"down_votes":0,"body":"**POSDATA:**Mira a los campeones y veras que tienen varias barras, intenta que la de dificultad este baja, eso implica que tiene buenas cualidades como poder hacer combos faciles","replies":[]},{"poster":"Geeik","date":"2016-04-17T18:51:00.628+0000","up_votes":1,"down_votes":0,"body":"**PUEDES LOGRARLO!**","replies":[]}]},{"poster":"Runth","date":"2015-12-01T09:50:21.063+0000","up_votes":1,"down_votes":0,"body":"siempre fuimos novatos alguna ves, solo el q no aprende lo q trata el juego , lo mas basico , ahi es mejor no pensar en eso","replies":[]},{"poster":"goro111","date":"2015-07-20T15:58:18.601+0000","up_votes":1,"down_votes":0,"body":"Has Pensado En Jugar {{champion:157}} se parece a yi, te quita harto con los criticos","replies":[]},{"poster":"Last Surprise ","date":"2015-06-23T07:24:58.941+0000","up_votes":1,"down_votes":0,"body":"Agregame, puedo ayudarte en cualquier duda que tengas. Me gusta mucho explicar :D","replies":[]},{"poster":"Zęd Mîd","date":"2015-06-15T01:08:16.281+0000","up_votes":1,"down_votes":0,"body":"Eres genial, para mí, eres genial.\nTe cuento mi desgraciada historia.\nComencé jugando con bots y así todo el rato, pensando que mejoraría y que mi primera pvp sería épica.\nERROR: Fue una masacre y no tenía ni idea de como jugar -.-\n\nAl ver eso decidí que tenía practicar, pero era bastante tarde el nivel era muy alto para el mío, era lvl28 y pues, puros bots no se comparaban a 100 victorias en normales.\n\nAl final el haber jugado tanto con bots con un campeón en específico me favoreció un poquillo, adquirí el amor que tengo por Yasuo, mi main desde el nivel en el que estás, nivel 12. Lo jugué con bots, normales, clasificatorias, ay esos tiempos xD\n\nCierto es que no soy oro platino o diamante, subiré en cuanto \"perfeccione\" mi manejo de campeones. \n\nTú preocúpate por aprenderlos a usar, luego los perfeccionas. Me parece genial que jueges normales, ya que en lvl12 por ahí es rarísimo encontrarse a alguien \"smurfeando\" (Digamos que es lvl30 y es de la liga oro pero juega con una cuenta aparte lvl12) ya que les suele dar pereza llegar hasta ahí, así que en este momento estás jugando con gente de tu nivel en pvp (normales) y eso ¡Es genial!\n\nCuando llegues a nivel 30, asegúrate de tener almenos 30 campeones comprados, 15 aprendidos y 7 perfeccionados para empezar a jugar las tensas clasificatorias y almenos un par de páginas de runas llenas.\nEso de una página de runa por campeones lo harás cuando tengas más de 4 páginas, y las páginas cuando seas más de lvl20.\n\n\nEres más pro que yo en esos tiempos y serás más pro que yo en estos, ¡Suerte!","replies":[{"poster":"RayThunder21","date":"2015-06-15T01:42:04.618+0000","up_votes":1,"down_votes":0,"body":"Gracias por tu respuesta y consejos :D La verdad no entendi sobre el \"smurf\" , aun me falta algo de vocabulario. Digamos que soy un chico que no sabe hablar xD\nY otra cosa, eso de perfeccionarlos no se si te refieres a tenerlos a nivel 5 o que...\nIgual gracias, yo digo que todo ayuda :D","replies":[{"poster":"Zęd Mîd","date":"2015-06-17T21:02:13.945+0000","up_votes":1,"down_votes":0,"body":"El término \"smurf\" también se utiliza en cs:go\nLa persona que hace smurf, es la persona que a pesar de ser de un nivel mayor, entra con cuentas de niveles bajos para jugar con gente poco experimentada.\nY lo de perfeccionar campeones, es aprender cada uno de sus trucos, eso de nivel 5 no es nada, yo subí a Twisted Fate a nivel 3 en unos pocos días y te soy sincero, no sé usarlo más que lo básico. El perfeccionar un campeón, es aprenderte cada técnica y saber calcular el daño que haces con ese campeón.","replies":[{"poster":"RayThunder21","date":"2015-06-23T03:34:57.225+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias por la aclaración :D","replies":[]}]},{"poster":"Zęd Mîd","date":"2015-06-17T21:01:07.930+0000","up_votes":1,"down_votes":0,"body":"El término \"smurf\" también se utiliza en cs:go\nLa persona que hace smurf, es la persona que a pesar de ser de un nivel mayor, entra con cuentas de niveles bajos para jugar con gente poco experimentada.\nY lo de perfeccionar campeones, es aprender cada uno de sus trucos, eso de nivel 5 no es nada, yo subí a Twisted Fate a nivel 3 en unos pocos días y te soy sincero, no sé usarlo más que lo básico. El perfeccionar un campeón, es aprenderte cada técnica y saber calcular el daño que haces con ese campeón.","replies":[]}]}]},{"poster":"xDeadBleXz","date":"2015-06-15T02:23:26.869+0000","up_votes":1,"down_votes":0,"body":"Debirias empezara utilizar otros campenoes. Si te gusta el daño prueba a estos adc{{champion:222}} {{champion:51}} {{champion:21}} tambien los de mid {{champion:55}} {{champion:238}} {{champion:157}} si fedeas a alguno directamente si sabes jugar ganas la partida xD\n\nSaludos","replies":[]}]}