{"poster":"Food Summoner","date":"2016-12-08T02:23:42.214+0000","title":"MMR with duo q","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Hi,\r\n\r\nI am currently playing with a friend (we are both in placements) that has a higher MMR than me. He has an MMR of Gold 4, whereas mine is only Silver 4 (I don&#039;t think I am s4 bad as i placed s2 in the last parts of the preseason). My question is because we keep playing against gold players and up, will my MMR increase a lot? I am playing support as he plays adc though. \r\n\r\nThanks.","replies":[{"poster":"Ninox","date":"2016-12-08T12:54:00.876+0000","up_votes":2,"down_votes":0,"body":"Assuming you are winning more games than losing then yes. Winning against players with higher mmr will earn you more mmr per win. It's worth noting that mmr is not tied to rank, so you can have mmr higher or lower than the average for your rank. You may very well have low gold mmr.\n\nSites like op.gg do not use Riot's mmr calculations, so they can only be estimates and will never be truly accurate.","replies":[{"poster":"Food Summoner","date":"2016-12-08T22:48:21.779+0000","up_votes":1,"down_votes":0,"body":"that is very helpful, thanks","replies":[]}]},{"poster":"Spidicus","date":"2016-12-08T06:49:12.400+0000","up_votes":2,"down_votes":0,"body":"Let us know the results of your duo q, especially if you play all 10 games together","replies":[{"poster":"Food Summoner","date":"2016-12-08T22:48:47.270+0000","up_votes":1,"down_votes":0,"body":"we will, I'll reply to this once we're done","replies":[]}]},{"poster":"Samo","date":"2016-12-08T03:30:52.838+0000","up_votes":2,"down_votes":0,"body":"i believe his mmr will decrease and yours will increase until they both match","replies":[]},{"poster":"Ugs","date":"2016-12-08T08:18:28.179+0000","up_votes":1,"down_votes":0,"body":"i just did my 10 games against mid to high silvers and i won 7/10 and went from 1300+ mmr to bronze 4? im still not understanding how that works ?","replies":[]}]}