{"poster":"Morion75","date":"2018-01-29T16:26:39.864+0000","title":"Incomprensioni Riguardo Il Nuovo Sistema Di Onore","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salve! Di natura non mi ritengo una persona impaziente ma in questo caso non riesco a capire come funzioni il nuovo leveling di onore all&#039;interno di LoL. Questa cosa dei checkpoint mi piace molto, e anche le ricompense, ma non capisco come si faccia a salire. Sono al terzo check point nel livello 2 da quando e uscito l&#039;aggiornamento e non sono ancora salito al livello 3, quindi volevo capire se bisognasse fare qualcosa in particolare per salire o semplicemente aspettare. Grazie per eventuali risposte e ci si vede nella landa.\r\n{{sticker:galio-happy}}","replies":[{"poster":"Norakaan","date":"2018-01-30T11:25:21.440+0000","up_votes":1,"down_votes":0,"body":"domanda inerente: mi avevano detto che bisognava prendere almeno 2 onori in class o normal da non compagni di gruppo per far salire l' onore è corretto?\nPerché gli ho avuti in un paio di partite e anche un 4 onori ,con in mezzo compagni di lobby ,ma ancora non è salito.\n\"Sicuramente\" non ho preso segnalazioni in quanto a parte qualche brutta partita (gente che scrive di report per brutte partite ce sempre \n =P ) non ho mai insultato o simili\nBisognava aspettare per qualche altro motivo più tempo prima? o è solo perché ci sono stati questi grossi cambiamenti?\nCominciando a giocare da fine estate ero salito al max onore entro la fine della S7 e questa è la prima che faccio ... quindi non ho exp ma mi piaceva l 'idea di far sapere agli altri che ero un giocatore con cui si poteva giocare serenamente assieme","replies":[{"poster":"Philippicus","date":"2018-01-30T16:13:45.542+0000","up_votes":1,"down_votes":0,"body":"Non credo si salga così facilmente. Alla fine in teoria saliresti anche solo giocando pur non ricevendo onori a fine partita. poi se vieni onorato più volte e e piu spesso salirai più velocemente, ma come ho ho detto nell'altra risposta secondo me quest'anno l'aumento dell'onore sarà più lento rispetto alla scorsa stagione.","replies":[]}]},{"poster":"Philippicus","date":"2018-01-30T08:51:15.960+0000","up_votes":1,"down_votes":0,"body":"Immagino che rispetto all'anno scorso il livellamento dell'onore sarà più lento visto che si parte già da gennaio e non da luglio come per la scorsa season. Quindi,comportandoti correttamente, mantenendo un comportamento corretto sia nei game facili che difficili e onorando a tua volta, con un po'di pazienza salirai pian piano.","replies":[]},{"poster":"Koria","date":"2018-01-29T21:17:44.366+0000","up_votes":1,"down_votes":2,"body":"Bisogna aspettare l'ondata del level up dell'honor da parte della riot","replies":[]}]}