{"poster":"ŁΩckÐΘwN","date":"2018-09-03T15:11:36.031+0000","title":"Chiarimenti sul sistema di honor e i premi a fine season riguardante il livello honor","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"Salve vorrei un chiarimento sul sistema di honor. Insomma sono honor 1 bloccato ed ho avuto una restrinzione chat di 10 game, vorrei sapere se a fine season posso comunque avere i premi season 8 : skin vittoriosa/icona ed il resto. Faccio questa domanda perch&egrave; sul post di un rioter riguardante ( Assistenza ricompensa partite classificate 2017 ), c&#039;&egrave; scritto in poche parole che se non si &egrave; stati bannati per 7 giorni o pi&ugrave; dopo il 23 agosto, non si ha una restrinzione chat durante la fine della season anche se si era al di sotto dell&#039;honor 2 si potevano avere i premi di fine stagione.","replies":[{"poster":"RGM Player","date":"2018-09-03T15:16:22.729+0000","up_votes":2,"down_votes":0,"body":"Il requisito minimo è avere Honor lvl2.","replies":[{"poster":"ŁΩckÐΘwN","date":"2018-09-03T15:18:14.554+0000","up_votes":1,"down_votes":1,"body":"Lo dicono tutti ma sulla pagina di cui ho parlato prima fatta da un rioter c'è scritto che anche al di sotto dell'honor 2 si potevano avere","replies":[{"poster":"RGM Player","date":"2018-09-03T15:34:23.188+0000","up_votes":2,"down_votes":0,"body":"C'è scritto 2017 in quella pagina, noi siamo nel 2018.","replies":[{"poster":"ŁΩckÐΘwN","date":"2018-09-03T15:42:40.216+0000","up_votes":1,"down_votes":1,"body":"Ho capito ma il sistema di honor è lo stesso, insomma funziona allo stesso modo.\nMa se sei sicuro che un rioter ti abbia scritto che serve per forza honor 2 ok, tento di ritornare honor 2.","replies":[]}]}]}]},{"poster":"SUN Void ","date":"2018-09-03T15:30:27.583+0000","up_votes":2,"down_votes":0,"body":"La risposta è no, hanno commentato gli addetti tempo addietro alla stessa domanda (posta da me). Bisogna necessariamente essere onore livello 2 o superiore per ottenere le ricompense di fine stagione","replies":[{"poster":"ŁΩckÐΘwN","date":"2018-09-03T15:31:45.159+0000","up_votes":1,"down_votes":0,"body":"Ok grazie mille almeno so che devo fare spero che in 2 mesi io riesca ad arrivare honor 2","replies":[]}]},{"poster":"lStardustl","date":"2018-09-03T15:20:13.721+0000","up_votes":2,"down_votes":0,"body":"Sotto l'honor 2, nulla","replies":[]},{"poster":"ŁΩckÐΘwN","date":"2018-09-03T15:12:56.923+0000","up_votes":1,"down_votes":1,"body":"La mia domanda è si possono avere i premi di fine stagione anche se si è honor 1, ovviamente non avendo una restrinzione chat a fine stagione e non essendo stati bannati per più di 7 giorni dopo il 23 agosto?.","replies":[]}]}