{"poster":"Club 27","date":"2015-08-25T07:32:01.118+0000","title":"Launcher zeigt keinen Inhalt mehr?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo! \r\n\r\nBis gestern ging das Spiel noch einwandfrei, jetzt kommt pl&ouml;tzlich nur noch das was auf dem Bild zu sehen ist. Alle m&ouml;glichen fixes und neuinstallation etc hab ich schon versucht. An was kann es evtl liegen?","replies":[{"poster":"Vanze","date":"2015-08-25T20:25:48.705+0000","up_votes":1,"down_votes":0,"body":"Falls noch nicht behoben, das Problem hatte ich auch mal nach nem Absturz. Versuch mal die vom Installer angelegte Desktopverknüpfung zu benutzen, evtl. als Admin. Ich hatte mir den Launcher selbst in die Taksbar gepinnt, das hat leider - warum auch immer - nicht gefunzt.","replies":[]},{"poster":"Club 27","date":"2015-08-25T09:23:47.876+0000","up_votes":1,"down_votes":0,"body":"Ich habe 'Fiddler Web Debugger' installiert, wie hier http://boards.euw.leagueoflegends.com/en/c/help-support-en/wrhlXqj1-patcher-not-working?comment=0005 empfohlen. Jetzt lädt es. Ich frage mich nur was das eigentliche Problem ist?","replies":[]},{"poster":"Thx And Bye","date":"2015-08-25T08:11:47.019+0000","up_votes":1,"down_votes":0,"body":"Es gibt mehrere Sachen, die den Fehler verursachen könnten.\nStelle zunächst sicher, dass du den Patcher als Admin startest.\nSollte dies deinen Fehler nicht beheben, setzte deinen Internet Explorer zurück: https://support.microsoft.com/de-de/kb/923737#bookmark-showme\n\nFalls du AVG als Antivirus nutzt, kann es durch dieses verursacht werden. Deaktiviere es ggf. test weise.","replies":[]},{"poster":"SliteSit13","date":"2015-08-25T07:53:13.455+0000","up_votes":1,"down_votes":0,"body":"Es kann auftreten wenn du zum Beispiel eine weniger gute Internet Verbindung hast dann dauert es zu lange um es zu laden...\n\nEs ist aber auch möglich das du nicht genügend fps hast und somit es zu anspruchsvoll ist die ganzen Daten zu laden...\n\naber keine Sorge spielen kannst du immer noch :) \n\nAlle Informationen die da stehen kann man ja auch auf der Homepage abrufen.","replies":[]}]}