{"poster":"NickW","date":"2015-09-06T03:03:15.129+0000","title":"Ayuda para compra de campeones","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Saludos a todos!\r\nTengo pensado comprarme algunos campeones para jungla/top/mid (para adc ya me decidi por kalista)\r\nPero estoy dudando mucho por cual decidirme.\r\nEstoy entre Rek&#039;sai, Shyvana, Zac, Lissandra, Kha&#039;Zix, Talon, Nocturne, Jarvan IV y Rengar (tengo para comprarme a 2, cualquiera sea)\r\nMi estilo de juego se adapta mejor a los bruiser y off tanks (de hecho ww con devorador es mi main en estos momentos).\r\nMe gustan mucho los asesinos, pero me cuesta bastante jugar con ellos, saber como posicionarme y no morir mucho, ademas de que todavia no tengo todas las runas para que soporten como deberian la jungla.\r\nQue recomendaciones me podrian dar sobre los campeones que tengo en mente?\r\nDesde ya, muchas gracias!","replies":[{"poster":"Matrox OpKarthus","date":"2015-09-06T04:14:34.741+0000","up_votes":2,"down_votes":0,"body":"SI manejas a {{champion:19}}  lo tuyo es :{{champion:102}} {{champion:56}} {{champion:107}}, ellos tienen casi la misma mecánica. como opcional te dejo a {{champion:421}} pero no es tan parecida. pero si buscan un tank te recomiendo primeramente a {{champion:102}} \n\nUna breve reseña:\n\n{{champion:102}} puede hacer un daño brutal si se te acerca a la igual que {{champion:19}}, resiste bastante, corre bastante, aunque no tiene robo de vida pasivo, aun asi tiene una buena iniciacion, por eso digo es muy parecido.\n\n{{champion:56}} tambien parecido a ww por su alta velocidad de ataque, un leve pasivo de robo de vida, aunque es un luchador orientado a asesino en ves de tank, Su q le da buen daño, una W que lo cubre de CC y le da mas attack speed, un fear de tiempo y una ulti (no muy recomendable para iniciar al menos que este el objetivo solo) muy eficaz para cazar carrier, por eso tambien es un poco parecido.\n\n{{champion:107}} si se te acerca te hace daño brutal, tiene buena movilidad en la jg, un buen cc, y una ulti para poder capturar y acercarte al carrier para tirarle todo tu daño brutal, y sigo repitiendo, es parecido xD.\n\ny como opcional {{champion:421}} : es un offtank con buena ayuda global y buen escape, aunque no es muy bueno focuseando, aun asi posee un daño y una resistencia parecida a la de {{champion:19}} pero sus mecanicas son algo diferentes en comparación de el.\n\nAnte los demas campeones no te los recomiendo a tu estilo de juego.","replies":[{"poster":"NickW","date":"2015-09-06T06:34:40.945+0000","up_votes":1,"down_votes":0,"body":"Mil gracias por la descripcion de cada uno!\nVoy a probarlos a ver que tal","replies":[]}]},{"poster":"Kobalth","date":"2015-09-06T04:08:24.067+0000","up_votes":2,"down_votes":0,"body":"{{champion:131}}  Sirve para top, mid y jg. yo la uso de jg principalmente y es bastante divertida.\n{{item:3708}} {{item:3115}} {{item:3001}} {{item:3157}} {{item:3089}} {{item:1314}}  mi build favorita\n\n{{champion:59}} Con los nuevos items esta muy fuerte en la jg. Y también se puede jugar en top\n{{item:3709}}  {{item:3748}} {{item:3742}} {{item:3156}} {{item:3071}} {{item:1324}}  mi build favorita","replies":[]}]}