{"poster":"Devils Advocate","date":"2016-06-01T08:53:41.784+0000","title":"Looking for a cheatsheet to ranked climbing","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Not a cheat sheet, i guess what i&#039;m looking for is a more definitive and laid out way to a) see how much LP is required to progress into the next league and b) consequences of losses etc. Alots changed since i last did ranked in S4. Preliminary match ups over, i&#039;m blessed it seems to avoid the bronze division, but need to climb from silver to better and brighter standings. \r\n\r\nSo for eg, lets say i accept an invite from a friend who&#039;s in bronze and we enter a game, we lose. Am i penalized more for being a higher div player losing to lower div players in game? etc\r\n\r\nIf i win a game, do i get X LP? how much LP till entering next league etc.\r\n\r\nThats the info im looking for, just seeing forum posts on &quot;why am i here&quot; mostly on google.","replies":[{"poster":"Tele","date":"2016-06-01T09:27:56.376+0000","up_votes":1,"down_votes":0,"body":"I think that cheatsheet you're looking for might be [this](https://support.riotgames.com/hc/en-us/articles/204010760-Ranked-Play-FAQ). \n**Also answered a few of the questions you had as well:**\n\n + _Am i penalized more for being a higher div player losing to lower div players in game? _\n\n>  If by lower division you imply lower MMR, then yes. You will loose more LP and MMR than average in this situation, check that out [here](https://support.riotgames.com/hc/en-us/articles/204010760-Ranked-Play-FAQ#h2q3).\n\n+ _If i win a game, do i get X LP? how much LP till entering next league_\n \n>  As I said in the last question, LP gains/losses are decided by the MMR difference between the two teams. LP changes are also additionally impacted by your MMR's difference when compared to your division's average MMR. \n\n>  It might sound a little complicated but essentially, if you're better than most people in your division, the system will give you more LP gains to help you get out. \n\n>  Reach 100 LP to advance to a promotional series. If you complete that, then you'll go to the next division.\n\nJust remember the system rewards consistent good play, so as long as you focus on that you'll be on the right track.\n\nI hope this helps :D","replies":[{"poster":"Devils Advocate","date":"2016-06-01T09:34:37.815+0000","up_votes":1,"down_votes":0,"body":"Thats pretty much what i was getting at exactly, im an older player so understanding the mechanics of the system is just as important to me as i know how i can help other players out also, it seems as much as i may want to help alot of my bronze friends out, it may be i will have to create a ranked casual account so i don't.. well, salty is the wrong word... but you can only do so much and even though they're friends, its hard to say \"you're holding me back\" and either you distance yourself and stop playing with them or you play with them accepting you'll like just stay around the same bracket till they climb out also. \n\nI imply, I'm in Silver, say i a good friend invites me to ranked games, i enjoy his company but im aware that he's no that great, he's in B5 or 4, due to him or another person on my team in a similar league they are the core reasons why it was so difficult and a loss came thundering in. \n\nDoing that even though all intentions are good, will severely limit your ability to progress unless you're playing a couple with lower tiers then focusing on climbing for the rest of the day to balance, sigh... just trying to avoid doubling up my games for one main progression, i'll need to make a casual ranked account for lower tier friends","replies":[{"poster":"Flaming Meat","date":"2016-06-01T09:47:03.296+0000","up_votes":1,"down_votes":0,"body":"Ye generally you leave those sorts of duos for normals. Making another account is always nice for your friends who are in lower tiers. However you're in silver, I'm not sure the reward for 40 games of normals on a new account might be worth it.","replies":[{"poster":"Devils Advocate","date":"2016-06-01T13:28:41.978+0000","up_votes":1,"down_votes":0,"body":"Im a silver with this account on oceanic, i was previous D2 in s4 at my height, mind you, i was in korean net cafes and those guys were smoking alot of stuff, may have been the unfair team advantage =/ \n\nEven with a toxic nasus that literally ragequit because he was top vs a yi, and losing... (i know... i hear all the WTF's from your mouths on my side of the screen, it should't be possible... at all) that our JG shaco came by river, nasus was almost pushed to yi's turret, yi did a great counter and killed him (what a surprise, yi dodging with Q and meditate tanking nasus under turret works pre-6) rages that shaco didnt use every summoner spell, magic cloud, dragon ball in his possession to magically appear and kill yi, instead shaco realized he couldn't do squat, saw a pink ward, killed it... nasus flamed, raged mostly that the ward was his to kill and should have been left.... ragequits at 10mins, returns at 22mins, feeds enemy, flames team for not suddenly revolving around his low level and helping him farm... \n\n*facepalm* yes, i'll be aiming to climb out of the toxic divisions asap, so making an alt \"casual\" ranked account to help the bronzies out, im okay with. I prefer not to have my games spectated, i can notice when people are sneaking in and i feel a minor fps dump, same way i dont like skype, if you have to focus on people talking to perform well rather than your intuition, map awareness and general good use of the ping system..... Until you want to come up with complex strats in high rankings, its really more of a disadvantage than advantage, it may be fun for normals as you have time to laugh. I find it distracted, especially when team mates cry that you didnt tell them to do something.... It's like my game revolves around doing well for me, so i can do well for you, and i gotta do your awareness for you also, and in the end... I dont get credit, more often than not some kid struts around thinking he's the king of LoL (what i've noticed about ADC's and Top laners in general- though i am a top laner... i like to think my top lanes are more- i can play this champ top mid or jg... i guess i can be an aggressive supp if you really want... thats what relic is for amirite? \n\nAbout the only thing im not really enjoying anymore is ADC, purely because finding players who enjoy support is hard, more so, its hard to find supports that understand... go in, dont be scared... dont hold back incase you kill, shit use your skills... I'd rather my supp get a kill than have him walk off thinking im on top of it, when in fact, im too low to risk it, by all means... take it! i'd rather 150g than no gold at all! \n\nand hell, support players need to have their glory moments also. Nobody enjoys making everyone else look good for long without some credit. \n\nShout out to the under-appreciated support players who get no recognition! \n\nYou make the game viable and more often than not, are the reason adc's are adc's and carry/win the game. Your first 10-15min contribution is unparalleled by any other role\n\n{{sticker:slayer-pantheon-thumbs}}\n\n\nedit; checked the site, my MMR is \"quite a bit higher than average\" for my league =S \n\nNow i wish i didnt see that, knowing that many stats can be a bad thing, it may detract from team play to improve your personal output, which may lose games. Now not to turn OCD.","replies":[]}]},{"poster":"Tele","date":"2016-06-01T09:51:02.193+0000","up_votes":1,"down_votes":0,"body":"Ohh, I see what you were asking now. \n\nTBH I wouldn't recommend playing with your Bronze friend much. Even if you play with him through Skype, you wont be able to talk about mistakes much since you'll have to focus on the match. Also if you do win matches, it might be frustrating for him later because all his opponents will be more experienced and better players than usual.\n\nIt's far better to spectate with a notepad and pen. Write down all the mistakes, successes, and key mechanics to focus on, then get in Skype with him and have a chat. If he's really serious about climbing he'll take the opportunity.","replies":[]}]}]},{"poster":"Flaming Meat","date":"2016-06-01T09:30:05.169+0000","up_votes":1,"down_votes":0,"body":"Look up your elo on oce.op.gg first. That generally dictates the rank of people you are matched with. The higher ranks people on your team or enemy team means the more you will gain if you win that game as the 'system' we'll call it is trying to place you in the appropriate ladder, which is higher than your rank. If you lose than you will take a small hit to your elo and lose a small amount of lp as you are where you should be.\n\nGenerally winning 6 games in a row from 0 lp, regardless of duos or matched players, will grant you a division. Winning, say, 5/6 games in the following division will allow you to rise 2 divisions. If for any reason you stop snowballing your wins you will not rise 2 divisions. <<< Personal experience.\n\nI have played with a super tilted plat player from diamond in order to match with lower division players to climb. It seems the way LP gain and loss is calculated for duos+ is way more complicated than soloqueue-ing, which will always follow the rules in the first paragraph.","replies":[{"poster":"Devils Advocate","date":"2016-06-01T13:17:47.685+0000","up_votes":1,"down_votes":0,"body":"I can see how the snowball rewards keep rising as your snowball increases, coming from highly competitive PvP games where skill came down to fractions of a click, sometimes who had the slightly better net etc, you needed to know all the mechanics in order to progress steadily (WoW Arena, BC>MoP for me in all brackets through 4 classes, 3 of which i could vary my role), you really had to start playing to the mechanics of each one, more so than just \"know your role\". So positioning, kiting away, played an important role, but so did knowing when to take a loss, take a break and changing your play times to vary the early day (Oceanic players vs America... you remember... that 280-400ms early days... vs those 30ms or better NA players... some classes had no chance due to latency) to try and get teams playing from your locale (i found for me, cracking the 3am mark for US in general (around 9-10pm our time) as a good idea, as you got the hardcore players, that were tired, drunks, stoners etc, but very few focused high rated teams from US playing) thus I could tell primarily by comparing my movement to the enemy melee and comparing their abilities like Sap/Charge/Aoe Radius gave me a general idea on the rough latency i was vsing, if i felt like i was kissing someone's ass but out of range, chances are they were in the US. Thus i had to play to that disadvantage and start focusing on things like GCD lockouts, creating 2-3second chances from pretending to clown around and trick someone into thinking i was overstretched, to instantly counter their \"HAHA\" moment. (Yes i had achieved Gladiator on 3 classes from BC, WotLK, MoP (skipped cata) for MoP my holy paladin was one of a handful. \n\nPoint regarding LoL other than nostalgia then? It's the background mechanics that are just as important, knowing how to utilize them for the maximum advantage is key unless you want to grind 50+ games a league from low tier upwards. Which, some times we all have bad days no matter what we do, i'll take it, i dont pretend to be ZOMG-LY every game with amaing KDA's, hell my wins though i achieved 3 out of 4 of them with an S, felt like my stats didnt reflect it (im aware mastery is a broken system, im yet to notice if ranked mastery has its own bell curve outside of normals, i'll keep people posted if i spot this and a Rioter doesn't confirm/deny anything) i felt like i still contributed well, i realized when i had hit the end of my snowball, i had slipped up thinking i'd keep snowballing, rather than just become useless, i'd focus on my amazing pushing powers. It worked, though my score was barely positive, in some games negative (fill.... why even have fill, its always a support spot, i dont mind... i chose secondary fills cause it felt like whenever i wanted a main role i was keen on, if i got it, i got a toxic game, so stopped trying to use my mains for all ranked and focused on other styles of play (Morg Supp) \n\nI'll take a look at the site in the morning when i play another ranked or two.\n\nHowever, considering it is relatively quick to level up, i think i may just do a power level, get Xin as first champ and just rock those 1ip runes up to level 20 giggling. Its mostly bots and scripts to level 20 anyways. Not that Riot cares, didnt think it'd be that hard to have an APM scanner or something for eratic commands / clicks from bots/scripts that dont match with players that are leveling (gangplanks that are constantly dancing with barrels etc, TF's with perfect card selections, top garens with their basic QWE spam when you get close and never go to base except when dead, buy up tank items, walk back into lane and repeat) \n\nIt's disappointing in a way as i know alot of the guys wanted to try and climb, i dont mind helping, i just think the best way to help ad save my frustrations is just level an alt account for the sake of low tier friends. Oceanic normals... are just too random.... maybe 1 in 5/6 are really fun, challenging and enjoyable with all players, unfortunately. Our teenagers/early 20's in oceanic are really not that fun a community to play with. Especially around the 330-6pm mark when suddenly the trolls come out, a death is always followed with \"U mad u bad\" etc crap. And trying to talk any sense results in the same repetitive comments.","replies":[]}]},{"poster":"Belrick","date":"2016-06-01T09:20:48.529+0000","up_votes":1,"down_votes":0,"body":"1. Hope that riots pathetic POS matchmaker puts the salty, feeding, first timer, troll champ picking, AFK player on THEIR team\n\nI am having 1 game in 10 thats actually being decided by honest play right now. Fuk rito","replies":[{"poster":"Devils Advocate","date":"2016-06-01T09:23:06.100+0000","up_votes":1,"down_votes":0,"body":"first 5Losses were due to toxic players mainly, 1 afk, 1 first timer, but i didnt mind him. Gotta start somewhere and he was honest and decent about it all. Not gunna blame my loss on him since it was prelims and i had no base MMR really.","replies":[]}]}]}