{"poster":"Bizarre Phantasm","date":"2019-08-02T09:10:00.182+0000","title":"RIOT VERÖFFENTLICHT EIN \"KYS\" EMOTE!!!","subforum":"Skin- & Champion-Konzepte","embed":{"description":"Captured with Lightshot","url":"https://prnt.sc/ond4s9","image":"https://image.prntscr.com/image/JAiVnTfJS-Wq2rZFsMGq6Q.jpg"},"up_votes":8,"down_votes":8,"body":"Hallo Beschwörer! \r\n\r\nIch habe mir gerade die emotes, skins, Chromas angeschaut, die man sich für Arcade Tokens erwerben kann.\r\n\r\nSoweit so gut, aber dann ist mir dieses Emote aufgefallen, welches eindeutig eine Anlehnung an das berüchtigte \"kys\" ist.\r\n\r\nOben im screenshot und im League Client könnt ihr euch selbst überzeugen und ich finde das sowas von dumm, dass es solche emotes geben muss.\r\n\r\nDas gleiche wie das Ezreal: \"GG - EZ\" Emote, es ist zwar meiner Meinung nach was cooles und eine coole Idee, aber so ein emote wie oben im screenshot gezeigt, geht einfach viel zu weit.\r\n\r\nSchreibt mal eure Meinung dazu, vielleicht habt Ihr ja eine andere Perspektive.\r\n\r\n~ Bizarre Phantasm","replies":[{"poster":"Staatsanwalt","date":"2019-08-02T09:15:57.087+0000","up_votes":7,"down_votes":0,"body":"Ich sehe das eher als ich krieg dich dran. Über den Hals streichen ist ja eher ne Morddrohung als jemanden zum Selbstmord aufzufordern.","replies":[{"poster":"Megamaexx","date":"2019-08-02T09:32:35.799+0000","up_votes":2,"down_votes":0,"body":"Jup, der Meinung bin ich auch. Für ein “kys“ müsste der jemanden nen Strick hinhalten.","replies":[]},{"poster":"Necromant","date":"2019-08-02T09:40:48.789+0000","up_votes":1,"down_votes":0,"body":"Ich war unschuldig Herr Staatsanwalt! :D","replies":[]}]},{"poster":"Enderized","date":"2019-08-02T09:31:23.556+0000","up_votes":3,"down_votes":0,"body":"Nein einfach nein.\n\nDas ist einfach eine Drohung zur Hinrichtung/zum Töten des jeweils anderen (was auf Pyke R nunmal zutrifft und der Tatsache, dass er eine Assassine ist) und 307%ig keine Aufforderung zum Selbstmord.\n\n\"Watch Yourself\" heißt ja, man solle auf sich aufpassen...","replies":[]},{"poster":"DrakoniaDRK","date":"2019-08-02T19:39:34.475+0000","up_votes":1,"down_votes":0,"body":"1. Sind es keine Arcade Tokens sondern Projekt\n\n2. Ist es kein Kys Emote sondern es heisst ganz klar \"Watch your self\"\n\n3. Wenn man die Hand von dem Emote mal ganz genau anschaut dann sieht man, dass die Handfläche OFFEN nach vorne zeigt. \n\n4. Das Emote sollte wohl eher darauf hindeuten, dass andere Spieler sich mal an der eigenen Nase packen sollen bevor sie wem anders die Schuld für alles geben, kurz gesagt kehr erst mal vor der eigenen Haustüre","replies":[]},{"poster":"You Got My Name","date":"2019-08-02T13:27:41.563+0000","up_votes":1,"down_votes":0,"body":"Was für ein unnötiger und provozierender Titel... gehört gleich gelöscht imo.","replies":[]},{"poster":"Angel Ayume","date":"2019-08-02T11:08:03.929+0000","up_votes":1,"down_votes":0,"body":"Ich glaube du interpretierst da mächtig zu viel rein und vorallem auch falsch. \nStaatsanwalt hat ja bereits erklärt, was die Geste tatsächlich bedeutet","replies":[]},{"poster":"OSaftKiller","date":"2019-08-02T10:36:17.036+0000","up_votes":1,"down_votes":0,"body":"Sind Emotes eigentlich für was anderes gut als zum bm? xD","replies":[{"poster":"Megamaexx","date":"2019-08-02T11:05:31.665+0000","up_votes":1,"down_votes":0,"body":"Man kann mit einigen auch seinem Team signalisieren, dass man zufrieden mit denen ist. Dieses Emote mit den 2 Poros zum Beispiel (ich hoffe, es gibt jetzt auch nur eins mit 2 Poros xD)\nDer grüßende Vel'Koz ist eigentlich auch ganz nett und kommt bei nem Gank immer gut^^","replies":[]}]}]}