{"poster":"CBK Blade","date":"2015-01-31T13:36:21.398+0000","title":"i won 2 out of 3 promorion games but my promotion games just got reset?","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"hey guys. i won 2 out of 3 promotion games to get out of bronze 4 with all very good scores but and the end of my last game as we destroyed the nexs my game crashed. when i got back into league my promotions just reset? is this a bug of some kind if so can someone fix it so i can be put into b3 where i should be thanks","replies":[{"poster":"HORSE OF FORCE","date":"2015-02-01T03:36:20.991+0000","up_votes":1,"down_votes":0,"body":"Weird. Very weird. If the nexus explodes and *then* your game crashes, everything should still be fine. The only thing I can think of is if you crashed a frame before the nexus exploded, therefore making the game think you were afk in the last part of the game, hence not giving you that win and not letting you promote.\n\nMake a support ticket and explain this to them. Only they can remedy something like this.\n\nPS. Keep in mind that they do **not** save replays of games.","replies":[{"poster":"CBK Blade","date":"2015-02-01T06:53:00.452+0000","up_votes":1,"down_votes":0,"body":"how do i make the support ticket, sorry im new to all this","replies":[{"poster":"HORSE OF FORCE","date":"2015-02-01T07:01:58.752+0000","up_votes":1,"down_votes":0,"body":"Visit this page: https://support.riotgames.com/hc/en-us/requests/new\n\nSelect, \"I have a question about League of Legends/Riot Games.\" Fill out the appropriate boxes and choose Technical - Game Crashes as the category.\n\nThey might ask you to provide logs from that game. Go into your Logs folder and identify which one was the game you played. The date and time are written on the filenames.","replies":[{"poster":"CBK Blade","date":"2015-02-01T07:17:48.738+0000","up_votes":1,"down_votes":0,"body":"thanks, another newb question lol where to find my logs folder?","replies":[{"poster":"HORSE OF FORCE","date":"2015-02-01T07:35:03.681+0000","up_votes":1,"down_votes":0,"body":"The default path is C:\\Riot Games\\League of Legends\\Logs.\n\nThe logs for the game you were in specifically are in the Game - R3d Logs folder.\n\nThey use the format YYYY-MM-DD, followed by HH-MM-SS.","replies":[{"poster":"CBK Blade","date":"2015-02-01T07:38:30.469+0000","up_votes":2,"down_votes":0,"body":"thanks mate been great help cheers","replies":[{"poster":"HORSE OF FORCE","date":"2015-02-01T09:13:04.180+0000","up_votes":1,"down_votes":0,"body":"No worries.\n\nBest of luck!","replies":[]}]}]}]}]}]}]}]}