{"poster":"Priestess Winda","date":"2017-11-15T05:03:49.121+0000","title":"Guia \"Runas Reforjadas\" Anivia","subforum":"Guias y consejos","up_votes":5,"down_votes":0,"body":"Hola a todos, soy FrostBird{{champion:34}}  y hoy les traigo unos peque&ntilde;os consejos para que Runas utilizar con Anivia en esta Pre-Season.\r\n\r\n_Peque&ntilde;a introduccion: S6 Platino V, y S7 Platino II. Main Anivia con 560k de Maestria y mas de 65% de Win Rate con el Personaje. http://www.lolskill.net/summoner/LAS/FrostBird/champions_\r\n\r\nAhora si a lo que vinimos, las paginas de runas y la explicacion.\r\n\r\nhttps://imgur.com/7vBFywK\r\n\r\nhttps://imgur.com/DF9R5Pa\r\n\r\nhttps://imgur.com/mPga5hI\r\n\r\nhttps://imgur.com/Xfccn5l\r\n\r\n______________________________\r\nKeyStones: \r\n\r\n* Cometa Arcano: _**La Runa mas general para Anivia.**_ S_i conectas tu Stun a un enemigo tenes el golpe asegurado. Durante el minuto 20 aproximadamente, en TFs Prolongadas podes llegar a invocar 2 o 3 cometas. La mejor runa cuanto tu oponente tiene 2 o mas tanks._\r\n\r\n* Electrocutar: _**El viejo Thunderlord pero mas poderoso.**_ _Esta Runa es especialmente efectiva cuando jugas contra asesinos, o champs debiles en general. Si tu oponente tiene menos de 2 Tanks Gracias a esta Runa lograras sacar de Tf a 1 campeon enemigo.\r\n_\r\n* Invocacion:Aery : _**Una Runa a la cual solo se le puede sacar el 50% de su potencial**_. _Esta Runa tiene un aire a Toque de la muerte Ignea pero para 1 solo enemigo, efectiva solo para la fase de lineas. La unica utilidad que le encontre es para Matchs contra Annie, Fizz o Kassadin. Si bien no me gusta se que hay gente que creen que es muy buena Runa.\r\n_\r\n\r\n* Cleptomancia: _**Mucho Oro en Early/Mid Game, pero basura en Late Game.**_ _El unico proposito de esta Runa es el PowerSpike que logras durante el minuto 15-20 de partida, Esto te permitira cerrar partidas mucho mas facil, pero tienes que tener en cuenta la perdida de da&ntilde;o con respecto a Electrocutar y Cometa Arcano. Sirve mucho en lanes que puedes presionar mucho (Malzahar-Kassadin) o Lanes donde sabes que el potencial de Roam del enemigo es mucho mejor que el tuyo (Leblanc-Katarina)\r\n_\r\n_______________________________\r\n\r\n  **_PENDIENTE RUNAS MENORES, EXPLICACION DETALLADA DE LAS PAGINAS DE RUNAS_**\r\n\r\n_______________________________\r\n\r\nLas nuevas runas son muy dinamicas, y ustedes pueden traer nuevas combinaciones que puedan ser muy poderosas.\r\n\r\nMuchas gracias por darle una vista a este post. Si tienes alguna sugerencia, o duda al respecto de lo que aqui dice comentalo ya que a pesar de mi experiencia yo tambien puedo equivocarme, o asi mismo podras contribuir y asi lograr algo mas completo para la gente que quiera aprender un poco mas\r\n\r\nSaludos{{champion:34}}","replies":[{"poster":"DarkMago","date":"2017-11-21T14:55:51.649+0000","up_votes":1,"down_votes":0,"body":"Hola uso a anivia en top casi siempre! en late game suelo tener 3000 de vida y 3800 0 4000 de mana y 500 o 600 de poder de habilidad(de items) que build me recomendas? para que pegue fuerte gracias por el aporte","replies":[{"poster":"Priestess Winda","date":"2017-11-22T14:52:09.380+0000","up_votes":1,"down_votes":0,"body":"Hola, no la suelo usar mucho en top, pero lo poco que la use, vs ad voy con el core standard(RoA~Liandry~Seraph) vs ap suelo utilizar una build defensiva (Abyssal~Morello~Liandry), depende el champ tambien, no es lo mismo un malphite o un rumble, La verdad casi cualquier item sirve en caso de ir top lo mejor es buscar el sustain de mana para dalir de linea a minuto 15, a diferencia de mid, creo que en top es mas facil jugar a roam~ aun asi podes armar Portal zzrot y splitpushear todo el dia, lo que mejor se adapte a vos supongo","replies":[]}]},{"poster":"Oblivion awaits","date":"2017-11-15T16:17:53.454+0000","up_votes":1,"down_votes":0,"body":"Genial. Gracias por arrojarme un poco de luz para Anivia.","replies":[]},{"poster":"Salvor","date":"2017-11-15T11:39:02.805+0000","up_votes":1,"down_votes":0,"body":"Gracias por el post!","replies":[]},{"poster":"MILFortune","date":"2017-11-15T06:28:46.403+0000","up_votes":1,"down_votes":0,"body":"Anivia después del pentakill\nhttps://i.imgur.com/L2DShtr.jpg","replies":[]}]}