{"poster":"Priestess Winda","date":"2019-04-19T03:22:09.041+0000","title":"Chau league, hasta que Riot arregle el desastre que esta haciendo","subforum":"Jugabilidad, balance y narrativa","up_votes":18,"down_votes":31,"body":"https://imgur.com/2HHeV0L\r\n\r\nNada eso nos vemos hasta que Riot arregle el desastre que esta haciendo con el balance.\r\n\r\nNo puede ser que usar \"X\" personaje le de una absurda ventaja a alguien plata(que no es smurf&lt;) sobre alguien que lleva 3 años en platino y acaba de llegar a diamante usando su champ OTP que lleva maineando hace 5 años. Y si alguien tan retrasado puede deletear asi, la verdad me niego a seguir jugando, un desperdicio, nos vemos cuando vea que las cosas se estabilizan un poco y sino bueno hasta nunca sera.\r\n\r\nSolia defender gran cosa de los cambios que por lo menos tenian sentido, pero sinceramente este año, mas especificamente estos ultimos 2 meses han sido un desastre cuanto menos en tema de balance.\r\n\r\nEn fin Adios{{champion:34}}","replies":[{"poster":"AMD Radeon RDNA","date":"2019-04-19T03:33:18.985+0000","up_votes":12,"down_votes":1,"body":"Yo creo que te tilteaste. Todos tenemos malas partidas. Sino, ve y mira las mias... Si, son normales pero me tocaron gente \"especial\" jajaja\n\nAun asi, me intriga que campeon es el que decis. \n\nTambien te puedo decir que, no te rindas, busca darle la vuelta a esa nueva dificultad","replies":[{"poster":"Priestess Winda","date":"2019-04-19T03:38:26.337+0000","up_votes":7,"down_votes":2,"body":"si, me tiltee pero no es una nueva dificultad por que si asi fuese intentaria mejorar (ejemplo cuando no sabia como ujgar anivia vs zed/yasuo/akali), pero si me decis que un personaje que tiene la mitad de farm que yo, no tiene kills, y tiene 1 nivel menos que yo, apreta R-W y me deletea entonces no es una dificultad por que no hay nada que pueda hacer para outplayear eso por que de esa kill hace snowball.\n\nA mi lo unico que me importa es mostrar a mi Anivia, cada dia mejoro un poco mas pero si usar un personaje vale mas que años de experiencia solo por apretar 2 botones, sinceramente no tiene ningun sesntido para mi jugar","replies":[{"poster":"Belceizz","date":"2019-04-19T15:04:10.718+0000","up_votes":5,"down_votes":0,"body":"Tal vez jugabas contra un campeón que le hacía counter a Anivia... O tal vez puede ser una persona que usa scripts... O casualidad.\n\nTambién me ha pasado.","replies":[{"poster":"AMD Radeon RDNA","date":"2019-04-19T16:17:17.272+0000","up_votes":2,"down_votes":1,"body":"Para un OTP o main XXXXX, \"\"\"\"\"\"\"no existe\"\"\"\"\"\"\"\" los counter (si, pero aprender a lidear con ellos y al final les ganas). \n\nElla es diamante, asi que un plata (con todo respeto y esta exagerdamente demostrado) no le puede ganar. Siento mas el uso de scripts","replies":[]}]},{"poster":"AMD Radeon RDNA","date":"2019-04-19T05:03:26.863+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=FrostBird,realm=LAS,application-id=xQmJPO8F,discussion-id=wb3ssT6O,comment-id=00000000,timestamp=2019-04-19T03:38:26.337+0000)\n>\n> si, me tiltee pero no es una nueva dificultad por que si asi fuese intentaria mejorar (ejemplo cuando no sabia como ujgar anivia vs zed/yasuo/akali), pero si me decis que un personaje que tiene la mitad de farm que yo, no tiene kills, y tiene 1 nivel menos que yo, apreta R-W y me deletea entonces no es una dificultad por que no hay nada que pueda hacer para outplayear eso por que de esa kill hace snowball.\n> \n> A mi lo unico que me importa es mostrar a mi Anivia, cada dia mejoro un poco mas pero si usar un personaje vale mas que años de experiencia solo por apretar 2 botones, sinceramente no tiene ningun sesntido para mi jugar\n\nSe lo bien que amas tu anivia pero que champ es?","replies":[{"poster":"Gonk","date":"2019-04-21T17:49:36.862+0000","up_votes":1,"down_votes":0,"body":"Dejo ward porque me da intriga","replies":[]}]},{"poster":"ReyIlluminati","date":"2019-04-19T16:58:01.480+0000","up_votes":2,"down_votes":0,"body":"Te entiendo, a mi tambien me tiltean los morde mid, le podes llevar niveles de diferencia y el tipo te mete w, la 3ra q y r y ya fuiste\n{{champion:82}}","replies":[{"poster":"teby159","date":"2019-04-20T02:04:52.700+0000","up_votes":1,"down_votes":0,"body":"Jaja pasa pasa... Pero lo deleteas con{{champion:103}}","replies":[]}]}]}]},{"poster":"Entre Canibales","date":"2019-04-19T06:25:58.891+0000","up_votes":6,"down_votes":0,"body":"A mí también me parece medio injusto que riot haga cambios innecesarios como bufear a garen o el reciente rework de urgot pls no sé que mierda se fumaron pero bue a saber que champ te causo tanto problema ahora lo más problable como es semana santa vayan a salir más hdps en ranked a joder aunque ya tomaste tu decisión dale que al final solo te tilteaste{{summoner:3}}","replies":[]},{"poster":"bow down","date":"2019-04-19T04:30:04.515+0000","up_votes":4,"down_votes":0,"body":"Cual sería ese champ???","replies":[]},{"poster":"Skuffelse","date":"2019-04-19T16:29:02.486+0000","up_votes":4,"down_votes":4,"body":"Eres patético bro, mejor dejas el juego(si crees que por llegar a diamante no te puede ganar un plata) aun sí fuese el caso de desbalanceo así es el juego en constante cambio todos tenemos nuestros tilteos sobretodo los hdp que se esfuerzan en molestarte aun más en las partidas,la comunidad actual es una basura","replies":[{"poster":"Priestess Winda","date":"2019-04-19T17:47:59.494+0000","up_votes":3,"down_votes":0,"body":"No es que no me puedan ganar, hay gente bronce 1000 veces mejor mecanicamente que yo, pero no voy a tolerar que se insulten 5 años de conocimientos por que un retrasado mental apreta 1 boton y listo","replies":[]}]},{"poster":"pepeganga","date":"2019-04-19T17:55:33.356+0000","up_votes":2,"down_votes":0,"body":"ah veo que no jugas top, por lo tanto no te toca jugar contra esta cosa {{champion:75}}  lo podes tener bajo torre matarlo 1 o 2 veces pero en la que te fuiste 1 segundo a ayudar a tu equipo ese bicho con un brillo y su robo de vida te caga a palos, si les vas con tu equipo es pollo pero igual es frustrante jugarle bien en la linea y aun así solo sacando cargas y con su robo de vida pueda ser mas útil xd \nah si yo uso {{champion:98}} se que no es un top fuerte pero bueno sigue siendo injusto xd","replies":[{"poster":"Xerms2","date":"2019-04-21T11:15:26.546+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=pepeganga,realm=LAS,application-id=xQmJPO8F,discussion-id=wb3ssT6O,comment-id=0013,timestamp=2019-04-19T17:55:33.356+0000)\n>\n> ah veo que no jugas top, por lo tanto no te toca jugar contra esta cosa {{champion:75}}  lo podes tener bajo torre matarlo 1 o 2 veces pero en la que te fuiste 1 segundo a ayudar a tu equipo ese bicho con un brillo y su robo de vida te caga a palos, si les vas con tu equipo es pollo pero igual es frustrante jugarle bien en la linea y aun así solo sacando cargas y con su robo de vida pueda ser mas útil xd \n> ah si yo uso {{champion:98}} se que no es un top fuerte pero bueno sigue siendo injusto xd\n\nDe acuerdo en esta. Soy main top. No puede ser que yo jugando con farm casi perfecto, tiempos de backeo buenos, tirando primera torre, con kills, termine perdiendo contra un Nasus {{champion:75}}  que sin farm y sin kills se la pasa stackeando en la JG. Te clava una Q con brillo y te saca la mitad de la vida (o más).\nTe creo un {{champion:45}} Veigar que escala y tiene mucho AP, pero Veigar sin alguien que lo cuide, no sirve, no tiene vida pero si tiene algo de CC y mucho daño.\nNasus tiene todo, stackea, te ralentiza tanto que pareces una babosa en coma 4, y te deletea SIN USAR LA R, pero no es solo eso porque ahi iguala a un full Veigar, Nasus además de eso, es DURO, donde se arma Aliento del agónico te arruina, es inmatable. No lo alcanzaba ni con botas de rapidez y Placa del Hombre Muerto. No jodamos, Nasus está roto pero roto ROTO. No puede ser que cualquier salame que pickea un Nasus te termine partiendo en 2 (por más tanque que te hagas) y se haga 1v9\nEl buff a Garen no es malo porque es solo a su W, y el buff es por culpa de Morgana que te clava una Q y te vas a tomar un café que seguis inmovilizado, y por Zoe que te adormecia a cada rato.","replies":[{"poster":"1kiii","date":"2019-04-21T16:52:38.412+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Xerms2,realm=LAS,application-id=xQmJPO8F,discussion-id=wb3ssT6O,comment-id=00130000,timestamp=2019-04-21T11:15:26.546+0000)\n>\n> De acuerdo en esta. Soy main top. No puede ser que yo jugando con farm casi perfecto, tiempos de backeo buenos, tirando primera torre, con kills, termine perdiendo contra un Nasus {{champion:75}}  que sin farm y sin kills se la pasa stackeando en la JG. Te clava una Q con brillo y te saca la mitad de la vida (o más).\n> Te creo un {{champion:45}} Veigar que escala y tiene mucho AP, pero Veigar sin alguien que lo cuide, no sirve, no tiene vida pero si tiene algo de CC y mucho daño.\n> Nasus tiene todo, stackea, te ralentiza tanto que pareces una babosa en coma 4, y te deletea SIN USAR LA R, pero no es solo eso porque ahi iguala a un full Veigar, Nasus además de eso, es DURO, donde se arma Aliento del agónico te arruina, es inmatable. No lo alcanzaba ni con botas de rapidez y Placa del Hombre Muerto. No jodamos, Nasus está roto pero roto ROTO. No puede ser que cualquier salame que pickea un Nasus te termine partiendo en 2 (por más tanque que te hagas) y se haga 1v9\n> El buff a Garen no es malo porque es solo a su W, y el buff es por culpa de Morgana que te clava una Q y te vas a tomar un café que seguis inmovilizado, y por Zoe que te adormecia a cada rato.\n\nzoe osea te duerme y te tira rayo pero mirale veigar contra zoe gana veigar si tiene poder de habilidad  s izoe tiene poder de habilidad tiene el rayo al maximo te mata es como e y q ya estas muerto","replies":[]}]},{"poster":"1kiii","date":"2019-04-21T16:46:02.773+0000","up_votes":1,"down_votes":0,"body":"{{champion:75}}  cuando dijiste bicho se me abre lol  con musica super epica{{item:3460}}  {{sticker:sg-miss-fortune}}","replies":[{"poster":"1kiii","date":"2019-04-21T16:49:43.830+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=1kiii,realm=LAS,application-id=xQmJPO8F,discussion-id=wb3ssT6O,comment-id=00130001,timestamp=2019-04-21T16:46:02.773+0000)\n>\n> {{champion:75}}  cuando dijiste bicho se me abre lol  con musica super epica{{item:3460}}  {{sticker:sg-miss-fortune}}","replies":[]}]}]},{"poster":"Balalala","date":"2019-04-19T16:27:41.661+0000","up_votes":2,"down_votes":0,"body":". ","replies":[{"poster":"Priestess Winda","date":"2019-04-19T17:37:23.333+0000","up_votes":2,"down_votes":0,"body":"que comes que adivinas (?","replies":[{"poster":"Balalala","date":"2019-04-22T04:33:04.627+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FrostBird,realm=LAS,application-id=xQmJPO8F,discussion-id=wb3ssT6O,comment-id=000d0000,timestamp=2019-04-19T17:37:23.333+0000)\n>\n> que comes que adivinas (?\n\nFácil años de experiencia en este jueguito y a veces veo el stream de un mono que hace dúo con otp diana","replies":[]}]}]},{"poster":"triple CERO","date":"2019-04-19T18:47:14.563+0000","up_votes":3,"down_votes":1,"body":"Vamos por puntos, para que siendo diamante te emparejen con un plata, tuvo que haber sido una partida normal, asi que descartamos las clasificatorias.\n\nY en la unica partida normal que vi en tu historial que fuiste contra un plata, fue en una normal, que jugaste contra una akali y vos yasuo.\n\nTe gano, jugo mejor que vos, y ya esta, cual fue el error?, ni uno.\n\nY... te tengo una noticia, hoy en dia esta bastante devalorado diamante, sin ir mas lejos, podes buscar streamers como FitGeek, TiniChilli, Elnarigon etc etc, todos diamantes 4.\n\nY que tiene que ver eso?, ves sus partidas, y son todos malisimos, no saben ni siquiera ponerse runas, los que juegan laners?, al min 20, tienen 100 CS, estan 100 debajo de la media.\n\nHoy en dia, cualquiera que cuenta con tiempo, sube, y con duo, como hacen ellos, se buscan alguien mejor y los carrea simplemente.\n\nSaludos.","replies":[]},{"poster":"TheDarkWeaver ","date":"2019-04-19T13:28:14.746+0000","up_votes":1,"down_votes":5,"body":"El balance es lo de menos, enserio te quejas por eso?\nAnivia es uno de los personajes más difíciles de usar porque tenes que tener un posicionamiento casi perfecto contra un asesino, anivia requiere muchísimas horas para masterizar, no puede ser que usando un champ tan difícil te quejes de los fáciles porque también los podes usar y con más razón si sos OTP tenes que saber como jugar contra tus counters.","replies":[{"poster":"Priestess Winda","date":"2019-04-19T14:31:52.779+0000","up_votes":2,"down_votes":0,"body":"No me quejo de los champs faciles, me molesta que tanto tiempo y el constante aprendizaje terminen valiendo nada por que un enemigo aprete 2 botones.\n\nA mi no me molesta que un master Yi se me tire y de 5 basicos me mate, lo que me molesta es que una Kayle me de basico + E y me mate.\n\nNo me molesta que Yasuo me outplayee, me molesta que venga Akali aprete 2 R bajo torre y salga feliz de la vida. (aunque para este caso en especifico Akali al menos necesitaria tener ventaja de oro por sobre mi)","replies":[]}]},{"poster":"SoulShillen","date":"2019-04-19T13:35:12.799+0000","up_votes":3,"down_votes":2,"body":"Bueeeee tampoco podés vivir usando a anivia para todo flaco... Hay casi 200 champs, algunos van a ser counter obviamente...\nPD: Y si con anivia te están rompiendo el orto aprende a usar otros campeones amiguero no sé puede vivir jugando con uno, si matas a todos con anivia entonces anivia sería un personaje roto...","replies":[{"poster":"Priestess Winda","date":"2019-04-19T14:26:24.697+0000","up_votes":2,"down_votes":1,"body":"Si mato a todos con Anivia es por que mi conocimiento del personaje es muy superior al conocimiento de mis oponentes, si juego solo Anivia es por que ningun otro personaje me gusta, y si me ganan usando picks que ni si quiera son Counters entonces hay un problema con el juego ya que a diferencia de otros champs, la dificultad de Anivia viene de entender a los enemigos y no de masterizar su kit de habilidades. Por eso cambios pequeños a items como Sablepistola Hextech o Eco de Luden pueden cambiar completamente el como jugas contra ciertos personajes.","replies":[]}]},{"poster":"NAIM25","date":"2019-04-19T16:41:08.193+0000","up_votes":2,"down_votes":1,"body":"Como me encanta cuando gente como vos pone esto en los foros, hay me voy me voy el lol esta muriendo no me gusta como esta el lol, siempre quejando se y que despues de igual manera vuelven, osea capo no me cuentes tu vida, ala gran mayoria de la gente de los foros no le importa lo que vayas a hacer,osea si venis a decir esto mejor anda a publicar lo en otro lado por que ya tenemos suficiente con que gente como vos venga a quejarse del que juego esta muriendo o otras cosas que son o no tienen sentido \n\nTE DESEO UN BUEN DIA SALUDOS Y BUENAS NOCHES\nBESOS {{champion:222}} {{sticker:slayer-jinx-catface}} \nUn main adc","replies":[]},{"poster":"Se Gana Gile Qlo","date":"2019-04-22T12:11:36.804+0000","up_votes":1,"down_votes":0,"body":"despues del cole y tomarse su chocolatada, lo va a instalar. tranki","replies":[]},{"poster":"Senert","date":"2019-04-22T01:21:44.860+0000","up_votes":1,"down_votes":0,"body":"Vas a volver en menos de un mes, llorón {{sticker:leblanc-funny}}","replies":[]},{"poster":"MathiasAngel","date":"2019-04-21T02:10:56.521+0000","up_votes":1,"down_votes":0,"body":"Chao ctm uwu &lt;3{{champion:103}}","replies":[]},{"poster":"Dat Butterfly","date":"2019-04-20T20:58:53.994+0000","up_votes":1,"down_votes":0,"body":"AAAAADIOOOOO... \n\nVUELVA PRONTO... ESO BAI","replies":[]},{"poster":"KurokoCS","date":"2019-04-19T22:26:38.791+0000","up_votes":1,"down_votes":0,"body":"Dejas el juego solo por eso? Acaso no conoces algo llamado suerte? Si te gano quiere decir que lo suvestimaste mucho y jugaste mal, en fin a todos nos pasa en cualquier juego y si todos se comportarán como tu nadie jugaría en su vida xd, y lo de que un campeón este más roto que otro es obvio ya que haci se vulvé a jugar con esos campeones y ni siquiera es que dure mucho ya que tocan siempre a muchos héroes tanto haciandolos más fuertes o más débiles, a lo mejor maxean al tuyo solo sigue y no te piques xd  PD: buen juego","replies":[{"poster":"DaveTk","date":"2019-04-20T20:57:06.346+0000","up_votes":1,"down_votes":0,"body":"Una kuro salvaje apareció owo","replies":[]}]},{"poster":"Francisc0z","date":"2019-04-20T18:01:27.766+0000","up_votes":1,"down_votes":0,"body":"Cada letra de este post te hace ver mas triste, ojala poder reportar por estupidez.","replies":[]},{"poster":"Marco VdNxD","date":"2019-04-20T16:39:46.801+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FrostBird,realm=LAS,application-id=xQmJPO8F,discussion-id=wb3ssT6O,comment-id=,timestamp=2019-04-19T03:22:09.041+0000)\n>\n> https://imgur.com/2HHeV0L\n> \n> Nada eso nos vemos hasta que Riot arregle el desastre que esta haciendo con el balance.\n> \n> No puede ser que usar \"X\" personaje le de una absurda ventaja a alguien plata(que no es smurf&lt;) sobre alguien que lleva 3 años en platino y acaba de llegar a diamante usando su champ OTP que lleva maineando hace 5 años. Y si alguien tan retrasado puede deletear asi, la verdad me niego a seguir jugando, un desperdicio, nos vemos cuando vea que las cosas se estabilizan un poco y sino bueno hasta nunca sera.\n> \n> Solia defender gran cosa de los cambios que por lo menos tenian sentido, pero sinceramente este año, mas especificamente estos ultimos 2 meses han sido un desastre cuanto menos en tema de balance.\n> \n> En fin Adios{{champion:34}}\n\nSi te vas hacelo en silencio y te ahorras escribir esto que nada va ah cambiar, como si riot leyera lo que aquí se escribe por dios. Es como creer que revisan los report que hacemos justamente","replies":[]},{"poster":"Darkleyn","date":"2019-04-20T16:33:07.072+0000","up_votes":1,"down_votes":0,"body":"Yo solo veo a alguien llorando, que querés que te diga","replies":[]},{"poster":"LegendsNeverDie1","date":"2019-04-20T15:48:46.364+0000","up_votes":1,"down_votes":0,"body":"Miren es así de fácil si les gusta un juego les gusta todo sin importar los cambios y puede ser que se Allan enfrentado a alguien plata que esté siendo elobusteado así que si no les gusta los cambios que hacen háganla cencilla y dejen de jugar al juego que por qué se valla 1 riot no va a cambiar","replies":[]},{"poster":"waflex","date":"2019-04-20T15:41:43.099+0000","up_votes":1,"down_votes":0,"body":"Mira estoy en plata, pero aun asi se que al llegar a ligas altas dejas de usar tus main y comienzas a regirte mas por los campeones que estan en el meta, no se si ya alguien habra comentado esto, pero no me tomare la molestia de leer todo lo comentado, si prefieres salir del juego es una buena decision si quieres \"relajarte\", cambiar aires y esas cosas, pero no lo expongas como si fuese lo peor del mundo que un campeon te deletee, en si es lo mas normal, y el balanceo en lol nunca ha existido, si bien el equipo de devs lo intenta, es dificil crear un balanceo estable entre tanto campeón y tanta \"mecánica\" asi que secate las {{item:3070}} y retirarse callado y tranquilo sin irte tilteado{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"TSupercraft","date":"2019-04-20T15:17:58.208+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FrostBird,realm=LAS,application-id=xQmJPO8F,discussion-id=wb3ssT6O,comment-id=,timestamp=2019-04-19T03:22:09.041+0000)\n>\n> https://imgur.com/2HHeV0L\n> \n> Nada eso nos vemos hasta que Riot arregle el desastre que esta haciendo con el balance.\n> \n> No puede ser que usar \"X\" personaje le de una absurda ventaja a alguien plata(que no es smurf&lt;) sobre alguien que lleva 3 años en platino y acaba de llegar a diamante usando su champ OTP que lleva maineando hace 5 años. Y si alguien tan retrasado puede deletear asi, la verdad me niego a seguir jugando, un desperdicio, nos vemos cuando vea que las cosas se estabilizan un poco y sino bueno hasta nunca sera.\n> \n> Solia defender gran cosa de los cambios que por lo menos tenian sentido, pero sinceramente este año, mas especificamente estos ultimos 2 meses han sido un desastre cuanto menos en tema de balance.\n> \n> En fin Adios{{champion:34}}\n\nAmigo creo tu problema es de que eres otp y por lo general significa que maineas solo un campeon bien y a pesar de que lo juegues perfecto la partida o tu linea no siemprr dependera solo de ti sino tambien de tu equipo(sobre todo el jg enemigo o aliado) ya que si algun aliado va a ayudar a tu linea y le da una kill al enemigo o algun aliado hace un mal call , se le puede dar mucha ventaja de oro al enemigo , pero sinceramente creo que tu problema es que juegas bien un solo campeon ya que eres OTP  pero al momento de enfrentarte a  un counter de tu champ te puedes complicar o perder linea por mas que sepas jugar contra el ya que mas que seguro el otro jugador ya sabe jugar contra tu champ , a mi eso me paso demasiado cuando jugaba Ahri , me tocaba un Zed o un Talon y me omeshoteaban como querian pero empeze a jugar mas champs para cuando me toquen counters de mi main poder jugar otra cosa y poder tener mas ventaja, en conclusion intenta jugar otros champs y intenta mainearlos y si te tilteas tomate un descanso o juega una normal pero no te la tomes encerio tomatela a broma y destilteate luego podras seguir rankeando y mejorando un saludo y espero esto te sirva {{champion:103}}","replies":[]},{"poster":"MiPresidenteGato","date":"2019-04-20T14:07:10.873+0000","up_votes":1,"down_votes":0,"body":"Ese tilteo si se puede ver jaja pase por eso hace tiempo y aprendí que es un juego injusto, por eso deje de rankear y empeze a jugar con amigos solo para divertirme, porque si seguía así no iba a llegar mucho más lejos e iba a vivir enojado. Otro caso es cuando tenes tu main, el champ le le echaste muchas horas para mejorar o perfecciónar y riot lo deja en el pozo,por algún nerf o cambio de alguna runa, es realmente frustrante. Sumado a todo eso hay que tener en cuenta que la comunidad de lol es la más tóxica de todos los juegos actualmente, por lo que le suma otro grado más de fatiga o molestia al tratar de subir de elo. Por eso mi consejo es tomarte el lol con tranquilidad y jugar para divertirte, si querés ser bueno deberías buscar juegos más justos y que no tengas que depender del equipo también..","replies":[]},{"poster":"Kàtarina","date":"2019-04-20T13:10:57.303+0000","up_votes":1,"down_votes":0,"body":"Chau, hasta luego! La gente no acepta la pérdida de una partida. No siempre te tocaran gente mala, siempre hay alguien mejor. De la cual en ves de tiltearte tenes que mejorar y ver de tus errores.","replies":[]},{"poster":"Patoviich","date":"2019-04-20T12:52:48.681+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FrostBird,realm=LAS,application-id=xQmJPO8F,discussion-id=wb3ssT6O,comment-id=,timestamp=2019-04-19T03:22:09.041+0000)\n>\n> https://imgur.com/2HHeV0L\n> \n> Nada eso nos vemos hasta que Riot arregle el desastre que esta haciendo con el balance.\n> \n> No puede ser que usar \"X\" personaje le de una absurda ventaja a alguien plata(que no es smurf&lt;) sobre alguien que lleva 3 años en platino y acaba de llegar a diamante usando su champ OTP que lleva maineando hace 5 años. Y si alguien tan retrasado puede deletear asi, la verdad me niego a seguir jugando, un desperdicio, nos vemos cuando vea que las cosas se estabilizan un poco y sino bueno hasta nunca sera.\n> \n> Solia defender gran cosa de los cambios que por lo menos tenian sentido, pero sinceramente este año, mas especificamente estos ultimos 2 meses han sido un desastre cuanto menos en tema de balance.\n> \n> En fin Adios{{champion:34}}\n\nHola soy main diana xd","replies":[]},{"poster":"Marfacris","date":"2019-04-20T11:04:13.726+0000","up_votes":1,"down_votes":0,"body":"Amigo los plata tenemos mecánicas ocultas y suelen salir de ves en cuando, no tendría que ser algo muy malo.","replies":[]},{"poster":"LunaAlive","date":"2019-04-20T10:12:04.339+0000","up_votes":1,"down_votes":0,"body":"Si diana no tuviese ese daño y esas estadísticas estaría peor que ryze ,su gameplay no le beneficia en nada,es un mago kamikaze,una lástima que te hayas frustrado pero desde mi punto de vista hay campeones  más útiles y fuertes que la gente explota fácilmente .Diana esta condenada a ser tier5.","replies":[]},{"poster":"Exospartan","date":"2019-04-20T08:34:35.963+0000","up_votes":1,"down_votes":0,"body":"Ese es mi mismo problema pero con {{champion:238}} me parece un campeón totalmente desbalanceado, por ejemplo en una de mis partidas estaba jugando {{champion:127}} y ya había vuelto a base a comprar, el zed contra el que iba no habia recaleado, solamente tenía su objeto inicial, así que pense que era la mejor oportunidad para iniciar, pero así y todo me ganó, y es solamente un ejemplo, todo el tiempo me toca contra zeds que con solo tirar su combo a lvl 6 te oneshotean mientras que yo con mis magos, personajes que juego siempre, no puedo hacer nada para evitarlo más que jugar toda la partiba bajo torre si es que encima no te divean y se escapan, y no hablemos de {{champion:91}}","replies":[]},{"poster":"Greniinjja","date":"2019-04-20T06:34:56.024+0000","up_votes":1,"down_votes":0,"body":"Leí un par de comentarios y me parece que no tiene nada que ver qué tengas tanto conocimiento en el campeón y bla bla , quedaste mal parado contra tu counter ya está man  y por más que apreté una letra ya está ps a mí me pasó varias veces lo mismo y no me puse a llorar en el foro porq hay champs más roto que el mío","replies":[]},{"poster":"Deigex","date":"2019-04-20T04:23:24.720+0000","up_votes":1,"down_votes":0,"body":"Si te gano diana siendo un champ con este WR/PICK RATE: \"47.42%/1.63%\"  y siendo Tier 5 en silver dejaste mucho que desear. Si subiste jugando anivia hasta diamond y perdes contra un silver en linea que no es smurf cuando deberias ser mil veces mejor en macro y mecanicamente, mas siendo OTP lo unico que se lastimo fue tu ego y por eso lo desinstalas no por balance.","replies":[]},{"poster":"gaming of retro","date":"2019-04-20T03:15:15.554+0000","up_votes":1,"down_votes":0,"body":"El problema es que lo canpeones esyan echo para un estilo de juego si juegas anivia tiene un muro un buen daño y puedes jugar pasivo los asesinos estan echos para matar porque tienen que sacar ventaja sino se quedarian obsoletos ademas al no tener un stun y tu siendo un capeon como anivia con un muro un stun y una pasiva que te revive y si es morde lo que mayomente ase es que se cura si es otro canpeon no se me ocurre  otro asesino de daño explosivo auque morde no ase tanto daño de solo esa abilidad","replies":[{"poster":"gaming of retro","date":"2019-04-20T03:16:53.485+0000","up_votes":1,"down_votes":0,"body":"Y si es diana de primero baneala de segundo es poco jugada y de tercero es tu couter porque puede saltar tu muro","replies":[]}]},{"poster":"Azhassik","date":"2019-04-19T23:45:13.225+0000","up_votes":1,"down_votes":0,"body":"Amo como {{champion:131}} tiltea a varias personas pero es un campeón muy fuerte...","replies":[{"poster":"Priestess Winda","date":"2019-04-20T00:57:55.617+0000","up_votes":1,"down_votes":0,"body":"Que comes que adivinas? numero 2\n\n{{sticker:sg-ahri-1}}","replies":[]}]}]}