{"poster":"Jonathan1889","date":"2016-03-26T13:57:43.810+0000","title":"Ist Overwolf ein Hack?","subforum":"Allgemeiner Chat","up_votes":0,"down_votes":3,"body":"Hallo community.\r\nMein LoL Acc vor einem dreivirtel Jahr permanent Gebannt und als Grund wurde angegeben das ich Drittprogramme oder Hacks Benutzt habe und dadurch das Spiel f&uuml;r meine Gegner unfair w&auml;re.\r\nDas einzige Programm das ich jemals bei LoL benutzt habe ist Overwolf was lediglich ingame anzeigt wer im Moment in Teamspeak 3 redet oder schreibt.\r\n\r\nIch habe sofort als ich es bemerkt habe das mein Acc gebannt wurde den Support angeschrieben. Nach einem Monat von Automatischen- und Abwimmelnachrichten wurde ich zu &quot;Experten&quot; weitergeleitet die mir keine Antwort auf meine fragen wie beispielsweise welche Hacks ich den benutzt habe soll oder ob nicht jemand meinen Acc gehackt haben k&ouml;nne und Drittprogramme benutzt haben k&ouml;nne. Dieses Experten Team hat mir immer das gleiche gesagt: Diese strafe sei gerecht und wir d&uuml;rfen dir keine weiteren Informationen geben. Ich habe nach zirka 3 Monaten aufgegeben.\r\n\r\nIch habe sehr viel Geld in diese spiel investiert und spiele seit Anfang Session 2.\r\n\r\nDaher frage ich euch Z&auml;hlt Overwolf als Drittprogramm oder Hack der das spiel f&uuml;r meine Mitspieler und Gegner unfair macht und ist diese Strafe nach dem Riot Support gerecht?","replies":[{"poster":"Meitser","date":"2016-03-26T14:34:12.957+0000","up_votes":2,"down_votes":1,"body":"Overwolf zählt NICHT als Dritt-oder Hackprogramm. Es hilft dir nicht dabei, dass spiel eher zu gewinnen. Es gibt in Overwolf Programme für LoL, die allerdings nur Replay-systeme der letzten 40 sekunden sind, oder solche seiten lolskill.net . An diesem Programm ist nichts verwerflich da slebst Challenger spieler es benutzen und sogar berühmte Youtuber wie Brofresco. Ich bin Stark dafür dass dein Account wieder entsperrt wird!\n\nMfG. MeitserChaos\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Valadilené","date":"2016-03-26T14:42:00.680+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MeitserChaos,realm=EUW,application-id=YnZkMR0R,discussion-id=0G1M7kFb,comment-id=0001,timestamp=2016-03-26T14:34:12.957+0000)\n>\n> ... Ich bin Stark dafür dass dein Account wieder entsperrt wird!...\n\nWarum? Wenn dir ein Häftling sagt, dass er unschuldig ist, bist du dann auch dafür, dass er wieder freigelassen wird? Wir kennen weder das genaue Verhalten, noch den genauen Wortlaut der Riot-Mail. Insofern wäre ich mit solchen Aussagen vorsichtig.\n\nVala","replies":[{"poster":"Meitser","date":"2016-03-26T14:49:25.140+0000","up_votes":1,"down_votes":0,"body":"des weiteren, sehe ich dass er aktuelle spiele hat","replies":[{"poster":"Jonathan1889","date":"2016-03-26T15:16:08.636+0000","up_votes":1,"down_votes":0,"body":"ich habe das letzte mal am 8.6.2015 auf diesem Acc gespielt.","replies":[{"poster":"Meitser","date":"2016-03-26T15:24:12.116+0000","up_votes":1,"down_votes":0,"body":"da steht dass du zum letzten mal vor 3 tagen auf dem acc gespielt hast *-*","replies":[{"poster":"Jonathan1889","date":"2016-03-26T15:54:36.311+0000","up_votes":1,"down_votes":0,"body":"schau das ist der verlauf den ich sehe: http://prntscr.com/akavux","replies":[]},{"poster":"Jonathan1889","date":"2016-03-26T15:49:19.875+0000","up_votes":1,"down_votes":0,"body":"das kann nicht sein. Kannst du mir einen screen schicken?","replies":[]}]}]}]},{"poster":"Jonathan1889","date":"2016-03-26T15:15:17.772+0000","up_votes":1,"down_votes":0,"body":"ich kann gerne die Support Tickets usw auch schicken wenn du das möchtest ich habe mich stehts bemüht angemessen zu spielen und ich habe alle dinge die ich an den Support geschrieben habe in einen höflichen ton geschrieben wenn du das meintest im vorherigen Kommentar.\nWie soll ich meinen Acc vor Hacker schützen?\nMeine Daten gebe ich niemandem da diese für mich viel zu heilig waren ich habe sehr viel Geld darein gesteckt (für mein Verhältnis viel) wiso sollte ich das aufs spiel setzen?","replies":[]},{"poster":"Meitser","date":"2016-03-26T14:45:15.715+0000","up_votes":1,"down_votes":0,"body":"nach den infos wie ich sie jetzt habe, und wenn ich auf seinen acc schaue, bezweifle ich dass er schon viel geld für den ACC ausgegeben hat. Ich ziehe die aussage zurück. zumindest die, dass sein account sofort entsperrt werden sollte","replies":[]}]}]},{"poster":"Neamhoilte","date":"2016-03-26T14:40:27.830+0000","up_votes":1,"down_votes":0,"body":"Overwolf hatte mal Jungletimer integriert, bevor Riot sie selbst ins Spiel implementiert hatte. \nIst aber lange her. Von daher...","replies":[]},{"poster":"Valadilené","date":"2016-03-26T14:34:14.408+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nnein, Overwolf ist kein Hack.\n\nAls dein Account gebannt wurde, wurde NICHT angegeben, dass DU Drittprogramme genutzt hast, sondern dass beim Benutzen \"deines Accounts\" so etwas festgestellt wurde. Das kann genauso gut der Rechner deines Kumpels gewesen sein, dem du mal deine Daten gegeben hast oder du selbst von dort aus gespielt hast. Oder auch eine fremde Person, die sich deine Daten, auf welche Weise auch immer, erschlichen hat.\n\nTja in Zukunft halt noch besser auf deine Daten, deinen Rechner und dein Verhalten allgemein aufpassen.\n\nVala","replies":[]},{"poster":"TerrorRaven","date":"2016-03-26T14:29:50.719+0000","up_votes":1,"down_votes":0,"body":"Kommt darauf an, welche Erweiterungen du benutzt. Programme, die das Interface In-Game verändern, sind sehr grenzwertig. Overwolf bzw. die Erweiterung LoLWiz wurde zwar von Riot angeblich zugelassen, da sowas aber wie gesagt grenzwertig ist, kann ich keine Gewähr dafür geben.","replies":[{"poster":"Jonathan1889","date":"2016-03-26T14:34:02.034+0000","up_votes":1,"down_votes":0,"body":"ich habe keine adonds für overwolf benutzt nur die standard funktion das man sieht wer grade redet","replies":[]}]}]}