{"poster":"Sombremo","date":"2017-05-01T03:53:23.760+0000","title":"Any champions like Azir or Zed?!","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"I&#039;m looking to pick up someone new in around the top/ mid lanes or maybe jungle, someone who has a lot of outplay potential, can carry games looks really cool and possibly has a high skill ceiling. Any help is appreciated :)","replies":[{"poster":"MagicFlyingLlama","date":"2017-05-01T04:04:33.781+0000","up_votes":1,"down_votes":0,"body":"lv28..\n\nI highly suggest not picking a champion with a high skill ceiling. *Especially Azir*. He is brutally difficult and punishes mistakes, good azir players are very rare in lower elos.\n\nThere is a strange misconception that playing high-skill champions makes the player highly skilled, this is why you see so many yasuos, zeds ect feeding on spectacular levels.","replies":[{"poster":"Sombremo","date":"2017-05-01T04:27:24.125+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MagicFlyingLlama,realm=NA,application-id=3ErqAdtq,discussion-id=YaLsk26E,comment-id=0000,timestamp=2017-05-01T04:04:33.781+0000)\n>\n> lv28..\n> \n> I highly suggest not picking a champion with a high skill ceiling. *Especially Azir*. He is brutally difficult and punishes mistakes, good azir players are very rare in lower elos.\n> \n> There is a strange misconception that playing high-skill champions makes the player highly skilled, this is why you see so many yasuos, zeds ect feeding on spectacular levels.\n\nYea I was just wondering about champs that I could put a lot of time into learning but I understand your point, who might you recommend for me at the moment?","replies":[{"poster":"MagicFlyingLlama","date":"2017-05-01T20:42:15.893+0000","up_votes":1,"down_votes":0,"body":"Anything you enjoy playing. There are no low-skill or easy champions, regardless of a lot of common misconceptions. Not having to struggle with punishing mechanics frees you up to work on teamwork, awareness and knowledge.","replies":[]}]}]},{"poster":"Khâmul","date":"2017-05-01T13:18:39.556+0000","up_votes":1,"down_votes":0,"body":"{{champion:64}}{{champion:38}} {{champion:7}}{{champion:91}}{{champion:55}}{{champion:164}} {{champion:157}} {{champion:62}} {{champion:92}}     for flashy moves,more likely based on reflexes.you have good engages and escapes and can play around your opponent.\n\nAlso {{champion:136}} {{champion:69}} (with her,you can bait someone with a flash ult ).not flashy champs but rely on Kiting,interesting champs\n\n{{champion:68}} quite a funny champ,you should give it a try. Excels more in teamfights than 1v1, unique ressource to manage too\n\n{{champion:82}}   Not flashy,simple mechanics but easiest champion to gank and you have low health scaling. You need to have  a good game knowledge if you don't want to feed more than the redcross. requires some attention during teamfights since the ghost is buggy sometimes(most bugged champion,so if you want some challenge,go for it because sometimes your spells won't do damages :p ). You can outplay the enemy if you have good knowledge of the damages you may take before dying since generating your shield is your core mechanic,that's the difference between 1 kill and 10hp left and dead. Same thing for {{champion:122}} {{champion:420}} (except for the ganking part ).\nJuggernaut are not difficult mechanically but with their telegraphed playstyle,it's hard to get to your target;especially if they have mobility\n\n\n{{champion:24}}{{champion:23}} :no worries for the early,you'll still murder the entire team(or splitpush really hard)","replies":[]},{"poster":"Netherfang04","date":"2017-05-01T04:31:10.121+0000","up_votes":1,"down_votes":0,"body":"well he isn't very high in skill cap but is fun and has out play potential with his W {{champion:62}} boy is he a lot of fun. I like full damage wukong and he can be top jungle and ive played him mid. He destroys most mages early because his base damage is high. But i also start with {{item:1036}} {{item:2031}}\n\nBut honestly you should save all your IP for lvl 30 so you can get your tier 3 runes for your AD page AP page and ADC page. Runes are super expensive. Youll spend like 12-15k ip for all the runes for those 3 pages","replies":[]},{"poster":"JuannyBear","date":"2017-05-01T04:17:44.612+0000","up_votes":1,"down_votes":0,"body":"Well, Yasuo, Lee Sin, Riven, and Poppy are some of them.","replies":[]}]}