{"poster":"Ąurora","date":"2015-05-16T10:26:54.644+0000","title":"Account meiner Schwester gehakt","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo liebe Community,\r\n\r\nich dachte ich probiers mal zuerst &uuml;ber das Forum.\r\nWie die &Uuml;berschrift schon sagt wurde der Account meiner Schwester gestern bzw. heute Nacht gehackt.\r\nVon ihrem Account wurde 1 Champ refunded und 1 Skin gekauft, der auf einen anderen Account transferiert wurde (der Name des Accounts steht ja dann dabei).\r\nPW hat sie bereits ge&auml;ndert. Sollte sie die E-Mail sicherheitshalber auch noch &auml;ndern?\r\nIch versteh gar nicht wie das m&ouml;glich war, da sie eigentlich ein sicheres PW hatte ohne Sinn d.h. wahrllos Zahlen und Buchstaben gro&szlig;,klein. Naja wie dem auch sei.\r\n\r\nWas kann LOL hierbei tun? Bekommt sie die Sachen zur&uuml;ckerstattet? Es handelt sich um RP in H&ouml;he von fast 15&euro;. Der Account ist ja bekannt an wen es ging.\r\n\r\nDANKE f&uuml;r eure R&uuml;ckmeldung. Und bitte keine Belehrungen, da sie es sich selbst nicht erkl&auml;ren kann, wie es dazu kam.","replies":[{"poster":"Ąurora","date":"2015-05-16T11:02:55.560+0000","up_votes":1,"down_votes":0,"body":"Danke schonmal für eure lieben Antworten.\n\n@Wiedword\nich kann dir nur sagen, dass meine Schwester nur mit mir und den Leuten aus ihrer Gilde von Eden Eternal befreundet ist. Generell nimmt sie keine FA's an, wenn sie die nicht kennt, dafür spielt sie schon zu lange ;).\n\n@SinAporia\nWir haben den Support angeschrieben, allerdings gibts irgendwie keinen richtigen Betreff, den man hierfür auswählen kann. Hab jetzt den genommen bei dem ich dachte, dass es am ehesten zutrifft.\nE-Mail und PW geändert, Virenprogi läuft.\nIch hoffe sie hat Glück und bekommts erstattet. Screenshot von allem wurde mitgeschickt ;) zum Nachweis.","replies":[]},{"poster":"SAO Heathcliff","date":"2015-05-16T10:54:35.564+0000","up_votes":1,"down_votes":0,"body":"Zuerst solltest du den Support anschreiben und dem die Sache erklären. Aber du kannst schon ein paar Informationen zusammentragen wie zB:\n\n- Die ersten 5 Champions die du gekauft hast\n- was das erste war was man sich von RP's gekauft hast\n- die IP mit der du dich bzw in dem Fall deine Schwester sich in Lol eingeloggt hat\n\nund noch ein paar andere Sachen. Es geht in dem Fall darum das man den Support beweisen kann das dies wirklich der Account deiner Schwester ist und nicht irgendein ein anderer ist. Und dies machen Sie über Fragen über den Account den wirklich nur der Ersteller wissen kann. Was ich noch empfehlen kann, über den Rechner das Anti-Virus und ein Anti-Malware Programm laufen zu lassen um vermeintliche Key Logger zu finden.\n\nIch denke mal, das das alles ist was ihr derzeit machen könnt, außer Passwort und eventuell E-Mail ändern. \n\nAber sonst das wars erstmal von mir,  \nviel Glück\n\nPS- der Support kann von 1 - 3 Tage brauchen um auf das Ticket zu Antworten, das hängt dann in dem Fall davon ab wie viel die gerade zu tun haben. Und wichtig - nur 1 Ticket schreiben und dieses nicht aktualisieren weil sonst fällst du in der Warteschlange beim Support wieder ganz nach unten.","replies":[]},{"poster":"Wiedword","date":"2015-05-16T10:43:22.979+0000","up_votes":1,"down_votes":0,"body":"1. Dein Passwort kann noch so \"sinnfrei\" sein, wenn jemand es über irgend einen Weg geschafft hat einen Virus (z.B. Keylogger) auf ihren PC zu schaffen, bringt ihr das alles nicht.\n2. Ich bin mir nicht 100% sicher, aber wenn ihr den Support anschreibt und denen dort erklärt, dass sie den Skin  gar nicht haben wollte, und dass sie den Champion behalten wollte, dann machen sie das >>>vielleicht<<< rückgängig.\nund \n3. Du schreibt, dass der Skin auf einen anderen Account übertragen wurde? Das heißt meines Wissens nach, dass sie den anderen Account für 2 Wochen (waren es 2 Wochen?) in der Freundesliste gehabt haben musste. Darf ich die Behauptung  stellen, dass sie vielleicht ihre Kontodaten an den Besitzer des anderen Accounts weitergegeben hat?\n\nLg. Wiedword","replies":[]}]}