{"poster":"Shadoo","date":"2019-04-05T05:37:06.436+0000","title":"Man hat mir wirklich dafür ne CR verpasst","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":13,"body":"Ich habe den Hintergrund des Games bereits in einem anderen Thread\r\n\r\nhttps://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/nc9nEjLd-ich-muss-euch-einfach-von-meinem-neuesten-spiel-erzaahlen\r\n\r\nverfasst . Das war bevor ich die Nachricht bekommen habe, dass ich eine CR bekommen habe. Ich habe mir diesmal wirklich Mühe gegeben diese 4 nicht als die geistig Behindertetn zu bezeichnen die sie sind und trotzdem ne CR... Darf man also buchstäblich nicht mal Dives kritisieren? Muss ich einfach akzeptieren, dass in dem Fall zb Leona immer wieder diven wird auch wenn ich mir 100% sicher bin, dass sie dabei wieder sterben wird und sie wiederum jedes einzelne Mal erwartet, dass ich mit ihr kämpfe und dann wütend wird wenn ich es nicht tue?\r\n\r\nGame 1\r\nPre-Game\r\nChadooo: damn\r\nChadooo: ok I take it... not\r\nIn-Game\r\nChadooo: I usually play ignite mid\r\nChadooo: yes for example someone who can go in quickly\r\nChadooo: wow\r\nChadooo: report me for flaming\r\nChadooo: why did I heal\r\nChadooo: fail\r\nChadooo: no dive\r\nChadooo: that was unnecessary\r\nChadooo: I was not the one foricing a fight under turret\r\nChadooo: if you dive again I run again\r\nChadooo: ok got it leona is so angry abotu her fail that she wantsto lsoe now\r\nChadooo: from now on I consider her fighting for the enemy\r\nChadooo: Im counting on the rest of you guys\r\nChadooo: I hereby declare I wont fight at leonas side\r\nChadooo: if she goes in anyway she feeds\r\nChadooo: dude tell that to Leona\r\nChadooo: DUDE what do you want\r\nChadooo: seriosuly tell me\r\nChadooo: what do you want from me\r\nChadooo: I want an answer\r\nChadooo: Leona plain ints what do you want from me\r\nChadooo: how\r\nChadooo: she does the OPPOSITE of my calls\r\nChadooo: I tell her not to go in she goes in\r\nChadooo: I wont die for her\r\nChadooo: so you supp now?\r\nChadooo: if yes then dont take my farm\r\nChadooo: FFS\r\nChadooo: DO NOT DIVE\r\nChadooo: J4 seriously what do you want from me\r\nChadooo: 2 guys come to my lane I clearly dont want them to dive\r\nChadooo: they dive and die\r\nChadooo: J4 that was DARIUS\r\nChadooo: ARE YOU ALL BLIND?\r\nChadooo: my god...\r\nChadooo: DO MNOT DIVE\r\nChadooo: DO NTO DIVE\r\nChadooo: DO NOT DIVE\r\nChadooo: DO NOT DIVE\r\nChadooo: yes\r\nChadooo: do you\r\nChadooo: and do you know the difference between darius and Leon\r\nChadooo: this would be a freewin if Leona and Darius would stop trolling\r\nChadooo: god did I askf ro help?\r\nChadooo: ffs j4\r\nChadooo: you gank or not\r\nChadooo: and I got a freaking diving Leona and a dving Darius\r\nChadooo: wanna trade?\r\nChadooo: despite them\r\nChadooo: yeah I especially liked his dive while I pignd hib 12 times telling him not to dive\r\nChadooo: such a carry\r\nChadooo: well they do it on purpose?\r\nChadooo: bbe quiet\r\nChadooo: Darius doesnt care\r\nChadooo: and you complain about Renek\r\nChadooo: yeah yeah\r\nChadooo: whatever you say inter\r\nChadooo: wow AFTER Yyou intentional feed my stats arent good?\r\nChadooo: ltierally ints and blames others\r\nChadooo: and J4 even sides with the inter\r\nChadooo: just awesome\r\nChadooo: best game of my life\r\nChadooo: my team blames me for THEIR dives...\r\nChadooo: and deny all kind of teamwork\r\nChadooo: I told them BEFORE not to dive\r\nChadooo: they do it anyway\r\nChadooo: and I DID help the first time\r\nChadooo: almsot died there\r\nChadooo: these are facts\r\nChadooo: so I play the game?\r\nChadooo: and that is the same as Leonas PLAIN inting\r\nChadooo: jungler wanna?\r\nChadooo: dives are fun eh\r\nChadooo: dives are so much fun\r\nChadooo: andrefusing to learn is aswell\r\nChadooo: yeah yeah\r\nChadooo: whatever the troll says\r\nChadooo: yes and the reason is you and Darius trolled\r\nChadooo: such a simple answer\r\nChadooo: oh she said sure what a good counter\r\nChadooo: hi\r\nChadooo: guys wanna know how to win?\r\nChadooo: step one: stand at your turret\r\nChadooo: step two: wait\r\nChadooo: yep report me... for\r\nChadooo: asing them d\r\nChadooo: not to dive\r\nChadooo: Leona complains I dont help the time WHILE I help the team doing an outnumbered fight\r\nChadooo: that OF COURSE costed our life\r\nChadooo: what is this mentality?\r\nChadooo: I also like how she keeps repeating to report me but literally can not say anything else\r\nChadooo: for example why she dived AFTER I asked her not to dive\r\nChadooo: well Thresh\r\nChadooo: what is worse\r\nChadooo: 4 plain trolls\r\nChadooo: or 2 mates with a bad start?\r\nChadooo: yes please report me despite ALL  FOUR literally can not even understand\r\nChadooo: watch:\r\nChadooo: team why do you want to report me?\r\nChadooo: well?\r\nChadooo: anyone?\r\nChadooo: can I please duo with one of you\r\nChadooo: I literally get 4 trolls when solo q","replies":[{"poster":"dugg","date":"2019-04-05T06:46:31.837+0000","up_votes":7,"down_votes":0,"body":"Ist es ein starkes Geltungsbedürfnis, welches dich zu so einem lange Chatverlauf hinreisen lässt? Ich fasse es mal zusammen, wie man ohne viel Schreiben die Situation lösen kannst.\n\nLeona dived sinnlos,\ndu:\"pls stop Diving\"\nLeona tut es erneut\ndu schreibst nichts mehr und lässt sie einfach weitermachen.\nSollte sie anfangen etwas zu schreiben, muten.\n\nDu diese viele Schreiben von dir bist du nicht mehr auf Spiel fokussiert. Ich gehe sogar schon so weit, dass ich sage, dass ist tilting. Was glaubst du mit deinem vielen Text und deiner Diskussion zu bewirken? Es hat nur die Konsequenz, dass Reports fliegen und Strafen verteilt werden. Ein Spielrhythmus kann so gar nicht entstehen. \n\n> [...] geistig Behindertetn zu bezeichnen [...]\n\nDu musst versuchen jemanden nicht zu beleidigen? Da frage ich mich natürlich echt, bei wem eine geistige Einschränkung vorliegt. Tut mir leid, dass ich so direkt bin. Das unterstreicht halt nur wie toxisch du bist und somit halte ich jegliche Strafe für gerechtfertigt.\n\nDeine fehlende Einsicht gegenüber den anderen Beiträgen/Usern spricht ebenfalls dafür. Du zeigst sogar keine Einsicht ingame: team why do you want to report me?\n\nIch hoffe, du lernst aus deiner Strafe. Ansonsten bist du bald weg mit diesem Account.","replies":[{"poster":"Shadoo","date":"2019-04-05T07:11:12.793+0000","up_votes":1,"down_votes":5,"body":"Schöne Worte ohne Inhalt. Ich gehe mal der Reihe nach durch\n\nWas glaubst du warum ich Leona mehrmals sage sie soll aufhören? Weil ich will dass sie aufhört weil ich das Spiel gewinnen will von mir aus kann sie im nächsten game 700 mal diven und verlieren wäre mir grade recht dann wäre ich sie los aber mein Spiel will ich gewinnen.\n\nMeine fehlende Einsicht ... Übersetzung: stimm gefälligst zu! Ihr liefert keine Argumente zumindest keine die nicht innerhalb von Sekunden zerpflückt werden siehe diese Antwort. Zeig welches Verhalten tatsächlich falsch war anstatt einfach Einsicht zu fordern.","replies":[{"poster":"dugg","date":"2019-04-05T07:28:23.386+0000","up_votes":5,"down_votes":0,"body":"> Schöne Worte ohne Inhalt.\n\nHm.... wenn du den Inhalt meiner schönen Worte nichts verstehst, dann vielleicht anders.\n\nHör auf zu diskutieren, es führt nur dazu, dass du tiltest und aufgrund deines Verhaltes bestraft wirst. Besser?\n\n> [...] Meine fehlende Einsicht ... Übersetzung: stimm gefälligst zu! [...]\n\nNö, ich habe lediglich beobachtet, dass du keine Einsicht zeigst. Weder ingame noch hier im Forum. Reine Feststellung. Wie du sie nun übersetzt bleibt dir überlassen. \n\nDu zeigst aber auch erneut, dass du ein typ Mensch bist, der auf biegen und brechen Sachen diskutieren möchtest. Allerdings die Sachlage etwas aus den Augen verlierst. Schau mal ohne Emotionen und ohne das \"gewinnen wollen\" deinen Beitrag an. Rein von Standpunkt her, was ist regelwidrig? Wenn du es nicht schaffst dich so selbst zu reflektieren, dann würde es mich nicht wundern, wenn Folgestrafen eintrudeln.\n\n> Zeig welches Verhalten tatsächlich falsch war anstatt einfach Einsicht zu fordern.\n\nWelches Verhalten war falsch? Und was kannst du besser machen?\n\n> Chadooo: ok got it leona is so angry abotu her fail that she wantsto lsoe now\nChadooo: from now on I consider her fighting for the enemy\nChadooo: Im counting on the rest of you guys\nChadooo: I hereby declare I wont fight at leonas side\nChadooo: if she goes in anyway she Feeds\n\nDu wirst Leona Sabotage bzw. Feeding vor.\nWas kannst du besser machen? Es nicht zu schreiben...\n\n> Chadooo: ARE YOU ALL BLIND?\n\nDu beleidigst alle deine Teammates\nWas kannst du besser machen? Es nicht zu schreiben...\n\n> Chadooo: this would be a freewin if Leona and Darius would stop trolling\n\nDu beschuldigst zwei Leuten des Trollings\nWas kannst du besser machen? Es nicht zu schreiben...\n\nIch glaube, ich brauche nicht mehr Beispiele. a) haben es andere User bereits ausführlich geschrieben und b) wenn du jetzt nichts daraus lernst oder es erkannt hast, dann ist dir nicht zu helfen.","replies":[]},{"poster":"00 M4ddin 00","date":"2019-04-05T07:31:42.125+0000","up_votes":3,"down_votes":0,"body":"Du hast ne Strafe bekommen wie viel Beweis willst du noch das dein Verhalten falsch war? :D lol da brauchen wir keine Argumente.... \n\nSchöne Worte ohne Inhalt ist auch den Chat Motto ^^","replies":[]},{"poster":"Sirrkas","date":"2019-04-05T09:14:51.342+0000","up_votes":2,"down_votes":0,"body":"Wie wäre es hiermit. Copier den Chatlog noch mal. Schreib statt Chadoo davor Sirrkas, dugg oder was auch immer. Jetzt stell dir vor, der Chatlog wurde nicht von dir geschickt sondern an dich gerichtet. Würdest du immer noch sagen, das war alles richtig so und total in Ordnung? Ich denke, wenn dir jemand deinen Chatlog geschrieben hätte, hättest du den sicher auch gemeldet.","replies":[{"poster":"Shadoo","date":"2019-04-05T09:19:15.937+0000","up_votes":1,"down_votes":0,"body":"Nope ganz sicher nicht.","replies":[{"poster":"Sirrkas","date":"2019-04-05T09:30:22.879+0000","up_votes":2,"down_votes":0,"body":"So wie du rüber kommst, sehr sicher.","replies":[{"poster":"Shadoo","date":"2019-04-05T09:36:36.888+0000","up_votes":1,"down_votes":2,"body":"Tjoa wollen wir das jetzt auf dem Niveau weiter führen? Nein hätte ich nicht hab ich nie getan werde ich auch nie Ihr seid diejenigen die alles mit Zensur lösen wollen ich nicht.\n\nAber wenn sich schon ein zweiter Grüner hierher verirrt nutze ich die Gelegenheit mal um das Ende meiner Antwort an eingew zu kopieren.\n\nAls letztes würde ich gerne noch wissen was denn nun der tatsächliche Grund für die CR war. Wie bereits gesagt Ich beiß mir schon auf die Zunge keine Beleidigungen mehr zu schreiben. Welcher Teil war denn nun gegen den Summoner Code.\n\nUnd bevor dass wieder kommt: Nein ich werde nicht \"einfach alle muten\". Ich will meine Spiele gewinnen und egal wie wütend Leona mich macht -wenn sie etwas schreibt was wichtig ist will ich das lesen. Und ich werde auch nicht einfach nichts schreiben wenn ich sehe Leona will dauernd diven dann schreibe ich dass sie dass lassen soll in der Hoffnung das sie es lässt.","replies":[{"poster":"Sirrkas","date":"2019-04-05T10:30:08.966+0000","up_votes":2,"down_votes":0,"body":">Tjoa wollen wir das jetzt auf dem Niveau weiter führen? Nein hätte ich nicht hab ich nie getan werde ich auch nie Ihr seid diejenigen die alles mit Zensur lösen wollen ich nicht.\n\nBevor du deine Teammates 24/7 flamst, wäre still sein besser.\n\nAber man sieht anhand deines anderen Threads schon ganz gut, dass du Probleme damit hast, das Spiel richtig in Erinnerung zu rufen. \n\n>Als letztes würde ich gerne noch wissen was denn nun der tatsächliche Grund für die CR war. Wie bereits gesagt Ich beiß mir schon auf die Zunge keine Beleidigungen mehr zu schreiben. Welcher Teil war denn nun gegen den Summoner Code.\n\nSo ziemlich alles. Das wurde dir doch schon mehrfach ausführlich erklärt. Angefangen bei den haltlosen Sabotagevorwürfen, über die eigene Ankündigung das Team vorsätzlich sabotieren zu wollen, weiter über das unnötige Gezanke.\n\nDein Chat war insgesamt nur negativ. Es hätte deinem Team deutlich besser getan, hättest du gar nichts geschrieben. Statt toxisch zu werden, hättest du auch versuchen können, den Leuten Mut zuzureden und die Situation zu deeskalieren. Aber scheinbar ist dir dein Ego zu wichtig. Ansonsten hättest du nicht ständig versucht die anderen nieder zu machen.\n\n>Nein ich werde nicht \"einfach alle muten\". Ich will meine Spiele gewinnen und egal wie wütend Leona mich macht -wenn sie etwas schreibt was wichtig ist will ich das lesen. Und ich werde auch nicht einfach nichts schreiben wenn ich sehe Leona will dauernd diven dann schreibe ich dass sie dass lassen soll in der Hoffnung das sie es lässt.\n\nNimm mal deinen Chat als Vergleich. Wenn Leona wirklich toxisch war, sah, ihr Chat ähnlich aus wie deiner. In deinem Chat war nichts hilfreiches zu finden. Lediglich Vorwürfe. Absolut jeder im Team wäre besser damit gefahren, dich einfach zu muten. \n\nBei Flamern ist das so gut wie immer der Fall. Sobald sie erst einmal anfangen andere zu blamen, kommt nichts nützliches mehr, für den restlichen Verlauf des Spiels. So war das auch in deinem Chatlog. \n\nHättest du statt der Wall of Text einfach nur \"gl hf\" und \"gg wp\" geschrieben, wäre dein Chatlog um ein vielfaches besser für alle Beteiligten gewesen. Ich weiß nicht, warum du das nicht wahr haben willst. Sicher, es fällt schwer einzugestehen, dass man Unrecht hat. Aber du musst dich hier nicht mal bei jemandem entschuldigen. Es wäre nur gut für dich, wenn du daraus was für die Zukunft mitnimmst. Niemand wäre dir böse, würdest du einfach aufhören hier zu schreiben, das ganze 3 Tage sitzen lassen und dann darüber nachdenken, wie deine Chatlogs in Zukunft besser für dein Team werden können. \n\nSolange du es schaffst dein eigenes Fehlverhalten zu erkennen, angemessen zu reflektieren und dich zu bessern, würde das Spiel für dich und dein Team in Zukunft besser werden.","replies":[{"poster":"Shadoo","date":"2019-04-05T10:46:28.287+0000","up_votes":1,"down_votes":2,"body":"Nein es wurde überhaupt nichts erklärt es wurden bescheuerte Sachen gesagt die ich in Sekunden zerpflückt habe. Also noch einmal: SAG WAS FALSCH WAR. Mein Gott wie schwer ist es eine simple Frage zu beantworten nichts aus ausweichen bisher und das von nem Grünen.","replies":[{"poster":"Sirrkas","date":"2019-04-05T11:06:10.247+0000","up_votes":2,"down_votes":0,"body":"Du hast bisher nichts zerpflückt, du willst es nur so sehen. \n\n>Also noch einmal: SAG WAS FALSCH WAR.\n\nDas wurde hier schon mehrfach getan, aber so wie du dich aufführst, wirst du das auch komplett ignorieren und als \"zerpflückt\" betiteln, wenn ich das ebenfalls mache. \n\n>Mein Gott wie schwer ist es eine simple Frage zu beantworten nichts aus ausweichen bisher und das von nem Grünen.\n\nEs hat wirklich keinen Mehrwert dir das weiter erklären zu wollen. Wir sind an einem Punkt angelangt, an dem du entweder erkennst, dass du dich falsch verhalten hast oder nicht. Aber wenn du unbedingt darauf bestehst, gebe ich noch mal ein paar Beispiele:\n\n\n>Chadooo: ok got it leona is so angry abotu her fail that she wantsto lsoe now\nChadooo: from now on I consider her fighting for the enemy\n\nHier etwa wirfst du der Leona trollen vor, das geht nicht in Ordnung. Und wie man am Match sehen kann, hat sie auf Sieg gespielt, nicht auf Niederlage. Nach Kassadin hat sie etwa die meisten Killbeteiligungen. Das ist nicht gerade ein Saboteur. \n\n\n>Chadooo: Im counting on the rest of you guys\n\nHier versuchst du jetzt auch noch das eigene Team zu spalten und zu sabotieren, indem du einen Keil zwischen deinen Support und den Rest treiben willst. Du solltest froh sein, dass du nur eine CR dafür erhalten hast\n\n>Chadooo: I hereby declare I wont fight at leonas side\n\nDu kündigst an, dein eigenes Team zu sabotieren\n\n\n\n>Chadooo: Leona plain ints what do you want from me\n\nWeitere unberechtigte Sabotagevorwürfe.\n\n\n\n>Chadooo: ARE YOU ALL BLIND?\n\nVöllig unnötiger negativer Chat.\n\n\n>Chadooo: this would be a freewin if Leona and Darius would stop trolling\n\nJetzt bezeichnest du auch schon Darius als Troll. \n\nIch hör an der Stelle mal auf, das waren mehr als genug Beispiele.\n\n\nAber ich kommentiere noch ein paar Aussagen von dir, die jetzt nicht direkt etwas mit der CR zu tun haben müssen:\n\n>Chadooo: she does the OPPOSITE of my calls\nChadooo: I tell her not to go in she goes in\n\nEs ist ihr gutes Recht, nicht auf dich zu hören. Ironisch ist hier sogar, dass für gewöhnlich der Support im Early die Hauptarbeit macht. Vielleicht wärst du besser dran, deinem Supporter mehr zu helfen.\n\n>Chadooo: I want an answer\n\nSchon ironisch wie sich dein Ingamechat in deinem Verhalten hier wiederspiegelt. Wenn dir etwas nicht passt scheinst du gerne nach \"Antworten\" zu verlangen. Hoffst du darauf, dass irgendwann irgendjemand etwas sagt, das dir gefällt an das du dich ab da dann klammern kannst? Damit wirkst du bestenfalls wie ein Verschwörungstheoretiker. Ich würde dir empfehlen, damit aufzuhören, anderen fällt es sonst sehr schwer, dich ernst zu nehmen.\n\nInsgesamt war es nicht verwunderlich, dass ihr verloren habt. Wenn der eigene ADC sich so gegen das eigene Team stellt, kann es sehr schwer sein zu gewinnen. ","replies":[{"poster":"Shadoo","date":"2019-04-05T12:15:12.747+0000","up_votes":1,"down_votes":0,"body":"Ich hab keine Lust wieder und wieder zu erklären, dass eine Leone die in 2 Gegner rennt und dann stirbt obwohl ich ihr vorher gesagt habe sie soll exakt das nicht tun, nicht auf Sieg spielt selbst wenn sie danach 87 Kills holt.\n\nUnd nun zu deinen Beispielen: Fazit Troll sagen = Bann? Wenn dem so ist dann sprich es aus. Wenn du euer System für so Perfekt hältst dann kannst du es ja auch ehrlich verkaufen oder?","replies":[{"poster":"Angel Ayume","date":"2019-04-05T12:55:20.641+0000","up_votes":2,"down_votes":0,"body":"Ich versuche auch mal mein Glück. \n\nDu sagst, Leona soll nicht mehr diven/engagen weil du ihr dann nicht mehr hilfst, weil der erste Versuch daneben ging.\nHab ich das richtig verstanden?\n\nNun, sie glaubt aber, dass um zu gewinnen oder Kills zu holen genau das die richtige Idee ist und engaged, weil es in dem Moment vllt sogar echt sinnvoll ist. Du hilfst ihr nicht, weil du es vorher angekündigt hast. \n\nIn meinen Augen bist du hier der Troll, weil du bewusst entschieden hast ihr nicht zu helfen und es sogar angekündigt hast. Zu entscheiden jemanden nicht mehr zu helfen obwohl die Hilfe nötig ist und jemanden einfach sterben zu lassen und sogarnoch zu sagen \"wenn die weiter an meiner Seite spielt, will ich keine Fights mehr gewinnen\" dann ist das für nich Troll und bewusste Sabotage und wäre in meinen Augen sogar nen 14 Tage Bann wert.\n\nWeißt du, nur weil du sagst sie soll nicht mehr engagen, heißt das nicht, dass sie auf dich hören muss.\n\nWenn ich dir jetzt sage: Hör auf zu flamen und zu behaupten hier würde dich keiner verstehen. Würdest du dann auch auf mich hören? \n\nSei froh, dass es nur eine blöde CR war und kein 14 Tage Bann für Sabotage des Teams.","replies":[{"poster":"Shadoo","date":"2019-04-05T13:09:29.822+0000","up_votes":1,"down_votes":1,"body":"Interessant ich muss also buchstäblich immer wieder an Leonas Seite sterben oder ich werde gebanned...\n\nIhr seid doch alle wahnsinnig....","replies":[{"poster":"Angel Ayume","date":"2019-04-05T13:25:42.611+0000","up_votes":2,"down_votes":0,"body":"Das habe ich nicht gesagt.... \n\nNatürlich ist es sinnvoll einen Mate mal sterben zu lassen, wenn man Gefahr läuft selbst zu sterben und das definitiv nicht worth ist. Das macht ja jeder, Mates sterben lassen, wenn es nicht sinnvoll ist zu folgen. \n\nABER du sagst von Anfang an, dass du nicht folgen wirst, ob es nun sinnvoll ist oder nicht. \nUnd genau das ist das Problem. \nDu sagst einfach nein und dann hat sich die Sache erledigt. \nIch habe ja sogar noch gesagt ich zitiere: \"[...] und engaged, weil es in dem Moment vllt sogar echt sinnvoll ist. Du hilfst ihr nicht, weil du es vorher angekündigt hast.\" \n\nWenn du ihr nicht hilfst, obwohl ihr Engage richtig und sogar sinnvoll ist, dann ist das Sabotage.","replies":[{"poster":"Shadoo","date":"2019-04-05T13:45:44.918+0000","up_votes":1,"down_votes":1,"body":"wieder falsch...\n\nDas habe ich so nicht gesagt würde ich auch nicht sagen und auch nicht meinen. Dieser explizite dive war in meinen Augen schlecht und deshalb bin ich nicht mitgegangen das er genauso war wie angekündigt ist dabei sogar zweitrangig.\n\nZum Vergleich wären die Gegner irgendwie bereits bei 50% hp und Leona geht rein... Ja natürlich wäre ich dann mitgegangen.\n\nMein Kommentar war lediglich eine grobe Richtlinie im Sinne von \"Im Zweifel NICHT reingehen\" natürlich nicht buchstäblich \"Ich geh jetzt nie mehr angreifen no matter what\"\n\nAber eben genua das WAS angekündigt wurde ist passiert Leone stürmt einfach rein ich hätte dabei sterben können diese Risiko gehe ich nicht ein - Mit Ansage.\n\nAber Hauptsache erstmal zum 2 Wochen Bann verurteilen.","replies":[]}]}]}]},{"poster":"Darkr3sQ","date":"2019-04-05T12:26:01.597+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chadooo,realm=EUW,application-id=KYnfKGf0,discussion-id=YUUerPTp,comment-id=0006000000020000000000000000000000000000,timestamp=2019-04-05T12:15:12.747+0000)\n>\n> Ich hab keine Lust wieder und wieder zu erklären, dass eine Leone die in 2 Gegner rennt und dann stirbt obwohl ich ihr vorher gesagt habe sie soll exakt das nicht tun, nicht auf Sieg spielt selbst wenn sie danach 87 Kills holt.\n\nAnhand der Beschreibung, wie es gelaufen ist, hätte Leona dann MF sterben lassen sollen, damit Du glücklich bist? Wobei dann hättest Du vermutlich entweder Leona dafür verantwortlich gemacht, dass MF gestorben ist, oder aber das, was Leona von Dir gehört hatte,wäre dann an MF gerichtet gewesen.\n\n> Und nun zu deinen Beispielen: Fazit Troll sagen = Bann? Wenn dem so ist dann sprich es aus. Wenn du euer System für so Perfekt hältst dann kannst du es ja auch ehrlich verkaufen oder?\n\nDir ist bewusst, dass die Grünen keine MA von RIOT sind, sondern auch nur normale Spieler mit mehr Rechten im Forum und einem etwas besseren Kontakt zu RIOT?\nDu machst hier wieder wunderbar Cherrypicking. Du suchst Dir einen einzigen Aspekt von den ganzen negativen Sachen raus, und stellst es so dar, dass nur dieser eine Aspekt zu einem Bann geführt hat.\nÜberraschung: Er hat nicht alleine dazu geführt. Es ist Dein **gesamter** negativer Chat, der zu der Strafe geführt hat.","replies":[{"poster":"eingew","date":"2019-04-05T12:28:38.010+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZcDQ0Dt6KV,realm=EUW,application-id=KYnfKGf0,discussion-id=YUUerPTp,comment-id=00060000000200000000000000000000000000000000,timestamp=2019-04-05T12:26:01.597+0000)\n>\n> Anhand der Beschreibung, wie es gelaufen ist, hätte Leona dann MF sterben lassen sollen, damit Du glücklich bist? Wobei dann hättest Du vermutlich entweder Leona dafür verantwortlich gemacht, dass MF gestorben ist, oder aber das, was Leona von Dir gehört hatte,wäre dann an MF gerichtet gewesen.\n\nDas hat Sirrkas n bisschen missverständlich formuliert: Der TE war die MF.","replies":[{"poster":"Darkr3sQ","date":"2019-04-05T12:58:17.554+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=YUUerPTp,comment-id=000600000002000000000000000000000000000000000000,timestamp=2019-04-05T12:28:38.010+0000)\n>\n> Das hat Sirrkas n bisschen missverständlich formuliert: Der TE war die MF.\n\nOk. In diesem Fall hätte der der TE sehr wahrscheinlich die Leona angegangen, weswegen sie nicht geholfen hat, sondern weggelaufen ist und ihn hat sterben lassen.\nMacht es aber immer noch nicht besser.","replies":[{"poster":"Darkr3sQ","date":"2019-04-05T13:23:47.017+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chadooo,realm=EUW,application-id=KYnfKGf0,discussion-id=YUUerPTp,comment-id=00060000000200000000000000000000000000000000000000000000,timestamp=2019-04-05T13:08:28.367+0000)\n>\n> Probiers nochmal...\n> \n> \n> Wirklich ermüdend Leute die nicht lesen können\n\nWirklich ermüdend sind Leute, die absolut 0 Selbstreflexion haben, und der Meinung sind das gesamte Spiel kommentieren zu müssen.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Izaya Kumiho","date":"2019-04-05T08:32:17.504+0000","up_votes":6,"down_votes":0,"body":">Ich habe den Hintergrund des Games bereits in einem anderen Thread\n\nAh, ja. Ich erinnere mich... \nDas Game mit der Leona..\n\n>Das war bevor ich die Nachricht bekommen habe, dass ich eine CR bekommen habe.\n\nMhh, ich nehme an, es geht hier um eine Rechtfertigung im Chat, weil die Leona dich flamen ging?\nDas Verhalten von anderen Leuten, rechtfertigt nicht dein eigenes Benehmen.\nFeuer mit Feuer zu bekämpfen, hilft nicht wirklich in den meisten Fällen und ich zusätzlich für beide Seiten ein Regelbruch.\n\n_____________________________\nDer Chatlog und meine Kürzel:\n\nP= passiv\nUB= unsportsmanlike behaviour\n_____________________________\n\n>Chadooo: from now on I consider her fighting for the enemy\n\nOkay,  da musste ich lachen :D \nEhh.. nun aber wirklich zum Chatlog.\n\n>Chadooo: I hereby declare I wont fight at leonas side\n\nUB (Verweigerung von Teamplay)\n\n>Chadooo: if she goes in anyway she feeds\n\nP-Flaming\n\n>Chadooo: and I got a **freaking** diving **Leona** and a dving Darius\n\n(Flaming)\n\n>Chadooo: whatever you say inter\n\nFlaming\n\n>Chadooo: wow AFTER Yyou intentional feed my stats arent good?\n\nBlaming (\"you have been int feeding them\")\n\n>Chadooo: yes and the reason is you and Darius trolled\n\nBlaming\n\n________________________________\n\n**Result (wahrscheinlich unvollständig):**\n_**p-Flaming,\nFlaming,\nBlaming,\nUB**_\n\n_______________________________\n\nUm genau zu sein, wirkt der ganze Chatlog eher negativ... und ich bin mir auch nicht sicher, ob einige Stellen nicht auch auf die Liste hätten sollen.\n\nDugg hatte dir z.B. schön erklärt, was du tun solltest, wenn deine Leona 24/7 doof inten geht, daher lasse ich diesen Part hier einfach weg und verweise auf Duggs Comment, welchen du bereits gesehen hast (und meinen eigenen Comment unter deinem letzten Thread bezüglich des Games).","replies":[{"poster":"Shadoo","date":"2019-04-05T09:40:33.689+0000","up_votes":1,"down_votes":4,"body":"Here we go again. Ok die Kurzform:\n\nFlame: Einen Inter, Inter zu nennen ist also flame... und auf einer Stufe mit Fuck your mother Sprüchen? Klingt für mich wie 2 Grundverschiedene Sachen bei denen es fatal wäre sie gleich zu setzen\n\nBlame: Ja wenn jemand intet dann gebe ich ihm die Schuld dafür dass der Gegner stark ist... wo ist das Problem?","replies":[{"poster":"Izaya Kumiho","date":"2019-04-05T10:22:23.773+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Chadooo,realm=EUW,application-id=KYnfKGf0,discussion-id=YUUerPTp,comment-id=00070000,timestamp=2019-04-05T09:40:33.689+0000)\n>\n> Here we go again. Ok die Kurzform:\n> \n> Flame: Einen Inter, Inter zu nennen ist also flame... und auf einer Stufe mit Fuck your mother Sprüchen? Klingt für mich wie 2 Grundverschiedene Sachen bei denen es fatal wäre sie gleich zu setzen\n\n\nEs spielt keine Rolle, wie \"brutal\" oder \"krass\" die Worte gewesen sind. Flame bleibt Flame. Eine Beleidigung wird nur dann anders behandelt, sollte es sich um Hassrede handeln, da diese unter die 0-Toleranzgrenze fällt.\n\n\n> Blame: Ja wenn jemand intet dann gebe ich ihm die Schuld dafür dass der Gegner stark ist... wo ist das Problem?\n\nDu sollst aber nicht die Schuld auf jemanden schrieben. Das macht die Situation nicht besser.\nWieso sollte die Leona aufhören, wenn du nonstop am quengeln bist? \n\nDie muted dich im besten Fall und/oder denkt sich:\n\"Was 'n Depp. Ich bin ein Tank mit zwei starken CC's, die Sivir kann nur einen von meinen CC's spellshielden und er möchte keine Freekills haben, obwohl wir offensichtlich den DMG haben. Dem gönn ich jetzt nichts. Fk it, lol.\"","replies":[{"poster":"Shadoo","date":"2019-04-05T11:00:00.343+0000","up_votes":1,"down_votes":2,"body":"Es ist so ermüdend immer wieder die selben Sachen schreiben zu müssen...\n\nAlso nochmal: Ich sage, dass Leona aufhören soll zu diven damit sie aufhört zu diven und zu sterben... und nicht weil ich ihr unbedingt die Schuld geben will...","replies":[{"poster":"Izaya Kumiho","date":"2019-04-05T11:13:04.589+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Chadooo,realm=EUW,application-id=KYnfKGf0,discussion-id=YUUerPTp,comment-id=0007000000010000,timestamp=2019-04-05T11:00:00.343+0000)\n>\n> Es ist so ermüdend immer wieder die selben Sachen schreiben zu müssen...\n\nDann ist doch die Frage, wieso du das erneut schreiben \"musst\".\n\"Weil niemand mich versteht...oder weil ich es selber nicht wahr haben möchte, was mir die Leute versuchen zu sagen?\"\n\nOft kommt es zu Gruppen, die blind einer Meinung folgen.\nAber das ist hier nicht der Fall. \nDir wurde nur erklärt, wieso es nicht okay ist, deine Leona weiter mit Steinen zu bewerfen und warum du diese Chatsperre bekommen hast. \nWas du aus dieser Info machst, ist deine Sache. \nVielleicht reicht es auch, wenn du einfach das Thema für jetzt zur Seite schiebst und später nochmal darüber nachdenkst... **bevor** du deine Chatsperre downgrinden gehst. (Schließlich soll ja die Strafe auch als Denkanstoß und Warnung dienen.)\n\n \n> Also nochmal: Ich sage, dass Leona aufhören soll zu diven damit sie aufhört zu diven und zu sterben... und nicht weil ich ihr unbedingt die Schuld geben will...\n\nSieh dir deinen Chatlog an...\nEs ist schön und toll, wie du der Leona gesagt hast, was sie zu lassen hat in deinen Augen..\n\nWenn du aber nicht akzeptieren möchtest, was sie tut, dann gibt es für dich zwei Optionen: \n\nDu gehst sie muten, das Spiel spielen und nach dem Game fürs \"2/6/2 inten\" reporten...\n\noder:\n\nDu schreibst unnötig viel Schmu in den Ingamechat, wirfst Kohle in's Feuer und wunderst dich ein paar Tage später im Forum darüber, wieso dich so viele Leute scheinbar \"nicht verstehen\" und du eine Chatsperre bekommen hast.\n\n\n\n_**Oh.**_","replies":[]}]}]},{"poster":"Sirrkas","date":"2019-04-05T10:19:24.214+0000","up_votes":3,"down_votes":0,"body":"Das Problem ist, es gab keine Inter in deinem Spiel. Du willst es nur nicht wahr haben.","replies":[{"poster":"Shadoo","date":"2019-04-05T10:55:19.551+0000","up_votes":1,"down_votes":3,"body":"Und erneut ich kopiere von eingew\n\nDu sagst die Vorwürfe waren ungerechtfertigt. Erneut WENN es tatsächlcih ein simpler Unfall sie dachte diven - ich dachte diven ist schlecht - es geht schief - Pech - passiert. Hat ich 100 mal und es war 100 mal kein Problem. ich bezeichne sie wegen ihrer kompletten flame ohne ansatzsweise auf das gesagt einzugehen als troll und inter. Ich mache das nicht wegen ein zwei Fehlern ich mache dass weil ihr gesamtes Verhalten auf Absicht schließen lässt spätestens dass sie weiter dived nachdem ich angekündigt habe nicht länger mit ihr zu diven war ja wohl Absicht. Ich habe noch nie einen Spieler selbst wenn er 0 18 0 stand nur deshalb als inter bezeichnet sondern nur dann wenn es tatsächlich Anzeichen dafür gibt dass es Absicht war. Ich kann durchaus zwischen einem schlechten Spiel und einem Inter unterscheiden.","replies":[{"poster":"Sirrkas","date":"2019-04-05T11:10:40.705+0000","up_votes":2,"down_votes":0,"body":">ich bezeichne sie wegen ihrer kompletten flame ohne ansatzsweise auf das gesagt einzugehen als troll und inter. \n\nIch zitiere das mal. Vielleicht wird dir so klar, dass du sie völlig unberechtigt als Troll und Inter bezeichnest. Schließlich hast du es jetzt in eigene Worte gefasst, dass es nicht zutrifft, auch wenn du es nicht direkt zugibst. \n\n>Ich mache das nicht wegen ein zwei Fehlern ich mache dass weil ihr gesamtes Verhalten auf Absicht schließen lässt spätestens dass sie weiter dived nachdem ich angekündigt habe nicht länger mit ihr zu diven war ja wohl Absicht. Ich habe noch nie einen Spieler selbst wenn er 0 18 0 stand nur deshalb als inter bezeichnet sondern nur dann wenn es tatsächlich Anzeichen dafür gibt dass es Absicht war. Ich kann durchaus zwischen einem schlechten Spiel und einem Inter unterscheiden.\n\n\n\nEs wirkt nicht gerade so, als wüsstest du, was vorsätzliches Feeden bedeutet, was ein Troll ist und wie Spieler ihr eigenes Team sabotieren.\n\nEdit: Nachdem ich das Replay angesehen habe. In den ersten 9 Minuten gab es keinen einzigen Dive. Das eine mal, als sie in den Turm rein ist und einen Champion angegriffen hat, war, um dich zu beschützen, weil du dich hast reinziehen lassen. Die Leona ist sogar für dich gestorben, um dich zu retten. Das war vorbildlich für einen Supporter und du sitzt an der Tastatur und dir fällt nichts besseres ein, als Romane darüber zu schreiben, wie pöhse die Leona war. Kein Wunder, dass die nicht mehr zu dir auf die Botlane wollte. Bei so einem ADC hätte ich auch besseres zu tun, als für ihn mein virtuelles Leben zu riskieren.","replies":[]}]}]}]}]},{"poster":"00 M4ddin 00","date":"2019-04-05T06:10:52.090+0000","up_votes":6,"down_votes":0,"body":"Dein Chat log nervt ja schon so beim durchlesen wie muss das in einem schlechten game sein. Wenn man dann noch dich als Mate hat .... Bah \n\nCR ist angebracht ... Aber ne härtere Strafe wäre auch Fine","replies":[{"poster":"Shadoo","date":"2019-04-05T06:36:23.344+0000","up_votes":1,"down_votes":3,"body":"Ja Furchtbar kaum dived und stirbt Leona 5 mal auf dieselbe dumme Art und Weise schon schreibe ich, dass sie das lassen soll. Arme arme Leona","replies":[{"poster":"00 M4ddin 00","date":"2019-04-05T07:08:58.152+0000","up_votes":3,"down_votes":0,"body":"Und was hat es dir gebracht? \nLeona hat scheinbar einfach weiter gemacht und du wurdest bestraft ^^ \n\nUnd zudem schreibst du ja noch viel mehr als nur das Leo aufhören soll zu diven","replies":[]},{"poster":"Alustus","date":"2019-04-05T07:47:41.034+0000","up_votes":2,"down_votes":0,"body":"Das war nicht das Problem.\nDu hast sie dann permanent im Chat nieder gemacht.\nIch habe jetzt beim schnellen überfliegen deines Chatverlaufs kaum etwas gelesen was Sinnvoll gewesen ist.","replies":[]}]}]},{"poster":"eingew","date":"2019-04-05T06:45:33.857+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Chadooo,realm=EUW,application-id=KYnfKGf0,discussion-id=YUUerPTp,comment-id=,timestamp=2019-04-05T05:37:06.436+0000)\n>\n> Ich habe den Hintergrund des Games bereits in einem anderen Thread\n> \n> https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/nc9nEjLd-ich-muss-euch-einfach-von-meinem-neuesten-spiel-erzaahlen\n> \n> verfasst . Das war bevor ich die Nachricht bekommen habe, dass ich eine CR bekommen habe. Ich habe mir diesmal wirklich Mühe gegeben diese 4 nicht als die geistig Behindertetn zu bezeichnen die sie sind und trotzdem ne CR... Darf man also buchstäblich nicht mal Dives kritisieren? Muss ich einfach akzeptieren, dass in dem Fall zb Leona immer wieder diven wird auch wenn ich mir 100% sicher bin, dass sie dabei wieder sterben wird und sie wiederum jedes einzelne Mal erwartet, dass ich mit ihr kämpfe und dann wütend wird wenn ich es nicht tue?\n> \n> Game 1\n> Pre-Game\n> Chadooo: damn\n> Chadooo: ok I take it... not\n> In-Game\n> Chadooo: I usually play ignite mid\n> Chadooo: yes for example someone who can go in quickly\n> Chadooo: wow\n> Chadooo: report me for flaming\n> Chadooo: why did I heal\n> Chadooo: fail\n> Chadooo: no dive\n> Chadooo: that was unnecessary\n> Chadooo: I was not the one foricing a fight under turret\n> Chadooo: if you dive again I run again\n> Chadooo: ok got it leona is so angry abotu her fail that she wantsto lsoe now\n> Chadooo: from now on I consider her fighting for the enemy\n\nHat sie das eindeutig geschrieben? Wieso wiederholst du es dann? Hat sie das nicht gesagt? Wieso wirfst du ihr dann unzutreffenderweise Sabotage vor?\n\n> Chadooo: Im counting on the rest of you guys\n> Chadooo: I hereby declare I wont fight at leonas side\n> Chadooo: if she goes in anyway she feeds\n\nIn deinem anderen Thread hast du uns halt noch erzählt, du hättest dich lediglich gegen Leonas Vorwürfen verteidigt, indem du gesagt hast, dass sie auch nicht alles richtig gemacht habe. Aber das was hier steht, ist halt der ganz klare Vorwurf, sie würde feeden und dich absichtlich sabotieren. Das ist nun mal etwas völlig anderes und natürlich auch so nicht in Ordnung. \nUnd was ebenfalls nicht in Ordnung ist, ist anzukündigen, das Team selbst zu sabotieren indem du die Mitarbeit mit einem bestimmten Spieler verweigerst. Auch dann nicht, wenn du das am Ende nicht durchziehst.\n\n> Chadooo: dude tell that to Leona\n> Chadooo: DUDE what do you want\n> Chadooo: seriosuly tell me\n> Chadooo: what do you want from me\n> Chadooo: I want an answer\n> Chadooo: Leona plain ints what do you want from me\n\nUnd hier wieder, jetzt feedet sie schon absichtlich. Das sind einfach völlig unangemessene Vorwürfe. Du hast selbst auch nur einen Tod weniger als sie und eine schlechtere KDA, was hast du dann genau angestellt? Der Kassadin hat dagegen eine hervorragende Leistung abgegeben und seine Lane komplett dominiert. Ich glaube das stört ihn, dass du hier gerade die Situation nur weiter eskalierst und damit auch alle anderen demotivierst, was seine Möglichkeiten zu carryn verringert.\n\n> Chadooo: how\n> Chadooo: she does the OPPOSITE of my calls\n> Chadooo: I tell her not to go in she goes in\n\nEs gibt auch keine Regel, dass sie auf deine Calls hören muss. Guck einfach was sie macht und mach dann das beste raus. Und wenn du glaubst, es wäre zu gefährlich ihrem Engage zu folgen, dann lass es eben. Dafür kann dich niemand melden.\n\n> Chadooo: I wont die for her\n> Chadooo: so you supp now?\n> Chadooo: if yes then dont take my farm\n> Chadooo: FFS\n> Chadooo: DO NOT DIVE\n> Chadooo: J4 seriously what do you want from me\n> Chadooo: 2 guys come to my lane I clearly dont want them to dive\n> Chadooo: they dive and die\n> Chadooo: J4 that was DARIUS\n> Chadooo: ARE YOU ALL BLIND?\n> Chadooo: my god...\n> Chadooo: DO MNOT DIVE\n> Chadooo: DO NTO DIVE\n> Chadooo: DO NOT DIVE\n> Chadooo: DO NOT DIVE\n\nDafür wurdest du jetzt vermutlich nicht bestraft, aber hier auszuticken ist nun mal wirklich kontraproduktiv. Zumal du ja deutlich siehst, dass sie sowieso nicht auf dich hören.\nIrgendwie muss ich gerade an Adenauer denken und das berühmte Zitat von ihm „Nehmen Sie die Menschen, wie sie sind, andere gibt's nicht.“\nDas gilt auch bei LoL. Du musst mit den Spielern leben, die du diese Runde zugewiesen bekommst. Und da ist LoL ja noch dankbar, nächste Runde kriegst du eh neue.\n\n> Chadooo: yes\n> Chadooo: do you\n> Chadooo: and do you know the difference between darius and Leon\n> Chadooo: this would be a freewin if Leona and Darius would stop trolling\n\nIch weiß nicht, was diese Vorwürfe sollen. Darius hat genauso viele Tode wie du und auch eine bessere KDA.\n\n> Chadooo: god did I askf ro help?\n\nNaja, du regst dich ziemlich auf, weil deine Lane nicht so läuft wie du willst. Das klingt für mich schon alles nach einer ziemlich deutlichen Aufforderung, dir zu helfen.\n\n> Chadooo: ffs j4\n> Chadooo: you gank or not\n> Chadooo: and I got a freaking diving Leona and a dving Darius\n> Chadooo: wanna trade?\n> Chadooo: despite them\n> Chadooo: yeah I especially liked his dive while I pignd hib 12 times telling him not to dive\n\nWievielte Minute im Spiel reitest du hier eigentlich noch immer darauf herum? (Mittlerweile weiß ich: Bis zur letzten. Das ist keine Verteidigung mehr, das ist nur noch Salz-in-die-Wunde-streuen. Etwas, das auch einem Flamer gegenüber ungerechtfertigt ist.)\n\n> Chadooo: such a carry\n> Chadooo: well they do it on purpose?\n> Chadooo: bbe quiet\n> Chadooo: Darius doesnt care\n> Chadooo: and you complain about Renek\n> Chadooo: yeah yeah\n> Chadooo: whatever you say inter\n> Chadooo: wow AFTER Yyou intentional feed my stats arent good?\n\nDu meinst nachdem euer gemeinsamer Engage gescheitert ist - und tue jetzt nicht so, als hättest du Leonas Initiative nicht Folge geleistet! Wäre das ach so sehr Inting gewesen, wärst du ihr doch *niemals* unter den Turm gefolgt! Oder willst du mir erzählen du hilfst Feedern bereitwillig beim sterben? Oder sind deine Tode nach dem zweiten spätestens alle 1v2 unter deinem eigenen Turm erfolgt?\nDu brauchst nichts sagen, ich hab mal in deiner Matchhistory nachgesehen. Leona ist doch auch gar nicht unterm gegnerischen Turm gestorben?\n\n> Chadooo: ltierally ints and blames others\n> Chadooo: and J4 even sides with the inter\n> Chadooo: just awesome\n> Chadooo: best game of my life\n> Chadooo: my team blames me for THEIR dives...\n> Chadooo: and deny all kind of teamwork\n> Chadooo: I told them BEFORE not to dive\n> Chadooo: they do it anyway\n> Chadooo: and I DID help the first time\n> Chadooo: almsot died there\n> Chadooo: these are facts\n> Chadooo: so I play the game?\n> Chadooo: and that is the same as Leonas PLAIN inting\n> Chadooo: jungler wanna?\n> Chadooo: dives are fun eh\n> Chadooo: dives are so much fun\n> Chadooo: andrefusing to learn is aswell\n> Chadooo: yeah yeah\n> Chadooo: whatever the troll says\n> Chadooo: yes and the reason is you and Darius trolled\n> Chadooo: such a simple answer\n> Chadooo: oh she said sure what a good counter\n> Chadooo: hi\n> Chadooo: guys wanna know how to win?\n> Chadooo: step one: stand at your turret\n> Chadooo: step two: wait\n> Chadooo: yep report me... for\n> Chadooo: asing them d\n> Chadooo: not to dive\n> Chadooo: Leona complains I dont help the time WHILE I help the team doing an outnumbered fight\n> Chadooo: that OF COURSE costed our life\n> Chadooo: what is this mentality?\n> Chadooo: I also like how she keeps repeating to report me but literally can not say anything else\n> Chadooo: for example why she dived AFTER I asked her not to dive\n> Chadooo: well Thresh\n> Chadooo: what is worse\n> Chadooo: 4 plain trolls\n> Chadooo: or 2 mates with a bad start?\n> Chadooo: yes please report me despite ALL  FOUR literally can not even understand\n> Chadooo: watch:\n> Chadooo: team why do you want to report me?\n> Chadooo: well?\n> Chadooo: anyone?\n> Chadooo: can I please duo with one of you\n> Chadooo: I literally get 4 trolls when solo q\n\nDie Trollen nicht. Ich gehe darauf jetzt nicht mehr überall im Detail ein, aber du wirfst deinem Team hier nun mal völlig überzogenerweise Sabotage vor. Das ist einfach nicht richtig und lässt sich auch nicht damit rechtfertigen, dass die Leona dich nach ihrem Fehler geblamed und geflamed hat. \n\nNächstes Mal einfach stumm schalten und nichts in den Chat schreiben. Und ja, wenn deine Mitspieler dumme Entscheidungen treffen musst du das akzeptieren. Ist ja auch nicht so, als wären deine so viel besser, oder? Immerhin ist dem Engage deiner Mitspieler zu folgen eine gleichwertige Entscheidung.\n\n___\n\nIch hab mir das Spiel mal in deiner Matchhistory angesehen. Ist das dein Ernst? Ihr dafür Trolling vorzuwerfen? Sie hat nicht einmal gedived. Sie hat den Tower angegriffen, weil sie dachte, dass du noch direkt hinter ihr stehen würdest, weil ihr gerade dabei wart, eure Lanegegner unterm Tower zu belagern. Du hast doch die ganze Zeit den Thresh downgepocked. Dann hat sie nicht rechtzeitig gesehen, dass du nach hinten gelaufen bist und wurde deshalb unterm Turm gecatcht, wobei sie *nicht* versucht hat anzugreifen, sondern ausschließlich wegzukommen! Du hast dann versucht ihr zu helfen und dich dabei *selbst catchen lassen* woraufhin Leona selbstloserweise erneut reingegangen ist um dich wieder zu befreien.\n\nEine Situation also, in der ihr beide Fehler gemacht habt, aber dennoch am Ende glücklicherweise zumindest dich am Leben halten konntet. Dass die Leona das psychisch nicht verkraften kann, gut, das ist kacke und unfair von ihr, aber da kann man nichts machen. Pech gehabt.\n\nDann so zu tuen, als würde sie trollen ist aber ebenfalls kacke und unfair von dir. Du hast dir das Spielklima durch deine permanenten Provokationen und ungerechten Vorwürfe mindestens zur Hälfte selbst zu verdanken.\n\nNächstes Mal einfach muten und die Situation so hinnehmen, wie sie ist.","replies":[{"poster":"Shadoo","date":"2019-04-05T07:40:14.221+0000","up_votes":1,"down_votes":3,"body":"Ok Ich fange mal mit meine geringsten Problem an: Ich bezeichne Kassadin als ignorant und Darius dive als genau dass einen dive. Über ihr stats hab ich nichs gesagt warum auch.\n\nAls nächstes: Selbst WENN Leona mit ernsthafter Abicht den ersten dive gemacht hat. Du hast dir das Spiel doch angesehen sie hat NACHDEM ich gesagt habe nicht mehr dive weiter gemacht und ist dabei gestorben und hat mir dafür die Schuld gegeben. Was soll ich denn machen? 5 weitere male mit ihr reingehen? 5 weitere Male mit ihr Sterben? Was glaubst du denn WARUM ich das überhaupt sage anstatt euer ignorantes \"einfach alle muten\" anzuwenden? Weil ich möchte dass sie es weiß und nicht mehr dived, Anstatt zu diven und sich dann immer weiter und weiter aufzuregen dass ich nicht mitmache.\n\nDu sagst die Vorwürfe waren ungerechtfertigt. Erneut WENN es tatsächlcih ein simpler Unfall sie dachte diven - ich dachte diven ist schlecht - es geht schief - Pech - passiert. Hat ich 100 mal und es war 100 mal kein Problem. ich bezeichne sie wegen ihrer kompletten flame ohne ansatzsweise auf das gesagt einzugehen als troll und inter. Ich mache das nicht wegen ein zwei Fehlern ich mache dass weil ihr gesamtes Verhalten auf Absicht schließen lässt spätestens dass sie weiter dived nachdem ich angekündigt habe nicht länger mit ihr zu diven war ja wohl Absicht. Ich habe noch nie einen Spieler selbst wenn er 0 18 0 stand nur deshalb als inter bezeichnet sondern nur dann wenn es tatsächlich Anzeichen dafür gibt dass es Absicht war. Ich kann durchaus zwischen einem schlechten Spiel und einem Inter unterscheiden.\n\nAls letztes würde ich gerne noch wissen was denn nun der tatsächliche Grund für die CR war. Wie bereits gesagt Ich beiß mir schon auf die Zunge keine Beleidigungen mehr zu schreiben. Welcher Teil war denn nun gegen den Summoner Code.\n\nUnd bevor dass wieder kommt: Nein ich werde nicht \"einfach alle muten\". Ich will meine Spiele gewinnen und egal wie wütend Leona mich macht -wenn sie etwas schreibt was wichtig ist will ich das lesen. Und ich werde auch nicht einfach nichts schreiben wenn ich sehe Leona will dauernd diven dann schreibe ich dass sie dass lassen soll in der Hoffnung das sie es lässt.","replies":[{"poster":"eingew","date":"2019-04-05T12:13:55.762+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chadooo,realm=EUW,application-id=KYnfKGf0,discussion-id=YUUerPTp,comment-id=00050000,timestamp=2019-04-05T07:40:14.221+0000)\n>\n> Ok Ich fange mal mit meine geringsten Problem an: Ich bezeichne Kassadin als ignorant und Darius dive als genau dass einen dive. Über ihr stats hab ich nichs gesagt warum auch.\n\nNee, ich aber, wenn du ihnen vorwirfst zu trollen und zu inten. Was hast du dann getan, wenn du am Ende schlechter stehst?\n\n> Als nächstes: Selbst WENN Leona mit ernsthafter Abicht den ersten dive gemacht hat. Du hast dir das Spiel doch angesehen sie hat NACHDEM ich gesagt habe nicht mehr dive weiter gemacht und ist dabei gestorben und hat mir dafür die Schuld gegeben. Was soll ich denn machen? 5 weitere male mit ihr reingehen? 5 weitere Male mit ihr Sterben? Was glaubst du denn WARUM ich das überhaupt sage anstatt euer ignorantes \"einfach alle muten\" anzuwenden? Weil ich möchte dass sie es weiß und nicht mehr dived, Anstatt zu diven und sich dann immer weiter und weiter aufzuregen dass ich nicht mitmache.\n\nSie war danach ne Ewigkeit nicht einmal mehr unterm gegnerischen Tower, sie ist nämlich nachdem du einen Engage, den sie mitten auf der Lane gemacht hat, ignoriert hast, auf die Toplane gegangen, weil du ja offenbar entgegen meiner Annahme, deine Ankündigung sie zu sabotieren tatsächlich durchgezogen hast.\n\n> Du sagst die Vorwürfe waren ungerechtfertigt. Erneut WENN es tatsächlcih ein simpler Unfall sie dachte diven - ich dachte diven ist schlecht - es geht schief - Pech - passiert. Hat ich 100 mal und es war 100 mal kein Problem. ich bezeichne sie wegen ihrer kompletten flame ohne ansatzsweise auf das gesagt einzugehen als troll und inter. Ich mache das nicht wegen ein zwei Fehlern ich mache dass weil ihr gesamtes Verhalten auf Absicht schließen lässt spätestens dass sie weiter dived nachdem ich angekündigt habe nicht länger mit ihr zu diven war ja wohl Absicht. Ich habe noch nie einen Spieler selbst wenn er 0 18 0 stand nur deshalb als inter bezeichnet sondern nur dann wenn es tatsächlich Anzeichen dafür gibt dass es Absicht war. Ich kann durchaus zwischen einem schlechten Spiel und einem Inter unterscheiden.\n\nSie hat nicht gedived. Ihr habt die Gegner zusammen belagert und weil sie kurz unaufmerksam war, wurde sie gecatcht. Sie dachte nicht diven. Sie dachte \"Scheiße raus hier - omg Thresh hat meinen ADC, scheiße zurück, die Vayne stunnen, okay jetzt wieder: scheiße, raus hier\".\n\nUnrecht und Unrecht ergibt eben nicht Recht. Ja, sie hat sich dir gegenüber offenbar ziemlich asozial benommen - das ist eben überhaupt keinen Grund, sie permanent für etwas zu blamen, das nicht einmal passiert ist. Aber selbst wenn sie gedived wäre, war dein Chat nichts anderes, als ein unnötiges Salz-in-die-Wunde-streuen, wie ich ja auch bereits geschrieben habe.\n\nJeder macht Fehler. Auch du. Das ist voll okay und man muss diese niemandem deshalb vorhalten.\n\n> Und bevor dass wieder kommt: Nein ich werde nicht \"einfach alle muten\". Ich will meine Spiele gewinnen und egal wie wütend Leona mich macht -wenn sie etwas schreibt was wichtig ist will ich das lesen. Und ich werde auch nicht einfach nichts schreiben wenn ich sehe Leona will dauernd diven dann schreibe ich dass sie dass lassen soll in der Hoffnung das sie es lässt.\n\nUnd das hat auch nichts damit zu tun, dass du dich damit irgendwie konstruktiver oder \"weniger ignorant\" verhalten würdest. Im Gegenteil. Klar kannst du mir vorwerfen, ich würde zu wenig kommunizieren. Und dich gleichzeitig darüber beschweren, dass deine Mitspieler nicht auf deine Kommunikation hören. Du merkst hier doch selbst, dass es so wie du es versuchst nicht funktioniert.\nDu hast dich im Gegenteil mit deinem ständig zurückschreiben zur Leona komplett selbst sabotiert, die ist auf die Toplane gegangen, weil sie keine Lust mehr auf dich hatte. Und das erklärt ehrlich gesagt auch, warum das Team eher dich als Problem sah.\n\n> Als letztes würde ich gerne noch wissen was denn nun der tatsächliche Grund für die CR war. Wie bereits gesagt Ich beiß mir schon auf die Zunge keine Beleidigungen mehr zu schreiben. Welcher Teil war denn nun gegen den Summoner Code.\n\nIzayah Kumiho hat das in ihrem Post mMn sehr gut erklärt. Wenn du diese Sachen weglässt bekommst du sicherlich keine CR mehr. Generell würde ich dir aber wie gesagt empfehlen, dich deinen Mitspielern gegenüber insgesamt ignoranter zu zeigen, denn spielrelevante Dinge werden im Chat sowieso fast nie besprochen, wie man ja ehrlich gesagt auch bei deinem eigenen Log sieht. Wenn du die Leute, die nichts negatives schreiben, nicht mutest, bekommst du genauso alles wichtige mit, wie jetzt.","replies":[]}]}]},{"poster":"Wernicke","date":"2019-04-05T06:27:57.562+0000","up_votes":2,"down_votes":0,"body":"Man wird nicht explizit für die dir zugesendeten logs/Spiele bestraft. Auch dein vorheriges Verhalten in vergangenen Spielen wird mit einbezogen. Die zugesendeten logs sind nur Beispielhaft zu verstehen.\n\nAber auch in diesem log bist du durchgehend negativ, verbreitest eben auch diese negative Stimmung, möchtest aufgeben, schreibst in caps, schreibst trolls usw, ...\n\nDavon abgesehen, hätte ich dich für diesen langen log eh für spam reported. Du schreibst viel zu viel, kannst dich gar nicht mehr aufs Spiel konzentrieren und lenkst zusätzlich alle anderen auch noch ab.","replies":[{"poster":"Shadoo","date":"2019-04-05T06:34:22.112+0000","up_votes":1,"down_votes":2,"body":"Wo möchte ich bitte aufgeben? Mein Gott 3 Antworten und schon einmal ne Fette Lüge. Was glaubst du warum ich ALLES versucht habe damit diese Trottel mit ihren faildives aufhören?\n\nUnd Ja ich schreibe trolls bei 4 Leuten die permanen report schreien und die frage wofür NICHT beantworten und ich schreibe Trolls bei einer Leona die dauernd dived und stirbt nachem ich klar und deutlich gesagt habe dass sie das lassen soll.\n\nUnd Zuviel schreiben? Wollt ihr mich Alle nurnoch verarschen zu viel schreiben = Bann...","replies":[{"poster":"dugg","date":"2019-04-05T06:52:56.106+0000","up_votes":1,"down_votes":0,"body":">Chadooo: FFS\n>Chadooo: ffs j4\n\nHier möchtest du aufgeben.\n\n> [...]Und Zuviel schreiben?[...]\n\nJa und...\n\n> [...] Wollt ihr mich Alle nurnoch verarschen zu viel schreiben = Bann... [...]\n\nnein... Nicht aufgrund der Tatsache, dass du viel schreibst. Das ist soweit ich weiß nicht strafwürdig, aber der Inhalt zählt. Der ist toxisch und somit strafwürdig.\n\nDein Umgangston hier und deine fehlende Einsicht bestätigt halt nur die CR uns gegenüber.","replies":[{"poster":"Shadoo","date":"2019-04-05T07:13:35.825+0000","up_votes":1,"down_votes":1,"body":"Nein ffs = for fucks sake nicht ff wie in Aufgeben Ich habe noch nie ein Spiel aufgeben wollen außer wenn wirklich 2 SPieler seit 10 mins afk sind.\n\nErst schreibst du es ist WEGEN dem vielen schreiben jetzt pltzlich nicht mehr super und ich Ich bin hier der jenige mit fehlender Einsicht jaja","replies":[{"poster":"dugg","date":"2019-04-05T07:33:20.959+0000","up_votes":1,"down_votes":0,"body":"Ah Verzeihung, mein Fehler. Tatsächlich, ich war gerade der Meinung FFS ist der Aufruf zur Aufgabe.\n\n> Erst schreibst du es ist WEGEN dem vielen schreiben jetzt pltzlich nicht mehr super und ich Ich bin hier der jenige mit fehlender Einsicht jaja\n\nHmm... ok. Ich halte dir zur Gute, dass mein Schreibstil manchmal etwas durcheinander ist. Daher noch einmal aufgeteilt.\n\nErst schreibe ich meine persönliche Sicht. ICH! würde so etwas bestrafen.\nDanach beschreibe ich die Sachlage. Viel Schreiben per se ist keine Straftat. Wie ich bereits schrieb, ist es allerdings der Inhalt der zurecht bestraft wurde und nicht die Masse.\n\nWas dieser Unterschied nun mit fehlender Einsicht zu tun hat, verstehe ich nun eher weniger.","replies":[{"poster":"Shadoo","date":"2019-04-05T07:50:39.734+0000","up_votes":1,"down_votes":1,"body":"Siehst du genau deshalb redet man miteinander anstatt einfach mute zu drücken.\n\nJetzt wo die Details geklärt sind sag doch nun was der tatsächlich böse, zurecht bestrafte Teil gewesen sein soll.","replies":[{"poster":"dugg","date":"2019-04-05T08:10:17.252+0000","up_votes":3,"down_votes":0,"body":"Fühlst du dich gerade ernsthaft in deinem Verhalten Ingame bestätigt oder beziehst du dich gerade nur hier aufs Forum? Hier im Forum gebe ich dir Recht. Ingame sollte man sich eher auf das Spiel konzentieren und nicht darauf, wer nun recht hat oder wer etwas falsch verstanden haben sollte.\n\nGanz ehrlich \"mute\" ist in 98% der Fälle allerdings er erfolgreichere Weg. Denn ganz ehrlich, sag mir bitte, was hat dir die Diskussion Ingame gebracht, außer einen gewisser Tilt, der euch hat das Spiel verlieren lassen?\n\nIch fange an langsam zu glauben, dass du mich einfach ärgern möchtest. Lies meinen anderen Beitrag, lies vor allem eingews Beitrag. \n\nDu ignorierst die Fakten und die Beiträge, die dir belegen, dass du toxisch warst und deswegen zurecht bestraft wurdest. Das ist die fehlende Einsicht von der ich hier die ganze Zeit rede.","replies":[{"poster":"Shadoo","date":"2019-04-05T08:44:08.245+0000","up_votes":1,"down_votes":2,"body":"Dann nenne diese Fakten ich warte immer noch","replies":[{"poster":"dugg","date":"2019-04-05T09:36:13.989+0000","up_votes":3,"down_votes":0,"body":"Du wartest nicht darauf, du ignorierst sie einfach. Noch einmal Beispiele für dich, vielleicht verstehst du es so:\n\n> Chadooo: if she goes in anyway she Feeds\n\nBetitelung als Feeder\n\n> Chadooo: FFS\n\nNegative Form von comeon\n\n> Chadooo: ARE YOU ALL BLIND?\n\naggressives, negatives Verhalten\n\n> Chadooo: this would be a freewin if Leona and Darius would stop trolling\n\nBetitelung als Troll\n\n> Chadooo: bbe quiet\n\naggressiv, negatives Verhalten\n\n> Chadooo: whatever you say inter\n\nBetitelung als Inter\n\n> Chadooo: wow AFTER Yyou intentional feed my stats arent good?\n\nBetitelung als Inter\n\n> Chadooo: ltierally ints and blames others\n\nBeleidung in dem du jemanden des Blamens bezichtigst\n\n> Chadooo: and J4 even sides with the inter\n\nBetitelung als Inter\n\nDas sind nur Beispiele. Falls es dir endgegangen ist. Du hast beim Installieren des Spieles den AGBs zugestimmt. Diese AGBs sind Regeln. Mit deinem Verhalten hast du gegen dieses Regelwerk verstoßen und folgerichtig eine Strafe bekommen.\n\n> [...] ich warte immer noch \n\nDas Spiel kann ich auch.\n\n> Denn ganz ehrlich, sag mir bitte, was hat dir die Diskussion Ingame gebracht[...]?\n\nWo bleibt meine Antwort?","replies":[]}]}]}]}]}]}]},{"poster":"Shacoláde","date":"2019-04-05T06:40:08.885+0000","up_votes":2,"down_votes":0,"body":"Du bist wie die Leona, die du beschreibst.\nUneinsichtig und 0 kritikfähig.\nWer im Glashaus sitzt....","replies":[{"poster":"Shadoo","date":"2019-04-05T07:16:24.102+0000","up_votes":1,"down_votes":3,"body":"OK Person A erzählt eine Lüge Person B sagt: das ist eine Lüge!\n\nKonklusion Person B ist uneinsichtig...\n\nMein Gott eure Logik...","replies":[{"poster":"Megamaexx","date":"2019-04-05T07:51:17.580+0000","up_votes":3,"down_votes":0,"body":"Du verstehst scheinbar nicht einmal, dass du selbst deinen Beitrag zur Niederlage geleistet hast. \nPunkt 1: Die Masse an Chat hat dafür gesorgt, dass du weniger am eigentlichen Spiel teilnimmst. \nPunkt 2: anstatt direkt zu sagen, dass du deinen mate beim nächsten dive im Stich lässt, hättest du ihm mit genauso vielen Worten auch mitteilen können, warum du nicht diven willst. Sowas wie \"need more items before we dive\" ist eine freundlichere Aussage und mit der kann man auch von Siegeswillen ausgehen, stattdessen deine Aussage: \"if you dive again I run again\". Bedingungen statt Strafe nennen. Dann klappts auch mit den randoms. \nPunkt 3: So wie du glaubst, deine Calls sind die besten, denken auch alle (oder viele) anderen Spieler, dass deren Calls die besten sind. Es bringt also nix, jemanden vorzuhalten, dass er deinen Call ignoriert, denn in seinen Augen war sein Plan besser. Wenn diese dann durch dein nicht-agieren sterben, fühlen die sich übrigens auch bestätigt, dass es geklappt hätte, wenn Unterstützung da gewesen wäre, auch wenn das nicht stimmt.","replies":[{"poster":"Shadoo","date":"2019-04-05T08:00:54.683+0000","up_votes":1,"down_votes":2,"body":"Punkt 1: woher willst du das wissen. Ich kann schnell tippen während mein char zu einem objective läuft.\n\nPunkt 2: Ok Leona flamed und feedet soviel sie will und ich soll in unglaublich blumiger pc Sprache sagen dass sie dass doch bitte bitte lassen soll.... und gleichzeitig soll ich NICHT viel schreiben. Merkst du was? Meine Antwort war nicht die super nette Ned Flanders Sache? Sie war immer noch 100 mal sanfter als Leonas gekreische.\n\nPunkt 3: Zunächst einmal.. Meine Mates machen keine Calls... sie rennen random rum kein Plan erkennbar und wenn gefragt kommt keine Antwort. Wenn tatsächlich mal Jemand außer mir Calls verwendet - Nach nem erfolgreichen tf Nashor anpingen oder so.. bin ich HEILFROH endlich mal ein Mate mit Plan und befolge ihn nahezu Immer SELBST wenn ich eigentlich lieber pushen würde denn ich bin der Meinung lieber zu 5. das 2. beste Ziel machen als sich unnötig aufteilen.\n\nDas vorneweg und nun bei diesem speziellen Fall: Ich war mir absolut sicher wir werden wieder sterben wenn Leona dived selbst wenn ich so bescheiden wäre und die Möglichkeit einräume, dass der nächste dive eventuell klappt Leona also recht hatte. Ich möchte dieses Risiko nicht eingehen und mache das klügste was ich in so einer Situation machen kann: Ich sage Leona bereits im Vorfeld, dass ich nicht mitdiven werde nenne mir Irgend eine Aktion die ich hätte besser machen können.","replies":[{"poster":"eingew","date":"2019-04-05T12:20:06.847+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chadooo,realm=EUW,application-id=KYnfKGf0,discussion-id=YUUerPTp,comment-id=000200000000000000000000,timestamp=2019-04-05T08:00:54.683+0000)\n>\n> Punkt 1: woher willst du das wissen. Ich kann schnell tippen während mein char zu einem objective läuft.\n\nKönnen deine Mitspieler auch schnell genug lesen? Gehört das überhaupt zu den nützlichen Informationen, wegen denen du niemanden mutest? Ich persönlich würde ja beides mit \"nein\" beantworten.\n\n> Punkt 2: Ok Leona flamed und feedet soviel sie will und ich soll in unglaublich blumiger pc Sprache sagen dass sie dass doch bitte bitte lassen soll.... und gleichzeitig soll ich NICHT viel schreiben. Merkst du was? Meine Antwort war nicht die super nette Ned Flanders Sache? Sie war immer noch 100 mal sanfter als Leonas gekreische.\n\nOder du mutest sie einfach und sagst gar nichts. Wenn du ihr dann nicht hilft merkt sie das schon selbst.\n\nAbgesehen davon ist an Megamaexxs Vorschlag nichts blumiges, das ist einfach nur neutral, ganz im Gegensatz zu deiner Reaktion, sie erstmal möglichst viel beim Team anschwärzen zu wollen.\n\n> Das vorneweg und nun bei diesem speziellen Fall: Ich war mir absolut sicher wir werden wieder sterben wenn Leona dived selbst wenn ich so bescheiden wäre und die Möglichkeit einräume, dass der nächste dive eventuell klappt Leona also recht hatte. Ich möchte dieses Risiko nicht eingehen und mache das klügste was ich in so einer Situation machen kann: Ich sage Leona bereits im Vorfeld, dass ich nicht mitdiven werde nenne mir Irgend eine Aktion die ich hätte besser machen können.\n\nDann ist ja gut, dass sie nicht gedived hat.","replies":[]}]}]}]}]},{"poster":"eingew","date":"2019-04-05T06:48:42.302+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Chadooo,realm=EUW,application-id=KYnfKGf0,discussion-id=YUUerPTp,comment-id=00020000,timestamp=2019-04-05T06:34:22.112+0000)\n>\n> Wo möchte ich bitte aufgeben? Mein Gott 3 Antworten und schon einmal ne Fette Lüge. Was glaubst du warum ich ALLES versucht habe damit diese Trottel mit ihren faildives aufhören?\n\nDu lügst doch selber, das als Dive zu bezeichnen. Du hast dich selbst genauso catchen lassen! Weil dein Positioning schlecht war, was auch der Grund war, warum Leona sich zuvor hat catchen lassen, weil ihr Positioning nämlich auch schlecht war!","replies":[]}]}]}]}