{"poster":"Shadoo","date":"2019-04-03T08:14:36.034+0000","title":"Ich muss euch einfach von meinem neuesten Spiel erzählen","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":5,"body":"Also wirklich ich weiß wie jeder andere Spieler, dass LoL voller Vollidioten steckt aber es ist nicht mehr schön dieses letzte Game, wo fang ich an?\r\n\r\nEs fängt ganz harmlos an jemand in champ select sagt, dass jemand ignite nehmen soll. Ich also adc sage nein der Rest sagt nichts soweit so unscheinbar\r\n\r\nIn game sagt unser Kassadin mitte Sinngemäß: Yeah sure I take ignite and be 0/10 you want that?\r\nIch antworte: Well I play Kassadin with Ignite\r\nKassadin: 7 mute all\r\n\r\nOkay... offenbar hat er das auch wirklich getan dazu später mehr hier bin ich schon mal verwundert aber ich kenne ja LoLs Einstellung ala Chat benutzen = böser böser flame report!!!!! Und zwar nicht in einem übertriebenen sondern buchstäblichen Sinne es scheint für zumindest manche Spieler ein Gleichnis zu sein.\r\n\r\nJetzt aber zum highlight: Ich lande mit meiner MF ein paar nette Qs und meine Gegner müssen früh b als sie wieder kommen selbes Spiel zwar keine Kills aber CS vorteil, es läuft. Dann etwas fatales: Meine Leona macht einen frühen towerdive, Ich denke mir: Ohje das war doch nicht nötig. Aber als guter Mate kämpfe ich an Ihrer Seite allerdings gehen wir beide fast drauf können aber grade so fliehen während der Gegner noch gut dasteht.\r\n\r\nUnd wie ihr euch denken könnt warum ich diesen Thread schreibe: Leona gibt mir die Schuld. Ich antworte dass der Dive unnötig war kein geflame aber auch keine 7fache Beschönigung Ich glaube es war: That dive was unnecessary. Danach ein fieser Gank des Gegnerischen Heca trifft mich tödlich. Ein Grund für Leona mehrfach auf mich zu pingen... Jaja. Jetzt bin ich bereits etwas wütend wieder auf der Lane stürmt Leona wieder rein und für mich sieht das nicht gut aus Ich pinge sie mehrfach b aber sie kämpft weiter mehr als genug Zeit zu reagieren aber sie will unbedingt sterben und erneut mir die Schuld geben. Ich Antworte: if you dive like that again I wont help you again so dont act surprised. Ja sicher nicht der netteste Satz aber ich finde mehr als angebracht. Als Reaktion wandert sie zur Toplane.\r\n\r\nAn der Stelle sagt unser Jungler J4 wir beide sollten aufhören. Ich antworte ihm was ich denn bitteschön machen soll wenn mein Supp direkt das Gegenteil meiner calls/pings macht? Keine Antwort. Typische \"wenn 2 sich streiten sind Beide Schuld\" Logik. nur mal nebenbei im Alleingang hab ich dann den gegnerischen Supp ausgeschaltet.\r\n\r\nDarius unser Toplaner kommt bot - ohne ein Wort. Ich sage: you supp now? Allerdings verwendet er seine Spells zum farmen und ich darafu: Ok then let me farm! Keine Reaktion gegner verschanzen sich unterm Turm Darius scheint einen dive zu wollen... Ich mittlerweile wirklich sauer pinge ihn back und gehe nicht mit ihm rein erneut genug Zeit zu reagieren aber er dived und stirbt. Ich bin Schuld...\r\n\r\nJ4 versucht mir zu erklären dass Darius meinen Farm nicht geklaut hat Aufgrund seines items... Ich vermute er meinte das Supp item Relic shield... welches Darius natürlich nicht hatte sondern Leona die immer noch Top ist... Ich gehe also davon aus dass J4 nicht mal bemerkt hat, dass ich Darius und nicht Leona auffordere nicht meinen farm zu nehmen.\r\n\r\nVon jetzt an wirkliches Chaos alle 4 sind sich einig dass alles meine Schuld war am Anfang probiere ich noch zu fragen: Ok then tell me what did I do wrong why report me? Keine Antwort nur Leona die meine mittlerweile eher schlechten 2/5/7 stats zitiert.\r\n\r\nAuch Kassadin gibt mir die Schuld ich frage ihn genauso wie den Rest keine Antwort vermutlich wirklich gemutet.\r\n\r\nTrotz alledem habe ich probiert meine Rolle als adc zu spielen mit meinem team objectives zu machen auf pings zu reagieren alles drum und dran aber zwecklos wir haben verloren.\r\n\r\nNun warum schreibe ich das überhaupt? Zum einen ein wenig Frust ablassen ala Was geht nur in den Köpfen der Leute ab aber zum Anderen: Die Frage die ich an J4 gestellt hatte an euch weiter geben. Was soll man in so einer Situation tun?\r\n\r\nhabe Leone und Darius reportet für Negative Attitude bzw Offensive language. Aber wird vor allem Negative Attitude überhaupt geahndet?","replies":[{"poster":"Izaya Kumiho","date":"2019-04-03T10:31:26.909+0000","up_votes":4,"down_votes":0,"body":"Das klingt für mich eher nach einem 0815 Kassadin, welcher sich nichts sagen lassen möchte,\neinem halben Laneswap mit Top und Bot, einem verwirrten J4 und natürlich auch einer Leona, die dich blamen geht.\n\n\n...\n\nBezüglich Kassadin: einfach gar nichts sagen. Wer nicht nach Hilfe fragt, möchte wahrscheinlich atm keine bekommen.\n\nIch würde bei meinen 600k auf Ahri auch nicht dauernd hören wollen, was ich bauen soll. \n... Es würde mich auch nicht interessieren, wie andere Spieler sie bauen. \n\n\n>habe Leone und Darius reportet für Negative Attitude bzw Offensive language. Aber wird vor allem Negative Attitude überhaupt geahndet?\n\nWenn dich Darius nicht beleidigt hat, sehe ich kein Problem für ihn. Er nahm das wahrscheinlich als einen Laneswap auf oder wollte dich nicht alleine auf der Lane lassen. Dabei braucht er aber auch CS, u know? .-.\n\nLeona hat dich beschuldigt und scheinbar auch beschimpft. Da trifft das eher zu.\n\nDu hättest einfach mal testen müssen was passiert, wenn du ihr folgst. Vielleicht war es ja wirklich ein Laneswap.\n\n\n__________________________________\n\nHmm.. ich kann mich an ein Ranked erinnern, - Season 7 oder 8... - da hatte mein Mate Yasuo Top gespielt und ich war leider Janna Sup. (Wir hatten ursprünglich eine Yasuo-Janna Botlane wegen den Lolz gespielt, was unglaublich gut funktionierte). Mein ADC war ein Ezreal, welcher 24/7 gegen mich spielte, seine Fehler auf mich schob etc.\n\nDa unser Yasuo krasse Probleme gegen seinen Gegner hatte, ging ich einfach hoch und lief Yasuo nonstop hinterher, als würden wir unsere Roflcopter-Botlane spielen.\n\nMein Mate sagte noch zu mir:\"Nee, lass mal.. geh ruhig wieder runter oder so...\"\nWorauf ich meinte:\"Pff! trust me, ich weiß was ich tu.\"\n\nWell.\nWir haben durch die Aktion das Game gewonnen.\n\nWenn dein ADC nicht sonderlich toll ist, gehst du dem nächsten Hypercarry am Popo kleben. GG.","replies":[]},{"poster":"Abasin","date":"2019-04-03T13:20:37.384+0000","up_votes":2,"down_votes":0,"body":"Typischer Dominoeffekt... und da wir ja alle unsere überempfindlichen Besserwisser kennen, sollte man tunlichst nicht den ersten Stein werfen. Und wenn es noch so gut gemeint ist. \n\nDie Erfahrung zeigt einfach, dass so eine Situation einfach viel zu schnell erreicht ist.\n\nAktiv verhindern kannst Du die Situation nicht, aber durch konsequentes Schweigen bezüglich der Handlungsweisen eines Spielers oder Dir selbst kanst DU es rauszögern. \nDie J4 Frage kann ich nicht nachvollziehen. Die kann er nur nach eigenem Gusto beantworten. Wenn er denn mag. Jedenfalls war sie überflüssig.\n\nZur Frage der Ahndung von negative Attitude...steter Tropfen höhlt den Stein.{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Angel Ayume","date":"2019-04-03T09:21:03.923+0000","up_votes":3,"down_votes":1,"body":"Einfach gar nichts schreiben? \nDadurch, dass du der Leona vorgeworfen hast, dass der Dive keine gute Idee war, hast du die Situation für alle nur verschlimmert. \nDu hast also ganz klar eine Teilschuld. Die Leona hätte zwar nicht so empfindlich reagieren müssen und sich dann nicht trotzig verhalten. Aber letztendlich hat sie das wohl nur gemacht, weil du ihren Call kritisiert hast. Hättest du einfach den Chat ignoriert und weiter gespielt, hätte sich die Situation vllt gar nicht so aufgeschaukelt. Und wer weiß, was du alles genau geschrieben hast. \nDas Verhalten der anderen ist natürlich nicht besser und ich gebe dir nicht die alleinige Schuld. Aber du hast ganz klar ebenfalls Schuld. \n\nNächstes mal einfach nichts schreiben.","replies":[{"poster":"ImTheFox115","date":"2019-04-03T10:26:52.578+0000","up_votes":2,"down_votes":0,"body":"Ob du mit deiner 10er Cr hier noch über andere urteilen kannst :p","replies":[{"poster":"Angel Ayume","date":"2019-04-03T11:05:05.448+0000","up_votes":2,"down_votes":0,"body":"Sicher kann ich. Siehste doch xDD","replies":[]},{"poster":"Shacoláde","date":"2019-04-03T10:51:00.287+0000","up_votes":2,"down_votes":0,"body":"{{sticker:sg-miss-fortune}}","replies":[]}]},{"poster":"XxXFeuerLordXxX","date":"2019-04-03T15:13:44.643+0000","up_votes":1,"down_votes":0,"body":"Wenn man sagt der Call war nicht gut, hat das absolut nix mit Toxic sein zu tun, da kontne nur jemand keine Kritik vertragen.","replies":[{"poster":"Angel Ayume","date":"2019-04-03T15:26:04.325+0000","up_votes":1,"down_votes":0,"body":"Also um genau zu sein, hab ich nichts davon gesagt, dass es toxisch ist... Ich habe nur gesagt, dass er den Call nicht hätte kritisieren sollen. ;) \nAußerdem kommt es immer drauf an WIE man den Call kritisiert, denn das kann durchaus toxisch sein, jenachdem wie man es schreibt :)","replies":[]}]}]},{"poster":"ImTheFox115","date":"2019-04-03T11:00:58.709+0000","up_votes":2,"down_votes":0,"body":"Warum solltest du denn qualifiziert sein, jemandem zu sagen was dieser für Summs mitnehmen soll?\n\nUnd so nebenbei, Kassa mit Ignite und einem guten gegnerischen Midlaner ist unplayable für Kassa...","replies":[]},{"poster":"Shacoláde","date":"2019-04-03T09:03:04.223+0000","up_votes":1,"down_votes":0,"body":"Einfach nix schreiben und muten...fertig.\nVersuchen sich zu rechtfertigen, macht´s im Spiel nur noch schlimmer.\n\nMöglichkeit 1:\nDu hast unrecht und ihrer Flame ist berechtigt, dann haben sie also Recht und somit \"einen Grund zu flamen\".\nAlso flamen sie weiter.\n\nMöglichkeit 2:\nDu hast recht, dass müsste heißen, dass sie falsch liegen , was sich viele nicht eingestehen.\nWenn sie also sterben bist du trotzdem schuld.\n\nDie Leute flamen einfach, weil sie es nicht anders können.\nAn einer Situation was sich nicht ändern lässt, \nbringt es nicht zu schreiben oder sie drauf hinzuweisen, dass sie falsch liegen.\nGießt nur Öl ins Feuer\n\nBin gestern auch hart geflamt worden und zu Tode gepingt, weil ich als Supp\npaar engages versaut habe. \nHab´s gemutet und haben dann auch gewonnen.","replies":[]},{"poster":"ImTheFox115","date":"2019-04-03T08:39:39.060+0000","up_votes":1,"down_votes":0,"body":"Man kann auch alle muten?\nDas würde einige Probleme lösen, aber man kann dann halt nicht mehr zurück flamen....\n\nWas ein Paradoxon...","replies":[]},{"poster":"mulle87","date":"2019-04-03T08:17:19.160+0000","up_votes":1,"down_votes":0,"body":"normales game","replies":[]}]}