{"poster":"JACKY FANBOY","date":"2019-04-20T08:05:59.160+0000","title":"pregunta noob","subforum":"Jugabilidad, balance y narrativa","up_votes":5,"down_votes":0,"body":"al comprar items que buffen escudos y curaciones se stackea o no?\r\nse que dicen pasivas unicas, pero me da la duda :v\r\n{{item:3222}} {{item:3107}} {{item:3174}} {{item:3504}} \r\neso u.u saludos","replies":[{"poster":"LéonKaiser","date":"2019-04-20T10:41:44.969+0000","up_votes":4,"down_votes":0,"body":"Holap!\n\nTe explico. Los objetos que ponga \"Pasiva única: BLABLABLA\" significa que esa pasiva, solo podrás obtenerla una vez por objeto. Es decir, por ejemplo, si compras la redención, solo podrás usarla una vez.\n\nTambién hay otros tipo de objetos, cuyas pasivas tienes \"nombre\", que ponga \"Pasiva única NOMBRE DE PASIVA: BLABLABLA\", significa, que todos los objetos que tengas con esa misma pasiva, solo podrá ser usado uno de ellos (ejemplo practico, el Sterak o Malmortius). \n\nY finalmente, están las estadísticas. Si las estadisticas no pone nada de \"Único\", significa que si puedes tener varios objetos, que se te sumará. No es tu caso. En tu caso pasa esto:\n\nEjemplo, el {{item:3504}} tiene una estadística única para las curaciones y escudos. Significa, que esa estadística, solo podrás tenerla una vez por el mismo objeto. \n\nLuego, la {{item:3107}} también tiene una pasiva única que dice que tienes más curación y escudos. Tendrás esa estadística únicamente por ese objeto una vez. Con lo que acumularía con al anterior.\n\nComo dichas pasivas únicas no tienen nombre, se _stackean _ con otros objetos con la misma pasiva :3","replies":[]},{"poster":"Defg45333","date":"2019-04-20T13:05:46.930+0000","up_votes":1,"down_votes":0,"body":"Ya te dieron la versión completa del asunto, la versión corta sería:\nSi la pasiva es única y no tiene nombre stackean (solo entre distintos objetos), si tiene nombre no se stackea con ninguna que lo comparta.\nSi la pasiva no es única se stackea con todo incluso con objetos iguales.\nUn saludo.","replies":[]},{"poster":"Breath of Kyne","date":"2019-04-20T08:32:52.509+0000","up_votes":1,"down_votes":0,"body":"Depende.... Si compras {{item:3107}} y {{item:3504}} si se stackea creo por lo que tendrias 20% de curaciones y escudos, pero no si compras dos de cada uno.","replies":[{"poster":"JACKY FANBOY","date":"2019-04-20T08:36:21.910+0000","up_votes":1,"down_votes":0,"body":"claro, me refiero a uno de cada uno","replies":[]}]},{"poster":"Escapism","date":"2019-04-20T08:19:10.784+0000","up_votes":1,"down_votes":5,"body":"{{sticker:sg-lux-2}} No","replies":[{"poster":"JACKY FANBOY","date":"2019-04-20T08:23:12.769+0000","up_votes":1,"down_votes":0,"body":"tenia la esperanza que si jajajaj","replies":[]}]}]}