{"poster":"JACKY FANBOY","date":"2016-04-26T15:50:41.983+0000","title":"Riot cambia la animacion del \"escudo reliquia\"  parfavar","subforum":"Charlas Generales","embed":{"description":null,"url":"http://imgur.com/JUlo62T","image":"http://imgur.com/JUlo62Ts.jpg"},"up_votes":30,"down_votes":3,"body":"mas o menos que se vea asi (si casi toda la pantalla ) para que el 80% de los ADC que no entienden, sepan que el item comparte oro y dejen de flamear \"porque no los dejo farmear\"\ntambien una animacion asi como una llama de fuego gigante, en vez de la hilera que corre  {{item:3302}} {{champion:412}}\n\n#Gracias :V\n\n{{sticker:slayer-pantheon-popcorn}} ","replies":[{"poster":"Cedriel","date":"2016-04-26T21:01:51.466+0000","up_votes":30,"down_votes":1,"body":"Sutil pero efectivo. Me gusta.","replies":[{"poster":"Magina009","date":"2016-04-27T16:44:28.611+0000","up_votes":1,"down_votes":0,"body":"Lol me mori de risa xD","replies":[{"poster":"TheeBoneless","date":"2016-04-28T04:16:12.785+0000","up_votes":1,"down_votes":0,"body":"...","replies":[{"poster":"DatCom","date":"2016-04-28T04:50:32.273+0000","up_votes":2,"down_votes":0,"body":"No importa que diga el rioter, siempre está el chupamedias jajaj","replies":[{"poster":"JACKY FANBOY","date":"2016-04-28T17:22:30.477+0000","up_votes":1,"down_votes":0,"body":"xD","replies":[{"poster":"TheeBoneless","date":"2016-04-29T23:26:26.216+0000","up_votes":1,"down_votes":0,"body":"es la posta...","replies":[]}]}]}]}]}]},{"poster":"ZeNch","date":"2016-04-26T15:53:59.765+0000","up_votes":13,"down_votes":1,"body":"creo que no se quejan de que uses la reliquia se quejan de que con thresh falles 10 para pegar 1 y que esos 10 tu adc no llegue a lasthitearlos jajaja =P\ncuando sera el dia que a thresh le cambien el escalado de la pasiva de la E con minions para poder hacerlo mas facil xD","replies":[{"poster":"Haruhi","date":"2016-04-26T15:59:11.302+0000","up_votes":1,"down_votes":0,"body":"En mi caso no importa con que valla (Thresh, Malphite, Alistar, Nami, Etc)\nSe quejan siempre","replies":[{"poster":"Misery Business","date":"2016-04-26T16:04:09.807+0000","up_votes":21,"down_votes":1,"body":"Que clase de sujeto se hace ese item con nami?","replies":[{"poster":"Hnk Kenshiro","date":"2016-04-26T18:36:47.920+0000","up_votes":3,"down_votes":0,"body":"Lo veo más viable con veigar, para farmar la Q, pero no sera necesario en el 6.9 xd","replies":[{"poster":"Cabo xD","date":"2016-04-27T00:58:36.094+0000","up_votes":1,"down_votes":0,"body":"Porque de que me perdí?","replies":[{"poster":"Hnk Kenshiro","date":"2016-04-27T01:36:13.058+0000","up_votes":2,"down_votes":0,"body":"Ahora ganara ap al golpear un campeon enemigo con una habilidad mi estimado","replies":[]}]}]}]},{"poster":"JACKY FANBOY","date":"2016-04-26T16:02:23.204+0000","up_votes":7,"down_votes":2,"body":"nami :O","replies":[{"poster":"ZeNch","date":"2016-04-26T16:17:33.738+0000","up_votes":3,"down_votes":1,"body":"iba a preguntar lo mismo... nami con targon? wp","replies":[{"poster":"JACKY FANBOY","date":"2016-04-26T17:09:15.817+0000","up_votes":2,"down_votes":0,"body":"mmmm lo probare a ver si es new meta xD","replies":[{"poster":"ZeNch","date":"2016-04-26T17:22:34.315+0000","up_votes":1,"down_votes":0,"body":"usa la E para hitear ya que sin ser mele pasa lo mismoq ue con thresh.\nSon mas curaciones =v\najjaja \ny si salteo lineas por\nque me\ngusta\nescribir \nasi.","replies":[]}]}]}]}]},{"poster":"Young Alexis ","date":"2016-04-27T03:12:43.112+0000","up_votes":2,"down_votes":2,"body":"el truco con thresh es ganarse casi a melee para last hit ya que la animacion de su ataque basico es considerado melee y lo otro su pasiva hay que tenerla a tope si quieres llevarte a los gordos para asegurarte de no fallarlos y cerca obviamente","replies":[{"poster":"Franja","date":"2016-04-27T03:49:32.748+0000","up_votes":3,"down_votes":0,"body":"Estoy 100% seguro que no importa la distancia sigue considerandose ranged :P","replies":[{"poster":"Young Alexis ","date":"2016-04-27T06:48:34.884+0000","up_votes":2,"down_votes":2,"body":"a ver me exprese mal no para hacer lashit si no para la pasiva del escudo :)","replies":[{"poster":"Franja","date":"2016-04-27T17:17:41.804+0000","up_votes":1,"down_votes":0,"body":"Aunque ta ganes casi a melee la parte de la pasiva del escudo que hace que le pegues mas al minion no salta, por ende es igual de dificil hacerlo de lejos que de cerca. :)","replies":[]}]}]},{"poster":"ZeNch","date":"2016-04-27T13:21:12.727+0000","up_votes":2,"down_votes":0,"body":"yo no dije que no sepa hacerlo si no que dije que es dificil calcularlo y mas en una linea donde hay muchos tradeos (como sucede en elo bajo) sinceramente yo lo use poco a thresh igualmente fui de usar mucho a janna karma y y morgana (aunque use a todos... inclusive a los no supports xD) , hoy en dia no juego mas support me aburrio, jugue como only support por 1 año y pico masomenos.","replies":[]}]},{"poster":"PSU Ránkiádó ","date":"2016-04-27T01:42:58.534+0000","up_votes":2,"down_votes":0,"body":"Soy main adc y los tresh son los mejores para robarte tu farm de esa forma","replies":[]},{"poster":"Zabivaka","date":"2016-04-27T02:22:35.408+0000","up_votes":1,"down_votes":0,"body":"Te juro que es verdad, cuando smurfeo y esta thresh free esta infumable la bot lane porque encima que se compran escudo reliquia no pegan un last hit NUNCA y encima ni si quiera dejan cargar la E para tener más posibilidades de acertar.\nFuera de eso nunca me quejo del escudo reliquia","replies":[]}]},{"poster":"martincarp","date":"2016-04-26T16:55:21.600+0000","up_votes":5,"down_votes":3,"body":"El tema es que la mayoría de los soportes que utilizan el escudo reliquia lo ven como SOLO un objeto de ganancia de oro, y aprovechan poco (por no decir nada) la verdadera utilidad del objeto, la cual es poder jugar agresivo por tener vida y regeneración, realizar intercambios continuos contra los enemigos, y utilizar las cargas para curarse de manera más efectiva que los rivales (suponiendo que tienen menor sustain). Siempre que voy ADC (soy main soporte) veo que llegamos a línea, y mi soporte se lleva, o al menos busca llevarse, los dos primeros súbditos siendo que acabamos de llegar a la línea y aún estamos al 100% de vida, luego llegamos a nivel 2, hay un intercambio con el rival, el soporte del enemigo utiliza ambas cargas para curar a su tirador, dejándonos con menos vida ya que mi soporte utilizó las cargas en los primeros súbditos y ahora tenemos que esperar un minuto para volver a tener una y poder dejar de jugar pasivo.","replies":[{"poster":"Hnk Kenshiro","date":"2016-04-26T18:39:40.818+0000","up_votes":7,"down_votes":0,"body":"En lo personal, me gusta llegar a linea y farmear rapidamente para generar más cargas, y luego dejar las demas para curar cuando haga falta o sacar un lvl 2 antes que el rival (pero seria en la 2° oleada).","replies":[]},{"poster":"XVII The Star","date":"2016-04-26T21:38:01.460+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=FM martincarp,realm=LAS,application-id=v7qsfXsE,discussion-id=Hg3i7nlI,comment-id=0002,timestamp=2016-04-26T16:55:21.600+0000)\n>\n> El tema es que la mayoría de los soportes que utilizan el escudo reliquia lo ven como SOLO un objeto de ganancia de oro, y aprovechan poco (por no decir nada) la verdadera utilidad del objeto, la cual es poder jugar agresivo por tener vida y regeneración, realizar intercambios continuos contra los enemigos, y utilizar las cargas para curarse de manera más efectiva que los rivales (suponiendo que tienen menor sustain). Siempre que voy ADC (soy main soporte) veo que llegamos a línea, y mi soporte se lleva, o al menos busca llevarse, los dos primeros súbditos siendo que acabamos de llegar a la línea y aún estamos al 100% de vida, luego llegamos a nivel 2, hay un intercambio con el rival, el soporte del enemigo utiliza ambas cargas para curar a su tirador, dejándonos con menos vida ya que mi soporte utilizó las cargas en los primeros súbditos y ahora tenemos que esperar un minuto para volver a tener una y poder dejar de jugar pasivo.\n\nEntiendo tu punto, pero tengo 2 cosas que agregar.\n\n1) Es innegable que la ganancia de oro es altísima si el ADC y el Soporte se ponen de acuerdo para ejecutar al súbdito de artillería.\nLiteralmente el oro por su asesinato es **DUPLICADO**.\n\n2) Si bien lo que dices de que se lleve los 2 súbditos iniciales es cierto y completamente entendible, también tengo que agregar algunas cosas sobre eso:\n-1: El enfriamiento del *Escudo de Targón* va disminuyendo a medida que mejoras el objeto, por lo cual, con el inicial no eres capaz de matar un súbdito por oleada. Además si matas el primer súbdito, el enfriamiento da **EXACTO** para que te lleves el de torreta. Por lo cual concluyo que no es un crimen llevarse el primer súbdito a pesar de tener la vida completa.\n(Puedes además llevarte el focus de los monstruos de la jungla para aprovechar esa vida ganada)\n\n-2: Hay algunos ADC que simplemente no les importa darte tiempo para ejecutar súbditos, por lo que algunos soportes ya aburridos de eso, simplemente deciden llevarse cada súbdito que encuentran. Es muy injusto que tu ADC no te deje los minion y después el mismo te insulte porque no te alcanza para los ward.\n\nMe despido.","replies":[{"poster":"martincarp","date":"2016-04-26T22:41:24.387+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=XIX The Sun,realm=LAS,application-id=v7qsfXsE,discussion-id=Hg3i7nlI,comment-id=00020001,timestamp=2016-04-26T21:38:01.460+0000)\n>\n> Entiendo tu punto, pero tengo 2 cosas que agregar.\n> \n> 1) Es innegable que la ganancia de oro es altísima si el ADC y el Soporte se ponen de acuerdo para ejecutar al súbdito de artillería.\n> Literalmente el oro por su asesinato es **DUPLICADO**.\n> \n> 2) Si bien lo que dices de que se lleve los 2 súbditos iniciales es cierto y completamente entendible, también tengo que agregar algunas cosas sobre eso:\n> -1: El enfriamiento del *Escudo de Targón* va disminuyendo a medida que mejoras el objeto, por lo cual, con el inicial no eres capaz de matar un súbdito por oleada. Además si matas el primer súbdito, el enfriamiento da **EXACTO** para que te lleves el de torreta. Por lo cual concluyo que no es un crimen llevarse el primer súbdito a pesar de tener la vida completa.\n> (Puedes además llevarte el focus de los monstruos de la jungla para aprovechar esa vida ganada)\n> \n> -2: Hay algunos ADC que simplemente no les importa darte tiempo para ejecutar súbditos, por lo que algunos soportes ya aburridos de eso, simplemente deciden llevarse cada súbdito que encuentran. Es muy injusto que tu ADC no te deje los minion y después el mismo te insulte porque no te alcanza para los ward.\n> \n> Me despido.\n\n1- Jamás dije que no sería así, es OBVIO que recibir el oro doble le rinde a ambos, el tema es que los soportes GENERALMENTE se cierran en \"el ADC no me deja farmear\", y el ADC se cierra en \"prefiero farmear solo antes que perder creeps\"... y eso sucede porque no se dan cuenta del verdadero potencial del objeto. Si ambos lo entienden es obvio que lo recomendable es ponerse de acuerdo, que el supp avise con un simple ping el súbdito que matará y que los 2 coordinen, nunca dije que no es así.\n2- 1: Si, obvio que las cargas del targon se generan cada 30 segundos, pero yo hice mi planteo en base al escudo reliquia, lo aclaré, nunca hablé del caso del targon. Y con respecto al primer súbdito se que llega unos 5 segundos después de la llegada de la tercera oleada en una situación de presión normal, y normalmente cuando juego Thresh por ejemplo, donde solo quiero sacar las botas mejoradas y comenzar a moverme me doy el lujo de llevarme el primer súbdito estando con toda la vida. Aún así si bien no es un crimen, no es lo mismo llevarse uno sabiendo que llegarás al cañón y que aún podrás curar unos 50 de vida a tu tirador luego del intercambio típico de nivel 2, que llevarse los primeros 2 solo por el oro, y yo CLARAMENTE me refería a éste segundo caso, jamás nombre a los del primero ya que es normal y justificable.\n2: Eso sucede porque aquí en LAS se tiene la costumbre de creer que se juega \"1v9\", por lo que la desconfianza es moneda corriente en nuestras partidas. Si bien yo no pienso así soy consciente de que una gran parte de la comunidad si, por lo que si el tirador no coopera por miedo, o lo que sea, a que falle los últimos golpes, es normal que al comienzo parezca oponerse a que el soporte solo haga algo que está dentro de sus funciones de \"cuidar al tirador durante la fase de líneas\", pero no me parece que la solución sea intentar llevarse todos los minions, ya que si te pones en la visión del tirador lo que ves es a un Thresh intentando \"robarme\" los súbditos por su cuenta, por lo que la desconfianza aumenta. Simplemente hay que tener paciencia, y comprender la visión del compañero, y si el no entiende la nuestra entonces buscar la manera en que coopere sin entrar en un escenario donde parezca que peleamos entre nosotros en lugar de trabajar en equipo (insisto, intentar dar últimos golpes por tu cuenta siendo soporte desde el punto de vista del tirador es un robo).","replies":[]}]},{"poster":"Lygnus dwarf","date":"2016-04-26T22:11:51.790+0000","up_votes":1,"down_votes":1,"body":"Piensas igual que yo :') (soy main adc)","replies":[]}]},{"poster":"Lomby","date":"2016-04-26T16:09:33.932+0000","up_votes":5,"down_votes":0,"body":"voy con blitz y me roban los cañoncitos.... los adc no entienden simplemente.\npor eso no voy escudo reliquia si no es premade.","replies":[]},{"poster":"Hnk Kenshiro","date":"2016-04-26T18:42:02.241+0000","up_votes":3,"down_votes":0,"body":"¿No odias cuando el adc roba el grande con habilidades?\nTambien cuando estas autoatacando al del cañon y el adc le da un golpe para ayudarte, pero justo antes que autoataques nuevamente se muere por los otros minioms y te enojas, pero sabes que queria ayudar :p","replies":[{"poster":"Zexceed","date":"2016-04-27T17:59:28.859+0000","up_votes":1,"down_votes":0,"body":"jajaja","replies":[]}]},{"poster":"Tiranosaurio Rex","date":"2016-04-27T19:28:57.301+0000","up_votes":1,"down_votes":0,"body":"No sabes la cantidad de Thresh que me quitaron la catapulta por que no saben que sino lo lasthitean no me da el oro ya que al ser rango no lo ejecutan oh justo pasa el jg al lado y le da el oro.","replies":[]}]}