{"poster":"JACKY FANBOY","date":"2015-09-14T12:50:47.462+0000","title":"\"yo tambien cometí El error\"","subforum":"Guias y consejos","up_votes":1,"down_votes":1,"body":"http://www.lolskill.net/summoner/LAS/elxathu/champions}\r\n\r\nComo pueden ver en esta lista de 10 campeones , yo tambien pase por la &eacute;poca donde rankeaba con los campeones que me gustaban v&eacute;ase, {{champion:22}} , {{champion:13}} (que de hecho lo jug&eacute; por que era top y solo lo habia usado en 3vs3)\r\npero el que mas me &quot;doli&oacute;&quot; era {{champion:37}} ya que es un personaje que me gusta mucho pero al no poder ganar con ella la tuve que dejar de lado {{item:3110}} 10/16\r\nbueno tambien con {{champion:25}} ya que en una ocasion el otro team tenia mucho CC\r\n\r\npero luego de varias cosas me di cuenta que hay que lo que funciona (por lo menos a mi) es thresh, si {{champion:412}}\r\n (bueno y ahri cuando me queda mid XD)\r\n\r\naunque no sea un &quot;pro&quot; con el, si me va bien y es lo que mas intento usar\r\n\r\nAsi mismo he visto gente que sabe usar muy bien un personaje y ocupa otro con el que no es tan bueno\r\n\r\nCual es tu experiencia?","replies":[{"poster":"Imyre","date":"2015-09-14T14:06:08.689+0000","up_votes":1,"down_votes":0,"body":"Lissandra, partida que la pickeo partida que pierdo, no importa si voy top, mid o donde sea. No entiendo por qué, creo que no la juego tan mal xD.\nIgual juego lo que me gusta tanto en normales como en rankeds, no soy de jugar un campeón sólo por que da resultados","replies":[{"poster":"FurankuDarkstar","date":"2015-09-14T17:24:29.967+0000","up_votes":1,"down_votes":0,"body":"Yo tengo tu punto de vista, pero cuando estas en ranked tenes que concentrarte en ganar si o si porque es ambito competitivo\nPor eso aunque sea dificil, tenes que entrar con un champ op en el rol que maineas(solo 1 rol como consejo) ya que sino podrias afectar negativamente a tu team completo","replies":[{"poster":"Imyre","date":"2015-09-14T18:13:53.217+0000","up_votes":1,"down_votes":0,"body":"No es necesario jugar lo op, no recuerdo bien en que momento era que Lee Sin estaba super roto, era prácticamente pick o ban en competitivo (Lcs y esas cosas), pero le solían jugar Elise que era un confort pick contra él. Los confort pick siempre van a estar para pickearse contra los picks mas o menos rotos de cada parche.\nGente diamante de Euw han recomendado jugar con tu main, lo que tienes delante no es un profesional que no comete errores, fiate de tus mains y vas a ganar más de lo que vas a perder, y en consecuencia vas a subir.\nClaro, tampoco que te pongas a mainear Galio, Urgot y Mundo (por mencionar tres picks bastantes out xD). Yo jugaba mucho Jarvan, pero para rankeds lo sacaría entre las últimas opciones, actualmente hay jg muchos mejores.","replies":[{"poster":"FurankuDarkstar","date":"2015-09-17T10:38:29.895+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Imyre,realm=LAS,application-id=8sKIclmi,discussion-id=XvEUOFNi,comment-id=000100010000,timestamp=2015-09-14T18:13:53.217+0000)\n>\n> No es necesario jugar lo op, no recuerdo bien en que momento era que Lee Sin estaba super roto, era prácticamente pick o ban en competitivo (Lcs y esas cosas), pero le solían jugar Elise que era un confort pick contra él. Los confort pick siempre van a estar para pickearse contra los picks mas o menos rotos de cada parche.\n> Gente diamante de Euw han recomendado jugar con tu main, lo que tienes delante no es un profesional que no comete errores, fiate de tus mains y vas a ganar más de lo que vas a perder, y en consecuencia vas a subir.\n> Claro, tampoco que te pongas a mainear Galio, Urgot y Mundo (por mencionar tres picks bastantes out xD). Yo jugaba mucho Jarvan, pero para rankeds lo sacaría entre las últimas opciones, actualmente hay jg muchos mejores.\n\nMira yo ya note mas de 2 errores en tu comentario pero ya que es tu opinion te doy la mia\nRanked es competitivo y si entras ahi es para ganar a toda costa, el error que  comete la gente es usar campeones que estan fuera de la meta, por hablaba de campeones que este op, y te digo algo op no significa roto... los campeones rotos son los faciles de usar en su salida por ej ekko taba muuuuuy roto un pequeño error de rito pero estamos acostumbrados a eso....\nOtro error jarvan es EXCELENTE en jg, y ni hablar de mundo. es un excelente champ... si lo saben usar rinde mucho pero en el caso de jarvan tal vez halla campeones mas rotos y por eso son mejores, pero si sabes armar y llevar a jarvan en partida ningun roto te para\n\nYo encerio te recomendaria prestar atencion a la meta y solo usar los champs de ahi porque ranked es competitivo a como de lugar y si no hay champs que te gusten, quedate en normal con tus amigos, porque recuerda que son 5 vs 5 y si usas campeones fuera de meta que tal vez vayan mal en ranked tu equipo sale perjudicado\n\nBah es mi opinion suerte man","replies":[{"poster":"Imyre","date":"2015-09-17T13:44:09.856+0000","up_votes":1,"down_votes":0,"body":"Primero me estás diciendo de jugar lo op, y después me decís que a Jarvan si lo sabés llevar ningún op te para xD.\nSigo prefiriendo jugar lo que uno sabe a jugar lo op, bastante gente pierde partidas por jugar lo op y no dominarlo bien.\nY con lo que sé jugar puedo enfrentarme a cualquier pick del meta, sin despreciar a los demás invocadores ni a los picks op, rotos o como se les diga, el tema es tener un pool adecuado.\nA lo  mejor no estoy entendiendo lo que me querés decir, también puede ser.\nGracias! Suerte para tí también! Un saludo!","replies":[]}]},{"poster":"Ellora","date":"2015-09-14T18:52:24.141+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Imyre,realm=LAS,application-id=8sKIclmi,discussion-id=XvEUOFNi,comment-id=000100010000,timestamp=2015-09-14T18:13:53.217+0000)\n>\n> No es necesario jugar lo op, no recuerdo bien en que momento era que Lee Sin estaba super roto, era prácticamente pick o ban en competitivo (Lcs y esas cosas), pero le solían jugar Elise que era un confort pick contra él. Los confort pick siempre van a estar para pickearse contra los picks mas o menos rotos de cada parche.\n> Gente diamante de Euw han recomendado jugar con tu main, lo que tienes delante no es un profesional que no comete errores, fiate de tus mains y vas a ganar más de lo que vas a perder, y en consecuencia vas a subir.\n> Claro, tampoco que te pongas a mainear Galio, Urgot y Mundo (por mencionar tres picks bastantes out xD). Yo jugaba mucho Jarvan, pero para rankeds lo sacaría entre las últimas opciones, actualmente hay jg muchos mejores.\n\nPerdon, urgot y mundo son excelentes campeones. Que la gente no los use porque no les gusta es otra cosa.\nEsos 2 champs tranquilamente te pueden carrear en ranked","replies":[]}]}]},{"poster":"JACKY FANBOY","date":"2015-09-14T14:23:49.378+0000","up_votes":1,"down_votes":0,"body":"Entiendo tu punto de vista, en normales hago lo que sea pero al jugar rankeds se supone que hay un objetivo y para eso se lleva un analisis mas profundo como por ejemplo lo que sabes usar y te va bien ya que hay 4 personas mas que por error de 1 persona terminarian afectados :C","replies":[{"poster":"Imyre","date":"2015-09-14T18:04:03.879+0000","up_votes":1,"down_votes":0,"body":"Pero a Lissandra no la juego en rankeds justamente porque siempre pierdo con ella xD\nJuego los champs que tengo practicados contra todos o casi todos los matchups, no sacaría algo que no sé como va a rendir o que sé que me voy a sentir incómodo porque no lo he practicado suficiente.","replies":[]}]}]},{"poster":"Nyán","date":"2015-09-14T13:18:42.925+0000","up_votes":1,"down_votes":0,"body":"Morgana mid XD\nAhora estoy usando mucho a Soraka en ranked, aunque mi rol principal es mid lane y mi mejor campeón es Ahri.","replies":[{"poster":"JACKY FANBOY","date":"2015-09-14T14:28:40.768+0000","up_votes":1,"down_votes":0,"body":"ajsajsj la use una vez en normal y me trataron de troll, claro pero la usa ryu y despues todos la usan y ahi no es troll ¬¬","replies":[{"poster":"Nyán","date":"2015-09-14T16:17:40.085+0000","up_votes":1,"down_votes":0,"body":"Lol. Yo no uso a Morgana mid casi nunca, y si lo hago es porque quiero poner el charquito y tener un juego bien relajado. Pero fue diseñada como una mid laner, si no me equivoco.","replies":[{"poster":"Imyre","date":"2015-09-14T18:18:18.833+0000","up_votes":1,"down_votes":0,"body":"La jugó Pawn también, en el MSI contra la LeBlanc de Faker. A mí me parece buen champ para mid, bastante segura para farmear. A lo mejor contra champs con movilidad no va tan bien porque te pueden dodgear la Q con facilidad, pero fuera de eso creo que es jugable.\nSi las Q y las ultis de una Morgana supp duelen... mucho más la de una Morgana mid full Ap xD","replies":[{"poster":"Nyán","date":"2015-09-14T22:01:19.824+0000","up_votes":1,"down_votes":0,"body":"Honestamente me da lo mismo quién la juegue XD","replies":[]}]}]}]}]},{"poster":"Ellora","date":"2015-09-14T14:29:17.818+0000","up_votes":1,"down_votes":0,"body":"No se porque decis que Sona no rinde, es muy buen campeon. Pokeo, auras de daño, vida/escudo y velocidad, ademas de la ulti que stunea.\nSona no es como tresh, no vas a ir a tirarte como un tanque, tenes que posicionarte bien.\ny Ryze top sigue siendo una bestia, recorda que donde saca su potencial es en mid, y especialmente en late game.\n\nSiempre lo digo tenes que usar personajes que te \"enamoren\" y te sientas comodos con ellos. No forzarte a usar los rotos del momento, o lo que usan los pro en competitivo.","replies":[{"poster":"JACKY FANBOY","date":"2015-09-14T14:41:26.896+0000","up_votes":1,"down_votes":0,"body":"primero que nada no he dicho que sona no rinde ni sirve, La se usar a la perfeccion, pero en RANKEDS A MI no me da buenos resultados, ya que con sona es mas divertido y eso, pero en RANKEDS buscas jugar para el team por lo que se me da mejor thresh\n\na ryze lo usaba antes del rework asi que no era tanto\ny thresh junto con sona son los que mas me gustan (pero sona mas y me gustaria ganar mas con ella) pero siendo que no solo juego thresh :PPPPP\n\nPD:no soy de los que jugan champs de los \"pro\"","replies":[]}]}]}