{"poster":"LinusHendricus","date":"2015-12-29T19:24:15.178+0000","title":"Si escojo Teemo en ranked me cuesta report, así de nerfeado está, favor buffeenlo un poquito!!!","subforum":"Charlas Generales","up_votes":3,"down_votes":5,"body":"Teemo naci&oacute; nerfeado y cada vez q aparece en un nuevo parche es para nerfearlo, por ejemplo sus zetas de tener una permanencia de 10 minutos pasaron a 5 minutos, as&iacute; de brutal, esta misma zeta de escalar con un 0.75 de ap ahora escala con un 0.5 de ap. Si eso pasara con la ulti de cualquier otro pj se armar&iacute;a tremenda batahola, pero si es con Teemo no pasa nada, es m&aacute;s q lo sigan bajando. Todos estos sucesivos nerfs seg&uacute;n Riot es para hacer de Teemo un pj menos molesto, como si los churriquens a coste 0 y cada 3 segundos de Zed no fueran molestos, como si el devorar de Talm Kench fuera algo f&aacute;cil con lo q lidiar, si es por hacer \"menos molesto\" habr&iacute;a q nerfear a todos los pjs, pero s&oacute;lo se hace con Teemo.\n\nSaludos","replies":[{"poster":"2Teemos1Cup","date":"2015-12-29T22:41:14.340+0000","up_votes":2,"down_votes":0,"body":"Lo apoyo, juego bastante teemo y a veces es frustrante que ganes linea, juegues bien y todo y aun asi pierdas porque al otro se le ocurrio pickear un \"mejor personaje\", asi esta el balance...","replies":[{"poster":"Clostridium","date":"2015-12-29T22:53:28.614+0000","up_votes":2,"down_votes":0,"body":"Teemo nunca estara balanceado, fue un jungla mal hecho\n\nTEEMO NECESITA UN REWORK URGENTE.\n no puede ser un campeon tan basico es que ni tiene nada que hacer y en esta sesion lo veo aun peor.\n\nSOLO LO VEO EXPLOTAR.","replies":[{"poster":"2Teemos1Cup","date":"2015-12-30T00:38:19.706+0000","up_votes":2,"down_votes":0,"body":"Ya, pero sabiendo que no le van a hacer rework por ahora, por qué no buffear a un campeón suuuuuuuuuuuuuper débil? Concuerdo con lo del rework, pero \"pormientras\" es una irresponsabilidad dejarlo en lo más bajo del lol, solo porque es enano, tiene voz de pito y a la gente con un cromosoma de más le da risa.","replies":[{"poster":"Clostridium","date":"2015-12-30T00:50:42.929+0000","up_votes":2,"down_votes":0,"body":"A que le vas a meter un buff, al ulti no creo que le den mas daño porque no quieren muchas kill sin plays y la q no le pueden meter mas daño porque o sino seria one shot sin counter play, el problema es que tienen que darle algo decente, sacar esa mierda de sprint y poner un saltito alguna cosita por el estilo.\n\nY va sonar asqueroso para los amantes de teemo, pero yo borraria es abasura de ulti y le pondria ul ti decente; si es cosa de llegar a level y se fue toda ventaja del pobre tejon.","replies":[{"poster":"2Teemos1Cup","date":"2015-12-30T18:54:19.332+0000","up_votes":1,"down_votes":0,"body":"Nah, el sprint esta bien, si te dan un skill basura es porque tienes otros skills fuertes, por ejemplo la W de katarina es una basura, en late full items no pega nada, pero tiene esa W porque tiene una q fuerte, una super pasiva y un ulti que pega muchisimo, aparte de la movilidad que le da la E.\n\nA teemo yo le daría un buff de attack speed pasivo cada vez que levelees la E (veneno), y le subiría un poco el daño on hit de la e, ahí no sería un one shot de la Q ni el ulti sería tan moleesto, considerando que los pinks valen 75 y con el nuevo trinket de limpiar wards la r igual es super countereable.","replies":[]}]}]}]}]},{"poster":"Clostridium","date":"2015-12-29T22:48:09.303+0000","up_votes":2,"down_votes":0,"body":"Si te pasara por lo menos en ranked de hecho yo lo hago, hay 140 campeones teemo esta muy bajito es que revienta con la maestria del relampago; esta lleno de talon, ahris, zed, ekkos, que les vas hacer con teemo te comes un burst y explotas por el techo.\n\nTOP: no aporta lo que debe aportar uno, no asesino como loco como una irelia, no aguanta como cerdo como mundo, no tiene el manso early como renekton, no es tremendo tank como garen, no mata como panteonsete, mira ya te nombre como 5 campeones que se lo revientan bien usados.\n\nEs un campeon con un habilidad completamente inutil que es su w osea lo hace correr, sus zetas son una joda pero para que estamos con cosas hay que ser pelotudo para comerce una tf en ese lugar.\n\nEn resumen no tiene ceceo, no tiene salto, no tiene gap, no tiene silencio, no tiene lenteo usable a voluntadad, no tiene un combo insta kill; dime top rinde??? lo veo dudoso como que notiene las caracteristicas de un top, mid explota.\n\nSoporte rinde porque deniega farm y ciega al adc, aparte te sirve para meter daño ya que tu top y jg idealmente ya son bien duretes.\n\nPero en resumen si es un pick medio ofensivo; tu les pides seriedad al resto pero mira lo que pikeas tambien hay que tener criterio.","replies":[{"poster":"2Teemos1Cup","date":"2015-12-29T22:52:56.384+0000","up_votes":1,"down_votes":0,"body":"Ese es el punto del post, \"mira lo que pikeas tambien hay que tener criterio\", tu argumento para decir eso? que es un personaje débil, Y EL PIDE BUFF PARA QUE NO SEA DÉBIL, osea, hello, la lógica donde quedó.","replies":[{"poster":"Clostridium","date":"2015-12-29T23:00:50.289+0000","up_votes":2,"down_votes":0,"body":"teemo no necesita buff necesita un rework, lo he dicho un millon veces ya lo dije mas abajo incluso.\n\nUna cosa es hacer un campeon versatil y otra es hacer un campeon mediocre en todas las lineas.\n\nNo puedes decir pikeo teemo porque sacan un nasus por ejemplo en nasus se mete en su torre y te famra 300 de q en 15 minutos o mas pero da lo mismo sale de linea reventando a todo el mundo.\n\nYo jugue un poco a garen antes de su famoso rework o buff o como quieran y jamas me gano u nteemo de hehco es super facil ganarle.\n\nEN RESUMEN YO PEDIRIA UN REWORK PARA TEEMO.\n\nAhora teemo es como si hubieran hehco un jg malo, tiene cosas parecidas a shaco pero viejo shaco esta roto y teemo esa casi usleess.","replies":[]}]}]},{"poster":"Kyousuke","date":"2015-12-29T20:18:49.930+0000","up_votes":2,"down_votes":2,"body":"el problema principal y por el cual teemo no es viable actualmente es por su e y su w que son inútiles en comparación al resto de las habilidades \n{{champion:29}}  puede aumentar su velocidad y volverse invisible (cosa que siempre dije que es lo que le falta a teemo, que su pasiva entre en juego durante su w)\ny el peor problema es que su E un dot daño en el tiempo NO APLICA EFECTOS -.- el toque de la muerte ígnea es una maestría que con teemo iría PERFECTA pero su e no la toma como daño de hechizo provocando que sea inútil, {{item:3151}}  no aplica a la E {{item:3116}}  no aplica a la E \ncuando un jodido {{champion:105}}  se pone esa build y te jode la mismísima vida y si la usa teemo solo es basura, sin mencionar que con el nuevo {{item:3364}}  te dejan INACTIVAS las trampas de teemo haciendo que ya no puedas joder la vida al enemigo a la hora de una pelea o un bait ","replies":[{"poster":"LinusHendricus","date":"2015-12-29T20:29:23.265+0000","up_votes":1,"down_votes":0,"body":"Por todo lo q dices buff ahora. Saludos","replies":[{"poster":"Kyousuke","date":"2015-12-29T22:32:29.547+0000","up_votes":2,"down_votes":0,"body":"lo buffaron ahora en el pbe pero es un chiste el intento de buff XD aumento de ad base :v  RITO PLS XDD","replies":[]}]}]},{"poster":"alop55555","date":"2015-12-29T20:48:09.540+0000","up_votes":2,"down_votes":0,"body":"no es llegar y jugar a teemo es un campeón muy frágil por lo que hay que tener un posicionamiento especialmente bueno con el en especial cuando te quieren reventar de un golpe . Si te posicionas mal teemo muere.\nla e de teemo no es inútil puedes pushear fuerte una línea sin gastar mana lo que es una ventaja si se sabe usar y potencia los básicos para pokear en línea. Esta habilidad es la que te permite split pushear cuando se termina la fase de líneas y tener a todo el otro equipo farmeando para tratar de revertir el push .\nSe necesita estrategia y buena visión del mapa para jugar bien a teemo","replies":[]},{"poster":"nightdarkess","date":"2015-12-29T19:38:20.353+0000","up_votes":1,"down_votes":0,"body":"de hecho le estan bufeando poquito a poquito \nobviamente no van a buffear de golpe para que no vuelva  a ser la pesadilla de antes pero ultimamente le estan tocando de a poquito... su kit me refiero xD","replies":[{"poster":"LinusHendricus","date":"2015-12-29T19:41:07.545+0000","up_votes":1,"down_votes":0,"body":"Y cuáles serían sus bufos hasta el momento? Sigue siendo de los pjs más fáciles de deletear, sus zetas se redujeron en daño y permanencia, no entiendo esos pequeños buffos.","replies":[{"poster":"artistafracasado","date":"2015-12-29T19:48:34.599+0000","up_votes":1,"down_votes":0,"body":"Este año le mejoraron los hongos, ahora tienen distancia, rebotan entre sí, hace sigilo mientras se mueve y es más rápido, y ahora último en el pbe le subieron el daño","replies":[{"poster":"Natchin","date":"2015-12-29T19:55:28.044+0000","up_votes":2,"down_votes":0,"body":"No sé si usaría la palabra \"mejoraron\", puesto que duran mucho menos y hacen muchísimo menos daño.","replies":[]},{"poster":"LinusHendricus","date":"2015-12-29T19:52:52.884+0000","up_votes":1,"down_votes":0,"body":"todo eso a costa de bajar la permanencia de sus hongos a la mitad (de 10 a 5 minutos) y el daño de estos mismos (de 0,75 de ap a 0,5 ap). El poder moverte en sigilo es sólo en las malezas. Al final lo maquillaron un poco, pero quedó más débil de lo q ya era.","replies":[{"poster":"2Teemos1Cup","date":"2015-12-29T22:54:13.197+0000","up_votes":1,"down_votes":0,"body":"En realidad nunca debieron bajarle el daño, pero la permanencia de los hongos me da lo mismo con tal de poder lanzarlos en tf =)","replies":[]}]}]}]}]},{"poster":"JACKY FANBOY","date":"2015-12-29T19:30:40.470+0000","up_votes":3,"down_votes":1,"body":"ni tanto,\nsolo que teemo es el simbolo del bronce, trolleo, afk, report, etc.","replies":[{"poster":"2Teemos1Cup","date":"2015-12-29T22:51:39.358+0000","up_votes":1,"down_votes":0,"body":"Por el mismo hecho de que es un campeón débil.","replies":[]}]},{"poster":"KGrisly","date":"2015-12-29T19:51:11.336+0000","up_votes":1,"down_votes":1,"body":"Me estas jodiendo ? buffo a teemo jajajaja\nsigue igual de siempre Q + basico =  muerto\nSe hace invisible en el bush mientra se mueve, los hongos son granadas, corre como si no hubiese un maña (es todo un soldado )\nNo es ninguna novedad que te digan report por usar a teemo no es de ahora\n80% la Q, cada basico son 30% de AP mas los 10% cada segundo durante 4 segundos 70% de su AP en un basico, el hongo 50% mas el slow de 50%","replies":[{"poster":"LinusHendricus","date":"2015-12-29T19:55:40.190+0000","up_votes":1,"down_votes":0,"body":"Entonces en verdad Teemo está op???","replies":[{"poster":"KGrisly","date":"2015-12-29T20:29:58.129+0000","up_votes":1,"down_votes":1,"body":"No se si OP pero es una molestia total, como todo si se te tiran 2 o 3 con silencio y stun estas muerto\nen linea podes evitar gank, tenes \"ward \" de 5 minutos, hasta podes joder al jungla enemigo\nlo que pasa es que casi todo lo que se usa ahora tiene algun stun, se hace invisible por segundos en linea, daño verdadero, saltan vuelan se transportan y no los ves mas","replies":[]},{"poster":"nightdarkess","date":"2015-12-29T20:20:51.435+0000","up_votes":1,"down_votes":1,"body":"esta normalito ,porlo general teemo es un campeon como nasus afk top la diferencia como valla a tf lo matan pero puede pushear y matar a cualquiera (masomenos) y siempre seguro por sus setas de ward que no sepas usarlo es otro tema\nsaludos","replies":[]}]}]},{"poster":"Green Fairy Upa","date":"2015-12-29T19:50:55.757+0000","up_votes":0,"down_votes":1,"body":"cuando hay visto que nerfeen a teemo xddddd","replies":[{"poster":"LinusHendricus","date":"2015-12-29T19:54:46.447+0000","up_votes":1,"down_votes":0,"body":"permanencia de sus hongos a la mitad (de 10 a 5 minutos) y el daño de estos mismos (de 0,75 de ap a 0,5 ap). Eso es buffo entonces???","replies":[{"poster":"Green Fairy Upa","date":"2015-12-29T23:08:02.505+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=LinusHendricus,realm=LAS,application-id=v7qsfXsE,discussion-id=WPGpAihA,comment-id=00030000,timestamp=2015-12-29T19:54:46.447+0000)\n>\n> permanencia de sus hongos a la mitad (de 10 a 5 minutos) y el daño de estos mismos (de 0,75 de ap a 0,5 ap). Eso es buffo entonces???\n\nhermano es teemo, no puedes pedir buff, por mi ojala lo borraran xd","replies":[{"poster":"2Teemos1Cup","date":"2015-12-30T00:36:59.487+0000","up_votes":1,"down_votes":1,"body":"Ese es el problema, esta lleno de retrasados que como teemo es un meme, la gente que le gusta no tiene derecho a nada, este no es un post de chiste xd","replies":[]}]}]}]},{"poster":"elfalso1","date":"2015-12-29T19:40:21.080+0000","up_votes":1,"down_votes":4,"body":"No teemo esta muy OP, seguro necesitas un poco de practica su item favorito es{{item:3151}}  y {{item:3035}} \n\nTeemo es muy fuerte, es mas, estuvo en un guerra de Piltover contra los Gigantes de tierra.\n\nSaludos.","replies":[{"poster":"2Teemos1Cup","date":"2015-12-29T22:40:25.366+0000","up_votes":2,"down_votes":0,"body":"Ese es el item favorito de varios, no significa que estén op, deja de hablar como si teemo en si fuera un chiste que es un campeon mas y la gente que lo juega merece algo de amor","replies":[]}]}]}