{"poster":"WarriorHuman","date":"2017-02-14T08:25:12.320+0000","title":"Camille vs Riven (Passive Bug)","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"Ich habe gestern gegen eine Riven gelaned und auf lvl 1 als ich sie mit meinem AA als Camille getroffen habe ein Magic Shield bekommen. Da eine Riven definitiv nicht mehr Magic Dmg auf der Lane verursacht als Physical Dmg kann das wohl kaum gewollt sein. Ohne das entsprechende Shield geht dann ein Trade auf lvl 1 denkbar schlecht aus.","replies":[{"poster":"Mi3zekatze","date":"2017-02-14T15:53:09.210+0000","up_votes":1,"down_votes":0,"body":"Jo hatte ich auch.\n\nAb lvl 2 wars wieder normal","replies":[]},{"poster":"Andorell","date":"2017-02-14T08:42:13.458+0000","up_votes":1,"down_votes":0,"body":"Ich meine auf dem PBE war des so, des dein Schild noch nicht weiß, was es schilded. Was bisher mehr durch den Champ gekommen ist. \nJe nach Masterie kann das auf LvL schon passieren, wenn die Riven z.B Grasp of the Undying dabei hatte. \nMacht Magicdmg ;)","replies":[{"poster":"WarriorHuman","date":"2017-02-14T14:25:34.154+0000","up_votes":1,"down_votes":0,"body":"Riven hat in ihrem Kit kein Ap Scaling geschweige denn verursacht sie in irgendeiner Weise magischen Schaden. Allein die Mastery **darf** gar nicht ausschlaggebend dafür sein welches Schild verwendet wird. Denn nehmen wir an sie hat Grasp of the Undying kann sie nur durch einen AA ausgelöst werden. Und dieser AA wird mehr Phy. Dmg als Magic Dmg verursachen. Oder sagen wir sie hat Thunderlords. Um den Thunderlords proc zu erhalten muss sie 3 Spells/AA getroffen haben, in jedem fall wird mehr Phy. als Magic Dmg verursacht.\n\nWenn man nun an die Ankündigung zurückdenkt, dass das Schild nach einem Intelligenten Prinzip die primäre Schadenquelle des Gegners betrachtet muss hier eindeutig ein Fehler vorliegen.","replies":[{"poster":"SFCFlo","date":"2017-02-14T15:16:41.123+0000","up_votes":1,"down_votes":0,"body":"Tja dann ab in ein Cystom game mit irgendjemanden und versuche das ein paar mal aus.\nZeichne es vielleicht noch als Video auf, und wenn es wirklich nochmals vorkommt oder öfter während der Tests schick das an den Support.\n\nHier im Forum sieht nämlich selten jemand von RIOT vorbei der für \"Champion-Bugs\" zuständig ist.","replies":[]}]}]}]}