{"poster":"WarriorHuman","date":"2017-02-17T09:10:11.189+0000","title":"Suche DuoQ-Partner Dia V - Dia II","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Moin Leute!\r\n\r\nIch habe vor kurzem meinen bisherigen Elo-Peak von Dia III erreicht. Nun merke ich aber, dass etwa 50% der verlorenen Spiele nicht mehr auf mangelndes individuelles K&ouml;nnen der Spieler zur&uuml;ckzuf&uuml;hren ist, sondern lediglich auf deren Einstellung zum Spiel. (Viele Ragequits nach einem Tod, viele Trolls nach einem geklauten Minion, Flames in Massen, etc. etc.) Um nun dennoch vern&uuml;nftig weiter climben zu k&ouml;nnen m&ouml;chte ich zumindest die Wahrscheinlichkeit solche Leute in mein Team zu bekommen verringern, weshalb ich hier nach einem DuoQ Partner suche.\r\n\r\nZuerst einmal zu mir:\r\n\r\n- 18 Jahre alt\r\n- Elo Dia III\r\n- Ts vorhanden (sowie rauschfreies Mikro)\r\n- Mainrole: Toplane\r\n- Mainchampions: Irelia, Darius, Camille, Lissandra\r\n\r\n\r\nWas solltest du mitbringen:\r\n\r\n1. Du befindest dich zwischen Dia V und Dia II **(keine Ausnahmen --&gt; kein Platin!)**\r\n\r\n2. Du hast ein vern&uuml;nftiges Mikrofon sowie Teamspeak.\r\n\r\n3. Deine Mainrole ist nicht Toplane und du greifst nicht auf komplette Off-Meta Picks zur&uuml;ck. (Dabei spreche ich von Heimerdinger Mid, Singed Supp, Teemo Jungle oder was auch immer; nicht davon, dass alles was nicht in der LCS gespielt wird automatisch Off-Meta ist)\r\n\r\n4. Deine Gesamtwinrate liegt mindestens durchschnittlich zwischen 55% und 60%.\r\n\r\n5. Du bleibst ruhig auch wenn Spiele mal nicht so laufen wie sie sollten, tiltest nicht nach ein oder zwei Fehlern deiner Mates und flamest nicht.\r\n\r\n6. Du kannste sowohl Kritik einstecken als auch austeilen. Da es mein Bestreben ist (sowie es auch deins sein sollte) mich stetig zu verbessern, ist eine 2. Kritische Meinung zu Abl&auml;ufen innerhalb des Spiels immer hilfreich insofern sie auf logisch nachvollziehbaren Argumenten basiert.\r\n\r\n\r\nAngenommen alle 6 Vorraussetzungen treffen ohne Ausnahme auf dich zu und du suchst einen DuoQ Partner von dem du genau dasselbe erwartest, dann melde dich entweder hier oder ingame bei mir. (EUW - WarriorHuman)","replies":[{"poster":"fess123","date":"2017-02-17T14:18:36.245+0000","up_votes":1,"down_votes":0,"body":"Hi WarriorHuman,\n\ndu hast es satt alleine in der Flex Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/EB1PsvTk-aequilibritas-esports-sucht-rekruten-community-esports-organisation)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[{"poster":"WarriorHuman","date":"2017-02-17T18:09:36.196+0000","up_votes":1,"down_votes":0,"body":"Ich weis die Einladung selbst verständlich zu schätzen, bin aber nicht an einer Gaming Community interessiert. Mir geht es ausschließlich um einen DuoQ Partner in diesem Beitrag.","replies":[{"poster":"fess123","date":"2017-02-18T16:15:10.926+0000","up_votes":1,"down_votes":0,"body":"Dann wünsche ich dir trotzdem viel Erfolg bei deiner Suche und vielleicht überlegst du es dir ja einmal irgendwann anders! :)","replies":[]}]}]},{"poster":"xMugii","date":"2017-02-17T14:01:09.258+0000","up_votes":1,"down_votes":0,"body":"Otp's erwünscht?","replies":[{"poster":"WarriorHuman","date":"2017-02-17T18:14:25.955+0000","up_votes":1,"down_votes":0,"body":"Ich selbste habe 1 Million Mastery Points auf Irelia; das wäre wohl ziemlich unangemessen von mir OTP's abzulehnen.","replies":[]}]}]}