{"poster":"Como Cottoo","date":"2018-03-14T04:22:24.999+0000","title":"Ayuda elo hell...","subforum":"Charlas Generales","up_votes":2,"down_votes":3,"body":"Algun consejo para subir de division? Vengo en racha de derrotas de 11 partidas o mas... simplemente no se puede ganar con la gente que me toca y si gano unas ya pierdo 4 mas.... algun consejo? Maineo adc y jg, tambien se ir mid y supp thresh.... estoy bastante angustiado estaba en oro 2 promo a oro 1 y al perder la promo perdi todas hasta oro 4 75 puntos. Me da ganas de no jugar mas y buscar otro juego...","replies":[{"poster":"kotelo12","date":"2018-03-14T04:27:18.790+0000","up_votes":1,"down_votes":0,"body":"no te preocupes amigos son solo malas rachas imaginate que yo llegue a perder 15 ranked seguidas XD","replies":[{"poster":"Como Cottoo","date":"2018-03-14T04:29:31.270+0000","up_votes":1,"down_votes":5,"body":"Amigo estas en plata 3 jajajaja yo estaba casi platino cuando deberia estar diamante masomenos con mi conocimiento y jugabilidad... pero se hace imposible jaja es frustrante","replies":[{"poster":"Rick Silence","date":"2018-03-14T04:44:21.375+0000","up_votes":1,"down_votes":0,"body":"No soy experta, pero diría que ahí está el problema. O sea, tenés problemas para subir a platino, no parás de bajar, pero estás convencido de que sos diamante. Quizá necesitás mucho menos ego y mucha más autocrítica.\nPor casualidad te tilteas mucho con los teams que te tocan y los flameás? O te tilteás apenas el enemigo se lleva la primera sangre?","replies":[{"poster":"kotelo12","date":"2018-03-14T17:19:12.562+0000","up_votes":1,"down_votes":0,"body":"Dejalo probablemente tiene el ego tan alto que tiene que reirse de alguien de menos elo XD","replies":[{"poster":"Rick Silence","date":"2018-03-14T17:54:42.158+0000","up_votes":2,"down_votes":0,"body":"No es mi estilo mirar sin defender al atacado :3","replies":[]}]},{"poster":"Como Cottoo","date":"2018-03-14T04:47:02.942+0000","up_votes":1,"down_votes":1,"body":"No.. de lo contrario les tecomiendo No pelear si les sacan nivel y farmear para llegar a late y podes remontar... pero ni caso se mandan sin vision 3 contra 5 siempre igual","replies":[{"poster":"Rick Silence","date":"2018-03-14T14:03:36.850+0000","up_votes":1,"down_votes":0,"body":"Mmm... Yo saco algo bueno incluso de ese tipo de error. ¿Se mandaron 3v5? Eso quiere decir que tenés visión de la ubicación de esos cinco enemigos, quienes están todos juntos. Así que, como no sería conveniente unirte a esa pelea porque morirías vos también, sería bueno que corrieras a sacar el objetivo más cercano tuyo, si estás muy alejado de los cinco enemigos, mejor. Así, mientras todos se pelean en la jg o en línea (excepto que puedas realmente defender la torreta en la que están peleando), podés derribar una o dos torres sin que puedan responderte. :3\nO, si intentan responderte, obligás a que uno o dos de los enemigos tengan que irse de la tf para defender, por lo que tus aliados dejarían de estar en esa desventaja numérica. Es viable lo que te digo? :3","replies":[]}]}]},{"poster":"Nabuze","date":"2018-03-14T09:13:25.176+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Como Cottoo,realm=LAS,application-id=v7qsfXsE,discussion-id=w48xvtmv,comment-id=00000000,timestamp=2018-03-14T04:29:31.270+0000)\n>\n> Amigo estas en plata 3 jajajaja yo estaba casi platino cuando deberia estar diamante masomenos con mi conocimiento y jugabilidad... pero se hace imposible jaja es frustrante\n\nTu ego está nublando tu visión y no ves los errores propios que supiste reconocer para llegar a platino la anterior season. Practicamente querés apurarte a llegar donde una vez estuviste, ignorando el esfuerzo que pusiste para lograr ese lugar.","replies":[]},{"poster":"DIOS TUTI","date":"2018-03-14T04:47:12.905+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Como Cottoo,realm=LAS,application-id=v7qsfXsE,discussion-id=w48xvtmv,comment-id=00000000,timestamp=2018-03-14T04:29:31.270+0000)\n>\n> Amigo estas en plata 3 jajajaja yo estaba casi platino cuando deberia estar diamante masomenos con mi conocimiento y jugabilidad... pero se hace imposible jaja es frustrante\n\nEstas bajando a gold 5 y pensas que tenes que ser diamante, bajate de la nube y ponete a mejorar, agarra un solo champ, y spamealo, cuando lo aprendas al 100% mejoras macrojuego.","replies":[{"poster":"Como Cottoo","date":"2018-03-14T04:49:30.005+0000","up_votes":1,"down_votes":1,"body":"Tengo campeones como twitch jax gragas pero de adc no se puede ganar solo sin ayuda de alguien y jax y gragas los noto debiles nose que paso con ellos","replies":[{"poster":"DIOS TUTI","date":"2018-03-14T06:08:50.832+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Como Cottoo,realm=LAS,application-id=v7qsfXsE,discussion-id=w48xvtmv,comment-id=0000000000010000,timestamp=2018-03-14T04:49:30.005+0000)\n>\n> Tengo campeones como twitch jax gragas pero de adc no se puede ganar solo sin ayuda de alguien y jax y gragas los noto debiles nose que paso con ellos\n\njuga only jungla, pero twitch no sirve.\n\nte dejo picks que actualmente sirven, yo por ejemplo soy otp udyr, tengo una guia de el por si te interesa, buscala en guias y consejos.\n\nwarwick, volibear, xin zhao, olaf, shyvana, reksai.\n\nvi que usas jax, esta muy bien ahora, usalo.","replies":[{"poster":"Como Cottoo","date":"2018-03-14T06:22:46.577+0000","up_votes":1,"down_votes":1,"body":"Si me pasaras link te agradeceria, el tema es que mi duo va jg... jajajja pero para cuando juego solo sirve","replies":[{"poster":"Como Cottoo","date":"2018-03-14T06:35:48.151+0000","up_votes":1,"down_votes":1,"body":"Agregame al lol Como cottoo asi podemos hablar mas comodamente y te puedo preguntar un par de tips!","replies":[{"poster":"DIOS TUTI","date":"2018-03-14T07:05:48.253+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Como Cottoo,realm=LAS,application-id=v7qsfXsE,discussion-id=w48xvtmv,comment-id=0000000000010000000000000000,timestamp=2018-03-14T06:35:48.151+0000)\n>\n> Agregame al lol Como cottoo asi podemos hablar mas comodamente y te puedo preguntar un par de tips!\n\nhttps://boards.las.leagueoflegends.com/es/c/guias-y-consejos/7MrIvVI5-guia-udyr-completa-s8\n\nEsta en mantenimiento el sv, despues te agrego.","replies":[{"poster":"Como Cottoo","date":"2018-03-14T16:58:17.006+0000","up_votes":1,"down_votes":1,"body":"Dale bro ya te mande soli","replies":[]}]}]}]}]}]}]},{"poster":"Not Personal","date":"2018-03-14T12:22:59.681+0000","up_votes":1,"down_votes":0,"body":"Disculpame si te ofendo pero revise tu historial y agradece que estas en oro. Moris muchas veces con champs como tristana que tiene un muy buen escape, sin mencionar que tu farm para ser diamante como decis deberias estar entre los 90-100 cada 10 min y vos llegaste a 240 en 30. Otra cosa, con un hypercarry y con ese alargue de partida, un diamante la carrea solo en oro. Trata de reconocer tus errores, acepta que estas donde mereces estar y mejora para estar mas arriba, el elo hell no existe, si todos tus compañeros mueren 7 veces y vos moris 7 tambien, no sos mejor que ellos. \nTambien te quejas de que no wardean y se mandan sin wards, pero en tu ultima partida de supp (el que mas wards pone por excelencia) en una partida pusiste solo 19 wards, es decir, 6 WARDS MAS QUE LEBLANC. \n\nAcepta tus errores, identificalos y mejoralos. SI crees que deberias estar 2 ligas mas arriba y nisiquiera wardeas no vas a subir nunca.","replies":[{"poster":"Como Cottoo","date":"2018-03-14T17:02:40.591+0000","up_votes":1,"down_votes":1,"body":"Buenos consejos bro, pero estaria bueno que tu tambien los apliques. Siempre les saco 50 100 de farm a todos","replies":[]}]}]}]},{"poster":"Desclerock","date":"2018-03-14T05:54:33.238+0000","up_votes":2,"down_votes":0,"body":"por lo que veo no tenes una muy buena mentalidad o motivacion por subir a la hora de rankear, te recomiendo que te centres en las flex y te lo tomes con calma, que soloQ no jugues mas, total las recompensas ya las tenes, ya llegaste a oro","replies":[]},{"poster":"Fortín de Villal","date":"2018-03-14T06:45:37.201+0000","up_votes":1,"down_votes":0,"body":"Nunca dejaré de ser insistente con respecto a esto: cuando entras en racha negativa tienes que reducir la aleatoriedad de los emparejamientos (mientras más ganas mejores aliados te tocan; mientras  más pierdes peores aliados te tocan). O sea, buscate un duo de confianza y que sepas que dará todo por romper el nexo enemigo. Necesitas salir del bucle en el que entró tu mmr, búscate un duo, insisto, un dúo, repito. Buscate un DUO.","replies":[]},{"poster":"Mejor me voy AFK","date":"2018-03-14T04:27:28.810+0000","up_votes":1,"down_votes":0,"body":"Yo tengo un problema peor que eso xd juego una partida y se me da reanudando la conexion (Solo cuando tengo ganado el early) si todos empezamos mal no me da reanudando la conexion esto no me pasa solo hoy hace meses xD recien fui vi y me aparecia reanudando la conexion cierro el lol por completo y me anda como si nada xd no se que decir {{sticker:zombie-brand-clap}}","replies":[{"poster":"Como Cottoo","date":"2018-03-14T04:30:25.299+0000","up_votes":1,"down_votes":0,"body":"Jajjajajajajaaj tranqui amigo yo llegue a estae baneado 14 dias por flammear, no hay nada peor que eso","replies":[{"poster":"Mejor me voy AFK","date":"2018-03-14T04:31:35.858+0000","up_votes":1,"down_votes":0,"body":"Men esta es mi segunda cuenta la otra fue perma ban por toxico y esta bien no lo niego era muy flamer en ese tiempo pero con esta cuenta ya no flameo si no que se me da reanudando la conexion :/","replies":[{"poster":"Como Cottoo","date":"2018-03-14T04:35:23.898+0000","up_votes":1,"down_votes":0,"body":"A mi me banearon 2 cuenta permanentemente jajajajajaa y casi 3","replies":[{"poster":"Mejor me voy AFK","date":"2018-03-14T05:17:17.889+0000","up_votes":1,"down_votes":0,"body":"xd","replies":[]}]}]}]},{"poster":"Mejor me voy AFK","date":"2018-03-14T04:28:24.869+0000","up_votes":1,"down_votes":0,"body":"Cuestión no me pude reconectar y ya tengo leaverbuster.","replies":[]}]}]}