{"poster":"CptPICHU","date":"2017-07-08T22:44:16.427+0000","title":"Wie zufrieden seid ihr mit League?","subforum":"Allgemeiner Chat","up_votes":5,"down_votes":2,"body":"Hallo zusammen! :)\r\nIch spiele nun schon lange League und habe es - wie viele andere sicher auch - lieben und hassen gelernt.\r\nEs ist super vielseitig, Teamplay ist superwichtig und spielen mit Freunden macht einfach nur Spa&szlig;.\r\nDie Community ist teils anstrengend, aber damit kann man lernen umzugehen.\r\n\r\nIch bin seit einigen Seasons dabei und finde, dass sich League zunehmend verbessert. Riot h&ouml;rt auf Feedback und man kann &uuml;ber das Spiel zurzeit\r\nnicht wirklich Schlechtes sagen. Stimmt ihr mir da zu? Ich meine, Balancing passt. Items und Champions haben alle ihren eigenen Charme und jede Runde ist aufs neue ein Erlebnis. Wenn man wie ich ein optimistischer Spieler ist, macht alles gleich noch mehr Spa&szlig;.\r\n\r\nMich w&uuml;rde wirklich mal interessieren:\r\nWie findet ihr League zurzeit? Was gef&auml;llt euch gut - was nicht? Seid ihr vielleicht sogar rundum zufrieden?\r\nSchreibt doch mal eure Meinung und Votet. Teilt den Beitrag ruhig, ich wette euch interessiert das auch!\r\n\r\nIch bin gespannt!\r\n\r\nMit freundlichen gr&uuml;&szlig;en,\r\n-SRB Toad {{champion:117}}","replies":[{"poster":"apis florea","date":"2017-07-09T22:02:04.897+0000","up_votes":3,"down_votes":0,"body":"Momentan gefällt es mir wieder richtig gut! :D\nSeit ich angefangen habe zu spielen (Ende Season 2) kamen so viele (positive) Neuerungen hinzu und die Qualität des Spiels hat sich stark verbessert.\nSogar kleine Änderungen können das Spiel positiv beeinflussen.\nDas sieht man, meiner Meinung nach, an den neuen Ehrungen, bei einem hart erkämpften Sieg der Carry gewesen zu sein (als Jungler) fühlt sich dank der Honorierungen die man bekommt (3 Stück = \"most honorable player\" oder so) noch besser an.\nAllerdings sollte man LoL nicht 24/7 spielen, da man sonst die Lust verliert oder die \"Negativity\", die man möglicherweise aus einem frustrierenden Spiel mitnimmt, stacken könnte und der Tag und die eigene Elo so negativ beeinflusst wird.\n\nMfG :)","replies":[]},{"poster":"Henkobert","date":"2017-07-10T15:46:23.873+0000","up_votes":2,"down_votes":0,"body":"Ich hätte gerne 1 und 5 angekreuzt.\nÜberwiegend 1 aber auch ab und zu 5 :D","replies":[]},{"poster":"OSaftKiller","date":"2017-07-09T00:39:49.892+0000","up_votes":2,"down_votes":0,"body":"Es gibt kaum bzw. keine Cheater. Was abfuckt sind flamer wobei man damit umgehen kann.\n\nDen neuen Client finde ich eigentlich gut aber teilweise extrem unübersichtlich. Musste erstmal nee halbe Stunde suchen um dern Bereich im Shop zu finden bei dem man seinen Namen ändern kann.","replies":[]},{"poster":"Pilze","date":"2017-07-09T00:16:19.608+0000","up_votes":2,"down_votes":0,"body":"Sagen wir es mal so. Für mich als Gelegenheitsspieler perfekt. Ich kann Wochen nicht spielen und habe kein Nachteil, aber ich würde es mit dem Wissen von Heute nie wieder intensiv spielen. Es gibt hier einfach zu viele Hirnlose Spieler die einen den letzten Nerv rauben und nicht erkennen das sie die Fehler gemacht haben. \nAnsonsten ist das Spiel sehr gut und wird denke ich auch noch ein paar Jahre Online sein. Aber Spieltechnisch wird nichts mehr tun, es gibt halt 3 Seiten der Spieler. 1. Der Try Hard Gamer der alles daran setzt zu gewinnen und nie hoch kommen wird. 2. Die wirklich guten Spieler die das Game einfach verstanden haben. 3. Die Gelegenheitsspieler die sich mit 1 und 2 herum schlagen müssen.","replies":[]},{"poster":"Yasuo Jojo ","date":"2017-07-08T23:07:41.586+0000","up_votes":2,"down_votes":0,"body":"Ein überragendes Spiel :) macht mir riesigen Spaß zu spielen obwohl ich jeden Tag 5 Stunden zocke und das seit 2-3 Jahren :) bin mit Runen, Items und Champions sehr zufrieden weil jeder anderst ist und weil League total vielfältig ist :)","replies":[]},{"poster":"Alekra","date":"2017-07-08T22:50:30.628+0000","up_votes":2,"down_votes":0,"body":"Ich finde es super ^-^ kaum ein anderes spiel macht nach so langer zeit immernoch spaß und die meisten probleme sind ohnehin von der community ;D","replies":[]},{"poster":"SwissKeks","date":"2017-07-10T20:54:03.479+0000","up_votes":1,"down_votes":0,"body":"Ich fand nach nun gut 6 - 6 1/2 Jahren konstantem Spielen (bis auf eine Pause von einem halben Jahr) das League of Legends eines, wenn nicht, das beste Spiel der Welt ist.\n\nZum Spielspass: Anfangs war das Spiel extrem schwer. Es gab viele gefrustete Abende. Ich hatte das Glück mit Freunden spielen zu können, weswegen wir nicht direkt die Lust am Spiel verloren haben. Zwar war ich nach einem Jahr der einzige, der noch aktiv Spielte, aber das störte mich nicht. Ich fand recht schnell neue Spieler mit denen ich spielte. 11 Spieler durfte ich auch im Real-Life kennenlernen. Zu einem habe ich bis heute noch engeren Kontakt, und mit 4 ein bisschen loseren Kontakt und mit den restlichen Spielern habe ich keinen Kontakt mehr.\n\nDiese Bekanntschaften habe ich in meiner Rankedzeit gemacht. Ich wurde in mitte Silber eingerankt, damals in der S2. Recht schnell begriff ich das Spiel und ich stieg bis zu Diamant hoch. Das war irgendwann in S4 oder S5).\nSeit der 6. Season spiele ich nicht mehr aktiv, muss aber sagen das ich das Spiel echt liebe. Zwar nicht immer, aber naja.\nSeit dem bin ich nur noch auf den Boards aktiv. Die Boards kenne ich noch aus der S2, wo ich mehr oder weniger aktiv war, aber recht oft mitlas.\n\nWenn man auf Reddit oder den Boards aktiv ist merkt man recht schnell das Riot auch gerne Spieler eigene Ideen in das Spiel einbaut. Natürlich nicht alle, aber Riot hinterlässt meist auch eine Antwort warum diese Idee nicht in das Spiel eingebaut wird.\nEs ist frustrierend wenn man keine Antwort auf seine eigenen Ideen bekommt, aber vielleicht hat Riot UNS selbst zu sehr verwöhnt das wir vergessen, was leider der aktuelle \"normale\" Fall in der Spielindustrie wäre.\n\nKommen wir zu den Cheatern; Ich habe einige schlimme (und schlimmere) Bugs/Hacks/Cheats entdeckt (Habe mich eingelesen, aber nicht selbst gecheated) und Riot hat es oft geschafft diese nach wenigen Wochen auch zu bannen. Leider brauchten sie bei einigen \"verschwerwiegerenden\" Bugs/Hacks Monate.\n\nDen otto-Normalspieler (also mich) hat das aber nie wirlich beeinträchtigt. Ich selbst habe in meiner ganzen LoL-Karriere erst einen einigen Bugabuser angetroffen.\n\nLeague ist für mich nicht mehr nur ein Spiel. Es ist, so komisch das klingt, ein Teil von mir selbst geworden. Ich habe in der Meisten Zeit meiner Spielzeit über League nachgedacht. Und das nicht nur beim Spielen, auch in der Schule und beim Arbeiten. Vielleicht hätte ich ohne League auch nicht so eine diplomatische Lebensweise. Ich traf hunderte, wenn nicht tausende, Menschen durch Teamspeak, Skype und ähnlichem. Ich fand am ersten Tag in meiner Militärzeit direkt 4 Typen die auch League spielten. \n\nAlles nur weil wir ein einziges Spiel zusammen spielen.\n\nUnd sorry für die wirre Grammatik, hab 2 Bier intus\n{{sticker:slayer-jinx-catface}}","replies":[]}]}