{"poster":"Lionheart XIV","date":"2015-08-25T11:29:15.259+0000","title":"Chatrestriction; warum?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":5,"body":"Hallo Leute, Hallo liebe Mitbeschw&ouml;rer; Hallo liebes Riot-Team\n\nHeute Morgen also grade eben habe ich mich in meinem lol Account eingelogt und hab zu meinem verwundern festgestellt das ich f&uuml;r 75 Spiele eine Chatrestriction erhalten haben (dazu musst erw&auml;hnt werden das ich keine Nachricht per E-Mail bekam; mein Log in Name lautet *** der Beschw&ouml;rername RichardLionheart). Nat&uuml;rlich wei&szlig; ich dass ich ab und zu mal recht impulsiv reagiere und &uuml;ber die str&auml;nge schlage aber das passiert doch jedem oder?\n\nMfG\n\nRichard\n___\n\n_moderator note: Der login-Name stellt im Prinzip die Hälfte deines Passworts dar (sowohl dieser Name als auch das PW werden benötig um auf einen Account zuzugreifen) und sollte daher keinesfalls öffentlich verbreitet werden. Wir haben den Namen für dich zensiert. Bitte gehe in Zukunft vorsichtiger mit privaten Daten um._","replies":[{"poster":"Humpelstilzche","date":"2015-08-25T11:35:30.461+0000","up_votes":5,"down_votes":0,"body":"> Natürlich weiß ich dass ich ab und zu mal recht impulsiv reagiere und über die stränge schlage aber das passiert doch jedem oder?\n\nDa hast du den Grund. Entgegen deiner Annahme passiert das nur eine sehr kleinen Minderheit der Spieler öfter (etwa 5%). In LoL zu beleidigen/beschuldigen ist NICHT ok, auch wenn Leute die das tun häufig den fälschlichen Eindruck haben alle würden das tun. \nWenn du weitere (härtere) Strafen vermeiden willst, empfehle ich dir diese Art von Verhalten unverzüglich auf null zu reduzieren. Jetzt wo du deine erste Warnung bekommen hast, stehst du unter verschärfter Beobachtung. Lass es also nicht drauf ankommen und reiß dich am Riemen.","replies":[]},{"poster":"Wuhlesyndikat","date":"2015-08-25T11:32:49.321+0000","up_votes":4,"down_votes":0,"body":"Frage : Chatrestriction; warum? \nAntwort : \"dass ich ab und zu mal recht impulsiv reagiere und über die stränge schlage [...]\"\n\ndu beantwortest deine Frage bereits allein.","replies":[]},{"poster":"Patter91","date":"2015-08-25T11:30:43.399+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Lionheart XIV,realm=EUW,application-id=KYnfKGf0,discussion-id=fEbHHmrZ,comment-id=,timestamp=2015-08-25T11:29:15.259+0000)\n>\n> dass ich ab und zu mal recht impulsiv reagiere und &uuml;ber die str&auml;nge schlage aber das passiert doch jedem oder?\n\n\nNö. Zumal das für ne CR nicht nur ab und an, sondern sogar ziemlich regelmäßig der Fall sein muss.","replies":[]},{"poster":"Kaitri","date":"2015-08-25T11:33:28.296+0000","up_votes":1,"down_votes":0,"body":"aktuell gibts nur chatlogs für 14 tage bzw permabanns. \nes soll aber auch für RR/CR eingeführt werden (was ich gut finde!)\n\ndas passiert vielen nicht jedem und riot will dieses \"vielen\" aktuell auf \"(fast) gar keinem\" mehr reduzieren.","replies":[{"poster":"Alustus","date":"2015-08-25T11:37:09.062+0000","up_votes":2,"down_votes":0,"body":"ob das gelingen wird ? ;D","replies":[]}]},{"poster":"Abasin","date":"2015-08-26T07:27:51.840+0000","up_votes":1,"down_votes":0,"body":"Das passiert eben nicht jedem und ist auch nicht damit zu entschuldigen. Es passiert zunächst mal Dir und erklärt eindeutig, warum es zur Sperre kam.","replies":[]},{"poster":"Neelie","date":"2015-08-25T11:35:18.142+0000","up_votes":1,"down_votes":0,"body":"Ich hatte letztes jahr ne rankedsperre für 40 normal wins und ne chatrestriction auch für ne weile, warum ist mir immernoch nicht bewusst, passiert halt mal. Wenn du schon sagst das du mal über die stränge schlägst sollte es doch auch nicht wirklich was seltsames sein? :P","replies":[]}]}