{"poster":"dscpnak","date":"2017-10-29T01:48:16.578+0000","title":"a partir de que division los jugadores entienden que objetivos buscar?","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"la verdad me canse de perder partidas por este motivo por ejemplo: matar al jg y al mid y en vez de sacar heraldo o tirar mid el jg se va a hacer gromp, hacer un exterminio y en vez de pushear lo mas posible backean para comprar con 700 de oro, y asi puedo seguir y seguir y seguir (sin faltar obviamente la que queda el supp vivo nomas le tiramos inhibidor y en vez de terminarla se ponen a backear)...la verdad ya no se como hacer para que el equipo busque estos objetivos, pingueo se&ntilde;ales hablando en el chat, nada sirve. empeze a ir tristana casi siempre por lo rapido que derrite las torretas pero ya ni asi alcanza, la verdad ya estoy desorientadisimo\n\n\n\npd: me falto una perseguir a un lee sin despues de matarle 3 compañeros hasta casi su base con un baron free ( la mas reciente)","replies":[{"poster":"Mioen","date":"2017-10-29T03:17:28.388+0000","up_votes":4,"down_votes":0,"body":"Te puedo asegurar que hasta donde estoy Platino II la gente es muy derpy jugando.\n\nFlashean cualquiera cada tanto, cuando toca algún aliado Ex diamond quizás tiene más idea de lo que hace.\n\nMás o menos a partir de Diamante V tienen más idea de dónde están parados, cuando soy emparejado con estos team suelen ser partidas más rápidas.\n\nPero cuanto más subis más se tiltea la gente. Un error =1AFK o 1 FlamerAFK o 1 AFKInt.\nCosas locas.","replies":[{"poster":"dscpnak","date":"2017-10-29T03:51:31.694+0000","up_votes":1,"down_votes":0,"body":"ojala pudiera tener ese tipo de problemas y no un brand supp que va a melee contra un blitz hasta ir 0/14{{item:3151}} ( pasa en bronce, pasa en TNT)","replies":[{"poster":"Mioen","date":"2017-10-29T04:03:58.684+0000","up_votes":2,"down_votes":0,"body":"Vos metele gana nada más. Qué luego te encargas de los platinos y oros o lo que venga.\n\nGana partidas viejo.","replies":[{"poster":"Deigex","date":"2017-10-29T18:11:40.158+0000","up_votes":2,"down_votes":0,"body":"A nivel macro creo que los platino bajo fueron lo peor que me crucé en mi vida no sólo por las calls horribles que hacen sino porque se creen que tienen razón y tienen 0 macrogame. Muchos siguen sin leer el parche y saber como va el meta pickean cualquier cosa compran cualquier cosa, no son  eficientes con el oro que utilizan , no saben cuando rotar donde rotar ni porque se debe rotar.","replies":[{"poster":"Mioen","date":"2017-10-29T18:42:59.757+0000","up_votes":1,"down_votes":0,"body":"Es lo mismo que en todas las ligas. Lo que diferencia es que tienen un mejor micro que los jugadores de ligas bajas.\n\nDe ahi en mas no cambia mucho.\n\nTe puedo asegurar que en platino 2 puedes ganar partidas improvisando.","replies":[{"poster":"Deigex","date":"2017-10-29T19:28:23.334+0000","up_votes":1,"down_votes":0,"body":"Lo se, ya pase por esa liga jaja","replies":[]}]}]}]}]}]},{"poster":"KR9 Sweetlight","date":"2017-10-29T02:20:20.712+0000","up_votes":4,"down_votes":0,"body":"No lo sé, pero en elo bajo no tengas esperanzas, las partidas se ganan por no tener feeders en el equipo y porque alguien se fedea a base de kills y consigue matar matar a varios en una teamfigth, entonces, por fuerza, se tumban las lineas, se llega al inhibidor y se gana. Las gente quiere matar, quiere ver el \"300 de oro\", nadie sabe que los minions dan más oro que los asesinatos, que es más seguro, nadie sabe lo importantes que son los dragones, el heraldo esta olvidado, muchas veces ni se hace, baron es un lujo, es un lujo tener a los 5 miembros haciendolo porque muchas veces faltan integrantes. Jugar en elo bajo es una feísima experiencia y creo que muy pocos la pasan bien, sin mencionar el ambiente de flameo en el que se ganan o pierden las partidas. Necesitmaos una urgente reforma.","replies":[{"poster":"dscpnak","date":"2017-10-29T02:38:14.695+0000","up_votes":1,"down_votes":0,"body":"con lo que puse no digo que yo nunca la cago y que me las se todas soy b3 soloq y plata 5 en flex pero te puedo asegurar que investigo y trato de aprender TODO del juego pero lo basico lo se pero muchas veces (muy seguido por eso mi preocupacion) pareciera como que no conocen el juego y empezaron hace 15 min...te desmoraliza al mango siempre esas cosas","replies":[]}]},{"poster":"Fan de ZZK","date":"2017-10-29T02:14:21.256+0000","up_votes":3,"down_votes":0,"body":"en ninguna, a todos les gusta las kills","replies":[]},{"poster":"Cuchufleitor","date":"2017-10-29T07:02:24.353+0000","up_votes":2,"down_votes":0,"body":"Te diria que en platino 3, pero ahi tambien se tiltean y siguen la kill cuando llevan un tiempo de partida (en vez de seguir objetivos).\nSi queres dominar los objetivos vos solo, te diria que vayas jungla y uses un jg especializado en conseguirlos (shyvana, Master Yi, Warwick, etc)","replies":[{"poster":"dscpnak","date":"2017-10-29T07:43:35.645+0000","up_votes":2,"down_votes":0,"body":"mmm esa seria una MUY buena opcion, deberia desoxidarme del rol jg porque ahora estoy arruinado de jg (y nunca fui la octava maravilla en el rol la verdad jajja)","replies":[{"poster":"Cuchufleitor","date":"2017-10-29T17:10:25.665+0000","up_votes":1,"down_votes":0,"body":"Ser JG es leer el juego, saber donde tenes que estar y cuando. Si usas uno de esos jg no necesitas ser maravilloso mecanicamente. Nada mas acostumrbarte al daño que metes y al que podes aguantar. Cuanta vida te quedas despues de la primer pasada de jg, cuanto tardas, que tantas posibilidades de gankear o invadir tenes, cuando podes hacer un dragon o heraldo solo, etc","replies":[]}]}]},{"poster":"Angorra","date":"2017-10-29T06:01:09.620+0000","up_votes":2,"down_votes":0,"body":"Para mi eso varía según el jugador, la primer temporada que clasifiqué a algo, plata, básicamente yo jugaba para subir, no servía. Iba de plata V a plata II, y bajaba, subía, bajaba, subía.. terminé plata II.\nTemporada siguiente, arranco en plata III, como venía en racha desde provisionales y entre a promo en racha, saltee a plata I, ya con más mente en el juego y único objetivo subir a oro, no me importaba más, subí, jugando adc, buscando farm y torres, en su momento los dragones solo daban oro. (Subí y dejé la cuenta Oro IV).\nSiguiente año, arranco en Oro V, salto a Oro III, subo a II y I, pierdo la primer promo, gano la segunda, dejé en Platino IV.\n2016, subí a platino y lo dejé ahí, este año ya subí a oro y lo dejé ahí, no por falta de habilidad, sino porque sé que no voy a sacar provecho siendo diamante, o platino 1, y tengo otros enfoques igual, por lo tanto me basta con el skin.\n\n¿A qué va todo esto?\nQue no importa tanto la división (Si, pero no tanto), si vos empezás a comprender como ganar el juego, ganás, si ponele, parche anterior juego una ranked, Sejuani aún fuerte, nuestro jungla saca Shaco como last pick, el único tanque era yo, con un Nasus (No me fue mal, ayudé y todo, pero no por eso iba a ganar). Ellos teniendo un top tanque que no recuerdo cual era, pero era tanque, una Sejuani y un Braum, ya tenían todo el engage posible, no teníamos chance de ganar en late, descontando que si yo no iba a mid (siendo top) no progresaba la línea. En mi caso, mantuve bien mi línea, ayude al resto, habré tirado la mayoría de torres luego de teamfights en early, mientras mi team quizás iba recall o yo tiraba una torre y con tp me iba a tirar otra que estaba frágil.\n\nDepende de uno buscar objetivos y eso, vos mismo lo estás diciendo.\nEstás diciendo que sos distintos a ellos, no sé tu elo, ni nada, solo me guío por el texto, \n\nA la larga vas a subir, es cosa de jugar con la cabeza en frío, no flamear, ir por objetivos, usar picks god tier, practicar unos dos campeones por línea, que no sean permaban, ejemplo, actualmente en normal solo juego nasus top, karthus mid, rek'sai jungla, y si me toca en bot varía.\nEsto no quita que juegues con otros como Cho'Gath, Maokai, Gnar, Rumble inclusive es muy muy buen pick, en jungla si tengo ganas de no jugar tan serio voy con otros picks Kayn, Sejuani, Jarvan IV, inclusive Morgana (varias veces pero en normal) (hablo de mi caso de top o jg).\n\n> (en mi caso cuando salío Rek'Sai, tengocuenta PBE desde el 2013 apróx, entonces ya había practicado en el PBE, entrando acá mi team no me tenía confianza si iba a top, terminaba feedeadísimo por el daño exagerado que tenía, lo mismo en jungla, actualmente es mi main por más nerfeo y cambio en la R que se comió [que fue bueno y malo]. Subí de Oro V a Platino IV con un solo campeón y dejé de jugar. God tier.)","replies":[{"poster":"dscpnak","date":"2017-10-29T06:20:46.356+0000","up_votes":1,"down_votes":0,"body":"nono, no digo que sea distinto a ellos por algo estoy donde estoy pero es cuestion de aplicar lo que vi mil y una veces antes de rankear (rotaciones, composiciones, runas, maestrias, toma de objetivos, etc) que me equivoco a veces en estos puntos, si obvio soy humano y bronce (peligrosa combinacion jaja) pero  bueno era esa duda si esto iba mejorando a medida que se sube porque hay muchos que no es que se equivocan sino que tienen total desconocimiento de estos puntos, justamente estoy haciendo eso que decis 2 campeones por linea y cosas op (top: gnar y nasus, mid: malzahar y syndra, aunque en mid esoty algo abandonado al igual que jg con lo que iba sejuani, o en caso de ir mas enfocado al daño jax o xin y en adc tristana y ezreal en proceso de usar a kog maw y supp utilidad soraka o lulu y si es supp tank mi querido sapo tahm kench o leona","replies":[{"poster":"Angorra","date":"2017-10-31T18:17:44.173+0000","up_votes":1,"down_votes":0,"body":"Es que no importa que seas bronce con la mentalidad que ya tenés, con el tiempo vas a salir y ellos quedarse donde están, porque vos estás intentando cambiar, y eso parte de uno mismo :p","replies":[]}]}]},{"poster":"Yo sin Ella","date":"2017-10-29T02:11:55.556+0000","up_votes":2,"down_votes":0,"body":"Nunca","replies":[]}]}