{"poster":"AgeTea","date":"2016-09-21T10:38:06.573+0000","title":"ARAM wird von RIOT nicht ernst genommen","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":4,"body":"Hey Leute,\r\n\r\nich habe immer mehr das Gef&uuml;hl, dass andere Spielmodi von Riot nicht ernst genommen werden. Und hiermit meine ich nicht die Special-Modi die sich abwechseln, sondern vor allem ARAM!\r\n\r\nIn letzter Zeit sind verst&auml;rkt Bots in dem Spiel und das nur ein einem Team und nicht in beiden. Diese Bots sind alles andere als eine Hilfe f&uuml;r das eigene Team sondern &auml;hneln eher jemanden der absichtlich feeded. Das macht auf Dauer einfach gar keinen Spa&szlig; mehr hoffen zu m&uuml;ssen, keinen Bot im Spiel zu haben. Auch wenn der Gegner einen hat, macht das Spielen keinen Spa&szlig;. Es geht ja nicht nur ums gewinnen, sondern auch darum, dass man Spa&szlig; daran hat, seinen Charakter gut und richtig zu spielen.\r\n\r\nAber generell finde ich, werden die anderen Spielmodi vernachl&auml;ssigt. So eine WM mag ja toll sein und ich wei&szlig;, dass es mit vielen Arbeiten verbunden ist, fl&uuml;ssiges und gutes Gameplay zu gew&auml;hrleisten, aber: Wo bleiben wir? Wir die eben nur aus Spa&szlig; spielen, sich nicht f&uuml;r eine WM interessieren und dennoch Geld f&uuml;r Skins und Co ausgeben. Au&szlig;er Champion gibt es keine gute &Auml;nderung im gesamten Spiel, die einfach mal frischen Wind in das Spiel bringt.\r\n\r\nAllein die Map in Aram ist extrem veraltet und aktionsweise war die Map von Biegewasser drin - warum ist die nicht wenigstens geblieben?\r\n\r\nIch w&uuml;rde mir einfach mehr Beachtung f&uuml;r die w&uuml;nschen, die nicht nur das klassische LoL spielen wollen. Ich pers&ouml;nlich mag die Charaktere die es gibt und die Storys dazu und alles drum herum. Aber es es kommt einfach nicht &quot;mehr&quot;. In den Charakteren steckt so viel mehr Potenzial, dass schon ein Storymodus Sinn machen w&uuml;rde. Aber ein komplett neuer Modus sei mal dahin gestellt.\r\n\r\nIn erster Linie w&uuml;rde es doch toll sein, dass Aram mal ein bisschen mehr Beachtung geschenkt bekommt und vor allem diese Bots verschwinden. Dann habe ich lieber einen Spieler der in viel h&ouml;heren R&auml;ngen spielt, als ein Bot!\r\n\r\nIch hoffe das wird irgendwie von RIOT geh&ouml;rt werden und sie sind an einigen Sachen dran... fr&uuml;her oder sp&auml;ter wird es einfach nur noch langweilig und es ist schade &auml;ltere Spieler zu vergraulen, nur weil stetig neue dazu kommen.\r\n\r\nGru&szlig;","replies":[{"poster":"Humpelstilzche","date":"2016-09-21T11:21:05.948+0000","up_votes":3,"down_votes":0,"body":"> Allein die Map in Aram ist extrem veraltet und aktionsweise war die Map von Biegewasser drin - warum ist die nicht wenigstens geblieben?\n\nNaja, nicht wirklich. Howling Abyss ist grafisch die aufwändigste Map. Die Bilgewasser-Map war zwar cool und eine nette Abwechslung, aber von der Qualität her weit unter der Standard-Karte. \n\nAnyway....ich zähle mich selbst auch zu den passionierten Aram-Spielern (ich hab letzte Woche meinen 1000en Aram-Win gehabt), habe aber momentan echt keine Beschwerden über den Modus. Sicher, ein alternativer Map-Skin wäre mal eine nette Abwechslung, aber das gilt auch für alle anderen Modi. Bots sind mir persönlich noch nie begegnet (aber ich weiß natürlich, dass sie existieren). ","replies":[]},{"poster":"Jastol","date":"2016-09-21T10:54:57.389+0000","up_votes":4,"down_votes":1,"body":"ARAM ist nur ein FUN Mode, wird also niemals so viel Zuneigung wie das 5vs5 bekommen. Vor allem das Balancing ist hier weit unausgeglichener als im 5vs5, dafür gehen die Matches in der Regel auch nicht so lange und sich über ein Verlorenes ARAM aufregen ist lächerlich.\n\nZum Thema Bots: Also irgendwie hatte Ich noch nie Bots in ARAM.","replies":[]},{"poster":"Gang Hei","date":"2016-09-21T10:50:24.712+0000","up_votes":1,"down_votes":4,"body":"Ich denke, wenn Riot sich das nächste mal um ARAM kümmert, wird es darum gehen, dass ARAM abgeschafft wird.","replies":[{"poster":"Shadowscreen","date":"2016-09-21T10:53:10.021+0000","up_votes":2,"down_votes":0,"body":"im gegensatz zu dominion wird aram aber wesentlich aktiver gespielt glaube ich","replies":[]}]},{"poster":"CYPHΕR","date":"2016-09-21T13:42:08.677+0000","up_votes":2,"down_votes":1,"body":"- ARAM taucht  als Randerscheinung in Customgames auf der Tutorialmap auf.\n\n- Spieler fangen an sich über das permanente Dodgen in der Championselect (welches in Customgames ohne Strafe möglich ist) auf, wenn Spieler nicht ihre Wunschchampions bekommen\n     -> Spieler sammeln sich, beschweren sich deswegen und Fragen Riot an, ob man nicht eine eigene richtige Queue daraus machen könnte, um so die ständigen CS-Dodger einzudämmen\n    ->Riot befasst sich als Entgegenkommen mit dem Funmode und bindet ihn als seperate Queue mit eigener Lobby und eigenem Matchmaking ein\n\n- Spieler finden die Tutorialmap langweilig, altmodisch und fordern ein Rework\n    -> Riot befasst sich als Entgegenkommen mit dem Funmode und baut eine komplette neue Karte im Rahmen des Freljord-Events (mit großer Hintergrundgeschichte, Icons, Skins, eigener Musik, etc...) ein\n\n- Spieler beschweren sich über das unfaire Balancing eines Funmodes, bei dem der Zufall der essenzielle Aspekt ist\n    -> Riot befasst sich als Entgegenkommen mit dem Funmode und fängt nicht nur an ein eigenes Balancing für ARAM zu betreiben, sondern kreiert sogar eigene Items und Summoners extra für diesen Funmode\n\nusw. usw.\n\n\nEgal wie sehr Riot immer wieder den ARAM-Spielern entgegenkommt, immer wieder wird nur gemeckert und gefordert. Nie ist man mal wirklich zufrieden sondern stellt alles eher als Selbstverständlichkeit hin.\n\n> ich habe immer mehr das Gefühl, dass andere Spielmodi von Riot nicht ernst genommen werden\n\nDas ist einfach nur Falsch. Wie bereits geschrieben ist Riot sogar sehr stark auf die ARAM-Spieler eingegangen und hat sehr wohl die Anfragen ernst genommen.\n\nBots selber habe ich noch keinen einzigen in meinen über 1000 ARAMs gesehen. Sie mögen zwar existieren, allerdings sammeln die sich (soweit ich von Erfahrungsberichten weiß) in den untersten Ebenen des ARAM-MMR-Bereichs (wenn man das mal so nennen will), da sie eh nur sinnlos hinterherlaufen, kaum Items bauen und die Spells nur sporadisch benutzen. Ich frage mich eher wie man es schaffen kann in diese MMR-Bereiche abzurutschen, dass man permanent nur noch Bots sieht...\n\n> Aber generell finde ich, werden die anderen Spielmodi vernachlässigt. So eine WM mag ja toll sein und ich weiß, dass es mit vielen Arbeiten verbunden ist, flüssiges und gutes Gameplay zu gewährleisten, aber: Wo bleiben wir? Wir die eben nur aus Spaß spielen, sich nicht für eine WM interessieren und dennoch Geld für Skins und Co ausgeben. Außer Champion gibt es keine gute Änderung im gesamten Spiel, die einfach mal frischen Wind in das Spiel bringt.\n\nWie bereits Oben geschrieben. Riot ist euch bereits in extremem Maße entgegengekommen, aber ihr seht alles nur als selbstverständlich an und seid nichtmal wirklich dankbar sondern kritisiert Riot eher noch dafür. Seid doch einfach mal mit irgendwas zufrieden... Riot hat schließlich nicht unendlich Ressourcen (Mitarbeiter) zur Verfügung die sich um alles mögliche kümmern können. Dominion wurde deswegen sogar abgeschafft.\n\n> Interessante Sichtweisen, aber warum sollte das Spiel nicht mehr Aufmerksamkeit erhalten, nur weil es kein 5vs5 ist. \n\nWeil 5v5 auf SR nunmal der Kern von League of Legends ist. Das ganze Spielprinzip baut auf diesem Modus auf. ARAM ist lediglich eine Abwandlung dieses Kerns den man aus Kulanz und zur Freude der Community deutlich stärker gepflegt hat als es viele andere Spieleentwickler jemals tun würden. Die meisten Spieler spielen League nur wegen diesem 5v5 Modus. Der ganze competitive Bereich entwickelt sich ausschließlich um diesen Bereich. Ich würde soweit gehen und sogar sagen dass du für die ganze Aufmerksamkeit dankbar sein solltest, die Riot diesem Modus entgegenbringt und sie nicht sogar so in Frage stellen solltest...","replies":[]},{"poster":"Megamaexx","date":"2016-09-21T21:07:29.733+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AgeTea,realm=EUW,application-id=cGRapXds,discussion-id=Vr0bLEhc,comment-id=,timestamp=2016-09-21T10:38:06.573+0000)\n>\n\n> \n> In letzter Zeit sind verstärkt Bots in dem Spiel\n\nDann reporte die Bots fleißig, hoffentlich werden die gebannt, bevor jemand den Account verkauft. \n\n> Außer Champion gibt es keine gute Änderung im gesamten Spiel,die einfach mal frischen Wind in das Spiel bringt.\n\nAußer der 2-wöchige Patch, die rotierenden Spielmodi, die Hextech-Kisten und regelmäßig neue Skins kam da echt nicht viel neues, was neuen Wind gebracht hat... \n\n> Allein die Map in Aram ist extrem veraltet und aktionsweise war die Map von Biegewasser drin - warum ist die nicht wenigstens geblieben?\n\nIch mag die Bilgewasser Map gar nicht, die Heulende Schlucht finde ich großartig. \nVeraltet ist übrigens anders. Die passt super zum aktuellen Spiel.\n> \n> Ich würde mir einfach mehr Beachtung für die wünschen, die nicht nur das klassische LoL spielen wollen. \n\nSowas wie spezielle Items in ARAM. Oh, haben sie ja sogar gemacht. Auch für den gewundenen Wald kommen immer mal wieder Updates.\n\n>Ich persönlich mag die Charaktere die es gibt und die Storys dazu und alles drum herum. Aber es es kommt einfach nicht “mehr“. \n\nSie updaten zwar Stories, aber wirklich Neues zu den bestehenden Champions scheint nicht dazuzukommen. Das ist tatsächlich etwas schade.\n> \n> In erster Linie würde es doch toll sein, dass Aram mal ein bisschen mehr Beachtung geschenkt bekommt und vor allem diese Bots verschwinden. Dann habe ich lieber einen Spieler der in viel höheren Rängen spielt, als ein Bot!\n\nUm das zu erreichen, musst du deine ARAM-MMR pushen. Ich kann mich an keinen einzigen Bot in meinen ARAMs erinnern.","replies":[]},{"poster":"AgeTea","date":"2016-09-21T12:09:22.715+0000","up_votes":1,"down_votes":0,"body":"Interessante Sichtweisen, aber warum sollte das Spiel nicht mehr Aufmerksamkeit erhalten, nur weil es kein 5vs5 ist. Das Balancier kann man ändern. Auch ein Punkt den ich mir persönlich wünsche. Ich mag eigentlich das Random Spiel, weil ich so auch neue Charaktere ausprobiere, die ich sonst nicht ausprobiert hätte und bin schon so zu neuen Mains gekommen. Aber es ist auf jeden Fall verbesserungswürdig.\n\nIch finde LoL kann bzw. ist ein so großes Spiel (sein). Aber eben auch mit anderen Modi die  andere gerne spielen werden, wenn da auch mehr Liebe reingesteckt wird.\n\nEwig ein 5vs5 in der Kluft der Beschwörer wird mir persönlich einfach zu langweilig. Jetzt kann man natürlich sagen, dann spiele doch etwas anderes. Aber ich will ja LoL spielen, aber die Inhalte, zumindest in anderen Modi müssen sich mal ändern oder besser werden.\n\nUnd zur Map: Mag sein, dass die bisherige von der technischen Leistung weiter ist, als die von Bilgewasser, aber mir persönlich geht es eher um einen Wechsel. Nicht grafisch gesehen, sondern die Atmosphäre sollte eine andere sein.\n\nUnd zu den Bots: Es geht auch echt nicht darum, ein Spiel in Aram zu gewinnen oder zu verlieren. Das ist mir auch in der Kluft völlig egal. Für mich ist ein schönes Spiel wichtig, welches die Charaktere und dein Wissen darum ausschöpfen und wenn das auf beiden Seiten gelungen ist, dann war es ein schönes Spiel. Der Sieg ist nur die Kirsche auf dem Sahnehäufchen.","replies":[]},{"poster":"wolf454","date":"2016-09-21T11:21:48.451+0000","up_votes":1,"down_votes":0,"body":"Competetiv arm ist halt sehr Glückslastig. Da es viele op Kombinationen gibt (veigar/teemo) und die map auf der aram spielt ist ja ziemlich neu^^ und bald kommt ja ARURF worauf ich mich sehr freue^^","replies":[]},{"poster":"thefire7","date":"2016-09-21T11:03:09.464+0000","up_votes":1,"down_votes":0,"body":"Natürlich kümmert sich riot um aram lul","replies":[]}]}