{"poster":"FeliCai","date":"2017-01-30T01:35:48.164+0000","title":"Me emparejan con gente que recien empieza en ranked","subforum":"Comportamiento del jugador","up_votes":5,"down_votes":9,"body":"Tengo un problema yo quiero pasar de division y no puedo porque juego una ranked con mi duo  y nos emparejaron con dos personas una tenia 90 victorias en normal y warwick no tenia un historial bueno y probo al campeon yo tengo 550 victorias en normales y tengo ello de bronce 1 y me  ponen con gente que me hace bajar gente que rankea cuando llegan al lvl 30  quiero una respuesta porfavor{{champion:18}}","replies":[{"poster":"Americans","date":"2017-01-30T01:37:54.868+0000","up_votes":2,"down_votes":1,"body":"Perdes por tu culpa, no por la del \"unranked\", y si te toca con el es porque ambos tienen el mismo elo. Deja de fijarte en los errores de los demas y las excusas y fijate en los tuyos propios.","replies":[{"poster":"Zinc","date":"2017-01-30T01:41:26.206+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Americans,realm=LAS,application-id=PJAKt7ph,discussion-id=O6haILcl,comment-id=0000,timestamp=2017-01-30T01:37:54.868+0000)\n>\n> Perdes por tu culpa, no por la del &quot;unranked&quot;, y si te toca con el es porque ambos tienen el mismo elo. Deja de fijarte en los errores de los demas y las excusas y fijate en los tuyos propios.\n\nNope, estas equivocado. Eso pasa porque los unrankes a medida que juegan los van probando con gente de distintas ligas y elos, y a mas ganan mejor gente les ponen.\n\nAquellos que juegan en bronce/plata les puede tocar que unranked sean emparejados con ellos, pero se supone q del otro lado tambien deberia haber otro unranked, por cual no dejaria de ser justo.\n\nEn cuanto al post en si, es un mal necesario y no hay nada que hacer al respecto.","replies":[{"poster":"Americans","date":"2017-01-30T01:49:01.471+0000","up_votes":2,"down_votes":1,"body":"No van probando con gente al azar, van \"probando\" segun ganen y pierdan. Un unranked empieza con 1200 de mmr, bronce 1 tiene alrededor de 1100 creo, es normal que al perder una les toque con ellos. \n\nNo se supone que del otro lado tenga que haber otro unranked, los unranked no son nenes que no tienen idea del juego, algunos van preparados y otros menos, pero son iguales de buenos que los bronces y silver. La persona se queja que, estando en una de las peores ligas del juego, le toque con gente mala.","replies":[{"poster":"Zinc","date":"2017-01-30T02:01:44.842+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Americans,realm=LAS,application-id=PJAKt7ph,discussion-id=O6haILcl,comment-id=000000000000,timestamp=2017-01-30T01:49:01.471+0000)\n>\n> No van probando con gente al azar, van &quot;probando&quot; segun ganen y pierdan. Un unranked empieza con 1200 de mmr, bronce 1 tiene alrededor de 1100 creo, es normal que al perder una les toque con ellos. \n> \n> No se supone que del otro lado tenga que haber otro unranked, los unranked no son nenes que no tienen idea del juego, algunos van preparados y otros menos, pero son **iguales de buenos que los bronces y silver**. La persona se queja que, estando en una de las peores ligas del juego, le toque con gente mala.\n\nSe nota que sos elo alto, tomalo como un cumplido.","replies":[{"poster":"Americans","date":"2017-01-30T02:09:11.506+0000","up_votes":1,"down_votes":0,"body":"Para ser bronce o silver en algun momento tuviste que ser unranked, a menos que pienses que se llega  bronce por culpa del equipo.","replies":[{"poster":"Zinc","date":"2017-01-30T02:20:03.519+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Americans,realm=LAS,application-id=PJAKt7ph,discussion-id=O6haILcl,comment-id=00000000000000000000,timestamp=2017-01-30T02:09:11.506+0000)\n>\n> Para ser bronce o silver en algun momento tuviste que ser unranked, a menos que pienses que se llega  bronce por culpa del equipo.\n\nAmigo, el MMR del cual hablaste en tu comentario anterior, cuando empesas la ranked es un valor completamente fantasma. Yo sumaba 300k de pts de maestria con mis 4 o 5 mains antes de rankear y aun asi era muy poco lo que sabia del juego.\nY aun sabiendo poco y nada m las arreglue para ganar 5/10 y quedar en plata 4. Te puedo decir con toda humildad que el sistema le erro feo conmigo, tan pronto empese a jugar baje a plata 5 y a partir de ahi cambie completamente mi mentalidad y empese a aprender. \n\nLos unranked no juegan al nivel de plata ni de las ligas mas altas de bronce, sobre todo ahora que hay muchos ex plata en bronce por el reinicio de temporada. \n\nLas diferencias son completamente perceptibles, cantidad de wards, vision del mapa, farm, todo. \n\nRealmente no podria apostarte mucho a q si de un lado hay un unranked del otro tambien, pero te garantiso que hay diferencia y hay mucha. Yo mismo podria citarte partidas de mi historial no tan recientes en las cuales solo ver los datos te das cuenta quien es unranked y quien es ex plata.\n\nEn parte por esto te decia que se nota que sos elo alto, por que se nota claramente que olvidaste cmo son estas ligas, o cuando vs las jugaste las cosas eran muy distintas.\n\nIgual te lo repito: Siempre que hay un unranked de un lado, de alguna de forma del otro hay algo que lo compensa, porque basicamente, no es lo mismo.","replies":[{"poster":"Americans","date":"2017-01-30T02:33:42.967+0000","up_votes":2,"down_votes":0,"body":">Los unranked no juegan al nivel de plata ni de las ligas mas altas de bronce\n\nY como es que muchos unranked terminan en esas ligas, o siguen subiendo hasta oro? Bronce y plata son por debajo del promedio, el 50% del server esta ahi, es posible y normal que alguien unranked que apenas llego a 30 supere el nivel **promedio**.\n\nCuando yo jugue apenas salia de nivel 30, creo que no tenia ni todas las runas, y aun asi gane unas 4 o 5 y termine en plata V, de ahi seguí subiendo sin problemas hasta platino. Asi conozco mucha gente que simplemente tiene talento o aprendió durante los primeros niveles a jugar.\n\nPensar que un unranked automaticamente es peor que un plata o bronce es decir que es peor que el promedio. Algunos unranked son malos, si, como otros son buenos. \n\n\n>cuando empesas la ranked es un valor completamente fantasma\n\nNo es un valor fantasma, es 1200, lo que seria como un \"Plata V\". El problema es que muchos lo primero que hacen al entrar en una ranked es fijarse la liga de todas las personas y ya se hacen una imagen mental de si ganan o pierden, y ya con eso se fustran y juegan peor.\n\n¿Sabes cuantas veces me fije el elo de la gente con la que juego en esta season? 0, y ya jugue unos 65 games. Simplemente saber si es unranked, plata, bronce o oro no te aporta nada positivo a tu juego.","replies":[{"poster":"Zinc","date":"2017-01-30T06:08:06.589+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Americans,realm=LAS,application-id=PJAKt7ph,discussion-id=O6haILcl,comment-id=0000000000000000000000000000,timestamp=2017-01-30T02:33:42.967+0000)\n>\n> Y como es que muchos unranked terminan en esas ligas, o siguen subiendo hasta oro?\n\n\n\nSi te soy honesto yo me pregunto lo mismo. Y la respuesta que me hago es justamente la que te di: Que el mmr inicial es un valor fantasma, una vaga indicacion inexacta del nivel del jugador, almenos cuando recien arranca a jugar.\n\n>Bronce y plata son por debajo del promedio, el 50% del server esta ahi, es posible y **normal** que alguien unranked que apenas llego a 30 supere el nivel **promedio**.\n> \n\n\n\nNo exageres tampoco, si la AMPLIA mayoria del server esta en plata/bronce es por que claramente lo \"normal\" es que no se vayan expreso a oro o platino.\n\n> Cuando yo jugue apenas salia de nivel 30, creo que no tenia ni todas las runas, y aun asi gane unas 4 o 5 y termine en plata V, de ahi seguí subiendo sin problemas hasta platino. Asi conozco mucha gente que simplemente tiene talento o aprendió durante los primeros niveles a jugar.\n> \n> Pensar que un unranked automaticamente es peor que un plata o bronce es decir que es peor que el promedio. Algunos unranked son malos, si, como otros son buenos. \n> \n\n\n\n\nPor eso mismo te decia que se nota que sos ELO alto y que no sabes de lo que estas hablando. A ver, no te digo que el 100% de los que aun no han ranqueado juegan con los codos, pero si te aseguro que no es ninguna rareza ver diveos fallidos bajo torre al lvl 3, destello que se parten la cara contra un muro, ver al mid bajando x el rio teniendo la vision del escurridiso y aun asi morirse en la jugada en la bot lane, gente que no solo no sabe lasthitear si no que, ademas, le resbala.\n\nSon cosas que se notan jugando, la ves y se sienten en la partida.\n\n\n> No es un valor fantasma, es 1200, lo que seria como un &quot;Plata V&quot;. El problema es que muchos lo primero que hacen al entrar en una ranked es fijarse la liga de todas las personas y ya se hacen una imagen mental de si ganan o pierden, y ya con eso se fustran y juegan peor.\n> \n\n\nEs un valor fantasma xq es el valor inicial que te atribuye el juego, en solo 10 partidas determinar el nivel de un jugador es imposible. Yo mismo recuerdo haber ganado 5/10 cuando las hice por primera ves y en algunas gane xq m carrearon asquerosamente, asi como en otras aporte. Entendes a lo que me refiero con \"fantasma\"? ese MMR es pura especulacion basado en 10 partidas (nada) no tiene valor real.\n\n\n> ¿Sabes cuantas veces me fije el elo de la gente con la que juego en esta season? 0, y ya jugue unos 65 games. Simplemente saber si es unranked, plata, bronce o oro no te aporta nada positivo a tu juego.\n\nDepende el uso que le des.","replies":[{"poster":"Americans","date":"2017-01-30T16:48:15.283+0000","up_votes":1,"down_votes":0,"body":"No estoy exagerando, el 50% realmente esta en bronce y plata. Es tan normal que uno termine alli como que juegue bien y termine en oro/platino/diamante. De hecho me equivoque el numero bastante, realmente el 78% del servidor esta entre plata y bronce. https://las.op.gg/statistics/tier/\n\nPero aun asi con el 78%, que estos se quejen de que \"los unranked arruinan el juego\" es una estupidez sobre todo porque para ser oro ni siquiera necesitas jugar bien, solo no jugar terriblemente mal.\n\n>ninguna rareza ver diveos fallidos bajo torre al lvl 3, destello que se parten la cara contra un muro, ver al mid bajando x el rio teniendo la vision del escurridiso y aun asi morirse en la jugada en la bot lane\n\nExactamente esas jugadas no, pero en todos los elos hay gente que hace estupideces que no deberian haber hecho.\n\n>Depende el uso que le des.\n\nQue uso le podes dar que sea beneficiario para algo? Tiltearte antes de la partida?","replies":[{"poster":"Zinc","date":"2017-01-30T18:52:08.912+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Americans,realm=LAS,application-id=PJAKt7ph,discussion-id=O6haILcl,comment-id=000000000000000000000000000000010000,timestamp=2017-01-30T16:48:15.283+0000)\n\n> Que uso le podes dar que sea beneficiario para algo? Tiltearte antes de la partida?\n\n\nNo me termino de dar cuenta si es sarcasmo o a que queres llegar. Insistis en que es un factor sin importancia pero no paras de atribuirle connotaciones negativas. \n\nQue se yo, uno \"presume\" que si el adc es gold se va saber posicionar y no va haber q hacerle peel de a 8 pa q no se muere, si fuera el top, que va saber usar el TP y o moverse de linea sin nesecidad de tener q hablarle como a un niño chico, si es el MID que va ser capaz de moverse 3mts para el lado del rio cuando los JG se encuentren luchando por el escurridiso.\n\nPero como te vengo diciendo, son cosas que basicamente vos no te podes imaginar xq en tu ELO das x entendido que todos lo hacen y o lo saben hacer, ak amigo mio las cosas son distintas.","replies":[{"poster":"Americans","date":"2017-01-30T20:53:49.997+0000","up_votes":1,"down_votes":0,"body":"Sin importancia en el sentido que no agrega nada positivo, solo cosas negativas.\n\n>si el adc es gold se va saber posicionar y no va haber q hacerle peel\n\nY como sabes si el equipo enemigo no lo va a deletear, aun estando bien posicionado? O como sabes que esa persona que juega top esta en su main role y sabe usar tp? Mucho mas facil no ver las ligas y jugar haciendo de cuenta que todos son tu liga y listo.\n\nNo doy por entendido nada, jugue en silver, jugue en oro y mi smurf es plata alta/oro bajo ahora mismo. Ayer jugue una en donde me robaron baron dos veces siendo el jungla, mi liga tuvo algo que ver? no.","replies":[{"poster":"Zinc","date":"2017-01-30T22:12:53.826+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Americans,realm=LAS,application-id=PJAKt7ph,discussion-id=O6haILcl,comment-id=00000000000000000000000000000001000000000000,timestamp=2017-01-30T20:53:49.997+0000)\n>\n> **EN MI OPINION** Sin importancia en el sentido que no agrega nada positivo, solo cosas negativas.\n\n\nEso es una vision plenament tuya\n> \n> Y como sabes si el equipo enemigo no lo va a deletear, aun estando bien posicionado? O como sabes que esa persona que juega top esta en su main role y sabe usar tp? Mucho mas facil no ver las ligas y jugar haciendo de cuenta que todos son tu liga y listo.\n\n\n\n\nNo me saques cosas de contexto, queda feo eso. \n\nYo dije claramente \"uno **presume**...\" no es lo mismo.\n> No doy por entendido nada, jugue en silver, jugue en oro y mi smurf es plata alta/oro bajo ahora mismo. Ayer jugue una en donde me robaron baron dos veces siendo el jungla, mi liga tuvo algo que ver? no.\n\nErrores puntuales tienen Faker y DOPA, pero no es lo mismo eso que una serie de errores.","replies":[{"poster":"Americans","date":"2017-01-30T22:16:24.911+0000","up_votes":1,"down_votes":0,"body":"Es mi opinion, por eso te pregunte la tuya de porque lo ves como algo positivo saber sus ligas.\n\nLe podes preguntar a los profesionales y la gran mayoria tambien te va a decir que saber la ligas de las personas no te sirve para nada mas que para jugar peor.","replies":[{"poster":"Zinc","date":"2017-01-30T22:34:07.352+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Americans,realm=LAS,application-id=PJAKt7ph,discussion-id=O6haILcl,comment-id=0000000000000000000000000000000100000000000000000000,timestamp=2017-01-30T22:16:24.911+0000)\n>\n> Es mi opinion, por eso te pregunte la tuya de porque lo ves como algo positivo saber sus ligas.\n> \n> Le podes preguntar a los profesionales y la gran mayoria tambien te va a decir que saber la ligas de las personas no te sirve para nada mas que para jugar peor.\n\nPues me resulta curioso. Hace un par de respuestas atras me preguntaste con sarcasmo si yo concideraba que la liga de una dependiendo de los teams que te toquen, lo que, dicho de otra manera, es lo mismo que decir que consideras que la liga de uno es reflejo de su nivel de juego.\n\nComo podria resultarme contraproducente tener una idea (por minimo que sea) del nivel de un compañero?\n\nAca la cuestion no es la informacion en si misma, es el uso que le de cada uno. \n\nYo hace ya varias respuestas que me vengo haciendo a la idea de que vos pensas q yo veo que un bronce la manquea y automaticamente lo flameo toda la partida y le atribuyo la derrota y no, no es asi.\n\n\nA mi no me hace jugar peor, me hace jugar diferente.","replies":[]}]}]}]}]}]}]},{"poster":"FedecarboneroUY","date":"2017-01-30T02:52:34.965+0000","up_votes":1,"down_votes":0,"body":"ser unranked no significa jugar peor o mejor que un plata/bronce, yo la season pasada en mi smurf jugué las 10 de posicionamiento y quedé plata 2, después el último día que quedaba para rankear casi subo a plata 1 pero en el último game la cague xD","replies":[{"poster":"Americans","date":"2017-01-30T03:24:56.911+0000","up_votes":1,"down_votes":0,"body":"Eso es lo que estoy tratando de decir.","replies":[{"poster":"FedecarboneroUY","date":"2017-01-30T04:11:14.868+0000","up_votes":1,"down_votes":0,"body":"si lo sé, sólo trataba de dar un ejemplo no me pegues D:","replies":[]}]}]}]}]}]}]},{"poster":"Summer Nights","date":"2017-01-30T02:02:48.781+0000","up_votes":1,"down_votes":0,"body":"Agree con esto, es bastante normal que lo emparejen así y tiene sentido, por más que el unranked recién haya llegado a 30 tienen prácticamente el mismo mmr y en algunos casos el mismo skill porque muchos aprenden a distintas velocidades. De todas formas esos games de low elo si el del post supiera jugar bien el juego podría ganarlos 1vs5 tranquilamente, el hecho de que no pueda ganar la mayoría de los games denota que merece estar ahí, de hecho creo que hasta la queja de un unranked que perdío una partida y lo emparejan con un bronce tendría mas validez en ese sentido, dado que por un game perdido previamente lo pueden matchear significativamente para abajo y tener que comerse jugar con bronces cuando no es su respectiva skill (aunque ganando un par de games el mmr vuelve a subir, so basicamente el que merece subir sube)","replies":[]}]}]}]},{"poster":"iH3RN4Ni","date":"2017-01-30T01:40:12.698+0000","up_votes":3,"down_votes":1,"body":"Fuiste bronce 5.. ahora sos bronce 4 y tenes el mmr bajo, esta bien que te emparejen con gente que recien arranca porque son iguales a vos.","replies":[]},{"poster":"IIIIIIIIIIIIIIII","date":"2017-01-30T03:51:52.305+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FeliCai,realm=LAS,application-id=PJAKt7ph,discussion-id=O6haILcl,comment-id=,timestamp=2017-01-30T01:35:48.164+0000) Tengo un problema yo quiero pasar de division y...\n\n...y queres que la gente te carreé\n\n> [{quoted}](name=FeliCai,realm=LAS,application-id=PJAKt7ph,discussion-id=O6haILcl,comment-id=,timestamp=2017-01-30T01:35:48.164+0000)nos emparejaron con...\n\n...les emparejaron con gente que juega como ustedes, acordate de eso antes de culpar al emparejamiento","replies":[]},{"poster":"GameMode","date":"2017-01-30T01:39:43.925+0000","up_votes":1,"down_votes":0,"body":"Si no entendí mal, sos bronce 1 y te parece mal que te emparejen con unrakeds?\n\n Es normal. Así que no te alarmes. Sefinish","replies":[]}]}