{"poster":"KoMa93","date":"2017-06-05T02:44:34.400+0000","title":"Ban 14 giorni meritato","subforum":"Aiuto e supporto","up_votes":4,"down_votes":10,"body":"Salve..parto dal presupposto che mi aspetto gia i vari paladini della giustizia che scriveranno: &quot; eh ma hai flammato,hai intato etc&quot; \r\nSI HO FLAMMATO ED HO FATTO FEED INT! MA PER DEI MOTIVI:\r\n1) mi hanno bannato il mio champ in top per 3 volte di seguito, sempre le stesse persone tra l altro! buono cosi riot. esci da una lobby e ti ritrovi gli stessi coglioni che avevi prima.\r\n2)come siamo entrati in game hanno incominciato a rompermi le balle e gia stavo tiltato dopo il 3 ban dal MIO TEAM per il mio champ e allora ho cominciato a feedare anche perch&egrave; pure la mid non faceva altro che stare dietro la torre e sfottermi e dicendo &quot;open mid&quot; &quot;go mid fast finish&quot;\r\n3)stufo di ritrovarmi ogni volta sti cancri peggio di me..ammetto che non sono un angelo ma vi giuro che era da un anno che non scleravo cosi male..avevo ripreso con parsimonia e bonariet&agrave; a giocare e stranamente davo anche i consigli in game e mi scusavo..tutto questo per creare un clima decente all interno del team per il game..\r\nio ci ho provato ma la pazienza ha un limite..giustamente dopo lo sclero ed il feed di 0/14 mi hanno sospeso l account..\r\nora sono curioso di una cosa...\r\ngli altri pezzi di merda che si sono messi a sfottere fare e dire continueranno a giocare tranquillamente!!!!e lo so per certo!!! perch&egrave; il giudizio riot fa abbastanza pena sotto questo punto di vista..non puoi punire il toro perch&egrave; il torero ha sventagliato il mantello rosso! GRAZIE MILLE RIOT TI AMO SEMPRE DI PIU! MENO MALE CHE HO ALTRI 3 ACCOUNT E VAFF.{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"NOLIMIT Vladimir","date":"2017-06-05T10:27:03.655+0000","up_votes":4,"down_votes":0,"body":"non ho capito cosa dovremmo rispondere a questo post.","replies":[{"poster":"KoMa93","date":"2017-06-06T04:49:32.202+0000","up_votes":2,"down_votes":2,"body":"allora non scrivere nel post semplice!!!!!","replies":[{"poster":"NOLIMIT Vladimir","date":"2017-06-06T05:48:21.460+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=KoMa93,realm=EUW,application-id=98NGV4Al,discussion-id=ZLNkP4mZ,comment-id=00020001,timestamp=2017-06-06T04:49:32.202+0000)\n>\n> allora non scrivere nel post semplice!!!!!\n\nMa allora non scriverlo manco tu sto post se manco tu sai che ti dovremmo rispondere","replies":[]}]},{"poster":"Franky Fire","date":"2017-06-05T10:48:49.648+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MrYellowZ,realm=EUW,application-id=98NGV4Al,discussion-id=ZLNkP4mZ,comment-id=0002,timestamp=2017-06-05T10:27:03.655+0000)\n>\n> non ho capito cosa dovremmo rispondere a questo post.\n\n^","replies":[{"poster":"KoMa93","date":"2017-06-06T04:50:07.504+0000","up_votes":2,"down_votes":2,"body":"stessa cosa per te ! siete dei simpaticoni {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]},{"poster":"Capoz","date":"2017-06-05T19:55:49.147+0000","up_votes":2,"down_votes":1,"body":"Odio la gente che sa usare solo un champ","replies":[{"poster":"KoMa93","date":"2017-06-06T04:24:12.606+0000","up_votes":2,"down_votes":3,"body":"non so usare solo un champ ma sai come è esisto i counterpick... capitan ovvio?! se sei bronzo nell anima non ci posso fare niente.buona giornata","replies":[{"poster":"Capoz","date":"2017-06-06T07:59:13.250+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=KoMa93,realm=EUW,application-id=98NGV4Al,discussion-id=ZLNkP4mZ,comment-id=00050000,timestamp=2017-06-06T04:24:12.606+0000)\n>\n>1) mi hanno bannato il mio champ in top per 3 volte di seguito, sempre le stesse persone tra l altro! buono cosi riot. esci da una lobby e ti ritrovi gli stessi coglioni che avevi prima.\n2)come siamo entrati in game hanno incominciato a rompermi le balle e gia stavo tiltato dopo il 3 ban dal MIO TEAM per il mio champ e allora ho cominciato a feedare\n\nHow cute","replies":[]}]}]},{"poster":"Dodop","date":"2017-06-05T09:53:31.414+0000","up_votes":2,"down_votes":0,"body":"Ti do tre consigli per il futuro:\n1) Se hai tempo, aspetta 5 minuti prima di startare di nuovo la coda (quando trovi troll così) in modo che è molto più difficile ritrovarli anche nel game successivo\n2) In questi casi feeddare intenzionalmente/flammare/andare AFK è inutile, anzi ti fa passare automaticamente alla parte del torto\n3) Lo scopo di questi troll è vedere la reazione delle \"vittime\": anche se hai un main, impara bene un champ di riserva (in modo che anche se te lo bannassero gli avversari saresti a posto) e semplicemente ignorali pickando l'altro champ (ovviamente non mostrarlo in fase di ban) e poi li reporti a fine game\n\n","replies":[{"poster":"KoMa93","date":"2017-06-06T04:48:39.132+0000","up_votes":1,"down_votes":0,"body":"ti ringrazio per i consigli..il punto 3 è quello piu bastardo. ti giuro perchè vedere andare a puttane un game dal min 10 non è bello.. dopo che magari ti sei anche freezato la lane perchè hai un counter o per altri motivi..e comunque vorrei sapere perchè la riot ancora non fa niente per queste cose..non possono reportare solo me se tutto il team ha flammato e pure un altro era finito come me con 12 13 morti e 1/2 kill..reportano me perchè io sono fatto che quando stai perdendo la tua lane ti incomincio a stuzzicare e dire \" che devi fare? vogliamo giocare safe\" e le tipiche risposte sono see ur self , u are pro etc...ho capito che nel bronzo non serve saper giocare tutti i champ cosa che tranquillamente con il buon 70% di champ so fare..e mi hanno sempre detto (persone di elo platino o diamante) che devo saper giocare 2 lane e stop se voglio salire dal fottuto bronzo..poi in high elo so che comunque ci vuole una conoscenza di meccaniche e tempistiche di game ottima cosa che grazie a dio ho imparato facendo il jng..so predictare il team avversario e capire ogni cosa ed è per questo che quando avviso e ci crepano le persone mi incazzo male...ma questo è un altro discorso..ritornando al punto.. cit degli altri post : coglione io che do di matto .{{summoner:14}}","replies":[]}]},{"poster":"RGM Player","date":"2017-06-05T18:57:52.960+0000","up_votes":1,"down_votes":0,"body":"Se hai ricevuto 14d, vuol dire che hai già flammare in precedenza e da poco tempo. Se non vuoi flammare, quando entri in game fai /mute all (funziona, ho un amico che flamma, e facendo così per  si è calmato un po'). Il fatto che ti sia ritrovato le stesse persone della queue precedente è normale, la prossima volta se non vuoi incontrarli di nuovo, interompi la queue e falla ripartire.","replies":[{"poster":"KoMa93","date":"2017-06-06T04:33:42.820+0000","up_votes":2,"down_votes":2,"body":"e mi dovrei beccare il ban da 5 minuti per aver mollato la lobby? che poi aumenta se ribecco il cazzo di troll devo lasciarla nuovamente..ma vi rendete conto di cosa dite? e come se dici..il ladro ha detto che ruberà..e lo farà ancora e ancora..tu mi consigli di girarmi e ignorare il problema..dovrebbero togliere ste cagate di punizioni del ban se lasci la lobby a sto punto..e poi non è che entro in lobby e flammo random..e comunque non mi va di mutare tutti o almeno la mia squadra perchè è bello coordinarsi con la chat quando è possibile,.. vabbe coglione io che perdo le staffe..meno male che non mi hanno dato il permaban...{{summoner:3}}","replies":[{"poster":"RGM Player","date":"2017-06-06T05:58:13.254+0000","up_votes":3,"down_votes":1,"body":"Forse hai sbagliato a leggere, non ti ho detto di dodgiare la lobby. Quando una lobby fallisce (qualcuno esce dalla lobby), se non vuoi trovarti la stessa gente della lobby precedente, ferma la coda e farla ripartire. Perdi un po' di tempo, ma non ti ritrovi gli stessi che magari ti hanno bennato il tuo champ.","replies":[]}]}]},{"poster":"Frattaglia","date":"2017-06-05T12:19:50.220+0000","up_votes":3,"down_votes":2,"body":"E a noi che importa?\n\nSinceramente, che risposte ti aspetti di ricevere da questo topic? Una pacca sulla spalla?\nSe il gioco ti stressa fai una pausa invece di prendertela con chi non c'entra niente.","replies":[{"poster":"KoMa93","date":"2017-06-06T04:28:27.610+0000","up_votes":2,"down_votes":3,"body":"ah il bello..ho giocato sull altro account.. di nuovo..ho fatto aram per 3 volte di fila sempre lo stesso troll che andava sotto torre e dava kill..reportato da tutti a fine game ma guarda un po lui continuava a giocare..e poi lo sapete che le persone reportano a cazzo de cane anche i compagni che come gli dicono qualcosa fanno brutto..anni fa non era cosi lol..da quando si è sputtanato troppo troppi bimbimerda e persone frustrate..da questo topic sinceramente mi aspettavo delle risposte in base alla funzione ban etc..ma ho notato che non serve parlarne perchè tanto la riot fa come cavolo gli pare .avranno pure delle regole scritte ma non penso le seguino alla perfezione .","replies":[{"poster":"Frattaglia","date":"2017-06-06T08:21:47.876+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=KoMa93,realm=EUW,application-id=98NGV4Al,discussion-id=ZLNkP4mZ,comment-id=00030000,timestamp=2017-06-06T04:28:27.610+0000)\n>\n> ah il bello..ho giocato sull altro account.. di nuovo..ho fatto aram per 3 volte di fila sempre lo stesso troll che andava sotto torre e dava kill..reportato da tutti a fine game ma guarda un po lui continuava a giocare..e poi lo sapete che le persone reportano a cazzo de cane anche i compagni che come gli dicono qualcosa fanno brutto..anni fa non era cosi lol..da quando si è sputtanato troppo troppi bimbimerda e persone frustrate..da questo topic sinceramente mi aspettavo delle risposte in base alla funzione ban etc..ma ho notato che non serve parlarne perchè tanto la riot fa come cavolo gli pare .avranno pure delle regole scritte ma non penso le seguino alla perfezione .\n\nQuello probabilmente è un bot e finirà bannato anche quello.\nOra, detto questo, ti consiglio di moderare un po' le parole, sul forum siamo un po' elastici ma non vuol dire che tutto sia permesso.\n\n[Qui](https://boards.euw.leagueoflegends.com/it/c/annunci-it/lu1dupsc-regole-generali) trovi le regole del forum","replies":[]}]}]},{"poster":"Orgazmico","date":"2017-06-05T09:10:00.402+0000","up_votes":2,"down_votes":1,"body":"forse è meglio se cancelli tutti gli account extra in maniera tale da mantenerne uno e imparare a giocare bene a lol. Non puoi fare tre partite di seguito se sei già stressato e sclerato a causa dei game precedenti,questo è un gioco che ti impegna per molto tempo, richiede una certa concentrazione, e non è fatto per svagarsi o rilassarsi,  se continui cosi rischi solo di farti bannare più volte e rendere il clima teso per tutti gli altri. Avresti potuto anche incontrare persone diverse nelle tre partite, ma se si sta perdendo è inevitabile che qualcuno perda la pazienza prima o poi. Devi imparare a gestirti, il feed e flame non è giustificato anche se sei dalla parte del giusto.","replies":[{"poster":"KoMa93","date":"2017-06-06T04:39:17.795+0000","up_votes":2,"down_votes":1,"body":"bro gioco da un bel po a lol..ultimamente ho incominciato a giocare seriamente le ranked cercando di essere un agnellino..ma è impossibile..perchè devo vedere tutti i miei sforzi andare a puttane durante un game?perchè la riot ancora non fa qualcosa riguardo a queste cose? non è bilanciato..secondo me dovrebbero mettere un limite d età per giocare..anni fa non era cosi lol.. e guarda un po ero arrivato a gold 2 season fa :D chissa. i misteri della vita..e non dirmi che pure in high elo succedono ste cose perchè lo so.. ma almeno succedono di meno rispetto al wood elo..io comunque cosi come voglio rispetto sono il primo a darlo..anche se ammetto che mi scaldo con poco..ripeto come nell altro post: coglione io che smatto di brutto..","replies":[]}]},{"poster":"uFere","date":"2017-06-06T16:16:43.335+0000","up_votes":1,"down_votes":0,"body":"Mate, non dovresti mai flammare, fidati, tira un bestemmione in real e non toccare proprio la chat, al limite dai qualche consiglio, indica un punto da wardare..ma flammare ti mette solo dalla parte del torto e ti fa prendere ban al quanto immeritato direi :/, purtroppo certi elementi non dovrebbero esserci, specie questi che istigano e flammano gratuitamente senza alcun presupposto.\n\n> mi hanno bannato il mio champ in top per 3 volte di seguito \n\nUsi sempre lo stesso champ mate? Io ne ho imparati una decina, giusto per metterglielo al quel posto lì a quelli che pensano di farmi un dispetto bannandomi il mio pick.\n\n> avevo ripreso con parsimonia e bonarietà a giocare e stranamente davo anche i consigli in game e mi scusavo..tutto questo per creare un clima decente all interno del team per il game..\n\nContinua a farlo, non lasciare che altri ti influenzino, il tuo atteggiamento andava più che bene.","replies":[]}]}