{"poster":"lopesz","date":"2015-07-10T15:41:10.769+0000","title":"Platin Spieler sucht 4 Bronze - Silber Spieler für Ranked Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"**Hallo Community!**\r\n\r\nIch suche 4 motivierte und engagierte Leute, die auf der suche nach einem Team sind.\r\n\r\nIhr fragt euch sicher warum ich &quot;lowelo&quot; Spieler suche. \r\nIch gebe gerne mein Wissen und Spielerfahrung weiter und kann so vielleicht den 4 Spielern helfen sich zu verbessern und h&ouml;heres zu erreichen!\r\nDienen soll das ganze dazu das man die Wards am Ende der Season bekommt und man sich, wie oben schon beschrieben, weiter verbessert.\r\n\r\nIhr k&ouml;nnt euch auf JEDER Position bewerben, da ich selber erst sp&auml;ter entscheiden werde welche Lane ich spielen werde.\r\n\r\n\r\n**Noch ein wenig zu meiner Person:**\r\nIch bin 22 Jahre alt, spiele League schon seit Season 1 und Ranked aktiv seit Season 3.\r\nIch selber schaue viel LCS/LCK/LPL etc. weil man meiner Meinung nach, auch aus den Sachen sehr viel f&uuml;r sich mitnehmen kann.\r\nAnsonsten bin ich ein humorvoller Genosse, der nicht flamed und raged, sondern eher motiviert :)\r\n\r\n**Was erwarte ich von den 4 Spielern:**\r\n18+ (da ich selber einfach schon 22 bin)\r\nIhr braucht euch kein Druck zu machen, dass wenn ihr schlecht spielt ihr aus dem Team fliegt.\r\nAm Anfang z&auml;hlt f&uuml;r mich sowieso nur das Menschliche.\r\nWas ihr aber aufjedenfall mitbringen m&uuml;sst, ist Kritikf&auml;higkeit, Geduld und Spa&szlig;.\r\nZudem solltet ihr bitte nicht flamen und ragen :) Man kann sich gerne mal im ts &uuml;ber einen Gegner aufregen, das macht ja jeder mal :)\r\nAber ich dulde kein gerage untereinander, denn ab da an verfehlt das ganze sein Ziel.\r\n\r\n\r\n**Also falls ihr euch angesprochen f&uuml;hlt, meldet euch bei mir ingame :)**","replies":[{"poster":"TheDragon971031","date":"2015-07-13T01:24:14.986+0000","up_votes":1,"down_votes":0,"body":"Hey find ich super das du das anbietest,\n\nIch bin leider erst 17 werde am 31.10 18.\nBin seit season 3 geranked und komme wegen trollern und afklern leider nicht aus bronze raus.\nIch bevorzuge die Top-Lane und würde mich sehr über das von der angebotene freuen\nmfg TheDragon971031","replies":[]},{"poster":"AI Hyperion","date":"2015-07-10T16:49:21.757+0000","up_votes":1,"down_votes":0,"body":"Hey das klingt sehr interessant blos bin ich erst 16 .. nov 17..\n\nwir hätten nen teamspeak falls du einen suchst für dein team ;)\n\nschau vorbei ;)\n\nAdresse:85.214.217.17:8653\n\nmfg miss0uri","replies":[]}]}