{"poster":"Ban Shaco","date":"2015-10-26T00:28:52.929+0000","title":"¿Qué pensas sobre los OneTrickPony?","subforum":"Charlas Generales","up_votes":3,"down_votes":4,"body":"&iexcl;Hola! \r\n Bueno como el titulo dice les quiero preguntar para saber sus opiniones sobre jugadores como yo y tantos otros que jugamos un solo campe&oacute;n en ranked, es decir, que tenemos solo un main.\r\nEn mi caso soy main Shaco y me llevo de silver 4 a platino 4 esta season y no podria estar mas contento pero por lo general me suelen flamear por no saber jugar otro champ con la misma skill.\r\n\r\nSi tenes una experiencia similar contamela abajo por que me interesaria jajaja!\r\n&iquest;Y los demas? &iquest;Qu&eacute; pensas sobre nosotros los jugadores de este tipo? :P\r\n\r\n{{champion:35}} {{champion:35}} {{champion:35}}  Shaco is love","replies":[{"poster":"Runth","date":"2015-10-26T01:21:56.240+0000","up_votes":2,"down_votes":0,"body":"One trick pony champ es diferente q Onenoob champ pony(noob champ)\n\nel one trick es un jugador q solo escoje un campeon en todos los roles , solo 1, como una lulu, shaco, lee sin, etc. No lo considero malo, ya q he visto jugadores jugando dependiendo de un solo campeon de todos los roles , puedan ganar las partidas todo gracias su alta experencia del jugador.\n\ny el otro tipo jugador q solo juega 1 solos campeon en 1 sola linea y no aprender el resto de los roles\n\nAsi q no se confunden eso","replies":[]},{"poster":"EzrealSupportOP","date":"2015-10-26T05:37:02.542+0000","up_votes":1,"down_votes":0,"body":"Es un juego, solo se juega por diversion, si te divierte usar solo un campeon, en cualquier modalidad de juego (o solo un rol en mi caso, support), es genial! \n\nEste consejo te doy, porque Ezreal Support soy!{{champion:81}}","replies":[{"poster":"Zevko","date":"2015-10-26T05:49:29.801+0000","up_votes":1,"down_votes":0,"body":"ezreal support y sos oro 1 , te juro que voy a hacer un monumeto","replies":[{"poster":"rokushoger","date":"2015-10-26T11:25:08.158+0000","up_votes":1,"down_votes":0,"body":"Lo más cómico es que lo he visto jugar, soy main support, y realmente sabe lo que hace.","replies":[{"poster":"Zevko","date":"2015-10-26T19:26:08.485+0000","up_votes":1,"down_votes":0,"body":"y por es oesta en oro 1","replies":[{"poster":"rokushoger","date":"2015-10-27T10:55:13.688+0000","up_votes":1,"down_votes":0,"body":"Es que por eso digo, uno podría pensar que Ezre support no anda ni en joda, y de hecho es así, pero en las manos de este tipo hace maravillas.","replies":[]}]}]}]}]},{"poster":"Dubbiel","date":"2015-10-26T00:49:53.219+0000","up_votes":1,"down_votes":0,"body":"Para mi esta perfecto y la verdad te felicito que hayas subido de ligas tan radicalmente usando un solo champ, yo en cambio intento manejar un champ de cada linea, porque en ranked nunca sabes la gente y las personas que te van a tocar... Y así y todo estoy en plata IV ganando algunas y perdiendo otras por afks y demás comportamientos. Pero yo me pregunto si a vos te pickean antes alguien que va jg, que posición vas?","replies":[{"poster":"Ban Shaco","date":"2015-10-26T01:02:58.662+0000","up_votes":1,"down_votes":0,"body":"Generalmente en silver iba a la linea que me tocaba con mi campeón, pero en oro - platino son mas respetables, si ven que tenes nivel con tu champ te dejan la linea que quieras","replies":[{"poster":"Dubbiel","date":"2015-10-26T01:18:21.332+0000","up_votes":1,"down_votes":0,"body":"Y pero si te tocaba ir top, ibas con shaco igual? Entiendo que en ligas mayores son mas comprensibles pero la verdad que creo que hasta en oro hay trolls y gente que se queda afk... Como también hay personas que le elobostean la cuenta y la persona que realmente usa la cuenta no sabe jugar","replies":[{"poster":"CX Zheon","date":"2015-10-26T12:58:16.798+0000","up_votes":1,"down_votes":0,"body":"Usualmente ya en platino no te flamean tanto por los picks (me sorprendio) el otro dia me toco un galio support y nadie le dijo nada, el tipo jugo re bien y ganamos\nobviamente hay trolls y boosteados, pero eso es en todos lados\nel otro dia me toco un tipo q saco urgot top contra fiora y saco 42 cs en 25 minutos, le vi el perfil y la cuenta llevaba inactiva 3 meses y de la nada volvio y usaba nami con clarividencia y barrera como si fuera una cuenta lvl 9 cuando no tenes flash todavia, se ve q alguien le regalo la cuenta","replies":[]}]}]}]},{"poster":"Fiesta del te","date":"2015-10-26T12:37:03.577+0000","up_votes":1,"down_votes":0,"body":"Opinión sobre los One Trick Ponys= Lo mejor que puede haber si el jugador es una persona normal. Si es de esos que se la pasan flameando, creyéndose mejores que todos y encima dan pena porque no pueden hacer ni una lectura del mapa ahi cambia la cosa... Pero eso también se aplica  los que son AllRounders.\nTen en cuenta que jugar a la perfección un campeón no te asegura nada. Subir con un solo campeón es mas fácil porque al jugar siempre lo mismo, ya no necesitas ver el CD de tus skills o pensar tanto que te armas en x caso porque lo hiciste muchísimas veces. Conoces mejor tu daño, tus powerspikes y donde tenes que pararte. Al no pensar en eso podes estar pendiente de los objetivos, el mapa, el comportamiento del enemigo. ese tipo de conocimiento te lleva para arriba. La skill mecánica no te sirve para nada si no sabes jugar (no es lo mismo hacer buenas outplays que jugar bien).\nClara evidencia, el jugador Teèmo de NA llego a Challenger jugando en una computadora portátil mala, con 15 fps max, 100 de ping de promedio cuando los demás tenían 50-60 (antes del cambio de sv en NA), sin mouse (solo con el pad táctil) y jugando JG porque no podía lasthitear bien en esas condiciones. Pero el tipo sabia como moverse en el mapa y comunicarse con su team.","replies":[]},{"poster":"rokushoger","date":"2015-10-26T11:24:39.167+0000","up_votes":1,"down_votes":0,"body":"Primero que nada te diría que si te divierte y sos feliz, y te funciona entonces genial.\nAhora sinceramente te diría que es algo arriesgado porque tenés un triple riesgo: Primero que te baneen tu champ (shaco no es muy baneado, pero donde te cruces con uno que hace bans medio raros y te toque marchaste porque no sabes jugar otro). Segundo que si tu champ es para una sola lane (en este caso shaco a lo más se PODRÍA usar en 3 lane, mid bot \"support\", y jungle, y solo es bueno realmente para jungla, entonces cuando te pickean jungla estás condenado o bien a jugar una linea que no es la óptima o una que seguro vas a perder. Tercero y último, si tu rival es más hábil que vos y te elige un counter estas muerto.\nEs buena idea entonces jugar solo un campeón? Para mí no, por lo que dije, pero si te funciona y estás feliz adelante! Mientras no pierdas a propósito y/o le cagues la partida a nadie no debieran quejarse.","replies":[]},{"poster":"Whitesse","date":"2015-10-26T01:20:33.063+0000","up_votes":1,"down_votes":0,"body":"Para mi esta perfecto, con mi cuenta principal (esta) si puedo juego Rengar en ranked, sali de Silver 3 hasta diamante 4 jugando con El, estuve en los 1000 Rengar del mundo y en normales es casi free win si lo pickeo.\nEn mi cuenta secundaria solo juego Rengar, gane 96 games con Rengar de Silver 2 a Platino 1, ahora estoy por pelear la promo. Si a vos te gusta y te da buenos resultados.. porque no jugarlo siempre ?","replies":[]},{"poster":"Snooow","date":"2015-10-26T00:49:19.577+0000","up_votes":1,"down_votes":0,"body":"una vez una tipa que conocí en un URF que era diamante y me dijo que para llegar a diamante había que mainear a la perfeccion a 1 solo champ y usar a ese siempre en las rankeds, ella era main {{champion:92}} y yo la espectee y volaba con riven","replies":[]},{"poster":"Tecnicomando","date":"2015-10-26T00:46:41.260+0000","up_votes":1,"down_votes":1,"body":"No me intersa subir, elo, pero si jugar con mis amigos...\n\nAhora.. hay algo gratis que te ganas con esfuerzo,usemos un par de campeones ;pocas partidas y ya\n\n\n\nsalu2","replies":[]}]}