{"poster":"Náos","date":"2017-11-21T10:38:52.833+0000","title":"Data acquisto campioni","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Con questa patch &egrave; uscita la tab delle skin nella collezione, una feature molto carina di questa nuova scheda &egrave; che &egrave; possibile vedere quando hai acquistato una determinata skin.\r\nMi chiedevo se ci fosse un modo per chiedere alla Riot di fare la stessa cosa per i campioni senza passare dal supporto.","replies":[{"poster":"Apostasis","date":"2017-11-21T11:02:40.691+0000","up_votes":0,"down_votes":0,"body":"A rigor di logica dubito lo faranno mai, considerando che è uno dei mezzi tramite i quali ottengono informazioni per giudicare i casi di recupero dell'account se non sbaglio.","replies":[{"poster":"Náos","date":"2017-11-21T11:03:54.772+0000","up_votes":1,"down_votes":0,"body":"cioè? scusa ma questa cosa non la sapevo","replies":[{"poster":"Apostasis","date":"2017-11-21T11:10:25.191+0000","up_votes":0,"down_votes":0,"body":"Tieni conto che potrei sbagliarmi non avendo mai dovuto recuperare l'account, ma se ben ricordo nel caso riescano a rubarti l'account ed a cambiare  mail la riot non ha modi certi (CREDO) per stabilire se il cambio è stato volontario o no e allora per meglio prendere una decisione raccoglie informazioni basilari da entrambe le parti, come la cronologia aquisti (Quando hai preso rp l'ultima volta?) , la data in cui hai cominciato a giocare, o anche i primi campioni /il primo campione da 6300 aquistato (conosco per esempio un tipo irl che in seguito al furto dell'account \"criticava\" il sistema della riot (ma a che gli serve sapere tutte ste cose rivoglio l'account gne gne).\nForse se la riot avesse un sistema di sicurezza migliore (o la sfera di cristallo :P) si potrebbe realizzare come idea.\nVisto il wall of text spero sia almeno dettagliato","replies":[{"poster":"Náos","date":"2017-11-21T11:30:03.592+0000","up_votes":1,"down_votes":0,"body":"sìsì molto dettagliato, grazie! non capisco però perchè ti abbiano messo il -1","replies":[{"poster":"Saibbo","date":"2017-11-21T12:06:17.437+0000","up_votes":1,"down_votes":0,"body":"Community italiana :p","replies":[{"poster":"Apostasis","date":"2017-11-21T18:43:50.206+0000","up_votes":0,"down_votes":0,"body":"Nono ahahah, in realtà sono io, mi spiego meglio.\nNon so di preciso a cosa servano i +/-1 , credo non abbiano alcuna vera funzione (?) e siano solo una specie di indice di gradimento, e magari ci penso troppo ma non ritengo avrebbe troppo senso che io mi metta il +1 da solo (automatico quando posto, quindi lo tolgo ( a meno di non dimenticarmene) \nSuvvia la community non è cosi male :P","replies":[]}]}]}]}]}]},{"poster":"TZombi1234","date":"2017-11-21T10:43:00.495+0000","up_votes":1,"down_votes":0,"body":"C'è la cronologia degli acquisti, però mostra solo gli acquisti degli ultimi 6 mesi...","replies":[{"poster":"Náos","date":"2017-11-21T11:02:10.257+0000","up_votes":1,"down_votes":0,"body":"So della cronologia acquisti, ma la scheda delle skin (per fare un'esempio su di me) mostra quando ho ricevuto tristana ragazza riot il giorno che ho iniziato a giocare, ovvero il 10/7/2013.\nAvere la stessa cosa per i campioni sarebbe figo e non credo costerebbe molto alla riot da aggiungere","replies":[]}]}]}