{"poster":"Náos","date":"2017-12-09T19:21:48.229+0000","title":"Ma il rework di Yasuo che fine ha fatto?","subforum":"Campioni e gameplay","embed":{"description":"Close Ask a question about League or Riot, and we'll try to answer it. Answers go live every Thursday at 1:30 pm (PT) Log in to Ask Riot Thank you for submitting a question! Deep-dives on vision score, Yasuo's ban rate, and how we find voice over talent.","url":"https://nexus.leagueoflegends.com/en-us/2017/06/ask-riot-yasuo-gets-banned/","image":"https://nexus.leagueoflegends.com/wp-content/uploads/2017/06/LOL_CMS_096_Social_1200.jpg"},"up_votes":3,"down_votes":6,"body":"Come da titolo, che fine ha fatto il GI&Agrave; ANNUNCIATO rework di Yasuo? Tra quanto lo vedremo?\r\nImmagino tra un bel po&#039; visto che oramai ci sono personaggi migliori da bannare e credo la riot abbia giustamente abbassato molto la sua priorit&agrave;.\r\nPS. Sto ancora aspettando yasuo armatura della quinta era, riot vi prego fatela.","replies":[{"poster":"Mimykiu","date":"2017-12-10T10:31:35.421+0000","up_votes":2,"down_votes":0,"body":"Non ha senso reworkare Yasuo, Yasuo può essere un cranco ma insomma è praticamente perma-bannato a causa del cd minimo della E che gli permette un easy Dodge di qualsiasi spell (ovviamente eccetto) quelle a target, la W che blocca qualsiasi tipo di engage e la passiva che gli permette di avere una crit prob uguale al 100% e quindi ha un sacco di danno, mobility, resistenze (passiva) engage, disengage, escape, wave-Clear, splitpushing, cdr. \nL'unica cosa che non ha è sustain ma tanto non usa mana","replies":[{"poster":"Náos","date":"2017-12-10T11:24:37.757+0000","up_votes":1,"down_votes":0,"body":"Lo vogliono/volevano reworkare proprio perché era permabannato. Diciamo che avere un 100% di ban rate non è proprio sintomo di bilanciamento.\nDicevano che avrebbero voluto modificare il kit per renderlo più \"skillato\" per differenziare uno yasuo forte da uno meh. perché attualmente (secondo me) tutta la difficoltà viene dall'uso dei dash, il muro di vento è talmente generoso che è quasi impossibile sbagliarlo. La Q è uno skillshot talmente breve che chiamarlo skillshot è quasi offensivo, ovviamente la terza q non conta). \n\nPS. Il post della riot è vecchio di mesi, quindi tutte le chiacchiere fatte da tutti noi utenti sull'argomento son fuffa, però è bello confrontarsi.","replies":[{"poster":"Mimykiu","date":"2017-12-11T06:06:53.566+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Náos,realm=EUW,application-id=cAOZwaUi,discussion-id=qVF1cFBJ,comment-id=00040000,timestamp=2017-12-10T11:24:37.757+0000)\n>\n> Lo vogliono/volevano reworkare proprio perché era permabannato. Diciamo che avere un 100% di ban rate non è proprio sintomo di bilanciamento.\n> Dicevano che avrebbero voluto modificare il kit per renderlo più &quot;skillato&quot; per differenziare uno yasuo forte da uno meh. perché attualmente (secondo me) tutta la difficoltà viene dall&#x27;uso dei dash, il muro di vento è talmente generoso che è quasi impossibile sbagliarlo. La Q è uno skillshot talmente breve che chiamarlo skillshot è quasi offensivo, ovviamente la terza q non conta). \n> \n> PS. Il post della riot è vecchio di mesi, quindi tutte le chiacchiere fatte da tutti noi utenti sull&#x27;argomento son fuffa, però è bello confrontarsi.\n\nSì, hai completamente ragione! Diciamo che volevo dire più o meno la stessa cosa ma evidentemente si sono espresso male ahahaha","replies":[]},{"poster":"Apostasis","date":"2017-12-10T11:52:52.380+0000","up_votes":1,"down_votes":0,"body":"Yasuo è una vita che non è permabannato, specialmente da quando gli hanno nerfato la build tank, ed onestamente non vale la pena bannarlo a meno che non si abbia intenzione di pickare una comp davvero priva di CC (in quel caso se si perde non è proprio di Yasuo la colpa :P)\nTbh la differenza tra uno Yasuo bravo ed uno scarso si sente eccome, ma c'è un motivo se tende a sparire come campione più si sale con l'elo, escludendo OTP dedicati, alla fine rimane facilmente counterabile ( i primi champ che mi vengono in mente sono Lissandra in mid e Poppy in top). Quando Yasuo sembra op non è perché effetivamente lo sia(anche se la sua W è parecchio forte e generosa come da te detto), in genere è il meta o qualsivoglia altro cambiamento a romperlo, per esempio ricordo la tank build o quando per la prima volta rilasciarono le nuove (ormai vecchie) rune.\nPersonalmente l'unico aspetto che trovo un poco troppo \"easy\" del suo kit è la possibilità di avere un knockup garantito con e+q, anche se spesso è un risultato di cattivo positioning.","replies":[]}]}]},{"poster":"Apostasis","date":"2017-12-09T22:41:14.353+0000","up_votes":2,"down_votes":0,"body":"Se non sbaglio ( ma al momento non riesco a ricordare dove ho sentito di preciso questa cosa quindi prendi quello che dico con le pinze) Meddler aveva detto che suddetto rework (che sarebbe comunque stato minimo) non era più una priorità a causa di cambiamenti nel meta (o altri fattori simili: purtroppo non ricordo bene).\nSicuramente vorranno lavorarci in futuro per ridurre la disparità tra un giocatore capace ed un novellino con il champ, ma visto anche il suo stato attuale nel gioco, oltre che del gioco stesso, ci sono altre priorità. \nCredo Meddler ne abbia parlato ad un certo punto svariati mesi fa nei suoi pensieri sul gameplay, mentre sono più che sicuro che la Riot abbia parlato di Yasuo anche in un articolo ( credo risalente circa a questa estate) su Nexus in cui si menzionavano anche altri rework, come quello di Azir.","replies":[]},{"poster":"wattbatt","date":"2017-12-10T10:20:39.435+0000","up_votes":2,"down_votes":1,"body":"ma i rework sono per champ con meccaniche vecchie, le sue sono abbastanza aggiornate perchè reworkarlo","replies":[{"poster":"Náos","date":"2017-12-10T11:17:39.909+0000","up_votes":1,"down_votes":0,"body":"Perché ha detta della riot avere un ban rate del 100% è indice di qualcosa che non va, non sono cose che mi invento io","replies":[]},{"poster":"Apostasis","date":"2017-12-10T11:36:48.962+0000","up_votes":0,"down_votes":0,"body":"Non necessariamente, anche campioni come Azir hanno ricevuto un rework leggero, e la Riot ha testato qualcosa del genere anche per Aurelion.\nCiò nonostante non avrebbe molto senso reworkare Yasuo, il suo kit è a posto anche se si può discutere su quanto potere offrano passiva e W, il suo vero problema è essere \"troppo reattivo\" in base al meta ed agli oggetti: un po' come Quinn, un piccolo cambiamento lo porta da broken ad inutilizzabile.","replies":[]}]},{"poster":"vondarck","date":"2017-12-11T13:38:46.677+0000","up_votes":1,"down_votes":0,"body":"Imho si, ha bisogno di un rework\n\nHa delle capacità di trade prolungate veramente fastidiose, ultimamente me lo sto trovando contro a mid e ha IMHO troppo trade potential, di contro, counterpikkarlo con dei melee a mid e sempe un po un terno perché non sai mai il pick order","replies":[]},{"poster":"Graziano AI","date":"2017-12-10T11:59:01.138+0000","up_votes":1,"down_votes":0,"body":"sul forum inglese e su quello NA invece di rework si sta discutendo di un \"buff\" a Yasuo, presentato già come cosa ufficiale e motivato dal fatto che Yasuo ora sarebbe in \"svantaggio\"...\nse ho ben capito, si tratterebbe di:\n1) +20 danni alla Q\n2) +200 range alla R\n3) + piu' MR\n\nsempre se poi la cosa è davvero ufficiale.\nio spero di no.\nper me resta un champ che non ha bisogno di alcun tipo di buff, o almeno non di questo tipo.","replies":[]},{"poster":"TZombi1234","date":"2017-12-09T20:09:01.956+0000","up_votes":1,"down_votes":0,"body":"https://support.riotgames.com/hc/it/articles/202294884-Programma-aggiornamento-campioni\nA quanto pare non ci sarà... per ora...","replies":[{"poster":"Náos","date":"2017-12-09T21:54:21.863+0000","up_votes":1,"down_votes":0,"body":"sapevo di questa roadmap, col fatto che hanno anche eliminato i \"rework di gruppo\" non possiamo neanche aspettarci di vederlo assieme ai diver","replies":[]}]},{"poster":"Tacchino Robot","date":"2017-12-09T20:12:48.020+0000","up_votes":1,"down_votes":2,"body":"Per il momento (bestemmia) hanno buffato danni di Q e range di ulti","replies":[]}]}