{"poster":"thereisnospace","date":"2016-11-17T12:25:16.266+0000","title":"[Guide] Mein Skill Level ist bei Silber-Gold, doch ich bin seit 4 Seasons Platin+. Wie?","subforum":"Ligen & gewertete Spiele","up_votes":8,"down_votes":1,"body":"Hallo liebe Leute,\n\nich m&ouml;chte mich heute mal einem Thema widmen was mich schon seit l&auml;ngerem besch&auml;ftigt.\nUnd zwar w&uuml;rde ich mich selbst vom Skill Level bei Silber-Gold einsch&auml;tzen und spiele aber schon seit mehreren Seasons in der Platin und Season 5 sogar in der Diamond Liga.\n\n**Wie kann das sein?**\nMeiner Theorie nach, ist es nicht mal zwingend notwendig ein hohes Ma&szlig; an spielerischen K&ouml;nnen zu besitzen, um in der Liga aufzusteigen.\nNat&uuml;rlich gibt es einige Voraussetzungen; grunds&auml;tzliches Spielverst&auml;ndnis, Informationen &uuml;ber die aktuelle Meta und was gespielt wird, und ein wenig konsistentes Spielen (3-5 Games die Woche).\n\nIch bin Main ADC und w&uuml;rde behaupten, dass ich 50% meiner Lanes gewinne, aber auch 50% meine Lanes verliere. Auf anderen Rollen bin ich abgesehen vom Jungle, schlecht. \n\nWie kann es also sein, dass ich nach so langer Zeit immer wieder Platin+ am Ende der Season erreiche?\n\nIch bin ein ziemlich positiver Mensch und versuche das vom Anfang an in der Championselection und im Spiel wiederzuspiegeln. Es f&auml;ngt mit einer freundlichen Begr&uuml;&szlig;ung im Chat an, &uuml;ber verzichten auf die eigene Rolle f&uuml;r einen Anderen und freundlichen Small Talk w&auml;hrend des Spiels.\nEin &quot;Good Job&quot; oder ein &quot;Don&#039;t worry we got this&quot; kann schon so viel Impact auf ein Spieler haben, dass diese S&auml;tze entscheidend f&uuml;r das Gewinnen oder Verlieren einer Lane sind.\nAu&szlig;erdem flame ich sehr selten. Wenn ich nie sagen w&uuml;rde, w&uuml;rde ich l&uuml;gen. Jeder Spieler hat irgendwann sein Ma&szlig; an Toleranz erreicht und wenn das Fass voll ist, ist es voll.\n\nJetzt fragt man sich nat&uuml;rlich, na toll, aber was hilft mir das aufzusteigen?\n\n**Meine Theorie: Es ist nicht so wichtig wie gut du spielst. Wichtig ist es, dein Bestes zu geben und deinem Team das Gef&uuml;hl zu geben, dass ihr wirklich ein Team seid. Durch eine positive Stimmung im Team spielen die Spieler besser. **\n\nKlar, es gibt viele sehr gute Spieler, die sich alleine durch Skill von Bronze-Diamond durchschlagen k&ouml;nnen. Ich kann das nicht. Aber mit diesen einfachen Regeln, die ich mir selbst aufstelle, habe ich seit l&auml;ngerer Zeit Erfolg. \n\n\nWas sagt ihr dazu? &Auml;hnliche Erfahrungen gemacht?\n\nLg\nGottlike","replies":[{"poster":"Dâfuq","date":"2016-11-17T14:25:33.606+0000","up_votes":4,"down_votes":0,"body":"Kann ich 100% so unterschreiben...\n\nSeit 3 Seasons jedesmal dia 5 geworden, dabei carry ich nicht ein einziges Spiel... Meine Lane verlier ich fast auch immer und bin im Farm hintendran. Dafür konzentriere ich mich darauf Calls zu machen und bei wichtigen Teamfights dabeizusein und Überzahl Situationen zu kreieren. Anfangs habe ich Teamorientierte Champs gespielt bin aber nun auf Teemo umgestiegen, weil er die Gegner besser zur Ragen bringen kann... :D\n\nWas positive Attitude angeht bin ich glaube ich kein Musterbeispiel. Allerdings bin ich fest davon überzeugt das man mit ner guten Stimmung mehr Spiele gewinnt einfach weil weniger Leute tilten und allgemein mehr Spiele gedreht werden.\n\n**ABER**:\n\nHierdurch kann man in der Regel keine allzu hohen Winrates erzeugen. Daher muss man viele Rankeds machen 100+ um in High Elo zu kommen.","replies":[{"poster":"lnSêc","date":"2016-11-17T17:26:40.630+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Dâfuq,realm=EUW,application-id=ip27PlEH,discussion-id=xTYitIsn,comment-id=0001,timestamp=2016-11-17T14:25:33.606+0000)\n>\n> Kann ich 100% so unterschreiben...\n> \n> Seit 3 Seasons jedesmal dia 5 geworden, dabei carry ich nicht ein einziges Spiel... Meine Lane verlier ich fast auch immer und bin im Farm hintendran. Dafür konzentriere ich mich darauf Calls zu machen und bei wichtigen Teamfights dabeizusein und Überzahl Situationen zu kreieren. Anfangs habe ich Teamorientierte Champs gespielt bin aber nun auf Teemo umgestiegen, weil er die Gegner besser zur Ragen bringen kann... :D\n> \n> Was positive Attitude angeht bin ich glaube ich kein Musterbeispiel. Allerdings bin ich fest davon überzeugt das man mit ner guten Stimmung mehr Spiele gewinnt einfach weil weniger Leute tilten und allgemein mehr Spiele gedreht werden.\n> \n> **ABER**:\n> \n> Hierdurch kann man in der Regel keine allzu hohen Winrates erzeugen. Daher muss man viele Rankeds machen 100+ um in High Elo zu kommen.\n\nman kann ja auch schlecht die mates flamen wenn man der feeder ist.. lmfao..","replies":[{"poster":"EoYd Michi","date":"2016-12-02T19:48:46.258+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=lnSêc,realm=EUW,application-id=ip27PlEH,discussion-id=xTYitIsn,comment-id=00010000,timestamp=2016-11-17T17:26:40.630+0000)\n>\n> man kann ja auch schlecht die mates flamen wenn man der feeder ist.. lmfao..\n\nKomischerweise flamen in Bronze/Silver meistens die 0/10 Yasuos","replies":[]}]}]},{"poster":"Nivoras","date":"2016-11-17T15:08:01.004+0000","up_votes":3,"down_votes":0,"body":"Also bei mir hat das nie funktioniert. eher das Gegenteil ist der Fall, die Leute die in der Champselect am freundlichsten sind, sind zum großen Teil die, die richtig hart tilten wenn es in game nicht ganz so gut läuft... Ich probiere natürlich auch freundlich zu sein, aber idR laufen die Games wo nix geschrieben wird ausser \"nash\" und \"gg\" bei mir am besten, Weil man komplett aufs Spiel fokussiert sind. Ich finde in gewisser Weise lenkt zuviel von dem freundlichen Gechatte genauso ab wie flame, weil man nicht mehr zu 100% aufs Game fokussiert ist, auch wenn die Motivation zu gewinnen natürlich höher ist bei einem netten Team.\nDas einzige was ich mache ist mal jemanden in Schutz zu nehmen wenn er unberechtigt geflamed wird aus Angst er geht Afk oder fängt dann wirklich an zu inten.\nAber ich wünschte mir auch alleine eine positive Einstellung würde mich weiterbringen war bisher leider noch nicht der Fall:(","replies":[{"poster":"thereisnospace","date":"2016-11-17T15:15:37.125+0000","up_votes":2,"down_votes":2,"body":"Hier ist die Kunst deine Chatnachrichten nicht random nach jedem Kill oder ähnliches zu setzen, sondern in den Momenten wo es passend ist.\nDurchschnittlich schreibe ich wahrscheinlich auch insgesamt um die 10-15 Nachrichten pro Game, was vollkommen ausreichend ist.","replies":[]}]},{"poster":"FriendlyShaco","date":"2016-11-17T12:52:22.370+0000","up_votes":3,"down_votes":0,"body":"Endlich hat es einer begriffen, dass dein Rang nicht mit deinem Skill gleichzusetzen ist. Sondern ob man das System verstanden hat.\n\nLG Troublemaker der der immer noch von seinen low elo kumpels geflamed wird, dass er nicht mehr Skill als sie hat aber wie er doch auf dia kam während sie gold blieben","replies":[{"poster":"thereisnospace","date":"2016-11-17T13:26:49.546+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Troublemaker11,realm=EUW,application-id=ip27PlEH,discussion-id=xTYitIsn,comment-id=0000,timestamp=2016-11-17T12:52:22.370+0000)\n>\n> Endlich hat es einer begriffen, dass dein Rang nicht mit deinem Skill gleichzusetzen ist. Sondern ob man das System verstanden hat.\n> \n> LG Troublemaker der der immer noch von seinen low elo kumpels geflamed wird, dass er nicht mehr Skill als sie hat aber wie er doch auf dia kam während sie gold blieben\n\nExakt! Viele meiner Freunde verstehen nicht wieso ich immer Platin bzw. Diamond werde, dabei ist es so einfach.. :)","replies":[]},{"poster":"lnSêc","date":"2016-11-17T17:27:08.970+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Troublemaker11,realm=EUW,application-id=ip27PlEH,discussion-id=xTYitIsn,comment-id=0000,timestamp=2016-11-17T12:52:22.370+0000)\n>\n> Endlich hat es einer begriffen, dass dein Rang nicht mit deinem Skill gleichzusetzen ist. Sondern ob man das System verstanden hat.\n> \n> LG Troublemaker der der immer noch von seinen low elo kumpels geflamed wird, dass er nicht mehr Skill als sie hat aber wie er doch auf dia kam während sie gold blieben\n\naber man kann davon ausgehen dass silber/ gold spieler das system nicht verstehen","replies":[]}]},{"poster":"Intensive Vibes","date":"2016-11-17T15:49:32.956+0000","up_votes":1,"down_votes":2,"body":"Dauert für mich mindestens 5-6 Monate, zudem ich immer in jeder Season in Bronze starte dann aber irgendwo im Gold-Bereich oder höher rumgammel.\nKönnte ruhig noch höher kommen, aber die Zeit fehlt mir dazu. Abitur hrhr..\nBekomme meist immer unerfahrene Spieler, die dann auch immer nur so 30-45% Winrate haben, ist dann sehr stark noch zu carrien wenn sie nicht wirklich viel Potenzial haben. Das Hauptproblem ist einfach, dass es meist immer die Bot ist, die am härtesten am feeden ist. Sprich 0/5, und immer noch Full-AD builden.\nVieler meiner Teammates die ich bisher in PreSeason 7 begegnet bin, wissen nicht, das es besser ist Tanky zu builden anstelle vom normalen Build, wenn man schon 0/5 steht.","replies":[{"poster":"M0psi","date":"2016-11-17T17:21:57.519+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Intensive Vibes","date":"2016-11-17T18:55:19.559+0000","up_votes":1,"down_votes":2,"body":"Ja, aber ich meine meist die Toplaner. Sowas wie Teemo, die dann 0/5 gegen einen Tryndamere stehen und immer noch full ap builden. {{champion:23}}","replies":[{"poster":"LokiOdinson","date":"2016-11-18T08:15:33.502+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Intensive Vibes,realm=EUW,application-id=ip27PlEH,discussion-id=xTYitIsn,comment-id=000400000000,timestamp=2016-11-17T18:55:19.559+0000)\n>\n> Ja, aber ich meine meist die Toplaner. Sowas wie Teemo, die dann 0/5 gegen einen Tryndamere stehen und immer noch full ap builden. {{champion:23}}\n\nSeltsam...\n\n> Das Hauptproblem ist einfach, dass es meist immer die Bot ist, die am härtesten am feeden ist. Sprich 0/5, und immer noch Full-AD builden.\n> Vieler meiner Teammates die ich bisher in PreSeason 7 begegnet bin, wissen nicht, das es besser ist Tanky zu builden anstelle vom normalen Build, wenn man schon 0/5 steht.\n\nIch sehe niemals das Wort \"Toplaner\", dafür aber \"ADC\"... Von daher ist es ja auch nicht verwunderlich das wir uns an den vorherigen Kontext richten - nicht das was du meinst^^","replies":[{"poster":"Intensive Vibes","date":"2016-11-18T11:37:18.107+0000","up_votes":1,"down_votes":1,"body":"War nicht an vorherige Beispiele gerichtet, ist einfach gerade so z.B. aus einer meiner letzen Games entnommen ^^","replies":[{"poster":"LokiOdinson","date":"2016-11-18T12:51:11.435+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Intensive Vibes,realm=EUW,application-id=ip27PlEH,discussion-id=xTYitIsn,comment-id=00040000000000000000,timestamp=2016-11-18T11:37:18.107+0000)\n>\n> War nicht an vorherige Beispiele gerichtet, ist einfach gerade so z.B. aus einer meiner letzen Games entnommen ^^\n\nNicht schlimm, aber dann darf man sich nicht über wunderliche Kommentare verwirren, wieso manche meinen das ein ADC mit Tank-Items fehl am Platz ist ;)","replies":[]}]}]}]}]},{"poster":"Firered Shadow","date":"2016-11-18T09:15:03.321+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Intensive Vibes,realm=EUW,application-id=ip27PlEH,discussion-id=xTYitIsn,comment-id=0004,timestamp=2016-11-17T15:49:32.956+0000)\n>\n> Dauert für mich mindestens 5-6 Monate, zudem ich immer in jeder Season in Bronze starte dann aber irgendwo im Gold-Bereich oder höher rumgammel.\n> Könnte ruhig noch höher kommen, aber die Zeit fehlt mir dazu. Abitur hrhr..\n> Bekomme meist immer unerfahrene Spieler, die dann auch immer nur so 30-45% Winrate haben, ist dann sehr stark noch zu carrien wenn sie nicht wirklich viel Potenzial haben. Das Hauptproblem ist einfach, dass es meist immer die Bot ist, die am härtesten am feeden ist. Sprich 0/5, und immer noch Full-AD builden.\n> Vieler meiner Teammates die ich bisher in PreSeason 7 begegnet bin, wissen nicht, das es besser ist Tanky zu builden anstelle vom normalen Build, wenn man schon 0/5 steht.\n\nDas kann nicht sein, da das Matchmaking dich mit Leuten matcht, die ungefähr eine gleiche Win-Rato haben wie du. (+/- 5%) \nUnd wenn du immer Gold wirst, dann müsstest du eigendlich alle 10 Einrank-Spiele verlieren um wieder bei Bronze zu starten, weil die MMR der letzten Season ja miteinberechnet wird.","replies":[]}]},{"poster":"Pumá D Ace","date":"2016-11-19T15:25:14.804+0000","up_votes":1,"down_votes":0,"body":"Ich habe da sehr ähnliche erfahrungen gemacht. Ich spiele seit etwas über 2 jahren LoL, habe also so ende season 4 angefangen und bin diese season zum ersten mal bis nach platin gekommen (plat 3 war meine höchste elo). Ich war zu beginn meiner league zeit sehr toxisch und hatte schnell meinen ersten ranked bzw chatbann erhalten. \nAber im nachhinein muss ich sagen: dieser temporäre ban war das beste was mir damals passieren konnte! Man bekommt die zeit sein verhalten zu reflektieren und zu uberdenken. \nSeitdem bin ich quasi ,,reformed\" und versuche stets porsitiv zu sein. Ich bin mechanisch ebenfalls nicht gerade der beste spieler und eigentlich auch nicht auf platin niveau, aber es gab letzte season so viele games, die ich nur dadurch gewonnen habe, einfach positiv zu bleiben und weiter alles zu geben. \nEntscheidendes spiel der platin promo zB: die gegner führen 14:3 in kills. Früher hätte ich da komplett getiltet, hätte mein team geflamed und hätte mich wahrscheinlich einfach in die base gestellt xD\nIch habe aber einfach mit bester motivation weitergemacht und die gegner wurden überheblich: wie haben am ende souverän gewonnen -> platin bois !\nAuch auf dem weg dann bis nach plat 3 (der recht schnell ging) konnte ich sowas oft beobachten.\nViele waren sicherlich mechanisch besser als ich, haben aber dann super sdhnell getiltet und wurden uberheblich etc.\nNaja, unterm strich gehört natürlich ein gewisser skill dazu um aufzusteigen, wenn du platin oder dia bisr, kannst du so schlecht nicht sein, aber ja, man kann durch das richtige mindset unglaublich viel kompensieren!\n\nEdit: in einem punkt bin ich aber schon immer anderer meinung gewesen und bin es auch immer noch: ,,man muss spielen, was in der meta ist\".\nAus meiner erfahrung kann ich sagen: spielt einfach die champs aud denen ihr euch wohlfühlt und die ihr mögt. Ich habe diese season auch wieder so viele spieler gesehen, die sich irgendwie genötigt gefühlt haben syndra zu picken, oder jayce, oder kennen usw, nur weil diese champs ja ,,in der meta waren\" und deshalb sind sie ja angeblich wie ein free win. \nBei einem blick auf ihr profil konnte man aber dann sehen, dass sie diese champs quasi so gut wie noch nie richtig gespielt haben, also ihnen fehlt die erfahrung auf diesen champs und somit haben sie dann fast alle sehr sehr schlecht performed.\nAuf der anderen seite hatte ich dann aber spieler im game die aatrox, riven oder xerarh etc gespielt haben. Waren diese champs meta? Sicher nicht. Trotzdem konnten sie wahnsinnig mjt ihren champs carrien, weil sie sie gemaint haben und sie sicherlich auch einfach gern und oft spielen. \nIch meine: was hilft es mir, wenn ich den krassesten meta champ spiele, wenn ich ihn an sich nicht leiden kann und nicht mit ihm zurechtkomme? Deswegen sollte man meiner erfahrung nach nicht so an der meta kleben. Gerade in diamond und darunter ist alles viable. Die ,,meta\" ist mMn sowieso nur so eine sache, die auf den absoluten highelo bzw pro-bereich ausgelegt und wichtig ist.","replies":[]},{"poster":"LordôfBlackTears","date":"2016-11-18T07:35:49.708+0000","up_votes":1,"down_votes":3,"body":"es kommt auf die statistik ein wo der acc zu anfangst eingestufft wurde was nähmlich deine teammitglieder ausmacht (gegner mit einbeschloßen) ich hab auf mein acc als ich mit lol angefangen viel mist gebaut ging einfach afk hab leute beleidigt erst als ich lvl 15 erreicht hab viel der groschen und hab mich geändert weil ich meine kollegen von der schuhle schlagen wollte. die sucht in den spiel ist dann bei mir ausgebrochen und ich hab den acc auf 30 gezogen hab allerdings immer alleine gelevelt wodurch ich eigene erfahrung also langsamer bekommen habe.\nder acc kam in bronze und ich hab es heute immer noch schwer diesn acc höher zu bekommen als silber weil ich ne menge unfreundlicher spieler bekomme.\nallerdings hab ich aufgrund schlechter internet verbindung und angst ich könnte einen bann bekommen mir ein smurf gemacht da ich kein anfänger war und ein relative ruhiger spieler (jetzt) sind meine teammates besser auf dauer ausgefallen und mein können wurd besser erkannt wodurch ich easy mit diesen acc auf gold gekommen binn. also das matchmaking ist schon etwas komisch und wenn du mit highelo leuten in rankeds geworfen wirst von anfang an kommst du generell höher ob du besser oder schlechter bist. riot macht zwar schon ne menge dran aber das ist trotzdem nicht ganz weg","replies":[{"poster":"Axciled","date":"2016-12-26T10:57:50.104+0000","up_votes":1,"down_votes":0,"body":"unsinn","replies":[]}]},{"poster":"Vorzüglich","date":"2016-11-19T15:31:48.705+0000","up_votes":1,"down_votes":2,"body":"Zeigt nur wie schlecht das Matchmaking und Ranking an sich arbeitet.\n\nDie Wahl des Champions oder aktuelle Meta ist viel zu entscheidend, nicht ohne Grund sieht man in jedem zweiten Game die selben Picks.\n\nDas sollte nicht sein, genau sowenig wie die großen Unterschiede im Skill Level einzelnen Spielern.\n\nKann nicht sein das Ein oder Zwei Spieler im Team , den rest immer hard carryn müssen.","replies":[]},{"poster":"Chadono","date":"2016-11-17T15:21:30.017+0000","up_votes":2,"down_votes":3,"body":"Am besten funkioniert es die Teammates so richtig hart zu flamen um sie auf ihre Fehler aufmerksam zu machen. Das spornt doch am meisten an!\nLeider ist diese Strategie von Rito nicht erwünscht, richtig hartes flamen, das die Spieler erst zu Höchstleistungen anspornen würde, wird meist mit Banns bestraft.\n\nP.S. Nein ich hab seit ich LoL spiele noch keine einzige Strafe kassiert.","replies":[]}]}