{"poster":"Cuacimiro","date":"2016-03-09T17:15:35.236+0000","title":"La gente toxica merece ser reportada","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":4,"body":"Acabo de tener una partida en clasificatorias. En la linea de bot un tal &quot;BlameForDefeat&quot; (sin comillas) fue con una Jinx, la cual se paso insultando toda la partida y amenazando con que se iba a desconectar, y si alguno le dec&iacute;a algo (no insultando) ella te hablaba con un lenguaje muy ofensivo a cualquiera de nosotros... Espero que hagan algo con este jugador. Yo lo reporte al finalizar la partida y lo termine bloqueando tambi&eacute;n. Esto ya no puede seguir as&iacute;, esta gente no tendr&iacute;a que estar jugando en este momento, estoy seguro que no es la primera vez que lo hace...\r\n\r\nEspero respuestas por parte de Riot. Saludos.","replies":[{"poster":"AuroraExecution","date":"2016-03-09T17:27:09.348+0000","up_votes":5,"down_votes":0,"body":"Si los reports se acumulan, sera sancionado como debe ser.","replies":[]},{"poster":"Shikuh","date":"2016-03-09T20:35:50.269+0000","up_votes":2,"down_votes":0,"body":"No deberias postear nombres de invocadores en el foro para denunciarlos, con el report basta. Ten ojo porque lo que estas haciendo en este post va contra las reglas del foro.","replies":[]},{"poster":"Icesoul","date":"2016-03-09T17:41:16.496+0000","up_votes":1,"down_votes":1,"body":"Siempre hay gente toxica, no queda otra que aguantarsela, yo no juego rankeds, me da miedo que me pase lo que te paso a vos, juego normales y trato de que todos la pasen bien, de que sea una partida divertida, pero gana siempre la gente toxica, yo estoy decepcionado con el sistema que hay de reportes, yo nunca insulto ni digo nada ofensivo y me han dado una advertencia del chat,  sin supuesta razon, porque si  nomas al parecer, pero el sistema favorece siempre a los toxicos, y de estos siempre  van a haber hasta que el lol deje de ser popular.\nSaludos y suerte, espero que no te vuelvan a tocar esas personas en tus rankeds, ya es dificil aguantarlas en normales y no quiero imaginar hacerlo en rankeds.","replies":[]}]}