{"poster":"my nunu is gg","date":"2019-02-03T20:01:22.063+0000","title":"Wir suchen einen Jungler und einen Adc im Silber bis Gold Bereich","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Hallo Leute,\r\n\r\nWir suchen wie oben bereits genannt einen Adc und einen Jungler.\r\nUnsere Voraussetzungen:\r\n\r\n* 16+\r\n* Ts3 haben (Server wird von uns bereit gestellt)\r\n* Ein vern&uuml;nftiges Headset haben\r\n* Kritikf&auml;hig sein \r\n* Kein Aufgeben durch Trollen etc. (Wird vom Team entschieden)\r\n* Ein gro&szlig;en Championpool auf eurer Lane besitzen (5-10 Champs)\r\n* Keine OTPs\r\n* Fixe Trainingszeiten (werden dann vereinbart)\r\n* Aktiv sein und &uuml;ber Basiswissen verf&uuml;gen\r\n\r\n&Uuml;ber uns:\r\nWir sind selbst Silber-Gold Spieler und 16 Jahre alt. Genaueres erfahrt ihr dann in den Tryouts^^.\r\nFalls ihr Interesse habt meldet ihr euch am besten im Client bei mir (my nunu is gg).\r\n\r\nMfG Chris{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"BeSC Thanatos","date":"2019-02-04T17:54:09.170+0000","up_votes":1,"down_votes":0,"body":"Hallöchen :D\n\nIch bin ADC-Main der letzte Season Gold war und jetzt nach einem Team sucht :D Ich bin weit über 16, mit meinen 22 Jahren und habe nie wirklich irgendwas negatives bezüglich Headset wahrgenommen. Ich war nie ein OTP, war mir zu langweilig, aber ich spiele gerne Jinx, Caitlyn, Ashe, Tristana, Kalista, Vayne und Jhin. Ansonsten auch Ezreal, Kai´Sa & Xayah. Mit Draven kann man mich jagen, den kann ich absolut nicht spielen. xD Ansonsten gehöre ich dem 1. BeSC an und komme aus Berlin. Ich hoffe ich habe euer Interesse mir gegenüber geweckt :)\n\nViele Grüße.","replies":[{"poster":"my nunu is gg","date":"2019-02-10T20:16:12.609+0000","up_votes":1,"down_votes":0,"body":"Hallo und sry für die späte Antwort schaue hier nur selten rein. Du kannst mich gern im Client adden und ein tryout spielen^^.","replies":[]}]},{"poster":"Longerade","date":"2019-02-03T21:26:07.462+0000","up_votes":1,"down_votes":0,"body":"heihei.\nIch bin Jungler im Gold-Platin bereich.\nBei euch steht, keine OTP´s, aus welchem Grund?\nIch bin main jungle und spiele rek´sai und rengar\nich könnte auch andere jungler spielen, aber bin mit den nicht ansatzweise gut, wie mit meinen 2 hauptchamps\"!","replies":[{"poster":"my nunu is gg","date":"2019-02-03T21:51:10.290+0000","up_votes":1,"down_votes":0,"body":"Hey^^,\n\nWir nehmen keine OTPs weil wir gerne div. Teamcombos picken würden. Außerdem falls der champ gebannt ist und man sonst keine spielen kann ist es halt auch nicht sehr gut wenn man flexq spielt^^","replies":[]}]}]}