{"poster":"xXSlaakeXx","date":"2017-07-09T01:11:06.814+0000","title":"Neues Ehrungssüstem","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"H&auml;tte da mal eine Frage ...\r\nWie viele ehrungen muss man den bekommen das man eine Ehrungsstufe aufsteigt \r\nHabe schon etwa 300 ehrungen bekommen ( darunter auch sehr oft 3 mal ) und bin immer noch wie am anfang Ehrungsstufe 2 \r\nIch hoffe es ist nd wieder so das man schnelles absteigt als aufsteigt w&auml;hre nehmlich echt &auml;tzend","replies":[{"poster":"OT Riku","date":"2017-07-09T08:59:02.493+0000","up_votes":1,"down_votes":0,"body":"Ich würde aber schon gerne wissen, ob es möglich ist, in dem Zeitraum den wir bis zum reset haben auf Stufe 5 zu kommen.","replies":[]},{"poster":"MeMyselfandBaal","date":"2017-07-09T06:36:07.119+0000","up_votes":1,"down_votes":0,"body":"Ich hab ja letztens nen Artikel gelesen, dass jeder, der im Forum nach seinem Ehrungs-Fortschritt fragt, von Riot sofort zurück gesetzt wird. Ok, das dürfte nen Postillion Artikel gewesen sein...\n\nAber ehrlich... das neue Ehrungssystem legt die Ehrungsstufen auf das gesamte Jahr hinaus an (auch wenn dieses Jahr später angefangen wurde).  Und das ist jetzt seit diesem Patch draußen... fast so lange wie die SKT Skins... Und irgendwie geht ihr alle davon aus, dass ihr doch jetzt schon Stufe 3 haben müsstet... mindestens...\n\nLeute... entspannt euch einfach und seid freundlich im Spiel. Dann werdet ihr auch schon (ich hab letztens 2 bekommen... mit ner freundlichen \"Weiter so\" Nachricht von Riot) eure Schlüsselfragmente sammeln und aufsteigen. Und wenn ihr im September immer noch Stufe 2 seit... dann könnt ihr mal fragen, was ihr anders macht als andere und wie viele Level 3 Dudes es hier gibt...","replies":[{"poster":"Homunculi","date":"2017-07-09T07:41:59.745+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=Wj1wcocU,discussion-id=bWGudRru,comment-id=0001,timestamp=2017-07-09T06:36:07.119+0000)\n>\n> Ich hab ja letztens nen Artikel gelesen, dass jeder, der im Forum nach seinem Ehrungs-Fortschritt fragt, von Riot sofort zurück gesetzt wird. Ok, das dürfte nen Postillion Artikel gewesen sein...\n> \n\n\nWäre aber mal ne Maßnahme...\n\nIst ja fast wie bei neuen Champs und heiß begehrten Skins, alle 5 Minuten die gleiche Frage -.-.","replies":[]}]},{"poster":"Humpelstilzche","date":"2017-07-09T06:43:54.637+0000","up_votes":1,"down_votes":0,"body":"> Ich hoffe es ist nd wieder so das man schnelles absteigt als aufsteigt währe nehmlich echt ätzend\n\nMan steigt überhaupt nicht ab, außer man wird für toxisches Verhalten bestraft. \nUnd wie die Anderen schon erklärt haben, ist das System darauf ausgelegt, dass man im Laufe der Season die Ränge aufsteigt. Es ist also völlig normal dass einzelne Honor-Level mehrere Wochen oder Monate dauern.","replies":[]},{"poster":"Squidwards House","date":"2017-07-09T04:09:56.275+0000","up_votes":1,"down_votes":0,"body":"300? irgendwie bezweifle ich das.\nes gibt keine nötige menge. der sinn ist das man KONSTANT freundlich ist zum aufsteigen","replies":[]}]}