{"poster":"ExplodingFist66","date":"2019-12-11T23:34:36.404+0000","title":"Where’s the champion theme for Aphelios?","subforum":"Story, Art, & Sound","up_votes":12,"down_votes":62,"body":"This went quite unnoticed. Senna’s soundtrack was published a long time before her spotlight came out. It’s making me kind of worried. I watched the teaser for Aphelios and absolutely love the background music. When I first heard It I was instantly hooked. It’s very pleasant to listen to and captures the true aspect of him. The animations were also perfect. Other than that, we’re still missing the video for his theme.\r\n\r\nRiot, please do not scrap champion themes. It’s as important as their lore. If you’re not going to give us login screens, at the very least you could at least give us the melody.","replies":[{"poster":"Ackelope","date":"2019-12-12T01:21:55.820+0000","up_votes":1,"down_votes":0,"body":"man, this really got bombarded with downvotes.","replies":[{"poster":"Interlocutioner","date":"2019-12-12T06:10:36.220+0000","up_votes":8,"down_votes":0,"body":"I think there's something weird going on with bots... usually something this controversial (judging by the votes) would've had people arguing with the OP. {{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"4 Step Cadence","date":"2019-12-12T06:14:33.835+0000","up_votes":6,"down_votes":0,"body":"Yep, its bots. They randomly nuke posts with massive amounts of upvotes or downvotes. Happens more often than you might think.","replies":[]},{"poster":"Spideraxe","date":"2019-12-12T16:00:25.561+0000","up_votes":2,"down_votes":0,"body":"Hey Slagle just wanted to say I loved You Are the Weapon, would Aphelios' plotline center around him and Alune tracking down Diana?","replies":[{"poster":"Interlocutioner","date":"2019-12-12T18:02:27.752+0000","up_votes":3,"down_votes":0,"body":"Aw shucks. Thanks. {{sticker:sg-soraka}} \n\nDiana meeting the Lunari is really big plotline for Targon in general! Especially now that power is shifting. (Has anyone mentioned how that whole story thread goes all the way back to Zoe?)","replies":[{"poster":"Spideraxe","date":"2019-12-12T19:08:27.790+0000","up_votes":2,"down_votes":0,"body":"Could you share how you and Sunny came up with names of Aphelios’ arsenal","replies":[{"poster":"Interlocutioner","date":"2019-12-12T20:36:44.265+0000","up_votes":3,"down_votes":0,"body":"Mind [hitting me up on Reddit](https://www.reddit.com/user/Interlocutioner)? I don't want to hijack this thread too much.","replies":[]}]}]}]}]}]},{"poster":"mikeov","date":"2019-12-12T01:09:10.431+0000","up_votes":6,"down_votes":0,"body":"[Rejoice, they just released it!](https://www.youtube.com/watch?v=NQIeAbFT4Kc)","replies":[]},{"poster":"Toon Draw","date":"2019-12-12T18:06:39.668+0000","up_votes":1,"down_votes":0,"body":"I'm kinda worried that riot responded at this post but there is no answer about champion themes.","replies":[{"poster":"Interlocutioner","date":"2019-12-12T18:33:10.255+0000","up_votes":4,"down_votes":0,"body":"Expect every champion's promotional campaign to be slightly different. There are so many things happening at once in this game (between e-sports, skins, events, champions, etc) that if things don't shift around, we might end up posting ten videos to Youtube the same day There are also limits to how much the promo team can handle at one time, and the composers. \n\nFun fact. [Talondor](https://boards.na.leagueoflegends.com/en/player/NA/Talondor) worked on the Aphelios theme as he was also working on True Damage, which is a pretty intense workload and makes the theme all the more impressive, IMHO.\n\nSo, sorry for the delay in this case.\n\nEdit:\n\nAnd correct me if I'm wrong, but we haven't shipped any champions without themes, have we? Personally, they're one of my favorite parts of the process, when the characters come alive, move and breathe along with the notes. We better keep doing them {{sticker:sg-shisa}}  lol.","replies":[{"poster":"Larriet","date":"2019-12-13T00:27:05.113+0000","up_votes":3,"down_votes":0,"body":"After season ... 3?  I think you're correct, yes.\n\nI wish we could get themes for older Champions at some point, though I'm not holding my breath lol.","replies":[]},{"poster":"Toon Draw","date":"2019-12-12T19:13:38.548+0000","up_votes":1,"down_votes":0,"body":"I'm sorry about that, but is kinda part of the issue, that login skins are no longer part of the client will make players not knowing what is the theme related to the champion, although. I admire Talondor I did not know he was the producer behind those themes and there's a lot sound produce know since I see in the PBE more then 13 different skins \nI hope Mr. Talondor can have a break this holidays","replies":[]}]}]},{"poster":"AnotherPurple379","date":"2019-12-12T13:54:51.530+0000","up_votes":2,"down_votes":0,"body":"It did take longer than I would have liked, but they released it just recently, don't worry! And it's quite good!","replies":[]}]}