{"poster":"ExplodingFist66","date":"2018-06-30T20:52:17.516+0000","title":"List of champions that need a rework","subforum":"Gameplay","up_votes":28,"down_votes":22,"body":"{{champion:266}} \r\n{{champion:266}} \r\n{{champion:266}} \r\n{{champion:266}} \r\n{{champion:266}} \r\n{{champion:266}} \r\n{{champion:266}} \r\n{{champion:266}} \r\n{{champion:266}} \r\n{{champion:266}} \r\n{{champion:266}} \r\n{{champion:266}} \r\n{{champion:266}} \r\n{{champion:266}}","replies":[{"poster":"TheDevice","date":"2018-07-01T01:07:14.672+0000","up_votes":6,"down_votes":1,"body":"so much salt","replies":[{"poster":"Beacon Academy","date":"2018-07-01T01:28:31.651+0000","up_votes":8,"down_votes":2,"body":"Most people won't understand the salt until its their turn for a complete VGU\n\nThe lack of complaints & rant threads along with a low ban/pick rate made me think Malzahar was always going to be there for me after work... Until low quality mass class reworks were a thing.\n\nI'll never forget patch 6.9 nor the silence from repertoire on the subject for 1.5 or so years afterwards :/\n\nAnd it doesn't help that the way Riot does things is to do extreme things to make everyone unhappy, so that when they dial things back to what they probably actually wanted, people would be relatively happy... With only the most dedicated mains crying in the corner.\n\nI wouldn't be surprised if this current Atrox is just a ploy to purposefully make him hated, so when they do QoL buffs, AAtrox will be forgotten just like every other VGU champion, referenced only in arguments a couple years from now and being told AAtrox has \"always\" been cancer which is why he was changed.\n\nBecause that was what my experience watching pre-rework Malzahar's reputation get ground into the dirt simply for being similar to the cancerous reworked version of him was like.","replies":[{"poster":"Nenthos","date":"2018-07-01T01:39:45.863+0000","up_votes":5,"down_votes":1,"body":"So much this^ Nail on the head dude. Remember how Galio's rework was all the craze? Now no one could care less but the ones who actually played him feeling like crap.","replies":[]},{"poster":"PrinceOfStorms","date":"2018-07-01T10:09:18.154+0000","up_votes":1,"down_votes":0,"body":"> Most people won't understand the salt until its their turn for a complete VGU\n\nHonestly, as a Vlad main, I would love it if Riot gave him a full VGU, because maybe then they wouldn't nerf him if he ever sees pro play.","replies":[{"poster":"Beacon Academy","date":"2018-07-01T10:14:30.179+0000","up_votes":2,"down_votes":0,"body":"inb4 Vladimir becomes a bruiser that uses blood but has no lifesteal/sustain.\n\njk jk","replies":[{"poster":"PrinceOfStorms","date":"2018-07-01T10:23:53.639+0000","up_votes":1,"down_votes":0,"body":"Judging by how they changed Vlad in the Mage update they'd probably leave in his sustain but make it a lot more conditional. Like the Crimson Rush system creates windows where he's strong (he has Crimson Rush) and where he's weak (he does not). Now if they could make more of his spells interact with Crimson Rush (spending it at 2 stacks and building it when used) that would be even better, because then Vlad has to decide whether or not he should use the Crimson Rush stack on a Transfuse (to heal) or one of his other spells for some additional effect.","replies":[]}]},{"poster":"GayFluffyUnicorn","date":"2018-07-01T11:25:26.458+0000","up_votes":1,"down_votes":0,"body":"Riot is nerfing vlad? When? Where? \nThat 0,2 AP ratio from fully charged E? \nOh wow. \nThis champ shouldnt be viable at all. \nYet he is THE best champ in every role.","replies":[{"poster":"PrinceOfStorms","date":"2018-07-02T03:19:12.638+0000","up_votes":1,"down_votes":0,"body":"That's -250 damage lategame, which is massive.\n\nHe also doesn't have >50% winrate in any role.","replies":[]}]}]}]}]},{"poster":"gileskd","date":"2018-06-30T23:00:58.272+0000","up_votes":7,"down_votes":9,"body":"list of champions that need a rework\n1. nobody\n\nall a rework is, is introducing a brand new champion, that has 1 or 2 things in common with the old champ before deletion.\nthey fucked up taric\nthey messed up galio\nand I have only seen complaints about the \"NEW\" AA batteries trox.\n\n-say no to reworks-","replies":[{"poster":"kda akali","date":"2018-06-30T23:38:45.371+0000","up_votes":9,"down_votes":3,"body":"> [{quoted}](name=gileskd,realm=NA,application-id=3ErqAdtq,discussion-id=BOr4b7n8,comment-id=0001,timestamp=2018-06-30T23:00:58.272+0000)\n>\n> list of champions that need a rework\n> 1. nobody\n> \n> all a rework is, is introducing a brand new champion, that has 1 or 2 things in common with the old champ before deletion.\n> they fucked up taric\n> they messed up galio\n> and I have only seen complaints about the &quot;NEW&quot; AA batteries trox.\n> \n> -say no to reworks-\n\nI honestly think Taric's rework was an improvement, gameplay wise he gained a higher skill ceiling. Tarics visuals and lore are very good too, his personality stayed the same too and atleast from what I remember people were satisfied with it when it came out. The only complaint I really saw was that the ult was just added on, and I did like the old Taric ult but it was really underwhelming. New Taric ult is interesting and adds onto his thematic more as a protector. ","replies":[{"poster":"Academy Kayn","date":"2018-07-01T00:05:26.077+0000","up_votes":7,"down_votes":2,"body":"Yeah, like, what, there are maybe some questionable reworks, but Taric?? Really??","replies":[{"poster":"Arcane Blue Boi","date":"2018-07-01T01:28:59.244+0000","up_votes":4,"down_votes":3,"body":"They could've just added a new champion with taric's kit and nobody would blink an eye. \nEVERYTHING about his kit is different exept: he still has a SOME kind of stun and SOME kind of healing, so half a Q and E. That adds up to 1?\nin 5 abilities they didnt change 1. cool and good","replies":[{"poster":"Academy Kayn","date":"2018-07-01T05:38:49.099+0000","up_votes":5,"down_votes":1,"body":"That's what happens when you have some of the most basic abilities you can give a champion. \n\nA heal. \nA stun. \nAoe Stat Aura.\n\nThe only interesting/unique thing he had himself, was the armor passive and armor shatter, but even then, it's a conflict in identity to have such a heavy support character also shredding opponent armor.","replies":[{"poster":"My Waifu Vanilla","date":"2018-07-01T12:34:32.114+0000","up_votes":2,"down_votes":0,"body":"He shredded his own armor as well iirc by using the W since he \"lost\" his bonus armor from the passive.","replies":[]}]}]},{"poster":"gileskd","date":"2018-07-01T05:24:08.447+0000","up_votes":2,"down_votes":3,"body":"yep taric.\nwent from 3 damaging abilities to 1.\ncan you please tell me your opinion on why the rework was not questionable?","replies":[{"poster":"Academy Kayn","date":"2018-07-01T05:36:47.561+0000","up_votes":5,"down_votes":2,"body":"Cause he's a support, and his damage was shifted into more utility options, while retaining the CD lowering from his old autos into his passive, which makes up a good portion of his lane damage. My Brother loves playing him top, before and after the rework, and it still plays the same way.","replies":[{"poster":"gileskd","date":"2018-07-01T05:41:46.629+0000","up_votes":1,"down_votes":0,"body":"can I have a name please, I would like to investigate this","replies":[{"poster":"Academy Kayn","date":"2018-07-01T05:47:10.435+0000","up_votes":1,"down_votes":1,"body":"ninjalord433, though admittedly, the fights I was referencing were of a longer time ago, back when his rework came out, around up to when he got the change to his Q to have up to 5 charges. \n\nThe main point I'm getting out, is that Taric relatively plays the same. Sure, he lost a lot of his abilities, but that was because they were bare bones of an ability. Stun, Heal, AOE Aura of Stats, the only real thing he had unique to him was his Armor and Armor shatter. They had a lot of room to change things that were, frankly, basic.","replies":[{"poster":"gileskd","date":"2018-07-01T06:32:22.586+0000","up_votes":1,"down_votes":1,"body":"I couldn't find anything with that name, maybe a spelling error or the games were too long ago.\n\ntaric was reworked around 2 years ago, when we still had the old runes and masteries.\nwith full scaling armor and some good masteries to choose from.\nbut now especially with the new runes, damage was increased and defense options were lowered.\nbuild tank and you get bursted by anyone with conqueror.\nbuild damage and you will get bursted by assasins and/or lane against someone with a dash. (mostly everyone)\ntaric playing relatively the same now as he did 2 years ago? he has fallen massively\nagain, he went from dealing damage to \"ignore the taric, focus the damage\" in team fights\n\nlet us go back now to taric and the laning phase.\nassuming taric went top lane. which match ups would he win, or even if he did lose the early, would win late?\ngnar? ranged, also has a hop\ngangplank? melee, but can easily eat an orange and walk away from the stun before taric can auto\nChogath? melee, but is ap. can knockup taric pretty easily unless he flashes.\nornn? melee, has a shield, can build items in lane.\nCamille? melee, hookshot, gains a shield base off what type of dmg did the most damage\nvlad? ranged, pool, no mana costs.\nsion? has a shield, hard to miss knockup (as taric has no dashes(could stun, but sion can use it again in 2 seconds))\nmaokai? melee, ap, can dodge stun with root, can also just knock taric away.\nshen? melee, but of tarics damage is auto attacks. with a skill that blocks auto attacks, not looking good.\ntrundle? melee, easy knockaway from taric with pillar\nLucian? is AD, but ranged and has a dash\njayce? melee and ranged, knockback and a speedup, taric isn't gonna come close unless jayce wants it\nkled? melee, with skarl passive, taric isn't gonna be able to knock him off his lizard and kill him before skarl comes back\nyasuo? melee, ad, windwall will not block the stun, but with the dashes and the passive shield, isn't gonna kill him either\nilloai? melee, but wants taric to be in melee range\ndarius? good luck trying to burst him down, 1 q hits, your in trouble\nurgot? melee, go ahead, get close to him\nfiora? melee, same as urgot\npoppy? I can see him winning this one pre 6, once level 6, if taric does more damage to her, she is just gonna ult him away\nswain? HAHAHA, nope.","replies":[{"poster":"BeatzBoyFTW","date":"2018-07-01T10:31:23.559+0000","up_votes":2,"down_votes":1,"body":"> assuming taric went top lane.\n\nWhy the fuck would you bring Taric top? Old or new.\n\nStun? Just play Pantheon.\nHeal? Just play Gangplank.\nInvulnerability? Just play Kayle.\nBonus Armor Resistance? Just play Malphite.\n\nThere's literally billions of other champions better to play than Taric.","replies":[{"poster":"gileskd","date":"2018-07-01T18:12:29.233+0000","up_votes":1,"down_votes":2,"body":"new taric is terrible XD\nbut believe it or not, old taric was better.\nby building armor (similar to malphite, rammus,) you increased your damage\nhe also had an armor aura, all allies close by get an armor bonus\nand that same ability (once activated) decreased the armor of the enemy units\nfinally his ult gave his team attack power and ability power\n-----\nactivating w and r increased your already amazing damage\nsomething that is very lacking in the new one","replies":[]}]}]}]}]}]}]}]},{"poster":"gileskd","date":"2018-07-01T05:20:39.494+0000","up_votes":2,"down_votes":0,"body":"taric went from a fighter to a babysitter.\nhe only has 1 source of dmg, and has to really on auto attacks.\nalso his damaging ability has a delay. cast the spell, and hope the enemy doesn't have a dash/flash up.\ngets better if he is paired with another ally, which means he has to go bot lane. (or if gold funneling hit R)\nhe needs TIME, and a lot of it to do any damage. hard to do when you die in 4 seconds.\n\nTL;DR\nwhere the damage at?","replies":[]},{"poster":"Nenthos","date":"2018-07-01T01:02:25.452+0000","up_votes":2,"down_votes":1,"body":"Disagree, different champ now. And regardless of it being done for \"muh balance\" it's less fun to play making it worse by that alone. Don't have a problem with visual updates though.","replies":[{"poster":"Succubús GF","date":"2018-07-01T07:06:41.578+0000","up_votes":3,"down_votes":2,"body":"Do you even remember old taric? That kit was so bad, old and in DIRE need of a tune up.","replies":[{"poster":"gileskd","date":"2018-07-01T07:19:41.143+0000","up_votes":3,"down_votes":4,"body":"O, We Do\nthis new kit is WORSE than the last one,\na tune up I will take, taking off half of the screws I will not","replies":[{"poster":"BeatzBoyFTW","date":"2018-07-01T10:33:12.255+0000","up_votes":1,"down_votes":2,"body":"Point & Click Heal vs AoE spammable Heal.\n\nPoint & Click Stun vs AoE Stun that comes from two different source (Taric & his dick-buddy)\n\nA Sona Aura-Stat passive on his ult vs a delayed AoE Invulnerability that can change the course of the fight.\n\n\"Worse\", my ass.","replies":[]}]}]}]},{"poster":"Tomoe Gozen","date":"2018-07-01T15:52:21.751+0000","up_votes":1,"down_votes":0,"body":"Don't mind the other guy, he's just salty.","replies":[]}]},{"poster":"1542","date":"2018-07-01T07:37:39.390+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=gileskd,realm=NA,application-id=3ErqAdtq,discussion-id=BOr4b7n8,comment-id=0001,timestamp=2018-06-30T23:00:58.272+0000)\n>\n> list of champions that need a rework\n> 1. nobody\n> \n> all a rework is, is introducing a brand new champion, that has 1 or 2 things in common with the old champ before deletion.\n> they fucked up taric\n> they messed up galio\n> and I have only seen complaints about the &quot;NEW&quot; AA batteries trox.\n> \n> -say no to reworks-\n\ni just want my talon and malz reverted, those dumb reworks riot did on them are awful, reworks take away a champ identity they become whole new champs, it's fine if they want to release a champ with those kits but make them new champs don't screw the ones we play.","replies":[]},{"poster":"Fawksea","date":"2018-07-01T11:15:03.288+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=gileskd,realm=NA,application-id=3ErqAdtq,discussion-id=BOr4b7n8,comment-id=0001,timestamp=2018-06-30T23:00:58.272+0000)\n>\n> list of champions that need a rework\n> 1. nobody\n> \n> all a rework is, is introducing a brand new champion, that has 1 or 2 things in common with the old champ before deletion.\n> they fucked up taric\n> they messed up galio\n> and I have only seen complaints about the &quot;NEW&quot; AA batteries trox.\n> \n> -say no to reworks-\n\nhonestly this","replies":[]}]},{"poster":"ƒrostγ","date":"2018-06-30T22:39:11.858+0000","up_votes":7,"down_votes":3,"body":"They should just revert it honestly or at least make his new kit less clunky.","replies":[{"poster":"Tomoe Gozen","date":"2018-07-01T15:50:51.852+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=ƒrostγ,realm=EUNE,application-id=3ErqAdtq,discussion-id=BOr4b7n8,comment-id=0000,timestamp=2018-06-30T22:39:11.858+0000)\n>\n> They should just revert it honestly or at least make his new kit less clunky.\n\nNah.\nRiot's not reverting him.\nAatrox is fine and if you have a problem with him, it's mostly you being unwilling to learn him/expecting to be OP on release.","replies":[]}]},{"poster":"WalterTM","date":"2018-07-01T09:45:42.978+0000","up_votes":2,"down_votes":0,"body":"As an Udyr main, I would love him to be reworked. Hopefully Riot learns from these outrages and at the point of his rework they'll be able to give him a modern, but similar kit and flexibility.","replies":[]},{"poster":"Beacon Academy","date":"2018-07-01T01:25:21.363+0000","up_votes":3,"down_votes":1,"body":"Not really sure why they didn't keep AAtrox and introduce a new darkin.\n\nThey're so different in gameplay and personality it woulda worked.","replies":[]},{"poster":"Wild Geese","date":"2018-07-01T03:44:14.157+0000","up_votes":2,"down_votes":1,"body":"Galio's rework was well designed, but the balance team failed it.\n\nI never played old Galio so I don't have a bias here... New Galio is very fun, and would be more fun if he wasn't in a state of being nerfed to oblivion.\n\nHowever champs like Taric, Sion, and Poppy... Sorry they were so bad they kinda deserved it. But even so; it's hard to deny the new one isn't better than the old one.\n\nAatrox however... Bad and still bad.","replies":[]},{"poster":"Wild Geese","date":"2018-07-01T01:24:31.095+0000","up_votes":1,"down_votes":0,"body":"If they are going to delete the champion, they need to make sure the new one is better.\nNot the case for good ol Aatrox unfortunately.","replies":[]},{"poster":"A Nunu","date":"2018-07-01T08:53:17.936+0000","up_votes":1,"down_votes":1,"body":"{{champion:13}} {{champion:13}} {{champion:13}} {{champion:13}} {{champion:13}} {{champion:13}} {{champion:13}} {{champion:13}} {{champion:13}} {{champion:13}} {{champion:13}} {{champion:13}} .\nhttps://i.imgur.com/b7Hjwht.png/img","replies":[]},{"poster":"Ahris","date":"2018-06-30T23:06:42.071+0000","up_votes":1,"down_votes":5,"body":"Include Ahri in there and we are good/","replies":[]}]}