{"poster":"jojo12jei","date":"2018-10-25T17:20:44.991+0000","title":"Team Edges Esport sucht neue Spieler für FaceIt etc.","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Moin, du spielst aktiv LoL und hast bock mit einem neuen Team etwas zu erreichen ? Dann bist du bei uns genau richtig. Wir legen nicht nur Wert auf Disziplin ingame, sondern wollen ein angenehmes Klima bei uns im Clan haben. Gesucht wird derzeit: Main ADC,Top, Jng und Mid. Ich selber bin Support Main. Spielzeiten sind erstmal nicht gegeben. Ihr solltet aber trotzdem sehr Aktiv sein. Ich hoffe die meisten wissen was Faceit ist, erstmal wollen wir uns auf Faceit konzentrieren um dort sahnige Coins zu kassieren und davor RP etc. zu kaufen.  Parallel nat&uuml;rlich auch bei anderen diversen Plattformen mitmachen und somit bekannt werden. Ich hatte fr&uuml;her schonmal ein Clan der sehr gut war und wir hatten auch verschiedene Sponsoren. Ich hoffe damit wir den Clan wieder so aufbauen k&ouml;nnen um wieder viele Sponsoren zu bekommen und auch dem einen oder anderen Spieler aus unseren Clan vlt. mit der Hardware bisschen aus zu helfen oder f&uuml;r jedes Clanmitglied ein eigenes Clan-Shirt zu bekommen. Sowas war bei meinem alten Clan alles m&ouml;glich.\r\nSolltet ihr nun Interesse haben, k&ouml;nnt ihr mir gerne eine Email schreiben unter: jojo122jei2@gmail.com oder unseren TS joinen: GamingDE.necror.net und mich ( jojo122jei) anstupsen.\r\nBitte nicht hier im Post drauf antworten, ich denke ich werde nicht immer hier mir den Post angucken.\r\n\r\nLg\r\njojo122jei","replies":[{"poster":"jojo12jei","date":"2018-10-26T08:19:12.698+0000","up_votes":1,"down_votes":0,"body":"Push","replies":[]},{"poster":"jojo12jei","date":"2018-10-25T17:41:52.479+0000","up_votes":1,"down_votes":0,"body":"Ach und eins habe ich vergessen, wenn wir ein 5 mann team wieder zum leben erweckt bekommen, können wir unser Team bei Ryzing-gaming unter vertrag Stellen !! Aber dafür müssen wir 5 mann sein und uns gut unter beweis stellen. Sollte aber locker machbar sein wenn wir genug trainieren.\n\nPS: habe mit dem Headmanager von ryzing-gaming gesprochen. die Würden sich sehr gerne auf uns freuen.\n\nihr könnt mich auch einfach ingame adden: jojo122jei oder Scavengarr\n\nlg\njojo122jei","replies":[]}]}