{"poster":"Lawlet","date":"2015-04-27T21:34:12.149+0000","title":"Timey wimey zilean","subforum":"Gameplay","up_votes":7,"down_votes":0,"body":"I have seen some quite posts about zilean and those are the thoughts that prevails.\n\n* Has no real passive.\n* The old double Q.Q combo was fun, but sick for the enemy player. The new one is boring.\n* Rewind should be transitioned to a passive.\n* The ultimate is great.\n* The timey wimey role should be reinforced.\n* Zilean players miss the old permaspeed.\n* Some kind of slow projectile would be awesome.\n\nSo I did a rework based on those thoughts.\n\n**(Passive) Heightened Learning:**\n\nEvery Time that a minion dies near to Zilean he has a probability to drop a memory, if Zilean grabs the memory or uses a bomb in the memory (Causing a instant bomb explosion) his allies will reduce his basic cooldowns by a 10% of the actual cooldown and reducing a 25% of the total cooldown (after cooldown reduction) the abilities of zilean, Time bomb receives a 50% reduction.\n\nI do this in order of prevail the W effect while making it more suportive\n\n**Time Bomb:**\n\nRange stays the same (900)\nMana cost stays (60/65/70/80/85)\nSticky area remains the same as actual\nCooldown reduced to (9.5, 9, 8.5, 8, 7.5s)\nDamage reduce to (75/115/165/230/300+80%) from (75/115/165/230/300+90%)\n\nRemains the 3s delayed explosion\n(Double stun by bomb has move to W+Q combo, I think that you can&#039;t even do double bomb anymore)\n\n**W: Rewinds -----> Changed to \"Timey ball\"**\n\nCooldown: 10s at all levels\nMana cost: 60/65/70/75/80\nAfter a short delay Zilean makes a temporal distortion making an area that last for 3s dealing 80/120/160/200/240+0.5% in total, reducing the move speed for 20/25/30/35/40% of enemy champs and boosting allies in addition the enemy spells and attacks that cross the area would be slowed too.\n\nIf a bomb of zilean enters in the area, this would explode doing the remain damage instant and stunning, but the area fades.\n\nThis will make the same effect as a memory.\n\nSImilar to http://st.elohell.net/public/chill/8774c4381c6ec809996c187a8474aa0c.gif\n\nI love this concept to Zilean and is easier to him to stun, suppressing E in order to receive this skill but is kinda worthy i think.\n\n\n**Alter time**\nMana cost: 50\nCooldown: 20/17/16/14/12\nNEW: Zilean marks an enemy or an ally after 2s the target would return in the position where he was marked.\n\nSimilar to https://www.youtube.com/watch?v=ij-wdG4rjNw\n\nThis gives Zilean a real outplaying tool for himself or anyone at him team while punishing enemies with easy scape.\n\nR: Chronoshift\nI don&#039;t feel that this spell needs a rework, but needs some kind of notification to the User. \nRight now the screen is brighter so reducing it (make it noticeable) at the end of the ulti will be enough.\n\nPossible add to Zilean to prevail a bit the speed effect upgrading this spell gives (+10,15,20% speed while NOT in combat)\n\nMaybe as an a idea this ulti could be a % heal and not a flat heal.","replies":[{"poster":"Tis a nice day","date":"2015-04-28T06:21:50.276+0000","up_votes":1,"down_votes":0,"body":"who is \"her\"?","replies":[{"poster":"Lawlet","date":"2015-04-28T15:24:33.335+0000","up_votes":1,"down_votes":0,"body":"Where? Quote the sentence, please","replies":[{"poster":"Tis a nice day","date":"2015-04-28T17:26:40.134+0000","up_votes":1,"down_votes":0,"body":"> if Zilean grabs the memory or uses a bomb in the memory (Causing a instant bomb explosion) **her **allies will reduce **her **basic cooldowns","replies":[{"poster":"Lawlet","date":"2015-04-28T17:41:15.862+0000","up_votes":2,"down_votes":0,"body":"Corrected, thanks","replies":[]}]}]}]},{"poster":"Ipols","date":"2015-04-28T13:58:50.403+0000","up_votes":2,"down_votes":0,"body":"OP missed a point: He's a time mage, not a terrorist. He should \"warp\" bombs in the battlefield, not shooting them with a slighshot or a catapult.\nIt's like seeing a varus that throws arrows with his bare hands.","replies":[{"poster":"Venowolf","date":"2015-04-28T18:23:59.192+0000","up_votes":1,"down_votes":0,"body":"U are wrong he is a terrorist, soon they show the terrorist Zilean skin, he uses bombs a dive to huge speed carryng bombs, actually he is more a terrorist than mage time.","replies":[]},{"poster":"Lawlet","date":"2015-04-28T15:30:27.972+0000","up_votes":1,"down_votes":0,"body":"That's an interesting point, but I really like the tictac 3s bomb effect and the explosion is quite satisfying.\n\n I think that change it to a time vortex or an anomaly time space could improve the timey wimey effect, while keeping the skill. \n\nMore a SFX change than balance change thought.","replies":[]},{"poster":"Ipols","date":"2015-04-28T13:59:43.847+0000","up_votes":1,"down_votes":0,"body":"sling*","replies":[]}]},{"poster":"The Soulforged","date":"2015-04-28T05:37:54.394+0000","up_votes":1,"down_votes":0,"body":"I'm quite confused on the passive. \nWhat does it do exactly?","replies":[{"poster":"Lawlet","date":"2015-04-28T15:24:00.569+0000","up_votes":1,"down_votes":0,"body":"Is similar to thresh, killing minions near to your position makes them drop a memory, you can catch the memory by walking to it or using a bomb, receiving the effect.\n\nOk making the math.\n\n8s cooldown on Q. If you are Zilean will always reduce 2s (25% of total cooldown)\n\n8s cooldown on Q. If you are an ally reduce depending of the actual cooldown. (10% of actual cooldown)\n\n15s---> 1.5s less (13.5s)\n7s--->0.7s less (6.3s) \n5s---->0.5s less (4.5s)\n2s--->0.2 less (1.8s)","replies":[]}]}]}