{"poster":"Mh012","date":"2017-09-12T14:20:05.861+0000","title":"Bot ARAM Ornn","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Facendo un paio di ARAM, ho notato che ci sono molti Ornn che vanno a 0 item, niente, nada di nada, zero. Oltretutto ci si imbatte in account dalla match history pieni di partite ARAM, e coincidenza, anche molte partite di Ornn con partite terminate a 0 item. So che ARAM &egrave; stra-piena di bot, e che la Rito non pu&ograve; occuparsi di tutti questi cheater, ma questa condizione comporta ad enorme abuso da parte degli avversari (sia in game che non, e con &quot;non&quot; vi lascio pensare a voi cosa intendo)","replies":[{"poster":"Domanda","date":"2017-09-12T18:58:01.706+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mh012,realm=EUW,application-id=MJVj50Jw,discussion-id=69ARNqeY,comment-id=,timestamp=2017-09-12T14:20:05.861+0000)\n>\n>So che ARAM &amp;egrave; stra-piena di bot, e che la Rito non pu&amp;ograve; occuparsi di tutti questi cheater, ma questa condizione comporta ad enorme abuso da parte degli avversari (sia in game che non, e con &amp;quot;non&amp;quot; vi lascio pensare a voi cosa intendo)\n\nCiao!\nPenso che un po' tutti hanno provato la frustrazione di giocare con un bot e la felicità di giocarci contro. Mi dispiace che la tua esperienza di gioco sia stata rovinata da qualche imbroglione ma a tuo favore hai una bellissima arma chiamata REPORT. In questi casi, si reporta SEMPRE qualcuno che in apparenza sembra un bot (utilizzo apparenza, ma un bot si riconosce a migliaia di km di distanza). I report vengono sempre analizzati tutti, quindi il tuo dovere da giocatore lo hai fatto e l'imbroglione prima o poi verrà bannato ^^\nBuona fortuna nella landa! :*\n\nhttps://media.tenor.com/images/5c1bb6a8d8278d25eacb28412c65da66/tenor.gif","replies":[{"poster":"Mh012","date":"2017-09-12T19:05:47.764+0000","up_votes":1,"down_votes":0,"body":"no no, l'ho avuto contro (sopratutto perché gioco con un mio amico, diminuendo le probabilità di trovare dei bot), ma il punto è che è frustante anche per quelli che hanno contro. Nel senso, io faccio ARAM per questioni di tempo, mi aspetto una bella partita da 20-30 minuti a differenza di uno nella landa, che, anche se giochi male, la partita si protrae per oltre 40 minuti.\nCon \"abusabile\" intendo che, visto la IA di questi bot (ti divano sotto torre, le skill le lanceranno sempre in sequenza...), è facilissimo farmare le chest. Io preferisco una chest conquistata con abilità invece di una avendo fatto il minimo.","replies":[]}]}]}