{"poster":"Ecsstasy","date":"2016-01-20T23:18:49.700+0000","title":"0001: unable to locate the content swf directory: app:/mod/win","subforum":"Problemas Técnicos","up_votes":0,"down_votes":0,"body":"Hola muy buenas, he tenido este problema todo el d&iacute;a. No puede solucionarlo por mi cuenta y ya intente borrando los datos del parche para que se vuelva a actualizar\r\n\r\nMe aparece {{champion:32}} despu&eacute;s de presionar a &quot;Ejecutar&quot; y hay un texto que dice esto: **0001: unable to locate the content swf directory: app:/mod/win**","replies":[{"poster":"SemSang","date":"2016-03-26T06:24:23.815+0000","up_votes":1,"down_votes":0,"body":"muchachos yo tenia el mismo problema y recien lo pude solucionar, lo repare 5 veces me seguia saltando el cartel prove una ves mas y se soluciono.\nsi no saben como reparar, abren el lol y antes de darle ejecutar hagan clic en el signo de pregunta y dsp en reparar","replies":[]},{"poster":"zlKaMiZaMalz","date":"2016-03-19T14:10:55.722+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ArthurSoulFire,realm=LAS,application-id=X54mVVp0,discussion-id=BkP16Gro,comment-id=,timestamp=2016-01-20T23:18:49.700+0000)\n>\n> Hola muy buenas, he tenido este problema todo el d&iacute;a. No puede solucionarlo por mi cuenta y ya intente borrando los datos del parche para que se vuelva a actualizar\n> \n> Me aparece {{champion:32}} despu&eacute;s de presionar a &quot;Ejecutar&quot; y hay un texto que dice esto: **0001: unable to locate the content swf directory: app:/mod/win**","replies":[{"poster":"zlKaMiZaMalz","date":"2016-03-19T14:11:23.766+0000","up_votes":1,"down_votes":0,"body":"puto amumu como lo ago mierda","replies":[]}]},{"poster":"maxreef","date":"2016-03-11T22:09:58.348+0000","up_votes":1,"down_votes":0,"body":"que ago","replies":[]},{"poster":"maxreef","date":"2016-03-11T22:08:49.466+0000","up_votes":1,"down_votes":0,"body":"me pasa lo mismo","replies":[]},{"poster":"Kmikace","date":"2016-02-18T01:01:28.705+0000","up_votes":1,"down_votes":0,"body":"A mi me pasa lo mismo, alguna puta solución ????????????????????????????","replies":[]},{"poster":"Zufru","date":"2016-02-13T04:24:11.671+0000","up_votes":1,"down_votes":0,"body":"Elimine un monton de cositas y sigue apareciendo Amumu. ¿Alguien pudo encontrar alguna solución?","replies":[]},{"poster":"Payaso camper","date":"2016-02-12T17:46:35.748+0000","up_votes":1,"down_votes":0,"body":"Yo tengo el mismo problema y no le encuentro solucion...","replies":[]},{"poster":"stebDC","date":"2016-01-27T15:53:24.699+0000","up_votes":1,"down_votes":0,"body":"Hey Jnasty9740!\n\nGracias por traer este tema a la Ayuda y Foro Atención usted! El error que usted está proporcionando parece ser increíblemente raro. Sin embargo, tan raro como lo es, se le puede impedir por completo del juego League of Legends. Debido a esto, espero que podamos encontrar una solución rápida.\n\nComúnmente, este error es a menudo causada por una auto-parche fallida del parche. Asegúrese de intentar los siguientes pasos con la esperanza de resolver este problema:\n\nLa primera y más común solución es forzar el parche a repachear sí. Usted puede hacer esto mediante la supresión de esta carpeta:\nC: \\ Riot Games \\ League of Legends \\ RADS \\ projects \\ lol_launcher\nSi elige una instalación personalizada camino, la carpeta puede estar en una ubicación diferente.\n\nMuchos jugadores también fija este problema mediante la desactivación de la UAC (Windows Vista y Win7 solamente)\nHe aquí una breve guía para deshabilitar el UAC: http://www.howtogeek.com/howto/windows-vista/disable-user-account-control-uac-the-easy-way-on-windows-vista/\n- Asegúrese de utilizar el \"Nunca me avise cuando:\" Ajuste\n\nSin embargo, si usted ha intentado estos pasos y aún experimenta este mismo mensaje de error, por favor no dude en hacérnoslo saber mediante la creación de un nuevo Ticket * para que podamos ayudarle más en un entorno de uno-a-uno en el fin de llegar a una resolución completa!\n\n* Tenga en cuenta que este consejo fue dado sobre la base de la información proporcionada. Si desea apreciar una interacción más de uno-a-uno para resolver este problema, asegúrese de enviarnos un ticket de soporte! Usted puede enviar a uno de aquí: https://support.leagueoflegends.com/tickets/new Además, si usted pudiera por favor proporcione un enlace a este hilo del foro en el nuevo billete, sería muy útil!","replies":[{"poster":"ferhintze","date":"2016-02-06T14:47:31.295+0000","up_votes":1,"down_votes":1,"body":"Hola. Hice lo que decía stebDC. Intenté las dos soluciones que propuso y no me funcionó ninguna. Ya he intentado descargar nuevamente el LOL y sigue pasando. Qué puedo hacer?","replies":[]}]}]}