{"poster":"Luftwaffles","date":"2015-09-28T15:03:34.729+0000","title":"A New 'Dodge' Option?","subforum":"Help & Support (OCE)","up_votes":2,"down_votes":0,"body":"So, as a keen player, I&#039;m Gold 4 trying to get into promos for Gold 3 so I hop online at 12:30am this morning and decide to play a game {{champion:17}} \n\nOnce I&#039;m in champ select, I notice that my chat is seemingly taking extremely long to send and receive messages, so I go to check my ping on speedtest (I know I should be using pingtest, but the difference is that pingtest tests packet loss).\n\nI see that my ping is 400 (see below image) and ask the gentlemen in my game whether to &#039;dodge&#039; or play, explaining to them my situation. They all opt for the dodge and I agree and do it. I then log back into league and discover that 25 LP was taken away from me (around 2 games worth) as well as a 30 minute wait timer. \n\n\nhttp://www.speedtest.net/result/4700560361.png\n\n\nI understand that what I did was supposedly wrong, but wouldn&#039;t it have been better that the other guys have a team member that can play and react normally, with normal ping, rather than me lagging? I suffered a big loss, in terms of waiting and having to regain that time back. \n\n**Riot, please introduce a detection system on ranked so that anyone over 200 ping cannot join the queue and affect others games, or at least introduce an opt out button that can detect to see if you are lagging and give you the option to dodge without losing any LP. **\n\n_Yours Sincerely,_\nLuftwaffles.","replies":[{"poster":"Blue Soul Slayer","date":"2015-09-29T03:55:22.950+0000","up_votes":2,"down_votes":0,"body":"They should show your ping in queue or champion select so we can dodge if the ping is too high","replies":[{"poster":"Luftwaffles","date":"2015-09-29T04:10:19.713+0000","up_votes":1,"down_votes":0,"body":"I like this","replies":[]}]},{"poster":"WhisperPan","date":"2015-09-28T15:59:13.024+0000","up_votes":2,"down_votes":0,"body":"The problem then being that a player could create artificial ping to dodge whenever they wished, which can be abused. Yeah, it sucks that you lost LP and ranked-time for doing a bad thing with intent to do good but \"no good deed goes unpunished\". The only real thing /you/ can currently do, by learning from this experience, is to test your ping before you start queuing for the day.","replies":[{"poster":"Luftwaffles","date":"2015-09-29T04:11:24.756+0000","up_votes":1,"down_votes":0,"body":"A lot of players wouldn't know how to do that, although I know some would go to that lengths. This is just basic prevention, you can never fully prevent anything from happening.","replies":[{"poster":"Blue Soul Slayer","date":"2015-09-29T04:43:09.634+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Luftwaffles,realm=OCE,application-id=ElA0rvVL,discussion-id=vybpBWko,comment-id=00000001,timestamp=2015-09-29T04:11:24.756+0000)\n>\n> A lot of players wouldn't know how to do that, although I know some would go to that lengths. This is just basic prevention, you can never fully prevent anything from happening.\n\nAnd when your ping is to high they should temporarly block Rank for you (until the ping drops low enough)","replies":[]}]}]},{"poster":"rkFbAX0web","date":"2015-09-29T12:44:47.991+0000","up_votes":1,"down_votes":0,"body":"I think alot of people have  tried to get the champ select dodge things going with alot of different approaches to it. But i think several things need to be taken into consideration is , \n\nfirst and foremost when your playing a gaming of league your expected or required to have a stable connection and so if you have high ping or normal ping in champ select what is the likely hood of you having highping or low ping in game right. \n\nSecondly the dodge button would be abused in the sense it will make it difficult to get into game, im saying like if its readily available, like a dodge button there is an increased likely hood of people using it since well its right there, people use things that are easy lol , I hope you get the general idea im trying to point out here. \n\nLastly the special privilege treatment thing where people with high ping dodge and lose no lp where as some one without high ping dodges and loses lp seems slightly unfair. The general concept behind it has good intentions but its not fairness at all. \n\nI think ideally a better option would be a vote system, where players vote to kick a potential troll or toxic player from champselect if they have a bad attitude or intend to troll in the upcoming gaming (if you think you have high ping you can ask your peers to kick you from champselect because you might have high ping in game too). I can also see this getting abused as well if you just dnt want to play with that guy, However if your kicked from champselect by your peers you dnt suffer a promo lose and you dnt lose lp but you incur a wait time potentially the same 5 min that ramps up or just 5 min flat. Potential for abuse is still there but at least this way its a win win sorta.","replies":[{"poster":"Blue Soul Slayer","date":"2015-09-30T00:23:31.279+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WoIves,realm=OCE,application-id=ElA0rvVL,discussion-id=vybpBWko,comment-id=0002,timestamp=2015-09-29T12:44:47.991+0000)\n>\n> I think alot of people have  tried to get the champ select dodge things going with alot of different approaches to it. But i think several things need to be taken into consideration is , \n> \n> first and foremost when your playing a gaming of league your expected or required to have a stable connection and so if you have high ping or normal ping in champ select what is the likely hood of you having highping or low ping in game right. \n> \n> Secondly the dodge button would be abused in the sense it will make it difficult to get into game, im saying like if its readily available, like a dodge button there is an increased likely hood of people using it since well its right there, people use things that are easy lol , I hope you get the general idea im trying to point out here. \n> \n> Lastly the special privilege treatment thing where people with high ping dodge and lose no lp where as some one without high ping dodges and loses lp seems slightly unfair. The general concept behind it has good intentions but its not fairness at all. \n> \n> I think ideally a better option would be a vote system, where players vote to kick a potential troll or toxic player from champselect if they have a bad attitude or intend to troll in the upcoming gaming (if you think you have high ping you can ask your peers to kick you from champselect because you might have high ping in game too). I can also see this getting abused as well if you just dnt want to play with that guy, However if your kicked from champselect by your peers you dnt suffer a promo lose and you dnt lose lp but you incur a wait time potentially the same 5 min that ramps up or just 5 min flat. Potential for abuse is still there but at least this way its a win win sorta.\n\nThe thing with abused doging button would be it should work like a aram reroll or a 24 hour  thing","replies":[]}]}]}