{"poster":"Hi Im Konix","date":"2016-11-08T20:11:01.662+0000","title":"[Preseason] Vorsaison und 2017 Ranked Season  Zurücksetzung des Ranges","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Hallo erstmal^^\r\n\r\nIch habe gerade das Thema &quot;So steigst du in der Saison 2017 auf&quot; auf der offiziellen League of Legends news Seite gelesen und mir kam da eine Frage auf die ich hier gerne mal stellen w&uuml;rde. Zuerstmal, ich bin schon seid ein paar Jahren dabei und wei&szlig; auch wie es eigentlich Funktioniert aber trotzdem verstehe ich diesen Textabschnitte nicht ganz:\r\n\r\n&quot;Du kannst w&auml;hrend der Vorsaison ein paar Flexi-Ranglistenspiele in der KB/im GW spielen. Allerdings werden wir die R&auml;nge zu Beginn der Saison leicht zur&uuml;cksetzen. Dennoch haben die Spiele, die du w&auml;hrend der Vorsaison spielst, einen gewissen Einfluss auf deinen Rang, den du zu Beginn der n&auml;chsten Saison erh&auml;ltst.&quot;\r\n\r\nSoweit ich es verstehe werden die R&auml;nge nat&uuml;rlich zur&uuml;ckgesetzt (So wie immer). Wenn ich jetzt aber in der Vorsaison meine 10 Placement Spiele spiele, dann erhalte ich auch einen Rang, mit dem ich climbed kann, richtig?\r\n\r\nMeine Frage ist aber nun:\r\nWas hat dieser Rang der Vorsaison mit dem endg&uuml;ltigen Rang in der Sasion 2017 zutun?\r\nWeil so wie ich den Text verstehe muss ich dann in der Sasion 2017 keine placement Spiele mehr spielen, sondern werde nur ein St&uuml;ck runtergesetzt (Irgendwie eine Division oder so).\r\nIch hoffe doch mir kann das Jemand erkl&auml;ren ;)\r\n\r\nNebelkeim71\r\n\r\n\r\nPS: Ich schreibe das hier weil ich irgendwie direkt unter dem News Beitrag keinen Kommentar verfassen kann. Es erscheint nur die Meldung das ich nicht autorisiert sei.","replies":[{"poster":"Pumá D Ace","date":"2016-11-08T22:06:14.832+0000","up_votes":2,"down_votes":0,"body":"Ganz einfach: Sagen wir jetzt mal du hast die season 6 gerade als platin 5 beendet.\ndu würdest dann durch den soft reset normalerweise gold 3 werden.\nwenn du jetzt in der pre-season spielst und viel verlierst, dann wirst du nächste season eher gold 5 eingestuft. wenn du aber viel gewinnst, dann könntest du sogar gold 1 oder so kommen, weil du deine mmr auf hohes platin gespielt hast.","replies":[]},{"poster":"SFCFlo","date":"2016-11-08T20:22:44.494+0000","up_votes":2,"down_votes":0,"body":"Die Einstufungsspiele kannst du mit Beginn der Season 7 machen.\n\nJetzt in der Preseason spielst du mit deiner jetzigen Elo weiter. Kannst die MMR im Hintergrund verbessern aber auch verschlechtern.\nDie MMR die du dann hast zu Ende der Preseason wird dann etwas zurückgesetzt und damit wirst du dann nach deinen Einstufungsspielen eingestuft.","replies":[{"poster":"Hi Im Konix","date":"2016-11-08T20:45:32.233+0000","up_votes":1,"down_votes":0,"body":"Okay, vielen Dank! Jetzt habe ich es auch verstanden","replies":[]}]},{"poster":"GMY1NG","date":"2016-11-09T22:36:47.932+0000","up_votes":1,"down_votes":0,"body":"Habe ich richtig verstanden?\nMeine MMR von letzter Season behalte ich und kann diese in der Preseason durch die Placement Matches verbessern bzw. verschlechtern?\nOder wird durch die Placement Machtes meine MMR berechnet?","replies":[{"poster":"Hi Im Konix","date":"2016-11-10T17:03:14.252+0000","up_votes":1,"down_votes":0,"body":"So wie ich es von den anderen verstehe, bist du jetzt in der Lage deine MMR zu erhöhen um in der Season 2017 besser eingestuft zu werden.","replies":[]}]},{"poster":"Crounty","date":"2016-11-08T20:54:23.190+0000","up_votes":1,"down_votes":0,"body":"Soweit ich weiß, kannst du jetzt in der Preseason Placement Spiele spielen, um so deine MMR zu beeinflussen und mit der Season 7 muss man noch einmal die Placement Matches spielen, aber die MMR, die man in der Pre Season beeinflusst hat, werden in den Season 7 Placement matches berücksichtigt.","replies":[]}]}