{"poster":"SGP Senpai Appic","date":"2015-03-03T15:17:21.471+0000","title":"Team sucht aktiven Main Mid Laner im Gold Bereich","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Moin Moin,\r\nwie oben schon erwähnt suchen wir einen aktiven Main Mid Laner im Gold Bereich.\r\nWenn ihr folgende Kriterien erfüllt dann könntet ihr bei uns richtig sein:\r\n\r\nSpielerisch:\r\n- mindestens Gold\r\n- !Main! Mid (wir wollen keinen Allrounder)\r\n- ihr solltet aktiv sein und pünktlich zum Training erscheinen\r\n- Shotcaller Qualitäten haben (ihr werdet als Mid Laner auch die Rolle des Shotcallens übernehmen)\r\n\r\n\r\nPersönlich:\r\n- Kritikfähig\r\n- ihr solltet den Ton angeben können (Shotcaller und so...)\r\n- !nicht schüchtern! (Ihr solltet Kommunikationsfähig sein und mit dem Team reden können. Ich weiß das es nicht einfach ist mit Fremden ins Gespräch zu kommen aber dies ist die wichtigste Grundlage um erfolgreich zusammen zu spielen.)\r\n- nett (#NoFlamer)\r\n- Lernbereit sein (für eine combo vielleicht auch mal ein Champion einüben)\r\n\r\n\r\nAlter ist mir relativ egal! Wichtig ist eben nur das ihr diese Qualitäten mitbringt.\r\n\r\n\r\nTrainingszeiten: \r\nTrainingszeiten werden Samstag und Sonntag stattfinden. Uhrzeit wird dann individuell ausgemacht.\r\n\r\n\r\nWenn alles passt werden wir in Zukunft auch an Turnieren teilnehmen.\r\n\r\n\r\n\r\n\r\nWenn ihr Interesse habe addet mich auf Skype: yannic.neumann1\r\n\r\n\r\nMit freundlichen Grüßen\r\nYannic \"appic\" Neumann","replies":[{"poster":"TheSchmendrick","date":"2015-03-03T15:49:22.887+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\nIch spiele gerade gold 2 und maine unter anderem lb. \nAddet mich einfach und schaut euch meine stats an.","replies":[]},{"poster":"BF Corona Mortis","date":"2015-03-03T15:34:29.218+0000","up_votes":1,"down_votes":0,"body":"Wie alt seid ihr denn?\nHätte Interesse.\nDie Trainingszeiten könnten problematisch werden, da ich bedingt durch das Studium vor Prüfungswochen etwas mitm Lernen beschäftigt sein werde.\nIn der Woche könnte ich allerdings jetzt auch mitarbeiten.","replies":[]}]}