{"poster":"Cosnirak","date":"2018-06-01T07:00:35.696+0000","title":"Pyke's Voice Is Bad","subforum":"Story, Art, & Sound","up_votes":11,"down_votes":5,"body":"The processing on his voice feels so heavy handed and unnatural. Not in a spooky sort of unnatural way, but in a &#039;this is obviously the product of a program&#039; sort of unnatural way. I&#039;m sure there are plenty who disagree, downvote and flame away if you want, but it&#039;s just so in my face and _bad_ that I felt the strong urge to give Riot this feedback.\r\n\r\nIn addition to it being acousticly awful, I feel like his VO lines range from lackluster to eye-rollingly bad. A lot of it feels like they&#039;re trying so hard to avoid certain cliche words and phrases that are associated with his themes that it actually stands out as awkward and forced. His word choice and phrasing suggest a far more well educated man than his story does. So much of it subtly says &#039;I was clearly written by someone else&#039; when it should feel natural to the character but doesn&#039;t.\r\n\r\nThere&#039;s a strong attempt to avoid making him too much like Kalista and Nautilus but he is essentially Kalista at sea. Instead of sounding like a vengeful spirit he&#039;s a disjointed mix of sailor, Jack the Ripper, and spirit. If he&#039;s not an avatar of vengeance why does he want to kill more than his old crew?\r\n\r\nAnd to top it all off he&#039;s overly calm. Why does a ghost killer hell bent on vengeance have the demeanor of a paid killer calmly stalking and catching prey? He lacks emotion (or maybe the processing is making it impossible to hear). He tells me he wants vengeance but at no point does he show it.","replies":[{"poster":"Chase Me Daddy","date":"2018-06-01T09:15:51.258+0000","up_votes":7,"down_votes":2,"body":"The Pyke in his VO is real different. This Pyke is self-aware and isn't getting revenge for himself.\n{{champion:555}} \"They said you ain't innocent.\"\n{{champion:555}} \"I got friends everywhere, especially in the depths.\"\n{{champion:555}} \"I am not the only one who wants revenge on everyone.\"\n{{champion:555}} \"Captains told me to kill fish, fish told me to kill captains, makes sense.\"\n{{champion:555}} \"Not sure who's revenge I'm getting... Don't care!\"\n{{champion:555}} \"Every kill makes the voices louder... and I looove what they're screaming.\"\nThe thing about all of this is, that the Pyke ingame feels a lot more like the man he once might have been that has been imbued with some kind of power in order to go on a mission like he was paid to do so. The one in the lore suggests a folklore like spectre that returned hateful after being swallowed whole and after the crew of the Terror, which seemingly never existed (again spooky ghost story element) died Pyke thought he was done, but from there on every time he came a across a captain he didn't go \"Your names on the list, now die\" but \"Why is his name not on the list? Why? This must be a mistake, I must've folded it wrong. YES YOU WHERE THERE!\". Pyke seemingly doesn't know himself why he's doing this, but his mind is so messed up from whatever happened to him that he's too deranged to notice that what ever revenge he's getting might not even be real.","replies":[{"poster":"FauxSchizzle","date":"2018-06-01T14:52:33.601+0000","up_votes":8,"down_votes":1,"body":"Hey! Nice ear :) You're putting together the pieces.","replies":[{"poster":"Cetri","date":"2018-06-01T15:09:48.357+0000","up_votes":1,"down_votes":1,"body":"Damn. Now I'm wondering if Pyke is something like, the antithesis of Ivern. Whereas the Greenfather was reborn to become an incarnation of nature's wonder, its bounties and harmony, was Pyke resurrected to become an avatar of vengeance against those who would exploit it?","replies":[{"poster":"FauxSchizzle","date":"2018-06-01T16:15:56.042+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Cetri,realm=NA,application-id=6kFXY1kR,discussion-id=xNLGXAQQ,comment-id=000000000000,timestamp=2018-06-01T15:09:48.357+0000)\n>\n> Damn. Now I&#x27;m wondering if Pyke is something like, the antithesis of Ivern. Whereas the Greenfather was reborn to become an incarnation of nature&#x27;s wonder, its bounties and harmony, was Pyke resurrected to become an avatar of vengeance against those who would exploit it?\n\nI would say you're on to something.","replies":[{"poster":"IcyPepper","date":"2018-06-01T17:26:47.195+0000","up_votes":2,"down_votes":2,"body":"Hire him","replies":[]}]}]}]},{"poster":"AnataBakka","date":"2018-06-02T12:41:29.646+0000","up_votes":1,"down_votes":0,"body":"\"My mind ain't all my own these days.\"\n\"My new bosses don't care about gold.\"","replies":[]}]},{"poster":"FauxSchizzle","date":"2018-06-01T16:18:44.457+0000","up_votes":6,"down_votes":1,"body":"Thanks for taking time to share your feedback! As Pyke's writer, I'd say that a lot of your criticisms were intentional choices in delivery and writing... there is a reason for a good chunk of the BLoodharbor Ripper's psychosis. I respect that it didn't resonate with you, and hope our next offerings make you happier. \n\nTBH, we were way more afraid of Kalista overlap than Nautilus (boy did I underestimate that).","replies":[{"poster":"Cosnirak","date":"2018-06-01T19:13:29.717+0000","up_votes":3,"down_votes":0,"body":"I appreciate the response! I feel that there's a lot I don't like about Pyke's VO that isn't just a matter of taste. I'll try to articulate some of it as constructively as I can, but honestly everything I try to say about it makes me feel like I'm being an asshole, sorry if it comes across really harsh.\n\nI wish I had any idea why Pyke has the psychosis he does besides \"he is possessed.\" I haven't read/listened to Pyke's story stuff yet (besides the trailer video) but with Jhin I felt like I understood him as a character fairly well even before reading his story just due to the trailers & VO so it's weird to feel lost in that regard with Pyke.\n\nMostly my problem is that he sounds fake. It's like when you hear an overly autotuned song, except with Pyke it's the same short watery sound repeated and layered over everything plus the more direct voice processing. His voice is so garbled by it that it's often very difficult and sometimes downright impossible to understand what he's saying. It doesn't help that it sounds so similar to his abilities, but even with his voice alone turned all the way up while wearing headphones I have no idea what he's saying for a couple lines. I think it would work a lot better if the water sounds were carefully placed at the right times to accentuate his lines with a lighter processing over everything to maintain the revenant feel.\n\nCaptains are the only thing that seem to bring any strong emotion out of him. The rest feels like he's some boring jerk possessed by a boring spirit who has a desire to kill everything not of the ocean, eventually, when it gets around to it, but it's not a big deal. Why even send some drowned guy back to kill a few random people here and there if the ocean is going to be \"on top\" eventually anyways? Why doesn't he care about anything but captains?\n\nOh well, I honestly have far bigger beef with his gameplay than his VO. Because League really needed another dashing, stealthing, assassin in the roster...\n{{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"Chromatic Eagle","date":"2018-06-01T17:33:45.557+0000","up_votes":3,"down_votes":1,"body":"Eh. Kalista is more like a deity of vengeance to me. She almost lost all sense of herself. Pyke is doing this for personal reasons that he can barely remember, targeting anyone.","replies":[{"poster":"Ultîma","date":"2018-06-01T18:27:18.303+0000","up_votes":2,"down_votes":1,"body":"Agree with you there, I feel like Kalista is more like a force of nature driven by the curse of the Shadow Isles rather than a revenant out to kill those who wronged him. There's a sense of honour in how Kalista accepts the soul-pact of the betrayed and avenges them, whereas Pyke is entirely driven by his own vengeance.","replies":[]}]}]},{"poster":"Ampson","date":"2018-06-01T17:23:59.430+0000","up_votes":5,"down_votes":1,"body":"Hey, Cosnirak! \n\nThanks for sharing your feedback on Pyke's VO processing! I am his sound designer and my goal was to try to capture what a dead man's shredded vocal chords that are perpetually wet would sound like. A little bit aquatic/amphibious, a little bit extreme vocal fry. When you play him in a match, you'll also hear faint sounds of underwater bubbles to help tie in the drowned fantasy. Of course, your aural perception of him will sound different between playing him in-game vs. listening to him on a YouTube video. We focus on how our Champions will sound in-game. Thanks for your honest feedback and we hope to give you something else to delight your ears! :)","replies":[{"poster":"Ultîma","date":"2018-06-01T18:24:51.810+0000","up_votes":4,"down_votes":0,"body":"May I suggest something if you do an effect like this in the future? Camille's VO particularely stands out to me as being excellent due to how it changes from a normal, posh woman to something _else_ mid sentence. The transition from normal to robotic is quite stark and really accentuates those bits, whereas Pyke is - as the OP pointed out - always speaking through a filter. I think in this particular case some variance where you could hear the man Pyke once was vs. his true nature as the Ripper would've been very intense and intimidating and given players a clearer indication that Pyke's drowning or speaking through shredded vocal cords as you suggested. \n\nGood job regardless, he's suitably creepy.","replies":[]},{"poster":"Cosnirak","date":"2018-06-01T19:36:21.325+0000","up_votes":3,"down_votes":0,"body":"I had a feeling his garbbledness was intended, not just as being watery but as you said, due to being torn up. I think the problem is that it doesn't sound realistic. It's just too constant. His voice doesn't change. It never catches as his throat happens to open or close in some awful way it couldn't if he were still alive. It's just the same throughout, making it feel very fake. It reminds me of the Project: Jhin processing when it first went up on the PBE. There was too much processing and not enough Jhin left, which luckily was changed.\n\nImagine if Pyke's voice broke mid word and he had to stop and maybe even clear his throat (making some eerily inhuman noise) before starting again. Though something that elaborate I'm guessing is beyond your control as it would require it to be set up before hand in the writing process.\n\nAlso the effects are _really_ strong. Certain words are essentially impossible to understand because of how much they overlap with the water sounds and processing.\n\nThanks for the response! Sorry to have so much negative stuff to say about this. I do really like the sounds on his E and especially his Q, it's very satisfying.","replies":[]},{"poster":"KeeIhaul","date":"2019-01-10T22:22:03.388+0000","up_votes":1,"down_votes":0,"body":"I know this is 7 months later but I wanted to say that I thought you did a great job! I love Pyke and everything about playing him makes me feel more immersed in league than any other champion (kindred is a close 2nd, not so much game play but VO.)\n\nWould you be willing to share any techniques you used for creating his voice and I would love to try to re-create it to make custom alerts and whatnot for my stream!","replies":[]}]},{"poster":"Camille Ferrøs","date":"2018-06-01T12:41:14.708+0000","up_votes":4,"down_votes":0,"body":"His voice doesn't sound like he died and a giant sea monster's mouth then with some magic to be resurrected . He sounds like a normal guy that uses a cool voice changer. Not a person that has gone trough some deep deep shi,","replies":[]}]}