{"poster":"better off dying","date":"2019-09-21T16:27:34.106+0000","title":"Honor LV für Belohnungen?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hey Leute,\r\n\r\nkann mir jemand sagen welche Honor-Stufe ich brnötige um Icon etc zu bekommen?\r\n\r\nIch war all die Jahre die ich League spiele nicht Toxic und hab mir jetzt aber doch kurz vor Seasonende eine 10 Game chat restriction eingefangen.\r\nMit Honor 1 werde ich keine Belohnungen bekommen? Mit Honor 0 warscheinlich auch nicht? \r\n\r\nIch hoffe mir kann jemand weiterhelfen :)","replies":[{"poster":"Tickle My Donger","date":"2019-09-21T16:59:14.350+0000","up_votes":1,"down_votes":0,"body":"QQ {{sticker:sg-janna}}","replies":[]},{"poster":"legofreak1","date":"2019-09-21T16:31:33.646+0000","up_votes":1,"down_votes":0,"body":"Wahrscheinlich wird die Beschränkung wie schon letztes Jahr bei einer Ehrungsstufe von mindestens 2 liegen. Wenn du drunter bist, gibt es wahrscheinlich keine Belohnungen.","replies":[{"poster":"better off dying","date":"2019-09-21T16:33:00.433+0000","up_votes":1,"down_votes":0,"body":"Auch wenn ich die ganze Season lang über Honor 2 war und jetzt nen Monat vor Seasonende auf honor 1 dropped bin?...","replies":[{"poster":"Angel Ayume","date":"2019-09-21T16:38:15.613+0000","up_votes":1,"down_votes":0,"body":"Ja","replies":[{"poster":"better off dying","date":"2019-09-21T16:40:42.786+0000","up_votes":1,"down_votes":0,"body":"Klingt ziemlich BS meiner Meinung nach, aber ist halt Rito nh. Da wundert man sich wieso jeder smurft. Werd ich jetzt auch noch tun :)","replies":[{"poster":"Angel Ayume","date":"2019-09-21T16:42:29.881+0000","up_votes":1,"down_votes":0,"body":"Wenn du 60 Jahre lang ein braver Mensch warst, dir nichts hast zuschulden kommen lassen und dann doch mal einen Menschen umbringst, wirste doch auch bestraft. \nKrasses Beispiel, aber vom Prinzip her gleich. ^^","replies":[{"poster":"better off dying","date":"2019-09-21T16:45:07.911+0000","up_votes":1,"down_votes":0,"body":"True that nur leider auf ein Online-Game nicht übertragbar","replies":[{"poster":"legofreak1","date":"2019-09-21T16:54:21.051+0000","up_votes":1,"down_votes":0,"body":"Wieso nicht? Hier gibt es zwar keine Gesetze im rechtlichen Sinne, dafür aber die Nutzungsbedingungen, welche allen Spielern gewisse Regeln auferlegt. Eine davon ist - stark vereinfacht - \"Sei kein Arsch\". Nur weil du dich hier im Internet aufhältst, darfst du die Regeln eines guten Miteinanders nicht missachten. Und wenn du es dann doch tust, musst du mit den Konsequenzen entsprechend leben.","replies":[]},{"poster":"Angel Ayume","date":"2019-09-21T16:58:11.556+0000","up_votes":1,"down_votes":0,"body":"Das Prinzip bleibt aber das gleiche. \nRiot lässt Spieler sogar viel durchgehen, wenn sie nicht gleich irgendwas schreiben, was unter Hatespeech fällt. \nDu wirst ja nicht für eine einmalige Sache bestraft. \nDu wirst bestraft, wenn du dich immer und immer wieder daneben benimmst und zurecht reportet wirst. \n\nLetztes Jahr haben die Spieler, die kurz vor Seasonende noch eine 10 und 25 Games CR bekommen haben die Möglichkeit gehabt, bis Februar des darauffolgenden Jahres noch Honorlevel 2 zu erreichen, dann haben sie die Belohnungen dennoch bekommen. \nAber ich glaube das war wirklich nur für die, die wirklich ganz kurz vor Seasonende, 2 Wochen oder sowas, bestraft wurden. Du fällst da denk ich nicht drunter.","replies":[]}]}]}]}]}]}]}]}