{"poster":"mrchipopo","date":"2018-01-11T17:34:19.823+0000","title":"This patch was hilariously dissapointing","subforum":"Gameplay","up_votes":95,"down_votes":15,"body":"Preseason rune changes pushed this game so much farther in the wrong direction. Everyone was given too much damage, and resistances were nerfed into oblivion. The result is that this game played more like a sudden death match in super smash brothers than it did a tactical moba game. \r\n\r\nI was looking forward to the first patch after the holidays, knowing that riot had over a month to find solutions to the mess of preseason. What did we get instead? Heimerdinger nerfs.....\r\n\r\nIt is apparent that Riot&#039;s vision for this game is a fast-paced, non-tactical, fighter game dressed in a moba skin. I wish Riot would clarify this so I could know for sure what their vision was. I hate staying invested in a game only to find out they want to make the game everything I hate about it. \r\n\r\nIf Riot sees this and cares, could we get some clarification on what the vision of this season and the future of league of legends actually is? This would help quell the comments that you don&#039;t know what you&#039;re doing, if you&#039;re actually doing exactly what you intend on doing to this game.","replies":[{"poster":"WiegrafOfValor","date":"2018-01-11T21:45:38.445+0000","up_votes":40,"down_votes":2,"body":"I wish GC just make an announcement saying exactly what their vision and plan is for LOL in the future, either is admitting they mess up and wasn't their intention to make this snowball 1 hit KO mess we are having or saying that's the future they want for LOL.\n\nBecause if that's their vision, I'm afraid this game isn't for me anymore.","replies":[{"poster":"freeloader25","date":"2018-01-12T12:56:16.881+0000","up_votes":18,"down_votes":3,"body":"> Because if that's their vision, I'm afraid this game isn't for me anymore.\n\nThat's the reason why riot doesnt communicate such things with us. They know exactly that a lot of people would just straight up quit the game if they made their vision public, so they try to  keep the veteran playerbase from leaving as long as possible by not making any real statement.\n\nAt this point many veteran players only continue to play because they still have hope that things will get better anytime soon.","replies":[{"poster":"WiegrafOfValor","date":"2018-01-12T15:17:29.014+0000","up_votes":8,"down_votes":1,"body":"> [{quoted}](name=freeloader25,realm=EUW,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=00010001,timestamp=2018-01-12T12:56:16.881+0000)\n> \n> At this point many veteran players only continue to play because they still have hope that things will get better anytime soon.\n\nThat's me alright.","replies":[]}]},{"poster":"T4underbolt","date":"2018-01-12T06:58:40.310+0000","up_votes":11,"down_votes":9,"body":"Dude. Ghostcrawler plan is simple. Look at wow and you have the answer. Change lol into casual fiesta, so new/bad/young players can oneshot enemy without doing much etc. This is why dmg creep was inceasing. People who saw wow fall see that the same scope of changes is being applied since gc joined riot.","replies":[{"poster":"Faceroll Tactics","date":"2018-01-12T13:36:17.120+0000","up_votes":7,"down_votes":3,"body":"GC actually changed the game to favor Hunters, Mages, etc. while making melee the definition of unfun.\n\nSo yea, that’s what is happening now.","replies":[{"poster":"SzGamer227","date":"2018-01-12T19:54:25.071+0000","up_votes":3,"down_votes":1,"body":"Riot nerfs Heimerdinger, the #1 champion for shitting on melees, after 2 patches of buffing underwhelming top lane and jungle melee fighters/bruisers, and you honestly think that Riot is systematically trying to make melee champions unfun?","replies":[]}]}]}]},{"poster":"Riot MapleNectar","date":"2018-01-12T19:30:57.732+0000","up_votes":38,"down_votes":7,"body":"Yeh... the timing of 8.1 was a bit confusing and probably set expectations a bit too high for players. Meddler tried to address it in his quick gameplay thoughts - but that particular section didn't get much visibility. The 8.1 patch actually \"locked\" before Christmas, and was worked on at the same time as 7.24b. We usually would have put more time into the 8.1 patch, but were focused instead on getting some short term wins for top lane and a few other notable areas around the map into 7.24b. To clarify - 7.24b wasn't meant to \"solve\" top lane, or the rest of the game for that matter, but it felt like there was enough low hanging fruit that getting an additional patch out before Christmas was the right way to go, rather than have a 5 week break between 7.24 and 8.1\n\nAt any rate, what this meant for 8.1 was that there was less content than usual, while players were probably looking to it to start hitting on some of the problems that they were feeling - which unfortunately wasn't the case. We have a pretty substantial number of changes going into 8.2 (some have started to hit the PBE), some are still in exploration like a number of new runes/tweaks to current ones. \n\nTo provide a super high level summary of what our direction for League is - since what you're asking is a super deep question, is to get the game to a point where you feel like you're constantly presented with the opportunity to make nuanced decisions that can help you win a game of League. Whether that's what champion you take, what runes you go with, what items you buy, how you rotate around the map etc etc. It was a large part of why we redid runes and masteries as a system in the first place, the old system provided important decisions, but they weren't particularly meaningful, and very rarely did they ever change (I'm not talking about switching between taking scaling hp vs armor yellows). We have a long way to go yet for runes to be as flexible as we want, but we have a lot of internal focus on adjusting current runes and creating new ones to get it there over the long run. In regards to more in game positions we're also doing some deeper vision/direction setting for where we want to take every position going into the new year and beyond. We're also looking at things like broadening the number of positions a champion can be considered in that are also sustainable to help feed into the idea of being faced with nuanced decision making. Morgana and Zyra could be looked at as the first real foray into this space. While we didn't quite nail it yet, we wanted players to be able to think about taking them in the jungle if they wanted to for a variety of reasons. \n\nI would argue that one of the things (and please let me stress the ONE in that statement) that may feed into your perception of the game feeling less tactical, is the fact that the relative skill level of players and their mastery over League seems to be accelerating. When you look at how teams tend to play around the bot side of the map and look to gain a lead from diving a turret with a jungler, or having mid roam down and flank for a 4v2 which then turns into an objective/s. In prior years, if bot turret went down, you'd typically see the adc and support back, buy items, and then head right back down their lane. These days, players have caught onto the idea of rotating that power around the map, moving their top laner to bot, and then taking the top turret further accelerating their lead (this is just one example). As more and more players learn what optimal strategy/tactics they should employ in a game when they want to win, games can feel less tactical/strategic as they become more par for the course. This is a huge reason why we update the game every two weeks, since if left untouched, the game would become more and more about optimizing one or two strategies that are proven to work which would then very quickly become stale.\n\nIn regards to the comment about fast paced games, I don't have too much for you atm, but we're doing a lot of investigation into general game pacing, game length, bloodiness etc, to find areas where we can tune back some of the more egregious experiences, but I will definitively say that we're not looking at making the average game 45 minutes (right now average game length is 30.5 minutes +/- ~2 minutes based on mmr range and region). The primary things we need to make sure to maintain are the rough lengths of various phases of the game - aka lane phase shouldn't be over at something silly like 4 minutes, you shouldn't be able to close out the game at 15 minutes on one team fight etc. \n\nThat got more wordy than I intended - please keep in mind this is my personal attempt at summarizing thoughts from a variety of teams though I hope it provides a bit more insight/context.\n\nEdit: Oh, and about the Heimer nerf - ask any melee top laner or jungler who's tried to gank a Heimer and you'll probably find their opinion quite different regarding the nerf. ","replies":[{"poster":"Ahristocats","date":"2018-01-12T20:13:22.222+0000","up_votes":28,"down_votes":8,"body":"> [{quoted}](name=Maple Nectar,realm=NA,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=000d,timestamp=2018-01-12T19:30:57.732+0000)\n>\n>\n> Our direction in league is to get the game to a point where you feel like you&#x27;re constantly presented **with the opportunity to make nuanced decisions** that can help you win a game of League\n\n\nhttp://p.fod4.com/p/media/5c597eb60b/uF9MjJo3QIaijySXC4iL_Confused%20Christian%20Bale.gif\n\nspamming comet with Sion/malphite/camille/olaf\nspamming RNG klepto with nasus/gp/illaoi \n\nWhat \"nuanced\" decisions are there here?\n\ntop lane once used to have nuanced decisions\nthis top lane i used to love in season 3 where a billion of calculations were needed to win lane is no more\n\npreseason ruined top lane, with comet and klepto, and more precisely the sorcery tree\n\nany non-tank champions who cannot use sorcery or klepto got destroyed\ndarius is shit\n\nwhat nuanced decision is there in that? i don't recall anything like that\nis it ornn that misses 2 abilities and still kill you with bramble vest if you're aatrox/darius/renekton?\n\n> [{quoted}](name=Maple Nectar,realm=NA,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=000d,timestamp=2018-01-12T19:30:57.732+0000)\n>\n> Whether that&#x27;s what champion you take, what runes you go with, what items you buy, **how you rotate around the map** etc etc. It was >a large part of why we redid runes and masteries as a system in the first place, \n\n\nthat got ruined too\ngames end in 15 or 20 mins\nlaning phase that requiered skill before finishes in few minutes\ntowers give in few minutes, they die in like one minion wave post lvl 6\nbaron can be taken down by 5 supports when it spawns\nthings that were risky before are no longer, rotations do not take skill\nyou take one tower, then go to an other tower, then go to an other tower\nwhen baron spawns if you snowballed you can just rofltstomp it and rush to victory\n\nasyrite\nthe\ngame\nno\nlonger\ntakes\nas much decisions as you think it does\n\nand that because things became much more simpler than before, baron being taken down at 20 min while providing 70% damage reductions to creep makes the game way easier to take in hands\n\nnow this might has been intentional\nthat riot wanted games to end quicker, ect...\nbut all i'm saying is that it reduced the \"nuanced decisions\" by a visible amount\n> [{quoted}](name=Maple Nectar,realm=NA,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=000d,timestamp=2018-01-12T19:30:57.732+0000)\n>\n> \n> I would argue that one of the things (and please let me stress the ONE in that statement) that may feed into your perception of the game feeling less tactical, is the fact that the relative skill level of players and their mastery over League seems to be accelerating. When you look at how teams tend to play around the bot side of the map and look to gain a lead from diving a turret with a jungler, or having mid roam down and flank for a 4v2 which then turns into an objective/s. In prior years, if bot turret went down, you&#x27;d typically see the adc and support back, buy items, and then head right back down their lane.\n\n\nLol no that's not even close to being true\n\nIn previous years if bot turret went down, you saw the adc and support coming back to lane if they thought that they couldn't take adventage of mid/top\nBut now since towers fall in 1 minion wave there is no way the midlaner/toplaner wins time for the adc to AFK farm bot lane\n\nhttps://www.youtube.com/watch?v=o37diDb-4RM\n\nin this game for instance, bot lane fell at 20 min and IMMEDIATLY corki+sona went mid/top to try to apply pressure\nbecause CLG EU didn't have anivia to turtle and took karthus who couldn't really waveclear\nin other games you saw bot lane staying bot because it was pointless to go mid vs anivia\n\nNow you might tell me \"this was pro and people learned from pros\" but this is untrue too\nBecause it happened everywhere\n\nhttps://youtu.be/RXvkHlm_Cx4?t=970\n\nThis for instance is a solo queue where bot lane went mid after the 2 bot lane towers fell\nBut do you see an incredible snowballing?\nDo you see a team pushing with a minion wave and killing a tower with redbuff/demolish/riftheralf? and spawnkilling nashor?\n\n\nLeague accerelated because of:\n-powercreep, champions are able to deal too much damage and win easily\n-towers got nerfed and are paper now\n-red buff applies on tower, for real?\n-baron is a joke, gets taken down too easily for such a high reward\n\n\n> [{quoted}](name=Maple Nectar,realm=NA,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=000d,timestamp=2018-01-12T19:30:57.732+0000)\n>\n >\n> but I will definitively say that we&#x27;re not looking at making the average game 45 minutes (right now average game length is 30.5 minutes +/- ~2 minutes based on mmr range and region). \n\nthen please do not point out that league direction is \"nuanced decisions\" because **to old players this hurt SO MUCH**\n> [{quoted}](name=Maple Nectar,realm=NA,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=000d,timestamp=2018-01-12T19:30:57.732+0000)\n>\n>The primary things we need to make sure to maintain are the rough lengths of various phases of the game - aka lane phase shouldn&#x27;t >be over at something silly like 4 minutes, \n\ni'm waiting for you to fixe it then because this is currently happening\nlaning phase ends at 7 min nearly in my games\n\nand if you think i'm not serious, just ask me and i will look at my replay and send to you specially games where towers fall at 7 min\n\ndue to demolish\nred buff applying on tower\nand many things\n\n\n> [{quoted}](name=Maple Nectar,realm=NA,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=000d,timestamp=2018-01-12T19:30:57.732+0000)\n>\n> \n> Edit: Oh, and about the Heimer nerf - ask any melee top laner or jungler who&#x27;s tried to gank a Heimer and you&#x27;ll probably find their opinion quite different regarding the nerf.\n\ni asked DanXD and he said heimer was shit\nBut it doesn't matter\nBecause anecdotes should not be used to balance a game","replies":[{"poster":"Sun Wu Ryuumoku","date":"2018-01-12T21:01:12.094+0000","up_votes":1,"down_votes":3,"body":"> \n> spamming comet with Sion/malphite/camille/olaf\n> spamming RNG klepto with nasus/gp/illaoi \n> \n> What &quot;nuanced&quot; decisions are there here?\n> \n> top lane once used to have nuanced decisions\n> this top lane i used to love in season 3 where a billion of calculations were needed to win lane is no more\n> \n> preseason ruined top lane, with comet and klepto, and more precisely the sorcery tree\n> \n> any non-tank champions who cannot use sorcery or klepto got destroyed\n> darius is shit\n\n\nToplane isn't even revelant anyway ...\n\n\n>because\nwe all know\nthat anecdotes are good to balance a game\n\n\n\ni still think its not an anecdotes...  i mean before 7.24b, heimer top was very popular... at least at mid plat (or i was f*cking unlucky). And yeah he's right, heimer deserved a nerf. And if i recall u made thread a few month ago about fairness of matchup melee vs heimer (u pointed how riot f*cked his \"rework goal\").","replies":[{"poster":"Ahristocats","date":"2018-01-12T21:04:55.097+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Ryuumoku no koke,realm=EUW,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=000d00090000,timestamp=2018-01-12T21:01:12.094+0000)\n>\n> \n> \n> i still think its not an anecdotes...  i mean before 7.24b, heimer top was very popular... at least at mid plat (or i was f*cking unlucky). And yeah he&#x27;s right, heimer deserved a nerf. And if i recall u made thread a few month ago about fairness of matchup melee vs heimer (u pointed how riot f*cked his &quot;rework goal&quot;).\n\ni don't know if heimer was op or not, i never saw him above d1\n\nBut i know that you do not know if a champion is op or not by asking a top lane player\ni asked DanXD and he told me he was shit\nthis is what an anecdote is, you cannot know the strength of a champion by randomly ask players","replies":[{"poster":"Sun Wu Ryuumoku","date":"2018-01-12T21:15:39.207+0000","up_votes":3,"down_votes":1,"body":">i don't know if heimer was op or not, i never saw him above d1\n\ni didn't used the word op.\n\ni think DanXD can be a bit biased... cause he play a half range {{champion:126}} (can write range alone IMO). \n\nBut i agree more or less with ur main point (we can't ask randomly players... mainly on this board).","replies":[]}]}]}]},{"poster":"Nefas","date":"2018-01-12T19:39:26.151+0000","up_votes":17,"down_votes":1,"body":"Expectations were higher imo because Riot made a big deal about having a longer preseason to sort out problems. Problems don’t feel sorted out and now Riot goes and makes a big support itemization change to start off the regular season.","replies":[]},{"poster":"Jayce ADC","date":"2018-01-12T19:34:08.528+0000","up_votes":18,"down_votes":3,"body":"As a top laner, I always loved having heim just ult me and instantly killing me when i had maw and mercs. Why nerf it?\n\n/s\n\nThanks for nerfing him","replies":[{"poster":"Shahamut","date":"2018-01-13T04:18:42.097+0000","up_votes":1,"down_votes":0,"body":"I'm still a fan of not getting to farm because I'm always under turret XD and walking around in there is risk for being stunned, beamed and rocketed. All the while the Heimmer just dances and flashes \"mastery\" for hitting 1 out of 20 skill shots and nearly killing me for it...","replies":[{"poster":"VexingRaven","date":"2018-01-13T08:16:14.016+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Shahamut,realm=NA,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=000d00010000,timestamp=2018-01-13T04:18:42.097+0000)\n>\n> hitting 1 out of 20 skill shots and nearly killing me for it...\n\nBlitz? Zoe?","replies":[{"poster":"CHODES AND LOADS","date":"2018-01-13T08:21:35.351+0000","up_votes":6,"down_votes":0,"body":"80% of the reasonably viable roster right now tbf. if i get a stun as taric, u gonna get demolished. if i land a pull as blitz; if vane pins u; if i q+auto u with teemo, etc. the game is just burst city. played a match a day or 2 ago where lee dealt 740 damage to me with his q alone at lv 13, and another with talon hitting me for 800+.\n\npeople pointing out heimer like hes some exception is laughable, when half the champs in the game do the same thing and theres a huge selection of even worse offenders.","replies":[]}]}]}]},{"poster":"AMYS GRAVE","date":"2018-01-12T20:13:06.767+0000","up_votes":12,"down_votes":0,"body":"> In prior years, if bot turret went down, you'd typically see the adc and support back, buy items, and then head right back down their lane.\n\nWell, yeah, back in those days freezing a wave was still possible, and was used to deny the enemy a stream of gold. There was a decision there to sacrifice tempo for value. Now minions auto push so that strategy isn't viable and everyone is forced to make the tempo play and end quickly. We are rotating around the map because the alternative strategy was removed as an option. \n\nEarly lane swaps? First turret gold and removal of bot lane resistances removed that as an option. AP off meta fun builds? Removed their AP scaling. Stalling for late game? Lots of turret destruction and snowballing mechanics added to the game. None of these strategies/playstyles were inherently wrong, just ones you didn't want to support. You've spent years systematically removing strategies and experimentation options so, yeah, we all rotate around the map with our meta builds now because its how we've been told to play the game, and other experimentation isn't playing the game correctly.","replies":[{"poster":"Trollmanship","date":"2018-01-13T11:51:16.757+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=sixdogman,realm=NA,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=000d0008,timestamp=2018-01-12T20:13:06.767+0000)\n>\n> Well, yeah, back in those days freezing a wave was still possible, and was used to deny the enemy a stream of gold. There was a decision there to sacrifice tempo for value. Now minions auto push so that strategy isn&#x27;t viable and everyone is forced to make the tempo play and end quickly. We are rotating around the map because the alternative strategy was removed as an option. \n> \n> Early lane swaps? First turret gold and removal of bot lane resistances removed that as an option. AP off meta fun builds? Removed their AP scaling. Stalling for late game? Lots of turret destruction and snowballing mechanics added to the game. None of these strategies/playstyles were inherently wrong, just ones you didn&#x27;t want to support. You&#x27;ve spent years systematically removing strategies and experimentation options so, yeah, we all rotate around the map with our meta builds now because its how we&#x27;ve been told to play the game, and other experimentation isn&#x27;t playing the game correctly.\n\n1000000% accurate post.","replies":[]}]},{"poster":"Lil Homie busta","date":"2018-01-12T22:51:13.518+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Maple Nectar,realm=NA,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=000d,timestamp=2018-01-12T19:30:57.732+0000)\n>\n> To provide a super high level summary of what our direction for League is - since what you&#x27;re asking is a super deep question, is to get the game to a point where you feel like you&#x27;re constantly presented with the opportunity to make nuanced decisions that can help you win a game of League. Whether that&#x27;s what champion you take, what runes you go with, what items you buy, how you rotate around the map etc etc.\n\nThat's great, because whenever i pick Darius, Yasuo, Wukong, Irelia, Garen, Kled on toplane i fell like i can go 6 mobility boots + guardian rune and still have the same impact on my game's result as building optimally, with exception of feeding to make it harder. That's a great presence of opportunity to impact a game's win or defeat /s.","replies":[]},{"poster":"Spoofghoul","date":"2018-01-13T12:12:28.309+0000","up_votes":4,"down_votes":0,"body":"Personally think 45 minutes average is a good game length\n\nTrying so hard to get it short is what leads to these annoying meta's where small leads become certain victories instantly no matter what you do that is how it will end up \n\nand while fine for the casual player, you know that player who just as easily abandons the game in favor of something new and shiny \n\nIt's absolute dogshit for more dedicated players and more competitive players, you know those who stick around even in rough times, i'm afraid that if this trend continues you will lose many of them\n\nBecause lets be honest here nobody likes being held hostage in games which are won by 10 minutes or decided by 1 fight at the 20 minute mark\nThe casual doesn't care he can play another game and wins and feels good about himself \n\nBut losing before the 10 minute mark because someone did something dumb and there is no real way of making a comeback makes the game totally stale from a competitive standpoint i can't imagine this being a good thing for e sports\n\nOr for more dedicated players who play more games because they will all be one sided stomps and that get's stale fast","replies":[]},{"poster":"Shahamut","date":"2018-01-13T04:35:16.001+0000","up_votes":3,"down_votes":0,"body":"I think crit and the entire item system need a long term look over.  As a top lane main, and as someone who enjoys melee bruisers/ early game champs like Renekton, I find it particularly frustrating that if I can manage to outplay/bully/beat my lane opponent, and even take first tower, if I don't come out of that lane 6/0 in 10 minutes,  my time to shine is over, because a decently farmed adc will already be hitting their power spikes, basically getting rid of the \"mid game\" or reducing it to a mere few minutes. \n\nWith all the attention supports have gotten recently (and are now getting a free 800g effectively) the duo lane is scaling super fast and super hard. They are getting more gold and generally have cheaper items than everyone else. This, in my opinion, is the biggest reason for games feeling too fast. \"FEELING\" too fast, because the people who scale the hardest are arguably also scaling the fastest. Just my two cents on it.","replies":[]},{"poster":"Snaketits","date":"2018-01-12T22:02:35.507+0000","up_votes":3,"down_votes":0,"body":"I'm not returning to this game until you finally get rid of this toxic snowballing meta. Matches literally are decided after 12-15 minutes with the remaining 10 minutes leading to an invetable loss. The gold difference in each game is beyond insane (15-20k on average), there's simply no coming back anymore. If the surrender vote fails at 15, you'll be stuck wasting 10 minutes on an unwinnable game which makes playing League an *extremely* frustrating experience.\n\nAnd that's just scraping the surface of the problem, there are still at least 30 champions in dire need of nerfs who are sitting at a 53%+ winrate. And yet you're not even trying to address their broken state.","replies":[]},{"poster":"T4underbolt","date":"2018-01-12T21:56:14.008+0000","up_votes":3,"down_votes":0,"body":"People play around botlane cause its the only viable lane. There are no different decisions either. You pick twitch or vayne bot (eventually tristana or klepto ez) and same runes and builds. You get 2 items you oneshot enemies. Usually its team who gets fb tower on bot. People asking for twitch nerfs whole season. Where is your \"we listen to feedback\". How is it healthy to get oblidarated in 3 seconds by twitch with bloodrazor and runnans only and 6/3 score in qt minutes (90 ad) wtf. You nerf ezreal instead of fixing his q interaction with klepto but nothing is done to twitch.","replies":[]},{"poster":"Darkeus","date":"2018-01-12T19:52:57.181+0000","up_votes":3,"down_votes":0,"body":"I just fear you have made TOO MANY changes that were not fully baked. I don't want to say not thought out all the way but I do think some impacts were not considered, especially with the new Runes. You are right, there is MUCH work to be done on them. Right now there is no variety in builds.\n\nYou take one thing and that is it. What difference is that from the old runes? I just don't think the new system has changed diversity of builds, just over tuned damage and introduced some RNG while reducing resistances and armor. \n\nI love League, but this is not that fun guys. And the Support changes? i am really skeptical, especially with the state the game is in now. Just looks like another thing to break the game. Mage Supports? Oh they are going to love being able to build more AP.\n\nI guess it might help Sona, which kind of makes me happy but overall, game is suffering.\n\nAs for game length, I feel 30 minute averages is about five minutes too short. Just my opinion though. \n\nBut good luck guys. I love the game so I hope you guys can fix this.","replies":[]},{"poster":"TsunamiSS","date":"2018-01-12T19:48:26.557+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Maple Nectar,realm=NA,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=000d,timestamp=2018-01-12T19:30:57.732+0000)\n> \n> In regards to the comment about fast paced games, I don&#x27;t have too much for you atm, but we&#x27;re doing a lot of investigation into general game pacing, game length, bloodiness etc, to find areas where we can tune back some of the more egregious experiences, but I will definitively say that we&#x27;re not looking at making the average game 45 minutes (right now average game length is 30.5 minutes +/- ~2 minutes based on mmr range and region). The primary things we need to make sure to maintain are the rough lengths of various phases of the game - aka lane phase shouldn&#x27;t be over at something silly like 4 minutes, you shouldn&#x27;t be able to close out the game at 15 minutes on one team fight etc. \n> \n\nI've seen Meddler cite something similar as well with regards to average game length. Whereas the average game length over a large sample size is 30.5 minutes and may look healthy, I think it is a bit misleading. Most of the complaints on the boards and from the playerbase in general is that games are effectively decided _much earlier_ than 30.5 minutes into the game with the remainder being necessary fodder (e.g., people wanting to farm buffs, not adequately siegeing turrets, or otherwise not realizing they can close the game out). But that statement is inherently problematic; how do you quantify it? It seems like you guys are looking at the right indicators (i.e., laning phase is the specific example given above). Would it help to look at kill / gold distribution at say 5 minutes, 10 minutes, 15 minutes? The point being, that after a certain amount of gold / kill differential, the game is ostensibly not winnable in most scenarios absent a massive throw given the higher damage outputs of the new rune system (among other things of course).","replies":[{"poster":"Lios Ashenblade","date":"2018-01-12T20:04:11.240+0000","up_votes":2,"down_votes":0,"body":"Also I got yelled at last night for ending a game, that was like 43-20 in our favor, because they wanted to finish their builds >.>","replies":[{"poster":"Shahamut","date":"2018-01-13T04:20:32.896+0000","up_votes":2,"down_votes":0,"body":"Lol 43 team kills and people aren't at full build? They didn't deserve to finish it XD. Good on ya m8 for ending the suffering.","replies":[]}]}]},{"poster":"FCJAAAAGOOOO","date":"2018-01-12T19:57:05.298+0000","up_votes":2,"down_votes":0,"body":"People are focusing on towers because:\n\nA.) TOWERS ARE MADE OF PAPER MACHE\n\nB.) First Blood...on Towers.  First Rubble?\n\nI appreciate the response a lot, though.","replies":[]},{"poster":"Karunamon","date":"2018-01-12T19:54:28.632+0000","up_votes":2,"down_votes":0,"body":"Something that took me a long time to unlearn over the years of playing is treating small numbers as if they don't matter. Even an extra two points in a base stat, multiplied many times by items and effects, can quickly spiral out of control.\n\nWith that in mind, what I didn't understand, and still don't, even with the many red posts and blogs about the design idea, is how the old runes system \"wasn't meaningful\". Yes, it was purely stat changes rather than active effects, but small stat changes can be huge. An extra few percentage points of AD/AP or Armor/MR or crit chance can be the difference between winning and losing a lane or a critical fight.\n\nWere those stats just not visible enough for people? It looks like with the more (active/flashy/significant-feeling) changes, that balance is going to be even harder to achieve in the future. \n\nBack when I started, there was a clear delineation. Champs have a base set of stats, you augment those with your runes based on the role you want to play, and then magnify the effect of those runes and stats with your item selection.\n\nNow, it seems like you have your base stats, items still have their effect, but your rune selection becomes make or break rather than an important variable, and that introduces its own balance concerns.","replies":[]},{"poster":"Int Like Rickon","date":"2018-01-12T21:37:45.412+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Maple Nectar,realm=NA,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=000d,timestamp=2018-01-12T19:30:57.732+0000)\n\n> Edit: Oh, and about the Heimer nerf - ask any melee top laner or jungler who&#x27;s tried to gank a Heimer and you&#x27;ll probably find their opinion quite different regarding the nerf.\n\nThere is already the guess in the community that some toplane main at Riot is tired of seeing Heimer in their game is just trying to nerf him out of spite. This seems to back that up...\n\nHis R Q is basically not even an ability anymore. Watching Heisendong become an 1-trick Illaoi player now will be fun I guess?","replies":[]},{"poster":"patmax17","date":"2018-01-16T11:39:39.973+0000","up_votes":1,"down_votes":0,"body":"Thanks for the interesting response!\n\nIf I may make one comment:\n\n> [{quoted}](name=Maple Nectar,realm=NA,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=000d,timestamp=2018-01-12T19:30:57.732+0000)\n>\n> As more and more players learn what optimal strategy/tactics they should employ in a game when they want to win, games can feel less tactical/strategic as they become more par for the course. This is a huge reason why we update the game every two weeks, since if left untouched, the game would become more and more about optimizing one or two strategies that are proven to work which would then very quickly become stale.\n\nWhile I agree and I think I understand what you mean, I think this part can easily be misinterpreted as \"change for change's sake\", which I believe is not Riot's intent. What you strive for (AFAICT) is perfect imbalance (video below), I.E. a state where the game itself is in constant change because for every problem the players autonomously find a counter/solution. At the moment the game isn't in that state and can feel \"solved\" if left to itself even for just a few weeks :)\n\n\n\nhttps://www.youtube.com/watch?v=e31OSVZF77w","replies":[]},{"poster":"Miku Hime sama","date":"2018-01-15T21:58:57.004+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Maple Nectar,realm=NA,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=000d,timestamp=2018-01-12T19:30:57.732+0000)\n>\n> Yeh... the timing of 8.1 was a bit confusing and probably set expectations a bit too high for players. Meddler tried to address it in his quick gameplay thoughts - but that particular section didn&#x27;t get much visibility. The 8.1 patch actually &quot;locked&quot; before Christmas, and was worked on at the same time as 7.24b.\n\nWait wait wait...  You worked on TWO fucking separate patches SIMULTANEOUSLY?  You REFUSED to name \"7.24b\" 7.25 like it should have been.  Now you're blatantly admitting that you had a larger number of patch changes which were LOCKED IN (your words) at the EXACT SAME TIME as 7.25, but were blatantly delayed to reach Live for over a fucking month?\n\nWhy is Rito actually confused why the playerbase constantly questions your intelligence?  When you consistently pull stupid shit like this, then publicly INFORM us to it, when we had no idea of the stupidity that was even happening?","replies":[]}]},{"poster":"AMYS GRAVE","date":"2018-01-11T21:57:54.406+0000","up_votes":20,"down_votes":0,"body":"> It is apparent that Riot's vision for this game is a fast-paced, non-tactical, fighter game dressed in a moba skin. I wish Riot would clarify this so I could know for sure what their vision was. I hate staying invested in a game only to find out they want to make the game everything I hate about it. \n\nSo much this. If they are trying to remove the strategic game that i fell in love with i wish they would just say so so that i can leave knowing this game doesn't want me.","replies":[]},{"poster":"A Bad Nasus","date":"2018-01-12T04:50:45.116+0000","up_votes":14,"down_votes":0,"body":"Until the balance team takes an actual look at toplane and tones down damage across the board I'll be continuing my hiatus.","replies":[]},{"poster":"VeganScout","date":"2018-01-11T18:29:40.234+0000","up_votes":7,"down_votes":25,"body":"Sona needs more nerfs","replies":[{"poster":"Plastic 5 ADC","date":"2018-01-11T19:44:12.015+0000","up_votes":23,"down_votes":2,"body":"No she needs a rework","replies":[]}]},{"poster":"Guy Fox Teemo","date":"2018-01-12T01:34:28.129+0000","up_votes":9,"down_votes":14,"body":"They were on vacation? They had even less time, the patch was already locked BEFORE the holidays, they couldn't add anything really after. Theres a HUGE patch coming next. \n\nBut no they didn't have a lot of time they were on vacation.","replies":[{"poster":"Blåbæret","date":"2018-01-12T03:11:43.093+0000","up_votes":16,"down_votes":4,"body":"They were on vacation for over a month? Okay brow. What's the next excuse going to be? Starbucks ran out of coffee beans so the balance team couldn't get their daily dose of caffeine?","replies":[{"poster":"Douglas Funnie","date":"2018-01-12T03:29:03.336+0000","up_votes":12,"down_votes":2,"body":"I had to upvote this.  Pre-season 8 was intended to last long this year so that Riot could work on the \"Runes Reforged\" update.  Preseason 8 has been on-going for over a month, yet we are still seeing players and towers get one shotted and RNG elements being heavily implemented into runes and champions.","replies":[]},{"poster":"GayFluffyUnicorn","date":"2018-01-13T01:01:07.433+0000","up_votes":6,"down_votes":0,"body":"Hey guys don't worry riot is balancing the game in preseason. \nHey guys don't worry riot is balancing the game before preseason ends. \nHey guys don't worry riot is balancing the game 8.2 because they were on vacation.\nEhm hey guys, don't worry riot might balance the game some day or something.","replies":[{"poster":"Blåbæret","date":"2018-01-13T01:17:00.355+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=GayFluffyUnicorn,realm=EUW,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=000400000002,timestamp=2018-01-13T01:01:07.433+0000)\n>\n> Hey guys don&#x27;t worry riot is balancing the game in preseason. \n> Hey guys don&#x27;t worry riot is balancing the game before preseason ends. \n> Hey guys don&#x27;t worry riot is balancing the game 8.2 because they were on vacation.\n> Ehm hey guys, don&#x27;t worry riot might balance the game some day or something.\n\nWord.\n\nFanboys always have an excuse in store.","replies":[]}]},{"poster":"Guy Fox Teemo","date":"2018-01-12T03:14:57.866+0000","up_votes":4,"down_votes":8,"body":"They were off for almost two weeks and had prior to that made a small patch of 2 weeks. They couldn't add any thing huge in that patch because they were going on vacations and throwing balance out of whack even more during the holiday season is a bad idea.\n\nSo they made a small patch, went on vacation, just came back a week or so ago and have dumped a huge amount of stuff on the PBE.\n\n\nAnd yes being on vacation is an excuse, people don't want to work *during* their vacation.","replies":[{"poster":"inboardshooter","date":"2018-01-12T05:42:12.106+0000","up_votes":6,"down_votes":8,"body":"Pisses me off that their product, their game, is in such a shitty state and they just go on “vacation” while their customers, us, are left to use their shitty product. Yeah sure people can have a vacation, but with how poor of a job they’ve been doing for the past year or more, what exactly do they need a vacation from? I admit I don’t know what their day to day operations are. But I do know their end-product has been a pile of shit. And they’re too big of cowards to actually talk to, and listen to, their customer base. I’m glad to see people are mad and making harsh posts. The least they could do is say either the executives are forcing a game like this, or they themselves want it like this.","replies":[{"poster":"Guy Fox Teemo","date":"2018-01-12T06:10:18.803+0000","up_votes":6,"down_votes":8,"body":"Its a product they make for *free* and one of the most highly polished free products ever. (Considering its the most played online pc game ever). So yes they make a good \"product\". I fkin hate a lot of the decisions Riot makes, but fuck you for thinking they can't take a vacation once a year. They update this game every 2 weeks, except ONCE a year, and constantly make huge updates throughout the year adding more and more content. You get new skins every 2 weeks, extremely high quality skins at that.\n\nShould we go to Overwatch? Or almost any other competitive game where they update and balance game the game *maybe* once a month or two? And even then the balances changes are extremely minimal.\n\nSo don't come bitchin here about them taking a vacation. Bitch about balance and the state of the game all you want, but these are people and they work a shit ton. They deserve a vacation.","replies":[{"poster":"inboardshooter","date":"2018-01-12T16:38:46.222+0000","up_votes":6,"down_votes":0,"body":"You can fuck me all you want. I never said they couldn't take a vacation. I'm only critical of the time they take their vacation. I know they do it at the same time every year. But when the game is arguably in it's worst state it's ever been, not an ideal time to up and leave. If I took a vacation when my department were in shambles, it'd reflect highly negatively of me.\n\nI've been saying to myself for a long time now that they are really bad at their job because this game has been so unbalanced for so long. I fired an employee about a month ago because he wasn't doing his job and what was expected of him for too long. I've told myself if I was in charge, I'd put the balance team on notice. Perhaps this game has gotten too big and complicated that even asking for 70% balance is too much. (I know it's near impossible to get it to 100%). I'm fine with a rotating meta, as long as it's reasonable and doesn't negate half the champion roster. But this is why I've gotten critical, and haven't even said anything until like a week ago, of the employees. At some point, you don't blame the faceless organization, you have look at the people running.\n\nThere's no way it's possible someone gets to be as bad at their job as I'm imagining they are, for this long. If Riot really wants the game to be like this, I'll likely just have to move on, and nobody will even care :) and my life will go on.\n\nBut it is frustrating to see a game I used to love and tell my friends being the \"perfect combination of strategy and action\" turn into this.\n\nSkins don't have an affect on the balance of the game, so that argument doesn't do it for me. Seems like people are not fond of the blue essence rework either, I have no opinion on that. And I've never played Overwatch, or really any other PC game, so I don't know enough about it comment on that.","replies":[]},{"poster":"VexingRaven","date":"2018-01-13T08:25:38.620+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Guy Fox Teemo,realm=NA,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=00040000000000000000,timestamp=2018-01-12T06:10:18.803+0000)\n>\n> Its a product they make for *free* and one of the most highly polished free products ever. (Considering its the most played online pc game ever). So yes they make a good &quot;product&quot;. I fkin hate a lot of the decisions Riot makes, but fuck you for thinking they can&#x27;t take a vacation once a year. They update this game every 2 weeks, except ONCE a year, and constantly make huge updates throughout the year adding more and more content. You get new skins every 2 weeks, extremely high quality skins at that.\n\nThe game being F2P is irrelevant, they make a _ton_ of money of this game, F2P or not. It's not like they're volunteers. They have a huge world headquarters in LA, one of the most expensive cities in America. They run hugely popular and heavily sponsored tournaments every year. The game might be free to play, but it's definitely not being made for free. So take this non-argument somewhere else.","replies":[{"poster":"Guy Fox Teemo","date":"2018-01-14T05:44:18.891+0000","up_votes":1,"down_votes":0,"body":"I said its free because at a F2P game, they make a SHIT TON of money. And you know why? Because its an extremely polished well made game. I pointd that out because the guy I was replying to called it a shit product, and that they shouldn't be allowed to have a vacation because he thinks its a shit product. If you bothered to pay attention to anything i said in response to his.","replies":[]}]}]},{"poster":"LegitBusinessman","date":"2018-01-12T16:40:20.595+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=inboardshooter,realm=NA,application-id=3ErqAdtq,discussion-id=qVAaT1n4,comment-id=0004000000000000,timestamp=2018-01-12T05:42:12.106+0000)\n>\n> Pisses me off that their product, their game, is in such a shitty state and they just go on “vacation” while their customers, us, are left to use their shitty product. Yeah sure people can have a vacation, but with how poor of a job they’ve been doing for the past year or more, what exactly do they need a vacation from? I admit I don’t know what their day to day operations are. But I do know their end-product has been a pile of shit. And they’re too big of cowards to actually talk to, and listen to, their customer base. I’m glad to see people are mad and making harsh posts. The least they could do is say either the executives are forcing a game like this, or they themselves want it like this.\n\nKind of hostile but there's a valid point.  I feel like pre-season patch would have been better after the break.  It's a bit of a mess where the problems are only now being looked at by the team.  I feel like drop pre-season, it's a bit of a circus, go on vacation for 2 weeks, come back, heimerdinger nerfs, was weird.  While all these things are necessary, the timing was done in such a way that it was sort of inevitably going to upset a lot of people.\n\nThis could have been damage controlled by a very straight forward \"Here's pre-season, it's probably gonna be a circus, we'll be back after break, so don't panic if it's sloppy and you don't hear anything from us for a few weeks.\"","replies":[]}]}]}]}]},{"poster":"General Esdeath ","date":"2018-01-12T10:56:16.070+0000","up_votes":6,"down_votes":0,"body":"They won't reply to this, we're not praising them or making a meme =/ the balance team may as well be locked in a dungeon with no internet access, scrawling on papyrus rolls and sending it through a crack in the wall to the people who code these changes.","replies":[]}]}