{"poster":"GNT0000 00Q ANT","date":"2019-01-24T16:17:02.823+0000","title":"gioco schifoso","subforum":"Discussioni generali","up_votes":2,"down_votes":8,"body":"un gioco proprio di merda. dove ti bannano perche scridi chi feeda , non se ne fregano un cazzo di quelli che sono boostati fino al collo, che rovinano molte partite a molte piu persone.\r\nProprio un gioco di merda","replies":[{"poster":"EmptyHole","date":"2019-01-24T16:38:15.100+0000","up_votes":4,"down_votes":1,"body":"cinque e mezzo","replies":[]},{"poster":"The Fluffy Lamb","date":"2019-01-25T01:42:39.918+0000","up_votes":3,"down_votes":1,"body":"Piccolo lui, vuoi una carezza?\n\nAh no aspe, flammi?\n\nallora meglio una manata{{sticker:sg-miss-fortune}}","replies":[{"poster":"mangialavandini","date":"2019-01-25T08:16:12.482+0000","up_votes":2,"down_votes":1,"body":"oi oi, mai la violenza...\n\nun biscotto~~ e cianuro~~ e goccie di cioccolato","replies":[{"poster":"The Fluffy Lamb","date":"2019-01-26T09:54:16.087+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=mangialavandini,realm=EUW,application-id=MJVj50Jw,discussion-id=WvdPBV7E,comment-id=00040000,timestamp=2019-01-25T08:16:12.482+0000)\n>\n> oi oi, mai la violenza...\n> \n> un biscotto~~ e cianuro~~ e goccie di cioccolato\n\nSi ci sto. Meglio non sporcarsi le mani di sangue. Poi mi tocca pulirle pure","replies":[]}]}]},{"poster":"Náos","date":"2019-01-24T20:22:18.276+0000","up_votes":2,"down_votes":1,"body":"Sgridare e insultare sono due cose diverse.\nEsci la la chat log che ti è arrivata per email!\n\nPiccolo consiglio per la prossima volta, non perdere tempo a \"sgridare\" chi goca male. Pensa solo al tuo, se sei in partita con determinate persone vuol dire che non sei tanto più bravo. (magari quella persona ha avuto solo un brutto game).\nChiaramente non parlo nello specifico della tua ultma partita, non ho controllato. Potrebbe effettivamente darsi che abbiamo intato di proposito, ma anche in quel caso cerca di stare sereno e pensare al tuo. Ci guadagni in salute, fidati. \nIo ho mutato emote nemiche e alleate, la chat globale e in alcuni casi anche quella di squadra. Gioco molto più sereno da allora (anche se sto giocando molto poco ultimamente, mi sa che questa stagione dovrò sudare per tornare in gold)","replies":[]},{"poster":"Täkı","date":"2019-01-24T18:10:43.610+0000","up_votes":1,"down_votes":1,"body":"Ah, d'accordissimo su chi rovina le partite. Sono a cinque partite fatte per il placement, tre ne ho perse nonostante fossi feedato, tra jungler trollone e top laner che mi feeda Pantheon. Io sono una persona che cerca sempre di capire dove sbaglia e su questo ho fatto notevoli miglioramenti, ma dio mio, a furia di 1v9 dopo un po' una persona inizia a triggerarsi.\nMa non preoccuparti amico mio, cerchiamo di essere positivi, in questo gioco dipendiamo solamente da noi stessi, se si gioca da soli senza un amico.","replies":[{"poster":"Ignotum ITA","date":"2019-01-25T20:54:05.512+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=YÄTØ,realm=EUW,application-id=MJVj50Jw,discussion-id=WvdPBV7E,comment-id=0001,timestamp=2019-01-24T18:10:43.610+0000)\n>\n> Ah, d&#x27;accordissimo su chi rovina le partite. Sono a cinque partite fatte per il placement, tre ne ho perse nonostante fossi feedato, tra jungler trollone e top laner che mi feeda Pantheon. Io sono una persona che cerca sempre di capire dove sbaglia e su questo ho fatto notevoli miglioramenti, ma dio mio, a furia di 1v9 dopo un po&#x27; una persona inizia a triggerarsi.\n> Ma non preoccuparti amico mio, cerchiamo di essere positivi, in questo gioco dipendiamo solamente da noi stessi, se si gioca da soli senza un amico.\n\nQualcosa mi dice che sei secondo account.... Mhh....","replies":[]}]},{"poster":"Pulastér","date":"2019-01-24T21:07:38.394+0000","up_votes":1,"down_votes":1,"body":"Ti posso dare credito sul fatto che i boostati rovinano i game ecc. Ma non che non puoi giocare TUTTI I GAME o climbare tranquillamente per colpa loro. Se uno feeda non sei autorizzato dalla Riot di rompere le scatole a quel giocatore, metti che aveva una brutta partita o semplicemente è sfortunato, e se è solo uno scarso non diventerà magicamente challenger perché gli pesi di aver feedato per tutta la partita e nei peggiori dei casi potrebbe rivelarsi uno di quelli che ti intano i game se gli dai la spinta sbagliata.","replies":[{"poster":"LordBLT","date":"2019-01-25T10:56:26.379+0000","up_votes":1,"down_votes":0,"body":"Io ho appena preso un ban alla chat di 10 partite perché ho flammato un Anivia troll in ranked ( bloccava le strade chiudeva in base rubava farm ecc ecc ) grande Riottt !","replies":[{"poster":"Pulastér","date":"2019-01-25T13:10:15.485+0000","up_votes":1,"down_votes":0,"body":"Flammandolo hai semplicemente fatto il suo gioco, dandogli una ragione per stuzzicarti ancora di più. Ragione in più per non fare queste cose. Ti aspettavi forse che la smetteva di trollare appena iniziavi a dargli attenzioni?","replies":[]}]}]}]}