{"poster":"FoxyNoona","date":"2017-04-17T16:36:29.905+0000","title":"Cercasi compagni per Ranked e non solo","subforum":"Reclutamento","up_votes":2,"down_votes":2,"body":"Ciao a tutti,\r\n\r\nCosa cerco?\r\n\r\nCompagni di squadra per giocare nelle ranked e non. **Cerco principalmente persone che desiderano fare squadra, quindi non cerco protagonisti assoluti, cerco gente che collabora e che aiuta i compagni che stanno in difficolt&agrave;.** Disponibili anche per comunicare tramite **discord** (applicazione per telefono che permette le multi-chiamate). \r\n\r\nChi sono e perch&eacute; sto facendo questo annuncio\r\n\r\nSono una ragazza che ama giocare a lol, ma ultimamente la mia esperienza di gioco sta facendo schifo. Io, con altre due amiche, giochiamo prettamente in ARAM, ho notato che spesso le squadre non sono equilibrate (una volta mi &egrave; capitato 3 tank e 2 maghi che stunnano o immobilizzano contro 3 adc 1 support e un povero disgraziato assassino). Ho raggiunto dopo tanto il lvl 30 e vorrei provare a fare delle ranked, ma le mie amiche  hanno gi&agrave; deciso di non farle. Tramite l&#039;aram ho notato che se i componenti di squadra sono scelti a caso e non sono persone con la quale puoi comunicare facilmente, bhe 3 su 4 la partita la perdi. Quindi per questo motivo vorrei affrontare al meglio le ranked assieme a persone collaborative e amichevoli, disposte ad aiutarti a crescere. Poi se per le persone che vorranno aiutarmi vorranno anche giocare insieme alle mie amiche in aram, bhe non mi dispiacerebbe. \r\n\r\np.s= **odio i kamikaze** che si buttano sotto torre nemica come se non ci fosse un domani o che si buttano in mischia senza pensarci su due volte.","replies":[{"poster":"Shiyn","date":"2017-04-18T22:21:17.055+0000","up_votes":1,"down_votes":0,"body":"Ciao anche io cerco compagnia sia per normal, aram e magari duo ranked... E nn sopporto i giocatori che a fine partita scrivono che hanno carriato tutto loro oppure easy...\nAggiungimi pure se vuoi, io gioco di solito al giovedì sera e venerdì sera","replies":[]},{"poster":"Kòro","date":"2017-04-17T18:27:54.671+0000","up_votes":1,"down_votes":0,"body":"hey,ciao ^^ sono main mid top, mi gioco principalmente assassin se ti va di crescere e cercare di imparare assieme aggiungimi pure","replies":[{"poster":"FoxyNoona","date":"2017-04-17T19:06:18.690+0000","up_votes":1,"down_votes":0,"body":"Va benissimo grazie ^^ io giocando spesso in aram so adattarmi a tutti i ruoli. \n\nMa posso elencarti i champ che amo usare maggiormente:\n\ntop = Nasus, Garen \nassassino = Talon, Kindred\nmago = Azir,Morgana (vorrei mainnare Azir, ma avendo una difesa equivalente ad uno sputo, mi rende insicura e finisco col farmi uccidere, ma se sto in teamfight e qualcuno mi aiuta, faccio triplette xD l'ultima partita con azir ho fatto 24 kill)\nadc = Sivir, Ma anche altri se ho un buon support\nsupport= main Zilean, Morgana\n\nho provato molti campioni tramite aram quindi so più o meno cosa fanno, ma non ho dimestichezza con gli oggetti","replies":[]}]}]}