{"poster":"Delicious Yogurt","date":"2016-05-14T06:02:08.372+0000","title":"Diamant Spieler ( Team Coach ) Fragerunde Teil V","subforum":"Level Up: Guides & Tipps","up_votes":2,"down_votes":2,"body":"Hey Leute :) \r\n\r\nIch mache mal wieder eine Fragerunde, als Teamcoach kann ich Fragen aus allen Rubriken,\r\nrund um das Thema League of Legends beantworten :) \r\n\r\nMain Position ist dennoch Jungle.\r\n\r\nAlso Fragt drauf los ! :) Ich beantworte alles rund um LoL !\r\n\r\n&lt;3","replies":[{"poster":"Awsane","date":"2016-05-14T18:57:15.402+0000","up_votes":1,"down_votes":0,"body":"Hey\nwelche Champions würdest du für Spieler empfehlen die Körperlich beeinträchtigt sind (ins besondere für diejenigen die nur mit einer Hand spielen können?, achso Anspruch sollte schon sein dia zu erreichen)","replies":[{"poster":"Delicious Yogurt","date":"2016-05-15T05:23:29.957+0000","up_votes":1,"down_votes":0,"body":"Oh, das ist mal eine sehr ungewöhnliche Frage,. \n\nIch selbst erlebe es eben LoL ohne den linken Ringfinger zu spielen, das ist mit etwas Umgewöhnung machbar. \nAber wenn ich jetzt davon ausgehe, das einem die gesamte linke Hand fehle hätte ich nur die Idee eine dieser Tastatur Kombi Mäuse zu kaufen. Diese haben den linken bereich der Tastatur mit in die Maus intigriert. An sonsten ist es durch reine Geschwindigkeit beim auswählen der Spells mit Mausklick nahezu UNMÖGLICH bis in den Diamant Bereich auf zu steigen. \n\nDennoch würde ich hier wohl eher einfache Autoattack basierte Champions, also ADC's empfehlen .\n\nIch hoffe ich konnte dir wenigstens etwas weiter helfen.\n\nDelicious Yogurt","replies":[{"poster":"Macolm Merlyn","date":"2016-05-25T01:43:22.571+0000","up_votes":1,"down_votes":0,"body":"Tryndamere","replies":[]}]}]},{"poster":"Gefahr McGefahr","date":"2016-05-14T13:01:24.826+0000","up_votes":1,"down_votes":0,"body":"Hey, \nich bin Main-Support (derzeit Platin 5) und mechanisch beherrsche ich meine Mains eigentlich sehr gut würde ich sagen (Bard, Ali, Thresh, Leo), allerdings habe ich das Problem, dass ich die Lane meiner Meinung oft nicht hart genug gewinne/ gar nicht gewinne und dementsprechend auch nicht oft genug roamen kann ( vor allem auf Bard ). Meine Frage ist jetzt: Spiele ich nicht aggressiv genug? Bzw. Was kann ich ändern, um mehr Dominanz auf der Lane zu erzeugen?\nDanke im Vorraus!\n\nLG","replies":[{"poster":"Delicious Yogurt","date":"2016-05-14T15:27:33.719+0000","up_votes":1,"down_votes":1,"body":"Ich denke, dass du nicht die \" Richtigen \" Champions spielst, im aktuellen Meta gibt es kaum möglichkeiten von den \"OP\" Picks abzuweichen, wenn man gewinnen will. Bard ist in der Lane im vergleich zu anderen Supportern, die seine Aufgabe erfüllen einfach schlechter. Seine Range ist recht kurz und ist für Stuns auf den Proc des Q's angewiesen. Morgana als Beispiel, hat einen längeren und sicheren Bind. Ihr Schaden ist größer und der Support für den ADC ist durch das Blackshild deutlich besser als der von Bards kleinem insta Heal. Ich denke Morgana ist der Bessere Bard.\n\nZu Alistar kann ich nicht viel sagen, das müsste ich ingame sehen. Leona ist momentan aber auch nicht so der Bringer, Braum erfüllt Ihre Aufgabe weitaus besser, als Leona selbst und bietet dazu noch Protection für Team und ADC. \n\nAber um auf deine eigentliche Frage zurück zu kommen. Es kommt nicht unbedingt darauf an wie Aggressiv du spielst. Die aller erste Regel die ich meinen Teams immer beibringe ist, in der Laning Phase nicht zu sterben und sicher zu spielen, egal ob man CS missed oder nicht. Warte einfach auf sichere Kills anstatt 50:50 fights zu forcen, bei denen man sehr schnell sehr stark in Rückstand geraten kann. \nNutze Item spikes deines AD Carry's aus und versuche dem Gegner ein Dorn im Auge zu sein mit dem Thema zoneing. \n\nFür alles weitere müsste ich wirklich ingame analysen machen, für die ich aber leider nicht die Zeit aufbringen kann. \n\nIch hoffe ich konnte dir dennoch etwas weiter helfen.\n\nDelicious Yogurt","replies":[{"poster":"Gefahr McGefahr","date":"2016-05-15T06:33:25.226+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank!\nAlso meinst Braum und Thresh sollten ganz gut funktionieren? Ali ist meiner Meinung nach durchaus stark allerdings nicht im Early auf Grund seiner extremen Manakosten.\nLG","replies":[{"poster":"Delicious Yogurt","date":"2016-05-15T11:34:32.098+0000","up_votes":1,"down_votes":0,"body":"Naja, seine Manakosten sind zwar recht hoch er ist aber super Tanky dabei und hat sehr guten AOE CC was ihn in Lane sowie Teamfight oder auch bei picks sehr zu gute kommt.","replies":[]}]}]}]}]}