{"poster":"IDEMO NA MUDA","date":"2018-10-12T22:00:12.219+0000","title":"Don't care.png","subforum":"Gameplay","up_votes":16,"down_votes":6,"body":"I&#039;ve come to that point where i don&#039;t even care anymore about this game. Tryharding is worthless since hehe0/8botlane.png, inting is not punishable, have more chances to win with a troll pick than with a normal pick. Example, 20/5 zed mid, lost a game cause 3/22bot.jpg \r\n3/9 worthless lee sin pick where I don&#039;t do anything - you win congrats promotedaswellyouaregreat.exe \r\nExample #2 16/6 ekko mid most damage everything lit, luxsupport2/13.mwf do_while swaintop2/10.whatthetfuck \r\n3/7 Vladimir wingame.dll youaregreat here a challenger rank \r\n\r\nIf u wanna win just play full ad fiddle and attack speed veigar at this point who cares","replies":[{"poster":"DuskDaUmbreon","date":"2018-10-13T02:48:50.591+0000","up_votes":7,"down_votes":1,"body":"k","replies":[]},{"poster":" Th3 Rift Hero","date":"2018-10-12T22:09:36.650+0000","up_votes":5,"down_votes":1,"body":"i dont care that you dont care xd","replies":[]},{"poster":"RenownedWheat42","date":"2018-10-12T22:01:27.610+0000","up_votes":8,"down_votes":4,"body":"\"I don't care, now let me go out of my way to come to the boards and make a whole post to show everyone how much I don't care\"","replies":[]},{"poster":"Thefrostyviking","date":"2018-10-13T16:53:00.109+0000","up_votes":2,"down_votes":0,"body":"OP i just looked into your OP.GG and ......you dont seem to realize a thing.\n\nThis is a team game.\n\nNo matter how much someone feeds, no matter how much someone gets fed.......there are still 3 other lanes with a bunch of people whose status will impact the game progression greatly.\n\nAlone and fed as hell while your team got smashed as you farmed midlane for useless kills (killing same guy 4+ times). Game is hopelessly lost because 80% of your team is weaker than theirs......even if you do the work of 3 its not enough as long as they have two with the power of two each.\n\nYou died a bunch of time but all the other lanes won and even by a landslide at that? It means 80% of the enemy team is weaker and its a won game for your side, naturally. \n\n\nTo illustrate,  i recently played game as Syndra midlane, i had rengar jungle, wukong top, jinx+thresh botlane.\n\nEnemy side was Veigar, nunu, Tryndamere, twitch and morg.\n\nIn that game i got monstrously fed, enemy veig is a silver while i am a former plati,  but my toplane and botlane both broke down and the Tryndamere even killed Rengar+wukong 1v2.\n\nSo,  why did i win while 80% of my team was essentially down with Tryndamere pushing towers the second turret?\n\nI smashed veigar and nunu into paste and force fed rengar and wukong with it, i smashed twitch to stop him from getting a true snowball rolling by roaming down on him and i gave jinx time to farm.\n\nThen i turned toplane, i drove tryndamere into the dirt 3 times to have him stop pushing and drove the minions away and had Rengar+wukong roam together in the meanwhile which killed twitch&morg several times and got both of them back into the game along with thresh.\n\nVeig had become entirely useless, morg was behind, nunu was behind and Twitch with his earlier lead was still pretty strong....if he was allowed to do anything.\n\nTryndamere found that he couldnt push top with me around so he started roaming......but by the time he did it was far too late, my team was already back in the game and no matter how he tried he couldnt even 1v2 anymore.\n\nI won that game by spoonfeeding my own team kills, stopping enemies looking like they were about to snowball and smashed their strongest one.\n\nThat, is how you win games as a overfed midlaner with a losing team, not by ignoring them. ","replies":[{"poster":"IDEMO NA MUDA","date":"2018-10-13T20:08:49.923+0000","up_votes":1,"down_votes":0,"body":"You go ahead try doing something against a fed as fuck botlane with 0/50 botlane of your own while they are incapable of using brain, keyboard or mouse. I see shit like this very often and yeah, it is a \"team game\", but guess what, 70% of my teammates are people that are respectively garbage. How am i supposed to do something in the game when my botlane is feeding from minute one. They can't even afk farm. Same goes for toplane. Like, dude, if your game knowledge is bellow your IQ which is around none, go play normal games and learn how to play before actually queueing for a ranked game.","replies":[]}]},{"poster":"KFCeytron","date":"2018-10-13T05:43:25.759+0000","up_votes":1,"down_votes":1,"body":"I was momentarily confused at what a file like 8botlane.png would be, and why it would be in the hehe0 folder. =|","replies":[{"poster":"IDEMO NA MUDA","date":"2018-10-13T12:28:57.330+0000","up_votes":2,"down_votes":0,"body":"Ngl u got me lost rn too","replies":[{"poster":"KFCeytron","date":"2018-10-13T15:51:19.952+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Better at Bot,realm=EUNE,application-id=3ErqAdtq,discussion-id=RIhyX9UN,comment-id=00030000,timestamp=2018-10-13T12:28:57.330+0000)\n>\n> Ngl u got me lost rn too\n\nFile names can't contain slashes, because that's what indicates a directory level.","replies":[{"poster":"IDEMO NA MUDA","date":"2018-10-13T20:09:29.203+0000","up_votes":1,"down_votes":0,"body":"you meant the entire thing, ya, i know, but it was a complete 0/8 thing not like a slash","replies":[]}]}]}]},{"poster":"Quiet Dude","date":"2018-10-13T16:10:42.216+0000","up_votes":1,"down_votes":0,"body":"OP sounds like he asks women his own age to be his mom","replies":[{"poster":"IDEMO NA MUDA","date":"2018-10-13T20:10:01.244+0000","up_votes":1,"down_votes":0,"body":"Will you be mine tho","replies":[]}]},{"poster":" Jaegaer","date":"2018-10-13T06:46:32.691+0000","up_votes":1,"down_votes":1,"body":"After I lose a game after someone inted or afk, I queue up as rammus adc or evelynn support and still manage to win even when I just want to let my anger out and troll people. When I want to win I lose. When I want to lose I win. Really dont understand why it works this way but I have yet to lose an intentional troll game. This game makes me love trolling. Just making other people mad is so funny lmao. I love trolling ranked on my smurf when bot ints. Fuckin lmao. I could probs troll my way up on my smurf to at least gold. Because thats when people start to learn how to play. Plat isnt even that different from gold. But at least theres less inting in bot ffs. I LOVE TROLLING COS THATS THE ONLY WAY I WIN","replies":[]},{"poster":"Jerry SeinfeId","date":"2018-10-13T14:17:55.656+0000","up_votes":1,"down_votes":3,"body":"this is a really shitty usage of the \".fileformat\" meme.","replies":[]}]}