{"poster":"Kalzy","date":"2018-05-25T00:26:50.753+0000","title":"new to the game","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"so im new to the game currently level 10 and this game seems pretty hard to understand\r\n\r\ni know the basics like lanes, minions, towers and roles\r\n\r\nyou need to destroy tower on your lane but you need to kill their minions to gain control but enemy laner stops you from doing that so you need to be more skilled than him and kil himl/level up faster in order to win lane to destroy that tower\r\n\r\nyeah thats the only stuff i know is there anything im missing out?","replies":[{"poster":"MrHaZeYo","date":"2018-05-25T00:31:15.955+0000","up_votes":1,"down_votes":0,"body":"Make sure you last hit the minions to gain the gold from them, which if you are better then your opponent will allow you to get better items and out power them. \n\nLeague ultimately has a great burden of knowledge tacked into it. It's going to take awhile to understand when and what to do certain things. It's just something you have to continue to work though. Spend spare time you have on learning more through guides, twitch, and Youtube. Once you get it down though, you'll prolly really enjoy the game.","replies":[{"poster":"Kalzy","date":"2018-05-25T00:36:57.938+0000","up_votes":1,"down_votes":0,"body":"im trying to hit the minions last but for some reason i have no idea how strong the champion is so i miss a lot","replies":[{"poster":"MagicFlyingLlama","date":"2018-05-25T00:41:37.121+0000","up_votes":1,"down_votes":0,"body":"That comes with practice. Also hold C to see your stats, including attack damage. Minions will show their health if you click them.","replies":[{"poster":"MrHaZeYo","date":"2018-05-25T01:14:46.724+0000","up_votes":1,"down_votes":0,"body":"It takes time to learn, try making custom bot games where you can work with 4 bots vs 5 bots. Whatever champion you pick go mid so it's 1v1 and practice last hitting.","replies":[]}]}]}]},{"poster":"MagicFlyingLlama","date":"2018-05-25T00:40:12.083+0000","up_votes":1,"down_votes":0,"body":"Destroying towers as fast as possible is not always good - they only give a little gold and dont give you an advantage until you can quickly push your minion wave down the lane.\n\nTaking a turret early can mean you are forced to overextend dangerously far from your own turret to farm minions, which give much more important gold.\n\nTypically, try to work on weakening it, but dont destroy it until your team is ready, or unless you are racing for first turret gold bonus (usually botlane).","replies":[{"poster":"Kalzy","date":"2018-05-25T00:50:06.234+0000","up_votes":1,"down_votes":0,"body":"ah so thats why streamers don't destroy tower quickly\n\nthey are trying to farm as much as possible before destroying towers?","replies":[{"poster":"MagicFlyingLlama","date":"2018-05-25T01:08:01.404+0000","up_votes":1,"down_votes":0,"body":"It is situational.\n\nsome champs, especially in toplane, try to push as hard as they can to keep the other team busy trying to stop them. These are called split-pushers.\n\nIn most cases, farming without pushing the wave (called freezing - carefully last-hitting or matching the other player in minion damage) is preferred.\n\nIf someone wants to recall or gank another lane/jungle, push the wave into the turret to deny them gold from it while you are gone.\n\nSome champions are also bad at last-hitting, and you can push the wave to force them to compete with their turret for last-hits. It puts you at risk, but reduces their farming.","replies":[]}]}]},{"poster":"Keshaun","date":"2018-05-25T00:43:40.774+0000","up_votes":1,"down_votes":0,"body":"If you're really interested in the game, I would watch some videos on how other people play the game. The skill differential will be significant, but you can at least watch and understand how high skilled players play the game. Tips I can give you when learning the game.\n\n1. Most importantly, make sure you're having fun.\n2. Focus on a mechanic called \"_last hitting_\" which involves last hitting the creeps in lane so you get the gold from them.\n3. This one trips most people up, but try and focus on the map as best as you can so you can see what's going on around the map or if you're getting \"_ganked_.\" Ganked is a term players use when the jungler (yours or the enemy jungler) shows up in your lane to try and get a kill or to pressure the tower.\n4. This one is also hard due to the game being free to play, but try and explore with different champions so you can get a feel for which types of champions you like.\nI personally play middle lane and middle lane normally is your magic damage dealer. Here you can find champions like {{champion:142}}, {{champion:13}}, {{champion:136}}, and many more magic damage dealers. I main {{champion:13}}, but also really enjoy playing the other 2 champions listed.\n1. The ultimate goal of the game is to take down objectives and push to destroy their Nexus. There's neutral objectives in the game like Elemental Dragons (which gives unique bonuses), Rift Herald (tower destroying monster), and Baron Nashor (a team buff that makes everyone slightly stronger and makes your minions very strong to help push down towers / inhibitors). You can use these neutral objectives to help end the game when you destroy their Nexus.\n\nThat's just a few of the basic concepts in League of Legends in my opinion. Hope you can better understand the game and most importantly, have fun doing it!","replies":[]},{"poster":"Weathered","date":"2018-05-25T00:43:11.512+0000","up_votes":1,"down_votes":0,"body":"The game definitely takes some time to understand, as there are a lot of different things to consider. To help yourself learn, I would try to find one or two champions that you really enjoy and then play them for a while so you start to understand how they fit in the game. If you need help with what items to build, or what runes to be using, sites like OP.GG can give you guides for each champion. \n\nThe game takes patience, and often time you will encounter people who really don't have patience. If you start running into some less than helpful people, remember that you can always press tab and click the \"mute\" button next to the person's name. You can also press the enter key to type, and type '/mute personsname'. \n\nIf you want some personal help, you can add my account 'Weathered' and I can message you for any questions whenever I see them.","replies":[]},{"poster":"Bluesnake002","date":"2018-05-25T00:29:57.272+0000","up_votes":1,"down_votes":0,"body":"You're missing out that you're playing against some kind of \"bots\" in normal PVP which will give you alot of losses, this doesn't happen in draft tho.\n\n(Found out  yesterday)\n\nSo yeah, play draft.","replies":[{"poster":"MagicFlyingLlama","date":"2018-05-25T00:42:18.232+0000","up_votes":1,"down_votes":0,"body":"New players cant even play draft.","replies":[]},{"poster":"Kalzy","date":"2018-05-25T00:35:40.168+0000","up_votes":1,"down_votes":0,"body":"what do you mean? what is draft?\n\ni only play co-op vs bots because i don't wanna play regular mode yet","replies":[]}]}]}