{"poster":"Critamere1980","date":"2018-08-09T18:11:10.544+0000","title":"League wird olympisch!","subforum":"Esports","up_votes":3,"down_votes":2,"body":"Hallo Leute,\n\nman hat in den letzten Monaten in diversen Medien gelesen, dass evtl. 2-3 Online Games olympisch werden k&ouml;nnten und League wurde jedes mal genannt. Dies w&uuml;rde dem Esport nat&uuml;rlich einen enormen Anstieg, an begeisterungsfreudigen Menschen, zugute kommen.\n\nDarum habe ich mich dazu entschlossen, mein Gl&uuml;ck in League als Manager zu versuchen. Ich habe 18 Jahre Erfahrung im Bereich  Online Marketing, Web- u. Grafikdesgin, Suchmaschinenoptimierung sowie Content Publizierung. League wirkt auf mich eher rar ges&auml;ht, in punkto F&auml;higkeiten, wenn ich mir so die Manager mancher Pro Clans ansehe.\nIm TV gibt`s ja seit einiger Zeit League &Uuml;bertragungen in der Nacht und da wurden auch einmal ein paar deutschsprachige Manager von professionellen Clans interviewt. Das sind teilweise Studenten, die mit ihren Clans nun Millionen verdienen. Irgendwie crazy! Also studieren werden von denen wohl nurmehr die wenigsten. Fakt ist, sie sind allesamt Zocker oder gewesen und so in das Metier geschl&uuml;pft. Richtig Know How hat hierbei jedoch kaum einer. Wird halt audidakt angeeignet worden sein, dieses Wissen. Will hier nun auch nichts schlecht reden, aber ich sehe mich da doch an der Spitze, mit meinen Kontakten und der geb&uuml;ndelten Erfahrung an sich.\n\nIch kann  beispielsweise auf 400 namhafte Blogger Kollegen zur&uuml;ck greifen, welche mich in punkto Content Marketing promoten w&uuml;rden. Nur das alleine w&uuml;rde schon ca. 60.000 Euro kosten. F&uuml;r micht ist es for free. Ich habe zu unz&auml;hligen namhaften Unternehmen diverse Kontaktpersonen, nur hierbei ist das ganze nicht so einfach. Ohne Aktion gibt es keine Gegenreaktion. Man muss erst etwas leisten, um auch einzufordern k&ouml;nnen.\n\nIch bin nun schon einmal soweit, dass ich ein Team habe, welches aus genau 5 Spielern besteht und die sind allesamt Dia V, bis auf den Top Laner, welcher Dia I ist. H&auml;tte zwar nen Dia I ADC gefunden, aber das tolle ist, dass sich der Mid, Sup und Jungler schon gut ein Jahr kennen und zusammen zocken, sich sogar schon einmal real getroffen haben. Der ADC ist neu, passt aber gut rein und der Top Laner scheint auch zu passen. Da gibt es 2 tryouts. Der andere w&auml;re ebenso Dia V.\nDer Altersdurchschnitt liegt gesch&auml;tzt bei ca. 25. Das empfinde ich ebenso von Vorteil. Der j&uuml;ngste ist 20 und der &auml;lteste 27.\n\nIch tendiere nun zu folgender Schlussfolgerung...\nWenn sich diese 5 Spieler finden und so gut als m&ouml;glich interagieren, w&auml;re gewiss einiges m&ouml;glich. Im Team Ranking k&ouml;nnte man dann durchaus schnell auf Dia II-III kommen. Dia V sind sie ja schon im Team. Der fast Master wird da sicher auch etwas bewirken k&ouml;nnen.\nAlso wird es wohl gar nicht so lange dauern, bis man eben auf Dia II-III kommt. Aber das reicht nat&uuml;rlich noch nicht aus, um sich Pro Gaming Clan nennen zu k&ouml;nnen. Von solchen Teams gibt`s sicher tausende in Europa.\nAlso muss man sich zumindest auf Master spielen. Ich denke mal, dass es da tausende von solchen Teams gibt?\nUm Herausforderer zu werden, m&uuml;sste man wohl wirklich nur von League leben, sprich dieses Spiel als seine Lebenseinstellung ansehen, so wie das Froggen oder Faker schon seit einigen Jahren betreiben. In meinem Team haben die alle einen Fulltime Job und die j&uuml;ngsten sind sie auch nicht mehr. Von daher wird`s mit dem Herausforderer mal sicher nichts, ausser es geschehen Wunder. Im Team ist ja vieles m&ouml;glich.\n\nWir ben&ouml;tigen auf alle F&auml;lle einen dementsprechenden Coach. Da bin ich zur Zeit auf der Suche. H&auml;tte einen Platin II Coach, welcher schon ein Master Team trainierte, doch dieser hat wegen Bildung zur Zeit nicht die n&ouml;tige Energie. Aber da wird sich schon ein f&auml;higer Typ finden, dessen bin ich mir gewiss. Es gibt ja schliesslich genug Leute, die League von Anfang an zocken und schon alles gesehen haben, jedes Item und was wei&szlig; ich nicht alles kennen...\n\nMeine Frage w&auml;re nun auch, wie f&auml;ngt man an?\nESL und LCS stehen in Verbindung. Das bedeutet, wenn die LCS auf die ESL zur&uuml;ck greift, ist die ESL wohl als st&auml;rkste Liga Seite in League anzusehen. Es g&auml;be da auch noch die A1 League Liga, seit neuestem gegr&uuml;ndet, bei welcher das Sieger Team anscheinend 10.000 Euro einheimsen kann. Aber okay, da geht`s eher um das permanente pr&auml;sent sein.\n\nLast but not least geht es bei einem Pro Clan ja darum, den oder die passenden Sponsoren zu finden, welche den Schotter bringen. Klar, mit Merchandising kann man auch einiges bewegen. Ist im Prinzip das selbe System, wie bei einem Fu&szlig;ball Verein.\n\nMich w&uuml;rde halt vor allem interessieren, wie man es in dieser Hinsicht am besten angeht. Leider ist die ESL Seite in punkto usability immer noch grottenschlecht. Bis man da durchblickt. Soviel Zeit hatte ich die letzten Tage nicht, um mir das alles alleine anzueignen und darum wollte ich nett fragen, ob mir vlt. jemand er&ouml;rtern k&ouml;nnte, wie es da um das Aufstiegs System steht?\n\nZu allererst war ich ja am &uuml;berlegen, selbst eine LCS zu erstellen, sprich in 1on1 Format, nur steht eben kein namhaftes Unternehmen wie Riot hinter mir, was die Sache wohl etwas erschweren w&uuml;rde. Solch ein bombastisches j&auml;hrliches Event zu erstellen kostet viel Schotter und damit steht und f&auml;llt alles. Damit f&auml;ngt der Fame vor allem erst an, welcher wirklich einen Weltkonzern sozusagen zum Vorschein bringt.\n\nDachte mir dann, ich schaue im Ranking und schreibe alle deutschsprachigen Master Accounts an, ob sie f&uuml;r 3250 RP pro Monat f&uuml;r mich spielen w&uuml;rden. Da finden sich bestimmt 5. War mir aber zu aufw&auml;ndig. Fakt ist ja, dass eigentlich so gut wie kein Master mit League Geld verdient, ausser er streamt, coacht oder nennt sich Youtuber und auch da muss man erst einmal erfolgreich sein und sich von Massen absetzen.\n\nW&auml;re &uuml;ber Tipps dankbar.\nDanke! \n\nMfg Critamere1980","replies":[{"poster":"Critamere1980","date":"2018-08-10T13:27:08.047+0000","up_votes":2,"down_votes":0,"body":"Hallo RB Zubat,\n\nna, das lobe ich mir mal. Hut ab! :-)\nGibt zwar viele Trolle im Forum, vermutlich sehen mich manche als solchen an, aber zum Glück gibt`s immer wieder Leute wie dich. Hat mir schon ziemlich geholfen das ganze.\n\n\nAlso ich zocke seit gut 2 Jahren. In dieser Zeit hatte ich 4-5 größere Pausen, von einigen Monaten. Mit meinem erfolgreichsten Smurf, erreichte ich nach den 10 Ranked Games Gold II in der Solo Q. Spielte mit Rengar only. Dank der Letsplayer wie Mrmaikap, Slipi und Konsorten, habe ich mir die Mechanik von Rengar in Custom Games angeeignet und immer wieder trainiert, bis ich dachte, dass ich nun gut genug bin. Das waren ca. 150 Spiele. Wollte selbst auch sehen, wie weit ich komme. In punkto Map Awarness, IQ-Gaming an sich, wenn man das so sehen möchte, sehe ich mich ganz weit vorne. Aber klar, es gibt noch einige Champs, welche ich nicht einmal angespielt habe, wie Kalista, die 2 \"neuen Geschwister\" auf der Bot Lane, Talon, etc. Okay, die Fähigkeiten von Talon kenne ich natürlich, aber es sind da immer wieder Situationen, welche ich nicht dementsprechend einschätzen kann. Erst letztens zerlegte mich ein Nasus und ich hatte dann 2-3-1 Stats. Diese gute Stats, obwohl ich auf der Lane total versagte, lag daran, dass mein Jungler 2 mal ordentlich gankte. Da passte einfach alles. Nach 10 Minuten hatte Nasus nur rund 60 Farms, so wie ich als Trynda.\nVersuchte natürlich, sein Q Stacking zu vermeiden. Aber schon nach 60 Farms verursacht er ziemlichen Schaden an Trynda und mit seinem Slow ist es sogar für mein E sehr schwer, ihm da zu folgen. Er wich also immer aus und wenn er angriff, konnte mich meine Ulti kaum noch retten. Also mir fehlts sogesehen am Spielverständnis, bezogen auf Champions. Mir ist natürlich bewusst, dass es viele Leute gibt, die das Game von Anfang an zocken. Viele langzeit Studenten, arbeitslose und und und, welche täglich 10-12 Stunden zocken und League zu ihrem Lebensinhalt gemacht haben. Ich merke es ja nun am neuen Smurf. Zocke relativ oft gegen Leute, welche nach 10 Minuten schon auf 90 Farms sind. Also das ist definitiv höher als Gold Skill, weil die holen sich fast jeden Farm.\nHabe aber auch keine Ambitionen gut zu sein. Dafür bin ich schon zu alt und der Rücken ist zu lediert. Mein Lebensinhalt besteht da schon seit langer Zeit aus Sport, etc.\n\nWegen der RP\nIch kenne das von mir selbst. Obwohl ich finanziell betrachtet mehr als gut situiert bin, fiel es mir immer schwer, Geld für mein Hobby auszugeben, um mir meinen Skin oder Champ zu kaufen. Habe auf meinem Main Account 150 Euro investiert, aber sonst war ich schon recht sparsam.\nDarum dachte ich auch daran, dass es eine gute Idee wäre, monatlich pro Spieler 3250 RP springen zu lassen. Klar es ist nicht viel, aber immerhin ein kleiner Ansporn und so tief in der Materie bin ich zumindest drin, dass ich eben weiß, so wie auch du geschrieben hast, wird wohl keiner dieser Dia jemals Master. Selbst wenn sie Master würden, gäbe es davon immer noch tausende in Europa?\nDas bedeutet, keiner von denen wir in ihrem Leben nur einen müden Cent sehen. Ich weiß aber, dass Leute ab Dia II herum denken, sie wären das non plus ultra und der Durchbruch steht kurz bevor. Klar, Ausnahmen bestätigen die Regel. Darum dachte ich mir, ich suche mir ein bestehendes Team ohne Manager, welches hohes Platin oder niedriges Dia ist. Das ist mir auch geglückt. :-)\n\nMir ist natürlich bewusst, dass es schon das non plus ultra ist, wenn wir mal Master im Team Ranking werden, aber ich denke trotzdem, dass man mit einer guten Brand auch ein Semi Pro Team aufbauen kann. Aber klar, einfach ist das ganze sicher nicht. Können gern mal in game quatschen und auch mal telefonieren. Vlt. wärst du ja der ideale Coach, welchen wir benötigen. :-)\n\nDachte auch schon nebenbei an eine 5on5 semi Pro Liga. Sollte zwar etwas total eigenständiges sein, aber dennoch Liga Charakter haben. Semi Pro Teams gibts ja wirklich kaum in League. Entweder sie packen es in die LCS oder das wars. Ich denke es gibt genug Zuseher, welche auch an solch einer Semi Pro League Interesse hätten.\n\nWenn ich das ganze mit Warcraft 3 vergleiche...\nKlar, damals war Esports noch nicht so weit wie heute, aber in Warcraft war die Community meines Erachtens deutlich intensiver, wenn auch nicht größer. Es gab jährlich Weltmeisterschaften. In League gibt`s sowas nicht. Da zocken nicht die fünft besten Deutschen gegen die fünf besten Schweden. :-)\nGenau sowas wollen die Leute sehen, denn das kennen sie vom Fußball und von der Sport Welt generell.\n\nEs sollte auch mehre Ligen geben. Also eine Semi Pro Webseite, Portal, wie auch immer man das nennen möchte, könnte durchaus Anklang finden.\nIch lasse mir da noch einiges offen. :-)\n\n\n\nMfg Critaemere1980","replies":[{"poster":"RB Zubat","date":"2018-08-10T22:33:42.645+0000","up_votes":1,"down_votes":0,"body":"Sicher, adde mich einfach Ingame auf dem Account auf dem es dir am besten passt und wir können uns gerne mal ausführlich unterhalten. Alternativ erreichst du mich auch auf Discord (RandyofCintra#4767)\n\nGanz kurz zu der Situation an Ligen und Turnieren für Amateur / Sempro Teams: Das war sogar tatsächlich mal besser als es jetzt ist. Ich glaube die Abschaffung von Teamranked (früher konnte man sich über Teamranked sogar für die Challenger Series qualifizieren) ist viel an Teamkultur in League of Legends verloren gegangen und es gibt heute erstens deutlich weniger Teams, zweitens aber auch deutlich weniger Aktitvitäten die Teams wirklich zusammen halten. Da hat Riot, das muss man ganz ehrlich sagen einfach ziemlich großen Mist gebaut - und  mit einen der Hauptgründe für meinen Ausstieg damals geliefert, denn das Spielen im Team war für mich einfach stets die Königsklasse von League. \n\nDu hast einen ganz guten Punkt genannt: Mit einer guten Brand ein Sempro Team aufbauen. Vielleicht könnte man da wirklich was machen. Eine großartige Idee (die auch eine Nische füllen könnte, die im Moment GAR NICHT bedient wird), wäre es alles was das Team zusammen macht aufzuzeichnen und auf YouTube Formate dazu zu bringen. Es gab zwar Ansätze in die Richtung, wie zB. Spandauer Inferno, das Projekt war allerdings irgendwo immer ziemlich trolllastig und mehr zur Unterhaltung. Ich glaube das hätte EINIGES an Potential wenn e wirklich gut umgesetzt wäre und wie bereits gesagt es gibt quasi alles an Content auf YouTube, aber so etwas habe ich noch nie gesehen. Man könnte zum Beispiel die Trainingseinheiten / Turniere streamen (Ghostinggefahr, aber damit müsste man dann halt leider leben ) und parallel Formate auf YouTube machen, die in die Richtung TSM Legends (Beispiel: [https://www.youtube.com/watch?v=EfZjxLlklhI](http://Beispiel)  ) gehen. Außerdem könnte man damit parallel auch die Liga, die du möglicherweiße gründen möchtest promoten !","replies":[{"poster":"Critamere1980","date":"2018-08-19T22:28:00.818+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\nwar jetzt einige Zeit weg von League. Hätte zwar gut ausgeschaut, mit einem Team, leider ging da nur nichts weiter. Es war also doch nicht wirklich viel Motivation vorhanden. Von den 4 Spielern hatte ich nur mit einem Kontakt. Die anderen drei hatten anscheinend nicht wirklich Bock. Hätte dann ein Tryout mit einem Dia 1 mit 60 LP gegeben, nur kam das irgendwie nach Tagen auch nicht zustande. Tjo, war halt ein Test. Test ging fail. 2850 RP pro Monat sind zu wenig Ansporn.\n\nHabe dann eine Art Portfolio aus den Füßen gestampft und einige namhafte Unternehmen zwecks Sponsoring kontaktiert. Es sieht gut aus. Ein sehr namhaftes Unternehmen erklärt sich evtl. bereit, 400 Euro monatlich zu sponosren. Das war genau die Summe, um welche es mir ging. 50 Euro monatlich pro Spieler, ebenso 50 Euro für den Coach und nochmals 50 für die Moderatorin auf Twitch. Die übrig gebliebenen 50 Euro monatlich werden gespart, damit das Team 1-2 mal ordentlich auf einem realen Event abliefern kann. Das ist natürlich sehr wichtig, da viele der Medien-Leute in dieser Nische genau auf solchen Events sind.\n\nAusserdem habe ich über deinen Text längere Zeit nachgedacht und ich muss dir wohl beim Kernpunkt Recht geben. Darum suche ich nun auch 5 Master/Challenger Spieler, welche Bock haben.\n\nCoach wird ebenso noch gesucht. Die Moderatorin, eine halbwegs bekannte Frau auf Twitch in punkto League hat schon ihr Interesse mitgeteilt. Das dauert zwar noch alles, aber es sieht gut aus. Ist halt ein langer Weg, welcher gut durchdacht sein muss.\n\n\nWie ich das sehe, gibts 0,02% Challenger, sowie 0,03% Master. Das sind dann doch einige, die auf total hohem Niveau spielen. Wie hoch der Unterschied nun zwischen Challenger und Master ist, kann ich selbst schwer eruieren. Ich denke das es da im Solo Q schon auch eine Rolle spielt, ob man alleine als Top Laner agiert oder ob man mit einem jahrelang eingespielten Jungler auftrumpft.\nLiegt halt wohl nurmehr an den Feinheiten. Mechanisch ist wohl jeder perfekt. Map Awarness wirds wohl sein. Sich in diversen Situationen nicht rein baiten lassen, kühlen Kopf bewahren, also mannerd sein.\n\n5 solche Spieler suche ich. Einige haben deutsche Accounts. Wir sind also gut vertreten. Habe auch schon ein paar in game eingeladen und kaum einer verdient damit Geld. Ein paar wenige wären eventuell interessiert, teilweise auch Challenger. \n\nWie ich das sehe!\nEs gibt zwei Arten, wie man in League wirklich Geld verdienen kann.\n1.) Streamer, Youtuber, Train hours etc. <= Das packen aber nur die allerwenigsten. Sind wohl prozentuell auch nur 0,01%, die damit erfolgreich agieren. Die Konkurrenz ist einfach zu groß. Ich gucke selbst selten aber doch Mrmaikap, LessQQ, Slipi und The Gracierr.\nMuss dazu sagen, Gracierr machts mit Abstand am professionellsten. Der englischsprachige Markt ist halt dann doch noch einmal eine ziemliche Schippe schwieriger und bei den Views vom Gracierr kann man schon davon ausgehen, dass der wirklich viel damit verdient. Maik hingegen verliert nonstop an Besuchern. Ich guck selbst kaum noch, da mich die sup Position am wenigsten interessiert und auch am uninteressantesten zum zuschauen ist. Würde er nur hardcore mit Ziggs und kA noch einem Champ versuchen, so hoch wie möglich zu ranken, hätte er wohl wieder viel mehr Besucher. \n2.) LCS Pro Clans. 4000 Euro monatlich durch Riot + keine Ahnung, eventuell Kohle vom Clan durch diverses Sponsoring, Merchandising, Events, etc. Die LCS begrenzt sich auf 10 Teams, somit cashen 50 Spieler ab.\n\nFazit\nVon all diesen Master und Challenger Spielern gibt es nur 50, die damit wirklich Geld verdienen.\n99% der Youtuber, Twitcher etc. sind Platin oder Dia.\nGibt dann sicherlich noch ein paar ganz wenige Ausnahmen, die es irgendiwe schaffen, damit Kohle zu verdienen. Es gibt ja doch einige Seiten, auf welchen was weiß ich was angeboten wird, train hours etc., aber 99% dieser Master und Challenger verdienen damit keinen Euro, auch wenn sie es anstreben würden. Sie schaffen es einfach nicht, weil es so schwer ist.\n\nSumma Summarum\n50 Euro monatlich müssten durchaus ausreichen. Das sind ja immerhin 600 Euro jährlich. Obendrein gibt es im Idealfall logischerweise die Möglichkeit, auf jeder Ebene mehr zu erreichen.\n\n\nMein Grundgedanke\nFür die LCS wird es natürlich nicht reichen. Mein Ziel wäre es, wenn das Team vom Skill her auf Master oder im besten Fall auf Challenger Niveau kommen würde und wir eben durch unsere Spielweise samt Accounts, Manner, Skins, usw. auf Pro Niveau gelangen. Unsere äußerst professionelle Moderatorin würde 2-3 Spiele wöchentlich auf Twitch moderieren. Der Haupt Sponsor willigt, wenn er es denn tut, auch nur auf Grund dieser Basis ein, dass nach einem Jahr die unique visits stimmig sind. Wenn nach einem Jahr nur 300 Leute zuschauen, wäre das für den Sponsor nicht wirklich sinnvoll. 3000 wäre natürlich schon etwas anderes. 30.000 wäre bombastisch. 300.000 galaktisch. \n\nIch werde dich in den nächsten Tagen in game einladen. Sowas wie Discord nutze ich nicht. :-)\n\nMfg Critamere","replies":[]}]}]},{"poster":"RB Zubat","date":"2018-08-10T01:13:35.884+0000","up_votes":2,"down_votes":0,"body":"Hallo Critamere,\nzunächst mal finde ich es toll, dass du in der competitive scene von League Fuß fassen möchtest. Allerdings hast du wohl - und da sind dir die Manager, die sich aktuell in den Proteams tummeln wohl aktuell noch den entscheidenden Schritt voraus wohl wenig know how über die Szene in die du dich da begibst. Falls das hier dein Main Account ist, dann bist du Level 8, hast also keine Erfahrung darin wie es ist selbst in einem ambitionierten (Amateur-) Team zu spielen, viele der Manager (s. zB Ocelote, Regi etc.) haben lange selbst gespielt und sind daraufhin als Manager tätig geworden. Natürlich mussten sie sich dafür das Know how aneignen, allerdings kannten sie von vorn herein die Szene. Dir fehlt genau der entgegengesetzte Part. Das heißt du kannst dir nun entweder eine vertrauenswürdige Person suchen, die das ausgleicht und das ganze mit dir aufziehen möchte, oder selbst die Initiative ergreifen und dir das fehlende Wissen aneignen. Ein unhandliches System wie das der ESL zu durchschauen ist da noch dein kleinstes Problem. (Achtung Wall of Text incoming, aber habe einfach großes Interesse an diesem Bereich)\n\nMit einigen Aspekten, mit denen ich in deinem Post nicht konform gehe möchte ich nun direkt mal aufräumen:\n- Zunächst mal zu deinem aktuellen Team: Wie du bereits erkannt hast, hat vermutlich keiner der Spieler, die du da an der Hand hast auch nur ansatzweise was es benötigt Progamer zu sein. Zunächst mal fehlt natürlich vermutlich das Talent. Ich selbst war in Season 5/6 zum Teil mittleres Diamond im Alter von 19 Jahren. Hätte ich in Season 5 und nicht in Season 3 angefangen hätte man da eventuell noch Potential erahnen können. Aber weißt du was passiert ist? Genau, ich bin an diesem Punkt gepeaked und habe mich nicht weiter verbessert, bis ich frustriert war und eine lange Pause eingelegt habe. Ich hatte niemals das Zeug dazu Progamer zu werden, oder auch einfach nur Master / Challenger (mit einem ausreichenden Championpool zu erreichen). \n\nDie Talent Sache ist allerdings nicht der einzige Aspekt der einen Progamer ausmacht: Vieles, sehr vieles hängt auch mit der Attitude zusammen. In meiner aktiven Zeit war ich stets auch in Teams und die Dynamik unter Jugendlichen und jungen Erwachsenen ist extrem schwierig. Wenn man das ganze ernst nimmt hängt man täglich stundenlang zusammen und muss menschlich miteinander auskommen. Ich würde sagen von den Leuten die vom Talent das Zeug zum Pro haben, ist wieder nur ein kleiner Teil davon in der Lage langfristig in einem Team zu spielen, ohne komplett durchzudrehen. Es ist wirklich schwieriger als es sich anhört. \n\nDemzufolge kannst du dein aktuelles Team vermutlich in Sachen competitive Gaming komplett vergessen. Klar ein paar kleinere Turniere kannst du mit den Jungs gewinnen, aber sobald es auch nur gegen die stärksten Teams im nationalen Bereich geht werdet ihr kein Land sehen. Zumal die ganze Geschichte auch ein enormes Commitment verlangt, dass wohl kaum einer deiner Spieler (alle mit Vollzeitjob) eingehen wollen wird. \n\n- Dann zu der Coaching Sache die du erwähnt hattest: Ja ihr braucht einen Coach, eher sogar einen kompletten Coaching Stab. Allerdings hab ich das Gefühl, dass du dabei nach den falschen Kriterien vorgehst was die Suche angeht. Zunächst einmal, die SoloQ Elo des Coaches ist komplett egal. Ob der Typ Bronze oder Challenger ist interessiert keinen, ob er das Game selbst (noch) aktiv spielt interessiert auch keinen, solange er das Knowledge hat, die Spieler erreicht und weiß an welchen Schrauben man drehen muss damit das ganze System funktioniert ist alles in Ordnung. Und damit ist nicht gemeint, dass er alle Items kennt etc. Ich hatte weiter oben Reginald von TSM erwähnt (eigentlich der Manager). In der Vergangenheit ist er öfter in für das Team kritischen Situationen in eine Art Coaching Position geschlüpft und obwohl sein Wissen über das Spiel zu dem Zeitpunkt ein wenig eingestaubt war hat er quasi stets die richtigen Worte, oder den richtigen Ansatz finden können um das Team da rauszuholen. Er hat allerdings ein sehr gutes Grundverständnis vom Spiel, nicht dass ich sagen möchte dass du das auch können MUSST, es geht mir hier nur darum zu veranschaulichen was ein Coach leisten kann und welche Soft/Hardskills er mitbringen muss. Darüber hinaus haben quasi alle ernsthaften Teams auch noch einen Analysten, der sich Replays anschaut und detailliert auf Fehlersuche geht. Oft steht er nicht im direkten Kontakt mit dem Team, sondern seine Erkenntnisse werden über den Coach (Vertrauensperson) an das Team weitergeleitet. Wie das geregelt wird, muss das Team allerdings selbst wissen, ich denke da gibt es nicht den einen richtigen Weg.\n\n-Dann diese Geschichte mit der eigenen Liga: Als erstes 1v1 interessiert keinen Mensch. 5v5 Summoners Rift, das ist Competitive League- PUNKT. Kein twisted treeline, kein dominion, kein ARAM. Auch lohnt es sich nicht eine eigene Struktur zu schaffen, außer dein Ansatz ist eine erfolgreiche (Sempro) Liga aufzubauen (was League sicher nicht schaden würde), aber ich dachte dein Ziel sei es ein Team aufzubauen, ich sehe nicht wo dich das dort weiterbringt.\n\n- 3.250 RP / Monat: Nein, einfach nein. Erstmal interessieren RP niemanden, von RP wird man nicht satt. Wenn du möchtest das Spieler ein extrem großes Commitment eingehen und sich eventuell Chancen in ihrem Leben verbauen für die Chance Progamer zu werden, dann biete ihnen eine vernünftige Basis. Wenn du ein gutes Team aufbauen kannst, dass es zunächst mal auf nationaler Ebene schafft etwas zu erreichen, dann sind auch Sponsoren kein Problem mehr und du kannst dem Team diese Basis bieten. Natürlich gibt es unendlich Spieler, die für 3.250 RP im Monat stundenlang zocken würden (ich meine es gibt genug die das komplett umsonst machen), aber wenn es gut werden soll, dann muss an irgendeinem Punkt Geld mit ins Spiel kommen. Zumal deine talentierten Spieler, die du natürlich behalten möchtest, sonst einfach weg sind, sobald ein besseres Angebot kommt (und das wird es).\n\nAber jetzt zu deiner eigentlichen Frage, bzw \"wie geht man das ganze am besten an\":\nNatürlich habe ich selbst noch nie als Manager ein Proteam aufgebaut und hab deswegen die 100%ige Antwort auf diese Frage nicht auf Lager (falls es diese überhaupt gibt), aber ich kann ja mal einige meiner Gedanken mit dir teilen\n\n1) Zunächst einmal wie bereits oben erwähnt wirst du mit deinem aktuellen Team nichts \"großes\" erreichen. Natürlich kannst du die Truppe noch weiterhin aus Spaß / Nettigkeit weiter betreuen, aber wenn du wirklich in dem Bereich durchstarten möchtest dann solltest du über kurz oder lang ein neues Team suchen. Dein Netzwerk kann dir dabei helfen. Du solltest dich mit 1-2 erfahrenen Leuten zusammen tun, die dich dabei unterstützen, eventuell ist der Coach nicht der Teil des Teams den man als letztes, sondern den , den man als erstes suchen sollte - immerhin brauchst du auch jemand der die Leistung der potentiellen Spieler bewertet. Danach wäre es sinnvoll Tryouts abzuhalten. Wichtig ist es darauf zu achten, dass die Spieler nicht nur das Talent haben, sondern auch wie bereits oben erwähnt die Attitude. Es wird leichter, wenn man das ganze bspw mit einem Spieler der bereits Erfahrung in den obersten nationalen Ligen hat aufzieht, denn mit jedem Teammitglied, dass bereits steht wird es leichter den Rest des Teams zu füllen. Wichtige Kriterien sind zunächst mal natürlich eine hohe SoloQ Elo (auch über einen längeren Zeitraum), ein ausreichender Championpool (egal in welcher Meta, siehe wie einige ADCs in der LCS angefangen haben zu strugglen, als auf der ADC Position Bruiser gespielt wurden, das kann man ganz leicht umgehen), und zuletzt, dass die Spieler auch bereit sind viel Zeit in das Projekt zu investieren. Um den Spielern einen Fulltime Job anzubieten wird vermutlich erstmal das Kapital nicht reichen, deswegen sind Studenten, die das nebenbei machen können und so auf einen Neben/Ferienjob verzichten können ideal.\n\n2) Nebenbei ist es natürlich auch wichtig eine Marke aufzubauen und hier ist dein Netzwerk ebenfalls extrem hilfreich. Ein Grafiker ist da vermutlich nicht wegzudenken. Wie genau man eine Marke aufbaut, darüber weißt du vermutlich deutlich mehr als ich.\n\n3) Dannach kommt der schwierigste Teil, das Team muss zu einem wirklichen \"Team\" werden. Bis zu einem gewissen Punkt (in Sachen Skill) kann man natürlich einfach FlexQ spielen, aber die ist für ein Master / Challenger Team quasi komplett irrelevant. Hier ist es unabdingbar Scrimgegner (andere Teams mit ähnlich hohen Level) zu suchen und gegen diese anzutreten. Dazu dann natürlich Turniere und Ligen der ESL, um sich dort hochzuarbeiten. Vermutlich wird es auch in dieser Phase ordentlich Steine geben die im Weg liegen, das heißt Spieler werden das Team für bessere Angebote verlassen etc. Darauf müssen dann immer Lösungen gefunden werden. \n\nIch hoffe ich konnte vielleicht ein paar Anregungen geben. Viel Erfolg bei deinem ambitionierten Vorhaben, würde das ganze auf jeden Fall gerne verfolgen, wenn du mir verrätst wie :)\n\nGrüße\nRB Zubat","replies":[]},{"poster":"MeMyselfandBaal","date":"2018-08-20T01:12:04.152+0000","up_votes":1,"down_votes":0,"body":"warte, was? League wir Olypmisch? also laut meinen Quellen frühestens 2024... Also genau dann, wenn League als eSports irrelevant geworden ist. Und vor allem definitiv nach unserer Zeit. Und dann auf nem 4 Jahre alten Patch... Yeah!\n\nAn sonsten würde ich dir empfehlen, dich mit Organisationen wie (gerade die) dem ESBD, die UEG-Liga und DESBL zu beschäftigen... aller Wahrscheinlichkeit nach (falls die ESBD Liga wirklich kommt... ups... durfte ich das gar nicht sagen? Misstrauensvotum) spielen die Spieler, die du ansprechen willst, bereits in einer dieser Ligen. \n\nUnd die Frage, wie man von dort zum King of Spandau (for the fame), der ESL (die sind ESBD Mitglied und Semi-Professionell) und der Premier Tour (was das eigentliche Fernziel sein sollte) ist die eigentlich spannende Frage. Da aber jeweils Anschluss zu finden, dürfte sinnvoller sein, als eine eigene Liga mit jemanden, der als Caster vielleicht zusagt, zu planen...\n\nUnd ja, da entwickelt sich gerade wirklich was. Ich kann jeden, der sich mit der Weiterentwicklung des eSports in Deutschland beschäftigen will, nur den ESBD empfehlen, da sitzen ein paar richtig clevere Leute... Unter anderem der Mann, der mit zu verantworten hat, dass es der Deutschen Basketball-Liga so gut geht, wie es der mittlerweile geht... also wirklich clevere Leute... und das sage ich nur nur, weil ich letztens 2 Stunden mit dem Präsidenten gequatscht habe... allein schon, weil ich da gar nicht wusste, dass der das ist...\n\nWenn du mit dem ganzen Buchstabensalat nichts anfangen kannst... Die zahlen mir halt alle nichts, deswegen verlinke ich die auch nicht....","replies":[]},{"poster":"Critamere1980","date":"2018-08-09T21:04:11.796+0000","up_votes":1,"down_votes":1,"body":"\"schlecht machen - aber für\"???? bitte...\n\nDas hat mit deutscher Rechtschreibkunst genau null zu tun.\nSubstantive wie das Wort Ernst, schreibt man übrigens groß.\n\n\nDafür ist mir meine Zeit jedenfalls zu schade. Immerhin wird es dich freuen, dass ich Dir geantwortet habe. Dazu tendiere ich zumindest!\nAlles gute!","replies":[{"poster":"Enkininerak","date":"2018-08-09T21:57:23.785+0000","up_votes":1,"down_votes":0,"body":"am Handy getippt (dieses posting auch) - alles gut, fühle Dich bitte nicht angegriffen - ich sehe nur nicht viel Licht auf diesem Markt - riot schöpft die Formate ab und Versuche mit 1vs1 gab es bereits - Du kannst ja ausprobieren ob Du über diverse Streamer Kontakte zur Masterplayerbase generierst. Dein Team ist einfach zu alt um da noch mitzumischen, das funktioniert nicht einmal um eine  Teammarke zu etablieren die nach und nach mit stärkeren Spielern besetzt wird. Versuch vl. junge Wilde einzufangen und damit durchzustarten. Gutes gelingen (<-- ernst gemeint)","replies":[]}]},{"poster":"Enkininerak","date":"2018-08-09T20:32:24.761+0000","up_votes":1,"down_votes":0,"body":"Sorry, ich will dich nicht flamen oder schlecht machen - aber für einen Werbeexperten wirkt dein Schreibstil nicht sehr elaboriert, dies wäre - evtl. mit zusätzlichem coaching - durchaus mein erster Tipp an dich um ernst genommen zu werden. Ich wünsche Dir auf jeden Fall viel Erfolg bei Deinem Vorhaben - go for the dollars ;) !","replies":[]}]}