{"poster":"Capoz","date":"2015-07-27T13:13:31.400+0000","title":"Pillole di rito :'D","subforum":"Discussioni generali","up_votes":4,"down_votes":18,"body":"Secondo studi scientifici svolti dalla riot gayms, e dopo numerosi esperimenti in laboratorio per gli accertamenti, si &egrave; arrivati a una conclusione:\r\nSe in una partita, sia essa ranked o normal, c&#039;&egrave; un troller 0/10 e TU PLAYER lo flammi, sei TU PLAYER a rovinare l&#039;esperienza di gioco degli altri, non il troller\r\n Ancora una volta, la rito ci regala queste perle *.*","replies":[{"poster":"Riot DanielSAN","date":"2015-07-27T18:19:38.122+0000","up_votes":18,"down_votes":2,"body":"Proprio non ce la fate, eh? Avere uno in squadra che trolla non vi da un lasciapassare per insulti. Finite la partita, lo segnalate e fate una pausa o un ARAM. \nSo che scoccia, soprattutto in coda classificata, soprattuto in promozione, ma nulla vi autorizza ad insultare la gente. \nSe proprio non ce la fate a tenervi tutto dentro, cacciate un urlo, ma non lamentatevi se vi segnalano per linguaggio offensifo se flammate. Feeder o troll, siete nel torto anche voi.\n\n\nEsempio pratico: io mi sono beccato un Nunu 0/34/0 in ranked la scorsa stagione. In chat non gli ho scritto nulla se non \"smettila, perfavore\" e a fine partita l'ho segnalato. Mi ha fatto incazzare? Sì, tanto, ma visto che insultare un troll è come buttare benzina sul fuoco, ho evitato. Lo fanno per farvi innervosire. Fate finta di nulla e segnalate. Siate superiori.\n\nPer la cronaca i report di un Rioter valgono come quelli di un giocatore normale per il sistema, stessa cosa per quelli ricevuti.","replies":[{"poster":"kirchhoff","date":"2015-07-27T18:23:22.773+0000","up_votes":6,"down_votes":0,"body":"amen","replies":[]},{"poster":"Firenheit","date":"2015-07-27T19:26:39.566+0000","up_votes":4,"down_votes":5,"body":"Daniel, qui bisogna punire più pesantemente chi trolla. Costantemente, in ogni modalità di gioco trovo persone che vanno mad e iniziano a fare le peggio cose, costantemente chi \"flamma\" si becca punizioni. E se li beccano anche se non scrivi \"parolacce\". \nHo incontrato persone, in rank e non solo, più volte di fila che hanno trollato tutte le partite e non è stato punita UNA volta. Come lo so? Nessun messaggio \"ei, abbiamo punito\" e semplicemente li ho reicontrati. -15 punti sono ininfluenti per la stagione? Vero, ma non 15 oggi 15 domani. Qui bisogna tutelare chi gioca e punire chi fa arrabbiare, non chi si arrabbia. Nonostante i -8 che stanno per arrivarmi, è questo che voi alla Riot non capite. Sai benissimo che quando una cosa mi piace te lo dico, così come ciò che non mi piace. E' impossibile incontrare un 0 8, 0 20, 0 90. E le cose sono due: il matchmaking funziona a schifo o le punizioni funzionano a schifo. Iniziare a dare partite non computate e/o la restituzione dei punti in caso di troll o AFK, o addirittura permettere di guadagnare punti in base alla prestazione personale. La gente se ne approfitta? Sicuramente si, ma preferisco questo per perdere partite su partite perché gioco con troll, AFK ecc. E' solo un game? Non deve esistere neanche uno e nel caso avvenga, devo essere tutelato e chi trolla deve essere punito. Al primo game, immediatamente.\n\nE visto che ci sono, nelle punizioni, dovete mandare il game, con le frase evidenziate che hanno certificato la punizione. Adesso recentemente ho avuto una punizione e non mi sono lamentato, ma non so neanche per cosa! Reportato da un premade in un game in cui ho scritto una cosa, mi è arrivato l'avviso e il giorno dopo le chat. E' solo per quella frase: \"rimango in base\" mentre il nexus esplode o per altro? Non mi lamento della punizione, ma, voglio, leggere, e, vedere, le frasi, che, hanno, indotto, a, punirmi. Fino a quel momento ogni punizione data, sarà inutile, non serve a niente.\nChat ban? Me le gioco in co-op e posso benissimo trollare in game quanto mi pare.\nDraft? Un'atmosfera pessima, tutti alterati e infastiditi dal dover vincere.\nBan? Smurf. = Rovinare l'esperienza ai nuovi iscritti.\nLe punizioni, sono inutili Daniel. Queste punizioni qui, non servono a NULLA.","replies":[{"poster":"DanieleRC","date":"2015-07-27T21:16:25.657+0000","up_votes":1,"down_votes":3,"body":"http://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/GBsT1pOU-problematiche-varie-e-possibili-soluzioni\n\nTi voglio bene. \n\nIl problema è sempre e solo uno. Multiaccount.","replies":[{"poster":"Firenheit","date":"2015-07-27T21:37:15.102+0000","up_votes":1,"down_votes":0,"body":"Ban per Mac Address, non sarebbe difficile.","replies":[{"poster":"DanieleRC","date":"2015-07-27T22:02:40.123+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Firenheit,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=0006000400020001,timestamp=2015-07-27T21:37:15.102+0000)\n>\n> Ban per Mac Address, non sarebbe difficile.\n \n\nMeno $ per loro.. di cosa vogliamo parlare? :) Ci siamo capiti","replies":[{"poster":"Firenheit","date":"2015-07-27T22:39:39.442+0000","up_votes":1,"down_votes":4,"body":"Tanto prima o poi LoL passerà di moda, come è successo per\nSuper Mario\nPokémon\nTony Hawk\nMetin2\nNeed for Speed\nWoW\nCoD\nMineCraft\nDark Souls\nGTA.","replies":[{"poster":"Capoz","date":"2015-07-27T22:46:37.624+0000","up_votes":1,"down_votes":2,"body":"Si ma quelli che dici tu è la gente che smette di giocare di propria volontà, non perchè gli viene impedito di giocare o comunque non riesce a goderseli fino in fondo perchè c'è gente scema al mondo -.-","replies":[{"poster":"Firenheit","date":"2015-07-27T23:16:56.365+0000","up_votes":1,"down_votes":0,"body":"Non credo tu abbia capito ciò che voglio dire","replies":[{"poster":"DanieleRC","date":"2015-07-28T07:49:53.443+0000","up_votes":2,"down_votes":4,"body":"Con la loro stupida politica se la giocano in poco tempo la notorietà. Ok, attualmente LOL è il gioco più giocato al mondo. Ma parliamo di WoW? Quanti soldi c'ha fatto la blizzard? Lì le cose funzionano bene, nonostante la gente paghi oltre la Key, ogni mese 13 euro, loro addirittura PERMABANNANO persone per aver utilizzato bot e quant'altro.. Ultimamente hanno bannato in un solo rush oltre 600mila account, 600mila!!! Questa è serietà.. \n\nQui sembra quasi che loro tutelino il troll!! \n\nCaro DANIELSAN che dici a noi \"proprio non ce la fate\", io dico a te e a tutti coloro che TU RAPPRESENTI: \n\n\"Proprio non ce la fate eh?\" A capire che se c'è il flame, se c'è il nervosismo e tutto questo astio nei confronti di qualcuno, è proprio per via dei TROLL!! Il problema va risolto alla radice, noi flamer (me compreso, perchè m'incazzo abbestia) siamo la CONSEGUENZA di un problema che VOI NON SAPETE RISOLVERE. \n\nDei problemi vanno risolte le CAUSE non le conseguenze. Geniacci.","replies":[{"poster":"Capoz","date":"2015-07-28T11:00:21.052+0000","up_votes":2,"down_votes":1,"body":"Semplicemente perchè la blizzard SA che per avere i money in entrata la gente deve essere motivata.\nIo, non shoppo più da quando c'è stato il calo degli RP, se fosse stato normale, che senso ha che spenda soldi per una skin, se poi non posso godermela se c'è lo sfigato di turno che deve trollare?\nL'ambiente wow è PIU' PULITO e questo da ai player MOLTISSIMA sicurezza","replies":[{"poster":"DanieleRC","date":"2015-07-28T11:31:34.868+0000","up_votes":2,"down_votes":1,"body":"Volendo essere poco poco più drastico ti dico:\n\nSai che su Hots non esiste il ban per verbal abuse e neppure il report stesso ovviamente?\n\nQuindi la gente si offende come se non ci fosse un domani? \n\nLa risposta è no: Semplicemente se tu sei un troll, sei un coglione e basta, perdi tempo tu e lo fai perdere alla squadra, ti becchi eventualmente le offese (ma giuro che la chat non se la caca nessuno, GIURO), ma non puoi gongolare perchè i tuoi compagni vengono bannati per questo motivo. In pratica la Blizzard \"gli ha tolto lo spasso\" che è rappresentato dal ban stesso. Oltre il fatto di aver reso quasi del tutto ininfluenti le loro morti. \n\nIo gli insulti che ho letto e visto su lol non li ho visti mai nella stessa quantità e con la stessa cattiveria in nessun altro gioco online (e ne ho spese di ore davanti al pc eh).\n\nSon contento che almeno qualcuno capisca quello di cui parlo. \n\n+1 anche qui.","replies":[{"poster":"Capoz","date":"2015-07-28T11:36:55.879+0000","up_votes":2,"down_votes":1,"body":"In realtà su hots i report ci sono, ma con motivazioni diverse, più mirate;\nIl problema è che hots e lol hanno una cosa in comune: Il single player è svalutatissimo!\nSolo che Hots bilancia condividendo TUTTO tra i componenti del team (kills, exp, ecc) e quindi il \"feedato\" condivide il feed con i m8s, mentre su lol il team non vale una cippa, perchè su lol c'è SEMPRE rivalità anche nel team stesso! Perchè? per le solito cavolate come il \"KS\" -.- O il minion rubato dal support, o le ward (che tra l'altro quelli che si lamentano che i m8s non mettono le wards non fanno MAI l'upgrade del trinket), sono cose \"importanti\" si, ma non divoratevi l'anima -.- ","replies":[{"poster":"Dantazzo","date":"2015-07-28T11:40:52.232+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Capoz,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=000600040002000100000000000000000000000200000001,timestamp=2015-07-28T11:36:55.879+0000)\n>\n> In realtà su hots i report ci sono, ma con motivazioni diverse, più mirate;\n> Il problema è che hots e lol hanno una cosa in comune: Il single player è svalutatissimo!\n> Solo che Hots bilancia condividendo TUTTO tra i componenti del team (kills, exp, ecc) e quindi il \"feedato\" condivide il feed con i m8s, mentre su lol il team non vale una cippa, perchè su lol c'è SEMPRE rivalità anche nel team stesso! Perchè? per le solito cavolate come il \"KS\" -.- O il minion rubato dal support, o le ward (che tra l'altro quelli che si lamentano che i m8s non mettono le wards non fanno MAI l'upgrade del trinket), sono cose \"importanti\" si, ma non divoratevi l'anima -.-\n\nMirati mica tanto, manca quello per afk ad esempio (a meno che non lo abbiano messo con l'ultima patch).\nIl bello ed allo stesso tempo il brutto di Hots è che il singolo non vale una cippa, a me ad esempio questa cosa non piace ma ad altri piace, son gusti.","replies":[{"poster":"Dantazzo","date":"2015-07-28T11:51:05.528+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=DanieleRC,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=00060004000200010000000000000000000000020000000100000002,timestamp=2015-07-28T11:49:05.506+0000)\n>\n> bro, manca l'afk perchè, in modo del tutto geniale anche se non troppo efficace (essendo IA), l'afk viene sostituito da un bot entro pochi minuti. Quantomeno non si gioca in 4v5, ma in 4 e un bot vs 5.\n\nNon cambia molto tra un afk e quel bot XD","replies":[]},{"poster":"Dantazzo","date":"2015-07-28T12:32:16.789+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Capoz,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=00060004000200010000000000000000000000020000000100000017,timestamp=2015-07-28T12:30:28.172+0000)\n>\n> Ma se so che il gioco è pulito pago più volentieri\n\nNon era quello che intendevo, intendevo una cosa del tipo, quanti ne conosci che paghereberro solo per flammare e trollare?\nSecondariamente, ovvio che se uno paga un abbonamento il servizio deve essere di alto livello, altrimenti chiudi in un mese","replies":[]},{"poster":"Dantazzo","date":"2015-07-28T12:28:33.415+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Capoz,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=00060004000200010000000000000000000000020000000100000014,timestamp=2015-07-28T12:18:46.678+0000)\n>\n> E allora possiamo anche prendere d'esempio WoW, moooooooooolto più vecchio di LoL e gestito come si deve, semplicemente perchè si ha voglia di fare e perchè si sa di avere il DOVERE di fare.\n\nSì ma la piccola differenza è che Wow si paga.","replies":[]},{"poster":"Dantazzo","date":"2015-07-28T12:27:11.317+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Capoz,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=00060004000200010000000000000000000000020000000100000012,timestamp=2015-07-28T12:14:03.628+0000)\n>\n> Quando è stata l'ultima volta che su lol hai visto un rammus, o un taric, o anivia, elise, galio, kennen, kogmaw, singed, twitch o trundle? :/\n> Anche su lol girano sempre li stessi, solo che su lol ce ne sono più di 100 :/\n\nSì ma per farti capire, Vayne e Thresh hanno rispettivamente il 35% ed il 30% di popolarità, in pratica quindi sono in 1 partita su 3, Jaina e Kael'thas hanno il 74% ed il 69% di popolarità. Questa cosa è sicuramente dovuta in parte al fatto che Hots ha meno eroi ma soprattutto al fatto che gli eroi sono molto sbilanciati.","replies":[]},{"poster":"Dantazzo","date":"2015-07-28T12:10:55.310+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Capoz,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=0006000400020001000000000000000000000002000000010000000f,timestamp=2015-07-28T12:03:10.108+0000)\n>\n> Come hai detto tu, lol ha ANNI, hots ha MESI, se la riot non si sveglia a fare qualcosa di concreto mi sa che tra un pò di tempo ci ritroveremo tutti su hots per davvero. Non per fare hate sulla riot, il gioco è bello ma si è andati via via peggiorando. Anzi, non peggiorando, si è andati via via più pigri: i champ escono con un lasso di tempo incredibilmente maggiore, le modalità sono sempre quelle, SEMPRE, le partite sono rovinate dalla community infantile e la riot pensa di risolvere con messaggi preimpostati copia-incollati :/\n\nAppunto perchè Hots è un gioco giovane è più facile da gestire, ha molta meno utenza di Lol e richiama un pubblico più casual, quindi meno incline al flammare, se un giorno tutti coloro che giocano a Lol si dovessero spostare su Hots la situazione sarebbe la stessa che qua, che traparentesi io non vedo così tragica.\nSulle mappe e modalità sono scelte differenti, su Lol la mappa è sempre quella, quindi si favorisce la competitività ed ha molti più interpreti, Hots ha più mappe ma molti meno interpreti, e non lo dico perchè ci sono pochi champ, lo dico perchè trovo i champ di hots molto sbilanciati tra di loro. Per come piace a me un multiplayer trovo Hots molto più monotono, perchè nelle mappe ci sono sempre i soliti champ, Lol lo trovo più diversificato sotto questo punto di vista.","replies":[]},{"poster":"Dantazzo","date":"2015-07-28T12:02:35.399+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=DanieleRC,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=0006000400020001000000000000000000000002000000010000000c,timestamp=2015-07-28T11:58:45.686+0000)\n>\n> Io stesso preferisco LoL. Ma bisogna ammettere che su Hots hanno risolto parecchie problematiche. LoL ha delle dinamiche più complesse e affascinanti a parer mio, che però vengono immediatamente distrutte dal coglione che flamma per la mancata ss o ks, o dal troller di turno etc etc.. \n> \n> Messi su una bilancia, dopo 3 anni di LOL, (sarà che me lo sono un po' scocciato, o sarà che ne ho le palle piene dei bimbiminchia), sto preferendo Hots per svagarmi un po' senza stress nonostante sia un pelino inferiore come competitività e dinamiche!\n\nSecondo me appunto perchè è più semplice c'è meno flame.\nI troll invece secondo me sono meno per 2 motivi: \n1) Ci sono champ che sono loro stessi dei troll, come Fosky (main Fosky here)\n2) Essendoci meno competitivià il troll non prova lo stesso piacere a rovinare una partita di Hots, preferisce rovinarle in giochi più competitivi.","replies":[]},{"poster":"Dantazzo","date":"2015-07-28T11:56:40.476+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=DanieleRC,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=00060004000200010000000000000000000000020000000100000008,timestamp=2015-07-28T11:53:15.648+0000)\n>\n> fidati che il bot quantomeno picchia, usa le spell, e \"puoi ordinargli di seguirti\" quindi fare quel che fai tu.. L'afk sta fermo in base.. Meglio di nulla! :D\n\nSicuramente, però in generale un report per gli afk mi pare necessario, anche se probabilmente non c'è perchè hanno un sistema automatico pure loro.","replies":[]},{"poster":"Dantazzo","date":"2015-07-28T11:54:45.362+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Capoz,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=00060004000200010000000000000000000000020000000100000006,timestamp=2015-07-28T11:52:02.643+0000)\n>\n> sisi, su quello son d'accordo ma dall'altra parte della medaglia su hots non ti arriva addosso un 7/0 che ti shotta e tu ti ritrovi con un inutilissimo 0/7 che ha doran e spada lunga :/\n\nOvviamente, però lo preferisco così, son gusti alla fine, a me piace il gioco leggermente competitivo (non quanto uno starcraft ma con un pò di competizione) rispetto al gioco più casual.","replies":[]},{"poster":"Dantazzo","date":"2015-07-28T11:48:53.014+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Capoz,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=00060004000200010000000000000000000000020000000100000000,timestamp=2015-07-28T11:44:52.772+0000)\n>\n> No amico, io come \"singolo\" intendo proprio il player, non il feeding; \n> Cioè, se magari la partita è persa, ma io ho fatto un ottimo score, vinto la lane, ho comunque provato ad aiutare i m8 gankando (sia roaming che tp), prendendo i drakes, dando vision, queste cose alla fine non verranno prese in considerazione, verranno cancellate tutte e sostituite con la parola \"defeat\"\n\nSì ma quello che dico io è che in Lol hai la possibilità di battere il tuo avversario in linea ed in virtù di questo essere più forte e quindi incidere maggiormente nella partita, ad esempio se esci 6/0 dalla linea con katarina ci sono buone possibilità che carry la partita.\nSe invece esci 6/0 dalla linea con Jaina non cambia assolutamente nulla, al massimo avrai mezzo livello di vantaggio, ma tanto in Hots chi è dietro di livello prende più exp di chi è davanti, quindi ti rimontano ( e spesso superano) molto spesso.","replies":[]}]}]},{"poster":"Dantazzo","date":"2015-07-28T11:35:38.995+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=DanieleRC,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=00060004000200010000000000000000000000020000,timestamp=2015-07-28T11:31:34.868+0000)\n>\n> Volendo essere poco poco più drastico ti dico:\n> \n> Sai che su Hots non esiste il ban per verbal abuse e neppure il report stesso ovviamente?\n> \n> Quindi la gente si offende come se non ci fosse un domani? \n> \n> La risposta è no: Semplicemente se tu sei un troll, sei un coglione e basta, perdi tempo tu e lo fai perdere alla squadra, ti becchi eventualmente le offese (ma giuro che la chat non se la caca nessuno, GIURO), ma non puoi gongolare perchè i tuoi compagni vengono bannati per questo motivo. In pratica la Blizzard \"gli ha tolto lo spasso\" che è rappresentato dal ban stesso. Oltre il fatto di aver reso quasi del tutto ininfluenti le loro morti. \n> \n> Io gli insulti che ho letto e visto su lol non li ho visti mai nella stessa quantità e con la stessa cattiveria in nessun altro gioco online (e ne ho spese di ore davanti al pc eh).\n> \n> Son contento che almeno qualcuno capisca quello di cui parlo. \n> \n> +1 anche qui.\n\nSu Hots c'è il report, a fine partita nella pagina delle statistiche basta che clicchi sull'ingranaggio che c'è nella riga di ogni champ.\nSemplicemente su Hots si flamma meno perchè è meno competitivo, questa è una mia opinione ma secondo me è almeno uno dei motivi per cui si flamma poco.","replies":[]}]}]},{"poster":"Ste the ripper","date":"2015-07-28T09:49:42.188+0000","up_votes":3,"down_votes":0,"body":"Sai ho visto un noto utente di questo forum entrare in partita e augurare la morte ad una vayne completamente a caso, senza nessun motivo logico per farlo...\nIo sono fermamente convinto che i flamer flammino anche quando non devono ;)\n\nSiete tossici, prima lo capirete prima risolverete il problema :)","replies":[{"poster":"DanieleRC","date":"2015-07-28T09:54:20.350+0000","up_votes":1,"down_votes":1,"body":"Invece i troll sono più che salutari al game.  :).. \n\nNessuno sta difendendo i flamer. Vanno bannati loro come anche i troller. \n\nQui si sta discutendo la bontà del sistema. \n\nStiamo dicendo che PURTROPPO vengono bannati SOLO I FLAMER (che in gran parte dei casi scaturiscono dai troll). \n\nBEN VENGANO I BAN AI FLAMER, ma che ci siano anche i BAN AI TROLL. Uno 0/30 che non scrive nulla in chat non verrà MAI BANNATO, MAI. \n\n**E' un problema che va risolto, o no?** Sei capace di rispondere a questa domanda?\n\nIl succo del discorso è la risposta a questa domanda, se riesci a rispondere senza andare OT, è già un passo avanti.","replies":[{"poster":"Ste the ripper","date":"2015-07-28T09:57:56.304+0000","up_votes":2,"down_votes":0,"body":"Io non incontro quasi mai troll, né con né contro... Siete voi che flammando portate la gente all'esasperazione e li fate trollare :)\nAvete poca pazienza, quindi considerate comportamenti troll cose che in realtà sono solo leggermente fuori dall'usanza comune e con il vostro atteggiamento esacerbate la situazione.","replies":[]}]}]}]}]}]}]},{"poster":"Frattaglia","date":"2015-07-28T09:47:53.065+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Firenheit,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=0006000400020001,timestamp=2015-07-27T21:37:15.102+0000)\n>\n> Ban per Mac Address, non sarebbe difficile.\n\n> [{quoted}](name=DanieleRC,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=00060004000200010000,timestamp=2015-07-27T22:02:40.123+0000)\n>\n> Meno $ per loro.. di cosa vogliamo parlare? :) Ci siamo capiti\n\nNo, è che semplicemente non è implementabile e, se lo fosse, sarebbe facilmente aggirabile.\nNon ci vuole una scienza per spoofare un MAC address, lo facevano i miei amici all'università 10 anni fa per collegarsi alle reti wifi chiuse.\n\nMa è sempre bello sentire gente che parla senza sapere cosa dice.","replies":[{"poster":"DanieleRC","date":"2015-07-28T09:59:12.177+0000","up_votes":1,"down_votes":1,"body":"a me invece all'università, proprio il docente di informatica ha insegnato che:\n\n\"se puoi pensarlo, puoi farlo\"\n\nè sempre bello confrontarsi e sentire opinioni. Io so cosa dico, so che la blizzard permabanna 600mila account in una sola wave per utilizzo di BOT, e che qui un feeder intenzionale nessuno lo sappia gestire. \n\nE' un dato di fatto. \n\nNon sanno come gestire il problema. Stanno gestendo anche fin troppo scrupolosamente quello dei flamer (e tanto di cappello, bravissimi), ma non sembrano esserci segnali per risolvere il problema dei troll. \n\nAldilà del Mac Address, potrebbero bannare anche gli IP e basterebbe utilizzare qualche trucchetto (proxy) per aggirarli. Ma tu credi davvero che TUTTI I TROLL si metteranno lì a sbattersi pur di far incazzare la gente? \nQualcuno lo farebbe, senz'altro. \nMa senza ombra di dubbio si otterrebbe una notevole scrematura,, \n\n\nNon ho altro da aggiungere.","replies":[{"poster":"Frattaglia","date":"2015-07-28T10:07:55.199+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=DanieleRC,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=0006000400020001000000010000,timestamp=2015-07-28T09:59:12.177+0000)\n>\n> a me invece all'università, proprio il docente di informatica ha insegnato che:\n> \n> \"se puoi pensarlo, puoi farlo\"\n> \n> è sempre bello confrontarsi e sentire opinioni. Io so cosa dico, so che la blizzard permabanna 600mila account in una sola wave per utilizzo di BOT, e che qui un feeder intenzionale nessuno lo sappia gestire. \n> \n> E' un dato di fatto. \n> \n> Non sanno come gestire il problema. Stanno gestendo anche fin troppo scrupolosamente quello dei flamer (e tanto di cappello, bravissimi), ma non sembrano esserci segnali per risolvere il problema dei troll. \n> \n> Aldilà del Mac Address, potrebbero bannare anche gli IP e basterebbe utilizzare qualche trucchetto (proxy) per aggirarli. Ma tu credi davvero che TUTTI I TROLL si metteranno lì a sbattersi pur di far incazzare la gente? \n> Qualcuno lo farebbe, senz'altro. \n> Ma senza ombra di dubbio si otterrebbe una notevole scrematura,, \n> \n> \n> Non ho altro da aggiungere.\n\nSe hai fatto informatica, sapresti anche che gli indirizzi IPv4 sono finiti da molto tempo; per aggirare questo limite fino a che la struttura non passa tutta a IPv6 si utilizza il sistema dei NAT (network address translator).\nQuesto fa sì che molti utenti si ritrovino ad avere gli stessi indirizzi ip anche di altre persone che conoscono; un caso esemplare è la rete di Fastweb, in cui gli indirizzi sono anche fissi (si, perché c'è la possibilità che una persona un giorno abbia un ip e il giorno dopo un altro).\n\nQuindi per bannare un tipo tramite IP rischierebbero di bannare un centinaio di persone che non c'entrano nulla. E non parlo solo del fratellino che trolla, ma anche di persone nella stessa area geografica.\n\nAlla luce di tutto questo, a te sembra sensato un ban per IP? A me no. E non credo che neanche HotS banni per IP. Tra parentesi, anche su LoL si bannano a ondate gli account livellati con i bot o che usano programmi di terze parti, anche se non tutti vengono identificati.\n\n\n\nPiuttosto, se non ricordo male in Korea il possesso degli account di LoL è legato a un tuo numero identificativo personale... quello potrebbe essere un sistema sensato, in questo modo nessuno trollerebbe col rischio di perdere l'account. Ma qui nessuno darebbe mai il proprio codice fiscale per iscriversi su un gioco online, fermo restando che in non tutti i paesi dell'unione europea esistono dei codici identificativi.","replies":[]}]}]}]}]}]}]},{"poster":"Darki200","date":"2015-07-27T18:24:58.170+0000","up_votes":1,"down_votes":0,"body":"Chi reporta un rioter? lol","replies":[{"poster":"Riot DanielSAN","date":"2015-07-27T18:55:42.250+0000","up_votes":3,"down_votes":0,"body":"Un sacco di gente per il nome, pensando che abbiamo Riot a causa di un hack. Ovviamente questi vengono ignorati :P\nSe ci comportiamo male e la gente ci segnala, la punizione ce la becchiamo tutta e sicuramente anche la carriera potrebbe risentirne...","replies":[{"poster":"Darki200","date":"2015-07-27T20:04:05.228+0000","up_votes":2,"down_votes":0,"body":"Azz, roba seria D:","replies":[]}]}]},{"poster":"SirZeel","date":"2015-07-27T18:24:05.482+0000","up_votes":1,"down_votes":8,"body":"> [{quoted}](name=Riot DanielSAN,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=0006,timestamp=2015-07-27T18:19:38.122+0000)\n>\n> Proprio non ce la fate, eh? Avere uno in squadra che trolla non vi da un lasciapassare per insulti. Finite la partita, lo segnalate e fate una pausa o un ARAM. \n> So che scoccia, soprattutto in coda classificata, soprattuto in promozione, ma nulla vi autorizza ad insultare la gente. \n> Se proprio non ce la fate a tenervi tutto dentro, cacciate un urlo, ma non lamentatevi se vi segnalano per linguaggio offensifo se flammate. Feeder o troll, siete nel torto anche voi.\n\nLa frustrazione deriva dal fatto che viene punito più pesantemente chi insulta il troll che il troll stesso.\nSono d'accordo sul fatto della punizione per flame, ma non si può dare un pugno a chi urla e un buffetto a chi trolla.","replies":[{"poster":"Riot DanielSAN","date":"2015-07-27T18:54:06.106+0000","up_votes":5,"down_votes":1,"body":"Guarda che puniamo chi trolla esattamente come chi insulta. Su che basi dici che non vengono puniti?","replies":[{"poster":"Capoz","date":"2015-07-27T19:03:32.132+0000","up_votes":3,"down_votes":3,"body":"su che basi? se venissero bannati e puniti come gli altri, non se ne incontrerebbero -.-\nPerchè non è possibile che uno arrivi al 30 senza trollare, si qualifichi senza trollare, e poi boh, gli gira di trollare di punto in bianco -.-\nNon è possibile che con tutti i report che la gente fa, ce ne siano così tanti. Lo fanno perchè sanno che non gli succede nulla, perchè se scrivi a un troller \"i'll report you\" loro ti rispondono \"riot doesn't care\", perchè sanno che la riot è impegnata a bannare la gente che li flamma, ma se voi faceste il vostro lavoro (e non mi riferisco ai chroma packs e le skin per le ward) allora questo non accadrebbe. \nVuoi trollare? fatti uno smurf e trolla, che ai livelli bassi non ti caga nessuno! Trolli in ranked? Permaban! ma nooooooooo, quanti soldi persi così, vero riot? -.-\nSiete VOI che date soddisfazione ai troller, perchè se uno trolla, e uno che GIUSTAMENTE si arrabbia viene bannato, lui se la ride, ci prende gusto e continua!\nnon è possibile che se flammo un troller mi becco 14 giorni di ban, PER UN TROLLER DI M***A! QUATTORDICI GIORNI PER UN TROLLER???? ve la prendete se flammo sulla piaga più grande di sto gioco (seconda solo al tribunale incompetente)?","replies":[{"poster":"Arkanim94","date":"2015-07-28T11:29:40.417+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Capoz,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=0006000100010000,timestamp=2015-07-27T19:03:32.132+0000)\n>\n>* su che basi? se venissero bannati e puniti come gli altri, non se ne incontrerebbero -.-*\n> Perchè non è possibile che uno arrivi al 30 senza trollare, si qualifichi senza trollare, e poi boh, gli gira di trollare di punto in bianco -.-\n> Non è possibile che con tutti i report che la gente fa, ce ne siano così tanti. Lo fanno perchè sanno che non gli succede nulla, perchè se scrivi a un troller \"i'll report you\" loro ti rispondono \"riot doesn't care\", perchè sanno che la riot è impegnata a bannare la gente che li flamma, ma se voi faceste il vostro lavoro (e non mi riferisco ai chroma packs e le skin per le ward) allora questo non accadrebbe. \n> Vuoi trollare? fatti uno smurf e trolla, che ai livelli bassi non ti caga nessuno! Trolli in ranked? Permaban! ma nooooooooo, quanti soldi persi così, vero riot? -.-\n> Siete VOI che date soddisfazione ai troller, perchè se uno trolla, e uno che GIUSTAMENTE si arrabbia viene bannato, lui se la ride, ci prende gusto e continua!\n> non è possibile che se flammo un troller mi becco 14 giorni di ban, PER UN TROLLER DI M***A! QUATTORDICI GIORNI PER UN TROLLER???? ve la prendete se flammo sulla piaga più grande di sto gioco (seconda solo al tribunale incompetente)?\n\ncontando la player base di lol e la facilità con cui farsi un account la frase evidenziata è fantascienza","replies":[{"poster":"Capoz","date":"2015-07-28T11:38:57.611+0000","up_votes":1,"down_votes":1,"body":"Amico, non capisco se mi stai dando contro o mi stai dando ragione xD","replies":[{"poster":"Arkanim94","date":"2015-07-28T12:26:31.714+0000","up_votes":2,"down_votes":0,"body":"contro, il dire \"se puniste i troll non se ne troverebbero\" è sbagliato vista la facilità con la quale è possibile creare un account.","replies":[{"poster":"Capoz","date":"2015-07-28T12:29:00.154+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Arkanim94,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=0006000100010000000100000000,timestamp=2015-07-28T12:26:31.714+0000)\n>\n> contro, il dire \"se puniste i troll non se ne troverebbero\" è sbagliato vista la facilità con la quale è possibile creare un account.\n\nChe li creino, se trolli a livello 2 me ne frego, è al livello 30 che devono tagliarti le gambe :/","replies":[{"poster":"Arkanim94","date":"2015-07-28T13:11:05.696+0000","up_votes":1,"down_votes":0,"body":"non che ci voglia molto ad arrivare al livello 30 :P\nin breve: i troll ci saranno sempre, deal with it.","replies":[{"poster":"Capoz","date":"2015-07-28T13:12:24.460+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Arkanim94,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=000600010001000000010000000000000000,timestamp=2015-07-28T13:11:05.696+0000)\n>\n> non che ci voglia molto ad arrivare al livello 30 :P\n> in breve: i troll ci saranno sempre, deal with it.\n\nSi ma dopo un pò che ogni volta che arrivi al 30 e trolli ti bannano, la voglia ti passa; come c'è persevaranza da parte dei trollers, ci deve essere anche CONTRO i trollers","replies":[{"poster":"Arkanim94","date":"2015-07-28T13:17:34.515+0000","up_votes":2,"down_votes":0,"body":"ma c'è contro i troller capoz, vengono bannati tanto loro quanto i flammer, non è che se  incontri un troll è lo stesso della volta prima :v\nla player base di lol è immensa, non puoi umanamente sperare che non ci saranno troll prima o poi, la natura online stessa del gioco porta alla loro creazione.","replies":[]}]}]}]}]}]}]},{"poster":"Ste the ripper","date":"2015-07-27T21:10:08.426+0000","up_votes":2,"down_votes":0,"body":"Non è possibile che un flamer arrivi al 30 senza flammare, si qualifichi senza flammare e poi inizi a flammare di punto in bianco","replies":[]}]},{"poster":"Frattaglia","date":"2015-07-28T09:55:23.132+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot DanielSAN,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=000600010001,timestamp=2015-07-27T18:54:06.106+0000)\n>\n> Guarda che puniamo chi trolla esattamente come chi insulta. Su che basi dici che non vengono puniti?\n\nGuarda, c'è gente che si vanta/si vantava di trollare da mesi senza essere mai stata punita, anche gente che era attiva su questo forum (ma non li vedo più postare, anche se ora sono meno assidua).\nÈ vero che poi internet è pieno di mitomani, quindi non tutto è da prendere per oro colato, però l'impressione generale è che i troller vengano puniti meno. Che poi siano più difficilmente individuabili, ne sono pienamente consapevole, però èquesta la percezione che si ha.","replies":[]}]}]},{"poster":"ztJackieChan","date":"2015-07-28T14:08:16.288+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot DanielSAN,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=0006,timestamp=2015-07-27T18:19:38.122+0000)\n>\n> Proprio non ce la fate, eh? Avere uno in squadra che trolla non vi da un lasciapassare per insulti. Finite la partita, lo segnalate e fate una pausa o un ARAM. \n> So che scoccia, soprattutto in coda classificata, soprattuto in promozione, ma nulla vi autorizza ad insultare la gente. \n> Se proprio non ce la fate a tenervi tutto dentro, cacciate un urlo, ma non lamentatevi se vi segnalano per linguaggio offensifo se flammate. Feeder o troll, siete nel torto anche voi.\n> \n> \n> Esempio pratico: io mi sono beccato un Nunu 0/34/0 in ranked la scorsa stagione. In chat non gli ho scritto nulla se non \"smettila, perfavore\" e a fine partita l'ho segnalato. Mi ha fatto incazzare? Sì, tanto, ma visto che insultare un troll è come buttare benzina sul fuoco, ho evitato. Lo fanno per farvi innervosire. Fate finta di nulla e segnalate. Siate superiori.\n> \n> Per la cronaca i report di un Rioter valgono come quelli di un giocatore normale per il sistema, stessa cosa per quelli ricevuti.\n\ngentile Riot, volevo chiedere se è possibile sapere in base a cosa voi o chi per voi giudica se un giocatore trolla. E magari descrivere cosa significa un comportamento \"da troll\".\noppure in base a quale livello di violenza verbale vengono presi provvedimenti.\nInoltre, mi è capitato spesso di vedere dei giocatori, normalissimi, andare 0-3 in 5 minuti, e i compagni di team che scrivono: Report Player1 for feeding. Feedare è un \"reato\" sanzionabile con un ban ?\nEsiste un qualche regolamento pubblico in cui leggere le regole precise per non incappare in un ban ?\n\nGrazie","replies":[{"poster":"BeardSergio","date":"2015-07-28T14:34:49.970+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ztJackieChan,realm=EUW,application-id=MJVj50Jw,discussion-id=WHxajMcI,comment-id=00060007,timestamp=2015-07-28T14:08:16.288+0000)\n>\n> gentile Riot, volevo chiedere se è possibile sapere in base a cosa voi o chi per voi giudica se un giocatore trolla. E magari descrivere cosa significa un comportamento \"da troll\".\n> oppure in base a quale livello di violenza verbale vengono presi provvedimenti.\n> Inoltre, mi è capitato spesso di vedere dei giocatori, normalissimi, andare 0-3 in 5 minuti, e i compagni di team che scrivono: Report Player1 for feeding. Feedare è un \"reato\" sanzionabile con un ban ?\n> Esiste un qualche regolamento pubblico in cui leggere le regole precise per non incappare in un ban ?\n> \n> Grazie\n\nhttps://support.riotgames.com/hc/it/categories/200134550\n\nQua troverai gli articoli della riot che spiegano come funzionano i ban e quali sarebbero i comportamenti corretti da mantere.\nPer quello che riguarda che cosa è un troller non credo esista una definizione corretta e precisa in questo ambito dato che,morire 20 volte, non significa per forza essere troll","replies":[]}]},{"poster":"Sorcio84","date":"2015-07-27T20:38:49.943+0000","up_votes":2,"down_votes":0,"body":"anche una dominion, tanto è super veloce come partita. ti prendi un champ ignorante che fa danni ignoranti e ti sfoghi ammazzando tutto quanto :P\n\npoi sono concordo con te.\n\nse tizio si comporta male e abbassa il morale del team, è inutile flammare, perchè non si corregge un brutto comportamento (volontario o meno) con un altro brutto comportamento.\nio solitamente uso max  3 messaggi educati per recuperare. se recupero ok sennò inizio a usare mute AOE. tanto i ping li uso sempre e comunque.","replies":[]}]},{"poster":"mezzo minion","date":"2015-07-27T14:27:48.683+0000","up_votes":6,"down_votes":0,"body":"Però hai ammesso anche te di avere parte della colpa.","replies":[{"poster":"Capoz","date":"2015-07-27T14:33:05.978+0000","up_votes":1,"down_votes":6,"body":"Se flammare un troller è una brutta cosa, allora si :')\nPerò tu, mi raccomando, se ne incontri uno in promo e perdi per colpa sua, ringrazialo e onoralo amico :)","replies":[]}]}]}