{"poster":"Zetthrina","date":"2017-05-21T03:04:22.040+0000","title":"El nacimiento de karthus","subforum":"Charlas Generales","up_votes":4,"down_votes":2,"body":"Hola esta es la segunda historia creada por mi :) la anterior es katarina y garen esta mas abajo en el foro espero que les guste n.n.\r\n{{champion:30}} \r\nEl Nacimiento De Karthus:\r\nNadie sabe exactamente c&oacute;mo ocurri&oacute;... ni de donde salio... ni nada parecido... pero all&iacute; al final de un cementerio, hab&iacute;a una luz que brillaba con tanta nitidez que segaria a cualquier humano que la viera de frente... http://i.imgur.com/W4RAZBf.jpg   La luz entraba por la ventanilla http://i.imgur.com/2PhFKJO.jpg de un hombre que estaba durmiendo; Su nombre no se sabe y creo que nunca lo sabremos ... el se&ntilde;or claramente se despert&oacute; al ver tanta luminosidad; de un salto se levant&oacute; de la cama pensando que eran v&aacute;ndalos intentado saquear tumbas o algo por el estilo y que la luz era de un farol o alg&uacute;n aparato similar, el buen hombre se cambi&oacute; y sali&oacute; corriendo hacia la luz lo cual al verla lo ceg&oacute; por completo http://i.imgur.com/47QDXNr.jpg  el homrbre callo al piso sin poder ver nada escucho un sonido perturbador  como una respiraci&oacute;n del m&aacute;s all&aacute;... y de repente muri&oacute;... con esa muerte la luz se hizo un poco m&aacute;s grande http://i.imgur.com/8AIZJSy.jpg  Al otro dia una ni&ntilde;a que fue con sus padres a ver la tumba de su abuelo, se fue a recorrer el cementerio por simple curiosidad... estaba sentada en un &aacute;rbol cuando de repente ve la misma luz a lo lejos; la ni&ntilde;a pregunt&aacute;ndose qu&eacute; podr&iacute;a ser esa luz, se acerc&oacute;... cuando estaba a unos 3 metros de esa horrorosa cosa la ni&ntilde;a sinti&oacute; un empuj&oacute;n, algo que la jalo hacia la luz; la ni&ntilde;a asustada empez&oacute; a alejarse de esa extra&ntilde;a cosa, pero cada vez que daba un paso la ni&ntilde;a era atra&iacute;da m&aacute;s y m&aacute;s hacia eso; la misma asustada empez&oacute; a correr y a gritar, los padres la oyeron y fueron hacia ella pero para cuando la vieron ya era demasiado tarde la ni&ntilde;a estaba siendo absorbida por la tenebrosa luz http://i.imgur.com/gRXTeuR.jpg ... la luz fue creciendo y fue tomando forma de una criatura no proveniente de este mundo o al menos no vista antes, luego de haber matado m&aacute;s de 100 hombre mujeres y ni&ntilde;os esa cosa hizo temblar al mundo cuando dijo sus primeras palabras... esas fueron: &quot;-Yo, Soy la Muerte!... Dejen atr&aacute;s sus despojos mortales, la oscuridad los envolver&aacute; !&quot; y de repente sobre todas las personas en el pueblo de donde pertenec&iacute;a el cementerio antes mencionado, apareci&oacute; una columna de luz celestial, que pocos segundos despu&eacute;s, acab&oacute; con la vida de TODAS LAS PERSONAS del pueblo... http://i.imgur.com/WSbVTEc.jpg ...la figura o monstruo como quieran denominarlo, dijo unas ultimas palabras antes de irse... eso dijo... &quot;-Y que no se les olvide!... , Yo soy la muerte!... Yo soy el sufrimiento!... , Yo soy Karthus! y vengo a imponer la agon&iacute;a y el dolor!... Adios!&quot; y se fue volando hacia el cielo con un libro y un bast&oacute;n que aparecieron m&aacute;gicamente en sus brazos.\r\nAhora mismo se estar&aacute;n preguntando c&oacute;mo s&eacute; yo todo esto; pues resulta que yo... yo soy el padre de karthus, Yo soy Zetth; La muerte misma!... http://i.imgur.com/oRy9758.jpg FIN/ THE END. Espero que les haya gustado si es asi denle una flechita arriba n.n para mas me tarde aprox. 4 hrs en hacerlo jaja estoy aburr. jaja n.n saludos! y ojala les guste! {{champion:55}}  {{champion:30}}","replies":[{"poster":"Ingratitud","date":"2017-05-21T13:44:53.808+0000","up_votes":2,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}