{"poster":"hi 123456789","date":"2019-07-29T17:02:07.314+0000","title":"Wie kaputt sind bitte einige??","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":3,"body":"Hallo, \r\n\r\nin jedem Spiel wird nur rumgeflamet, gehatete und ein schlecht gemacht, egal was man macht. \r\nGerade hatte ich erst eins: Da hatte ein Mitspieler was in den Chat geschrieben, was ich nicht verstanden habe weil ich die Sprache nicht kann. Ich dachte er hätte mich gemeint. So habe ich freundlich geschrieben: Can you write in english pls?\" Danach kam nur noch Beschimpfungen, Beleidigungen und alles andere. Ich habe ARAM gespielt. Dann haben mich die anderen 3 auch noch beleidigt, weil es 4 Freunde waren. Ich habe dann ein ragequit gemacht. Ich meine wenn es nur einmal ist, aber man wird permanent von irgendwelchen Leuten beleidigt, auch wenn man hoflich fragt ob man in englisch schreiben könnte weil ich dachte er wollte mir was sagen. Es ist einfach eklig gworden diese Community und es wird immer schlimmer, ich spiele schon recht lange. Ich werde dieses Spiel nie wieder anrühren, weil es mir einfach auf den Geist geht und es wird nichts gemacht. \r\nIch weiß es gibt auch vernünftige Leute, nur wo sind diese?? Ich habe nur noch unnötiges geflame und gehate. Mich wird man auf jedenfall nicht mehr im Spiel sehen. Wenn man mal 1 mal Internetprobleme hat und rausfliegt bekommt man gleich eine Strafe, aber Beleidigungen werden hier wohl tolleriert.","replies":[{"poster":"Hundis Katze","date":"2019-07-30T12:39:32.380+0000","up_votes":3,"down_votes":0,"body":"Mute dann Report.\n\nAmsonsten such die Duoq Partner.","replies":[]},{"poster":"Megamaexx","date":"2019-07-30T09:27:12.625+0000","up_votes":3,"down_votes":0,"body":"Probier's mal mit der mute-Funktion, das sorgt dafür, dass du keine Strafe bekommst und ohne Chatbelästigung weiterspielen kannst.\nRagequitter mag keiner.","replies":[]},{"poster":"SuicidePlank","date":"2019-07-29T17:12:11.651+0000","up_votes":4,"down_votes":1,"body":"> Wenn man mal 1 mal Internetprobleme hat und rausfliegt bekommt man gleich eine Strafe\n\nNein tut man nicht, dafür musst du öfters leaven.\n\n> aber Beleidigungen werden hier wohl tolleriert.\n\nGuckt hier eigentlich jemand durch das Unterforum in das man postet, bevor man auf Senden drückt?\nAbsätze benutzen ist auch ganz nett, das macht es viel angenehmer Texte zu lesen. :)","replies":[{"poster":"MidlaneGod115","date":"2019-07-29T21:52:25.007+0000","up_votes":3,"down_votes":0,"body":"Absätze? \nIch dachte die gibt es nur unter Schuhen :o","replies":[{"poster":"dugg","date":"2019-07-31T07:40:29.664+0000","up_votes":1,"down_votes":0,"body":"Schuhe? Wir Gamer können uns doch nicht einmal Schnürsenkel zubinden.","replies":[]}]},{"poster":"BestKillerEu","date":"2019-07-29T18:29:57.230+0000","up_votes":1,"down_votes":0,"body":"was ist ein Unterforum?","replies":[{"poster":"Megamaexx","date":"2019-07-30T09:34:05.968+0000","up_votes":2,"down_votes":0,"body":"“Spielerverhalten &amp; Moderation“ ist ein Unterforum des League of Legends Forums.","replies":[]}]}]},{"poster":"BestKillerEu","date":"2019-07-29T17:18:55.373+0000","up_votes":2,"down_votes":0,"body":"ich frage mich schon seit langem wo die normalen Menschen hin sind..... Lustig wird es erst wenn man beleidigt wird weil der gegnerische Mid laner einen 4 mal gekillt hat. Tja ich hatte einen Late game champion nd habe dann mit 17/5/16 oder so geendet.... Und nur einer war nett zu mir. die anderen 3 weil diese sich kannten haben mich runter gemacht. Ich habe nur geschrieben \"Can you \"name of his champ\" relax thx\"  Und da drehte der noch mehr durch. ich hatte eine verlierende Bot lane und mein jungler war mist. Top und ich haben den win gehohlt.... \n\nDas nur als beispiel. Und ein kleiner tipp Leave niemals (mute sie alle zur not) auch die pings wenn nötig.  \nWenn du leavest und es 4 sind die dich reporten dann kann durchaus vorkommen das du gebannt wirst. für ein paar tage. weil genügend Reports vom system registriert wurden. Ist einem Kumpel von mir vor Jahren passiert. seitdem spielt der gar nicht mehr. (war auch nur ein 2 wochen bann oder so\"\n\nIch habe jetzt 4 tage pause von LoL und es tut gut. Ansonsten versuche ich nur aram zu spielen oder Mit mates. denn die community ist way to toxic.... das passiert wenn 10 jährige das spiel spielen. Die sind zum großteil einfach nur frech. (das alter ist nur als beispiel zu verstehen)","replies":[{"poster":"Carina","date":"2019-07-30T04:44:33.384+0000","up_votes":4,"down_votes":1,"body":"> Wenn du leavest und es 4 sind die dich reporten dann kann durchaus vorkommen das du gebannt wirst. für ein paar tage. weil genügend Reports vom system registriert wurden.\n\nDie Aussage an sich ist richtig aber die Begründung falsch. \nWenn du leavest erkennt das System ab einer gewissen Zeit automatisch, dass du afk bist, da muss dich nicht mal unbedingt jemand reporten. Und ob dich eine, oder 4, oder 9 Personen reporten ist auch völlig egal, da bereits ein einziger Report eine Überprüfung auslöst - und natürlich wird der strafbestand überprüft, ehe eine Strafe vergeben wird. \n\nIch weiß nicht warum ständig alle denken, dass Reports auf viel hilft viel basieren... ^^'","replies":[{"poster":"BestKillerEu","date":"2019-07-30T16:14:17.190+0000","up_votes":1,"down_votes":0,"body":"Stimmt es gibt auch die Automatik. Aber ich habe echt das Gefühl schon häufiger, dass es leider mehr bringt, wenn man mit mehr als einer Person reportet, vorher passiert nie etwas. Ich hatte vor 1 monat ein game da war ein kerl drinnen Beleidigend und rassistisch as f... ganz normal gemuted am ende des games reportet. (ein gegner kannte ihn hatte ihn einen monat vorher reportet) tja diesmal auch)  nix passiert vor 1 woche oder so k.p wann genau war er wieder in einem game mit mir (diesmal hatte ich premates, ich habe normal mit denen gespielt, er meinte uns zu beleidigen), ohne zum report aufzurufen waren wir uns einig. Jup report raus, text zu schreiben und siehe da. der kerl war gebannt... (smurf account, habe mit meinem normalen gespielt) ich habe diesen spieler mit diesem Account zufällig heute in einem Aram gehabt um 0:00 uhr irgendwas oder 2:00 uhr er war freundlich (ok der konnte nicht wissen wer ich bin), aber plötzlich benahm er sich. Kann auch daran gelegen haben das es ein Aram war. \n\nAlso das ist alles etwas strange. Ich glaube daher nicht, dass es keinen unterschied macht wie oft man reportet. Aber wie dem auch sei. \nBesser das spiel beenden (auf natürliche weise xD und mates zur not Muten.","replies":[{"poster":"Carina","date":"2019-07-31T06:10:53.285+0000","up_votes":2,"down_votes":0,"body":"Ich würde mich hier einfach mal darauf verlassen, dass das was Riot sagt stimmt:\n\n> Bitte andere Spieler während des Spiels nicht, den beleidigenden Spieler zu melden. **Unser System wird bereits nach einer Meldung aktiv. Weitere Meldungen haben keinen Einfluss auf den beleidigenden Spieler. **Du könntest jedoch selbst gemeldet und bestraft werden, wenn du die anderen Spieler ablenkst, weil du sie ständig darum bittest, einen Spieler zu melden.\n\n\nQuelle: https://support.riotgames.com/hc/de/articles/201752884-Spieler-melden","replies":[{"poster":"BestKillerEu","date":"2019-07-31T12:11:02.589+0000","up_votes":1,"down_votes":0,"body":"Blindes Vertrauen hat schon häufiger mein \"Genick gebrochen\".  xD Ich habe den Text auch schon mal gelesen. Trotzdem kann es ganz anders sein.","replies":[{"poster":"Carina","date":"2019-08-02T06:50:51.372+0000","up_votes":1,"down_votes":0,"body":"Ich lass dir das hier noch mal da: https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/4jirhxBx-ich-wurde-reported\nHat jetzt zwar eigentlich nicht konkret mit _berechtigten_ Reports zu tun, aber ich denke, so ein Einblick ist vielleicht trotzdem mal ganz nett anzusehen. c:","replies":[]}]}]}]}]},{"poster":"RM Heartmeander","date":"2019-07-30T10:50:25.411+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=BestKillerEu,realm=EUW,application-id=KYnfKGf0,discussion-id=09osy1AR,comment-id=0002,timestamp=2019-07-29T17:18:55.373+0000)\n\n> Wenn du leavest und es 4 sind die dich reporten dann kann durchaus vorkommen das du gebannt wirst. für ein paar tage. weil genügend Reports vom system registriert wurden. Ist einem Kumpel von mir vor Jahren passiert. seitdem spielt der gar nicht mehr. (war auch nur ein 2 wochen bann oder so\"\n\n\nFalsch.\nAlso erstens wirst du nur gebannt, falls du auch negativ warst im Chat und geflamt hast.\nAlleine durch AFK gehen kriegt man keinen Bann.\n\nUnd zweitens spielt die Anzahl Reporte keine Rolle, ein Report = Überprüfung, 9 Reports = 1 Überprüfung also es spielt keine Rolle wie viele dich reporten.\nWenn niemand reportet, dann wird auch nicht überprüft und in deinem Falle hättest du nicht afk gehen sollen, damit du die hättest reporten können weil sie geflamt haben.\n\nUnd drittens von afk gehen kriegt man irgendwann eine low-priority que, sprich du musst 5 Spiele bevor du in die eigentliche que kommst Zeit absitzen (5, 10, 20 min) und es wird erst danach ein Spiel gesucht.","replies":[{"poster":"BestKillerEu","date":"2019-07-30T16:06:34.645+0000","up_votes":1,"down_votes":1,"body":"? Ich bin nie afk gegangen? wo hast du das denn jetzt her? Und klar wird man eher gebannt wenn man mehr reportet wurde, klar das System reagiert nur einmal. Aber fakt ist das eben mein Kumpel damals nur gebannt wurde weil er von mehr als einer Person reportet wurde. Vorher war er nie afk und auch sonst nix. Also sag nicht nein, denn es war so. \n\nUnd b Falsch. Du wirst nicht nur gebannt wenn man im Chat flamt. Man bekommt höchstens eine Chat restriction. Aber mein Mate von damals hat den 2 Wochen ban bekommen weil eben seine Team mates ihn reportet haben. Es ist ja passiert, ich weiß ja nicht was die genau angeklickt haben. Aber ich weiß was ingame passiert ist mit chat und alles. Und trotzdem wurde er gebannt, dafür gab es null Grund eigentlich. \nDas System von LoL ist aber auch an sich schrott (damals wie heute), denn meine Reports an Leuten bewirken mal null leider... \n\nIch kann froh sein, dass ich generell nix schreibe oder tue was andere aufregt( bzw. ich habe aufnahmen zum verifizieren, dass ich nicht bewusst feede oder ähnliches)  \n\nAber du kannst nicht hingehen und sagen ich würde etwas falsches sagen, wenn es doch vor Jahren so passiert ist. Ich habe nämlich das Gefühl, dass wenn Leute einen für den selben Grund reporten zum Beispiel. keine Ahnung ähm \"dem gegnerischem Team geholfen\" Und es sich deckt. Dann wird das System sehen, dass nicht nur einer das so sieht sonder mehr. Zumindest empfinde ich das so. \n\n@RM Heartmeander","replies":[{"poster":"RM Heartmeander","date":"2019-07-30T16:30:58.298+0000","up_votes":2,"down_votes":1,"body":"Wo habe ich geschrieben, dass du afk gegangen bist?\nIch habe nur deine Aussage widerlegt.\nUnd du hast anscheinend etwas durcheinandergebracht.\nDenn für das Leaven kriegt man keinen Bann (es besteht zwar in der Theorie die Möglichkeit aber es gab bisher noch niemanden soweit ich weiss) sondern einen Leaverbuster und wenn man zu oft leavt kriegt man low-priority que und das ganze braucht keine Reports, denn es ist ein automatisiertes System das anschlägt, sobald man eben afk ist.\nDas halt zu deiner Aussage \"Wenn du leavest und es 4 sind die dich reporten dann kann durchaus vorkommen das du gebannt wirst.\"\n\nMann wird nicht gebannt, weil man mehr reportet wurde.\nMan wird gebannt, wenn man zu recht reportet wird bsp. wenn man so was wie fgt oder kys schreibt und es spielt keine Rolle, wie viele dich reporten, die Hauptsache ist jemand reportet dich denn 9 Reports sind gleich 1 Report.\nDas ist wie wenn du nen Laden ausraubst, nur weil dich 9 Leute anzeigen kriegst du nicht auch 9 Verfahren für das genau gleiche Verbrechen.\nUnd es ist auch nicht so, dass du ne Strafe kriegst, nur weil dich 9 Leute reporten.\n\n2 Ich habe nie geschrieben, dass man nur gebannt wird wenn man flamt.\nMan kann auch für Inten nen 2 Wochenbann kriegen oder für Drittprogramme und weiteres.\nJa sie haben ihn reportet, er wurde überprüft und für schuldig befunden.\nWoher weisst du denn, dass ihn 9 Leute reportet haben oder ob das einen Einfluss hatte?\nNur weil er es gesagt hat, dass er von 9 Leuten reportet wurde?\n\nDu brauchst keine Aufnahmen zum Verifizieren, die Riot Mitarbeiter können sich die Replay anschauen falls du mal nen 2 Wochenbann für Inten kriegen würdest.\nWenn du bsp. nach 20 min 17 Tode hast und der Feederbuster dich bannt und du den Support anschreibst, können die sich das Replay anschauen und entsprechend urteilen.\n\nNa ja es ist so ihr DENKT, dass es einen Einfluss hat und er deswegen gebannt wurde.\nWas aber nicht bedeutet, dass es so ist.","replies":[{"poster":"BestKillerEu","date":"2019-07-30T17:24:31.851+0000","up_votes":1,"down_votes":0,"body":"> Wo habe ich geschrieben, dass du afk gegangen bist?\n\n\n>\"Wenn niemand reportet, dann wird auch nicht überprüft und in deinem Falle hättest du nicht afk gehen sollen, damit du die hättest reporten können weil sie geflamt haben.\"\n\nDa. Aus deiner oberen Antwort. \"außer du meintest mit dem \"deinem Falle\" den Ersteller des original Posts. Dann habe ich das missverstanden. aber dann hättest du den part auch als eigenen Kommentar an den Original Poster schicken können, denn das hat mich komplett verwirrt. Denn so fühlte ich mich angesprochen. Also sorry wenn ich nicht gemeint war. \n\n\n>2. Ich habe nie geschrieben, dass man nur gebannt wird wenn man flamt.\n\n>\"Also erstens wirst du nur gebannt, falls du auch negativ warst im Chat und geflamt hast.\"\n\nYeah about that. hast du doch geschrieben... \n\n\n\nAber darum bin ich ehrlich gesagt nicht hier. Ich habe meine Meinung das was mir am Game aufgefallen ist bzw. welche Erfahrung ich gemacht habe dem Ersteller des Haupt Threads mitgeteilt.  ich bin nicht hie rum mich zu streiten. Du denkst du hast recht, ich habe aber andere Erfahrungen.","replies":[{"poster":"Angel Ayume","date":"2019-07-30T17:29:06.395+0000","up_votes":2,"down_votes":1,"body":"Ich glaube er bezog sich bei \"deinem Fall\" auf dein Beispiel mit dem Leave und den 4 Reports der Spieler...","replies":[{"poster":"BestKillerEu","date":"2019-07-30T17:39:46.470+0000","up_votes":1,"down_votes":1,"body":"Ist mir jetzt wurscht :D Ich will nicht streiten ich bin 23. Verhalte ich mich so. :D Er denkt er hat recht was das System angeht, ich denke meine \"Ideen\" sind nicht so abwegig.  Belasse ich es dabei. ^^","replies":[{"poster":"Angel Ayume","date":"2019-07-30T20:47:51.082+0000","up_votes":2,"down_votes":1,"body":"Ne Diskussion ist doch nicht gleich ein Streit o.o","replies":[{"poster":"BestKillerEu","date":"2019-07-30T23:01:15.157+0000","up_votes":1,"down_votes":0,"body":"für viele leider schon. So habe ich direkt die Situation deeskaliert . :D Man weiß ja nie mit wem man schreibt :D ich bin lieber vorsichtig.","replies":[]}]}]}]},{"poster":"RM Heartmeander","date":"2019-07-30T18:42:59.830+0000","up_votes":1,"down_votes":1,"body":"Ok sorry hätte ich wohl dazu schreiben sollen, ja ich meinte den Original Poster des Beitrag.\nIn seinem Fall sollte er nicht AFK gehen, damit er die anderen auch reporten kann und sie evtl. (je nachdem wie heftig sie geflamt haben) auch ihre Strafe bekommen.\nWar mein Fehler, dass es nicht klar rüber kam.\n\nBeim anderen war es darauf bezogen, das man nur gebannt wird, wenn man auch in Chat negativ verhalten hat und flamt und nicht, weil man afk geht.\nUnd wenn man eben nicht im Chat flamt, wird man auch nicht gebannt, weil man eben nicht flamt.\n\nEs ging ja um deine Kernaussage, dass wenn er leavt und von 4 reportet wird, gebannt werden kann.\nDarauf meinte ich, man wird nur gebannt, wenn man auch im Chat beleidigt hat, da man nur für AFK gebannt werden kann.\n\nUnd nicht, dass es nur einen Banngrund gibt.\nTut mir leid, wenn du es so interpretiert hast, dass man nur davon gebannt werden kann und nicht anders.\n\nDer Bann vom Feeden (ich weiss nicht einmal ob da sogar ein Report nötig ist) ist vom Feedbuster und Drittprogramme werden in Wellen gebannt.\nUnd der andere Mögliche Bann von Zahlungsschwierigkeiten (der sich ja aufheben lässt) wird nicht ingame getriggert.\n\nDenn eben, AFK gehen triggert den Leaverbuster und dieser vergiebt keine Bans sondern die low-prority que.\nhttps://support.riotgames.com/hc/de/articles/201752714-H%C3%A4ufig-gestellte-Fragen-zum-LeaverBuster#h1q2\n\n\nIch bin auch nicht hier, um mich zu streiten, sondern um es klarzustellen.\nHeutzutage wird man zumindest nicht mehr für AFK gebannt.\nDas müsste dann wohl noch zu Zeiten von dem Tribunal gewesen sein (und das ging verdammt lange bis man bestraft wurde) zumindest finde ich sehr wenige Beiträge wegen 1-3 Tagesbanns wegen afk zwischen 2011-2014.\nEs kann also sein, dass dein Freund früher mal gebannt wurde wegen afk, aber da ist er selbst schuld wenn er so oft afk geht xD\nHeutzutage wird man es jedenfalls nicht mehr, nur dass du up to date bist ;)\n\nUnd das andere ist eben, dass es immernoch Leute gibt, die denken wenn jemand 3-4 Reports bekommen, dass man deswegen ne Strafe bekommt oder dass 3-4 Reports besser sind als 1, was eben nicht so ist. (und auch nie war so weit ich weiss)","replies":[{"poster":"BestKillerEu","date":"2019-07-30T19:42:31.540+0000","up_votes":1,"down_votes":1,"body":"> Es kann also sein, dass dein Freund früher mal gebannt wurde wegen afk, aber da ist er selbst schuld wenn er so oft afk geht xD\n> Heutzutage wird man es jedenfalls nicht mehr, nur dass du up to date bist ;)\n\n\n\nMein Kumpel ist an dem Tag AFK gegangen damals. Davor war er höchstens 1 mal oder so. Deswegen bin ich überzeugt das die Reports das verursacht haben. Denn normalerweise wird man ja nicht von einem AFK (bzw. selbst wenn der andere mitgezählt wird 2 afks) gebannt. Und er war gebannt nicht nur für 3 tage. \n\nAber na ja. Ich glaube manchmal versteht das System sich selbst nicht einmal _D","replies":[]}]}]}]}]}]}]},{"poster":"Eibert Rümmel","date":"2019-07-30T12:57:12.180+0000","up_votes":1,"down_votes":0,"body":"Ich finde dein Verhalten nicht gerade vorbildlich.\n\nWenn jemand nicht auf English schreibt, ist die nachricht zu 99,9% für seine Premades gedacht. Ihnen den Smaltalk zu verbieten zu wollen, ist unhöflich unabhängig von der Vormulierung.\n\nEin Ragequit ist übrigens in etwa so reif, wie ein kleines Kind, das weinend zu Mami läuft, weil ein anderes Kind böse war...","replies":[{"poster":"eingew","date":"2019-07-31T07:14:32.049+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Eibert Rümmel,realm=EUW,application-id=KYnfKGf0,discussion-id=09osy1AR,comment-id=0007,timestamp=2019-07-30T12:57:12.180+0000)\n>\n> Wenn jemand nicht auf English schreibt, ist die nachricht zu 99,9% für seine Premades gedacht. Ihnen den Smaltalk zu verbieten zu wollen, ist unhöflich unabhängig von der Vormulierung.\n\nWieso verbieten? Er wollte wohl eher mithören und sich evtl beteiligen.\n\nWobei ich persönlich per se finde, dass privater Chat nichts im Teamchat zu suchen hat. Ich schalte sowas jedenfalls stumm und habe auch kein Interesse daran. Für mich ist das Spam.","replies":[]}]},{"poster":"RektonHide","date":"2019-07-29T18:36:37.090+0000","up_votes":1,"down_votes":1,"body":"Ihr habt Probleme.. \n{{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"Snappynator","date":"2019-07-29T17:16:26.920+0000","up_votes":2,"down_votes":5,"body":"Das merke ich bereits schon, wenn ich beispielsweise einen Verbesserungsvorschlag in den Forum schreibe. Aber dann kommen viele von den Leuten an und schreiben dann einfach sowas wie, Reporte ihm und gut ist. Aber diese Leute wollen anscheinend diese Community so sein lassen, wie es im Moment so ist und alle meine Verbesserungsvorschläge in die Tonne werfen. Ich sag nur, diese Leute einfach meinen Forum-Beträge downvoten, was ich immer wieder lustig finde, und das bereits OHNE Begründung oder einfach sowas schreiben wie Reporte diesen Spieler und gut ist.","replies":[{"poster":"SeaHorseCalamity","date":"2019-07-29T20:16:44.817+0000","up_votes":3,"down_votes":1,"body":"Naja, gerade hier im Forum leswen wir häufig Beiträge wie \"Ich wurde zu unrecht gebannt, weil ich hab ja nur ein bisschen geflamed\" etc.\nReporten bringt was, die Leute werden bestraft. \nBtw, ein Report reicht, alle weiteren Reports haben keinerlei Auswirkungen mehr. Durch Reports wird nur die Analyse getriggert.\n\nWir Downvoten Beiträge, weil die Verbesserungsvorschläge meistens Verschlechterungen sind und/ oder auf Fehlinformationen basieren, bzw einfach nicht durchdacht sind, etc.","replies":[]}]},{"poster":"611FVNKBlv","date":"2019-07-29T18:52:20.292+0000","up_votes":2,"down_votes":4,"body":"#EUWCOMMUNITY\n\nwirst direkt runtergevoted.\n\nda kannste ja fast schon auf EUNE besser gehen {{sticker:sg-miss-fortune}}","replies":[{"poster":"dugg","date":"2019-07-31T07:38:40.373+0000","up_votes":2,"down_votes":1,"body":"Und das hilft dem Threadersteller nun wie weiter?","replies":[]}]}]}