{"poster":"Rainfall","date":"2017-07-19T11:54:33.691+0000","title":"Do Trolls Ever Get Banned.","subforum":"Player Behavior","up_votes":15,"down_votes":4,"body":"Just now i met again a consistent troller,do these players ever get banned?\ni am just wondering how many players this particular person has permabanned because he got them to flame him,10-20 is my guess\nyou can find him in my last caitlyn game.","replies":[{"poster":"Prandine","date":"2018-03-17T19:48:14.009+0000","up_votes":0,"down_votes":0,"body":"While Necromancy may be handy (and sometimes needed) in video games, it's not the case for old forum threads. Please avoid using such magic and be mindful of how old threads are before posting.\n\nFeel free to contact us at the [Moderation Discord](https://discordapp.com/channels/230113905668653056/306220435262144512) or at [Discuss the Boards]( https://boards.na.leagueoflegends.com/en/c/community-moderation) for any questions, comments or concerns about this. Thank you and have a good day.","replies":[]},{"poster":"Rito Staff","date":"2017-07-19T14:59:19.168+0000","up_votes":2,"down_votes":1,"body":"I've gotten the message saying a person I reported got punished a few times :P feels good","replies":[{"poster":"Rainfall","date":"2017-07-19T15:00:19.848+0000","up_votes":6,"down_votes":0,"body":"probably a chat restriction","replies":[]}]},{"poster":"Glory ln Death","date":"2017-07-20T15:10:42.300+0000","up_votes":4,"down_votes":0,"body":"I've seen Trundle banned a couple of times. It's not very common, though.","replies":[]},{"poster":"Sarutobi","date":"2017-07-19T11:57:13.512+0000","up_votes":1,"down_votes":0,"body":"Yes, but sadly it takes time, as the system is pretty lenient. It assumes people are just bad before anything else. This is one reason why people need to write in the details about what is happening. Granted you can only write so much in that box, but anything that can help the system learn and improve the better. Because Trolls are smart and will always try to be one step ahead of the system.","replies":[{"poster":"Rainfall","date":"2017-07-19T12:01:36.556+0000","up_votes":3,"down_votes":0,"body":"his last ranked game 0/11/1 20 cs\nbefore that 0/8/2 12 cs\nbefore that  0/6/0 8 cs","replies":[{"poster":"Starcraft243ver","date":"2017-07-19T16:27:08.759+0000","up_votes":2,"down_votes":2,"body":"That's intentionnal feeding and trying to lose, it's detected quite easily by the system.","replies":[{"poster":"Resolution","date":"2017-07-19T17:15:43.079+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Starcraft243ver,realm=EUW,application-id=ZGEFLEUQ,discussion-id=lEEKRAU1,comment-id=000100000000,timestamp=2017-07-19T16:27:08.759+0000)\n>\n> That&#x27;s intentionnal feeding and trying to lose, it&#x27;s detected quite easily by the system.\n\nActually, it's not. There are multiple references and videos proving otherwise. There was a Youtuber who wanted to test how long it actually takes to get banned without negative chat experiences and it took roughly 40 games of tower diving before he got an infraction. Now let's say you do this on average every 5 games or so, you will never get banned. Unless there are negative chat experiences to go off \"it's registered as just a bad game\".\n\nHonestly, add the next person who does this in one of your games. They'll still be playing months from now care free.","replies":[{"poster":"Starcraft243ver","date":"2017-07-19T17:18:55.152+0000","up_votes":1,"down_votes":2,"body":"So you mean he was ban ? \n\nSo it was detected ?\n\nSo ... i'm ... right ?","replies":[{"poster":"TheViper7911","date":"2017-07-19T17:28:53.770+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Starcraft243ver,realm=EUW,application-id=ZGEFLEUQ,discussion-id=lEEKRAU1,comment-id=00010000000000010000,timestamp=2017-07-19T17:18:55.152+0000)\n>\n> So you mean he was ban ? \n> \n> So it was detected ?\n> \n> So ... i&#x27;m ... right ?\n\nYes, after 40 straight games. Lower the percentage from 100% to say 33%, actively ruining 1 out of 3 games.... And they can do this forever.\n\nBut it doesnt always work. There was a post a while back about an account on the KR server that had inted over 1000 games with no punishment. And it was very obvious from his op.gg page.","replies":[]}]},{"poster":"Supz","date":"2017-07-19T22:42:54.525+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Tempist","date":"2017-07-20T02:14:59.828+0000","up_votes":1,"down_votes":0,"body":"Here is one example I found on [youtube](https://www.youtube.com/watch?v=sLesf-Bd2OQ).  \n\nYou only need to watch the first 30 seconds to get the gist, though you can of course watch more. Presumably the two players in question are banned now...after getting attention by making it to the front page of reddit.\n\nBut the point of the video is that Riot's system is so goddamn poor at detecting trolling, that two duo partners could get away with hundreds of games played on a single champion with a 0% winrate. As in 200+.\n\nSo sadly the OP is right to complain. So long as you keep your mouth shut and don't say anything in chat, you can essentially troll with utter impunity. :(","replies":[]}]}]}]}]}]},{"poster":"Resolution","date":"2017-07-19T11:56:30.210+0000","up_votes":3,"down_votes":0,"body":"Passive aggressive trolling/actual trolling rarely goes punished.\n\nThe system has issues detecting infractions unless there openly harassing players or swearing. There's a bunch of issues with the report system and most people that do troll know what key words to avoid/actions.\n\nYou can openly run down mid but as long as you type \"Sorry, I'm lagging\" or \"Oops, I'm having a bad game\" pretending to be positive you most likely will never get banned from the system just registering you having a bad game. There's a huge list of loop holes in the current system.","replies":[{"poster":"Rainfall","date":"2017-07-19T14:18:51.692+0000","up_votes":3,"down_votes":0,"body":"the sad part is that i see people who were calm and friendly all game flame the troll and i know that they will get punished for it eventualy because thats what the troll does,baiting others to flame them.","replies":[{"poster":"Starcraft243ver","date":"2017-07-19T16:26:41.607+0000","up_votes":2,"down_votes":0,"body":"They are punished for their own stupidity then.","replies":[]}]}]},{"poster":"Lùmen","date":"2017-07-20T14:39:14.708+0000","up_votes":2,"down_votes":0,"body":"No\nSimply no... If they're not toxic enough or don't int, there is no way for them to be penalized","replies":[]},{"poster":"Jeanne fan club","date":"2017-07-20T10:12:49.073+0000","up_votes":2,"down_votes":0,"body":"they get banned significantly less than toxic people which is a big red flag imo. there is a big difference between saying words and taking action. Toxic players can still try to win, but trolls will lose the game for you.","replies":[]},{"poster":"Hawckey","date":"2017-07-19T12:38:10.913+0000","up_votes":2,"down_votes":0,"body":"People who are good at trolling don't get banned. Only morons who sell all their items or type in chat or never touch an enemy champion while running circles in fountain get banned","replies":[{"poster":"verysalt","date":"2017-07-19T21:32:30.051+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Hawckey,realm=NA,application-id=ZGEFLEUQ,discussion-id=lEEKRAU1,comment-id=0002,timestamp=2017-07-19T12:38:10.913+0000)\n>\n> People who are good at trolling don&#x27;t get banned. Only morons who sell all their items or type in chat or never touch an enemy champion while running circles in fountain get banned\n\nThis","replies":[]}]},{"poster":"Mister Moët","date":"2017-07-19T20:19:09.018+0000","up_votes":4,"down_votes":2,"body":"I honestly think Riot doesn't ban trolls or intentional feeders. The reason being is that Riot doesn't care enough about average players. They only care about what's going to make them the most money and that's challenger players, League tournaments, LCS, and Worlds. But they will ban toxic players which doesn't make sense because there's literally a mute option. Why ban people who type words out instead of banning people who are actually making games impossible to play. Instead of trying to fix the problem Riot decides to implement an \"honor\" system to reward players who don't troll. This system doesn't fix anything because you gain nothing from being honored so there's no incentive to not troll. Plus, some people troll because they want to and think it's fun, so even if there was a reward for being honored it wouldn't make a difference. At least with an actual ban you're not able to play the game for a set amount of time.","replies":[]},{"poster":"LustFullMoon","date":"2018-01-05T13:57:32.206+0000","up_votes":1,"down_votes":0,"body":"i had tahm troll and i repored him and hope he gets ban or something","replies":[]},{"poster":"Prandine","date":"2017-07-20T00:02:33.119+0000","up_votes":1,"down_votes":2,"body":"Gameplay trolls do get banned, but the system has to make sure they're purposefully trolling and not just having a bad game or two. In case you don't believe me on this point [here are](http://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/sU5wOfFJ-proof-that-the-automated-system-is-broken?show=rundown) two examples of gameplay trolls being banned. Yes it's just two examples, but it proves that they do get punished.","replies":[{"poster":"Resolution","date":"2017-07-20T08:42:55.094+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Prandine,realm=NA,application-id=ZGEFLEUQ,discussion-id=lEEKRAU1,comment-id=000b,timestamp=2017-07-20T00:02:33.119+0000)\n>\n> Gameplay trolls do get banned, but the system has to make sure they&#x27;re purposefully trolling and not just having a bad game or two. In case you don&#x27;t believe me on this point [here are](http://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/sU5wOfFJ-proof-that-the-automated-system-is-broken?show=rundown) two examples of gameplay trolls being banned. Yes it&#x27;s just two examples, but it proves that they do get punished.\n\nWe do know they eventually* get banned. The issue is when/why does it take 40+ games of pure trolling. How many users experiences are ruined in the mean time? \n\nThat case was also manually reviewed not automatically by the system.\n\n> [{quoted}](name=Riot Tantram,realm=NA,application-id=ZGEFLEUQ,discussion-id=sU5wOfFJ,comment-id=002a00000000000100010000,timestamp=2016-06-21T22:49:29.272+0000)\n>\n> Your punishment was issued through manual review of the worse offenders. \n\nThe issue is the automatic system doesn't detect when this happens properly. There are dozens of examples of people testing this, YouTubers, Reddit, streamers - of people going 40-200+ games of pure offenses. The smart trolls can do this all day long with 0 care.","replies":[{"poster":"Prandine","date":"2017-07-20T08:50:20.438+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Resolution,realm=NA,application-id=ZGEFLEUQ,discussion-id=lEEKRAU1,comment-id=000b0000,timestamp=2017-07-20T08:42:55.094+0000)\n>\n> We do know they eventually* get banned. The issue is when/why does it take 40+ games of pure trolling. How many users experiences are ruined in the mean time? \n> \n> That case was also manually reviewed not automatically by the system. The issue is the automatic system doesn&#x27;t detect when this happens properly. There are dozens of examples of people testing this, YouTubers, Reddit, streamers - of people going 40-200+ games of pure offenses. I know I&#x27;ve personally started to add people when I see this happens, and not once have I seen one banned.\n\nWhile I will admit that the system does need some serious work in more accurately detecting trolls, the OP specifically asked if they ever get banned, hence why I linked the examples that I did.","replies":[]}]}]},{"poster":"Worst Yi Eú","date":"2017-07-20T04:12:15.226+0000","up_votes":1,"down_votes":0,"body":"My account got banned because of trolls, feeders and i flamed, they are extremely good at acting like they are \"Lagging\" etc. And because Riot only will be able to see chat, you will be the one that get banned, that's why perma-ban for flame is stupid. And a lot of people love it. And the more people get banned, the more the trolls raise the price of their account, if they got a rare skin. Because more people banned with rare-skins, the more the value will raise. Also a lot of just evil people do it for the fun.","replies":[]},{"poster":"CantBanThisTroll","date":"2017-07-19T16:42:56.432+0000","up_votes":1,"down_votes":0,"body":"There has never been a troller-feeder banned and never will be UNLESS they verbaly abuse someone.The reason is the majority of the players are bad enough to be mistaken for trollers and ofc riot cant ban the majority:)","replies":[{"poster":"This Is Your Dad","date":"2017-07-19T20:41:10.483+0000","up_votes":1,"down_votes":1,"body":"Appropriate summoner name. I'm one of those bad players that loses track of his mouse and ults backwards as sion every once in a while. I want a different cursor, because when shit hits the fan I can't find mine in all the chaos.","replies":[]}]},{"poster":"Jiko shometsu","date":"2018-03-17T18:30:05.591+0000","up_votes":1,"down_votes":1,"body":"It's ez, just troll and do the shit you want, don't be toxic, dont spam chat. you can go 8 ranked games 0/20 and you won't get banned.","replies":[]},{"poster":"SpookyNeedle","date":"2017-07-20T06:59:21.995+0000","up_votes":1,"down_votes":1,"body":"That's an easy question, the answer is yes","replies":[]},{"poster":"verysalt","date":"2017-07-19T21:29:46.685+0000","up_votes":1,"down_votes":1,"body":"Stupid trolls yes. Clever Trolls trolls within game play rules.","replies":[]},{"poster":"Bobbinson","date":"2017-07-19T18:20:34.909+0000","up_votes":1,"down_votes":2,"body":"no","replies":[]},{"poster":"DuskDaUmbreon","date":"2017-07-19T14:42:47.728+0000","up_votes":1,"down_votes":2,"body":"Yes. They do. It takes a lot of time, as it must be done manually, but it's done.","replies":[]},{"poster":"Granduss","date":"2017-07-19T15:03:23.890+0000","up_votes":3,"down_votes":4,"body":"No they don't. Riot would rather release a system to reward good players (i.e. honor system) than deal with the problem.","replies":[]}]}