{"poster":"404 Manni","date":"2018-08-31T17:42:24.323+0000","title":"14 Tage Ban zu welchen Relationen?","subforum":"Spielerverhalten & Moderation","embed":{"description":"Post with 0 views.","url":"https://imgur.com/a/E9TVBHe","image":"https://i.imgur.com/QNEo5P6.jpg?fb"},"up_votes":1,"down_votes":14,"body":"Hey, Leute!\r\nIch habe gerade im SoloQ auf meinem Smurf (dieser account) einen Jungler gehabt, der legit boosted gespielt hat.\r\nIm n&auml;chsten Game habe ich ihn, wie der Zufall es so will, wieder in meinem Team gehabt. \r\nSelbstverst&auml;ndlich Instalock Rammus und runter gerannt.\r\n\r\nIch habe Honor Level 5 erreicht, nie einen Ban bekommen oder auch nur eine Anmerkung, dass irgendetwas unsportlich war. Weder auf diesem Account, noch auf meinen anderen.\r\nWoher kommt die Politik, dass ich mir anh&ouml;ren darf, dass ich ein Nazi bin, mich selbst vergasen soll, mich erh&auml;ngen soll etc, es reported wird und nicht einmal die Notification f&uuml;r &quot;A player was punished&quot; oder so kommt, doch sobald man runter rennt, direkt einen 14 Tage Ban, Honor Level lock, Ausschlu&szlig; von Clash, sollte es in diesem Jahrzehnt noch erscheinen, und keine Key fragments mehr bekommt?\r\nEin verlorenes Spiel ist verloren. Gerade als NA Unternehmen, Gender Diskussion dies das, sollte Riot doch das Wohlergehen der Spieler auf psychischem Level sehr am Herzen liegen - hier wird jedoch nichts unternommen.\r\n\r\nBan hin oder her - 14 Tage Ban f&uuml;r ein einziges Spiel runtergerannt und nichts f&uuml;r Todesdrohungen, Rassismus, Sexismus oder vergleichbare &Auml;u&szlig;erungen stehen in keiner Relation zueinander.\r\nLiebes Riot Team, kl&auml;rt mich auf, woher diese Diskrepanzen kommen.\r\n\r\nBesten Gru&szlig;,\r\nManni","replies":[{"poster":"Izaya Kumiho","date":"2018-08-31T18:24:12.165+0000","up_votes":5,"down_votes":0,"body":">**Einmaliges** runterrennen und 14 Tage Ban und einmaliges Beleidigen auf unterstem Niveau mit einem 10 Games Chat Ban?\n>Ban hin oder her - 14 Tage Ban für **ein einziges Spiel** runtergerannt und nichts für Todesdrohungen, Rassismus, Sexismus oder vergleichbare Äußerungen stehen in keiner Relation zueinander.\n\nNeben deinem Rammusgame, gab es auch dieses hier:\n\nhttps://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3748796774/237177797?tab=overview\n\n\n\n>Woher kommt die Politik, dass ich mir anhören darf, dass ich ein Nazi bin, mich selbst vergasen soll, mich erhängen soll etc, es reported wird und nicht einmal die Notification für \"A player was punished\" oder so kommt, doch sobald man runter rennt, direkt einen 14 Tage Ban, Honor Level lock, Ausschluß von Clash, sollte es in diesem Jahrzehnt noch erscheinen, und keine Key fragments mehr bekommt?\n\nWenn dich jemand beleidigt, hat dieser ebenfalls die Regeln gebrochen und gehört reported. Jedoch bekommst weder du, noch er eine Info über die Strafe des Gegenübers.\n(Das wird zum Schutz der Privatsphäre getan.)\n\n\n>Ein verlorenes Spiel ist verloren.\n\nUnd trotzdem macht es einen Unterschied, ob du bewusst 4 Spielern das Game verhauen hast, oder ob es eine Winchance gegeben hätte.\nRache ist nicht immer eine Lösung.","replies":[{"poster":"404 Manni","date":"2018-08-31T18:35:27.346+0000","up_votes":1,"down_votes":7,"body":"Okay, nächstes mal afk gehen und eine Warnung kassieren?\nMacht es das besser?","replies":[{"poster":"Don Brando","date":"2018-08-31T18:40:58.542+0000","up_votes":8,"down_votes":1,"body":"Lustig, wird bei uns im Kindergarten auch so gemacht. Beliebig kombinierbar mit Fußstampfen, oder auf dem Boden werfen und und so angestrengt heulen, bis man einen Hustenkrampf bekommt.\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"404 Manni","date":"2018-08-31T18:43:46.140+0000","up_votes":1,"down_votes":9,"body":"Danke für deinen, von Mehrwert für die Diskussion gespickten, Beitrag, Keyboardwarrior.\nIch versuche hier nur herauszufinden, wo welche Grenzen für welche Vergehen gelten und aus welchen Gründen.\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"Don Brando","date":"2018-08-31T18:58:31.170+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=404 Manni,realm=EUW,application-id=KYnfKGf0,discussion-id=EneE7BcY,comment-id=0002000000000000,timestamp=2018-08-31T18:43:46.140+0000)\n>\n> Danke für deinen, von Mehrwert für die Diskussion gespickten Beitrag, **Keyboardwarrior**.\n\nMalustarc, Ma-Lu-Starc... Steht oben links im Beitrag.\n\nWas hast du davon das herauszufinden? Um dann auf deinem Mainaccount für ähnliche Situationen Vergeltung üben zu können, ohne dass du bestraft werden kannst? Das System bestraft, nicht du. Das hat seinen Grund ;)\n\nIst es nicht besser, dich beim nächsten Mal nicht wie ein Arsch aufzuführen? Ich meine, du weißt doch gut genug, dass intentional feeding hart bestraft wird. Du warst nur überrascht, dass es dich schon beim ersten Vergehen erwischt hat. Dir war **bewusst** dass es sanktioniert wird und gibst deinen niederen Trieben dennoch nach. Das kannst du doch besser. Nimm es als Lehrgeld und don't be a dick. Die überwältigende Mehrheit der Spieler schafft das auch.","replies":[{"poster":"404 Manni","date":"2018-08-31T19:34:47.550+0000","up_votes":1,"down_votes":11,"body":"Ohne dein Profil anzusehen, lass mich raten...\nSilber 4, 15/20 Games in der History ARAMs, 4x draft Pick als Practice für die SoloQ und dann besagtes SoloQ, Main Rolle Support.\nJedes SoloQ Game, in dem ihr hinten liegt, wird \"focus guys, we got this\" im Chat gespammt.\nDu bist der Good Guy, der über allem anderen steht und an erster Stelle den Spaß im Spiel sieht.\nWenn dir irl jemand auf den Sack geht oder nervt, sagst du, obwohl du im recht bist ein kleines \"Entschuldigung\".\nUnd das ist jetzt kein persönlicher Angriff, aber du kommst rüber, wie ein Spieler, der keine Ahnung hat, wie das Spiel in den Grundzügen funktioniert, denn wenn du das wüsstest, weißt du, wie leicht man sich gegenseitig, auch ohne zu chatten und zu pingen, triggern kann.\n\n\nIch will es herausfinden, da ich Ungerechtigkeit rieche. Jedem rutscht mal ein \"fggt\" raus und nichts geschieht.\n\nWenn man nichts zu sagen hat, lässt man es. Auch das hat seinen Grund ;)\n\nUnd jetzt don't be a dick und wir lassen die Diskussion ohne weitere, unnötig lächerliche Kommentare hier stehen. Auch das schaffen viele andere.","replies":[{"poster":"Flughand","date":"2018-08-31T20:11:36.268+0000","up_votes":12,"down_votes":0,"body":"***","replies":[{"poster":"404 Manni","date":"2018-08-31T20:46:20.252+0000","up_votes":1,"down_votes":10,"body":"Das war im Sinne von \"Jedem, dem fggt rausrutscht, passiert nichts\".\nIch denke, ich hab ne ganz gute Idee davon, was welche Worte bedeuten^^\n\nGern geschehen.","replies":[]}]},{"poster":"Don Brando","date":"2018-09-01T00:24:51.733+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=404 Manni,realm=EUW,application-id=KYnfKGf0,discussion-id=EneE7BcY,comment-id=000200000000000000000000,timestamp=2018-08-31T19:34:47.550+0000)\n>\n> Ohne dein Profil anzusehen, lass mich raten...\n> Silber 4, 15/20 Games in der History ARAMs, 4x draft Pick als Practice für die SoloQ und dann besagtes SoloQ, Main Rolle Support.\n> Jedes SoloQ Game, in dem ihr hinten liegt, wird &quot;focus guys, we got this&quot; im Chat gespammt.\n> Du bist der Good Guy, der über allem anderen steht und an erster Stelle den Spaß im Spiel sieht.\n> Wenn dir irl jemand auf den Sack geht oder nervt, sagst du, obwohl du im recht bist ein kleines &quot;Entschuldigung&quot;.\n> Und das ist jetzt kein persönlicher Angriff, aber du kommst rüber, wie ein Spieler, der keine Ahnung hat, wie das Spiel in den Grundzügen funktioniert, denn wenn du das wüsstest, weißt du, wie leicht man sich gegenseitig, auch ohne zu chatten und zu pingen, triggern kann.\n> \n> \n> Ich will es herausfinden, da ich Ungerechtigkeit rieche. Jedem rutscht mal ein &quot;fggt&quot; raus und nichts geschieht.\n> \n> Wenn man nichts zu sagen hat, lässt man es. Auch das hat seinen Grund ;)\n> \n> Und jetzt don&#x27;t be a dick und wir lassen die Diskussion ohne weitere, unnötig lächerliche Kommentare hier stehen. Auch das schaffen viele andere.\n\n\nBoah, ich musste erst einmal nachsehen ob mein Besteck verbogen ist und alle Uhren noch gehen. Mit deiner Prädiktion würde es mich nicht wundern, wenn du es bald mit deinem Main nach ganz oben schaffst. Hast ja nun mehr Zeit auf diesem zu spielen ;)\n\n>Jedes SoloQ Game, in dem ihr hinten liegt, wird \"focus guys, we got this\" im Chat gespammt.\nDu bist der Good Guy, der über allem anderen steht und an erster Stelle den Spaß im Spiel sieht.\n\nbtw was wäre daran schlimm Ô_o Wieviel Geld verdienst du denn mit LoL, dass für dich noch mehr als Spaß am Spiel vorhanden ist?","replies":[]}]}]}]},{"poster":"Izaya Kumiho","date":"2018-08-31T19:07:46.195+0000","up_votes":3,"down_votes":4,"body":"> [{quoted}](name=Malustarc,realm=EUW,application-id=KYnfKGf0,discussion-id=EneE7BcY,comment-id=000200000000,timestamp=2018-08-31T18:40:58.542+0000)\n>\n> Lustig, wird bei uns im Kindergarten auch so gemacht. Beliebig kombinierbar mit Fußstampfen, oder auf dem Boden werfen und und so angestrengt heulen, bis man einen Hustenkrampf bekommt.\n> \n> {{sticker:slayer-pantheon-popcorn}}\n\nHey, das war jetzt echt nicht nötig. Du würdest es sicherlich auch nicht toll finden, wenn du durch etwas gestresst bist und ein 0815 User dich mit deinem Kindergartenkind vergleicht.","replies":[{"poster":"Don Brando","date":"2018-09-01T00:10:22.353+0000","up_votes":10,"down_votes":4,"body":"Ich vergleiche nicht ihn, sondern sein Verhalten mit dem eines Kindergartenkindes. Das möchte ich hier festhalten. Und ja, manchmal ist es nötig Leuten zu zeigen, wie unangemessen ihr Verhalten ist.\n\n> Hey, Leute!\nIch habe gerade im SoloQ auf meinem Smurf (dieser account) einen Jungler gehabt, der legit boosted gespielt hat.\n\nHier wird die Schuld für ein verlorenes Spiel ohne Einbezug seiner selbst bei jemand anderes gesucht. Ich hab mir das Spiel mal angesehen. In seiner Elo, Gold V, hat er es geschafft nach 20 Minuten Spielzeit\n\n* genau 5 Wards zu stellen\n\n* den zweitwenigsten Schaden von allen Spielern zu generieren\n\n* zumindest einen Goldvorteil von 300 zu erarbeiten - gegenüber seinem Support\n\n* rund 30% weniger CS als seine anderen Lanes zu erzielen\n\nMit diesen Stats würde ich die Fehler erst einmal bei mir suchen, bevor ich nach links und rechts schaue. **Fehlendes Schuldbewusstsein** zieht sich bis ins Vorschulalter...\n\n> Im nächsten Game habe ich ihn, wie der Zufall es so will, wieder in meinem Team gehabt.\nSelbstverständlich Instalock Rammus und runter gerannt.\n\nPuuh... Muss ich hier aufzeigen, was daran **kindisch** ist?\n\n> Ich habe Honor Level 5 erreicht, nie einen Ban bekommen oder auch nur eine Anmerkung, dass irgendetwas unsportlich war. Weder auf diesem Account, noch auf meinen anderen.\n\nHier wird die **Uneinsichtigkeit** deutlich. Mit Verweis auf einem anderen Account als Leumund^^\n\n> Woher kommt die Politik, dass ich mir anhören darf, dass ich ein Nazi bin, mich selbst vergasen soll, mich erhängen soll etc, es reported wird und nicht einmal die Notification für \"A player was punished\" oder so kommt, doch sobald man runter rennt, direkt einen 14 Tage Ban, Honor Level lock, Ausschluß von Clash, sollte es in diesem Jahrzehnt noch erscheinen, und keine Key fragments mehr bekommt?\n\nHier wird versucht, gern auch aufgrund von Unwissenheit, das Bann- oder Strafsystem als ungerecht darzustellen und damit auch seine Strafe perse, indem man die Zusammenhänge nicht richtig trennt. Nein, natürlich muss er sich nichts von alledem bieten lassen, und ja, er bekommt halt nicht jedes Mal eine Nachricht, wenn er \"zu recht\" reportet hat. Und trotzdem werden sie bestraft, ebenso wie er. Mit denselben Konsequenzen.\n\n>Ein verlorenes Spiel ist verloren. Gerade als NA Unternehmen, Gender Diskussion dies das, sollte Riot doch das Wohlergehen der Spieler auf psychischem Level sehr am Herzen liegen - hier wird jedoch nichts unternommen.\n\nMir kommen die Tränen bei seiner aufrichtigen Anteilnahme. Nur um in einem späteren Post folgendes nachzuschieben...\n\n>Jedem rutscht mal ein \"fggt\" raus und nichts geschieht.\n\nGut, das Verhalten hat jetzt nichts kindisches an sich, macht die Sache an sich auch nicht besser.\n\n> Ban hin oder her - 14 Tage Ban für ein einziges Spiel runtergerannt und nichts für Todesdrohungen, Rassismus, Sexismus oder vergleichbare Äußerungen stehen in keiner Relation zueinander.\n\nUnd hier wird noch einmal versucht das eigene Fehlverhalten zu relativieren, indem er Reportgründe einer anderen Kategorie als schlimmer darstellt. Auch hier sehe ich das Verhalten als kindisch an. Die Verstöße sind mit unterschiedlichen Strafen gewichtet. Das Maß darüber obliegt bei Riot.\n\nAlso für mich besteht sein OP zum größten Teil aus kindischem Verhalten - von dem ich hoffe, dass es nicht zur allgemeinen Haltung wird. Auch unter Stress ist dieses Verhalten nicht vorzeigbar und ich finde es auch nicht verteidigungswürdig.\n\nUnd wenn ich etwas gestresst bin, dann renne ich nicht 21 MInuten die Lanes herunter um 19 Mal getötet zu werden, ja ein Execute war dabei... Aber das beruhigt einen doch nicht? Gerade wenn ich gestresst bin, bin ich froh, wenn dann mal ein Wink von draußen kommt, der mir eine andere Sichtweise aufzeigt. Und wenn der **08/15 User** das macht, dann doch umso mehr. Der 08/15 User entscheidet mit seinen Reports doch, was eine Strafe bekommt, und nicht die 0,006% Perma banned for toxicity.","replies":[{"poster":"Izaya Kumiho","date":"2018-09-01T08:38:09.472+0000","up_votes":5,"down_votes":3,"body":"> [{quoted}](name=Malustarc,realm=EUW,application-id=KYnfKGf0,discussion-id=EneE7BcY,comment-id=00020000000000010000,timestamp=2018-09-01T00:10:22.353+0000)\n>\n> Ich vergleiche nicht ihn, sondern sein Verhalten mit dem eines Kindergartenkindes. \n\n\nDas macht es doch kein Stück besser. Würdest du sowas in der genannten Situation hören wollen, wenn schon davor das Thema von anderen Leuten x mal durchgenommen worden ist? ó_ò\n\n\n\n>Das möchte ich hier festhalten. Und ja, manchmal ist es nötig Leuten zu zeigen, wie unangemessen ihr Verhalten ist.\n\n\nAber nicht wenn es davor schon mehrfach getan worden ist. Du hast sicherlich recht mit dem, was du sagst, aber trotzdem war deine Anmerkung in dieser Form nicht nötig und eher kontraproduktiv. Du siehst doch wie er sich dir gegenüber verhält, oder?\n\nVergleiche auf diesem Level zu stellen, kannst du mit jüngeren Kindern immer gerne machen. Aber hier im Forum wäre es doch schon ganz nett, wenn sie die Leute zurück halten können. Schließlich ist das kein \"macht ihn fertig\"-Ort.\n\n\n> [...] Puuh... Muss ich hier aufzeigen, was daran **kindisch** ist? \n> Hier wird die **Uneinsichtigkeit** deutlich. Mit Verweis auf einem anderen Account als Leumund^^\n\n\n\nWie gesagt, grundsätzlich hast du i-wo schon recht, aber man muss es auch nicht übertreiben. Das lässt dich nur in einem schlechten Licht stehen.\n\n\n\n> Also für mich besteht sein OP zum größten Teil aus kindischem Verhalten - von dem ich hoffe, dass es nicht zur allgemeinen Haltung wird. Auch unter Stress ist dieses Verhalten nicht vorzeigbar und ich finde es auch nicht verteidigungswürdig.\n\n\nWenn ein Kind auf dem Boden liegt, weil es von 4-5 bedrängt wird, würdest du dann auch angerannt kommen, nur um dem \"Opfer\" der Gruppe einen Tritt in die Rippen zu geben?\n\nDu kannst ihm natürlich immer sagen, wie du die Sache siehst...aber dann bleibe doch bitte etwas freundlicher dabei.\nEr hat Fehler gemacht... und du machst auch einen, wenn du mit solchen Sprüchen um die Ecke kommst, um ein schlechtes Gewissen zu beschwören, welches er vielleicht schon hat. \n\n(Einsicht öffentlich zu zeigen, ist immer eine große Hürde für viele Menschen.)\n\n\n> Und wenn ich etwas gestresst bin, dann renne ich nicht 21 MInuten die Lanes herunter um 19 Mal getötet zu werden, ja ein Execute war dabei... Aber das beruhigt einen doch nicht? \n\n\n\nEs geht hier nicht um seine \"Rache-Games\". Er wird von jeder Ecke angesprochen. Du stresst diesen Spieler mit deiner Provokation natürlich auch. \n\n>Gerade wenn ich gestresst bin, bin ich froh, wenn dann mal ein Wink von draußen kommt, der mir eine andere Sichtweise aufzeigt. \n\n\nDas gilt vielleicht für dich, aber nicht zwingend auch für andere.","replies":[{"poster":"Don Brando","date":"2018-09-01T12:35:27.348+0000","up_votes":7,"down_votes":1,"body":"Hallo,\n\nwenn ich dich richtig verstehe, kritisierst du die Form, den Zeitpunkt und die Notwendigkeit, in Bezug auf bereits gegebene Kommentare zu dem Eingangspost. Das kann ich so nicht nachvollziehen.\n\nDa das Thema zu dem Zeitpunkt vielleicht eine Stunde alt war, und sich zudem nur Noxempire, auf diesen ging der TE gar nicht ein; Nerf Inori Pls, dessen Beitrag nicht so viel Substanz zum eigentlichen Thema liefert (no offense!); Legos Diskussionsstrang, worauf dann mit Polemik und falschen Tatsachen geantwortet wird; und eben dein Beitrag, den er mit\n\n> Okay, nächstes mal afk gehen und eine Warnung kassieren?\nMacht es das besser?\n\nquittiert. Er hat gemerkt, dass inten nicht erwünscht ist und sofort hart bestraft wird. System sagt \"Böse!\". Du erläuterst was dahinter steht und das erste was kommt ist seine Überlegung, wie er beim nächsten Mal sein Team bestrafen kann, ohne dass es gleich zur Ultima Ratio kommt. Am ersten Tag seiner 14-Tagessperre. Meiner Ansicht nach ist in dem Spektrum noch Platz für meiner Kommentare. Wenn ich mit der Form meines Beitrages dazu beigetragen habe, dass sich das wie ein \"macht ihn fertig\"-Ort anfühlt, bitte ich bei dem Threadersteller aufrichtig um Entschuldigung. Die Analogie mit dem Kind war im Rückblick ebenfalls falsch gewählt.\n\nInhaltlich bleibe ich dabei und stütze mich auf dem, was die Matchübersicht von Riot mir zeigt und was der TE in seinen Posts von sich gibt. (Bei drei von zehn Punkten seiner Kaffeesatzleserei hat er sogar eine Punktlandung hingelegt. Geht auch schlechter...)\n\n>Wenn ein Kind auf dem Boden liegt, weil es von 4-5 bedrängt wird, würdest du dann auch angerannt kommen, nur um dem \"Opfer\" der Gruppe einen Tritt in die Rippen zu geben?\n\n> Du kannst ihm natürlich immer sagen, wie du die Sache siehst...aber dann bleibe doch bitte etwas freundlicher dabei.\nEr hat Fehler gemacht... und du machst auch einen, wenn du mit solchen Sprüchen um die Ecke kommst, um ein schlechtes Gewissen zu beschwören, welches er vielleicht schon hat. \n\nHier sehe ich die Gefahr, dass du Täter- und Opferrolle vertauschst. Der TE hat ein schlechtes Spiel gehabt, jeder in seinem Team hat dazu seinen Beitrag geleistet. Er erkennt den \"Schuldigen\" und trifft nächstes Spiel erneut auf ihn. Und er verhält sich nun einmal wie ein Arsch. Ohne Vorwarnung. Dann kann ich ihm auch freundlich umschreiben, was ich von seinem Verhalten denke. Das ändert aber nichts daran, wie er sich gegeben hat. Ich will sein Verhalten, nach einem schlechten Spiel die Schuld ausschließlich bei anderen zu suchen und im nächsten die Lanes herunter zu laufen, sowie im Anschluss nach der berechtigten Strafe einen Thread zu eröffnen, in dem er mit Verschwörungstheorien und Halbwahrheiten um sich wirft; nicht als \"Opfer der Gruppe\" darstellen.\n\nDa er bereits eine Stunde nach Eröffnung seines Threads hiermit geschlossen hat,\n\n> Danke erstmal für die ganzen Antworten,\nIch hoffe, das hat mehr oder weniger gezeigt, wie komplett undurchsichtig das Report System ist und dass es obviously nicht gut funktioniert\nAussagen wie \"Die bekommst WIRKLICH nicht bei jedem Ban Feedback\" lasse ich ohne Beweise dafür nicht gelten. Versteht ihr, den Weihnachtsmann gibt es WIRKLICH.\n\n> Wünsche allen einen schönen Abend und Erfolg in der Kluft!\n\nwürde es mich interessieren worum es ihm deiner Meinung nach ging.","replies":[{"poster":"Izaya Kumiho","date":"2018-09-01T13:22:44.632+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Malustarc,realm=EUW,application-id=KYnfKGf0,discussion-id=EneE7BcY,comment-id=0002000000000001000000000000,timestamp=2018-09-01T12:35:27.348+0000)\n>\n> Hallo,\n> \n> wenn ich dich richtig verstehe, kritisierst du die Form, den Zeitpunkt und die Notwendigkeit, in Bezug auf bereits gegebene Kommentare zu dem Eingangspost. Das kann ich so nicht nachvollziehen.\n\n\nEs geht mir eher darum, wie du es gesagt hast. Eine Provokation war in dieser Form nicht nötig. \nDer Zeitpunkt ist dort weniger wichtig. Denn wie du selber sagtest:\n\n>Dann kann ich ihm auch freundlich umschreiben, was ich von seinem Verhalten denke.\n\nUnd darum geht es. Versuche doch nicht extra ihn auf die Palme zu bringen. Da läuft der Lernerfolg wahrscheinlich in eine falsche Richtung. \n\n> Hier sehe ich die Gefahr, dass du Täter- und Opferrolle vertauschst. Der TE hat ein schlechtes Spiel gehabt, jeder in seinem Team hat dazu seinen Beitrag geleistet. Er erkennt den &quot;Schuldigen&quot; und trifft nächstes Spiel erneut auf ihn. Und er verhält sich nun einmal wie ein Arsch. Ohne Vorwarnung. \n\n\n\nDas ist richtig und sein Verhalten war auch nicht okay.\nAber Feuer mit... naja.. \"Feuer\" zu bekämpfen, bringt dich hier nicht weiter. Auch wenn es ein Hint gewesen sein soll, damit sich der TE nicht nochmal so sehr daneben benimmt.\n\nDie Dinge bleiben auf zwei Wegen im Kopf hängen: durch Freundlichkeit, oder Extrembeispiele die sehr schmerzhaft/traumatisierend sein können.\n\nAlles dazwischen kann mit einer sehr großen Wahrscheinlichkeit schnell wieder raus fliegen.\n\n(Natürlich ist das alles situationsbedingt. Wenn jemand einen Mord begangen hat, wird er vielleicht weniger durch \"freundliche Worte\" aus deinem Fehler lernen. Aber ihm zu sagen \"du bist ein a-ehem\", wird ihm keine Message hinterlassen. Die meisten Leute benutzen umgangssprachlich Beleidigungen im Alltag, ohne eine große Bedeutung dahinter zu haben. So z.B. auch ich, oder die, die um mich herum sind.)\n\n\nUnd die Situation die wir hier haben, zeigt einen TE, welcher von uns allen gesagt bekommen hat, wieso seine Taten nicht die klügsten gewesen sind. Dementsprechend hat er sich bereits vor die Hunde geworfen.\nWir lassen ihn jedoch mit seinen Gedanken zu der Lage in Ruhe, denn es ist nicht unsere Aufgabe, ihm nur wegen zwei Games stark zu erziehen.\n\n\n\n\n\n\n>Das ändert aber nichts daran, wie er sich gegeben hat. Ich will sein Verhalten, nach einem schlechten Spiel die Schuld ausschließlich bei anderen zu suchen und im nächsten die Lanes herunter zu laufen, sowie im Anschluss nach der berechtigten Strafe einen Thread zu eröffnen, in dem er mit Verschwörungstheorien und Halbwahrheiten um sich wirft; nicht als &quot;Opfer der Gruppe&quot; darstellen.\n\nEs geht hier nicht mehr um die Games, sondern um das Gespräch.\nDie Sache war angesprochen worden, ob er seinen Fehler überdenken möchte, liegt nun bei ihm.\n\n\nWenn du deinen Comment immer davor kopierst und dann vor dem senden einmal F5 drückst, siehst du, was alles neu dazu gekommen ist und ob es sich für dich lohnt, deinen Spruch per paste zu veröffentlichen.\n\n\nUnd wenn du eher gesagt hättest:\"Ich finde dein Verhalten auch nicht so cool aus dem und diesen Grund\", ohne ihn mit Vergleichen \"niedriger\" zu stellen, dann ist alles okay. Das ist dir komplett frei. **Du kannst deine Meinung immer sagen.**\nNur achte halt bitte auf die Wortwahl.\n\n...\nich meine..\nwo sind wir denn?:P\n\n\n\n\n> Da er bereits eine Stunde nach Eröffnung seines Threads hiermit geschlossen hat,\n> Ich hoffe, das hat mehr oder weniger gezeigt, wie komplett undurchsichtig das Report System ist und dass es obviously nicht gut funktioniert\n> Aussagen wie &quot;Die bekommst WIRKLICH nicht bei jedem Ban Feedback&quot; lasse ich ohne Beweise dafür nicht gelten. Versteht ihr, den Weihnachtsmann gibt es WIRKLICH.\n> \n> würde es mich interessieren worum es ihm deiner Meinung nach ging.\n\n\n\nWie ich bereits sagte...\n\n\"Einsicht öffentlich zu zeigen, ist immer eine große Hürde für viele Menschen.\"\nZwar sagte man ihm zur Sicherheit nochmal was die Punkte genau Bedeuten sollen, aber damit hat sich das Thema für uns.\n\n\n\n\n**Um den Thread nun nicht weiter mit unserem Gespräch zu pushen, wird das meine letzte Antwort hierzu gewesen sein. Sei lieb zu den anderen Leuten und wähle deine Worte mit Bedacht. Have a nice day o/**","replies":[]}]}]}]}]}]},{"poster":"Izaya Kumiho","date":"2018-08-31T18:52:46.780+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=404 Manni,realm=EUW,application-id=KYnfKGf0,discussion-id=EneE7BcY,comment-id=00020000,timestamp=2018-08-31T18:35:27.346+0000)\n>\n> Okay, nächstes mal afk gehen und eine Warnung kassieren?\n> Macht es das besser?\n\nActually....**für dich, ja.** Lol.\nLike...seriously, was'n das für ne Frage? \nBeides ist doof, aber wenn du auch nur da bist, um den Gegnern mehr Gold zu geben...\nerr...i dunno, ist halt sehr für'n Popo.\nDamit möchte ich Afking nicht gut reden...das ist genauso \"uncool\". \n\nAber weisst du was dir eher hilft?\n(Und ja, das ist jetzt auch nicht die feine Art..und ich würde es auch eigentlich niemanden empfehlen)\n\nWenn du bei sowas einfach dodgen gehst. \nDu siehst den Deppen, du weisst er wird mies af spielen -> geh dodgen. \nRaus aus der Selection. Die 3 LP tun dir nicht weh und die 5 Minuten kannst du mal warten. \nBesser als 4 Leuten 12- 22 LP zu kosten und dir einen Tempban für pseudo Racheaktionen zu fangen.\n\nDodge halt nur nicht zu oft. Manchmal haben die Leute halt ein schlechtes Game gehabt und spielen im nächsten wie ein Gott.\nUnd i-wann findet das System dein gedodge auch nicht mehr so lustig. Keep that in mind.\nAber hey, ein oder zweimal dodgen bringt die Welt nicht um. (mit einem großen Zeitraum inbetween natürlich...)\n\n...oh und du solltest dir jetzt nichts mehr zuschreiben lassen, sonst bist du instant bei 'nem Permaban.\n\n(Es dauert extrem lange, um wieder auf eine relativ neutrale Stufe zu kommen.)","replies":[{"poster":"Bettnachleger","date":"2018-09-01T09:14:30.871+0000","up_votes":5,"down_votes":1,"body":"> Actually....für dich, ja. Lol.\n> Like...seriously, was'n das für ne Frage?\n> Beides ist doof, aber wenn du auch nur da bist, um den Gegnern mehr Gold zu geben...\n> err...i dunno, ist halt sehr für'n Popo.\n\nMehh, kannst du dich so halbwegs fuer eine Sprache entscheiden?\nUnangenehm zu lesen :(","replies":[{"poster":"Izaya Kumiho","date":"2018-09-01T10:08:10.865+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Bettnachleger,realm=EUW,application-id=KYnfKGf0,discussion-id=EneE7BcY,comment-id=0002000000010001,timestamp=2018-09-01T09:14:30.871+0000)\n>\n> Mehh, kannst du dich so halbwegs fuer eine Sprache entscheiden?\n> Unangenehm zu lesen :(\n\nBut ofc! Für dich spreche ich _**denglisch**_ only. :3 <3\n{{sticker:sg-lulu}}","replies":[{"poster":"Bettnachleger","date":"2018-09-01T10:10:24.744+0000","up_votes":1,"down_votes":0,"body":";D","replies":[]}]}]},{"poster":"LegendaryXenon","date":"2018-09-01T06:11:40.867+0000","up_votes":2,"down_votes":3,"body":"Die Strafen für Flamen und Feeden sind getrennt.","replies":[{"poster":"Izaya Kumiho","date":"2018-09-01T08:15:39.700+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=LegendaryXenon,realm=EUW,application-id=KYnfKGf0,discussion-id=EneE7BcY,comment-id=0002000000010000,timestamp=2018-09-01T06:11:40.867+0000)\n>\n> Die Strafen für Flamen und Feeden sind getrennt.\n\n....ah, jetzt weiss ich, was du von mir möchtest..nach 10 Minuten nachdenken xP\n\nWenn sein Account einen Tempban aus i-einen Grund bekommen hat, wird er bei jeder Art von Regelbruch mit einem Perma bestraft.","replies":[{"poster":"LegendaryXenon","date":"2018-09-01T08:34:37.617+0000","up_votes":1,"down_votes":2,"body":"Du willst mir sagen, dass wenn er für Feeden einen 14d ban hatte, automatisch bei einer kleinen verbalen Entgleisung, die eine CR verursachen würde, ein Perma erfolgt? \n\nDa hätte ich gerne einen Beleg oder eine Bestätigung von einem anderen Volu. Bisher wurde das hier im Forum nämlich anders kommuniziert.","replies":[{"poster":"drexxsack","date":"2018-09-01T08:59:50.829+0000","up_votes":3,"down_votes":0,"body":"Da der Feederbuster teil des IFS ist(auch wenn es sinn ergibt, sie als getrennte einheiten zu sehen), sollte der übliche Strafablauf auch gelten: Nach den 14 Tagen ist für das nächste Vergehen gleich welcher Art auch immer der Permabann vorgesehen.\nMir ist jetzt aber auch kein Fall bekannt der das ganze bestätigen oder widerlegen würde. Leute die vom Feederbuster erwischt wurden haben jetzt nicht so unbedingt die Eigenschaft gezeigt, im Forum nochmal aufzutauchen.\nDas wäre meine Sicht dazu.\n\nEs gibt aber auch andere in unseren Reihen, die der Ansicht sind, dass das nicht so ist. Hauptargument ist, dass es zwei unterschiedliche Typen von Toxicity sind.\n\nIn unsere schier endlosen List an Riotquellen konnte ich jetzt auch nichts eindeutiges finden.\n\nLong Story short: Wir wissen es nicht zu 100%","replies":[{"poster":"LegendaryXenon","date":"2018-09-01T10:00:18.669+0000","up_votes":2,"down_votes":2,"body":"Danke dafür, dann vertrete ich weiterhin das, was ich bisher gelesen/ gehört habe.","replies":[]}]}]}]}]}]}]}]},{"poster":"legofreak1","date":"2018-08-31T17:48:38.732+0000","up_votes":6,"down_votes":2,"body":"Woher willst du wissen, ob andere Spieler eine Strafe erhalten oder nicht? Diese Meldung bekommst du bei weitem nicht in jedem Fall, sondern nur gelegentlich.\n\nAlle Fälle werden außerdem getrennt voneinander betrachtet. Da du in [besagtem Spiel](https://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3750216783/237177797?tab=overview) eindeutig absichtlich gefeedet hast, ist eine Strafe definitiv gerechtfertigt, egal wie du dein Verhalten begründest. Wenn du einen Groll gegen einen anderen Mitspieler hegst, gibt dir dies nicht das Recht, deine Frustration an deinem restlichen Team auszulassen und das Spiel für die restlichen 8 Spieler zu ruinieren.","replies":[{"poster":"404 Manni","date":"2018-08-31T18:08:27.756+0000","up_votes":1,"down_votes":5,"body":"Dass ich eine Strafe verdient habe, steht außer Frage und habe ich auch gern in Kauf genommen.\n\nDie Frage ist nur, wo die Grenze gezogen wird.\nEinmaliges runterrennen und 14 Tage Ban und einmaliges Beleidigen auf unterstem Niveau mit einem 10 Games Chat Ban?\nUnd die Aussage \"Wir sagen dir einfach nicht, ob wir jemanden bestraft haben, oder nicht und geben nur ab und zu Meldung durch\"... kommt schon, Rito, das ist ne schwache Ausrede dafür, dass nicht alle Reports durchgesehen werden bzw. zumindest nicht jeder, der gegen den Beschwörerkodex verstößt, bestraft wird. Haben wir ja digital unterschrieben, dass sich jeder Spieler daran hält.","replies":[{"poster":"legofreak1","date":"2018-08-31T18:16:16.876+0000","up_votes":3,"down_votes":0,"body":"Für Flaming können auch Strafstufen übersprungen werden, wie es üblicherweise bei extremen, homophoben, rassistischen oder sexistischen Beleidigungen und Drohungen der Fall ist und man steigt direkt beim 14 Tage Ban ein. \"Normales\" flamen, Blaming, Aufrufe zu Reports, etc führen hingegen meist nur zu einer CR und man arbeitet sich dann die Leiter nach oben hoch. Absichtlich zu Feeden ist allerdings eine Bewusste Handlung, welche du in der Champselect bereits beschlossen und dann für 20 Minuten durchgehalten hast. Ich behaupte, dir war bewusst, dass dies ein Regelverstoß war und dass du dies getan hast, um deinem Mitspieler bzw damit deinem Team größtmöglich zu schaden. Entsprechend hoch ist auch die Strafe dafür.","replies":[{"poster":"404 Manni","date":"2018-08-31T18:31:40.837+0000","up_votes":2,"down_votes":6,"body":"Hmhm, klingt durchaus willkürlich.\nIch meine, für Aussagen wie \"Go gas yourself\" oder sonstiges, kann man auch außerhalb eines Videospiels bestraft werden. Hier ist es definitiv nicht der Fall. Das ist den meisten Leuten ja auch bekannt und wird mit einer Disziplin, von Gott gegeben, durchgehalten.\n\nDa der Aussage, dass nicht alle Reports angesehen bzw. vernünftig geahndet werden, nicht widersprochen wurde, nehme ich das einfach mal als bestätigt an. Oder nicht?\n\nNaja, mit der Doppelmoral, die an den Tag gelegt wird im Hause Riot, vergrault man schon einige Spieler. Gerade bei der rückgängigen Spielerzahl, den Clash Problemen und der negativen Sexismus-Diskussion, sollte doch daran gelegen sein, dass in dem Spiel Gerechtigkeit herrscht. Svenskeren, zwar ein Pro, aber im Prinzip ein League Spieler, wurde übrigens von den Worlds gebannt, weil er seinen Smurf \"TaipeiChingChong\" nannte. Niemand wird in der SoloQ dafür gebannt. Entweder man greift ähnlich hart überall durch oder lässt es komplett sein.\n\nAuf der anderen Seite, wird hier aber auch die aktuelle Strategie und Ansicht der Firma, perfekt widergespiegelt. Vielleicht bin ich einfach nur beim falschen Spiel.\n\nWerde mich jedenfalls auf dem Markt umsehen und erstmal etwas anderes spielen. \nAllen noch einen schönen Abend!","replies":[{"poster":"legofreak1","date":"2018-08-31T18:53:25.927+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=404 Manni,realm=EUW,application-id=KYnfKGf0,discussion-id=EneE7BcY,comment-id=0000000000000000,timestamp=2018-08-31T18:31:40.837+0000)\n>\n> Hmhm, klingt durchaus willkürlich.\n> Ich meine, für Aussagen wie \"Go gas yourself\" oder sonstiges, kann man auch außerhalb eines Videospiels bestraft werden. Hier ist es definitiv nicht der Fall.\n\nWenn du der Ansicht bist, das ein Spieler gegen geltendes Recht verstoßen hat, kannst du bei der Polizei Anzeige erstatten. Ferner steht es dir frei, das Fehlverhalten eines Spielers direkt beim [Support](https://support.riotgames.com/hc/de/requests/new) zu melden.\n\n> Da der Aussage, dass nicht alle Reports angesehen bzw. vernünftig geahndet werden, nicht widersprochen wurde, nehme ich das einfach mal als bestätigt an. Oder nicht?\n\nEin Report triggert eine Prüfung durch das [Instant Feedback System](http://en.volu-eu.org/pbkb_general_user_view.php?art=7), ein Machine-Learning basiertes Programm, das Chatlogs automatisch beurteilen kann.\n\n> Naja, mit der Doppelmoral, die an den Tag gelegt wird im Hause Riot, vergrault man schon einige Spieler. Gerade bei der rückgängigen Spielerzahl, den Clash Problemen und der negativen Sexismus-Diskussion, sollte doch daran gelegen sein, dass in dem Spiel Gerechtigkeit herrscht. Svenskeren, zwar ein Pro, aber im Prinzip ein League Spieler, wurde übrigens von den Worlds gebannt, weil er seinen Smurf \"TaipeiChingChong\" nannte. Niemand wird in der SoloQ dafür gebannt. Entweder man greift ähnlich hart überall durch oder lässt es komplett sein.\n\nPro-Spieler werden als Vorbilder nochmal an andere, höhere Standards gehalten. Das ist im echten Leben bei bekannten Persönlichkeiten auch nicht anders.\n\n> Auf der anderen Seite, wird hier aber auch die aktuelle Strategie und Ansicht der Firma, perfekt widergespiegelt. Vielleicht bin ich einfach nur beim falschen Spiel.\nWerde mich jedenfalls auf dem Markt umsehen und erstmal etwas anderes spielen.\nAllen noch einen schönen Abend!\n\nDu kannst jederzeit aufhören zu spielen. Niemand zwingt dich ein Spiel zu spielen, an dem du keinen Spaß hast.","replies":[]},{"poster":"eingew","date":"2018-09-01T07:27:48.121+0000","up_votes":2,"down_votes":0,"body":"Doppelmoral wäre es, würde man dich trotz deines Fehlverhaltens nicht bestrafen, bloß weil dich jemand anderes provoziert hat. Genau das ist nicht passiert. Stattdessen bestraft Riot euch *beide* - worüber ich persönlich mich als neutraler Dritter im Spiel sehr freuen würde, hättet ihr doch *beide*, wäre ich im Spiel dabei gewesen, meine Runde versaut.\n\n> Gerade bei der rückgängigen Spielerzahl, den Clash Problemen und der negativen Sexismus-Diskussion, sollte doch daran gelegen sein, dass in dem Spiel Gerechtigkeit herrscht.\n\nÜbrigens ist keines dieser Probleme relevant für dein Fehlverhalten!\n\n> Svenskeren, zwar ein Pro, aber im Prinzip ein League Spieler, wurde übrigens von den Worlds gebannt, weil er seinen Smurf \"TaipeiChingChong\" nannte. Niemand wird in der SoloQ dafür gebannt.\n\nUnd das ist auch gut so, soweit ich erkennen kann ist da nämlich mehr vorgefallen und Svenskeren hat sich auf andere Weise über den Spieler lustig gemacht. Sich alleine durch den Namen angegriffen zu fühlen halte ich allerdings für eine massiv überzogene Reaktion - soll ich mich durch die zig Amis angegriffen fühlen, die sich auf recht ironische Art und Weise an der deutschen Sprache versuchen und durch ziemlich bescheuerte Aussprache daran scheitern? Komische Versionen von Oktoberfesten durchführen? Sagen, dass Deutsche den ganzen Tag bloß Bier saufen und Sauerkraut fressen? Da müssen offensichtlich einige Leute dringend an ihrem Selbstbewusstsein arbeiten...","replies":[]},{"poster":"4 Ever TaIone","date":"2018-08-31T20:56:40.116+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=404 Manni,realm=EUW,application-id=KYnfKGf0,discussion-id=EneE7BcY,comment-id=0000000000000000,timestamp=2018-08-31T18:31:40.837+0000)\n>\n> Hmhm, klingt durchaus willkürlich.\n> Ich meine, für Aussagen wie &quot;Go gas yourself&quot; oder sonstiges, kann man auch außerhalb eines Videospiels bestraft werden. Hier ist es definitiv nicht der Fall. Das ist den meisten Leuten ja auch bekannt und wird mit einer Disziplin, von Gott gegeben, durchgehalten.\n> \n> Da der Aussage, dass nicht alle Reports angesehen bzw. vernünftig geahndet werden, nicht widersprochen wurde, nehme ich das einfach mal als bestätigt an. Oder nicht?\n> \n> Naja, mit der Doppelmoral, die an den Tag gelegt wird im Hause Riot, vergrault man schon einige Spieler. Gerade bei der rückgängigen Spielerzahl, den Clash Problemen und der negativen Sexismus-Diskussion, sollte doch daran gelegen sein, dass in dem Spiel Gerechtigkeit herrscht. Svenskeren, zwar ein Pro, aber im Prinzip ein League Spieler, wurde übrigens von den Worlds gebannt, weil er seinen Smurf &quot;TaipeiChingChong&quot; nannte. Niemand wird in der SoloQ dafür gebannt. Entweder man greift ähnlich hart überall durch oder lässt es komplett sein.\n> \n> Auf der anderen Seite, wird hier aber auch die aktuelle Strategie und Ansicht der Firma, perfekt widergespiegelt. Vielleicht bin ich einfach nur beim falschen Spiel.\n> \n> Werde mich jedenfalls auf dem Markt umsehen und erstmal etwas anderes spielen. \n> Allen noch einen schönen Abend!\n\nDu hast vollkommen recht!","replies":[]}]}]},{"poster":"LegendaryXenon","date":"2018-09-01T06:15:52.506+0000","up_votes":2,"down_votes":0,"body":"Die Einstiegsstrafe für Matchmanipulation ist 14 Tage\n\nWenn du vorher nie geflamed hast, bekommst  du hier die passende Strafe und nicht zwingend den Perma.\n\nDie beiden Strafarten laufen getrennt und daher ist es völlig egal, ob Du vorher nie geflamed hast. Inten wird so gesehen auch härter bestraft als Flamen auf moderatem Niveau, sobald es klar erkannt wird.","replies":[]},{"poster":"Noxempire","date":"2018-08-31T18:23:47.920+0000","up_votes":1,"down_votes":1,"body":"Ich schätze Mal du wirst mir nicht glauben, aber die von dir beschriebenen Delikte werden mindestens mit einem 14 Tage Ban bestraft. \n\nDas System zieht keine moralischen Grenzen, es ist automatisiert. \n\nBist du rassistisch Homophob etc zieht das eigentlich IMMER einen 14 Tage Ban nach sich ziehen, solange du Reportest. \n\nRennst du die Mitte runter um zu feeden, 14 Tage Ban, so sind die Regeln. \nDie Strafe mag für dich unverhältnismäßig erscheinen, aber Intfeeden kann nun Mal nicht anders bestraft werden. Was willst du haben? Ne Spielesperre? Ist doch quasi ein Ban. \n\nDu kannst dich Mal gerne durch die Foren Disskussionen hier durch klicken, du wirst jede Menge Leute finden, die gebannt worden sind für die von dir beschriebenen Sachen. \n\nBedenke dass du WIRKLICH nicht immer eine Rückmeldung bekommst nach einem Report.\n\nDas ist keine Ausrede, dass ist Riots gutes Recht, da sie nicht wollen dass man das System zu schnell durchschauen kann. \n\nLeute die sich über das Bansystem beschweren haben zu 99% sich nicht richtig damit auseinander gesetzt und du bist keine Ausnahme. ","replies":[]}]}]},{"poster":"404 Manni","date":"2018-08-31T18:39:21.330+0000","up_votes":2,"down_votes":6,"body":"Danke erstmal für die ganzen Antworten,\nIch hoffe, das hat mehr oder weniger gezeigt, wie komplett undurchsichtig das Report System ist und dass es obviously nicht gut funktioniert\nAussagen wie \"Die bekommst WIRKLICH nicht bei jedem Ban Feedback\" lasse ich ohne Beweise dafür nicht gelten. Versteht ihr, den Weihnachtsmann gibt es WIRKLICH.\n\nWünsche allen einen schönen Abend und Erfolg in der Kluft!","replies":[{"poster":"Soul92fly","date":"2018-08-31T18:52:21.380+0000","up_votes":3,"down_votes":0,"body":"[Hier](https://twitter.com/RiotSupport/status/776560376657879040) ein Beweis dafür, dass du nicht bei jedem Ban ein Feedback bekommst.\nWenn du mehr erfahren willst möchte ich dir noch den Artikel aus unserer [Player Behavior Knowledge Base](http://en.volu-eu.org/pbkb_general_user_view.php?art=7) nahelegen. Da steht noch mehr drin, mit Verweisen etc.","replies":[{"poster":"4 Ever TaIone","date":"2018-08-31T20:58:34.434+0000","up_votes":1,"down_votes":7,"body":"> [{quoted}](name=Soul92fly,realm=EUW,application-id=KYnfKGf0,discussion-id=EneE7BcY,comment-id=00030000,timestamp=2018-08-31T18:52:21.380+0000)\n>\n> [Hier](https://twitter.com/RiotSupport/status/776560376657879040) ein Beweis dafür, dass du nicht bei jedem Ban ein Feedback bekommst.\n> Wenn du mehr erfahren willst möchte ich dir noch den Artikel aus unserer [Player Behavior Knowledge Base](http://en.volu-eu.org/pbkb_general_user_view.php?art=7) nahelegen. Da steht noch mehr drin, mit Verweisen etc.\n\nDas sind keine Beweise, sondern nur einfache Behauptungen. Sowas kann jeder sagen/schreiben.","replies":[{"poster":"Izaya Kumiho","date":"2018-08-31T21:05:25.201+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=4 Ever TaIone,realm=EUW,application-id=KYnfKGf0,discussion-id=EneE7BcY,comment-id=000300000000,timestamp=2018-08-31T20:58:34.434+0000)\n>\n> Das sind keine Beweise, sondern nur einfache Behauptungen. Sowas kann jeder sagen/schreiben.\n\n...Und was wäre, wenn dein Fahrlehrer dir sagt, du hättest die Prüfung bestanden? Ist das dann auch einfach nur eine Behauptung, der du keinen glauben schenken kannst? Ówò","replies":[{"poster":"404 Manni","date":"2018-08-31T21:36:04.382+0000","up_votes":2,"down_votes":6,"body":"Naja, bis man den Führerschein in der Hand hält^^","replies":[{"poster":"Izaya Kumiho","date":"2018-08-31T21:43:47.840+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=404 Manni,realm=EUW,application-id=KYnfKGf0,discussion-id=EneE7BcY,comment-id=00030000000000000000,timestamp=2018-08-31T21:36:04.382+0000)\n>\n> Naja, bis man den Führerschein in der Hand hält^^\n\naber der Wisch kann ja dann auch ein Fake sein. Dann hat man dich um dein Geld betrogen, oder versucht dir eine furchtbare Wahrheit zu verschweigen.\n\nAnyway, was 4everTaLone vergessen hat, ist der Fakt das uns ein Riotler sehr warscheinlich nicht anlügen würde und man dessen Worte sehr wohl als \"Beweis\" nehmen kann.\nAußerdem sollte inzwischen anhand der Commentsection klar sein, wieso es nicht immer eine Nachricht gibt.","replies":[]}]}]},{"poster":"Soul92fly","date":"2018-08-31T23:24:23.940+0000","up_votes":4,"down_votes":1,"body":"Die Aussage des Riot Supports sollte Beweis genug sein.\nWas erwartest du denn? Das die alle internen Dateien veröffentlichen damit man sieht wie das IFS programmiert ist?\nTräum weiter^^\nDer Riot Support ist immerhin nicht \"jeder\".","replies":[]}]}]},{"poster":"Izaya Kumiho","date":"2018-08-31T19:05:55.957+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=404 Manni,realm=EUW,application-id=KYnfKGf0,discussion-id=EneE7BcY,comment-id=0003,timestamp=2018-08-31T18:39:21.330+0000)\n>\n> Danke erstmal für die ganzen Antworten,\n> Ich hoffe, das hat mehr oder weniger gezeigt, wie komplett undurchsichtig das Report System ist und dass es obviously nicht gut funktioniert\n> Aussagen wie &quot;Die bekommst WIRKLICH nicht bei jedem Ban Feedback&quot; lasse ich ohne Beweise dafür nicht gelten. Versteht ihr, den Weihnachtsmann gibt es WIRKLICH.\n> \n> Wünsche allen einen schönen Abend und Erfolg in der Kluft!\n\nOkay. \nGut...\nWas machst du, wenn du wirklich nie gefeedet hättest und es nur ein einfaches, minimal mieses Game gewesen wäre?\nNiemand sonst steht slightly negativ mit der kda da.\nDie Leute sind alle pre und flamen dich. Sie flamen und haben den Spaß ihres Lebens.\n\nUnd du? Du wirst reported.\nAber wie du schon sagtest, ist das System ja unfähig und wirft einen Tempban für 10/11/10 raus.\n\nUnd weisst du was noch besser ist?\nDie 4 Dudes wissen über deinen Perma bescheid. \"JA LOL DEM HABEN WIRS GEGEBEN ROFL!\"\nUnd weisst du was sie dann tun?\nSich daran aufgeilen und vielleicht in's Forum gehen.\n\"Ey das Reportsystem läuft so gut!\"\n\nUnd schon bald erzählen die das ihren anderen Freunden.. \"ey lass den mal adden, der ist so n feeder. vielleicht kann man ihn ja erneut einladen und dann nochmal reporten für den Perma! xxxxdddd\"\n\nUnd nein. Das Verhalten kann man inzwischen nicht nur auf Kinder, sondern Personen zuschreiben, die ü18 sind. Warum dem so ist?\nWillkommen im Internet. Ein Ort, welcher viele Menschen glauben lässt, ihr e-pen sei länger als das Lineal, mit welchen sie in der Schule verprügelt worden sind.\n\n\n\nAber warte.. was ist das?\nDas Reportsystem hat sich ja gar nicht für 10/11/10 gebannt...\nSondern für zwei Games in welchen du dich in die Gegnergruppe reingeworfen hast, um dein Team leiden zu sehen.\n\n**Und nein. Die Leute werden nicht wissen, ob du dafür einen Tempban bekommen hast. Niemand wird es ihnen sagen.\nWarum auch? Das geht die Leute nichts an.**\n\n**Und genau das gilt für jeden Spieler.**\n\nWenn du diesen einen Dude nun für Hatespeech, Flaming (verbal abuse) und whatever noch passiert ist, reported hast, dann wird er dafür sehr wahrscheinlich seine Strafe bekommen haben. Randinfo: nicht jede Strafe sieht gleich aus. Wobei Hatespeech (wenn du es denn auch wirklich angegeben hast) für einen Tempban sorgen dürfte.","replies":[]}]},{"poster":"AI Marko","date":"2018-08-31T18:01:05.947+0000","up_votes":3,"down_votes":1,"body":"erst heute habe ich mal wieder ein report feedback bekommen :D","replies":[{"poster":"404 Manni","date":"2018-08-31T18:07:08.364+0000","up_votes":1,"down_votes":2,"body":"Ab und an bekomme ich diese auch, jedoch nicht immer, auch wenn es ein eindeutiger Grund für einen Ban ist.","replies":[{"poster":"Angel Ayume","date":"2018-08-31T18:29:09.513+0000","up_votes":2,"down_votes":0,"body":"Liegt halt daran, dass man diese Meldung eben nicht immer bekommt, auch wenn ein Bann ausgesprochen wurde.","replies":[]}]},{"poster":"Griever168","date":"2018-08-31T18:17:57.537+0000","up_votes":3,"down_votes":7,"body":"\"Woher willst du wissen, ob andere Spieler eine Strafe erhalten oder nicht? Diese Meldung bekommst du bei weitem nicht in jedem Fall, sondern nur gelegentlich.\" \n\nNe sry das lasse ich nicht mehr gelten von euch. Ich habe so oft Spieler über Wochen gestalked, die mir Krebs gewünscht haben und Sachen geschrieben haben, die weit unter die Gürtellinie gegangen sind und keiner hat auch nur im Ansatz nen ban bekommen und ne Chatsperre für rassistische Äußerungen ist nicht ansatzweise ausreichend. Das System in der Form ist total für die Tonne und da muss echt was passieren. Ich gebe dir zwar Recht, dass absichtliches feeden keine Antwort ist aber man würde diesen Frust gar nicht haben, wenn Riot da mal seinen Job machen würde.","replies":[{"poster":"404 Manni","date":"2018-08-31T18:19:58.366+0000","up_votes":1,"down_votes":4,"body":"Mein Reden!","replies":[]}]}]},{"poster":"Abasin","date":"2018-09-03T06:57:43.488+0000","up_votes":2,"down_votes":2,"body":"> Selbstverständlich Instalock Rammus und runter gerannt.\n\nWas ist daran selbstverständlich? Ist es für Dich auch selbstverständlich wenn in Chemnitz die ganzen Nazis die Polizeiarbeit behindern und Selbstjustiz begehen? Auf die politische Dimension dessen was da schief läuft, will ich an der Stelle gar nicht eingehen.","replies":[{"poster":"eingew","date":"2018-09-03T08:53:11.975+0000","up_votes":1,"down_votes":0,"body":"> Ist es für Dich auch selbstverständlich wenn in Chemnitz die ganzen Nazis die Polizeiarbeit behindern und Selbstjustiz begehen? Auf die politische Dimension dessen was da schief läuft, will ich an der Stelle gar nicht eingehen.\n\nIst die so groß? 26. August: 800 Demoteilnehmer, keine Straftaten, 30. August, 1.550 Teilnehmer 2 Straftaten, 1. September, 9.500 Teilnehmer, 25 Straftaten, 2. September, 11.000 Teilnehmer, 37 Straftaten. Versteh mich nicht falsch, ich will keineswegs verharmlosen, was da alles passiert, mir scheint es aber, dass die Kommentare der Journalisten das exakte Gegenteil von Verharmlosung sind, nämlich eine Katastrophisierung. Daher kommt wahrscheinlich auch dein Ausdruck \"die ganzen Nazis\". Es sind sicherlich mehr davon in Chemnitz, als solche, die auch Straftaten begangen haben, die scheinen sich aber doch deutlich mehr zurückzuhalten, als man meinen könnte, wenn man Nachrichten schaut. Man sollte auch bedenken, dass diese Straftaten keineswegs alle verfassungswidrige Handlungen beinhalten oder überhaupt ausschließlich vom rechten Spektrum ausgehen, die sächsische Polizei meldet jedenfalls auch von der \"linken Seite\" der Demonstration diverse Straften. Und in Relation zu den schieren Massen an Menschen dort scheint mir die Anzahl der Straftaten doch vergleichsweise gering, selbst wenn die Dunkelziffer ein Vielfaches davon betragen sollte. Zumal, was eigentlich am wichtigsten ist, auch hier permanent am eigentlichen Thema vorbeigeredet wird, dessen Lösung den Zulauf zu den Neonazis von heute auf morgen stoppen und diese wieder zu einer irrelevanten Kraft werden ließe.\n\nAlso nichts für ungut, aber der Rammus scheint mir in Relation zu dem Schaden, den man in einem Leaguespiel verursachen kann und den Schaden, den man bei einer Demo verursachen kann (beziehungsweise eher im Vergleich zu anderen schadensträchtigen Demonstrationen, welche wir in den letzten Jahren in Deutschland sehen) und den Schäden, die tatsächlich jeweils verursacht wurden, im Rahmen des Vergleiches, doch relativ gesehen als schlimmerer Finger.","replies":[{"poster":"Abasin","date":"2018-09-03T10:57:35.368+0000","up_votes":1,"down_votes":0,"body":"Nun ja, Übertreibung macht anschaulich. Und aktuelle Berichte wie der, dass eine Marburger SPD-Gruppe auf dem Weg zum Bus (in Chemnitz) tätlich angegriffen wurde, tragen jetzt nicht gerade dazu bei, das Ganze etwas entspannter zu sehen.\n\nUngeachtet dessen sollte sich der TE klarmachen, dass er mit solchen Aktionen nur sich selbst schadet. Leute, die dermaßen arrogant sind, dass sie denken, sie stünden über allem und niemand könne ihnen was, zu denen dringt man nicht mit Umschreibungen durch.\n\nWas ich aber überhaupt nicht verstanden habe, ist dieser Satz von Dir. Ich habe ihn mir mehrfach durchgelesen und bin ratlos:\n\n> Also nichts für ungut, **aber der Rammus scheint mir** in Relation zu dem Schaden, den man in einem Leaguespiel verursachen kann und den Schaden, den man bei einer Demo verursachen kann (beziehungsweise eher im Vergleich zu anderen schadensträchtigen Demonstrationen, welche wir in den letzten Jahren in Deutschland sehen) und den Schäden, die tatsächlich jeweils verursacht wurden, im Rahmen des Vergleiches, **doch relativ gesehen als schlimmerer Finger**.\n\nSoll das jetzt bedeuten, dass der Rammus gefährlicher als die Demonstranten ist? Oder hast Du Dich schlichtweg verformuliert?","replies":[{"poster":"eingew","date":"2018-09-03T13:57:46.810+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Abasin,realm=EUW,application-id=KYnfKGf0,discussion-id=EneE7BcY,comment-id=000400000000,timestamp=2018-09-03T10:57:35.368+0000)\n>\n> Nun ja, Übertreibung macht anschaulich. Und aktuelle Berichte wie der, dass eine Marburger SPD-Gruppe auf dem Weg zum Bus (in Chemnitz) tätlich angegriffen wurde, tragen jetzt nicht gerade dazu bei, das Ganze etwas entspannter zu sehen.\n\nNein. Und das ist natürlich ebenfalls zu verurteilen. Aber was hat das mit Rechtsextremismus zu tun? Weiß man etwas über die Gruppe, was sie als solche auszeichnet? Die SPD böllert gerade in den Umfragen nach unten als gäbs kein morgen und scheint gerade hart an der 5% Marke zu arbeiten, die haben extrem viele Feinde.\n\n> Ungeachtet dessen sollte sich der TE klarmachen, dass er mit solchen Aktionen nur sich selbst schadet. Leute, die dermaßen arrogant sind, dass sie denken, sie stünden über allem und niemand könne ihnen was, zu denen dringt man nicht mit Umschreibungen durch.\n> \n> Was ich aber überhaupt nicht verstanden habe, ist dieser Satz von Dir. Ich habe ihn mir mehrfach durchgelesen und bin ratlos:\n> \n> Soll das jetzt bedeuten, dass der Rammus gefährlicher als die Demonstranten ist? Oder hast Du Dich schlichtweg verformuliert?\n\nNicht gefährlicher nein. Jedenfalls nicht für uns. Für die Runde League stellt er aber eine größere Gefahr da, als die Demonstranten für die Demokratie oder Ausländer dargestellt haben. Er hat die Runde League komplett versaut. Die Demonstration war aber keine eskalierte Straßenschlacht mit Toten und einem Sieg von Antidemokraten. Ich würde sogar sagen, dass eine weit überwiegende Mehrheit auch der \"rechten\" Seite der Demo (obwohl viele dort sich gar nicht unbedingt als Rechts bezeichnen würden, wie ich das mitbekommen habe), sich ganz klar als Demokraten bezeichnen würde und Demokraten, die Demonstrieren sind an sich erstmal ja ein Gewinn für die Demokratie, das ist ja \"gelebte Demokratie\" wie man so schön sagt, solange diese Demonstration in einem angemessenen Rahmen stattfindet. Denke mal das sieht man auch recht deutlich daran, dass die einzigen Flaggen, die ich bisher dort gesehen habe, solche der Demokratie waren, denn Schwarz, Rot und Gold sind ja die Farben der deutschen Demokratie - eine Flagge die echten Autokraten zuwider wäre. Und es gab ja quasi \"Selbstversuche\" von zB ethnischen Arabern, die durch die \"rechte\" Seite der Demo gelaufen sind und völlig unbeschadet wieder heraus kamen.","replies":[{"poster":"Abasin","date":"2018-09-04T07:33:19.344+0000","up_votes":3,"down_votes":1,"body":"Ok, dann divergiert unsere Ansicht zu den politischen Geschehnissen an dieser Stelle. Bei Extremisten jeder Couleur reagiere ich nun mal ein wenig empfindlich. Aber sei's drum. Ich denke, das können wir andernorts bei einer Tasse Kaffee - ich mag kein Bier - beser diskutieren.\n\nInnerhalb von LoL gebe ich Dir recht, Spiel versauen geht nicht, Strafe ok. \n\n> Die Demonstration war aber keine eskalierte Straßenschlacht mit Toten und einem Sieg von Antidemokraten.\n\nWenn das passiert wäre, dann wäre es schon zu spät. \n\n>  Ich würde sogar sagen, dass eine weit überwiegende Mehrheit auch der \"rechten\" Seite der Demo (obwohl viele dort sich gar nicht unbedingt als Rechts bezeichnen würden, wie ich das mitbekommen habe), sich ganz klar als Demokraten bezeichnen würde und Demokraten, die Demonstrieren sind an sich erstmal ja ein Gewinn für die Demokratie, das ist ja \"gelebte Demokratie\" wie man so schön sagt, solange diese Demonstration in einem angemessenen Rahmen stattfindet.\n\n...man kann sich auch auf eine \"wehrhafte\" Form der Demokratie berufen und seine Absichten dahinter verstecken. Man kann sogar Demokratie proklamieren und sie mit ihren eigenen Mitteln aushöhlen wollen. Der Wolf im Schafspelz bleibt halt immer noch ein Wolf. \nDas Problem ist die Verführbarkeit den unbedarften Masse, die gern den Weg des geringsten Widerstandes geht. Die einfache Lösungen für komplizierte Probleme will und auf die Versprechen derer hereinfällt, die solche einfachen Lösungen als machbar präsentieren.\n\n\n> Und es gab ja quasi \"Selbstversuche\" von zB ethnischen Arabern, die durch die \"rechte\" Seite der Demo gelaufen sind und völlig unbeschadet wieder heraus kamen.\n\nDen Teil hab ich nicht mitbekommen. {{sticker:slayer-jinx-unamused}}","replies":[]}]}]}]}]}]}