{"poster":"Epi","date":"2017-08-10T11:06:11.898+0000","title":"OCE Server Packet Loss","subforum":"Help & Support (OCE)","up_votes":4,"down_votes":0,"body":"Heyo friendly Oceanic Rioters!\r\n\r\nMyself and many others I know/encountered have been experiencing extreme packet loss over the past week, with it intensifying after the latest patch. All people questioned have extremely stable internet with speeds between 200mb - 1gb.\r\n\r\nAny help or info in regards to this would be greatly appreciated! If you have any questions please don&#039;t hesitate to ask.\r\n\r\nCheers,\r\nEpi","replies":[{"poster":"SephirothSG","date":"2017-08-15T07:17:06.399+0000","up_votes":1,"down_votes":0,"body":"Hey there,\n\nIf you're still experiencing significant packet loss could you please do the following for me;\n\n* [Switch to a public DNS](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues#wq5)\n* [Download WinMTR](https://sourceforge.net/projects/winmtr/files/WinMTR-v092.zip/download) and run a traceroute to the following IP. (Allow this to run for 5-15 minutes)\n  * 103.240.227.5\n* Once adequate time has passed, stop the traceroute, export your results as text.\n* Run the [ICSI netalyzr](http://netalyzr.icsi.berkeley.edu/).\n* Post back with a link to your WinMTR results (You can use [pastebin](http://pastebin.com/) for this) and the direct url to your ICSI netalyzr results.","replies":[]},{"poster":"         Swhyper","date":"2017-08-12T10:51:38.079+0000","up_votes":1,"down_votes":0,"body":"First try to repair client. If that does not work, try to run the client as administrator. If that does not work, then please disable fullscreen optimize as this function is still in beta for Windows. If that still does not work, please change your current DNS to Google's public DNS.\n\nIf above does not work try this: \n\nPlease disable both Game DVR and Game Bar.\n\nTo disable Game DVR, head to Settings > Gaming > Game DVR. Ensure the “Record in the background while I’m playing a game” option here is set to “Off”.\n\nTo disable the Game Bar, head to Settings > Gaming > Game Bar. Set the “Record game clips, screenshots, and broadcast using Game bar” option here to “Off”.\n\nHope this helped :D.","replies":[]},{"poster":"She Loves Me","date":"2017-08-11T11:17:19.938+0000","up_votes":1,"down_votes":0,"body":"pls fix","replies":[]}]}