{"poster":"Cat","date":"2019-11-11T16:09:55.964+0000","title":"FPS + Pantalla Congelada","subforum":"Charlas Generales","up_votes":107,"down_votes":2,"body":"Hola Riot &amp; Comunidad, no me paso mucho por los foros, pero desde este parche el estado del juego requería que venga por aquí, es la única forma que tenemos de expresarnos, hay 2 puntos:\r\n\r\n1.  Muchos jugadores tienen problemas de FPS desde este parche (y hasta incluso el anterior a este) en donde por momentos baja muchísimo y luego vuelve a estabilizarse.\r\n\r\n2. Pantalla Congelada en donde el juego literalmente queda congelado, la única solución es cerrar el juego &amp; volverlo a abrir (pueden cerrar sesión y volverla abrir, con control+alt+suprimir) esto es catastrófico ya que dejas a tu equipo jugando con 4 por cierto tiempo y puedes recibir penalización por abandono. \r\n\r\nPor favor comenten &amp; y apoyen el tópico , aún si no les pasa van a ver una cantidad enorme de jugadores en sus partidas AFK, que ni siquiera es culpa de esas personas, gracias por leer.","replies":[{"poster":"ElAstroHK","date":"2019-11-11T16:44:58.042+0000","up_votes":22,"down_votes":0,"body":"A mi me pasa lo de la pantalla congelada y no es por el pc ya que tengo un 1080 de tarjeta gráfica y un i5 de procesador","replies":[]},{"poster":"Gish","date":"2019-11-11T16:35:01.125+0000","up_votes":18,"down_votes":0,"body":"Si... Es verdad, mi PC no es la mejor pero tengo subidas de FPS y se me conjelo la pantalla varias veces.\n\nPor ahora encontré 2 soluciones:\n1. Bajar los gráficos del juego y desactivar los cambios a la grieta.\n2. Asegurarse que el juego tenga prioridad alta.\n\nSi esto sigue así la próxima temporada va a ser peor con los nuevos efectos visuales.","replies":[{"poster":"Aegis","date":"2019-11-11T20:41:32.311+0000","up_votes":4,"down_votes":0,"body":"Se les va a ir un montón de gente y será divertido ver eso, porque esos nuevos cambios tienen pinta de pedir más","replies":[{"poster":"DarkDragon550","date":"2019-11-11T23:24:49.900+0000","up_votes":2,"down_votes":0,"body":"yo creo que solo le dan prioridad a los de pc gama alta y no a los de gama media para abajo muy mal rito, deben pensar en todos no solo en algunos :(, porque hay veces que algunos desarrolladores no de lol sino de otros juegos que les da pereza hacer las configuraciones para las pc's gama media y baja.","replies":[]}]}]},{"poster":"GR33NGOBLIN","date":"2019-11-11T17:26:43.455+0000","up_votes":12,"down_votes":0,"body":"ya se viene hablando sobre esto hace como 15 dias, yo tambien tengo este problema de bajones random de fps ya sea en la base o en una teamfight. nadie de rito vino a decir algo ni nada, asique a esperar al proximo parche, o al otro, o al que le sigue despues de ese.","replies":[]},{"poster":"ppelusaa","date":"2019-11-11T16:54:08.181+0000","up_votes":12,"down_votes":1,"body":"digamos las cosas como son el LOL es un juego para todo publico lo juegan mucho por la sencilla razon que no requiere tanto rendimiento de pc o notebook , ahora le queiren pponer efectos especiuales estan loco el 20 % o mas tenemos una pc o  notebook de bajo rendimiento , en mi caso si tuviera una compu buena no estaria jugando este juego se los garantizo , perop como tengo una notebook mala juego esto porque es lo mas divertido con bajo rendimiento seria una tonteria poner mas graficos en pc de bajo rendimiento se iria una buena parte de la poblacion que juega lol","replies":[{"poster":"xM4XIx","date":"2019-11-11T17:22:52.104+0000","up_votes":8,"down_votes":0,"body":"Sii! De última que pongan alguna opción para habilitar/deshabilitar esos super gráficos, o que hagan otro programa del LoL aparte para los de rendimiento bajo o alto...","replies":[]}]},{"poster":"Ńadie me quiere","date":"2019-11-11T19:48:21.770+0000","up_votes":5,"down_votes":0,"body":"Ojala lo arreglen pronto, mis amigos y yo jugábamos mucho este juego, pero se ha puesto injugable con esto de los bajones de fps y los freezeos.{{champion:32}}","replies":[]},{"poster":"YSebas","date":"2019-11-11T23:58:55.505+0000","up_votes":4,"down_votes":0,"body":"Me pasó dos veces lo de la pantalla congelada. Ya ni ganas de jugar.","replies":[]},{"poster":"RvS Im deKsiwn","date":"2019-11-11T22:26:28.032+0000","up_votes":4,"down_votes":0,"body":"esta del asco el lol desde el ultimo parche y no es mi deseo dejarlo de jugar jaja","replies":[]},{"poster":"Visoka","date":"2019-11-11T22:01:30.290+0000","up_votes":4,"down_votes":0,"body":"Desde el parche pasado tengo bajones de fps y desde el último parche ahora tengo crasheos, tengo una potato pc pero antes del cambio de launcher me iba a 60 fps estables","replies":[{"poster":"A1an996","date":"2019-11-12T02:47:45.012+0000","up_votes":3,"down_votes":0,"body":"tal cual... desde que metieron urf el juego empezo a funcionar de la peor manera!","replies":[{"poster":"LixoverRequiem","date":"2019-11-12T21:45:49.101+0000","up_votes":1,"down_votes":0,"body":"URF no tuvo nada que ver, desde que metieron el nuevo TFT el juego empezó a ir como bazofia, literalmente ese mismo día en la mañana casi no podias ni entrar a partidas, se quedaba en la pantalla de \"aceptar\" infinitamente, y se empezaban a notar los congelamientos de pantalla y sobretodo los bajones ridículos de FPS.","replies":[{"poster":"A1an996","date":"2019-11-19T18:12:35.972+0000","up_votes":1,"down_votes":0,"body":"yo el problema lo tengo desde el parche de urf... no tenia problemas con tft aparte no juego tft si lo sacan no seria problema! pero los bajones de fps y crasheo hoy dia 19 de noviembre siguen ahi! ya desisntale lol porque es injugable! lo instalare mas adelante por ahi lo arreglan por ahi","replies":[]}]},{"poster":"LixoverRequiem","date":"2019-11-12T21:46:42.346+0000","up_votes":1,"down_votes":0,"body":"URF no tuvo nada que ver, desde que metieron el nuevo TFT el juego empezó a ir como bazofia, literalmente ese mismo día en la mañana casi no podias ni entrar a partidas, se quedaba en la pantalla de \"aceptar\" infinitamente, y se empezaban a notar los congelamientos de pantalla y sobretodo los bajones ridículos de FPS.\n\nAdemás si hubiera sido por URF ya se habría arreglado, porque ya lo sacaron, creo que más bien deberían sacar TFT y colocarlo con un launcher distinto como su propio juego.","replies":[]},{"poster":"LixoverRequiem","date":"2019-11-12T21:46:03.567+0000","up_votes":1,"down_votes":0,"body":"URF no tuvo nada que ver, desde que metieron el nuevo TFT el juego empezó a ir como bazofia, literalmente ese mismo día en la mañana casi no podias ni entrar a partidas, se quedaba en la pantalla de \"aceptar\" infinitamente, y se empezaban a notar los congelamientos de pantalla y sobretodo los bajones ridículos de FPS.","replies":[]}]}]},{"poster":"Mirtha Lebron","date":"2019-11-12T15:13:07.064+0000","up_votes":3,"down_votes":0,"body":"Mande un ticket a riot y no me respondieron absolutamente nada no puede ser que un juego con tanto prestigio no sepa solucionar un error que causaron ellos mismos","replies":[]},{"poster":"Evanz","date":"2019-11-12T05:18:49.176+0000","up_votes":3,"down_votes":0,"body":"Tal cual, a mi lo del freeze de la pantalla no me paso, pero los bajones de fps son HORRIBLES! Hay que decir que juego con una apu de amd de las viejitas, no de las ryzen, pero me iba bien, a 60 estables e incluso mas con todo en bajo... Ahora se caen a 5 o 6 fps cada nada, y cuand se normaliza ya paso la tf xD... Ojala lo arreglen pronto","replies":[]},{"poster":"Jasy Jateré","date":"2019-11-12T03:57:22.143+0000","up_votes":3,"down_votes":0,"body":"Es horrible y lo peor es que ningún rioter da la cara","replies":[]},{"poster":"k3ntracks","date":"2019-11-12T21:16:59.930+0000","up_votes":2,"down_votes":0,"body":"Ya me paso dos veces, estoy pensando en comprarme una Pc nueva con un Ryzen 3200 porque mi procesador es malisimo, y sospecho que es culpa del procedador, y ademas de eso, de vez en cuando estoy jugando a 60FPS y se ma baja como a 3FPS como por dos Minutos, alguien sabe a que se debe eso?","replies":[]},{"poster":"l WardWick l","date":"2019-11-12T21:16:10.899+0000","up_votes":2,"down_votes":0,"body":"Acabo de ser penalizado por leaverbuster de 20 minitos por no poder entrar a la partida literalmente se congelo al estar al 100% de carga se congelo y ahora mientras trato de quitarme la cola volvio a suceder tengo una i5 con 16 gb de ram y una 1060ti no se que sucede {{sticker:sg-ahri-1}}","replies":[]},{"poster":"HACKZ771","date":"2019-11-12T19:23:34.928+0000","up_votes":2,"down_votes":0,"body":"A mi de igual forma me pasa, desde la últimas actualizaciones que le pusieron a ido muy mal el lol, pero aunque lo escribas en reporte para ayudar a Riot para solucionarlo, de mayor forma van aumentando las actualizaciones  y va de mal en peor.\n\n\"NO\" todos tenemos buenos PC, pero somos una comunidad muy grande que a gran escala afecta y aburre para seguir jugando ya que la mayor parte del tiempo uno va pasando mucha rabia. (tirones de FPS \"y por ahora\" ya van 5 congelamiento de pantalla).\n\nEspero que se solucione pronto un saludo y adiós.","replies":[]},{"poster":"RelaxNOseaToxico","date":"2019-11-12T17:05:30.132+0000","up_votes":2,"down_votes":0,"body":"me pasa lo mismo","replies":[]},{"poster":"Dovahkinn12","date":"2019-11-12T16:45:37.342+0000","up_votes":2,"down_votes":0,"body":"a mi me paso hace poquito en plena promo a oro 1,minuto 20 se congelo la pantalla tuve que desconectarme y volver a conectarme pasaron como 8 minutos en el juego,casi la pierdo por esa cagada.","replies":[]},{"poster":"XxFuentesmati","date":"2019-11-12T16:07:17.180+0000","up_votes":2,"down_votes":0,"body":"ami no me deja entrar al lol me manda error","replies":[]},{"poster":"ultrasebax","date":"2019-11-12T15:54:56.176+0000","up_votes":2,"down_votes":0,"body":"Mi pc es una tostadora y con todo al minimo mis fps soguen bajos pero siempre estables. Desde el ultimo parche pasé varias partidas en las que tenia el mismo frame por 30 segundos o más","replies":[]},{"poster":"SebatrollGamer","date":"2019-11-12T15:10:21.697+0000","up_votes":2,"down_votes":0,"body":"Me pasa lo mismo espero que lo solucionen pronto","replies":[]},{"poster":"xAlex2120","date":"2019-11-12T14:10:35.026+0000","up_votes":2,"down_votes":0,"body":"Tambien eh tenido este error. Caida de Fps + Congelamiento de pantalla [El de pantalla es mucho peor porque tengo que reiniciar mi Laptop] y Todo esto comenzo a partir del Parche 9.22","replies":[]},{"poster":"Honkie Cat","date":"2019-11-11T23:16:50.914+0000","up_votes":1,"down_votes":0,"body":"Me sucede lo mismo desde el parche, tengo buen pc para jugar y desde que se actualizó el juego ni bajando la calidad/gráficos del juego mejora el rendimiento. También he intentado con la herramienta reparadora pero ni con eso se arregla. Espero que esto pueda solucionarse pronto! ^^","replies":[{"poster":"D4rKN3sS","date":"2019-11-12T00:37:14.526+0000","up_votes":2,"down_votes":0,"body":"Yo al principio creía que era mi PC, ya que es de gama baja, pero en cualquier otro juego me va bien, incluso en juegos que piden más que lol","replies":[{"poster":"DrakexD1","date":"2019-11-12T03:48:19.290+0000","up_votes":2,"down_votes":0,"body":"Me pasa lo mismo, tengo el World of Warships descargado, juego que pide requisitos mucho mayores que el LoL, y me va recontra bien","replies":[]}]}]},{"poster":"LostGuardian","date":"2019-11-12T02:29:49.718+0000","up_votes":2,"down_votes":0,"body":"Está injugable, en ARAM me va mucho peor que en la grieta.","replies":[]},{"poster":"RenKing","date":"2019-11-12T00:32:22.517+0000","up_votes":2,"down_votes":0,"body":"La pantalla se me ha congelado más de 5 veces en estos última semana. No se puede jugar así, molesta saber que dejas a tu equipo y cuando volvés, ya te lo cuenta como abandono o incluso no te reconecta.","replies":[]},{"poster":"the ghost500","date":"2019-11-11T22:42:30.233+0000","up_votes":2,"down_votes":0,"body":"Riot arreglen su juego luego, se a vuelto injugable con tanto bajón de fps aparte por causa de la congelación de pantalla me pusieron cola y no creo que solo a mi me aya pasado","replies":[{"poster":"A1an996","date":"2019-11-12T02:49:10.641+0000","up_votes":1,"down_votes":0,"body":"me acaban de banear por eso por crasheo de lol... 5 partidas 20min de espera","replies":[]}]},{"poster":"UrbanVip","date":"2019-11-11T20:00:17.520+0000","up_votes":2,"down_votes":0,"body":"Te apoyo","replies":[]},{"poster":"DrDaft4","date":"2019-11-13T00:22:17.196+0000","up_votes":1,"down_votes":0,"body":"Mi pc no es una super pc pero puede correr lol bien, me ca a 90 fps luego se me baja a 20 y la verdad la caida de fps se nota mucho. Tambien tengo el problema de que se me congela la pantalla, por suerte estoy en modo ventana sin bordes , ya que si estuviera en modo pantalla completa tendria que reiniciar toda la pc porque no me deja cerrar el programa, ni abrir el administrador de tareas porque se encuentra detras del lol","replies":[]},{"poster":"Orianna Lover","date":"2019-11-12T13:40:35.866+0000","up_votes":1,"down_votes":0,"body":"A mi también me pasa lo de la pantalla congelada, lo peor es que no me deja reconectar luego de cerrar la partida congelada","replies":[]},{"poster":"CRISTOXG21","date":"2019-11-12T12:01:31.540+0000","up_votes":1,"down_votes":0,"body":"a mi me pasan ambas cosas y vengo hace 1 mes intentando solucionarlo\n\n[](https://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/4dK2PEKd-desde-el-nuevo-cliente-tengo-bajan-de-fps-les-cuento-todo-lo-que-intente-pero-todavaua-sigue-f)\n\n{{champion:32}} {{champion:32}}","replies":[]},{"poster":"La Decadencia","date":"2019-11-12T10:03:59.558+0000","up_votes":1,"down_votes":0,"body":"https://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/AvqttLKe-soporte-bajones-de-fps-aumento-de-ping-sin-razon-retardo-en-las-habilidades-freezeos?show=nested","replies":[]},{"poster":"SKT Crow","date":"2019-11-12T06:42:57.292+0000","up_votes":1,"down_votes":0,"body":"existirá algún rioter en estos foros ajsjasj nunca dan respuestas a problemáticas. Cuanto mas tenemos que esperar?{{sticker:zombie-brand-mindblown}}","replies":[]},{"poster":"Alex Astete","date":"2019-11-12T06:07:50.213+0000","up_votes":1,"down_votes":0,"body":"Me pasa igual, mi pc es básica pero me estaba corriendo de 35 fps a 50 fps. Ayer ingrese, se actualizo, le doy a una clasificatoria flexible para probar a sena después de comprarla y me aparece 15 fps y en una batalla en bot baja a 10 fps y en nashor 5 vs 5 se congela :`v xk pasa esto? se solucionara o ya solo se podrá jugar en pc buenas y no en básicas :c ???","replies":[]},{"poster":"Iberiano","date":"2019-11-12T05:19:18.546+0000","up_votes":1,"down_votes":0,"body":"A mi me pasa algo parecido hay momentos  con tironeos (lagasos ) me quedo quieto y se normaliza ..pero es muy frecuente durante la partida ..y la baja de FPS hay veces que llegado a 12 - 15 FPS \n Deberian escuchar al pueblo ..que clama dignidad para jugar ! :)","replies":[]},{"poster":"Vetreto01","date":"2019-11-12T05:05:11.618+0000","up_votes":1,"down_votes":0,"body":"Es verdad, a mi me ocurre lo de pantalla congelada","replies":[]},{"poster":"lucasvsu","date":"2019-11-12T04:37:13.253+0000","up_votes":1,"down_votes":0,"body":"Hola desde el ultimo parche a mi y mi primo el juegos nos anda fatal, bajones de fps y cuando esta senna{{champion:235}}  en el juego es aun peor","replies":[]},{"poster":"DrPingüino","date":"2019-11-12T04:23:55.373+0000","up_votes":1,"down_votes":0,"body":"Si a mi también me paso eso, y fue cuando actualizaron el tft, cada partida se me bajaban los fps de golpe sin ningún motivo y también cada 1 de 3 partidas se me congelaba la pantalla y como yo uso un notebook de gama baja demoraba en reconectarme y ahora por culpa de eso me dio leave buster.","replies":[]},{"poster":"Angry Warwick","date":"2019-11-12T04:08:29.546+0000","up_votes":1,"down_votes":0,"body":"juego con mi novia y almenos se le pega (su pc no es el mejor) dos veces por partida es una lata tener que rankear y reconectar cada 20 minutos xD {{sticker:zombie-nunu-bummed}}","replies":[]},{"poster":"A1an996","date":"2019-11-12T02:44:47.609+0000","up_votes":1,"down_votes":0,"body":"hace dos parches que me empezo a funcionar muy mal... al inicio de partida todo bien,pero apenas me acerco a otro champ o en jungla el fps se me va de 60 a  00,04,07... y no sube de 10 fps! en tf no puedo siquiera luchar porque el juego se congela y solo me queda reiniciar y es muy molesto! ya recibi ban de 20min gracias a eso! espero arreglen el game!","replies":[]},{"poster":"Ignatus","date":"2019-11-12T00:42:18.420+0000","up_votes":1,"down_votes":0,"body":"Tengo el problema de los fps en la grieta, siempre tuve entre 60-80 y desde hace 2 o 3 parches atrás bajó a 35-50. En este último parche se me congela la pantalla en el tft, y si cierro y abro el juego no me deja volver a entrar, una paja todo esto.","replies":[]},{"poster":"Youdang","date":"2019-11-12T00:18:46.421+0000","up_votes":1,"down_votes":0,"body":"espero que lo arreglen luego porque me pasa lo mismo y no eh podido rankear 1 mes y riot games no se porque se demora tanto en arreglar los errores del juego.","replies":[]}]}