{"poster":"Kirasuika","date":"2019-02-16T00:50:28.582+0000","title":"Permitir cambiar idiomas dentro del juego","subforum":"Jugabilidad, balance y narrativa","up_votes":7,"down_votes":0,"body":"Seria una buena idea dejar a los jugadores poder poner el juego en distintos idiomas dependiendo de que doblaje les guste mas , o en el caso de alguien que sabe ingles y va de viaje a un lugar donde el idioma del cliente es español.\nSeria genial poder cambiar el audio del juego ya que no afecta la jugabilidad solo es un doblaje distinto y a algunos les podria gustar usar el doblaje coreano o japones , ingles etc.\n\n\nSi a alguien le gusta la idea porfavor comente y comparta esta idea para que riot la tome en cuenta.","replies":[{"poster":"Jaheje","date":"2019-02-16T01:47:21.035+0000","up_votes":4,"down_votes":1,"body":"Creo que la limitación es para que apreciemos el trabajo de los dobladores latinos, aún así la opción debería estar de todos modos, se puede cambiar mediante programas de terceros pero no sé si se corre riesgo de ban. :(","replies":[{"poster":"Smiterin0","date":"2019-02-16T06:54:31.853+0000","up_votes":1,"down_votes":0,"body":"Según lo que sé, no corre riesgo de ban, pero mejor no arriesgarse jaja.\nAdemás así valoramos el trabajo de los dobladores latinoamericanos^^","replies":[]}]},{"poster":"Muevan la Jarra","date":"2019-02-19T15:02:06.403+0000","up_votes":1,"down_votes":0,"body":"Los que mas sufren con esto son los españoles xd\n\nUlti de ivern: Margarita, realy?","replies":[]},{"poster":"IIIIIIIIIIIIIIII","date":"2019-02-16T22:10:23.444+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kirasuika,realm=LAS,application-id=xQmJPO8F,discussion-id=mpRBqjh4,comment-id=,timestamp=2019-02-16T00:50:28.582+0000)Seria una buena idea\n\nSi claro, el día en que el cliente funcione correctamente SI, de momento poner una opción así es darle un lugar mas al cliente en donde kgarla.","replies":[]},{"poster":"LaReinaPingüino","date":"2019-02-16T19:41:11.228+0000","up_votes":1,"down_votes":0,"body":"Yo he visto hasta en los foros gringos gente pidiendo y no escuchan {{sticker:sg-janna}}","replies":[]},{"poster":"DIELINK","date":"2019-02-16T01:26:20.787+0000","up_votes":1,"down_votes":1,"body":"ya viene siendo hora, no entiendo la limitacion de idioma por region xd","replies":[]}]}