{"poster":"xMaukelord","date":"2015-10-29T17:26:55.639+0000","title":"Master Yi (Combos, Richtig Spielen u.s.w)","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey Leude,\r\nich spiele seit etwa einem Jahr (wenn auch sehr unregelm&auml;&szlig;ig) LoL und habe eine Frage.\r\nIch weiss das es euch vielleicht etwas dumm vorkommen k&ouml;nnte da Master Yi nicht gerade der Boss-Champ ist sondern eher f&uuml;r\r\nAnf&auml;nger wie mich geeignet ist, jedoch w&uuml;rde ich gerne wissen ob ihr einige Tipps f&uuml;r mich habt wie ich ihn gut spielen kann, welche items\r\nich kaufen kann und ob es gute Kombos mit ihm gibt.\r\nDanke schonmal f&uuml;r antworten ^^\r\nLG \r\nZorro :)","replies":[{"poster":"gummiskl4ve","date":"2015-10-29T19:53:18.990+0000","up_votes":1,"down_votes":0,"body":"Also mit Master Yi gibts viele kleine Tricks und Kniffe um ihn richtig zu beherrschen. Zum Beispiel solltest du in der Anfangsphase beim clearen eines Camps darauf achten das du immer erst ein AA machst und dann deinen Q castest. So dodged du von den Monster ausgehenden Damage und hast dadurch mehr Sustain. Außerdem kannst du deine W benutzen um deine AAs zu resetten. Da dies viel Timing erfordert schaust du am besten mal bei Youtube vorbei, meines Wissens nach sollte es dort Guides geben die erklären wie man ihn meistern kann.","replies":[]},{"poster":"MeDontEnglish","date":"2015-10-29T17:34:04.121+0000","up_votes":1,"down_votes":0,"body":"Ich denke mal du spielst ihn im Jungle.\n\nUlt vor dem fight zünden also wenn du auf die Gegner zu läufst aber nicht zu früh, E aktivieren und die Q aufheben um skills zu dodgen oder einem gegner der wegflashet hinterherzukommen. Ansonsten gibt es bei Master Yi keine wirkliche Combo da er auf Autoattacks basiert.\n\nItems: {{item:3153}} {{item:3087}} {{item:3006}} {{item:3035}} {{item:3046}} {{item:3142}} {{item:3026}} {{item:3072}} {{item:3074}} kann man alles auf Master Yi bauen je nach Situation oder Vorlieben.","replies":[{"poster":"xMaukelord","date":"2015-10-29T19:31:58.244+0000","up_votes":1,"down_votes":0,"body":"Dankeschön für die schnelle Antwort sehr hilfreich jetzt probiere ich das mal aus :)","replies":[]}]}]}