{"poster":"1Baltazar1","date":"2017-04-05T22:39:10.561+0000","title":"Domanda ai main Soraka","subforum":"Campioni e gameplay","up_votes":1,"down_votes":1,"body":"Ho deciso di imparare a usare soraka e mi servirebbe qualche consiglio su rune, maestrie e build. Vedo su mobafire che la guida pi&ugrave; votata diceva di mettere quinte e marchi hp regen, ma altri mi hanno detto che sarebbero meglio ap e mana regen. \r\n\r\nConsigli?\r\n\r\nGrazie in anticipo!","replies":[{"poster":"Jack Garrus","date":"2017-04-06T10:33:41.932+0000","up_votes":1,"down_votes":0,"body":"Mana regen e hp regen non hanno molto senso su di lei. Già in early può spammare la q senza grosse ripercussioni sul mana. E' la w quella che te la fa consumare, quindi non curare l'alleato se gli mancano 10 hp per il full vita.\n\nUsa la E con sensatezza perchè ha dei cd alti. Quindi, se ti capita di voler fare qualche tipo di danno e ti prude il dito sulla E non premerlo, perchè il support avversario, metti che è thresh, vede che non hai più il silenziatore e va di grab. Predicta bene e usalo soprattutto in tf.\n\nQuanto a maestrie vai di 0/18/12 e le rune quelle scritte in op.gg (poi apporta le tue modifiche quando capisci come la stai giocando e cosa credi che le manchi)","replies":[]},{"poster":"NicogenFTW","date":"2017-04-06T10:08:44.864+0000","up_votes":1,"down_votes":0,"body":"Domanda ai main soraka, perché giocate a league?","replies":[{"poster":"Jack Garrus","date":"2017-04-06T10:27:59.889+0000","up_votes":1,"down_votes":0,"body":"Per vincere le ranked facile","replies":[]}]},{"poster":"Byakùran","date":"2017-04-06T10:01:54.239+0000","up_votes":1,"down_votes":0,"body":"il primo consiglio è non cercare guide su mobafire,al max vedi su op.gg quelli che la giocano di più per vedere rune maestrie e builds, per quanto riguarda soraka ti dico come la giocavo io...l'healt gen non ti serve sulle rune perchè lo prendi hittando la q...io uso su quintessenze e rosse armor,gialle salute e blu magic resist per level e le maestrie 0-18-12...","replies":[]},{"poster":"Signiferr","date":"2017-04-06T01:54:19.584+0000","up_votes":1,"down_votes":0,"body":"il suo consumo in mana non è cosi elevato da doverlo fare mp regen. quindi io ti consiglio hp regen, armor, magic armor; è un runaggio molto semplice ma che va molto bene su di lei","replies":[]}]}