{"poster":"Iron Vegetarian","date":"2017-07-25T04:09:12.730+0000","title":"Posible Banneo permanente de cuenta por jugar en mi casa en mi otra computadora","subforum":"Problemas Técnicos","embed":{"description":"Imgur: The most awesome images on the Internet.","url":"http://imgur.com/a/7Oznc","image":"http://i.imgur.com/Lqnv03N.jpg?fb"},"up_votes":2,"down_votes":10,"body":"Bueno para explicar brevemente, hoy me conecto y me llega la advertencia de que si sigo compartiendo mi cuenta me van a terminar banneando mi cuenta  que tengo ya 7 a&ntilde;os por &quot;prestarcela a alguien&quot; ahora a ver mi cuenta principal (en la que recibi esta advertencia) no la volvia prestar a nadie desde que pusieron la regla que lo prohibe por mas ridiculo que me paresca, lo mas cercano a eso fue en las ultimas 2 semanas durante las vacaciones que unos amigos vinieron de vacaciones jugaron en mi casa y yo jugue en mi otra computadora, pero ni si quiera jugamos ranked fueron normales nomas, si use la cuenta de un amigo ya que jugamos tambien en LAN pero para no jugar contra low levels y destruirlos ya que para eso juego contra bots y solamente jugamos partidas en normal nada de ranked .\r\nRevize mi match history ya que pense tal ves me robaron la cuenta! pero solo veo las partidas que yo jugue, basicamente estoy en los foros para preguntar, por que recibi esta advertencia y que tengo que hacer para que no me baneen sin razon y si alguien de un IP diferente esta usando mi cuenta (aunque solo veo mis partidas en el match history) que se me informe por favor y cambio el password","replies":[{"poster":"Hendrix","date":"2017-07-25T12:47:23.944+0000","up_votes":3,"down_votes":0,"body":"Lo de la IP no creo que funcione asi.\nYo conecto durante el dia desde el laburo (ejem... cof cof) y a la noche desde casa y jamas tuve una advertencia.\nInclusive a veces en el trabajo olvido el cliente abierto y lo encuentro \"cancelado\" porque detecta que abri sesion en casa\n\nObviamente, uso los mismos champs y manqueo con la misma impericia en ambas conexiones.\nY otro detalle importante es que ninguna otra persona se conecta en ninguna de las maquinas","replies":[{"poster":"riuk223","date":"2017-07-25T15:32:35.145+0000","up_votes":2,"down_votes":0,"body":"Que hermoso que sería jugar al lol en el laburo, me rajan a los dos dias","replies":[]}]},{"poster":"Xeport","date":"2017-07-25T15:24:43.256+0000","up_votes":2,"down_votes":0,"body":"Todo culpa del macri gato ese y de la kristinaa re choros boludoo {{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"ZirixStarstrider","date":"2017-07-25T09:14:04.269+0000","up_votes":2,"down_votes":0,"body":"Lo de la IP me parece algo bastante tonto la verdad. Como hace una persona que juega en un ciber, o por ejemplo, que juega en una Notebook pero viaja por trabajo/ocio/etc? Lo van a bannear por eso?","replies":[{"poster":"Iron Vegetarian","date":"2017-07-26T01:55:53.707+0000","up_votes":1,"down_votes":0,"body":"Es que honestamente ni idea por que recibo una advertencia en esta cuenta que nunca se la preste a alguien, mi otra cuenta que uso en LAN la preste varias veces y nunca recibi advertencia, por eso estoy confundido, igual ya cambie el pass y me comunique con gente de soporte asi que supongo que problema resuelto","replies":[]}]},{"poster":"ANYASZOMORÍTÓK","date":"2017-07-25T04:11:58.126+0000","up_votes":2,"down_votes":0,"body":"Que raro a mi nunca me ha llegado y eso que a veces juego en casa de mi primo que tiene 2 PCs, y juego en las 2 (sumado a la mia) :P","replies":[{"poster":"Iron Vegetarian","date":"2017-07-25T04:40:57.904+0000","up_votes":1,"down_votes":0,"body":"Tambien me parece raro, primera ves que me aparece y comparti la cuenta muchas veces anteriormente, cosa que se termino cuando bannearon a una amiga por que le use su cuenta.\nLo unico que se me ocurre es que como mi compu tiene coneccion directa al modem y la otra usa wifi pero igualmente deberian tener el mismo IP y no jugue ranked asi que sigue sin tener sentido.\nFui al link de sporte del jugador y no ay forma alguna de conectarme con alguien de riot games solo me aparecen unas 10 opciones de como \"solucionar mi problema\" no compre RP ni comparti la cuenta, y si realmente detectaron que otro Ip se conecta con mi cuenta de LAS que por favor me lo deje saber lo mas gracioso que la cuenta de LAN que si comparto constantemente nunca recibi advertencia","replies":[{"poster":"ANYASZOMORÍTÓK","date":"2017-07-25T04:42:33.827+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Iron Vegetarian,realm=LAS,application-id=X54mVVp0,discussion-id=wzd7RA1p,comment-id=00000000,timestamp=2017-07-25T04:40:57.904+0000)\n>\n> Tambien me parece raro, primera ves que me aparece y comparti la cuenta muchas veces anteriormente, cosa que se termino cuando bannearon a una amiga por que le use su cuenta\n\nCompartiste la cuenta, listo, te quemaste solo ahí jajajaja la cuenta no se comparte.","replies":[{"poster":"Iron Vegetarian","date":"2017-07-25T05:05:39.213+0000","up_votes":1,"down_votes":0,"body":"en season 4, estamos season 7 no me queme nada jajaja ... si aclaro en mi otro post que fue hace mucho antes de que implementaran esto de no poder compartir cuentas,","replies":[{"poster":"nicopasoto","date":"2017-07-25T07:55:40.651+0000","up_votes":1,"down_votes":0,"body":"es bastante raro porque yo juego con 2 amigos y por lo general rotamos de casas por lo que son 3 ip diferentes donde mi cuenta se conecta y jamas me apareció ni a mi ni a ellos este mensaje","replies":[]}]}]}]}]},{"poster":"Yoen","date":"2017-07-25T04:22:16.679+0000","up_votes":1,"down_votes":1,"body":"Hola,\n\n\nCuando te advierten sobre el uso compartido\nde cuentas, es porque efectivamente la cuenta\nfue compartida y prestada.\n\nSi la has prestado a alguien, quizás no te acuerdes,\npuede que hayas entrado a un link fradululento, en \ndonde hayas colocado tu nombre de usuario y \ncontraseña.\n\nTambién si has comprado RP por facebook o a\nalguien que te haya cargado RP desde tu cuenta.\n\nNo se puede decir que es una **falsa advertencia**,\nporque hay mecanismos para detectar y afirmar cuentas\ncompartidas.\n\nComo toda advertencia,  compartir la cuenta es\ninfringir las normas de los **_términos de uso_**,\nsignifica que si compartes una cuenta te arriesgas a\nperderla.\n\nEn todo caso, si dudas de la advertencia, hay te dicen\nque vayas a **_Soporte al jugador_** y consultes.\n\n\nEspero que lo entiendas\n\nSuerte","replies":[{"poster":"Iron Vegetarian","date":"2017-07-26T02:42:18.924+0000","up_votes":1,"down_votes":0,"body":"\"No se puede decir que es una falsa advertencia\"  Por que no? es bien sabido que no existen programas de computadoras perfectos por eso son actualizados constantemente como riot recientemente hizo justamente con este programa y que existen falsas advertencias","replies":[{"poster":"Yoen","date":"2017-07-26T04:38:11.729+0000","up_votes":1,"down_votes":0,"body":"Mas bien es tu duda y palabra contra la de Riot.\n\nSinceramente he visto muchos y decenas de\ncasos como estos en los foros, muchos alegan\nque el sistema no funciona, pero los veo despues\npedir ayuda de que los banearon y de que\nperdieron sus cuentas.\n\nNo deseo asustar con este mensaje, pero\nes que he sido testigo de estas cosas que\npasan en los foros.\n\n\nSuerte","replies":[]}]}]},{"poster":"vaVav","date":"2017-07-25T04:36:00.353+0000","up_votes":1,"down_votes":0,"body":"> si use la cuenta de un amigo ya que jugamos tambien en LAN\n\nApa...","replies":[{"poster":"Iron Vegetarian","date":"2017-07-25T04:46:32.627+0000","up_votes":1,"down_votes":0,"body":"no entendi el Apa me cree una cuenta nueva  el me presto la suya por que no me gustaban los champs free y el uso la mia low level jugamos normales nomas, ni mencionar que el problema me aparece solamente en mi cuenta de LAS la cual no comparti","replies":[{"poster":"vaVav","date":"2017-07-25T05:56:31.162+0000","up_votes":1,"down_votes":0,"body":"Compartir cuentas es motivo de sanción...","replies":[{"poster":"Iron Vegetarian","date":"2017-07-26T02:00:11.622+0000","up_votes":1,"down_votes":0,"body":"Me estas diciendo que si una cuenta que no uso y es de otro server (LAN) la comparta justifica que bannen mi otra cuenta que nunca comparti y que esta en LAS?","replies":[{"poster":"vaVav","date":"2017-07-26T02:18:13.965+0000","up_votes":1,"down_votes":0,"body":"Digo que si realmente eres capaz de compartir cuentas, aun que fuesen de otro server, no me sorprende que fueras avisado de hacerlo aquí.","replies":[]}]}]}]}]},{"poster":"ZanahoriaAsesina","date":"2017-07-25T04:53:16.871+0000","up_votes":1,"down_votes":0,"body":"> que tengo que hacer para que no me baneen sin razon\n\nCambia la contraseña.\n\nY envía un mensaje a Soporte.","replies":[{"poster":"Iron Vegetarian","date":"2017-07-25T05:09:23.973+0000","up_votes":1,"down_votes":0,"body":"gracias por el comentario util ya me acabo de cambiar la contraseña, por donde le mande un mensaje a soporte? nunca tuve un problema como este anteriormente asi que realmente ni idea como manejarme por aca, disculpa las molestias","replies":[{"poster":"GatóMonstruo","date":"2017-07-25T05:21:43.140+0000","up_votes":1,"down_votes":0,"body":"¡Hola, Iron! \n\nPuedes enviarnos una solicitud a través de este enlace C: \nhttps://support.riotgames.com/hc/es-419/requests/new \n\nTambién puedes optar por la opción de un LiveChat (Beta).","replies":[{"poster":"Iron Vegetarian","date":"2017-07-26T02:01:35.737+0000","up_votes":1,"down_votes":0,"body":"ya me contacte usando el Chat Beta, me recomendaron que cambie el password nomas, asi que es lo que hice, espero que problema resuelto con esto, gracias por el Link","replies":[]}]}]}]}]}