{"poster":"MrMoerdergurke42","date":"2015-10-05T22:52:45.051+0000","title":"Promo-Fluch?","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":1,"body":"Guten Abend. \r\n\r\nIch bin momentan Bronze 2 und wollt einmal fragen, was eure Erfahrungen mit den Promo Games sind.\r\nMeine Geschichte: Mit meinem Real Life Freund, der Bronze 3 gestartet ist, hab ich angefangen DuoQ zu spielen, da wir diese Season noch nach Silber m&ouml;chen. \r\nJedoch habe ich nun 4 mal meine verdammte Promo zu Bronze 1 verloren, innerhalb von 3 Tagen. Ich komme immer, nachdem ich die Promo verloren habe, in eine neue Serie, aber wenn ich dann mit meinem Freund in dieser bin, hatte ich bis jetzt ein paar Feeder(einmal stand eine Annie 6/24/12), ich habe einfach auch mal schlecht gespielt oder wir hatten einen AFK im Team. Mein freund war 2 mal  ein Spiel eher in den Promos und er hat bis jetzt 2/4 Promos gewonnen. Somit ist er jetzt von b3 auf b1 und ich stecke immer noch fest und verliere einfach meinen Mut.\r\nWie war das denn bei dir? Ich hab mir anscheind ein Promo Fluch eingefangen.\r\n\r\nLg, eine demotivierte M&ouml;rdergurke :)","replies":[{"poster":"MeMyselfandBaal","date":"2015-10-06T06:13:41.295+0000","up_votes":3,"down_votes":0,"body":"ähm... man nennt das den Placebo Effekt... oder noch schlimmer: Selbsterfüllende Prophezeiung... \n\nUm mal das Gegenteil zu behaupten: Ich war zu Beginn der vorletzten Saison noch Bronze I... ich habe seit dem gefühlt 2 Ptomoserien verloren... und \"du kannst dir selbst ausrechnen wie viele\" Promo Serien gewonnen... (Bin Plat Iv) Und ja, das könnte wirklich hinkommen...\n\nMeine Einstellung an Promos? \"Ok, du hast eigentlich bewiesen, dass du aufs nächste Level gehörst... jetzt musst du es nur noch mal nachweisen\"... ob ich das jetzt in dieser oder in der nächsten Promo nachweise, ist relativ egal... \nUnd ja, mir ist eine verlorene Promo (auch wenn meine letzte definitiv zu Gold 2 vor 11 Monaten war) relativ egal. Wichtig ist, dass ich diese Promos erreiche. Dann spiele ich genau so wie vorher (also einfach nur nicht nervöser... denn der entscheidende Unterschied bist du...), dann ist (bei einer Winrate von 52%) der Aufstieg nur eine Frage der Zeit... und ja, ich bin mit 52% Siegesquote von Bronze 1 auf Gold 2 \"durchmarschiert\"... unabhängig von dem Lospech der Promos...\n\nDie letzte erinnerungswürdige Promo war nebenbei zu Platin V... das Ding habe ich (als Sup Main) mit nem Flash Ulti in Baron Nähe gewonnen... als Janna... was einem halt auch nur passiert, wenn man \"bewiesen hat, dass man aufs nächste Level\" gehört... denn wieviele Spiele gewinnst du mit einer Flash Ulti als Janna?","replies":[]},{"poster":"Ashuna","date":"2015-10-06T07:28:43.959+0000","up_votes":2,"down_votes":0,"body":"Ich bin selber von Platin 1 auf Platin 3 runter und \"hänge\" nun seit einiger Zeit auf Platin 3~2. Woran das Liegt? Sicher nicht an den \"Feedern\" oder \"Trollern\".\n\nWenn du gut bist schaffst du die Promos. Ansonsten einfach weiter Spielen. Auf kurz oder lang steigt man eh auf. 4 mal die \"verdammte\" Promo nicht zu schaffen ist sehr wenig. Es gibt Personen die versuchen es über 10~20 mal und schaffen es nicht. \n\nSorry wenn ich das jetzt so sage aber es ist nicht wirklich schwer in Bronze/Silber aufzusteigen.\n\nmfg Ashuna {{champion:1}}","replies":[]},{"poster":"justiceegt","date":"2015-10-05T23:18:05.374+0000","up_votes":2,"down_votes":0,"body":"Spiel einfach weiter.\nIch habe mir deinen Spielverlauf angesehen und glaube du wirst leicht silber kommen wenn du dranbleibst.\nSpiele einfach immer Support, da du Tresh ja gut spielst und Warde wichtige Positionen (was du ja schon machst).\nIch bin ewig auf Bronze 3 gehangen, bis ich mich auf Warden konzentriert und nur noch Kalista gespielt habe.\nSo habe ich dann auf silber weitergemacht und bin jetzt wieder an einem Punkt, an dem ich etwas ändern muss. Deshalb übe ich jetzt ein paar andere Adc's die ich im Ranked spielen kann.","replies":[]},{"poster":"Xandna","date":"2015-10-15T10:48:51.158+0000","up_votes":1,"down_votes":0,"body":"jaja die AFKler es gibt zuviele davon im Ranket..","replies":[{"poster":"Kunkel","date":"2015-10-16T17:54:25.570+0000","up_votes":1,"down_votes":0,"body":"Vor allem im Gegnerteam nicht war? Schließlich sind dor auch mehr andere Spieler","replies":[]}]},{"poster":"Wohltat","date":"2015-10-15T16:17:31.352+0000","up_votes":1,"down_votes":0,"body":"Promo zu Plat 5 auf Anhieb gewonnen. 4 games, 3 wins. Promo von Gold 2 zu Gold 1 einmal 5 mal verbockt innerhalb von 2 Tagen. Manchmal läuft es, manchmal sollte man einfach aufhören.","replies":[]},{"poster":"MrMoerdergurke42","date":"2015-10-06T10:49:51.753+0000","up_votes":1,"down_votes":0,"body":"Danke für eure Rückmeldungen :) Das hat mir wieder etwas mut gemacht. Gerade leider 2 Spiele verloren, aber ich werde weitermachen :D \nInteressant zu hören, wie es bei euch dreien so abgelaufen ist. \nVielleicht sieht man sich ja mal in der Kluft ;)","replies":[]}]}