{"poster":"Elite4Runner","date":"2018-12-11T03:15:49.468+0000","title":"When struggling in ARAM (I know, who cares, \"It's ARAM\")","subforum":"Gameplay","up_votes":6,"down_votes":2,"body":"I play ARAMs a lot, just for fun, .. and that is all it is to me, fun. \r\n\r\nUnfortunately, there are times where someone gets a bad draw, and they become toxic, troll, complain, feed, afk, dc, ... blah blah blah,\r\n\r\nI get it, it sucks to be a melee assassin against a team of marksmen, mages, and tanks. You can&#039;t get close enough to the squishies to blow them up, .. so when you go in you get slaughtered. \r\n\r\nWhat do you do?\r\n\r\nTwo options, ... well, the previous things I mentioned are also options, but these two are actually helpful to your team. \r\n\r\nOne, .. build full tank. .... As a melee champion, you have better defensive stats than ranged champions, and most of the time you will get beefy enough to actually become surprisingly effective despite the lack of damage compared to your normal build. \r\n\r\nTwo, ... and this is honestly the most important, ... STAY ALIVE! ... Stay near the back line. Be a freaking bodyguard. Literally BE AN ADDITIONAL BODY! You&#039;re still a threat to the enemy team, especially if your other teammates are actually managing to handle their own. \r\n\r\nJust make it through that match and move on to the next one, but don&#039;t be a baby, ... please. \r\n\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Tr4shB4NSYST3M","date":"2018-12-11T04:28:02.659+0000","up_votes":1,"down_votes":0,"body":"When i personally get a champ thats shitty for aram thats fine, ill build a tankyer bruiser build and still be useful.\n\nMy gripe with aram, is when you get a whole D tier aram team, {{champion:5}} {{champion:77}} {{champion:421}} {{champion:102}} {{champion:28}} , and your playing into something like: {{champion:37}} {{champion:45}} {{champion:14}} {{champion:12}} {{champion:222}}  So you basically just get abused and lose slowly til you get a couple kills just b/c you've spent your gold more, then they come back w/ full items and roll u.  LOL\n\n\nTHAT is the shit I DONT like.  lol","replies":[{"poster":"Elite4Runner","date":"2018-12-11T04:34:17.358+0000","up_votes":2,"down_votes":0,"body":"Yeah, there are many times that I know that the game is decided during the loading page, unless there is at least someone that is utterly braindead on the S-tier team and a GOD on the D-tier team.","replies":[]}]},{"poster":"The23rdGamer","date":"2018-12-11T03:32:26.113+0000","up_votes":3,"down_votes":1,"body":"Quality post; thanks for posting this.\n{{sticker:sg-syndra}}","replies":[]},{"poster":"MagicFlyingLlama","date":"2018-12-11T03:34:30.641+0000","up_votes":1,"down_votes":0,"body":"Option C: run down lane: as long as you get a kill, inting 4 assists was WORTH!","replies":[{"poster":"Elite4Runner","date":"2018-12-11T04:21:41.940+0000","up_votes":1,"down_votes":0,"body":"Well, as I described in the post, .. there are many situations where \"running it down\" literally just leads to you giving over a kill and assist(s) because most champions have some form of crowd control / peel. \n\nAnd doing that multiple times will only lead to you being underleveled, with little gold/items, and leaving your team with a numbers disadvantage. \n\nSitting at extreme exp range and dodging poke is actually a better advantage for your team because you will gain levels and your mere presence is a threat to the enemy.","replies":[{"poster":"MagicFlyingLlama","date":"2018-12-11T20:36:58.971+0000","up_votes":1,"down_votes":0,"body":"That was blatant sarcasm. I am sorry.","replies":[{"poster":"Elite4Runner","date":"2018-12-11T21:03:48.928+0000","up_votes":1,"down_votes":0,"body":"The sad thing is, I am convinced that people actually do believe this is a legitimate strategy.","replies":[{"poster":"MagicFlyingLlama","date":"2018-12-11T21:48:42.593+0000","up_votes":1,"down_votes":0,"body":"People incapable of first-grade addition or learning from experience make up most of the population.\n\nCase study: note how almost all ARAM games are just teams taking turns running down lane and getting aced at nexus, until respawn timers get long enough for one team to win. Despite this, nobody _ever_ pauses and considers if they should defend instead of push, in order to be the ones getting the ace. Suggest it, and they call you trash, a feed, and spam ping madly before running down by themselves and dying.","replies":[{"poster":"Elite4Runner","date":"2018-12-11T22:18:06.919+0000","up_votes":1,"down_votes":0,"body":"This is very true. I have actually lost so many games because people want to do nothing but chase down retreating enemies way ahead of the minion waves, only to end up getting turned on and killed. \n\nWhen the enemy team can't fight win a fight against your team, all you need to do is stand behind your minions as they slowly march into the enemy's nexus. \n\nLet them make the mistake of trying to fight and it's gg.","replies":[]}]}]}]}]}]},{"poster":"Livin like Riven","date":"2018-12-11T05:23:09.755+0000","up_votes":1,"down_votes":0,"body":"This. Just had a really mismatched game as Talon, who I don't usually play, half way through I realized I coulda just gone death's dance, maw and visage against their team, was able to successfully suicide 20-someodd times to delay the game until I got maw and DD, then I was able to get EVERYONE low, not just kill a dude. \n\nWe also had a Blitz who was very angry at a person who said it was their first time Neeko just because he messed up a couple of ults.","replies":[]},{"poster":"Rabbi Shekelberg","date":"2018-12-11T08:22:53.334+0000","up_votes":1,"down_votes":2,"body":"wrong","replies":[]}]}