{"poster":"FirePlay12","date":"2017-09-06T18:55:17.935+0000","title":"¿Como puedo aumentar mis fps?","subforum":"Problemas Técnicos","up_votes":5,"down_votes":0,"body":"Hola, soy un jugador con un pc no muy potente (nootebook Positivo BGH) es de gama media baja, normalmente corre lol a unos 20 a 25 fps pero me gustar&iacute;a mejorar el rendimiento alg&uacute;n consejo o solo queda esperar a cambiar mi pc?","replies":[{"poster":"Kokoro Chacarero","date":"2017-09-07T06:24:00.926+0000","up_votes":1,"down_votes":0,"body":"Eso de \"gama media baja\" no nos dice nada. Deja tus specs y manda tu lista de procesos cuando vayas a jugar. Los notebooks suelen venir com mucho \"bloatware\" del fabricante, es decir programas innecesarios que están ejecutandose todo el tiempo desde el inicio y consumen recursos al pedo.\n\nProcesador?\nRAM?\nVideo dedicada o integrada?\nOS?\nOpciones gráficas que usas actualmente?\n\nYo con una tostadora de 8 años o más lo corro a 60 fps siendo ambicioso. Eso si, el cliente me anda para la bosta.\nCaso aparte, me ha tocado jugar a menos de 20 fps y no se si da para quejas. Admito que tener drops a 15 o menos en momentos importantes es insostenible, pero no especificaste que fuera el caso.\n---\nEdit: si tu notebook es éste http://www.game-debate.com/laptop/index.php?la_id=2923&laptop=Positivo%20BGH%20I550%2014inch y tenés ese rendimiento, algo mal estás haciendo.","replies":[{"poster":"FirePlay12","date":"2017-09-17T02:37:41.453+0000","up_votes":1,"down_votes":0,"body":"es la positivo bgh C560","replies":[{"poster":"Kokoro Chacarero","date":"2017-10-10T03:14:40.104+0000","up_votes":1,"down_votes":0,"body":"Bueno, los vendedores son muy vagos a la hora de exponer las specs así que asumo que por el año en que se comercializó, viene con una video integrada superior a la mía (con la que muevo el LoL sin problemas mayores).\n\nLa notebook no debería tener problemas para correr el LoL estable. De CPU y RAM estás sobrado. El problema debe radicar en tu configuración, o el uso que le des a tu sistema.\n\nCuales son tus opciones gráficas detro de partida?\nQué sistema operativo usas? Es una instalación limpia hecha por vos o usas la que viene con la computadora?\nDescargaste los últimos drivers del fabricante?\nQué versión de DirectX tenés instalada?\nCuantos años/meses tiene? Es de segunda mano?\nLa has limpiado? Limpias las aberturas de ventilación? Dónde la apoyas? Está expuesta a polvillo, tierra, cemento, pelos o pelusa animales o textiles, migajas de comida, humedad, luz solar por períodos extensos, vibración inducida por otros aparatos?\nQuién hace uso de la computadora?\n\nPD: después de ver las specs concluyoque  si tu notebook es de gama media-baja, mi PC es de gama baja-cartón. Y juego sin problemas. El problema probablemente sea causado por el estado en que se encuentre tu computadora y/o inexperiencia del usuario. Si todavía tenés el problema y te interesa ver que podemos hacer, contestame las preguntas de arriba y vamos tachando posibilidades.","replies":[]}]}]},{"poster":"Tecnicomando","date":"2017-09-06T21:55:24.279+0000","up_votes":1,"down_votes":0,"body":"Eso no es media/baja\n\nEs un note básico, tiene todo lo mas bajo de su generación, de hecho no deberias jugar lol,no llegas a lo minimo requerido...\n\nUna opción es jugar en modo ventana 800*600","replies":[]},{"poster":"Briell","date":"2017-09-06T20:23:08.949+0000","up_votes":1,"down_votes":0,"body":"Tenés un par de opciones, bajar los gráficos del lol al mínimo, disminuir la resolución del lol, actualizar los drivers de la placa de vídeo, mirar en las opciones de energía que esté utilizando la opción \"Equilibrado\", lo mejor es que formatearas la pc si tiene bastante tiempo desde la ultima vez que se formateo, si esto ultimo no resulta no hay nada mas que hacer que cambiar la pc :p","replies":[]},{"poster":"PBE","date":"2017-09-06T19:17:47.829+0000","up_votes":1,"down_votes":0,"body":"no lo tomes a mal pero deberias dejar de jugar , por lo menos hasta q puedas jugar con fluidez . \n\nmas que nada porque tu bajo rendimiento del juego afecta negativamente tu desempeño y por con siguiente perjudicas a tus compañeros.","replies":[]},{"poster":"Diosmo","date":"2017-09-06T19:10:41.878+0000","up_votes":1,"down_votes":0,"body":"Los FPS basicamente son placa de video. Tenes que configurarle todo al minimo y de ahi ir subiendo si ves que lo tira rapido.\nSi en todo minimo te anda a 25 FPS es porque el video no tira mas.","replies":[]},{"poster":"Ks Erwyn","date":"2017-09-06T19:03:06.404+0000","up_votes":1,"down_votes":0,"body":"cuanto Ram tiene?, si te es accesible mejorarla las placas no son caras,ni difíciles de instalar.","replies":[]},{"poster":"TheSystruction","date":"2017-09-06T18:59:29.858+0000","up_votes":1,"down_votes":0,"body":"cambiala, yo tengo uan positivo bgh como pc secundaria con un i5 5200 u y es malisima, no levanta mas de 80 en bajo y todo trabado igual por la mala calidad de la pantalla{{sticker:slayer-pantheon-popcorn}}","replies":[]}]}