{"poster":"SecretLine","date":"2015-12-09T20:24:35.432+0000","title":"Das Team ePlay Uprising sucht ein motivierten Main-Toplaner ( Plat+ )","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"\n[](http://[URL=http://www.pic-upload.de/view-29082690/Team.png.html][IMG]http://www2.pic-upload.de/thumb/29082690/Team.png[/IMG][/URL]\n)\n\nHallo liebe League of Legends Community,\nwir das Team ePlay Uprising haben uns dazu entschlossen, f&uuml;r unser Team einen neuen Toplaner zu suchen. Da wir Kommunikationsprobleme mit unserem alten hatten. Da wir schon seit einiger Zeit zusammenspielen, haben wir schon so etwas wie Synergie aufgebaut ( die nat&uuml;rlich noch nicht perfekt ist).\n\n**Ziele:**\nUnser Ziel dabei ist ein Team zu aufzubauen, das sich auch au&szlig;erhalb und auch nat&uuml;rlich innerhalb des Spiels versteht. Viele Leute suchen sich Mitglieder und lassen sich dabei oft keine Zeit dadurch nimmt man den erst besten der am ende ins Team nicht past, aufgrund solcher Erfahrungen m&ouml;chten wir uns mit der Auswahl diesmal Zeit lassen, deshalb solltetst Du auch etwas Geduld mitbringen. Ein weiteres Ziel ist, sobald wir uns mit dem Toplaner ( Dir) eingespielt haben auch mal an einem oder anderen Turnier mitzumischen.\n\n**Zu uns:**\nWir sind eine lustige Truppe, nat&uuml;rlich sind wir zielorientiert und wollen das Beste aus dem Team herausholen. Momentan haben wir ein Manager, der f&uuml;r uns eine Facebook-Seite leitet und uns Turniere sucht, au&szlig;erdem meldet er uns auch dort selbstverst&auml;ndlich an. Wie oben schon erw&auml;hnt sind wir schon relativ eingespielt aber haben noch ein paar Schwierigkeiten, deswegen versucht uns der Manager momentan ein Coach zu organisieren. \n\n**Vorrausetzungen f&uuml;r das Team:**\n1. Du solltet 16+ sein( Wenn &auml;ltere Mitglieder zusammen mit j&uuml;ngeren im Team arbeiten, haben sich oft zu gro&szlig;e interessenunterschiede gebieldet dadurch haben sich die Spieler au&szlig;erhalb des Spiels nicht verstanden)\n2. Platin +\n3. Gut funktionierendes Headset\n4. Ts3\n5. Abends Zeit haben f&uuml;rs Training ( ab ca. 19-20 Uhr - open end )\n6. Main-Toplaner mit einem gutem Champion-pool. ( Zum Traden und auch f&uuml;r die Lane )\n\n**Was k&ouml;nnen wir dir bieten :**\n1. Teamspeak\n2. Teamleitung Erfahrung\n3. Demokratie\n4. Gut organisiertes Team\n5. Nette und hilfsbereite Mates\n6. Ein Team, das nicht nach einer Woche zerf&auml;llt\n7. Gutes Klima im Ts\n8. Vielf&auml;ltige Trainingseinheiten ( regelm&auml;&szlig;ig, aber nicht zwingend jeden Tag )\n9. Einen Manager und zuk&uuml;nftig einen Coach\n\n**Teamaufstellung:**\n\n  {{summoner:12}} Top:  evtl. DU\n\n  {{summoner:11}} Jungle: ePlay Askarum, 16, Dia\n\n  {{summoner:14}} Mid: SecretLine, 18, Platin\n\n {{summoner:3}} Support: Warlordlord, 16, Gold\n\n  {{summoner:7}} ADC: AN on Euw, 16, Platin\n\nIhr k&ouml;nnt die mindest Voraussetzungen erf&uuml;hlen und Euer Interesse wurde geweckt? Meldet Euch bei mir im Ingame. Au&szlig;erdem k&ouml;nnt Ihr auch gerne unten drunter eine kleine Bewerbung schreiben. Auch k&ouml;nnt Ihr auf dem Ts3 vorbeischauen und Euch bei Stas oder S U CK F A N E melden. ( 79.133.47.41:6151 )\n\nMfg. SecretLine  {{sticker:slayer-pantheon-thumbs}} ","replies":[]}