{"poster":"Wena Mi Plebeyo","date":"2016-05-14T19:33:40.454+0000","title":"¿Otra vez?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hola, hace poco de curioso revisaba foros sobre mk lol, que era y porque baneaban por ello, se todo sobre ese asunto, pero, al buscarlo encontre como un nuevo &quot;mk lol&quot; se llama SkinPreview (creo) y quisiera saber si Riot banea por usar el programa, aun no se si tiene las mismas caracteristicas de mk lol, por favor que algun rioter me responda.\r\n\r\nGracias por su atencion.","replies":[{"poster":"Tecnicomando","date":"2016-05-14T19:41:41.175+0000","up_votes":1,"down_votes":0,"body":"Te puedes responder solo\n\nSI algo altera/modifica/cambia/agrega/quita contenido al cliente es ilegal...\n\nSI vas al **redtracker** , veras que los rojos indican que aun no es considerado ilegal, pero tampoco es legal y lo mejor es no usarlo\n\nAdemas si revisas el foro y si sigues a algunos youtubes que usan este programa, ya an caído baneos ...\n\n\nsalu2","replies":[{"poster":"Wena Mi Plebeyo","date":"2016-05-14T19:45:28.719+0000","up_votes":1,"down_votes":0,"body":"¿Me podrias decir que es redtracker?","replies":[{"poster":"Tecnicomando","date":"2016-05-14T19:58:51.818+0000","up_votes":1,"down_votes":0,"body":"esto\nhttp://boards.las.leagueoflegends.com/es/redtracker","replies":[]}]}]},{"poster":"Hnk Kenshiro","date":"2016-05-14T19:45:59.244+0000","up_votes":1,"down_votes":0,"body":"Hola, el skin preview sin es ilegal por usar aspectos de la propiedad de riot, lo que si esta permitido son\n1. Skin personalizasas\n2. Huds personalizados\nSiempre y cuando no tengan funciones adicionales que den ventajas\n(Sobre skin para mapas no he confirmado, pero creo que estan permitidas)","replies":[{"poster":"Wena Mi Plebeyo","date":"2016-05-14T19:51:45.917+0000","up_votes":1,"down_votes":0,"body":"Bueno, la advertencia y sus comentarios ayudaran a las demas personas que quieran usar SkinPreview, muchas gracias por aclarar mis dudas, ahora solo falta que esto lo vea algun rioter.{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Hnk Kenshiro","date":"2016-05-14T19:53:30.651+0000","up_votes":1,"down_votes":0,"body":"Si quieres usar otras skins, te sugiero el Wooxy, es el más sencillo.","replies":[{"poster":"Wena Mi Plebeyo","date":"2016-05-14T19:58:25.065+0000","up_votes":1,"down_votes":0,"body":"De echo solo busco un programa para las huds personalizadas, hay un youtuber (Einoow Jota) que veo que en varios de sus videos utiliza huds personalizados, ¿Te sabes algun programa para ello? Te lo agradeceria mucho","replies":[]}]}]}]},{"poster":"Don Café","date":"2016-05-14T19:40:06.152+0000","up_votes":1,"down_votes":0,"body":"Probablemente, las razones por la que usar MK lol era baneable era por todas las cosas que ofrecia que te daba una ventaja injusta sobre otros jugadores (Jungle Timers por ejemplo), pero aun habiendo desactivado esas funciones, y usandose solo por los skins, el programa sigue siendo ilegal. Por mas que Riot no haya dado una palabra oficial sobre el poder usar skins gratis con programas asi, claramente no quieren que esto se use.","replies":[{"poster":"Wena Mi Plebeyo","date":"2016-05-14T19:46:10.504+0000","up_votes":1,"down_votes":0,"body":"No entiendo porque habia jg timers en el programa, ya habia cuando apretabas TAB :/","replies":[]}]},{"poster":"Rebkans","date":"2016-05-14T19:37:25.736+0000","up_votes":1,"down_votes":0,"body":"El uso de MK lol es baneable, entonces si este programa nuevo tiene las mismas caracteristicas o similares, sera baneable tambien.\nIgual le podes preguntar en el soporte","replies":[{"poster":"Wena Mi Plebeyo","date":"2016-05-14T19:39:34.576+0000","up_votes":1,"down_votes":0,"body":"No es \"nuevo\", parece que aparecio a principios de año, parece que un youtuber de Estados Unidos subio un tutorial, esta hasta en la pagina del programa, aqui tienes el link: \nhttps://www.youtube.com/watch?v=MvWaTIwiEwc","replies":[]}]}]}