{"poster":"daemonîum","date":"2015-09-15T20:46:02.087+0000","title":"Team Ranked sucht Main AD Carry und Mid Lane","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Hallo, \r\n\r\nich und ein paar Freunde sind noch am Mates suchen f&uuml;r unser Team Ranked, was momentan im 3v3 Platin 5 ist. Im 5v5 ist es momentan noch Unranked, da wir bisher zu wenige sind, die f&uuml;r&#039;s 5v5 motiviert sind. \r\n\r\nKurz zu uns: Wir sind ein Jungler (Dia 5), Support (Gold 5) und Top (Plat 4), die sich schon ziemlich lang kennen und auch schon das ein oder andere Spiel zusammen gewonnen  haben. Wir sind zwischen 16 und 18 Jahren. \r\n\r\nNun zu Dir/Euch: wir suchen einen AD Carry Main, der er einen relativ breiten Champion Pool hat. Du solltest in der Laning Phase aggressiv, jedoch safe spielen k&ouml;nnen, sowie im Late Game ein gutes Positioning haben. Ebenfalls suchen wir einen Mid Laner, auch dieser sollte einen breiten Champion Pool haben (haupts&auml;chlich AP Carries). Du solltest im besten Falle alleine oder mit Hilfe des Junglers deine Mid Lane dominieren und mit Roams das Team unterst&uuml;tzen. \r\nEs ist egal, wie alt ihr seid. Wichtig ist nur, dass ihr keine Voll Noobs [Kappa] seid und ein anst&auml;ndiges Mikro sowie TS habt. Gespielt wird meistens ab ~17-18 Uhr. Am Wochenende fr&uuml;her. \r\n\r\nEinfach adden:\r\nxFreaky (Jungler)\r\nhi im azaras (Support)","replies":[{"poster":"MLG MAXLO","date":"2015-09-16T07:29:19.584+0000","up_votes":1,"down_votes":0,"body":"habe intresse bin main ADC {{champion:81}} {{champion:222}} {{champion:429}} \nIch bin 16 Jahre alt und sitze in GOLD I rum .\nBei Interesse einfach anschreiben oder in LoL adden\nDanke","replies":[]},{"poster":"Leberwurstfrau","date":"2015-09-16T06:24:45.549+0000","up_votes":1,"down_votes":0,"body":"Hi,\n\nhätte Intresse als ADC.\nChampion-Pool: Vayne Kalista Ezreal Cait Jinx\nZu meiner Person bin 23 Jahre alt und ein entspannter Zeitgenosse.\n\nWie oft wollt ihr in der Woche spielen? (habe nicht jeden Tag Zeit)\n\nFalls Intresse besteht einfach adden, dann können wir nochma schreiben bzw. einfach mal ne Runde spielen.\n\nmfg \nLeberwurstfrau","replies":[]},{"poster":"No Leeglets","date":"2015-09-16T02:20:28.759+0000","up_votes":1,"down_votes":0,"body":"Hey ich wär ein Mid/adc main bin im soloQ atm platin 3 war letzte season aber mit meinen beiden accounts Dia 5 und Dia 4. Ich hab nicht jeden tag so \"früh\" zeit hätte aber schon lust auf 5v5. Also wenn ihr Interesse habt added mich einfach mal ;P IGN: Gorzuk\nMid Pool: {{champion:63}} {{champion:1}} {{champion:45}} {{champion:112}} {{champion:127}}  und ein paar andere die ich etwas länger nicht gespielt hab ^^^\nADC Pool: {{champion:222}} {{champion:81}} {{champion:51}} {{champion:15}} {{champion:67}} {{champion:22}} {{champion:104}} {{champion:429}}","replies":[]}]}