{"poster":"GreyKyrat","date":"2015-03-28T16:55:07.954+0000","title":"Para ustedes, Yasuo esta bien, por encima o por debajo de otros mid?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Buenas! Por curiosidad me puse a buscar yasuo en el foro, y vi muchos post donde algunos dec&iacute;an que yasuo esta roto, tiene el mayor snowball del juego, etc, y otros que dec&iacute;an que esta muy behind, si no tiene nada que levante en el team es un champ menos, etc. \r\n\r\nCual es su opini&oacute;n de este campe&oacute;n? Piensan que esta por debajo de otros como zed, kata, leblanc? O al mismo nivel? \r\n\r\nSaludos!","replies":[{"poster":" LocaHaploide","date":"2015-03-29T02:31:45.218+0000","up_votes":2,"down_votes":0,"body":"HA. Pero hijo si Yasuo es el campeon mas roto del juego. {{item:3151}}","replies":[{"poster":"GreyKyrat","date":"2015-03-29T03:49:12.826+0000","up_votes":1,"down_votes":0,"body":"Eso es sarcasmo?","replies":[{"poster":" LocaHaploide","date":"2015-04-01T22:11:37.176+0000","up_votes":1,"down_votes":0,"body":"Ño. Es la santa verdad.","replies":[]}]}]},{"poster":"SmK AuncelGG","date":"2015-03-28T17:10:34.485+0000","up_votes":1,"down_votes":0,"body":"hagamos una analogia valgo vulgar. los campeones son algo asi como frutas, debes sacarles el mayor provecho a todos, en el caso de yasuo su snowball no es superior al de riven por ejemplo pero si es el campeon con mayor movilidad en el juego y se debe aprender a explotar bien esa mecanica. yasuo es un campeon que sigue siendo baneado en las colas clasificatioras por ser el terror de los ADC, en conclusion yasuo es un campeon con amplias mecanicas y no, no esta roto","replies":[{"poster":"3agle","date":"2015-03-28T19:19:12.485+0000","up_votes":2,"down_votes":1,"body":"Yasuo el campeon con mas movilidad del juego ok ...\n\n{{champion:7}} : Oye kassadin mira dicen que Yasuo tiene mas movilidad que nosotros\n\n{{champion:38}} : Dejalo lo mas seguro es que es del tipo que juega a lux y se queda a melee contra un Yasuo\n\n{{champion:7}} : Menuda persona, si supiera que yo desarmo al Samurai ese no me dura ni 1 combo xD\n\n{{champion:38}} : A mi me toca los huevos pero yo pillo items y lo desarmo\n\n{{champion:238}} : Hola de que hablan ......","replies":[{"poster":"GreyKyrat","date":"2015-03-28T19:45:55.394+0000","up_votes":1,"down_votes":0,"body":"Movilidad? Que es eso? {{champion:64}}","replies":[{"poster":"ragunaover","date":"2015-03-28T20:42:24.294+0000","up_votes":1,"down_votes":0,"body":"{{champion:76}} Movilidad ? eso se caza ?","replies":[{"poster":"Limonyazucar","date":"2015-03-29T02:13:57.687+0000","up_votes":2,"down_votes":0,"body":"Se podría decir que tiene aun muchísima más movilidad que cualquier de los personajes si tenemos en cuenta que yasuo puede agarrar una gran oleada de minions y empezar a usar E casi indefinidamente (Si hay los suficientes minions). Esto es bastante mas grande que la movilidad Standart de el resto de los personajes, pero ridiculo aunque interesante xD Igual que el viejo Kassadim en Urf (O el nuevo, que sería gracioso verlo).\n\nDe todas manera el efecto aumenta si tenes una build full MS, un alistar enemigo curando a los minions, y mientras estas moviéndote indefinidamente (en el lugar xD), tenes que spamear \"Ooh, I'm Soooo Skilled, Mmhm, Wuhuhu <3 !\" jajaja\nWiiiiiiiiiiiiih (?) Muy divertido <3 (??????) jajajaja","replies":[]}]}]},{"poster":"MoPaFree","date":"2015-03-29T02:11:20.716+0000","up_votes":2,"down_votes":0,"body":"{{champion:55}} yo solo hiba pasando por aqui...........   {{champion:92}}  holi...........","replies":[]}]}]},{"poster":"3agle","date":"2015-03-28T19:48:20.086+0000","up_votes":1,"down_votes":0,"body":"Para mi gusto Yasuo esta muy por debajo, ahi mejores opciones que elejir como {{champion:238}} {{champion:131}} {{champion:101}} , pero si lo que buscas es un Champ para el Late ahi 3 mejores opciones y con mejor fase de carril que yasuo.\n\n{{champion:23}} : Tiene mejor Early, Mid y Late Game que Yasuo\n{{champion:11}} : Es lo mismo que Yasuo pero muchoooooooooo mas facil de ocupar y me atrevo a decir que tiene mejor Early game, a parte tiene daño verdadero y bonificacion de AD en su E\n{{champion:24}} : Que pueda decir, tiene fase de carril decente y es muy superior a Yasuo en Mid y Late Game.\n\nPara mi gusto no ahi opcion de jugar a Yasuo a menos que hayan baneado a todos los Mid que le ganen linea.","replies":[{"poster":"GreyKyrat","date":"2015-03-28T20:32:19.187+0000","up_votes":2,"down_votes":0,"body":"De los que decís ninguno es mid, y no tienen las mismas mecánicas que yasuo, es mas, trynda me parece un champ demasiado aburrido ya que solo es pegar básicos, yasuo es muy divertido por la movilidad, y el tornado además que puede hacer muchas cosas. Yi es jungla, pero no bueno del todo ya que tiene 0 cc pars gankear, y jax es la bestia del late, eso se sabe ya.","replies":[{"poster":"3agle","date":"2015-03-28T20:38:59.049+0000","up_votes":1,"down_votes":0,"body":"Ninguno y {{champion:238}} {{champion:131}} {{champion:101}} , y yo no hablo de lo aburrido yo estoy hablando de lo superior que es ese champ sobre yasuo","replies":[{"poster":"GreyKyrat","date":"2015-03-28T20:44:52.604+0000","up_votes":1,"down_votes":0,"body":"Quise decir, ninguno de los campeones de late que decís es de mid. \n\nYi creo que xerath es igual de team dependiente que yasuo, necesita frontline, mientras que yasuo necesita alguien con knock up. Zed es zed, su kit es desbalanceado","replies":[]}]}]}]},{"poster":"Franketox","date":"2015-03-28T17:21:17.458+0000","up_votes":1,"down_votes":0,"body":"yasuo si no tiene buena fase de lineas y no saca IE al minuto 30-35 (mas botas y statikk) no sirve amigo depende de los demas. Ademas que es una gelatina en linea le ganan casi todos los mids","replies":[{"poster":"Mezgal no","date":"2015-03-28T17:27:59.241+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Franketox,realm=LAS,application-id=v7qsfXsE,discussion-id=M3oonOAL,comment-id=0001,timestamp=2015-03-28T17:21:17.458+0000)\n>\n> yasuo si no tiene buena fase de lineas y no saca IE al minuto 30-35 (mas botas y statikk) no sirve amigo depende de los demas. Ademas que es una gelatina en linea le ganan casi todos los mids\n\nCon su W se escapa de toda habilidad y tiene un escudo infinito de 100 que es demasiado fácil de conseguir","replies":[{"poster":"Franketox","date":"2015-03-28T18:18:34.610+0000","up_votes":2,"down_votes":0,"body":"no le sabes jugar claramente, se nota que no lo usas tampoco una w en early no sirve para nada te aviso 20 segundos de cd's que puedo bloquear pre lvl 6 mas que basicos y habilidades sin daño critico? ademas de que el escudo tarda demasiado en regenerar y se lo sacan de un basico, antes si estaba desbalanceado el early pero ahora se lo mataron directamente. Juga yasuo vs annie, o mordekaiser, o hasta contra ahri/zed/leblanc/viktor, te hacen mierda en lvl 6 a menos de que ellos sean malos con el personaje.","replies":[]}]}]},{"poster":"Lucrexio","date":"2015-03-28T17:24:21.347+0000","up_votes":2,"down_votes":2,"body":"Está por encima de casi todos los mid AP, pero por debajo de otros top, como Riven justamente.\nPor ejemplo, Lux, todo lo que sea Skillshot tiene las de perder contra Yasuo, ergo los ADC, mas aun si dependen mucho de los mismos.","replies":[{"poster":"3agle","date":"2015-03-28T19:20:10.924+0000","up_votes":1,"down_votes":0,"body":"Se supone que Yasuo es un Anti-Magos, Seria muy raro que un mago le ganara a yasuo no crees???","replies":[{"poster":"Lucrexio","date":"2015-03-30T01:08:22.546+0000","up_votes":1,"down_votes":0,"body":"Dije que los magos en general están por debajo de Yasuo.\nY que un mago le gane a Yasuo no es raro, basta con saber como, por ejemplo Yasuo no puede bloquear la Q de Xerath o la ulti de Lux, y Zyra también le podría hacer pelea si le pone bien las plantas.{{summoner:4}}  por tirar ejemplos.","replies":[]}]}]},{"poster":"Slaid","date":"2015-03-29T20:14:12.855+0000","up_votes":1,"down_votes":0,"body":"yasuo esta bastante bien tal y como esta nose por q dicen q esta tan roto :/","replies":[]},{"poster":"iMonsterQ8","date":"2015-03-29T15:00:45.084+0000","up_votes":1,"down_votes":0,"body":"En todo caso aqui les dejo un video\nhttps://www.youtube.com/watch?v=feRlGK8Rj1E","replies":[]},{"poster":"Sorglegt","date":"2015-03-29T11:30:57.516+0000","up_votes":1,"down_votes":0,"body":"Mi corazón es feliz cuando un yasuo esta en el otro equipo... se mueve mucho tiene snowball y bla bla bla, pero es muy facil hacerle counter.","replies":[{"poster":"GreyKyrat","date":"2015-03-29T14:33:50.589+0000","up_votes":1,"down_votes":0,"body":"Como lo countereas? Le suelo ganar pokeando, o directamente le meto todo el burst del campeón que use en la cara, pero no se exactamente cual es la forma","replies":[{"poster":"iMonsterQ8","date":"2015-03-29T14:53:05.225+0000","up_votes":1,"down_votes":0,"body":"Que tu jungla lo campee :D","replies":[]}]}]},{"poster":"lordeman10","date":"2015-03-29T06:45:06.103+0000","up_votes":1,"down_votes":0,"body":"es un pick fuerte siempre que el que lo use lo sepa usar, hay muchos pick fuertes para mid tampoco es que sea el super rotozo","replies":[]},{"poster":"SS SchutzstaffeI","date":"2015-03-29T00:37:00.741+0000","up_votes":1,"down_votes":0,"body":"Yo creo que esta bien, es un campeon que si no esta en buenas manos depende mucho de las sinergias con su equipo, tiene buena movilidad y un daño brutal si esta bien armado, pero no es un campeon \"imparable\" desde nivel 1, le he ganado la linea a Yasuo con varios campeones, Morgana, Lux, Nidalee, Zed, y la he perdido varias veces pero no de una forma atroz, para mi esta bien.","replies":[]},{"poster":"MolotovKiller","date":"2015-03-28T18:10:31.694+0000","up_votes":2,"down_votes":2,"body":"Esta por encima de los mids, su movilidad y daño abusivo (sumado a que prácticamente no tiene skillshot y no, su q no es un skillshot) sumado a sus posibilidades de supervivencia lo hacen la cosa mas odiosa y molesta del juego. Ya si a eso le sumamos su probabilidad de critico con stattik (y de ser de los pocos, si no el único, en llegar al 100% de critico). Ya si hablamos de top, la cosa cambia un poco, básicamente por que los tops tienden a tener un cc bastante potente (caso Riven, Kennen)","replies":[{"poster":"LeagueofNoobs","date":"2015-03-28T19:11:26.330+0000","up_votes":1,"down_votes":0,"body":"define skillshot","replies":[{"poster":"MolotovKiller","date":"2015-03-28T23:07:51.745+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LeagueofNoobs,realm=LAS,application-id=v7qsfXsE,discussion-id=M3oonOAL,comment-id=00050000,timestamp=2015-03-28T19:11:26.330+0000)\n>\n> define skillshot\n\nSkillshot: Q de blitz, Q de Thresh, Q de Morgana. ESO es un skillshot, son habilidades de rango que surten efecto al impactar a un objetivo alejado. La Q de Yasuo no es eso, básicamente por que tiene el rango de un melee.","replies":[{"poster":"3agle","date":"2015-03-29T00:31:13.636+0000","up_votes":1,"down_votes":0,"body":"Skillshot = tiro de habilidad, la Q de yasuo es una skillShot en toda regla, a parte que es de corto rango y muy facil de evadir","replies":[]}]}]},{"poster":"ragunaover","date":"2015-03-28T20:39:12.631+0000","up_votes":1,"down_votes":0,"body":"Supervivencia ? Yasuo es un papel reciclado y mojado :v","replies":[]}]},{"poster":"Nano454","date":"2015-03-28T23:18:56.600+0000","up_votes":1,"down_votes":0,"body":"Para mi yasuo se queda un poco atrás en la fase de lineas, su R depende demasiado de como estén los enemigos para ser útil, pero luego en el late game si tiene un build buena, puede llegar a ser imparable","replies":[]},{"poster":"RNGesus","date":"2015-03-28T21:19:00.697+0000","up_votes":1,"down_votes":0,"body":"Ahora como esta , solo es viable para gente con manos , de hecho ayer un yasuo de nuestro team perdio contra una morgana en mid , pero morgana es morgana.","replies":[]},{"poster":"gambito700","date":"2015-03-28T20:43:51.418+0000","up_votes":1,"down_votes":0,"body":"mi primera linea main fue mid y solo hay dos grandes champs rotos a los cuales odio con toda mi alma y solo espero que se pudran en el infierno {{champion:157}} {{champion:105}}  que manera de partirme los gemelos ese parcito... pero una vez que te sabes los CD de sus habilidades mas pesadas (el salto de fizz y el muro de yasuo) solo son un par de champs mas. el problema esta en el mid-late game cuando rommean las lineas y se llevan kills de otras lineas.","replies":[]},{"poster":"LGBT Valentina","date":"2015-03-28T19:48:05.889+0000","up_votes":1,"down_votes":0,"body":"No esta bastante bien actualmente\nNo es un champ para todas las lineas, pero es un buen pick en general en mid\n\nno necesita ningun buff\nSi lo llegan a buffear, va a ser la duracion del escudo que pase a 1.5 probablemente pero no creo que mas","replies":[]},{"poster":"SilentRado","date":"2015-03-28T17:25:23.985+0000","up_votes":1,"down_votes":0,"body":"Para mi es uno de esos campeones de los cuales les dan demasiadas herramientas, fuera del hecho de que sea difícil o fácil de manejar, le dan tantas opciones para defenderse como para atacar que básicamente les da una gran ventaja contra campeones que tengan un patrón mucho mas simple y por lo tanto mas predecible.\n\nSolo basta con ver un Lee Sin peleando contra... digamos un Mordekaiser y te das cuenta que el Lee Sin tendrá mejores posibilidades.\n\nYasuo junto con Lee Sin y Zed son los que considero un grupito de personajes que si son usados por alguien que sabe básicamente pueden hacer lo que quieran.","replies":[]},{"poster":"XxparkusxX","date":"2015-03-29T03:38:24.819+0000","up_votes":1,"down_votes":1,"body":"Yo soy Main yasuo, si lo sabes ocupar bien puedes frenar katas,oriannas,ziggs,y otros mid. Yasuo si juega contra un zed que la persona lo sabe ocupar (a zed) sufrirá mucho, zed  ese es el peor counter de yasuo.\nPero yo eh ganado a línea a un zed, si hay muchos mininos enemigos te servirán tanto como para esquivar hechizos de zed como para escapar o atacar.\nContra le Blanc a mi me va muy bien ya que trató de movilizarme con los minions con la (E) así ella no sabe cuando tirar sus hechizos,cuando gaste el hechizo que ocupa como escape te tiras o la matas o la obligas a backear.\nNo se me ocurre que otra cosa decir,espero te sirva\nSaludos \n{{champion:157}}","replies":[]},{"poster":"Mezgal no","date":"2015-03-28T17:25:02.447+0000","up_votes":2,"down_votes":2,"body":"yo opino que opinar es necesario, para expresar mi opinión sobre su R rota ya que puede llegar a alcanzar a todos los objetivos en el aire y obtiene su 50% de penetración de armadura, por runas-maestrías por 15 sg depuesde utilizar la, yo opino que opinar es necesario para su nerf","replies":[]},{"poster":"Estoy AFK","date":"2015-03-29T00:16:36.775+0000","up_votes":1,"down_votes":2,"body":"Es como cualquier otro mid... pero en late es imparable... \n\nRealmente aun sin muchas manos podes carrear con este campeon tan desbalanceado..","replies":[]}]}