{"poster":"dragonlobox","date":"2017-01-24T11:42:04.336+0000","title":"Auricular & micrófono","subforum":"Off-topic y temas personales","up_votes":7,"down_votes":2,"body":"Necesito ayuda, nunca he usado micr&oacute;fono y no me estoy enterando de nada :v\r\nMi pc tiene 2 entradas, una speaker y otra mic.\r\n\r\nLa cosa es que yo tengo auriculares y al conectarlos me aparece en el Pc esto:\r\nhttp://i.imgur.com/b9HC7pl.png\r\n\r\nSi lo escojo como micr&oacute;fono puedo hablar pero no escuchar (tengo que cambiar el sonido a mi televisor en este caso) y si escojo auricular escucho bien pero no puedo hablar.\r\n\r\nSiento que es por algo que estoy haciendo s&uacute;per mal, y voy a quedar como pelotudo pero necesito ayuda xD","replies":[{"poster":"Khimea","date":"2017-01-24T14:56:21.605+0000","up_votes":2,"down_votes":0,"body":"Facil. Tocas el panel donde tenes conectados el auriclar. Tocas el Rosa, pones micro, tocas el verde pones auris y listo.-","replies":[]},{"poster":"PabloGD190","date":"2018-06-17T01:30:58.012+0000","up_votes":1,"down_votes":0,"body":"MI PC NO ME RECONOCE EL MICRO MEN","replies":[]},{"poster":"Ozarcus","date":"2017-01-25T06:05:44.586+0000","up_votes":1,"down_votes":0,"body":"¿Los conectores frontales de audio te funcionan?","replies":[]},{"poster":"Elmito Guapeton","date":"2017-01-24T13:25:26.611+0000","up_votes":1,"down_votes":0,"body":"fijate en la  cofiguracion avanzada acordate de panel trasero y frontal< yo uso el frontal< y en ac97 panel delantero q tiene 2 salidas de audio y el microfono apa coneectarlo  :v .. para darte un ejemplo mi audio es de VIA . capas q en configuracion avanzada t de mas opciones depende de donde lo conectaste o cual quieres activar enmi caso activo el delantero por que el trasero no me anda es raro :s .. bueno espero q t sirva d ayuda pro lo dudo mucho y si .. es molesto estas cosas simples  son frustrante recuerdoq  tarde 4 dias en  configurar como tngo ahora :c","replies":[]},{"poster":"iMonsterQ8","date":"2017-01-24T12:09:14.419+0000","up_votes":1,"down_votes":0,"body":"Ward, mi pc no me reconoce el micrófono.","replies":[]}]}