{"poster":"Tai Dye","date":"2017-11-30T22:01:21.299+0000","title":"Project Vi Border isn't lined up properly.","subforum":"Report a Bug","up_votes":2,"down_votes":0,"body":"Just as the title states, the border you get for PROJECT Vi, (Maybe even the other two new skins, haven&#039;t checked.) Aren&#039;t lined up properly.\r\n{{sticker:zombie-brand-facepalm}} \r\nI don&#039;t understand how that could&#039;ve even happen again (Dawnbringer/Nightbringer skins) it&#039;s not that hard to put an image over another with the correct size. Then test it to see if it&#039;s right. Literally a 30 minute task, and that&#039;s being generous with the time given.","replies":[{"poster":"AthenaBun","date":"2017-12-01T01:59:48.067+0000","up_votes":1,"down_votes":0,"body":"How are you even getting yours to show up? I have the Project Vi skin, icon, and got the 3 borders/icon and my border doesn't even show up.","replies":[{"poster":"moonstones","date":"2017-12-01T20:24:20.336+0000","up_votes":2,"down_votes":0,"body":"For the borders, you'll need to earn PROJECT tokens by completing missions. you can then craft the Three Hunters Borders and final hunt icon. Once you do that, you'll have the three borders added to your inventory. When you go to play PROJECT Vi, Jhin or Vayne, the border should then display. \n\nNow, if you've done all of this and you still aren't seeing it, please shoot a ticket over to player support, and they can take a look at your account and see what's going on. :)","replies":[{"poster":"Altonius Amakiir","date":"2017-12-02T01:45:41.763+0000","up_votes":1,"down_votes":0,"body":"I know this is off topic, but do you know if the bug where Nunu Bot is missing his lightning arm particles is at least noted? It's one of my favorite parts of the skin, and it's been so long since I've reported it that I'ts starting to feel like it hasn't been noticed yet.\n{{sticker:zombie-nunu-tears}}","replies":[{"poster":"moonstones","date":"2017-12-04T17:00:23.911+0000","up_votes":2,"down_votes":0,"body":"Hi there! \n\nI just looked up what you're referring to, and the poor guy is definitely still missing his VFX. I've pulled the bug outta the backlog and I'm going to see if I can find a VFX with some bandwidth to fix this up ASAP. I won't make any promises just yet, but 8.1 would be the next possible patch to get any fixes in. I'll keep ya posted. \n\n{{sticker:sg-syndra}}","replies":[{"poster":"Altonius Amakiir","date":"2017-12-05T10:29:55.084+0000","up_votes":1,"down_votes":0,"body":"Read this while in the emergency room, made my day. Thanks!","replies":[{"poster":"moonstones","date":"2017-12-08T20:37:17.486+0000","up_votes":2,"down_votes":0,"body":"Oh no, in the emergency room? I hope everything is okay! \n\nI have some good news for you! Nunu Bot will be all fixed up in 8.1, which will be after the holidays, but I hope a belated surprise is better than none. <3 \n\nHappy holidays! \n\nhttps://imgur.com/wog6Ejo","replies":[{"poster":"Altonius Amakiir","date":"2017-12-08T20:58:17.347+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-nunu-hearts}} \nCan't say everything will be okay just yet health wise, but at least it wasn't a heart attack like I thought.","replies":[{"poster":"moonstones","date":"2017-12-08T21:07:32.447+0000","up_votes":1,"down_votes":0,"body":"That's always a plus! Take care of yourself. <3","replies":[]}]}]}]}]}]}]},{"poster":"Tai Dye","date":"2017-12-01T02:04:47.556+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AthenaBun,realm=NA,application-id=LqLKtMpN,discussion-id=qlmEsu8x,comment-id=0000,timestamp=2017-12-01T01:59:48.067+0000)\n>\n> How are you even getting yours to show up? I have the Project Vi skin, icon, and got the 3 borders/icon and my border doesn&#x27;t even show up.\n\nUhh, I don't know really. I just finished all the missions and bought the icon that unlocks the borders. I'm shocked that Riot hasn't done anything about this yet. Feel free to post everywhere about this I guess to spread the problem around","replies":[]}]},{"poster":"moonstones","date":"2017-12-01T20:22:10.071+0000","up_votes":1,"down_votes":0,"body":"Hey! \n\nQuick context - it isn't an image over another, one image has a border baked on it, the other image does not. They're named exactly the same sans _LE at the end of the image with the border baked on top of the original load screen splash. *We also tested these, but there can be sizing issues depending on ranked borders and other items on the load screen.*\n\nI believe Riot Time Wizard was [looking into this](https://twitter.com/RiotTimeWizard/status/934598658300960768), but I don't believe a call has been made on what adjustments the team would potentially be making. ","replies":[{"poster":"Tai Dye","date":"2018-02-22T23:02:32.786+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot KateyKhaos,realm=NA,application-id=LqLKtMpN,discussion-id=qlmEsu8x,comment-id=0001,timestamp=2017-12-01T20:22:10.071+0000)\n>\n> Hey! \n> \n> Quick context - it isn&#x27;t an image over another, one image has a border baked on it, the other image does not. They&#x27;re named exactly the same sans _LE at the end of the image with the border baked on top of the original load screen splash. *We also tested these, but there can be sizing issues depending on ranked borders and other items on the load screen.*\n> \n> I believe Riot Time Wizard was [looking into this](https://twitter.com/RiotTimeWizard/status/934598658300960768), but I don&#x27;t believe a call has been made on what adjustments the team would potentially be making.\n\nSo uh, it's been 3 months, any update on fixing the content you guys released?","replies":[]}]}]}