{"poster":"Gabor3","date":"2014-11-02T13:10:12.142+0000","title":"Enter the Freljord magyar felirattal (videó)","subforum":"Általános beszélgetés","up_votes":6,"down_votes":0,"body":"Elise és Lucian után újabb angol LoL videóhoz készítettem magyar feliratot, mégpedig az Enter the Freljord-hoz, melyben Lissandra Ashe és Sejuani törzseiről, illetve a Fagyos Őrzők feladatáról, céljáról mesél röviden.\r\nRemélem tetszeni fog nektek. :)\r\n\r\nLink: [Enter the Freljord magyar felirattal](https://www.youtube.com/watch?v=UdOywFuhg8I)","replies":[{"poster":"Kadegrow","date":"2014-11-02T14:12:23.152+0000","up_votes":1,"down_votes":0,"body":"Jó lett. Lehet angolul halandót mond, de amúgy Ashe és Sejuani nem az. Történet szerint Ashe Avarosa jogos örökes, Sejuani pedig Seryldaé.\nSzóval mindkettejük ereje varázserőből fakad amit az őseiktől kaptak. És így arra utal a legenda is az én elképzelésem szerint, hogy a 3 lélek soha nem halhat ki mindig valamilyen formában újjá születnek. \n\nTőlem már eredt egy Freljordos téma amit saját elképzeléseim alapján írtam meg és csatoltam össze azzal a kevés infoval amiket találtam :D\nÉn most tervezem a 2. részét ahol szinte bővebben hosszú témában kielemzem Ashet és talán egy 3.-at is még ami már Ashe királyságáról és már picit belenyúlna a jövőbe.\n\nDe amúgy a fordítás nagyon jó lett.\n\nElső rész : http://boards.eune.leagueoflegends.com/hu/c/rajongoi-alkotasok/EgNhfi18-freljord-kezdetaonek-tartaonete-az-rzk-aos-a-haarom-nvaor","replies":[{"poster":"Gabor3","date":"2014-11-03T15:49:43.944+0000","up_votes":1,"down_votes":0,"body":"Köszi! :)\nAz angolban human-t mond, de a halandó sokkal jobban hangzott a szövegben, és nem tartottam súlyos félrefordításnak sem. Lehet, majd kijavítom a videóban, még nem tudom.","replies":[{"poster":"New Dawn","date":"2014-11-03T16:26:37.328+0000","up_votes":1,"down_votes":0,"body":"Attól fuggetlenul, hogy a lélek soha nem hal meg, Ashe és Sejuani halandó. Szerintem nem kell kijavítani semmit. Ez így tokéletes. Koszonjuk szépen a fordítást.","replies":[]}]}]}]}