{"poster":"GetJinxedddd","date":"2017-03-17T11:38:44.767+0000","title":"How Do I Find my Role?","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"So recently I&#039;ve been trying too look for a role to main but, Im having troubles doing so. I find that when I have &quot;mained a role&quot; its only been for 2-3 weeks after getting bored. I&#039;ve found it really hard to find my role as I my mates are also telling me what roles i should be playing because of my mindset and playstyle. Because of this I feel pressured into playing that role but again find it hard to main for no longer than 2 weeks. I just want to have a main role and not be a jack of all trades as I find it will be more rewarding by learning one role and sticking to it and mastering the role and the champions. Im also having trouble finding that right champion for me but I think once Ive found my role I should be all set! \r\n\r\nCheers Guys!{{champion:119}}","replies":[{"poster":"Ninox","date":"2017-03-17T11:51:54.239+0000","up_votes":2,"down_votes":0,"body":"I dunno about everyone else, but I found my main role when I found my main champion. I started playing Nami when she was on a free to play rotation and fell in love with her, and have been a support main ever since.\n\nI know one of my friends found his main just cause it was what he played with friends, i.e one of his friends wanted to support, but not with randoms so he started maining ADC. He now mains top, which he fell into cause he likes the 1v1 matchups and testing his raw skill, and mid has much more gank and roam pressure, which is ofc a playstyle thing, but also because he really enjoys Gnar, Rene and GP.\n\nFrom what I've seen, it seems to always come back to finding a champion that you love, and the lane will follow.","replies":[]},{"poster":"Roguestoney","date":"2017-03-18T14:05:52.513+0000","up_votes":1,"down_votes":0,"body":"Personally. Ive been playing since season 3 and i don't have a main role. I generally just fill as i tend to get bored playing the same stuff over and over. Don't try to force yourself into a main role just try to have fun. Imo","replies":[]},{"poster":"Nijel","date":"2017-03-18T12:58:42.126+0000","up_votes":1,"down_votes":0,"body":"Back in the day your role was determined by how fast you typed in what you wanted to play into the chat (even though many believed it was actually pick order that determined whether you got to play what you wanted but that hardly seemed to stop stop 'em). For ages I was proudly a jack of all trades, never really sticking to one champion for very long. Actually, I avoided winning \"too\" many games with any single champion in a row to avoid the chance they would become \"jinxed\" or something.\n\nEventually though, as someone who didn't care for the whole typing race, more often than not I ended up playing support. Fast forward seven seasons and I'm a support main. To remix an old saying, I had _supportness_ thrust upon me. At this point I suppose it looks like I've ended up a Braum main (even have a figure of him on my desk). \n\nStill, I make a point of it to give a whole bunch of champions and roles a chance, if not just to recognise I don't want to play them again for a while. From my perspective, you should play what you find fun and feel like at the time. The more ways you experience the game the more likely you may find that one particular thing that really floats your boat and then you can really double down and work from there.","replies":[]},{"poster":"BarryButcher","date":"2017-03-17T12:18:23.346+0000","up_votes":1,"down_votes":0,"body":"I would say definitely try finding that one champion you love first. I personally have moved around a bit in terms of roles going from Top to Support to Jungle back to Top now im thinking of taking up support again.\n\nI would say just play normals until you love a champion (or 2 or 3) and take it into ranked. You can certainly know what roles you like, but if you are like me, and are willing and happy to play any role, its more the champion choice that will determine your role.\nIts also nice if you pick a champ that can cover multiple roles which makes picking a role easier.\n\nJust remember it is a game, so if your not having fun, whats the point.\n\nWorse comes to worse there are about 100 \"what role should I main\" quizzes out there if you google for them. They ask simple questions about perfered playstyle etc. They are a bit silly but can help if you really have 0 idea.\n\n----------------------------\n\nEach of my changes came from a falling in love or having a lot of fun with a certain champion. I started playing Top because I loved tanks. Mainly because I was new to the game and Tanks were more lenient for people with bad positioning or mechanics. I mainly played Nasus back in the day because I liked playing passive in lane and I got his Infernal Skin in a mystery gift.\n\nI then fell in love with Blitzcrank. Mained him all of season 5. Was great fun. But then my duo partner quit league and I found it hard to climb with a different ADC every game so I swapped roles purely based on wanting to climb.\n\nThis is where I had a similar conundrum to you. Mid season 6 and I had no idea what or who I wanted to play. So I played a bunch of different roles and one day decided to try the \"OP\"s and I fell in love with Graves top and Khazix Jg.\n\nThis season I took up Renekton and absolutely loved it. I've played more ranked games on Renekton alone then I have played total any other season. But with Blackcleaver nerfs and me personally getting burnt out on him, I am again, in that transitional period of finding my next \"fun\" thing.\n\nBut having played this game almost 4 years now, I think its probably easier for me to transition roles and champions then someone new who is still learning.","replies":[]}]}