{"poster":"ZER0 TWØ","date":"2018-01-17T00:55:58.348+0000","title":"Inicio de temporada, miles de flamers... Como aún no los banean?","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":2,"body":"Vengo de muchas partidas en las cuales me han insultado continuamente, millones de veces.\r\nEstoy segura que el 99.9% de jugadores ha flameado aunque sea una vez en League of Legends. Con el paso del tiempo yo tambi&eacute;n sol&iacute;a ser la tipica rata llorona que insultaba y se pon&iacute;a a llorar por cualquier minima raz&oacute;n, pero eso ya no va por el juego, si no por madures, siendo que empec&eacute; a jugar tipo 14 a&ntilde;os y actualemente ya tengo 17 (No tiene que ver la edad, creo que eso es de la persona)\r\nEl problema es que ya estamos en 2018 y sigue habiendo compartamiento excesivamente toxico, he estado en comunidades y considero que la del LoL es por lejos la m&aacute;s toxica que eh visto.\r\nVolviendo al tema, yo me considero una persona &quot;**NORMAL**&quot; en tanto el LoL, ni flamer ni tranquila, pero estos momentos me hacen sentirme pesimo, pesimo por lo mal que esta la gente de la cabeza. \r\nOk, si tienes una racha de malas partidas ser&aacute; entendible que pueda salirte una o dos palabras malas, o situaciones asi, pero realmente hay gente que flamea en cada una de sus partidas y llora por eso? O tambi&eacute;n hay gente que simplemente insulta con amigos para sentirse superior al resto, creo que los Loleros tienen problemas muy serios. \r\nYo vengo reci&eacute;n de una partida en la cual habian 3-4 premades en las cuales me acusaron de ser Toxica, de flamear cuando ellos me dijieron cosas horribles, a mi y a los del equipo contrario, posiblemente lo m&aacute;s &quot;**toxico**&quot; que dije es &quot;_Acaso no tienen vida?_&quot;\r\n\r\nLo que me da pena es que este tipo de partidas baja el honor y los 4 m&aacute;s toxicos... se van sin ningun problema, esas injusticias del LoL... que molesto.\r\nCreo que m&aacute;s de una persona entender&aacute; esto pero....\r\n_**Amo League of Legends, pero odio jugarlo.**_","replies":[{"poster":"Erise","date":"2018-01-17T01:14:28.940+0000","up_votes":2,"down_votes":0,"body":"Mute y Report.","replies":[]},{"poster":"El Impostor","date":"2018-01-17T01:29:44.375+0000","up_votes":2,"down_votes":1,"body":"En el momento que sacaste estadísticas desde tus posaderas es que dejé de leer el post.","replies":[]},{"poster":"Zyra Goddess","date":"2018-01-17T01:00:40.513+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"CaroI Danvers","date":"2018-01-17T02:49:04.416+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zyra Goddess,realm=LAS,application-id=PJAKt7ph,discussion-id=4m6yE2Qc,comment-id=0001,timestamp=2018-01-17T01:00:40.513+0000)\n>\n> Tranquilo que estan en eso, A mi me permabanearon hace menos de dos semanas, Asi que Riot está aplicando bien los Ban Hammer, Recorda reportar y en casos extremo acudí al soporte para que puedan revisar el caso especificamente!\n\npor que te banearon ?","replies":[{"poster":"Zyra Goddess","date":"2018-01-17T02:56:49.123+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"AMD Radeon RDNA","date":"2018-01-17T14:12:56.944+0000","up_votes":1,"down_votes":0,"body":"Juego LoL desde la S2 (NA) y mi experiencia personal usando numeros del 1-5 (menor a mayor) segun grado de toxicidad por temporadas\n\n* Season 2 (NA): 3\n* Season 3 (NA): 3.5\n* Season 3 (LAS, mitad de año migracion masiva): 2.8\n* Season 4: 3 ~~este año quede afk y jugaba cada 2-4 meses una partida ~~\n* Season 5: 2.5\n* Season 6: 2.5\n* Season 7: 100000000000000000000000000000000000000000000000\n\nEsta season, es por lejos, la mas toxica que jamas he vivido. Realmente es una locura. Mis frustraciones de esas asquerosas y malisimas partidas, fueron tal que tambien me he vuelto a ser muy pero muy poco tolerante. Ahora me estoy alejando un poco, renovar aires e iniciar esta season en otro lugar.\n\n\n> [{quoted}](name=Zyra Goddess,realm=LAS,application-id=PJAKt7ph,discussion-id=4m6yE2Qc,comment-id=000100000000,timestamp=2018-01-17T02:56:49.123+0000)\n>\n> Tóxica ^^\n\nSi vuelves a jugar, trata de estar mas tranquila. Fijate que podes perder todos tus skins, yo me he comido baneos de chat y ya me he controlado mucho mas","replies":[]}]}]}]},{"poster":"StąrDust","date":"2018-01-17T03:08:53.922+0000","up_votes":1,"down_votes":0,"body":"Lamentablemente la comunidad está así, no te queda otra que mutear al principio de la partida si ves q hay premades en tu team, o cuando alguien te empiece a flammear (pero hay posibilidades de que quedes tilt). O juntarte con 4 amigos que no sean flammers y jugar de a 5.","replies":[]},{"poster":"Diosmo","date":"2018-01-17T01:46:55.461+0000","up_votes":1,"down_votes":0,"body":"Lo mas gracioso es que te puedo asegurar que Riot SI banea a los toxicos, todos los carteles de report que me llegaron fue por eso.\nAhora tengo mis serias dudas sobre los trolls que la disimulan un poco, JAMAS vi que banearan a nadie (los segui por Op.GG y siguen como si nada paso). Obvio hay que descontar a los pibes que se tiran bajo torre una y otra vez hasta que termina la partida.","replies":[{"poster":"WolfMax","date":"2018-01-17T02:09:25.497+0000","up_votes":1,"down_votes":0,"body":"yo nunca recibí un cuadro donde me diga que a la persona que reporte lo hayan baneado","replies":[]}]},{"poster":"Mithrilium X","date":"2018-01-17T00:58:16.505+0000","up_votes":1,"down_votes":0,"body":"me tope con un jarvan el cual fue un pesimo ganador,un fiasco total,aparte de que gano por un niño rata en mid que hizo berrinche y se fue afk porque un kayn mid le gano...","replies":[]}]}