{"poster":"Mineconfirmhd","date":"2015-05-31T15:08:57.209+0000","title":"Ich kann nicht reconnecten","subforum":"Hilfe & Support","up_votes":3,"down_votes":0,"body":"Ich kann nicht mehr reconnecten ich hatte einen komischen dc, wobei auf einmal  gar nichtsmehr  ging. Ich dachte mir egal spiel schlie&szlig;en, reconnecten. Daraus wurde aber nichts. Immer wenn ich reconnecten will sagt er mir er hat ein problem mit meiner Firewall. Ich habe meine Firewall bereits ausgeschaltet doch genau das Selbe passierte wieder. Brauche Hilfe {{item:2009}} {{summoner:4}}","replies":[{"poster":"Gruppenhase","date":"2015-05-31T16:14:59.501+0000","up_votes":2,"down_votes":1,"body":"ich kann gerade auch nicht mehr ins Spiel. Bei der letzten Runde Aram auf einmal einen Ping von über 800, angeblicher Verbindungsaufbau, gewartet und es passiert nichts. Also Spiel schließen und versucht wieder ins Game zu kommen, aber nach mehrmaligen Versuchen habe ich es jetzt aufgegeben.","replies":[]},{"poster":"BabyRageLoL","date":"2015-06-01T18:39:39.586+0000","up_votes":1,"down_votes":0,"body":"Ey is denn dit die Möglichkeit... schon wieder ausm Spiel geflogen grade und komm nich mehr rein, der gleiche Scheiß wie gestern. Fixt eure kack Server endlich mal Riot...","replies":[]},{"poster":"SiNAR","date":"2015-06-01T11:38:52.621+0000","up_votes":1,"down_votes":0,"body":"Bei mir besteht das Problem auch seit gestern.\n\nGibt es dafür mittlerweile eine Lösung ?","replies":[]},{"poster":"Domar1924","date":"2015-05-31T20:55:24.994+0000","up_votes":1,"down_votes":0,"body":"Exakt dasselbe ist mir grad bei Hexakill passiert und das bei allen Spielern im Game höchstwahrscheinlich, weil das meinem Kumpel (der mit mir im  Game war) auch passiert ist -.- Und reconnecten kann ich auch nicht mehr :((","replies":[]},{"poster":"Synapticx","date":"2015-05-31T19:28:48.288+0000","up_votes":1,"down_votes":0,"body":"SCheint ein fehler von den Server zu sein. Seit Hexakill Online ist tritt dieser fehler auf. Bei war es ein random 500 Ping \"conection lost\" und dan nix mehr mit reconet.....\nRito fix server pls","replies":[]},{"poster":"BabyRageLoL","date":"2015-05-31T17:50:40.756+0000","up_votes":1,"down_votes":0,"body":"Habe auch grad im Hexakill Modus nen DC bekommen und versuche seit 5 Minuten zu reconnecten. Bekomem ständig die Meldung mit der Firewall, wie beim TE oben schon erwähnt wurde. \n\nHoffe mal dass das Problem im Laufe der Zeit gefixed wird, ist ja echt nicht mehr schön...\n\n\nEDIT: Das Spiel ist soeben aufgelöst worden und erscheint auch nicht in der History.\n\nIst schon seltsam, da es nicht das erste mal ist, das mir sowas passiert wenn mein Team am gewinnen ist. Da ich aber nicht die nötge Kenntnis über Drophacks habe, kann ich auch nicht behaupten das es einer war, aber merkwürdig ist es schon.","replies":[]},{"poster":"GordonFreeman5","date":"2015-05-31T17:43:52.188+0000","up_votes":1,"down_votes":0,"body":"Ich hatte ein normals Spiel mit Ekko und wurde auch durch einen komischen dc rausgeworfen. Nach schließen des Games kann ich noch immer nicht ins Spiel zurück was sonst normalerweise **immer **funktioniert hat hmmmm???{{champion:245}}","replies":[]},{"poster":"Gramba","date":"2015-05-31T17:28:49.039+0000","up_votes":1,"down_votes":0,"body":"Ich habe genau das selbe problem","replies":[]},{"poster":"Wolkenfuß","date":"2015-05-31T17:04:21.618+0000","up_votes":1,"down_votes":0,"body":"Bei mir ist das immer noch so :( ich hab reloggt aber ich kann nur zum Spiel connecten was seid ner Stunde vorbei ist. Da steht ich soll meine Firewall ausmachen. Habe ich getan. was passiert ? nichts :(","replies":[]},{"poster":"Dark Kn1twear","date":"2015-05-31T16:09:13.303+0000","up_votes":1,"down_votes":0,"body":"Hallo Leute,\n\ngleiches Problem ! Bin seit Angeblich seit ca 1,5-2 Std im Game.. Wenn ich LoL starte, habe ich nur die Möglichkeit zu \"reconnecten\" (was natürlich nicht geht) \nMein Freund hat eben ein spiel starten können, doch er meint, dass es ziemlich laggt. Also glaube ich, dass momentan mit den Server was nicht stimmt. Hoffentlich funktioniert das alles wieder bald :-9{{summoner:7}}","replies":[]},{"poster":"Señor Corvus","date":"2015-05-31T15:54:28.525+0000","up_votes":1,"down_votes":0,"body":"same here, scheint ein drophack zu sein","replies":[]},{"poster":"Fear The Draven","date":"2015-05-31T15:36:20.094+0000","up_votes":1,"down_votes":0,"body":"Genau das gleiche Jungs{{item:3151}} {{item:3070}} {{item:3070}}","replies":[]},{"poster":"Gravost","date":"2015-05-31T15:33:21.264+0000","up_votes":1,"down_votes":0,"body":"Jop, habe ebenfalls das gleiche Problem! :)","replies":[]},{"poster":"psaads","date":"2015-05-31T15:22:26.025+0000","up_votes":1,"down_votes":0,"body":"Yo,\n\nMir ist das selbe auch vor ca. 10 Minuten passiert und trotz pc neustart funkt es trotzdem nicht mit dem reconnecten.","replies":[]}]}