{"poster":"WiPhiZ","date":"2019-02-12T20:40:44.764+0000","title":"Wie kann ich einen Troll reporten","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":1,"body":"Hallo,\nhatte gerade eben wie so ein tolles Spiel, wo die Lobby bereits so gestartet hat:\nTroller :  ok i troll\nWiPhiZ HAASE :  hf\nTroller :  im bored of this fcking gamer\nTroller :  go apex \nqaywsxedc HAASE :  ?\nTroller :  so munch trolls here\nTroller :  i want to troll\nTroller :  free loose\n\nWir sind zu 3. im Flex unterwegs gewesen und einer von uns ist daraufhin geleavt. Ich w&uuml;sste gern wie man solche Leute im Nachhinein Reporten kann. Macht den ganzen Spielspa&szlig; kaputt und es wird unn&ouml;tig Zeit verschwendet. \nDanke schon mal im voraus\n\nEdit: Ich hab den Namen des Trollers rausgenommen und ersetzt","replies":[{"poster":"XenesisCH","date":"2019-02-12T21:15:23.970+0000","up_votes":4,"down_votes":3,"body":"Keine Eier haben ein Game zu starten, aber jemand für etwas reporten wollen, dass er nicht getan hat. \n\nIch hoffe du siehst die Antwort auf deine Frage.","replies":[{"poster":"Awsane","date":"2019-02-12T21:35:41.810+0000","up_votes":3,"down_votes":2,"body":"Naja, auch wenn derjenige es nicht getan hat ist allein das Drohen allein doch auch ein Fehlverhalten.\n\nAlso ich habe so etwas nicht gerne in meinen Spielen und würde so etwas gerne unterbunden wissen. Es dient ja allein dem Zweck andere zum dodgen zu bewegen und fördert definitiv nicht den Spielspass. Und wir als Community machen ja die Regeln und wenn ich das sagen hätte würde ich so etwas unter Strafe stellen, sprich wenn genug dieser Meinung sind wird das ggf umgesetzt.","replies":[{"poster":"XenesisCH","date":"2019-02-12T22:26:07.114+0000","up_votes":3,"down_votes":0,"body":"Ich übersetzte für dich:\n\nWenn du Eier hast und nicht abbrichst, hat der Schlaumeier zwei Optionen --> Er bricht selber ab und erhält seine Zeitstrafe und ggf. Punkteabzug oder er spielt und du kannst ihn für sein Fehlverhalten melden. Sprich er wird bestraft und da die Strafe fürs abbrechen auch progressiv ist, wird er das nicht dauerhaft tun können. Aber dafür sollten endlich alle mal ihr Hirn einschalten und nachdenken bevor sie selber die Zeitstrafe übernehmen, dann gäbe es diese _Leute_ schon lange nicht mehr, denn das Bestrafungssystem dafür ist sehr wohl vorhanden.","replies":[{"poster":"Awsane","date":"2019-02-12T23:58:10.254+0000","up_votes":1,"down_votes":0,"body":"Ich spiele jedes Spiel\n\ndennoch finde ich könnte man das Problem sehr leicht auch dadurch beheben, dass man in der Champ select und wenn jemand dodgt auch danach Personen aus der Select reporten kann und man für so ein Verhalten bestraft wird.\n\nKlar wenn die Community das machen würde, wäre das auch eine Möglichkeit\n\nAber bei meinen Vorschlag brauch es den Zusammenhalt der Community nicht und verhindert/reduziert dennoch das Fehlverhalten und daher denke ich, dass das Sinnvoll wäre. Weil Menschenmassen sind Dumm. ","replies":[{"poster":"XenesisCH","date":"2019-02-15T22:21:34.102+0000","up_votes":2,"down_votes":0,"body":"Weisst du, ich denke die Community macht das eigentlich schon ganz gut, denn wenn man das geschilderte vom TE als wirkliches Problem bezeichnen müsste, wären hier viel mehr Threads darüber. Ich selber hatte jetzt in meinen über 5 Jahren LoL das Thema nie wirklich als grosses Problem empfunden, weil es einfach sehr selten passiert ist (afkler hatte man dann im Vergleich gerade viel mehr im Spiel) .Du solltest hier ein bisschen mehr Vertrauen in die Menschen haben ;)","replies":[{"poster":"Awsane","date":"2019-02-16T00:35:56.545+0000","up_votes":1,"down_votes":0,"body":"Meiner Meinung nach ist die Situation ähnlich zum Gefangenen Dilemma.\n\n(2 Leute werden verhört und sollen sich Gegenseitig verraten, tut keiner es bekommen sie beide eine kleine Strafe; tut es einer, hat der keine Strafe dafür der andere mehr; tun es beide, sind beide schlecht dran)\n\nWeil wenn ich dodge habe ich erstmal in der Situation allein betrachtet einen Vorteil (vielen geht es ja um die MMR denen sind die LP egal). Der verschwindet nur, wenn man das große ganze sieht. Und es reichen ja schon, wenn wenige dodgen, damit es Auswirkungen hat (sprich das Leute das versuchen als Druckmittel zu nutzen)\n\nund nein, ich habe kein Vertrauen darin, dass die Leute sich so verhalten, weil sich a darüber nicht so viele Gedanken machen wie wir und b in dem Fall die dodgen werden. Also die Unwissenheit spielt gegen uns.\n\n\n\nDie Frage die sich mir stellt, warum seid ihr gegen meinen Vorschlag. Was genau ist daran schlecht? Falls das kommt hat das nur Vorteile oder nicht. Der einzige Nachteil den ich sehe, dass Riot dafür Geld ausgeben muss um es zu implementieren, aber darum geht es ja eigentlich nicht bei uns.\n\nAlso warum es kompliziert machen und einer riesigen Anzahl an Menschen vertrauen, dass sie im Einzefall Situationen gegen ihren Vorteil handeln, weil sie das große ganze sehen wenn es nicht auch eine Lösung gibt, bei der das nicht nötig ist?","replies":[]}]}]}]}]}]},{"poster":"Released Ape","date":"2019-02-12T21:34:42.823+0000","up_votes":3,"down_votes":2,"body":"Schau mal im Telefonbuch unter Abschleppdienste","replies":[]}]}