{"poster":"tubarao312","date":"2015-12-16T23:40:07.668+0000","title":"This is Disgusting (Just Read)","subforum":"Player Behavior","up_votes":2,"down_votes":3,"body":"Just, look at this thing:\r\n\r\nI played a game of rengar, started roleplaying and oneshotting enemy team, said: Vayne, babe, come here then oneshotted her, got reported by the enemy team\r\n\r\nThen i played another game of rengar, said to my ekko: Please man look at the map a little more, we could have gotten that kill :)\r\n-reported by my team for saying the f*** word twice when i died (in the whole game)\r\n\r\nThen, guess it, guess it, yeah, I played another game, only used chat for communication, said the enemy Udyr had an op build who could deal with anyone, which I think it was fine we laughted it off, but I kept oneshotting his team, so someone in the enemy team reported me, again\r\n\r\n\r\nI don&#039;t know what the freaking hell is going on but saltiness over getting a lot of kills and oneshotting people on their base is on jesus christ!\r\nI sometimes flame but not to the point to get three consecutive reports in which two of them i barely said anything... (I did flame a little on the second example but the rest I was okay)\r\n\r\n\r\nDays like this make me wanna refund rengar...","replies":[{"poster":"3ofGot40ve","date":"2015-12-17T13:53:04.581+0000","up_votes":1,"down_votes":0,"body":"please teach me how to rengar xD whenever I play him, if I jump in I just get CCed and instakilled","replies":[]},{"poster":"shyv","date":"2015-12-17T03:59:52.582+0000","up_votes":1,"down_votes":0,"body":"playing rengar is against the summoner's code i would have reported you too","replies":[]},{"poster":"GamblerOfLives","date":"2015-12-17T00:43:11.368+0000","up_votes":1,"down_votes":0,"body":"http://matchhistory.eune.leagueoflegends.com/en/#match-details/EUN1/1303940220/204624139\n\nmy game 2 hours ago:).i know,i carried\n\nBut,they were really salty about my rengar:D:D:D:D:D::D:D::D::D:D:","replies":[]},{"poster":"Pierce The Veal","date":"2015-12-17T00:34:06.925+0000","up_votes":1,"down_votes":0,"body":"Yeah I sure as hell don't get honored for playing Akali. I wouldn't be surprised if you got reported.","replies":[]},{"poster":"Ńord","date":"2015-12-17T00:32:30.455+0000","up_votes":1,"down_votes":0,"body":"haha if someone talks shit about you on the enemy team, just go silent and farm on their flesh for the rest of the match. That'll make 'em regret it. >:)","replies":[]},{"poster":"splashmasta","date":"2015-12-16T23:43:55.812+0000","up_votes":1,"down_votes":0,"body":"lawl i know wat u mean :) {{champion:107}} {{champion:107}} {{champion:107}}","replies":[]},{"poster":"3Power","date":"2015-12-17T05:21:19.674+0000","up_votes":1,"down_votes":1,"body":"It's gradually getting to the point where you can't say anything to anyone that isn't 100% complimentary.  Taunting the other team?  Reportable.  Criticizing your teammates? Reportable.  Asking your team to please just surrender when it's 50 to 20, reportable. \n\nWorst part is Riot and half the community see it as a good thing.","replies":[]}]}