{"poster":"frizzyfreak","date":"2015-02-25T15:26:59.275+0000","title":"Per l'ennesima volta aggiornamento fallito...","subforum":"Aiuto e supporto","up_votes":4,"down_votes":1,"body":"Come in quasi tutte le patch l'update arriva ad un certo punto (di solito 31-33%) e mi esce \"unspecified error occurred. Please check the logs for more informations\". Ho tentato di tutto, sono andato sul supporto e ho fatto tutto quello che c'é scritto, ho riavviato piú volte il launcher e ho tentato la riparazione ma niente... Accetto qualsiasi tipo di consiglio e aiuto.","replies":[{"poster":"wilsonjefferson","date":"2015-02-27T20:22:48.749+0000","up_votes":1,"down_votes":0,"body":"Ragazzi sono riuscito a risolvere il problema: ho copiato l'intera cartella di \"riot games\" da un amico che  non ha avuto problemi con l'aggiornamento e l'ho  \"incollata\" sul mio ; ovviamente prima ho disinstallato il mio lol \"difettoso\". In seguito ho eseguito lol.launcher.admin.exe e ho potuto subito premere \"avvia\" sul lollauncher.\nSpero di esservi stati utili e buona fortuna !","replies":[]},{"poster":"Luca Laurenti","date":"2015-02-26T15:46:06.695+0000","up_votes":1,"down_votes":0,"body":"Ma ormai smetto di giocare per qualche mese...tanto ogni settimana ne esce un altra di patch e mi sono rotto il cazzo di tavanare e sclerare per niente.Quando metteranno un launcher che funzioni me lo scarico volentieri.È da quando ho iniziato a giocare che succede sempre così.Apro lol,mi compare l'icona,se ho culo si inizia a caricare di giallo ma poi i server dicono \"nha non ciò più voglia di scaricare\"e zac! GGWP riot, ggwp","replies":[]},{"poster":"Vesxtai","date":"2015-02-25T23:34:16.403+0000","up_votes":1,"down_votes":0,"body":"segui il consiglio che viene dato qui ---->   [bug fix](http://forums.na.leagueoflegends.com/board/showthread.php?t=4857743)     \n\noppure scarica hotspot shield  ---> http://www.hotspotshield.com/\n\nciao","replies":[{"poster":"Tezzeret89","date":"2015-02-26T00:26:06.906+0000","up_votes":1,"down_votes":0,"body":"niente.... continua a darmi lo stesso problema... se continua la riot potrebbe perdere molti giocatori credo, siamo stufi di questa situazione tutte le settimane","replies":[{"poster":"Vesxtai","date":"2015-02-26T00:45:47.676+0000","up_votes":1,"down_votes":0,"body":"sono dispiaciuto, a me ad ogni aggiornamento mi si blocca, ma creando il file S_OK  senza l'estensione, l'aggiornamento va a buon fine e posso giocare.\nsei sicuro d'aver creato il file nella cartella corretta (C:\\Riot Games\\League of Legends\\RADS\\projects\\lol_air_client\\releases\\0.0.1.131) e hai verificato che il file (S_OK) non abbia estensione? (basta che clikki col destro sul desktop , selezioni nuovo file di testo e cancelli subito il nome che immette di default sostituendolo con \"S_OK\" verifica che ti chieda di modificare l'estensione del file altrimenti non funzionerà)\nciao.","replies":[]}]}]},{"poster":"monnyflare","date":"2015-02-25T20:26:48.230+0000","up_votes":1,"down_votes":0,"body":"nemmeno a me si scarica... onestamente, che rottura.... ogni volta sta storia!","replies":[]},{"poster":"Baolirn","date":"2015-02-25T20:06:03.786+0000","up_votes":1,"down_votes":0,"body":"Adesso basta è tutto il giorno che cerco di scaricare sto aggiornamento... davvero qualcuno suggerisca una soluzione ogni volta che c'è un'aggiornamento perdo 2 giga di connessione (e ho una connessione limitata a 20!)\nSono nella tua stessa situazione... -.-","replies":[]},{"poster":"Col Mustard","date":"2015-02-25T18:07:35.825+0000","up_votes":1,"down_votes":0,"body":"ragazzi ho risolto cambiando il tipo di connessione!! nel mio caso ho scaricato l'aggiornamento dal cellulare.","replies":[{"poster":"frizzyfreak","date":"2015-02-25T18:17:48.799+0000","up_votes":1,"down_votes":0,"body":"In che senso cambiando tipo di connessione? io ho soltanto la chiavetta internet nient'altro","replies":[{"poster":"Col Mustard","date":"2015-02-25T18:24:45.904+0000","up_votes":1,"down_votes":0,"body":"in poche parole perdi dei pacchetti dati...ti serve una rete wifi o una adsl!!!","replies":[{"poster":"frizzyfreak","date":"2015-02-25T18:30:15.990+0000","up_votes":1,"down_votes":0,"body":"prima della 5.1 non mi era mai successo questo tipo di errore quindi non credo che dipenda dalla chiavetta... comunque attualmente non posso acquistare una rete fissa :(","replies":[{"poster":"wilsonjefferson","date":"2015-02-25T19:42:05.424+0000","up_votes":1,"down_votes":0,"body":"ho provato ad usare un'altra rete ma non ha funzionato, mha","replies":[]}]}]}]}]},{"poster":"wilsonjefferson","date":"2015-02-25T16:57:54.003+0000","up_votes":1,"down_votes":0,"body":"idem ...","replies":[]},{"poster":"CronickSw","date":"2015-02-25T16:40:16.455+0000","up_votes":1,"down_votes":0,"body":"Anch'io ho bisogno d'aiuto...","replies":[]},{"poster":"Col Mustard","date":"2015-02-25T16:35:17.796+0000","up_votes":1,"down_votes":0,"body":"sono nella tua stessa situazione!!!!","replies":[]}]}