{"poster":"AndrewStars13","date":"2018-02-07T23:58:48.082+0000","title":"¿Por que esta permitido trollear en normal?...","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":17,"body":"Eso, quiero saber, por que esta permitido, si tanto normal y ranked se juegan para ganar, de lo contrario, si jugas para perder, seria trollear obviamente.\r\n\r\nAhora quiero saber, por que?, de las ultimas 10 partidas, me trollearon 10 con los picks, ahora estoy afk en una partida, obviamente, TODO SER VIVO, TIENE UN LIMITE DE PACIENCIA CREO, soraka jg, aatrox adc, viktor supp sacaron, por que?. Nadie sabe, vaya a saber por que todas mis partidas son asi.","replies":[{"poster":"WhiteMax","date":"2018-02-08T03:08:31.385+0000","up_votes":2,"down_votes":0,"body":"Eso no es trollear, es ser antimeta y Riot permite el antimeta. Trollear seria que esa gente se dedique a feedear aproposito y no cumpla su rol en la partida.","replies":[]},{"poster":"Get Jïnxed","date":"2018-02-08T00:05:28.356+0000","up_votes":2,"down_votes":0,"body":"las normales ya son cualquier cosa hoy vi un braum que iba mid ensima se estaba armando full critico :v\n{{summoner:3}}","replies":[{"poster":"AndrewStars13","date":"2018-02-08T00:08:13.702+0000","up_votes":2,"down_votes":4,"body":"No se puede jugar, directamente, la gente te banea los champs a proposito sin motivo, hoy me quede boludo, queria jugar ekko, lo pickeaba, me lo banearon 3 veces sin motivo, ya desde la seleccion de campeon te trollea tu team...","replies":[]}]},{"poster":"MirRawrs","date":"2018-02-08T00:07:14.233+0000","up_votes":3,"down_votes":1,"body":"Jugar un pick 'raro' (cómo janna jg) no es considerado trollear en sí. Si lo pickean y comienzan a suicidarse una y otra vez si es Trollear {{summoner:31}}","replies":[]},{"poster":"Liliths","date":"2018-02-08T00:02:21.508+0000","up_votes":4,"down_votes":3,"body":"Con que cara hablas si te vas afk ¿?\n\nhttps://pm1.narvii.com/6571/81028aefb2ba869d8ae3b6b33e1457d1556ff83b_hq.jpg","replies":[{"poster":"AndrewStars13","date":"2018-02-08T00:03:47.422+0000","up_votes":1,"down_votes":10,"body":"Jajaja claro que si maquina, me voy a bancar 10 partidas trolleadas en un dia.\n\n¿Ban?, dale, marca o como quieras este post, cada 2 hs te voy a comentar: \" Y tu ban? donde esta? :( \"\n\nSimplemente para un poco mas de humillacion...","replies":[{"poster":"Liliths","date":"2018-02-08T00:07:30.878+0000","up_votes":3,"down_votes":2,"body":"Me da igual, si vos te vas afk deberias estar baneado, igual que los trolls. Y Ahi estan... Jugando igual que vos, ragequiter","replies":[{"poster":"AndrewStars13","date":"2018-02-08T00:10:17.496+0000","up_votes":1,"down_votes":5,"body":"Nono pa, jajaj vos dijiste ban, espero tu ban :c","replies":[{"poster":"Liliths","date":"2018-02-08T00:11:37.793+0000","up_votes":3,"down_votes":2,"body":"Como digas, el que pierde el tiempo sos vos. Bye \n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"AndrewStars13","date":"2018-02-08T01:38:24.016+0000","up_votes":2,"down_votes":5,"body":"Zzzzzz sigo esperando el ban... zzzzzz","replies":[]}]}]}]}]}]},{"poster":"Runth","date":"2018-02-08T07:05:25.633+0000","up_votes":2,"down_votes":1,"body":"http://las.op.gg/summoner/userName=andrewstars13\n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"AndrewStars13","date":"2018-02-08T07:41:25.356+0000","up_votes":1,"down_votes":1,"body":"Que pasoou goldi?","replies":[]}]},{"poster":"Vamirr","date":"2018-02-08T02:28:26.272+0000","up_votes":1,"down_votes":0,"body":"Las lineas y roles, top mid adc jungla y support son convenciones dentro del juego. Es decir, es una estrategia para que haya mas organizacion y tener mas posibilidades de ganar. Pero trollear no es elegir Soraka jungla, trollear es morir repetidas veces a proposito. Que no se confundan :)","replies":[]},{"poster":"Lunari Red Mask","date":"2018-02-08T01:45:29.539+0000","up_votes":1,"down_votes":0,"body":"Hola,\nLa pregunta no es sí te trollean, la pregunta es: del otro lado son todos pro o también trollean?\nPorque sí la cosa es igual tanto del lado rojo como del lado azul, es cuestión de jugar a quien es mejor. Yo jugué una partida normal para probar unas cosas y me toco con dos personas que probaban campeones, que igual me carrearon. De repente el pick anti-meta no esta prohibido y el juego ultimamente es para divertirse, por lo que sí quieren jugar algo más serios, existe lo ranked. Sin embargo, sí no pueden carrear una partida en normal, menos esperen carrear algo en ranked.\nSaludos.","replies":[]},{"poster":"JPablo01","date":"2018-02-08T01:28:54.811+0000","up_votes":1,"down_votes":0,"body":"Y si juegas ranked?","replies":[]},{"poster":"ImperfectIvo","date":"2018-02-08T00:07:04.818+0000","up_votes":1,"down_votes":1,"body":"Porque el Sistema de Riot no puede diferenciar un Troll de alguien que jugó mal pero se \"esforzó\". Tampoco responden al Soporte.\n\nHabrá que darles tiempo a que sigan mejorando y probando con el nuevo sistema que tratan de implementar, supuestamente mas estricto.","replies":[]},{"poster":"FedecarboneroUY","date":"2018-02-08T00:06:39.580+0000","up_votes":2,"down_votes":2,"body":"Trollean porque en este servidor son todos unos incompetentes, a mí me trollearon las últimas 5 partidas que jugué, para variar emparejan con low elos platinos oros y hasta platas el emparejamiento es un chiste, por eso casi no juego más :P","replies":[]},{"poster":"Dænerys Jelmazmo","date":"2018-02-08T00:03:21.045+0000","up_votes":1,"down_votes":7,"body":"Porque en normales no pierdes nada, ni ganas ni pierdes puntos y la gente solo juega ahi por diversion y probar cosas nuevas ;P","replies":[]}]}