{"poster":"You are Smart","date":"2019-11-26T18:33:40.389+0000","title":"The Sad Reality of the Current State of Jungle","subforum":"Gameplay","up_votes":22,"down_votes":9,"body":"At the start of patch 9.23 riot made big changes to the way gold and exp are distributed across the rift. Significantly buffing every lane minion experience, and very slightly reducing the shared experience coverage in the bot lane. Then the jungle changes came, with jungle xp being significantly reduced for the third season in a row and catch up xp being removed, riot's only compensation buff was to reduce the camp spawn timer by 30 seconds with additionally buffing gromp's stats so it's harder to clear in compensation for gromp's additional 20 xp and 19 gold.\n\nNot to mention the fact that the scaling power of the small camps and buff camps has been completely gutted since patch 9.2 making it impossible for a jungler that even has power farm potential to be less than 2 levels down in the current meta than the top or mid laner farming his waves the same amount of time that you farm your camps in the jungle.\n\n**_Patch 9.2_**\n* Small Camps\n* Experience scales every second level instead of every level; scaling reduced from +50% to +25%.\n* \n* XP SCALING Every level from 1-7 ⇒ Levels 1/3/5/7\n* GROMP XP115-172.5 ⇒ 115-143.75\n* GREATER MURK WOLF XP65-97.5 ⇒ 65-81.25\n* MURK WOLF XP25-37.5 ⇒ 25-31.25\n* CRIMSON RAPTOR XP20-30 ⇒ 20-25\n* RAPTOR XP20-30 ⇒ 20-25\n* ANCIENT KRUG XP100-150 ⇒ 100-125 (reminder: first clear still grants 30% reduced XP)\n* KRUG XP35-52.5 ⇒ 35-43.75\n* LESSER KRUG XP7-10.5 ⇒ 7-8.75\n* Buff Camps\n* Experience scales every second level instead of every level; scaling reduced from +57% to +25%.\n* \n* XP SCALINGEvery level from 1-7 ⇒ Levels 1/3/5/7\n* RED BRAMBLEBACK115-180 ⇒ 115-143.75\n* BLUE SENTINEL115-180 ⇒ 115-143.75\n\n\nWhile season 9 was already a very difficult season for junglers due to majority of them failing to keep up with the solo laner's xp because of numerous hard nerfs to the jungle (Which led to the frustrating heavy gank meta to soak up lane xp to be ahead), it was still possible to have a lead on the enemy when you cleared xp from krugs. Now that solo lanes xp is massively buffed and jungle xp and gold nerfed it is no longer possible to get any lead for a jungler to have a carry impact without them soaking heavy solo lane experience. This is because even with the 30 sec compensation and the gromps exp being increased to balance out the map while every single camp was nerfed junglers will always be dependent on their laners success. This is because even with the camp timer being recuded the xp is so disgustingly minimal that a single wave will be equivalent to your entire red side xp. For example in the preseason if the enemy top laner is 3/0 there is a good chance he is lvl 9 about to hit 10 while the jungler that is 1/0 just managed to hit lvl 6. Due to the fact that dual lane shared exp has been reduced also means a direct nerf to jungle ganks because if the jungler will try to soak up the xp that will mean that both him and his other laner will now be more behind than taking the xp alone. The only viable way to play the carry style as a jungler is to split a solo lane in the mid to late game as nothing else will give you any significant lead. Which is also the reason that \"Jungler Diversity\" is infact going down completely to the drain due to the fact that only the \"support style\" junglers that fall off more than the actual supports will become the ones that are viable which was already a trend in season 9 and foremost season 1-2.\n\n**_Patch 9.23_**\nKrugs\nBASE XP247 (217 on first clear) ⇒ 160 (Ancient Krug's first clear penalty removed)\nBASE GOLD125 ⇒ 120\nMurkwolves\nBASE XP115 ⇒ 95\nBASE GOLD84 ⇒ 70\nGromp\nBASE HEALTH1800 ⇒ 2100\nBASE XP115 ⇒ 135\nBASE GOLD86 ⇒ 105\nRaptors\nBASE XP115 ⇒ 95\nBASE GOLD112 ⇒ 85\n\nThe only positive change of the patch that helped increase \"jungler diversity\" was the xp change (revert) that allows junglers to hit lvl 3 off of each side of the map rather than only the redside. My strong advice to help \"jungler diversity\" is to remove either remove the educed 30 second and buff / revert jungle xp from previous seasons or simply buff the jungle xp so that other roles aside from the early or the support jungler will be viable in the meta. At the moment the Jungle meta feels extremely impoverished as seen by previous threads on the boards. It is really important that changes should be made in a positive effect in the jungle as in the moment jungle simply feels like an under-leveled smite bot that had only one duty of securing the super strong preseason objectives.","replies":[{"poster":"5050BS","date":"2019-11-26T18:57:03.619+0000","up_votes":10,"down_votes":31,"body":"No.\n\nThe game needed these jungle nerfs for a reason.  Jungle has been too strong.  Now you have to play smarter and go for objectives not just perma gank every minute of the game.","replies":[{"poster":"Quáx","date":"2019-11-26T19:00:22.925+0000","up_votes":25,"down_votes":5,"body":"Jungle feels awful now, farming camps has become a must and if you fall behind even a little bit you're screwed. You typically are level fucking 4 when the enemy top and mid are 6-7. What are we supposed to do against that lol.","replies":[{"poster":"Z3SIeeper","date":"2019-11-26T20:50:49.534+0000","up_votes":7,"down_votes":15,"body":"Support your laner who is also level 6-7.\n\nI find it more insane that junglers think they should be able to straight 1v1 a solo laner.","replies":[{"poster":"Quáx","date":"2019-11-26T23:01:04.514+0000","up_votes":6,"down_votes":2,"body":"If you're uber ahead then yes you should, but you cant anymore, you cant carry because you're so far in xp, and furthermore you cant really help push a wave after a kill because of the duo xp nerf. It sucks.","replies":[{"poster":"Z3SIeeper","date":"2019-11-27T02:05:06.141+0000","up_votes":4,"down_votes":4,"body":"I completely agree with a jungler that's uber ahead beating a solo laner in a 1v1. It makes sense and that's why they totally can right now.\n\nAlso yes you should still help push a wave after a kill. It lets your solo laner get out faster, resets the wave and deletes allied minions so the enemy doesn't get *any* xp or gold from them. I'd say that's worth for the low price of duo xp.\n\nAnd I have to ask, how much have you played this preseason? I've played several games as a jungler and several games with a jungler and several games against a jungler who got ahead and was essentially carrying the game.","replies":[{"poster":"Sharkiii","date":"2019-11-27T05:26:25.620+0000","up_votes":5,"down_votes":2,"body":"> [{quoted}](name=Z3Sleepier,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=00010000000000010000,timestamp=2019-11-27T02:05:06.141+0000)\n>\n> I completely agree with a jungler that's uber ahead beating a solo laner in a 1v1. It makes sense and that's why they totally can right now.\n> \n> Also yes you should still help push a wave after a kill. It lets your solo laner get out faster, resets the wave and deletes allied minions so the enemy doesn't get *any* xp or gold from them. I'd say that's worth for the low price of duo xp.\n> \n> And I have to ask, how much have you played this preseason? I've played several games as a jungler and several games with a jungler and several games against a jungler who got ahead and was essentially carrying the game.\n\nI've managed to play quite a few. And more often then not, both junglers are struggling to stay relevant to top laner, as far as levels go. Enemy top laner is lvl 7 while my jungler is just hitting level 4. Maybe 5. Which means as a top laner if I'm struggling against my opponent, my jungler can't do shit about it. So top just snowballs out of control. Previous season you could still snowball yes, but it didn't feel so lopsided to me.","replies":[{"poster":"Z3SIeeper","date":"2019-11-27T06:51:36.052+0000","up_votes":4,"down_votes":4,"body":"Almost every time I've felt that junglers still could have heavy impact on top lane despite the difference. This is both from experience in top and jungle.\n\nSo often the top snowball is determined by which side gets the lead to begin with, which typically comes from one jungler starting the snowball for them.\n\nMost of these ganks that heavily impact the lane happen far before 6.\n\nA pre-6 gank that goes well topside can set one laner a full level or more above their opponent. If the enemy isn't running TP, it's not uncommon to see a 2 level difference after a gank.","replies":[]}]}]}]},{"poster":"Yenn","date":"2019-11-27T05:24:50.921+0000","up_votes":8,"down_votes":4,"body":"> [{quoted}](name=Z3Sleepier,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=000100000000,timestamp=2019-11-26T20:50:49.534+0000)\n>\n> Support your laner who is also level 6-7.\n> \n> I find it more insane that junglers think they should be able to straight 1v1 a solo laner.\n\nIf they can't 1v1 a solo laner, what is stopping the solo laners from just warding their jungle and instantly killing if they dare enter it? \n\nSpoiler: The answer is 'nothing.'\n\nThis is basically what 90% of Diamond+ games have devolved into. Even if you know the enemy solo lane is invading, your only option is to concede the camp and get put permanently behind because you have no catch up mechanism.","replies":[{"poster":"Z3SIeeper","date":"2019-11-27T06:49:28.494+0000","up_votes":3,"down_votes":4,"body":"> [{quoted}](name=Yenn,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=0001000000000002,timestamp=2019-11-27T05:24:50.921+0000)\n>\n> This is basically what 90% of Diamond+ games have devolved into. Even if you know the enemy solo lane is invading, your only option is to concede the camp and get put permanently behind because you have no catch up mechanism.\n\nThis would also be true for your team then no?","replies":[{"poster":"Yenn","date":"2019-11-27T07:00:22.832+0000","up_votes":7,"down_votes":4,"body":"> [{quoted}](name=Z3Sleepier,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=00010000000000020000,timestamp=2019-11-27T06:49:28.494+0000)\n>\n> This would also be true for your team then no?\n\nIt turns out that not all champions are equal. Whoever has a stronger early game and wins the 1v1 can do this. The other can only hope their jungle doesn't feed their opponent.","replies":[{"poster":"Z3SIeeper","date":"2019-11-27T07:48:40.250+0000","up_votes":4,"down_votes":6,"body":"Lane matchups aren't black and white like that though. Even in counter matchups, 1v1 deaths aren't that common pre-6 unless one side already has an established lead.\n\nThose established leads are usually via the jungler. In the cases where it's not, it's usually a case of skill difference (or one player gambling way too much on high-risk plays win or lose).\n\nIn the latter cases, yeah, your laner lost, your priority over that section of the map is lost.\n\nIn the former cases, as a jungler you still have room to influence the lane or deny enemy influence on the lane depending on the laner and jungler matchups. If that isn't possible because of those matchups, then you look mid or bot to do the exact same thing but in a different lane.","replies":[]}]}]}]},{"poster":"BONUS DMG 2NOOBS","date":"2019-11-26T20:56:31.345+0000","up_votes":7,"down_votes":6,"body":"> [{quoted}](name=Z3Sleepier,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=000100000000,timestamp=2019-11-26T20:50:49.534+0000)\n>\n> Support your laner who is also level 6-7.\n> \n> I find it more insane that junglers think they should be able to straight 1v1 a solo laner.\n\nThat is not what his post says.  Reading comprehension is hard?","replies":[{"poster":"Z3SIeeper","date":"2019-11-26T21:39:09.563+0000","up_votes":5,"down_votes":8,"body":"It’s what it implies. Reading comprehension goes beyond understanding the basic definition of words, you also have to look into context. Lmk if u need any further assistance in understanding what that entails.","replies":[{"poster":"BONUS DMG 2NOOBS","date":"2019-11-26T21:44:48.892+0000","up_votes":2,"down_votes":4,"body":"> [{quoted}](name=Z3Sleepier,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=00010000000000000000,timestamp=2019-11-26T21:39:09.563+0000)\n>\n> It’s what it implies. Reading comprehension goes beyond understanding the basic definition of words, you also have to look into context. Lmk if u need any further assistance in understanding what that entails.\n\nDunning Kruger award winner for Z3.","replies":[{"poster":"Z3SIeeper","date":"2019-11-27T02:08:42.673+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Quáx,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=00010000,timestamp=2019-11-26T19:00:22.925+0000)\n>\n> You typically are level fucking 4 when the enemy top and mid are 6-7. What are we supposed to do against that lol.\n\n[](http://.)\n\n> [{quoted}](name=Z3Sleepier,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=000100000000,timestamp=2019-11-26T20:50:49.534+0000)\n>\n> Support your laner who is also level 6-7.\n\nR e a d i n g C o m p r e h e n s i o n .\n\nYou can agree with this or disagree with this, totally your choice. But whether or not you agree, you'd have to be an extraordinary human to not see that this response is 100% relevant to what it's replying to.","replies":[{"poster":"Argent Wolf","date":"2019-11-27T16:10:58.535+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Z3Sleepier,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=0001000000000000000000000000,timestamp=2019-11-27T02:08:42.673+0000)\n>\n> [](http://.)\n> \n> R e a d i n g C o m p r e h e n s i o n .\n> \n> You can agree with this or disagree with this, totally your choice. But whether or not you agree, you'd have to be an extraordinary human to not see that this response is 100% relevant to what it's replying to.\n\nIt's relevant, also you're agreeing with him.  You're basically saying there's nothing he can do and to go apply map pressure somewhere else.  \n\nIt's true, and it's also bullshit.  Mid keeps up in levels, but I don't know if Top is even wary of Mid at this point.","replies":[{"poster":"Z3SIeeper","date":"2019-11-27T19:56:36.983+0000","up_votes":2,"down_votes":2,"body":"Mid keeps up in levels, why would top not be wary of the most relevant role in the game?\n\nMid has the ability to roam to literally wherever they feel like due to being in the center of the map. Mid control = both top and bot control. Winning mid is *the* priority this preseason in 90% of games for that reason. Top and bot are secondary.\n\nAnd no, I didn't say there's nothing he could do. I quite literally said go support them. You have the option of supporting your ally into a potential 2v1 situation or just going somewhere else.","replies":[{"poster":"Argent Wolf","date":"2019-11-27T23:30:06.397+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Z3Sleepier,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=000100000000000000000000000000000000,timestamp=2019-11-27T19:56:36.983+0000)\n>\n> Mid keeps up in levels, why would top not be wary of the most relevant role in the game?\n> \n> Mid has the ability to roam to literally wherever they feel like due to being in the center of the map. Mid control = both top and bot control. Winning mid is *the* priority this preseason in 90% of games for that reason. Top and bot are secondary.\n> \n> And no, I didn't say there's nothing he could do. I quite literally said go support them. You have the option of supporting your ally into a potential 2v1 situation or just going somewhere else.\n\nYour words:  \"Support your laner who is also level 6-7.\n\nI find it more insane that junglers think they should be able to straight 1v1 a solo laner.\"  \n\nThat doesn't sound like you're saying to go support him at top.  It sounds like you're saying to go somewhere else, but now you're saying that's not what you said.  I was wrong.  Your comment didn't make sense after all.  I was dumb to defend your words and try to make sense of them.  \n\nThat said, apply map pressure somewhere else until they make adjustments.  There's nothing a lvl 6 jg can do when top lane is a couple of levels up.\n\nAlso, The comments were specifically about top and had nothing to do with the relevance of Mid in the game.  I disagree with you.  Mid isn't going to roam top.  Mid is going to roam bot where they have a level advantage and are able to assist in securing dragons.","replies":[{"poster":"Z3SIeeper","date":"2019-11-28T01:46:55.874+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Argent Wolf,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=0001000000000000000000000000000000000000,timestamp=2019-11-27T23:30:06.397+0000)\n>\n> Your words:  \"Support your laner who is also level 6-7.\n\n[](http://.)\n\n> [{quoted}](name=Argent Wolf,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=0001000000000000000000000000000000000000,timestamp=2019-11-27T23:30:06.397+0000)\n> \n> That doesn't sound like you're saying to go support him\n\nCan we uh... just /thread this one? I think logic went out the window here.\n\n---\n\n> [{quoted}](name=Argent Wolf,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=00010000000000000000000000000000,timestamp=2019-11-27T16:10:58.535+0000)\n>\n> Mid keeps up in levels, but I don't know if Top is even wary of Mid at this point.\n\n\\> Me: Replies with stuff about mid lane relevancy compared to top\n\n> [{quoted}](name=Argent Wolf,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=00010000000000000000000000000000,timestamp=2019-11-27T16:10:58.535+0000)\n>\n> Also, The comments were specifically about top and had nothing to do with the relevance of Mid in the game.\n\nYeah no I think I'm done with you bud, no offense. I'll stick to discussing with the other people.","replies":[{"poster":"Argent Wolf","date":"2019-11-28T02:06:42.364+0000","up_votes":1,"down_votes":2,"body":"This is what I quoted and what I replied, but you prefer to break sentences apart to make yourself look .... better?  I don't know why you'd do that.  Anyone can clearly see what I quoted by scrolling up.  \n\n\n> **Your words: \"Support your laner who is also level 6-7.\n> \n> I find it more insane that junglers think they should be able to straight 1v1 a solo laner.\"\n> \n> That doesn't sound like you're saying to go support him at top.**\n\n\nThere is one thing we can agree on.  I would prefer if you never quote me or comment to me again, since you can't even do it correctly.  Good day sir.","replies":[{"poster":"Z3SIeeper","date":"2019-11-28T02:27:48.073+0000","up_votes":1,"down_votes":1,"body":"Because the second line had nothing to do with the first line. Context matters buddy.\n\nHuge yikes so yeah, cya later.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"General Esdeath ","date":"2019-11-27T05:48:06.376+0000","up_votes":4,"down_votes":3,"body":"> [{quoted}](name=Quáx,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=00010000,timestamp=2019-11-26T19:00:22.925+0000)\n>\n> Jungle feels awful now, farming camps has become a must \n\nIsn't that the plan? Or are we going to go back and complain about junglers camping and not needing to farm?","replies":[{"poster":"Hügö","date":"2019-11-27T16:40:42.661+0000","up_votes":4,"down_votes":2,"body":"Maybe junglers want to be the same level as laners when the power farm and not be 2 levels behind?","replies":[]}]}]},{"poster":"Plant Auditor","date":"2019-11-26T19:16:46.993+0000","up_votes":18,"down_votes":3,"body":"***","replies":[{"poster":"holystack","date":"2019-11-26T19:25:20.856+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Plant Auditor,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=00010002,timestamp=2019-11-26T19:16:46.993+0000)\n>\n> You are a person that is over 1,150 games stuck in Silver elo and you will not even take the time to explain your statement only spewing mindless phrases like \"permagank\" and \"every minute\".\n\nComments like his show a huge lack of general game knowledge. Can't take players like that any seriously ","replies":[]}]},{"poster":"Paroe","date":"2019-11-26T19:15:57.156+0000","up_votes":15,"down_votes":1,"body":"> [{quoted}](name=5050BS,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=0001,timestamp=2019-11-26T18:57:03.619+0000)\n>\n> No.\n> \n> The game needed these jungle nerfs for a reason.  Jungle has been too strong.  Now you have to play smarter and go for objectives not just perma gank every minute of the game.\n\nI hope you realize that this isnt true across the board and that \"The jungle being strong\" is due to riots continued changes that force only A and above tier junglers into it as the only ones capable of clearing camps fast enough. \n\nDo you know what every common jungler has in common? They:\n1) Are mobile\n2) Have multiple AoE abilities\n3) Have built in sustain\n4) How relatively low cooldowns for their main abilities\n\nThe jungle itself isnt a strong, dominant position. The champions who make up its roster are strong, dominant champions. Its a very subtle but extremely important difference.","replies":[]}]},{"poster":"Ragnaveil","date":"2019-11-26T20:47:26.431+0000","up_votes":7,"down_votes":1,"body":"Catchup EXP should have been halved, not outright removed. On the flip side, the EXP gains for solo should be less than what they are now. The only reason top matters is if your poor toplaner had to FP and got shoved in a very shitty matchup where if it snowballs the game is over. Thats not top influence, its garbage design.","replies":[{"poster":"You are Smart","date":"2019-11-26T21:23:07.118+0000","up_votes":5,"down_votes":0,"body":"I see your point, I would be happy that catch up exp got removed but I find the removal of it as a slight nerf when jungle camp experience is already incredibly low if you know what I mean.","replies":[{"poster":"Ragnaveil","date":"2019-11-26T21:45:20.096+0000","up_votes":6,"down_votes":2,"body":"Right, and thats the problem. You get behind= You cant close the gap ever unless they fuck up for 5 minutes straight without getting exp here and there long as its full removed. Halving it allows for aggressive play, but still has the get behind tradeoff if it fails.","replies":[]}]},{"poster":"Argent Wolf","date":"2019-11-27T16:07:20.794+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Ragnaveil,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=0002,timestamp=2019-11-26T20:47:26.431+0000)\n>\n> Catchup EXP should have been halved, not outright removed. On the flip side, the EXP gains for solo should be less than what they are now. The only reason top matters is if your poor toplaner had to FP and got shoved in a very shitty matchup where if it snowballs the game is over. Thats not top influence, its garbage design.\n\nIf top messed up, got killed, previously JG was able to go top and help even things out.  The level difference makes this impossible now.","replies":[{"poster":"Ragnaveil","date":"2019-11-27T18:33:23.265+0000","up_votes":1,"down_votes":0,"body":"Exactly. Thats why I want the solo exp buff removed. Its not necessary if shared is nerfed. Then catchup exp returns, but at half its original value.","replies":[]}]}]},{"poster":"Fizzletop","date":"2019-11-27T06:10:10.884+0000","up_votes":5,"down_votes":0,"body":"GOOD start but there are some many points you are missing about what is actually happening in the vast majority of games. \n\nOkay so first riot nerfs exp and gold in jungle and nerfs duo lane, then they buff exp in solo lanes. the Net gain to solo lanes is 5% over duo lane and 6% over jungle. Now RIot claims that the reduced spawn time makes up for this, HAH! Okay so now you need to farm more to get to the same level as before but, all the camps still require the same amount of resources (HP, Mana, TIME) (This is why junglers that move fast are higher tier atm) but, becuase you have to farm more of them time has actually been increased because you spend more time pathing now in order to get to the same level of exp and gold as before. \n\nTo test and illustrate this fact I went into practice tool on Clearing god Olaf. Start Blue with double smite (CD reset in practice tool) this was to mimic a leash, Gromp smite, wolves, raps, red, krugs smite, scuttle. B shop, run back to gromp, top scuttle, wolves, etc, etc, etc. SO doing this Olaf could not stay ahead of camp respawn until level 10 with full jungle item and boots... SO the idea that you can just farm more is wrong, you literally cannot out farm the camps until the game is half over.\n\nOkay next, these exp changes totally throw out of wack windows of power and difference between lane and jungle. So like you said lane will be level 6 and your still level 4 in the jungle. Which means jungle has no chance to gank top or mid and more pressure is applied bot, who already complained they were too much the focus. But wait it gets worse. Because the jungler has no map pressure over the laners who are pulling ahead, the laning phase for top and mid is totally breaking down at level 6 and 7 as they are just free to roam with no one to punish them. Run into the jungler, great free kill as there is no counter play for being two level under at 4-5 to a 6-7. Dont run into the jungler, no big deal just go abuse bot lane who is still level 4-5. \n\nThe new strat Im starting to see from laners is to just hit 6, go buy, and then come back to lane and go ward enemy jungle camps. wait to see level 4 jungler clearing camps and just go delete them. Becuase hey, the laner is level 6 and has more items from gold. \n\nThis 2% bonus mid and top got is also exacerbating snowball leads, for every wave that you can force someone off of you are getting that much bigger of a lead that lasts for longer (time is such a relative factor in lol). So as teemo poke the jax off the first wave, okay usual stuff, but now you can hit level 2 2% faster and have that 5 second window to totally push him off the 3rd wave, and now your totally set up to own the lane for the next 5 mins or the rest of the game provided you dont do something dumb.  And maybe this is the wrong example (I dont know my top matches as well anymore) but, I keep seeing where one solo laner is getting that little bit of an edge and using it to great extent. SO like having a 12% bonus from exp by the time they are level 6 and ending up with a huge 30-40 second window before the other laner catches up to them and just being able to crush them with their ult.\n\nThese exp changes to jungle have also totally thrown out of wack the balance of ganking vs time use and farming and what you can judge as a success.  Now to stay relevent as a jungler you pretty much have to get atleast one kill pre level 6 if not three kills, all other results from a gank  put you behind. So gank and get an assist -behind a little, gank and get flash -behind alot, gank and die -behind a shit ton!\n\nAlso, because of the whole timing of your own farm thing, counter jungling is a pointless waste of your time other than to put the other jungler back (who may not even notice because of 2:00 min respwan time) Pretty much its pointless to take the extra time to cross river for just one camps. If you can get a scuttle it maybe a break even. But, in most cases you're better served by just going to your next camp in sequence. And sure you may put the other jungler back but, you are still falling further behind too so... great now there are two junglers on the map who cant do shit except feed. \n\n\nNOW OF COURSE! there are outliers of games which aren't what I described above, sometimes mid and bot mix it up in river at level 3 and 3 people with below 20% HP walk right into a Kha'zix... \nBut what I describe above has been my experience in the vast majority of games all of which leads to one side having snowballed solo laners who just wreck face on the match with their exp and gold lead which usually only grows the longer the game goes and the more they flex their power. \n\nAnd to the people saying jungle just needs to adapt to the changes, there is no adapting to a level 11 Darius roaming your jungle while you're still level 7 because he got 3 solo kills top and you got an assist and two drags bot.","replies":[]},{"poster":"016 Hiro","date":"2019-11-26T21:33:13.571+0000","up_votes":4,"down_votes":0,"body":"And suddenly Warwick who has fast clear, good early ganks, good duels, decent mobility is now god tier with 55%+ WR\n\nI can understand catchup exp being removed or experience from camps lowered, but with both nerf you do one mistake in jungle and you are screwed for next 10 minutes\n\nEvery jungler who scale, have bad clear are now total trash tier. Now I am not allowed to touch any \"fun pick\" like Karth or Brand\n","replies":[{"poster":"GilxeN","date":"2019-11-27T09:36:58.216+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=016 Hiro,realm=EUNE,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=0004,timestamp=2019-11-26T21:33:13.571+0000)\n>\n> And suddenly Warwick who has fast clear, good early ganks, good duels, decent mobility is now god tier with 55%+ WR\n> \n> I can understand catchup exp being removed or experience from camps lowered, but with both nerf you do one mistake in jungle and you are screwed for next 10 minutes\n> \n> Every jungler who scale, have bad clear are now total trash tier. Now I am not allowed to touch any \"fun pick\" like Karth or Brand\n\nLol karthus atm is sitting S tier.","replies":[{"poster":"Ragnaveil","date":"2019-11-27T18:35:24.393+0000","up_votes":1,"down_votes":0,"body":"Mages and Mage items are why, not necessarily his farming playstyle.","replies":[]},{"poster":"Argent Wolf","date":"2019-11-27T16:06:02.526+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GilxeN,realm=EUW,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=00040001,timestamp=2019-11-27T09:36:58.216+0000)\n>\n> Lol karthus atm is sitting S tier.\n\nBased on what?  Looks like C tier on u.gg with a 47.96 WR","replies":[]}]},{"poster":"BlackXIV","date":"2019-11-27T03:10:42.300+0000","up_votes":1,"down_votes":0,"body":"Karthus is still viable since he clears faster than anyone else.","replies":[{"poster":"Fizzletop","date":"2019-11-27T06:13:47.571+0000","up_votes":1,"down_votes":0,"body":"Yeah but who cares, with top and mid being level 8 by the time you hit 6 you may as well have a 3 man global ult that only effects adc, sup, and jung. And god pray that the top or mid laner dont just ward you out when they hit 6 and start hunting you down, cause you were already paper thin even without the solo lane 6% net exp buff but now... being two level under come mid game... forget about it.","replies":[]}]}]},{"poster":"Thilmer","date":"2019-11-26T22:18:59.640+0000","up_votes":2,"down_votes":0,"body":"I have noticed that the classic \"better jungler wins\" thing is much more prominent now than before. And it already anoyed me before, mind you.","replies":[]},{"poster":"Slitorous","date":"2019-11-26T22:29:27.883+0000","up_votes":3,"down_votes":1,"body":"More than half the JG champs are completely useless now as well as the top tier ones. It all comes down to how fast you can move around the map and clear camps if you want to stay relevant in the game while the top/mid have 5 level lead on you...","replies":[]},{"poster":"Nahath","date":"2019-11-26T20:58:56.312+0000","up_votes":3,"down_votes":1,"body":"It would be interesting to test this by playing without a dedicated jungler (though you'd need four other people to go along with you). My theory is that if jungling is too weak, then this strategy would be superior (or at least equal) to having a jungler.\n\nOn the other hand, if including a jungler is still the most effective way to play, then the jungle nerfs are appropriate from a balance perspective.\n\nI say from a \"balance\" perspective because they may still be bad from a fun perspective. It could be the case that the benefits of having a character who is only visible when he ganks or passes a ward outweigh the drawbacks of that character being underleveled, but that the experience of playing the underleveled character is unrewarding.\n\nIn my own experience, jungling has definitely become less rewarding for me, particularly when I gank someone two levels above me and get nuked, but I also wonder if what has really happened is that the jungler's power to win the game has simply been brought in line with that of the other characters. I'm still undecided.","replies":[{"poster":"Paroe","date":"2019-11-26T21:26:50.432+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Nahath,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=0003,timestamp=2019-11-26T20:58:56.312+0000)\n>\n> It would be interesting to test this by playing without a dedicated jungler (though you'd need four other people to go along with you). My theory is that if jungling is too weak, then this strategy would be superior (or at least equal) to having a jungler.\n> \n> On the other hand, if including a jungler is still the most effective way to play, then the jungle nerfs are appropriate from a balance perspective.\n> \n> I say from a \"balance\" perspective because they may still be bad from a fun perspective. It could be the case that the benefits of having a character who is only visible when he ganks or passes a ward outweigh the drawbacks of that character being underleveled, but that the experience of playing the underleveled character is unrewarding.\n> \n> In my own experience, jungling has definitely become less rewarding for me, particularly when I gank someone two levels above me and get nuked, but I also wonder if what has really happened is that the jungler's power to win the game has simply been brought in line with that of the other characters. I'm still undecided.\n\nDouble marksman, double support, roaming mid is a viable strategy. \nBut the meta is so ingrained in peoples heads they cannot deviate.","replies":[{"poster":"BlackXIV","date":"2019-11-27T03:16:46.341+0000","up_votes":1,"down_votes":0,"body":"You do that and you give up 20% of the gold and experience available around the map. You could never win a single game at a decent elo.","replies":[]}]},{"poster":"BlackXIV","date":"2019-11-27T03:15:00.959+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nahath,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=0003,timestamp=2019-11-26T20:58:56.312+0000)\n>\n> It would be interesting to test this by playing without a dedicated jungler (though you'd need four other people to go along with you). My theory is that if jungling is too weak, then this strategy would be superior (or at least equal) to having a jungler.\n> \n> On the other hand, if including a jungler is still the most effective way to play, then the jungle nerfs are appropriate from a balance perspective.\n\nTypical nonsensical argument. Jungle can be weak but still better than double duo because the income sources are 4: the 3 lanes and the jungle. Giving up the 4th source of income can never be better regardless of how weak it is. As proven by botlane which is weaker then soloes while taking all the gold and supports being weaker than jungle while having gold income dedicated items.","replies":[{"poster":"Crescent Dusk","date":"2019-11-27T04:58:03.717+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=BlackXIV,realm=EUW,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=00030001,timestamp=2019-11-27T03:15:00.959+0000)\n>\n> Typical nonsensical argument. Jungle can be weak but still better than double duo because the income sources are 4: the 3 lanes and the jungle. Giving up the 4th source of income can never be better regardless of how weak it is. As proven by botlane which is weaker then soloes while taking all the gold and supports being weaker than jungle while having gold income dedicated items.\n\nThey are not weaker lol, games still live and die by which bot lane wins.","replies":[{"poster":"BlackXIV","date":"2019-11-27T16:18:47.152+0000","up_votes":1,"down_votes":0,"body":"I'm talking individual relative strength. Put any adc against any toplaner before 25 minutes and look at who's stronger.\nBotlane really only decides games with they priority they give to Dragon (in that sense mid and jungle are just as important) or in the lategame (in the rare instances a game gets there), also it's two people. Your argument is so wrong the wrongess spills out it from every hole.\n\nAlso, for crying out loud, please agree on something. Most people whine that jungle decides the game, you complain it lives or dies by the botlane meanwhile Midlane has all the farm, all the exp and is next to all the objectives.\nCan we stop it, your (all of you solo laners never happy with anything) jokes aren't fun anymore.","replies":[{"poster":"Crescent Dusk","date":"2019-11-27T23:48:57.032+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BlackXIV,realm=EUW,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=0003000100000000,timestamp=2019-11-27T16:18:47.152+0000)\n>\n> I'm talking individual relative strength. Put any adc against any toplaner before 25 minutes and look at who's stronger.\n> Botlane really only decides games with they priority they give to Dragon (in that sense mid and jungle are just as important) or in the lategame (in the rare instances a game gets there), also it's two people. Your argument is so wrong the wrongess spills out it from every hole.\n> \n> Also, for crying out loud, please agree on something. Most people whine that jungle decides the game, you complain it lives or dies by the botlane meanwhile Midlane has all the farm, all the exp and is next to all the objectives.\n> Can we stop it, your (all of you solo laners never happy with anything) jokes aren't fun anymore.\n\nWho the hell rates a 2 man lane by individual performance of a champion. The fact is bot lane is a 2 man package, and getting 2 people ahead, including the champ with the best scaling and teamfighting/sieging in the game has no competition.\n\nADC's have been so overbuffed that they're relevant by the time they have 2 items, which is most certainly not late game. A caitlyn with a single crit item is already putting out dumb damage, and so is Kai'sa.\n\nJungle doesn't decide crap, its now perennially underleveled compared to all lanes and requires each lane to be already winning their match up to have priority to contest river objectives and avoid invades into his jungle.\n\nThis is fairly obvious in Worlds/LCS where the snowballs and game-deciding factor is which bot lane won, not the top lane.","replies":[{"poster":"BlackXIV","date":"2019-11-28T01:31:24.035+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Crescent Dusk,realm=NA,application-id=3ErqAdtq,discussion-id=XgzAVNHy,comment-id=00030001000000000000,timestamp=2019-11-27T23:48:57.032+0000)\n>\n> Who the hell rates a 2 man lane by individual performance of a champion. The fact is bot lane is a 2 man package, and getting 2 people ahead, including the champ with the best scaling and teamfighting/sieging in the game has no competition.\n\nEhm... we're talking about roles, it would be silly if two players were weaker than one (and we're almost there to be honest) I really don't get what you're getting at.\n\n> Jungle doesn't decide crap, its now perennially underleveled compared to all lanes and requires each lane to be already winning their match up to have priority to contest river objectives and avoid invades into his jungle.\n\nOnly thing you said that makes sense.","replies":[]}]}]}]}]}]},{"poster":"Tusutaki","date":"2019-11-28T02:50:28.928+0000","up_votes":1,"down_votes":0,"body":"Dont forget the most damning element in of all of this. Camps that are of lower level than you still gives 10% reduced XP per level difference. So even if you perform well and get all the drags and so forth, you will still be behind in levels.","replies":[]},{"poster":"MuffledGarbage","date":"2019-11-27T18:39:55.018+0000","up_votes":1,"down_votes":0,"body":"So this is why I keep not getting ganks from my jungler. Good to know.","replies":[]}]}