{"poster":"Max Stirner","date":"2019-08-30T09:06:32.518+0000","title":"Csak egy feltételezés","subforum":"Általános beszélgetés","up_votes":1,"down_votes":1,"body":"Mostanság felmerült az, hogy Maaroninho és Larry777 ugyanaz a személy. Nos lássuk az esetleges hasonlóságokat a fiókok között.\nA felhasználók stílus, és viselkedésbeli hasonlóságát nem kell ecsetelnem, de ez önmagában nem bizonyíték semmire.\nItt van a két account:\nhttps://www.leagueofgraphs.com/hu/summoner/eune/MAaroninho\nhttps://www.leagueofgraphs.com/hu/summoner/eune/Larry777\nA két felhasználó Átlagos Ellenfél Értékelésében az eltérés mindössze két szint (ezüst4, illetve bronz2). Hasonló tudású játékos játszik a fiókokkal.\nA manapság (2019.08.30.) játszott hősök Darius és Lucian mindkettő fiókban. A buildjük is hasonló, trinity-s Darius, rapidrire cannont használó Lucian.  A szinte megegyező buildek származhatnak akár hasonló játékstílusból vagy metaismeretből is, ez sem bizonyíték természetesen, csak újabb hasonlóság. Szintén felbukkan manapság Nasus mindkét fiókban.\nDariuson mindkét fiókban megegyező rúnákat használnak, és ezek a rúnák igen egyediek, pusztán a keystone és a másodlagos rúnaág rúnái az elterjedtek a többi Darius körében.\nA Lucian rúnák között teljes a hasonlóság, bár ez megegyezik a legelterjedtebb, széles körben használt rúnáival.\nA Nasus által használt rúnák szintén megegyeznek, bár ez az összeállítás is széles körben elterjedt. Az elméletnek némileg ellentmond az, hogy a Larry777 által használt, jellegzetes nasus e-t későn kifejlsztő taktikát MAaroninhonál nem találtam meg.\nMAaroninho szívesen, és gyakran használta (FIGYENEM EZ MÁR MAJDNEM EGY ÉVE TÖRTÉNT!) Evelynt, ellenben Larry777 dzsungelbe Xin Zhaot hoz (MANAPSÁG).\nTryndamere felbukkan mindkét fiókban, mint toplaner. Ám MAroninho régen használta, így értékelhetetlen a rúnák összehasonlítása. \nMindkét fiókban a másodlagos ADC Caitlyn, a rúnákban pusztán némi hasonlóság figyelhető meg.\n\nMAaroninho öt napja kezdte újra a játékot a LeagueOfGhraps szerint. Larry777 játékában öt napja állt be egy kissebb (2-3 napos) szünet.\n\nÉn a feltételezést nem tartom egyértelműen eldöntöttnek, akiket érdekel, megtehetik a tétjeiket, és akár saját maguk is leellenőrizhetik a megfigyeléseimet.","replies":[{"poster":"MAaroninho","date":"2019-08-30T09:29:33.760+0000","up_votes":1,"down_votes":5,"body":"Gyerekek, már vége, nem tűnik fel? :D\n\nTopicot nyittok, mintha nem írtam volna már le én magam, hogy a 2 acc-om ugyanaz? Kinél gurulhatott el? XDDD\n\nNem mellesleg, ennyit foglalkozni egy hülyével XD","replies":[{"poster":"Knight Thyme","date":"2019-08-30T15:57:06.289+0000","up_votes":1,"down_votes":0,"body":"Azóta se tudtuk meg, szerinted kik azonosak itt a fórumban. \n\n{{sticker:sg-janna}}","replies":[{"poster":"MAaroninho","date":"2019-08-30T19:01:05.392+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Knight Thyme,realm=EUNE,application-id=VFnq5EbB,discussion-id=qw0I1a8E,comment-id=00000000,timestamp=2019-08-30T15:57:06.289+0000)\n>\n> Azóta se tudtuk meg, szerinted kik azonosak itt a fórumban. \n> \n> {{sticker:sg-janna}}\n\nTe nagyon szeretnéd ezt hallani, vajon miért? XD Hagyjuk már de tényleg, tegnap leírtam neked mindent, mára blockoltál, minek írogatsz még?\n\nGyerekek...NEM ÉREK ENNYIT XD","replies":[{"poster":"Knight Thyme","date":"2019-08-30T20:34:12.292+0000","up_votes":1,"down_votes":0,"body":"_A főnökség megtiltotta, hogy a továbbiakban veled kommunikáljak, látva, hogy megintcsak hazudozol össze-vissza. Úgyhogy további kellemes szalmacséplést kívánok._","replies":[{"poster":"MAaroninho","date":"2019-08-30T20:36:39.529+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Knight Thyme,realm=EUNE,application-id=VFnq5EbB,discussion-id=qw0I1a8E,comment-id=0000000000000000,timestamp=2019-08-30T20:34:12.292+0000)\n>\n> _A főnökség megtiltotta, hogy a továbbiakban veled kommunikáljak, látva, hogy megintcsak hazudozol össze-vissza. Úgyhogy további kellemes szalmacséplést kívánok._\n\nEbben mit hazudtam? XD Édes Istenem, segítsd őket...legalább a szalmacséplésnél jobb beszólásokra :D","replies":[]}]}]}]},{"poster":"Jack Eron","date":"2019-08-30T16:38:42.246+0000","up_votes":1,"down_votes":0,"body":"Annál gurult el, aki saját magát védelmezi, és beszél róla 3. személyként. Ez tény.","replies":[]}]},{"poster":"Jack Eron","date":"2019-08-30T16:39:12.304+0000","up_votes":1,"down_votes":0,"body":"A Riot pénzelt, ugye? Szégyelld magad.","replies":[]}]}