{"poster":"DiamondAries","date":"2016-03-08T11:26:09.846+0000","title":"Where's the logic?!","subforum":"Miscellaneous","up_votes":3,"down_votes":0,"body":"Ok so this might be a bit of a rant, but seriously read and tell me what kind of logic this is.\r\n\r\nSo first, our team line up. (Blue Side)\r\nTop - zed\r\nJungle - Rengar (me)\r\nMid - Ahri\r\nADC - Kog&#039;Maw\r\nSupport - Janna\r\n\r\nEnemy Team (purple)\r\nTop - RIven and Wukong\r\nJungle - Master Yi\r\nMid - Karma\r\n Bot - Jhin\r\n\r\nNow at the start of the game, the usual greeting of &quot;glhf&quot; is exchanged between the players. I notice as I start Red to prep a lvl2 cheese invade that there is a duo top and one bot. I thought &quot;jeez Kog is gonna get so fed.&quot; and kept at it. As it turned out Yi was in my blue, so we took each others blue and nothing much happened. First blood went to Yi after a gank bot on Kog, and I didn&#039;t think much of it as Ahri got Karma mid and Yi didn&#039;t have sated yet. I kept on farming, trying to catch Yi out in his jungle and taking his red before retreating to my blue to hit level 6. It was at this moment that Zed pinged frantically for assistance, so I smited blue to finish it off quicker and instantly ulted heading to top. Zed unfortunately died at tower from Riven ult before I reached lane and Riven retreated off screen. Wukong however was finishing the minion wave and so I jumped on him and got a kill. Afterwards, the Zed started flaming me for no apparent reason, and said he was leaving lane. This was at about 9:00 in the game. So basically from that point on, Zed dawdled in the jungle for 3 minutes and settled on taking our wolf camp, before backing and returning to lane with Janna, only to leave after a minute and I basically was stuck trying to stop a snowballing Riven and Wukong from taking our turrets with a Janna. With the help of Ahri, we did manage to get them and push top a bit, but Zed continued to frolic in our jungle taking creeps. \r\n\r\nFast forward to 18:00. Zed starts digging at me for losing top lane (they had taken outer and inner turret) even though he was the one who left lane for 8 minutes letting Riven and Wukong just push. Then Kog&#039;Maw started joining in and was flaming me for being unskilled, for losing top, and all this other random stuff. Like, why is it that as soon as something goes wrong &quot;aw its the junglers fault that zed left lane and gave a free lane for the last 8 minutes&quot; like wtf! Then Ahri joined in saying I should have camped top. (have you even played rengar before? You cant just camp a lane before 6 or before being fed. His damage is all single target burst and id get screwed by riven if i went anywhere near that lane). Like, I admit that I wasn&#039;t exactly a pro that game, but i just dont get why everyone was flaming me losing top when Zed gave a free lane by leaving.","replies":[{"poster":"Omni Presents","date":"2016-03-08T11:33:49.910+0000","up_votes":3,"down_votes":0,"body":"Looking at your account that you are logged in as, you have a total of 7 games since 24/01 for 5 loses, all ranked, that tells me your main would most likely be... bronze.\n\nYou want the truth, something I have religiously been saying since the start of S6?\n\nIt is simple, you are at the ass end of ranked, that is all there is too it. One thing goes wrong and they have to blame someone. Firstly, what is a Zed going top for anyway? That is a gimmick you use for fun, if you do that you should expect the lose unless they go something squishy.\n\nSo, for me to correctly check your game and tell you exactly what happened and why, you need to tell me your mains account name, or just link the game.","replies":[{"poster":"DiamondAries","date":"2016-03-09T09:30:55.077+0000","up_votes":1,"down_votes":0,"body":"It was a normal game. The game statistics you saw are my ranked statistics, as I have only played 7/10 placement games and unfortunatly have lost the last 5. They still keep putting me in gold and diamond games though which sucks :/","replies":[{"poster":"Omni Presents","date":"2016-03-11T09:33:20.371+0000","up_votes":1,"down_votes":0,"body":"Umm, no. There was like 7 games TOTAL on your account, I saw nothing else on there, therefore you must have been using another account.\n\nLink us the game.","replies":[{"poster":"DiamondAries","date":"2016-03-11T12:30:27.857+0000","up_votes":1,"down_votes":0,"body":"Probably because you are not my friend in-game, so it shows only my ranked games? idk, but i have over 200 wins in norms on this account and 300+ in bots\n\nhttp://matchhistory.oce.leagueoflegends.com/en/#match-details/OC1/124744053/201181721?tab=overview","replies":[]}]}]}]},{"poster":"JasonWazza","date":"2016-03-09T12:26:46.029+0000","up_votes":1,"down_votes":0,"body":"Welcome to league of asshole premades.\n\nThis is basically why dynamic queue sucks, because you get these same sort of people that blame the scapegoat, but seriously it has nothing to do with you being the jungler, it has to do with you not being in their premade.","replies":[{"poster":"DiamondAries","date":"2016-03-11T12:31:47.971+0000","up_votes":1,"down_votes":0,"body":"Probably. Kinda sad. Even in the premades I'm in I call them out if they're being stupid.","replies":[]}]},{"poster":"Yasei Doubutsu","date":"2016-03-08T11:59:09.555+0000","up_votes":1,"down_votes":0,"body":"Zed top was a stupid thing, you should have camped mid or bot as they had no jungler or support.\n\nWhen people lose this hard they will look for a way out becuase. \"It cant be my fault I lost lane\" -Zed.\nSince Kog joined in, you either did something to upset him. Or they were a duo.\n\nBronze has no logic.\n\nYou just gotta work on your decision making and practicing more.","replies":[{"poster":"DiamondAries","date":"2016-03-09T09:35:13.379+0000","up_votes":1,"down_votes":0,"body":"And I aim to get better every day. Usually I watch my replays on replay.gg if i get a chance to see what I did wrong and what an enemy did to get an advantage over me. \n\nHonestly I'm not putting hate or flaming. I'm just asking if anyone else saw the logic of them flaming me over the zed free top lane.","replies":[{"poster":"Yasei Doubutsu","date":"2016-03-09T09:52:00.394+0000","up_votes":1,"down_votes":0,"body":"People flame all teh time as an escape.\n\"Why am I loosing?\" then they find the first thing they think is stupid.","replies":[]}]}]},{"poster":"SorakaXHealBoT","date":"2016-03-08T20:40:13.163+0000","up_votes":1,"down_votes":0,"body":"Just checked your op.gg and found the normal game in which u played rengar. I would say you should just ignore all three of them and just  farmed up and try to carry the game and gank wherever you want whenever your ult is up and there is an easy target somewhere for you to kill.","replies":[{"poster":"DiamondAries","date":"2016-03-09T09:32:54.033+0000","up_votes":1,"down_votes":0,"body":"Thats what I tried to do. Looking back I should have just gone top to at least stop the waves pushing. Rengar on my admittance is actually my first \"carry\" champ I am learning to play. I am much more comfortable and familiar with tanks.","replies":[]}]}]}