{"poster":"Eulensohn","date":"2018-06-24T10:55:22.176+0000","title":"Voicechat","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hi,\r\n\r\neine Frage wegen dem Voicechat...ich stelle das gerne auf pushtotalk, allerdings muss ich das jedes Mal neu einstellen, wenn ich einlogge. Wieso geht das nicht dauerhaft?\r\n\r\nDas andere Problem ist: ich h&auml;tte gerne shift als Taste gew&auml;hlt, aber es geht nicht. Generell geht der ganze linke Tastenrand nicht als Taste f&uuml;r ptt.\r\n\r\nWei&szlig; da jemand weiter?\r\n\r\nMfG","replies":[{"poster":"AI Yjuq","date":"2018-06-24T11:53:41.703+0000","up_votes":1,"down_votes":0,"body":"Hi, zuerst einmal unbinde (oder ändere) sämtliche Aktionen, welche die Shift Taste nutzen. Das kannst du normal über die Einstellungen machen. (Lass den Client geöffnet bei den nächsten Schritten - Und bleib eingeloggt!) Danach gehst du in deinen \"Config\" Ordner von Riot Games. Das müsste normalerweise unter den Dateipfad \"C:\\Riot Games\\League of Legends\\Config\" zu finden sein. Dort befindet sich die Datei \"LCUAccountPreferences.yaml\". Öffne diese mit einen ASCII Editor deiner Wahl (sowas wie Notepad).\n\nEs ist zu empfehlen vorab eine Sicherheitskopie dieser Datei anzulegen. Am besten dort, wo du sie wiederfindest falls etwas schief geht. Damit du deine Einstellungen nicht verlierst. Am besten gleich der ganze Config Ordner.\n\nSuche nach folgenden Block:\n> lol-premade-voice:\n    data:\n        autoJoin: false\n        inputMode: \"voiceActivity\"\n        muteOnConnect: false\n        pushToTalkKey: \"[<Unbound>]\"\n        showFirstExperienceInGame: false\n        showFirstExperienceInLCU: false\n    schemaVersion: 1\n\n!! WICHTIG !! LÖSCHE KEINE LEERZEICHEN AM ANFANG EINER ZEILE - Das *.yaml Format arbeitet mit den Leerzeichen!\n\ndort siehst du schon den > pushToTalkKey: \"[<Unbound>]\" < welchen wir nur noch auf eine Taste deiner Wahl setzen müssen. Ersetze dies durch:\npushToTalkKey: \"[Shift]\"\n\nsowie > inputMode: \"voiceActivity\" < in\ninputMode: \"pushToTalk\"\n\nSpeichere die Datei anschließend ab. Nun starte in dem LoL-Client einmal ein Custom Game (practice mode reicht auch) und damit sind die Einstellungen fest geschrieben. Über die Shift Taste müsste sich nun PushToTalk verwenden lassen.\n\nSollte es zu Problemen kommen, melde dich bitte bei mir!","replies":[]}]}