{"poster":"Olee","date":"2014-12-09T22:49:55.320+0000","title":"Three questions about three midlaners","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":0,"body":"1. Who counters Leblanc?\r\n2. What do you max second on Syndra after Q?\r\n3. Does Fizz's ult collide with minions or just champions?\r\n\r\nty","replies":[{"poster":"PervySage79","date":"2014-12-11T05:43:03.809+0000","up_votes":1,"down_votes":0,"body":"I find this really useful for champion counter information:  http://www.lolcounter.com/","replies":[]},{"poster":"P1 GTR","date":"2014-12-10T11:41:07.621+0000","up_votes":1,"down_votes":0,"body":"1. Probs Fizz\n2. E\n3. Just champions, however where your cursor is, is where your ult goes.","replies":[]},{"poster":"Lauricella3","date":"2014-12-10T11:23:46.047+0000","up_votes":1,"down_votes":0,"body":"ill tell you who counters leblanc mid GAREN. im being serious leblanc can't kill garen and can't snowball, if leblanc roams garen can push hard and take the tower. and if the garen player has fast reactions you can silence her mid w to prevent her returning and just spin to win.","replies":[]},{"poster":"KidneyxThief","date":"2014-12-10T11:18:21.426+0000","up_votes":1,"down_votes":0,"body":"Try Galio vs Fizz.\n\nI find it to be very effective.","replies":[]},{"poster":"Olee","date":"2014-12-10T00:53:56.072+0000","up_votes":1,"down_votes":0,"body":"1. Yeah I was thinking Lissandra, will give it a go\n2. Yeah I don't know, they're both very good options\n3. Thanks!","replies":[{"poster":"Your Neighbour","date":"2014-12-10T07:49:42.854+0000","up_votes":1,"down_votes":0,"body":"Q best choice on Lissandra, W cooldown too long.\n\nhttp://matchhistory.oce.leagueoflegends.com/en/#match-details/OC1/70524581/200514951?tab=overview\n\nW and E are enough for disengage, no need to max W early, if you want to go for the kill hide, E in dunk R, Q, walk closer dunk R then another Q, if they don't die ignite them.\n\nAnd to kill LB you need to watch her wrap point, and if you want to know which one is the real LB, ping on her before damaging her and when the clones split, the real one will carry the mark.","replies":[]}]},{"poster":"BarryButcher","date":"2014-12-10T02:08:07.532+0000","up_votes":1,"down_votes":0,"body":"fizz, talon and zed can do well against Le Blanc.\nPeople who can use an ability to dodge her damage then gap close on her and blow her up while her spells are on cooldown.\n\nI prefer to max stun 2nd always. Its not only an engage, but a disengage when ganked, so its important to keep it on a low cd.","replies":[]},{"poster":"RNG Remilia","date":"2014-12-09T23:34:27.072+0000","up_votes":1,"down_votes":0,"body":"1. People who can push hard forcing her to farm under tower or have enough lockdown CC to 100 to 0 burst her like Liss and Syndra.\n2. Depends on your playstyle, W for stronger poke and E for shorter CD stun for setting up ganks, going all in and a disengage.\n3. Just Champs.","replies":[]}]}