{"poster":"Olee","date":"2015-11-10T10:46:17.542+0000","title":"Which Mid Laners do you think will be the strongest in Season 6?","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"??\n\nEDIT: After reading up on a little bit of Season 6, I think mid lane is gonna be back into a mage meta super hard and tank killing mid laners like Azir and Cass will shine. Xerath may also be a strong counter to the new Kog'Maw and depending on what they did to the crit items, I really feel like everyone's least favourite 937302740398% play rate wind using Samurai will be extremely strong.","replies":[{"poster":"Knuuckles","date":"2015-11-11T03:03:49.933+0000","up_votes":1,"down_votes":0,"body":"will definitely be control mages again but assassin/split pushers like zed/talon/yas will always be strong if used properly but i do agree with you, cc long ranged mages will be back in full swing like azir, xerath, lux, kog, brand, karthus, ori etc but with the new starting items it will bring a much more diverse mid lane, bringing more early game skirmishers like leblanc viktor liss and kat, im looking forward to this season its definitely one of the most non meta seasons ive seen in a while","replies":[{"poster":"Olee","date":"2015-11-11T04:34:30.563+0000","up_votes":1,"down_votes":0,"body":"Ok, I've read up over everything and honestly? I don't know. Tank killing mid laners will be important coz of one of the keystone masteries for tanks almost forces you to focus the tank because otherwise you're losing DPS (the one with stone in it's name).\n\nAP Assassins will have a great early start due to Dark Seal and not to mention Carry killing is so much more important now due to the AD's being ridiculoussssss. Not to mention the Lich Bane buffs are great for Fizz/Viktor/Kassadin\n\nAD Assassins will be great because they too benefit from the new AD items. Zed and Talon will be fucking crazy with the new Ghostblade and Death's Dance, as well as Cleaver getting a buff and just SO many other options. While Yasuo I think MUST go Phantom Dancer now, the item outclasses Shiv by a FUCKTONNE and it makes his 1v1 potential broken as anything.\n\nCC/AOE Control mages will still be good because they always are, reliable as fuck.\n\nSo I don't know, is everything viable?","replies":[]}]},{"poster":"Roguestoney","date":"2015-11-11T03:12:58.349+0000","up_votes":1,"down_votes":0,"body":"Urgot.","replies":[]},{"poster":"BlitzForever","date":"2015-11-10T21:19:27.966+0000","up_votes":1,"down_votes":0,"body":"Diffinatly John Cena","replies":[]},{"poster":"Tele","date":"2015-11-10T11:03:55.917+0000","up_votes":1,"down_votes":0,"body":"Assassins in general. Mainly AP I think though, stuff like Fizz, LeBlanc and Katarina.","replies":[{"poster":"Olee","date":"2015-11-10T14:50:49.683+0000","up_votes":1,"down_votes":0,"body":"I thought so too because AD's are gonna be so goddamn strong but Season 6 is just a big fuck you to Assassins dude. Phantom Dancer and Death's Dance give ADC's so much resistance against burst, and there's a keystone mastery that lets a champion soak up 8% of damage that his nearby allies take","replies":[]}]}]}