{"poster":"Olee","date":"2015-04-15T00:47:44.318+0000","title":"How behind the meta is my champion pool lel","subforum":"Miscellaneous","up_votes":2,"down_votes":0,"body":"ATM\r\n\r\nTop- Irelia and Cho (Semi AP Tank Cho)\r\n\r\nJungle- Vi, Sej and J4\r\n\r\nMid- Ahri, Lissandra, Orianna, Talon and Zed (Kayle, Fizz and Syndra are still 150% comfortable champions for me and can play at a moment&#039;s notice, they just aren&#039;t great atm)\r\n\r\nADC- Sivir and Jinx\r\n\r\nSupport- Thresh, Morgana and Nami\r\n\r\nHow strong are Viktor, Diana, Hecarim and Urgot atm? And are they MUST learns?","replies":[{"poster":"Sackboy","date":"2015-04-15T05:25:12.055+0000","up_votes":2,"down_votes":1,"body":"I see you play freelosandra.","replies":[{"poster":"Olee","date":"2015-04-15T06:09:10.253+0000","up_votes":1,"down_votes":1,"body":"Well her already low damage was already nerfed and plus long range just completely shuts Lissandra down.","replies":[{"poster":"Unseen Predator","date":"2015-04-16T04:26:23.114+0000","up_votes":1,"down_votes":0,"body":"> Well her already low damage\n\nWhat?","replies":[{"poster":"Olee","date":"2015-04-16T05:45:12.813+0000","up_votes":1,"down_votes":1,"body":"Lissandra is not at ALL a high damage mage. She is a CC control mage. I've played a crapload of games on Lissandra this season and also on Ahri, Syndra, Zed, Talon and Orianna. She IS low damage. In the late game she deals good aoe damage. But no where near what other AP Mid laners deal","replies":[{"poster":"JasonWazza","date":"2015-04-16T14:23:54.519+0000","up_votes":1,"down_votes":0,"body":"Do you not build AP on Lissandra or something?\n\nAlso\n\n>How strong are Viktor, Diana, Hecarim and Urgot atm? And are they MUST learns?\n\nWhy this specific list of champions?\n\nDoes no one use lolkings statistics for champions page?","replies":[{"poster":"Olee","date":"2015-04-17T02:17:41.011+0000","up_votes":1,"down_votes":0,"body":"I actually go full damage Lissandra too lol..\n\n\nand those are just some champions i've versed a lot of lately, and they literally wreck every game","replies":[{"poster":"JasonWazza","date":"2015-04-17T03:09:53.618+0000","up_votes":1,"down_votes":0,"body":"You have played against 2 urgots in the last 2 weeks, and they both sucked ass (12/16/8 and 7/11/12) the mana scaling on his shield isn't as big a buff as people think it is.\n\nDiana is in a decent spot right now, if your just half competent enough to hit a skill shot, because no one in bronze can dodge a straight line skill shot, let alone one that curves.\n\nViktor is in a mediocre spot the only benefit he has is AoE damage and CC, and other champs do that so much better.\n\nAnd the pony took a nerf to take him out of FoTM and basically brings him back down to \"you have to be a decent hecarim to win games.\"","replies":[]}]}]}]}]}]}]},{"poster":"WEETBIX 4 BREKKI","date":"2015-04-19T03:44:36.704+0000","up_votes":1,"down_votes":0,"body":"who actually plays more than 1 champion?","replies":[]},{"poster":"Klavinmour","date":"2015-04-15T02:44:33.285+0000","up_votes":1,"down_votes":0,"body":"Urgot is a late game beast, but only if he can get to the late game.\nEarly on though he is a lane bully, but typically not until he gets his tear.\n\nI'll typically take Urgot against AD champs, since you buy a fair bit of armour on him early. (I'll typically get {{item:3025}} {{item:3110}} )\n\nHis passive reduces the enemy's damage out put by 15% for a few seconds after they've been hit by an AA or ability. Combine this with his ult that gives 120 Armour and Magic Resist he ends up very tanky.\nMy complete build looks like this most of the time {{item:3042}} {{item:3071}} {{item:3025}} {{item:3110}} {{item:3009}}  with the final item being situational.\nYou end up with about 300 AD, lots of armour pen via armour shred of BC and E, stupid amounts of resists from items and ult, and a shield from W that lasts for days.\n\nI find I will only struggle in lane against AP champs, or the occasional Riven who decides they want to get that level 2 tower dive. (But they quickly learn they can't tower dive you post level 6)","replies":[{"poster":"Urgot Bot","date":"2015-04-16T07:58:36.426+0000","up_votes":1,"down_votes":0,"body":"- Urgot\n- Late game\nYou high?\n\nJokes aside, I find he's much better early - mid game, where he can almost 1v1 anyone and come out on top. Once he has 3 points into his q, his acid hunters start the really hurt.\n\nLate game with the fully stacked Muramana does give him amazing damage, but the fact that there are much stronger late game champs (Yasuo, Vayne, Rengar, etc.) sorta shuts him out of late unless he can catch someone out with his huge ult range. He turns into a really good debuffer for late game with his huge amounts of AoE armour shred and damage reduction.\n\nAlso, I find that Urgot dominates most AP midlaners (except Leblanc, screw you LB) due to the sheer power that his acid hunters bring. I find that at about level 5 one e and 3 q's will usually force the enemy AP to back, or at least half health them. If they got hit by one more rotation they would probably die. He definitely does well against AD as well.","replies":[]},{"poster":"Olee","date":"2015-04-15T05:19:47.906+0000","up_votes":1,"down_votes":0,"body":"Hmmm I'll have to learn him for killing tanks","replies":[]}]},{"poster":"DarkShade918","date":"2015-04-15T01:47:28.393+0000","up_votes":1,"down_votes":0,"body":"Diana and Viktor are retardedly OP as is hec, (idk much about urgot) i wouldn't say must learn but i would say must play your champ pool seems normal and in META but tbh the META is gay and i don't follow it","replies":[{"poster":"Olee","date":"2015-04-15T01:59:12.291+0000","up_votes":1,"down_votes":0,"body":"Yeah I've been thinking that about Diana and Viktor for a while. I have Diana and can play her, although I will definitely put in more practice into her as for Viktor, I gotta start from the ground up with him.","replies":[]}]}]}