{"poster":"Frost09","date":"2015-03-19T07:41:43.729+0000","title":"LFM","subforum":"Team Recruitment","up_votes":2,"down_votes":0,"body":"HELLO fellow summonses, I'm frost currently low gold but looking to get back to plat this weekend, though I'm going to climb the ladder in solo queue I really don't enjoy it. Every division is crude they're all mean and horrible to witness. I don't usually get flamed at because I'm extremely passive if I'm behind a bit and won't start feeding but I mean these team members are so nasty to each other and I have to always witness it. And I mean they're people in their mid 20's that play this game and act like they're 12 and I have a little brother who is 13 and he has like 6 of his mates that play lol we're not all 16+ so why are you guys so horrid? Anyway moving on this is why I want to start a ranked team because I can't stand solo queue anymore I main ADC but any other role that you guys play just pop down a few thing. Usually I would put down like what's ur Skype or what's ur ign in a line but I think we're all old enough to put our own details down and you can just say ur ign if you want or you can out a load of stuff like when ur available and stuff anyone I'm going to go because otherwise this will turn into a very big discussion board. \r\n\r\nP.s my brothers not bronze 5 his actually plat 2 :P","replies":[{"poster":"EMP Implosion","date":"2015-03-20T07:08:20.735+0000","up_votes":1,"down_votes":0,"body":"IGN: Wolves \n\nAnything apart from mid, kinda havent played mid in a long time","replies":[]},{"poster":"ShinySoulStar","date":"2015-03-19T09:46:33.213+0000","up_votes":1,"down_votes":0,"body":"hey there i prefer playing mid and jungle\ni am on pretty much anytime and im currently gold 4\n\nIGN: ShinySoulStar","replies":[]},{"poster":"J1R3H","date":"2015-03-19T09:37:51.928+0000","up_votes":1,"down_votes":0,"body":"hey, \ni can do most role but i prefer playing tank/bruisers \ntop and jungler.\n\njust add me on league and i will give you more details if you are interested.","replies":[]},{"poster":"vBulldogz","date":"2015-03-19T09:30:35.003+0000","up_votes":1,"down_votes":0,"body":"Hay \nIGN -vbulldogz\nPrefs- mid jungle adc \nreally keen to enhance my gaming with a team :) \ncheers,","replies":[]}]}