{"poster":"sono prolisso","date":"2018-08-28T09:47:50.871+0000","title":"Problema di ping Telecom","subforum":"Aiuto e supporto","up_votes":2,"down_votes":2,"body":"Nelle ultime due settimane il mio ping in game &egrave; diventato instabile e ho dovuto smettere di giocare, ho una connessione 30 mega con la Telecom Fibra/rame&hellip; non mi ha mai dato problemi; ho sempre avuto un 47 fisso sul ping all&#039;incirca, ora &egrave; ingiocabile per me lol.","replies":[{"poster":"beppedessi","date":"2018-08-28T10:07:58.008+0000","up_votes":1,"down_votes":0,"body":"La domanda forse é scontata ma te la faccio comunque: hai cambiato qualcosa nel steup nelle ultime due settimane? E hai già provato a pingare il tuo router?","replies":[{"poster":"sono prolisso","date":"2018-08-28T10:20:26.525+0000","up_votes":1,"down_votes":0,"body":"ok, ti riscrivo perché sono riuscito a pingare il mio router; nessun packet loss e nessun tipo di problema… per quanto riguarda il setup, non ho cambiato nulla, ad un certo punto ho avuto questo problema per 2 giorni, poi ho provato a staccare e riattaccare il modem e basta, ha continuato per la sua strada diciamo","replies":[{"poster":"beppedessi","date":"2018-08-28T10:42:18.587+0000","up_votes":1,"down_votes":0,"body":"Il fatto che tra te ed il tuo router ci sia un collegamento stabile rende la possibilità che sia il tuo computer ad avere un problema perlomeno remota. A questo punto quello che ti posso consigliare di fare é un traceroute verso il server EUW di lol, che ha indirizzo IP 104.160.141.3 In questa maniera é possibile capire a che snodo della rete si presenta il problema. Magari fanne più di uno per avere un risultato più preciso.","replies":[{"poster":"sono prolisso","date":"2018-08-28T10:46:43.461+0000","up_votes":1,"down_votes":0,"body":"Comunque non ho questo problema solo su Lol, durante qualsiasi gioco è come se avessi una perdita bo","replies":[{"poster":"beppedessi","date":"2018-08-28T10:50:06.946+0000","up_votes":1,"down_votes":0,"body":"Capisco. Tu comunque la prova falla, tanto ci vogliono 5 minuti! Magari ne esce fuori qualcosa che ti può aiutare o che può aiutare i tecnici Telecom.","replies":[{"poster":"sono prolisso","date":"2018-08-28T10:55:34.612+0000","up_votes":1,"down_votes":0,"body":"ok il traceroute invece lo sto facendo, ma non ci capisco nulla, come va letto","replies":[{"poster":"beppedessi","date":"2018-08-28T11:30:10.349+0000","up_votes":1,"down_votes":0,"body":"Se vuoi postalo qui oscurando gli indirizzi IP","replies":[{"poster":"sono prolisso","date":"2018-08-28T11:44:11.154+0000","up_votes":1,"down_votes":0,"body":"Traccia instradamento verso 104.160.141.3 su un massimo di 30 punti di passaggio\n\n  1     2 ms    <1 ms    <1 ms  modemtim.homenet.telecomitalia.it \n  2     *        *        *     Richiesta scaduta.\n  3     8 ms     9 ms    10 ms  \n  4     8 ms    10 ms    12 ms  \n  5    17 ms    17 ms    14 ms  \n  6    14 ms    13 ms    13 ms  \n  7     *       25 ms    25 ms  \n  8    24 ms    25 ms    28 ms  etrunk49.milano1.mil.seabone.net \n  9    25 ms    25 ms    25 ms  ae11.milano58.mil.seabone.net \n 10     *       25 ms    25 ms  lag-10.bear1.Milan2.Level3.net \n 11     *        *        *     Richiesta scaduta.\n 12    41 ms    42 ms    41 ms \n 13    41 ms    40 ms    40 ms","replies":[{"poster":"beppedessi","date":"2018-08-28T13:15:18.519+0000","up_votes":1,"down_votes":0,"body":"Da questo mi sembra che per il momento il problema non si presenti. Potresti provare a rifarlo nel momento in cui si ripresenta il problema.","replies":[{"poster":"sono prolisso","date":"2018-08-28T13:33:05.488+0000","up_votes":1,"down_votes":0,"body":"eh difficile che riesca mentre ho il problema, si tratta di 1/2 secondi in game ogni 1/2 minuti in cui vedo il ping arrivare a 800","replies":[{"poster":"beppedessi","date":"2018-08-28T14:41:43.316+0000","up_votes":1,"down_votes":0,"body":"Allora adesso ti chiedo un'altra cosa un po' più complicata che però può servire ad isolare il problema. Prova a fare un avvio pulito di windows seguendo [questa guida](https://support.microsoft.com/it-it/help/929135/how-to-perform-a-clean-boot-in-windows) ed una volta riavviato il computer riprova ad eseguire dei traceroute per controllare se il problema continua a presentarsi. Mi raccomando: come specificato della guida ufficiale controlla che i servizi di sistema **SIANO ABILITATI** prima di riavviare il computer. Questa operazione serve ad escludere che si verifichino dei conflitti tra software che interagiscano con il client rendendo il ping instabile. Nella guida è spiegato anche come riavviare il PC riportandolo alla normalità alla fine del test. Mi raccomando leggile per interno prima di cominciare l'operazione.","replies":[{"poster":"sono prolisso","date":"2018-08-28T21:35:33.161+0000","up_votes":1,"down_votes":0,"body":"adesso mi metto a leggere tutto! grazie mille per l'aiuto e il tempo che mi hai dato","replies":[{"poster":"beppedessi","date":"2018-08-28T21:42:10.393+0000","up_votes":1,"down_votes":0,"body":"Figurati! Non so se riuscirò ad aiutarti a sufficienza da risolvere il problema ma almeno ci abbiamo provato!","replies":[{"poster":"sono prolisso","date":"2018-08-29T00:19:35.497+0000","up_votes":1,"down_votes":0,"body":"Ho fatto tutto quello che ero in grado di fare seguendo i passaggi con la massima accuratezza ma purtroppo non sono riuscito ad individuare il problema, non mi è sembrato che uno dei servizi cambiasse qualcosa ... va bene dai ci abbiamo provato! Forse mi è sfuggito comunque qualcosa... e se reinizializzassi direttamente il computer andando a riscaricare i programmi potrei avere possibilità di risolvere il problema?","replies":[]}]}]}]}]},{"poster":"sono prolisso","date":"2018-08-28T13:43:11.515+0000","up_votes":1,"down_votes":0,"body":"e invece ce l'ho fatta, qui si vede\nTraccia instradamento verso 104.160.141.3 su un massimo di 30 punti di passaggio\n\n  1     3 ms    <1 ms    <1 ms  modemtim.homenet.telecomitalia.it \n  2     *        *        *     Richiesta scaduta.\n  3    18 ms    23 ms    17 ms  \n  4    11 ms    10 ms    10 ms \n  5    10 ms    11 ms    10 ms  \n  6     *       11 ms    10 ms  \n  7     *        *        *     Richiesta scaduta.\n  8    30 ms     *       22 ms  etrunk49.milano1.mil.seabone.net \n  9    22 ms    23 ms    22 ms  ae11.milano58.mil.seabone.net \n 10     *        *        *     Richiesta scaduta.\n 11     *        *    ** 2345** ms  ae-1-3101.ear3.Amsterdam1.Level3.net \n 12    36 ms    36 ms    47 ms \n 13    36 ms    36 ms    36 ms","replies":[]}]}]}]},{"poster":"beppedessi","date":"2018-08-28T11:06:50.258+0000","up_votes":1,"down_votes":0,"body":"É molto semplice: stai pingando una serie di \"nodi\" che sono indicati con un elenco puntato sulla sinistra; per ogni nodo vengono effettuati tre prove di ping prima di passare al nodo successivo; siccome si parte col pingare i nodi più vicini a te il ping andrà lentamente ad aumentare. Ora il nostro scopo é individuare a quale nodo cominci ad avere dei problemi.","replies":[{"poster":"sono prolisso","date":"2018-08-28T11:29:50.103+0000","up_votes":1,"down_votes":0,"body":"Mi piacerebbe mandarti lo screenshot ma non penso si possa fare, comunque ci sono vari problemi mi sembra","replies":[]}]}]}]}]},{"poster":"sono prolisso","date":"2018-08-28T10:51:45.615+0000","up_votes":1,"down_votes":0,"body":"Pingo 40 fisso ma a volta fa 48 50","replies":[]}]}]},{"poster":"sono prolisso","date":"2018-08-28T10:09:23.174+0000","up_votes":1,"down_votes":0,"body":"No, non è scontato perché sono abbastanza ignorante e incapace in questo tipo di cose","replies":[]}]},{"poster":"dragonskiller49","date":"2018-08-28T09:56:18.352+0000","up_votes":1,"down_votes":0,"body":"Chiama il tecnico (ho TIM e gioco a 35/37 fisso)","replies":[{"poster":"sono prolisso","date":"2018-08-28T09:57:32.811+0000","up_votes":1,"down_votes":0,"body":"Io ho provato a chiamare l'assistenza e non mi hanno risolto nulla… dovrei secondo te chiamare un tecnico e pagarlo o cos'altro","replies":[]}]}]}