{"poster":"Doseqis","date":"2017-06-01T05:19:46.323+0000","title":"@Riot Meddler Any plans on Dorans Ring Changes to prevent stacking","subforum":"Gameplay","up_votes":3,"down_votes":3,"body":"Feels pretty awful when tanks have kill pressure while also having a CC lock, Take Galio for instance his waveclear is insane but comes with the tradeoff of spamming it costing a ton of mana early but 2-3 dorans rings negates this tradeoff and even lets Galio burst enemies in the laning phase.\r\n\r\nThe item just feels too cost efficient for it&#039;s stats comparatively to other starters and as such lets someone who was behind have better stats than someone who invested in item components, now i&#039;m not saying this should be outright removed but i feel like Dorans items shouldn&#039;t sell as well as they do someone who opted for this early game pressure can just as easily sell off one to two of them and only be down 480 gold.\r\n\r\nAnother option is to cut down the mana Regen or AP since champions who are buying these are able to clear waves and still easily contest someone ahead of them with the all in power of stacking dorans.\r\n\r\nI don&#039;t really have a problem with mages stacking this item as assassins in the mid lane are countered by this stratgy but now that they have banchee&#039;s veil as a great anti ap assassin item they don&#039;t need to rely on dorans stacking as much.  I mind tanks abusing this though, there is no way a tank who messed up and died early should be able to bully as hard as they can with 2-3 dorans.","replies":[{"poster":"Meddler","date":"2017-06-02T01:40:09.683+0000","up_votes":11,"down_votes":4,"body":"We're looking at making the mana on kill unique. Stacking DRings is something we want to be an option in some cases at least, suspect we need a bit more trade off than there currently is though.","replies":[{"poster":"FeelsCampedMan","date":"2017-06-02T01:49:30.243+0000","up_votes":18,"down_votes":0,"body":"How about allowing them to stack only up to 2 of them?\nIt's a pretty standard build for midlaners who don't want to rush a mana item but still want some early mana sustain, and I don't think they need that taken away because some top lane tanks are abusing triple d ring","replies":[]},{"poster":"Raxistaicho","date":"2017-06-02T04:21:08.943+0000","up_votes":11,"down_votes":1,"body":"That punishes mages when it was tanks abusing them, that's not fair for mage players!\n\nIf you go through with this then having to pick up an early armguard pretty well screws your lane since you won't be able to keep up with mana sustain against ad mids!\n\nTanks will just go back to ordinary starts and builds, but now mages get a perfectly fair and non-abusive early build wrecked just because somebody else was misusing it!","replies":[]},{"poster":"Chønklord","date":"2017-06-02T03:30:11.006+0000","up_votes":9,"down_votes":0,"body":"Maybe I'm missing something crucial but, _why is stacking D.Rings such a big issue/problem_?\n\nIt helps weak laning champs / players that are behind, invest in some early mana/hp regen/ap/hp, but it will still set them back in terms of mid to late game builds if they stack 3 or more. They're not exactly cheap (and not exactly expensive, either).\n\nThis reminds me of Singed players basically having to stack dark seals early in order to survive most matchups.\n\nIs there some extreme isolated abuse case with D.Rings that I'm not fully aware of?","replies":[{"poster":"Anth895","date":"2017-06-02T03:58:03.267+0000","up_votes":3,"down_votes":1,"body":"Galio and Gragas have a ton of mana sustain with the triple Dorans rings. Enough to just spam their aoe Qs and clear waves removing what is supposed to be a weakness for them.","replies":[{"poster":"oldkingcoal","date":"2017-06-02T07:26:31.884+0000","up_votes":10,"down_votes":1,"body":"then you nerf galio and gragas wave clear against minions you dont crap on every weak laning phase mage in the game for the sake of dismal balancing. this is a bad change.","replies":[{"poster":"SweedishGunner","date":"2017-06-02T15:55:46.016+0000","up_votes":5,"down_votes":0,"body":"Yeah I basically rush double Dorans rings on any midlaner unless I'm really far ahead. This is the usual stuff of one class suffering because another class abuses X.","replies":[]},{"poster":"Sohleks","date":"2017-06-02T19:07:37.441+0000","up_votes":1,"down_votes":1,"body":"I do agree that Galio and Gragas both need nerfs relative to other tanks.\n\nBut I also think regardless of what top lane ap tank is on top top lane atm DRings overshadow any other options there could be.\n\nThis is probably just the right change though if multiple DRings is still usable. Probably not ideal compared to upgrading potion or grabbing dark seals and health items.\n\nI'm also of the thought regular tank item build pieces and some support items should be more competitive for laning","replies":[]}]}]}]},{"poster":"ShadowParker","date":"2017-06-02T03:22:25.981+0000","up_votes":4,"down_votes":0,"body":"Please don't make that unique. As someone has said, it allows a Midlaner to bypass rushing a mana item and instead opt for a damage item by buying  2 dorans rings. (If they're good at farming of course)","replies":[]},{"poster":"Elena Siegman","date":"2017-06-02T03:36:23.138+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=qqHIREtH,comment-id=0000,timestamp=2017-06-02T01:40:09.683+0000)\n>\n> We&#x27;re looking at making the mana on kill unique. Stacking DRings is something we want to be an option in some cases at least, suspect we need a bit more trade off than there currently is though.\n\nI'd say its more of a Galio problem than a DRing problem.","replies":[]},{"poster":"Coach Mystogan","date":"2017-06-04T08:53:46.269+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=qqHIREtH,comment-id=0000,timestamp=2017-06-02T01:40:09.683+0000)\n>\n> We&#x27;re looking at making the mana on kill unique. Stacking DRings is something we want to be an option in some cases at least, suspect we need a bit more trade off than there currently is though.\n\nCan you please stop nerfing chogath and everything that makes him viable? ty","replies":[{"poster":"InternalBleating","date":"2017-06-20T15:42:45.062+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Coach Mystogan,realm=NA,application-id=3ErqAdtq,discussion-id=qqHIREtH,comment-id=0000000e,timestamp=2017-06-04T08:53:46.269+0000)\n>\n> Can you please stop nerfing chogath and everything that makes him viable? ty\n\nI was just saying the same thing. They compeltely ruined Chogath with this patch.\n\nMy main is fucking dead.","replies":[]}]},{"poster":"NineTailedMystic","date":"2017-06-03T02:17:31.218+0000","up_votes":2,"down_votes":0,"body":"I can't see why I'd ever buy more than one Doran's if the Mana return is unique.","replies":[]},{"poster":"Lord Parasit","date":"2017-06-02T04:17:22.371+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=qqHIREtH,comment-id=0000,timestamp=2017-06-02T01:40:09.683+0000)\n>\n> We&#x27;re looking at making the mana on kill unique. Stacking DRings is something we want to be an option in some cases at least, suspect we need a bit more trade off than there currently is though.\n\nshould just but the rumble q treatment on galio q gragas q nautilus e and make it all do less dmg to minions would also give more incentive to build the sunfire now that its only usefull against minions","replies":[{"poster":"VoraciousX","date":"2017-06-02T04:21:42.845+0000","up_votes":2,"down_votes":0,"body":"How about lowering/removing the actual base mana regen on the item, and buffing the passive and making it unique? I think that'd solve the problem honestly. If mid laners actually need more than the new buffed passive would give, it could either be buffed more, or given a base % mana regen that's much lower than it currently is.","replies":[]}]},{"poster":"AMYS GRAVE","date":"2017-06-02T04:12:06.012+0000","up_votes":2,"down_votes":1,"body":"It doesn't have to be totaly unique. It could be 50% as effective per ring.","replies":[]},{"poster":"InternalBleating","date":"2017-06-20T15:40:40.578+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=qqHIREtH,comment-id=0000,timestamp=2017-06-02T01:40:09.683+0000)\n>\n> We&#x27;re looking at making the mana on kill unique. Stacking DRings is something we want to be an option in some cases at least, suspect we need a bit more trade off than there currently is though.\n\n\"We don't force a meta\"\n\nfucking hypocrites, you killed Chogath completely as well as many other champs who NEEDED more than one ring.\n\nAt least in the higher ELO.","replies":[]},{"poster":"Doseqis","date":"2017-06-04T07:49:45.924+0000","up_votes":1,"down_votes":0,"body":"My big issue with it is how oppressive the DRing stacker is in lane, they may have spent 1200 gold on DRings but they are so strong in lane it's barely a tradeoff at all.\n\nI think they just sell off too well, you practically only spend 660 gold to dominate laning phase after you sell them off.","replies":[{"poster":"Tokishi","date":"2017-06-07T08:00:02.022+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Le Shenpai,realm=NA,application-id=3ErqAdtq,discussion-id=qqHIREtH,comment-id=0000000d,timestamp=2017-06-04T07:49:45.924+0000)\n>\n> My big issue with it is how oppressive the DRing stacker is in lane, they may have spent 1200 gold on DRings but they are so strong in lane it&#x27;s barely a tradeoff at all.\n> \n> I think they just sell off too well, you practically only spend 660 gold to dominate laning phase after you sell them off.\n\nIt's really not that bad on most midlaners. The only people I see it as an issue for is like...galio and maybe fizz.","replies":[]}]},{"poster":"Califlower","date":"2017-06-06T00:59:06.772+0000","up_votes":1,"down_votes":0,"body":"If your going to make Doran's Ring unique, why not go all the way and also make dark seal's potion stacking unique as well? It seems like a weird design for it not to be. I understand that currently only singed really abuses that but that might not always be the case.","replies":[]},{"poster":"AwesomeFranz","date":"2017-06-04T14:11:21.492+0000","up_votes":1,"down_votes":0,"body":"What do you plan to do to help tanks top then? They likely need mana cost reductions (Naut, Mao, ...) or a real mana item because the only reason they work is the tripple dorans build. This build allows them to clear waves without getting OOM after just some waves, not fall too far behind in HP and be able to trade all at the same time.","replies":[]},{"poster":"iTaLenTZ","date":"2017-06-02T19:33:35.033+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=qqHIREtH,comment-id=0000,timestamp=2017-06-02T01:40:09.683+0000)\n>\n> We&#x27;re looking at making the mana on kill unique. Stacking DRings is something we want to be an option in some cases at least, suspect we need a bit more trade off than there currently is though.\n\nMake them sell back for less. Stacking Doran's is an early game advantage and if its doesn't pay off it should be more punishing","replies":[]},{"poster":"LKV2","date":"2017-06-02T14:22:31.404+0000","up_votes":1,"down_votes":0,"body":"1)Max 2 \"starting items\" limtation? seems pretty simple. tons of midlaner build 2 doran rings for sustain (not OP at all), and if u get an early kill (kha? lee sin?) at least i can back in lane with something useful.","replies":[]},{"poster":"Gallows madness","date":"2017-06-03T00:46:46.515+0000","up_votes":1,"down_votes":1,"body":"Meddler I saw the changes to abyssal mask and I had the biggest smile on my face I'm actually happy because the doran ring abuse will end with this because some tanks struggle with mana and I can finally get this item for a few of them. I'm quite happy with the abyssal now having mana! Thank you :)","replies":[]},{"poster":"Linna Excel","date":"2017-06-02T03:49:21.017+0000","up_votes":1,"down_votes":1,"body":"How about mana on kill being unique, but you get 1% missing mana?  Maybe get rid of the passive regen bonus for it as well.","replies":[]},{"poster":"Spideraxe","date":"2017-06-02T01:51:27.383+0000","up_votes":1,"down_votes":1,"body":"Ayye Meddler your back, I hope you had fun here in NYC","replies":[]}]},{"poster":"Tsukurokami","date":"2017-06-02T12:12:45.233+0000","up_votes":4,"down_votes":0,"body":"pls rioter don't make ap md any weaker than they are actualy you just will destroy the only way a mid have too compensate an early gank (lvl 3 4), it's already too hard for 2 midlaner too cohexist in one game","replies":[]},{"poster":"LadyRenly","date":"2017-06-02T01:42:53.513+0000","up_votes":6,"down_votes":2,"body":"...or we could just nerf the shit out of galio, hes literally the only problem case here","replies":[{"poster":"Dolan McDolan","date":"2017-06-02T18:39:04.934+0000","up_votes":1,"down_votes":0,"body":"Pretty much any tank that scales of ap and uses mana can abuse this, never seen an maokai with 3 doran's just spam saplings everywhere. Even if you don't scale of ap, on tanks using your abilities without worrying about running out of mana is really strong.","replies":[{"poster":"Erockandroll","date":"2017-06-02T19:19:37.043+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pimp Galio,realm=EUW,application-id=3ErqAdtq,discussion-id=qqHIREtH,comment-id=00010001,timestamp=2017-06-02T18:39:04.934+0000)\n>\n> Pretty much any tank that scales of ap and uses mana can abuse this, never seen an maokai with 3 doran&#x27;s just spam saplings everywhere. Even if you don&#x27;t scale of ap, on tanks using your abilities without worrying about running out of mana is really strong.\n\nYet never a problem with mages since they have Morello's. But that's why I think that such Tanks need a Decent Caster item. \n\nBut that's also why I feel like the move to change Abyssal mask into a Catalyst item was really good. With the Eternity passive, you help with your mana problems to an extent, and it's passive gives more dueling power to AP Tanks like Grags/Naut/Galio, without giving them an oppressive amount of wave clear. (Or endless amounts of mana)","replies":[]}]},{"poster":"Lane Cancer","date":"2017-06-02T03:34:38.165+0000","up_votes":2,"down_votes":2,"body":"{{champion:111}} does the same shit, in fact he did it first\n{{champion:14}} also does it.\n\nActually, almost every single tank is doing this right now","replies":[]}]},{"poster":"Perma CC","date":"2017-06-04T02:53:41.316+0000","up_votes":2,"down_votes":0,"body":"Or you know... you could make the passive only unique for melee  champions. That pretttttty much cuts out most of the tanks abusing the effect. Or you know actually nerf the problem that is Galio.... cause you know theres an idea... actually for once nerfing the thing that is a problem rather then some other small thing so that you can keep the oppression of said broken thing in the game. ","replies":[]},{"poster":"Syndera","date":"2017-06-02T16:22:45.834+0000","up_votes":2,"down_votes":0,"body":"Just gonna be honest. This change is incredibly unnecessary and frankly, just stupid. \nI've never heard of anyone ever struggling with the fact that Double Ring is a thing. \nI assume the reason for this change is a top-lane thing with 3 rings?  1,2k gold for 45ap,180hp,150basemanaregen and 12mana/on killing units. \nMaking this change in order to fix the \"3-ring\" problem will just hurt mid-lane for actually no reason at all. \nLike someone mentioned below, just set a \"2 Starting items only-limitation\"?","replies":[]},{"poster":"zlumpy","date":"2017-06-02T03:42:44.603+0000","up_votes":2,"down_votes":1,"body":"Can we just have viable mana regen items back again?  I actually used to love building chalice on a lot of champs back in the day.","replies":[]},{"poster":"The Bad Touch","date":"2017-06-12T06:45:58.605+0000","up_votes":1,"down_votes":0,"body":"Because Korean players like change for the sake of change... and professional players  are mostly Korean.\n\nEver play a Korean MMO? New patch every 3 days for some new event that is always a copy paste job from a previous event.. but now rewards \"PNK RAB. EARS!\" insead of last months \"MVE RAB. EARS!\" .... \n\"Lucky CHANCE! coins, increase win stacks to 10 times! (110 tokens)\" **BUY NOW!**\n\nNote if this offends anyone... I frankly don't give a shit. :)","replies":[]},{"poster":"Orangesilk","date":"2017-06-09T23:30:49.874+0000","up_votes":1,"down_votes":0,"body":"Since we're on the \"Murder Cho'Gath\" train anyways with the changes to Vorpal Spikes and Thunderlords and now crapping on Dorans ring stacking.\n\nI suggest we make it so Vorpal Spikes no longer triggers Rylais, ulting minions no longer gives stacks and rupture gets a 2 second delay.","replies":[]},{"poster":"Tokishi","date":"2017-06-07T07:58:33.499+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Le Shenpai,realm=NA,application-id=3ErqAdtq,discussion-id=qqHIREtH,comment-id=,timestamp=2017-06-01T05:19:46.323+0000)\n>\n> Feels pretty awful when tanks have kill pressure while also having a CC lock, Take Galio for instance his waveclear is insane but comes with the tradeoff of spamming it costing a ton of mana early but 2-3 dorans rings negates this tradeoff and even lets Galio burst enemies in the laning phase.\n> \nOr you know...nerf Galio, he really shouldn't be able to 1v3 as easily as he can right now with just a full tank build.","replies":[]},{"poster":"Real Space Druid","date":"2017-06-05T21:05:27.358+0000","up_votes":1,"down_votes":0,"body":"Literally the poorest option you coulda chosen in order to nerf the few top laners abusing the starting item that isnt even meant for them.{{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"Proxy345","date":"2017-06-04T09:52:04.489+0000","up_votes":1,"down_votes":0,"body":"People have been stacking Doran items since S2 so I don't see the problem here lol","replies":[]}]}