{"poster":"Ironezia","date":"2014-07-21T08:27:30.153+0000","title":"Mopay támogatási összeg probléma","up_votes":1,"down_votes":0,"body":"Júniusban 1500 FT-ért vettem RP-t. Telenornal vagyok előfizetéses és most kapom a csekket és keresem, hol az 1500 FT, sehol. Megtalálom az emelt díjas részt, dátum, hívás időtartama minden egyezik, de csak 610 FT-ot számolt fel.\r\nEz most, hogy van? Mikor azt írta Lol-ba, hogy az 1500 FT-ot a számlámra terhelik és csak 610 FT-ot tüntet fel és annyit is kell kifizetnem.","replies":[{"poster":"Mind The Gap","date":"2015-02-07T06:10:48.977+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ha Telenoros vagy, akkor azért, mert a Telenornak szerződése van a Mopay-jel, vegyünk példaként egy RP csomagot.\nTegyük fel, hogy valaki, aki nem Telenoros számról hívja a Mopayt, megveszi a 2500 Ft-os RP csomagot. De te, aki mondjuk 06-20 xxx xxx számról hívja a a Mopayes vonalon ugyanúgy a 2500 Ft-os RP csomagot. Annak a bizonyos valakinek teljes összeget kell fizetnie, de a Te esetedben 2500 helyett csak egy 1000 Ft alatti értéket, nálam 2500 Ft esetében 600 Ft-ot vonnak le, és ráadásul meg is kapod azonnal az 1070 RP-det.","replies":[]},{"poster":"mmateexd","date":"2014-07-22T07:02:29.009+0000","title":null,"up_votes":1,"down_votes":0,"body":"én előfizetős vagyok és ugyanúgy a Telenornál vagyok.Én is Mopayon keresztül rendelek rp-t havonta de a telefon számlán külön tünteti fel sms-ként....Nem értem hogy ha emelt díjas hívást az mióta számítják sms-nek.Elvileg havonta 3000 ft beszélhetek le ingyen+ehhez jön az ingyenes net.Ha emelt díjas hívást intézek vagyis 1500ft rendelek rp-t akkor azt nem a 3000ft kéne levonni???","replies":[]},{"poster":"iSPZ","date":"2014-07-21T09:01:08.037+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az adott összeget az \"első résznél\" nem találtad meg, csak az emelt díjasnál egy részét, a másik része nem lehet hogy felül van a többinél, csak mivel nem az adott 1500Ft így nem vetted figyelembe? (Mondjuk \"értelmetlen\" lenne két részre szedni)\n\nEgyébként, megnéztem pontosan milyen csomagok vannak, mert nem voltam benne 100%-ig biztos, szóval, az nem lehetséges, hogy rosszat néztél, és az a 610 az-az RP-t jelzi, \"magyarázat\", hogy miért fizettél? Mert ugye 610RP-t kapsz az 1500FT-os csomagért. Esetleg interneten biztosan nyomon lehet követni a számla adatokat, ott nézd meg.","replies":[{"poster":"Ironezia","date":"2014-07-21T09:20:34.496+0000","title":null,"up_votes":1,"down_votes":0,"body":"Biztosan nem magyarázat mert 610 FT összeget ír és oda is sorolja a többi hívási FT közé. Arra számítottam, hogy majd külön számolja fel és nem pedig a csomagomba. Most lehet több részletbe küldik? Mert 1500-at tuti levon és azt a Telenorra terheli ami telefonszám alapján meg rám. Ezért lenne jó tudni, hogy más előfizetőnek, hogyan küldik ki.","replies":[{"poster":"iSPZ","date":"2014-07-21T09:21:52.799+0000","title":null,"up_votes":1,"down_votes":0,"body":"Értem. Egy kérvényt ha gondolod írhatsz [itt](https://support.leagueoflegends.com/anonymous_requests/new), valamilyen pontosabb információval valószínűleg tudnak szolgálni, hogyan is működik ez.","replies":[{"poster":"Ironezia","date":"2014-07-21T09:45:24.678+0000","title":null,"up_votes":1,"down_votes":0,"body":"Tegnap küldtem el 1000 Ft-ot. Úgy volt, hogy ma is küldök, de ilyen kíváncsiság mellett most nem merek :D Persze nem benneteket okollak, mert amint megkapom a pontot az már a Telenor tésztája. Néztem az oldalukat, de egyenlőre online számlanézésre nem találtam elérhetőséget, akkor max várok következtő hó 12.-ig, hogy a 1000-et hogyan számolja fel. De nem értem miért nem tudták felszámolni az 1500-öt, ha már 610-et felszámolt. Mind1, köszi a választ :D supportól hátha többet megtudok.","replies":[]}]}]}]}]}