{"poster":"Coobenlol","date":"2018-11-07T17:49:52.570+0000","title":"Ideas sobre el sistema de juego: 7 de noviembre","subforum":"Jugabilidad, balance y narrativa","up_votes":8,"down_votes":2,"body":"[Publicado originalmente por Riot Meddler] \r\n\r\nHola, chicos.\r\n\r\n**Avisos de siempre**\r\n\r\nEstas publicaciones a menudo contienen informaci&oacute;n acerca del trabajo a futuro que estamos realizando o planeando hacer y que no garantizamos que saldr&aacute; para el p&uacute;blico. La naturaleza de dicho trabajo puede cambiar o, seg&uacute;n lo que vayamos descubriendo, algunos proyectos mencionados podr&iacute;an retrasarse o incluso cancelarse definitivamente. Si deseas ver un tuit cada vez que subimos una de estas publicaciones, sigue la cuenta de Twitter de Riot Meddler (en ingl&eacute;s): https://twitter.com/RiotMeddler\r\n\r\n----------------------------------------------------------------------------      \r\n**Reflexiones de Odisea**\r\n\r\nHemos estado reflexionando sobre Odisea estos d&iacute;as para entender qu&eacute; podemos aprender al respecto. Queremos compartir las siguientes reflexiones:\r\n\r\n* Es claro que existe un inter&eacute;s en una modalidad PvE relacionada con LoL pero que al mismo tiempo sea una experiencia diferente. Es decir, que vaya m&aacute;s all&aacute; de ser una copia de un modo PvP (como sucede en partidas de Cooperativo vs IA). En particular, nos comentaron que poder modificar las habilidades de los campeones y tener encuentros con grandes cantidades de enemigos les llam&oacute; mucho la atenci&oacute;n. \r\n* La mayor parte de los jugadores probaron el modo, y una buena cantidad de ellos le dedicaron muchas partidas. Para ser m&aacute;s espec&iacute;ficos, tanto la jugabilidad del modo como sus misiones fueron de gran importancia para los jugadores que se involucraron profundamente. \r\n* La mayor frustraci&oacute;n vino de que los integrantes de los equipos no estaban de acuerdo en las misiones que quer&iacute;an completar. En el futuro, debemos evitar que este tipo de conflictos suceda, ya sea con misiones dise&ntilde;adas de otra manera o facilitando que los jugadores con metas comunes puedan encontrarse y perseguir un mismo objetivo.\r\n* Seguiremos atentos a cualquier oportunidad que tengamos para implementar m&aacute;s experiencias PvE como esta en el futuro. Como no es una experiencia PvP, no tiene el mismo valor al jugarse una y otra vez, pero la seguiremos explorando.\r\n\r\nPor cierto, tendremos una publicaci&oacute;n en el blog de desarrolladores que tratar&aacute; de ciertas estad&iacute;sticas de Odisea: la popularidad de ciertos campeones, qu&eacute; tanto se complet&oacute; cada dificultad, el uso de aumentos, entre otros. La estaremos compartiendo dentro de un mes o dos. \r\n\r\n----------------------------------------------------------------------------       \r\n**Frenes&iacute; en el Nexo** \r\n\r\nComo [mencionamos hace unas semanas](https://nexus.leagueoflegends.com/es-ar/2018/10/dev-up-next-for-nexus-blitz/), planeamos traer de vuelta Frenes&iacute; en el Nexo para otra serie de pruebas a partir de la versi&oacute;n 8.24.\r\n\r\n\r\n\r\nAhora que estamos trabajando en ello, hay ciertos detalles que queremos compartir:\r\n\r\n* Tenemos algunos eventos nuevos que nos agradan bastante, en especial uno que se enfoca en peleas peque&ntilde;as en vez de peleas en equipo, como lo hacen la mayor&iacute;a de los eventos. \r\n* Eliminaremos la pelea de bolas de nieve. Aunque ten&iacute;a momentos divertidos, es el evento que ha tenido m&aacute;s comentarios negativos, en general.\r\n* En cuanto a recompensas, eliminaremos algunas que son frustrantes o no son muy satisfactorias como la Bendici&oacute;n de Caitlyn o la Maldici&oacute;n de S&uacute;bditos, para reemplazarlas por alternativas m&aacute;s interesantes y divertidas.\r\n* Parece que la reconfiguraci&oacute;n de muros del mapa y ubicaciones de campamentos de la jungla que hemos trabajado va bastante bien. Con ella, nuestros objetivos son lograr una fase de carriles un poco m&aacute;s marcada as&iacute; como una mayor variedad de rutas para los jungleros.\r\n* Adem&aacute;s, el mapa deber&iacute;a lucir mucho m&aacute;s atractivo (ya no parece un prototipo). No esperamos que quede al mismo nivel que la Grieta del Invocador para esta prueba, pero s&iacute; hay varias mejoras notables si lo comparamos a la primera versi&oacute;n.\r\n\r\n----------------------------------------------------------------------------        \r\n**Pretemporada**\r\n\r\nSeguimos trabajando conforme nos perfilamos hacia la versi&oacute;n 8.23. Estamos puliendo algunos detalles en este momento. En particular, nos gustar&iacute;a disminuir un poco el sustento que existe en el juego para que la fase de carriles no se vuelva demasiado defensiva. Tambi&eacute;n estamos probando no implementar cambios al momento en el que se generan los s&uacute;bditos y los monstruos de la jungla. El objetivo es evaluar c&oacute;mo se utiliza este tiempo de la partida para invasiones y dem&aacute;s acciones (que llegan a ser de alto impacto) a comparaci&oacute;n de la mayor&iacute;a de las partidas, en las que este tiempo es de inactividad hasta que empieza la fase de carriles. \r\n\r\n \r\n \r\n \r\nhttp://ddragon.leagueoflegends.com/cdn/6.24.1/img/champion/Ziggs.png","replies":[{"poster":"Silcardo Jenazad","date":"2018-11-07T18:07:13.193+0000","up_votes":1,"down_votes":1,"body":"buenas... habra evento de proyecto este año? con skins y modo de juego? no les pido que me revelen que skins son ni mucho menos... pero mucha gente esta preocupada por que sacaron esas skins de pijama y estamos asustados de que este año nos dejen sin el evento de culto que es proyecto... un año sin proyecto no es justo.. por dios....xd.. tiren una punta, una indirecta sino pueden decir nada...no se..algo.. por favor\n\nSaludos.","replies":[{"poster":"Coobenlol","date":"2018-11-07T19:07:10.302+0000","up_votes":2,"down_votes":0,"body":"¡Entiendo lo mucho que deseas respuesta a esta pregunta! Cada palabra solo confirma el amor que le tienes a la línea de aspectos y el modo de juego. Pero como tú mismo mencionas en tu post, ningún Rioter comparte información sobre eventos o contenido que viene a menos de que haya una comunicación oficial para todas las regiones (¡y te imaginarás que el hype actual de nuestro contenido y comunicaciones está en las chicas de K/DA como cierre del evento de Worlds!).\n\n\nLo que sí te puedo confirmar es que el tren de novedades no se detiene - ofrecer nuevas formas de disfrutar (desde modos de juego, nuevos champs, nuevas líneas de aspecto, nuevas historias de Universo) es parte del ADN de League of Legends y eso no cambiará.","replies":[{"poster":"Silcardo Jenazad","date":"2018-11-07T22:40:42.888+0000","up_votes":1,"down_votes":0,"body":"jajajajajjaja... muchas gracias por responder... lo intente.. sabia que seguramente no podian decirlo por que si hay algo que riot se guarda muy bien son las novedades en cuanto a las skin y eventos.... pero con intentar no perdia nada..ajajjaaja, ahora queda esperar y no perder las esperanzas..\n\nSaludos.","replies":[]}]}]},{"poster":"ToraYasashi","date":"2018-11-09T23:58:29.322+0000","up_votes":1,"down_votes":0,"body":"> * Eliminaremos la pelea de bolas de nieve. Aunque tenía momentos divertidos, es el evento que ha tenido más comentarios negativos, en general.\n\n\npero si era lo mas divertido {{sticker:sg-janna}}","replies":[]},{"poster":"29 06 1998 ","date":"2018-11-07T18:05:36.010+0000","up_votes":1,"down_votes":0,"body":"**La verdad Sobre Reflexiones de Odisea**: Me encanto el modo PVE, el único problema que había era el desacuerdo sobre las misiones que cada individuo tenia que completar por separado. \n\n**Y por parte de Frenesí en el Nexo** me encanto pero también había un desacuerdo con el tema de 2 junglas. Y la primera vez que entre era medio confuso todo y no tenia mucha idea que armarme (Por lo items agregados) o los consejo que te daban no eran de todo claros. \n\n**Pretemporada: Me preocupa el tema de buff a los minion como afecta esto al juego el cambio a las torres con el {{item:3512}} y el buff del Baron o la runa de golpear mas las torres. Tengan en cuenta todo esto. _Futuras pruevas nos aguardan en el PVE_ {{champion:74}} \n**","replies":[{"poster":"LastHope17","date":"2018-11-08T03:18:55.869+0000","up_votes":1,"down_votes":0,"body":"Algo casi seguro es que se va a empezar a usar demolición mucho mas en todas las lineas, al menos a mi me divierte ver esas cosas xD, imaginate un morde adc con demolicion un blitz con demolicion un sion con demolicion, un maokai con demolicion y un swain con demolicion? todo en una misma partida","replies":[{"poster":"rokushoger","date":"2018-11-08T11:50:21.091+0000","up_votes":1,"down_votes":0,"body":"Es que me sorprende que no se use tanto ahora, te da un poder mucho más tangible que el resto de las runas, y una habilidad de romper torres sin igual. Con esa habilidad cualquier champ puede splitpushear aún sin ser notablemente dañino a torres.","replies":[]}]},{"poster":"Coobenlol","date":"2018-11-07T19:00:16.933+0000","up_votes":1,"down_votes":0,"body":"El tema de las misiones de Odisea será algo que definitivamente se retrabajará para que no entren en conflicto en futuros eventos/modos de juego PVE. \n\nAunque publicamos un [artículo que explica el modo de juego](https://las.leagueoflegends.com/es/news/game-updates/features/juega-el-alfa-de-frenesi-en-el-nexo), creo que pudimos haber hecho mejor trabajo para dar más detalles del modo de juego (sobre todo a partir de que llegó a manos de los jugadores y fueron ustedes quienes descubrieron las mejores maneras de jugarlo). ¿Quizás invitar a la comunidad a armar guías y compartirlas en nuestros canales para que tuvieran más visibilidad...? Nos lo llevamos de tarea. \n\nEfectivamente, con cada cambiecito, viene toda una serie de ajustes de balance para asegurarnos que no se rompa el juego (demasiado). Ten por seguro que estaremos observando el impacto de cualquier cambio con cada nuevo parche (¡y no olviden seguir comentándonos cómo sienten los cambios!)","replies":[]}]},{"poster":"rokushoger","date":"2018-11-08T11:48:17.604+0000","up_votes":1,"down_votes":0,"body":"> Seguiremos atentos a cualquier oportunidad que tengamos para implementar más experiencias PvE como esta en el futuro. Como no es una experiencia PvP, no tiene el mismo valor al jugarse una y otra vez, pero la seguiremos explorando.\n\nNo busquen demasiado, la de star guardian fue perfecta. Las misiones que requerían ponerse de acuerdo eran en grupos prediseñados, cada pantalla variaba una de otra, lotes de monstruos, si le agregan los cambios en habilidades de Odisea era el PvE perfecto.\n\n> Eliminaremos la pelea de bolas de nieve. Aunque tenía momentos divertidos, es el evento que ha tenido más comentarios negativos, en general.\n\nQue bueno! \n\n> nos gustaría disminuir un poco el sustento que existe en el juego\n\nMás nerfeos a los soportes de utilidad? Para eso eliminenlos y pongan wards con su cara y listo XD.","replies":[]},{"poster":"Pollo al Ornno","date":"2018-11-07T19:53:32.037+0000","up_votes":1,"down_votes":0,"body":"FRENESI AL NEXO? DIJERON FRENESI AL NEXO? SIIIIUUUUUUU","replies":[]}]}