{"poster":"Coobenlol","date":"2019-03-06T17:58:42.157+0000","title":"Ideas sobre el sistema de juego: 6 de marzo","subforum":"Jugabilidad, balance y narrativa","up_votes":5,"down_votes":3,"body":"[Publicado originalmente por Riot Meddler] \r\n\r\nHola, chicos.\r\n-------------------------------------------------------------------------------\r\n**Avisos de siempre**\r\n\r\nEstas publicaciones a menudo contienen información acerca del trabajo a futuro que estamos realizando o planeando hacer y que no garantizamos que saldrá para el público. La naturaleza de dicho trabajo puede cambiar o, según lo que vayamos descubriendo, algunos proyectos mencionados podrían retrasarse o incluso cancelarse definitivamente. Si deseas ver un tuit cada vez que subimos una de estas publicaciones, sigue la cuenta de Twitter de Riot Meddler (en inglés): https://twitter.com/RiotMeddler\r\n----------------------------------------------------------------------------    \r\n**Pruebas de Clash**\r\n\r\nHace tiempo que no hablamos de Clash, pero continúa nuestro trabajo para su lanzamiento completo. Como siguiente gran paso, realizaremos algunas pruebas en Brasil y Latinoamérica este fin de semana.  Estas pruebas se enfocarán en dos aspectos principales:\r\n\r\n1. Inicios según el nivel. Básicamente, las partidas para cada rango de nivel comenzarán en horas diferentes del día para repartir mejor el número de jugadores que usan el servidor al mismo tiempo.\r\n\r\n2. Límites. Habrá un límite máximo de equipos que pueden competir al día. Este límite es demasiado grande, así que será poco común llegar a él. Creemos que es mejor dejar de admitir equipos nuevos a un torneo de Clash si un servidor se llena demasiado a añadir algunos jugadores más a costa del deterioro en el desempeño de las partidas para quienes ya están dentro.  \r\n\r\n----------------------------------------------------------------------------      \r\n**Actualización de clasificatorias**\r\n\r\nQuizás algunos ya lo vieron, pero la semana pasada publicamos una [actualización sobre el estado de las clasificatorias](https://boards.las.leagueoflegends.com/es/c/jugabilidad-balance-y-narrativa/etFBNEHH-clasificatoria-actualizacian-3-de-desarrolladores) donde hablamos sobre lo que funciona y lo que no.\r\n\r\nEste viernes publicaremos otra actualización sobre lo que no está funcionando tan bien, y lo que cambiaremos en respuesta a ello.\r\n----------------------------------------------------------------------------        \r\n**Urgot**\r\n\r\nActualmente tenemos algunos cambios importantes para Urgot en el entorno de pruebas (PBE). Algunos son aumentos directos de poder (como era de esperarse, está un poco débil desde que le aplicamos algunas debilitaciones notables). Queremos detallar algunos de los cambios que merecen un poco más de contexto:\r\n\r\n* Estamos probando mover su escudo de su W a su E. El objetivo es que cuando Urgot desee entrar en enfrentamientos con su escudo, tendrá que poner sus dos herramientas defensivas en enfriamiento (incluido su desplazamiento). Este aumento de riesgo en sus intercambios significa que probablemente podamos restablecer algo de su poder en otras áreas.\r\n* Aumentaremos el alcance de su definitiva de forma considerable. En retrospectiva, probablemente fuimos demasiado cautelosos cuando restringimos su alcance original, en especial por lo fácil que es bloquearla o fallar. \r\n* Haremos que los armados con DA sean más viables para diversificar un poco los objetos que puede comprar. La meta es que siga siendo un coloso que aún desee armarse como tanque. Sin embargo, queremos disminuir la brecha de efectividad entre los armados de tanque y de DA.\r\n\r\n\r\nhttp://ddragon.leagueoflegends.com/cdn/6.24.1/img/champion/Ziggs.png","replies":[{"poster":"DonSai","date":"2019-03-06T18:36:39.695+0000","up_votes":2,"down_votes":1,"body":"se que es offtopic pero viendo que ningún rioter se ha hecho presente en ningún tema al respecto, en varias compañías de internet chilenas hay un problema de \"ping fantasma\", a pesar del juego marcar 20 ms  el personaje responde tarde, las habilidades desaparecen o el campeon sigue caminando en linea recta para luego tele transportarse a donde le había dicho que fuera, hagan algo al respecto por favor","replies":[{"poster":"AresC","date":"2019-03-06T18:47:24.451+0000","up_votes":1,"down_votes":0,"body":"Hola! Te dejo [este ](https://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/BlkEERmZ-)post en el que Riot le está dando seguimiento al problema.","replies":[{"poster":"DonSai","date":"2019-03-06T19:35:41.380+0000","up_votes":1,"down_votes":0,"body":"no lo había visto, ¡gracias!","replies":[]}]}]},{"poster":"BotBox","date":"2019-03-06T18:51:43.991+0000","up_votes":1,"down_votes":0,"body":"Espero que notifiquen el viernes que reinician las ranked, son un desastre.","replies":[{"poster":"Coobenlol","date":"2019-03-18T01:56:26.405+0000","up_votes":1,"down_votes":0,"body":"Te dejo un link al artículo completo, y a un post referente a este tema para que no te pierdas los detalles:\n\nhttps://nexus.leagueoflegends.com/es-ar/2019/03/dev-state-of-ranked/\n\nhttps://boards.las.leagueoflegends.com/es/c/jugabilidad-balance-y-narrativa/TtOoQvwL-clasificatorias-2019-restablecimiento-de-la-escalera-clasificatoria-para-elo-alto-en-la-versian-96","replies":[]}]},{"poster":"ZyXEL 001","date":"2019-03-06T19:05:16.385+0000","up_votes":1,"down_votes":0,"body":"Extraño al Urgod que tenía gráficas de un Family y se mandaba con su ulti al medio de las TF\n\n{{champion:32}}","replies":[]},{"poster":"Gato Brujo","date":"2019-03-06T18:12:45.693+0000","up_votes":1,"down_votes":1,"body":"Gracias {{sticker:slayer-jinx-catface}}","replies":[]}]}