{"poster":"Coobenlol","date":"2018-05-03T21:59:19.362+0000","title":"Ideas sobre el sistema de juego: 3 de mayo","subforum":"Jugabilidad, balance y narrativa","up_votes":5,"down_votes":11,"body":"[Originalmente publicado por Riot Meddler] \r\n\r\n&iexcl;Hola a todos!\r\n-------------------------------------------------------------------------------\r\n**Avisos de siempre**\r\n\r\nEstas publicaciones a menudo contienen informaci&oacute;n acerca del trabajo a futuro que estamos realizando o planeando hacer y que no garantizamos que saldr&aacute; para el p&uacute;blico. La naturaleza de dicho trabajo puede cambiar o, seg&uacute;n lo que vayamos descubriendo, algunos proyectos mencionados podr&iacute;an retrasarse o incluso cancelarse definitivamente. Si deseas ver un tuit cada vez que subimos una de estas publicaciones, sigue a Riot Meddler en: https://twitter.com/RiotMeddler\r\n---------------------------------------------------------------------------- \r\n**Cambios de mitad de temporada en los que estamos trabajando**\r\n\r\nComo seguramente han visto en otras publicaciones de desarrollo, tenemos varios cambios para la mitad de temporada. A&uacute;n estamos trabajando en pulir objetos de DA que se lanzar&aacute;n en la 8.11, seguimos explorando y afinando cambios para jungleros (probablemente en la 8.10) y estamos dando seguimiento a cambios en los requisitos de man&aacute; para objetos de magos y de PH de la versi&oacute;n 8.9. Apreciamos sus comentarios sobre estos cambios, ya sea de sus experiencias directas el juego o sus an&aacute;lisis despu&eacute;s de publicarlos. Si bien no podemos aplicar las sugerencias de todos los comentarios, especialmente cuando jugadores diferentes tienen objetivos muy diversos, son extremadamente valiosos, pues nos ayudan a hacer descubrimientos o hacer muchas mejoras. \r\n\r\n----------------------------------------------------------------------------  \r\n**Ideas para soportes pr&oacute;ximamente**\r\n\r\nHemos hablado sobre otras clases y posiciones &uacute;ltimamente, pero no hemos hablado mucho sobre los soportes y sus problemas desde hace un tiempo. Publicaremos ideas al respecto pronto (el viernes o a mediados de la semana que viene). La versi&oacute;n resumida es que hay algunos problemas que queremos ver una vez que se haya estabilizado la mitad de temporada, incluyendo la confiabilidad del poder defensivo de los magos y si el poder actual de los valores de curaci&oacute;n/escudo est&aacute;n demasiado elevados y/o devaluados. La versi&oacute;n larga llegar&aacute; pr&oacute;ximamente.\r\n\r\n----------------------------------------------------------------------------   \r\n**Sonido de la Q potenciada por la W de Varus**\r\n\r\n&Uacute;ltimamente hemos visto comentarios sobre lo dif&iacute;cil que es saber cu&aacute;ndo Varus est&aacute; cargando una Q potenciada por su W o cuando es solo una Q normal, lo que dificulta jugar alrededor de ese lanzamiento m&aacute;s peligroso. Resulta que uno de los motivos es que la se&ntilde;al auditiva principal de la carga de la Q potenciada casi nunca se reproduc&iacute;a. Eso debe resolverse en la versi&oacute;n 8.9, av&iacute;sennos si a&uacute;n es dif&iacute;cil distinguir entre una Q normal y una potenciada.\r\n\r\n----------------------------------------------------------------------------    \r\n**Reglas de rendici&oacute;n**\r\n\r\nPronto (probablemente a partir de esta semana) probaremos un cambio en las reglas para la rendici&oacute;n temprana que elimina el requisito del voto un&aacute;nime y en vez de eso requiere los 4 o 5 votos positivos regulares. Inicialmente ese cambio solo se lanzar&aacute; en el servidor de Ocean&iacute;a. Si las pruebas son positivas, lo implementaremos en otras regiones tambi&eacute;n.\r\n\r\nOriginalmente nos decidimos por el requisito un&aacute;nime en las rendiciones tempranas para asegurar que los jugadores no perdieran partidas que podr&iacute;an ganar debido a una rendici&oacute;n prematura. Sin embargo, al analizar las rendiciones tempranas que no se rinden 4-1 entre el minuto 15-20, a menudo terminan con una rendici&oacute;n o derrota a los 20 minutos. Eso significa que el requisito un&aacute;nime solo hace que se prolonguen partidas que ya est&aacute;n perdidas.\r\n\r\nhttp://ddragon.leagueoflegends.com/cdn/6.24.1/img/champion/Ziggs.png","replies":[{"poster":"Gretta Thunberg","date":"2018-05-03T23:53:43.506+0000","up_votes":2,"down_votes":1,"body":"Me encanta lo de los soportes, una janna que es sube la w en vez de la e para hacer daño apenas deberia de tener escudo, seria interesante que los janna players tuvieran que elegir sobre todo a niveles bajos si ir por el poke o por la proteccion. lo mismo pasa con lulu.","replies":[]},{"poster":"Gonk","date":"2018-05-05T02:56:55.568+0000","up_votes":1,"down_votes":0,"body":"Voy a empezar a dar negativos cada vez que vea que la jugabilidad la haya puesto otro rioter(ya se lo de gauss)","replies":[]},{"poster":"Ruphian","date":"2018-05-04T21:15:53.041+0000","up_votes":1,"down_votes":0,"body":"Gaussrik sos vos?","replies":[]},{"poster":"Lord Khada","date":"2018-05-03T23:23:40.199+0000","up_votes":1,"down_votes":9,"body":"Dejen de \"poner\" cosas y arreglen lo que esta puesto. Gracias.\nSaluditos...........","replies":[{"poster":"Deigex","date":"2018-05-04T00:15:53.928+0000","up_votes":1,"down_votes":0,"body":"Los aram? :v","replies":[]},{"poster":"Juice Wrld","date":"2018-05-04T12:27:43.675+0000","up_votes":1,"down_votes":0,"body":"Podrías citar ejemplos?","replies":[]}]}]}