{"poster":"knofknof","date":"2020-02-25T10:05:02.912+0000","title":"GG EZ","subforum":"Spielerverhalten & Moderation","up_votes":10,"down_votes":6,"body":"Hallo, \r\nwarum ist es in fast jedem Game zum Standart geworden nach dem Game \"GGEZ\" oder \"easy af\" zu schreiben.\r\nIch meine so etwas ist eines der unsportlichsten Verhaltensweißen die ich kenne. Würde in jeder anderen Sportart sehr hart bestraft werden oder man würde sich in der Öffentlichkeit sehr unbeliebt machen. Mich würde ehrlich gesagt interessieren was Riot darüber denkt. Es kann nicht sein das sowas unbestraft bleibt. Es müssen hier knallharte Strafen folgen weil es schon nach jedem Game teilweise reingespamt wird. Meiner Meinung nach sollte ein Spieler Chatverbot bekommen und nach 3 Mal einen Permaban. Diese Toxic-Spieler haben nichts in diesem Spiel verloren da sie nur darauf aus sind andere Spieler zu provozieren.\r\n\r\nWas meint Ihr? \r\n\r\nLG knofknof","replies":[{"poster":"mulle87","date":"2020-02-25T10:22:53.348+0000","up_votes":3,"down_votes":0,"body":"ich hab den chat komplett aus, hilft","replies":[{"poster":"knofknof","date":"2020-02-25T10:29:30.397+0000","up_votes":8,"down_votes":0,"body":"Das sollte nicht der Weg sein ein feature komplett aus zu machen nur weil sich manche nicht benehmen können.","replies":[{"poster":"mulle87","date":"2020-02-26T06:24:16.640+0000","up_votes":2,"down_votes":0,"body":"hilft aber um einen klaren Kopf zu bewahren","replies":[]}]}]},{"poster":"Temp1891534","date":"2020-02-25T10:47:52.181+0000","up_votes":7,"down_votes":1,"body":"Bin auch der Meinung das so was bestraft gehört, allerdings fände ich nen perma nach 3 mal auch bisschen viel des guten.\n\nLol ist nur mal ein Sport wenn auch E-sport, also gehört auch ein gewisser sportsgeist dazu.\n\nIm Laufe eines Games ein bisschen zu sticheln finde ich in Ordnung, aber wenn das Game bereits vorbei ist dem Verlierer noch ein \"Easy\" rein zu drücken muss nicht sein, auch dann nicht wenn es wirklich ein easy Game war.","replies":[{"poster":"Zavolta","date":"2020-02-25T15:05:36.640+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=HauZuErZucktNoch,realm=EUW,application-id=KYnfKGf0,discussion-id=r9lX7NOu,comment-id=0005,timestamp=2020-02-25T10:47:52.181+0000)\n>\n> Bin auch der Meinung das so was bestraft gehört, allerdings fände ich nen perma nach 3 mal auch bisschen viel des guten.\n> \n> Lol ist nur mal ein Sport wenn auch E-sport, also gehört auch ein gewisser sportsgeist dazu.\n> \n> Im Laufe eines Games ein bisschen zu sticheln finde ich in Ordnung, aber wenn das Game bereits vorbei ist dem Verlierer noch ein \"Easy\" rein zu drücken muss nicht sein, auch dann nicht wenn es wirklich ein easy Game war.\n\nChat-Ban und Verlust der \"Ehre\" (wobei solche bei diesen GG EZ-Schreibern eh nicht vorhanden ist) reicht ja auch.","replies":[]}]},{"poster":"xVeritas","date":"2020-02-25T10:23:05.553+0000","up_votes":4,"down_votes":10,"body":"eine der unsportlichsten Verhaltensweißen die du kennst? wenn du seit s4 spielst sollten dir da ganz andere dinge untergekommen sein :D\n\nauch das mit 3x ggez = permaban ist maßlos übertrieben. \nbissal anstacheln find ich schon oke und solang man es nicht pausenlos spamt oder jedes game schreibt finde ich es absolut nicht ban-worthy!\nmeistens sind es sowieso die spieler die mit 2-9 gecarried werden die dann am ende ggez schreiben. da reicht mir ein blick auf die stats als Genugtuung, selbst wenn ich verliere.\n\nlass dich nicht so leicht triggern knoffi ;)","replies":[{"poster":"Megamaexx","date":"2020-02-25T10:39:34.411+0000","up_votes":8,"down_votes":0,"body":"> bissal anstacheln find ich schon oke \n\nAnstacheln NACH einem Spiel? Der Kampf ist vorbei, danach ist es nur noch Provokation der Provokation wegen. Freunde macht man sich so keine.","replies":[]},{"poster":"knofknof","date":"2020-02-25T10:28:32.747+0000","up_votes":3,"down_votes":0,"body":"Ja es sind meisten die 1/10 Spieler aus dem Gegnerteam :) aber es kann nicht sein das man sich gegenüber anderen Spielern so verhält.\nFinde das schon in Ordnung wenn das so bestraft wird weil wers nach 2 mal ban nicht kapiert der kapierts nie :)","replies":[{"poster":"Ráyleigh","date":"2020-02-25T10:43:58.642+0000","up_votes":5,"down_votes":1,"body":"Also soweit ich weiß gilt folgendes, (ez) sorgt höchstens dafür das man dem System schon einmal Negativ aufgefallen ist.\nEs reicht alleine aber nicht für eine Strafe aus.\n\nUnd es ist auf keinen Fall ein Bann Grund aber eine Chatsperre, wenn man es zu oft schreibt würde ich sehr gut finden.","replies":[]}]}]},{"poster":"Zavolta","date":"2020-02-25T15:04:17.508+0000","up_votes":4,"down_votes":0,"body":"Werden alle wegen unsportlichem Verhalten gemeldet. Ganz emotionslos.","replies":[]},{"poster":"MeMyselfandBaal","date":"2020-02-25T15:49:12.908+0000","up_votes":3,"down_votes":2,"body":"Also zunächst mal meine persönliche Meinung: Wer sich über \"EZ\" am Ende aufregt, sollte den All Chat deaktivieren. Ganz einfach. Und ja, wenn ich mich selber wirklich über solche Kleinigkeiten aufrege, bedeutet das \"Ich bin getilted und sollte eine Pause einlegen.\"\n\nAber meine Meinung ist da ja nur bedingt relevant. Damals im \"Früher war alles besser\" Land des Tribunals gab es immer eine Sachlage, bei der ich nicht mit der Mehrheit übereingestimmt habe.: Die \"GG EZ\" Protokolle. Ich persönlich fand es albern Leute nur deswegen zu bannen und habe auf \"Vergeben\" geklickt.\nDie Chatanalyse geht ja offiziell von genau diesem Status aus. Also dass die Mehrheit der Community dieses \"EZ\" geahndet sehen will. Das bedeutet praktisch: Wer dies wirklich regelmäßig macht (und dafür reported wird) kriegt irgendwann eine Chatsperre für 5 Spiele. Und meine Prognose ist: Danach lässt man das dann halt.\n\nFür den TE bedeutet dies also: Solche Leute einfach konsequent reporten und dann werden schon entsprechende Erziehungsmaßnahmen eingeleitet. Aber ein \"Ez\" wie ein \"Begeh Selbstmord\" zu behandeln, halte ich für vollkommen übertrieben.","replies":[{"poster":"need elo police","date":"2020-02-25T16:05:35.438+0000","up_votes":2,"down_votes":1,"body":"Es ist nicht Sinn der Sache den Chat zu muten wenn sich andere nicht korrekt verhalten. Das gleiche wenn man Ampeln abschafft weil sowieso jeder über Rot fährt.\n\nMan muss es an der Wurzel packen, und nicht ignorieren und ausblenden.","replies":[{"poster":"knofknof","date":"2020-02-25T17:15:36.001+0000","up_votes":3,"down_votes":0,"body":"genau so ist es :) gutes Beispiel :)","replies":[]},{"poster":"MeMyselfandBaal","date":"2020-02-26T07:11:25.305+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=need elo police,realm=EUW,application-id=KYnfKGf0,discussion-id=r9lX7NOu,comment-id=000e0000,timestamp=2020-02-25T16:05:35.438+0000)\n>\n> Es ist nicht Sinn der Sache den Chat zu muten wenn sich andere nicht korrekt verhalten. Das gleiche wenn man Ampeln abschafft weil sowieso jeder über Rot fährt.\n> \n> Man muss es an der Wurzel packen, und nicht ignorieren und ausblenden.\n\nScheißbeispiel. Denn nun ja... Es gibt diese Grundregel, dass kein Körper sein kann, wo bereits ein anderer ist. Das ist quasi die Grundlage von Physik. Deswegen musste man irgendwann Verkehrsregeln erschaffen, die, seit es entsprechend viele Körper gibt, verhindern, dass diese unkontrolliert kollidieren. Denn dann gibt es Tote. Wenn man diese Regeln einfach ignoriert, stirbt man selbst oder zieht nen entsprechenden Leichenhaufen hinter sich her. Go watch 7 Lifes.\n\nUnd im Realen Leben kann ich es als unbeteiligter eben nicht ignorieren, wenn jemand physikalische Regeln bricht. Das hat dann entsprechende körperliche Konsequenzen für mich.  Ich kann diese auch nicht leichtfertig selber ignorieren.\n\nIm digitalen Raum ist dies aber anders. Wenn ich den ersten Typen, der mir ein \"STFU\" an den Kopf schmeiße, instant mute... dann kann der hinterher meiner gesamten Familie nen FDP Ministerpräsidenten an den Hals wünschen... auf mich hat das keinen Einfluss, weil ich es einfach nicht mitbekomme. Uns meine Familie kriegt diese Flüche halt praktisch auch nie ab...\n\nUnd wenn ich darauf nicht reagiere, weil ich es nicht mitbekomme... dann greife ich nebenbei praktisch die eigentliche Wurzel des Problems an. Denn diese Wurzel ist nicht, dass einzelne Leute flamen. Sondern das meine Mitspieler auf diesen Flame reagieren und ich dann plötzlich 2 Spieler habe, die nicht mehr spielen, sondern chatten.\nWenn alle Spieler bei jeder negativen Kleinigkeit mit nem \"Mute\" reagieren würden, anstatt selber Öl ins Feuer zu kippen, und dann jeglicher negativer Chat im Nirvana verlaufen würde...","replies":[]}]}]},{"poster":"DrakoDRK","date":"2020-02-25T10:46:15.558+0000","up_votes":4,"down_votes":1,"body":"Ich habe in einem anderen Forum Beitrag vor einiger Zeit gelesen, dass man das Reporten kann am ende des Spielt und es sogar bestraft wird. Ich Reporte jeden immer der dies in den Chat schreibt, egal ob in meinem Team oder im anderen Team.","replies":[{"poster":"knofknof","date":"2020-02-25T11:24:51.024+0000","up_votes":1,"down_votes":0,"body":"Das problem ist das nicht durchgegriffen wird mit bestrafungen...","replies":[{"poster":"Ráyleigh","date":"2020-02-25T11:37:02.565+0000","up_votes":3,"down_votes":0,"body":"Sagen wir mal es wird nicht schnell genug durchgegriffen.\nFrüher oder später bekommt hier jeder was er verdient.\n\nUnd wie ich schon geschrieben habe sollte man für (ez) mal überlegen eine Chatsperre einzuführen.","replies":[{"poster":"knofknof","date":"2020-02-25T11:46:24.422+0000","up_votes":1,"down_votes":2,"body":"ja aber nur Chatsperre wirkt nicht bei solchen Leuten....","replies":[{"poster":"Angel Ayume","date":"2020-02-25T11:59:49.234+0000","up_votes":4,"down_votes":1,"body":"Hören sie nicht auf kommt nach einer weiteren Chatsperre bereits der 14 Tage Bann und danach schon der Permabann.","replies":[]},{"poster":"Ráyleigh","date":"2020-02-25T12:53:57.678+0000","up_votes":2,"down_votes":0,"body":"Ayume hat es schon geschrieben^^\nMit der Zeit wird es nicht bei der Chatsperre bleiben.\nDafür müsste aber noch anderes Fehlverhalten an den Tag gelegt werden.","replies":[]}]}]}]}]},{"poster":"Abasin","date":"2020-02-26T08:32:48.675+0000","up_votes":2,"down_votes":0,"body":"> Game zum _**Standart**_ geworden\n\n[Standard](https://de.wikipedia.org/wiki/Standard) oder [Standarte](https://de.wikipedia.org/wiki/Standarte) ?","replies":[]},{"poster":"De Kus","date":"2020-02-25T15:05:04.401+0000","up_votes":3,"down_votes":1,"body":"Habe auch den Eindruck, dass RITO das egal ist. Afaik. wurde es zu Tribunalzeiten noch geahndet und wird von mir auch immer reportet, wobei ja schon die Reportoption \"unsportsmanlike\" entfernt wurde, was ja schon viel sagt...","replies":[]},{"poster":"Eroticat Nimar","date":"2020-02-25T15:03:27.820+0000","up_votes":3,"down_votes":6,"body":"Naja ich reagier nur mit \"fair enough\" \n\nSolche Sticheleien gehören für mich mit zu League dazu, ich schreibs selten aber es gehört dazu.","replies":[{"poster":"Moonéyé","date":"2020-02-25T15:39:46.911+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Eroticat Nimar,realm=EUW,application-id=KYnfKGf0,discussion-id=r9lX7NOu,comment-id=000b,timestamp=2020-02-25T15:03:27.820+0000)\n>\n> Naja ich reagier nur mit \"fair enough\" \n> \n> Solche Sticheleien gehören für mich mit zu League dazu, ich schreibs selten aber es gehört dazu.\n\nSticheleien? Das ist keine Stichelei, das ist einfach daneben. O.o Stell Dir das bitte mal real vor nach einem sportlichen Ereignis! Sowas macht man nicht. Das ist unsportlich sich dann so aufzuspielen und den anderen dadurch respektlos abzuwerten. Aber bestraft wird es wohl kaum, wenn Riot schon Emotes mit \"easy\" bringt.","replies":[{"poster":"Mephisto70","date":"2020-02-26T22:29:48.593+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Moonéyé,realm=EUW,application-id=KYnfKGf0,discussion-id=r9lX7NOu,comment-id=000b0000,timestamp=2020-02-25T15:39:46.911+0000)\n>\n> Sticheleien? Das ist keine Stichelei, das ist einfach daneben. O.o Stell Dir das bitte mal real vor nach einem sportlichen Ereignis! Sowas macht man nicht. Das ist unsportlich sich dann so aufzuspielen und den anderen dadurch respektlos abzuwerten. Aber bestraft wird es wohl kaum, wenn Riot schon Emotes mit \"easy\" bringt.\n\nUm mal beim Sport zu bleiben:\nWie hätte sich die brasilianische Nationalmanschaft gefühlt wenn die Deutschen Spieler denen ein GG EZ nach dem 7:1 Sieg in's Gesicht gedrückt hätten?\nDie waren eh schon am Boden und dann noch durch sowas einen draufsetzen wäre echt das Letzte. Davon mal abgesehen das sowas in höchstem Maße unsportlöioch UND unfair ist einen demoralisierten Gegner noch zu verhöhnen/zu verspotten.\nIch melde auch jedes EZ (und sämtliuche Abwandlungen) sofern ich's mitbekomme.","replies":[{"poster":"IAmLuckyI","date":"2020-02-28T04:31:19.646+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mephisto70,realm=EUW,application-id=KYnfKGf0,discussion-id=r9lX7NOu,comment-id=000b00000000,timestamp=2020-02-26T22:29:48.593+0000)\n>\n> Um mal beim Sport zu bleiben:\n> Wie hätte sich die brasilianische Nationalmanschaft gefühlt wenn die Deutschen Spieler denen ein GG EZ nach dem 7:1 Sieg in's Gesicht gedrückt hätten?\n> Die waren eh schon am Boden und dann noch durch sowas einen draufsetzen wäre echt das Letzte. Davon mal abgesehen das sowas in höchstem Maße unsportlöioch UND unfair ist einen demoralisierten Gegner noch zu verhöhnen/zu verspotten.\n> Ich melde auch jedes EZ (und sämtliuche Abwandlungen) sofern ich's mitbekomme.\n\nDir ist schon klar das du den Sport im Professionellem Bereich mit einem normalen Ranked vergleichst? Zu mal man einfach das echte Leben mit dem Internet vergleichen kann, so sehr wie ihr verrückten euch das auch wünscht, es geht nicht. Beides sind 2 total verschiedene Dinge und das Internet trifft niemanden Persönlich und wenn doch sollte man sich wohl eher professionelle Hilfe suchen anstatt mit einer instabilen Mentalität ein Spiel zu spielen was 5v5 ist + Ranked und man diese Menschen below d2 eh meist nie wieder sieht in seinen Games.\n\nZeigt ihr im echten Leben auch gleichen jeden an der euch eine dumme Bemerkung an den Kopf wirft (die ja nicht mal beleidigend ist)? Wenn ja, mein Beileid.","replies":[{"poster":"Mephisto70","date":"2020-02-28T08:16:57.533+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IAmLuckyI,realm=EUW,application-id=KYnfKGf0,discussion-id=r9lX7NOu,comment-id=000b000000000000,timestamp=2020-02-28T04:31:19.646+0000)\n>\n> Dir ist schon klar das du den Sport im Professionellem Bereich mit einem normalen Ranked vergleichst? Zu mal man einfach das echte Leben mit dem Internet vergleichen kann, so sehr wie ihr verrückten euch das auch wünscht, es geht nicht. Beides sind 2 total verschiedene Dinge und das Internet trifft niemanden Persönlich und wenn doch sollte man sich wohl eher professionelle Hilfe suchen anstatt mit einer instabilen Mentalität ein Spiel zu spielen was 5v5 ist + Ranked und man diese Menschen below d2 eh meist nie wieder sieht in seinen Games.\n> \n> Zeigt ihr im echten Leben auch gleichen jeden an der euch eine dumme Bemerkung an den Kopf wirft (die ja nicht mal beleidigend ist)? Wenn ja, mein Beileid.\n\nEs geht nur um die Fairness demjenigen gegenüber der verloren hat und nix anderes. Hab nur das mit dem Fußball aufgegriffen um zu verdeutlichen was ich meine **\"grins\"**\n\nMan sollte sich immer in den Gegner hineinversetzen wie er sich fühlt wenn man ihn nachdem er \"hart\" verloren hat auch noch verhöhnt / verspottet.\nAber vielleicht trifft ja folgende Redensart: **\"Behandle andere so, wie DU von ihnen behandelt werden willst“** bzw DIESE **\"Was du nicht willst, dass man dir tu’, das füg' auch keinem andern zu\"**\n\nDiese sollten sich mal einige zu Herzen nehmen steckt viel Wahrheit drin.\n{{sticker:galio-happy}}","replies":[]}]}]}]}]},{"poster":"Asulia","date":"2020-02-25T12:15:25.362+0000","up_votes":2,"down_votes":1,"body":"Solange Riot EZ Sticker verkäuft, triggert mich das nicht wirklich.","replies":[]},{"poster":"Phoenixale","date":"2020-03-03T11:12:28.608+0000","up_votes":1,"down_votes":0,"body":"Das Thema gab es schon 342135452345234543252345234543 Male. Sei keine Heulsuse und steh darüber! Es sagt schon ziemlich viel über dein Ego/Selbstbewusstsein aus, wenn du dich dadurch beleidigt fühlst. Geh nicht drauf ein. {{sticker:zombie-brand-clap}}","replies":[]},{"poster":"Bit2Ez","date":"2020-02-28T07:45:42.943+0000","up_votes":1,"down_votes":1,"body":"Ach du liebes Lieschen, wie mental schwach muss man sein sich von \"ggez\" tilten zu lassen? Ist das dein ernst? jemanden für \"easy\" perma bannen zu wollen?\n\nSpieler wie du sind der Grund warum das Game so scheiße wurde. LOL","replies":[{"poster":"PlayerWithNoName","date":"2020-02-29T19:23:18.286+0000","up_votes":1,"down_votes":0,"body":"Wie mental schwach muss man sein agressiv gegenüber seinen Mitspielern zu sein (paar Tage hast du ja noch)? Jeder hat andere trigger. \n\nFür mich macht es keinen Unterschied ob jemand irgendwem den tot wünscht oder chattet, gehört beides bestraft. \n\nIch finde einen permanenten ban auch nicht gerechtfertigt, finde auch eine ewig hochstackende Interaktions- Sperre nützlicher. Das tut einem zwar nicht unbedingt weh, aber sobald du Dinge nicht mehr pingen kannst oder calls machen etc. Fällt es einem bestimmt nicht mehr schwer kein Affe zu sein.\n\nEs gibt viele Gründe warum das Spiel abgebaut hat, allerdings bist du daran nicht grade unschuldig(hab mir deinen thread durchgelesen).","replies":[{"poster":"Bit2Ez","date":"2020-03-02T08:48:54.897+0000","up_votes":1,"down_votes":0,"body":"hahahahahahaha\n\n> Für mich macht es keinen Unterschied ob jemand irgendwem den tot wünscht oder chattet, gehört beides bestraft.\n\nAlles klar, du setzt also ein \"ggez\" am ende des Spiels damit gleich , jemandem den Tod zu wünschen? Bist du eigtl. komplett delusional?","replies":[]}]}]},{"poster":"Harupeon","date":"2020-02-26T22:51:49.714+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=h0QqXurjzD8","replies":[]},{"poster":"Tobbel","date":"2020-02-25T10:15:04.357+0000","up_votes":1,"down_votes":0,"body":"Das problem an der sache wird wahrscheinlich sein, dass dann ungefähr jeder 2te bestraft wird. Ich hab das in meinem games auch . Ich antworte dann teilweise \"ja so easy kanns ja nicht sein wenn ihr nach 40 minuten gewonnen habt\" :p","replies":[{"poster":"knofknof","date":"2020-02-25T10:30:06.852+0000","up_votes":2,"down_votes":2,"body":"Ja es braucht härtere und sofortige Strafen :)","replies":[{"poster":"Icebergslasher","date":"2020-02-25T19:41:02.902+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=knofknof,realm=EUW,application-id=KYnfKGf0,discussion-id=r9lX7NOu,comment-id=00000000,timestamp=2020-02-25T10:30:06.852+0000)\n>\n> Ja es braucht härtere und sofortige Strafen :)\n\nich hab schon nen thread gesehen, wo einer deshalb gestraft wurde. das einzige was ich drauf sag is \"and when u lose u are probably the first to flame ;)\"\n\nund so ists meistens auch.","replies":[{"poster":"Temp1891534","date":"2020-02-26T12:09:47.101+0000","up_votes":1,"down_votes":0,"body":"Den Thread würde ich gerne sehen wo jemand fürs alleinige \"easy\" schreiben bestraft wurde.","replies":[]}]}]}]},{"poster":"Rena","date":"2020-02-25T10:43:45.474+0000","up_votes":1,"down_votes":2,"body":"Okay Permaban nach 3 mal finde ich jetzt übertrieben.\nDas Spiel ist ab 12 und es sind vorallem die Jüngeren die das schreiben.\nMir ist es ehrlich gesagt ziemlich egal.\nDie wollen eh nur ihr Ego boosten.","replies":[{"poster":"Megamaexx","date":"2020-02-25T11:11:20.176+0000","up_votes":1,"down_votes":0,"body":"Der letzte, von dem ich das Alter weiß und der das geschrieben hat, ist 22 oder 23.","replies":[]}]},{"poster":"Twîlight","date":"2020-02-25T10:57:12.376+0000","up_votes":2,"down_votes":10,"body":"Spiele bestehen seit Jahren daraus wer wenn zu erst tiltet gewinnt egal ob nun mit gg ez im Chat oder mit anderen Sachen die man schreibt wer sich davon runter ziehen lässt oder darauf eingeht ist für mich einfach nur Mental zu schwach PvP zu spielen egal ob das LoL oder ein anderes Spiel ist.\nFür mich gehört es nicht bestraft oder ähnliches da man sein Chat immer noch muten oder in aus dem Bild verschieben kann.","replies":[{"poster":"knofknof","date":"2020-02-25T11:24:09.276+0000","up_votes":1,"down_votes":0,"body":"Wenn das game bereits gelaufen ist noch mal kurz provozieren und die Lobby nach dem game kann man nicht muten. ","replies":[]},{"poster":"Megamaexx","date":"2020-02-25T11:20:44.430+0000","up_votes":5,"down_votes":1,"body":"Mhm, 2 Sekunden bevor das Spiel vorbei ist, tiltet man den Gegner nochmal, aber der hat ja noch 2 Sekunden Zeit, dich zu muten!","replies":[]}]},{"poster":"OOXRAMMSTEINXOO","date":"2020-02-25T14:58:13.892+0000","up_votes":2,"down_votes":14,"body":"Hast du einen kompletten Dachschaden?!? XD\nAlso erstens mal würde es uns nur halb so viel Spaß machen wenn sich die Leute da nicht so drüber aufregen würden.\nZweitens wird man im Leben auch nicht gleich ins Gefängnis gesteckt bloß weil man unhöflich ist. Komm einfach damit klar, dass es solche Leute gibt.\nIch persönlich schreibe es hauptsächlich wenn ich gecarried wurde. Eben weil es die Spieler so sehr aufregt und es ist auch immer wieder lustig, wenn sie sich dann genauso aufregen wie du es hier machst.\nAußerdem gibt bei vielen Sportarten (jetzt mal in real life) Trashtalk und das ist was ganz normales und gehört mittlerweile dazu.\nWer schlau genug ist, weiß dass die Spieler nur triggern wollen.\nZum Abschluss:\n\ngg ez\n\nbetter adc wins\n\nhow do i turn up bot difficulty?","replies":[{"poster":"knofknof","date":"2020-02-25T17:17:28.436+0000","up_votes":2,"down_votes":1,"body":"Warum genau muss man sowas tun?  Kannst du dich nicht einfach fair verhalten ?","replies":[]},{"poster":"Ráyleigh","date":"2020-02-25T15:18:37.169+0000","up_votes":3,"down_votes":1,"body":"So viel zum Thema Dachschaden{{sticker:zombie-brand-facepalm}}","replies":[]}]},{"poster":"CRGX Toplane","date":"2020-02-25T12:27:03.586+0000","up_votes":3,"down_votes":11,"body":"was eine Kinderkacke. Wenn dich jemand auf der Arbeit Spacken o.Ä, wird er ja auch net gefeuert. Wegen so einer Kleinigkeit Strafen zu fordern is traurig.\nGG EZ","replies":[{"poster":"knofknof","date":"2020-02-25T17:19:52.916+0000","up_votes":1,"down_votes":0,"body":"Ja macht nur keiner auf der Arbeit. Und wenn dann nur aus just for fun ironisch gemeint weil man sich kennt. \nAber mitten auf der Straße zu einem Unbekannten würde das niemand tun.","replies":[]},{"poster":"Megamaexx","date":"2020-02-26T16:05:41.823+0000","up_votes":1,"down_votes":1,"body":"Ein Kumpel hat sich mal irgendwas mit \"Schwuchtelzöpfchen\" anhören dürfen. Der, der das gesagt hat, hatte danach ein Personalgespräch mit seinem Vorgesetzten.","replies":[]}]},{"poster":"YΩsuo","date":"2020-02-25T12:04:50.534+0000","up_votes":3,"down_votes":10,"body":"Wie kann man sich nur von 4 Buchstaben so triggern, big Yikes. Werdet Erwachsen ...","replies":[{"poster":"knofknof","date":"2020-02-25T17:16:30.459+0000","up_votes":2,"down_votes":1,"body":"Aber in nem Game wie ein Kind benehmen ist in Ordnung?","replies":[]}]}]}