{"poster":"Lord Ojutai","date":"2018-04-27T04:06:24.065+0000","title":"Lag fantasma y desconeccion extraña","subforum":"Charlas Generales","embed":{"description":"Uploaded by xXClaudiosXx XD on 2018-04-27.","url":"https://www.youtube.com/watch?v=8HcTUxFCQMk","image":"https://i.ytimg.com/vi/8HcTUxFCQMk/hqdefault.jpg"},"up_votes":4,"down_votes":0,"body":"B&aacute;sicamente tengo como 35 de ping y se congelan los personajes los minions y bueno el personaje como que patina, llevo 3 partidas as&iacute;, reinicio el pc y nada, mas que nada es por las partidas me sale derrota y no es justo, deber&iacute;an considerar estas situaciones para derrotas evitadas. Al final se desenfoca pero bueno se aprecia igual.","replies":[{"poster":"ZeNch","date":"2018-04-27T04:25:22.930+0000","up_votes":1,"down_votes":0,"body":"Se llama perdida de paquetes","replies":[{"poster":"Lord Ojutai","date":"2018-04-27T05:18:02.293+0000","up_votes":1,"down_votes":0,"body":"La perdida de paquetes es el mismo lag, en los juegos online se usa protocolo udp, lo que claramente no es lo que sucede aqui, el internet que uso solo lo manejo yo y descargo a 10 mbps, mis oponentes me respondian lo mismo, por ejemplo al empezar la partida habian unos compañeros casi en la mitad del mapa y los demas no saliamos del inicio que esta cerrado unos segundos, ademas le esta pasando a la comunidad, es ovbio que hay un problema. tenia que ser justo hoy cuando queria subir de liga T-T","replies":[{"poster":"ZeNch","date":"2018-04-27T05:26:49.710+0000","up_votes":1,"down_votes":0,"body":"estas confundiendo cosas...\n\nLa perdida de paquetes no siempre va a originarse en tu RED hogareña (aunque a veces si, pero no es lo que hoy pasa, lo se) a veces se ocaciona en las Rutas por las que van tus paquetes sin importar si es udp o tcp o ftp o html o el protocolo que uses.\n\nY lo que vos veias era la desincronizacion/sincronizacion (y esto repetidamente) a causa de dicha perdida.\n\nLa perdida de paquetes te genera delay sin ms a veces (por que el paquete se reenvia varias veces hasta que llega) mientras que los ms marcan lo que tarda cada paquete en llegar a destino (sin contar perdida de paquetes).\n\nPor ende repito, es perdida de paquetes, NO TUYA si no en tu proveedor o en la ruta asignada para llegar al server. (en este caso)","replies":[{"poster":"Lord Ojutai","date":"2018-04-27T05:55:16.664+0000","up_votes":1,"down_votes":0,"body":"Entonces estamos todos de acuerdo con que tienen dramas en el server, cierto? Pero te aclaro una sola cosa los juegos online solo usan protocolo de udp nada mas. como sea algo les debe andar mal y esperemos lo solucionen pronto.","replies":[{"poster":"ZeNch","date":"2018-04-27T06:03:31.862+0000","up_votes":1,"down_votes":0,"body":"no en realidad, si a mi me funciona y a vos no hay 2 opciones: La partida de alojo en diferente segmento del server **O** el problema esta en la Ruta y/o proveedor.\n\nEn este caso a mi me anda perfecto en toooodas las partidas que entro.\nAsi que descarto el server, apuesto a problema de rutas, si es un aliado de RiotDirect el problema si es de Riot pero no del server.\n\nAviso, soy argentino.","replies":[{"poster":"Lord Ojutai","date":"2018-04-27T07:08:46.643+0000","up_votes":1,"down_votes":0,"body":"Jugué 4 partidas, 3 de las cuales tuve ese drama, 2 de mis compañeros tenían el mismo problema y dos oponentes también, lo discutíamos en el chat, quizá debí ser mas exacto con la información, y en el chat general también hay gente con lo mismo, pero puede que el problema sea en este lado, chileno por cierto.","replies":[{"poster":"ZeNch","date":"2018-04-27T07:15:58.109+0000","up_votes":1,"down_votes":0,"body":"Lo se, te creo pero no es del server si no seria mal para todos o para todos en X partida... explico:\n\nEl servidor tiene subdivisiones (servidores hijo digamosle) en cada hijo se encuentran varias partidas a la vez...si a uno de esos hijos le falla no le va a andar a ningun jugador dentro de la misma partida. Si le falla al server entero a nadie le andaria.\n\nLo que vos me decis suena a rutas colapsadas (no malas rutas, si no rutas con problemas o colapsadas)\n\nSi Riot tiene contratada dicha ruta para que los ISP la usen y falla es culpa de Riot pero no del server, de la ruta.\n\nEspero que diferencies la idea, no es el servidor es la ruta... es problema de riot? depende de si estaba en acuerdo con Riot Direct.","replies":[{"poster":"Lord Ojutai","date":"2018-04-27T07:24:16.326+0000","up_votes":1,"down_votes":0,"body":"Mira hay varios así y parece ser en Chile el drama, como sea ojala que se movilicen pronto con el asunto.\n\n\nProblema de conexión del server\nSilvan (LATS)\nenviado about 4 hours ago en Ayuda y soporte\n\nAl parecer desde hace unas horas el server está con problemas. He estado en dos partidas donde de la nada se pierden animaciones, desaparecen personajes, se pegan los minions y el juego se actualiza después de varios segundos.\nEn la última partida, estaba jugando con dos amigos, cada uno en su casa, y a los 3 nos dio el mismo problema, conectándose y desconectándose a cada rato.\nEl juego no me mostraba ni problemas de fps ni de ms (110 fps y 12 ms fijos), y a mis amigos tampoco.\n\nLos 3 somos de Chile, dos tenemos el mismo proveedor (movistar), pero el otro tiene uno distinto (claro), así que creo que es un problema del servidor.\n\nLo que me parece raro es que a pesar de que el problema lo vengo llevando desde hace ya unas horas, aún no hay mensaje de advertencia al respecto, y por lo que sale en el foro hay unas personas reportando el mismo problema.\n\nPodrían activar por lo menos derrota perdonada para quienes están el clasificatoria? con mis amigos jugamos un normal, así que no fue mucho, pero hay gente perdiendo LP y no hay advertencia del problema.","replies":[{"poster":"ZeNch","date":"2018-04-27T13:16:01.890+0000","up_votes":1,"down_votes":0,"body":"Para mi es una ruta que queres que te diga si fuera el server nos andaria a mal a todos de todos los paises (en lats)","replies":[{"poster":"The Alex17","date":"2018-04-27T15:17:13.885+0000","up_votes":1,"down_votes":0,"body":"Fue en Chile el problema para los demas les iba bien el problema era a todo Chile seguramente se cayo un servidor","replies":[{"poster":"ZeNch","date":"2018-04-27T15:22:32.900+0000","up_votes":1,"down_votes":0,"body":"*Una ruta\n\nLas alpacas atacan, version nocturna.","replies":[{"poster":"The Alex17","date":"2018-04-28T03:01:06.378+0000","up_votes":1,"down_votes":0,"body":"Cada vez tienen mas armamento de infiltracion las alpacas no me sorprenderia que un dia de estos lo hagan caer para siempre","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Sirek","date":"2018-04-27T12:23:26.183+0000","up_votes":1,"down_votes":0,"body":"Como dijo el comparito, es perdida de paquete. Estos pueden ser los motivos y como solucionarlos. \n\n>Nivel de la señal del módem: Tu módem requiere una señal que no sea demasiado alta o demasiado baja para funcionar debidamente. Cada tipo de módem tiene un rango de señal óptimo distinto. Si la señal de tu proveedor de servicios de Internet se sale de ese rango, es posible que experimentes desconexiones y otros problemas de rendimiento que parecen ocurrir aleatoriamente, debido a pequeñas cantidades de datos ilegibles. Ten en cuenta que los niveles de tu señal pueden estar bien cuando no estás usando tu red, pero cambian cuando juegas a un juego como LoL.\n\n>Intenta contactar a tu proveedor de servicios de Internet para solicitar una comprobación de los niveles de la señal mientras juegas a LoL. Asegúrate de que usas el módem en su máxima capacidad mientras se efectúan estas comprobaciones.\n\n>Hardware dañado: Si alguna pieza del hardware de red entre tu PC, los servidores de LoL u otros jugadores está dañada, puede introducir problemas de pérdida de paquetes. Este problema no es siempre visible.\n\n>Intenta reemplazar/probar los dispositivos de red en tu casa. Es posible que quieras contactar a tu proveedor de servicios de Internet para preguntarlo sobre los problemas de la infraestructura de hardware en tu barrio.\n\n>Congestión en la red: A veces, cuando la red está sobrecargada, para prevenir un fallo catastrófico algunos paquetes se eliminarán por completo. Esto puede ocurrir en la red de tu casa o en el Internet público.","replies":[]},{"poster":"Diatoms","date":"2018-04-27T04:10:49.913+0000","up_votes":1,"down_votes":0,"body":"me pasa lo mismo parece que es por Movistar, jugadores VTR sin problemas","replies":[{"poster":"Lord Ojutai","date":"2018-04-27T04:14:12.446+0000","up_votes":1,"down_votes":0,"body":"ocupo entel y jamas me habia dado algun prioblema.","replies":[{"poster":"Hi Im Sion Baby","date":"2018-04-27T05:17:20.289+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Ojutai,realm=LAS,application-id=v7qsfXsE,discussion-id=I0HAMibF,comment-id=00000000,timestamp=2018-04-27T04:14:12.446+0000)\n>\n> ocupo entel y jamas me habia dado algun prioblema.\n\nEs mejor claro","replies":[{"poster":"rokoto96","date":"2018-04-27T05:34:53.917+0000","up_votes":1,"down_votes":0,"body":"tengo claro y me pasa exactamente lo mismo {{sticker:cass-cry}}","replies":[{"poster":"Hi Im Sion Baby","date":"2018-04-27T05:40:31.770+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rokoto96,realm=LAS,application-id=v7qsfXsE,discussion-id=I0HAMibF,comment-id=0000000000010000,timestamp=2018-04-27T05:34:53.917+0000)\n>\n> tengo claro y me pasa exactamente lo mismo {{sticker:cass-cry}}\n\nBueno No se ahi","replies":[]}]}]},{"poster":"Diatoms","date":"2018-04-27T04:15:33.763+0000","up_votes":1,"down_votes":0,"body":"macanuo","replies":[]}]}]}]}