{"poster":"LG bumper","date":"2017-11-29T08:56:57.145+0000","title":"Champions sammeln, jetzt schwieriger?","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":1,"body":"Ich spiele das Spiel jetzt schon eine ganze Weile und brauch nurnoch ca 30 Champions bis ich alle habe. Aber in letzter Zeit hab ich das Gef&uuml;hl das es immer schwieriger wird an Champions ranzukommen.. Zum ersten mal als das BE System releaset wurde und ich das Gef&uuml;hl hatte nicht mehr wirklich BE zu verdienen dadurch das es quasi kein &quot;Instant Reward&quot; mehr ist. Dann kam noch dazu das man 3 Champion Shards nichtmehr zu einem zuf&auml;lligen Champion verschmelzen kann. Und nun haben sie auch noch den Zuf&auml;lligen Champion Token entfernt den man sich f&uuml;r 3900 BE kaufen konnte. Meine Frage ist jetzt, ist das nur ein Gef&uuml;hl das es jetzt schwieriger ist? Oder stimmt es vielleicht wirklich?\r\n\r\nSchreibt eure Meinung und Erfahrungen dazu gerne hierdrunter, dann k&ouml;nnen wir dar&uuml;ber mal diskutieren.","replies":[{"poster":"Abasin","date":"2017-11-30T07:51:54.092+0000","up_votes":1,"down_votes":0,"body":"Wenn man nicht gerade sammelwütig ist, kann man auf die fehlenden Championshards einfach warten. Bei mir sammeln sich derzeit viele an, ich bin aber auch gut ausgestattet. Einige Champions kann/mag ich einfach nicht, Meta hin oder her. Die hole ich nur, wenn ich wirklich genug Zeug habe. Aber selbst die Low price Champions wie Master Yi - bin fast drei Jahre ohne ihn ausgekommen - habe ich noch nicht alle. Was juckt mich Garen oder Nunu?","replies":[]},{"poster":"404 Clone","date":"2017-11-29T21:15:43.280+0000","up_votes":1,"down_votes":0,"body":"Naja ich habe 80% aller meiner Levelups sogut wie 2 450 champs meistens bekommen, also für mich ist es schwerer","replies":[]},{"poster":"manial fly","date":"2017-11-29T10:30:34.010+0000","up_votes":1,"down_votes":0,"body":"Ich bin grad in einer Zwickmühle. Mir fehlt etwa die Hälfte der Champs und bei den letzten Level Ups hab ich es so gehandhabt nur die Splitter umzuwandeln für Champs die ich schon besitze. Das Ende vom Lied ist ich komme etwa nur halb so viele Essenzen und hab aber nun 10 Championssplitter wovon ich 9 zur Zeit gar nicht haben will. Von den 5-6 Champs die ich gern hätte hatte ich noch keinen in einer Kapsel.\nDemnach bekomme ich zur Zeit i.wie gar nichts. Mir wär liebet Riot würde die BE direkt verteilen anstatt in Form von Splittern. Dann wäre ich auch nicht gezwungen alle Champs die ich noch nicht hab aufzubewaren damit ich sie i.wann mal billiger bekomme.","replies":[{"poster":"SirPlautzeLot","date":"2017-11-29T13:11:58.419+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=manial fly,realm=EUW,application-id=YnZkMR0R,discussion-id=aXOEPAXU,comment-id=0003,timestamp=2017-11-29T10:30:34.010+0000)\n>\n> Ich bin grad in einer Zwickmühle. Mir fehlt etwa die Hälfte der Champs und bei den letzten Level Ups hab ich es so gehandhabt nur die Splitter umzuwandeln für Champs die ich schon besitze. Das Ende vom Lied ist ich komme etwa nur halb so viele Essenzen und hab aber nun 10 Championssplitter wovon ich 9 zur Zeit gar nicht haben will. Von den 5-6 Champs die ich gern hätte hatte ich noch keinen in einer Kapsel.\n> Demnach bekomme ich zur Zeit i.wie gar nichts. Mir wär liebet Riot würde die BE direkt verteilen anstatt in Form von Splittern. Dann wäre ich auch nicht gezwungen alle Champs die ich noch nicht hab aufzubewaren damit ich sie i.wann mal billiger bekomme.\n\nDann hast du doch Glück, mir fehlen auch noch ca. die Hälfte aller Champs, weil ich seit Season 3 nicht mehr gespielt hatte und nur einige wenige in den letzten 2-3 Monaten mit IP erspielt habe. Allerdings habe ich bei meinen 6 Leveln bisher nur Splitter von Champs bekommen, die ich schon besitze. Bei den ersten 3 Leveln sogar nur Champs, die im Starterpaket, das ich damals für die digitale CE bekommen hatte, eh dabei waren.","replies":[{"poster":"manial fly","date":"2017-11-29T13:19:03.007+0000","up_votes":1,"down_votes":0,"body":"Naja aber wenn du nur welche bekommst die du schon hast kannst du sie wenigstens getrost platt machen und bekommst dafür die vollen Essenzen. Ich bekomm ja nur Champs die ich im Moment nicht haben will, aber bin eben in dieser Zwickmühle das ich sie nicht platt machen will damit ich sie mir dann i.wann mal vergünstigt holen kann. Nur das ich nun unterm Strich keine Champs bekomme, weil die richtigen nicht dabei sind und kaum BE bekomme weil ich nur das platt mache was ich schon hab.","replies":[]}]},{"poster":"Qbert","date":"2017-11-29T10:53:47.270+0000","up_votes":1,"down_votes":0,"body":"Selbst wenn du die Champs nicht haben willst, solltest du sie mMn für BE kaufen.\nDenn damit steigt die Chance die Shard für die Champs zu bekommen, die du möchtest.\n\nDas ist aber nur meine persönliche Sicht der Dinge.","replies":[{"poster":"manial fly","date":"2017-11-29T11:41:13.716+0000","up_votes":1,"down_votes":0,"body":"Naja mein Gedanke ist wenn ich i.wann mal alle Champs die mir fehlen als Splitter besitze mach ich \"mehr\" gewinn. Ich kann dann alles was ich als Splitter bekomme platt machen und mir jeden Champ vergünstigt zulegen.\nBedauerlicherweise bekommt man aber nur sehr selten nen 4800er oder 6300er Champ. Heißt also bis ich mal alle 6300er die mir noch fehlen als Splitter habe, hat ich wohl schon jeden 450er Splitter 20 mal. Ich finde man sollte das System so angleichen das man zumindest für jeden Champ die gleiche Chance hat ihn zu erhalten. Ich hatte letztens in einer Kiste zwei mal nen Garen Splitter, das ist doch echt witzlos...","replies":[{"poster":"Sirrkas","date":"2017-11-29T11:46:13.139+0000","up_votes":1,"down_votes":0,"body":"Ein paar Splitter zu den Champs, die man schon hat, sollte man vielleicht behalten. Mastery 7 kostet 3900 BE. Also vorausgesetzt, es ist ein Champ, den man im Masterysystem hochbringen will.","replies":[{"poster":"manial fly","date":"2017-11-29T12:25:26.972+0000","up_votes":1,"down_votes":0,"body":"Was hat das denn mit Mastery 7 zu tun?","replies":[{"poster":"Sirrkas","date":"2017-11-29T13:16:43.093+0000","up_votes":1,"down_votes":0,"body":"Masteryranking benötigt BE oder Championsplitter. Championsplitter werden in BE umgewandelt oder in Champions aufgewertet.   Da neue Champs und Mastery die selben Resourcen benötigen, ist es hier sinnvoll so zu planen, dass man weniger BE benötigt, vorausgesetzt, man will die Masterylevel erhöhen.","replies":[]}]}]}]}]}]},{"poster":"Kiimahrii","date":"2017-11-29T11:13:17.776+0000","up_votes":1,"down_votes":0,"body":"Besonders einfacher ist es, wenn man nicht viele Champions besitzt bzw überwiegend günstige, da die Chance auf eine Ersparnis als auch die Ersparnis selbst durch den Kauf eines zufälligen Championssplitters für 3950BE sehr groß ist.\n\nDie Chance den \"passenden\" Splitter für einen fehlenden Champion zu erhalten verringert sich allerdings, je mehr Champions man hat. Dadurch kann man weniger bzw seltener zu der Preisvergünstigung greifen.\n\nWenn einem nur noch weniger als 10 Champions fehlen, kann man nicht länger einen zufälligen Championsplitter kaufen. Die letzten Champions die einen fehlen sind idR teure Champions, die einem nicht so sehr interessiert haben. Da die Chance auf den jeweiligen Splitter beim Level Up sehr gering ist, ist man \"fast\" gezwungen den vollen Preis an BE zu zahlen, wenn man diese freischalten möchte.\n\nDurch die neuen Änderungen wie man BE erhält ist es unheimlich luxuriös sich einen teuren Champion für den vollen Preis zu kaufen, da die erhaltene BE beim Level up immer \"ungefähr\" den selben Wert entspricht und ansonsten nur der FWOTD geringfügig dazu beiträgt.\n\nIch persönlich bin mit den Änderungen sehr unzufrieden. Die vielen einmaligen Vergütungen die wir beim Pre-Season-Start erhalten sind tatsächlich keine Entschädigungen für das bisher Erarbeitete gewesen, sondern meiner Hinsicht nach eher ein Trick damit die \"Grind- bzw Preiserhöhung\" vertuscht wird.\n\nNatürlich ist man nicht \"gezwungen\" alle Champions zu besitzen und wer danach strebt hat gerade eher  ein \"First World Problem\".","replies":[]},{"poster":"ELOW Cronos","date":"2017-11-29T09:43:01.768+0000","up_votes":1,"down_votes":0,"body":"Also ich hab bislang den Eindruck das Leute die nur 1-3 Games am Tag machen wohl schneller Champions kriegen als früher, Leute die mehr zocken kriegen eher weniger IP pro Game (da sich da der \"first win of the day\" auf mehr Games verteilt).\n\nKann das aber jetzt nicht belegen, aber man könnte bestimmt irgendwie die durchschnittlichen IP pro Games ausrechnen und mit früher vergleichen.","replies":[{"poster":"Qbert","date":"2017-11-29T09:44:04.479+0000","up_votes":1,"down_votes":0,"body":"Ja, das ist tatsächlich so und hat Riot bereits vor Preseason auch angekündigt.\nGelegenheitsspieler sind nun etwas im Vorteil.","replies":[{"poster":"ELOW Cronos","date":"2017-11-29T09:46:32.548+0000","up_votes":1,"down_votes":0,"body":"Finde ich eigentlich komisch, da ich zumindest annehme das der Grossteil von Riots zahlender Kundschaft keine Gelegenheitsspieler sind.\n\nEdit: Vielleicht ist auch der Gedanke, dass gerade diese Spieler dann eher RP für Champs ausgeben.","replies":[{"poster":"7deadLeeSlnz","date":"2017-11-29T11:11:04.894+0000","up_votes":1,"down_votes":0,"body":"Riot meinte in einem Post, dass der durchschnittliche Spieler 4 Spiele pro Tag macht.","replies":[]},{"poster":"Sirrkas","date":"2017-11-29T11:06:03.536+0000","up_votes":1,"down_votes":0,"body":"Laut der Aussage von Riot, profitieren jetzt die meisten davon und nur die wenigsten spielen so viel, dass sie jetzt weniger BE als vorher IP erhalten würden. Die Grenze liegt bei etwa 8 Spielen am Tag, wird hier aber wohl auch von der Dauer der Matches abhängen. \n\n>Just so we're covering all our bases, let's look at an exceptional example: a player that plays eight games on average for every FWotD that they earn. This person puts in serious work on League, regularly putting in eight games in a row. How do they fare in the new system compared to the old one?\n>\n>Even in this case, it's pretty close. How close? It's a total of just 2,300 BE less after 2,200 games. This disparity in earn rates between those who play many games per day and those who play slightly fewer is not new to League—we've always thought the FWotD bonus was worth including because it incentivizes players to regularly log in and jump into games. Players like this are still leveling faster than anyone else in the new system, and they'll get the new unique leveling rewards before anyone else (and the swag factor that comes with them).\n>\n>It comes down to this: For the vast majority of players, this system will give out more currency on average than you would've gotten in the old IP-based world. \n\n[Quelle](https://boards.na.leagueoflegends.com/en/c/developer-corner/hAaYMrEs)","replies":[]},{"poster":"Qbert","date":"2017-11-29T09:49:30.421+0000","up_votes":1,"down_votes":0,"body":"Nun, es gibt keine Zahlen ... aber der Unterschied soll wohl nicht sooooo massiv sein ... musst du eben noch etwas mehr spielen.\nAber natürlich will Riot auch Geld verdienen, kann man ihnen ja nicht verübeln.\n\nIch finde, viele sehen das viel zu eng ... wenn ich mehr will, muss ich eben mehr tun, das ist überall so.","replies":[]}]}]}]},{"poster":"Sirrkas","date":"2017-11-29T11:00:44.799+0000","up_votes":1,"down_votes":0,"body":"Laut den Berechnungen von Riot, verdient man noch so schnell BE wie davor IP, solange man nicht mehr als 8 Spiele am Tag absolviert. Liegt man darunter, geht es schneller, da der Tagessieg viel Gewicht hat. \n\nJa, der 3 zu 1 Tausch, fällt jetzt weg. Aber wenn ich 5 Championshards mit einem Wert von 90 BE erhalte, wären das ja schon fast 2 zufällige, Champions gewesen, weshalb das eben entfernt wurde. \n\nDazu musst du noch unterscheiden, die Option für 3950 BE einen zufälligen Champion zu erhalten, gibt dir genau das, einen zufälligen Champion. Davor musste man sich 3 Championshards für je 1700 IP kaufen, um einen zufälligen Champion zu erhalten. Hier hatte man lediglich noch die Chance \"Glück\" zu haben und billige Champshards zu ziehen, da es dann BE oben drauf gab. \n\nInsgesamt wird man jetzt wohl etwas schneller an Champions kommen, auch wenn es sich etwas holpriger anfühlt, da man nur noch bei Stufenaufstiegen BE erhält. Leider geht die Option für 3950 BE einen zufälligen Champion zu erwerben nur, wenn man noch 10 übrig hat. Da war im vorherigen System ein Vorteil für die Leute, die fast alle Champions haben. Wenn ein neuer kam, konnten die einfach für 5100 IP Champshards kaufen und die eintauschen.","replies":[]},{"poster":"Critical lmpact","date":"2017-11-29T09:20:42.526+0000","up_votes":1,"down_votes":0,"body":"Ich kann meine Aussage jetzt auf die schnelle leider nicht belegen, aber m.E. fühlt es sich nur langsamer an. Langfristig wirst du genau so schnell an Champs kommen wie vor der PreSeason","replies":[{"poster":"Megamaexx","date":"2017-11-29T09:54:56.397+0000","up_votes":1,"down_votes":0,"body":"Wenn man wenige Champions hat, kommt man billiger an Champions, die man noch nicht hat, da Championshards eine Vergünstigung des Preises bedeuten. Der Prozess verlangsamt sich mit der Zeit, da man mit abnehmender Häufigkeit Championshards von Champions bekommt, die man nicht hat. Ob das insgesamt schneller geht, kann ich nicht wirklich beurteilen. Das Rerollen der 3 Championshards für einen neuen Champion hat allerdings ziemlich viele IP gespart, was ja jetzt nicht mehr möglich ist. Ich glaube, wem nicht mehr viele fehlen, der ist jetzt leicht im Nachteil","replies":[]},{"poster":"Qbert","date":"2017-11-29T09:23:09.788+0000","up_votes":1,"down_votes":0,"body":"Das bezieht sich gemäß Riot aber nur auf \"Gelegenheitsspieler\", der sog. \"Vielspieler\", der mehrere Spiele pro Tag macht(Menge nicht von Riot definiert) kommt wohl etwas kürzer als früher.","replies":[]}]},{"poster":"Miniphiri","date":"2017-11-29T09:25:19.103+0000","up_votes":1,"down_votes":2,"body":"ja weil riot will das du rp kaufst fürs champion kaufen. punkt","replies":[{"poster":"OT Riku","date":"2017-12-02T06:50:18.222+0000","up_votes":1,"down_votes":0,"body":"Und jetzt nochmal auf deutsch xD","replies":[]}]}]}