{"poster":"GhostOfTsushima","date":"2016-09-19T01:12:32.143+0000","title":"#PickOrder or #FuckAutoFill","subforum":"Gameplay","up_votes":2,"down_votes":8,"body":"Yeah let&#039;s go LoL Community\r\n\r\nlet Riot know what you think of Auto-Fill\r\n\r\nnow you get people to play role they don&#039;t main LOL","replies":[{"poster":"Eedat","date":"2016-09-19T01:25:34.496+0000","up_votes":5,"down_votes":0,"body":"It's funy because you used to have to have a basic concept of every role to play ranked period. Now people throw massive hissy fits over occasionally not getting to play just 2.\n\nThen you get this guy who thinks Pick Order will mean he gets his role more often than the current system. What a joke","replies":[{"poster":"CrazedPorcupine","date":"2016-09-19T01:29:50.266+0000","up_votes":3,"down_votes":0,"body":"I don't give a fuck about auto fill in ranked, but Riot originally only put in Autofill at Diamond level + to help ensure queue times wouldn't get too bad. THen they extended it to all of the ranks. Okay that's fine. As a support main, i play support often enough that autofill isn't normally an issue.\n\nBUT THEY FUCKING PUT IT IN FUCKING NORMALS. I PICK NORMAL DRAFT TO ENSURE I CAN GET A ROLE I WANT SO I CAN PRACTICE ROLES I'M NOT GOOD AT.\n\nI don't want auto-fill in fucking normals. I don't give a flying fuck at all about ranked, but when it shows up in normals when I'm trying to fucking practice other lanes, or when I DO NOT EVER WANT TO TOUCH SUPPORT WITH A 250 FOOT POLE, IT PISSES ME THE FUCK OFF.\n\nI QUIT playing support for a reason, I don't want to keep getting shoved into it because no one can be bothered to fucking play support, and everyone in this game is full of incompetant fuckwads that have no idea how to fucking play.","replies":[{"poster":"Eedat","date":"2016-09-19T01:38:19.345+0000","up_votes":1,"down_votes":1,"body":"Ok, so tell me. How is pick order going to get you your role more in Norms? Or have you already forgotten being forced into other roles was **WAY** more common back then?","replies":[{"poster":"CrazedPorcupine","date":"2016-09-19T01:46:28.396+0000","up_votes":2,"down_votes":0,"body":"I'm not saying that Pick Order was better, but I'd much rather wait a few minutes longer to ensure I get the role I WANT to play rather than have riot decide, \"Fuck, this queue is going on way too long, we need to force someone to auto fill a role they DEFINITELY don't want so that we can get a game going\"","replies":[]}]},{"poster":"Wulf Helhammer","date":"2016-09-19T01:57:52.010+0000","up_votes":1,"down_votes":0,"body":"Actually no. When autofill was activated, it turned on for all elos. What was in the recent patch notes was autofill for normal draft","replies":[{"poster":"CrazedPorcupine","date":"2016-09-19T03:53:53.447+0000","up_votes":1,"down_votes":0,"body":"if you actually read what I wrote, I don't care about Auto Fill in ranked, I care about the fact that it's in Normals too.","replies":[]}]}]}]},{"poster":"specter424","date":"2016-09-19T01:54:59.590+0000","up_votes":2,"down_votes":0,"body":"I troll when there is autofill. If I select 2 roles that I want to play its because I want those roles, not the garbage role nobody wants to play. If I can't enjoy the game playing what I WANT then no one else will either.","replies":[]},{"poster":"CrazedPorcupine","date":"2016-09-19T01:14:39.761+0000","up_votes":2,"down_votes":1,"body":"I actually uninstalled the game over autofill.\n\nI wanted to go top/mid so I could practice my Yorick or Ryze, and then I get shoved support, with a team that had literally 0 fucking idea of what they were doing. Sivir had no idea how to duel, Volibear had no idea how to fucking gank, and a Teemo top that rushed a fucking Cull and Executioner's calling.","replies":[]},{"poster":"Deflum","date":"2016-09-19T02:41:29.308+0000","up_votes":1,"down_votes":0,"body":"As a support main, i love auto fill in ALL modes (both ranked and normal) since when i want to play something else, im guaranteed my role since i have auto-fill protection. While i do dislike 99.99999999999999999999999999999999999999999999999% of all ADC's i get, i do find some half decent ADC's that i have great synergy with. \n\nTips for playing support in norms: Play Janna. She is a freelo support that can make plays as a support and save everyone or knock up the proper target to save an ally/ secure a kill from a runner.\n\nI hope you have a wonderful day, fellow Support main. :D","replies":[]},{"poster":"Koala Frenzy","date":"2016-09-19T01:36:26.570+0000","up_votes":1,"down_votes":0,"body":"The client says I'm guaranteed one of my roles because I recently autofilled. But I choose to play support EVERY game. How do I get autofilled into my selected role? o.O","replies":[]},{"poster":"EndlessSorcerer","date":"2016-09-19T01:26:59.616+0000","up_votes":1,"down_votes":0,"body":"I wouldn't mind autofill quite so much if it wasn't almost constantly active for me.\n\nI can't remember the last time it wasn't enabled when I went to queue for a game.","replies":[]},{"poster":"oSEXYPLATYPUSo","date":"2016-09-19T01:44:40.732+0000","up_votes":1,"down_votes":1,"body":"or how bout the community just be a bunch of good sports and just play 1 out 6 games as support ( of course you have support mains) for those who normally dont play support , just 1 out of 6 be  a pal queue up for support and then the queue times would go down, there would be no need for auto fill \n\nbut we cant and we wont cuz we are all selfish bastards","replies":[]}]}