{"poster":"Schasan","date":"2015-10-06T13:36:55.109+0000","title":"Warteschlangensperre und Rankedliegenpunkte VERLUST weil VERNÜNFTIG?!","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":4,"body":"Wollte gearde ein ranked starten damit ich noch vor seasonende plat komme.... dann bekommt man teammates die von anfang an rumflamen... (naja passiert leider(ab und an mach ich das auch (leider))), ABER DANN bekommt man 2 teammates im team die trollen müssen. ich war 1 pick supp UND NIEMAND anders hat eine lane geschirben... also 2. und 3. pick jungle und mid... und dann gehts los 4. und 5. pick taric und teemo (adc? und top? gut top is ja m&ouml;glich mit teemo oder taric auch wenns nicht in der meta is adc jedoch nicht) ABER BEIDE NEHMEN CLARITY AND CV(CLEAR VISION) mit (also 100% troll) und nachdem ich bis zur allerletzten sekunde gewartet habe in der hoffnung dass sie es &auml;ndern bzw jmd leavt hab ich mich dazu entschieden zu leaven da das Ende schon vorherbestimmt war...\nAm Schluss bekomm ich die sperre verliere lp und dass blo&szlig; weil ich meine zeit nicht mit den 2 idioten(ist glaube in dem fall angemessen)verbringen wollte. Und sie bekommen keinen schaden..\nNein ich wei&szlig; nicht wie man sowas generell l&ouml;sen kann aber ich finde es NICHT FAIR wie es jetzt ist! bloß weil man MAL der vernünftige ist..","replies":[{"poster":"HyperionCH","date":"2015-10-06T13:44:07.137+0000","up_votes":1,"down_votes":0,"body":"Deshalb mein Tipp:\n\n- Nicht dodgen!\n\nDann ist die Strafe (LP-Verlust) vielleicht etwas höher, aber der Troll/Flamer wird auch bestraft und zwar stärker:\n\n- Er verliert schliesslich jedes Game, bei dem er trollt/flamet (du nur in diesem Game)\n- Er wird reportet und bekommt rasch eine CR/RR/einen ban\n\nWas denkst du, wie lange diese Spieler so etwas noch tun, wenn sie jedes Mal 20 LP verlieren und dann noch z.B. 35 Normal-Draft-Picks gewinnen müssen, bis sie wieder Rankeds spielen können?\n(selbst wenn sie sich nicht ändern, so landen sie entweder in Bronze 5 oder bekommen einen perma; was zuerst zutrifft)","replies":[{"poster":"LZ Flame","date":"2015-10-06T14:04:19.385+0000","up_votes":1,"down_votes":0,"body":"Ich war ja auch schon immer ein Fan von Auge um Auge,also kann ich diese Logik auch im Ranked anwenden er hat meine Position genommen so nehm ich dann auch seine?","replies":[{"poster":"Fermi Paradox","date":"2015-10-06T14:06:59.305+0000","up_votes":1,"down_votes":0,"body":"Welche Logik? Was du da gerade bescheibst, hat rein gar nichts mit Hyperions Aussage zu tun.","replies":[{"poster":"LZ Flame","date":"2015-10-06T14:21:06.632+0000","up_votes":1,"down_votes":1,"body":"Wenn du mir schaden willst also das ich das game für dich dodge soll,werde ich das game für uns beide verlieren","replies":[{"poster":"Fermi Paradox","date":"2015-10-06T14:24:52.693+0000","up_votes":1,"down_votes":0,"body":"Nein, so ist das nicht gemeint. Er meinte damit: Wenn er trollen will, dann spiel das Spiel ganz normal und reporte ihn am Ende fürs trollen.\nDenn wenn man verliert, dann ist es der CV-Clarity-ADC-Taric, der absichtlich feedet.\n\nUnd nicht man selbst, wenn man ganz normal spielt und den \"Troll\" einfach machen lässt.","replies":[{"poster":"LZ Flame","date":"2015-10-06T14:28:42.312+0000","up_votes":1,"down_votes":0,"body":"tja aber wieso sollte ich dann einfach spielen wenn ich das spiel zu 90% verliere?was habe ich davon ob der troll gebannt wird oder nicht ist für mich doch irelevant ich verliere 20 lp und villeicht 20-30m meines lebens wo ist da für mich der nutzen dabei?\n\nEdit:Hab meinen namen geändert von milllstephano zu diesen namen xD\n","replies":[{"poster":"Waldschrat86","date":"2015-10-06T14:58:12.150+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Singed 2 Master,realm=EUW,application-id=YnZkMR0R,discussion-id=oIw6L8Es,comment-id=000000000000000000000000,timestamp=2015-10-06T14:28:42.312+0000)\n>\n> tja aber wieso sollte ich dann einfach spielen wenn ich das spiel zu 90% verliere?was habe ich davon ob der troll gebannt wird oder nicht ist für mich doch irelevant ich verliere 20 lp und villeicht 20-30m meines lebens wo ist da für mich der nutzen dabei?\n> \n> Edit:Hab meinen namen geändert von milllstephano zu diesen namen xD\n\n \n1. Man kann das gewinnen, genauso wie man ein normales trollfreies Spiel verlieren kann.\n\n\n1. Tja was hast du davon, evtl. weniger dieser Momente, weil die Trolle Konsequenzen spüren? Aber klar nach mir die Sintflut. Das denken sich die Trolle übrigens auch. Egohell halt.\n\n\n3. Beim Dodgen verlerst du auch LP und Zeit, schon der 2. Dodge \"lohnt\" nicht mehr, wenn es am selben Tag passiert.\n\n4. Mal die Zeit gestoppt von Client schließen+Neustart+Wartezeit+neue QZeit+neue CS+Spielladezeit- Na wie viel kommt dabei rum? 15-20 Minuten oder noch länger, + jeweils 5 Minuten, wenn wieder jemand ganz am Ende der CS leavt- Zeitersparnis sieht für mich anders aus.\n\n5. Beim dodge verlierst du zwar weniger LP aber deine MMR steigt oder sinkt auch nicht. Bei einem Lose hättest du dann zwar mehr LP verloren, aber dadurch, dass dann auch deine MMR sinkt, ist dann halt auch das nächste Spiel wieder potentiell einfacher.\nAber gut jedem das seine, ich hätte z.B. keinen Bock auf 97LP zu stehen und weil ich dann noch nen extrawin brauche mit höherer MMR als nötig für die Promo diese zu spielen. So krass werden die Auswirkungen zwar nicht sein, dennoch macht man sich damit seine Promos schwerer. Oder mach ich da einen Denkfehler?","replies":[]},{"poster":"HyperionCH","date":"2015-10-06T15:09:01.612+0000","up_votes":1,"down_votes":0,"body":"Wie bereits von mir erwähnt:\n\n- Dodgen fördert das Trolling in der ChampSelect (weil es funktioniert, wenn jemand dodged)\n\nDu vielerst vielleicht 20 LP, wenn du nicht dodged (sofern der Troll nicht selber dodged bzw. falls ihr nicht gewinnt).\nBeim Dodgen verlierst du - glaube ich - 5 LP (mehr, wenn man öfters dodged). Wenn durchs Dodgend aber 5x mehr Trolls in der ChampSelect sind, musst du 5x öfter dodgen. Das sind dann 25 LP Verlust.\n\nWie gesagt:\nWas denkst du, wie oft ein Troll noch dieses Spiel macht, wenn nie jemand dodged? Er landet ja sonst irgendwann in Bronze V, weil er in jedem Game 20 LP verliert (du nur einmalig); natürlich nur, wenn er nicht vorher einen perma kriegt. ;)\n\nIch kann mir nicht vorstellen, dass ein Troll - der meistens selber gewinnen möchte (trollt z.B., um seine Main-Lane zu bekommen) - so etwas länger tut. Spätestens, wenn er 2-3 Divisionen abgestiegen ist, wird er wohl damit aufhören.","replies":[]},{"poster":"Fermi Paradox","date":"2015-10-06T14:40:36.076+0000","up_votes":1,"down_votes":0,"body":"also den Namen zu einem Champion, den man spielt, zu ändern, ist ziemlich kritisch.\nEs gibt immer wieder Menschen, die diese Champions dann absichtlich bannen :P\n\nNach dem Grund fragst du, ja? Ich würde sagen....Genugtuung^^ Und gebannte Trolls sind Abschreckung für andere Trolls, das heißt, wenn das jeder tut, werden immer weniger Leute trollen. Darum sollte man mit gutem Beispiel vorangehen.","replies":[{"poster":"LZ Flame","date":"2015-10-06T14:54:57.043+0000","up_votes":1,"down_votes":0,"body":"wieso sollte jemand im eigenen Team den champ bannen?was hätte man davon? spaß,freude? ich hab nen Champion pool der ist groß genug von daher wäre es halb so wild.","replies":[{"poster":"Fermi Paradox","date":"2015-10-06T14:55:44.584+0000","up_votes":1,"down_votes":0,"body":"Warum sollte man trollen? Warum sollte man absichtlich feeden und/oder AFK gehen?\n\nFragen über Fragen.... ;)","replies":[{"poster":"LZ Flame","date":"2015-10-06T15:01:14.859+0000","up_votes":1,"down_votes":0,"body":"afk gehen es könnte plötzlich was passiert sein,trollen wenn jemand tiltet im game und keinen weg sieht um zu gewinnen,vor der champ select weil jemand seine Position genommen hat und versucht jemanden zu bewegen um zu leaven","replies":[]}]}]}]}]}]}]}]},{"poster":"HyperionCH","date":"2015-10-06T14:21:19.487+0000","up_votes":1,"down_votes":0,"body":"Das - worüber ich geschrieben habe - hat nichts mit Auge um Auge zu tun, sondern mit Spieltheorie (auch wenn mir dieser Ausdruck nicht gefällt).\n\nWenn du dich gut mit der Spieltheorie auskennen würdest, dann verstehst du auch, warum du auf keinen Fall dodgen sollst. ;)","replies":[]}]},{"poster":"Schasan","date":"2015-10-06T14:22:28.968+0000","up_votes":1,"down_votes":1,"body":"Da ich mit meiner Arbeit sehr oft beschäftigt bin, will ich in der kurzen Freizeit die ich habe, ein schönen spiel spielen... Wenn ich solche trolls mit geflame in der champselcet sehe ist das alles andere als schön und möchte meine kurze zeit dabei nicht verschwenden da ich die zeit sinnvoll verwenden will was bringt es mir ob die gebannt werden oder nicht? das ändert auch nix an meinem jetzigen Spiel ich denke fast JEDER hat schon einmal getrollt bzw. extrem schlecht gespielt (ich noch nie im ranked(also getrollt)) und denke daher wenn ich denen zufällig nochmal begegne dass sie dann vernünftig spielen werden würden...\n Daher versteh ich den Sinn nicht, was es mir bringen soll nicht zu leaven, damit ich meine zeit verschwende und ich trozdem meinen verlust einkassieren soll...","replies":[{"poster":"HyperionCH","date":"2015-10-06T14:37:06.589+0000","up_votes":1,"down_votes":0,"body":"Dir ist aber bewusst, dass du durchs Dodgen das Trolling in der ChampSelect förderst?\n\nDamit gewinnt der Troll und seine Strategie (z.B. durch Trolling seine Lane erzwingen) wird er öfter einsetzen.\nAndere Spieler sind dann auch sauer, dass dies offenbar so gut funktioniert, und versuchen diese Strategie auch (aka Trittbrettfahrer).\n\nLangfristig wird man das Problem in den Griff kriegen, wenn man nicht dodged. Dann wird der Spieler auch mit LP-Verlust überhäuft bzw. kriegt auch Strafen (Rankedsperre, bans).\n\nDu kannst schon sagen, dass du deine Zeit kurzfristig \"verschwendest\" (eigentlich eine Investition in die Zukunft). Dann darfst du jedoch nicht jammern, dass dies öfters vorkommt. Denn du förderst dieses Verhalten und bist somit streng genommen sogar Teil des Problems.","replies":[]}]}]},{"poster":"GxT Focus me pls","date":"2015-10-06T13:48:49.751+0000","up_votes":1,"down_votes":0,"body":"Nur weil man Clarity und CV nimmt is man doch kein Troll, wtf xD Das sind S.spells die in diesem Spiel integriert wurden um sich einen Vorteil zu verschaffen. \nSchon etwas schade, wie stur manche Leute nach Meta gehen ._.\n\nGrundsätzlich kann ich mich aber nur der Meinung von HyperionCH anschließen :D","replies":[{"poster":"Armaderschaden","date":"2015-10-06T13:54:36.619+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Leono,realm=EUW,application-id=YnZkMR0R,discussion-id=oIw6L8Es,comment-id=0001,timestamp=2015-10-06T13:48:49.751+0000)\n>\n> Nur weil man Clarity und CV nimmt is man doch kein Troll, wtf xD Das sind S.spells die in diesem Spiel integriert wurden um sich einen Vorteil zu verschaffen. \n> Schon etwas schade, wie stur manche Leute nach Meta gehen ._.\n> \n> Grundsätzlich kann ich mich aber nur der Meinung von HyperionCH anschließen :D\n\nDir ist der Begriff Disco-Nunu bekannt?\nDiese Aktion war eine deutliche Trollaktion, ohne ein ernsthafte Absicht dieses Spiel auch zu gewinnen.","replies":[{"poster":"Fermi Paradox","date":"2015-10-06T13:58:36.258+0000","up_votes":1,"down_votes":0,"body":"Also ich kenne nur \"Snowman-Nunu\", aber ich glaube, wir meinen die selbe Art, zu trollen^^\n\nMan instalockt Nunu mit CV und Clarity, schreibt \"SNOWMAN\" in den Teamchat und schreibt ab diesem Moment gar nichts mehr.\n\nWird in der Regel genutzt, um irgendjemanden dazu zu bringen, Champion Select zu leaven.","replies":[]}]}]},{"poster":"Alustus","date":"2015-10-06T14:15:23.751+0000","up_votes":2,"down_votes":1,"body":"Vernünftig wäre es dieses Spiel zu spielen und deinen Mitspieler zu reporten sollte er wirklich trollen\n\n\nAnsonsten gewinnt immer der Troll","replies":[{"poster":"Schasan","date":"2015-10-06T14:30:35.694+0000","up_votes":1,"down_votes":1,"body":"vernünftig?... überdenk mal deine aussage... oder les was ich HyperionCH geschrieben hab evt. erkennst du was vernunft ist.. wenn man 10h am tag spielen kann weil man noch in die 6klasse etc. geht und so viel freizeit hat ist das EVT. vernünftig. Aber eig. nicht.\nFür dich zählt dass Prinzip wie du mir ich dir auch... Für mich ist es egal was mit denen passirt ich denke in erster linie bloß um einen vorteil für mich wenn ich also 30min verschwende um denen zu schaden und ich auch nen schaden habe oder 30min zeit erspare und einen schaden haben was ist dan Vernunft?... Deine Aussage klang sehr provokant und kam als \"tja du bist dumm\" rüber. Daher habe ich meine Aussage deiner angepasst.","replies":[{"poster":"Alustus","date":"2015-10-06T14:45:26.662+0000","up_votes":1,"down_votes":0,"body":"Ich gehe arbeiten, und gehe bestimmt nicht wegen einem Troll aus der selection.\nDa mache ich ja genau das was der Troll will.\n\nUnd selbst mit trollen kann man ein Spiel gewinnen wenn auch nicht so leicht.\n\nNaja vernünftig ist vllt das falsche Wort, wobei ich es verwendet habe weil ich es bei deinem Post auch fehl am Platz gesehen habe.\nVernunft =/= das Beste für den augenblick oder für sich selber.\nVernünftig ist für mich wenn ich etwas mach das es Moralisch und für die Allgemeinheit das beste ist.\nBzw. das was ich auch von anderen erwarte damit man Probleme beseitigt.\nWenn niemand bei so einem Fall rausgeht und immer Reportet werden solche Trolle recht schnell verschwinden.\n\nIch würde einfach mal sagen, Wenn man das Spiel spielt, kann man verlieren,\nwenn man leavt hat man schon verloren.","replies":[]},{"poster":"HyperionCH","date":"2015-10-06T14:45:00.022+0000","up_votes":1,"down_votes":0,"body":"Das Ganze hat mit \"Spieltheorie\" zu tun (Beispiele von Spieltheorien: Gefangenendilemma, Angsthasenspiel, etc.)\n\nWenn man sich in diesem Bereich etwas auskennt, weiss man, dass Dodgen das genau Falsche ist und dass Spielen + Reporten die korrekte Massnahme ist.","replies":[]}]}]},{"poster":"SoloQisMentlBoom","date":"2015-10-06T14:09:19.682+0000","up_votes":1,"down_votes":1,"body":"Ich sollte einfach mal aus Protest die Combos spielen, über die sich im Forum beschwert wird. Also Adc-{{champion:44}} {{item:3031}} mit {{summoner:13}} und {{summoner:2}} incomming!","replies":[]}]}