{"poster":"RivaL xDD","date":"2015-03-28T18:27:13.824+0000","title":"Ranked Punkte ???","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Hallo ich h&auml;tte da ma ne fixe frage und zwar:\r\n\r\nwie setzt sich das zusammen wie viele punkte man in ranked games bekommt da ich mit einer besseren KDA z.b manchmal weniger bekomme als mit negativen stats.\r\n\r\nan der MMR kann es auch nich zusammen h&auml;ngen weil ich auch mal mehr punkte bekommen habe obwohl die gegnerische mmr unter unserer wahr.\r\n\r\njetzt meine frage wie bekommt man mehr bzw. weniger punkte in einem ranked game ?","replies":[{"poster":"AyteeDE","date":"2015-03-28T18:35:06.538+0000","up_votes":2,"down_votes":0,"body":"Es liegt an der MMR. Du weißt auch weder deine MMR noch die deiner Gegner.","replies":[{"poster":"RivaL xDD","date":"2015-03-28T18:39:32.072+0000","up_votes":2,"down_votes":2,"body":"auf lolnexus.com steht ja die MMR von unserem team und von dem team der gegnger","replies":[{"poster":"AyteeDE","date":"2015-03-28T18:41:58.357+0000","up_votes":2,"down_votes":0,"body":"Nein, das ist nicht die MMR. Nur weil LoLNexus das sagt, muss das nicht stimmen.","replies":[]}]}]},{"poster":"Pippifax97","date":"2015-03-28T21:34:05.491+0000","up_votes":1,"down_votes":0,"body":"http://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/IqBzFyO9-der-informationsthread-aber-ligen-mmr-und-hidden-elo\n\nhier erfährst du alles über MMR, wie das mit dem LP-gain zusammenhängt, usw.","replies":[]},{"poster":"Anbo","date":"2015-03-28T18:39:36.932+0000","up_votes":1,"down_votes":0,"body":"Soweit ich es verstanden habe bekommt man \"wenig Punkte\" wenn du gegen Spieler spielst die unter deiner jetzigen Elo(und MMR) spielen. Quasi du bist Gold 2 und spielst gegen Silber 1 2. Es kann aber auch sein, das du Silber 2 bist und Spielst gegen Gold 2 3, dann bekommst du natürlich \"mehr Punkte\". Ich glaube auch das eine KDA bei der Punktevergabe überhaupt gar keine Rolle spielt, sonst würden viele gar keine Teamfights bestreiten damit die KDA nicht negativ wird und sie weniger Punkte verlieren (Wenn man der Meinung ist das Spiel ist verloren)","replies":[]}]}