{"poster":"GiVeMeWEEDplz","date":"2015-02-26T14:33:08.814+0000","title":"Matchmaking Frustationsfaktor Nummer 1","subforum":"Karten & Spielmodi","up_votes":2,"down_votes":10,"body":"ich durfte schon öfters mit bronze/silber teams gegen komplett gold teams verlieren, aber gestern hatte ich die krönung des ganzen. mein team bestannt aus 4 silber spielern und einem nicht platzierten vs  1Dia V, 1Plat IV, 2Gold und einem silber spieler. wie gesagt war das nur die spitze des eisberges. ich verliere in letzter zeit fast nur noch, egal welche position ich ein nehme. wenn nicht gerade zich divisionen zwischen meinem und dem gegnerischen team stehen, dann sind trotzdem die schlechteren spieler in meinem team. in den letzten 2 wochen befinden sich maximal 3 gewonnen spiele in meiner match history und 8 spiele in folge zu verlieren ist keine seltenheit geworden.","replies":[{"poster":"Yáku","date":"2015-02-26T14:39:41.970+0000","up_votes":1,"down_votes":1,"body":"Du bist Stufe 22. Ich glaub damit ist alles gesagt. Dont feed the Trollz plz! ^^","replies":[{"poster":"GiVeMeWEEDplz","date":"2015-02-26T14:45:30.900+0000","up_votes":1,"down_votes":0,"body":"das ist nicht meine erster acc und um den geht es auch nicht.","replies":[{"poster":"HDLuckySlevin","date":"2015-02-26T14:48:40.125+0000","up_votes":4,"down_votes":1,"body":"dann mach nächste mal solche anfragen mit dem Account, um den es geht. Du gehst ja auch nicht zum Arzt und sagst, mein Kollege hat \"Probleme\". Wie soll der Arzt dann, über dich, eine Diagnose für den Kollegen erstellen.","replies":[]}]}]},{"poster":"Nebeltänzer","date":"2015-03-05T00:07:15.606+0000","up_votes":2,"down_votes":0,"body":"Ich kann dieses Problem nachvollziehen. Das sogenannte \"Matchmaking\" bei den normalen Spielen ist eine Farce. Momentan ist meine Win-Rate bei 50%. Was eigentlich normal ist und da sag ich absolut nix gegen. Was mich dabei aber absolut stört (und regelmäßig eine echt schlechte Laune beschert), ist, dass die Teams so seltsam \"gematched\" werden, dass ein Team locker 4v5 oder sogar 3v5 gewinnen kann. (Das hab ich 1x auch in anderer Richtung erlebt)\nVon einem \"Matchmaking\" kann man da allerdings nicht mehr sprechen.\nDa macht es bei den Spielen absolut keinen Unterschied, ob man versucht, ernsthaft zu spielen, oder ob man von sich selbst anfängt zu trollen und mit 6 Paar Stiefeln (sofern man sie sich überhaupt leisten kann, haha) einfach den Gegner feedet. (Um dem vorzugreifen: Nein, das hat niemand getan, nein, ich tue sowas auch nicht oder würde sowas auch nicht tun). Solche Spiele laufen dann so ab, dass man Minute 20 für den Surrender-Button nur noch herbeisehnt, da man einfach absolut nicht mehr vorankommt. (Schön vor allem, wenn man durchschnittlich Stufe ~16 im Team hat, das Gegnerteam einen Level 30, der das ganze Spiel alleine trägt....)\n\nAlso ja, durchaus nachvollziehbar. Da wäre es wirklich eine Überlegung, die ich an anderer Stelle im Forum gesehen habe, die beiden Rankings möglicherweise anzugleichen bzw. die Ranked-Wertung in das Matchmaking bei normalen Spielen mit einfließen zu lassen. Das wäre definitiv angenehmer als solche frustrierenden Runden, bei denen man auch nichts mehr lernen kann (außer der Musterung der Tapete, die man über die Hälfte der Spieldauer anstarren darf)\n\nIch entschuldige mich, falls das zu gefrustet klingt, aber wie gesagt, mir ist das gleiche Problem ebenfalls wiederholt aufgefallen. Und natürlich spiele ich, um mich zu verbessern, aber wenn man keinerlei Chance hat, gegen so jemanden anzukommen, verliert das Spiel sowohl Reiz als auch Spaß. Und zwar massig.","replies":[{"poster":"GiVeMeWEEDplz","date":"2015-03-05T19:36:47.840+0000","up_votes":1,"down_votes":0,"body":"du sprichst mir aus der seele.","replies":[]}]},{"poster":"HDLuckySlevin","date":"2015-02-26T14:41:53.079+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nda dein Account noch nicht Level 30 ist, kann es sich hierbei nur um ein \"normales Spiel\" gehandelt haben. Wie du aber schon weißt, gibt es auch noch einen anderen Modus, die Ranglistenspiele. Was du evtl nicht weißt ist, dass diese beiden Modis \"nichts voneinander wissen\", also es zwei verschiedene ratings sind. So kann es sein, dass du mit deinem Level 20 Account in der normalen Queue gegen bereits geranked Spiele spielen musst. Wahrscheinlich haben diese Spieler nicht so oft die normale Queue betreten, weswegen deren \"Hidden Elo\" (MMR) noch relativ nah an 1200 liegt (1200 ist der Durchschnittswert).\n\nDas ganze ist zwar ärgerlich, wenn man noch relativ neu ist, aber sowas passiert nicht so oft, da diese Spieler eigentlich \"Ranked-Fixiert\" sind und 90% Ranglistenspiele spielen.\n\nGrüße\nHDLuckySlevin\n\nPS: gestern war der sog. Patchday. Viele Spieler meiden dann die Ranglistenspiele, weil sie nicht Punkte/Elo verlieren wollen, wenn es Probleme mit dem Patch gibt.","replies":[{"poster":"GiVeMeWEEDplz","date":"2015-02-26T14:44:36.920+0000","up_votes":1,"down_votes":0,"body":"das ist nicht men erster acc, ich habe über 4000 spiele gemacht bis jetzt.","replies":[{"poster":"HDLuckySlevin","date":"2015-02-26T14:47:05.899+0000","up_votes":1,"down_votes":0,"body":"dann weißt du ja, dass Ranglistenspiele und normale Spiele verschiedene Queues haben.\n\nDu kannst uns ja mal dein \"main-Account\" nennen, dann schauen wir mal da rein (via \"Matchhistory\") und schauen woran es gelegen hat.","replies":[{"poster":"GiVeMeWEEDplz","date":"2015-03-04T23:22:38.956+0000","up_votes":1,"down_votes":0,"body":"ich bezweifle, dass du mir an hand meiner matchhistory helfen könntest. es sind faktoren die ich nicht beeinflussen kann, die immer wieder zur niederlage führen. an dem punkt will ich gleich noch anmerken, dass ich nicht ein \"ich gehöre in challenger, werde bloß immer runter getrollt mimimimi\" spieler bin. es ist einfach maxmimal langweillig, wenn man gegen \"übermächtige\" gegner gematched wird. als beispiel mit hand und fuß ist dieses nette bild von meinem letzten spiel. es war ein sehr angenehmes gefühl von einem plat 1 rengar einfach nur zerstört zu werden (er ist einmal gestorben, weil er mit lvl1 gegen 3 leute fb gehollt hat).","replies":[{"poster":"HDLuckySlevin","date":"2015-03-06T01:51:44.223+0000","up_votes":1,"down_votes":0,"body":"mir geht es nicht darum anhand deiner matchhistory deine \"fails\" zu überprüfen, es ging mir darum, dass man so die Gegner und mates einordnen kann um zu sagen warum du \"dia\" gegner bekommst. Also nur das übliche überprüfen warum du \"high ranked\" gegner bekommst","replies":[]}]}]}]}]},{"poster":"Yáku","date":"2015-02-26T14:56:53.864+0000","up_votes":1,"down_votes":0,"body":"Ok, das wusste ich nicht. Wie heißt denn dein Mainaccout, dann kann ich mir mal die Matchhistory ansehen um dein Problem besser zu verstehen.","replies":[]}]}