{"poster":"davide1908","date":"2017-10-24T20:52:39.807+0000","title":"Graves vittorioso","subforum":"Discussioni generali","up_votes":6,"down_votes":2,"body":"Originale\nhttps://pbs.twimg.com/media/DM7dXH-WkAE5Iks.jpg\n\nChroma\nhttps://pbs.twimg.com/media/DM7eG13WAAAKfAG.jpg\nhttps://pbs.twimg.com/media/DM7eG12W4AEsdzG.jpg\nhttps://pbs.twimg.com/media/DM7eG12XcAAFeq7.jpg\n\nBello bello bello","replies":[{"poster":"MID SacreeD","date":"2017-10-24T21:48:17.273+0000","up_votes":2,"down_votes":6,"body":"A questo punto potevano metterci una kalista o una tristana, non quel coso inutile... non capisco proprio come possa aver \"rappresentato\" la season 2017.","replies":[{"poster":"Saibbo","date":"2017-10-24T22:06:29.761+0000","up_votes":4,"down_votes":2,"body":"già dimenticato come era praticamente il campione più broken in jungla per un sacco di tempo? ancora più di quanto lo e' ezreal?","replies":[{"poster":"MID SacreeD","date":"2017-10-24T22:28:12.972+0000","up_votes":3,"down_votes":5,"body":"Lo era nella season scorsa e magari 2-3 mesi in questa. Non ha senso fare una skin vittoriosa secondo il mio modesto parere e senso di logica proprio per questo, non sarà mai più giocabile. anche perché non credo che gli ri-daranno mille mila resistenza alla E, perché se fai due volte lo stesso errore sei un coglione xD","replies":[{"poster":"Saibbo","date":"2017-10-24T22:34:10.533+0000","up_votes":1,"down_votes":3,"body":"beh.. quando mai sivir era stata broken?\n\nmagari me lo sono perso/dimenticato","replies":[{"poster":"MID SacreeD","date":"2017-10-24T22:47:38.232+0000","up_votes":2,"down_votes":5,"body":"Infatti te lo sei perso/dimenticato, perma banned/pick nei mondiali l'era di FORG1VEN, Rekkles. In competitivo era l'adc più forte del gioco. Ma probabilmente non giochi/segui lol da abbastanza tempo.\nGesù che rompipalle i bimbi silver che mettono -1 e magari giocano da 2 season xD","replies":[{"poster":"Saibbo","date":"2017-10-24T23:24:47.373+0000","up_votes":2,"down_votes":1,"body":"{{sticker:sg-lux-2}} \nQuindi kalista doveva essere la prossima vittoriosa visto che é 100% ban nei mondiali. Comunque é passato un sacco di tempo, all'inizio non seguivo esport soprattutto quando mi era capitato di vedere 2 team chiamate entrambe Samsung per le finali, chi si ricorda più...","replies":[{"poster":"MID SacreeD","date":"2017-10-25T00:08:47.503+0000","up_votes":3,"down_votes":8,"body":"Ehm no, Kalista e Tristana hanno letteralmente dominato per tutta la season, sia in competitivo che in soloq, graves non lo vedo da Febbraio? Marzo? Non ricordo, ma comunque graves non dovrebbe avere una skin vittoriosa, almeno non in questa season. Quella di Maokai è assai più onesta della season scorsa... Dai basta parlare di sta roba è uno spreco di tempo, perché ho ragione e punto. Se credi che Graves merita più di Tristana una skin vittoriosa bene, ciao.","replies":[{"poster":"FunghettoVlad","date":"2017-10-25T10:29:08.944+0000","up_votes":6,"down_votes":0,"body":"Non è affatto mia intenzione continuare un litigio o iniziare una discussione, però ho fatto alcune considerazioni sulla skin vittoriosa. Gioco da 2 season (quindi si non so cosa accadeva prima) ed ho iniziato a seguire il competitivo dall'MSI dell'anno scorso (o dall' IEM dell'anno scorso) e in entrambe le occasioni fui colpito nel vedere Maokai pick or ban in top. Poi alla fine della season scorsa Maokai venne un po' abbandonato (se non ricordo male) per poi tornare in auge questa season. Leggendo poi forse su questo forum o sul forum inglese ho visto più di qualcuno che diceva che alla riot per preparare una skin come questa, una delle più importanti, il team dei disegnatori si mette all'opera già in estate o addirittura prima di essa. \nDunque, se ben ricordo, Graves ha avuto il momento del suo massimo splendore durante lo spring split, durante l'MSI prima del nerf della 7.10 (l'MSI si giocò in 7.8, patch in cui Graves era veramente Pick or ban). \nDunque, se effettivamente è così, la scelta di Graves è giustificata, altrimenti se la skin è stat fatta recentemente e si va anche a considerare il periodo del summer split e dei mondiali allora forse è più azzeccato uno dei nomi che proponi tu. \n\nIn ogni caso la skin è bellissima **{{sticker:slayer-pantheon-popcorn}} \n\nP.S. Graves non puoi non vederlo da marzo, guarda i dati dell'MSI di quest anno . \nhttp://www.gamesoflegends.com/tournament/stats.php?id=MSI%20Play-In%202017\n<<Presence: 91.7%>>\nhttp://www.gamesoflegends.com/champion/stats.php?id=29&season=S7&tournament=Mid-Season%20Invitational%202017\nP.P.S. Nota che fra gli ADCarry non c'è Tristana e Kalista è stata pickata solo una volta\n\nP.P.P.S modifica in corsa \nhttps://lol.gamepedia.com/2016_Mid-Season_Invitational/Champion_Statistics\nNota la presenza di Maokai dell'anno scorso","replies":[{"poster":"MID SacreeD","date":"2017-10-25T16:39:37.226+0000","up_votes":1,"down_votes":4,"body":"Cioè sei serio? Graves è stato pikkato/bannato 92 volte in questa season (tutti tornei europei compresi 2017) mentre Tristana 230...  informatevi prima di fare papiri pieni di ignoranza xD\nE' come dire \"oddio ezrael jng è troppo forte ha carryato easy per un mese intero!!!! Facciamo subito una skin vittoriosa!!!11111\"","replies":[{"poster":"FunghettoVlad","date":"2017-10-25T18:50:37.152+0000","up_votes":3,"down_votes":0,"body":"Non so se hai letto quello che ho scritto, comunque la mia tesi, in sostanza, è che la victorious non venga scelta alla fine della season, bensì a metà di essa, e se effettivamente fosse così, la scelta di Graves sarebbe giusta.\n> E' come dire \"oddio ezrael jng è troppo forte ha carryato easy per un mese intero!!!! Facciamo subito una skin vittoriosa!!!11111\"\n\n\n??","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"KCM Randagio I","date":"2017-10-25T18:53:00.601+0000","up_votes":3,"down_votes":0,"body":"Geni della lampada, la skin vittoriosa si comincia a creare prima di metà season, perché ci vogliono mesi per metterla appunto. Quindi conta il campione più incisivo nei primi mesi della season.\n\nGraves era dio, da tempo non usciva un jungler, ergo la scelta... \n\nSi vede che non lavorate..","replies":[{"poster":"FunghettoVlad","date":"2017-10-25T20:27:08.943+0000","up_votes":1,"down_votes":0,"body":"Sono d'accordo :D ma come fai a essere sicuro che ci lavorano da metà season?","replies":[{"poster":"KCM Randagio I","date":"2017-10-26T05:45:44.063+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FunghettoVlad,realm=EUW,application-id=MJVj50Jw,discussion-id=7izNBEIO,comment-id=00050000,timestamp=2017-10-25T20:27:08.943+0000)\n>\n> Sono d&#x27;accordo :D ma come fai a essere sicuro che ci lavorano da metà season?\n\n1- ci vuole tempo per fare un lavoro fatto bene, con determinati standard.. questo vale per tutti i lavori.\n2- l'hanno detto esplicito da qualche parte e l'ho letto","replies":[]},{"poster":"Saibbo","date":"2017-10-25T20:39:29.937+0000","up_votes":1,"down_votes":0,"body":"perché quanto tempo ci metti a scegliere il campione, disegnare la skin, creare il modello 3d, etc..? entro fine della season","replies":[]}]}]},{"poster":"sxrrxwland","date":"2017-10-25T12:58:35.428+0000","up_votes":2,"down_votes":1,"body":"Ugly af\nHo graves evaso e come modello è molto meglio","replies":[]},{"poster":"Vileblood Pyke","date":"2017-10-27T13:45:57.847+0000","up_votes":1,"down_votes":0,"body":"https://pbs.twimg.com/media/DNGhD6uVQAEbZqE.jpg:large\n\nHanno reso i colori (viola e oro) più simili a Victorious Sivir.\nBello.","replies":[]},{"poster":"Vileblood Pyke","date":"2017-10-25T21:31:30.304+0000","up_votes":1,"down_votes":0,"body":"A me piace.\n\nEd è pure gratis.","replies":[]},{"poster":"Blehic","date":"2017-10-25T17:46:23.438+0000","up_votes":1,"down_votes":0,"body":"Preferisco molto di più la Pool party","replies":[]},{"poster":"vondarck","date":"2017-10-24T21:14:13.219+0000","up_votes":1,"down_votes":0,"body":"Imho.. Tra le ultime skin uscite una di quelle che mi piace meno..\n\nPerò tanto quest anno non mk spetta quindi gg xD","replies":[]},{"poster":"5Dragon66","date":"2017-10-25T14:26:28.836+0000","up_votes":1,"down_votes":1,"body":"Sono bruttissime lol","replies":[]}]}