{"poster":"S1iced","date":"2020-01-18T23:06:35.858+0000","title":"Zwei Jahre ist es her...","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":7,"body":"Liebes **Riot Games Support Team** - **liebe Mitspieler**,\n\n**Zwei Jahre** ist es her seitdem ich auf diesem Account permanent gebannt wurde (aufgrund von ziemlich übeler chat beleidigungen). **Zwei Jahre** in denen ich lernen konnte - schlauer werden konnte - reifen konnte. Auch **zwei Jahre** in denen ich nicht aufgehört habe League of Legends zu spielen (gestandener maßen).\nIch konnte mit den neuen Einstellungen - den Chat Ingame dauerhaft deaktiviert zu haben - meine Teufel des tiltens überwinden und habe nun einige Zeit schon einen Account der (allergrößten Teils) ohne Auffällig schlechtes Verhalten existiert.\nIch liebe dieses Spiel immernoch wie vor fast 6 Jahren - als ich anfing LoL für mich zu entdecken.\n\nEinen **Entbannungsantrag** zu stellen ist mir nie in den Sinn gekommen da ich fand dass der permanente Bann definitiv gerechtfertigt und Fair war. Erst vor kurzem habe ich wieder an die Anfänge LoLs gedacht und damit auch an diesen Account hier.\nIch bezweifel eine Entbannung und ich wäre auch nicht sauer oder enttäuscht wenn ich diese nicht bekommen würde, ganz im Gegenteil.\nAber für die schöne Erinnerung und die Tatsache dass ich von mir selbst Enttäuscht wäre würde ich es noch nichtmal probieren stelle ich hiermit einen Entbannungsantrag für diesen Account.\nMit dem Versprechen ein besserer Teil dieser Community zu sein als ich es damals war - was ich damals geschrieben und gesagt habe war falsch und stark aggressives und negatives Verhalten. Mit dem Alter kommt die Weisheit sagt man doch so schön.\nWie schon erwähnt - ich bin mit jeder Entscheidung des Teams zufrieden! Möglicherweise ist eine Entbannung noch nichtmal möglich.\n\n**Ich wünsche allen Spielern eine wundervolle 10te Season**\nman sieht sich InGame und mit allerbesten grüßen,\nS1iced","replies":[{"poster":"Timethief49","date":"2020-01-18T23:10:27.731+0000","up_votes":6,"down_votes":0,"body":"Entbannungsanträge gibt es in der Art nicht. Zurecht gebannte Account bleiben gebannt. Permanent. Deshalb heißt es auch Permaban.","replies":[]},{"poster":"HHaie tabbian","date":"2020-01-20T06:44:49.164+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=S1iced,realm=EUW,application-id=KYnfKGf0,discussion-id=XxoFPVyI,comment-id=,timestamp=2020-01-18T23:06:35.858+0000)\n>\n> Ich bezweifel eine Entbannung und ich wäre auch nicht sauer oder enttäuscht wenn ich diese nicht bekommen würde, ganz im Gegenteil.\n\nDann frage ich mich, warum du diesen Thread überhaupt schreibst.","replies":[]},{"poster":"You Got My Name","date":"2020-01-19T16:17:37.721+0000","up_votes":1,"down_votes":0,"body":"Antrag, abgelegt.\nClose/","replies":[]},{"poster":"Ráyleigh","date":"2020-01-19T09:39:56.271+0000","up_votes":1,"down_votes":0,"body":"Permabann sagt doch schon alles oder?\nAuch wenn dieser auch noch vollkommen zu Recht ausgesprochen wurde.","replies":[]},{"poster":"Eroticat Nimar","date":"2020-01-19T05:10:24.061+0000","up_votes":1,"down_votes":0,"body":"Ist schon ein bisschen witzig\n\n> stelle ich hiermit einen Entbannungsantrag für diesen Account.\n\nAber gerade dieser Part hier ist schon wirklich sehr sehr herzlich gut, denn dass hier ist ein Community Forum und nicht die Riot Games Support Seite xD","replies":[]}]}