{"poster":"Soul92fly","date":"2016-01-31T13:01:30.858+0000","title":"Parrrley - Interforen Turnier: Finale!","subforum":"Streams & YouTube","up_votes":5,"down_votes":3,"body":"http://i.imgur.com/auN7VGj.jpg\r\n\r\n\r\nSeid gegr&uuml;&szlig;t Beschw&ouml;rer!\r\n\r\nHeute l&auml;uft das Finale des Interforen Turniers 2016, veranstaltet vom Spieler LegenDragon.\r\n---\r\nIm Interforen Turnier hat jedes der f&uuml;nf Boards aus EU West, Spanien, Italien, England, Frankreich und Deutschland, ein Team zusammengestellt. Jedes Team besteht aus bis zu neun Spielern, jeder Spiel hat einen bestimmten &ldquo;Wert&rdquo;, basierend auf dem Solo Ranking aus Season 5. Die f&uuml;nf Spielenden d&uuml;rfen dabei nicht &uuml;ber 20 kommen, damit ist gesichert das kein Team f&uuml;nf High Elo Spieler spielen l&auml;sst. Mehr zu der Wertung in den Regeln.\r\n---\r\n**Gestern spielten wir im Halbfinale gegen England und konnten im BO3 mit 2-0 siegen, im ersten Spiel dominierten wir den Gegner, aber im zweiten Spiel hatten wir mit einigen Problemen zu k&auml;mpfen. Jedoch konnten wir uns schlie&szlig;lich behaupten und gewannen auch dieses Game.\r\nSomit stehen wir unbesiegt im Finale, gegen wen wir spielen wissen wir leider noch nicht. Das letzte Spiel von Italien und Frankreich wird heute noch ausgetragen, momentan steht es 1-1. Das letzte Spiel musste aufgrund von Zeitproblemen auf heute verschoben werden.**\r\n---\r\n\r\n**Wo finde ich die Regeln des Turniers?**\r\nhttp://canisback.com/tournament/ - Hier bekommt ihr alle wichtigen Informationen zu dem Turnier.\r\n---\r\n\r\nWo: [Auf dem offiziellen Twitch Emissary Kanal](http://www.twitch.tv/germanemissaries)\r\nWann: Sonntag 31.01., 17:00 Uhr","replies":[{"poster":"Soul92fly","date":"2016-01-31T18:55:13.147+0000","up_votes":3,"down_votes":0,"body":"Das Finale ist vorbei, wir haben mit 2-1 gewonnen!\nIm ersten Game haben uns die Franzosen dominiert und konnten direkt das erste Game für sich entscheiden.\nDas zweite Spiel konnten wir das Spiel gewinnen und haben somit ausgeglichen.\nIm dritten Game konnten wir dann ebenfalls sehr dominant gewinnen.\n\nAlle Spiele findet ihr auf unserem [Youtube Kanal](https://www.youtube.com/channel/UC5P4a0cGSvNIBMZIjUcaxpw)","replies":[]}]}