{"poster":"Soul92fly","date":"2015-12-08T12:19:43.816+0000","title":"Parrrley - Die Emissaries streamen. Thema heute: Andere Moba und League of Legends","subforum":"Streams & YouTube","up_votes":7,"down_votes":1,"body":"http://i.imgur.com/auN7VGj.jpg\r\n\r\nSeid gegr&uuml;&szlig;t Beschw&ouml;rer!\r\n\r\nHeute Abend findet wieder die Gespr&auml;chsrunde der Emissaries &quot;Parrrley&quot; auf Twitch statt. Alle die teilnehmen wollen sind herzlich dazu eingeladen. Wenn ihr Fragen rund um das Thema LoL habt, k&ouml;nnt ihr sie uns dort gerne stellen. Egal ob es dabei um Reports, Spielerverhalten oder Piraten geht. Falls jemand schon immer ein paar pers&ouml;nliche Fragen an einen Emissary stellen wollte, w&auml;re das nat&uuml;rlich die Gelegenheit dazu. \r\n---\r\n**Heute fangen wir damit an &uuml;ber andere Moba zu sprechen. Habt ihr auch schon ein Anderes gespielt? Wie findet ihr diese und worin liegen die Unterschiede zu League? Danach werden wir uns etwas mehr mit LoL besch&auml;ftigen und reden dar&uuml;ber was uns pers&ouml;nlich bei dem Spiel h&auml;lt. Auch eure Meinungen und Geschichten dazu interessieren uns sehr.**\r\n---\r\nIhr k&ouml;nnt auch gerne eure Meinungen zu Spielinhalten in den Twitchchat schreiben und mit uns dar&uuml;ber reden. Wer einfach nur zuh&ouml;ren und zusehen m&ouml;chte ist nat&uuml;rlich auch gerne eingeladen.\r\n\r\n\r\nWo: [Auf dem offiziellen Twitch Emissary Kanal](http://www.twitch.tv/germanemissaries)\r\nWann: Dienstag 08.12. , 20:00 Uhr\r\nWer kann dabei sein: Alle die Lust haben und sich mit uns auseinandersetzen wollen.\r\nWas: Redet mit uns &uuml;ber alles, was euch im Zusammenhang mit LoL interessiert, E-Sports, Community Projekte, Spielerverhalten, Ideen, Kritik, Nachbars Katze.... alles ist erlaubt.","replies":[{"poster":"HyperionCH","date":"2015-12-08T13:17:03.963+0000","up_votes":1,"down_votes":0,"body":"Ich hoffe, ich kann pünktlich zu Hause sein. :)\n\nHoffentlich ist Humpel dabei. Er hat noch eine offene Frage, die er mir vielleicht dann beantworten könnte. :D\n\nVor 2 Wochen war ja LoL-Merch das Thema.\nIhr könntet die Zuschauer vielleicht noch informieren, dass die für diese Woche geplante Veröffentlichung der Ahri-Statue ausfällt (aufgrund des Feedbacks der Community).","replies":[]},{"poster":"Paniro","date":"2015-12-08T12:44:31.363+0000","up_votes":1,"down_votes":0,"body":"Hmm wird interessant zu wissen was Leute von HotS halten ^^ Ich höre da zu viel Sachen die einfach nicht stimmen D:","replies":[]}]}