{"poster":"ALLA without H","date":"2015-04-29T14:59:02.842+0000","title":"Patch 5.8 - Das Ende von ARAM (Mark/Dash)","subforum":"Karten & Spielmodi","up_votes":36,"down_votes":11,"body":"Durch den neuen Summoner-Skill (Mark/Dash) ist ARAM f&uuml;r alle Range Charaktere jetzt unspielbar.\r\nDer Skill ist absolut unausgewogen. Der Cooldown ist zu niedrig, die Reichweite &uuml;bertrieben und das jeder zu dem markierten Ziel springen kann ist eine Zumutung.\r\nSorry, aber ich habe mein Feierabend ARAM geliebt... jetzt ist es nur noch eine Qual.\r\nBye bye LoL bis zum Fix oder f&uuml;r immer...","replies":[{"poster":"Ezizu","date":"2015-04-30T22:54:34.301+0000","up_votes":23,"down_votes":2,"body":"Ich habe zum jetzigen Zeitpunkt 1.389 ARAM Siege und hatte nie Probleme Melee-Champs zu spielen. Vermeintlich schwache Champions wie manche Vorredner bspw. Udyr aufgeführt haben, muss man einfach nur wissen in ARAM entsprechend zu spielen und auch wenn bpsw. Lux, Heimerdinger und Sona zusammen im Enemy-Team waren, war das für mich nie ein Grund die Runde gleich aufzugeben, weil man mit einem klugen Kopf und guten Teamwork die Runde dennoch gewinnen konnte.\n\nDieser Spell \"Mark/Dash\" jedoch ist ein derart großer Eingriff in diesen Mode, dass ich ARAM nun nicht mehr spielen werde und somit in kurzer Zeit sicherlich ganz auf LoL verzichten werde.\n\nDie Ablingzeit, die Range, der Zusatzschaden - das alles in der Summe ist einfach nicht ausgeglichen. Und ja, manche Beschwörer werden Melee-Champs jetzt besser in ARAM spielen können, aber ebenso kann man Champs wie Fiddlesticks, Morgana, Sona, etc. in einer Art und Weise einsetzen, dass dieser angebliche Ausgleich total ein Schuss nach hinten war.\n\nFür mich ist dieser Spell in den vorab guten Modus ARAM das absolute Grauen.\n\nWenn Leute \"Poro-King\" spielen wollen, dann soll RIOT eben diesen Mode wieder aktivieren und gut ... aber warum mit einem so großen Major-Update einen so - sicherlich auch profitablen - Modus komplett verunstalten und Verluste eingehen?\n\nIch hoffe inständig, dass dieser Spell stark limitiert (Cooldown, Range, DMG, etc.) wird und würde mich sehr freuen, wenn dieser sogar bald wieder deaktiviert würde und von mir aus gerne der Poro-Modus wieder aktiviert wird.\n\nAlle Leute die nicht mindestens 1.000 Siege in ARAM vorzuweisen haben, können das sowieso nur schwer nachempfinden und ich kann diesen Leuten nur nahelegen, dass dieser Modus \"unsere\" Leidenschaft war und diese jetzt einfach \"vernichtet\" wurden ist.\n\nIch würde bspw. auch nie irgendwelche Äußerungen bzgl. SummonersRift machen ... weil ich mich ebenda nicht auskenne.\n\nKeine Ahnung ... wenn dieser Spell in dieser Form bleibt - war's das wohl mit LoL.","replies":[{"poster":"Huludxx","date":"2015-05-01T13:54:18.543+0000","up_votes":11,"down_votes":3,"body":"> [{quoted}](name=FunkadelicMBrain,realm=EUW,application-id=cGRapXds,discussion-id=Vq1iVokg,comment-id=000f,timestamp=2015-04-30T22:54:34.301+0000)\n>\n> Ich habe zum jetzigen Zeitpunkt 1.389 ARAM Siege und hatte nie Probleme Melee-Champs zu spielen. [..]\n> \n> Keine Ahnung ... wenn dieser Spell in dieser Form bleibt - war's das wohl mit LoL.\n\n1.6k wins und schließe mich zu 100 % an.","replies":[]},{"poster":"MachoMacker","date":"2015-05-02T15:43:09.975+0000","up_votes":7,"down_votes":3,"body":"Habe zwar nur 710 Siege in Aram vorzuweisen, aber ich schließe mich dem Kommentar zu 100% an.","replies":[]},{"poster":"Undread Sazuna","date":"2015-05-04T09:11:07.968+0000","up_votes":4,"down_votes":1,"body":"Bedeutend weniger als ihr aber auch hier volle Zustimmung!","replies":[]},{"poster":"4 R4nd0m N008","date":"2015-05-04T09:28:07.496+0000","up_votes":3,"down_votes":7,"body":"Du musst aber auch die Spieler berücksichtigen, die eben nicht sehr oft ARAM spielen. Wenn ich bspw. Champs wie Udyr in ARAM bekommen habe, hatte ich schon keine Lust mehr auf die Runde. Und meistens habe ich mit solchen Champs auch nichts anderes gemacht, als den ganzen Tag die Gegner zu feeden. Sprich, wenn ich einen Melee Champ bekommen habe waren die meisten Games schon in der Champ Select verloren.\n\nMit dem neuen Spell kann auch ich mit Melee Champs was anfangen. Jetzt bin ich nicht komplett demotiviert und habe **absolut** keine Ahnung was ich mache, sondern kann auch meinem Team helfen. Vorher war ich eine Belastung, die auch nicht motiviert war zu gewinnen sondern eher \"das Game so schnell wie möglich hinter mich zu bringen\" und heute habe ich wieder Spaß an dem Modus und kann endlich meinem Team helfen!\n\nDas der Spell in der jetzigen Form zu stark ist kann ich aber nachvollziehen. Er sollte noch stark angepasst werden, aber nicht wieder entfernt, damit Leute wie ich auch eine Chance in ARAM haben.","replies":[{"poster":"Fr3shdumbledore","date":"2015-05-04T15:06:42.939+0000","up_votes":3,"down_votes":1,"body":"Tut mir echt leid aber das ist für mich keine sinnvolle Argumenation! Fakt ist, dass manche dieser Tanks (Galio z.B.) eine extrem hohe Winrate haben. Ich will dir nicht zu nahe treten und es ist nicht böse gemeint.... aber nur weil jemand mit einem Champ nicht umgehen kann, hat dieser trotzdem großes Potential. Wenn du das nicht abrufen kannst, ist das nicht der Fehler des Modes sondern deiner! Ich bin z.B. ein sehr schlechter Yasuo-Spieler. Aber muss er deswegen so weit vereinfacht werden, dass ich mit ihm Plays machen kann?","replies":[]}]}]},{"poster":"4 R4nd0m N008","date":"2015-04-30T07:19:12.713+0000","up_votes":5,"down_votes":20,"body":"Wieso nimmt euch allen der Schneball den Spaß? ARAMs sind nicht dafür da, um sie ernst zu nehmen. Das ist einfacher nur ein Funmode zum Spaß haben. Dabei geht es nicht darum total strategisch zu spielen um unbedingt zu gewinnen. Und mit dem Schneeball finde ich macht das viel mehr Spaß als vorher. Endlich kann man mit Nahkämpfern ohne Gapcloser auch mal was machen. Ein Engage ohne ist viel zu schwer, was den Champ ziemlich useless macht. Außerdem haben Nahmkämpfer ohne Gapcloser **nie** Spaß gemacht. Endlich finde ich das es keinen Champ mehr auf ARAM gibt der keinen Spaß macht.","replies":[{"poster":"Daryl Dixon","date":"2015-04-30T08:25:22.928+0000","up_votes":10,"down_votes":1,"body":"> [{quoted}](name=Fiqqa,realm=EUW,application-id=cGRapXds,discussion-id=Vq1iVokg,comment-id=0008,timestamp=2015-04-30T07:19:12.713+0000)\n>\n> Wieso nimmt euch allen der Schneball den Spaß? ARAMs sind nicht dafür da, um sie ernst zu nehmen. Das ist einfacher nur ein Funmode zum Spaß haben. Dabei geht es nicht darum total strategisch zu spielen um unbedingt zu gewinnen. Und mit dem Schneeball finde ich macht das viel mehr Spaß als vorher. Endlich kann man mit Nahkämpfern ohne Gapcloser auch mal was machen. Ein Engage ohne ist viel zu schwer, was den Champ ziemlich useless macht. Außerdem haben Nahmkämpfer ohne Gapcloser **nie** Spaß gemacht. Endlich finde ich das es keinen Champ mehr auf ARAM gibt der keinen Spaß macht.\n\nTrotzdem sollte ein gewisses balancing da sein.","replies":[{"poster":"HyperionCH","date":"2015-04-30T08:38:53.498+0000","up_votes":3,"down_votes":14,"body":"> [{quoted}](name=Daryl Dixon,realm=EUW,application-id=cGRapXds,discussion-id=Vq1iVokg,comment-id=00080000,timestamp=2015-04-30T08:25:22.928+0000)\n>\n> Trotzdem sollte ein gewisses balancing da sein.\n\nGab es vorher denn ein balancing?\n\nEs waren doch eigentlich immer die selben Champs in den Top 10 mit den höchsten winrates (z.B. Sona, Heimer, Ziggs, Lux, etc.) und immer die selben Champ mit den tiefsten winrates (z.B. Eve, Akali, Kha, Tryn, etc. -> neu offenbar auch Bard).\n\nDer neue Zauber stärkt jene mit tiefen winrates (für Champs wie Sona oder Ziggs ist er ja auch unbrauchbar). Riot versucht also zu balancen.\n\nOb der neue Zauber OP ist, wird sich erst noch zeigen.\nSollte dies sein, wird Riot ihn wohl nerfen (z.B. höhere CD oder langsamere Geschwindigkeit). Kann aber auch sein, dass alle den Schneeball dodgen; dann braucht es sogar einen Buff.\n\nRiot hat damit sicherlich zum Ziel, dass mehr Champs in ARAM \"spielbar\" sind und nicht nur gewisse Champs eine extrem hohe winrate besitzen. Man beschwert sich hier also, dass Riot den Modus besser balanced. ;)","replies":[{"poster":"Fr3shdumbledore","date":"2015-04-30T16:15:19.198+0000","up_votes":18,"down_votes":0,"body":"Ich denke, dass der Zauber da gar nicht mal viel hilft... nehmen wir z.B. mal Akali: sie ist nicht deswegen schwach im ARAM weil sie nicht engagen kann (denn das kann sie ab lvl 6 sogar sehr gut) sondern deswegen, weil schlicht ein ungeeignetes Skillset für den Mode hat. Bei Bard ist es doch ähnlich. Tryndamere braucht eben viel Zeit, bis er Schaden macht und die hat man im ARAM meistens nicht. Wir der neue Spell daran etwas ändern?\n\nDas Problem sehe ich aber auch gar nicht bei diesen tendenziell eher schwachen Champs, sondern bei starken Champs wie Galio, Katarina, Amumu usw. Oder allgemein bei Chars, die schon einen guten Engage haben und die man eh nur dadurch in Schach halten konnte, indem man Distanz aufgebaut hat (z.B. Jarvan). Was soll man gegen einen Galio machen, der einfach munter alle 20 Sec. in die Gruppe reinspringen kann? Oder einen Amumu? Oder Warwick? Oder Yi? Diese Liste kann man lange weiterführen!\n\nIch finde, das ist keine Balance, wenn man den absoluten Vorteil verschiebt! Balance ist, wenn alle Champs vom Potential her ähnlich gut sind!\n\nWenn Riot diesen Spell einführen will, dann wegen mir in einem eigenen Mode! Aber nicht einfach ARAM nehmen und kaputt machen! Mir hat der Mode so gefallen, wie er war (und ich denke mal, da stehe ich nicht alleine da!). Einen großen Änderungsbedarf sehe ich nicht (was natürlich nicht heißen soll, dass man kein Feintuning betreiben sollte!) und ich habe immerhin über 800 ARAM Games auf dem Buckel!","replies":[{"poster":"Norica","date":"2015-05-01T14:34:37.410+0000","up_votes":3,"down_votes":0,"body":"Das kann ich so unterschreiben! Ganz meiner Meinung :)","replies":[]},{"poster":"Ezizu","date":"2015-05-01T11:03:44.226+0000","up_votes":2,"down_votes":0,"body":"Sehr guter Beitrag!!!","replies":[{"poster":"Fr3shdumbledore","date":"2015-05-01T12:37:11.840+0000","up_votes":2,"down_votes":0,"body":"Danke =)","replies":[]}]}]}]}]}]},{"poster":"Fajeth","date":"2015-04-30T13:09:14.529+0000","up_votes":16,"down_votes":3,"body":"Ganz ehrlich rito, das meint ihr doch nicht ernst mit diesem summoner spell oder? bloß weg damit, aram fühlt sich jetzt ganz anders an, es macht keinen spaß mehr...","replies":[]},{"poster":"Wutzekopp","date":"2015-04-30T06:41:17.830+0000","up_votes":14,"down_votes":4,"body":"ARAM ist das einzige was ich bei LOL spiele, aber dieser dieser Summoner-Skill nimmt mir den Spass daran.\nBei \"Winterfreuden\" war das ja noch witzig, aber da war es ein gesonderter Modus. 20 Sekunden cd ist völlig übertrieben. Jetzt ist ARAM nur noch eine Schneeballschlacht, Positionierung ist nahezu sinnlos geworden. Statt Strategie hat man jetzt chaotisches Gemetzel. \nBitte, entfernt diesen Schneeball wieder, einfach nur nervig!!!","replies":[{"poster":"Corpsa","date":"2015-05-12T14:41:48.616+0000","up_votes":3,"down_votes":0,"body":"Geht mir genau so Wutzekopp (geiler Name:) , ich spiele zu 99% nur noch Aram hatte gerade eine 3 Monats Pause hinter mir, komme zurück und rutsche in die Schneeballschlacht. Es verändert den Playstyle enorm alles dreht sich nur noch um den Spell und das ist schlichtweg einfach nur nervig.\n\nEntfernen oder zumindest anpassen, 20 sekunden ist einfach nur krank, ein 1-2min CD wäre eher passend und die reichweite reduzieren.\nBitte Riot ändert oder entfernt den Spell !","replies":[]},{"poster":"Headbeatz","date":"2015-05-01T14:38:33.199+0000","up_votes":3,"down_votes":8,"body":"Strategie in ARAM musst du mir erläutern mir selber gefällt aram nich eben weil man als nahkkämpfer keinen auftrag hatte wenn 5 range vor dir stehen so denke ich ist dieser summoner spell zucker","replies":[{"poster":"Huludxx","date":"2015-05-01T14:58:03.223+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=HeadBeatz,realm=EUW,application-id=cGRapXds,discussion-id=Vq1iVokg,comment-id=00070000,timestamp=2015-05-01T14:38:33.199+0000)\n>\n> Strategie in ARAM musst du mir erläutern mir selber gefällt aram nich eben weil man als nahkkämpfer keinen auftrag hatte wenn 5 range vor dir stehen so denke ich ist dieser summoner spell zucker\n\nwie man sieht, du spielst den mode nicht. Melee Tanks im Aram lategame sind ausgesprochen stark. Assasins häufig auch. und btw: wenn das Gegenerteam 5 adc hat dann ist es völlig ok auch mal stumpf zu verlieren. Keiner der häufiger Aram spielt besteht drauf, dass jede zufällige team kombo besiegbar ist. Wichtig ist nur dass diese paar absolut unbesiegbaren Kombos sehr selten sind. Dank dem neuen Beschwörerzauber hat sich die Anzahl genau dieser Kombos gefühlt verzehnfacht.\nUnd wenn du die strategie erläutert haben möchtest: Garen mit Thornmail, sunfirecape und ordentlich leben vll. noch ein AD-item und lvl 16+, da werden die gegnerischen Ranges langsam nervös. Ausweichen auf ne andere Lane ist da nicht :)\n ","replies":[]}]}]},{"poster":"Egeliyim","date":"2015-05-01T19:02:46.093+0000","up_votes":10,"down_votes":1,"body":"**Schafft diesen Schneeball ab bitte!!!!! das macht ja keinen spaß mehr -.-**","replies":[]},{"poster":"ColonelCarnage","date":"2015-04-29T15:44:40.082+0000","up_votes":11,"down_votes":2,"body":"Stimme dem TO absolut zu, der Skill muss wieder weg. \nNatürlich gibt es gelegentlich Runden, wo man mit einem nahkampflastigen Team hinter dem Turm hängt und keine Sonne sieht, aber der aktuelle Stand ist da weit schlimmer. \nWenn jeder Melee-Champ sich zu jeder Zeit mitten ins Gesicht der Ranges porten kann, ist das einfach witzlos. \nImmer schön, wenn Yi plötzlich über 30m angeflogen kommt und mittem im Team seine Combo startet.","replies":[]},{"poster":"Fr3shdumbledore","date":"2015-04-29T22:18:41.794+0000","up_votes":9,"down_votes":1,"body":"Ich bin der Meinung, dass der neue Spell deutlich zu stark ist! Tanks waren nie schwach und ich habe es oft genug erlebt, dass sie Spiele gewinnen! Allerdings hatte man immer die Möglichkeit ihre engages zu dodgen bzw. sie zu kontern. Jetzt spammen sie einfach den neuen Zauber und irgendwann treffen sie dann mal einen aus dem Team und das wars dann!\n\nWenn man die Dominanz der Ranges brachen will: Gut! Aber da gibt es doch wohl andere Wege! Man könnte z.B. Ludens aus dem Aram rausnehmen (denn das hat die Dominanz der Ranged APs extrem gepushed) und dafür Warmogs drin lassen!","replies":[{"poster":"4 R4nd0m N008","date":"2015-04-30T07:15:34.789+0000","up_votes":4,"down_votes":3,"body":"Ach so wir machen die APC schwächer **UND** die Tanks stärker damit die erst recht richtig useless werden. Ohne Ludens und mit Warmorgs machen APC überhaupt nichts mehr in ARAM. Vorallem keinen Spaß.","replies":[]}]},{"poster":"Drover1","date":"2015-04-29T15:30:05.218+0000","up_votes":9,"down_votes":1,"body":"Die Range ist einfach zu lange und der CD´s ist einfach zu kurz","replies":[]},{"poster":"Evenrider","date":"2015-05-03T15:00:24.564+0000","up_votes":2,"down_votes":1,"body":"Es gibt doch schon Nerfs auf dem PBE.\nSchaden bleibt, allerdings wird der Mark nur noch 25% Schaden machen und der Dash 75%.\nAlso für 200 True Damage muss man dashen, ansonsten hat man nur noch 50 True Damage.\nUnd der Cooldown wird erhöht.","replies":[{"poster":"Fr3shdumbledore","date":"2015-05-03T20:07:45.231+0000","up_votes":3,"down_votes":1,"body":"Das Ding ist: es wird wieder ein ewiges Rumgeiere. Das Ding wird op ins Spiel gebracht und dann generfed bis es useless ist. Und weshalb? Fast keiner will das Ding haben bzw. sieht eine Notwenidigkeit für diesen Spell! Einfach rausnehmen und ARAM wieder zu dem machen, was es war und zumindest meiner Meinung nach auch sein sollte!","replies":[{"poster":"eingew","date":"2015-05-03T20:21:59.759+0000","up_votes":3,"down_votes":5,"body":"Also mir machts ja mehr Spaß mit als ohne.","replies":[{"poster":"Fr3shdumbledore","date":"2015-05-03T20:45:43.633+0000","up_votes":9,"down_votes":1,"body":"Klar macht es manchen Leuten Spaß, das is doch auch ok so. Aber vielen macht es eben keinen. Wenn man einen Spielmodus nimmt und radikal verändert, dann nimmt man damit in Kauf, dass er für manche Leute den Reiz verliert. Ganz davon abgesehen erinnere ich mich noch an Aussagen Seitens Riot die besagten, dass alle Beschwörerzauber viable sein sollen.... das Ding hat mehr DPS als Entzünden, macht absoluten Schaden, hat mehr Range als die meisten Spells, hat nen CD von 20 Sekunden und nen Dash und lässt sogar den CD noch weiter verringern! Er ist eine einzige Eierlegendewollmilchsau! Wo is da die Balance?\n\nAußerdem ist doch counterplay immer ein Argument für Veränderungen.. immerhin sind der alte Xerath und der alte Gragas diesem Motte zum Opfer gefallen, weil sie angeblich nicht zu countern waren und deswegen für Frust sorgten. Aber ein Spell ohne Castzeit, ein weißer Spell auf weißem Untergrund, den man nicht mit Schilden blocken kann, der einen Dash ermöglicht, gegen den man nichts machen kann, der Sicht gibt sowohl bei der Ausführung als auch nach nem Treffer, der auch durch Def Splls wie Sivirs Schild und Yasuos Mauer fliegt, der auch auf Vasallen wirkt und so nicht mal durch Dodgen komplett vermieden werden kann... der ist legitim?\n\nDie Lösung wäre doch ganz einfach: Riot sollte den Schneeball optional machen und eine weitere Warteschlange einführen für alle Spieler, die gerne ihren alten Mode zurück hätten! Wenn das nicht geht kp.... ich verstehe ja, dass manche das Spiel so lieber mögen. Aber ist es deswegen ok, den anderen den Mode zu verderben?","replies":[]}]},{"poster":"Evenrider","date":"2015-05-04T11:49:29.537+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Fr3shdumbledore,realm=EUW,application-id=cGRapXds,discussion-id=Vq1iVokg,comment-id=00190000,timestamp=2015-05-03T20:07:45.231+0000)\n>\n> Das Ding ist: es wird wieder ein ewiges Rumgeiere. Das Ding wird op ins Spiel gebracht und dann generfed bis es useless ist. Und weshalb? Fast keiner will das Ding haben bzw. sieht eine Notwenidigkeit für diesen Spell! Einfach rausnehmen und ARAM wieder zu dem machen, was es war und zumindest meiner Meinung nach auch sein sollte!\n\nDann verlangt doch nicht, dass es rausgenommen wird!\nWarum wollt ihr es denn alle entfernt haben? Ja gut, sie haben es ein wenig übertrieben, als sie es rausbrachten, aber welcher Champion ist den bitte Balanced, wenn er vom PBE auf die Live-Server wechselt?\nGebt ihnen Zeit, dass sie es nerfen, aber nicht zerstören. Dann wird die Fähigkeit auch sinnvoll sein.\n\nUnd ja es hat eine Notwendigkeit in dem Modus. Die bisherigen Games waren einfach nur langweilig als Bruiser ohne Gapcloser. Poken, Poken, Poken. Als Udyr konnte man dämlich rumstehen und auf den Tod warten oder in den Tod rennen. Jetzt kann man endlich mal Spielen! Allein das ist es schon Wert, dass sie die Fähigkeit erhalten.","replies":[{"poster":"Fr3shdumbledore","date":"2015-05-04T14:59:56.169+0000","up_votes":1,"down_votes":0,"body":"Udyr ist ein Extremfall, das gebe ich zu. Aber andere Bruiser und Tanks waren schon immer stark... wenn man sie spielen konnte! Warwick oder Garen zum Beispiel sind sehr solide Champs in ARAM. Wukong und Jarvan sind sogar sehr stark. Wenn man als Tank oder Bruiser das Early überstanden hat ohne groß zu feeden, hat man in der Regel auch gewonnen!","replies":[{"poster":"Evenrider","date":"2015-05-04T15:12:24.276+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fr3shdumbledore,realm=EUW,application-id=cGRapXds,discussion-id=Vq1iVokg,comment-id=0019000000010000,timestamp=2015-05-04T14:59:56.169+0000)\n>\n> Udyr ist ein Extremfall, das gebe ich zu. Aber andere Bruiser und Tanks waren schon immer stark... wenn man sie spielen konnte! Warwick oder Garen zum Beispiel sind sehr solide Champs in ARAM. Wukong und Jarvan sind sogar sehr stark. Wenn man als Tank oder Bruiser das Early überstanden hat ohne groß zu feeden, hat man in der Regel auch gewonnen!\n\nBei Wukong und J4 und anderen Tanks/Bruisern mit viel CC und Gapclosern stimme ich dir zu. Spiel sie selbst auch sehr gerne.\nGaren selbst ist relativ bescheiden in Aram. Gut er hält sehr viel Poke aus, dank seiner Passive. Ansonsten hat er aber das gleiche Problem wie Udyr. Er muss immer noch hinlaufen. Er wird immer noch Cced, CCed und Cced und erreicht fast nie jemanden.\nWW ebenso. Er kann sich recht gut hochheilen und seine Ultimate ist immer noch sehr tödlich, gerade in Aram wo niemand QSS kauft. Aber ansonsten muss er auch durch die Spells laufen.\n\nUnd gerade dieses Laufen ist gegen 5 ADCs/Mages auf der Aram-Map die reinste Hölle.","replies":[{"poster":"Fr3shdumbledore","date":"2015-05-04T15:35:02.942+0000","up_votes":1,"down_votes":0,"body":"Ja gut, alles hat seinen Counter. Das ist Teil des Spiels. Aber der neue Spell verlagert das Problem nicht nur, sondern macht es noch schlimmer! Ich habe seit es den Spell gibt mehrere Games gemacht und ALLE wurden durch die Tanks entschieden! Wirklich ausnahmslos ALLE!\n\nMit Garen und WW beispielsweise habe ich immer gute Resultate erzielt. Aber sie sind als Tanks eben nicht so leicht zu spielen und man muss sich geschickt anstellen. Jetzt ist es nur noch Faceroll....","replies":[{"poster":"Evenrider","date":"2015-05-04T15:51:47.970+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Fr3shdumbledore,realm=EUW,application-id=cGRapXds,discussion-id=Vq1iVokg,comment-id=001900000001000000000000,timestamp=2015-05-04T15:35:02.942+0000)\n>\n> Ja gut, alles hat seinen Counter. Das ist Teil des Spiels. Aber der neue Spell verlagert das Problem nicht nur, sondern macht es noch schlimmer! Ich habe seit es den Spell gibt mehrere Games gemacht und ALLE wurden durch die Tanks entschieden! Wirklich ausnahmslos ALLE!\n\nKann genau das nicht behaupten. Habe auch mehrere Spiele gemacht.\nHabe meine bisherigen Spiele mal gesucht. In keinem der Spiele gegen reine Poke-Kombos gespielt. Weiterhin meist eben durch zusätzlichen Poke Schaden oder durch spezielle Wombo Kombos (Annie+Wu+Kennen) gewonnen oder verloren.\nKann anhand meiner Erfahrungen sagen, dass Tanks und Assassinen und andere Low Range Champions mehr Auswirkungen auf das Spiel haben. Es ist aber nicht so, dass Long Range Champions nun nutzlos wären. Nein, ihr Poke ist es immer noch, welcher entscheidet, ob der TF gewonnen wird oder nicht. Oder eben Wombo Kombos, aber die sind in dem Modus so oder so OP.","replies":[]}]}]}]}]}]}]},{"poster":"x Steasy","date":"2015-04-29T20:01:31.035+0000","up_votes":8,"down_votes":2,"body":"Macht doch einfach nen neuen Mod wo man nur mit den schneebällen schießt, aber für ARAM ist es einfach viel zu stark!","replies":[]},{"poster":"Saîlor Moon Moon","date":"2015-04-30T18:30:55.122+0000","up_votes":6,"down_votes":1,"body":"Es ist einfach nur noch ein schlechter Witz, wenn du als Xerath beim inneren Turm stehst und aus dem nichts kommen 200 Punkte absoluter Schaden und ein Garen mit 3000 Lebenspunkten lässt sein ganzes Arsenal an dir aus und du entkommst mit Blitz und müder Not nur um den Schneeball vom Alistar zu fressen der wieder 200 Punkte **absoluten** Schaden macht! Der Beschwörerzauber hat (20-5)*0,9 Abklingzeit! das ist nicht mehr witzig! Der überbrückt eine Distanz  von einem Varuspfeil. Ich spiele so sicher kein ARAM mehr.","replies":[]},{"poster":"Chiro1987","date":"2015-05-01T14:37:29.846+0000","up_votes":6,"down_votes":2,"body":"Der neue Summoner Skill muss SOFORT wieder entfernt werden. Sonst ziehe ich die Konsequenzen und schließe mit dem Kapitel LoL ab. Riot hat bei den meisten Aram Spielern (die Aram nicht als \"reinen Funmode\" ansehen) großen Zorn auf sich gezogen. Mir macht der Modus absolut keinen Spass mehr in der jetztigen Form. Wenn ich mir die Kommentare meiner Vorredner durchlese, scheine ich nicht der einzige zu sein, der diese Meinung teilt.","replies":[]},{"poster":"karatekatz","date":"2015-04-30T21:40:41.628+0000","up_votes":6,"down_votes":2,"body":"Dem kann ich mir nur anschließen, seit dem Schneeball macht Aram nciht wirklich mehr Spaß... wo sind da die speziellen Fähigkeiten von Ranges hin wenn ich mit dem Teil mittenrein sprinten kann??","replies":[]},{"poster":"Drover1","date":"2015-04-29T15:01:36.790+0000","up_votes":6,"down_votes":2,"body":"Seh ich genauso...... weg mit diesem nutzlosen Skill  oder macht ein neuen Modi .... Tank und Melee only","replies":[]},{"poster":"Rayar","date":"2015-05-11T21:42:34.923+0000","up_votes":3,"down_votes":0,"body":"Ich habe sehr lange hauptsächlich Aram gespielt und nun nach einer Pause wollte ich wieder reinschauen, allerdings auf dem PBE (macht allerdings keinen Unterschied, da es auf den Live Servern auch aktiv ist). Ich habe insgesamt gut ungefähr 500 Spiele in Aram insgesamt bestritten und stehe nun wirklich davor entweder gar nicht mehr zu spielen, oder komplett auf Summoners Rift zu wechseln.\nEs macht einfach keinen Spaß, wenn man ständig nach diesen Schneebällen Ausschau halten muss, die einen nicht einmal selbst treffen muss, sondern sogar einfach einen Minion treffen müssen und da hat es dann nicht einmal mehr etwas mit Skill zu tun einen zu treffen. Es mag sicher spaßig sein sich als Nahkämpfer alle 19 Sekunden ins gegnerische Team teleportieren zu können, aber man kann auch nicht jedes Aram einen Champion bekommen der gut mit dem Spell harmoniert.\nOkay, wenn ich früher einen Nahkämpfer bekommen habe kamen natürlich gleich Fragen wie \"Warum gerade der?!\" auf, allerdings habe ich keinen wirklich Hasschampion auf Aram und sehe auch kein Spiel als verloren, nur weil ich einen Nahkämpfer bekommen habe. Ich probiere einfach mein bestes und zusammen mit meinem Team kommt dann auch häufig etwas Positives dabei raus, womit man gar nicht gerechnet hat.\nJetzt wirft man einfach nur noch alle 19 Sekunden mit Schneebällen um sich herum und geht auch meist rein, wenn man etwas getroffen hat und solang es nicht unbedingt ein zu kritischer Towerdive war. Währenddessen lässt man das Team wiederum hinter sich zurück, da nicht alle unbedingt nachfolgen. Während man auch guten Schaden beim gegnerischen Team anrichten kann, wenn man erst einmal drin ist, es kann auch ziemlich in die Hose gehen, auch wenn letzteres eher selten vorkommt, sodass es ein verlorenes Spiel bedeutet.\nDer Spell kann meiner Meinung nach ruhig drin bleiben, allerdings in abgeänderter Form. Selber Cooldown wie Flash und dann stört mich auch gar nicht mehr der Schaden und die Reichweite die der Schneeball hat. Aber alle 19 Sekunden ist einfach viel zu hart.\nIch denke nicht wirklich daran, dass sich etwas tun wird und denke, dass es das erst einmal mit ein paar Chillgames auf Aram war. Vielleicht auch nur ein verzweifelter Versuch von Riot die \"Hardcore\" Aram Spieler nach Dominion umzuleiten, damit sich der Spielmodus mit mehr Spielern erfreuen kann. Wohl eher nicht. ^^\nMich sieht Aram auf jedenfall in der Form nicht mehr wirklich, außer ich geh da mit Freunden rein. Mit Freunden macht halt auch so ein unbalanced Gamemode Spaß.","replies":[]},{"poster":"HyperionCH","date":"2015-04-29T15:09:12.201+0000","up_votes":4,"down_votes":2,"body":"Ein Range-Champ müsste eigentlich auch die Möglichkeit haben, den Schneeball dodgen zu können. ;)\n\nADCs haben zudem nun den BT, so dass einiges wieder kompensiert wird.\nRange-APCs galten schon immer als besonders OP. Mit Ludens haben sie nun auch mehr MS, was das Dodgen vereinfachen sollte.\n\nTanks sind schon vorher recht stark in ARAM gewesen, sofern man nicht einfach blind reingeht. Wenn das Game länger dauert, gewinnen meist jene Teams, welche Tanks besitzen.\n\nDen wirklichen \"Buff\" kriegen die Assassinen. Diese waren tendenziell auch jene Champs, welche unterdurchschnittliche winrates haben (z.B. gem. LoLKing: Eve, Akali, Kha, etc.). Ich zweifle aber stark, dass diese Champs nun deswegen OP geworden sind.","replies":[{"poster":"Ezizu","date":"2015-05-01T11:06:13.986+0000","up_votes":3,"down_votes":0,"body":"Wenn 5 Gegenspieler \"Mark/Dash\" haben und der Cooldown bei 20 Sekunden liegt, kann sich wohl jeder vorstellen, dass man als Range-Champ nicht die ganze Zeit den Fokus auf \"dodgen\" legen kann.","replies":[]}]},{"poster":"Elias","date":"2015-05-17T19:43:10.313+0000","up_votes":4,"down_votes":1,"body":"Ich Poste mal einen von mir verfaßten Text den ich schon mal zu dem Thema geschrieben haben.\n\nIch kann ihn ausweichen, aber da sind noch 4 andere Mitspieler plus Vasallen.\nDer Zauber hat eine reichweite von 25 Teemos (2500), das Ulti von Lux hat eine von 33,4 Teemos (3340) nur als Vergleich.\nZAC z.b. Hat den größten nicht ulti Sprung mit 15,5 Teemos (1550) auf Max (auf Stufe 1 nur 1150, 50 mehr als Ammumu) und ein CD von 12s und er muß ihn noch aufladen. Und das alles ist nur der Mark der Desh ist Global und was mich am meisten stört ist das der Ball stellenweise die gleiche Farbe wie der Untergrund hat.\n\nMeine Meinung nach muß der CD hoch auf Flesh niwo die Mark Entfernung auf unter 15 Teemos und die des Deshes max plus 5 Teemos und es können keine Vasallen Markiert werden.\n\nWas mich noch stört ist das Gefühl für den Fehler anderer bestraft zu werden weil die Gegner meine Verbündeten als Hilfe benutzen um an mich ranzukommen. Wenn ich z.B. von einem Skillshots getroffen werde und Sterbe war es mein Fehler, wenn aber ein Vasall oder Mitspieler getroffen wird und ich obwohl ich ausgewichen bin sterbe ist es nur unfair und bestraft ein trotz gutem Spielens.\n\nDie Idee hinter dem neuen Spell ist ja nicht schlecht, nur Toxisch umgesetzt.","replies":[]},{"poster":"Huludxx","date":"2015-05-01T13:47:55.289+0000","up_votes":4,"down_votes":1,"body":"Das wars für mich mit aram. Macht schlicht keinen sinn mehr. Wenn ich etwas spielen will wo alle nur rumspringen spiele ich teeworlds....","replies":[]},{"poster":"YouStoleMyName","date":"2015-05-16T07:49:00.941+0000","up_votes":3,"down_votes":3,"body":"Wie die ganzen ARAM Nerds jetzt hier rumheulen, wir, die SR Spieler, durften wesentlich mehr und viel schlimmere Changes einstecken.\n\nUns wurden ganze Summoner Spells entfernt, einfach neue hinzugefügt etc.. ihr kriegt naxh gut 2 Jahren mal einen neuen Summoner und beschwert euch extremst. Seit doch lieber froh, das versucht wird, Aram für jeden Champ spielbar zu machen.\n\nIch habe absolut keine Lust auf Champions wie Voli, Udyr etc wo du nicht an den Gegner rankommst ohne vorher 80% Leben zu verlieren.\nDer Schneeball bietet nun eine möglichkeit auch bei Engage Schwachen bzw Aram schwachen Champs ein wenig Spaß zu haben.\n\nUnd das absolut jeder den Ball mitnimmt ist totaler Käse. Ich seh oft genug Spieler die lieber auf Barriere oder Heal zurückgreifen grade um den Schneeball wieder auszukontern.\n\nMan nimmt auf SR gegen eine Heallane als Supporter auch an sich lieber ein Ignite mit statt ein Exhaust um die Heals auszukontern.\nUnd wenn ihr wisst, das soviele ja angeblich den Ball nehmen, wieso greift ihr nicht einfach Kontersumms zurück die euch einen Vorteil verschaffen, wenn jemand mit dem Ball reinspringt ?!","replies":[{"poster":"Fr3shdumbledore","date":"2015-05-16T16:07:13.374+0000","up_votes":3,"down_votes":2,"body":"Mal ganz abseits der 1000 Argumente, die gegen den Schneeball sprechen ,geht es ja auch darum, dass ARAM jetzt eben nicht mehr der Spielmode ist, der es war. Es wurde alles auf den Kopf gestellt und vielen macht es, so wie es jetzt ist, keinen Spaß mehr. \n\nDas gleiche trifft btw. auch für viele auf SR zu. Viele der Changes dort haben die Leute wie mich ja erst dazu gebracht, dass wir fast nur noch ARAM spielen. Und jetzt wird uns das eben auch noch kaputt gemacht. Darf man sich dann nicht dagegen wehren? Bzw. es zumindest versuchen?","replies":[{"poster":"YouStoleMyName","date":"2015-05-17T09:59:13.346+0000","up_votes":2,"down_votes":2,"body":"Du darfst dich dagegen wehren, Demonstrationen abhalten oder in den Bundestag gehen und fordern das der Ball entfernt wird.\nÄndert aber nichts daran, das es nicht passieren wird. Da Riot das macht, was Sie wollen.\n\nDas die Community wirklichen Einfluß mit aufs Spiel hat, ist schon seit Jahren vorbei, das solltest du eigentlich wissen.\n\nWir können gerne auch die Geschichte der alten TTT rauswühlen, denn im großen und ganzen, ist dieser Thread das gleiche was passiert ist, als die 3er Map ausgetauscht wurde.\nUnd krass gesagt, wird es nichts dran ändern, der Ball wird bestehen bleiben. \nIch hätte auch gerne Revive auf der SR wieder, denn in Customgames war es schonmal Lustig damit zu spielen, aber der kommt auch nicht wieder. Nichtmal in Custom Games.\n\nIch habe schon alles aufgegeben was Riot jemals versprochen hat. Replay Mode, eine kleine Entschädigung für die täglichen extremen Serverprobleme letztes Jahr etc.. ich sehe LoL momentan nur noch als Geldeinnahme Quelle. :b","replies":[{"poster":"Sirrkas","date":"2015-05-17T10:04:44.247+0000","up_votes":1,"down_votes":1,"body":"Ich bin froh, dass es die alte TT nicht mehr gibt. Die Karte war so schlecht entworfen.","replies":[{"poster":"YouStoleMyName","date":"2015-05-17T10:30:38.799+0000","up_votes":2,"down_votes":1,"body":"Ich persönlich würde aber gerne die alte TTT wieder haben.\nSIehst du, wir sind jetz an einem Punkt angelangt, wo sich die Meinungen unterscheiden.\n\nUnd aus dem Grund ist es schwachsinnig dieses Thema zu Diskutieren.\n\nWürde Riot den Ball wieder entfernen, kämen die Pro - Ball Kandidaten und fordern den zurück. Dann kommen wieder die Anti - Ball Kandidaten und wollen das nicht.\n\nAber, da hier ja soviele Anti sind, wieso schließt ihr euch nicht zu einer Gruppe zusammen und spielt intern Aram und der Ball ist gebannt ? Dann ist euer Problem gelöst.\n\nNur ne Idee, dann ist euer Aram Problem gelöst, aber mein TTT Problem nicht. Ihr glücklichen :o","replies":[{"poster":"Sirrkas","date":"2015-05-17T10:32:32.703+0000","up_votes":2,"down_votes":0,"body":"Wenn du mich mit Anti-Ball Kandidat gemeint hast, ich mag {{summoner:32}} .","replies":[]}]}]},{"poster":"Fr3shdumbledore","date":"2015-05-17T13:01:14.175+0000","up_votes":2,"down_votes":1,"body":"Ja damit hast du wohl leider Recht.... das ist mir auch klar, aber trotzdem will man etwas geliebtes nicht so einfach kampflos aufgeben^^\n\n\"Ich habe schon alles aufgegeben was Riot jemals versprochen hat. Replay Mode, eine kleine Entschädigung für die täglichen extremen Serverprobleme letztes Jahr etc.. ich sehe LoL momentan nur noch als Geldeinnahme Quelle\"\n\nDamals gab es ja einen großen Tread zum Thema \"Entschädigung\", wo Hoffnungen geschürt wurden und, nachdem die Ausfälle beseitigt waren, der liebe Rito-Pente einfach kein Wort mehr reingepostet hat. So ist es ja diesmal auch... Hier im Forum und auch im englischen (sowohl EUW als auch NA) wird sich von Seiten Riots einfach groß nicht zum Thema geäußert. Stattdessen wird einfach geschwiegen und der Sturm abgesessen!  In NA gehts btw. im Forum noch neutlich mehr ab als hier. Aber Riot juckt das gar nicht =)\nUnd die Gamingwelt zeigt ja, dass es auch anders geht: Beispielsweise hatte Hearthstone vor ein paar Tagen auch einige Downzeiten. Das habe ich persönlich nicht mal bemerkt, so gering waren die Auswirkungen. Aber ein paar Tage später hat einfach jeder Spieler zwei kostenlose Kartenpackungen und ne Entschuldigung von Blizzard bekommen. Alle waren happy und genauso war es auch schon mit WoW- Ausfallzeiten (beim Start des neuen Addons z.B.). Riot sitzt solche Sachen eben lieber aus und schweigt sie tot!\n\nWas mich aber wirklich wirklich wirklich stört an dem Schneeball ist ja, dass ich das Gefühl habe, dass Riot einfach nach der leichtesten und billigsten \"Lösung\" für die Balanceprobleme im ARAM gesucht hat. Dann packt man einfach per STRG-C + STRG+V einen Spell aus einem Eventmode rein und das wars. Keine Überarbeitung, keine Anpassung, gar nichts. Ob es die Probleme jetzt löst oder nicht und was die Spieler darüber denken, die den Mode so mochten wie er war, geht Riot halt am Arsch vorbei!","replies":[]}]}]}]},{"poster":"Aêquitas","date":"2015-05-05T14:16:45.437+0000","up_votes":1,"down_votes":2,"body":"Ich kann dir nur zustimmen der neue Spell ist wirklich für die Tonne man kann keinen range mehr spielen so wie es sein sollte weil mann gezwungen wird mit einem meele in den Nahkampf zu gehen und das ist jawohl nicht Sinn der Sache ich finde es nicht so gut habe gerne aram gespielt aber nun kann man diesen spielmodi ja komplett vergessen. Riot macht nach und nach das spiel kaputt sehr gute Arbeit","replies":[]}]}