{"poster":"OnlyInkin","date":"2017-02-01T09:37:22.132+0000","title":"Que vuelva el \"Reclutamiento Normal\" para practicar","subforum":"Charlas Generales","up_votes":80,"down_votes":7,"body":"Hola invocadores !\r\n\r\n-Quer&iacute;a hablar sobre el tema de &quot;por que retiraron el reclutamiento normal?\r\n\r\nYo se que mas de uno le &quot;molesto&quot; esa modificaci&oacute;n ya que todos practic&aacute;bamos nuestra linea favorita en ese modo de juego, me gustar&iacute;a que se sumen y exijamos que vuelva ese modo de juego para podes jugar nuestra linea favorita y no tener que pelear en el modo &quot;Normal selecci&oacute;n oculta&quot; por una linea y ah&iacute; vienen las discusiones y los &quot;Trolls&quot; \r\n\r\nSaludos y espero que tomen esto en cuenta los creadores de League Of Legends","replies":[{"poster":"kiuhm","date":"2017-02-01T13:39:00.782+0000","up_votes":9,"down_votes":0,"body":"Riot gaussrick ya dijo que se podia usar las flex para practicar. Nada mejor como cuando vos tenes ganas de jugar teemo jg y uno de tu team esta en promo.","replies":[{"poster":"Liliths","date":"2017-02-01T13:49:43.148+0000","up_votes":19,"down_votes":2,"body":"https://s30.postimg.org/xztjp0jlt/Condordijo.jpg","replies":[]}]},{"poster":"A Noxian Beauty","date":"2017-02-01T10:36:41.398+0000","up_votes":15,"down_votes":3,"body":"por que les baneaban muchoa yasuo y zed a los niños ratas,entonces rito dijo \"okei macho,estamos perdiendo dinero por que a nuestros clientes predilectos les banean sus campeones rotos preferidos que hacemos?\" entonces otro tipo dijo \"saquemos el draft pick y solo dejemos el blind,asi no podran banear :)\" y entonces al tipo le dieron un ascenso y es el propietario de la mitad de las acciones de rito.","replies":[{"poster":"KeijaShadoll","date":"2017-02-01T21:52:28.024+0000","up_votes":1,"down_votes":0,"body":"Concuerdo , por mi parte sostengo que una de las razones por la cual la comunidad del lol es tan Toxica es la Selec.Oculta","replies":[{"poster":"Insane Sir","date":"2017-02-01T22:10:53.027+0000","up_votes":3,"down_votes":2,"body":"otra de las razones es el hate a x campeon (ridiculo) y flamear a el usuario de x campeon","replies":[{"poster":"KeijaShadoll","date":"2017-02-01T22:20:30.925+0000","up_votes":2,"down_votes":1,"body":"si es que el hate a x campeon nace también del aburrimiento de verlo hacer lo mismo en todos los Games , cosa que a mi no me pasaba en Reclutamiento eran mas variados los picks","replies":[{"poster":"CG Teo","date":"2017-02-02T03:16:02.742+0000","up_votes":3,"down_votes":1,"body":"Lo que a mi me molesta sobre todo es que en NA siguen teniendo Normal draft, pero acá no... Mejor server LAS, best eventos con bardo *Fiesta de máscaras 2016* y con Toxic Pick","replies":[{"poster":"Forero","date":"2017-02-02T12:43:10.162+0000","up_votes":1,"down_votes":0,"body":"Varía de servidor en servidor dependiendo de los jugadores.","replies":[]}]},{"poster":"GameMode","date":"2017-02-03T02:44:09.886+0000","up_votes":1,"down_votes":0,"body":"Bueno ese hate es de rata.","replies":[{"poster":"KeijaShadoll","date":"2017-02-04T02:46:56.155+0000","up_votes":1,"down_votes":0,"body":"y capas que si , yo no soy de hatear a un pj , pero si me caga ver por ej una Kata en 5 games seguidos y en todos los games armarte la misma build, tu supp lo mismo todo lo mismo para que ese pj no haga lo que quiera con una ulti","replies":[{"poster":"GameMode","date":"2017-02-04T03:43:58.532+0000","up_votes":1,"down_votes":0,"body":"Que se lo vea mucho no significa que este terriblemente roto.","replies":[]}]}]}]}]}]},{"poster":"maquiaZ","date":"2017-02-01T15:01:16.991+0000","up_votes":4,"down_votes":4,"body":"men es que ver el mismo campeon en 9/10 partidas cansa lo mismo para vayne. yo jue6o rankeds me da i6ual y siempre intento banear a yasuo por el muro (maineo a mf)","replies":[]}]},{"poster":"Tecnicomando","date":"2017-02-01T12:13:48.305+0000","up_votes":2,"down_votes":0,"body":"No lo van a colocar,por la simple razon de forzar a usar la flex....","replies":[{"poster":"Tsume Asterisk","date":"2017-02-01T14:21:26.139+0000","up_votes":6,"down_votes":0,"body":"Lo siento, pero no. Jugué flex con un amigo nada más habilitarse la cola, yo quedé oro I y él bronce II. Y hasta ahí llegamos ambos, no la tocamos más ¿De qué sirve una cola para jugar con amigos si va a ser restrictiva? La cola flex no tiene ni pies ni cabeza","replies":[]},{"poster":"Liliths","date":"2017-02-01T13:26:50.192+0000","up_votes":3,"down_votes":4,"body":"Y Que importa? seguiremos reclamando, no vamos a parar por un argumento tan estupido como el que metio Riot -.-","replies":[{"poster":"Tecnicomando","date":"2017-02-01T14:14:13.523+0000","up_votes":4,"down_votes":0,"body":"revisa el foro hay un post con mas de 300 usuarios reclamando y minimo unos 100 temas al respecto...\n\nNo lo van a colocar,no escuchan a la comunidad solo ven lo que les conviene a sus estadisticas\n\nsalu2","replies":[{"poster":"Liliths","date":"2017-02-01T14:15:39.268+0000","up_votes":4,"down_votes":3,"body":"Reitero, seguiremos reclamando.","replies":[{"poster":"Benja God","date":"2017-02-01T21:14:32.499+0000","up_votes":2,"down_votes":1,"body":"No vas a conseguir nada","replies":[]},{"poster":"KeijaShadoll","date":"2017-02-01T22:02:49.493+0000","up_votes":1,"down_votes":0,"body":"reclamando acá no vas a sacar nada , a Riot le da igual LAS y LAN los hacen para que los jugadores de NA tengan donde jugar  y no molesten hasta les daban skin contal que se vallan , queres tener la mínima chance? anda al servidor principal y quizá te presten atención te recuerdo que todo se decide ahí el resto de los servers solo comunican las quejas de los jugadores y es para asegurarse que no pierden plata .","replies":[]}]}]}]}]},{"poster":"RNGesus","date":"2017-02-01T11:16:54.281+0000","up_votes":4,"down_votes":1,"body":"Las normales sin bans no serian un problema, si se pudiese elejir el rol, pero el juego nisiquiera esta balanceado ahora mismo y esta lleno de trolls, esta plagado de partidas donde puede haber hasta 3 espejos jaja.","replies":[{"poster":"Liliths","date":"2017-02-01T13:27:28.467+0000","up_votes":6,"down_votes":1,"body":"Aun asi, en modo Reclutamiento es mejor.\nNo hay yasuos, zed, vaynes, no hay lineas espejos, nada de eso.","replies":[{"poster":"KeijaShadoll","date":"2017-02-01T21:58:02.980+0000","up_votes":2,"down_votes":1,"body":"Reclutamiento te hace jugar al lol para ganar si vas contra un team que trata de hacer eso , aprendes el counter pick  ,a respetar la linea del otro porque vas lo que queres ,  no discutís con gente si entras primero a la sala o no , arrancas a ver la composición del team y ver que les sirve que vos saques para ganar , mill veces mas sano que una sala toxica donde competís con tus compañeros para jugar lo que vos queres \n, pero espera a que salga un juego como Overwatch o algún otro Moba que les arranque a sacar jugadores y a bajar la popularidad y vas a ver como la ponen enseguida , ya paso antes con la salida de Overwatch les arrancan a sacar lugares y que pasa? skin gratis hextech vengan a jugar , no me sorprendería que pongan las Reclutamiento solo para atraer gente a su juego de nuevo.","replies":[]},{"poster":"maquiaZ","date":"2017-02-01T14:59:29.628+0000","up_votes":1,"down_votes":0,"body":"true","replies":[]}]},{"poster":"WhiteMax","date":"2017-02-01T14:13:07.369+0000","up_votes":2,"down_votes":4,"body":"\"el juego nisiquiera esta balanceado\" y que hacen en todos los parches?\n\nY lo de los no bans es algo obvio, sino la gente nunca podria practicar (contra jugadores) los campeones.","replies":[{"poster":"Choripan Cósmico","date":"2017-02-01T14:57:57.315+0000","up_votes":3,"down_votes":1,"body":"Que hacen en los parches ? y ... dar buffs innecesarios a Draven por ejemplo ... o nerfear pavadas en la Q de Darius y la pasiva ... ''Darius esta nerfeado''  mentiras ... son nerfs minimos que cualquier Darius con un poco de sentido comun puede ignorar sin lamentarse","replies":[{"poster":"WhiteMax","date":"2017-02-01T16:29:09.362+0000","up_votes":4,"down_votes":0,"body":"\"buffs innecesarios\" los unicos innecesarios son los de los campeones que se ven en todas las partidas, ahora que haya un campeon que ni aram se ve y deciden buffearlo para que se empieze a ver es otra cosa, aunque si lo de Draven fue exagerado.\n\nY lo de Darius es un Nerf, ahora que tu quieras que sea como \"Nidalee\" eso es otra cosa, Darius es un Coloso y el orgullo de noxus por algo.","replies":[{"poster":"Choripan Cósmico","date":"2017-02-01T23:50:10.319+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=WhiteMax,realm=LAS,application-id=v7qsfXsE,discussion-id=IHhLqfnP,comment-id=0001000100000000,timestamp=2017-02-01T16:29:09.362+0000)\n>\n> &quot;buffs innecesarios&quot; los unicos innecesarios son los de los campeones que se ven en todas las partidas, ahora que haya un campeon que ni aram se ve y deciden buffearlo para que se empieze a ver es otra cosa, aunque si lo de Draven fue exagerado.\n> \n> Y lo de Darius es un Nerf, ahora que tu quieras que sea como &quot;Nidalee&quot; eso es otra cosa, Darius es un Coloso y el orgullo de noxus por algo.\n\nEs un nerf lo de Darius pero insignificante ... donde no se nota ... la pasiva que es como 10 puntos de nerf y el daño cuando pega con el mango. Pero de la cantidad de vida que se cura no hablamos ni del daño verdadero que saca su ulti. Eso deberia tener nerfs.","replies":[{"poster":"GameMode","date":"2017-02-03T02:46:33.085+0000","up_votes":1,"down_votes":1,"body":"Tu forma de balancear es un nerf.","replies":[{"poster":"Choripan Cósmico","date":"2017-02-05T23:19:25.733+0000","up_votes":1,"down_votes":1,"body":"Que Balancear ? no creo .... yo creo que sin la curacion que Darius recibe de su Q estaria algo cerca de ser balanceado. Un nerf directo al problema de El daño excesivo de su ulti y la curacion de su Q es la solucion. Es horrible jugar con un luchador contra Darius. Si no lo feedeaste en 30 min en tu linea se va a feedear llendo a las otras.","replies":[{"poster":"GameMode","date":"2017-02-06T06:37:34.779+0000","up_votes":1,"down_votes":1,"body":"Yendo* \n\nA ver, Darius es fuerte a melee, cualquier ADC se lo come vivo, CUALQUIERA, después cualquier mago que sepa mantener las distancias también.\n\nTodos los campeones tienen puntos fuertes y débiles, el de Darius es el kiteo. Y si tenes un campeón de melee depende de cual lleves le podes ganar. \n\nHay que aceptar que nunca vas a ganar todos los match up con un solo campeón porque todos tienen un counter.","replies":[{"poster":"Choripan Cósmico","date":"2017-02-06T21:16:24.264+0000","up_votes":1,"down_votes":1,"body":"Contra Ryze no puede es un inutil pero igual en TF la cosa cambia ...  la solucion es un nerfeo ... los tops en su mayoria son a melee y tener alguien que con un item armado les ralentize ... les baje la armadura ... les aplique sangrado de la pasiva y aparte que eso le buffee y su ulti haga daño verdadero no es sano ... y mira que no mencione la curacion de su Q y la velocidad de movimiento con cada basico por la cuchilla oscura","replies":[{"poster":"GameMode","date":"2017-02-07T03:00:33.358+0000","up_votes":1,"down_votes":1,"body":"Pero si no esta OP, todos los champs tienen habilidades y son superiores a otro campeón en base a estas.\n\n Darius tiene debilidades notorias que son fácilmente explotables, que vos no sepas explotar dichas debilidades es problema tuyo.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"AuroraExecution","date":"2017-02-01T13:09:35.789+0000","up_votes":2,"down_votes":4,"body":"No va a volver.\n\nJuga Rankeds flexibles para practicar.","replies":[{"poster":"Liliths","date":"2017-02-01T13:26:15.342+0000","up_votes":5,"down_votes":7,"body":"Eso es trollear ^^","replies":[{"poster":"Una Nutrinha","date":"2017-02-01T21:06:01.690+0000","up_votes":2,"down_votes":2,"body":"Nope","replies":[{"poster":"Arondight","date":"2017-02-02T01:10:39.768+0000","up_votes":4,"down_votes":1,"body":"Se están jugando un elo en una \"ranked\" así que es troll por donde se le mire...\nAdmitamos todos que nadie quiere tener una medallita de bronce ensuciandole el perfil. Sea del tipo de raked que sea.","replies":[{"poster":"Una Nutrinha","date":"2017-02-02T23:52:05.696+0000","up_votes":1,"down_votes":0,"body":"Y donde practicamos? se supone que son mas flexibles esas partidas, por lo tanto no voy a trollear, pero voy a practicar campeones que tal vez no me salgan perfectamente los combos, entre muchas otras cosas","replies":[]}]}]}]}]},{"poster":"Cyclosarin","date":"2017-02-01T14:17:50.551+0000","up_votes":4,"down_votes":2,"body":"Coincido con todos, o la mayoria:\n\n- Que vuelva por favor el normal draft y, subo la apuesta, que borren el blind pick\n- Uso las Flex para probar champs y buiilds. Demás está decir que absolutamente NADA me importa el resultado si puedo aprender o mejorar en algo.\n- Y, como dicen por ahi, las blind picks no las pienso tocar nunca mas en la vida.","replies":[{"poster":"maquiaZ","date":"2017-02-01T15:02:55.231+0000","up_votes":1,"down_votes":0,"body":"yo uso las flex para practicar campeones","replies":[]}]},{"poster":"Avant Garde","date":"2017-02-01T19:25:18.477+0000","up_votes":2,"down_votes":1,"body":"Ojala que vuelvan, estoy harto de los pelotudos que vienen a ranked flex a \"practicar\".","replies":[]},{"poster":"Enju san","date":"2017-02-03T03:27:33.406+0000","up_votes":1,"down_votes":0,"body":"Lo que hago yo es usar una smurf","replies":[]},{"poster":"Zesc","date":"2017-02-02T16:03:21.981+0000","up_votes":1,"down_votes":0,"body":"Propongo hacer algo, podemos llevar un post sobre el tema, con la mayor cantidad de positivos, e ir al foro de NA etiquetar a algun Rioter Desarollador, y que nos den una mejor respuesta, por que aca en LAS no quieren hacer nada.","replies":[]},{"poster":"Duse","date":"2017-02-02T02:46:44.456+0000","up_votes":1,"down_votes":0,"body":"Flex Q","replies":[]},{"poster":"lordeman10","date":"2017-02-02T02:36:12.297+0000","up_votes":1,"down_votes":0,"body":"practicá en flex, es lo mismo que las normales de antes","replies":[]},{"poster":"OnlyInkin","date":"2017-02-01T17:16:25.466+0000","up_votes":1,"down_votes":0,"body":"Al menos deberían dejar seleccionar la linea en las Normales de selección oculta, en las Flexibles yo juego con mas de un amigo, para mi debería ser todo como antes, esa es mi opinión, solo para decir \"hicimos un cambio\" hicieron eso porque ya no saben que cambiar, con respecto a Darius estaría bueno un \"Nerf\" como darle enfriamiento aunque mate con su R ya que tranquilamente podes hacer un Pentakill sin tener manos.\n\n(Soy el que inició esta charla)","replies":[]},{"poster":"Darkfoe703","date":"2017-02-01T12:53:24.022+0000","up_votes":1,"down_votes":0,"body":"Ojalá lo devuelvan. Por ahora, uso la FlexQ para practicar campeones y líneas, y pasarla bien con amigos. Intenté volver a blind... y no, ya no la toco ni con un palo.","replies":[]},{"poster":"TapateLasPatitas","date":"2017-02-01T17:18:10.662+0000","up_votes":1,"down_votes":1,"body":"No quiero sonar pesado ni nada, pero las draft pick no volverán, a menos que los servidores más grandes o importantes sientan una presión por parte de los usuarios, por si acaso, este no es uno de ellos.","replies":[]},{"poster":"WhiteMax","date":"2017-02-01T17:00:55.626+0000","up_votes":1,"down_votes":1,"body":"Con el tema de practicar contra jugadores estoy de acuerdo, pero si quieres practicar el como farmear, poner wards, campeones, etc. Esta el modo sandbox que lo pondran muy pronto (por ahora esta en el pbe).","replies":[]},{"poster":"GameMode","date":"2017-02-01T19:28:32.036+0000","up_votes":2,"down_votes":3,"body":"Aguanten las Blind Pick, caretas.","replies":[{"poster":"SweetChildØMine","date":"2017-02-02T03:30:48.830+0000","up_votes":1,"down_votes":1,"body":"x2","replies":[]}]}]}