{"poster":"GoCryForMe","date":"2016-11-20T11:05:48.800+0000","title":"Netter Neuling sucht Community für Spaß am Spiel","subforum":"Clans & Teams","up_votes":2,"down_votes":1,"body":"Hallo Everybody,\r\n\r\nrelativ neuer Spieler, gerade lvl 30, entspannt, lernbereit und mit freude am Spiel sucht eine nette Community f&uuml;r lustige Runden, gute Gespr&auml;che, neue Erfahrungen und vieles mehr. :)\r\n\r\nZu mir:\r\n23 Jahre alt,\r\nm&auml;nnlich,\r\n&Uuml;berwiegend wochenend zocker,\r\nTs und Headset vorhanden.\r\n\r\nIch w&uuml;rde mich &uuml;ber kommentare freuen, oder meldet euch einfach ingame bei meinen Account &quot;GoCryForMe&quot; ( Name wird noch ge&auml;ndert, hatte fr&uuml;her ne andere bedeutung als man denkt :D)","replies":[{"poster":"fess123","date":"2016-11-21T07:26:49.441+0000","up_votes":1,"down_votes":0,"body":"Hi GoCryForMe,\n\ndu hast es satt alleine in der Flex Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/cOWosEff-aequilibritas-esports-sucht-rekruten-community-esports-lol-csgo-overwatch-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]},{"poster":"Nycaria","date":"2016-11-20T11:58:26.493+0000","up_votes":1,"down_votes":0,"body":"Hey GoCryForMe,\n\nvielleicht wäre unsere Community ja etwas für dich. Wir sind die Ü18 Multigaming Community [♠ Nerds Go Casual ♠](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/R5f6AOEY-oa-nerds-go-casual-oa-a18-multigaming-community-laadt-zum-zocken-ein-oa). Unsere Hauptbereiche sind League of Legends und Overwatch, allerdings findet man auch für andere Games meist noch Mitspieler, sofern man mal keine Lust auf LoL hat :)\nMomentan haben wir im LoL Bereich etwa 160 registrierte Member und Trials bei einem Altersdurchschnitt von 21. Man findet also zu den meisten Zeiten bei uns jemand um Rankeds, Normals etc. zu spielen :)\n\nIch werde dich einfach mal ingame adden, falls du noch weitere Fragen haben solltest :)\n\nLiebe Grüße\nSahashiKaya aka Carmen","replies":[]}]}