{"poster":"bashnslash","date":"2018-03-07T00:37:20.076+0000","title":"RAnked system is HORRID","subforum":"Gameplay & Strategy","up_votes":3,"down_votes":3,"body":"The concept you put up is the dumbest thing ive ever seen. You set up matches with people who dont know how to play, dont know how to work with a team, and you group people like me with them. Therefore i am stuck for life in Bronze 5 even though i play well enough to be in silver.  Its embarrassing knowing you as a company set this up this way.  Especially seeing how next season youre wiped out  of your ranked position anyways so what is the point in playing ranked at all? its the dumbest concept. And it needs to be fixed. But i know you wont read this. You wont agree or do anything about. Just wanted to bring to your attention how idiotic this concept of ranked play is.","replies":[{"poster":"Sulbatamol","date":"2018-03-10T22:06:11.452+0000","up_votes":1,"down_votes":0,"body":"Lol. Yeah you are true. There is just no skill difference between bronze and silver.  They are hopeless. So dont feel too bad.","replies":[]},{"poster":"Husy15","date":"2018-03-08T02:05:13.321+0000","up_votes":1,"down_votes":0,"body":"For starters:\n\nYou're in the OCE- forums.\n\nSecondly: Ignore the wording everyone is using here and these are the basic principles:\n\n1. you're inconsistent, meaning even if you play well 50% of games.. the other 50% are the reason you aren't progressing...\n\n2. from just a quick look (im not gonna spend hours..) it seems like you're lacking CS, and aren't helping the team much (Kill%)\n\ntry working on just those 2 things.. try not titling, and you'll see yourself progress.","replies":[]},{"poster":"TheDemonEmperor","date":"2018-03-07T09:36:36.921+0000","up_votes":1,"down_votes":0,"body":"http://na.op.gg/summoner/userName=bashnslash+ \n\nOPEN THE STAT PAGE \n\nand pls take a look at those terrible numbers you are putting out. Actually, all your games it look like some 1 else is doing better than you. You are not better or good. You're barely floating on average. \n\nYou dont deserve to be higher league. Your stat shown you are the average of your bronze 5 league.","replies":[]},{"poster":"Chedley","date":"2018-03-07T01:27:20.424+0000","up_votes":1,"down_votes":0,"body":"You should try not being terrible at the game","replies":[{"poster":"HEIPILAOGONG","date":"2018-03-07T08:56:14.528+0000","up_votes":1,"down_votes":0,"body":"These are the sort of comments that makes for a bad community.","replies":[]}]},{"poster":"Roguestoney","date":"2018-03-07T01:02:03.935+0000","up_votes":1,"down_votes":0,"body":"If you were good at the game you wouldnt get paired with shit people 😉","replies":[{"poster":"HEIPILAOGONG","date":"2018-03-07T08:34:51.293+0000","up_votes":1,"down_votes":0,"body":"That's a kinda subjective comment really. Depends on what is good and bad in your opinion?\n\nTo bashnslash, Bronze 5 may seem difficult, but try to carry the game by playing an impactful role. If you are good at adc, be prepared to have a shit support and try to carry. Bot lane carries hardest atm. If you are bad at adc, play mid or jungle and learn how to roam at the right times. If you select the right champions (e.g. evelynn, yi, akali, tryndamere), bronze 5 should be a piece of cake.\nYou have a less than 40% winrate on Garen. Drop him until you understand the top lane more. Watch NEACE on Youtube for climbing lessons. Garen should stomp bronze 5, probably the best champion to choose top because teams don't know what to do against tanks in that elo. But yeah watch NEACE (he streams on twitch.tv also) because he coaches all levels, you can learn a lot by just watching his vods.","replies":[]}]}]}