{"poster":"ZenuXGameS","date":"2016-03-25T16:25:40.618+0000","title":"Doble skin las?","subforum":"Charlas Generales","up_votes":1,"down_votes":6,"body":"Buena, perdon si no estoy al dia pero por lo que he visto metieron la artesania hetchex o como se diga y te regalan una skin gratis, y me dijero que le dieron una skin gratis al todos los del servidor de laspor un concurso que se hiso de lan vs las, yo actualmente estoy de viaje y regreso en 2 dias y no he estado al tanto de mi cuenta la ultima ves que jugue fue el viernes, y por suposision mia habran 2 skins gratis en el servidor de las? Gracias","replies":[{"poster":"Jungle Clown","date":"2016-03-25T16:28:40.161+0000","up_votes":1,"down_votes":0,"body":"La skin esa podes gastar fragmentos naranjas que te dan 800 en el cofre y la skin te saldra algo asi como 675 por ahi o podes canjear un ward, la otra skin es la del evento si sumaste puntos","replies":[{"poster":"ZenuXGameS","date":"2016-03-25T16:45:14.763+0000","up_votes":1,"down_votes":0,"body":"Y como uno pudo sumar puntos?","replies":[{"poster":"Mazer Rakham","date":"2016-03-25T18:40:41.248+0000","up_votes":1,"down_votes":0,"body":"jugando premades durante el evento\nco que hayas sumando 2 puntos ya tenes las recompensas","replies":[]}]}]},{"poster":"Help Support","date":"2016-03-25T16:41:10.536+0000","up_votes":1,"down_votes":0,"body":"Se una por el evento de mascaras que ganamos 1 skin y la artesania te regala un cofre pero lo de la artesania hextech es en todos los servixores","replies":[{"poster":"ZenuXGameS","date":"2016-03-25T16:44:12.022+0000","up_votes":1,"down_votes":0,"body":"Gracias","replies":[]}]},{"poster":"Ks Erwyn","date":"2016-03-25T16:32:40.174+0000","up_votes":1,"down_votes":0,"body":"La mier.... q estas desinformado, nunca fue una competencia ente las vs lan, el cofre de hex. con esencia suficiente para desbloquear permanentemente el contenido lo recibieron todos menos el server de turkia donde aun no esta la artesanía , Lan recibió un premio consuelo del que ya no hablare.....","replies":[]},{"poster":"danye15000","date":"2016-03-25T16:31:05.224+0000","up_votes":1,"down_votes":0,"body":"si y no,la skin gratis es del evento, pero te dan un cofre premiun de la artesania donde sale un fragmento de skin de ward, un fragmento de skin de champ y esencia para convertirlos en skins de verdad.\npuede darse que te salga un fragmento de skin que cueste demaciada esencia y no te alcanze aun convirtiendo el fragmento de skin de ward a esencia como tambien te puede alcanzar para ambos","replies":[]}]}