{"poster":"Pure Cynicism","date":"2016-06-14T08:16:07.047+0000","title":"Peel in der SoloQ","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hi,\nich spiele seit einigen Wochen Main-Adc und bin damit ziemlich erfolgreich (rund 63% Winrate auf Jinx nach 70 Spielen). In den letzten Spielen war es allerdings immer so, dass ich in den Teamfights direkt gestorben bin, weil ich keinen Schutz hatte. Dabei sind das Problem nicht die gegnerischen Assassinen oder Fulltanks, sondern vor allem die Offtanks. So was wie Xin, Jax, Hecarim, Shyvana, Vi etc. Jetzt lautet meine Frage an diejenigen Main-Adcs, die damit &uuml;ber Silber 1 hinausgekommen sind: Wie sollte man sich in Teamfights als Adc, wenn man wei&szlig;, dass man alleine die Backline darstellt, verhalten? Soll erst nach 10 Sekunden zum Teamfight sto&szlig;en? Soll ich in der Mitte meines Teams bleiben, auch wenn es nach vorne st&uuml;rmt?\n\nDas frustriendste Beispiel ist schon ein paar Spiele her: Wir hatten Alistar, Ekko, Shyvana und Ryze. Alle vier sind in die Gegner reingerannt. Ich musste somit alleine gegen Xin und gegen Zed klarkommen, die stumpf auf mich engaged sind.","replies":[{"poster":"Blütentüte","date":"2016-06-17T11:42:21.099+0000","up_votes":1,"down_votes":0,"body":"Also wenn ich Spaß haben und lernen will spiele ich ADC.\nWenn ich aufsteigen will spiele ich meistens Jungle oder Mid. \nADC ist immer noch die schlechteste Rolle um in Lowelo aufzusteigen außer man smurft.\nDu kannst natürlich immer mit einem premate zusammen spielen der dich peelt dann sollte das auch alles kein Problem sein :D","replies":[]},{"poster":"BlackMorphues","date":"2016-06-14T08:38:11.512+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\ntja das ist leider unser Schicksal als ADC's ^^. Vor allem wenn du unmobile ADC's spielst wird dir das leider öfter passieren als du denkst das dein Team nicht auf dich achtet und der Assasin , im schlimmsten Fall, ungehindert zu dir kommt und dich um nietet. Spielst du solche unmobilen Champs hast du im Prinzip (abgesehen von Items wie Steraks,GA,MAW...) im Teamfight nur 2 Möglichkeiten.\n\n\nA: Dein Support oder andere können dich Protecten (z.B. Allistar,Janna,Lulu,Sona)\nB: Du wartest bis ein großteil der Ults raus ist und die z.B. für den MID-Carry verwendet wurden. In der Zeit kannst du zwar nur wenig Schaden machen aber wenn du sofort stirbst wirst überhaupt keinen Schaden mehr machen.\n\nAndere ADC's als Jinx,MF (also alle ohne Dash) können sich gegen sowas deutlich besser wehren wie z.B. Lucian, Caitlyn die immerhin noch etwas Distanz zwischen sich und den Gegner bringen können.\nDu musst einfach schauen ob es sinnvoll wäre in diese Comb., bzw. gegen die Gegner Comb. (in deinem Fall) Jinx zu picken da das auch schnell nach hinten losgehen kann, wie du wahrscheinlich schon gemerkt hast.\nZur Not kannst noch den Chat benutzen und deinem Sup sagen das er versuchen soll etwas auf dich aufzupassen, ob er das dann allerdings macht ist eine andere Sache^^.","replies":[]}]}