{"poster":"Kumatora","date":"2016-04-03T05:02:56.641+0000","title":"Problemas con SMS Movistar RP","subforum":"Problemas Técnicos","up_votes":5,"down_votes":0,"body":"Desde el 1 de Abril, no se si es un error, pero al enviar el SMS al 1005, 1006 y 1007, no me llega una respuesta de mi c&oacute;digo para cargar RP. Me ha pasado que a veces tengo que esperar cierto periodo de tiempo para cargar de nuevo ya que me lo avisa el 1008, Pero esta vez no me llega ningun tipo de respuesta. Quisiera saber si es un problema de Movistar, de Riot o de mi propio Celular.","replies":[{"poster":"DGB Smity","date":"2016-04-03T16:05:29.243+0000","up_votes":3,"down_votes":0,"body":"me pasa exactamente lo mismo, desde ayer he intentado comprar RP con sms Movistar y nada, ni una respuesta al sms. Por lo menos descarto que es un problema de mi celular jajajaj ya que a otros también les pasa, esperemos que Riot solucione pronto esto{{item:3070}} \n\nSaludos","replies":[]},{"poster":"Zippy Zenpin","date":"2016-04-03T16:26:09.139+0000","up_votes":2,"down_votes":0,"body":"Sip, yo estoy en las mismas, mande un mensaje al 1005 y aun no me llegan los RP, pero tampoco me han descontado saldo. Creo que es mas problema con Movistar, si fuera de Rito entonces ellos avisarian desde ayer.","replies":[]},{"poster":"Excalibeer","date":"2016-04-05T20:31:50.305+0000","up_votes":1,"down_votes":0,"body":"http://boards.las.leagueoflegends.com/es/c/charlas-generales/3gKtK3Ia-eliminacian-de-forma-de-pago-mediante-movistar-por-favor-lean-y-opinen-por-supuesto","replies":[]},{"poster":"Hi God Lee","date":"2016-04-03T21:41:16.867+0000","up_votes":1,"down_votes":0,"body":"Rito nose que pasa al recargar riot points con la tarjeta visa me sale este mensaje Tu pago fue declinado por el proveedor de tu tarjeta. Por favor ponte en contacto con ellos para recibir más información.","replies":[{"poster":"Hi God Lee","date":"2016-04-03T21:41:48.118+0000","up_votes":1,"down_votes":0,"body":"Sorry quise decir Riot","replies":[]}]},{"poster":"IG Aizen","date":"2016-04-03T20:12:04.428+0000","up_votes":1,"down_votes":0,"body":"me pasa lo mismo amigos desde ayer que estoy esperando la recarga pero no me llega el mensaje de vuelta pero tampoco riot nos responde que  esta pasando","replies":[]},{"poster":"Kumatora","date":"2016-04-03T20:02:45.102+0000","up_votes":1,"down_votes":0,"body":"Bueno, al menos me alegra saber que no soy el único con el problema y que al menos no les descuenta saldo. Yo tengo un plan y lo que gaste al final se suma a la factura del mes. Seria bastante desagradable el que se sumara el dinero siendo que no me ha llegado ningún código de vuelta.","replies":[]},{"poster":"OG Yung Plague","date":"2016-04-03T16:28:13.447+0000","up_votes":1,"down_votes":0,"body":"Tengo el mismo problema desde ayer que intento comprar rp y no llega el mensaje\npero tampoco descuenta el saldo a esperar que lo solucionen u-u\n{{sticker:slayer-jinx-unamused}}","replies":[]}]}