{"poster":"sbepuz","date":"2019-04-17T10:01:35.966+0000","title":"rakan","subforum":"Campioni e gameplay","up_votes":8,"down_votes":1,"body":"parliamo di rakan e di quello che succederà nella patch 9.9\n\n> The Quickness (R):\n> Charm duration increased to 1.5/1.75/2 seconds from 1/1.25/1.5 seconds.\n> Movement speed during ultimate increased to 100% from 50%.\n> Bonus movespeed from hitting a champion increased to 200% from 150%.\n> Movement speed duration decreased to 3 seconds from 4 seconds.\n> Rakan can no longer use his W or his E during his ultimate.\n> Hitting multiple champions will now refresh the movement speed boost, but not the duration of the boost.\n\ncapisco che rakan sia un buon champ nel match up rakan vs tham kench in competitive, ma a parte questo match up il champion, dopo numerosi nerf alle resistenze presenta già molte difficoltà nell'ingaggiare\nin lane, inoltre presenta molti match up a lui sfavorevoli, ed è per questo che è difficile vederlo in particolare in soloq\n\nl'unica cosa che rende rakan un champ è la combo r+(flash)+w e si scappa di e\n\ncome si può pensare che rakan, con le resistenze che ha attualmente, possa utilizzare solo la ulti per correre in mezzo ai nemici e poi scappare via sempre con il movement speed di ult? già in lane è impensabile che il champ riesca a correre in faccia alla bot lane nemica, figuriamoci in un fight. capisco che adesso se colpisce 3 target praticamente è più veloce di un hecarim....ma se non può combinare la sua ulti con la sua w....come è possibile giocarlo?\n\n\ni mean, a parte le stronzate che la riot sta facendo in soloq con match making and lp win/lose....pure a fare cagate con i champion? ma avete assunto dei turchi alla riot games?","replies":[{"poster":"War Of Damacia","date":"2019-04-17T13:53:09.944+0000","up_votes":5,"down_votes":0,"body":"Allora facciamo che pure a {{champion:24}} durante la E non può jumpare.\n\nChe nerf è il \"Non poter usare le spell\" durante la suprema??? {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"sbepuz","date":"2019-04-17T14:25:59.429+0000","up_votes":2,"down_votes":0,"body":"{{sticker:slayer-pantheon-rainbows}}","replies":[]}]},{"poster":"Flaren","date":"2019-04-17T14:01:20.392+0000","up_votes":4,"down_votes":0,"body":"Sono pienamente d'accordo! Rakan è un personaggio che adoro, la sua fluidità nei movimenti e la sua meccanica me lo hanno fatto amare e  lo rendono divertente da giocare. Con questi cambiamenti perderebbe completamente la sua identità oltre che diventare praticamente inutile (addirittura ciò che fa nella cinematic risulterebbe fasullo! xD)\nNon riesco ad entrare nell'ottica di un engage fatto usando solo la R e correndo in mezzo ai nemici senza poter nemmeno sfruttare la E per tornare indietro o shieldare un alleato in difficoltà, non è mica intargettabile! E nemmenco così tankoso soprattutto dopo gli ultimi nerf. A questo punto tanto varrebbe giocare Rammus support, stessa meccanica circa, danno Aoe di R e molta più resistenza ._. \nSpero vivamente che tornino sui loro passi >.&lt;","replies":[{"poster":"sbepuz","date":"2019-04-17T14:27:08.889+0000","up_votes":2,"down_votes":0,"body":"{{summoner:6}} {{summoner:1}}  rakan per riuscire ad ingaggiare ahahahhaha","replies":[{"poster":"Flaren","date":"2019-04-17T14:31:25.139+0000","up_votes":3,"down_votes":0,"body":"Fino a quando non inseriranno che non può nemmeno usare le summoner.... x,D","replies":[{"poster":"sbepuz","date":"2019-04-17T14:41:40.640+0000","up_votes":1,"down_votes":0,"body":"{{item:3070}}","replies":[{"poster":"Flaren","date":"2019-04-17T21:02:01.103+0000","up_votes":3,"down_votes":0,"body":"Fresco fresco da surrender at20... io scherzavo çwç\nRakan\n[Changelist / Context - Rakan has other changes in testing on the PBE!]\n\n    Base HP increased from 480 to 540\n    Base Armor increased from 29 to 32\n    Base AD lowered from 70 to 58\n    Base MR increased from 30 to 32\n    MR growth increased from .5 to 1.25\n    Grand Entrance (W) dash speed increased from 1500 to 1850\n    The Quickness (R)\n        \"Rakan has a .5s cast time (he can still move) where he can no longer use his 2 or Flash\"\n\n(il 2 sarebbe la W)\n\nEdit: dovrebbe riferirsi solo al channeling il non poter usare W e Flash o almeno così sembrerebbe da twitter, insomma, è meno peggio di prima.","replies":[{"poster":"sbepuz","date":"2019-04-17T22:38:00.812+0000","up_votes":2,"down_votes":0,"body":"mmmm va capita meglio\nse è come scritto nel tuo edit \"potrebbe\" essere ancora chiamato un champ x)\n\nma se intendono che per castare la ulti ci vuole 0,5 sec e poi non potrà usare abilità.....è peggio di prima ahahahaha\nil base ad lowered....lo uccide definitivamente in lane contro melee che prima poteva abusare","replies":[]}]}]}]}]}]},{"poster":"OblitusWolf","date":"2019-04-17T11:33:27.149+0000","up_votes":4,"down_votes":1,"body":"Ah allora non sono solo io che ho fatto 2 ranked +16 -20 totalmente a caso quando ieri me ne davano 21 a win, bello. Per il fatto di Rakan non ho parole, proprio ora che lo stavo mainando, fantastico.","replies":[{"poster":"sbepuz","date":"2019-04-17T12:05:12.687+0000","up_votes":3,"down_votes":0,"body":"nha calcola in diamond vincere 14 lp (a diamond 4) è già troppo..ci son game dove si prende 11 lp senza saperne il motivo\n\nbasta vedere che il rank 1 in euw gioca contro i diamond","replies":[]}]},{"poster":"V Í K","date":"2019-04-18T15:34:43.356+0000","up_votes":2,"down_votes":0,"body":"Rakan è un chamèpion troppo forte questo cambio è piu che giustificato anzi fosse per me gli diminuirei pure un po le statistiche e aumenterei i cd sulle spell cosi magari è balanced","replies":[{"poster":"dani3690","date":"2019-04-18T16:01:37.705+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=V Í K,realm=EUW,application-id=cAOZwaUi,discussion-id=ATXEGftU,comment-id=0006,timestamp=2019-04-18T15:34:43.356+0000)\n>\n> Rakan è un chamèpion troppo forte questo cambio è piu che giustificato anzi fosse per me gli diminuirei pure un po le statistiche e aumenterei i cd sulle spell cosi magari è balanced\n\nLa sua fase di corsia è fin troppo debole al momento, quindi se non sai giocarci contro è colpa tua. Prova a prendere una janna, maxa la W con vantaggio del mago ladro e vedrai che lo ammazzi pure sotto torre (anche se forse questo esempio è pure troppo crudele Ahahah, il raggio di azione delle sue spell è ben più corto di quanto sembri)","replies":[{"poster":"sbepuz","date":"2019-04-18T17:09:44.541+0000","up_votes":1,"down_votes":0,"body":"era for troll, sa quanto tilto quando mi dicono \"picca rakan\"\ne io: ma hanno un team che mi fa esplodere prima che finisco la combo x)","replies":[]}]},{"poster":"sbepuz","date":"2019-04-18T17:09:07.958+0000","up_votes":1,"down_votes":0,"body":"ahahahhaha imagine be banned....ma poter scrivere sul forum x)\nio direi giusto giusto -100 hp e siamo apposto","replies":[]}]},{"poster":"dani3690","date":"2019-04-18T13:08:03.032+0000","up_votes":2,"down_votes":0,"body":"Rakan è un campione che adoro e se devo essere sincero il non potere usare R + W è una cosa che distrugge l'identità del campione. Ma dall'altra parte dovrei vedere se diventa più efficacie la combo flash + R + W anche se ho dei dubbi.\nIl fatto che la W sia più veloce nel cast forse compenserà il nerf, ma solo contro i campioni che non hanno dash o robe varie per evitare la spell.\nSono un poco perplesso, mi piace la velocità extra perchè così non sarei obbligato a prendere sempre quelle dannate rune della stregoneria per la velocità ma la seconda parte non mi convince","replies":[{"poster":"sbepuz","date":"2019-04-18T13:32:35.579+0000","up_votes":1,"down_votes":0,"body":"mmm con il nerf che avevano attuato fare flash r+w non era fattibile x), in quanto una volta attivato tutto il kit, si era impossibilitati ad usare le altre abilità\n\nora da quello che si è capito l'hanno ricambiato. dopo che si attiva la ulti bisognerà aspettare mezzo secondo per usare la w, il dubbio è: quel mezzo secondo...permetterà a rakan di ingaggiare? o il team nemico avrà fatto in tempo a preparare i disengage?\n\nil bello di rakan era proprio quello che io chiamo \"l'effetto sorpresa\" dove magari saltando sugli alleati di e riusciva a far un engage inaspettato...quel mezzo secondo potrebbe rovinare questa cosa..in quanto una volta attivata la ulti, rakan è obbligato a buttarsi dentro, o perde tutta la sua utilità","replies":[{"poster":"dani3690","date":"2019-04-18T15:58:17.728+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=sbepuz,realm=EUW,application-id=cAOZwaUi,discussion-id=ATXEGftU,comment-id=00050000,timestamp=2019-04-18T13:32:35.579+0000)\n>\n> mmm con il nerf che avevano attuato fare flash r+w non era fattibile x), in quanto una volta attivato tutto il kit, si era impossibilitati ad usare le altre abilità\n> \n> ora da quello che si è capito l'hanno ricambiato. dopo che si attiva la ulti bisognerà aspettare mezzo secondo per usare la w, il dubbio è: quel mezzo secondo...permetterà a rakan di ingaggiare? o il team nemico avrà fatto in tempo a preparare i disengage?\n> \n> il bello di rakan era proprio quello che io chiamo \"l'effetto sorpresa\" dove magari saltando sugli alleati di e riusciva a far un engage inaspettato...quel mezzo secondo potrebbe rovinare questa cosa..in quanto una volta attivata la ulti, rakan è obbligato a buttarsi dentro, o perde tutta la sua utilità\n\nSe stai in un cespuglio l'effetto sorpresa lo mantieni, se stai facendo un team fight in soloQ in elo medio secondo me l'unica cosa che noti è l'imprecazione dell'utilizzatore di rakan, in competitivo lo puoi direttamente buttare.\n\nIl ritardo di mezzo secondo ha più senso rispetto a levare del tutto la combo, ma secondo me ci perde in reattività, come se avesse una animazione molto lunga che ti fa aspettare inutilmente. E sappiamo tutti quanto sia brutto morire o veder qualcuno morire solo perchè stai aspettando un coldown in ritardo di mezzo secondo","replies":[{"poster":"sbepuz","date":"2019-04-18T17:10:48.272+0000","up_votes":1,"down_votes":0,"body":"y..ma stiamo già dicendo che il brush deve essere pinkato o dewardato...sono già troppe condizioni anche per la fase di lane\n\ndi sicuro molto meglio che non poter usare il suo kit...ma in ogni caso, ne esce morto","replies":[]}]}]}]},{"poster":"Retardo DiCaprio","date":"2019-04-17T18:49:55.711+0000","up_votes":1,"down_votes":1,"body":"I cambiamenti introdotti nel pbe non sono necessariamente introdotti nella patch, non hanno nerfato gli scaling a morgana figuratevi se passano questi nel caso in cui rakan fosse ingiocabile. Non credo sia il caso di alzare un polverone così. \n\nAd ogni modo, senza dubbio rakan ha un potenziale di engage e in teamfight enorme. Non sono d'accordo sul fatto che lo si butti giù in questo modo, ma sono d'accordo a nerfarlo. Credo che comunque tutta la movement speed che stanno dando per compensare l'assenza dei dash sia un grosso punto a favore dato che ha il doppio della movement speed bonus più un altro doppio una volta colpito qualcuno. Rakan è un champ che paga la scarsa e difficile lanephase con un contributo enorme nei teamfight, e onestamente non sono mai stato d'accordo col potenziale della sua combo per gli engage. Non avendo ancora visto gli effetti veri e propri nel pbe non posso esprimermi con accuratezza, ma se con l'aumento della movement speed (o eventualmente aumentandola ancora di più) si riesce a recuperare la perdita di due dash (dei quali uno applica anche un altro cc) sono pienamente a favore di questo cambiamento, che gli darebbe meno potenziale in combattimento ma comunque un ottimo potenziale di fuga dopo l'engage.","replies":[{"poster":"Cry of the Celts","date":"2019-04-17T23:14:43.370+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=%%%%%%o DiCaprio,realm=EUW,application-id=cAOZwaUi,discussion-id=ATXEGftU,comment-id=0004,timestamp=2019-04-17T18:49:55.711+0000)\n>\n> I cambiamenti introdotti nel pbe non sono necessariamente introdotti nella patch, non hanno nerfato gli scaling a morgana figuratevi se passano questi nel caso in cui rakan fosse ingiocabile. Non credo sia il caso di alzare un polverone così. \n\nL'ultimo nerf l'aveva reso ingiocabile, ma è stato implementato e poi ovviamente cambiato 1-2 patch dopo","replies":[]},{"poster":"sbepuz","date":"2019-04-17T18:57:56.493+0000","up_votes":1,"down_votes":0,"body":"perdonami, ma proprio come dici tu rakan è forte per il suo engage e basta. non ha altri punti di forza\nper attuare il suo engage necessita di attivare la ulti e di utilizzare la w (dopo aver già attivato la ulti), in modo da connettere instantaneamente la ulti mentre si dasha e non poter missare la w\n\na primo impatto verrà da dire: troppo forte!\nil punto è che negli ultimi tempi rakan è stato nerfato talmente tanto su armor/magi resist e hp che riuscire a fare la combo senza flash o senza l'utilizzo di un alleato per fare da trampolino, rende quasi impossibile giocarlo (sia in soloq che in competitive)\ntogliendogli la possibilità di utilizzare \"w\"/\"e\" nei fight.....come si pensa che questo champ possa venir utilizzato?\n\nun rakan che non riusciva con tutto il suo kit ad ingaggiare perchè moriva prima di completare la combo....come potrà correre verso 5 avversari per attivare la movement speed? (la movement speed bonus viene presa dopo aver colpito almeno 1 target)","replies":[]}]},{"poster":"sbepuz","date":"2019-04-17T15:54:34.990+0000","up_votes":1,"down_votes":1,"body":"il downvote probabilmente è dello sviluppatore del nerf di rakan x)","replies":[]}]}