{"poster":"SparksElm","date":"2016-05-11T01:25:20.672+0000","title":"Looking for dedicated team","subforum":"Team Recruitment","up_votes":1,"down_votes":0,"body":"I&#039;m looking for a dedicated team to start ranked with. I&#039;ve been playing since mid 2013 (if memory serves) and have only ever played 16 ranked game, 6 in season 3 (lost all of them, I was terrible back then) and 10 within the last few days of season 4 (got placed silver 3, if memory serves). I have Teamspeak, Raidcall, Skype and Discord for voice communication. My preferred roles are ADC and Support, I&#039;d say I&#039;m half decent at Top and Mid, and Jungle is, by far, my worst. I want to make it clear here that I like playing Quinn (despite the changes), so unless I have a good reason to use a different ADC I&#039;ll probably pick her.\r\n\r\nLet&#039;s be clear here, I&#039;m looking for a *mature, friendly* team. That means if you&#039;re immature or whine about how everyone else was the reason you lost a game (or anything along those lines), don&#039;t bother because I&#039;ll just leave.\r\n\r\nFeel free to add me in-game to discuss this further.","replies":[{"poster":"Smee007","date":"2016-05-12T00:54:45.545+0000","up_votes":1,"down_votes":0,"body":"Looking for a team, gold 5 support. smee007 is my name  :D","replies":[]},{"poster":"Hyde","date":"2016-05-11T04:21:56.811+0000","up_votes":1,"down_votes":0,"body":"Hey I am Bronze 1 right now trying to climb but want to start a team so I can actually have some form of communication rather then pings. I main ADC and support but used to play top and I will flex it to jung if needed. I can play mid but not as good as the other 4. I'll add you and see what we can do :)","replies":[]},{"poster":"JaydonRynn","date":"2016-05-11T03:53:15.264+0000","up_votes":1,"down_votes":0,"body":"hey i main adc, currently gold 4 atm, feel free to add to discuss or somethin","replies":[]},{"poster":"LetsTwitch","date":"2016-05-11T01:41:09.114+0000","up_votes":1,"down_votes":0,"body":"Hey, I play top, support and jungle but mostly utility or tank champs rather than carry. I have skype and will add you in-game","replies":[]}]}