{"poster":"Omni Presents","date":"2015-11-06T10:26:49.595+0000","title":"So I just played against Yorick for possibly the first time ever","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Seriously, I can&#039;t think of a previous time I have ever played against him in a lane, maybe very rarely on the same team and even more rare on the enemy team in another lane.\r\n\r\nBut fuck me, those ghouls, they have no hit box. I hit them maybe 4 times the entire game, and that included some AOE.\r\n\r\nI think definitely they need to be somewhat target-able so you can actually do something and not just run when they get summoned every 3 seconds.","replies":[{"poster":"McRuthless","date":"2015-11-06T12:04:05.998+0000","up_votes":1,"down_votes":0,"body":"You could try using attack move if you want to auto them more reliably. The hitbox is probably small on purpose to stop you missclicking on them instead of more important targets. I imagine itd be pretty annoying if you were constantly hitting them by accident instead of last hitting minions or hitting champions in teamfights.","replies":[{"poster":"Omni Presents","date":"2015-11-06T14:03:04.174+0000","up_votes":1,"down_votes":0,"body":"Well that can be how they are used, get in the way so you can't hit what is needed, after all you do want to stop your opponent in anyway you can.\n\nBut I think it is something else and not the hitbox, I played a game as Yorick directly after this and another Yorick on the enemy team...\n\nIn that game I hit maybe 70% of his ghouls. The difference was the first Yorick, not being able to click on the target, I got smashed, the second game being able to hit them, this second guy didn't stand a chance, although he admitted he was new and played quite bad, that wouldn't change how hard the ghouls are to hit.\n\nIt is not just the hitting, but the fact you try to hit them and instead click to move, click to move, click to oh shit, he is running form the bush on top of me. I am initially thinking the first guy was hacking, when I think back to that game I would mouse over them and the cursor would change and a split second later change back like I was no longer mousing over them. In the second game it was much much MUCH easier as if the hit box was back to normal.\n\nAgain, the second guy admitted he was bad, I mean he build AP Yorick and didn't realise he had some AD scaling. But still, that will not change the hit box on the minions.","replies":[]}]}]}