{"poster":"Omni Presents","date":"2016-01-31T05:35:05.350+0000","title":"Fuck Bronze","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"I stopped rank for a few days, took a day or so break altogether, played some ARAM when I came back and got a few wins to get back into it.\n\nMy first rank game back I end up 5/0 under 15 minutes in top lane with a double kill, no help. Bot lane in the same time went 0/11. I roamed to bot for the first time to at least try something and top lane loses 2 towers. I get another double kill and go 7/0 taking our one and only tower, while bot lane end up going a combined 0/12 before our AD goes and AFK&#039;s.\n\nI mean WTF? I have a near perfect game, two solo double kills, no deaths, defended my lane against 2-3 at times and the minute I leave my lane I lose 2 towers and the enemy team just run over us. So what should I do, do I roam to bot lane earlier to try and help them, or do I stay top to try get some CS and kills? I did go help, but then lose 2 top towers in the meantime.\n\nFuck bronze, 3 of us have a good game, our AD plays like a stinking pile of shit and pulls our support into it and than goes AFK, now we all get a loss that 4 of us did not deserve thanks to one person.","replies":[{"poster":"CHEESYLEEKS","date":"2016-01-31T23:07:29.348+0000","up_votes":2,"down_votes":0,"body":"just keep at it mate,your almost bronze 1.","replies":[]},{"poster":"Struggle","date":"2016-01-31T08:09:13.403+0000","up_votes":1,"down_votes":0,"body":"Your roam was ineffective and very costly for your team since you lost 2 towers. If bot lane is losing that hard and you're winning your lane as hard as you say then ward up through their jungle and press your advantage. \n\nSee if some jungle help can turn it around for them but if it's too far gone just leave them and focus on other 2 lanes. \n\nAs for afk it will happen from time to time nothing you can do about it","replies":[{"poster":"Omni Presents","date":"2016-01-31T08:47:10.406+0000","up_votes":2,"down_votes":0,"body":"No our jungle was actually really good and doing well 'trying' to assist bot lane, our Lucian was just THAT bad, even just over 10 minutes the enemy bot lane was already too fed and there was nothing that any of us could do to stop us losing.\n\nOur support, who went downhill with Lucian, climbed back pretty quick, stopped dying and scored a few kills, when I say fuck bronze, I mean, FUCK BRONZE. I have lost with S+ scorecards, that should never happen, it is meant to be a team game yet you can out do your entire team, and all the enemy and still lose due to some fucktards you get matched with.\n\nThere is just so much shit in bronze it gets you down and then you start playing retarded because you stop giving a shit, it is quite sad TBH.","replies":[{"poster":"Struggle","date":"2016-01-31T09:00:52.280+0000","up_votes":1,"down_votes":0,"body":"In that case all you can do is use it as an experience and take whatever positives you can from it.\n\nI am in bronze you can have a look I don't think I've let it make me play retarded yet though.","replies":[{"poster":"Omni Presents","date":"2016-01-31T09:20:25.396+0000","up_votes":1,"down_votes":0,"body":"No you are still trying in all games you are playing in, but you are also mostly playing someone who doesn't engage so your score is either high KDA or low KDA, not low K and high D.\n\nI play mostly tanky champs, so I am almost always the first to engage and therefore if my team bail the first to die. But I have gotten to the point even if my team are shit, I just charge in like a dickhead, if you are going to lose, lose in style!","replies":[{"poster":"Struggle","date":"2016-01-31T09:33:47.667+0000","up_votes":1,"down_votes":0,"body":"It's got nothing to do with kda. Kda doesn't win you games. \n\nThe throws are real in bronze though so just coz you think your team is shit doesn't mean you're out of the game. The enemy could throw but if you're just charging in like a dickhead you're just creating more opportunities for the enemy to punish.","replies":[{"poster":"Omni Presents","date":"2016-01-31T11:15:32.863+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=CaptainHindsight,realm=OCE,application-id=Ntey9fRZ,discussion-id=QJxU2VN0,comment-id=00020000000000000000,timestamp=2016-01-31T09:33:47.667+0000)\n>\n> It's got nothing to do with kda. Kda doesn't win you games. \n\nWow, someone else who actually understands the game properly, the amount of players who talk shit just because your KDA isn't good is astounding. What I meant was that you are playing Ziggs a lot, if you are playing right you either have high KDA  or low depending on your team.\n\nI've been here 5 years, the amount of game I have seen that are over early is amazing. I don't give a shit about the KDA, the amount of towers, Baron or anything for that matter, what is real is the attitude of the players, and not what they say, but how they play.\n\nI see it time and time again, players who refuse to help and do nothing but bitch and moan, that is when a game is over, when a player stops helping. Fair enough that a player can complain for whatever reason, but the moment they take that shit awful attitude and show it in their gameplay, the type of player who simply refuses to help someone else just because one bad play, one mistake, accidentally got the last hit as a support, that is when you know the game is over.\n\nYou can have someone who is an asshole but plays well, still helps his team and still tries to win, but when they stop helping, game over, every single time. I remember one game not too long ago that stands out true to this, our mid simply refused to help, period. He NEVER was with the team, he only joined when he could get a kill and than fucked off somewhere safe. His KDA was great, lots of CS from all the farming he was doing, and even though our team was winning it was inevitable that we would lose.\n\nWe had 4 players trying their best to win, eventually got under 2 inhibitor towers, but due to one person refusing to help us, we lost. It happens all the time, an asshole player only out for themselves losing the game.","replies":[{"poster":"Struggle","date":"2016-01-31T21:16:41.064+0000","up_votes":1,"down_votes":0,"body":"Yea player attitude varies greatly from game to game. You get the players who are team focused and positive want to help and don't rage if you give up first blood or die repetitively in lane. Then you can have the player who is only focused on themselves, the player that thinks they're better than everyone else, then you can have the ragers/blamers who never do anything wrong it's always someone elses fault.\n\nWhat it sounds like for you though is that you need to be in a team, and that will remove all the troubles you are experiencing.","replies":[{"poster":"Omni Presents","date":"2016-02-01T00:59:25.633+0000","up_votes":1,"down_votes":0,"body":"I did try team play years ago, and got to Gold with ease, no problems. But it comes down to time, I normally play late at night, but now am having a game at midday and sometimes play in the afternoon, trying to find a team that I can constantly play with is not the easiest.\n\nThey should introduce some sort of guild system to allow players to join in groups easier.","replies":[]}]}]}]}]}]}]}]},{"poster":"wonkey donkey","date":"2016-01-31T05:52:51.837+0000","up_votes":2,"down_votes":0,"body":"no offence bud but by your champ history you belong in bronze.\n\njust because you do okay one game doesent mean sht.\n\nonly way to raise elo is to be consistant and you are deffinetly not consistant at all","replies":[{"poster":"Omni Presents","date":"2016-01-31T08:43:10.198+0000","up_votes":1,"down_votes":0,"body":"With the shit I am getting, and it is not just me, in game I get others on my team stating how bad our team is, there is not much I can really do. I once took on three in the top lane, died a few times and had a negative KDA, but still defended my lane better than my team, the scores show I played shit, but my in game play shows I done much better than my team.\n\nI always say we need to remove KDA, it really show nothing for the game play we have. Look at my games, two games ago with Vaynes KDA, looks great yes? But her game play was terrible. My team mates were constantly asking her to join the team and stop split pushing, literally one minute after I asked her to join us she split pushed bot, we all died and came less than 10 seconds to losing our base and the game.\n\nKDA means jack shit, it is how you play.","replies":[{"poster":"wonkey donkey","date":"2016-01-31T12:24:01.052+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gintamino Bay,realm=OCE,application-id=Ntey9fRZ,discussion-id=QJxU2VN0,comment-id=00000000,timestamp=2016-01-31T08:43:10.198+0000)\n>\n> With the shit I am getting, and it is not just me, in game I get others on my team stating how bad our team is, there is not much I can really do. I once took on three in the top lane, died a few times and had a negative KDA, but still defended my lane better than my team, the scores show I played shit, but my in game play shows I done much better than my team.\n> \n> I always say we need to remove KDA, it really show nothing for the game play we have. Look at my games, two games ago with Vaynes KDA, looks great yes? But her game play was terrible. My team mates were constantly asking her to join the team and stop split pushing, literally one minute after I asked her to join us she split pushed bot, we all died and came less than 10 seconds to losing our base and the game.\n> \n> KDA means jack shit, it is how you play.\n\nmate you blame your team 24/7 if you were decent you would carry yourself out of bronze anyways you complain about trolls like it only happens to you the chances are even for you as other players of getting trolls so if you play decent you will get out of bronze anyways even if you don't  win every game","replies":[{"poster":"Omni Presents","date":"2016-02-01T01:44:26.402+0000","up_votes":1,"down_votes":0,"body":"I have actually been to Gold before, a few years ago, I done it by premaking teams.\n\nSolo is a different story, towards the end of last year I made Silver something and now am seeing the terrible bronze players. I know how to play, but generally do not choose the carry champs and therefore need to rely on my team to do something.\n\nLast game our WW was ALWAYS out of position, and I mean always whilst complaining of lag each time he gets out of position. And I don't mean a little out of position, he is WW, he doesn't have to be behind the tank, he was walking down the wrong side of the mid bush straight into the enemy at times while others near him were waking back into our own jungle away from the enemy.\n\nThe same went for our Yas, running straight through the jungle on his own towards the enemy jungle and being ganked over and over with no wards, ulting solo into a 5 man team, or trying to farm late while the enemy was in the lane with him, than proceeding to die. I was second damage in both categories on my team and only 1 kill behind as a mostly tank build. I really shouldn't be doing 6K more damage than an AD who died less than me.\n\nI do complain a lot, but if I don't, no one will. I am trying to show you all how bad bronze is and let Riot see, I have had loses with an S+ scorecard before showing my stats were good, but my team just couldn't do anything to help. As mostly playing a tank there is only so much I can do, if my team can't get any damage off, if they can't get early farm to get some decent mid to late items, I can't do anything.\n\nRather than be the one who runs around trying to hyper carry, stealing all the kills and failing to have an impact, I decide to be more team centric, pick a tankyer champion in whatever role I am doing, some CC maybe, allow myself to stay in the fight longer and therefore try make more impact, but it's not quite working as it should.","replies":[]}]}]}]},{"poster":"Ingramator","date":"2016-01-31T05:59:05.648+0000","up_votes":1,"down_votes":3,"body":"***","replies":[{"poster":"Omni Presents","date":"2016-01-31T08:48:03.029+0000","up_votes":1,"down_votes":0,"body":"Yeh, 5 AFK, sure thing boss.","replies":[]},{"poster":"CHEESYLEEKS","date":"2016-01-31T15:14:36.323+0000","up_votes":1,"down_votes":0,"body":"On summoners rift were your team consists of 5 people? Seems legit","replies":[]}]}]}