{"poster":"Omni Presents","date":"2015-11-08T18:22:33.955+0000","title":"OP Burst Champions need to be reworked to fit better with the game.","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Pretty much anyone with THAT much burst damage needs to be reworked. There are not enough of those champions to justify keeping them in the game.\r\n\r\nI look through 127 champions and can see maybe 5, possibly only 4 that have absolutely absurd burst damage, that is 4% of all champions have the top burst damage, and the only real burst damage. It would be OK if there was like 50% that can do that, but when there are only 4-5 that can one combo you and NOT take any damage plus have some AOE, yeh, that doesn&#039;t quite fit with the other 122 champions.\r\n\r\nI may not be the best in this game, but something is quite wrong when I CANNOT beat 4 champions, never have, and probably never will. Yet when I decide to play them I play extremely well for someone who rarely ever plays those 4 champions, and when I say rare, I don&#039;t even own one of the 4 I am referring to, I only play them when they are free and STILL wreck face.\r\n\r\nI don&#039;t even need to list who they are, everyone in this games knows who I am referring to. It just makes no sense allowing only a handful of champions have that kind of damage when everyone else must play it safe.","replies":[{"poster":"Lord Kylar Alice","date":"2015-11-08T23:23:23.653+0000","up_votes":1,"down_votes":0,"body":"Do you want to name the champs or nah, because it seems like you're embarrassed to say what you're losing to lol","replies":[{"poster":"Roguestoney","date":"2015-11-08T23:36:47.550+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Best Burrito AU,realm=OCE,application-id=Ntey9fRZ,discussion-id=dvatHERd,comment-id=0003,timestamp=2015-11-08T23:23:23.653+0000)\n>\n> Do you want to name the champs or nah, because it seems like you're embarrassed to say what you're losing to lol\n\nI don't think this person has heard of a tank champion either...","replies":[{"poster":"Omni Presents","date":"2015-11-09T11:27:58.007+0000","up_votes":1,"down_votes":0,"body":"Oh yeh, I've heard of them, but when you are running around with 600 AP, 40% CDR and roughly 3-4 seconds on your spells, popping some 500 damage each spell, that shit hurts, you don't even need to worry about the tank, just smash the squishies and you win.","replies":[{"poster":"Lord Sesshomaru","date":"2015-11-09T18:32:41.161+0000","up_votes":2,"down_votes":0,"body":"\"just smash the squishies and you win.\"\nyou ever met Voli, Shyvanna, cho'gath etc? if you had you wouldnt be shrugging them off so easily.\n\nalso if the enemy aced us and are now coming for your nexus turrets and just one person is about to respawn to defend, id rather them be Voli or cho, than a squishy like kogmaw or xerath.","replies":[]}]}]},{"poster":"Omni Presents","date":"2015-11-09T11:34:14.055+0000","up_votes":1,"down_votes":0,"body":"You should know who they are, but in no particular order we have: Annie, Fizz, Veigar and LB, the type of champions that can do so much damage that unless a full MR tank goes against them, anyone else just dies.\n\nI know this because I can do this, they are some of the easiest to win with due to how much damage they can do, the fact they either have a troll move or a stun and just win.","replies":[{"poster":"Lord Kylar Alice","date":"2015-11-09T23:39:31.657+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=akaRaven,realm=OCE,application-id=Ntey9fRZ,discussion-id=dvatHERd,comment-id=00030001,timestamp=2015-11-09T11:34:14.055+0000)\n>\n> You should know who they are, but in no particular order we have: Annie, Fizz, Veigar and LB, the type of champions that can do so much damage that unless a full MR tank goes against them, anyone else just dies.\n> \n> I know this because I can do this, they are some of the easiest to win with due to how much damage they can do, the fact they either have a troll move or a stun and just win.\n\nYou can avoid the bullshit that those champs have in their kits relatively simply unless you pick a poor champion to verse them. You can blink/dash/zhonya's/whatever to dodge an obvious Annie engage and then kill her since her W/R are most likely down. You can dodge Fizz's Fish/E pretty easily and can dash out of his Q, though I will admit he has extremely low cooldowns so unless you kill him instantly before he goes golden/jumps/kills you you're going to lose, but most Fizz players have poor positioning and are easy to catch out. Versing Veigar, as long as his ult doesn't instakill you, you can dodge everything else of his unless he has allies which trap you or he positions his skillshots well. The only problem with LeBlanc is her passive which needs a much higher cooldown, otherwise you can dodge almost all of her damage if you position properly and move at the right times. As long as you have a strong DoT/Oracle's/insane burst, you'll beat her.\n\nThere's many champions that are much more toxic to verse because of how easily they can beat you. Rengar (AD) for example can instantly delete one, maybe 2 squishies as soon as he leaves stealth while remaining difficult to see coming unless your team knows what they're doing and AP Rengar can delete all of your squishies while chunking tanks for a ton of damage. ","replies":[]}]}]},{"poster":"Olee","date":"2015-11-10T15:05:52.274+0000","up_votes":1,"down_votes":0,"body":"A. Season 6 is fucking squishy killing burst champions right in the ass\nB. This entire post is just fucking NO.","replies":[]},{"poster":"VENI VIDI VICI","date":"2015-11-10T14:55:07.986+0000","up_votes":1,"down_votes":0,"body":"I think there should be more options to counter it eg items","replies":[]},{"poster":"Zorphiax","date":"2015-11-09T06:08:21.645+0000","up_votes":1,"down_votes":0,"body":"{{item:3102}} is a good way to stop that first hit of burst which normally brings the rest of the delayed high burst damage, {{item:3139}} is a good way to remove CC(unless your silenced). Finally, my all time favorite {{item:3157}}!!! Makes you immortal for 2.5 seconds but you can't move.\nNow I picked these items because:\n1. Most high burst champions are Magic. (unless you fed an ADC.)\n2. it helps against most situations (expect {{item:3139}} this item isn't that good in most situations.)","replies":[]},{"poster":"Gravelord","date":"2015-11-08T23:19:46.857+0000","up_votes":1,"down_votes":0,"body":"Nerf {{champion:83}} pls","replies":[]},{"poster":"McRuthless","date":"2015-11-08T22:24:44.276+0000","up_votes":1,"down_votes":0,"body":"Assassins and burst damage have a place in the game. Without them, glass cannon DPS champs would be broken OP. If you think these 4 champs are so unbeatable its probably because the types of champs you play suck against them, which doesn't mean EVERYTHING sucks against them (and I dont know who exactly you're refering to since theres a lot more than 4 champs with good burst, and assassins in general are pretty weak atm anyway)","replies":[]},{"poster":"Lord Sesshomaru","date":"2015-11-08T19:18:05.621+0000","up_votes":1,"down_votes":0,"body":"So im guessing you play squishy champs? that might be your problem, seeming how squishy champs are countered by bursty ones. you'll probably find that if you play rammus or zac you suddenly have less of a problem, and magically ADC's become so brokenly op.\n\nalso there are less sustained damage AP casters than there are bursty ones, are you suggesting that we get rid of azir/cass/karth as well just because there arent 63+ of them?","replies":[]}]}