{"poster":"Omni Presents","date":"2015-09-12T04:43:50.135+0000","title":"There has to be a way you can stop playing with a certain player","subforum":"Miscellaneous","up_votes":2,"down_votes":0,"body":"Something, anything, even temporary.\r\n\r\nI have one in particular who I remember from a previous game, Fid jungle. He failed to gank, period, had a shit ass attitude the entire game, complained that we were all playing bad and just never helped, ever.\r\n\r\nHis stats at the end of the game were the worst, aside from both supports, and yet he blamed us for the lose. Move forward a few games and there he is again, with the same shitty attitude, the same bad plays, failed ganks, shit stats and apparently it was our fault again.\r\n\r\nMove forward a couple of days, he is at it again, this time complaining from team select. This time he didn&#039;t even gank my lane once, complained as per usual, and again had the same shit stats compared to everyone else, except this time he KS a lot to make them look better.\r\n\r\nThis, this will be my first and so far only player I do not want to ever play with, period. I would have dodged, but I am in my promos and no matter how bad or how shitty someone&#039;s attitude is, you could always have worse on the enemy team and somehow still win.\r\n\r\nTowards the end even the enemy team was saying they will report him for his attitude, players like this should not be ranked, not even in this game. They start the game with a cup full of salt and just seem to have issues.","replies":[{"poster":"Mı Ke","date":"2015-09-14T08:45:55.886+0000","up_votes":1,"down_votes":0,"body":"You are very lucky to play with the same player 3 times!!! Legit","replies":[{"poster":"Essembie","date":"2015-09-15T14:19:18.757+0000","up_votes":1,"down_votes":0,"body":"happens all the time mate. Very easy to spot if you mute them or block them in previous games.","replies":[]},{"poster":"Omni Presents","date":"2015-09-15T11:14:48.800+0000","up_votes":1,"down_votes":0,"body":"UNlucky I think is the word you are after.\n\nAnd it isn't the first time, I have played with the same person 3 times more than once so far in some 60 ranked games, all those games have been loses.","replies":[]}]},{"poster":"Légs","date":"2015-09-12T13:10:51.941+0000","up_votes":1,"down_votes":0,"body":"Why don't you just wait a couple minutes, probably 5, maybe watch a youtube video before you queue again. Surely they would of queued by now :O","replies":[{"poster":"Omni Presents","date":"2015-09-12T15:18:23.610+0000","up_votes":1,"down_votes":0,"body":"I do that now, a bit late, but better than never.\n\nOr I come here lol.\n\nBut still, the game places you in the same game with the same players makes it rather annoying and not just the next game, but games, days, weeks later and they are still the same shit that you don't want to deal with.","replies":[]}]},{"poster":"Lord Sesshomaru","date":"2015-09-12T05:47:12.312+0000","up_votes":1,"down_votes":0,"body":"The only problem is that people will take advantage, say i get wrecked by a vayne in ranked, i just press the 'dont play with this person again' button and then i can play my next ranked game without having to worry about being matched against her again.","replies":[{"poster":"Omni Presents","date":"2015-09-12T10:42:14.523+0000","up_votes":1,"down_votes":0,"body":"There has to be some way. I have lost 2 promos thanks to the same 2 separate people in each promo try.\n\nRight now if I didn't have to deal with those 2 people than I would probably be silver 3, I know it is not much, but playing those extra 20 odd games just to get one promo when, if not for those trolls, I would have already been promoted and gone further up the ladder.\n\nIf this is something to look forward to, the extra games for nothing, I will be waiting awhile to get somewhere decent.","replies":[]},{"poster":"GigaPube","date":"2015-09-12T07:06:04.914+0000","up_votes":1,"down_votes":0,"body":"but then if shes so good she wouldnt be on your team which is supposedly not any better","replies":[]}]},{"poster":"Garens Harem","date":"2015-09-12T05:14:25.017+0000","up_votes":1,"down_votes":0,"body":"you can stop playing with a certain player by getting out of their mmr FARRRR WAYY\n\nso climb high up hard","replies":[{"poster":"Omni Presents","date":"2015-09-12T10:39:26.433+0000","up_votes":1,"down_votes":0,"body":"Well that's one way.","replies":[]}]}]}