{"poster":"Omni Presents","date":"2015-09-09T14:39:12.941+0000","title":"Anyone else stuck at Bronze 1?","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"I have now had 3 promo chances, I get some really good games in the lead up to promo, than I get shit shit shit and lose my promo. I am now onto my second shit game, one more and I have to climb again to promo.\r\n\r\nHas anyone else got stuck in this loop? It is like they give me cancerous players who can&#039;t play, and before you say anything, first promo game I got a Fid jungle, complained about all of us, yet had lost 5 ranked in a row after that game. Last game I had a duo &#039;smurf&#039; team who just fed, didn&#039;t ping, didn&#039;t roam, didn&#039;t gank, nothing.\r\n\r\nI had 5/7 wins up to that point, one of those I had 4 AFK, so 5/6  I actually helped my team win in fair games, than I get promos and 2 shit games, AGAIN, like the other promo games.","replies":[{"poster":"XxToadinationxX","date":"2015-09-09T22:20:42.388+0000","up_votes":3,"down_votes":0,"body":"I don't like this blog, how do I unsubscribe?","replies":[]},{"poster":"McRuthless","date":"2015-09-09T15:22:52.602+0000","up_votes":2,"down_votes":0,"body":">  I got a Fid jungle, complained about all of us, yet had lost 5 ranked in a row after that game\n\nSo what makes you any different to him? You lose your promos then complain about your team lol, you sound just like that guy.","replies":[]},{"poster":"Slowdownn","date":"2015-09-10T03:36:39.099+0000","up_votes":1,"down_votes":0,"body":"Can't you see the difference? 'YOU' yourself are the difference when you can't single handedly carry your games while some other dudes in the opposite team can! They are called Smurfs and if the team has one or more, that team will usually wins. The maths is simple when all things are equally worked out on both teams, then you are the single factor that matters. I have long realised that I can't carry myself and given up on chasing.. haha. Just enjoy the game.","replies":[]},{"poster":"Hyde","date":"2015-09-09T20:38:00.457+0000","up_votes":1,"down_votes":0,"body":"I feel your pain, I have climbed up from Bronze 5 all the way to bronze 2 just last night and all my promos were fine except the promos for B2 I failed them twice and on the third try finally got up to B2 I think the further up you go the harder it is to make promos, one of the reasons is that there is a lot more riding on it so your stressed and make mistakes and perhaps a few of your team mates are too but I mean just about every champion has around about a 50% win rate so some games just aren't going to go your way, you just have to keep playing until you get there be it a lucky team that carries .. or just endless normal's until the point where you can hard carry your entire team :) Good luck!","replies":[]}]}