{"poster":"LastEra","date":"2019-08-14T21:39:03.684+0000","title":"TFT LP Gain/Loss","subforum":"Teamfight Tactics","up_votes":3,"down_votes":1,"body":"Liebes Riot Team,\nich möchte hier weder Meckern noch jemanden Beleidigen und entschuldige mich schon mal im Voraus für viele Menschen in der Community, die es doch tun. Das einzige was ich möchte, ist eine konstruktive Diskussion führen und aufgeklärt werden, wieso das System von LP Gain/Loss so unbalanced aussieht. Ich bin momentan D3 und habe 2 spiele in folge gewonnen. Nach dem ich dann gerade ein mal auf dem 8 platz gelandet bin, was in einem Spiel mit starken RNG Anteil durch aus auch 1-2 mal passieren kann, habe ich 54 LP Verloren. Vielen Leuten geht es ähnlich sie verloren bis zu 90 LP auf dem 7-8 platz. Das wäre ja auch nicht gerade tragisch wenn man dafür auch für einen 1 Platz, bei dem man viel Knowledge und Luck haben muss, was nicht immer leicht ist, auch eine Ungefähr Gleichwertige summe erhält. Leider ist dies nicht der Fall (24 LP 1 Platz). Daher bitte ich um eine Erklärung, um zu verstehen wieso das System so funktioniert und ob es ggf. geändert wird.\n\nEdit: Ich verliere bei einem 8 Platz mehr LP als ich für 2-3 1 Plätze zusammen Bekomme!\nIm endeffekt muss ich 2-3 mal den 1 Platz machen um 1 mal pech haben zu dürfen. Vom 3-4 Platz will ich garnicht anfangen 3-5 Lp sind nicht gerade viel für 40 Minuten investierter zeit.\nEdit: Wurde der Abstiegsschutz nicht für TFT Deaktiviert, mit der begründung man würde ja überdurchschnittlich viel LP bekommen? Statistisch gesehen sind 24 im vergleich zu 100 nicht viel und auch nicht im vergleich zu 54.\n{{sticker:zombie-brand-mindblown}} \n\n\nUpdate: Ich bekomme 18 LP für den 2ten Platz verliere aber 11 für den 5ten... Das ist wirklich mehr als unfair!\n\nDanke für eure tolle Arbeit und ich hoffe ich habe bald einen von euch in einer Runde TFT.\n{{sticker:slayer-jinx-catface}} \n\nLG. LastEra","replies":[{"poster":"BaseVentura TFT","date":"2019-08-15T08:35:01.332+0000","up_votes":2,"down_votes":0,"body":"100% Zustimmung. TFT macht eine Menge Spaß, jedoch trübt eine Niederlage (Rang 5-8) extrem, da der LP Verlust im Gegensatz zum LP Gewinn überhaupt nicht im Verhältnis steht.\n\nDie \"lange\" Spielzeit (ca. 30min, welche vollkommen OK ist) steht auch überhaupt nicht im Verhältnis zu diesem Gewinn/Verlust. Aktuell fühlt es sich einfach wie ein ewiger Grind an um aufzusteigen. Selbst 3-4 gute Spiele werden durch ein schlechtes Spiel sofort zu Nichte gemacht. Ich sehe hier eine große Gefahr das dies auf Dauer zu Frustration bzw. Desinteresse am Ranglistenmodus führen kann.\n\nIch verstehe nicht wieso die Punktvergabe nicht konstant ist. \nZb. \nRang 1 = + 40 LP\nRang 2 = + 30 LP\nRang 3 = + 20 LP\nRang 4 = + 10 LP\nRang 5 = - 10 LP\nRang 6 = - 20 LP\nRang 7 = - 30 LP\nRang 8 = - 40 LP\n\nDiese Zahlen dienen nur als Beispiel, jedoch wären diese plausibel und für jeden zu verstehen.\n\nEine Erläuterung bzw. Aufklärung zum Punktesystem wäre aufjedenfall sehr hilfreich, sofern dann auch an diesem Problem gearbeitet wird.\n\nEDIT: Aktuelles und bestes Beispiel: Platz 1 =  + 29 LP die Runde davor Platz 5 = - 25 LP \nMacht halt überhaupt keinen Sinn dieses Verhältnis\n\nDanke","replies":[{"poster":"Amycos Cyrus","date":"2019-08-15T21:54:13.855+0000","up_votes":1,"down_votes":0,"body":"Habe eben -38 LP für den 5. Platz bekommen. XD (von 71 auf 33)","replies":[]},{"poster":"Beudegreifer","date":"2019-08-15T10:00:20.277+0000","up_votes":1,"down_votes":0,"body":"Also ich meine schon mehr als 60 Pkt bekommen zuhaben für Platz 1. Aber bin mit nicht sicher, da Postmatch nur promotet steht anstatt auch die Anzahl verdienter Punkte. Das muss auch geändert werden finde ich, macht kein Spaß da nachrechnen zu müssen. \n\nMein Vorschlag:\n\n> Rang 1 = + 60 LP\n> Rang 2 = + 40 LP\n> Rang 3 = + 20 LP\n> Rang 4 = +   5 LP\n> Rang 5 =      0 LP\n> Rang 6 = -    5 LP\n> Rang 7 = -  20 LP\n> Rang 8 = -  40 LP","replies":[]}]},{"poster":"manial fly","date":"2019-08-15T04:35:56.200+0000","up_votes":2,"down_votes":0,"body":"Ich sehe das genauso. Grundsätzlich ist es ja viel schwerer Platz 1 zu erreichen als Platz 8. Bei normalen ranked ist es ja so das man mir normalen MMR für nen Sieg mehr Punkte bekommt als man bei einer Niederlage verliert. Also sollte man m.M. nach auf den Plätzen 5-8 zusammengerechnet nicht mer Punkte verlieren als man auf den Plätzen 1-4 gewinnen kann. Es ist ja wie du sagst auch RNG, da nimmt jeder mal jede Platzierung mit aber es kann nicht sein das man die Punkte des Siegs in Runde 1 direkt nach 1-2 Runden wieder verliert weil man Pech hatte.","replies":[]},{"poster":"I r O n Y 187","date":"2019-10-27T15:05:17.276+0000","up_votes":1,"down_votes":0,"body":"platz 3. +4 Lp \nplatz 6. -36 Lp\nGj riot -.-","replies":[]},{"poster":"GlatzenKlatscher","date":"2019-08-21T10:32:02.574+0000","up_votes":1,"down_votes":0,"body":"Falls es dir schwer fällt zu climben dann adde mich mal auf Discord: Marc#7501\n\nIch bin TFT Grandmaster Spieler und coache :)","replies":[{"poster":"LastEra","date":"2019-08-27T18:30:04.560+0000","up_votes":1,"down_votes":0,"body":"Fällt mir nicht schwer aber es nervt das man ein mal pech hat und so viel Lp Verliert.\n\nWenn ich wie gerade eine super combo habe, alles super läuft nur um dann gegen jemanden mit 12 items zu losen und auf dem 6ten Platz 30 Lp zu verlieren. Naja ich adde dich trotzdem mal vielleicht hast du ja noch den ein oder anderen tipp für d+ :D\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}