{"poster":"Simstaa","date":"2016-09-19T14:43:31.086+0000","title":"Meine mmr ist von 1360 auf 960 ohne zu spielen gesunken.??","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":3,"body":"Hey leute warun ist meine mmr so drastisch gesunken?ohne dass ich gespielt habe. Bin eig. S3 . Woran liegt das ?","replies":[{"poster":"Only Blitzcránk","date":"2016-09-19T14:48:34.042+0000","up_votes":5,"down_votes":0,"body":"Herr Schmidt laut Ihrer Aussage entnehme ich, dass wir uns nicht einig werden. Ich Biete Ihnen deshalb 1150 damit beide zu frieden sind.","replies":[{"poster":"Schlachtenhorn","date":"2016-09-19T14:56:37.652+0000","up_votes":5,"down_votes":0,"body":"Aber Hans mein Freund.\nDie goldene Mitte liegt doch bei 1160.\nDu möchtest ihn doch nicht um 10 punkte benachteiligen.","replies":[{"poster":"CYPHΕR","date":"2016-09-19T14:58:54.253+0000","up_votes":4,"down_votes":0,"body":"Das sind die Kosten für die MMR-Berechnung. Diese müssen regelmäßig abgebucht werden, damit niemand die Chance hat aufzusteigen.","replies":[]}]}]},{"poster":"Humpelstilzche","date":"2016-09-19T14:49:50.204+0000","up_votes":3,"down_votes":1,"body":"Offensichtlich hat die Seite auf der du deine MMR checkst die Methode gewechselt, mit der sie die MMR würfeln. \n\nWas ich damit sagen will: Es gibt keine einzige Seite die dein MMR auch nur halbwegs akkurat anzeigt, da sie weder über die dafür nötige Formel noch über die notwendigen Daten verfügen. Dieses MMR ist im besten Fall eine grobe Schätzung und häufig schlicht und einfach komplett daneben. Würdest du dein MMR auswürfeln, würdest du ähnlich zuverlässige Werte bekommen. \n\nInsofern kann es dir völlig egal sein wenn diese Seite plötzlich was anderes anzeigt. Dein MMR ist jetzt halt von einem falschen Wert auf einen anderen falschen Wert gesprungen. Auf dein tatsächliches MMR hat das keinerlei Einfluss.","replies":[{"poster":"SuperplexP","date":"2016-09-20T13:36:58.480+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=ip27PlEH,discussion-id=lymR9dEe,comment-id=0001,timestamp=2016-09-19T14:49:50.204+0000)\n>\n> Offensichtlich hat die Seite auf der du deine MMR checkst die Methode gewechselt, mit der sie die MMR würfeln. \n> \n> Was ich damit sagen will: Es gibt keine einzige Seite die dein MMR auch nur halbwegs akkurat anzeigt, da sie weder über die dafür nötige Formel noch über die notwendigen Daten verfügen. Dieses MMR ist im besten Fall eine grobe Schätzung und häufig schlicht und einfach komplett daneben. Würdest du dein MMR auswürfeln, würdest du ähnlich zuverlässige Werte bekommen. \n> \n> Insofern kann es dir völlig egal sein wenn diese Seite plötzlich was anderes anzeigt. Dein MMR ist jetzt halt von einem falschen Wert auf einen anderen falschen Wert gesprungen. Auf dein tatsächliches MMR hat das keinerlei Einfluss.\n\nAber, jetzt mal nur vom rein mathematischen Standpunkt aus gesehen ist die MMR doch nichts anderes, als eine Variable, die das Matchmaking, sowie die Ergebnisse in Form von LP-Verlust und -Gewinn bestimmt.\n\nSollte es dann nicht mithilfe der enormen Datenmengen, die entsprechende Seiten zur Verfügung haben, möglich sein, eine entsprechende Formel aufzustellen und diese immer weiter zu verfeinern?\n\nMir würde nämlich auf Anhieb keine Variable einfallen, die man nicht auslesen könnte und die Einfluss auf die (versteckte) MMR hat.","replies":[{"poster":"Humpelstilzche","date":"2016-09-20T13:56:48.840+0000","up_votes":3,"down_votes":0,"body":"Das Problem an der MMR Berechnung ist, dass ja wirklich das MMR jedes Spielers im Match bekannt sein muss, um MMR-Änderungen zu berechnen. Um das MMR jedes Spielers zu kennen, muss man den Ausgang aller Spiele kennen, die dieser Spieler je gespielt hat und welche MMR die Mitspieler in diesen Spielen hatten. Um aber deren MMR zu kennen, muss man wiederum all deren Spiele kennen plus das MMR der Spieler in diesen Spielen usw usw. Fehlt irgendwo ein einziger Wert, werden alle darauf basierenden Rechnungen ein wenig mehr zur Raterei. \n\nD.h. theoretisch müsste eine Seite jedes Spiel und jedes MMR seit Tag 1 von LoL kennen. Und nicht nur das, sie müssten wissen wie exakt die Formel lautet (denn sind die Fehler auch noch so klein, sie pflanzen sich mit der Zeit fort und werden größer), sie müssten wissen was genau bei den Season-Resets passiert, sie müssten wissen auf welcher MMR ein neuer Spieler anfängt, sie müssten wissen wie exakt sich Inaktivität aufwirkt usw usw\nAll das wissen sie aber nicht. Nichts davon!\n\nUnd wenn man halt so wirklich GAR NICHTS hat, wird das Rechnen schon schwer. All das von den tatsächlich stattfindenden Matches rückzuschließen (und das ohne genau zu wissen wie das Matchmaking funktioniert), ist im Prinzip nicht möglich. Es ist ein bisschen wie eine Formel mit mehreren Billionen Variablen zu errechnen, indem man das Ergebnis anschaut. \n\nUnd das ist noch nicht mal alles. Ist dir schon mal aufgefallen, dass du auf lolking oder op.gg manchmal ein Profil neu laden musst, damit aktuelle Daten angezeigt werden? Das liegt daran, dass keine Seite wirklich ALLE Daten von Riots API abgreift, sondern nur die Sachen die von Usern angefragt werden, da die API nicht unendlich viele Anfragen erlaubt. Das bedeutet, selbst wenn eine Seite all die oben erwähnten Probleme lösen könnte, alle Formeln und Werte kennen würde....sie könnten es dennoch nicht ausrechnen, weil sie garnicht Zugriff auf alle gespielten Spiele haben, was aber notwendig ist um MMR zu berechnen. \n\nWegen all dieser Probleme und der völligen Sinnlosigkeit das überhaupt zu versuchen, sparen sich diese Seiten die Mühe und verwenden grob vereinfachte Methoden, meist schlicht und einfach basierend auf der Division in der sich die Spieler gerade befinden. Entsprechend wertlos ist das Ergebnis.","replies":[]}]},{"poster":"CYPHΕR","date":"2016-09-19T14:54:16.307+0000","up_votes":1,"down_votes":0,"body":"Immer ganz nett zu sehen wie die \"MMR\" von op.gg ins Bodenlose stürzt, wenn man z.B. als Gold 1 mit Silber 5 ein paar Duoq-Matches bestreitet. 5 Matches, 5 Wins, aber plötzlich 800 MMR weniger? Sehr interessant :P","replies":[]}]},{"poster":"Megamaexx","date":"2016-09-19T15:19:39.115+0000","up_votes":1,"down_votes":0,"body":"Deine MMR scheint in den letzten Tagen tatsächlich gefallen, das Spiel mixt dich weniger mit Gold-Spielern als vor 14 Tagen. Woran aber op.gg nun festmacht, dass deine MMR im Höllenbereich angekommen ist, kann ich dir nicht erklären.","replies":[]},{"poster":"Encrux","date":"2016-09-19T14:50:07.062+0000","up_votes":1,"down_votes":0,"body":"Deine MMR kennt niemand außer Riot. Die ganzen Seiten können nur schätzen. Ob das richtig ist, ist zu bezweifeln","replies":[]},{"poster":"Gang Hei","date":"2016-09-19T15:48:15.156+0000","up_votes":1,"down_votes":6,"body":"Ehrlich gesagt ist diese Geheimnistuherei um die Berechnung der MMR ein Witz. Die MMR basiert auf der Elo-Formel für Schach. Diese Formel ist fix. Es gibt nur 2 Variablen die man begrenzt ändern kann, weil sonst die ganze Formel nicht mehr funktioniert. Die Berechnung der MMR auf anderen Seiten ist also absolut korrekt. Sie weicht wahrscheinlich etwas von der originalen MMR ab, aber die Abweichung ist immer Paralell. Also wenn ich auf op.gg 1400 MMR habe und in LoL 1395, dann wird die MMR in LoL 2000 sein, sobald ich auf op.gg 2005 MMR habe.","replies":[{"poster":"Stealth Cat","date":"2016-09-19T17:03:36.817+0000","up_votes":1,"down_votes":0,"body":"2 Variablen? \nUnd wieviel MMR bekommt man mehr wenn die Gegner um 50 MMR im Team höher sind?\nUnd wie stark beeinflussen Premades die Wahl der Gegner, und somit den MMR Unterschied der Teams, und dadurch eben wieder die Verteilung der MMR am Ende des Spiels? \nGenau dass sind die Faktoren die externe Seiten nicht wissen können.","replies":[]},{"poster":"0815xand0r","date":"2016-09-19T17:12:30.846+0000","up_votes":1,"down_votes":0,"body":"Das stimmt so leider nicht. An sich hättest du Recht, aber Seiten wie op.gg schauen sich für die Berechnung deines MMR an, mit und gegen wen du spielst und extrapolieren aus diesen Daten dein MMR. Das ist jetzt zwar grob vereinfacht dargestellt, zeigt aber, dass die Abweichung vom tatsächlichen MMR nicht konstant bleiben wird, da ja die Datengrundlage immer wieder eine andere ist.\n\nDas mit der Formel ist auch nicht richtig. Es gibt eine sehr simple Formel, um zu den Erwartungswert zu berechnen, also wie viel Elo Spieler A im Mittel gegen Spieler B gewinnt oder verliert, da hat aber mit der Situation hier nichts zu tun. Denn dafür müsste man die Elo von Spieler A und B kennen.\n\nLetztlich raten alle Seiten wie op.gg nur, auch wenn ich es anders als Humpel nicht als völlig zufällig, also mit einem Würfelwurf vergleichbar, ansehen würde, da es schon einen vernünftigen algorithmischen Ansatz gibt, dem allein die Daten fehlen. Denn zu Ende gedacht sind System, wie ich sie oben dargestellt habe, immer dazu verdammt in einer Endlosschleife zu enden: Um die Elo von A zu berechnen, brauchen wir die Elo von B, dafür die von C, dafür die von D... und für die Elo von Z dann wieder die von A.\n\nDie Arbeitsweise dieser Seiten erklärt übrigens auch, warum das eigene MMR so schwanken kann. Nehmen wir an op.gg berechnet ein MMR von 1360 aufgrund der letzten Spiele. Aber nun steigen plötzlich 90% der Spieler ab, mit und gegen die man gespielt hat. Nun berechnet man sein MMR neu, op.gg sieht aber \"Hey, die Spieler waren ja viel schlechter\" und schon wird man auch schlechter, ohne gespielt zu haben.","replies":[]},{"poster":"Released Ape","date":"2016-09-19T17:11:45.300+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist das alle Variablen unbekannt sind bzw. sich in einem von-bis Feld befinden das es noch weiter verzerrt.\n\nDaher sind diese Seiten sehr ungenau, ich kann mir vorstellen das es eine ungefähre Angabe machen kann mit einer Abweichung von etwa 300-1000 MMR. Genauer wird es nur mit viel Glück sein. Op.gg vergleicht einfach mit welchen Spielern du gematcht wirst und verwendet Zahlen von früher, die heute nicht mehr aktuell sind und zur Berechnung wenig taugen.\n\nAber du kannst natürlich weiterhin behaupten das es sich lediglich um 5 Punkte unterscheidet. Wer nur SoloQ spielt kann damit eventuell ein sehr grob seinen Fortschritt feststellen, zu mehr taugt es nichts.","replies":[]}]}]}