{"poster":"jifly","date":"2015-06-06T07:36:20.670+0000","title":"Warwick","subforum":"Champions & Gameplay","up_votes":2,"down_votes":24,"body":"Was f&uuml;r ein Champion ist warwick? Ein Tank der mehr Schaden macht als ein adc. Mit seiner Ulti und dem red smite kann er sogar full tanks oneshoten. Was hat Riot sich bei dem kack Champ gedacht? Wer hat denen ins Hirn geschissen? Ich jedenfalls nicht denn ich verstehe mehr von Champion balancing als die Spasten von Riot. Ein Champ der extrem tanky ist und zudem mehr schaden macht als ein adc geh&ouml;rt zu Tode generft. Gegen sowas kann man nicht gewinnen egal wie gut man ist. \r\nVorschl&auml;ge sind entweder den effekt des red smites zu entfernen, seine passive &auml;ndern, die abklingzeit seiner ulti drastisch erh&ouml;hen oder einfach nur seine tankyness entfernen. Sowas hat auf der Kluft nichts zu suchen. Da k&ouml;nnte ich gleich ner Vayne 5000 hp, 300 armor und 200 mr geben und den damage und das alles so lassen wie sie es gerade schon hat. \r\nAlso ihr wisst worauf es ankommt. \r\nUnd es ist nicht dass ich schlecht gespielt habe, ich war besser als die gegner aber mit nem Champ der stumpf auf rechtsklick und der r taste basiert hat man keine chance. Alle spells bis auf die ulti sind skillshots bei Caitlyn, bei warwick wiederrum nicht. Das finde ich so witzlos. \r\nEntweder Warwick nerf oder red smite nerf. Und ich mein jetzt nicht nen nerf wie &quot;ulti hat 2 sec mehr cooldown&quot; oder &quot;passiv der lebensraub wird um paar prozent weniger&quot; sondern was richtiges. Ulti hat mindestens 50 sec mehr abklingzeit verdient. und auch seine tankyness (grundtankynees) k&ouml;nnt ihr sehr viel niedriger machen.\r\nSo ich hoffe ihr versteht mich!\r\nAchja, sollte warwick nicht generft werden dann wars das mit dem Kack game!","replies":[{"poster":"hshtagniemehrcdu","date":"2015-06-06T07:41:57.258+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=jifly,realm=EUW,application-id=Wj1wcocU,discussion-id=lsNP7Hel,comment-id=,timestamp=2015-06-06T07:36:20.670+0000)\n>\n\n> Achja, sollte warwick nicht generft werden dann wars das mit dem Kack game!\n\nTschüss und komm nicht wieder!","replies":[]},{"poster":"Tungsteel","date":"2015-06-06T10:11:25.448+0000","up_votes":5,"down_votes":0,"body":"Mit 14/10/15 Stats ist WW also OP, während es Caitlyn mit 19/9/18  nicht ist? Natürlich sagt die KDA nicht allzu viel aus, aber bei einem OP Champ stell ich mir doch eine andere KDA als 14/10/15 vor. Aber bei Minute 28 hattet ihr ja einen Goldvorteil von etwa 10 k Gold. Insgesamt dürfte WW einfach als Jungler besser gewesen sein als euer Nunu, insbesondere was die Objective Controll betrifft, da die Gegner zwei Barons hatten, während ihr keinen hattet. Euer Blitzcrank hat genau gar nicht gewarded (4 Wards in 50 Minuten), was für einen Support traurig ist, aber die Gegner haben genauso wenig gewarded. Generell sieht das Supportmatchup traurig aus, kein Golditem, keinen Sightstone, keinen Pinkward. \n\nDie Ulti von WW lässt sich übrigens von Blitzcranks Knockup (E) und Blitzcranks Ulti (R) unterbrechen, die beide einen weitaus geringeren CD als WWs Ulti haben. Dazu noch QSS. Dann hat Malzahar auch noch einen Silence und seine Ulti, mit denen ihr WWs Ulti unterbrechen hättet können. Das sind 5 Möglichkeiten zum Counterplay. WW ist nicht zu stark, aber man muss seine Ulti unterbrechen, vor allem, wenn man 5 Möglichkeiten dazu hat. Counterplay ist wichtig, aber das gab es in dem Fall wirklich in ausreichendem Ausmaß - man muss es halt auch machen.","replies":[]},{"poster":"Cór","date":"2015-06-06T09:30:03.311+0000","up_votes":5,"down_votes":0,"body":"Dann spiel doch selbst WW, wenn du denkst, dass er so stark ist. =)\nDann müsstest du ja bereits den freewin haben^^","replies":[{"poster":"jifly","date":"2015-06-06T09:53:10.444+0000","up_votes":1,"down_votes":7,"body":"Ich hasse warwick und will schon skill beweisen um zu gewinnen. Bei Warwick ist es einfach nur rechtsklicken und r klicken sobald es bereit ist. mehr nicht. Das kann jedes 3 jähriges Kind!","replies":[{"poster":"SFG Deathstroke","date":"2015-06-08T09:28:20.106+0000","up_votes":2,"down_votes":0,"body":"dann spiel ihn mal gegen mich adde mich und du spielst ww und ich einen anderen Champion varus zum beispiel ich meine da müsstest du ja locker gewinnen wenn jedes 3 Jährige kind ;) mit dem spielen kann","replies":[{"poster":"jifly","date":"2015-06-09T09:36:53.796+0000","up_votes":1,"down_votes":3,"body":"Ich adde keine Leute die ich nicht kenne!","replies":[{"poster":"SFG Deathstroke","date":"2015-06-09T10:04:33.008+0000","up_votes":3,"down_votes":0,"body":"dachte ich mir irgendwie sonst hättest du nämlich beweisen müssen dass deine aussage stimmt ;) könntest mich ja anschliessend wieder aus deiner Freundesliste entfernen wo ist das Problem?","replies":[]}]}]}]}]},{"poster":"SorisDynasty","date":"2015-06-06T07:40:00.646+0000","up_votes":3,"down_votes":0,"body":"Hey, ein Tipp gegen Warwick: QSS (Quicksilberschärpe) und Teamplay.\nUnd ich bezweifle nach deinem Text stark, dass du auch nur annähernd was von Spielbalance verstehst.\n/Edit: Okay, QSS ist sogar drin, aber kein Last Whisper. Ist klar, das kein Schaden rauskommen kann. Zusätzlich wurde vermutlich 0 vom Team gepeeled, sodass WWs offensiver Build nicht bestraft wurde.\nErgo: WW weder op noch sonst was, sondern ihr habts einfach schlecht gespielt und ihn nicht bestraft.","replies":[{"poster":"jifly","date":"2015-06-06T08:29:53.397+0000","up_votes":1,"down_votes":2,"body":"Ich musste mich für ein Item entscheiden und da ww mich immer geultet hat war das halt qss. Was soll ich tun? ich focusse den an den ich rankomme und das war immer jemand anderes und wenn ww dabei war wars gg. ich instand tot. Und mein Team hat gepeelt aber ww interessiert es nicht da er sich durch seine passive und ulti von 100 hp auf 5000 hp (oder wie viel der hatte) wieder hochheilen kann. So ein champ verdient es generft zu werden!","replies":[{"poster":"SorisDynasty","date":"2015-06-06T08:45:57.624+0000","up_votes":4,"down_votes":0,"body":"GA raus, LW rein, auch wirklichen Peel kriegen (Blitz E, Malzahar Ult, Darius E... da gabs genug, dass auch WW fern bleibt), WW killen.\nBesonders wenn ihr Malzahar habt, der mit der beste Tankkiller-Mage im Spiel ist. Außerdem hat der WW nicht wirklich tanky gebaut - er hat offensiv gebaut. Wenn ihr den nicht hochjagt, weiß ich auch nicht weiter.\nUnd nur ein weiter Tipp... damit WW sich heilen kann, muss er Autos raushauen oder eben die Ult. Wenn du die aber instant abbrichst mit QSS, fällt der Ultheal bereits weg. Wie kann er sich dann so krass wieder hochheilen?\n\nGlaub mir - Warwick ist definitiv nicht zu stark. Vielleicht war es anfangs mit Redsmite-Devour so, als die frisch rauskamen. Aber jetzt ist er komplett fein. Man muss lediglich korrekt gegen ihn spielen. Denn seine Aufgabe ist schlicht und ergreifend, die Carrys zu killen. Dafür hat er so hohen On-Hit Schaden und Healwerte. Dagegen hilft trotzdem: Teamplay, nicht Solo herumlaufen, CC.\nDas Problem an eurem Spiel war höchstwahrscheinlich einfach nur - SoloQ. Ein Spiel von vielen. Shit happens. Ich verlange auch nicht, nur weil mich eine Poppy letztens in Grund und Boden gestampft hat, dass sie in Grund und Boden generft gehört.","replies":[{"poster":"jifly","date":"2015-06-06T09:04:48.151+0000","up_votes":1,"down_votes":10,"body":"Glaub mir, Warwick hat nen nerf verdient!","replies":[{"poster":"SorisDynasty","date":"2015-06-06T09:43:40.099+0000","up_votes":2,"down_votes":0,"body":"Nein. Nicht im Moment ohne weitere Änderungen.","replies":[]}]}]},{"poster":"SFG Deathstroke","date":"2015-06-08T10:09:51.418+0000","up_votes":1,"down_votes":0,"body":"5000 hp? wieso nicht gleich 10000 slebst mit Cho'gath hab ich das noch nie geschafft muss ich aber mal ausprobieren :D","replies":[{"poster":"Evenrider","date":"2015-06-08T10:44:27.397+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Rogorash,realm=EUW,application-id=Wj1wcocU,discussion-id=lsNP7Hel,comment-id=000000000001,timestamp=2015-06-08T10:09:51.418+0000)\n>\n> 5000 hp? wieso nicht gleich 10000 slebst mit Cho'gath hab ich das noch nie geschafft muss ich aber mal ausprobieren :D\n\nEs waren mal über 13000 HP möglich:\nhttps://www.youtube.com/watch?v=K_0tR47GliY&list=PLlakm8Sa1vtNVG6bollPnR5ocxuyt3VCi&index=13\nFact 8 ab 3:17\nAktuell sind nur noch ca. 11500 HP möglich.\nhttp://leagueoflegends.wikia.com/wiki/Health\nWeit unten bei Trivia.","replies":[{"poster":"SFG Deathstroke","date":"2015-06-08T11:40:47.009+0000","up_votes":1,"down_votes":0,"body":"Wusst ich nicht find ich aber krass :) danke für den Post :D","replies":[]}]}]}]}]},{"poster":"MacDeath","date":"2015-06-06T11:24:50.537+0000","up_votes":3,"down_votes":0,"body":"Ich hab mal alle inhaltlich einwandfrei korrekten Sätze aus deinem Post herausgearbeitet:\n\n> [{quoted}](name=jifly,realm=EUW,application-id=Wj1wcocU,discussion-id=lsNP7Hel,comment-id=,timestamp=2015-06-06T07:36:20.670+0000)\n\n> Vorschl&auml;ge sind entweder den effekt des red smites zu entfernen, seine passive &auml;ndern, die abklingzeit seiner ulti drastisch erh&ouml;hen oder einfach nur seine tankyness entfernen.\n\nDas sind Vorschläge,da hast du Recht. Nicht besonders tiefgründige Vorschläge, aber es sind Vorschläge.\n\n> Alle spells bis auf die ulti sind skillshots bei Caitlyn, bei warwick wiederrum nicht. \n\nKorrekt.\nMeine Empfehlung: Informiere dich im Vorhinein besser über den Sachverhalt deines Problems, bevor du einen Post schreibst. Ich weiß nicht wo ich anfangen sollte, dir zu helfen. Tut mir Leid!\n\nAlle Aussagen zu deiner eigenen Meinung habe ich nicht mit reingenommen, da ich ihren Wahrheitsgehalt nicht prüfen kann :/","replies":[]},{"poster":"OrangeBubble","date":"2015-06-06T10:54:00.274+0000","up_votes":3,"down_votes":0,"body":"Ww macht ult -> qss -> Falle unter WW -> wegnetzen + Q -> WW in Falle  -> AA -> AA -> AA -> (AA ->) WW Tot.\n\nAber nur, wenn man auch einen LW hat, anstatt GA. Und wenn du auf Max. Range warst, also auf 650, dann müsste ww ganz alleine dagestanden sein, als er dich geultet hat, also weit hinter deiner Backline bzw. seiner Frontline, sodass er sich hätte nicht healen können. \n\nIch bezweifle aber jetzt einfach mal, dass du a) Das so gemacht hast, wie ich oben beschrieben habe und b) dass du auf max. Range warst.","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-06-06T10:48:07.460+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=jifly,realm=EUW,application-id=Wj1wcocU,discussion-id=lsNP7Hel,comment-id=,timestamp=2015-06-06T07:36:20.670+0000)\n> Ich jedenfalls nicht denn ich verstehe mehr von Champion balancing als die %%%%%en von Riot.\n\nschön für dich... und da du damit alles, was OP oder zu schwach ist, selbst ausnutzen kannst, wirst du dann ja bestimmt auch Challenger sein.\n\nAlso ich habe mich definitiv mehr mit dem Spiel beschäftigt als du... und ich würde trotzdem nicht behaupten, dass ich genug von LoL verstanden habe um mich dazu zu äußern, welche Champs zu stark sind. Und vor allem warum...","replies":[]},{"poster":"AyRe CoNteMpT","date":"2015-06-06T08:22:51.382+0000","up_votes":4,"down_votes":1,"body":"niemand versteht dich, und niemanden interessiert was ein bronze 3 spieler so über balance denkt.","replies":[{"poster":"jifly","date":"2015-06-06T08:31:34.247+0000","up_votes":1,"down_votes":6,"body":"***","replies":[{"poster":"AyRe CoNteMpT","date":"2015-06-06T09:24:50.346+0000","up_votes":3,"down_votes":0,"body":"du hast doch garnicht um hilfe gebeten, sondern nur geweint. ausserdem ist das ungefähr so, als würde ein erwachsener mann hilfe im kampf gegen einen dreijähirgen brauchen. da schmunzle ich nur und frage mich, was deine eltern sich bei deiner erziehung für ziele gesetzt haben.","replies":[{"poster":"jifly","date":"2015-06-06T09:55:50.705+0000","up_votes":1,"down_votes":7,"body":"***","replies":[{"poster":"Nebeltänzer","date":"2015-06-06T09:57:21.818+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=jifly,realm=EUW,application-id=Wj1wcocU,discussion-id=lsNP7Hel,comment-id=0003000000000000,timestamp=2015-06-06T09:55:50.705+0000)\n>\n> Verpiss dich wenn du sonst nichts zu melden hast!\n\nGrandioses Diskussionsverhalten. So kommen definitiv alle Beteiligten weiter... nicht.","replies":[{"poster":"jifly","date":"2015-06-06T09:58:49.086+0000","up_votes":1,"down_votes":8,"body":"Was willst du überhaupt?","replies":[{"poster":"Forunes Of War","date":"2015-06-06T12:53:13.316+0000","up_votes":1,"down_votes":0,"body":"Dir ist schon klar das deine Ausdrucksweise sehr  zu wünschen übrig lässt?!","replies":[]},{"poster":"Taloz","date":"2015-06-06T15:18:32.219+0000","up_votes":1,"down_votes":0,"body":"Jeremy Pascaaal.. hol mir mal ein Bier. Nimm dir auch eins wenn dich die Bronze Que wieder gefrustet hat.","replies":[]}]}]}]}]}]}]},{"poster":"Nebeltänzer","date":"2015-06-06T09:24:53.053+0000","up_votes":1,"down_votes":0,"body":"Hm, wenn du so vehement auf den WW-Nerf bestehst... würde mich mal deine Meinung zu Champions wie:\nKatarina, Master Yi, Irelia, Talon, LeBlanc, Xin Zhao, Sejuani (Liste absolut nicht vollständig, nur beispielhaft :D )\ninteressieren.\nDie find ich (nach persönlichem Empfinden) häufig (nicht immer) heftiger als nen WW. Xin Zhao + Sejuani als Jungler bzw. Kämpfer, der Rest größtenteils Assassinen mit ihrem Burstdmg, Irelia Kämpfer/Assassine.  Ja, die haben kein \"Unterdrücken\", ansonsten haben sie aber auch teilweise ziemlich fiese Kits. Müssen die auch alle generft werden?","replies":[{"poster":"jifly","date":"2015-06-06T09:55:07.024+0000","up_votes":1,"down_votes":5,"body":"Assasinen sind dafür gedacht nen adc zu oneshoten, dafür halten sie kaum was aus wenn sie gestunnt sind. Warwick hält zu viel aus für den Schaden den er mit der ulti macht. Außerdem kann man bei ner Zed oder Kata ulti noch bewegen und kiten. Warwick unterdrückt dich und man kann nicht flashen, healen oder sonst nen escape benutzen. Das ist einfach nur unfair op und sollte generft werden!","replies":[{"poster":"Nebeltänzer","date":"2015-06-06T10:00:38.518+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=jifly,realm=EUW,application-id=Wj1wcocU,discussion-id=lsNP7Hel,comment-id=00060000,timestamp=2015-06-06T09:55:07.024+0000)\n>\n> Assasinen sind dafür gedacht nen adc zu oneshoten, dafür halten sie kaum was aus wenn sie gestunnt sind. Warwick hält zu viel aus für den Schaden den er mit der ulti macht. Außerdem kann man bei ner Zed oder Kata ulti noch bewegen und kiten. Warwick unterdrückt dich und man kann nicht flashen, healen oder sonst nen escape benutzen. Das ist einfach nur unfair op und sollte generft werden!\n\nJa, ist mir bewusst. WW hat dafür keinen direkten Oneshot, dafür Unterdrücken. Dafür gibts die QSS, wie du selbst erkannt hast. Passt doch. Oder sollten Dinge wie Skarners Ulti auch generft werden (da kann man ja auch nix machen - unfair!!)?\nUnd was ist mit den angesprochenen Nicht-Assassinen, die auch tanky sind, weil sie wie WW Fighter sind? Also bei allem was Recht is, aber WW kann zwar stark werden, aber nur, wenn man ihn lässt. und grad im Early Game is er schwach. Wenn er gut gespielt wird, hält er lange durch, ja. Aber ich hab häufig gesehen, dass Warwick auch einfach gut auseinander genommen werden kann. Zudem: WWs Ult trifft einen!! der ganze Rest des Teams kann also was dagegen tun. Ein Stun würde da z.B. reichen, oder Knockup. Wenn du allein unterwegs bist, kanns auch beinahe jeder andere Champ auch sein, der dich dann zerlegt.","replies":[{"poster":"jifly","date":"2015-06-06T10:02:20.486+0000","up_votes":1,"down_votes":5,"body":"Du verstehst nicht worauf ich hinaus will!","replies":[{"poster":"Nebeltänzer","date":"2015-06-06T10:04:25.989+0000","up_votes":3,"down_votes":0,"body":"Na dann erklärs mir. Und den anderen auch. Dass wir es verstehen.\nMomentan verstehe ich, dass du auf nen Nerf von WW hinauswillst, weil du persönlich ein Problem mit ihm hast. Die Begründung ist allerdings etwas fadenscheinig, und es gab mehr als genügend Argumente, die deine Begründungen entkräftet oder widersprochen haben. Darauf kommt dann nix mehr, außer dass du dich unverstanden fühlst - oder andere Diskussionsteilnehmer einfach nur sinnfrei angreifst.","replies":[]}]}]},{"poster":"Tungsteel","date":"2015-06-06T13:03:28.399+0000","up_votes":1,"down_votes":0,"body":"Dass du nicht flashen, healen oder deine üblichen Spells einsetzen kannst, ist auch Sinn der Unterdrückung, die dein Team aber auf wirklich viele Arten aufheben hätten können. Der Schaden der Ulti: 150/250/350 (+200% zusätzlicher Angriffsschaden) --> macht aber magischen Schaden\nEs ist natürlich recht stark, wenn man magischen Schaden macht, der auf AD skaliert, da MR in der Regel teurer ist. Vergleichen wir aber den Schaden mit anderen Champions in dem Spiel, in dem auch der gegnerische WW war: 160/250/340 (+75% zusätzlicher Angriffsschaden) als absoluter Schaden (Darius), alle 2,5 Sekunden 100/200/300 (+20% Fähigkeitsstärke) magischen Schaden (passiv) und 250/375/500 (+100% Fähigkeitsstärke) magischen Schaden + 0,5 Sekunden lang verstummen (aktiv)(Blitzcrank), 250/475/700 (+200% zusätzlicher Angriffsschaden) normaler Schaden auf einer Distanz von bis zu 2000/2500/3000 (Caitlyn), 2,5 Sekunden 250/400/550 (+130% Fähigkeitsstärke) magischen Schaden + Unterdrückung für 2,5 Sekunden (Malzahar)\n\nDer Grundschaden von WWs Ulti ist okay, aber keinesfalls zu hoch. Die Utility liegt in der Unterdrückung, die aber beispielsweise von Blitz Ulti aufgehoben wird. Die Unterdrückung an sich ist auch gerechtfertigt, wenn man bedenkt, dass WW keine sonstige CC Fähigkeit hat und nur schwer vor lvl 6 ganken kann.","replies":[]},{"poster":"OrangeBubble","date":"2015-06-06T11:00:42.658+0000","up_votes":1,"down_votes":0,"body":"Was ist deiner Meinung nach denn die Aufgabe von WW? Ich meine, wenn man sich so das Kit anschaut... lässt es dann nicht vermuten, dass er etwas töten soll?... Ich meine, wenn man das ganze mal z.B. mit Sejuani oder Zac vergleicht ..\n\nHast du eigentlich schonmal gegen Sejuani gespielt? Ich meine, du beschwerst dich, dass WW so viel DMG macht und WW so Tanky ist (wohlgemerkt hattest du als ADC keinen LW wtf), aber im Vergleich zu Sejuani ist er eine Lachnummer. Sejuani hat CC, ist tanky wie sau und macht sehr guten DMG (so als Fulltank). Dagegen ist WW einfach nur meh.","replies":[]},{"poster":"SFG Deathstroke","date":"2015-06-09T11:10:06.352+0000","up_votes":1,"down_votes":0,"body":"Da fällt mir doch gerade noch wer ein :D {{champion:90}}  muss man den jetzt auch nerfen?","replies":[]}]}]},{"poster":"SFG Deathstroke","date":"2015-06-08T09:25:27.409+0000","up_votes":2,"down_votes":0,"body":"Du bist wohl einfach schlecht.\nSorry aber WW ist bei weitem nicht so op wie du hier gerade schreibst aber wie du es schreibst das nehm ich persönlich weil ich main jungler mit WW bin...\nAm besten du vergisst den Nerf, vergisst das Spiel, vergisst dieses Forum und gehst zu COD oder spielst Pac Man. Würde ich dir wärmstens empfehlen vor allem wenn man sowas wie ich zitiere (Achja, sollte warwick nicht generft werden dann wars das mit dem Kack game!) schreibst. Dann hast bei uns nix zu suchen. Ich bin ja normaleweise nicht so und habe nichts dagegen wenn man einen Champ oder einige Fähigkeiten des Champs kritisiert aber so? WW ist kein Gott in LOL und auch nur so stark wie sein Team. \n\nHast mich persönlich mit deiner Ahnungslosigkeit angegriffen währe dir dankbar wenn du dich an deinen letzten Satz ich zitiere erneut (Achja, sollte warwick nicht generft werden dann wars das mit dem Kack game!) hälst und hier verschwindest.\n\nSorry nochmal aber solche kommentare kann ich echt nicht ab ://","replies":[{"poster":"jifly","date":"2015-06-09T09:38:23.168+0000","up_votes":1,"down_votes":3,"body":"Aha.","replies":[]}]},{"poster":"Feeding Rengar","date":"2015-06-06T16:19:16.907+0000","up_votes":1,"down_votes":0,"body":"Weißt du , ich finde deinen Beitrag echt lustig ^^.\nKennst du diese Items? {{item:3140}} {{item:3137}} {{item:3222}} \nNicht? .. DIe machen die ult von WW weg ^^\nOder kennst du diesen Champ ?{{champion:412}} \nEr kann mit 2 spells ww ult wegmachen ^^ und da ist eer nicht der einzige.\nEbenso find ich den vergleich Warwick - caitlyn echt komisch O.o\nHast du schonaml daran gedacht wenn ww seien ulti nich hat ?\nder wird tot gekitet. x.x\nUnd wenn du alles nich einsiehst dann bann ihn doch .\nund der letzte satz den eier ich so hart ^^:\"Achja, sollte warwick nicht generft werden dann wars das mit dem Kack game!\"\nDu bist 1 von 30 millionen + , wen kümmerts wen 1 spieler es nicht mehr spielt ?\nrito nicht ...\nSee ya later","replies":[{"poster":"Evenrider","date":"2015-06-07T12:46:30.544+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ISoccerI,realm=EUW,application-id=Wj1wcocU,discussion-id=lsNP7Hel,comment-id=000e,timestamp=2015-06-06T16:19:16.907+0000)\n>\n> Weißt du , ich finde deinen Beitrag echt lustig ^^.\n> Kennst du diese Items? {{item:3140}} {{item:3137}} {{item:3222}} \n> Nicht? .. DIe machen die ult von WW weg ^^\n\nÄhm Nein!\nQSS ok, Derwish Blade gibt es auf SR nicht. Und Mikaels klappt nicht!\nUnd er hat QSS gekauft gehabt... Sein Fehler war der Fehlende LW, wodurch er 0 Schaden an WW macht, da dieser mit Randuins rumlief. Dazu eben noch WWs Selfheal/Lifesteal und dass ist 0 Schaden :D","replies":[]},{"poster":"hshtagniemehrcdu","date":"2015-06-07T09:12:19.541+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ISoccerI,realm=EUW,application-id=Wj1wcocU,discussion-id=lsNP7Hel,comment-id=000e,timestamp=2015-06-06T16:19:16.907+0000)\n>\n\n> Du bist 1 von 30 millionen + , wen kümmerts wen 1 spieler es nicht mehr spielt ?\n> rito nicht ...\n> See ya later\n\nRiot wird WW weder nerfen, nich wird der TE mit LoL aufhören.\nLeider...... (zum zweitem Teil des Satzes..)","replies":[]}]},{"poster":"e621 Rengar","date":"2015-06-06T23:03:10.028+0000","up_votes":2,"down_votes":0,"body":"Troll oder ernst ? Warwick nerfen ? Sein pre Lv 6 ist einfach mal useless und sein Tf ist auch nicht das beste wenn dein Team ahnung hat was es tut . Er ultet Adc .... Kauf qss oder sag deinem supp er soll die ulti mit 1 genau 1 (Einem) CC abbrechen","replies":[]},{"poster":"MacDeath","date":"2015-06-06T11:32:43.329+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=jifly,realm=EUW,application-id=Wj1wcocU,discussion-id=lsNP7Hel,comment-id=,timestamp=2015-06-06T07:36:20.670+0000)\n> Was hat Riot sich bei dem kack Champ gedacht? Wer hat denen ins Hirn geschissen? Ich jedenfalls nicht denn ich verstehe mehr von Champion balancing als die %%%%%en von Riot.\n\nDu weißt die Community zu amüsieren ^^","replies":[]},{"poster":"Nebeltänzer","date":"2015-06-06T07:53:15.494+0000","up_votes":2,"down_votes":0,"body":"Komisch. WW wäre einer der letzten gewesen, über den ich mich beschwert hätte. Außerdem wird er doch als \"Kämpfer\" geführt wenn ich mich recht erinnere - da passt die Tankiness schon ganz gut. Zudem ich ihn nie wirklich tanky fand (wenn er nicht so gebaut wurde) Und WW ein Tank, der mehr Dmg macht als ein ADC? Spannend. :D Aus eigener Erfahrung weiß ich, dass man WW ziemlich gut kleinhalten kann, dass er seinen Build kaum fertig kriegt. Also lief da wohl irgendwas falsch.","replies":[{"poster":"OrangeBubble","date":"2015-06-06T11:04:28.099+0000","up_votes":2,"down_votes":0,"body":"Jeder Tank macht \"mehr\" Dmg, als ein ADC ohne LW. \n\"Mehr\" in Anführungszeichen, weil total gesehen macht der ADC zwar mehr, aber es kommt nicht so viel an (weil kein LW) und er selber auch nichts aushält. Ich meine wtf warum kauft man kein LW? GA ist so ein shitty Item :C Das macht mich gerade echt fertig sowas zu sehen :s","replies":[]}]},{"poster":"A Dragons Heart","date":"2015-06-06T09:05:33.347+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=jifly,realm=EUW,application-id=Wj1wcocU,discussion-id=lsNP7Hel,comment-id=,timestamp=2015-06-06T07:36:20.670+0000)\n>\n>  Was hat Riot sich bei dem kack Champ gedacht? Wer hat denen ins Hirn geschissen? Ich jedenfalls nicht denn ich verstehe mehr von Champion balancing als die %%%%%en von Riot. \n\nOk. Bin einverstanden. Dann geh du zu Riot und übernimm  das! Freu mich schon auf den nächsten Patch ´hust´ !","replies":[{"poster":"jifly","date":"2015-06-06T09:56:54.681+0000","up_votes":1,"down_votes":9,"body":"Ich würds besser schaffen als die Lappen von Riot!","replies":[{"poster":"Forunes Of War","date":"2015-06-06T12:54:37.262+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=jifly,realm=EUW,application-id=Wj1wcocU,discussion-id=lsNP7Hel,comment-id=00050000,timestamp=2015-06-06T09:56:54.681+0000)\n>\n> Ich würds besser schaffen als die Lappen von Riot!\n\nEinbildung ist auch eine Bildung...","replies":[]},{"poster":"Nebeltänzer","date":"2015-06-06T10:19:29.863+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=jifly,realm=EUW,application-id=Wj1wcocU,discussion-id=lsNP7Hel,comment-id=00050000,timestamp=2015-06-06T09:56:54.681+0000)\n>\n> Ich würds besser schaffen als die Lappen von Riot!\n\nOhne Flamen geht wohl nicht, oder? Abgesehen davon: Wenn du das alles so viel besser machen würdest: Dann bewirb dich doch. Oder mach dein eigenes Spiel. Das scheint ja alles so einfach zu sein, wenn du das so besser schaffen würdest. :) Oder gibts schon ein von dir geschriebenes Game, das wir begutachten können? So zwecks Qualitätsbeurteilung? ;)","replies":[]},{"poster":"A Dragons Heart","date":"2015-06-07T12:00:29.500+0000","up_votes":1,"down_votes":0,"body":"Nein, einfach nein... Junge, ich geb dir einen Tipp. Lass mal eine Woche die Finger vom Internet und denk mal über dich nach!","replies":[]},{"poster":"SFG Deathstroke","date":"2015-06-08T09:37:44.103+0000","up_votes":1,"down_votes":0,"body":"Und du bist noch nicht bis ans ende deines Lebens gebannt? :O respekt für Riot","replies":[]}]}]},{"poster":"ThanhSon","date":"2015-06-06T08:44:03.231+0000","up_votes":2,"down_votes":0,"body":"Tschüss","replies":[]}]}