{"poster":"GW Jotah","date":"2017-04-12T18:53:17.180+0000","title":"Eh encontrado un error beneficioso para Riot (Sobre Exploit Xerath)","subforum":"Problemas Técnicos","up_votes":38,"down_votes":3,"body":"Si es Xerath !!! si algún Riot corrige el titulo :C\n\nBueno simple y corto, tengo el Exploit (no lo pasare ahorren se de agregar), lo vi, use, investigue en mi cuenta level bajo (Madcore)[dejo el nombre de la cuenta para que Riot la baneen] y encontr&eacute; un error dentro del Exploit que le beneficia a Riot para acabar con este Exploit.\n\nnecesito ponerme en contacto con el correo o algo de alg&uacute;n Rioter para entregar la solucion, archivos y detalles del Exploit (en soporte demoran mucho y esto es de urgencia).\n\nPodr&iacute;a ser la soluci&oacute;n y final del Exploit. Dejo imagen para que Riot se de cuenta que es verdad.\nhttp://imgur.com/TLh5Yjx\n\n\n\nDen positivos para que no les aparezca alg&uacute;n ocioso usando esto en ranked.","replies":[{"poster":"Excalibeer","date":"2017-04-12T21:55:40.086+0000","up_votes":11,"down_votes":0,"body":"Agradecemos mucho tu info y esfuerzo.  Afortunadamente se logró arreglar el problema y se está haciendo el deploy del microparche.  Además antes de eso estaba Xerath baneado.  \nNo sabemos si alguien lo llegó a usar en LAS de forma abusiva (no es tu caso, tranqui con esa cuenta).\n\nDe nuevo gracias!  \n\n-Excalibeer","replies":[{"poster":"GW Jotah","date":"2017-04-12T23:29:40.122+0000","up_votes":3,"down_votes":0,"body":"Señor Rioter, tengo malas noticias, hace exactamente 43 min. se puso en contacto conmigo X persona (al parecer, por lo que dijo, developer o mod de tal Exploit o creador de ello ya que se usan, SI, se usan mas de 2 programas con el Exploit \"archivo\", por lo que me dio a entender), ofreciéndome una expansión*  ( *Yo lo digo así para no decir el nombre de lo que me dijeron), comprobado de que funciona en estos momentos a cambio de ayudarlos con la información del error que le eh encontrado a dicho Exploit, veo que esto es grave y no me quiero comprometer con nada ILEGAL O PERJUDICIAL PARA MIS CUENTAS.\n\nPD: Lo eh replicado y si funciona en LAN (se preguntaran por que LAN?, por lo siguiente, tengo solo 1 cuenta level 30 en LAS y en LAN una prestada que no tiene importancia como para ser baneada, bueno la cosa es que si funciona con el parche agregado exactamente hace 43 min. pero solo en Ranked Flex (aun no se por que solo en flex, creo que ustedes tienen algo diferente en cada modo de juego al iniciar el juego, si al iniciar! ya que de eso se aprovechan del Exploit una cosita que pasa al iniciar la partida y ARAMS (si es que te sale xerath).\n\nPD: me preguntaron si yo era programador o algo, cosa que no lo soy, solo \"buscaba\" cosas para aprovecharme del juego, cosa que deje de hacer por tiempo y paciencia. les digo la verdad por que ya lo deje de hacer hasta que me llamo mucho la atención de este Exploit.\n\nEspero se entienda un poco este enredo, en resumen: \"si funciona aun (probado en LAN) y me están ofreciendo el parche que hace que funcione otra vez, a cambio del error que les eh encontrado (que se supone ellos aun no lo han visto).","replies":[{"poster":"TheSexyBith","date":"2017-04-13T04:02:34.949+0000","up_votes":1,"down_votes":1,"body":"Me prestas la cuenta de lan quiero l probar el exploit antes que desaparesca  y no pienso hacerlo con la mia  porfis =c","replies":[{"poster":"GW Jotah","date":"2017-04-13T04:30:13.722+0000","up_votes":1,"down_votes":0,"body":"No puedo prestar mis cuentas, y el Exploit ya no sirve, debes tener el update que hasta ahora ni a la venta lo han puesto, yo lo use  hace un par de minutos gracias a los developer (\"gracias\" para testear) así que están arreglando unos detalles y por lo que se lo pondrán nuevamente a la venta cuando terminen.\n\nAparte no te conviene, yo hablare con un rioter por correo para dar los últimos detalles para parar para siempre el Exploit y me desligare de todo.","replies":[]}]},{"poster":"CristianRaprex","date":"2017-04-13T03:20:42.315+0000","up_votes":1,"down_votes":0,"body":"No, no me preguntaré por que en LAN","replies":[]}]},{"poster":"Ruphian","date":"2017-04-12T22:46:26.747+0000","up_votes":2,"down_votes":13,"body":"Porque esta mal aprovechar un bug? Si el juego tiene un error, es parte del juego igual que las estadisticas que dan los objetos o el cd de las habilidades de los campeones, o no? Ademas, porque banear a alguien por aprovechar un error de ustedes?","replies":[{"poster":"Excalibeer","date":"2017-04-13T11:59:34.932+0000","up_votes":4,"down_votes":0,"body":"Porque aprovechar un bug causa una mala experiencia injusta con los demás que no lo quieren o pueden aprovechar.\n\n[Términos de Uso](http://las.leagueoflegends.com/es/legal/termsofuse), V. CÓDIGO DE CONDUCTA, Letra H y J\n\nH. Participar en cualquier acción que, a la absoluta discreción de Riot Games, \"explote\" un aspecto no documentado del juego con el fin de obtener una ventaja antirreglamentaria sobre los demás usuarios.\n\nJ. Utilizar programas no autorizados de terceros, incluyendo, entre otros, \"mods\", \"hacks\", \"cheats\", \"scripts\", \"bots\", \"trainers\" y programas de automatización que interactúen con el Software, independientemente del modo en que lo hagan y de su propósito, incluidos, entre otros, programas no autorizados de terceros que intercepten, emulen o redirijan la comunicación entre el Software y Riot Games, así como programas no autorizados de terceros que recojan información sobre el Juego leyendo zonas de memoria utilizadas por el Software para almacenar información.\n\nEl caso de este bug requiere además un software que permite el exploit.\n\n-Excalibeer","replies":[{"poster":"PATH Kamui","date":"2017-04-13T14:22:05.791+0000","up_votes":3,"down_votes":2,"body":"La pregunta más tonta de lo que va del día,  pueden banear por el antivirus?  tengo el avast, y me da la opción de mejorar el rendimiento del Lol,  si ocupo esa  función, podré ser baneado ?","replies":[]}]},{"poster":"Escrache","date":"2017-04-12T22:50:21.468+0000","up_votes":2,"down_votes":0,"body":"No es un bug, esta utilizando un programa externo para generar el xploit..","replies":[]}]},{"poster":"GW Jotah","date":"2017-04-13T02:42:04.059+0000","up_votes":1,"down_votes":0,"body":"Ponerse en contacto con mi correo el cual esta vinculada esta cuenta por favor. (no daré mas detalles públicos para menos problemas). y aun sigue funcionando con una update reciente. (no solo es 1 champ afectado esta vez).","replies":[]},{"poster":"GW Jotah","date":"2017-04-12T23:45:07.607+0000","up_votes":1,"down_votes":0,"body":"Otra cosa importante, me ofrecieron desbanearme una cuenta que es level 30 que tengo, cosa que encontré absurdo, ahora lo siguiente me puse a pensar:\n\n- O tienen un topo (si me dio risa xD)\n- y si pido que me desbaneen la cuenta, cosa que no se como saben ellos que tengo una cuenta ban. (ustedes podrían ver que persona, rioter, usuario, ip, o PC que me desbaneo para que investiguen mas a fondo ustedes ).\n\nDespués de estos 2 últimos comentario, estoy seguro que no me hablaran mas y adiós a lo que ofrecieron, por eso quería contactarme con ustedes por correo :/","replies":[]}]},{"poster":"Gabvy2018","date":"2017-04-12T19:59:39.496+0000","up_votes":10,"down_votes":2,"body":"Aloo, \n\nesto está solucionado. A veces estos errores llevan un tiempo de solucionar ya que hay que implementarlos en todas las regiones a la vez. \n\nSi quieres puedes probar replicarlo nuevamente (en una custom vs bots pls) y nada eso. \n\nSaludos.","replies":[{"poster":"Escrache","date":"2017-04-12T20:25:08.060+0000","up_votes":2,"down_votes":0,"body":"Yo pensé lo mismo, pero no había visto la hora.. \n\nLa hora en que lo probo y continuaba funcionando, fue hace 1 hora 40 minutos..","replies":[]},{"poster":"GW Jotah","date":"2017-04-12T23:30:08.102+0000","up_votes":1,"down_votes":0,"body":"Ya lo probé, deje un mensaje arriba para que lea espero se entienda.","replies":[]}]},{"poster":"Forero","date":"2017-04-12T19:02:45.051+0000","up_votes":3,"down_votes":3,"body":"Si deseas notificarlo puedes entrar [aquí](https://support.riotgames.com/hc/es-419/requests/new?ticket_form_id=4584).","replies":[{"poster":"GW Jotah","date":"2017-04-12T19:04:35.204+0000","up_votes":6,"down_votes":1,"body":"Y esperar un \"Hola invocador\" el próximo mes ?","replies":[{"poster":"Forero","date":"2017-04-12T19:07:55.158+0000","up_votes":2,"down_votes":1,"body":"El tiempo promedio de respuesta sel soporte es menos de 24Hrs.","replies":[]}]}]},{"poster":"Escrache","date":"2017-04-12T19:22:53.245+0000","up_votes":1,"down_votes":0,"body":"Creo que ya lo solucionaron.. \n\nLa verdad, no se bien como funcionara, pero si las personas que hicieron esto logran \"updatearlo\" para cagar el fix y tu reporte logra solucionarlo, seria un golaso.. \n\n+1","replies":[{"poster":"GW Jotah","date":"2017-04-12T19:32:25.691+0000","up_votes":4,"down_votes":0,"body":"aun funciona, mira la hora y fecha de la foto, y no solo eso tengo el update de denante en la mañana (del Exploit) y como digo ya conozco el error que podría solucionar el problema del Exploit.","replies":[{"poster":"Swarog","date":"2017-04-13T08:21:53.585+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=GW Jotah,realm=LAS,application-id=X54mVVp0,discussion-id=eE7dqQm6,comment-id=00020000,timestamp=2017-04-12T19:32:25.691+0000)\n>\n> aun funciona, mira la hora y fecha de la foto, y no solo eso tengo el update de denante en la mañana (del Exploit) y como digo ya conozco el error que podría solucionar el problema del Exploit.\n\nQue significa denante ?","replies":[]}]}]},{"poster":"reboxer","date":"2017-04-12T19:00:44.343+0000","up_votes":2,"down_votes":7,"body":"***","replies":[{"poster":"GW Jotah","date":"2017-04-12T19:03:40.771+0000","up_votes":1,"down_votes":0,"body":"Tengo algunos trucos para que la señar Wifi funcione como cable de red y 0 problemas. (no me saques del tema xD)\n\nel Exploit consiste en quedarse en base spameando la Q y haces daño a todo enemigo, minions y monstruos neutrales de la grieta.","replies":[{"poster":"YLM AEzeequiel","date":"2017-04-13T04:39:53.747+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=GW Jotah,realm=LAS,application-id=X54mVVp0,discussion-id=eE7dqQm6,comment-id=00000000,timestamp=2017-04-12T19:03:40.771+0000)\n>\n> Tengo algunos trucos para que la señar Wifi funcione como cable de red y 0 problemas. (no me saques del tema xD)\n> \n> el Exploit consiste en quedarse en base spameando la Q y haces daño a todo enemigo, minions y monstruos neutrales de la grieta.\n\nPasa esa data","replies":[{"poster":"GW Jotah","date":"2017-04-13T04:42:49.400+0000","up_votes":1,"down_votes":2,"body":"Cuando ande de humor lo subiré en un post todo así se libraran del MS muchos que juegan con notebooks o antenas wifi, por ahora llevo testeando 2 meses y anda 100% (a no ser que la compañía de Internet tenga problemas o se cae el server de LoL).","replies":[{"poster":"Swarog","date":"2017-04-13T08:20:58.622+0000","up_votes":1,"down_votes":0,"body":"Ponete de humor rápido o se pudre to2 [?","replies":[]}]}]},{"poster":"FrankRAM","date":"2017-04-13T00:11:51.629+0000","up_votes":2,"down_votes":0,"body":"> Tengo algunos trucos para que la señar Wifi funcione como cable de red y 0 problemas. (no me saques del tema xD)\nwat? necesito eso D:","replies":[{"poster":"GW Jotah","date":"2017-04-13T00:20:41.506+0000","up_votes":1,"down_votes":0,"body":"no es difícil, lo difícil es tener los archivos que tengo y saber como aplicarlos xD","replies":[{"poster":"FrankRAM","date":"2017-04-13T17:30:39.784+0000","up_votes":1,"down_votes":1,"body":"Me lo podrias decir por favor? v:","replies":[]}]}]}]}]},{"poster":"Yoen","date":"2017-04-12T20:53:24.976+0000","up_votes":1,"down_votes":0,"body":":d\n\nPero lo estas usando¡¡¡\n\n\nTe puede venir un problema serio\nsi usas eso, te pueden **suspender permanentemente**\nesa cuenta y todas las cuentas que tienes.\n\nToda cuenta que haya sido involucrada con** ese**\ncliente y  juego modificado.\n\n\nTienes que borrarlo y limpiar tu PC,  y volver a instalar el LoL\ndesde cero.\n\nEspero que no te ocurra nada por hacer ese experimento.\n\nSuerte","replies":[{"poster":"Escrache","date":"2017-04-12T21:13:07.496+0000","up_votes":1,"down_votes":0,"body":"Por si no leíste lo que le respondió un RIOTER en el comentario anterior al tuyo: \n\n> Si quieres puedes probar replicarlo nuevamente (en una custom vs bots pls) y nada eso.","replies":[{"poster":"Yoen","date":"2017-04-12T21:23:25.898+0000","up_votes":1,"down_votes":0,"body":"A ok, si lo dice el rioter\nesta bien :D","replies":[]}]}]}]}