{"poster":"Scärämänziä","date":"2018-09-26T15:37:55.957+0000","title":"AYUDA POR FAVOR","subforum":"Problemas Técnicos","up_votes":5,"down_votes":0,"body":"Buenas, una vez m&aacute;s reportando errores, ya cansa la verdad uno se hace un peque&ntilde;o tiempo para poder jugar y se encuentra con actualizaciones lleno de error, alguien ser&iacute;a tan amable de decirme de que se trata &eacute;ste error?\r\n\r\nEntro al juego, seleccion de campe&oacute;n , una vez finalizada la misma entra a cargar y antes de que abra la pantalla sale &eacute;ste molesto cartel...\r\n\r\n&quot;a critical error has ocurreded and the process must be terminated .\r\n  would you like to created a clash dump to aid the developers in troubleshooting this issue? this may make up to 5 minutes..\r\n\r\nNOTE: the procces may appear unresponsive during this time&quot;\r\n\r\nAYER estuve jugando sin ningun problema ahora &eacute;sto, no soy el &uacute;nico ya vi que les pasa a varios... YA CANSA!...{{summoner:3}}","replies":[{"poster":"Dani","date":"2018-09-26T23:18:26.157+0000","up_votes":1,"down_votes":0,"body":"Espero que lo solucionen de alguna forma T_T","replies":[]},{"poster":"D r u m m i n G","date":"2018-09-26T21:37:26.562+0000","up_votes":1,"down_votes":0,"body":"Tengo el mismo problema, Windows XP SP3 32 bit.","replies":[]},{"poster":"Devolveme a Br1","date":"2018-09-26T21:34:21.398+0000","up_votes":1,"down_votes":0,"body":"Estoy exactamente en la misma Scaramanzia, Tngo windows XP se ve que es por eso, tampoco puedo instalar el Hextech repair... un embole.","replies":[]},{"poster":"Khá Zíx","date":"2018-09-26T19:24:04.716+0000","up_votes":1,"down_votes":0,"body":"Hola te puedo preguntar algo? que windows tenes?","replies":[{"poster":"Scärämänziä","date":"2018-09-26T19:39:57.332+0000","up_votes":1,"down_votes":0,"body":"Windows XP, También me pasó en la otra pc de mi hermano, tiene windows 7 los dos x86  (32 bit)","replies":[]},{"poster":"quimeyrisa","date":"2018-09-26T19:38:55.489+0000","up_votes":1,"down_votes":0,"body":"tengo windows xp me funcionaba perfecto llevo meses jugando y ahora me pasa esto","replies":[]}]},{"poster":"quimeyrisa","date":"2018-09-26T16:55:41.847+0000","up_votes":1,"down_votes":0,"body":"ME PASA LO MISMO AYUDA\nNO ME RESPONDEN LOS DE RIOT EL TICKET","replies":[]},{"poster":"Turing Test","date":"2018-09-26T16:13:39.756+0000","up_votes":1,"down_votes":0,"body":"Mm actualizaciones al anti-cheat. No he actualizado League of Legends todavía pero es probable que haya más gente con el mismo  error. Si es así, lo van a arreglar ¿Te pasa siempre? ¿Has podido iniciar alguna partida?","replies":[{"poster":"Scärämänziä","date":"2018-09-26T16:24:44.605+0000","up_votes":1,"down_votes":0,"body":"Hola, Es la primera vez que me pasa y ya vi varios post al respecto. Y no hay solución concreta aún. Algunos vi que lo solucionaron desactivando el antivirus (No me dió solución) Otros solucionaron con el hextech repair (Cosa que no me deja instalar) . La verdad un embole.","replies":[]}]}]}