{"poster":"i am Mighti","date":"2018-12-30T23:49:48.846+0000","title":"Update Xin Zhao's Lore !!!","subforum":"Story, Art, & Sound","up_votes":5,"down_votes":1,"body":"So Demacia, Ionia, and Noxus had lore overhauls and Demacia just had another short story released. Yet, a champion that has ties to ALL THREE OF THESE NATION STATES hasn&#039;t been updated in a long time. It doesn&#039;t make any sense for his current lore to be what it is. Not only does it not fit his new splash art, it is very confusing. Keep the gladiator aspect of it, but flesh it out and update his relationships. COME ON RIOT !!!","replies":[{"poster":"Lewanor","date":"2018-12-30T23:58:40.561+0000","up_votes":3,"down_votes":0,"body":"1- Noxus didn't get an overhaul, they got the most minimalist story update yet. \n\n2- From what I've heard he'll get something with our chained champion but we shall see. I'll join you on the request train if they don't update him by then :p","replies":[{"poster":"i am Mighti","date":"2018-12-31T01:05:23.203+0000","up_votes":1,"down_votes":0,"body":"I wonder what the chained champion is all about. There was some leak about their abilities, but it doesn't really tell much in terms of flavor. And I wonder how Xin would tie into the new champion.","replies":[{"poster":"EdgeLady","date":"2018-12-31T03:35:49.253+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=i am Mighti,realm=NA,application-id=6kFXY1kR,discussion-id=3uwlAl5x,comment-id=00000000,timestamp=2018-12-31T01:05:23.203+0000)\n>\n> I wonder what the chained champion is all about. There was some leak about their abilities, but it doesn't really tell much in terms of flavor. And I wonder how Xin would tie into the new champion.\n\nMy guess is that Xin has some form of limited Ionian magic, probably tied to his gladiatorial martial arts that he uses in combat (something like his ultimate, perhaps). This would tie in with a Sona update, who is also an Ionian mage who was brought to Demacia and has to hide her powers, though in a different way. \n\nWhile Ionians see magic as something fluid and easily acquired, for Demacians, it's very black-and-white, like everything else for them. One bit of magic use, and you're finished. So that's why I'm wondering if Xin, even if his magic is very limited, might have some secrets from his homeland.","replies":[]},{"poster":"CauseSCIENCE","date":"2018-12-31T01:43:24.080+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=i am Mighti,realm=NA,application-id=6kFXY1kR,discussion-id=3uwlAl5x,comment-id=00000000,timestamp=2018-12-31T01:05:23.203+0000)\n>\n> I wonder what the chained champion is all about. There was some leak about their abilities, but it doesn't really tell much in terms of flavor. And I wonder how Xin would tie into the new champion.\n\nThe new champion is definitely Demacian tho. The architecture in the teaser looks very similar to the the throne room art.","replies":[]}]}]},{"poster":"Robertsmash","date":"2018-12-31T14:27:17.204+0000","up_votes":2,"down_votes":0,"body":"Yeah his lore doesn't really hold up well. Given how they're trending towards realistic political entities and relationships, it's odd that Jarvan II himself infiltrated Noxus to free a single Ionian man just because he'd heard of him. Plus, I get being grateful to your rescuer, but shouldn't Xin Zhao have affairs to get back to in Ionia? If not, shouldn't it be established that everyone he ever cared about is assuredly gone, and that he doesn't care about returning to his old country? Does he really intend to serve in Demacia until he dies?\n\nI guess you could say he's all about HONOR and paying back a life debt, but his rescuer Jarvan II is gone now. Can't wait for some clarifying Xin lore, since I love spearmen and right-hand guards in fiction. And he's both.","replies":[{"poster":"i am Mighti","date":"2019-01-01T01:21:42.216+0000","up_votes":1,"down_votes":0,"body":"Your post does a great job of encapsulating the issues with Xin's current lore.  Sure, great, he fought in the Noxian gladiatorial pits, ala Draven. That is all well and good, especially him being super successful in that arena. But, you make a great point about Jarvan II. Why go through all of the trouble to infiltrate Noxus and risk open warfare to rescue one guy...it doesn't make any sense.\n\nThis ties into how Xin looks in his splash art. Unless he was fighting in the pits when he was 8 years old, he would be closer to 60 now...given that a second generation monarch rescued him. He looks closer to 30-40 in his splash art which doesn't really play well into his current lore.\n\nAlso, if he was a POW then what about his family and friends in Ionia? Does he truly not give a crap about them because \"honor\"?\n\nHaving a champion tied to all three nations, but having really outdated lore is frustrating.","replies":[]}]},{"poster":"Warlord Dienekes","date":"2018-12-31T00:34:17.058+0000","up_votes":2,"down_votes":0,"body":"Because I’m a know-it-all, I don’t think any of those three are nation states. Noxus is a multi-ethnic empire, Ionia is a continent. Demacia might be, but considering we’re getting French, Italian, and English speakers within its borders the signs point to not. \n\nThat bit of useless pedantry out of the way. I agree, Xin Zhao could use some lore. I’d be amused if the Ionian Xin Zhao becomes Demacia’s Sir Moriaen.","replies":[]},{"poster":"GreenLore","date":"2019-01-04T16:56:57.290+0000","up_votes":1,"down_votes":0,"body":"Overall I'd say the chance is good for {{champion:236}} {{champion:5}} and {{champion:37}} to get updated bios.(I know Lucian got already a short story,but his bio was never updated)","replies":[]},{"poster":"mrmeddyman","date":"2019-01-04T06:24:55.728+0000","up_votes":1,"down_votes":0,"body":"Main thing that needs to be addressed with Xin is that he looks way to young to have been saved by Jarvan II","replies":[]},{"poster":"KFCeytron","date":"2018-12-31T01:09:45.811+0000","up_votes":1,"down_votes":0,"body":"I don't see the point. After all, only actions truly speak.","replies":[{"poster":"i am Mighti","date":"2018-12-31T02:07:59.717+0000","up_votes":1,"down_votes":0,"body":"Love the reference to his quotes, also love your name...bwahahaha.\n\nBut seriously, lore is the only way we are getting some of these characters fleshed out. Xin isn't as important or prominent as Ashe so unlikely he would get his own feature comic.","replies":[]}]}]}