{"poster":"Dacher","date":"2017-07-10T16:37:21.580+0000","title":"Ping di LoL più alto rispetto al ping reale?","subforum":"Discussioni generali","up_votes":3,"down_votes":0,"body":"Ragazzi, una domanda stupidissima:\r\nHo una connessione che viaggia a 10mbps di download, 3mbps di upload, e 21 di ping.\r\nNessun problema, va tutto un amore, tranne LoL, ultimamente.\r\nIn partita pingo minimo 80-90, fino a picchi da 400.\r\nHo contattato anche il mio provider, che ha effettuato un controllo di 10 minuti durante i quali ho effettuato una sessione di allenamento.\r\nIl risultato: in game ho pingato con i soliti risultati scarsi (minimo 80-90 picchi da 400), mentre lui ha continuato a vedere la connessione stabile tra i 20 ed i 30 di ping.\r\n\r\nOra, la cosa curiosa &egrave; che se provo a pingare direttamente i server di LoL EUOvest (tramite prompt dei comandi, utilizzando &quot;ping 104.160.141.3 -t&quot;), il ping risultante &egrave; fisso a 40.\r\n\r\nQualcuno sa darmi qualche consiglio? D:\r\nHo provato pure a disinstallare LoL e reinstallarlo (si lo so che &egrave; la cosa pi&ugrave; becera da fare, ma mi trovavo ed ho pensato di farlo xD) ipotizzando un qualche errore nell&#039;installazione, ma nulla.\r\nQualche evocatore pi&ugrave; studiato di me mi halpi pls, sono disperato {{champion:32}}","replies":[{"poster":"Chroniicles","date":"2017-07-10T17:41:26.974+0000","up_votes":3,"down_votes":0,"body":"Ciao! Se il tuo ping da prompt verso il server di lol è di 40, ingame dovresti avere lo stesso ping con una varianza di +/- 5ms per via della protezione ICMP; gli sbalzi che hai non sono normali e potrebbero dipendere da interferenze verso il client. \nControlla innanzitutto che nessun programma stia limitando il client, segui questa [guida](https://support.riotgames.com/hc/it/articles/204134104-Impostare-le-autorizzazioni) e prova anche se c'è qualche settaggio che potrebbe darti problemi seguendo queste [linee guida](https://support.riotgames.com/hc/it/articles/201752664-Risolvere-i-problemi-di-connessione). \nTienici informati sull'esito delle prove ;)","replies":[]},{"poster":"Zekutsu","date":"2017-07-10T17:41:50.052+0000","up_votes":1,"down_votes":0,"body":"Seguo","replies":[]}]}