{"poster":"Slimegoon","date":"2017-05-23T13:20:57.099+0000","title":"Can We Talk About Malphite?","subforum":"Gameplay","up_votes":80,"down_votes":10,"body":"As Riot goes over champions with poor playstyles, can we please discuss and look over Malphite for a complete rework?  In terms of pure balance I think he's in a decent spot, but his entire kit tends towards boring, detached gameplay, both for Malphite and his opponents.\r\n\r\nLook at Malphite in lane.  He does basically one thing, spam Q until his enemy wants to scream.  As a point and click nuke, there's literally no counter-play besides not getting in range and playing passive.  If you try to engage it steals your move speed, giving Malphite the ability to further disengage.  Add to the fact that Malphite needs to completely disengage to restore his passive, and you get some of the most boring matchups in the game in Malphite lanes.\r\n\r\nAfter lane Malphite quickly becomes an ult bot, which is it's own issue.  There's almost no reason to consider Malphite during teamfights after his ult is down.  He doesn't do enough damage across his other spells to give him the power of a bruiser and his Q isn't spammable enough to be extremely useful.  His ult, while great, is all that defines him outside of lane, which is a problem.\r\n\r\nI think they need to make him a more distance based character; boulders do gain speed as they roll down hill.  Make his Q a skillshot that gains damage and slow as it travels, and make his ult the same.  At the same time, shift damage away from his ult and Q, and give him more utility and damage in his W.\r\n\r\nI'd like to see a Malphite that's fun to play, and considering his high win rate with skilled players but still very low pick rate, I don't think we're there.","replies":[{"poster":"Grimspeake","date":"2017-05-23T13:56:19.092+0000","up_votes":3,"down_votes":22,"body":"Malphite has the weakest slow jn the game with his lvl 1 q","replies":[{"poster":"Azure Dancer","date":"2017-05-23T14:02:05.072+0000","up_votes":42,"down_votes":0,"body":"Well its kinda a movespeed steal","replies":[]},{"poster":"Gosh Darn","date":"2017-05-23T18:59:43.977+0000","up_votes":20,"down_votes":1,"body":"It's 4 seconds long...","replies":[{"poster":"AwesomeGuyDj","date":"2017-05-23T19:53:47.245+0000","up_votes":7,"down_votes":1,"body":"God that fucking movespeed steal.\nYou cant catch him half the time.","replies":[{"poster":"Votable Jester","date":"2017-05-23T20:46:51.275+0000","up_votes":9,"down_votes":0,"body":"lol that's why I loved taking him in Hide and Seek.  You'll never see a more mobile rock.","replies":[{"poster":"InsaneKiller02","date":"2017-05-24T00:33:31.104+0000","up_votes":12,"down_votes":0,"body":"Don't talk about this. Riot took a big part of my life away by removing Crystal Scar.","replies":[]},{"poster":"MunchCrunchLunch","date":"2017-05-24T04:26:30.538+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Votable Jester,realm=NA,application-id=3ErqAdtq,discussion-id=61MIsAc8,comment-id=0001000100000000,timestamp=2017-05-23T20:46:51.275+0000)\n>\n> lol that&#x27;s why I loved taking him in Hide and Seek.  You&#x27;ll never see a more mobile rock.\n\nhttp://imgur.com/4kd3729","replies":[]}]}]}]}]},{"poster":"Ralanr","date":"2017-05-23T13:31:15.356+0000","up_votes":32,"down_votes":0,"body":"Honestly I think Malphite needs a full VGU (Riot seems to think this) because of how much of an ult bot he is.  If his ult is down, then he's not very useful outside of lane. And not to mention his ridiculous AP scaling on it. \n\nI can't speak for all tank mains, but Malphite is honestly one of the most boring champions I have ever played (and I've played a lot). Outside of his ult it doesn't feel like he does much, probably because his ult has so much reliable power. \n\nOne direction I think they should take Malphite is to play up the fact that he's a walking mountain. That his very presence is causing the area around him to shatter with each step. Sort of like he's accidentally terraforming (or just causing earthquakes) the land. \n\nHell, a full VGU of Malphite could allow Riot to experiment with the grounded CC more.","replies":[{"poster":"Teridax68","date":"2017-05-23T17:26:14.597+0000","up_votes":4,"down_votes":2,"body":"I agree with this, but I also think calling a champion an \"ult bot\" can be misleading, as it implies that the champion needs to have power taken from their ult and placed onto their basic abilities, as happened with Sejuani. For sure, Malphite is an ult bot in that he either ults or whiles away the time in-between, but I think the issue stems from his basic abilities, and how little power they can be given for the reliability that they have.\n\nNerfing Malph's ult could be a possibility, but I think there's value in keeping its core free-targeted dash + AoE knockup combo as the upper bound for what constitutes the most reliable initiation ult around. The issue with his kit, however, is that everything else about him is ultra-reliable as well: his Q is  a point-and-click nuke, his W is two steroids, one of which is a permanent passive, and his E is a PBAoE effect, which serves no purpose but to auto-punish enemies he gets close to. Because his kit can't really miss or be mitigated in any way, besides having his passive be placed on constant cooldown, Malphite can't really afford to have great crowd control outside of his ult, or interesting defensive abilities. He doesn't have to be Sion levels of unreliable, but he should definitely have more of a sliding scale between power and reliability so that he can pull off more impressive moves if he plays right. Going with the above idea of terraformation and being a literal force of nature, having Malphite take the time to alter his surroundings, or stop himself for brief periods of time, could insert some unreliability into his abilities in a manner that would be thematically fitting.\n\nAs an aside, I wish Sejuani's changes also didn't operate by draining power from her ult, because I think her issue was pretty much the same, in that her basic ability power was poorly allocated through ultra-reliable and relatively boring abilities (her old W and E were especially uninteresting). Making her ult stun single-target did pave the way for more power on her basic abilities, but I'd argue their power allocation is even worse now, as her aura doesn't generate that much gameplay in practice, and the current implementation of her E and shatter damage makes her way too focused on single targets, when she should be disrupting multiple enemies at a time. Weakening her ult took away from one of her high moments for not that much benefit, and I hope the same doesn't happen to Malphite.","replies":[{"poster":"OyddAWqJ5r","date":"2017-05-23T20:42:15.592+0000","up_votes":3,"down_votes":3,"body":"You can't shift power into basic abilities without shifting it from somewhere.\n\nIf Malphite is balanced right now and you simply buff or rework all his basic abilities to be more impactful then you are directly overpowering Malphite.\n\nIf more power is put into basic abilities less power needs to be on his ult.","replies":[{"poster":"Teridax68","date":"2017-05-23T20:49:44.624+0000","up_votes":8,"down_votes":0,"body":"You are forgetting that reliability itself is a form of power. Subtracting reliability from a kit is therefore a direct subtraction of power. If you were to replace that reliability with other forms of power, such as more impactful CC, you could therefore end up with an equally powerful kit. \n\nWhat I am advocating for Malphite is to tone down the reliability of his basic abilities, all of which are way too reliable and not nearly interactive enough, and instead strengthen them into more interesting tools that would allow him to do cool things in-between ult casts. None of this requires nerfing his ult.","replies":[]}]}]},{"poster":"Oelyk","date":"2017-05-24T02:24:55.760+0000","up_votes":3,"down_votes":0,"body":"TBH, I think he is fun cause people underestimate his W and E.","replies":[{"poster":"PhDs Nuts","date":"2017-05-24T03:58:38.622+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lazy cat,realm=NA,application-id=3ErqAdtq,discussion-id=61MIsAc8,comment-id=00000003,timestamp=2017-05-24T02:24:55.760+0000)\n>\n> TBH, I think he is fun cause people underestimate his W and E.\n\nHe does way more damage than people expect with W max.","replies":[]}]},{"poster":"FlameHalbrdOkido","date":"2017-05-23T22:01:06.580+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Ralanr,realm=NA,application-id=3ErqAdtq,discussion-id=61MIsAc8,comment-id=0000,timestamp=2017-05-23T13:31:15.356+0000)\n>\n> Honestly I think Malphite needs a full VGU (Riot seems to think this) because of how much of an ult bot he is.  If his ult is down, then he&#x27;s not very useful outside of lane. And not to mention his ridiculous AP scaling on it. \n> \n> I can&#x27;t speak for all tank mains, but Malphite is honestly one of the most boring champions I have ever played (and I&#x27;ve played a lot). Outside of his ult it doesn&#x27;t feel like he does much, probably because his ult has so much reliable power. \n> \n> One direction I think they should take Malphite is to play up the fact that he&#x27;s a walking mountain. That his very presence is causing the area around him to shatter with each step. Sort of like he&#x27;s accidentally terraforming (or just causing earthquakes) the land. \n> \n> Hell, a full VGU of Malphite could allow Riot to experiment with the grounded CC more.\n\nNice idea, what if they switched Rammus and Malphites Ults? Anyone else feel like their ults got put on wrong champ? I kno now peeps r used to Malphite having Unstoppable force, so its not super likely, but I can't be the only one who feels this way.","replies":[]},{"poster":"Wheatloaf","date":"2017-05-23T18:19:54.304+0000","up_votes":3,"down_votes":0,"body":"The other aspect of why he needs a VGU is his lore. He's a rock-man from another world. That's pretty much all he is right now. A VGU would be a wonderful chance to give him something in both the gameplay and thematic department.","replies":[{"poster":"Ralanr","date":"2017-05-23T18:21:26.136+0000","up_votes":2,"down_votes":0,"body":"A VGU helps with lore updates but isn't necessarily for them.","replies":[{"poster":"Wheatloaf","date":"2017-05-23T18:51:48.718+0000","up_votes":3,"down_votes":0,"body":"All of the full scale VGUs have come with lore updates, partially because they tend to base the new visuals (and sometimes gameplay) off of updated lore. Or sometimes the reverse, basing new lore off the updated look, because the old lore no longer fits.","replies":[]}]}]}]},{"poster":"An Undead brat","date":"2017-05-23T18:05:06.085+0000","up_votes":9,"down_votes":0,"body":"Yes! Make his ult him rolling down the Rift, knocking up enemies and destroy walls - as they planned for Taliyah, but didn't have technology for it back then!\n\nhttp://imgur.com/aUt6604","replies":[{"poster":"It Hertz When IP","date":"2017-05-23T19:31:01.427+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Sexy Bisex Plant,realm=EUNE,application-id=3ErqAdtq,discussion-id=61MIsAc8,comment-id=000a,timestamp=2017-05-23T18:05:06.085+0000)\n>\n> as they planned for Taliyah, but didn&#x27;t have technology for it back then!\n\n\nBack then? I wouldn't trust their pile of spaghetti to do that now.","replies":[{"poster":"An Undead brat","date":"2017-05-23T19:45:34.874+0000","up_votes":3,"down_votes":0,"body":"Well it's not like it is long time ago, but I guess it's not like they didn't improve at all either...","replies":[]}]},{"poster":"yesnobanana","date":"2017-05-24T10:53:29.852+0000","up_votes":2,"down_votes":0,"body":"Expectation: malphite rolls down the rift, knocking up enemies and destroys wall.\n\nwhat will happen with spaggheti code: malphite rolls down the rift, carrying himself to enemy spawn and dies.\n\nwhat will happen in soloQ: malphite runs down mid, feeding the first enemy in his path.","replies":[]}]},{"poster":"Lux Is Mai Waifu","date":"2017-05-23T18:21:28.997+0000","up_votes":8,"down_votes":2,"body":"I thought they should have changed him around instead of sej or zac, his playstyle is much more detached from his design than either of those.","replies":[{"poster":"Hello I am Bird","date":"2017-05-23T19:33:24.209+0000","up_votes":7,"down_votes":2,"body":"He's much harder to change than zac or sej, as he would probably need a full VGU","replies":[]},{"poster":"Autrah Fang","date":"2017-05-24T02:24:22.937+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=CSing Support,realm=NA,application-id=3ErqAdtq,discussion-id=61MIsAc8,comment-id=000b,timestamp=2017-05-23T18:21:28.997+0000)\n>\n> I thought they should have changed him around instead of sej or zac, his playstyle is much more detached from his design than either of those.\n\nthey specifically said they tried to do an update on malph in the tank update, but they found that he needed a full VGU more. therefore they didn't force it.","replies":[{"poster":"Lux Is Mai Waifu","date":"2017-05-24T06:42:11.588+0000","up_votes":1,"down_votes":4,"body":"Sej and Zac were forced as fuck, don't feed me that shit.","replies":[{"poster":"Autrah Fang","date":"2017-05-24T15:46:16.000+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=CSing Support,realm=NA,application-id=3ErqAdtq,discussion-id=61MIsAc8,comment-id=000b00010000,timestamp=2017-05-24T06:42:11.588+0000)\n>\n> Sej and Zac were forced as fuck, don&#x27;t feed me that shit.\n\nwell that's just like, your opinion, man.","replies":[]}]}]}]},{"poster":"LadyRenly","date":"2017-05-23T17:57:59.124+0000","up_votes":4,"down_votes":0,"body":"him being an \"ult bot\" is why I usually love iceborne because if I can get a q I can make life miserable and run down adcs","replies":[]},{"poster":"skyskee008","date":"2017-05-23T15:49:52.813+0000","up_votes":6,"down_votes":2,"body":"Umm... He does quite a big of damage though. He can 1v1 most squishies with ease later in the game. Also his E gives a major AOE attack speed slow. \n\nAlso spamming Q in lane makes you run out of mana super fast, unless you're going AP malphite its not worth.","replies":[{"poster":"Poske","date":"2017-05-24T10:58:27.960+0000","up_votes":2,"down_votes":0,"body":"Max / spamming q is good if you are conterpicked aside form that you dont max q","replies":[]},{"poster":"Yosuke Apperu","date":"2017-05-24T09:11:26.552+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=skyskee008,realm=NA,application-id=3ErqAdtq,discussion-id=61MIsAc8,comment-id=0004,timestamp=2017-05-23T15:49:52.813+0000)\n>\n> Umm... He does quite a big of damage though. He can 1v1 most squishies with ease later in the game. Also his E gives a major AOE attack speed slow. \n> \n> Also spamming Q in lane makes you run out of mana super fast, unless you&#x27;re going AP malphite its not worth.\n\nGood points, I usually e max any lane but mid. Malphite with frozen heart is brutal to an adc's dps. It is kind of annoying though because of how easily you can over cap cdr if you aren't careful.","replies":[]}]},{"poster":"nice table","date":"2017-05-23T19:38:27.543+0000","up_votes":3,"down_votes":1,"body":"\"a point and click nuke with no counterplay\" bruh ... thats not malphite at all. if you are playing a melee malphite doesn't even max q first lul","replies":[{"poster":"KVbqbFsC8e","date":"2017-05-23T19:53:20.977+0000","up_votes":3,"down_votes":1,"body":"Yeah that is quite a silly description, especially since you can easily flash his ult.","replies":[{"poster":"Poske","date":"2017-05-24T10:59:48.028+0000","up_votes":2,"down_votes":0,"body":"Aside from Jinx ultimate malphite ultimate is one of the hardest ultimate to flash in time","replies":[]}]}]},{"poster":"1995 2017RiP Eva","date":"2017-05-24T02:00:45.978+0000","up_votes":2,"down_votes":0,"body":"spam Q in lane? after that i am done reading...\n\nMalphite Q is one the highest mana cost ability in the game and malphite have one the smallest mana pool\n\nHe can only use Q 2 times before he go oom even if he start {{item:2033}} it would make it 3...and it hit for 70 damage...70 base damage.....(Much nuke..very damage)\n\nTHAT WHY NOBODY max Q on lane and they all max E because E have ratio from his W and his armor...\n\nSo unless you speak about AP malphite which is just a niche gameplay then you whole post is just flat out wrong...","replies":[{"poster":"Need Gold 4 Tent","date":"2017-05-24T03:17:39.962+0000","up_votes":2,"down_votes":0,"body":"I beg to differ, you max Q vs squishy AP poke lanes so you can at least trade, since you'll also be rushing MR (which usually came with AP for the old Abyssal). However, you are right about not spamming it (unless you're running a specialised setup to cater for it). You max Q if you're going glass AP though, as it gives the best bang for your buck considering you usually won't live for a second E if your rotation doesn't kill in 1 shot (it usually does though).\n\nAD lanes max E, correct. But his mana pool still doesn't allow spamming of it early anyway.","replies":[{"poster":"1995 2017RiP Eva","date":"2017-05-24T03:35:34.590+0000","up_votes":1,"down_votes":0,"body":"well you never pick malphite vs an AP top...unless you want to have an bad lane..\n\nIf you get counterpicked you still dont max Q special if they counterpick you with vlad you max E so you can farm under turret if you max Q and the enemy AP force the lane inside your turret which he would do because malphite biggest weakness is under turret farming with max Q good luck farming...\n\nUnless like i say you go for yolo AP build then yeah you max Q","replies":[{"poster":"PhDs Nuts","date":"2017-05-24T03:42:38.398+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=VoliStormRage,realm=EUNE,application-id=3ErqAdtq,discussion-id=61MIsAc8,comment-id=001f00000000,timestamp=2017-05-24T03:35:34.590+0000)\n>\n> well you never pick malphite vs an AP top...unless you want to have an bad lane..\n> \n> If you get counterpicked you still dont max Q special if they counterpick you with vlad you max E so you can farm under turret if you max Q and the enemy AP force the lane inside your turret which he would do because malphite biggest weakness is under turret farming with max Q good luck farming...\n> \n> Unless like i say you go for yolo AP build then yeah you max Q\n\nYou'd never max Q against any sustain lane.","replies":[{"poster":"Need Gold 4 Tent","date":"2017-05-24T07:30:48.743+0000","up_votes":2,"down_votes":0,"body":"It's manageable, as I don't play draft so I don't get to choose who I lane against, but I have played a shitton of Malphite games. The bright side of laning against an AP is that you do get to go the \"yolo AP\" build at the beginning to be a threat against the enemy so that they will show you a little more respect, as there are quite a number of MR items with AP. \n\nOr you could go all the way and do a Luden's+tank setup, which gives stupid early burst that a squishy will also have to be wary about. Besides, if they build more MR to counter you, you counter by getting MR yourself and make top lane a wet noodle fight, problem solved.\n\nLast solution is... just go full AP. It always works as long as the enemy has a squishy (AP supports, ADC or glass cannon AP carries), just keep an eye on their items and pick your 1 shot targets wisely. If the entire team invests in heavy MR just for you, your {{champion:91}} is gonna eat them alive anyway.","replies":[]}]}]}]}]},{"poster":"crippler38","date":"2017-05-23T15:44:45.520+0000","up_votes":2,"down_votes":0,"body":"I think it'd be cool if riot made an ability where you draw the path for it and made it malphite's q.","replies":[]},{"poster":"Troll for Trump","date":"2017-05-23T17:39:02.935+0000","up_votes":4,"down_votes":6,"body":"Fid basically does the same thing, but more binary and oppressive","replies":[{"poster":"statelesskiller","date":"2017-05-23T18:08:39.772+0000","up_votes":1,"down_votes":2,"body":"the only forgivable thing about fiddle is that he has to build squishy to do fuck tons of damage\n\nor does he? like i know he has some pretty crazy ratios. like just one damage item on him might be enough to be a major damage threat, and then just build tank","replies":[{"poster":"elon wątroba","date":"2017-05-23T19:25:10.626+0000","up_votes":2,"down_votes":0,"body":"But his damage outside his r is unreliable. You can just walk away from his w and his e relies on other targets to bounce.","replies":[{"poster":"statelesskiller","date":"2017-05-23T21:08:05.197+0000","up_votes":2,"down_votes":1,"body":"well in the middle of a team fight you would be surprised how reliable that bounce is","replies":[]},{"poster":"GayFluffyUnicorn","date":"2017-05-24T11:36:45.596+0000","up_votes":1,"down_votes":0,"body":"I consider a fiddle on my team a free lose and dodge.","replies":[]}]}]}]},{"poster":"Rikari","date":"2017-05-24T12:20:58.761+0000","up_votes":1,"down_votes":1,"body":"I have a 88% winrate on malphite,win lane pretty much every game,I max Q last,you don't understand malphite yet,his strengths yet,his playstyle. Take maxing Q last as a hint to what he's strong at.","replies":[{"poster":"SUPERX4PANDA","date":"2017-05-24T14:16:47.606+0000","up_votes":2,"down_votes":1,"body":"I don't think the OP is trying to say that he's weak, in fact he did say that Malphite is quite balanced. What he is trying to say is that he is a very boring champion for most people when compared to most of the roster. And the Q max thing is only really vs ranged top laners like Teemo or Quinn from my experience. Most of the time it's max E but there are some exceptions.","replies":[{"poster":"Rikari","date":"2017-05-24T22:01:34.574+0000","up_votes":1,"down_votes":0,"body":"Maxing Q first is always a bad idea,if its done vs ranged its still bad. range by itself is toxic for all melee top laners.","replies":[]}]}]},{"poster":"Morticianjohn","date":"2017-05-25T01:21:08.823+0000","up_votes":1,"down_votes":0,"body":"I actually like to play Malphite from time to time. I don't main him or anything but to me his playstyle is fine. Nice safe comfortable champion selection. Not much damage but plenty of contribution in team fights.","replies":[]},{"poster":"Faustavian","date":"2017-05-24T22:33:58.566+0000","up_votes":1,"down_votes":0,"body":"{{champion:54}} {{item:3157}} THE GOLDEN VANGUARD WILL RISE!!!","replies":[]},{"poster":"kasfas","date":"2017-05-24T19:44:45.396+0000","up_votes":1,"down_votes":0,"body":"I don't think his q is a good ability. If they gave him a mini rework they should hit this first.\n\nThen his w active is pretty meh. \n\nHis e isn't too bad, and the attack speed slow is real powerful.  \n\nPassive is lame, and should really get changed to something more like rakan or Camille passive.\n\nUlt could become more telegraphed to make the rest of his kit more powerful.","replies":[]}]}