{"poster":"Parmesan Chicken","date":"2015-06-14T07:35:54.481+0000","title":"A way to make the Runes and Mastery pages 10x better.","subforum":"Gameplay","up_votes":27,"down_votes":0,"body":"Ok, So i know what you were thinking, I&#039;m talking about the runes and masteries themselves.  False. Lets talk about the order your Runes and masteries are in. I&#039;m talking about the first Mastery page you made. How it is forever stuck at that Number 1 Spot. But lets say you have 20 Mastery pages, and you want to group them by role. Say 4 for each role(top mid Jung supp ad)But you created them at different times. And all you want to do, is Drag that particular mastery page, and place it in a different order.So the Jist of what I&#039;m saying is, You want to group master page 14 next to Mastery Page 4. But in order to do that you need to either delete mastery page 4 and 14 to make 19 and 20 next to each other, or just deal with them being out of the order you want. I always thought this would be such a nice tool to have, Just to be able to click and drag the rune page/ mastery page tab to put them in the order you want. But hey, maybe you can do that and I just don&#039;t know how. Hope Riot see this.","replies":[{"poster":"macromite","date":"2015-06-14T19:49:04.684+0000","up_votes":7,"down_votes":0,"body":"why are there votes of no?","replies":[]},{"poster":"Raine89","date":"2015-06-17T02:08:51.852+0000","up_votes":2,"down_votes":0,"body":"To add to this they could just make a grouping interface to organize the structure even more.  Like you could create a tab that lists all your ADC masteries. or Jungle Runes. instead of them just being next to each other just making Categories and sub categories that are able to be created by the user.","replies":[]},{"poster":"MasterVidallis","date":"2015-06-15T16:56:35.865+0000","up_votes":2,"down_votes":0,"body":"RITO PLEASE, I BEG YOU","replies":[]},{"poster":"Orders","date":"2015-06-15T04:36:19.651+0000","up_votes":2,"down_votes":0,"body":"Yet another reason why the new client needs to come ASAP. I recall Riot saying how the current client is too ancient to develop things like drag-and-dropping masteries and rune pages.\n\nIt would be a great addition because I personally like things very organized and structured.","replies":[]},{"poster":"Dreadlocks","date":"2015-06-14T07:38:11.414+0000","up_votes":2,"down_votes":0,"body":"I don't see how this could be a bad thing, so why not... I usually make a new mastery page before very game anyways out of habit but I could see this being useful.","replies":[]},{"poster":"SkySquire","date":"2016-02-03T17:44:47.792+0000","up_votes":1,"down_votes":0,"body":"The screen cap, re-title, and re-fill method is so tedious. Not to mention all the issues the current client has with mixing your and a friend's profiles when you're just trying to check out theirs.","replies":[]},{"poster":"OshGoshBoGosh","date":"2015-06-14T23:30:49.232+0000","up_votes":1,"down_votes":1,"body":"Don't really see why you need to drag and drop. You can just adjust your masteries if you want it to be something else. Takes me 10-20 seconds in champ select to make my masteries for a given champion i play.\n\nPlus you title your mastery pages... So I would imagine you could just read... but whatever. I vote NAY.","replies":[{"poster":"5000000000000000","date":"2015-06-15T04:53:39.244+0000","up_votes":1,"down_votes":0,"body":"Suppose you make a new mastery page for a specific jungler. But all your jungler masteries are at 1, 2, 3. Now you got another jungler masteries at page 10 or something.\nAnd when you try to find the mastery later on, you would see your mastery pages disorganized. This is annoying.","replies":[]}]},{"poster":"RUNAAANS HYDRAA","date":"2015-06-15T02:40:35.287+0000","up_votes":1,"down_votes":0,"body":"Been thinking this for a long time now. Well done. Hope it comes about :)","replies":[]},{"poster":"tooomine","date":"2015-06-15T22:31:19.740+0000","up_votes":1,"down_votes":1,"body":"I feel like, with a little bit of design,  the problem that this fix addresses could also be avoided.  I designed my masteries a few months ago to allow me specialized stats based on each role and map that I play competitively. The grouping was part of that design.  \n\nis it really so hard to look at how you're playing the game, and plan your masteries according to those observations?","replies":[]},{"poster":"Toastey","date":"2015-06-14T09:15:58.416+0000","up_votes":1,"down_votes":1,"body":"would be a great quality of life improvement. too bad the league client is literally a reskinned internet explorer shell. i dont think they can manage this fancy click-and-drag stuff.","replies":[]}]}