{"poster":"Marshbouy","date":"2017-04-01T13:38:07.042+0000","title":"Anyone else feel like riot just isn't that good at making april fools jokes?","subforum":"[ARCHIVED] Miscellaneous","up_votes":1,"down_votes":0,"body":"The Draven Day fiasco from last year wasn&#039;t that great but this year I see no joke in the current &quot;bot games&quot;. If anything it&#039;s negatively impacting games because of the confusion it causes and some people not understanding that it&#039;s an april fools day joke so they will play radically differently (not leashing junglers, going more aggro in lane than they should, etc) and ruining the game for others. \r\nAt least Draven Day was mildly entertaining for a while, this just causes confusion.","replies":[{"poster":"Akali Prime","date":"2017-04-01T15:33:45.558+0000","up_votes":1,"down_votes":0,"body":"what do you want riot to do for April fools? murder the president?","replies":[{"poster":"Ozzie Storm","date":"2017-04-01T16:18:42.080+0000","up_votes":2,"down_votes":0,"body":"well that escalated quickly xD","replies":[]},{"poster":"oldskooll","date":"2017-04-02T01:43:26.317+0000","up_votes":1,"down_votes":0,"body":"a simple URF WOULD DONE IT","replies":[]}]},{"poster":"Hethalean","date":"2017-04-01T15:07:57.242+0000","up_votes":2,"down_votes":0,"body":"I'm not entirely sure how anyone can be fooled into thinking these are actual bots.  Or if they ARE fooled, they're called advanced bots... and people are still treating it like the normal bot ai's.","replies":[]},{"poster":"Deep Terror Nami","date":"2017-04-01T13:50:02.879+0000","up_votes":2,"down_votes":0,"body":"I can't decide if it's the best April Fools joke or if it backfired; on one hand it's legitimately pranking people (you'll see some people wholly convinced and miss the joke) and they enjoyed it, but on the other hand some people get really upset for the same reason.","replies":[{"poster":"Marshbouy","date":"2017-04-01T15:09:20.531+0000","up_votes":1,"down_votes":0,"body":"I was instantly not fooled, the announcement post gave it away. The entire joke is now lost on me, so to me it was just a big fail.","replies":[]}]}]}