{"poster":"Marshbouy","date":"2017-01-07T04:45:22.316+0000","title":"If you are playing on a primarily english speaking server","subforum":"Player Behavior","up_votes":7,"down_votes":9,"body":"in a game with primarily English speaking people, it&#039;s probably a good idea to speak english.","replies":[{"poster":"Rito Wuks","date":"2017-08-28T06:27:30.587+0000","up_votes":1,"down_votes":0,"body":"_This thread has been archived. Commenting and voting have been disabled._","replies":[]},{"poster":"Magical Player","date":"2017-01-07T05:02:25.803+0000","up_votes":2,"down_votes":1,"body":"If you don't speak the language don't speak. Just no. All words are fun, consider learning another language before just isolating yourself from the world.","replies":[]},{"poster":"Rustling Bush","date":"2017-01-07T04:47:22.381+0000","up_votes":2,"down_votes":1,"body":"whats the point of this thread? only people who can understand english would be able to read this. if you're going to circlejerk, keep it on gameplay sub.","replies":[]},{"poster":"KVbqbFsC8e","date":"2017-01-07T10:33:37.333+0000","up_votes":1,"down_votes":0,"body":"You aren't even allowed to say things like that these days. I agree with you 100% though.","replies":[]},{"poster":"No flash no life","date":"2017-01-07T09:32:36.910+0000","up_votes":1,"down_votes":0,"body":"If this is a different game, say it's mmorpg and we're doing a serious raid where communication isn't optional, I would entirely agree. Not able to find ppl who speak the same language as you to make an alliance with, or not having a server in the language you speak of isn't an excuse to go to a different server and screw up tens of people who paid tremendous efforts beforehand just to ensure they're prepared to make the run a success.\n\nHowever, this is league, a moba game. It's a team game so it's in a bit of a grey area. While you are encouraged and should communicate with your team, it's not impossible to find success without it, and as things stand - with the community we have - communication sometimes makes things worse. Therefore I can't say for certain.","replies":[]},{"poster":"Kuthillick","date":"2017-01-07T09:22:43.296+0000","up_votes":1,"down_votes":0,"body":"Or start learning a new language. It actually is transferable to life outside of league, you know, the life that matters.","replies":[]},{"poster":"Zezockary","date":"2017-01-07T09:20:30.065+0000","up_votes":1,"down_votes":0,"body":"Non english speaking people have just as much of a right to play as you do.","replies":[]}]}