{"poster":"Marshbouy","date":"2016-12-24T14:19:15.346+0000","title":"Why do people always go straight to \"Oh it's X main talking\"","subforum":"[ARCHIVED] Miscellaneous","up_votes":22,"down_votes":4,"body":"There have been so many times where I have been accused of maining a champion that I rarely play. I&#039;ve been accused of being a Yasuo main every time I try to dispel some shitty nerf idea or tell someone to get better at playing the game. \r\nIf I remember correctly the last time I remember playing Yasuo was over a month ago, at 12 am, in a bot game.","replies":[{"poster":"Big Lincoln","date":"2016-12-24T14:33:32.550+0000","up_votes":23,"down_votes":0,"body":"because being a main of that champion somehow deflates your argument completely and in every single situation.","replies":[{"poster":"Sahn Uzal","date":"2016-12-24T14:39:10.341+0000","up_votes":10,"down_votes":0,"body":"Reading comments on Malicious Metal's threads is pretty entertaining.","replies":[{"poster":"Big Lincoln","date":"2016-12-24T16:30:32.193+0000","up_votes":5,"down_votes":4,"body":"MM's issue is that instead of bumping one of his existing threads he makes an entire new one, and a lot of them just say the same stuff","replies":[{"poster":"Sahn Uzal","date":"2016-12-24T16:54:16.274+0000","up_votes":5,"down_votes":0,"body":"I'll stay neutral on that statement, because it ain't really relevant to the point I'm making.\nI just find it entertaining when I see comments like ''Mordekaiser is broken freelo and he doesn't want Rylais to get nerfed so he can keep abusing it''\nUsing a winningspree the guy had on his main champion as an ''argument''\n\nThat's just pretty entertaining imo.","replies":[]},{"poster":"Tormentula","date":"2016-12-24T18:43:15.023+0000","up_votes":3,"down_votes":0,"body":"Cause MM doesn't say the same stuff, he usually makes the threads for a specific topic about the same issue.\n\nExample: He made a rylais+morde discussion thread for more specific replies, rather than bumping a general morde thread in which the points of concern are quickly drowned by shit post. He made another thread about riot's standards on reverting reworks since they did it for kog'maw but morde who's been questionable since his first rework doesn't get the same treatment.\n\n----\n\nI hate the concept of \"you main so you don't know what you're talking about\", its either treated as biased because everybody wants their mains to be good, or if you never played the champion then you're treated like you don't even know much about the champion itself to give an opinion. \n\n\n","replies":[]}]}]},{"poster":"Melledoneus","date":"2016-12-24T16:26:23.442+0000","up_votes":4,"down_votes":0,"body":"Fucking Shen mains.\n\n*Puts finger on earpiece*\n\nOh, they don't exist? Well, then.","replies":[{"poster":"Bhagswag","date":"2016-12-24T18:53:20.624+0000","up_votes":3,"down_votes":0,"body":"I'm kind of a Shen top main. I'm too scared to take anything else top.","replies":[{"poster":"Melledoneus","date":"2016-12-25T07:49:46.163+0000","up_votes":1,"down_votes":0,"body":"Psh. Meta sheep. We all know Shen is broken since the buffs to his Q AD ratio.","replies":[]}]},{"poster":"Spicy Rice","date":"2016-12-24T18:50:56.270+0000","up_votes":2,"down_votes":0,"body":"They do, it's just that can't see them\n\n*ninja paranoia intensifies*","replies":[{"poster":"Melledoneus","date":"2016-12-25T07:50:11.536+0000","up_votes":1,"down_votes":0,"body":"Damn. So that's why I can't see my own reflection...","replies":[]}]}]}]},{"poster":"warpenguin555","date":"2016-12-24T14:26:28.191+0000","up_votes":2,"down_votes":3,"body":"Because people REALLY dont like to use facts (i don't either) and instead of trying to explain/backup their points it's easier to try to dismiss the other  people.","replies":[{"poster":"venomous frost","date":"2016-12-24T14:45:06.524+0000","up_votes":6,"down_votes":0,"body":"\"facts\" on this board are always biased anyways, they are just subjective opinions presented like facts","replies":[{"poster":"1M Gold Udyr XD","date":"2016-12-25T08:07:33.918+0000","up_votes":1,"down_votes":0,"body":"Statistics is a tangible fact.","replies":[]},{"poster":"5000000000000000","date":"2016-12-25T07:03:11.233+0000","up_votes":1,"down_votes":0,"body":"Presenting facts selectively that supports your arguments while ignoring facts that hurt your arguments is basically lying","replies":[]}]}]},{"poster":"Valeckserai","date":"2016-12-24T18:30:30.131+0000","up_votes":5,"down_votes":0,"body":"Never played Yasuo in my life. But since I thought random idiots on the boards had stupid ideas on how to \"balance\" the game I'm apparently a Yasuo one trick.","replies":[{"poster":"drakuIa421","date":"2016-12-24T20:56:19.719+0000","up_votes":3,"down_votes":0,"body":"rule #1 of the boards: logic isnt allowed\nrule #2 of the boards: yasuo is broken\n\nnotice how well these two rules work together?","replies":[{"poster":"5000000000000000","date":"2016-12-25T07:04:03.543+0000","up_votes":1,"down_votes":0,"body":"\"Yasuo is broken\" is rule #1","replies":[]}]}]},{"poster":"Zelorxon","date":"2016-12-24T14:59:35.384+0000","up_votes":5,"down_votes":1,"body":"I was accused of being a trump supporter.\nAnd a liberal.\nAnd a polish.\nAnd a bad player too.","replies":[{"poster":"5000000000000000","date":"2016-12-25T07:05:22.469+0000","up_votes":1,"down_votes":0,"body":"~~Technically you can be all of those~~\nBut really, we've all been accused of being bad at some point.","replies":[{"poster":"Zelorxon","date":"2016-12-25T07:33:28.685+0000","up_votes":1,"down_votes":0,"body":"Yeah but at least i wish i was called bad when i'm feeding/getting dumpstered, not when i write a handy guide for retards to get plat ez/i'm fed and carrying/i'm the only one who isn't saying retarded things just because i made people feel like a dipshit.","replies":[]}]},{"poster":"Valeckserai","date":"2016-12-24T22:02:39.825+0000","up_votes":1,"down_votes":0,"body":"Do you at least play {{champion:268}}?","replies":[{"poster":"Zelorxon","date":"2016-12-24T23:28:49.499+0000","up_votes":1,"down_votes":0,"body":"Besides the fact that i don't play mid lane and suck at it to the point i wish i was the mid laner on the opposite team, azir is one of the few champions where i suck at, along with nidalee, reksai, jayce, riven, gp, xerath and yasuo.","replies":[]}]}]},{"poster":"Kingnewgameplus","date":"2016-12-25T01:47:11.747+0000","up_votes":3,"down_votes":0,"body":"Oh look at this, another AWP main complaining about the balance of sonic generations, and think they can balance better than the entire company of rockstar, scroll on.","replies":[]},{"poster":"Cowseed","date":"2016-12-24T23:06:10.165+0000","up_votes":3,"down_votes":0,"body":"This is a complete lie. I've never once heard anyone accusing other people of being 'X main'. The only champ we have from the alphabet is {{champion:238}}.","replies":[{"poster":"5000000000000000","date":"2016-12-25T07:05:43.470+0000","up_votes":1,"down_votes":0,"body":"Found a Z main","replies":[]}]},{"poster":"macromite","date":"2016-12-24T17:53:39.859+0000","up_votes":3,"down_votes":0,"body":"Fucing yasuo mains and their not maining yasuo amirite","replies":[]},{"poster":"MissingKayo","date":"2016-12-24T15:00:33.190+0000","up_votes":5,"down_votes":2,"body":"They have nothing else to support their claims.","replies":[]},{"poster":"Leetri","date":"2016-12-25T12:32:16.776+0000","up_votes":1,"down_votes":0,"body":"I was called a Teemo main because I liked playing Abathur in Heroes of the Storm. The last time I played Teemo was on the 26th of January in an ARAM, and I only have 7 games in total as him since 2010.\nSome people really like grasping at straws to try and make their opinion valid.","replies":[]},{"poster":"Catastrop","date":"2016-12-24T23:40:36.227+0000","up_votes":1,"down_votes":0,"body":"The opposite also happens, saying you don't main X when you disagree about something regarding X. After the assassin update, giving my two cents on why new LB and new Kat were broken/fine respectively, meant I apparently I didn't main them because I didn't mindlessly jump on the \"Riot sucks at reworks\" bandwagon.","replies":[]},{"poster":"R18","date":"2016-12-24T21:21:34.231+0000","up_votes":1,"down_votes":0,"body":"Because MOST Yasuo mains have big egos.","replies":[]},{"poster":"HazyCloud7","date":"2016-12-24T21:08:20.714+0000","up_votes":1,"down_votes":0,"body":"People inherently have bias towards their champions. I avoid pointing this out when people use sound logic and back up their argument with facts & statistics, but then then there's lee sin mains that say something silly like \"Lee Sin doesn't need any nerfs\" and they're just asking for it. ","replies":[]},{"poster":"Jet Sett","date":"2016-12-24T18:43:27.406+0000","up_votes":1,"down_votes":0,"body":"Well \"get better\" is always a poor argument and makes people think you're just salty someone is insulting your main, or \"defending your freelo\" Other than that I just see it as people think that because they're opinion is backed by the majority (or seems to be) that anyone who disagrees has a specific bias.\n\nFor example, Say a {{champion:90}} main resurfaces from the dark recesses of the underground and says Yas is totally balanced and may even be weak. His specific bias would be that he mains a counter to Yasuo and thusly does not care/worry about Yasuo because he himself can deal with Yasuo just fine.","replies":[]},{"poster":"Spaceman5pff","date":"2016-12-24T15:55:10.763+0000","up_votes":1,"down_votes":0,"body":"Had some idiot say I was a graves main to try to shut me up once.\nSaid I was \"abusing graves jungle to climb the ranked ladder\"\n\nI played him 12 ranked games, and totalled a 75% winrate.\nI played him toplane, not jungle, and barely climbed at all.\nFor comparison, in the same season I had 30 Gragas games and only slightly fewer Poppy games.\nIf anything I mained Gragas last season, and my real main was normal games.\n\nSome people just really have no idea about anything.","replies":[]},{"poster":"Risk of Fate","date":"2016-12-24T15:31:02.969+0000","up_votes":1,"down_votes":0,"body":"Also the fact that if you're below Diamond/Challenger, you obviously don't know what your talking about and they make you play in the sandbox while the big boys play baseball.\n\nI still get a kick out of these \"OMG, Yas OP\" threads when I personally make them scared to lane against me because I well harass the hell out of their range and I don't take kindly to their windwall bs.","replies":[]}]}