{"poster":"Marshbouy","date":"2016-06-20T03:05:20.741+0000","title":"How the fuck are you supposed to win?","subforum":"Gameplay","up_votes":1,"down_votes":4,"body":"How do you win with meelee dravens? How do you win with AFK jannas? How do you? Can someone look me in the eyes and say &quot;you just need to carry your team&quot; because thats not how league works anymore. Solo carrying needs teammates who can do at least something, not AFKs or feeders.","replies":[{"poster":"Rito Wuks","date":"2017-08-28T04:29:55.130+0000","up_votes":1,"down_votes":0,"body":"_This thread has been archived. Commenting and voting have been disabled._","replies":[]},{"poster":"mærk","date":"2016-06-20T03:19:11.713+0000","up_votes":2,"down_votes":0,"body":"A) Your match histories shows you play multiple roles, great but narrow it down to two roles and a pool of champions. Your Nasus is winning your games, spam it.\nB) Complaining in game and now onto boards WON'T make you win... Simply stop telling people how to play when millions others are either or in Silver V... Play with what you GOT and I'm sure enemies have had the same thing you've experienced so you'd get a free win, great. TEAMWORK beats flaming/raging at someone who then under performs.\n3) Winning ISN'T about one lane dominating, hence teamwork. If you're doing well either help the team snowball OR go split push hard and hope your team sees IF not then just GROUP.\nZ) Nuff said.\n\nAlso 4v5s are winnable as long as you and your team work together.","replies":[]},{"poster":"redniwediS","date":"2016-06-20T03:09:20.824+0000","up_votes":1,"down_votes":0,"body":"You can win any game, except for the ones you can't.\n\nYou're describing the games that cannot be won.  Just let those go and move on to the ones you can win.  Winning, particularly in Ranked, is a game of averages, not individual matches.","replies":[{"poster":"Marshbouy","date":"2016-06-20T03:11:12.719+0000","up_votes":1,"down_votes":0,"body":"Then people need to stop telling me \"you can win every game, if you can't, you arent good enough\" because thats what im told. every. time.","replies":[{"poster":"redniwediS","date":"2016-06-20T03:15:18.205+0000","up_votes":1,"down_votes":0,"body":"You know what their way of thinking is?  It's optimistic and requires a little bit of extrapolation.  They are quite obviously assuming a real game situation, not some AFK or troll situation.  Not everyone is good at extrapolating, so don't feel too bad.","replies":[]}]}]},{"poster":"Votable Jester","date":"2016-06-20T03:10:47.330+0000","up_votes":1,"down_votes":0,"body":"Wow, a team game that requires more than 1 person to win.  That's soooo terrible.\n\nStatistically, if you are one of the \"good\" people, there is higher probability of the enemy having useless players than your team (4 open spots on yours vs 5 on theirs).  With this, you may lose some games due to useless players, but the other team will have that happen more often.\n\nEven if it seems like it happens to you way more often than the other team, that is likely simply because people retain memory negative experiences more than they do positives ones.","replies":[]}]}