{"poster":"Zyranium","date":"2017-06-27T13:54:25.943+0000","title":"Some questions about Evelynn next Update","subforum":"Story, Art, & Sound","up_votes":5,"down_votes":0,"body":"As we all know, our favorite _**smurf demon bdsm queen**_ also known as {{champion:28}} will have a big update ! \r\n\r\nAs a loyal Eve main since I started League, I wanted to know some important changes you will make on her, because we usually talk about {{champion:6}} and the upcoming new Champs Kayn and Raast, but I prefer embracing agony you know, and ask you some ~~really~~ important questions on my favorite sexy jungler ! So let&#039;s start !\r\n\r\n- First of all, Will Eve will keep her &quot;Widowmaker&quot; status or she have another ?\r\n\r\n- Will she also keep her hybrid mage status ? \r\n\r\n- Can we summon spikes out of nowhere in her future gameplay ? (This is a real important question for me)\r\n\r\n- Will she keep a spiky/huntress/SM/Dominatrix design ? \r\n\r\n- Does she have ap Ratios ? \r\n\r\n- Can Eve keep her teamfight ability with her ultimate ? And will she have ms bonus ?\r\n\r\n- Does {{champion:4}} will have a splash update on his tango skin which includes Eve on ?\r\n\r\n- Can we cross through walls, like the leaks tells us ? Or is it false ?\r\n\r\n- Can finally Eve be a real succubus, like the piece of art you showed us on your previous post ? \r\n\r\n- Will she still affiliate to the Shadow Isles ? \r\n\r\n- And FINALLY, will we throw games even if we are 30/6 with her ? And bcs she is useless in late game ?\r\n\r\nTHANKS DEAR RIOT IF YOU ANSWER ME, It would be so nice, cauz a lot of people are asking questions, and you only talk about Urgot, I understand if some of these questions are really &quot;too much&quot;.\r\n\r\nBut I really need some questions to be answered even if it&#039;s a &quot;YES&quot; or a &quot;NO&quot; !\r\n\r\nKisses from someone who embraced agony &lt;3","replies":[{"poster":"Killaburn","date":"2017-06-27T16:23:12.999+0000","up_votes":1,"down_votes":0,"body":"reave3 answered that she will be having a shared splash again with TF","replies":[{"poster":"Riot LegendLarry","date":"2017-06-27T17:32:36.016+0000","up_votes":2,"down_votes":0,"body":"We just wrote the creative brief for the Tango Evelynn splash and personally I'm super excited to see what our artists come up with. We also talked about Shadow Evelynn and that one has me super hyped as well.","replies":[{"poster":"RenanRein","date":"2017-06-27T17:40:43.468+0000","up_votes":1,"down_votes":0,"body":"OMG, now I'm afraid that Masquerade will not be the coolest! :(","replies":[{"poster":"Riot LegendLarry","date":"2017-06-27T17:53:20.632+0000","up_votes":6,"down_votes":0,"body":"Oh, don't you worry about Masquerade. The artists have some really badass ideas for that one as well.\n\nI would personally count it a victory if you looked at all three of those illustrations and go, \"I... I can't choose. I can't tell you which one is the coolest. You've got this one over here and that one over there but the other one has this!\"","replies":[{"poster":"Melledoneus","date":"2017-06-27T18:40:21.407+0000","up_votes":1,"down_votes":0,"body":"Looks like, for the first time in history, we're gonna get multiple splash arts for a skin.","replies":[{"poster":"Arakadia","date":"2017-06-27T19:19:35.762+0000","up_votes":1,"down_votes":0,"body":"I think he just means there were many cool concept illustrations for Masq. Eve.","replies":[{"poster":"Chembaron Yamada","date":"2017-06-27T23:14:09.163+0000","up_votes":1,"down_votes":0,"body":"I think he actually means that it would be a great success if you can't decide which one is the coolest: Masq., Shadow or Tango.","replies":[]}]}]}]}]},{"poster":"Killaburn","date":"2017-06-27T18:09:18.968+0000","up_votes":4,"down_votes":0,"body":"OMG!!!!!!!!!!!!!!!!!!!!!!!!!!!!! riot legendlarry can we please get another frost~~butt~~blade irelia kinda splash please, maybe one of evelyn's new splashes because i want to see evelynn's ~~butt~~ beautyness\n\nhttp://www.mobafire.com/images/champion/skins/landscape/irelia-frostblade.jpg\n\nand btw, is evelyn's skin alongside twitch will be a shared splash again?? sorry for askng so many question","replies":[{"poster":"Riot LegendLarry","date":"2017-06-27T19:03:33.962+0000","up_votes":4,"down_votes":0,"body":"Oh man, I dunno if any splash could come close to Frost~~butt~~blade Irelia but there's one that might come close but I can't promise anything >. <\n\nThe Safecracker splash is going to remain a shared splash with Twitch. It won't be a full update though, it'll be the same splash just updating Eve to reflect her new look.","replies":[{"poster":"Raxistaicho","date":"2017-06-27T19:38:21.475+0000","up_votes":1,"down_votes":0,"body":">Oh man, I dunno if any splash could come close to Frostbuttblade Irelia but there's one that might come close but I can't promise anything >. <\n\nFor Evelynn or somebody else?","replies":[{"poster":"Riot LegendLarry","date":"2017-06-27T19:59:39.416+0000","up_votes":4,"down_votes":0,"body":"Evelynn. There's one illustration that may come close but it's just an idea right now so I can't promise anything lol.","replies":[{"poster":"La Bello","date":"2017-06-27T20:28:30.842+0000","up_votes":1,"down_votes":2,"body":"one thing I would like to ask would be will Evelynn be keeping her current costumed get up (the spiky black armor with the arm capes and spiked leg bands?)\n\nIm actually a huge fan of it and would be really disappointing if it got shafted for the full shadow nudity as was supposedly leaked. is the Evelynn update visually Master Yi tier or more Warwick tier?( resolution updating and more details vs re-imagining like how WW has robo parts now) Or something like Karma where her entire outfit is completely changed","replies":[{"poster":"Riot LegendLarry","date":"2017-06-27T22:29:18.890+0000","up_votes":5,"down_votes":0,"body":"It's a Warwick level rework. As for her costume it's definitely different from her current spike and leather look.","replies":[{"poster":"TerraRising","date":"2017-06-28T03:52:49.008+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Riot LegendLarry,realm=NA,application-id=6kFXY1kR,discussion-id=EUoqa3vd,comment-id=00000000000100010000000000000000,timestamp=2017-06-27T22:29:18.890+0000)\n>\n> As for her costume it&#x27;s definitely different from her current spike and leather look.\n\n... And there went all my enthusiasm, right down the drain.","replies":[]},{"poster":"La Bello","date":"2017-06-27T23:41:49.001+0000","up_votes":2,"down_votes":1,"body":"well\nthats kinda disappointing to hear but im more than willing to give it a chance!\n\nmaybe someday if you guys ever decide to do a \"traditional\" skin line you could bring it back as a nice 975 RP skin or something!","replies":[]}]}]},{"poster":"Killaburn","date":"2017-06-27T20:32:22.162+0000","up_votes":1,"down_votes":0,"body":"can you please tell the artist to pick that illustration, make this happen legendlarry for the community, for the fans, for the lolhentai artists(jk). you can be our riot superhero. jokes aside,  i love you, best rioter ever!!!!!!!! you're happy in you post and not that kinda serious vibe type lol and i love you for that and lastly you dont ignore community responses :D","replies":[{"poster":"Riot LegendLarry","date":"2017-06-27T22:30:01.940+0000","up_votes":3,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"ZapMyHeart","date":"2017-06-28T04:29:06.068+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot LegendLarry,realm=NA,application-id=6kFXY1kR,discussion-id=EUoqa3vd,comment-id=00000000000100010000000000010000,timestamp=2017-06-27T22:30:01.940+0000)\n>\n> {{sticker:slayer-pantheon-thumbs}}\n\nIf you are able to answer this, I would like to know if Eve still retained her stripper heels of agony in her new model? I think a lot of Eve fans are hoping that those remained in her model update (plus one of her lines also references them). ","replies":[]}]}]}]}]}]},{"poster":"Linna Excel","date":"2017-06-27T18:33:25.692+0000","up_votes":1,"down_votes":0,"body":"While I agree with this, I'm not sure Evelynn is a butt-girl particularly with a rework coming.","replies":[]}]},{"poster":"Chromatic Eagle","date":"2017-06-27T20:33:34.939+0000","up_votes":1,"down_votes":0,"body":"Any hints on Shadow Eve?","replies":[]},{"poster":"BLACK REALM GOD","date":"2017-06-27T18:31:44.486+0000","up_votes":1,"down_votes":0,"body":"...that means twisted fate will get an update too right?","replies":[{"poster":"Linna Excel","date":"2017-06-27T18:34:09.393+0000","up_votes":1,"down_votes":0,"body":"Yeah, I think reav3 said the two splashes would be updated at the same time.","replies":[{"poster":"BLACK REALM GOD","date":"2017-06-27T18:45:40.236+0000","up_votes":1,"down_votes":0,"body":"awesome possum. ^_^","replies":[]}]}]}]}]},{"poster":"Riot LegendLarry","date":"2017-06-27T17:50:23.750+0000","up_votes":5,"down_votes":1,"body":"Oh man, I'm not sure how many of these questions I can answer so I'll have to pick an choose just a few. The team working on Evelynn did their homework and really tried to figure out what makes Evelynn so popular among those die hard fans and where they could push even further into the fantasy of an alluring demonic assassin.\n\nI don't want to spoil anything so I'll have to be vague here but she's a strong, beautiful, independent succubus and she don't need anybody telling her where to go!\n\nFor the summoning spikes I'll just say that the artists won't let you down.\n\nAs for your last question, I'm not an Eve main so take it with a grain of salt, but if there's an {{champion:28}} on the other team... never be alone.\n\nCheers!","replies":[{"poster":"Linna Excel","date":"2017-06-27T18:30:52.340+0000","up_votes":4,"down_votes":12,"body":"> [{quoted}](name=Riot LegendLarry,realm=NA,application-id=6kFXY1kR,discussion-id=EUoqa3vd,comment-id=0002,timestamp=2017-06-27T17:50:23.750+0000)\n>\n> The team working on Evelynn did their homework and really tried to figure out what makes Evelynn so popular among those die hard fans\n\nOne thing I think makes her popular is that she doesn't have much in the way of lore, which enables people to fill it in on their own and become more attached to her.  \n\nSome people want her as a vampire.\nSome people want her to be related to the shadow isles as the ruined king's daughter.\nSome people want her to be a succubus.\nFor myself I was thinking human with some relation to the void, think sexual hunger/predator, half voidling perhaps.  \n\nI'm pretty much assuming riot's . . . building team team is going to screw this up big time because they can't leave well enough alone.  I mean you are calling her a succubus when you should know half the community thinks she's a vampire.  \n\nSome people like her because of the outfit, but because it is polarizing, riot is going to get rid of it. Riot hasn't matured enough yet to know that polarizing characters and designs are fine.\n\nThe other thing that makes her popular is her playstyle.  She's very weird to play as, but once you get it, she's very rewarding.  Everything I heard suggested her unique playstyle is going away.\n\nSo I've already filed this rework under complete failure even though it'll be 4-6 months before we see it.  Why?  It's obvious riot doesn't really know or care about eve.  Yes they've got her pegged as a \"sexy assassin\", but that's such a broad category once you get into the nitty-gritty that it doesn't say much.  The other reason I say this is it feels like riot is listening to the complaints more than the positive stuff.","replies":[{"poster":"Riot LegendLarry","date":"2017-06-27T19:29:39.229+0000","up_votes":10,"down_votes":1,"body":"Oh man, I hope that when Eve does come out that you'll still give her a shot!\n\nI can totally understand  how this rework seems rather shallow since I can't really get into details but I think you've hit on some really good points. You're right that since the team is giving her a more structured history / lore the \"mystery\" will be gone but I would posit that a vampire, a succubus, and a being of sexual hunger / predator, are very similar at it's root. The origin maybe different but the fantasy of those three have some strong overlap. Which is what the team tried to keep intact, her attitude and personality around being alluring and sensual but dangerous and vicious.\n\nAs for a polarizing design, again I can't say much, but I think the team has had to overcome some very interesting challenges and the current design still plays into what makes Evelynn so polarizing, as you put.\n\nI can't really talk about her gameplay since I don't play current Eve and I haven't playtested the updated kit.\n\nAs for Rito not caring about Eve, and I don't mean this in a mean way at all, but I dare you to say that to reave3 and see how that goes lol. If you talk to any of the team members you'd be surprised at how hard they're working at trying to make Eve the best she can be.\n\nBut seriously, if you look at the team's track record, I think you'll find that the team does so much more than peg a champion as something and call it a day. I really wish we could show everyone just how much time, effort, and care people put into these projects. The team knows, really knows, that they're messing with people's favorite champions and they're so dedicated to making sure that they're going in a direction that not only makes a better champion but still retains all that people originally loved about them while giving them something new to love as well.\n\nAnyway, I'll get down from my soapbox and let you get back to your day but I really hope that you'll give the Champ Up peeps the benefit of the doubt and give Eve a shot when she's released.\n\nCheers! ^____^","replies":[{"poster":"Linna Excel","date":"2017-06-27T20:15:36.583+0000","up_votes":2,"down_votes":2,"body":"TY for the reply.  While I'm a bit of a cynic, it is good to see that you care about your work at the least.  \n\n\n\n1.  While I totally see your in terms of vampire/succubus, I personally would posit that the finer distinctions are important and lend weight to a design in the long run.  While it is good to hear that riot is trying to get her in the general direction, I would argue that being too fluid with the new eve is a mistake.\n\n2.  As for the polarizing design, from what I can tell via leaks, you guys have decided to scrap the outfit altogether and tried a new direction.  IMO the outfit was a big part of how her design was polarizing because of what it implied to a lot of people, both good and bad.  \n\n3.  Her gameplay is different than other assassins.  Part of that is she is a mixture of burst and sustain damage.  I think a rioter has confirmed that the sustained aspect of her DPS is going.  The other part of it is how you plan things out and do your killing.  It's a little more cerebral than other assassins and very methodical.  She's not like a leblanc who wants to burst you down or a katarina who wants to outplay your team and get a pentakill.\n\n4.  As for riot not caring... that's a tough thing.  One one hand I know you guys are passionate about your work.  On the other hand it's like that guy in that one anime who sacrificed his own daughter for his work and became obsessed with making a better, more perfect version of her.  I've seen too many projects fail because the vision of perfection takes precedence over the past source material.  \n\nLike ASBAR.  \n\nIf anything, it's passion which can doom a project quicker than anything.  \n\n>But seriously, if you look at the team's track record, I think you'll find that the team does so much more than peg a champion as something and call it a day. \n\nThis is my problem with Morello's Soraka rework actually.  He had her pegged as a GW infuse healer from day one without respecting soraka or the fact that in GW, teams almost always had 2 healers on them.  That spell from guild wars was his hammer which made soraka a nail.\n\nAlso, I've seen reworks like {{champion:43}} that the fans just hated.  And I've seen reworks that basically demanded new reworks from the get-go like {{champion:13}}.  That's the biggest problem with reworks IMO.  For everything you guys try to do right, it's likely you'll change or delete something that was important to at least some fans.\n\nI think the important thing is that a lot of this is subjective and for too much of the reworks, riot keeps fans in the dark.  This in turn means you guys are missing an important feedback loop when you guys need it most.  Then by the time it goes public, it's far too easy to listen to the people who said how much they liked the rework, most of them probably never played the champ to begin with, and ignore the aspects people have problems with.\n\nBasically it's very easy for biases to take over, so from too many past experiences I've learned it is usually safer to look at things with a healthy does of cynicism.","replies":[{"poster":"ZapMyHeart","date":"2017-06-28T04:42:28.735+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Linna Excel,realm=NA,application-id=6kFXY1kR,discussion-id=EUoqa3vd,comment-id=0002000100000000,timestamp=2017-06-27T20:15:36.583+0000)\n>\n> \n> Also, I&#x27;ve seen reworks like {{champion:43}} that the fans just hated.  \n\nWith her VGU rework, she was the guinea pig on how to approach it. \n\nFans hated it because there were a lot of suspicious/shady things that revolved around that rework (e.g. Guinsoo's removal from the project, earlier release than expected, giving it to a new designer who didn't know a thing about old Karma). Plus, they didn't like Scarizard/Morello's way of approaching the feedback post-relaunch. Basically, it was like they were trying to convince themselves that they didn't screw up. But considering that the new Karma had to receive multiple buffs throughout the months to even get a 50% win ratio back then, it was clearly a bad rework.\n\nShe didn't look anything like her old model at all was a huge factor. Sej's new model and Traditional skin looked pretty similar, but Karma and her Traditional skin are polar opposites. The color scheme was way off (purple is for Noxians or meant corruption, something that Karma shouldn't be associated with + green seems like it was arbitrarily thrown in; didn't bother to use Ionian colors of red or gold) and the lore was butchered to pieces to where it's an Avatar: The Last Airbender knock-off.\n\nAdd to the fact that her yin/yang theme was removed + gameplay as a battlemage got obliterated, changing her into a weird kite mage with a twin dragon motif that wasn't even incorporated into her kit. \n\nThen through out the years, they slowly and surely stripped any old pieces of her kit and demoted her to the support role. \n\nThe cherry on top of the trainwreck sundae is that any mention of Karma is taboo and that getting a Red to address her is like pulling teeth. Yet, somehow Ryze seems to still get a rework on a yearly basis. \n\nI hate the fact that their ego gets in the way of correcting what was a failed rework and that Karma fans are the ones who continue to suffer and wait (4 years and counting) for a better representation of their favorite champion. ","replies":[{"poster":"Linna Excel","date":"2017-06-28T05:56:50.398+0000","up_votes":1,"down_votes":0,"body":"Good points.\n\nIt really was a shame all they did to her.","replies":[]}]}]},{"poster":"Halodjin Tyr","date":"2017-07-03T15:03:33.867+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot LegendLarry,realm=NA,application-id=6kFXY1kR,discussion-id=EUoqa3vd,comment-id=000200010000,timestamp=2017-06-27T19:29:39.229+0000)\n>\n> Oh man, I hope that when Eve does come out that you&#x27;ll still give her a shot!\n> \n> I can totally understand  how this rework seems rather shallow since I can&#x27;t really get into details but I think you&#x27;ve hit on some really good points. You&#x27;re right that since the team is giving her a more structured history / lore the &quot;mystery&quot; will be gone but I would posit that a vampire, a succubus, and a being of sexual hunger / predator, are very similar at it&#x27;s root. The origin maybe different but the fantasy of those three have some strong overlap. Which is what the team tried to keep intact, her attitude and personality around being alluring and sensual but dangerous and vicious.\n> \n> As for a polarizing design, again I can&#x27;t say much, but I think the team has had to overcome some very interesting challenges and the current design still plays into what makes Evelynn so polarizing, as you put.\n> \n> I can&#x27;t really talk about her gameplay since I don&#x27;t play current Eve and I haven&#x27;t playtested the updated kit.\n> \n> As for Rito not caring about Eve, and I don&#x27;t mean this in a mean way at all, but I dare you to say that to reave3 and see how that goes lol. If you talk to any of the team members you&#x27;d be surprised at how hard they&#x27;re working at trying to make Eve the best she can be.\n> \n> But seriously, if you look at the team&#x27;s track record, I think you&#x27;ll find that the team does so much more than peg a champion as something and call it a day. I really wish we could show everyone just how much time, effort, and care people put into these projects. The team knows, really knows, that they&#x27;re messing with people&#x27;s favorite champions and they&#x27;re so dedicated to making sure that they&#x27;re going in a direction that not only makes a better champion but still retains all that people originally loved about them while giving them something new to love as well.\n> \n> Anyway, I&#x27;ll get down from my soapbox and let you get back to your day but I really hope that you&#x27;ll give the Champ Up peeps the benefit of the doubt and give Eve a shot when she&#x27;s released.\n> \n> Cheers! ^____^\n\nThank you.  this really helps my spirit as a Million mastery evelynn that hasn't been able to win a lot of games this season it's nice to know Reave3 cares about the project.  I was scared that maybe he didn't.","replies":[]},{"poster":"EternalTitan23","date":"2017-06-28T17:08:28.812+0000","up_votes":1,"down_votes":0,"body":"You're getting my hopes up for this rework <3, I really enjoy playing Eve and don't have a big problem with her kit as it is now. And it's nice to see replies like this, can't wait for this rework to come out now!","replies":[]},{"poster":"mr Boombastic787","date":"2017-06-27T21:10:17.635+0000","up_votes":1,"down_votes":0,"body":"In my opinion I think it is Worth messing with peoples mains everyday if you get such a good final Product as the previus VGUs! I mean I would be totally fine if you completely (do not listen now Trundle!) changed my boi Trundle if every other lol player gets such an awesome new champ to main! ~~Don't you dare tuch my Trundle!~~\n\nBut if enough players will enjoy the outcome and it will come new people and main it it would be worth it, even if it is a Little bitter sweet for the old mains","replies":[]}]},{"poster":"Ralanr","date":"2017-06-27T21:22:00.463+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Linna Excel,realm=NA,application-id=6kFXY1kR,discussion-id=EUoqa3vd,comment-id=00020001,timestamp=2017-06-27T18:30:52.340+0000)\n>\n> One thing I think makes her popular is that she doesn&#x27;t have much in the way of lore, which enables people to fill it in on their own and become more attached to her.  \n> \n> Some people want her as a vampire.\n> Some people want her to be related to the shadow isles as the ruined king&#x27;s daughter.\n> Some people want her to be a succubus.\n> For myself I was thinking human with some relation to the void, think sexual hunger/predator, half voidling perhaps.  \n> \n\nIf by popular you mean, \"frustrating topic of conversation whenever she pops up\" then you'd be right.\n\nI'd argue that's her most infamous quality.  She is mysterious pretty much for the sake of being mysterious, which alone is just shallow.  Giving her an identity and then adding clues and hints towards it and how it attaches to the world is better.\n\nBecause at the moment she's only connected to the shadow isles because she's blue and looks like a gothic character in BDSM clothes.\n\n_BDSM clothes that I will miss sadly_","replies":[{"poster":"Linna Excel","date":"2017-06-27T21:34:17.211+0000","up_votes":1,"down_votes":0,"body":"I think mysteriousness works in this one instance partly because it fits her shadowy and hidden theme, but also partly because it gives players a way to customize her to their own tastes.  When people can fill in the blanks, they'll tend to fill in the blanks with things they like.  I think this is a problem for riot specifically because that means something which was purposefully left vague now has a clear definition and I'm thinking for a lot of people, it'll turn out strictly worse because it wasn't what people had in mind.\n\nYou see this in politics a lot.  By not being specific, politicians can broaden their appeal a lot by letting voters fill in the blanks.  \n\nI mean take a look at Kayn.  Now that we've got an anime edgelord instead of a chick in gothic dress, a lot of people are probably disappointed by this.  I mean his design hits its themes well, but because edgy boy instead of a female, there's going to be some disappointment.","replies":[{"poster":"Ralanr","date":"2017-06-27T21:51:22.492+0000","up_votes":1,"down_votes":0,"body":"Sure, but we know what he is. \n\nA mystery is only good if the answer is revealed eventually, even if it's not one that reveals everything. \n\nAnd the problem with filling in the blanks is that it leads to people really misunderstanding what and who the character is, as showcased with so many full VGU's. \n\nMost of the interest in Eve's character is \"who or what she is\" rather her actual character. Her staying a mystery imo is her staying as a cardboard cut out. \n\nI want to know who she is so I can play with that. Not just another mystery that I know will never be answered. \n\nWe don't exactly need her parents or date of birth, but where she actually comes from and what she is are probably a little bit important.","replies":[]}]}]},{"poster":"WarWork","date":"2017-06-27T19:36:45.607+0000","up_votes":2,"down_votes":0,"body":"Lol flaming riot about how they messed up on an unreleased champ lmao","replies":[{"poster":"Linna Excel","date":"2017-06-27T20:18:52.148+0000","up_votes":1,"down_votes":2,"body":"Too much experience suggests this is the likely outcome.  She's always been a problem for riot, so this can't go well.","replies":[]}]}]},{"poster":"BLACK REALM GOD","date":"2017-06-27T18:30:30.158+0000","up_votes":4,"down_votes":0,"body":"support evelynn confirmed","replies":[{"poster":"Riot LegendLarry","date":"2017-06-27T19:05:19.829+0000","up_votes":2,"down_votes":0,"body":"LAWL! I mean, there are a lot of champs that make good supports that you wouldn't initially think about so... sure! Why not.","replies":[]}]},{"poster":"Electro522","date":"2017-06-28T04:47:56.850+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot LegendLarry,realm=NA,application-id=6kFXY1kR,discussion-id=EUoqa3vd,comment-id=0002,timestamp=2017-06-27T17:50:23.750+0000)\n>\n>... never be alone.\n\nOh god..........what have you done?","replies":[{"poster":"Tiniest Turtle","date":"2017-06-28T05:57:18.976+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Paleo Electro,realm=NA,application-id=6kFXY1kR,discussion-id=EUoqa3vd,comment-id=00020002,timestamp=2017-06-28T04:47:56.850+0000)\n>\n> Oh god..........what have you done?\n\nThis has got me fantasizing about some mechanic like Kha'zix where she might even specially interact with people who are alone. Maybe her stealth detection radius is even smaller against people who are alone. \"Never be alone\" has me so hyped for what she's going to become > _ <","replies":[]}]}]},{"poster":"Karn Bishop","date":"2017-06-27T23:23:26.324+0000","up_votes":1,"down_votes":0,"body":"I hope the splashes are good.\n\nThat being said my main concern is that she will be too easy to play, one of the reasons i main her is because she is a niche champion that requires skill to play and most people are too impatient to master it, which leads to knowing my fav champion will be there for me when i do want to play her, it also makes people not ban her because of how rare it is to meet an actual eve main.","replies":[]},{"poster":"Wrathof300","date":"2017-06-27T17:21:27.743+0000","up_votes":1,"down_votes":0,"body":"She will still be linked to the shadow Isles, and since her rework is going to be Warwick scale/ \"a modernization rework\" she probably is going to be able to summon spikes, might not keep the ult since assassins typically don't have overwhelming AoE abilities. And she probably will look different from her current dominatrix get up.","replies":[]}]}