{"poster":"Jeitsu","date":"2016-08-07T16:27:31.259+0000","title":"For The Aatrox's Players | Champion Guide","subforum":"Gameplay","embed":{"description":"Before starting i'm going to introduce myself, I'm Jeitsu, from the EUW server and im 22 years, I'm not a professional player, or diamond, or platinum, I'm a low gold player ... then ... Why are you doing this guide noob?","url":"http://www.mobafire.com/league-of-legends/build/definitive-guide-for-jungler-aatrox-patch-6-15-485085","image":"http://www.mobafire.com/images/champion/icon/aatrox.png"},"up_votes":3,"down_votes":4,"body":"GUIDE INTRODUCTION\n\nBefore starting i&#039;m going to introduce myself, I&#039;m Jeitsu, from the EUW server and im 22 years, I&#039;m not a professional player, or diamond, or platinum, I&#039;m a low gold player ... then ... Why are you doing this guide noob?\nI admit that im not plat or more because I&#039;m not too good in terms of skill, but i&#039;m one thing that im proud of, I&#039;m an engineer.\n\nAnd what if you&#039;re an engineer?\n\nEngineering has led me to be an objective and critical person, since this game are nothing more than math and numbers (apart of the skill and team tactics), I&#039;m a machine of builds, runes and masteries. I have them calculated from all angles, i have calculated from the damage that a certain combo does to how much you heal after x time for the lifesteal effect, as well as basic and comparing statistics between different items in different situations and against certain generic enemies. I love it all calculated as mathematics never betray me.\n\nI&#039;m thrilled to share this knowledge with the community and thus make this guide to this great champion Aatrox, one of my favorites and with whom I have honestly earned my master seven. I hope you enjoy and thanks for reading.\n\nSorry for my bad english and i hope you like it :D.\n\nEDIT: Guys i was wrong in my calculations. I assumed that the 4% impact effect of the BloodRazor was healed with the bloodthirsted, but i was wrong, you all was right, the death's dance is a better choice for him, ty for the advice, i edited my build. I like to see that we are all here to help eachother. Ty so much. :D\n\n{{item:3072}} ->{{item:3812}} \n","replies":[{"poster":"Teslium","date":"2016-08-07T16:40:06.225+0000","up_votes":2,"down_votes":1,"body":"Swap Botrk with rageblade, bloodthirster with ravenous hydra and you got a great build. Although, that kind of bruiser-ish build has fallen off flavor because assasin-ish Aatrox is so much better in Korea right now.","replies":[{"poster":"Jeitsu","date":"2016-08-07T16:44:14.995+0000","up_votes":2,"down_votes":0,"body":"Teorically, Botrk deals more dmg than Rageblade, Ravenous Hydra is a great option too, im gonna test it of course, thnx for your coment. +1. BTW Aatrox needs a little buff {{champion:266}} {{item:3070}}","replies":[{"poster":"Teslium","date":"2016-08-07T19:44:38.801+0000","up_votes":1,"down_votes":0,"body":"Rageblade procs his W bonus damage and healing twice every other AA. So you get healing or damage worth of 6 AA, in 2 AA. Rageblade also procs the % max health damage from bloodrazor twice every other AA alongside his healing.","replies":[{"poster":"Jeitsu","date":"2016-08-07T20:31:06.095+0000","up_votes":2,"down_votes":0,"body":"You are right, but the problem of the rageblade as second ittem is the time to load it, you need to hit 6 times with aa to have the op passive. BTW, in late i sell the bloodrazor to build the Rageblade :D.","replies":[{"poster":"Teslium","date":"2016-08-07T20:57:32.415+0000","up_votes":1,"down_votes":0,"body":"I never said you should build it second item, lol. It is expensive AF. Also, I think selling botrk is better because it deal % current health comaired to the 4% max health from bloodrazor. Have you considered making a guide for top lane as well?","replies":[{"poster":"Jeitsu","date":"2016-08-07T21:13:31.294+0000","up_votes":1,"down_votes":0,"body":"Ofc you are right, but remember 25 ad and 10% of lifesteal and the active, i think that botrk is better option. BTW im playing him top but im not considering to make a guide for toplane, i dont really like aatrox top. I see aatrox like a Master yi, weak early and strong late, in jungle you can farm in peace and have higher control of the objetives with your insane lifesteal.","replies":[]}]}]}]}]}]},{"poster":"macromite","date":"2016-08-07T19:06:42.350+0000","up_votes":2,"down_votes":0,"body":"A few things that I changed around with my own play is that I switched out the botrk with a death's dance and ran blue smite with berserker greaves.\n\nBloodrazor and Aa w don't work with lifesteal, but death's dance doesn't give lifesteal, it gives physical damage healing. Infact it makes it so that your w doesn't actually do damage, it just doesn't heal you. also the pure attack damage increase helps his w do more damage as well as it scales 100% off of bonus.\nIn comparison to botrk which is redundant attack speed, not a lot of pure damage, and lifesteal rather than dd heal. Aa with full bloodwell and berserks plus bloodrazor should have enough attack damage, and on hit without guinoo's is a terrible idea, and aa can't afford guinoo's in his kit, he needs too many other things first.\n \nThe spellvamp is more valuable than the damage increase on natural talent. same reason why death's dance is good.\n\nLord dominick's is a good idea though.\n\nYou don't need two points in w to take dragon at four, you only need one point, but you always need to face it at four. I have not yet tested if you can take it at three if you skip taking one of your other skills.","replies":[{"poster":"Jeitsu","date":"2016-08-07T19:31:55.493+0000","up_votes":1,"down_votes":0,"body":"The Wiki of League of Legends says that, the Lifesteal (Bloodthirster/Scimitar/Botrk/RavenousHidra) heals the impact effect fisical dmg too, that means Bloodrazor impact effect will be healed, same as combat fervor impact effect. Death's Dance heal 15% of the W (BloodPrice), infact just reduces its cost from 25% of the dmg dealt to 10% of the dmg dealt. With that build you have around 314 ad, which is enough when you need the W burst. Finally you can replace the jungler item for the Guinsoo's Rageblade, the dmg will be hard increased. \n\nThe Death's dance is an effective ittem for champions like Zed that deppends on his skills to deal dmg and all his skills deals fisical dmg. Is not the case of aatrox. Ty so much for the coment and i hope you like it :D","replies":[{"poster":"macromite","date":"2016-08-07T20:02:08.158+0000","up_votes":2,"down_votes":0,"body":"Blood razor and aa w are both special, check their individual pages\nNeither apply from lifesteal.\n\nPersonally the build I ran was DD Bt randuins Spirit, but I'm thinking of changing to DD Bt Lord dominik's Ga. a fairly pure damage build that should generate maximum power. of course running blue and berserks.\n\nAlso switching from Red to guinoos is not always a good idea. its is a shift in damage, and it would lower your capacity to survive significantly, while increasing your need to.\n\nI am also in the middle of searching for the Aatrox build.","replies":[{"poster":"Jeitsu","date":"2016-08-07T20:43:44.279+0000","up_votes":1,"down_votes":0,"body":"I know that the blood price of W is a special impact effect and it doesn't apply lifesteal, but i cant find where says that Bloodrazor Impact Effect is special and doesnt apply lifesteal. Your build is this or im wrong?:\n\n{{item:1416}} {{item:3006}} {{item:3812}} {{item:3072}} {{item:3143}} {{item:3065}} \n\nAnd you are saying to change it for:\n\n{{item:1416}} {{item:3006}} {{item:3812}} {{item:3026}} {{item:3072}} {{item:3036}} \n\nI like most the last one, if you check my calculations, Lord Dominik's is the ittem that gives more dmg to Aatrox, and that means, heal even more. Guardian Angel is really anoying item on aatrox xDDD, the problem is the hp amount, 1983 is a really low amount of hp. Thats why i keep recomending you my build:\n\n{{item:1419}} {{item:3047}} {{item:3153}} {{item:3065}} {{item:3072}} {{item:3036}} \n\nFinally changing {{item:1419}} for {{item:3124}} \n\nThe blue jungler item is better with guinsoo and red is better with Botrk, because blue is a sustitute of the botrk active. Ty for coment.","replies":[{"poster":"macromite","date":"2016-08-08T00:11:55.528+0000","up_votes":1,"down_votes":0,"body":"Just a few notes here.\n\nCheck the description of Botrks On hit passive and compare it to the description of bloodrazors passive. if you do you should notice that only one of them specifies that it applies lifesteal. every item that has an effect that applies lifesteal specifically mentions it.\n\nMy build was the first one, but I started to use teh second one after viewing your notes, figuring the Lord dominiks would increase my damage exponentially.\n\nLord dominick's also increases damage due to armor pen, lifesteal is based on actual damage dealt, not possible damage.\n\nI got the ga to make up for my lack of health, the revive without losing bloodwell in most cases should be enough for me to be able to either top myself again or deal enough damage to kill what killed me.\nIn both cases it functions in the same way that spirit functions.\nBecause I get DD instead of Botrk my build has much more healing potential than your build.\n\nSpecifically my build has only got .05% less attack speed than your build, but it has a higher amount of lifesteal, and a greater amount of base ad, which synergizes better with the third proc of his w. and instead of having some of your extraneous dueling tools it instead utilizes a ga to make it more capable of escaping a bad situation.\n\nI suppose the greates feat I have achieved with it is its capacity to out dps elder with only two fire drakes, something your build would not have been able to do at the same item level.\n\nAlso one last thing, ga is a final item, i go dd straight into bloodthirster.","replies":[]}]}]}]}]},{"poster":"Darkslayer85","date":"2016-08-07T17:54:23.715+0000","up_votes":2,"down_votes":0,"body":"I love engineers. Do Kindred next.","replies":[{"poster":"Jeitsu","date":"2016-08-07T20:45:16.359+0000","up_votes":1,"down_votes":0,"body":"Ty so much but i dont play kindred, my next guide will be to Nasus/malph/Udyr, one of those. :D","replies":[]}]},{"poster":"RogueWill","date":"2016-08-07T16:57:10.077+0000","up_votes":1,"down_votes":1,"body":"where are your graphs and charts? as a fellow Engineer is my job to doubt my source until I have proof that is reliable. I want to see numbers and not just the \"Trust me I'm an Engineer card\"","replies":[{"poster":"Jeitsu","date":"2016-08-07T16:59:29.205+0000","up_votes":1,"down_votes":1,"body":"At the end of the guide, in the items chapter i did some calculations but i didnt graphs and charts.... Im mechanical engineer from University of Las Palmas de Gran Canaria in Spain. BTW if im going to lie, i would say that im diamond and this is my smurf acc or something, its easier :D. Ty for coment, and i hope you like it.","replies":[{"poster":"RogueWill","date":"2016-08-07T17:32:15.080+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Jeitsu,realm=EUW,application-id=3ErqAdtq,discussion-id=VKORLuIh,comment-id=00020000,timestamp=2016-08-07T16:59:29.205+0000)\n>\n> At the end of the guide, in the items chapter i did some calculations but i didnt graphs and charts.... Im mechanical engineer from University of Las Palmas de Gran Canaria in Spain. BTW if im going to lie, i would say that im diamond and this is my smurf acc or something, its easier :D. Ty for coment, and i hope you like it.\n\n\"Some calculations\"? That's not good enough on terms of reliability. DId you run simulations? Did you examined every item on depth? I'm starting to think that this research had some bias at the start of it.\n\nI'm an Alumni From University of New Orleans, USA. Civil Engineer and present of data is needed to back up any result that you want to post. I'm not saying that you are lying but if your selling card is:\n\n> Engineering has led me to be an objective and critical person, since this game are nothing more than math and numbers (apart of the skill and team tactics), I'm a machine of builds, runes and masteries. I have them calculated from all angles, i have calculated from the damage that a certain combo does to how much you heal after x time for the lifesteal effect, as well as basic and comparing statistics between different items in different situations and against certain generic enemies. I love it all calculated as mathematics never betray me.<\n\nthen please present this knowledge like a true Engineer would.","replies":[{"poster":"Jeitsu","date":"2016-08-07T19:17:45.172+0000","up_votes":1,"down_votes":1,"body":"Well im not gonna do a TRUE presentation as if it would be a engineer proyect, its just a game, not all players are engineer and as i said in the guide, i was exposing the results briefly for the skeptics.\n\nThat brief show of calculation is the results or conclutions of a \"deep study\" of each item, gathering lot of information form the wiki of the game (im not gonna spend all day to write a build and study one champion), considerating the cost of the items, the performance, the dmg dealt (Even the Actives and Passives), the sustain in 1 vs 1, dmg recibed from some generic enemies, etc...\n\nIm not a student, im engineer, so dont tell me what i MUST do and how i have to do it. If you dont like it just find for another better build. As i said, this is just a game, not an engineering proyect so... i wont take any care in the presentation of this, it doenst need any kind of reliability, just a build for just a champion from just one game....","replies":[{"poster":"RogueWill","date":"2016-08-07T19:30:14.139+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Jeitsu,realm=EUW,application-id=3ErqAdtq,discussion-id=VKORLuIh,comment-id=0002000000000000,timestamp=2016-08-07T19:17:45.172+0000)\n>\n> Well im not gonna do a TRUE presentation as if it would be a engineer proyect, its just a game, not all players are engineer and as i said in the guide, i was exposing the results briefly for the skeptics.\n> \n> That brief show of calculation is the results or conclutions of a &quot;deep study&quot; of each item, gathering lot of information form the wiki of the game (im not gonna spend all day to write a build and study one champion), considerating the cost of the items, the performance, the dmg dealt (Even the Actives and Passives), the sustain in 1 vs 1, dmg recibed from some generic enemies, etc...\n> \n> Im not a student, im engineer, so dont tell me what i MUST do and how i have to do it. If you dont like it just find for another better build. As i said, this is just a game, not an engineering proyect so... i wont take any care in the presentation of this, it doenst need any kind of reliability, just a build for just a champion from just one game....\n\n\"..then ... Why are you doing this guide noob?\"","replies":[{"poster":"bleufromage","date":"2016-08-07T20:53:30.983+0000","up_votes":1,"down_votes":1,"body":"Why did you feel the need to point out that you are an engineer if it literally has nothing to do with your analysis of aatrox? It would've made more sense to say you like theory crafting because thats all you did. You drew up a theory that might work and made up some random numbers about health and armor and tied them to a generic term like \"adc 2000 hp 88 armor\". I can theory craft too and I'm an interpersonal communications major.","replies":[{"poster":"RogueWill","date":"2016-08-07T21:12:10.290+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=bleufromage,realm=NA,application-id=3ErqAdtq,discussion-id=VKORLuIh,comment-id=000200000000000000000000,timestamp=2016-08-07T20:53:30.983+0000)\n>\n> Why did you feel the need to point out that you are an engineer if it literally has nothing to do with your analysis of aatrox? It would&#x27;ve made more sense to say you like theory crafting because thats all you did. You drew up a theory that might work and made up some random numbers about health and armor and tied them to a generic term like &quot;adc 2000 hp 88 armor&quot;. I can theory craft too and I&#x27;m an interpersonal communications major.\n\nI'm not the OP...\nBut he felt the necesity to point out he was an engineer to give some credit to his build. I pointed out that without data to back up his claims, it was just fishy information. he got mad at me saying that he wouldn't spend a day analyzing him xD and that it was a build from one game. From that moment I decided that this guide was a joke xD","replies":[{"poster":"Jeitsu","date":"2016-08-08T13:38:30.463+0000","up_votes":1,"down_votes":0,"body":"Im not going to have this kind of conversation, i did this guide for free to the comunity, to learn, help and to debate it, allways there is people thankless. Its easy to criticize the other people's work.","replies":[]},{"poster":"bleufromage","date":"2016-08-07T23:31:52.386+0000","up_votes":1,"down_votes":1,"body":"sorry i meant to respond to him not you","replies":[]}]}]}]}]}]}]}]},{"poster":"420 grams","date":"2016-08-07T17:49:51.065+0000","up_votes":1,"down_votes":0,"body":"I'd recommend deaths dance over bloodthirster, and I'd do it after jungle item. \nWhy? Because life steal doesn't work on W proc or bloodrazor, so healing damage dealt is better. I'd do it second because you already built an item with 50% attack speed, so you need more damage now than more attack speed.","replies":[{"poster":"Jeitsu","date":"2016-08-07T19:05:01.745+0000","up_votes":1,"down_votes":0,"body":"Ty for coment, i have calculated that too, whitch deals more dmg Botrk or Death's Dancer? Well, is not a question of attack dmg, is a question of which ittem deals more dmg in one autoattack? the answer is impact effects: 6% of targets heal + 25 ad and 40% as is more dmg than 75 ad, in the other hand, we got an active which is great to avoid kite and scape in some situations... \n\nWe may have 50% as in the jungler ittem, but in aatrox, until 2,5 as, more as is never wasted, more as, means more W effects and more dmg, so you could have even more sustain.\n\nBloodthirster - we could ask ourself: Why a bloodthirster and not a death's dance?, the answer is simple: the lifesteal is applied to all fisical damage, included impact effects according to the wiki, ie with bloodthirster you will heal, in addition to the damage done by your auto attacks, the damage inflicted by blood razor and botrk (10% of the maximum life of the target as impact effect) and damage the fervor of combat, while the dance of death you heal that 15% of damage Q and 15% of the damage of the third W as bloody price (actually it costs the 25% of the damage dealt, don't heal you, just low the cost to 10% of the damage dealt). The R and E infringe magic damage, so won't be healed. Although it seems that bloodthirster makes you more inbursteable than death's dance, Why? the shield of the bloodthirster, 15% of the damage taken to the dance of death is fractioned yes, will recibe all, plus 5% of lifesteal is appreciated, on the other hand, the dance of death don't let you back after using the W in bloody price to farm until the bleeding effect is gone, so it will make your back 3 seconds longer.\n\nIn conclusion, Bortk and Bloodthirster are the best options to deal the maximum dmg with the same money spended.","replies":[{"poster":"420 grams","date":"2016-08-07T23:01:31.386+0000","up_votes":1,"down_votes":0,"body":"While I see your point, I still think bloodthirster or dance dance is better  because let's say you start at 1.00 attack speed, plus 50% from bloodrazor, plus 50% from full passive, and 50% from level 2 ult, you get full attack speed right there. \nAnd you have your e and q and extra ult range to help against kiting.\nFor the 6% health, it's great and all, but it's mostly effective against tanks which you should be able to put damage and out heal while fighting.","replies":[]}]}]},{"poster":"Dreadlocks","date":"2016-08-07T16:51:03.499+0000","up_votes":1,"down_votes":0,"body":"{{item:3031}} {{item:3087}} {{item:3046}} {{item:3072}} {{item:3742}} {{item:3006}}","replies":[{"poster":"Jeitsu","date":"2016-08-07T16:56:43.819+0000","up_votes":1,"down_votes":0,"body":"It seems to be an adc build, except for the dead's man plate.\n\nI hope that this build is for top but aatrox dont need that amount of attack speed and the third w doesnt do 200% of the skill dmg so the critical chance is not usefull at all, i recomend you 2 items of as: Rageblad+Botrk / Botrk + Berserker's Boots / with 2 items you can get 2.5 as using your ult.\n\nIn the other hand, Randuin's Omen have an usefull active to avoid Kite from adc with the combo Q+OmenActive. Finally the Spirit Visage is really core item. Ty for coment and i hope you like it :).","replies":[{"poster":"macromite","date":"2016-08-07T19:16:58.569+0000","up_votes":1,"down_votes":0,"body":"Critical does apply lifesteal where w doesn't","replies":[]},{"poster":"Dreadlocks","date":"2016-08-07T17:32:29.026+0000","up_votes":1,"down_votes":0,"body":"Dont knock it till you try it :) thats all im gana say.","replies":[]}]}]}]}