{"poster":"Texter Redrum","date":"2018-08-01T02:32:08.477+0000","title":"Spamear maestria","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":0,"body":"&iquest;Es antideportivo molestar al oponente con la maestria todo el tiempo?","replies":[{"poster":"Baiken","date":"2018-08-01T03:58:03.127+0000","up_votes":3,"down_votes":0,"body":"si te molesta y tiltea, te sugiero que mutees los gestos. Saludines oni chan","replies":[]},{"poster":"yOCobain","date":"2018-08-01T03:44:29.983+0000","up_votes":2,"down_votes":0,"body":"No es antideportivo ni a palos. En todo caso es un poco de rivalidad. Y demostración .  Es para presumir tu nivel de maestría con el campeón. \n\nIgualmente si sirve de algo esto...en ocasiones suele ser muy gracioso usarla. Por ejemplo cuando te está yendo super mal... O cuando hiciste una mala jugada y te mataron. Al toque pelas la m7 jajajajaj suele ser gracioso eso.\n\nPero si.por lo general uno la saca para tiltear al otro. Onda \"mira papu.  Viste como te mate? Es porque soy sshhaasuo m7 :v ownea3\"  ... No se enojen.  Sólo ganenle y pelen gestos de pulgar arriba. Son 10 veces peor xD jajajajajajaja.\n\nYo respeto mucho a mis rivales. Pero los gestos se los saco siempre. Maestría no tanto.\n\nNo se castiga este tipo de comportamientos ya que hay un botón que te permite MUTEAR los gestos del rival o aliado. Al igual que los pings..Etc. así que si te molesta mutealo y listo. Pero dale. En serio te tiltea?  U.u \n\nAbrazo!","replies":[]},{"poster":"SumbalumbA","date":"2018-08-01T03:18:48.046+0000","up_votes":2,"down_votes":0,"body":"No, sirve para tiltear y si estás preguntando esto por lo visto lo han logrado...","replies":[]},{"poster":"Midnigth Train ","date":"2018-08-04T02:28:27.162+0000","up_votes":1,"down_votes":0,"body":"En si podría tratarse de una estrategia para \"tiltear\" al rival, pero no creo que sea antideportiva ya que con un mutear gestos y maestrías se soluciona esa estrategia.","replies":[]},{"poster":"NVSRR","date":"2018-08-01T19:46:56.466+0000","up_votes":1,"down_votes":0,"body":"Nah le da un toque picante y de rivalidad a la partida jaja,igual si te molesta muteas  los gestos y santo remedio{{summoner:21}}","replies":[]},{"poster":"POETA DEL RAYO","date":"2018-08-01T14:01:11.153+0000","up_votes":1,"down_votes":0,"body":"A la primera que empieza a spamear la maestría , apretó la opción de mutear a ese rival , he ganado muchas partidas muteando el chat y los gestos de un solo rival, impide que te titees jajaja, después de la partida te das cuenta que era súper flamer y su equipo perdió prácticamente por el y su toxiqueo.","replies":[]},{"poster":"Zaeroz","date":"2018-08-01T11:05:31.056+0000","up_votes":1,"down_votes":0,"body":"No lo es pero tienes que hacer el esfuerzo en darle click en el botoncito de silenciar para jugar tranquilo. \nTe adjuntos esto para que sepas que reportar ya que muchos no saben de esto. Saludos.  \n\n[Link](https://las.leagueoflegends.com/es/game-info/get-started/summoners-code/)","replies":[]},{"poster":"zelaya19","date":"2018-08-01T06:36:00.625+0000","up_votes":1,"down_votes":0,"body":"No","replies":[]},{"poster":"SG naiko ","date":"2018-08-01T03:23:45.392+0000","up_votes":1,"down_votes":0,"body":"Me costo 2960 y 3 fragmentos para que se quejen osea pls {{sticker:darius-angry}}","replies":[]},{"poster":"Wuachonazooo","date":"2018-08-01T03:22:07.711+0000","up_votes":1,"down_votes":0,"body":"Para mi no es antideportivo, es mas de quien la tiene mas grande {{sticker:sg-syndra}}","replies":[]},{"poster":"Yitán","date":"2018-08-01T02:55:43.997+0000","up_votes":1,"down_votes":0,"body":"no creo, por algo riot puso un tiempo de spameo tan reducido","replies":[]},{"poster":"Nôll","date":"2018-08-01T02:48:52.786+0000","up_votes":1,"down_votes":0,"body":"Podés reportarlo como \"Actitud negativa\" pero no creo que lleguen a banear una cuenta por eso :S","replies":[]},{"poster":"ZanahoriaAsesina","date":"2018-08-01T03:08:14.451+0000","up_votes":1,"down_votes":1,"body":"Nope, no se castiga.","replies":[]}]}