{"poster":"Snowman Arc","date":"2017-02-15T17:25:54.566+0000","title":"For the last time, elo hell doesn't exist.","subforum":"Gameplay","up_votes":6,"down_votes":22,"body":"Seriously, I can&#039;t stand the amount of &quot;ah noes, I was 100/0 as Zed but my team were monkeys&quot; threads. Elo hell does not exist. If you are good enough, you will eventually climb. What do you say to all those players who smurf in bronze and easily carry games and climb? What do you say to all those boosting sites that you pay to climb?\r\n\r\nI ended in Gold 2 in S6 and I played on my bronze 4 smurf. It&#039;s already 1 win away from silver 5 and I did that in like a week of not really playing a lot anyway. Oh, and I did it with the most basic rune pages, not anything fancy, basically rune pages that everyone can get their hands on. I even had the occasional game that couldn&#039;t be won, but some games that were seemingly &quot;open mid&quot; from 6 minutes I managed to win by applying pressure. I had games that my bottom lane went 3/30 and we still won at 25 minutes.\r\n\r\nIf you are good enough, you will climb. Sure, there are games that just cannot be won no matter how good you are, but most games can be won, even if you have to 1v9. If you play enough games and think you deserve better, you will climb. And I&#039;m not saying that you, let&#039;s say, started the season at silver 5 and after 100 games you are still in silver 2. No, no, that might be just some bad luck with some uncarriable games, I&#039;m talking about the people who play 1000 ranked games and range between 3 divisions, like silver 5 - silver 2 and think that their team is holding them back. No, if you&#039;re good, you will climb. With maybe a bit more games to counter out the unlucky games, eventually you climb. If you don&#039;t, then you probably don&#039;t deserve it.","replies":[{"poster":"420 grams","date":"2017-02-15T17:41:30.153+0000","up_votes":12,"down_votes":0,"body":"Wow, the gold smurf can win bronze games. Who would've thought? You must be a God.","replies":[{"poster":"Snowman Arc","date":"2017-02-15T19:56:52.703+0000","up_votes":1,"down_votes":1,"body":"Yeah, well instead of being sarcastic, you would understand that some guy stuck in bronze could easily climb if they were better than bronze, like silver or gold.","replies":[]}]},{"poster":"Spartan Sol","date":"2017-02-15T20:16:20.704+0000","up_votes":3,"down_votes":0,"body":"elo hell isnt about your own skill level. elo hell is more about luck more then anything. if your on a bad luck streak * as i am on now * you get several games in a row where your teammates just arent up to par compared to you or the other team. given some games even the best players lose such as the ex pro who lost in silver or when faker went 0-6 in a bronze game lol.. and yes that happened i was watching the stream lol. its all about luck in silver. bronze is easy gold-plat are pretty easy cus skill level evens out. silver is just a shit show of people who are either plat+ skilled or bronze skilled all clumped into the same game.","replies":[{"poster":"Snowman Arc","date":"2017-02-16T18:42:28.956+0000","up_votes":1,"down_votes":0,"body":"Well, I understand that you need luck on your side, but eventually it evens out and the personal skill you have will show. \nThat said, you are hard stuck in silver because of your own skill, not some luck-based matchmaking. I see you have played like 30 different champions in ranked, which my friend isn't a good way to climb.","replies":[{"poster":"Spartan Sol","date":"2017-02-16T19:34:26.311+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Snowman Arc,realm=EUNE,application-id=3ErqAdtq,discussion-id=brB0tYsN,comment-id=00060000,timestamp=2017-02-16T18:42:28.956+0000)\n>\n> Well, I understand that you need luck on your side, but eventually it evens out and the personal skill you have will show. \n> That said, you are hard stuck in silver because of your own skill, not some luck-based matchmaking. I see you have played like 30 different champions in ranked, which my friend isn&#x27;t a good way to climb.\n\nyour welcome to check my match history and you can easily see aside from maybe 5 out of 20 games my kda kill participation cs obj taken are significantly higher than the rest in my game.. and ive played 30 different champions because i was playing fill for awhile. i usually stick to about 3 in each role that im super confident with and can carry with. but when im 9-4 and my team is 0-4 0-8 3-10 and 4-12.. kinda hard to carry against that. the very last game i played i had a goodluck team. all 5 of us easily carried and meshed well together. the game im about to play in a little  bit could be completly the opposite and ill have an afk mid and a troll support. silver is based around complete luck not skill level. ive climbed thru gold and plat easily but silver is the death of me lol.","replies":[]}]}]},{"poster":"ValyrianBlade","date":"2017-02-15T20:27:20.528+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Snowman Arc,realm=EUNE,application-id=3ErqAdtq,discussion-id=brB0tYsN,comment-id=,timestamp=2017-02-15T17:25:54.566+0000)\n>\n> Seriously, I can&amp;#039;t stand the amount of &amp;quot;ah noes, I was 100/0 as Zed but my team were monkeys&amp;quot; threads. Elo hell does not exist. If you are good enough, you will eventually climb. What do you say to all those players who smurf in bronze and easily carry games and climb? What do you say to all those boosting sites that you pay to climb?\n> \n> I ended in Gold 2 in S6 and I played on my bronze 4 smurf. It&amp;#039;s already 1 win away from silver 5 and I did that in like a week of not really playing a lot anyway. Oh, and I did it with the most basic rune pages, not anything fancy, basically rune pages that everyone can get their hands on. I even had the occasional game that couldn&amp;#039;t be won, but some games that were seemingly &amp;quot;open mid&amp;quot; from 6 minutes I managed to win by applying pressure. I had games that my bottom lane went 3/30 and we still won at 25 minutes.\n> \n> If you are good enough, you will climb. Sure, there are games that just cannot be won no matter how good you are, but most games can be won, even if you have to 1v9. If you play enough games and think you deserve better, you will climb. And I&amp;#039;m not saying that you, let&amp;#039;s say, started the season at silver 5 and after 100 games you are still in silver 2. No, no, that might be just some bad luck with some uncarriable games, I&amp;#039;m talking about the people who play 1000 ranked games and range between 3 divisions, like silver 5 - silver 2 and think that their team is holding them back. No, if you&amp;#039;re good, you will climb. With maybe a bit more games to counter out the unlucky games, eventually you climb. If you don&amp;#039;t, then you probably don&amp;#039;t deserve it.\n\nAnd yet i think this is exactly the problem. \n\nYou need like 1000 games to reliably climb. And even then you won't necessarily be at the rank you are as good as,  just within a reasonable range of it. \n\nTo put this in perspective:\nI have a full time job,  minimum 40h/wk of work,  sometimes 50.\nMy job has continuing education requirements,  some weeks in studying up to 20 hours. I think 5 hours per week on average is a reasonable estimate though. \nI sleep - obviously. \nI have a girlfriend and friends,  which obviously leads to social requirements. \nI'm relatively healthy/fit because i play sports,  which obviously takes time. \n\nBy the time everything is said and done,  there are periods where i can play 8 games in a weekend / 12 games in a week and make some progress,  and there are times I'm lucky to play 3-4 games in a week. Even at my best rate (12/wk) all year I'm only looking at 600 games though. Maybe i play more than 12/wk sometimes,  i don't really count. \n\nWhat I'm saying though,  is i have a life (although not a crazy active one) and even if i allocate almost all of my spare time ONLY to league I'm not going to play 1000 games in a season,  likely not even 2. It shouldn't take 3+ seasons  AFTER I've gotten to 30 to get to the rank i already belonged at so i can start improving by playing at that level. \n\nThen throw in that even when it doesn't take that long (swapped to mid main and went on 80% win rate from bronze 1 to silver 2 in flex) my mmr explodes so fast that I'm playing with platinum players trying to just get to gold 5. I've played 3 seasons of ranked,  plenty of normals,  and no matter what i play every season my opponents average rank starts in gold and rises to mid-plat (and in normals without the reset i play with 1-2 diamonds every game and occasionally master /challenger players). Yet I've never ranked higher than gold 5. So I've played with mid plats in ranked for 2.5 seasons  (albeit only 150 ranked games in my first 2 ranked seasons) and diamonds in normals and I've never ranked above the bottom of gold. \n\nNo,  there isn't elo hell. \nThere's just a horrible system that makes it look pretty depressing. You shouldn't have to devote your life to a game to be recognized as your current skill level in it.","replies":[{"poster":"Snowman Arc","date":"2017-02-15T21:52:56.368+0000","up_votes":1,"down_votes":0,"body":"Well, I think the problem here is that PvP games are like that. You play versus other players, and therefore someone will be better than the other, which means that one will win and one will lose. Some of these defeats are so tilting, leading you to not enjoy the game. That's the real problem,not enjoying the few hours you spend on the game, not some elo hell.","replies":[{"poster":"ValyrianBlade","date":"2017-02-15T22:24:56.972+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Snowman Arc,realm=EUNE,application-id=3ErqAdtq,discussion-id=brB0tYsN,comment-id=00080000,timestamp=2017-02-15T21:52:56.368+0000)\n>\n> Well, I think the problem here is that PvP games are like that. You play versus other players, and therefore someone will be better than the other, which means that one will win and one will lose. Some of these defeats are so tilting, leading you to not enjoy the game. That&#x27;s the real problem,not enjoying the few hours you spend on the game, not some elo hell.\n\nIt's a fair point - when I know I'm only going to have time to play 1 game I lose that game more often than not. Likely because once something goes wrong I try to make up for it too aggressively and end up putting my team farther behind (sometimes... I've gotten better at it). Then those games are really depressing because it's like \"seriously I only had time to play 1 game today and I know I won't be able to play tomorrow and THIS is the game I get??\". \n\nAlthough I don't think it's the problem I'm identifying. As much as those days of league suck, they're completely separate from the issue of being ranked gold 5 at the end of last season, beating plat 3 players in lane consistently but being unable to carry my plat 5 allies who lost their lanes to plat 5 opponents. How does a gold 5 being unable to carry plat 5s feeding other plat 5s while laning against a plat 3 himself mean I wasn't good enough to climb? Most plat 1 players would struggle in that position. \n\nSo I knew I was in a position where I pretty much just had to lose 2/3 of my games for a while to get to an elo I could carry at again (e.g. around gold 2) so I could start climbing from gold 5. Except I didn't trust Riot to not demote me from losses so I just stopped playing ranked for the season at that point (I mean, it sounds silly thinking I may get demoted when I'm gaining 26-27 LP per win and losing 12-14LP per loss, but Riot doesn't do a decent job at all of making it clear when you may get demoted).","replies":[{"poster":"Snowman Arc","date":"2017-02-16T18:35:00.074+0000","up_votes":1,"down_votes":0,"body":"Well, I agree that the ranking system if problematic. It doesn't reward players for being good, it rewards them for winning the game any way possible, and that's the problem. Sure, being good means you're probably gonna win more games, but there's no guarantee for it, and that's what I don't like. Someone can be lucky and have an AFKer in the enemy team or get all the smurfs and win, even though they don't deserve it, they will still climb. I hear you.","replies":[]}]}]}]},{"poster":"Kaioko","date":"2017-02-15T20:19:31.070+0000","up_votes":2,"down_votes":0,"body":"It's funny though when people rank up and realize that difference in skill level between teams isn't any different at silver, gold, plat and diamond (I can't speak for above diamond haven't been there).","replies":[]},{"poster":"Toxic Memes","date":"2017-02-15T18:31:09.571+0000","up_votes":2,"down_votes":0,"body":"I don't think that you quite understand what elo hell is supposed to be...","replies":[{"poster":"Snowman Arc","date":"2017-02-15T19:55:48.425+0000","up_votes":1,"down_votes":1,"body":"Mind explaining?","replies":[{"poster":"Mecha MaIphite","date":"2017-02-15T20:05:56.305+0000","up_votes":2,"down_votes":0,"body":"Elo hell is just when it's harder to climb because the skill of your team is going to be inconsistent. Obviously, you will climb if you are better, but it's still possible to get unlucky with your teams, so it can take longer.\n\nSome people who belong in their elo use it as an excuse for why they can't climb, and they're obviously wrong. But that doesn't mean it's not a thing.","replies":[{"poster":"Snowman Arc","date":"2017-02-16T00:43:33.418+0000","up_votes":1,"down_votes":0,"body":"Well, I generally meant the \"fake elo hell\" that people use as an excuse that they can't climb. People who know they are better are also in some elo hell games, but they don't bitch about it, because they know they are better and climbing.","replies":[]}]}]}]},{"poster":"Stick In Mudd","date":"2017-02-15T18:40:02.436+0000","up_votes":2,"down_votes":0,"body":"Hey, Iwilldominate lost a silver game from a scripter. \n\nYes, an ex-pro player in challenger lost a silver game, because of a scripter. \n\nThat's all I got.","replies":[{"poster":"Snowman Arc","date":"2017-02-15T19:00:18.620+0000","up_votes":1,"down_votes":1,"body":"Of course he will. Not all games can be won, because sometimes the enemies get too far ahead before you can do anything to turn it around, and any sort of decency from the enemies will not allow you to. But low elo games are not like this.","replies":[]}]},{"poster":"Oleandervine","date":"2017-02-16T00:54:19.924+0000","up_votes":1,"down_votes":0,"body":"ELO hell exists. Here's why. \nYou have two people, a smurf and a brand new player. \nThe smurf finishes his placements, gets a decently high MMR from it, and places in, let's say Silver 5. \nThe new player finishes his placements. He lost 7/10 games, and since he didn't do so well, he gets placed in Bronze 5 with low MMR.\nWith time, the smurf with the high MMR will move out of Silver, because his MMR allows the quality of his teammates to be much better than average. \nThe new player can barely move to Bronze 4, because due to his poor starting MMR, he's placed with low performing players, and this causes him to have consistent defeats, further damaging his already bad MMR. \nThe new player is in ELO hell, because the quality of the players he is placed with is below average, and his odds of winning are rare, causing a cyclical degrade in his MMR, as even a small victory streak can get reversed by a few losses.\nThat is why Smurfs don't suffer ELO hell.","replies":[{"poster":"Snowman Arc","date":"2017-02-16T18:39:26.177+0000","up_votes":1,"down_votes":0,"body":"No. That's not it. The guy placed in silver 5 being a smurf will climb because he is way better and is able to carry that game. The guy placed in bronze 5 is probably a bad player who deserves to be there, BUT if he thinks he is better and deserves silver or gold, then he should climb no matter what teammates he gets, because he will also get equally bad teammates.\n\nThe teams, barring first-time smurfs, are generally balanced, or I hope so. Therefore, a guy that can't climb from bronze 5 has no right to blame the team, because the enemy is just as bad as his own team. If he's good, he will carry.\n\nAlso, the smurf silver guy having MMR and being matched with good teammates, guess what, he is also matched with equally as tough opponents, which means that he is gonna have a harder time. ","replies":[]}]},{"poster":"OneTrickZilian","date":"2017-02-15T17:48:16.023+0000","up_votes":1,"down_votes":0,"body":"Being good enough and caring out yourself means you aren't ELO HELL. \nExplain me how a player is not ELO HELL when he picks Sejuani for top lane vs Garen, dies  before lvl 3 and then goes afk? Or EKKO goes mid, dies twice at lvl 1 and goes afk too ? These were only 2 examples from my games in the last two days. I have multiple examples of elo hell players who have no map awareness, no sense of objectives, YOLO players. \n\nSome players might have map awareness, maybe are good for objectives but have unrefined mechnics, in other words - yes they missing something in their overall good game play. Those players usually being held by complete noobs aka ELO HELL who have non of understanding. Unless advancing players improves their game play by the whole league, not division, they will be held by ELO HELL.","replies":[{"poster":"Snowman Arc","date":"2017-02-15T18:59:11.593+0000","up_votes":1,"down_votes":0,"body":"Yeah, games like these happen, I've been in some of them and they can't be salvaged. But they don't happen all the time, and they are not always on your team. Sometimes, you get a defeat because of a troll on your team, sometimes you get a free win because of the enemy troll, like I did a couple of days ago. Eventually, you climb.","replies":[]}]},{"poster":"Randomonium","date":"2017-02-15T20:12:41.248+0000","up_votes":1,"down_votes":1,"body":"Not sure why you're getting downvoted. People seem to think if they don't win every game where they're ahead that elo hell exists. Fact of the matter is 40% of the time you're going to win even if you play like crap and 40% of the time you're going to lose even if you play well. What determines whether or not you climb is that last 20% where the game is really close. Win more than half of those games and you'll have over a 50% win rate and you'll climb.","replies":[]},{"poster":"GigglesO","date":"2017-02-15T18:36:01.248+0000","up_votes":1,"down_votes":2,"body":"That is actually false, its plat. You have:\nBoosted\nSmurfs\nDiamonds without the tag\nAttitude problems\nVery small population of players forcing uneven matches","replies":[]}]}