{"poster":"InSingedWeTrust","date":"2016-05-07T00:47:49.250+0000","title":"So now that Distortion enchant is gone can we buff Ghost?","subforum":"Gameplay","up_votes":195,"down_votes":4,"body":"So that it&#039;s not entirely useless?\n\nEDIT : We did it bois!\n\nGhost\nCooldown lowered to 180 seconds from 210 seconds.\nMovement speed now scales up with level - now [28% at level one up to 45% at level 18] from 27%.\n\"Your champion can move through units and has 28-45% (depending on champion level) increased Movement Speed for 10 seconds.\"","replies":[{"poster":"redniwediS","date":"2016-05-07T00:49:01.288+0000","up_votes":15,"down_votes":2,"body":"It's not that ghost is useless, it's just that it's completely outclassed right now.","replies":[{"poster":"InSingedWeTrust","date":"2016-05-07T00:51:05.746+0000","up_votes":26,"down_votes":1,"body":"> [{quoted}](name=redniwediS,realm=NA,application-id=3ErqAdtq,discussion-id=bsVEHAnL,comment-id=0000,timestamp=2016-05-07T00:49:01.288+0000)\n>\n> It&#x27;s not that ghost is useless, it&#x27;s just that it&#x27;s completely outclassed right now.\n\nThat too, but they'll never give flash a meaningful nerf.","replies":[{"poster":"Kallian","date":"2016-05-07T00:57:10.884+0000","up_votes":1,"down_votes":25,"body":"flash is 10/10 no nerf needed, ghost however, is eh. i use it with ashe for the boost when i need it, but its useless with anyone else","replies":[{"poster":"IcyPepper","date":"2016-05-07T01:28:46.108+0000","up_votes":36,"down_votes":0,"body":">flash is 10/10\n\nOn average, yes. Most players in most games take it. Ten out of ten players.","replies":[{"poster":"63536895_DEL","date":"2016-05-07T12:24:11.007+0000","up_votes":9,"down_votes":0,"body":"And then there's that one critic that's never impressed and gave it a 9 {{champion:35}}","replies":[{"poster":"IcyPepper","date":"2016-05-07T21:19:14.403+0000","up_votes":5,"down_votes":0,"body":"He always flames instead {{summoner:14}}","replies":[]}]},{"poster":"Mistress Madoka","date":"2016-05-07T20:48:35.286+0000","up_votes":1,"down_votes":0,"body":"I don't take it all the time.\n\n\nImean, sometimes I'll not take it and Regret it, but Usually if I didn't take it, it's because I'm Teemo or Garen. Tele-ignite","replies":[]}]},{"poster":"Lady Hammerlock","date":"2016-05-07T08:10:13.777+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=R3d M0u53,realm=NA,application-id=3ErqAdtq,discussion-id=bsVEHAnL,comment-id=000000000000,timestamp=2016-05-07T00:57:10.884+0000)\n>\n> flash is 10/10 no nerf needed, ghost however, is eh. i use it with ashe for the boost when i need it, but its useless with anyone else\n\nhello?are you kidding?\n{{champion:27}} {{champion:75}} {{champion:8}} {{champion:4}} {{champion:112}} can use that summoner spell very well","replies":[{"poster":"ChaoticPinecone","date":"2016-05-07T16:31:28.593+0000","up_votes":2,"down_votes":0,"body":"But its not about \"can use that summoner spell\". Every champion can use every summoner spell very well, and each is very useful. Its all about what is most optimal. While ghost can be used by every champion, taking Flash+(something else) is generally more optimal. \n\nI would be wary of not running Flash on at least TF, Vlad, and Viktor. If anything Id rush Flash-Ghost. Nasus generally needs flash too.","replies":[]},{"poster":"Ärtorias","date":"2016-05-07T16:00:28.762+0000","up_votes":1,"down_votes":0,"body":"I prefer flash on nasus cause stormraiders is really good on nasus","replies":[{"poster":"Festive Bear","date":"2016-05-07T21:25:44.432+0000","up_votes":1,"down_votes":0,"body":"I've played a fair bit of Nasus, and I prefer ghost really because it helps a lot during teamfights and/or getting away. You can use it when chasing people down or when you just need mobility to outplay. Flash is ok, but you can only make a quick play ever 5 minutes so it's good for people that need escapes, but for people that are prone to kiting you can end up over using it","replies":[]}]}]},{"poster":"Troll for Trump","date":"2016-05-07T01:48:24.279+0000","up_votes":1,"down_votes":0,"body":"{{champion:120}} {{champion:23}} {{champion:19}} all use it; Of which it's probably mandatory on Hec, and optimal on WW. Trynd is up to preference. It CAN be used on Nasus if you want; Preference.\n\nPlayers from the Chinese server also use ghost sometimes for their own cheese builds (Ghost+Flash TF)","replies":[{"poster":"Pierce The Veal","date":"2016-05-07T06:59:23.676+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=VulDread,realm=NA,application-id=3ErqAdtq,discussion-id=bsVEHAnL,comment-id=0000000000000001,timestamp=2016-05-07T01:48:24.279+0000)\n>\n> {{champion:120}} {{champion:23}} {{champion:19}} all use it; Of which it&#x27;s probably mandatory on Hec, and optimal on WW. Trynd is up to preference. It CAN be used on Nasus if you want; Preference.\n> \n> Players from the Chinese server also use ghost sometimes for their own cheese builds (Ghost+Flash TF)\n\nhttp://champion.gg/champion/Hecarim\nhttp://champion.gg/champion/Warwick","replies":[{"poster":"Troll for Trump","date":"2016-05-07T08:24:39.817+0000","up_votes":1,"down_votes":0,"body":"Yeah.. I looked it up..\n\nalso noticed that none of the champs use ghost at all...","replies":[{"poster":"Pierce The Veal","date":"2016-05-08T19:33:58.890+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=VulDread,realm=NA,application-id=3ErqAdtq,discussion-id=bsVEHAnL,comment-id=000000000000000100010000,timestamp=2016-05-07T08:24:39.817+0000)\n>\n> Yeah.. I looked it up..\n> \n> also noticed that none of the champs use ghost at all...\n\nPretty much only Tryndamere, Trundle, Olaf, and occasionally Singedever get it, because it's just to shit to justify getting it over flash. It'll take you much longer to run slightly faster around that one wall you want to cross rather than just flashing over.","replies":[]},{"poster":"Gora T","date":"2016-05-07T21:07:33.236+0000","up_votes":1,"down_votes":0,"body":"Heca looks like he gets highest winrate with ghost :o","replies":[]}]}]}]}]},{"poster":"HadesBlades","date":"2016-05-07T20:44:05.687+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MakeSingedGreat,realm=NA,application-id=3ErqAdtq,discussion-id=bsVEHAnL,comment-id=00000000,timestamp=2016-05-07T00:51:05.746+0000)\n>\n> That too, but they&#x27;ll never give flash a meaningful nerf.\n\nBecause flash is balanced around all champion, and there is no way to nerf it more then it already is due to the fact that is a universal +1 for all champions. They've already stated that they like to base all champions around it for design and balancing reason.","replies":[{"poster":"Bolwinkel","date":"2016-05-07T20:57:49.984+0000","up_votes":1,"down_votes":0,"body":"I like your name","replies":[]}]},{"poster":"MunchCrunchLunch","date":"2016-05-07T02:19:27.423+0000","up_votes":4,"down_votes":3,"body":"flash is a reset button. if a pro play fucks up they can reset and make some big play with flash #LC$BIGPLAYS","replies":[]},{"poster":"Captain Astora","date":"2016-05-08T01:21:39.112+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MakeSingedGreat,realm=NA,application-id=3ErqAdtq,discussion-id=bsVEHAnL,comment-id=00000000,timestamp=2016-05-07T00:51:05.746+0000)\n>\n> That too, but they&#x27;ll never give flash a meaningful nerf.\n\nThey swore if they couldn't fix it they would remove it.....they promise a lot of things.","replies":[]},{"poster":"rtbf225618241","date":"2016-05-07T15:49:41.831+0000","up_votes":1,"down_votes":0,"body":"Ok, why would Flash need a nerf? It's on a 5 minute cooldown and they already halved the range in Season 4.","replies":[{"poster":"rtbf22147970","date":"2016-05-07T16:16:05.590+0000","up_votes":1,"down_votes":0,"body":"Kids think if something is must pick then it needs a nerf but I disagree. Flash makes league exciting and maybe should be given to everyone automatically like recall. This way you could pick two other strategic sums","replies":[]}]}]},{"poster":"junglerboy16","date":"2016-05-07T13:54:31.337+0000","up_votes":3,"down_votes":2,"body":"That basically means it's useless. If something is outclassed to the point where you can't find a situation where it is worth using, it is by definition useless.","replies":[{"poster":"redniwediS","date":"2016-05-07T17:27:14.870+0000","up_votes":2,"down_votes":1,"body":"Not really.  Ghost has many qualities that are useful to a variety of champions.  It even shows up from time to time in professional play when teleport or ignite are less optimal for the given situation.\n\nIf Ghost was useless there would be few to no qualities that are useful to anyone.  Just because something is comparatively worse than other options doesn't mean it has no uses, which is what useless means.","replies":[{"poster":"junglerboy16","date":"2016-05-07T20:11:53.619+0000","up_votes":3,"down_votes":1,"body":"I'm not arguing the strengths and weaknesses of Ghost itself, I'm simply pointing out that you can't say something is totally outclassed but not useless. If it had a use it wouldn't be outclassed. You can have one or the other, not both.\n\nAlso, something can be forced into uselessness by the fact that you have a large pool of options and a small set of selected spells. Having a use case (i.e. need for mobility) does not equate to being *useful*. Having ghost will always be better than not having ghost, there is no argument there. However, having ghost instead of Flash is not better than having flash instead of ghost. As long as something else does what ghost does better, it won't have a true place in league.","replies":[{"poster":"redniwediS","date":"2016-05-07T20:23:55.538+0000","up_votes":1,"down_votes":1,"body":"Yes I actually can say something is useful while also being completely outclassed.  To say it is useless is to say it has no uses.  It can be weak, unviable, and all sorts of bad, but so long as it has some niche usefulness it is not useless.\n\nPlease keep in mind the times it has seen professional play, as I already attempted to point out to you, it has replaced Teleport and Ignite.  It was used alongside Flash.  Flash completely outclasses every other summoner spell, so comparing anything to it is honestly a bad idea.  That is why I didn't compare the two.  Compared to Teleport and Ignite there are clear situations where Ghost is the superior option.","replies":[{"poster":"junglerboy16","date":"2016-05-07T20:34:23.222+0000","up_votes":2,"down_votes":1,"body":"you didn't really read my post very thoroughly. We aren't talking about ghost having a use case or having been useful in the past, we are talking about right now, this patch after distortion has been removed. As it stands right now, Ghost is useless *and* outclassed.","replies":[]}]}]}]}]},{"poster":"Pierce The Veal","date":"2016-05-08T19:39:48.453+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=redniwediS,realm=NA,application-id=3ErqAdtq,discussion-id=bsVEHAnL,comment-id=0000,timestamp=2016-05-07T00:49:01.288+0000)\n>\n> It&#x27;s not that ghost is useless, it&#x27;s just that it&#x27;s completely outclassed right now.\n\nGhost now allows you to pass through walls for the first 1-3 seconds.\n\nIs it still outclassed by flash?","replies":[]}]},{"poster":"MunchCrunchLunch","date":"2016-05-07T01:28:20.309+0000","up_votes":29,"down_votes":2,"body":"its impossible to use ghost without distortion. its utter trash. give it some slow resist. 35% movement speed plus 50% slow resist.","replies":[{"poster":"My eeeeel","date":"2016-05-07T02:11:46.230+0000","up_votes":5,"down_votes":0,"body":"Yeah,, remember season 1 when we took mastery that makes ghost 52%, or after that seasons before distortion when they kept it at 40% ish","replies":[]},{"poster":"cocacolalips","date":"2016-05-07T08:16:45.811+0000","up_votes":3,"down_votes":11,"body":"50% not enough, give it 100% crowd control immunity, it's on 3 minute CD anyway, why not? Then we can talk.","replies":[{"poster":"junglerboy16","date":"2016-05-07T13:53:36.137+0000","up_votes":3,"down_votes":1,"body":"Maybe 75%, but we don't need everyone to have a free olaf ult to choose for a summoner.","replies":[{"poster":"cocacolalips","date":"2016-05-08T01:20:46.992+0000","up_votes":1,"down_votes":1,"body":"Dota has BKB, an item that grants spell immunity for x seconds, I don't see what's the big deal.\n\nMelees are unusable at high level plays because games are decided on teamfights and melee champions cant teamfight at all due to their inability to position themselves and navigate around the battlefield, fault to the omnipresent clusterfck of crowd control.","replies":[{"poster":"NineTailedMystic","date":"2016-05-08T15:54:00.076+0000","up_votes":3,"down_votes":0,"body":"Because Dota is a different game, balanced in different ways.","replies":[]}]}]}]}]},{"poster":"forresto","date":"2016-05-07T05:08:57.120+0000","up_votes":9,"down_votes":2,"body":"I think the problem is that the nature of flash just outclasses the nature of ghost, while simultaneously occupying the same strategic niche. \n\nghost needs to be activated with premeditation, and doesn't allow for the kind of emergency escape plays that flash does. it is, inherently, a spell about long-term strategic positioning. \n\nflash on the other hand allows for much more strategic play, and utility with stuff like jumping over walls, or dodging critical skillshots. This isn't a question of balance, but one of design.\n\nIf you were to buff ghost enough to make it valid in general play, it would be abused by certain edge case champions who could benefit from the bonus movespeed, and it would just feel unbalanced.","replies":[{"poster":"Sum Wun Speshal","date":"2016-05-07T12:34:58.083+0000","up_votes":5,"down_votes":0,"body":"I had to scroll pretty far to find the first reasonable explanation.","replies":[]},{"poster":"Sire Hippington","date":"2016-05-08T14:50:08.659+0000","up_votes":1,"down_votes":0,"body":"They don't fully occupy the same niche. Yes, they both give mobillity, but in very different ways, just how Yis ult and Zeds ult are very different in how they give mobillity.\n\nGhost is(or was-,-) pretty undervalued on champs with extendet fighting patterns, which mostly is tanky dps and battlemages. Champs that don't want to get in range once, but stick there, as well as champs that can afford to take some beating so they don't have to get out of dangerzone(especially cc range) immediately but can survive through the first burst/cc and then run away.\nI used ghost alot on juggernauts and bruisers top, and it always felt worth it - mostly because with boots of lucidity+distortion, both ghost and tp got a really low cd for summoners and ghost actually delivered. I often got kills early cause i could close the gap with ghost, burn a flash **and still have ghost running to catch up once more**, cause ghost covers far more ground total tha flash(unless theres a wall nearby, and the shorter cd than flash also is a big plus.\n\nWithout distortion however, neither the boost it gives nor the cd are enough to justify it over flash.\nIf they would reduce the cd or up the ms to 30% over either a longer duration or with 30-50% slow reduction, it would be worth takeing once more. But as it is, it was fully dependent on distortion to really keep up with flash on those that synergized with with it.\n\nThe aim shuldn't be to make ghost balanced for all, but atleast a solid option for those that synergize with it, and that simply isn't the case right now with istortion gone.","replies":[]},{"poster":"Penta Penguin","date":"2016-05-07T16:22:21.097+0000","up_votes":1,"down_votes":0,"body":"Flash is more useful although I think Ghost still has it's niche in letting you travel further, faster. Like sometimes you can't get on someone / away from someone even with Flash. Pressing a button to become Udyr for 10 seconds is pretty strong still.","replies":[{"poster":"forresto","date":"2016-05-07T23:26:05.773+0000","up_votes":1,"down_votes":0,"body":"oh I definitely agree. I mean I almost always take ghost on nasus, or singed for instance. the main problem is that ghost is a situational spell, while flash is a general use spell. going into a game, you have to know that you want ghost, why you want ghost, and when to use ghost, while flash is always good to have on any champ. \n\nthe other problem is you have to be extremely tanky in most situations to use ghost as a means of escape, whereas flash will get you out of pretty much any situation for at least a second or 2.\n\nOverall I would say ghost is inherently an offensive tank/bruiser spell since it's much easier to make the right decision of when to use it when you're on offense rather than on defense.","replies":[]}]}]},{"poster":"Nilok","date":"2016-05-07T03:31:03.966+0000","up_votes":5,"down_votes":0,"body":"Yes please\n{{champion:27}}","replies":[]},{"poster":"junglerboy16","date":"2016-05-07T20:22:12.858+0000","up_votes":6,"down_votes":2,"body":"Instead of buffing Ghost, we should combine Ghost and Cleanse into a single new summoner. Everyone has been begging for slow resist on Ghost for ages, Ghost has too much strategic and mechanical overlap with Flash, and Cleanse is too niche right now for regular use.\n\nIf we combined them into a single more useful summoner, (e.g. something like \"Removes all disables and summoner spell debuffs from your champion, granting them 30% movespeed and unit walking for 6 seconds while reducing the duration of all incoming disables by 50%.\") then it has a clear niche but is still general enough to be used in more creative ways than \"wait for Nautilus to stun lock me.\" Doing this to both abilities consolidates two normally rare summoners into a distinct ability that can be utilized healthily by a broader selection of champions in a variety of new distinct ways.","replies":[]},{"poster":"Bearricane","date":"2016-05-08T02:07:15.704+0000","up_votes":3,"down_votes":0,"body":"The only way to balance flash is to outright remove it. \n\nThe game becomes 10000% healthier when you remove the spell with 100% pick rate and balance champions around their actual mobility rather than their average mobility except once every 300 seconds.\n\nUnfortunately #BigPlays is a lot more satisfying than someone who actually positions and micros their movements well.","replies":[]},{"poster":"Evewynn","date":"2016-05-07T01:26:33.720+0000","up_votes":2,"down_votes":20,"body":"they should make it so that flash doesn't work in combat. I think that would be appropriate for a nerf, though ghost may still need a small buff.","replies":[{"poster":"World Ender","date":"2016-05-07T01:31:07.804+0000","up_votes":4,"down_votes":1,"body":"That would utterly gut flash and make it probably the worst summoner spell in the game...","replies":[{"poster":"kile147","date":"2016-05-07T01:53:24.559+0000","up_votes":3,"down_votes":0,"body":"I mean Riot has stated that one reason they can't change it because some champs (Annie/Galio) are balanced around using it as a initiator. If this rocket belt item doesn't work then this could be a way to meaningfully nerf flash while keeping it a functional initiation tool. I agree this would hit it super hard but if combined with other changes it could be a promising direction to go.\n\nEdit: Other changes being compensation buffs","replies":[{"poster":"Sum Wun Speshal","date":"2016-05-07T12:15:32.528+0000","up_votes":1,"down_votes":0,"body":"Protobelt is nothing compared to the utility of flash. It's not even close. A lot of people were worried in the beginning when they saw an item could give you a dash, but that's all it is. A short range dash. \n\nIt has a projectile speed instead of being an instantaneous blink, the range is as short as a vayne tumble and it doesn't go over walls. \n\nThere is no way it will replace Flash.\n\nThat being said, I don't think this tweak suggestion will leave Flash capable of competing with any other Summoner Spell. I'd rather see the offensive options of flash usage nerfed instead of the defensive ones and even that is probably not a good idea. \n\nIMO as long as everybody is fine with using Flash, there is no problem with it being stronger than others. The game has been that way since forever and changing how Flash as a Summoner Spell works would drastically change the meta, infuriate the players that are already infuriated anyway and force a change whose purpose is barely justified and most likely unnecessary.","replies":[{"poster":"rtbf22147970","date":"2016-05-07T16:11:31.457+0000","up_votes":1,"down_votes":0,"body":"This! Flash is fair because everyone is able to use it just like the new dragons. If anything the should let us change our summoners in game with gold because they provide counterplay to certain other champs","replies":[]}]}]}]},{"poster":"InSingedWeTrust","date":"2016-05-07T01:34:49.776+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Celestial Bodied,realm=NA,application-id=3ErqAdtq,discussion-id=bsVEHAnL,comment-id=0001,timestamp=2016-05-07T01:26:33.720+0000)\n>\n> they should make it so that flash doesn&#x27;t work in combat. I think that would be appropriate for a nerf, though ghost may still need a small buff.\n\nErm, that would make it trash tier in most cases.","replies":[{"poster":"My eeeeel","date":"2016-05-07T02:11:01.753+0000","up_votes":3,"down_votes":1,"body":"Depends, since flash is still only way non dash champions can jump over the wall or do unexpected initiation.","replies":[{"poster":"XeroKimo","date":"2016-05-07T03:22:11.177+0000","up_votes":2,"down_votes":0,"body":"Well the person that get's engaged on will no longer be able to flash to safety or run away by flashing over the wall should he get hit even once as it get's counted as in combat making it overall a weaker pick","replies":[]}]}]}]}]}