{"poster":"Ganked by ww3","date":"2018-06-29T14:29:07.014+0000","title":"Unglaublich wie wenig blaue Essenzen man bekommt","subforum":"Champions & Gameplay","up_votes":4,"down_votes":3,"body":"Ich spiele LOL nun seit circa 3 Jahren und habe einfach immer noch nicht alle Champions. Jetzt mit dem neuen System das man nur noch mit blauen Essenzen sich Champions kaufen kann dauert es einfach noch l&auml;nger und das regt langsam echt auf. Ich w&uuml;rde es wirklich gut finden wenn man wieder wie damals pro gewonnenem Spiel blaue Essenzen bekommt.","replies":[{"poster":"Megamaexx","date":"2018-06-29T14:38:55.771+0000","up_votes":3,"down_votes":0,"body":"Die Einführung von diesem System ist schon ziemlich lang her, aber zu Release wurde eine Rechnung von Riot veröffentlicht, die besagt, dass man nun schneller an neue Champions kommt, selbst wenn man alle Championsplitter entzaubert. Ich hab aber den Link nicht mehr, eben weil es schon recht lang her ist.","replies":[{"poster":"DrYatty","date":"2018-06-29T15:02:25.025+0000","up_votes":2,"down_votes":0,"body":"Bin mir nicht sicher ob es auch einen deutschen Thread dazu gab, aber hier der englische :) \n\n-> https://boards.na.leagueoflegends.com/en/c/developer-corner/Jh3Mtzu6-blue-essence-earn-rates-learning-the-numbers-with-carl-and-henrietta","replies":[{"poster":"Megamaexx","date":"2018-06-29T15:10:41.932+0000","up_votes":2,"down_votes":0,"body":"Ich meinte einen anderen, weiß aber nicht, in welcher Sprache der veröffentlicht wurde. Der Link sieht aber auch genauso aussagekräftig aus.","replies":[{"poster":"Sirrkas","date":"2018-07-03T11:31:21.397+0000","up_votes":2,"down_votes":0,"body":"Vermutlich meintest du einen der beiden:\n\nhttps://boards.na.leagueoflegends.com/en/c/developer-corner/hAaYMrEs\n\nhttps://boards.na.leagueoflegends.com/en/c/developer-corner/Jh3Mtzu6\n\nVorsicht, wenn nichts geändert wurde, ist einer der beiden sogar seit dem anderen veraltet. Bei einem war es nämlich noch so, dass man immer länger brauchen würde, für die Meilensteine und dass etwas um 720 die minimalen BE je Kapsel waren.","replies":[]}]}]}]},{"poster":"JonnyLEEED","date":"2018-07-03T17:35:15.717+0000","up_votes":1,"down_votes":0,"body":"Also ich bin jetzt ner längeren Pause wieder eingestiegen und muss sagen dass es mir echt so vorkommt als müsste man nun ewig warten um an BE zu kommen. Für n Level up bekomm ich ne shard die vll so 180-400 wert ist...gg\nDa brauch ich doch Jahre bis ich mal nen 6300er champ kaufen kann...","replies":[{"poster":"Sirrkas","date":"2018-07-03T17:42:45.316+0000","up_votes":1,"down_votes":0,"body":"Für das Levelup erhältst du mindestens 810 BE, bis zu 1260. Dazu gibt es noch spezielle Kapseln, die etwas um die 2 k enthalten.","replies":[{"poster":"JonnyLEEED","date":"2018-07-03T17:56:24.587+0000","up_votes":1,"down_votes":0,"body":"wenn man über Lvl 30 ist aber nur oder?","replies":[{"poster":"Sirrkas","date":"2018-07-03T19:16:26.224+0000","up_votes":1,"down_votes":0,"body":"Ja. Aber auch davor kriegst du mehr BE als du davor IP verdient hast. Stufe 30 erreicht man inzwischen in Windeseile.","replies":[{"poster":"JonnyLEEED","date":"2018-07-03T19:22:57.837+0000","up_votes":1,"down_votes":0,"body":"Ja XP bekommt man echt viele, jedoch habe ich gerade ne Kapsel bekommen (für nen Lvl21acc) da waren drin Miss Fortune Shard und 20 BE...\ndas kommt beiweiten nicht an 810 ran","replies":[{"poster":"Sirrkas","date":"2018-07-03T20:10:27.842+0000","up_votes":2,"down_votes":0,"body":"Die gibt es ja ab Stufe 30. Bis dahin ist quasi vorgeschrieben, wie viele BE du erhältst.","replies":[]}]}]}]}]}]},{"poster":"Ma1days","date":"2018-06-29T14:43:03.632+0000","up_votes":2,"down_votes":0,"body":"ich spiel seit season 2 lol und hab auch erst seit mitte/ende letzter season alle champs\n1 früher waren alle champs teurer\n2 früher musste man runen und runen seiten kaufen was extrem teuer war\n3 ich hab nicht mal das gefühl das man weniger be bekommt als früher \nkann ich mich auch irren weil ich kaum was verbrauche aber viel unterschied macht es nicht","replies":[{"poster":"Sirrkas","date":"2018-07-03T11:29:27.901+0000","up_votes":1,"down_votes":0,"body":"Hat bei mir ähnlich lange gedauert.","replies":[]}]},{"poster":"OPChampsSucks","date":"2018-06-29T16:23:02.230+0000","up_votes":2,"down_votes":1,"body":"naja theoretisch brauchst ja nicht alle Champions kaufen das ist ja eher nur ein übertriebenes \"wollen\"\n\nich war anfangs ziemlich skeptisch weil sich das so hinzieht bis man sich n neuen champ kaufen kann gefühlt und meiner ansicht nach tut es das auch jedenfalls wenn man jetzt an die teuren champs dran muss es sei denn man hat glück und kriegt die richtigen shards.\n\nnaja bin froh das mir nur noch 12 champs fehlen\n\nhat nur so lange gedauert (+ hat die 12 die ich noch brauche)\n\nhttps://wol.gg/stats/euw/oriius/\n\n124 tage totale spielzeit :3","replies":[{"poster":"biohazard27","date":"2018-06-29T18:58:31.242+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=OPChampsSucks,realm=EUW,application-id=Wj1wcocU,discussion-id=YqXR9YAn,comment-id=0002,timestamp=2018-06-29T16:23:02.230+0000)\n>\n> naja theoretisch brauchst ja nicht alle Champions kaufen das ist ja eher nur ein übertriebenes &quot;wollen&quot;\n> \n> ich war anfangs ziemlich skeptisch weil sich das so hinzieht bis man sich n neuen champ kaufen kann gefühlt und meiner ansicht nach tut es das auch jedenfalls wenn man jetzt an die teuren champs dran muss es sei denn man hat glück und kriegt die richtigen shards.\n> \n> naja bin froh das mir nur noch 12 champs fehlen\n> \n> hat nur so lange gedauert (+ hat die 12 die ich noch brauche)\n> \n> https://wol.gg/stats/euw/oriius/\n> \n> 124 tage totale spielzeit :3\n\nExposed! OPChampsSucks = Oriius","replies":[]}]},{"poster":"ecuto","date":"2018-07-03T19:27:38.636+0000","up_votes":1,"down_votes":0,"body":"in der Zeit wo man 3 Championsplitter zusammen würfeln konnte habe ich richtig zugeschlagen und jetzt habe ich auch alle Champions\n{{sticker:slayer-jinx-wink}} \n\naber es Stimmt es geht schon lange, aber sind das nicht alle Spiele so ?","replies":[]},{"poster":"RainerKilltKeina","date":"2018-07-03T11:27:22.471+0000","up_votes":1,"down_votes":0,"body":"ich kann mich kaum retten vor BE","replies":[]},{"poster":"Wolf Husky","date":"2018-06-30T11:14:48.322+0000","up_votes":1,"down_votes":0,"body":"Ich hasse generell dieses Konzept von \"Kisten\"...warum führen Spiele so etwas ein? Alles was mit Glück oder Zufall zu tun hat verabscheue ich -.-","replies":[{"poster":"Angel Ayume","date":"2018-06-30T18:44:15.612+0000","up_votes":1,"down_votes":0,"body":"Dann dürftest du ja gar kein LoL spielen. O.o \nDenn es ist ja auch Glück/Zufall mit was für Spieler du gematched wirst..","replies":[{"poster":"Wolf Husky","date":"2018-06-30T20:22:42.269+0000","up_votes":1,"down_votes":0,"body":"Dann dürft ich nichtmal Leben, denn es ist ja Zufall ob ich männlich oder weiblich werde und was für ein Charakter ich entwickle etc.","replies":[{"poster":"Angel Ayume","date":"2018-06-30T21:41:04.933+0000","up_votes":1,"down_votes":0,"body":"Naja, das wäre dann doch ein bisschen übertrieben, meinst du nicht? ^^ \n\nAber trotzdem, wenn du den Zufall, und ich betone mal extra IN GAMES, nicht magst bzw. hasst, dann dürftest du LoL auch nicht spielen. ^^","replies":[{"poster":"Wolf Husky","date":"2018-07-01T11:11:53.880+0000","up_votes":1,"down_votes":0,"body":"naja, es macht halt Lol nicht so perfect, aber spielen darf ich es trotzdem, bin ja nicht in Nordkorea :D","replies":[]}]}]}]}]},{"poster":"Kuroba","date":"2018-06-30T16:33:41.115+0000","up_votes":1,"down_votes":0,"body":"Ich spiele seit s7 und habe 95% aller champs und das nur via blue essence. Allein der merch von orange auf blue brachte doch fast allen 100k+ be","replies":[]},{"poster":"HawkFighter","date":"2018-06-30T15:03:40.112+0000","up_votes":1,"down_votes":0,"body":"Also ich spiele seit Season 3 und habe gerade mal 2/3 aller Champs und das sind hauptsächlich die billigen.\nFinde es auch schrecklich wie langsam aktuell geht!\n\nIch weis ja nicht wie viel hier manche Spielen, aber wenn man nicht so viel Zeit hat und im schnitt nur 2-5 Games pro Tag schafft ist es fast unmöglich alle Champs zu bekommen.","replies":[]},{"poster":"Rımuru Tempest","date":"2018-06-29T21:53:02.007+0000","up_votes":1,"down_votes":0,"body":"schon komisch wie lange leute benötigten alle champions benötigen tbh.\n\nSeason 3 mit dem Aatrox release angefangen und besitze nun seit Season 5~ alle Champions und 12 Runenseiten.  Seit dem uncapping des maximal levels habe ich Championsplitter nur verwendet um Champions aufzuwerten, Chromas wenn welche im BE Sale waren oder der BE Shop am Anfang der Season und vor ca 2 Monaten(?) war. <.<","replies":[]},{"poster":"Veezey","date":"2018-06-29T19:20:11.591+0000","up_votes":1,"down_votes":0,"body":"Ich habe einige Smurfs und kann dir sagen, dass es keinen Unterschied macht. Du kannst jetzt auch Glück haben und deinen Wunschchamp als Shard bekommen und so nochmal 20% sparen. Vor allem, wenn du immer den ersten Sieg des Tages mitnimmst geht es fix und du bekommst 50 BE geschenkt. Dann gibt es noch oft BE durch Eventmissionen. Effektiv bekommt man schon einiges mehr, aber das wirkt nicht so, weil man nicht jedes Game BE bekommt.","replies":[]}]}