{"poster":"Enosetc","date":"2015-06-20T23:38:21.403+0000","title":"Toxicity is still a huge deciding factor in games, btw","subforum":"Gameplay","up_votes":81,"down_votes":8,"body":"Posting this as a reminder that if the rager/leaver isn&#039;t on your team, they&#039;re probably on the other team.\n\nAlso posting this as a reminder that the only people who are immediately punished by toxicity are the people who are just trying to play the game.\n\nLastly, posting this as a reminder that Riot punishes you choosing to not start a game with a troll/rager and encourages you to go out of your way to type up a support ticket and wait in a long queue to be acknowledged while that same person gets to continue to ruin games for other people.\n\n______\n\nFunny enough, right after I posted this thread and queued up for another game, I was matched against a bot that just ran down mid repeatedly.\n\nhttp://puu.sh/iwC5J/d41e8a0947.png\n","replies":[{"poster":"Modmar","date":"2015-06-20T23:43:08.656+0000","up_votes":25,"down_votes":1,"body":"I'm really sad I can't find the tribunal anymore. Seemed like it helped a lot and I spent a long time on it. Seems like no one has been banned in a long time for toxicity and the reports don't do much.\n\nEDIT: Hunted down the tribunal and it says it is in maintenance... How long I wonder...","replies":[{"poster":"disregardable","date":"2015-06-20T23:45:35.116+0000","up_votes":11,"down_votes":1,"body":"You missed the announcement. They now automatically ban people for toxicity, no human overview. They just started doing it recently, so for the past 8-9 months there have been little to no bans, but now people are getting banned en masse.","replies":[{"poster":"Enosetc","date":"2015-06-20T23:49:03.892+0000","up_votes":20,"down_votes":3,"body":"> [{quoted}](name=The AFK Farmer,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=00000001,timestamp=2015-06-20T23:45:35.116+0000)\n>\n> You missed the announcement. They now automatically ban people for toxicity, no human overview. They just started doing it recently, so for the past 8-9 months there have been little to no bans, but now people are getting banned en masse.\n\npardon me if i sound combative, but i'm not really concerned about what Lyte claims his team's system is doing when i'm still seeing egregious cases of toxicity in nearly every non-premade game i take part in","replies":[{"poster":"LaceUp23","date":"2015-06-21T01:00:17.013+0000","up_votes":16,"down_votes":8,"body":"Here's the issue. Players like that 0/20 CAUSE players to be \"toxic\". Instead of being intelligent and banning these players that cause toxicity, Lyte simply just bans the people that rage at them. He does this so he can make fancy \"look how many toxic players we banned\" headlines. When in reality, the problem is getting worse because the cause isn't being fixed.","replies":[{"poster":"Virgin Ray","date":"2015-06-21T05:45:35.059+0000","up_votes":9,"down_votes":0,"body":"That's exactly why we need the tribunial back, we need living breathing intellegent humans to decide who gets punished/banned. Building more complex robots cost money, humans, in this case the community, are free and actually can comphrend and vote if they deserve bad or good. The human emotion itself is only understandable by humans and never understood by bots.","replies":[]},{"poster":"Gallowgrim","date":"2015-06-21T14:33:30.850+0000","up_votes":6,"down_votes":3,"body":"Other people have a right to play,even if they're not up to your vaunted standards friend.\n\nWhen you get hostile to them,you broke the Code, and are punished for it (eventually) - **as you should be**\n\nYou can choose to curse the poor sod a new poop-chute in the privacy of your gaming area, but when you put fingers to keyboard, you're past the reach of your own nose, so to speak.\n\nNo pity for ragers!","replies":[{"poster":"LaceUp23","date":"2015-06-21T17:19:47.287+0000","up_votes":4,"down_votes":2,"body":"So you actually defend intentional feeders? Interesting. This right here is the problem with the community, and why it has gotten worse.","replies":[{"poster":"DrinkMoreWhiskey","date":"2015-06-21T18:34:08.842+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=LaceUp23,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=000000010000000100030000,timestamp=2015-06-21T17:19:47.287+0000)\n>\n> So you actually defend intentional feeders? Interesting. This right here is the problem with the community, and why it has gotten worse.\n\nAlmost guarantee he just started out having a bad game then got raged at and at some point said screw it idgaf anymore.\n\nIt's almost like if you rage at someone already having a bad game they're like 50x more likely to feed on purpose","replies":[{"poster":"LaceUp23","date":"2015-06-21T19:16:00.657+0000","up_votes":1,"down_votes":0,"body":"It's almost as if there was a mute button. No excuse for intentionally feeding. Players like this should be permabanned. Or at least from ranked. Then you would start to see an improvement in the \"toxicity\" of league. Until then, well....keep bitching that league community is toxic. Regardless of the bullshit Lyte tries to feed ya, changing the font color of the pre-game tips sure as hell isn't going to do it.","replies":[{"poster":"Gallowgrim","date":"2015-06-22T04:47:46.800+0000","up_votes":3,"down_votes":0,"body":"But mercilessly banning anyone who rages will.\n\nAn action I wholly support. Let the ragebrats go back to polluting CoD.","replies":[{"poster":"LaceUp23","date":"2015-06-22T19:47:14.812+0000","up_votes":1,"down_votes":1,"body":"No, it really wont. They have been on that kick for a little while now with no improvements. Insanity is to keep doing the same thing and expecting change. You want toxicity fixed? Then they need to take actions to do it. If they don't want to take the actions to fix it, they shouldn't complain about it.","replies":[{"poster":"Gallowgrim","date":"2015-06-22T21:59:31.713+0000","up_votes":1,"down_votes":1,"body":"Exactly - they need to take the action of mercilessly banning every single rager they catch. No mercy, no excuses, no blaming their victims.\n\nJust one warning, then the banhammer. No matter how justified they thought they were in their raging.\n\nBecause they weren't. There is no justification for raging.\n\n\"Play LoL\" or \"Be a Rager\"\n\nOne or the other. Mutually exclusive.","replies":[{"poster":"LaceUp23","date":"2015-06-22T22:16:23.934+0000","up_votes":1,"down_votes":0,"body":"Ban 1 rager and the troll is going to cause another to rage. Will never end. If you ban them all, you will be playing League alone. Bottom line is this: the current way they are going about it is clearly unintelligent and you will be back bitching next year about the same thing. If you don't actually want to take steps to fix the problem, that is fine. Don't, however, bitch about the problem if you don't want it fixed. Have a jolly day in fairly land guy. I won't be responding to your nonsense anymore.","replies":[]}]}]}]},{"poster":"DrinkMoreWhiskey","date":"2015-06-21T19:36:14.194+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=LaceUp23,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=00000001000000010003000000000000,timestamp=2015-06-21T19:16:00.657+0000)\n>\n> It's almost as if there was a mute button. No excuse for intentionally feeding. Players like this should be permabanned. Or at least from ranked. Then you would start to see an improvement in the \"toxicity\" of league. Until then, well....keep bitching that league community is toxic. Regardless of the bullshit Lyte tries to feed ya, changing the font color of the pre-game tips sure as hell isn't going to do it.\n\nHow did I say it was an excuse for intentionally feeding, like in any way shape or form?  I just pointed out that you're an idiot if you don't understand people raging in the first place is a major contributing factor when people do stuff like afk and intentionally feed, although it clearly went over your head.\n\nThe title is that toxicity still plays a major role in games.  It clearly does.  You can justify being an ass all you want, hope it works out for you.","replies":[{"poster":"LaceUp23","date":"2015-06-21T19:49:28.550+0000","up_votes":2,"down_votes":1,"body":"Well, in order for it to work for me, I'd have to do it in the first place xD. Anyway, people intentionally feed and afk long before anyone is \"toxic\" to them. If what they think is verbal abuse really bothers them, they could simply mute and move on with their game. So no, people raging doesn't play a factor into someone intentionally feeding. That person already decided they were going to screw over 4 teammates. If they hadn't, they would just mute someone that bitches. I've seen way more feeders and trolls than I have people that rage for no reason.\n\nRegardless, I can come back and bump this in a years time. I bet that League will be just as, if not more, toxic than it is now. Reason being is that they way they are going about fixing it is completely backwards. But that doesn't matter. But I think people should stop bitching about League \"toxicity\" if they don't want to make an honest attempt to fix it.","replies":[{"poster":"Gallowgrim","date":"2015-06-22T04:45:09.989+0000","up_votes":3,"down_votes":1,"body":"Ooor.. mute your rage, say it out loud to yourself (providing no mic is involved).\n\nDeliberate feeders are scum. But raging at them makes your team tilt, annoys your teammates, and drags you to their level - all the while doing nothing productive.\n\nCase #1: \"FUCKING FEEDER!\" _is_ a troll. Your rage is what they want. You're encouraging them. \n\nCase #2: \"FUCKING FEEDER!\" is only a feeder in your estimation. They may be new. They may be having  a bad day. Maybe, maybe they really are just plain bad. Being a dick won't make them play any better.\n\nRaging is never acceptable. In no circumstances does raging solve anything. If you can't play the game without raging _at someone_ -- i.e.you can't just groan to yourself and curse their name under your breath,even scream it into your monitor (again,provided there's no mic involved) - you're not venting frustration - you're wanting to hurt someone else, and _you_ are as bad as they are in RIot's eyes - probably worse!\n\nRiot has made this plain. If you can't live with that, don't complain when they ban you from the game or otherwise punish you.\n\nSorry to burn that strawman before you could argue with it, pard.","replies":[{"poster":"LaceUp23","date":"2015-06-22T19:49:02.722+0000","up_votes":1,"down_votes":1,"body":"Your focus on my raging is completely false. You probably shouldn't use such accusations as a point in your comment.\n\nYou did hit the nail on the head, though, when you said raging at deliberate feeders. It seems like common sense that if you cut out the deliberate feeder, you would cut out the person raging at them, and the future people they would cause to do it.","replies":[{"poster":"Gallowgrim","date":"2015-06-22T21:55:53.873+0000","up_votes":1,"down_votes":1,"body":"Nope, sorry, nice failed attempt at redirecting, friend. \n\nMy focus is on raging because raging *is* the problem. And if you can't accept that, that's not the problem of the people who want to play the game as Riot wants it played - without raging. ","replies":[{"poster":"LaceUp23","date":"2015-06-22T22:14:44.174+0000","up_votes":1,"down_votes":0,"body":"I said, \"focus on MY raging\". Because that is false. I didn't say focused on raging in general. I guess they don't teach teenagers like they used to.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Wullf","date":"2015-06-22T09:50:36.950+0000","up_votes":2,"down_votes":1,"body":"being toxic is a choice.\n\nAnd there is no excuse for that.\nI am also from time to time mildly toxic but I have only myself to blame for that.","replies":[{"poster":"ULTRA RAMOOSE","date":"2015-06-22T10:01:36.748+0000","up_votes":2,"down_votes":0,"body":"You get cancer if you hold it in, which is why we need to make lol ribbons for the millions getting cancer by being polite and hold it in.","replies":[]}]},{"poster":"9kPluzZ","date":"2015-06-22T18:24:03.333+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LaceUp23,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=0000000100000001,timestamp=2015-06-21T01:00:17.013+0000)\n>\n> Here's the issue. Players like that 0/20 CAUSE players to be \"toxic\". Instead of being intelligent and banning these players that cause toxicity, Lyte simply just bans the people that rage at them. He does this so he can make fancy \"look how many toxic players we banned\" headlines. When in reality, the problem is getting worse because the cause isn't being fixed.\n\nThats the thing tho, most of the time it isnt the troller or feeder being the toxic one its the players like OP who takes ranked way too seriusly.  It doesnt event have to be intentionaly feeding ether. If you pick a off meta pick and do badly people turn toxic in a second.\n\nTheir is no way to complety stop trolling/ toxic its the INTERNET. What exactly do you gusy expect from random children on the internet? Sry to say this but you guys need to git gud and learn to carry your games","replies":[{"poster":"LaceUp23","date":"2015-06-22T19:49:42.109+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=9kPluzZ,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=00000001000000010005,timestamp=2015-06-22T18:24:03.333+0000)\n>\n> Thats the thing tho, most of the time it isnt the troller or feeder being the toxic one\n\n\nYou say trolling isn't toxic. Your entire argument is disregarded and I am not even going to take the time to read it.","replies":[{"poster":"9kPluzZ","date":"2015-06-24T02:29:18.082+0000","up_votes":1,"down_votes":1,"body":"Lol, if i pick vayne jungle ima troll, if i go ahri support i am troll. Their are way too many ways to troll in lol","replies":[{"poster":"LaceUp23","date":"2015-06-24T19:42:33.261+0000","up_votes":1,"down_votes":0,"body":"Neither of those are trolling if you have actually practiced with them. Now, if you instalock 5th pick Vayne because you wanted to Adc, but only jungle is open, then you are probably trolling.","replies":[]}]}]}]}]},{"poster":"disregardable","date":"2015-06-20T23:51:08.996+0000","up_votes":3,"down_votes":8,"body":"Need proof? Be toxic in 15 out of your next 20 games. You probably (system isn't that great) won't get banned unless you use death threats, etc but you will get a chat restriction. Maybe even sooner than that.\n\nHe also said that toxic players see more toxicity in their games. Sure you're not causing negative reactions?","replies":[{"poster":"Nameless Voice","date":"2015-06-21T01:31:59.919+0000","up_votes":7,"down_votes":0,"body":"What exactly causes negative reactions and how can you know what it is?\nPicking champions someone doesn't like for some reason?  Not saying anything when you get flamed?  Asking someone to stop flaming?  Dying once in lane?  Not magically preventing someone from dying to a gank because they were overextended without wards?\n\nPeople seem to get set off by *anything*.\n\nThere was at least some level of negative behaviour in *70% of my last hundred games*.  What am I doing that's so awful as to cause this?\n\n(Trolls like in the original post above are rare though, only 3% of games, 10% if you also include people who ragequit/afk.)","replies":[]},{"poster":"pinche maricón","date":"2015-06-21T14:33:22.176+0000","up_votes":2,"down_votes":0,"body":"\"He also said that toxic players see more toxicity in their games. Sure you're not causing negative reactions?\"\n\nLOL, if this is true it's more broken than I thought. As good as it sounds on paper, it is a very stupid idea. Let's put people who are raging at players in games with other ragers so there is not really a chance for he/she to get better.\n\nNo different then our jails/prisons in irl. Let's put a bunch of bad people in one place, everyone will get better and it will fix everything.","replies":[{"poster":"disregardable","date":"2015-06-21T14:38:07.287+0000","up_votes":3,"down_votes":0,"body":"It's not a part of the system...Toxic players make other people toxic via retaliation. When you start being verbally abusive to someone, they're 9 times out of 10 going to react in some negative way. Verbally abusing you or someone else on their team, intentionally feeding, spamming forfeits, etc.","replies":[]}]},{"poster":"Enosetc","date":"2015-06-21T00:06:55.817+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=The AFK Farmer,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=0000000100000000,timestamp=2015-06-20T23:51:08.996+0000)\n>\n> Need proof? Be toxic in 15 out of your next 20 games. You probably (system isn't that great) won't get banned unless you use death threats, etc but you will get a chat restriction. Maybe even sooner than that.\n> \n> He also said that toxic players see more toxicity in their games. Sure you're not causing negative reactions?\n\ni've never been warned or banned for toxicity in my time playing this game. this account is 5 years old","replies":[{"poster":"Xonra","date":"2015-06-21T06:06:02.316+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Enosense,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=00000001000000000000,timestamp=2015-06-21T00:06:55.817+0000)\n>\n> i've never been warned or banned for toxicity in my time playing this game. this account is 5 years old\n\nThis is why I call b.s. when people say stupid stuff like this (tanks Riot for putting stupid words like this in people's mouths).\n\nI have played going on 5 years (next month) and I have never seen a warning, never been chat restricted on this or my LAN account, never been banned, etc etc.\n\nYet Riot, not guys like this above that you responded to, claim that \"toxic players see more toxicity in their games\". Odd since I don't talk in 95% of my games (rarely a need to with pings). If I do it is heya or joking around with someone being fun to play with. \n\nIt is that type of thinking by Riot though, claiming only toxic people see other toxic people, that has people brainwashed thinking the community is fine, only trying to placate the people that aren't ignorant while they scramble to figure out what to do because they don't like punishing people with more than a chat restriction.\n\nSeriously, it would be like the police handing you a ticket for robbing a store instead of getting arrested. That is basically what a chat restriction is lol It is a bad joke that doesn't help, and usually just makes toxic people more angry for being \"punished\" at all.","replies":[]}]},{"poster":"MajeteMcJew","date":"2015-06-21T10:27:37.285+0000","up_votes":1,"down_votes":12,"body":"I actually raged at a guy for feeding bot lane and not following his lane, and I got reported and banned within 15 minutes. This system is stupid. You can feed and afk etc but not tell someone to go play a different game if they suck? Opinions are no longer allowed.This system is broken and skewed. Sorry that I have to carry a 3-15 Ezreal, Riot. Maybe if matchmaking was any good, I'd get put with players of my skill level. And I end on that.","replies":[{"poster":"disregardable","date":"2015-06-21T10:32:49.781+0000","up_votes":8,"down_votes":2,"body":"http://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/1801557909/213736843?tab=overview\n\nYou went 4/12 as Darius. \n\nhttp://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/1801482345/213736843?tab=overview\n\n0/7 as Amumu. \n\n\nhttp://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/1796260772/213736843?tab=overview\n\n1/8 as Amumu\n\nThose are in ranked. In Normals on op.gg, I see: \n\n0/8/4 Yasuo\n3/8/2 Yasuo\n0/8/8 Katarina\n0/5/1 Vayne\n\nIt's a competitive game. There will be winners and losers, and sometimes people lose hard. It doesn't mean matchmaking is bad.","replies":[{"poster":"MajeteMcJew","date":"2016-02-01T01:04:58.742+0000","up_votes":1,"down_votes":0,"body":"Ironically, you weren't in the games to see what happened. CONGRATS you can read. That doesn't mean a thing if you weren't there. You weren't in the games to see me getting camped at all my buffs and my team not coming after I ping for help. Or getting turret dived by 3 people top with no help. If you don't want me to get dived should I stand on nexus? Oh but then I'm afk. Pick one. There's a difference between \"losing hard\" and not getting the help that's supposed to come with playing on a team. What's the point of a jungler if he doesn't gank? He might as well hop in a lane then since hes only farming. Lmfao. And on SO many other occasions, I've gone 28-6 as pantheon and lost because my team can't make good decisions. 17-5 Draven and I lose because my support gets caught. Other lanes all feed. I know for a fact matchmaking is terrible. On more than 50 occasions I've destroyed my lane and lost because everybody else was terrible. Before you try talking shit on somebody, actually know what you're talking about. You have to be there to comment. That's like explaining play by play what happened at the Superbowl, based on the statistics you read. Ignorant.","replies":[]}]},{"poster":"Nameless Voice","date":"2015-06-21T12:40:00.239+0000","up_votes":6,"down_votes":1,"body":"Raged at a guy, told him to unnstall, got banned within 15 minutes.\nSounds like a rare case of the system working properly for once.","replies":[]},{"poster":"Gallowgrim","date":"2015-06-22T22:06:39.192+0000","up_votes":1,"down_votes":0,"body":"Sounds like the system is working as it should - you raged, you got banned.\n\nFeeding is subjective, and severely overused. AFKing is sorted by leaverbuster.\n\nYou don't get to be the door-keeper for LoL and decide who gets to play or should play.\n\nYou're entitled to your opinion. You're *not* entitled to bludgeon other players with it.","replies":[{"poster":"MajeteMcJew","date":"2016-02-01T01:15:33.487+0000","up_votes":1,"down_votes":0,"body":"Nobodies trying to be the \"doorkeeper\" but saying \" You are bad at the game you should uninstall\" Is an opinion. No harassing words. Nothing against the TOS. So. Try again","replies":[]}]}]}]},{"poster":"Xonra","date":"2015-06-21T06:01:04.289+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Enosense,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=000000010000,timestamp=2015-06-20T23:49:03.892+0000)\n>\n> pardon me if i sound combative, but i'm not really concerned about what Lyte claims his team's system is doing when i'm still seeing egregious cases of toxicity in nearly every non-premade game i take part in\n\nPretty much this. I see people blatantly feed or troll at times, even have seen people proclaiming \"troll mode activated\", telling our team how they won't get banned anyways because they aren't swearing, being racist, etc, which sadly, seems to be true. I have actually seen trolls that were in games weeks prior in games again, acting the same way as before, raging, etc. If the system was so good, I would see them maybe once, not again 2-3 weeks later acting the same way.","replies":[]}]}]},{"poster":"Enosetc","date":"2015-06-20T23:45:02.283+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=xxramdom,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=0000,timestamp=2015-06-20T23:43:08.656+0000)\n>\n> I'm really sad I can't find the tribunal anymore. Seemed like it helped a lot and I spent a long time on it. Seems like no one has been banned in a long time for toxicity and the reports don't do much.\n> \n> EDIT: Hunted down the tribunal and it says it is in maintenance... How long I wonder...\n\ntoo long. much too long","replies":[]}]},{"poster":"Silents429","date":"2015-06-21T03:42:28.181+0000","up_votes":2,"down_votes":12,"body":"Oh jesus another thread like this really?\n\n> Also posting this as a reminder that the only people who are immediately punished by toxicity are the people who are just trying to play the game.\n\nYet again. AGAIN!\n\nThe report system. DOES NOT WORK THIS WAY!\n\nYou do not get a warning, punishment, ban, mute ANYTHING unless you are consistently getting reported by people in your games, It DOES NOT happen because some people decided to be dicks and report you for fun. If you got banned for flipping out every game then you were flipping out every game.\n\n> Lastly, posting this as a reminder that Riot punishes you choosing to not start a game with a troll/rager and encourages you to go out of your way to type up a support ticket and wait in a long queue to be acknowledged while that same person gets to continue to ruin games for other people.\n\nAre you that desperate to kick some dirt into the wind to make it seem like you have the slightest idea on any of this? Where is any of this true?\n\n> Funny enough, right after I posted this thread and queued up for another game, I was matched against a bot that just ran down mid repeatedly.\n\nhttp://boards.na.leagueoflegends.com/en/c/miscellaneous/5so1YhEl-bot-bans-incoming\n\n\n> Posting this as a reminder that if the rager/leaver isn't on your team, they're probably on the other team.\n\nThis conflicts with stats Riot has posted on there dev blogs regarding improving the community behavior on a massive scale.","replies":[{"poster":"Enosetc","date":"2015-06-21T03:56:05.044+0000","up_votes":7,"down_votes":2,"body":"> [{quoted}](name=Silents429,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=0005,timestamp=2015-06-21T03:42:28.181+0000)\n>\n> Oh jesus another thread like this really?\n> \n> Yet again. AGAIN!\n> \n> The report system. DOES NOT WORK THIS WAY!\n> \n> You do not get a warning, punishment, ban, mute ANYTHING unless you are consistently getting reported by people in your games, It DOES NOT happen because some people decided to be dicks and report you for fun. If you got banned for flipping out every game then you were flipping out every game.\n> \n> Are you that desperate to kick some dirt into the wind to make it seem like you have the slightest idea on any of this? Where is any of this true?\n> \n> http://boards.na.leagueoflegends.com/en/c/miscellaneous/5so1YhEl-bot-bans-incoming\n> \n> This conflicts with stats Riot has posted on there dev blogs regarding improving the community behavior on a massive scale.\n\nalright, since you're throwing \"riot said this, riot said that\" at me, do you wanna talk about how lyte said that when the automated is in place it can possibly punish cases of extreme toxicity in as little as 15 minutes after a game starts? i'll happily link you to where he said this if you've conveniently forgotten\n\nsecondly, you **are** punished for choosing not to start a game that has a rager/troll in it. i'm referring to champion select where, if you \"dodge\" by closing out the client, you are forced to wait a certain amount of time before you're allowed to join a queue. this time scales with frequency. in ranked, your next win will result in -3 to your total LP gains. if you're in a promotional series, it counts as a loss. if you want the actions of that troll/rager to be noticed by someone at riot, you have to send in a support ticket. this is extremely common knowledge and the fact that you're suggesting that i'm trying to \"kick some dirt into the wind\" shows that you're the one who doesn't know how the system works\n\nalso, i'm not concerned with riot saying \"this or that is coming soon\" when they've failed to follow up on similar promises so much that it's become a meme. i already addressed your \"lyte and his team says <insert statistics here>\" line in a previous post","replies":[{"poster":"Silents429","date":"2015-06-21T04:00:16.407+0000","up_votes":1,"down_votes":17,"body":"No point in responding, you demonstrated that no matter what Riot has stated you won't listen or care.","replies":[{"poster":"Enosetc","date":"2015-06-21T04:03:51.303+0000","up_votes":12,"down_votes":0,"body":"> [{quoted}](name=Silents429,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=000500000000,timestamp=2015-06-21T04:00:16.407+0000)\n>\n> No point in responding, you demonstrated that no matter what Riot has stated you won't listen or care.\n\nthen what was the point of you posting this? \n\ni'm fine with having a discussion about this, but when you come into my thread with that condescending tone and then say \"lol ur too hard headed to speak to\" then you're just wasting my time and yours.","replies":[{"poster":"Silents429","date":"2015-06-21T06:50:54.838+0000","up_votes":1,"down_votes":14,"body":"When you dismiss people that would know in favor for personal experience, yes.\n\nBy all means, Riot with the army of statistics, and knowledge on there own community pales in comparison to what you and some others see in your games.\n\nWhat's the logical reasoning? Well Riot is simply lieing. \n\nI am sure it would have been a meaningful discussion.","replies":[{"poster":"Xonra","date":"2015-06-21T07:14:08.348+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Silents429,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=00050000000000000001,timestamp=2015-06-21T06:50:54.838+0000)\n>\n> When you dismiss people that would know in favor for personal experience, yes.\n> \n> By all means, Riot with the army of statistics, and knowledge on there own community pales in comparison to what you and some others see in your games.\n> \n> What's the logical reasoning? Well Riot is simply lieing. \n> \n> I am sure it would have been a meaningful discussion.\n\nYour response here not only makes no sense, but it contradicts itself.\n\nSo basically, you are saying Riot should be the only one to listen to because they have some sort of statistics and possible experience and say on the matter....but you shouldn't listen to someone who....has knowledge and experience on the matter by dealing with it first hand.\n\nThat makes sense. I can't imagine why all your posts are being downvoted and no one is taking you seriously.\n\nRiot isn't doing anything but saying \"we totally know cause we are Riot, look random percentages based on numbers you will never see, but trust us!\"\n\nSo Riot says, for example, 1% of games have people with Toxic behaviour.\n\nI see 6/10 games (ranked specifically) these past few days had someone I would consider toxic on either team (not counting people that were just terrible and fed, or an afk, or someone that got annoyed because someone was bad, etc). But I should believe the number tossed out with no proof to back it up, compared to my own direct experience, with proof to back it up, saying the opposite.\n\nThat is the \"logical reasoning\" right there. \n\nI'm not saying Riot is a liar 100% of the time, or don't trust them, or any silly mess like that, but you don't think they would ever have a reason to feed false numbers, or exaggerate? They want people to feel more comfortable playing, they want the gaming websites to pick up that false stat (which happened) and blast it all over, echoing the \"The game is getting so much better\". You think they want the opposite bad press? Hell no, and rightly so. \n\nYou are being naive if you think they have no reason to stretch the truth, and if they had proof to back up their claims, don't you think they would have shared any of it, instead of the \"look stats, now take out word for it while we release leaver buster or something\"?\n\nJust sayin'. Use your brain and think for yourself, logically. Don't just take them at their word with zero critical thinking skills being used, because you want to believe Riot.","replies":[{"poster":"Silents429","date":"2015-06-21T07:23:24.430+0000","up_votes":1,"down_votes":11,"body":"I am not sure what you are expecting for proof, any proof they could show would just result in the same thing you are arguing against now.\n\nThey can't show how the system works on a specific scale in fear of exploits being formed.","replies":[{"poster":"Xonra","date":"2015-06-21T07:25:34.572+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Silents429,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=0005000000000000000100000000,timestamp=2015-06-21T07:23:24.430+0000)\n>\n> I am not sure what you are expecting for proof, any proof they could show would just result in the same thing you are arguing against now.\n> \n> They can't show how the system works on a specific scale in fear of exploits being formed.\n\nSounds like you are drinking the kool-aid a bit much and just repeating bits and pieces of things they have said in the past without the full context of why they said it.\n\nEnjoy being a naive sheep.","replies":[{"poster":"Silents429","date":"2015-06-21T07:50:29.608+0000","up_votes":1,"down_votes":6,"body":"> [{quoted}](name=Xonra,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=00050000000000000001000000000000,timestamp=2015-06-21T07:25:34.572+0000)\n>\n> Sounds like you are drinking the kool-aid a bit much and just repeating bits and pieces of things they have said in the past without the full context of why they said it.\n> \n> Enjoy being a naive sheep.\n\nGo on, Tell me what they can show as proof.","replies":[{"poster":"Xonra","date":"2015-06-21T07:54:29.045+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Silents429,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=000500000000000000010000000000000000,timestamp=2015-06-21T07:50:29.608+0000)\n>\n> Go on, Tell me what they can show as proof.\n\nSo basically you are trying to argue \"show me proof of their lack of proof\".\n\nDo you even read what you type before you hit post?","replies":[{"poster":"Silents429","date":"2015-06-21T08:00:05.636+0000","up_votes":1,"down_votes":7,"body":"> [{quoted}](name=Xonra,realm=NA,application-id=3ErqAdtq,discussion-id=rdnE3VE3,comment-id=0005000000000000000100000000000000000000,timestamp=2015-06-21T07:54:29.045+0000)\n>\n> So basically you are trying to argue \"show me proof of their lack of proof\".\n> \n> Do you even read what you type before you hit post?\n\nNo I am asking you to give me an example of what they could give as proof. Obviously the numbers they posted aren't what you want, so what can they show?","replies":[]}]}]}]}]}]}]}]}]}]}]}]}