{"poster":"Dear Ashen One","date":"2017-10-08T20:58:24.407+0000","title":"My Ping Suddenly Spiked And Locked?","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":0,"body":"So, I am going to say straight out that I have a dreadful ISP. They have an entire monopoly on the area, and never provide their promised speeds half of the time. Nevertheless, I can not figure out what is going on with League. With my typical internet speed, it constantly stays around 60-65 MS (with the occasional hiccup from my ISP). This obviously isn't a problem at all, but today my MS spiked to around 160 and has stayed there since. It rarely fluctuates, but never goes below 155 MS. That is what I am so awestruck about, because it's not spiking back and forth between 60 MS and, say, 350 MS. I would normally mark that off as just my connection being bad, but the MS has practically locked itself to that number as if that is the fastest connection my Internet is able to provide. I am not sure if my ISP is throttling me, or what exactly is going on. Any help would be greatly appreciated.","replies":[{"poster":"Olegane","date":"2017-10-09T00:26:20.559+0000","up_votes":2,"down_votes":0,"body":"same problem..","replies":[{"poster":"Olegane","date":"2017-10-09T00:30:45.867+0000","up_votes":2,"down_votes":0,"body":"https://gyazo.com/9b7fa9c4a78b6e172cc48bed23fd6e1f\nhttps://gyazo.com/4e1fb53c6eae52369c717ee270b1b7e7\n\nmy internet is fine,only league is lagging ,never had any problems before today.","replies":[]}]},{"poster":"tbrantl999","date":"2017-10-09T01:07:44.239+0000","up_votes":1,"down_votes":0,"body":"It said that my average ping was 163 (its normally about 39) and average packet loss was 23.9%","replies":[]},{"poster":"Broporo","date":"2017-10-08T22:47:07.649+0000","up_votes":1,"down_votes":0,"body":"This could actually be entirely on the ISP side of things if you generally deal with these issues on a regular basis. ISP's have widely been known to throttle internet speeds based on certain data like average usage and spikes of data usage like gaming or when you reach a certain data cap.\n\nLet's go ahead and test for any packet loss first to see what's going on with your connection after it leaves your home network. Grab the network logs from one of those iffy games and let our [**log reader**](https://support.riotgames.com/hc/en-us/articles/209765743) scan it. Afterwards, post a screenshot of what it gives you here so I can take a look.","replies":[]},{"poster":"boriming","date":"2017-10-08T22:29:20.371+0000","up_votes":1,"down_votes":0,"body":"I am also experiencing this problem","replies":[]}]}