{"poster":"Dr Poro","date":"2016-05-13T21:55:34.420+0000","title":"Give an incentive to FILL in ranked","subforum":"Gameplay","up_votes":39,"down_votes":8,"body":"I&#039;ve used to fill in ranked because back in the days it allowed your teammates to play their preferred role so they would perform better. This would result in a higher winrate as you didn&#039;t have to carry every game on your own. You would sometimes put yourself in a suboptimal position so that you can expect your team to do better than when they would be forced into your role.\n\nRight now, however, everyone has this advantage. This means that if you fill, the only thing you gain is a reduction in queue time. However, it is unlikely that you&#039;re as good in 5 roles as you would be in 2 roles if you focused on only 2. This makes picking &#039;fill&#039; a suboptimal option if your aim is to climb as high as possible, because you&#039;d need to improve in 5 roles for the same result as you&#039;d otherwise get by improving in 2 roles.\n\nFill needs an incentive.\n\nMy suggestion: If you pick fill, your Match Making Rating (MMR) used for this game will be slightly lower than usual. This means that both your team and opponents will also have a slightly lower MMR and you will gain MMR based on the adjusted MMR.\n\nFor example, your MMR is 1950, adjusted for picking fill this would be placed at 1900. Matchmaking will search for allies and opponents around 1900. When calculating your team&#039;s MMR, it will use the adjusted one. (If it used your real MMR it would mean that you&#039;d gain less MMR and lose more.)\nYour LP gains/losses are based on your real MMR (if it used adjusted MMR, you&#039;d again be disadvantaged).\n\nWhy?\n- While this doesn&#039;t give the same benefit as in the old queue (which was: your team will perform better), the current benefit (you will perform better compared to the rest) should have a similar effect.\n- This doesn't only compensate YOU for filling, but also your team since your team is also at a disadvantage when players spread their skill among multiple roles.\n- If fill became slightly more popular, queue times would by fact go down.\n- Unpopular roles (*cough* support) would be played more by the influx of &#039;fill&#039; players so you wouldn&#039;t get support as often when you pick &#039;fill&#039;.\n\nHowever, don&#039;t overdo the compensation. I don&#039;t want people to feel forced to pick fill because they&#039;d otherwise need to play against much higher MMR. Fill should by no means become the standard queue option. I think that the option is currently a bit underwhelming and needs a slight compensation. I think around 30-50 MMR/ELO should be a good amount. That&#039;s what you usually gain/lose in 1 or 2 matches.\n\nThe ability to fill is a skill that I feel Riot undervalues because it&#039;s not a skill in competitive teams as the positions are already set. However, I feel that the game is much more enjoyable by playing a variety of roles and it&#039;s sad that Riot disencourages this in ranked plays.\n\nEdit: On top of Fill, I'd like to have the option of a third and fourth role. Personally, I like to play every role except ADC. I would play ADC if needed, but I perform less with this role. Picking 3 or 4 roles should give a smaller amount of MMR adjustment. Alternatively, give an MMR reduction based on the role you're assigned to. For example: You queue in as Top > Mid > Jungle > Support This would put your adjusted MMR at 1950 > 1945 > 1940 > 1930 while searching in the queue. (Matchmaking would be searching at a different MMR for each role.)","replies":[{"poster":"RevokeFaith","date":"2016-05-13T23:18:26.142+0000","up_votes":8,"down_votes":0,"body":"Fill is a noob bait atm. Which is sad, because that's the reason why queue times are so long now. Very much like your ideas!","replies":[]},{"poster":"Rand0mH3r0X","date":"2016-05-14T08:46:15.613+0000","up_votes":1,"down_votes":0,"body":"Answer to title.\n\nGet in a game faster.\n\nhttp://gifrific.com/wp-content/uploads/2015/03/Frank-Underwood-Closing-Door-House-of-Cards.gif","replies":[{"poster":"Dr Poro","date":"2016-05-14T08:48:59.811+0000","up_votes":4,"down_votes":0,"body":"Instead of searching that gif, you could've actually read the rest of the thread. I mentioned faster queue time already but that doesn't help you climb the ladder.","replies":[{"poster":"Rand0mH3r0X","date":"2016-05-14T08:52:42.375+0000","up_votes":6,"down_votes":0,"body":"Wasn't a very long search. Just type in Kevin Spacy closing a door, it's the first one.","replies":[{"poster":"Cowgirl Ed","date":"2016-05-14T16:52:27.895+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rand0mH3r0X,realm=NA,application-id=3ErqAdtq,discussion-id=GWVTkbQ4,comment-id=000600000000,timestamp=2016-05-14T08:52:42.375+0000)\n>\n> Wasn&#x27;t a very long search. Just type in Kevin Spacy closing a door, it&#x27;s the first one.\n\npost of May.","replies":[]}]}]}]},{"poster":"macromite","date":"2016-05-14T00:42:23.945+0000","up_votes":1,"down_votes":1,"body":"can't give incentive to fill. this game is currently too toxic to handle it. wait for a few years and for the playerbase to wither, then fill can be good.\n\nby toxic i specifically mean that people will use this, and go into the lower games and demand roles because they are better players.","replies":[{"poster":"Dr Poro","date":"2016-05-14T08:40:13.707+0000","up_votes":3,"down_votes":0,"body":"I think there should be a report option for this in the champ select. It's okay to ask for a role swap, but demanding it is in no case appropriate. (By demanding I mean that you threaten to troll/feed/etc if they don't do it, saying \"I would be a lot better at mid\" is still fine, though.)\n\nThe reports would be monitored like current reports (aka people with low accuracy reports will have very little value).","replies":[]}]},{"poster":"Zane Zephyr","date":"2016-05-14T03:53:43.232+0000","up_votes":3,"down_votes":0,"body":"Before DQ was even released they said that if it got too bad they would be willing to try to give incentives for people to pick support/fill. I would have no problem with that at all.","replies":[]},{"poster":"Quantum Weeb","date":"2016-05-14T06:13:43.793+0000","up_votes":2,"down_votes":0,"body":"The main problem I have with this at the moment is that by giving an MMR reward to player you are mostly going to be rewarding players who would play those roles anyway.\n\nFor example, support mains have little reason to queue up as support when they can just queue up as fill. If you happen to play the second least popular role as well, the odds are even further in your favor.\n\nAlthough it's not a complete solution, I think the pain could be partially alleviated by giving fill players a small IP bonus. I suspect this will have a smaller effect on higher tiers but a majority of the playerbase is still looking to gain more IP.","replies":[{"poster":"Dr Poro","date":"2016-05-14T08:38:27.972+0000","up_votes":2,"down_votes":0,"body":"IP is not the issue. In normal games, filling is perfectly fine because you get a shorter queue. This already means that you'll be getting more ip/hour. The problem is that it doesn't allow you to climb as high on the ladder as picking specific roles would.\n\nYes, I can see the abuse in the current situation where a support main picks fill and dodges queue everytime he isn't support. I'm not really sure if this is actually beneficial (I suppose so, because MMR > LP). A solution for this is to remove the fill option for ranked queue and allow players to pick anywhere between 2 and 5 roles in order. They'll be more likely to get the first roles but they'll get an adjusted MMR when they get the other roles. This should also make people dodge less when they don't get their preferred role. You could still pick support (your main) as 5th role and hope to get it, but you'll probably be dodging a lot then, especially since more people might be picking multiple roles.","replies":[]}]},{"poster":"Lugg","date":"2016-05-13T21:58:10.168+0000","up_votes":3,"down_votes":1,"body":"I agree that there should be some incentive. I think it should be in the form of bonus points if you win the match or a lower lost point count if you lose.","replies":[{"poster":"Dr Poro","date":"2016-05-13T23:01:27.383+0000","up_votes":3,"down_votes":1,"body":"I don't think this is a good solution, because LP is just a visual reward. It doesn't really matter in the long run. MMR is what dictates your rank. LP just follows with a lag. If you get 100 free LP now, it doesn't matter AT ALL after 100 games if you go 50/50. If you get 100 MMR, you will averagely still have that 100 MMR after going 50/50.\n\nAlso, your team doesn't get compensation this way, which should happen. Your whole team is more likely to lose if there are players picking fill instead of their best roles. I'm not talking about a 20% winrate, but rather a 48% instead of 50%.","replies":[]}]},{"poster":"Tufio","date":"2016-05-14T09:18:16.886+0000","up_votes":2,"down_votes":1,"body":"just premade or quit","replies":[]},{"poster":"TroIololol","date":"2016-05-13T23:25:36.993+0000","up_votes":2,"down_votes":1,"body":"no noob fill is for losers just go mid or feed","replies":[]},{"poster":"The Deckowner","date":"2016-09-22T15:09:19.281+0000","up_votes":1,"down_votes":0,"body":"I played fill for 2 weeks, about 3 games each day, 0 game of non suport.","replies":[]},{"poster":"jmaishere","date":"2016-05-15T05:58:43.278+0000","up_votes":1,"down_votes":0,"body":"lets face it, right now fill is basically support, I think out of 20 games of choosing fill, I've only gotten a non support role like once.","replies":[]}]}