{"poster":"Günterdroid","date":"2015-05-17T18:45:08.087+0000","title":"Tribunal vs. \"Ban system\"","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":1,"body":"1. einmal, ich wei&szlig; das hat nicht wirklich was in diesem Bereich zu suchen aber ich wei&szlig; nicht genau wohin damit und da das Rankeds betrifft hier.\r\n\r\nso jetzt zum Thema, Die Sache ist die eine Freundin von mir spielt mit mir Rankeds, (bzw. hat gespielt da sie jetzt einen Ranked und Chat Ban bekommen hat) Sie ist an sich eine sehr gute Spielerin, sehr still im Chat und auch sehr ruhig wenn es darum geht das sie geflamed wird(sie flamed und feedet nicht und ist in jedem belang eine hervorragende Spielerin). Jetzt aber hat sie nach ~25 Ranked Games (von denen waren alle bis auf 5 gewonnen und sind alle ohne jegliches geflame von einem von uns ausgekommen) eine sperre f&uuml;r Ranked Games die 35 Draft pick WINS lang dauert und eine 75 Game Chatsperre erhalten.\r\nDarauf hin hat sie nat&uuml;rlich den Support angeschrieben der nur damit geantwortet hat das die strafe angeblich aufgrund eines &quot;perfektem selbstlernenden Systems das die Chatverl&auml;ufe bei Reports durchgeht und Spieler aufgrund einer Skala von 1-100 bewertet wobei Leute die stark auf den niedrigen Zahlen sind strafen erhalten&quot; berechtigt sei. dazu zwei Sachen 1. wie ich schon gesagt habe sie verh&auml;lt sich in den Runden immer vorbildlich deswegen frage ich mich wie es &uuml;berhaupt zu einem Report kommen kann und 2. selbst wenn es einen Report gibt (durch einen troll, Madkid usw.) sollte das &quot;allm&auml;chtige System&quot; doch wohl den Ban verhindern.\r\nMeiner Meinung nach ist dieser Ban v&ouml;llig Ungerechtfertig und ich finde eigentlich das man ihn entfernen sollte, aber deswegen schreibe ich das hier nicht. Und Normalerwei&szlig;e w&uuml;rde ich mir auch denken &quot;Na gut schei&szlig; drauf die 35 Games machen wir schnell&quot; .... wenn es nicht schon das dritte mal w&auml;hre das sie so einen Ban erh&auml;lt. Beim ersten mal war dieser auch v&ouml;llig Gerechtfertig allerdings war es beim zweiten mal ohne jeglichen Grund (genau wie dieses mal auch) und der Support hatte ihr damals genau wie auch dieses mal mit der exakt selben ausrede geantwortet.\r\nIm Endeffekt mache ich diesen post weil ich wissen wollte ob es noch andere Leute gibt denen &auml;hnliche f&auml;lle bekannt sind und au&szlig;erdem m&ouml;chte ich gerne die Meinung der Community zu diesem Fall wissen, ob ich einfach nur &uuml;berreagiere oder ob ihr auch findet das es einfach nur unfair ist. Und noch eine Sache. Dieses System das zur Zeit das Tribunal ersetzt, was haltet ihr davon? findet ihr das es gut funktioniert, oder denkt ihr auch (so wie wir beide) das es einfach nur auf gut &quot;Deutsch&quot; (*hust englisch hust*) Bullshit ist?\r\nVielen dank falls ihr das ganze gelesen habt c: Gr&uuml;&szlig;e Lars \r\n{{champion:107}}    &lt;--- Rengar for style :3","replies":[{"poster":"Sirrkas","date":"2015-05-17T18:51:05.161+0000","up_votes":4,"down_votes":1,"body":"Es gibt sicher viele, die der selben Meinung sind wie du. Das sind aber zumeinst auch die Spieler, die \"unschuldig\" bestraft wurden und dann hier im Forum Threads eröffnen, die randvoll mit Beleidigungen sind und behaupten, sie wären ingame total nett.\n\nMeine Meinung zur Chatanalyse bisher ist, sie arbeitet ausgezeichnet. \n\nÜbrigens passt dein Thema besser in den Bereich \"Spielerverhalten\".","replies":[]},{"poster":"Günterdroid","date":"2015-05-18T14:32:26.455+0000","up_votes":1,"down_votes":0,"body":"das problem ist nicht der chatban sonder die rankedsperre","replies":[]},{"poster":"Günterdroid","date":"2015-05-17T21:13:35.647+0000","up_votes":1,"down_votes":0,"body":"Wie gesagt (das schon mehrmals) sie war nocht toxic, nicht ein einziges mal. außerdem wude gesagt dase es die chatlogs von leuten durchgeht die reported wurden aber da sie (man bekommt ja die meldung wenn man für flaming etc. reported wurde) keine einzioge meldung deswegen bekommen hat kann das auch nicht sein.","replies":[{"poster":"Irrsinn","date":"2015-05-17T21:33:38.129+0000","up_votes":1,"down_votes":0,"body":"Nein du bekommst nicht jedes Mal eine Meldung wenn du reportet wurdest. Du bekommst eine Meldung wenn du sehr viele Reports in kurzer Zeit bekommst. Ich hätte bitte gerne eine Antwort inwiefern das erste mal gerechtfertigt war wenn sie doch nie was schreibt bzw wenn sie nicht ein einziges Mal toix war. Schreibt sie seit dem ersten Bann nichts mehr? Oder war das davor schon der Fall?","replies":[{"poster":"Günterdroid","date":"2015-05-17T21:53:38.919+0000","up_votes":1,"down_votes":0,"body":"Ich hatte ja gesagt bei ersten mal war das gerechtfertigt, sie hatte ja geflamed aber weil sie sich bessern wollte hat sie den Chat ausgeblendet um das flamen selbst bei provokation zu vermeiden.","replies":[{"poster":"Irrsinn","date":"2015-05-17T22:21:58.437+0000","up_votes":1,"down_votes":0,"body":"Das \"kann\" das Problem sein. Ich weiß, dass das Programm ursprünglich weitere Chatrestriktionen vergeben hat wenn man keine Besserung im Chat gezeigt hat. Kein Chat->keine Besserung. Ich weiß aber nicht wie aktuell das noch ist. Auch wurde gesagt, es geht auch ohne Chat, dauert dann aber länger (ergo mehr Restriktionen).","replies":[]}]}]}]},{"poster":"HyperionCH","date":"2015-05-17T19:43:52.566+0000","up_votes":1,"down_votes":0,"body":"Also zuerst einmal bezweifle ich, dass der Riot Support von einem \"perfekten System\" sprach.\nRiot ist sich bewusst, dass die Chatanalyse auch Fehler macht. Jedoch sind diese eher im Promillebereich. Dass deine Freundin gleich 2x diese Ausnahme ist, wage ich zu bezweifeln. Die Wahrscheinlichkeit ist da doch sehr gering.\n\nDenn selbst wenn man die Fehlerquote von 1% nimmt (positive false), dann ist die Wahrscheinlichkeit, zweimal fälschlicherweise bestraft zu werden bei 1 zu 10'000.\nWobei hier nur die bestraften Spieler berücksichtigt wurden. Es werden ja nur ca. 5% der Spieler bestraft. Das heisst, dass bei 1% Fehlerquote gerade einmal 0.05% der Spieler fälschlicherweise bestraft werden; und ich spreche hier von 1x irrtümlich bestraft und nicht von 2x. ;)\n\nDie Chatanalyse durchforstet btw. alle chatlogs; auch jene in der Champ-Select und nach dem Spiel. Kann natürlich sein, dass man sich nur dort toxisch verhielt.","replies":[]},{"poster":"Irrsinn","date":"2015-05-17T18:52:10.181+0000","up_votes":1,"down_votes":1,"body":"Du widersprichst dir selbst du kannst dir nicht vorstellen, warum sie eine CR bekommt aber dann schreibst du die erste war gerechtfertigt? Gleichzeitig ist es tatsächlich unwahrscheinlich, dass sie beim dritten Mal unschuldig ist. Beim ersten Mal ist noch eine abstrus geringe Chance vorhanden, dass es einen Fehler gibt. Aber nach 3x und damit 3 Überprüfungen hast du eine höhere Chance im Haus vom Blitz getroffen zu werden während im Fernsehen gerade dein Lotto 6er angesagt wird. \nMöglich ist, dass sie Phrasen und Ausdrücke verwendet, die sie selbst nicht als negativ auffasst. Ruft sie zum Reporten auf? Sagt sie vielleicht etwas in post oder pre game chat?","replies":[{"poster":"Günterdroid","date":"2015-05-17T19:03:24.694+0000","up_votes":1,"down_votes":0,"body":"Wie gesagt Nein, beides nicht. Sie hat sogar den Chat ausgeblendet, und schreibt nur in den chat wenn sie calls macht und wenn ich es ihr sage (also wenn ich sage das du nach blue gefragt wurdest oder so)","replies":[]}]},{"poster":"Günterdroid","date":"2015-05-17T19:02:15.880+0000","up_votes":1,"down_votes":0,"body":"1. einmal danke für die antwort c:\n2. in diesem fall ist es nur leider wirklich sie ich hab das schon so objektiv wie möglich gesehen und wortwörtlich kann sie nichtmal jemanden beleidigt haben das sie den chat sogar ausgeblendet hat (weil sie wie gesagt nach dem ersten berechtigten ban sich bessern wollte) und nur noch calls schreibt bzw. auf anweisungen eingeht (die ich ihr dann durchgebe)","replies":[]}]}