{"poster":"Philip9364","date":"2016-06-25T05:56:14.634+0000","title":"Aufstieg","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo \nIch h&auml;tte einen verbesserungsvorschlag.\nIn lol Wird zurzeit **Aufstieg** gespielt ich finde man k&ouml;nnte es als Standart Spielmodie einstellen (z.B. wie Aram). Ich finde es ist mal was ganz anderes man muss sich aus der base raus teleportieren, es geht nicht nur um kills und man braucht punkte um zu gewinnen. \nwas haltet ihr davon?\n\n","replies":[{"poster":"BMG Seddy","date":"2016-06-25T11:38:33.992+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kaesfuss,realm=EUW,application-id=Wj1wcocU,discussion-id=gPHALbOb,comment-id=,timestamp=2016-06-25T05:56:14.634+0000)\n>\n> Hallo \n> Ich h&amp;auml;tte einen verbesserungsvorschlag.\n> In lol Wird zurzeit **Aufstieg** gespielt ich finde man k&amp;ouml;nnte es als Standart Spielmodie einstellen (z.B. wie Aram). Ich finde es ist mal was ganz anderes man muss sich aus der base raus teleportieren, es geht nicht nur um kills und man braucht punkte um zu gewinnen. \n> was haltet ihr davon?\n> \n> lg kaesfus{{champion:55}}\n\nMir hatte mal einer von meinen Premates erzählt, dass diese Map sogar mal ein fester Bestandteil von LoL war und man es genau so spielen konnte wie die anderen Maps auch. Mir wurde aber auch erzählt dass diese Map sehr langweilig wurde (weil kaum einer diese Map gespielt hat) und daher von Riot Team abgeschafft wurde, bis es dann in die Spielerotation kam...inwiefern das stimmt weiß ich nicht da ich mein Account erst seit Januar 2016 habe aber meiner Meinung nach klang das schon sehr überzeugend ^^","replies":[{"poster":"TerrorRaven","date":"2016-06-25T11:51:10.541+0000","up_votes":1,"down_votes":0,"body":"Der Modus hier früher \"Dominion\" und die Karte heißt \"Kristallnarbe\". Dominion war aber ein ganz anderer Modus als Aufstieg. Aufstieg ist eher ein Team-Deathmatch, während Dominion eher wie \"Herrschaft\" in Battlefield war. Der Modus war nicht sonderlich beliebt, da er ganz anders war vom Gameplay und Spielablauf her. Auch wurde die Karte visuell kaum verändert. Gegen ende haben sich fast nur noch Farm-Bots in den Modus befunden, weil die Runden schnell zu Ende gingen und auf Aufleveln so schneller wie für die ging.","replies":[]}]},{"poster":"Maexle","date":"2016-06-25T08:34:28.507+0000","up_votes":1,"down_votes":0,"body":"Ich glaube, dass solche Spielmodi relativ schnell langweilig werden, so dass sie niemand mehr spielt. Von daher ist es meiner Meinung nach gut, dass es solche Modi nur am Wochenende gibt und sie sich immer abwechseln. {{champion:17}}","replies":[]}]}