{"poster":"BauchschweißNerd","date":"2018-03-11T12:14:51.561+0000","title":"Bestrafung von Spielern die ein Spiel in die Länge ziehen","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":9,"body":"Hallo Leute. \r\n\r\nIch habe eben ein Game gehabt indem ein 5er premate ein Spiel was nach 25 - 30 Minuten eigentlich schon zuende war bis 60 Minuten in die L&auml;nge gezogen hat. Obwohl aus meinem Team 2 AFK waren . Quasi 5v3. \r\nSie pushten nicht, clearten die komplette Map inclusive Spieler und stellten sich afk irgendwo hin. Und das einfach 30 Minuten lang.\r\n\r\nWarum wir nicht surrendert haben?\r\n- Weil es tats&auml;chlich noch Spieler gibt die 3/12 stehen und denken sie k&ouml;nnen das spiel 3v5 noch rumrei&szlig;en!\r\n\r\nIch m&ouml;chte gerne Unterst&uuml;tzung beim Lolsupport. \r\nDas Replay ist runtergeladen und ich schicke dies gerne auf Anfrage zu!\r\n\r\nSollte man solche Spieler bestrafen? - Ja nat&uuml;rlich!\r\nDiese Zeitverschwendung ist wirklich absolut unn&ouml;tig und ist &uuml;berhaupt nicht sportsman- like!\r\n\r\nmfg","replies":[{"poster":"Zyzyx","date":"2018-03-11T12:20:40.034+0000","up_votes":4,"down_votes":0,"body":"> Ich möchte gerne Unterstützung beim Lolsupport.\n\nDann solltest du dich auch an selbigen wenden indem du ein Suppor-Ticket schreibst. Hier wird der Support nicht auf deine Anfrage reagieren.","replies":[{"poster":"BauchschweißNerd","date":"2018-03-11T12:23:54.462+0000","up_votes":1,"down_votes":0,"body":"ich habe einen Bug. um ein Ticket zuzuschicken muss ich mich anmelden - logisch.  ich bin angemeldet kann aber kein ticket zusenden","replies":[{"poster":"MSF Ness","date":"2018-03-11T13:56:26.150+0000","up_votes":3,"down_votes":0,"body":"Sorry, dass du ein Problem mit der Ticket Erstellung hast. Bitte sende eine Mail mit deinem Anliegen an [lol_de@riotgames.zendesk.com](http://lol_de@riotgames.zendesk.com). Dort kannst du auch dein Replay anhängen.\n\n{{sticker:sg-ahri-2}}","replies":[]},{"poster":"Necromant","date":"2018-03-11T12:38:27.639+0000","up_votes":2,"down_votes":0,"body":"Selbiges Problem mit dem Ticketbutton.\nhttps://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/s9rIkk49-ticketbutton-probleme","replies":[]}]}]},{"poster":"eimoH","date":"2018-03-11T13:10:17.638+0000","up_votes":3,"down_votes":0,"body":"Ist das eine selbstironische Anekdote die du hier geschrieben hast?\nDie Aussage bezüglich der Gegner das sie die Runde in die Länge gezogen haben stimmt, der Rest eher weniger. \n1.) Niemand aus deinem Team war AFK es sei denn du meinst dich selbst und den Jhin der viele Tode hatte.\n2.) Du warst derjenige mit 3-12 und keinem dmg.\n3.) Die Gegner haben euch sogar den Sieg geschenkt nach 60min.\n\nWusste nicht das Spieler ohne Rank es schaffen in 30min Stufe 18 zu werden. Aber schauen wir uns doch mal die Time-Ticker an\n\n43 min\nUnicorn Agent A-Killed-I will Çum on u\n44 min\nHer Sun-Killed-Grasdackl1601\n45 min\nRafiki the Wise-Killed-derCrynx\n45 min\nUnicorn Agent A-Killed-ImRockingTopLane\n\nKomisch in Minute 45 waren alle noch da passt irgendwie überhaupt nicht zu dem was du geschrieben hast.","replies":[{"poster":"BauchschweißNerd","date":"2018-03-11T18:18:09.603+0000","up_votes":1,"down_votes":1,"body":"wenn ein gegnerischer singed mit phase dich chased bis zum eigenen nexus und das 24/7 versuch da mal abzuhauen.\n\nder Jhin ist insgesamt 3x geleavt mit festem Disconnect das steht nicht im ticker. \nebenso kam er nur zurück um nicht als AFK zu gelten. \ngern schick ich dir das replay zu dann kannst du dich selbst davon überzeugen!\n\nund ja ab der 35. minute stand ich afk in der base weil ich nicht eingesehen habe ein 4v5 weiterzuspielen ohne ADC und quasi nicht vorhandenem midlaner und jungler. Ebenso hat unsere botlane und midlane so hart verloren dass 24/7 permainvaded wurde vom midlaner, jungler und deren botlane. da sind meine negativen stats kein wunder!\n\naber da DU das Topic anscheinend NICHT verstanden hast und du dich auf meine persönliche spielanalyse stürzt: \nes dreht sich darum dass die gegner locker 30 minuten früher finishen können es aber wie im chat angekündigt nicht machen um unsere zeit zu verschwenden. \n\nleider habe ich davon keinen screenshot","replies":[{"poster":"BauchschweißNerd","date":"2018-03-11T18:21:46.209+0000","up_votes":1,"down_votes":0,"body":"ebenso hast du nicht verstanden dass es hier nicht um sieg oder niederlage geht,\n sondern um die tatsache dass sie einfach ein spiel das zu ende war bis minute 60 hinausgezögert haben.\n\nebenso ein midlaner der 24/7 in 3 leute reinrennt zählt für mich auch als AFK. in dem fall brainafk.\nfountain dives waren auch dabei ! der singed hat gemacht was er wollte","replies":[{"poster":"Meemoy","date":"2018-03-14T09:04:52.431+0000","up_votes":1,"down_votes":0,"body":"Wenn sie es bis Minute 60 hinausgezögert haben, hattet ihr genug Chancen, ins Spiel zurück zu kommen.\nDass ihr diese Chancen nicht nutzen konntet ist ja nicht die Schuld der Gegner. Außerdem gibt es noch den surrender.","replies":[]}]},{"poster":"eimoH","date":"2018-03-14T08:56:05.848+0000","up_votes":1,"down_votes":0,"body":"wenn sie das im all chat angekündigt haben wird man es ja im replay sehen also schick mal (:","replies":[]}]}]},{"poster":"Ηastur","date":"2018-03-11T14:20:22.154+0000","up_votes":1,"down_votes":0,"body":"Ich hab das selbe Problem mit den Tickets. Du kannst die Seite neu laden, nachdem du \"dich angemeldet\" hast und solltest dann angemeldet sein. Solche Leute kann man für \"hilfe für das Gegnerteam\" reporten. Btw nich vergessen Leute wie \"I will Çum on u\" wegen des Namens..","replies":[]},{"poster":"5 Dunks 1 Darius","date":"2018-03-11T14:15:59.383+0000","up_votes":1,"down_votes":0,"body":"Natürlich ist das jetzt blöd für dich gelaufen, aber warum sollten Spieler für ihre Spielweise bestraft werden, die keine Regeln bricht? Wenn du es als Zeitverschwendung siehst kannst du ja leaven :/","replies":[]}]}