{"poster":"Emonek","date":"2015-05-26T15:31:33.059+0000","title":"Konto fehler- und dauerhaft gesperrt","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":4,"body":"Hallo,\n\nnach nun mehr als 5 Jahren (wie lange genau wei&szlig; ich nicht) und einigen investierten Euros wurde mein Main-Account mit der Angabe ich h&auml;tte gegen die Nutzungsbedingungen im Bezug auf \"Exploits\", \"Hacks\", etc. versto&szlig;en. Ich habe mich mit dem Support auseinander gesetzt da ich zun&auml;chst keine Email erhielt die erkl&auml;rt h&auml;tte warum mein Konto gesperrt wurde, dieser erkl&auml;rte mir dann das alles seine Richtigkeit h&auml;tte, aber keine weiteren Angaben gemacht werden k&ouml;nnten welchen \"Hack\", \"Exploit\", etc. ich ihrer Meinung nach benutzt Haben soll. Da ich aus Prinzip nie versucht habe mir in einem Multiplayerspiel ungerechte Vorteile zu verschaffen ist diese Strafe f&uuml;r mich der reinste Hohn, auch wenn ich durchaus wei&szlig;, bzw. hoffe, das eine solche nicht aus einer Laune heraus verh&auml;ngt wird. Aufgrund der Entt&auml;uschung &uuml;ber diesen permanenten Bann und die unbeweisbarkeit des Fehlers, der zu diesem f&uuml;hrte, werde ich das Spiel folgerichtig an den Nagel h&auml;ngen. \n\nDa allerdings noch Freunde und Bekannte dieses Spiel spielen w&uuml;rde ich mich &uuml;ber eine Liste, die evtl. Programme beinhaltet die nichts mit League of Legends zu tun haben, aber denoch als sonstwie gef&auml;hrliche Programme identifiziert werden, freuen. Auch k&ouml;nnten auf einer solchen Liste alle weiteren kritischen Punkte, die dazu f&uuml;hren k&ouml;nnten f&auml;lschlicherweise als Betr&uuml;ger gebannt zu werden, stehen. ( Ich muss mich hierbei so allgemein halten, da ich wirklich nicht die geringste Vorstellung habe was der Anlass f&uuml;r meinen Bann war)\n\nZudem w&uuml;rde mich interessieren ob solche falschen Kontosperrungen h&auml;ufiger vorkommen und falls dies der Fall ist Riot dazu auffordern ihre Methoden zu verfeinern.\n\nPS: Bitte enthaltet euch jeglicher Kommentare der Art \"Ohne Grund wird man nicht gebannt\", versetzt euch gedanklich in die Lage das genau das mit euch geschehen ist und ihr werdet feststellen das Kommentare die implizieren ihr h&auml;ttet dies verdient grausam sind.\n\nPPS: Falls mir jemand erklären könnte wie es möglich ist das ein Acc gesperrt wird und ich mit einem anderen spielen kann ohne das dies geschieht (was der Fall ist), wäre ich ebenfalls froh.","replies":[{"poster":"Sanctuary2056","date":"2015-05-26T17:09:12.144+0000","up_votes":2,"down_votes":0,"body":"Tjoa, was soll man dazu sagen? Schade...\nZwei Drei Punkte würde ich trotzdem gerne mal erklären/aufgreifen:\n\n> [{quoted}](name=Emonek,realm=EUW,application-id=KYnfKGf0,discussion-id=YmLAApLb,comment-id=,timestamp=2015-05-26T15:31:33.059+0000)\n>Da allerdings noch Freunde und Bekannte dieses Spiel spielen würde ich mich über eine Liste, die evtl. Programme beinhaltet die nichts mit League of Legends zu tun haben, aber denoch als sonstwie gefährliche Programme identifiziert werden, freuen. \n\nLeider geht das nicht.\nDas Problem ist, gerade in der Bekämpfung von Cheats, Hacks, etc., dass man keine derartigen Listen erstellen kann. Ersteinmal in das Thema zu schnellebig und zum anderen wirkt es wie eine Einkaufsliste. Tatsächlich sind viele Programme nur Klone von anderen Programmen, bei denen es kleine Änderungen gab wie beispielsweise in der Prozessdeklaration oder Arbeitsspeicherverwaltung. Würde man eine solche Liste veröffentlichen, könnte jeder zweite Hobbyprogrammierer diese Programme downloaden und so abändern, dass sie nichtmehr als dieses Programm identifiziert werden können aber dennoch so funktionieren wie das original.\n\n> [{quoted}](name=Emonek,realm=EUW,application-id=KYnfKGf0,discussion-id=YmLAApLb,comment-id=,timestamp=2015-05-26T15:31:33.059+0000)\n>\n> PPS: Falls mir jemand erklären könnte wie es möglich ist das ein Acc gesperrt wird und ich mit einem anderen spielen kann ohne das dies geschieht (was der Fall ist), wäre ich ebenfalls froh.\n\nZum Beispiel dann, wenn Dateien im RADS manipuliert worden sind, die sind nämlich Accountgebunden. Eine andere Möglichkeit wäre, dass der Account von mehr \"Leuten\" als von dir selbst verwendet wurde. Das \"Leuten\" steht in Anführungszeichen, weil es sich oftmals um Bots handelt, die Fremdsysteme gekapert haben und ohne deren Wissen Schabernak treiben wie beispielsweise Werbung/Spam.\n\nIn jedem Fall würde ich dir dazu raten dein System mit diversen Scannern auf Malware und Trojaner zu prüfen. Mindestens einer davon sollte bootfähig sein.\n\n> [{quoted}](name=Emonek,realm=EUW,application-id=KYnfKGf0,discussion-id=YmLAApLb,comment-id=,timestamp=2015-05-26T15:31:33.059+0000)\n>Zudem würde mich interessieren ob solche falschen Kontosperrungen häufiger vorkommen und falls dies der Fall ist Riot dazu auffordern ihre Methoden zu verfeinern.\n\nMal ganz davon abgesehen, dass ich nciht glaube, dass solche Fehler oft vorkommen... Glaubst du tatsächlich, dass jemand **bewusst** fehlerhafte Methoden verwendet und kein Interesse daran hat diese dann zu verfeinern? Wohl kaum... also entweder gillt die Frage oder die Aufforderung, beides zusammen ist sinnlos.\n\nMeiner Erfahrung nach (aus der ESL) gibt es aber eine ganze Pallette an Spielern denen nicht bewusst ist, was alles so auf ihrem System abgeht... dass da viele als Zombies verwendet werden und permanente Accountsperren bekommen, wundert mich da auch nicht. Ich habe es oft genug erlebt... Nur ist das leider ein Versäumnis der Nutzer, welches unmöglich von Riot als solches erkannt werden kann. Von falschen Kontosperrungen kann ich da also leider nicht sprechen... sehr wohl aber von solchen Kontosperrungen, die nicht aktiv vom User verursacht wurden.\n\nSoweit es mir bekannt war, hat Riot aber bislang immer ersteinmal 14 Tagessperren ausgesprochen, bevor es zur permanenten Sperre kommt. War das bei dir nicht der Fall? Oder kann es sein, dass du dich mal mehrere Wochen nicht eingeloggt hast und du sie so nicht bemerkt hast?","replies":[{"poster":"Emonek","date":"2015-05-26T18:15:40.617+0000","up_votes":1,"down_votes":0,"body":"> Soweit es mir bekannt war, hat Riot aber bislang immer ersteinmal 14 Tagessperren ausgesprochen, bevor es zur permanenten Sperre kommt. War das bei dir nicht der Fall? Oder kann es sein, dass du dich mal mehrere Wochen nicht eingeloggt hast und du sie so nicht bemerkt hast?\n\nNein eine vorläufige Sperre gab es nicht, dessen bin ich mir ziemlich sicher, hätte mich allerdings im nachhinein betrachtet gefreut da dies ein Hinweis hätte sein können meinen PC auf Viren und ähnliches zu überprüfen.","replies":[{"poster":"Darkr3sQ","date":"2015-05-26T20:39:48.784+0000","up_votes":1,"down_votes":0,"body":"Es wäre trotzdem Ratsam, Deinen Rechner auf Viren und ähnliches zu prüfen. Möglicherweise findest Du ja etwas, was Du dann dem Support als Log zuschicken könntest, um die Situation möglicherweise doch noch zu klären.","replies":[]}]},{"poster":"Emonek","date":"2015-05-26T18:02:05.120+0000","up_votes":1,"down_votes":0,"body":"> Soweit es mir bekannt war, hat Riot aber bislang immer ersteinmal 14 Tagessperren ausgesprochen, bevor es zur permanenten Sperre kommt. War das bei dir nicht der Fall? Oder kann es sein, dass du dich mal mehrere Wochen nicht eingeloggt hast und du sie so nicht bemerkt hast?\n\nDie letzte längere Pause die ich bei LoL hatte liegt nun schon längere Zeit zurück, also gehe ich davon aus das keine vorrübergehende Sperre vorrausging, zumal eine solche ja ebenfalls von einer Infomail begleitet sein sollte.","replies":[{"poster":"Emonek","date":"2015-05-26T20:00:44.078+0000","up_votes":1,"down_votes":0,"body":"Für den mehr oder weniger Doppelpost entschuldige ich mich, es sah für mich aus als wäre der Erste nicht angekommen.","replies":[]}]}]},{"poster":"proudVegan","date":"2015-05-26T17:14:36.772+0000","up_votes":1,"down_votes":0,"body":"Hallo\n\nErstmal tut es mir wirklich leid für dich !\nUnd glaub mir ich hatte so ein ähnliches Problem...nur hab ICH nicht gehackt, sondern ich wurde gehackt(Plat 2 acc und ebenfalls mehrere Euro inv.)\n\nZu deiner Frage was dazu führen kann das man fälschlicherweise wegen angeblichen hacken gesperrt wird kann ich dir folgendes sagen :\n\n1.Wie du  sicher weist hat lol wie jedes andere Spiel auch Dateien auf deinem PC heruntergeladen  und installiert. Wen jetzt z.B. durch ein Update Dateien verändert/hinzugefügt o.a.  gelöscht werden. Das läuft aber nicht immer gut. Es kann sein das (nur als Beispiel) durch ein Update die Datei Bugsplat.dll durch eine Neuere ersetzt wurde ABER (aus welchem Grund auch immer) gewisse Zusatz-Dateien nicht aktualisiert wurden. Jetzt startest du ein Spiel -du merkst nichts besonderes-...\ndie falsche bugsplat-Datei sendet aber am Ende des Spiels Daten an den Server, die dieser nicht erwartet hat. Dieser meldet das dann, und es kann sein das riot denkt du hast versucht zu hacken...(nur so als Beispiel).\n\n2.Dann kann es sein das ein Hacker versucht über deinen Acc z.B. illegal an RP zu kommen. Riot denkt natürlich du hättest das versucht und sperrt  dich...\n\n3.Kann es sein das beim kauf von RP ein Fehler auftritt und je nach dem was das für ein Fehler ist könnte es so aussehen als ob du versucht hast illegal an RP zu kommen.\n\n4.Kann es durch Zusatzprogramme wie z.B. Curse,  Steam, Overwolf , LolWiz oder auch Antivirusprogramme ebenfalls dazu kommen das falsche Daten an den Server geschickt werden oder andere Fehler auftreten.\n\nDas war alles was ich mir  mit meinen Computer-Kenntnissen so vorstellen kann.\nIch weis natürlich nicht wie genau das passieren kann, da ich das System von riot nicht kenne.\n\nPS: ich wünsche dir weiterhin viel Spaß beim zocken ;) Und ja man kann sich einen neuen Acc erstellen du brauchst nur eine zweite E-Mail.","replies":[]},{"poster":"MBLQ","date":"2015-05-26T21:24:06.458+0000","up_votes":1,"down_votes":1,"body":"und sollte es nicht klappen Blizzard bringt nächste woche Hots offiziel raus.\nBlizz ist in solchen angelegenheiten deutlich besser.  Nur ob dir das spiel spaß macht ist ne andere sache keine items und nur talente + hard mode team play","replies":[]}]}