{"poster":"bananaism","date":"2020-01-09T16:51:58.624+0000","title":"Wann ist die beste Zeit für Promos + Zu welcher Uhrzeit startet Season 10?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"{{summoner:14}} **EDIT: Start 13 Uhr, steht in den Patch Notes (4 AM PDT)**\n\n~~Als Datum wurde Freitag, 10.1. bekanntgegeben (morgen). Weiß jemand, um welche Uhrzeit die rankings resetted werden und man die Promos spielen kann?~~\n\n\n{{summoner:21}} **Außerdem spaßeshalber noch eine kleine Umfrage dabei**\n\n","replies":[{"poster":"Ma1days","date":"2020-01-09T17:03:13.641+0000","up_votes":2,"down_votes":0,"body":"Soweit ich weis 13 uhr\nUnd bessere games wird man auch nicht bekommen wenn man wartet oder spielt ihr absichtlich schlecht in promo games?","replies":[{"poster":"bananaism","date":"2020-01-09T17:07:37.123+0000","up_votes":1,"down_votes":0,"body":"Hab's auch grad gefunden, steht einfach in den Patch Notes lol, bin dumm\ndanke dennoch\nIch glaub, der Gedanke zu warten zielt darauf, dass direkt zu seasonstart alle Leute spielen, auch auch z.B. Spieler, die gar nicht richtig ernsthaft League spielen oder die ganze season über climben, sondern eher casual spielen aber neugierig sind und eingeranked werden wollen. Aber ich weiß nicht, inwiefern das so stimmt","replies":[]}]},{"poster":"RX7 Ryu","date":"2020-01-11T23:09:36.005+0000","up_votes":1,"down_votes":0,"body":"Promo Games gehen einfach immer komplett schief bei mir, ich muss mich jede Season hochkämpfen. Stehe jetzt schon 1-6. Oft sind es einfach verdammt schlechte Teams.","replies":[]},{"poster":"CG Mörglife","date":"2020-01-10T08:31:31.424+0000","up_votes":1,"down_votes":0,"body":"Naja ich hätte gesagt sofort ist am besten.\nAlle Smurfs sind jetzt erstmal mit ihren Main Accounts beschäftigt. So meine Theorie ^^.\nAußerdem grinde ich sowieso bis zum geht nicht mehr. Ob ich mir jetzt mit 10 Spielen Zeit lasse und jedes tryharde oder ob ich durchrattere kommt aufs selbe hinaus.","replies":[{"poster":"need elo police","date":"2020-01-10T11:31:06.334+0000","up_votes":1,"down_votes":0,"body":"Ich hätte jetzt eher gesagt dass sich die Leute mit ihren Smurfs jetzt aufwärmen und dann erst die Mains spielen.","replies":[{"poster":"CG Mörglife","date":"2020-01-10T11:44:41.455+0000","up_votes":1,"down_votes":0,"body":"Ich glaube nicht, dass wirklich viele sich für SoloQ aufwärmen um ehrlich zu sein.\nUnd wenn Smurfs aufwärmen wollen reicht ja auch ein normal game.","replies":[{"poster":"need elo police","date":"2020-01-10T12:25:54.049+0000","up_votes":1,"down_votes":0,"body":"Warum? Ich denke 2 Wochen intensiv auf dem Smurf Ranked spielen macht mehr Sinn als Normal Game. Und dann geht es eben beim Main weiter.","replies":[{"poster":"CG Mörglife","date":"2020-01-10T12:36:11.381+0000","up_votes":1,"down_votes":0,"body":"Naja, ich hab in der Preseason einfach genau so weiter gezockt wie in Season 9 auch.\nLeute die über die komplette Preseason nicht gespielt haben, klar, die sollten schon ein zwei games machen.\nAber 2 Wochen wird wohl keiner brauchen um sich aufzuwärmen ^^.","replies":[]}]}]}]}]},{"poster":"Reaz83","date":"2020-01-09T21:10:01.979+0000","up_votes":1,"down_votes":0,"body":"Bin berufstätig also dann wenn ich Zeit habe. ","replies":[]},{"poster":"need elo police","date":"2020-01-09T19:50:27.393+0000","up_votes":1,"down_votes":0,"body":"Es gibt keine besten Zeiten für Promos. Weil du genauso sagen kannst dass du am Nachmittag nicht mehr spielen solltest weil die ganzen Kinder von der Schule kommen. Dann würde aber niemand mehr spielen. Spiel wann du Bock hast und gut ist.","replies":[]}]}