{"poster":"FeS Dregorin","date":"2018-05-19T13:53:26.254+0000","title":"Gemeinsamer Wachstum! Stellen als Redakteur, Video Editor und mehr, bei Fenris!","subforum":"Clans & Teams","embed":{"description":"Captured with Lightshot","url":"https://prnt.sc/jffizc","image":"https://image.prntscr.com/image/Hsi71GLbTYmk4ipmvctRBA.png"},"up_votes":1,"down_votes":0,"body":"****\r\nDie eSports Organisation **&quot;Fenris eSports&quot;** - gegr&uuml;ndet im Januar 2018 - sucht f&uuml;r den Aufbau eines **Social Media Teams** nach motivierten Talenten und Quereinsteigern, die Lust und Zeit haben, in einem flexiblen Team am Projekt mitzuarbeiten. Bis zum jetzigen Zeitpunkt ist die Organisation mit f&uuml;nf Amateur- und zwei semi-professionellen Teams im Bereich &quot;League of Legends&quot; vertreten, welche von insgesamt drei Bereichsleitern aktiv gef&ouml;rdert werden. Nachdem unsere CI nun fertiggestellt wurde, m&ouml;chten wir unsere Ziele in den Bereichen Facebook, Twitter, YouTube und Twitch in Angriff nehmen - **Vielleicht genau mit Dir als Teammitglied!** Nachstehend findet sich ein kompakter &Uuml;berblick &uuml;ber die Positionen, die kurzfristig in **vertrauensvolle** H&auml;nde abzugeben sind.\r\n****\r\n\r\n**Unsere Vision in 100 Worten!**\r\n\r\nWir m&ouml;chten nicht einfach nur eine Onlinepr&auml;senz aufbauen, sondern unserem Leser/Zuschauer den Mehrwert bieten, den er f&uuml;r seine investierte Zeit verdient hat. Im Grunde genommen bedeutet dieses Vorhaben, dass wir unsere Zielgruppe bereits definiert und ein Content-Programm f&uuml;r unsere Kan&auml;le ausgearbeitet haben; Interessant, abwechslungsreich und definitiv unterhaltsam! Mit Deiner Hilfe m&ouml;chten wir uns nun der Aufgabe widmen, dieses Programm auf Facebook, Twitter, YouTube und Twitch an den Start zu bringen. Im Management und der Administration von Fenris sind bereits zahlreiche Pers&ouml;nlichkeiten vertreten, die gemeinsam an der Vision und den einzelnen Zielen tatkr&auml;ftig mitarbeiten. Klingt gut soweit? - Das ist auch unsere pers&ouml;nliche Meinung!\r\n****\r\n**Doch wo kommst du in&rsquo;s Spiel? Wir hei&szlig;en dich herzlich in einem der folgenden T&auml;tigkeitsbereichen willkommen!**\r\n****\r\n** Editor / Cutter **\r\n\r\n* Sicherer Umgang mit fortgeschrittenen Videoschnittprogrammen Deiner Wahl\r\n* Du schaffst gelegentlich auch bis zu Drei Videos pro Woche\r\n* Das Material wird vollst&auml;ndig zur Verf&uuml;gung gestellt\r\n* Du schneidest nicht nur Videos, sondern liebst Effekte und Spielereien? Dann tob&#039; Dich bei uns aus!\r\n\r\n**Redakteur/in bei Facebook **\r\n\r\n* Recherche zu relevanten Themen / neuen Themenbereichen\r\n* Verfassen von detailierten Artikeln auf Facebook und unserer Homepage\r\n* Berichte von Neuzug&auml;ngen, Spielergebnissen, allgemeine Medienarbeit\r\n* Du bist kreativ und fit in deutsch &amp; englisch? Wir bieten Dir gro&szlig;en Entwicklungsspielraum!\r\n\r\n**Redakteur/in bei Twitter **\r\n\r\n* Verfassen von vielen aber einfach gehaltenen Artikeln auf Twitter.\r\n* Berichte von Neuzug&auml;ngen, Spielergebnissen, allgemeine Medienarbeit\r\n* Du hast eine Menge Zeit, bedienst Twitter sowieso h&auml;ufig in deiner Freizeit und bist immer auf dem neuesten Stand? Wir haben einen Platz f&uuml;r dich!\r\n\r\n****\r\n\r\n** Kontaktm&ouml;glichkeiten: **\r\n\r\n* E-Mail: fenris.esports@outlook.com\r\n* Client: Michael &quot;FeS Dregorin&quot;\r\n\r\n****\r\n\r\n** Abschlie&szlig;ende Worte: **\r\n\r\nWie in der Amateur- bzw. semi-professionellen Szene &uuml;blich, findet f&uuml;r die o.g. Stellen keine Einbringung von Gehalt statt. Fenris&#039; ist bis zum jetzigen Zeitpunkt eine Vision von gleichgesinnten Spielern aus der eSport-Szene, die eine seri&ouml;se Organisation ins Leben gerufen haben. Wir schlie&szlig;en nicht aus, dass wir Dir eines Tages ein Entgegenkommen bieten k&ouml;nnen, doch darf Dies aktuell nicht Dein Antrieb sein. Wenn Du allerdings - wie wir - ein langfristiges Projekt mit klaren Zukunftsperspektiven suchst, bist Du bei uns an der richtigen Adresse.\r\n\r\nWir sind &uuml;berzeugt davon, dass Teamwork &amp; ein positives Klima viele Ziele gemeinsam erreichen k&ouml;nnen. Solltest Du also tats&auml;chlich diesen Beitrag bis zum Schluss gelesen haben, investiere doch noch Zehn Minuten Deiner Zeit und lerne uns kennen. Du wirst feststellen, dass Dich bei Fenris&#039; nach nur vier Monaten bereits Strukturen erwarten, die Du von einer taufrischen Organisation nicht erwartet h&auml;ttest. Nutze einfach die Kontaktm&ouml;glichkeiten - Wir freuen uns auf Deine Nachricht und auf ein baldiges Kennenlernen! Bei allen weiteren Fragen stehen wir Dir im pers&ouml;nlichen Gespr&auml;ch oder per E-Mail zur Verf&uuml;gung.\r\n**\r\nMit freundlichen Gr&uuml;&szlig;en,**\r\nMichael &quot;FeS Dregorin&quot; W.\r\nCMO Fenris eSports\r\n****","replies":[]}