{"poster":"BMGod145","date":"2018-07-22T21:46:36.193+0000","title":"Idea de campeón: Alhan, el Grande","subforum":"Creaciones de la comunidad","up_votes":4,"down_votes":0,"body":"Hola manga de seres con problemas para llegar a Diamond, hoy les vuelvo a traer otro concepto que me saqu&eacute; de la cabeza, ya que desde que cre&eacute; al Daimas, se me han ocurrido un par que yo considero que pueden ser interesantes, y este es creo que es el que mas me gusta hasta ahora, como siempre digo estos son campeones que a mi me gustar&iacute;a jugar a si que van a estar muy posiblemente desbalanceados o directamente rotos.\n\nAlhan, el Grande.\nNombre Completo: Alhan Marka.\nRol: Luchador/Tirador.\nEdad: 27 a&ntilde;os.\nAltura: 1.57 cm.\nPeso: 56 Kg.\nRegi&oacute;n: Runaterra.\n\nEstad&iacute;sticas.\nVida: 687/592 (+90).\nReg. Vida: 5.78/3.90 (+0.55).\nMana/Flechas: 320 (+42) /100.\nReg. Mana: 7.6 (+0.7).\nArm: 52/31 (+6).\nRes. Mag: 50/ 27 (+4).\nDa&ntilde;o: 75/67 (+4).\nVel. Ataq: 0.6/ 0.9 (+2.90%).\nRango: 125/590.\nVelocidad: 345/410.\n\nHabilidades:\n\n**Pasiva: Ej&eacute;rcito Marka**.\nLos s&uacute;bditos del equipo aliado son reemplazados por soldados del ej&eacute;rcito de Alhan, quien puede indicar a los s&uacute;bditos donde atacar presionando ALT+Click:\n\nFalange (Melee) : \nVida: 490 - 1350.\nDA: 21.\nAS: 1.30.\nRango: 125.\nARM: 15.\nDM: 12.\nVel: 330 (+30 / 20m).\nOro: 15.\nExp: 59.\n\nArqueros (Caster) :\nVida: 300 - 520.\nDA: 30 (+2 / 90s).\nAS: 0.78.\nRango: 550.\nARM: 0.\nDM: 0.\nVel: 330 (+30 / 20m).\nOro: 9.\nExp: 29.\n\nJinetes (Ca&ntilde;ones) :\nVida: 1100 (+ (80 /90) / 90s).\nDA: 50 (+3. 5 / 90s).\nAS: 1.50.\nRango: 175.\nARM: 30.\nDM: 27.\nVel: 330 (+30 / 20m).\nOro: 40 - 70.\nExp: 92.\n\nInfanter&iacute;a Pesada (Super Minions) :\nVida: 2500 (+500 / 120s).\nDA: 250 (+5 / 120s).\nAS: 0.58.\nRango: 180.\nARM: 185.\nDM: 70.\nVel: 330 (+30 / 20m).\nOro: 40 - 70.\nExp: 94.\n\n**Q: Acometida del emperador / Flecha silbante.**\n**Forma espada**: Alhan se lanza hacia delante, embistiendo y empujando a todos los enemigos que se encuentren en su camino, al final Alhan da un golpe circular con su espada, provocando da&ntilde;o y levantando a los enemigos.\n\n**Forma jinete**: Alhan dispara una flecha a gran distancia, si esta flecha impacta a un campe&oacute;n enemigo, cortar&aacute; su casteo y le ralentizar&aacute;. Los s&uacute;bditos son atravesados por la flecha y reciben 200% del da&ntilde;o.\n\nDa&ntilde;o **Espada**: 70/80/100/140/210. (+1.5 DA)\nDa&ntilde;o **Jinete:** 15/30/50/65/80. (+2.8 DA)\nRango **Espada:** 600.\nRango **Jinete:** 2500.\nDuraci&oacute;n KnockUp: 0.75.\nRalentizamiento: 50%/60%/70%/80%/90%.\nDuraci&oacute;n Ralentizamiento: 0.50/0.75/1/1.25/1.50.\nCD **Espada:** 18/16/14/12/9.\nCD **Jinete:** 6/5/4/3/2.\nCosto **Espada:**75 Mana.\nCosto **Jinete:** 1 Flecha.\n\n**W: Emperador Elegido / Hit &amp; Run.**\n**Forma Espada:** Alhan clava su espada en el suelo y libera energ&iacute;a m&iacute;stica, da&ntilde;ando a los enemigos y robando AD y AP, las estad&iacute;sticas robadas no se acumulan.\n\n**Forma Jinete:** Alhan se vuelve inmune a CC y aumenta su VEL y AS.\n\nDa&ntilde;o: 40/60/70/90/130 (+1.0 DA)\nRobo AD y AP: 20-15/30-25/50-45/60-55/80-75.\nDuraci&oacute;n de robo: 3/5/9/12.\nAumento de VEL: 15%/20%/30%/35%/50%.\nAumento de AS: 10%/20%/30%/40%/75%.\nDuraci&oacute;n de H&amp;R: 8/10 (skill al lvl 5)\nCD **Espada:** 14/12/10/8/5.\nCD **Jinete:** 25/20/17/16/14.\nCosto **Espada:** 40 Mana.\nCosto **Jinete:** Error 404 Not Found.\n\n**E: Magna / Pilto**\nPasiva: Los objetos de la tienda cuestan un menos para Alahn y todos los aliados.\n\n**Forma Espada:** Alahn se sube a su caballo, reduciendo su ataque y defensas a cambio de mas rango, AS, VEL y la necesidad de no usar mana, sin embargo Alahn se ver&aacute; limitado al uso de flechas, cuando &eacute;stas se acaban, Alahn no podr&aacute; atacar en su forma Jinete y deber&aacute; volver a base para recargar.\n\n**Forma Jinete:** Alahn se baja de su caballo y empu&ntilde;a Magna (Su espada) reduciendo su Rango, AS, VEL y adquiriendo la necesidad de usar mana, a cambio de aumentar su ataque y defensas.\n\nAumentos: Los tienen arriba en las estad&iacute;sticas, me da flojera ponerlos otra vez.\nReducci&oacute;n de precio: 5%/10%/15%/20%/25%.\n\n**R: Acometida.**\n**Forma Espada:** Alahn se sube a un carro de guerra y convoca a la &eacute;lite de su ej&eacute;rcito, ganando un bufo en todas sus estad&iacute;sticas mientras &eacute;stos vivan.\n\n**Forma Jinete** Alahn convoca a la &eacute;lite de su ej&eacute;rcito, ganando un bufo en todas su estad&iacute;sticas mientras estos vivan.\n_Nota: Esta habilidad solo puede ser usada desde la base._\n\nAumento de DA: 20/30/40.\nAumento de AS: 10%/20%/40%.\nAumento de Defensas: 30/40/60 de ARM y DM.\nAumento de VEL: 25%.\nCD: 200/130/100s.\nSoldados convocados: 4/8/12.\nDuraci&oacute;n de los soldados: 20/30/46s.\n\n**Teurach** (Unidad convocada).\n\nVida: 1100/1800/2000 (+0.10 HP)\nDA: 100/150/200 (+ 0.60 DA)\nAS: 1.86.\nRango: 660.\nARM: 100/120/130.\nDM: 30/40750.\nVEL: 410.\nOro: 0\nExp: 0.\n\n**Interacciones.**\n{{champion:268}} : Un emperador manipulable no es un emperador.\n{{champion:34}} : Vaya, nos volvemos a ver despu&eacute;s de tanto tiempo, o mas bien vuelvo a ver a una versi&oacute;n tuya despu&eacute;s de tanto tiempo.\n{{champion:79}} : Jam&aacute;s entender&eacute; el gusto de las personas por el alcohol.\n{{champion:3}} : Ya te derrot&eacute; una vez y conquist&eacute; lo que deb&iacute;as proteger, no me importar&iacute;a hacerlo otra vez.\n{{champion:122}} : Y se supone que tu eres un l&iacute;der?.\n{{champion:16}} : Te pareces mucho a mi esposa, solo que tu eres algo mas.....extra&ntilde;a.\n{{champion:516}} : Ornn, eres el &uacute;nico que me ha hecho sentir miedo en una batalla.\n{{champion:222}} : Un tipo de mi reino era problem&aacute;tico y loco como tu, acab&oacute; llorando y suplicando cuando lo mand&eacute; a la horca.\n{{champion:86}} : Estoy seguro que la ropa roja y amarilla se ver&iacute;a mas correcta en t&iacute; que la azul.\n{{champion:203}} : Ya encontr&eacute; a un par como ustedes en el pasado. &iquest;Quieren ver lo que les sucedi&oacute;?\n{{champion:107}} : Un gatito :D\n{{champion:75}} : Lo siento, no tengo un hueso para t&iacute;.\n{{champion:21}} : En mis tiempos las mujeres se vest&iacute;an de manera menos.....suelta.\n{{champion:64}} : Lo siento, pero no VEO nada amenazante en t&iacute;.\n\n**Basado en:**\n-Historia: Genghis Khan.\n-Ejército: Genghis Khan, Alejandro Magno, Fire Emblem.\n-Habilidades: Creadas por mí.\n-Apariencia: Alejandro Magno pero mas enano.\n\nBueno eso es todo, realmente es el campe&oacute;n mas complicado que he hecho hasta ahora.\n\n_~~Bad Manners~~_","replies":[{"poster":"Nisinunglacert","date":"2018-07-23T00:57:25.919+0000","up_votes":1,"down_votes":0,"body":"Me gusta lo del Maga/Pilto, como pasiva seria suficiente. Todas su demás pasivas me parecen muy rotas, en especial lo del oro. Su R está interesante.\nNo sé si ponerme al detalle con todo, tu mismo avsias que esta roto.","replies":[{"poster":"BMGod145","date":"2018-07-23T01:22:14.796+0000","up_votes":1,"down_votes":0,"body":"Vos no eras el tipo que hizo el análisis de Magallan?\n\n_~~Bad Manners~~_","replies":[{"poster":"Nisinunglacert","date":"2018-07-23T02:19:52.400+0000","up_votes":1,"down_votes":0,"body":"Ese mismo ¿por?","replies":[{"poster":"BMGod145","date":"2018-07-23T02:22:40.987+0000","up_votes":1,"down_votes":0,"body":"Una pregunta, si tienes tiempo y ganas, ¿Te importaría hacer un análisis de Alhan así como lo hiciste de Magallan? Me gustaría un análisis a detalle del concepto entero.\n\n_~~Bad Manners~~_","replies":[{"poster":"Nisinunglacert","date":"2018-07-23T02:59:41.169+0000","up_votes":1,"down_votes":0,"body":"Bueno, veo si entre mañana y pasado puedo. Tengo que preparar una materia entera para el miércoles y estoy medio atrasado...","replies":[{"poster":"BMGod145","date":"2018-07-23T03:34:13.797+0000","up_votes":1,"down_votes":0,"body":"Te entiendo bro, yo tengo que tomar un ómnibus a Miguelete a las 14:30, para ir al liceo a las 19:00 (Es el mas cercano, el resto están muy tarde o demasiado temprano) y después volverme a mi pueblo en otro ómnibus a las 21:30 aproximadamente, por lo que llego a casa asquerosamente agotado. Tómate tu tiempo, no pasa nada.\n\n_~~Bad Manners~~_","replies":[{"poster":"Nisinunglacert","date":"2018-07-27T04:33:08.805+0000","up_votes":1,"down_votes":0,"body":"Perdón me colgué xD\n---\nVa el análisis:\n\n**P:** Si tienen distintas estadísticas que los minions normales hay un problema grave, al otro equipo le va a costar farmear y encima vas a tener más presión en el mapa. Si no es el caso sigue siendo una pasiva muy rota lo de controlar los minions, porque el control de oleadas es algo que se práctica mucho y con este personaje solo es un alt+click, hasta podes hacer que ataquen al oponente y sacarlo de línea. A primeros niveles puede ser kill.\n\n**Q:** Creo que en concepto están bastante bien ambas, pero le sobran cosas. La forma espada la siento muy lenta y fuera de temática, deberías elegir entre CC y daño. La forma jinete creo que le da demasiada limpieza de oleadas y la ralentización ya es demasiado CC.\n\n**W:** RO-TÍ-SI-MO... El robo de estadísticas lo veo totalmente fuera de temática y la inmunidad al CC no es algo que se pueda poner en una habilidad básica sin condiciones. Ambas formas tienem duraciones absurdas. Pensa que una pelea no excede los 8-10s depediendo el meta y la duración de ese tipo de efectos casi nunca excede los 4 segundos.\n\n**E:** Esa pasiva me parece fuera de temática y es muy rota. Básicamente desde que empieza la partida ya todo tu equipo esta _\"feed\"_ sin haber hecho nada especial. \nLuego la parte activa en lo personal pienso que deberías adaptarlo a la pasiva base, algo como _\"Cuando Alhan esta fuera de combate puede subirse/bajarse de su caballo\"_ . Lo que hace en sí lo veo bien.\n\n**R:** Simple pero extraño. Básicamente es un pet que le da buffos muy altos mientras viva. Pero la condición de tirarlo si o si desde base lo hace poco práctico, solo tiene función defensiva. Si pudiera llamarlo desde línea pero el pet saliera de base tal vez sea más útil.\n\nCreo que perdes tiempo poniendo tantos números, la mayoría no los lee/entiende y es muy difícil que te quede balanceado. Daños base, escalados, duración de efectos, etc. si son útiles para entender la importancia de cada cosa en el kit y sus posible sinergias pero el mana, la vida por nivel, etc. son cosas que no tiene sentido que aclares. Ya con su modo de juego nos daremos cuenta cuales serán sus estadísticas fuertes y débiles.","replies":[{"poster":"BMGod145","date":"2018-07-27T18:22:27.135+0000","up_votes":1,"down_votes":0,"body":"Gracias por el análisis bro, lo estaba esperando desde hace ya rato debido a que no me gustó del todo como quedó el champ y pensaba rehacerlo otro día, tengo otras ideas en mente ahora mismo (Un man con un rifle destruye-universos, un amo del rayo, un asesino de reyes, un ?????, etc) por lo que Alhan va a quedar para otro día, y además de cambiarle algunas skills me gustaría crearle un lore mas profundo, de que servira? de nada, pero me gusta hacer estas cosas, así que no veo la razón para no crear  estos conceptos.\n\n_~~Bad Manners~~_","replies":[{"poster":"Nisinunglacert","date":"2018-07-27T21:49:44.184+0000","up_votes":1,"down_votes":0,"body":"De nada **:)** \nMe gusta tu entusiasmo, me hace acordar a mí cuando empecé... Con el colegio se me empezó a complicar al punto que tengo un concepto hace **4 meses** en borrador. Espero este sábado/domingo estar inspirado para terminarlo.","replies":[{"poster":"FallenDemonX","date":"2018-07-28T00:58:07.921+0000","up_votes":1,"down_votes":0,"body":"4 meses? Pff, amateur... [¿Que tal casi un año?](https://boards.las.leagueoflegends.com/es/c/creaciones-de-la-comunidad/Xv9n33QI-concepto-de-campeon-cifra-la-tecnopata)","replies":[{"poster":"Nisinunglacert","date":"2018-07-28T04:17:30.045+0000","up_votes":1,"down_votes":0,"body":"No me retes...\nJajaja\nDe ese concepto saque parte de la ulti de Bi'orax. Lo que pasa es que venía con ritmo. No excedía las 2 semanas y de repente tarde mes y medio, ahora 4 meses","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"FallenDemonX","date":"2018-07-23T04:31:35.190+0000","up_votes":1,"down_votes":0,"body":"Bueno, esta claro que tus ideas vas a postearlas sin filtro, totalmente devainadas. Me gusta, es un soplo de aire fresco.\n\nPara empezar me encanta la idea de un general comandando un ejercito y cambiando de táctica durante una batalla. Me parece que el juego actualmente esta algo cargado de champs \"epicos\" y \"magicos\", aunque siempre hay alguno mas humano como la nueva Akali o incluso Kled hasta cierto punto.\n\n \n\n* **Pasiva:** ¿Como es que RIOT no trajo de vuelta Luchadores del Mercado Negro? Dicho esto, no se que tan bien seria que una pasiva afectara tanto una partida. Ornn es lo mas parecido en ese sentido pero el solo aplica en late y es muy limitado. Igual es una idea muy cool, con algunos cambios como que tenga una activa seria hasta viable (Tipo, sale un panel onda Kindred y ahi podes seleccionar una unidad, la próxima oleada invoca esa unidad substituyendo a los minions respectivos y entra en CD). Solo una idea.\n\n\n* **Q:** Me gustan las ideas pero están muy fuertes. Con el Jinete podes hacer un caso que pasado un rato ya no podes tirar básicos pero aun así están muy cargadas. Funciona con la temática supongo.\n\n\n* **W:** Una Q de Trundle Over 9000 y en area o la R de Olaf en una basica, hmmmmm; si fuera mas interesante le daría el pase pero son algo simplonas. Quiza algo mas enfocado a movilidad tendría mas sentido, aunque ya veo que es una skill enfocada a dar stats y complementar al champ.\n\n\n\n* **E:** Básicamente la mecánica principal del champ. No hay nada que decir, me encanta. Lo de la pasiva sin embargo es algo raro, no veo el lado temático mas allá de \"soy un emperador y tengo pasivas globales porque why not\".  Una alternativa que se me ocurrió es una pasiva de Ornn inversa: Tu team tiene acceso a objetos igual a los de Doran pero que se buildean en otros items en lugar de ser independientes. Sigue estando roto pero por lo menos es mas interesante.\n\n\n\n* **R:** Es la R de Yorick pero con mas valor. Lo de solo poder usarlo en base es algo tosco. A menos que los minions invocados también vuelvan a ti como las demas pets (Tibbers y Daisy) no se muy bien como se supone que puedas usar al máximo esta skill. Esta bien pero es que ya existe XD.\n\n\n\n\n\nEn general tiene ideas bastante buenas y el concepto es genial. Igual parece que algunas skills se sienten de relleno, como si no estuvieras del todo seguro que querías ponerle. La W es totalmente de relleno y la Q si bien es funcional, la parte de Magna es algo básica, con utilidad algo random. La R ya dije que aunque siendo apropiada es casi lo mismo que una skill ya existente, lo cual si bien no me suele molestar en una básica, siento que una ult debería sentirse mas única. \n\n\n\nEspero ver mas de ti! Nos vemos! {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Baiken","date":"2018-07-22T22:12:05.899+0000","up_votes":1,"down_votes":0,"body":"Una cosa, ideas a NA.","replies":[{"poster":"BMGod145","date":"2018-07-22T22:14:31.918+0000","up_votes":1,"down_votes":0,"body":"No se inglés, además no creo estos conceptos como ideas para próximos campeones (como ya dije es difícil que los creen ya que están todos bastante desbalanceados) sino que los creo como pasatiempo, porque me gusta simplemente.\n\n_~~Bad Manners~~_","replies":[]}]}]}