{"poster":"Gulaghausen","date":"2017-07-30T11:44:54.366+0000","title":"Warum Nerft Riot Garen nicht?!?!?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":4,"body":"Ich finde garen{{champion:86}}  war schon fr&uuml;her nicht wirklich gebalanct, aber mit dem letzten patch wo garen gebufft wurde hat er einen enormen w buff und passive bounus erhalten nicht das garens w fr&uuml;her schon nervig war mit dem w passive womit er zum nervigsten top laner mit teemo wurde (teemo kann man aber countern). NEEEIIIIIINNNN Garens w passive ist jetzt einfach wie eine permanente volibear passive und das macht ihm zu stark das ist nervig das er einen mit der silenct dann die e einsetzt und dann nur noch r dr&uuml;cken muss!!! Ich denke mir immer dabei JAAAA MOOOIIIINNN WIE GEHTS IHNEN HEUTE SO HER PETER!!!!! {{sticker:zombie-brand-mindblown}}","replies":[{"poster":"MarCommander2211","date":"2017-07-30T12:25:41.476+0000","up_votes":1,"down_votes":0,"body":"Garen ist nicht OP, sein Engage ist scheiße und sein frühes Spiel miserabel, was er allerdings durch die passive wiedergutmacht. Er ist alles andere als broken. Beispielsweise sind Darius und Illaoi und Yasuo meiner Minung nach zu stark, da man bei Illaoi sehr gut dodgen muss und die Ult hat Overkill ist. Aber auch sie hat eben sehr große Schwächen, und zwar das Kiten gegen sie. Dasselbe wie bei Darius (obwohl er Trades einfach nur durch automatische Angriffe gewinnt, weshalb man halt sehr schnell traden muss). Aber Darus ist halt auch unfair, weil er dich in seine Minionwave bekämpft und gratis Rüstungsdurchdringung bekommt. Yasuo bekommt halt mit ner Passive ein besseres Schild als beispielsweise das von Rakan, aber halt noch gratiswerte bekommt. Außerdem ist er ein Hypercarry, der nicht nur unglaublich viel Schaden austeilt, sondern auch noch guten CC und die W hat, mit dem er das gesamte Team vor Geschossen beschützen kann. Das finde ich OP. Aber doch nicht Garen...","replies":[{"poster":"Enderized","date":"2017-07-30T20:02:07.089+0000","up_votes":1,"down_votes":0,"body":"Illaoi sehr gut dodgen?\nDu kannst mit 325movementspeed IMMER ganz gemütlich aus ihren Qs rausrennen.","replies":[{"poster":"MarCommander2211","date":"2017-11-04T14:39:21.717+0000","up_votes":1,"down_votes":0,"body":"ja stimmt XD","replies":[]}]}]},{"poster":"FABOBABO","date":"2017-08-01T15:14:03.535+0000","up_votes":1,"down_votes":0,"body":"Garen ist in Teamfights absolut nutzlos, dafür hat er halt eine angenehmere Lane. Er hat eine Winrate von 50%. Also warum sollte man ihn nerfen?","replies":[]},{"poster":"Enderized","date":"2017-07-30T11:54:56.547+0000","up_votes":1,"down_votes":0,"body":"Garen? Gibt es Champions die irrelevanter sein könnten?\n\nSpiel einen Lanebully gegen den Lanebully.\nPantheon, Yorick oder einfach Gnar","replies":[{"poster":"MarCommander2211","date":"2017-07-30T12:26:27.098+0000","up_votes":1,"down_votes":0,"body":"Lanebully? Ich hab meine Lane gegen Garen mit Nasus gewonnen. Und das Earlygame von Nasus ist praktisch nicht existent.","replies":[{"poster":"franticFurball","date":"2017-07-30T20:04:43.048+0000","up_votes":1,"down_votes":0,"body":"Ohne dem TE recht geben zu wollen, aber das ist nicht wirklich schwer, und das sag ich als Nasus Main.\n\nGaren kann gegen Nasus praktisch nichts machen.","replies":[]},{"poster":"Enderized","date":"2017-07-30T20:01:06.645+0000","up_votes":1,"down_votes":0,"body":"Gut - wie das seit dem Nasus Buff aussieht weiß ich nicht- mit den %ArmorShred wahrscheinlich besser als vorher-\nVorher war nämlich weder Early Mid noch Lategame Nasus vs Garen in irgendeiner weise relevant.","replies":[]},{"poster":"H3nt4i K4m3n","date":"2017-07-30T14:10:42.558+0000","up_votes":1,"down_votes":0,"body":"Nasus wurde doch auch sehr stark gebufft!!","replies":[]}]}]},{"poster":"Alekra","date":"2017-07-30T14:20:44.205+0000","up_votes":1,"down_votes":0,"body":"Garen ist legit ein sehr lustiger Champ","replies":[]},{"poster":"lolibus","date":"2017-07-30T13:57:44.608+0000","up_votes":1,"down_votes":0,"body":"Finde ich auch, man sollte endlich mal damit Schluss machen.\n\nhttp://imgur.com/a/absNL","replies":[]},{"poster":"Tobbel","date":"2017-07-30T12:36:24.841+0000","up_votes":1,"down_votes":0,"body":"sollen mal lieber fizz nerfen ...","replies":[{"poster":"TerrorRaven","date":"2017-07-30T13:55:20.645+0000","up_votes":1,"down_votes":0,"body":"Der bekommt auf den PBE gerade einen Buff (Cooldown vom E runter auf den ersten Leveln).","replies":[]}]}]}