{"poster":"CJ14","date":"2015-08-16T05:16:26.825+0000","title":"Merecen Ganar?","subforum":"Charlas Generales","up_votes":1,"down_votes":2,"body":"Alguna vez les ha pasado que van carreando al team...siendo practicamente los unicos con kills. Una muerte propia hace que todos flameen en tu contra y encima nadie sigue los consejos que das o los favores que pides y no puedes hacer 1v5 cada vez? Se que uno va con la mejor disposicion, pero...el resto del team merece en verdad la victoria que les estas &quot;regalando&quot;?\r\n\r\nAl final de la historia, estas haciendo todo tu, iniciar, terminar, gankear, wardear, matar, farmear, pushear, robar...Y el resto del team solo muere y flamea o se va AFK. Es casi como Eloboostear a alguien pesimo sin la intencion de hacerlo :( Odio esos teams y me siento culpable cuando les gano la partida por ellos","replies":[{"poster":"Izrail","date":"2015-08-16T05:39:11.472+0000","up_votes":1,"down_votes":0,"body":"esta clase de cosas dan origen a los troll, en este juego, le duela a quien le duela tenes que jugar pensando siempre, y digo SIEMPRE que vas a ganar, no importan los trolls, los afk, los flamers. Por que al final, es TU LP, si ellos merecen subir de division van a subir, si no, pues no. lLa partida donde pensas eso acordate: solo esta partida los carreo, despues si tienen suerte les toca otra persona asi en su team. No vale la pena rendirse por trolls o carreados. Despues los reportas si REALMENTE se lo merecen, si te les unis a trolear o dejar de intentar vas a seguir en sus ligas, y vas a tardar mas tiempo en salir de ahi, siempre te los vas a encontrar. Nunca hay que dejar de intentar por  que un error, por mas pequeño que sea, te puede dar vuelta la partida, puede ser: matas al adc enemigo por que esta solo, y por eso podes presionar una tf o algun objetivo. No rendirse nomas no importa la situacion, siempre intentar y vas a salir rapido de cualquier liga.","replies":[{"poster":"CJ14","date":"2015-08-16T17:26:36.552+0000","up_votes":1,"down_votes":0,"body":"Supongo que habra que ganar independiente de que tan util sea el resto del equipo :/","replies":[]}]},{"poster":"Raiderman","date":"2015-08-16T05:25:11.155+0000","up_votes":1,"down_votes":0,"body":"la verdad que no sabria que decirte muchas veces e visto gente que se la pasa muriendo pero terminan aportando algo, tampoco me parece que cuando esa persona que juega un poco mejor crea que puede decidir quien merece ganar o no, ya me ha pasada varias veces que en una partida bastante equilibrada hay uno de esos que se cree pro y a la primera que le decis algo se va afk o se queda dando vueltas en base diciendo: Ustedes no merecen ganar o cosas similares.\n\nPD: estoy de acuerdo con lo que decis pero pensa que nunca es realmente 1vs5 porque por lo menos algo hacen para tratar de no perder.","replies":[{"poster":"CJ14","date":"2015-08-16T17:26:21.117+0000","up_votes":1,"down_votes":0,"body":"Buen punto amigo...","replies":[]}]},{"poster":"Conejito Feliz","date":"2015-08-16T08:48:38.209+0000","up_votes":1,"down_votes":0,"body":"LA solucion a tus problemas es /mute all.  Almenos que tengas un team mas o menos comprensivo. Pero la mayoria de las veces es mejor seguir tu juego. \n\n Entrar a la partida pensando que es 5 vs vos + 4 bot siempre ayuda. Si no tenes expectativas en nadie de tu team es mejor. Quizas te sorprenda, pero si muere como idiota no te molesta porque ya estabas predispuesto que iba a morir asi xD.","replies":[{"poster":"CJ14","date":"2015-08-16T17:24:41.475+0000","up_votes":1,"down_votes":0,"body":"Suena...diferente. Voy a intentar una partida asi","replies":[]}]},{"poster":"kique1","date":"2015-08-16T08:47:45.396+0000","up_votes":1,"down_votes":0,"body":"Yo juego para mí y por mí. Esa gente a la que carreaste una partida, después van a perder 3 o más partidas y si tú eres bueno seguirás ganando y subiendo.","replies":[]},{"poster":"Rayxah","date":"2015-08-16T07:20:09.468+0000","up_votes":1,"down_votes":0,"body":"Cada vez que pienses en eso, mejor pensá en: ¿Me merezco ganar?\n\nSiempre jugá por y para vos, es un juego de equipo, pero si queres avanzar la única manera en la que vas a poder hacerlo, es jugando con mentalidad positiva y no pensando en los que juegan con mentalidad negativa, porque la partida no se define hasta que termina, me ha pasado cientos de veces en la que he ganado partidas en las que ibamos perdiendo por más de 20 kill's, o incluso, una en la que apenas teníamos el nexo para defendernos y ellos toda la base intacta, la peleamos y la ganamos...","replies":[]}]}