{"poster":"zTr1x","date":"2018-08-01T13:48:17.454+0000","title":"Dopo la 8.15 mi lagga di fps","subforum":"Aiuto e supporto","up_votes":1,"down_votes":3,"body":"Salve a tutti, &egrave; da stamattina che sto diventando matto perch&eacute; non riesco ad aggiustare questo problema di fps lag. \nIeri sera (giocando con la grafica media) il gioco andava fluido, circa 60-80 fps fissi, mentre ora dopo aver aggiornato lol alla 8.15  non supero i 5 fps.\nHo gi&agrave; provato a reinstallare il driver della scheda video, ma non funziona. Soluzioni?{{sticker:sg-shisa}}","replies":[{"poster":"RGM Player","date":"2018-08-01T17:29:55.294+0000","up_votes":1,"down_votes":0,"body":"Elenca le caratteristiche del tuo pc, soprattutto CPU(processore) e GPU(scheda video). Alcuni hanno avuto problemi con l'introduzione del nuovo sistema anti-cheat, sopratutto coloro con [CPU e GPU AMD](https://boards.euw.leagueoflegends.com/en/c/bug-reports-eu/lAAsLwkg-815-game-doesnt-load-properly) e per risolvere hanno dovuto aggiornare i BIOS. Prima di aggiornare i BIOS(se nel caso vi è un aggiornamento) ti do i soliti consigli: aggiorna i driver della GPU e avvia una riparazione del Client(nel menù di login clicca sull'ingranaggio in alto a destra e clicca su Avvia Riparazione). Se dopo tutto questo il problema persiste ancora, allora manda un ticket. Se non sai cosa fare, non aggiornare i BIOS da solo, aspetta prima una risposta dal supporto giocatori di Riot.","replies":[{"poster":"zTr1x","date":"2018-08-01T18:14:37.173+0000","up_votes":1,"down_votes":0,"body":"Sono abbastanza sicuro che non sia colpa della scheda video, nonostante so che sia obsoleta visto che è una gtx 210 (nvidia) penosa, perché fino a ieri andavo a 60-80 fissi. Per quanto riguarda il processore è un AMD FX-4100 Quad-Core","replies":[{"poster":"RGM Player","date":"2018-08-01T18:40:36.573+0000","up_votes":1,"down_votes":0,"body":"Aggiorna i driver e fai una riparazione del Cliente, se non si sistema manda un ticket","replies":[{"poster":"zTr1x","date":"2018-08-01T19:12:11.985+0000","up_votes":1,"down_votes":0,"body":"L'ho fatto non si è sistemato per niente e ho già provveduto a mandare il ticket","replies":[{"poster":"RGM Player","date":"2018-08-01T19:55:17.717+0000","up_votes":1,"down_votes":0,"body":">Players with an AMD FX/Opteron (Bulldozer family) processor experience very, very long load times followed by unplayable frame rates. This may manifest as black load screens seeming stuck for some players. Make sure that you have the most up-to-date firmware (update your BIOS to the latest version) from your machine's manufacturer, as we have confirmed that this fixes the issue.\n\nhttps://boards.na.leagueoflegends.com/en/c/bug-report/GX3Zhxwe-game-client-anti-cheat-known-issues-and-fixes\n\nCome ti ho detto prima il frame drop sembrerebbe a che fare con il nuovo sistema anti-cheat. Dovresti aggiornare i BIOS, non so dirti la procedura corretta per farlo, ma tieni in considerazione che a volte può capitare che se nel caso l'aggiornamento va male, il computer potrebbe bloccarsi del tutto.","replies":[{"poster":"zTr1x","date":"2018-08-01T21:04:27.859+0000","up_votes":1,"down_votes":0,"body":"Oh, finalmente ho fixato il tutto, c'è voluto un giorno. Mi è bastato aggiornare il bios della scheda madre all'ultima versione.","replies":[{"poster":"RGM Player","date":"2018-08-01T21:05:32.259+0000","up_votes":1,"down_votes":0,"body":"Nice!","replies":[{"poster":"zTr1x","date":"2018-08-01T21:07:00.739+0000","up_votes":2,"down_votes":0,"body":"Grazie comunque, non avrei mai capito fosse un errore del bios senza di te, sei stato 10 volte più utile del supporto.","replies":[]}]}]}]}]}]}]}]},{"poster":"sbepuz97","date":"2018-08-01T14:22:39.041+0000","up_votes":1,"down_votes":0,"body":"non saprei da me va tutto normale\n\nprova a scrivere al supporto :s","replies":[]}]}