{"poster":"DandyOhYes","date":"2017-05-27T01:05:39.402+0000","title":"Llegaron los 10 bloqueos (desaparecen ciertos campeones en rankeds!)","subforum":"Charlas Generales","up_votes":3,"down_votes":4,"body":"Con la llegada de  el parche 7.11 y con la ya desconformidad de ciertos jugadores de league of leyend sobre el cambio que ah sufrido el juego en el paso de los a&ntilde;os, mucho creen (y yo estoy de acuerdo) que al elegir 10 baneos en vez de 6, muchos campeones desaparecer&aacute;n en el formato competitivo. Jugadores frecuentes en este formato  tal como yo, estamos muy preocupados ya que no solo no se ver&aacute;n ciertos campeones, si no que suma un cambio mas al estilo de vida de este juego que varios jugadores conocen desde hace mucho y que puede o no provocar cierta disconformidad en los usuarios de tal juego. Los cambios son buenos pero hasta que punto?\r\nEl punto es que muchos players no podr&aacute;n jugar con sus campeones favoritos en ranked y es un tema a discutir a largo plazo, puesto que riot game deber&iacute;a crear charlas masivas a trav&eacute;s de foros para preguntarle a sus propios fan&aacute;ticos antes de tomar decisiones por nosotros, ya que el juego esta creado para los jugadores y que mas lindo seria que ellos puedan opinar tambi&eacute;n de los siguientes cambios que llevaran los parches de un futuro no tan lejano.\r\nDeja en tus comentarios que campeones crees que pueden desaparecer... gracias {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Impúlsive","date":"2017-05-27T01:12:32.109+0000","up_votes":2,"down_votes":0,"body":"De hecho, varios pidieron el cambio de 6 a 10 bans, además de que el metajuego actual lo obliga...\nY lo de los campeones favoritos, a qué te refieres? Zed? Yasuo? Vayne? xD\nSon permaban, y al poder haber bans duplicados, se van a desperdiciar minimo 2 bans entre Zed y Yasuo.\nAdemás, por más que haya 6 o 10 bans, esos campeones nunca se pueden jugar, y hay 130 campeones más para jugar, el OTP y sobretodo de esos campeones en Low Elo es perder tiempo.","replies":[{"poster":"DandyOhYes","date":"2017-05-27T01:20:45.082+0000","up_votes":1,"down_votes":3,"body":"te explico.. un main vayne un main zed un main lee sin, solo van a querer jugar esos champs por gusto, ya que en league of leyend todos somos libres de elegir nuestros campeones favoritos y querer jugar con ellos todo el tiempo necesario para estar conforme con ello. Muchos de \"elo alto\" opinan que esta bien solo porque lo ven del lado competitivo, pero muchos rankean queriendo demostrar que pueden llevar a su campeón favorito a ligas altas y lucir eso, mains vayne mains riven todos ellos estarán disconformes al no poder jugar todo lo que les plasca con sus champs y eso es un tema complejo ya que no solo tu tienes opinión si no muchos mas.","replies":[{"poster":"TheCatsKing","date":"2017-05-27T01:34:37.171+0000","up_votes":5,"down_votes":0,"body":"Lo mismo podria decirse de nosotros. Somos libres de banear a los champs molestos.\nAdemas no es nuestra culpa que una Vayne haya elegido eso como su main.","replies":[]},{"poster":"Impúlsive","date":"2017-05-27T01:24:50.436+0000","up_votes":1,"down_votes":0,"body":"Pero hay 140 campeones, por algo se esmeran haciéndolos.\nAdemás, ya hay champs permabaneados en normal draft o soloq/Flex con 6, se supone que tienen que adaptarse también, o de cada 5 champs select los Main Vayne o Yasuo van a dodgear 4 porque les banearon su champ?","replies":[{"poster":"DandyOhYes","date":"2017-05-27T01:44:23.827+0000","up_votes":1,"down_votes":3,"body":"no saberle jugar a zed yasuo vayne o lee sin no es motivo de que permanezcan baneados siempre, el echo de que creen mas champs es algo que es inevitable y bueno, pero no el echo de seguir cambiando el modo de juego que conozco hace ya 4 años, el tener mas bans no te va a hacer mas bueno ya que estarán baneados los rotos, por el contrario no sabrás jugarle y no tendrás nuevos retos, el echo de cambiar el modo de juego no es un reto solo es algo positiva-mente negativo que entenderás con el paso del tiempo.","replies":[{"poster":"Impúlsive","date":"2017-05-27T01:46:04.014+0000","up_votes":1,"down_votes":0,"body":"Cada uno puede banear lo que sea libre, para algo están ahí\nInsisto, para eso que creen rankeds de blind pick y que se maten entre todos.\nEdit: ¿Cambiar el modo de juego?\nMás que cambiar el modo, cambia el Meta juego. \nHabían varios champs que estaban god tier y tener 6 bans significaba tener una partida con 3 picks aproximadamente que estaban muy fuertes y significaba stompeo de lane SI o SI.\nY eso influye también. El meta cambia constantemente, no veo por qué tendrían que estar baneados siempre los mismos.","replies":[]}]}]}]}]},{"poster":"VodkaCL","date":"2017-05-27T01:13:02.119+0000","up_votes":2,"down_votes":1,"body":"me parece perfecto que hayan 10 bans asi dejamos de ver siempre los mismos campeones en solo q. Del competitivo no me interesa mucho pero creo que lo minimo que pueden hacer los pro players es adaptarse a los cambios que hace la empresa que les da de comer, sino les gusta pueden dejar de cobrar por jugar un jueguito y dedicarse a otra cosa.","replies":[{"poster":"Impúlsive","date":"2017-05-27T01:19:28.783+0000","up_votes":2,"down_votes":0,"body":"En competitivo se aplicó desde que empezó la temporada competitiva.\nDe hecho, es distinto el sistema, son 2 rotaciones. 6 Bans, 6 Picks, 4 Bans, 4 Picks.\nYa están acostumbrados prácticamente.","replies":[{"poster":"DandyOhYes","date":"2017-05-27T01:24:33.072+0000","up_votes":1,"down_votes":4,"body":"En league of leyend se viene uno a divertir no a pensar querer estar en los próximos mundiales jugando con faker, el echo que en otras partes se implementen ciertos mecanismos de juego no significa que aquí también ocurra ya que hay jugadores que solo quieren jugar champs y streamers por ejemplo como Gripex, Domzac que solo juegas champs en especifico, a quien no le gustaría saber ocupar super bn a lee sin y llevarlo a ranked y lucirlo cuanto pueda y cuando quiera sin que este el 70% de las partidas baneado","replies":[{"poster":"Impúlsive","date":"2017-05-27T01:30:46.235+0000","up_votes":3,"down_votes":0,"body":"Cuando les banean los champs ellos juegan otra cosa y punto.\nNo andan llorando simplemente porque les banearon el champ o se quejan con Riot porque quieren spamear un solo champ.\nPara eso pongamos rankeds blind pick o la soloq sin bans y que nadie pueda bloquear champs que les molesten.","replies":[]},{"poster":"Wiemeyer","date":"2017-05-29T14:04:14.093+0000","up_votes":1,"down_votes":0,"body":"Vos te venís a divertir, hay gente que no juega por diversion solamente, simple.","replies":[]}]}]}]},{"poster":"Kyo Hatori","date":"2017-05-27T02:27:01.582+0000","up_votes":1,"down_votes":0,"body":"Me gusta más para el competitivo profesional que para nosotros. En elos bajos se harán eternas las selecciones de campeones. Te digo porque actualmente kitean mucho. Será cosa de ver qué pasa.\n\nFelices Pesadillas {{sticker:slayer-jinx-catface}}","replies":[{"poster":"DandyOhYes","date":"2017-05-27T02:48:02.804+0000","up_votes":2,"down_votes":0,"body":"gracias a dios alguien habla con cabeza y me apoya dios","replies":[]}]},{"poster":"Cyclosarin","date":"2017-05-27T01:18:04.802+0000","up_votes":2,"down_votes":1,"body":"Tienes casi 140 campeones para elegir, y te quejas de los 10 que serán baneados por partida?? A mi me parece perfecto, estoy podrido de ver Yasuos y Lee Sin en TODA partida, dado que Riot no quiere nerfearlos fuertemente, no queda otra que gastar bans en ellos. A aprender mas campeones se ha dicho!","replies":[{"poster":"DandyOhYes","date":"2017-05-27T01:46:23.349+0000","up_votes":1,"down_votes":2,"body":"fácil aprender a jugarle a lee sin yasuo o zed es la mejor forma ya que si están en todas las partidas y ya sabes jugarles tienes un punto a favor para ganarles en las próximas partidas, y si no estas de acuerdo con eso es porque solo eres un plata o oro que no entiende esta discusión.","replies":[]}]},{"poster":"Wiemeyer","date":"2017-05-29T14:01:43.510+0000","up_votes":1,"down_votes":0,"body":"Hay mas de 120 campeones, no crees que es muy poco 6 bans solamente?  Hasta me atrevería a decir que 10 son pocos.\nY es League of Legends no \"Leyends\".","replies":[]},{"poster":"Fransoi ","date":"2017-05-29T12:17:23.704+0000","up_votes":1,"down_votes":0,"body":"Darius y yasuo jaja pobre los mains de esos se quedaran en bronce","replies":[]},{"poster":"Murzy","date":"2017-05-29T11:14:38.439+0000","up_votes":1,"down_votes":0,"body":"{{champion:157}} {{champion:238}} {{champion:120}} {{champion:498}} {{champion:43}} {{champion:119}}  Estos son mis permaban actuales.","replies":[]},{"poster":"Cuchuflito","date":"2017-05-28T04:07:57.636+0000","up_votes":1,"down_votes":0,"body":"Lado bueno de los 10 bans: Ya no más \"meins\" lee, yasuo,riven, etc.\nLado malo: Es más probable que te baneen al champ que juegas.","replies":[]},{"poster":"WT AraelF","date":"2017-05-27T03:04:48.310+0000","up_votes":1,"down_votes":0,"body":"creo que esto se deberia implementar para ligas altas solamente. Como bien dicen, en ligas bajas se va a dar para alargar innecesariamente la seleccion de campeones, mas quiteos por gente paveando y ni siquiera se van a usar los bans de forma estrategica.","replies":[]},{"poster":"DandyOhYes","date":"2017-05-27T01:13:21.242+0000","up_votes":1,"down_votes":0,"body":"{{champion:497}} {{champion:498}} {{champion:3}} {{champion:64}} {{champion:236}} {{champion:157}} {{champion:238}} {{champion:67}} {{champion:19}} {{champion:92}}  para mi estos 10 personajes sufrirían mucho en selección de baneos ( en lo personal )","replies":[{"poster":"WE Cat","date":"2017-05-27T02:38:36.551+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dandy Good,realm=LAS,application-id=v7qsfXsE,discussion-id=bBp7Lpbq,comment-id=0002,timestamp=2017-05-27T01:13:21.242+0000)\n>\n> {{champion:497}} {{champion:498}} {{champion:3}} {{champion:64}} {{champion:236}} {{champion:157}} {{champion:238}} {{champion:67}} {{champion:19}} {{champion:92}}  para mi estos 10 personajes sufrirían mucho en selección de baneos ( en lo personal )\n\nno amigo se viene ban a {{champion:236}}  yo creo q {{champion:122}}  sera mas baneable.","replies":[]},{"poster":"Tré Cool","date":"2017-05-27T01:25:00.765+0000","up_votes":1,"down_votes":0,"body":"Te falto el moco que la gente no se cansa de banearmelo :/","replies":[]},{"poster":"Impúlsive","date":"2017-05-27T01:18:39.136+0000","up_votes":1,"down_votes":0,"body":"Lucian con los cambios que van a hacer lo van a dejar en la shet..\nLee Sin, no lo veo muy fuerte la verdad si no es en early game, solo puede iniciar y hacer un poco de peel en late game...\nY en cuanto a Warwick, no he visto a ninguno en semanas xd","replies":[]}]},{"poster":"ÉlPapa","date":"2017-05-27T01:27:45.619+0000","up_votes":1,"down_votes":0,"body":"Riot de a poco a hecho que mas campeones estén balanceados y sean muy fuertes en competitivo, aún recuerdo hace unos 3 o 4 parches atrás, donde habían mas de 7 campeones en god tier, donde practicamente el que los pickeaba primero ganaba, además ayuda a que los jugadores estén obligados a saber jugar mas de un campeón en su línea preferida, ya que hay una probabilidad  mucho mas alta de que baneen al campeón que usas, y si ocurre, tu equipo tendrá a un jugador con un campeón que no sabe usar y lo mas probable es que pierda linea y en tf no pueda dar mas de la mitad del potencial del campeón. \nAdemás, desde mi punto de vista, estoy aburrido de jugar solo contra Yasuo o Zed, ya que Yasuo pone el  muro y no necesita estar feed para poder matarte, varias veces me a pasado que voy  ganandole a un Yasuo 3/0 o 4/0 y este pone un buen muro y me mata quedando casi full de vida, en mi opinión eso es muy injusto ya que además tiene su E que hace que sea muy difícil darle skillshots si esque este las usa seguido","replies":[{"poster":"DandyOhYes","date":"2017-05-27T01:38:21.707+0000","up_votes":1,"down_votes":3,"body":"Creo que mi punto no queda muy claro, el echo de que jugadores estén cansados de jugar siempre contra los mismos champs es un punto valido pero el echo de que baneen siempre a lee sin vayne yasuo zed no deja paso a que las personas que ocupan estos champs puedan hacerlo en ranked, prácticamente van a desaparecer y yo como fan de lee sin acepte que cambiaran la jungla que cambiaran la grieta lo cual algo malo no es, acepte que crearan otros items y así a sido todo el tiempo, el juego en el que nos enamoramos esta siendo cambiado cada vez mas y con mas crueldad, el dia de mañana muchos players van a estar disconforme con esto y yo lo doy por seguro, el echo de llegar a diamond con un solo champs ya sea zed lee sin yasuo o vayne y que ya no puedan jugarlo va a ser un problema y es a esos players al que dirijo mi comentario no al de los bronces oros o platas que estan cansados de no saberle jugar a un zed o yasuo","replies":[{"poster":"ÉlPapa","date":"2017-05-29T03:55:30.233+0000","up_votes":1,"down_votes":0,"body":"El juego está en constante cambio, esto lo hacen para que la gente no deje de jugarlo y así no pierdan jugadores. En el modo de ahora (6 bans en total) practicamente se banea lo que está mas fuerte, no a lo que uno le es mas difícil jugar que con otros, tu miras el punto de vista de la persona que juega 1 solo campeón, que son los menos, tienes que pensar siempre en el 51% o más, ya que la idea es que beneficie a la mayor cantidad de gente. \n\nLas personas que son diamante y son only vayne, zed, yasuo, etc. También pueden jugar otro campeón sin hacerlo tan mal (no se compara con el rendimiento que daría con su main pero no jugará como un oro si esque es diamante)","replies":[]}]}]},{"poster":"kiuhm","date":"2017-05-27T02:13:18.264+0000","up_votes":1,"down_votes":1,"body":"Deberian ser 20","replies":[]}]}