{"poster":"OatheSworn","date":"2018-04-29T23:51:22.137+0000","title":"The heck is Akali","subforum":"Gameplay","up_votes":26,"down_votes":11,"body":"A summary of her abilities:\r\n\r\n* Passive - I can heal and deal extra damage every few seconds.\r\n* Q - I&#039;m just going to throw this at you every 2 seconds and if I hit you then _sayonara_.\r\n* W - I&#039;m tired, going to take a nap for 8 seconds **or** I&#039;m going to use this to get over a wall **or** just going to reposition myself and land a free Q+auto.\r\n* E - Hey, I&#039;m just going to do this spin move that deals damage all around me and I can basically spam this.\r\n* R - Trying to run? NOPE. Oh you flashed? TOO BAD. Oh you used a dash? SORRY. You can&#039;t run from me when I have this up.\r\n\r\nHonestly, why should an assassin that can turn invisible for 8 seconds have such an easy kit to deal damage? Just Q R _auto_ E and delete everyone and there is no chance they can dodge this because Q is a click on, R is also a click on, E deals damage around her so after she Rs, she&#039;s right on top of you. Maybe they flash after she Rs? Good luck, she has another one. You used a dash ability? She has another one. You have another dash ability? Nope, still one more.\r\n\r\nIt&#039;s pretty annoying when you are Zed and have used all of your shadows **and** your flash and she can STILL get right up in your face. Akali got Hextech Gunblade and healed all the poke I did with my full combo in one wave. A literal joke this champion. I know this is going to get down-voted but this is my honest opinion. League is a &quot;smash or get smashed&quot; game and rarely if not ever are you going to have a balanced game where the deciding outcome is skill.\r\n\r\nI can already tell those Akali mains are going to argue in the comments on how Akali is difficult to play or how bad I am but to be honest? I&#039;d like to hear that. I actually want to know how this champion is balanced because I cannot think of a single reason. Assassins are supposed to go in, kill someone, back off, recharge, then re-engage and strike again but you have Akali who can literally nap in the middle of the fight after killing someone and for what. After she goes in and kills someone, she just presses W and waits for her team to cover  for her. What can the enemy do but try and guess where she is or retreat? If they stay, it&#039;s a 4 v 5 and Akali&#039;s spells are all on low CDs and so by the time the team is there, she&#039;s up and ready to go again.\r\n\r\nAkali is a burst-type champion and so I know that after she has used her spell rotations, she is vulnerable but that&#039;s where the W comes in. I don&#039;t think that her W should last 8 seconds, that&#039;s way to long. It has a long CD but it doesn&#039;t really matter if she plops that down and waits for her spells to come back up, re-engages and kills you. \r\n\r\nI talked to the Akali after the game was over and you know what her opinion on Akali was? &quot;A no skill, free win champion.&quot; Awesome. I was at least hoping for her to deny it a little bit but nope. Completely agrees.\r\n\r\nJust me venting but still, I think Akali is way to strong.","replies":[{"poster":"Arammus","date":"2018-04-29T23:53:59.476+0000","up_votes":22,"down_votes":1,"body":"she gets reworked soon.\nwhich scares me even more tbh.","replies":[{"poster":"Grutakiller666","date":"2018-04-30T00:04:50.219+0000","up_votes":21,"down_votes":0,"body":"InB4 built in true damage and %HP damage.","replies":[{"poster":"Arammus","date":"2018-04-30T00:34:21.148+0000","up_votes":6,"down_votes":0,"body":"well...\nsince almost 1 year riot loves 2 things.\n%max hp dmg.\nand stacks.\n\nand they start to consider more and more true dmg. so yea.\nif i play adc and akali is in the game, i usually wish for the game to end before she hits lv 6. \nso yea... akali rework... yaay...","replies":[]},{"poster":"Irelia Bot","date":"2018-04-30T11:29:46.808+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Grutakiller666,realm=NA,application-id=3ErqAdtq,discussion-id=QrvXR9t4,comment-id=00000000,timestamp=2018-04-30T00:04:50.219+0000)\n>\n> InB4 built in true damage and %HP damage.\n\nThat isn't the CertanlyT way.\n\nExpect a combination of Yasuo windwall and mobility combined with Zyra's plant zoning plus having thresh's hook all while having the sustain from a gunblade rush. Oh and she can jump after every auto...","replies":[]},{"poster":"ZackTheWaffleMan","date":"2018-04-30T00:22:16.093+0000","up_votes":3,"down_votes":0,"body":"%HP true damage","replies":[]},{"poster":"Seer of Mind","date":"2018-04-30T00:16:26.261+0000","up_votes":1,"down_votes":0,"body":"nightmares","replies":[]}]},{"poster":"Asudurga","date":"2018-04-30T11:00:29.624+0000","up_votes":6,"down_votes":0,"body":"Especially since the person in charge of it is CertainlyT, designer of such balancing nightmares {{champion:429}}, {{champion:157}}, {{champion:143}}, {{champion:142}}, {{champion:104}} (GU), {{champion:51}} (GU), {{champion:82}} (GU), {{champion:122}}","replies":[{"poster":"Votable Jester","date":"2018-04-30T16:52:16.839+0000","up_votes":1,"down_votes":0,"body":"I don't think Zyra's old kit was an issue once they nerfed her passive, and pretty sure Zoe and Cait are in fairly balanced spots now.  The others are indeed either overbearing or weak generally, hardly ever in between.","replies":[{"poster":"MuffledGarbage","date":"2018-04-30T20:08:03.583+0000","up_votes":2,"down_votes":1,"body":"Zyra's old kit was bad BECAUSE of her old passive forcing her to die in order to make use of it, and even then, enemies could simply flash away","replies":[{"poster":"Votable Jester","date":"2018-04-30T21:17:45.170+0000","up_votes":2,"down_votes":0,"body":"Kog'maw's passive requires you to die to make use of it.  The passive wasn't a good part of her kit, but that doesn't mean her kit as a whole was bad.\n\nHer issue now is that she spawns so many plants and the way they're spawned is much more effective in lane than later in the game.","replies":[{"poster":"MuffledGarbage","date":"2018-05-01T17:16:45.721+0000","up_votes":1,"down_votes":0,"body":"True, but there's not much Riot can really do about Zyra besides rework a move or two from her","replies":[]}]}]}]},{"poster":"Marothennan","date":"2018-04-30T12:49:56.827+0000","up_votes":2,"down_votes":0,"body":"Wait... CertainlyT is reworking Akali? Yay..............","replies":[]}]}]},{"poster":"Akali is SO HOT","date":"2018-04-30T00:36:36.162+0000","up_votes":15,"down_votes":2,"body":"She's pretty hot tho","replies":[{"poster":"stereal","date":"2018-04-30T08:18:02.549+0000","up_votes":5,"down_votes":0,"body":"yeah honestly thats what counts at the end of the day, idc if she makes me go 0-60 at 20 minutes, shes still pre hot","replies":[]}]},{"poster":"Marothennan","date":"2018-04-30T12:48:36.286+0000","up_votes":5,"down_votes":0,"body":"Problem with Akali is she has very little outplay potential and there's very little you can do to outplay her since she's just point and click. She either has enough stats to kill you or she doesn't, basically stupid design.","replies":[]},{"poster":"Nyarlathοtep","date":"2018-04-30T10:27:25.724+0000","up_votes":6,"down_votes":1,"body":"> I think Akali is way to strong.\n\nI would personally say fundamentally broken. You cant really play around her kit. Even my most hated assassins (one of them is permabanned by me), zed fizz leblanc have a semblance of counterplay, considering somewhere in their kit there is a skillshot. But akali? Nope there is no such thing. My favour thing i hear in her defense is that, she has weak poke.  Funny as shit.","replies":[]},{"poster":"warpenguin555","date":"2018-04-30T17:21:07.940+0000","up_votes":4,"down_votes":0,"body":"The living manifestation of all things bull shit.\n\nAt least that's how I see her","replies":[]},{"poster":"DW Diana","date":"2018-04-30T08:48:07.736+0000","up_votes":2,"down_votes":1,"body":"For once Malz has the advanatage. Akali loses HARD to a good Malz player. YEY xD","replies":[{"poster":"Marothennan","date":"2018-04-30T12:51:51.816+0000","up_votes":4,"down_votes":0,"body":"To a good malz? In theory she loses to any malz with hands and eyes","replies":[{"poster":"DW Diana","date":"2018-04-30T15:06:37.626+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Marothennan,realm=EUW,application-id=3ErqAdtq,discussion-id=QrvXR9t4,comment-id=00040000,timestamp=2018-04-30T12:51:51.816+0000)\n>\n> To a good malz? In theory she loses to any malz with hands and eyes\n\nlol, well i didn't wanna say that, there are some really good akali players out there that know how to play against him, and loads of bad malz players that will play super aggro and lose to a level 6 akali's burst. But yes, it is a good matchup for malz :P","replies":[]}]}]},{"poster":"Snowman Arc","date":"2018-04-30T11:26:46.675+0000","up_votes":6,"down_votes":2,"body":"She's not that bad, honestly. Her pre-6 game is atrocious, literally even Soraka will beat her. After 6, you need to be careful and try to bait some of her Rs so she can't spam them. She's good at roaming, because she will usually go with all 3 stacks and almost always kill someone. She's very good mid-game. The thing is, late game, she is just trash. She has 0 AoE, and she only has single target damage. I played Akali recently, I got a pentakill mid game and I was still useless later. I couldn't really snowball harder because I had a monkey ADC, but even when I was full build at 30 minutes, the enemy had Zilean, Tryndamere, Twitch with GA and 2 more things. At that point, I couldn't kill anyone. The enemy would always group up so they could Zilean R to stop my first kill, Trynda had R, Twitch had GA and they were saving everything for me. I never felt as useless being so fed.","replies":[{"poster":"OatheSworn","date":"2018-04-30T16:55:47.292+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Snowman Arc,realm=EUNE,application-id=3ErqAdtq,discussion-id=QrvXR9t4,comment-id=0006,timestamp=2018-04-30T11:26:46.675+0000)\n>\n> She&#x27;s not that bad, honestly. Her pre-6 game is atrocious, literally even Soraka will beat her. After 6, you need to be careful and try to bait some of her Rs so she can&#x27;t spam them. She&#x27;s good at roaming, because she will usually go with all 3 stacks and almost always kill someone. She&#x27;s very good mid-game. The thing is, late game, she is just trash. She has 0 AoE, and she only has single target damage. I played Akali recently, I got a pentakill mid game and I was still useless later. I couldn&#x27;t really snowball harder because I had a monkey ADC, but even when I was full build at 30 minutes, the enemy had Zilean, Tryndamere, Twitch with GA and 2 more things. At that point, I couldn&#x27;t kill anyone. The enemy would always group up so they could Zilean R to stop my first kill, Trynda had R, Twitch had GA and they were saving everything for me. I never felt as useless being so fed.\n\nI think that would go for any champion who deals burst damage because GA is pretty atrocious against all burst type.","replies":[{"poster":"Snowman Arc","date":"2018-04-30T19:00:38.829+0000","up_votes":3,"down_votes":1,"body":"That's not the real problem. The thing is that she has no reliable escapes after she goes in. She either need to find terrain to jump over, or some target to R on. Otherwise, she will just stay there. Hiding in your W isn't a solution either.\n\nMost other assassins can move in, do their combo, and then blink back to safety. LB can, Zed can, Talon will always find some terrain to escape with, Fizz has his classic untargetability - escape on his E etc.","replies":[{"poster":"OatheSworn","date":"2018-05-01T04:12:16.053+0000","up_votes":2,"down_votes":4,"body":"> [{quoted}](name=Snowman Arc,realm=EUNE,application-id=3ErqAdtq,discussion-id=QrvXR9t4,comment-id=000600010000,timestamp=2018-04-30T19:00:38.829+0000)\n>\n> That&#x27;s not the real problem. The thing is that she has no reliable escapes after she goes in. She either need to find terrain to jump over, or some target to R on. Otherwise, she will just stay there. Hiding in your W isn&#x27;t a solution either.\n> \n> Most other assassins can move in, do their combo, and then blink back to safety. LB can, Zed can, Talon will always find some terrain to escape with, Fizz has his classic untargetability - escape on his E etc.\n\nExcept if you absolutely slaughter anyone you go in after, a reliable escape isn't _quite_ needed...","replies":[{"poster":"Snowman Arc","date":"2018-05-01T09:31:10.602+0000","up_votes":3,"down_votes":0,"body":"Did you even read my whole argument? I said she's a mid game god, because she can slaughter anyone. Later in the game where everyone groups, it's so much harder to assassinate anyone.","replies":[{"poster":"OatheSworn","date":"2018-05-01T10:55:16.996+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Snowman Arc,realm=EUNE,application-id=3ErqAdtq,discussion-id=QrvXR9t4,comment-id=00060001000000000000,timestamp=2018-05-01T09:31:10.602+0000)\n>\n> Did you even read my whole argument? I said she&#x27;s a mid game god, because she can slaughter anyone. Later in the game where everyone groups, it&#x27;s so much harder to assassinate anyone.\n\nExcept did you read _**my**_ argument? I said that she can kill anyone that's slightly squishy almost instantly and then disappear into her shroud. Alls she has to do now is wait for her team to cover for her and go back in once the enemy is focused on her teammates. Sure it might be a slight bit more difficult to kill anyone if they are grouped but that just raising the difficulty from \"utterly braindead\" to \"slightly braindead.\" Once she jumps on the ADC, it's either she has enough damage and kills the target or she doesn't and dies.","replies":[{"poster":"Snowman Arc","date":"2018-05-01T11:04:04.957+0000","up_votes":3,"down_votes":2,"body":"Still, you depend on your team being there to take the focus off you. A lot of times, you don't have a team, even at late game. Late game, you MUST have a team, while mid-game, you don't, if you want to kill people.","replies":[{"poster":"OatheSworn","date":"2018-05-01T11:20:03.450+0000","up_votes":3,"down_votes":3,"body":"> [{quoted}](name=Snowman Arc,realm=EUNE,application-id=3ErqAdtq,discussion-id=QrvXR9t4,comment-id=0006000100000000000000000000,timestamp=2018-05-01T11:04:04.957+0000)\n>\n> Still, you depend on your team being there to take the focus off you. A lot of times, you don&#x27;t have a team, even at late game. Late game, you MUST have a team, while mid-game, you don&#x27;t, if you want to kill people.\n\nI'm pretty sure late-game, _**everyone**_ needs their team if the enemy is grouping up for a teamfight. Your point isn't valid because that's the norm...","replies":[{"poster":"Snowman Arc","date":"2018-05-01T11:35:21.803+0000","up_votes":3,"down_votes":2,"body":"Akali is completely useless though. An ADC can somehow manage to get autos off, kite around and do something useful. Akali must wait for her team to do something first, and also her team must be enough of a threat to be worthy of focus.","replies":[{"poster":"OatheSworn","date":"2018-05-01T12:19:27.432+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Snowman Arc,realm=EUNE,application-id=3ErqAdtq,discussion-id=QrvXR9t4,comment-id=000600010000000000000000000000000000,timestamp=2018-05-01T11:35:21.803+0000)\n>\n> Akali is completely useless though. An ADC can somehow manage to get autos off, kite around and do something useful. Akali must wait for her team to do something first, and also her team must be enough of a threat to be worthy of focus.\n\nIf Akali kills the ADC and disappears, their main damage is basically gone. It becomes a 4 v 4 (until Akali is back in action) but enemy doesn't have ADC. Dunno about you but Akali was always the engage and it was this strategy that was rinse and repeat.\n\nPS: Are you upvoting yourself via alts and downvoting me? You always have 3 upvotes with me at -2 in our back-and-forth bickering...kind of suspicious don't you think?\n","replies":[{"poster":"Snowman Arc","date":"2018-05-01T12:58:14.236+0000","up_votes":1,"down_votes":0,"body":"That's what I'm saying. If the enemy team is grouped and not complete monkeys, you won't kill the ADC.\n\nEDIT: No, the upvotes are probably by my friend who I showed this thread to prove a point to him.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Votable Jester","date":"2018-04-30T16:55:25.089+0000","up_votes":3,"down_votes":2,"body":"How do you bait her R?  If she Rs you, she hits you with it unless you have something to interrupt the dash.\n\nIf you're just expecting her to R you when you're actually in a safe position, that's just saying she has to be bad at Akali.\n\nYou just gave anecdotal evidence from a game where the enemy team countered you fairly well and your own team was bad.","replies":[{"poster":"cocacolalips","date":"2018-04-30T17:05:52.370+0000","up_votes":3,"down_votes":1,"body":"akali R puts her behind you, always, it's predictable, you can use that information to your advantage, saving your cc as she dashes then disengaging or killing her.\n\nif you are lux for example, you poke with E-AA, if she tries to R you, you Q behind you, then either a full QWER combo or just walk away toward your turret.\n\nthat's why akali mid lane is bad, pretty much every mage dumps on her, either with aoe spells or cc, she is too easily countered.","replies":[{"poster":"sphinxthelion7","date":"2018-04-30T17:11:57.119+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=cocacolalips,realm=NA,application-id=3ErqAdtq,discussion-id=QrvXR9t4,comment-id=000600000000,timestamp=2018-04-30T17:05:52.370+0000)\n>\n> akali R puts her behind you, always, it&#x27;s predictable, you can use that information to your advantage, saving your cc as she dashes then disengaging or killing her.\n> \n> if you are lux for example, you poke with Q-AA, if she tries to R you, you Q behind you, then either a full QWER combo or just walk away toward your turret.\n> \n> that&#x27;s why akali mid lane is bad, pretty much every mage dumps on her, either with aoe spells or cc, she is too easily countered.\n\nexactly.","replies":[]}]},{"poster":"Snowman Arc","date":"2018-04-30T19:03:25.122+0000","up_votes":2,"down_votes":1,"body":"You can try to poke her down consistently, to the point where she has to force some all-in, that's how you bait her Rs.\n\nAlso, games like these aren't really uncommon. ADC buying GA vs a fed assassin is common, supports who can protect someone with shields are also common (Zilean has revive, which is not ALWAYS better), Tryndamere has his R, but there are other champions who can go tanky and not die to Akali in the first place.\n\nIn any case, Akali is dog shit late game, when everyone is clumped up. If your ADC isn't a threat and the only focus is you, then you're gonna have a bad time as Akali.","replies":[]}]}]},{"poster":"iMutedYouAll","date":"2018-05-06T00:08:35.154+0000","up_votes":3,"down_votes":0,"body":"akali is stupid period. there is nothing more or less to say. shes just plain stupid.","replies":[]},{"poster":"Fear the Kayn","date":"2018-05-01T06:05:39.710+0000","up_votes":2,"down_votes":0,"body":"She would be balanced if her W was just flat out removed and replaced with something else. Shes waaaay too safe right now tbh.","replies":[]},{"poster":"Velzard of Koz","date":"2018-04-30T17:08:19.820+0000","up_votes":2,"down_votes":0,"body":"If anyone guessed right he vented after losing lane and game against her, I'll save your searching:\n\nhttps://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2773405772/243066155?tab=overview\n\nAlso, she is getting reworked.","replies":[{"poster":"OatheSworn","date":"2018-05-01T04:16:30.214+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Velzard of Koz,realm=EUNE,application-id=3ErqAdtq,discussion-id=QrvXR9t4,comment-id=000b,timestamp=2018-04-30T17:08:19.820+0000)\n>\n> If anyone guessed right he vented after losing lane and game against her, I&#x27;ll save your searching:\n> \n> https://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2773405772/243066155?tab=overview\n> \n> Also, she is getting reworked.\n\nNo need, I'll just post the scores:\nI went 3/9/4 and Akali went 14/4/5\n\nI had 0 chance and just got 'dozed on after the Rek'Sai ganked at 3 or so minutes into the game.","replies":[]}]},{"poster":"Kyaza","date":"2018-04-30T04:07:59.785+0000","up_votes":1,"down_votes":2,"body":"just play Anivia, she uses W in lane? no prob just ult her W.","replies":[{"poster":"OatheSworn","date":"2018-04-30T05:34:34.506+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Kyaza,realm=NA,application-id=3ErqAdtq,discussion-id=QrvXR9t4,comment-id=0002,timestamp=2018-04-30T04:07:59.785+0000)\n>\n> just play Anivia, she uses W in lane? no prob just ult her W.\n\nDon't have her unfortunately because I'm terrible at her","replies":[{"poster":"Kyaza","date":"2018-05-01T02:59:28.321+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HigherTier,realm=NA,application-id=3ErqAdtq,discussion-id=QrvXR9t4,comment-id=00020000,timestamp=2018-04-30T05:34:34.506+0000)\n>\n> Don&#x27;t have her unfortunately because I&#x27;m terrible at her\n\nyou should give her another try, I find she is a really strong pick that often falls though the ban cracks because she isnt very flashy.","replies":[]}]}]},{"poster":"Kuwabaramulberry","date":"2018-04-30T20:12:09.012+0000","up_votes":1,"down_votes":0,"body":"(I've been drinking so excuse my lack of the \"reply\" function)\nBut how is malz a good matchup into Akali? Seems like it would be fuggin impossible/meaningless to land Q on her, and his laning phase is so atrocious with mana that wasting E on champ poke instead of the mana gain from minion bounces sounds terrible. Plus the point and click Q sounds like it would be hell for malzahar. And any Akali with half a tit would know better than to dash into a malzahar with ult up. She would just feed off his bot lane after she got 6","replies":[{"poster":"nm1010","date":"2018-05-01T13:16:30.386+0000","up_votes":1,"down_votes":0,"body":"Malzahar's pushing power is what counters a lot of assassins, pre 6 few assassins can threaten him so he can afk push into tower meaning they typically go down in cs. With one item he can spam voidlings almost constantly to make taking your tower off a roam VERY easy. In team fights he can press r whenever you go in and he builds fairly tanky so he is also hard to actually kill even if you have qss.","replies":[{"poster":"OatheSworn","date":"2018-05-05T22:27:34.952+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=nm1010,realm=NA,application-id=3ErqAdtq,discussion-id=QrvXR9t4,comment-id=000e0000,timestamp=2018-05-01T13:16:30.386+0000)\n>\n> Malzahar&#x27;s pushing power is what counters a lot of assassins, pre 6 few assassins can threaten him so he can afk push into tower meaning they typically go down in cs. With one item he can spam voidlings almost constantly to make taking your tower off a roam VERY easy. In team fights he can press r whenever you go in and he builds fairly tanky so he is also hard to actually kill even if you have qss.\n\nI hate that guy too.","replies":[]}]}]},{"poster":"nm1010","date":"2018-05-01T13:09:36.786+0000","up_votes":1,"down_votes":0,"body":"Play Caitlyn, place a trap ~50 units behind you when Akali uses r, boom headshot, e q combo, boom headshot, if not dead put another trap behind you, boom headshot, and Akali is now dead before doing anything.","replies":[]},{"poster":"5050BS","date":"2018-04-30T17:02:08.095+0000","up_votes":1,"down_votes":0,"body":"Play Swain vs here and take Bone Plating.  Maybe even Resolve as your primary (I dont but it could help)\n\nBuild HPs and just make her not able to kill you with her combo.  All your spells are AOE and hit her in her shroud.  She will always have to run.","replies":[]},{"poster":"Blåbæret","date":"2018-04-30T15:41:43.923+0000","up_votes":1,"down_votes":0,"body":"She's a drain tank.","replies":[]},{"poster":"cocacolalips","date":"2018-04-30T11:28:26.386+0000","up_votes":1,"down_votes":0,"body":"it's your zed vs akali game?\n\nzed vs akali is a skill/luck match-up, every time you all-in she will use W, now Zed Q and E are AOE spells, and cover a least 50% of the shroud, and if you are lucky and those spells hit her when she is invisible you'll win the trade/all-in, and if you aren't, you'll lose. It's that simple there is no secret.\n\nAOE into the shroud -> win\n\nCC + full combo when she dashes behind you with R -> win\n\nher Q+AA is rather weak, plenty champions have better combo, if your Q+AA is better -> win\n\nif your champion can't do any of the above -> lose\n\nhere a tip btw, akali never stands in the middle of the shroud but at the edge of it, so make sure when you cast a spell it touches the shroud's circumference, and she never stands at the same exact spot she was before using the shroud but somewhere else so don't aim where she was before casting the shroud.","replies":[]},{"poster":"TheMysticWar","date":"2018-04-30T08:29:29.687+0000","up_votes":1,"down_votes":0,"body":"I would way now shes ‘ok/bad’ and thanks they are reworking her shes still cancer to play against\nShe was a nightmate E procing Q \n5.2 just finished her off (Rip DFG)","replies":[]}]}