{"poster":"BNX EkkosOfDeath","date":"2015-11-29T22:54:54.323+0000","title":"Pool Party Gangplank","subforum":"Skin- & Champion-Konzepte","up_votes":3,"down_votes":1,"body":"Hier eine kleine Skin-Idee f&uuml;r unseren Lieblingspiraten Gangplank.\n\nPoolparty Gangplank w&auml;re nat&uuml;rlich ein Sommer Skin und desshalb ist es vielleicht etwas unpassend, dass ich mit dieser Idee Ende November komme, jedoch m&ouml;chte ich euch meine Idee trotzdem einmal vorstellen...\n\n\nPassiv: Feuer wird durch Wasser ersetzt.\n\nQ: Kugel ist eine kleine Wasserkugel mit   &quot;Splash&quot;-Effekt wenn sie trifft.\n\nW: Anstatt einer Orange isst er ein Eis.\n\nE: F&auml;sser sind Bojen, die an der Spitze blinken. Wenn sie explodieren gibt es auch hier einen &quot;Splash&quot;-Effekt. Die Pulverspur zwischen zwei F&auml;ssern ist eine Wasserlinie.\n\nR: Kanonenkugeln sind bunte Wasserballons die mit einem &quot;Splash&quot;-Effekt explodieren, wenn sie aufkommen.\n\nAussehen:\nEr tr&auml;gt einen Strohhut, Badeshorts, ein hell blaues T-Shirt mit einem kleinen Segelschiffchen drauf, eine Sonnenbrille und Flip-Flops.\nSeine Pistole ist eine Wasserpistole und sein Schwert ist ein aufblasbares Entermesser.\n\nRecall:\nGangplank setzt sich auf einen Liegestuhl. Vor ihm ist ein kleines Planschbecken in dem ein Segelschiffchen ist. Er nimmt seine Wasserpistole spritzt das Schiffchen mit Wasser nass und &auml;rgert sich, weil er es nicht versenken konnte.\n\nDas war meine Poolparty-Gangplank Skinidee. Ich hoffe sie gef&auml;llt euch und wenn ihr Verbesserungsvorschl&auml;ge habt schreibt sie mir in die Kommentare und nat&uuml;rlich eure Meinung. \n\nLg\ndasgert02\n:D","replies":[{"poster":"Th3is","date":"2015-11-30T00:59:24.333+0000","up_votes":1,"down_votes":0,"body":"An sich eine witzige und coole Idee, aber ein Gankplank ohne Orangen??","replies":[{"poster":"BNX EkkosOfDeath","date":"2015-11-30T05:42:50.629+0000","up_votes":1,"down_votes":0,"body":"Dachte nur es würde besser zum Pollparty Thema passen ;)","replies":[{"poster":"Tíìmy Turner","date":"2015-12-04T20:18:06.937+0000","up_votes":1,"down_votes":0,"body":"Ja ich finds ne gute idee aber des mit wasser und der passive müssge man nochmal überdenken weils net so ganz passt","replies":[]}]}]},{"poster":"I DrunkenBozz I","date":"2015-12-02T20:15:39.755+0000","up_votes":1,"down_votes":0,"body":"Nice idee ^^","replies":[]},{"poster":"Dutay","date":"2015-11-30T17:52:15.769+0000","up_votes":1,"down_votes":0,"body":"naja er ist nicht umsonst der \"orange eater\". Und orangen am strand sind ja auch ok","replies":[{"poster":"BNX EkkosOfDeath","date":"2015-11-30T21:00:41.362+0000","up_votes":1,"down_votes":0,"body":"Stimmt hast recht ; )","replies":[]}]}]}