{"poster":"blanquitoou","date":"2017-08-20T04:30:44.234+0000","title":"Mi cuenta a sido transferida","subforum":"Problemas Técnicos","up_votes":1,"down_votes":6,"body":"hola que tal hoy por la tarde intente entrar con mi cuenta a jugar en el servidor de LAN y a mencionado que &quot;Tu cuenta se encuentra en proceso de transferencia&quot; cuando yo no e jugado desde hace 6 dias ,por que ah pasado esto ??\r\n\r\nNota:ahora mi cuenta se encuentra en el servior de LAS en el cual puedo entrar sin problemas","replies":[{"poster":"AC Wolf","date":"2017-08-20T13:50:14.456+0000","up_votes":1,"down_votes":0,"body":"hola que tal!, ya intentaste hablar con el soporte de lan? preguntando sobre lo cometido?, en otro caso quizas algun \"compañero y ofamiliar gracioso\" que tenga acceso o de alguna forma se infiltro en tu cuenta completo la transferencia.\n\n* te recomiendo que crees un ticket en el soporte de las preguntando sobre el problema, para crear un ticket solo debes hacer **[Click Aqui](https://support.riotgames.com/hc/es-419/requests/new)**.\n\nante cualquier duda intentare ayudarte.\n\n\n**un abrazo , un saludo! y recuerda....**\n**siempre sigue aullando!** \n**-Wolf**","replies":[{"poster":"blanquitoou","date":"2017-08-20T18:24:33.322+0000","up_votes":1,"down_votes":0,"body":"pues nadie tenia acceso de echo solo tenia en mi cuenta 24 RP y me dijeron que el translado a LAS esta constando solo 1 RP la verdad no se que paso por que aparte del traspaso ah LAS aparecio nidalee en mis campeones comprados :(","replies":[{"poster":"AC Wolf","date":"2017-08-20T21:02:58.011+0000","up_votes":1,"down_votes":0,"body":"también encontré este post [Click aqui](https://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/nUjh97Kw-desconocimiento-sobre-el-cambio-de-regian-he-cometido-un-error) es bastante similar y tienen el mismo problema, como decía el voluntario **martin** intenta contactarte por la herramienta de **chat en vivo** eso te facilitara la situación.\n\n**si necesitas mas ayuda estare aqui para ayudarte, si necesitas comunicarte atravez de algún chat de voz tengo skype ,discord, ts y twitch","replies":[]},{"poster":"AC Wolf","date":"2017-08-20T20:51:32.021+0000","up_votes":1,"down_votes":0,"body":"Eso te lo dijo el soporte o un amigo? Es cierto que el transpaso esta a 1 rp eso era oara festejar que los peruanos tienen una conexión estable en las, pero. Cuando el soporte te contesté vemos que podemos hacer, por el momento te deseo lo mejor y suerte!","replies":[]}]}]},{"poster":"iEban","date":"2017-08-20T10:30:00.813+0000","up_votes":1,"down_votes":0,"body":"No sabría decirte otra cosa más que bienvenido, aunque sea forzosamente.","replies":[]},{"poster":"BlastOfFury","date":"2017-08-20T04:42:34.553+0000","up_votes":1,"down_votes":0,"body":"Buen dia tengo el mismo problema que mi compañero el dia de ayer me encontraba jugando en el servidor de LAN y cuando quise iniciar sesión el dia de hoy ya no  me lo permitió y me marcaba que mi cuenta se encontraba en proceso de transferencia al igual que se han gastado mis puntos de influencia y botin que tenia en la misma cuenta","replies":[]}]}