{"poster":"aCebUu returns","date":"2019-03-28T08:47:10.657+0000","title":"LoL Prepaid Karte gekauft aber leider beim frei rubbeln Code zerstört :(","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Jungs mal eine Frage, wie hoch stehen die Chancen von Riot trotzdem noch das Guthaben zu erhalten? \r\nHabe mir eine PrePaid Karte geholt und habe anscheinend zu fest gerubbelt und somit 2 Zahlen/Buchstaben unleserlich gemacht :(\r\n\r\nMit freundlichen Grüßen","replies":[{"poster":"Shacoláde","date":"2019-03-28T09:09:36.527+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-ahri-1}} \n\nDas ist natürlich blöd  ... hoffe das die Mitarbeiter gnädig sind &lt;3\nWas ich mich trotzdem Frage ist, wenn sie es dir einen Ersatz gewähren \nin wiefern könnte das auch \"missbraucht\" werden?\n\nNur mal angenommen:\nJemand löst sein Prepadekarte ein und denkt sich nun:\n\"Wenn ich nur 2 oder 3 Nummer wegrubble und sage, dass mir das \ngenauso gegangen ist wie bei dir, bekommt er womöglich auch wieder was zurück?\n\nIch hab keine Ahnung wie sehr sich die Nummer auf den Prepadekarten voneinander unterscheiden\noder inwiefern Riot Zugriff auf \"Verwaltung dieser Daten\" hat oder ob es überhaupt erlaubt ist\ndiese zu ersetzen, aber die Frage werd ich mir wahrscheinlich nicht als einziger Stellen","replies":[{"poster":"Necromant","date":"2019-03-28T09:14:03.607+0000","up_votes":1,"down_votes":0,"body":"Ich denke wenn du den Prepaid-Code im Client eingibst wird die Karte in der Datenbank als \"eingelöst\" gewertet. Versucht du das ganze dann nochmal übern Support, werden die sehen \"ahh ist eingelöst\" und werden dir dementsprechend keinen Betrag gut schreiben.","replies":[{"poster":"Shacoláde","date":"2019-03-28T09:26:19.789+0000","up_votes":1,"down_votes":0,"body":"Wo kann man Prepai-Karten überall einlösen? \nIch hab noch nie welche gekauft, aber man kann es doch bei 100erten von Anbietern einlösen oder?\nWenn ein Freund bei Anbieter A die Karte einlöst und ich bei Anbieter B es einlösen will und dafür \n2 oder 3 oder 4, wie auch immer wegrubble, kann es ja keiner mehr erkennen, wie die wirklich Abfolge der Zahlen war.\nWenn nun keiner mehr weiß wie die Orginalennummern waren, wie soll dann festgestellt werden ob sie eingelöst wurde?\nDeswegen kann das Ganze wohl nur auf Kulanz passieren.\nAußer man ist natürlich Sherlock Holmes und vergleicht alle gekauften Karten mit der IP-Adresse der Benutzers und schaut ob eine \nKarte mit der Nummer, in den Ziffern, indem sie übereinstimmen, in der nähe eingelöst wurden.\nAlso wie kullant kann man hier sein, wenn ein gewisses Maß an Ausnutzung vorhanden ist?","replies":[{"poster":"Necromant","date":"2019-03-28T09:29:55.045+0000","up_votes":1,"down_votes":0,"body":"Ich denke so ne Karte hat immer mehrere Nummern. Eine fürs einlösen und eine für ne Art \"ID\".\nUnd beide werden mit ner Datenbank abgeglichen anhand der Codes/ID.\n\nDeswegen z.B. braucht auch jeder Lotto/Tabakladen auch Internet mit. (auch selbst schon dort gearbeitet)","replies":[{"poster":"aCebUu returns","date":"2019-03-28T09:33:55.562+0000","up_votes":4,"down_votes":0,"body":"Jungs der Support hat mich angeschrieben und mir den Code zugesendet :)","replies":[{"poster":"Necromant","date":"2019-03-28T09:35:04.569+0000","up_votes":1,"down_votes":0,"body":"freut mich! :) Viel Spaß damit","replies":[]},{"poster":"Shacoláde","date":"2019-03-28T09:34:54.803+0000","up_votes":1,"down_votes":0,"body":"wunderbar :)\n\nFreut mich für dich!","replies":[]}]},{"poster":"Shacoláde","date":"2019-03-28T09:35:51.803+0000","up_votes":1,"down_votes":0,"body":"> auch selbst schon dort gearbeitet\n\nAch, super. Dann weiß ich nun Bescheid :) Wieder was gelernt","replies":[{"poster":"Necromant","date":"2019-03-28T09:40:22.747+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]}]},{"poster":"aCebUu returns","date":"2019-03-28T09:15:23.342+0000","up_votes":1,"down_votes":0,"body":"Ja das dachte ich mir auch, deshalb hoffe ich mal, dass Sie einsichtig sind :(","replies":[{"poster":"aCebUu returns","date":"2019-03-28T09:24:23.191+0000","up_votes":1,"down_votes":0,"body":"Wie lange dauert es eigentlich ungefähr bis Riot auf so ein Ticket reagiert ?","replies":[{"poster":"Necromant","date":"2019-03-28T09:25:16.929+0000","up_votes":1,"down_votes":0,"body":"Kann bis zu 7 Tage dauern. Je nachdem wie ausgelastet der Support aktuell ist.","replies":[]}]},{"poster":"aCebUu returns","date":"2019-03-28T09:16:29.827+0000","up_votes":1,"down_votes":0,"body":"Aber ich habe auf keinen Fall den Code bereits eingelöst, habe den Code mit einem 5 Cent Stück frei gerubbelt und dabei ist es dann passiert :(","replies":[]}]}]},{"poster":"Pfirsich93","date":"2019-03-28T11:19:17.811+0000","up_votes":1,"down_votes":0,"body":"zu feste rubbeln kenn ich :(","replies":[]},{"poster":"Necromant","date":"2019-03-28T08:48:30.552+0000","up_votes":1,"down_votes":0,"body":"Würde da mal n Supportticket schreiben. Auf der Karte steht bestimmt noch ne andere Nummer drauf, mit der du dich identifizieren kannst beim Support :)","replies":[{"poster":"aCebUu returns","date":"2019-03-28T08:49:26.262+0000","up_votes":1,"down_votes":0,"body":"Habe schon ein Ticket verfasst und ein Bild dazu gesendet :) Hoffentlich habe ich Erfolg :)","replies":[{"poster":"Necromant","date":"2019-03-28T08:49:43.498+0000","up_votes":1,"down_votes":0,"body":"Wird schon! :)","replies":[]}]}]}]}