{"poster":"Chrealith","date":"2017-09-04T08:57:34.206+0000","title":"Neuen Irelia Skin + neue Animation","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":0,"body":"Guten Tag,\r\n\r\nneulich habe ich begonnen in der Top Lane zu spielen und habe da jeden Champion getestet. Darauf hin fand ich das Irelia {{champion:39}} von allen Top Lane Champions am meisten Spa&szlig; macht. Ich habe mir also den Champion genauer angeschaut und suchte diesen nun auf einen neuen Account. Nach vielen Irelia Games beschloss ich mir einen Skin zu kaufen. Da war ich leider entt&auml;uscht da sie keine guten Skins hat. Die einzigen Skins die halbwegs gut aussehen sind Nightblade Irelia und Frostblade Irelia. Alle Irelia Skins haben die gleiche Animation und unterscheiden sich vom Standard Skin fast gar nicht.  Ich wundere warum keine neuen Irelia Skins erscheinen. Vor allem bei Irelia gibt es so viele M&ouml;glichkeiten den Skin zu gestalten wie die Designer es wollen.\r\n\r\nW&uuml;rde mich &uuml;ber einen neuen Irelia Skin + neue Animation freuen\r\n\r\nDanke {{summoner:31}}","replies":[{"poster":"AlieenHD","date":"2017-09-05T13:03:39.589+0000","up_votes":1,"down_votes":0,"body":"Ich präferiere immer noch auf ein Kled skin :p","replies":[]},{"poster":"ouhw","date":"2017-09-04T11:19:02.089+0000","up_votes":1,"down_votes":0,"body":"Ich finde Aviator Irelia  ist der beste Skin im ganzen Game :D","replies":[]},{"poster":"Fresh Dumbeldore","date":"2017-09-04T09:00:44.330+0000","up_votes":1,"down_votes":0,"body":"Bitte hör auf von Irelia zu sprechen, sonst wird sie wieder gespielt und es macht kein Spass gegen sie zu spielen :(\n\nDeshalb nein, wenn sie nicht so nervig wäre, ja","replies":[{"poster":"Roxãs","date":"2017-09-04T09:04:38.301+0000","up_votes":1,"down_votes":0,"body":"Spiel Pantheon^^","replies":[{"poster":"Chrealith","date":"2017-09-04T09:06:01.344+0000","up_votes":1,"down_votes":0,"body":"Der wird von Irelia in der Lane rasiert. Hatte noch nie ein Problem mit Irelia{{champion:39}}  vs Pantheon{{champion:80}} ","replies":[{"poster":"Enderized","date":"2017-09-04T11:18:57.869+0000","up_votes":1,"down_votes":0,"body":"1v1? <.<","replies":[]}]},{"poster":"Fresh Dumbeldore","date":"2017-09-04T09:51:25.333+0000","up_votes":1,"down_votes":0,"body":"Universalschlüssel für alle Probleme","replies":[]}]},{"poster":"Chrealith","date":"2017-09-04T09:04:50.044+0000","up_votes":1,"down_votes":0,"body":"Eine Irelia kann man Kontern indem man sie versteht. Damit meine ich ihre Q zu respektieren und die Sache das sie dich auch mit 10% Leben von 100% auf 0% bringen kann. Glaub mir als Irelia Main hat man es nicht so leicht gegen Spieler die auf sowas achten.","replies":[]}]},{"poster":"Roxãs","date":"2017-09-04T09:02:12.156+0000","up_votes":1,"down_votes":0,"body":"Order of the Lotus Irelia gefällt mir bei ihr am meisten, abgesehen von Frostblade (dat booty tho)\nEin neuer Skin ist immer schwierig je mehr Grund-Animationen ein Champion besitzt.\nWann ein neuer Skin kommt ist ungewiss.","replies":[{"poster":"Chrealith","date":"2017-09-04T09:07:59.454+0000","up_votes":1,"down_votes":0,"body":"Diese Skins sind recht nett jedoch im vergleich zu einer Akali {{champion:84}} sind ihre Skins nichts was man sich unbedingt holen sollte.","replies":[]}]}]}