{"poster":"IceEragon","date":"2019-06-22T10:25:19.008+0000","title":"Scegli Yuumi support? ADC: WE DONT HAVE A SUPP!! :'C","subforum":"Discussioni generali","up_votes":6,"down_votes":1,"body":"Salve,\r\nultimamente sto gicoando Yuumi , mi piace particolarmente.. \r\nvolevo chiedervi capita anche a voi di beccare continuamente ADC che a inizio partita, o perché muoiono in seguito a grab avversari ecc che dicono\r\n\"we dont have a supp!, Yuumi is bad as supp, Yuumi is tr....\" \r\n\r\nOggi una MF ha tiltato semplicemente perché si faceva grabbare ogni tre per due dalla Q di Thresh per poi morire . Ovviamente ho fatto di tutto per salvarla ma giustamente decide di titlare, Ho usato 2 cure/ 3 cura, Scudo passiva, e muore. \r\nLa colpa? Yuumi! Yuumi isnt a supp!\r\n\r\nE' mai possibile che per carriare bisogna prendere solo una morgana e spammare la Q all'infinito per permettere all'adc di prendere una kill altrimenti da solo non riesce? Oppure prendere una Zyra e spammare la E altrimenti con Yuumi non riescono?\r\n\r\nVeramente....\r\nYuumi ha un grande potenziale se usato bene con l'adc, con MF combo ulti è perfetta.. ma vallo a spiegare a queste persone, va a finire che ti becchi pure qualche ban automatico nello spiegare..\r\n\r\nMeglio stare zitti e subire finché non si sale.\r\n\r\nPremetto che ho molto da imparare","replies":[{"poster":"Lexsus01","date":"2019-06-22T10:59:46.649+0000","up_votes":4,"down_votes":0,"body":"Il low elo è un mondo pieno di sorprese. Riescono addirittura a definire yummi un non-support quando basterebbe guardare i LEC per capire che yummi è \"pick or ban\".\nAd ogni modo yummi non te la consiglio a basso elo perché necessita di un team perlomeno decente.\nImmagina di cavalcare un cavallo che zoppica e gareggiare contro un cavallo sano senza fantino. Per quanto storto vada il cavallo senza fantino andrà comunque più veloce di quello che zoppica. \nA basso elo ti consiglio campioni che hanno più impatto nel game per quanto riguarda roaming e danno, quali {{champion:555}} {{champion:143}} {{champion:63}} {{champion:53}} giusto per citarne un paio\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"IceEragon","date":"2019-06-22T12:29:32.364+0000","up_votes":1,"down_votes":0,"body":"Mi sa che hai proprio ragione, dovrò cambiare...","replies":[{"poster":"HΛVOC","date":"2019-06-22T23:07:05.184+0000","up_votes":3,"down_votes":0,"body":"Secondo me non ti conviene lasciarla,sono diamond e troverai sempre team di merda,ti conviene giocarla già da prima e divertirti, è questa la base di League of Legends ,piuttosto quando entri in game muta tutti e basta e quando finisci il game che li hai carryati li mandi a fanculo,non permettere a dei bastardi di non farti divertire","replies":[{"poster":"IceEragon","date":"2019-06-23T08:53:29.499+0000","up_votes":1,"down_votes":0,"body":"Giustamente se io mi trovo bene con un champ, gioco quello, però come dice anche l'altro ragazzo bisogna comunque valutare...","replies":[]}]}]}]},{"poster":"Sichelgaita","date":"2019-06-22T12:31:24.453+0000","up_votes":5,"down_votes":1,"body":"Certo che mi succede, succede con ogni supp ma sopratutto con yuumi. \nIl problema ulteriore di yuumi , percui io faccio il copiaincoll messaggio nel match making \n_> important , dont lose my Q range , is a circle. My E give life but ask mana . My Ris unidirectional . Dont go far or i cant jump (W) on you. and i die. i got no flash.zero armour._\nè che nonostante sia uscita da quasi un mese molti giocatori restano ignoranti e arroganti . L ADC ma non solo , poiche poi nel team fight devi saltare su tanti mates diversi,  NON SA ASSOLUTAMENTE SFRUTTARE il potere della Q nel il suo raggio d azione, il che è estremamente frustrante.. inoltre in ingaggi in cui con una q  una d  e una f, relativamente sfinimento e  ustione, puoi facilmente fare fuori l avversario loro spessissimo disingaggiano . Pretendono poi che gli spammi la E come se fosse acqua e i peggiori ingoranti ti gridano in chat \" TANK ME\" convinti che saltando su di loro gli stai aumentando l armatura..... \n\n\nNOn so per quale miracolo sono arrivata al mio 2 gettone blu con yuumi ma è veramente difficilissimo. Le sole partita soddisfacenti in cui puoi avere anche 40 assist o oltre sono quelle in cui ALMENO 3 membri del team HANNO CAPITO le meccaniche di Yuumi.. altrimenti è strapersa anche senza counter select avversaria. \n\n.... \n\n\n\"Immagina di cavalcare un cavallo che zoppica\" hai trovato la metafora adatta !\n> [{quoted}](name=Lexsus01,realm=EUW,application-id=MJVj50Jw,discussion-id=9GW4FEs4,comment-id=0000,timestamp=2019-06-22T10:59:46.649+0000)\n>\n> Il low elo è un mondo pieno di sorprese. Riescono addirittura a definire yummi un non-support quando basterebbe guardare i LEC per capire che yummi è \"pick or ban\".\n> Ad ogni modo yummi non te la consiglio a basso elo perché necessita di un team perlomeno decente.\n> Immagina di cavalcare un cavallo che zoppica e gareggiare contro un cavallo sano senza fantino. Per quanto storto vada il cavallo senza fantino andrà comunque più veloce di quello che zoppica. \n> A basso elo ti consiglio campioni che hanno più impatto nel game per quanto riguarda roaming e danno, quali {{champion:555}} {{champion:143}} {{champion:63}} {{champion:53}} giusto per citarne un paio\n> {{sticker:slayer-pantheon-popcorn}}\n\n\ne si gioco bronzo ..","replies":[{"poster":"mangialavandini","date":"2019-06-24T07:48:07.097+0000","up_votes":1,"down_votes":0,"body":"Le rune che usi con yuumi sono curiose, mi spiegheresti perchè le usi così? \n\nAnche gli oggetti tipo non  usi **{{item:3174}} **\n\ne metti il {{item:3089}} \n\nse sono OT, puoi anche addarmi\n\n","replies":[{"poster":"IceEragon","date":"2019-06-24T10:12:31.126+0000","up_votes":1,"down_votes":0,"body":"Ciao,\nle rune devo aggiornarle hai ragione.\nPer quanto riguarda gli items non so dove tu abbia visto ma uso sempre in combo empio graal di athene{{item:3174}}  e incensiere ardente{{item:3504}}  , redenzione{{item:3107}} . \nProbabilemente hai guardato nella cronologia nelle prime partire con Yuumi che testavo gli item nelle normal. \nSe guardi tra le partite recenti vedi quali sono gli item che uso...\n\nPoi ho capito che devo aumentare la Q al posto della W.\nInizio game Q, E,\n\nP.S: Se vuoi puoi aggiungermi liberamente =) accetto tutti ^_^","replies":[{"poster":"mangialavandini","date":"2019-06-24T13:27:12.575+0000","up_votes":1,"down_votes":0,"body":"Ciao, sei stato mooooolto cordiale, ma la mia domanda era riferita a Nigelladamascena, noto che usa rune e item sempre nello stesso ordine e modo per ogni game il che è altamente sbagliato, oltre ad averle completamente sbagliate, quindi mi chiedevo se sapesse quello che stava facendo, quindi strategia o semplice ignoranza del champion.\n\nP.S. io ti agg. pure, ma ho problemi attuali con il pc e non riesco a giocarci","replies":[{"poster":"IceEragon","date":"2019-06-25T09:37:08.239+0000","up_votes":2,"down_votes":0,"body":"Ciao!\nScusami, pensavo parlassi dei miei items! Aahahah, scusami ancora!\n\nVabbene, quando vuoi mi aggiungi se vuoi! =)","replies":[]}]}]},{"poster":"Sichelgaita","date":"2019-06-25T14:24:00.957+0000","up_votes":1,"down_votes":0,"body":"ciao Mangia lavandini!\nallora, questa carissima gattina dalla morte facile, la gioco per il momento cosi, \nmetto sfinimento, metto ignite, parallizzo e brucio lo stesso nemico o blocco e spavento se siamo in fuga.. classico.. dando un senso alle spell a seconda dell urgenza. \nL ostacolo al problema degli item sempre identici è nella mia mente, ossia trovare un adc o un qualcuno per uscire dal sistema \"solo duo\" ( SOLO!) e poter fare affidamento su un taxxista affidabile con lei . Taxista nel senso che non compro mai le scarpe ne item di mobilita dal momento che per me il posto di un gatto è sulle ginocchia del suo umano o a graffire la faccia a gli sconosciuti...   e yuumi ci riesce alla perfezione.. per questo mi piace arrivare al momento classico del teamfight con oltre 500 di danno magico un filo di vita e zero armatura ma al sicuro sul mio champ , con una q che one shotta e una r che permette a chiunque dei miei assassini, adc o combattenti su cui miagolo di farsi una quadra o una penta..  ... inoltre parto dal principio che se faccio danno feedo i miei compagni , spavento gli avversari, il che in bronzo ancora funziona( cè molta psicologia nella tattica) ...  e la w e la passiva bastano e avanzano per dare vita a tutti... almento nel late.. \n\ninizialmente feci i primi 4 livelli di yuumi con potenziamento glaciale... ma finivo sempre col chiedere di aiutarmi a fare un buff blu quando nel late dovevo rianimare 5  persone conla e. ... ( un po non sapevo usare la passiva un po veramente dovevo allattarli tutti come micetti) .. sorvegliante...oppure con aery come prima runa , ma provo piu soddisfazione con cometa arcana e rapidita / precisione per le rune secondarie. o letalita..  aery da piu protezione all aleeato attivando la e , io penso che una mela cometa che cade in testa al avversario in fuga sia piu pratica con un champ che non puo permettersi di rincorrere e divare da solo ed è totalemtne COODIPENDENTE da gli altri giocatori in squadra. ( gank o adc che diva) \n\n\nin genere se nel team \"sanno usare yuumi\" va alla grande anche senza redenzione o altri item di supporto/utilità. \n\n\npenso davvero che si giocherebbe benissimo lulu adc e yuumi supp tanto è perfetta. \n\ncerto ho molto da imparare , il problema della vita cosi piccola e fragile , la mobilita ridotta non ti permettono di spostarti per fare visione se non che autospammandoti la e per  trottare via... \n\nyuumi sola non ha molto senso.\ndiciamo che il danno magico alto ho cominciato ad usarlo perche nel mio stile di gioco tendo a vagare in mappa ( evidentemente il mio errore sta la ) per dare visione e coprire tutti gli alleati non solo la bot line e trovo frustrante che molti non sappiano portarmi dove serve quindi avere poiu danno mi cpncede la possibilita anche scendendo da cavallo di fare danno con una q unidirezionale e scappare..","replies":[]}]},{"poster":"IceEragon","date":"2019-06-22T12:36:38.752+0000","up_votes":1,"down_votes":0,"body":"Eh sì hai proprio ragione, la passiva ricarica il mana che viene speso per la cura... e a inizio game mi è capitato molte volte che quando usavo la Q l'ADC tornasse indietro..\nYuumi ha meccaniche diverse rispetto ad altri supp, però un po' di volontà nel capire come funziona.. e non già a inizio game \"NON ABBIAMO IL SUPPORT\"..","replies":[{"poster":"Sichelgaita","date":"2019-06-22T12:41:41.742+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=IceEragon,realm=EUW,application-id=MJVj50Jw,discussion-id=9GW4FEs4,comment-id=00020000,timestamp=2019-06-22T12:36:38.752+0000)\n>\n> Eh sì hai proprio ragione, la passiva ricarica il mana che viene speso per la cura... e a inizio game mi è capitato molte volte che quando usavo la Q l'ADC tornasse indietro..\n> Yuumi ha meccaniche diverse rispetto ad altri supp, però un po' di volontà nel capire come funziona.. e non già a inizio game \"NON ABBIAMO IL SUPPORT\"..\n\nGuarda odio essere disfattista ma non so a te , ma a me capita dal match making di capire che una partita sara persa.. non solo dai champ seleizonati ma dalla chat.. e quando vedi che la gente non seleziona mai un counter per yuumi puoi stare sicuro che andra male poiche questa mancanza d informazioni c è sia in un senso ( yuumi in squadra) che nell altro ( yuumi nemica) .","replies":[{"poster":"IceEragon","date":"2019-06-22T12:46:24.763+0000","up_votes":2,"down_votes":1,"body":"Il problema è che molti non sanno come \"combinare\" e \"adattare\" le proprie skill/combo/meccaniche con il proprio Support/ADC.\n\nYuumi ha una passiva che ti da scudo , giusto? Bene fai modo di avere quello scudo presente! \nYuumi ha una ulti che blocca , pinga quando stai per ultare e usate una combo insieme!\n\nOvviamente nessuno pinga, l'adc 0 visione nemica, il mid dimentica di pingare, lo jungler non ti aiuta se la lane è in svantaggio (ma queste sono cose che capitano in tutti i match)\n\nDi solito tendo a dare un occhio ovunque.. pingo quando è necessario, pingo per chi non pinga.. insomma un tutto fare LOL.","replies":[]}]}]}]},{"poster":"Sad Principino","date":"2019-06-23T10:02:26.159+0000","up_votes":3,"down_votes":0,"body":"Te lo spiego io bro:\n\nDa main adc i giocatori di Yuumi mi fanno tiltare perchè con il fatto che sono praticamente immortali hanno una scusa per addossare la totale responsabilità dell'esito della lane su di te quando poi loro si limitano ad attaccarsi a te giocando in maniera super passiva. Questo sommato alla tendenza dei jungler a snobbare la botlane e sommato al fatto che la gente sta iniziando a capire come giocare contro Yuumi rende la vita degli adc un po' frustrante perchè giocare con una Yuumi passiva significa letteralmente fare 1v2.\n\nDato che Yuumi è un champion dal potenziale offensivo quasi illimitato e dal playstyle aggressivo che potenzialmente può essere davvero tanto opprimente per la botlane nemica quello che fa tiltare sono i giocatori passivi di Yuumi, il che si può tradurre con: i giocatori che non la sanno giocare ma che con il fatto che non possono morire scaricano su di te la colpa dicendo che hai un positioning scadente. Spero converrai con me però che senza un minimo di counterplay Alistar e Blitzcrank se ne fregano se camperi sotto torre e ti zonano da tutto il farm del mondo.\n\nQuesti sono i motivi per cui vedere Yuumi in champ select è sempre un cinquanta e cinquanta poco incoraggiante. E' un champ molto forte ma bisogna saperlo giocare.","replies":[]},{"poster":"Øne Trick Pony","date":"2019-06-23T10:55:02.244+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=IceEragon,realm=EUW,application-id=MJVj50Jw,discussion-id=9GW4FEs4,comment-id=,timestamp=2019-06-22T10:25:19.008+0000)\n>\n> Salve,\n> ultimamente sto gicoando Yuumi , mi piace particolarmente.. \n> volevo chiedervi capita anche a voi di beccare continuamente ADC che a inizio partita, o perché muoiono in seguito a grab avversari ecc che dicono\n> \"we dont have a supp!, Yuumi is bad as supp, Yuumi is tr....\" \n> \n> Oggi una MF ha tiltato semplicemente perché si faceva grabbare ogni tre per due dalla Q di Thresh per poi morire . Ovviamente ho fatto di tutto per salvarla ma giustamente decide di titlare, Ho usato 2 cure/ 3 cura, Scudo passiva, e muore. \n> La colpa? Yuumi! Yuumi isnt a supp!\n> \n> E' mai possibile che per carriare bisogna prendere solo una morgana e spammare la Q all'infinito per permettere all'adc di prendere una kill altrimenti da solo non riesce? Oppure prendere una Zyra e spammare la E altrimenti con Yuumi non riescono?\n> \n> Veramente....\n> Yuumi ha un grande potenziale se usato bene con l'adc, con MF combo ulti è perfetta.. ma vallo a spiegare a queste persone, va a finire che ti becchi pure qualche ban automatico nello spiegare..\n> \n> Meglio stare zitti e subire finché non si sale.\n> \n> Premetto che ho molto da imparare\n\nCiao :)\n\nSono un Main support da 4 stagioni (blitz, thresh e Lux) e, quando yuumi è arrivata nella landa è stato amore a prima vista. Ho raggiunto quasi i 100 game, la maestria 7 in 3 giorni e la posizione 98 in due e 300 nel mondo con questo campione (prima di andare in vacanza). \n\nDopo così tanti game ed un win rate del 68% voglio permettermi di darti un consiglio. \n\nSe l'adc non ha le mani ignorarlo.\n\nPassa la lane phase e segui la persona che sembra avere maggiori abilità in fight oppure collegati ad un tank per fare un casino xD \n\nLa gente continua a fare un errore enorme su questo gioco.\n\nIl support NON È DELL'ADC! \n\nTu sei il supporter del tuo team!","replies":[]},{"poster":"Malygos","date":"2019-06-22T20:08:25.909+0000","up_votes":2,"down_votes":0,"body":"Guarda, ti parlo da main adc low elo (s2). A mio parere dipende anche da come la giochi. Una sola volta mi è capitato di avere una yuumi che mi ha fatto sentire come se non fossi da sola. La questione è che stando costantemente sull'adc gli avversari si possono concentrare su un unico target e se si viene gankati pre 6 l'univa cosa che yuumi può fare è una Q pre lo slow su un target su 3. Sicuramente peggio di un peeling di trash,  pyke o dei danni ingenti di brand, lux, Morgana che ti permettono addirittura di fightare e vincere. In ogni caso son contenta lo stesso se la pickano. Se ben giocata è molto forte ma secondo me funziona meglio nelle lane poke premade.","replies":[{"poster":"koore","date":"2019-06-23T05:18:19.030+0000","up_votes":2,"down_votes":0,"body":"A dire il vero pre 6 ti offro comunque una ottima possibilità di salvarti. Devi sempre ricordare che il ruolo del support è anche quello di dare visione per evitare i gank, inoltre può dare sia un boost alla velocità che uscire allo scoperto per darti lo scudo successivamente. C'è da dire che non appena yuumi esce dal suo compagno, il team nemico ha un attimo di esitazione perché potrebbe tentare di colpire yuumi in una apparente posizione di svantaggio","replies":[]},{"poster":"IceEragon","date":"2019-06-23T08:55:09.878+0000","up_votes":1,"down_votes":0,"body":"Hai ragione sicuramente funziona meglio nei premade!","replies":[]}]},{"poster":"Not troll pls xP","date":"2019-06-23T20:15:01.488+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IceEragon,realm=EUW,application-id=MJVj50Jw,discussion-id=9GW4FEs4,comment-id=,timestamp=2019-06-22T10:25:19.008+0000)\n>\n> Salve,\n> ultimamente sto gicoando Yuumi , mi piace particolarmente.. \n> volevo chiedervi capita anche a voi di beccare continuamente ADC che a inizio partita, o perché muoiono in seguito a grab avversari ecc che dicono\n> \"we dont have a supp!, Yuumi is bad as supp, Yuumi is tr....\" \n> \n> Oggi una MF ha tiltato semplicemente perché si faceva grabbare ogni tre per due dalla Q di Thresh per poi morire . Ovviamente ho fatto di tutto per salvarla ma giustamente decide di titlare, Ho usato 2 cure/ 3 cura, Scudo passiva, e muore. \n> La colpa? Yuumi! Yuumi isnt a supp!\n> \n> E' mai possibile che per carriare bisogna prendere solo una morgana e spammare la Q all'infinito per permettere all'adc di prendere una kill altrimenti da solo non riesce? Oppure prendere una Zyra e spammare la E altrimenti con Yuumi non riescono?\n> \n> Veramente....\n> Yuumi ha un grande potenziale se usato bene con l'adc, con MF combo ulti è perfetta.. ma vallo a spiegare a queste persone, va a finire che ti becchi pure qualche ban automatico nello spiegare..\n> \n> Meglio stare zitti e subire finché non si sale.\n> \n> Premetto che ho molto da imparare\nOnestamente è vero che Yuumi è un Champ forte e ti può carriare la partita se giocata correttamente. Però se posso dire la mia, in quanto al momento sto giocando molto da adc, sono 2 le cose che non mi piacciono di questo champ:\n1: a volte sembra quasi di giocare da solo in lane perché l impressione (parere personale) è che ci sia un vero e proprio vuoto fisico nella botlane e sembra veramente di stare da soli in lane soprattutto, come qualcuno ha già detto, il support gioca passivo.\n2: la gente che first picka Yuumi. Il mio umile parere è che questo non è un Champ da first Pickare perché questo aumenta drasticamente le probabilità di perdere pesantemente la lane e sinceramente credo sia difficile per il support affidarsi totalmente alle capacità dell adc e se l adc sbaglia e viene punito è flame assicurato per il support. \nGood support win the lane, good adc win the game","replies":[]},{"poster":"Sαmsey","date":"2019-06-23T12:00:55.614+0000","up_votes":0,"down_votes":0,"body":"Una buona parte della lane con Yuumi lo fa il pick dell'adc. Nei commenti sotto qualcuno ha scritto che negli LEC è pick or ban, ma se ci fai caso viene quasi sempre presa in coppia con Ezreal o Sivir, qualche volta con Xayah (e una volta con Pyke, belli i G2). Questo perché Sivir ed Ezreal sono pick molto safe che hanno molto potenziale di poke e non hanno problemi a farmare dalla distanza. Con pick come Vayne (per esempio) non funziona molto bene.\n\nA parte tutto questo discorso, se stai giocando contro Nautilus fai un favore al tuo adc e non pickare Yuumi, purtroppo Nautilus ha troppi scudi e troppi controlli semplici da applicare per giocare Yuumi.","replies":[{"poster":"Luckynanix","date":"2019-06-23T16:47:15.335+0000","up_votes":1,"down_votes":0,"body":"Oppure, se vuoi giocare Yuumi, bannate Nautilus","replies":[]}]},{"poster":"DemonShockZ","date":"2019-06-22T22:18:18.884+0000","up_votes":1,"down_votes":1,"body":"Gioco da poco, ma è inutile dire che la prima cosa che mi hanno detto di questo gioco è \"la community è un cancro\" ed hanno pienamente ragione, non tanto per il flame, ma per il fatto che la gente spesso e volentieri non abbia un cervello funzionante e non capisca nulla (stesse persone che ti impediscono di scalare i ranghi o più semplicemente vincere le partite). Abituaciti, tanto lo staff Riot potrà combattere gli insulti ma non la stupidità... Mutali e basta... O flamma, tanto non bannano mai.","replies":[{"poster":"IceEragon","date":"2019-06-23T08:56:50.138+0000","up_votes":1,"down_votes":0,"body":"Io semplicemente muto, più di tanto ormai..non sto lì a discutere xD","replies":[]}]},{"poster":"XPY99","date":"2019-06-22T23:57:26.318+0000","up_votes":1,"down_votes":0,"body":"Semplicemente yumi non è un campione da giocare da soli, neanche a elo medio, va giocata o in duo con un adc o direttamente in team organizzati, è uno di quei campioni che dipende troppo dal team e soprattutto dalla comunicazione","replies":[{"poster":"IceEragon","date":"2019-06-23T08:56:01.447+0000","up_votes":1,"down_votes":0,"body":"E' vero, necessita di molta comunicazione, sicuramente più di altri champ!","replies":[]}]},{"poster":"HarlequinIT","date":"2019-06-23T06:31:06.205+0000","up_votes":1,"down_votes":0,"body":"Devo dire che anche se sono basso elo, quando gioco yummi (com'è ovvio che sia per un supp completo come lei) devo fare tutto io mentre gli alleati devono solo attaccare\nTi dico un paio di cose :\nGioca sempre safe con il tuo adc e poka sotto la tua torre poi con la ulti quando il supp nemico sta pushando riduci la sua wave a 3/4 minions e usa la R sia per colpire il nemico sotto torre così da bloccarlo(con la passiva dei 3 colpi) sia per farmare i minion nemici così lui si prenderà colpi di torre gratis(essendo rimasto sotto torre da solo) e tu o il tui adc una kill \nPer migliorare usa incantesimi come {{summoner:3}} {{summoner:14}}","replies":[{"poster":"IceEragon","date":"2019-06-23T08:54:21.003+0000","up_votes":1,"down_votes":0,"body":"Grazie mille per il consiglio! =)","replies":[]}]},{"poster":"ELiT3R","date":"2019-06-22T13:58:47.656+0000","up_votes":1,"down_votes":0,"body":"Io ho giocato circa 3 volte con un Yuumi come mio support e posso dire che e difficle coordinarsi con Yuumi. Innanzi tutto se lui utilizza la Q in un certo senso l'ADC si espone per cercare di entrare in range di un nemico e permettere a Yuumi di colpire il nemico. Il problema esponendosi e che la l'ADC (essendo praticamente solo in lane con Yuumi in E) ha piu probabilita di essere grabbato o immobilizzato essendo per l'appunto l'unico ed essendosi esposto al range avversario. In pratica ne immobilizzano 2 in 1. In low elo (dove il positioning non esiste praticamente xD) e facilissimo che questo ADC venga preso dal support avversario e la prima cosa a cui puo dare la colpa (e non ha effettivamente tutti i torti) e Yuumi perche per di piu una volta presi Yuumi non puo fare moltissimo per aiutare il proprio ADC immobilizzato perche ha zero disengage. In alto elo sono sicuramente piu coordinati e in team ancora di piu quindi la ovviamente funziona molto bene. Per di piu tutti gli Yuumi che ho trovato wardavano poco perche restavano insieme all'ADC. Comunque ricapitonado come ADC posso dire che effettivamente quando ho Yuumi support trovo nelle prime fasi di partita una enorme difficolta. Nel mid game e late game invece e molto piu forte secondo me.","replies":[]},{"poster":"Sichelgaita","date":"2019-06-22T13:03:36.991+0000","up_votes":1,"down_votes":0,"body":"Senti se sei elo bronzo e ti consideri n buon supp  bronzo del genere MVP o ACE nelle statistiche opgg io non sono eccelletne come adc ma possiamo provare a imparare insieme.. Come supp anche io faccio visione costante, prevedo ogni mossa e la pingo perche anche se gioco da un anno gioco massivamente per giornate intere ma senza uscirne poiche le situazioni come supp si ripetono, ed è cio di cui qui parli e imparare altri ruoli non mi si confa poiche ho sempre la tendenza a voler mettere visione sul drago poiche nessuno lo fa , \nse gioco top o mid nelle statistiche finali arrivo sempre pari o maggiore come vision score del supp , con una frustrazione enorme , \n\nanche se ho pochi danni in altre line in genere ne ho molti come supp . \nquindi se ti va possimao provare ogni tanto a giocare io adc e tu supp.. \n\nCon yuumi ho visto delle combo bellissime con kaysa, zed, yasuo, sivir , e chogmag.. fuori line con irelia si gioca benissimo.. Con champ che hanno molto movimento o comunque possibilita di occupare spazio sul terreno con trappole o scie velenose in modo da controllare lo spazio di movimento della avversario . \n\nNon l ho mai provata su zyra .. con lei ad esempio penso che si giocherebbe bene dal momento che puo posizionare i fiori dove vuole.  e credo che la combo zyra e e yuumi q sia da provare. \n..chiacchiere.. \nalmeno in bronzo si puo .. \nCredo che yuumi sia il genere di supp talmente supp che puo trasformare chiunque sappaia sfruttarla in adc.","replies":[]},{"poster":"liberodaniele","date":"2019-06-22T12:53:53.405+0000","up_votes":1,"down_votes":0,"body":"Sinceramente il \"va a finire che ti becchi pure qualche ban automatico nello spiegare..\" mi lascia perplesso. Spieghi come il protagonista di \"basta che funzioni\"?","replies":[]},{"poster":"Sichelgaita","date":"2019-06-22T12:43:41.848+0000","up_votes":1,"down_votes":0,"body":"personalmente con zyra non spammo la e , ma la q e con morgana spammo la e .. \nopinioni..","replies":[{"poster":"IceEragon","date":"2019-06-22T12:48:17.358+0000","up_votes":1,"down_votes":0,"body":"SìSì hai ragione , A inizio game aumento la E di zyra, con morgana sì spammi la E, ho sbagliato io.\nIo intendevo dire che per permettere a molti ADC di fare un paio di KILL devi concludere sempre una Q di morgana o una E di zyra altrimenti buonanotte...","replies":[]}]},{"poster":"Dantazzo","date":"2019-06-22T20:43:29.296+0000","up_votes":1,"down_votes":8,"body":"Non ho letto nulla ma ha ragione l'adc. O sei challenger o giochi uno in meno.","replies":[{"poster":"Luckynanix","date":"2019-06-23T08:25:51.942+0000","up_votes":2,"down_votes":0,"body":"Non è vero tante volte con yuumi salvi il game continuando a curare e sloware\nLa lane se te la giochi bene è veramente oppressiva fai conto che una q fa 200 di danno al rank 3 (ovvero livello 5)\nÈ un champ da late e da poke/teamfight\nPoi per il fatto che l'ADC continui a farsi grabbare qualsiasi support ci può fare poco (e lo dico da main Thresh 3 grab su 4 vanno sempre a segno sugli ADC)\nSe si gioca yuumi io consiglio di identificare il carry del team e, finita la corsia, stare con lui","replies":[]},{"poster":"Vileblood Pyke","date":"2019-06-23T21:40:10.132+0000","up_votes":1,"down_votes":1,"body":"https://i.imgflip.com/2fsoih.jpg?a430176","replies":[]}]},{"poster":"TZombi1234","date":"2019-06-22T11:20:11.096+0000","up_votes":2,"down_votes":3,"body":"Dipende, che elo sei?","replies":[]}]}