{"poster":"Soulsplitter1234","date":"2015-08-05T14:51:15.104+0000","title":"Diskusion zum Morde-Rework","subforum":"Skin- & Champion-Konzepte","embed":{"description":"This is a W ORK I N P ROGRESS POST. This is going to be a big one.][ Status: The PBE currently still down for maintenance.] To start the 5.16 PBE cycle we have a MASSIVE update! Continue reading for more information!","url":"http://www.surrenderat20.net/2015/08/84-pbe-update.html","image":"http://3.bp.blogspot.com/-M_ecJWWc5CE/Uizpk6U3lwI/AAAAAAAACLo/xyh6eQNRzzs/s640/sitethumb.jpg"},"up_votes":4,"down_votes":0,"body":"Liebes Rito-Team, liebe LoL-Kollegen,\r\nauf den Testservern befindet sich der momentan neuste Rework zu Mordekaiser und Ich muss sagen bis jetzt bin ich mit den &Auml;nderungen ziemlich unzufrieden.\r\nIch habe ab der Season 3 mit LoL angefangen und Mordekaiser war einer der ersten Champions, die ich gespielt habe. Mordekaiser ist mein Main-Champion und er ist unter anderem auch der Hauptgrund weshalb ich Main-Midlander bin. Um so trauriger stimmte es mich, dass Mordekaiser jetzt von der Midlane verbannt werden soll.\r\n\r\nDabei hat Morde im Febuar/M&auml;rz schon mal eine leichte &Uuml;berarbeitung erlebt, die seine AD-Skallierungen reduziert und seine Ulti f&uuml;r AD-Mordekaiser sinnlos gemacht hat. Mit dem jetzigen Rework wird Mordekaiser jedoch in die Rolle des mehr AD-lastigen Hybriden gesteckt. Ich habe ihn bereits auf dem PBE gespielt und finde es schade, dass ein &quot;Juggernaut&quot; wie er auf eine Duo-lane geschickt wird.\r\n\r\nGehen wir mal seine F&auml;higkeiten durch:\r\nPassive: Die Passive hat sich in dem Sinne ver&auml;ndert, dass die Schildgeneration heruntergesetzt wird. Daf&uuml;r skalliert der Schild jetzt mit Max Leben und Bleibt bei unter 25% bestehen. Solide &Auml;nderungen. Finde ich gut.\r\nQ: Mit der Neue Q werden werden die n&auml;chsten Angriffe von Mordekaiser verst&auml;rkt. An sich gesehen finde ich das garnicht so schlecht. Im Lategame ist     das mit die Gr&ouml;&szlig;te Schadensquelle. Jedoch geht damit das Poke-Potenzial verloren. Ich finde dieser Poke ist f&uuml;r das Earlygame sehr wichtig und gerade erst gegen Fernk&auml;mpfer (u.a. Sch&uuml;tzen).\r\nW: Die W ist garnicht so schlecht. Ihr gr&ouml;&szlig;tes Problem ist aber, dass sie nur auf verb&uuml;ndete Champion eingesetzt werden kann und nur dann anf&auml;ngt schaden zu machen, wenn sowohl du als auch dein Verb&uuml;ndeter am Gegner stehen. Das macht ihn gerade dann verwundbar, wenn er alleine ist, was, in der Laning-phase, schon &ouml;fters mal vorkommen kann. Auch dass die zus&auml;tzliche Bewegungsgeschwindigkeit nur in Richtung des Verb&uuml;ndeten Ziel funktioniert, macht ihn nur dann gut, wenn man im Team einen Starken Engager hat wie Leona oder Malphite. (Die W ist, neben der Schadens&auml;nderung der E und des fehlenden Q-Pokes, mit einer der Hauptgr&uuml;nde, wesshalb ich das Rework bis jetzt nicht mag.\r\nE: Bei der E muss erstmal gesagt sein, dass die neuen Partikeleffekte g&ouml;ttlich sind. Bei der E hat sich eigendlich nur der Grundschaden verringert, was nicht so drastisch ist, jedoch in Kombination mit der verringerten Schildgeneration ist im Early-game oder in Solo-lanes kontraproduktiv.\r\nR: Die Ulti ist beim Altengeblieben au&szlig;er dass man zus&auml;tzlich den Drachen versklaven kann. Top!!!\r\n\r\n\r\nBitte schreibt mir wie ihr das Rework findet, Es w&uuml;rde mich brennend interessieren.","replies":[{"poster":"Ravage69","date":"2015-10-01T19:05:06.851+0000","up_votes":1,"down_votes":0,"body":"Ok, ich erläutere kurz mal meine Erfahrungen.\n\nVorab mein Morde-build vor diesem verbrecherischem rework, um meine damalige Spielweise klarer werden zu lassen:\n\nEssenzen: 3x 2% Zaubervampir (6%)\nZeichen:    9x  Magiedurchdringung (7,8)\nSiegel:       9x Leben/Lvl (216 auf 18)\nGlyphen     9X Abklingzeit (7,5%)\n\nMeisterschaften: normal AP, Rest in Verteidigung\n\nStartbuild: 5x Heiltrank, 2x ward, 1x pink ward (fette Farmfestigkeit am Anfang und Sicht aufgrund des harten pushs. Wenn das alles aufgebraucht war, war der Gegner meistens schon mindestens 1mal getötet und man hatte zudem doppelten bis dreifachen Farm)\n\nCore-build: CDR-boots, Hex-tech Revolver (damit hatte man schonmal CDR zum Spells spamen und Spellvamp zum heilen)\n\nIm späteren Verlauf dann direkt Rylais (supergeil: AP, life und ein fetter slow) und WOTA (Wille der Uralten, für das max. an CRD [37,5%] und nochmal spellvamp-boost [26%])\n\nNoch später dann, Rabadons und Gunblade. Wenn es mal nicht nach Plan lief, weil schlecht drauf oder Gegner echt gut, auch mal ein def-item eingeschoben.\n\nZur Speilweise: Maximaler Druck! Spells immer raus, wenn ready. Nach Möglichkeit immer minions lasthiten und dabei optimaler Weise auch den Gegner treffen, sowohl mit Dreieck (E), als auch mit Knüppelkeule (Q). Dank Passiv und spellvamp war egal was der Gegner macht. \nDann saß der Gegner unterm Tower und hatte mühe noch irgendwie an CS zu kommen und man selbst konnte immer mal gemütlich ganken gehen und noch mehr kills farmen.\nGegner konnte man auch immer locker im Wegrennen töten, falls mal der gegnischer Jungler kam (den man ja dank Dauerwarding direkt gesehen hat). Ende vom Lied gegnerische Midlane und jungler tot. \n\nIch könnte noch viele weitere fiese Taktiken mit ihm erläutern, aber das bläht meinen Text nur noch weiter auf.\n\nGegenwärtige Situation:\n\"E\" hat nun eine ewige castzeit und man trifft nix mehr. Schaden macht sie auch keinen, demzufolge auch kein Schild (passiv)\n\"W\" drauf geschissen\n\"Q\" der größte Witz überhaupt. 3mal Ranmüssen (ewige Wams-Animation), um Schaden zu machen = Todesurteil\n\"R\" toll ich kann den Drachen versklaven (ich könnt mich kaputtlachen) \n\nDass er nun useless auf mid ist, ist klar. Aber wer sich als ADC von ihm zerstören lässt ist dumm und in den teamfights am Ende ist er dann eh nutzlos und ein leichtes Opfer.\n\nFür mich ist Morde nun tot und das find ich echt Kacke, da er mein erster Champ und Main war. \n\nIch bitte nun um Gegenargumente (die ich eh direkt plausibel widerlegen kann :D)","replies":[]},{"poster":"Skelenth","date":"2015-09-30T14:37:58.402+0000","up_votes":1,"down_votes":0,"body":"Ich hab bei Season 1 angefangen, da war Mordekaiser auch einer meiner ersten Champions. Das Rework hat ihn jetzt nicht aus dem Spiel geholt oder ähnliches, aber für notwendig oder gut hab ich es nicht gehalten. Man kann zwar mittlerweile die W wieder auf sich selbst casten, aber das halte ich immer noch für keine Entschuldigung dafür das Riot **wieder** einmal einen Champion den man gut spielen konnte wie er war einfach umgestülpt haben. Das war auch bei den ersten Änderungen von Evelynn der Fall. Welchen Grund gibt es Morde von einem AP-Bruiser auf der Toplane in einen AD-Bruiser auf der Botlane zu ändern? Absolut keinen wenn man mich fragt. Es passt nicht mal zum Championkonzept, wenn man mal davon absieht, dass man das \"Metall\" im Titel schon ignorieren kann. Davon hat er jetzt auch nicht mehr viel. Morde war früher ein Biest auf der Toplane: ewiger Sustain, hoher Damage, sicherer Poke, Burst wenns drauf ankommt. Jetzt ist er ein Biest auf der Botlane, mit dem einen Unterschied, dass er dich nach drei Schlägen platt gemacht hat.\nVom Drachen fang ich gar nicht erst an","replies":[{"poster":"Ravage69","date":"2015-09-30T18:36:54.306+0000","up_votes":1,"down_votes":0,"body":"Allein schon die Aussage in diesem Artikel, wo geschrieben wurde von top auf bot, ist vollkommener Schwachfug. Morde war eine mid-machine. Alles was da gut ist hat man mit ihm zerstört (Fizz, Yasou, Zed, Diana, Ahri usw., einfach alles). Auf der Toplane war er schon immer Kacke, vor allem gegen sowas wie Wukong, Garen, Cho'gath und so.\n\nDas zeigt einfach wieder, wie Riot und die meisten Spieler einfach keine Ahnung haben. Aber jetzt kann man Morde komplett vergessen.","replies":[]}]},{"poster":"Mantaforce2","date":"2015-09-01T17:41:20.862+0000","up_votes":1,"down_votes":0,"body":"Ich finde die Änderung zwar berechtigt, aber ich weiß einfach nicht, was ich tun soll. Ap allein ist ja mittlerweile eher unpraktisch. Hybrid ist zwar schon gut, ABER ( und hier war das \"aber\") seine passive macht nur mit tankyness Sinn. Also soll man sich jetzt... ein build überlegen, das möglichst viel ap, ad und hp in Morde reinpresst?  Ohne die tank items werde ich immer instant fertiggemacht, aber wie soll man schadenstechnisch mithalten, wenn man erst mal versuchen muss, den durch den adc erlittenen schaden zu lindern? Ich hab Morde aufm Smurf und finde ihn auf lvl 10 mittlerweile unspielbar. Ohne massive und überlegte masteries und runen ( was ziemlich unmöglich ist auf lvl 10 ) komm ich da nicht ohne 3 Tode nach 5 Minuten weg. Die Gegner haben einfach 0 Respekt vor mir. Wenn der Hook kommt bin ich tot. Ich sehe einfach kein Botlane Potenzial abgesehen von der W. Was ich brauche ist eine Spielweise wie bei Vladimir, nur mit Ad statt Ap. DAS wäre eine Veränderung mit der ich arbeiten könnte. Den Heal beim W bemerke ich übrigens überhaupt nicht.\nEDIT: Ich werde evtl mal Rylais, trinity, guinos, Liandrys, Rabadons, Boots ausprobieren.","replies":[]},{"poster":"Busty Botter","date":"2015-08-05T15:05:08.298+0000","up_votes":1,"down_votes":0,"body":"Ich fand nicht, dass er wieder eine Änderung braucht, obwohl die Änderung am Schild ganz nett ist. Jedoch das mit dem Drache gehört weg! Normal gibts nen Kampf um den Dragon und dann den Disengage, toll wenn Morde im Team ist gibt nen Reengage, man hat ja den Drachen, der viel zu stark ist! Was kommt als nächstes? Kann Yorick bald nen  Baron-Klon erschaffen?\n\nEbenso halte ich die Skarneränderung mit den einnehmbaren Dingern für Müll.","replies":[{"poster":"TheDarkWólf","date":"2015-08-05T17:11:48.431+0000","up_votes":1,"down_votes":0,"body":"> Jedoch das mit dem Drache gehört weg\n\nSehe ich genauso , es ist einfach zu stark wenn man einen 6k life Drachen im Fight hat , der auf die Dauer doch schon ziemlich Schaden drückt.","replies":[{"poster":"Busty Botter","date":"2015-08-05T21:55:47.605+0000","up_votes":1,"down_votes":0,"body":"Sein AoE Schaden bleibt ihm auch erhalten, was es noch schlimmer macht.","replies":[{"poster":"xKoramis","date":"2015-08-06T12:13:57.242+0000","up_votes":1,"down_votes":0,"body":"Der Kontrollierte Drache hat aber 50% weniger Leben und der Dmg ist soweit ich weis auch um 50% verringert\nvon daher nich so schlimm. Ausserdem muss Mordekaiser ihn angreifen damit der debuff auch auf dem Drake bleibt sonst  kommt es nichteinmal dazu.","replies":[{"poster":"Busty Botter","date":"2015-08-06T12:32:12.565+0000","up_votes":1,"down_votes":0,"body":"Wenn sie soetwas einführen wollen, aus welchem Grund auch immer, sollte soetwas eher als Smite Passive sein. Eventuell auf dem Proachers Knife, dann hätte man einen Grund es sich vielleicht zu kaufen.","replies":[]}]}]}]}]},{"poster":"Spaxa","date":"2015-08-05T21:26:31.228+0000","up_votes":1,"down_votes":0,"body":"War nie ein Mordekaiser Spieler, aber finde die Änderungen bis aufs W durchgehend gut. Nicht zu übersehen sind die um 80 erhöhte Reichweite und die verbesserte Angriffsanimation. Die Passive Bonus Exp der W ist einfach langweilig und \"zwingt\" ihn zusammen mir der Aktiven ziemlich in die Duo Lane was ich sehr Schade finde. Das Problem wär auch recht einfach zu lösen: Passive weg, Fähigkeit auch auf Gegner anwendbar, aber dafür Stats etwas runter oder den Movespeed raus wenn man den Gegner als Ziel nimmt. Oder die Werte so belassen und die Aura die man auf den Gegner gibt schädigt Mordekaiser :D\n\nDie Änderung mit dem Drachen gefällt mir auch sehr.","replies":[]},{"poster":"Ravage69","date":"2015-09-29T20:31:09.480+0000","up_votes":1,"down_votes":1,"body":"Es gibt nur eine Lösung:\n\nDiesen \"Ghostcrawler\" und alle anderen die kack Ideen umsetzen, in den Gulag schicken und sämtliche Änderungen rückgängig machen.\n\nAlle kürzlichen reworks sind scheisse (GP, Veigar und viele mehr), aber jetzt der an Morde ist verbrecherisch.","replies":[]}]}