{"poster":"Nomosu","date":"2016-08-21T21:49:41.411+0000","title":"Teamersteller RIP","subforum":"Karten & Spielmodi","up_votes":6,"down_votes":5,"body":"Wer von euch ist auch genervt, dass der Teamersteller entfernt wurde und man sich nun mit jeden Trottel um eine Lane streiten muss bei Blind Pick oder man 2 Lanes ausw&auml;hlen muss und dann hoffen muss, dass man die Lane bekommt die man wollte? Ach ja und hoffen das sein Champion nicht gebannt wird den man Perfektionieren will. \r\n\r\nIch pers&ouml;nlich finde das Riot-Games sich damit nur selbst schlechter gemacht hat.\r\nJedes mal die selbe Kotze, selbst wenn man seine Lane hat kommt irgendein Idiot der sich instalocked.\r\n\r\nGG Reported Rito.","replies":[{"poster":"Meitser","date":"2016-08-21T22:30:36.048+0000","up_votes":1,"down_votes":0,"body":"Ich hab ihn natürlich auh gerne gespielt.\nAber draft pick ist besser","replies":[{"poster":"Nomosu","date":"2016-08-22T00:12:49.107+0000","up_votes":1,"down_votes":1,"body":"finde ich überhaupt nicht, alleine schon weil man sich da auf die mates verlassen muss die vielleicht dein champ bannen. weil du mal nicht meta spielen willst um zum beispiel für Youtube zu recorden. Wie ich letztes mal wollte einfach mal ganz trocken Draven tank spielen.\n\nwas macht direkt er erste bannt draven begründung ist kein top champ und du trollst ja nur. was soll so ein rotz?\n\nUnd das passiert mir zu oft und ich muss sagen es nervt. Bin mittlerweile done mit dem Game.\nWo ich anfing war es wesentlich besser.\n\nDann kommen seit Monaten nur Noobchamp meta und jeder Skill champ der mega abgehen kann profitiert nicht davon.\nBeispiel: Bruiser Meta Garen und Darius total overpowered und Riven bleibt auf der Strecke. Soll ein Witz sein oder?{{champion:92}}","replies":[{"poster":"MeMyselfandBaal","date":"2016-08-22T04:45:04.990+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Nomosu,realm=EUW,application-id=cGRapXds,discussion-id=RGtHOiEA,comment-id=00010000,timestamp=2016-08-22T00:12:49.107+0000)\n>\n> finde ich überhaupt nicht, alleine schon weil man sich da auf die mates verlassen muss die vielleicht dein champ bannen. weil du mal nicht meta spielen willst um zum beispiel für Youtube zu recorden. Wie ich letztes mal wollte einfach mal ganz trocken Draven tank spielen.\n> \n> was macht direkt er erste bannt draven begründung ist kein top champ und du trollst ja nur. was soll so ein rotz?\n\nDann... stell dich doch einfach clever an und kündige irgendwas total metamäßiges an... ist ja nicht so, dass du das dann auch picken musst... das man den Leuten echt alles erklären muss...\n\nOh und nur so nebenbei: Die Leute, mit denen ich Teambuilder gespielt habe, hätten dich instant gekickt, wenn du Draven Tank Top angekündigt hättest... denn die wollten in der Que ganz entspannt Meta Taktiken üben...\nUnd ja, mit dem einen habe ich aufgehört zu spielen, weil er wirklich gefühlt alles, was nicht OP war, gekickt hat. Nur um mal festzuhalten, dass es das da auch gab und der Teambuilder kein Paradis war, wo jeder immer alles bekommen hat, was er wollte...\n\n> Du denkt wirklich wenn ich main supp im ranked bin, dass ich dann in Normals auch nur einmal supp spielen will?\n\ndass nicht... aber das sich das Support spielen extrem günstig auf jegliche Que Zeiten auswirkt, wirst du ja wohl einsehen... und es ist irgendwie davon auszugehen (zumindest Riot hat das gemacht), dass die meisten richtung Draft Modus weitergezogen sind... Beweise? Nun ja... nutze mal die Suchfunktion um rauszukriegen, wer sich alles noch über den Wegfall dieses Modus aufgeregt hat... ähm... ziemlich genau.... niemand.\n\nUnd dadurch würdest du spätestens jetzt definitiv folgendes Problem kriegen: Die Leute, die bereit sind, Support zu spielen, gehen in die andere Que, weil ihre Champions ja eh nie gebannt werden und sie ihre Rolle in 98% der Fälle kriegen. Und damit wird der Kader der Leute, die im Teambuilder (abgesehen davon, dass der Kader allgemein schon zurückgegangen sind. Die Gemeinheit der Community ist mit der Dynamic Que sehr zufrieden und braucht deswegen keinen Teambuilder mehr) Support spielen würden, sehr sehr klein... Und spätestens dann wartest du wirklich Ewigkeiten auf das eine vernünftige Team...\n\nIch merke das ja, wenn ich mich mit meinem Besten Freund auf meinem Smurf anmelde: Wenn wir Sup und Bot angeben, finden wir in 15 Sekunden ein Spiel, wenn wir Mid und Top angeben, können wir gerne mal 10-15 Minuten warten... Genau so würde das werden, wenn es derzeit einen Teambuilder geben würde... aber hey, wir würden endlich mal wissen, worüber sich die ganzen Highelo Spieler immer beschweren...","replies":[{"poster":"HyperionCH","date":"2016-08-22T08:19:19.268+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=cGRapXds,discussion-id=RGtHOiEA,comment-id=000100000001,timestamp=2016-08-22T04:45:04.990+0000)\n>\n> Und dadurch würdest du spätestens jetzt definitiv folgendes Problem kriegen: Die Leute, die bereit sind, Support zu spielen, gehen in die andere Que, weil ihre Champions ja eh nie gebannt werden und sie ihre Rolle in 98% der Fälle kriegen. Und damit wird der Kader der Leute, die im Teambuilder (abgesehen davon, dass der Kader allgemein schon zurückgegangen sind. Die Gemeinheit der Community ist mit der Dynamic Que sehr zufrieden und braucht deswegen keinen Teambuilder mehr) Support spielen würden, sehr sehr klein... Und spätestens dann wartest du wirklich Ewigkeiten auf das eine vernünftige Team...\n\nOder klarer ausgedrückt:\nKein Sup-Main wird im Teamersteller spielen.\n\nIch habe damals oft Jungle + Sup gespielt im TB (und oft Solo).\nEntweder musste ich als Jungler auf den Sup mehrere Minuten warten oder als Sup mehrere Minuten auf einen Jungler.\n\nAlleine schon die Wartezeit (selbst wenn alle meta picken!), die man im TB auch als Sup (Solo-Spieler) erdulden musste, wird dazu führen, dass kein Sup im TB spielen würde. Denn in der DynQ-Normals wartet man nie, da man sofort 5 Mates zusammen hat. Gebannt wird auch niemand und off-meta kann man auch spielen (letzte Woche spielte ich ADC mit einem Yasuo-\"Sup\"). Beim TB geht dann der Sup oder Jungler noch selber weg, weil auf Toplane jemand Yorick pickte. Dann heisst es nochmals mehrere Minuten auf den 5. Mate warten.\n\nDer TB war letzte Season ein extrem gutes Instrument, um gewisse Rollen und Champs fürs Ranked zu üben. Ehrlich gesagt war ich ziemlich Fan des TB.\nJedoch ist der Nutzen mit der Einführung der DynQ (Normal) nun nahezu bei Null und würde nur auf beiden Modi für eine irre lange Warteschlange sorgen.","replies":[{"poster":"Nomosu","date":"2016-08-22T15:51:37.132+0000","up_votes":1,"down_votes":0,"body":"Ich war auch ein Fan davon weil man eben üben konnte.\nIch wollte vor kurzen wo Hecarim noch so Stark war den auch mal wieder einspielen. Konnte aber nicht ein Game starten mit dem, weil die Leute ihn permanent bannten oder einfach im blind pick instalocked oder sonst was. \nHatte man Heca bekommen, dann wurde geleavt...","replies":[]}]}]},{"poster":"Maíko","date":"2016-08-22T07:25:32.751+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Nomosu,realm=EUW,application-id=cGRapXds,discussion-id=RGtHOiEA,comment-id=00010000,timestamp=2016-08-22T00:12:49.107+0000)\n>\n> finde ich überhaupt nicht, alleine schon weil man sich da auf die mates verlassen muss die vielleicht dein champ bannen. weil du mal nicht meta spielen willst um zum beispiel für Youtube zu recorden. Wie ich letztes mal wollte einfach mal ganz trocken Draven tank spielen.\n\n\nMir wurde noch nie was weg gebannt....\nOb Vayne Jungle, Teemo Support, Jhin Midlane\n\n> was macht direkt er erste bannt draven begründung ist kein top champ und du trollst ja nur. was soll so ein rotz?\n\nWenns dir nicht passt spiel Blind Pick....\nDir scheint ja egal zu sein, wo du mit Draven spielst....also sehe ich da kein Problem.\n\n> Und das passiert mir zu oft und ich muss sagen es nervt. Bin mittlerweile done mit dem Game.\n> Wo ich anfing war es wesentlich besser.\n\nDann hör halt auf damit...keiner zwingt dich es zu spielen.\n\n> Dann kommen seit Monaten nur Noobchamp meta und jeder Skill champ der mega abgehen kann profitiert nicht davon.\n> Beispiel: Bruiser Meta Garen und Darius total overpowered und Riven bleibt auf der Strecke. Soll ein Witz sein oder?{{champion:92}}\n\nRiven hatte schon immer schlechte Karten gegen Garen...\nDann spiel halt {{champion:105}} {{champion:17}} {{champion:133}} und schon werden die meisten Bruiser tilten.","replies":[]},{"poster":"thefire7","date":"2016-08-22T00:29:16.806+0000","up_votes":1,"down_votes":0,"body":"> finde ich überhaupt nicht, alleine schon weil man sich da auf die mates verlassen muss die vielleicht dein champ bannen. weil du mal nicht meta spielen\n\nAlso das ist doch ein Witz oder???? Das schwächste Argument, dass ich je gesehen habe...\n\n\n> Und das passiert mir zu oft und ich muss sagen es nervt.\n\nDa biste der einzigste, dem so was oft passiert.\n\n> und Riven bleibt auf der Strecke. \n\nDer der Riven gut kann und sie regelmäßig spielt, wird gewinnen, da sie 1. ein schweres Kit hat (Für den Gegner, sie zu treffen und sie ist zu sehr viel Schaden in der Lage)","replies":[{"poster":"Nomosu","date":"2016-08-22T00:56:34.238+0000","up_votes":1,"down_votes":1,"body":"1 Argumente sind Variable. Wenn du sie nicht verstehst musst du nicht kommentieren.\n2. Nein bin ich nicht, wenn ich mir Storys von den Leuten aus meiner Liste anhöre ist das oftmals der Fall.\nDu brauchst Riot nicht in den Schutz nehmen die bauen oft genug scheiße ein was keiner brauch.\nWer brauch ein garen der einfach so kacke langweilig ist mit einem Power Up.\nGG Supporter von Riot geben Pw`s raus auf andere E-Mails. #MrMaikAP\n\n3. Wer Riven gut kann, wenn man sie lernen will ist es nicht wirklich eine elegante Lösung, randoms champs wie Garen und Darius zu buffen.\nRiven zu können erfordert eine gewisse Geduld und Timing.","replies":[{"poster":"BloxsterS","date":"2016-08-22T02:33:46.590+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Nomosu,realm=EUW,application-id=cGRapXds,discussion-id=RGtHOiEA,comment-id=0001000000000000,timestamp=2016-08-22T00:56:34.238+0000)\n>\n\n> 3. Wer Riven gut kann, wenn man sie lernen will ist es nicht wirklich eine elegante Lösung, randoms champs wie Garen und Darius zu buffen.\n> Riven zu können erfordert eine gewisse Geduld und Timing.\n\nWir ignorieren jetzt einmal ganz kurz das keiner der beiden Champions innerhalb der letzten 10 Patchnotes oder sogar länger gebufft oder geändert worden ist. Abgesehen davon ist Garen momentan keine Meta, er ist einfach nur ein Riven counter. Einen Darius kann man als Riven auch outplayen indem man u.a. seine Auto-Attacks cancelt mit 3. Q und W und nicht auf trades geht das man 5 Blut stacks hat.\n\nUnd zu dem Thema mit dem Teamersteller: Ich hab noch nie eine Person gehört die sich über die Abschaffung des Teamerstellers aufregt. Deine Argumente sind auch ehrlichgesagt nicht vielsagend oder gut.","replies":[{"poster":"Nomosu","date":"2016-08-22T04:05:53.860+0000","up_votes":1,"down_votes":1,"body":"Es geht gar nicht um die Champions.... Es ging dabei um dem Punkt das low skill Champions gebuffed wurden und ein high skill einfach vernachlässigt wurde.\n\nDie Patch Notes und meta finde ich eh blödsinn, weil die Champions die nicht Meta sind einfach vernachlässigt werden.\n\nZu dem Thema Teamersteller hast du keine Person die sagt es ist beschissen das er weg ist?\nWahrscheinlich nie gehört oder ignoriert und meine Argumente dazu sind nicht vielsagend oder gut, ist dennoch genau so ein Bullshit wie zu behaupten, dass Modi besser sind wo man Counter gepickt wird oder man sich mit den Leuten erst um die Lane Streiten muss.\nUnd Mittlerweile ist es im Blind Pick sogar schon so weit das man im ersten Spiel nicht direkt in die Champselct-Bildschirm kommt sondern mit 2-3 sec Verzögerung, was es zusätzlich erschwert seine Lane zu bekommen.\nUND ab und an einfach Chatbann ist.\nUnd das soll besser sein als vielleicht mal 2-3 min länger zu warten?\n\nSorry aber diese Kommunikation führt eh zu nichts, weil die meisten hier gar nicht in der Lage sind davon mitzureden, weil die entweder nie Teamersteller gespielt haben oder denen es einfach egal ist was sie spielen und wo.\n\nWenn ich zum Beispiel ein Talon perfektionieren will dann spiele ich nur mid. Dynamic Queue mid zu picken wartet man mindestens 5 min wenn man solo spielt. Zumindest auf meiner Elo^^ oder man wird einfach auf eine 2t Rolle versetzt. \n\nBlind Pick garantiert mir keine mid wenn jemand einfach vorher in der Select ist oder man Bannt ist.\nDiese Probleme hatte man mit dem Teamersteller alle nicht.\n\nalso GG wenn du was anderes behauptest.\nMit dein Xin main acc ^^","replies":[{"poster":"thefire7","date":"2016-08-22T19:31:34.178+0000","up_votes":1,"down_votes":0,"body":"> Es ging dabei um dem Punkt das low skill Champions gebuffed wurden und ein high skill einfach vernachlässigt wurde.\n\nWenn man sie die \"High-Skill Champions\" kann machen sie mehr schaden oder bieten mehr Vorteile als die \"Low-Skill Champions\"\n\n\n> Die Patch Notes und meta finde ich eh blödsinn, weil die Champions die nicht Meta sind einfach vernachlässigt werden.\n\nEin wandelndes Spiel ist ein gutes Spiel.\n\n\n>  man sich mit den Leuten erst um die Lane Streiten muss.\n\nWer zu erst schreibt hat die Lane, das sit die Regel. 99% beachten sie. \n\n\n> dass Modi besser sind wo man Counter gepickt wird \n\nEin Spiel macht einem mehr Spaß wenn man gefördert wird, nicht jedem macht es Spaß 24/7 als \"Fizz\" (Full Ap) gegen \"Varus\" (Full Ad).\n\n\n> Und Mittlerweile ist es im Blind Pick sogar schon so weit das man im ersten Spiel nicht direkt in die Champselct-Bildschirm kommt sondern mit 2-3 sec Verzögerung, was es zusätzlich erschwert seine Lane zu bekommen.\n\nliegt wohl an deinem Internet, \"man\" wäre falsch ausgedrückt, weil wenn alle 2-3 sec verzögerung hätten, wären es gleiche Chancen.\n\n\n> Und das soll besser sein als vielleicht mal 2-3 min länger zu warten?\n\njo, weil 2-3 min länger als 20 Minuten.\n\n\n> UND ab und an einfach Chatbann ist.\n\nDu wirst nicht random gebannt^^ Kommt davon wenn man \"Copy-Paste\"-Nachrichten in den Chat Spammed\n\n\n> Sorry aber diese Kommunikation führt eh zu nichts\n\nDa hast du Recht. und sie hat mit dem Kommentar angefangen:\n\n>Wer von euch ist auch genervt, dass der Teamersteller entfernt wurde und man sich nun mit jeden Trottel um eine Lane streiten muss bei Blind Pick oder man 2 Lanes auswählen muss und dann hoffen muss, dass man die Lane bekommt die man wollte? Ach ja und hoffen das sein Champion nicht gebannt wird den man Perfektionieren will.\n\nIch persönlich finde das Riot-Games sich damit nur selbst schlechter gemacht hat.\nJedes mal die selbe Kotze, selbst wenn man seine Lane hat kommt irgendein Idiot der sich instalocked.\n\nGG Reported Rito.\n\n\n> Dynamic Queue mid zu picken wartet man mindestens 5 min wenn man solo spielt.\n\nTeam Builder wahr länger\n\n\n> Blind Pick garantiert mir keine mid wenn jemand einfach vorher in der Select ist\n\nliegt an deiner Internet-Verbindung\n\n\n> also GG wenn du was anderes behauptest.\n\nJup is gg.\n\n\n> Mit dein Xin main acc ^^\n\ndeinem* und http://www.bilder-upload.eu/show.php?file=1b32ad-1471894472.jpg","replies":[]}]},{"poster":"thefire7","date":"2016-08-22T11:52:33.531+0000","up_votes":1,"down_votes":0,"body":"> Garen momentan keine Meta, er ist einfach nur ein Riven counter.\n\nNicht unbedingt, eine Riven kann um den Silence herum spielen mit ihrer Mobilität. Einer der sagt, er würde nur Garen spielen als Riven counter, wird gegen eine etablierte Riven ziemlich versagen.","replies":[]}]},{"poster":"thefire7","date":"2016-08-22T11:54:14.112+0000","up_votes":1,"down_votes":0,"body":">  randoms champs wie Garen und Darius zu buffen.\n\nDarius und Garen sind alles andere als OP, jeder neue Champ ist viel schneller und sinvoller. Wenn man weiß wie man gegen sie spielt haben sie keine Chance.\n\nP.S. Riven wird im kommenden Patch sehr gebufft (via. http://www.pcgamesn.com/league-of-legends/league-of-legends-patch-617 )\n\n\n>Du brauchst Riot nicht in den Schutz nehmen die bauen oft genug scheiße ein was keiner brauch.\n\nDa musst du schon mehr Beispiele bringen\n\n\n> Wer brauch ein garen der einfach so kacke langweilig ist mit einem Power Up.\n\nDas ist kein Argument!\n\n\nBtw. das mit MrMaikAp war schon scheiße, aber ist und bleibt ein Einzelfall.","replies":[{"poster":"Nomosu","date":"2016-08-22T15:53:25.308+0000","up_votes":1,"down_votes":0,"body":"Jung, die Bruiser Meta ist schon lange vorbei dennoch wurden die mit dem Update gebufft-","replies":[]}]}]}]}]}]},{"poster":"thefire7","date":"2016-08-21T21:56:22.765+0000","up_votes":1,"down_votes":2,"body":"Du bist der einzigste der sich darüber aufregt... In Team Builder musste man immer 2h für nen Supp warten... Niemand wird deiner Meinung sein!","replies":[{"poster":"Nomosu","date":"2016-08-21T22:24:58.754+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=thefire7,realm=EUW,application-id=cGRapXds,discussion-id=RGtHOiEA,comment-id=0000,timestamp=2016-08-21T21:56:22.765+0000)\n>\n> Du bist der einzigste der sich darüber aufregt... In Team Builder musste man immer 2h für nen Supp warten... Niemand wird deiner Meinung sein!\n\nDas bezweifel ich weil ich im teamersteller immer nur 3 min wartete.","replies":[{"poster":"thefire7","date":"2016-08-21T22:59:23.130+0000","up_votes":1,"down_votes":0,"body":"Kann sein, wenn du immer Supporter spielst, sont.. eher nicht.","replies":[{"poster":"Nomosu","date":"2016-08-22T00:15:34.726+0000","up_votes":1,"down_votes":0,"body":"Du denkt wirklich wenn ich main supp im ranked bin, dass ich dann in Normals auch nur einmal supp spielen will?","replies":[{"poster":"thefire7","date":"2016-08-22T00:25:52.603+0000","up_votes":1,"down_votes":0,"body":">dass ich dann in Normals auch nur einmal supp spielen will?\n\nHab ich nie behaupted, nur dass du mit Support immer nur 3 Minuten warten musst, außer du hast 3 Freunde,\n\n\naußerdem muss man bey DynQ auch nur 3 min warten (zumindestens in den Normals und unterem Elo-Bereich)\n\n\nDu bekommst nur manchmal nicht deine Rolle wenn du Mid pickst, ansonsten so gut wie immer (im Normal, im Ranked kann das variieren)","replies":[{"poster":"Nomosu","date":"2016-08-22T00:51:32.302+0000","up_votes":1,"down_votes":1,"body":"Ich will aber nicht dann eine andere lane haben und ich gebe ein scheiß drauf wenn man dann auch noch counter gepickt wird. wo bleibit der spaß? \nEntweder Counter pick oder ban oder man bekommt nicht die lane die man eig spielen will.\nKein bock drauf.","replies":[]}]}]}]},{"poster":"Zanlan","date":"2016-08-21T23:35:47.668+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nomosu,realm=EUW,application-id=cGRapXds,discussion-id=RGtHOiEA,comment-id=00000001,timestamp=2016-08-21T22:24:58.754+0000)\n>\n> Das bezweifel ich weil ich im teamersteller immer nur 3 min wartete.\n\nIst auch meine Erfahrung.\nZusätzliche Que dafür wäre nice, dann kann man in Ruhe seinen Champion spielen {{champion:6}}","replies":[]}]},{"poster":"DerFeíneHerr","date":"2016-08-21T22:23:20.266+0000","up_votes":1,"down_votes":0,"body":"Jo denk auch so.","replies":[]}]},{"poster":"ELOW Cronos","date":"2016-08-22T00:24:41.882+0000","up_votes":1,"down_votes":0,"body":"Also ich find den neuen Draft Pick Mega Geil. Auch wenn ich es Schade finde das Supp als Zweitrolle keine wirkliche Option ist ^.^.","replies":[{"poster":"Nomosu","date":"2016-08-22T00:57:36.233+0000","up_votes":1,"down_votes":0,"body":"Ich sage nicht das es schlecht ist, ich finde einfach nur Teamersteller besser. Du kannst das da spielen wo du willst. Nichts anderes. Da warte ich lieber 5 min länger als auszuweichen.","replies":[{"poster":"Megamaexx","date":"2016-08-22T04:44:15.709+0000","up_votes":1,"down_votes":0,"body":"Wenn es mal nur 5 Minuten wären xD","replies":[{"poster":"Nomosu","date":"2016-08-22T15:55:08.154+0000","up_votes":1,"down_votes":0,"body":"Hatte immer nach 5-10 min im Teamersteller ein team zusammen^^","replies":[]}]},{"poster":"ELOW Cronos","date":"2016-08-22T01:03:59.842+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nomosu,realm=EUW,application-id=cGRapXds,discussion-id=RGtHOiEA,comment-id=00020000,timestamp=2016-08-22T00:57:36.233+0000)\n>\n> Ich sage nicht das es schlecht ist, ich finde einfach nur Teamersteller besser. Du kannst das da spielen wo du willst. Nichts anderes. Da warte ich lieber 5 min länger als auszuweichen.\n\nDAS sehe ich anders ^^. Im Teamersteller habe ich keine Möglichkeit meinen Pick an die Picks meines Teams oder die meiner Gegner anzupassen, da alles Blind gepickt wird. Kein Bock mit nen CC losen, squishy Team in ne Kata, Yi, Leona Kombo zu laufen, weil ich deren Picks nicht sehen konnte. Ebenfalls fehlt mir die Möglichkeit gewisse Champs zu bannen sollte Riot es mal wieder mit dem Buffen ein wenig übertreiben.\n\nNaja jedem das seine ^^.","replies":[{"poster":"Nomosu","date":"2016-08-22T02:03:58.869+0000","up_votes":1,"down_votes":1,"body":"Stimmt nicht, du hättest genau so gut leaven können oder selbst ein team machen.","replies":[]}]}]}]}]}