{"poster":"xIR3llix","date":"2016-05-13T13:25:50.507+0000","title":"14 Tage Bann","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":7,"body":"Ein Freund von mir hat ein Spiel bei mir gemacht mit meine Ac , und im Chat geflamt nun habe ich einen 14 Tage Bann . Dennt ihr es gibt ein M&ouml;lichkeit ihn zu verk&uuml;rzen oder aufzul&ouml;sen. Oder is es meine Schuld","replies":[{"poster":"Humpelstilzche","date":"2016-05-13T13:32:19.390+0000","up_votes":2,"down_votes":0,"body":"Ich fürchte da bist du selber Schuld. Alles was auf deinem Account passiert ist deine Verantwortung. Aus dem Grund (und vielen weiteren Gründen) ist Accountsharing auch verboten und wird generell mit Permabans geahndet (dich an den Support zu wenden wäre also sehr unklug). \nBehalte im Hinterkopf, dass nach einem 14-Tage-Ban jedes weitere Vergehen ebenfalls zum Permaban führt. \n\nUnd mit deinem \"Freund\" würde ich an deiner Stelle mal ein ernstes Wörtchen reden. Wer solche Freunde hat braucht keine Feinde mehr.","replies":[{"poster":"e621 Rengar","date":"2016-05-13T13:50:01.111+0000","up_votes":1,"down_votes":0,"body":"Wie die anderen schon sagten Acc Sharing & Flame wird beides geahndet und nicht gelindert / zurückgenohmen \n\n_________________\nWenn ich das mal kurz als Offtopic fragen dürfe : \n\nWie sieht das eigendlich aus wenn man z.b Beim Kumpel übernachtet selber seine Acc Daten eingibt und ihn spielen lässt ohne das er die Daten kennt ? fällt das auch darunter :o ?","replies":[{"poster":"Humpelstilzche","date":"2016-05-13T13:57:28.589+0000","up_votes":1,"down_votes":0,"body":"> fällt das auch darunter :o ?\n\nJa. \n\nNiemand außer der ursprüngliche Ersteller des Accounts darf diesen jemals benutzen, ungeachtet der Umstände und ohne Ausnahme.","replies":[{"poster":"Lagbeard","date":"2016-05-13T14:02:22.165+0000","up_votes":1,"down_votes":0,"body":"Nein, bei nicht mündigen Kindern dürfen die Eltern den Account besitzen und die Kinder darauf spielen :D","replies":[]},{"poster":"xXTheFalloutXx","date":"2016-05-13T14:49:51.801+0000","up_votes":1,"down_votes":0,"body":"Theoretisch Ja, aber niemand wird meckern wenn du jemanden ein Spiel \"Vorstellen\" möchtest oder  ihn deinen 2.Account benutzen lässt um einen Champ zu testen. Keiner würde deswegen Meckern. ^^","replies":[]},{"poster":"e621 Rengar","date":"2016-05-13T13:58:27.942+0000","up_votes":1,"down_votes":0,"body":"Kk danke :D","replies":[]}]},{"poster":"leonthefirefly","date":"2016-05-13T13:59:10.098+0000","up_votes":1,"down_votes":0,"body":"vermutlich alles andere würde glaub ich ja auch keinen sinn machen","replies":[]}]}]},{"poster":"Spicavius","date":"2016-05-13T18:54:28.895+0000","up_votes":1,"down_votes":0,"body":"Hattest du vorher schon Chateinschränkungen?\n\nWenn nicht, dann würde mich der Chatlog (für den 2 Wochenbann) sehr interessieren. Ich habe nämlich noch nie gesehen, dass jemand tatsächlich die Chateinschränkungen übersprungen hat. Falls du natürlich schon Chateinschränkungen hattest, dann ist der Chatlog nicht so interessant.","replies":[]},{"poster":"EuleQ","date":"2016-05-13T17:43:02.196+0000","up_votes":1,"down_votes":0,"body":"Das ist deine eigene Schuld wenn du den Account einfach an deinen Freund weitergibst hast du auch die Verantwortung aufzupassen das er nicht auf deinem Account flamet. Was ich aber nicht ganz verstehe wie dein Account einen 2 Wochenban bekommen kann, entweder hat wirklich jeder in dem game deinen Freund reportet oder dein Account was ich denke wurde schon öfters reportet also, wenn du keinen Permabann haben möchtest dann spiel am besten nur du auf deinem Account und flame nicht mehr ;) am besten mutest einfach jeden der dich aufregt.{{sticker:slayer-jinx-catface}}","replies":[{"poster":"legofreak1","date":"2016-05-13T17:45:11.258+0000","up_votes":1,"down_votes":0,"body":"Nur weil man oft gemeldet wurde, bekommt man nicht gleich einen Bann.\n\nEntweder hat der TE selber schon vorher eine CR gehabt, sodass nun die nächste Strafe der Bann war oder sein Freund hat mit dem Account längere Zeit gespielt und dieser hat die CR bekommen. Möglich ist auch, dass sein Freund die harte Nazi-keule geschwungen hat, dann ist auch ein instant-Bann möglich.","replies":[]}]},{"poster":"Wernicke","date":"2016-05-13T15:52:16.395+0000","up_votes":1,"down_votes":0,"body":"Das wird aber auch nicht wegen 1x flamen passiert sein!\nAlso entweder hast dein Acc schon öfter \"verliehen\", oder selber vorher auch schon flißig geflamed. Das weißt du so gut wie wir alle, also nich rausreden ;)","replies":[]},{"poster":"drexxsack","date":"2016-05-13T13:29:23.722+0000","up_votes":1,"down_votes":0,"body":"http://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/IGu89oyX-kontosperre\nAbgesehen davon, dass Accountsharing(auch das fällt darunter) nicht erlaubt ist, werden verhaltensbezogene Banns nicht aufgehoben oder verkürzt.","replies":[]}]}