{"poster":"CayoElFurro","date":"2015-05-28T20:43:16.094+0000","title":"Guia para suport","subforum":"Guias y consejos","up_votes":1,"down_votes":2,"body":"Para ser un buen suport hay que tener en cuenta lo siguiente:\r\n1)No robar farm al adc.\r\n2)No robar kill al adc (dependiendo de la situacion).\r\n3)Mantenerlo vivo.\r\n4)Poner los wards para evitar gankeos o ataques desde el bush (pastos).\r\n5)Facilitarle al adc una kill.\r\n\r\nDepende con que tipo de suport te muevas mejor, hay tanques y magos\r\n\r\nBuild recomendada para tanques: {{item:3401}} o {{item:3069}}    {{item:2045}} {{item:3110}} {{item:3111}} {{item:3190}}{{item:3025}} \r\n\r\nY para magos: {{item:3092}} {{item:2045}} {{item:3001}} {{item:3157}} {{item:3111}} {{item:3190}} \r\nPD: Esas son las builds que usaria\r\n\r\nRunas: Marcas de penetracion hibrida o de armadura, sellos de armadura, glifosde resistencia y Quintas de oro.\r\n\r\nTanques: {{champion:201}} , {{champion:53}} , {{champion:412}} , {{champion:111}} (lo uso yo), {{champion:89}} , {{champion:44}} y {{champion:12}} \r\n\r\nMagos: {{champion:267}} , {{champion:25}} , {{champion:43}} , {{champion:99}} (aveces la uso y rinde), {{champion:40}} , {{champion:37}}  {{champion:16}} , {{champion:26}}  y {{champion:143}}","replies":[{"poster":"martincarp","date":"2015-05-28T23:53:48.101+0000","up_votes":1,"down_votes":0,"body":"Como decirlo..... como que esto no le cambia mucho nada a nadie.\nTendrías que aclarar por qué esos items, aclarar que son específicos y que se pueden reemplazar dependiendo de la partida, como y cuando utilizar cada item, los personajes PARA MI GUSTO están mal acomodados, Blitz no es de los supp tanques mas fuertes ni de casualidad, y Braum hoy en día está un pasito por detrás de Nautilus, Thresh y Alistar.\nSoportes magos no se utilizan mucho en la meta actual, es un tanque menos para el equipo, aunque en buenas manos el aporte de utilidad puede ser favorable... y si hablamos de utilidad Janna debería estar delante de todos los supps magos sin duda, luego si puedes poner a Nami, Sona, Zyra (en buenas manos hace un peel decente, y el daño que tiene en early la vuelve de las mas molestas), y a partir de este parche en los papeles Lulu y Karma volverían a estar en Tier 1 o 2, esperemos que pase un poco más el tiempo para ver como les afectaron los cambios.\nCon respecto a las runas desde la Season 3 no veo runas de oro, son inútiles hoy en día, todos los items de supp te dan un oro más que decente (el cambio de la nueva moneda se nota bastante, hoy tenía 1000 de oro en la pasiva al minuto 30), sumado a las maestrías alcanza y sobra. Dependiendo del match up y del supp que utilices normalmente se usan Quintas de armadura, rojas de penetración híbrida, amarillas de vida (personalmente me gustan más por nivel, pero eso es a gusto) y glifos de resistencia mágica (lo mismo que con las de vida, yo uso 4 planas y 5 por nivel, pero es a gusto y depende del supp rival).","replies":[{"poster":"CayoElFurro","date":"2015-05-29T18:18:48.889+0000","up_votes":1,"down_votes":0,"body":"Si ya se que los acomode mal, solo pasaba la lista de los items que frecuentemente usan de sup, claro eso va por gusto de cada uno. \nEn cuento al titulo simplemente no puse \"BÁSICA\" porque me olvide.\nHice una guía resumida de lo que debe y no debe hacer un sup.\nY en cuanto a las runas tenes razón al decir que las quintas de oro mucho ya no sirven, yo las uso pero también aveces uso de Vida o AP para tanque o mago. \n\nGracias por tu aporte.","replies":[]}]},{"poster":"Cpt Miau","date":"2015-05-28T23:26:13.412+0000","up_votes":1,"down_votes":0,"body":"Yo le agregaria al titulo la palabra \"Basica\", no se, esperaba una guia un poco mas avanzada y no consejos que basicamente cualquiera que jugo supp alguna vez sabe","replies":[]}]}