{"poster":"Less Zero","date":"2016-02-05T22:41:57.148+0000","title":"Me desaparece el icono del lol","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Hola y buenas a todos,tengo un peque&ntilde;o problema que ocurre cuando intento instalar el lol veran lo dejo que instale todo y como es comun se me pone la pc en modo de suspencion y cuando salgo de este modo al darle click al icono del lol en la barra de tareas este desaparece,pero cuando intento abrir un nuevo lol me dice que ya hay uno abierto y pues como sabran el lol tarde muchisimo en descargar si tienes un internet como el mio y por eso no quiero cerrar este lol y abrir otro ya llevo 2 dias intentando instalar el lol y no puedo por este mismo (El icono del lol en el escritorio es un icono blanco no es tipico icono del lol de toda la vida,no se si tiene algo que ver pero queria mencionarlo por las dudas)\r\n\r\nDesde ya,Gracias &iexcl;","replies":[{"poster":"Ride the tiger","date":"2016-02-05T23:44:59.723+0000","up_votes":1,"down_votes":0,"body":"Gyazo (una app) o apretas el botón del teclado Imprimir Pantalla (imp pnt o algo así) lo copias en paint, lo salvas como jpg y lo pasas con el \"clip\" que hay cuando posteas algo.","replies":[{"poster":"Less Zero","date":"2016-02-05T23:49:19.548+0000","up_votes":1,"down_votes":0,"body":"No man ni pta idea :,v.Ya fue reinicio la pc y a la mrd la descarga otra vez..","replies":[]}]},{"poster":"Ride the tiger","date":"2016-02-05T23:22:58.930+0000","up_votes":1,"down_votes":0,"body":"Esperaste un rato? Empecemos por el principio :p","replies":[{"poster":"Less Zero","date":"2016-02-05T23:28:44.636+0000","up_votes":1,"down_votes":0,"body":"Espere 5 horas u_u Y como dije cuando salio mi pc del modo de reserva o suspencion le di click al icono del lol en la barra de tareas y desaparecio :C","replies":[{"poster":"Ride the tiger","date":"2016-02-05T23:32:37.415+0000","up_votes":1,"down_votes":0,"body":"No entiendo, por que se supone que tu PC entra a modo de suspensión? Probá abrir el administrador de tareas y termina todos los procesos que digan LoL.","replies":[{"poster":"Less Zero","date":"2016-02-05T23:34:51.521+0000","up_votes":1,"down_votes":0,"body":"Viste cuando no usas la pc por un determinado tiempo  y la pantalla se pone negra? A eso me refiero  pero no se como se llama =P Y ya abri el administrador de tareas y ningun proceso dice lol....I don't entender (Se pued e pasar una imagen? Asi te muestro que es lo que me aparece)","replies":[{"poster":"Ride the tiger","date":"2016-02-05T23:37:15.559+0000","up_votes":1,"down_votes":0,"body":"Pasa imagen si querés. Pero primero leete el post que te pasé a ver si te ayuda :)","replies":[{"poster":"Less Zero","date":"2016-02-05T23:38:47.689+0000","up_votes":1,"down_votes":0,"body":"Ya lo lei pero eso es problemas para actualizar y a mi lo que me pasa esque se me desaparece el icono :c ,ah decime como pasar image esque soy medio nuevo en esto de los foros.","replies":[]}]}]}]}]}]},{"poster":"Ride the tiger","date":"2016-02-05T23:34:44.237+0000","up_votes":1,"down_votes":0,"body":"Esto tal vez te sirva lo encontré recién. http://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/MfreBzlg-problemas-para-actualizar-","replies":[]}]}