{"poster":"Prspektiv","date":"2015-09-28T09:27:33.741+0000","title":"Duo Top Lane welche Champions agieren gut zusammen?","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hallo liebe LoL Spieler,\n\nich habe vor mit meinem Cousin mehr auf der Top Lane zu spielen. Die Championwahl war hierbei bis jetzt {{champion:11}}  + {{champion:78}} oder {{champion:78}} + {{champion:2}} .\n\nWas sagt ihr, ist diese Aufstellung gut?\n\nMit welcher Aufstellung spielt ihr?\n\nWas ist eurer Meinung nach das Top Lane dream Team?\n\nMfG {{champion:11}} {{champion:2}}","replies":[{"poster":"SoloQisMentlBoom","date":"2015-09-28T11:47:34.805+0000","up_votes":2,"down_votes":1,"body":"Wie einen die anderen immer versuchen in die aktuelle Meta zurückzudrängen. Spielt einfach worauf ihr Lust habt.\n\nIch würde dir auf der Toplane Champions empfehlen, die sehr aggresiv sind. Poppy und Olaf sind da ganz passend, aber haben kaum CC.\nSpeziell für die Toplane würde ich eine Kombination mit Gnar empfehlen. Er ist zZ relativ stark und agiert mit sehr vielen Champions sehr gut zusammen. z.B. mit Jarvan IV.. Die Ultimatecombo ist einfach krass. \nFalls du die Champions noch nicht kennst: Gnar ist ein Halbrange und halmelee Charakter. Er sammelt Wut und bei 100 Wut wird er zum \"Monster\" und Melee. In dieser Meleeform hat er eine Ultimate, die alle Gegner in einem bestimmten Radius in deine angegebene Richtung stößt. Treffen die Gegner hierbei auf eine Wand werden sie gestunnt.  Jarvan IV. ist ein Meleecharakter der einen Knock-Up hat und bei seiner Ultimate auf ein Ziel springt und in einem Radius um dieses einen unpassierbaren Mauerring erstellt.\nAlso wenn Jarvan ultet und danach Gnar die Leute in Jarvans Mauer, hast du einen Freestun in jedem Fight.\n\nSonst würde ich noch Yasuo und Wukong/Lee Sin empfehlen. Sie sind zwar etwas anspruchsvoller, aber auch sie interagieren sehr gut miteinander. Ausschlaggebend ist auch hier die Ultimatecombination.\n\nDie oben genannten sind jetzt alle auf Angriffsschaden basiert. Möchtet ihr aber jemanden mit Fähigkeitsschaden oder Hybrid in eurem Championpool, könnte Mordekaiser eine gute Wahl sein. Dieser ist auch nicht gerade leicht, aber kann auf Angriffsschaden, Fähigkeitsstärke und Hybrid gespielt werden. Mit ihm wäre dann CC (Stuns, Slows, etc.) vom Vorteil. Leona und Nautilus wären eine Möglichkeit.\n\nEs gibt hunderte von guten Kombinationen. Einfach mal viele Champions ausprobieren, dann findet sich schon was :)","replies":[{"poster":"Prspektiv","date":"2015-09-28T14:39:55.618+0000","up_votes":1,"down_votes":0,"body":"Danke dir! beste Antwort bis jetzt :) \n\nIch versuchs mal mit Gnar","replies":[]}]},{"poster":"Kayumin","date":"2015-09-29T06:15:55.970+0000","up_votes":1,"down_votes":0,"body":"Ich spiel zwar selbst nicht so viel Toplane aber sowas wie Darius und Mordekaiser stell ich mir aktuell doch recht brutal vor. Darius kann Gegner für Mordekaiser in Reichweite ziehen und verlangsamen und Mordekaiser kann Darius mit dem Schild unterstützen. Der Schaden von beiden ist relativ hoch und beide sind (je nach Build natürlich) auch tanky. Auf der Botlane wird das ähnlich gespielt mit Mordekaiser Leona sollte also wahrscheinlich auch gut auf der Top funktionieren, auch mit Darius. Ausserdem bekommt Mordekaiser zusätzlich immernoch Solo Lane EXP ist schon recht eklig.\n\nYasuo + Malphite ist auch eklig. Malphite hat nen wunderschönen Knock Up für Yasuo parat und der braucht nur einsteigen. Geht aber eigentlich mit allem was einen Knock Up hat ... Lee Sin, Darius ( E sollte auch als Knock up zählen ) etc etc\n\nDie Kombinationen sind fast endlos. Wenn ihr Lust habt könnt ihr mich ingame einfach adden und ich versuche euch weiterzuhelfen falls ihr unbedingt einen Champion haben wollt aber keinen passenden Partner findet ;)\n\nGrüße Kayumin","replies":[{"poster":"Prspektiv","date":"2015-09-30T07:16:35.625+0000","up_votes":1,"down_votes":0,"body":"Hey Kayumin,\n\ndas mit dem Team spielen hat sich jetzt erledigt da sein PC kaputt gegangen ist.\n\nJetzt muss ich wohl alleine spielen lernen ^^ \n\nlG {{champion:11}}","replies":[]}]},{"poster":"Ich Bin Pascal","date":"2015-09-28T09:45:37.138+0000","up_votes":1,"down_votes":1,"body":"wieso duo top ? es gibt 1 top und 1 jng btw ^^","replies":[{"poster":"Prspektiv","date":"2015-09-28T09:50:32.681+0000","up_votes":1,"down_votes":0,"body":"Wir sind noch im Unranked, da junglet niemand.","replies":[{"poster":"leonthefirefly","date":"2015-09-28T10:05:59.090+0000","up_votes":1,"down_votes":1,"body":"dann selber lernen =) nur weils die anderen können muss dass doch nicht für euch gelten ;) in 2 lvl gibts smite und dann kanns losgehen","replies":[{"poster":"OrangeBubble","date":"2015-09-28T23:10:00.088+0000","up_votes":1,"down_votes":0,"body":"Oder aber sie spielen weiterhin das, was ihnen Spaß macht. Nur weil jeder einen Jungler will, muss er es ja nicht lernen.","replies":[{"poster":"Powerjen","date":"2015-09-29T05:19:38.604+0000","up_votes":1,"down_votes":0,"body":"Das Problem dabei ist, dass langfristig ein gewisser Frust entstehen kann, wenn sie sehen dass sie damit nicht weiterkommen.","replies":[{"poster":"Busty Botter","date":"2015-09-29T05:30:33.758+0000","up_votes":1,"down_votes":0,"body":"Der Frust wird ab einem gewissen Level eher bei den Teammates entstehen. So ab Level 15 wird ein Jungler vom Team quasi gefordert, da man dann schon paar Masterie Punkte hat und Smite um halbwegs durch den Jungle zu kommen.\n\nRiot zwingt keinen zur Meta, aber viele Spieler tun es!","replies":[]}]}]}]}]}]},{"poster":"Chaos Hamster","date":"2015-09-28T13:32:10.589+0000","up_votes":1,"down_votes":0,"body":"Double Top ist zwar nicht standart und ich würde schon davon abraten aber wenn ich mit jemanden ne gute Kombi suche würde ich vllt sogar sowas spielen wie {{champion:34}}  + {{champion:150}}  oder aber iwas mit {{champion:157}}  + {{champion:54}} (oder ein anderer Knock up Champ).","replies":[]},{"poster":"LZ Flame","date":"2015-09-28T10:12:31.934+0000","up_votes":1,"down_votes":1,"body":"spiel lieber duo bot  spielt was ihr wollt, duo top ist derzeit sinnlos war viable vor dem den nerfs am reliktschild,{{champion:59}} +{{champion:89}}  ist ne gute Combo aber sonst naja,shaco + blitz ist witzig,blitz + allistar ist witzig,+blitz +tresh mit latern grabs,wie gesagt kein duo top spiel lieber duo bot dann verliert man den farm des jungles nicht","replies":[]},{"poster":"Powerjen","date":"2015-09-28T09:57:34.029+0000","up_votes":1,"down_votes":1,"body":"Duo Toplane ist suboptimal. Warum?\nEuch geht irgendwann zuviel Gold verloren weil Ihr beide den Farm braucht und ihr kommt erst spät an Eure (sehr teuren) Items dran. Und bis ihr dann konkurrenzfähig seid, ist das Spiel schon gelaufen. \nDas Duo ADC/Supporter auf der Botlane ist da besser dran, weil der Supporter schon als Startitem eines hat, das Bonusgold gibt, wenn der ADC die Minions killt. Auf diese Weise kriegt der ADC sein Gold zusammen und der Support geht nicht leer aus. Er kriegt zwar weniger, die notwenigen Supportitems kosten aber auch weniger, beim Sightstone angefangen.\n\nIhr könntet also Top/Jungle oder Top/Mitte besetzen. Das wäre deutlich besser. Und Eure Mitspieler würde es Euch danken.","replies":[]}]}