{"poster":"GeraltGwynbleidd","date":"2018-11-13T18:04:43.585+0000","title":"Actualización sobre la elegibilidad para recibir Honor de fin de temporada","subforum":"Comportamiento del jugador","up_votes":113,"down_votes":420,"body":"¡Hola!\n\n**Realizaremos un cambio a la elegibilidad de Honor para las recompensas de fin de temporada.**\n\nA principios de este año, cambiamos la política de recompensas de fin de temporada para que dependieran del nivel de Honor en lugar de las penalizaciones recientes. Durante las últimas semanas y meses, pusimos atención a los comentarios sobre lo mal que se siente caer hasta Honor 0 o 1 a causa de una restricción de chat en los últimos días de la temporada, por lo que volveremos a otorgar de forma única recompensas en el juego en febrero de 2019. Así es como funcionará todo:\n\nSi recibiste solamente sanciones de chat durante la temporada pasada, y estás en Honor 0 o 1, tendrás la oportunidad de regresar a Honor 2 hasta el 11 de febrero de 2019. Si en ese momento estás en Honor 2, recibirás las siguientes recompensas que ganaste con tu sangre, sudor y lágrimas: íconos de la liga en al que terminaste, el aspecto Orianna Victoriosa y sus chromas.\n\nLo anterior no se aplica a ningún otro tipo de penalización más severa, como suspensiones de 2 semanas, uso de bots, aumento de Elo/MMR, hacer trampa o suspensiones permanentes. Si recibiste una sanción de 2 semanas por dichos motivos, en cualquier momento de la temporada 2018, no serás elegible para las recompensas que se entregarán en febrero.\n\nEs posible ascender en ese plazo y, siempre y cuando juegues para ganar y no hagas que los demás tengan una mala experiencia, llegarás rápidamente solo con jugar unas cuantas partidas a la semana. Esto solo se aplica a tu nivel de 2018, así que aun si tu rango cambia, recibirás recompensas basadas en el rango que alcanzaste en noviembre.\n\nPara aclarar: mantendremos la elegibilidad de Honor en su lugar para futuras temporadas de clasificatoria. Los resultados de esta excepción única pueden ser útiles si decidimos explorar posibles ajustes a la experiencia de Honor 0 y 1 en el futuro.\n\nComo siempre, escucharemos tus comentarios sobre este cambio y, si aún estás en proceso de salir de Honor 0 o 1, ¡nos veremos en febrero!\n\n\n-------------------------------------\n\n**A modo de resumen:**\n\n\n* Solamente serán elegibles aquellos jugadores que recibieron restricciones de chat en esta temporada y que, con un comportamiento ejemplar, alcancen el nivel de Honor 2 a más tardar el 11 de febrero.\n \n* Si has recibido una sanción de dos semanas, exceptuando las que han sido por algún motivo de fraude por equivocación, no serás elegible para la entrega de recompensas en febrero.\n\n* Las recompensas que se entregarán en febrero a quienes hayan cumplido los requisitos son los iconos de liga, el aspecto Orianna Victoriosa y sus chromas.\n\n_Si quieres conocer más acerca de las recompensas de final de temporada, también puedes leer el artículo de [soporte al jugador](https://support.riotgames.com/hc/es-419/articles/360011986113)._","replies":[{"poster":"rokushoger","date":"2018-11-13T18:09:33.852+0000","up_votes":228,"down_votes":50,"body":"Dale nomás, incentivemos el flameo, denostemos el esfuerzo de los que fueron baneados y corrigieron su actitud a tiempo, tiremos a la basura a los invocadores que se bancaron estoicamente flameos de todo tipo y demos la oportunidad a aquellos que así sea solo por pesados (y de ser así durante bastantes partidas) estuvieron molestando a sus compañeros.\n\nLa peor política que he visto en años. \nCon que cara le decís a otra gente \"tenés que comportarte\" cuando ustedes mismos le dan la chance al que no se comportó.","replies":[{"poster":"Mayushi","date":"2018-11-13T22:40:54.475+0000","up_votes":25,"down_votes":7,"body":"Sorry, pero no.\n\nEn este server son lo peor, tengo una lista terriblemente larga de gente que encima de trollearle la partida a alguien y causarle una sancion, vienen a este foro a hacerse los copitos de nieve \"No tienes derecho a flamearme\", cuando son ellos mismos los que abusan de un sistema que en principio \"_es para acabar con la toxicidad y mejorar la conducta de la comunidad_\" , pero al contrario, **ellos lo usan a su favor para causar sanciones a proposito frente a cualquiera que no este de acuerdo con su muy \"peculiar\" forma de jugar** (Probar champ en ranked, irse AFK por perder linea, pickear TOP sin saber jugar ahí y feedear solo por no querer ir support, reportar gente llendo premade 4...-->Y podria seguir todo el dia, faltandole el respeto a todas las personas que apenas pueden jugar 1 o 2 al dia o muy al extremo 4-5 a la semana y esperan jugar una partida decente 5v5 solo para terminar al final del dia con honor 0 y chat ban de 10) o simplemente reportan por el morbo de querer ver la notificacion de que le causaste una sancion a alguien despues de trollearle la promo en estos ultimos meses, y decir al final de la partida \"Chau bronce te quedaste sin recompensas\"---> esto lo he visto MUCHISIMAS veces, gente con la que hablo tambien lo menciona. Solo quieren la via libre para molestar gente en ranked sin que nadie les pueda decir nada, jamas.\nLa parte mas graciosa de todo esto es que hay  al menos 12 personas que tengo anotadas quejandose en este tema al momento de mi post porque Riot acaba de hacer que su super estrategia de trollear sin chatear y abusar con los reports a diestra y siniestra resultara un fiasco al final del dia. \nApuesto que si los publico con nombre y todo junto a los nombres de quienes resultaron con reset de honor 0 por su accionar (incluyendo como soporte rechaza revocarlos) me como alto baneo de este foro y server por caceria de brujas.\nLa unica lucha que se puede pelear es cuando te topas a estos personajes. Hay que tratar de reconfortar a los otros 3 de tu team que no caigan en su juego y se coman un reset de honor por haber dicho \"Bueno gente, bg con ese troll imposible\", y ser un jugador con buena conducta deportiva y tambien avisarle al team rival si tuviste la suerte de que ese troll les tocara a ellos.\n\nQue tengan un buen día, mis deliciosos copitos \"Yo nunca hice nada\"\nNada bueno sale de darle a alguien el poder de quitarle la cuenta a otro, y eso es exactamente lo que permite el bot actual. Era de esperarse el abuso del sistema.","replies":[]},{"poster":"XxthorynxX","date":"2018-11-13T21:45:41.336+0000","up_votes":3,"down_votes":9,"body":"***","replies":[{"poster":"rokushoger","date":"2018-11-13T21:48:27.219+0000","up_votes":17,"down_votes":2,"body":"> si te pones a entender y usar un poco mas tu cabezita \n\nCon la forma en que te me estás dirigiendo me estás dando la razón XD.","replies":[]}]},{"poster":"Phaedra","date":"2018-11-13T19:13:48.663+0000","up_votes":34,"down_votes":72,"body":"Sinceramente, de que se quejan? Tan flammers reprimidos son que \"se aguantaron\" todo el año sin decir nada para tener un ward? Esta medida es buena para todos, ya que el que no flameo nunca, no lo va a seguir haciendo. El que se rehabilito, tampoco. Y que hacemos con los que siguen flameando? Y bueno, incentivemoslos, y vamos a tener 3 meses con menos flameos.\n\nEn serio, me da asco esta comunidad, se cagan en las medidas que busquen menos toxicidad solo porque quieren sentirse \"unicos\" con un ward que los diferencie. Si tanto reprimieron y tanto les costo no flamear, replanteense su vida. No hay que ser toxico por naturaleza, no por un premio mediocre.\n\nLlenenme de negativos, porque la verdad les duele.","replies":[{"poster":"AskeIadd","date":"2018-11-13T19:22:42.085+0000","up_votes":22,"down_votes":45,"body":"buen comentario, pareciese que les doliera una parte del cuerpo que no da luz, por el simple motivo de no haber flammeado.","replies":[{"poster":"Lord Khada","date":"2018-11-13T19:28:09.386+0000","up_votes":29,"down_votes":11,"body":"> [{quoted}](name=Lilithium,realm=LAS,application-id=PJAKt7ph,discussion-id=6HiGOKxF,comment-id=000000020000,timestamp=2018-11-13T19:22:42.085+0000)\n>\n> buen comentario, pareciese que les doliera una parte del cuerpo que no da luz, por el simple motivo de no haber flammeado.\n\nVos y los que comentan como vos estan perdiendo de vista el punto, que definitivamente no es el que estas marcando, sino el hecho de haber cambiado de opinion a ultimo momento por parte de la empresa en una de sus mas vanagloriadas reglas que es la de cero tolerancia al mal comportamiento. No se vos, pero esta decision no cabria en la parte de \"cero tolerancia\"","replies":[{"poster":"Phaedra","date":"2018-11-13T19:34:47.356+0000","up_votes":10,"down_votes":37,"body":"Seguro que si la decision fuese de \"aumentar el plazo para subir de liga\" no te quejabas. Asi podias llegar a gold...","replies":[{"poster":"Lord Khada","date":"2018-11-13T19:41:14.581+0000","up_votes":25,"down_votes":2,"body":"> [{quoted}](name=Phaedra,realm=LAS,application-id=PJAKt7ph,discussion-id=6HiGOKxF,comment-id=00000002000000000001,timestamp=2018-11-13T19:34:47.356+0000)\n>\n> Seguro que si la decision fuese de &quot;aumentar el plazo para subir de liga&quot; no te quejabas. Asi podias llegar a gold...\n\nNo entiendo tu punto, no se que tiene que ver una cosa con la otra......soy oro III en flex igual. Pareciera que es un deporte desviar el tema.","replies":[]}]}]}]},{"poster":"Nerf Aery","date":"2018-11-13T21:18:07.273+0000","up_votes":3,"down_votes":1,"body":"Es como si en la universidad, un vago que faltó el 30% de las clases al final pueda promocionar por hacer dos trabajos prácticos pedorros, mientras vos estuviste asistiendo al 100% de las clases y aprobaste parciales con 9.","replies":[{"poster":"Phaedra","date":"2018-11-13T21:37:25.995+0000","up_votes":2,"down_votes":1,"body":"Con ese criterio, tampoco debería haber recuperatorios, ni llamados \"extra\" como suele suceder. Además cual es el criterio de \"vago\"? faltar? Me recibi rindiendo casi el 70% de la carrera libre porque me parecia mas productivo estudiar en mi casa que las clases pedorras de los profesores...\n\nSos de los que promociona con 10 y le jode que alguien promocione por recu? Quedate tranquila, que si no te dedicas al ambito academico, las notas no sirven de nada. Saludos!","replies":[{"poster":"Nerf Aery","date":"2018-11-13T21:45:06.194+0000","up_votes":1,"down_votes":2,"body":"Por \"vago\" me refiero a un compañero de curso. Te felicito por rendir libre pa, yo promocioné pedagogía con 9 sin haber tocado un texto, dame mis premios.\n\nY que haya recuperatorios, pero que no te aprueben con un siete, que te aprueben con la mínima nota necesaria para aprobar.","replies":[{"poster":"Phaedra","date":"2018-11-13T23:57:22.232+0000","up_votes":2,"down_votes":0,"body":"Vos mismo lo dijiste, sin estudiar aprobaste. Es como el flammer asqueroso que puso mute all, espameo señales todo el año, pero se lleva su ward. \n\nPor lo visto, lo unico que te gusta es lo que te sienta bien a vos! felicitaciones\n\nPD: pasame la carrera (o privada) donde podes aprobar sin estudiar, que quiero hacer un master pero no tengo tiempo para andar leyendo...","replies":[]}]}]}]}]},{"poster":"Hyrule","date":"2018-11-13T20:42:33.933+0000","up_votes":7,"down_votes":20,"body":"> [{quoted}](name=rokushoger,realm=LAS,application-id=PJAKt7ph,discussion-id=6HiGOKxF,comment-id=0000,timestamp=2018-11-13T18:09:33.852+0000)\n>\n> Dale nomás, incentivemos el flameo, denostemos el esfuerzo de los que fueron baneados y corrigieron su actitud a tiempo, tiremos a la basura a los invocadores que se bancaron estoicamente flameos de todo tipo y demos la oportunidad a aquellos que así sea solo por pesados (y de ser así durante bastantes partidas) estuvieron molestando a sus compañeros.\n> \n> La peor política que he visto en años. \n> Con que cara le decís a otra gente &quot;tenés que comportarte&quot; cuando ustedes mismos le dan la chance al que no se comportó.\n\namigo, estás quejándote de que a otro le van a dar las recompensas si llega a honor 2, cuando por tu parte deberías tener honor sin problemas, no un logro o un esfuerzo... lol","replies":[{"poster":"rokushoger","date":"2018-11-13T21:05:15.374+0000","up_votes":16,"down_votes":4,"body":"Y tengo el honor sin problemas, pero no quita que me molesta que me flameen y hago un esfuerzo por aguantarme y no responder.","replies":[{"poster":"Hyrule","date":"2018-11-15T20:32:37.261+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=rokushoger,realm=LAS,application-id=PJAKt7ph,discussion-id=6HiGOKxF,comment-id=000000030000,timestamp=2018-11-13T21:05:15.374+0000)\n>\n> Y tengo el honor sin problemas, pero no quita que me molesta que me flameen y hago un esfuerzo por aguantarme y no responder.\n\nEs que justamente en un juego utópico, el \"no ser tóxico\" debería salirte natural, no debería ser un esfuerzo.","replies":[]}]}]}]},{"poster":"Ugr0ch","date":"2018-11-13T18:11:39.647+0000","up_votes":91,"down_votes":14,"body":"Un asco, debería darles vergüenza. Los flammers matan el juego y la comunidad, pero vamos a darles segundas oportunidades. SON UN CHISTE, PERO DE LOS MALOS","replies":[{"poster":"Kata Killer","date":"2018-12-07T03:20:33.352+0000","up_votes":2,"down_votes":0,"body":"escribiendo este post es lo mas toxico.","replies":[]}]},{"poster":"PoorBoy","date":"2018-11-13T18:10:32.066+0000","up_votes":62,"down_votes":9,"body":"Me parece una falta de respeto. ¿Cómo esperan que le tomen el peso a tener una competencia sana si dan perdonazos a la toxicidad? ¿Que sigue, perdonazos al eloboost? Tratamos de mejorar la comunidad pero al hacer eso se pierde el peso de las sanciones. Decepcionante, como si ya no fuera frustrante ver que muchos de los tóxicos siguen con honor y solo cayeron unos pocos... ","replies":[]},{"poster":"Delete Zoë","date":"2018-11-13T18:36:34.433+0000","up_votes":33,"down_votes":5,"body":"Jajaj dejense de joder, esto es una falta de respeto para todo el mundo. La temporada pasada no recibí recompensas y estuve toda la season sin marco, por el tema del honor, me la banqué como un campeón, esta season jugué muteando a todo el que me flameaba y ustedes piensan darle una segunda oportunidad a esta gente? Los tóxicos matan a la comunidad, ustedes los ayudan.","replies":[]},{"poster":"Mascheranox","date":"2018-11-13T18:15:27.757+0000","up_votes":43,"down_votes":14,"body":"que desastre que son, me mate jugando semanas para llegar a honor 2 y a estos les dan un beneficio déjame de joder loco\nque bronca que tengo,y esto no soluciona nada con el flameo esto los beneficia para seguir flameando... siempre malas deciciones riot un desastre\n\n\nllenen de negativos este post.","replies":[{"poster":"Sêrena","date":"2018-11-14T15:31:45.069+0000","up_votes":4,"down_votes":1,"body":"Yo estuve jugando también como más de 20 partidas  por día para llegar a honor 2 antes que termine la season y ahora salen con esto Jajajajajaj me río para no llorar","replies":[]}]},{"poster":"Lord Khada","date":"2018-11-13T18:37:23.814+0000","up_votes":28,"down_votes":5,"body":"Lo patetico de este post me llega a las entrañas la verdad. Ustedes como empresa se cavan su propia tumba; se llenan la boca hablando, promoviendo y hasta haciendo de ello una regla FUNDAMENTAL de su propio juego, la cero tolerancia al mal comportamiento; luego, le dan segundas oportunidades a gente que no se la merece.....cero coherencia.\n\nLo otro es que se vomitan en la cara de la gente que JAMAS recibio ningun tipo de sancion en todo el año, tuvieron comprotamiento ejemplar frente a gente que definitivamente merecia ser baneada instantaneamente y fueron Honor 5 casi desde el principio de la temporada....nada mas que verguenza y falta de respeto hacia estos usuarios.\n\nDe mi parte a mi, desde hoy, no me pidan respeto ni buen comportamiento ni en el foro ni en el juego. Ustedes son la escencia misma (junto a muchas otras empresas) de todo lo repulsivo que existe en el mundo del gaming....va....una mas del monton.\n\nAsco, pena, y como diria The Comedian.....un chiste, un mal chiste.....","replies":[]},{"poster":"McLennon","date":"2018-11-13T18:28:53.094+0000","up_votes":27,"down_votes":6,"body":"Bueno gente hasta aca llegue en el foro, siempre trate de dejar comentarios que sirvan para evitar caer en el juego de los flamers, como manejarse si alguien te arruina la partida trolleando, como mejorar para no tiltearse si te provocan en el chat, contando mis experiencias con la comunidad, etc. Pero ahora no tiene sentido si toman decisiones que te tiran abajo todos los comentarios que aportaban a mejorar la comunidad, porque desvalorizan el reporte, ya no tiene el peso de antes si total después te dan otra chance, piensan en darle una oportunidad al que flameo y desprecian al que tuvo que aguantar que lo insulten, que también pudo haber recibido insultos en varias partidas y no solo la del que \"se equivoco una sola vez y flameó\"\nEn fin, seguire mutenado a todos y jugando para mejorar pero  ya no me gasto mas en querer mejorar esto en el foro, saludos","replies":[{"poster":"Kata Killer","date":"2018-12-07T03:45:56.955+0000","up_votes":1,"down_votes":2,"body":"no me hagas reir... en primer lugar mi estimado,  hay gente que reporta solo por capricho y usa el reporte como uso negativo y abuso del ban, incluyendo si alguien de tu team no tiene la sabiduria necesaria para jugar lo que pickeo, debes de ayudarlo no reportarlo, haci nacen los flamers.\n\nY lo otro, si riot da segundas oportunidades es para cambiar la actitud de los flamers , ya que haciendo esto los flamers valoraran su cuenta junto a las cosas que ganaron y no tendran mas la mentalidad de niño rata para flamear, te lo digo yo que en mis partidas no muteo, juego en silencio y aveces que otras juegan mal en mi equipo, pero doy una critica constructiva positiva y si perdemos, que almenos vean videos de los personajes que quieran ocupar, sus runas adecuadas etc..  algunos se la toman a mal y piden que me reporten, esa misma gente es la que aveces anda por ahi en el foro queriendo dar castigo a los flamers siendo que ellos no aportan nada para el \"flamer\" que la esta pasando mal.","replies":[{"poster":"McLennon","date":"2018-12-08T15:17:04.419+0000","up_votes":2,"down_votes":0,"body":"El \"no me hagas reir\" del principio es un buen argumento. Mi comentario es PERSONAL, hablo de lo que veo en las partidas y como voy a actuar en el foro por el cambio que hicieron. No me interesa andar de justiciero/educador en la grieta cuando juego, queriendo ayudar a gente que no le interesa mejorar, si alguien me habla después de la partida con gusto, pero mientras se juega nadie quiere que le marquen los errores (lo intente varias veces sin éxito). Los que reportan por capricho no cuentan, siempre lo explican, si yo reporto a alguien porque no me gusto como actuó en tal jugada o porque se me dala gana y si el sistema verifica que no hubo motivo para reportar, mis reportes pierden valor si lo sigo utilizando así. Como dije antes al que recibió todo el flameo de varios se la tiene que aguantar igual y encima dan otra posibilidad a los que flamearon sabiendo que se termina la temporada y perdían todo, tenían todo un año para cambiar o mejorar la actitud, porque siempre esta el pensamiento del flamer \"naa a mi no me van a hacer nada los de rito gg\", soy testigo en cada partida de como se aprovechan de este cambio que hizo Riot con gente que festeja que al final no sirvió de nada que lo reporten porque aun puede conseguir las recompensas.","replies":[]}]}]},{"poster":"Diosmo","date":"2018-11-13T18:38:46.144+0000","up_votes":10,"down_votes":1,"body":"Una falta de respeto me parece este post.","replies":[]},{"poster":"Alexia","date":"2018-11-13T20:25:29.123+0000","up_votes":12,"down_votes":3,"body":"Dan ASCO! los únicos que les dan votos positivos son los flamers y gente toxica que no tenia chances de recibir la recompensa por su mal comportamiento.","replies":[{"poster":"Kata Killer","date":"2018-12-07T03:49:00.050+0000","up_votes":2,"down_votes":0,"body":"Yo le daria un millon de votos positivos, por que enrealidad se la estan jugando y son genios, realmente algunos usuarios \"flamers\" pueden cambiar con este metodo, ya que algunos empezaran a valorar su cuenta cuando tengan sus premios de temporada, y no tendran mentalidad para flamear, y solo para proteger su cuenta de cualquier futuro ban. \nSaludos y escribiendo \"asco\" ya es ser toxico.","replies":[]}]},{"poster":"Salvor","date":"2018-11-13T18:45:13.970+0000","up_votes":9,"down_votes":1,"body":"https://uploads.disquscdn.com/images/a2ed0f84b50f9877c4a063a36c116ffcb028a466bd148829d9776ac0d3694e6a.jpg","replies":[]},{"poster":"Nabuze","date":"2018-11-13T18:41:57.157+0000","up_votes":9,"down_votes":1,"body":"¿Que clase de justicia es esta?\n¿En serio estuvieron recalcando toda la season lo importante que es el honor 2 y lo cambian despues de que la season termina?\nEs un chiste....\n¿Que sigue? ¿Dejar jugar clash a los honores 0?\nTanto por el foro de Euw, NA y Las no veo mas que descontento con esta terrible decision.\nEspero que lo pongas en chinchetas antes de que se hunda en negativos","replies":[]},{"poster":"Mazoku","date":"2018-11-13T18:15:08.991+0000","up_votes":23,"down_votes":15,"body":"Hola!\n\nYa que cambian todo despues de terminada la temporada tenia algunas preguntas:\n\n1) Yo termine en platino, a riot le va a pintar darme el marco de hierro 4 o me van a dar el del platino?\n\n2) La skin victoriosa es de oriana o cambiaron eso tambien?\n\n3) La temporada termino hoy o termino en otra fecha? Ya que cambiaron algo asi no me sorprenderia escuchar que digan \"al final la temporada termino hace 1 mes, te la creiste cuando dijimos que terminaba en noviembre xdxd\".\n\n4) Las recompensas que anunciaron las van a entregar o era todo una joda?\n\nEspero con ansias su respuesta.\n\nNo porque les vaya a creer lo que dicen sino para reirme un rato mas de sus incoherencias.","replies":[{"poster":"500w Padoru","date":"2018-11-14T00:38:47.381+0000","up_votes":3,"down_votes":1,"body":"Gente, entiendan que este comentario es lo más irónico y sarcástico que existe, no lo revienten a negativos que es buenísimo.","replies":[]}]},{"poster":"PasoPackXHonores","date":"2018-11-13T20:23:15.592+0000","up_votes":10,"down_votes":3,"body":"Que??? A principios de octubre me dieron ban de chat por flammer, y me dije: chau recompensas. Y que fue lo que hice? Estuve todo el put... mes de octubre jugando amistosamente sin flamear, siendo buen compañero de equipo. TODO EL PT MES. para que? para llegar a honor 2 luego de reformar mi comportamiento y ahora resulta que todos los ratas que siguieron flameando tienen chance? Encima hasta el 11 de febrero? es JODA? ES JODA? Vayanse a la re p... que los re p...\n\nSi hubiese sabido que tenia tiempo hasta el 11 de febrero. No hubiese jugado como enfermo todos los días, y hubiese hecho algo mas productivo con mi vida \"social\". Total, tenia 3 meses para hacer lo que hice en 1. MATATE RITO","replies":[]},{"poster":"Nechu","date":"2018-11-16T06:26:28.144+0000","up_votes":5,"down_votes":0,"body":"No estaria entendiendo por que la gente que tiene buen honor le importaria tanto esto, es solo para gente que tuvo un pequeño desliz  , no para los que flamearon toda la season , mucha toxicidad aca como para ser gente que tiene \"tanto honor\" , no tendria que ser  un sacrificio no ser toxico , tendria que ser algo natural.... {{sticker:sg-lux-2}}","replies":[]},{"poster":"Ðear Kat","date":"2018-11-16T18:10:37.221+0000","up_votes":4,"down_votes":0,"body":"Tanto sufre la gente con \"Honor 5\" tanto sufrieron por aguantar el no flamear? eso debe ser algo normal no algo obligado de lo que digas: \"Yo con tanto esfuerzo y sufrimiento tuve que aguantar meses callándome la boca para que vengan a perdonar\" es simplemente dar mute all no se que tanto alucinan y bueno vamos a odiar a los que \"No pudieron resistir y flamearon\" a un troll o a un feeder 0/20 por que claro a ellos hay que perdonarlos. Pero bueno que sepan que se perdone a los que cometieron la falta MAS MÍNIMA en este juego y que se les de recompensas no los hace menos especiales a ustedes panes de dios por conveniencia nadie les va a quitar su ward de honor ni sus fragmentos de llave. {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"UnderF4k3","date":"2018-11-13T19:24:43.648+0000","up_votes":4,"down_votes":0,"body":"yo fui sancionado y puedo decir que esto que hizo rito, es una vergüenza completamente., ahora los que no toxiqueaban lo van hacer ya que se sienten que su privilegio dejo de ser exclusivo, en conclusión, rito sos una maquina de hacer cagadas, y te lo dice alguien que no tuvo honor en toda la season.","replies":[]},{"poster":"pl4yer","date":"2018-11-14T13:25:52.424+0000","up_votes":5,"down_votes":1,"body":"Un asco, debería darles vergüenza. Los flammers matan el juego y la comunidad, pero vamos a darles segundas oportunidades. SON UN CHISTE, PERO DE LOS MALOS.\n\nSe ve que no aprendieron de la cagada que hicieron con el evento de la fiesta de las mascaras/carnaval donde la comunidad los revento a negativos al \" compenzar\" la falta de esfuerzo de la gente... Si no que ademas ahora le dan beneficios a los toxicos, bien Rito, dan 1 paso adelante y 5 para atras.\nRecuerdo muy bien que a principio de año avisaron que el sistema de honor seria un arma de doble filo ( beneficios/castigos), pero hay que vender RP verdad?\n\nPara los que vengan llorando de que toxiquearon en una partida y por eso los sancionaron, ya les aclaro que es mentira, debes flamear reiteradas oportunidades para que te caiga el ban y existe una solucion a su problema /MUTEALL!!!\n\n{{sticker:sg-ahri-3}} \n\n\nPD: Vamos a trollear en la S9 capas me den un marco, croma y skin adicional como beneficio. . . . .\n\nBG Rito... BG","replies":[]},{"poster":"Sic4rio","date":"2018-11-26T23:42:13.110+0000","up_votes":3,"down_votes":0,"body":"Para la gente que solo vino a descargar odio, quiero comentarles mi caso particular, que seguramente habrá muchos parecidos. \n4 seasons sin sanciones , honor 5 la season pasada, a tan solo un nivel de llegar a honor 5 , durante el mes de octubre , me topo con 2 personas (premades) en ranked (un día difícil , una semana que venia con problemas, etc). Comienza la partida y pongo /mute all , (algo que ya es habitual en nuestro servidor si queres jugar tranquilo), marchaba todo bien , pero veo que no paran con las señales y se va el jungla afk, por lo visto hubo una discusión que no me entere, desmuteo para saber que esta sucediendo y era un todos contra todos, el adc y el top se ponen a trollear (los premades) , mientras todos se seguían insultando HABLE , sin dudas la peor decisión que tome, me empezaron a decir de todo , y yo que venia con la mala semana , le fui sincero y me fui de tema con las palabras. Como si esta partida fuera poco , me tocan los mismos en la siguiente, ya en esa volvieron a reportarme como duo y esa misma noche cae la sanción , no me queje porque en el chat que te mandan de referencia aparecía el momento en el que yo insulte. Al rato me agrega como amigo uno de los 2 , se ve que lo banearon también o porque se había quedado con ganas de insultarme. \n\nEl que siempre fue tóxico no va a cambiar su comportamiento , yo tuve un desliz como seguramente lo tuvieron muchos que se encontraron con una sanción al final de la temporada, es un castigo fuerte por ser la primera vez en 4 años , de estar casi honor 5 a honor 1 , es frustrante , no todos podemos dedicarle 20 partidas al día para recuperar el honor en un mes, creo que tomaron esta decisión de segunda oportunidad por la cantidad de casos similares al relatado. Ademas piensen que el verdadero tóxico , tiene 3 o 4 cuentas , no le importa que lo reporten , ni siquiera quiere las recompensas.\nLa única solución seria devolver el tribunal a la gente y dar recompensas por ello, la maquina puede fallar muchas veces.\n\nSolo quería expresarme libremente en el foro y dar a conocer un caso de los tantos que debe haber.\n\n_Perdón por la poca capacidad de resumen y si llegaste hasta acá , gracias por tu tiempo._","replies":[]},{"poster":"TheKiller Justin","date":"2018-11-13T18:13:59.260+0000","up_votes":20,"down_votes":41,"body":"Yo opino que, si alguien perdió su honor pero recapacitó, se esforzó por cambiar, y logró progresar su nivel de honor pero no llegó al 2 por el tiempo (Porque cuesta mucho), merece esa oportunidad.\nEl tema es que muchos aún sabiendo que por ser sancionados perdian las recompensas, no tuvieron cuidado y se dejaron llevar por sus impulsos, teniendo también en claro cuando terminaba la temporada y todo.\n\nPara mí, si la sanción fué hace algún tiempo ya, debería darse la oportunidad. De lo contrario si la restricción se la dieron hace bastante poco, no.\nQuizás suene injusto, pero sabiendo que ya terminaba la temporada era cuestión de tener cuidado.\nNo deja de estar mal que habiendo roto reglas se les de una oportunidad, pero si realmente cambiaron pero no llegaron a honor 2 me parece muy justo.","replies":[{"poster":"xHyurno","date":"2018-11-13T20:34:16.520+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=TheKiller Justin,realm=LAS,application-id=PJAKt7ph,discussion-id=6HiGOKxF,comment-id=0003,timestamp=2018-11-13T18:13:59.260+0000)\n>\n> Yo opino que, si alguien perdió su honor pero recapacitó, se esforzó por cambiar, y logró progresar su nivel de honor pero no llegó al 2 por el tiempo (Porque cuesta mucho), merece esa oportunidad.\n> El tema es que muchos aún sabiendo que por ser sancionados perdian las recompensas, no tuvieron cuidado y se dejaron llevar por sus impulsos, teniendo también en claro cuando terminaba la temporada y todo.\n> \n> Para mí, si la sanción fué hace algún tiempo ya, debería darse la oportunidad. De lo contrario si la restricción se la dieron hace bastante poco, no.\n> Quizás suene injusto, pero sabiendo que ya terminaba la temporada era cuestión de tener cuidado.\n> No deja de estar mal que habiendo roto reglas se les de una oportunidad, pero si realmente cambiaron pero no llegaron a honor 2 me parece muy justo.\n\nclaro!,yo puedo decirte,me sancionaron un par de veces pero porque boludeabamos cuando iniciaba la partida,decime quien no dice \"report x manco\" cuando inicia la partida jugando con amigos?,te lo toman como si no fuera así y fuera agresivo. Actualmente estoy en Honor 1 2/3 y no llegué a tiempo.","replies":[{"poster":"TheKiller Justin","date":"2018-11-13T20:57:58.262+0000","up_votes":3,"down_votes":0,"body":"Seguro, ese tipo de bromas las deberían tener en cuenta cuando investigan, el tema es que como quien analiza eso es un bot, no sabe si es broma o no, solo ve un insulto :/\nPero tal cual, me parece perfecto que como a vos y muchos otros, que quedaron ahí cerca del honor 2 después de tanto esfuerzo por subir puedan lograrlo.","replies":[]}]}]},{"poster":"Nephilegor","date":"2018-11-13T19:57:14.391+0000","up_votes":3,"down_votes":0,"body":"Riot tomen en cuenta que los que estamos en contra de esto somos quienes tenemos buen honor dentro del juego, imaginense la gravedad de esta medida.\nEstoy deacuardo que los nuevos cambios de honor afectaron a la \"costumbre de la mayoria\" y por eso se quejan, pero deben de ser firmes en sus decisiones para controlar la toxicidad de la comunidad.\nDan a entender que trataran de resolver los problemas para que todos esten felices, ¿qué pasa si digo que no pude ganar el 2do croma de la skin victoriasa, sólo alcance a ganar 45 partidas? ¿acaso me daran más opciones para poder tener ese chroma? En lo personal no estoy deacuerdo que cambien las normas finalizando la temporada.\nMínimo si quieren realizar estas acciones podrían hacer que los que tuvieron honor 2+ al finalizar la temporada tengan una recompensa única que nos diferencie de aquellos que obtienen las recompensas por esta medida.\nEspero que como tuvieron el agrado de leer lo que cree la comunidad \"honor 1-\" con respecto a las sanciones, también escuchen a los de honor 2+\n\nEdito:\n\n> [{quoted}](name=Hachi1,realm=LAS,application-id=PJAKt7ph,discussion-id=6HiGOKxF,comment-id=001c,timestamp=2018-11-13T19:43:18.063+0000)\n>\n> Buenísima iniciativa. Los demás dejen de llorar. Rokushoger eres un chiste de ayudante. Lamebotas.\n\nLes parece que este tipo de personas merece recompensas.","replies":[]},{"poster":"TheKiller Justin","date":"2018-11-13T19:19:20.582+0000","up_votes":3,"down_votes":0,"body":"Traigo acá el [comentario](https://boards.euw.leagueoflegends.com/es/c/aspectos-y-conceptos-de-campeones-es/Rte7jTKZ-actualizacion-de-los-requisitos-de-honor-de-final-de-temporada?fbclid=IwAR2PnGwwuECES3v04ICLXLOerQoU0jD9OBgv4vbwaW0X1znhVlaKe__Wf50&comment=000c) de **Tensai1031**, usuario/a de EUW:\n>No me parece correcto ya que se perdona la toxicidad no te restringen por tener un mal día hablamos de gente que empeora la experiencia de juego bastante a menudo a los demás jugadores.** Y por ejemplo porque a estos jugadores restringidos se les da la oportunidad de subir de honor y a otros jugadores que por ejemplo quieran alcanzar el nivel 5 siendo 4 no se les da este tiempo extra ? Lo merecen menos ?**\n\nBastante acertado el comentario, y bastante injusto por parte de Riot.\nDenme mis recompensas por ser honor 3, y si llego a 4 o 5 en febrero denme esos centinelas también.","replies":[]},{"poster":"El periico","date":"2018-11-15T06:10:38.179+0000","up_votes":4,"down_votes":1,"body":"Riot siempre defendió y siempre defenderá a la lacra de la comunidad, ¿por que? porque la muy gran mayoría de los jugadores son basura, son flammers o tóxicos o trolls. Obviamente no les va a convenir poner sanciones serias, de por si ya pierden jugadores día a día y el juego se les va a la mrd, arreglar la comunidad seria matarse solos. \n\nA este tipo me lo tope un sin fin de veces, en todas cada jugador lo odio y de seguro lo odiaron, pero sorpresa... su cuenta sigue intacta, ¿sorprendente? en lo absoluto, siempre riot va a proteger a los tóxicos.\n\nhttps://imgur.com/a/92XTK1f","replies":[{"poster":"Zippy Zenpin","date":"2018-11-15T11:40:38.049+0000","up_votes":2,"down_votes":0,"body":"Ese niño del Hide on... siempre que veo un Hide en normal esta troleando. Yo siempre veo gente con nombres casi parecidos jodiendo partidas, o sea, gente que se dedica a hacer multicuentas para romper las pelotas.","replies":[]}]},{"poster":"ForniteValeKK","date":"2018-11-14T17:00:44.551+0000","up_votes":4,"down_votes":1,"body":"Osea que no importara como te comportes dentro del juego tendras tu recompensa igual? Gg riot","replies":[]}]}