{"poster":"Mini Error v2","date":"2017-07-08T20:04:29.285+0000","title":"League won't reinstall, I keep getting \"Unspecified error occurred\" message.","subforum":"[ARCHIVED] Help & Support","embed":{"description":null,"url":"http://i.imgur.com/GRU7dqu.png","image":"http://imgur.com/GRU7dqus.png"},"up_votes":1,"down_votes":0,"body":"Decided to reinstall League since the old shortcut on my computer stopped working and it would crash when I clicked on it. So I deleted everything Riot Games/League related from my pc and then I reinstalled it. Unfortunately, I keep getting the \"Update Failed, Unspecified error occurred\" screen right after I open League. Is there any way to fix this? \r\n\r\n{{sticker:zombie-nunu-bummed}}","replies":[{"poster":"Porocles","date":"2017-07-08T20:11:11.280+0000","up_votes":1,"down_votes":0,"body":"This update failed error can happen if your OS settings is preventing access to your game files.  Run through the steps in the [permissions](https://support.riotgames.com/hc/en-us/articles/204134104-Setting-up-your-Permissions) guide to restore that access, and get updated to the new version.  Let me know if you have any questions!","replies":[{"poster":"Mini Error v2","date":"2017-07-08T20:38:04.485+0000","up_votes":1,"down_votes":0,"body":"I followed the steps but I'm still getting the same message, I don't know why :(\nWhen I try to run it as an administrator it adds a \"lockfile\" to the folders in League of Legends on my computer. I dunno if that has something to do with it, but I'm just guessing at this point. \n\nI really wanna get back to playing League :/","replies":[{"poster":"Mini Error v2","date":"2017-07-08T20:42:13.970+0000","up_votes":1,"down_votes":0,"body":"OHMYGODIFIGUREDITOUT.\n\nOk so I was having trouble also connecting to YouTube through Chrome since it kept saying my connection wasn't secure. My computer had the date set to the 22nd of October 2017, so I switched it to the correct date, and now everything works! :o\n\nSorry for the trouble and thank you for the response you gave! {{sticker:slayer-jinx-catface}}","replies":[]}]}]}]}