{"poster":"Speak or Die","date":"2018-09-18T04:06:23.108+0000","title":"Riot, when will you guys explore Zilean and Icathia in more depth? Before its fall.","subforum":"Story, Art, & Sound","up_votes":18,"down_votes":0,"body":"I&#039;m pretty invested in Icathia lore. I love it so much. Zilean has so much potential to be such an amazing character with a lot of depth.","replies":[{"poster":"Riot Scathlocke","date":"2018-09-18T17:30:31.092+0000","up_votes":14,"down_votes":0,"body":"I'd love to explore old Icathia more!\n\nWith stories set before the \"now\", we have to find a good reason to tell them, usually one that supports a new release or lore update. We don't have the writer or editor bandwidth to explore every part of the setting at the moment... but in future, that's certainly the plan :-)","replies":[{"poster":"Pale Mask","date":"2018-09-18T17:38:58.201+0000","up_votes":8,"down_votes":0,"body":"Have you come up with any ideas concerning Zilean? I love his standard wizard look, but it clashes with his magical clock and pointy ears.\n\nHis personality and powers have the potential to make him into one of the most influential characters in the lore. Maybe he was one of the mage-kings, or some kind of celestial scholar? Does he know Jax?","replies":[{"poster":"Oleandervine","date":"2018-09-18T17:43:43.478+0000","up_votes":3,"down_votes":3,"body":"Eww, no. Zilean should never be any kind of king. That would just ruin him. He's a doddering old time wizard who made a breakthrough at the expense of his anchor in reality. So while I am ok with them making it so he's not perpetually mentally lost in time, he still needs to remain the time wizard who vanished in his city's hour of need.","replies":[{"poster":"Valor Bot","date":"2018-09-18T19:57:42.752+0000","up_votes":7,"down_votes":1,"body":"Given how outdated Zilean is as a champion and how much potential he has within his theme, I think he could be taken in a lot of different directions that isn't just \"doddering old time wizard\". That may be the most desirable option for people attached to his current lore, gameplay and VO, but as someone who sees potential within the \"chronolord\" archetype I think he could be so much more; even an Aspect of Time, which would probably be the most epic realization of the fantasy you could achieve within the League universe.","replies":[{"poster":"Oleandervine","date":"2018-09-20T15:42:38.378+0000","up_votes":2,"down_votes":0,"body":"Again, a hard no. I've had my fill of making everything with a remotely mystical background or high scope of power related to Mount Targon. There should be other sources of power and there should be other individuals who have managed to grasp ahold of power by their own merit, other than being \"blessed by Targon.\" The whole Aspect of XXX thing is getting tired and overused, and I feel like it would completely devalue Zilean.\nAs for Zilean as a \"chronolord,\" not every single champion who's a powerful mage has to have had that power escalate straight to their heads. Zilean is lovable because he is pretty humble about his capabilities. He's not some insane lord of time, nor is he some power wielding mage-king. He's just a regular academic who stumbled onto some intensely powerful magic and tried to use that magic to reroute history to avert a disaster, but failed in doing so. Nothing about who he is points to us believing he should be some king or god-being. He's just a mage who harnessed the power of time - like a scientist who discovered how to harness electricity. He's an academic first and foremost, and he's always been trying to use his research for the betterment of the world. Making him a god-being or lord of time just shits on everything that Zilean encapsulates as a character.","replies":[]}]},{"poster":"Budget Yami","date":"2018-09-19T23:09:24.510+0000","up_votes":1,"down_votes":0,"body":"uhm.... this isnt related to the thread but where do u get that icon? I want it lol? did it cost money or is a mission?","replies":[{"poster":"Oleandervine","date":"2018-09-20T15:45:27.251+0000","up_votes":1,"down_votes":0,"body":"You may be referring to my Recruitment icon, you get it by having a new player or player who hasn't played since June use the login link you can get from the Odyssey event page in client. If you play a set of recruitment missions with that person, both with your recruit icons equipped, you eventually get a skin shard from the Odyssey line.","replies":[]}]}]}]},{"poster":"ZaneShadow","date":"2018-09-21T01:44:17.110+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Scathlocke,realm=NA,application-id=6kFXY1kR,discussion-id=6uP0Q5ng,comment-id=0002,timestamp=2018-09-18T17:30:31.092+0000)\n>\n> I&#x27;d love to explore old Icathia more!\n> \n> With stories set before the &quot;now&quot;, we have to find a good reason to tell them, usually one that supports a new release or lore update. We don&#x27;t have the writer or editor bandwidth to explore every part of the setting at the moment... but in future, that&#x27;s certainly the plan :-)\n\nMaybe for the ezreal update he could be exploring old icathean ruins?  I mean if I remember right he was already expiring around shurima...","replies":[]},{"poster":"La Bello","date":"2018-09-18T23:52:47.938+0000","up_votes":1,"down_votes":0,"body":"When looking into Zilean a few characters come to mind,\n\nthe first is Urza from Magic the Gathering. A prodigal artificer who also spent much of his life creating miracle machinations and entwining it with magic.\n\nalso they pretty much share the same the whole white eyes+white hair cosmic mental nirvana look\n\nhttps://vignette.wikia.nocookie.net/magicthegathering/images/9/9d/Urza1.jpg/revision/latest?cb=20180213081042&path-prefix=it\n\nAlso I think its worth looking into the character Professor Paradox from Ben10. A Scientist who was involved in the a-typical hero story of lab accident gone wrong grants super powers. For Ol' PP he was flung through space and time for eons until he went mad then after a while \"he grew tired of being mad so he went sane...very sane\". A pretty cool character a lot like Doctor Who.\n\nhttps://youtu.be/xusUWwwzLC0\n\nAlong with Metron from DC comics (Ageless observer riding a all-powerful device travels through space and time)\n\nhttps://vignette.wikia.nocookie.net/marvel_dc/images/3/3a/Metron_0002.jpg/revision/latest?cb=20090929153625\n\nwhen Zilean eventually gets a revamped look or backstory I hope you draw a bit of inspiration from these.","replies":[]},{"poster":"nosafterburn","date":"2018-09-18T21:35:57.298+0000","up_votes":1,"down_votes":0,"body":"{{champion:26}} : I knew you'd say that.","replies":[]}]},{"poster":"JoeAnarchy","date":"2018-09-18T23:38:49.464+0000","up_votes":1,"down_votes":0,"body":"ok, but aren't the icathians the one's who unleashed the void on runeterra?","replies":[{"poster":"Bioluminescence","date":"2018-09-19T19:34:40.642+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=JoeAnarchy,realm=NA,application-id=6kFXY1kR,discussion-id=6uP0Q5ng,comment-id=0003,timestamp=2018-09-18T23:38:49.464+0000)\n>\n> ok, but aren&#x27;t the icathians the one&#x27;s who unleashed the void on runeterra?\n\nIt was only that one time and it was ages ago.  Geez.","replies":[]}]},{"poster":"Carnival Knights","date":"2018-09-19T18:57:37.154+0000","up_votes":5,"down_votes":0,"body":"I have so many thoughts about Zilean. \n\nAll of them are highly emotional.","replies":[{"poster":"Speak or Die","date":"2018-09-20T02:49:08.396+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Carnival Knights,realm=NA,application-id=6kFXY1kR,discussion-id=6uP0Q5ng,comment-id=0005,timestamp=2018-09-19T18:57:37.154+0000)\n>\n> I have so many thoughts about Zilean. \n> \n> All of them are highly emotional.\n\nYou're hurting me. I'm already highly emotional and all he has is a little paragraph.","replies":[{"poster":"Ichi Ni San","date":"2018-09-21T06:06:08.081+0000","up_votes":1,"down_votes":0,"body":"size doesn't matter man. what is more important? if its big enough for {{champion:26}}  to skate on","replies":[]}]}]},{"poster":"Shadow Hazard","date":"2018-09-18T13:00:50.763+0000","up_votes":1,"down_votes":0,"body":"Maybe one of the 2 new champs will be the source to expand on that lore. Since it seems anyone that survived till now will have some type of extreme strength (jax in general, zilean being a time master of sorts).","replies":[{"poster":"Oleandervine","date":"2018-09-18T17:44:33.322+0000","up_votes":4,"down_votes":0,"body":"I severely doubt that. One is a colorful mage who's characterized by hiding and flowers, the other is some person in chains - neither shows any kind of connection to Icathia in the slightest.","replies":[]}]},{"poster":"Rude Name","date":"2018-09-18T14:08:13.164+0000","up_votes":1,"down_votes":0,"body":"{{champion:36}} {{champion:24}} {{champion:26}} \nAgreed, and I’d love these champions to be fully realised/connected to Icathia, due to their body type and history","replies":[{"poster":"YDy2ZkRq02","date":"2018-09-18T14:47:10.766+0000","up_votes":4,"down_votes":0,"body":"I don't see how Dr. Mundo would fit the Icathian story.","replies":[{"poster":"Cetri","date":"2018-09-18T17:36:20.023+0000","up_votes":2,"down_votes":0,"body":"Back when his bio was updated with most other Zaun champs, there was a theory floated around that all the unstable chemical mixtures and whatnot in the sump of Zaun somehow created a portal to ancient Icathia, and baby Mundo came through it.","replies":[]}]},{"poster":"mrmeddyman","date":"2018-09-18T23:34:27.548+0000","up_votes":1,"down_votes":0,"body":"{{champion:36}} Why I gotta be Icathian tho. Cuz I'm purple? CmonBruh","replies":[{"poster":"JoeAnarchy","date":"2018-09-18T23:42:11.763+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=mrmeddyman,realm=NA,application-id=6kFXY1kR,discussion-id=6uP0Q5ng,comment-id=00010001,timestamp=2018-09-18T23:34:27.548+0000)\n>\n> {{champion:36}} Why I gotta be Icathian tho. Cuz I&#x27;m purple? CmonBruh\n\nuhmm, Mundo makes big money.\nHe's a big money making man who makes money.\nit's called \"Icathian Rain\" \nand when you have alot of money, you're making it rain.\nand so Big Money making man Mundo, makes it rain.\nso he's gotta be icathian..\ni don't see what you aren't understanding?","replies":[]}]}]},{"poster":"Rαy","date":"2018-09-18T23:56:22.261+0000","up_votes":1,"down_votes":0,"body":"Probably never. He's not a flashy, cool, hot, mobile, edgy ninja assassin rocket cowboy demon.","replies":[]}]}