{"poster":"datguyonline","date":"2018-09-27T22:42:11.045+0000","title":"Its just not fun anymore","subforum":"Player Behaviour","up_votes":0,"down_votes":0,"body":"rather get my account perma banned than play this bloody game anymore. \r\nlast 1/2 of my games had someone int me because they dont want to play either flame me cause i didnt gank even though I pinged the jungle 20 seconds before he was there or he got solo killed  and everyone around me gets solo killed I&#039;ve been demoted to silver 2 10 times this season because of players like these who think they&#039;re fucken diamond but they&#039;re low level scrubs like me \r\nI can only recall 2 games where it was actually fun over the past 20 games and maybe 4 over the last 50-100\r\nIm so tilted I&#039;m just contemplating running it down now cause that sounds more fun than trying to reason with trolls and in turn getting my account perma banned so I can finally quit this fucking addiction \r\nIdk what im trying to say about this post Im not perfect im toxic and I am the reason why I lose over half my games cause i am still learning  but im just crying for any advice or help at this point Im so tired of the game I once loved so much. \r\n\r\nban me if you want I probably deserve it","replies":[{"poster":"Lysaaer","date":"2018-09-29T00:44:31.808+0000","up_votes":2,"down_votes":0,"body":"you could just mute everyone when you get in game and just focus on yourself if one of your teammates feeds you cant help that just play the game for fun and you'll get better thats what I did and I've peaked Diamond 3 this season","replies":[]},{"poster":"LOLnerd","date":"2018-09-28T17:03:34.955+0000","up_votes":2,"down_votes":0,"body":"You're right about that buddy, it's not a fun game, just very addictive. But to be honest in my opinion it's THE best moba pvp game out there, so how can you dispute with that","replies":[]},{"poster":"Menarche","date":"2018-09-28T02:58:22.690+0000","up_votes":2,"down_votes":0,"body":"sorry my guy it looks like you need people to play with, you go uni or school?","replies":[{"poster":"datguyonline","date":"2018-09-28T22:02:29.240+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Menarche,realm=OCE,application-id=T8eq2lFQ,discussion-id=H3IGl2Nt,comment-id=0000,timestamp=2018-09-28T02:58:22.690+0000)\n>\n> sorry my guy it looks like you need people to play with, you go uni or school?\ngoing to uni next year but not school atm just gap yearing \nalso I was thinking of deleting this but the community probably needs to see this lmfao","replies":[]}]},{"poster":"Bookbash","date":"2018-09-29T22:04:09.845+0000","up_votes":1,"down_votes":0,"body":"Don't be toxic... just /fullmute all when you get in game.","replies":[]}]}