{"poster":"Asfolbrice","date":"2017-05-01T07:36:54.691+0000","title":"Sfondo profilo nuovo client","subforum":"Aiuto e supporto","up_votes":3,"down_votes":0,"body":"Domanda: in base a cosa viene scelto il campione che appare sullo sfondo del proprio profilo?\r\n\r\nGiusto perch&egrave; mi ritrovo Sona anche se non la uso da un pezzo. Forse si aggiorna ogni tot?","replies":[{"poster":"Raruk","date":"2017-05-01T13:28:31.314+0000","up_votes":2,"down_votes":0,"body":"All'inizio di ogni patch lo sfondo si resetta e vedrai il champion su cui hai più punti maestria, poi dopo qualche partita si vedrà il champion più giocato nelle ultime 20 partite.","replies":[]},{"poster":"Asfolbrice","date":"2017-05-01T08:09:54.308+0000","up_votes":1,"down_votes":0,"body":"E infatti. Bho","replies":[{"poster":"Philippicus","date":"2017-05-02T14:30:42.450+0000","up_votes":1,"down_votes":0,"body":"Se non cambia è un bug. Segnalai il problema alla Riot prima della scorsa patch e almeno a me il problema dopo l'ultimo aggiornamento si è risolto (era anche riportato come bug fix nella patch notes). Evidentemente non è  così per tutti","replies":[]}]},{"poster":"Wigur","date":"2017-05-01T12:59:49.631+0000","up_votes":1,"down_votes":0,"body":"Compare il campione con cui hai i punti maestria più alti.","replies":[{"poster":"Pulastér","date":"2017-05-01T13:07:08.755+0000","up_votes":1,"down_votes":0,"body":"Non credo, altrimenti il mio sfondo sarebbe stato perennemente con il champ che ho usato più di tutti. Invece lo sfondo cambia a seconda di chi giochi negli ultimi giorni, e sopratutto quanto.","replies":[]}]},{"poster":"Pulastér","date":"2017-05-01T12:46:29.068+0000","up_votes":1,"down_votes":0,"body":"Sì, è capitata anche a me una cosa simile. Avevo Lulu come sfondo, anche se stavo spammando Pantheon negli ultimi tre giorni. Il criterio dovrebbe basarsi sul Champ più usato.","replies":[]},{"poster":"Malbethh","date":"2017-05-01T08:08:36.261+0000","up_votes":1,"down_votes":0,"body":"Lo sfondo cambia in base al campione che stai usano di più, sono andata a guardare sul tuo profilo e dovresti avere Taric. \nComunque anche a me succede ogni tanto che lo sfondo non corrisponda proprio con il champ usato.\nPerò mi sembra strano che tu abbia Sona anche perchè nelle ultime 20 partite non l'hai utilizzata neanche una volta..","replies":[{"poster":"Sexy Win","date":"2017-05-01T09:53:02.240+0000","up_votes":1,"down_votes":1,"body":"Succede spesso che ti ritrovi champ \" a buffo\" che non giochi da molto tempo e/o che hai giocato una volta  nelle ultime 20 partite e le restanti utilizzando un unico champ. Meh bella domanda su cosa si basi...","replies":[]}]},{"poster":"MinkiuFTW","date":"2017-05-10T14:53:40.267+0000","up_votes":1,"down_votes":1,"body":"Mi spiegate perchè non mi esce dj Sona nello sfondo nonostante abbia la skin? Mi esce Sona normale e così anche per lui elementalista. Ad altri le vedo.","replies":[]}]}