{"poster":"KawtYouNow","date":"2016-10-13T20:26:26.013+0000","title":"Slumping?? Help.","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Hi all, \nJust wanted to make this because i felt like i needed some help.. on something. \nI went through a stage about 2-3 weeks ago where i would almost never lose lane, i felt like i was really improving heaps and going to climb heaps and it was great because i felt like i was mechanically playing my champs {{champion:122}}  {{champion:58}}  {{champion:117}} really well in the top/mid lane. I look back on that time with sorrow because i feel like im doing jack at the moment. My game sense seems to have been thrown out the window, and i find i&#039;m hardly winning lane anymore which just makes me incredibly tilted when i lose in matchups that i *know* i should be winning. i&#039;m not sure if im being to aggressive or its actually a mechanical part of my game i have to change but i am completely at a loss. \nI feel like instead of improving by playing more, i am almost even getting worse as the day continues. all it does is make me unnecessarily tilted and just takes away my motivation to even play league at all. I suppose you could argue &quot;league isn&#039;t meant to be easy to play&quot; But i feel like i actually used to be ready to start climbing but now its like i am a legit beginner with the champs i play. Maybe i need to take a break from league altogether, take a week or 2 off and come back with a fresh mindset or?\nI dont know. I just don&#039;t know. \nPlease help.\nSincerely KawtYouNow \n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Skouriasmenos","date":"2016-10-15T16:56:09.563+0000","up_votes":1,"down_votes":0,"body":"The solution is simple ... quality over quantity ... only play RANKED when you are in top shape and only one or two games per day ... \n\ntry a normal game to warm up, play a couple of ranked games and then play again the next day ... simple as that :)","replies":[]},{"poster":"About 9 Kenyans","date":"2016-10-13T23:21:19.768+0000","up_votes":1,"down_votes":0,"body":"okay mate, some random little heads up, if you consistently play you will lose focus and play let seriously, like i usually play a bit then break and go really well when i come back, so having fun is a major part, you will go better if you are having fun bc you concentrate more, also make sure you are eating and drinking so your body isnt tired and losing focus, glhf","replies":[{"poster":"KawtYouNow","date":"2016-10-14T00:13:22.088+0000","up_votes":1,"down_votes":0,"body":"Its true. I usually will sit down for a long amount of time and just play 4-5 games straight. Maybe i need to just take a short break after each game, go for a quick jog or a run, refresh my mind and then get back into it. i am gunna be playing a lot today so i'm definitely going to give it a try. I feel like i need to have more fun while playing league rather than just mechanically playing game after game. \nThanks for taking the time to leave a comment and help me out. ^_^","replies":[{"poster":"About 9 Kenyans","date":"2016-10-14T01:38:55.148+0000","up_votes":1,"down_votes":0,"body":"all good, and its not so much the break(although it helps) its more try out a different game for a little that requires no effort to play, and when you are in the mood for league get back to it, feel free to send me an invite","replies":[{"poster":"KawtYouNow","date":"2016-10-14T02:27:18.733+0000","up_votes":1,"down_votes":0,"body":"yeah. I will do! What rank are you? know that im only bronze 4 so don't expect anything from me. DX","replies":[]}]}]}]}]}