{"poster":"JasonWazza","date":"2015-07-24T08:14:26.780+0000","title":"Lore","subforum":"Miscellaneous","up_votes":6,"down_votes":0,"body":"So basically want to start out by saying, this Lore update is amazing so far, and i really can&#039;t wait for Act 3.\r\n\r\nHowever this being said, this is the biggest lore Update that has happened in the past year (since the lore change/removal) and honestly, this is just not really acceptable.\r\n\r\nGoing back, the most we have gotten is really short bits of lore and a video or 2, and while this lore update changes this slightly, fact is, this isn&#039;t something that could have taken months to write, hell if i really wanted i could go on Fanfiction.net and find stories that are similar sort of lengths that never took months.\r\n\r\nThis update has been in line for, well months, and was mostly done for the GP update, however that doesn&#039;t stop the fact that, for all this preparation, this lore that has been given to us, really isn&#039;t a showing of what it really needs to be.\r\n\r\nI think most writers could come up with something similar in a few weeks, and all they would need after that is a fact check for it being league canon and they would be fine.\r\n\r\nNot to mention that this Lore could have been done without the un-canoning of the League of Legends, and i&#039;m still yet to see a lore update that actually required the lore change.\r\n\r\nLove to see a Red&#039;s post on Why we can&#039;t have more consistent lore updates like this, it&#039;s not like they take forever to write up or even fact check.\r\n\r\nAnyway, enough of the rant, hope to see more of this kinda lore soon, and not have to wait 3+ months for the next snipit of any sort of lore.","replies":[{"poster":"Chicken4dinner","date":"2015-07-24T10:03:58.765+0000","up_votes":2,"down_votes":0,"body":"It was not big enough in itself to make up for the radio silence over the year but I feel that they spent the time constructing the worlds and characters that will be featured in upcoming lore updates","replies":[{"poster":"JasonWazza","date":"2015-07-24T10:09:15.245+0000","up_votes":1,"down_votes":0,"body":"I'll agree with the first part, but i seriously doubt that it takes several months to \"construct the worlds\" when really given the lore change, the world barely needs anything but to be runeterra and interesting.\n\nAnd if it is the case that that is why, then the frequency of the new lore needs to be on par with the old Journal of Justice and not just a Short story every time they think of a champion update.\n\nEDIT: for those that don't know, the Journal of Justice updated every 2 weeks.","replies":[{"poster":"Chicken4dinner","date":"2015-07-24T13:51:13.390+0000","up_votes":1,"down_votes":0,"body":"Well when you read the act's you find it reads ALMOST like a real novel, the world is nearly as in depth and I think that is where they are taking it. That level of depth (most would have needed to be established just to tell us what they have within the acts so that everything fits with the world. What I mean by this is that there are many factors that they have created but we don't see in order to bring us what they have within the short story) would have been brainstormed over runeterra as a whole and how even the smallest detail like what kind of transport system bligewater uses for carcasses does to effect the universe that league is in.\n\nMy view anyway","replies":[{"poster":"JasonWazza","date":"2015-07-24T14:00:13.923+0000","up_votes":1,"down_votes":0,"body":"You have a point, but it's very possible that this was something that was already laid out from back before the lore change, i mean it's very possible i'm wrong, but it sounds like the Bilgewater i imagined from back before the removal of the league of legends.\n\nCan't recall if it is mentioned in the JoJ, but i think it might have been, meaning it's not really completely new.\n\nStill i do like that it does read almost like a real novel, my problem is, if we are only getting this every champion update which is generally 2+ months apart then it's not really enough.\n\nI do hope your right, but honestly I'm cynical.","replies":[{"poster":"Chicken4dinner","date":"2015-07-24T14:23:58.248+0000","up_votes":1,"down_votes":0,"body":"Let's just say when they sold the idea of replacing the lore, I was very impressed with their article.\n\nKinda influences my perspective a little, also I don't think they left it for ages without the general consensus that they want to move league into the future which is effectively what they have been doing with all the updates (hud, champs and rift. I think they have bigger plans for the future and the lore is getting gathered up for then)\n\nI also know that every company will want to adopt a new image for their product when it reaches its maximum sales potential and starts to decline... sell it as something unique (so goodbye old league from seasons 1 and 2, the game will be changing to become non-resemblant to that). Why I am stating this is that they need something to keep you interested and in my perspective I see this bligewater event as a means of buying time until all the heavy lifting is completed for league to adopt a new style (and image).\n\nMy 2 cents","replies":[]}]}]},{"poster":"Talon12","date":"2015-07-24T12:52:35.793+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JasonWazza,realm=OCE,application-id=Ntey9fRZ,discussion-id=oU7GE8oP,comment-id=00000000,timestamp=2015-07-24T10:09:15.245+0000)\n>\n> the Journal of Justice updated every 2 weeks.\n\nThen riot got super lazy and killed it","replies":[]}]}]},{"poster":"onguana","date":"2016-01-22T13:08:22.710+0000","up_votes":1,"down_votes":0,"body":"I feel like it would have been cool if they found someway to incorporate the league of legends into the lore, whether it was destroyed or had it survived. A cool twist would that a champion, perhaps Jhin or someone else with reasons to assassinate a person/persons such as Leblanc (she would of course orchestrate it as someone else) broke the rules of the League by committing murder outside of the League's boundaries, thus denouncing the League's name and leaving people sceptical about its effectiveness of keeping the battles for Runeterra contained. This, in turn, would lead to an event which left the League powerless, destroyed or very weak, in hopes it would recover or reform at a later stage, and release the carnage that was once contained upon the lands. \n\nAfter this, alliances would have to be struck due to the weakened military forces of the various cities/cultures as they have no/very little way to defend themselves. It would be interesting to see who would side with who and what the ultimate outcome would be. Would bilgewater stand alone against the other factions or choose to team up with Noxus? Or would once warring factions team up to defend their land against other factions or third parties such as void creatures (or an entirely new void faction) or people such as Karthus, Xerath or other power hungry/destructive forces.\n\nWow I wrote a lot, please feel free to comment and expand. I also have reddit if someone would like to link me to a good lore conversation or expand on this topic. Time to get back on the fields of justice, cya later summoners (wait I cant call you that anymore can I? Um........ Onlookers... no not it........ DAMNIT){{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Talon12","date":"2015-07-24T12:50:19.124+0000","up_votes":1,"down_votes":0,"body":"who even says its a lore, but if it is, I like the longer lore's to read, so much more to imagine (can't let the think tank die, keeps imagination alive! (like, the scenario)) and so much more detail, for example, I hate this new Skarner lore because its short, boring, and so imagination dead, his old one was better","replies":[]}]}