{"poster":"JasonWazza","date":"2015-05-28T20:37:06.649+0000","title":"Utility mastery's","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":1,"body":"So i was saving my thoughts on the new utility mastery&#039;s because i couldn&#039;t fully grasp the movements they were making.\r\n\r\nBut my god does it say fuck you to supports.\r\n\r\nTop of the tree: you can now get 75 mana instead of mana regen, meaning past fleet of foot the utility tree is useless in the first few lines.\r\n\r\nBottom of the tree: Ranged champions are now told fuck you, we are giving more gold to melee&#039;s, your mana regen is too deep and Wanderer is now just that little bit better early, but fall off late\r\n\r\nThe one good change is giving +8 gold to melee supports for auto&#039;s, and i find myself hating that as someone who plays primarily the ranged supports, sure i will agree that Melee supports needed a change to that mastery, giving them triple the gold was not what i thought they would do.\r\n\r\nHonestly i am now struggling to run 13/17 in utility for my support pages, simply because expanded mind is shit, and none of the other mastery&#039;s really suit supports.\r\n\r\nSo much for mid laners/top laners having mana regen in their mastery&#039;s, cause fuck you guys too - Rito 2015","replies":[{"poster":"Ediwir","date":"2015-05-28T23:27:40.224+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JasonWazza,realm=OCE,application-id=FjGAIbRv,discussion-id=5j3zEc0P,comment-id=,timestamp=2015-05-28T20:37:06.649+0000)\n>\n> So i was saving my thoughts on the new utility mastery&#039;s because i couldn&#039;t fully grasp the movements they were making.\n> \n> But my god does it say fuck you to supports.\n\nLet's see the support changes.\nWe have a Karma rebalancement (power shifts)... i'll just put it as neutral.\nA minor Leona nerf (i understand what they meant, playing Leona, but i don't dislike it - it only affected me when i thought i missed and got it anyways, which is not supposed to happen)\nLulu... early buff, late nerf? K.\nTaric buff. Truly outrageous.\n\nAncient Coin. Straight up buff.\nArdent Censer. Now exists.\nBanner of Command. Tweaks.\n\nAnd then the masteries...\nMeditation. I guess now the first rank has more choices than just \"movespeed and cast range\". I'm taking this now. Yes, I have more than 200 mana most of the time.\nExpanded Mind. Early buff, nerf past 1500 mana. Who has less than 1500 mana? Hint: not Ryze.\nInspiration: straight up buff, if you like it (hint: think Bard).\nBandit: the mastery has the same use wether you're melee or range (before it was two different masteries). Ofc ranged champs get to use it more often, hence the higher melee gold.\nIntelligence: 5% CDR like before and... 20% on actives? Yes please.\nWanderer: buffed, unless you used to reach more than 400 movespeed with just boots. That's Yi and a couple others, unless Boots of Swiftness or Mobility are involved.\n\nI don't see the \"fuck you\" part, really.\nSure, Expanded Mind was horrible before (unless you were Ryze) and it only got improved a little now (unless you are Ryze), but there's plenty of other nice toys to play with :)","replies":[{"poster":"JasonWazza","date":"2015-05-29T00:15:43.379+0000","up_votes":1,"down_votes":0,"body":"First up i was talking ONLY about the mastery changes (and the changes you list aren't really relevant to most supporting players except ancient coin)\n\nNow on to what i was refering to.\n\n>Meditation. I guess now the first rank has more choices than just \"movespeed and cast range\". I'm taking this now. Yes, I have more than 200 mana most of the time.\n\nYeah having mana regen in the first line of utility was so bad.\n\nYou now have to go so deep, and it's in a place where putting 3 points in it is completely counter productive.\n\n>Expanded Mind. Early buff, nerf past 1500 mana. Who has less than 1500 mana? Hint: not Ryze.\n\nWho uses this mastery?\n\nHint the answer is Ryze.\n\nEven now it's a shit mastery, it's just in a more awkward spot because it's in a place where it forces you to take trinket range to get to 4 points in utility.\n\n>Bandit: the mastery has the same use wether you're melee or range (before it was two different masteries). Ofc ranged champs get to use it more often, hence the higher melee gold.\n\nMe on this:\n\n>The one good change is giving +8 gold to melee supports for auto's, and i find myself hating that as someone who plays primarily the ranged supports, sure i will agree that Melee supports needed a change to that mastery, giving them triple the gold was not what i thought they would do.\n\n>Intelligence: 5% CDR like before and... 20% on actives? Yes please.\n\n10% on support actives that have no CD already?\n\n>Wanderer: buffed, unless you used to reach more than 400 movespeed with just boots. That's Yi and a couple others, unless Boots of Swiftness or Mobility are involved.\n\nHonestly it's a 2 movespeed buff, for a 3 movespeed nerf late game for supports WHO BUILD MOBI'S REGUARLY.","replies":[{"poster":"Ediwir","date":"2015-05-29T00:29:00.314+0000","up_votes":1,"down_votes":0,"body":"Actually i don't use mobis that often... Might just be because of the tanky supports i tend to use, but eh. i guess it's a good change for me but not for everyone.","replies":[]}]}]}]}