{"poster":"JasonWazza","date":"2016-10-25T08:58:17.945+0000","title":"Can everyone stop saying Gorilla was wrong","subforum":"Gameplay & Strategy","up_votes":3,"down_votes":1,"body":"Simply because he bought mortal reminder before Black Cleaver, and you don&#039;t understand why he did it.\r\n\r\nFact is he is a korean player playing on the top 4 teams in worlds, and damn well knows more about league then you do.\r\n\r\nAnd saying he should have gone BC first is like telling a brand to get a Rylai&#039;s before he gets his Liandry&#039;s.\r\n\r\nGorilla was on a damage support, wanted an item to amplify his ult damage, and there was very little other Physical Damage being dropped while he was ulting, so the BC passive would have caused less damage to be output.\r\n\r\nAll the Grievous Wounds was really helping to counter the healing the other team had.\r\n\r\nAnd as an aside MF&#039;s E doesn&#039;t proc Grievous Wounds From Mortal Reminder, just because a shoutcaster said it doesn&#039;t make it true.\r\n\r\nSeen too many god damn videos who think they know more than Gorilla and i&#039;m kinda fed up with them.","replies":[{"poster":"Erøse","date":"2016-10-26T03:47:06.841+0000","up_votes":2,"down_votes":0,"body":"He did well. Harambe is proud of him","replies":[]},{"poster":"Cakemeisting","date":"2016-10-26T00:38:42.939+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=JasonWazza,realm=OCE,application-id=FjGAIbRv,discussion-id=AuoBVE70,comment-id=,timestamp=2016-10-25T08:58:17.945+0000)\n>\n> \n> All the Grievous Wounds was really helping to counter the healing the other team had.\n> \n> And as an aside MF's E doesn't proc Grievous Wounds From Mortal Reminder, just because a shoutcaster said it doesn't make it true.\n\nInteresting comment, so why did he buy it first then, again? I'd prefer Black Cleaver first because of more spell rotations = more damage. The other team didn't have that much healing, he could have gone Black Cleaver into Executioners, rather than Mortal Reminder into Caulfields Warhammer. 10% more cdr which at the start of the game, is very important.","replies":[{"poster":"JasonWazza","date":"2016-10-26T01:42:32.004+0000","up_votes":1,"down_votes":0,"body":"Because Black Cleaver by default reduces the damage he outputted, while not super benefiting anything.\n\nBlack Cleaver: Has to stack the Armor pen, so the first wave is 5%, second is 10% etc. and this is not retroactive (meaning you only start getting 30% pen on the 7th wave), and the CDR doesn't really matter because in the early game, you are going to run out of mana Spamming your E, you only want the full engage.\n\nMortal Reminder: Instantly has 45% Personal Penetration, if you look at all the times early where he uses the ult, it's mostly his damage, and not enough outside his Physical damage, to justify getting the BC.","replies":[{"poster":"Cakemeisting","date":"2016-10-26T02:26:34.844+0000","up_votes":1,"down_votes":4,"body":"Fail to see how Black Cleaver reduces the damage outputted. I'll take the extra 10% cdr and the armour reductions, not the bonus armour reduction thanks. Btw in this build path I'm still applying grievous wounds building BC + Exe instead of Mortal + Caulfields. And cdr is very important early game. Think about more rotations of the ult, which is on a high cooldown.","replies":[{"poster":"JasonWazza","date":"2016-10-26T02:55:29.959+0000","up_votes":2,"down_votes":0,"body":"So you know more then a korean in a top 4 team of the world.\n\nYou are the kind of person this post is directed at.\n\nThe CDR doesn't help while your in the middle of your ult.\n\nBut i'll do you one better, i will run the numbers.\n\nLevel 11 MF: 55 Base AD, 14 waves on the ultimate, 110 Second CD\n\nItem Sets;\n1: Eye of the Watcher, Black Cleaver (3100 gold, 50 AD, 20% CDR), Executioners Calling (800 Gold, 15 AD).  65 Bonus AD, 25 AP, 20% CDR\n2: Eye of the Watcher, Mortal Reminder (2700 Gold, 50 AD), Caulfields Warhammer (1100 Gold, 25 AD, 10% CDR), 100 Extra Gold.   75 Bonus AD, 25 AP, 10% CDR\n\nLevel 2 Ult, 14 Waves at 75% AD and 20% AP.\n\nBase Damage per Wave;\n1: 95\n2: 102.5\n\nSo not only at this point are you doing more damage per Wave, but you have to take into account the lack of Penetration so lets setup a few targets.\n\n50 Armor (An MF's base Armor at 11), 7 Waves Hit;\n1: 63.65+64.40+65.51+66.66+67.85+69.09+70.37= 467.53  (I ran these numbers myself using the Armor formula) \n2: 80.39*7= 562.73\n\nNow this is almost a 100 Damage increase, and the first scenario has only just now gotten to doing a full stack BC, so that will stay on 70 damage per wave.\n\nAnd it only gets better for Mortal Reminder as you increase the armor of the enemy.\n\nhttps://www.youtube.com/watch?v=7PCkvCPvDXk","replies":[{"poster":"Cakemeisting","date":"2016-10-26T03:19:13.884+0000","up_votes":1,"down_votes":2,"body":"This will be my last post on this subject.\nFirstly Gorilla is a human not a god, and yes sometimes man makes mistakes.\n\nSecondly if you are level 2 ult (i.e. level 11 plus) you are not laning. Especially when you are picking the Miss Fortune to push hard and take towers.Think team fights, think dragons, think ultimate with Black cleaver helping your whole team, not your own output damage. Not only that, Miss Fortune support is a niche pick. It depends entirely on compositions whether it is useful or not, so if you take the games from worlds as the example, imagine how team fights at baron or dragon go with the two builds and Rumble ult on top of them. It's about the wombo. She's not there for the peel, but to facilitate her team's damage output, which she can do more consistently with more CDR in the early to mid game. In game 2 of the SKT vs ROX series, Gorilla didn't finish Mortal Reminder until about 28 minutes into the game. Laning was over. Nobody had armour, except ekko with a glacial shroud. You could have completed the Mortal Reminder later and got some cdr. No one is going to be consistently standing in the whole 7 waves of a Miss Fortune ultimate, unless it's a target thats been locked down, in which case they are dead anyways from your damage _**combined with**_ the rest of your team.\n\nThirdly you might like to think about your numbers in terms of the early to mid game. In Gorilla's build he is spending 2700 on Mortal Reminder, when he could have spent 800 on Executioner's Calling + 1100 On Caulfield's Warhammer + 350 on a longsword + 400 on a Ruby Crystal. Roughly the same cost for the same amount of AD and 10% extra cdr.\n\nThe whole idea of Miss Fortune support is not just about her own ability to do damage past the laning phase. It is no wonder what many commentators/analysts think the same way.","replies":[{"poster":"JasonWazza","date":"2016-10-26T03:41:02.557+0000","up_votes":2,"down_votes":0,"body":"Someone didn't actually watch the game and is trying to lecture people.","replies":[{"poster":"NoVe1tY","date":"2016-10-26T04:26:20.821+0000","up_votes":2,"down_votes":1,"body":"I watched the game, and I think what Cake is saying is right. Ekko is the only one with bonus armor at 28 minutes in, check the vod.","replies":[{"poster":"Main Line","date":"2016-10-26T04:28:56.394+0000","up_votes":2,"down_votes":1,"body":"Jason getting schooled by bronze on these forums is nothing unusual. {{sticker:slayer-jinx-wink}}","replies":[{"poster":"JasonWazza","date":"2016-10-26T04:30:44.672+0000","up_votes":1,"down_votes":1,"body":"\"schooled\"\n\nExcept i'm the one actually using math to prove my point, these bronzies are just using retarded logic, that doesn't actually apply.\n\nNot to mention they think they are better then one of the top teams in the world (and they have a coach+analyst's etc.)","replies":[]}]},{"poster":"JasonWazza","date":"2016-10-26T04:28:53.941+0000","up_votes":1,"down_votes":0,"body":"I'm using base armor, with no runes, of an MF, and the Mortal reminder is doing more damage by a decent chunk at 50 armor.\n\nDo you really think it matters?\n\nEDIT: btw the part i was refering to when i said someone didn't watch it was this\n\n>and there was very little other Physical Damage being dropped while he was ulting","replies":[{"poster":"NoVe1tY","date":"2016-10-26T05:05:53.657+0000","up_votes":1,"down_votes":1,"body":"What? When he bought the item, their team had a fed Ashe (3-0-4) with Essence Reaver, Hurricane and B.F. Sword, along with a Lee Sin jungle, that's a reasonable amount of physical damage!\n\nWhat do you mean, \"Do you really think it matters?\" ?","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Arkangyle","date":"2016-10-27T07:32:08.763+0000","up_votes":1,"down_votes":0,"body":"> \n> [{quoted}](name=JasonWazza,realm=OCE,application-id=FjGAIbRv,discussion-id=AuoBVE70,comment-id=,timestamp=2016-10-25T08:58:17.945+0000)\n> And saying he should have gone BC first is like telling a brand to get a Rylai's before he gets his Liandry's.\n\n\nWhat's wrong with building Rylai before Liandry on Brand?","replies":[{"poster":"JasonWazza","date":"2016-10-27T12:48:48.789+0000","up_votes":1,"down_votes":0,"body":"Your playing a damage support, hence why you go damage then utility (which is the same as going Mortal reminder > Black Cleaver)","replies":[]}]}]}