{"poster":"JasonWazza","date":"2016-05-18T20:49:22.829+0000","title":"/Remake","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"http://na.leagueoflegends.com/en/news/game-updates/player-behavior/play-games-matter/remake\r\n\r\nSo this is a new thing that will be being introduced, and i wanted to ask a rioter if they could find out something about it.\r\n\r\n&gt;If any player is dc&rsquo;d or flagged afk for at least ninety seconds at the three minute mark,\r\n\r\nSo if i grab a drink, come out of base at 1:30 (i have been afk for 90 seconds at this point) will a remake still be a thing?\r\n\r\nAlso for a News post on NA, no one quality controlled the writing.\r\n\r\n&gt;and no there&rsquo;s been no first blood\r\n&gt;The vote needs at least two of four players (30% of players in game)","replies":[{"poster":"Main Line","date":"2016-05-19T13:14:26.845+0000","up_votes":1,"down_votes":0,"body":"I can see a potential issue with this system already. \n\nLike lets say one player is flagged for being afk, and just as the vote comes up, another player on the same team gets first blood, and they and their duo partner refuse to remake. I think that could turn into a toxicfest team :)","replies":[{"poster":"JasonWazza","date":"2016-05-19T13:43:11.349+0000","up_votes":1,"down_votes":0,"body":">and they and their duo partner refuse to remake.\n\nIt has to be at least a connected trio against a solo to not, considering it's a 2/4 vote.","replies":[]}]},{"poster":"Tele","date":"2016-05-18T22:57:31.017+0000","up_votes":1,"down_votes":0,"body":"_\"If any player is dc’d or flagged afk for at least ninety seconds at the three minute mark...\"_\n\nThe key here is _\"flagged for afk\"_. That means that you have to receive the [AFK warning](http://i2.ytimg.com/vi/YexIdkTF8wM/mqdefault.jpg), and then continue to be AFK for another 90 seconds.\n\n> So to answer your question; your team will not be able to remake the game if you're AFK for just 90 seconds. You must be AFK long enough to receive the AFK warning, and then be AFK for an additional 90 seconds.\n\nI hope this helps :D","replies":[]}]}