{"poster":"xerecok","date":"2016-10-04T23:13:23.300+0000","title":"(Bronze)Ligasystem","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":25,"body":"Moin,\r\n\r\nwarum ein Ligasystem wenn man sowie so alle Spieler zusammen packt. Hauptsache man wartet nicht zu lang schlie&szlig;lich kann man so ja evtl einen Taler mehr raus kratzen... \r\nSO jetzt kommen gleich wieder die Riot Trolls die rechnen die vor bei so wenig Spielern kann es gar nciht so viel smurf geben und du geh&ouml;rst defenitiv in die Liga. Du bist genau wie die ...\r\nVgl wir die letzten 10 Spiele\r\n1.) Eine Bot lane die in min 5  1 : 3 steht \r\n2,) ein Jgl der erst ab den eternal mal dran denkt Drake zu gehen\r\n3,) Ein Game in dem jede Lane in den ersten mins derart verliert und nicht unter den Tower geht \r\n4.) ein smurf Auf meiner Seite der alles platt macht\r\n5.) ein Jgl der das Wort Gank nciht kennt \r\n6.) ein Top der erst ab 06 einsieht, vllt sollte ich hinter gehen \r\n7.) ein Top der arg verliert aber als Freundlichkeit kein wechsel einsieht \r\n\r\nJa ich kauf nicht immer die lila dings aber ich kann auch um einen Spieler einen Kries aus !!!! erzeugen der Junge rennt rein da hilft auch kein Wart ,\r\nAlso bitte erz&auml;hlt mir ich geh&ouml;re hier rein. Besonderes Highlight der Ecko Top der nach 0 2 afk geht und locker wir das Spiel gewinnen...\r\n\r\nAber bitte erz&auml;hlt mir ich geh&ouml;re hier rein und das Spiel ist Fair","replies":[{"poster":"AI Yjuq","date":"2016-10-04T23:24:26.955+0000","up_votes":16,"down_votes":0,"body":"Du gehört da rein und das Spiel ist Fair.","replies":[{"poster":"xerecok","date":"2016-10-05T08:41:49.575+0000","up_votes":2,"down_votes":8,"body":"Immer ein Freude auf Augenhöhe diskutieren zu können ... :)","replies":[{"poster":"5weeds","date":"2016-10-05T10:30:13.107+0000","up_votes":1,"down_votes":5,"body":"Ach Purzelchen :(\nBronze ist einfach DIE elo-hölle schlechthin.\nZu einem, da die ganzen RICHTIG schlechten Spieler hier landen und zum anderen, weil hier auch die neuen Spieler (ich mein keine smurfs) mit viel Potential anfangen müssen.\nBronze ist einfach sehr krass durchwachsen und ist eigentlich als Sprungbrett in die passende ELO konzipiert.\n\nAber wenn man drunk ranked s zockt isses klar xD\nIch mach das auch gerne, aber nicht rankeds, das ist Assi ^^ {{sticker:zombie-nunu-bummed}} ","replies":[{"poster":"Temudschinn","date":"2016-10-05T12:03:05.156+0000","up_votes":2,"down_votes":0,"body":"> Bronze ist einfach DIE elo-hölle schlechthin.\n> Zu einem, da die ganzen RICHTIG schlechten Spieler hier landen und zum anderen, weil hier auch die neuen Spieler (ich mein keine smurfs) mit viel Potential anfangen müssen.\n\nDas stimmt (bis auf den Punkt mit den neuen Spielern, die starten oft genug in Silber), ist aber irrelevant. Du wirst nämlich nicht nach Liga gematcht, sondern nach MMR. Und das MMR zwischen den wirklich schlechten Spielern (b5) und den Neulingen, die sich am hochspielen sind ist doch stark unterschiedlich. Ich hab sogar mal nen Erfahrungsbericht gelesen, dass der Unterschied zwischen dem alleruntersten b5 (0LP mit 15er Lossstreak) und b5 100 LP bereits gewaltig ist, sprich dass man mit völlig anderen Leuten gematcht wird.\n\nDerselbe Effekt tritt überigens bei Dia auf. Auch hier istn die SKillbreite zwischen Dia 1 und DiaV 0 LP gewaltig - was aber einfach völlig egal ist, da ich als DiaV Spieler nie mit Dia1 Leuten spielen muss.","replies":[]}]},{"poster":"FearTheWalkinCat","date":"2016-10-05T09:25:59.015+0000","up_votes":2,"down_votes":0,"body":"Wo er recht hat hat er recht das Spiel ist fair. Es wird dir nicht helfen bei anderen die Fehler zu suchen fang bei dir an und versuch dich zu verbessern und bitte bitte bitte hör auf die jungler nieder zu machen. Es nervt wirklich dieses immer alle auf den jungler auch wenn die laner meist ganks unmöglich machen XD. Also einfach trainieren botgames machen um Lasthitten zu üben und auch du kommst aus Bronze{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"AI Yjuq","date":"2016-10-05T12:07:32.297+0000","up_votes":2,"down_votes":0,"body":"Naja, du hast hier meiner Meinung nach keine Diskussionsgrundlage geboten.\nDu weinst dich hier im Forum aus und dein Schlusssatz lautet:\n\n\"Aber bitte erzählt mir ich gehöre hier rein und das Spiel ist Fair\"\n\nWenn du diskutieren Möchtest, stell eine These auf und finde Argumente.\nAnsonsten bin ich einfach nur deiner Bitte nachgekommen. Also rede hier nicht von \"diskutieren\".","replies":[]}]}]},{"poster":"MeMyselfandBaal","date":"2016-10-05T02:20:12.551+0000","up_votes":9,"down_votes":0,"body":"Wenn es dich aufbaut: Denn \"Ich starte 0-2 und gehe dann AFK\" Typen triffst du in Platin auch...\n\nWas du nebenbei in Bronze 3 auch triffst, ist der Trundle Support mit Windspeakers Blessing... Der trotz ausgebauten Sightstone UND Gelben Trinket insgesamt 11 Wards platziert... Das sind weniger Wards als Tode... Oder weniger Wards, als ich nur mit dem gelben Trinket platzieren würde\nUnd den Brand der mit 16 Toden ordentlich gefeedet hast, ignorierst du auch... Aber... das bist ja du... ne... dann hat der Spieler natürlich doch alles richtig gemacht...\nGanz ehrlich: Du hast 4 Spiele in Folge mit 15+ Toden... dein Ziel sollte es sein, in 3 Spielen insgesamt 15 Mal zu sterben. Und ja, es gibt keine Entschuldigung außer deine eigenen Fehler für so viele Tode... Konzentriere dich einfach auf deine eigenen Fehler, dann wirst du auch Bronze über kurz oder lang verlassen...","replies":[{"poster":"xerecok","date":"2016-10-05T08:48:28.543+0000","up_votes":1,"down_votes":9,"body":"Habe genug Fehler gemacht, ohne Frage. Wurde auch gestern immer betrunkener , irgendwann ist es einen halt egal ...\n5 Spiele in Folge verloren wo ich meiner Meinung nach gut spielte zum Thema Wards sagte ich bereits genug...\nJeder der Schon mal Sport außerhalb der tastatur betrieben hat, weiß wie ein Ligasystem funktioniert und hier ist das nicht gegeben.\nIch behaupte nicht das ich nciht in Bronze gehöre aber es gehören viele, viele andere nicht dahin. \n(Im übrigen verliere ich lieber ein gutes Spiel als 20 2 zu stehen...)\nZum Trundle Spiel schaue doch mal rein, ist ja nicht so das man als Sup auf den ADC angewiesen ist... dann reden wir nochmal ! (erst 10 min reichen, dann gehen wir auch nochmal das Thema Tode durch kann gerne Afk gehen aber als Tank habe ich die dumme Angewohnheit vorne zu stehen)","replies":[{"poster":"MeMyselfandBaal","date":"2016-10-05T11:43:31.178+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=xerecok,realm=EUW,application-id=KYnfKGf0,discussion-id=8hMMpEBO,comment-id=00020000,timestamp=2016-10-05T08:48:28.543+0000)\n>\n> Habe genug Fehler gemacht, ohne Frage. Wurde auch gestern immer betrunkener , irgendwann ist es einen halt egal ...\n\nÄhm... du weißt, dass die von mir angesprochenen Spiele nicht von gestern, sondern von vorgestern sind? Wenn du da auch betrunken warst... \nAn sonsten... widerlegt das deine These: Wenn du betrunken bist, spielst DU schlechter und dann verlierst DU immer mehr Spiele und steigst weiter ab. Das ist langfristig die Funktionsweise des Ligensystems. Wenn du gut spielst, wirst du mehr gewinnen und aufsteigen.\n\n> 5 Spiele in Folge verloren wo ich meiner Meinung nach gut spielte zum Thema Wards sagte ich bereits genug...\n\nDu solltest dein Verhältnis zu \"gut gespielt\" überdenken. Bei mir gilt seit einigen Jahren das Prinzip: Wenn ich mehr als 10 mal gestorben bin, habe ich schlecht gespielt. Egal, ob ich gewonnen oder verloren habe. Weil man meistens selber einen Fehler gemacht hat, wenn man stirbt. Klar, es gibt die Situationen, in denen man sich fürs Team opfert. Aber nicht 10 mal pro Spiel. \nDu stirbst dagegen derzeit im Schnitt 11 Mal pro Spiel. Ganz ehrlich: Versuche einfach weniger zu sterben. Und gehe nach dem Spiel mal in deinem eigenen Kopf durch, wie du den einen oder anderen Tod hättest verhindern können. Du wirst überrascht sein, wie viel dir das bringt.\n\n> Ich behaupte nicht das ich nciht in Bronze gehöre aber es gehören viele, viele andere nicht dahin.\n\nIch habe in all den Jahren ganz wenige Leute getroffen, die nach Bronze gehörten. Ok, mich selbst. Zu Beginn der Season 3, als Rito mich in meinen Placements richtig ärgern wollte... damals habe ich 2 Wochen gebraucht, um da rauszukommen und habe die Saison in Gold III beendet. Auch wenn das danach noch ein weiter weg war. Meine Erfahrung als Spieler, der Bronze 2 mal verlassen hat: Wer da nicht hingehört, kommt da auch raus. Man muss ja nur 50% seiner Spiele gewinnen...\n \n> Zum Trundle Spiel schaue doch mal rein, ist ja nicht so das man als Sup auf den ADC angewiesen ist... dann reden wir nochmal ! (erst 10 min reichen, dann gehen wir auch nochmal das Thema Tode durch kann gerne Afk gehen aber als Tank habe ich die dumme Angewohnheit vorne zu stehen)\n\nOk, weil du so lieb gefragt hast. Das gute an dem Trundle Spiel war... du bist zurück zu deinem Main. Auch wenn ich mich spontan Frage, warum du nicht deinen Alistar mit der über 50%igen Winrate gepickt hast...\nHier ist das Problem: Ein guter Support gewinnt dir die Lane. Oder schleppt einen schlechten ADC zumindestens bis zum Midgame durch. Trundle hat dagegen quasi keine Laningphase. Also du könntest mit deiner Eissäule Ganks unterbinden, wenn du diesen Skill als erstes maximieren würdest... [wie sich das für nen Trundle Support gehört](http://champion.gg/champion/Trundle/Support). Aber an sonsten... Schilde oder Heilung für deinen ADC? Bedenke einfach mal, dass deine Keystone Masterie nur und ausschließlich dir was bringt. Genau so wie alles andere, was du bei deiner Skillung machst... Und dein Itembuild. Das widerspricht halt der Grundidee der Unterstützung. Und dann wunderst du dich, dass der ADC, der effektive Hilfe von seiner Sona kriegt, deinen platt macht? Ganz ehrlich: Mit so einem Support an meiner Seite hätte ich auf meinem Smurf die Lane auch verloren. Weil ich halt auch als ADC so schlecht bin, dass ich wirklich auf die Unterstützung angewiesen bin... \nTrundle Support sollte man meiner Meinung nach in der Low Elo (in der ich nebenbei auch noch bin) einfach sein lassen. Das ist ein Support, der seine größten Stärken im Laneswap hat, den wir alle nicht können. Dann schon lieber Brand Support. \n\nVor allem... ist auch ein schlechter ADC keine Entschuldigung für die Grundlegenden Fehler, die du machst. Um das mal ganz deutlich festzuhalten: Der Garen platziert ohne Sightstone mehr Wards als du mit... In dem Moment sind das, vor allem wo du nicht mal das Trinket wechselst, 1600 Gold, die du komplett verschwendest. Und ja, man kann auch warden, wenn man hinten liegt. Dass du dann noch nicht mal dein Trinket tauscht. Selbst wenn du es aufs Blaue wechselst... Genau genommen nutzt du in diesem Moment 2 von 7 Itemslots gar nicht. Steckst aber ein Zehntel deines Goldes in diese Slots. Nicht gut. \nUnd ja, ich übertreibe das mit dem Warden gerne. Das liegt aber halt auch daran, dass ich mich damals aus Bronze rausgewardet habe. Bevor Mata die Limitierung dieses Werkzeuges provoziert hat. Und damals, als ich noch Bronze war, haben meine Mitspieler irgendwie mitbekommen, dass die Karte erstaunlich hell leuchtet und das sie erstaunlich viel sehen. Nicht immer, aber immer wieder.\nWenn man natürlich krampfhaft die Schuld bei seinen Mitspielern sucht, wird einem das nie auffallen.\nVor allem kann man auch die Spiele, in denen es schlecht läuft, nutzen, um an seinen Schwächen und Fehlern zu arbeiten. Damit man, wenn man schon nicht gewinnt, wenigstens was lernt.","replies":[{"poster":"Temudschinn","date":"2016-10-05T12:54:27.197+0000","up_votes":1,"down_votes":0,"body":"Sorry, aber zu deinen Trundle-Bermekungen muss ich jetzt doch ein paar Korrekturen abgeben,auch wenns eigentlich OT ist.\n\n> Also du könntest mit deiner Eissäule Ganks unterbinden, wenn du diesen Skill als erstes maximieren würdest... wie sich das für nen Trundle Support gehört.\n\nDas stimmt so nicht, der Link den du angibst unterstreicht sogar dass q-max die höhere Winrate hat. Was man im Pro-bereich auch öfters sieht [(Beispiel)](http://www.probuilds.net/guide/show/NA/2306043023/19577112) sind drei Punkte ins Q und danach e maxen.\nOb E oder Q zuerst kommt hängt sehr stark vom Spielverlauf und den Matchups ab, auch wenn in vielen Fällen E tatsächlich besser ist.\n\n> Trundle Support sollte man meiner Meinung nach in der Low Elo (in der ich nebenbei auch noch bin) einfach sein lassen. Das ist ein Support, der seine größten Stärken im Laneswap hat, den wir alle nicht können\n\nDie Stärke von Trundle als Support liegt nicht unbedingt im Laneswap (das gibts seit 3 Patches eh quasi nichtmehr), sondern in erster Linie an seiner Ulti, die alle Fulltanks gnadenlos kontert. Ob Trundle wiklich unspielbar ist in tiefern MMR-Bereichen wage ich ebenfalls zu bezweifeln, da er mechanisch unglaublich einfach ist und auch sein Decisionmaking quasi nur das e betrifft - alles andere ist klar. Habe ihn aber erst auf Plat/Dia-Level gespielt und kanns daher nicht gut beurteilen.","replies":[{"poster":"MeMyselfandBaal","date":"2016-10-05T16:11:44.753+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Temudschinn,realm=EUW,application-id=KYnfKGf0,discussion-id=8hMMpEBO,comment-id=0002000000010000,timestamp=2016-10-05T12:54:27.197+0000)\n>\n> Sorry, aber zu deinen Trundle-Bermekungen muss ich jetzt doch ein paar Korrekturen abgeben,auch wenns eigentlich OT ist.\n> Die Stärke von Trundle als Support liegt nicht unbedingt im Laneswap (das gibts seit 3 Patches eh quasi nichtmehr), sondern in erster Linie an seiner Ulti, die alle Fulltanks gnadenlos kontert. Ob Trundle wiklich unspielbar ist in tiefern MMR-Bereichen wage ich ebenfalls zu bezweifeln, da er mechanisch unglaublich einfach ist und auch sein Decisionmaking quasi nur das e betrifft - alles andere ist klar. Habe ihn aber erst auf Plat/Dia-Level gespielt und kanns daher nicht gut beurteilen.\n\nNaja... also... wie oft wurde Trundle während der WM als Support gepickt? 0 Mal... und warum ist dies so? Nun ja, weil sich gerade verdammt viel ums 2vs2 Laning dreht... Und da machst du halt gegen eine Nami (oder wie im Beispiel des TE) gegen eine Sona nichts. Die Sona kann ganz in Ruhe ihr Q maxxen und deine Lane permanent unter Druck setzen.\nNebenbei habe ich mich mit Trundle Support kurz beschäftigt, als es in Mode kam, was ja auch schon nen Jahr her ist... es kann also sein, dass man heute nicht mehr Stumpf den E maxxed. Damals war das die Idee dahinter. Ich habe es kurz ausprobiert und dann folgendes festgestellt:\n\nWenn mein ADC voller Selbstvertrauen dank einer eigenen Siegesserie auftritt, kann ich auch Trundle Support spielen. Ich hab da sogar mal ein Spiel mit BotrK Trundle Support gemacht, weil wir so weit vorne lagen...\nAber wenn der gegnerische ADC einfach nen Stückchen besser ist als meiner... was ja statistisch gesehen in der Hälfte der Spiele der Fall ist... Dann kann ich halt nur daneben stehen und zugucken, wie wir Stück für Stück zurückfallen. Zuerst in Farm, dann irgendwann in Kills und Türme. (Ernsthaft: Versuche mal als Jinx-Trunde Botlane gegen Lucian-Sona nicht den ersten Turm abzugeben.)\nUnd ja, wenn wir die Mid bis Lategame Teamfights erreichen, kann ich wieder was machen... Meine Einstellung ist aber, dass ich mich nicht auf meine Teammates verlassen will, damit wir unsere Powerspikes erreichen. Eher im Gegenteil: ich picke Champions, die sicher stellen, dass meine Mates später kräftig unterwegs sind. \nUnd Trundles Ulti... ist echt gut, wenn man sich absprechen kann. Was bringt es dir aber die Rüstung des Tanks zu schreddern, wenn du deinen Carries nicht mitteilen kannst, dass sie genau jetzt doch alles auf die Tanks schmeißen müssen? Und ich muss ehrlich zugeben: Ich erkenne die Trundle Utli in einem Teamfight nicht.\nUnd das die Sache wieder ganz anders aussieht, wenn du Dynamic Que als Premade Bot spielst. Wenn der ADC also garantiert weiß, wie er neben einem Trundle Support zu spielen hat. Und wenn die beiden genau absprechen können, wann man wie welche Combos (Pillar into Vayne Stun?) auspackt.\nFür die SoloQ, die ich halt immer noch spiele, ist mir das Risiko beim Trundle Picken einfach zu groß.","replies":[{"poster":"HyperionCH","date":"2016-10-06T05:54:53.861+0000","up_votes":1,"down_votes":0,"body":"Abgesehen davon, dass in Bronze kaum Tanks gespielt werden, weil sie weniger DMG machen. ;)","replies":[]}]}]}]},{"poster":"Waldschrat86","date":"2016-10-05T08:58:18.037+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=xerecok,realm=EUW,application-id=KYnfKGf0,discussion-id=8hMMpEBO,comment-id=00020000,timestamp=2016-10-05T08:48:28.543+0000)\n>\n> Habe genug Fehler gemacht, ohne Frage. Wurde auch gestern immer betrunkener , irgendwann ist es einen halt egal ...\n> 5 Spiele in Folge verloren wo ich meiner Meinung nach gut spielte zum Thema Wards sagte ich bereits genug...\n> Jeder der Schon mal Sport außerhalb der tastatur betrieben hat, weiß wie ein Ligasystem funktioniert und hier ist das nicht gegeben.\n> Ich behaupte nicht das ich nciht in Bronze gehöre aber es gehören viele, viele andere nicht dahin. \n> (Im übrigen verliere ich lieber ein gutes Spiel als 20 2 zu stehen...)\n> Zum Trundle Spiel schaue doch mal rein, ist ja nicht so das man als Sup auf den ADC angewiesen ist... dann reden wir nochmal ! (erst 10 min reichen, dann gehen wir auch nochmal das Thema Tode durch kann gerne Afk gehen aber als Tank habe ich die dumme Angewohnheit vorne zu stehen)\n\nJo muss ich mir nichtmal ansehen, du rennst ohne Vision an die Front und keiner folgt. Und ich verwette mein letztes Hemd, dass du wenn du reinpreschst nichtmal Ansatzweise im Blick hast, was deine Mates überhaupt up haben, welche Lvl, Manavorrat, naja und dann halt noch die fehlende Vision. Übrigens ist der ADC mehr auf den Sup angewiesen als umgekehrt, wenn der aber nicht supportet, sondern kp, was macht, reicht schon ein echter Bronzesup, um eure Lane zu stompen, ganz egal, was dein ADC anstellt.","replies":[]}]}]},{"poster":"Maíko","date":"2016-10-05T07:01:00.068+0000","up_votes":8,"down_votes":0,"body":"In deinen letzten Spielen:\nAnivia:\n1/8/3\n4,4 CS/M\n0.07 Wards die Minute\n0 Pink Wards\n\nWukong:\n2/0/2 \n(endlich mal Positiv....aber nur mit 14% Kill Participation...also kann man davon ausgehen dass du es deinem Team zu verdanken hast...\nund der Fakt das du mit 2414Dmg an Champions gerda mal 5,5% des gesamten Teamschadens angerichtet hat ist wohl der Beweis.)\n5,5 CS/Min als Jungler\n0,21 Wards die Minute\n0 Pink Wards\n\nGragas:\n3/4/4\n4,7 CS/M als Jungler\n0,08 Wards die Minute\n0 Pink Wards\n\nMiss Fortune:\n7/11/3\n7,5 CS/Min (der einzige Wert der mal akzeptabel ist)\n0,07 Wards die Minute\n0 Pink Wards\n\nIch würde mich ja schon als schlechten Warder bezeichnen...und ich hab durchschnittlich 0.4 Wards die Minute und min 2 Pink Wards....aber du untertriffst in den Aspekt wirklich alles...man könnte meinen deine Taste wäre kaputt und nur wenn du mal wieder auf deine Tastatur hämmerst wird aus versehen ein Ward gestellt....anders kann ich mir solche Werte nicht erklären.\n\nMeistens habe ich beim farmen zwischen 6 und 7 CS/M....was auch schon niedrig ist, aber das kommt dadurch das ich häufiger roamen gehe, den anderen Lanes aushelfe und dadurch etwas Farm verpasse.\nDu bleibst stur auf deiner Lane und bist trotzdem noch bei weitem unter meinem (bereits nicht so guten) Wert.\n\nFazit:\nDeine Präsenz auf der Map: Bronze\nDein Farm: Bronze\nDein Warding: Bronze\nDie Höhe deiner Tode: Bronze\n\nIch weiß nicht wie du Behaupten kannst nicht in diese Elo zu gehören....in meinen Augen hast du Glück das du noch nicht nach Bronze 5 abgestiegen bist.","replies":[{"poster":"xerecok","date":"2016-10-05T08:33:58.973+0000","up_votes":1,"down_votes":10,"body":"> Ich weiß nicht wie du Behaupten kannst nicht in diese Elo zu gehören....in meinen Augen hast du Glück das du noch nicht nach Bronze 5 abgestiegen bist.\n\nDas habe ich niemals behauptet!\nIch sagte lediglich das Ligasystem funktioniert nicht! Das sind 2 Paar Schuhe \n\nZum Warden, ich kann in dieser Liga 10 mal Rot pingen, da geht es drauf voll Kanne. Daran würde auch ein Pinkward nichts ändern. Ich erlebe ständig das der gegnerische Jgl im Gebüsch mit der Ward steht ich Rot pinge und tadada da geht es dann halt 2 gegen 3 ist doch Vayne.\n**Ich gebe dir also vollkommen Recht der Pinkward gibt nicht nur Sicht er erzeugt auch Intelligenz bei anderen Spielern, so dass niemand mehr dummes tut .  **\n\nDu hast genau die besten Spiele raus gesucht .... Je später der Abend umso betrunkener war ich könnte genau so gut 4 Spiele posten wo ich ganz nett da stand aber **´nochmal** \nIch will einfach nur ein faires Spiel und das ist einfach nicht gegeben!!! \n\nIch behaupte nicht das ich woanders hingehöre aber manche(viele)","replies":[{"poster":"CYPHΕR","date":"2016-10-05T08:45:33.917+0000","up_votes":7,"down_votes":0,"body":"Du willst doch einfach nur die Zustimmung, dass du lediglich wegen der schlechten Teammates Spiele verlierst und eigentlich höher gehörst aber durch das unfaire Ranglistensystem in Bronze gehalten wirst.","replies":[]},{"poster":"leonthefirefly","date":"2016-10-05T08:56:42.045+0000","up_votes":4,"down_votes":0,"body":"du sagst du willst ein faires game!\n\nund genau das bekommst du du spielst mit leuten die gleich viel feeden /schlecht warden und im cs nicht besser sind!\n\nwenn du mit besseren leuten spielen willst musst du an deinen eigenen stats arbeiten dan steigt man easy auf und spielt mit besseren mit weniger feedern! \n\nachja und zu deinem kommentar vonwegen ich war betrunken bei manchen spielen... selber schuld wenn du was getrunken hast und ranked spielst für sowas gibts normals.\n\ndu hast auf kaum einem champ ne vernünftige kda dh. ein großteil der probleme die du aufführst betreffen dich genauso (1&3 zb)\n\nachja und als main jgler: \nnicht der jgler ist dafür verantwortlich wenn du deine lane verlierst!!!!\nNur du allein! wenn du 5mal vom gegnerischen jgler gekillt wirst und dein jgler nie da war ist es zu 100% deine schuld weil du zuweit pusht/keine wave control hast.\nwenn du keine ganks bekommst höchst wahrscheinlich weil du am gegnerischen tower klebst...","replies":[{"poster":"Ozuraak","date":"2016-10-05T08:57:49.741+0000","up_votes":2,"down_votes":0,"body":"Never gank a lost lane {{sticker:slayer-jinx-wink}}","replies":[{"poster":"leonthefirefly","date":"2016-10-05T09:03:58.762+0000","up_votes":1,"down_votes":0,"body":"word^^ nur sollte man das den lanern nie sagen^^ \nsonst ist der tilt groß^^","replies":[{"poster":"Ozuraak","date":"2016-10-05T09:06:21.191+0000","up_votes":1,"down_votes":0,"body":"Erstens das und zweitens, wenn du es schriftlich ankündigest, dass du eine Lane nie ganken wirst, dann ist das reportbar.\n\nAlso einfach nichts schreiben und nicht ganken gehen.","replies":[{"poster":"CYPHΕR","date":"2016-10-05T09:13:47.736+0000","up_votes":1,"down_votes":0,"body":"Der Sinn hinter einem Gank ist ja, dass der Jungler einen Vorteil für das eigene Team auf der Lane schafft und versucht diesen auszunutzen (z.B. Kill, CS-Lead, Tower, etc...). Wenn durch den Gank aber gerademal der bereits vorhandene Nachteil des eigenen Laners ausgeglichen wird (wenn überhaupt), dann wird die im early wichtige Ressource \"Jungler\" fast schon verschwendet.\n\nEs ist eben diese Gradwanderung ob man jetzt einer Lane zum Snowball verhilft, lieber selber hochfarmt oder reaktiv den gegnerischen Jungler zu stören versucht. Die Entscheidungen müssen nämlich anhand des Spielverlaufs getroffen werden.\n\nImmer wieder schön zu lesen, wenn Spieler 1v1 die Lane verlieren und dann im Allchat \"gg no ganks\" schreiben. Jeder Laner steht fast schon in der Pflicht, eine Lane zumindest halten zu können (je nach Matchup kann es natürlich variieren ob man zwingend Kills erspielen sollte oder ein 20cs Defizit bereits als gewonnene Lane gilt).","replies":[{"poster":"Ozuraak","date":"2016-10-05T09:17:05.830+0000","up_votes":2,"down_votes":0,"body":"Naja ich mach das ganze nach einem einfachen strategischen Prinzip.\n\nJedes Militär verstärkt (zumindest in der Theorie) den Angriff nicht an der Stelle, wo es auf Widerstand stößt, sondern dort, wo der Durchbruch schon gelungen ist.\n\nÜbertragen auf Lol bedeutet das, wenn eine Lane schon führt, dann wird man durch einen Gank auf der Lane den Durchbruch noch verstärken könne.\n\nIch denke, dass es immer sinnvoller ist, stärken (in diesem Fall eine gewonnene Lane bzw. eine Lane die führt) auszubauen, als schwächen versuchen auszugleichen.","replies":[{"poster":"Temudschinn","date":"2016-10-05T12:36:00.405+0000","up_votes":3,"down_votes":0,"body":"Wobei man ergänzen muss, dass es auch Sinn macht Verstärkungen dorthin zu schicken wo ein feindlicher Durchbruch droht. Und da regen mich einige Jungler dann schon auf, die das \"never Gank a loosing lane\" weit überinterpretieren und nichtmal Top gehen, wenn der Gegner grad ne riesige Wave in den Tower reinpusht.","replies":[{"poster":"Haudruppmoor","date":"2016-10-05T13:07:20.855+0000","up_votes":1,"down_votes":0,"body":"Also ich wurde schon mal mit 0/2 mit Garen Top abgeschrieben. Meine Lane galt bei meinen Mates als schon verloren :( also 0 Ganks oder iwelche Hilfe. Die Hilfe wär mir auch egal gewesen, aber ein  paar Wards in den Fluß oder am unteren Jungleeingang hätten mir schon gereicht. Jedesmal wenn ich welche hinstellen wollte, wurde ich gesnatcht. Mir hätt es schon geholfen wenn der jungler die Wölfe gesmitet hätte ... jedenfalls hab ich mich bis ins Late retten können und konnte mir dann doch Items kaufen um tankiger zu werden um meinem Team dann doch noch ne Hilfe zu sein. Mit Garen kriegt man ja dann doch irgendwann die Kurve und is net soo ganz unnütz ^^\n\nGanks brauch ich nicht unbedingt, aber Sicht. Wenn ich selber Supp spiele oder doch mal den Wolf rauskrame, dann pflastere ich immer soviel Wards rein wie möglich.\n\nmfg\nMB","replies":[]},{"poster":"CYPHΕR","date":"2016-10-05T12:38:37.605+0000","up_votes":1,"down_votes":0,"body":"Die Entscheidung wann wo die Hilfe am besten genutzt werden kann ist ja ein großer Teil dessen, was einen guten Jungler ausmacht.","replies":[]}]}]},{"poster":"leonthefirefly","date":"2016-10-05T09:20:45.832+0000","up_votes":1,"down_votes":0,"body":"tja ich denke das wissen zumindest die jgler^^ aber die laner das ist nochmal was ganz anderes^^ \n\nMein absolutes highlight war eine midmorgana die mich geblamed hat das ich das spiel verloren hätte, (stand 5/5/18  bei 25 kills für unser team^^) dass ging soweit das es irgendwann unseren gegnern zu blöd wurde und sie morgana daraufhingewiesen haben was für einen bockmist sie verzapft^^","replies":[]}]},{"poster":"Uranbrennstab","date":"2016-10-05T11:34:29.550+0000","up_votes":2,"down_votes":6,"body":"> [{quoted}](name=Ozuraak,realm=EUW,application-id=KYnfKGf0,discussion-id=8hMMpEBO,comment-id=000500000001000000000000,timestamp=2016-10-05T09:06:21.191+0000)\n>\n> Erstens das und zweitens, wenn du es schriftlich ankündigest, dass du eine Lane nie ganken wirst, dann ist das reportbar.\n> \n> Also einfach nichts schreiben und nicht ganken gehen.\n\nKeine Buffs abgeben und erst recht nicht Drake und Baron warden. How to jungle 1&1","replies":[{"poster":"Ozuraak","date":"2016-10-05T11:45:30.319+0000","up_votes":2,"down_votes":0,"body":"Man sollte es schon im Zusammenhang sehen. Es ging im konkreten Fall darum, eine verlorene Lane nicht mehr zu ganken und nicht darum, generelle nicht zu ganken.","replies":[{"poster":"Uranbrennstab","date":"2016-10-05T12:18:44.974+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Ozuraak,realm=EUW,application-id=KYnfKGf0,discussion-id=8hMMpEBO,comment-id=00050000000100000000000000020000,timestamp=2016-10-05T11:45:30.319+0000)\n>\n> Man sollte es schon im Zusammenhang sehen. Es ging im konkreten Fall darum, eine verlorene Lane nicht mehr zu ganken und nicht darum, generelle nicht zu ganken.\n\nWar eigentlich mehr scherzhaft gemeint, kam aber scheinbar nicht so rüber.","replies":[]}]}]},{"poster":"leonthefirefly","date":"2016-10-05T09:22:14.543+0000","up_votes":1,"down_votes":0,"body":"hm das bezweifel ich das das reportbar wäre. Natürlich kommt es auf die art der kommunikation an aber wenn ich ihm sag das ich es für sinnvoller erachte counter zu jgln/ ne andere lane zu snowballen. Kann ich mir nicht vorstellen das dass reportbar ist","replies":[{"poster":"Ozuraak","date":"2016-10-05T09:28:01.078+0000","up_votes":1,"down_votes":1,"body":"https://support.riotgames.com/hc/de/articles/201752884-Einen-Spieler-melden\n\nWäre das hier:\n\n_Negative Einstellung – Diese Kategorie befasst sich mit nicht hilfsbereitem und egoistischem Verhalten, das dem teamorientierten Spiel widerspricht._\n\nSofern du also schreibst \"I never gank top\", dann könnte man das mMn schon reporten. Wenn du es auf deine Art schreibst (Counterjungle oder andere lane snowballen), dann natürlich nicht.","replies":[]}]}]}]}]}]},{"poster":"Abasin","date":"2016-10-05T09:31:55.755+0000","up_votes":4,"down_votes":0,"body":"> Je später der Abend umso betrunkener war ich\n\nSpielen und Alkohol geht für mich gar nicht zusammen. Wenn es schon soweit ist, dann hör einfach auf für den Tag. Und falls Du ein dauerhaftes Problem mit Alk haben solltest, dann löse zuerst dieses. Also entweder spielen oder saufen.\n\nUnd eins ist klar, Alkohol trübt das Urteilsvermögen, setzt die Reaktionsfähigkeit runter, enthemmt.","replies":[]}]}]},{"poster":"Temudschinn","date":"2016-10-05T13:09:48.057+0000","up_votes":5,"down_votes":0,"body":"Eines find ich an diesen \"mimimimielohell\"-Threads ja immer witzig: Mit an Sicherheit grenzender Wahrscheinlichkeit haben die eigenen schlechten Stats \"nachvollziehbare\" Gründe, während die Teammates einfach nur trollen oder in der falschen Liga plaziert sind.\n\n@TE: Was wäre, wenn deine Mitspieler betrunken waren? Wär dann alles wieder in Ordnung? Und falls nicht: Warum darfst du dich betrinken und scheisse spielen, deine Mitspieler aber nicht?","replies":[]},{"poster":"Izaya Kumiho","date":"2016-10-05T09:58:40.813+0000","up_votes":5,"down_votes":1,"body":">6.) ein Top der erst ab 06 einsieht, vllt sollte ich hinter gehen\n\n\nHast du ... nicht i-was vergessen, oder war das ein schriftlicher brainfart?\n\n>7.) ein Top der arg verliert aber als Freundlichkeit kein wechsel einsieht \n\nwas möchtest du damit genau sagen? soll das ´ne andeutung an einen laneswap sein?\n\n>Ja ich kauf nicht immer die lila dings \n\nMein name ist ward. Pink ward.\n\n\n>aber ich kann auch um einen Spieler einen Kries aus !!!! erzeugen der Junge rennt rein da hilft auch kein Wart ,\nAlso bitte erzählt mir ich gehöre hier rein. Besonderes Highlight der Ecko Top der nach 0 2 afk geht und locker wir das Spiel gewinnen...\n\nexcuse me? ich versteh dich leider wirklich nicht...\n\n/sigh\n\nListen lil buddy, du downloadest dir mal **baronreplays...**\nDu ...nimmst jedes..deiner spiele -schei* egal ob normal oder ranked- auf, und guckst dir dein verhalten an. NUR DEIN VERHALTEN ALLEINE. du guckst dir NICHT deine mitspieler an....du guckst dir nur deine spielart an.\n\n**Du nimmst jetzt einen stift und eine schreibunterlage...**\n\nDu setzt auf das erste blatt eine liste auf, mit der anzahl der minions die du NICHT gelasthittet hast..(über das ganze spiel, nicht nur die laningphase).\n\nAuf das zweite blatt setzt du eine list auf, von der ingamezeit deiner replayaufnahme, damit du deine fehler bzw tode wiederfinden kannst. Diese wirst du dir mehrfach nach den ersten beiden durchläufen der aufnahme erneut ansehen, bis dir klar wird was genau passiert ist, und was DU besser machen kannst.\n\nDie liste mit der anzahl der wards kannst du weglassen, das macht baronreplays für dich.\n\nDu kommst erst wieder hier hin, wenn du mindestens silver geworden bist. Dann reden wir gerne weiter.\n\n\n>Jeder der Schon mal Sport außerhalb der tastatur betrieben hat, weiß wie ein Ligasystem funktioniert und hier ist das nicht gegeben.\n\nsiehst du den apfel? Der ist keine birne. siehst du die birne? die ist kein apfel,gell?\nwarum zur hölle vergleichst du dann beide?\n\n>Habe genug Fehler gemacht, ohne Frage. Wurde auch gestern immer betrunkener , irgendwann ist es einen halt egal ...\n\nDafür gehörst du bestraft. Du fragst dich warum? Weil du **bewusst** die games von anderen leuten unnötig schwerer machst.\n\n>Aber bitte erzählt mir ich gehöre hier rein und das Spiel ist Fair\n\n/hält dir einen spiegel hin\nSag es dir selbst. Anders bringt es nichts.\n\nKthxbye","replies":[]},{"poster":"M Λ D Λ R Λ","date":"2016-10-05T07:11:27.338+0000","up_votes":3,"down_votes":0,"body":"Ich verstehe nicht wie man sich trauen kann allen anderen die Schuld zu geben wenn man in der untersten Liga sitzt. Naja, ich verstehe es auch bei anderen Ligen nicht, aber hier besonders.\n\nGlaubst du in anderen Ligen geht niemand mehr AFK? Trollt keiner? Feedet nie jemand? Flamed nie jemand? So eine Liga gibt es nicht. Finde dich damit ab dass du in die Liga gehörst und wenn du aufsteigen willst arbeite aktiv an dir anstatt stumpf ein Spiel nach dem anderen zu spammen in der Hoffnung etwas ändert sich von selbst.\n\nBtw.: Kein Ton über schlechte Teammates solange du Xin Zhao mit Deathfiretouch spielst.","replies":[{"poster":"xerecok","date":"2016-10-05T08:25:12.675+0000","up_votes":1,"down_votes":12,"body":"Ein Ligasystem sollte dafür da sein, gleich starken Spielern  ein Raum zu bieten und das ist nicht der Fall!!!\nAlles was du anprangerst liegt an einer schlechten Umsetzung und einen Meldesystem mit null Relevanz.\nDanke aber Hilfreich 0 / 10 am Thema vorbei 0/10","replies":[{"poster":"Waldschrat86","date":"2016-10-05T08:52:03.086+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=xerecok,realm=EUW,application-id=KYnfKGf0,discussion-id=8hMMpEBO,comment-id=00060000,timestamp=2016-10-05T08:25:12.675+0000)\n>\n> Ein Ligasystem sollte dafür da sein, gleich starken Spielern  ein Raum zu bieten und das ist nicht der Fall!!!\n> Alles was du anprangerst liegt an einer schlechten Umsetzung und einen Meldesystem mit null Relevanz.\n> Danke aber Hilfreich 0 / 10 am Thema vorbei 0/10\n\nlol spielst du only ranked? In normals ist das alles nicht anders, ganz ohne Ligasystem. Das bedeutet du hast eigentlich kein Thema.\nHast du denn ne Lösung? Kannst du in Köpfe schauen? Erstmal muss etwas passieren, dass auch danach geahndet werden kann.\nWie würdest du es denn umsetzen?\n\n>Je später der Abend umso betrunkener war ich\n\nWenn ich das in Bezug auf Rankeds in Kombination mit mimimi A ist zu gut B ist zu schlecht lese, glaube ich, dass du noch nichtmal ansatzweise eine Idee hast und generell das Ligasystem nicht kapierst, Aufstieg und Abstieg und so, soll auch Leute geben, die sich verbessern oder verschlechtern, da ist Bewegung drin.\nUnd falls du doch eine glorreiche Idee hast, was wohl auf direktere Banns rausläuft,wärst du dann mit deinen Suffspielen wohl einer der Ersten, die komplett rausfliegen.","replies":[{"poster":"xerecok","date":"2016-10-05T23:28:04.476+0000","up_votes":1,"down_votes":5,"body":"> lol spielst du only ranked? In normals ist das alles nicht anders, ganz ohne Ligasystem. Das bedeutet du hast eigentlich kein Thema.\nHast du denn ne Lösung\n\nWill dir ja nciht zu nah treten aber jemand der real Sport gemacht hat oder macht hat leider eine grundlegende andere Ansicht!\nHier wird zusammen gepackt Hauptsache man wartet nicht ,,,\nDas ist ein \"faires\" System bitte Kollege\n\n \n> Und falls du doch eine glorreiche Idee hast, was wohl auf direktere Banns rausläuft,wärst du dann mit deinen Suffspielen wohl einer der Ersten, die komplett rausfliegen\n\nDa magst du vollkommen Recht haben aber Vayne interessiert es willkommen im Ligasystem mein Freund! \nSChieße wa wenn eine die Argumente ausgehen weil es ja so Fair ist...","replies":[{"poster":"Waldschrat86","date":"2016-10-06T00:39:55.476+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=xerecok,realm=EUW,application-id=KYnfKGf0,discussion-id=8hMMpEBO,comment-id=0006000000000000,timestamp=2016-10-05T23:28:04.476+0000)\n>\n> Hast du denn ne Lösung\n> \n> Will dir ja nciht zu nah treten aber jemand der real Sport gemacht hat oder macht hat leider eine grundlegende andere Ansicht!\n> Hier wird zusammen gepackt Hauptsache man wartet nicht ,,,\n> Das ist ein &quot;faires&quot; System bitte Kollege\n\nDude ich hab 3 Jahre aktiv Fußball gespielt und 8 Jahre Handball. So was wolltest du nochmal sagen? Übrigens fehlt immer noch dein Beispiel für das, was du dir vorstellst.\n> \n> Da magst du vollkommen Recht haben aber Vayne interessiert es willkommen im Ligasystem mein Freund! \n> SChieße wa wenn eine die Argumente ausgehen weil es ja so Fair ist...\n\nBring doch mal ein Argument, das auch eines ist? Du hast ja noch nichtmal definiert, was für dich ein faires Ligasystem wäre.\nSpricht schon Bände, dass du einfach davon ausgehst, jemand der dir widerspricht, hätte nie Vereinssport betrieben.\nWie hättest du es denn gerne? Das fehlt immer noch. \nAus deinen Posts, gerade zu Wards geht doch hervor, du scheißt drauf, ist ein Part von vielen, die dich unten halten. Tja und so wie du auf das scheißt, scheißen da genug eben auf andere Dinge. Setz mal dieselben Maßstäbe an dich wie an deine \"Saboteure\".\nWenn du das machst, ist hier auch ne sinnvolle Diskussion möglich. Momentan geiferst du einfach nur rum.\nUms mal auf den Mannschaftssport zu übertragen, wie auch immer du darauf kamst, dass mir das fremd wäre:\nHandball (falls du die Regeln nicht kennst schau nach), Spieler übertritt bei jedem Torwurf, Gegner erhält den Ball, führt Angriff erfolgreich raus, irgendwann stehts 20:5, Spiel verloren. Konsequenz des Trainers, du spielst nicht mehr.\nJetzt hockst du auf der Bank und heulst den Trainer voll, dass er dich doch wieder spielen lassen soll, weil ein anderer Spieler Blocks macht, die im Stürmerfaul enden. Wenn er es übertreibt wie dein Bspalterego, wird der auch auf der Bank landen, aber warum solltest du eingewechselt werden, was bringst du denn mit, dass der Mannschaft Vorteile bringt? Selbst wenn die die fähig bist 30kmh stärker zu werfen als alle anderen bringt es dir absolut nichts, solange du es nicht geregelt bekommst auch gültige Abschlüsse zu produzieren.\nIn dem Gleichnis ist der Trainer übrigens das Ligensystem. Du kommst auf kein bessseres Spielniveau, solange du nicht selber besser bist.\nAchja und falls deine glorreiche Idee wäre Ligen so zu gestalten wie in der Bl o.ä., dann viel Spaß bei der Verstärkung deiner \"Probleme\".\nDenn wenn ich besser werde, muss ich ja bis Saionende erstmal warten bis ich in eine neue Liga komme. Ähm ja geil (z.B.), ich brauche ne halbe Saison um Goldniveau zu erreichen, dann hab ich das, aber auf Grund der Beschränkung wie bei Kreisliga etc. darf ich dann das andere halbe Jahr Leute wie dich in Bronze stompen? Wie gesagt selbst auf Nachfrage kam ja kein dMn faires Konzept, also geh ich mal davon aus, du willst das, was ich beschrieben. Belehre mich eines besseren, aber bisher geh ich davon aus, dass du jünger bist als die Jahre Mannschaftssport, die ich insgesamt in meinem Leben hinter mir habe, auf die 11 Jahre FB+HB kommen noch einige andere Sportarten dazu, wo es dann aber bei Tunieren, ein paar Wochen oder Leihe blieb. Dazu kommen noch 2 Jahre Elobasierter Schachsport.\nAber jo machs dir weiter einfach und meine jeder, der dir widerspricht könnte keine reale Ligenerfahrung haben.\nBin echt gespannt, ob du die erste Heulsuse bist, die sich durch ihre glorreiche Idee nicht selber ins Bein schießen würde.\nWobei Spannung bei der Frage echt kompletter Sarkasmus ist, wie gesagt du hast es ja bisher nichtmal hinbekommen zu definieren, was für dich das \"faire Ligensystem überhaupt wäre.\nDas was du evtl. suchst findest du in ARAM, immerhin gibt es da keine Meta und Wards. Oder Teamranked, aber da sind wir wieder bei dem, was ich im HBBsp. beschrieb, sogar ein Bronzeteam mit \"nur\" Silberambitionen würde dich direkt kicken.\n\nUnd bevor kommt, ich hätte keine Ahnung, weil ich ja Gold bin:\n\n1. sollte ja eh keine Rolle spielen, wenn wichtigstes Kriterium reale Ligenerfahrung sein soll.\n2. Ich war auch mal da, wo du in der Liga hockst, wahrscheinlich sogar tiefer. Damals war Silber 1200/50 Elo, ich hatte 650/700 Elo als Tiefpunkt.\n\nÜbrigens, wenn mich das Ligensystem so abfucken würde wie dich, würde ich einfach gar nicht nutzen oder das Spiel einfach seinlassen.\nKP wie man ein Freizeitvergnügen/Spiel so durchziehen kann, wenn es einen eigentlich nur tiltet.\nWerd mal erwachsen, ich hoffe echt du hast noch ein paar Jährchen bis es zumindest de iure so ist.","replies":[{"poster":"Homunculi","date":"2016-10-10T12:42:20.755+0000","up_votes":2,"down_votes":0,"body":"Ich musste mir gerade eine Träne aus den Augen wischen. Schöne Antwort.","replies":[]}]},{"poster":"Waldschrat86","date":"2016-10-06T00:40:45.033+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=xerecok,realm=EUW,application-id=KYnfKGf0,discussion-id=8hMMpEBO,comment-id=0006000000000000,timestamp=2016-10-05T23:28:04.476+0000)\n>\n> Hast du denn ne Lösung\n> \n> Will dir ja nciht zu nah treten aber jemand der real Sport gemacht hat oder macht hat leider eine grundlegende andere Ansicht!\n> Hier wird zusammen gepackt Hauptsache man wartet nicht ,,,\n> Das ist ein &quot;faires&quot; System bitte Kollege\n> \n> Da magst du vollkommen Recht haben aber Vayne interessiert es willkommen im Ligasystem mein Freund! \n> SChieße wa wenn eine die Argumente ausgehen weil es ja so Fair ist...\n\nNachtrag: Red nicht von jemand, wenn du dich meinst.","replies":[]}]}]},{"poster":"leonthefirefly","date":"2016-10-05T08:57:21.357+0000","up_votes":1,"down_votes":0,"body":"genau das tut es!\nwenn  du besser wärst würdest du aufsteigen","replies":[]}]}]},{"poster":"RAG Ryve","date":"2016-10-05T03:59:18.958+0000","up_votes":2,"down_votes":0,"body":"Bro, es gibt genug Smurfs aber ein sehr großer Teil der Smurfs gammelt nicht in Bronze herum, dort sind nur die wenigsten .Ein frischer Acc der von nem guten Spieler gespielt wird, wird nicht in Bronze eingestuft, der Rest den du beschreibst ist nunmal typisch Bronze. Bronze ist einfach die Elo wo die wenigsten Spielerfahrung, Mechanics, Mapawarness und Tactics  haben, deswegen ist es auch die niedrigste Liga. Und stell dir vor, sehr sehr viele von uns haben mal in Bronze angefangen und spielen jetzt woanders.","replies":[{"poster":"eingew","date":"2016-10-05T06:06:50.413+0000","up_votes":3,"down_votes":0,"body":"Eigentlich ist es aber genau andersrum ;). Bronze ist die niedrigste Liga und deswegen ist es logisch, dass die Spieler dort den geringsten Skill in allen Bereichen aufweisen :P.","replies":[{"poster":"RAG Ryve","date":"2016-10-05T06:16:23.174+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RAG Ryve,realm=EUW,application-id=KYnfKGf0,discussion-id=8hMMpEBO,comment-id=0004,timestamp=2016-10-05T03:59:18.958+0000)\n>\n>Bronze ist einfach die Elo wo die _**wenigsten **_Spielerfahrung, Mechanics, Mapawarness und Tactics  haben, deswegen ist es auch die niedrigste Liga. \n\nSagte ich doch.^^","replies":[{"poster":"eingew","date":"2016-10-05T06:36:30.775+0000","up_votes":2,"down_votes":0,"body":"Ich meinte explizit das \"deswegen\". Das klingt so als ob Bronze die niedrigste Liga geworden sei, weil da zufällig nur die schlechtesten Spieler drin waren. Dabei ist es ja andersrum...\n\n... ist aber auch Wortklauberei :D","replies":[{"poster":"RAG Ryve","date":"2016-10-05T06:46:58.107+0000","up_votes":1,"down_votes":0,"body":"Ja war aber eher so gemeint das dort die unerfahrensten Spieler sind eben weil es Bronze ist. XD","replies":[{"poster":"xerecok","date":"2016-10-05T08:37:03.670+0000","up_votes":1,"down_votes":9,"body":"Dann mach dir mal einen Smurfacc und schaue dir die Spiele an,\nDas geht von \"kann mir nicht die Schuhe zu binden\" bis eindeutig falsch in dieser Liga weil zu Gut...\nDas ist also ein Ligasystem, ich bitte euch .\nHier wird alles zusammen geworfen das man nicht zu lange wartet und was anderes spielt!","replies":[{"poster":"Sirrkas","date":"2016-10-05T10:22:18.456+0000","up_votes":5,"down_votes":0,"body":"Ich glaube, wenn ich noch einmal in Bronze spielen würde, könnte sogar ein 3vs5 locker für mich entscheiden.  In Bronze wird aber nicht alles zusammen geworfen. Wer eindeutig zu gut für Bronze ist, kommt da sehr schnell wieder heraus. Ich habe in Season 3 nur 30 Spiele nach der Einstufung gebraucht um Silber 5 zu erreichen. Das ist so gut wie gar nichts, wenn man regelmäßig Rankeds spielt. \n\n\nDie einzige Möglichkeit dauerhaft da drinnen zu bleiben ohne Riot einen Grund für einen Bann zu liefern, ist es auf Bronzeniveau zu spielen.","replies":[{"poster":"RAG Ryve","date":"2016-10-05T11:31:39.643+0000","up_votes":1,"down_votes":0,"body":"Exakt, ich brauche mir keinen Smurf mehr machen, ich habe schon einen und es war ziemlich ez den auf Gold zu spielen. Leute sie glauben sie sind zu gut für Bronze sind dort genau richtig. Wer dort nicht hingehört muss das nämlich nicht glauben sondern nicht drin sein. Ich kann genauso gut behaupten ich gehöre in Dia aber ich weiß durch meines Games und vor allem durch den Blick auf mich selbst das ich in Platin momentan sehr wohl hingehöre. Selbes gilt für Bronze.\n\nSiehs so, im Grunde ist LoL genau wie der Straßenverkehr. Absolut jeder außer du ist eine potenzielle Gefahr für dich, egal wer. Safety first!","replies":[]}]}]}]}]}]}]}]}]}