{"poster":"Ahris Man","date":"2015-09-14T16:47:22.513+0000","title":"Muss man sich sowas antun?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":8,"body":"Hallo alle zusammen.\r\n\r\nIch habe folgendes anliegen. K&ouml;nnte man bitte die Zeitstrafe und den LP verlust wenn amn eine Ranglistenq verl&auml;sst entfernen oder zumindestens abmildern. Ich bin Platin 2 wo ich glaube das man das Spiel ein bisschen ernst im Ranglistenmodus nehmen kann aber was bekomme? Alistar und BC Botlane, Zilean, Teemo, Shaco ban. Leute die mit ank&uuml;ndigung Feeden oder das ganze Spiel afk sind. Jetzt mal ganz unabh&auml;ngig wie man spielt es macht echt kein spa&szlig; mit solchen Trolllanes zu verlieren. Das ich so niemals weiter nach oben komme EGAL wie ich spiele ist doch klar. und man DARF nichtmal dem aus dem wege gehen das es schon beim 2 leave -13lp geht was bei mir schon so viel wie der lose selbst (-17) ist. Es ist doch l&auml;cherlich die Leute in das Spiel hineinzuzwingen.\r\n\r\nW&uuml;rd ganz gern eure Meinung h&ouml;ren und kein l2p noob geflame, ich w&uuml;rde mal behaupten das das Elo hiermit n&auml;mlich nichts zu tun hat.","replies":[{"poster":"SoloQisMentlBoom","date":"2015-09-14T17:25:24.694+0000","up_votes":2,"down_votes":1,"body":">Alistar und BC Botlane, Zilean, Teemo, Shaco ban.\n\nGut, dass du das picken darfst was du willst, aber niemand anderes was sie wollen.","replies":[{"poster":"Ahris Man","date":"2015-09-14T17:35:46.060+0000","up_votes":1,"down_votes":1,"body":"Nun ich verbiete niemand was er zu spielen hat oder nicht, aber sind wir mal ehrlich...sowas gehört sich im Rankend nicht. Im Ranked sollte man das Ziel haben auch zu gewinnen (sonst macht das mit den Ligen und LP nicht viel sinn). Wenn man Spaß haben möchte gibt es Teambuilder wo man ein Team hat was weiß was auf sie zukommt. Man zwingt keinem das eigene auf. Von mir aus auch Dominion. Aber zu sagen ich hab mal Spaß und dafür verlieren 4 Spieler LP ohne was dafür zu können finde ich eher dreißt.","replies":[{"poster":"SoloQisMentlBoom","date":"2015-09-14T18:04:43.773+0000","up_votes":1,"down_votes":1,"body":"Was ist wenn es eine eingespielte Alistar-BC-Pre-Botlane ist?\n\nBei Dyrus hat auch niemand wegen Olaf Toplane gemeckert. Und ausprobiert hat er es nach eigenen Angaben in der SoloQ.","replies":[{"poster":"Ahris Man","date":"2015-09-14T22:07:45.362+0000","up_votes":1,"down_votes":1,"body":"Zu schade das es keine Premades waren sonder der Last pick meinte man bräuchte keinen ADC. Die beiden haben sich das ganze Spiel gegenseitig geflamt. Obwohl mir der Bc leid tat da er ja wenig dafür konnte habe ich beide gemuted einfach weil es wirklich schlimm war.\nVon eingespielter duo bot kann nicht die Rede sein","replies":[{"poster":"Protective Puppy","date":"2015-09-15T08:36:00.706+0000","up_votes":1,"down_votes":1,"body":"Ich hab schon sehr oft mit Yasuo, Olaf, Katarina Botlane gewonnen. Immerhin spielt man auch Varus mitte. \nWarum so krass an die Meta halten?","replies":[{"poster":"Ahris Man","date":"2015-09-15T21:32:28.442+0000","up_votes":1,"down_votes":2,"body":"Nichts für Ungut, du bist Gold 5 und auf etwas niedrigerem Elo habe ich sogar mit fizz amumu duo top lane gewonnen (soraka mid,xin jungle, varus solo bot). Ja es ist zu gewinnen aber sind wir mal ehrlich, es ist bei weitem schwieriger und ein fehlender ADC ist im lategame fatal. Gut soweit kam es gar nicht da die beiden sich zu tode geflamt haben und das ganze team schon ab minute 8 gesagt hat surr@20\n\nVarus Mid...korrigiert mich wenn ich falsch liege aber hat das nicht Faker oder irgendein Pro vorgemacht? Was in der Soloq gespielt wird hängt auch davon ab was die Pros spielen. Siehe Twisted Fate jungle, varus/irelia mid oder Maokai top. Ich würde sogar behaupten die Pros bestimmen die Meta der Soloq. Was Varus damit nicht zum Sonderling macht.\n\nEs ist ja auch nicht schlimm sich mal nicht an die Meta zu halten, aber GEGEN den willen der 4 Mitspieler im rank, ich finds einfach Dreißt und Unfair.","replies":[{"poster":"Protective Puppy","date":"2015-09-16T08:22:24.304+0000","up_votes":2,"down_votes":1,"body":"\"Varus Mid...korrigiert mich wenn ich falsch liege aber hat das nicht Faker oder irgendein Pro vorgemacht?\"\nMOMENT! Das heißt wenn irgendein Pro Katarina, Yasuo, Olaf etc auf Botlane spielen würde, DANN wäre es okay? \nIrgendwie seh ich da keine Logik hinter. Zudem gehst du völlig am Punkt vorbei.\nIm SoloQ ist es mir egal was die anderen von meinem Pick halten.\nDeshalb heißt es \"SoloQ\".\nUnd ich finde die Sorte von Spieler viel Schlimmer die mich schon in der Champselect wegen meinem Pick flamen, als die die sowas \"meta-Fremdes\" picken.","replies":[{"poster":"Ahris Man","date":"2015-09-16T11:57:12.657+0000","up_votes":1,"down_votes":0,"body":"Die Sache ist die wenn Olaf und Kat auf der Botlane gespielt werden aus einem guten grund (also der Pro trollt nicht weil er gut ist und auch so gewinnt bzw weil er bock drauf hat) sondern weil sie zb ein krassen early game haben und jeden adc vernichten (was sie nicht tun aber das geht zu tief) DANN wäre es auch Meta. Solange es aber nur 1 Pro 1 mal gemacht hat ist es auch keine Meta. \nNein es heißt nicht Soloq weil du machen darfst was du willst bzw picken. Ich sage dir spiel 1 Monat Sivir Jungle im rank und ich garantiere dir das es 1. nicht so gut wie andere picks sind und 2 du mehr als 1 mal reportet wirst.\nEs kann dir zwar egal sein was andere von dir halten, den anderen aber nicht. Den trolls ist es ja auch egal ob sie verlieren, den anderen 4 aber nicht.","replies":[{"poster":"4 R4nd0m N008","date":"2015-09-16T12:28:49.151+0000","up_votes":2,"down_votes":0,"body":"> Nein es heißt nicht Soloq weil du machen darfst was du willst bzw picken. Ich sage dir spiel 1 Monat Sivir Jungle im rank und ich garantiere dir das es 1. nicht so gut wie andere picks sind und 2 du mehr als 1 mal reportet wirst.\nEs kann dir zwar egal sein was andere von dir halten, den anderen aber nicht. Den trolls ist es ja auch egal ob sie verlieren, den anderen 4 aber nicht.\n\nReports sind nichts wert, wenn sie ungerechtfertigt sind. Und Reports gegen Spieler die sich nicht an die \"Meta\" halten sind immer ungerechtfertigt und haben damit keine Ausiwrkungen.\n\nMuss ich in SoloQ also immer **DAS** Beste picken? Was ist wenn ich diesen Champ nichtmal ansatzweise spielen kann und 1000x besser bin mit Sivir Jungle? Und warum sollte einen das interessieren wenn es dem Team nicht egal ist? Man kann auch Sivir im Jungle spielen **UND** versuchen zu gewinnen und nicht zu trollen. Keine Ahnung warum solche Leute immer sofort \"Trolls\" sein sollen. Laut Riot gibt es keine Meta an die man sich halten muss. Warum immer alle rumschreien und mir vorschreiben wollen was ich spielen soll, aber überhaupt nicht kann, kann ich kein bisschen nachvollziehen. Letzendlich kann man mit jedem Champ im High Elo landen.","replies":[{"poster":"Ahris Man","date":"2015-09-16T14:55:20.215+0000","up_votes":1,"down_votes":0,"body":"Es geht nicht unbedingt darum DAS beste zu picken. Und ja man kann Sivir Jungle spielen und nicht trollen. Und mit welcher Begründung werd ich nun \"gezwungen\" mit ihm zu spielen? Klar kann ich leaven, aber das selbe oder ähnliches passiert dann 2 Spiele später. Klar ich kann auch ganz mit dem Spiel aufhören.\nAber ne Lösung ist das nicht ne? Ich habe auch nichts gegen unübliche picks. Ich selber spielen liebend gerne Fiora und Irelai Mid. Aber ich weiß das einzusetzen und frage mein Team ist das ok für euch? Wenn nicht richte ich mich nach dem Team.\n\nWie gesagt es ist ein Teamspiel und das ganze Team wird nach der erbrachten Leistung bewertet (Sprich alle gewinnen oder verlieren). Wenn jeder LP bekommen würde abhängig von der eigen leistung wär es mir doch egal was du spielst. Ich vermute das würde das flamen auch verringern da es einem nun egal sein kann ob der Jungler 0/6 ist oder nicht. Doch solange du absichtlich in Kauf nimmst das wir alle wegen DIR LP verlieren find ich das nicht korrekt deinen Mitspielern gegenüber.","replies":[{"poster":"SoloQisMentlBoom","date":"2015-09-16T23:44:42.850+0000","up_votes":1,"down_votes":0,"body":">Ich selber spielen liebend gerne Fiora und Irelai Mid. Aber ich weiß das einzusetzen und frage mein Team ist das ok für euch? Wenn nicht richte ich mich nach dem Team.\n\nDann sei doch froh es besser zu machen als viele andere.\nKlar kann man sich über Leute die es nicht tun aufregen, aber dem Team und dir selbst schadet es nur.\n\n>Doch solange du absichtlich in Kauf nimmst das wir alle wegen DIR LP verlieren find ich das nicht korrekt deinen Mitspielern gegenüber.\n\nVielleicht hatte die Person, genau wie du bereits positive Erfahrung mit dieser Methode gesammelt. Ich habe eine zeitlang Sejuani Support gespamt und als ich sie im Ranked gespielt habe, im Early richtig verkackt.\nAnstatt mich wegen meines Picks zu blamen, haben meine Teammates mir zugesprochen, dass wir doch den besseren TEamfight hätten etc.","replies":[]}]}]}]}]}]}]},{"poster":"HyperionCH","date":"2015-09-15T08:14:02.403+0000","up_votes":1,"down_votes":1,"body":"Du hast dich mit Darius aber auch nicht gerade mit Ruhm bekleckert. ;)","replies":[{"poster":"Ahris Man","date":"2015-09-15T21:26:08.788+0000","up_votes":1,"down_votes":1,"body":"Nein, das hat in diesem Spiel keiner von uns. Es ist halt unglaublich frustrierend das geflame und die Stats von denen zu sehen. Bin {{champion:103}}  main und spiele recht selten Top, bin nicht gut mit {{champion:122}}  und der {{champion:41}}  hat mehr Spiele mit {{champion:41}}  als ich mit {{champion:103}}  also das ich die lane da verliere find ich auch nicht schlimm.","replies":[]}]}]}]}]},{"poster":"Kelomat","date":"2015-09-14T17:31:07.518+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Ruaga,realm=EUW,application-id=ip27PlEH,discussion-id=aQ2EnPfT,comment-id=0000,timestamp=2015-09-14T17:25:24.694+0000)\n>\n> Gut, dass du das picken darfst was du willst, aber niemand anderes was sie wollen.\n\nWenn man mal ehrlich ist, hat das nichts mit \"man darf picken, was man will\" zu tun, sondern tatsächlich \"ich will Spaß haben und nehme dafür eine (wahrscheinliche) Niederlage in Kauf\" .. Und das ist nicht in Ordnung, finde ich. Das kann man gerne in nem Normal machen, aber durch sowas kann man den 3 anderen Teammitgliedern schon gehörig das Spiel madig machen.","replies":[]}]},{"poster":"Minamitsu Murasa","date":"2015-09-16T09:44:19.671+0000","up_votes":2,"down_votes":2,"body":"Disco Nunu...\n{{champion:20}} {{summoner:13}} {{summoner:2}} {{item:3364}} \nParty Party\n\nOk im Ernst,ich habe einen Kumpel,der verliert jeden Tag so knapp 13 LP,weil er immer wieder dodgen muss.Ist Diamond V,und er bekommt oft genug sowas,wie du sagst.\nDisco Nunu's machen es einem noch schwerer.","replies":[{"poster":"Ahris Man","date":"2015-09-16T11:58:47.523+0000","up_votes":1,"down_votes":0,"body":"Nun ich denke nicht das du sowas auch für Fair hälst? Ich sehe nicht den Sinn darin Leute darein zu zwingen. Auch wenn der Troll/AFK bestraft werdne sollte durch die neuen Leaverbuster etc. Für DEINE LP macht das kein Unterschied.","replies":[{"poster":"Minamitsu Murasa","date":"2015-09-16T12:16:11.383+0000","up_votes":1,"down_votes":1,"body":"ist auf Reddit gerade ein großes Thema,weil momentan spielt sich das oft in Platin und Dia ab.\nMan *kann* ncihts gegen solche Leute machen,die einen dazu forcen,zu leaven.Weißt du was das Problem ist?Die Typen werden nicht gepunished, solange sie nicht *intentionally* feeden.\nUnd weil sie so selten lastpick sind,wie jeder von uns,spielen sie sehr selten Nunu,wodurch der LP-Loss nciht auffällt.","replies":[{"poster":"Ahris Man","date":"2015-09-16T14:45:23.848+0000","up_votes":1,"down_votes":0,"body":"Nun AFK Zeiten werden durch den Leaver Buster bestraft...musst dann halt 5 Minuten vor jedem Spiel warten für 5 Spiele. Aber 4 Leute verlieren LP ohne was daran ändern zu können. Und das find ich unfair. Klar kann man nicht sagen ihr hattet einen AFKler und damit verliert ihr keine LP, denn das könnte man Ausnutzen.\nWeiteres Problem ab was ist es den Intentionally. Hatte letztens ein support game 2/12/12...haben gewonnen wohlbemerkt. Unser toplaner hat auch gesagt ich wäre absichtlich am feeden. Nein ich bin einfsch ein schei* support und Zyra muss nunmal an den gegner ran für ihre Ult.\nUnd zwar ist Riot im ban wahn aber was das angeht sind sie relativ gelassen.\nDeinen letzten Satz musst du mir erklären den versteh ich nicht^^","replies":[{"poster":"Minamitsu Murasa","date":"2015-09-16T16:07:24.338+0000","up_votes":1,"down_votes":1,"body":"Ich rede nicht über AFkin,sondern über trolling und Leaven des Champselects.","replies":[]}]}]}]}]},{"poster":"HyperionCH","date":"2015-09-15T08:24:51.181+0000","up_votes":1,"down_votes":1,"body":"Also solche Spieler wirst du nicht immer in deinem Team kriegen. Die kriegen auch deine Gegner; diese sogar häufiger als du (sofern du selber kein Troll bist bzw. dein Verhalten dazu führt, dass deine Mates trollen/absichtlich feeden/etc.)\nDamit wirst du also profitieren.\n\nWenn du in der CS dodgest, verlierst nur du LP.\nAnders gesagt: der Troll gewinnt, wenn jemand dodged.\n\nDeshalb auf keinen Fall dodgen!\nAuch wenn das Game verloren geht: der Troll verliert auch LP. Und er verliert in jedem Game LP, weil er immer mit einem Troll (sich selbst) im Team spielt.\n\nWenn du dodgest, dann ist es deine Schuld, dass diese Trolle noch in Platin sind.","replies":[]},{"poster":"Kaitri","date":"2015-09-15T07:42:25.319+0000","up_votes":1,"down_votes":1,"body":"dass das elo damit nichts zu tun hat hast du richtig erkannt.\nund um deine thread frage zu beantworten: nein sowas musst du dir nicht antun, es zwingt dich ja keiner ranked zu spielen oder zu leaven.\nbanns sind nicht wirklich sonderlich wichtig, siehe faker der auf seinem smurf im soloq IMMER die ersten 3 champs (im koreanischen alphabet) bannt. das waren garen gangplank und wer halt danach kam. trotzdem war er mit dem smurf genauso challenger","replies":[]}]}