{"poster":"nÚLL","date":"2017-02-17T15:58:29.982+0000","title":"idea para mejorar el sistema de remake (entren y lean todos van a querer apoyar esto)","subforum":"Problemas Técnicos","up_votes":47,"down_votes":5,"body":"recien tuve un hecarim que compra y dice &quot;me tengo que ir afk, viene gente a mi casa, me voy a ver si pueden tirar rmk&quot; y claramente no pudimos porque habia comprado. no pueden hacer algo con este sistema de que si se va despues de comprar no se puede tirar remake ? me parece una estupides que no se pueda cuando igual tuvimos que intentar jugar con un afk y el heca se fue min 1 30. para mi si se va antes de minuto 3 se deberia poder tirar remake igual, porque por varias razones se puede ir e igual me fume los -18 lp, tras que la comunidad cerca de diamante 5 es un cancer y se te van afk por que se mueren 2 veces, o se re flamean, o se trollean tengo que andar perdiendo partidas gratis cuando le gane linea a mi counter. por favor rito tenganlo en cuenta. muchisimas partidas ya se han cagado por esto y si quieren que no se caguen mas partidas por afk, este es un buen camino para arrancar. ty","replies":[{"poster":"Elrexx","date":"2017-02-17T17:53:08.492+0000","up_votes":2,"down_votes":13,"body":"ami me pasa lo mismo tendria que ser hasta el minuto 5 que se puede tirar rmk y otro caso es que tendrian que implementar que puedas kickear a un jugador si los 4 votan que si de la sala de una cuando te toca gente que flamea a cara de perro o pone trollea o esta aburrido, se que podes dodgear pero si dodgeas por cada uno que te cruzas en LAS terminas bronce 5 minimo en fija. Otra cosa injusta es que te toque gente que pierde 10 partidas ranked por dia y sigan molestando y  jodiendo gente que capas juega una o 2 por dia y queda feliz tendrian que poner que si pierden 3 maximo por dia tenga que esperar minimo 12 horas cosa que no encontres tantos  ","replies":[{"poster":"nÚLL","date":"2017-02-17T18:11:27.030+0000","up_votes":3,"down_votes":0,"body":"mmm no se si estoy de acuerdo con el tema de quitear gente del lobby. porque ponele que alguien quiere usar algo que no está en meta: te pongo el ejemplo de ziggs bot cuando todavia no se veia en todos lados. esa persona no va a poder jugar ziggs bot porque lo van a tildar de troll y a lo mejor carreaba ese game si lo dejaban jugar. entendes ?","replies":[{"poster":"Princess Kitten ","date":"2017-02-17T18:33:59.108+0000","up_votes":4,"down_votes":0,"body":"o jugar singed mmmmm kappita","replies":[]},{"poster":"AxGod","date":"2017-02-17T18:35:50.225+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Chase the weed,realm=LAS,application-id=X54mVVp0,discussion-id=Qo72zgJj,comment-id=00020000,timestamp=2017-02-17T18:11:27.030+0000)\n>\n> mmm no se si estoy de acuerdo con el tema de quitear gente del lobby. porque ponele que alguien quiere usar algo que no está en meta: te pongo el ejemplo de ziggs bot cuando todavia no se veia en todos lados. esa persona no va a poder jugar ziggs bot porque lo van a tildar de troll y a lo mejor carreaba ese game si lo dejaban jugar. entendes ?\n\ntenes mucha razon lo que decis, sacar gente del loby seria mucho quilombo, las colas serian infinitas y tardarias asco de tiempo en entrar a jugar porque va un teemo top o lo que sea que capas te termina carreando o no, pero bueno eso es otro tema, deberian mejorar el remake eso si, el remake es lo mejor que tienen, pero tienen que pulirlo mas, como decis vos si se va uno afk ants de los 3 minutos tener derecho a tirar remake, pero solo antes de los 3, y lo bueno que en caso que se vaya no se al minuto 4 o 5 o 10, Riot ya aviso que van a probar de poner el Surrender temprano al minuto 15 con la votacion positiva del team completo, o algo asi","replies":[]},{"poster":"Tutancadead","date":"2017-02-17T22:26:58.199+0000","up_votes":2,"down_votes":0,"body":"Se debería poder reportar lo que dices en el lobby y que tenga valor estará por que ahí no puede ser un \"mal día\"","replies":[]},{"poster":"MD Abýssou","date":"2017-02-19T02:26:05.892+0000","up_votes":1,"down_votes":0,"body":"Bro, si me habran puteado por jugar ziggs en bot, lo empeze a jugar dos semanas antes que se viera en la lck y en absolutamente todas esas partidas me recagaron a puteadas a pesar de salir bien de linea, se vio en la lck y nadie me decia nada, como odio esta comunidad.","replies":[]}]},{"poster":"Derubio","date":"2017-02-17T22:12:15.487+0000","up_votes":1,"down_votes":3,"body":"Tal cual, presentar un metodo de kickeo seria lo ideal.. el tema es si el troll entra con un premade o dos..\n{{summoner:14}}","replies":[{"poster":"Doomenator","date":"2017-02-18T03:16:17.456+0000","up_votes":2,"down_votes":0,"body":"El sistema de kickeo no es ideal.","replies":[{"poster":"Derubio","date":"2017-05-14T20:12:30.782+0000","up_votes":1,"down_votes":0,"body":"Relee el mensaje, tomate tu tiempo. Evidentemente no entendiste lo que puse","replies":[]}]}]},{"poster":"NeLord","date":"2017-02-18T05:31:45.233+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Elrexx,realm=LAS,application-id=X54mVVp0,discussion-id=Qo72zgJj,comment-id=0002,timestamp=2017-02-17T17:53:08.492+0000)\n>\n> ami me pasa lo mismo tendria que ser hasta el minuto 5 que se puede tirar rmk y otro caso es que tendrian que implementar que puedas kickear a un jugador si los 4 votan que si de la sala de una cuando te toca gente que flamea a cara de perro o pone trollea o esta aburrido, se que podes dodgear pero si dodgeas por cada uno que te cruzas en LAS terminas bronce 5 minimo en fija. Otra cosa injusta es que te toque gente que pierde 10 partidas ranked por dia y sigan molestando y  jodiendo gente que capas juega una o 2 por dia y queda feliz tendrian que poner que si pierden 3 maximo por dia tenga que esperar minimo 12 horas cosa que no encontres tantos\n\napoyo la moción{{champion:104}}  con toda violencia","replies":[]}]},{"poster":"PuIse","date":"2017-02-17T17:25:33.804+0000","up_votes":3,"down_votes":0,"body":"Claro! la comunidad en sí es así, y uno como jugador de ya varios años, ya solo debes aguantar, ni hablar de como es en cada liga, que como bien dices se alteran por cualquier tipo de signo de que pueden perder, entonces se pierden las ganas de seguir intentando de a poco, sería ideal que pudiera haber algún tipo de cambio o una sanción más severa de la parte de RIOT  para este tipo de asuntos.","replies":[]},{"poster":"Doomenator","date":"2017-02-18T03:17:47.952+0000","up_votes":2,"down_votes":0,"body":"Yo digo que en esos casos no hay mucho que hacer más que meter un surrender rápido... pero que igual te contaría como una derrota, si fuera por eso haríamos que todos los games con un AFK no contaran y sería bastante injusto perder tiempo y no ganar nada también. \n\nNo podemos pensar en resolver al 100% el tema de los afk aunque sí me parecería una buena idea dar 2 oportunidades de remake, una al min 3 y la otra al min 5.","replies":[]},{"poster":"Rick Silence","date":"2017-02-17T23:11:01.567+0000","up_votes":2,"down_votes":0,"body":"Apoyo la idea.","replies":[]},{"poster":"BaNiTo","date":"2017-02-17T18:56:05.102+0000","up_votes":1,"down_votes":4,"body":"También lo que yo pienso que tendrían que agregar al sistema de remake es: \n \n Es lo más tedioso entrar a una partida y que algunos de los jugadores se vaya afk (accediendo al remake, ya sea del lado enemigo o aliado), practicamente, nosotros estamos cumpliendo, en jugar la partida, y es una pérdida de tiempo para el que cumplió.\n Con esta idea yo propongo que en el sistema de remake, los afectados por el remake, les den algo de puntos por cumplir, ya que está perdiendo tiempo por alguien que se fue afk, ya sea por su conexión o distintos motivos. Lo ideal sería para mi, dar algunos puntos (ya sean 10 al equipo contrario al remake y 5 puntos al equipo del remake)\n\n Desde ya muchas gracias {{champion:201}}","replies":[{"poster":"F de Flan","date":"2017-02-17T19:45:50.938+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=BaNiTo,realm=LAS,application-id=X54mVVp0,discussion-id=Qo72zgJj,comment-id=0003,timestamp=2017-02-17T18:56:05.102+0000)\n>\n> También lo que yo pienso que tendrían que agregar al sistema de remake es: \n>  \n>  Es lo más tedioso entrar a una partida y que algunos de los jugadores se vaya afk (accediendo al remake, ya sea del lado enemigo o aliado), practicamente, nosotros estamos cumpliendo, en jugar la partida, y es una pérdida de tiempo para el que cumplió.\n>  Con esta idea yo propongo que en el sistema de remake, los afectados por el remake, les den algo de puntos por cumplir, ya que está perdiendo tiempo por alguien que se fue afk, ya sea por su conexión o distintos motivos. Lo ideal sería para mi, dar algunos puntos (ya sean 10 al equipo contrario al remake y 5 puntos al equipo del remake)\n> \n>  Desde ya muchas gracias {{champion:201}}\n\nPara qué?  Básicamente es poder subir sin demostrar tener la habilidad necesaria. Si, es molesto tener que remakear. Pero puntos por \"cumplir\"?","replies":[{"poster":"BaNiTo","date":"2017-02-17T20:01:08.758+0000","up_votes":2,"down_votes":0,"body":"En sí en el remake hay mil cosas para corregir y mejorar, si, puede haber gente que se aproveche de esta ventaja, pero con las limitaciones necesarias y las penalizaciones correctas sería mas justo para alguien que entra a jugar LOL y una persona por X motivo está afk","replies":[]}]},{"poster":"yo soyyoporqueno","date":"2017-02-17T19:29:17.116+0000","up_votes":2,"down_votes":0,"body":"seria totalmente injusto, alguien podria ver el sistema y aprovecharse de con un amigo subir una cuenta a una liga alta por el remake y despues subir la otra por ese metodo","replies":[{"poster":"BaNiTo","date":"2017-02-17T19:31:32.077+0000","up_votes":2,"down_votes":0,"body":"Podrían poner límites, 3 remake con que den puntos por semana.","replies":[]}]}]},{"poster":"Thails SirYordle","date":"2017-02-17T19:10:29.205+0000","up_votes":2,"down_votes":0,"body":"Ah teshible","replies":[]},{"poster":"Ks Erwyn","date":"2017-02-17T17:26:58.174+0000","up_votes":3,"down_votes":1,"body":"si tienen que mejorarlo, pienso que 3 min para el remake esta bien, lo malo de esto es que si, no tiene en cuenta a la gente que se va afk durante esta franja de tiempo, deben mejorar el sistema para que detecte rápido a los desconectados o inactivos, no puede ser que tengas 3 min. para hacer remake pero son 5 para que el leave buster te detecte como desconectado...es ilógico.  ","replies":[]},{"poster":"Cero404","date":"2017-02-17T20:13:28.309+0000","up_votes":2,"down_votes":1,"body":"el Sistema de remake tiene algunas fallas, y cosas malas, ami me jode cuando en una partida hicimos invade matamos a 3 y de la nada al min 3, REMAKE, ami me parece injusto que hayamos hecho bien un invade al punto de matar al JG ADC y SUPP y el remake se pueda tirar de todas formas, lo mejor de todo es que el usuario que estaba afk (el top) se estaba reconectando, y en parte ese es otro problema, y es que el juego deveria avisar al equipo de que ese jugador afk esta volviendo, o que si el juego detecta eso que no se pueda tirar el remake","replies":[]},{"poster":"Payaso down","date":"2017-02-18T20:21:48.350+0000","up_votes":1,"down_votes":0,"body":"Pero no importa si compro o no, si el heca  ABANDONO PARTIDA luego de comprar y antes del minuto 1:30, igualmente se puede tirar remake, de no haber sido asi entonces no se puede.","replies":[]},{"poster":"La corrupción","date":"2017-02-18T00:48:20.810+0000","up_votes":1,"down_votes":0,"body":"Dat lucian","replies":[]}]}