{"poster":"Jentlemen86","date":"2017-05-16T12:56:51.177+0000","title":"Frequent disconnects while Internet is fine","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"Dear Community and Riot,\r\n\r\nSince a couple of weeks ago i've started playing league on a macbook (yes i know, it was a gift.) \r\nFrom the start i've had problems running LoL on my macbook. In 1 in 3 games my client disconnects and isn't able to reconnect unless i reboot the client. First I played on wifi, later with an ethernet connection and I've even let my Internet provider do several checks while i was playing. In no case was something wrong with my Internet connection. \r\n\r\nMy hope is on someone having thoughts about how to fix this, or at least point to the problem. Eventhough this mac is quite old, to my limited knowledge the specs seems to be enough. Im running league on minimal settings at the moment.\r\n\r\nMacbook pro (medio 2010)\r\n2.4 Ghz Intel Core 2 Duo \r\n8GB 1067 Mhz DDR3 \r\nNVIDIA GeForce 320M 256MB (o god why) \r\n(Is this enough? :p)\r\n\r\nYour help would be appreciated!","replies":[{"poster":"Jentlemen86","date":"2017-05-17T18:33:48.359+0000","up_votes":1,"down_votes":0,"body":"Hi all and thanks for your quick replies:)\n\nIm using the Huawei HG659 as provided by T-Mobile in the Netherlands. \n\n@Porocles i've run through the connection issues, but sadly it mainly focusses on Windows fixes. But still a lot of thanks, I'm assured that my connection settings seem to be fine. \n\nYesterday evening there was a small patch though, since then no disconnects.. Haven't looked up wether those were some kind of fixes or something. Haven't played that many matches since but still, a fool's hope remains!\n\nThanks again guys/gals","replies":[]},{"poster":"LorDFeO","date":"2017-05-17T11:22:16.851+0000","up_votes":1,"down_votes":0,"body":"I have mac-pro and same problem after new update.","replies":[]},{"poster":"Porocles","date":"2017-05-16T16:17:40.698+0000","up_votes":1,"down_votes":0,"body":"Even though your internet is solid, you can run into issues trying to reach specific servers or services.  Your network is constantly transitioning between different services, so it's possible one or even a few are getting blocked off.  You'll want to go over each step of the [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to troubleshoot this and remove those obstacles.  If the issue persists, hit me up with where exactly you're getting those disconnects too.","replies":[]},{"poster":"TheWywrdPlatypus","date":"2017-05-16T13:17:25.214+0000","up_votes":1,"down_votes":0,"body":"What type of modem are you using? theres a huge issue with all modems that have the puma 6 chipset, which is causing it to drop packets when theres a steady stream of low bandwidth packets (like in games).  its currently affecting lots of gamers in several different games.  DSLreports has a test [here](https://boards.na.leagueoflegends.com/en/c/help-support/VQXYE6aG-frequent-disconnects-while-internet-is-fine) to help see if this is the issue.  theres also a class action lawsuit going on that you can read about [here](https://www.bleepingcomputer.com/news/hardware/lawsuit-brewing-over-unfixed-bug-in-intel-puma-6-cpus/).  hope this helps!","replies":[]}]}