{"poster":"Ahristocats","date":"2017-09-03T11:34:18.997+0000","title":"Riot plans to support melee champions, let's give them some ideas","subforum":"Gameplay","up_votes":36,"down_votes":10,"body":"So Asyrite said that riot understands how ranged champions (aka marksmen) are always first compared to melees and they plan to support melees instead of skewering them into splitpushing styles (aka tryndamere)\n\ni expect changes to be done in either season 9 or late season 8, rune reforged will take pre season 8 focus, then during season 8 they will start to work on this problem.\n\nidea 1: give more melee/ranged penality on items\nLooking at {{item:3153}}  this item was fine on melees but gave early powerspike to ranged champions which is why they increased the cost by 200 and reduced lifesteal. one of the possible change was making it 4% damage on ranged champions and 8% on melee champions\nother candidates: {{item:3124}} {{item:3812}} {{item:3053}} {{item:3071}}  {{item:3087}} \n\nidea 2: stronger base stats for melees\ni know it&#039;s already the case but i feel like it&#039;s a joke\nYi for instance compared to kalista gets +30 base ms+200 hp at lvl 18+5 bonus base ad +10 mr at lvl 18 and -5 armor at lvl 18, is this enough to balance a -500 range in a game without turn rate? i don&#039;t think so\ni feel like except extreme exceptions melees do not have enough bonus stats to compet with ranged champions.\n\nidea 3: make ranged champions unable to move until they finish their basic attack, no more auto-attack cancel in mid animation. similar to kalista passive. Make them miss the attack if they lose vision.\n\nidea 4: for god sake please fixe the fact that minions are more friendly to ranged champions in this game.\nthe aggro radius of minions is just too small, ranged champions can ignore it while melee champions are punished if they try to all-in a ranged champions, it&#039;s literally unfair.\n\nidea 5: you need something to balance CC, this game needs a massive CC revamp because the way designers made champions in the last 3 years was a total &quot;we don&#039;t care about melees&quot;. 90% of league&#039;s cc are skillshots with a travel time, this is not good because melees are more punished more than ranged champions just by existing, they can&#039;t dodge skillshots in melee range while ranged champions can dodge them by staying away.\nlet&#039;s take dota2 as an example. \nIn this game most cc are point and click making it fair for everyone (melee or ranged) you can only outplay them by blinking(called disjoinct) or buying cc immunity and using the item in time (reactive mechanic) linken sphere also allows you to block one point and click spell each 13 seconds (banshee but for point and click spells)\n\ni think league needs to give a cc immunity item for melees just like BKB in dota. &quot;but then yi is op tryndamere is op&quot; **this is a pre-season lvl of work** of course things will be op but then riot has to rebalance all the band-aids they gave to melees like {{item:3044}}  that just do not work.\nan other idea is to have skillshot ccs stunning/slowing for a shorter duration in melee range like {{champion:103}} {{champion:432}} {{champion:60}} {{champion:427}} {{champion:25}} {{champion:201}} {{champion:113}} \n\nfun fact: tanks that do not bring balance problems right now are {{champion:14}} {{champion:516}}  and that because their cc can be dodged by melee champions\nSion ult cannot be dodged in melee range, **and THIS IS WHY it stuns for a short time  in melee range**\n\nfeel free to post your ideas/comment on the discussion","replies":[{"poster":"Jbels","date":"2017-09-03T12:59:23.090+0000","up_votes":5,"down_votes":8,"body":"Riot is only just now deciding that maybe they sucked mage and ADC dick for too long? Amazing.  Honestly, just remove all of the damn defensive power out of ADC itemization, or at least a lot of it. Death's dance plus another lifesteal item plus Warlords makes killing an ADC extremely annoying, not to mention GA being an AD item now.\n\nOr maybe nerf the shit out of the supports that are doubling down on ADC defensive power by giving them even more survivability to go with their item purchases, and don't even get me started on Ardent Censer","replies":[{"poster":"Ahristocats","date":"2017-09-03T14:32:12.146+0000","up_votes":17,"down_votes":1,"body":"pretty sure that nerfing adcs won't solve the problems of melees\n\nhow is it going to make melees suddenly good against cc?","replies":[{"poster":"Jbels","date":"2017-09-03T14:46:47.703+0000","up_votes":6,"down_votes":4,"body":"> [{quoted}](name=i am Rubick Sama,realm=EUW,application-id=3ErqAdtq,discussion-id=K5a8AEeR,comment-id=00060000,timestamp=2017-09-03T14:32:12.146+0000)\n>\n> pretty sure that nerfing adcs won&#x27;t solve the problems of melees\n> \n> how is it going to make melees suddenly good against cc?\n\nYou shouldn't BE good against CC. The entire point of CC is to lock up melees so that they can't burst the shit out of your squishies. If Master Yi didn't have to worry about CC like he does today, he would probably see LCS play. CC is vital in making sure these champions don't just faceroll games.","replies":[{"poster":"Mens Hair Club","date":"2017-09-03T15:05:44.842+0000","up_votes":12,"down_votes":1,"body":"CC is only there for melees?\n\nlol","replies":[]},{"poster":"WhatAGeinius","date":"2017-09-04T04:56:03.514+0000","up_votes":1,"down_votes":0,"body":"It's the other way around. Champs like Master Yi have to be retardedly strong when they aren't being chain-CC'd because the game makes them incredibly easy to chain-CC.","replies":[]}]}]},{"poster":"AirKingNeo","date":"2017-09-03T23:54:43.730+0000","up_votes":1,"down_votes":0,"body":"I think ADC's power relies too much in supports being broken as fuck, IE's reliablity as a late game item, Essence Reaver being stupid, and Shiv+RFC.","replies":[]}]},{"poster":"Mens Hair Club","date":"2017-09-03T12:20:24.158+0000","up_votes":12,"down_votes":2,"body":"base stats on melees needs to go WAY up\n\njuggs not named mord should have around 23-2400 hp at lvl 18, armor and MR should probably be raised too\nmobile bruisers should have a little less but could still probably get a bump in\nmelee carries definitely could get a bump up\n\nitems need to cater to covering up weaknesses in melee playstyles rather than just giving them raw stats like so many bruiser items do and hoping it'll work. absolute BS that fighters and bruisers have the least actives on their items. blink dagger for juggernauts, bkb or some equivalent for any melee, but at the trade-off of better stats a diff item might give. also reworking items (or more specifically, scaling) to not be just for classes; if crit in league is going to be a multiplier of like 4 different stats then we need more crit items for a larger variety of champions to dip into for scaling. hello atma's\n\npoor man's shield from dota\n\nXP sharing mechanic changed so that melees don't struggle because of XP penalty in a duo lane (what mord rework band-aided with the W passive; we should make this available to all melees)","replies":[{"poster":"Ahristocats","date":"2017-09-03T12:35:49.072+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Mens Hair Club,realm=NA,application-id=3ErqAdtq,discussion-id=K5a8AEeR,comment-id=0004,timestamp=2017-09-03T12:20:24.158+0000)\n>\n> \n> \n> juggs not named mord should have around 23-2400 hp at lvl 18, armor and MR should probably be raised too\n\nfirst, thank you for not including morde as his base stats balance his broken passive\nif his VGU removes his passive his base stats will be buffed\n\n> [{quoted}](name=Mens Hair Club,realm=NA,application-id=3ErqAdtq,discussion-id=K5a8AEeR,comment-id=0004,timestamp=2017-09-03T12:20:24.158+0000)\n>\n> mobile bruisers should have a little less but could still probably get a bump in\n\ntrue\n> [{quoted}](name=Mens Hair Club,realm=NA,application-id=3ErqAdtq,discussion-id=K5a8AEeR,comment-id=0004,timestamp=2017-09-03T12:20:24.158+0000)\n>\n> melee carries definitely could get a bump up\n> \n\ntrue again\nYi should not have 5 less armor than kalista at lvl 18\n\nHell, Yi tryndamere and all those melees that commit heavily in fight deserve to have 90-100 armor at lvl 18\n\n> [{quoted}](name=Mens Hair Club,realm=NA,application-id=3ErqAdtq,discussion-id=K5a8AEeR,comment-id=0004,timestamp=2017-09-03T12:20:24.158+0000)\n>\n> blink dagger for juggernauts, bkb or some equivalent for any melee.\n\ncan work, but will need a massive rebalance\n\nwhich is what pre-season is for\n\n\n> [{quoted}](name=Mens Hair Club,realm=NA,application-id=3ErqAdtq,discussion-id=K5a8AEeR,comment-id=0004,timestamp=2017-09-03T12:20:24.158+0000)\n>\n>  also reworking items (or more specifically, scaling) to not be just for classes; if crit in league is going to be a multiplier of like 4 different stats then we need more crit items for a larger variety of champions to dip into for scaling. hello atma&#x27;s\n\natma should not be brought back\nhowever i understood what you want, crit items for other champions than marksmen\n> [{quoted}](name=Mens Hair Club,realm=NA,application-id=3ErqAdtq,discussion-id=K5a8AEeR,comment-id=0004,timestamp=2017-09-03T12:20:24.158+0000)\n>\n> \n> poor man&#x27;s shield from dota\n> \n\nwithout the RNG part please\n\n> [{quoted}](name=Mens Hair Club,realm=NA,application-id=3ErqAdtq,discussion-id=K5a8AEeR,comment-id=0004,timestamp=2017-09-03T12:20:24.158+0000)\n>\n> XP sharing mechanic changed so that melees don&#x27;t struggle because of XP penalty in a duo lane (what mord rework band-aided with the W passive; we should make this available to all melees)\n\nif we do this then we wouldn't need a better creep aggro system i guess","replies":[{"poster":"Penns","date":"2017-09-03T13:05:35.109+0000","up_votes":5,"down_votes":0,"body":"first champs like yi and trynda should get counterplay imo tho hehe","replies":[{"poster":"Ahristocats","date":"2017-09-03T13:16:14.633+0000","up_votes":4,"down_votes":1,"body":"give it to kog twitch trist and other adcs then","replies":[{"poster":"Penns","date":"2017-09-03T13:17:51.820+0000","up_votes":4,"down_votes":0,"body":"yes","replies":[]}]}]}]}]},{"poster":"Critkeeper","date":"2017-09-03T12:39:55.853+0000","up_votes":7,"down_votes":2,"body":"Melee champions should have no bonus magic resist or health or other stats that push them above the basic stats of ranged champions, but should take X% reduced damage and have Y% tenacity versus any crowd control or damage they receive from the front, that way they can approach a team fight from the outside and begin contributing without being blown up or locked down-- but without enabling them to simply dive into the middle of 5 people and roflstomp everything.\n\nI realize this sounds stat checky, but it really isn't because it offers nothing to the melee champion if he is flanked, because his back side is still unprotected. Versus slower travel time or more telegraphed effects, he may be able to micro his facing to diminish as much damage and cc as possible, but I regard that the same way I regard stutter stepping by ranged champions-- its just an expression of skill and is a completely fair way to raise the skillcap on melee champions.\n\nIt also offers a form of counterplay versus melee champions that is on the same level in terms of depth and expression as the prevalent counterplay versus ranged champions. With a ranged champion the counterplay is to close the distance or work with your allies to coax the enemy ranged champion into a vulnerable position. With melee champions the counterplay would be to flank or to work with your allies to coax the melee champion into a vulnerable position.\n\nBecause this sort of change offers both depth and fairness, I think it is strictly better for the game than a change that only offers fairness but reduces depth. For instance, I don't think giving all melee champions a straight stat boost would be appropriate (and the stat boost they currently receive probably isn't appropriate) because it reduces the game to a single checkbox-- \"can the melee champion close the distance and kill the ranged champion before dying?\". The change I suggest is better because it offers ways for the melee champion to have an influence without being propped up by stats or reducing the game to a single checkbox-- positioning is more nuanced than \"did i have enough stats?\".","replies":[{"poster":"Mens Hair Club","date":"2017-09-03T13:29:01.424+0000","up_votes":5,"down_votes":1,"body":"yeah, because what I need as a guy who plays minigame champions is to have even more minigames to play","replies":[]}]},{"poster":"La Bello","date":"2017-09-03T11:42:41.761+0000","up_votes":6,"down_votes":2,"body":"I think riot should make single targeted skills draw minion aggro so matchups into champions like {{champion:1}} {{champion:80}} {{champion:41}} {{champion:8}}  are less oppressive for melees.\n\n\n","replies":[{"poster":"Sahn Uzal","date":"2017-09-03T20:04:38.900+0000","up_votes":2,"down_votes":0,"body":"Parrrley already draws minion aggro.","replies":[]}]},{"poster":"Sdars","date":"2017-09-04T00:50:15.255+0000","up_votes":3,"down_votes":0,"body":"There's only one good way to do it but riot refuses to accept it:\n\nLower damage across the board.\nIt's that simple.\n\nMany people complain saying CC is the problem, but I think CC is probably fine as long as riot introduces better and more diverse ways of itemizing tenacity.\n\nCC only looks like the problem because damage is so high. If you're a squichy, most often 1 CC means you're dead, in a teamfight.\nIf you're a bruiser or tank, you often can't even reach the enemy adc, not because CC locks you down forever, but because damage is so high it looks like forever, as you'll probably be dead after the chain CC.\n\nNot only does it make balancing easier, it makes it so the balanced state doesn't have to be broken. Strengths and weaknesses are a good thing but there are limits.","replies":[]},{"poster":"Asayake 5150glow","date":"2017-09-03T23:53:38.140+0000","up_votes":3,"down_votes":0,"body":"I hate number 2, carries like YI are still insane when they get ahead due to their evasive tools like Alpha Strike, and keep in mind that the same assassins who are targeting ADC's will still need to be able to oneshot the Yi's and Yasuo's, and if melee's are tankier then most likely they'll be almost no counterplay for ranged due to not needing their full kit in order to kill them (aka, Zed won't need to use his Q, his only skillshot).","replies":[]},{"poster":"Hellioning","date":"2017-09-03T17:56:42.886+0000","up_votes":2,"down_votes":1,"body":"Why would Shiv be better on melee than ranged when only one or two melee champs use it while most ranged ad champs use it...?\n\nAnd why would Death's Dance or Sterak's be better on melee? Neither of those have anything to do with basic attacks, beyond the fact that they give AD.","replies":[{"poster":"Ahristocats","date":"2017-09-03T18:06:06.916+0000","up_votes":3,"down_votes":0,"body":"death dance is a common build on melee champions\nhowever even while it's strong right now melee champions are still unable to teamfight\n\nbut if you buff it for everyone it will break ranged champions even more\nsame logic with shiv except it's the opposite\n\nshiv is too strong right now on adcs, while it's fine with yi/gp/yas/tryndamere","replies":[{"poster":"Hellioning","date":"2017-09-03T18:23:54.537+0000","up_votes":3,"down_votes":2,"body":"Okay, it seems like Death's Dance is balanced. Shiv, I could understand lowering the proc damage on ranged attacks. But we shouldn't change an item that has nothing to do with autoattacks to be ranged/melee split. That'd be confusing and doesn't solve anything.","replies":[]}]},{"poster":"LordGeovanni","date":"2017-09-03T21:26:51.297+0000","up_votes":2,"down_votes":1,"body":"2 melees currently use it because defenses got nerfed several hundred times because mages and adcs had a problem taking time to kill 6 defensive item tanks so melee carries outside of assassins and morde cant survive with less than 5 defensive item for any reasonable amount of time. there for crowding out melee carry builds. The raise in the amount of crit chance did the same thing where adcs can crit you 4 times before you reach near them you cant afford to be building crit yourself when you die before you get to do any damage.","replies":[]}]},{"poster":"ChaosThief","date":"2017-09-04T17:24:08.104+0000","up_votes":2,"down_votes":0,"body":"Part of the reason it's so difficult for melee champions is because a lot of ranged champions have just so much disengage that it becomes impossibly annoying to stick to them.\n\nTrying to go in on {{champion:150}} ? Mini form he hops away, and as soon as his W's passive procs you really can't do much.\n\nWhat about {{champion:133}} ? Her E makes it quite annoying to get on her without a second gapcloser.\n\n{{champion:126}} (though he's technically also melee)? In melee form he knocks you away, then swaps to ranged form and kites.\n\nAnd that's only three top laners. Marksmen often have similar if not more tools to disengage (exceptions include kog'maw and twitch). Mages also have tools to disengage, although not nearly as powerful as the marksmen class.\n\nI think the easiest first step would be to lock them in place until they fire the auto attack. Cancelling an auto essentially means you cannot chase them unless they stand there and auto attack. In other words, you can't just right click an enemy then immediately move 1/5 of a second later. You have to wait until your next auto is ready. That might be a little harsh, but items won't really solve the problem alone, unless those items are hilariously broken and if they are, they become mandatory.","replies":[]},{"poster":"OyddAWqJ5r","date":"2017-09-04T07:49:42.939+0000","up_votes":2,"down_votes":0,"body":"I think {{item:3153}} is fine as is for ranged. Buffing it for melee is a good idea though imo. I don't see any melees building it now despite it definitely offering great engage power for certain fighters.\n\n{{item:3124}} definitely needs to stack faster for melee champs. The rest of the items mentioned don't need melee favoritism imo. They already do enough to favor the intended users. And noone wants statikk buffed for melee cuz Yasuo.\n\nidea 2 is gonna happen. In the next season base stats are being altered since runes don't exist anymore as well as the rune trees themselves will offer bonuses for simply taking them. Expect to see Resolve tree users being naturally more tanky.\n\nidea 3 i don't agree. I think the charm of league is how fluid everything is and basic attack cancelling is a huge factor in that.\n\nidea 4 I personally never see this issue as an almost strictly melee only player. Usually the minions are the deterrence I need against ranged champ's harass and never fail to win trades for me when a ranged champ goes for a cheeky auto.","replies":[]},{"poster":"RankOneUganda","date":"2017-09-04T07:20:47.984+0000","up_votes":2,"down_votes":0,"body":"its hard to come up with 1 thing. but a bunch of items and masteries need to be procced faster for melees.\n\nalso give melees more tenacity. and nerf ad carries.","replies":[]},{"poster":"StairCasexd","date":"2017-09-03T21:00:45.464+0000","up_votes":3,"down_votes":1,"body":"Everything is fine except 3,  missing AAs like that is probably just going to piss people off instead of being a counter at tool,  I've already seen people miss point and click spells because ivern used his bush.  Removing AA cancels feels like it would make adcs an actual brain dead role (like how some people meme about atm). I wouldn't even touch ashe if AA cancels get removed. Doesn't this also mean  you'd get punished for even thinking about trying to kite in any way? Feels like that unless you have nearly capped atk speed. I don't get how this good idea unless you're playing adc and a bruiser walks up to you whilst there's nothing you can do because you'll get punished for attacking.  This is comparable to Lux throwing out her sheild while running away,  she has that pause which could end up killing her instead of increasing her chances to live.","replies":[{"poster":"Ahristocats","date":"2017-09-03T21:22:33.658+0000","up_votes":2,"down_votes":0,"body":"you're right, it was an idea but it's bad\nthis thread was made to find the best ideas thank you for making it clear why it's bad","replies":[]}]},{"poster":"Spoofghoul","date":"2017-09-03T17:51:42.986+0000","up_votes":2,"down_votes":0,"body":"First lets make lifesteal not interact with crit\n\nCrit is a ranged luxury as melee don't have the luxury of being safe by default until someone reaches you so they often do not get to invest in uber lifesteal like that or they are dead before reaching their enemy\nSo level the playing field there\n\nThis will help a lot, this way we don't need to gut support items as much either we need people wanting to play that role nobody wants to be just the ward slave after all\n\nOn the topic of supports\n\nTheir item effects can be different for melee\nlet's take {{item:3504}} for example while atksp is nice for melee but movement would be better\n\n\n{{item:3050}} Again seems to favor ranged as they have an easier time just ramming empored auto's in the opponents face on top of the synergy with crit as if crits aren't strong enough already\n\nMaking the bonus damage scale with only the AD part would level the playing field and perhaps some synergy for mages would be nice, like throwing a spell on the support to detonate the area with damage or a knock back or something \n\nHowever melee could also gain their own aura rather then empowered attacks so they can better stick after landing their attacks\nA lower duration extended by additional attacks up to the full duration\n\nI mean these are just example idea's\n\nBut melee and mage can use support too, support items don't have to give the same buff to all champions and then weaker for ranged, they could give totally different effects depending on who you use it on\n\nAnd not everything has to hyper synergize with crit, as if 1k+ ranged attacks with 0 costs are weak . .","replies":[]},{"poster":"Sire Hippington","date":"2017-09-03T17:40:56.665+0000","up_votes":2,"down_votes":0,"body":"Certainly agree on 1, 2 and 4.\n3 would help balanceing, but at the cost of makeing ranged champs feeling horribly clunkly with a bad game-flow. I'd rather see bigger base ms differences instead.\n\n5 I agree that CC is an issue, but i don't think the dota way is appropiate for League. What imo needs to be done:\n\n - changeing slows to flat values with some exeptions like nunu E or nasus W so they no longer hit high ms champs harder than low ms champs.\n - Let tenacitiy affect knowckups and displace, give a short stacking up tenactiy buff whenever you get hard-cced to counter cc-chaining(maybe melee only or higher values for melees)\n -  more tenacity/slowresist options in items or intergrate more of that and/or other anti CC mechanics in the kit of champs that really need it(mostly immobile fighters) \n - More CC that gets the duration increased with traveldistance\n - less uptime on slows in general\n\nAditionally, i think supports and support itemisation need to be looked at aswell. As it is, we have few supports that really can support melee's properly, espcially the deep-diveing ones as the simply can't follow them into the fight and stay in range.\nAs example: a Yi with morgana's black-shield sounds powerfull, but if you try to execute it, you soon notice that her lack of mobillity and the low range on black shield make it really hard to use it effectively on YI in teamfights.","replies":[{"poster":"Ahristocats","date":"2017-09-03T17:48:28.509+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sire Hippington,realm=EUW,application-id=3ErqAdtq,discussion-id=K5a8AEeR,comment-id=000a,timestamp=2017-09-03T17:40:56.665+0000)\n>\n>\n> 3 would help balanceing, but at the cost of makeing ranged champs feeling horribly clunkly with a bad game-flow. I&#x27;d rather see bigger base ms differences instead.\n\nthanks for feedback\n\n\n> [{quoted}](name=Sire Hippington,realm=EUW,application-id=3ErqAdtq,discussion-id=K5a8AEeR,comment-id=000a,timestamp=2017-09-03T17:40:56.665+0000)\n>\n> \n>\n> As example: a Yi with morgana&#x27;s black-shield sounds powerfull, but if you try to execute it, you soon notice that her lack of mobillity and the low range on black shield make it really hard to use it effectively on YI in teamfights.\n\nso how do you fixe it?","replies":[{"poster":"Sire Hippington","date":"2017-09-03T18:17:09.917+0000","up_votes":1,"down_votes":0,"body":"Either increased range on ally-targeting spells vs melees(maybe bound to an item, think knights vow but helping ranged supports to support an melee ally by increaseing their range when buffing the bound **melee **and  getting aditional ms towards it)\n\nOr delayed utillity. Like planting the 'seed' of a shield/buff which lasts for some solid time, and once the target gets damage(or meets another condition), the actual shield/buff activates. Though one needs to tinker with the CD, if it starts on planting the 'seed' we might get edgecases of double-shielding.\nThat would allow to prep a melee befor the fight while he still gets the full duration utillity once he needs it.","replies":[]}]}]},{"poster":"AirKingNeo","date":"2017-09-04T02:34:49.881+0000","up_votes":3,"down_votes":1,"body":"I disagree with 3 since that makes things less smooth feeling, though slight turn-speed (super small) might not be a bad thing.\n\nIf you want to fix bruisers, you need to first nerf everything putting it down. ADC damage needs to drop (this also makes their lifestealing drop), supports need a huge fucking nerf and Riot should publicly apologize for sucking the class off too long, tanks should get longer cooldowns (and some items lose CDR). This solves being perma CCed and insta-DPSed down.\n\nSimple changelist coming at you:\n\nMarksmen - I like Cleaver on ADCs. I think diversity is cool, but, if you build Cleaver, your late game should be weaker for having less Crit chance.\nCritically Reworked: Critical Chance renamed to Critical Strength. Critical Strength increases your damage dealt by basic attacks (except onhit effects) by X percent. X is your critical strength. Not only does this give reliably to Gangplank, it also makes Tryndamere more consistent and not luck based.\nCritically Addressed Interactions: The bonus damage applied by Critical Strength is what is counted as your Critical Damage. Omen and IE decrease/increase only this damage multiplictively, rather than the whole attack. (This might be a nerf to Omen or something (Just realized while typing RFC/Shiv that this technically buffs Yasuo, sorry. Just increase his self Crit reduction.), but future adjustments can be made. _It's the idea that matters, not the numbers._)\nOmen: Reduces only Critical Damage, instead of the whole attack. (May need changing.)\nInfinity Edge: Increases only Critical damage, instead of the whole attack. Eg: Someone with IE + Zeal (40% Critical Strength) will actually deal damage as if they had 60% Critical Strength.\nRapid Firecannon: Passive now disables the passive of Stattik Shiv. (Whoever is in the highest item slot takes priority.)\nStattik Shiv: Passive now disables the passive of Rapid Firecannon. (Whoever is in the highest item slot takes priority.)\nDeath's Dance: Damage converted into a DoT reduced to 20%. -5 AD.\nThe Bloodthirster: -5 AD.\nEssence Reaver: Mixed identity calls for a rework. Now costs 3000 gold, builds from Pickaxe + Caulfield's + Cloak of Agility, and gives 60 AD, 20% Critical Strength, and 20% CDR. Now it's an early game item that scales slightly, instead of broken on ADCs once they hit a two item spike if they have strong/broken abilities (Xayah is our huge offender).\nB. F. Sword: Since ER was changed, BF is changed to replace powerspikes botlane (making it more forgiving) to near equalize with Pickaxe + Longsword. Cost reduced to 1150 and loses 5 AD.\nBerserker Grieves: Look, as a Kayle main (Kayle rushes these boots often), I hate to do this, but -5% attack speed.\nLord Dominik's Regards: The damage boost is super broken. Damage increase lowered to 15%, health difference required for full boost increased by 1.5x (This is just so late game Cho'Gath and uber-tanks take damage without doing absurd damage to bruisers).\nPhantom Dancer: Just because you've been broken for 2 years doesn't mean you get off the hook. Damage reduction lowered to 8%, Attack speed lowered by 5%.\n\nTanks - Fuck off. Least skill class that Riot consistently pushes for no fucking reason; hypocrisy I say! Anyways, tanks being broken require ADCs to be broken and vice versa. Both need to be cut down so bruisers can exist. _At first you needed a mage, marksmen, and a bruiser to have enough damage, now all you need is a mage and marksmen and tanks have gotten tankier._\nMaokai: Q down 10/15/20/25/30 base damage. Q and W cooldown's up; R snare reduced.\nSejuanni: I don't know, just nerf the CC and cooldowns.\nZac: Revert to preupdate. Fucking cancer CC, but surely reducing his damage solves that issue (Kappa).\nStoneplate: Fuck this item. Anyone who's played since season 4 minimum can look at this and say \"Wow, those stats look really broken.\" Active (Greater) HP boost reduced to 80% from 100%; Bonus Armor/MR gained while 3 enemies are near reduced by 10; Cost increased by 150.\nCinderhulk: Revert every change made that made into \"viable\", then reduce cost by 75 gold. Build path changes based on next change.\nSunfire Cape: DoT damage increased vs champions (but same for Waveclear). Build path changes based on next change.\nBami's Cinder: Builds from 2 Ruby Crystal, new cost of 1100 gold, and gives 350 HP now.\nSunfire, Omen, and Deadmans: Considering ADCs are losing more than substantial amounts damage, -3 armor for each of these (Deadmans will get buffs later).\nAdaptive Helm: Here is my idea. Damage reduction vs repeated spells reduced to 12%, HP increased by 50. Loses 10% CDR. What about Cassiopeia? Nerfed. No need to have every DPS mage broken to be viable because Adaptive Helm is broken.\n\nSupports - Stop calling this class weak. Support is probably more important than mid lane right now. Shield stacking wasn't such a huge issue until they gave free +% Heal/Shield Power.\nAncient Coin: Gold generate reduced. (Increasing every support item up to it just powercreeps the support role making them more broken).\nArdent Censer: Attack speed bonus reduced 15%. Heal/Shield Power reduced to 8%.\nRedemption: Heal/Shield Power reduced to 8%.\nMikeal's Crucible: Heal/Shield Power reduced to 16%.\nForbidden Idol: Heal/Shield Power reduced to 6%.\nLocket: Health ratio reduced to 15% bonus HP from 2%-bullshit%. Secondary Locket Shields reduced from 50% power to 25%.\nKnight's Vow: Damage reduction and heal based on ally damage reduced to 8%.\nBraum: Passive increased to 5 stacks to stun, or nerf the time it stuns if they REALLY want to keep the icon for it.\nRakan: Ok, fuck you for being super broken right now. W knockup reduced to 0.75 seconds (from 1 second). R charm duration reduced to 1 second (from 1/1.25/1.5). If he's weak, give his W +10 damage and maybe his Q +5 heal or damage. (Nerfed because tenacity doesn't affect his CC)\nLulu: Shield increased by 10/15/20/25/30. Polymorph reduced from bullshit-bullshit to 1.1/1.2/1.3/1.4/1.5.\nJanna: Not sure, just nerfed slightly (since Coin, Ardent, and ADC nerfs already hurt her, she doesn't need it as hard HOPEFULLY).\n\nBruisers - The class shit on for so many years, it makes me sick. Items always stolen, Class update slot stolen, class update 2012, 2013, 2014, 2017 all canceled. This time, we make them viable.\nJaurim's Fist: No longer stacks, now gives all it's stats on buy.\nFrozen Mallet: Melee only. (Fuck you Kog'Maw) Maybe other changes but I lack ideas.\nSterak's Gage: Buildpath changed to Jaurim's Fist + Ruby Crystal, HP increased by 100, shield threshold lowered significantly on later ranks.\nMaw of Malmortius: This was stolen by assassins a bit and is a common buy on ADCs who go mid. Doubled shield for melee would break the item on assassins, so a different change is required. It doesn't stack with Sterak's Gage, so it will need it's own niche too. Shield now scales with 15% bonus health.\nGuinsoo's Rageblade: \"Why can't Rageblade be buffed for melee champions?\" a certain Jax main asked. The Rioter supposedly responded, \"Because Kog'Maw still uses it.\" Attack speed per stack reduced from 8% to 5%, total stacks increased to 8, melee champions gain 2 stacks per attack, +5% attack speed to basic stats, cost reduced by 200, and Guinsoo's Rage reworked. _Guinsoo's Rage - At max stacks, grants ~~Phantom Hit~~ +5 (+15% bonus AD)(+7.5% bonus AP) onhit magic damage to your target and nearby enemy units._ This should sound familial, but Phantom hit is near unbalancable due to certain interactions in some kits being too unhealthy. (Btw, this old passive means it works with Gunblade again.)\nBoRK: Should technically be under Marksmen, but let's just fix this. +3% lifesteal, onhit damage reduced to 6.5% for ranged champions (Fuck you Kog'Maw), cost reduced by 100.\nNinja Tabi: Technically should be under Tank changes. Since marksmen are losing so much damage, this item, which is powerful, it getting a bit of change. Basic attack damage reduction reduced to 8% (Critical damage isn't affected by this damage reduction btw), but now gains 5% Critical Damage Reduction. (This is a wild change. It could be completely overestimating how much the change to marksmen will be.)\nMerc Treds: Tenacity increased to 35%. If CC locking is still kinda an issue, then make Tenacity affect knockups/knockbacks.\nTrinity Force: This item costs so fucking much I think it's absurd. -200 Cost.\n\nNew Items: I'll just copy what I had in another comment.\nCrimson Fury\n{{item:3044}} + {{item:3101}} + 650 Gold (3000 Total Cost)\n300 Health, 30 Attack Damage, 40% Attack Speed\nUnique Passive: +10% Cooldown Reduction\nUnique Passive - Rage: Basic attacks (on-hit) grant +20 flat movement speed for 2 seconds. Killing a Unit grants +60 flat movement speed instead. (Halved for ranged champions.)\nUnique Passive: After hitting enemy champions with 3 abilities, gain a burst of 20% movement speed and 30% attack speed for 4 seconds (40 second cooldown). (Halved for ranged champions.)\n\n{{item:3091}} Wit's End (REWORKED) (Melee Only)\n{{item:1057}} + {{item:1043}} + {{item:1036}} + 730 Gold (2800 Total Cost)\n15 AD, 40 Magic Resist, 30% Attack Speed\nUnique Passive: 15% Bonus Armor Pen\nUnique Passive: Basic attacks (on-hit) reduce the target's armor by 3% and grant magic resistance equal to the armor shredded. (Max 5 Stacks.) (NOTE: This passive will share a name with Black Cleaver's passive so they don't stack.)\n\nMy only issue is both (New) Wit's End and Cleaver on the same team being really fucking broken, even though 24% + 15% multiplicative might be a lot.","replies":[]},{"poster":"Snake Prince","date":"2017-09-03T22:41:04.309+0000","up_votes":2,"down_votes":1,"body":"Yi has a gap closer , a move speed boost and slow immune , a heal that give him high resistance during it He is also a glass canon champion thats why he has not the best base stats of the game  .\nThe only melees that use {{item:3087}} are {{champion:157}} {{champion:23}} it is not a melee item by design . {{item:3124}}  is core on {{champion:10}} {{champion:96}} and rarely used by {{champion:24}} , lets not nerf an item to buff the users just after . Even tho i agree with u on {{item:3153}} \nFor the Idea 3 , its just make the game clunky and its a loss of quality life , it is a nerf to ranged while melee need a buff . Just give melees a direct buff . Same for Idea 5 it reduces the skill floor and skill cap of the game and takes away plays potential for the **majority** of the players to make it fair for one specific class of champs .","replies":[{"poster":"Ahristocats","date":"2017-09-04T15:01:50.824+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Snake Prince,realm=EUW,application-id=3ErqAdtq,discussion-id=K5a8AEeR,comment-id=0011,timestamp=2017-09-03T22:41:04.309+0000)\n>\n> Yi has a gap closer , a move speed boost and slow immune , a heal that give him high resistance during it He is also a glass canon champion thats why he has not the best base stats of the game\n\ni don't need you to liste me the kit of a champion, i can do the same with a ranged champion and tel lyou \"oh why this champion has 550 range? they have this and this and this\"","replies":[{"poster":"Snake Prince","date":"2017-09-04T15:26:31.698+0000","up_votes":1,"down_votes":0,"body":"Some champions kit do certain things thats why they can't have the best base stats . Mordekaiser has the best ad in the game , Trynd the biggest hp pool   ect ..","replies":[]}]}]},{"poster":"Mordepool","date":"2017-09-03T16:02:46.784+0000","up_votes":2,"down_votes":1,"body":"Rune idea possibly major\n\nSecond wind.\n Upon being hard cc'd gain a mark called second wind if hit with another cc within 3 seconds Second wind triggers  cleansing all CC and giving a shield for  3 second","replies":[]},{"poster":"Kaptzidianos","date":"2017-11-07T18:58:47.126+0000","up_votes":1,"down_votes":0,"body":"Make a  panda 🐼 Volibear skin plz!! 🐼 🐼 🐼 🐼","replies":[]},{"poster":"ZT Xperimentor","date":"2017-09-09T16:06:28.842+0000","up_votes":1,"down_votes":0,"body":"Number three is an interesting idea, it'd separate the fans from the mains anyway since skill would be required to kite. Number four is enough by itself why ranged top laners are so oppressive, not to mention pathfinding and minion block have been issues for years.","replies":[]},{"poster":"Iota Theta","date":"2017-09-04T13:57:25.907+0000","up_votes":1,"down_votes":0,"body":"Point and click hard CC can become even more oppressive for melees in this game though, since most of those abilities have shorter range and it'll still be easier to CC those melees than the ranged champs. For example, Maokai's Twisted Advance has a range of 525, shorter than almost every ranged champ, or at least every marksman.\n\nDuration scaling with distance could work, but the inherent problem with that is tanks want to be in melee range, since they're all melee as well. At that point a tank or support tank wouldn't be able to peel properly unless the melee duration was what it is now and the ranged duration even higher.\n\nAs far as CC immunity..no. I don't want that on more champs. Little sucks more when playing as Malphite or a tank with little hard CC and watching as a Yi just ignores you and runs past with nothing you can do about it outside of throw your ult and hope he doesn't Q, although at least he only ignores slows. Olaf is the other example, where he charges at you, ignoring all possible CC, and starts Qing and autoing a carry, and you can't peel for them. It feels absolutely terrible, and to have every melee champ able to do that sounds unfun. It'll be terrible for melees because that item will be a must buy, and it'll feel terrible to tanks and peelers because there is nothing you can do to them during that time. It'll create a similar pattern to GW with healing, or Qss/Zhonya's with Zed's ult (either you had it and he could do nothing, or you didn't and died).\n\nPersonally, I'd rather they either revamp tenacity and introduce more melee items with it, allow it to affect displacements (or reduce the actual number of displacements), or introduce more skill expression like Garen's W and Q timings (I prefer this more since it'd be an active window of strength rather than always on). Those are also more balancable options as opposed to straight immunity (in the time being, QSS might help, although I wish it had more build options than for ADCs with Mercurial), because they can have their numbers tweaked, while the only things with immunity that can be tweaked are duration and CD.","replies":[]},{"poster":"Jackom1","date":"2017-09-04T08:37:41.215+0000","up_votes":1,"down_votes":0,"body":"A melee only item that would greatly increases resistances when you're stuck by hard cc, with a relatively low CD? \n\nA problem that many melee carries have is that they die as soon as they're CC-locked. Ranged champions don't have it so bad. \n\nAs for juggernauts, they're supposed to be kitable and can't really engage on their own. But they could use a starting item that reduced damage suffered by champions and minions. Doran shield right now is more useful for its regen that for the passive, instead it could be the other way around. Nerf the healing factor and increase the mitigation. It might encourage some degree of interaction even against ranged champions, who are still supposed to counter juggernauts (but maybe they won't just shit on them this way)","replies":[]},{"poster":"Kaìju","date":"2017-09-04T07:23:46.094+0000","up_votes":1,"down_votes":0,"body":"Maybe it's because I hate myself but I actually really want to see melee carries bot lane and ADC be optional/playable elsewhere. Like sure I'll still pretty much only play Ashe and Kog, but it would be so refreshing to know that bot lane is finally changing some.","replies":[]},{"poster":"Lauchmelder","date":"2017-09-04T07:04:17.062+0000","up_votes":1,"down_votes":0,"body":"Deaths Dance should be entirely removed from Marksmen (as in made unattractive to buy).\n\nEspecially as a mage or an AD caster I don't exactly expect to kill a bruiser or tank with one rotation. When an ADC builds DD you can kiss your presence and pressure goodbye for good.","replies":[]},{"poster":"PaffWasTaken","date":"2017-09-04T07:00:15.112+0000","up_votes":1,"down_votes":0,"body":"I want a full bruiser rework along with an itemization change similar on how they reworked ADCs, Nothing more, Nothing less. It would actually give Something good to them","replies":[]},{"poster":"DariusDemiurge","date":"2017-09-04T06:27:39.492+0000","up_votes":1,"down_votes":0,"body":"I was with you for most of it, the you went and posted some asinine stuff with Morgana's icon and reducing cc based on range. No thank you.","replies":[]},{"poster":"PiVoRx","date":"2017-09-04T06:22:23.969+0000","up_votes":1,"down_votes":0,"body":"While using Yi as example, each time i use him, i feel like im doing not enough damage, i either wont get reset before ult ends or i die too fast to actually do anything. I think ranged champions (including mages) should feel when meele chops them.\n\nFor example, how does even a meele champion can kill Ahri? And even if you somehow manage to aa her, she doesent care.","replies":[]},{"poster":"The Yetii Rider","date":"2017-09-04T04:35:29.362+0000","up_votes":1,"down_votes":0,"body":"One huge problem for top laners is the fact that abilities do not draw minion aggro, only auto attacks. Champions like Gnar, Kennen, Teemo, Ryze and Quinn can harass safely from a distance with their Qs while standing in a crowd of minions so the melee aggressor can't fight back. There's simply no reason for this. If minions are supposed to be part of the trading process and positioning, an ally taking damage from an enemy champion for any reason should be enough to get them in the fight. \n\nAn easy suggestion, and one that has been made before, is to make AD, Armor, and Health items give % of a champion's base, rather than simply giving a flat amount. This will make the items as a whole weaker when you first buy them, but will definitely make them a lot easier to balance on a melee/ranged basis. The headache is when champions like Jayce buy health items, then they switch forms. But that's Riot's fault for making form changing champions in the first place, so it's up to them to figure out a fair way of making it work. \n\nAP obviously can't scale because you don't have any, and I think AP itemization is perfectly fine the way it is so leave it be. MR doesn't really work either since every champion has the same MR based on melee or ranged, so just leave MR itemization the way it is along with AP and things will be fine.\n\nWe also need a strictly anti-kiting item. I think they should bring back the old version of Cold Steel that lowered a target's movement speed whenever they attacked the target. Honestly, marksmen have been given so much mobility and sustain to deal with assassins that being able to kite divers successfully is a big problem.","replies":[]},{"poster":"Okamikazi","date":"2017-09-04T04:23:08.630+0000","up_votes":1,"down_votes":0,"body":"One issue to look at would be Turret Advantage. Ranged have better harass and defense at towers. The distance melees have to run to safety is longer, which is why mid lane is more dominated by the ranged. Also ranged only has to be around the edge of allied turret range to be safe whereas melee needs to be on the other side of their turret. Minions don't go past the turrets meaning that melees are more easily harassed when last hitting, whereas ranged can last hit from the other side of their turret.\n\nI would suggest to buff the mastery \"Siege-master\". Currently it only gives flat 8 armor and magic resist at an allied tower. For melees only the armor and magic resist should scale and work at any tower.\n\nBecause of Runes Reforged this suggestion probably doesn't matter but if the mastery gets carried over into the new system that's  what I would suggest.","replies":[]},{"poster":"DragonShea","date":"2017-09-03T23:51:37.956+0000","up_votes":1,"down_votes":0,"body":"Juggs really should have baseline Tenacity. Allowing them to shrug off CC better than most champs, it shouldn't really be that punishing to be locked down when you don't have the mobility to dodge it, just like they don't have the mobility to avoid damage. with the amount of CC in the game right now, it should break even as wasting your CC on a jugg that is gonna survive it if he is fed or has allied intervention is gonna be a lot more punishing than a frail target who is more likely to die or be forced to back due to low HP.","replies":[]},{"poster":"LordGeovanni","date":"2017-09-03T21:15:04.164+0000","up_votes":1,"down_votes":0,"body":"You believe that they gonna increase health nerf damage and then nerf health like they always do.","replies":[]},{"poster":"Salson","date":"2017-09-03T20:37:45.672+0000","up_votes":1,"down_votes":0,"body":"1. Agreed, everyone knows it at this point.\n\n2. I remember making a post about this, basically what is the value of range in pure stats, and how did this value change thoughout the years.\nIt may have been balanced once upon a time, then item changes and masteries broke it.\n\n3. Agree only on first part, missing feels clunky.\n\n4. Honestly, I would fix this with second point, by adjusting the base stats so melle simply take less damage. Also creep block is way worse than actual damage here.\n\n5. Well then, answer me this, do you want to make mechanics a non-factor of player skill. Like, oh look a Riven and a Garen have the same game knowledge and map awereness, they deserve the same rank, regardless of mechanical skill.\n\nWe already have an answer to CC skillshots, and I will be cursed with voodo magic for saying this.\n**Yasuo and Fiora are healthy champions who counter the overloaded CC with skill, not just their mere presense.**\nWe need more stuff like them, or Orn's W which powers through CC, Morganas shield which negates it for allies, Gangplank's W which clenses it, Sivir/Nocturne spellshields.\n\nJuggernauts in particular should have ways to break CC.\nShit like Darius getting CC imunity for 2 seconds upon executes, Illaoi ignoring CC on W jump, Nasus getting tenacity instead of obscene damage on his ult.","replies":[]}]}