{"poster":"AxGod","date":"2016-11-09T19:39:03.886+0000","title":"Fuera Reclutamiento, aquie tienen solo Blind Pick","subforum":"Charlas Generales","up_votes":2,"down_votes":10,"body":"Por lo que veo a todos nos molesta bastante que hayan decidido por todos este cambio innecesario\r\npero hay que adaptarse a los cambios y jugar, si no no jugar, no hay muchas vueltas, a lo que voy es que \r\ndebemos reeducarnos, cambiar la forma de &quot;Cantar las lineas y el primero que dice ADC gana&quot; eso es algo confundible y en ventajero con los demas user, a lo que voy es que tendriamos que ponernos todos de acuerdo y elegir segun la posicion de la seleccion de campeones, como se hacia antes en Ranked\r\n\r\n\r\npor ejemplo\r\n\r\n{{champion:266}}     Invocador 1 tiene prioridad y elige TOP\r\n{{champion:84}}       Invocador 2 le sigue y elige  MID\r\n{{champion:64}}       Invocador 3 sigue y elige JG\r\n{{champion:222}}     Invocador 4 sigue y elige ADC\r\n{{champion:53}}       Invocador 5 ultimo y lo que queda es SUP\r\n\r\n\r\n**Deberiamos hacer llegar esto a todos**, la &quot;gracia&quot; del blind pick es jugar algo distinto a lo que uno mainea o si tiene la suerte jugar con tu main, por algo es blind pick,\r\nsi mal no recuerdo anteriormente las Ranked eran asi, la gente tendria que ponerse de acuerdo y empezar a tomar ese ejemplo y se van a reeducar nuevamente, si alguien no esta de acuerdo, es report y que Riot los &quot;Castigue&quot;{{summoner:11}}","replies":[{"poster":"Dora07","date":"2016-11-09T22:59:55.069+0000","up_votes":1,"down_votes":0,"body":"Creo que las rankeds jamás fueron así.","replies":[{"poster":"Ufaaaaaaaaaa","date":"2016-11-09T23:07:25.640+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dora07,realm=LAS,application-id=v7qsfXsE,discussion-id=ZxAwFl0u,comment-id=0001,timestamp=2016-11-09T22:59:55.069+0000)\n>\n> Creo que las rankeds jamás fueron así.\n\neran algo así, de hecho se \"cantaban\" las lineas como en draft pick. Estaba la vieja discusión \"pick order vs. call order\" donde se discutía si la prioridad la tenía el que cantaba primero o el que pickeaba primero.","replies":[{"poster":"Dora07","date":"2016-11-09T23:43:31.110+0000","up_votes":2,"down_votes":0,"body":"Tiempos oscuros y lejanos, es mejor no recordarlos...","replies":[]}]}]},{"poster":"Zevko","date":"2016-11-09T20:57:31.579+0000","up_votes":1,"down_votes":0,"body":"No.","replies":[]}]}