{"poster":"Rihan Kun","date":"2017-04-11T06:01:50.192+0000","title":"Pido otra oportunidad","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":13,"body":"Me podrian desbanear mi cuenta? Por favor. Pido disculpas por lo que hice mal no estaba informado. No sabia que era ilegal el uso de Script o terceros ya que un amigo me los recomendo y me dijo que eran totalmente legal al igual que el Mklol. Juro que no sabia y me arrepiento ya que en mi cuenta gaste dinero en skin y cajitas y me duele haber perdido todo eso ya que me costo mucho conseguir el dinero para gastarlo en LoL prometo no volver a hacer nada malo en mi cuenta ni siquiera soy de los que trollean o insultan a la gente. Espero entiendan Gracias","replies":[{"poster":"Lucio22","date":"2017-04-11T06:15:38.306+0000","up_votes":7,"down_votes":2,"body":"\"Me podrian dejar libre? Por favor. Pido disculpas por lo que hice mal no estaba informado. No sabia que era ilegal el matar a alguien ya que un amigo me lo recomendo y me dijo que eran totalmente legal al igual que el secuestrar. Juro que no sabia y me arrepiento ya que en mi vida gaste dinero en ropa y muebles y me duele haber perdido todo eso ya que me costo mucho conseguir el dinero para gastarlo prometo no volver a hacer nada malo en mi vida ni siquiera soy de los que pelean o insultan a la gente. Espero entiendan Gracias\"\n\n...\nsep, con este tipo de cosas, te das cuenta que tan ridicula es la peticion cuando lo pasas al ambito legal...","replies":[{"poster":"ChayanneenunaC90","date":"2017-04-11T06:30:02.668+0000","up_votes":1,"down_votes":0,"body":"Tenés toda la razón","replies":[]},{"poster":"Rosv Stuff","date":"2017-04-11T06:28:34.119+0000","up_votes":1,"down_votes":0,"body":"+1","replies":[]}]},{"poster":"Rosv Stuff","date":"2017-04-11T06:27:07.576+0000","up_votes":2,"down_votes":0,"body":"\"No sabia que era ilegal el uso de Script o terceros \"\n\nEs como decir - \" No sabia que robar era malo \"","replies":[]},{"poster":"Yoen","date":"2017-04-11T07:44:00.448+0000","up_votes":1,"down_votes":0,"body":"Si tu cuenta fue** suspendida permanentemente**\nsignifica, _que no es posible recuperarla bajo ningún motivo_\n:(\n\nLo único que puedes hacer, es jugar en otra cuenta,\nsi realmente deseas seguir jugando.\n\nSuerte","replies":[{"poster":"Vaendrys","date":"2017-04-11T17:41:37.666+0000","up_votes":1,"down_votes":0,"body":"Que buen gusto en iconos.","replies":[]}]},{"poster":"ZanahoriaAsesina","date":"2017-04-11T06:18:25.224+0000","up_votes":1,"down_votes":1,"body":"¿Que programa usaste? o_o","replies":[{"poster":"LichaLopez9","date":"2017-04-11T08:22:49.105+0000","up_votes":1,"down_votes":0,"body":"Perdon que te diga, pero no estaria bueno fomentar o dar publicidad a los nombres de los programas scripts, hay muchos curiosos dando vueltas por aca","replies":[{"poster":"ZanahoriaAsesina","date":"2017-04-11T14:04:57.030+0000","up_votes":1,"down_votes":0,"body":"Entiendo lo que decís, igual no busco fomentar ni darle publicidad, más que nada busco advertir, ya que hay ciertos programas que están \"permitidos\" o mejor dicho, que Riot no castiga por el momento.\n\nQue se sepa el nombre de un programa en el post de un usuario, que acaba decir que fue sancionado, no creo que promueva su uso, es más, creo que nadie querría usarlo.","replies":[{"poster":"LichaLopez9","date":"2017-04-11T16:44:39.708+0000","up_votes":1,"down_votes":0,"body":"Si, se que no buscas eso, pero la curiosidad mato al gato, viste como es.","replies":[]}]}]}]},{"poster":"iH3RN4Ni","date":"2017-04-11T15:04:59.608+0000","up_votes":1,"down_votes":0,"body":"Un B3 menos. Adios!","replies":[]},{"poster":"rokushoger","date":"2017-04-11T11:54:26.585+0000","up_votes":1,"down_votes":0,"body":"Por lo que entiendo te banearon por usar scripts.\n \nLos scripts son programas que te dan ventajas sobre otros, de verdad pensaste que tener una ventaja sobre otra persona no te acarrearía un ban? \n\nDe todas maneras tu cuando creas tu cuenta le das \"si acepto\" a los términos de servicio, en los cuales establece que esto está prohibido.\n\nNo te queda de otra que saberlo para la próxima si es que te creas otra cuenta.","replies":[]},{"poster":"Gexz Arg","date":"2017-04-11T06:36:58.320+0000","up_votes":1,"down_votes":0,"body":"si un amigo te dice que se puede obtener rp gratis tambien le haras caso? osea vos mismo te pisas... como va a ser legal usar script ? para que gastaste dinero en skins y cajita si usarias un programa para ponerse skines que seguramente hiciste eso, nono, tu ban esta muy bien puesto","replies":[]}]}