{"poster":"Blutengel","date":"2017-07-01T14:42:19.429+0000","title":"Neues Ehrungssystem absoluter Müll (MM)","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":3,"body":"Wie schon im Titel meiner Meinung nach ist dieses neue Ehrungssystem  absoluter M&uuml;ll. \r\nWir stellen uns einmal vor wir spielen Aram: Zum Schlu&szlig; wird sofort gefragt, wen m&ouml;chtest Du ehren. \r\nHey ich habe nicht mal die Chance auf die Stats zu schauen, ich k&ouml;nnte da wen ehren, der die ganze Zeit AFK war.\r\n\r\nUnd wenn das Team super zusammen gearbeitet hat, kann ich nur einen ehren, was soll das denn? Dann bekommt meist der ADC die Ehrung, der Supp oder die anderen gehen leer aus.\r\nGenauso schlimm, ich kann ja nicht mal die Gegner ehren auch wenn das ein super tolles Spiel war und die Gegner toll gespielt haben.","replies":[{"poster":"Sirrkas","date":"2017-07-01T14:46:55.724+0000","up_votes":3,"down_votes":0,"body":"Du würdest also den Tank zum Beispiel nicht ehren wollen, wenn er einen haufen Leute gerettet und die letzten entscheidenden Plays für den Sieg gemacht hat, weil er am Ende zum Beispiel nur 1/7/20 steht?","replies":[{"poster":"sN00Bdogg","date":"2017-07-02T06:22:26.619+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=YnZkMR0R,discussion-id=3NIFrwWM,comment-id=0000,timestamp=2017-07-01T14:46:55.724+0000)\n>\n> Du würdest also den Tank zum Beispiel nicht ehren wollen, wenn er einen haufen Leute gerettet und die letzten entscheidenden Plays für den Sieg gemacht hat, weil er am Ende zum Beispiel nur 1/7/20 steht?\n\nGenau so siehts in der Praxis doch aus! Bevor einer an den Tank oder den SUpp denkt, hat er die Ehrung bereits einem \"Carry\" gegeben.\nWenn man weiterhin nur eine Ehrung vergeben darf, dann wird sich das ungefähr so einpendeln, daß entweder der mitgebrachte Premade geehrt wird und ansonsten der Carry des Teams.  An den Supporter oder den Tank wird erst in zweiter Linie gedacht, so daß diese Spieler wohl in den allermeisten Fällen leer ausgehen werden, egal wie gut sie waren.\n\nDie Beschränkung auf nur eine Ehrung und zwar auch nur fürs eigene Team macht diese \"Innovation\" zu einem Rohrkrepierer.\nDas einzig \"Gute\" daran ist, daß man aktiv klicken muss, um den Honor-Screen zu verlassen, weil somit jeder gezwungen ist, mal ans Ehren zu denken.","replies":[]},{"poster":"MacDeath","date":"2017-07-01T17:00:58.062+0000","up_votes":1,"down_votes":0,"body":"Regel Nr 1: Der Tank wird geehrt.\nRegel Nr 2: Wenn der Tank nicht geehrt wird, wird der Supporter geehrt.\n######Ausnahmen nur in Ausnahmefällen.","replies":[{"poster":"Enderized","date":"2017-07-01T23:40:26.472+0000","up_votes":1,"down_votes":0,"body":"Regel Nr 3: Wenn der Supporter Toxic af ist, dann ehre niemanden, denn dann hat es eh niemand verdient.","replies":[]}]},{"poster":"RAG Ryve","date":"2017-07-01T23:29:05.326+0000","up_votes":1,"down_votes":0,"body":"So gings mir vorher. Grragi Toplane gespielt, alle anderen Lanes haben verloren. \nDas Game wurde von mir soweit getragen bis mein Team items hatte und durch gute Synergy von mir und dem Midlane Yasuo bekamen wir jedes mal die Gegnerischen Carry am start des Fights. \n\n4 mal geehrt worden. Man braucht keine Stats usw. Das Team erkennt schon wer gute Plays gemacht hat, wer nicht toxic war usw.","replies":[]}]},{"poster":"Released Ape","date":"2017-07-02T05:44:11.404+0000","up_votes":2,"down_votes":0,"body":"Ich kann die Kritik gut nachvollziehen, manchmal hat man zwei Leute die man wirklich gerne im Spiel hatte und dann muss man sich am Ende entscheiden und das hat Ähnlichkeit mit \"Magst du Mama oder Papa mehr\". Jede Herangehensweise hat seine Reize, man könnte auch Punkte ansammeln. Pro Spiel 1 Punkt den man vergeben kann und man kann bis zu 4 anhäufen - damit lassen sich in einigen Spielen mehrere Leute ehren, die Wertung müsste man dann vielleicht anpassen.\n\nAber ich finde das System auch wie es jetzt ist ganz in Ordnung, man wird deutlich häufiger als früher geehrt - und ich denke das es zwar wie beim alten System nach einiger Zeit wieder etwas abnehmen wird. Aber es wird nicht wieder in einen solchen miesen Zustand wie beim letzten Mal kommen (1 Honor alle ~100 Spiele, die meisten Ehrungen gingen soweit ich weiß im Anfänger Bereich durch)","replies":[]},{"poster":"Blutengel","date":"2017-07-01T16:12:43.043+0000","up_votes":1,"down_votes":0,"body":"Leute spielt mal Aram das ist anders als im normalen Spiel, da bleibt dir nicht jeder im Kopf. Ich muss mich für EINEN entscheiden und glaub mir du merkst Dir nicht wer das war im Aram, da das Spiel schneller ist.\n\nUnd Sirrkas ich bin selber Support und habe solche Stats wie Du beschrieben hast, ich kann das schon interpretieren, aber warum kann ich nicht den Tank UND den ADC ehren? UND den Support der 0:8:40 steht, da er ja \"nur\" heilt oder andere Supporter -Dinge macht?\n","replies":[{"poster":"KorSett","date":"2017-07-01T19:00:21.955+0000","up_votes":2,"down_votes":0,"body":"Du sollst nur einen Ehren können damit die Wertigkeit ansteigt. \nWenn beispielsweise alle am Ende Super-Stats haben, heißt das nicht das alle schön und im Team gespielt haben. \nDa du nur einen Ehren kannst ist dein Honor jetzt natürlich am Ende etwas Wert und nicht ein Like-Button den du einfach mal bei jedem drückst, das System soll sich nunmal auch bedeutend anfühlen!","replies":[]}]},{"poster":"Pandeonor","date":"2017-07-29T13:10:53.872+0000","up_votes":1,"down_votes":0,"body":"Gegenthese: die alten Ehrungen waren für den Müll weil\n\n-> sie nichts eingebracht haben\n-> man in der Regel nicht geehrt wurde [oder auch niemand geehrt wurde]\n\nNeues Ehrunssystem ist besser\n-> häufigere Ehrungen nach dem Spiel (in der Rele ehren alle 5 jemanden)\n-> Es wird weniger geflamed [und das deutlich meiner Meinung nach]\n-> Man erhält mittelfristig Schlüssel dadurch (was Anreiz sowohl zu ehren als auch sich ordentlich zu verhalten ist)\n\n\nIm davor:danach ist das \"danach\" besser. Man kann Dinge _verbessern_ wie einen Gegner ehren beispielsweise. \n\nUuuund - ich erhalte durchaus Ehrungen als Sup. ☺","replies":[]},{"poster":"Silverdragon333","date":"2017-07-29T12:59:47.637+0000","up_votes":1,"down_votes":0,"body":"Meiner Meinung nach ist das Ehrungsystem gerade bezüglich des Ehrungsstufenaufstiegs noch sehr undurchsichtung, aber das ist eine andere Geschichte. Um auf das Topic zurück zu kommen: Ich würde mir wünschen, dass man 2 Personen/ Spieler im Team ehren kann, z.B. den besten Carry und entweder Supporter oder halt Tank oder so. Ich hatte in letzter Zeit sehr viele Spiele, wo ich dann 2 oder mehr Mates hatte, denen ich jedem gerne eine Ehrung gegeben hätte.","replies":[]},{"poster":"Enderized","date":"2017-07-01T23:39:18.662+0000","up_votes":1,"down_votes":0,"body":"''Hey ich habe nicht mal die Chance auf die Stats zu schauen, ich könnte da wen ehren, der die ganze Zeit AFK war.''\n\nNein- Verbündete die AFK sind werden am Ende eines Spieles nicht angezeigt.\nIch spreche da aus Erfahrung eines traurigen 3v5 ...","replies":[]},{"poster":"MeMyselfandBaal","date":"2017-07-01T15:53:03.516+0000","up_votes":1,"down_votes":0,"body":"Ich sag das mal so: Wenn du dich wirklich nicht mehr daran erinnern kannst, welcher Spieler AFK war oder welcher geflamed hat... dann solltest du vielleicht einfach immer den Knopf unten in der Mitte nutzen und niemanden mehr ehren... das geht ja auch...\n\nGanz ehrlich... die Begründungen, warum das neue System Scheiße sein sollen, sind meistens verdammt absurd... aber \"ich könnte unabsichtlich einen AFKler ehren\" ist echt die neue Spitze... \n\nDu sollst ja auch nicht nach Statistiken ehren... also wenn dein Yi 10-1-7 geht aber sich trotzdem die ganze Zeit wie ein Arschloch aufführt, verdient er sich trotzdem keine Ehrung. Du sollst dich eher Fragen: Welcher Spieler war denn der angenehmste Zeitgenosse? Und wenn es darauf keine Antwort gibt (was durchaus passieren kann), dann kannst du immer noch auf weiter klicken...","replies":[]},{"poster":"Humpelstilzche","date":"2017-07-01T15:39:27.068+0000","up_votes":1,"down_votes":0,"body":"> Hey ich habe nicht mal die Chance auf die Stats zu schauen, ich könnte da wen ehren, der die ganze Zeit AFK war.\n\nTheoretisch, ja. Aber erstens kann man dir ja wohl zumuten, dass du dich zumindest an die allergröbsten Details eines Spiels (z.B. wer permanent afk war und wer nicht) erinnerst, das gerade erst vor 5 Sekunden statt fand, zweitens haben Ehrungen nichts mit Stats sondern Sozialverhalten zu tun und drittens bist du ja nicht gezwungen überhaupt wen zu ehren.","replies":[]}]}