{"poster":"Porństar Janna","date":"2016-04-03T20:27:12.871+0000","title":"VOGLIO DIVENTARE MAIN MIDLANE, HELP","subforum":"Discussioni generali","up_votes":4,"down_votes":3,"body":"Salve ragazzi,\r\nmolto tempo fa, quando ancora ero al livello 15 circa, comprai il mio primo champion da 4800, Fizz, diventai mono Fizz. Era un champion che mi piaceva molto, divertente, ONESHOTTAVA, e vincenvo anche molte partite.\r\nPoi al livello 30 per gioco diventai main support, per fare duobot con un mio amico.\r\nAdesso mi &egrave; ripresa la voglia di andare midlane, mi piacciono champion come  {{champion:127}} ,{{champion:105}} ,{{champion:103}} ,{{champion:7}} ,{{champion:238}}  e {{champion:157}} .\r\nQuali sono i champion che fannno pi&ugrave; danni in questa patch?\r\nQuali sono i pi&ugrave; utili?\r\nPerch&egrave;?\r\nGrazie mille.","replies":[{"poster":"Darkinknight","date":"2016-04-03T22:55:39.374+0000","up_votes":1,"down_votes":2,"body":"Fizz = tons of damage + mobility + zhonia incorporato\nYasuo =tons of damage + mobility + ulti spammabile con qualsiasi knock up (letteralmente op se ci sono knock up ad area, come malphite e alistar )\nLb = tons of damage + mobility and more \nLiss no, ahri meh, zed ora è buono ma lo nerfano quindi non so come sarà poi\nFra questi potresti aggiungere lux,pick che si trova bene un po in tutti i team, anche morgana la vedo spammata in mid ultimamente con buoni risultati","replies":[{"poster":"kernel panic","date":"2016-04-04T05:39:30.624+0000","up_votes":2,"down_votes":1,"body":"Ahri meh? lol\n\nE' tipo il midlaner più completo del gioco. Ha tutto.","replies":[{"poster":"Darkinknight","date":"2016-04-04T06:32:29.431+0000","up_votes":1,"down_votes":0,"body":"Di base si..ma al livello dell'utente del post se usi ahri perdi, non è proprio semplice quel champ..a differrnza dei sopracitati,sotto il g2/g3 non ho mai visto una sola ahri carriare davvero il game..e piu completo sta a dire che puo fare un po di tutto,ma niente in maniera eccezionale..mobility alta ma solo con la ulti,i danni non diventano mai elevatissimi,un ottimo cc ma non è a target, e in questa season non è un mid laner che ha avuto grossi benefici ","replies":[{"poster":"kernel panic","date":"2016-04-04T06:56:38.379+0000","up_votes":1,"down_votes":0,"body":"non so quali statistiche tu guardi o come le interpreti, ma ahri al momento è il midlaner con la winrate pù alta (53%) rapportato al suo playrate (13%).\n\nCiò vuol dire che oltre ad essere abbastanza semplice è anche molto forte.\n\nL'unico midlaner che ha stat simili è zed che infatti è quasi in stato di permaban (58%).","replies":[{"poster":"Darkinknight","date":"2016-04-04T07:16:41.601+0000","up_votes":1,"down_votes":0,"body":"Le statistiche che dici tu sono prese dal platinum al challenger se non erro,quindi non è questo il caso..inoltre se guardi il grafico vedrai che ahri è(seppur lento) in calo","replies":[{"poster":"kernel panic","date":"2016-04-04T07:28:17.867+0000","up_votes":3,"down_votes":0,"body":"Ti assecondo, pur rimanendo dell'idea che non hai le idee molto chiare:\n\nAhri in bronzo : 51% win - 11% playrate / silver: 51% win - 13% playrate / gold: 53% win - 15% playrate\n\nSe per te queste sono le stats di un champ meh/in calo boh davvero non so che dirti..\n\nDi contro:\n\nFizz: bronzo: 48% - 11% / silver: 50% - 11% / gold: 50% - 12%\n\nYasuo: bronzo: 53% - 20% / silver: 50% - 19% / gold: 50% - 19% (lui però al momento lo stanno giocando tantissimo top lane, quindi queste stats sono probabilmente un misto di entrambi i ruoli).\n\nLeblanc: bronzo: 47% - 12% / silver: 46% - 13% / gold: 44% - 12%","replies":[{"poster":"Darkinknight","date":"2016-04-04T07:48:08.732+0000","up_votes":1,"down_votes":0,"body":"👍 grazie questa mancava anche a me..ma le statistiche per pick rate per ogni elo dove le trovi?","replies":[{"poster":"kernel panic","date":"2016-04-04T08:16:56.496+0000","up_votes":2,"down_votes":0,"body":"lolking","replies":[]}]}]}]}]}]}]}]},{"poster":"kharonte90","date":"2016-04-03T21:59:01.579+0000","up_votes":2,"down_votes":1,"body":"e aggiungo lux e morgana mid che sono ooooottimi pick.\nsia a bronzo che a platinum.\n\nin particolare con lux se build grall e morello hai un cd insignificante e dato il range delle sue abilità puoi stare fuori dai team fight a spammare, che è un bene se sei a bronzo/silver visto che la gente non ti aiuta se sei focussato perché è impegnata a chasare il low healt di turno.","replies":[{"poster":"LightIsMyPath","date":"2016-04-04T12:51:14.801+0000","up_votes":2,"down_votes":0,"body":"> se build grall e morello\n\nTi prego non farlo xD piuttosto vai di rune 20% cdr o 10% rune e 10% scarpe.","replies":[{"poster":"kharonte90","date":"2016-04-04T13:25:58.856+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=labarso,realm=EUW,application-id=MJVj50Jw,discussion-id=AOTv6v2r,comment-id=00010001,timestamp=2016-04-04T12:51:14.801+0000)\n>\n> Ti prego non farlo xD piuttosto vai di rune 20% cdr o 10% rune e 10% scarpe.\n\nho già risposto all'altro evocatore x)\nse ti interessa sapere il mio punto di vista leggi la risposta al suo commento.","replies":[{"poster":"LightIsMyPath","date":"2016-04-04T14:57:31.878+0000","up_votes":2,"down_votes":0,"body":"{{item:3174}} {{item:3285}} {{item:3089}} {{item:3165}} {{item:3135}} {{item:3020}} piu' rune e maestrie standard da ap = 629 ap e 45% cdr per 15850 gold se non sbaglio.\n{{item:3165}} {{item:3285}} {{item:3089}} {{item:3135}} {{item:3020}} {{item:3157}} piu' rune di riduzione ricarica = 661 ap e 45 % cdr per 16650 gold. \n\nIn pratica per 800 gold guadagni 32 ap ( trovo che sia gia' conveniente se fai il conto con {{item:1052}} che da 20 ap e costa 435) , 45 armatura e soprattutto l'attiva della zhonya, che puo' essere indispensabile contro molti assassini, per evitare hard engage e anche contro altri maghi da burst ( non ti e' mai successo, proprio usando Lux, che dopo aver preso una q tiri una bella full combo gia' pregustando la kill e quello si zhonya proprio mentre il laser gli passa sulla testa?).\n\nPoi le rune puoi combinarle in parecchi modi diversi, il set che uso io me lo son fatto da sola per tentativi quindi magari non e' ottimale ( pero' non posso rinunciare a sparare laser ogni 28 secondi :p), ma sfrutta l'oro gia' meglio del doppio mana item.","replies":[]}]}]},{"poster":"kernel panic","date":"2016-04-04T06:57:21.565+0000","up_votes":2,"down_votes":0,"body":"buildare doppio item di mana è uno spreco. Spendi 5k gold per avevere 130 ap...","replies":[{"poster":"kharonte90","date":"2016-04-04T13:24:54.567+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tempus Frangit,realm=EUW,application-id=MJVj50Jw,discussion-id=AOTv6v2r,comment-id=00010000,timestamp=2016-04-04T06:57:21.565+0000)\n>\n> buildare doppio item di mana è uno spreco. Spendi 5k gold per avevere 130 ap...\n\nnon ho detto di farli come primi due item, io personalmente chiudo sempre sia grall che morello e i cd delle skill sono Q 6.1 W non mi ricordo E 5.5 R 37, full mana fisso e scrivo al jungle che può prendersi tutti i blu che vuole, sempre che me li abbia dati fino a quel momento x)\n\ndi solito chiudo o grall o morello per primo, poi faccio rabadon e eco e poi chiudo il grall o il morello \"di conseguenza quello che manca\".\nil doppio item del mana ruba il posto del terrore del lich non ha tutto questo potere magico in più confronto a grall o morello, considerando tra l'altro che mi trovo in bronzo/silver e non mi avvicino manco morto ai team fight non frutterei nemmeno al massimo il lich, in ogni caso lux shotta chiunque con la combo e l'ulti in team fight smezza qualsiasi champ non full resistenza magica.\n\ngrazie per il consiglio comunque, magari a gold il blu ti viene dato, noi poveri bronzi siamo costretti a stilarlo al jungle se lo vogliamo. x)\nanche se mi trovo 5 0 a 8 minuti, anche se fin dalla selezione campioni al jungle chiedo solo il blu come aiuto in lane.","replies":[{"poster":"kernel panic","date":"2016-04-04T13:38:28.707+0000","up_votes":2,"down_votes":0,"body":"Non è questione di blu. Manco a me lo danno.\n\nE il lich bane su lux fa pena, non capisco da dove tu abbia preso l'idea di buildarlo.\n\nLa build standard è : calice o morello, boots, luden, void, zhonya, rabadon.\n\nSe hanno doppio ap, sostituisci il rabadon con l'abyssal.\n\nMa il doppio di tem di mana su lux non esiste proprio, imo.","replies":[{"poster":"kharonte90","date":"2016-04-04T14:21:09.678+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tempus Frangit,realm=EUW,application-id=MJVj50Jw,discussion-id=AOTv6v2r,comment-id=0001000000000000,timestamp=2016-04-04T13:38:28.707+0000)\n>\n> Non è questione di blu. Manco a me lo danno.\n> \n> E il lich bane su lux fa pena, non capisco da dove tu abbia preso l'idea di buildarlo.\n> \n> La build standard è : calice o morello, boots, luden, void, zhonya, rabadon.\n> \n> Se hanno doppio ap, sostituisci il rabadon con l'abyssal.\n> \n> Ma il doppio di tem di mana su lux non esiste proprio, imo.\n\nper me invece non esiste la zhonya su lux visto che sono fuori range di chiunque, diciamo che ci sono delle linee guida ma non è una legge seguirle. così siamo tutti contenti.\npensa fossi tu a volermi far fare il lich bane x)\n\novviamente se sono contro assassini sono obbligato a chiudere la zhonya.","replies":[]}]}]}]}]},{"poster":"Giunco171","date":"2016-04-03T20:57:51.602+0000","up_votes":2,"down_votes":2,"body":"Tutti quelli che hai elencato sono i migliori al momento ( forse solo lulu,corky e GP manca tra la lista dei mid lager in meta ) comprali , impara ad usarli e divertiti. Ti piacciono comunque champ con alta mobiliti, roamma tanto!","replies":[{"poster":"Porństar Janna","date":"2016-04-03T21:06:25.147+0000","up_votes":1,"down_votes":0,"body":"Dopo la T1 rommo praticamente sempre, indifferentemente dal team che ho","replies":[{"poster":"GreenInch","date":"2016-04-04T07:19:06.828+0000","up_votes":2,"down_votes":1,"body":"Bhe potresti farlo traquillamente anche dopo un paio di kill nella tua lane e con un buon vantaggio in farm (che sarebbe gradito)io affamato di zed plays se arrivo al 6 senza kill e in quel momento non ho laner in lane una capatina bot la faccio sempre...una cosa che mi succede spesso:siccome mi piace capire che mi succede intorno,indipendentemente da quanta vision ho,la first blood me la regala quasi sempre il jgl nemico che litiga col mio nel river per uccidere giorgio (credo lo chiamino cosi quel granchio qui)...poi sta a te saper portar morte e terrore per tutta la landa","replies":[]}]}]},{"poster":"Squacquerone","date":"2016-04-05T06:49:58.625+0000","up_votes":1,"down_votes":0,"body":"Fidati il doppio mana item è un abominio, non lo vedo più (per fortuna )da bronzo (e ora sono platino)... Il 40% lo raggiungi con Morello/grail + boots 10% (molto meglio su lux per il semplice motivo che non è un velkoz/malzahar che fanno danni nel tempo ma ha solo 3 skill con danno unico)+ 10% dati dalle rune.","replies":[]},{"poster":"x A N D R E","date":"2016-04-04T12:22:36.026+0000","up_votes":1,"down_votes":0,"body":"Vel koz, tonnellate di danni anche puri","replies":[]}]}