{"poster":"AncientITTI","date":"2017-05-23T19:04:02.273+0000","title":"Talon Hilfe","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo, \nich habe irgendwie Probleme mit Talon (wenn ich ihn spiele).\nEigentlich ist Talon ja ein lanestarker Champ mit extrem gutem Level 2. Ich hatte in den letzten 4 Spielen gegen Syndra, Ryze, Akali und Karthus gespielt und habe alle Lanes verloren und entsprechend fast keinen Impact gehabt. Nur was mache ich falsch. Die Idee bei Talon ist ja mit der W 2 Stacks auf die Passive zu kriegen und dann mit der Q  den dritten und dann diese auszul&ouml;sen. Nur stellen sich die Gegner meistens nicht so, dass sie beide Male getroffen werden. Wenn ich die Q als Gapcloser auf ein Minion benutzte fehlt mir die Q halt dann um die passive zu triggern. Habt ihr irgendwelche Tipps?\n\nlg","replies":[{"poster":"Samus Saran","date":"2017-05-24T09:46:05.206+0000","up_votes":1,"down_votes":0,"body":"Aur der Lane solltest du dich nicht wien tollwütiger Hund verhalten, sprich dich aggro benehmen, denn dann wird der Mage erst recht abstand zu dir halten.\nBenimmste dich hingegen wien Kätzchen, sprich bleib passiv und tu so als würdest du sicher farmen wollen, so wiegste ihn in sicherheit und dann zack schnappste zu.\n\nWenn kein Kill zu holen ist geh roamen und oder geh den gegnerischen jungler jagen dein Early Potential ist over 9000 und deine E ist dafür perfekt geeignet. \nMache das ziemlich gerne wenn der gegnerische Jungler vorbeikommt zu mir Midlane und er erfolglos gankt, push ich schnell (bzw. folge ihn in 5 sekunden nachdem der Jungler gegangen ist) und tue so als würde ich roamen aber in wirklichkeit gehe ich in den Jungle und schätze ein wo er sein könnte und ein Jungler hat wegen der nierdigeren EXP nix zu melden im 1on1.\n\nPS: Im Lategame wirste stark abfallen das ist nunmal leider Fakt mit Talon, also versuche bis dahin deinem ADC das Leben zu erleichtern indem du zB. den gegnerischen ADC aus dem Spiel regelmässig nimmst, so bekommt dein ADC mehr Farm und Ihr habt mehr Turrets eingenommen und der Snowball ist für euch sicher.","replies":[]},{"poster":"Bryen91","date":"2017-05-24T00:59:25.599+0000","up_votes":1,"down_votes":0,"body":"Wie hier schon gut beschrieben - nochmal kurz und knapp:\nWenn du dir relativ sicher bist, dass den Kill bekommen kannst, dann spring halt den Gegner mit der Q an, nutz dann die W (so wirst du mit hoher Wahrscheinlichkeit auch beide Instanzen treffen) und mach dann noch einen AA, um die Passive auszulösen - ggf. noch Ignite.\nDu hast gerade im Early extremes Schadenspotenzial, falls du mit Thunderlord's spielst - mach also so etwas \"überraschendes\" mit Level 2-3 und der Gegner wird in den meisten Fällen sterben.","replies":[]},{"poster":"Enderized","date":"2017-05-23T19:40:34.323+0000","up_votes":1,"down_votes":0,"body":"Ich dachte man triggert die Passive mit einem Basicattack, nachdem man 3 Stacks Passive auf dem Gegner hat?\nDas geht nur wenn man beide Teile W trifft + Q + AutoAttack oder habe ich Talon falsch verstanden bislang? :x\n\nRespektive kann deine Ult ja auch noch die Passive Stacken ab lvl 6","replies":[{"poster":"AncientITTI","date":"2017-05-23T20:23:06.498+0000","up_votes":1,"down_votes":0,"body":"ja mein fehler habe ich falsch geschrieben","replies":[{"poster":"Enderized","date":"2017-05-23T20:37:26.774+0000","up_votes":1,"down_votes":0,"body":"aye. \nalso als Talon hast du es auf der Lane gegen ranged nicht wirklich Spaß... zumindest dürftest nicht viel haben.\n\ndu darft deine Q nicht als Gapcloser auf minions verwenden sondern musst den gegner normal ganz normal engagen.\n\nsollte dir daa gelingen und der gegner steht nicht schon wieder unter dem Turm , kannst du ihn mit der Q anspringen und die W reinkotzen und hast somit deine 3 Stacks die du proccn kannst.\n\nsollte dies nicht so einfach möglich sein in der lane:\ngeh roamen! warde im Gegnerjgl die üblichen Chokepoints ( auch mit Redwards ) und farm dir den Gegnerjgler ab.\noder roame auf bot/top.\nden schaden eines Assasinen und 1-2kills können die sicher auch gebrauchen-\n\nvergess nicht: du bist eine Assasine und Assasinen agieren schnell- bevorzugt gegenüber spielern die nicht wissen was du tust, weil sie gegen dich lanen und mit engages rechnen =))","replies":[]}]},{"poster":"I love you Malon","date":"2017-05-23T20:06:32.215+0000","up_votes":1,"down_votes":0,"body":"japp 3 Stacks + Auto","replies":[]}]}]}