{"poster":"MunchCrunchLunch","date":"2016-09-07T16:31:41.432+0000","title":"Is gankplank the strongest champion when played well?","subforum":"Gameplay","up_votes":4,"down_votes":2,"body":"http://na.op.gg/summoner/userName=MunchCrunchLunch\n\n\nI never done so well with a champion in ranked. i have like 30k mastery with GP. i started playing him mainly. like. for about two weeks now. 69% winrate in 30 matches. so strong when you know what your doing.\n\ndo you guys think gangplank is the strongest when hes played at a good level?\n\nwon 10 games in a row (if you disregard the one with the troll that was a gg at 20 game ). and all of them i had pretty good impact as well.\n\n#FREELOPLANK #ELOPLANK #GOLDPLANK","replies":[{"poster":"Restless Slumber","date":"2016-09-07T16:53:33.691+0000","up_votes":4,"down_votes":0,"body":"Right now the strongest champion when played well is Nidalee. She is almost perma ban in high elo. I can tell you as a Nidalee main, that she is completely busted if played properly. Gangplank is up there, but doesn't have the snowball power that Nidalee has in the early game.","replies":[{"poster":"MunchCrunchLunch","date":"2016-09-07T16:58:29.717+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PuffyP,realm=NA,application-id=3ErqAdtq,discussion-id=m6qeQfrN,comment-id=000a,timestamp=2016-09-07T16:53:33.691+0000)\n>\n> Right now the strongest champion when played well is Nidalee. She is almost perma ban in high elo. I can tell you as a Nidalee main, that she is completely busted if played properly. Gangplank is up there, but doesn&#x27;t have the snowball power that Nidalee has in the early game.\n\noh i do know that. the ability to spam an execute is pretty damn strong. thats the only thing i don't like about her personally is that its very hard to outplay her in a 1v1. even if you manage to live through her inityal burst she just spams her Q execute because of how low the cd is.\n\nbut am low elo there are more important things than fast clearing. and the ability to 1v1 other meta junglers that i couldn't care about much. its so damn annoying that her cds in lion form are that low.","replies":[]}]},{"poster":"Astôlfo","date":"2016-09-07T19:09:24.171+0000","up_votes":3,"down_votes":0,"body":"I don't know about \"strongest\", but yes, he can be incredibly strong in very skilled hands.","replies":[]},{"poster":"Tyrone Lannister","date":"2016-09-07T16:34:43.369+0000","up_votes":2,"down_votes":0,"body":"Any champ that has global pressure can be really strong in the right hands","replies":[{"poster":"MunchCrunchLunch","date":"2016-09-07T16:35:23.526+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Tyrone Lannister,realm=NA,application-id=3ErqAdtq,discussion-id=m6qeQfrN,comment-id=0002,timestamp=2016-09-07T16:34:43.369+0000)\n>\n> Any champ that has global pressure can be really strong in the right hands\n\nthe thing is. hes a carry as well. hes not a shen. meanwhile he can provide that utility as well","replies":[{"poster":"Tyrone Lannister","date":"2016-09-07T16:36:08.310+0000","up_votes":2,"down_votes":1,"body":"I was thinking along the lines of TF or Taliyah. Or even Aurelion Sol","replies":[{"poster":"MunchCrunchLunch","date":"2016-09-07T16:40:02.450+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tyrone Lannister,realm=NA,application-id=3ErqAdtq,discussion-id=m6qeQfrN,comment-id=000200000000,timestamp=2016-09-07T16:36:08.310+0000)\n>\n> I was thinking along the lines of TF or Taliyah. Or even Aurelion Sol\n\ntrue true. tf snowballs carries tho rather than carrying on his own. he can but it isn't optimal taliyah falls off late game. sol scales very well but hes easier to shut down due to even his items being scaling like roa for example.","replies":[{"poster":"Tyrone Lannister","date":"2016-09-07T16:43:09.525+0000","up_votes":1,"down_votes":0,"body":"Tru. GP can sandbag very well","replies":[]}]}]},{"poster":"Sahn Uzal","date":"2016-09-07T16:47:01.252+0000","up_votes":1,"down_votes":0,"body":"{{champion:30}}","replies":[]}]}]},{"poster":"RcGjWO640w","date":"2016-09-07T16:42:05.014+0000","up_votes":2,"down_votes":0,"body":"I think Ryze is actually still one of the most powerful champions in the game when played at the top-tier levels.","replies":[]},{"poster":"Mr Broken Wings","date":"2016-09-07T16:35:16.436+0000","up_votes":3,"down_votes":1,"body":"there is a reason why I ban or dodge EVERY game in which cancerplank is in the enemy team right now till they nerfed him some more.\nYes, recent nerfs are not enough for me to deal with that shit again.","replies":[]},{"poster":"Thunderspam","date":"2016-09-07T16:44:52.404+0000","up_votes":2,"down_votes":1,"body":"Id say maybe Darius or Yasou can be the strongest if they get fed/or are just really good players","replies":[]},{"poster":"UberAffe","date":"2016-09-07T16:43:31.525+0000","up_votes":2,"down_votes":1,"body":"I think it depends just as much on how the enemy's fight you. If they can stop you from using your barrels effectively then you are relatively weak.  Basically the fights are controlled by who manages your barrels better.","replies":[]},{"poster":"Sahn Uzal","date":"2016-09-07T16:33:23.326+0000","up_votes":2,"down_votes":2,"body":"Depends on  your definition of strong. I personally think people allow Gangplank to be more effective than they should be because they rarely abuse his weaknesses (Attacking barrels etc, or walking forward and then backwards so he wastes his kegs)","replies":[{"poster":"Geauxx","date":"2016-09-07T16:36:33.909+0000","up_votes":2,"down_votes":1,"body":"That at the same time can also be your end, last hitting the barrels within itself can be like this ( you try to last hit it but he times his Q/aa just barely better than you and ban you just lost half your hp for a miscalculation) and most GPs wont just toss a barrel in your face giving you the chance to hit it.","replies":[{"poster":"MunchCrunchLunch","date":"2016-09-07T16:37:57.793+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nice Shade,realm=NA,application-id=3ErqAdtq,discussion-id=m6qeQfrN,comment-id=00010000,timestamp=2016-09-07T16:36:33.909+0000)\n>\n> That at the same time can also be your end, last hitting the barrels within itself can be like this ( you try to last hit it but he times his Q/aa just barely better than you and ban you just lost half your hp for a miscalculation) and most GPs wont just toss a barrel in your face giving you the chance to hit it.\n\ni do make mistakes sometimes. sometimes the barrels buffer weird. because it doesn't go perfect every time and end up just throwing a barrel to the side when you buffer a third barrel after you shoot the first. but thats about it. he can easily land barrels on anyone without a dash. tirivial in lane. doesn't do a whole lotta damage until triforce but then they really hurt squishies.","replies":[{"poster":"Geauxx","date":"2016-09-07T16:39:23.946+0000","up_votes":1,"down_votes":0,"body":"Exactly though, but sometimes thats all it takes.","replies":[]}]},{"poster":"Sahn Uzal","date":"2016-09-07T16:48:28.363+0000","up_votes":1,"down_votes":1,"body":"Lucian passive, AA resets, multiple people attacking the barrel at the same time.\nThere are a bunch of things  you can do to deny GP's barrels, unless he uses a 3 barrel combo outa your range. But if he does that you can use the walkforward walk back strategy :p","replies":[]}]}]},{"poster":"dominusx","date":"2016-09-07T16:34:59.087+0000","up_votes":2,"down_votes":1,"body":"pre nerf yeah. now nah.. a good {{champion:92}} will solocarry but a good riven is as rare as a royal flash in poker. a good {{champion:40}} can also solo carry","replies":[]},{"poster":"Nahui","date":"2016-09-07T16:32:54.993+0000","up_votes":2,"down_votes":1,"body":"Just about, yeah.","replies":[]},{"poster":"MunchCrunchLunch","date":"2016-09-07T16:41:11.538+0000","up_votes":1,"down_votes":0,"body":"the hardest lane has been irelia. am kind of gonna die eventually against her however i do more mid and late game","replies":[]},{"poster":"Geauxx","date":"2016-09-07T16:37:57.501+0000","up_votes":2,"down_votes":3,"body":"He's basically one of the strongest Late game champs, but his early game is terrible, a good gp would prob try his best to stall the lane out and try not to die, but basically he is strong when played in the right hands.","replies":[{"poster":"MunchCrunchLunch","date":"2016-09-07T16:39:01.033+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nice Shade,realm=NA,application-id=3ErqAdtq,discussion-id=m6qeQfrN,comment-id=0005,timestamp=2016-09-07T16:37:57.501+0000)\n>\n> He&#x27;s basically one of the strongest Late game champs, but his early game is terrible, a good gp would prob try his best to stall the lane out and try not to die, but basically he is strong when played in the right hands.\n\ni get cull sometimes. and just farm under tower. and the bandit mastery. not always cull. but i do it more often now. if the opponent is poke champ. or a good champ at all ins if am low. i get corruption potion. mid lane however i get ruby crystal and refillable or dorans ring","replies":[]}]}]}