{"poster":"MunchCrunchLunch","date":"2017-07-15T02:25:02.136+0000","title":"What the fuck do you want from me? WHAT? @Broporo fucking help me. ","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":1,"body":"https://boards.na.leagueoflegends.com/en/c/help-support/uFkYfriI-are-you-fucking-with-me\n\nthat was 24 days ago. you can read it\n\nTLDR: Game fronze during champ loading. I had to restart. game was remade and I lost 22 lp and I had low priority Queue.\n\ncan you guess what happened now. **THE SAME FUCKING THING **\n\nI BOUGHT A BRAND NEW COMPUTER. BRAND NEW. i7 processor and a gtx nvidia discrete card. for 900 bucks. I used to play on an i7 computer as well.\n\nmy computer has 3 programs. Overwatch, league and google chrome. its brand fucking new. nothing wrong with it. I played 300 hours on OVERWATCH. I never fucking crashed. not a single time.\n\nSO I LOSE THE 20 LP AT NO FAULT OF MINE. OK. BUT I ALSO GET THE FUCKING AFK PUNISHMENT? WHY? I HAVEN'T PLAYED LEAGUE IN 2 WEEKS.\n\n\nLETS GO TO MY OP.GG AND SEE THE LAST TIME I AFKED. BECAUSE AM A FUCKING ASS HOLE THAT** AFKS \"PURPOSELY\" IN GAMES AND DESERVES TO BE PUNISHED.\n**\n\n\n\nif you look at my op.gg. 24 days ago. the exact day I dced because of the SAME EXACT ISSUE. that happened today. that game where I picked zed.\n\nhttps://na.op.gg/summoner/userName=MunchCrunchLunch\n\nthat wasn't my afk. the game crashed. I got a bullshit PR response from one of the apes that riot hires on these forums. that does not tell me anything or helps me.\n\n lets go back more lets truly see the last time I afked. because obviously. this AFK punishment  doest trigger unless I have a history of afking.\n\nlets fucking see what kind of horrible human being I am for purposely afking in my games all the time to get punished this time at no fault of mine.\n\nas you see there are a few games that were remade but it wasn't due to my fault. because obviously you can see game stats that show that It wasn't me\n\nfor example that brand game I had done some damage and I wasn't the afk here. also you can look at the starting item\n\nthe other remake was the afk kog maw. as you see I had starting items. and I did not afk and riot can check on their part\n\n\nthe farthest I can go back. is 1 month and A HALF ago and I have no AFKS. BUT I STILL GET FUCKING PUNISHED? WHY. WHAT DO YOU FUCKING WANT FROM ME?.\n\n\nJUST PERMABAN MY ACCOUNT AND GIVE MY MONEY BACK. OR LET ME FUCKING PLAY IN PEACE BECAUSE I CAN'T DO THIS ANYMORE. \n\nplease. I just want to play this game in peace , I don't want to be treated like this when you know its not my fault. what is the point of the customer fucking support then? COMPENSATE ME FOR THIS BULLSHIT. FUCK\n\nEither Remove the fucking AFK PUNISHMENT BECAUSE I DIDN'T AFK IN OVER 2 MONTHS. OR COMPENSATE ME FOR THIS BULLSHIT. \n\n~~COMP-FUCKING-ENSATE ME FOR THIS RIOOOOOOOOOOOOOOOOOOOOOOOOOOOOTT~~","replies":[{"poster":"TheViper7911","date":"2017-07-15T03:04:35.624+0000","up_votes":2,"down_votes":0,"body":"Have you opened a support ticket and sent them the logs?","replies":[]},{"poster":"MrFeelg00d","date":"2017-07-15T16:31:54.205+0000","up_votes":1,"down_votes":0,"body":"Hey man, relax and take a deep breath. It's just a game, and everything will be alright.","replies":[]},{"poster":"Broporo","date":"2017-07-15T03:54:18.326+0000","up_votes":1,"down_votes":0,"body":"Yikes! I can certainly feel your passion about this, and trust I'm gonna look over as much of this as I can to see just exactly what was going wrong and what I could possibly do to help bud.\n\nThat last post sounds like my poro-bro was trying to help you figure out why you were having issues joining that game to begin with. He started out with the [**connection guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues), but that's not to say there's a problem with your pc itself. Sometimes your internet is running 100% but it can still have problems reaching specific servers in some cases. \n\nI want to make sure that the issue with you not being able to join the game is taken care of first, so make sure that you run through the steps in that guide. Also, if you can find the network logs for that match, go ahead and pop them into this [**log reader**](https://support.riotgames.com/hc/en-us/articles/209765743) so we can check for packet loss at the same time.\n\nAfter you troubleshoot that weird connection issue, go ahead and shoot us a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new). Once we've been able to make sure you're able to join games normally again we can open up the discussion of what can be done about that low-priority queue.","replies":[]}]}