{"poster":"TheEdgeOfDestiny","date":"2016-10-05T11:53:15.614+0000","title":"Is there a chance of receiving a VO update on Little Devil Teemo?","subforum":"Story, Art, & Sound","embed":{"description":"Captured with Lightshot","url":"http://prnt.sc/cq3cm8","image":"http://image.prntscr.com/image/bb2c4637580a41f8872a83f97fb57813.jpg"},"up_votes":26,"down_votes":2,"body":"Skin itself is really good.\r\nAll of it - design, VFX. But VO feels so out of place.\r\nIt is understandable that creating VO would require more effort and skin would become more expensive.\r\n\r\nIs there a chance of getting an update to skin that will add special VO?\r\nWith additional payment if someone wants to upgrade and possibility to purchase updated version for those who doesn&#039;t own it.\r\n\r\nIt is so good and yet it lacks a piece of puzzle that will make it whole.","replies":[{"poster":"Riot Sound Bear","date":"2016-10-07T04:00:56.047+0000","up_votes":11,"down_votes":0,"body":"Hello @TheEdgeOfDestiny!  \n\nSo glad you like the skin!  I am sorry the VO feels out of place, or like a piece of puzzle missing to make it whole. I do want to give a little bit of the \"Behind the Scenes Work\" on Little Devil Teemo VO. It might shed a little light on why we decided to not process the original VO.\n\nI was super excited for this skin to come about and jumped on the idea of wanting to process the original Teemo voice so that the True Teemo that we had all been waiting for could come out to the rift and scare us all.  One of the decisions we had made with this Teemo is that he stay cute, demon but cute! So with all my demonic research and inspiration, I tried my hand at making Teemo sound like a demon. This was 2 weeks of trying to get Teemo to sound just right...the results were disastrous and I will explain the reasons why.\n\nThere were two options to go with on Teemo's voice: pitched super low and scary, very large demonic-like and the other which was psychotic, not pitched.  This non-pitched effort would be done via re-recording Teemo's original voice talent and getting the VO to feel psychotic.  The pitched low option failed hard because it was the opposite of cute and got super annoying really quick. It was also technically hard to do this pitch on the original VO of Teemo since that VO is actually pitched up to a higher frequency, so when I added the low pitch processing, it sounded like a 14 year old boy and felt extremely out of context. The only way to do this was to re-record a male VO talent and have them hopefully hit those Teemo feels but at a lower frequency, so I could pitch it lower and have it feel demonic.  So this was just a bad option and was just feeling bad with Teemo walking around the rift sounding like a 14 year old kid.\n\nThe second option of pitching up was also a hard decision because it meant re-recording Teemo's voice talent and adding an element of psychotic-ness to the voice...Again, using my own voice (which was embarrassing) and running around the rift felt really annoying and overall not cute, nor like a devil.  Thus the idea I went with in the end was using the moment during the recall and death when Teemo's true face was revealed, where I could go as ham as I could and use that crazy low end demon voice. I did this by recording a Rioter in house and pitching it as you hear Teemo currently. This has then allowed for all of us who play Teemo to not get super annoyed, and to be much more surprised at the recall and death when that true form is shown.\n\nHopefully this helps clarify why we chose the non-processed version vs. the processed version.  Please hit me back with any feedback. So far I heard some really cool options reading the comments in this thread.\n\n<3 Riot Sound Bear","replies":[{"poster":"blackfootedfox","date":"2016-10-07T05:09:41.753+0000","up_votes":9,"down_votes":0,"body":"How about this: why not add that demonic laugh to Teemo's laughs? Like the ones not part of what he randomly says. But not have it lay everytime so like 3/4ths of the time his laugh is normal but 1/4th its the demonic laugh. I think this could make the skin closer to what the community wants.","replies":[{"poster":"patmax17","date":"2016-10-07T06:44:51.846+0000","up_votes":2,"down_votes":0,"body":"I too think that creey laugh could be exploited more. I was suggesting to Katey that maybe it could be played when an opponent steps on a mushroom (global, only for teemo or only for the opponents). I think it could be a compromise of leavins his voice normal, but clearly showing the demonic little creep he is. I imagine it as if he normally hides his true nature, but he just can't help make it slip through when one steps on a shroom xD","replies":[]},{"poster":"Decrit","date":"2016-10-07T07:46:44.842+0000","up_votes":1,"down_votes":0,"body":"I was thinking about this too - a heavily distorted piece of VO that does not always play but can scare the shit outta you. Sounds doable, since the poor Rioter has to work just on few lines rather everyone.\n\nAnd fits well, devils always hide themselves for what they are even if they are caught redhanded.","replies":[]}]},{"poster":"Ultîma","date":"2016-10-07T16:33:46.205+0000","up_votes":2,"down_votes":0,"body":"I think a mixture of your ideas and the player's expectations is the best direction to go with regards to what your colleagues wanted to do internally, let me explain;\n\nDevil Teemo should preserve part of his original VO, and mix it in with demonic elements which would come into his lines unpredictably. This keeps the ''cute'' identity of Teemo intact, while also conveying the psychotic elements you wanted to go for. To illustrate what I mean, ''Never underestimate the scout's code!'' could be turned into ''Never underestimate **THE LORD OF DARKNESS**!'' In this instamce, the line would start out the same, with the demonic elements jumping out at the end to reveal Teemo's true nature. \n\nThis would be cute, terrifying and hilarious.\n\nEdit: This is also a golden opportunity for Teemo to have a special taunt directed at Cho'Gath where he'd threaten to devour him.","replies":[]},{"poster":"Zero Skill Tank","date":"2016-10-07T13:58:53.486+0000","up_votes":2,"down_votes":0,"body":"Just please do something with \"Never underestimate the scout's code\" line, it makes no sense on a demon...","replies":[]},{"poster":"Wrathof300","date":"2016-10-13T00:02:29.734+0000","up_votes":1,"down_votes":0,"body":"Okay so I understand why the skin doesn't have a lower pitched demon-esque voice. However, is there a possibility maybe in the future when teemo receives a new model and VO, that lines that fit the 'lore' of the skin be added in, because I agree with you it's a billion times scarier when you see the recall opposed to him being all demon overlord mode all the time.\n(This is a large problem with a lot of the skins in the game and not just this one in particular, unfortunately we have to admit Riot doesn't have the money to add VO for every skin just so it feels more cohesive with it's lore {{sticker:zombie-nunu-tears}}  keep up the good work nonetheless skins team)","replies":[]},{"poster":"Ramelznak","date":"2016-10-12T22:00:24.645+0000","up_votes":1,"down_votes":0,"body":"I own Cottontail, Astronaut, and Omega Teemo skins; I want to want this skin. The visuals are spot on. I personally don't care about the crown, but everything else is perfect in my opinion. \n\nThat being said, the voice/lines of default Teemo kill this skin for me. I really appreciate you looking into this, but I hope some changes are made. Omega Squad Teemo isn't cute, and he doesn't NEED to be cute. There are enough cute Teemo skins. Reaper Soraka doesn't \"fit\" her perceived persona, but it works. Little Devil Teemo should be a scary bundle of evil stuffed into a 3-foot hamster. I'd rather have the skin pushed back a patch to have this happen, because the skin won't be worth it to me with the current voice. There would be nothing more depressing in LoL than having to look at that skin.... only to hear his base voice.","replies":[]},{"poster":"Netherlife","date":"2016-10-07T19:42:08.525+0000","up_votes":1,"down_votes":0,"body":"Have you tried slowing the speech, adding reverb, and recording some incoherent whispering to the sound file just to make it kind of unsettling and... off? \n\nI also have a post talking about the skin in general discussion if you're interested in what a few Teemo mains have to say.\n\nhttp://boards.na.leagueoflegends.com/en/c/GD/6qtdjWT9-regarding-little-devil-teemo-riot-please-hear-me-come-leave-your-thoughts","replies":[]},{"poster":"TheEdgeOfDestiny","date":"2016-10-07T19:36:06.610+0000","up_votes":1,"down_votes":0,"body":"It highly depends on execution. You can make anything interesting if done right.\nWhat about latin phrases in demonic voices. It wouldn't limit with need to work with same artist as before since voice would sound completely different.\nPhrases that would suite theme nicely. For example:\n\"Deus non exorium!\"\n\"Vae victis!\"\n\"Dominus ignis.\"\n\"Gloria demonia!\"\n\"Abyssus invocat!\"\nHere are some examples from a jewel long forgotten.\nhttps://clyp.it/3xmggfm2\nhttps://clyp.it/k2f3nljc\nhttps://clyp.it/velys5lm\n\nAs an alternative - making him sound just straight demonic-animalistic but I think it would be hard to do right in LoL context.\nhttps://clyp.it/ldli10ch\n\nP.S.:\nI understand that chances of adding VO three weeks before release are slim.\nI think I just like the idea too much.\nEspecially if it would become possible to make this skin differ from other skins. To make it special.","replies":[]},{"poster":"Meep Man","date":"2016-10-07T19:04:46.450+0000","up_votes":1,"down_votes":0,"body":"I think at least the Laugh VO should have the demonic Recall laugh. The player playing Little Devil Teemo has full control over that and can't get annoyed by it","replies":[]},{"poster":"Decrit","date":"2016-10-07T07:53:47.051+0000","up_votes":1,"down_votes":0,"body":"What about this - on some specific VO's you add the chance ( so it does not happen always, but once like 1/4 th of time for example ) to generate additional audio effect, like people screaming in the background, when they use emotes that can be heard not only by the player ( laugh, taunt and such). This way you reduce the raw amount of job you need to do to few selected meaningful lines, hopefully keeping this relatively cheap. If you keep this additional sound effect language-neutral you can also avoid translation costs ( maybe if they scream \"Teemooo!\" ) and avoid foreign voiceover procession ( so you don' t have to work directly on other VO files ).\n\nAlso a reminder - if you go for the screams remember to make them recognizable as a part of the Teemo voice over, else people might get worried for stuff happening in real life xD\n\nYou pick up a bunch of rioters and lock them in a room with a big screen playing Teemo gameplay and you record them :D","replies":[]}]},{"poster":"77BMYlzuGp","date":"2016-10-05T12:12:42.285+0000","up_votes":5,"down_votes":0,"body":"Tbh I was thinking just going over his original voice with the same kind of satanic reverb he has on his recall, that'd probably be a cheap and effective method to making this skin more... Devily.","replies":[{"poster":"TheEdgeOfDestiny","date":"2016-10-05T12:22:37.969+0000","up_votes":3,"down_votes":0,"body":"Hmm. This actually is an idea.\n\nThey did smth similar on Project skins.","replies":[]},{"poster":"EtherealGalaxy","date":"2016-10-06T14:05:58.722+0000","up_votes":1,"down_votes":0,"body":"This would be perfect, honestly. It would still maintain the voice lines that we're so use to fearing, but it would add some even more super spooky and chilling vibes to the skin. Honestly, this could help keep the price fairly the same, with just a bit of tweaking of the audio distortion.","replies":[]}]},{"poster":"Ultîma","date":"2016-10-06T21:58:42.759+0000","up_votes":2,"down_votes":0,"body":"Honestly, tweaks to the VO would make this skin an instabuy from me. This seems like the biggest wasted opportunity for this skin.","replies":[]},{"poster":"Astôlfo","date":"2016-10-05T19:47:44.748+0000","up_votes":2,"down_votes":0,"body":"A Rioter said they are not planning to do any voice changes.","replies":[{"poster":"Wonderlands","date":"2016-10-05T19:51:33.645+0000","up_votes":1,"down_votes":0,"body":"Receipt?","replies":[{"poster":"Astôlfo","date":"2016-10-05T19:54:55.020+0000","up_votes":2,"down_votes":0,"body":"http://boards.na.leagueoflegends.com/en/c/miscellaneous/PdpTtqU5-little-devil-teemo-needs-one-thing?comment=0003","replies":[{"poster":"Wonderlands","date":"2016-10-05T20:00:48.838+0000","up_votes":1,"down_votes":0,"body":"DAMMIT NOOOOOOO!!!!!","replies":[]}]}]}]},{"poster":"ΖΟΝΞ","date":"2016-10-05T12:27:23.359+0000","up_votes":2,"down_votes":0,"body":"Yes! Full VO with a lower pitched more devil-ish voice would do the trick IMHO.","replies":[{"poster":"TheEdgeOfDestiny","date":"2016-10-05T19:46:02.780+0000","up_votes":1,"down_votes":0,"body":"I double lowered pitch.","replies":[]}]},{"poster":"Jelapi","date":"2016-10-12T22:42:57.264+0000","up_votes":1,"down_votes":0,"body":"A feature I would've liked to see was that Teemo could open his demonic eyes while stealthed..\n\nIdk just sayin'","replies":[{"poster":"TheEdgeOfDestiny","date":"2016-10-13T11:22:00.953+0000","up_votes":1,"down_votes":0,"body":":D That is sooo cool! And funny. And creepy. That is why cool.","replies":[]}]},{"poster":"Ozzie Storm","date":"2016-10-05T12:29:17.170+0000","up_votes":1,"down_votes":0,"body":"I hope they tweak his VO similar to Demon Vi (which costs just as much). No need for any extra lines just adding a demonish filter would be awesome.","replies":[{"poster":"Meep Man","date":"2016-10-05T13:49:19.638+0000","up_votes":1,"down_votes":0,"body":"Yeah, I hope they add something like this. While the skin's legendary theme that is so fitting for the champion deserves a ton, it feels like a 975 RP skin from when I played it on the PBE. A demon voice filter would really make it feel worth it to me, especially if it modified his laugh to be like his recall laugh, because I want my opponent to be hearing that 24/7 without me having to constantly fake recall.","replies":[]}]}]}