{"poster":"s3 Clover s3","date":"2015-07-01T10:56:15.940+0000","title":"Thornmail vs Warmogs","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Could someone please do the math; which item is better vs 3-5 AD champion teams.\r\nConsidering LW, YG, BC, all the abilities that champions have to reduce/penetrate armour and based off of feel as playing a tank I think straight health is better than straight armour which leads me to think some balancing needs to happen.\r\n\r\nI&#039;m too lazy so someone figure the math for me please &lt;3!","replies":[{"poster":"JayQue","date":"2015-07-01T12:42:53.948+0000","up_votes":1,"down_votes":0,"body":"Warmogs niche is for the passive, which gives insane health regeneration allowing to to come back from low health without being forced to back. It only has a couple hundred health over most of the other high health items.\nThornmails niche, as said before, is for countering high damage squishy ad auto attack champions, usually those building crit. Something fun to remember with thornmails, is that 30% is calculated BEFORE your armour reducing the damage, as well as any other fun little damage reduction, so stack 300 plus armour and laughing as their puny attacks kill themselves can be fun.\nSo the math isn't the point on these items, as they are largely situational. If you are getting pokey down under yur tower and want some serious staying power to stay alive, build warmogs. If you have an auto attacking crit champion 2 hitting you before you can hit him very hard, get thornmail.\n\nRanduins is a popular item because it gives a bit of both, with high health and armour, but also giving you an attack speed SLOW which will reduce their output more than the armour or health from wither warmogs of thornmail would give. try googling some of the theory crafting behind this as there are some very smart people (some even work at riot) who have crunched all these numbers before. \n\nMost of the things that penetrate armour are flat reductions, such as the popular riven item of the brutalizer, which takes a flat chunk from your armour (in the riven case, lets say he has brutalizer and flat armour pen marks, totally roughly to 20 flat armour pen)\nif you have armour of 30, it would ignore the first 20 leaving you with 10 armour.\nLast whisper, the armour penetration masteries, caits new/soon to be new passive work by taking a percentage of your armour away before during damage.\nSo if you have 200 armour, and they have last whisper (35%),\n200 - (200 x 0.35) = 130\nCompared to a Youmuus ghostblade (20 flat penetration)\n200 - 20 = 180\nBoth items\n200 - (200 x 0.35) - 20 = 110 (as % armor pen now calculated before flat pen)\n\n/end rant wow that went longer than I was expecting. Hope it helped","replies":[{"poster":"s3 Clover s3","date":"2015-07-01T17:00:50.416+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JayQue,realm=OCE,application-id=FjGAIbRv,discussion-id=0ZEBG2ye,comment-id=0001,timestamp=2015-07-01T12:42:53.948+0000)\n>\n> Warmogs niche is for the passive, which gives insane health regeneration allowing to to come back from low health without being forced to back. It only has a couple hundred health over most of the other high health items.\n> Thornmails niche, as said before, is for countering high damage squishy ad auto attack champions, usually those building crit. Something fun to remember with thornmails, is that 30% is calculated BEFORE your armour reducing the damage, as well as any other fun little damage reduction, so stack 300 plus armour and laughing as their puny attacks kill themselves can be fun.\n> So the math isn't the point on these items, as they are largely situational. If you are getting pokey down under yur tower and want some serious staying power to stay alive, build warmogs. If you have an auto attacking crit champion 2 hitting you before you can hit him very hard, get thornmail.\n> \n> Randuins is a popular item because it gives a bit of both, with high health and armour, but also giving you an attack speed SLOW which will reduce their output more than the armour or health from wither warmogs of thornmail would give. try googling some of the theory crafting behind this as there are some very smart people (some even work at riot) who have crunched all these numbers before. \n> \n> Most of the things that penetrate armour are flat reductions, such as the popular riven item of the brutalizer, which takes a flat chunk from your armour (in the riven case, lets say he has brutalizer and flat armour pen marks, totally roughly to 20 flat armour pen)\n> if you have armour of 30, it would ignore the first 20 leaving you with 10 armour.\n> Last whisper, the armour penetration masteries, caits new/soon to be new passive work by taking a percentage of your armour away before during damage.\n> So if you have 200 armour, and they have last whisper (35%),\n> 200 - (200 x 0.35) = 130\n> Compared to a Youmuus ghostblade (20 flat penetration)\n> 200 - 20 = 180\n> Both items\n> 200 - (200 x 0.35) - 20 = 110 (as % armor pen now calculated before flat pen)\n> \n> /end rant wow that went longer than I was expecting. Hope it helped\n\nI'm meaning those two items after you have built other ad/health items vs full ad teams, not just vs an adc or one bruiser in a lane. In truth ADC's aren't a problem at all as usually all they will get is a LW, it's those bruiser teams who stack these items and can one shot tanks who have 400 armour and 4000 health - the point being engaging as a tank is useless as you will just die. It makes me wonder if trading off 100 armour for 800 health is better.\n\nFrom your math use and what you said it seems like armour pen items are a lot more cost efficient than thornmail in this situation still, which proves my point - A flat ad item is worse off than a health item vs ad teams.","replies":[{"poster":"JayQue","date":"2015-07-04T03:58:29.376+0000","up_votes":1,"down_votes":0,"body":"If they are all building a last whisper, then you would obviously build more health than armour. Because what you buy depends on what they buy. Hence situational.\nWe can all complain about one aspect of the game or another. Yes, a late game adc who is fed will kill you, regardless of build. If you get fed and an adc doesn't then you will likely kill them depending on your team. that's a fact. \n\nBut this is a team game, some characters have a low base stat and damage then others, but make up for it in cc and utility. Some champions have a power spike at low points in the game, others have it late game. There is plenty of places both with video and without doing theory crafting, tips and advice, that's where you should start looking for more information. I cant stress enough to look at some previous stuff done by theory crafters since they have already crunched allllll these numbers.\n\nFor some useful info, beware some may be old:\nhttps://youtu.be/HN-d8mlsnqM\nhttp://leagueoflegends.wikia.com/wiki/Armor\nhttp://forums.euw.leagueoflegends.com/board/showthread.php?t=1241131","replies":[{"poster":"JayQue","date":"2015-07-04T04:03:16.850+0000","up_votes":1,"down_votes":0,"body":"Another great link for all theory crafting behind armour- you lazy sod\n\nhttp://www.funendshere.com/theorycrafting-basics-effective-health/","replies":[]}]}]}]},{"poster":"JasonWazza","date":"2015-07-02T10:31:21.618+0000","up_votes":1,"down_votes":0,"body":"Or you could just have both.","replies":[]},{"poster":"Lauricella3","date":"2015-07-02T01:01:08.954+0000","up_votes":1,"down_votes":0,"body":"warmogs is just straight up bad. if you are trying to tank physical damage sunfire/randuins and frozen heart and much better.","replies":[]},{"poster":"McRuthless","date":"2015-07-01T22:36:56.647+0000","up_votes":1,"down_votes":0,"body":"Depends how much hp and armor you already have. Also keep in mind that thornmail is significantly cheaper AND has an offensive passive, so you shouldn't be expecting godlike tankiness from it.","replies":[]},{"poster":"Chicken4dinner","date":"2015-07-01T15:47:05.583+0000","up_votes":1,"down_votes":0,"body":"Thronmail is good against idiots who buy crit and attack speed \n\nWarmogs is good for anybody","replies":[]},{"poster":"Focus On End","date":"2015-07-01T12:17:02.729+0000","up_votes":1,"down_votes":0,"body":"thornmail isn't for stopping ad casters it's for stopping ad AA's, and health and thornmail go hand in hand so...","replies":[]}]}