{"poster":" Nai Khanomtom","date":"2018-04-20T21:48:33.930+0000","title":"Genuinely Confused.","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"So, i get mid fair and square it&#039;s my lane not an issue in the world. \n\nAt this point i have my champ selected runes are being made and then on the corner of my eye i see a yasuo lock in i was skeptical at first until i saw an exhaust and thought he was just doing some hype shit in bot lane. \n\nHe then proceeds to take my lane farm and Xp and at roughly 12 minutes my internet drops out which is common i join back 3 minutes later and then the team votes to surrender which i gladly said yes to. At this point i&#039;m greeted with a 5 low priority Queue for leaving when i was gone for approximately 3 minutes and joined back as fast as i could. \n\nNow this is why i&#039;m confused i can have someone intentionally take my lane and troll nothing happens but god forbid i leave for 3 minutes due to connection issues. Like what is this so called &quot;Improved&quot; system where people are punished because i report in so many instances people feeding (ON purpose) and nothing happens to them????\n\nI just want to know if this is a common issue and if the community can give me some insight as to why this is a thing :D.\n\n:EDIT: I don't see why they can't just add like a timer so essentially if i'm gone for less then 10 minutes it doesn't count. Not an instant 5 low priority Queue if i leave cause like i've stated it's common for my net to drop out and i'm sure same might have the same issue. ","replies":[{"poster":"Kizeod","date":"2018-04-21T04:14:43.496+0000","up_votes":3,"down_votes":0,"body":"Because that 3 minutes is absolutely fucking vital you scumbag. It should have been instant perma-ban","replies":[]},{"poster":"Gloric","date":"2018-04-20T21:51:45.681+0000","up_votes":2,"down_votes":0,"body":"Welcome to the shittiest punishment system implemented in recent history.","replies":[]},{"poster":"KAYN BRINGS PAIN","date":"2018-04-22T04:33:03.859+0000","up_votes":1,"down_votes":1,"body":"If you want add me i'm gonna cause a riot with riot i'm gonna try get everyone from LOL community that has been permabanned/wrongfully accused and make a massive case against these guys i recommend it would be the best option for us normal people taking on a corporate giant. We shall stand tall","replies":[]}]}