{"poster":"trick2chooch","date":"2018-01-06T20:11:24.492+0000","title":"LEAGUE NEEDS AN 18+ SETTING","subforum":"General Discussion","up_votes":1,"down_votes":15,"body":"THIS WAS MY COMPLAINT TO RIOT AND THIS NEEDS TO BE ADDRESSED NOW. NOT EVERY PLAYER HAS THE ABILITY TO LET PEOPLE GET AWAY WITH BEING TOXIC WITHOUT BEING TOXIC BACK. WE ARE ALL HUMANS AND MAKE MISTAKES THAT DOESN&#039;T MEAN WE MUST BE FORCED TO LOSE THE COUNTLESS HOURS AND COUNTLESS AMOUNTS OF MONEY SPENT ON THIS GAME TO JUST BE THROWN AWAY BECAUSE OF SOME &quot;BAD WORDS&quot;.\r\n\r\nhow as a company can you people sit there and allow players to be harassed and in my case be harassed stand up for myself and then mute them and then be banned for it. terrible banning system terrible gaming community and a terrible organization are the adjectives i would describe this community, game, and company. you cant go and ban players who stand up for themselves in game and at the same time ban players for getting angry at toxic players. those two instances go hand in hand and this company needs to review its banning protocols because its theft of the money we players have spent on this game just to have it all thrown away because other players are ruining the game for others and making them angry resulting in replying to toxic behavior and being banned for it. I for one am on the side of getting rid of the banning system except for int feeding and hacking or cheating in any way. But your organization put a mute button on this game for a reason and toxic players being toxic towards each other is not and should not be considered bannable behavior if someone is being toxic mute them if not and you continue with them then ur responsible for it but being toxic towards each other reporting each other and getting both players banned for being toxic towards each other does nothing for the players but throw the money we gave to YOU RIOT to the dumpster and its wrong and immoral. Please send this to someone with the power to make it known that you need an 18+ setting where the banning system against toxicity is banished because as adults we are all responsible for actions and words and should be able to be mature enough to either be toxic back and forget about it or just ignore it altogether because gaming=anger and anger=toxic THATS GAMING and as a gaming company not realizing that is just plain ignorant and dumb. Please take this serious because i love this game but the banning system along with toxic players is wrong and just sets people up to lose time and money we have put into this game.","replies":[]}