{"poster":"Serious the Sun","date":"2017-05-03T16:11:49.199+0000","title":"Trollare è una cosa bella.","subforum":"Discussioni generali","up_votes":4,"down_votes":6,"body":"L'arte del trolling.. chi non l'ha mai fatto su Lol? :D\nNon so se molti di voi piace trollare con vari champion in varie lane, ma io quando ho voglia di trollare in NORMAL dico: se devi trollare, trolla bene. Nel senso che, se devi usa un champion da tutt'altra parte della mappa con una build strana, almeno fa del tuo meglio e non complicarti troppo la vita. Devo fare una confessione: è da quando seguo Kyrenis che ho iniziato a trollare nella maniera giusta su League of Legends. \n{{champion:18}} MID FULL AP\n{{champion:11}} TOP TANK/AD\n{{champion:53}} TOP AD / MID AP (per queste troll OVVIAMENTE devo ringraziare il gran maestro Kyyyrenis e anche TheRandomYordle :D e il Paolone direte? No, non sono benedetto in support col grab.. perdonami Paolo X&#039;D)\n\nE tanti altri che ho provato e che tutt&#039;ora provo. Queste perch&eacute;. Secondo me trollare in questo modo &egrave; una cosa giusta perch&eacute; impari di pi&ugrave; sui champion e soprattutto ti intrattiene di pi&ugrave; il gioco, facendoti divertire senza farti annoiare. ;)\n \nE voi? Trollate molto su Lol e in che build e champion vi piace trollare?","replies":[{"poster":"Sorcio84","date":"2017-05-03T19:09:05.023+0000","up_votes":2,"down_votes":1,"body":"{{champion:17}} top ad\n{{champion:17}} mid cdr\n{{champion:17}} jng aspd\n{{champion:17}} adc con item da tiratore ap\n{{champion:8}} supp cdr warmog","replies":[{"poster":"Serious the Sun","date":"2017-05-03T19:10:33.752+0000","up_votes":2,"down_votes":0,"body":"non ti conosco ma penso già di odiarti XD","replies":[{"poster":"Sorcio84","date":"2017-05-04T08:51:33.896+0000","up_votes":1,"down_votes":0,"body":"{{champion:29}} _lololololol <3_","replies":[]}]}]},{"poster":"superkey97","date":"2017-05-03T21:27:36.075+0000","up_votes":2,"down_votes":1,"body":"Sion support, zac support, kennen support, rengar tank support, rek sai ap support. Ricordate bambini, che se volete trollare, andate support, la vostra trollata si noterà di meno ;)","replies":[]},{"poster":"Capitan Mestolo","date":"2017-05-04T09:56:13.869+0000","up_votes":1,"down_votes":0,"body":"Strano, io tempo fa contattai il supporto per chiedergli una curiosità riguardo al trolling e mi han risposto chiaramente \"Puoi farlo, nessuno te lo vieta e non sei reportabile, A PATTO che non comprometti il game altrui e riesci a portare un beneficio per la squadra.\" \nErgo,puoi farlo ma con moderazione e con una logica. \nOvvio che girerebbero anche a me le balle vedere qualcuno che picka un champ in una lane non sua e finisce con 0/20,ma se tipo qualcuno mi finisce con 11/1\n Mi va più che bene. \nE fidati pure io mi sono beccata le offese dal team avversario e prese per il culo quando feci VI AP(nomino tale champ poiché è il mio main\"\n\"nice build xdxd\" \"that build\" \"omg vi full ap\"\nHo semplicemente mutato e ho continuato a giocare.","replies":[]},{"poster":"Il Freddo","date":"2017-05-03T23:41:21.506+0000","up_votes":1,"down_votes":1,"body":"Trillo in ranger quando mi marchiano con persone troppo scarse e la partita diventa irrecuperabile, altrimenti no. Non mi diverto","replies":[{"poster":"Pellah","date":"2017-05-04T06:53:11.946+0000","up_votes":2,"down_votes":2,"body":"\"TRADUZIONE AUTOCORRETTORE: Trollo in ranked quando mi matchano con persone troppo scarse e la partita è irrecuperabile, altrimenti no. Non mi diverto\"\n\nComunque... lo trovo un comportamento scorretto e spero tu venga reportato ogni volta, anzi spero che un mod leggendo il tuo commento prenda provvedimenti ^^","replies":[{"poster":"Capitan Mestolo","date":"2017-05-04T08:02:51.629+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pellah,realm=EUW,application-id=MJVj50Jw,discussion-id=zlLo5NP3,comment-id=00090000,timestamp=2017-05-04T06:53:11.946+0000)\n>\n> &quot;TRADUZIONE AUTOCORRETTORE: Trollo in ranked quando mi matchano con persone troppo scarse e la partita è irrecuperabile, altrimenti no. Non mi diverto&quot;\n> \n> Comunque... lo trovo un comportamento scorretto e spero tu venga reportato ogni volta, anzi spero che un mod leggendo il tuo commento prenda provvedimenti ^^\n\nPeccato che abbia detto che lui lo fa in NORMAL e non in ranked.\nE no, nessuno prenderà provvedimenti visto che se lui trolla con una build non consona ad un champ che normalmente builda altro e porta comunque un beneficio per la squadra non é reportabile. \nCapisco in ranked, ma in normal fate fare quel cazzo che pare a chi vuole per una volta uscire dagli schemi e divertirsi un pò. \nQuando feci Soraka Adc vinsi praticamente la lane, top mid erano messi molto male, eppure nessuno mi ha reportato. \nQuando feci VI AP ho praticamente carriato il game, e non sono stata reportata. \nRelax gente, se dovete prendere competitivamente anche le normal siete messi male eh.","replies":[{"poster":"Pellah","date":"2017-05-04T09:31:11.066+0000","up_votes":1,"down_votes":0,"body":"1) Quindi ranger per cosa sta? Dove leggi  che lo fa in normal?  ( anche il mio autocorrettore traduce ranked in ranger)\n2) se vuoi trollare lo fai con altri 4 amici premade a molte persone può dar fastidio trovarsi troll.\nInoltre una volta feci un ticket che eravamo in 5 amici che trollavamo e l'intera squadra nemica ha cominciato a offenderci pesantemente,  anche se noi non abbiamo ricambiato le offese il moderatore mi ha detto di evitare questo tipo di comportamenti (trollare) anche se si è in 5 rimane un comportamento antisportivo. \n\n\nPer questo ultimo motivo sono certo che la RIOT non approva questo genere di comportamenti, che sia nornal o ranked .","replies":[]}]}]}]},{"poster":"Hariberü","date":"2017-05-04T07:56:43.819+0000","up_votes":1,"down_votes":0,"body":"Mai trollato...sono troppo seria...","replies":[]},{"poster":"Nabbomaster","date":"2017-05-03T16:51:35.609+0000","up_votes":1,"down_votes":0,"body":"questi sono fuori meta, i troll vanno di zed full ap","replies":[{"poster":"mangialavandini","date":"2017-05-04T07:56:23.195+0000","up_votes":1,"down_votes":0,"body":"vai di Xaya full AP\n\nNEW BUILD  100% AP  EASY WIN RANKED!!!","replies":[]}]},{"poster":"DANJERpuntoEXE","date":"2017-05-04T07:56:13.308+0000","up_votes":1,"down_votes":0,"body":"Le.migliori build \"troll\" le faccio con la guinsoo(possibilità infinite) o col manamune.\nMa principalmente anch'io mi diverto a giocare i champ non di ruolo support(i rengar, Sion, shaco, JINX, KALISTA, ekko) in ranked. Il bello? Che trollando vinco.","replies":[]},{"poster":"Nice Doggo","date":"2017-05-04T06:45:53.888+0000","up_votes":1,"down_votes":0,"body":"Io sopratutto in aram... \n\nBard buildato adc\nZilean adc\nLux adc\n\n\nE con bard ho vinto la lane contro illaoi..\nIn ranked, pensavo di essere supp.. buildato come un adc(non è un riferimento al ragazzo con nami qua su)","replies":[]},{"poster":"FuryTheFenix ITA","date":"2017-05-03T16:48:35.343+0000","up_votes":1,"down_votes":0,"body":"Nami Top full AP\n\nHo battuto Illaoi.....rito pls","replies":[]},{"poster":"Kim114","date":"2017-05-03T16:13:26.669+0000","up_votes":1,"down_votes":0,"body":"dimentichi Fierik","replies":[{"poster":"Serious the Sun","date":"2017-05-03T16:22:03.654+0000","up_votes":1,"down_votes":1,"body":"Perdonami se non l'ho nominato ma se devo parlare dello youtuber che seguo di più che tratta Lol, rispondo subito Kyrenis :D","replies":[{"poster":"Kim114","date":"2017-05-03T16:32:48.131+0000","up_votes":1,"down_votes":0,"body":"siamo daccordo","replies":[]}]}]},{"poster":"LightIsMyPath","date":"2017-05-03T20:02:28.805+0000","up_votes":1,"down_votes":1,"body":"Tristana mid full ap l'ho provata anche io xD . Annie top roa protobelt e full tank lissandra support full tank Orianna adc con build atk speed Lulu top attack speed","replies":[]},{"poster":"Capitan Mestolo","date":"2017-05-03T18:08:48.277+0000","up_votes":2,"down_votes":2,"body":"{{champion:37}} Jungler\n{{champion:254}} AP Jungler (cosa che sto facendo ultimamente °L°)\n{{champion:51}} AP (quando ap aveva solamente la e lel)\n{{champion:16}} ADC\ne penso basta °L°","replies":[]},{"poster":"xBlitza","date":"2017-05-03T17:30:12.284+0000","up_votes":1,"down_votes":1,"body":"{{champion:22}} JGL opop","replies":[]},{"poster":"sxrrxwland","date":"2017-05-03T17:27:38.606+0000","up_votes":1,"down_votes":1,"body":"Draven toplane\nBard in ogni ruolo \nJayce adc\nOvviamente il mio preferito è Bard.","replies":[]}]}