{"poster":"Serious the Sun","date":"2017-05-26T15:30:41.306+0000","title":"Quando ti sale l'hype per la skin perché sei povero","subforum":"Discussioni generali","up_votes":6,"down_votes":0,"body":"Mettiamo in chiaro una cosa: io sono povero. Non sono uno che non appena vede una skin nuova e figa se la compra manco avessi un padre che &egrave; una banca umana, ma sono uno che sa accalappiare l&#039;ESSENZIALE al momento giusto. In poche parole, sono un poveraccio che sfrutta il periodo sconti. XD \r\n\r\nOvviamente non aspetto solamente il periodo degli sconti settimanali, ma anche i negozi speciali e gli hextech, per&ograve; a volte mi capita una skin per un champion, che sia uno che ho gi&agrave; oppure per uno che avevo in mente di comprare. Per&ograve; alle volte, quando ricevo una skin mi sale l&#039;estasi a tal punto da usare quel champion per un casino di tempo fino a mainarlo. Per esempio? {{champion:103}}  popstar; {{champion:89}} PROGETTO; {{champion:19}} Predone e adesso {{champion:81}} Pulsefire.\r\n\r\nInfatti talmente impazzisco che quando uso Ezreal Pulsefire urlo: Perch&eacute; FRULLATO &egrave; MEGLIO! Oppure quando uso Blitzcrank bestemmio il Paolone (sono disposto a credere che se mi capita una skin per {{champion:64}}  passer&ograve; tutto il tempo a portalo al lv. 6 e a urlare a ogni Q MARONNE KICK!)\r\n\r\np.s: sono disposto a credere che solo a me capitano queste cose assurde. X&#039;D","replies":[{"poster":"LoSgherro","date":"2017-05-26T15:46:40.329+0000","up_votes":2,"down_votes":5,"body":"Hai mainato Ahri, non sei degno.\n","replies":[{"poster":"Serious the Sun","date":"2017-05-26T15:56:10.621+0000","up_votes":1,"down_votes":0,"body":"\"A volte mi capita di mainarlo\" leggi bene XD","replies":[{"poster":"LoSgherro","date":"2017-05-26T16:05:43.812+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Serious the Sun,realm=EUW,application-id=MJVj50Jw,discussion-id=OrydngxK,comment-id=00000000,timestamp=2017-05-26T15:56:10.621+0000)\n>\n> &quot;A volte mi capita di mainarlo&quot; leggi bene XD\n\nTi è capitato di mainare Ahri, non sei degno.","replies":[{"poster":"NOLIMIT Vladimir","date":"2017-05-26T17:10:58.717+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=LoSgherro,realm=EUW,application-id=MJVj50Jw,discussion-id=OrydngxK,comment-id=000000000000,timestamp=2017-05-26T16:05:43.812+0000)\n>\n> Ti è capitato di mainare Ahri, non sei degno.\n\nCome mi disse un Francese che stavo discriminando in chat per essere francese: i Report you for racism","replies":[]}]}]}]},{"poster":"Capitan Mestolo","date":"2017-05-26T22:59:29.870+0000","up_votes":1,"down_votes":0,"body":"E' sempre un bene approfittare dei saldi e degli sconti del proprio negozio.\nQuando ci fu il negozio personale verso dicembre (?) non mi sono lasciata sfuggire {{champion:50}}  Tiranno e {{champion:121}} Bocciolo Mortale entrambe a 292 RP(e potete immaginare che dopo averle prese ho cominciato a giocare i due suddetti champ in modo frequente)...delle volte se ci stanno delle skin in saldo le prendo se mi interessano,altrimenti se ho un pò di fortuna e che magari non ho uno spicciolo da spendere provo a trovarle tramite chest.\nTipo {{champion:81}} Pulsefire lo trovai rerollando tre skin a caso,non lo uso molto ma ehi,è pur sempre una suprema nella propria collezione,non mi lamento molto.\nLa cosa che mi ha rattristato molto fu che quando uscì la skin di VI dei Regni in Guerra ci stava un mio amico che me l'aveva promessa come regalo anticipato di compleanno ma per un problema non è riuscito a farlo.E quindi l'ho dovuta prendere io anche se odiavo il fatto di rimetterci 1350 (che ehi è più che giusto come prezzo non è una lamentela ma io sono abituata dell'idea che se costano più di 975 non le prendo...o al massimo aspetto i saldi)\nma va beh non mi lamento troppo,alla fine l'ho ottenuta x)","replies":[]},{"poster":"Sorcio84","date":"2017-05-26T21:25:51.629+0000","up_votes":1,"down_votes":0,"body":"beh io ho regalato omega{{champion:17}} ad un amico e mi è ritornata indietro coi bauli.\npoi ho elemental {{champion:99}} \ndunkmaster {{champion:122}} \ntutte prese dai bauli. Sono un poveraccio anche io ma il culo aiuta.\n\nBasta solo farmare bauli e chiavi e pregare il tuo dio :P\nanche io sfrutto gli sconti quando posso","replies":[]}]}