{"poster":"iFerocious","date":"2015-11-14T05:36:17.201+0000","title":"no rank rewards","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"so i logged into league today and i see everybody with their new icons, therefor they have gotten their rewards. But im here with nothing at all. I go to my profile and i see no border or anything ( plat btw ). \r\nIm really curious is anyone else getting this? or is it just me.{{item:3070}}","replies":[{"poster":"Wuks","date":"2015-11-19T21:12:24.027+0000","up_votes":1,"down_votes":0,"body":"If anyone has not yet received their rewards and they believe they qualify, please contact Riot Games Player Support:\n____________\nBecause this is an account-specific inquiry, we can’t help you out here on the Boards. As such, you’ll want to direct this to Riot Games Player Support by [**submitting a ticket**](https://support.riotgames.com/hc/en-us)! As you submit your request, here are some tips that will help resolve this issue as quickly as possible: \n\n\n1. Create an account on the Riot Games Support website. It'll save you a lot of time in the future and keep your requests organized and easier to find/access. \n2. Be sure to submit as much information in your initial ticket as possible. For obvious reasons, each Player Support Specialist's request for more information will delay the resolution of the issue.\n3. Be respectful and polite in your correspondences with Riot Support. (They're doing their best to help you!)\n4. Try not create a new ticket or respond to an existing ticket before a Player Support Specialist has had the chance to review your request. New tickets/replies may bump your ticket back to the bottom of the queue, thus increasing the amount of time before a Player Support Specialist is able to review your ticket.  \n\n\n**If you're unsure where to put your ticket in, just select:**\n[*I have a question about League of Legends/Riot Games.*] > [*Game and Features*] > [*General Questions*]\n\n\nWith that being said, good luck!","replies":[]},{"poster":"LeeSinuous","date":"2015-11-15T05:09:01.773+0000","up_votes":1,"down_votes":0,"body":"Would be nice to get a rito response. I do know they said up until the 17th, but I don't recall this ever happening before in the past.\n\nAlso I would like to know whether I will be receiving a Diamond or Plat rewards... I transferred after the end of Season on NA and after the end of Season on OCE as a Diamond from NA... But got placed in PLat 2 as per usual in OCE.","replies":[]},{"poster":"Talon12","date":"2015-11-15T01:17:58.462+0000","up_votes":1,"down_votes":0,"body":"same here, haven't been banned, haven't got anything","replies":[]},{"poster":"LeeSinuous","date":"2015-11-14T10:54:24.109+0000","up_votes":1,"down_votes":0,"body":"I also haven't received my Diamond Border. But my S4 Diamond Border is gone. I haven't been banned either :/ Kinda stressing me out haha","replies":[{"poster":"Talon12","date":"2015-11-15T01:17:06.706+0000","up_votes":1,"down_votes":0,"body":"ditto (with boarder part)","replies":[]},{"poster":"Scroto Saggins","date":"2015-11-14T23:14:47.787+0000","up_votes":1,"down_votes":0,"body":"yea its annoying to be honest","replies":[]}]},{"poster":"Scroto Saggins","date":"2015-11-14T06:27:44.255+0000","up_votes":1,"down_votes":0,"body":"i have got the same problem","replies":[{"poster":"iFerocious","date":"2015-11-14T09:29:07.581+0000","up_votes":1,"down_votes":0,"body":"yea, i havent been banned or anything, good 2 know ur not the only one.","replies":[]}]}]}