{"poster":"Maximise","date":"2018-07-17T13:27:13.405+0000","title":"Oggi alle 17.00 quest?","subforum":"Discussioni generali","up_votes":2,"down_votes":5,"body":"Buon pomeriggio, sono Matilde e sono alla ricerca di giocatori di livello 15 o inferiori per finire la quest, sono fucking disperata perch&egrave; la gente che ho trovato qui non mi ha aggiunto/non siamo riusciti a trovarci con gli orari. Qualcuno &egrave; disponibile per oggi alle 17.00 circa? Devo fare la seconda e la terza missione, diciamo &quot;urgente&quot; la seconda😘.\r\nSe siete interessati addatemi puree","replies":[{"poster":"Floppyz","date":"2018-07-17T14:52:20.557+0000","up_votes":1,"down_votes":0,"body":"Se non riesci a trovare nessuno sul forum e hai fretta, prova a fare un salto sul server discord del forum: https://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/3wQbGuY0-server-discord-ufficiale-del-forum","replies":[{"poster":"Maximise","date":"2018-07-17T15:03:26.757+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Floppyz,realm=EUW,application-id=MJVj50Jw,discussion-id=tlT0dYWW,comment-id=0000,timestamp=2018-07-17T14:52:20.557+0000)\n>\n> Se non riesci a trovare nessuno sul forum e hai fretta, prova a fare un salto sul server discord del forum: https://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/3wQbGuY0-server-discord-ufficiale-del-forum\n\nGrazie, proverò.\nMa è normale che dando un'occhiata alle discussioni tutte abbiamo un feedback negativo sotto lo 0? non è che per caso c'è  un gruppo di simpatiche persone che non fa altro che mettere -1 al più possibile dei thread? è insana sta roba, sarebbe bene controllare.","replies":[{"poster":"Floppyz","date":"2018-07-17T15:07:25.890+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=UnsuitablePlayer,realm=EUW,application-id=MJVj50Jw,discussion-id=tlT0dYWW,comment-id=00000000,timestamp=2018-07-17T15:03:26.757+0000)\n>\n> Ma è normale che dando un&#x27;occhiata alle discussioni tutte abbiamo un feedback negativo sotto lo 0? non è che per caso c&#x27;è  un gruppo di simpatiche persone che non fa altro che mettere -1 al più possibile dei thread? è insana sta roba, sarebbe bene controllare.\n\nCapisco che possa dar fastidio, ma ognuno ha la possibilità di upvotare o downvotare post e topic, anche senza una buona ragione, quindi non far caso se alcuni contenuti che ti sembrano buoni hanno voti bassi :P","replies":[{"poster":"Maximise","date":"2018-07-17T15:54:18.013+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Floppyz,realm=EUW,application-id=MJVj50Jw,discussion-id=tlT0dYWW,comment-id=000000000000,timestamp=2018-07-17T15:07:25.890+0000)\n>\n> Capisco che possa dar fastidio, ma ognuno ha la possibilità di upvotare o downvotare post e topic, anche senza una buona ragione, quindi non far caso se alcuni contenuti che ti sembrano buoni hanno voti bassi :P\n\nNon condivido...","replies":[{"poster":"Floppyz","date":"2018-07-17T22:20:40.453+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=UnsuitablePlayer,realm=EUW,application-id=MJVj50Jw,discussion-id=tlT0dYWW,comment-id=0000000000000000,timestamp=2018-07-17T15:54:18.013+0000)\n>\n> Non condivido...\n\nTi ho solo detto come stanno le cose: ognuno ha il diritto di scegliere cosa gli piace e cosa no, nessuno può imporlo. :)","replies":[{"poster":"Maximise","date":"2018-07-18T09:29:52.072+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Floppyz,realm=EUW,application-id=MJVj50Jw,discussion-id=tlT0dYWW,comment-id=00000000000000000000,timestamp=2018-07-17T22:20:40.453+0000)\n>\n> Ti ho solo detto come stanno le cose: ognuno ha il diritto di scegliere cosa gli piace e cosa no, nessuno può imporlo. :)\n\nCertamente, non sto andando contro questo diritto, ma è strano che ci siano così tanti downvotes messi, a mio parere, in maniera casuale. Un conto è parlare di downvotes messi per giudicare quella discussione, un conto è parlare di quelli piazzati per divertimento, che non fanno altro che conferire ad una discussione (magari buona, positiva) un connotato negativo, e poi si sa, un downvote tira l'altro. Sinceramente non sono certo il primo player che afferma ciò, e quindi è probabile che un gruppo di persone (magari bambini, che ora come ora si stanno ripiegando su questo gioco) si divertano con così poco. Visto che non posso di certo controllare io, ho provato a chiedere se fosse possibile, ma non pretendo certo un rastrellamento, diciamo piuttosto che un controllo maggiore verso un forum così snobbato non farebbe male. Nessun risentimento.","replies":[{"poster":"Floppyz","date":"2018-07-18T21:36:32.595+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=UnsuitablePlayer,realm=EUW,application-id=MJVj50Jw,discussion-id=tlT0dYWW,comment-id=000000000000000000000000,timestamp=2018-07-18T09:29:52.072+0000)\n>\n> Certamente, non sto andando contro questo diritto, ma è strano che ci siano così tanti downvotes messi, a mio parere, in maniera casuale. Un conto è parlare di downvotes messi per giudicare quella discussione, un conto è parlare di quelli piazzati per divertimento, che non fanno altro che conferire ad una discussione (magari buona, positiva) un connotato negativo, e poi si sa, un downvote tira l&#x27;altro. Sinceramente non sono certo il primo player che afferma ciò, e quindi è probabile che un gruppo di persone (magari bambini, che ora come ora si stanno ripiegando su questo gioco) si divertano con così poco. Visto che non posso di certo controllare io, ho provato a chiedere se fosse possibile, ma non pretendo certo un rastrellamento, diciamo piuttosto che un controllo maggiore verso un forum così snobbato non farebbe male. Nessun risentimento.\n\nSì è strano (fino a un certo punto in realtà), ma anche se tirassimo fuori i nomi esatti di chi mette tanti downvote, poi quale sarebbe il passo successivo, un esame di quello che hanno downvotato, per poi rieducarli a farlo solo con i contenuti che qualcuno (chi?) giudica non meritevoli?\n\nLong story short, questo rientra nel libero arbitrio, visto che di fatto non nuoce nessuno, e per riassumere il mio consiglio, prendo in prestito le parole di qualcuno ben più saggio di me:\n\n>_Fama di loro il mondo esser non lassa\nmisericordia e giustizia li sdegna\nnon ragioniam di lor, ma guarda e passa_","replies":[]}]}]}]}]}]}]}]}