{"poster":"The Epic Slayer","date":"2015-02-13T16:21:15.773+0000","title":"El soporte no ayuda , alguien puede??","subforum":"Problemas Técnicos","up_votes":1,"down_votes":1,"body":"Aca les dejo mi charla que tuve cn el soporte, es imposible que te respondan claramente , te responden algo que tiene que ver cn el tema pero no es lo que yo busco , porque aparece que esta persona reanundo la partida\r\n\r\nYo\r\nMe acabo de encontrar cn un hacker estaba jgando aram cn un premade y depronto empezo a andar mal y depronto todos les salio reanudando conexion y a mi amigo le sale bahamutff8 ha reanudado la partida , yo busque info sobre el drop hacks y al parecer este es un caso , la imagen se las adjunto , me la mando mi amigo\r\n\r\nSupestamente Acaba de terminar la partida y me sale Esperando las estadisticas ... pero en lolnexus y lolskill muestra que la partida no termino\r\n\r\nacabo de tratar de ser especteador y cuando llega al 100% pasan unos 30 segundos y sale Error en la peticion ha fallado la peticion de datos al servidor de espectadores el juego va a cerrarse\r\n\r\nacabo de poner saltarse estadisticas y mi amigo parece que sigue en la patida , la partida no aparece en el historial y no recibi pi ni nada de eso y tampoco leeverbuster\r\n\r\nMi amigo se salio de la partida y le sale hubo un falo en la partida y le sale lo mismo que a mi pero no le sale lo de las estadisticas\r\n\r\nLa partida sigue y no acaba mas esto paso en el minuto 16 y a mi amigo le aparece partida abandonada\r\n\r\ntrate de entrar a los foros pero me sale en pantalla blanca y no me deja entrar y a mi amigo le sale que no puede establecer conexion cn el servidor\r\n\r\nRiot Uracan :\r\n\r\nSaludos Invocador,\r\n\r\nLamentamos las dificultades que has experimentado estos últimos días. Estamos conscientes de que la experiencia en el juego durante 2/10 no han sido óptimas. Este tipo de situaciones puede suceder por muchas razones diferentes, incluyendo cosas externas a nosotros y a ti, por lo que hacemos lo posible por minimizar cualquier efecto que puedan tener.\r\n\r\nLas dificultades de ese día resultan de un problema dentro nuestro centro de data en Chile. Un mantenimiento causo problemas para el servicio y afecto a todos en LAS. Tenemos mas información sobre eso aquí :\r\n\r\nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/UngNpYgv-resumen-desconexiones-de-febrero-10-305pm-chiarg\r\n\r\nEl tráfico se normalizo y vemos una conexión saludable a los servidores. De todas maneras, monitoreamos las conexiones a los servidores constantemente.\r\n\r\nEl sistema de derrota perdonada fue activado durante esta situación. El sistema de derrota perdonada fue creado específicamente para evitar estas situaciones. Este desactiva el sistema de penalización y previene que derrotas sean registradas. Desafortunadamente el sistema no es instantáneo. Toma unos cuantos minutos en ser activado. No podemos editar los registros de partidas por lo que no podemos cambiar una partida si esta no fue cubierta por el sistema de derrota perdonada.\r\n\r\nPedimos disculpas por los inconvenientes.\r\n\r\nYo:\r\n\r\nSe nota que esto es puro copy paste porque no leyeron lo que lei y porque le mandaron exactamente lo mismo a un amigo mio , el soporte esta para ayudar no para poner copy paste....\r\n\r\nDEEJAAM:\r\n\r\nSaludos Invocador,\r\n\r\nTodos los que encontraron problemas de conectividad en el tiempo que reportaste tu situación recibieron el mismo mensaje sobre lo ocurrido. El mensaje explica a que se debe le problema de conexion, el estado de la situación, y los pasos tomados para limitar el efecto de los problemas de conectividad. Adicional a esto, el mensaje reconoce las limitaciones con las que trabajamos al momento de enfrentar estas situaciones.\r\n\r\nEn resumen, tu caso no fue un drophack, tu caso resulta de mantenimiento de servidor el cual fue anunciado en los foros públicos con anterioridad. Aunque es un copy paste, la respuesta no solamente es correcta pero contiene toda la información necesaria sobre el caso.\r\n\r\nDeeJaam \r\nPlayer Support Specialist \r\nwww.leagueoflegends.com\r\n\r\nYo:\r\n\r\npero porque muestra que este tal reanundo la partida?\r\n\r\nAVENGATOR:\r\n\r\nHola de nuevo.\r\n\r\nEsto es porque hay un problema con el servidor y estamos tratamos de solucionarlos lo más rápido posible. Siento todos los inconvenientes. Te pido un poco de paciencia al respecto.\r\n\r\nUn saludo.\r\n\r\nSolo hay una regla: cazar o ser cazado\r\n\r\nYo:\r\n\r\npero porque mostraba que justo esa persona ha reanudado la partida?????\r\n\r\nhttps://support.riotgames.com/attachments/token/7f7HZA3DUhX11TJJogeq4SsUL/?name=Screen02.png","replies":[{"poster":"Derpsu","date":"2015-02-13T16:51:54.235+0000","up_votes":1,"down_votes":0,"body":"En todos los mensajes que te mandó el soporte te dicen que es por los problemas que tuvo el servidor ese día. Tampoco se entiende de qué te estás quejando, dices que había un hacker, ¿Cómo sabías que lo era? ¿No era más importante reportar el uso de hacks que preguntar por el mal funcionamiento del servidor?","replies":[{"poster":"The Epic Slayer","date":"2015-02-13T17:03:11.616+0000","up_votes":1,"down_votes":0,"body":"Lo que pregunto es porque decia esoque ha reanundado la partida , si fue problema de server porque aparecio eso","replies":[]}]}]}