{"poster":"TheWorstBard","date":"2017-08-09T04:03:38.778+0000","title":"Looking for duo - High Silver/Low Gold support main","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"I&#039;m a rakan main, looking for a duo that is constantly looking to improve, I love to practice my shotcalling and love to learn new \r\nthings about the game, I strive to be a better player and take criticism well. I&#039;ll duo with anyone with the same mindset and the same thick skin it takes\r\nto take criticism.\r\n\r\nhttps://oce.op.gg/summoner/userName=TheWorstBard\r\n\r\nThere&#039;s a link to my OP.GG page. \r\n\r\nFeel free to add me at any time, I do use discord and can download other programs for good comms!","replies":[{"poster":"TimingOfLords","date":"2017-08-09T16:36:12.714+0000","up_votes":1,"down_votes":0,"body":"I'm down. Currently S5, but about a month ago I was B3, so I've been climbing pretty decently considering I don't play ranked too often.\n\nI'm a Heimerdinger main, but I am able to play other people jungle, top, and mid to relatively decent standards. ADC is by far my worst role and I keep getting autofilled into it. Feelsbad. I use Flex queue to practice my off-roles because it's just flex and doesn't really mean anything. So I'm trying to get better at ADC.\n\nIf you're down, we can play some games and help each other improve. Personally, I enjoy criticism if I feel it's deserved. How else is someone supposed to learn from their mistakes? I am always looking to improve and am able to take responsibility for my mistakes. My main problem is mechanical skill, but I'm pretty decent (for silver, at least) when it comes to shotcalling and macro play in general. So I feel like I could help you out with that stuff, if need be.\n\nhttps://oce.op.gg/summoner/userName=TimingOfLords\n\nThat's my op.gg if you wanted to look.","replies":[]},{"poster":"Diavolo","date":"2017-08-09T13:11:02.110+0000","up_votes":1,"down_votes":0,"body":"Rakan main? Respect man considering i'm a rakan main myself but am bronze 2 cause trash af FeelsBadMan{{sticker:zombie-nunu-bummed}}","replies":[{"poster":"Diavolo","date":"2017-08-09T13:13:22.737+0000","up_votes":1,"down_votes":0,"body":"And lost my promos cause a bot lane FeelsBadMan {{sticker:zombie-nunu-bummed}}","replies":[]}]}]}