{"poster":"ŚkyRed","date":"2017-10-13T10:40:09.775+0000","title":"PBE neuer account. Game start nur braum als champ","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ok titel ist verwirrend.\r\nIch habe gerade mein neuen PBE acc bekommen und habe mich eingeloggt\r\nnt&uuml;rlich lvl 1 account aber auch 0 riot points oder blaue essencen.\r\n\r\nWollte dann einfach ein Normal spielen um halt zu leveln?!\r\nKonnte dann wie jeder andere in der Lobby nur BRAUM picken und somit konnte das game nicht starten\r\nund wir flogen alle raus. Dannach wurde ich automatisch wieder in die Que geschmissen aber ihc wollte da raus doch es blieb\r\nh&auml;ngen und ich war gezwungen mein lol zu schlie&szlig;en. \r\n\r\nwas ist das Problem gerade auf dem PBE?","replies":[{"poster":"Timethief49","date":"2017-10-13T10:53:10.766+0000","up_votes":1,"down_votes":0,"body":"Viele neue Spieler, die nicht verstehen, dass sie warten müssen, bis ihr Account geupdated wird und sie RP und blaue essence erhalten. Dauert bis zu 12h.","replies":[{"poster":"ŚkyRed","date":"2017-10-13T10:57:27.258+0000","up_votes":1,"down_votes":0,"body":"danke wusste ich selbst nicht ^^","replies":[{"poster":"DrYatty","date":"2017-10-13T11:08:33.525+0000","up_votes":1,"down_votes":0,"body":"Normalerweise dauert es 3-4 Stunden, dann solltest du dich einmal reloggen und dein Account sollte Level 30, BE und RP erhalten haben. \nIch empfehle dir aber nicht allzu oft zu reloggen da die Warteschlange heute sehr hoch ist(Over 9000 - Wartezeit: 40+ Minuten)","replies":[{"poster":"ŚkyRed","date":"2017-10-13T11:27:05.090+0000","up_votes":1,"down_votes":0,"body":"Danke ^^ ja ich warte schon 40 minuten ist mir aber recht egal :) ich habe ferien also freizeit","replies":[]}]}]}]},{"poster":"Megamaexx","date":"2017-10-13T10:54:02.358+0000","up_votes":1,"down_votes":0,"body":"Begib dich dazu am besten ins pbe-Forum, da wird sicherlich was dazu stehen. Hier der Link:\nhttps://boards.pbe.leagueoflegends.com/en/","replies":[]}]}