{"poster":"xFarkius","date":"2017-11-09T06:38:10.673+0000","title":"Verbesserungsvorschlag - Bansystem Draft/Ranked","subforum":"Champions & Gameplay","up_votes":1,"down_votes":3,"body":"Hallo LoL-Community, \n(Bitte wenigstens den Vorschlag lesen vor dem Abstimmen. Die Idee ist nicht ausgereift!)\n**Für die Lesefaulen die Idee findet ihr bei --> Vorschlag (etwas mittig vom Text)**\nich hatte letztens eine gute Idee (wie ich finde). Hier wie ich darauf gekommen bin: Ich finde das jetzige Bannsystem etwas weich und vorallem die Bann&uuml;berschneidungen &uuml;berhaupt nicht passend. Wir sind schon bei 139 (mit Zoe) Champions aber meiner Ansicht nach sollte es dem Spiel nicht zu sehr schaden wenn 10 Champions von 139 aus einem Spiel genommen werden. (139 -10 = 129 Spielbare Champions pro Spiel &uuml;brig).\n\nHier die eigentliche Idee: Man k&ouml;nnte doch jedem Spieler die Chance geben auf seinem Profil anzugeben welche Champions er am liebsten bannen w&uuml;rde (Ich w&uuml;rde jetzt sagen jeder darf 3 Champions ausw&auml;hlen, und nat&uuml;rlich soll die niemand anderes einsehen k&ouml;nnen).  Nat&uuml;rlich werden nicht alle 3 von jedem Spieler gebannt. \n\n**VORSCHLAG !!!**\nAusgangssituation: 10 Spieler in einer Lobby und jeder hat seine 3 Bans vorher im Profil festgelegt. Ein Programm kann jetzt ganz einfach berechnen welche Champions die meiste Banwunschrate haben. \n\nAlle Banw&uuml;nsche (insgesamt also 30 Champions: 3 pro Spieler) werden in einen Topf geworfen und ein Programm berechnet die 10 meistgew&auml;hlten Champions die dann automatisch vom System f&uuml;r die aktuelle Lobby gebannt werden. (Falls das System keine 10 Banns finden sollte kann ja innerhalb der Lobby abgestimmt werden, also: 8 Bans gefunden weil halt nicht jeder seine Liste gef&uuml;llt hat -&gt; Lobby stimmt &uuml;ber letzten 2 Banns ab).\n**ENDE VORSCHLAG!!!**\n\nEin kleines Problem habe ich dabei leider entdeckt: Wenn man das so implementieren w&uuml;rde, w&uuml;rden m&ouml;glicherweise auch Champions gebannt werden die ein bestimmter Spieler gerade Spielen wollte.\nKlar k&ouml;nnte ein Spieler in seiner Liste auch v&ouml;lligen Quatsch angeben aber das System bannt ja nur diejenigen Champions die die h&ouml;chste Rate haben (also am meisten als Banwunsch angegeben wurden). (Beispiel: Also es ist eine geringe Wahrscheinlichkeit, dass Teemo gebannt wird der nur einmal nominiert wurde im Vergleich zu einem Zed oder einem Rengar die 3 mal nominiert wurden)\n\nVorteile: \n- Es gibt **IMMER** 10 **VERSCHIEDENE** Bans. (Keine &Uuml;berschneidungen, weniger Frust)\n- Es gibt keine M&ouml;glichkeit irgendwelche &quot;Trollbans&quot; zu machen (a la: Hahaha ich banne jetzt einfach nichts/oder irgendwas was gar keinen Sinn macht.)\n- Es ist in gewisser Weise sehr fair da die Bans wirklich auf die aktuelle Lobby abgestimmt sind.\n\nIch hab mir das eigentlich nur &uuml;berlegt weil es wirklich mehr Champions gibt die ich gerne bannen w&uuml;rde (so an die 6-7 :D) aber nat&uuml;rlich ist es schon eine Menge wenn 10 Champions gebannt sind.\nTrotzdem finde ich, dass die Idee an sich ganz gut ist und auch auf keine Weise irgendwie unfair ist.\nAn der Umsetzung kann man bestimmt noch arbeiten aber meiner Ansicht nach ist das glaube ich ein weitaus besserer Weg als der jetzige. Vielleicht k&ouml;nnte man auch noch Gewichtungen angeben. \n\nBeispiel: Spieler: HansImGl&uuml;ck, Bannliste: 1. Rengar 2. Vayne 3. Master Yi\nSomit hat Rengar eine Gewichtung von 3, Vayne eine 2 und Yi eine 3. Ist nur eine Idee klar kann man so etwas auch wieder ausnutzen um andere Spieler zu &auml;rgern.\n\nW&uuml;rde mich &uuml;ber Kommentare und Meinungen dazu sehr freuen.\n\nDie umgedrehte, knurrende Schildkr&ouml;te AKA Growling Turtle {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Critical lmpact","date":"2017-11-09T07:37:53.279+0000","up_votes":1,"down_votes":0,"body":"1. viel zu „kompliziert“ und unflexibel\n\n2. (viel wichtiger): ich verliere die Möglichkeit die Bans an das matchup anzupassen... ich weiß zwar beim bannen nicht wen die Gegner picken, aber ich weiß was ich zumindest vorhabe zu picken und kann meinen Bann daran ausrichten. Was ich nicht kann, wenn ich mich vorher im Profil festlegen muss.","replies":[{"poster":"xFarkius","date":"2017-11-09T08:03:21.202+0000","up_votes":1,"down_votes":0,"body":"1. Was ist daran kompliziert du brauchst nur irgendwo 3 Champions angeben die du nicht magst und ein Algorithmus macht den rest...\n2. Das macht keinen Sinn, du bannst doch aktuell auch erst komplett bevor du anfängst zu picken (außer in Tournament Draft/Customs). Oder meinst du, dass du die Champs deiner Mates dann versehentlich bannst?","replies":[{"poster":"Sihari","date":"2017-11-09T09:33:47.373+0000","up_votes":2,"down_votes":0,"body":"Punkt 2 ist eher so gemeint, dass du im Optimalfall ja weißt was du und deine 4 Teammates spielen werden und deine 3 Lieblingsbanns sind vielleicht nicht immer die beste Wahl.\nzB siehst du vor dem Bannen, dass dein Team diese Runde auf nen Hardengage setzen möchte und es wäre natürlich sehr von Vorteil für euch, wenn ihr die härtesten Disengage-Champions einfach bannen würdet. Blöd nur, wenn diese Champions dann nicht in der Liste für dein neues System stehen.\n\nKurz gefasst: dein System würde einige Vorteile für \"Comford-Banns\" bringen, aber dafür auch die \"strategischen Banns\" komplett außen vor lassen.","replies":[]},{"poster":"Critical lmpact","date":"2017-11-09T09:38:48.000+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Growling Turtle,realm=EUW,application-id=Wj1wcocU,discussion-id=P9wzVcZL,comment-id=00010000,timestamp=2017-11-09T08:03:21.202+0000)\n>\n> 1. Was ist daran kompliziert du brauchst nur irgendwo 3 Champions angeben die du nicht magst und ein Algorithmus macht den rest...\n> 2. Das macht keinen Sinn, du bannst doch aktuell auch erst komplett bevor du anfängst zu picken (außer in Tournament Draft/Customs). Oder meinst du, dass du die Champs deiner Mates dann versehentlich bannst?\n\n1. natürlich ist es für den Spieler nicht kompliziert die 3 Champs auszuwählen, aber ich finde das Konzept insgesamt viel zu umständlich\n\n2. Das habe ich ja auch geschrieben.... ich weiß aber bei der Ban-Phase wen meine Teammates picken möchten, und passe meinen eigenen Champ und den entsprechenden Bann an meine teamcomp an. Die Möglichkeit würde man mir nejmen\n\nEdit: Danke sihari, genau so habe ich es gemeint :)","replies":[]}]}]},{"poster":"Critical lmpact","date":"2017-11-09T09:43:37.305+0000","up_votes":1,"down_votes":0,"body":"Mal eine andere Frage: gibt es eigentlich einen bestimmten Grund dafür, dass die Pick&Ban Phase anders ist als bei den „professionellen Turnieren“ sozusagen?\n\nWarum führt man nicht - zumindest in Ranked Games - auch die beiden Bannphasen ein? Durch das abwechselnde bannen hätte man auch die Doppelbanns nicht mehr","replies":[{"poster":"Megamaexx","date":"2017-11-09T10:17:00.590+0000","up_votes":1,"down_votes":0,"body":"Das wurde für uns “Normalos“ nicht eingeführt, da sonst die Bannphase noch länger geworden wäre. (Und wenn dann noch jemand die Champselect verlässt, dauert das halt schon ziemlich lange.)","replies":[]}]},{"poster":"Time2Whine","date":"2017-11-09T07:21:47.169+0000","up_votes":1,"down_votes":0,"body":"Das einzige Problem was ich an deiner Idee sehe ist, dass das bewusste offen lassen von Power Picks dadurch nicht möglich ist. Manchmal will man bestimmte Champs offen lassen um diese Spielen zu können/First Pick ausnutzen zu können.\nDes Weiteren braucht man die gewünschten Banns nicht unbedingt im Profil vor einem Spiel auswählen. Man kann doch einfach in der Bannphase seine 3 Wunschbanns auswählen und dann wird errechnet welche Champs die höchste Priorität haben.\n\nAn sich aber ein interessanter Vorschlag deinerseits.","replies":[{"poster":"xFarkius","date":"2017-11-09T08:04:14.365+0000","up_votes":1,"down_votes":0,"body":"Ok daran hab ich auch nicht gedacht mit den First picks.","replies":[]}]},{"poster":"Megamaexx","date":"2017-11-09T07:44:41.177+0000","up_votes":1,"down_votes":0,"body":"Wenn es dir wirklich nur darum geht, dass tatsächlich 10 Champions gebannt werden, dann müsste jeder Spieler auch 10 Champions angeben. Bei 3 Champions bleibt die Gefahr bestehen (Und wird zumindest theoretisch erhöht), dass alle oder mehrere Spieler hier die gleichen Champions auswählen. Im worst case macht das dann nur 3 Banns.\n\nUnd wie schön von  Time2Whine erwähnt, “pick or ban“-Champions können nicht mehr gespielt werden.","replies":[{"poster":"xFarkius","date":"2017-11-09T08:01:37.759+0000","up_votes":1,"down_votes":0,"body":"Ja ok gut da muss ich sagen, da hab ich ned dran gedacht ^^ Aber es war ja wie gesagt kein ausgereiftes Ding sondern mehr so eine Idee.","replies":[]}]}]}