{"poster":"TheDangerousTaco","date":"2018-02-22T15:55:10.764+0000","title":"Liandry's Feel's nerfed. ( Quick thought )","subforum":"Gameplay","up_votes":0,"down_votes":1,"body":"The new max hp buff stacks up to 6%. but it feels significantly weaker than the 12% current hp. In my opinion, the 10% bonus damage doesn&#039;t make up for the lack of penetration + more % hp damage.","replies":[{"poster":"Anastaecia","date":"2018-02-22T15:59:44.409+0000","up_votes":1,"down_votes":0,"body":"It's supposed to be for taking down tanks now.","replies":[{"poster":"TheDangerousTaco","date":"2018-02-22T16:02:43.443+0000","up_votes":1,"down_votes":0,"body":"Sorry for not clarifying, but that's what I was intending to do.","replies":[{"poster":"Anastaecia","date":"2018-02-22T16:06:04.010+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=TheDangerousTaco,realm=NA,application-id=3ErqAdtq,discussion-id=FtHiEy2p,comment-id=00010000,timestamp=2018-02-22T16:02:43.443+0000)\n>\n> Sorry for not clarifying, but that&#x27;s what I was intending to do.\n\nWhen I first read it, it seemed weaker.   Maybe it's more of a late game tank killer now...since the % dmg wont matter much early.  I wonder how it did on PBE.  I main Zyra so I need MP, so switching to Morel's regardless.  GL.","replies":[{"poster":"TheDangerousTaco","date":"2018-02-22T16:07:51.647+0000","up_votes":1,"down_votes":0,"body":"Yea from my experience, the rest of the items work more or less the same, ( except arc angels being more accessible ) with the benefit of more build paths","replies":[]}]}]}]},{"poster":"Eedat","date":"2018-02-22T16:12:33.796+0000","up_votes":1,"down_votes":0,"body":"It's quite simple really. The burn does less damage against enemies above 50% HP while doing significantly more to enemies below 50%. Overall a big buff for the burn considering Liandrys did practically no damage to low HP targets","replies":[{"poster":"TheDangerousTaco","date":"2018-02-22T16:17:40.783+0000","up_votes":1,"down_votes":0,"body":"That is simple enough. But may I be allowed to disagree with one of your points. Wouldn't you consider the penetration effect more useful than the bonus damage effect, on low hp targets?","replies":[{"poster":"Eedat","date":"2018-02-22T21:46:57.557+0000","up_votes":1,"down_votes":0,"body":"It depends on the target and what champ is using it. What it comes down to is Liandrys will be much better on DoT or extended damage champs like{{champion:82}} {{champion:69}} {{champion:63}} {{champion:90}} {{champion:68}} etc while being worse on burst champs that built it only for the Mpen. The flat Mpen is being moved onto a different item.","replies":[]}]}]},{"poster":"Selegun","date":"2018-02-22T16:08:23.330+0000","up_votes":1,"down_votes":0,"body":"Who might I ask are you trying it on?","replies":[]},{"poster":"Wulf Helhammer","date":"2018-02-22T15:58:10.028+0000","up_votes":1,"down_votes":0,"body":"It's no longer supposed to be a squishy bursting item, so for most mages, it's worse in that aspect. If you want the same level of that, the better option would be the new Morellonomicon. This item has the flat MPen to take out low resistance targets","replies":[{"poster":"TheDangerousTaco","date":"2018-02-22T16:02:13.749+0000","up_votes":1,"down_votes":0,"body":"That's exactly what I was referring too. I usually buy liandry's for High hp targets. But my last game felt underwhelming, in fact I noticed that I barely dented that targets HP. tank or not, I stand by my original quick thought.","replies":[]}]}]}