{"poster":"Candlestic","date":"2016-07-09T13:12:20.399+0000","title":"Data-log 158-39","subforum":"FanFiction","up_votes":2,"down_votes":1,"body":"Time: 1457\r\nLocation: 2786.2 km north-east of the city of Piltover, Valoran.\r\nWeather: Sunny. No clouds. 24.6&deg;C with low humidity and a light easterly breeze.\r\nOverall, perfect conditions for the fleshlings of this area, Blitzcrank concluded happily. Weather such as this would significantly increase his chances of pleasant interactions with the locals. \r\nHumming contently to himself, the great steam golem speedily waddled in the direction of the town he had seen earlier, eager to meet the fascinating fleshlings. From his shoulder, the distressed squeals of Marshmallow caused the mechanical being to slow down, conscious of the life-form&rsquo;s weaker grip control. The reduction of speed appeased the female and she settled down next to her sleeping companion, easily drifting off in the warmth of her caretaker&rsquo;s combustion processes.\r\nOnce satisfied both fuzzy fleshlings were content and secure, Blitzcrank once more toddled towards his destination, at an eager but moderate pace. \r\n*blip-blip* *blip-blip*\r\nAs his wireless communication connection lit up, the steam golem engaged the call, even as he mounted the hill before the town. &ldquo;GOOD AFTERNOON. WELCOME TO BLITZCRANK&rsquo;S FLESHLING COMPATIBILITY SERVICES EQUIRY LINE. HOW MAY I HELP YOU?&rdquo;\r\nThe golem abruptly turned down the volume as an unhappy voice sounded on the other end of the line. &ldquo;I AM SORRY YOU FEEL THAT WAY MISS. MAY I ENQUIRE TO THE REASON THAT YOU FEEL THE PAIRING DID NOT WORK FOR YOU?&rdquo;\r\nHe patiently waited, as the lady on the other end explicitly told him exactly why her compatibility match did not work out, all the while navigating the moderate decent down to the rural settlement at the base. &ldquo;I SEE, I DID NOT REALISE THAT SIZE MEANT THAT MUCH TO FLESHLINGS. IT WILL BE NOTED. HOWEVER, FOR THE MOST EFFECTIVE RESULTS I WOULD ADVISE FILLING OUT THE COMPANY&rsquo;S COMPLAINT FORM. IT SHOULD ONLY TAKE A FEW HOURS.&rdquo;\r\nReaching a section unpassable for his girth, Blitzcrank hooked his hand around a nearby bolder, then, ensuring his two sleeping companions were secure, lowered himself down the side of the mount. &ldquo;I AM AFRAID I MUST CORRECT YOU MISS: YOU ARE TALKING TO A LIVE INDIVIDUAL. I MUST ALSO INFORM YOU THAT I TAKE OFFENCE AT THE TERM ROBOT. I PREFER THE TERM SENTIENT AUTONOMOUS CITIZEN.&rdquo;\r\nUnhooking his grip, the mechanical giant was forced to once more turn the call volume down. &ldquo;PLEASE MISS, SUCH LANGUAGE IS NOT APPROPRIATE FOR A LADY TO BE HEARD USING. MAY I OFFER YOU A FEW CHILD-FRIENDLY REPLACEMENTS?&rdquo;\r\nHis gaze shifted over to a group of human offspring playing an interesting looking game in a nearby field. Curiously, he watched as the eight kids kicked a mono-coloured spherical air-sack between each other; trying, it seemed, to kick the object between two brightly coloured markers. &ldquo;I&rsquo;M SORRY MISS BUT I MUST GO. I WILL PUT YOU THROUGH TO OUR COPORATE MANAGER, DR MUNDO. HE WILL ENSURE THAT ALL OF YOUR COMPLAINTS ARE HANDLED CORRECTLY. HAVE A LOVELY DAY AND THANK YOU FOR USING BLITZCRANK&rsquo;S FLESHLING COMPATABILITY SERVICE.&rdquo;\r\nThe golem cut off the irate woman mid-sentence, transferring her through to the corporate department and shutting off his communication system. Then, he eagerly shuffled over to the unknown human children.\r\n&ldquo;GREETINGS YOUNGLINGS, I WAS HOPING TO LEARN MORE ABOUT THE GAME YOU ARE ENGAGING IN. DOES IT DISTRESS YOU IF I JOINED?&rdquo;\r\nThe little girl with two missing front teeth giggled, &ldquo;You talk funny.&rdquo;\r\n&ldquo;Yeah,&rdquo; the scruffy haired boy next to her agreed, &ldquo;You look funny too. What are you?&rdquo;\r\nSensing the curiousity from all eight of the children, the steam golem introduced himself. &ldquo;I AM BLITZCRANK.&rdquo;\r\n&ldquo;Yes, but what are you?&rdquo; the tallest girl, and seemingly the leader of the group persisted.\r\n&ldquo;I AM A TECHMATURGICAL CONSTRUCT. HOWEVER, MANY REFER TO ME AS A STEAM GOLEM. WHAT MAY I CALL YOU?&rdquo;\r\n&ldquo;I&rsquo;m Skip,&rdquo; the leader told him. &ldquo;That&rsquo;s Izzy, Red, Thomas, Taya, Melissa, J.J. and Bullseye.&rdquo;\r\n&ldquo;GREETINGS SKIP, IZZY, RED, THOMAS, TAYA, MELISSA, J.J. AND BULLSEYE. IT IS A PLEASURE TO MEET YOU.&rdquo;\r\nIzzy, the gap toothed girl, giggled. &ldquo;It&rsquo;s nice to meet you too Blitzcrank.&rdquo;\r\nJ.J. a dark, wiry boy tugged on the golden giant&rsquo;s arm, &ldquo;So you wanted to learn football did you?&rdquo;\r\n&ldquo;FOOTBALL?&rdquo;\r\n&ldquo;The game we were playing yeah. It&rsquo;s really simple.&rdquo;\r\n&ldquo;Basically,&rdquo; Skip took over again. &ldquo;The aim is to get the ball through the goal.&rdquo; She pointed to the two objects in question. &ldquo;And to stop the other team from scoring. However, you can&rsquo;t use your hands. Got it?&rdquo;\r\n&ldquo;I SEE,&rdquo; Blitzcrank nodded. &ldquo;THE CONCEPT SEEMS SIMPLE ENOUGH.&rdquo; \r\n&ldquo;Great!&rdquo; Skip rubbed her hands together. &ldquo;Then you can be on our team. Red, you can move across to Taya&rsquo;s team.&rdquo;\r\nThe red-headed teen nodded, moving to stand beside the plump female. &ldquo;Are you ready?&rdquo; Taya asked politely.\r\n&ldquo;ONE MOMENT,&rdquo; Blitzcrank carefully scooped the two sleeping creatures off his shoulder and gently placed them under the nearby tree. \r\n&ldquo;What&rsquo;re those?&rdquo; the broad boy, Bullseye, asked.\r\nGlancing at the dozing fluff balls in surprise, Blitzcrank answered, &ldquo;THOSE ARE POROS.&rdquo;\r\n &ldquo;Oh,&rdquo; the blonde girl, Melissa, responded, &ldquo;Is that what they are. We&rsquo;ve never seen one but we&rsquo;ve heard of them.&rdquo;\r\n&ldquo;They&rsquo;re so cute!&rdquo; Izzy squealed. &ldquo;What&rsquo;re their names?&rdquo;\r\nThe golem gestured to the larger, white poro, &ldquo;THAT IS MARSHMALLOW. AND THAT IS ABSOLUTE ZERO KELVIN.&rdquo; He then pointed to the fluff-ball sporting a hazel splash on its back. &ldquo;I HAVE FOUND MOST FLESHLINGS I HAVE ENCOUNTERED HOWEVER, SIMPLY REFER TO THEM AS MEL AND ZERO.&rdquo;\r\n&ldquo;Where did you get them from?&rdquo; Taya asked curiously, softly scratching Zero as he roused from sleep.  \r\n&ldquo;I SAVED THEM FROM A LARGE UNDOCUMENTED MONSTER UP NORTH 3.15 WEEKS AGO. I HAVE BEEN UNABLE TO FIND THEM A HOME SINCE THEN. WOULD YOU LIKE TO KEEP THEM? YOU YOUNGLINGS LOOK RESPONSIBLE AND CARING.&rdquo;\r\n&ldquo;Our very own poros!&rdquo; Izzy squealed. &ldquo;Thank you! Thank you! Thank you!&rdquo; the youngling threw her arms around the giant golem&rsquo;s leg in a tight hug, before Skip pulled her off.\r\n&ldquo;Yeah, yeah, that was very generous. Now come on! At this rate we&rsquo;ll never get started.&rdquo;\r\n&ldquo;I APOLOGISE FOR THE DELAY,&rdquo; Blitzcrank spoke. &ldquo;I AM READY TO PLAY FOOTBALL NOW.&rdquo;\r\nQuickly, both teams moved into position before Skip kicked off. The tall female quickly passed the ball to Thomas; who then dribbled the ball down the field before passing to the steam golem. \r\nAnalysing the incoming projectile, Blitzcrank tried to intercept the ball with his foot. He miscalculated its trajectory and the velocity however, and ended up slipping over it instead. Unable to regain his balance, the steam golem soon found himself laying on his back. \r\n&ldquo;Blitzcrank!&rdquo; the children rushed forward, helping the golden golem to his feet. &ldquo;Are you ok?&rdquo;\r\n&ldquo;INITIAL ANALYSIS INDICATES I AM UNHARMED. THANK YOU.&rdquo;\r\nTaya laughed, &ldquo;We&rsquo;ll give you another shot with the ball.&rdquo;\r\nLining up the mono-coloured ball with the goal, Blitzcrank once more attempted to set it into motion. This time he managed to kick it towards the goal. However, as it got close, Red caught it, before throwing the ball back to Bullseye. \r\n&ldquo;I DO NOT UNDERSTAND. I THOUGHT YOU WERE UNABLE TO USE YOUR HANDS.&rdquo;\r\nAs J.J. ran passed he explained, &ldquo;We can&rsquo;t. But the goalie can.&rdquo;\r\n&ldquo;I SEE,&rdquo; the steam golem remained stalled in the middle of the game, working through this new information. &ldquo;THIS GAME IS MORE COMPLICATED THAN I INITIALLY PRESUMED.&rdquo; With this in mind the golden giant threw himself back into the game with renewed enthusiasm. \r\nSeveral hours (and many mistakes) later, Skip called out &ldquo;Alright! Last goal wins!&rdquo; With a grin she took off down the field, dribbling past Izzy and Taya before passing to J.J. The wiry boy intercepted it before Bullseye came ramming into him, stealing the ball in the process. The larger teen then took off down to the halfway line, dodging around a determined Skip before running into Blitzcrank. \r\n&ldquo;SUCH FORCEFUL BEHAVIOUR IS NOT VERY NICE,&rdquo; the mechanical giant chided the teen, before sending the ball in a precise kick towards Thomas. The young boy took off towards the goal, passing the ball to Skip as he was blocked by Melissa. With practised ease, she kicked the ball past Red&rsquo;s outstretched hands and into the goal. \r\n&ldquo;Yeah! We won!&rdquo;\r\nBlitzcrank obligatorily gave the excited kids high-fives, even as he queried &ldquo;HOW DID WE WIN IF THEY WERE 5:2?&rdquo;\r\nJ.J. just laughed, &ldquo;Score doesn&rsquo;t matter only the last goal.&rdquo;\r\n&ldquo;WELL THAT MAKES NO SENSE.&rdquo;\r\nThe human children laughed once more before glancing at the setting sun.  \r\n&ldquo;We gotta get going,&rdquo; Skip told the steam giant. &ldquo;But it was great meeting you Blitzcrank. Feel free to come play with us anytime.&rdquo;\r\n&ldquo;IT WAS A PLEASURE TO MEET YOU TOO. THANK YOU FOR TEACHING ME FOOTBALL.&rdquo; \r\nWaving goodbye to the children the steam golem headed off into the night, eager to see what tomorrow would bring. As he tirelessly renewed his journey, Blitzcrank answered the incoming, scheduled call. &ldquo;GREETINGS VIKTOR, YOU&rsquo;LL NEVER GUESS WHAT I LEARNED TODAY.&rdquo;","replies":[{"poster":"AdcStoleMyAs5ist","date":"2016-07-12T01:57:50.457+0000","up_votes":1,"down_votes":0,"body":"> “PLEASE MISS, SUCH LANGUAGE IS NOT APPROPRIATE FOR A LADY TO BE HEARD USING. MAY I OFFER YOU A FEW CHILD-FRIENDLY REPLACEMENTS?”\n\nFlip, this was a thoroughly enjoyable read from start to finish! \n\nYou're absolutely spot-on with your portrayal of Blitzcrank - I suppose accidental acts of cruelty and complete ignorance of fleshling's pain aren't really appropriate for the genre you were trying to achieve - and you excellently applied existing lore material into your original story. \n\nBy any chance, have you read the [Blitzcrank <3 Orianna Comic](http://imgur.com/a/swG5V)? It is a bit 'darker', but all the same, these sort of pieces just make me glad Blitzcrank is part of the league, ey?","replies":[{"poster":"Candlestic","date":"2016-07-27T12:29:07.371+0000","up_votes":1,"down_votes":0,"body":"Thank you :). No, while I am aware that Blitzcrank has the potential to hurt fleshlings due to a lack of understanding I really wanted to capture the human like nature in a robot body, sweet air Blitzcrank has about him. \nYes I have! It is beautiful a beautiful piece (both in look and feel), even if it is a bit dark. And you're right, it's pieces like these that make the two of them such great champions to get to know :).","replies":[]}]}]}