{"poster":"Vincendra","date":"2015-09-18T08:41:54.640+0000","title":"Plant Riot einen größeren IP-Dump für leute mit zu viel IP ?","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":4,"body":"Wie im Titel gefragt. Ich habe alle champs und alle runen ung genug IP um mir die n&auml;chsten 20 Champs sofort zu kaufen. Ich w&uuml;rde gerne meine IP f&uuml;r etwas &quot;sinnvolles&quot; nutzen.\r\n\r\nIst irgendetwas in Planung?\r\n\r\nW&auml;re es m&ouml;glich, dass ich auch z.B meine IP an freunde &quot;spende&quot; oder an Riot, damit sie ggn meine IP vllt. eine kleine Geldspende f&uuml;r die Fl&uuml;chtlinge aus Syrien gibt?","replies":[{"poster":"Jastol","date":"2015-09-18T14:09:31.344+0000","up_votes":1,"down_votes":1,"body":"Schon erschreckend wie Hilfsbereitschaft von dieser Community abgelehnt (downgevoted) wird...","replies":[{"poster":"Zero000","date":"2015-09-18T15:31:19.431+0000","up_votes":2,"down_votes":0,"body":"Äh, zeichnet sich Hilfsbereitschaft nicht dadurch aus was man selbst macht?\nDemnach ist der einzige der bei solch einer Aktion wirklich hilfsbereit wäre Riot.","replies":[]}]},{"poster":"Zero000","date":"2015-09-18T09:59:34.684+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Vincendra,realm=EUW,application-id=YnZkMR0R,discussion-id=stxuEoMN,comment-id=,timestamp=2015-09-18T08:41:54.640+0000)\n\n> W&auml;re es m&ouml;glich, dass ich auch z.B meine IP an freunde &quot;spende&quot; **oder an Riot, damit sie ggn meine IP vllt. eine kleine Geldspende f&uuml;r die Fl&uuml;chtlinge aus Syrien gibt?**\n\nJa genau lass uns das Geld anderer Leute spenden damit wir uns besser fühlen. Außerdem ist Riot doch auch eine Gemeinnützige Organisation die allen Bedürftigen hilft.\n\nErnsthaft, wenn du etwas spenden willst dann spende dein Geld. Wenn du Hilfe leisten willst aber kein Geld hast so kannst du ehrenamtliche Arbeit leisten.","replies":[{"poster":"Vincendra","date":"2015-09-18T11:51:07.913+0000","up_votes":3,"down_votes":3,"body":"Ich habe bereits gespendet und auch freiwillig bei der Essens-  und Kleiderausgabe geholfen. Es war nur ein Vorschlag, wie ich meine IP gemeinnützig nutzen könnte.","replies":[{"poster":"Zero000","date":"2015-09-18T13:18:05.984+0000","up_votes":3,"down_votes":1,"body":"Indem du das Geld anderer ausgibst!\nSorry aber ich habe kein Verständnis für sowas.\nWie kommt man darauf das Geld anderer zu spenden sei eine gute Idee?\n\nIch habe ja nichts dagegen wenn Riot eine Aktion wie \"XY% der Skin Einkaufe vom 01.11 bis 01.12 gehen an die Hilfsorganisation XY!\" oder ähnliches.\n\nIch finde nur den \"Vorschlag\" andere sollen ihr Geld spenden damit man selbst ein besseres Gewissen hat abstoßend.\nWenn man spenden will macht man das, wenn man das über Marketing Kampagnen von Firmen machen will ist das auch okay. \nAber ich geh doch auch nicht zu meinem lieblings Italiener und sage das er jetzt für jede Pizza die ich dort gekauft habe 10 Cent an die Flüchtlinge spenden soll.","replies":[{"poster":"Jastol","date":"2015-09-18T14:14:06.220+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Zero000,realm=EUW,application-id=YnZkMR0R,discussion-id=stxuEoMN,comment-id=000200000000,timestamp=2015-09-18T13:18:05.984+0000)\n>\n> Indem du das Geld anderer ausgibst!\n> Sorry aber ich habe kein Verständnis für sowas.\n> Wie kommt man darauf das Geld anderer zu spenden sei eine gute Idee?\n> \n> Ich habe ja nichts dagegen wenn Riot eine Aktion wie \"XY% der Skin Einkaufe vom 01.11 bis 01.12 gehen an die Hilfsorganisation XY!\" oder ähnliches.\n> \n> Ich finde nur den \"Vorschlag\" andere sollen ihr Geld spenden damit man selbst ein besseres Gewissen hat abstoßend.\n> Wenn man spenden will macht man das, wenn man das über Marketing Kampagnen von Firmen machen will ist das auch okay. \n> Aber ich geh doch auch nicht zu meinem lieblings Italiener und sage das er jetzt für jede Pizza die ich dort gekauft habe 10 Cent an die Flüchtlinge spenden soll.\n\nSo etwas nennt sich Vorschläge machen. Niemand will hier Riot zu etwas zwingen aber man darf ja noch Vorschläge machen  oder reagierst du so auch wenn jemand nen Champion, Spielmodus oder sonst etwas Vorschlägt? Immerhin ist es da ja auch das Geld von Riot, welches in die Entwicklung fließt.","replies":[{"poster":"Zero000","date":"2015-09-18T14:19:51.590+0000","up_votes":2,"down_votes":0,"body":"Wenn mir die Vorschläge nicht gefallen, vorausgesetzt ich hätte sie mir überhaupt durchgelesen, das hätte ich auch gesagt ob sie mir gefallen und wenn nicht was ich an ihnen auszusetzen habe.","replies":[{"poster":"Jastol","date":"2015-09-18T14:22:38.697+0000","up_votes":1,"down_votes":1,"body":"Also geht es dir nicht darum ob jemand etwas vorschlägt, du findest es einfach nur scheiße Flüchtlingen zu helfen?","replies":[{"poster":"Zero000","date":"2015-09-18T15:08:13.403+0000","up_votes":2,"down_votes":0,"body":"Wie kommst du darauf?","replies":[]}]}]}]},{"poster":"Protective Puppy","date":"2015-09-18T14:03:57.943+0000","up_votes":2,"down_votes":2,"body":"Sonst hast du auch keine Probleme oder?\nDas heißt wenn Riot eine Aktion machen würde \"Spendet eure IP für Organisation XY\", wäre jeder ein Assi der da mitmachen würde?\nSolche Ideen sind die besten Ideen die es in der Online-Spiele-Branche gibt.\nManche Leute haben nunmal kein Geld und würden trotzdem helfen.","replies":[{"poster":"Zero000","date":"2015-09-18T14:44:24.852+0000","up_votes":2,"down_votes":0,"body":"Wenn Leute kein Geld haben können sie immer noch Ehrenamtlich helfen. Man muss kein Geld ausgeben um den Flüchtlingen oder anderen Hilfsbedürftigen zu helfen.\n\nWenn Riot das machen will, sollen sie doch, ich würde sogar mitmachen und all meine IP reinstecken die ich in den letzten 5 Jahren gesammelt habe.\nDas macht den Vorschlag aber in meinen Augen nicht weniger abstoßend, wobei ich zugeben muss das abstoßend vermutlich nicht das richtige Wort dafür ist. Aber anderen vorzuschreiben das sie ihr Geld anderen spenden sollen finde ich einfach nicht richtig.\n\nRiot ist keine Gemeinnützige Organisation sondern eine Firma die Geld verdienen will und muss. Riot würde bei solch einer Aktion aber nur Verlust machen.\n\nIch kann mir einfach nicht Vorstellen das ein Vorschlag, in dem es darum geht das Geld anderer zu spenden ohne selbst einen Cent zu bezahlen, ein Vorschlag ist der ernsthaft darauf abzielt den Flüchtlingen zu helfen sondern nur dafür da ist das eigene Gewissen zu besänftigen.","replies":[]}]}]}]}]},{"poster":"Alustus","date":"2015-09-18T09:54:44.783+0000","up_votes":2,"down_votes":1,"body":"Wurde noch nichts in diese richtung angekündigt.(zumindest habe ich nichts davon mitbekommen)\n\n\n> Wäre es möglich, dass ich auch z.B meine IP an freunde \"spende\" \n\nWürde riot sehr viel geld kosten + es würden IP für echtgeld verkauft werden (bots incomming)\n\n> ggn meine IP vllt. eine kleine Geldspende für die Flüchtlinge aus Syrien gibt?\n\nGute Idee, wenn es auch aus unternehmens Sicht auch nicht von Vorteil wäre bzw. es wäre eine vergleichbar teure Marketing Aktion.","replies":[{"poster":"Jastol","date":"2015-09-18T10:45:08.972+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Alustus,realm=EUW,application-id=YnZkMR0R,discussion-id=stxuEoMN,comment-id=0001,timestamp=2015-09-18T09:54:44.783+0000)\n> Gute Idee, wenn es auch aus unternehmens Sicht auch nicht von Vorteil wäre bzw. es wäre eine vergleichbar teure Marketing Aktion.\n\nich glaube es wäre eine verdammt gute Marketing Aktion wenn man es richtig anstellt. Riot könnte es ja so machen wie man es schon bei Supermärkten in ähnlicher Form hatte, dass Benutzer/ Kunden Treuepunkte oder Pfand (So kenne Ich es bei Lidl) an gemeinnützige Organisationen spenden kann. Muss ja nicht unbedingt in Relation zu dem wert der IP im Spiel stehen. \nEine Aktion aller: \"Spende eine Beliebige Menge deiner IP und für alle 1 Million IP spendiert Riot zusammen mit Intel einen Computer für ein Flüchtlingsheim\". Das wäre Sachbezogen, gute PR (Auch Syrer spielen lol ;)), mit dem passenden Partner (z.Bsp. Intel) nicht so teuer und ein schöner Beweis, dass die Community vll trotz ihrer Toxicness nicht nur aus Arschlöchern besteht.","replies":[{"poster":"PwnedAkkon ","date":"2015-09-18T12:50:40.245+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Jastol,realm=EUW,application-id=YnZkMR0R,discussion-id=stxuEoMN,comment-id=00010000,timestamp=2015-09-18T10:45:08.972+0000)\n>\n> ich glaube es wäre eine verdammt gute Marketing Aktion wenn man es richtig anstellt. Riot könnte es ja so machen wie man es schon bei Supermärkten in ähnlicher Form hatte, dass Benutzer/ Kunden Treuepunkte oder Pfand (So kenne Ich es bei Lidl) an gemeinnützige Organisationen spenden kann. Muss ja nicht unbedingt in Relation zu dem wert der IP im Spiel stehen. \n> Eine Aktion aller: \"Spende eine Beliebige Menge deiner IP und für alle 1 Million IP spendiert Riot zusammen mit Intel einen Computer für ein Flüchtlingsheim\". Das wäre Sachbezogen, gute PR (Auch Syrer spielen lol ;)), mit dem passenden Partner (z.Bsp. Intel) nicht so teuer und ein schöner Beweis, dass die Community vll trotz ihrer Toxicness nicht nur aus Arschlöchern besteht.\n\neinen pc ... in welcher welt lebst du denn. Die wollen erstmal was zu essen und ein Dach über dem Kopf, ich glaube ein pc ist das unwichtigste was es einer solchen lage gibt.","replies":[{"poster":"Jastol","date":"2015-09-18T13:57:49.871+0000","up_votes":1,"down_votes":1,"body":"Mal mit den Menschen in den Unterkünften reden könnte auch dir nicht schaden. Sie haben dort Essen, Trinken und ein Dach über dem Kopf. Was Ihnen Fehlt ist der Kontakt zu Ihren Verwandten und Freunden, welche zu großen Teilen noch in Lebensgefahr schweben. Im Gegensatz zu so manchen Behauptungen können die wenigsten Flüchtlinge Kaffeesätze lesen, aber Skype können so gut wie alle bedienen. Leider Lässt sich nicht mit Luft Skypen.\nKlaro für uns verwöhnte Deutsche klingt so etwas befremdlich, immerhin können wir jederzeit unsere Verwandten und Freunde anrufen und haben dafür nicht mal einen Grund, immerhin befinden sich die meisten nicht in akuter Lebensgefahr. Bei diesen Menschen sieht das leider anderst aus.\nDes Weiteren können Sie an PCs z.B. sich über Ihre Situation, Rechtliche Lage, Politsche Stimmungen, Sprachkurse.... und vieles Mehr Informieren, es geht nicht darum lol zu zocken, wobei selbst das noch ne freudige Abwechslung wäre, immerhin dürfen diese Menschen die ersten drei Monate hier nichts arbeiten und mit weniger als 140€ im Monat kann man auch kein wirklich ausschweifendes Freizeit leben führen. \n\nPS: Was momentan sehr viel benötigt wird ist Herrenkleidung, da wohl sehr wenig Herren Kleidung spenden, daher hier mal meine Aufforderung an alle männlichen Spieler mal statt nem Normal den Schrank durchwühlen und alles was man seit nem Jahr nicht mehr getragen hat zur nächsten Unterkunft zu bringen.","replies":[{"poster":"Zero000","date":"2015-09-18T14:56:14.273+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Jastol,realm=EUW,application-id=YnZkMR0R,discussion-id=stxuEoMN,comment-id=0001000000020002,timestamp=2015-09-18T13:57:49.871+0000)\n> PS: Was momentan sehr viel benötigt wird ist Herrenkleidung, da wohl sehr wenig Herren Kleidung spenden, daher hier mal meine Aufforderung an alle männlichen Spieler mal statt nem Normal den Schrank durchwühlen und alles was man seit nem Jahr nicht mehr getragen hat zur nächsten Unterkunft zu bringen.\n\nIch bin mir nicht sicher ob Männer  tatsächlich seltener spenden oder ob Frauen einfach mehr Kleidung zum spenden haben.\nWir hatten solch eine Aktion mal in der Schule indem alle Kleidung die sie nicht mehr brauchten gesammelt hatten.\nNachdem am Ende fast dreimal so viel Frauenkleidung gesammelt wurde haben einige mal ne Umfrage erstellt wie viele Kleidungsstücke die Leute durchschnittlich haben. Demnach hatten die Weiblichen Teilnehmer selbst nach der Spende noch durchschnittlich doppelt so viele Kleidungsstücke wie die männlich befragten.","replies":[]}]},{"poster":"Jastol","date":"2015-09-18T13:48:11.273+0000","up_votes":1,"down_votes":2,"body":"Bitte löschen ","replies":[{"poster":"PwnedAkkon ","date":"2015-09-18T14:12:19.180+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Jastol,realm=EUW,application-id=YnZkMR0R,discussion-id=stxuEoMN,comment-id=0001000000020000,timestamp=2015-09-18T13:48:11.273+0000)\n>\n> Ok nochmal für die etwas langsamen. Essen und Verpflegung bekommen die Menschen in Unterkünften gestellt. Computer und Internet nicht! Versetz dich doch einfach mal in die Lage eines Menschen der nicht weiß ob es seinen Verwandten und Freunden gut geht, bez. ob diese überhaupt noch leben. Was kann einem Menschen helfen diese Problem zu Lösen? Skype z.Bsp. und was benötigt man für Skype? Richtig, einen Computer, so schwer ist das doch nicht. Einfach mal nicht von der verwöhnten Zockercouch die Situation betrachten ;). Für diese Menschen ist es nicht so selbstverständlich wie für uns, dass wir unsere Verwandten jederzeit anrufen könnten bez. wir haben auch kaum das Bedürfnis, da keiner unserer Verwandten oder Freunde in akuter Lebensgefahr steckt.\n> \n> -> Zusammengefasst, Ja als erstes benötigen Sie Essen und Trinken, aber Essen und Trinken bekommen diese Menschen vom Staat und Dutzenden Hilfsorganisationen, einen Computer nicht!\n> \n> --> Geht einfach mal raus zur nächsten Flüchtlingsunterkunft und redet mit den Leuten, dass sind Menschen wie Wir und die Freuen sich auch wenn Sie mal etwas bekommen was nicht zu der Grundversorgung gehört. Kleiner Tipp am Rande, es fehlt vor allem an Männerkleidung. Mir wurden meine gespendeten Klamotten da fast schon aus den Händen gerissen und für ein gespendetes S2 hat mich nen jüngerer Kerl fast 5 Minuten umarmt da er endlich nicht mehr darauf angewiesen war zu betteln damit er mit seiner Frau telefonieren kann.\n\nMir ging es in erster Linie um die Flüchtlinge die zurzeit vor unseren Grenzen warten müssen. Und die meisten von denen, die es bis hierhin geschafft haben, gehören zu der absoluten Oberschicht ihres Landes (wenn sie aus Kriegs oder weiter entfernten Gebieten kommen), deshalb haben die meisten von ihnen auch ein Handy dabei. Und was kann dieses ? Ja richtig, es bietet die Nötige Kommunikationsfreiheit. Zudem verbitte Ich mir, dass du meinst dich irgendwie über mich erheben zu müssen. Belehrungen kannst du dir in Zukunft sparen, vor allem wenn du sie so verfasst.","replies":[{"poster":"Jastol","date":"2015-09-18T14:24:01.287+0000","up_votes":1,"down_votes":1,"body":"Us dachte ich hab die Version gelöscht. Hab selbst beim schreiben gemerkt wie beschissen ich mich ausdrücke. Sorry wollte dir nicht zu nahe treten aber ich hab da momentan nen ziemlich dünnes Fell, da ich viel helfe und auch einige Freunde deswegen verloren habe weil meine Meinung ihnen nicht deutsch genug war.\n\nZu deinem Einwand, da hast du natürlich vollkommen recht aber ich glaube kaum dass Riot da etwas ändern kann daher versuche ich mir zu überlegen wo sich schnittmengen finden lassen. Grad die IT ist da halt sehr passend, da sie nicht staatlich gestützt wird und eben nicht jeder ein Smartphone hat und auch das so seine Grenzen hat vor allem im Dauerbetrieb.","replies":[{"poster":"PwnedAkkon ","date":"2015-09-18T14:29:25.210+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Jastol,realm=EUW,application-id=YnZkMR0R,discussion-id=stxuEoMN,comment-id=000100000002000000000000,timestamp=2015-09-18T14:24:01.287+0000)\n>\n> Us dachte ich hab die Version gelöscht. Hab selbst beim schreiben gemerkt wie beschissen ich mich ausdrücke. Sorry.\n\nok :) \nDeine Meinung ist ja auf jeden Fall berechtigt und auch gut begründet aber ich hasse es angemault zu werden :D","replies":[{"poster":"Jastol","date":"2015-09-18T14:38:02.376+0000","up_votes":1,"down_votes":1,"body":"Kann ich verstehen. Ka warum mein Browser es sogar 2 mal abgeschickt hat.  Es war wirklich absolut unangebracht von mir.","replies":[]}]}]}]}]},{"poster":"Jastol","date":"2015-09-18T13:49:11.418+0000","up_votes":1,"down_votes":2,"body":"Bitte löschen ","replies":[]}]},{"poster":"Alustus","date":"2015-09-18T10:55:57.553+0000","up_votes":2,"down_votes":0,"body":"Das Problem ist LoL ist schon extrem bekannt, außerdem hat es einen sehr guten Ruf.\nEs braucht daher nicht allzuviel Marketing (nicht mehr), da schon fast jeder PC spieler LoL kennt.\n\nDie Frage ist daher welche nur Riot games beantworten kann(und das nicht zu 100%)\nWieviel kostet uns so eine Aktion + wieviel nutzen ziehen wir aus so einer aktion.\n\nIn der Spendenpolitik gibt es von Amazon und Riot in Amerika schon eine Aktion, welche vllt auch nach Deutschland kommt.\nhttp://www.summoners-inn.de/de/news/31753-rp-kaufen-fuer-einen-guten-zweck","replies":[{"poster":"Jastol","date":"2015-09-18T14:07:28.463+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Alustus,realm=EUW,application-id=YnZkMR0R,discussion-id=stxuEoMN,comment-id=000100000001,timestamp=2015-09-18T10:55:57.553+0000)\n>\n> Das Problem ist LoL ist schon extrem bekannt, außerdem hat es einen sehr guten Ruf.\n> Es braucht daher nicht allzuviel Marketing (nicht mehr), da schon fast jeder PC spieler LoL kennt.\n> \n> Die Frage ist daher welche nur Riot games beantworten kann(und das nicht zu 100%)\n> Wieviel kostet uns so eine Aktion + wieviel nutzen ziehen wir aus so einer aktion.\n> \n> In der Spendenpolitik gibt es von Amazon und Riot in Amerika schon eine Aktion, welche vllt auch nach Deutschland kommt.\n> http://www.summoners-inn.de/de/news/31753-rp-kaufen-fuer-einen-guten-zweck\n\nWas es bringt? Neue Kunden und höhere Akzeptanz in der Zivilgesellschaft, ganz abgesehen davon, dass ein guter Zweck verfolgt wird. Momentan lässt sich mit Flüchtlingshilfe sehr gute PR machen. So gute, dass sogar die Hetzzeitschrift No.1 aka Bild auf den Zug aufspringt. Wer hilft kommt momentan in die normalen Nachrichten. ich könnte mich nicht dran erinnern, dass Riot zu oft in den Nachrichten ist vor allem mal in nem Kontext in dem es nicht direkt um Zocken geht und den sich vll auch die Eltern von Zockern anschauen. Also einfach mal über den Tellerrand schauen. Ob es am Schluss eine einen Reingewinn für Riot  gibt kann ich nicht betiteln, aber es wird definitiv mehr Gewinn für Riot (und die Gamingszene an sich) bringen als Verlust.\n\nSehr geile Aktion, Hoffentlich kommt das auch nach Deutschland :).","replies":[{"poster":"Alustus","date":"2015-09-18T14:41:14.975+0000","up_votes":1,"down_votes":0,"body":"Wie gesagt Riot hat schon einen sehr guten Ruf.\nSelbst die nicht spielende gemeinde kennt es mittlerweile, halbwegs.\n\nIn den zeitungen wird es wohl kaum groß erwähnt werden, vllt ein kleiner absatz.\nFür die Gamingszene könnte es einen großen nutzen haben.\n\nFür Riot eher weniger.\n\nGibt bestimmt PR aktionen die für Riot mehr effizient ist und auch weniger kostetn.\n\nUnd ich denke kaum das soetwas positive auswirkungen auf Spenden allgemein hätten.\nIch denke es würde nur zu einer ausrede führen wo dan die Spieler sagen können ich hab ja schon gespendet \n(obwohl das nicht stimmt, da Riot gespendet hat)","replies":[]}]}]},{"poster":"Patter91","date":"2015-09-18T10:53:00.953+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Jastol,realm=EUW,application-id=YnZkMR0R,discussion-id=stxuEoMN,comment-id=00010000,timestamp=2015-09-18T10:45:08.972+0000)\n>\n> Eine Aktion aller: \"Spende eine Beliebige Menge deiner IP und für alle 1 Million IP spendiert Riot zusammen mit Intel einen Computer für ein Flüchtlingsheim\". Das wäre Sachbezogen, gute PR (Auch Syrer spielen lol ;)), mit dem passenden Partner (z.Bsp. Intel) nicht so teuer und ein schöner Beweis, dass die Community vll trotz ihrer Toxicness nicht nur aus Arschlöchern besteht.\n\n...und hilft den Flüchtlingen mal so überhaupt nicht. Ziel einer Flüchtlingshilfe sollte nicht die Versorgung mit absoluten Luxusgütern sein, sondern die Wiederherstellung ihrer alten Lebensbedingungen, d.h. ihnen erst einmal helfen, zu überleben, und sich darum zu kümmern, dass sie wieder nach Hause können.\nUnd warum sollte Riot spenden, weil ihr eure überschüssigen IP loswerden wollt? Damit ihr euch ein gutes Gefühl geben könnt ala \"geil, war ich heute wieder ein guter Mensch! Ich habe andere dazu veranlasst, Geld zu spenden und habe kein bisschen dafür getan!\"?","replies":[{"poster":"Jastol","date":"2015-09-18T11:10:37.851+0000","up_votes":1,"down_votes":2,"body":"Zu deiner Information bin Ich in der Flüchtlingshilfe recht aktiv und dann sollte man eben realistisch sein. Riot kann nicht den Weltfrieden herbeiführen und das Flüchtlingsproblem nicht lösen. \nBei Überleben kann Riot auch nicht groß helfen, dafür hat es zu wenig politische Macht. Es könnte höchstens Hilfsorganisationen unterstützen, auch hier fehlt es an IT. \nNahrung zu stellen ist nur Sinnvoll, wenn wirklich große Mengen Nahrung gestellt werden kann, ansonsten müssten bestimmte Flüchtlinge als Privilegiert gewählt werden die auf einmal mehr essen bekommen, was in Flüchtlingsunterkünften zu Streit führen kann (Leider schon erlebt). \nViele Flüchtlinge können auch nicht mehr \"nach Hause\" oder sind auf der Suche nach einem neuen \"zu Hause\", wie soll Riot hier also konkret helfen?\nAußerdem muss Riot als Unternehmen auch daran denken, was für es selbst wirtschaftlich am Sinnvollsten ist. \n\nWas Ihnen aber konkret hilft ist z.Bsp. die Möglichkeit kostenlos oder Günstig mit Ihren verwanden Kontakt aufzunehmen unterlagen recherchieren etc., da nicht jeder Flüchtling ein Smartphone hat wären also z.B. Rechner oder Internet praktisch und für Riot im Konkreten auch Kontext bezogen. Für jemanden wie uns ist es selbstverständlich mit unseren Eltern in Kontakt zu stehen. Für ein Flüchtling ist das nicht so einfach.\n\nLast but not least solltest du von dir selbst nicht auf andere schließen. Manche Menschen wollen vll einfach nur helfen und wenn man etwas im Überfluss hat, warum nicht mit anderen Teilen? Ich selbst habe nicht genug IP, aber Klamotten, Essen und IT Infrastruktur im Wert von mehreren hundert Euro im letzten Monat an die Flüchtlingsunterkunft im Nachbarort gespendet und glaub mir ein, die waren Glücklich darüber und für mich hat es keinen Verlust bedeutet. Ob Ich dadurch ein guter oder besserer Mensch werde ist mir absolut scheißegal, Ich sehe einfach etwas was Ich nicht benötige und Ich sehe Menschen die etwas benötigen. Thats it.\n\nWerde dir bitte mal über den Zustand bewusst und das jede Hilfe, egal ob ein Computer oder nur das akzeptieren der Flüchtlinge als gleichberechtigte Menschen bereits ein wichtiger Schritt ist Ihnen zu helfen ein Teil unserer Gesellschaft zu werden ;).","replies":[]}]}]}]},{"poster":"FNC Dreadnøva GP","date":"2015-09-18T08:55:07.153+0000","up_votes":2,"down_votes":1,"body":"Ich glaube nicht das du EP bzw. IP für etwas anderes als für Champs, Runenseiten, Namensänderungen ausgeben kannst. Deine Idee ist gut allerdings wird es das in naher Zukunft wohl nicht geben =/\n(Fals ich falsch liege, ich lass mich gern korregieren!{{summoner:21}} )","replies":[]}]}