{"poster":"graphco","date":"2015-04-30T08:12:49.022+0000","title":"Ich spiele erst seit ein paar Wochen und habe schon jetzt keinen Bock mehr auf die Community...","subforum":"Spielerverhalten & Moderation","up_votes":6,"down_votes":5,"body":"Joa, das was ich im Titel geschrieben habe sagt eigentlich schon alles. In den ersten paar Spielen viel mir auf das es echt viele Idioten gibt, die dich wegen jedem kleinem Mist beleidigen. Auf Level 4, wo ich halt noch nicht wusste was es hei&szlig;t einen Drachen zu machen etc. Mittlerweile bin ich auf Level 30 und habe viel durch lesen und YouTube gelernt, versuche mit dem Team zu kommunizieren.\r\n\r\nHeute dann folgendes: Ich als Malphite auf der Top, habe einen Tower schon kaputt und mache gerade den zweiten. Mein Team verliert den ersten Kampf in der mitte (4vs4, der JGL von denen war auch nicht da). Ich frage: &quot;should i come mid or push top?&quot;. Unser Midlaner schreibt: &quot;push top&quot;. Gesagt getan, mach ich. Wir verlieren dann das Spiel weil jemand AFK geht - auch das scheint ja normal zu sein - und dann werde ich Beleidigt warum ich so selten in Teamfights da war etc. Ich versuche zwar auf die Kommunikation hinzuweisen aber werde nur Beleidigt - was ja hier auch normal ist - bis dann folgender Satz kam:\r\n&gt; Meenge: die of cancer u solo negger\r\n\r\nJetzt mal ehrlich. Da vergeht einem doch die Lust. Abgesehen davon das ich von dem zu 100% einen Report bekommen habe so wie in fast jedem 3ten Game in welchem ich halt nicht wie ein Dia-Spieler gespielt habe, regt es mich auf das das Tribunal anscheinend null gegen solche Leute bringt. Gibt es ne M&ouml;glichkeit irgendwas zu tun? Ein Freund meine ich soll einfach das ganze Team muten, aber dann verhindere ich doch die Kommunikation?","replies":[{"poster":"Temudschinn","date":"2015-04-30T13:34:55.624+0000","up_votes":3,"down_votes":0,"body":"Das Gefühl hatte ich auch oft. Wichtig ist, dass du einen guten Umgang findest: Wie kannst du verhindern, dass du dich zu oft aufregst?\n\nEinige Möglichkeiten:\n-Pausen zwischen den Spielen\n-Beim geringsten Anzeichen von Flame den betreffenden sofort muten (ohne kommentar)\n-Sich über all die Dinge informieren, die Riot tut um gegen flaming vorzugehen (Gute Videos auffindbar auf GDC Vault unter suchbegriff Jeffrey Lin)\n-Einige Tribunal-Fälle bearbeiten (momentan nicht möglich)","replies":[{"poster":"eingew","date":"2015-04-30T13:48:54.500+0000","up_votes":5,"down_votes":0,"body":"Alternativ zum Tribunal kann man sich Forenbeiträge von Flamern durchlesen und glücklich sehen, dass diese bestraft wurden.","replies":[]}]},{"poster":"HyperionCH","date":"2015-04-30T09:14:41.668+0000","up_votes":3,"down_votes":1,"body":"Ja, es braucht grundsätzlich schon ein dickes Fell, wenn man LoL spielt.\nEs dauerte bei mir glaube ich über ein Jahr, bis ich Stufe 30 wurde. Dies lag daran, dass ich zwischenzeitlich Pausen einlegte, weil mir dies zu viel wurde (und dies obwohl ich anfangs nur Botgames spielte, weil ich keinerlei Moba-Erfahrung hatte). \n\nErgänzend zum bereits gesagten, hier einige Tipps, die dir helfen könnten:\n\n- Informiere dich über das Reportingsystem (z.B. werden Flamer von der Chatanalyse überführt und nicht vom Tribunal, welches derzeit down ist). Wer gut darüber informiert ist, weiss dann, wie es funktioniert und wie die Flamer später bestraft werden.\n\n- Dieses Forum hier zu besuchen, ist immer wieder hilfreich. Es gibt immer wieder QQ-Threads von bestraften Spielern. Dies bestätigt, dass dieses System gut funktioniert. Seitdem ich das System besser kenne (1. Punkt) und immer wieder Threads von bestraften lese, nehme ich den Flame ingame lockerer auf. Schliesslich weiss ich ja, was diesem Spieler bald blüht. ;)\n\n- Es gibt hier einen Thread \"Liga der Gentlemen\". In diesen Clan kommt man nur, wenn man nicht flamet (bzw. wird man sonst wieder rausgeworfen). Für Spieler, die gerne mit Premades spielen, die nicht flamen, ist dies ein guter Ort.","replies":[]},{"poster":"Nephirelle","date":"2015-04-30T09:00:46.280+0000","up_votes":4,"down_votes":2,"body":"Hier gibt es genügend Heulthreads von Bestraften, also keine Bange, die bekommen alle, was sie verdienen.\n\nUngerechtfertigte Reports kannst du getrost ignorieren, die tun dir nichts. Wenn jemand \"Report Malphite!\" oder Änhliches schreibt, ist das sogar ein Reportgrund gegen denjenigen. Keiner darf zu Reports anstacheln, das zählt als negative Einstellung.\n\nWenn Leute einen Sündenbock suchen, dann finden sie auch schon ihre teilweise sehr irrationalen Gründe. Neulich durfte ich beobachten, wie ein Support seinen ADC wegen KS beschimpfte (der KS-Vorwurf an sich ist schon Blödsinn, aber hier war er noch unsinniger). Und an anderer Stelle, nachdem ich mein Team gecarried habe, wir aber trotzdem verloren haben, durfte ich mich beschimpfen lassen, dass wir nur verloren hätten, weil ich so viele Kills genommen hätte.\n\nIch kann dich schon verstehen. Ich überlege momentan auch, erstmal einen Monat Pause einzulegen, weil mir die Leute in meinen letzten Spielen einfach zu - sagen wir es nett - anstrengend geworden sind was ihre Schuldzuweisungen angeht. Aber ein Stück weit ist das nunmal das Naturell von kompetitiven Spielen. In der Sportwelt schaffen es die Leute auch nicht immer fair. Nur im Spiel gibt es halt keine \"rote Karte\", die uns die direkten Auswirkungen unserer Reports sehen lässt. Aber die Auswirkungen sind trotzdem da, glaub' mir.","replies":[]},{"poster":"Aridge44","date":"2015-05-28T00:16:01.032+0000","up_votes":1,"down_votes":0,"body":"Das ist überhaupt nicht richtig !\nEs ist sehr wohl so, das Spieler die sich nicht \"richtig Benehmen\", bestraft werden.\nWie komme ich auf die Idee ? Sagen wir es so, ich erfahre es am eigenen Leid. ;)\nKlar ist, das man nicht sofort bestraft wird, aber wie bereits erwähnt, verfolgt das System\ndas schlechte Verhalten. Ich finde daher folgenden, vielleicht nicht Wortwörtlichen Satz passend:\n\"Jeder hat mal ein schlechten Tag.....\"\nIch bin auch am Anfang sehr ruhig gewesen und mich gewundert warum alle so abgehen.\nNach einiger Zeit habe ich mich darauf eingelassen bzw. habe ebenfalls begonnen zu beleidigen,\nnachdem ich beleidigt wurde. Nur ein Problem hat das ganze. Es läuft hier nicht nach dem Prinzip\n\"Wie du mir, so ich dir!\" Und daher habe ich \"Chat & Ranked bans bekommen. NIcht unbedingt zu unrecht.\nWas mich persönlich so verärgert, ist das die Aufrufe kamen, \"report Aridge, he always flame\",\ndabei habe ich nur meinen Midlaner kein Blue gegeben, da dieser sich zu schade war, Wards zu kaufen.\nMit anderen Worten, er wurde oft gegangt oder auch \"gesittet\", was man mit wards einfacher verhindern kann.\nUm auf die Reports zurück zu kommen. Er war der Meinung mit sein Premade alle dazu aufzurufen mich zu reporten.\nUnd mein Team drohten sie mit \"If u don´t report, we go afk!\". Ende von Lied bekam ich 9 reports und dann auch die Bans.\nWas ich aber hier im Forum festgestellt habe, war folgendes. Ich habe die bans nicht aus dem Grund bekommen, das\nmich 9 Leute reportet haben, sondern das ich in der Vergangenheit (wie oben erwähnt) auch ausfallend wurde.\n\nAlso um dich zu beruhigen. Es stimmt, jeder kriegt (früher oder später) was er verdient...\nUnd ich ärger mich, das ich nicht öfter bzw. genauer im Forum gestöbert habe, denn wäre ich den bans entgangen :D\n\nSry für den Roman ^^\nMfG","replies":[]},{"poster":"Infevo","date":"2015-05-24T14:30:14.691+0000","up_votes":1,"down_votes":2,"body":"\"keine sorge. die bekommen alle, was sie verdienen.\" =D =D =D\nSeit 2 Jahren dieselbe Leier und jene Leute sind in fast jedem ranked Game anzutreffen. Ihr seid mir schon ein paar clowns. Da wird sich nichts ändern, solange nicht ein vernünftiges Spieler Tribunal zurückkommt!","replies":[]}]}