{"poster":"Darth West","date":"2017-05-10T09:42:32.877+0000","title":"Why was Spirit Visage nerfed exactly?","subforum":"Gameplay","up_votes":80,"down_votes":33,"body":"I honestly just want a reason from Riot for nerfing this item.\n\nCommunity asked for 25 HP to be added to the Item, thanks for giving us it.\n\nIn return we get -5 MR + -100% HP Regeneration. \n\nSo.. We ask for the item to get a small little buff and you nerf it harder then it already was? I want a damn good reason tbh.\n\n(Community even kept saying they wouldn't mind if the price is increased to keep the stats, yet you refused to listen)..\n\n__________________________________________________________\n\nI can&#039;t think of any reasoning to nerf it that badly.","replies":[{"poster":"Khâmul","date":"2017-05-10T09:53:25.928+0000","up_votes":32,"down_votes":10,"body":"Because they added 5% healing efficiency.that's the point of buying spirit visage","replies":[{"poster":"scarycoitus","date":"2017-05-10T09:56:23.910+0000","up_votes":7,"down_votes":40,"body":"> [{quoted}](name=Khâmul,realm=EUW,application-id=3ErqAdtq,discussion-id=ihIAmmlh,comment-id=0000,timestamp=2017-05-10T09:53:25.928+0000)\n>\n> Because they added 5% healing efficiency.that&#x27;s the point of buying spirit visage\n\n\nwho cares?  that's useless tbh.","replies":[{"poster":"Khâmul","date":"2017-05-10T10:44:27.041+0000","up_votes":42,"down_votes":3,"body":"> [{quoted}](name=scarycoitus,realm=NA,application-id=3ErqAdtq,discussion-id=ihIAmmlh,comment-id=00000000,timestamp=2017-05-10T09:56:23.910+0000)\n>\n> who cares?  that&#x27;s useless tbh.\n\n{{champion:420}} {{champion:122}} {{champion:82}} {{champion:75}} {{champion:57}} {{champion:83}} {{champion:48}} {{champion:106}} {{champion:19}}{{champion:36}}   and others.\nthat bonus  healing is worth all the health regen of the world during a fight.","replies":[{"poster":"Krys Star","date":"2017-05-10T10:59:24.496+0000","up_votes":44,"down_votes":0,"body":"{{champion:16}} \n\nI'm the happiest support when my team mates buy Spirit Visage.","replies":[{"poster":"Khâmul","date":"2017-05-10T11:11:28.927+0000","up_votes":17,"down_votes":0,"body":"nah dude,it's useless according to this guy.no one cares","replies":[]},{"poster":"Need Gold 4 Tent","date":"2017-05-10T16:07:38.834+0000","up_votes":5,"down_votes":0,"body":"and cry when the enemies also buy {{item:3033}}","replies":[{"poster":"Votable Jester","date":"2017-05-10T18:34:28.925+0000","up_votes":3,"down_votes":0,"body":"Psssht that's only ever bought in like Diamond+ :P","replies":[]}]}]},{"poster":"Spoofghoul","date":"2017-05-10T12:53:43.395+0000","up_votes":4,"down_votes":1,"body":"but that 5% is less then the 100% base hp regen you will lose out on\n\nexcept for mordekaiser\n\nso enjoy your nerf","replies":[{"poster":"Khâmul","date":"2017-05-10T13:19:52.407+0000","up_votes":2,"down_votes":1,"body":"So when Darius/illaoi/maokai regen  like crazy,it's the  base health regen ? Damn i was wrong for all this time! (Btw i main morde,so no nerf for me XD)","replies":[{"poster":"Spoofghoul","date":"2017-05-10T13:22:28.716+0000","up_votes":3,"down_votes":2,"body":"well the 5% does not equal the 100% regen which also gets boosted by the same passive for most of them\n\nAnd while these guys might have innate healing most tanks don't so all they have is regen","replies":[{"poster":"Khâmul","date":"2017-05-10T13:41:37.823+0000","up_votes":1,"down_votes":0,"body":"Ofc,this ils why i didn't include malph/ammumu etc..in  the  roster  .i put  champions relying on sustain abilities/passives.something giving you a huge amount of health in  a short time","replies":[{"poster":"PB4UAME","date":"2017-05-10T21:29:03.009+0000","up_votes":2,"down_votes":1,"body":"passive sustain is always up, and also double dips off its own increased healing effect.  In combat sustain while situationally higher numbers is, in every case just mentioned overall *significantly* less than they regen from their passive hp regen.\n\n5 hp a second over a thirty minute game is 9,000 healing.  All of those champions will have less healing done than they passively regened.  5% of that healing, then is worth less than 1/20th of the passive regen lost in the longer term for those with high natural health regen.\n\nA level 13 Darius has a base health regen of 4hp/second, his Q can, at max, heal him for 36% of his missing hp.  Let's give him 2k hp, and say he's at 1, and hits three people with his blade.  He'd heal for 719 damage.  the 5% increased healing would account for less than 36 hp, or the equivalent of 100% base hp regen ticking for. . . only 9 seconds.  Oh, and he always gets that regen without regards to hitting anything, or even the presence of enemy champions.  Don't forget, that passive regen *also* occurs during combat.\n\nSo, in a best case scenario on the champion with the largest burst healing, the passive hp regen is worth quite a bit more. \n\nSure, if he had 4k hp, was at 1, and got three people hit it would take almost 18 seconds of passive regen; but wait, by the time he'd have that much, he's be near level 18, where he gets 5.2 hp/sec so that almost 1440 damage times that 5% increased healing gives only 71 health, which would take just over 13.5 seconds to regen, and does not require the absurd 3,999 missing hp. \n\nAlso, a level 18 heimer gets 8 extra hp a second from 100% increased hp regen, and Gnar gets almost 7 a second.  Some champions with high natural regen get SV too, not just ones who want increased self heals.  Why should they get their item nerfed this way without compensation?\n\nTL;DR in every scenario 100% increased regen is worth more than 5% increased healing unless you get blown up instantly; also 5% increase healing even on a 1440 hp heal, which only Darius and maybe Vlad can even get is less than 75hp and will not be noticeable except over the course of a full game, wherein it is surpassed in every single case by 100% increased base hp regen.","replies":[]}]}]}]}]},{"poster":"nice table","date":"2017-05-10T11:19:01.210+0000","up_votes":5,"down_votes":2,"body":"as a voli / warwick main i can tell you that they don't give 2 shits about the extra 5%","replies":[{"poster":"Khâmul","date":"2017-05-10T11:33:22.841+0000","up_votes":4,"down_votes":1,"body":"but when health regen is nerfed,everyone loose their mind right?","replies":[]}]},{"poster":"GULAG 4 U","date":"2017-05-10T19:39:48.001+0000","up_votes":2,"down_votes":0,"body":"{{champion:266}} pls","replies":[]}]},{"poster":"GigaPube","date":"2017-05-10T11:05:14.202+0000","up_votes":2,"down_votes":2,"body":"there is an entire keystone mastery to do with increasing the effectiveness of healing by 10%\n\nthey added the value of almost half a keystone mastery to give it a total of 3 times the value of the most important effect of that entire keystone mastery","replies":[{"poster":"nice table","date":"2017-05-10T11:25:33.553+0000","up_votes":3,"down_votes":1,"body":"windspeakers blessing also increases the shields and gives magic resist + armor, saying that 5% healing is half of the keystone is retarded as its not even close.","replies":[{"poster":"Jerry SeinfeId","date":"2017-05-10T13:10:23.781+0000","up_votes":1,"down_votes":0,"body":"The keystone is known to improve shields/heals. Ardent censer gives AS (i think idk exactly) on heal but people will still refer to it as an item that improves your healing.","replies":[{"poster":"nice table","date":"2017-05-10T14:53:14.686+0000","up_votes":2,"down_votes":0,"body":"i guess it might be described it as a healing item in bronze but its not bought to improve healing nor is the healing buff the most important part of the item.","replies":[]}]}]}]}]},{"poster":"Gosh Darn","date":"2017-05-10T18:35:19.525+0000","up_votes":3,"down_votes":0,"body":"But that's not a valid argument because it has less stats than it did before the 30% healing, and the health regen was halved, which is absolutely massive and actually results in 130% health regen lost.","replies":[]}]},{"poster":"Sraeg2013","date":"2017-05-10T14:00:41.839+0000","up_votes":19,"down_votes":0,"body":"I remember when I told Meddler that Lux's Singularity is slowing outside it's intended radius (i.e. it was higher than visuals and the damage part).\n\nSo what they did?\n\nThey made visuals and the damage zone bigger.\n\nI curse myself to this day for telling him that.","replies":[{"poster":"GayFluffyUnicorn","date":"2017-05-10T20:57:15.386+0000","up_votes":3,"down_votes":0,"body":"U deserve a special place in hell my good sir. \nBut when you are at it, could u tell riot that GP barrels do the same thing? So maybe they get buffed.","replies":[{"poster":"Sraeg2013","date":"2017-05-10T21:16:51.254+0000","up_votes":3,"down_votes":0,"body":">U deserve a special place in hell my good sir.\n\nI already got a nice reservation. There's an empty room next to mine, if you're interested.\n\n>But when you are at it, could u tell riot that GP barrels do the same thing? So maybe they get buffed.\n\nBut it's GP, not Lux. Do you really want him nerfed further?","replies":[{"poster":"dnsup","date":"2017-05-11T01:15:48.044+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Sraeg2013,realm=EUNE,application-id=3ErqAdtq,discussion-id=ihIAmmlh,comment-id=000500000000,timestamp=2017-05-10T21:16:51.254+0000)\n\n> > But when you are at it, could u tell riot that GP barrels do the same thing? So maybe they get buffed.\n\n> But it&#x27;s GP, not Lux. Do you really want him nerfed further?\n\nAs someone who doesn't necessarily want GP buffed ***or*** nerfed, I think that's a good point. Rito shows no mercy in twisting intentions.","replies":[{"poster":"3TWarrior","date":"2017-05-11T04:06:37.066+0000","up_votes":2,"down_votes":0,"body":"remember when they nerfed twisted fate's base damages when his strength is in his utility?","replies":[]}]}]}]},{"poster":"TwitchInMyPants","date":"2017-05-11T03:01:17.438+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Sraeg2013,realm=EUNE,application-id=3ErqAdtq,discussion-id=ihIAmmlh,comment-id=0005,timestamp=2017-05-10T14:00:41.839+0000)\n>\n> I remember when I told Meddler that Lux&#x27;s Singularity is slowing outside it&#x27;s intended radius (i.e. it was higher than visuals and the damage part).\n> \n> So what they did?\n> \n> The made visuals and the damage zone bigger.\n> \n> I curse myself to this day for telling him that.\n\nHoly shit Riot logic\n\nIf we ever tweak anything in the game we have to buff/nerf it too kek, that \"Perfect Imbalance\"","replies":[]}]},{"poster":"LordGeovanni","date":"2017-05-10T18:26:37.364+0000","up_votes":9,"down_votes":0,"body":"Community dared ask for simple addition to make sense","replies":[{"poster":"Dominick Destine","date":"2017-05-10T22:46:01.809+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=LordGeovanni,realm=NA,application-id=3ErqAdtq,discussion-id=ihIAmmlh,comment-id=000f,timestamp=2017-05-10T18:26:37.364+0000)\n>\n> Community dared ask for simple addition to make sense\n\nThis.\n\nThis reminds me of the Vayne nerfs when Vayne was absurdly overpowered.... -3 AD","replies":[{"poster":"3TWarrior","date":"2017-05-11T04:09:37.074+0000","up_votes":2,"down_votes":1,"body":"lol, which they justified by saying that they did not want to change her before her upcoming place in the marksman update\n\nin which they buffed her...  even though she had one of the lowest winrates...once the others were \"balanced\" it was finally discovered that she had too much power in her kit...power that no one wanted","replies":[]}]}]},{"poster":"Salron","date":"2017-05-10T12:58:01.920+0000","up_votes":4,"down_votes":6,"body":"This is why\nhttp://puu.sh/vLBEm/72c2159e66.png","replies":[{"poster":"Meep Man","date":"2017-05-10T14:11:09.656+0000","up_votes":8,"down_votes":0,"body":"How is that a legitimate reason? It's been that way since forever.","replies":[]},{"poster":"Sire Hippington","date":"2017-05-10T13:45:19.854+0000","up_votes":7,"down_votes":0,"body":"and befor the tank upgrade it was 260% for ages, so....how does that now justify a 100% nerf?","replies":[{"poster":"Salron","date":"2017-05-10T14:54:53.129+0000","up_votes":1,"down_votes":5,"body":"They increased the healing bonus","replies":[{"poster":"Sire Hippington","date":"2017-05-10T16:27:30.294+0000","up_votes":7,"down_votes":0,"body":"and lowered the hp","replies":[]}]}]},{"poster":"DragonShea","date":"2017-05-10T13:01:52.287+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Face The Win,realm=NA,application-id=3ErqAdtq,discussion-id=ihIAmmlh,comment-id=0004,timestamp=2017-05-10T12:58:01.920+0000)\n>\n> This is why\n> http://puu.sh/vLBEm/72c2159e66.png\n\nDarius has one of the highest HP regen in the game. Another thing people will cry about.","replies":[{"poster":"Big Lincoln","date":"2017-05-10T13:53:12.613+0000","up_votes":3,"down_votes":0,"body":"that'd actually be a pretty fair way to nerf him if he needs another one in the future, though","replies":[{"poster":"SquashCannon","date":"2017-05-10T23:58:50.537+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Big Lincoln,realm=NA,application-id=3ErqAdtq,discussion-id=ihIAmmlh,comment-id=000400000000,timestamp=2017-05-10T13:53:12.613+0000)\n>\n> that&#x27;d actually be a pretty fair way to nerf him if he needs another one in the future, though\n\nThere is no need. Darius being broken is a dead horse that lower elo players keep trying to beat.","replies":[]}]}]}]},{"poster":"Only Play Darius","date":"2017-05-10T14:46:41.326+0000","up_votes":7,"down_votes":0,"body":"The joke is that +25 HP really only makes it so that it has as much HP as its components, it's more of a bugfix than anything.","replies":[]},{"poster":"Sexy Jack Rabbit","date":"2017-05-10T11:01:51.526+0000","up_votes":9,"down_votes":9,"body":"It was unanimously the best choice for MR items and was crowding out other options.\n\nThere was no point in buying either {{item:3194}} or the new {{item:3001}} as  a result of it's generalism. ","replies":[{"poster":"RainbowIcee","date":"2017-05-10T14:19:17.782+0000","up_votes":8,"down_votes":1,"body":"Probably because those are situational mr items. Who told them to designed them that way ? An AD tank has no use for the {{item:3001}}  especially if the team is full of ADs. And {{item:3194}}  is expensive as shit and the build path is mediocre not only that it's situational too it's best used to tank champions that spam the same skills or have DOT's or constant spell damage. Example it's good vs teemo, and swain but the damage reduction isn't good enough to buy it over {{item:3065}}  which gives health regen, lots of MR and ! cdr. or {{item:3193}}  which gives MR armor and a x2 hp active.","replies":[]},{"poster":"Champion Skin","date":"2017-05-10T12:34:38.180+0000","up_votes":3,"down_votes":1,"body":"Wait.... isn't {{item:3193}} the best MR item for tanks giving up to 80 MR and 80 armor and a pretty powerful active","replies":[{"poster":"Jerry SeinfeId","date":"2017-05-10T13:07:48.111+0000","up_votes":5,"down_votes":0,"body":"yes, but bruisers often want some defensive items too. And Spirit visage is less situational, synergizes well with kits/items.","replies":[]}]}]},{"poster":"macromite","date":"2017-05-10T16:24:08.317+0000","up_votes":1,"down_votes":10,"body":"It was a net 0 change really.\n\nRegen is down 40% but effective health is up.\n\nYes, lowering the magic resist and adding 25 points of hp is actually BETTER than it was.","replies":[{"poster":"Glory ln Death","date":"2017-05-10T17:04:02.324+0000","up_votes":8,"down_votes":0,"body":"Actually, if you do the math to compare, there is no point where you will have more effective health after the change, unless you have really low health and really high MR (at 1000 health before purchase, you would also need to have 300 MR for the PBE Spirit Visage to give higher effective health). It's a nerf, any way you look at it.","replies":[{"poster":"macromite","date":"2017-05-10T17:10:36.515+0000","up_votes":1,"down_votes":6,"body":"425+(425x.6)=680\n450+(450x.55)=697.5\n\nThe actual statistics on the item favor the change in effective.","replies":[{"poster":"Glory ln Death","date":"2017-05-10T17:56:22.305+0000","up_votes":7,"down_votes":0,"body":"If you are only looking at the item itself, yes. But, if you look at its real effectiveness on a champion during a game,  the change gives an immediate loss in effective health.\n\nIf you were to purchase it at level 1 with 550 health (most tanks have about 550 at level 1) and your base 32 MR, the changes give you 2 less effective health. \n\nIf you have 1000 base health and 39 base MR, the changes give 22.5 less effective health. \n\nAt 2000 base health and 53 MR (standard for level 18), the changes give you 69.25 less effective health.\n\nIf you had a number of health items and some extra MR, putting you at 3500 health and 150 MR before purchasing SV, the changes give you 120 less effective health. With that amount of health, you would need over 600 MR before purchasing SV to break even.\n\nIn terms of its real power, every change here is a straight up nerf (except for a very small buff to champions with health scalings - like, 2.5 - 5 more shield strength/damage). And, nerfing it may well be justified, but you certainly can't call it a net neutral change.","replies":[{"poster":"macromite","date":"2017-05-10T19:01:24.520+0000","up_votes":1,"down_votes":4,"body":"Lets take a look at a typical build disregarding champion for a second.\n{{item:1401}} {{item:3111}} {{item:3065}} {{item:3742}} {{item:3083}} {{item:3193}} \nThe effective health of this build is \n2357+(2357x1)=4714 (9428-ish with active)\n                                                            2357+(2357x1.25)=5303 (10606-ish with active)\n\nWith the changes the effective health is\n2382+(2382x1)=4764 (9528-ish)\n2382+(2382x1.2)=5240 (10480-ish)\n\nWhich is very similar, with a more rounded sum between the two effective healths due to hp rather than resistance, which though we lose 13 points overall for, it makes the build stronger.\n\nFor the kicks Imma do the same effective check but as though the items never got changed.\n\n2530+(2530x.9)=4525 (9050-ish)\n2530+(2530x1.2)=5566 (11132-ish)\n\nThis is 87 points stronger than the new spirit.\n\nALSO\nIf you want me to do a different build I can do so, though I believe the results will stay about the same.","replies":[{"poster":"Glory ln Death","date":"2017-05-10T19:59:34.137+0000","up_votes":6,"down_votes":0,"body":"1. Label what you are doing. It took about 10 minutes to figure out why you had a random second equation with no explanation as to what anything represents.\n\n2. 13 lower health is statistically weaker. You are going to die more quickly. Not to mention, Spirit Visage is intended to counter magic damage. The impact on effective health against magic damage should be weighted more strongly than the impact on effective health against physical damage. \n\n3. As your math proves, this is a nerf, even including effective health against physical damage. This is more noticeable the more health you build. Combined with the health regen nerf, it is pretty noticeable.","replies":[]}]}]}]},{"poster":"Hyrum Graff","date":"2017-05-11T17:29:32.822+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Glory ln Death,realm=NA,application-id=3ErqAdtq,discussion-id=ihIAmmlh,comment-id=000d0000,timestamp=2017-05-10T17:04:02.324+0000)\n>\n> It&#x27;s a nerf, any way you look at it.\n\nA nerf against *magic* damage.","replies":[]}]}]},{"poster":"Escheton","date":"2017-05-10T11:09:52.461+0000","up_votes":5,"down_votes":3,"body":"Because fuck tanks and their high regen/5. Lets make it a drain-tank item. Good luck killing the adc now. \n\nSeriously, imagine an adc with an attackspeed steroid in their kit with {{item:3046}} {{item:3812}} {{item:3031}} {{item:3065}} {{item:3026}}. With a support taking {{item:3050}} to cover the other 50% crit. \n\nNo even current Sej is tankier than that.","replies":[]}]}