{"poster":"Kessler09","date":"2016-08-10T01:14:46.007+0000","title":"Como se carrea con leblanc ?","subforum":"Guias y consejos","up_votes":3,"down_votes":0,"body":"Esa es mi pregunta porque siempre salgo re bien pero mi equipo pierde toda la linea y pierdo yo","replies":[{"poster":"Ks Erwyn","date":"2016-08-10T01:20:41.122+0000","up_votes":6,"down_votes":0,"body":"Los campeones moviles como Lb carrean no nesesariamente stomepando sus propia linea si no haciendo raguear a la bot o top rivales contra su propio mid por tanto roam y muertes que le han dado a LB...","replies":[{"poster":"GatóMonstruo","date":"2016-08-10T04:36:59.695+0000","up_votes":1,"down_votes":0,"body":"Y algo que siempre digo, al menos en mi elo, 'No uses LB si no conoces a la gente con quien juegas' \nMe ha pasado en infinidad de oportunidades de estar jugando Lb y terminar con un KDA muy fenomenal (12-0) y perder la partida, ¿por qué? Porque  el equipo no se contenta con jugar en torno a LB. Siempre digo que es un champ muy teamdependiente, es decir, no podes hacer más que obtener Kills si no tenes un equipo que te acompañe en las jugadas.\n-Seguramente va a venir uno y me va a criticar diciéndome que LB carrea solo, que blabla bla, sólo estoy hablando desde mi posición y mi experiencia jugando Leblanc en Low Elo-","replies":[]},{"poster":"FedecarboneroUY","date":"2016-08-10T02:33:08.981+0000","up_votes":1,"down_votes":0,"body":"se carrea destrozando la moral del equipo enemigo, bien dicen que para {{champion:7}} no se necesitan manos.\n\nAguante mi smurf Main {{champion:7}} : Colett\n\n:v","replies":[]}]},{"poster":"Miroh","date":"2016-08-10T01:38:55.017+0000","up_votes":1,"down_votes":0,"body":"con romeo","replies":[{"poster":"Cipher","date":"2016-08-10T03:08:20.623+0000","up_votes":3,"down_votes":0,"body":"No te olvides de Julieta.","replies":[{"poster":"ll Leoh ll","date":"2016-08-10T06:42:28.814+0000","up_votes":1,"down_votes":0,"body":"jaajjajajajaaj","replies":[]}]}]},{"poster":"Tsuyeon","date":"2016-08-10T02:46:08.161+0000","up_votes":3,"down_votes":0,"body":"Paso 1: feedearte un poco en linea\nPaso 2: atrapar al jungla enemigo en su jungla y matarlo\nPaso 3: ayudar top y bot a feedearse\nPaso 4 deletear muchas veces hasta tiltear a alguno y luego a otro\nPaso 5: esperar hasta el min 20 a que se rindan\nPaso 6: en caso de que el 5 no suceda repetir el 4 hasta ganar\nPaso 7: en caso de llegar a late y que ya esten en un momento que el feed no importa tirar un Lindo combo en area y deletear a 2 para ganar una teamfight y GG\n\nojala te sirva esta guia en 7 pasos de como carrear con leblanc y casi cualquier asesino","replies":[]},{"poster":"Rolando Magic","date":"2016-08-10T01:28:56.396+0000","up_votes":1,"down_votes":1,"body":"Caminando por el teclado","replies":[]}]}