{"poster":"Justin0","date":"2019-06-07T01:47:08.813+0000","title":"Is it possible to get a permaban reverted?","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"As the title says. Posting because not getting any support other than blitz bot even though I requested a human.","replies":[{"poster":"TF Blade","date":"2019-06-07T04:25:26.794+0000","up_votes":1,"down_votes":0,"body":"Depends what it was for, I was permanently banned as the result of my account being compromised. However, if it was for something such as flaming in game or the chat review system picked something up, I don't think it's possible. And if it is, it is a very slim chance","replies":[{"poster":"Justin0","date":"2019-06-07T07:04:00.687+0000","up_votes":1,"down_votes":0,"body":"Unfortunately the reason was toxicity (I’ll only provide context if asked to) but was your account ever unbanned?","replies":[{"poster":"TF Blade","date":"2019-06-08T03:31:11.993+0000","up_votes":2,"down_votes":0,"body":"Probably the best thing to do on the boards is to provide the chat logs, but to answer your question, yes my account was unbanned but that's purely because it was compromised. The only cases i've seen of accounts getting unbanned for toxicity is when somebody repeats someone elses toxicity, eg\n\nPlayer 1: kys blah blah blah\nPlayer 2: telling someone \"kys\" is the wrong thing to do .... .etc, etc\n\nIn this case, player 2 would have been banned for saying one of the \"trigger\" words which in this case was \"kys\" but he would have been unbanned because he wasn't saying it in a toxic manner.\n\nHope this helps.","replies":[{"poster":"Justin0","date":"2019-06-08T08:45:53.233+0000","up_votes":1,"down_votes":0,"body":"Provides a bit of insight yeah thanks.","replies":[{"poster":"God kimchi","date":"2019-06-09T21:50:48.598+0000","up_votes":1,"down_votes":0,"body":"my friend got perma for saying ur mom gay lol but you do get warnings and chat bannes before you get a perma ban for toxic","replies":[]}]}]}]}]},{"poster":"Project Xayah","date":"2019-06-07T05:33:57.991+0000","up_votes":1,"down_votes":0,"body":"The only way to get a punishment removed is if it was made in error (either a punishment shouldn't have occurred, or a lower tier punishment should have occurred). The standard appeal process is to submit a ticket to Support, which should trigger a manual review and get a response. There is an extremely low rate of false positives, however, so the chance of getting a punishment removed is negligible.\n\nIf you want, you can provide details regarding the punishment on the boards (what category it fits into, any evidence provided by Riot such as chat logs or match history links, what's been said by support etc), which will allow boards users (volunteers in particular) to provide guidance on how to proceed (and the likelihood of actually getting the punishment removed). Without any of the details, however, you wont be able to get any assistance through the boards, which means your only option would be to handle the situation through Support.\n\nIt's important to note that we can't actually change anything about the punishments players receive, all we can do is provide information and guidance, so your only real chance of getting the punishment removed is still Support.","replies":[]}]}