{"poster":"Neamhoilte","date":"2015-06-17T19:11:34.015+0000","title":"Audienzsaal des Offtopics!","subforum":"Allgemeiner Chat","up_votes":24,"down_votes":3,"body":"Hallo Freunde des OT&acute;s,\n\neigentlich gab es immer den Audienzsaal des K&ouml;nigs im OT. Zum einen m&ouml;chte ich diese Tradition beibehalten, zum anderen nehme ich mir aber die k&ouml;nigliche Freiheit, dieses in etwas abge&auml;nderten Form zu gestalten.\n\nDeshalb gibt es jetzt den _Audienzsaal des Offtopics!_    \n\nDieser Thread ist nicht daf&uuml;r gedacht, um Doenerlord auf den Kopf zu schlagen damit es Licht bringt, oder nach B&auml;rlauchtee zu betteln, geschweige denn das Saur zu jagen etc pp. : ) Daf&uuml;r haben wir schon einen Thread.\n\nVielmehr m&ouml;chte ich uns einen Raum bieten, wo wir unsere W&uuml;nsche, Anregungen, Ideen, Visionen und Gedanken zum / &uuml;ber das OT posten, damit wir gemeinsam etwas schaffen k&ouml;nnen. Manchmal reicht es ja schon, wenn jemand mit einem \" Wie w&auml;re es, wenn wir z.B. \" kommt und der eine oder andere diesen Gedankengang weiterspinnt. Sollten wir das schaffen, dann haben wir einen Schritt in die richtige Richtung getan! \n\nAuch ist es hier m&ouml;glich, die Aufnahme ins K&ouml;nigreich zu beantragen!\n\n\nTANTE EDITH: Ok, da ich ja schon länger kein König mehr bin, habe ich es heute am 4 Juli 2017 endlich geschafft, diesen Post zu bearbeiten. \n\n\n\n\nHiermit ernenne ich _Riot Kengen_ zur Ehrenbürgerin des OT`s!\n\nIn diesem Sinne: Rettet die Poros! \n\n17/6/2015 BecksnStout, 7ter OT K&ouml;nig","replies":[{"poster":"sN00Bdogg","date":"2017-05-20T01:42:14.806+0000","up_votes":7,"down_votes":0,"body":"**WTF news **\n_Staunenswertes aus der wissenschaftlich-teemologischen Fakultät des Königsreich Offtopic_\n_(Erstausgabe der zweiten Ausgabe) _\n\n\n**Beschmutzung meines Namens **\n\n_König reagiert energisch - Hochzeitsreise mit Prinz_\n\nUnsere königliche Hoheit, unser aller so hochverehrter und wohl geschätzter Eibert 1. , wurde am gestrigen Abend unerwarteter Weise sehr deutlich. Denn die Forumsattacken des EibertRümmelBot richten sich gegen das Wohl aller OTler. \"Peinlich\" bezeichnete Eibert den Versuch, sich als  Trittbrettfahrer auf dem Ruhm und dem Ansehen unseres Imprägnators ins Rampenlicht fahren zu wollen. Die Spekulationen darüber, wer sich hinter dem pubertären \"System\"\nstecken könnte beunruhigen die hoheitlichen Kreise jedoch  stärker als man bei Throne bestätigen mag. Selbst von einem Komplott finsterer Mächte wurde gemunkelt. Würde das Ende der Regentschaft nicht bereits feststehen, sicherlich würden die Spekulationen über ein verfrühtes Absetzen des Herrschers ins Kraut schiessen. Hinter vorgehaltener Hand soll sogar das Wort \"Putsch\" die Runde machen. \"Replacement\" war eine eindeutige Kamppfansage. Da sägt jemand am Stuhl!  Die heutige klare Antwort des Königs wurde allgemein als kämpferisch und keinesfalls amtsmüde interpretiert. \n\nIm Interview mit dem Kollegen Rümmelbiergragas  (https://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/Wrpn55qE-interview-mit-eibert-rammel) gab es allerdings auch sehr erfreuliches zu verzeichnen. So steht doch die Hochzeit mit der lieblichen Dame **Superkahlan** vor der Türe. Hierzu gratulieren wir und wünschen dem Paare das beste Gelingen in allen Lebenslagen. Als ob dies noch nicht genug der GoodNews wären, so schlägt doch die folgende Sensation dem Fass den Boden aus: Das königliche Paar hat bereits Nachwuchs. **One Step Down** heisst der süsse Racker, wird auch gerne mal Kevin gerufen und ist durch diese Adoption sicherlich erstmal ein paar Schritte nach oben gepurzelt. Kurioserweise wollte sich der süße kleine Teenager seinem Glück nicht fügen, doch mit seiner zukünftigen Braut an der Seite liess es sich Eibert nicht nehmen und schuf mit der Lex Kevin die gesetzlichen Grundlagen, um diese Adoption zum Prinzen auch gegen den Willen des kleinen Buben durch zu setzen. Somit ist es beschlossen: Ab heute ist klein Kevin nie mehr allein zu hause!\nAus Platzgründen ist der Bengel vorerst in der Mädchentoilette eingezogen und wandelt nun als munterer Hausgeist durch die Königlichen Gemächer und Hallen. Sehr zur Freude unserer kommenden Königinmutter.\nSicherlich stellt sich hinsichtlich der Fakten die Frage, ob denn die erst noch zu schliessende Ehe angesichts des Nachwuchses bereits als vollzogen gewertet werden muss. Prof. Namiultedformose war leider nicht für eine Stellungnahme erreichbar, soll aber bereits mit einem Team an der Lösung arbeiten. Wir werden berichten ...\n\n**Bauprojektierungen begonnen**\n\nAlles neu macht der Mai. Im Zuge der extremen Expansion des OT in den vergangenen Wochen, kommen Veränderungen aufs Königreich OT zu. So wurden bereits zahlreiche Grossprojekte ins Auge gefasst, um unsere Heimat auch in Zukunft gut da stehen zu lassen. Die detaillierten Projektpläne liegen der Red noch nicht vor, jedoch ist aus gesicherten Quellen bekannt, daß ein OT Kindergarten angedacht wurde. \nEbenso gehen die Planungen für die Reichsdruckserei weiter. Momentan sehen die Planer die  Unterbringung der 30 Buchstabenoberbeauftragten im Staatsdienst (BobiS) noch als Hürde für ein rascheres Fortschreiten. Solange gilt: \"Papier ist geduldig!\" \nZudem wird darüber nachgedacht die WTF news in weisser Schrift auf weissem Papier zu drucken, da man die Seiten dann noch individuell beschriften könnte. Ausserdem blieben dadurch nicht direkt visuell einsehbare Körperzonen von Druckerschwärze befreit, selbst wenn die WTF news zu Reinigungszwecken verwendet würde.\n\n\nVerantwortlicher Interimsredakteur: Prof. Dr. teem. sN00bdogg; Teemologe und Hund.","replies":[]},{"poster":"sN00Bdogg","date":"2017-05-22T12:40:33.476+0000","up_votes":6,"down_votes":0,"body":"**WTF** _news _ \nStaunenswertes aus der wissenschaftlich-teemologischen Fakultät des Königsreich Offtopic\n\n**EXTRABLATT**\n\n----------------------------------------------------------------------------------------------------------------------------------------\n\n**EibertRümmelBot enttarnt - Swisskeks outet sich **\n\nIn der gestrigen Nacht konnte endlich die Identität des EibertRümmelBot gelüftet werden. Jener Bot, der mit seinem \"Project: REPLACEMENT\" danach trachtet, unseren König noch vor dem Ende seiner Amtszeit vom Thron zu stoßen. Jetzt konnten unter Führung der canoiden Spürnasen der WTF Redaktion die Fährte bis zu Swisskeks verfolgt werden. Trotz seiner Überaschung über den sehr raschen Ermittlungserfolg der WTF Reporter war Swisskeks sofort bereit bei einem Rümmelbier den ersten Nachfragen Rede und Antwort zu stehen.  \n\nAuf die Frage nach seiner Motivation gab es allerdings eine überaschende Antwort. \"_Ganz einfach: Langeweile!_\" so das ernüchternde Statement. Allerdings bieten die Antworten dem psychologisch versierten Interviewer aller Hand Ansätze das Verhalten des bisherigen königlichen Diplomaten zu hinterfragen. So liegt die Vermutung nahe, daß es dem Schweizer nicht mehr genügte immer nur neutral zu sein. Auch, daß er immer fürs OT sprechen muss ohne etwas sagen zu dürfen, mag eine Rolle gespielt haben. Vor allem, wenn ihm \"_keiner mehr sagt, was nicht gesagt werden soll!_\" \nGerade in letzter Zeit litten \"_die hoheitlichen Verrichtungen sehr unter der Verliebtheit des Königs_\". Die momentanen Entwicklungen im Königreich OT geben \"_starken Anlass zur Sorge_\",  so Swisskeks weiter. \"_Da muss man etwas unternehmen solange noch Zeit bleibt! Viel mehr als einfach nur eine Schoki zu essen und abzuwarten!_\" \n(Das vollständige Interview drucken wir exclusiv in der nächsten regulären Ausgabe der WTF news. Die Red.)\n\nSofort nach Erscheinen des EibertRümmelBots schossen die Gerüchte ins Kraut, wer sich hinter dem Pseudonym so feige verstecken könnte. Sogar von einer Gruppe von Putschisten wurde gemunkelt. Als Auslöser wurde in Königskreisen aber auch Eifersucht diskutiert. Hatten doch nach dem königlichen Heiratsantrag an die Dame Superkahlan mehrere Hofdamen ihren Neid zum Ausdruck gebracht. Man denke nur an die königliche Beraterin Angel Ayume und ihre unheilvoll klingenden Worte: \"_Doch verborgen im Schatten im hintersten Winkel des Saals steht eine kleine Gestalt, finster und böse schaut sie auf das Paar._\" Oder an pluviaglaciali  die förmlich zu Eis erstarrte als sie gerade erst angekommen im Audienzsaal dem Heiratsantrag beiwohnte. Die Ermittlungen bezüglich eines femininen Komplotts führten jedoch in die kassadinsche Leere, so daß man weiterhin im Dunkeln tappte. Jetzt war es wohl Swisskeks, der seinen Einfluss auf den König schwinden sah und sogar eine Revolution anzetteln wollte. \nKönig Eibert 1. zeigte sich überascht von diesem sensationellen Durchbruch, wollte aber noch keine endgültigen Schritte verkünden. Unser Monarch wertet das Vorgehen seines Vertrauten als \"**Schrei nach Liebe**\", was wohl dadurch ausgelöst wurde, daß er \"_nur noch Augen für meine Angebetete habe_\". Er wolle sich bei einem Rümmelbier mit Swisskeks aussprechen, um sich alsbald wieder voll auf die Hochzeitsvorbereitungen konzentrieren zu können. \nAuch Superkahlan war sehr erfreut, daß das feminine Komplott ausgeschlossen werden konnte. Kann sie doch jetzt bei den in Frage kommenden Brautjungfern wieder aus dem Vollen schöpfen, \"_was die Entscheidung nicht leichter macht_\", so Superkahlan mit einem leichten Stirnrunzeln.\n\n-------------------------------------------------------------------------------------------------------------------------------------\n\nStellvertretender Interims-Chef-redakteur: Prof. Dr. teem. sN00bdogg.","replies":[]},{"poster":"Der Großmugister","date":"2016-04-04T17:51:40.928+0000","up_votes":6,"down_votes":0,"body":"Es wird höchste Zeit, dass ich mal aus dem Schatten der Schänke trete.\nSeit etwa einem Monat beobachte ich, wahrscheinlich von den Meisten unbemerkt, was in eurem Königreich vor sich geht.\nDer gute Eibert hat mein intresse an eurem Reich geweckt, als ich auf der Reise durch das Forum, einen warmen Ort mit kalten Getränken suchte, um einen Abend zu verweilen.\nWie es das Schicksaal so wollte, war es genau der Abend des Umbruchs und so entschied ich, länger als geplant zu bleiben.\nBisher blieb ich ein mehr oder minder stummer Zuschauer, denn ich wollte die Einheimischen verstehen, bevor ich es wagte, mich in ihre Belange einzumischen.\nDie Zeit des Schweigens ist nun vorbei!!!\n\nGäbe es hier noch eine klare Befehlsstruktur, hätten mich die Wachen wohl längst des Saales verwiesen, doch ich rate euch, mir Gehör zu schenken, auch wenn ich kein Bürger eures Reiches bin.\n\nLasst euch gesagt sein, ihr steuert eurem eigenen Untergang entgegen!\nIhr seid genau die Sorte von Foruminierern, die das deutsche LoL-Forum braucht, die Zerstreuung und ein wenig Rollenspiel in die triste Litanei der Banns, Teamsuchen und allgemeinen Beschwerden bringt.\nIch frage euch also, wieso zum Draven kehrt ihr der Öffentlichkeit den Rücken und verbarrikadiert euch in einem anderen Forum, welches so öffentlich und zugänglich ist, dass ich es heute erst gefunden habe!?\n\nUnter Gleichgesinnten sein ist etwas wunderbares und auch für mich äußerst erstrebenswert, die Literatur aber, zu der auch das Foruminieren zählt, lebt von ihrer Öffentlichkeit!\nTeilt eure Texte, eure Rollenspiele und eure Fantasie mit dem Rest der (LoL-)Welt! Nicht nur für sie ist es eine Bereicherung, sondern auch für euch selbst, denn nur so werdet ihr Leute finden die eure Texte lieben, Leute die eure Texte hassen und Leute, die eure Texte aufgreifen, weiterführen, ad absurdum führen und somit etwas ganz Neues schaffen.\nDie Saat der Vielseitigkeit geht nur an der Sonne auf und nicht in einem dunklen Keller, in den ihr euer Königreich verschleppt habt!\n\nIch rate euch also:\nSchließt die Kammer der Isolation und geht eurem Treiben wieder hier im OT-Bereich des LoL-Forums nach! Die Leute hier wollen Wahlreden sehen! sie wollen die Wahlen miterleben und von euren literarischen Ergüssen zehren, auch wenn sie nicht zu eurem verschworenen Kreis gehören! Um euer Selbst Willen, solltet ihr diesem Verlangen nachkommen! Der Schankwirt Rümmel hat euch gezeigt, wie groß das Verlangen des Foren-Volkes nach ein wenig Verrücktheit ist!\n\nDer Ratschlag wurde erteilt, was ihr damit anstellt, liegt einzig und allein bei euch!","replies":[{"poster":"Maexle","date":"2016-04-05T08:27:30.216+0000","up_votes":2,"down_votes":0,"body":"Das stimmt. Ich bin auch vor kurzem erst auf dieses \"Königreich\" aufmerksam geworden. Ich glaube, dass das daran liegen könnte, dass das System der Monarchie etwas veraltet ist und deshalb an Ansehen verliert. :P\n{{champion:17}}","replies":[]}]},{"poster":"sN00Bdogg","date":"2017-06-08T15:14:52.020+0000","up_votes":5,"down_votes":0,"body":"**WTF news **\n_Staunenswertes aus der wissenschaftlich-teemologischen Fakultät des Königsreich Offtopic_\n**Sonderausgabe zur Königswahl 2017**\n--------------------------------------------------------------------------------------------------------------\n\n**Waldampf vollstens entbrannt -  Angel baut Vorsprung aus - KP abgeschlagen**\n\nDie Wahl zum neuen König des OT steht vor der Tür. Längst schon gibt es hitzige Debatten, sowie diplomatische Winkelzüge. Die Politik hier zu Lande läuft in diesen Tagen auf Hochtouren.  Die Kandidaten haben ihre Wahlprogramme der Öffentlichkeit vorgestellt und nun diskutieren sie entweder miteinander oder widersprechen sich selbst. Als überparteiliches Schmierenblatt sind wir zwar mehr an Schlagzeilen als an den Faktenchecks interessiert, dennoch wollen wir Ihnen helfen, am Waltag den Wal ihrer Wahl zu treffen. Die Kandidaten im Portrait:\n\n**Angel Ayume**:\n\nGanz klare Favoritin! Souverän schweben ihre Punkte in Sphären, die sie jetzt schon als sichere Gewinnerin da stehen lassen. Und das völlig zu Recht. Nicht nur, weil es an der Zeit wäre, daß einmal ein Engel als König regiert, nein sie mag obendrein auch noch Wurst! Selbst immer gut informierte Beraterin des dahingeschiedenen Königs Eibert 1., mag sie keine schlecht informierten Passanten. In ihrer Freizeit vertreibt sie sich die wenigen Stunden der Labsal mit Urzeithorrorfilmen oder dem Studium der garnesischen Sprache.\nFür den Fall ihrer Wahl hat sie uns \"ein glorreiches Zeitalter\" versprochen. Das klingt erstens hervorragend und zweitens ist keiner Ihrer Kongruenten derart kongruet geworden. Ayume! Wir gratulieren schon mal, aber seid Euch gewiss: Wir werden die 100%ige Einhaltung dieser Versprechen im Auge behalten. \n\n**King Prow**:\nDer gefallene Engel dieser Wahl, standen seine Chancen doch kürzlich noch bestens. Zeitweise sah er wie der Sieger aus, doch großen Worten folgten bisher nur die Taten eines kleinen Mannes. Vollmundig verspricht er uns die Reform der Religion, doch spricht er nur zu gern über die alten Zeiten als das OT noch dem Mehrtrollglauben anhing. Etwas Wehmut scheint mitzuklingen, wenn KP sich über den Niedergang der trollianischen Gemeinde äussert. Doch längst ist  die scoutianisierung des OT weit fortgeschritten. Aller Orten kann man die Scoutianer sehen, wie sie unsichtbar im hohen Gras stehen, denn nur im hohen Gras bei Mondlicht kann man die Zeilen des Späherkodex entziffern. Einmal unsichtbar, so glauben sie, sind sie nur noch für Gott sichtbar.\nScheinbar weiss KP nichts damit anzufangen, aber als Opportunist, der er nunmal ist, hat er sehr schnell die Strömung der neuen aufkommenden Angelianisierung des Teemoglaubens erkannt und sich das Motto zu eigen gemacht! Angel soll die Kirche fortan leiten und zur Göttin erklärt werden. Pfui, Herr Prow! So einfach wollen sie sich ihres Hauptkongruenten entledigen? Sie geben es wohl auch lieber den Mächtigen, wie?\nDoch mit dieser Heimtücke nicht genug! So gaukelt uns dieser KP etwas von Rechtsschreibung vor. Als könnten wir nicht selber sehen, dass er selbst die Linksschreibung praktiziert. Gaukelei? Da hat wohl der Strippenzieher hinter dem Throne schon seine Finger im Spiel. Scheinbar überfordert von den vielfältigen Aufgaben eines kommenden Königs, hat dieser KP hat bereits seine Grenzen erkennen müssen und braucht dringend Beistand. Klipp und klar bekennt er sich zu seinem Unvermögen und schlägt uns nun ein Dummovirat vor. Gemeinsam will er herrschen und \"Auf Augenhöhe\" will er sich mit Shaco beraten. Ob ihm da wohl der Schalk im Nacken saß? Naja. Jedenfalls nicht der einzige Blödsinn, den wir dieser Tage von KP vernehmen müssen. Wollen wir mal hoffen, daß das braune Zeug rund um seinen Mund Shacolade ist! \n\n**El Pingu**:\nSeine Leistungen in den Zeiten der Altvorderen in allen Ehren, aber lasst es uns mit den Worten von Ekko sagen: \"Du warst mal cool!\" Vergangenheitsform! Heute bist Du es nur noch, wenn Du mal wieder zu lange hinter der Verkaufstheke der Super Hot Ice Tavern standest. Die Rede zum Narrwal war ebenfalls eher tranig. Sicherlich hast Du uns mit deinen pittoresken Erinnerungsfragmenten Bilder geschenkt, die wir nie vermisst hätten, aber in deinen Vorschlägen für die Zukunft des OTs sind wohl mehr Spinnereien als  Visionen enthalten. \nSo wird u.a. die Einführung eines Zwei-Kasten-Systems für OTler gefordert. Was war denn am alten schlappeseppelschen Ein-Kasten-System so schlecht? Hatten wir nicht alles was wir brauchten. Nach nur einem Plopp? Auch wenn Du beteuerst, daß Dir das OT sehr am Herzen liegt, so fragen wir uns doch im Gegenzug, ob wir das OT deinem altersschwachen Herzen anvertrauen können. \nUnsere Empfehlung für nach der Wahl: Macht die SHIT nicht fruch-tiger sondern löwenzahniger.\n\n**Luna alias Pluviaglacialis  -  der Mann in Frauenhosen!**\nDieser Kandidat rockt! Allerdings nur im Schlafzimmer seiner Mutter vor dem Spiegel. Da schlüpft er gerne mal in die ein oder andere bizarre Rolle. Kein Wunder, daß er keine Spammazoiden mag. Wundersamer Weise weigert er sich Entscheidungen zu treffen und würde bei seiner Wahl die Monarchie als solche in Frage stellen. Ansonsten fordert er ein eigenes Unterforum fürs OT ... _gääääähhhnnn_ .... und viel mehr Spass durch regelmäßige Scrims und Fun-matches ( als wären das alles seine Ideen!).  Wir kommen zu dem Schluss: Dieses Wohlprogramm ist tatsächlich nur etwas zum Abdanken.\n\n**Maexle**\nWenn es eins ist, was dieser Kandidat kann, dann ist es viel reden ohne was zu sagen. Nach dem Lesen seines Freds hatten wir das Gefühl, dass das Wahlprogramm recht erfolgreich sehr vage umschrieben wurde. \nIn seinen Kernaussagen beschränkt sich Maexle aufs Gegner Bashing ohne jedoch hier eine klare Position ein zu nehmen. Einerseits verteufelt er in scoutianischster Weise den herannahenden Weltenbrand, andererseits verkauft er ihn uns als \"warm und hell\". Einem solchem Einflüsterer darf man nicht auf den Leim gehen. Geradezu blasphemisch wird Maexle, mit seinem Vorstoss Teemo zu einem Maskottchen des Reiches zu degradieren! Infam!\nMan möge auch die Lauscher spitzen und genau zu hören, wenn Maexle über die andere Volksikone des OT redet: Das Rümmelbier. Dieses \"wird staatlich subventioniert\". Steuern will er dafür nicht erhöhen, doch angesichts der maroden Staatskasse, wird dies nicht ausbleiben. Über eine Vergnügungssteuer könnte das Rümmelbier bald sehr viel teurer werden. Maexles zweites Wahlversprechen ist in diesem Kontext deutlich klarer einzuordnen: Nach der Wahl \"sorge ich dafür, dass ihr genug Wasser trinkt\" \n\nFür die Inhalte der Wahlprogramme sind ausschließlich die Kandidaten verantwortlich. Die Red.\n-------------------------------------------------------------------------------------\n\n**OT vs op-a - Rückspiel:  Sonntag 11.06.17 20:00  **\n\nInteressenten für das Rückspiel wenden sich bitte an Spielführer Swan Song zwecks Mannschaftsaufstellung.  \nDie Übertragung via Twitch ist bereits in Planung. \n\n** Mystery Skin Challenge **\n\nBegleitend zum Rückspiel findet am Sonntag ab 15 Uhr zum ersten Mal die von der _**WTF news**_ gesponserte _Mystery Skin Challenge_ statt.  Wer die Herausforderung annehmen will, der melde sich bitte bei der Redaktion zwecks Starterlaubnis. \nStartberechtigt sind alle OT-Bürger und anlässlich des Rückspiels auch alle  op-a´s. \nWeitere Wildcards zur Teilnahme OT-fremder Spieler, sind nach Leumundsbezeugung eines OT-Bürgers bei sN00Bdogg erhältlich.\n\n-------------------------------------------------------------------------------\n\nStellvertretender Interims-Chefredakteur: Prof. Dr. teem. sN00bdogg. / Teemologe und Hund.","replies":[]},{"poster":"sN00Bdogg","date":"2017-04-25T00:48:03.801+0000","up_votes":5,"down_votes":0,"body":"**WTF news **\n _Staunenswertes aus der wissenschaftlich-teemologischen Fakultät des Königsreich Offtopic_\n(Erstausgabe)\n--------------------------------------------------------------------------------------------------------------\n\n**Teemo stärkster TOP-Laner**\n\nGute Nachrichten für König Eibert I. Nun konnte endlich bewiesen werden, daß Teemo der stärkste aller Lane-Bullys in der Kluft ist. Herausgefunden haben dies Forscher des beauftragten Instituts LOLKING. In wochenlanger Kleinarbeit wurden alle möglichen Matchups verglichen. Die Ergebnisse sind untrüglich und nicht mehr zu widerlegen, ihre Veröffentlichung gleicht einer Sensation! Denn kein anderer Champion hat solch hohe Siegchancen wie Teemo. Sei es Garen, Darius oder Tryndamere, gegen nahezu alle und jeden hat Teemo eine Winrate von teilweise weit über 50-55 %. Wissenschaftler erklären damit das Phänomen des Teemo-Hasses sowie die hohe Banrate.\nDoch gilt es weiterhin Yasuo im Auge zu behalten. Er ist nahezu der einzige, der Teemo Schwierigkeiten bereiten kann. Die äusserst niedrige Winrate gegen Yasuo (46%) erklärt sich durch seine w-Fähigkeit, welche sowohl die Giftpfeile als auch die Pilze in ihrem Fluge abblockt. Jegliche Versuche im Labor einen Weg zu finden, wie Teemo die Windwall überwinden könnte, sind bislang gescheitert. Unsere Forschungen lassen aber den Schluss zu, daß Teemo sehr wohl Pilze über die Wand werfen könnte, wenn diese auf Yordlemaß geschrumpft werden könnte und nur halb so hoch wäre. Aus wissenschaftlich-teemologischen Kreisen erklingt deshalb allerseits die Forderung:\n\nRIOT! TEAR DOWN THIS WALL! \n\nQuelle:\nhttp://www.lolking.net/charts#/Top%20Lane%20Matchup\n\n------------------------------------------------------------------------------------------------------------------------\n\nGegendarstellung\n\nUnsere Recherchen haben ergeben, daß das Reittier unseres Königs  Eibert I. kein sehr kleines Pferd ist. Auch ist sein Name nicht One-Trick, wie überall im Königreich gemunkelt wird.\n\n--------------------------------------------------------------------------------------------------------------------------","replies":[]},{"poster":"Action Alet","date":"2015-06-17T19:32:40.614+0000","up_votes":5,"down_votes":0,"body":"Dann frage ich nochmal hier: \"Wie wäre es, wenn wir z.B.\" zusätzlich zu [King Prows Dichterthread](http://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/etrPMAHj-otclub-der-aushilfsdichter-und-beschwipsten-schreiber) einen Wortkunstwettbewerb veranstalten? Details müsste ich mir noch überlegen, aber das sähe dann ungefähr so aus, dass alle paar Wochen ein Thema kommt, zu dem jeder etwas schreiben und dann einreichen kann und per Abstimmung ein Gewinner bestimmt wird. Werde das nur bei genügend Interesse und Teilnahmebereitschaft machen, also begeistert euch für Literatur, ihr Banausen! oder so.","replies":[]},{"poster":"sN00Bdogg","date":"2017-05-30T11:30:29.939+0000","up_votes":4,"down_votes":0,"body":"WTF news \nStaunenswertes aus der wissenschaftlich-teemologischen Fakultät des Königsreich Offtopic\n\nSonderausgabe anlässlich des Ablebens unseres Königs Eibert I.\n--------------------------------------------------------------------------------------------------------------\n**\nDer König ist tot!  Es lebe der ... Wahlkampf**\n\nMit großer Bestürzung wurde überall im Königreich der Tod unseres geliebten Landesherrn aufgenommen. Heroisch stürzte er sich in die Schlacht, um das OT zu retten und zahlte mit seinem Leben dafür, welches im Innern des Clouddrakes unwürdig ausklang. Kritische Stimmen sprechen hinter vorgehaltener Hand aber auch darüber, daß diese Schlacht hätte verhindert werden können, wäre der König nicht durch seine Liebeswirren, seine Vermählung und weitere familiäre Verstrickungen wie der Adoption mehrerer Kinder zu stark in Anspruch genommen gewesen. Mögen sich die Historiker damit im Detail auseinander setzen und herausfinden, was im Genauen ursächlich für die Eskalationen der vergangenen Tage war. Wir sagen: papperlapapp! Am Ende hat er seinen wahren Charakter gezeigt und sich fürs OT geopfert.\n\nJetzt gilt es erst einmal zu trauern und unserem geliebten Herrscher die letzte Ehre zu erweisen. Wir, die  WTF-redaktion, möchten hiermit seiner trauernden Witwe Superkahlan, den Adoptivkindern Schacolade, One Step Down und pluvia glacialis, sowie dem gesamten Königreich unser Beileid aussprechen. Er war ein grosser gütiger Mann und trotz all seiner menschlichen Schwächen ein Herrscher, der seines Gleichen sucht. Seine Regentschaft war bedauerlich kurz, doch umso glorreicher wird sein Vermächtnis für immer in unseren Erinnerungen verweilen. \n\nAngel Ayume hat sich angeboten eine Trauergruppe zu gründen. Wer in diesen schweren Stunden Trost und Zuspruch sucht, darf sich gerne an Sie wenden.\n\nDas OT wäre aber nicht das OT, wenn es nicht auch in solch dunkler Stunde den Blick in die Zukunft richten würde. So wurden von El Pingu bereits die ersten Schritte hinsichtlich der anstehenden Königswahl in Angriff genommen. (https://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/MHhsfYV9-ot-wahlvorbereitungen?show=nested)\n\nWer Interesse hat, sich als Wahlhelfer zu beteiligen oder gar selbst als Kandidat zur Wahl anzutreten, möge bitte vorübergehend  mit El Pingu Kontakt aufnehmen.\n\n--------------------------------------------------------------------------------------------\n\n**Wolkendrachen geächtet**\n\nÜberraschend schnell und offensichtlich durch König Eiberts Tod beeinflusst, wurde über die gefährlichsten aller Drachen, die Wolkendrachen, die Reichsacht ausgesprochen. \n\nEinem jeden OT-Bürger ist es hiermit strengstens untersagt, Clouddrakes zu füttern oder ihnen Unterschlupf zu gewähren. Ihr Erscheinen ist unverzüglich der königlichen Dschungeltruppe mit  Ort und Zeit zu melden. Für das erlegen eines Wolkendrachens soll ein jeder Bürger fortan mit dem königlichen Wolkenkuckucksorden ersten Grades am Band geehrt werden.\n\n--------------------------------------------------------------------------------------------\n\nStellvertretender Interims-Chefredakteur: Prof. Dr. teem. sN00Bdogg.","replies":[]},{"poster":"Zamonianer","date":"2016-06-17T21:31:09.528+0000","up_votes":4,"down_votes":0,"body":"Der königliche Magier stellt hier nun sein neustes Werk vor: ein Zauberspruch zum Färben dieses Forums!\nMithilfe von Stylish (oder TamperMonkey oder GreaseMonkey) lässt sich mit diesem [Style](https://userstyles.org/styles/129117/white-league-of-legends-board) die Hintergrundfarbe des Forums auf weiß setzen, die Schrift wird dabei natürlich schwarz.\nSieht natürlich nicht so schön von der Farbgebung aus, wie das alte, aber sollte für die, die schwarze Schrift auf weißen Hintergrund bevorzugen, leichter lesbar sein.\n\nGruß\nZamo","replies":[]},{"poster":"Neamhoilte","date":"2015-07-01T17:10:51.429+0000","up_votes":4,"down_votes":0,"body":"https://youtu.be/ngufar3HwRY\n\n\n\nIst nur ein Handymovie...","replies":[]},{"poster":"SwissKeks","date":"2017-06-28T19:25:32.457+0000","up_votes":3,"down_votes":0,"body":"Witzige Smurfs sind witzig.\nUnwitzige Smurfs, dessen einziger Sinn es ist dem OT zu schaden in dem man unnötige (und kindliche) Kriege fühlt, sind unnötig.\nKriege KÖNNEN witzig sein. Rivalitäten KÖNNEN witzig sein. Aber so wie es zurzeit ist, ist es witzlos.\nMeiner Meinung nach jedenfalls.\n\nAber ich lasse mich ja gerne noch vom Gegenteil überzeugen, bin mal gespannt wie sich das ganze entwickelt..\nIch hab einfach keinen Bock auf sinnlose Kleinkriege nur weil jemand nicht mehr den Respekt hat, den er erwartet. Weil er eine schwindende Erinnerung in den Köpfen ist. Es zu akzeptieren und von neuem zu beginnen wäre mMn. eine schönere und witzigere Möglichkeit als für unruhe zu sorgen die einzig und alleine aus Missgunst und Bosheiten besteht.\nFalls mich hier überhaupt wer verstehen kann..","replies":[]},{"poster":"King ProwIII","date":"2017-06-08T15:24:42.854+0000","up_votes":1,"down_votes":0,"body":"Verehrte Redaktion der WTF News,\n\nso sehr ich ihre äußerst korrekte und stets fragwürdige Recherche schätze, diesmal haben sie einen großen Schnitzer begangen.\n> \n>  Angel soll die Kirche fortan leiten und zur Göttin erklärt werden. Pfui, Herr Prow! So einfach wollen sie sich ihres Hauptkongruenten entledigen? Sie geben es wohl auch lieber den Mächtigen, wie?\n> \n\nIch werde den Glauben an die heilige [Anit-tilt Robbe Antje](https://www.youtube.com/watch?v=eY52Zsg-KVI&t=3322s) einführen. Sobald sie also einmal von ihrer Bild-Zeitung aufschauen, möchte ich sie bitten, dieses Detail zu korrigieren.\n\nZuletzt noch eine Frage: haben sie etwas gegen Linksschreibung?","replies":[{"poster":"sN00Bdogg","date":"2017-06-08T15:52:00.591+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=King ProwIII,realm=EUW,application-id=YnZkMR0R,discussion-id=7eIrrBQX,comment-id=00b1,timestamp=2017-06-08T15:24:42.854+0000)\n>\n> Verehrte Redaktion der WTF News,\n> \n> so sehr ich ihre äußerst korrekte und stets fragwürdige Recherche schätze, diesmal haben sie einen großen Schnitzer begangen.\n> \n> Ich werde den Glauben an die heilige [Anit-tilt Robbe Antje](https://www.youtube.com/watch?v=eY52Zsg-KVI&amp;t=3322s) einführen. Sobald sie also einmal von ihrer Bild-Zeitung aufschauen, möchte ich sie bitten, dieses Detail zu korrigieren.\n> \n> Zuletzt noch eine Frage: haben sie etwas gegen Linksschreibung?\n\nDanke für Ihre rege Anteilnahme an unserem Unterhaltungskonzept. Wir nehmen uns allerdings die (Presse-)Freiheit,  ihren Versuch, uns als Lügenpresse hin zu stellen,  als rein wahltaktisches Manöver zu werten und in Folge dessen ihre gewünschte Gegendarstellung schlichtweg zu ignorieren. \n\nAusserdem haben wir ganz und gar nichts gegen die Linksschreibung. Erst recht nicht, wenn zuvor die rechte Hand zu gänzlich anderem Zwecke am Papiere einsatzbedingt zu werken wusste.","replies":[]}]},{"poster":"The mute Swan","date":"2016-05-01T19:02:43.011+0000","up_votes":3,"down_votes":0,"body":"Mylord, die Erhabenste aller Erhabenen Majestät Becks,\n\nhiermit möchte ich darum bitten in Euer Königreich aufgenommen zu werden. Ich bitte um die Ehre ihnen die Treue schwören zu dürfen und ihnen Jeden Sonntag einen Teemo-keks backen zu dürfen. Warum einen Teemo-keks? Weil der unichtbar ist, Mylord. Unsichtbare Kekse sind die besten. Ihr könnt jeden morgen in die Keksbox schauen und euch denken, dass diese nicht leer, sondern voller Teemo-kekse sein Könnte. Oder auch nicht, niemand kann sie ja sehen. Desweieteren erbitte ich um eine Empfehlung für den Posten des außerdimensionales-Raum-Zeit-kontinuums-bereisens-Dozenten am Mugiwara Institut für Pseudowissenschaften und Halbwissen, da dieser vor kurzem wieder freiwurde. Qualifiziert genug bin ich durch lange zusammenarbeit mit dem Ehrenwerten Dr. Prof. Prof. Mag. Z.-Zilean. \n\nSolltet ihr keinen Gebrauch für mich haben, so bitte ich wenigstens um Asyl, in meiner Heimat Freljord werde ich verfolgt, weil ich durch einen Fehler König Tryndameres langes Schwert etwas... verjüngte... nun ist es ihm zu leicht und ich fürchte um meinen Kopf.\n\nEuch noch ein langes Leben und möget ihr kein glas mehr halb leer, sondern halb gefüllt mit Teemo-keksen sehen.","replies":[]},{"poster":"Sirius00","date":"2016-05-01T18:30:11.956+0000","up_votes":3,"down_votes":0,"body":"O über alle Zweifel erhabener König Becks,\n\nhiermit wünsche ich, in euer Königreich aufgenommen zu werden. Ich bin sehr lange durch die Gefilde des Forums gereist, und hie und da hörte ich vom Königreich OT. Ich sammelte Informationen, und eines Tages wurde ich durch Eibert Rümmel darauf aufmerksam, wie man in ihren Audienzsaal gelangt. Nun stehe ich hier und erbitte euch darum, mich hinter euren Toren aufzunehmen. Ich wäre euch zutiefst dankbar.\n\nMöget ihr lange Leben, der gefallene Stern Sirius{{champion:15}}","replies":[]},{"poster":"AI Yjuq","date":"2016-05-01T16:28:34.222+0000","up_votes":3,"down_votes":0,"body":"Werter OT Becks,\n\nlange bin ich gereist um euer Königreich zu begutachten. Zwielichte, sowie auch interessante Gestalten tummeln sich unter euren Bürgern. Ich habe euch und eure Untertanen beobachtet. Nach ausgiebigen Forschungen bin ich zu dem Entschluss gekommen dass euch eine mehr als wichtige Person in eurem Reich fehlt. Ja, ich meine mich! Ich sehe niemanden der sich um die Belange der Poros gekümmert hat! Wer füttert diese und forscht diese unerforschbare Geschöpfe Runeterras? Ich sehe mich verpflichtet diese Verpflichtung nachzugehen und diese zarten Geschöpfe zu schützen, zu füttern und wenn es sein muss ihnen bei der Wahl des Partners, während der Paarungszeit, beiseite zu stehen. Ich bitte demütig um eine Niederlassung in eurem blühenden Königreich, um mich um diese zarten Geschöpfe kümmern zu können.\n\nHochachtungsvoll\nQujy Yjuq","replies":[]},{"poster":"SwissKeks","date":"2016-04-05T11:41:17.537+0000","up_votes":3,"down_votes":0,"body":"Mugiwara, du mögest Recht erhalten! \n\nMöge das OT wieder das Licht der Welt erblicken in einem noch schöneren Glanz! :')","replies":[]},{"poster":"SwissKeks","date":"2015-06-18T17:45:20.536+0000","up_votes":3,"down_votes":0,"body":"Sooooo, dann poste ich mal meine Idee rein:\n\nIch hab auf früheren Kontakten noch wen der einen TeamSpeak für uns organisieren könnte mit 30+ Slots (brauchen zwar nie so viele aber die Slots wären nie ein Problem). Wenn interesse besteht kann ich den organisieren und einstellen. Hab auch Serverrechte Erfahrung, wäre eine Sache von 20 Minuten.\n\nInteresse? :P","replies":[{"poster":"Zamonianer","date":"2015-06-18T18:34:37.717+0000","up_votes":1,"down_votes":0,"body":"Ich könnte noch anbieten, sofern das von eurer Seite aus geht, den mit der Domain \n\"lol-offtopic.de\" zu verknüpfen. Die Domain hab ich noch bis... nächsten Mai?\n\nGruß,\nZamo","replies":[{"poster":"Kryptonq","date":"2015-06-18T19:42:27.599+0000","up_votes":1,"down_votes":0,"body":"Ein ganzes Jahr?","replies":[{"poster":"Zamonianer","date":"2015-06-18T20:32:33.462+0000","up_votes":2,"down_votes":0,"body":"@Alle anderen außer Krypton, der sich das gemerkt haben muss: 23.5.2016 ist Ende.\n\nGruß,\nZamo","replies":[]}]}]}]},{"poster":"Like a Sir","date":"2017-07-04T09:39:42.786+0000","up_votes":1,"down_votes":0,"body":"Hallo werte OT Gemeinschaft !\nGibt es in eurem großen Reich noch Platz für einen weiteren Beschwörer?\n(Hab zwar alles durchgesehn kam aber nicht dahinter wie man Mitglied bei euch wird q.q)","replies":[{"poster":"Neamhoilte","date":"2017-07-04T10:25:04.927+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Like a Sir,realm=EUW,application-id=YnZkMR0R,discussion-id=7eIrrBQX,comment-id=00bc,timestamp=2017-07-04T09:39:42.786+0000)\n>\n> Hallo werte OT Gemeinschaft !\n> Gibt es in eurem großen Reich noch Platz für einen weiteren Beschwörer?\n> (Hab zwar alles durchgesehn kam aber nicht dahinter wie man Mitglied bei euch wird q.q)\n\nPlatz haben wir immer. \n\nDie einfachste Möglichkeit ein OTler zu sein, ist einfach im Offtopic Bereich des LoL Boards aktiv zu sein. \nForenspiele, Rollenspiel, etc.\n\nGuck mal in der Schenke zum rümmelnden Eibert vorbei.\n\nOder nutze die Antwort Funktion auf einen Post unserer aktuellen Königin Angel Ayume. Oder komm einfach auf den TS.\n\nOben bei den Stickythreads findest du eine Offtopic Übersicht. \n\n\nGruß OT Becks","replies":[{"poster":"Like a Sir","date":"2017-07-04T11:26:56.047+0000","up_votes":2,"down_votes":0,"body":"Vielen Dank für die Antwort :-)","replies":[]}]}]},{"poster":"Kind Prow","date":"2017-07-04T11:24:45.137+0000","up_votes":1,"down_votes":0,"body":"Add einfach irgendwen von uns ingame, oder schau mal auf unserem TS lol-offtopic.de vorbei.\n\nAdden sie mich jetzt für eine Aufnahme in den OTler ingame Club ^^\n\nJoa... foren schreiben, akitv und blah... Zeugs eben. nu ;D","replies":[{"poster":"Like a Sir","date":"2017-07-04T11:26:33.734+0000","up_votes":2,"down_votes":0,"body":"Vielen Dank! Werde dann am späteren Nachmittag mal bei euch vorbeischauen und dich Ingame adden  :-)","replies":[]}]},{"poster":"Angel Ayume","date":"2017-06-10T02:35:22.626+0000","up_votes":1,"down_votes":0,"body":"Bin nur ich der Meinung oder neigen die Wtf News dazu sehr parteiisch zu sein? xDD \n\nÜber jeden was schlechtes nur ich werde gut dargestellt. WTF xD","replies":[{"poster":"Neamhoilte","date":"2017-06-10T08:36:05.576+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=YnZkMR0R,discussion-id=7eIrrBQX,comment-id=00b3,timestamp=2017-06-10T02:35:22.626+0000)\n>\n> Bin nur ich der Meinung oder neigen die Wtf News dazu sehr parteiisch zu sein? xDD \n> \n> Über jeden was schlechtes nur ich werde gut dargestellt. WTF xD\n\nDas täuscht\n\n{{sticker:slayer-jinx-wink}} \n\n\nGruß OT Becks","replies":[]}]},{"poster":"El Pingu","date":"2017-06-08T15:49:31.868+0000","up_votes":2,"down_votes":0,"body":"Hmm, das klingt ja, als währen die wtf News gekauft worden o.o\n\nBild dir deine Meinung o.O","replies":[]},{"poster":"Angel Ayume","date":"2017-05-30T11:37:19.339+0000","up_votes":2,"down_votes":0,"body":"Mir fällt grad mal auf, dass die Liste der Bürger gar nicht mehr aktuell ist. :D","replies":[]},{"poster":"SwissKeks","date":"2017-04-15T14:20:30.841+0000","up_votes":1,"down_votes":0,"body":"Bürger des Königreichs, ehrenwerte Inhaber hoher Posten und werter König. Ich möchte mich an diesem heutigen Tag für eine Stelle im Königreich, genauer gesagt in der Außenpolitik, bewerben.\n\nIch bewerbe mich hiermit nun für das Amt des Botschafter und Diplomat des Königreichs OT.\n\nDa ich, aufgrund meines Heimatortes, bereits mit einer neutralen Haltung gesegnet bin, ist das sicher ein großes Plus für meine Bewerbung.\nEbenfalls bin ich zurzeit in Verhandlungen mit den Emissaries verwickelt, welche sich auch um das Königreich dreht. \nJedoch möchte ich einen öffentlichen Posten besitzen, damit ich meine Tätigkeiten zur vollen Zufriedenheit des Königreichs, und dessen König einsetzten kann.\n\nIch bin auf eure Rückmeldungen angewiesen und würde mich erfreuen, einen positiven Bescheid zu erhalten.\n\nGrüsse\nSwissKeks","replies":[{"poster":"Eibert Rümmel","date":"2017-04-15T14:24:07.235+0000","up_votes":1,"down_votes":0,"body":"Ich könnte mir keinen besseren Diplomaten vorstellen","replies":[{"poster":"Markishi","date":"2017-04-24T19:54:06.113+0000","up_votes":1,"down_votes":0,"body":"Was gibt es denn zu verhandeln, werter Diplomat?","replies":[{"poster":"SwissKeks","date":"2017-04-24T21:28:12.881+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Markishi,realm=EUW,application-id=YnZkMR0R,discussion-id=7eIrrBQX,comment-id=009b00000000,timestamp=2017-04-24T19:54:06.113+0000)\n>\n> Was gibt es denn zu verhandeln, werter Diplomat?\n\nIch bitte um etwas Geduld. :)\nDer König ist bereits bestens Informiert, jedoch mussten wir den Verhandlungstisch temporär verlassen um bei der Rettung der Poros zu helfen.\n\nPrioritäten setzen und so ^_^","replies":[{"poster":"Markishi","date":"2017-04-25T15:14:46.306+0000","up_votes":2,"down_votes":0,"body":"Die Poros retten sind gute Prioritäten.\nUnd solltet ihr bei euren Diplomatischen Verhandlungen Hilfe benötigen, so stehe ich als Mitglied des OT und Repräsentant des Allmächtigen Imperiums gerne zur Verfügung.","replies":[]}]}]}]}]},{"poster":"Eibert Rümmel","date":"2017-04-19T19:37:42.941+0000","up_votes":1,"down_votes":0,"body":"Welche Forderungen haben wir gegenüber Riot?\n\nIn Kürze soll ein königliches Pergament übergeben werden, dass all unsere berechtigten und völlig legitimen Forderungen gegenüber Riot zum Ausdruck bringt!\n\nDerzeitiigen Forderungen:\n1. Rümmelbiergragas Skin\n2. Umbenennung des Allgemeinen Chat in (Königreich) Offtopic\n3. Teemohüte\n4. Offizielle Erklärung, dass der 31.3. zum Weltteemotag erklärt wird\n5. Moderatoren Rechte für den Allgemeinen Chat\n6. Freikarten für OT Bürger für Riot Events\n7. Akademie Skins müssen in Instituts-Skins umbenannt zu werden\n8. Ein Kurzgeschichtenreiter im Ingame Client\n9. Großmugister Vladimir Skin\n10. Vorsorgeuntersuchungen für alle\n11. Mehr Pilze\n12. Umbenennung von Melde einen Bug in Melde einen Pilz\n13. Riot Mitarbeiter müssen in der Öffentlichkeit Teemo Hüte tragen!\n14. UOTGGS\n\nAuf eure Ergänzungen freue ich mich ;)","replies":[{"poster":"Der Großmugister","date":"2017-04-19T19:56:31.901+0000","up_votes":2,"down_votes":0,"body":"Die Akademie-Skins müssen in Institusts-Skins umbenannt werden!\n\nEin Kurzgeschichten-Reiter im IngameClient!\n\nGroßmugister Vladimir Skin!","replies":[]}]},{"poster":"Eibert Rümmel","date":"2017-04-18T21:22:17.221+0000","up_votes":2,"down_votes":0,"body":"Ich bin ja dafür, dass wir die Bürgerliste durch eine Hall OF Fame ersetzten. Gemäß einmal OT immer OT. Im alten Forum haben wir die Voklkszälungsthreads und im neuen bekommen wir die Leute schon noch zusammen ;)\n\nWas meint Ihr","replies":[]},{"poster":"Freiherr Alex","date":"2016-10-18T05:30:30.270+0000","up_votes":2,"down_votes":0,"body":"Nachdem ich nun auch schon etwas länger hier als Wanderer durchs OT gehe möchte ich mich nun auch gerne hier Niederlassen und **beantrage ebenfalls eine Aufnahme ins OT Königreich**.\n\nIch brauche nicht viel...nur mal ab und zu ein kühles Bierchen und **viel **zu Essen :) (Hoffe ihr habt neben dem Rümmelbier auch ein Leckeres im Angebot :P )","replies":[]},{"poster":"Neamhoilte","date":"2016-07-05T04:53:32.520+0000","up_votes":2,"down_votes":0,"body":"Tach auch OT'ler,\n\nwie wäre es mit einer kleinen Herausforderung, bei der man sogar noch eine Kleinigkeit gewinnen könnte? Klingt gut, oder?\n\nDa wäre zum einen die Möglichkeit des OT Duellierclubs, d.h. Ihr fordert einen anderen OT'ler auf gegen euch zu kämpfen. Es gibt einen Hin und Rückkampf. Freie Champion Wahl. Aram Map. \n\nOder wie wäre es mit Fordere deinen König! Hier können Mitglieder des OT's gegen den König kämpfen. Aram Map, freie Champ Wahl. Nur ein Kampf.\n\nFür beide Varianten gilt: \nStarten würde das Ganze im August. Vorher habe ich nicht wirklich Zeit. \nWenn ihr Interesse habt dann meldet euch hier. \n\nGruß OT Becks","replies":[{"poster":"Eibert Rümmel","date":"2016-07-05T15:40:26.316+0000","up_votes":2,"down_votes":0,"body":"so oder so dürft ihr gegen meinen Teemo spielen ^^","replies":[]},{"poster":"Der Großmugister","date":"2016-07-05T09:29:32.515+0000","up_votes":2,"down_votes":0,"body":"Hört, hört!\nIch bin interessiert!","replies":[]},{"poster":"Doenerlord","date":"2016-07-05T06:46:27.008+0000","up_votes":2,"down_votes":0,"body":"Mein König,\nAls euer treuer und liebender Vertreter, sehe ich mich geehrt und dazu berufen euch unangespitzt in den Boden zu rammen.\nZudem möchte ich euch loben, für die Kraft, die ihr noch immer in den Erhalt der Ruinen des OT steckt und euch meine Unterstützung anbieten.\nIch möchte desweiteren anmerken, dass eine Ausweitung auf weitere Spiele ebenfalls Abwechslung in die Sache bringen könnte.\nAls Beispiel: Beide Spieler und der Schiedsrichter wählen ein Spiel aus. In jedem dieser Spiele wird ein 1v1 ausgetragen und wer 2 davon gewinnt, bekommt den Preis.\n\nGruß,\nDoenerlord","replies":[]}]},{"poster":"Eibert Rümmel","date":"2016-06-19T13:59:04.933+0000","up_votes":2,"down_votes":0,"body":"Großer König, \n\nIhr wisst ich würde euch nie um etwas bitten, wenn es einen anderen Weg gäbe. Aber heute wende ich mich an euch, meine Majestät, weil ich auf eure Hilfe angewiesen bin. Die Schänke läuft gut, zu gut. Ich schuffte jeden Tag für 3. So dringenend bräuchte ich die Unterstützung einer tatkräftigen Schankmaid. Aber was ich auch tue, ich kann einfach keine anständige Bedieinung finden, die den Alltag der Schänke gewappnet wäre.\n\nSo edler König, habt Ihr einen Rat für mich?","replies":[]},{"poster":"Der Großmugister","date":"2016-05-18T07:12:34.390+0000","up_votes":2,"down_votes":0,"body":"Hoheit, ich muss mich in aller Form bei euch beschweren!!!\n\nEin Großteil des Käses, welcher an meinem Institut fabriziert wurde, ist einem degeneriertem Biest zum Opfer gefallen, welches eindeutig aus eurem Schloss kam!\nDer ganze Käse! Einfach weg!!!\nWie ihr wisst, geht es bei meinem Institut um quasi Nichts anderes, als der Fabrikation von Käse und eventuell Quark! Selten vielleicht auch mal Mist.\nNun stehe ich vor leeren Käsekammern und muss mühseelig neuen dahherreden, damit wir über den Sommer kommen! \n\nSollte so Etwas noch einmal passieren, sehe ich mich gezwungen, statt Käse, bloß noch Mist daherzureden! Dann könnt ihr selbst sehen, wo ihr eure Molkereiprodukte herbekommt!\n\nMit in die Hüfte gestemmten Armen grüßend\n\nMugiwara, Institutsleiter und Käseprodukteur","replies":[]},{"poster":"The mute Swan","date":"2016-05-11T22:21:06.333+0000","up_votes":1,"down_votes":0,"body":"Mylord!\nmit zwei tagen verspätung, aber doch besser als nie, hier ein blech Teemokekse.\nIch hatte ein wenig Probleme mit der Backofen-mikrowelle, hatte total vergessen dass ich die für Zeitmaschinenexperimente genutzt hatte :P\nEinen Fluxkompensator konnte ich leider bisher nicht auftreiben, nur einen alten LeDorean.","replies":[{"poster":"Der Großmugister","date":"2016-05-12T04:50:51.529+0000","up_votes":2,"down_votes":0,"body":"Le Dorean, franz. für Hauptdarsteller von humoristisch angehauchten Arztserien mit Moralkeule am Ende jeder Episode.","replies":[]}]},{"poster":"Kind Prow","date":"2016-05-09T19:25:37.750+0000","up_votes":1,"down_votes":0,"body":"Die Welt is schlecht. Und niemand kann Zimmer mehr ordentlich herrichten. Das isses warum die Welt vor die Hunde geht :P","replies":[{"poster":"Der Großmugister","date":"2016-05-09T19:43:26.886+0000","up_votes":2,"down_votes":0,"body":"Vielleicht ist es ja deine Sicht auf die Zimmer, die hier falsch ist!?\n\nWenn du ein Auge zu machst, ganz feste glaubst und dich ordentlich vollaufen lässt, sieht jedes Zimmer schön aus!\nEssenreste auf dem Kissen?! Nach einer Flasche Gin ist es ein Mitternachtssnack...","replies":[]}]},{"poster":"sN00Bdogg","date":"2016-05-02T22:57:01.112+0000","up_votes":2,"down_votes":0,"body":"~~Mein Fürst!~~\n~~Euer erhabene Majestät!~~\n~~Lichtgestalt des OT!~~\nSire!\nErmutigt durch den königlichen Klugscheisser Mugiwara wende ich mich an Euer Gnaden mit der Bitte um Aufnahme in Euer Reich. \nEin OTianer will ich sein mit Haut und Haar, von der Schnauze bis zur Rute. Euch verschreiben will ich mich, ewige Treue schwören! Den Ruhm des OT will ich mehren und niemals ermüden in diesem Bestreben. \nWie kann so ein daher gelaufener revier- und rudelloser Hund wie ich dies derart selbstbewusst behaupten, werdet Ihr Euch fragen! Kennt man doch die vielen \"Easy win, i carry this\"-Prahlhanse, welche in völliger Selbstüberschätzung der eigenen Fähigkeiten ihren Beitrag fürs OT niemals zu bringen imstande wären, ja seinem Ansehen sogar schweren Schaden zufügen können.\nMein Beitrag für das Königreich des OT soll in der Gründung einer teemologischen Fakultät bestehen, deren Leitung mir der ehrenwerte, kluge, beneidenswert gutaussehende und nebenbei so gutriechende und für Schmeicheleien zugängliche Mugiwara bereits angetragen hat. \nVerzeiht, daß ich zu solch später Stunde Euren Intellekt anspreche, doch die Angelegenheit duldet keinen Aufschub!\nDenn neben dem Feuer, das in mir brennt und mich in der Teemologie vorantreibt und nie erlahmen lässt, sind andernorts bahnbrechende Erkenntnisse gewonnen worden, deren Entdeckung den Gelehrten des OT zugestanden hätte. Gerne übergebe ich Euch diese Dokumente zur Einsicht:\n\n[Unsichtbarkeit](http://www.focus.de/wissen/technik/unsichtbarkeit-forscher-lassen-rohr-mit-tarnkappe-verschwinden_aid_706851.html)\n\nIch wage zu behaupten, daß ihr bereits in Eurer weit über die Grenzen des OT gepriesenen Scharfsinnigkeit erkannt habt, welch weitreichende Einfluss dies auf die Wissenschaft der Teemologie hat.\n\nDarum bitte ich untertänigst um Aufnahme in Euer Rudel. Gestattet mir die Ehre das OT als mein Revier zu benennen. \n\nSo lasst mich denn in Eurem Reiche heimisch werden und im Audienzsaal Sitz machen, während wir die neuesten Forschungsergebnisse besprechen und Backrezepte für Teemokekse austauschen. \n\nUntertänigst\n\nEuer sN00Bdogg,\n\nTeemologe und Hund.","replies":[]}]}