{"poster":"ELmagohoscuro","date":"2017-08-13T16:10:12.644+0000","title":"Por qué siempre salen los mismos champs en URF?","subforum":"Problemas Técnicos","up_votes":36,"down_votes":5,"body":"Pues, llevo jugando desde el viernes, y siento que sale siempre lo mismo, Twitch, Veigar, Sivir, Mao, etc\nEs alg&uacute;n bug o algo, ya que tengo 122 campeones y pues por probabilidad es complicado de que me salga 2 veces seguida el mismo campeon, digo yo\nNo s&eacute; si ser&aacute; cosa mia o no","replies":[{"poster":"PasoPackXHonores","date":"2017-08-13T18:54:59.965+0000","up_votes":6,"down_votes":0,"body":"Es como el Aram, a veces da gracia el \"random\". Una vez me salió illaoi 4 veces seguidas en aram, teniendo 110 champs xD","replies":[]},{"poster":"Eniripsa","date":"2017-08-13T18:48:29.628+0000","up_votes":4,"down_votes":0,"body":"Pasa en todo no a jugado aram? tengo todos los champ y siempre me sale lo mismo de echo le tengo a varios M5 solo jugando aram .. ya con el tiempo te acostumbras xd","replies":[{"poster":"BoostedMonkey21","date":"2017-08-14T01:37:34.309+0000","up_votes":1,"down_votes":1,"body":"imposible lo de m5 porque te dan tan poco que tendrias que jugar algo de 300 partidas...","replies":[{"poster":"gabriel2506","date":"2017-08-14T03:30:00.963+0000","up_votes":1,"down_votes":0,"body":"yo he llegado a ma 3 y media a veces, me tocaba mao mao mao mao mao dios mio, lo llegue a odiar. Y no se si 300. Pero 40 facil si (20 seguro que me toco mao)","replies":[]}]}]},{"poster":"FedecarboneroUY","date":"2017-08-13T18:19:34.288+0000","up_votes":2,"down_votes":1,"body":"Eso de que es aleatorio no es del todo cierto, hay una cierta cantidad de champs que siempre salen en todos los games.","replies":[]},{"poster":"Vileplume","date":"2017-08-14T01:23:39.523+0000","up_votes":1,"down_votes":0,"body":"Quinn sale en 3 de cada 5 partidas {{sticker:zombie-nunu-tears}}","replies":[]},{"poster":"Mioen","date":"2017-08-13T17:15:49.888+0000","up_votes":1,"down_votes":4,"body":"Muchos tienen cuentas con pocos campeones y juegan unicamente los que tienen comprados.\n\nOcurre lo mismo con aram, personas que tiene una cuenta solo para aramear los champs que quieren.","replies":[{"poster":"ELmagohoscuro","date":"2017-08-13T18:06:24.599+0000","up_votes":2,"down_votes":0,"body":"En mi cuenta tengo 122 campeones, y me ha salido 3 o 4 veces Talon","replies":[{"poster":"Mioen","date":"2017-08-13T18:10:37.307+0000","up_votes":2,"down_votes":4,"body":"Bueno eso es mera coincidencia.\nYo solo vi una vez talon en todo lo que lleva de evento.","replies":[]}]}]},{"poster":"Dexnhoid","date":"2017-08-14T05:04:19.647+0000","up_votes":1,"down_votes":1,"body":"La verdad es que después de más de 45 juegos, me he cansado de jugar URF AR y no por las características dentro del modo de juego (la reducción de enfriamiento, el mana infinito y la velocidad de ataque son lo MEJOR!) sino por el hecho de que es **ALEATORIO** , de esos 45 juegos (y más) en ninguno de ellos he tenido la oportunidad de jugar a los campeones que quería (Fizz, Shaco y Morgana). No sé a quién se le ocurrió la idea de que sería divertido jugar a campeones que no quieres jugar, ya tenemos ARAM como ejemplo de selección aleatoria y tiene casi las mismas bases que URF (constantes peleas que favorecen a un equipo u otro dependiendo de como se desempeñen), otro modo de juego más que no te permite seleccionar a los campeones es...simplemente no tan bienvenido.\n\n**Es una pena que el gran concepto que fue URF en un inicio se haya convertido en esto.**","replies":[{"poster":"Arcoiris de Amor","date":"2017-08-14T14:58:19.839+0000","up_votes":1,"down_votes":1,"body":"Te apoyo. Debería ser como antes pero con BANEOS.","replies":[]}]},{"poster":"lordeman10","date":"2017-08-14T11:55:24.145+0000","up_votes":1,"down_votes":1,"body":"bueno lo normal, son 10 personas con 3 reroll cada uno, a alguno le va a tocar los más rotos o más divertidos y no lo van a rerolear, lo van a cambiar o se lo van a quedar\n\nla idea de AR urf es sacar al jugador de su zona de confort, que no spamee siempre el mismo campeón, lo que no quiere decir es que ese campeón no vaya a seguir apareciendo solo que no va a estar en las manos del mismo jugador siempre.. para mi está perfecto con 3 reroll podés seguir sacando algo divertido y a la vez no hacés la que yo hacia antes, por ganar, pickeaba siempre al mismo y más roto, ahora me parece más divertido","replies":[]},{"poster":"Felipe","date":"2017-08-14T00:57:04.011+0000","up_votes":1,"down_votes":1,"body":"Pues la verdad para ser \"aleatorio\" imagino que riot hizo un algoritmo para que los champs que son mas abusivos en URF salgan mas, nose digo yo","replies":[]},{"poster":"Emissang","date":"2017-08-13T20:08:26.632+0000","up_votes":1,"down_votes":1,"body":"a mi me salieron los free un monton de veces, si no fueran por los dados terminaria jugando kayn como 20 veces","replies":[]},{"poster":"Thresh Sama","date":"2017-08-13T19:13:22.306+0000","up_votes":1,"down_votes":1,"body":"tengo todos los champs y siempre sale singed, teemo, zed, kayn etc","replies":[]},{"poster":"Maii Supp UwU","date":"2017-08-13T17:07:07.597+0000","up_votes":2,"down_votes":2,"body":"es re feo esto te pone los champs que nunca usas o de ultima los free me toco 5 veces tristana y 3 soraka una sola vez me toco un main RIOT  es diabólico y quiere que usemos los champs que ni tocamos","replies":[]},{"poster":"TommyStars","date":"2017-08-13T16:56:42.142+0000","up_votes":2,"down_votes":2,"body":"Same here lo unico que me toca es sejuani, vi, rakan y poco más por lo general champs free. Nunca uno que tenga en maestria alta -.-","replies":[]},{"poster":"IroNNNN","date":"2017-08-14T06:33:59.415+0000","up_votes":1,"down_votes":2,"body":"Yo tengo 300 champs y siempre me salen 3 :v","replies":[]},{"poster":"Tomyrex143","date":"2017-08-13T19:01:18.421+0000","up_votes":1,"down_votes":2,"body":"Yo jugue pocas veces en esta cuenta, y creo que nunca me salieron ninguno de esos champs. Hasta me salió zed. ¿Será coincidencia?","replies":[]},{"poster":"Dooby Dooby","date":"2017-08-14T01:26:17.157+0000","up_votes":1,"down_votes":3,"body":"Si exactamente, es un bug como dijiste vos\nPara solucionarlo tenes que ir a los archivos de windows y borrar la carpeta system.32","replies":[]},{"poster":"ˆMKˆ zZz","date":"2017-08-13T16:36:59.725+0000","up_votes":1,"down_votes":3,"body":"Me pasa justo lo mismo. tengo 80 campeones y me salen los mismos 20.","replies":[]},{"poster":"MotaLove","date":"2017-08-13T16:40:08.950+0000","up_votes":1,"down_votes":4,"body":"Sinceramente estoy podrido de que me toque lo mismo, soraka, sivir, annie, shaco, ashe y irelia, todo el dia lo mismo...","replies":[]}]}