{"poster":"BrizioD","date":"2018-11-21T06:21:42.556+0000","title":"Universo di League of Legends","subforum":"A Runeterra si parla italiano","up_votes":1,"down_votes":0,"body":"Salve a tutti, sono nuovo qui, ma gioco a LoL da molto tempo e volevo chiedere se fosse possibile leggere le storie presenti in Universo e poi pubblicarle su YouTube.\r\n\r\nGrazie per chi mi risponder&agrave;","replies":[{"poster":"vondarck","date":"2018-11-21T08:09:15.148+0000","up_votes":1,"down_votes":0,"body":"Ya, nerowolf..\nSe ti posso dare un consiglio spassionato non metterti \"in competizione\" con lui, se lo vuoi fare cerca di portare contenuti diversi dai suoi.\nReinventando un modo di fare video sulla storia, il successo che ha fatto è talmente grosso che la riot lo ha chiamato per fare la pubblicità di lol sul tupo per il doppiaggio italiano","replies":[{"poster":"SickAnto","date":"2018-11-21T09:26:51.317+0000","up_votes":2,"down_votes":0,"body":"Il problema di Nero Wolf, è che molti dei suoi video sono vecchi anni luce, quindi non più validi.\n\nPer cui, non ci vedo nulla di male a pubblicare le Lore dei Campioni adesso.","replies":[{"poster":"Arteriam","date":"2018-11-21T14:07:21.154+0000","up_votes":1,"down_votes":0,"body":"Già, ancora ha la vecchia lore di Aatrox xD","replies":[]}]},{"poster":"Honey Queen","date":"2018-11-21T12:48:49.642+0000","up_votes":1,"down_votes":0,"body":"Nero Wolf non ha l'esclusiva, le storie quelle sono. Lui fa il narratore e lo fa benissimo, ma non c'è nulla di male nel fare la stessa cosa poiché in se fare il narratore non è una cosa unica, e non è accusabile di plagio come può essere fare un'opera d'arte.  \nOvviamente sarà diverso perché una persona diversa a narrare, ma in se il consiglio spassionato è proprio **sbagliato**. \n\nBrizo, se vuoi fare il narratore del bellissimo universo di lol fai pure, sarebbe bellissimo anzi! \nPer darti qualche dritta che sia davvero utile, cura la parte grafica dei video, lavora sulla voce (una bella voce è il 60% dell' opera per un narratore online) Quando racconti calati della storia, fai sentire le emozioni che la lore stessa evoca. \n\nAmo i video riguardanti le lore, e per quanto riguarda NeroWolf che adoro devo dire che ha trascurato League of Legend, e i suoi video trattano le vecchie lore ora aggiornate, quindi sì sarebbe bello che anche qualcun altro facesse il narratore dell'universo di League of Legends. \n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"BrizioD","date":"2019-02-14T11:52:33.586+0000","up_votes":1,"down_votes":0,"body":"Grazie mille dei consigli, Mi sto allenando e rileggo tutti i racconti più e più volte, ma sto aspettando il nuovo programmino per i replay di lol per abbinarli ai miei racconti.\n\nA presto","replies":[]},{"poster":"vondarck","date":"2018-11-21T14:31:25.902+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Honey Queen,realm=EUW,application-id=PqgdRhzF,discussion-id=AuLrsElR,comment-id=00010001,timestamp=2018-11-21T12:48:49.642+0000)\n>\n> Nero Wolf non ha l&#x27;esclusiva, le storie quelle sono. Lui fa il narratore e lo fa benissimo, ma non c&#x27;è nulla di male nel fare la stessa cosa poiché in se fare il narratore non è una cosa unica, e non è accusabile di plagio come può essere fare un&#x27;opera d&#x27;arte.  \n> Ovviamente sarà diverso perché una persona diversa a narrare, ma in se il consiglio spassionato è proprio **sbagliato**. \n> \n> Brizo, se vuoi fare il narratore del bellissimo universo di lol fai pure, sarebbe bellissimo anzi! \n> Per darti qualche dritta che sia davvero utile, cura la parte grafica dei video, lavora sulla voce (una bella voce è il 60% dell&#x27; opera per un narratore online) Quando racconti calati della storia, fai sentire le emozioni che la lore stessa evoca. \n> \n> Amo i video riguardanti le lore, e per quanto riguarda NeroWolf che adoro devo dire che ha trascurato League of Legend, e i suoi video trattano le vecchie lore ora aggiornate, quindi sì sarebbe bello che anche qualcun altro facesse il narratore dell&#x27;universo di League of Legends. \n> {{sticker:slayer-pantheon-thumbs}}\n\nNon ne faccio una questione di esclusiva, ne faccio una cosa di contenuto, se io voglio una storia di lol per abitudine cerco nero wolf: campione X.\nSe lui vuole fare dei video di lore ha a che fare con un ragazzo molto bravo e amato che ha dato \"uno standard di video\" quindi deve inventare un nuovo modo di farli vedere per \"attaccarsi\" e creare dei nuovi fan (IMHO).\nCome strategia andrei sui campioni che non ha trattato e i video pesantemente obsoleti, che ha già detto non avere intenzione di rifare.\n\nIl mio è solo.un consiglio, poi farà come crede!","replies":[]}]}]},{"poster":"uFere","date":"2018-11-21T21:51:09.005+0000","up_votes":1,"down_votes":0,"body":"Aspettiamo il link del canale man ;)","replies":[]},{"poster":"TheViceroys","date":"2018-11-21T07:41:00.080+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BrizioD,realm=EUW,application-id=PqgdRhzF,discussion-id=AuLrsElR,comment-id=,timestamp=2018-11-21T06:21:42.556+0000)\n>\n> Salve a tutti, sono nuovo qui, ma gioco a LoL da molto tempo e volevo chiedere se fosse possibile leggere le storie presenti in Universo e poi pubblicarle su YouTube.\n> \n> Grazie per chi mi risponder&amp;agrave;\n\nSi, lo ha già fatto Nerowolf... per l'italia... e altri per l'US/UK","replies":[]}]}