{"poster":"Miniphiri","date":"2017-07-30T13:10:03.223+0000","title":"Ist die App wirklich sinvoll und sicher?","subforum":"Mobile App Diskussion","up_votes":2,"down_votes":1,"body":"an sich brauche ich der frage im titel nix hinzuzuf&uuml;gen . bin mir unsicher ob ich sie nutzen soll oder nicht daher frag ich lieber mal nach.","replies":[{"poster":"ΔRC RΔFUNZΞL","date":"2017-07-30T16:58:20.680+0000","up_votes":1,"down_votes":0,"body":"das ist die offizielle riot app warum sollte sie nicht sicher sein? riot hat eh deine einlogdaten das ist wie fragen ob sich im client anzumelden sicher ist und ob sie sinvoll ist musst du selber herausfinden","replies":[]},{"poster":"BMW E39 525d","date":"2017-07-30T16:07:49.433+0000","up_votes":1,"down_votes":0,"body":"Programme sind angeblich immer solange sicher, bis jemand das Gegenteil beweist. Und bei Java ist schonmal grundsätzlich nichts sicher.","replies":[]},{"poster":"ifuifuwrafncydrs","date":"2017-07-30T15:40:08.850+0000","up_votes":1,"down_votes":0,"body":"jm2cts... die app is unwichtiger als unwichtig. das is n spiel. mehr nicht. die app dient nur dazu dich noch stärker an das spiel zu binden. wie als wenn es dein leben wäre und das sollte nicht sein.\nfolglich scheiß auf die app.. \ndie meisten social medias sind eh nur plastik..\nmit deinen \"lol-freunden\" kannste auch chatten, wenn du vorm rechner sitzt.","replies":[]},{"poster":"sonkei kuruma","date":"2017-07-30T15:08:37.712+0000","up_votes":1,"down_votes":0,"body":"Meine Erfahrungen mit der App sind Gut hatte noch nie sicherheitsprobleme!\nUnd Sinnvoll ein wenig wenn man z.B. mal einem Freund ma schnell was aus den vergangenen Spielen zeigen will auch wenn die liste von vergangenen Spielen nicht immer aktuell ist! \nLiebe Grüße{{champion:19}}","replies":[]},{"poster":"Humpelstilzche","date":"2017-07-30T13:11:36.188+0000","up_votes":1,"down_votes":0,"body":"Sicher bestimmt. Sinnvoll...das hängt halt davon ab wie wichtig es dir ist mit deinen LoL-Freunden chatten zu können, wenn du nicht am PC bist.","replies":[]}]}