{"poster":"Miniphiri","date":"2017-08-05T08:54:33.709+0000","title":"Bannsystem wirkungslos?","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":6,"body":"Wiedermal ein spiel mit nem troll gehabt der einfach nur schrieb &quot;ban me i dont care. have 6 accounts&quot; scheinbar sind Bans keine wirkliche abschreckung \r\nf&uuml;r jemanden der anderen das Spiel ruinieren will  oder?","replies":[{"poster":"Lotuskobra","date":"2017-08-05T09:05:09.127+0000","up_votes":4,"down_votes":0,"body":"Hallihallo,\n\nich finde man sollte nicht den Fehler machen von einem einzigen Beispiel auf das große Ganze zu schließen. Es ist wie so oft im Leben: Wenn jemand wirklich etwas tun möchte und sich zB verbissen darauf versteift andere zu ärgern, dann findet er einen Weg. Ob er sich dazu nun 10 Accounts erstellt, dir dein Pausenbrot klaut oder kleinen Kindern Traubenzucker zu Wucherpreisen verkauft ist eigentlich egal.\n\nDer Großteil der Spieler ändert sein Verhalten bereits nach der ersten Strafe. Die Unbelehrbaren (und die wird es immer geben), die sich auch nach nem Permaban noch im Recht fühlen und es Riot und der Community jetzt richtig zeigen wollen; kann man nicht bekehren.\n\nAber man kann sie natürlich reporten. Wenn irgendwann dann doch 3-4 Accounts weg sind, dann tut es schon irgendwann weh. Leveln kostet Zeit und ist nervig. Zudem hat Riot angekündigt einige Dinge bezüglich der Accounts, des Levelns und auch der Toxicity zu ändern. Es gibt etliche Ideen, wir sollten gespannt sein, was daraus wird.\n\nFür jetzt hilft nur: reporten, reporten, reporten, wenn jemand sich nicht an die Regeln hält, es gibt im Forum genug Belege für Spieler, die zu Recht Strafen bekommen haben. Manche haben draus gelernt, manche eher nicht.\n\nKopf Hoch, Reporten und sich darüber freuen, wenn mal wieder eine Meldung kommt","replies":[{"poster":"three stodges","date":"2017-08-05T17:40:02.881+0000","up_votes":2,"down_votes":0,"body":"Diese Meldung díe du meinst kommt einfach  viel zu selten oder gar nicht, was auch mich gleichzeitig zum \nzweifeln an dem bann System bringt.\n\nHatte letzte Woche 3 Spiele wo jeweils 1 Mitspieler absichtlich ins Gegner Team gerannt ist und free Kills gegeben hat\njedes mal reportet keine Meldung.\n\nDa fehlt mir einfach die Transparenz.","replies":[{"poster":"Lotuskobra","date":"2017-08-05T21:04:55.705+0000","up_votes":1,"down_votes":0,"body":"Durchaus, durchaus. Die Meldungen kommen soweit ich weiß nur, wenn deine Meldung das System final triggered und auch dann nur nach einem Zufallssystem – klar auf der einen Seite fehlt die Transparenz, auf der anderen Seite will man verhindern, dass das System durchschaubar wird.\n\nWenn man bedenkt wie groß die Probleme im Bereich Botaccounts, Accountsharing und Cheats/Scripting sind, kann man vielleicht nachvollziehen, warum Riot hier so vorsichtig vorgeht. Klar ich als Spieler würde mir gerne immer wünschen, dass ich eine Rückmeldung zu den Reports bekomme (oder meinetwegen auch deutlich häufiger) aber es gibt zumindest auch von Riots Seite Gründe das nicht zu tun.\n\nWas ich interessanter fände wäre:\n\n1. Härteres und schnelleres Bestrafen, damit Spieler auch bei kleineren Verstößen merken, okay so geht es nicht.\n2. Noch mehr Aufklärungsarbeit und vielleicht sogar Player Tutorials über angemessenes Verhalten.","replies":[]}]},{"poster":"Cenâreth","date":"2017-08-05T16:05:01.552+0000","up_votes":2,"down_votes":0,"body":"Wir reden hier im Durchschnitt von 15 Games am Tag wo es vorkommt ... wenn durchschnittlich 40 Reports/Tag rausfliegen, sagt dass viel aus.\n\nRiot selbst hat angekündigt härter durchzugreifen ich warte immer noch darauf. Denn Riot kann mir nicht erklären dass sie keine IP bannen können und wenn IP Bann da ist, wird es auch kaum ein Multi Accounting geben.","replies":[{"poster":"Temudschinn","date":"2017-08-05T16:14:29.597+0000","up_votes":1,"down_votes":0,"body":"IP-bans sind wirkungslos. Nicht nur triffst du damit alle im selben Haushalt, es bringt auch nicht wirklich was weil die IP normalerweise ständig wechselt.\nUnd wenn du 15 Trolle pro Tag siehst, dabei aber 40 Reports rausballerst, sagt dass mehr über dich aus als dir evtl. lieb ist ;)","replies":[]}]},{"poster":"ElRockMarc","date":"2017-08-09T19:44:42.475+0000","up_votes":2,"down_votes":1,"body":"Es stimmt nicht. Es wird ja kaum gebannt.  In meinem Spiel gestern wurde KREBS gewünscht  und was meine Mutter alles mit seinem schwanz  anstellt  und wen er alles Vögel aus meiner Familie. Was ist passiert nach dem Report nichts. Ganz im Gegenteil  wen hatte  ich im nächsten Spiel wieder dabei   ja genau den selben Typen und wieder von vorne. Das gleiche . Und das in gewonnenen spielen. Und wieder Report  und wieder nix. Er spielt auch heute weiter. Das ban System ist für den ARSCH.  Das System ist auf irgendwelche Wörter programmiert sind davon  genug gespeichert und Reportet greift der Chat ban.  Es ist für den ARSCH. Für mich gehören diese Leute die einem Krankheiten usw  WÜNSCHEN Familie sexuell beleidigen sofort für immer aus dem Spiel gebannt. Du läufst ja auch nicht in deinem Verein rum oder beim Fussball nach einem faul und sagst dem seine Mutter kriegt KREBS  usw.","replies":[{"poster":"Lotuskobra","date":"2017-08-10T18:10:38.586+0000","up_votes":1,"down_votes":0,"body":"Geb ich dir was die eigentlich nötigen Auswirkungen angeht absolut Recht, ich muss aber in vielen Punkten auch Waldschrat recht geben, ich erinnere mich auch nur ungerne an die Zeiten in Season 2 und 3 zurück. Tut mir persönlich sehr leid, dass das System in deinem Fall nicht gegriffen hat, eigentlich sollte es bei sowas automatisch anspringen.\n\nDas Sicherste bleibt das sofortige muten von Leuten die so einen Schmarn von sich geben, denn schließlich wird das System immer Lücken haben, leider.","replies":[]},{"poster":"Waldschrat86","date":"2017-08-09T22:26:16.515+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ElRockMarc,realm=EUW,application-id=KYnfKGf0,discussion-id=oPrRsKlb,comment-id=00000002,timestamp=2017-08-09T19:44:42.475+0000)\n>\n> Es stimmt nicht. Es wird ja kaum gebannt.  In meinem Spiel gestern wurde KREBS gewünscht  und was meine Mutter alles mit seinem schwanz  anstellt  und wen er alles Vögel aus meiner Familie. Was ist passiert nach dem Report nichts. Ganz im Gegenteil  wen hatte  ich im nächsten Spiel wieder dabei   ja genau den selben Typen und wieder von vorne. Das gleiche . Und das in gewonnenen spielen. Und wieder Report  und wieder nix. Er spielt auch heute weiter. Das ban System ist für den ARSCH.  Das System ist auf irgendwelche Wörter programmiert sind davon  genug gespeichert und Reportet greift der Chat ban.  Es ist für den ARSCH. Für mich gehören diese Leute die einem Krankheiten usw  WÜNSCHEN Familie sexuell beleidigen sofort für immer aus dem Spiel gebannt. Du läufst ja auch nicht in deinem Verein rum oder beim Fussball nach einem faul und sagst dem seine Mutter kriegt KREBS  usw.\n\nEs ist immer noch der Report- und kein Punishbutton(auch wenn's verdient ist). Du hast keine Ahnung wie oft der Typ spielt, du hast keine Ahnung, ob das nicht ein gekaufter Acc. ist und wieviele echte PvPs der Account hinter sich hat. \nIch finde es eher lächerlich, dass hier überhaupt Unterschiede gemacht werden. Was interessiert es mich ob mich der Typ, Huso nennt, Krebs wünscht oder \"nur\" als Idiot betitelt? Ob eine Beleidigung schwer ist oder nicht, ist im Endeffekt sowas von subjektiv.\nDeshalb wär ich da sogar ganz froh, wenn das so laufen würde wie du denkst, d.h. einfache Worterkennung.\nAber mal ehrlich, wenn's so wäre, wäre der ganze Schmarn von wegen cancer, etc. doch eh abgedeckt, scheint ja aber nicht ganz so zu sein, sonst wär der Typ, von dem du erzählst, ja direkt weg vom Fenster gewesen.\nUnd dumm ist das Programm ja auch nicht, hier gab es genug Leute die letzten Wochen, die tatsächlich meinten fgt und was weiß ich was für Legasthenikertricks da noch dabei waren, und meinten das könne ja alles bedeuten.\nMal ne ernste Frage, seit wann spielst du LoL? Ich weiß selbst an manchen Punkten ist das System noch zu schwammig, aber alles in allem hat sich das ganze im Vergleich zu Tribunalszeiten sowas von verbessert und das merkt man auch im Spiel.\nKleine Ausraster, Cptn. Obviouskommentare hab immer mal wieder, aber der rabiate Kram ist sowas von selten und auch, wenn die Rückmeldung nicht bei jeder Strafe nach Report kommt, ich hab fast immer eine bekommen, wenn mal so jemand im Game war.","replies":[]}]}]},{"poster":"manial fly","date":"2017-08-05T10:03:20.900+0000","up_votes":2,"down_votes":0,"body":"Ich hab eher das Gefühl das mit dem Bestrafungssystem ist wie mit der Hydra, für einen Spieler der gebannt wird sind schon wieder drei neue da.\nIst ja schön das es hier regelmäßig Threads gibt in denen Leute wegen ihrem Perma rumheulen, hab ich nur nichts von wenn zig tausend weitere die genauso toxisch sind ihren Account noch haben.\nRiot müsste einfach härter durchgreifen, beim ersten \"leichten flame\" (Noob etc.) ne Verwarnung und beim ersten härteren Flame nen zwei Wochen Bann. Leute die mit so Sachen wie \"get cancer\" oder \"kys\" um sich schmeißen haben direkt nen Perma verdient.\nAber beim aktuellen System hat man leider zu viele Freifahrtscheine...","replies":[{"poster":"Lotuskobra","date":"2017-08-05T10:13:34.733+0000","up_votes":1,"down_votes":0,"body":"An sich sehe ich das genauso wie du und würde mir deutlich schnellere Strafen wünschen. Ich kenn das selbst von einem Bekannten, der wirklich oft und teilweise auch hart geflamed hat und erst nach ca. 100 Spielen eine 10 Spiele Chatrestriction bekommen hat.\n\nDas Problem ist nur, Riot muss ja den Spagat zwischen Strenge, Profit und Spielspaß erhalten finden und das ist glaube ich nicht ganz einfach. Wenn 50 % der Accounts zB nicht einmal Level 30 erreichen, weil sie alle zuvor wegen Toxicity gesperrt werden, wäre das Spiel für Neueinsteiger (und die Marke League of Legends wächst immernoch) nicht attraktiv und würde eine schlecht Reputation bekommen.\n\nAndererseits ist die Spielerbasis bedroht, die aufgrund von Flame dem Spiel den Rücken kehrt (wobei ich persönlich denke, dass diese Zahlen nicht allzu groß sein dürften).","replies":[]}]},{"poster":"LOLpRoXis","date":"2017-08-05T09:47:03.173+0000","up_votes":1,"down_votes":0,"body":"Ich meine er verliert dann alle seine Accounts durch Bans.\nUnd er bekommt nicht Ehrungstufen und wird abgestuft..","replies":[{"poster":"Pilze","date":"2017-08-05T10:00:40.026+0000","up_votes":1,"down_votes":0,"body":"Das interessiert so einen nicht. Er will einfach das machen und ihm ist es egal ob er jetzt Ehrungen bekommt oder nicht, mir ist das auch egal. Ich spiele aus reinem spaß und nicht um etwas zu bekommen oder auf irgendetwas hin. Dafür gibt es genug andere die das versuchen, da muss ich mich nicht abquälen.","replies":[{"poster":"Cenâreth","date":"2017-08-05T16:07:10.356+0000","up_votes":1,"down_votes":0,"body":"Und selbst wenn man rein aus Spaß spielt muss man nicht 4 anderen ihr Spiel vermiesen, da könnte ihr auch durchaus Normals spielen.","replies":[]}]}]},{"poster":"Alekra","date":"2017-08-05T09:43:51.263+0000","up_votes":1,"down_votes":0,"body":"Schritt 1: \n\"Wurde zu unrecht gebannt\" suchen.\n\nSchritt 3: Profit","replies":[{"poster":"Veezey","date":"2017-08-05T11:26:59.186+0000","up_votes":1,"down_votes":0,"body":"du hast \"Schritt 2: ???\" vergessen.","replies":[]}]},{"poster":"lolibus","date":"2017-08-05T11:00:47.419+0000","up_votes":1,"down_votes":0,"body":"Also wirkungslos ist es nicht weil es den Leuten Zeit/Geld kostet aber das wars dann auch schon.","replies":[]},{"poster":"Hellosager","date":"2017-08-05T09:06:04.503+0000","up_votes":1,"down_votes":0,"body":"Und was soll man deiner Meinung nach dann dagegen tun?","replies":[]},{"poster":"franticFurball","date":"2017-08-05T10:46:44.145+0000","up_votes":1,"down_votes":1,"body":">scheinbar sind Bans keine wirkliche abschreckung\n\nOder die Alternative: Du bist auf das Trolling eines Trolls hereingefallen.","replies":[]}]}