{"poster":"Miniphiri","date":"2018-02-19T18:08:22.172+0000","title":"scripter wieder in mode?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"kann es sein das neuerdings wieder scripter sprie&szlig;en wie wie teemos pilze? noch nie GEF&Uuml;HLT (man beachte dieses wort da es daf&uuml;r steht das es mir so vorkommt und nicht das es so ist) so viele gehabt wie aktuell. vor allem bei rivens","replies":[{"poster":"Wolf Husky","date":"2018-02-19T19:01:22.984+0000","up_votes":1,"down_votes":0,"body":"habe bis jetzt nur einen scripter gesehen. Und das war ein Ezreal. Er war vllt nicht gut in skillshots treffen(wie den auch^^), aber ZU GUT in skillshots dodgen. Und seine Art wie er gedodgt hat kam sehr ungewöhnlich vor.\nIch hab dann mal ein Test gemacht: Habe eine Jinx Rakete abgefeuert, die er natürlich nicht sehen konnte, und er ist schon direkt am Anfang blitzartig in die effizienteste Richtung gelaufen...xD das war sowas von Auffällig! der wurde wahrscheinlich locker schon gebannt.\n\nIch weiß nicht wie es bei dir ist...vllt sind die einfach besser,gut oder die scripten wirklich(oder einfach beide davon ;) )","replies":[{"poster":"GajuGaju","date":"2018-02-20T11:27:07.988+0000","up_votes":1,"down_votes":0,"body":"jinx raketen kann man sehen. die wird dick und fett auf der minimap angezeigt. wenn er aufmerksam war und zufällig gerade auf die minimap gesehen hat, ist es wahrscheinlich, dass er sie doch kommen sah. \nnun weiss ich nicht, wie weit du von ihm weg warst. je näher du stehst, desto kürzer ist natürlich sein fenster zum reagieren.","replies":[{"poster":"Wolf Husky","date":"2018-02-20T15:58:24.452+0000","up_votes":1,"down_votes":0,"body":"1. Ich war nicht zu sehen\n2. Wie gesagt hat er diesen Typischen \"Script-dodge\" gemacht und SOFORT reagiert(schon beim auslößen der Rakete,die war noch nicht abgeschossen, dauert ja ne kleine Zeit bis die Rakete wirklich ausklingt).","replies":[]}]}]},{"poster":"Qbert","date":"2018-02-20T11:29:00.398+0000","up_votes":1,"down_votes":0,"body":"Also ich habe schon sehr lange keinen mehr gesehen ... mag aber auch an meiner Elo liegen.\nMeinen letzten hatte ich (glaube ich) in der Preseason zu S8, in Plat2","replies":[{"poster":"He Rakau Anake","date":"2018-02-20T13:28:52.565+0000","up_votes":1,"down_votes":0,"body":"Das kann ja gerade mal 2/3 Monate her sein...  Wie häufig hast du sie denn früher gesehen?","replies":[{"poster":"Qbert","date":"2018-02-20T13:29:42.482+0000","up_votes":1,"down_votes":0,"body":"in all meinen Jahren habe ich vielleicht ... hm... 4-5 gesehen ... also im Schnitt einen alle 1,5 Jahre. ^^","replies":[]}]}]},{"poster":"Kind Prow","date":"2018-02-19T18:23:52.064+0000","up_votes":1,"down_votes":0,"body":"https://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/I8nIc73d-was-genau-ist-eigentlich-1\n\nEine aktuelle Aufarbeitung der Thematik. Sie scripten nicht. Sie sind nur einfach sehr, sehr, sehr Boblastig.","replies":[]}]}