{"poster":"Miniphiri","date":"2017-08-03T08:37:19.712+0000","title":"Rassismus im Spiel","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":18,"body":"Finde es echt toll wie man hier als Deutscher im Spiel sofort als Nazi, Hitler und in der Freizeit als Juden mordender abgestempelt wird. GJ Riot ihr habt euer Spiel wirklich gut im Griff.","replies":[{"poster":"Humpelstilzche","date":"2017-08-03T09:01:09.352+0000","up_votes":14,"down_votes":0,"body":"Riot kann nicht kontrollieren, was Spieler von sich geben. Demonstration gefällig? Riot, hindert mich daran Kanarienvogel zu schreiben. Kanarienvogel. Siehst du, keine Chance! Wäre Kanarienvogel ein schlimmes Vergehen, könnten sie es höchstens im Nachhinein bestrafen.\n\nUnd genau so ist das auch mit Rassismus. Riot kann unmöglich verhindern, dass Leute sowas von sich geben. Aber Riot kann es im Nachhinein bestrafen. Und was Rassismus angeht, lässt sich Riot auch nicht lumpen. Rassismus ist eines der wenigen Dinge, mit denen man sich einen sofortigen 2-Wochen-Ban ohne vorherige Warnung einfangen kann. In absurd extremen Fällen sogar einen sofortigen Perma. \nDerartige Fälle dürfen wir hier quasi täglich im Forum bewundern (also die Thread der Leute, die sich über ihren Ban beschweren). Auch Twitter und Reddit sind voll davon. \n\nMan kann Riot also wirklich nicht vorwerfen, sie würden Rassismus tolerieren. Aber sie können halt nur dagegen vorgehen, NACHDEM es passiert ist, dementsprechend kann es Riot unmöglich verhindern.","replies":[]},{"poster":"Nordwolf87","date":"2017-08-03T09:10:20.563+0000","up_votes":11,"down_votes":0,"body":"Da hab ichs als Österreicher besser :-P\nWir waren nie nazis *hüstel* :-D \n\nAber im erst: ich nehme an dass sowas wohl ein kernpunkt des reportgrundes \"beleidigung\" ist.","replies":[{"poster":"Maexle","date":"2017-08-03T10:28:19.875+0000","up_votes":7,"down_votes":0,"body":"Oh nice you´re from Australia? :P\n{{champion:17}}","replies":[{"poster":"Nordwolf87","date":"2017-08-03T10:52:30.402+0000","up_votes":6,"down_votes":0,"body":"Yes many kanuruus here :'-D","replies":[]}]},{"poster":"Humpelstilzche","date":"2017-08-03T09:12:55.999+0000","up_votes":4,"down_votes":0,"body":"Rassismus fällt eher unter \"hate speech\". Bin mir grad nicht sicher wie das im deutschen Client übersetzt ist.","replies":[{"poster":"Megamaexx","date":"2017-08-03T09:14:50.725+0000","up_votes":3,"down_votes":0,"body":"Hassreden","replies":[{"poster":"Humpelstilzche","date":"2017-08-03T09:15:56.703+0000","up_votes":3,"down_votes":0,"body":"Ihhh...manchmal finde ich es nicht gut, dass Sachen überhaupt übersetzt werden. Das ist einer dieser Momente^^\n\n\"Hassreden\"....das ist doch kein gängiges Wort, das sagt doch keiner -.-","replies":[{"poster":"Megamaexx","date":"2017-08-03T09:18:15.199+0000","up_votes":3,"down_votes":0,"body":"Das ist eben die korrekte Übersetzung^^ aber ich finde das deutsche Wort dafür viel aussagekräftiger (auch wenn man die Sprache nicht verstehen würde)","replies":[]},{"poster":"franticFurball","date":"2017-08-04T08:43:53.332+0000","up_votes":2,"down_votes":0,"body":">\"Hassreden\"\n\nSei froh, das klingt ja noch halbwegs vernünftig.\n\nBei uns in der Gegend ist grade das Wort \"Hasspostings\" en vogue (auch in bezug auf Zeitungsartikel, Leserbriefem Chats und sogar Gespräche), besonders von Linkspolitikern, die komischerweise kein Problem damit haben, ihre politischen Gegner als \"Nazis\" zu bezeichnen.\n\nWenn man mal vorgeworfen bekommt man hätte seinen Gesprächspartner grade \"gehassposted\", dann wünscht man sich diese Leute nur noch aud den Mond.","replies":[{"poster":"Miniphiri","date":"2017-08-04T08:49:56.819+0000","up_votes":1,"down_votes":0,"body":"gehassposted o_O ernsthaft? sag bitte das des nen witz is","replies":[{"poster":"franticFurball","date":"2017-08-04T09:26:56.330+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-nunu-bummed}} \n\nSiehst du mich lachen? ^^","replies":[]}]}]}]}]},{"poster":"Nordwolf87","date":"2017-08-03T10:17:17.881+0000","up_votes":1,"down_votes":0,"body":"Gut dann hassreden bzw hate speech. Aber dass riot auf sowas als reportgrund vergessen hätte, konnt ich mir nicht vorstellen ^^","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2017-08-03T10:39:36.521+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nordwolf87,realm=EUW,application-id=KYnfKGf0,discussion-id=t1m0ek9O,comment-id=0002,timestamp=2017-08-03T09:10:20.563+0000)\n>\n> Da hab ichs als Österreicher besser :-P\n> Wir waren nie nazis *hüstel* :-D \n> \n> Aber im erst: ich nehme an dass sowas wohl ein kernpunkt des reportgrundes &quot;beleidigung&quot; ist.\n\nIst euer Vorzeigenazi nicht daran gestorben, dass er sich geweigert hat, links abzubiegen? Auf nem... Berg...","replies":[{"poster":"Nordwolf87","date":"2017-08-03T10:54:05.955+0000","up_votes":2,"down_votes":0,"body":"Wenn du den meinst den ich glaube (Haider), dann nein, dem ist ein baum vors auto gehüpft","replies":[{"poster":"MeMyselfandBaal","date":"2017-08-03T14:07:47.122+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Nordwolf87,realm=EUW,application-id=KYnfKGf0,discussion-id=t1m0ek9O,comment-id=000200020000,timestamp=2017-08-03T10:54:05.955+0000)\n>\n> Wenn du den meinst den ich glaube (Haider), dann nein, dem ist ein baum vors auto gehüpft\n\nHat der nicht rechts die Leitplanke mitgenommen? Ich meine, gibt es in Österreich überhaupt Bäume? Das mit den Bäumen war doch Brandenburg...","replies":[{"poster":"Nordwolf87","date":"2017-08-03T14:22:05.329+0000","up_votes":2,"down_votes":0,"body":"Jop ein paar haben wir. Was war in Brandenburg?","replies":[{"poster":"MeMyselfandBaal","date":"2017-08-03T14:52:42.447+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Nordwolf87,realm=EUW,application-id=KYnfKGf0,discussion-id=t1m0ek9O,comment-id=00020002000000000000,timestamp=2017-08-03T14:22:05.329+0000)\n>\n> Jop ein paar haben wir. Was war in Brandenburg?\n\nIn Brandenburg stehen ungelogen entlang der Landstraßen \"Achtung, Baum, nicht gegen fahren\" Schilder... Und das ist so ziemlich das einzige, was Brandenburg hat...","replies":[]}]}]}]}]},{"poster":"Squidwards House","date":"2017-08-03T19:34:26.202+0000","up_votes":1,"down_votes":0,"body":"lüge. ich bin der einzige österreicher im internet. (little britain anspielung) aber ernsthaft, leute von uns sind doch sowieso nur auf facebook unterwegs?","replies":[]}]},{"poster":"Maexle","date":"2017-08-03T10:30:12.160+0000","up_votes":11,"down_votes":1,"body":"Wenn es dich triggert, dass du als Nazi beschimpft wirst, bist du dann vielleicht jemand von der Sorte \" ich bin ja kein Nazi, aber...\"? \n{{sticker:slayer-jinx-wink}} \n{{champion:17}}","replies":[{"poster":"Miniphiri","date":"2017-08-03T15:53:19.162+0000","up_votes":2,"down_votes":10,"body":"oder ich bin einfach einer den es stört das ich als einer dieser Hirntoten bazillen hingestellt werde aber schön das es auch deutsche gibt die anderen unterstellen sie wären nazis ^^ in meinen augen ist es nunmal eine beleidigung als so einer von denen hingestellt zu werden.","replies":[{"poster":"XExEcUtOrX04","date":"2017-08-03T19:31:09.096+0000","up_votes":1,"down_votes":6,"body":"Na es kommt drauf an, alles was nicht ansatzweise links von CDU/CSU ist wird als pöser, pöser Nadsi hingestellt.","replies":[{"poster":"Shianmaon","date":"2017-08-03T22:14:09.661+0000","up_votes":7,"down_votes":1,"body":"Wissenschaftlich gesehen ist es von der CSU nicht weit zur AfD bzw. sind da schon einige Überschneidungen vorhanden und von dort ist es zum rechten Rand nicht mehr weit. Rechts davon kann also durchaus als Nazi bezeichnet werden. Kommt immer darauf an, von welchem Flügel der Parteien man ausgeht. Von einer etwas differenzierteren Argumentation kann man aber leider nicht ausgehen.","replies":[{"poster":"XExEcUtOrX04","date":"2017-08-03T23:05:44.914+0000","up_votes":2,"down_votes":0,"body":"Ja vollkommen richtig, bin anscheinend für heute nicht mehr für sowas zu gebrauchen.\nDa hab ich mir wohl selbst ein Loch geschaufelt ... machste nichts","replies":[]}]},{"poster":"Durkheim ","date":"2017-08-03T22:05:49.151+0000","up_votes":4,"down_votes":0,"body":"pöhser wird meistens mit h geschrieben","replies":[]}]},{"poster":"Maexle","date":"2017-08-03T22:40:54.254+0000","up_votes":1,"down_votes":0,"body":"1. Woher willst du wissen, dass ich Deutscher bin. Ich könnte auch aus Österreich oder der Schweiz kommen. Oder aus dem Elsass und durch die Nähe zu Deutschland einfach nur relativ gut Deutsch können. Oder aus Rumänien, wo es eine deutsche Gemeinde gibt.\n2. Wenn dachtest, dass es keine Deutsche gibt, die Anderen unterstellen, dass sie Nazis sind, dann frage ich mich, ob du in einem Keller wohnst ( wober das eher das Ding von Österreichern ist)\n3. Wenn du das als Unterstellung auffassen willst, kannst du das gerne machen {{sticker:zombie-brand-clap}} \n{{champion:17}}","replies":[{"poster":"eingew","date":"2017-08-04T10:18:54.691+0000","up_votes":1,"down_votes":0,"body":"Es gibt noch mehr: \n\nhttps://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Legal_statuses_of_German_in_Europe.svg/769px-Legal_statuses_of_German_in_Europe.svg.png","replies":[]}]}]},{"poster":"Gâlahad","date":"2017-08-04T10:27:51.699+0000","up_votes":1,"down_votes":0,"body":"Spricht nicht gerade für dich Leuten sowas unterstellen zu wollen nur weil man sich bei einer Beleidigung angegriffen fühlt.\nVergiss nicht das vielleicht nicht jeder so ein dickes Fell hat wie du es gewohnt bist. Zudem gibts auch Leute die LoL spielen und noch etwas jünger sind. Die lassen sich meistens leichter von Beleidigungen beeindrucken als erwachsene.","replies":[{"poster":"Maexle","date":"2017-08-04T12:28:33.130+0000","up_votes":2,"down_votes":1,"body":"Es ist keine Unterstellung, es ist eine Frage. \n{{champion:17}}","replies":[]}]}]},{"poster":"three stodges","date":"2017-08-03T13:02:28.277+0000","up_votes":3,"down_votes":9,"body":"Die down Votes kann Ich nicht nach vollziehen.","replies":[{"poster":"Miniphiri","date":"2017-08-03T15:51:53.834+0000","up_votes":3,"down_votes":9,"body":"ach die ignoriere ich . soweit ich mitbekommen habe downvoten hier auch genug trolle die sich dadurch witzig finden oder halt auch leute die das thema nicht mögen. Doof nur für die: auch negative publicity is noch immer publicity","replies":[{"poster":"Maexle","date":"2017-08-03T22:01:19.527+0000","up_votes":11,"down_votes":0,"body":"Du überschätzt dich, wenn du diesen irrelevanten Thread, der nicht ansatzweise konstruktive Kritik oder Lösungsvorschläge enthält, \"publicity\" nennst. Das ist nicht einmal Bild-\"Niveau\".\n{{champion:17}}","replies":[]}]},{"poster":"Maexle","date":"2017-08-03T22:43:29.777+0000","up_votes":4,"down_votes":0,"body":"Ja die Struktur des Threads ist ja sehr schön. Und inhaltlich äußert der TE ja nur konstruktive Kritik und er schlägt ja so viele Möglichkeien vor, was man dagegen machen könnte...\n{{sticker:zombie-brand-facepalm}} \n{{champion:17}}","replies":[]}]},{"poster":"Megamaexx","date":"2017-08-03T09:15:36.172+0000","up_votes":7,"down_votes":0,"body":"Reporten und gut ist's?","replies":[]},{"poster":"Webturnier","date":"2017-08-03T14:50:53.566+0000","up_votes":1,"down_votes":1,"body":"einfach lügen dass du aus dänemark oder bulgarien kommst, dann gibts keine nazibeschimpfungen. habe selber sooo viele \"nazi!!!!\" erfahrungen machen müssen :((((","replies":[{"poster":"Maexle","date":"2017-08-03T22:02:48.367+0000","up_votes":6,"down_votes":0,"body":"Wenn man die (aktuelle) politische Haltung Bulgariens betrachtet ist es gar nicht mal so unwahrscheinlich, dass man als Nazi beschimpft wird, wenn man sagt, dass man von dort kommt.\n{{champion:17}}","replies":[]}]},{"poster":"Durkheim ","date":"2017-08-03T22:04:30.005+0000","up_votes":7,"down_votes":1,"body":"mimimi die bösen Leute im Internet ärgern mich schon wieder mimimi","replies":[]},{"poster":"dugg","date":"2017-08-03T09:17:16.357+0000","up_votes":2,"down_votes":0,"body":"Verhindern kann man so etwas nicht. Du kannst auch Leute nicht daran hindern \"Ausländer Raus\" an die Wände zu schmieren. Machst du dann auch den Gebäudebesitzer dafür verantwortlich, dass er es nicht geschafft hat dies zu verhindern?\n\nDu kannst nur den Weg des Reports wählen. Bei Rassismus und/oder Antisemitismus versteht Riot, subjektive Einschätzung, weniger Spaß, als bei Beleidigungen wie \"noob\". Zwei Reports von mir waren wegen antisemitischen Sprüchen. Am nächsten Tag bekam ich die Nachricht, dass meine Reports zum Erfolg geführt haben.\n\nIch würde mir diesen Nazischeiß eh nicht ankreiden und wegatmen.","replies":[{"poster":"eingew","date":"2017-08-03T10:07:34.834+0000","up_votes":3,"down_votes":0,"body":":D\n\nImmerhin wollte unser allseits geliebter Justizminister die Betreiber von sozialen Netzwerken für das verantwortlich machen, was die Nutzer der Plattform so für Scheiß verzapfen.","replies":[]}]},{"poster":"00 M4ddin 00","date":"2017-08-03T12:02:58.327+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Miniphiri,realm=EUW,application-id=KYnfKGf0,discussion-id=t1m0ek9O,comment-id=,timestamp=2017-08-03T08:37:19.712+0000)\n>\n>  GJ Riot ihr habt euer Spiel wirklich gut im Griff.\n\n\nWer beschimpft dich den ? Die minions oder die champions ? ^^ \n\nWeil für deine mit und gegenspieler kann riot ja nichts ;) \nAber du kannst sie mach dem game reporten :) \n\nMfg maddin","replies":[]},{"poster":"Necromant","date":"2017-08-03T08:38:41.573+0000","up_votes":5,"down_votes":2,"body":"Nazi!!!11! :D\n\nIgnoriere sowas gekonnt :)","replies":[]},{"poster":"Shacoláde","date":"2017-08-04T07:29:17.098+0000","up_votes":2,"down_votes":0,"body":"Aus welchen Grund gibst du dich denn als Deutscher aus?\nMuten, ignorieren und fertig aus.\nDie Kluft kann so schön ruhig und gemütlich sein.","replies":[]},{"poster":"Veezey","date":"2017-08-03T19:05:49.904+0000","up_votes":3,"down_votes":2,"body":"Das würde mich einfach mal gar nicht jucken lol. Lass die Leute reden.","replies":[]},{"poster":"Epic Melons","date":"2017-08-04T08:17:38.263+0000","up_votes":2,"down_votes":2,"body":"Lol, wer sich von so etwas beleidigt oder verletzt fühlt hat ganz andere Probleme als League.","replies":[{"poster":"Miniphiri","date":"2017-08-04T08:48:52.729+0000","up_votes":2,"down_votes":1,"body":"aha is ok. sry das es mich stört wenn ich mit einen von den hirnlosen verglichen werde. schön das dein Ego zulässt es zu ignorieren aber ich hab nunmal kein mega ego weswegen mich sowas stört.","replies":[]}]},{"poster":"Pandeonor","date":"2017-08-04T12:36:32.430+0000","up_votes":1,"down_votes":0,"body":"Wieder ein Thread bei welchem ich \"nicht erkenne\" weshalb er existiert.\n\nIch mache fast täglich das ein- oder andere Match. Ich glaube bei all meinen Spielen dieses Jahr und nicht bei einem in den letzten 3 Monaten wurde ich  gefragt woher ich komme.","replies":[]}]}