{"poster":"Riot Wav3Break","date":"2014-06-05T04:30:03.674+0000","title":"[4.10] Live Gameplay Patch Forecast","subforum":"Live Gameplay Balance","up_votes":17,"down_votes":12,"body":"Hey guys, Wav3Break here for the 4.10 Patch Forecast. I’ll be explaining some of the reasoning and insights that the balance team is using to approach some of the major issues we have found in live League of Legends gameplay. Keep in mind that this forecast is meant to highlight some of the problems we’ve identified and that not all issues mentioned will necessarily have changes reflecting them in the upcoming patch. Some changes might take longer than others and everything is subject to change! Without further ado:\n\n**DISCLAIMER: I'M GOING TO BE SAYING MARKSMEN A LOT.\n**\n\n\n**4.10 – The Marksmen Patch:** We're currently looking at a lot of things in and around the space of the marksmen role in League of Legends. In 4.10, we expect to tune a lot of game elements that currently impact the health and success of the role. You’ll be seeing a lot of changes regarding marksmen itemization paths, champions, items that affect their late game power, etc. Our overall goal is to make these champions feel more satisfying late game and shine even brighter as the powerful late game champions they were meant to be. \n\n**Edit for easier clarification:** \n\nWith the changes coming in 4.10, we expect that the entire marksman role will be more powerful. That is why we are closely looking at the current dominant champions and making sure that they don't become over the top in the aftermath of implementing our overall role changes.\n\n**Marksmen we feel that are too strong:** We feel that the following champions currently warp the role in such a way that it is unhealthy for the role itself and/or the holistic game. The power of these characters negatively impacts the overall viability of other marksmen and we plan on making some changes to bring them back in line with their marksbrothers and markssisters.\n\n**1) Twitch**\n\nAs Jag mentioned in our 4.8 patch forecast (http://community.na.leagueoflegends.com/en/c/live-gameplay/gTkfbmI6-48-live-gameplay-patch-forecast), Twitch is an incredibly powerful champ that has been on our radar since his rise in popularity in both competitive and casual play. Our current feelings on this sneaky rat are that his early game power does not give him enough weaknesses to offset his hyper scaling carry potential in the late game. Our challenge is to retune his early game dominance to be better balanced with his late game power levels.\n\n**2) Lucian\n**\n\nLucian is still widely regarded as one of the safest and most reliable marksmen in all levels of play. His early game poke via Piercing Light and a scaling double-hit passive allow him to dominate the lane phase while also dealing very respectable damage late game. These problems coupled with his innate safety continue to allow him to dominate the role. In this upcoming patch we plan to retune some his early game strengths and give him well-defined weaknesses and strengths throughout all stages of the game. \n\n**Marksmen that we feel need some special lovin’:** We feel that the following champions have currently fallen out of flavor for reasons that specifically have to do with their lack of power or loss of late game identity. We plan to implement changes that will help these champions reestablish themselves as compelling markspeople to play in the current live game.\n\n**1) Sivir**\n\nOur previous changes to Sivir were aimed at reducing her capabilities in the early game to push minion waves down while avoiding any interaction with her lane opponent(s). While the changes we last implemented did accomplish this goal, we feel that some of the constraints we enforced on her early game currently inhibit her identity as a powerful AOE Marksmen in the late game. Thus we are looking to retune some of her mana issues in the late game to make her feel more like the powerful ricochet damage dealer she was meant to be. \n\n**2) Tristana**\n\nTristana is one of the most classic Marksmen and we’ve identified her as one of the weaker ones in today’s landscape. That being said, we believe there are many low risk changes we can actualize to make her a more attractive champion in the live game. \n\n**Game Systems that impact the Marksmen role (Marksmen Items / Defensive Items):** \n\n**1) Warden’s Mail and Randuin’s Omen**\n\nThese items are currently the premier buys for players wishing to itemize against ubiquitous physical damage. While we want to maintain the defensive effectiveness of these items, we feel that they may be too powerful due to their combination of high base stats and unique passives.\n \n**2) Life Steal Itemization**\n\nThe game systems team has a lot of changes for marksman itemization (specifically centered on life steal) that they'll go into on their upcoming game systems forecast.\n\n**Other Pressing Issues: **\n\n**1) LeBlanc**\n\nAs mentioned in the previous patch forecasts, we are continuing our efforts in creating a healthy LeBlanc for League of Legends. We still enjoy her skill requirements and mind-gamey playstyle, but LeBlanc’s issues reach further into the core of the character and therefore the scope of our long term goals for her have also increased. Still, due to her power and lack of counter play in the live game, we are looking at some incremental changes that will make her play pattern healthier and maintain her defining playstyle.\n\n**Champion Rework Updates:** We've got some champion rework updates on the way in the form of Nidalee and Skarner, so head over to the champion update forecast (http://community.na.leagueoflegends.com/en/c/champions-skins/ZuUsm0U8-champion-updateupdate-49-410) for more information there.","replies":[{"poster":"0813 1707","date":"2014-06-05T05:45:41.116+0000","up_votes":79,"down_votes":13,"body":"WTF wheres Quinn? Shes never been viable at any stage in the game ever and i've never seen her played professionally at all.","replies":[{"poster":"ThatRaggedyMan","date":"2014-06-05T08:11:32.279+0000","up_votes":32,"down_votes":7,"body":"Please Riot, look at Quinn. She's currently in a weird spot between duelist ADC and Assasin. It's about time this Demacian bird gets to really soar.","replies":[{"poster":"Azon 01","date":"2014-06-06T14:16:47.777+0000","up_votes":4,"down_votes":4,"body":"You people need to try Quinn top. It's actually her best spot right now.","replies":[{"poster":"Riot Wav3Break","date":"2014-06-06T23:46:16.143+0000","up_votes":9,"down_votes":2,"body":"I agree that Quinn currently does not function at her best as a traditional marksman and that she feels like she is at an awkward spot regarding her champion identity. That being said I don't think that she is a particularly weak champion. She is an incredibly interesting character and we want to observe how the overall game changes after we implement the changes we have planned in 4.10. The post 4.10 analysis will be real and we look forward to the feedback and discussion you guys will have for us :).","replies":[{"poster":"NA Darklarik","date":"2014-06-07T18:36:34.316+0000","up_votes":7,"down_votes":0,"body":"Please dont make her another shallow champ. Im saving up to try and play her the way Riot Afic plays her, splitpushing duelist. God forbid you have ADCs that fit nich roles and bring a different kind of strenght to the table. \n\nShes the only adc i want to learn due to her pattern, if you make that pattern like all the other ADCs, your gonna be making your game more stayle...","replies":[]},{"poster":"mikeboxmad","date":"2014-06-08T04:05:06.248+0000","up_votes":4,"down_votes":0,"body":"I really hope if you guys do change Quinn she can still go Top/Mid/ADC. I think that is what is awesome about her.","replies":[]},{"poster":"HemiPoweredDrone","date":"2014-06-07T00:13:59.424+0000","up_votes":5,"down_votes":2,"body":"Please, don't make her a traditional marksman, if that's what your suggesting. It's clear that that's not what she is, and the dozens of devoted Quinn users, such as myself, love her current kit, even though it might not be perfect. What needs to really happen is that she not be classified as a marksman, she works as one, but really is not. Instead, she is a ranged AD Assassin, almost a light fighter in a way since she needs to have defensive stats to effectively use her ult, her kit fits that definition perfectly with her blind, her gap closer that puts her at the perfect range, and her passive that allows her to do quite a bit more damage to her target. Then her ult perfects that by allowing her to quickly go in to clean up or finish the job by chasing her target if they try to escape. That's the kind of gameplay that many of us love about her and would hate to be changed. We don't want just another marksman.\n\nHowever, if you want to improve her and possibly increase play, besides reclassification, I think a few QoL/buffs could be made to improve her ult, because from what it seems, most users basically see her ult as useless.\n\n* Lower the early cooldown on her ult, it's extraordinarily long at low levels, making a lot of us scared to use it opportunistically early on since if it fails, we've got a really long CD to wait for it to come back.\n\n* Give her some resistances while in the melee Valor. They don't have to be huge, as most people build some resistances on her anyway at some point, but because she has the stats of an ADC when she's melee means she gets crushed fairly easily. Just something that'd let her compare with light fighters like Fiora or Trynd.\n\n* Give her a passive while using her ult. It's always seemed kind of unfair that her passive is useless when Tag Team is used. Maybe something like giving you vision of champions you autoattack? Eh, maybe not that, but just something to make it feel like you're not playing down an ability.\n\n* Please reset her cooldowns when she ults, they're similar but different abilities, and I feel like reseting her CDs when she ults would give her a lot more possibilities in combat. At the very least reset her E's cooldown, that's her most vital chasing ability in that form, and it sucks to have to wait for the CD because you used it in human form.\n\nI feel like Quinn is a fantastic champion, her ult needs a bit of tuning, but that's not too surprising considering how unique she is. I feel like these problems don't get expressed often, though, simply because no one but a few people play her, especially not the extremely vocal ones in the lower tears. I think I've only seen one Quinn besides myself in my Bronze matches, but maybe some changes could really help.\n\n**TL;DR** - Quinn is awesome, please don't change her core as a Ranged Assassin/Light Fighter, but the fighter part of her could use a little tuning.","replies":[{"poster":"Degraid","date":"2014-06-08T08:38:15.929+0000","up_votes":3,"down_votes":0,"body":"I don't quite agree making Quinn set her role to be a top bruiser. By making these changes, it would make Quinn more like Jayce. If you want a top lane bruiser range fighter, it would makes sense to play Jayce instead. Even though Quinn is strong at top lane, I think she belongs at bot. But one I agree though is a reset on her E when she ults. \n\nQuinn's Ult is usually a finisher. Meaning a Quinn player will exhaust every skill to assassinate a person and will have no escape. Now what I have in mind is since her ult is a finisher, why not give her a reset on her E when she kills her target with her ult. I also think this fairly balance because ,unlike Khazix's E, it's not a skill shot it's a target skill. \n\nAlso what bothers me about Quinn is that her Ult is split in to two halves. In her ult and her W. Most Quinn player max W last, which really sucks because you want the cooldown for E and the dmg in Q. I suggest to relocate this passive buff ,for Quinn's ult, to another skill.\n\n(I kinda get why this is spilt in half. I'm guessing they are giving you a choice, either to max Q,E and mostly play as Quinn or to max Q,W and mostly play as Valor. A character select within a character select. :O. This Quinn and Valor makes unique and strong but also weak at the same time because of the lack of synergy of the skills that hold them together.  Like When ulting, your plan is to assasinate as an ADC, but after that what now?)\n\nOverall Quinn and Valor is a very unique champion and that's what makes them fun. In my opinion their skills is fine just the way it is, but she needs a lot of tweaking to complement each other more in both forms.","replies":[]}]}]},{"poster":"Kitch26","date":"2014-06-06T19:12:02.775+0000","up_votes":4,"down_votes":3,"body":"Agreed. Most people don't recognize this though. You'd be surprised how many times I ask for top and get flamed for choosing Quinn.\n\nHer kit lends to a crit build. You can reach 95% crit with 4 items then can choose between MS, LS, or armor pen. Then you can wreck.","replies":[{"poster":"HemiPoweredDrone","date":"2014-06-07T00:17:11.143+0000","up_votes":3,"down_votes":0,"body":"Crits? I've been having much more success with a bruiser build, similar to Jax, where I build BotrK-Tri-Force (which she uses extremely well) then full tank, unless I'm really ahead. With a sturdy build she can really get in and wreck faces as Valor. I particularly like the active on Randuin's, slow and blind everyone around you, they're practically useless.","replies":[]}]}]}]},{"poster":"art3mis2","date":"2014-06-05T06:12:05.591+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Squeetar","date":"2014-06-05T06:14:09.431+0000","up_votes":9,"down_votes":4,"body":"Quinn will never be a meta ad carry, both her e and ult directly counter what an adc wants to do, which is stay away from the enemy.","replies":[{"poster":"BobbyOvsky","date":"2014-06-05T13:27:09.223+0000","up_votes":13,"down_votes":2,"body":"You have no idea what numbers can do. Give Quinn ultimate some mr/armor and like prepatch nidalee, she will be good to go. Especialy in the current translation meta.","replies":[]},{"poster":"Elfalas","date":"2014-06-05T14:14:10.027+0000","up_votes":11,"down_votes":1,"body":"Quinn isn't a traditional ADC, she's a heavy burst duelist ADC. She is incredibly strong in the mid game as her ult allows her to basically 1v1 most champions in the game (except like Mundo or Singed who get massive defense steroids). Quinn doesn't fit in the competitive meta of ADC's that have lots of self peel and can output tons of damage in teamfights, Quinn doesn't do that but in solo q she is perhaps one of the better ADC's if played right.","replies":[]}]}]},{"poster":"MiguelmRusso","date":"2014-06-05T13:14:52.622+0000","up_votes":11,"down_votes":1,"body":"Quinn works top or mid lane. Urgot has even harder times...","replies":[]},{"poster":"Yuki VIII","date":"2014-06-05T15:25:27.381+0000","up_votes":6,"down_votes":2,"body":"I have to agree with you. That's cool... Lucian... Twitch... Sivir (again)... Tristana (not bad at all)... But what about Quinn?! Y'know, I haven't listened her name since Miss Fortune changes early season. Please, Riot, make her viable both top and adc. Just it. I'm tired waiting for changes on her. >:","replies":[]},{"poster":"I Am Quite Bad","date":"2014-06-05T11:25:39.467+0000","up_votes":9,"down_votes":5,"body":"Quinn is just generally better as a toplaner at this point. She fits that role surprising well with her current kit, but is not recognized by a majority of people. I don't think there is any reason to change her.","replies":[]}]},{"poster":"Vortex IV","date":"2014-06-05T04:51:55.539+0000","up_votes":55,"down_votes":13,"body":"I don't think nerfing twitch and lucian really fits the novel that morello wrote out for nerfing recently. It just shows that Riot nerfs what's played and not what's actually out of balance. Twitch was no more imbalanced right now than he was before his VU, the VU caused more people to play him and now he's suddenly nerfworthy? Lucian is \"safe\" and \"reliable\" and that's a bad thing? He's probably the only adc that is actually relatively close to where all adcs should be. \n\nStop nerfing strong champions because they get played too often and bring other champions up to their level so there's an actual meaningful choice to be made in champ select. That's a much better route than nerfing everything that stands out down to a mediocre state (this one reeks of Ghostcrawler).","replies":[{"poster":"MackleDoge","date":"2014-06-05T04:54:19.648+0000","up_votes":28,"down_votes":3,"body":"Thank you. Literally no changes to Twitch outside of visual and suddenly he's \"too strong\"?","replies":[{"poster":"Aspect Draconis","date":"2014-06-05T05:41:39.591+0000","up_votes":11,"down_votes":9,"body":"There doesn't need to be any direct changes made to champs so as to make them the current meta champs as in relatively stronger than other champs in their role. Assassin meta has fallen off as compared to before due to the recent exhaust and heal changes a few patches back which make immobile carries like Twitch much safer, along with his visuals he also got a QoL indicator on his E which helps the majority of people who play Twitch who haven't mastered him. He was popularised in pro play due to the fact he's one of the only marksman who can create picks in the mid game, and due to it being famous in pro play, he's now played a lot in solo queue.","replies":[{"poster":"MackleDoge","date":"2014-06-05T05:48:07.879+0000","up_votes":12,"down_votes":5,"body":"Being played a lot =/= too strong. It never will.","replies":[]}]}]},{"poster":"Riot Wav3Break","date":"2014-06-05T05:00:44.263+0000","up_votes":19,"down_votes":8,"body":"I apologize if this was not clear in the original post, but many of the game systems updates we plan to roll out in 4.10 will increase the power level of the entire marksmen role. All marksmen champions will have even more impact on games. Thus in the wake of these changes, we are paying extra attention to Twitch and Lucian as they are already two of the strongest and we are bringing the entire class's base line higher.","replies":[{"poster":"Vortex IV","date":"2014-06-05T06:02:26.092+0000","up_votes":14,"down_votes":2,"body":"Sounds a lot like when you were bringing all of the supports up to a higher level, and you pre-nerfed all of the traditional supports because of \"utility scaling\". That left all of them mediocre and left us with Thresh Annie and Leona nightmares every game.\n\nThe problem is the way you approach things. You need to introduce whatever you have planned for adcs THEN worry about nerfing champions. I'm hoping you're not doing the typical nerfing ahead of paradigm shifting method again.","replies":[]},{"poster":"MackleDoge","date":"2014-06-05T05:13:59.210+0000","up_votes":2,"down_votes":0,"body":"I really really hope that's the case. When you say game systems are you talking about some sort of mechanical adjustment or more of an item sort of stance? I know you mentioned lifesteal specifically and that it will have another thread, but can we get a hint? Are we talking more options in the form of new items? Are we talking altered number values and stats on existing items? New build paths for current items?\n\nI just can't help but look at this and see the exact opposite of what is being done in other roles. Part of that is obviously not having full scope of things from just this post yet, part of it might be not having actual numbers that show with the changes the two in question will be over the top, but when changes occur that effect an entire \"job\" set in the game, I think it's fair to have some skepticism. Especially given the questionable importance of ADCs for a while now.","replies":[{"poster":"Xypherous","date":"2014-06-05T05:08:29.843+0000","up_votes":9,"down_votes":3,"body":"It's items. I'm working on getting the post up right now.","replies":[{"poster":"MackleDoge","date":"2014-06-05T05:18:16.459+0000","up_votes":2,"down_votes":0,"body":"Sweet, excited for that. Bring me good news, I beg of you. Or at least some good pictures, that would also work for me.","replies":[{"poster":"Xypherous","date":"2014-06-05T05:31:54.687+0000","up_votes":5,"down_votes":2,"body":"You'll have to wait till Friday to get the better part of the deal when I post item specifics on PBE - the thing I'm posting will just be an overview and will cover broad topics rather than 'look at how this item got specifically stronger/weaker.'","replies":[]}]}]}]}]},{"poster":"Lneacx","date":"2014-06-05T04:55:11.843+0000","up_votes":4,"down_votes":7,"body":"They *are* buffing Sivir and Tristana. I'm not sure why you're tunneling on the nerfing of Twitch and Lucian.","replies":[{"poster":"MackleDoge","date":"2014-06-05T04:49:01.003+0000","up_votes":10,"down_votes":3,"body":"Because that doesn't solve the fact that Riot's actions aren't matching Riot's words. If they want multiple ADCs to be viable, they need to buff others to the level of ADCs that are actually able to do something in the game, not just bring out the nerf bat every patch or two to change which two ADCs are \"too strong\".","replies":[]}]}]},{"poster":"CSDragon","date":"2014-06-05T06:55:26.831+0000","up_votes":26,"down_votes":1,"body":"I posted this last time Twitch came up, and it got a lot of up votes, but no riot responce. Mostly due to me posting it over a day late. So I'mma post it again.\n\n-------\n\n\nAs a Twitch main, I can say with certainty Twitch is *nothing* more than a product of The Meta right now.\n\nYou ask why he was less popular for a while? It's not the new model. Twitch was insanely popular in the 2013 Summer Split, but you did not nerf him out of popularity, the reason he faded was due to meta shifts.\n\nFirst and foremost, twitch's largest weaknesses are high burst that he can't stealth away from, and enemy champions with quick harass patterns that can get in, do damage and get out before twitch can stack his poison and Contaminate for massive damage.\n\nNear the end of the summer split, the assassin mid lane became very popular. While bad news for many ADCs, Twitch was one of the most affected, as he relies on his 850 range in teamfights to survive, and Ahri and Zed could close that distance instantly. Twitch was suddenly a lot less powerful.\n\nThen, the Trinity Force rework happened. Suddenly burst ADCs like Corki and Lucian were not just viable but top-tier, and twitch's biggest weakness, early game burst lanes, became the standard bot lane. About this time, the high-burst Annie support also rose in popularity.\n\nAfter Corki got nerfed, the bot lane meta shifted to Sivir/Jinx/and/Lucian ADCs and Thresh/Leona/Annie supports. Bot had become a deathlane that Twitch was not suited for.\n\nAbout this time the tanky rushdown top meta was in full swing. This meta was bad for any ADC without an escape or movespeed steroid, Twitch among them.\n\nTwitch does not thrive in this environment at all, and became one of the least picked ADCs at the time (barring Quinn and Urgot), sitting next to Miss Fortune and Kog'Maw in terms of popularity. (Also big 2013 champs that got ousted due to the meta.)\n\nBut meta is change. No meta lasts forever, and with the season 4 changes to snowballing, assassin mids fell out of flavor and building for late game suddenly became more preferable. This put carries back in the top lane instead of Mundo and Shyvana.\n\nAnother unexpected thing happened about that time too. Morgana took to support, weakening the bot lane all-in lanes, and Lulu and Soraka became popular in solo lanes, giving Twitch his much needed peel late game. This allows Twitch to operate at full capacity.\n\nTL;DR: Twitch is strong in a meta that emphasizes peel and late game. He was weak for a long time because the meta emphasized burst and early game.\n\nPlease, leave Twitch alone. If you want him to have less of an impact, buff Tristana. Buff Kog'maw. Buff Vayne. Buff ADCs that should be as powerful as him late, but have been nerfed into uselessness, even in a meta that favors them.\n\nOr nerf late game and buff early game so we can have a nice balance between Season 3's early game meta and Season 4's late game meta and Twitch will fall into place. Nerf Morgana support, Soraka top/mid and Lulu mid so \"Protect the Doublelift\" comps are less viable.","replies":[]},{"poster":"Angry Monster","date":"2014-06-05T06:30:44.651+0000","up_votes":14,"down_votes":0,"body":"still waiting on the promised tank jungle fixes. You know the ones that were promised 4 patches ago?","replies":[]},{"poster":"Shinjusuke","date":"2014-06-05T07:23:57.337+0000","up_votes":16,"down_votes":3,"body":"When you buff Tristana, FOR THE LOVE OF GOD DO NOT BE IGNORANT OF AP TRIST.\n\nAP Trist is a ridiculously low-to-no counterplay hypersnowballing safe 100-0 champion, who negates a few mids entirely (Swain anyone?) if she gets picked.\n\nThe *last thing* Trist needs are global buffs to the champion. When you buff her, make sure it gives no power to AP Trist. She does not need any more.","replies":[{"poster":"Mytherrus","date":"2014-06-05T07:27:51.476+0000","up_votes":4,"down_votes":3,"body":"Yes please.  I think the AP scaling on her ulti should be .7 if that.  Trist is meant to be an ADC, and she is stronger as an assassin than an ADC.","replies":[{"poster":"Hyrum Graff","date":"2014-06-05T14:38:25.309+0000","up_votes":5,"down_votes":1,"body":"I don't think I agree with this. AP trist is stronger early to mid-game. Late game. AD trist wins by a long shot (pun intended).","replies":[]}]}]},{"poster":"Wasabo","date":"2014-06-05T06:06:21.875+0000","up_votes":6,"down_votes":2,"body":"Again they f{{champion:6}} \n\nAlso, I think {{champion:96}} needs a little more utility. Something to escape gap closing champions, which weren't common when he was made. Maybe his Q or his E could stun the champ when it hits them. Also, what if his ult was more like {{champion:30}} Q where it does bonus damage to single units or like {{champion:38}} Ult where it does bonus damage each cast?","replies":[{"poster":"5G8Nri0B54","date":"2014-06-05T07:15:52.103+0000","up_votes":13,"down_votes":2,"body":"I've said it once before and I'll say it again.\n\n\nUrgot is NOT AN ADC","replies":[]},{"poster":"Mytherrus","date":"2014-06-05T07:37:49.505+0000","up_votes":8,"down_votes":1,"body":"Urgot is a lot like Quinn, shit ADC, but can do well in the top lane.  Both of their ultimates do the exact opposite of what an ADC should be doing, going into the front lines.  I think they should buff up both Urgot and Quinn's tankyness so that they can compete in the top lane, as opposed to rework them for ADC.","replies":[]}]},{"poster":"MarcusSnow","date":"2014-06-05T05:32:55.559+0000","up_votes":14,"down_votes":4,"body":"\"Marksmen that we feel need some special lovin’\"\n\nNo Urgot\n\nMight as well delete him from the game if you guys are going to ignore him for this long","replies":[{"poster":"Aspect Draconis","date":"2014-06-05T05:44:44.465+0000","up_votes":7,"down_votes":1,"body":"I don't think they will buff champs like Urgot, Sion, Poppy etc until their reworks plus   from reading most of the personal opinions of Rioters on him over the past year - they consider him more of a bruiser for top or a lane bully at bot rather than a normal marksman.","replies":[{"poster":"Wasabo","date":"2014-06-05T06:07:23.687+0000","up_votes":8,"down_votes":0,"body":"Poppy doesn't need a buff. She needs a balance. Horrible early game, extremely OP late game, needs a VU also.","replies":[]}]}]},{"poster":"Poark Bally","date":"2014-06-05T05:39:07.803+0000","up_votes":10,"down_votes":1,"body":"Nerfing Lucian seems silly to me, while yes he is \"Safe and Reliable\" he is in no means a crazy ADC compared to other ADC's who can hyper carry. Considering he doesn't scale crazy unless he snowballs hard (which every champion can snowball out of control), he is probably one of the most balanced ADC's i've seen Riot make in a long time. I do agree that some of the other marksmans need loving too, but nerfing others down from where they stand instead of buffing the cast doesn't really help, it basically just makes the champion next to useless depending on the severity (COUGH {{champion:6}} ). As an ADC main, I feel that buffing some of the weaker ADC's is all you really need to do. There isn't a need to nerf down people who aren't in need of a nerf.","replies":[]},{"poster":"Shineblow","date":"2014-06-05T11:42:53.976+0000","up_votes":8,"down_votes":0,"body":"Check {{champion:81}} pls. He needs some love, especially his W. And yeah, decide {{champion:133}}'s  role. I think adc would be nice :>","replies":[]},{"poster":"Hellioning","date":"2014-06-05T04:41:51.715+0000","up_votes":4,"down_votes":3,"body":"Any love for Koggles? I feel that his 'late game hyper carry' potential is being overshadowed by Vayne, who also has absurd late game damage plus an easier time of avoiding death via Assassin in exchange for a lower range (at 'death by assassin' is a lot more dangerous than 'can't get in range') and Jinx, who is simply absurd and has too much on her kit. Does Riot agree with this assessment?","replies":[{"poster":"Aspect Draconis","date":"2014-06-05T05:50:35.344+0000","up_votes":8,"down_votes":0,"body":"Kog is like a priority pick in Korea atm along with Lucian/Twitch - if they buff him even a bit now, he'll have to be nerfed back 1-2 patches after that as he'll definitely become meta even in other regions.","replies":[{"poster":"Hellioning","date":"2014-06-05T06:01:28.540+0000","up_votes":4,"down_votes":0,"body":"Really? Interesting, never heard of that. Don't really pay attention to the pro scene, though.","replies":[]}]}]},{"poster":"xdxAngeloxbx","date":"2014-06-05T10:25:17.404+0000","up_votes":7,"down_votes":0,"body":"Quinn is my favourite champion. What does Riot think about her? Should Quinn be an adc or toplane? She has a lot of bugs (Harrier proc) and her range is really low... please answer:) would love to hear your thoughts","replies":[]},{"poster":"w4est","date":"2014-06-05T05:09:57.265+0000","up_votes":10,"down_votes":3,"body":"Would it be possible to look at ashe's passive?\nI feel that it is completely overshadowed late game, is only used <5 times early game, and caitlyn's passive does a better job in all terms of crits.\n\nCould you make it so ashe gets 5%-15% crit against targets that are slowed? (So her second auto after slowing would have a increased crit?)\n\nOr how about a 2%-5% increased damage to slowed targets? \n\nHer current passive just doesn't fit thematically either, (other then her husbando tryndamere crits, but he's angry and undying with rage)\n\nPlease don't forget about everyone's iconic first marksman!","replies":[]},{"poster":"The Great Crora","date":"2014-06-05T11:19:52.080+0000","up_votes":8,"down_votes":2,"body":"Riot, this is a pointless not Pro-Player post but i want to try to undestand Riot logic on balance changes.\n\n{{champion:29}} like {{champion:96}} was not too much played in competitive (NA/EU i don't follow other region).\n\nYou didn't change him.\n\nBut now you are trying to tell to the community that a low pick rate champ like he was secretely got buffed as hell and now he deseves a buff.\n\nRiot maybe you should think on the recent changes you did to the game..\n\n1. oracle? GET OUT OF HERE.\n2. pinks? pff you can see them.\n3. heal? wow i have ghost and heal in one summoner yeeeeeee\n4. armor(RUNES)? WHO NEEDS THAT SH*T\n\nNow Riot, as istated before this is apointless post, but nerfing {{champion:29}}  is just an endless circle, you nerf him and you have lucian {{champion:96}} every game.\nIt's just the META not the actual strenght of the champion. \n\n\n\nThis was what a non professional player thought i'm not spreading hate, i just wanted to tell my opinion on your radar that needs repair. :D\n\n\nNow talking about {{champion:29}} ! his VU destroyed one of the best feature his aspect had! the black cond0m he had on his nose was filled of std and now the plague rat lost all his disease! PLEASE BRING BACK ALL HIS POWER! cover his nose again XD","replies":[]},{"poster":"Jesus is Savior","date":"2014-06-05T10:18:37.253+0000","up_votes":9,"down_votes":3,"body":"Twitch is NOT over powered. Want to know why he rose in popularity? You gave expunge a range indicator. That's it. That's the ONLY thing that increased his power. He can now assassinate you when you're at the edge of the range, instead of going \"oh crap, out of range... Oh well\" like old Twitch.\n\nHe's basically less clunky and easier to play. You don't need 300+ games with him to be good anymore. But go ahead, ruin him. You already ruined the entire jungle. 75 upvotes and 10 pages later (and an email to Morello), and still no response: http://forums.na.leagueoflegends.com/board/showthread.php?t=4573173","replies":[]},{"poster":"Riot Wav3Break","date":"2014-06-07T00:12:30.739+0000","up_votes":4,"down_votes":3,"body":"Hey guys, I just want to clarify some of our views on sensitive/gray area champions like Quinn and Urgot since there is a lot of lively discussion. Currently, we don't necessarily see these two champions fitting into the traditional marksman role and thus 4.10 will not have specific changes reflecting them. The scope of 4.10 has us incredibly focused on improving the health of traditional marksman role and we plan to deliver our best work regarding that focus. Discussion is always valuable to us though and we are grateful for all the feedback you guys provide us.","replies":[]}]}