{"poster":"Swiffs","date":"2016-12-10T02:21:06.717+0000","title":"SHIT FUCKEN TEAMS","subforum":"Player Behaviour","up_votes":2,"down_votes":8,"body":"I HAVE FUCKEN PLAYED 5 PROMO GAMES SO FAR THIS SEASON AND IVE HAD 3 GAMES WITH 1 person feeding and 1 deciding to leave or afk, IM FUCKEN SICK OF IT HOLY SHIT RIOT FUCKEN PUT ME IN GAMES WITH PEOPLE WHO ARE RELIABLE OTHERWISE IM FUCKEN DONE HOLY FUCK{{summoner:12}}","replies":[{"poster":"Roguestoney","date":"2016-12-10T02:24:14.222+0000","up_votes":3,"down_votes":0,"body":"Nah git gud scrubadub.","replies":[]},{"poster":"nochillgamer","date":"2016-12-10T02:28:49.133+0000","up_votes":1,"down_votes":0,"body":"Get Good #koreanadvice","replies":[{"poster":"FerrousOxide","date":"2016-12-10T05:04:35.712+0000","up_votes":1,"down_votes":0,"body":"There is only so good you can get. I win lane most matchs and roam to help other lanes all the time. Sone teams you cant carry. End of the day uts 5v5 and if the other 4 let you down its very frustraing.\nAnd not every champ can stop a 3 to 5 man pish when thier team is spread across the map and wont group.","replies":[{"poster":"Tele","date":"2016-12-10T05:24:41.260+0000","up_votes":2,"down_votes":1,"body":"I hope you're not implying that you're as good as you can get right now ;)\n\nYou might have peaked in skill with the amount of work you're doing, but if you analyse your games, read up on strong strategies, and consistently watch educational content you'll really start to climb. Maybe even coaching can be an option if you're really in a rut.","replies":[{"poster":"FerrousOxide","date":"2016-12-10T05:33:33.744+0000","up_votes":2,"down_votes":0,"body":"I have said before on the boards im have miles of improvment to make. I always strive to improve my game.  But at the same time in bronze i am good enought to win lane a lot more than i lose it. It takes a hard jng camp to stop me winning lane these days. But im not good enought to carry a whole team. It feel that to rank up you dont just have to be better than your peers you have to be 5 v 1  better.","replies":[{"poster":"Tele","date":"2016-12-10T09:54:48.788+0000","up_votes":2,"down_votes":0,"body":"Hmmm, sounds like you might be baiting your team and throwing somehow. Here's I'd recommend you do:\n\n\n\n+ Find a game where you are 100% sure you did nothing wrong but still lost anyway (no games with AFKs or intentional feeders though). Record it on the new client or use [Replay.gg](http://www.replay.gg/). \n\n Link it here with @Yaia in the title or @Maraudaur (I'll make sure they see it). They'll be able to give you a really nice starting point on what's going wrong AFTER you win lane.\n\nIt's going to take a good amount of effort to climb, but at lower elos you're guaranteed results. Probably 95% of players in Bronze 5 don't review games at all or get high elo advice.","replies":[{"poster":"FerrousOxide","date":"2016-12-10T10:16:47.210+0000","up_votes":1,"down_votes":0,"body":"Cool thanks. When i played starcraft (Dimond) i used to reveiw replays of losses all the time. But that was always 1v1. When i first picked up leage i lemented the lack of a replay function. Not sure i havent used it yet.","replies":[{"poster":"Tele","date":"2016-12-10T11:25:27.941+0000","up_votes":2,"down_votes":0,"body":"Yeah can't blame you there. The lack of a replay system for so long was really bad for players looking to improve :(","replies":[]}]}]}]}]}]}]},{"poster":"Fitzky","date":"2016-12-10T06:47:40.547+0000","up_votes":2,"down_votes":1,"body":"Where's the delete button to remove posts like these?","replies":[]},{"poster":"Cakemeisting","date":"2016-12-10T11:59:35.196+0000","up_votes":1,"down_votes":0,"body":"Don't worry, Swiffs, it's just going to take some time for the jackers to hit the bottem of the barrel in the ranking orders. I went 2-13 in my first fifteen games in flex queue ranked (now i'm 4-16), and every game was an absolute clown fiesta. It's probably because everyone is being placed lower than they were last season.  I have a rule at the end of each season to not play solo queue until the middle of the year when there are no school holidays on, and when people have settled down into correct divisions. Also last season didn't help sorting our true rankings, there are a zillion boosted bonobos out there.\n\nTLDR; If you're good enough, you will climb back up. Don't sweat it.","replies":[]}]}