{"poster":"Aleguapo","date":"2016-05-29T15:53:43.936+0000","title":"assistenza","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"salve a tutti,volevo chiedere se è possibile parlare con qualche responsabile in privato per questioni lavorative,se possibile vi prego di contattarmi in pvt per uno scambio di e-mail dove poter discutere visto che non posso controllare spesso il forum per questioni di lavoro.\r\nspero in una vostra risposta,grazie.","replies":[{"poster":"BeardSergio","date":"2016-05-30T07:31:08.744+0000","up_votes":2,"down_votes":0,"body":"non credo che si possa. Magari se spieghi di cosa hai bisogno riusciamo ad indirizzarti verso i canali corretti","replies":[]},{"poster":"mannij","date":"2019-12-19T20:25:45.913+0000","up_votes":1,"down_votes":0,"body":"Vorrei sapere cosa devo fare per far sì che mi si sblocchi lol. Dinamica: al termine di una partita mi dava la schermata di lol con la scritta riconnettiti al posto degli honor. E da 2 ore a questa parte appena riavvio il PC e di conseguenza lol mi da schermata nera e mi da due notifiche con scritto critical error... Non so cosa fare. Vorrei una risposta il prima possibile. Grazie","replies":[]},{"poster":"Aleguapo","date":"2016-05-31T13:51:54.409+0000","up_votes":1,"down_votes":0,"body":"per cercare d farla breve,vorrei proporre un programma mio e di soci ancora in fase di sviluppo alla riot,dato che riteniamo possa portare un notevole aumento dei giocatori e anche guadagni. controllerò a breve i vostri link sperando di trovare qualcuno di competenza a questo settore per ulteriori consultazioni,in ogni caso vi ringrazio del vostro aiuto e se riuscite ad aiutarmi ulteriormente ve ne sarei grato.\n\nAleguapo","replies":[{"poster":"Floppyz","date":"2016-05-31T14:03:48.796+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Aleguapo,realm=EUW,application-id=98NGV4Al,discussion-id=ps9l3bct,comment-id=0003,timestamp=2016-05-31T13:51:54.409+0000)\n>\n> per cercare d farla breve,vorrei proporre un programma mio e di soci ancora in fase di sviluppo alla riot,dato che riteniamo possa portare un notevole aumento dei giocatori e anche guadagni. controllerò a breve i vostri link sperando di trovare qualcuno di competenza a questo settore per ulteriori consultazioni,in ogni caso vi ringrazio del vostro aiuto e se riuscite ad aiutarmi ulteriormente ve ne sarei grato.\n> \n> Aleguapo\n\n'Mmazza... credo avresti fatto prima a pigiare il link che ti ho dato anziché scrivere questo post...\n\nComunque:\n\n>If you've got an awesome idea for a skin, champion or how to improve League of Legends, the best place for these is http://boards.na.leagueoflegends.com/. We do read the forums and pay attention to the ideas that players share with us there. \n\n>For a bunch of reasons, we can't accept submissions for skin or champion concepts, but we've noticed that many summoners love coming up with concepts so we created this forum where you can post and share these ideas. If you post here, you'll get others' feedback on your concept.\n\n>Please note that this forum's purpose isn't to help Riot find the newest champion of the League. Rather, we want to give you a platform to express your creativity.\n\nAltrimenti info@riotgames.com\nAltrimenti apri un ticket.","replies":[]}]},{"poster":"GoDzFebi","date":"2016-05-30T09:30:52.898+0000","up_votes":1,"down_votes":0,"body":"Questo è il forum per problemi in gioco o relativi al funzionamento del GIOCO. Per lavorare nella riot puoi cliccare su questo link: http://www.riotgames.com/careers\nBuona fortuna comunque xD\nJacobozz","replies":[]},{"poster":"Floppyz","date":"2016-05-30T08:00:10.235+0000","up_votes":1,"down_votes":0,"body":"Se vuoi lavorare in Riot: http://www.riotgames.com/careers\nContatti: http://www.riotgames.com/contact","replies":[]}]}