{"poster":"RahiKed DraGneeL","date":"2017-05-28T11:40:26.457+0000","title":"Ma dopo l update dei 10 ban si vedrà più Yasuo in ranked?","subforum":"Discussioni generali","up_votes":10,"down_votes":1,"body":"Do un abbraccio di conforto a tutti i main, mi dispiace un mucchio lol","replies":[{"poster":"DuffyD1ck69","date":"2017-05-28T12:17:26.647+0000","up_votes":5,"down_votes":1,"body":"Chissà perchè in ogni patch , in ogni meta , è sempre bannato,chissà....","replies":[{"poster":"Master Caos98","date":"2017-05-28T12:31:25.209+0000","up_votes":5,"down_votes":11,"body":"> [{quoted}](name=DuffyD1ck69,realm=EUNE,application-id=MJVj50Jw,discussion-id=9atQ9otz,comment-id=0002,timestamp=2017-05-28T12:17:26.647+0000)\n>\n> Chissà perchè in ogni patch , in ogni meta , è sempre bannato,chissà....\n\nPerchè la gente è scarsa","replies":[{"poster":"HaIIeIujah","date":"2017-05-28T12:55:50.423+0000","up_votes":15,"down_votes":0,"body":"Perché è un campione giocato da troppe persone, con una playerbase ultra tossica, frustrante da avere contro anche quando è indietro ,rischioso da lasciare aperto nel caso trovi lo sappia e rischioso da avere in team perché una gran percentuale degli yasuo sono spazzatura.","replies":[{"poster":"Master Caos98","date":"2017-05-28T13:22:28.533+0000","up_votes":1,"down_votes":13,"body":"> [{quoted}](name=Ø Tera Ø,realm=EUW,application-id=MJVj50Jw,discussion-id=9atQ9otz,comment-id=000200000000,timestamp=2017-05-28T12:55:50.423+0000)\n>\n> Perché è un campione giocato da troppe persone, con una playerbase ultra tossica, frustrante da avere contro anche quando è indietro ,rischioso da lasciare aperto nel caso trovi lo sappia e rischioso da avere in team perché una gran percentuale degli yasuo sono spazzatura.\n\nNo non centra niente,la gente non sa giocarci contro,appena vede che è contro yasuo va in panico non ragionando,e ogni volta che muoiono incolpano yasuo perchè ormai è di moda dire che yasuo è troppo forte o va nerfato.\n\nSenza contare che se yasuo fa un solo errore in early non fa piú niente per i prossimi 20 minuti.","replies":[{"poster":"HaIIeIujah","date":"2017-05-28T13:32:40.540+0000","up_votes":10,"down_votes":0,"body":"Esattamente, quale delle cose che ho detto \"non c'entra niente\"?\n\n* Il fatto che è giocato da troppe persone? Nel complesso e considerando il low elo, è il 10 più pickato. \n* Che ha una playerbase ultra tossica? Condivide molti gicoatori con Riven, che ha la più grande percentuale di afkers per campione.\n* Che è frustrante da avere contro anche quando indietro? La sua alta mobility e il windwall lo rendono fastidioso da colpire per parecchi campioni con la sua abilità di annula certi skillshot.\n* Che è pericoloso se un avversario lo sa usare correttamente? Yasuo ha uno dei più alti potenziali di outplay del gioco ed un carry role, quindi è naturale che un giocatore esperto possa usarlo al massimo. Viceversa, dato che è \"difficile\" da giocare correttamente, ha anche un numero stupido di giocatori incompetenti (più alta media di morti a partita).","replies":[{"poster":"Master Caos98","date":"2017-05-28T14:39:35.484+0000","up_votes":2,"down_votes":10,"body":"Non é assolutamente questo il vero motivo per cui bannano tutti yasuo,ti basta guardare il forum,anche se lo stanno nerfando ci sara sempre qualcuno che si lamenterà che é troppo forte perchè appunto va di moda,come va di moda usare lee sin.","replies":[{"poster":"HaIIeIujah","date":"2017-05-28T14:40:43.310+0000","up_votes":5,"down_votes":0,"body":"Aight, quindi hai semplicemente deciso di ignorare tutto quello che ho scritto, perfetto.","replies":[{"poster":"Master Caos98","date":"2017-05-28T15:02:19.758+0000","up_votes":1,"down_votes":10,"body":"Non l'ho ignorato,ho detto che non sono questi i motivi per cui bannano tutti yasuo.","replies":[{"poster":"Sgalgarath","date":"2017-05-28T17:30:42.889+0000","up_votes":2,"down_votes":3,"body":"Di motivi ce ne sono fin troppi, in draft cè gente superficiale che banna Yasuo,Zed,Katarina o Yi perchè sono i champ + commerciali e che sà che se non ne banna almeno uno se lo ritroverà contro.Poi c'è il nabbo di turno che entra in select non sà chi bannare e quindi chi banna?yasuo ovviamente (succede spesso in rotazione);poi non tutti bannano Yasuo per non essere counterati in champ select(almeno in bronzo non lo fà nessuno),e succede che I bronzi che ci giocano contro non riescono a counterarlo e quindi basso elo vince.E quando invece viene pickato da un GLD o + con le mani? fà il macello,perchè nessuno lo regge,e quindi alto elo?Broken lo stesso ma più facilmente counterabile per chi lo conosce;Questi sono i fatti.Alcuni motivi oltretutto sono quelli che ha detto tera... Insomma,alla fine ognuno ha i suoi.La mia opinione riguardo alla questione e il vero motivo per cui dovrebbe essere bannato sempre dalle draft è che Yasuo è un champ cancerogeno,paragonabile all epatite e potenzialmente in grado di carriare un game da solo che siccome lol è un gioco di squadra,chi ha un minimo di cervello non accetta di perdere per colpa di qualche morboso.","replies":[{"poster":"Master Caos98","date":"2017-05-28T18:01:52.191+0000","up_votes":3,"down_votes":1,"body":"Se è cosi op come dici giocalo è arriva a challenger.","replies":[{"poster":"Harkrade","date":"2017-05-29T11:34:24.953+0000","up_votes":2,"down_votes":1,"body":"Ma lasciali stare, se ci fai caso sono tutti bronzi quelli che si lamentano (non voglio offendere nessuno ma la vostra conoscenza del gioco è davvero poca cosa).\n\nBasta un semplice exhaust e il problema non si pone","replies":[{"poster":"Darkinknight","date":"2017-05-29T12:57:07.850+0000","up_votes":2,"down_votes":0,"body":"Io sono plat (da solo) e lo banno da quando sto in silver.\nAnche tera che non so se lo banna ma ha esposto le sue ragioni è diamond.\nChe sia odiato e bannato solo in low elo è una leggenda","replies":[{"poster":"Don Draven","date":"2017-05-29T15:24:07.886+0000","up_votes":1,"down_votes":0,"body":"Io purtroppo dal nerf di shaco sono droppato in malomodo da p3 a gold 4-2(soprattutto perchè non potendo giocare il mio champ talvolta,giocai a scazzo), posso dire che in gold trovi talvolta yasuo marci come i gp e le riven,già a metà plat però puoi trovare gente che questi campioni li sa usare in maniera decente se li aiuti un poco e posso dire che:\n\n-Sono ultratossici quasi tutti (e non esagero) quelli che lo giocano,soprattutto in gold,che fanno schifo e non voglio ammetterlo.\n-Il champ di per sè sa essere davvero sbagliato soprattutto in mani giuste,così come hanno squartato il mio shaco immagino sia giusto squartare yasuo,appunto anche perchè a larga parte della community non piace...","replies":[{"poster":"Darkinknight","date":"2017-05-29T15:55:07.379+0000","up_votes":3,"down_votes":0,"body":"Ma a me che yasuo sia efficace in mani giuste non dispiace affatto,anzi è giusto cosi.\nMa sinergizza talmente tanto con le maestrie,e la {{item:3046}} per cio che gli da a lui dovrebbe costare minimo il doppio,che diventa cancerogeno e una rottura da affrontare anche quando dall'altra parte c'è uno che tira i pugni alla tastiera nel momento in cui ha buildato phantom e gladio. E per l'enorme powerspike che ha,anche in lane non se la cava cosi male,oltre che averlo 5/0 o 0/10 fatti quei 2 item non cambia quasi nulla. Una qualsiasi fiora,riven o simili sono molto forti,e si riprendono con l'avanzare del game anche rimanendo indietro,ma a un ritmo molto piu lento rispetto a uno yasuo","replies":[]}]}]}]}]}]},{"poster":"Blehic","date":"2017-05-28T17:23:25.243+0000","up_votes":2,"down_votes":1,"body":"Puoi dire quello che ti pare ma Tera ha ragione.\nNon si parla solo dei nabbi che non sanno giocarci contro, ma anche del potenziale troppo alto che ha il champion e per via che sia così difficile ma così popolare che quelli che lo giocano bene hanno troppi vantaggi e quelli che lo giocano male feeddano sempre in tutti i game che lo usano.\nTe hai detto che va di moda, ed è esatto ma lo è proprio perché se usato da un giocatore esperto è troppo forte e ha vantaggi che altri champ se li sognano e quindi la gente vedendo che i pro o gente brava in generale ci fa outplay e giocate in cui carryano pensano che sia facile e quindi lo pickano senza neanche colpire i nemici di Q ( sia ravvicinata che tornado ). \nOltre alla gente tossica, come ha detto Tera.\nChe poi \" Lo stanno nerfando \" mi ricordo il grande annuncio di nerf a Yasuo e della gente che ringraziava dio per aver raccolto le loro preghiere e poi hanno cambiato i danni della E aggiungendo uno scaling ad, rimane comunque un nerf al suo early per farmare e i danni su champ, ma i problemi più grandi persistono:\n-Passiva, doppia probabilità di crit con una riduzione ridicola si dica quel che si vuole ma finire 2 oggetti e avere 100% di crit a livelli bassi  è troppo comodo considerando che 10% è una riduzione troppo bassa e io la fare scalare  dai primi livelli come più alta  e in late lasciarla al 15-20% mentre in early 30-35% circa, in modo che possa essere ancora un carry da late, lo scudo mi può andare bene ma dovrebbe o avere un cd al posto di ricaricarlo muovendosi o eseguire una azione più diretta allo scontro per attivarlo, ma non saprei cosa quindi potrei lasciarlo anche com'è attualmente se fossi io a decidere come cambiarlo, se mai accadrà visto che la riot non vuole far cadere nel baratro del nerf uno dei champ più popolari del gioco ( sigh...Azir....)\n- la Q, va bene com'è attualmente secondo il mio modesto parere, fa il suo lavoro e da l'unico cc che serve per utilizzare l'ulti.\n-Windwall che appena lanciato parte dalla hitbox di Yasuo e viene attivato proprio dal centro della sua hitbox, ovvero se una nidalee ti lancia una spear alle spalle ma te attivi il windwall dal lato opposto ma al momento giusto riesci comunque a distruggere lo skillshot e annullare i danni in arrivo. Quando è attivo funziona in ogni direzione a prescindere dalla posizione di lancio quindi equivale a un vantaggio tattico spaventoso contro tiratori o mage o il 90% delle skill a distanza.\n-La E, dash continui con cd inesistente dell'abilità e cd su un unità su cui hai dashato da poco, questo lo rende fastidioso in lane come pochi champ e gli permette di spostarsi per allontanarsi dal nemico, avvicinarsi o semplicemente ricaricare il suo scudo ma come abilità alla fine non è che la trovi così forte, sopratutto dopo il nerf, molto utile si ma è counterabile a modo suo, nonostante altri champ devono aspettare anni prima di usare nuovamente il loro dash ma è questione di kit differenti.\n-La R, beh...a me sembra giusta come abilità, magari che gli ridia subito lo scudo mi sembra una cagata ma in generale fa il suo lavoro e il nemico deve essere knockuppato per essere bersaglio di questa abilità.\n\nTi pregherei di leggere e non ignorare il contenuto qua sopra, anche se temo succeda vedendo come ti sei approcciato a Tera, nel caso succeda darai dimostrazione che sei uno di quei giocatori che piuttosto che ammettere che il proprio main ha parti sbilanciate da a tutti degli idioti e si tappa le orecchie, in quel caso avrò scritto per niente e pazienza.","replies":[{"poster":"Master Caos98","date":"2017-05-28T18:00:47.190+0000","up_votes":3,"down_votes":6,"body":"Abbiamo opinioni completamente diverse da quanto vedo,io non ho mai avuto problemi contro yasuo,sia in top che in mid lane.\n\nInvece di fare post o commenti sul forum a dire che è troppo forte provate a fare un passo indietro è imparare a counterarlo.\n\nNon so dove hai letto che ho dato dell'idiota a tutti,visto che ho espresso semplicemente quello che penso,se è risultato offensivo mi scuso ma la mia opinione rimane tale.\n\nP.s:Non sono un main yasuo.","replies":[{"poster":"Darkinknight","date":"2017-05-28T18:27:05.923+0000","up_votes":2,"down_votes":1,"body":"1-Avere un opinione e non essere offensivo =/= da sono tutti scarsi quelli che non la pensano come me.\n2- non mi sembra questo sia un post aperto per lamentarsi dell'oppaggine di yasuo\n3- immagino che anche tu consideri 1 o piu champ sopra le righe e da nerfare..beh in quel caso sei scarso e dovresti fare un passo indietro e imparare a counterarlo,perche ci sara qualcuno che invece non ha difficolta verso quel champ\n","replies":[{"poster":"Master Caos98","date":"2017-05-28T20:11:09.262+0000","up_votes":1,"down_votes":4,"body":"Dire che sei scarso non è un offesa...","replies":[{"poster":"JRobich","date":"2017-05-29T11:36:27.622+0000","up_votes":1,"down_votes":0,"body":"troviamo una ludoteca dove giocano a League of legend e rimani li tutta la sera a dire alle persone che giocano \"lo sai che sei scarso\"...\n\nscommettiamo che esci da li truccato come un panda?\n\ntanto che hai da perdere? visto che \"sei scarso\" non è un offesa nessuno se la prenderà giusto?","replies":[{"poster":"JRobich","date":"2017-05-30T11:25:34.915+0000","up_votes":2,"down_votes":0,"body":"mi arrendo....\n\nnon c'è peggior sordo di chi non vuol sentire....\n\nspero che tu mi stia prendendo in giro facendo finta di non voler capire... se non è cosi allora è grave veramente grave.... anche valutando la tua giovane età...","replies":[]},{"poster":"JRobich","date":"2017-05-30T10:51:26.749+0000","up_votes":2,"down_votes":0,"body":"sono contento per te che hai 15... è l'eta che dimostri quando scrivi ed è giusto che sia cosi...\n\nnon hai capito il centro del problema qual è: ti ostini a dire che se a una persona dai dello scarso nn lo stai offendendo e questo è sbagliato...\n\nle mie provocazione ad offenderti con \"ignorante\" \"bambino\" e \"scarso\" erano solo dette per farti capire che anche se cerchi una parola sul vocabolario e non c'è scritto che è un offesa questo non significa che non lo sia... capisci cosa voglio dire?","replies":[]},{"poster":"JRobich","date":"2017-05-30T08:25:49.603+0000","up_votes":2,"down_votes":0,"body":"sei del 98?","replies":[]},{"poster":"lich Roland","date":"2017-05-30T13:53:47.030+0000","up_votes":1,"down_votes":0,"body":"Se continui cosi non andrai lontano nella vita,se dici a uno che è scarso lo sta negando come giocatore o altro mentre se dici ''hai delle mancanze'' è già molto meglio ed essere in paese con libertà d'espressione non ti giustifica nel parlare in modo merdoso","replies":[]},{"poster":"Master Caos98","date":"2017-05-30T11:30:58.538+0000","up_votes":1,"down_votes":0,"body":"Mi sa che é meglio così visto che la discussione é degenerata.\n","replies":[]},{"poster":"Master Caos98","date":"2017-05-30T11:16:32.093+0000","up_votes":1,"down_votes":0,"body":"Capisco,ma questo secondo te,ció che offende è soggettivo ed è determinato dalla sensibilità della persona,ció che offende a te puó non offendere a me,ma c'è differenza tra un offesa o descrivere il grado di abilità di una persona in un gioco,se io guardo una persona che gioca e noto che non è molto forte e ci  dico che è scarso non è un offesa,visto che ho usato la parola scarso per descrivere il livello di abilità di quella persona.\n\nComunque avevo già chiesto scusa in un commento e lo dico di nuovo,ma la mia opinione rimane tale chi non sa come affrontare yasuo.","replies":[]},{"poster":"JRobich","date":"2017-05-30T09:54:57.736+0000","up_votes":1,"down_votes":0,"body":"spero che ne abbia di meno... vista la strafottenza che mostra nello scrivere spero che nella vita non sia veramente cosi... altrimenti i schiaffoni che prenderà saranno troppi....\n\nil non ammettere di aver sbagliato a parlare offendendo qualcuno non è essere coerenti è essere ignorante....","replies":[]},{"poster":"Sigmamoner","date":"2017-05-30T09:47:11.301+0000","up_votes":1,"down_votes":0,"body":"Ero basito anch'io all'idea che una persona di 19 anni potesse ragionare in questo modo...\n\nIn effetti, questo spiega molto.","replies":[]},{"poster":"JRobich","date":"2017-05-30T09:24:01.335+0000","up_votes":1,"down_votes":0,"body":"ok non ha senso continuare a parlare con un bambino ignorante che va avanti per la sua strada anche se 50 persone non la pensano come lui...\n\nbambino non è un offesa\nignorante neanche....","replies":[]},{"poster":"Master Caos98","date":"2017-05-30T09:18:04.444+0000","up_votes":1,"down_votes":0,"body":"No,puoi anche andare a cercare su internet la definizione di scarso ed ignorante.","replies":[]},{"poster":"JRobich","date":"2017-05-30T09:10:27.463+0000","up_votes":1,"down_votes":0,"body":"volevo capire se la tua ignoranza e il tuo essere scarso nelle argomentazioni derivava dalla tua giovane età..\n\nignorante e scarso non sono offese giusto?","replies":[]},{"poster":"Master Caos98","date":"2017-05-30T08:58:41.750+0000","up_votes":1,"down_votes":0,"body":"No,ma non capisco cosa centra la mia data di nascita.","replies":[]},{"poster":"Master Caos98","date":"2017-05-30T08:17:15.308+0000","up_votes":1,"down_votes":0,"body":"Non è un offesa,significa che   hai poca conoscenza del gioco.","replies":[]},{"poster":"JRobich","date":"2017-05-29T13:04:47.650+0000","up_votes":1,"down_votes":0,"body":"ovvio che c'è libertà di espressione, come c'è una cosa chiamata \"rispetto\" mai sentito?\n\nti ricordo una legge fisica:\n\n> La terza legge della dinamica, o principio di azione e reazione, stabilisce che a ogni azione corrisponde una reazione uguale e contraria.\n\nla stessa cosa vale nella vita... se offendo la tua donna e tu mi dai un pugno in piena faccia, non vado dalla polizia a piangere, me lo tengo e penso \"se non offendevo la donna non prendevo un pugno sul muso...\"\n\ncmq ti consiglio di rivedere l'uso della lingua italiana... dire a qualcuno \"sei scarso\" è offensivo... se non capisci questo conviene che non continuiamo proprio a parlarne...","replies":[]},{"poster":"Master Caos98","date":"2017-05-30T10:34:13.126+0000","up_votes":1,"down_votes":1,"body":"Se ti fa sentire meglio ho 15 anni.\n\nSecondo e me sei tu il bambino che se la prende perchè uno sconosciuto online ci ha detto che è scarso,se agisci con violenza dimostri di essere un immaturo e non importa quanti anni hai.","replies":[]},{"poster":"Master Caos98","date":"2017-05-30T09:36:42.426+0000","up_votes":1,"down_votes":1,"body":"No,stai tranquillo che non mi offendo,visto che conosco me stesso e so se sono bambino o no.\nE comunque originariamente mi riferivo alle persone che non sapevano giocare contro yasuo.\n\nOffesa o no non m'importa.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Eye of Kraken","date":"2017-05-29T05:41:03.523+0000","up_votes":1,"down_votes":0,"body":"Tera ma gli upvotes sono delle persone che boosti? xd","replies":[{"poster":"HaIIeIujah","date":"2017-05-29T05:45:58.968+0000","up_votes":3,"down_votes":1,"body":"No, sono gli upvote della confraternita ovviamente.\n\nAggiungo, se boostassi 12 persone ai ratei da mercato avrei usato i soldi per sbronzarmi, non per upvote sul forum.","replies":[]}]},{"poster":"Dissociated","date":"2017-05-28T16:16:39.426+0000","up_votes":1,"down_votes":0,"body":"mi ritrovo con tutto quello che hai scritto. per me è un must ban in ogni partita perché a prescindere dall' abilità del giocatore se inizia a spammare la dash diventa imprendibile con la maggior parte degli skillshot. bho, mi tilta ogni volta che lo incontro.\n\npoi gioco da parecchio e mi sono goduto al rilascio quando aveva uno scudo infinito, quando faceva la statik primo item e ti stuprava, quando lo facevano tank e faceva 1v5, quando la keystone della lifesteal era 20% in base alla vita mancante e con la bloodthirster si rifullava ogni colpo, quando ora builda qualsiasi cosa e i suoi danni diventano stupidi. \n\nnon credo che sia sano che un champ venga disegnato per dover essere combattuto da almeno 3 persone con cc e danni. inoltre la dash è tossica perché fa missare 4/5 degli skillshot come effetto collaterale: teemo ha una sagoma molto piccola APPOSTA per essere difficile da prendere ma sta a te spostarti, yasuo clicka a caso e diventa difficilissimo da prendere. \n\ninoltre l' hitbox del windwall e la dash creano momenti in cui non sai cosa dove come perché i tuoi colpi non colpiscono.\n\nbtw, che il muro di vento funzioni in tutte e 4 le direzioni è completamente ritardato: fatelo pure largo tutta l  mappa ma se sbaglia a posizionarlo voglio almeno che gli skillshot passino. altrimenti è esattamente come la prima q di ryze o il kit di yorik in origine o la r di syndra: non interattivo, \"spara e dimentica\"","replies":[]},{"poster":"Fengucc","date":"2017-05-28T15:26:13.302+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ø Tera Ø,realm=EUW,application-id=MJVj50Jw,discussion-id=9atQ9otz,comment-id=00020000000000000000,timestamp=2017-05-28T13:32:40.540+0000)\n>\n> Esattamente, quale delle cose che ho detto &quot;non c&#x27;entra niente&quot;?\n> \n> * Il fatto che è giocato da troppe persone? Nel complesso e considerando il low elo, è il 10 più pickato. \n> * Che ha una playerbase ultra tossica? Condivide molti gicoatori con Riven, che ha la più grande percentuale di afkers per campione.\n> * Che è frustrante da avere contro anche quando indietro? La sua alta mobility e il windwall lo rendono fastidioso da colpire per parecchi campioni con la sua abilità di annula certi skillshot.\n> * Che è pericoloso se un avversario lo sa usare correttamente? Yasuo ha uno dei più alti potenziali di outplay del gioco ed un carry role, quindi è naturale che un giocatore esperto possa usarlo al massimo. Viceversa, dato che è &quot;difficile&quot; da giocare correttamente, ha anche un numero stupido di giocatori incompetenti (più alta media di morti a partita).\n\n\n\nTutto giusto, sopratutto per quanto riguarda le sue possibilità di outplay.","replies":[]}]},{"poster":"Ucr0niA","date":"2017-05-28T13:36:36.606+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Master Caos98,realm=EUW,application-id=MJVj50Jw,discussion-id=9atQ9otz,comment-id=0002000000000000,timestamp=2017-05-28T13:22:28.533+0000)\n>\n> Senza contare che se yasuo fa un solo errore in early non fa piú niente per i prossimi 20 minuti.\n\nMa di cosa stai parlando?\n\nBasta un campione alleato con un lift effect decente ( e ingame ce ne sono a decine) o un tornado piazzato bene su campioni nemici stupidamente gruppati, e come per magia ti basterà premere R, per avere la tua uccisione multipla.\n\nWow che lane phase decisiva.","replies":[]}]}]}]},{"poster":"ferter45","date":"2017-05-28T15:40:41.227+0000","up_votes":1,"down_votes":0,"body":"in realtà si sta utilizzando molto spesso fiora... anche se so main comunque...\nnell argento pero","replies":[]}]},{"poster":"NOLIMIT Vladimir","date":"2017-05-28T11:54:04.405+0000","up_votes":8,"down_votes":1,"body":"A me no","replies":[]},{"poster":"Demigod Summoner","date":"2017-05-30T10:00:42.387+0000","up_votes":2,"down_votes":0,"body":"Non so, io non lo banno mai... Per me i main ban saranno riversati su Jax o Fiora... Yasuo è un ban sprecato","replies":[]},{"poster":"Náos","date":"2017-05-28T11:59:22.029+0000","up_votes":2,"down_votes":0,"body":"Lo vedremo ancora, magari qualcuno nella due squadre mostrerà di volerlo giocare e gli altri 4 di ogni team supereranno di vederlo bannato dagli altri.\n\nPerché come dice il detto \"l'erba cattiva non muore mai\"","replies":[]},{"poster":"NicogenFTW","date":"2017-05-30T09:25:31.648+0000","up_votes":1,"down_votes":0,"body":"Poco ma sicuro non si vedrà più nei miei game :D\n\nL'unica cosa che mi dispiace di questo è che la blind pick adesso sarà ancora più invasa dagli angry yasuo mains, ed io purtroppo gioco molte più blind pick che draft :(","replies":[{"poster":"JRobich","date":"2017-05-30T09:30:18.257+0000","up_votes":1,"down_votes":0,"body":"io la blind non la gioco proprio per questo motivo su 100 game a 80 hai doppio yasuo nel game....\n\nuna cosa ridicola e poi sono la peggior specie di giocatori su lol... vanno 1 v 5 muoiono e flammano le altre persone...","replies":[]}]},{"poster":"ChaÎÎenger","date":"2017-05-29T21:24:17.488+0000","up_votes":1,"down_votes":0,"body":"Peggio degli Yasuo che credono di avere minima skill, sono quelli che giocano l'op del momento per scalare.\nOuch boi","replies":[]},{"poster":"Sorcio84","date":"2017-05-29T20:03:52.399+0000","up_votes":1,"down_votes":0,"body":"io ho gia i miei ban fissi\n{{champion:67}} uno dei champ più [parola bannata] del gioco. basti pensare che è nella top 10 dei champ con aspd più alta a lv18\n{{champion:107}} solo vederlo mi attacca le malattie","replies":[]},{"poster":"6GeMiNi9","date":"2017-05-29T11:20:16.397+0000","up_votes":1,"down_votes":0,"body":"Io da ADC banno sempre Zed nel mio ELO... non posso contare sul peel del support perchè è un terno al lotto. Anche stando safe, in un teamfight se vuole ti arriva in faccia in 02. \n\nYasuo anche quelli scarsi arrivano ad un certo punto che premendo tasti a caso ti massacrano.. fin'ora solo con Nocturne in 1on1 lo massacro la maggior parte delle volte..","replies":[]},{"poster":"RahiKed DraGneeL","date":"2017-05-29T07:50:51.249+0000","up_votes":1,"down_votes":0,"body":"Pensatela come volete, non ho aperto questa discussione per generare flame,  ma mo basta, questi paladini della giustizia che vanno a dire che si banna yasuo e ne parliamo sul forum perchè c e gente frustrata che non sa counterarlo, nah.... Qui non si parla di counterare o meno, qui si parla che un tipo che da 0 5 si fa due oggetti, si fa 100% critico roamma e si feeda penso che sia un offesa a tutta la gente che ha un po di skill e che sa veramente giocare, quello che non state a capire è che sono proprio i main yasuo che sono frustrati e sanno che se la riot riceve troppi feedback negativi e lo nerfa rimangono senza mani ma anche senza un champ da giocare, perchè si... E inutile girarci intorno, chi è main yasuo sa giocare solamente quello.","replies":[]}]}