{"poster":"JInky360","date":"2016-05-04T13:14:08.372+0000","title":"Problemi durante ranked","subforum":"Aiuto e supporto","up_votes":2,"down_votes":1,"body":"Mentre giocavo, il gioco mi dava uno strano lag. Credendo fosse la mia connessione, mi sono subito sincerato di avere tutto apposto, difatti, avevo 68 di ping come mio solito. Il problema &egrave; che dopo aver riavviato il client una volta, non &egrave; cambiato nulla anzi, &egrave; peggiorato.\r\nDopo un po addirittura ho riprovato a riavviare il client e non mi faceva loggare. Cosa che ho riscontrato anche nella chat di uno streamer dove tutti si lamentavano che non loggava e che il server dava problemi. \r\nOra mi ritrovo ad aver perso una partita e 20 lp circa,  per problemi di  server. Mi aspettavo quantomeno una loss prevented invece no. C&#039;&egrave; qualcosa che si pu&ograve; fare? Grazie.","replies":[{"poster":"SpideyPizza","date":"2016-05-04T13:14:42.079+0000","up_votes":1,"down_votes":0,"body":"guarda gli altri post precedenti :D","replies":[{"poster":"JInky360","date":"2016-05-04T13:31:15.972+0000","up_votes":2,"down_votes":0,"body":"Grazie ma a quanto pare la riot non risponde mai quando ci sono sti problemi. Anche per capire che cazzo è successo!","replies":[{"poster":"SpideyPizza","date":"2016-05-04T13:36:04.289+0000","up_votes":2,"down_votes":1,"body":"in questo caso ai server riot non e' successo nulla :)","replies":[{"poster":"JInky360","date":"2016-05-04T13:37:56.323+0000","up_votes":1,"down_votes":0,"body":"Quindi è stato un problema della telecom?","replies":[{"poster":"SpideyPizza","date":"2016-05-04T13:38:57.192+0000","up_votes":1,"down_votes":0,"body":"e di altri provider per alcuni minuti","replies":[]}]}]},{"poster":"Menfrix","date":"2016-05-04T13:36:42.043+0000","up_votes":1,"down_votes":1,"body":"Per esperienza personale quando sono problemi del server danno sempre Loss prevented, altrimenti vuol dire che ci sono/sono stati problemi con gli ISP tra Italia e server riot, non dipendenti da loro...","replies":[]}]}]},{"poster":"BeardSergio","date":"2016-05-04T14:11:21.874+0000","up_votes":1,"down_votes":0,"body":"Come già spiegato negli altri post si tratta di un problema momentaneo di instradamento delle chiamate.\nIl problema sembrerebbe non aver impattato solo Lol visto che anche altri siti non risultavano raggiungibili.","replies":[]}]}