{"poster":"Kingsking16","date":"2019-05-14T18:38:53.004+0000","title":"Gewschwindigkeit der Spiele","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Hallo liebe LoL Community und Dev's,\n\nIch habed mal eine Frage die mich seit den neusten Updates schon immer interessiert und mir nicht erklären kann.\n\n**Warum wurde, bzw macht ihr das Spielgeschehen schneller whyyyyyy??????**\n\nich meine es macht doch kein Sinn dass Spielgeschehen schneller zumachen, weil dadurch es einfacht toxischer ist für die Verlierer und eine Comeback Möglichkeit meines Betrachtens nicht existiert. \nMeine Hauptkritikpunkte an diesem Thema sind einfach,dass durch diese beschleunigung des Spieles einfach mehr Dmg pro CHampion und weniger tankiness auf den Gebäuden und Mobs sind. Warum?\n**Früher **LoL: **Strategiespiel** 5vs5 mit 2-3 **Tanks **(Top, Jngl, Supp) 2 **DmgDealer **(Mid, ADC)\n**Heute**LoL: **Komplette Clownfiesta** 5vs5 (naja meistens 2 nutzlos), 0 Tanks (außer vllt Supp) 4-5 DmgDealer welche alle **oneshot** austeilen\n\nWarum, meiner Meinung nach hat das heutige LoL in Normalgames als auch in Ranked Games nichts mehr mit einem Strategiespiel zusammen\n\nLG Kingsking16\nPs.: gerne auch upliken, damit man das Thema auch breiter diskutieren kann {{sticker:slayer-pantheon-thumbs}} ","replies":[{"poster":"Dontpickyasorint","date":"2019-05-16T03:02:28.727+0000","up_votes":1,"down_votes":0,"body":"Gerade  früher hatte man keine 2-3 tanks....\nFür dich scheint wohl gestern früher gewesen zu sein","replies":[]},{"poster":"Aymira","date":"2019-05-16T00:49:27.401+0000","up_votes":1,"down_votes":0,"body":"Ich mag die aktuelle Geschwindigkeit auch gar nicht. Durch diese Geschwindigkeit fehlt meiner Meinung nach in vielen Spielen die Balance. Wenige kleine Erfolge in einer Runde sorgen dafür das der Gegner wenig Zeit hat, sich noch wieder zu fangen. Ehe man sich versieht steht eine Linie schon am Nexus und man verliert das Spiel. \n\nFinde das ganze macht irgendwie nicht mehr den Spaß, den es früher gemacht hat. Ein Spiel zu verlieren und zu sagen „Hat trotzdem Spaß gemacht“ gibt es selten. \nUnd sollte ein Spiel mal länger als 25 oder 30 Minuten gehen, dann weiß ich schon gar nicht mehr was meine Aufgaben sind, weil man die Phase des Spiels gar nicht mehr erreicht. xD\n\nStimme da auf jeden Fall zu. Die Taktik geht verloren. Damals über den 3k Schaden in 0,2 Sekunden Rengar aufgeregt. Heute macht das irgendwie jeder, gefühlt. xD","replies":[]},{"poster":"Electrobert","date":"2019-05-15T10:00:36.165+0000","up_votes":1,"down_votes":0,"body":"Riot hat gesehen wie die kurzweiligen Batlleroyal Spiele durch die Decke gegangen sind und daraus den falschen Schluss gezogen, dass Lol auch schneller werden muss.\n\nJetzt dreht sich alles ums Early-Midgame. Es sind überall auf der Map skirmishes und laneprio ist **ALLES**(!)  um  Überzahlsituationen in genau diesen Scharmützeln erreichen zu können.\nDadurch wird das game eine absolute Fiesta,  hat man einige Male weniger \"glück\" in diesen skirmishes ist das game quasi verloren. \nDas Spiel ist snowballlastiger denn je, denn jetzt kann man zusätzlich zu einem kill noch mehr Gold über Platings generieren - Die Bountymechanik ist zwar eine nette Idee, kann aber selten wirklich genutzt werden, denn man ist ja behind.\n\nEine Vielzahl der Spiele ist bereits um die 10 minutenmarke entschieden, nicht unbedingt weil kein comeback möglich wäre, sondern vielmehr durch die mentale Instabilität der Spieler.\n\nViel zu häufig werden lanes nicht nur leicht verloren, oder droppen nur ein wenig behind, sondern werden direkt 0/9 dominiert, woran die o.g. Goldgenerierung einen maßgeblichen Anteil hat. Den Rest erledigt das Katastrophale Matchmaking, wo ich als Dia1 Spieler in ein Match mit Challenger 700lp Spielern geworfen und einfach nur nass gemacht werde.","replies":[{"poster":"Kingsking16","date":"2019-05-15T17:55:21.719+0000","up_votes":1,"down_votes":0,"body":"Ja aber des ist doch keine Lösung das Spielkonzept so stark zu ändern nur weil \"Battle-Royal Spiele\" grad gehyped werden. LoL ja ja auch schon so weit ich weiß bestätigt dass sie ein Battle-Royal Modus rausbringen also wieso dann das ganze.\nWenigstens haben sie jetzt mit Yumi endlich mal wieder ein Champ nach dem \"alten\" Konzept rausgebracht der nicht \"aktiv\" am Spielgeschehen mitwirkt sonder die Mitspieler passiv supportet.","replies":[]}]},{"poster":"MentalWukong","date":"2019-05-15T08:46:46.166+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Electrobert","date":"2019-05-15T09:44:54.332+0000","up_votes":1,"down_votes":0,"body":"Die nerfs auf Rageblade sind schon mal ein Anfang.\n\nIm Lategame dürfen adcs nicht nur  tanks shreddern, das ist sogar ihre Aufgabe!\n\nEs geht viel mehr darum, dass Adcs mittlerweile viel zu früh spiken und tanks bereits ab dem frühen midgame nicht mehr tanken können.","replies":[]}]}]}