{"poster":"PunicaPanda","date":"2015-03-07T21:45:33.472+0000","title":"Silber IncrediblePandas","subforum":"Clans & Teams","up_votes":2,"down_votes":3,"body":"Guten Abend.\r\n\r\nIch suche für mein neu eröffnetes Ranked Team noch ein paar Mitstreiter!\r\nWir sind die IncrediblePandas. Momentan sind wir 2 Leute, die die Bot Lane bilden.\r\nAlso suchen wir vorzugsweise TOP, MID und JUNGLER.\r\nSwitchen ist aber auch noch möglich. \r\nWir spielen im Silber bereich und würden uns freuen wenn ihr auch im Silber bereich seit, mindestens aber Bronze 1.höchstens gold 4 \r\nTS ist vorhanden, nur den Server zum treffen müssten wir dann noch schauen :D aber da sollte sich schnell einer finden lassen.\r\nVom alter her sind wir momentan 24 und 29. weiblich und männlich.\r\nSpielzeiten dabei sind variabel. Alle haben ein Real Life. aber mit guten Absprachen sollte dies kein Problem seine einige Matches auf die Beine zu stellen.\r\nAlso wenn ihr lust habt. So meldet euch hier, oder Ingame bei PunicaPanda.","replies":[{"poster":"Bluefersan","date":"2015-07-29T21:06:10.034+0000","up_votes":1,"down_votes":0,"body":"gold 2 fast gold 1 wenn ihr wollt main top/mid jgl einige champs dafür besonders gut.\nbei interesse einfach adden.\n\nahja fast vergessen m22","replies":[]},{"poster":"Elwe","date":"2015-07-29T20:44:44.609+0000","up_votes":1,"down_votes":0,"body":"Wäre gerne dabei bin Main Jgl und Supp. Bin 18 und Silber 4","replies":[]},{"poster":"Booncer","date":"2015-04-11T23:08:12.593+0000","up_votes":1,"down_votes":0,"body":"Wenn noch platz da ist würde ich auch mal geren vorspielen maine Mid kann aber auch swichen auf top und Adc.Mfg Booncer","replies":[]},{"poster":"Razgalor","date":"2015-03-09T13:48:27.817+0000","up_votes":1,"down_votes":0,"body":"Wir wären 3 Leute m22/m20/w21.\n\nZu mir (ich bin die m22 von oben^^):\nIn S4 war ich S5, bin jetzt in Silber 3 - habe diese Season noch nicht viel gespielt, daher die vermutlich noch sinkende Winrate von ca. 73%.  Habe letzte Season Main Top/Sup gespielt, habe jetzt auf Mainjungle gewechselt (bisher recht erfolgreich), kann die anderen beiden aber natürlich trotzdem noch ausfüllen.\n\nZu unserem \"m20\":\nMain Top, optional mid oder jungle. Letzte Season S 5 (zwischenzeitlich bis S 1 hoch)\n\n\"W21\":\nMain Sup, optional Midlane. Letzte Season B 1 (zeit reichte nicht mehr zum hoch spielen, weil wir erst am Ende der letzten Season überhaupt mit ranked games angefangen haben), jetzt in S 3.\n\nWollten uns jetzt mal am Teamranked versuchen und daher nen Team auf die Beine stellen (zum einen, weil wir uns mal angucken wollten wie es im Teamranked läuft, zum anderen, weil das leaven, flamen und trollen im solo/duo ziemlich nervig ist und wir doch stark davon ausgehen, dass das in nem festen Team nicht gemacht wird ;) ). Daher wollte ich uns drei hier mal \"bewerben\", weil wir dann ja direkt ein 5er Team voll hätten.\n\nWürde mich freuen, wenn man einfach mal nen paar Normals zusammen spielt um zu gucken ob die Chemie stimmt und ob man sich dann zsm aufs Teamranked stürzen will^^\n\nUnser Toplaner ist gerade noch im Urlaub, ansonsten fast durchgehend online (zumindest gefühlt), unser Mid/sup ist tendenziell Abends, zwischendurch (vor allem am WE) aber auch Tagsüber online, ich bin in der Regel Abends und am Wochenende online, in seltenen Fällen Morgens/Mittags für nen paar Runden.\n\nVorerst könnte ich noch nen TS Server zur Verfügung stellen, weiß aber nicht ob wir den dauerhaft nutzen können/dürfen aber das würde man dann ja sehen.\n\nFreue mich auf eure Rückmeldung :) am besten einfach Ingame adden: Razgalor","replies":[]},{"poster":"Hatschi","date":"2015-03-09T08:55:52.616+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\nich hätte durchaus Interesse für euch den Jungle zu spielen. Ich würde auch noch einen Main Supporter mitbringen Wenn gewünscht.\nZu mir: Ich habe die letzten 7 Monate LoL nicht viel gespielt, da ich zum Start des Addons zu WOW gewechselt bin. Dort bin ich aber derart unzufrieden, sodass ich meinen Account wieder auf Eis gelegt habe. Damals habe ich Main Jungler gespielt und war auch in einem recht gutem Platin Team. Meine damalige Elo war Gold3. Ich habe allerding die letzten Tage ein bisschen gespielt und gemerkt das mir der eine oder andere Skill verloren gegangen ist. Deshalb suche ich ein Silber Team um mit euch nach Gold zu spielen. Die Solo Elo sollte auch bald wieder steigen wenn ich mich fit genugb fühle wieder ranked zu spielen.\n\nMain Jungler damals: VI > Kha > Seju > WW, Jarvan, Cho, Noc, Xin, Yi usw.\n\nDen neuen Jungle bring ich mir gerade bei aber die Spiele die ich mit VI schon gespielt habe waren \"EASY\".\n\nIch bin gerade 31 geowrden, flame nicht bin Kritikfähig und würde sogar den TS3 Server mitbringen den Ihr noch braucht.\n\nSagt mir doch einfach bescheid, dann machen wir ein paar Testgames.\n\nName: eXo HAtschi (war damals im EXO Clan bevor ich aufgehört habe zu spielen)","replies":[]},{"poster":"SnoopZ","date":"2015-03-08T15:37:13.856+0000","up_votes":1,"down_votes":0,"body":"hi bin season 4 zwar gold 1 gewesen, aber habe mich wortwörtlich hängen lassen und bin dort nicht mehr angesiedelt. Würde gerne mitmachen bin 22 ;)","replies":[]},{"poster":"CCG Juuzou","date":"2015-03-08T00:12:59.515+0000","up_votes":1,"down_votes":0,"body":"Main Top/Jungle/Mid (sucht euch was aus) männlich 18 Gold 5 und würd bei euch mitmachen wenn ihr wollt...!","replies":[]},{"poster":"wOmB4","date":"2015-03-07T21:48:49.385+0000","up_votes":1,"down_votes":0,"body":"bin main mid weiblich und 16 wäre gern dabei","replies":[]}]}