{"poster":"The Alex17","date":"2018-01-30T16:42:13.449+0000","title":"Aumento de instalock en normals?","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"Este ultimo mes al menos en la seccion unranked y elo medio he visto un gran incremento de instalock (la mayoria en top y adc) \r\n\r\nUn poco tarde pero para los que son unranked y de elo dudoso no se los recomiendo jugar en las ma&ntilde;anas (es todo un asco se desesperan por lo que parece)\r\n\r\nTambien me gustaria si existe una forma reportar eso (?\r\n{{sticker:sg-janna}}","replies":[{"poster":"Gato Parlante","date":"2018-01-30T17:19:31.209+0000","up_votes":1,"down_votes":0,"body":"Yo el otro dia me quedo adc, y fui nunu adc. El equipo ayudo muy bien, de echo la ganamos jugando todos en equipo y sin tirador. Es cuestion de la gente con la que te toca, no importa que campeon o que hagas, si tu equipo coopera por ganar y hacer el mismo objetivo eso es lo divertido. El rival se queria matar al ver que ganamos con una meta y composicion tan rara. \n\nSi te madeas ya en una selecci칩n de campeones y en una normal, ya es problema emocional tuyo, te aseguro que dejes de lado esas cosas y empiezes a ver el Macro de todo, jugar la partida por ser algo diferente, por aprender algo nuevo, por divertirte y poder ganar.\n\n{{sticker:sg-poppy}} ","replies":[{"poster":"The Alex17","date":"2018-01-31T10:43:26.851+0000","up_votes":1,"down_votes":0,"body":"Si si muy bonito pero no cuando uno ya lockea y otro dice AH NO YO VOY IGUAL y lockea de todos modos","replies":[]}]},{"poster":"VALORGULLO","date":"2018-01-30T21:13:15.455+0000","up_votes":1,"down_votes":0,"body":"no podes reportar eso xD , si son normales podes ir cualquier cosa , instalockear no es nada , por eso riot uso un segmento aparte reclutamiento","replies":[]},{"poster":"N4V1D4D","date":"2018-01-30T16:44:52.437+0000","up_votes":1,"down_votes":1,"body":"jaja so침 침ormals,침o jodas.","replies":[{"poster":"PanComido120","date":"2018-01-30T16:54:28.045+0000","up_votes":1,"down_votes":0,"body":"Siendo normales o no sigue siendo una molestia que ganes una linea y alguien te la robe porque \"no se jugar support\" o \"a mi me sale que gane linea aunque el resto diga que no gane linea\" si vas a estar en desacuerdo ten un argumento al menos{{sticker:darius-angry}}","replies":[]},{"poster":"The Alex17","date":"2018-01-30T16:49:26.290+0000","up_votes":1,"down_votes":0,"body":"No creo que haga falta contestarte, verdad?","replies":[]}]}]}