{"poster":"Altagüssen","date":"2015-04-27T01:49:44.175+0000","title":"Por que elobostean?! :(","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":0,"body":"Tuve una mala racha de 3 ranked seguidas perdidas y para rematar en la ultima habia un yi enemigo que estaba elobosteando y me jode mucho era solo ver el historial y eran puras rankeds, ninguna normal y todas las jugaba con yi y la mayoria con scores muy raros como 30-1 o 25-2 y no es necesario agragar que estaban TODAS ganadas!. Me jode mucho me quitan las ganas de rankear :(. El tipo antes era bronce.\r\nQue opinan? riot investiga a esos jugadores? o el tipo se volvio muy demasiado pro de un derrepente?.","replies":[{"poster":"KinderOfficial","date":"2015-04-27T17:59:54.222+0000","up_votes":1,"down_votes":0,"body":"Mira eso depende mucho si queres mira mi historial estaba ganando 4 de 10 (rankeds) , ya estaba por dejar de jugar rankeds , incluso por volver a dejar league of legends ... hasta que me acorde de mis tres champs que maineaba alla antes de llegar a level 30 . Mundo , Yi y Heimerdinger . Mundo no lo veo muy acorde a el metagame y no me esta gustando tanto , Yi esta muy bueno pero es muy blando y focuseable (aunque me va muy bien con el) , y al final encontre la magia la solucion ... HEIMERDINGER lo amooo <3 lo loveo todo jajaja ahora mismo tengo 76% de winrate pero en la semana tengo 86% con 12 ganadas y 2 perdidas y aca estoy en bronce 3 despues de estar en bronce 5 por muchisimo tiempo . Y como voy pienso llegar a plata asi que nunca desconfies de un bronce , si queres mira mi historial como mejore :D .","replies":[{"poster":"Altagüssen","date":"2015-04-28T02:05:27.909+0000","up_votes":1,"down_votes":0,"body":"no desconfio de un bronce xd por q yo igual estuve en bronce pero era de otro mundo xd se q es yi y q es fruta pero el tipo nos rebento como si fueramos bots xd pero q mas da cosas q pasan tal vez despues ese tipo estara en mi team y me acarree a mi pero la idea es q no elobosteen tal vez no era elo bost y era bueno pero siempre hay dudas. YA olvide la partida fue algo q paso y saludos! :D","replies":[]}]},{"poster":"I Am Elver Gudo","date":"2015-04-27T12:11:01.505+0000","up_votes":1,"down_votes":0,"body":"compro yi y descubrio la magia de apretar la Q y hacer pentakill, por eso se volvio pro","replies":[]}]}