{"poster":"superfire444","date":"2017-01-03T17:01:44.148+0000","title":"Can we please make Annie throw her bear instead of insta-spawning it","subforum":"Gameplay","up_votes":193,"down_votes":71,"body":"Currently Tibbers is way too strong. There is barely any (no pun intended) counterplay to him. I think giving him 0,25-0,5s cast time + his lowering the speed buff of his rampage after annie dies.","replies":[{"poster":"Iazy","date":"2017-01-03T19:20:20.215+0000","up_votes":53,"down_votes":3,"body":"She's the only mage in the game can that can reliably cause yasuo players to cry and rage at you in all chat. Why would you want such a precious thing changed?","replies":[{"poster":"dominusx","date":"2017-01-04T00:42:22.541+0000","up_votes":12,"down_votes":1,"body":"{{champion:69}} {{champion:268}} {{champion:55}} {{champion:127}} hi?","replies":[{"poster":"LordSirChipmunk","date":"2017-01-04T02:10:24.029+0000","up_votes":2,"down_votes":1,"body":"{{champion:161}} Hello, friends.","replies":[{"poster":"TheKnightDK","date":"2017-01-04T07:17:05.880+0000","up_votes":8,"down_votes":1,"body":"With all due respect, a good Yasuo can still roflstomp Vel'koz if he misses his E. \nBut get that combo up and see literal molten salt in Summoners Rift","replies":[]},{"poster":"Fly Fish Master","date":"2017-01-04T04:49:54.594+0000","up_votes":1,"down_votes":1,"body":"{{champion:157}} Face the wind","replies":[{"poster":"TeCoolMage","date":"2017-01-04T05:06:14.531+0000","up_votes":3,"down_votes":0,"body":"*eye faces the wind wall*\n\n*turns to the left slightly*\n\n*shoots out projectile in the wrong direction but it splits and hits you anyway*\n\n*faces wind wall again*\n\n*Laser*","replies":[]}]}]},{"poster":"Vellich0r","date":"2017-01-04T15:53:18.856+0000","up_votes":3,"down_votes":0,"body":"PSA: kayle hard counters yasuo. Her autos even go through his windwall.","replies":[]}]}]},{"poster":"ViiLLAiN","date":"2017-01-03T17:13:54.018+0000","up_votes":5,"down_votes":41,"body":"honestly when u have a champ that has a high win rate in all elos u know theres a problem when u got annie bot reaching challenger just playing annie theres a problem","replies":[{"poster":"TheOnlyJoe","date":"2017-01-03T17:27:40.624+0000","up_votes":39,"down_votes":1,"body":"That's called an one-trick pony. And there's plenty of those at higher elo's.","replies":[{"poster":"Melledoneus","date":"2017-01-03T18:52:43.618+0000","up_votes":3,"down_votes":1,"body":"Including that Nocturne mid main and the Heimerdinger main.","replies":[{"poster":"5000000000000000","date":"2017-01-03T19:40:59.174+0000","up_votes":7,"down_votes":1,"body":"Also apparently Aatrox jungle OTP","replies":[{"poster":"Pimasterchampion","date":"2017-01-04T00:21:22.334+0000","up_votes":1,"down_votes":0,"body":"isn't he masters?","replies":[{"poster":"5000000000000000","date":"2017-01-04T00:26:12.631+0000","up_votes":4,"down_votes":0,"body":"I only know he's high elo, but that sounds about right","replies":[]}]}]}]}]}]},{"poster":"The Yetii Rider","date":"2017-01-03T18:32:52.129+0000","up_votes":27,"down_votes":2,"body":"Annie's Summon: Tibbers is generally needed to keep the large amount of mobility creep in mid lane in check. I have no problem with it. \n\nYou should just play Nunu. Annie presses R and it heals you. Delicious.","replies":[{"poster":"Shaydrox","date":"2017-01-03T20:05:51.011+0000","up_votes":9,"down_votes":3,"body":"Atm there's barely any mobility creep in midlane going on. Tbh I agree with the statement though, some Rioter did a while back too stating they like how easily Annie shuts down mobility champions. However she shouldn't be oneshotting squishies within the same spell imo...","replies":[{"poster":"The Yetii Rider","date":"2017-01-03T21:04:08.848+0000","up_votes":5,"down_votes":5,"body":"> [{quoted}](name=Shaydrox,realm=EUW,application-id=3ErqAdtq,discussion-id=tEs8WlrK,comment-id=00120002,timestamp=2017-01-03T20:05:51.011+0000)\n>\n> Atm there&#x27;s barely any mobility creep in midlane going on. Tbh I agree with the statement though, some Rioter did a while back too stating they like how easily Annie shuts down mobility champions. However she shouldn&#x27;t be oneshotting squishies within the same spell imo...\n\nShe's a burst Mage. What is she supposed to do if not one shot?","replies":[{"poster":"An Undead brat","date":"2017-01-03T21:23:02.899+0000","up_votes":14,"down_votes":0,"body":"You mean that spammable Q, DoT ult and tank-spell E? Idk, being a Battle Mage seems like a reasonable direction?","replies":[{"poster":"Adriqnohee","date":"2017-01-03T21:24:47.012+0000","up_votes":2,"down_votes":1,"body":"I really don't think a little kid would fit into the battlemage theme.","replies":[{"poster":"Shaydrox","date":"2017-01-03T22:57:46.350+0000","up_votes":8,"down_votes":2,"body":"But she does fit the burstmage theme? Considering she has a shield ability and she spawns a creature to assist her in battle, you wouldn't expect her to outright 100--0 anyone in less than a second huh?\nBiggest joke is some high elo Annies don't even level her shield, it's not surprising as it makes no sense to level a shield when you can oneshot someone while not giving him a chance to retaliate, there's no risk involved as long as you don't get ouranged.","replies":[{"poster":"Adriqnohee","date":"2017-01-04T00:49:30.325+0000","up_votes":1,"down_votes":0,"body":"I'm not talking about her kit, I'm talking about her design, she is a little kid that has a huge magical power, likes fires and domesticated one of the most ferocious animals out there, she doesn't fit the battlemage theme.","replies":[{"poster":"Chromatic Eagle","date":"2017-01-04T01:34:18.918+0000","up_votes":6,"down_votes":0,"body":"What does she fit then? Thresh doesn't suit supports based on design but here we are.","replies":[]},{"poster":"An Undead brat","date":"2017-01-04T17:39:38.121+0000","up_votes":4,"down_votes":0,"body":"Agree, she fits into a kindergarten, let's remove her from the game for her own safety.","replies":[]}]}]}]}]}]}]},{"poster":"Brownie Elfie","date":"2017-01-03T22:03:54.332+0000","up_votes":3,"down_votes":1,"body":"Wait im stupid\nIdk how u heal from tibbers ult\nEdit: I assume u mean eating tibbers nvm\nAlso what is mobility creep (Im stupid)","replies":[{"poster":"5000000000000000","date":"2017-01-03T22:41:43.419+0000","up_votes":8,"down_votes":0,"body":"Mobility creep is a form of power creep. Power creep refers to instances where newly released contents of a preexisting game is more powerful than previous ones, so that the new content will be used. This is fine in games like WoW where getting better gear is an important aspect of the game, but in League, where all champion picks should be balanced (more or less), having an objectively more powerful champion means that an older champion is outclassed.\n\nSo mobility creep basically means the new releases keep getting more mobility and warp the game around it. For example, Teemo was considered one of the most mobile champions in the game at one point, but now he's on the immobile side of the roster.\n\nAnd Annie ultimate counters mobility creep because no matter how mobile you are, you can't dodge an instant cast spell (that is usually combined with the stun). If you're stunned, you lose all advantages of being mobile to dodge spells, and just get bursted down.","replies":[]}]}]},{"poster":"notice me Sin pi","date":"2017-01-03T19:28:18.090+0000","up_votes":18,"down_votes":0,"body":"{{champion:1}} [\"Bear hug!\"](http://vignette4.wikia.nocookie.net/leagueoflegends/images/4/43/Annie.ultimate2.ogg/revision/latest?cb=20130118045509) (throws Tibbers as a _**projectile**_)\n{{champion:157}} [ \"Face the wind!\"](http://vignette1.wikia.nocookie.net/leagueoflegends/images/2/23/Yasuo.E2.ogg/revision/latest?cb=20131123012548) (throws wind wall)\n{{champion:1}} wtf wtf yasuo op rito nerf plz","replies":[]},{"poster":"Scruberz","date":"2017-01-03T17:08:26.338+0000","up_votes":10,"down_votes":2,"body":"The real question is, why does Tibbers have 1000000000 move speed?","replies":[{"poster":"EndlessSorcerer","date":"2017-01-03T17:09:29.153+0000","up_votes":16,"down_votes":0,"body":"Have you ever seen a bear run?\n\nThey can be pretty fast when they want to be.","replies":[{"poster":"Could not care","date":"2017-01-03T22:28:13.131+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=EndlessSorcerer,realm=NA,application-id=3ErqAdtq,discussion-id=tEs8WlrK,comment-id=00000000,timestamp=2017-01-03T17:09:29.153+0000)\n>\n> Have you ever seen a bear run?\n> \n> They can be pretty fast when they want to be.\n\n{{champion:106}} \n\n\"Let the storm follow in my wake.\"","replies":[]},{"poster":"Professor Ward","date":"2017-01-03T17:16:30.220+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=EndlessSorcerer,realm=NA,application-id=3ErqAdtq,discussion-id=tEs8WlrK,comment-id=00000000,timestamp=2017-01-03T17:09:29.153+0000)\n>\n> Have you ever seen a bear run?\n> \n> They can be pretty fast when they want to be.\n\nrandom grizzly trap'd at 30mph\nusain bolt ran 28 at his fastest\n\nnobody is outrunning that","replies":[]}]}]},{"poster":"TheOnlyJoe","date":"2017-01-03T17:29:02.526+0000","up_votes":17,"down_votes":4,"body":"Annie's kit in general has no counterplay or outplay potential.\nQ is targeted, W is a near instant cone, R is a near instant ground-targeted nuke","replies":[{"poster":"Supreme Senpai69","date":"2017-01-03T17:53:57.413+0000","up_votes":15,"down_votes":3,"body":"At the same time there's no outplay potential on her end. It's all so damn telegraphed. She has no mobility either. She sorta feels bad to play as and against, but I think she's one of the more well balanced champions. \n\nNot balanced, per se, but better than all this other muck we gotta trudge through that make it past ban phase","replies":[{"poster":"drakuIa421","date":"2017-01-03T18:38:20.809+0000","up_votes":5,"down_votes":2,"body":"the only reason i dont ban annie is because i dont see her picked as much as heca or vi right now.","replies":[]}]},{"poster":"MinaZer0","date":"2017-01-03T21:56:59.054+0000","up_votes":7,"down_votes":0,"body":"uh.. is this an already fed annie you are talking about? because just like any other champion, if fed, one shots, shes just a nuke mage so you can notice it clearer, have you ever went against a fed veigar, one shots you with ult (a targeted ability) atleast annie's tibbers is flashable.","replies":[]}]},{"poster":"Teridax68","date":"2017-01-03T17:17:37.493+0000","up_votes":14,"down_votes":2,"body":"I agree with this, though I think Annie's ult could also be improved by having its range increased. Her initiation is still dysfunctional without Flash, but it needs to be, because otherwise she could simply burst anyone down on demand. If her ult had a delay, she could potentially throw Tibbers from much farther away, which would allow her to start her burst combo without needing a gapcloser, but would also make her more competitively valuable, since one of Annie's greatest strengths is her ability to nuke and stun the entire enemy team at once. She might need a few more changes after that (her E is still a boring ability that's mostly only used to generate stacks), but a change like that could significantly improve both her counterplay and her agency.","replies":[{"poster":"Velzard of Koz","date":"2017-01-03T20:37:31.668+0000","up_votes":7,"down_votes":0,"body":"> If her ult had a delay, she could potentially throw Tibbers from much farther away...\n\nIt actually does have a delay (casttime), though insignificant one. One of the Rioters said so back at MYMU.","replies":[]}]},{"poster":"Oleandervine","date":"2017-01-03T17:13:08.288+0000","up_votes":8,"down_votes":0,"body":"You mean bear-ly.","replies":[]},{"poster":"SnugglePuggle94","date":"2017-01-03T21:38:37.979+0000","up_votes":9,"down_votes":1,"body":"No, she does not need it and Riot already commented on that concept and the concept of losing her stun stacks.\n\nBeluga Whale: \n\n\"Things we especially like:\n\nThe flash bear drop. Annie’s bread-and-butter burst combo is a threatening affair that’s more about skirting the edges of Annie’s range than dodging a skillshot. While League benefits a lot from the potential to outplay most abilities in the game, having Champions with reliable abilities is also good for the game as long as they don’t make less-reliable champions obsolete.\"\n\nAND\n\n\"The delay on Tibber's spawn is so short that we don't believe it falls within the window of \"dodge this ability\". If you predict it and jump out of the way, that's great! But a pre-indicator could send the wrong message of \"we expect you to be able to get out of this\".\n\nHis response about having her stacks delay or fall off:\n\n\"This is a neat idea, but it has a few issues:\n\nMost other champions with their Ultimates ready already put out the pressure that they could use it at any time\nThis would make roaming or hiding in ambush with Annie a matter of spamming abilities constantly unless the decay time was trivial and it would just get reset in the lane pressure situation.\"\n\n\nIf anyone wants to see the actual comments, look here: http://boards.na.leagueoflegends.com/en/c/developer-corner/3IXxdZwi-mid-year-mage-updates-annie-direction?show=rundown\n\n\nPlease stop asking for Annie changes. They won't come. Learn to play against her instead of coming onto here crying and acting all butthurt that you got smacked by her. It's getting annoying really.","replies":[]},{"poster":"Cocho","date":"2017-01-03T21:09:47.416+0000","up_votes":7,"down_votes":0,"body":"This is funny because they've already done this.\n\nThe cast time on it is about 0.2 seconds from the mage update. \nThe speed buff on tibbers after annie dies got lowered some patches ago.\n\n\nAnnie's ult would scan for hits when you pressed ult rather then when it actually appeared before the mage update. That means it went from 0 to 0.2 seconds\n\nIt's actually really annoying seeing the enemy in the indicator, ulting, then just barely whiffing it because of the delay. \n\nWhen hitting it, I relied heavily on the indicator waiting to just barely get in range or when flash ulting. You could feel the change if you played her alot before/after the mage update. The change wasn't in the patch notes, but myself and annie mains could tell what happened. \n\nThat's another thing, the delay also applies to flash ult, so with a good reaction time, if you're on point and expecting annie to flash ult you, you can react to it just barely, when you couldn't before unless you predicted when, rather than reacted to it. I've defiantly done it to annies before. \n\nYou can't really react to the animation itself, but you can to flash because you know whats (probably) going to happen immediately. \n\nIf they added more delay to tibbers, she wouldn't be nearly as good at initiating. Her W would be used to initiate instead, and its just a smaller AoE. She would need more damage to compensate or something new to tibbers. \n\nTibbers being summoned actually doesn't do much damage more than a maxed Q or W at any part of the game. Its him whacking the crap out of you, the AoE burn, and Annie's QW after that which hurts.","replies":[{"poster":"5050BS","date":"2017-01-04T01:49:20.235+0000","up_votes":2,"down_votes":1,"body":"Was not enough.","replies":[{"poster":"Cocho","date":"2017-01-04T02:07:29.702+0000","up_votes":5,"down_votes":1,"body":"She would lose her strong initiation, which is all she does really. \nTo compensate, they would need to make tibbers have scalings like Daisy, or increase her damage or something. \n\nShe'd be bad Ryze lol","replies":[]}]}]},{"poster":" Ánnîe ","date":"2017-01-03T19:14:17.770+0000","up_votes":7,"down_votes":0,"body":"People always want to change this but this is annies literal only strength the burst/stun combo from tibbers that REQUIRES flash to do so unless you let annie literally walk up to you. Shes very short ranged with literally no mobility her pay off is the reliability she has once she does manage to get in range.","replies":[]},{"poster":"Qwandee","date":"2017-01-04T05:35:01.698+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=superfire444,realm=EUW,application-id=3ErqAdtq,discussion-id=tEs8WlrK,comment-id=,timestamp=2017-01-03T17:01:44.148+0000)\n>\n> Currently Tibbers is way too strong. There is barely any (no pun intended) counterplay to him. I think giving him 0,25-0,5s cast time + his lowering the speed buff of his rampage after annie dies.\n\ni hate annie as much as the next guy but honestly you can't do this to annie or her play rate would go to like 0.0000001% with only annie bot playing it.\n\nthe only reason anyone picks it is for flash + r ..... if you nerf R noones ever going to play it ever again.. like urgot or something...\n\nand if you nerf her R how do you justify not nerfing like {{champion:254}} {{champion:134}} {{champion:56}}","replies":[]},{"poster":"Qukslice","date":"2017-01-03T20:10:06.661+0000","up_votes":6,"down_votes":0,"body":"All of her power is in her ulti anyway. Nerfing her ulti would require some sort of compensation.","replies":[]},{"poster":"macromite","date":"2017-01-03T17:59:28.414+0000","up_votes":5,"down_votes":3,"body":"if you add a cast time to the bear then you need to make that bear fucking strong.\n\nYou don't want that.","replies":[{"poster":"LatetotheRace","date":"2017-01-03T18:25:03.681+0000","up_votes":7,"down_votes":1,"body":"Or we could add a little tune, like when Kled ults. Then everyone will be happy. \n(Really though, there's no reason for any kind of buffs. Her ability rotate will change to W then R for the same effect.)","replies":[]}]},{"poster":"Dataless","date":"2017-01-04T05:33:53.921+0000","up_votes":5,"down_votes":0,"body":"I would go find the Red post explaining why having Annie \"throw\" Tibbers is not going to happen, but I just got home from work and that's way too much effort. Suffice to say that this has been talked about before, multiple times. It's not going to happen.","replies":[]},{"poster":"Emerald Fang","date":"2017-01-03T17:19:41.223+0000","up_votes":8,"down_votes":3,"body":"Do we need another thing that Yasuo can block?\nHe can already block Talliyah ult; I think there's a limit.","replies":[]},{"poster":"SweedishGunner","date":"2017-01-03T20:49:02.672+0000","up_votes":1,"down_votes":3,"body":"I had an idea that Annie shouldn't be able to hold her empowered spell (the stun) for an infinite time. Like Yasuo's 3rd Q or Vlad's empowered Q it shouldn't last forever. That way she cant just hold the stun indefinitely in-lane.","replies":[{"poster":"MissMikasa","date":"2017-01-03T21:33:59.540+0000","up_votes":5,"down_votes":0,"body":"No. Riot already touched on this and on the delay concept when they were talking about her mage update. They don't like that idea and won't do it.","replies":[]}]},{"poster":"Gaddafi","date":"2017-01-04T11:46:19.612+0000","up_votes":4,"down_votes":0,"body":"you've got indicators what else should we do to destroy Annie?\n\nmeanwhile some newer champs shit on whole Rift and i do not see changes to those overloaded kits\n\nbut yeah, let's destroy old champs... Yi was a thing, but ppl were like '' omg too cancer delete noob champ '', swain was hidden op but ppl were like '' omg the OP no counterplay '' so he got raped, some reworks i would rather not mention ( my main from earlier seasons got destroyed both in gamplay and champ identity ) but you know, lets nerf Garen too? Or shall we go and... forget it..\n\nif things continue like this then you guys will have to play in the mess you have made, eat the shit this game is becoming and you have pooped it, no, actually you are pooping it everyday","replies":[]}]}