{"poster":"oxigenTank","date":"2017-04-28T07:44:13.511+0000","title":"proposta per una nuova skin per yasuo","subforum":"Discussioni generali","up_votes":2,"down_votes":5,"body":"Salve RIOT!\r\nvorrei proporvi una nuova skin per yasuo che come altre &egrave; ricollegata al mondo dei cartoni animati!\r\ninfatti fra le varie vesti ho trovato per esempio yellowjacket shen che praticamente &egrave; scorpion di mortal kombat e lux guardiana intergalattica che in pratica &egrave; sailor moon... insomma questo era per dire che per un&#039;azienda come la vostra non vi dovrebbero essere problemi ad acquistare i diritti , nel caso in cui non siano gi&agrave; scadutii.\r\nVenendo al sodo l&#039; idea che mi &egrave; venuta in mente , &egrave; stata quella di mettere a confronto yasuo con il mezzo-demone INUYASHA .\r\nL&#039;affinit&agrave; tra i due che vorrei sottolineare &egrave; che entrambi sono legati al vento , inuyasha infatti prima di poter sferrare un attacco con la sua spada tessaiga deve prima trovare le ciccatrici nel vento di cui poter sfruttare l&#039;energia... lo stesso modo in cui yasuo deve attivare la passiva della sua abilit&agrave; offensiva prima di poter usare l&#039;ultima.\r\nPenso che non sia una skin troppo complicata ma l&#039;animazione allo sfodero della spada e per l&#039;abilit&agrave; ultima potrebbero essere davvero spettacolari e spingere molti appassionati soprattutto nell&#039;oriente asiatico a comprala.\r\nSarebbe oltretutto bello ricambiare con i diritti creativi con il 5% degli introiti della skin o un accordo in cui io sia la parte minore.\r\n\r\n{{champion:157}} \r\n\r\nHi RIOT!\r\nI would like to propose you a new skin for yasuo that like others is connected to the world of cartoons!\r\nIndeed among the various clothes I found for example yellowjacket shen which is practically scorpion of mortal kombat and lux intergalactic guardian who in practice is sailor moon ... in short this was to say that for a company like yours there should be no problems at Purchase the rights, if they are not already expired.\r\nComing so hard, the idea that came to my mind was comparing yasuo with the middle-demon INUYASHA.\r\nThe affinity between the two that I would like to point out is that they are both bound to the wind, inuyasha before they can attack with his sword tessaiga must first find the cheaters ( scar )  in the wind to be able to exploit the energy ... the same way In which yasuo must activate the passive of his offensive abilities Q before being able to use his R.\r\nI think it&#039;s not a skin too complicated, but the animation at the sword and the ultimate skill might be spectacular and push many fans in the East Asian to buy it.\r\nIt would also be nice to rejoin with creative rights with 5% of skin gains or an agreement where I am the smallest part.","replies":[{"poster":"Náos","date":"2017-04-28T10:25:11.985+0000","up_votes":3,"down_votes":0,"body":"Io preferirei uno Yasuo armatura della Quinta Era, la sciarpetta blu che tiene attorno al collo potrebbe diventare di pelo rosa, potrebbe avere dei pantaloni viola scuro attillati. Magari nella splash art potrebbero ritrarlo insieme a taric, secondo me sarebbe fantastica.","replies":[]},{"poster":"Ardens33","date":"2017-04-28T08:22:17.953+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=oxigenTank,realm=EUW,application-id=MJVj50Jw,discussion-id=8ad2JAET,comment-id=,timestamp=2017-04-28T07:44:13.511+0000)\n\n> Sarebbe oltretutto bello ricambiare con i diritti creativi con il 5% degli introiti della skin o un accordo in cui io sia la parte minore.\n>\n\nahahahAhahahHshshshshshhaahahaheahahahahahahahhahahahagahahahahahah\n\nSolo..? Fai il 30% va'","replies":[]},{"poster":"oroora6","date":"2017-04-28T11:46:01.956+0000","up_votes":2,"down_votes":0,"body":"grazie di avermi introdotto alla delicata arte dell' Harakiri","replies":[]},{"poster":"vondarck","date":"2017-04-28T10:28:36.102+0000","up_votes":2,"down_votes":0,"body":"> Sarebbe oltretutto bello ricambiare con i diritti creativi con il 5% degli introiti della skin o un accordo in cui io sia la parte minore.\n\nl'imprenditore, \"sisi tu mi piaci\" cit, sergente maggiore hartman","replies":[{"poster":"Sexy Win","date":"2017-04-28T11:41:35.768+0000","up_votes":2,"down_votes":1,"body":"Si si tu mi piaci , vieni a casa mia che ti faccio scopare mia sorella ahahahahah","replies":[]}]},{"poster":"oxigenTank","date":"2017-04-28T10:12:45.625+0000","up_votes":2,"down_votes":1,"body":"dovevo leggere il regolamento nello specifico ....\nma direi che un riconoscimento mi se lo si potrebbe lasciare non sò un millino sarebbe un millesimo dei guadagni su un personaggio così usato....","replies":[{"poster":"HaIIeIujah","date":"2017-04-28T10:20:41.022+0000","up_votes":1,"down_votes":0,"body":"Quindi vuoi un riconoscimento...per aver suggerito alla Riot...di usare un idea sotto un copyright...che non ti appartiene?","replies":[{"poster":"Ardens33","date":"2017-04-28T16:32:20.933+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ø Tera Ø,realm=EUW,application-id=MJVj50Jw,discussion-id=8ad2JAET,comment-id=00030000,timestamp=2017-04-28T10:20:41.022+0000)\n>\n> Quindi vuoi un riconoscimento...per aver suggerito alla Riot...di usare un idea sotto un copyright...che non ti appartiene?\n\npiù che altro, quanto dovrebbero prendre tutti quelli che effettivamente _creeranno_ la skin? xd","replies":[]}]}]},{"poster":"oxigenTank","date":"2017-05-07T19:26:41.159+0000","up_votes":1,"down_votes":0,"body":"che cani che siete.... uno non può dire una cosa che tutti lo insultano aggrappandosi alla minima cavolata!\na mio parere il copyright può non essere un problema essendo il campione molto famoso gli introiti sarebbero molto ma molto più alti delle spese;\nd'altronde io ho proposto l'idea perchè venisse portata avanti non esclusivamente per soldi, solitamente io ho sempre aiutato gli sviluppatori di questi videogiochi a trovare nuove idee , nel mio piccolo.","replies":[]},{"poster":"L0pHO3n1X","date":"2017-04-28T10:01:35.397+0000","up_votes":1,"down_votes":0,"body":"ahahahaahahahahahahahahahahahahahahahaha!!!!!!!! L'idea è bella ma la Rito specifica che qualsiasi idea tu posti qui può essere usata da loro senza che ti debbano una Lira!!\n{{sticker:zombie-nunu-tears}}","replies":[]},{"poster":"HaIIeIujah","date":"2017-04-28T09:14:24.680+0000","up_votes":1,"down_votes":0,"body":"> Sarebbe oltretutto bello ricambiare con i diritti creativi con il 5% degli introiti della skin o un accordo in cui io sia la parte minore.\n\nhttp://i.imgur.com/1R7XXkJ.png","replies":[]}]}