{"poster":"Shaco2","date":"2017-11-08T19:01:23.522+0000","title":"LoL wurde endgültig ein spiel für kleine Kinder","subforum":"Champions & Gameplay","up_votes":1,"down_votes":5,"body":"Das neue System ist einfach nur mehr scheiße die neuen Runen Seiten/Masteries sind extrem schlecht beschrieben und das Gameplay fühlt sich nur mehr zum Kotzen an ein Spiel wird niemals mehr als 25 Minuten gehen. Die Champs sind Teilweise extrem unbalnced Adc machen viel zu viel schaden und Tanks halten kaum mehr etwas aus. Meiner Meinung nach, wurde die komplette Freude am Spiel mit den neuen Patch genommen und &uuml;ber die Community braucht man gar nicht erst anfangen zu Reden es sind nur mehr groß teils kleine Kinder unterwegs es wird nur mehr beleidigt und wenn  jemanden etwas nicht passt Trollt er oder geht Afk wenn jemand Fragen in Forum stellt kommen nur Dumme und Beleidigende Antworten entgegen. Dies alles ist für mich persönlich ein Grund villeicht mit diesem Spiel aufzuhören (war seit Season 4 Dabei) und finde es Traurig was aus den Spiel geworden ist. MFG","replies":[{"poster":"Wekra","date":"2017-11-08T19:08:36.104+0000","up_votes":3,"down_votes":0,"body":"Also ich hatte gerade mein erstes Spiel das ging 40 Minuten. Ich als ADC konnte den Tank nehmen aber musste gut kiten. der gegenerische Zedhat mich aber rasiert...alles beim alten","replies":[]},{"poster":"MeMyselfandBaal","date":"2017-11-08T19:07:26.535+0000","up_votes":3,"down_votes":0,"body":"Dann... gönne dir 2 Monate Pause und warte, bis Riot alle Preseason Änderungen angepasst hat... danach kannst du dann ja weiter spielen...","replies":[]},{"poster":"Critical lmpact","date":"2017-11-08T19:12:28.095+0000","up_votes":2,"down_votes":0,"body":"Ich kann es nicht mehr hören.... die Preseason läuft noch nicht mal 24 Stunden und alle sind nur am rumheulen....\n\nSorry, aber mal ernsthaft: niemand kann nach ein paar Stunden beurteilen wie gut das runensystem ist und was man noch anpassen muss....\n\nGib Riot doch mal ein bisschen Zeit und die Chance diese Anpassungen vorzunehmen.\n\nUnd abgesehen davon solltest du auch mal darüber nachdenken ob du nicht vielleicht einfach die falschen Runen für deine champs/spiele gewählt hast","replies":[{"poster":"Dreadlord Mike","date":"2017-11-09T00:16:42.443+0000","up_votes":1,"down_votes":0,"body":"Finde das neue Runensystem richtig gut gemacht tbh, viel individueller als das alte System. Man hat einfach viel mehr Möglichkeiten seinen Champ seinem playstyle anzupassen und das finde ich wirklich gut.\nGibt nen Video auf YouTube wo ein Typ zeigt wie man alleine Warwick auf 9 verschieden Weisen spielen kann. Also die neue Runen sind bist jetzt einfach nur geil xD","replies":[]}]},{"poster":"Allerbester Biss","date":"2017-11-08T19:09:10.814+0000","up_votes":1,"down_votes":0,"body":"Pass auf, diese Antort im Forum kann als „dumm“ oder „beleidigend“ aufgenommen werden.\n\nIm Forum gibt es fast nur Spieler die einem helfen wollen.\nDie einen legen  ihre Meinung und Erfahrungen ganz offen dar, andere eher komplett objektiv betrachtet.\n\nBeleidigung kannst du super easy melden xD.\nGibt es fast nicht mehr.\n\nIm Spiel kannst du einfach den Chat muten?! Dann gibt es KEINE kleinen Kinder mehr!\n\nZu dem Balance System: Es gibt immer etwas, dass „stark“ ist. Fast nie etwas das OP ist.\nEs gab eine Meta in der Tanks OP waren. Es gab eine Meta in der Galio OP war.\nEs gab eine Meta in der Adc OP waren.\n\nIm Moment ist NICHTS oder ALLES op.\nKeiner hat eine Ahnung, was am besten ist.\nKeiner weiß was absolute Grütze ist.\n\nMeine MEINUNG: Hör auf dich zu ärgern, was „OP“ ist. Hör auf dich über Kinder aufzuregen.\nHör einfach auf zu tilten.\n\nMeine Meinung ohne Beleidigung, Dummheiten!!","replies":[{"poster":"Sirrkas","date":"2017-11-08T23:14:22.988+0000","up_votes":1,"down_votes":0,"body":"Hm, alles und nichts ist OP. Zeit zu experimentieren. Vielleicht mal wieder Skarner im Jungle, da gibts sicher was gutes. Seine Schreine geben ja Movementspeed und ein paar Runen skallieren damit. Könnte jetzt stark sein.","replies":[{"poster":"Dreadlord Mike","date":"2017-11-09T00:14:39.726+0000","up_votes":1,"down_votes":0,"body":"Skarner müsste ich auch noch ausprobieren, mit den alten Runen war er auch ganz annehmbar, muss jetzt nur noch schauen was ich jetzt mit ihm nehmen werde aber ich Denke Domination als main ist schon ein guter Anfang","replies":[]}]}]},{"poster":"Sirrkas","date":"2017-11-08T23:12:17.720+0000","up_votes":1,"down_votes":0,"body":">Das neue System ist einfach nur mehr scheiße die neuen Runen Seiten/Masteries sind extrem schlecht beschrieben\n\nMan kann den Text der Runen erweitern. Etwa indem man Umschalten gedrückt hält oder ein Kreuzchen setzt.","replies":[]},{"poster":"Enderized","date":"2017-11-08T19:08:25.214+0000","up_votes":1,"down_votes":0,"body":"Wenn die Runen so schlecht beschrieben sind...\nGibt Vorschläge was man besser machen kann.","replies":[{"poster":"Crash x8","date":"2017-11-08T23:08:02.204+0000","up_votes":1,"down_votes":0,"body":"z.b. einfach die \"Detailierte Runenbeschreibung\" aktivieren. Entweder durch aktivieren der Option am unteren Rand der Runenseite oder durch halten der Umschalttaste.","replies":[]}]},{"poster":"Roxãs","date":"2017-11-08T20:52:50.725+0000","up_votes":1,"down_votes":0,"body":"Man müsste erwarten das jemand mit Gold4 so viel base Knowledge besitzt, das er nicht so einen Bullshit von sich gibt.\nDas lässt mich erschrecken das ich immernoch scheiße Spiele wenn ich mir andere Gold Spieler anschaue.","replies":[]},{"poster":"STI","date":"2017-11-08T20:33:27.637+0000","up_votes":1,"down_votes":0,"body":"Dann hör auf zu spielen. Dein Post ist sinnlos und nutzlos! Immer diese Leute, die alles neue schlecht reden","replies":[]},{"poster":"Herr Hübsch","date":"2017-11-08T19:45:51.593+0000","up_votes":1,"down_votes":0,"body":"wurde endgütlig? wann war es je was anderes?","replies":[]},{"poster":"LordPistonia","date":"2017-11-08T19:14:13.219+0000","up_votes":1,"down_votes":0,"body":"Also eben wegen dieser neuen ,,komplexeren´´ Runen ist das Spiel keineswegs für Kinder und mal sind ADCs stark, mal Tanks, das liegt an den sich immer ändernden Meta. Natürlich halten Tanks vieles aus wenn du richtug baust, guten Farm für die Items hast e.t.c und natürlich sind ADCs vor allem im Late stark da sie auch Carrys sind die aber nur durch einen kleinen falschen Schritt gecatched und getötet werden können und somit das ganze Spiel throwen können. ich wünsche dir und allen anderen hier eine aufregende Pre-Season 8 ^^","replies":[]}]}