{"poster":"Phill the Hungry","date":"2016-08-29T14:17:32.829+0000","title":"Ping in Canada","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hi, I'm going to Canada (Quebec) to study and was wondering what the ping was like in that area to the NA servers.","replies":[{"poster":"Daklore","date":"2016-08-30T02:28:06.306+0000","up_votes":1,"down_votes":0,"body":"If it helps, I'm right next door to Quebec in New Brunswick. My traffic probably follows a relatively similiar route, and I generally average around 50ms. Low of 46, occassional high of 65, but average sits around 50 on most days. So, I'd probably expect about the same in Quebec... unless you're up in the Northern part of Quebec, anyway. (but, like Targons Blade said, factors, yada yada routing technical stuff, could be different, even lower!(hopefully not higher...))\n\nCheers!","replies":[{"poster":"Phill the Hungry","date":"2016-08-30T07:56:21.386+0000","up_votes":1,"down_votes":0,"body":"I'm going to be in Sherbrooke, so I guess it should be alright.  Anything below 80 ping is playable for me.  I was just looking at the map and thinking you guys in North America have it a little worse than us in Europe where I'd normally get about 20 ping.  I feel sorry for those guys in Alaska and Hawaii though.","replies":[]}]},{"poster":"Targons Blade","date":"2016-08-29T22:33:29.851+0000","up_votes":1,"down_votes":0,"body":"Latency (ping) to a server is determined by a lot of factors, however, the most impacting are physical distance from the destination server, local network settings and routing to that server along ISP infrastructure. This means that your next-door neighbor could be on one ISP and have 45ms of latency, while you could have 52ms of latency on a different provider.\n\nIf you run into any issues with your latency after you get to Quebec, hit me up and I'll happily assist you.","replies":[]},{"poster":"Ihatethisgame111","date":"2016-08-29T16:30:19.027+0000","up_votes":1,"down_votes":0,"body":"I'm in San Diego an get 65 ms \nThere's an idea.\nPlus there's a map on here so where that'll tell you your ping where your at.","replies":[{"poster":"Phill the Hungry","date":"2016-08-29T19:37:10.489+0000","up_votes":1,"down_votes":0,"body":"Where can I find this map?","replies":[{"poster":"Ihatethisgame111","date":"2016-08-29T19:54:30.396+0000","up_votes":1,"down_votes":0,"body":"One min will find link","replies":[{"poster":"Ihatethisgame111","date":"2016-08-29T20:00:08.810+0000","up_votes":1,"down_votes":0,"body":"http://boards.na.leagueoflegends.com/en/c/help-support/2uTrAyy8-na-server-roadmap-update-chicago-server-move-complete","replies":[{"poster":"Phill the Hungry","date":"2016-08-29T20:40:31.568+0000","up_votes":1,"down_votes":0,"body":"Cheers","replies":[]}]}]}]}]}]}