{"poster":"BradNo","date":"2018-12-31T23:20:14.869+0000","title":"The support meta is fucked up.","subforum":"Gameplay","up_votes":7,"down_votes":13,"body":"I wish I would get a player who actually knows how to support.\r\n\r\nI keep getting Lux and Brand (Along with Velkoz and Xerath) supports who don&#039;t know how to support.\r\n\r\nThey believe they can carry hard, but if they don&#039;t carry, they make the adc (me in some cases) fall behind.\r\n\r\nThis is the worst season I have experienced with the support meta (I don&#039;t know how it is in gold plus though. I&#039;m &quot;hardstuck&quot; silver rn).\r\n\r\nI really wish people would learn how to support before playing a carry-type support.","replies":[{"poster":"Tulare","date":"2018-12-31T23:38:01.889+0000","up_votes":4,"down_votes":0,"body":"It's not a fun time to be an enchanter or tank. That leaves lockdown supports, which are okay, and off-mage supports like the ones you mentioned. I agree, some of them have a rough time with the actual \"support\" role. It's a lousy time to be learning how to play support because of how the meta is right now. The whole bot lane meta is really hostile to traditional lanes so a lot of marksmen are on the bench, unusual picks like Ziggs and Heimerdinger are showing up in the \"carry\" role, and the off-mage supports really punish a lot of the traditional support champs. Janna is my highest-rated champ but I've been enjoying Orianna, of all things, in the support role lately.","replies":[{"poster":"BradNo","date":"2018-12-31T23:46:54.794+0000","up_votes":1,"down_votes":2,"body":"Oriana is better than brand and lux. And what do you mean by \"lockdown support?\"","replies":[{"poster":"Tulare","date":"2018-12-31T23:49:42.680+0000","up_votes":1,"down_votes":0,"body":"Morgana is the big one, although Lux, outfitted to support, also qualifies. Leona, Zyra. Anybody with a good stun or root. One I discovered just recently, which I haven't really stress tested yet, is Skarner.","replies":[{"poster":"Silly Neeko","date":"2019-01-01T00:33:39.068+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Tulare,realm=NA,application-id=3ErqAdtq,discussion-id=WhMXB6ed,comment-id=000100000000,timestamp=2018-12-31T23:49:42.680+0000)\n>\n> Morgana is the big one, although Lux, outfitted to support, also qualifies. Leona, Zyra. Anybody with a good stun or root. One I discovered just recently, which I haven&#x27;t really stress tested yet, is Skarner.\n\nShould try out Nautilus. You want to see an enemy adc or support lose heart in the game if they are hit by a hook? Q, auto, W auto reset, E, R, auto.... all while your adc is hitting too. They are locked down with knock ups or stuns for about 3 seconds while taking tons of damage, and the enemy adc or support you are not hitting cant kill you or peel you off easy at all. Then your Q is up again pretty quick and the cycle repeats.\n\nWhen it works well you feel bad for the enemy. He isnt seen much, but he is still very strong indeed.","replies":[{"poster":"BradNo","date":"2019-01-01T00:47:43.378+0000","up_votes":1,"down_votes":2,"body":"Bro, you need some help. You are talking like a mad man.","replies":[{"poster":"Silly Neeko","date":"2019-01-01T05:02:33.663+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BradNo,realm=NA,application-id=3ErqAdtq,discussion-id=WhMXB6ed,comment-id=00010000000000010001,timestamp=2019-01-01T00:47:43.378+0000)\n>\n> Bro, you need some help. You are talking like a mad man.\n\nIm a support main who has been asked what happened to the enemy adc multiple times due to them just giving up as soon as i hook them or whatever. Admittedly, it doesnt happen often.... just it has happened quite a few times.\n\nGenerally with Nautilus because he locks down people even harder than Leona. In all honesty, the only reason leona is picked over naut is generally just because she can use her E through minions and is a bit faster with her E than Naut is with his Q.\n\nHeck, i bring him top lane and annoy top laners with him too.","replies":[]}]},{"poster":"Tulare","date":"2019-01-01T00:38:09.724+0000","up_votes":1,"down_votes":0,"body":"Yup. I'm familiar with Nautilus support. I just dashed a quick list off the top of my head and didn't think of him.","replies":[]}]}]}]}]},{"poster":"Pandemic Punch","date":"2019-01-01T07:26:17.988+0000","up_votes":3,"down_votes":0,"body":"Before enchanters got nerfed, there was a healthy triangle.\n\nMages > Tanks\nEnchanters > Mages\nTanks > Enchanters\n\nAfter the nerf it is now...\n\nMages > All\n\nRight now, Mages can overkill through shields and carry the game with or without the ADC. I had several Brand games where I would literally 1v2 bot lane while my ADC jungles or whatever stupid thing ADC's do to waste time while having no pressure on the map at all.\n\nI am tired of playing mages every game though. I am paying the price for not playing them, but I played them for half of a season and I would much rather play traditional supports. This has done nothing but made me drop elo though because I have no agency over the game. Only games where I have a half decent ADC is where the games feel OK but even then, you arent guaranteed to win a match with a winning bot land. The only way to win consistently is to play a mage and take matters into your own hands.\n\nThe current Support meta rewards you for being a selfish player and punishes you for picking actual supports.","replies":[]},{"poster":"JustDonnyy","date":"2018-12-31T23:33:58.921+0000","up_votes":4,"down_votes":1,"body":"Lots of Support players seem to mistake what \"Support\" actually means recently. I think it happens more commonly in Lower Elo's when Support players think that every ADC sucks and the only way on a winning lane is if they do all the work.","replies":[{"poster":"LTK KoRo","date":"2019-01-01T00:39:38.239+0000","up_votes":1,"down_votes":1,"body":"Its not like they're wrong tbh, in low elo everyone sucks basically. Even these supports, but everyone in low elo is like \"everyone is shit, but im not\"","replies":[{"poster":"BradNo","date":"2019-01-01T00:50:25.991+0000","up_votes":1,"down_votes":1,"body":"Um, not everyone in low elo sucks. Some people don't waste their life away on this game and are genuinely okay.","replies":[{"poster":"LTK KoRo","date":"2019-01-01T00:59:56.897+0000","up_votes":1,"down_votes":0,"body":"When you're climbing in low elo it's better to assume everyone sucks, even if it not always true. Supporting low elo ADCs usually is pain, sometimes these ADCs aren't even bad, but just more often you'll end up with bad player rather than good.","replies":[{"poster":"Lil Spoon","date":"2019-01-01T06:18:23.549+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LTK KoRo,realm=EUW,application-id=3ErqAdtq,discussion-id=WhMXB6ed,comment-id=0000000100000000,timestamp=2019-01-01T00:59:56.897+0000)\n>\n> When you&#x27;re climbing in low elo it&#x27;s better to assume everyone sucks, even if it not always true. Supporting low elo ADCs usually is pain, sometimes these ADCs aren&#x27;t even bad, but just more often you&#x27;ll end up with bad player rather than good.\n\nthen dont go support","replies":[{"poster":"LTK KoRo","date":"2019-01-01T12:24:20.155+0000","up_votes":2,"down_votes":0,"body":"autofilling into supp happens more than you think in low elo bruh","replies":[]}]},{"poster":"BradNo","date":"2019-01-01T01:29:22.578+0000","up_votes":1,"down_votes":0,"body":"That mentality won't make you good in high elo though. You will just carry that over to high elo and get hardstuck.","replies":[{"poster":"LTK KoRo","date":"2019-01-01T01:45:36.451+0000","up_votes":1,"down_votes":0,"body":"In high elo, for sure. But if you feel that you belong to higher elo, then you will get there much faster with mages bot than enchanters.","replies":[{"poster":"BradNo","date":"2019-01-01T02:22:36.747+0000","up_votes":1,"down_votes":1,"body":"true, but if you're trying to get better, you should stay to the meta AND/OR be good with an off meta pick.","replies":[]}]}]}]}]}]},{"poster":"BradNo","date":"2018-12-31T23:36:14.630+0000","up_votes":3,"down_votes":1,"body":"Exactly","replies":[]},{"poster":"Leaf on Bush","date":"2019-01-01T05:42:00.257+0000","up_votes":1,"down_votes":0,"body":"That's not new. \nMage supports have always fallen into that trap.\nThey took all the farm and and made no attempt to protect their ADC and ended up doing more damage so they think that they are \"better\" and in position to talk down.","replies":[{"poster":"BradNo","date":"2019-01-01T07:10:59.277+0000","up_votes":1,"down_votes":1,"body":"EXACTLY MY POINT","replies":[]}]}]},{"poster":"MagicFlyingLlama","date":"2018-12-31T23:42:51.455+0000","up_votes":2,"down_votes":4,"body":"Almost like people are going to play the most effective supports instead of playing worse ones so they can feed your ADC hero fantasy and have an autoloss if it falls flat.\n\nThe truth is ADCs are garbage right now.","replies":[{"poster":"BradNo","date":"2018-12-31T23:54:28.779+0000","up_votes":1,"down_votes":2,"body":"Brand and lux are not the most effective supports. Traditional supports provide much more for your team than a brand or lux does. I know some ADCs are bad, but it's better to have a good adc player/main who is playing a bad adc than to have a bad support player/main who is playing a good support in the meta","replies":[{"poster":"MagicFlyingLlama","date":"2019-01-01T00:18:53.136+0000","up_votes":1,"down_votes":0,"body":"Lux, not so good.\n\nBrand? One of the higher winrate supports now, and grossly so in low games. Also Fiddlesticks and Zyra.\n\nAll of the poke mages are generally better in low games.","replies":[{"poster":"BradNo","date":"2019-01-01T00:25:01.418+0000","up_votes":1,"down_votes":6,"body":"Brand isn't good because he has a high win rate. In fact, he only has a high win rate because he has a high play rate, and no one knows how to play against him in low elo (That winrate will go down was people learn how to play aginst him). In higher elo, brand and supports of the like aren't that good at keeping their adcs alive.","replies":[{"poster":"MagicFlyingLlama","date":"2019-01-01T00:40:41.808+0000","up_votes":3,"down_votes":0,"body":"Except brand has been a support for two years.\n\nThat is not how it works.","replies":[{"poster":"BradNo","date":"2019-01-01T00:51:58.134+0000","up_votes":1,"down_votes":2,"body":"Brand wasn't popular in season 7. He is only now experiencing peak popularity.","replies":[{"poster":"MagicFlyingLlama","date":"2019-01-01T00:57:09.785+0000","up_votes":2,"down_votes":0,"body":"Ok, you know best. Everyone else and two years of data is wrong.","replies":[]},{"poster":"Sukishoo","date":"2019-01-01T01:03:04.603+0000","up_votes":1,"down_votes":0,"body":"Not. He was a VERY popular pick in season 7 and even had some in season 6 which is when he first came around in the support role.","replies":[{"poster":"BradNo","date":"2019-01-01T02:21:46.905+0000","up_votes":1,"down_votes":1,"body":"What I am trying to generalize is he wasn't that popular as a support until later on.","replies":[]}]}]}]},{"poster":"Janna Me Fiddle","date":"2019-01-01T01:56:17.944+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BradNo,realm=NA,application-id=3ErqAdtq,discussion-id=WhMXB6ed,comment-id=0002000000010000,timestamp=2019-01-01T00:25:01.418+0000)\n>\n> Brand isn&#x27;t good because he has a high win rate. In fact, he only has a high win rate because he has a high play rate, and no one knows how to play against him in low elo (That winrate will go down was people learn how to play aginst him). In higher elo, brand and supports of the like aren&#x27;t that good at keeping their adcs alive.\n\nBrand has a counter pick that tends to lose effectiveness the higher you climb. That pick being {{champion:53}} \n\nAt lower Elos, Brands tend to be over-aggressive to a fault, they don't tend to be good at keeping an eye on blitzes predictable moving patterns or juking hooks. Blitz lands one combo, Brands dead and it'll keep happening over and over.\n\nHigher Elos are much more adept at playing around the hook, which means Blitz has to look for riskier positioning to get his combo down, putting him at threat of Brands combos.\n\nZyras good at all Elos because she has excellent harrass, all in and can actively disengage for her carry. Fiddle loses effectiveness the higher you climb as it's all about knowing how to deal with his annoying poke and level 6 all in.\n\nKnow who else is still really good? {{champion:43}}  and {{champion:117}}","replies":[{"poster":"BradNo","date":"2019-01-01T02:20:58.535+0000","up_votes":1,"down_votes":1,"body":"You could say brand is bad against lots of all in / combo champions such as {{champion:12}} {{champion:53}} {{champion:201}} {{champion:111}} {{champion:497}} {{champion:555}} {{champion:98}} {{champion:412}} and others I may have missed","replies":[{"poster":"MrFawknSunshine","date":"2019-01-02T05:08:38.942+0000","up_votes":1,"down_votes":0,"body":"brand flat out counters braum dont play that. LUL","replies":[{"poster":"BradNo","date":"2019-01-02T21:36:11.308+0000","up_votes":1,"down_votes":1,"body":"That's not even true in the slightest","replies":[{"poster":"MrFawknSunshine","date":"2019-01-02T23:34:13.736+0000","up_votes":1,"down_votes":0,"body":"yea he does . you are slow easy target for him to proc {{item:3303}} and to poke down making it easier to bully you out of lane and for the adc to all in you and the adc. \n\nit is legit one of the worst lanes for braum. \n\nhttps://lolalytics.com/ranked/worldwide/8.24/platinum/plus/champion/Braum/\nif you look here braum has a 45.44% win rate vs brand","replies":[]}]}]}]}]}]}]},{"poster":"Lil Spoon","date":"2019-01-01T06:20:26.029+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BradNo,realm=NA,application-id=3ErqAdtq,discussion-id=WhMXB6ed,comment-id=00020000,timestamp=2018-12-31T23:54:28.779+0000)\n>\n> Brand and lux are not the most effective supports. Traditional supports provide much more for your team than a brand or lux does. I know some ADCs are bad, but it&#x27;s better to have a good adc player/main who is playing a bad adc than to have a bad support player/main who is playing a good support in the meta\n\nbrand atleast gives off more pressure then lux, allowing the adc to farm more safely","replies":[{"poster":"BradNo","date":"2019-01-01T07:10:24.644+0000","up_votes":1,"down_votes":1,"body":"If you are a good brand.\nElse you are just overextending and being a fool.","replies":[]}]},{"poster":"Tulare","date":"2018-12-31T23:58:51.242+0000","up_votes":1,"down_votes":0,"body":"There's a tough balancing act there, though. You're right that traditional supports provide much more for the team, in the abstract case. But in practice they have to survive laning phase without feeding the enemy carry, while earning enough gold to itemize. Take two highly traditional support / adc pairs right now and put them bot lane. One of two things will happen. Either one of them will feed and the other team will have a relevant adc by the mid-game. Or both of them will have an average early game but be mostly irrelevant in the mid-game when all of the important action is happening.","replies":[{"poster":"BradNo","date":"2019-01-01T00:20:44.510+0000","up_votes":1,"down_votes":1,"body":"Or they will get feed.\n\n\"Or both of them will have an average early game...\": How does this equate to having a bad mid game?","replies":[{"poster":"Tulare","date":"2019-01-01T00:36:50.363+0000","up_votes":1,"down_votes":0,"body":"Because that's where marksmen stand right now. They get a modest power spike at one item but then taper off until they get their third item.\n\nYou say \"Or they will get fed.\" I already implied that. One side feeds, the other gets fed. If neither side feeds/gets fed, then neither adc is relevant during the mid-game, while assassins, mages, and bruisers are highly active right now.","replies":[{"poster":"BradNo","date":"2019-01-01T02:06:29.022+0000","up_votes":1,"down_votes":1,"body":"This doesn't apply to all adcs. You're talking like this is the golden rule when it's not. And going even is that bad. As long as you have a good support, you can do good mid game.","replies":[{"poster":"Tulare","date":"2019-01-01T02:11:31.306+0000","up_votes":1,"down_votes":0,"body":"It's a generalization, yes, and there are exceptions to it. From what I've seen, Miss Fortune, Lucian, and Jhin, for example, all do okay. Most of the AA-focused adc's, however -- Ashe, Jinx, Caitlyn, for example, are struggling through the mid-game. That's not necessarily a problem, except the pace of the entire game has generally accelerated recently, meaning that many games are decided relatively early.","replies":[{"poster":"BradNo","date":"2019-01-01T02:27:23.084+0000","up_votes":1,"down_votes":1,"body":"That's why you spoon feed an early game adc and you win (half joking though).\n\nI agree that riot is messing over late-game adcs, but they still need a good support. I'm not saying that brand or lux support is bad. I'm saying the ones that I see are bad (for the most part).","replies":[]}]}]}]}]}]}]},{"poster":"LTK KoRo","date":"2019-01-01T00:41:36.585+0000","up_votes":3,"down_votes":0,"body":"Truth is that ADCs aren't garbage, but without peeling they are. And people realized that current meta is not like ardent, you don't need to spoonfeed your ADC to win anymore.\n\nBack in the days people peeled and cared about ADCs because they were most reliable and easiest to pull off win condition. Since current ADCs power budget is on par with other classes, suddenly people have more freedom when it comes to win conditions, and they usually choose to ignore the ADC.","replies":[]}]},{"poster":"Dr Dog","date":"2019-01-02T05:22:17.508+0000","up_votes":1,"down_votes":0,"body":"the requirements to support atm are \"do you have one form of hard cc? well you can support !\" tho personally its gotten me more into the roles as ive always loved things like xerath support but it is so god awful to play adc rn imo","replies":[{"poster":"BradNo","date":"2019-01-02T22:17:15.633+0000","up_votes":1,"down_votes":0,"body":"Why are adcs awful? I don't think that they are bad. I think everyone else is just better.\n\nThe only thing that is making adcs bad is the fact the Riot is trying to shorten the game length.","replies":[]}]},{"poster":"Düff McWhalen","date":"2019-01-02T21:37:40.173+0000","up_votes":1,"down_votes":0,"body":"Hey OP, maybe learn to play to the strengths of your support. Duo Lane is a two way street ya dig?","replies":[{"poster":"BradNo","date":"2019-01-02T22:15:23.446+0000","up_votes":1,"down_votes":0,"body":"What if my support is dogshit? Do I just lose?","replies":[]}]},{"poster":"Gabresol","date":"2019-01-01T02:01:14.040+0000","up_votes":1,"down_votes":0,"body":"enchanters just suck in a lot of situations.\nNami will always be top tier, but that is because she has 3 times the stuff other enchanters have.\nShe has a heal, which is actually the weakest part of her kit.\nA on hit slow, she can give to anyone.\nAn AOE knock up and an AOE stun.\nAND if any abilitiy, including the slow and damage on-hit buff,  hits an ally, they get a movementspeed buff, which is incredible for roaming or getting back into lane and evne ganking.\n\nBut other than her, enchanters kinda suck.\nShields are not big enough to fight against the overkill damage the game currently offers to almost everyone and everything and tanks can also get a multi-target shield and damage absobtion for their carry.\nHeals are even worse, since you cannot heal what goes from 100 to 0.\n\nSo, instead of supporting by saving your carry, you just lock down or murder what tried to hurt them.\n\nThe most effective way is to either be a big, tough, bodyguard or carrying a bazooka to keep carries saves. Being a fairy with magic glitter is just not as effective.","replies":[{"poster":"BradNo","date":"2019-01-01T02:17:23.414+0000","up_votes":1,"down_votes":2,"body":"You don't need a mage bot lane to lock down an enemy. Sona, Nami, Janna, etc, have tools to lock down threats from the enemy team. \n\nYou will get 100 to 0 regardless of what support you have. However, DH was nerfed which makes this harder to do.\n\nWhat saves yourself from being killed? An assassin could burst YOU down instead. Now what? You're a dead bodyguard.","replies":[{"poster":"Gabresol","date":"2019-01-01T14:16:41.345+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BradNo,realm=NA,application-id=3ErqAdtq,discussion-id=WhMXB6ed,comment-id=00050000,timestamp=2019-01-01T02:17:23.414+0000)\n>\n> You don&#x27;t need a mage bot lane to lock down an enemy. Sona, Nami, Janna, etc, have tools to lock down threats from the enemy team. \n> \n> You will get 100 to 0 regardless of what support you have. However, DH was nerfed which makes this harder to do.\n> \n> What saves yourself from being killed? An assassin could burst YOU down instead. Now what? You&#x27;re a dead bodyguard.\n\nA carry can't get killed, if everything else does first.\nEspecially Brand and Lux can zone out champions or just burst enemies from a range from anym istakes the enemy may makes.\nZed can't burst you, if he is stunned AND dies immidiatly upon coming out of his deathmark.\nNami cannot kill Zed, but lock him down lon enough with a Q + Ult combo, but as mentioned, she is an exceptional strong support regardles of everything around her.\n\nBut more importanly is the zoning in laningphase.\nBrand and Lux (for example) will always outpoke a sona and they can also easily one-shot stuff upon hitting 6.\nAnd with their AOE, zoning carries from farm is also not that diffecult. You are also stacking your spellthieves gold quite easily with that. Especially with Brand who gets 3 procs of one ability.\n\nSupport items are also quite bad, at least the  forbidden idol-series.\nThey increase your weak heals and shileds by almost nothing, because their base is so weak.\n\nSure, Sona is strong. But she is build full damage and can one-shots carries herself of that.","replies":[]}]}]}]}