{"poster":"Arachno Flame","date":"2014-12-07T07:16:09.156+0000","title":"I have never met a player with broken English that wasn't cancerous, toxic and abusive.","subforum":"Miscellaneous","up_votes":3,"down_votes":3,"body":"In most of my games, the player is usually Chinese, and becomes enraged when someone takes his role. He then proceeds to either feed, troll, or play normally but spam chat with insults usually directed at my mother. Common examples include \"YOUR MOTHER IS SUCK!!\" \"YOUR MOTHER BOOM BOOM!!!\" and \"FUXX YOU!!!\" as well as spamming the chat with spam directed towards the player who took their role. Usually they'll say something like \" (Insert champion name here) RUBBISH!!!\" before minions have even spawned. They continue to say those things whether the player is doing good or not. This trend has been occurring for so long that I'm starting to think that these players are abusive bots. Is anyone else seeing this pattern/trend when playing with/against foreigners with broken English or is this only happening to me?","replies":[{"poster":"Lord Sesshomaru","date":"2014-12-07T08:14:34.789+0000","up_votes":4,"down_votes":0,"body":"I dont think it is anything to do with race, \n\nits just one simple thing, toxic people are simply less intelligent than other normal people and as a result their english is subhuman.","replies":[]},{"poster":"MadLifeJunior","date":"2014-12-07T22:17:09.196+0000","up_votes":4,"down_votes":1,"body":"Hey there Arachno Flame,\n\nI understand your concern as I too have encountered numerous players with poor literacy skills. But that does not necessarily mean the player is CHINESE. As I myself am Chinese. Whilst sometimes the situation can be factored down to being a foreign player I believe that most of the time it is due to the player 'rush typing' during times of elevated heart rate which can occur when you get stressed over 'your role being taken' or similar situations. I say this because I've noticed that at times when I've been in situations that I have felt uncomfortable my typing also goes 'full %%%%%%'. \n\nWith that said there is no need to pin poor literacy skills solely on race. But if a player is being verbally abusive you are able to report them in client in the game statistics screen. In addition you can screen shot any foul language and send them in a SUPPORT ticket. \n\nRegards,\nlols =)","replies":[]},{"poster":"SEKAI","date":"2014-12-07T11:59:16.403+0000","up_votes":3,"down_votes":1,"body":"In my entire 4 years of playing I have only met the \"broken English rager\" (and who actually looks like from somewhere outside of the OCE region) once, he was playing a Fiora and was angry at me taking top.\n\nNot to mention there is no guarantee that the broken English is entirely the result of using a secondary language, you know, there is still a great deal amount of people who can't type their first language in a coherent manner, whatever the language it may be. And it's not like we're all expecting/typing perfect English in-game to begin with.\n\nSo tbh assuming all the broken English rage are all in fact from overseas is simply not true.\n\nEDIT: Not to mention, those who type with broken English is generally raging to begin with, but that doesn't only mean that he is from overseas.","replies":[{"poster":"Goldendo 2","date":"2014-12-08T09:21:26.898+0000","up_votes":2,"down_votes":1,"body":"Thats because you play normals. A lot of these raging foreigners mostly play ranked.","replies":[]},{"poster":"greatdeathz","date":"2015-03-06T06:01:03.445+0000","up_votes":1,"down_votes":0,"body":"also their experiences from english might be only form textbooks at schools, and not real life social situations so the way ppl talk in league might confuse them and make them think that speaking in this toxic manner is the \"norm\" for english speaking ppl","replies":[]},{"poster":"Klavinmour","date":"2014-12-09T02:26:46.178+0000","up_votes":1,"down_votes":1,"body":">And it's not like we're all expecting/typing perfect English in-game to begin with.\n\nMy friends and I expect at least basic sentence structure within the game chat.","replies":[{"poster":"greatdeathz","date":"2015-03-06T06:02:58.209+0000","up_votes":1,"down_votes":1,"body":"oce is short for oceanic not australia, if it really stirs you up try and make a petition to have an \"australian\" server","replies":[]}]}]},{"poster":"Rav","date":"2014-12-07T14:36:05.940+0000","up_votes":2,"down_votes":1,"body":"I remember this game a while ago, somehow I got put with 7 French players in 1 single game. They kept complaining about tryharding while I was playing Garen (???). Then they flamed me for not knowing how to speak French. I then proceeded to say I shall start learning French that very point, and we surrendered right then. They took it vry srsly and even called me a racist. kek","replies":[{"poster":"Goldendo 2","date":"2014-12-08T09:20:47.138+0000","up_votes":2,"down_votes":1,"body":"LELELLE \n\n\nI find it stupid how they come over to this server and expect people to be able to speak french WHEN THIS IS AN OCEANIA SERVER","replies":[{"poster":"Rav","date":"2014-12-08T10:26:14.006+0000","up_votes":2,"down_votes":1,"body":"Goddammit goldendo, your line is \"xDeeeeeeeeeeeeeeeee\"\n\nTo anyone foreign: Don't come to a place, and then expect people to do %%%% your way. You have to adjust. You're the guest.","replies":[]},{"poster":"greatdeathz","date":"2015-03-06T06:06:07.711+0000","up_votes":1,"down_votes":0,"body":"LELELLE there are french speaking islands in the oceanic region oceania doesnt just mean australia, new caledonia for example, really learn abit about geography before posting","replies":[]}]},{"poster":"greatdeathz","date":"2015-03-06T06:04:03.145+0000","up_votes":1,"down_votes":0,"body":"\" we surrendered right then\" yep they were french alright :^)","replies":[]},{"poster":"Klavinmour","date":"2014-12-09T02:18:42.639+0000","up_votes":1,"down_votes":1,"body":"Every French speaking twat I've played with has said they are playing from France.\n\nWHY THE %%%% WOULD YOU PLAY ON A SERVER THAT GIVES YOU 200 PING!?","replies":[]}]},{"poster":"Lost In Time","date":"2014-12-07T07:48:58.082+0000","up_votes":2,"down_votes":1,"body":"Yeah pretty much why I hate Dota 2 on their OCE server.\n\n%%%%ing indo's all the time screaming obscenities over chat - a lot which don't make any sense.","replies":[]},{"poster":"Slim Chaedi","date":"2014-12-07T07:30:06.267+0000","up_votes":2,"down_votes":1,"body":"My experience is that every %%%% on the game speaks with a degree of illiteracy. I doubt it is always because of their race.","replies":[]},{"poster":"Homura Akemi","date":"2015-04-28T10:27:18.342+0000","up_votes":1,"down_votes":0,"body":"fking foreigners taking our women our jobs and our elo AYE LMAO. OBAMA Y U DO DIS LEL. STOP  DA BOATS BOIYZ XD","replies":[]},{"poster":"Homura Akemi","date":"2015-04-28T10:26:45.156+0000","up_votes":1,"down_votes":0,"body":"duh hurro .i cum 2 tek ur lp and ur virginity. JAJAJAJAJAJAJ","replies":[]},{"poster":"greatdeathz","date":"2015-03-06T05:54:53.476+0000","up_votes":1,"down_votes":0,"body":"most likely they learnt english from textbooks, at school and by playing lol, therefore not having real life experiences where they speak english maybe they believe the trash talk is the norm for english speakers so they are copying what they see","replies":[]},{"poster":"Your Neighbour","date":"2014-12-07T08:01:57.373+0000","up_votes":1,"down_votes":1,"body":"Reply with \"64 Tiananmen Square Massacre\" and information about it to win.\n\nIt's forbidden knowledge to mainland Chinese. If you say it,~~ it will upset the great firewall of China~~ they will be your BFF. If you can, link them some reference post-game, the firewall ~~does not like~~ loves banwords.\n\nSame thing happens on EUW, I would not say which country I consider most toxic, \n\nGermans trolls have this child-like sulk (goes off when you take 1 CS from their lane)\nSpanish trolls  sulk if you don't babysit their lane\nFrench trolls  will either feed or afk\n\nNordic folks are fine, personally I haven't met any serious ragers that's from Nordic countries.\n\nSource : Sometimes you just know things.","replies":[{"poster":"Cakemeisting","date":"2015-02-27T23:51:11.175+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Your Neighbour,realm=OCE,application-id=Ntey9fRZ,discussion-id=B1YZH86J,comment-id=0002,timestamp=2014-12-07T08:01:57.373+0000)\n>\n> Reply with \"64 Tiananmen Square Massacre\" and information about it to win.\n> \n> It's forbidden knowledge to mainland Chinese. If you say it,~~ it will upset the great firewall of China~~ they will be your BFF. If you can, link them some reference post-game, the firewall ~~does not like~~ loves banwords.\n> \n> Same thing happens on EUW, I would not say which country I consider most toxic, \n> \n> Germans trolls have this child-like sulk (goes off when you take 1 CS from their lane)\n> Spanish trolls  sulk if you don't babysit their lane\n> French trolls  will either feed or afk\n> \n> Nordic folks are fine, personally I haven't met any serious ragers that's from Nordic countries.\n> \n> Source : Sometimes you just know things.\n\nHaha nice summary. Don't forget if you \"ks\" the Americans will say their broken english while they are obsessing over your  mother and the rear posterior ;)","replies":[]},{"poster":"SEKAI","date":"2014-12-07T12:00:36.288+0000","up_votes":2,"down_votes":2,"body":"Consider the real truth behind the incident sometimes, not just what you're told.\n\nBut yes, it's not a good thing.","replies":[]}]},{"poster":"csm","date":"2015-02-27T09:58:37.052+0000","up_votes":1,"down_votes":0,"body":"lol i trol now","replies":[]},{"poster":"Free V Drinks","date":"2015-01-10T18:56:41.691+0000","up_votes":1,"down_votes":1,"body":"You're not alone mate. My pattern of seeing these foreigners are. \"SB, I fuked ur mum, fuk you\"\nThey feed to the ends of the earth, making the most dumb plays possible. \n\nI'd rather just get a LeaveBuster than having to be matched with these foreign dikheads.","replies":[]},{"poster":"Faelaren","date":"2014-12-09T12:33:10.256+0000","up_votes":1,"down_votes":1,"body":"I don't actually agree at all most of the ragers I know speak english perfectly and just dumb themselves down. \"omg git gud feyget omg feeding cnt\" \n\nI have quite a few friends that speak \"Broken English\" and honestly I find them great to deal with. Half the fun is trying to figure out what they meant haha","replies":[]},{"poster":"Goldendo 2","date":"2014-12-08T09:18:59.556+0000","up_votes":1,"down_votes":1,"body":"Agreed. It does get annoying when u get the foreigners in the game.  Its not their lack of skill ( well they are bad but thats not the point) its their attitude, and their toxicity added to that which grinds my gears","replies":[]}]}