{"poster":"Atronthor","date":"2015-02-26T10:30:13.314+0000","title":"Was genau wird eigentlich gegen Cheats / Skripte unternommen?","subforum":"Hilfe & Support","up_votes":1,"down_votes":2,"body":"Mir ist aufgefallen, dass meine Gegner manchmal unglaublichen Schaden raushauen. Das gleicht dann schon einem Onehit. Gut, es gibt Klassen, die sind darauf ausgelegt viel Schaden zu machen, aber es sind nicht nur diese Champions, sondern auch andere, die gleich zu Beginn unverschämt viel Schaden raushauen - ohne ersichtlichen Grund. Sie haben noch keine Ausrüstung etc.\r\n\r\nEben sprang mich im Dschungel Patheon an und onehittete mich mehr oder weniger mit Level 9. Ich hatte Jarvan Level 8. Außerdem steckte ich auf der Stelle fest, das heißt ich konnte mich nicht bewegen, obwohl die Laufanimation zu sehen war. Bug? Oder handelt es sich um Hackprogramme, mit denen man seine Charaktere stärker, schneller etc. machen kann?\r\n\r\nIch habe auch Pantheon und mir gelingt es mit ihm nicht gleichlevlige / gleich ausgerüstete zu onehitten. Wie schaffte das dieser Pantheon? Gibt es dafür ne Erklärung?\r\n\r\nIch möchte diese Firma dazu auffordern nicht gegen Leute vorzugehen, die während des Spielens vielleicht mal aufs Klo müssen (so etwas haben Menschen an sich, dass sie nicht 24/7 vor dem PC hocken können ohne einmal AFK gehen zu müssen.), sondern etwas gegen die Leute, die betrügen in welcher Form auch immer. Skripte gibt es offensichtlich und das wird auch immer wieder gezeigt auf Youtube beispielsweise. Wie kann es sein, dass einem Milliardenunternehmen, die sich von allem das Beste vom Besten leisten können, nicht merken sollen, wenn Unstimmigkeiten vorliegen? Und nein, es ist nicht meine oder die Aufgabe eines anderen Spielers Unstimmigkeiten zu melden, sondern ihr müsst von euch aus erkennen, ob jemand betrügt oder nicht. Es ist nicht meine Aufgabe euer Spiel betrugsfrei zu halten. DAs ist eure Aufgabe. Wenn ihr ein seriöses E-Sport-Spiel haben wollt, müsst ihr erst mal dafür sorgen, dass hier alles mit rechten Dingen zugeht. Ansonsten könnte man den Verdacht aufstellen, dass eure gesamten Turniere manipuliert sind, weil ich wüsste nicht wie man objektiv die Besten ermitteln will, wenn objektiv das Spiel nicht mal betrugsfrei gehalten werden kann.\r\n\r\nWenn dagegen nichts unternommen wird, muss man davon ausgehen, dass dieser Betrug von Riot unterstützt wird. Ich habe ehrlich nichts dagegen gegen ein besseres Team zu verlieren. Es ist schon ärgerlich wenn man mit Leuten spielt, die offensichtlich absichtlich verlieren wollen, aber wenn ich gegen Superchampions antreten muss, die aus unerfindlichen Gründen alles onehitten können, auch wenn es keine Assassine sind, dann find ich das gelinde gesagt merkwürdig.","replies":[{"poster":"Wolkenfuß","date":"2015-02-26T10:40:20.726+0000","up_votes":2,"down_votes":0,"body":"Hast du mal geschaut was für Runen und Masteries die haben? (Vergessen viele mit zu beachten) \nansonsten ist so was einfach ärgerlich. du könntest ein Aufnahme Programm (ich nutze Z.b Fraps ) im hintergrund laufen lassen, und wenn etwas passiert kannst du es Starten. Die Aufnahme kannst du dann an den Support Leiten. \nAllerdings solltest du vorher alle anderen möglichkeiten ausschöpfen. Wie z.B welche Runen hat der, ist dein Champ einfach unterlegen, \nhast du deffs, Kann es sein das der andere besser oder schon recht gefeedet ist? \n\nDas du dich nicht bewegen kannst, kann auch ein Bug sein.\nBei mir selbst sehe ich manchmal z.B das ich genau treffe aber der gegner bekommt keinen schaden. Meine Mates sagen mir dann das ich bestimmt 3 Meter daneben getroffen habe. Also solltest du auch schauen ob nicht was verbuggt ist. Probiere es in einem Freien Spiel aus.\nAnsonsten wenn du so was siehst melde es einfach und schreibe den Support an.\nRiot kann auch nicht immer alles sehen und überall sein.\nLG","replies":[{"poster":"Atronthor","date":"2015-02-26T10:47:35.856+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Feynja,realm=EUW,application-id=7hciEY9w,discussion-id=haEXdh3q,comment-id=0001,timestamp=2015-02-26T10:40:20.726+0000)\n>\n> Hast du mal geschaut was für Runen und Masteries die haben? (Vergessen viele mit zu beachten) \n> ansonsten ist so was einfach ärgerlich. du könntest ein Aufnahme Programm (ich nutze Z.b Fraps ) im hintergrund laufen lassen, und wenn etwas passiert kannst du es Starten. Die Aufnahme kannst du dann an den Support Leiten. \n> Allerdings solltest du vorher alle anderen möglichkeiten ausschöpfen. Wie z.B welche Runen hat der, ist dein Champ einfach unterlegen, \n> hast du deffs, Kann es sein das der andere besser oder schon recht gefeedet ist? \n> \n> Das du dich nicht bewegen kannst, kann auch ein Bug sein.\n> Bei mir selbst sehe ich manchmal z.B das ich genau treffe aber der gegner bekommt keinen schaden. Meine Mates sagen mir dann das ich bestimmt 3 Meter daneben getroffen habe. Also solltest du auch schauen ob nicht was verbuggt ist. Probiere es in einem Freien Spiel aus.\n> Ansonsten wenn du so was siehst melde es einfach und schreibe den Support an.\n> Riot kann auch nicht immer alles sehen und überall sein.\n> LG\n\nJa, ich hab auch Runen und jetzt? Ich erwarte von Riot Betrug zu bekämpfen und nicht zu unterstützen in welcher Form auch immer. Und Intoleranz gegenüber Betrug ist eine Unterstützung.","replies":[{"poster":"Sree","date":"2015-02-26T11:15:56.872+0000","up_votes":1,"down_votes":0,"body":"Nur gab es hier keinen Betrug. Ich hab mir das Spiel gerade mal angeschaut. Der Pantheon hatte tatsaechlich auf allen Runenplaetzen Angriffsschaden und hat sich als erstes nach dem Jungleitem auch direkt 2 Langschwerter fuer noch mehr Schaden gekauft.\nDu hattest nur 9 ruestung aus den Runen dagegen, nichts aus Items.\nPantheon hatte bereits 2 Kills bevor er dich getroffen hat, du keine.\nPantheon hatte 800 Gold mehr als du bevor er dich gekillt hat.\nEr hatte auch bereits den Schadensbuf vom ersten gekillten Drachen.\n\nIch halte es fuer sehr realistisch, dass er dir verdammt viel schaden mit seiner Spellcombo zufuegen konnte, die dich gleichzeitig stunned.","replies":[]}]}]},{"poster":"Hüxün","date":"2015-02-26T10:38:01.101+0000","up_votes":1,"down_votes":0,"body":"> Ich möchte diese Firma dazu auffordern nicht gegen Leute vorzugehen, die während des Spielens vielleicht mal aufs Klo müssen (so etwas haben Menschen an sich, dass sie nicht 24/7 vor dem PC hocken können ohne einmal AFK gehen zu müssen.), sondern etwas gegen die Leute, die betrügen in welcher Form auch immer.\n\nSo ein Blödsinn. Wie auch in der Schule: Wenn du nicht gerade eine Blasenentzündung haben solltest, dann sollte es doch machbar sein mal 45min still zu sitzen.\n\nDesweiteren gibt es zwar Scripts, aber die können deinen Champion nicht verstärken. Also, man kommt da nicht so leicht ran, deswegen ist das weitestgehend unmöglich Daten, die auf den Weg zu Riots Servern sind zu manipulieren (ja, ich erinnere mich an das Azir-Script, aber normalerweise..)\n\nEs ist für deinen Gegner bestimmt schön gewesen zu hören, dass du denkst, dass er scripted - denn ich empfinde es zumindest als die höchste Ehrung, die ich in einem Spiel wie LoL erhalten kann \"hey! der ist so gut, der scripted bestimmt!!!\" - Tut mir leid, aber wahrscheinlich ist er einfach viel besser als du, weiß seine Spells zu timen und hat vermutlich eine sinnvollere Runen/Mastery-Seite.","replies":[{"poster":"Atronthor","date":"2015-02-26T10:44:08.198+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Rkoturdo Ndo","date":"2015-02-26T11:00:24.900+0000","up_votes":1,"down_votes":0,"body":"Heya\n1. Du redest hier nicht mir Riot, das ist ein Communityforum\n2. Riot geht gegen Scripter vor, erst neulich gabs da ne Bannwelle gegen.\n3. Leute zu beleidigen lässt dich nicht gerade gut dastehen.\n4. AFK gehen weil man aufs Klo muss zu erlauben ist Schwachsinn, mal abgesehen davon, dass man das gar nicht überprüfen könnte.\n5. Mir ist keine Möglichkeit bewusst, den eigenen Charakter bessere Werte zu geben oder ähnliches, Scripte timen und Exploits nutzen Bugs aus.\n\nMfG Rkoturdo","replies":[{"poster":"Hüxün","date":"2015-02-26T11:13:35.676+0000","up_votes":1,"down_votes":0,"body":"Es gibt an jedem Beitrag unten rechts einen \"Melden\"-Button. Bin mir nicht sicher, ob er funktioniert, aber ich hielt es sinnvoller diesen zu nutzen anstatt mit jemanden zu \"diskutieren\" der (im gesamten Thread bisher) auf Antworten nur mit Beleidigungen gekontert hat.","replies":[{"poster":"Rkoturdo Ndo","date":"2015-02-26T11:42:40.899+0000","up_votes":1,"down_votes":0,"body":"Heya\nIch weiß, gemeldet hab ichs auch, aber irgendwie hat ich Lust noch was zu zu scheiben :D\nAuch wenn ich mit bei solchen Threads immer nicht sicher bin, obs nen Troll ist oder die Person das wirklich ernst meint.\n\nMfG Rkoturdo","replies":[]}]}]}]}]},{"poster":"HansMowlWurf","date":"2015-02-26T10:41:07.795+0000","up_votes":1,"down_votes":0,"body":"1. Du hattest keine Ruestung\n2. Pantheon war gefeedet\n3. Pantheon kann stunnen, darum konntest du nicht laufen\n4. Pantheons skyfall macht imensen Schaden wenn es trifft\n5. Du solltest dir die passive von Pantheons E Skill mal durchlesen","replies":[{"poster":"HyperionCH","date":"2015-02-26T10:46:48.986+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HansMowlWurf,realm=EUW,application-id=7hciEY9w,discussion-id=haEXdh3q,comment-id=0002,timestamp=2015-02-26T10:41:07.795+0000)\n>\n> 1. Du hattest keine Ruestung\n> 2. Pantheon war gefeedet\n> 3. Pantheon kann stunnen, darum konntest du nicht laufen\n> 4. Pantheons skyfall macht imensen Schaden wenn es trifft\n> 5. Du solltest dir die passive von Pantheons E Skill mal durchlesen\n\nAusserdem: 6.  Pantheon hatte nur AD-Runen.\nIst zwar grundsätzlich völliger Blödsinn, dies zu tun, kann im 1:1 (und im early) sehr wirksam sein; zumindest in tiefem Bronze.","replies":[{"poster":"Atronthor","date":"2015-02-26T10:48:25.399+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=HyperionCH,realm=EUW,application-id=7hciEY9w,discussion-id=haEXdh3q,comment-id=00020001,timestamp=2015-02-26T10:46:48.986+0000)\n>\n> Ausserdem: 6.  Pantheon hatte nur AD-Runen.\n> Ist zwar grundsätzlich völliger Blödsinn, dies zu tun, kann im 1:1 (und im early) sehr wirksam sein; zumindest in tiefem Bronze.\n\nJa. Du sagst es selbst, Du laberst nur völligen Blödsinn, was Dich offenbar hier qualifiziert.","replies":[{"poster":"HansMowlWurf","date":"2015-02-26T10:56:20.759+0000","up_votes":1,"down_votes":0,"body":"Wir koennen gerne ein 1vs1 machen.\nDu legst dir die Items zu die du zu dem Zeitpunkt hattest und ich nehme den guten Pantheon und zeige dir wie das passieren konnte das du geoneshootet wurdest ....","replies":[]}]}]},{"poster":"Atronthor","date":"2015-02-26T10:45:45.389+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=HansMowlWurf,realm=EUW,application-id=7hciEY9w,discussion-id=haEXdh3q,comment-id=0002,timestamp=2015-02-26T10:41:07.795+0000)\n>\n> 1. Du hattest keine Ruestung\n> 2. Pantheon war gefeedet\n> 3. Pantheon kann stunnen, darum konntest du nicht laufen\n> 4. Pantheons skyfall macht imensen Schaden wenn es trifft\n> 5. Du solltest dir die passive von Pantheons E Skill mal durchlesen\n\n1. schwachsinn\n2. schwachsinn Du hast meinen Beitrag gar nicht gelesen oder verstanden. Kann bei Deinem Minus-IQ natürlich auch möglich sein.\n3. Nein ich war nicht gestunnt, Depp. Ich hab selbst Pantheon und kenne seine Fähigkeiten - siehe 2.\n4. Ja Du hast auch immensen Schaden kassiert wie es aussieht.\n5. Trottel.","replies":[{"poster":"HansMowlWurf","date":"2015-02-26T10:50:33.428+0000","up_votes":1,"down_votes":0,"body":"Okay, du hast mich ueberzeugt, er hat gecheated!\nMuss ja so sein ;D\n\nZu 1.\nWieso schwachsinn? Hast du irgendein Ruestungsitem gekauft?\nNope, lieber Zerkers auf Jarvan lol\n2. Doch, er hatte zu dem Zeitpunkt schon mehrere Kills.\n3. Okay, was soll er dann gemacht haben? Du konntest nicht laufen, und Pantheon hat einen Stun. \nMhmmmmmmmmmmmmmmm er muss gecheated haben.\n4. ....\n5. Meine ich ernst, lese dir durch was Phanteon macht wenn du nur noch wenig Leben hast.\nTus doch einfach. Bzw. sage mir was passiert","replies":[]},{"poster":"Wolkenfuß","date":"2015-02-26T10:49:17.035+0000","up_votes":1,"down_votes":0,"body":"Er gibt dir eine Antwort und du beschimpfst ihn? \nDu solltest eher froh sein das sich hier keine Trolle tummeln ...","replies":[]}]}]}]}