{"poster":"Zaphrose","date":"2019-03-17T00:26:34.449+0000","title":"XXXXXX - Hunter of the Lost Order (Champion Concept)","subforum":"Concepts & Creations","up_votes":3,"down_votes":0,"body":"Markhem - The Hunter of the Lost Order\n\n> **Markhem** is a melee-fighter champion who focuses on utilizing position and attack speed to finish enemies.\n> He gains more damage on certain abilities whilst having more attack speed. \n---------------------------------------------------------------------------------------------------------------------\n\n_**His Lore**: He is part of an order that hunts abominations. Vayne is part of this order. \nThey were hunting WW but got split, and when lost, he was forced to survive amongst other abominations. \n---------------------------------------------------------------------------------------------------------------------\n\nHe wields a silver blade called Nightendale. _It obviously isn't an ordinary blade. _\nNightendale is attached to his soul and manifest this as **beads**.\nNightendale has the ability to hold blood of enemy champions in these beads.\n---------------------------------------------------------------------------------------------------------------------\n**Markhem's Kit**\n\n**Passive - Abominate Beads**\n\nMarkhem can hold a maximum of 5 beads.\nEach time an enemy is damaged by Markheme's skills an accumulated bead from his hilt teleports at their location. It becomes an object like {{champion:72}} 's passive. It carries the essence of his enemy. It last for a maximum of 7 seconds undisturbed. It can be destroyed if an an enemy champion stands inside the circle it creates for 1.5 seconds. The  Bead is destroyed even if Markhem is in the circle whilst the enemy champion is in the circle. \n\nIf Markhem is within the circle that the bead creates - his auto attack is extended and he becomes ranged for this portion.\n\nWhen this occurs his auto attacks become throwing daggers and deals his attack damage / 3 overtime\n\n**Q - Nitristastic Slash**\n\nSheaths his blade, and walks in another animation.\nIn his sheath, there is a reservoir of Nitrate. The Nitrate makes his blade lighter allowing him to swing the sword very fast until it evaporates.\nHis next auto attack has increased attack speed and deals additional magic damage equal to 12, /25, /50,/ 75 /100% of his bonus Attack Speed x His Attack.\n\n**W - Crushed Bead - Instant Consume**\nPassive - Every 25 seconds, Markhem gains an ** accumulated bead stack**. If Markhem has more beads stacks, the cooldown of this ability becomes 1s. This cooldown decreases by 1/1.5/2.0/2.5 second he attacks an enemy champion.\nEach time the bead is crushed, the buff is multiplied.\n\nActive - Markhem can crush a bead to gain increased attack speed, and attack damage for 2.5 seconds.\n \n**E - Winged Ballist **\n\nMarkhem's has raised a pet crow named _Ballist_. Markhem calls Ballist and commands him to fly to a spot and circles it, looking for the nearest enemy champion. \nOnce it has sensed a enemy champion, it storms down dealing physical damage at them and slows enemies that are damaged by 10%/15%/20%.\n\nIf an enemy isn't sensed the crow comes back directly to Markhem. When flying back, if an enemy is sensed, it storms down at them dealing physical damage but stuns enemies its damaged for 1.0s/ 1.5s/ 2.0s/ 2.5s.\n\n**R - Bloodlust / Bloodbending Slice (Ultimate)**\n\n**Passive**: Whenever Markhem consumes 5 Beads he becomes Bloodlusted. \nSimilar to Nocturnes Ult, his screen becomes hued with Red to the colours already present. When Markhem moves, he clears the colour he's moving out of to normal (red hue to the standard hue). Any enemy champion damaged while in his reddened screen receives bonus magic damage on hit. \n\n**Active**: Markhem sends a wide-triangle skill shot, and while the projectile becomes thinner it ends its damage at a point. The enemy caught at the tip of this skills range receives damage based on how long the skill has traveled. An enemy near the beginning on this skill receives very little damage. \n\nThe tip of this skill is marked by a circle. Enemies caught there receives additional damage equal to Markhem's attack speed times his attack + 5% of the target's missing health. \n\nAs this skill levels the circle at the tip of this skill decreases, but the bonus damage of the target's missing health increases.\n\n-------------------------------------------------------------------------------------------------------\nSecret Event: When {{champion:133}}  is on the opposite team... \n\n","replies":[{"poster":"Galaxyburstz","date":"2019-03-17T00:31:42.606+0000","up_votes":1,"down_votes":0,"body":"I like it but his name sounds familiar...\n\nhttps://giphy.com/gifs/leagueoflegends-3oz8xCXbQDReF34WWs","replies":[{"poster":"Zaphrose","date":"2019-03-17T00:35:12.558+0000","up_votes":2,"down_votes":0,"body":"{{sticker:zombie-brand-facepalm}} Doh.","replies":[]}]}]}