{"poster":"The One ESCANOR","date":"2019-09-23T08:38:37.713+0000","title":"Feladás premadeknél...","up_votes":2,"down_votes":1,"body":"Sziasztok !!!\n\n\nJelen esetben csak egy normal gameről beszélek de rankedon is simán előfordulhat. Adott egy  2 tagból álló premade akik a lane fázist teljesen elveszítették és látszik rajtuk hogy még ketten sem a legélesebb kések a fiókban. Nem tudnak érdemben hozzátenni a játékhoz, már-már átmegy egy kisebb trollkodás, int feedelésbe az egész. Ilyenkor a másik 3 player ( köztük én is ) nem igen van kedvünk végigjátszani a játékot mert tudjuk hogy lose lesz. \n\nIlyenkor jön az hogy oké menjen a surrender, mind a 3 solo player rá megy az igenre, de a premadek nem. Nyilván ők élvezik hogy esélyük sincs az elfeedelt enemy ellen de mégis megy az \" XD \" az all chatbe meg a hasonló dumák. Eltelik megint 3 perc és ugyanúgy ők nem mennek rá az igenre. Nyilván trollkodásból ugye...\n\nÖtlet, ami úgysem fog megvalósulni de azért leírom. Ha van a csapatunkban premade ( 2-es ), akkor elég legyen a 3 szavazat is a feladáshoz, direkt azért hogy ők ne tudják befolyásolni ha már trollkodnak.","replies":[{"poster":"T3MP3ST","date":"2019-09-23T14:48:28.724+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az a gond hogy egyértelmű vereség nincs pl : normal game betoltuk mid et és top ot is 18-20p között de volt 2 karakter ami ráált a farmra ({{champion:11}} és {{champion:18}} ) mivel itt nem haltak nagyon magas farmot összeszedtk pillanatok alatt megfordították a meccset. vagy 20x kill es irelia miezek enemy ben van egy jinx nincs nagy K/DA ja de viszont jól játszik kilép szélső ösvényle farmoli időben visszamegy nem hal nagy farm megindul vége persze megvannak azok az esetek amikor tényleg semmi esély a győzelemre pl 10-0 yasuo elfogadható farmal ugye 2q és vége. meg hasonlók . ha van olyan hős a csapatban ami erősen a késői játékszakaszra erős mint egy {{champion:41}} vagy akár {{champion:81}} nicsa az hogy nem lehet nyerni persze 3v5 nehéz de nyerhető.\nAzt akarom ezzel , hogy nem egyszer láttam fordítás 0 ról az ellenfélnél . (persze nem csak az ellenfélnél alakulhat ez ki csak egy alap játékmehenika ráálsz a farmra megy a szinted az egekbe meg a tárgyaid és akkora DMG-t tudsz kiosztanio egy team fight alaktt hogy nyerhetővé válik","replies":[{"poster":"Jack Eron","date":"2019-09-23T14:59:09.116+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az a gond, hogy van. Én is tudnék olyan meccsről beszélni, ahol az 1000+ ap-s veigarommal pont fel tudtam tpzni az enemy nexusturretjéig, és pillanatok alatt megnyertem a meccset, amit 20 perce keményen loseoltunk. Olyan is volt, hogy 4v5ben, 3v5ben nyertem.\n\nDe helyén kezeltem az ilyen szituációkat. Nem istenítettem magam, nem vontam le fals következtetéseket, úgy mint: \"minden játék nyerhető, soha ne add fel\" stb. \n\nA megfordított meccsek aránya olyan alacsony, hogy az elképesztő. Ráadásul a legtöbb ilyen helyzet pusztán a szerencsének köszönhető, annak tudható be, hogy valaki hibázott. A szerencsére pedig egy stratégiai játékban nem alapozunk. Nem fogom arra pocsékolni az időmet, hogy elmegyek farmolni, aztán \"majd lesz valami\".\n\nA magasabb elokban a legmagasabb a surrender ráta. Éppen azért, mert tudják, hogy a sose add fel szöveg szépen hangzik, de hülyeség. Csapat nélkül 99%ban veszíteni fogsz és kész. Soloban nagy ritkán hozod le, ha rendszeresen meg tudnád csinálni, akkor ez nem is lenne csapatjáték...","replies":[{"poster":"Knight Thyme","date":"2019-09-24T03:54:45.241+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mondjuk az a szint, ahol a többségünk játszik, ott bizony elég gyakran hibázik az ellenfél is.","replies":[{"poster":"Jack Eron","date":"2019-09-24T08:36:50.329+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ez igaz, de így sem lehet erre alapozni. Annyiszor megkaptam már, hogy az illető azért nem adja fel, mert \"van esélyünk\" vagy \" ő csak úgy sose adja fel\"... de ha megkérdezem, hogy mondjon egy okot, ami miatt a helyzet bármiféle reménnyel kecsegtetett, akkor sosem tudtak érdemben válaszolni. Egyszerűen abban reménykedtek, hogy majd valami úgy alakul, hogy éppen le tudjuk reagálni, az enemy meg éppen ne tudjon semmit se tenni. Magyarul a szerencsével próbál számolni. Nagyon bosszantó, amikor a 10. percnél már látszik, hogy a játék reménytelen, de képesek az illető emberek 40 percig húzni, akár úgy is, hogy már valaki kilépett, mert ehhez nem volt kedve.","replies":[{"poster":"Knight Thyme","date":"2019-09-24T09:39:09.680+0000","title":null,"up_votes":2,"down_votes":0,"body":"Mondjuk a példád egy kicsit ellentmondásosnak hangzik. Te a 10. percben eldöntötted, hogy vereség lesz, és mégis kitartottatok 40 percig. Nem esélyes, hogy ezt meg is nyerhettétek volna? \n\nValó igaz, hogy nem mindig tud az ember ésszerű indokot felhozni, csak azt, hogy tartsunk ki, hátha hibáznak annyit, hogy megfordítsuk.","replies":[{"poster":"Jack Eron","date":"2019-09-24T13:14:19.450+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem ellentmondásos, egy így van. Simán lehet defelni a turret alatt. Akármeddig ki lehet húzni egy meccset szinte, főleg, ha az enemy nem is akarja 20 perc alatt beendelni, pedig megtehetné. Még belefér néhány drake, a baron, egy kis farm, a jungle kiírtása stb.\n\nSzinte mindegyik meccsem elhúzódik eddig, gyakran még afkolva is. Attól, hogy tudjuk tartani a tornyokat egy ideig még nem tanulnak meg játszani a hülyék, és nem jön vissza a szinthátrány, de az elfeedelt enemy sem fog megállni.","replies":[{"poster":"Gresident","date":"2019-09-24T19:25:33.439+0000","title":null,"up_votes":1,"down_votes":0,"body":"Egyszerűen szörnyű a játékosok mérlegelése, hogy 30-40 killes hátránnyal sem adják fel a játékot a 15.percnél.\nEgyszerűen a legtöbb játékos nem nyerni akar, hanem játszani. (csak ez rankeden is így van)\n\nÁtlagosan 5 meccs időhúzásából simán kijön(ne) 2 újabb (legalább 20perces) játék.","replies":[{"poster":"Jack Eron","date":"2019-09-25T09:23:55.399+0000","title":null,"up_votes":1,"down_votes":0,"body":"Teljesen egyetértek. Ilyenkor mindig elgondolkodom, hogy hogy nevezheti azt játéknak, hogy elképesztő hátrányban újra és újra meghal. Mit élvez a játékban, ha sem a csapat hasznára nem tud lenni, nem tud ölni, és rendesen farmolni...","replies":[{"poster":"Knight Thyme","date":"2019-09-25T12:31:26.764+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mert egy játék nem csak az elemeiből áll. Amíg ezekre koncentrálsz, elveszíted a fő célját: szórakozás, időtöltés, kikapcsolódás. Kiragad a megszokott valóságodból és csinálsz valamit, amire fókuszálsz. Segít elfeledkezni a mindennapi problémáidról, bajaidról. Talán még az örömeidről is.\n\nBenne van a pakliban, hogy vesztesz. Nem mindenki ugyanúgy kezeli. Nem mindenki ugyanúgy ismeri fel. Nem mindenki fogadja el, hogy vereség lesz. Vannak emberek, akik képesek elkeseredetten kapaszkodni az utolsó szalmaszálba is, és küzdeni amíg ledől a nexus, mások meg már számolják vissza az időt a 15 perces feladásig a first blood után. A helyes viselkedés valahol eközött a két véglet között van.","replies":[{"poster":"Jack Eron","date":"2019-09-25T15:22:51.654+0000","title":null,"up_votes":1,"down_votes":0,"body":"És megint témánál vagyunk :D De most megpróbálom kifejtősebben megközelíteni.\n\nA szórakozás, az, hogy az ember jól érzi magát, általában együtt jár egyfajta sikerélménnyel. Ha egy játékban jól érzed magad, annak rendszerint oka van, és az a játékon belül keresendő. Egy shooter játékban általában minél többet ölsz... egy zombis játékban megy a hentelés ezerrel... a stratégiai játékokban gondolkodsz, tervezel. \n\nHa a játék célját eléred, vagy azt próbálod megvalósítani, akkor jelenik meg a fun.\n\nMinden játék célja a szórakozás, ugyanakkor a részletek is fontosak. A lol a csapatról és a logikáról kellene, hogy szóljon, mivel stratégiai játék. Ha a csapat hülyékből áll, ha nem tudok rendesen farmolni, ha vesztésre állunk, akkor szó szerint semmit sem fogok tudni csinálni, amit élvezhetnék.\n\nA feedelt enemy bárhol el fog kenni, nem fogok tudni rendesen farmolni, nem tudok majd defelni, nem tudok együttműködni a többiekkel, nem tudok ölni és kijátszani a másikat. \n\nAzért halmozom így a negatív tényezőket, mert 99%ban mindegyik egyszerre van jelen a meccseken. Már csak azért is, mert egymásból következnek. \n\nNa akkor, ezek után, ilyen helyzetekben mi a fenét csináljak? :D Szó szerint minden cselekvés, amelyet a játékban el tudok végezni, a pocsék csapatokkal egyszerűen lehetetlenné válik. Akkor mégis hogyan érezzem jól magam? \n\nA helyes viselkedés szerintem ott van, ahol megtanuljuk elfogadni a vereséget. Felfogjuk, hogy x vesztett inhib után, x kill hátrányban olyan apró a fordítás lehetősége, hogy azzal nem számolunk. A szerencsét nem kalkulálhatom bele a stratégiámba.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"ŒÇŒ","date":"2019-09-24T15:56:57.067+0000","title":null,"up_votes":1,"down_votes":0,"body":"> Az a gond hogy egyértelmű vereség nincs \n\nDe a motiváció elvesztése a játék megnyerése iránt az már valós.\nÉn a post írójának adok igazat.","replies":[{"poster":"Jack Eron","date":"2019-09-24T16:46:14.575+0000","title":null,"up_votes":1,"down_votes":0,"body":"Cáfolnám. Csinálok kisaccot és leintelek veled 10ből 10 meccset. Megnézzük, mennyi lesz win belőle :D","replies":[]}]}]},{"poster":"Knight Thyme","date":"2019-09-23T11:21:23.870+0000","title":null,"up_votes":1,"down_votes":0,"body":"De még a premade-ek se mindig értenek egyet a feladásról. Olyankor melyikük szavazata számítana?","replies":[{"poster":"The One ESCANOR","date":"2019-09-23T21:44:33.690+0000","title":null,"up_votes":1,"down_votes":1,"body":"Miért kelljen hogy a premadek szavazata számítson ilyen esetekben ? Nyomhatnak bármire lényegtelen ha a másik 3 solo player ráment az igenre.","replies":[{"poster":"Knight Thyme","date":"2019-09-24T04:05:24.689+0000","title":null,"up_votes":1,"down_votes":0,"body":"Elég sok kétséges helyzetet vet fel az ötleted. Egyfelől miért értéktelenebb egy premade-ben lévő játékos véleménye, mint a magányos farkasé? Veszélyes koncepció elvenni emberektől a szavazati jogot. Képzeld el alkalmazva a mindennapi életben: Népszavazást tartunk, de családosok nem szavazhatnak. Vagy más többségi csoport nem szavazhat, mert hát ők többen vannak.\n\nMi van, ha szarul állunk, és a ranked premade páros kezdené el a feladást megszavazni? Nem kezdhetik el, mert nincs szavazati joguk? \n\nNem vagyok biztos benne, hogy dobhat-e 2 premade párost 1 csapatba, de ha igen, akkor ott az 5. gyerek egyedül rendelkezne szavazati joggal? Ő egyedül dönti el, mikor adják fel, és a többinek szépen tűrnie kell? Képzeld el, mi van, ha pont ő a troll.\n\nMásfelől ha flexen van egy 2-es premade és egy 3-as premade, akkor egyikük se szavazhat? Nem adhatják fel?  Vagy ha van egy 3-as premade és két solo játékosuk, akkor a két solo játékos feladhatja, és a 3-as premade nem szólhat bele? \n\nMi van, ha normal játékban egyedül játszom és van velem egy 4-es premade? Én is feladhatom, nekik meg halgass a nevük?","replies":[]}]}]},{"poster":"Jack Eron","date":"2019-09-23T14:28:12.684+0000","title":null,"up_votes":1,"down_votes":0,"body":"Egyértelműen loseolt meccsnél és szimplán afk-farmolást választom, vagy a basen való rohangálást. Kismillió esetben éppen az általad említett premadek nyomnak nemre - természetesen egy brutális feed után, mondván, hogy ők \"csak a funért játszanak\". \n\nDe ott van az is, aki csak azért, mert a saját ösvényén jó volt, solo carryzni akarja a meccset, ahol nem vittünk el semmi objectivet, és 2 inhibünk is bedőlt... ha nem akarják feladni, pedig a helyzet reménytelen, akkor én nem pocsékolom velük az időmet. Még egy mezei normálon sem.","replies":[]}]}