{"poster":"Mcore Avinae","date":"2015-12-17T20:29:27.316+0000","title":"League of Legends: die aktuelle Situation","subforum":"Spielerverhalten & Moderation","embed":{"description":"Uploaded by SmD on 2015-12-17.","url":"https://www.youtube.com/watch?v=feYo71a6jl8","image":"https://i.ytimg.com/vi/feYo71a6jl8/hqdefault.jpg"},"up_votes":3,"down_votes":12,"body":"Ich denke ich bin nicht der Einzige, der denkt, dass in League of Legends etwas falsch l&auml;uft. Das hier soll aber kein QQ-Thread werden, ich m&ouml;chte einfach nur die Meinung von anderen Leuten zu diesem Thema h&ouml;ren.\r\n\r\nIch habe dem Thread ein Video von mir hinzugef&uuml;gt, welches (denke ich immerhin) die momentane Lage von League of Legends ganz gut beschreibt.\r\nNat&uuml;rlich ist (konstruktive) Kritik erw&uuml;nscht.\r\n\r\nWie gesagt w&uuml;rde ich gerne eure Meinung dazu h&ouml;ren und wie ihr denn LoL momentan wahrnehmt. Nat&uuml;rlich ist es klar, dass es Meinungsverschiedenheiten geben wird und ich w&uuml;rde den Thread hier auch nicht machen, wenn ich mir nicht 100% dar&uuml;ber im klaren w&auml;re, dass es vermutlich Leute geben wird, die andere Meinungen nicht akzeptieren.\r\n\r\nHaut in die Tasten! ;)","replies":[{"poster":"pulledchicken","date":"2015-12-17T21:27:49.672+0000","up_votes":4,"down_votes":2,"body":"du bist doch überhaupt nicht besser als diese \"FlamerKids \" !\n\nbenutzt hier eine Artikulation die überhaupt nicht ansprechend ist ... und verlangst das es ernst zu nehmen ist was du hier in dem Video sprichst ? :D #lachhaft","replies":[{"poster":"Mcore Avinae","date":"2015-12-17T21:55:01.712+0000","up_votes":2,"down_votes":4,"body":"Und warum bitte bin ich nicht besser als diese \"flamer kids\"? Ich beleidige niemanden, ich habe einfach nur nach der Meinung von anderen Leuten gefragt. Ich akzeptiere jede andere Meinung und es ist klar, dass man damit rechnen kann auf andere Meinungen zu stoßen. Gerade weil sich ja hier größtenteils Leute aufhalten die anderer Meinung sind als ich... sonst würden sie ja vermutlich nicht mehr dieses Spiel spielen bzw. das Forum besuchen. Ich habe übrigens nie gesagt, dass man mein Video ernst nehmen muss. Im Gegenteil, ich denke man bekommt relativ schnell mit, dass ich etwas übertreibe und Sarkasmus als Stilmittel verwende.\n\nMein Video lässt viel Raum für eigene Interpretation, es ist aber nicht meine Intention LoL schlecht zu machen. Ich wollte damit lediglich eine Konversation einleiten, da mich halt die Meinung anderer zu diesem Thema interessiert. Im Prinzip ist das Video nichts weiter als ... Unterhaltung.","replies":[{"poster":"Alustus","date":"2015-12-17T23:40:21.449+0000","up_votes":8,"down_votes":0,"body":"\"12 Year old faggot kids\"\nund noch einige andere Kraftausdrücke.\n\nDesweiteren ist das Video\n\n1) Einseitig\n2) An vielen stellen einfach nur Falsch\n3) Nicht objektiv\n4)widerspricht es sich.\n\nEinerseits wird gesagt blablaba nur Flamer usw, unterwegs und riot konzentriert sich nur auf die Skins und nicht auf das Verhalten.\n1 Minute später wird sich über einen Bann beschwert weil man andere Beschimpft hat.\n\nDas ist wie zu sagen die ganzen ausländer sind Sozialschmarotzer und gehen nicht arbeiten um dannach zu sagen sie nehmen die ganzen Arbeitsplätze weg.\n\nAußerdem solltest du wissen das Riot viel mehr gegen Toxisches verhalten als jedes andere Spiel unternimmt.\nDesweiteren wurden alleine die letzte season einige neuerungen in diesem Bereich eingeführt.\n\nDer Punkt mit der Balance;\n\nAuf den worlds wurden 70 verschiedene Champions gespielt, und im professionellen bereich reichen schon kleine unterschiede bei Champs damit diese out of Meta sind bzw. schlecht Spielbar.\nSprich es müssen min. 70 champions zumindest beinahe gleich stark gewesen sein.\nin der SoloQ sieht das aber wieder anders aus, da waren sicher ca. 110 Champions gut und erfolgreich spielbar ohne es sich richtig schwer zu machen.\n\nMomentan ist das evt. ein bisschen anders ich kann es nicht sagen, wird man im nächsten Split sehen., aber man sollte auch bedenken das wir in der Preseason sind und es eine menge neuerungen gab welche jeden der 130 champions individuell beeinflussen.\nUm das ganze fair zu machen bedarf es an Zeit (weshalb es die Pre Season gibt), die letzten 2 Pacthes haben da schon eine menge verbessert und die nächsten 2 werden das ganze wieder \"fairer\" machen.\n\n\nAchja ich habe schon eine Mengegeld in dieses Spiel gesteckt bin aber weder 12 Jahre alt noch habe ich das Taschengeld verwendet noch die Kreditkarte meiner Eltern.\nIch habe alles selber aus dem Geld welches ich selber verdient habe bezahlt.\n\nDa gibt es viele andere Spiele die das Geld viel mehr aus den taschen rausziehen.\n\nBeispiele:\n\nLast Chaos \nMetin 2\nund viele weitere MMORPGs.\n\nDie ganzen Mobilspiele welche Pay2Win sind.\n\nViele EA spiele wo es 30 DLCs gibt für ein paar neue inhalte  wo Preis Leistung  absurd ist.\n\nIch könnte sicher 100 Spiele aufzählen welche geldgeiler , verbuggter, unfairer sind als LoL.\n\n\n\n\n\nZum Thema Community usw.\n\nDas Verhalten ingame hat sich in meinen Augen tatsächlich gebessert nicht verschlechtert.","replies":[]}]}]},{"poster":"hshtagniemehrcdu","date":"2015-12-17T22:23:10.840+0000","up_votes":5,"down_votes":1,"body":"Typisches \"Pöses Pöses Riot wollen Geld machen, diese Kapitalisten\"\n\nDas traurige daran ist, ich glaube du meinst das hier echt ernst, und nicht ironisch wie du behauptest.","replies":[{"poster":"Mcore Avinae","date":"2015-12-17T22:34:58.376+0000","up_votes":1,"down_votes":4,"body":"Teilweise meine ich es ernst. Mir ist halt einfach die negative Entwicklung von LoL aufgefallen (kann auch sein, dass ich mir das nur einbilde à la \"früher war alles so viel besser\")\n\nDas was ich in dem Video anspreche ist offensichtlich sehr übertrieben. Natürlich gibt es nicht nur negative Veränderungen und ich schätze Riots Engagement auch sehr (die \"neue\" Map sieht extrem gut aus, das Spiel ist aus technischer Sicht sehr gut optimiert, game crashes kommen seltener vor uvm.)\n\nEs ist offensichtlich, dass ein Free to play game irgendwie Geld einnehmen muss um zu überleben und dagegen habe ich auch überhaupt nicht auszusetzen, da man ja nicht dazu gezwungen wird Geld auszugeben, wenn man es nicht möchte.\n\nIch denke durch die immense Anzahl von QQ Threads die es hier im Forum gibt, wird man schon automatisch von Anfang an etwas skeptisch angeschaut wenn man so einen Thread verfasst. Gerade da mein Video halt auch sehr viel Raum für eigene Interpretation lässt und ich schon ziemlich übertreibe.","replies":[{"poster":"Metalmonni","date":"2015-12-18T10:58:12.095+0000","up_votes":4,"down_votes":0,"body":"Ich schlage dir folgendes vor: \n\nWenn du die Balance momemtan so schrecklich findest und früher alles besser war, dann lad dir auf einschlägigen Seiten noch nochmal den Patch von, sagen wir, der Preseason 3 runter und spiel mit ein paar Kumpels nochmal ne Runde League of Cleaver, weil's damals so schön war. \n\nLeague war immer schon zeitweise unbalanced, gerade in der Preseason. Das war immer schon so und ich heute nicht schlimmer als vorher. \n\nAbgesehen davon, merkt man deinem Video überall an, dass du keine Ahnung von dem Zeug hast, von dem du da sprichst. Das äussert sich dann an einigen Stellen, an denen du dir selbst wiedersprichst oder einfach falsche Informationen verbreitest (Mitarbeiter bei Riot machen lieber neue Skins anstatt die Community weniger toxisch zu bekommen. Oh Mist, ich wurde gebannt.).","replies":[]}]}]},{"poster":"Dotiaen","date":"2015-12-21T12:35:40.244+0000","up_votes":2,"down_votes":3,"body":"***","replies":[{"poster":"Metalmonni","date":"2015-12-21T13:06:51.736+0000","up_votes":3,"down_votes":0,"body":"Ich bin tatsächlich nicht sicher, wieso wir deiner Meinung nach das Video alle toll finden sollen und kein Wort dagegen sagen dürfen nur weil es \"zur Unterhaltung\" dient.\nVerbietest du auch Filmkritiken? Findest du die unmoralisch, weil jemand etwas bewertet, das \"nur zur Unterhaltung\" geschaffen wurde? \nWas ist mit tödlichen Arenakämpfen, wie es sie früher und vereinzelt sogar heute noch in Diktatorstaaten gibt? Die dien(t)en auch der Unterhaltung, muss ich sie deshalb gut finden?\n\nFakt ist: Der TE hat sein Video hier reingestellt und hat um unsere Meinungen gebeten. \n\nUnd du stellst dich hier hin, beleidigst uns als \"schlimmer als der Holocaust\" und willst uns mit diesen Mitteln befehlen, ja nur gut zu urteilen? Jede Kritik zu unterlassen? Vielleicht solltest du noch einmal nachlesen, was der Zweck eines Diskussionsforums ist.","replies":[]}]},{"poster":"Enderized","date":"2015-12-17T20:51:08.358+0000","up_votes":2,"down_votes":1,"body":"Also bis auf die Tatsache, dass das Video einfach zu einseitig ist, finde ich die Darstellungsweise und die Sätze ganz amüsant x)","replies":[{"poster":"Mcore Avinae","date":"2015-12-17T20:58:10.760+0000","up_votes":2,"down_votes":2,"body":"Hört man gerne. :D","replies":[]}]},{"poster":"IIIPinkGuyZedIII","date":"2015-12-17T20:45:07.201+0000","up_votes":2,"down_votes":1,"body":"Ich finde es ist nicht schlimm das Riot geld durcg skins verdient man sollte froh sein dass lol umsonst ist dafür dass es so ein gutes game ist. Zur Meta da es so viele champs gibt ist balancing ein sehr schweres Thema und Riot tut ihr bestmöglichstest um das zu erreichen.\nWenn es um diese 12 jährigen(auch geistlich nicht nur Körperlich) man kann nur reporten und mehr nicht dass ist jedoch fair und wenn man gebannt wird hat man dies meist sich selbst zuzuschreiben auch wenn man soviel Geld bezahlt macht es nicht wieder gut wie man andere Spieler behandelt hat.\nEin Kritikpunkt den ich wiederrum nennen möchte ist das was auch im Video angesprochen wurde nämlich das ARAM Dominion und 3vs3 sehr im Hintergrund stehen ein Visual rework für die Map wäre zwar nicht von Nöten aber ein Anfang^^.\nIm großen und ganzen habe ich nicht soviel an RIOT zu kritisieren sie tun ihr bestes um uns Gamern ein kostenloses Spiel so gut zu gestalten. \nGJ Riot macht weiter so^^\n(wer keine lust auf doofe Randomes hat sollte sich vllt mehr als 10-12 premades zulegen und mit Leuten Spaß haben die man kennt^~^)","replies":[]},{"poster":"Zulwar","date":"2015-12-18T08:25:34.297+0000","up_votes":1,"down_votes":0,"body":"Also derzeit fühle ich mich in Season 1 und 2 zurück versetzt, was ich persönlich ziemlich gut finde, aber mit dem unterschied das es weniger Flamer und AFK'ler gibt und die Server verfügbarer sind.\nMir fällt jetzt grade mal auf, das ich garnicht weiß, wann ich das letzte mal in einer Einlogwarteschlange steckte.","replies":[]},{"poster":"Metalmonni","date":"2015-12-18T00:45:58.764+0000","up_votes":1,"down_votes":0,"body":"Nehme lol momentan wie folgt wahr:\n\nDie Preseason bringt firsichen Wind rein. Gefällt mir teilweise, einige Sachen finde ich zu unbalanced. \nMir gefällt, dass das instant Feedback System seit seiner Einführung den Ton in meinen Games signifikant verbessert hat, auch Leaver haben abgenommen. Von daher entwickelt sich lol meiner Meinung nach positiv. \n\nIch finde es nur schade, dass lol von manchen spieler als League of %%%%%% bezeichnet wird...","replies":[]},{"poster":"RagoIé","date":"2015-12-17T22:14:58.838+0000","up_votes":1,"down_votes":0,"body":"Ich glaub dazu muss man nichts sagen. Wenn dir das Spiel nicht gefällt, warum befasst du dich dann überhaupt damit?\nUnd zu der Sache mit den Skins. Wie bitte schön soll ein Kostenloses Spiel überleben ohne Einnahme quelle? \nSollen sie nach jedem Game ne 5 minuten Werbung einblenden? \n\nUnd klar sind ein paar champs immer op aber wofür sind den bitteschön bans da? Das alle champion gleich stark sind geht einfach nicht außer es gibt nur einen champion im game.\nZu der Schreibweise kannste dir denken was du willst.","replies":[]}]}