{"poster":"Gragas Bot ","date":"2017-10-14T01:41:53.416+0000","title":"¿Creen que es justo?","subforum":"Comportamiento del jugador","up_votes":5,"down_votes":4,"body":"Dios santisimo mio me tiene aburrido el sistema de retro alimentacion no sirve para nada. en la partida anterior estaba jugando yasuo y gane mid contra una ahri se fue afk rage quit e de suponer y el team enemigo de la nada me empezo a insultar admito que los moleste pero en ni un solo momento los insulte  como ellos lo hicieron. tratandome de manco por usar a yasuo y con muchos insultos que no dire y al ganar la partida dijieron todos reporten a yasuo por flamer y manco de mier** y yo quede como que y no hice caso a su amenaza diciendoles yo de mi parte que no me importaba su report porque yo no flamee en ningun momento en la partida cuando me meto a jugar otra partida me doy cuenta que tenia el chat restrinjido y nisiquiera me avisaron en serio ya me tiene aburrido que porque son mayoria quienes te reportan o premades te tengan que castigar es una verdadera pena que los flamers sigan sueltos y quien me va a responder por el mal rato que pase nadie y quien me va a subir el nivel de honor que perdi a causa de esos flamers nadie alguna respuesta riot ? nunca {{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Chimmyillegirl","date":"2017-10-14T04:04:59.793+0000","up_votes":2,"down_votes":0,"body":"Si no hiciste nada malo en la partida, como tener una actitud negativa, acosar o abusar verbalmente de alguien, pues el reporte no es válido. Ahora si hiciste algo de lo antes mencionado, la sanción está bien dada.\n{{sticker:sg-lulu}}","replies":[{"poster":"Gragas Bot ","date":"2017-10-14T21:36:24.304+0000","up_votes":1,"down_votes":0,"body":"Lo maximo a un insulto que dije fue \"que paja\"\ny eso nomas xd","replies":[{"poster":"Chimmyillegirl","date":"2017-10-15T02:08:44.868+0000","up_votes":2,"down_votes":0,"body":"Las sanciones no son solo por insultos, puedes acosar verbalmente a un jugador sin necesidad de insultos de por medio, lo mismo con la actitud negativa.","replies":[]}]}]},{"poster":"Fan de ZZK","date":"2017-10-14T01:44:26.949+0000","up_votes":2,"down_votes":0,"body":"vas al support y pedis el email donde dice los motivos de tu ban, y te vas a dar cuenta que no te banean por flamear un solo game, esto viene hace rato seguro","replies":[{"poster":"Gragas Bot ","date":"2017-10-14T01:47:22.061+0000","up_votes":1,"down_votes":1,"body":"En eso te puedo decir que es mentira yo cambie mi comportamiento hace mucho rato y no te miento al decirte que no insulte  a nadie solo me banean el chat por culpa de gente que se te acopla para reportarte {{sticker:sg-shisa}}","replies":[{"poster":"Fan de ZZK","date":"2017-10-14T01:50:21.849+0000","up_votes":1,"down_votes":0,"body":"vas al support y pedis tu caso, vas a ver que te equivocas, no banean a la gente porque si","replies":[]}]}]},{"poster":"RedKi","date":"2017-10-15T17:29:07.058+0000","up_votes":1,"down_votes":0,"body":"\"admito que los moleste\" Hasta vos lo admitiste, fuiste tóxico, no es solo insultar. Además, los reportes falsos no tienen validez, primero se fijan el chat y después es el ban, así que te recomiendo que no hables, porque la próxima es ban de 14 días o permanente ;).\nPd: A ellos también les va a llegar el ban, tranqui. ;)","replies":[]},{"poster":"Mazer Rakham","date":"2017-10-14T03:26:54.204+0000","up_votes":1,"down_votes":0,"body":"Punto 1: Molestar es ser tóxico y motivo de ban. Por algo te dan la opción que incluye \"molestia\"\nPunto 2: Los reportes falsos no son tomados en cuenta. \nPunto 3: Los reportes de premade tienen menos peso.\nPunto 4: No te banean por una sola partida, por ende, venís acumulando reportes justificados hace rato.","replies":[{"poster":"Gragas Bot ","date":"2017-10-14T21:36:55.144+0000","up_votes":1,"down_votes":0,"body":"No me supe explicar bien no eran premades me referi a que se acoplaron para reportarme","replies":[{"poster":"Mazer Rakham","date":"2017-10-14T21:39:14.136+0000","up_votes":1,"down_votes":0,"body":"De una forma u otra, no anula lo demás. Molestar es una actitud tóxica, los reportes falsos no cuentan y no te sancionan por una sola partida, sino que vienes acumulando reportes justificados hace rato. El único caso en que banean por una sola partida es por algo extremo: amenazas de muerte, xenofobia, etc.","replies":[]}]},{"poster":"ZXDAXZ","date":"2017-10-14T03:49:49.873+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mazer Rakham,realm=LAS,application-id=PJAKt7ph,discussion-id=hYHAl29x,comment-id=0001,timestamp=2017-10-14T03:26:54.204+0000)\n>\n> Punto 1: Molestar es ser tóxico y motivo de ban. Por algo te dan la opción que incluye &quot;molestia&quot;\n> Punto 2: Los reportes falsos no son tomados en cuenta. \n> Punto 3: Los reportes de premade tienen menos peso.\n> Punto 4: No te banean por una sola partida, por ende, venís acumulando reportes justificados hace rato.\n\n{{sticker:slayer-pantheon-rainbows}} {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}