{"poster":"Yung Bianca","date":"2017-05-13T10:46:51.194+0000","title":"Yasuo hat mich verändert","subforum":"Champions & Gameplay","up_votes":11,"down_votes":8,"body":"Ich hab gemerkt, nachdem ich Yasuo mal in einem Normal ausprobiert hab, dass sich irgendwas ver&auml;ndert hat. Irgendwie geht es mir seitdem ein bisschen komisch, ich bin sensibler, will einfach nichts mehr mit anderen zu tun haben und weitere. Ich hab das mal gegoogelt und raus kam, dass dies autistische Z&uuml;ge sind. Ich hab jetzt Angst, weil ich schon oft bemerkt hab das andere Yasuo-spieler ebenfalls autistische Merkmale aufweisen, teilweise sogar sehr stark ausgepr&auml;gt. Ich hab jetzt Angst, dass sich der Autismus ausbreitet. Wird es sich nicht weiter verschlimmern, wenn ich ab jetzt nie wieder Yasuo spiele? Kann Yasuo die volle form Form von Autismus ausl&ouml;sen? BItte ehrliche antworten, vor allem von Yasuo mains. Danke im Vorraus!","replies":[{"poster":"Kaito","date":"2017-05-13T10:59:57.788+0000","up_votes":5,"down_votes":3,"body":"Manchmal frage ich mich, ob Leute sowas ernst meinen, oder einfach nur ein verdammt schlechter Troll sein soll...","replies":[{"poster":"Yung Bianca","date":"2017-05-13T11:08:15.507+0000","up_votes":6,"down_votes":0,"body":"Wieso sollte ich das nicht Ernst meinen?","replies":[]}]},{"poster":"Shadir","date":"2017-05-13T10:54:59.947+0000","up_votes":6,"down_votes":0,"body":"Keine Sorge das wird nur schwesterlicherseits genetisch weitergegeben.","replies":[]},{"poster":"Radieschen","date":"2017-05-13T11:11:01.932+0000","up_votes":4,"down_votes":0,"body":"Ich merke auch bei vielen Yasuo Spielern, dass sie merkwürdig sind und auch autistische Züge zeigen. Ich bin mir aber nicht sicher ob das wirklich stimmt.","replies":[]},{"poster":"ITSNUTRONZ","date":"2017-05-13T23:22:52.386+0000","up_votes":3,"down_votes":0,"body":"Ich muss dir leider sagen....\ndu bist einer von uns\nja es ist wie ne droge wer einmal drin ist kommt nie wieder raus\n\naus einer probe wurde jede woche\njede woche schnell zu jeden tag\nund aufeinmal spielst du ununterbrochen wirst süchtig und die sucht führt zu ein Yasuo main","replies":[{"poster":"Yung Bianca","date":"2017-05-14T00:45:11.193+0000","up_votes":1,"down_votes":0,"body":"kann man dagegen was tun?","replies":[{"poster":"ITSNUTRONZ","date":"2017-05-14T09:30:25.237+0000","up_votes":2,"down_votes":0,"body":"es ist eine spezielle formel\n\nes kann sein das du es nicht überleben wirst aber du hast wohl keine andere chance mehr....\n\ndu muss  azir spielen {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]},{"poster":"Μarkus Söder","date":"2017-05-13T11:14:52.051+0000","up_votes":3,"down_votes":0,"body":"Ist mir tatsächlich auch schon des öfteren aufgefallen. Eigentlich klingt das ja nach Blödsinn, aber ich glaube das könnte tatsächlich stimmen.","replies":[]},{"poster":"Ø Try Ø Eshyne","date":"2017-05-13T18:36:40.302+0000","up_votes":4,"down_votes":1,"body":"Gewerte Herren,\n\nich bin hier durch Zufall hergekommen, wird aber dennoch wahrscheinlich Schicksal sein..\n Also ich bin selber yasuo main seit  ein paar seasons und wie du an meinem Ingame-Nickname\"Ive got autism\" erkennen kannst, hab ich selber auch gemerkt, dass yasuo spielen mich sowohl im Lol spiel als auch in sozialer Verhaltensweisen verändert hat{{item:3031}} \nAnfangs war ich mir dies garnicht bewusst, doch seit einem halben Jahr merke ich selber meine \"Autistischen Merkmale\" (lul)\nNaja ich benehm ich irgendwie auch meistens geistig behindert im Sinne von: wenn ein kleiner Fehler passiert, schmeiß ich das Tuch und geb auf, oder ich bin sehr zickig und sensibel.\n\nDas dir das gleich nachdem ersten Game aufgefallen ist, kann ich nicht erötern. Wie gesagt bei mir hab ich es erst nach ein paar Jahren gemerkt, dennoch würde ich nicht sagen ich bin \"Autist\", weiße jedoch \"autistische Merkmale\" auf (lel) .\n\nLeider gibt es in der Lol-Community viele, die \"Autisten\" verachten, sogar deren Lebenssinn in Frage stellen {{champion:32}} {{item:3070}} \n\nDoch ich hoffe, dass Spieler zukünftig mehr Rücksicht auf autistische yasuo mains nehmen.","replies":[{"poster":"kuchenbro","date":"2017-05-13T19:46:16.426+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ive got autism,realm=EUW,application-id=Wj1wcocU,discussion-id=vyiycbwO,comment-id=0009,timestamp=2017-05-13T18:36:40.302+0000)\n>\n> Gewerte Herren,\n> \n> ich bin hier durch Zufall hergekommen, wird aber dennoch wahrscheinlich Schicksal sein..\n>  Also ich bin selber yasuo main seit  ein paar seasons und wie du an meinem Ingame-Nickname&quot;Ive got autism&quot; erkennen kannst, hab ich selber auch gemerkt, dass yasuo spielen mich sowohl im Lol spiel als auch in sozialer Verhaltensweisen verändert hat{{item:3031}} \n> Anfangs war ich mir dies garnicht bewusst, doch seit einem halben Jahr merke ich selber meine &quot;Autistischen Merkmale&quot; (lul)\n> Naja ich benehm ich irgendwie auch meistens geistig behindert im Sinne von: wenn ein kleiner Fehler passiert, schmeiß ich das Tuch und geb auf, oder ich bin sehr zickig und sensibel.\n> \n> Das dir das gleich nachdem ersten Game aufgefallen ist, kann ich nicht erötern. Wie gesagt bei mir hab ich es erst nach ein paar Jahren gemerkt, dennoch würde ich nicht sagen ich bin &quot;Autist&quot;, weiße jedoch &quot;autistische Merkmale&quot; auf (lel) .\n> \n> Leider gibt es in der Lol-Community viele, die &quot;Autisten&quot; verachten, sogar deren Lebenssinn in Frage stellen {{champion:32}} {{item:3070}} \n> \n> Doch ich hoffe, dass Spieler zukünftig mehr Rücksicht auf autistische yasuo mains nehmen.\n\nRiot erwähnt doch schon die Yasuo Mains einzeln (Liebe Mitbeschwörer und Yasuo Mains :D) um Bedürfnisse als Autist zu befriedigen","replies":[]},{"poster":"Yung Bianca","date":"2017-05-14T00:44:44.861+0000","up_votes":1,"down_votes":0,"body":"Das bestätigt meinen Verdacht dann in Teilen, ich danke dir für deine ehrliche Antwort als Yasuo-spieler.","replies":[]},{"poster":"Bayonetta38","date":"2017-05-15T07:03:43.632+0000","up_votes":1,"down_votes":1,"body":"Echt nicht. Nur weil du wegen einem nutzlosen Champs Stimmungsschwankungen wie eine hochschwangere Frau hast werde ich nicht einfach rumsitzen und warten bis so ein Yasuo zu Tode feedet damit ich meine hartverdienten LPs wieder verlieren kann nur weil  da ein Yasuo seine Probleme nicht in Griff bekommt? \nSry aber wenn ihr mit so einem nutzlosen Champ nicht umgehen könnt dann lasst es. Ansonsten werden die Yasuos in diesem Spiel immer gehatet bleiben","replies":[]}]},{"poster":"Abasin","date":"2017-05-18T06:54:41.132+0000","up_votes":2,"down_votes":0,"body":"Hi, ich hab das auch schon an mir bemerkt. Aber nicht wegen Yasuo, gegen den bin ich immun. Bei mir ist es Malphite. Wenn ich durch die Strassen gehe, richte ich seit kurzer Zeit mein Augenmerk vermehrt auf die Beschaffenheit der Wege und Parks. Ich schliesse Freundschaften mit Grenzsteinen und Denkmälern. Ich führe Findlinge zusammen. Kohlenstoffbasierten Lebensformen gegenüber bin ich sehr misstrauisch geworden, besonders wenn sie Hammer und Meissel dabei haben. Ich frage mich auch manchmal, was passiert, wenn ich einfach aus Spass mal in eine kleine Menschenmenge reinrenne. \nIch habe eindeutig die nächste Ebene der Transzendenz erreicht, genau wie Du durch Yasuo. Also keine Sorge, Du bist nicht autistisch.","replies":[]},{"poster":"Stichsaege","date":"2017-05-14T09:55:15.012+0000","up_votes":2,"down_votes":0,"body":"Autismus ist was total anders.\n\nAutismus ist eine Störung des Neuronales Netz wo durch manche Fähigkeiten stark verbessert sind und andere komplett unterentwickelt sind.\n\nBei {{champion:157}}  Spiel könnte man er von Persönlichkeitsstörung reden, wie Arroganz.","replies":[]},{"poster":"Ljnk","date":"2017-05-13T17:18:43.233+0000","up_votes":2,"down_votes":0,"body":"Ja, ich glaube, dass Yasuo Autismus auslösen kann, aber Yasuo ist nicht die Ursache. Der Autismus war vorher schon in dir drin. Spiel einfach jedes Game Yasuo und geh 0/12, das passt schon so. Wir wissen dann Bescheid, dass du ein Autist bist und akzeptieren dich trotzdem, du Autist.","replies":[{"poster":"Yung Bianca","date":"2017-05-14T00:46:29.069+0000","up_votes":1,"down_votes":0,"body":"ja meine durchschnitts k/d liegt bei 0/14,7, aber leider sind nicht alle so tolerant wie du :(","replies":[{"poster":"Bayonetta38","date":"2017-05-15T07:07:45.217+0000","up_votes":1,"down_votes":1,"body":"Dann Spiel den Champ nicht. Was habt ihr davon ein Game zu spielen wo ihr 0/14 steht? Ehy da bin ich ja sogar als Soraka auf der Top gegen einen Trynda besser.\nWarum soll ich tolerant gegenüber Leuten sein die ebenfalls 0 Toleranz zu meinem hart verdienten LPs hat? Ich sehe es nicht ein nur weil ihr meint ihr \"könnt nur\" diesen Champ spielen( merkt man dann an eurer Kda wie gut ihr in könnt) das ich deshal verliere. Es gibt über 120 Champs und ihr wählt ausgerechnet diesen Lebensvirus aus. Spielt von mir aus sogar Urgot auf AP anstatt des.","replies":[]}]}]},{"poster":"Samus Saran","date":"2017-05-13T15:58:06.726+0000","up_votes":2,"down_votes":0,"body":"Ist leider so, habe dieses Verhalten auch bemerkt bei den Yasuo Mains.\nKönnen wir denen iwie helfen oder ist das unheilbar?","replies":[]},{"poster":"Kind Prow","date":"2017-05-13T15:53:52.815+0000","up_votes":2,"down_votes":0,"body":"Auf Wikipedia steht, trotz umfangreicher Forschungen konnte die Ursache für Autismus bisher nicht festgestellt werden (Heil Wikipedia). \n\nAlso mein Freund, du bist ein Held, du hast endlich den Grund für die Erkrankung Autismus gefunden!","replies":[{"poster":"Yung Bianca","date":"2017-05-14T00:46:51.016+0000","up_votes":1,"down_votes":0,"body":"supi!","replies":[]}]},{"poster":"whysoserious765","date":"2017-05-13T11:17:30.416+0000","up_votes":3,"down_votes":1,"body":"Also nach dem was ich bisher bemerkt hab, stimmt das wirklich. Yasuo-spieler (insbesondere Yasuo mains) neigen echt zu seltsamen Verhaltensweisen und benehmen sich als ob sie geistig behindert wären.","replies":[]},{"poster":"Bayonetta38","date":"2017-05-15T07:25:09.303+0000","up_votes":1,"down_votes":0,"body":"Ich sage es dir mal so: Dieser Champ kam doch ungefähr Season 4 oder anfang Season 5 raus? Damals dachte ich mir : Hmm sieht intressant aus. Bisher gab es sowas nicht durch Minions fliegen oder eine Ulti wozu jemand in der Luft sein musste. \nIch habe den 2 bis 3 Mal glaub ausprobiert und war immer recht gut (1. 5/0, 2. 7/4, 3. 6/6) habe aber währenddessen gemerkt dieser Champ ist einfach nur Disrespekt und dazu noch verführt er einen dazu mehr und immer mehr zu wollen. Ich wusste danach sofort nein sowas spiele ich nicht. Als dann auch noch diese ganzen MöchtegernPros ins Spiel kamen und nur Yasuo gespielt haben habe ich förmlich ein Hass auf diesen Champ bekommen. Jedes Game wo dieser Champ ist: Lose, Lose und noch mehr Lose. Diese Kinder denken wenn die sofort ihre ersten gewonnen EPs die sie mit Yis, Garens und Teemos machen weil sie diese recht gut spielen können das sie dasselbe machen können mit Yasuo. Dazu verleitet dieser Champ einen, egal wie schlecht man ist (0/13) immer reinzugehen weil diese E macht für die 5 Mio Dmg und die Q ist direkt ein K.O. Skill. Nun der krönende Abschluss haha. Den finde ich immer so genial gilt auch für sie Leesin Mains. \nSobald sie diesen Wirbelsturm aus Glück sowie bei Lee die Q treffen heißt es auf jedenfall reingehen. Das ist dann ein Freekill xD. Egal ob der Getroffene ein Full Build Feed Gegner ist oder das ganze gegnerische Team: Reingehen muss man immer xD.\nDu bist echt der erste YasuoMain der wirklich Einsicht zeigt. Du hast selber gemerkt was dieser Müll genannt Yasuo aus dir macht. Sei so gut und lass es mit diesen Champ gutsein, wenigstens für die Ranks. Es muss nicht sein das andere wegen solchen Champs verlieren müssen. Nein\nIch als SuppMain dazunoch kann in den meisten Fällen dann nichts mehr ausrichten und muss mich auch einfach meinem Schicksal ergeben weil der Midlaner oder Toplaner sich keinen besseren Champ aussuchen konnte............","replies":[]},{"poster":"Itsupiki Ôkami","date":"2017-05-14T07:51:05.360+0000","up_votes":1,"down_votes":0,"body":"Ok, Mal im voraus: ich bin selber kein Yasuo Main und habe ihn auch erst eine hand voll spiele gespielt weil ich ihn Prinzipiell boykottiere aber das ist ja nicht Thema des posts.\n\nIch habe seitdem es Yasuo gibt in wohl mindestens 500 games Mit oder gegen Yasuo gespielt und habe bei sehr vielen von ihnen auch die Erfahrung gemacht, dass sie sich (ähnlich wie Riven mains) irgendwie anders verhalten. Ich hab das meistens einfach darauf geschoben, dass Yasuo von Riot als einer der schwersten  Champions des Spiels gehandelt wird und sie einfach nur ungesund  stolz drauf  m sind ihn einigermaßen zu beherrschen aber darüber nachdenke haben die meisten von ihnen zwei Gemeinsamkeiten: 1. Fast alle Yasuo Mains (und ich spreche jetzt speziell von den Mains) haben einen extrem Ignoranten und auf sich selbst (und nicht auf das Team) fokussierten playstyle und 2. Ich habe bis jetzt keinen Yasuo in der Low ELO erlebt, der nicht unendlich toxic war wenn einer der anderen die Lane verloren hat. Der einzige den ich kenne der Yasuo Maint und die Züge nicht aufweist ist ein Freund von mir der in high Diamond spielt.\n\nIch weiß nicht was man dabei machen kann aber ich habe die Erfahrung nicht gemacht als ich ihn gespielt habe. Vielleicht schirmt mich ja auch meine Abneigung von diesem Champ Davon ab.\n\nIch denke das einzige, was in so einem Fall hilft und einen nicht gleich dazu bringt das Spiel komplett zu Quitten ist ihn \"einfach\" nicht mehr zu spielen. Ich selbst habe damals (in season 2 glaube ich, 2 Wochen nach dem Darius Release) eine ähnliche Erfahrungen mit Darius gemacht und es hat mir definitiv geholfen ihn nicht mehr zu spielen.\n\nIch hoffe ich konnte zumindest ein bisschen helfen.\n\nLG\nHuntingFighter","replies":[]},{"poster":"Juliènco","date":"2017-05-13T13:29:03.841+0000","up_votes":1,"down_votes":0,"body":"Ich an deiner Stelle würde sofort aufhören Yasuo zu spielen, denn nachdem was ich so gesehen habe zeigen die meisten Yasuo Spieler tatsächlich autistische Züge und bei manchen ist das, wie du das schon gesagt hast, sehr stark ausgeprägt.","replies":[]},{"poster":"denjo11","date":"2017-05-17T19:52:50.817+0000","up_votes":1,"down_votes":1,"body":"Hallo Yung Bianca.... und andere Yasou-mains!\n\nIch bin kein Yasou-Main, aber im medizinischen Bereich tätig.\nWie bereits weiter unten erwähnt, ist die Ursache von Autismus nicht bekannt. Was man weiß ist, dass der \"Filter\" zwischen Unterbewußtsein und  Bewußtsein nicht \"richtig funktioniert\", so dass Autisten in ihrem bewußtsein zu viele Daten verarbeiten müssen und deswegen schnell reizüberflutet sind. ich denke, du kannst ausschließen, dass das was mit Yasou-spielen zu tun hat. Das was du an dir bemerkst, hat vermutlich mit etwas anderem zu tun. Vermutlich bist du einfach enbenfalls reizüberflutet,.... dass kann schon mal passieren wenn man zu viel zockt. Wenn deine Augen immer auf kurze distanz eingestellt sind, dann bedeutet dass für deinen Körper Stress. \nSpiele weniger, und wenn mache Pausen, in denen du ganz vom Rechner weg bist. Zumindest aber lasse den Blick immer wieder aus dem Fenster in die Ferne schweifen. Sorge für Zeiten der Regeneration und  Zeiten die Reizarm sind. Und dann schau mal, ob sich das was du an dir beobachtet hast verändert.\n\nWillst du genaueres Wissen, dann konsultiere einen Arzt.\n\nAlles Gute,\n\ndenjo11","replies":[]}]}