{"poster":"Alira","date":"2017-02-16T08:35:01.836+0000","title":"Die Community von LoL","subforum":"Allgemeiner Chat","up_votes":4,"down_votes":8,"body":"Sicherlich gilt dies nicht ausnahmslos f&uuml;r alle Spieler der League of Legends Community, dennoch aber f&uuml;r einen Gro&szlig;teil. Auch wenn die permanent gebannte Spieler Quote nur bei wenigen Prozent liegt verdienen diese Strafe doch weitaus mehr. Ich hasse die Community von LoL und doch liebe ich das Spiel. Kein Wunder, dass viele Spieler in diesem Spiel flamen, afk gehen oder mit Absicht das Spiel sabotieren. Wenn man geflamed wird, weil man oft stirbt oder einen Champion das erste Mal spielt. Kein Wunder, dass dann das Spiel auch keinen Spa&szlig; mehr macht und man seinen Teammates den Sieg nicht mehr g&ouml;nnt. Warum auch? Warum sollte jemand, der sich so daneben benimmt einen Sieg verdient haben? Warum darf ein solcher Spieler &uuml;berhaupt so ein Spiel spielen? Es ist ein MMO also trifft man auf viele Menschen! Also muss man sich auch respektvoll benehmen. Und da kann der Mute des Chats nicht die universale L&ouml;sung sein. Der Fehler liegt ganz klar bei Riot, dass nicht im ausreichenden Ma&szlig;e gegen solche Vergehen vorgeht!\r\nIch hasse die League of Legends Community, da sie zum gr&ouml;&szlig;ten Teil nur aus hirnamputierten Vollidioten besteht, die meinen, sie w&auml;ren der King und w&uuml;ssten alles &uuml;ber das Game. Es ist langweilig und frustrierend mit solchen Menschen zusammen spielen zu m&uuml;ssen und erschwert jedem Spieler das Spiel. Warum wird man f&uuml;r&acute;s Feeden geflamed? Kann nicht jeder Mal ein schlechtes Spiel haben? Kann man nicht mal einen Fehler machen? Ob im ARAM, Normal, Ranking oder 3 v 3 - &uuml;berall in LoL wird geflamed was das Zeug h&auml;lt. Was das Riot Team aber nicht sieht sind Verbesserungen am Verhalten eines Spielers. Man kann nicht von einer Nacht auf die andere zu einem friedvollen Spieler werden, sowas ist ein Prozess, aber man kann sehen, dass die Zahl an Spielen mit negativem Verhalten abnimmt. Sowas sollte zumindest in einer kleinen Form belohnt werden, zum Beispiel durch eine Bemerkung (Gut so! Weiter so!). Wie dem auch sei, Spieler, die in ein Spiel kommen um die Lane zu stehlen, zu sabotieren und zu flamen, die sollten gebannt werden und zwar permanent. Ein Spieler sollte niemals mit der Intention in ein Spiel gehen es negativ zu gestalten, sondern immer positiv. Riot sollte auch genauer &uuml;berpr&uuml;fen von welchem Spieler eigentlich der Konflikt ausgeht. Das sich nicht jeder Spieler perfekt verh&auml;lt ist ja wohl klar, wir sind alle auch nur Menschen und bei jedem Menschen kommt irgendwann ein Punkt, da ist jede Ruhe und Friedlichkeit ausgereizt durch einen Spieler, der es absichtlich darauf absieht, das Team aufzuwiegeln und zu &auml;rgern. Solche Spieler sollten gebannt werden, nicht aber solche, die versuchen sich zu bessern, wenn auch nur mit kleinen Erfolgen. Wenn euch das Verhalten eines Spielers st&ouml;rt, dann mutet doch einfach f&uuml;r immer seinen Chat, damit k&ouml;nnten sicherlich viele Leben. \r\n\r\nDie LoL Community ist so eine negative Community, wie ich sie noch in keinem Game vorher erlebt habe, nicht einmal in Shooter Games ist die Community so derart respektlos und dumm wie in diesem Spiel! Arbeitet daran!","replies":[{"poster":"Leylania","date":"2017-02-16T09:18:58.134+0000","up_votes":5,"down_votes":1,"body":"Und was willst du jetzt von uns hören? Wie recht du hast und dass LoL wirklich so furchtbar ist und Riot ist auch ganz schrecklich dämlich, aber gut, dass es noch so tolle Spieler wie dich gibt? Du regst dich über die Negativität im Spiel auf, gehst aber gleichzeitig ins Forum um die Allgemeinheit der Spieler zu beleidigen und um hier deinen Frust abzuragen, da seh ich dann doch einen kleines Problem bei. Keine Ahnung warum die Community von LoL immer so schlecht dargestellt wird, spiel mal Dota 2 oder CS GO, da lernst du was eine schlimme Community ist. Dagegen ist LoL der Club der kleinen kuscheligen Welpen.\n> Warum wird man für´s Feeden geflamed?\n\nAuch wenn flamen natürlich nicht ok ist, was erwartest du, dafür gelobt zu werden etwa?\n\n> Wie dem auch sei, Spieler, die in ein Spiel kommen um die Lane zu stehlen, zu sabotieren und zu flamen, die sollten gebannt werden und zwar permanent\n\nDu willst jeden permabannen lassen, der mal in einem Spiel getrollt hat oder dir die Lane geklaut hat, daran sieht man schon wie wenig Ahnung du von dem hast worüber du dich aufregst. Nicht nur, dass dann wahrscheinlich quasi niemand mehr spielen würde (weil alle gebannt wären) sondern auch, weil so ein System gar nicht umgesetzt werden könnte, da man es meistens nicht nachverfolgen kann wenn jemand z.B. die Lane 'klaut'.\n\n> Das sich nicht jeder Spieler perfekt verhält ist ja wohl klar\n\nEben wolltest du noch jedem nen Perma geben der mit negativen Absichten ins Spiel geht, plötzlich ist es gar nicht so schlimm sich mal schlecht zu verhalten, na was denn nun?\n\n> Warum darf ein solcher Spieler überhaupt so ein Spiel spielen?\n\nWeil Riot es erlaubt und du das nicht zu bestimmen hast.\n\n>  Es ist ein MMO\n\nLoL ist ein Moba um genau zu sein.\n\n> Und da kann der Mute des Chats nicht die universale Lösung sein\n\nWarum nicht? Genau dafür gibt es doch diese Funktion. Erwartest du ernsthaft, dass Riot einfach mal mit dem Finger schnippst und die ganzen unerzogenen Kinder die sich hier darum tümmeln sind plötzlich liebe Engel die sich alle fein benehmen? Wenn du die Mute-Funktion nicht benutzt ist das deine und nur deine Schuld, dann musst du dich aber auch nicht über Flame beschweren, den wird es immer geben, auch wenn du die Hälfte der LoL Spieler bannen würdest.\n\n>  Es ist langweilig und frustrierend mit solchen Menschen zusammen spielen zu müssen\n\nDie meisten Spieler siehst du nach einem Spiel nie wieder. Solltest du im nächsten Spiel wieder nen Flamer treffen -> Mute\nAnsonsten wird es Zeit, dass du dir ein paar nette Premades suchst und mit denen spielst.\n\n> Riot sollte auch genauer überprüfen von welchem Spieler eigentlich der Konflikt ausgeht\n\nWieso? Welche Rolle spielt das? Willst du mir sagen, dass wenn mich jemand beleidigt dann darf ich zurück flamen ohne bestraft zu werden nur weil ich nicht angefangen habe?\n\n\n\nDer ganze Post hört sich für mich wieder nach unüberlegtem 0815 Gejammer über die böse Community an. Das Traurige ist, dass die Leute die sich immer beschweren meistens auch die Leute sind die sich im Spiel selber nicht gerade gut verhalten.","replies":[]},{"poster":"Humpelstilzche","date":"2017-02-16T09:58:18.063+0000","up_votes":2,"down_votes":0,"body":"Eins vorneweg: Ja, Flamer, absichtliche Feeder &amp; Afkler, Blamer und Rollen-Diebe sind scheiße, seh ich ganz genauso.\n\nIch muss aber auch ein wenig Kritik an deiner Argumentation üben. \nEinerseits sagst du, dass dass niemand perfekt ist und gestehst den Spielern offensichtlich ein gewisses Maß an Fehlverhalten zu. Andrerseits forderst du aber einen sofortigen Permaban für jeden der auch nur einmal eines der oben genannte Dinge tut. Wie passt das denn zusammen? Einerseits gestehst du den Leuten ihre menschlichen Schwächen zu, andrerseits willst du sie dafür permabannen. Was denn nun? \n\nDer andere Punkt den ich gerne kritisieren möchte, ist, dass du glaube ich ein etwas naives Bild davon hast, warum Leute die oben genannten Dinge tun. Du schreibst ...\n\n> bei jedem Menschen kommt irgendwann ein Punkt, da ist jede Ruhe und Friedlichkeit ausgereizt durch einen Spieler, der es absichtlich darauf absieht, das Team aufzuwiegeln und zu ärgern.\n\n\n... scheinst aber nicht in Betracht zu ziehen, dass die Spieler die du gerne gepermabannt sehen würdest, exakt die selben Gründe haben könnten. Die wenigsten Spieler sind wirklich absichtlich böse. Praktisch alle toxischen Spieler sind toxisch, weil sie sich provoziert fühlen oder ihnen vor lauter Frustration der Kragen platzt. \nDas macht es natürlich nicht okay, ist aber etwas was du gerade eben noch gerechtfertigt hast. \n\nDu denkst zu sehr in schwarz un weiß, wenn du glaubst es gäbe auf einer Seite die bösen Flamern die allen schaden wollen und auf der anderen Seite die braven Spieler die unter Frust und der Toxicity anderer leiden müssen. So einfach ist das aber leider nicht, denn die meisten toxischen Flamer leiden ebenfalls unter Frust und Toxicity und sind genau deswegen toxic. \n\nDeswegen funktioniert deine Unterteilung in die Leute die für böses Verhalten sofort gebannt werden sollten und die anderen Leute, deren menschliche Fehler durch äußere Umstände gerechtfertigt werden nicht: Diese beide Gruppen sind ein und die selbe Gruppe.\n\nSpieler die wirklich von sich aus und ohne erkennbaren Grund, ohne jede Provokation und ohne Frust mit voller Absicht Arschlöcher sind, sind extrem selten und machen nur einen absolut geringfügigen Anteil der gesamten Toxicity in LoL aus. \n\n>  Solche Spieler sollten gebannt werden, nicht aber solche, die versuchen sich zu bessern, wenn auch nur mit kleinen Erfolgen. \n\nDas ist exakt so, wie es momentan funktioniert. Die die sich bessern, können weiterspielen. Die die das nicht tun, arbeiten sich recht fix zum Permaban durch.","replies":[{"poster":"Alira","date":"2017-02-17T08:49:58.337+0000","up_votes":1,"down_votes":1,"body":"Ich fordere keinen sofortigen Permaban! Ich fordere schnellere und strengere Strafen und vor allen Dingen finde ich man sollte Reihenfolge und Ausmaß der Strafen offen legen. Zum Beispiel: 1x Chatblock; 1x Temp.-ban; Permaban \nIn dieser Reihenfolge und auch genau so sollten die Strafen verhängt werden. Jeder der So eine Strafe erhalten hat, weiß dann genau wo er steht und was ihn als nächstes zu erwarten hat. Sprich er überlegt sich 3x ob er sich nochmal daneben benimmt!","replies":[{"poster":"Humpelstilzche","date":"2017-02-17T09:10:02.344+0000","up_votes":2,"down_votes":0,"body":"> Ich fordere schnellere und strengere Strafen\n\nSchneller als die 0 bis 5 Minuten die es jetzt dauert? Das ist kaum möglich. \n\nUnd strenger....wenn es so einfach wäre, hätte Riot das schon längst getan. Und haben sie auch, in der Vergangenheit. Das Problem (und der Grund warum Riot davon wieder weggegangen ist) ist, dass strengere Strafen keinesfalls effektiver sind. Das mag zunächst contra-intuitiv wirken, aber tatsächlich haben kleine Strafen einen weitaus stärkeren und vor allem langfristigeren Einfluss auf das Verhalten als harte Strafe. Strafen werden nicht effektiver, wenn man ihre Härte hochschraubt. Wäre es so einfach, würden das z.B. auch alle Regierungen machen: Einfach alle Strafen hochschrauben, bis es keine Kriminalität mehr gibt. Warum machen die das nicht? Weil es nicht funktioniert. So simpel sind Menschen einfach nicht. Auch wenn der Gedanke \"Je härter die Strafe, desto größer die Abschreckung\" sehr logisch klingen mag, sieht die Realität darüber wie Menschen entscheiden was sie tun und was sie nicht tun leider ganz anders aus und ist weitaus komplexer. \n\nSorry, aber so simpel ist das Problem leider nicht. \n\n> und vor allen Dingen finde ich man sollte Reihenfolge und Ausmaß der Strafen offen legen.\n\nDas ist schon längst bekannt, kann man sogar auf der Seite vom Support nachschauen und wurde auch an dutzenden anderen Stellen offengelegt:\n\n10 Spiele CR\n25 Spiele CR\n14 Tage Ban\nPermaban\n\n> In dieser Reihenfolge und auch genau so sollten die Strafen verhängt werden\n\nGenau das passiert auch....mit der einen Ausnahme dass bei entsprechender Frequenz oder Härte der Vergehen auch Straf-Stufen übersprungen werden können. \n\n> Sprich er überlegt sich 3x ob er sich nochmal daneben benimmt!\n\nWenn es doch nur so simpel wäre. Leider ist Toxicity sehr selten eine bewusste und wohlüberlegt Entscheidung, sondern eine emotionale Affekthandlung, bei der über die Folgen einfach nicht nachgedacht wird und diese dem Spieler schlicht und einfach (in diesem Moment) egal sind. Das ist auch einer der Gründe, warum die Härte der Strafen keinen positiven Einfluss hat...sie wird nämlich in den Situationen wo es zählt einfach ignoriert.","replies":[]},{"poster":"Patter1991","date":"2017-02-17T09:00:48.124+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alira,realm=EUW,application-id=YnZkMR0R,discussion-id=oQ6JpQP7,comment-id=00030000,timestamp=2017-02-17T08:49:58.337+0000)\n>\n> Ich fordere keinen sofortigen Permaban! Ich fordere schnellere und strengere Strafen und vor allen Dingen finde ich man sollte Reihenfolge und Ausmaß der Strafen offen legen. Zum Beispiel: 1x Chatblock; 1x Temp.-ban; Permaban \n> In dieser Reihenfolge und auch genau so sollten die Strafen verhängt werden. Jeder der So eine Strafe erhalten hat, weiß dann genau wo er steht und was ihn als nächstes zu erwarten hat. Sprich er überlegt sich 3x ob er sich nochmal daneben benimmt!\n\nDu hast keine Ahnung vom System, oder? Genau so ist es doch schon. Nur 2mal Chatban. 10, 25, dann 2 Wochen Bann, dann Perma. In dieser Reihenfolge. Beim 2 Wochen-Bann sogar mit Mitteilung in der Mail, dass der Perma nicht mehr weit ist.","replies":[{"poster":"Alira","date":"2017-02-17T09:32:32.678+0000","up_votes":1,"down_votes":2,"body":"Leider stimmt das so nicht :)","replies":[]}]}]},{"poster":"Alira","date":"2017-02-17T08:56:25.388+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=YnZkMR0R,discussion-id=oQ6JpQP7,comment-id=0003,timestamp=2017-02-16T09:58:18.063+0000)\n\n> ... scheinst aber nicht in Betracht zu ziehen, dass die Spieler die du gerne gepermabannt sehen würdest, exakt die selben Gründe haben könnten. Die wenigsten Spieler sind wirklich absichtlich böse. Praktisch alle toxischen Spieler sind toxisch, weil sie sich provoziert fühlen oder ihnen vor lauter Frustration der Kragen platzt. \n\nWas ich nicht verstehe ist: Wie kann es sein, dass jemand der in ein Game rein geht direkt anfängt zu trollen? Dafür habe ich kein Verständnis! Man sabotiert kein Game ohne einen Grund. (Vorangegangene Spiele zählen hier nicht, da der Spieler seine Launen nicht auf ein neues Spiel übertragen darf!)","replies":[{"poster":"Humpelstilzche","date":"2017-02-17T09:01:07.667+0000","up_votes":2,"down_votes":0,"body":"Du machst einen kleinen Denkfehler:\n\nDu setzt \"Grund\" und \"Rechtfertigung\" gleich. \nDu hast absolut Recht, dass vorangegangene Spiele keine Rechtfertigung sind das nächste Spiel zu sabotieren. Das heißt aber noch lange nicht, dass das nicht trotzdem der Grund ist. Nur weil das deiner Meinung nach nicht so sein sollte, ändert das nichts daran, dass es so ist. Vergangene Spiele haben massiven Einfluss darauf, ob Spieler toxisch sind oder nicht. Das sollte nicht so sein, ist aber so.","replies":[]}]}]},{"poster":"Coopa123","date":"2017-02-16T08:58:36.486+0000","up_votes":2,"down_votes":0,"body":"Ganz davon abgesehen, dass League of Legends ein MOBA und kein MMO ist^^, ist mir bei all diesen Posts, in denen die Community sich über die Community aufregt, eins aufgefallen: Fast alle Probleme, die du mit dieser Community hast, werden durch Premades und die Mute Funktion beseitigt.\nWenn du mit Freunden oder Bekannten spielst, wirst du nicht geflamed. Wenn jemand im vorhinein negativ auffällt und du diesen dann sofort mutest, würdest du nichts von seinem Quatsch mitbekommen.\n\n>  Es ist langweilig und frustrierend mit solchen Menschen zusammen spielen zu müssen und erschwert jedem Spieler das Spiel. \n\nWas hindert dich denn daran hier im Forum nach Leuten zu suchen? Du kannst einfach einen Beitrag eröffnen wo du Leute suchst die nicht unbedingt krampfhaft gewinnen wollen, die lockerer sind und deine Ansichten teilen.\nKlar könnte Riot härter gegen Geheule und Beleidigungen vorgehen (auch wenn ich finde, dass es im Moment gut funktioniert), aber es gibt Lösungen für dich, die du nicht in Erwägung ziehst. Du sitzt nur da und lässt das über dich ergehen, auch wenn du mit sehr wenig Aufwand alles Verbessern könntest. Warum machst du es nicht?\n\n>  Warum wird man für´s Feeden geflamed? \n\nDas ist doch ziemlich offensichtlich oder nicht? 4 Leute wollen krampfhaft gewinnen, verlieren aber trotzdem weil der 5te aus dem Team es nicht gebacken bekommt. Das frustet den einen mehr den anderenweniger. \n\n> Sowas sollte zumindest in einer kleinen Form belohnt werden, zum Beispiel durch eine Bemerkung (Gut so! Weiter so!)\n\nWird es. \n\n> Riot sollte auch genauer überprüfen von welchem Spieler eigentlich der Konflikt ausgeht.\n\nDas ist völlig irrelevant. Wenn ein Spieler rumheult und trollt, dann sollte der genau so sehr bestraft werden, wie jeder andere aus dem Team, der den Fehler macht auf den Unsinn einzugehen, anstatt einfach die Mute- und Report-Funktionen zu nutzen.\nDiese \"Er hat zuerst angefangen\"-Masche funktioniert seit dem Kindergarten nicht mehr\n\nDie Community von LoL ist nun mal schlecht. Vielleicht sogar schlechter als ein Großteil aller online spiele die jemals existiert haben. Aber das ist eben die Natur von einem anonymen, kostenlosen, sehr simplen und Team-basierten Videospiel ohne Alterbeschränkung. Da kann jeder semi-intelligente 8 Jährige frei von jeglichen Konsequenzen fürs echte Leben rumtrollen. Das ist einfach so. \nIm Vergleich zu CounterStrike finde ich League aber ehrlich gesagt nicht unbedingt schlimmer.","replies":[]},{"poster":"pizzapizze","date":"2017-06-16T22:40:07.266+0000","up_votes":1,"down_votes":0,"body":"Den meisten Leuten kann man das beleidigen / flamen (dumm sein) nicht abgewöhnen, es liegt nämlich 100% nur an der DUMMHEIT.{{champion:36}}","replies":[]},{"poster":"XenesisCH","date":"2017-02-16T09:09:08.863+0000","up_votes":1,"down_votes":0,"body":"> Sicherlich gilt dies nicht ausnahmslos für alle Spieler der League of Legends Community, dennoch **aber für einen Großteil**\n\n> Ich hasse die Community von LoL\n\n> \n> Ich hasse die League of Legends Community, da sie zum größten Teil nur aus hirnamputierten Vollidioten besteht, die meinen, sie wären der King und wüssten alles über das Game\n\n> Die LoL Community ist so eine negative Community, wie ich sie noch in keinem Game vorher erlebt habe, nicht einmal in Shooter Games ist die Community so derart respektlos und dumm wie in diesem Spiel! Arbeitet daran!\n\n\n\nDu sprichst hier mit **der Community**, deine Wortwahl ist ziemlich unklug gewählt. Ich empfehle dir deinen Text zu überarbeiten, wenn du eine Diskussion möchtest und Absätze wären auch keine schlechte Idee ;-)","replies":[]},{"poster":"Alira","date":"2017-02-16T13:26:14.705+0000","up_votes":1,"down_votes":1,"body":"Ein feedender Mitspieler sollte nicht kommentiert werden, sondern lieber Tipps und Ratschläge sollten folgen. Dies passiert jedoch nur in einem winzigen Bruchteil der Fälle.\nDer Chatmute sollte für Einzelfälle sein und nicht für jedes Game von Nöten sein! Für den Großteil der Fälle sollte das Riotteam dafür sorgen, dass es nicht zu solch negativen Erfahrungen kommt.\nDas Spiel ist zu einseitig auf den Wettstreit ausgelegt. Es geht einzig und allein darum Level 30 zu erreichen und schnellstmöglich in Rankings den höchstmöglichen Rang zu erreichen. Das führt zu einem starken kompetitiven Denken der Spieler und zu einem Überehrgeiz, der in aggressiver Verhaltensweise endet! Riot muss Abwechslung schaffen um Entspannung in die Köpfe der Spieler bringen. Selbst in Normals und Bot-Games hält zur Zeit das negative Verhalten Einzug! Wie kann das sein? Es geht doch um nichts? Ein Spieler, der ein Spiel betritt um es den anderen so negativ wie möglich zu gestalten sollte ein Spiel nicht betreten dürfen. \nUnd so weiter...man kann noch so viel dazu schreiben...Wie kann es sein, dass es so negativ abläuft mit der LoL Community?","replies":[]}]}