{"poster":"Koneko Sakii","date":"2017-08-12T17:42:27.868+0000","title":"Solution to the infinite login loop!","subforum":"[ARCHIVED] Help & Support","embed":{"description":null,"url":"http://imgur.com/xYGudC2","image":"http://imgur.com/xYGudC2s.png"},"up_votes":3,"down_votes":0,"body":"deleting the file circled (File name: Last_Versions) will reset the client and force a update allowing you to relog into the game.\n\ni had to do this myself and my file was reverted back to the april 12th update.\n\nwhats happening when it goes into a infinite relog boot is it detects that the client isnt the version it should be, so it checks \"last versions\" and reverts to the saved data, then tried to re-revert to the current version (doesnt work for what should be apparent reasons)\n\n when you delete this file the client forgets what version its trying to update to based on info saved client side and checks with the server and gets a new copy of the data its supposed to be and stops the relog / revert loop\n\nif youre still having trouble:\n\nyou have to run \"Lol.launcher.admin.exe\" as administrator (rightclick and run as admin) and it should force the update\n\nHexs Fortune - they had success with this but applying thier own step\n\n \"\" so I deleted the \"last version\" file, started up the client to the 33 percent load screen. I closed the game, then I restored the deleted \"last version\" and replaced the new one the game auto-created. Now the game is working correctly. Hope this helps some of you out there. \"\"","replies":[{"poster":"WatsOfLegends","date":"2017-08-12T17:58:51.284+0000","up_votes":2,"down_votes":0,"body":"This actually works!","replies":[]},{"poster":"Porocles","date":"2017-08-12T20:58:43.778+0000","up_votes":1,"down_votes":0,"body":"This issue should be resolved now!  We did offer a workaround for a moment about trying to launch as admin, but it resulted in the 33 percent error.  At this point, it should be possible to login and play now without further problems!","replies":[]},{"poster":"Hexs Fortune","date":"2017-08-12T18:19:56.731+0000","up_votes":1,"down_votes":0,"body":"I tried it but it's just stuck at 33 percent loading...\n\nedit: Got it to work, here's how\n\nso I deleted the \"last version\" file, started up the client to the 33 percent load screen. I closed the game, then I restored the deleted \"last version\" and replaced the new one the game auto-created. Now the game is working correctly. Hope this helps some of you out there.","replies":[{"poster":"Koneko Sakii","date":"2017-08-12T18:22:34.239+0000","up_votes":1,"down_votes":0,"body":"you have to run \"Lol.launcher.admin\" as administrator (rightclick and run as admin) and it should force the update","replies":[]}]}]}