{"poster":"FistedCooper","date":"2015-05-16T19:20:41.866+0000","title":"Welcher Champion passt zu mir ? Eure Hilfe ist gefragt !","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"**Hallo ich suche seit 1 Jahr meinen Champion den ich gerne Spiele.. \r\nNur das Problem ist das ich selber nicht wei&szlig; was zu mir passt weil ich auch schon &ouml;fters mal schlechte Runden habe und dann auch mit diesen Champion verliere dann macht er mir auch kein Spa&szlig; mehr.. weil ich mir selber einrede das er schlecht ist oder ihn nicht spielen kann.\r\nWen ich aber gewinne denke ich das er gut ist.. ^^\r\nIch spiele gerne auf der Lane Top - Mid. \r\nJunglen kann ich seit der neue Map nicht..       Beim Supporten liegt das Problem das ich nicht mit den Supporter Items klar komme oder beim ADC dass ich immer agro bin und dadurch Feede.. **\r\n\r\n**K&ouml;nnt ihr mir helfen ?\r\nEs ist egal ob der Champion AD oder AP ist ich m&ouml;chte nur etwas l&auml;nger auf der Lane sein damit ich mehr Farm habe und dadurch Gold habe, jedoch sollte er einen Burst haben, und nicht erst im Late game alle vernichten :-) \r\nBitte schreibt mir eure Ideen in diesen Post vllt. k&ouml;nnt ihr mir ja weiter helfen ! \r\nUnd ich wei&szlig;-.. :&#039;) mein Deutsch ist nicht das beste.\r\nLG **","replies":[{"poster":"megareez","date":"2015-05-31T07:07:11.994+0000","up_votes":1,"down_votes":0,"body":"Ich würde dir auf der Rop Rengar empfehlen da er ein Off Tank ist und sehr viel burst besitzt.","replies":[{"poster":"megareez","date":"2015-05-31T07:07:35.676+0000","up_votes":1,"down_votes":0,"body":"*Top","replies":[]}]},{"poster":"rojo4","date":"2015-05-30T11:38:41.387+0000","up_votes":1,"down_votes":0,"body":"Für die Mid empfehle ich Cassiopeia, passiv Stacks und Minions farmen im Early, und ganz nebenbei beim gegnerischen Midlaner immer wieder kleine Mengen von Schaden verursachen. (Wenns nich unbedingt ne Kata ist ;D) Das erste Item mit Cassiopeia sollten Schuhe sein, wenn du einen Assassinen auf der Mid hast (Kata, Zed, etc.) Ansonsten dieses Magier-Statikks (Weiß den Namen gerade nicht xD) um mit der W nicht nur Schaden auf Zeit, sondern auch beim ersten Hit viel Schaden zu machen. Wenn du Rune/Masterie Tips willst kann ich dir eines empfehlen: Google. Hoffe ich konnte dir Helfen ^^","replies":[]},{"poster":"ItzNightwing37","date":"2015-05-17T09:39:05.110+0000","up_votes":1,"down_votes":0,"body":"Probier mal Talon aus {{champion:91}}  isn AD champ","replies":[]},{"poster":"Red Mage","date":"2015-05-16T21:09:04.268+0000","up_votes":1,"down_votes":0,"body":"wenn ich das so lese, dann empfehle ich dir Darius, er ist DER champ auf der top, der eig alle matchups gewinnt, egal was vor him steht (wenige außnahmen)\n\nGuide? google ist dein freund, ein sehr freundlicher \"item guide\" ist:\nHydra (hooken und sofort nach AA Hydra aktive nutzen, danach den W und Q, wenn du gut bist kannst du auch Q während er gehooked wird machen, wenn du sicher ihn im äußerem kreis treffen kannst, da es bonus dmg verursacht) und danach full tank gehen","replies":[]},{"poster":"Owndby Chris","date":"2015-05-16T19:33:48.957+0000","up_votes":1,"down_votes":0,"body":"Also so wie du dein problem schilderst würde ich dir zed empfehlen. zed macht wirklich viel spaß, hat einen guten burst und mit der passiven kannst du richtig gut farmen. Ich hoffe ich konnte dir helfen","replies":[{"poster":"FistedCooper","date":"2015-05-16T19:42:18.637+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank für die Antwort, hättest du einen guten Guide für Zed wo Runen, Masteries usw. enthält ? \nLG {{champion:238}}","replies":[{"poster":"Owndby Chris","date":"2015-05-16T20:25:47.774+0000","up_votes":1,"down_votes":0,"body":"Auf zed sollte man meiner meinung nach gewöhnliche 21/9/0 masteries bauen. Cooldownreduction, Schaden, und etwas leben. Runen für zed sollten wie folgt aussehen :\n\n9x Großes Zeichen der Rüstungsdurchdringung\n9x Großes Siegel der wachsenden Rüstung\n9x Große Glyphe der Magieresistenz\n3x Große Essenz des Angriffschadens\n\nich hoffe ich konnte dir helfen {{champion:238}}","replies":[{"poster":"FistedCooper","date":"2015-05-16T20:39:04.180+0000","up_votes":1,"down_votes":0,"body":"ja danke ich probiere mal mein glück {{champion:238}}  {{summoner:4}}  {{summoner:14}}","replies":[]}]}]}]},{"poster":"lllusive Man","date":"2015-05-16T19:32:47.844+0000","up_votes":1,"down_votes":0,"body":"cassiopeia eventuell du kannst passiv mit deinem gift farmen ,aggro gegner vergiften und das auß sicherer entfernung wenn es zum  fight kommt kannste auch viel schaden in kurzer zeit mit deinem e raushauen.","replies":[{"poster":"FistedCooper","date":"2015-05-16T19:45:02.324+0000","up_votes":1,"down_votes":0,"body":"Danke für die Antwort, hast du einen Guide für Cassi. oder ein Video wo jemand sie Spielt und damit abgeht ^^ ? \nWürde sie gerne kennen lernen {{champion:69}} \nLG","replies":[]}]}]}