{"poster":"Hawk Peak","date":"2018-05-29T20:28:27.771+0000","title":"Necesito que me expliquen algo ¡¡¡¡¡","subforum":"Charlas Generales","up_votes":4,"down_votes":1,"body":"Ya llevo demaciadas partidas donde me toca gente que no sabe jugar .Literalmente no sabe jugar \r\nEntonces QUISIERA SABER como mrd riot maneja el emparejamiento o si es que lo maneja \r\nUno trata se subir de division y le toca con esta gente &iexcl;&iexcl;&iexcl;&iexcl;&iexcl;\r\ngracias","replies":[{"poster":"xShadow10","date":"2018-05-29T20:36:34.965+0000","up_votes":2,"down_votes":0,"body":"En teoría, siempre toca con gente de tu nivel (en general, no el nivel de la cuenta).\nPero tampoco te voy a decir que el sistema de emparejamientos es perfecta ni nada. No revisé que liga eres, pero si eres Oro o por debajo, seguro te puede tocar con alguien que supuestamente esta a tu nivel pero capaz es un jugador 'casual' que es aquel que no le dedica mucho tiempo al juego por lo cual puede que tenga esas partidas que vos te preguntas cómo puede ser que te toque con esa gente.\nEn fin, lamentablemente para la mayoría, este problema se soluciona subiendo de liga, cosa que para algunos puede resultar fácil o un infierno.\n\nSuerte!","replies":[]},{"poster":"Hectorinho","date":"2018-05-29T20:36:31.762+0000","up_votes":2,"down_votes":0,"body":"Al parecer la mayoría de tus partidas son con platas, y tu winrate es menos a 50% en casi 150 partidas, por lo que tu mmr también es un poco más bajo.\nAl menos según datos, no estás fuera de donde te corresponde, pero si crees que la gente con la que te toca es peor que tu, toca jugar más, y si eres mejor que el resto, tarde o temprano empezarás a ganar más que perder.\nBuena suerte en tus partidas\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"schiavoni","date":"2018-05-29T21:42:55.056+0000","up_votes":1,"down_votes":0,"body":"porque el 80% de sus jugadores son menores de 13 años :v","replies":[{"poster":"Hawk Peak","date":"2018-05-31T22:33:50.097+0000","up_votes":1,"down_votes":0,"body":"Fue la mejor repuesta que me han dado gracias \nLa verdad es que no puedo creer ka cantidad de niños que hay jugando videojuegos\nQue no tienen conciencia los padres de hoy en dia ?????","replies":[]}]},{"poster":"Kokoro Chacarero","date":"2018-05-30T00:06:13.595+0000","up_votes":1,"down_votes":0,"body":"En que division estas?","replies":[]}]}