{"poster":"loliHD","date":"2015-03-07T13:37:36.427+0000","title":"Verlasst das sinkende Schiff!","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":20,"body":"Liebe Lol Gemeinde,\r\nEin kleiner Rat meinerseits. League of Legends ist an seinem Erfolgsgipfel angekommen und ich habe das dumpfe Gefühl es wird kein Bergauf mehr geben. Ich habe die Heroes of the Storm Beta angetestet und schnell gemerkt, es gibt viel bessere Spiele die nicht so gehypted sind. Vermutlich ist das Geschmackssache, aber ich verlasse das Schiff BEVOR es anfängt zu sinken. Mein Rat: Verscherbelt eure Accounts jetzt, wo sie noch etwas wert sind. Selbiges habe ich mit meinem Acocunt bereits getan. Adios Riot ihr werdet mich nicht wieder sehn. Ich verlasse das sinkende Schiff. Vorallem neuste Änderungen, wie den Anstieg des RP Preises zeigen mir einfach das euch die Spieler S***** egal sind. Liebe Grüße, ein ex Dia 5 Spieler","replies":[{"poster":"Rkoturdo Ndo","date":"2015-03-07T14:59:35.901+0000","up_votes":3,"down_votes":0,"body":"Heya\nWie kannst du etwas verkaufen, dass nicht dir gehört?\n\nMfG Rkoturdo","replies":[]},{"poster":"i had fun once","date":"2015-03-07T14:42:55.467+0000","up_votes":3,"down_votes":0,"body":"https://www.youtube.com/watch?v=RFZrzg62Zj0","replies":[]},{"poster":"Gragion","date":"2015-03-07T14:41:23.424+0000","up_votes":3,"down_votes":0,"body":"Wieso musst du uns mitteilen, dass du gehst? - Keinen Interessiert das, keinen!\n\nIch verstehe allerdings nicht, was das mit dem sinkenden Schiff soll. Wenn Riot, laut deiner Meinung, schon am Gipfel ist, wieso muss es dann unbedingt wieder Bergab gehen? - LoL entwickelt sich wunderbar und sind noch lange nicht am Gipfel. \n\n\nGrüße! {{summoner:31}}\n\n_____\n\nEdit: Warte, wieso steht da, dass du lvl 29 bist? :o","replies":[]},{"poster":"Madchickendinner","date":"2015-03-07T15:58:40.656+0000","up_votes":2,"down_votes":0,"body":"Aber erstmal nach Dia 5 suchten haha :D","replies":[{"poster":"Neamhoilte","date":"2015-03-07T17:32:45.970+0000","up_votes":2,"down_votes":0,"body":"Bestimmt geboosted worden  : )","replies":[]}]},{"poster":"Marofion","date":"2015-03-07T13:53:31.108+0000","up_votes":2,"down_votes":0,"body":"Selbstverständlich ist das Geschmackssache, welches Spiel man besser findet. Du findest das MOBA aus dem Hause Blizzard besser, ok deine Sache.\nIch selbst spiele sehr gern LoL und bleibe auch dabei, bis es mir keinen Spaß mehr macht ;) \nIch bin nicht davon überzeugt, dass Riot die Spieler egal seien... im Gegenteil sogar. Aber Preisanstiege gehören nunmal mit dazu... außerdem haben sie es rechtfertigt, was ich zwar nicht verstand... abern Grund scheint es zu geben.\nDass du deinen Account verkauft hast... naja deine Sache wenn du die AGBs zum Abschluss nochmal brechen möchtest... ist dir vermutlich egal, da du ja eh nicht mehr spielst.\n\nAber nun zum eigentlichen Grund meines Beitrages... Versuchst du uns was anderes zu sagen als:  \"Ich spiel kein LoL mehr, wer mit mir spielen will muss Heroes of the Storm spielen\"?","replies":[]},{"poster":"N00bOrange","date":"2015-03-07T14:03:52.182+0000","up_votes":1,"down_votes":0,"body":"Ex diamond 5 sagt nichts, fals du denkst du wärst ein großer verlust für league of legend. Bin selbst Diamond 5 und ich weiß das auf DIamond 5 90% der Spieler keine Ahnung haben (ich natürlich auch ;)) ).","replies":[{"poster":"LuckingFegendary","date":"2015-03-07T15:08:29.153+0000","up_votes":2,"down_votes":1,"body":"Da steht Level 29....\nAlso ob das mit Ex-Dia 5 stimmt?!","replies":[]}]},{"poster":"Alustus","date":"2015-03-08T14:32:36.226+0000","up_votes":1,"down_votes":0,"body":"LoL wurde auch shcon totgesagt als DOTA2 rauskam.\n\nJetzt gibt es Dota2 schon seit einer zeit und noch andere moba ableger, aber an der Spitze steht komischerweise immernoch LoL :)","replies":[]},{"poster":"Sirrkas","date":"2015-03-08T11:07:05.545+0000","up_votes":1,"down_votes":0,"body":"Nach einer Weile wurde mir HoTS ziemlich langweilig. Da fehlt es an irgendwas. Die Spiele sind zwar meistens kurz und ausgeglichen aber es fühlt sich so an, als würde es nur für Zwischendurch taugen. Wenn man mal etwas Abwechslung braucht spielt man eben 2 Runden Heroes und das wars dann auch schon wieder. Der einzige richtige Pluspunkt von dem Spiel ist, dass man seine Lieblingscharacktere aus dem Blizzarduniversum spielen kann.","replies":[]},{"poster":"Hibernius Riesig","date":"2015-03-08T10:58:50.790+0000","up_votes":1,"down_votes":0,"body":"Ah HofS.... naja wirst es da sicher net lange aushalten... das Spiel ist eher ein interaktives Video und mehr nicht... und wer sieht schon gerne immer den selben Film ;)","replies":[]},{"poster":"Kazuya San","date":"2015-03-07T14:39:57.208+0000","up_votes":1,"down_votes":0,"body":"ah HofS ... ist das nicht dieses Game, wo Champs bewusst op konzipiert werden, mit der Begründung: \"ja das soll so, die champs müssen sich ja auch verkaufen?\" Großatiger Vergleich :D\n\nBtw du siehst das falsch. Das schiff sinkt nicht es taucht. Ist nämlich nen Uboot :o","replies":[]},{"poster":"TheYordleInferno","date":"2015-03-07T14:00:09.637+0000","up_votes":1,"down_votes":0,"body":"Bye niemand wird dich vermissen","replies":[]},{"poster":"Artyst","date":"2015-03-07T13:41:44.714+0000","up_votes":1,"down_votes":0,"body":"Ah ih dieses Heroes of the Shit... So ein beschissenes Spiel ein reiner reinfall... Es fehlt das Feeling und es wird extrem Träge...\n\nViel Spaß mit diesen Shit Game xDDDD","replies":[]}]}