{"poster":"U1TRA 1NST1CT","date":"2017-12-10T01:04:28.723+0000","title":"Riot ist Müll","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":26,"body":"Das flamen ein reportgrund ist, ist so d&auml;mlich. Zu flamen weil man sich aufregt (aufregen ist so nat&uuml;rlich wie atmen) und dann gemeldet und gesperrt zu werden ist so widerspr&uuml;chlich. Warum bringen wir nicht einfach jeden Menschen ins Gef&auml;ngnis der auch nur anzeichen von Emotionen aufweist. Warum nicht einfach den scheiss Chatfilter und Mute-Button und fertig, warum noch spieler daf&uuml;r bestrafen das sie ein h&ouml;heres Ma&szlig; an emotionen besitzen als andere. Nicht f&uuml;r jeden ist es einfach nur ein Spiel, manche menschen Leben halt in der Gaming welt und im Leben sind Emotionen verdammt nochmal Normal. Also warum ist riot so Naturfeindlich und Bestraft den Besitzt von Emotionen??? Kann mir das jemand erkl&auml;ren. Jetzt kommen von euch erstmal so dumme spr&uuml;che, hast es verdient, wer sich nciht benehmen kann muss leiden, endlich 1 flamer weniger. Das k&ouml;nnt ihr euch ernsthaft sparen. Nur weil ihr keine Emotionen habt. Gesellschaften, Konzerne und viele andere Gro&szlig;e Konstrukte von Menschen unterdr&uuml;cken die Menschen um sie klein und dumm zu halten damit sie machen k&ouml;nnen was sie wollen. Siehe Kim in Korea, einfach alles verbieten und die Leute klein halten dann k&ouml;nnen sie machen was sie wollen. Genauso machen das auch Gesellschaften hier. Darfst einen scheissdreck sollst immer sch&ouml;n deine Fresse halten und wegschauen, mach deinen scheiss Job, lebe dein scheiss wertloses Dummes Leben und wir nutzen dich aus so gut es geht.\r\n\r\nMan wie ich mich freue das es Momentan so viele Vollpfosten an der Macht gibt. Hoffentlich f&auml;ngt Bald mal einer von denen an den dritten Weltkrieg zu starten hab kein bock mehr auf diese Welt. Menschen sind die d&uuml;mmste kreation der Evolution. Intelligenz am Arsch, einfach nur Sprechende Machtgeile Primaten.","replies":[{"poster":"Kackkopp","date":"2017-12-10T01:18:13.954+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=U1TRA 1NST1CT,realm=EUW,application-id=KYnfKGf0,discussion-id=qtokVgng,comment-id=,timestamp=2017-12-10T01:04:28.723+0000)\nMenschen sind die d&amp;uuml;mmste kreation der Evolution. Intelligenz am Arsch, einfach nur Sprechende Machtgeile Primaten.\n\nOkay das bringt mich etwas zum schmunzeln, da kann ich dir Recht geben :D\n\nWas den Rest zum Teil angeht:\n\nNur weil nicht jeder so stark flamed, bedeutet dies nicht das diese Personen sich nicht aufregen und absolut Emotionslos sind.\n\nIch hab schon oft Dinge in den Chat geschrieben, womit ich mit nur einem Satz ohne Vorstrafe sofort nen Perma kassiert hätte. Hätte ist da das Zauberwort. Anstatt die Nachricht abzuschicken, drück ich einfach nicht Enter und reg mich lieber so auf oder schrei mal kurz.\n\nIn nem Spiel wie lol, wo man weiss wie es läuft, wie schnell man zum teil gebannt wird, muss man sich einfach zusammenreißen können. \nWas zwangsläufig aber nicht bedeutet keine Emotionen zu besitzen.\n\nIch bin sehr schnell reizbar, tilte sehr schnell und oft, aber eine Bestrafung hab ich noch nie kassiert. Und wenn ich doch mal was negatives schreibe, dann verpack ich es eben so gut es geht, das dies nicht banable ist.","replies":[{"poster":"U1TRA 1NST1CT","date":"2017-12-10T01:31:10.371+0000","up_votes":2,"down_votes":3,"body":"Beherrschen ist aber nunmal nicht für jeden Menschen möglich. Ich habe eine stark Traumatische Kindheit hinter mir, bin im bestitz multipler Persönlichkeit, starke Agressionsprobleme, frühere Selbstmordgedanken und depressionen und noch einiges mehr. Wie soll sich bitte eine Gespaltene Persönlichkeit mit starken aggressionsproblemen beherrschein und ruhig bleiben.\n\nDas problem ist das ich Tagelang nur noch verliere weil immer jemand feeded. Und ich weiß verdammt nochmal wie feeden aussieht.\n-Jemand der in den Tower rennt\n-nur mit aa 1v2 macht\n-sich afk hinstellt und kills gibt.\n\nDann gibt es noch die verdammten Trolls.\n-warum sollte ich dir als Jungler bei einem Gank den kill überlassen, ich komme immer so das ich euch die kills klaue und dann lass ich euch im stich und geh einfach afk farmen während alle lanes abkacken durch mangelnde kills.\n-warum sollte ich dir als supp den farm überlassen oder dich heilen/schützen.\n-wozu ss, guck doch auf die karte, mir doch egal das Zed dich campt und wir dadurch verlieren.\n\nUnd dann noch Leute die sich absichtlich über dich lustig machen das du trollteams hast und dich dann einfach ständig als schlecht betiteln, auslachen, dich standig 5v1 tryharden um dich seelisch fertig zu machen.\n\nIch hatte niemals freunde, wurde mein ganzes leben lang von allen fertig gemacht, die gamingwelt ist der einzige ort an dem ich existieren kann. Aber nein man wird einfach bestraft wenn man sich nicht Normgerecht verhält. \n\nRiot logik: Wie du bist anders, nenene so geht das aber nicht. Alle spieler müssen die Fresse halten. Uns doch scheiss egal wie beschissen dein Leben ist und wie stark deine psyche im Arsch ist. heul doch du haufen scheisse. Hier ein Ban wir nehmen dein Geld und hier hast du dafür einen Perma Ban. Weil wir uns richtig einen darauf Wichsen das so kleine geströte pisser wie du fertig gemacht werden.","replies":[{"poster":"Megamaexx","date":"2017-12-10T02:19:19.258+0000","up_votes":9,"down_votes":1,"body":"Riot behandelt alle Spieler gleich. Wenn du psychische Probleme hast, gibt es Experten, mit denen du darüber sprechen kannst. Ein Spiel ist nicht dafür da, deine Probleme zu behandeln. \nAußerdem, du hast geschrieben, dass du von allen fertiggemacht wurdest und deshalb spielst, weil das hier nicht so sein sollte. Nun beschwerst du dich aber gleichzeitig darüber, dass man Leute nicht im Chat fertigmachen darf. Hallo Doppelmoral, mein alter Freund.","replies":[]},{"poster":"Veezey","date":"2017-12-10T02:06:36.257+0000","up_votes":4,"down_votes":1,"body":">Riot logik: Wie du bist anders, nenene so geht das aber nicht. Alle spieler müssen die Fresse halten. Uns doch scheiss egal wie beschissen dein Leben ist und wie stark deine psyche im Arsch ist. heul doch du haufen scheisse. Hier ein Ban wir nehmen dein Geld und hier hast du dafür einen Perma Ban. Weil wir uns richtig einen darauf Wichsen das so kleine geströte pisser wie du fertig gemacht werden.\n\nJa übertreib halt. Muss Riot jetzt etwa auf jede kleine Schneeflocke acht geben? Nein, jeder wird hier gleich behandelt. Wer sich nicht benimmt, fliegt. So einfach ist das. Und woher soll Riot bitte wissen was bei dir so abgeht? Wenn dir das so nahe geht, solltest du Multiplayeer meiden und nur Singleplayer spielen.","replies":[]},{"poster":"Bettnachleger","date":"2017-12-10T08:33:56.438+0000","up_votes":2,"down_votes":0,"body":"> Riot logik: Wie du bist anders, nenene so geht das aber nicht. Alle spieler müssen die Fresse halten. Uns doch scheiss egal wie beschissen dein Leben ist und wie stark deine psyche im Arsch ist. heul doch du haufen scheisse. Hier ein Ban wir nehmen dein Geld und hier hast du dafür einen Perma Ban. Weil wir uns richtig einen darauf Wichsen das so kleine geströte pisser wie du fertig gemacht werden.\n\nAlso was du eigentlich willst, ist eine Sonderbehandlung?\nWas macht dich so besonders, das du eine Sonderbehandlung verdient haettest?\n\nBtw. ein Kumpel von mir hat ebenfalls psysische Probleme. Der ist seit er 16(?) ist Stammgast in der Klapsmuehle, (wurde jetzt auch fruehrentner, weil arbeiten usw. halt nicht ist, auch wenn er nun dennoch alsbald wieder wenigstens ein paar tage die Woche fuer ein paar Stunden etwas macht)\nDennoch flamed er nicht?! \nIst ja auch nicht schwer. Einfach mal die Finger stillhalten. \n\n> Ich hatte niemals freunde, wurde mein ganzes leben lang von allen fertig gemacht, die gamingwelt ist der einzige ort an dem ich existieren kann. Aber nein man wird einfach bestraft wenn man sich nicht Normgerecht verhält.\n\nOh, was ganz was neues, man wird Bestraft wenn man sich nicht an Regeln haellt. Du hast recht, das passiert nur in LoL ... oh warte ... nein, das ist eigentlich ueberall so ....\n\n> Und dann noch Leute die sich absichtlich über dich lustig machen das du trollteams hast und dich dann einfach ständig als schlecht betiteln, auslachen, dich standig 5v1 tryharden um dich seelisch fertig zu machen.\n\n? Hast du dich nicht gerade aufgeregt, das man nicht flamen darf? Nun regst du dich darueber auf, das Leute dich flamen?\nNice Doppelmoral ...","replies":[]},{"poster":"Uranbrennstab","date":"2017-12-10T11:19:33.916+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=U1TRA 1NST1CT,realm=EUW,application-id=KYnfKGf0,discussion-id=qtokVgng,comment-id=00020000,timestamp=2017-12-10T01:31:10.371+0000)\n>\n>\n> Riot logik: Wie du bist anders, nenene so geht das aber nicht. Alle spieler müssen die Fresse halten. Uns doch scheiss egal wie beschissen dein Leben ist und wie stark deine psyche im Arsch ist. heul doch du haufen scheisse. Hier ein Ban wir nehmen dein Geld und hier hast du dafür einen Perma Ban. Weil wir uns richtig einen darauf Wichsen das so kleine geströte pisser wie du fertig gemacht werden.\n\n\n\nEs interessiert auch keinen, was du für Probleme hast, warum auch?  Jeder Mensch hat sein Päckchen zu tragen und denk mal nicht, deins ist irgendwie schwerer oder besonderer als unseres. \nDu verwechselt auch Gleichgültigkeit mit Bosheit, wir haben nichts gegen dich außer die Tatsache, dass du die Regeln verletzt hast.","replies":[]},{"poster":"Red1702","date":"2017-12-10T03:35:52.671+0000","up_votes":1,"down_votes":6,"body":"ich kann dir nur zustimmen","replies":[]}]}]},{"poster":"Wernicke","date":"2017-12-10T05:38:40.275+0000","up_votes":2,"down_votes":2,"body":"> Menschen sind die dümmste kreation der Evolution\n\nZumindest mit dem Teil hast du Recht.\nWir Menschen sind das schlimmste was diesem Planeten passieren konnte.\nAber das zu diskutieren würde wohl etwas den Rahmen hier sprengen und war wohl auch nicht deine eigentliche Intention :D","replies":[{"poster":"Uranbrennstab","date":"2017-12-10T11:12:13.537+0000","up_votes":3,"down_votes":0,"body":"Menschen sind eben nicht dumm, warum sollten Sie das sein? Weil sie sich gegenseitig umbringen und den Planeten ausbeuten? Schon mal daran gedacht wie viel technischen Fortschritt wir Krieg verdanken? Die Grundlagen für alle modernen IT Standarts wurden zB im Falklandkrieg geschaffen. Die Medizin wurde durch die beiden Weltkriege um Jahrzehnte nach vorn katapultiert, nicht zu vergessen die Erkenntnisse der Deutschen im Bereich der Raketentechnik und Düsentriebwerke.\n\nJa Krieg ist scheiße, nutzt aber unter dem Strich der Menschheit mehr als er ihr schadet.","replies":[{"poster":"Lotuskobra","date":"2017-12-10T11:31:55.992+0000","up_votes":1,"down_votes":0,"body":"Schade nur dass der technische Fortschritt so schnell abläuft, dass wir weder ethisch noch psychisch in der Lage sind Schritt zu halten. Wir haben als Menscheit durchaus erstaunliches vollbracht – vor allem in IT und Technik – aber immernoch sind wir nicht in der Lage unsere globalen Probleme zu bekämpfen. Wir arbeiten nur dann zusammen, wenn wir darin einen Nutzen für uns selbst sehen (Ausnahmen bestätigen die Regel) und lassen andere dabei auf der Strecke.\n\nEs ist ein bisschen ironisch, dass wir in einem LoL Forum in der heilen IT Welt des an sich vermögenden Europas darüber diskutieren inwiefern wir als Menschen eine \"Bereicherung\" für diesen Planeten sind und gleichzeitig andere Menschen hungern, bei Anschlägen sterben oder in dieser Sekunde schon bei ihrer Geburt getötet werden, da sie nicht gewollt sind.\n\nWir beuten nicht nur unsere eigene Rasse aus, sondern den ganzen Planeten gleich mit (auch wenn es etliche Leute gibt, die versuchen das zu ändern) und ich glaube darauf wollte Wernicke hinaus. WIR sind zu DUMM zusammenzuarbeiten, einander ernsthaft zu unterstützen und ruinieren mit unserem Verhalten unsere Heimat.\n\nIn dem Sinne\nAmen\n{{summoner:13}}","replies":[{"poster":"Uranbrennstab","date":"2017-12-10T12:25:38.703+0000","up_votes":2,"down_votes":0,"body":"Dinge ethische zu bewerten ist unmöglich. Beispiel Stammzellen: Für viele ist es unverantwortlich Stammzellforschung zu betreiben. Ich finde es unverantwortlich Stammzellforschung nicht zu betreiben. \n\nSo ironisch finde ich das auch nicht, der starke überlebt nunmal. Die Europäer waren zum entscheiden Zeitpunkt die stärkeren. Das ist weder ungerecht noch unverdient und es besteht auch kein Grund diesen Unstand zu bedauern oder zu korrigieren. Selbstzerstörung aus falschen Schuldgefühlen halte ich für unethisch. \n\nWir sind absolut nicht zu dumm zusammenarbeiten es wäre nämlich dumm genau das zu tun. Aus Konflikten entstehen Kriesen, aus Kriesen Lösungen, so funktioniert Fortschritt. Das \"Ausbeuten\" des Planeten führt uns irgendwann dazu, dass wir uns was überlegen müssen wie es weitergeht. Und es wird weitergehen.","replies":[{"poster":"Wernicke","date":"2017-12-10T14:14:27.444+0000","up_votes":4,"down_votes":0,"body":"Ist jetzt bissl OT und nicht ganz passend, aber erinnert mich gerade trotzdem daran. Weils so \"schön\" ist poste ich es trotzdem unpassenderweise (vom Handy, hoffe es geht). \n\nhttps://m.youtube.com/watch?v=YhQQcLHTc5g","replies":[{"poster":"Lotuskobra","date":"2017-12-10T19:39:49.708+0000","up_votes":2,"down_votes":0,"body":"Papalapap Off-Topic, das passt zur sozialen/technischen Komponente dieser Unterhaltung doch perfekt. Elon Musk, Stephen Hawking und andere warnen seit jeher vor dem Thema der AI. Wir als Menschen müssen lernen zusammen füreinander zu stehen und uns darüber Gedanken zu machen, was mit uns und unserer Zukunft passieren soll. Die Rede ist so aktuell wie die Zeitung von morgen!","replies":[{"poster":"Wernicke","date":"2017-12-11T05:34:48.462+0000","up_votes":2,"down_votes":0,"body":"> Die Rede ist so aktuell wie die Zeitung von morgen!\n\nLeider ist das wahr","replies":[]}]}]},{"poster":"Lotuskobra","date":"2017-12-10T12:45:30.470+0000","up_votes":2,"down_votes":0,"body":"Die Bewertung dieser Thematik bildet mittlerweile einen ganzen Forschungsbereich den wir auch dringend brauchen. Im übrigen hast du für dich persönlich auch eine ethische Bewertung vorgenommen, ich habe nie von einem gesellschaftlichen Werten dieser Dinge gesprochen, vllt hab ich mich aber auch nicht klar genug ausgedrückt.\n\nhttps://tu-dresden.de/gsw/phil/iphil/tech\n\nEs geht in meinem Post auch nicht um Schuldgefühle, die wir uns als reiche Nation oder Staatengemeinschaft vorwerfen sollten – das halte ich für den völlig falschen Weg und darum geht es mir auch nicht. Die Problematik ist doch nur, dass etliche Probleme uns als Menschheit über den Kopf gewachsen sind:\n\nWie möchtest du zB das Problem der Überbevölkerung lösen – eine Problematik die durch eine verbesserte technische und medizinische Betreuung enstanden ist (in Kombination mit kulturellen und soziallen Komponenten einer jeden Gesellschaft und eines jeden Individuums). (Die Frage ist im übrigen rein rhetorisch zu verstehen, da bisher niemand eine zufriedenstellende Antwort gefunden hat).\n\nMit deinem letzten Punkt gehe ich prinzipiell konform, gerade auch im Hinblick auf die Entwicklung die uns als Zivilisation noch bevorsteht.\n\nhttps://de.wikipedia.org/wiki/Kardaschow-Skala\n\nEs gibt dazu faszinierende Theorien und Gedankenspiele, ABER: Wir leben als Menschen im hier uns jetzt und schaffen es aktuell noch nicht einmal unsere derzeitigen Probleme – ob durch Konflikte oder Konsens – zu lösen. Wollen wir hoffen, dass wir uns schneller entwickeln können, als die Erde zu zerstören, sonst wird niemand diese Dinge je miterleben.","replies":[{"poster":"eingew","date":"2017-12-10T16:54:55.314+0000","up_votes":2,"down_votes":0,"body":"Kennt ihr das Maus-Utopie Experiment?\nhttps://youtu.be/0Z760XNy4VM","replies":[{"poster":"Lotuskobra","date":"2017-12-10T19:36:56.332+0000","up_votes":1,"down_votes":0,"body":"Ich hab's mir gerade angesehen: Beeindruckend und zugleich auch ein wenig angsteinflößend, man stelle sich die Überlebenskämpfe und Aggressionsausbrüche (inklusive Verdummung anderer Individuen) mit Raketenwerfern und Maschinengewehren vor.\n\nEs ist schon irgendwie bezeichnend, wir verfügen über das Wissen, die Prognosen, die Theorien und die Mittel um diese Vorhersagen zu treffen und zu bewerten, aber wir sind in der Umsetzung unglaublich träge.","replies":[{"poster":"eingew","date":"2017-12-10T20:37:51.697+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lotuskobra,realm=EUW,application-id=KYnfKGf0,discussion-id=qtokVgng,comment-id=0006000100000000000000000000,timestamp=2017-12-10T19:36:56.332+0000)\n>\n> Ich hab&#x27;s mir gerade angesehen: Beeindruckend und zugleich auch ein wenig angsteinflößend, man stelle sich die Überlebenskämpfe und Aggressionsausbrüche (inklusive Verdummung anderer Individuen) mit Raketenwerfern und Maschinengewehren vor.\n\nIch glaube die brauchst du gar nicht. Also, die wären natürlich noch krasser, aber... ein gutes Beispiel für die Aggressionsausbrüche wäre doch Mobbing, welches ja nicht selten in aggressiven Ausbrüchen des Opfers enden, welches wortwörtlich um seine Anerkennung in der Gruppe kämpft. \n\nWas ich vor allem gruselig an der Studie finde, ist nicht nur die Aussicht auf die Zukunft, sondern, dass wir fast alle diese Symptome bereits jetzt entweder schon in unserer eigenen Kultur oder zumindest in anderen Ländern beobachten können.\n\n> Es ist schon irgendwie bezeichnend, wir verfügen über das Wissen, die Prognosen, die Theorien und die Mittel um diese Vorhersagen zu treffen und zu bewerten, aber wir sind in der Umsetzung unglaublich träge.\n\nDas ist das Problem daran, wenn es den Leuten gut geht. Man tut eben erst dann etwas, wenn es wirklich notwendig wird. Da bleibt leider nur noch die Hoffnung, dass das nicht zu spät ist.\nAber die Hoffnung stirbt bekanntlich zuletzt, denn am Ende sind wir eben keine Ratten, sondern Menschen, und bisher war es doch immer so, dass wir kurz vor unserer Zerstörung auf eine geniale Neuerung gekommen sind, die uns scheinbar durch pures Glück dazu gebracht hat, die Umstände zu überleben oder sogar zu unserem eigenen Vorteil zu verändern.","replies":[]}]}]}]}]}]}]},{"poster":"Alustus","date":"2017-12-10T06:03:56.335+0000","up_votes":2,"down_votes":1,"body":"dem Planeten ist es galube ich ziemlich egal, der erholt sich wieder nachdem der Mensch so ziemlich alles leben und sich selbst auf dem Planeten vernichtet hat.\n\nZur Dummheit kommt es ganz auf die Interpretation/Definition an","replies":[]}]},{"poster":"XenesisCH","date":"2017-12-10T10:36:27.428+0000","up_votes":4,"down_votes":0,"body":"> warum noch spieler dafür bestrafen das sie ein höheres Maß an emotionen besitzen als andere\n\nIch hab sehr wohl Emotionen, aber ich halte es nicht für angebracht meine _negativen Emotionen_ in einem Spiel an anderen Menschen auszulassen. Das halte ich ganz einfach für respektlos und so sieht das auch die Community, weshalb sie dir die rote Karte gezeigt hat. Nur weil jemand seine Emotionen nicht zeigt, heisst das nicht dass er keine hat ;).","replies":[]},{"poster":"MeMyselfandBaal","date":"2017-12-10T08:11:04.281+0000","up_votes":4,"down_votes":0,"body":"Du empfindest es also als natürlich, Leute zu beleidigen... interessant.\n\nUnd ich bin auch ein ziemlich emotionaler Spieler. Ich habe immer wieder so Tage, an denen ich tilte und 5 Spiele in Folge verliere. Ich schreie regelmäßig meinen Bildschirm an, weil meine Mitspieler (aus meiner Sicht) Fehler machen. Aber es gibt halt einen entscheidenden Unterschied zwischen Emotionen und einem \"You fukking Noob go uninstall\"... Und ja, man kann aus der Emotion heraus andere Beleidigen. Wenn man das aber immer und immer wieder macht, hat man definitiv ein Problem.\n\nAber wo du schon so viel von dir Preis gibst: Hast du schon mal darüber nachgedacht, ob dein Umgang mit der Emotionalität der Grund ist, warum die nie Freunde hattest? Und wenn ich deine Aussagen hier so lese, hast du ganz andere Probleme als einen 14 Tages Bann...\n\nSind deine ganzen psychischen Probleme eigentlich eine Selbstdiagnose? Wenn ja, solltest du mal darüber nachdenken, ob du die nicht mal bestätigen lässt. Falls nein, solltest du mit den Leuten, die darüber Bescheid wissen über diese Probleme reden. Vielleicht hilft das.\n\nDas schreibe ich alles nicht, weil ich dich provozieren oder aufziehen will. Sondern weil einige Aussagen, die du hier triffst, wirklich besorgniserregend sind.","replies":[]},{"poster":"Killerkante","date":"2017-12-10T04:10:01.091+0000","up_votes":4,"down_votes":0,"body":">aufregen ist so natürlich wie atmen\n\n\nim Mannschaftssport wird man auch vom Platz verwiesen, sollte man anfangen ZU unsportlich zu sein ;)","replies":[{"poster":"Ghionova","date":"2017-12-10T10:23:10.896+0000","up_votes":2,"down_votes":0,"body":"Er verwechselt \"sich aufregen\" mit \"andere beleidigen\". Das ist ein großer Unterschied","replies":[]}]},{"poster":"Tickle My Donger","date":"2017-12-10T12:07:53.894+0000","up_votes":3,"down_votes":0,"body":"Ich würde ja zu gerne mal eure Chatverläufe sehen :D","replies":[]},{"poster":"Drachenlord1510","date":"2017-12-10T01:12:20.346+0000","up_votes":3,"down_votes":0,"body":"Aufregen und Flamen sind zwei verschiedene Sachen.\nAufregen macht man für sich. Wenn man sich aber nicht beherrschen kann und andere Spieler da mit reinzieht, dann ist das nicht nett und meiner Meinung nach ganz zurecht ein Reportgrund.","replies":[{"poster":"U1TRA 1NST1CT","date":"2017-12-10T01:34:08.266+0000","up_votes":1,"down_votes":6,"body":"Kann man eben nicht wenn man stark Psychisch kaputt ist...\nMuten und ruhe, warum nicht einfach dabei belassen. Nein Menschen dürfen keinerlei emotion besitzen. Wenn dir jemand auf der straße dumkommt, hälst du bestimmt auch die klappe. Gaaaanz bestimmt das glaube ich dir aufs wort....","replies":[{"poster":"Drachenlord1510","date":"2017-12-10T02:13:55.802+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=U1TRA 1NST1CT,realm=EUW,application-id=KYnfKGf0,discussion-id=qtokVgng,comment-id=00000000,timestamp=2017-12-10T01:34:08.266+0000)\n>\n> Kann man eben nicht wenn man stark Psychisch kaputt ist...\n> Muten und ruhe, warum nicht einfach dabei belassen. Nein Menschen dürfen keinerlei emotion besitzen. Wenn dir jemand auf der straße dumkommt, hälst du bestimmt auch die klappe. Gaaaanz bestimmt das glaube ich dir aufs wort....\n\nAlso ich brülle nicht Leute an, wenn ich wütend bin. Natürlich darf man Emotionen haben, da kann man ja auch selber nichts dran machen. Aber es ist eine ganz andere Sache, diese Emotionen auch rauszulassen. Das machen nur Arschlöcher.","replies":[]},{"poster":"Nycaria","date":"2017-12-10T02:04:11.936+0000","up_votes":1,"down_votes":0,"body":">Kann man eben nicht wenn man stark Psychisch kaputt ist...\n\nNatürlich geht das. Eine kaputte Psyche kann man nicht als Ausrede für alles verwenden.\n\nNiemand behauptet dass du dich nicht aufregen darfst, wenn ein Game mal nicht so gut läuft. Allerdings eben nicht im Chat.","replies":[]},{"poster":"Ghionova","date":"2017-12-10T10:27:10.772+0000","up_votes":3,"down_votes":0,"body":"Kannst ja nicht irl gebannt werden. In den AGB steht sogar drin, das du aufgrund negativen Verhaltens (Beleidigungen etc.) Konsequenzen davon tragen musst. Das kann dir doch egal sein, du siehst diese Leute nach der Runde eh nie wieder und selbst wenn kannst du dich auch nicht mehr daran erinnern. Durch Beleidigungen lernen die nichts, die fühlen sich nur angegriffen und beleidigen dann zurück oder sind so schlau und muten dich...Wenn dein Team nicht in der Lage ist mit dir zu kooperieren, versuch es alleine zu gewinnen.","replies":[]},{"poster":"eingew","date":"2017-12-10T07:51:02.351+0000","up_votes":2,"down_votes":0,"body":"Es besteht ein Unterschied zwischen \"Emotionen herauslassen\" und \"Flamen\". Das ist \"Emotionen *an anderen* auslassen\". Ist es das was du willst? Nun, dann musst du damit leben, dass dir wieder und wieder für dein Verhalten die Tür gezeigt wird und deine persönliche Lebenserfahrung ändert daran überhaupt nichts.\n\nFluchen und aufregen ist völlig normal und wird von Riot sogar ausdrücklich in den Schutz genommen. Blame und Flame fällt nicht unter diese Kategorie.\n\nUnd wenn mir auf der Straße jemand dumm kommt... warum sollte es für mich von nennenswertem Interesse sein, wenn mir jemand auf der Straße dumm kommt? Das letzte Mal hab ich den Typen ausgelacht und damit hatte sich die Sache.\n\nAbgesehen davon berechtigt dich deine persönliche Lebenserfahrung nicht dazu, aus diesem Opferstatus Profit in Form von der Erlaubnis, unangemessenes Verhalten zu zeigen, zu schlagen. Ich persönlich würde jemandem mit angeschlagener Psyche ohnehin nicht empfehlen, ein Spiel, welches bereits gesunde Personen in sehr emotionale Zustände befördern kann, häufig zu zocken.","replies":[]}]}]},{"poster":"Anishera","date":"2017-12-11T11:33:29.262+0000","up_votes":2,"down_votes":0,"body":"Man kann sich auch aufregen, ohne andere zu beleidigen. Niemand hindert dich daran, wild fluchend vor deinem Rechner zu sitzen und LoL zu spielen. Kannst also deine \"Emotionen\" frei ausleben. Ist fast wie im richtigen Leben. Unzählige Menschen fluchen täglich beim Autofahren in ihrem Auto vor sich hin, weil sie sich über andere Autofahrer aufregen. Alles kein Problem. Ein Problem wirds dann, wenn der Autofahrer an einer roten Ampel aussteigen würde und den anderen Autofahrer direkt beschimpfen würde. Dann kann das u.u. genau so unangenehme Konsequenzen nach sich ziehen, wie in LoL, wenn du anfängst deine \"Emotionen\" in den Chat zu tragen. \n\nUnd ich glaub auch kaum, dass du z.B deinen Chef/Cheffin flamen würdest, wenn du dich über ihn/sie ärgerst...du denkst vielleicht \"du dummer Wic..er\", aber es auszusprechen würdest du ja auch nicht tun, da du genau weisst, das das dann dein letzter Tag in dieser Firma gewesen wäre. :)","replies":[]},{"poster":"BlackAjani","date":"2017-12-11T07:53:21.617+0000","up_votes":2,"down_votes":0,"body":"> Hoffentlich fängt Bald mal einer von denen an den dritten Weltkrieg zu starten hab kein bock mehr auf diese Welt.\n\nMach halt mal einen Rucksacktouri nach Somalia oder so\nhttps://media.giphy.com/media/l0HlRYuuMlMi7IASc/giphy.gif","replies":[{"poster":"eingew","date":"2017-12-11T08:01:13.811+0000","up_votes":2,"down_votes":0,"body":"Fun Fact: Die Hauptstadt von Somalia wird als die teuerste Stadt der Welt für Touristen geführt, weil man dort zur eigenen Sicherheit Soldaten vom Staat anmieten sollte (die 50$ die Stunde pro Soldat kosten und 2 sollte man sich schon holen), zudem durch den Staat bereitgestellte Touristenguides nehmen sollte und eben sichere Hotels nutzen sollte... da kommt ganz schön was zusammen.","replies":[{"poster":"BlackAjani","date":"2017-12-11T08:10:44.967+0000","up_votes":2,"down_votes":0,"body":"Ich wollte zum Glück lediglich Poke-Trainer werden und nicht Pirat.","replies":[]}]}]},{"poster":"Alustus","date":"2017-12-10T05:56:11.758+0000","up_votes":3,"down_votes":1,"body":"Nur weil sich aufregen natürlich ist, ist es flamen noch lange nicht.\n\nMit deiner Argumentation könnte man auch morden rechtfertigen, da die meisten aufgrund von emotionen/aufregen begangen werden.\n\n\n> Man wie ich mich freue das es Momentan so viele Vollpfosten an der Macht gibt. Hoffentlich fängt Bald mal einer von denen an den dritten Weltkrieg zu starten hab kein bock mehr auf diese Welt. Menschen sind die dümmste kreation der Evolution. Intelligenz am Arsch, einfach nur Sprechende Machtgeile Primaten.\n\n\nDieser Satz lässt mich an deinem Geisteszustand zweifeln.\nGenerell würde ich dir empfehlen einen Psychologen aufzusuchen.","replies":[{"poster":"Revilous","date":"2017-12-10T08:02:28.299+0000","up_votes":1,"down_votes":2,"body":"Hat er aber Recht eigentlich wenn man mal so drüber nachdenkt","replies":[{"poster":"eingew","date":"2017-12-10T08:17:38.608+0000","up_votes":2,"down_votes":0,"body":"Pah. Mir gefällt ja weder Trump, noch der genannte Diktator aus Nordkorea, aber die Behauptung, diese Personen seien dumm und hätten absolut keine Ahnung, was sie da eigentlich tun ist angesichts ihrer bisherigen Leistungen (zumindest bei Trump) realitätsfern. Aber bei unserer Berichterstattung ist es natürlich schwer zu einem anderen Schluss zu kommen, als den, den TE nennt. Wir haben definitiv Probleme, einige davon sicher ziemlich groß, Trump kommt mMn aber sehr weit hinten in dieser Liste.","replies":[{"poster":"Revilous","date":"2017-12-10T14:43:30.808+0000","up_votes":2,"down_votes":0,"body":"Du willst also behaupten, dass jemand, der glaubt, die Klimaerwärmung wäre ein von den Chinesen ausgedachtes Märchen und ihn deshalb der Umweltschutz nicht juckt, nicht einer der dümmsten Menschen der Welt ist? Da wäre mir ja jemand lieber, der an die flache Erde glaubt ^^\n\nIch darf nicht behaupten, ich würde es besser machen, auch, weil mir sowieso keiner glauben würde und ich kaum Lebenserfahrung habe und noch nicht mal studiert habe. Aber wenn ich mir AfD, Trump usw. angucke, frage ich mich schon, warum soviele Leute sowas wählen, wo es doch jeder halbwegs vernünftige Mensch besser hinkriegen würde...","replies":[{"poster":"eingew","date":"2017-12-10T16:38:28.850+0000","up_votes":2,"down_votes":0,"body":"Ich glaube nicht, dass man an diesem einen Thema fest machen kann, wie intelligent jemand ist. Zudem ist schwer zu sagen, was er tatsächlich glaubt. Es ist bekannt, dass der Klimawandel in den USA nach wie vor rege diskutiert wird, es mag ein riskanter Versuch sein, auf diesen Zug für den Wahlkampf aufzuspringen, aber das würde zu seinem Wahlkampf und seiner Person passen, oder nicht?\n\nTrump war im Laufe seines Lebens auf vielen verschiedenen Gebieten erfolgreich (auf manchen zugegebenermaßen auch nicht). Er ist nicht ohne etwas dafür zu tun in der obersten Einkommensschicht Amerikas geblieben. Klar kann man aufgrund seiner Aussagen urteilen, dass er halt ein Idiot sei, ich persönlich bin aber der Meinung, dass man es sich damit verdammt einfach macht.\n\nWas die Wähler von Trump oder der AfD angeht, so bezweifle ich massiv, dass diese durch die konkreten Parteien selbst überzeugt wurden. Bei der AfD zB hat die ARD ja kurz nach der Wahl die Statistik veröffentlicht, dass 60% derer Wähler angeben, nicht dieselben Werte zu vertreten, wie die AfD es tut. Gerissen hat es vermutlich in erster Linie das völlige Versagen der regierenden Parteien bei der Flüchtlingskrise und kurz darauf beim Wahlkampf. Der Wahlkampf der SPD hat ja, könnte man sagen, sogar erst begonnen, als Jamaika geplatzt ist. Die linken Parteien haben es ebenfalls versäumt, die wichtigsten Probleme angemessen anzusprechen und der Allgemeinheit gefällige Lösungen dafür zu präsentieren.\n\nIch glaube nicht, dass besonders viele Menschen die AfD in die Regierung gewählt haben. Die meisten (vermutlich alle der eben genannten 60%) wollten sie höchstwahrscheinlich in der Opposition sehen.\n\nUnd ich muss ganz ehrlich zugeben, dass es mir verdammt gut gefällt, dass endlich mal wieder ein bisschen Stimmung im Laden ist.","replies":[{"poster":"Revilous","date":"2017-12-10T17:09:26.069+0000","up_votes":1,"down_votes":0,"body":"Eine Partei, die den Co2 Ausstoß für Propaganda hält, die den Atomausstieg zurücknehmen will, die den Grenzschutz wieder einführen will und laut der der Islam nicht zu Deutschland gehört ist auch in der Opposition richtig schlecht. Klar, die meisten, die sie gewählt haben, haben sich das Parteiprogramm wahrscheinlich nicht mal durchgelesen aber das zeugt doch auch von Dummheit oder nicht?\n\nSelbst wenn Trump weiß, wie ernst der Klimawandel ist und bloß zu Wahlkampfzwecken das Gegenteil behauptet hat, ist es schon ziemlich erbärmlich, dass er die Dummheit seiner Wähler ausgenutzt hat und es auch noch funktioniert hat. \n\nZudem war er nicht verschiedenen Bereichen erfolgreich, er hat einfach nur reich geerbt. Er ist sogar von der Schule geflogen und musste auf eine Millitärakademie. Er wurde erst durch das Fernsehen berühmt, aber erst nachdem er die Goldene Himbeere als schlechtester Newcomer und schlechtester Nebendarsteller erhielt und sogar in einem Porno mitgespielt hat. Er ist vielleicht ein mehr oder weniger erfolgreicher Geschäftsmann, aber ob das für einen Präsidenten so gut ist?\n\nWenn man übrigens Trump googlet, kommt zuerst \"sexuelle Belästigung: Trump\" und \"Trump: Der Unkontrollierbare\", Fazit: Er IST ein Idiot und seine Wähler und Supporter genauso.","replies":[{"poster":"eingew","date":"2017-12-10T17:42:01.228+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Revilous,realm=EUW,application-id=KYnfKGf0,discussion-id=qtokVgng,comment-id=000700000000000100000000,timestamp=2017-12-10T17:09:26.069+0000)\n>\n> Eine Partei, die den Co2 Ausstoß für Propaganda hält, die den Atomausstieg zurücknehmen will, die den Grenzschutz wieder einführen will und laut der der Islam nicht zu Deutschland gehört ist auch in der Opposition richtig schlecht. Klar, die meisten, die sie gewählt haben, haben sich das Parteiprogramm wahrscheinlich nicht mal durchgelesen aber das zeugt doch auch von Dummheit oder nicht?\n\nNun, du wirst wohl damit leben müssen, dass es einige Menschen auf dieser Erde gibt, die zu diesem Thema deutlich andere Meinungen haben als du. Was den Grenzschutz angeht, so ist die Regierung im übrigen gesetzlich sogar dazu verpflichtet. Und das ist auch gut so. Wie bitteschön kann es angemessen sein, seine Grenzen nicht zu kontrollieren?\nIch glaube im übrigen, dass das Parteiprogramm der AfD *deutlich* häufiger gelesen wurde in diesem Wahlkampf, als irgendein anderes, besonders von den AfD Wählern, waren es doch die, deren Wahl an wirklich *allen* Ecken und Enden in Frage gestellt wurde und die sich daher vermutlich sogar deutlich mehr Gedanken zu ihrer Wahl gemacht haben, als irgendjemand sonst.\n\nDie Aussage, dass der Islam nicht zu Deutschland gehöre ist abgesehen davon faktisch richtig. Es stimmt, dass mittlerweile viele Muslime oder Kinder der türkischen Kultur zu Deutschland gehören, die Religion des Islam hat kulturell aber einen minimalen Einfluss und macht keinen nennenswerten Teil Deutschlands aus. Jedenfalls nicht mehr als andere Minderheiten auch, bei denen übrigens nicht ansatzweise ein solcher Aufstand gemacht wird.\nZudem sollte sich mMn jeder, der der Meinung ist, dass \"der Islam\" als undifferenziertes Ganzes schon als Teil Deutschlands betrachtet werden kann oder sollte, eingehende Gedanken darüber machen, was er sich da eigentlich wünscht.\n\nhttps://youtu.be/GWW4yNJwgiY\n\n> Selbst wenn Trump weiß, wie ernst der Klimawandel ist und bloß zu Wahlkampfzwecken das Gegenteil behauptet hat, ist es schon ziemlich erbärmlich, dass er die Dummheit seiner Wähler ausgenutzt hat und es auch noch funktioniert hat. \n\nWillkommen in der Politik ^^. Ich hab einen Buchtipp für dich: Machiavellis \"der Fürst\".\n\n> Zudem war er nicht verschiedenen Bereichen erfolgreich, er hat einfach nur reich geerbt. Er ist sogar von der Schule geflogen und musste auf eine Millitärakademie. Er wurde erst durch das Fernsehen berühmt, aber erst nachdem er die Goldene Himbeere als schlechtester Newcomer und schlechtester Nebendarsteller erhielt und sogar in einem Porno mitgespielt hat. Er ist vielleicht ein mehr oder weniger erfolgreicher Geschäftsmann, aber ob das für einen Präsidenten so gut ist?\n\nDu wirst schon verdammt lange suchen müssen, bis du einen Politiker findest, der nicht in irgendwelchen hohen Kreisen der Wirtschaft verkehrt. Klar, nicht jeder ist Multimilliardär, aber Geschäftsmänner sinds am Ende doch alle. \nUnd in den USA wirst du auch niemals einen anderen Präsidenten bekommen, bei der Kohle, die man für den Wahlkampf verbrennen muss.\n\nKlar, am Ende bin ich da irgendwo bei dir, das sollte anders laufen, aber es ist Unsinn, Trump spezifisch dafür zu kritisieren. Das ist kein Problem mit Trump, das ist ein Problem mit dem amerikanischen Wahlsystem. Und das Problem existiert noch dazu in den meisten Staaten dieser Erde...\n\n> Wenn man übrigens Trump googlet, kommt zuerst &quot;sexuelle Belästigung: Trump&quot; und &quot;Trump: Der Unkontrollierbare&quot;, Fazit: Er IST ein Idiot und seine Wähler und Supporter genauso.\n\nDie \"sexuelle Belästigung\", bei der Trump davon sprach, dass die Frauen es mit sich machen lassen, weil er berühmt ist und sie deshalb wollen, dass er sie angrapscht? Hey, der Typ ist ein Arschloch und Frauen die es von diesem Typen wollen, bloß weil er berühmt ist, sind mMn ebenso verachtenswert, aber das Belästigung zu nennen? Zur Belästigung gehört schon eine Person, die ein Problem mit dem Geschehenen hat. Wer ist das? Die Journalisten, die darüber berichten?\n\nAbgesehen davon wüsste ich nicht, inwiefern deine schwarz-weiß Sicht auf das Geschehen in irgendeiner Weise sinnvoll seien soll. Du solltest deutlich mehr Zeitung lesen. Also nicht nur eine. Möglichst viele von möglichst vielen verschiedenen politischen Blickwinkeln.","replies":[{"poster":"Revilous","date":"2017-12-10T18:35:51.327+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=qtokVgng,comment-id=0007000000000001000000000000,timestamp=2017-12-10T17:42:01.228+0000)\n>\n> Nun, du wirst wohl damit leben müssen, dass es einige Menschen auf dieser Erde gibt, die zu diesem Thema deutlich andere Meinungen haben als du. \n\nDas ist das Problem an der Sache.\n\n> Was den Grenzschutz angeht, so ist die Regierung im übrigen gesetzlich sogar dazu verpflichtet. Und das ist auch gut so. Wie bitteschön kann es angemessen sein, seine Grenzen nicht zu kontrollieren?\n\nIch meinte eigentlich die Wehrpflicht und Wehrpflichtige an den Grenzen so wie in der DDR (?)\n\n> Ich glaube im übrigen, dass das Parteiprogramm der AfD *deutlich* häufiger gelesen wurde in diesem Wahlkampf, als irgendein anderes, besonders von den AfD Wählern, waren es doch die, deren Wahl an wirklich *allen* Ecken und Enden in Frage gestellt wurde und die sich daher vermutlich sogar deutlich mehr Gedanken zu ihrer Wahl gemacht haben, als irgendjemand sonst.\n\nIch kann mir gar nicht vorstellen, dass es viele Leute gibt, die solche Meinungen vertreten.\n\n> Die Aussage, dass der Islam nicht zu Deutschland gehöre ist abgesehen davon faktisch richtig. Es stimmt, dass mittlerweile viele Muslime oder Kinder der türkischen Kultur zu Deutschland gehören, die Religion des Islam hat kulturell aber einen minimalen Einfluss und macht keinen nennenswerten Teil Deutschlands aus. Jedenfalls nicht mehr als andere Minderheiten auch, bei denen übrigens nicht ansatzweise ein solcher Aufstand gemacht wird.\n\nWenn Muslime zu Deutschland gehören, so gehört auch deren Kultur zu Deutschland. Die AfD will das Schächten von Tieren nach muslimischer Art verbieten und muslimische Organisationen sollen keinen Körperstatus erhalten laut der AfD.\n\n> Zudem sollte sich mMn jeder, der der Meinung ist, dass &quot;der Islam&quot; als undifferenziertes Ganzes schon als Teil Deutschlands betrachtet werden kann oder sollte, eingehende Gedanken darüber machen, was er sich da eigentlich wünscht.\n\nWas hast du denn gegen den Islam?!?\n\n> Die &quot;sexuelle Belästigung&quot;, bei der Trump davon sprach, dass die Frauen es mit sich machen lassen, weil er berühmt ist und sie deshalb wollen, dass er sie angrapscht? Hey, der Typ ist ein Arschloch und Frauen die es von diesem Typen wollen, bloß weil er berühmt ist, sind mMn ebenso verachtenswert, aber das Belästigung zu nennen? Zur Belästigung gehört schon eine Person, die ein Problem mit dem Geschehenen hat. Wer ist das? Die Journalisten, die darüber berichten?\n\nIch habe keine Ahnung, hab den Artikel nicht gelesen aber das stand da so.\n\n> \n> Abgesehen davon wüsste ich nicht, inwiefern deine schwarz-weiß Sicht auf das Geschehen in irgendeiner Weise sinnvoll seien soll. Du solltest deutlich mehr Zeitung lesen. Also nicht nur eine. Möglichst viele von möglichst vielen verschiedenen politischen Blickwinkeln.\n\nIch lese keine Zeitung, ich bekomme nur alles durch die Schule mit oder über Twitter aber meistens google ich das, was ich wissen will.","replies":[{"poster":"eingew","date":"2017-12-10T20:22:31.801+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Revilous,realm=EUW,application-id=KYnfKGf0,discussion-id=qtokVgng,comment-id=00070000000000010000000000000000,timestamp=2017-12-10T18:35:51.327+0000)\n>\n> Das ist das Problem an der Sache.\n> \n> Ich meinte eigentlich die Wehrpflicht und Wehrpflichtige an den Grenzen so wie in der DDR (?)\n\nNun, das war für mich aus deiner Aussage, dass die AfD \"den Grenzschutz\" wieder einführen will nicht ersichtlich. Abgesehen davon verstehe ich den Sinn des Vergleichs zur DDR nicht, die wollte doch etwas gegen Ausreisen tun, an welcher Stelle hat sich die AfD auch nur in irgendeiner Weise über Ausreisende beschwert? Das ist mir völlig neu.\n\nEntsprechend meinst du mit \"der Wehrpflicht\" vermutlich auch nicht meine Assoziation der Wehrpflicht, die wir 1950 eingeführt haben, damit unser Militär nicht so völlig unkontrollierbar wird, wie es in der Weimarer Republik war, weil durch die allgemeine Wehrpflicht auch in der allgemeinen Bevölkerung rekrutiert wird und nicht nur in den entsprechenden Milieus?\n\n> Ich kann mir gar nicht vorstellen, dass es viele Leute gibt, die solche Meinungen vertreten.\n\nAuch das ist unspezifisch, welche Meinungen meinst du? Die, die die AfD vertritt?\n\n> Wenn Muslime zu Deutschland gehören, so gehört auch deren Kultur zu Deutschland.\n\nSo einfach ist das sicherlich nicht.\n\n> Die AfD will das Schächten von Tieren nach muslimischer Art verbieten und muslimische Organisationen sollen keinen Körperstatus erhalten laut der AfD.\n\nZum einen ist die rituelle Schlachtung von Tieren in Deutschland *bereits jetzt* generell verboten und benötigt eine Sondergenehmigung, wenn überhaupt reden wir also über eine Beendigung dieser Sondergenehmigungen, welche bereits jetzt für Muslime nur äußerst selten vergeben werden, zum anderen halte ich es für Unsinn, dafür kämpfen zu wollen, Tiere ohne Betäubungsmittel töten zu wollen. Vor allem zumal es offenbar eine islamische Lehre gibt, laut der das Einsetzen von Betäubungsmitteln bei der rituellen Schlachtung *erlaubt* sein soll, ich sehe also nicht, was dem noch im Wege stehen soll. Daran wird auch die AfD nichts ändern.\n\nZum anderen gibt es, [wenn ich das gerade richtig sehe](https://www.personenstandsrecht.de/PERS/DE/Themen/Informationen/Religionsgemeinschaften/religionsgemeinschaften_node.html), keine einzige muslimische Organisation in Deutschland, die den Körperschaftsstatus erhalten hat. Das wird sich, solange man sich bei Beobachtungen durch den Verfassungsschutz weiterhin querstellt oder, was auch auf einige der Organisationen zutrifft, bei der Beachtung der Staatstreue und des Selbstbestimmungsrecht weigert, die Bestimmungen zu erfüllen, auch nicht ändern.\nZusätzlich ist es offenbar bei Moscheen und islamischen Verbänden bisher nicht üblich, eine Mitgliederkartei zu führen, welche zwar nur eine Formsache, aber ebenfalls eine Voraussetzung für die Anerkennung als Körperschaft ist.\n\nIch verstehe nicht, warum die AfD bei diesen Punkten eine dermaßene Wichtigkeit mit ihren Forderungen einnehmen soll, zumal diese doch offenbar an der aktuellen Situation nichts ändern. Und die aktuelle Situation ist mMn auch gut so, gegen eine Verschärfung der Regeln, wie die AfD sie möglicherweise fordert, bin ich genauso wie du. Aber die bisherigen Regeln machen meiner Ansicht nach durchaus Sinn.\n\n> Was hast du denn gegen den Islam?!?\n\nHast du das Video, was ich direkt unter diesem Absatz verlinkt habe, angesehen? Weiterhin interessant ist für dich sicherlich auch dieses informative Prachtstück:\n\nhttps://youtu.be/CoHr4hlK4FU\n\nWenn du noch mehr von diesen Dingen wissen willst, in der Videobeschreibung ist die Studie über die der Herr redet, verlinkt. Sehr aufschlussreich und erklärt sehr gut, warum ich deutliche Vorbehalte gegen diese Religion habe, sofern man sie lediglich im ganz groben und allgemeinen Kontext betrachtet. Liberale Muslime, die für einen säkularen Staat, das Selbstbestimmungsrecht (insbesondere der Frau) und unsere Werte eintreten, sind mir jederzeit willkommen und ich sehe keinen Grund, warum ich ein Problem mit diesem Teil und dieser Auslebung des Islam haben sollte. Der Islam im Allgemeinen besteht aber durchaus auch aus fanatischen Teilen, die nicht in der zu missachtenden Minderheit sind, wie es von gewissen Journalisten und politischen Parteien gerne mal vertreten wird. Sie machen im Gegenteil einen sehr lauten und ausdrucksstarken Teil der Religion aus, der zwar noch lange keine Mehrheit ist, aber bereits eine viel zu große Masse ist.\n\n> Ich habe keine Ahnung, hab den Artikel nicht gelesen aber das stand da so.\n\nIch glaube, dass das (leider) im aktuellen politischen Klima nicht mehr ausreicht. Leider sind die Medien voll von scheinheiligen Verzerrungen der Realität bis ins unkenntliche. Deshalb sollte man wie gesagt alle politischen Blickwinkel auf die Situation verfolgen, um am Ende in der Lage zu sein, irgendwo in der Mitte aller Sichtweisen so etwas ähnliches wie einen realistischen Blick auf die Situation zu bekommen.\n\n> Ich lese keine Zeitung, ich bekomme nur alles durch die Schule mit oder über Twitter aber meistens google ich das, was ich wissen will.\n\nNaja, auch das ist ja nicht schlecht, solange man mehr als eine Quelle benutzt.","replies":[]}]}]}]}]}]},{"poster":"Uranbrennstab","date":"2017-12-10T11:07:13.780+0000","up_votes":1,"down_votes":0,"body":"Da Trump gerade munter einen 3.WK provoziert würde ich ihn schon weit nach vorne setzen.","replies":[{"poster":"eingew","date":"2017-12-10T16:43:11.575+0000","up_votes":2,"down_votes":0,"body":"Trump ist sicherlich ignorant in seiner Außenpolitik, zu behaupten, dass seine Gegner ihm aber in irgendeiner Weise nachstünden, halte ich für mindestens ebenso ignorant. Es geht hier am Ende immer noch um eine Diktatur und eine Ansammlung von Terroristen.","replies":[]}]}]}]}]},{"poster":"Visimar","date":"2017-12-10T01:29:20.889+0000","up_votes":2,"down_votes":0,"body":"Läuft bei dir. \n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"Meridian Dance","date":"2017-12-10T12:47:36.510+0000","up_votes":3,"down_votes":1,"body":"Very gud thread. I rate 9/11. {{champion:48}}  {{champion:48}}  {{champion:48}}","replies":[{"poster":"Lantami","date":"2017-12-11T00:17:19.426+0000","up_votes":1,"down_votes":0,"body":"Rehli? Iz zat zo? Ei rait 5/7","replies":[]}]},{"poster":"KorSett","date":"2017-12-10T01:48:51.697+0000","up_votes":1,"down_votes":0,"body":"6/10 {{champion:48}}","replies":[]}]}