{"poster":"Superbahamut","date":"2019-11-17T01:31:38.504+0000","title":"Rabadon Todeshaube als erstes item?","subforum":"Champions & Gameplay","up_votes":3,"down_votes":2,"body":"Hallo Zusammen.\r\n\r\nEin Freund von mir spielt oft Magier in der Midlane und hat die Angewohnheit, Rabadons Todeshaube als erstes Item zu bauen. Also, er holt sich standartmässig mit dem Startgold: Dorans Ring, dann irgendwann noch Schuhe und sonst fängt er gleich an an Rabadon zu bauen.\r\n\r\nJetzt versuchen wir im das eigentlich schon ne Weile auszureden, mit dem Argument, dass es als 1.Item ineffizient ist und lieber zuerst mal nen zb. Ludens Echo bauen soll.\r\nLeider stossen wir da bei ihm auf taube Ohren und wenn man rein die Statistiken ansieht, hat er trotzdem seinen Dmg und KDA. \r\nIm praktischen wirkst halt so, dass er in den fights nicht so nützlich ist, wie er sein könnte.\r\n\r\n\r\nLeider haben wir kein aktuelles Thema dazu gefunden, darum dachte ich, ich frag mal hier nach Meinungen:\r\n\r\nKann das Sinn machen Rabadon als erstes zu bauen? \r\n\r\nEgal ob: Ja, Nein, unter Umständen\r\nBitte begründet eure Antwort(nur bitte nicht mit \"es machen alle so\"), damit ich es verstehe und ggf. weiterleiten kann.\r\n\r\n\r\n\r\nIch danke Jetzt schon mal allen für ihre Antwort und wünsche noch ein schönes Wochenende\r\n{{sticker:slayer-jinx-catface}} \r\n\r\n\r\nFreundliche Grüsse\r\nSuperbahamut","replies":[{"poster":"Mistér Hydé","date":"2019-11-17T03:42:46.181+0000","up_votes":4,"down_votes":0,"body":"also außer auf Vladimir bzw. Energiechampions wäre das sinnvollste Argument das man eigentlich relativ schnell Manaprobleme hat wenn man auf Raba first geht.","replies":[]},{"poster":"CG Mörglife","date":"2019-11-17T15:21:26.374+0000","up_votes":3,"down_votes":0,"body":"Es ist einfach ineffizienter als andere alternativen.\n\nMal angenommen man rusht wirklich Rabadons ist man mit ein paar abilities oom, hat man in der zeit niemanden getötet war das verschwendetes Gold.\nIm Gegensatz dazu hätte Luden's viel mehr geholfen. Kostet weniger, gibt AP, Mana, CDR und Mana regen.\n\nWenn du die zwei mal vergleichst hast du bei Rabadons im early game nur 30AP mehr, hast dafür aber 400 Gold mehr ausgegeben, hast die Luden's passive nicht, kein Mana, keine CDR.\nZusätzlich hat Lost Chapter, was du dir normalerweise auf dem ersten back kaufst (wenn du ein Champion bist der Luden's kauft), noch die passive dass bei jedem Level Up 3 Sekunden lang 20% des maximalen Manas wiederhergestellt wird. Also perfekt für die Laning Phase, du kannst länger auf der lane bleiben, länger, mehr und effizienter farmen/ wave managen und und und.\n\nSelbst wenn du, mal angenommen, deine lane komplett stompst, also wirklich hart dominierst macht ein Mejais viel mehr sinn weil es viel Goldeffizienter ist.\nDu kriegst für 1400 Gold bei vollem Stack 145 AP und 200 Mana. Wenn du keine Manaprobleme hast kannst du danach meinetwegen Rabadons rushen, aber nie als first item. Da würde Rabadons Sinn machen, weil dann Rabadon's passive richtig reinkickt (voll gestackter Mejai's + Rabadons = 371 AP).","replies":[{"poster":"Superbahamut","date":"2019-11-17T18:50:44.446+0000","up_votes":2,"down_votes":0,"body":"> Wenn du die zwei mal vergleichst hast du bei Rabadons im early game nur 30AP mehr\n\nes ist eben nicht nur 30 sondern 78 mehr(die 40% bonus ap zählen bei ihm selbst ja auch).\nUnd ich vermute mal, dass die 168ap mit einem item sein hauptbeweggrund sind.\n\n\n\nBeim Rest geb ich dir absoult Recht und dass ist auch das was wir ihm versuchen klarzumachen^^","replies":[{"poster":"CG Mörglife","date":"2019-11-19T08:40:42.255+0000","up_votes":1,"down_votes":0,"body":"Ja gut das kann sein, hab mir jetzt nicht errechnet wie viel das genau sind ^^.\nAber man schaue sich mein letztes Game an, das kannst du deinem Kumpel eher als Build raten.\n\nIch hab gesehen dass die Ahri schlecht ist und ich die Lane gewinnen werde, also first back Dark Seal gekauft, dann lost Chapter + Boots, Dann Mejais ausgebaut weil er schon voll gestackt war, dann Luden's, dann Rabaddons.\nLuden's und Rabaddons hätte man theoretisch tauschen können, aber Raba ist halt so mega teuer und wie andere gesagt haben, wenn man zurück auf die Lane geht will man auch stärker zurück kommen. Zusätzlich haben meine Q's so schon weh getan, zusammen mit Luden's tut das noch mehr weh und ich muss nicht die ganze zeit direkt treffen ^^.\n\nHätte ich hier pur Rabadons gerusht hätte ich bei weitem nicht so gut ge snowballed wie mit den items.","replies":[]}]}]},{"poster":"Yuiwara","date":"2019-11-17T08:56:52.188+0000","up_votes":3,"down_votes":0,"body":"rabadon: \n- als mana-champ fehlt dir der manakristall/lost chapter im eq ne ganze weile --> musst häufiger resetten\n- einzelbausteine raba sehr teuer, dh man spielt lange ohne verbesserungen des eq, andere items kann man früher die Bausteine erhalten, sodass man vllt bei erzwungenen early reset oder death bereits verbesserungen mit auf lane bringen kann\n+ ist natürlich enorm viel AP, was man dann hat. \n\nallerdings würde ich den Effekt vom Ludens dennoch vorziehen, besonders da durch ludens ja gleichzeitig noch der manapool ausgebaut wird oder aber stab des seraphen um manaschild, manapool auszubauen, je nach champ. Raba hat nur raw power, keine sonstige nützlichkeit. Zudem fehlt Abklingzeit. Falls man allerdings einen manaunabhängigen ap-champ hat, könnte raba grundsätzlich keine schlechte wahl sein, auch wenn ich dann verm eher hextech gunblade vorher bauen würde wegen des LL und danach verm erstmal anderes AP-eq, welches utility wie abklingzeit, effekte wie stasis oä mitbringen.\n\nFür mich ist raba also eher nen lategame items.","replies":[{"poster":"Superbahamut","date":"2019-11-17T18:52:53.993+0000","up_votes":1,"down_votes":0,"body":"also ich möchte aus privatsphärengründen nicht genau sagen was er spielt etc. aber es ist kein Vladimir, bei dem es hier oft heisst, da sei es noch nachvollziehbar.","replies":[{"poster":"Droxstar","date":"2019-11-17T20:49:47.269+0000","up_votes":1,"down_votes":0,"body":"Also ich kann mir deine Matchhistory anschauen und gucken wer von deinen Leuten in der Motta immer Rabadons first baut. Kannst den Champion ruhig benennen. :P","replies":[{"poster":"Superbahamut","date":"2019-11-18T00:11:33.033+0000","up_votes":1,"down_votes":0,"body":"das du meine chathistory anschauen kannst, ist mir bewusst. ich weiss aber nicht wie weit die froenregeln gehen^^","replies":[{"poster":"Angel Ayume","date":"2019-11-20T08:36:39.713+0000","up_votes":2,"down_votes":0,"body":"Solange du niemanden mit deiner Namensnennung anprangerst, sprich er hat sich falsch benommen und du machst es mit seinem Namen öffentlich kannst du sie ruhig nennen.\n\nAußerdem nennst du ja nicht den Namen des Spielers sondern nur den gespielten Champion. Es gibt keine Forenregel die besagt, dass du einen Champion nicht nennen darfst.","replies":[]}]}]}]}]},{"poster":"Bananenschnder","date":"2019-11-17T08:01:02.825+0000","up_votes":3,"down_votes":0,"body":"Die Begründung kommt oft auf den Champion an. Normalerweise bauen midlaner Ludens, GLP oder Archangels als erstes und die jeweiligen Begründungen hängen vom Champion ab. Rabadons ist nie eine Wahl, weil es eigenständig weniger Gold effizient ist als die anderen Items und es außerdem genau 0 utility gibt.\n\nAußerdem willst du ja auf 40% CDR kommen und dafür brauchst du die anderen Items sowieso; der Build path ist außerdem deutlich besser, weil du ein Lost Chapter für den Mana sustain in der lane brauchst.","replies":[]},{"poster":"LegendaryXenon","date":"2019-11-17T07:58:34.713+0000","up_votes":3,"down_votes":0,"body":"Gerade bei mana champs ist ludens sehr praktisch und gibt durch lost chapter tradepotenzial. Rabadon selbst macht auch erst dann Sinn, wenn wirklich eine gewisse Menge AP vorhanden ist. Du bist eben einfach extrem ineffizient, wenn du sofort raba gehst.","replies":[]},{"poster":"Droxstar","date":"2019-11-17T20:46:53.707+0000","up_votes":2,"down_votes":0,"body":"Es kommt dabei auf einige Faktoren an. Rabadons first Item gibt dir natürlich einen guten Powerspike was deinen Schaden angeht und kostet nur wenig mehr als ein Ludens. Der größte Nachteil ist wohl, dass die Komponenten sehr viel Kosten. 1250g x2 statt z. B bei Ludens, wo du quasi immer etwas beim Back kaufen kannst.\n\nNächster Nachteil ist wohl, daß dir ein Haufen Mana fehlt, welches du auf sehr vielen Champions eben möchtest. Das erlaubt es dir öfter Spell zu nutzen um Waves zu clearen und auch extended Trades zu machen bzw zu Poken. Im Regelfall ist es nämlich so, dass Leute mit einem Ludens Echo vs Rabadons zwar einen All In Trade verlieren werden, doch kannst du im Vorhinein schon den Gegner ein paar mal mit Spells bearbeiten.\n\nLetztlich kommen noch saftige 20% CdR drauf welches dir erlaubt deine Spell in extended fights noch öfter zu nutzen als ohne. Das heißt in einem 15 Sekunden Trade gelingt es dir mit Ludens, Hextech GLP und auch Archangel Staff es dir, einige deiner Spells zwei mal zu verwenden. Daher kommt es zum einen Stark auf das AP Scaling deines Champs an, als auch deine cooldowns. Deine Q scaled mit 80% AP und hat einen 5 Sekunden CD? Rabadons gibt die natürlich viel mehr dmg Potenzial. Kostet sie aber dafür 120 Mana kannst du wohl ca 3-4x Casten bis du kein Mana mehr hast, da du ja auch noch die anderen Spells verwenden willst.\n\nAP'ler  ohne Mana wie Katarina, Vladimir und Morde Kaiser oder auch Kennen hingegen könnten dieses Item viel eher als First Item bauen. Aber auch da gibt es wieder andere Optionen. Sprich es ist von Champ zu Champ unterschiedlich. Es ist eine Möglichkeit und wenn dein Freund damit gut umgehen kann, würde ich nicht versuchen seinen Spielstil zu ändern. Wenn er also seine Lanes sowohl in Farm als auch Kills gewinnt und nicht alle 2-3 waves einen Backport macht und dann sowohl viel XP als auch Gold verliert oder sogar seinen Turret ist es mehr als in Ordnung.","replies":[{"poster":"Superbahamut","date":"2019-11-18T00:12:52.089+0000","up_votes":1,"down_votes":0,"body":"ich hab offengestanden mich noch nie geachtet wie oft er back musst, \ngewinnen würd ich nicht sagen, aber er verliert sie auch nicht hart^^","replies":[]}]},{"poster":"Phoenixale","date":"2019-11-20T01:44:04.951+0000","up_votes":1,"down_votes":0,"body":"Für die zusätzlichen 24+ AP lohnt sich die Mütze einfach nicht. Ich fange da lieber eher mit Rod of Ages, Rylais oder Ludens an. Bringt einfach mehr Vorteile im Early und Late. Rabba the Hut ist nichts fürs Early. Da lohnt sich {{item:3907}}  eher - ist aber auch eigentlich ein Luxus item fürs Late Game. {{sticker:sg-kiko}} ","replies":[{"poster":"Superbahamut","date":"2019-11-20T06:24:41.082+0000","up_votes":1,"down_votes":0,"body":"Wie kommst du auf 24 ap?","replies":[]}]},{"poster":"GruselGusel","date":"2019-11-17T23:23:56.041+0000","up_votes":1,"down_votes":0,"body":"mein premade ist vel koz otp und rusht jedes spiel rabadons\nwir haben es durch gerechnet und der mehr burs ist enorm\nda er gut mit seinem mana haushalten kann geht das auch und in solo que gehts seltener um dps/poke als um burst","replies":[{"poster":"CG Mörglife","date":"2019-11-19T08:46:03.272+0000","up_votes":1,"down_votes":0,"body":"Ich spiel auch Vel' Koz, Raba first ist echt nich gut.\nWenn überhaupt dann Dark Seal into Mejais, und auch nur wenn du hart stompst.\n\nVel'Koz ist manahungrig, egal ob du nur farmst, pokest oder all-In gehst. Lost Chapter brauchst du also auch.","replies":[]}]},{"poster":"HyperionCH","date":"2019-11-18T12:34:37.081+0000","up_votes":1,"down_votes":0,"body":"Wie bereits erwähnt ist es ineffizient.\nEs kostet viel und die Passive kommt erst nach mehreren items zur Entfaltung. Hinzu kommt, dass man damit oft Mana-Probleme kriegt.\n\nEtwas effektiver ist es höchstens, wenn man neben dem Item die Passive noch zusätzlich nutzen kann. Da fallen mir nur 2 Champs spontan ein:\n\n- Vladimir\nDie AP wird auch zur HP. Damit wird die Passive des Items 2x verwertet. Zudem hat Vlad keine Mana, weshalb er keine Mana-Probleme hat.\nTrotzdem sind bei ihm andere Items zu Beginn effektiver und die fehlende CDR ist nicht gut (gerade der Pool ist wichtig für Vlad und dessen CD ist hoch).\n\n- Veigar\nWenn man gut stacken konnte, hat Veigar bereits viel AP durch seine Passive, die dann auch von der Passive des Items profitiert.\nJedoch funktioniert dies nur, wenn Veigar wirklich in Ruhe farmen/stacken kann. Dies passiert eigentlich selten, da man selten bis nie die \"winning lane\" hat bzw. der Gegner selten auch nur in Ruhe farmt statt im early mit Veigar zu traden (bzw. Veigar ist auch ein klares Gank-Ziel, weshalb er nicht in Ruhe farmen/stacken kann).\nHinzu kommen Mana-Probleme. Zwar kann man Veigar mit TP spielen, damit er wieder rasch mit Full-Mana auf der Lane ist, jedoch ist man dann erst recht Gank-Opfer und muss dann allenfalls wieder zurück zur Base.\nFazit: funktioniert nur, wenn die Gegner schlecht spielen (d.h. Veigar nicht unter Druck gerät), was sogar in Low-Elo selten passiert.","replies":[]},{"poster":"Hundis Katze","date":"2019-11-17T12:33:02.528+0000","up_votes":1,"down_votes":0,"body":"Ich bin zwar nur ein Laie, aber Rabaddon ist doch ein Lategameitem oder?\n\nDenn die einzige Funktion ist, dass es die vorhandenen AP exponentiell erhöht. Da aber man in early wenig AP hat ist das Extra dementsprechend gering und lohnt sich nicht","replies":[{"poster":"Megamaexx","date":"2019-11-18T08:10:05.639+0000","up_votes":1,"down_votes":0,"body":"Wenn man nur auf AP schaut und Stats wie Mana, CDR oder HP ignoriert, ist Rabadons auch als erstes Item die beste Wahl. Es hat den höchsten Basiswert und skaliert mit sich selbst, was den Wert nochmal erhöht und man so auf so viel AP wie mit keinem anderen Item kommt.","replies":[]},{"poster":"Bananenschnder","date":"2019-11-17T12:46:18.242+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hundis Katze,realm=EUW,application-id=Wj1wcocU,discussion-id=WbsAriMu,comment-id=0006,timestamp=2019-11-17T12:33:02.528+0000)\n>\n> exponentiell\n\nAlso dann würde dich jeder Champion mit AP scaling nur durch Angucken oneshoten :D","replies":[{"poster":"Hundis Katze","date":"2019-11-17T13:46:25.615+0000","up_votes":1,"down_votes":0,"body":"Heißt Veigar Main XD","replies":[]},{"poster":"Veezey","date":"2019-11-17T13:36:21.416+0000","up_votes":1,"down_votes":0,"body":"Was da Enchanter wie Lulu wohl mit anrichten können? :D","replies":[]}]},{"poster":"Superbahamut","date":"2019-11-17T13:19:33.742+0000","up_votes":1,"down_votes":0,"body":"Im Grunde, ja.\nEs hat aber für sich selbst nen sehr hohen ap wert. \nIch selbst baue rabadon auch erst so als 3.item(Schuhe ausgeschlossen). Aber ich bin auch offen, für unübliche sachen \nDarum dachte ich, ich frag mal im Forum.\n:)","replies":[]}]},{"poster":"Vinmie007","date":"2019-11-17T23:14:19.769+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nich würde auch nicht mit Rabadons anfangen, einfach da man häufig extreme Manaprobleme bekommt und so nicht mehr wirklich nützlich ist und auch das Farmen schwer wird.\nWas ich empfehlen würde, wenn er trotzdem nicht mit Ludens oder ähnlichem anfangen will, soll er sich eine Träne machen, da er so um einiges mehr Mana zur Verfügung hat und es weniger kostet als zum Beispiel Ludens.\n\nIch glaube schon, dass vor allem als AP Assassin, wie Ahri oder Diana, die beide sehr stark mit Rabadons werden, es nützlich sein KANN mir dem Item anzufangen. Allerdings ist an Rabadons die Besonderheit, das ein Prozentualer Maximal AP Wert dazugerechnet wird. Dies erreicht allerdings erst nach zwei AP Items die komplette Stärke, die wir alle so an dem Item lieben.\nSomit wäre es vermutlich effektiver mit einem AP+Mana Item anzufangen, da einem ohne Mana die Fähigkeitenstärke auch nichts bringt. (Ohne Mana keine Fähigkeiten d.h man nutzt die Autoattaks und für die nutzen die meisten Champions AD.\n\nHoffe ich konnte ein wenig helfen und hoffe auch, dass ihr eine gute Lösung finden werdet.\nMfG Vinmie007","replies":[]},{"poster":"Ηastur","date":"2019-11-17T17:50:04.756+0000","up_votes":1,"down_votes":0,"body":"Das wurde auf Vlad ne Weile gemacht, weil er HP durch AP bekommt. Sonst ist es Quatsch.","replies":[]},{"poster":"Divin1ty","date":"2019-11-17T02:51:45.992+0000","up_votes":2,"down_votes":2,"body":"Wenn du es spielen kannst, why not.\nNicht jeder stackt IEs auf GP, ich liebe es da ich keinen Schild von PD, oder anderes brauche da ich ihn gut genug spielen kann.\n\nEs ist nicht der effizienteste Build, aber wenn man damit umgehen kann, kann man es spielen.","replies":[]},{"poster":"WC9 Umbra","date":"2019-11-17T11:16:54.831+0000","up_votes":1,"down_votes":3,"body":"is halt bad.","replies":[]}]}