{"poster":"Leicestter","date":"2019-10-22T20:17:36.868+0000","title":"Shen o RIven?","subforum":"Guias y consejos","up_votes":2,"down_votes":0,"body":"Estoy tratando de encontrar mi main,y top es la linea que mas me gusta, pero no me decido entre shen o riven,aunque con shen consegui gratis la skin Pulso de fuego, pero nose,ya que riven parece mas agresiva y shen parece un support{{champion:98}}  {{champion:92}}","replies":[{"poster":"Cuchufleitor","date":"2019-10-22T20:43:12.728+0000","up_votes":2,"down_votes":0,"body":"Dependiendo del match, Shen se juegas bastante agresivo en linea tambien.Ambos pueden mas o menos aguantarle la linea a cualquiera (o incluso ganarla), Riven tiene por su puesto mucho mas potencial de snowball mientras que Shen puede darle ventaja a otra linea con su ultimate, sacarla el mismo y despues volver a seguir farmeando con tp. Aunque no paresca Riven tiene algo mas de capacidad de iniciacion, mientras que Shen puede hacer muy buen peel. Riven puede hacer mucho daño en una TF pero un error le cuesta mas caro que un error a Shen, quien tambien mete bastante mas daño del que podrias pensar (especialmente despues de tener titanica). Riven es muy buena contra enemigos blanditos y escurridizos (si la sabes usar) mientras que Shen es algo mejor contra tanques. La curva de aprendizaje de Riven es mas alta y probablemente te cueste mas hacer que \"rinda\", Shen no es algo que vas a usar bien desde la primera vez, pero le vas a agarrar la mano mas rapido que a una RIven eso seguro. Riven (al menos de momento) no es un muy buen pick para juego de equipo, asi que te la recomiendo solo si la pensas usar para solo Q, Shen por el contrario, no es muy optimo para solo Q (Esta a medio camino entre un tanque y un fighter y su especialidad es el peel y no meter daño), pero es bastante bueno para jugar en equipo, si le tenes cariño obviamente podes lelgar a diamante solo con el, pero algunas partidas que con Riven las podrias carrear, con Shen no. Riven, sin embargo no es especialmente buena en el late game cuando todos tienen la build completa, salvo que hayas stompeado y solamente vos tengas la ventaja, en ese caso es muy buena aprovechandola gracias a su movilidad, daño y cc. Shen, puede ser util aun sin haber ganado la linea y sigue siendo relevante durante toda la partida.","replies":[{"poster":"Leicestter","date":"2019-10-22T20:57:30.451+0000","up_votes":2,"down_votes":0,"body":"Muchas Gracias!!{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Alba Meira","date":"2019-10-22T21:54:45.252+0000","up_votes":1,"down_votes":0,"body":"Si sabes utilizar y posicionar la Q de Shen hace mucho daño, mas ahora que esta bufeado.","replies":[]},{"poster":"SUBŁłME","date":"2019-10-22T20:22:36.815+0000","up_votes":1,"down_votes":0,"body":"depende de como jueges, o si quieres tanquear o asesinar suerte!","replies":[]}]}