{"poster":"Drostico","date":"2016-06-28T08:20:28.074+0000","title":"Jugar League of Legends desde Linux Ubuntu 16.04  ( 2016 )","subforum":"Guias y consejos","up_votes":8,"down_votes":0,"body":"Saludos a todos! Esta es una pequeña guia de como jugar Lol desde Linux mas precisamente desde ubuntu 16.04.\r\n\r\nLes comento que siempre intente jugar lol desde linux prove en varias ocaciones y distros y aunque varias veces logre jugar nunca pude lograr la fluidez y rendimiento que tenia en Windows, eso hasta hoy... Esta guia es corta por lo que les recomiendo leerla completa y despues realizar los pasos.. \r\nEsto es lo que deben hacer:\r\n\r\nConcretamente estoy corriendo Lol bajo Ubuntu 16.04 actualizado al dia de la fecha ( 28/06/2016) con escritorio gnome-shell\r\nDesconosco en otras distros pero en esta ya viene todo lo que se necesita para jugar ya que viene instalado el play on linux por defecto\r\n( en caso de no tenerlo entramos a la consola y escribimos lo siguiente:\r\n\r\nsudo add-apt-repository ppa:noobslab/apps\r\nsudo apt-get update\r\nsudo apt-get install playonlinux\r\n)\r\nSi ya lo tienen o luego de instalarlo solamente hay que abrirlo, elegir instalar un programa,luego van a la solapa  Juegos y escriben en el campo de busqueda \"League\" y ya les aparece, luego en la parte inferior derecha le dan click a instalar \r\nCon eso es suficiente, nada mas tienen que seguir los pasos (siguiente siguiente)\r\nA partir de ahi va a descargar un par de cosas necesarias y se habre el instalador ( es importante destildar la opcion iniciar al finalizar la instalacion) \r\n-Aclaracion Donde les pregunta la region elijan cualquiera ya que no figura LAS, no se preocupen despues lo solucionamos\r\n\r\nA partir de aca tienen dos opciones o le dan iniciar para que se habra el launcher y comience a descargar Suele tardar un ratito ( en este caso una vez que se habra el launcher van a tener que cambiar la region a la suya ) o la mas sensilla pueden copiar su carpeta de lol que tenian de windows hasta el directorio donde se instala en play on linux, esto es en ( /home/Su Usuario/PlayOnLinux's virtual drives )\r\ncon pegar la carpeta completa y reemplazar los archivos ya es suficiente. En el caso haber echo la ultima opcion ya esta listo solo vasta con darle click a Iniciar en Play On linux y se deberia iniciar el cliente y ya pueden jugar...\r\n\r\n\r\nAlgunas aclaraciones finales:\r\n- Solo me funciono esto a partir de ubuntu 16 y la version actual de lol no lo prove ultimamente en otras distros en versiones anteriores de ubuntu, arch open suse no logre hacerlo funcionar tan bien como ahora.\r\n- La maquina en la que hice las pruebas es una pc estandar un Pentium Dual core 3.0 ghz  4 gb ram y una ati radeon 5450 y me funciona a 100 fps mas o menos sin bajones con graficos Medios por lo que no parece necesitarse mucha maquina para correrlo bien desde linux\r\n- Pronto voy a probar el cliente alfa a ver si funciona y cualquier novedad actualizo el post \r\nCualquier duda dejenmela en los comentarios \r\n- Los drivers de ati que estoy usando son los que me tomo por defecto ubuntu no baje ni actualice nada practicamente despues de terminar de instalar ya funciono todo sin problemas aun asi es recomendable revisar bien el tema drivers antes de probar nada..\r\n\r\nbueno espero les funcione y aunque no soy un usuario avanzado de linux si los puedo ayudar en algo me lo hacen saber en los comentarios Saludos!","replies":[{"poster":"Kaeldiego","date":"2016-08-26T22:50:57.645+0000","up_votes":3,"down_votes":0,"body":"Muchisimas gracias, con solo copiar y pegar me ahorré el tener que descargarlo todo.\nDe verdad que muchas gracias!!!","replies":[]},{"poster":"JG üyrek","date":"2016-08-26T03:55:52.978+0000","up_votes":2,"down_votes":0,"body":"a mi no me anda.. me sale el problema del \"bug splats\", o algo asi. No sabes como solucionarlo :c","replies":[]},{"poster":"Thimeus","date":"2016-11-20T03:06:33.505+0000","up_votes":2,"down_votes":1,"body":"Buenas, estimado.\nSeguí los pasos, y me trabo en lo último.\n\nPegué el juego completo en la carpeta de PlayOnLinux Driver. \nAhora entro /home/Thimeus/PlayOnLinux's virtual drives/League of Legends. Y ejecuto \"lol.launcher.exe\"\naparece el logo de league of legends, todo normal hasta ahí.. Y aparecen como 3 ó 4 carteles de bugsplash, y de ahí no paso.\n\nNo encuentro manera de ejecutarlo de otra manera. Será que se ejecuta por el Wine?\n\n1. pd: gracias por la info. {{champion:115}}","replies":[{"poster":"drerk","date":"2017-06-19T01:42:47.987+0000","up_votes":0,"down_votes":1,"body":"me pasa igual","replies":[]}]},{"poster":"santi navas","date":"2019-04-26T22:42:07.414+0000","up_votes":1,"down_votes":0,"body":"como se descarga????????","replies":[]},{"poster":"BC Shuh","date":"2017-12-10T20:43:54.896+0000","up_votes":1,"down_votes":0,"body":"Tengo windows XP y no me sirve para lol , que otros sistemas operativos puedo utilizar para jugar lol {{sticker:sg-kiko}}","replies":[]},{"poster":"Trabajo","date":"2017-08-31T07:54:56.945+0000","up_votes":1,"down_votes":0,"body":"Estimado esto sigue funcionando ? me interesa bastante este proyecto, deberías intentar hablar directamente con riot usa, te puedo ayudar con eso, saludos","replies":[]},{"poster":"prestaatuhermana","date":"2017-06-21T06:53:29.445+0000","up_votes":1,"down_votes":0,"body":"Hola te hago una consulta. Logre instalar el leage en ubuntu 16.04 pero me va a muy bajos fps (no más de 30) hay alguna configuración que pueda aplicar para mejorar esto? Mi hardware es un amd fx6300 con una placa r5 230 y 16g de Ram","replies":[]},{"poster":"jesus urias","date":"2017-03-27T04:42:24.096+0000","up_votes":1,"down_votes":0,"body":"ty","replies":[]},{"poster":"Àkira","date":"2017-03-26T23:46:25.150+0000","up_votes":1,"down_votes":0,"body":"hola! segui tu guia y pude jugar, pero solo con el cliente de legado!, has probado jugar con el nuevo cliente? tuviste exito? gracias!","replies":[]},{"poster":"Dinepada","date":"2016-12-02T15:45:35.624+0000","up_votes":1,"down_votes":0,"body":"el cliente beta (o si ya lo tienes instalado en windows asi) no funciona al copiarlo, sale bugsplat, y no puedo hacer nada, salvo quizas descargar desde cero sin activar el cliente beta","replies":[]},{"poster":"PaNaCe4","date":"2016-06-28T12:19:05.074+0000","up_votes":1,"down_votes":1,"body":"Se nota lo dependiente que son de Windows u otros OS privados. \nSe nota la ignorancia en el uso de tecnologías en LAS. \n\nGracias por el post estimado.","replies":[{"poster":"Drostico","date":"2016-06-29T05:38:26.308+0000","up_votes":1,"down_votes":0,"body":"La verdad es que habiendo un cliente oficial para mac Riot  ya deberia tener por lo menos la idea de armar un cliente oficial para linux, seria buenisimo poder jugar desde otras distros sin tantas complicaciones, somos muchos usuarios de este OS que jugamos sin mencionar que muchos desarrolladores estan desarrollando tambien para linux steam por ej... \n\nGracias a vos por pasar  Saludos!","replies":[]}]},{"poster":"Nombre ofensivo","date":"2016-06-28T14:46:53.270+0000","up_votes":1,"down_votes":0,"body":"Lo probe en linux mint y me funciono, pero ahora no lo tengo instalado por que tengo el inicio bloqueado por windows 10 y no se por que no me deja instalar ningun linux(ya probe lo del fast boot)","replies":[{"poster":"Drostico","date":"2016-06-29T05:37:35.111+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=La mano D Scioli,realm=LAS,application-id=8sKIclmi,discussion-id=FA1Z3Elz,comment-id=0001,timestamp=2016-06-28T14:46:53.270+0000)\n>\n> Lo probe en linux mint y me funciono, pero ahora no lo tengo instalado por que tengo el inicio bloqueado por windows 10 y no se por que no me deja instalar ningun linux(ya probe lo del fast boot)\n\nQuizas tengas que desactivar el SecureBoot desde la bios fuera de eso ovbiamente vas s tener que recuperar el grub con algun live cd de alguna distro.. fdisk -l... etc\n\nPor si todabia te interesa linux y queres volver a intentar jugar al LOL desde ahi te dejo dos enlaces que seguro te sirven un Saludos!\n\nhttps://simplementelibre.wordpress.com/2014/10/23/recuperar-grub-con-un-livecd-de-ubuntu-14-04-tras-la-instalacion-de-windows/\n\nhttps://www.fayerwayer.com/2016/02/guia-definitiva-para-instalar-un-sistema-operativo-linux-junto-a-windows-10/","replies":[]}]},{"poster":"Sonya Kyron","date":"2016-06-28T16:43:19.221+0000","up_votes":1,"down_votes":3,"body":"Creo que la misma PC en windows te tira 200 FPS, pero si queres usar el linux y lo conseguiste hacer andar, es como para aplaudir, podriamos nombrarte **vasco** honorifico. Creo que de los 150 usuarios de linux que lei, sos el unico que lo hizo funcionar \"a mas de 60 FPS.\nCon maquinas mucho mejores le han sacado 20 FPS, Asi que todo un merito lo tuyo.","replies":[{"poster":"Drostico","date":"2016-06-29T05:39:57.339+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sonya Kyron,realm=LAS,application-id=8sKIclmi,discussion-id=FA1Z3Elz,comment-id=0002,timestamp=2016-06-28T16:43:19.221+0000)\n>\n> Creo que la misma PC en windows te tira 200 FPS, pero si queres usar el linux y lo conseguiste hacer andar, es como para aplaudir, podriamos nombrarte **vasco** honorifico. Creo que de los 150 usuarios de linux que lei, sos el unico que lo hizo funcionar &quot;a mas de 60 FPS.\n> Con maquinas mucho mejores le han sacado 20 FPS, Asi que todo un merito lo tuyo.\n\nVasco honorifico jajaja \nEn Realidad en windows no me va a mas de 145 por lo que con 100 estoy sobrado  y va perfecto sin ningun corte o bajon.. Gracias por pasar Saludos!","replies":[]}]}]}