{"poster":"AndOneYannic","date":"2016-02-14T19:51:02.021+0000","title":"Low priority durch Free game","subforum":"Hilfe & Support","up_votes":1,"down_votes":2,"body":"Liebes Riot Team \r\nMein LoL hatte heute einen fehler aufgewiesen (  durch diesen fehler konnte ich nicht dem spiel beitreten und mein team musste ohne mich spielen )  und mir geraten die reperaturfunktion zu nutzen.\r\nIch habe die reperaturfunktion angeschalten und 3 h laufen gelassen dann startete ich das Spiel erneut und versuchte ersteinmal ein freies spiel mit 5 bots zu starten und dies schlug fehl.\r\nMein problem ist nun ,dass der &quot;afk&quot; durch den bug mein erster seit dem lezten low priority queue war und ich, nachdem der fehler  repariert wurde wieder nicht joinen konnte und ich nach dem neustarten und einloggen die nachricht bekahm, dass ich wieder 5 spiele mit niedrigerer priorit&auml;t spielen muss.\r\nDiese 5 spiele &quot;abzuleisten&quot; w&auml;re nicht das Problem aber buggs mit dem leaverbuster habe nicht nur ich (auch einer meiner freunde der noch NICHT einmal ein spiel verlassen hat )\r\nDanke f&uuml;r eure Hilfe und entschuldigung wegen der Rechtschreibung","replies":[{"poster":"legofreak1","date":"2016-02-14T20:12:37.135+0000","up_votes":1,"down_votes":0,"body":"Ich seh nicht so ganz das Problem. Du warst im letzten Spiel afk und hast dafür eine Leaverbusterstrafe bekommen.","replies":[{"poster":"chilledkroete","date":"2016-02-15T04:57:16.505+0000","up_votes":1,"down_votes":0,"body":"Muss man dafür nicht über einen Zeitraum mehrere Spiele leaven? Ich habe momentan Internetprobleme und muss zu meiner Schande zugeben dass ich trotzdem weiter spiele. Ich denke in den letzten 2 Wochen waren das ca 6 oder 7 Games und ich habe nichtmal eine Meldung bekommen.","replies":[{"poster":"legofreak1","date":"2016-02-15T12:08:16.694+0000","up_votes":1,"down_votes":0,"body":"Ja, muss man. Der Leaverbuster besitzt eine gewisse Toleranz, damit man technische Probleme beheben kann oder aber für Notfälle, die eben wichtiger sind als das Spiel. So etwas kann vorkommen, ist auch keine Schande dann ein Spiel zu verlassen, man sollte dann aber so schnell wie möglich versuchen seine Probleme in den Griff zu bekommen.","replies":[]}]}]}]}