{"poster":"Corniflex","date":"2014-07-13T08:50:07.631+0000","title":"Segítséget kérnék!","up_votes":1,"down_votes":0,"body":"Sziasztok! Új vagyok még a játékban, 5 napja játszom, szóval gondolom nem olyan eget rengető a problémám, de sajnos én nem jövök rá a megoldásra.\r\n\r\nEgy játék befejezése után rákattintottam a \"statisztika kihagyása\" szövegre és azóta azt írja, hogy otthagytam egy folyamatban lévő játékot, csatlakozzak vissza, de ezt nem tudja ugye megtenni.. kb 5 perc várakozás után azt írja, hogy valószínűleg a tűzfalam blokkolja a hozzáférést próbáljam újra.. akkor sem történik semmi.\r\n\r\nArra lennék kíváncsi, hogy az új accounton kívül milyen más opciók állnak előttem.\r\nSegítségeteket előre is köszönöm.","replies":[{"poster":"DaNcSx","date":"2014-07-14T20:53:48.922+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ugyan ez a bajom... Nekem most történt meg, már 1 órája várom, hogy valami történjen de semmi.Már próbáltam mindent nem oldja meg >< Remélem fix-elik ezt az óriási Buggot !!!!","replies":[]},{"poster":"Thorum 1","date":"2014-07-14T12:02:24.095+0000","title":null,"up_votes":1,"down_votes":0,"body":"nekem is ez a baja ..... :/ másfél órája elvileg megy a meccs :(","replies":[]},{"poster":"mmateexd","date":"2014-07-13T12:04:13.152+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nekem is ez a próblémám :( Megvolt az első ranked winem és nem tudok mit csinálni. Jó lenne minél hamarabb megcsinálni mert elég idegesítő.Mi lesz ha nem oldódik meg??? Akkor mit kell csinálni???","replies":[]},{"poster":"RC And THC","date":"2014-07-13T11:39:02.849+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nekem ugyan ez a problémám is nagyon idegesítő,h nem lehet vele mit csinálni, az újra telepítés nem fogja meg oldani a problémát mivel valószínűleg a riot szerver rosszalkodik, hát csak várok, talán észreveszi,hogy már órák óta bent sem vagyok,remélem megoldódik magától a probléma.\n\nDe azért ha valaki tudna rá valamilyen megoldást(a várakozáson kívül) az ossza meg velünk kérem,köszi.","replies":[]},{"poster":"Alkexx","date":"2014-07-13T11:34:00.125+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nekem is ez a problémám!\nmár vagy 45 perce nem tudok semmit sem csinálni, folyamatosan az előbb említett problémákat írja ki :S","replies":[]},{"poster":"TomSeleck","date":"2014-07-13T11:25:16.939+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nekem tegnap is (07.12.) meg ma is (07.13.) ezt csinálta. Mindkétszer ranked win után, nehogy kapjak már érte LP-ét. Ja persze amit közte játszottam 2 lose azt gondolkodás nélkül megadta","replies":[]},{"poster":"fabydamed","date":"2014-07-13T11:19:11.569+0000","title":null,"up_votes":1,"down_votes":0,"body":"nekem is ugyan ez a problémám szóval lehetséges hogy bugos lett","replies":[]},{"poster":"Karmella","date":"2014-07-13T11:16:45.707+0000","title":null,"up_votes":1,"down_votes":0,"body":"ma ép ez a probléma lett nekünk is 5ös csapattal bementünk és játék után ugyanez a probléma ,15perce lassan ........szóvl sztem nem az accountod a gond hanem a game .....","replies":[]},{"poster":"M4dr4c","date":"2014-07-13T10:54:04.737+0000","title":null,"up_votes":1,"down_votes":0,"body":"Lehet hogy csak bent ragadtál egy \"Ghost game\"ben. A játék azt hiszi, hogy még mindig tart a meccs pedig már vége, nincs mihez csatlakozni. Viszonylag ritka dolog és pár óra alatt magától is megoldódik.","replies":[]},{"poster":"Deapimp","date":"2014-07-13T10:13:15.309+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem csak telepítsd újra a játékot, az megoldja a problémát.","replies":[]}]}