{"poster":"Xuízunä","date":"2016-09-22T06:19:47.717+0000","title":"Bug with riven Q sound","subforum":"Miscellaneous","up_votes":3,"down_votes":0,"body":"When I attack minions with my Q I can&#039;t hear the hit, or even the 3rd Q knockup. There is no sound. Is it a bug? If not how do I fix the sound? Thanks","replies":[{"poster":"Bookbash","date":"2016-09-23T20:41:19.718+0000","up_votes":1,"down_votes":0,"body":"I think Sona's sounds are also bugged, sometimes in team fights when you E and then Q in rapid succession the sound just goes silent for a second.","replies":[]},{"poster":"Brucey","date":"2016-09-22T08:28:57.387+0000","up_votes":1,"down_votes":0,"body":"OMG thank you some else noticed i was playing her (as normal lmao) and i was like i swear her q had a sound when it hit minions and just i was mental blank if she did or not and seeing this i can confirm this as well haha","replies":[{"poster":"Wast3land ","date":"2016-09-22T10:32:19.661+0000","up_votes":1,"down_votes":0,"body":"I thought i was the only on, I hoped on 2 computers and use Battle Bunny Riven Skin for both and There still isn't any sound when i hit minions. It's like i'm hitting the air. I hope they fix it soon, kinda bugs me a bit","replies":[{"poster":"Xuízunä","date":"2016-09-22T10:55:39.787+0000","up_votes":1,"down_votes":0,"body":"Omg you could be right! It could be a bug with the skin! I have sent a support ticket to Riot, they should get back to me tomorrow :)","replies":[{"poster":"Wast3land ","date":"2016-09-22T11:09:36.744+0000","up_votes":1,"down_votes":0,"body":"YEET! Tell use when they do so we know what is happeneing","replies":[{"poster":"Xuízunä","date":"2016-09-23T02:19:50.113+0000","up_votes":1,"down_votes":0,"body":"Hey man! They think it is a config file error, but I replied to them and said it is only happening with the Battle Bunny Riven skin. So now I have to wait another day for their response :P","replies":[{"poster":"Wast3land ","date":"2016-09-23T06:19:47.712+0000","up_votes":1,"down_votes":0,"body":"Oh....whats a config file lol","replies":[]}]},{"poster":"Xuízunä","date":"2016-09-22T13:21:53.146+0000","up_votes":1,"down_votes":0,"body":"No worries man! I'll keep you updated :)","replies":[]}]}]}]},{"poster":"Xuízunä","date":"2016-09-22T09:34:17.845+0000","up_votes":1,"down_votes":0,"body":"It's so weird though! I told my brother to log onto his account and he can hear the sounds! But I can't I sent a ticket in because I don't know what to do","replies":[]}]},{"poster":"TheOneUser","date":"2016-09-22T07:45:11.938+0000","up_votes":1,"down_votes":0,"body":"you could download a custom skin, use the launcher repair thing. or maybe the sound fx bar is muted","replies":[{"poster":"Xuízunä","date":"2016-09-22T09:34:43.587+0000","up_votes":1,"down_votes":0,"body":"Yeah I repaired it and nothing happened, where is that option? All my sound on league is on 100","replies":[]}]}]}