{"poster":"WeRampes","date":"2015-06-18T20:22:47.470+0000","title":"Nuovo champ","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"secondo voi sar&agrave; un jungler? dalla stazza non credo si tratti di un adc anche se mi dispiace, probabilmente un top/jungler, che ne pensate?","replies":[{"poster":"ViaMalinconiaN9","date":"2015-06-18T20:27:33.451+0000","up_votes":1,"down_votes":0,"body":"Io già mi sto immaginando le sue skill *******-*******\nPer esempio il canto che attira i nemici tipo Rammus, la lingua che afferra i nemici li mette in bocca e poi li sputa xD\nSe ha il set come penso io sarà un ottimo jung se no è top!","replies":[{"poster":"WeRampes","date":"2015-06-18T20:30:14.968+0000","up_votes":1,"down_votes":0,"body":"molti top vanno bene jung e viceversa, col suo set, cioè col tuo set xD anche top andrebbe bene, bisogna vedere che tipo di skill da gank gli metteranno, tipo la lingua \" a mo di fascia\" di amumu? che però lo attira tipo grab xD","replies":[{"poster":"mezzo minion","date":"2015-06-19T07:30:15.049+0000","up_votes":1,"down_votes":0,"body":"secondo me la lingua sarà uno strumento a doppio utilizzo,  tipo che  so :quando un alleato viene \"mangiato\" rimarrà nello stomaco e tutti i danni che vengono subiti da l'alleato li subisce il mostro mentre se viene divorato un nemico tutti i danni che subisce il mostro vengono subiti anche dal nemico catturato\"","replies":[{"poster":"WeRampes","date":"2015-06-19T09:22:14.526+0000","up_votes":1,"down_votes":0,"body":"una specie di ulti di kalista, interessante xD","replies":[]}]}]}]},{"poster":"BluFoxer","date":"2015-06-19T05:15:16.717+0000","up_votes":1,"down_votes":0,"body":"Secondo me il canto c'entra qualcosa, forse è tipo un taunt o uno charm ad area, insomma qualcosa che attiri i nemici. Spero solo non sia un botlaner.\n{{champion:9}}","replies":[{"poster":"WeRampes","date":"2015-06-19T07:03:41.487+0000","up_votes":1,"down_votes":0,"body":"non credo, avrei voluto tanto un adc essendo un main e avendoli già presi tutti, ma sono sicuro che sia un top/jungler","replies":[]}]},{"poster":"WeRampes","date":"2015-06-19T10:15:02.340+0000","up_votes":1,"down_votes":1,"body":"noting that The River King's Q will have have a slow of some sort, that he doesn't have any knock-ups, true damage, or executes, and that he has 3 passives on his kit. ecco la Q già rivelata, uno slow, il resto avrà anche delle passive xD","replies":[]}]}