{"poster":"Krèépy","date":"2017-09-02T15:56:55.588+0000","title":"Riot Pls? Refund the Rift.","subforum":"Gameplay","embed":{"description":"This is a call to arms for all veteran League of Legends players who are getting completely shit on due to the upcoming League update. Like & share plz, don't give up without a fight! No disrespect or hate towards any League player or employee, just expressing my own opinions on the subject.","url":"https://www.youtube.com/watch?v=lVHVjFfAIW8&feature=youtu.be","image":"https://i.ytimg.com/vi/lVHVjFfAIW8/hqdefault.jpg"},"up_votes":66,"down_votes":31,"body":"Viewer Discretion Is Advised. I&#039;m sorry. Please Keep this post alive &amp; leave a comment/up vote.\n\nEdit: RIOT  RESPONDS VIDEO & TOPIC: https://boards.na.leagueoflegends.com/en/c/gameplay-balance/bvYZZa5r-riot-responds-riot-pls-update\n\nListen here.. I&#039;ve been playing this game for eight years. I probably have played more than 10,000 games of league across multiple accounts(smurfing). As I listened to this video I heard nothing that is meant to actually show players that have been at it the MOST that you actually give a rat&#039;s &quot;nostril&quot; about us and all the time we have spent playing this game. I don&#039;t even know where to begin to be honest. Anyone who thinks that some sort of refund or some sort of change of ip to blue essence is enough to make us &quot;veterans&quot; feel better about this change is simply incorrect.\n\nIt&#039;s not even the fact that you&#039;re changing things, you simply aren&#039;t doing enough for those of us who have spent LITERALLY months in game- at the keyboard- pressing q w e r r r r rr rr r to win game after game. The fact that you are trying to make this an &quot;even playing field&quot; or w/e it is you&#039;re doing by making runes free is a smack in the face.\n\nI&#039;m pissed. Let me tell you.. I have more than 6000 games played on one account- on which ive spent irl money on boosts. I own 99% of the champs, I have THE skin I want for 90% of the champs I play.. I have several rune pages, but I don&#039;t own every rune-so the thought that ALL of us veterans have truckloads of useless IP is ridiculous. I don&#039;t know what to say. I don&#039;t even know where to begin.. This is unacceptable.\n\nTo most vets- This is like your boss of 30 years telling you that you are ineligible for retirement. You&#039;re telling me you&#039;re raising the level cap but.. I&#039;m not being boosted to the new cap? or even 90% of the way there? DO YOU NOT UNDERSTAND HOW MUCH WORK HOW MANY HOURS HOW MANY MINIONS I HAVE KILLED IN THIS GAME? THIS IS ROBBERY. THIS IS SUCK.\n\nYou don&#039;t get it. I cant even talk I&#039;m so pissed. GREAT- you made it so champions &amp; players can be more diverse freaking awesome... made it so people don&#039;t have to spend as much money on champs and skins you gave us chests for playing the game-good freakiing job. Awesome stuff. I&#039;m sure a lot of us vets got some good skins from that ( we already had the champs thanks tho). Now you&#039;re making it even easier for new players to get involved in the game and play at the level they want to... Congrats to all you mofos in the future that never have to struggle the way RIOT&#039;s most loyal, most loving, most supportive group of players have had to. But what about us riot?\n\n&quot;You&#039;ve spent 10,000 games on the rift. HERE HAVE A MOTHGER BFIICCNJL SUMMONER ICON&quot; You haven&#039;t even done it yet and I already know what time it is. You better not. You are spitting on us.\n\nLet me watch this video again real quick.........oh my god are you serious?\n&quot;FOR RUNES PURCHASED BEFORE 2017 we will give you 100 blue essence each.&quot; I need a button that tells me how much rp and IP I spent so I can gauge how much cursing I need to do when I tell my friends about this bs. Good job reducing the costs of everything so most players don&#039;t know how much they actually cost us vets. The cheapest runes USED to cost like 250 ip. BUT ANY RUNES BOUGHT SINCE THE 2017 SEASON GET A FULL REFUND? BOYYYYYYYYYYYY IM BOUT TO WOOP YO ASHE. So basically the new players who may quit after you take their tier 2 runes away get a refund but those who have been playing since ezreal&#039;s release get a taste of kogmaw&#039;s spittle? Bet.\n\nFor any rune page I spent 6300 IP on, you&#039;re gonna give me 1500 blue essence but blue essence is actually supposed to be equal to the old IP? GVGBHKFGVFVLSC &lt;&lt;That&#039;s a curse word riot.. fyi. For every 4 rune pages bought with RP I can get a great skin. TOO BAD IM A VET AND I BOUGHT MOST OF MY RUNE PAGES WITH IP AFTER I OWNED 90% OF THE CHAMPS AND RUNES I WANTED!!!! Talkin bout round up. Catch this Lee sin round house kick. OH YAY for a limited time we get to buy ward skins, icons and freaking chromas with the bs refund you gave us. Yall aint slick bih. YOU AINT SLICK. None of this is for us. None of this is for those who have slaved behind the buttons q w e r for the past decade. I have never seen such a blatant disregard for a loyal fan base.\n\nYou raising this level cap only means that I won&#039;t be in queue with some new level 30 that has only 100 wins WHEN I hit level 45 or w/e. This does nothing for us and to be honest if most long term vets aren&#039;t auto jumped to or near the new level cap I&#039;ll be disgusted along with everyone else.\n\nYou know why I have enough time to type all this? Cause I&#039;ve spent 200 days in game. My first game ever- Soraka &amp; Warwick toplane. I could heal that wolf and give him mana to keep him going. This is back when Jax could dodge spells, Xin&#039;s knockup was the most OP thing in this game. Do you get it yet? If not- guess what- you aren&#039;t supposed to. If you think you should understand how those who have been here since preseason 1 feel about this update you are sadly mistaken. If you think we are over reacting- understand we have been playing this game for the same amount of time it took you to get from 5th grade to your 12th grade graduation. DO NOT THINK THAT ME COMPLAINING IS NEARLY ENOUGH TO DESCRIBE HOW MISTREATED 99% OF VETS FEEL. &amp; remember kids. You would not know how to dodge a single skillshot if not for the vets. You wouldn&#039;t know about wards, you wouldn&#039;t know about teamfights, you probably wouldn&#039;t even know about this game because most vets have 10-20-30-40 people that started playing league because of them. \n\nF yo icon. I know its coming. It will be known as the &quot;We got f&#039;ed icon&quot; F&#039;ed... You know what F&#039;ed means? F&#039;ed is when you play a game since it&#039;s release and spend in game currency to buy something that will be given to everyone 8 years later. F&#039;ed is when what you earned is taken away and you get a 10% refund so that you can buy ward skins and chromas that nobody cares about as soon as &quot;Minions have spawned&quot; pops up on your screen. Pull up Big Sean - I don&#039;t F with you and play the video describing this BS again. Maybe then you&#039;ll get it.\n\nAll my veterans need to complain right here. Tell Riot how you feel!\n\n\n","replies":[{"poster":"wizardhunter","date":"2017-09-02T23:56:17.619+0000","up_votes":6,"down_votes":0,"body":"dang riot responded #REspect","replies":[]},{"poster":"ChargeItDownMid","date":"2017-09-03T03:01:35.484+0000","up_votes":9,"down_votes":3,"body":"***","replies":[{"poster":"Grokmir","date":"2017-09-03T07:00:45.230+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=magewick,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=0012,timestamp=2017-09-03T03:01:35.484+0000)\n>\n> No, we veterans should not be complaining. We are benefiting the MOST from a lower refund on runes. \n> \n> You have to realize how riot set blue essence prices. They first decided how much free stuff they wanted to give away. Then, they looked at how much ip and runes players have floating and set prices and refunds to reach this level. Increasing the rune refund would just increase the blue essence prices.\n> \n> A low rune refund means a low BE market price which means more value for the extra ip players have floating around. The players who benifit the most from this are veterans who have 100k+ ip floating around.\n> \n> A higher rune refund, conversely, means a higher BE market price which in turn means a lower value for the extra ip we have floating around.\n> \n> Riot already knows how much total rewards they want to give away and adjusting variables such as rune to ip refund and blue market essence prices just changes how these rewards are distributed. The more we campaign for a higher rune refund, the more we hurt long time veterans.\n\nIf by long time veterans you mean people with 100's thousands of ip stockpiled, then they shouldn't care for themselves if they get \"hurt\" by more fair refunds. They have more than enough ip as it is to get what they want. The point is that it isn't fair for the long time players that DON'T have 100's thousands of ip. They get the short stick because they don't have the ip to buy stuff, but they also don't get the refund because they have been playing since before 2017.\n\nAnd just to be clear I have all the ip I could want for the upcoming sales. I'm complaining so that everyone might have a chance to be treated fairly by riot.","replies":[{"poster":"Quepha","date":"2017-09-03T18:21:49.389+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Grokmir the bold,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=00120000,timestamp=2017-09-03T07:00:45.230+0000)\n>\n> it isn&#x27;t fair for the long time players that DON&#x27;T have 100&#x27;s thousands of ip. They get the short stick because they don&#x27;t have the ip to buy stuff, but they also don&#x27;t get the refund because they have been playing since before 2017.\n\nI don't understand. How can they have been longtime devoted fans since the beginning without actually having either a lot of stocked IP or a lot of runes bought that will be refunded into a lot of BE? Do you realize that if they actually played a lot of games they would have a lot of IP?","replies":[{"poster":"Grokmir","date":"2017-09-03T18:28:10.784+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Quepha,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=001200000001,timestamp=2017-09-03T18:21:49.389+0000)\n>\n> I don&#x27;t understand. How can they have been longtime devoted fans since the beginning without actually having either a lot of stocked IP or a lot of runes bought that will be refunded into a lot of BE? Do you realize that if they actually played a lot of games they would have a lot of IP?\n\nBecause people have lives. There's a difference between playing 10 hours a day and playing 1-2 games a day/every few days. That doesn't make them any less devoted, they just can't afford to spend that much time playing the game.\n\nAnd yeah they have all the runes, but they get a fraction of the refund as new players do, which is the point about it not being fair to \"old\" players with lives.","replies":[{"poster":"Quepha","date":"2017-09-03T19:37:10.087+0000","up_votes":1,"down_votes":1,"body":"If you have all the runes then the refund you get will be big, big enough to get things from the blue essence limited shop that newer players would have no chance of affording. That will show off that you had a medium devotion to the game for a long period of time.\n\nMaybe not as much as people who did no-life the game for years, but why do you expect to get the same compensation as those who had a high devotion to the game over the same period of time? Shouldn't someone like Dyrus actually get something on his account to show that he played the game more than you did?","replies":[{"poster":"Grokmir","date":"2017-09-03T22:04:57.171+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Quepha,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=00120000000100000001,timestamp=2017-09-03T19:37:10.087+0000)\n>\n> If you have all the runes then the refund you get will be big, big enough to get things from the blue essence limited shop that newer players would have no chance of affording. That will show off that you had a medium devotion to the game for a long period of time.\n> \n> Maybe not as much as people who did no-life the game for years, but why do you expect to get the same compensation as those who had a high devotion to the game over the same period of time? Shouldn&#x27;t someone like Dyrus actually get something on his account to show that he played the game more than you did?\n\nI feel you aren't understanding my point. I'm not talking about the limited shop or rewards. I'm talking about everyone getting the same refund on runes. That's it.\n\nBtw I'm one of those no lifers. I'll have more than enough blue essence to get everything i want from the shop. But this isn't about the shop. It's about fairness.","replies":[{"poster":"Quepha","date":"2017-09-03T23:46:40.243+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Grokmir the bold,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=001200000001000000010000,timestamp=2017-09-03T22:04:57.171+0000)\n>\n> I feel you aren&#x27;t understanding my point. I&#x27;m not talking about the limited shop or rewards. I&#x27;m talking about everyone getting the same refund on runes. That&#x27;s it.\n> \n> Btw I&#x27;m one of those no lifers. I&#x27;ll have more than enough blue essence to get everything i want from the shop. But this isn&#x27;t about the shop. It&#x27;s about fairness.\n\nThen why do your posts sound like this is supposed to be compensation for all the years you've put into the game instead of the fact that you spent some points to get stat advantages in game, and you had and enjoyed those stat advantages for years, but now that cost will no longer be necessary because they are just giving everyone a full set of runes?","replies":[{"poster":"Grokmir","date":"2017-09-04T02:00:40.888+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Quepha,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=0012000000010000000100000000,timestamp=2017-09-03T23:46:40.243+0000)\n>\n> Then why do your posts sound like this is supposed to be compensation for all the years you&#x27;ve put into the game instead of the fact that you spent some points to get stat advantages in game, and you had and enjoyed those stat advantages for years, but now that cost will no longer be necessary because they are just giving everyone a full set of runes?\n\nWell its up to you to interpret my posts I guess. In all of my posts I've only ever said that everyone should get the same refund.\n\nAnd there's something a lot of you people don't understand. Buying runes didn't give you an advantage. It only brought you up to normal standard of other players so that you could actually compete with them. Its a pretty big difference.","replies":[{"poster":"Quepha","date":"2017-09-04T02:23:46.374+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Grokmir the bold,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=00120000000100000001000000000000,timestamp=2017-09-04T02:00:40.888+0000)\n>\n> Its a pretty big difference.\n\nSemantics are considered a small difference.","replies":[{"poster":"Grokmir","date":"2017-09-04T02:49:00.360+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Quepha,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=001200000001000000010000000000000000,timestamp=2017-09-04T02:23:46.374+0000)\n>\n> Semantics are considered a small difference.\n\nSure.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Report for Wuju","date":"2017-09-02T17:16:28.980+0000","up_votes":5,"down_votes":0,"body":"[Stop reposting your shit.](https://boards.na.leagueoflegends.com/en/c/general-discussion/Em2eVQIp-call-to-arms-ipblue-essence-riot-pls)","replies":[]},{"poster":"Hexs Fortune","date":"2017-09-02T16:41:43.250+0000","up_votes":2,"down_votes":0,"body":" How much compensation would be appropriate in your opinion?","replies":[{"poster":"JustARivenMain","date":"2017-09-03T01:54:04.706+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Hexs Fortune,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=0000,timestamp=2017-09-02T16:41:43.250+0000)\n>\n> How much compensation would be appropriate in your opinion?\n\nIm mad about the lack of thought in their division atm, they promise to cover the veteran players, back in the first video about new runes, then said we get a 40% refund before this year, and 100% during this year. Ok, but then they go and make it a static 100ip per mark/seal/glyph and a measily 300 per Quint.... Flat AD runes when I first purchased them, were 820 a piece. and Quints were like 2050.. That's what I'm salty about. I have to get 1k IP PER DAY until preseason just to get a chance to get Urfwick (Missed it the first time around, got hacked in s3, made this account pre-S4)","replies":[{"poster":"Sun Wu Ryuumoku","date":"2017-09-03T12:32:09.863+0000","up_votes":3,"down_votes":0,"body":"> they promise to cover the veteran players, back in the first video about new runes, then said we get a 40% refund \n\nThey never promised this.","replies":[]}]}]},{"poster":"SanKakU","date":"2017-09-02T22:13:23.543+0000","up_votes":2,"down_votes":1,"body":"I already commented on other threads like this one. I guess there's no chance they are changing their mind about runes, so I have to ask them one thing.\n\nWhy did you ask us for our opinion on rune refunds if you were just going to ignore it?\n\nThis isn't something to quit the game over, but it's very insulting.","replies":[{"poster":"Krèépy","date":"2017-09-02T22:16:20.743+0000","up_votes":3,"down_votes":3,"body":"> [{quoted}](name=SanKakU,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=000a,timestamp=2017-09-02T22:13:23.543+0000)\n>\n> I already commented on other threads like this one. I guess there&#x27;s no chance they are changing their mind about runes, so I have to ask them one thing.\n> \n> Why did you ask us for our opinion on rune refunds if you were just going to ignore it?\n\nSo what type of things would you like Riot to do, would a IP refund of like 50% be enough for you?","replies":[{"poster":"SanKakU","date":"2017-09-02T22:19:20.310+0000","up_votes":3,"down_votes":0,"body":"I think it's perhaps more complicated than that after watching your video. For my position, I would dislike it, but I would accept it without complaint. They already warned us they might only refund 40 percent of the runes' costs. Then they turned around and cut away even more of the percentage. Giving us 50 percent would show that they at least paid attention to the feedback we gave them.\n\nAs it stands I'm not even convinced of the truth of the comment they posted on your YouTube video. Anyone can make a post saying 'okay I see what you mean' and then not actually pay attention to or give appropriate amount of thought to the matter.","replies":[{"poster":"Krèépy","date":"2017-09-02T22:24:03.081+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SanKakU,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=000a00000000,timestamp=2017-09-02T22:19:20.310+0000)\n>\n> I think it&#x27;s perhaps more complicated than that after watching your video. For my position, I would dislike it, but I would accept it without complaint. They already warned us they might only refund 40 percent of the runes&#x27; costs. Then they turned around and cut away even more of the percentage. Giving us 50 percent would show that they at least paid attention to the feedback we gave them.\n\nI think I'm in the same boat with you. I would have disliked it but the 50% refund would have definitely pacified me.","replies":[]}]}]}]},{"poster":"Titanium70","date":"2017-09-02T19:24:11.335+0000","up_votes":4,"down_votes":1,"body":"First of all...\n\n> make us \"veterans\" feel better\n\n\nNO. That's your opinions and yours only - speak for your selfe not for me, thx! \n\n\nThan... \nwhat on earth is your actual point?\nYou want to be set close to the level cap? WHY???\n\nThe whole POINT of the new levels is for you to have a route of achievements to collect other than pure LP farming.\nBoosting someone to Cap would be hilarious! \n\nDo you really want to tell me  after playing 6k games on one account - for what ever reason you would make a second ,never got that one, but hey w/e - you DONT DROWN in IP??? LOL! \n\nI've thrown out round about 100k IP this year to buy all runes left only for me to hit the Rune-Cap and screw up my entire Shop - that was funny.. and ridiculous - and I'm still sitting one the same amount! x'D \n\n\n---------------------\nThan the usual refund q.q...\nA refund would be completely necessary if the new runes would cost.. SOMETHING, but they DONT! \nSo what on earth you want with a full refund in the first place!?!!\n\nBuy every single new item the second it get released to once hit the wall of no way to spent your IP on?\nAs reminder, the whole point of this Update is to allow players to gain something out of their IP after obtaining each  Champ!\n\nRunepages... why would you want a refund on runepages at all?!?... Yeah... since they're working like masteries now.. you dont 'NEED' more than 3-4... but you still HAVE 20 you can use freely... you don't loose anything - getting a refund on those is pure generosity and nothing else! \n\n---------------------------\nSo...\n\n> Tell Riot how you feel!\n\nThx for the 'Veterans-Shop' - this will be fun. ^^","replies":[{"poster":"Krèépy","date":"2017-09-02T20:19:15.181+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Titanium70,realm=EUW,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=0006,timestamp=2017-09-02T19:24:11.335+0000)\n\n> \n> NO. That&#x27;s your opinions and yours only - speak for your selfe not for me, thx! \n> Than... \n> what on earth is your actual point?\n> You want to be set close to the level cap? WHY???\n> The whole POINT of the new levels is for you to have a route of achievements to collect other than pure LP farming.\n> Boosting someone to Cap would be hilarious! \n> Than the usual refund q.q...\n> A refund would be completely necessary if the new runes would cost.. SOMETHING, but they DONT! \n> So what on earth you want with a full refund in the first place!?!!\n> Buy every single new item the second it get released to once hit the wall of no way to spent your IP on?\n> As reminder, the whole point of this Update is to allow players to gain something out of their IP after obtaining each  Champ!\n\nYou ignored the majority of what I said and typed but that's ok. I couldn't expect someone that's only here to talk down on those who are upset about the way they have been treated-even though I didn't say anything was wrong with the new system.\nThis opinion isn't just mine-go read the forums and comments.\nLevel has meant nothing to me for the past 7 years tbh, It only takes like 150 games to get to 30. Level only means that less experienced players aren't in level 30 games non-stop. I'd want to be boosted in level as a form of  Riot showing veterans that they care. That's all I want from Riot. Care.\nI didn't ask for a full refund & personally (as the video stated) I don't care about blue essence or anything in that BE shop. When you've been around as long as most vets that stuff doesn't look too flashy. \nAgain I didn't say anything was wrong with the new system, I really don't know why you're on the forums instead of playing the game when you are happy. Seems like you just want to argue online but if that's how you fill your days go ahead. Some of us feel slighted and want change.","replies":[{"poster":"Titanium70","date":"2017-09-02T23:16:57.363+0000","up_votes":2,"down_votes":1,"body":"But... If I dont care about - Level, you dont care about Level\nI don't care about BE, you don't care about BE...\n\nWhy should Riot act like they'd have to if we cared? x'D\n\nAnd btw - you also ignored my point:\nthey idea - of both the level and the BE system is to give players an option to keep on playing for something else but pure fun. Level Up, get some Chests skins and what ever... \n\nthrowing all or most of these rewards out to those who'd got them by now would leave them in exactly the same situation as before. With no other goal other than play for fun... wich is nothing wrong at all, but Riot wanted to do this, so they wont make the 'veterans' skip the system which basicly is DESIGNED for them!","replies":[]}]}]},{"poster":"Randomonium","date":"2017-09-02T19:30:00.944+0000","up_votes":5,"down_votes":2,"body":"I don't understand the massive hate.  I own all the champions, 16 rune pages, well over 100 runes, and have at least 1 good skin for every champion I play.  Would I love it if all my runes got refunded 100%?  Yeah, it would be nice.  Is it necessary.  Hell no.  Once the conversion happens I'll have around 100K blue essence.  Under the old system my IP would have been pretty much worthless except for the biannual chroma sales and to instantly buy every new champion that comes out.  At least under the new system I'll be able to buy  chromas, ward skins, icons and maybe even a super rare skin if I grind a lot before then.  Its a net gain no matter how you look at it.\n\nAt the end of the day yes we are losing some time investment but if you honestly expected to get a good return on PLAYING A VIDEO GAME then you really need to wake up.  Most video games die out and all the time you invested is worth literally nothing.\n\nI'm happy Riot is making these changes because it will make the experience MUCH better for newer players.  Furthermore, while I'm not getting a 100% return I will be able to pick up some cool stuff once pre-season hits so that's not bad at all.  I honestly would have been fine if they made runes free and didn't give ANY refund because its just the right thing to do.\n\nYour complaint is like you buying groceries and then getting pissed off that the grocery store donates leftover food to a homeless shelter.  Its not at all like being denied a pension because you aren't actually losing anything.  You got value out of the runes for 7 seasons.  Now you get the NEW runes for FREE and you get a partial refund on your old runes.","replies":[{"poster":"Krèépy","date":"2017-09-02T20:09:06.106+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Randomonium,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=0007,timestamp=2017-09-02T19:30:00.944+0000)\n\n> Your complaint is like you buying groceries and then getting pissed off that the grocery store donates leftover food to a homeless shelter.  Its not at all like being denied a pension because you aren&#x27;t actually losing anything.  You got value out of the runes for 7 seasons.  Now you get the NEW runes for FREE and you get a partial refund on your old runes.\n\nWhat you should have said is my complaint is  like me buying groceries and then getting pissed off at the store when they give fresh food off the shelf to normal people like me. New players aren't homeless and the new runes aren't leftovers.  They're just new and don't have to grind. Again I gave congrats to the new players for not having to do that.. actually clapped for them. \n\nIt's not your fault that many of the veteran players are upset about the change. But who are you to tell us that we shouldn't be upset? Why are you typing on the forum telling players that want to make a difference, that want Riot to treat us better, that we should just suck it up. If you're happy go play the game. I'm here because I'm pissed like the rest who agree with me.. why are you? If someone in my life moved away and I voiced my sadness would you walk up to me and say \"Hey you couldn't expect them to live here forever, you put the time into that relationship knowing it could end one day.\" If you're happy good for you, don't try to stop other's from trying to get something more for their efforts.","replies":[{"poster":"Randomonium","date":"2017-09-02T20:20:51.507+0000","up_votes":1,"down_votes":0,"body":"Did you even read what I wrote?  I have more champions, rune pages, and runes than you do.  So technically I'm \"losing\" more than you and I should be more pissed than you.  In reality though we aren't losing anything.  We are all gaining more use for the IP we have stacked up.  Its just that new players are getting more than us which is fine because we already have plenty.  That's why my analogy works.  We are effectively the upper-middle class or upper-class of league because we have more than everyone else.  New players are effectively the homeless and the poor because they have virtually nothing in game.\n\nJust because you're not happy doesn't mean that I'm not entitled to my opinion.  At the end of the day the system will be better and everyone will get something from it.  I'm not stopping you from doing anything.  I'm voicing my opinion just like you are.  That's the whole point of these forums, to share contrasting opinions and ideas.  You just want to live in an echo chamber where everyone agrees with you.","replies":[{"poster":"Krèépy","date":"2017-09-02T20:56:09.699+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Randomonium,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=000700000000,timestamp=2017-09-02T20:20:51.507+0000)\n\n> Just because you&#x27;re not happy doesn&#x27;t mean that I&#x27;m not entitled to my opinion.  At the end of the day the system will be better and everyone will get something from it.  I&#x27;m not stopping you from doing anything.  I&#x27;m voicing my opinion just like you are.  That&#x27;s the whole point of these forums, to share contrasting opinions and ideas.  You just want to live in an echo chamber where everyone agrees with you.\n\n\"It's not your fault that many of the veteran players are upset about the change. But who are you to tell us that we shouldn't be upset? Why are you typing on the forum telling players that want to make a difference, that want Riot to treat us better, that we should just suck it up. If you're happy go play the game. I'm here because I'm pissed like the rest who agree with me.. why are you? If someone in my life moved away and I voiced my sadness would you walk up to me and say \"Hey you couldn't expect them to live here forever, you put the time into that relationship knowing it could end one day.\" If you're happy good for you, don't try to stop other's from trying to get something more for their efforts.\"\n\nRiot has already replied to my video man, I don't know  what you want or what you are after by telling people you aren't upset. A lot of us are, and that why we are voicing our concerns. To be honest we really don't care that you aren't upset with us, good for you. You typing anything isn't going to change the fact that Riot has broken our trust. Again I don't know  what you want by voicing the fact that you're ok with the new changes. I also don't know what part of my original video/post you feel the need to reply to. If you aren't upset and you aren't Riot.. why aren't you doing something else?","replies":[{"poster":"Randomonium","date":"2017-09-02T21:12:23.107+0000","up_votes":2,"down_votes":0,"body":"Lol, Riot has broken your trust.  My god how entitled are you people?  Riot is giving a handout to new players but they've broken your trust.  You'll like those rich people who complain because the government helps people with welfare.","replies":[{"poster":"Krèépy","date":"2017-09-02T21:22:47.059+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Randomonium,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=00070000000000000000,timestamp=2017-09-02T21:12:23.107+0000)\n>\n> Lol, Riot has broken your trust.  My god how entitled are you people?  Riot is giving a handout to new players but they&#x27;ve broken your trust.  You&#x27;ll like those rich people who complain because the government helps people with welfare.\n\nAgain dude I didn't say anything was wrong with the new people getting free stuff and you just ignore that over and over. The fact is idk why you're here if you're happy. You had to come searching to post in topics where people are upset and trying to make Riot understand why they feel the way they do. I get it, you aren't upset. Congrats.\n\nYou have a total of  11.2k UPVOTES. To me, that means you sit on this forum a lot and post a lot. You have probably voiced your opinions about hundreds of league topics and if that's what you call fun go ahead. However, knowing how many posts upon posts you make on this forum.. I know you just want to be seen and heard for no reason. 11.2 thousand upvotes.. sometimes saying less is more & because you seem to voice your opinion all day every day I really don't feel like you need anyone in this topic to respond to you (I'm sure you have dozens more you are currently a part of). Enjoy yourself.","replies":[{"poster":"Randomonium","date":"2017-09-03T22:56:20.560+0000","up_votes":1,"down_votes":0,"body":"Lol it's easy to get upvotes. I just respond to random shit when I'm bored.\n\nUnlike you I actually like listening to other people with opinions different than me and having a friendly debate about it. You prefer to make up your mind before having all the facts and being ignorant of all other points of view.\n\nFine by me, if you want to be ignorant and act like an ass then I can't really stop you. That said, it would be much better for YOU to actually keep an open mind about things.","replies":[{"poster":"Krèépy","date":"2017-09-04T01:34:53.975+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Randomonium,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=0007000000000000000000000001,timestamp=2017-09-03T22:56:20.560+0000)\n\nI'm not going to sit here and argue how I feel with someone who does this for fun. This isn't fun to me, I'm pissed off. You telling me I shouldn't be pissed doesn't do a thing for me or the vast number of players who share my pain. You're just talking for no reason-like you more than likely -always- do.. for 11.2 thousand posts. No Bueno.\n\nEdit: Again, I'm not doing this because I'm interested in what you have to say. I'm doing this because I want to make a change. Take your interested \"behind\" to the mother loving library & read a biography.","replies":[{"poster":"Randomonium","date":"2017-09-04T04:33:01.215+0000","up_votes":1,"down_votes":0,"body":"If you don't like talking with people and sharing your ideas then why are you on a public forum and posting videos on YouTube? The whole point of language is to share information.  You've shared your opinion and I disagree with you so I'm sharing mine.  That's the whole point of these forums.  You give me evidence that supports your position and I give you counter-arguments.  That's how discussions work.  Except you're too lazy to do that.  You just want to state your opinion and then not listen to anyone else.  News flash bro, you don't know everything and your opinion isn't absolute truth.  If you opened your eyes and actually listened to other people then maybe you wouldn't feel so pissed about the situation.  You do have power over your emotions after all.  You have a choice in whether something pisses you off.  One of the best ways to control your emotions is with knowledge and information.\n\nI also love how passive aggressive you are.  That's what I find so hilarious about all of this.  Instead of actually having a discussion about the ISSUE you'd rather talk about my upvotes and how many posts I've made.  People only do that when they don't actually have a point, when they don't actually have logic and evidence to back things up.  That's what's hilarious.  You're trying to rile me up but I've dealt with this kind of crap thousands of times before and I've learned not to take the bait.\n\nI'm not talking for \"no reason\", I'm talking to actually have a discussion.  YOU are talking for \"no reason\" because you won't listen what others have to say.  How can you expect people to listen to you if you aren't willing to listen to others?  You are a hypocrite.  You treat others with disrespect and you expect respect in return.  You expect Riot to listen to you when you aren't willing to listen to anyone else.\n\nI'm glad Riot responded to your tantrum and made you feel better but I just want you to know, man to man, that you're acting like a 2 year old who didn't get a toy in the store they wanted.","replies":[{"poster":"Krèépy","date":"2017-09-04T17:18:20.900+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Randomonium,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=000700000000000000000000000100000000,timestamp=2017-09-04T04:33:01.215+0000)\n>\nI literally don't read your posts.","replies":[{"poster":"Randomonium","date":"2017-09-05T02:14:09.109+0000","up_votes":1,"down_votes":0,"body":"Lol thanks for proving my point.","replies":[]}]}]}]}]},{"poster":"HaIlMonitor","date":"2017-09-03T03:04:13.976+0000","up_votes":1,"down_votes":0,"body":"If it was 50% and we got to pick skins based on rune page that would have been so much better.","replies":[]}]}]}]}]}]}]},{"poster":"FilDaFunk","date":"2017-09-03T13:20:36.272+0000","up_votes":2,"down_votes":0,"body":"If chromas were on a permanent IP sale, I'd be ok with getting IP back. As is, IP is worthless for me, so I'm hoping for an actual reward.","replies":[{"poster":"Krèépy","date":"2017-09-03T18:16:44.153+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=FilDaFunk,realm=EUW,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=0018,timestamp=2017-09-03T13:20:36.272+0000)\n>\n> If chromas were on a permanent IP sale, I&#x27;d be ok with getting IP back. As is, IP is worthless for me, so I&#x27;m hoping for an actual reward.\n\nSame here, IP and Blue Essence (probably) seem worthless to me. I want something actually meaningful & it doesn't have to be a physical thing. If Riot made a VIDEO, a well thought out video to thank the veterans of this game I would still be disappointed-but I would feel like they care.","replies":[]}]},{"poster":"aspects1","date":"2017-09-03T08:43:49.185+0000","up_votes":2,"down_votes":0,"body":"yes yes, good goooooood\nembrace your anger\nhttp://i.imgur.com/bvvnKKv.jpg","replies":[{"poster":"Krèépy","date":"2017-09-03T15:23:40.166+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=aspects1,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=0017,timestamp=2017-09-03T08:43:49.185+0000)\n>\n> yes yes, good goooooood\n> embrace your anger\n> http://i.imgur.com/bvvnKKv.jpg\n\nlmaooo","replies":[]}]},{"poster":"Automated Riven","date":"2017-09-03T08:31:13.158+0000","up_votes":2,"down_votes":0,"body":"As a player since season 1. I have the kayle skin to prove it. I Have been defending riot from the get go. But there were some points that you made which resonated with me. \n1. The blue essence refund is shit in the sense that people like you, and like me, have everything. The skins we want. All the champion, everything. \n2. When riot promised us veterans something for our time I honestly thought it was gonna be free skins. I really did. But the blue essence refund I dont care anything about. \n3. I initially cringed at the idea that riot and us have been in an 8 year relationship. but upon thinking about it I realized that I have spent more christmases. thanksgivings, easters, birthdays, and what have you playing the shit out of this game with random strangers then I have with my own family in the last 8 years. so fuck it. This is as close of a relationship I have. \n4. I really understand how you feel. I do. I am not upset with riot. Because I believe that them working their asses off to make a game that was so good people wanted to spend money to play it (thats what I did. Whenever i had money for a game I chose to spend money on this one. I didnt go buy more games because I only wanted to play league) so that they could give it to us for free. Damn man. I think that in and of itself is super awesome. This aint no fucking mmorp with $40 a month subscription. This is the greatest game company on the earth atm making the best game in the world and letting us play it for free. \n5. But that being said. I can completely understand how great it would feel to have something that let people know. \"hey. I have been here since the beginning.\" Like telling everyone in your games that your have fucking been in it through the long haul. You fought with riot and stood by them for years of bad times and good. And ya, that would feel pretty good. \n6. Ultimately this is riots choice. I will stand by them and continue to play league no matter what they decide. But I feel ya man. \n\nI disagree with some of the things you said. But damn man. Props for sticking around so long. And thanks for going out and being honest. Let us agree to disagree on some of the points.","replies":[{"poster":"Krèépy","date":"2017-09-03T15:32:51.406+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Automated Riven,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=0016,timestamp=2017-09-03T08:31:13.158+0000)\n>\n> As a player since season 1. I have the kayle skin to prove it. I Have been defending riot from the get go. But there were some points that you made which resonated with me. \n> 1. The blue essence refund is shit in the sense that people like you, and like me, have everything. The skins we want. All the champion, everything. \n> 2. When riot promised us veterans something for our time I honestly thought it was gonna be free skins. I really did. But the blue essence refund I dont care anything about. \n> 3. I initially cringed at the idea that riot and us have been in an 8 year relationship. but upon thinking about it I realized that I have spent more christmases. thanksgivings, easters, birthdays, and what have you playing the shit out of this game with random strangers then I have with my own family in the last 8 years. so fuck it. This is as close of a relationship I have. \n> 4. I really understand how you feel. I do. I am not upset with riot. Because I believe that them working their asses off to make a game that was so good people wanted to spend money to play it (thats what I did. Whenever i had money for a game I chose to spend money on this one. I didnt go buy more games because I only wanted to play league) so that they could give it to us for free. Damn man. I think that in and of itself is super awesome. This aint no fucking mmorp with $40 a month subscription. This is the greatest game company on the earth atm making the best game in the world and letting us play it for free. \n> 5. But that being said. I can completely understand how great it would feel to have something that let people know. &quot;hey. I have been here since the beginning.&quot; Like telling everyone in your games that your have fucking been in it through the long haul. You fought with riot and stood by them for years of bad times and good. And ya, that would feel pretty good. \n> 6. Ultimately this is riots choice. I will stand by them and continue to play league no matter what they decide. But I feel ya man. \n> \n> I disagree with some of the things you said. But damn man. Props for sticking around so long. And thanks for going out and being honest. Let us agree to disagree on some of the points.\n\nI love Riot too man. It's good to know that I'm not the only player that could \"care less\" about the blue essence shop. The fact that Riot is still around is a testament of the loyalty we've shown the company-some of us just want the recognition while others don't.","replies":[]}]},{"poster":"chipndip1","date":"2017-09-02T16:59:25.547+0000","up_votes":10,"down_votes":9,"body":"One thing you guys forget: You *already got the value of the runes in the first place.* Runes give an edge in-game in the way of pre-game stat building. You've been using that advantage for 8 years. You're also getting some (not a lot, but some) compensation for the runes you bought and rune pages bought with irl dough. How are you gonna demand a full refund off of something you've been steady using for almost a decade? The only people getting full refunds are the people that *recently* bought runes during this season, and only for those runes. That's fair, honestly. I got to all my ranked goals in the seasons prior, and part of that success is through utilizing runes. That said, I got their value's worth. No need getting THIS salty over it.\n\nLike, ultimately, you didn't pay a *real* cent for the runes in the first place. They aren't robbing you. Chill.","replies":[{"poster":"Grokmir","date":"2017-09-02T21:53:01.389+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=chipndip1,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=0002,timestamp=2017-09-02T16:59:25.547+0000)\n>\n> One thing you guys forget: You *already got the value of the runes in the first place.* Runes give an edge in-game in the way of pre-game stat building. You&#x27;ve been using that advantage for 8 years. You&#x27;re also getting some (not a lot, but some) compensation for the runes you bought and rune pages bought with irl dough. How are you gonna demand a full refund off of something you&#x27;ve been steady using for almost a decade? The only people getting full refunds are the people that *recently* bought runes during this season, and only for those runes. That&#x27;s fair, honestly. I got to all my ranked goals in the seasons prior, and part of that success is through utilizing runes. That said, I got their value&#x27;s worth. No need getting THIS salty over it.\n> \n> Like, ultimately, you didn&#x27;t pay a *real* cent for the runes in the first place. They aren&#x27;t robbing you. Chill.\n\nNo we haven't been using runes as an advantage for 8 years. We've been using them to negate the disadvantage of not having them. Its not like they are some optional thing that we have been abusing to be better than other players. Runes are MANDATORY to have any success in this game. Mandatory items that we just so happen to spend potentially weeks of play time to collect.\n\nI just want things to be fair. They should've either given a full refund to EVERYONE or given no refund to ANYONE. Anything else is just favoritism.\n\nBut what really fucking irks me is that it took riot 8 fucking years to make runes free for everyone.\n\nAnyways the reduced refund fucks over literally everyone who hasn't been no life-ing it for 5+ years. Oh new players don't won't have any ip without the refund? What about all my friends who have been playing since season 2/3 and don't own all the champs and don't have any ip stockpiled? Fuck them i guess right? Explain to me how its fair for new players to get the full refund while all these dedicated old players just get fuck all? Because they had to spend their ip on runes instead of champs? Oh sounds a little familiar I wonder why.","replies":[{"poster":"chipndip1","date":"2017-09-03T01:41:32.618+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Grokmir the bold,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=00020001,timestamp=2017-09-02T21:53:01.389+0000)\n>\n> No we haven&#x27;t been using runes as an advantage for 8 years.\n\nThe OP's problem, so 8 years is for the OP.\n\n> We&#x27;ve been using them to negate the disadvantage of not having them. \n\nDoesn't refute the point. Those that used them got the benefit of them for as long as they used them until now.\n\n> Its not like they are some optional thing that we have been abusing to be better than other players. \n\nThat's EXACTLY what they are in this game by design. Nothing forces you to pick specific runes, but you do so because of the meta = Most. Efficient. Tactics. Available. Nothing forces you to take runes AT ALL, either.\n\n> Runes are MANDATORY to have any success in this game. Mandatory items that we just so happen to spend potentially weeks of play time to collect.\n\nThat's why it's being changed in the first place, but they aren't objectively mandatory, either.\n \n> I just want things to be fair. They should&#x27;ve either given a full refund to EVERYONE or given no refund to ANYONE. Anything else is just favoritism.\n\nIt is...a small refund for everyone that bought runes and some bonus rewards for people that bought x amount of rune pages with RP. Any runes bought recently will be fully refunded. TADA.\n \n> Anyways the reduced refund fucks over literally everyone who hasn&#x27;t been no life-ing it for 5+ years. \n\nLiterally IS the OP by the OP's words. Newly bought runes are to be fully refunded, anyway.","replies":[{"poster":"Grokmir","date":"2017-09-03T06:50:58.036+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=chipndip1,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=000200010001,timestamp=2017-09-03T01:41:32.618+0000)\n>\n> The OP&#x27;s problem, so 8 years is for the OP.\n> \n> Doesn&#x27;t refute the point. Those that used them got the benefit of them for as long as they used them until now.\n> \n> That&#x27;s EXACTLY what they are in this game by design. Nothing forces you to pick specific runes, but you do so because of the meta = Most. Efficient. Tactics. Available. Nothing forces you to take runes AT ALL, either.\n> \n> That&#x27;s why it&#x27;s being changed in the first place, but they aren&#x27;t objectively mandatory, either.\n> \n> It is...a small refund for everyone that bought runes and some bonus rewards for people that bought x amount of rune pages with RP. Any runes bought recently will be fully refunded. TADA.\n> \n> Literally IS the OP by the OP&#x27;s words. Newly bought runes are to be fully refunded, anyway.\n\n1. The amount time wasn't the point.\n\n2. There's a difference between buying them because they give you an advantage and being forced to buy them to compete. Its not the same thing at all in any situation.\n\n3. \"There's nothing FORCING me not to buy deathcap on draven, so I'm going to do it and it won't affect my gameplay at all.\"\n\"There's nothing FORCING me to actually put three X's in a row in tic tac toe, so im going to win without doing that.\"\n\"There's nothing FORCING me to not give away all my money to random people on the street, so I'll do that and somehow not be poor.\"\nDo you understand how dumb that sounds? Yeah nothing is forcing you to take runes, but you're handicapping yourself and ruining the game for yourself and everyone on your team. Show me a SINGLE person above silver that doesn't have runes. Hell show me anyone above bronze that doesn't have runes.\n\n4. Irrelevant and they should've been free 8 years ago.\n\n5. You literally could not have understood my point there. I don't know how to respond so I'll repeat. Fair = everyone gets the same refund.\n\n6. What are you even trying to say at this point? That has nothing to do with what i said.","replies":[{"poster":"chipndip1","date":"2017-09-03T16:26:21.514+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Grokmir the bold,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=0002000100010000,timestamp=2017-09-03T06:50:58.036+0000)\n>\n> 1. The amount time wasn&#x27;t the point.\n\n- OP makes a post about *veteran players*\n\n\"It isn't about the length of time played\"\n\n????????????????????????????????\n \n> 2. There&#x27;s a difference between buying them because they give you an advantage and being forced to buy them to compete. Its not the same thing at all in any situation.\n\nYou aren't forced to do jack shit. It's kind of like Pokemon: It's not *mandatory* to EV/IV train your team, but competitive players do because there is an advantage there to be had. It's not *mandatory* more than it's \"expected to be utilized\". If it was *mandatory* then it'd be apart of the requirements along with having 20 champs.\n \n> 3. &quot;There&#x27;s nothing FORCING me not to buy deathcap on draven, so I&#x27;m going to do it and it won&#x27;t affect my gameplay at all.&quot;\n\nIt will, but that's your choice + you're starting to grasp for straws. No one's insinuating that you should do something because you can.\n\n> &quot;There&#x27;s nothing FORCING me to actually put three X&#x27;s in a row in tic tac toe, so im going to win without doing that.&quot;\n\nYou *objectively cannot win tic-tac-toe without three in a row.* The thing forcing you to put three in a row is *literally the game you're playing.* In contrast, you *can* win a game with the wrong runes/masteries on, or even missing runes/masteries.\n\n> &quot;There&#x27;s nothing FORCING me to not give away all my money to random people on the street, so I&#x27;ll do that and somehow not be poor.&quot;\n\nYou can objectively give every cent you have to the poor. No one is stopping you. The consequence of doing that is being poor.\n\n> Do you understand how dumb that sounds?\n\n...yes? Then again, these are all your dumb ideas\n\n\n> Yeah nothing is forcing you to take runes, but you&#x27;re handicapping yourself and ruining the game for yourself and everyone on your team. Show me a SINGLE person above silver that doesn&#x27;t have runes. Hell show me anyone above bronze that doesn&#x27;t have runes.\n\nThis is all beside the point. Actually, it fuels my point: We all used runes for the advantages we could find in them up until now. To boot, you get a small refund on your runes bought. Not only did you achieve personal ranked goals, a few penta-kills, and whatever else with them, but you also get a bit of IP value back after using them, anyway. Plenty of online games have either discontinued features or straight up shut down without refunding people for money or in-game currency value.\n \n> 4. Irrelevant and they should&#x27;ve been free 8 years ago.\n\nHindsight is 20/20.\n \n> 5. You literally could not have understood my point there. I don&#x27;t know how to respond so I&#x27;ll repeat. Fair = everyone gets the same refund.\n\nEveryone DOES get the same refund, though, based on what's being refunded. You don't HAVE a point is what I was telling you.\n \n> 6. What are you even trying to say at this point? That has nothing to do with what i said.\n\n\"This refund fucks over anyone that isn't no-lifing the game\"\n\n...the OP is someone that's been playing for the LONGEST time. The OP is literally that demographic.\n\n\"WTF are you saying!?\"\n\n?????????????????????????????????","replies":[{"poster":"Grokmir","date":"2017-09-03T18:22:52.605+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=chipndip1,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=00020001000100000000,timestamp=2017-09-03T16:26:21.514+0000)\n>\n> - OP makes a post about *veteran players*\n> \n> &quot;It isn&#x27;t about the length of time played&quot;\n> \n> ????????????????????????????????\n> \n> You aren&#x27;t forced to do jack shit. It&#x27;s kind of like Pokemon: It&#x27;s not *mandatory* to EV/IV train your team, but competitive players do because there is an advantage there to be had. It&#x27;s not *mandatory* more than it&#x27;s &quot;expected to be utilized&quot;. If it was *mandatory* then it&#x27;d be apart of the requirements along with having 20 champs.\n> \n> It will, but that&#x27;s your choice + you&#x27;re starting to grasp for straws. No one&#x27;s insinuating that you should do something because you can.\n> \n> You *objectively cannot win tic-tac-toe without three in a row.* The thing forcing you to put three in a row is *literally the game you&#x27;re playing.* In contrast, you *can* win a game with the wrong runes/masteries on, or even missing runes/masteries.\n> \n> You can objectively give every cent you have to the poor. No one is stopping you. The consequence of doing that is being poor.\n> \n> ...yes? Then again, these are all your dumb ideas\n> \n> This is all beside the point. Actually, it fuels my point: We all used runes for the advantages we could find in them up until now. To boot, you get a small refund on your runes bought. Not only did you achieve personal ranked goals, a few penta-kills, and whatever else with them, but you also get a bit of IP value back after using them, anyway. Plenty of online games have either discontinued features or straight up shut down without refunding people for money or in-game currency value.\n> \n> Hindsight is 20/20.\n> \n> Everyone DOES get the same refund, though, based on what&#x27;s being refunded. You don&#x27;t HAVE a point is what I was telling you.\n> \n> &quot;This refund fucks over anyone that isn&#x27;t no-lifing the game&quot;\n> \n> ...the OP is someone that&#x27;s been playing for the LONGEST time. The OP is literally that demographic.\n> \n> &quot;WTF are you saying!?&quot;\n> \n> ?????????????????????????????????\n\nI like how you nitpick my posts and complain about not understanding what I'm saying. You must really believe the whole not mandatory thing with how you refuse to use reading comprehension.\n\nI'm going to try and keep this really simple so that you can't miss anything.\n\n1. The point is IP gained DESPITE time played.\n\n2. \"There's a difference between buying them because they give you an advantage and being forced to buy them to compete. Its not the same thing at all in any situation.\" Runes are not an advantage if everyone has them. Not having them puts you at more of a disadvantage than having them does. If you cannot understand this, then you are truly not worth my time.\n\n3. Here you don't understand how they are all the same situation. If you choose to not use runes/masteries you ruin your ability to play the game. Sure you can win games, but you will only win a small fraction of what you could have won. Choosing to not be on the same level as everyone else has always been seen as a dumb idea.\n\n4. Having runes allowed me to effectively use my skills to accomplish what I have in league. They didn't cause me to be diamond or get pentakills or whatever. I was forced to buy them so that I could do those things. Those other games you mention probably didn't give some of their playerbase 10/10 compensation while giving the others 1/10 compensation did they? The point is fairness.\n\n5. People have been saying the runes system is stupid for 8 years. Not exactly hindsight.\n\n6. I don't know how you can think everyone gets the same refund. How is people getting 15% of their rune cost refunded the same as people getting 100% of their rune cost refunded the same refund??\n\nSaying that everyone gets the same refund because their refund rules apply the same to everyone is just plain ridiculous when those rules are designed to not give equal refunds.\n\nAnd why do you keep referencing the op? He's not part of this conversation. And even if he is part of the demographic that doesn't get fucked then good for him I guess.","replies":[{"poster":"Krèépy","date":"2017-09-03T18:32:00.397+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Grokmir the bold,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=000200010001000000000000,timestamp=2017-09-03T18:22:52.605+0000)\n>\nMake sure you aren't arguing with people that post on this forum 24/7 for the past few years if you aren't in the same boat. The guy you keep typing to does this for a living.","replies":[]}]}]}]}]},{"poster":"Krèépy","date":"2017-09-02T21:57:38.629+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Grokmir the bold,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=00020001,timestamp=2017-09-02T21:53:01.389+0000)\n>\n> No we haven&#x27;t been using runes as an advantage for 8 years. We&#x27;ve been using them to negate the disadvantage of not having them. Its not like they are some optional thing that we have been abusing to be better than other players. Runes are MANDATORY to have any success in this game. Mandatory items that we just so happen to spend potentially weeks of play time to collect.\n> \n> I just want things to be fair. They should&#x27;ve either given a full refund to EVERYONE or given no refund to ANYONE. Anything else is just favoritism.\n> \n> But what really fucking irks me is that it took riot 8 fucking years to make runes free for everyone.\n> \n> Anyways the reduced refund fucks over literally everyone who hasn&#x27;t been no life-ing it for 5+ years. Oh new players don&#x27;t won&#x27;t have any ip without the refund? What about all my friends who have been playing since season 2/3 and don&#x27;t own all the champs and don&#x27;t have any ip stockpiled? Fuck them i guess right? Explain to me how its fair for new players to get the full refund while all these dedicated old players just get fuck all? Because they had to spend their ip on runes instead of champs? Oh sounds a little familiar I wonder why.\n\n I'm missing one champ and still don't own all the runes, I mean I can now but before this update I was close but still probably had like 10k IP to spend on them. I'm a preseason 1 vet but I didn't no life league. Good for those that did no life, good for those that put in no effort, happy for those that aren't pissed.. but anyone that's as upset along with me shouldn't be having this much trouble voicing their opinions on the forum.","replies":[{"poster":"Grokmir","date":"2017-09-02T22:06:28.681+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Krèépy,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=000200010000,timestamp=2017-09-02T21:57:38.629+0000)\n>\n> I&#x27;m missing one champ and still don&#x27;t own all the runes, I mean I can now but before this update I was close but still probably had like 10k IP to spend on them. I&#x27;m a preseason 1 vet but I didn&#x27;t no life league. Good for those that did no life, good for those that put in no effort, happy for those that aren&#x27;t pissed.. but anyone that&#x27;s as upset along with me shouldn&#x27;t be having this much trouble voicing their opinions on the forum.\n\nThe problem is all these people that it doesn't affect just don't care about people it does affect. I'm one of the few that it doesn't affect that still cares about it. Its just not fair for a lot of people to not give equal refunds to everyone. And what about all the people who joined in 2016? They're basically just as new as people in 2017 and yet they don't get the full refund?\n\nI just don't understand riot at all. I want them to explain WHY they decided on this and then also fix it. There's just no way they didn't expect backlash. Its just not possible.","replies":[{"poster":"Krèépy","date":"2017-09-02T22:11:43.233+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Grokmir the bold,realm=NA,application-id=3ErqAdtq,discussion-id=Gq3fxZxs,comment-id=0002000100000000,timestamp=2017-09-02T22:06:28.681+0000)\n>\n> The problem is all these people that it doesn&#x27;t affect just don&#x27;t care about people it does affect. I&#x27;m one of the few that it doesn&#x27;t affect that still cares about it. Its just not fair for a lot of people to not give equal refunds to everyone. And what about all the people who joined in 2016? They&#x27;re basically just as new as people in 2017 and yet they don&#x27;t get the full refund?\n> \n> I just don&#x27;t understand riot at all. I want them to explain WHY they decided on this and then also fix it. There&#x27;s just no way they didn&#x27;t expect backlash. Its just not possible.\n\nThere are a lot of mixed reasons why people feel the way they do, and there are a lot of different individual categories each league player fits into right now. Though they would have softened the blow a bit, even 2 or 3 conjunct scenarios on how to implement the new changes would have left a vast amount of players unhappy. It's up to us to tell Riot why we are upset and also a reasonable way for them to fix it. --However neither of those will happen if we stay silent.","replies":[]}]}]}]}]}]}