{"poster":"Canis858","date":"2018-04-25T17:37:49.133+0000","title":"Lasthiten","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo Beschw&ouml;rer-Pros,\r\nmeine Frage an euch:\r\nWird das Lasthitverhalten von ADCs in h&ouml;heren Bereichen besser?\r\nDanke f&uuml;r die Antwort schon mal im vorraus!:)\r\nGez. ein verzweifelter Supporter mit mehr Farm als sein ADC und Mid-Laner - ZUSAMMEN!:)","replies":[{"poster":"LiebesWölkchen","date":"2018-04-25T18:08:50.505+0000","up_votes":2,"down_votes":1,"body":"Tipp gegen verzweiflung:  Erwarte nichts , dann kannst du auch nicht enttäuscht werden x)\n\nPS:  nichts ist besser in höheren elos :/","replies":[{"poster":"Canis858","date":"2018-04-25T18:20:02.387+0000","up_votes":1,"down_votes":0,"body":"Aber es ist doch keine Erwartung, dass man beispielsweise bei einer Sivir (LV.7!) nach fast einer Stunde eine dreistellige Anzahl an Lasthits sehen möchte! :)\nOder kriegen bestimmte Spieler einen Buff, dass Sie nur noch mit Spielern mit ohne Fähigkeit zum Lasthiten bekommen? ;)","replies":[{"poster":"Nordwolf87","date":"2018-04-26T10:37:22.447+0000","up_votes":3,"down_votes":0,"body":"Seit anfang april (weiter hab ich nicht zurückgeschaut) war dein längstes game 45 minuten und damit weit weg von 1h und deine MF hatt 310 farm also deutlich 3stellig\n\nIch habe auch kein game gefunden wo du mehr CS hattest als der Adc geschweige denn als adc und mid zusammen o_O\n\nAußerdem liegen deine CS als MF adc  auch nur bei rund 5/min was keinesfalls blaming rechtfertigt.\n\nAber ja Lasthitten sollte je höher man kommt besser werden.","replies":[{"poster":"Canis858","date":"2018-04-30T15:49:09.760+0000","up_votes":1,"down_votes":0,"body":"Erstens: Ich blame hier nicht und wenn es so rübergekommen ist tut es mir Leid - meine Art von Humor ist halt sehr speziell! ;)\nMeine Games wo ich ADC war, waren Bot-Games. Dies ist auch der Grund warum ich im PvP-Bereich nicht ADC spiele - Ich kann es nämlich nicht und tu es deswegen auch nicht!\nZweitens: Das anschauen einer Matchhistorie bringt oftmals nichts - das nur so nebenbei :)\nAußerdem hatte ich ein Game, wo ich Soraka gespielt habe - soweit ich weiß mit einem Aatrox zusammen - wo ich extrem viel Farm mehr als diese hatte. Das war zu der Zeit als dieses Event mit dem Heile X Schäden war! Aber ich suche es Dir raus!\nUnd zuguterletzt noch danke für deine Aussage, dann werde ich mich Mal versuchen hochzueloen :D","replies":[]}]}]}]},{"poster":"SSI CptHaunted","date":"2018-04-26T07:22:06.826+0000","up_votes":1,"down_votes":0,"body":"Hat nichts mit höherer Elo zu tun. Klar werden die Spieler besser und Bronze/Silber ist von der CS-Genauigkeit auch kaum vergleichbar mit Master/Challanger, da die Leute logischerweise schon hin und wieder mal n Lasthit verpatzen. Aber im Groben und Ganzen liegt die CS-Rate dort meist irgendwo zwischen 5 und 8 pro Minute, ist natürlich auch etwas abhängig vom Spielverlauf, ob man afk farmen ist oder das Spiel länger dauert aber fast nur gefightet und im Team gepusht wird usw, aber wenn du da als Supporter mehr CS hast machst du was falsch.","replies":[]},{"poster":"Apucalypse","date":"2018-04-26T00:52:08.178+0000","up_votes":1,"down_votes":0,"body":"Es wird definitiv besser. Die Steigerung kommt aber recht langsam und im Solo-Que ist es noch einmal eine andere Geschichte als im Team Ranked. Aber eine Besserung gibt es aufjedenfall ;D (letzendlich kommt es dennoch auf den Spieler an. Auch in Silber gibt es Leute die sehr gut Farmen, aber anderswo Defizite haben).","replies":[]},{"poster":"renegade2k","date":"2018-04-25T18:01:36.889+0000","up_votes":1,"down_votes":0,"body":"Klar ...\nMit den meisten ADCs kriegt du im Laufe des Spiels mehr Angriffstempo und Crits ... Und damit eine deutlich höhere Chance auf ein Lasthit, als andere Klassen","replies":[{"poster":"Canis858","date":"2018-04-25T18:14:53.627+0000","up_votes":1,"down_votes":0,"body":"Stimmt so kann man das auch verstehen ;)\nAber eigentlich meinte ich die höheren Elo-Bereiche!","replies":[]}]},{"poster":"ADFischi007","date":"2018-04-25T17:40:37.789+0000","up_votes":1,"down_votes":0,"body":"Ja.","replies":[]}]}