{"poster":"Nenthos","date":"2018-08-13T22:09:40.316+0000","title":"Nunu rework? Why call it a rework when the champion is deleted?","subforum":"General Discussion","up_votes":2,"down_votes":3,"body":"I don&#039;t  like how these champions core design are completely gutted. If it&#039;s enhancing what&#039;s already there, cool, but it&#039;s gutting a concept and replacing it with a &quot;hip and cool&quot; one with only the theme slightly intact (a yeti and a boy) then why not make a new champ? It also makes me sick when people applaud gutting like it&#039;s the best thing ever. Never understood that mentality.  Is the new design great? Sure. But is it Nunu? No it&#039;s not.  I already know this post is going be downvoted to hell because of the horde of obnoxious asshats saying how they think old Nunu design was trash therefore that justifies everything, how im somehow missing the point when im not, but regardless im arguing this for the people who appreciated Nunu and liked him for what he was. How many more reworks until everyone is satisfied? Why not rework every champion in this godamm game, and completely disregard the connections people had spent playing with these characters or the story the original concept artists who created them wanted to express?  One the many reasons I don&#039;t play this game anymore because all of the champions I have played and loved get reworked into completely different characters with cluncky  streamlined gameplay.  Funny how the game is called League of Legends, and these &quot;Legends&quot; (the champions) that brought me into this game are certainly dying with trendy more digestible versions for the sheep masses, to take their place. Be sure to downvote because you think  think Nunu&#039;s &quot;rework&quot; is amazing ( which isn&#039;t the point im arguing against) and could care less if he&#039;s a different character and say how the old Nunu is &quot;outdataed&quot; and that there was no other way of riot making him more viable or instead of the rework making new champ instead.","replies":[]}