{"poster":"Mellix","date":"2019-12-04T16:59:09.220+0000","title":"wann  kommt die  schnee  map wieder  :3","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":0,"body":"wann  kommt die  schnee  map wieder  :3","replies":[{"poster":"WC9 Umbra","date":"2019-12-04T17:38:01.032+0000","up_votes":1,"down_votes":0,"body":"Hoffentlich garnicht, auf der kann man kaum spielen.","replies":[{"poster":"SayaShire","date":"2019-12-05T00:41:46.685+0000","up_votes":1,"down_votes":0,"body":"Weil?","replies":[{"poster":"GretaStoleMyCar","date":"2019-12-05T08:07:38.317+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SayaShire,realm=EUW,application-id=cGRapXds,discussion-id=o3eH141w,comment-id=00020000,timestamp=2019-12-05T00:41:46.685+0000)\n>\n> Weil?\n\nWeil man teilweise Skills nur schwer bis gar nicht sehen kann?","replies":[{"poster":"ILaserpointer","date":"2019-12-05T12:10:24.022+0000","up_votes":1,"down_votes":0,"body":"naja.. vllt liegts ja nur an deinen augen .. aber grundsätzlich finde ich, dass es inzwischen mords viele skins gibt, bei denen man teils extrem schwer einschätzen kann wie die hitboxen sind ... in der kombination könnte das natürlich kritisch sein, aber ist ja eh preseason - sogesehen sind rankeds noch egaler als eh und man kann ja einstellen, dass in rankeds die normale map genutzt wird und in normals dann die schneemap ... aber das ist sowieso hypothetisch, da das mit den mapveränderungen durch die drachen nicht umsetzbar wäre und sie kaum einen mehraufwand für nen einfachen mapskin erbringen werden.","replies":[{"poster":"HyperionCH","date":"2019-12-05T12:39:31.933+0000","up_votes":1,"down_votes":0,"body":"ICh glaube, letztes Jahr war es auch so, dass die Winter-Map nur in Normals zu sehen war und in Rankeds weiterhin die normale (kann mich aber irren, da ich selten Rankeds spiele; insbesondere in der Pre-Season).\n\nRein theoretisch hätte Riot aber auch simultan zur Mapveränderung die Wintermap anpassen können. Das ist eher eine Frage der Planung und Koordination.\n\nNatürlich ist es ein Mehraufwand, der keinen (direkten) Ertrag erbringt. Dies betrifft aber auch andere Bereiche wie Visual Updates und grössere Änderungen von Champs, Fun-Modes (All4one, URF, etc.), Clientverbesserungen und vieles mehr.\nAber indirekt machen solche Dinge Sinn, da man so spieler-orientierter agiert und die Zufriedenheit der Community steigt. Dann sind mehr Spieler mehr bereit, RP zu kaufen.\n\nIch z.B. kaufe seit einigen Jahren keine RP mehr (früher: sehr oft!), weil ich das Gefühl habe, dass Riot Games sich überhaupt nicht um das Wohl und die Wünsche der Community kümmert; und wenn doch, dann nur bei der Gruppe der Core-Gamer, zu der ich nicht gehöre.","replies":[{"poster":"ILaserpointer","date":"2019-12-05T18:04:06.034+0000","up_votes":2,"down_votes":0,"body":"normalerweise ist es eine frage der planung und koordination - bei riot games aber eher eine des willens... ich bezweifel, dass dahingehend etwas unternommen wurde oder je wird. persönlich vermisse ich vor allem 3v3 und dominion.. ich habe seit der alpha vielleicht 20€ in dieses spiel investiert^^","replies":[{"poster":"HyperionCH","date":"2019-12-05T22:07:52.965+0000","up_votes":1,"down_votes":0,"body":"OK, ich habe jetzt geschrieben, was betriebsökonomisch Sinn machen würde. Das ist oft nicht das gleiche, was Riot Games tut. :D","replies":[{"poster":"ILaserpointer","date":"2019-12-07T12:25:38.618+0000","up_votes":1,"down_votes":0,"body":"kurioserweise :D","replies":[]}]}]}]}]}]}]},{"poster":"Mistér Hydé","date":"2019-12-05T13:23:10.269+0000","up_votes":1,"down_votes":0,"body":"man kann die Map ausstellen und auf der normalen Map spielen mache ich jedes Jahr mag die Map auch nicht.","replies":[]}]},{"poster":"Evenrider","date":"2019-12-04T17:15:42.735+0000","up_votes":3,"down_votes":1,"body":"wenn der Klimawandel gestoppt ist und es in der Realität auch wieder schneit :D","replies":[{"poster":"Mellix","date":"2019-12-04T17:28:30.349+0000","up_votes":1,"down_votes":0,"body":"da  hast du auch  wieder  recht  :3  naja  mal  ab warten  würde  ich  sagen  nutz  denn  auch  temaspeak  oder  eher  discord  wenn  ich  fragen  darf  dann  kann  ja auch  mal zusammen  zocken  :)","replies":[]}]},{"poster":"ƒick Ðich","date":"2019-12-05T11:09:15.939+0000","up_votes":1,"down_votes":0,"body":"12.12 startet das nächste event,, falls es die schneemap bzw eine neue map diese jahr geben wird dann zu diesem patch schätze ich :D","replies":[{"poster":"Mellix","date":"2019-12-05T16:31:33.687+0000","up_votes":1,"down_votes":0,"body":"ok  gut  zu  wissen  :3","replies":[]}]},{"poster":"naniwakaze","date":"2019-12-04T19:46:05.856+0000","up_votes":1,"down_votes":0,"body":"Kommt dieses Jahr nicht (wegen der Drachenänderungen). Fürs Winterfeeling muss man wohl ARAM spielen. Und es gibt keine Winterfreuden dieses Jahr, sondern ein Night/Dawn-Event.","replies":[{"poster":"Mellix","date":"2019-12-04T22:06:39.383+0000","up_votes":1,"down_votes":0,"body":"ach  schade  :/  hab  mich  halt  so drauf  gefreut  und  dann  sowas  zuhören  :( sowas  mach  mich  traurig  :(","replies":[{"poster":"sN00Bdogg","date":"2019-12-05T00:18:00.859+0000","up_votes":1,"down_votes":1,"body":"> ach  schade  :/  hab  mich  halt  so drauf  gefreut  und  dann  sowas  zuhören  :( sowas  mach  mich  traurig  :(\n\ndito\n{{sticker:zombie-brand-clap}}","replies":[]}]}]},{"poster":"sN00Bdogg","date":"2019-12-04T17:14:10.487+0000","up_votes":1,"down_votes":1,"body":"Ist denn der \"Winterfreuden\"-Skin-Shop schon angekündigt ?\nVllt kommen beide zum selben Zeitpunkt , sprich Patch. \nNur so ne Idee ...","replies":[{"poster":"Mellix","date":"2019-12-04T17:33:07.535+0000","up_votes":1,"down_votes":0,"body":"das  wäre  auch  ne  möglichkeit  aber  mal sehen  :3 nutz  denn auch  teamspeak  oder  eher  discord  zum  reden  wenn  ich  fragen  darf  :)","replies":[]}]}]}