{"poster":"VuMpX","date":"2015-03-02T01:45:39.514+0000","title":"[Champion Vorschlag]Xeto, das Phantom des Sandsturmes","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":1,"body":"**Vorwort**\n> Hallo Community. \n> Ich habe an meinem champvorschlag einige Verbesserungen vorgenommen und vieles hinzugefügt.\n> Ich hoffe er gefällt euch jetzt mehr.\n> Die schadenswerte habe ich jetzt verbessert,er sollte jetzt niemanden mehr onehitten.\n> Eine generelle Design Änderung hab ich auch vorgenommen, da mir das alte nicht so gut gefallen hat.\n> Ich hoffe euch gefällt Xeto.\n> Bald werde ich auch sein Bild verbessern, hab aber zur Zeit keine guten stifte^^\n> \n> Wenn ihr was zu verbessern habt,gerne drunterschreiben.\n> Ich hab versucht ihn zu zeichnen , bin aber nicht der beste zeichner\n> \n> http://imgur.com/44su20u\n\n**Story **\n> Viel ist von Xeto noch nicht bekannt.\n> Erst kurz vor seinem beitritt in die Liga der Legenden ist er aufgetaucht.\n> Sein erstes auftreten war, als er von einem demacianischen Spähtrupp in den Dünen von Shurima aufgelesen wurde.\n> In mitten der shurima Wüste stand er wortlos nach einem Sandsturm auf einer der Dünen und blickte auf den Spähtrupp.\n> Als die besorgten Soldaten ihn fragten ob er Wasser wolle antwortete er nur : ,,nein aber ich würde gerne mit euch mitkommen.''\n> Eine Stunde nachdem sich der Spähtrupp wieder mit dem unbekannten auf den weg machten, wurden sie von einem Noxianischen Hinterhalt überrascht.\n> Noch bevor auch nur einem der Soldaten ein haar gekrümmt werden konnte, bietete sich ihnen ein Schauspiel, was die Soldaten auf ihrer Rückkehr nur als blutiges Massaker bezeichnen konnten.\n> Der unbekannte zerschmetterte wortlos einen Noxianer nach dem anderen mit seinem Hammer.\n> Dann kam plötzlich ein Sandsturm auf und der unbekannte verschwand genau so schnell wie er aufgetaucht war.\n> Zwei Wochen waren seit dem vergangen.\n> In einem kleinen Dorf am Rande der shurima Wüste befand sich ein wohlbekannter gewürz verkäufer namens Talic\n> Talic hatte grade eine große Bestellung erhalten.\n> Er sollte eine größere Menge an diversen Gewürzen in ein kleines wüstendorf das tief in der Shurima wüste lag, liefern.\n> Er packte sich mehrere flashen Wasser und die Gewürze auf seinen karren und sattelte Herbert, sein Kamel. \n> Daraufhin machte er sich auf den langen Weg zum benachbarten Dorf.\n> Nach dem ersten tagesmarsch passierte es dann.\n> Eine der holzstangen die den wagen aufrecht hielten zerbrach und talics karren viel zusammen mit Herbert eine hohe Düne runter.\n> Und wenn es nicht schon schlimm genug währe lag auch noch genau wo Talic hinviel ein Stein an dem er sich den Kopf anschlug.\n> Er wurde ohnmächtig.\n> Als Talic aufwachte brannte sein Kopf wie Feuer und sein mund war trockener als die wüste um ihn herum. \n> Er hockte sich hin und merkte dass sein kompletter karren kaputt war.\n> Von Herbert war weit und breit nichts zu sehen.\n> Talic stand auf und ging zu den überresten seines karren um einen Schluck Wasser zu trinken. \n> Entsetzt merkte er dass alle Flaschen kaputt waren.\n> Er war ohne Wasser und Orientierung in mitten der shurima wüste.\n> Und es war auchnoch die heißeste Jahreszeit.\n> Talic nahm sich seine gewürze die noch heile waren und lief los.\n> Und lief.\n> Und lief.\n> Es waren nun schon zwei Tage und Talic hatte schon alle Hoffung aufgegeben. \n> Er fiel und alles wurde schwarz.\n> Doch bevor er ganz weg war, sah er am Horizont eine Sandsturm auftauchen und in dem Sandsturm eine Silhouette.\n> Taric blinzelte.\n> Etwas trug ihn.\n> Als er die Augen öffnete lag er in den armen von einem großen maskierten mann.\n> Der man setzte ihn ab und gab ihm einen großen Beutel in die Hand und zeigte auf etwas.\n> Das Dorf was er beliefern sollte!\n> Talic drehte sich erfreut um und wollte dem fremden danken.\n> Aber als er sich umdrehte bekam er Sand in die Augen.\n> Wieder ein Sandsturm. \n> Er legte sich wieder schnell und der Mann war weg.\n> Als Talic in den Beutel schaute könnte er seinen Augen nicht trauen.\n> Der Beutel war voll mit seinen gewürzen, Gold und Edelsteinen. \n> Ausserdem war dort noch ein zettel.\n> ,,für den karren und die kopfwunde.Ausserdem wartet Zuhause der liebe Herbert auf dich.\"\n> Talic war froh umd riefdanke in Richtung der Wüste\n> Seit dem tauchte der unbekannte immer wieder in der Shurima wüste auf.\n> immer eine stunde bevor er jemanden holf.\n> Das sprach sich natürlich rum und so kamen immer mehr Leute in das Dorf von Talic um dem unbekannten kennen zu lernen.\n> Ein von der Liga der Legenden beauftragter Beschwörer besuchte Talic eines Tages.\n> Dieser schilderte ihm wo der unbekannte das letzte mal gesichtet wurde und gab ihm Wasser.\n> Auf dem weg dort hin wurde der beschwörer von einem Mann angesprochen.\n> Plötzlich holte dieser ein messer hervor und ging auf den beschwörer los.\n> Da der beschwörer zaubern konnte war der Angreifer ein leichtes Spiel.\n> Doch dann Schritt plötzlich ein Dutzend maskierter Personen aus dem Schatten.\n> Der beschwörer rannte los aber seine Verfolger waren schneller.\n> Sie hatten ihn in die enge gedrängt. \n> Einer der maskierten schrit nach vorne.\n> Doch plötzlich konnte man seine Hand vor Augen nicht mehr sehen.\n> Ein Sandsturm war aufgekommen.\n> Wenige Sekunden danach legte sich dieser schon wieder.\n> Vor dem beschwörer stand der unbekannte.\n> Eine der maskierten Personen sagte Jetzt da ist er und alle griffen auf ein mal an.\n> Der unbekannte streckte jeden der Angreifer sofort wortlos nieder.\n> Der letzte allerdings war um einiges stärker.\n> Der Kampf dauerte mehrere Minuten, als der unbekannte durch einen Hieb dem Angreifer das Tuch von Kopf stieß. \n> Hervor kamen nur lange rote haare, aber bevor man das Gesicht der Angreiferin sehen konnte entwich sie in die Schatten.\n> Der beschwörer dankte dem unbekannten und erzählte ihm von der liga der Legenden\n> als er den ubekannten nach seinem Namen fragte ,zeigte dieser ihm nur seinen Hammer.\n> Auf diesem stand nur Xeto.\n\n\n\n\n**Skills **\n> \n> \n> \n> **Passive Fähigkeit:Knochenbrecher**\n> \n> Xeto verwendet kein Mana sondern Zorn Sand. \n>  Er hat maximal 100 Zornsand\n> \n> Sobalt Xeto einem Gegnerischen Champ Schaden zufügt bricht diesem ein Knochen.\n> Dadurch wird dieser verlangsamt (25%)und erhält schaden über zeit (120 über 2 Sekunden) .\n> Dieser Effekt hält 2 Sekunden an und kann pro Gegner nur ein mal alle 10 Sekunden wirken.\n> Das brechen von Knochen füllt Xetos Zorn Sand jeweils um 50.\n> normale Angriffe geben 5 und kritische Treffer 20 Zornsand\n> Ausserdem erhält er 10 Zornsand pro 100 durch Champions erlittenen schaden\n> \n> \n> \n> \n> **Q:Heisse Sandwoge     Kosten 20 Zornsand .        Cooldown :10 Sekunden**\n> \n> **Aktiv:**Xeto löst sich in eine Sandwolke auf und bewegt sich in die Zielrichtung (siehe shen taunt)\n> durchquerte Gegner werden mitgerissen und erhalten 100/135/170/205/240 ( +0.5 Ad)schaden.\n> Während der Bewegung ist Xeto unantastbar bzw untargetable. \n> Außerdem erhält Xeto pro getroffenen Gegner 5 Zornsand.\n> **Passive:** Gegner die Xeto attackieren erleiden 60/70/80/90/100 schaden pro Angriff. \n> \n> \n> \n> \n> **W: Schützende Dünen.     Kosten:gesamter zornsand       Cooldown :15sekunden**\n> \n> **Aktiv:** Xeto benutzt sein ganzen zornsand um  ein Sand Schild in der höhe des benutzten zornsand zu erhalten.\n> Der Schild kann auch auf eigene champs gewirkt werden.\n> Dieser erhält dann auch leicht erhöhte heilung\n> **Passiv: **Xeto erhält pro 5 zornsand einen Rüstungs Punkt.\n> Während diese skill auf cooldown ist,wird dieser Effekt deaktiviert.\n> \n> \n> \n> \n> **E:Zerschmettern.      Kosten :20 Zornsand .         Cooldown: 7/6/5/4/3 Sekunden **\n> \n> Xeto schlägt kräftig auf den Boden im ausgewählten Bereich und verursacht dort 100/120/140/160/180 (+0.85 AD) Schaden.\n> Wenn die skill während heiße Sandwoge genutzt wird, aktiviert sich die skill am Aufprall Ort und ihr Radius wird verdoppelt. \n> Champions mit gebrochenen Knochen erhalten dann 120/140/160/180/200 wahren schaden/truedamage.\n> \n> \n> \n> \n> **R: vernichtender Sandsturm .         Kosten keine.         Cooldown :140/100/60**\n> \n> Xeto beschwört um sich herrum für 10 Sekunden einen Sandsturm der Gegnern im Sturm die Sicht behindert. \n>  HP Balken der Gegner im Sturm werden nicht mehr für Gegner ausserhalb des Sturmes angezeigt und Gegner ausserhalb des Sandsturmes können auch nicht sehen was dort drinne passiert. \n> Nach der Aktivierung dieser skill wird Xeto sich auf den ersten angeklickten champion werfen (cia doppelte rengar Sprung Reichweite) und diesen für 3 Sekunden permanent angreifen. \n> Während dieser Zeit ist Xeto gesilenced, getauntet und unsteuerbar.\n> Wärend Xeto sich auf einen champion fokussiert erhält er Immunität gegen jede Art von Crowdcontroll wie zu zum Beispiel stunns, hooks,oder Bindungen, kann allerdings verlangsamt werden.\n> Verlangsamungen werden allerdings um 40/60/80% geschwächt.\n>  Xeto erhält 15/25/35%erhöhtes angriffstempo und verursacht am ausgewählten ziel 10/15/20% mehr schaden.\n> Sollte Xeto sein Ziel innerhalb der 3 Sekunden töten erhält er das gesamte leben zurück, was er während der fokussierten zeit verloren hat. \n> Sollte er es nicht töten verschwindet der Sandsturm und Xeto verliert seinen gesamten zornsand . \n\n\n**Animationen**\n> \n> Rückruf: Xetos Hammer löst sich in Sand auf und fängt an unter ihm herrum zu wirbeln.\n> Danach zersetzt sich auch Xeto in Sand und fliegt Richtung spawn\n> \n> Witz:Xetos rechter arm zerfällt in Sand und er zeigt darauf. Danach kommt der Arm zurück und Xeto lässt enttäuscht den Kopf hängen.\n> \n> Taunt: Xeto lehnt seinen Kopf nach links und rechts wobei er jeweils einmal auf jede Seite mit einer Hand draufklopft.\n> Aus seinen Ohren kommt dabei Sand.\n> \n> Tanz:Xetos Hammer löst sich in Sand auf und formt einen Lautsprecher und Xeto tanzt popping.\n> \n> Lachen:Xeto lässt seinen Hammer fallen und hält sich den Bauch vor lachen.\n> Dann zerfällt sein Kopf zu Sand und er hört auf zu lachen.\n\n**Sprüche**\n> \n> Bewegung:\n> Wenn du willst.\n> Dank,aber einmal klicken reicht.\n> So schnell wie ein Sandsturm.\n> \n> Witz:\n> Nachdem Xetos arm abgefallen ist sagt er :,, besser arm ab als arm drann.\"\n> Dann sagt er :,,na?na? Ach komm schon der war gut.\"\n> \n> Taunt:\n> Du redest echt zu viel, da kriegt man ja Staub in den Ohren.\n> Erstmal durchlüften.\n> \n> Spezial taunt gegen azir:,, herscher des Sandes? Pah,ich mach was ich will\"\n> \n\nIch hoffe euch gefällt meine Idee.\n\nMfg vumpx","replies":[{"poster":"DimensionDragon","date":"2015-03-03T20:18:22.403+0000","up_votes":2,"down_votes":0,"body":"**Zur Geschichte:** \n>Finde den Konzept eines starken Helfers und Beschützers der anscheinend auch noch gut draufhauen kann Klasse, kommt aber stark an einer Version von Braum gemixed mit dem allgemeinen Shurima-Konzept.\n> Erzählerisch muss da noch etwas rein und verändert werden, Es ließt sich fast schon wie in Stichpunkte.\n> \n> Am Ende verweist du auf eine verdeckte Frau \"mit roten haaren\". Noxianer verstecken sich nicht vor anderen um ihre Identität zu schützen. Ganz im Gegenteil: Sie wollen Bekannt und gefeiert werden. Die Rache am Ende der Geschichte würde ich in irgendeiner Weise verdeutlichen, dass es sich hier auch um einen Racheakt handelt, da  ja Xeto den Hinterhalt zu nichte gemacht hat.\n>\n Für gewöhnlich bauen sich Geschichten immer auf. Warum haste den Part mit Talic hinter den ersten Noxischen Hinterhalt gestellt?\n Was ist seine eigentliche Verbindung zu Shurima? Er handelt nämlich stark im Sinne von Demacia, aber neben seinen Sandangriffen und Fähigkeiten würde ich persönlich gerne Wissen was er überhaupt in der Wüste macht?\n\n\n\n\n** Fähigkeiten:** \n>Q, wenn er sich in seine Sandwolke auflöst, ist es dann möglich in zu verletzen? Wenn nicht könnte das Design der Attack die Gegner verwirren. \n> \n> Die Kombinationen deiner Fähigkeiten finde wirklich genial :)\n> Q mit der E ist so schon schick und belohnt den Spieler auch, wenn er etwas schwierigeres meistert. Klasse.\n> Vor allem wenn man noch die Ult hinten reinklebt.\n> \n> Die Idee mit der getrennten Sicht innerhalb und außerhalb des Sandsturm lässt tolle Hinterhalte zu und kann auch dazu benutzt werden die Champions zu beschützen wie vor einer Caitlyn ult. Nebenbei passt es auch mit deiner verfassten Lore. Mit dem Zahlen habe ich mich jetzt nicht wirklich auseinandergesetzt aber ein Sturm der 10 Sekunden verbleibt ist in LoL schon relativ lang für eine einmalige Fähigkeit. \n> \n> Alles in einem ein doch überraschend gut durchdachter Champ. \n> \n> Nur noch eine Kleinigkeit: Dein Format deines Championvorschlags. Diese Foren erlauben es die Buchstaben in Boxen einzuboxen, sie in Fettschrift fett zu machen, und mit Trennstriche Themen zu trennen. Probiers doch mal aus :)","replies":[{"poster":"VuMpX","date":"2015-03-03T20:42:06.530+0000","up_votes":1,"down_votes":0,"body":"Vielen dank für dieses unglaublich gute Feedback.\necht nett von dir, das du dir so viel zeit rausgenommen hast.\nAlso zunächst mal zur Verbindung mit shurima.\nDie eigentliche idee hinter ihm war das er sozusagen das Gegenteil von rek'sai ist,da sie ja eine große Gefahr darstellt wenn man durch die wüste läuf. \nDeswegen habe ich ihn auch mehrere FrFraktion retten lassen.\nIch wollte jetzt nicht andeuten dass er für demacia ist, nur das er einem hilft wenn man Stress hat.\nDas mit katarina sollte nur son kleiner easteregg sei. \n\nSo jetzt warum er in der wüste ist.\nEigentlich wollte ich die Story so schreiben, dass Xeto durch die wüste wanderte und von rek'sai getötet wurde und kurz vorm Tod ein altes shurima ArArtefakt das im Sand liegt berührt.\nDieses ließ ihn dann als eine Art Sand Geist zurück kehren, deswegen sieht man ja auch keine haut auf dem Bild.\nSein körper besteht nämlich nur aus Sand.\nIch bin nicht so gut im schreiben von Geschichten, aber ich werde auf jeden Fall noch Verbesserungen durchführen \n\nFinde ich gut das du verstanden hast, dass die truedmg nur sehr schwer ist zu kriegen^^\nUnd wegen der q war ich mir nicht sicher über die unantastbarkeit.\nMan stunnt den Gegner ja währen man den bewegt also schien mir das nicht als nötig.\nIch denke ich werde meinen Post noch ein wenig auffrischen.\nAuf jeden Fall nochmal vielen Dank für deine ausführliche Antwort","replies":[{"poster":"KEEYAY","date":"2015-03-06T13:20:04.210+0000","up_votes":1,"down_votes":0,"body":"Außerdem,ich finde die Story in der Wüste wo er gegen Rek'Sai kämpft besser als die oben.Aber ich würde in der Geschichte nicht Rek'Sais Namen verwenden...\nLG\n{{champion:150}}","replies":[]},{"poster":"DimensionDragon","date":"2015-03-04T15:01:02.661+0000","up_votes":1,"down_votes":0,"body":"Freut mich wenn ich helfen konnte :)\nDie Idee mit Rek'Sai finde ich Klasse :D","replies":[{"poster":"VuMpX","date":"2015-03-04T15:07:13.108+0000","up_votes":1,"down_votes":0,"body":"Gut zu wisse. \nWie macht man denn tetextabschnitte in boxen?","replies":[{"poster":"DimensionDragon","date":"2015-03-04T15:10:48.312+0000","up_votes":1,"down_votes":0,"body":"entweder du schreibst > vor dem Textabschnitt oder markierst den Text und drückst dann unten in den LoL-Symbolen unten auf das \" \n\n> Willkommen\n","replies":[{"poster":"VuMpX","date":"2015-03-04T15:15:13.797+0000","up_votes":1,"down_votes":0,"body":"Oh cool danke für die schnelle Antwort","replies":[]}]}]}]}]},{"poster":"VuMpX","date":"2015-03-03T22:33:42.568+0000","up_votes":1,"down_votes":0,"body":"Ich hab jetzt den Post n bisschen geordnet und Animationen und Sprüche zugepackt.\nIch bin grade dabei die Story umzuschreiben und werde sie wahrscheinlich morgen updaten","replies":[]}]},{"poster":"ShadowChild000","date":"2015-05-05T22:04:39.879+0000","up_votes":1,"down_votes":0,"body":"Ich finde die W um welten zu schwach, seine komplette energie für nen hunderterschild wegzuwerfen macht einfach keinen sinn (außer der maximale zornsandvorrat skaliert mit items/level, aber das hast du ja nicht geschrieben)","replies":[]},{"poster":"Hibernius Riesig","date":"2015-03-09T12:12:30.374+0000","up_votes":1,"down_votes":0,"body":"Mir schein das Gesamtpaket zu stark. Allerdings klingt die Ult. mit dem Sandsturm part sehr interessant... eine Fläche in der man von außen nicht sieht was passiert :D oh ja das hat was....","replies":[{"poster":"VuMpX","date":"2015-03-10T00:30:51.060+0000","up_votes":1,"down_votes":0,"body":"Das war ja auch der Grund Gedanke ^^\nEigentlich wollte ich das so.machen, dass auf der ganzen map n Sandsturm aufkommt der n bisschen dmg over time macht und einem alle paar Sekunden die Sicht raubt\nAber dann is mir aufgefallen, dass die andere Variante mehr strategische Möglichkeiten gibt","replies":[]}]},{"poster":"Spacefalcon","date":"2015-03-06T17:53:12.614+0000","up_votes":1,"down_votes":0,"body":"Zu nächst einmal: eine schöne Idee für einen Champion, und die Ulti klingt nach einen spannenden strategischen Element.\n Etwas feiner:\n Bei der Passiven steht:\"Sobalt Xeto einem Gegnerischen Champ Schaden zufügt bricht diesem ein Knochen.\" ist wirklich jeder Schaden gemeint? Vermutlich nur AA`s und die E wäre sonst mit {{item:3068}} eine sehr brutale Kombination (ja ist Pfenningfuchserei, und ein kleiner Edit schafft das schnell aus der Welt)\n\nMir gefällt die Mechanik des Berserkerrausches in der Ulti nicht wirklich, sie passt m.M.n. nicht zum Charakter von Xeto als Helfer. Etwas mehr Utility für sein Team fände ich passender, der Sand könnte einen Teil des verursachten Schadens absorbieren und im Gegenzug sich durch an Gegnern verursachten Schaden heilen o.Ä. diese Lösung gefällt mir auch noch nicht so richtig, aber Xeto sollte im Sandsturm den Deus Ex Machina verkörpern, den er in der Lore ja darstellt.","replies":[{"poster":"VuMpX","date":"2015-03-07T00:14:02.474+0000","up_votes":1,"down_votes":0,"body":"Vielen dank für das Feedback. \nIch hatte sowieso vor die berzerker rage wegzulassen, die hatte ich nur drinne weil das eigentlich son brutaler bruiser werden sollte und ich erst nacher auf die Idee mit dem beschützen gekommen bin.\nMot der passive war gemeint, dass normale Attacken bzw seine spells den effect verteilen.\nDanke fürs Feedback","replies":[]}]},{"poster":"KEEYAY","date":"2015-03-06T13:12:29.327+0000","up_votes":1,"down_votes":0,"body":"Gute Überarbeitung!:)","replies":[{"poster":"VuMpX","date":"2015-03-07T00:11:42.590+0000","up_votes":1,"down_votes":0,"body":"Dankeschön.\nIch will noch die Story ändern, aber ich habe gerade erst wieder einen pc gekriegt, der andere war kapput deswegen konnte ich da novh nicht wirklich was ändern.\nIch werde die Lore aber auf jeden Fall noch umändern, sodass es sich alles n bisschen logischer anhört.\nDanke fürs Feedback und ich würde mich über ein upvote freuen, damit das auch andere sehen","replies":[]}]},{"poster":"KEEYAY","date":"2015-03-02T15:19:18.892+0000","up_votes":1,"down_votes":0,"body":"Die Ulti hat keine Kosten und nur so wenig Cooldown?Außer dem wenn er nach der Ulti unkontrollierbar ist,rennt er ja oft in die Tower rein.\nAber sonst **Gute Idee**\nLiebe Grüße\n*KEEYAY*{{champion:150}}","replies":[{"poster":"VuMpX","date":"2015-03-03T05:52:39.896+0000","up_votes":1,"down_votes":0,"body":"Ich fand das garnich so schlimm,denn zum beispiel Katharinas ult hat ja auch kaum cooldown und keine Kosten.\nUnd das mit dem unkontrollierbar is absichtlich, damit man die nich einfach so spammen kann sondern strategisch einsetzten kann.\nAber danke das du dir die Zeit genommen hast dir den Vorschlag durchzulesen. \nMfg vumpx","replies":[]}]},{"poster":"Blutiger Paladin","date":"2015-03-02T15:03:52.334+0000","up_votes":1,"down_votes":0,"body":"Gutes Konzept aber der cooldown von dem e ist auf höchster stufe etwas gering was den truedmg bzw. den dps etwas op, sonst eig ganz gebalanced^^","replies":[{"poster":"VuMpX","date":"2015-03-03T05:49:57.594+0000","up_votes":1,"down_votes":0,"body":"Die macht nur truedmg bei zielen die du vorher mit einer autoattack zerbrochen hast und auch nur wenn du die skill benutzt während du dich mit der q bewegst^^\nAber danke für die Kritik","replies":[]}]}]}