{"poster":"Subaruç","date":"2017-04-10T01:45:56.154+0000","title":"Esto va a durar toda pero toda la vida?","subforum":"Comportamiento del jugador","up_votes":6,"down_votes":4,"body":"El motivo del mensaje es el siguiente, hay gente que se rompe el cu** jugando ranked, esta horas y no hablo de 3 horas hablo de 8 horas o mas, le toca gente que no tiene ganas de jugar, o gente dormida o gente que no sabe en que rol esta parado..\nsi uno lo flamea o lo insulta te banean permanentemente.. pero hay cosas peores que pasan como insultos hacia gente de distinto pais,  machismo, robos de cuenta, y demas.. entonces..? a los que quieren jugar bien y ya llevan una racha hermosa por gente que trolea y demas no se banean.. sino que claro al que insulta a la gente que no tiene ganas de jugar la banean.. entonces..\n\nyo creo que mas de uno aprendio, invirtio dinero y tiempo, jugo, tiene sus amigos en el lol..\nme parece que deber&iacute;an abrir un periodo de amistia para la gente desbloquear cuentas y el que se porta mal listo adi&oacute;s..\n\nconsidero que tambien hay gente que le gusta y gente que no, pero si le pasa a futuro se pondria de acuerdo..\nya que para sacar ofertas y skines son rapidos creo que en una propuesta para el bien del servidor y el beneficio de los usuarios deber&iacute;an hacer algo..\n\nQuiero leer las opiniones de todos, pero poniendose en el lado del otro no porque me toca un flamer baneado y si es un troll no lo bannen.\n\nespero que la gente opine y den su punto de vista","replies":[{"poster":"Tobirama","date":"2017-04-10T02:08:00.456+0000","up_votes":3,"down_votes":1,"body":"Rara vez la gente enmienda sus errores, es más, vuelven con el mismo comportamiento en otra cuenta, invirtiendo el mismo tiempo, dinero y perjudicando a las mismas personas. Lo siento, pero no quiero volver a tener a esa gente en la comunidad de LoL, se que estadísticamente no pasan del 10% de gente que se comporta así pero en una partida de 10 personas si que se hacen notar.","replies":[]},{"poster":"Delle","date":"2017-04-10T15:16:07.076+0000","up_votes":1,"down_votes":0,"body":"Asi de imbecil es LAS, a mi por ejemplo, me acaban de trollear el adc en una partida ranked, y si, va a durar para siempre, porque riot no hace nada, es más, le encanta proteger a los trolls y jugadores eloboosteados","replies":[]},{"poster":"9081913DEL1","date":"2017-04-10T11:08:14.960+0000","up_votes":1,"down_votes":0,"body":"Perdon, que tiene que ver las horas que vos jugas con tu matchmaking?\nQue tiene que ver el matchmaking con alguien que a las 3 am quiere dormir y sigue jugando porque esta a una de la promo...\nLas malas decisiones se toman todo el tiempo, y no solo IN GAME.\n\nTu tomate las partidas seriamente y vas a subir, si esperas que los demás se las tomen seriamente pues ... pongamoslo asi, si queres cambiar el calor del sol no vas a llegar lejos, pero si te pones protector vos..... pasa por ahi.\n\nPor lo demás, lo que dijo buda.: _si tu enemigo te enoja, te domina_.\n\nAl final reporta a quien lo merezca.\n\nSaludos!","replies":[]},{"poster":"Mazer Rakham","date":"2017-04-10T02:42:44.733+0000","up_votes":1,"down_votes":0,"body":"Oportunidades tienen: Ban chat, ban de 14 días, etc... Si no reaccionan y llegan al permaban es porque muchas ganas de enmendarse no tenían. Las reglas las conocemos todos. Ellos eligen no seguirlas, que se aguanten las consecuencias.\n\nLos trolls son sancionados, tarda más, pero son sancionados. Y tiene su explicación: Es difícil para el sistema diferenciar a un troll de una persona que tuvo una mala partida o mala racha. El tóxico lo hace todo el tiempo o una gran parte. Aparte que mas gente reporta a los flammers que a los trolls, gracias a esa bendita lógica que tienen de:\n\n\"Es un troll pero me hizo ganar la partida. Vamos a darle honores\"\n\nAh! pero cuando les toca de su lado son los primeros en pedir report por /all.\n\nResumiendo:\n\n* No quieres que te sancionen? No rompas las reglas. Y no, no vale el \"pero Fulanito empezó primero\" Ya te sancionaron una o dos veces? Aprende de tus errores y no lo hagas mas.\n* No quieres ver trolls? Reporta siempre que veas uno, así esté del lado enemigo. Sin que te importe si ganaste la partida o no. Y que tus amigos hagan lo mismo. Por qué? Porque si no lo haces, tarde o temprano te tocará a vos sufrirlo.","replies":[]},{"poster":"FedecarboneroUY","date":"2017-04-10T02:37:25.572+0000","up_votes":1,"down_votes":0,"body":"Es que vos no entendes nada, el troll no te hace llorar en un rincón intentando cortarte las venas porque insultaron a tu madre y no lo podes mutear, sólo te hace perder 20 minutos de vida, ojo que 20 minutos no son nada, en 20 minutos no se puede crear una skin...","replies":[]}]}