{"poster":"Ayuwøki","date":"2019-07-26T00:37:12.778+0000","title":"Este es un registro personal de lo que me pasa con el sistema corrupto de Riot (ups).","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":5,"body":"Quién sabe cuando borrarán este post.\r\nQuiero aclarar que esta situación que tengo es con otra cuenta, no esta. (Ignorar el nombre y tomarlo en serio)\r\n\r\nEsto no es para compartirlo con el público, porque soy consciente que la mayoría de la gente que está acá va a actuar negativamente contra mi porque se creen superados y conocedores del juego; solo publico esto para dejar un registro propio.\r\nNo puedo poner la captura así que lo inserto en forma de link, pero hay (o había) una charla mía con la persona que me atendió con la queja sobre una cuenta suspendida. Esa pagina, esa información, esa charla, quedó borrada. Si yo actualmente me meto en esa conversación hay un cartel enorme que dice: ''404 https://photos.google.com/photo/AF1QipPgTjkVJ0uogTSjwx2P3nZUX9lUeRm66g7gjaCv \r\nLa página que estaba buscando no existe''. La pagina ha sido borrada por ellos, demostrando lo que le importamos, por su puesto.\r\n\r\n-Bienvenidos a League of Legends! Un excelente juego a nivel mundial, con una comunidad encantadoramente toxica y enferma. Jugando con nosotros vas a pasar horas y horas, y no debido a que el juego es muy bueno, sino a que es psicológicamente adictivo :D. Puedes obtener varias cosas ,pero las mejores son las que puedes obtener con dinero, mucho dinero esfuerzo y dedicación (Horas, Días, Años).\r\nLamentablemente si hay algo que no nos gusta de tu comportamiento ( o mejor dicho, que no le guste al Bot que revisa los reportes) nos veremos obligados a aplicar sanciones, eso significa: Adiós a tu progreso, tiempo, dinero y demas!!.\r\nEste juego es maravilloso y abierto para todo público, disfrutenlo-\r\n\r\nA continuación, el mensaje que les envié:\r\n\r\n''Tuve una suspencion de 14 dias hace unas semanas, lastimosamente no pude jugar porque estaba en clases y luego cuando entre en vacaciones no tuve internet por una semana.\r\nEs increible que apenas pueda jugar me suspendan la cuenta, me parece super idiota que por unas 3 partidas de mierda super estupdas me suspendan, perdon por los insultos pero es que esto me revienta.\r\nantes habia una suspension de 24 dias y la sacaron, es una mierda y me lo tengo que fumar, pero que ahora te suspendan por una pelotudez???\r\nEstoy super podrido de este sistema de mierda. No espero que me desbaneen la cuenta porque se que uds no lo van a hacer, solo les sirve ganar plata, si la persona gasta dolares en este juego, psicologicamente enfermo, y luego pierde su cuenta, a usd les chupa un huevo, total la plata la ganaron. No se dan cuenta que lastiman a la gente con su sistema corrupto de ''suspendo al que tenga algun que otro report con un sistema automatizado'', nada de leer e involucrarse con SUS CLIENTES.\r\n\r\nEste mensaje va a pasar por un robot y luego por algun ignorante de riot, despues seguro queda en el olvido, pero que sepan que esto no termina acá para mi. Obviamente no voy a hacer un escandalo ni voy a actuar con cosas 'legales' ya que me parece muy ridiculo, lo que si, esto va a quedar en mi cabeza por el resto de mi vida, que este juego de mierda me cagó, me está cagando y me va a cagar; tanto a mi como al resto.''\r\n\r\nhttps://support.riotgames.com/hc/es-419/requests/41600828 (este es el link de la conversación aun abierta al 24/7, quien sabe cuando vayan a borrarla como la anterior)\r\n\r\nEsto tiene un final obvio, pero bueno. Como resalté en el titulo y en el principio del texto, esto es para mi, yo quiero tener un registro de como va esto, para no olvidarme nunca lo corrupto que es este sistema.\r\nPerdón si provoqué que respondan.\r\n\r\n\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Teemo Best JoJo","date":"2019-07-27T02:27:40.580+0000","up_votes":2,"down_votes":0,"body":"ahora dilo sin llorar","replies":[]},{"poster":"Ghoperef","date":"2019-07-26T01:26:55.772+0000","up_votes":2,"down_votes":0,"body":"bueno ya no existen las paginas que pusiste, de igual forma como recomendacion deja el juego si te hace sentir tan mal, realmente si ves el foro de aca  e incluso del mundo, hay un fenomeno en donde hay una toxicidad enorme en los servidores, unos empiesan y otros responden. Al final uno tambien es parte del problema cuando responde a la gente, pero vamos, somos humanos.\n\nA quien no le ha pasado que explota de los flammeos?. Ayer jugaba y como siempre me reputeaban por ser el jg. Claro que la mayoria de veces entras bien a jugar y de la nada te cae una lluvia de puteadas y te la bancas, pero hay veces luego de una racha de puteadas que simplemente respondes y respondes peor aun.\n\nEl sistema de sanciones es pesimo. \nprimero banean los toxicos y luegos a los afk y trolls y ellobusters.\n\nCuando en la mayoria de los casos la toxicidad deriva de afks trolls y elo y tanta mala conducta.\n\nLa toxicidad la mayoria de veces es solo una respuesta.\n\nNo hay foro en el mundo en que un rioter se de la molestia de responder ni aunque sea un '' lo estamos viendo'-\n\nRealmente, creo que le pasara factura a riot el dejar tirada a sus jugadores.","replies":[]},{"poster":"NeoGibiky","date":"2019-07-28T05:30:40.875+0000","up_votes":1,"down_votes":0,"body":"\"idiota que por unas 3 partidas de mierda super estupdas me suspendan\" llama al sistema corrupto pero el es toxico y insulta a la unica persona (o bot) que podia darle una solucion xD","replies":[]}]}