{"poster":"WiegrafOfValor","date":"2014-12-17T06:48:24.010+0000","title":"A Sincere question for the Reds","subforum":"Gameplay","up_votes":25,"down_votes":3,"body":"All these Ideas, opinions, suggestions about gameplay overall do they matter, at all? \r\n\r\nI am really curious about how Rito handle this informations, I mean do you want us to shut up and be grateful for what we have or do you really want us to express our opinions and see changes based on this very opinions.\r\n\r\nI do understand that RIOT Team of developers and managers have their agenda and probably understand more of their game, than we do. But I can't help to think there's value on community suggestions. Can I get a Red to explain how this matter is handle on the HQ? I really want to know.\r\n\r\n\r\n\r\nThank you for your time, I will try to ignore Toxic behavior and will only acknowledge Red's reply or serious replies. \r\n\r\n\r\n\r\nPS: We need more flat MS items without AS, and with other bruiser stats. Try new Phage upgrade branches.","replies":[{"poster":"FeralPony","date":"2014-12-18T09:05:49.791+0000","up_votes":19,"down_votes":0,"body":"So I'm going to speaking mostly from personal experience on how I use the forums and other forms of community feedback, as different rioters use community feedback differently. If I had to broadly categorize I would say I use community feedback in 5 ways.\n\n*Feeling out General Sentiment* - This is pretty broad but this is when I search for general trends, issues, and feedback. This is generally for broad answering questions like\n\"What are people most interested or vocal about?\"\n\"Aside from the concrete data - do people feel that this character is OP or UP?\"\n\"What elements of a larger patch or feature are people most drawn to or that is most contentious\"\n\n*Easy Wins* - These are specific changes that are really easy to do, something I could tackle over lunch without sacrificing my current projects. Often these are champion QoL fixes or bug/feel investigations.\nExamples include\nSwitching a skill to a new targeting indicator\nInvestigating reports of a characters AA feeling weird\nUpdates to a champions recommended items\nMinor particle updates I can fix with my bad art skills (ex- displaying all 3 cards during Twisted Fates Pick a Card for colorblind people)\n\n*Discovering Important or unImportant elements *- When I was working on the Udyr and Trundle updates a long time ago reading community feedback on those champions in general was super useful in evaluating what elements of the character people seemed most attached with on each character and what they simply didn't care about. I found out pretty quickly, and not super surprisingly, that people didn't really care about the flat bonus AP on phoenix stance and it was viewed as practically worthless. Stripping this bonus damage out allowed me to put the phoenix fire breath cone on the very first punch upon switching stances for nearly identical total damage but made him more satisfying and allowed him more interesting positional play and let him rotate stances faster.\n\n*Discussion Topics on Contentious Issues *- Seeing people propose specific solutions for issues and the response to those solutions is really valuable. A specific example here would be the Critical Strike or Grievous Wounds discussions that pop up from time to time. Even if the issues discussed aren't ones we are working on right this minute the discussions are still valuable to have so we can make progress faster on them when we start working on changes.\n\n*Specific Solutions *- When I'm stuck on something as a dev it can be helpful to get specific suggestions. When I worked on the mastery tree updates for the previous seasons (we didn't do one this time around). Stuff like focusing on laning power for early 9pt masteries, fusing options that didn't need to be separate (such as phys and mag pen or the improved Summoner Spell options), pickpocket variant for melee champs etc, came from community feedback delivered once each version went out and was incorporated into the next iteration.\n\nAnyways that's a really long way of saying, yes I find a lot of value in people posting stuff for a variety of reasons, but it varies greatly based on the projects I'm working on, and how much those issues are discussed. \n\nI hope this was helpful Wiegraf (I'm assuming your name is a FFT reference btw?).\n\n-Feral {{champion:120}}","replies":[{"poster":"ChimeiTekinaNasu","date":"2014-12-18T17:05:24.270+0000","up_votes":1,"down_votes":0,"body":"> *Specific Solutions *- When I'm stuck on something as a dev it can be helpful to get specific suggestions. When I worked on the mastery tree updates for the previous seasons (we didn't do one this time around). Stuff like focusing on laning power for early 9pt masteries, fusing options that didn't need to be separate (such as phys and mag pen or the improved Summoner Spell options), pickpocket variant for melee champs etc, came from community feedback delivered once each version went out and was incorporated into the next iteration.\n> \n> I hope this was helpful Wiegraf (I'm assuming your name is a FFT reference btw?).\n> \n> -Feral {{champion:120}}\n\nSo I have a question for you. Out of curiosity, what was the reason for not changing masteries for Season 5?? Too busy with other changes, or just that the masteries are still good for another season or two, or what??","replies":[{"poster":"FeralPony","date":"2014-12-18T17:22:58.811+0000","up_votes":9,"down_votes":0,"body":"Few reasons, on the value side updating the trees has increasingly less value each time we do it. Not saying there isn't value but it gets more and more into small scale numbers tuning (or in mastery cases REALLY small numbers tuning) and less about solving largescale problem. This isn't terrible surprising as when we approached them initially in Season 2 it was a pretty substantial overhaul, the S3 and S4 updates while certainly improvements were more on the lighter tuning side of things. \n\nIn addition, the cost of doing this adjustment is really high. We need to wipe all players mastery pages each time we do an update beyond a very simple balancing change which based on a lot of player feedback is something people don't want to go through unless there are really substantial gains. \n\nWith so much focus on the jungle this preseason having a characters baseline statistics stable was really beneficial for getting the strength and tuning of the jungle where we wanted it to be. Runes and masteries have such a huge impact on that system keeping as many variables steady as we could is highly beneficial. \n\nWith those factors in mind and the ever increasing long list of other stuff we wanted to get done it didn't make sense to spend a lot of time this preseason focusing on the mastery system.\n\nTL:DR - High cost, low gains, messes with jangle jangle, other stuff we want to do. ","replies":[{"poster":"5G8Nri0B54","date":"2014-12-18T20:18:47.546+0000","up_votes":4,"down_votes":1,"body":"> TL:DR - High cost, low gains, messes with jangle jangle, other stuff we want to do. \n\n\nHave you ever considered making Masteries a little more EXCITING than *\"get 36 health\"*?\n\n\nFor instance, more cool stuff like Spellblade which gives you an on-hit effect. More of that mastery that lets supports gain passive gold when ally CS's.\n\nLess* \"gain arbritrary number of free stats\"*\n\n\nMaybe have more masteries provide stuff you can't get out of common items?","replies":[{"poster":"FeralPony","date":"2014-12-19T04:09:06.507+0000","up_votes":10,"down_votes":0,"body":"That's definitely something we'd like to do and overall a noble goal. It's why the trend over the years with masteries has been to shift more into unique effects. There is an increasing complexity cost if you go too hard on this mentality where you have 30 unique effects all interacting simultaneously and unless there is substantial power creep accompanying these effects most of these will be unnoticeable invisible. For these to ultimately be both more interesting mechanically and noticeable we'd probably have to cut down the number of masteries chosen down from 30 but that would require a larger rework that we'd have to do at a later time.","replies":[{"poster":"5G8Nri0B54","date":"2014-12-19T05:57:27.912+0000","up_votes":4,"down_votes":1,"body":"Sounds promising.\n\nAt the end of the day, I think Masteries should feel less like just another set of rune page stuck into your champion.","replies":[]},{"poster":"patmax17","date":"2014-12-19T13:35:51.417+0000","up_votes":2,"down_votes":0,"body":"This would be very interesting, kinda like a \"talen tree\" wher you unlock unique effect that you can tailor around your favourite champs ^^","replies":[]}]}]},{"poster":"Pika310","date":"2014-12-18T21:56:31.396+0000","up_votes":3,"down_votes":0,"body":"So in other words, singular underwhelming masteries, like say Runic Blessing just for example, can be improved on without doing complete wipes of every players' pages.  I recall you already did this before near the beginning of the season when Perseverance's overwhelming strength was cut in half.","replies":[{"poster":"FeralPony","date":"2014-12-19T04:09:31.620+0000","up_votes":8,"down_votes":0,"body":"Correct.","replies":[]}]},{"poster":"Ta11Man","date":"2014-12-20T23:08:00.055+0000","up_votes":1,"down_votes":0,"body":"Why have the masteries that grant health and mana regen not chaged with the other health and mana changes in preseason?","replies":[]},{"poster":"Kobold","date":"2014-12-19T04:32:30.579+0000","up_votes":1,"down_votes":0,"body":"I feel that there could be some moving around of some of the masteries in the trees and some tweaks (such as the melee forbidden Bandit mastery, God its so bad for melee) \n\nI completely understand the low gain high cost aspect of it as there is only so much one is allowed to have on the masteries without breaking the game again, due to newer champions (can't have crit chance in masteries because YASUO.) Though with NO changes happening to runes (statwise) and masteries we will see the same champions constantly and the only change that took place this preseason is the Jungle changes. It feels rather lackluster in comparison to last preseason where a lot of the core gameplay was changed and it broadened the number of champions played exponentially. Then there is th works that were supposed to be done in season 4 but were not touched on (fighter rework, improved communication with the community (force us on boards yet most reds use only reddit), etc) \n\n\nThere is also fundamental game aspects I believe should be looked into but thats another topic.","replies":[]}]}]},{"poster":"WiegrafOfValor","date":"2014-12-18T14:54:09.967+0000","up_votes":4,"down_votes":0,"body":"Thank you! \n\nI guess you made my day sir. Is good to know it matters somehow.\n\nYes it is and FFT needs a sequel btw.. ","replies":[{"poster":"FeralPony","date":"2014-12-18T17:27:58.698+0000","up_votes":8,"down_votes":0,"body":"Agreed, you should get the license and the funding to make that happen! \n\nP.S. - if you can make that happen and need design help - call me :)","replies":[]},{"poster":"Amsun Thales","date":"2014-12-18T17:41:03.317+0000","up_votes":2,"down_votes":0,"body":"It's getting something of a spiritual successor, I think:\n[Unsung Story](https://www.kickstarter.com/projects/482445197/unsung-story-tale-of-the-guardians)","replies":[{"poster":"WiegrafOfValor","date":"2014-12-18T21:46:32.865+0000","up_votes":2,"down_votes":0,"body":"Wow.. :D Thanks man.. Hope is good tho","replies":[]}]}]},{"poster":"Quepha","date":"2014-12-19T04:14:36.111+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=FeralPony,realm=NA,application-id=3ErqAdtq,discussion-id=QL6FKEGE,comment-id=0006,timestamp=2014-12-18T09:05:49.791+0000)\n> *Discovering Important or unImportant elements *- When I was working on the Udyr and Trundle updates a long time ago reading community feedback on those champions in general was super useful in evaluating what elements of the character people seemed most attached with on each character and what they simply didn't care about.\n\ni guess you only work on the gameplay side then?","replies":[{"poster":"FeralPony","date":"2014-12-19T06:40:05.366+0000","up_votes":6,"down_votes":0,"body":"Correct. I work primarily on gameplay.","replies":[{"poster":"Kobold","date":"2014-12-19T06:56:41.455+0000","up_votes":2,"down_votes":0,"body":"May I ask where or how the playerbase could get some communication going on Game design topics? \n\nI ask because there is usually no red posts so it feels as if we are just talking to ourselves?","replies":[{"poster":"FeralPony","date":"2014-12-19T07:59:32.348+0000","up_votes":6,"down_votes":0,"body":"Depends on the topic and varying level of availability of design bros but I've worked on the majority of the design groups at some point. Do you have any question in particular or a is it mostly a request for more red interaction overall from design dudes?","replies":[{"poster":"Kobold","date":"2014-12-19T08:13:18.779+0000","up_votes":3,"down_votes":1,"body":"Mainly more interactions on topics, but There are a few topics in particular that I wish would be addressed. Mainly the talks about tanks being useless, Melees being completely destroyed overall(see KALISTA passive and ranged overall dominance), the Idea of Crit being 150% from 200% (so not all adcs have to be made around the requirement of IE thus casters can come back),  and Summoner spells rework (see 97.6% flash use in the last two seasons and almost 0% use of clairvoyance, cleanse, revive.)\n\nthese are some of the ideas that I found need to atleast be looked at and talked about (here as in the boards not reddit so WE can see it on the OFFICIAL LoL website)","replies":[{"poster":"Dantilq","date":"2014-12-19T10:47:15.334+0000","up_votes":5,"down_votes":0,"body":"Many of those topics have been discussed several times before, if you go through the red tracker you will find topics about ranged dominance and ranged being useless, probably 20-30 topics about summoner spell dominance, there is a few topics about crits as well.\n\nThose are topics that tend to come up over and over, not to say they are not interesting, I'd love to have more discussions about crit personally. A note though, is to avoid starting discussion so skewed \"tanks being useless\", \"melees being completely destroyed\" a it is exaggerations.  It sets a negative tone for the whole topic, and skews discussion, it's better to start neutral and instead let the argument talk for themself setting the tone.\n\nThere have been times when opposite are true, and it's a reason things are as they are, and generally it goes back to fun.\nThey haven't figured out a FUN way to make melees work, only autos and melees are a bit too simplistic and boring. There is less skill expression for a melee as the positional requirement and spacing is not there to same extent, and this is a core issue that need to be solved. Same issues with tanks and bruisers, when those classes are dominating the game tend to be not very fun, as their core gameplay is not overly exciting alone, but BECOMES exciting when in a ranged dominating environment, since timing becomes much more crucial then, and then you are required to abuse the mistakes ranged makes.\n\nSame thing with summoner spells, variety for sake of variety is useless, and that is the reason flash is so overused. It's a versatile spell, that is fun and allows for skill expression. They have not managed to make nearly as fun other spells, with as much mastery and skill attached to them, it's the reasons a few of the spells lay in the dust. Rewards vs Cost is not high enough, current setup works, and making improvement is difficult, and unless you make a spell as good from a design perspective as flash, then it's not worth it to introduce variety.","replies":[{"poster":"Kobold","date":"2014-12-19T12:59:21.513+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Wertilq,realm=EUW,application-id=3ErqAdtq,discussion-id=QL6FKEGE,comment-id=0006000400000000000000000000,timestamp=2014-12-19T10:47:15.334+0000)\n>\n> Many of those topics have been discussed several times before, if you go through the red tracker you will find topics about ranged dominance and ranged being useless, probably 20-30 topics about summoner spell dominance, there is a few topics about crits as well.\n\nYes, most of them many months ago and them just dropping it and nothing coming from it at all this is the problem. It has shown itself in many threads of late that players no longer feel as if anything they say has any meaning. Hell look at this thread, the fact that players feel this way from a company that says they are player driven speaks volumes.\n\n> Those are topics that tend to come up over and over, not to say they are not interesting, I'd love to have more discussions about crit personally. A note though, is to avoid starting discussion so skewed \"tanks being useless\", \"melees being completely destroyed\" a it is exaggerations.  It sets a negative tone for the whole topic, and skews discussion, it's better to start neutral and instead let the argument talk for themself setting the tone.\n\nThis is true, I should have worded it differently but was in champ select and was having a rather rough losing streak.\n\n> There have been times when opposite are true, and it's a reason things are as they are, and generally it goes back to fun.\n> They haven't figured out a FUN way to make melees work, only autos and melees are a bit too simplistic and boring. There is less skill expression for a melee as the positional requirement and spacing is not there to same extent, and this is a core issue that need to be solved. Same issues with tanks and bruisers, when those classes are dominating the game tend to be not very fun, as their core gameplay is not overly exciting alone, but BECOMES exciting when in a ranged dominating environment, since timing becomes much more crucial then, and then you are required to abuse the mistakes ranged makes.\n\nSo its fun for the player to just be pecked at by someone from range that never has to come near you and just can walk around you and you can do nothing? That's kinda what you just said. Heres the thing is it fun to play against a Kalista, the answer is almost always no as even as a ranged champion she can just get away or chase you down easily and you can do nothing about it. It takes more skill for the melee player to outplay the ranged player than it does the ranged to \"outplay\" the melee champion. I will agree that when tanks are too strong and can't be killed it does seem boring but when tanks are 4 or 5 shot by the ADC it is not fun to watch, Tanking is hard to make fun as they have almost completely been replace by bruisers. Bruisers were made because there needed to be an inbetween for the Damage dealers and the tank as a secondary source of damage, The problem is that bruisers (typically) can tank the same amount and deal damage at the same time thus tanks are unnecessary. \n\nAnother thing I would like to say about your post is saying its exciting when ranged is dominating the game, this I completely disagree with as the ranged/melee risk reward is completely out of wack. The ranged is allowed to make more mistakes in positioning as they are outside of the Attack range of the opponent so low risk high reward, now the melee can not make a mistake otherwise they are in full retaliation range and are unable to retaliate themselves, one would think high risk high reward no? Wrong it is High risk medium reward as the existence of flash allows the ranged champion a out thus the medium reward, now what most people say back to that is you have flash too so just follow up, This would be true if the melee has a slow of decent % and the ranged can't displace or slow the melee (most do) and even if they don't have soft or hard cc they can still just walk away as they are usually out of range of the melee even after flash despite ranged champions having lower ms base.\n\n> Same thing with summoner spells, variety for sake of variety is useless, and that is the reason flash is so overused. It's a versatile spell, that is fun and allows for skill expression. They have not managed to make nearly as fun other spells, with as much mastery and skill attached to them, it's the reasons a few of the spells lay in the dust. Rewards vs Cost is not high enough, current setup works, and making improvement is difficult, and unless you make a spell as good from a design perspective as flash, then it's not worth it to introduce variety.\n\nVariety for the sake of variety would be useless if there was variety and everything was already balanced. The problem is that the overuse of flash a spell which is dominant not because it is OP but is because it is required by the base design of the spell, it has every thing one needs in one spell, it has too much utility on it. Have a look at ghost, with all the slows in the game now it has little purpose except on a select few champions. \n\nFlash on the other hand isnt affected by slows, I have preached this before and I even talked to Ghostcrawler who when asked on the topic of Smite being nerfed so it doesn't become too dominant while flash is taken nearly 10 times out of 10 said and I quote \"Flash is an exception to that philosophy. We don't mind seeing it a lot or nearly all the time. It's more like Recall.\" Thus why is it not free? the answer is because there are a select few champions who don't require it (at all times) and I will quote him again \"No I don't mind. Making Flash another B is on the table. The issues are not everyone takes Flash and we don't want 2+Flash.\" \n\nThis is because each spell should be unique and have a niche which it fills. Flash fills multiple niches and is a universally good spell on anyone due to BAD design. It can do its own thing (go over walls) that's a good thing but it can also take the place of other summoner spells as it can be used as a mild alternative to them while having its own niche, Barrier can be replaced somewhat by just using flash and dodging the shot (if a skill shot), Ghost can be replaced somewhat by flash by being a either gap close or escape that is unaffected by slows, same with heal as it can be used to make the distance heal would have given with its MS boost (not the health regain). To fix this the other spells need to be tuned up to compensate, Ghost should either make you immune to slows or while its active reduce all slows effects by 50%, Barrier should grant either increased defenses while active or just be flat damage reduction, Heal doesn't need to be changed as it's heal is equally unique, Clarity needs to grant energy as well as mana and possibly grant % cd reduced on your spells (kinda like Yi's ultimate passive), Teleport, exhaust, smite, and ignite are in a decent place in my opinion, while Cleanse and Clairvoyance need to be looked at really bad as they are taken the least of all the summoner spells since trinkets were introduced.\n\n\nSorry if this post is kinda scatter brained, its 7am and I am really sleepy, that and had a rough last few games so i'm kinda irritated.\n\nEDIT: kinda edited to fix some of my scatter brainedness, god i'm tired.","replies":[{"poster":"Dantilq","date":"2014-12-19T15:45:29.099+0000","up_votes":2,"down_votes":0,"body":"> Yes, most of them many months ago and them just dropping it and nothing coming from it at all this is the problem. It has shown itself in many threads of late that players no longer feel as if anything they say has any meaning. Hell look at this thread, the fact that players feel this way from a company that says they are player driven speaks volumes.\n\nYes I know this feeling, but it is understandable, because the community is getting very big, there just is too many users and too few devs. And this is just english speaking users, which is in minority compared to non-english communities, like chinese and korean.\n\n> Heres the thing is it fun to play against a Kalista, the answer is almost always no as even as a ranged champion she can just get away or chase you down easily and you can do nothing about it. It takes more skill for the melee player to outplay the ranged player than it does the ranged to \"outplay\" the melee champion.\n\nYes, Kalista is obnoxious, I agree, but she is not norm for ranged champs. She is... special. Outplaying a ranged is not easy no, but if you look how the matchups go for trynda, yi, yasuo, it's pretty much get one hit and you are dead. They have overcompensated the lack of engage, with extreme damage, and they have tools to avoid being kited too much, on several of the bruisers, like irelia or jax.\n\nGenerally the interaction is not overly exciting, they have not figured out proper tools for EXCITING interactions. Melees get perma-kited, ranged get instant-kill with no chance of comeback, it's hard to tweak it for something inbetween, but right now overall it's somewhere inbetween. Kalista and Ashe are champs that pushes for perma-kiting though.\n\n> This is because each spell should be unique and have a niche which it fills. Flash fills multiple niches and is a universally good spell on anyone due to BAD design.\n\nYes and no, universal tools are bad design, but flash is universal because of how ingenious it is.\n\nI mean you can easily buff ghost to be better, but it doesn't have nearly as exciting interactions. With ghost you outrun anyone, it's highly binary, and the play potential with it is low, you just run at them and that's it. If you lower the slow effects of it, then sure it works better, but is it making the game more fun?\n\nIt means Darius, Olaf and many other champs is much harder to kite, it means the ranged champs would very much be shut out, it would be bruiser heaven. Overall it would shake things up massively, and not really improve game health or fun overly much. It would pretty much be a binary \"can't be kited/free escape\" button.\n\nThis is the reason why it's hard to make new summoner spells, you can ALWAYS buff them to be as strong as flash, and make flash redundant, but are you sure you want to play a game where barrier/exhaust is the norm?","replies":[{"poster":"Kobold","date":"2014-12-20T02:39:45.038+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wertilq,realm=EUW,application-id=3ErqAdtq,discussion-id=QL6FKEGE,comment-id=000600040000000000000000000000000000,timestamp=2014-12-19T15:45:29.099+0000)\n>\n> Yes I know this feeling, but it is understandable, because the community is getting very big, there just is too many users and too few devs. And this is just english speaking users, which is in minority compared to non-english communities, like chinese and korean.\n\nNothing we can do about that as they are now the target audience and are where all the money is right now. Heck they have all the winners of Worlds over there since season 1. So of course Riot sees the rest of us as third class citizens.\n\n> Yes, Kalista is obnoxious, I agree, but she is not norm for ranged champs. She is... special. Outplaying a ranged is not easy no, but if you look how the matchups go for trynda, yi, yasuo, it's pretty much get one hit and you are dead. They have overcompensated the lack of engage, with extreme damage, and they have tools to avoid being kited too much, on several of the bruisers, like irelia or jax.\n\nThose first three (Yi, Tryndamere, and Yasuo) are all melee carries so they have to have lots of damage to compensate. While Irelia and Jax are more toward melee carry than bruisers but still have a very bruiser kit. the reason they are overcompensated is the fact of how powerful range is, with a ranged champion one can orb walk and increase your damage extremely, melee's can kind of orb walk though their animation is faster and has no back swing on some champions.\n\n\n> Generally the interaction is not overly exciting, they have not figured out proper tools for EXCITING interactions. Melees get perma-kited, ranged get instant-kill with no chance of comeback, it's hard to tweak it for something inbetween, but right now overall it's somewhere inbetween. Kalista and Ashe are champs that pushes for perma-kiting though.\n\nAshe is kind of the reason this whole thing started, as giving a ranged champion perma slow imo is a very bad idea. Kiting was always a way to deal with melee champions as they always had to get to you while you pegged them from afar. Now with Kalista I understand what CertainlyT was trying to do but the part of me that went through game design at college screams that he should have known what was going to happen. His intentions were pure as in wanting to teach player to orb walk but he ignored the consequences of his actions. Mobility creep was already a well known problem as well as the problem of melee's vs ranged champions, he outright ignored this and created her anyway. Now the main argument for her is she can't animation cancel, if that's her only weakness besides hard CC which is everyone's weakness, he should have seen it there that it was a bad idea. It not only breaks every rule they set forth for champion design in regards to counterplay but also ignores base common sense as a designer. Because Kalista exists J4 can't be picked in the same game, which goes against their rule of champions should not hard counter others to such an extreme they can't be picked.\n\n> Yes and no, universal tools are bad design, but flash is universal because of how ingenious it is.\n> \n> I mean you can easily buff ghost to be better, but it doesn't have nearly as exciting interactions. With ghost you outrun anyone, it's highly binary, and the play potential with it is low, you just run at them and that's it. If you lower the slow effects of it, then sure it works better, but is it making the game more fun?\n> \n> It means Darius, Olaf and many other champs is much harder to kite, it means the ranged champs would very much be shut out, it would be bruiser heaven. Overall it would shake things up massively, and not really improve game health or fun overly much. It would pretty much be a binary \"can't be kited/free escape\" button.\n> \n> This is the reason why it's hard to make new summoner spells, you can ALWAYS buff them to be as strong as flash, and make flash redundant, but are you sure you want to play a game where barrier/exhaust is the norm?\n\nThis is what I spoke about in one of my threads, Flash is countered by Flash and hard CC, Ghost is countered by Flash, Ghost, Exhaust, slows, AND Hard CC. Flash as a summoner spell has nearly zero counterplay by your opponents. Once again going against the base premise of always having good counterplay, What needs to be done is flash needs to be redone mechanically. Either make it like Lissandra's Glacial Path (E) or turn it into a dash as to make it so it is countered by things like Azir's Emperor's Divide (R) and Veigar's Event Horizon (E) that's if you wanted it to be free target. If you wanted to control it even more you could make it like Nautilus's Dredge Line (Q) where if it hits a wall you are pulled to it or if close enough go through it, or even make that its own spell while making Flash like my idea above. \n\nThe problem is Riot themselves See [HERE](http://boards.na.leagueoflegends.com/en/c/gameplay-balance/ta1G4qjz-why-is-flash-allowed-to-be-a-dominant-must-have-spell-but-smite-isnt?comment=0002) where Meddler says that flash is ok because it looks cool not due to any concept of balance (which is the whole reason it needs to be looked at). I have always believed that if you say something you should stick to it, if you can't stick to it explain in explicit detail why you can't. They have given no reason why flash is left how it is other than it looks cool which is not a balance concept. The fact that repeatedly over the last 2 years maybe even longer they have ignored their own CORE design policy is astounding. It's the reason people on the Boards or Reddit don't trust them design wise, they can't follow their own policy. If they followed their own policy then people wouldn't have to question whether they listen at all or why a decision was made, This along with actually explaining why decisions were made would be the first step in patching relations with the playerbase, see lore retcon's not answering why it needed to be done when there were many examples of how it could be done without complete retcon, the Cass rework that ignored feedback and is essentially being done over again. \n\nI love Riot but that's why it concerns me so when they can't keep their word, it's like a friend you had who you trusted completely but then you see them overtime continuing to lie to you and when you ask them why they blow it off as a joke. You slowly start to lose respect for them as they are continuing to lie and deceive you until you don't recognize who they are anymore. I want to work with them to make things right, I want to work for them to see if any integrity remains, and if not I would leave very quickly as I could not work for a company who doesn't even respect themselves enough to see what they have become.","replies":[{"poster":"Dantilq","date":"2014-12-20T08:36:06.419+0000","up_votes":1,"down_votes":0,"body":"> The problem is Riot themselves See HERE where Meddler says that flash is ok because it looks cool not due to any concept of balance (which is the whole reason it needs to be looked at).\n\nThere you make a major misconception about game design in competitive games. Ultimate goal is not balance, but fun. Entertainment games is made for to entertain, they NEED to be fun, and in this case both as spectator sports and to play. Even if game is unbalanced on some level, even if there is a lack of variety, IF it's more fun that way, it overrides that.\n\nWhat Riot says makes much more sense if you think from that perspective, instead of thinking about balance and variety as the ultimate goal.\n\nFlash makes better plays, it's simply a too cool ability. It sets up epic plays, and great defenses, partially it's because it's so responsive.\n\nLook from the perspective of a spectator, what would you rather see? Darius that uses ghost, runs up to the ADC, and slam dunks them, or Annie doing a flash tibbers engage on enemy team?\n\nFlash by itself is hard to say it have counterplay or not on, as it's a short dash blink, it's more how it is linked together with other things, and in which context it is used. In some situations there is no available counterplay for that given moment, in the big picture that is overall fine though, if you do it again in a minute you'll kill me as I have no flash then. To example I flash over a wall to escape you when you play Olaf and you have ghost ignite.\n\nAlso remember in design you can break ANY rules, as long as you have a good reason. It's all guidelines. And in this case game became more fun, allowed more mastery, and gives the player creativity. You can be creative with flash, you can't be nearly as creative with ghost.","replies":[{"poster":"Kobold","date":"2014-12-20T16:41:52.809+0000","up_votes":1,"down_votes":0,"body":"EDIT: I was pretty rough when I said that about Riot I admit it just gets frustrating sometimes, maybe I should have toned it down some.\n\nI originally had a huge 5 paragraph hate rant on design values but I felt as if it was very immature of me so I played a game and cooled off (I need to do this more often, others too) and created this suggestion/retort.\n\nPersonally I believe balance should be the most important thing in a game besides being fun to play, as if you don't try to balance the game you are willing to sacrifice one person's fun for another. Flash may create \"cool\" plays but if you are not willing to force variety then eventually that \"cool\" factor will completely disappear as it is now the norm. Take the infamous \"INSEC\" play, after seeing it just about every single competitive game it no longer has that cool factor it once had, instead its just a play that is pulled of by many other people. In most competitive matches you can call out the move about 10-20 seconds ahead of time as it has been seen time and time again. \"Oh man he is in a tight spot, oh there is the Ezreal ult and he's over the wall safe and sound.\" I can't even tell you how many times I have heard something similar to this. If you want to keep the \"cool\" factor what needs to happen is more than just one mobility spell, to do this you need to change the way summoner spells function. \n\nLet me explain, the summoner spells would need to be categorized by type, Mobility, Utility, Sustain, and Destructive, (Smite would probably have its own as it is a jungler spell). Mobility would consist of Flash, Ghost, and two other ideas I had as a concept for them. Utility would consist of Teleport, Exhaust, and Clairvoyance. Sustain would be Heal, Clarity, Barrier, and Cleanse. While Destructive would consist of Ignite, and possibly two new spells. My thoughts on this is that flash would be turned into a instant dodge or get over walls spell as its distance would be reduced for just that purpose. Each player can chose up to one from any one category i.e. a person can't take Heal and Barrier as they are both sustain spells but they may take Flash and Heal. While the two mobility spells concepts I would recommend would be to add a Dash spell (Similar to Graves' Quickdraw but can't go over walls though it has the same range as flash now) and a grappling hook like Nautilus where if it hits terrain it pulls you to it (Longest range of the spells though the slowest).  For some Ideas on the Destructive spells I had thought something along the lines of Soul Crush  lowers the Armour and Magic Resist of the target for x seconds (this allows the removal of the defense rend on exhaust (which seems tacked on, and allows more power budget in the spell) and specializes exhaust as an anti engage or follow through with the slow), and possibly bring back Surge (reworked of course). Early ideas but gives some food for thought. \n\nThis may be too restrictive but i'm not sure, the main thing is more mobility types (increased variety in the game mobility wise so there are different \"Cool\" plays to be made, thus preventing stagnation) but also preventing players from having multiples of them.\n\nWhat are your thoughts?","replies":[{"poster":"Dantilq","date":"2014-12-20T18:47:59.186+0000","up_votes":1,"down_votes":0,"body":"Yes I agree that the cool plays soon become the norm, but at the same time it create lots of up and downs, depending on what you have up and not. And even the Insec is quite a complex move that can be done tons of different ways, it's not as simple as flash kick. Lots of different things changes from situation to situation, I've seen at least 20 different kinds of Insec-kicks.\n\nWhat also happens when both parties knows the existence of it, is that they play around it. And flash IS flashier than most other things, and more fun to use and more fun to play against. \n\nI mean you can argue for flash having bad counterplay, but compare that to exhaust. It's AWFUL to play against, you deal no damage and can barely move. \n\nCompare it to ghost, if enemy ghosts in open area, there isn't much you can do, unless you have a team there, it's a fight to the death, you can throw CC, delay and damage, but it only slows down the unstoppable force coming to get you. It's highly binary.\n\nCompare it to doing trades with someone with barrier or heal, you just can't win the trade.\n\nI agree with you though, several defensive, movement utility etc, makes it worse. Playing against barrier heal, or ghost flash is not very fun.\n\nI don't know about your solution though, adding categories, is all nice, but at the same time, it adds design clutter and complexity. Correct me if I am wrong but with your system you still only get 2 spells right, but they need to be from different categories?\nIt enforces lack of variety, I mean you could fully balance usage of spells by making limit amount of each summoner spell for each team, to the extreme of you being able to use only one of each spell. That wouldn't be balance, add variety or make game better though, as it would be enforced.\n\nThere is a big difference between enforced variety and dynamic variety. I mean if I at gun point ask someone to do something, they might do it, but that doesn't mean they normally would do it, and if the goal is to make it viable option, then you can't force it.\n\nWhat I would do with summoner-spells is instead REMOVE a bunch. Have only a few, but instead make each and everyone of them interesting and multi-usage. Make them wider in terms of utility making choice of using them more difficult. Heal is a good example of a decent summoner spell, it have utility in form of a small movespeed boost, and you can use it to save a team-mate.\nI would remove, ghost, barrier, clairvoyance, clairity, cleanse, revive, only keeping flash, teleport, heal, ignite, exhaust, smite.\n\nMinimize the overlapping spells, and instead make each and everyone of them really unique and strong at that.","replies":[]}]}]}]}]}]}]}]},{"poster":"Dantilq","date":"2014-12-19T10:34:17.317+0000","up_votes":1,"down_votes":0,"body":"Personally I'd want more interaction on several topics, I'd love to have a discussion about RNG of crit and ways to avoid it, and why certain solutions might not work.\n\nI'd also love to discuss alternative ways of handling level 1 poaching of jungling.\n\nThat is the part I miss the most about being on PBE =/ The Red to player-base ratio is much better there, and it was overall easier to create a discussion with reds then.\n\nIt's one of the weakness of a big community, red to player-ratio is pretty bad. The reddit system easily drowns out things that is not popular opinions, it tend to have snowball effects of votes, and overall it feels frustrating to \"get seen\". It also feels as if your topic is not exciting to your average user, or if it passes above the average users head, it's really hard to get a discussion going. \n\nI love game design, but it have been difficult to get any good design discussions going on the boards. Oftentimes people simply do not have the experience, knowledge, interest and information to even understand the topic, and if you write it, your post becomes too long so people doesn't read it instead. Majority of discussion end up being about completely unrelated things since the ones you talk to doesn't understand the issue, and educating users about a topic so they can talk to you, usually end up not talking about the topic at all.\n\nI do not have any great ideas how to solve the issue fully to be honest, not in a way that allows everyone space. What I want is to discuss with other people similar level and interest as myself, and then have reds involved as well at times, as \"masters\" to help put some \"fact points\", like what you have tried out and not to help form the discussions. Reds could then gather any good suggestions that come out of discussions. Pretty much an invite only forum, with a smaller user-base to interact more directly with reds, the issue is that the community as a whole would feel left out.","replies":[{"poster":"Kobold","date":"2014-12-19T13:11:58.882+0000","up_votes":2,"down_votes":0,"body":"After responding to your other post and reading this one I'm internally conflicted. You seem exactly like me (as in you propose a solution but also tell the problems of said solution) but have differing views or even the same views as me but word it in a different way.","replies":[{"poster":"Dantilq","date":"2014-12-19T15:48:34.912+0000","up_votes":3,"down_votes":0,"body":"If you can't tell what issue there is with your solution, then you have not thought it through enough, that is how I think at least.\n\nI feel we have different opinions, but at least both can manage decent level enough of discussion for exchange of opinions to be worthwhile, and yes partially we agree but use different words.","replies":[{"poster":"Kobold","date":"2014-12-20T02:45:53.746+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wertilq,realm=EUW,application-id=3ErqAdtq,discussion-id=QL6FKEGE,comment-id=00060004000000000000000100000000,timestamp=2014-12-19T15:48:34.912+0000)\n>\n> If you can't tell what issue there is with your solution, then you have not thought it through enough, that is how I think at least.\n\nI wish more people thought this way. :( Most people only see their solution but not the consequences.\n\n> I feel we have different opinions, but at least both can manage decent level enough of discussion for exchange of opinions to be worthwhile, and yes partially we agree but use different words.\n\nIt's nice to be able to actually have a discussion and not a fight on the matter.Though i'm very headstrong on my beliefs (being a Taurus and a Gemini at the same time, curse you birth time). I wish others and Riot did the same more often where it was more a differing of beliefs that can compromise than a i'm right your wrong thing.","replies":[]}]}]}]},{"poster":"Declined","date":"2014-12-19T17:54:17.815+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FeralPony,realm=NA,application-id=3ErqAdtq,discussion-id=QL6FKEGE,comment-id=00060004000000000000,timestamp=2014-12-19T07:59:32.348+0000)\n>\n> -snip- **Do you have any question in particular** -snip-?\n\nPick me, pick me I got one!!\n\nHaving spent a great deal of time analyzing principles, I made [this](http://boards.na.leagueoflegends.com/en/c/tips-tricks/64VFYEZy-a-guide-to-understanding-the-dynamics-of-bot-lane) and I would like to ask you about your design values regarding the 3 dominant lane types (7th paragraph).\n\nAlso as the game becomes increasingly more complex with more champions, it would be nice if Riot posted an unofficial version of champion weaknesses as I am certain a lot of those same weaknesses may be present in the different champion types\n\nExample: Assassins have a rough early game, and usual problems with wave clear until level 7-9.","replies":[]}]}]},{"poster":"Quepha","date":"2014-12-19T08:43:10.087+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=FeralPony,realm=NA,application-id=3ErqAdtq,discussion-id=QL6FKEGE,comment-id=000600040000,timestamp=2014-12-19T06:40:05.366+0000)\n>\n> Correct. I work primarily on gameplay.\n\nso when someone starts working on a gameplay update, how much of that process is standardized for the whole team and how much is left up to the discretion of the individuals in charge? i'm mainly asking about how the process for cassiopeia felt so very different compared to other recent gameplay updates on the player side, what felt like a really sudden update with almost no player feedback taken.","replies":[]}]}]},{"poster":"Mirage Night","date":"2014-12-18T11:33:49.416+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=FeralPony,realm=NA,application-id=3ErqAdtq,discussion-id=QL6FKEGE,comment-id=0006,timestamp=2014-12-18T09:05:49.791+0000)\n>\n> So I'm going to speaking mostly from personal experience on how I use the forums and other forms of community feedback, as different rioters use community feedback differently. If I had to broadly categorize I would say I use community feedback in 5 ways.\n> \n> *Feeling out General Sentiment* - This is pretty broad but this is when I search for general trends, issues, and feedback. This is generally for broad answering questions like\n> \"What are people most interested or vocal about?\"\n> \"Aside from the concrete data - do people feel that this character is OP or UP?\"\n> \"What elements of a larger patch or feature are people most drawn to or that is most contentious\"\n> \n> *Easy Wins* - These are specific changes that are really easy to do, something I could tackle over lunch without sacrificing my current projects. Often these are champion QoL fixes or bug/feel investigations.\n> Examples include\n> Switching a skill to a new targeting indicator\n> Investigating reports of a characters AA feeling weird\n> Updates to a champions recommended items\n> Minor particle updates I can fix with my bad art skills (ex- displaying all 3 cards during Twisted Fates Pick a Card for colorblind people)\n> \n> *Discovering Important or unImportant elements *- When I was working on the Udyr and Trundle updates a long time ago reading community feedback on those champions in general was super useful in evaluating what elements of the character people seemed most attached with on each character and what they simply didn't care about. I found out pretty quickly, and not super surprisingly, that people didn't really care about the flat bonus AP on phoenix stance and it was viewed as practically worthless. Stripping this bonus damage out allowed me to put the phoenix fire breath cone on the very first punch upon switching stances for nearly identical total damage but made him more satisfying and allowed him more interesting positional play and let him rotate stances faster.\n> \n> *Discussion Topics on Contentious Issues *- Seeing people propose specific solutions for issues and the response to those solutions is really valuable. A specific example here would be the Critical Strike or Grievous Wounds discussions that pop up from time to time. Even if the issues discussed aren't ones we are working on right this minute the discussions are still valuable to have so we can make progress faster on them when we start working on changes.\n> \n> *Specific Solutions *- When I'm stuck on something as a dev it can be helpful to get specific suggestions. When I worked on the mastery tree updates for the previous seasons (we didn't do one this time around). Stuff like focusing on laning power for early 9pt masteries, fusing options that didn't need to be separate (such as phys and mag pen or the improved Summoner Spell options), pickpocket variant for melee champs etc, came from community feedback delivered once each version went out and was incorporated into the next iteration.\n> \n> Anyways that's a really long way of saying, yes I find a lot of value in people posting stuff for a variety of reasons, but it varies greatly based on the projects I'm working on, and how much those issues are discussed. \n> \n> I hope this was helpful Wiegraf (I'm assuming your name is a FFT reference btw?).\n> \n> -Feral {{champion:120}}\n\nWell, now I don't feel so useless when commenting on certain issues.","replies":[]},{"poster":"Pika310","date":"2014-12-18T22:00:18.671+0000","up_votes":2,"down_votes":0,"body":"> Easy Wins - These are specific changes that are really easy to do, something I could tackle over lunch without sacrificing my current projects. Often these are champion QoL fixes or bug/feel investigations.\n> Examples include\n> Switching a skill to a new targeting indicator\n> Investigating reports of a characters AA feeling weird\n> Updates to a champions recommended items\n> Minor particle updates I can fix with my bad art skills (ex- displaying all 3 cards during Twisted Fates Pick a Card for colorblind people)\n\nSo these sort of changes really are that simple and non-time constraining to accomplish.  This is very useful for us to know.  Thank you very much for the valuable information, I'm sure we can put it to good use.","replies":[]},{"poster":"exe3","date":"2014-12-19T22:01:32.091+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FeralPony,realm=NA,application-id=3ErqAdtq,discussion-id=QL6FKEGE,comment-id=0006,timestamp=2014-12-18T09:05:49.791+0000)\n>\n> \n> *Easy Wins* - These are specific changes that are really easy to do, something I could tackle over lunch without sacrificing my current projects. Often these are champion QoL fixes or bug/feel investigations.\n> Examples include\n> Switching a skill to a new targeting indicator\n> Investigating reports of a characters AA feeling weird\n\nSince you bring these up can I throw two suggestions out there.\n\nCould you change Azir's W to cast like Heimer turrets instead of skillshots? I expect Azir to walk into range to cast the soldier where my mouse is, not throw it out at max range (i've so often spawned a soldier instead of damage a tower because he won't walk 1cm further to get in range, so annoying), it's so annoying that I don't play him for this sole reason.\n\nAlso could you look at Quinn's AA? I think she's really strong and fun but she has one of the most painfully sluggish auto attacks in the game imo, it makes her feel so unresponsive that I just can't play her until it gets some love. :( \n\nAlso on masteries have you ever considered changing how they work. Can't say i'm a fan of the current masteries because there's almost 0 variation and there are also traps (eg: if you put points into Recovery and Enchanted Armor you'll then be forced into wasting a point in Block or Tough Skin otherwise you can't get past the second tier). My main point is if I really want say Tenacious on my ADC why must I be forced to put EVERYTHING into the defense tree? I think it would be interesting if you had a set amount of point you can place in each tier regardless of the tree so you'd end up with situations where you could pick up Utilities lifesteal/spellvamp if you were sacrificing the damage from Executioner as well as the ability to choose any of (but only one) of the Tier 6 masteries regardless of where your points went in previously. I hope this makes sense. :)","replies":[]}]},{"poster":"Cale017","date":"2014-12-17T07:03:41.151+0000","up_votes":7,"down_votes":0,"body":"Honestly I could do with some transparency here as well. It's clear that based Rito can hear us when we all cry out (Warwick is proof of that) but what about when there isn't an overwhelming community outcry? Does the opinions of the little guy really matter? How much of what we say for suggestions or ideas is actually even read, and how much of that is actually put to some use?\n\nI'm not harping, just curious.","replies":[{"poster":"WiegrafOfValor","date":"2014-12-17T07:06:42.346+0000","up_votes":4,"down_votes":0,"body":"Thank's bro. Let's see if we can get some attention to this.","replies":[]}]},{"poster":"Zyras Honey Pot","date":"2014-12-17T07:20:24.785+0000","up_votes":5,"down_votes":1,"body":"I mean what do you want them to say? Of course they're going to come in here and say \"Yeah guys of course we listen to you, but *clarification/PR crap*\".","replies":[]},{"poster":"Saevum","date":"2014-12-17T07:14:54.653+0000","up_votes":4,"down_votes":1,"body":"They are a big company, their goal (as the other gaming companies) is to profit from what they do (games). And it also involves what a client has to say about it.\n\nBut, i assume (i assume), they satisfy the larger groups desires and not the minority, however, it may not be a general rule if we talk about game balance, so, any comment you may have surely is (will be/would be) in a good spot and its gonna be listened. Or at least read.","replies":[{"poster":"Pika310","date":"2014-12-18T22:55:44.630+0000","up_votes":2,"down_votes":1,"body":"I agree with what you're saying, but the observations I feel I've made point opposite.  Yes profit should be their goal, but at least how I see it, they're going about it in the wrong way.  Lately they've take a stance of \"quantity over quality,\" they want to make an extremely large number of very minor changes, which each are a rushed very poorly done job, as opposed to taking more time making certain all is kept up to par.\n\nI wish I could believe they follow the consensus, but the status quot of champion balance always favors a select few.  Namely these 4 in particular tend to be continually overlooked for serious nerfs: {{champion:64}} {{champion:238}} {{champion:412}} {{champion:236}}   At the same time, every other champion that becomes FotM is severely smacked down mercilessly, a few that come to mind include: {{champion:28}} {{champion:102}} {{champion:96}} {{champion:115}}   Then on the other hand, there are champions that ONLY have a \"minority\" which gets blatantly ignored, by default their low numbers become the large group, but because they're so small their voices go unheard.  For these champions, the balance team only seems interested in \"trade-offs\" which ultimately turn into nerfs on every front, putting them in a much weaker position than before changes began.  I could sit here listing those as well like {{champion:14}} {{champion:69}} , etcetera including many more, but I personally want to mention one in particular.\n\n{{champion:37}} With rumors of her upcoming DJ skin, it was in Riot's best interest not to anger and infuriate her fanbase.  Despite this, they knowingly rolled out a failed rework of 15 or more nerfs w/o tradeoff, whilst simultaneously removing her identity.  For 24 weeks, players have attempted to communicate with Riot, met only with propaganda followed by complete silence.  Despite losing her viability and being placed into a state of desperation, they followed with yet more nerfs to this F-class champion.  This is NOT how a company should treat its customers and most absolutely not the kind of behavior you want to employ when you need increase interest for upcoming skins.  I'm going to say \"when\" and not \"if\" they release the DJ Sona skin, they will not receive half, if even 1/3 of the profits they would have pre-\"rework.\"  At this point, the only way to rescue their sales numbers would require not only a complete revert, but major buffs as well, plus public apologies and \"responsibility\" being taken for Riot's unprofessional actions since the beginning of this endeavor.","replies":[{"poster":"WiegrafOfValor","date":"2014-12-19T01:02:35.650+0000","up_votes":1,"down_votes":0,"body":"I see your point, but I can't even imagine how balance is going to be achieve in a everchanging game like LoL. Sure I know there are some serious problems and oversights, but still I'm glad to know they somehow collect the data we're giving to them, this feedback we gave to  them is acknowledge in a way. \n\nBut you got to understand one thing, they must have their objectives, their agenda, some plan and future projects. To make a permanent change to the game so huge, every single change must be approve by a group of people, and their perspective is different from ours, mostly because the information they have is different from the ones we have. \n\nIt's sad, but even if we cried out in the Boards, unless the small circle of managers on Riot's HQ approves those changes, it will never make it live. They could simple ignore our ideas and perspectives, but at least we know this isn't true, our ideas, our opinions, they're collected and perhaps be able to influence future projects. \n\nLet me break down for you, we can't change Riot point of view and decisions right now, but as long most of the community keep pointing them to the right direction, we can change what they consider a good strategic move, thus influencing on what they may plan ahead.  \n\n\n---- Sry for any Typos, I'm writing this from a hospital, my daughter is sick. Didn't sleep yet.","replies":[]}]},{"poster":"WiegrafOfValor","date":"2014-12-17T07:28:53.343+0000","up_votes":2,"down_votes":1,"body":"What you said is just what I want to hear, but from a Riot employee. Thank you for your reply.\n\nI just want to know the specifics, do they gather some good suggestions and share with the HQ, therefore giving a feedback or analysis on their market which can influence on their future gaming/balancing decisions?\n\nWhat I mean is, let us say the community had a consensus about Rito's lack of understanding that range by it self is a very powerful mechanic advantage on the balance of power, will this be analise by the HQ somehow? or only when it becomes a major problem? after acknowledge this information Rito will then react to it or the community opinion is irrelevant?","replies":[{"poster":"BADxW0LF","date":"2014-12-18T20:30:17.319+0000","up_votes":1,"down_votes":0,"body":"I know you already received a response to this from a Riot employee, and I'm sure that they do take into consideration a lot of the suggestions out there.  Before I go on any rant that I had intended, I need to know something...are you questioning why they don't make a comment whenever they find a suggestion they like?","replies":[{"poster":"WiegrafOfValor","date":"2014-12-18T21:45:43.858+0000","up_votes":1,"down_votes":0,"body":"No, I'm not questioning that, I only want to know how they take this information and if they find it relevant.","replies":[]}]}]}]},{"poster":"alaskaneagle","date":"2014-12-18T21:58:16.834+0000","up_votes":2,"down_votes":0,"body":"54367\n\nGood post though, good ideas at the bottom and you even got some red posts.  GJ upvote for the awesomeness of it all","replies":[{"poster":"WiegrafOfValor","date":"2014-12-19T00:40:16.377+0000","up_votes":2,"down_votes":0,"body":"Thanks man, our voice matters I guess :D","replies":[]}]},{"poster":"alaskaneagle","date":"2014-12-18T21:35:24.954+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=WiegrafOfValor,realm=NA,application-id=3ErqAdtq,discussion-id=QL6FKEGE,comment-id=,timestamp=2014-12-17T06:48:24.010+0000)\n>\n>\n> , I will try to ignore Toxic behavior and will only acknowledge Red's reply or serious replies. \n> \n> \n> \n> \n54367\n\nGood thing to do, I got a temp ban off of forums for responding to people in a similar tone as their responses.  I hate riots policy that you are not allowed to talk back.  Especially when it usually if not always gets you in more trouble than the person who trolled you.  \"STFU and be a good little stockholm\"-RITO  :-)","replies":[]},{"poster":"StillwaterPlaya","date":"2014-12-17T09:01:51.840+0000","up_votes":2,"down_votes":0,"body":"^","replies":[]},{"poster":"Linna Excel","date":"2014-12-19T19:14:16.413+0000","up_votes":2,"down_votes":1,"body":">All these Ideas, opinions, suggestions about gameplay overall do they matter, at all?\n\nI'm of the opinion they matter (if riot sees them) until riot has made up its mind.  After which point if you don't agree with riot, riot could care less about what your opinion is.\n\nCase in point is the Soraka rework.  Instead of listening to what all of the fans wanted, they pretty much knew what they were going to do with her (make her less fun for everyone) from the beginning and wouldn't hear otherwise.","replies":[]}]}