{"poster":"Hola mis amigos ","date":"2016-04-26T06:07:26.511+0000","title":"Unoffical LoL Card Game (in Alpha)","subforum":"Player Creations","up_votes":1,"down_votes":0,"body":"***THIS IS NOT THE FINAL LOOK OR FORM, JUST A PREVIEW***\r\nSo i thought it would be pretty cool to make a card game for league. I&#039;ve only just stared off but if you have cards you want added drop a comment :)\r\n\r\nSo the goal is to defeat the opponents set amount of life (like MTG and HS).\r\nI&#039;m using a mana and energy system on champions to make it interesting. \r\n\r\nLink 1: Its a &quot;Champion Card&quot; can be played on your own turn without cost, only 1 champion per turn: http://imgur.com/PTpeekv\r\n2 AD - you can attack an **enemy** champion (meaning you can chose who you target unlike MTG) or the players life. attacking the players life well result in the opponent having a choice of who to block with. \r\nAD also grants energy for the damage you deal (not send, so shields will prevent energy growth). \r\n6 Hp - to kill a champion you must deal its entire health in 1 turn. \r\n2 Mana Regen - If your card is not used for your turn (you can block on enemy turn) you gain 2 mana which stacks. \r\n2/2  means he needs 2 energy or 2 mana to use his spell.\r\n \r\nLink 2: This is a &quot;REFLEX CARD&quot; can only be used on the enemy turn and is removed afterwards: http://imgur.com/mlnodSs\r\nThe blue 4 is the mana cost. It does not have an energy cost (it can&#039;t be played with energy&quot;","replies":[{"poster":"Thornax11","date":"2016-05-02T08:57:05.021+0000","up_votes":1,"down_votes":0,"body":"Maybe remove energy, and just have mana, otherwise it will get too complicated.\nThe reflex cards feel like Instants (MTG), so perhaps use passives like artifacts, or have permanents that have reflex abilities, also champions. \nPersonally I love Zilean {{champion:26}} so if he was in the game, i would say give him a passive that marks a random allied champion, this turn, if they would die , instead they are revived\nAnyway wicked idea dude keep it up!","replies":[]},{"poster":"Vanilla Bread","date":"2016-04-26T06:12:34.130+0000","up_votes":1,"down_votes":0,"body":"make em into yu-gi-oh cards","replies":[]}]}