{"poster":"Mytlix","date":"2015-12-12T21:34:28.331+0000","title":"Dubbi","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Ho delle domande la quale mi sono sempre scervellato &egrave; mai avuto risposta oggi sono qui per trovarle.\nLe domande sono queste:\nQuand&#039;&eacute; meglio buildare le 18/12 e quando le 12/18(con signore del tuono)\nQuale sono le rune perfette per un Rengar che vuole fare la One Shot Combo su il carry?\nLa differenza tra pen. armatura e attacchi fisici e hybird pen.\nCome buildare un Thresh che dia sia un po&#039; di utility e renderlo anche un po&#039; tank","replies":[{"poster":"BrattishSolid6","date":"2015-12-12T22:06:54.971+0000","up_votes":2,"down_votes":0,"body":"Siccome non mi ritengo abbastanza esperto/specifico per rispondere alle prime domande, passo all'ultima, in quanto ho una discreta esperienza con Thresh ^^ premetto che non sono di alto elo né ritengo che la build che descrivo sia la migliore. è quella che al momento uso e con cui mi trovo meglio. Mi permette di essere abbastanza tank (a memoria mi pare di superare i 3000 hp con circa 100/120/150 armor/mr) raggiungendo almeno il 30%CDR fino a 40% già col terzo oggetto. Come maestria mi trovo molto bene con 0/12/18. Come maestria chiave utilizzo (non ricordo il nome, scusami) quella che scala coi siege minions, ma ritengo sia altrettanto valida quella con riduzione danni.\n\nCome build ti consiglio ASSOLUTAMENTE di startare con {{item:3302}} {{item:2010}} {{item:3340}} \n\n\nAl primo back, a seconda dei gold che ho prendo:\nALMENO 800 GOLD --> {{item:2049}}\nMENO DI 800 GOLD -->{{item:3097}} \nSe riesco compro addirittura anche gli {{item:1001}}\n\nAl secondo back se non ho preso in precedenza la Sightstone la prendo ora. A questo punto decido, a seconda dei champ alleati e a seconda dei champ nemici, se evolvere l'oggetto iniziale in {{item:3401}}  o {{item:2303}}. Preferisco il secondo. Prendo il primo se è necessario che metta un singolo scudo a un alleato (può essere necessario se si ha contro uno Zed o un Rengar ad esempio). \n\nEvoluto l'oggetto solitamente evolvo gli stivali, a seconda di come sta andando la partita.\nSe va bene / è necessario che io mi sposti in fretta (cioè nella maggior parte dei casi): {{item:3117}} \nSe i nemici hanno già temibili quantità di AP o troppi cc (abbastanza raramente): {{item:3111}} \nSe i nemici sono TUTTI AD e sono soprattutto AA-reliant (praticamente mai): {{item:3047}} \n\nCome secondo oggetto vero e proprio vado quasi sempre di {{item:3110}}. Questo conferisce armatura (sicuramente utile contro l'adc nemico), diminuzione della AS nemica (utile in primo luogo contro l'adc nemico, a meno che non sia uno spell-caster; in secondo luogo contro qualsiasi altro champ AA-reliant) e mana (che non fa mai male). Senza contare il 20% di CDR, essenziale visti i lunghi cd delle abilità di Thresh.\nCome terzo oggetto (o secondo, se strettamente necessario) prendo solitamente il {{item:3190}}: statistiche tank in generale, 10% CDR, uno scudo attivabile.\n\nA questo punto dipende molto dalla partita e dagli oggetti che ho scelto. Se ho preso in precedenza {{item:3401}} {{item:3110}} {{item:3190}} {{item:3117}} {{item:2045}}  ho già il 40% di CDR ed è inutile buildarne ulteriormente. Andrò quindi un solo slot rimanente, da riempire con un oggetto situazionale: {{item:3222}} {{item:3143}} {{item:3075}} {{item:3800}}  {{item:3102}} o {{item:3065}} (10% di CDR sprecati in questo caso).\n\nSe invece durante la partita ho preso {{item:2303}} {{item:3110}} {{item:3190}} {{item:3117}} ho ancora due slot da riempire. Bisogna tenere conto che in questo modo si ha sì uno slot in più, ma non si ha uno scudo aggiuntivo, non si ha +100hp rigen e non si ha +10% CDR. Si può continuare a buildare due degli oggetti situazionali che ho citato sopra. Eventualmente se serve un altro oggetto ancora, si può benissimo fare.\n\nOvviamente in questa \"\"\"guida\"\"\" ho sottointeso cose che credo siano scontate:\n-una volta presa la {{item:2049}} si cambia il trinket con {{item:3341}};\n-una volta arrivato al livello 9 si cambia la lente con {{item:3364}};\n-già dal primo back se possibile o altrimenti dal secondo, si deve comprare e mantenere sempre attiva una {{item:2043}};\n-se necessario durante la laning phase a ogni back si prendono {{item:2010}} a seconda della necessità.","replies":[{"poster":"Mytlix","date":"2015-12-12T22:19:57.751+0000","up_votes":1,"down_votes":0,"body":"Grazie mille preciso e breve +1","replies":[]}]},{"poster":"Nibbio Bianco","date":"2015-12-12T21:53:41.404+0000","up_votes":2,"down_votes":0,"body":"18/12 e 12/18 significano poco, ci sono 3 pagine, e comunque dipende tutto dal campione e da chi si ha contro. \n\nPer rengar penetrazione quintessenze, penetrazione rosse, blu cooldown reduction, gialle armatura. \n\nPenetrazione armatura toglie armatura all'avversario pari al punteggio che dai alla penetrazione armatura. Attacchi base fanno male all'avversario. Penetrazione ibrida è penetrazione armatura + penetrazione magica, quindi se hai sia danni fisici che magici è buona. \n\nThresh diventa tankoso con le anime che raccogli, quindi... prendi l'item da support che dà hp e poi il resto vai utility e diventa da solo tank se raccogli le anime.","replies":[{"poster":"Mytlix","date":"2015-12-12T22:21:18.219+0000","up_votes":1,"down_votes":0,"body":"Grazie mille mi hai chiarito parecchi dubbi","replies":[]}]},{"poster":"Keìron","date":"2015-12-12T21:56:26.286+0000","up_votes":1,"down_votes":0,"body":"Tresh buildalo {{item:2303}} {{item:3117}} {{item:3110}} {{item:3190}} {{item:3800}} e l'ultimo item in base alla situazione. E' una build classica per i support tank da utility.","replies":[]}]}