{"poster":"Mytlix","date":"2017-11-12T00:53:21.112+0000","title":"Diamond Complete Guide su Nidalee Jungle S8","subforum":"Campioni e gameplay","up_votes":2,"down_votes":3,"body":"Salve a tutti.\n\n(Game state:http://euw.op.gg/summoner/userName=mytlix)\n\nSituazione del meta in jungle attuale:\nCon l&#039;arrivo della nuova season e quindi l&#039;enorme cambiamento del meta (sopratutto della jungle) grazie alle nuove rune,oggi sono qui per esporvi questa guida su uno dei miei champion jungler pi&ugrave; forte (Dopo Rengar ovviamente :3) Parliamo di Nidalee {{champion:76}} \nAttualmente ho circa 53 k di esperienza con lei e l&#039;80% delle partite (anche se normal,siccome al momento non vedo la necessit&agrave; di giocare Ranked) hard carrio i game.\nOra la domanda vera e proprio &egrave; questa... &quot;Ma scusa i tank.. non sono meglio come avevi detto te?&quot; \nSi, ma lo ERANO,questo perch&egrave; la Riot ha modificato l&#039;exp in giungla,ad esempio in s7 tu potevi anche farmare pochissimo e gankare come un malato tanto poi recuperi con l&#039;exp bonus che ti dava la giungla... Ora per&oacute; non &egrave; pi&ugrave; cos&igrave;! Se sei indietro beh sei fottuto!.\nPer questo i jungler da invade sono i migliori :{{champion:64}} {{champion:104}} {{champion:121}} {{champion:76}} {{champion:77}} {{champion:35}} (beh forse lui non ancora)\nMa tra tutti loro Nidalee &egrave; sicuramente la migliore\n&quot;Perch&eacute; scusa? Se devo scegliere direi khazix &egrave; pi&ugrave; strong nei 1v1&quot;\nSi confermo, ma il punto forte di nidalee &egrave; la sua ENORME mobilit&agrave; e waveclear... io al minuto 4 mi sono fatto tutta la mia giungla e stealato mezza giungla avversaria :).\n\nGuida vera e propria:\nNidalee pros:\n-Poke\n-Sustain\n-Burst\n-Mobility\n-Vision control\n-Invade potential\n \nNidalee contro:\n-Squishy \n-0 DPS\n-Early snowball dependent\n-Hard to master\n\nRunes:\nDomination:ElectroShock\nSorgery\n(Controllare il mio profilo op.gg per maggiori informazioni)\n\nChampions da invadere:\n{{champion:32}} {{champion:28}} {{champion:141}} {{champion:79}} \n\nChampions da non invadere assolutamente (se sai di doverci fare 1v1)_:\n{{champion:19}} {{champion:107}} {{champion:104}} {{champion:121}} {{champion:106}} \n\nIl resto dipende se gli riesci a far sprecare o dodgiare la loro skill chiave.. ad esempio se lee spreca la sua Q &egrave; un occasione da non perdere, idem la E di Elise forma umana.\n\nSkill order:\nQ-&gt;W-&gt;E\n\nSkill to max\nR-&gt;Q-&gt;E-&gt;W\n\nPlay-Style:\nCome detto sopra dipende tutto dal matchup,se sei contro un matchup che dovresti vincere te calcola i timing e dove pu&oacute; aver iniziato e stanalo al buff grande che far&agrave; successivo\n&quot;Contro matchup easy&quot;\nSe tu sei nella zona blu della mappa e l&#039;hecarim nemico sta nella parte rossa, tu sai che lui starter&agrave; dal blu e far&agrave; tutti i campi tranne il gromp e pi&ugrave; o meno si ritrover&agrave; a fare il red suo (top side) pi&ugrave; o meno al minuto 3 e qualcosina. \nCosa fai quindi tu? \nSemplice! Starto bot dal mio red, vado a fare i wolfs poi blu mio e diretto a invadere l&#039;hecarim nemico al suo red (ricordati di conservare lo smite)\n\n&quot;Contro hard-matchup&quot;\nSe tu sei nella zona blu della mappa e il jungler nemico &egrave; un khazix (80% dei casi vince lui l&#039;1v1) tu dovrai cercare di evitarlo come la peste, il compito tuo &egrave; solo quello di stealargli la farm (dove sei sicuro che non verr&agrave;) quindi il khazix starter&agrave; 80% delle volte al blu in questo caso il suo buff si trover&agrave; bot, tu quindi starterai dal tuo di blue (top side) e una volta fatto andrai diretto al suo red e poi i suoi raptors, cos&igrave; lui si trover&agrave; met&agrave; giungla stealata e rimarr&agrave; behind gi&agrave; dal primo giro di giungla.\n\n&quot;Ganking in early&quot; (Tips in generale)\nCi sono vari modi per gankare una lane per moltissimi fattori:\n-Se la lane nemica sta pushando\n-Le summoners che il tuo laner/s e il nemico hanno\n-La kill potential\n-La pressure che dai alla lane ( a volte andare a gankare una lane sapendo che non ucciderete il nemico, &egrave; comunque una cosa buona perch&egrave; dar&agrave; un po di pressione alla lane)\n-Tuo laner/s skills cooldown e enemy skills cooldown ( se ad esempio uno zed ha usato la sua combo W+E+Q per harassare.. li &egrave; il momento giusto per andarci se non &egrave; troppo pushato, idem per una LeBlanc alleata che ha la sua W ed E in cd.. inutile gankare finch&egrave; sono in cd)\n\n&quot;Gankare con Nidalee&quot; (Combo e altro)\n\nLa combo perfetta sarebbe quella di sbucare dalla lane con la forma puma,fare una W per quel gapcloser in pi&ugrave;, andare in forma umana e NON LANCIARE SUBITO LA Q ma cominciare ad autoattaccare il nemico (se hai il red buff meglio ancora) questo perch&egrave; il nemico cercher&agrave; di dodgarti la spear e nel frattempo perder&agrave; tempo e tu gli avrai dato 3/4 AA free, poi gli lanci la spear (che non dovresti missare) e la combo dalla forma puma &egrave; W (per il gapcloser) E e in fine la Q.\n\nAltra combo &egrave; quella classica:\nCerchi di beccare la spear da tre km di distanza... se la becchi &egrave; easy kill con W+E+Q (puma forme) se vuoi puoi anche flashargli in faccia per dargli meno tempo di reagire e pensare a cosa fare.... oppure la puoi semplicemente missare la spear e tornare nella tua giungla a farmare.\n\nNIDALEE&#039;S TIPS:\n-Se il tuo laner ha un cc (tf gold card, xerath E) aspetta che la usino prima loro e poi lanciare la tua Q\n-SEMPRE MA SEMPRE USARE LA TUA W  (forma puma) MENTRE TI MUOVI IN GIRO PER LA MAPPA (questo &egrave; sicuramente uno dei consigli pi&ugrave; importanti,ossia quello di non sprecare l&#039;infinit&agrave; mobilit&agrave; di nida)\n-Usare sempre le trappoline e sopratutto ricordarsi che danno visione (anche se per poco)\n-Sfruttare al massimo il range della Q\n-Molti non sanno che la cura di Nidalee da anche attack speed.\n- Al livello 9 ricordatevi di prendere il trinket ROSSO!\n\nBuild:\nStandard build:\n{{item:1414}} {{item:3100}} {{item:3047}} /{{item:3111}} {{item:3174}} {{item:3151}} {{item:3135}} \n\nPreferisco la maschera al rabadon perch&egrave; alla fine i danni ce li hai e in genere sei contro tank con molti hp e aiuta avere la maschera. Con questa build arrivi anche a 40% cdr.. grazie alla lich baine,l&#039;athene e 10% cdr dalle rune.\n\nItems situazionali :\n1. {{item:3027}} {{item:3157}} {{item:3025}} {{item:3102}} {{item:3156}} (si non mi sono sbagliato a metterlo,ottimo contro katarina,kassa,lb e company)\n\nRiassunto generale:\n-Nidalee al momento insieme a tutti i suoi amichetti invaders assassins stanno diventando i nuovi di questa season (almeno per il momento)\n-Nidalee &egrave; uno di quei champion che se masterati diventa una macchina da free lp, se giocata male.. aim&egrave; sar&agrave; un 4v6, ma una volta imparata da molte soddisfazioni\n-Perma-invadete e cercate di fare 1v1 se il matchup in giungla &egrave; favorevole \n-Se il matchup &egrave; sfavorevole evitate di gli 1v1\n-Gankate per dare pressure al vostro laner o meglio ancora per uccidere ip nemico o fargli sprecare summs\n-In mid/late game il vostro compito &egrave; quello di caughtare qualcuno opure di flankare e cercare di pokare di Q.\n\nSpero che questa guida vi abbia aiutato o almeno dato idee su questo champion ;)\nSe avete dubbi e consigli commentate pure qua sotto.","replies":[{"poster":"Náos","date":"2017-11-12T19:19:49.446+0000","up_votes":1,"down_votes":0,"body":"Mi hai invogliato a provare!\nCome pulisco la giungla?","replies":[{"poster":"Mytlix","date":"2017-11-12T22:21:20.615+0000","up_votes":1,"down_votes":0,"body":"Ti consiglio {{item:1039}}  per i meno esperti perchè puoi andare anche di macete ma rischi di crepare ai raptors :)","replies":[]}]},{"poster":"ÐamnatioMemoriae","date":"2017-11-12T08:32:39.826+0000","up_votes":1,"down_votes":0,"body":"Bho.. io onestamente lo vedo come se un giocatore del \"sabato  calcetto\" facesse una guida per la serie A.\nNormal e Ranked sono due mondi a parte questa guida lascia il tempo che trova imo.\nTestala su almeno 50 game in ranked e rivedrò la mia opinione...\nIn normal io gioco quasi solo trollpick, ho 200 win sopra le lose; se facessi una guida per yasuo full tank o ekko mid buildato fullsupport dubito che qualcuno mi prenderebbe seriamente (e non dovrebbe).","replies":[{"poster":"Mytlix","date":"2017-11-12T09:27:31.204+0000","up_votes":1,"down_votes":0,"body":"Io sinceramente la vedo in un altro modo,almeno dal mio punto di vista e ti spiego il perchè:\nIo ho sempre giocato normals (penso di avere 5000 e passa games tra vinte e perse) anche se spesso trovi first time o champions con build discutibili ( questo di rado) ho comunque un mmr parecchio alto nelle normals,infatti di matchano minimo con 3 diamonds con e 3/4 diamonds contro.Cosa che se giocassi ranked (si,lo so che la gente le prende più sul serio) peró mi matcharebbero con 1/2 diamonds e resto plat alto.\nFinire con score tipo 16/3/12  9/2/8  23/6/8\nIn game di questo elo è abbastanza buono (almeno secondo me),poi alla fine TUTTO il kit di nidalee si basa sulla sua Q,in diamond penso che sappiano come dodgiare una spear e negarti praticamente tutto.\nComunque la giocheró in ranked giusto per provare la mia tesi.\n\nPs. 1/3 della guida e dei consigli mi sono trasmessi da \"tempest\" o meglio conosciuto come \"Apocalypse\" al momento il miglior Nidalee player nel EUW server.","replies":[]}]}]}