{"poster":"MayoFelix","date":"2017-07-13T10:59:00.924+0000","title":"Acc erst gehackt und dann perma bannt","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich wollte gestern bisschen lol spielen aber ich konnte mich nicht einloggen dann dachte ich mir ja gut dann chill ich noch mal nen bissle als ich mit meinen kumpel in discord geredet hab hat er mir gesagt das ich auf einmal online sei....\r\nDann habe ich den Blitzcranck support angeschrieben :D der hat mir auch sehr gut geholfen ich habe mein passwort ge&auml;ndert  das passwort von meiner e-mail und konnte mich wieder einloggen.\r\nDa war ich nat&uuml;rlich erstmal mega happy trzdm abgefuckt das ich &uuml;berhaupt gehackt wurde aber naja.\r\nDann hatte ich auf einmal 2600 Riot points ich dachte mir h&auml;&auml;&auml;&auml;&auml; woher ich habe gesehen das ich mir anscheinend Vi nicht gekauft habe obwohl ich lvl 3 fast 4 mit ihr bin. wusste da noch nicht das man champs zur&uuml;ck erstatten kann xD.\r\nIch habe mir von den Rest paar kisten gekauft und hatte zb ein leg&auml;nderen Trynda skin und paar andere sachen und auf einmal stand da  &quot;This Account has been permanently suspended&quot; Dann wurde ich richtig Toxic xD Joa Dann habe ich 9 stunden am st&uuml;ck versucht diesen super tollen  Riot Support zu schreiben blos riot schreibt nicht zur&uuml;ck joa und jetzt sitze ich hier 200 eure in das spiel reingesteckt wo ich jetzt gebannt wurde OHNE fckn Grund Danke Riot :(((((((((((\r\nbitte was soll ich jetzt tun???????? :DDDD﻿","replies":[{"poster":"legofreak1","date":"2017-07-13T11:08:45.307+0000","up_votes":2,"down_votes":0,"body":"Warte auf Antwort des Supports, dieser kann dir weitere Informationen liefern und bei deinem Problem helfen.\nDen Support mit Tickets zuzuspammen wird deinem Anliegen nicht mehr Gehör verschaffen sondern nur dafür sorgen, dass du weniger Beachtung und das absolute Minimum an Hilfe erhältst, das notwendig ist.","replies":[]},{"poster":"Kentus","date":"2017-07-13T16:35:39.829+0000","up_votes":1,"down_votes":0,"body":"Generell kann ich dir sagen das es ganz schön lange dauern kann bis der Support mal Antwortet(In der Regel 1-5 Tage) bzw.du deinen Account zurück hast, du musst zuerst ein ,,Formular'' ausfüllen wo sie Sachen wissen wollen wie z.b. deine ersten 5 EP-Einkäufe und deine IP-Adresse (WhatsMyIp). Außerdem ist es auch so das Spamen nichts bringt da dein Ticket immer wieder hinten in der Warteschlange eingereiht wird :). Ich empfehle dir außerdem dein PW nirgendswo weiterzugeben selbst wenn da steht dass es von Riot ist (spreche aus Erfahrung).\nMfg Kentus","replies":[]},{"poster":"MayoFelix","date":"2017-07-13T11:11:57.164+0000","up_votes":1,"down_votes":0,"body":"Ja danke :D","replies":[]}]}