{"poster":"ImKronk","date":"2017-11-02T17:36:21.348+0000","title":"Account Hacked","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hello\r\n\r\nThe account that i use to write this message is my smurf, and not the one that got hacked.\r\n\r\nSo recently one of my decided to quit LOL for a while (He's starting at Uni). So I thought it would be a shame to let an awesome account go to waste. I asked him, if I could lend the account, while he was studying, but he got a better plan. He gave me the account, and if he ever wanted to play, he just had to tell me first.\r\n\r\nSo i get the account's email changed to mine, and changed to password, just for good protection. After this was done, I went on to take a few games before bed.\r\n\r\nNext day while i'm in school, I receive an email about password reset and thought it was just my friend doing a prank on me, so I just ignored it. So I get home, and the squad is ready to play, only problem is, I don't have access to my account anymore... \r\nMy first thought was my friend, but he hadn't told him the password, or the password to my email account.\r\n\r\nIn panic, I go to LOL's homepage -> Forgot Password -> But didn't receive a mail, so I tried checking, if the account was still linked to my friends or my mail, but it's not. Tried to Forgot username -> Enter Email -> And could see, that the account isn't linked anymore. So email associated to my main account got changed too.\r\n\r\nI have contacted Support, but haven't heard anything... What should i do?","replies":[{"poster":"Porocles","date":"2017-11-02T18:42:21.581+0000","up_votes":1,"down_votes":0,"body":"I know the intentions here weren't to be harmful, but we don't support account sharing  or trading, cases like this being one reason why.  The best outcome of this would be for your friend, the original owner, to reach out and recover his account.  Have him fill out an [account recovery form](https://support.riotgames.com/hc/en-us/requests/new?ticket_form_id=72416) and our account team can look into the possibility, but continuing to use an account not belonging to you will only cause issues not just from unauthorized access but a likely suspension.","replies":[{"poster":"ImKronk","date":"2017-11-02T19:36:19.629+0000","up_votes":1,"down_votes":0,"body":"We know your policy, and that's why we wasn't sure, if we could contact support.\nMy friend filled an account recovery form yesterday, but he haven't received anything.\n\nDon't worry, from now on, I'll just keep playing on my own.","replies":[]}]}]}