{"poster":"Sega playbox 64","date":"2015-01-15T11:35:16.723+0000","title":"Sweetheart Annie skin, New particles please","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"So was just looking over in the PBE boards (which I can't comment in apparently) and just wanted to throw my 2 cents in about giving her new particles. would much rather pay 975rp for Sweetheart annie with appropriate particles and new recall animation than pay 750 rp for an awesome skin that feels unfinished. Heartseeker ashe got awesome matching particles and recall, would be nice to see that on  Sweetheart Annie. i personally feel her base particles clash harshly with her colour scheme and would rather put out a little extra cash than see her shipped with clashing particles and without a personallized recall.","replies":[{"poster":"Monkey D Luffy","date":"2015-01-15T11:45:10.050+0000","up_votes":2,"down_votes":0,"body":"because we needed another annie skin","replies":[]},{"poster":"TotesNotAnnie","date":"2015-01-31T12:05:30.181+0000","up_votes":1,"down_votes":0,"body":"I agree with this! I was so disappointed since the particles and stuff are all the same :/","replies":[]},{"poster":"idc","date":"2015-01-15T23:56:43.292+0000","up_votes":1,"down_votes":0,"body":"Exactly my thoughts when I saw the video on the PBE. I was expecting some heart-shaped particles, but instead it just looks like her regular skins.","replies":[]},{"poster":"Ingénue","date":"2015-01-15T20:26:24.336+0000","up_votes":1,"down_votes":0,"body":"Omg, her Q could be a little pink flame heart and her fire could all be pink ♥","replies":[]},{"poster":"Sega playbox 64","date":"2015-01-15T11:54:00.965+0000","up_votes":1,"down_votes":0,"body":"ofcourse!","replies":[]},{"poster":"Sega playbox 64","date":"2015-01-15T11:43:49.213+0000","up_votes":1,"down_votes":0,"body":"it's possible, nearly every comment in her feed back section on PBE boards is asking for it, also its actually not possible to buy 750 worth of rp anyway so people who can buy it can afford it at either price unless they are sitting on a small chunk of RP anyway. im not against them making 750 rp skins, but i'd rather it wasn't a once a year valentine type skin that they skimped on, that goes doubly as it is an annie skin","replies":[]},{"poster":"Niji","date":"2015-01-15T11:39:15.108+0000","up_votes":1,"down_votes":0,"body":"I think the issue here is that Riot wants to do 750rp skins fairly often now because they want people with less money/rp to still be able to enjoy skins personally I'd love it to have pink flames etc but I don't think it's likely to change.","replies":[]}]}