{"poster":"Kasher","date":"2016-03-07T12:28:02.531+0000","title":"Reporting without a Chat Log","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"So this isn&#039;t meant to be a name and shame rant- just looking for some clarification. Basically, I was in a ranked game earlier this evening, and everything seemed to be going fine, we were ahead in objectives, generally going well. However, just as it seemed like we had this one in the bag, one player started to intentionally make themselves useless, deliberately running in 1v4, always being on the complete opposite side of the map to where teammates needed him (we asked him to cooperate in chat, they were definitely doing this on purpose). To me, this is such an obvious example of someone who queued up in ranked just to ruin someone else&#039;s game, but they never spoke in chat- not once from champ select to ending screen. I know at least the 4 other players on my team reported him, but seeing as he said nothing in chat, is there any hope at all of him being disciplined? This guy was a troll to the fullest extent, he just did it without leaving evidence in chat. \r\n\r\nAlso, players of the enemy team were congratulating him and refusing to report because he gave them a free win, is this really the attitude of people in the community, that someone is not deserving of a report because their trolling was in your favour?","replies":[{"poster":"Ingénue","date":"2016-03-07T23:10:13.392+0000","up_votes":1,"down_votes":1,"body":"Unfortunately, some players throw like this quite often. In one of my placements games, we were super ahead but our kha'zix kept trying to 1v5 because his ego became to big. We lost the game as a result :(\n\nIn terms of reporting without a chat log, it depends on what you report them under. In case of the teemo, I would report under [Negative attitude, and maybe intentionally feeding (idk, wasn't in the game).](http://3.bp.blogspot.com/-JCwL8706qZk/ViAdgsIzgoI/AAAAAAAAy20/uibMA7oozLo/s1600/n2BJwC2.png)\n\nEven if you don't send in a support ticket, they will still face punishment for their actions. But bear in mind that leaving detailed descriptions with your reports is especially important. Sending in a support ticket in cases like these is usually only beneficial if you have more information to include, such as recordings/screenshots/more words that don't fit into the post-game report.  \n\nHis match history doesn't look suspicious to me at all, it just looks like he is bad (like many low elo players).\n> I had a friend who hit 30 and went straight into ranked, went 0/15 every game, built ROA on jinx, and couldn't tell which champs were going where (she picked yorick and had to play him adc once because she thought top was free haha). She placed silver 4 in her placements because people carried her. She wasn't intentionally feeding, or intentionally trolling, she just REALLY sucked at the game.\n\nMaybe the teemo is the same. \n\nIn any case, it does suck to have these kinds of players on your team. If you [create/join a premade 5 dynamic queue](http://boards.oce.leagueoflegends.com/en/c/team-recruitment), you wont have to put up with them :D You will have less toxicity, more communication, and more fun ♥.","replies":[{"poster":"Toxic Shaco","date":"2016-03-23T12:09:42.021+0000","up_votes":1,"down_votes":0,"body":"> In any case, it does suck to have these kinds of players on your team. If you create/join a premade 5 dynamic queue, you wont have to put up with them :D You will have less toxicity, more communication, and more fun ♥.\n\n\nAnd this way you face another 5 premade, and get all the benefits of having coordinated enemies.","replies":[{"poster":"Ingénue","date":"2016-03-23T23:12:19.786+0000","up_votes":1,"down_votes":1,"body":"Its better to face co-ordinated enemies than have a bunch of afks/feeders/potatoes on your team ♥","replies":[]}]}]},{"poster":"Yasei Doubutsu","date":"2016-03-07T12:57:55.412+0000","up_votes":1,"down_votes":0,"body":"Im assuming you meant your temmo last game.\nWas he \"Support\" or you, I cant tell.\nI think he was, since you are the only logical mid.\nAnd he has frost queens.\n\nWell he could just be a very bad player.\nIve seen plenty of bronze \"Supports\" not buy any wards or buy a sight-stone.\nOr just refuse to act like a support as they did not get there role.\n(Which doesn't make sense as Dynamic Q negates that now.)\n\nOr if you somehow where the support, then the same thing applies, but I doubt that as you had a vision ward.\n\n--\n\nI looked into that teemo for you.\nAnd hes silver? Somehow.\nNot 1 champion lvl 4, closest being lvl 3 with Blitz and 2 with Garren and Malphite.\n175 Normal wins.\n(This is starting to look extremely dodgy)\nAaaand woah.\nHis match history is not good, in fact is really weird.\nthis guy is a really, really bad player. Based on his constant feeding score, and his item bulids.\n\nHes even completly afk'ed a game.\n****\n(*Rioter or some other Admin remove if I accidentally violated some rules*)\nHis champions and skill completely changes the further you go down the list.\nI believe this guy has either Bought hit account from the many Bots that roam the Co-Op VS AI scene\n(Which is still a huge freaking problem)\nOr gotten boosted. More then likely bought.\n\nSend a support ticket to riot, and tell them you believe this guy has bought his account.\nIt seems someone who actually had the skill/Knowledge got an account to LVL 30 and got it into Silver, then sold it to a bronzie who couldn't climb.\nBut since he is bad he will eventually fall into bronze again.\n\nRiot wont tell you if they do something however, which kinda sucks.\nBut looking through this guy makes me believe hes account was bought.\n\n------------------------\n\nYou get guys like this, all you can do is keep playing and push past them.\n\nGood Luck Have Fun.\nFrom your humble Acolyte Of Shurima!","replies":[{"poster":"Ingénue","date":"2016-03-07T22:20:53.582+0000","up_votes":1,"down_votes":0,"body":"not part of the mod squad but you're going to have to remove:\n\n>Hes even completly afk'ed a game.\n<<match history link>>\n(Rioter or some other Admin remove if I accidentally violated some rules).","replies":[]},{"poster":"Kasher","date":"2016-03-07T13:21:30.805+0000","up_votes":0,"down_votes":0,"body":"Thanks for that detailed response. Yep he was support, I actually queued as support/fill and got mid (what are the chances?), it was a very weird situation as it appeared that he was trolling hard but maybe he was just so bad at the game that it looked that way-  we are in bronze so I'm not expecting anything godtier but seriously anyone who has played enough games to reach lvl 30 should have some basic knowledge.\nI hadn't looked into his match history yet but you raise an interesting point.  I wasn't necessarily trying to complain about having a troll in a game, because yes it happens and there isn't a lot anyone can do about it, it was more a case of wondering if us reporting him can achieve anything at all since there was no chat log and to be honest it seems highly unlikely that a real person (that has power to dish out punishments) will read report descriptions, and/or look into his match history as you just did. \n\nFor what it's worth I'll try sending a ticket in, hopefully this guy can't keep going on making other people have a bad time.","replies":[]}]}]}