{"poster":"Sash903","date":"2016-03-05T05:38:34.977+0000","title":"Porque la comunidad de LAS es tan toxica","subforum":"Comportamiento del jugador","up_votes":5,"down_votes":1,"body":"Bueno mi respuesta es simple, no es la culpa de RIOT si no mas bien de la comunidad en si que no utiliza el sistema de reporte, entonces los jugadores que son toxico nunca son baneados ni reportados ( me refiero a una peque&ntilde;a porcion).\r\n\r\nQuisiera saber cual es su opinion al respecto.","replies":[{"poster":"reboxer","date":"2016-03-05T06:07:40.823+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Aephis","date":"2016-03-05T14:18:22.527+0000","up_votes":5,"down_votes":0,"body":"Falso.\n\nSi el reporte es \"porque si\" no te sancionan JAMAS. En todo lo que tiene el servidor LAS de vida, cada vez que alguien dice ser baneado por ganas nada mas, su tema termina siendo respondido por alguien del area de sanciones mostrando un log chat con tantos insultos que podrias sacar un nuevo libro luna de pluton","replies":[]}]},{"poster":"DFX PimpFlaco","date":"2016-03-05T09:09:28.322+0000","up_votes":1,"down_votes":3,"body":"Por que a los argentinos ya de por si somos tóxicos , no todos , pero la mayoría , los chilenos que no nos quieren y nosotros igual , hay flameo , y así con todos los países.  No todos pero al ser un juego online cada uno quiere dejar bien parado a su país y bueno , una cosa lleva a la otra , y no pasa acá en todo el mundo , tenes a la persona que llega al otro punto que le decís algo y ya pide report y todo y así se genera una bola de nieve que va creciendo y bueno","replies":[{"poster":"Hugarto","date":"2016-03-05T12:39:28.768+0000","up_votes":4,"down_votes":0,"body":"Yo he visto muchos más chilenos tóxicos que argentinos, ustedes suelen ir más en broma. Eso si, cuando uno es tóxico es TÓXICO así con mayúsculas.","replies":[{"poster":"Aephis","date":"2016-03-05T14:16:11.841+0000","up_votes":4,"down_votes":0,"body":"Totalmente de acuerdo, sin animo de generalizar veo muchisima mas gente de Chile ser toxica que gente de argentina. No soy de ninguno de los dos paises y creo que estoy hablando lo mas imparcial posible. \n\nSupongo que esto es mas un habito en los jugadores de LoL en Chile que en el resto de los lugares. NO estoy generalizando. Conozco gente muy agradable en Chile tambien, pero si es bastante notable el tema. En Argentina me pasa como tambien dices, son mas cosas en broma que con intencion de agredir. Pero de igual manera cuando te toca un argentino con un mal dia pues vaya que si saben como ser toxicos xD","replies":[]},{"poster":"DFX PimpFlaco","date":"2016-03-05T17:50:25.970+0000","up_votes":1,"down_votes":0,"body":"Si , nosotros todo le agarramos humor y risa , el chileno se enoja y se enoja","replies":[]},{"poster":"KerneI panic","date":"2016-03-05T16:55:02.549+0000","up_votes":1,"down_votes":0,"body":"yo mas bien eh visto que los chilenos (ratas) te siguen toda la partida esperando ver errores y joderte por eso, incluyendo errores ortograficos. los argentinos te putean hasta donde les llegue el lenguaje, por robar posicion ofarm, por flamear o morir","replies":[]}]}]},{"poster":"Zevko","date":"2016-03-05T06:46:28.894+0000","up_votes":3,"down_votes":2,"body":"Te explico, Las es uno de los servidores con menos nivel > eso lleva a muchos 0-30 > la gente los insulta por ir 0-30, todo exagerando e.e. espero haberme explicado.","replies":[{"poster":"The Fall of Troy","date":"2016-03-06T05:39:31.523+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tziiah,realm=LAS,application-id=PJAKt7ph,discussion-id=RiLkEBEj,comment-id=0001,timestamp=2016-03-05T06:46:28.894+0000)\n>\n> Te explico, Las es uno de los servidores con menos nivel > eso lleva a muchos 0-30 > la gente los insulta por ir 0-30, todo exagerando e.e. espero haberme explicado.\n\nuna biblia resumida en 1 lineas,+1","replies":[]},{"poster":"NGreppi","date":"2016-03-05T19:18:36.450+0000","up_votes":1,"down_votes":0,"body":"El nivel de Las de diamante 3 para abajo es exactamente igual al de todos los otros servers, te lo digo porque jugue en Br y Na, los lowelo somos igual de malos en todos los servers.","replies":[]}]},{"poster":"resnov15","date":"2016-03-05T14:47:27.901+0000","up_votes":2,"down_votes":1,"body":"Que negativo eres {{champion:63}}","replies":[]},{"poster":"Exit","date":"2016-03-14T00:29:51.170+0000","up_votes":1,"down_votes":0,"body":"pasa por cada uno tambien, pero como casi no banean la gente hace lo lo que quiere.. saludos","replies":[]},{"poster":"juanda357","date":"2016-03-05T19:35:01.160+0000","up_votes":1,"down_votes":0,"body":"No todos deverian ser toxicos es decir soy de las y no flameo.... aunque sea main suppb {{summoner:13}}","replies":[]},{"poster":"Cerebellum","date":"2016-03-05T17:49:46.526+0000","up_votes":1,"down_votes":0,"body":"Se trata sobre los valores de los jugadores, nada mas que eso. Da igual si es un niño o una persona grande si esta bien educada no va a por que tener que insultar, el gran problema es que las personas no saben como decir las cosas o algún error, entonces el otro se calienta y no se ponen en el lugar del otro... Ami lo que me da bronca son las personas que no saben los significados de tal palabra y la viven usando como \"troll \" El día que entiendan que no pueden reportar a cualquier jugador e insultar por que simplemente el jugador contrario es mejor en la linea el lol va ser un juego donde no haya una comunidad tan rata, pero no tienen la cabeza plagada de que si 1 muere en una linea es un \"TROLL \" aver flaco PERDER NO ES SER TROLL PERDER ES PARTE DE LA VIDA COMO GANAR , HAY VECES QUE HAY ENEMIGOS MEJORES... SER TROLL ES OTRA COSA APRENDETE LA DEFINICION","replies":[]},{"poster":"KerneI panic","date":"2016-03-05T16:59:32.588+0000","up_votes":1,"down_votes":0,"body":"muchas ratas, cuando no habia server y jugabamos en NA era HERMOSO encontrarse con uno que hablara español, jamas encontre alguien de 12 años que te flameara por dar primera sangre o no gankear o decir que deberia armarse, ahora que el juego se popularizo estos niños llenan le server de flamerias y bobadas por el estilo, el juego deberia hacerse solo para mayores de 16, chao la mayoria de las ratas toxicas","replies":[{"poster":"Pianist Fantasy","date":"2016-03-05T17:29:34.850+0000","up_votes":1,"down_votes":0,"body":"Estás diciendo que todos los menores de 16 años son flamers y ragers, eso no es justo, al igual que te puedes encontrar niños que flamean, también te puedes encontrar otros que juegan tranquilamente, niños como yo, que no empecé en este server, sino en EUW, y no te lo voy a negar, está plagado de ratas de todas, repito, TODAS LAS EDADES, de 12 a 21, incluso los platinos son más maleducados que un niño de 13 años, hagase un ejemplo, el cual sería yo.\nNo tiene que ver con la edad, sino con la inmadurez de cada jugador.","replies":[]}]},{"poster":"Warshen","date":"2016-03-05T07:48:48.404+0000","up_votes":1,"down_votes":0,"body":"Todas las comunidades son demasiado toxicas, algunas son un poco mas o un poco menos, pero todas son toxicas.","replies":[]}]}