{"poster":"Azawi93","date":"2015-12-01T17:13:58.327+0000","title":"Kein Rahmen !!!","subforum":"Hilfe & Support","up_votes":0,"down_votes":6,"body":"Hey also ich wollte einfach mal Nachfragen ... Ich habe in der letzen Season platin 4 erreicht habe aber dennoch keinen Rahmen wenn ich Spiele weder Gold wie in der Season davor noch Platin...\r\nIch wei&szlig; das ich einen bann wegen flamen bekommen habe, find ich &uuml;brigens &uuml;bertrieben da es weitaus schlimmere leute in league gibt die aber anscheinend nie &auml;rger bekommen :D\r\nDennoch find ich es eine Frechheit mir den Rahmen zu nehmen... Ich habe viel Zeit und Energie in das Spiel gesteckt um mein Ziel Platin zu werden zu erreichen und dann sehe ich das ich trotz dem erreichten Ziel nicht die belohnung daf&uuml;r bekomme...\r\nIch w&uuml;rde gerne meinen Rahmen haben .. ich zahle f&uuml;r skins spiele stunden um stunden und wei&szlig; das ich kein engel bin, ich brauche auch keinen viktorious skin als belohnung oder sonstiges aber den Rahmen wegnehmen ist echt mie&szlig;..\r\nHoffe bekomme eine Antwort \r\nLiebe gr&uuml;&szlig;e, Azawi","replies":[{"poster":"Blurm","date":"2015-12-01T17:30:36.482+0000","up_votes":2,"down_votes":0,"body":"Strafe ist Strafe, Punkt.\n\nPS:\n\n>ich zahle für skins\n\nKeine Bevorzugung :P","replies":[]},{"poster":"Kaladien","date":"2017-11-14T16:23:41.501+0000","up_votes":1,"down_votes":0,"body":"Hallo leute ich habe diese season mit Silber 4 solo dou beendet,dennoch habe ich keinen rahmen und keine icons erhalten. Ich wurde nicht gebannt oder so. mein premade hat heute seinen silber rahmen erhalten und darauf hin habe ich nochmal auf meinem acc gekuckt aber ich habe den Rahmen immer noch nicht bekommen . Warum? Danke für die Antwort","replies":[]},{"poster":"Azawi93","date":"2015-12-01T17:39:59.873+0000","up_votes":1,"down_votes":0,"body":"Trotzdem meiner meinung nach lächerlich ich hab 1nen bann bekommen und dann sowas zu machen dann lieber chat sperre für 500 games als so nen mist spiele ich halt einfach nimmer gibt genug anderes :D","replies":[{"poster":"Blurm","date":"2015-12-01T17:59:20.058+0000","up_votes":1,"down_votes":0,"body":"Lustig wenn du wegen den Rahmen mit LoL aufhören willst. Aber Reisende soll man nicht aufhalten :D","replies":[]}]},{"poster":"Living Tempest","date":"2015-12-01T17:34:29.296+0000","up_votes":1,"down_votes":0,"body":"Ich weiß nicht genau worauf du eine Antwort möchtest.\nWas ist deine Frage?","replies":[]},{"poster":"Call me Br00t","date":"2015-12-01T17:34:06.302+0000","up_votes":1,"down_votes":0,"body":"hast ganz einfach gelitten, hast den abg´s zugestimmt und damit kann riot eig mit deinem acc machen was sie wollen und auch ebend solche strafen verteilen","replies":[]}]}