{"poster":"ddjed","date":"2015-03-16T16:23:17.081+0000","title":"op.gg e replay che non parte.","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Ieri ho trovato per caso il pulsante \"recorder\" su op.gg, ho letto un po' come funziona e poi l'ho premuto (ero sempre nella schermata di caricamento). Faccio la mia partita e, alla fine, clicco per scaricare il piccolo file .bat.  Tutto ok, se non che dopo 3 minuti di attesa mi viene scritto \"Richiesta dati server per spettatori non riuscita. Abbandono della partita.\" Ho letto un po' in giro, e alcuni dicono che si risolve rinominando in maiuscolo la cartella \"rads\". Ebbene, a me non funziona lo stesso :( \r\nAltri giocatori hanno avuto il mio stesso problema?","replies":[{"poster":"Ryuk1980","date":"2015-03-18T08:36:31.054+0000","up_votes":2,"down_votes":0,"body":"su chrome blocca il file... e se lo scarico nemmeno windows lo avvia (scatta la protezione su windows 8). Ho scaricato il file bat e l'ho aperto e ho visto che fa delle modifiche sul registro di sistema. Sinceramente non capisco perchè un file di replay deve andare a modificare chiavi di registro di sistema....L'ho eliminato e i replay me li registro con LSI.","replies":[{"poster":"ddjed","date":"2015-03-18T15:41:33.168+0000","up_votes":1,"down_votes":0,"body":"Effettivamente neanche io lo capisco; ad un mio amico ha fatto andare in palla il sistema operativo e dovrà comprarne uno nuovo. Dopo che l'ho saputo ho rinunciato anch'io (Y)","replies":[{"poster":"vlakius","date":"2015-03-18T19:29:33.679+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ddjed,realm=EUW,application-id=MJVj50Jw,discussion-id=cuKVJolI,comment-id=00010000,timestamp=2015-03-18T15:41:33.168+0000)\n>\n> Effettivamente neanche io lo capisco; ad un mio amico ha fatto andare in palla il sistema operativo e dovrà comprarne uno nuovo. Dopo che l'ho saputo ho rinunciato anch'io (Y)\n\nNn è necessario un nuovo sistema operativo basta fare un repair del registro, o dei file system oppure al limite un ripristino di quello attuale.\n\nComunque stesso problema anche io, ormai ci ho rinunciato con op gg","replies":[{"poster":"ddjed","date":"2015-03-18T19:55:50.228+0000","up_votes":1,"down_votes":0,"body":"No, è che questo mio amico aveva il sistema crackato, diciamo che ha colto l'occasione per prenderne uno nuovo e originale xD","replies":[]}]}]}]},{"poster":"All In or GTFO","date":"2015-03-18T02:51:19.334+0000","up_votes":2,"down_votes":0,"body":"Stesso problema, up","replies":[]},{"poster":"Giaghy","date":"2016-01-30T02:58:24.146+0000","up_votes":1,"down_votes":0,"body":"idem.. non riesco a far partire  il replay  e mi fa comparire il  \" error report bugsplat\"","replies":[]}]}