{"poster":"PachekitoElCarry","date":"2019-02-20T12:03:36.942+0000","title":"¿Me dan razones para seguir?","subforum":"Charlas Generales","up_votes":8,"down_votes":2,"body":"Llevo jugando este juego desde el 2013 y lo he abandonado en 2 ocasiones. \r\nLa primera vez fue porque no tenia mucho tiempo para jugar.  Y la segunda porque mi pc se murió . Pero cuando los problemas se solucionaban volvía.\r\n\r\nLlegué a platino y me mantuve por 2 años.  Ahora estoy en plata 2,  frustrado, porque gano 1 de cada 10 rankeds. Y es porque me tocan con gente que no sabe que hacer en su linea o directamente trollean o se van afk .\r\nTodo emepezó cuando perdí mi promo a ORO 4 , gané 2 de 5 . Y desde ahí no he parado de perder , como dije antes, estoy en plata 2 . \r\nNo los puedo carrear , voy adc (mi linea main) y el jungla es un \"salame\" con todas las letras, no lo culpo es plata, pero no es posible que el jungla contrario sea mil veces superior que el mio, lo mismo pasa con las demás lineas , mid y top  . Cuando voy JG( mi 2da linea main) directamente la bot queda denegada totalmente. Fedean y mucho , yo no puedo hacer nada, divean a niveles bajos o el jg enemigo les hace un hijo. Priorizo objetivos . Por lo general me hago el dragón antes del nivel 6. Casi siempre me los hago , no se lo esperan xD. Me hago un gankeito cuando veo la oportunidad y termino perdiendo . \r\nDe última probé de SUPP y más de lo mismo .\r\n\r\nYa no sé que hacer , no puedo jugar sin tiltearme , antes cuando me tilteaba en una partida me ponía a escuchar música , pero ya no funciona , me enojo y mucho. (No me pongo a flamear , pero siento que se me explota una bola cada vez que veo que mi team se desvanece a medida que transcurre el game)\r\nEstoy pensando en dejar el LoL por un tiempo, aprox 1 año o 2 . Pero no quiero hacerlo.\r\n\r\n¿Me dan razones para quedarme y seguir perdiendo partidas pero con una sonrisa en la cara como mínimo? \r\nDesde ya muchas gracias por su atención.{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"prof4","date":"2019-02-20T21:37:48.429+0000","up_votes":2,"down_votes":0,"body":"Hola hermano te soy sincero me pasa lo mismo te quiero dar una explicación básica de que lo entiendo de porque pasa eso en sencillas palabras hay un \"vacío\" de elo en plata esto produce que los jugadores buenos encontrados en plata tiene muy poco win rate es producido por un círculo caes a plata ganas un par perdes 1 y automáticamente caes en el espiral seguís perdiendo porque te toca con gente de bajo elo pco win rate que no ganan por falta de práctica o habilidad y vos caes con ellos entonces perdes una y otra vez al Punto de no poder subir , eso sumado a los elobooster gente que no sabe jugar pero la suben a plata y bueno le cagan las partidas , trolls , afks ,3 opciones deja el lol ( como yo hice ) ,2\nSeguí jugando hasta que te toque gente de habilidad media al Punto de llegar a ganar ahí subirás tu elo y empezarás a ganar varias partidas seguidas o perde partidas hasta bajar de división ( no aproposito si no que juga sin tiltearte y si ganas ganas si no bueno lo intentaste  ) y cuando bajes de liga a plata 4 vas a tener un elo superior a tu liga o el elo correcto a tu liga y ahí empezá a subir de nuevo espero que te sea de ayuda y me haya sabido explicar","replies":[]},{"poster":"Cyanide Boy","date":"2019-02-20T17:25:25.849+0000","up_votes":2,"down_votes":0,"body":"Mira amigo, a mí me pasó lo mismo el año pasado y logré llegar a Oro no sé ni cómo. Ganaba una perdía 2, osea perdía más LP de lo que ganaba. Pero empecé a jugar mi partida, sin preocuparme por lo que me digan ni cómo jueguen. Siendo Main jg te doy mi consejo, si podés mainea este rol, dicen que está nerfeada pero al fin y al cabo es la única línea que carrea sola. \nPrioriza la victoria de tus líneas, no te hagas dragón antes de minuto 10, a menos que tengas muy clara la jugada, si hay dragón importante, jugar por bot; si el top puede snowballear, jugar por top e intenta sacar el heraldo CON TU TOP. Vos intenta que tu equipo juegue con vos, no vos con ellos. No sé si me explique bien pero es mi mejor consejo siendo que pase por lo mismo que vos. Suerte en esas rankeds.","replies":[]},{"poster":"Mashirando","date":"2019-02-20T17:10:37.468+0000","up_votes":2,"down_votes":0,"body":"Ya casi termina verano, ahora es cuando esos niños que los padres les permitían jugar poco y nada al League Of Legends, juegan (me refiero a todo el transcurso del verano), ahora que se termina, vuelven a clases y quizás, solo quizás, bajan los trolls, afks y otras weas. No sé, de mí opinión no juego rankeds así que ni idea, y si lo hago es porque ya varios amigos juegan y me invitan, hasta incluso me invitaron para torneos por RP sjsjsjsisjs. Pero simplemente no tengo las suficientes ganas de jugar rankeds. Suerte owo","replies":[]},{"poster":"REXPAT","date":"2019-02-20T12:35:54.412+0000","up_votes":2,"down_votes":0,"body":"hmmmm.... Si juegas muchas partidas rankeds al día te recomiendo que cambies la mitad de esas partidas por Arams. Comienza el día jugando 1 o 2 arams y luego juega rankeds. No cometas el error de cambiarte de linea a una que no tienes tanta experiencia sino seguirás perdiendo mas y mas.\nTe pongo un ejemplo: Yo la season pasada llegue hasta Platino II y luego comencé a perder, perder y perder hasta que llegué a Oro 3. Luego me propuse a mi mismo jugar un máximo de 2 o 3 rankeds por día (Total no hay apuro) de a poco fui subiendo hasta llegar a Platino III. Ahora me toca de nuevo el viaje desde Oro I.\n\nBusca otras alternativas de juegos (Si tu pc te lo permite) como el GTA, WatchDogs o que se yo, cualquier juego que te llame la atención. Pero por sobre todo NO juegues muchas rankeds al día sabiendo que puedes perder mas. Sé que la tentación es grande cuando uno gana una ranked y dice \"ya una mas y listo\" y terminas por perder todo lo que avanzaste.\n\nSuerte y no te des por vencido.\n\n{{sticker:sg-ezreal}}","replies":[]},{"poster":"Šeiya","date":"2019-02-20T12:41:26.324+0000","up_votes":3,"down_votes":1,"body":"Jugá con amigos, si no tenes ninguno que juegue, unite a un club y conocé gente ahí, si sos otp o tenes un pj main que usas mucho podes unirte a un club hecho para gente que mainea lo mismo que vos y ahí conoces gente con la que ya tenes algo en comun y que de paso te pueden ayudar a mejorar, saludos.","replies":[]},{"poster":"HopelessRomantic","date":"2019-02-20T12:18:09.808+0000","up_votes":3,"down_votes":1,"body":"No juegues si estás tilteado. Vas a seguir tilteado aún cuando ganás tu próxima partida. Tomate un descanso. Dejá el LoL por algunos días, relajate, y vas a volver como nuevo. La temporada pasada estaba en promo a Master y bajé a D3 por jugar tilteado. Ni te cuento del pase que compré y casi no jugué durante su duración por el tilt tremendo.\n\nMi experiencia con elos bajos es que si uno quiere subir, tiene que levantar el peso de al menos 2-3 personas porque casi siempre va a tocarte un \"feeder\" en el equipo, ni te hablo de la cantidad de afkers.\n\nSi querés mirate algunas guías(videos) de este sitio. Personalmente las encuentro extremadamente informativas. https://www.youtube.com/user/SkillCappedDotNet/videos","replies":[{"poster":"Fízz","date":"2019-02-20T12:55:19.884+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jaethal,realm=LAS,application-id=v7qsfXsE,discussion-id=PaQm7AZE,comment-id=0001,timestamp=2019-02-20T12:18:09.808+0000)\n>\n> No juegues si estás tilteado. Vas a seguir tilteado aún cuando ganás tu próxima partida. Tomate un descanso. Dejá el LoL por algunos días, relajate, y vas a volver como nuevo. La temporada pasada estaba en promo a Master y bajé a D3 por jugar tilteado. Ni te cuento del pase que compré y casi no jugué durante su duración por el tilt tremendo.\n> \n> Mi experiencia con elos bajos es que si uno quiere subir, tiene que levantar el peso de al menos 2-3 personas porque casi siempre va a tocarte un &quot;feeder&quot; en el equipo, ni te hablo de la cantidad de afkers.\n> \n> Si querés mirate algunas guías(videos) de este sitio. Personalmente las encuentro extremadamente informativas. https://www.youtube.com/user/SkillCappedDotNet/videos\n\njajaja ami me pasoi algo parecido pasando a platino, subi a plat 4 y luego me empezaron a tocar puros trolls asique tuve que volver a hacer la promo de oro 1 a plat 5 como 7 veces antes de volver a subir","replies":[{"poster":"HopelessRomantic","date":"2019-02-20T14:04:08.535+0000","up_votes":1,"down_votes":0,"body":"En mi caso yo mismo era el que estaba jugando mal por lo tilteado que estaba. En muchas ocasiones me tocaron 4 jugadores decentes, y no pude aportar casi nada, y en ocasiones hasta fedeé.","replies":[]}]}]},{"poster":"Diegotg2","date":"2019-02-20T12:15:39.063+0000","up_votes":3,"down_votes":1,"body":"Amigo si no disfruta jugar, entonces no juegue, a mi me gusta mucho el juego, veo mucho competitivo e intento mejorar siempre que juego jugando lo mas concentrado posible, a pesar de que soy manquisimo en el microjuego.\n\nMi punto es, ESTE ES UN JUEGO, SI NO LO DISFRUTAS NO JUEGUES","replies":[{"poster":"anelaur","date":"2019-05-02T04:36:28.154+0000","up_votes":1,"down_votes":0,"body":"pero miren lo que dice si te toca una ashe que termina 1/11 vas a disfrutar la partids? siendo suport tildea sabias","replies":[]}]},{"poster":"Lecaps o Lebacs","date":"2019-02-20T21:14:58.459+0000","up_votes":1,"down_votes":0,"body":"Ninguna. Déjalo, no se merece tu tiempo","replies":[]},{"poster":"Treant del DOTA","date":"2019-02-20T17:21:11.539+0000","up_votes":1,"down_votes":0,"body":"No juegues más.","replies":[]},{"poster":"Hi Im  Zonda","date":"2019-02-20T16:33:07.886+0000","up_votes":1,"down_votes":0,"body":"Deja de perder tiempo como yo en este juego desinstala y estudia algo que el día de mañana te va a servir mucho más salu2","replies":[]},{"poster":"DavowO","date":"2019-02-20T16:25:29.283+0000","up_votes":1,"down_votes":0,"body":"Pasa que si seguís jugando cuando no te bancás jugar lo vas a transformar en rutina. Yo te diría que te tomes un tiempo y que pruebes otros juegos mientras, o jugar pero con amigos. Yo por ejemplo no juego solo, me aburro y me frustro fácil cuando se pierde una partida ganada, asi que si voy a perder 40 minutos de mi vida jugando LoL prefiero hacerlo con amigos y si pierdo al menos nos reímos.\n{{sticker:sg-ahri-2}}","replies":[]},{"poster":"Family Friendly","date":"2019-02-20T15:50:04.687+0000","up_votes":1,"down_votes":0,"body":"Entiendo eso, yo estoy intentando subir y hace poco me saltearon de division al parecer, termine las placement en oro 4, rankie a promo y pum oro 2, pense que mi elo estaria bien pero me equivoque, la gente que sale a veces es un asco. Una vez te tiltees no juegues busca otra cosa para hacer almenos hasta que te calmes porque va a ser mucho peor jugar asi, proba usar campeones que no hayas usado o alguna build rara y busca un club con gente activa para que puedan jugar juntos.","replies":[]},{"poster":"zhukulento2","date":"2019-02-20T15:00:11.547+0000","up_votes":1,"down_votes":0,"body":"Sin tilt puedes jugar tranqui xD. Tranquilo mano que no es para desesperarse. Saludos de Perú ;v \n{{sticker:draven-pose}}","replies":[]},{"poster":"Mini Kha Zix","date":"2019-02-20T14:37:26.135+0000","up_votes":1,"down_votes":0,"body":"Create una smurf prro olvidate","replies":[{"poster":"Mini Kha Zix","date":"2019-02-20T14:39:41.406+0000","up_votes":1,"down_votes":0,"body":"PD te lo dice alguien que bajo de Challenger a diamante 2 meses antes de que termine la sesión (está es mi smurf)","replies":[]}]},{"poster":"TvTLucio22","date":"2019-02-20T14:18:08.282+0000","up_votes":1,"down_votes":0,"body":"es sumamente necesario seguir? o sea, si no te gusta el juego, dejalo por propia voluntad (no es lo mismo dejar de jugar porque no tenes ganas a dejar de jugar porque no podes). no digo que te vayas y no vuelvas mas, pero si podrias jugar a otras cosas, darle un tiempo y, eventualmente y si queres, volves a jugar tranquilo. yo lo hice durante un mes como en 2012-13 y me sirvio mucho.\n\nigual, siempre esta la posibilidad de tomarte todo en solfa, dejar de rankear y jugar unicamente para divertirte","replies":[]},{"poster":"Teemo Best JoJo","date":"2019-02-20T14:17:51.035+0000","up_votes":1,"down_votes":0,"body":"Si, que dejes de perder tu tiempo jugando rankeds y subiendo de liga para que te den NADA UN SIMPLE OBJETO VIRTUAL. En resumen juega normales o arams","replies":[]},{"poster":"SARPADO SCRIPT","date":"2019-02-20T13:46:09.505+0000","up_votes":1,"down_votes":0,"body":"No jugues tilteado, eso primero.\nSegundo, adc es una hermosa linea para carrear, pero desgraciadamente en elo bajo (y te lo digo por experiencia) es una de las mas complicadas, trata de ir una linea la cual tenga iniciativa, como top o jg, incluso mid, tenes que tener presencia, si fuiste platino, mecanicamente no sos malazo como para perder tantos games en silver, vos mandale mecha pa, y hace duo con alguien que juegue top jg o mid, y juga otra linea, cuando sientas que hay suficiente nivel como que la gente tiene iniciativa, hace calls y tiene buen macro y micro game, mándate la linea que quieras jugar y que consideres mejor para vos.\nTambién eso, hace calls si te consideras sabio para estos, dado que la gente hasta elos altos estan un poco perdidos o despistados y aveces no saben que hacer, esto ayuda mucho.\n(También es complicado, cuando varios tienen la iniciativa, como por ejemplo que 1 calle torre de mid y otro drake xd.) Básicamente eso, dale que vos podes campeón, te diria de hacer duo, pero tengo un horario de mierda jaja","replies":[]},{"poster":"asdmaskldmnkfl","date":"2019-02-20T12:37:24.586+0000","up_votes":1,"down_votes":0,"body":"Si quieres salir de agujero, tienes q aplicar trucos del soloq, jugar en la jungla de picks 1v9, si vas adc en botlane. Dependes de tu teAm. Puedes ir twitch jungla y stompear a lo q se te cruce, he vistos otros adc pero no son tan dominantes como twitch en jungla por su potencial de gank. Master yi bien jugado causa estragos.","replies":[]},{"poster":"kook7","date":"2019-02-20T20:20:58.066+0000","up_votes":1,"down_votes":1,"body":"Si quieres puedes juhar conmigo yo soy main adc y mid  me podes buscar como kook7 o drimer77 asi esas son mis dos cuentas de lol  soy muy buena aprediendo y escuchando asi que podemos hacer dúo piesaloo","replies":[]},{"poster":"Tur1nTur4mb4r ","date":"2019-02-20T20:16:45.143+0000","up_votes":1,"down_votes":1,"body":"La gloria de Gondor?","replies":[]},{"poster":"TitanHammer","date":"2019-02-20T19:45:38.083+0000","up_votes":1,"down_votes":1,"body":"Ver lo hermoso que sería que Sylas robe la R de la nueva Kayle v:","replies":[]},{"poster":"SG naiko ","date":"2019-02-20T18:34:20.013+0000","up_votes":1,"down_votes":1,"body":"*Entrena para ser la mejor versión de ti mismo no para ser el mejor*","replies":[]},{"poster":"EvilZombie","date":"2019-02-20T16:20:07.211+0000","up_votes":1,"down_votes":1,"body":"Juega ArUrf con amigos, siempre con mis amigos nos cagamos de risa y nos trolleamos entre nosotros en algunas ocasiones xD","replies":[]},{"poster":"lLunal","date":"2019-02-20T15:29:44.783+0000","up_votes":1,"down_votes":1,"body":"Te das unos respiros cuando no te den ganas de jugar/no lo disfrutes y volvés concentrándote en tus mains con todo el esfuerzo posible. A larga, si es que tenes lo necesario, subís.\n\nPlus, sacaron una división de todas las ligas xD","replies":[]},{"poster":"Zalvagzk","date":"2019-02-20T15:28:24.863+0000","up_votes":1,"down_votes":1,"body":"Es simple, el juego va por rachas, todos tenemos rachas malas y buenas, pero si ya te cansas de jugar por equipos malos simplemente para unas horas y vuelve, o juega con amigos y música. Si no eres capaz de resistir a la comunidad este juego no es para tí.","replies":[]},{"poster":"Borriic III","date":"2019-02-20T15:14:06.973+0000","up_votes":1,"down_votes":1,"body":"#comprendo al 100% tu malestar\n\nlo conversaba con mi hermano hace unos dias, segun lo que el me decia al inicio de esta season con la implementacion de las ligas nuevas hubo un desbalance ridiculo en el posicionamiento y gente horrible quedo en elos muy altos que no les corresponde y gente que tenia un elo regular tirando para decente se vio super perjudicada\n\nyo como que no le crei mucho hasta que jugue mis placements, yo venia jugando relax y era platino III y jugaba regularmente en partidas de elo plat I-diam IV ya que mi mmr me lo permitia, mi primer placement fue un poco mas baja a ese elo, emparejado con diam V y platinos y de algun modo mi team era tal como lo describes \"mala partida me dije, nada que hacer\" pero la siguiente fue igual, la tercera tuve suerte y me toco jesus en la jungla y entre los 2 sacamos la partida adelante a punta de tiltear a mi rival de linea y de ahi en mas fueron todo conos en mi team vs smurfs en el rival... yo no me la podia creer \"estare jugando mal?\" me pregunte y vi todas mis replays y literal en todas las replays yo acababa mi linea 1-0 2-0 o por ahi y con 30cs mas que mi rival de linea y siempre me encontraba un muro 6 o 7-0 del team rival al que mis aliados se habian cansado de hinchar a kills antes de siquiera llegar a lv6 \n\nluego me puse a conversar con un amigo que me comentaba que en su cuenta main, le pasa exactamente igual, siendo actualmente platino no puede carrear los troncos que le salen (el es ex challenger) pero que en cambio en su smurf (ex bronce actual platino) lleva un win rate como de 9X% y me comentaba que literal podia quedarse afk farm en la jungla y sus teams lo carreaban igualmente y no en una o dos sino que en docenas de partidas... luego yo miraba mi historial y me encontraba con adcs que corrian hacia el team rival a regalar kills, teemos junglas, mlaphites supports, junglas que se tiraban a divear a lvl 1 y acababan la partida 0/12 ... ademas de afks y demases en todo lo que va de temporada da igual la linea que vayas da igual todo, uno siempre juega con la motivacion de hacer la mejor partida posible pero si vas a ganar o perder no lo define ni tu pick ni tu estrategia sino el team que te toca, si te toca el team bueno ganas sin hacer nada, si te tocan los quesos y trolls ni aunque seas dios faker carreas\n\nen fin, lo unico que te queda por hacer es seguir jugando y ver si el dios rito se pone de tu lado con los emparejamientos, si te mantienes jugando decentemente los teams buenos te tocaran a ti y eventualmente ganaras, pero si, la verdad desmotiva bastante el saber que aun si juegas perfecto, carrear 4 pesos muertos esta season es imposible, al menos, durante las vacaciones, por lo visto con la vuelta a clases estos mandriles valoran un poco mas el poco tiempo que tienen para jugar sus partidas y trolean menos","replies":[]},{"poster":"Beth Thomas","date":"2019-02-20T18:33:56.371+0000","up_votes":1,"down_votes":2,"body":"Mejor deja de poner excusas baratas y aprende a jugar si realmente queres subir sino juga normales o andate del juego jeje :)","replies":[]},{"poster":"Pulguexis","date":"2019-02-20T13:19:27.656+0000","up_votes":1,"down_votes":2,"body":"con los nuevos reworks menos te van a dar ganas de seguir jugando pero bueno...es lo que hay","replies":[]},{"poster":"Phaedra","date":"2019-02-20T12:43:36.021+0000","up_votes":1,"down_votes":3,"body":"A ver, es sencillo, si no te divierte no juegues. Yo generalemente juego a ganar, pero divirtiendome. ¿Que quiero decir? que uso campeones que me gustan, o voy variando, practico roles, etc. Obviamente esto hace que me estanque. El mes antes que termina la season me pongo a jugar con mis main en top y mid, las espameo hasta el cansancio, y llego a mi objetivo. \n\nYu objetivo es subir ya? bueno, agarra tus mains y tryhardea. \n\nPD: con tus \"main\" no me refiero al campeon que mas usas. Me refiero a un campeon con el que tengas +60% de win rate ( en al menos +10 games). Hay mucho \"main\" con 500k de maestria, 200 games, y win rate de -50%....no creo que tenga que aclarar como tienen su MMR.","replies":[]}]}