{"poster":"Fetus in Fetu","date":"2015-02-10T19:50:49.392+0000","title":"Desagradecidos","subforum":"Charlas Generales","up_votes":59,"down_votes":24,"body":"Simplemente no entiendo la gente de este servidor... Les permiten tener este juego a su disposición, el cual de hecho es tremendo juego y se la pasan reclamando compensaciones o quejándose de las mínimas ocasiones en los que surgió un problema... Simplemente en lugar de quejarse deberían dejar de jugar si tanto les molesta... Se matan trabajando en el juego, de lo contrario los problemas durarían por horas... Me parece ridículo!\n \nUNA ANOTACIÓN...PORQUE HAY GENTE QUE NO ENTENDIÓ UN PEQUEÑO DETALLE... \nA mi no me tienen que reclamar nada, solo publique mi opinión para que otros tambien comenten la suya.","replies":[{"poster":"Riot Uracan","date":"2015-02-10T21:39:26.175+0000","up_votes":16,"down_votes":3,"body":"Como muchos mencionan nosotros tenemos la responsabilidad de darles y mantener un servicio bueno. En este caso desafortunadamente los encontramos con un problema que fue de nuestra culpa. (mas información aquí : http://boards.las.leagueoflegends.com/es/c/charlas-generales/UngNpYgv-resumen-desconexiones-de-febrero-10-305pm-chiarg ) \n\nAunque los cambios o arreglos para este tipo de problema se pueda tardar un poco en implementar estamos dispuestos en darles mas opciones de connectividad para mejorar la estabilidad del servicio.  Siempre va ser una guerra de armas ( especialmente contra ataques de DDoS ) pero es parte de como les servimos a ustedes.","replies":[{"poster":"anth0logy","date":"2015-02-11T00:29:04.923+0000","up_votes":7,"down_votes":1,"body":"Los que upvoteamos este thread lo que queremos decir es que si bien es su responsabilidad dar un servicio bueno, no merecen insultos y criticas desmedidas de gente que no puede estar dos horas sin jugar al LOL. Basicamente un poco de respeto. Entendemos que el server pueda tener algun problema, o alguno se pueda confundir. Son personas, todos nos equivocamos.\n\n Personalmente agredezco y aprecio muchisimo la transparencia y la autocritica con la que se trato este tema.\n\n\n Eso no quita que este enojado por no poder jugar y que la gente tenga ping hace 4 dias.","replies":[]},{"poster":"Windergard","date":"2015-02-11T12:44:54.409+0000","up_votes":4,"down_votes":0,"body":"Tal vez deberían haber cancelado las partidas ranked mientras el servidor esté inestable, o cerrar el servidor (yo agradezco que no lo hayan cerrado como pasa en la mayoría de los juegos que por ahí lo cierran por semanas).\nLa verdad es un tremendo juego y es gratuito, no me puedo quejar por nada, al contrario, estoy re feliz que exista y que pueda jugarlo.\nTodo el tiempo están haciendo cosas para mejorarlo, siempre esta on, siempre que hay problemas alguien da la cara en el foro para explicar lo que pasa.\nYo creo que antes de mandar 50 posts quejandose deberían agradecer que exista y que sea gratuito.","replies":[]},{"poster":"Senseiiii","date":"2015-02-11T14:36:46.895+0000","up_votes":2,"down_votes":0,"body":"Ya tuvieron caída de servicio por ataques de DDoS?","replies":[]},{"poster":"BM Chama","date":"2015-02-12T02:50:20.002+0000","up_votes":1,"down_votes":0,"body":"entones {{summoner:4}}  están consientes que  nuevamente los servidores de riot an sido hakeados ?","replies":[]},{"poster":"fastestt","date":"2015-02-11T00:02:02.127+0000","up_votes":3,"down_votes":10,"body":"la verdad estoy muy enojado por varias razones, la principal es el server que se vive cayendo sin que esto se solucione, y por otro lado son las partidas robadas por el lag, ¿porque digo robadas?, lo digo asi porque al jugar rankeds (que son las partidas mas importantes del juego) , se produce el famoso LAG y literal mente no se puede jugar, pero lo que mas me hace enojar es que al rendirse apropósito , por el problema del lag , la partida te la cuenta como perdida, y tenes una partida menos en las clasificatorias. LA VERDAD ESTO SE LO DIGO POR 2 MOTIVOS EL PRIMERO ES QUE NO SOLO A MI ME PASA, Y LA OTRA ES QUE LOS QUE SE RINDEN PIRDEN POR CULPA DEL LAG Y NO POR CUALPA DE SI MISMOS.\nOTRA COSA QUE LES QUERIA DECIR ES QUE SI SIGUE ASI EL JUGO VA A PERDER MUCHOS CLIENTES Y ESO NO ESTA BUENO.","replies":[{"poster":"FB BigDix","date":"2015-02-11T13:59:01.541+0000","up_votes":4,"down_votes":1,"body":"Wow.. me encantó la subida de tono del último párrafo y medio.\nCasi podía escuchar tu voz chillona gritando al lado mío ¿Cómo lo logras?.-\nEscribes en mayúsculas para expresar tu enojo ¿verdad?. Por que es lo único que se lee, ya que no aportaste absolutamente nada que no se haya repetido hasta el hartazgo antes....","replies":[{"poster":"IrishRageQuitter","date":"2015-02-11T21:26:23.223+0000","up_votes":1,"down_votes":0,"body":"Justamente resalta para intentar aclarar lo que le van a saltar a criticar de todas formas. Algo que me parece inutil, ya que no se puede ganarle un argumento a una rata.. siempre va a tener algún sinsentido para retrucar.-","replies":[]}]}]}]},{"poster":"Wuju","date":"2015-02-10T20:16:51.650+0000","up_votes":2,"down_votes":4,"body":"***","replies":[{"poster":"El Trauco Feliz","date":"2015-02-10T20:28:06.115+0000","up_votes":17,"down_votes":3,"body":"> [{quoted}](name=Wukong Bot,realm=LAS,application-id=v7qsfXsE,discussion-id=IlQ9rQG6,comment-id=0003,timestamp=2015-02-10T20:16:51.650+0000)\n>\n> Vos sos de los que va a una plaza pública, ve que está todo sucio y le da igual, ¿no? O ves a una señora caminando por una vereda toda destrozada, se cae y te da lo mismo. Total, es gratis caminar por la vereda, no hace falta que esté en buenas condiciones.\n\nAnalogía fuera de lugar , una plaza es un bien publico que se financia con los impuestos  que TODOS deben obligatoriamente pagar , esto es un servidor privado , con dineros de una empresa y con los alcances de la misma  , la compra de rp  en rigor es uno de las tantas formas de ingresos que tiene Riot Games y te puedo asegurar que no es la principal fuente de entrada y con la cual financia todos los aspectos del juego desde eventos , producción del juego ( con todos sus derivados ) , publicidad   y tambien compra de servidores y pago de hosting y datacenters  , contratos con empresas de telecomunicaciones para  el uso de las rutas de comunicación , ahora  bien que haya un problema externo al juego dentro de su programación (bugs del juego , errores de cliente  , problemas con algun parche ) eso es responsabilidad de Riot  , pero riot no puede asegurar la estabilidad al 100% del servicio que contrato para  la comunicacion  del servidor con los ISP , estos últimos son los responsables de esto y le deben explicaciones a Riot , tal como tu las requieres de Rito , por lo cual encuentro totalmente infundada la forma en como se reclama , y a muchos se les olvida que lo primero que un cliente debe ser antes de hacer reclamos es ser un cliente informado , sino solo queda como un simio que golpea la mesa  sin saber  por que reclama","replies":[]},{"poster":"anth0logy","date":"2015-02-10T20:32:24.088+0000","up_votes":8,"down_votes":1,"body":"Cuantos años tenes? 12?\n\n Primero, no es gratis, se paga que la plaza este limpia con los impuestos, al igual que la vereda y etc. Segundo, si el servidor se cae no podes pretender que lo arreglen en 5 minutos. Dale tiempo al staff para que encuentre el problema y lo solucione. En cambio vienen a insultar a un foro a la gente que trabaja en Riot porque estan 2 horas sin jugar.","replies":[]}]},{"poster":"Danthor","date":"2015-02-10T22:39:55.156+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Buffa001,realm=LAS,application-id=v7qsfXsE,discussion-id=IlQ9rQG6,comment-id=,timestamp=2015-02-10T19:50:49.392+0000)\n>\n> Simplemente no entiendo la gente de este servidor... Les permiten tener este juego a su disposicion, el cual de hecho es tremendo juego y se la pasan reclamando compensaciones o quejandose de las minimas ocasiones en los que surgio un problema... Simplemente en lugar de quejarse deberian dejar de jugar si tanto les molesta... Se matan trabajando en el juego, de lo contrario los problemas durarian por horas... Me parece ridiculo!\n\nI agree bro.","replies":[]},{"poster":"anth0logy","date":"2015-02-10T20:23:24.167+0000","up_votes":5,"down_votes":2,"body":"Si bien es cierto que el servidor no tiene tantos problemas como algunos dicen, tampoco son \"minimos\" como los llamas vos. En los ultimos meses hubo bastantes problemas de lag y de conexion con varios ISP (tambien es cierto que si los ISP tienen problemas no es culpa de Riot).\n\n Mas alla de eso, coincido con vos. Muchos de Riot LAS/LAN hacen un gran trabajo y mas alla de que les paguen, lo hacen porque les gusta su trabajo. \n Cuando vienen los niñitos de mama a insultar porque se cayo el server no piensan en la persona que esta atras de la pantalla trabajando todos dias para que el pueda jugar a su jueguito. Y tampoco piensan que las cosas no se arreglan en 5 minutos. Quizas estaria bueno un poco mas de transparencia de parte de Staff, por ejemplo un tiempo estimativo de resolucion, o aclarar que fue lo que fallo. Tal vez un poco de autocritica vendria bien tambien. \n\n No nos olvidemos que los que ponen la cara en el foro no son los que hacen las inversiones, ni cuando van a poner el tribunal o si les van a dar una cajita porque el servidor tuvo un problema.\n\n Como dice Buffa, sean un poco mas agradecidos con la gente que esta trabajando para que ustedes puedan jugar.\n\nPD: Mi teclado esta en ingles, perdon por la falta de tildes.","replies":[]},{"poster":"soLokYU veyN","date":"2015-02-11T04:43:39.261+0000","up_votes":1,"down_votes":0,"body":"Por decir eso del servidor no te van a recompensar ni nada, seguro no te afecta porque jugas normal o no te interesa, hay muchisima gente que se pasa todo el dia jugando Rankeds, queriendo subir de liga para mejorar, y hay veces que el juego se lagea o algo asi (por ahora no me paso) y eso les cae mal, nose perdon si ofendi a alguien, pero esta es mi opinion, saludos :)","replies":[{"poster":"g3r0g3r0","date":"2015-02-18T02:08:52.900+0000","up_votes":2,"down_votes":0,"body":"Perder una raked, una normal, un aram o lo que cuernos sea, es eso. Peroder una partida en un JUEGO.\nSi alguien se va a poner loquito por eso, entonces mejor qeu se qeude sin servidor y salga a tomar un poco de sol porque el juego lo esta afectando de forma severa.\nDeberia ser como en algumos MMORPG en los cuales despues de cierta cantidad de horas al dia empezas a recibir menos recompensas. Para que la gente no haga como ese chino qeu murio por no salir de la pc por 3 dias.\n","replies":[]}]},{"poster":"Eurosia","date":"2015-02-10T21:40:04.036+0000","up_votes":4,"down_votes":3,"body":"Si \"minimas ocasiones en los que surgio un problema\" se refiere a la gente quejandose del lag entonces me parece que no estas entendiendo que el problema del lag va y viene hace varios meses. Todas las semanas hay **al menos** un dia o un rato en el que el juego esta inaccesible, la gente pierde rankeds y casi nunca activan la derrota evitada, otros terminan con la cuenta flagueada por el leaverbuster. No papa, no son \"minimas ocasiones\"...","replies":[{"poster":"Danthor","date":"2015-02-10T22:51:05.023+0000","up_votes":3,"down_votes":2,"body":"La mayoria del lag no es culpa de Riot, yo juego desde mi pais y nunca salvo cuando hubieron problemas ya explicados y masivos en el servicio tengo lag. Salvo cuando mi ordenador se tara ya sea porque viene levantando varios programas y esta sin reiniciar un tiempo, ahi lo reinicio y el lag desaparece. Pero es mi problema y no de Rito cuando eso pasa. \n\nPor otro lado, Internet es un conjunto de subredes, entre las cuales hay nodos para intercomunicarlas. \n\nCada pais tiene una red formada con sus distintos ISPs, yo les preguntos a los que ni idea tienen y ante la ignorancia siempre es lag de Riot, que pruebas tienen de que no es su PROBLEMA o de su proveedor en su pais que esta teniendo un mal servicio?\n\nSiepre que me conecto tengo un ping que no supera los 60 o 70 ms. \n\nSi el problema fuera de Riot en algun momento repetidas veces mi ping se iria a las nubes, pero no es asi. \nDat: muere el mid y la culpa es del jg, muere el adc y la culpa es del supp. \nLa ignorancia es una dicha...","replies":[{"poster":"Eurosia","date":"2015-02-11T02:40:02.673+0000","up_votes":2,"down_votes":1,"body":"Osea que vos tomas como ejemplo tu conexion y nada mas que eso para juzgar el funcionamiento del server entero. Si, eso definitivamente no es ser un ignorante. O un hipocrita. Ya se hablo miles de veces de como funcionan las redes y como llegan las conexiones de un server a otro. Cuando yo veo que en mi equipo hay 5 tipos que se quedan parados cada menos de 10 segundos, los 5 quejandose por el lag, el otro equipo quejandose por el lag, mientras que pongo a cargar un video en Youtube y anda perfecto, me temo mi querido y sabio amigo que no es culpa de mi internet ni de mi ISP.\nPor otro lado cuando veo que en mi equipo hay 2 o 3 chilenos y 2 o 3 argentinos, y los argentinos pierden la conexion (tanto los de mi equipo como los 2 o 3 del contrario), entonces, una vez mas mi querido amigo, no es culpa de los usuarios.\nQue las ISP sean basura no es ninguna novedad, es valido echarles la culpa asi como tambien es valido y necesario que se responsabilicen cuando la culpa la tiene Riot mismo como fue en este caso, cosa que yo aplaudo. Pero se llega a un punto en que Riot tiene que poner un poco de huevos y decir \"ok si a x hora todo fibertel/telefonica/quien sea anda mal, entonces activemos la derrota evitada porque los jugadores no tienen la culpa y no merecen perder partidas, tiempo y probablemente la cuenta durante unos dias por algo en lo que no tienen nada para hacer\" Esto afecta tanto a los que pierden la conexion como a los chilenos que estan jugando y pierden porque la mitad de su equipo esta parado en la base.\nA veces antes de asumir automaticamente que sabes mas que los demas tendrias que aprender a engranar un poquito el cerebro. Despues escribis.","replies":[{"poster":"Danthor","date":"2015-02-11T15:30:54.457+0000","up_votes":1,"down_votes":3,"body":"Primero si vas a opinar hacelo con responsabilidad y sin soberbia.\nPaso a contestar la primera parte de tu post ya que ni me molestare en terminar de leerlo porque empezamos mal ni contestare a personas que se creen saberlo todo, no leen correctamente y aun asi siguen pretendiendo enteneder. \n\nUn serrvidor no es el problema general. Una empresa que hostea tantos realms tiene equipos muy costosos, y se componen de muuuchooooosssss servers que soportan muuuuchoooos clientes. \n\nPor otro lado, si realmente lees bien yo digo que en mi caso no me pasa salvo cuestiones especiales, que 5 personas de tu team (incluyendote) queden freez es un problema generico y puntual. Ahora, te lo explico con dibujitos o no lo puedesentender?\n\nOtra acotacion a tus sabios consejos para quienes leeen tu comentario y en lugar de informarse y aprender se ven mas perjudicados. \n\nQue te cargue un video de youtube no tiene nada pero nada que ver con una prueba de velocidad seria. Es mas es lo mas ridiculo que he leido.\n\nPara empezar la informacion por internet se manda por paquetes, estos pueden tener distintos tamaños y la velocidad de bajada no es sinonimo de buen ping. Vamos despacio o te mando un dibujo?\nOk, sigamos el ping es importante ya que por dar un ejemplo un modem 3g (no se si sabes lo que es) puede tener buena bajada de un video de youtube, pero un ping de 500 o mas con ese servidor. Ahi tienes un ejemplo que puedes probar con tus pocos conocimientos \n\nAun asi, el ping malo, no dice que un servidor tenga la culpa (hablando de servidor propiamente dicho), el problema de respuesta puede ser un efecto embudo en en el ruteo hasta llega al servidor. Inclusive puede ser problema de tu conexion o de tu propio equipo. \n\nY lo lamento por tu poca logica, pero si mi ping en general sacando eventos PUNTUALES que si vienen de parte de Riot promedia los 60 ms, significa que los serrvers de Riot no son el problema general. Porque si mi conexion, mi equipo y el ruteo de mi isp hasta el servidor es bueno, pero ellos tuvieran problemas, en algun porsentaje de mis conexciones tendria lag, (20, 30, 40 por ciento etc,) pero no es asi. \n\nSi yo subo una cuesta en una biicicleta y simpre hago el mismo esfuerzo y tu tienes que hacer mas, infla la rueda, aceita los componentes o comprate otra bicicleta porque la subida es siempre la misma. Saludos y suerte con tus palabrerios.","replies":[{"poster":"Ch4puLin","date":"2015-02-11T22:16:23.070+0000","up_votes":2,"down_votes":1,"body":"Vaya. Te hiciste el superado y no lograste entender lo que te escribió el usuario. Sos ridículo.","replies":[{"poster":"Danthor","date":"2015-02-13T14:31:10.834+0000","up_votes":1,"down_votes":2,"body":"Lee lo que el contesta, y mira como lo escribe y luego hablamos. Ridículo para ti, para otros solo actué como tal vez muchos hubieran actuado. \n\nSolo lean todo y no olviden al final lo que se dice al inicio. Mantengan una cordura y tal vez no seremos todos ridículos. \nPor cierto la palabra ignorancia, no necesariamente se puede referir a un saber global o cultura. Tambien se puede referir (asi la use en este caso) para un conocimiento en especial. Yo soy ignorante en muuuuchas cosas que seguro uds me darían catedra y no por eso me ofendo. \n\nEn cosas básicas de la vida soy ignorante y acepto mi condición porque solo asi me superaría, ya que no es posible dejar de ser ignorante en temas específico. \nSaludos y gracias por tu visión de como actué.","replies":[{"poster":"Ch4puLin","date":"2015-02-13T16:18:03.315+0000","up_votes":2,"down_votes":0,"body":"Lo leí, su respuesta me parece muchísimo menos irrespetuosa y superada que la tuya. Leé de nuevo lo que escribiste, sé sincero. Pero no quiero que te detengas en esto y digas algo como \"no voy a seguir leyendo el resto\".\nEl flaco marca puntos que no entendiste, y que tu opinión original no contempla:\n1.  No tenés que entender el server como el aparato físico (ya sea uno o toda la infraestructura en un edificio), al referirse a LAS, no hablamos del aparato, sino de todo el área que abarca, todos los países que juegan y sus conexiones.\n2. El tema de youtube no lo pone como un ejemplo de prueba científica, es una ejemplificación de que el problema no es propio, es solamente dentro de las redes necesarias para llegar al server (físico). Podría haber dicho \"juego al COD en un server yanqui y me va perfecto, pero pasar a chile no\".\nCuando entiendas 1, vas a dar como válido su punto: que a la mitad del server, la del oeste de la cordillera le ande bien, no significa que la otra mitad tenga que sufrir una mala experiencia, no es culpa de riot el corte o inestabilidad, es culpa de riot no actuar en consecuencia, si la mitad del server sufre, activa derrota, corta rankeds, no los dejes en bolas. Se entiende ahora? Riot dice: \"los paquetes chilenos me llegan, no es mi problema\" (algo parecido a lo que vos decís) Mientras tanto el 50% restante, pierde puntos, recibe castigos por motivos totalmente ajenos a ellos. Riot falla en dar una buena experiencia al  server como un todo, escudándose en una visión bastante egocéntrica como la tuya, sin faltar el respeto.","replies":[]}]}]}]}]}]}]},{"poster":"Killin Michin","date":"2015-02-11T07:07:00.437+0000","up_votes":1,"down_votes":0,"body":"Yo no quiero que me recompensen, quiero que el server tenga el mismo ping que antes, no 200ms, en todo caso, anda a jugar con 200ms vos, con todo respeto.\n\nY si, hace dias que no juego porque no se puede con el ping que hay.","replies":[{"poster":"El Trauco Feliz","date":"2015-02-11T08:06:08.682+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Rdxone,realm=LAS,application-id=v7qsfXsE,discussion-id=IlQ9rQG6,comment-id=0012,timestamp=2015-02-11T07:07:00.437+0000)\n>\n> Yo no quiero que me recompensen, quiero que el server tenga el mismo ping que antes, no 200ms, en todo caso, anda a jugar con 200ms vos, con todo respeto.\n> \n> Y si, hace dias que no juego porque no se puede con el ping que hay.\n\nyo jugaba en NA con 220 y podia jugar de lo mas bien  , si te refieres que con ese ping no se puede jugar","replies":[{"poster":"MACROD","date":"2015-02-11T13:16:41.408+0000","up_votes":1,"down_votes":0,"body":"todo depende del ISP, por eje: en mi caso soy de paraguay y tengo 2 conexiones de internet, en la de personal con 135 ms si mi ms sube a 200ms en ocasiones es casi injugable, en cambio con el ISP Copaco tengo 220 ms jugable pero en ocasiones sube.\ntodo depende del ISP.","replies":[{"poster":"DarkRyo","date":"2015-02-11T15:27:38.172+0000","up_votes":1,"down_votes":0,"body":"Yo juego anclando mi internet de mi celular (linea tigo) a una PC y suelo jugar  a 150 ms...ayer antes de la caida estaba a 60 ms xD","replies":[{"poster":"MACROD","date":"2015-02-11T18:04:36.423+0000","up_votes":1,"down_votes":0,"body":"tigo py??","replies":[{"poster":"DarkRyo","date":"2015-02-11T20:27:55.532+0000","up_votes":2,"down_votes":0,"body":"Si! {{item:3151}}  Asi somos cuando queremos jugar demasiado y el proxy de tu laburo te bloquea todo xDD","replies":[]}]}]}]},{"poster":"Killin Michin","date":"2015-02-11T19:41:40.031+0000","up_votes":1,"down_votes":0,"body":"Yo tambien jugaba en NA con ese ping, pero esto es LAS, no hay 200ms aca, hay 50.","replies":[]}]},{"poster":"Danthor","date":"2015-02-11T16:06:32.149+0000","up_votes":1,"down_votes":0,"body":"Como sabes que el cambio de ping es por el lado Riot?\nTe cuento una breve, yo habia solicitado hace tiempo ya el hosteo de un server para COD4. \nHabian en aquel momento servers gratis, pero para jugar \"Wars\" por lo general los \"equipos\" solian tener un server para competir cerrado. \n\nObviamente lo contrate en Argentina porque era mas economico y habian variedad de empresas. En mi Pais todo pasa por Antel quien a su vez conecta su red con otros paises por distintos medios. \nLa cuestion es que no tenia menos de 200 de ping, los contacte ya que pagaba por el servicio y les explique.\nEllos me dijeron que el problema de ellos (ya qu otras empresas tenian ping de 80) era que su Isp no estaba andando bien con la conexion a Uruguay. \n\nAhi tienen una experiencia puntual en donde ni mi equipo, ni mi isp, ni el equipo del prestatario tenia problemas. Obvio que no iban a cambiar de proveedor por un cliente por lo que fueron muy atentos me dijeron el problema y di la baja. \nContratamos en otro sitio tambien en Argentinaun poco mas caro y el ping fue normal. \nSaludos","replies":[]}]},{"poster":"Tordo RHCP","date":"2015-02-10T23:04:48.920+0000","up_votes":4,"down_votes":2,"body":"se puede jugar sin la necesidad de gastar un solo peso, o sea es gratis pero esta en la naturaleza del hombre en quejarse, y ya se quejan por cualquier cosa, lo mejor es ignorarlos, dejarlos que lloren por cosas como \"por culpa de riot sigo en bronce\", si hay lag en el server no juegues ranked, simple y practico","replies":[]},{"poster":"El Trauco Feliz","date":"2015-02-10T20:16:04.110+0000","up_votes":5,"down_votes":3,"body":"es la naturaleza de la gente lamentablemente  y mas aun si agregas que este juego la media  de jugadores esta entre los 15-20 años , no se puede esperar que  entiendan la diferencia entre entender que los problemas de un servidor no  pueden ser  siempre culpa de la empresa del juego , por ello no te sorprenda  de ver  \"estamos hartos de tus mentiras Rito \" \"GG Riot\" y un largo etc  cuando claramente  por ejemplo el problema  de hoy fue un problemas con las rutas  la cual Riot no es dueña y no tiene el deber de preocuparse de su estado , solo exigir a las empresas de telecomunicaciones dueñas de estas que estén en optimas condiciones , por que Riot al igual que  muchos jugadores que compran RP y alegan que por eso Riot prácticamente debe llevarle la platina presupuestaria anual  tambien son clientes y estan pagando por el servicio , y es mas al ver el tenor de los alegatos  podras notar que  compra de RP = estabilidad del servicio ( cuando claramente  ello no depende  de Riot  ( al menos lo que son las rutas de comunicacion )","replies":[{"poster":"Danthor","date":"2015-02-13T14:42:54.780+0000","up_votes":1,"down_votes":0,"body":"Tal cual.","replies":[]}]},{"poster":"Khüt","date":"2015-02-10T20:11:51.995+0000","up_votes":3,"down_votes":2,"body":"Yo pienso que la gente no lo hace con esa intención, y aunque entiendo que el juego sea gratis, es el juego más jugado del mundo actualmente, con todo lo que facturan, deberían poder hostear 10 servidores alrededor del mundo. Yo nunca llegué ni a pensar de que nos fueran a compensar por las cosas que pasan, pero hay que tener en cuenta que últimamente el servidor ha estado horrible técnicamente, por lo que he visto en Argentina a la gente no le baja de 200 ms y acá en Uruguay tampoco en la última semana. Sé que la gente no habría de quejarse de un juego que es completamente gratis (aparte de los skins, pero a nadie obligan a comprar), pero a mi parecer deberían tener un mejor empeño en mantener los servidores en buen estado.","replies":[]},{"poster":"Samuelson","date":"2015-02-11T03:06:22.829+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Buffa001,realm=LAS,application-id=v7qsfXsE,discussion-id=IlQ9rQG6,comment-id=,timestamp=2015-02-10T19:50:49.392+0000)\n>\n> Simplemente no entiendo la gente de este servidor... Les permiten tener este juego a su disposicion, el cual de hecho es tremendo juego y se la pasan reclamando compensaciones o quejandose de las minimas ocasiones en los que surgio un problema... Simplemente en lugar de quejarse deberian dejar de jugar si tanto les molesta... Se matan trabajando en el juego, de lo contrario los problemas durarian por horas... Me parece ridiculo!\n\nYo te apoyo , muchos se olvidan de que este juego es gratis y producido por una empresa privada , por lo tanto no tienen derecho a reclamar nada. Al que no le guste que no juegue y listo.{{champion:266}}","replies":[]},{"poster":"Metalkwolf","date":"2015-02-10T21:41:52.533+0000","up_votes":2,"down_votes":1,"body":"Muy de acuerdo con todo y con la mayoría de los que comento, si bien el servidor tiene sus fallos y que nuestras proveedoras de internet no son las mejores(porque reconozcamoslo, no siempre es culpa del server), no es merito una falla a recibir una recompensa.\n¿Donde esta el merito en que Riot tenga una falla a recibir lo que sea?\nDe verdad, no comprendo la actitud, no hay merito en eso...\nY como dicen, si tanto les molesta, pues bueno, pueden retirarse de la comunidad y del juego, total es gratis, nadie los obliga a que \"sufran\" con el funcionamiento del servidor; Saludos a todos, muy buen tema de discusión y muy bien planteado!","replies":[]},{"poster":"Osid","date":"2015-02-10T21:15:20.733+0000","up_votes":2,"down_votes":1,"body":"pasa que es facilisimo criticar, insultar, molestar cuando el server anda mal, es simple, si el juego no les gusta a llorones que no juegen, es un f2p y nadie les pone un revovler en la cabeza para que juegen c: generalmente los llorones son niños {{champion:1}}","replies":[]},{"poster":"Rebkans","date":"2015-02-10T21:08:57.369+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Buffa001,realm=LAS,application-id=v7qsfXsE,discussion-id=IlQ9rQG6,comment-id=,timestamp=2015-02-10T19:50:49.392+0000)\n>\n> Simplemente no entiendo la gente de este servidor... Les permiten tener este juego a su disposicion, el cual de hecho es tremendo juego y se la pasan reclamando compensaciones o quejandose de las minimas ocasiones en los que surgio un problema... Simplemente en lugar de quejarse deberian dejar de jugar si tanto les molesta... Se matan trabajando en el juego, de lo contrario los problemas durarian por horas... Me parece ridiculo!\n\n Yo estoy de acuerdo con vos.  Ademas, como sera la gente ahora que solo les interesa que les den recompensas. Aprovechan cada diminuta ocacion o error para ya andar pidiendo algo. Lo que paso, no fue culpa de Riot y aun asi, es el personal del server los que se encargaron de arreglarlo para que podamos jugar, y aun asi piden les reclaman cosas? Ya es mucho que haya habilitado la derrota perdonada y ademas no quitaron puntos de liga.\nCuanto egoismo hay en la gente realmente. para mi riot no tiene porque dar algo.","replies":[]},{"poster":"EzrealSupportOP","date":"2015-05-17T05:11:54.755+0000","up_votes":1,"down_votes":0,"body":"Yo no he tenido lag desde hace 1 año y 3 meses\n\nNo es broma","replies":[]},{"poster":"Allukaa Zoldyck","date":"2015-02-12T01:17:14.766+0000","up_votes":1,"down_votes":0,"body":"el problema es que cuando tienen un problema nisiqueira ponen derrota evitada ... si esto se pusiese a tiempo no habrian reclamos ya q si elserver esta malo esta bien pero que eso nso afecte como jugadores es otra cosa","replies":[]},{"poster":"lordeman10","date":"2015-02-12T01:10:31.448+0000","up_votes":1,"down_votes":0,"body":"Te digo, aveces hay que romper las pelotas un poco para que las cosas que están mal mejoren, así es la vida\n\ncon esto no quiero hacer una apología de esa gente que se queja de cualquier banana pero hay muchos reclamos que están bien fundamentados","replies":[]},{"poster":"JimenaBaronFanN1","date":"2015-02-11T21:41:14.147+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Buffa001,realm=LAS,application-id=v7qsfXsE,discussion-id=IlQ9rQG6,comment-id=,timestamp=2015-02-10T19:50:49.392+0000)\n>\n> Simplemente no entiendo la gente de este servidor... Les permiten tener este juego a su disposición, el cual de hecho es tremendo juego y se la pasan reclamando compensaciones o quejándose de las mínimas ocasiones en los que surgió un problema... Simplemente en lugar de quejarse deberían dejar de jugar si tanto les molesta... Se matan trabajando en el juego, de lo contrario los problemas durarían por horas... Me parece ridículo!\n>  \n> UNA ANOTACIÓN...PORQUE HAY GENTE QUE NO ENTENDIÓ UN PEQUEÑO DETALLE... \n> A mi no me tienen que reclamar nada, solo publique mi opinión para que otros tambien comenten la suya.\n\n\nNo estoy de acuerdo, si no le reclamaramos harían lo que quisieran en el juego lo cual seria muy desagradable y molesto.","replies":[]},{"poster":"Emanueliox","date":"2015-02-11T21:04:39.520+0000","up_votes":1,"down_votes":0,"body":"Loco, con los millones que factura riot games mundialmente al año, minimamente un launcher sin bugs deberian tener, nose, opino eh...\nY si, me reclamo porque ya me gaste mas de 1000 en rp, y si, nadie me obligo,y los pague contento, pero deberian tener un launcher decete para la cantidad de años que lleva el juego y la cantidad de gente","replies":[]},{"poster":"g3r0g3r0","date":"2015-02-11T19:00:45.939+0000","up_votes":1,"down_votes":0,"body":"Si bien hubo muchos casos en los que el problema fue del servidor bananero (Soraka is happy) La realidad es que el principal problema suelen ser los ISP de PESIMA calidad que tenemos en todo LAS. \nYo veo gente qeujandose que el servidor esto, que el servidor lo otro cuando en realidad loque deberiamos hacer el organizarnos y obligar a los estados a que legislen ( y hagan cumplir la legislacion) sobre las empresas proveedoras de inet.\nSi comparamos la conectividdad de latinoamerica con la de europa, podemos ver qeu estamos pagando muchisimo mas (busquen cuanto cuesta una conexion de 10 mb por ej en España, conviertan lo que les cobran a ustedes por lo mismo a euros y comparen).\nPasa que dado que buena parte de la comunidad esta formaada de gente a la que le gusta mas llorar que hacer algo util para cambiar la situcion. Pedirles que vayan a exigirles a sus representantes que cumplan su funcion es como pedirle a Urgot qeu gane el concurso de Ms universo.","replies":[]},{"poster":"GabsLasH","date":"2015-02-11T18:18:43.562+0000","up_votes":1,"down_votes":0,"body":"Ahi esta el conformismo otra vez.\nsobre las compensaciones tenes razón, es estupido pedir rp o algo.\n\nMinimas? un problema? quisiste decir quejarse o reclamar?\nAhhh... si se matan trabajando y lo hacen de a gratis, pero por supuesto, que ridiculo verdad?","replies":[]},{"poster":"Andromeda X","date":"2015-02-11T18:10:25.352+0000","up_votes":1,"down_votes":0,"body":"Es un juego que tienen a su disposición GRATIS. Medio día sin jugar no los va a matar, hagan un juego ustedes sino y no rompan las pelot*s.","replies":[]},{"poster":"Rodrixs","date":"2015-02-11T17:36:58.030+0000","up_votes":1,"down_votes":0,"body":"Normal están los niños ratas y nosotros, tal cual la frase \"están en la edad del pavo\" riot lo sabe mínimo problema se quejan pero es normal la comprensión es nula{{summoner:2}}","replies":[]},{"poster":"CapitanVertigo","date":"2015-02-11T17:08:36.321+0000","up_votes":1,"down_votes":0,"body":"Coincido en general, habría q ver también si lo que se lee en los foros representa a la totalidad delos jugadores del LOL, tengo muchos amigos dentro del juego que NUNCA pasaron por los foros. Si a eso sumamos que muchos de los que si son habituales no postean quedaría un grupo más pequeño de gente que usa el foro para QQs o reclamar de manera soberbia. En resumen, me da la sensación que son menos los intolerantes con LAS pero que se hacen oir más.\n     Aparte, personalmente considero que las formas van más allá de los derechos u obligaciones que tengas o te merezcas, no importa si te crees el dueño del mundo y tenes a todos a tus pies, no hay nada que justifique la falta de respeto, menos en el contexto de un JUEGO.  Si faltas el respeto o sos soberbio no es porque alguien o las circunstancias te obliguen, es porque LO SOS y el problema está en tu actitud (esto vá de manera genérica y no para el creador del post xD)","replies":[]},{"poster":"R I P daenerys ","date":"2015-02-11T16:24:34.819+0000","up_votes":1,"down_votes":0,"body":"alegan por tonterias si al final es juego para disfrutar y no amargase la vida :)","replies":[]}]}