{"poster":"FredRedBeard","date":"2015-05-07T11:19:55.199+0000","title":"Mordekaiser, questo sconosciuto...","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salve a tutti!\r\n\r\nPosto questo messaggio perche&#039; sono curioso riguardo al meta per Mordekaiser.\r\n\r\nE&#039; stato il primo campione che ho sbloccato  e tutt&#039;ora resta il mio preferito per il mid, tuttavia sembra che io sia l&#039;unico a giocarlo. Senza contare che ogni volta che mi ritrovo a giocarlo mi becco insulti e minacce di &quot;report&quot; dagli altri membri del team. \r\nE&#039; davvero un campione cosi&#039; debole per la mid? \r\nFin&#039; ora io ho avuto risultati soddisfacenti con lui: ha una range molto limitata, questo e&#039; vero, ma, contro campioni con maggior range, se giochi i primi livelli stando in difesa ed accumulando feed puoi semplicemente superare l&#039;avversario in equip e fare push quando hai lo scudo al massimo, percio&#039; a me non sembra cosi&#039; terribile, senza contare che dopo il lv 6 puoi trasformare I match in un 6 vs 4 e letteralmente dominare nei teamfight (ed infatti, ho notato che dopo il livello 6 il team avversario ha la tendenza a fare focus su Morde nei teamfight).\r\n\r\nSarei davvero interessato ad avere le vostre opinion al riguardo\r\n\r\nBuona giornata!","replies":[{"poster":"xxG1G4xx","date":"2015-05-07T15:06:07.910+0000","up_votes":1,"down_votes":0,"body":"io l'ho visto solo in mid lane...  ;)","replies":[]},{"poster":"Lord Valotz","date":"2015-05-07T12:15:10.828+0000","up_votes":1,"down_votes":0,"body":"Top è molto più performante, ma l'assenza di cc ed escape è un problema in caso di gank, soprattutto perché spesso ti ritrovi a pushare la lane anche senza volerlo.","replies":[{"poster":"Jay Kenton","date":"2015-05-07T13:29:51.681+0000","up_votes":1,"down_votes":0,"body":"non credo sia più performante top, sinceramente.","replies":[{"poster":"Lord Valotz","date":"2015-05-07T13:53:44.274+0000","up_votes":1,"down_votes":0,"body":"Almeno non hai lo svantaggio del nemico ranged salvo alcuni casi che se è attento difficilmente tu riesci ad avvicinare senza prenderle. Top quando lo avevo provato non mi ero trovato malissimo.","replies":[{"poster":"Jay Kenton","date":"2015-05-07T14:02:54.611+0000","up_votes":1,"down_votes":0,"body":"In top pushi e ti esponi un sacco ai gank; in mid puoi farmare in pace. Il poke è molto relativo, se non sono incarogniti di solito è in buona parte assorbito dallo scudo.","replies":[{"poster":"Lord Valotz","date":"2015-05-07T14:14:57.646+0000","up_votes":1,"down_votes":0,"body":"Anche questo è vero. Non ne sono un assiduo utilizzatore, lo prendo sempre quando è free per farci qualche partita e l'avevo sempre incontrato ed utilizzato top, per questo credevo fosse quella la sua lane naturale.","replies":[]}]}]}]}]},{"poster":"kirchhoff","date":"2015-05-07T12:10:20.566+0000","up_votes":1,"down_votes":0,"body":"Prima del buff era l'unico campione del gioco senza dash/blink, aumenti alla velocità di movimento o cc. Il suo problema è la mobilità.","replies":[]},{"poster":"Frattaglia","date":"2015-05-07T12:08:00.989+0000","up_votes":1,"down_votes":0,"body":"Pusha automaticamente, non ha escape e non ha cc.\n\nEcco perché non è molto amato.","replies":[]},{"poster":"Ryuuzouji Fyrom","date":"2015-05-07T11:38:25.281+0000","up_votes":1,"down_votes":0,"body":"Un consiglio: Giocalo top che contro pick come gnar è una manna dal cielo","replies":[]}]}