{"poster":"FredRedBeard","date":"2015-05-05T11:21:07.761+0000","title":"Specializzarsi vs Multi-role, quale approccio?","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Salve a tutti\r\n\r\nPosto questo messaggio perch&egrave; sono sinceramente interessato ad avere un opinione sui ruoli.\r\n\r\nAl momento sono ancora livello 20, 1 mese di gioco, 8 campioni sbloccati. Nel mio gioco cerco di variare sia le posizioni che i campioni, per acquisire pi&ugrave; esperienza possibile nei vari ruoli (fin&#039;ora il jungling &egrave; ci&ograve; che mi riesce peggio XD ma sono un decente mid con Mordekaiser, and un buon top/supp sia con Nautilus che con Cho&#039;gath). \r\n\r\nAnche nelle ranking in genere si varia di posizione? o conviene pi&ugrave; specializzarsi in un unica lane?\r\n\r\ngrazie mille per le vostre risposte ^^","replies":[{"poster":"Dantazzo","date":"2015-05-05T11:25:27.901+0000","up_votes":2,"down_votes":0,"body":"Il mio consiglio è: sei ancora a livello basso, gioca i champ che ti piacciono senza pensare troppo a queste cose, ci sarà tempo per quello.\nComunque nelle ranked, parlo della coda in solo, non sempre avrai la possibilità di giocare nella tua posizione preferita, io personalmente ho 2 lane dove sono abbastanza bravo ma le altre le so comunque fare in modo abbastanza decente, anche se le gioco peggio rispetto alle mie 2 lane preferite.","replies":[]},{"poster":"FredRedBeard","date":"2015-05-06T17:03:24.936+0000","up_votes":1,"down_votes":0,"body":"Grazie mille per i vostri consigli ^^\n\ncercherò di applicarli in game ^^\n\nbuon gioco a tutti!","replies":[]},{"poster":"Nibbio Bianco","date":"2015-05-06T11:36:44.134+0000","up_votes":1,"down_votes":0,"body":"Specializzarsi in un campione per ogni ruolo.","replies":[]},{"poster":"kirchhoff","date":"2015-05-06T11:31:25.836+0000","up_votes":1,"down_votes":0,"body":"Megli saper fare tutti i ruoli.","replies":[]},{"poster":"Jay Kenton","date":"2015-05-05T12:30:17.101+0000","up_votes":1,"down_votes":0,"body":"Devi giocare per forza multirole finché non avrai 30 campioni e 6 pagine di rune. A quel punto ti consiglio vivamente di specializzarti: ti godrai sul serio megli il gioco e davvero inizierai a renderti conto di migliorare come bravura ed abilità; inoltre potrai lentamente sfruttare ciò che hai appreso per migliorare in altri ruoli.","replies":[]},{"poster":"A Yordle ln Heat","date":"2015-05-05T11:25:37.466+0000","up_votes":1,"down_votes":1,"body":"Trova una via di mezzo: devi avere un tuo ruolo preferito, quello nel quale sei sicuro di non fallire mai, e poi altri due in cui sei discretamente buono, ma mai trascurare i restanti due; fai pratica anche con quelli.\n\nLa cosa migliore sarebbe conoscere le basi di tutti e cinque, masterarne uno e conoscerne bene due.","replies":[]}]}