{"poster":"Êd Vanced","date":"2015-04-17T20:32:29.491+0000","title":"Platin Top und Jungler suchen ein Team","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Hi,\n\nmein langj&auml;hriger DuoQ Partner (Main Jungle {{summoner:11}} / Platin4 http://www.lolskill.net/summoner/EUW/SkiLL%20Lik3 )\nund ich (Main Top {{summoner:12}} / Platin 5 http://www.lolskill.net/game/EUW/&Ecirc;d%20Vanced ) suchen ein Team mit aufstrebenden Absichten und einer menge Spa&szlig;. \n\nWir sind beide weit &uuml;ber 20 Jahre alt und bringen auch so die geistige Reife f&uuml;r ein gutes Teamplay mit. Gerne w&uuml;rden wir einem Team mit Coach und dementsprechendem Coaching beitreten. Kritikf&auml;higkeit ist vorhanden, konstruktive Kritik wird immer begr&uuml;&szlig;t. Wir lassen uns von R&uuml;ckschl&auml;gen nicht unterkriegen, sind aber sehr ehrgeizig und verlangen unseren Teammitgliedern das gleiche ab. Denn zu gewinnen macht mehr Spa&szlig; als zu verlieren. Zeitlich sind wir flexibel und stellen uns w&ouml;chentlich mehrmalige Zusammenk&uuml;nfte ( mind. 3- 5mal ) zum trainieren oder f&uuml;r entsprechende Wettbewerbe vor. Die Elo der Teammitglieder aus der SoloQ sollte nicht im Vordergrund stehen. Jedoch setzen wir ein gewisses Basiswissen voraus, um nicht bei Null anfangen zu m&uuml;ssen. \n\nDie aktuellen und ehemaligen  Metachampions werden von uns beherrscht und immer weiter ge&uuml;bt. Wir orientieren uns dahingehend an der professionellen E-Sport Community und holen uns Vergleiche aus aktuellen Tier-Listen ein, um immer konkurrenzf&auml;hig zu bleiben. \n\nBei Fragen sind wir selbstverst&auml;ndlich &uuml;ber den Lol-Client, als auch hier zu erreichen.\n\nMeldet Euch einfach bei : \n\n- SkiLL Lik3\n- &Ecirc;d Vanced\n\nIch freue mich auf Euch und sofern wir nicht in Euer Team passen w&uuml;nsche ich Euch alles Gute und viel Spa&szlig; in der momentanen LoL Ladder.","replies":[{"poster":"Êd Vanced","date":"2015-04-24T13:42:13.495+0000","up_votes":1,"down_votes":0,"body":"bump","replies":[]}]}