{"poster":"CinnamonBunsX","date":"2019-06-08T14:45:53.823+0000","title":"Current PBE version of Liandries with madness changes is really big nerf to core users","subforum":"Gameplay","up_votes":13,"down_votes":2,"body":"This is my first post on the boards so feel free to delete this or move this if its in the wrong spot.\r\n\r\nI don't mind how the damage stacks on ROA and Liandries it's fine what I'm talking about is the changes to the Madness passive.  Where instead of getting flat damage increase they are giving you flat ap per stack of madness. What I don't understand is Liandries has almost always been designed for champs with Low amounts of AP and generally have subpar AP scaling so it seems like a huge nerf for most of the users of the item in general. Most users of laundries have been relegated to the support role or off tank,  as it is and they mostly have higher base damage and poor scalings. Plenty of high ap items already exist for champs and they are pretty bad at stacking it in most cases, so it gives them no incentive to build it.    \r\n\r\nThey nerfed magic pen off the item already (which is fine we all know it was getting abused by users with good ap scalings to one shot people) but it really hurt users that had poor AP scalings and this just seems like another nerf for users with Poor AP ratios.\r\n\r\nAlso, you don't even bother to address Zyra in any of your notes about Liandries and she has been the most OG and core users of it for years. Plants don't get updated when you get more ap (or less) , so the new madness passive is huge for not only the fact she has poor ap ratios her plants don't get updated makes the madness passive significantly worse on her, the same thing could be said for brand as well. He loses damage from his flat % hp passive because madness will just give flat ap rather than more damage.\r\n\r\nPlease reconsider giving the item flat AP it just a nerf to users of the item and it will not provide almost any new incentive among non-users that were not building it before.","replies":[{"poster":"Z3Sleeper","date":"2019-06-08T20:44:10.434+0000","up_votes":9,"down_votes":2,"body":"+10% to *all* damage on an item should have never existed in the first place.","replies":[{"poster":"CinnamonBunsX","date":"2019-06-09T21:07:07.029+0000","up_votes":2,"down_votes":0,"body":"That fine if doesn't exist but the item has always been designed as a go-to option for champs with lower ap ratios or have to build defensively giving it a new passive the just gives it stacking ap is counter-intuitive for most people that want to use it. Even AP bruisers (unless your name is singed)  will rarely get stacking value out of it because the often desire cheap cdr (it has none). The item should not be given stacking ap either leave the 10% to damage passive (which is really difficult to stack its not ner as op as you think it is unless your name is malz, brand or zyra or anivia, singed).\n\nI mean if we're going to go that route lets start off naming things that exist that are in the game (ravenous Hunter,taste of blood, wits end passive, Conquer, 2 tenacity  passives, Spear of Sojin) I could go on here. You don't seem to be offering any suggestions here, you just seem to be against things you don't like. \n\nIm not arguing for the madness passive to continue to exist im arguing the flat stacking ap passive is counter-intuitive to the core users of Liandries, and it's only truly beneficial on a few champs and brings in almost no new champs that wouldn't already build it.","replies":[{"poster":"Z3Sleeper","date":"2019-06-09T21:14:51.373+0000","up_votes":1,"down_votes":0,"body":"DFG was removed, core users negatively affected were compensated.\nSpell vamp removed, core users negatively affected were compensated.\nMorello removed and replaced by Lost Chapter lines, core users negatively affected were compensated.\n\nLiandrys is going to be changed, fill in the blank.","replies":[{"poster":"CinnamonBunsX","date":"2019-06-09T23:16:05.993+0000","up_votes":1,"down_votes":0,"body":"Champs that built DFG either A already had enough power and had good alternative build paths. Champs like fizz were compensated in a way that took years and multiple mini reworks of his W before he settled into a place. Katarina stayed in an awful place for years till they mini reworked her kit. Riot never even compensated some of the users it took years to get them back to a place. \n\n\"Spell vamp\" It was a vlad item, and he was mini reworked (so planned at the same time)  with its removal into his current state. Thats a pretty bad example. \n\nMorello is not even comparable that was a planned out so mages he other options to build as their first item and everyone knew that the lost chapter line would replace it. \n\nLiandries currently has no compensation buffs for any of its core users they are making it worse on them and they have no item up for discussion for mages that heavily built Liandries.  They are strait nerfing the item for core users and have no plan in place but a wait and see approach and since most of the champs that built liandries have low playrates and don't have pro presence, users laugh at the idea that their champs will see compensation buffs anytime soon or ever.","replies":[{"poster":"Z3Sleeper","date":"2019-06-10T02:40:01.097+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CinnamonBunsX,realm=NA,application-id=3ErqAdtq,discussion-id=gtZp0b1j,comment-id=0001000000000000,timestamp=2019-06-09T23:16:05.993+0000)\n>\n> Riot never even compensated some of the users it took years to get them back to a place. \n\nBut they got back to their place and I have high hopes for Riot 2k19 :)\n\n> \"Spell vamp\" It was a vlad item, and he was mini reworked (so planned at the same time)  with its removal into his current state. Thats a pretty bad example. \n\nIt's actually a prime example exactly for what you stated. A champion relied on it and upon its removal he was compensated (immediately too).\n\n(Also Cassiopeia was affected as well thus why her rework has healing on E now).\n\n> Morello is not even comparable that was a planned out so mages he other options to build as their first item and everyone knew that the lost chapter line would replace it. \n\nAnd Madness passive is being replaced by a similar Madness passive. Seems pretty comparable to me.\n\n> Liandries currently has no compensation buffs for any of its core users.\n\nIt's not even on PBE yet (I think, might be up today haven't checked). So ofcourse there are no compensation buffs yet. They haven't tested it yet.\n\n> users laugh at the idea that their champs will see compensation buffs anytime soon or ever.\n\nOnce again, high hopes for Riot 2k19 :):):)\n\nThis change needs to happen, we shouldn't be protesting it based on the fear that users won't be compensated.","replies":[]}]}]}]}]},{"poster":"Kelg","date":"2019-06-08T17:02:24.797+0000","up_votes":6,"down_votes":4,"body":"It's meant for champs like {{champion:50}} {{champion:68}} {{champion:82}} {{champion:517}} {{champion:27}}  who want to stay in the fight longer","replies":[{"poster":"CinnamonBunsX","date":"2019-06-10T02:46:11.725+0000","up_votes":1,"down_votes":0,"body":"I will give you swain (the problem being that he will get this item 3rd at the earliest in most games rarely go it second item), but Sylas wants cheap cdr, you almost will never see this item on him (point in the orginal post about how this version of madness doesn't make almost any champ that did not build it want it more). Current mord builds very low amounts of AP (remember item with current madness passive benefits low ap users)  and its rare games go long enough to ever long enough for him to get value out of liandries having more ap value and he doesn't build Rod of ages which decrease the value even more.  I will put singed into this category as well, and contest its an optional item on and has multiple build paths. Rumble is the only real befit in your list because he will get liandries done every game, I don't know if his ult or flame splitter will get its damage updated as the madness goes up though. If it doesn't then I don't see a benefit for the new madness for him outside or late laning phase and maybe 20-25 min team fights.\n\nThe only champs that benefit to the changes are, cassio, azair ryze, swain and aniva and the first 3 champs already have great alternative build paths so it seems silly to give them more items and forgo other champs that rely on it (plus they don't even build it before 3rd item) and Anivia probably won't get to finish liandries in a lot of her games because the game will be won or lost already, but hey at least she gets actual benefit out of it because its her only real build path unlike the other ones I listed. Same opinion for swain a champ that will rarely get to build.  ","replies":[]},{"poster":"Death KarnEvil","date":"2019-06-09T17:51:06.913+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kelg,realm=NA,application-id=3ErqAdtq,discussion-id=gtZp0b1j,comment-id=0000,timestamp=2019-06-08T17:02:24.797+0000)\n>\n> It's meant for champs like {{champion:50}} {{champion:68}} {{champion:82}} {{champion:517}} {{champion:27}}  who want to stay in the fight longer\n\nwhat about malz who without its curreent form loses to everyone? and thats prior to them finnishing qss?","replies":[{"poster":"Kelg","date":"2019-06-09T23:13:55.743+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Death KarnEvil,realm=NA,application-id=3ErqAdtq,discussion-id=gtZp0b1j,comment-id=00000000,timestamp=2019-06-09T17:51:06.913+0000)\n>\n> what about malz who without its curreent form loses to everyone? and thats prior to them finnishing qss?\n\nhe needs a vgu tbh his ult is toxic","replies":[]}]}]},{"poster":"Kaisha","date":"2019-06-09T07:10:47.562+0000","up_votes":2,"down_votes":3,"body":"I think RIOT just wants all AP casters out of the game entirely.  Anytime they're more than simply fodder for assassins they get nerfed into the ground.","replies":[{"poster":"LTK KoRo","date":"2019-06-09T08:25:30.135+0000","up_votes":4,"down_votes":2,"body":"that's why ryze is the toplaner in the pro play and that's why mages dominate soloq\n\nyeah buddy ur totally right","replies":[{"poster":"CinnamonBunsX","date":"2019-06-09T20:55:03.838+0000","up_votes":1,"down_votes":0,"body":"Ryze being good in pro play almost has nothing to do with his status as a mage, it has everything to do with  targeted ranged root cc, some map mobility and safe wave clear","replies":[]}]}]},{"poster":"Jinzo Torrance","date":"2019-06-10T15:05:23.803+0000","up_votes":1,"down_votes":0,"body":"It's actually pretty bad because most of the core user damage spells are not dynamic (they snapshot the AP stats of the user when cast, ex. Heimer turrets, ZYra plants, Malz Voidlings, E and R, Brand R), once they make their spells dynamic it will be probably pretty good on them.\n\nThe AP increase should be in percentage though since it scales very poorly compared to the old % dmg increase (and takes longer to stack too).\n\nAlso you have to ask yourself, was it really good design getting a 10% dmg amp? Having a low ratio should mean that Riot wants you to do less damage on such spells.","replies":[]},{"poster":"iiGazeii","date":"2019-06-09T21:05:41.461+0000","up_votes":1,"down_votes":0,"body":"I'm not seeing this version of Liandries on Surrenderat20. Did the PBE just get updated, or maybe a Dev post about it?","replies":[{"poster":"Z3Sleeper","date":"2019-06-10T02:47:08.995+0000","up_votes":1,"down_votes":0,"body":"It's on Riot Repertoir's twitter. Still a WIP but the main idea is removing the % all damage increase and changing it to either a flat or % AP increase.","replies":[]}]}]}