{"poster":"WAHOOKA","date":"2015-06-10T08:10:01.656+0000","title":"¨un riot para los sadicos¨","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":6,"body":"Este post no esta dirigido a la gente que piensa que riot esta haciendo un buen trabajo, si sos uno de ellos por favor no sigas leyendo, no me interesa conocer tu opinion.\r\n\r\n\r\n**Es reprochable quedarse afk?**\r\n\r\nA ver si alguna persona razonable puede explicarme por que riot obliga a los jugadores a permanecer en una partida, pero no garantiza que se den las condiciones minimas de &uml;jugabilidad&uml;. La obligacion de no abandonar una partida LLEVA IMPLICITO EL PRESUPUESTO DE QUE ESA PARTIDA... PUEDA JUGARSE.\r\n\r\nImaginemos que alguien entra con blitzcrank con la idea de tirarle la Q a todos los monstruos de la jungla que intente hacer el jungler. Si, es un enfermo que se divierte viendo como un jugador tiene que estar treinta minutos en una partida caminando sin sentido porque si deja de caminar... lo sancionan por afk XD\r\n\r\nDigamos que las normas estan siendo utilizadas para la satisfaccion de los sadicos, y la desgracia de los jugadores con buena fe. Y que ademas, riot al no hacer nada consiente que asi sea.","replies":[{"poster":"rokushoger","date":"2015-06-10T12:04:22.706+0000","up_votes":1,"down_votes":0,"body":"Tenés razón hasta el punto de que Riot debiera garantizar que puedas jugar perfecto la partida para luego sancionarte por irte afk. También te doy la razón en que Riot no está haciendo las cosas bien.\nAhora no tenés razón si lo que intentás es justificarte de que te fuiste afk porque alguien te sacaba los monstruos de jungla (y smite para que no?).\nComo dijo juanmayeri, tanto irte afk como trolear para mí es altamente sancionable, y no sos mejor que un troll si te quedás afk.","replies":[{"poster":"WAHOOKA","date":"2015-06-12T02:48:53.174+0000","up_votes":1,"down_votes":0,"body":"un blitz puede sacarte el buff de lugar y hacer que se regenere a full hp al momento que le bajaste la mitad de vida y aun te falta mucho para matarlo. tener smite no evita eso.","replies":[{"poster":"rokushoger","date":"2015-06-12T10:53:03.482+0000","up_votes":1,"down_votes":0,"body":"Lo que intento decirte es que no sos diferente a ese troll si te quedaste afk, simplemente eso. No hay excusas. Te quedas afk = tenes que recibir castigo.","replies":[]}]}]},{"poster":"Cami1","date":"2015-06-10T14:20:26.475+0000","up_votes":1,"down_votes":0,"body":"Primero, RIOT no te obliga a permanecer en una partida. Segundo, ellos no te pueden garantizar que la partida será ni tendrá las condiciones mínimas de \"jugabilidad\" puesto que no saben quién está del otro lado de la pantalla y lamentablemente los emparejamientos son random y dependen de tu KDA general.\n\nSi te tocó un troll, lamentablemente a todos les ha pasado, nadie tiene la culpa, solo tu KDA... \n\nHay personas que simplemente entrar a hacer malo el ambiente porque en su día les fue mal, se levantaron con el pie izquierdo, porque se sacaron una mala nota, les dijeron algo feo... Anda a saber tu qué fue lo que pasó... \n\nPero en resumen, lo que yo creo es que deberían tomar más en cuenta los **reports** y no hacerse los sordos. \n\nDebieran hacerse cargo de las denuncias colectivas (tanto en partidas, como en la identificación de un jugador troll que sale en distintas partidas echándolas perder en reiteradas ocasiones). \n\nEn fin, a veces creo que eso solo es un pensamiento y jamás van a ponerse los pantalones con el tema de los ban permanente a los trolls... \n\nAhora, es igual de indignante que quien es trolleado por X persona se vaya AFK porque te penalizan por salir de la partida, pero nadie ve el motivo... Yo lo veo de esta forma, si me salgo de partida le doy en el gusto y cumplo su propósito. Todo va la paciencia que tengamos. \n\nSi no cambiamos nosotros, los que si queremos un ambiente de juego mejor, no esperes que alguien mas lo haga por ti...\n\n¿Cómo se calma el fuego? Echándole agua, no complementando con mas viento o más fuego. Demostremos a todos los troles que los que si queremos un LOL mejor, con nosotros no van a poder...\n\nActitud es poder...","replies":[{"poster":"WAHOOKA","date":"2015-06-12T03:00:22.677+0000","up_votes":1,"down_votes":0,"body":"1) desde el momento que te imponen una sancion por dejar de jugar una partida... te estan obligando a que no abandones.\n2) riot TIENE EL DEBER de garantizar que las partidas tiengan un minimo de jugabilidad!!!! que no sepan quienes van a jugar no los exime de ese deber... seria como decir que el gobierno no tiene el deber de garantizar la seguridad en la calle porque no sabe con quien te podes encontrar.\n3) desde la perspectiva de la razon, quedarse afk cuando un jugador vuelve la partida sin sentido... podria ser cuestionable cuando este tipo de situaciones son excepcionales, pero cuando los trolls no son la excepcion sino la regla... quedarse afk es lo mas logico e irreprochable.","replies":[]}]},{"poster":"Juanmayeri","date":"2015-06-10T08:21:05.073+0000","up_votes":1,"down_votes":0,"body":"Tanto trolear como estar afk estan mal de donde las mires cualquiera sea el motivo que afecte negativamente a el desempeño de el team y digno de ser reportado.\nAdemas, creo que estas haciendo un mal uso de la palabra sadico porque no creo que el jg sufra porque le saca blitzcrank los monstruos naturales porque en cualquier caso tiene el castigo para matarlo.","replies":[]}]}