{"poster":"Alperen Is High","date":"2016-08-27T21:58:18.017+0000","title":"LeaverBuster","subforum":"Hilfe & Support","up_votes":1,"down_votes":3,"body":"Hi.\r\nmanchmal wenn ich ein spiel anfange kommt ein dc bildschirm friert ein und ich muss pc neu starten und wenn ich wieder rein komme ist das spiel abgebrochen und ich krieg so ne bestrafung ich find das system LeaverBuser ist ein mist. tut mir leid aber ist so.\r\nmfg","replies":[{"poster":"Alustus","date":"2016-08-27T22:12:10.553+0000","up_votes":2,"down_votes":1,"body":"Ich finde deine Einstellung ist Mist.\n\nDu versaust mit deinen DCs bis zu 9 anderen Spielern das Spiel und regst dich dann auf wenn du Bestraft wirst?\n\nDie einfachste/beste Lösung entweder du fixt das problem (neuer rechner oder besseres Internet, oder sonstige lösungen) oder du hörst auf zu spielen.\n\n\nVllt mal an die anderen denken bevor man so Egoistische Urteile fällt und den schutz der Mtspieler verteufelt.","replies":[{"poster":"Alperen Is High","date":"2016-08-27T22:14:01.477+0000","up_votes":1,"down_votes":2,"body":"Alter was regst du dich so auf ich bin nach 4 minuten wieder im spiel passiert halt manchmal anfang des spieles aber mitten drin nicht ich versau kein spiel bitte schreib nicht mehr unnötig","replies":[{"poster":"thefire7","date":"2016-08-27T22:30:33.621+0000","up_votes":1,"down_votes":0,"body":"> schreib nicht mehr unnötig\n\nWeißt du was unnötig ist??\n\n... das!\n\n> Hi.\nmanchmal wenn ich ein spiel anfange kommt ein dc bildschirm friert ein und ich muss pc neu starten und wenn ich wieder rein komme ist das spiel abgebrochen und ich krieg so ne bestrafung ich find das system LeaverBuser ist ein mist. tut mir leid aber ist so.\nmfg","replies":[]}]}]},{"poster":"thefire7","date":"2016-08-27T22:10:02.642+0000","up_votes":2,"down_votes":1,"body":"> Hi.\n\nHallo\n\n\n> manchmal wenn ich ein spiel anfange kommt ein dc bildschirm friert ein und ich muss pc neu starten\n\nliegt an deinem Pc, bzw. CPU-Benutzung und dein Computer wird dadurch zu heiß und gibt zur Sicherheit vorübergehend den Geist auf. Du hast während LoL zu viele Programme am Laufen bzw. möglicherweise Viren (check das mal).\n\n\n> wenn ich wieder rein komme ist das spiel abgebrochen und ich krieg so ne bestrafung\n\nDas ist die Regel und ist für alle so. Stell dir vor du bist mit jemandem im Spiel der Anfangs nicht da ist (das ist schon ziemlich frustrierend) und dann ca zur Vierten Minute zurückkehrt, der Gegner von ihm aber schon solch gravierende Vorteile erhalten hat, die Lane schon verloren ist und evtl. das Spiel. Dieses System kann dir zum Vorteil dienen oder zum Nachteil. Da es häufiger dir zum Vorteil (hoffentlich) dient, ist es doch ein allgemein gutes System.\n\n\n> ich find das system LeaverBuser ist ein mist.\n\nLeaver-Buster* (2'tes Merkmal, dass du zu viele Pornos schaust Kappa)\n\n> Dieses System kann dir zum Vorteil dienen oder zum Nachteil. Da es häufiger dir zum Vorteil (hoffentlich) dient, ist es doch ein allgemein gutes System.\n\n\n> tut mir leid aber ist so.\n\nRührend, aber ne.\n\n\nDankeschön.\n\nthefire7","replies":[{"poster":"Alperen Is High","date":"2016-08-27T22:12:30.653+0000","up_votes":1,"down_votes":0,"body":"Dann hab ich halt ein nachteil ja und ich komm trotzdem zurück ins spiel dafür werden mir noch lp abgezogen und ne ich schau mir keine pornos an bin nur high","replies":[{"poster":"Alustus","date":"2016-08-27T22:56:45.673+0000","up_votes":1,"down_votes":0,"body":"In den ersten 4 Minuten kann man einen Großen Rückstand bekommen.\nAußerdem musst du auch die Level und das Gold wieder aufholen.\n\nHinzu kommt das das eigene Team gerne mal demotiviert wird.\nSei es weil der Jungler auf der falschen seite anfangen muss, der adc am anfang keinen Support hat , der gegner Counterjungln kann ohne bestraft zu werden ...","replies":[]},{"poster":"TerrorRaven","date":"2016-08-27T22:25:00.531+0000","up_votes":1,"down_votes":0,"body":"Ein Nachteil, der das Spiel kosten kann und deinem Team den Spielspaß raubt.","replies":[]}]}]}]}