{"poster":"Internius","date":"2015-05-06T18:20:42.710+0000","title":"Kleine Diskussion unter Noobs","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Wir f&uuml;hren grade eine kleine Diskussion unter Noobs. Macht es Sinn in einer Teamcomb Janna+Malphite zu picken? Vom Grundgedanken her, mal rausgenommen, dass jeder Champ seinen Platz, seinen Zweck und Nutzen hat.","replies":[{"poster":"haha weed lol xd","date":"2015-05-07T11:51:58.995+0000","up_votes":2,"down_votes":0,"body":"Kenne deine Champions und deren Synergien. \n\nAuf der Botlane gibt es zb unterschiede zu aggressiven und passiven ADC. Diese brauchen dann eher unterschiedliche Champions. \nEine Jinx und eine Vayne die im early furchtbar schwach sind passen gut zu einer Nami, Janna oder Sona. \nEin Graves oder Lucian die wirklich auf der Lane sehr stark sind passen hervorragend zu einer Leona oder Thresh die eher aggressiven Spielstil haben. \n\nIn der Mitte würde ich etwas picken was zu deinem Jungler passt sprich ein Amumu, der das ganze Team betäuben kann spielt gut mit einer Katarina, die sich dann um Disables für ihrer Ult keine Sorgen machen muss. \nChampions wie Jarvan, Shyvanna, Maokai, die zwar Gapcloser und SoftCC mitbringen aber keinen relativen Disable für einige Sekunden stehen besser mit einer Orianna oder Ahri die aus sicherer Entfernung vernichtend sein kann. \nDer Toplaner sollte darauf bedacht sein so gut wie es geht dem Gegnerteam im weg zu stehen. \nNatürlich gibt es gut Top-Jungle Synergien aber alles im allem sollte der Toplaner etwas picken, was der Albtraum für die gegnerichen ADC ist. \n\nEin Gnar oder Renekton ist hervorragend für unmobile Carrys wie Miss Fortune oder Jinx, wobei eine Irelia oder Jax, die wirklich lange an ein Ziel dran bleiben können mehr Panik an mobilen Champ wie Lucian, Vayne oder Graves verbreiten kann. \n\nMein Tipp, Gnarvan Kombo  ( Gnar + Jarvan 4 ) dazu eine Orianna ( sowieso einer der besten Teamranked Picks überhaupt ) , eine Ashe ( nach dem Rework ) Leona Botlane. \nDas ist ein solides Gerüst aus Schaden-CC und Sichere Lanes. \n\nmfg. Larry","replies":[]},{"poster":"SorisDynasty","date":"2015-05-06T19:29:14.682+0000","up_votes":2,"down_votes":0,"body":"Man muss nur aufpassen, das man sich nicht gegenseitig behindert in der Kombination. Ansonsten kann man das recht gut machen - besonders, weil der Gegner dadurch Janna gar nicht erst picken kann, um das Ganze womöglich zu kontern.","replies":[]},{"poster":"PlanetenPlatzer","date":"2015-05-06T19:22:57.747+0000","up_votes":2,"down_votes":0,"body":"Ja sie sind schon gut zusammen. Wenn du mit Janna einen guten Wirbelsturm (Q) landest, dann kann Malphite direkt mit seiner Ult nachsetzen. Das kann eure Gegner hart zerfetzen.\nJedoch kann man mit Janna auch alle Gegner wegstoßen und Malphite ins Leere rennen lassen. ;)\n\nAber solange ihr aufpasst, solltet ihr damit eine relativ gute Chance auf einen erfolgreichen Teamkampf haben.","replies":[]},{"poster":"Lady Yunalesca","date":"2015-05-06T18:35:10.255+0000","up_votes":2,"down_votes":0,"body":"uhm ich sehe keinen Grund warum man dies nicht tun sollte?^^","replies":[]},{"poster":"Marauth","date":"2015-05-07T09:02:10.353+0000","up_votes":1,"down_votes":0,"body":"theoriecrafting ist ein essenzieller Bestandteil von LoL im kompetiven Bereich (Ranks).\n\nKenne die Champs, ihre Vor- und Nachteile, sowie ihr Zusammenspiel.\n\nAlso, ich musste damals zugeben, dass lustigste zusammenspiel hatte ich damals mit meinen Nautilus.\n{{champion:111}} Schild anwerfen, {{champion:61}} Schild drauf und dann noch {{champion:117}} mit Schild und Ulti... Lieber Gott. Dieser Schildbalken und Nautis Größe :D Sowas verbreitet Angst und Schrecken.\n\nWas z.B. garnicht geht ist in einen AP-Team (rang) einen Blitzcrank mitnehmen, während im Gegnerteam die Melees hocken. Wie oft durften wir schon zusehen, wie ein Alistar, Leona, Garen oder Mundos plötzlich in den eigenen Reiehen stehen durften... sowas ist mehr als uncool.","replies":[]},{"poster":"dugg","date":"2015-05-07T05:30:37.158+0000","up_votes":1,"down_votes":0,"body":"Es macht immer Sinn seine Champs innerhalb des Teams zu kombinieren. Allerdings nur, wenn man diese Combos dann auch beherrscht. Es ist dann auch ratsame über TS oder ähnliche Programme zu sprechen, damit man sich besser absprechen kann.\n\nEin Fall war zum Beispiel (ich Support Morgana, ADC Kalista). Die Ultis kann man super miteinander kombinieren. Kalista \"wirft dich rein\", du zündest deine Ulti und schmeißt Zhonyas an. Kann super funktionieren! Richtig, kann... \nIn dem Fall war es so, dass er gar nicht verstanden hat, was ich von ihm will und ich autark von seiner Ulti meine gezündet habe. Noch bevor mein Ulti den Stun erreicht hat, hat er mich mit seiner Ulti gefesselt und damit meine Ulti vorzeitig beendet...\n\nCombos funktionieren super, wenn sie geübt werden und gut abgesprochen sind.","replies":[]},{"poster":"OrangeBubble","date":"2015-05-07T00:33:28.585+0000","up_votes":1,"down_votes":0,"body":"Janna ist für den Disengage, Malphit für den Engage zuständig. Wenn die beiden ihre Aufgaben kennne, ist es eigentlich eine gute Kombo, da man guten Engage und Disengage hat :)","replies":[]},{"poster":"Sebbo99","date":"2015-05-06T19:29:49.422+0000","up_votes":1,"down_votes":0,"body":"ja \n","replies":[]},{"poster":"Hadazard","date":"2015-05-06T18:48:28.379+0000","up_votes":1,"down_votes":0,"body":"Beide haben guten CC also finde ich,dass das eigentlich keine schlechte Idee ist. (+Beide starken disengage)","replies":[]}]}