{"poster":"Gragas Undressed","date":"2014-11-11T17:55:37.959+0000","title":"Charred Maokai VU","subforum":"Concepts & Creations","up_votes":44,"down_votes":12,"body":"I have to say, I'm befuddled at this \"visual update\". Not only is this 975RP skin now essentially a recolor of the base model, it's a recolor that looks like a different champion. Now Charred Maokai looks like Malphite. This skin is extremely lackluster and really loses the concept of the skin, a charred treant scarred by fire. Now he is Charred Maokai the Rock Impersonator. This skin offer nothing at this point and is an extreme disappointment. Riot really has dropped the ball on this VU and Maokai has lost his identity as the Twisted Treant.","replies":[{"poster":"Jesnir","date":"2014-11-11T21:48:50.124+0000","up_votes":12,"down_votes":0,"body":"When I first played with a Maokai with the Charred skin, I thought I had a Malphite on the team.\n\"Wait when did we have a Malphite on our team\"\n\"Dude I'm playing maokai\"\nLMAO","replies":[]},{"poster":"AF Shogun","date":"2014-11-11T20:59:14.580+0000","up_votes":9,"down_votes":1,"body":"He does look like malphite","replies":[{"poster":"Gragas Undressed","date":"2014-11-12T13:28:54.286+0000","up_votes":4,"down_votes":0,"body":"I keep expecting him to say \"Rock Solid\"","replies":[{"poster":"Hojo Lodis","date":"2014-11-13T01:22:34.564+0000","up_votes":1,"down_votes":0,"body":"Correction\n\n\"Wood Solid\"\n\nBut you know....","replies":[]}]}]},{"poster":"John Berserk","date":"2014-11-12T00:59:41.960+0000","up_votes":8,"down_votes":1,"body":"\"Riot really has dropped the ball on this VU and Maokai has lost his identity as the Twisted Treant.\"\n\nOk, that's a little extreme for just ONE of his skins being meh. The rest seem pretty great to me.","replies":[{"poster":"Gragas Undressed","date":"2014-11-12T13:21:32.471+0000","up_votes":3,"down_votes":0,"body":"You're right. I really just meant the VU for this particular skin has caused him to lose his identity. I think Totemic is actually kind of cool looking. Festive isn't terrible. The base skin looks good. As a big fan of the Charred skin though I'm just quite disheartened with the current state of it.","replies":[{"poster":"roflSong","date":"2014-11-16T01:21:46.010+0000","up_votes":1,"down_votes":0,"body":"The only skin that I feel is worse is Charred Maokai. Every other skin was an improvement. And since Charred was my hands-down favorite I'm really upset. I went from being excited to take Mao in the new jungle to feeling sick to my stomach about it. I really hope the Charred skin is just a placeholder. Q_Q","replies":[]}]}]},{"poster":"PhoenixSlayer13","date":"2014-11-12T05:06:28.984+0000","up_votes":4,"down_votes":0,"body":"I think a darker coloring and deeper red would help.","replies":[]},{"poster":"Star Warden","date":"2014-11-11T20:26:22.350+0000","up_votes":4,"down_votes":0,"body":"Now you know how we Sakura karma players feel. Without the fans the skin loses literally the entire purpose. Without Mao's skin being charred to nearly black, the skin is meh.","replies":[]},{"poster":"inmUGco","date":"2014-11-12T13:00:58.944+0000","up_votes":3,"down_votes":0,"body":"yes，agree！Too much like {{champion:54}} ！do not like charred trees~is stone！","replies":[]},{"poster":"DrMemes","date":"2014-11-11T20:55:42.633+0000","up_votes":3,"down_votes":0,"body":"I thought this was going to be a post talking about how the skin was great, they I opened the images. \n\nYea it sucks.","replies":[]},{"poster":"Thoroniul","date":"2014-11-11T17:57:53.220+0000","up_votes":3,"down_votes":0,"body":"Yams I say.\n\nhttp://boards.na.leagueoflegends.com/en/c/gameplay-balance/jGzgqote-totemic-maokai-needs-to-remain-black?comment=0000","replies":[{"poster":"Gragas Undressed","date":"2014-11-11T18:14:36.506+0000","up_votes":4,"down_votes":1,"body":"Absolutely. Charred Maokai is now Yamkai, Defender of Tubers!","replies":[]}]},{"poster":"Fomortiis","date":"2014-11-13T17:03:32.448+0000","up_votes":2,"down_votes":0,"body":"I completely agree, the base model looks great now. The old one looked like a mess really. But as far as the charred maokai skin, it leaves a lot to be desired for. As many have already stated, the palette is very much on the light side, too bright without the charred contrast. I also see a lot of potential for new fire anims for this skin, although I understand this skin is not a 750RP one. Lastly, I recall the VU was aiming for a harder hitting twisted advanced anim, but quite frankly it looks worse than it was before the VU, very underwhelming.","replies":[]},{"poster":"AleMage","date":"2014-11-12T18:45:05.379+0000","up_votes":2,"down_votes":0,"body":"Hm, you're right he really feels like a recolor right now.  But perhaps some burning particles will fix this? nothing like volcanic wukong just a slight burn effect. and make him darker like he was before.  An other nice touch would be to have his model warped a lil too.","replies":[]},{"poster":"Bowlbo","date":"2014-11-12T16:48:42.863+0000","up_votes":2,"down_votes":0,"body":"It's still on PBE. I sort of agree that a 975RP should have some clear particle/model alteration. They may still change this yet, Riot is pretty receptive to the concerns of its community, just look at the pulled Ahri splash. (Not that I agree with that- loved the new splash) Be patient and wait for more upvotes, you'll get em.","replies":[]},{"poster":"Smoggert","date":"2014-11-12T01:25:19.632+0000","up_votes":3,"down_votes":1,"body":"Maokai is my favourite champion.\n\nI'm quite happy I have totemic Maokai as well as the charred skin.\nCharred ***was*** my favorite skin, but as many said before me, this VU makes a joke out of the charred skin.\n\nAlso I'm not a fan of the new walking cycle, it's like he's floating on air... he's supposed to be a freaking treant, they don't float they make heavy stomps !","replies":[{"poster":"Gragas Undressed","date":"2014-11-12T16:22:04.912+0000","up_votes":2,"down_votes":0,"body":"I think you make a really good point on the walking animation. He should definitely be stomping around the map!","replies":[]}]},{"poster":"DSRM Mobius","date":"2014-11-12T13:57:16.453+0000","up_votes":2,"down_votes":0,"body":"i  agree with you, but I still like the skin idea.","replies":[{"poster":"Gragas Undressed","date":"2014-11-12T16:21:16.033+0000","up_votes":2,"down_votes":1,"body":"Yeah, the skin concept is awesome. The old version of Charred Maokai was awesome. It's just this iteration that looks so blah that it makes my head hurt. This skin has SO MUCH potential.","replies":[]}]},{"poster":"Ruigtand","date":"2014-11-12T08:29:02.554+0000","up_votes":3,"down_votes":1,"body":"As a big fan of the awesome tree that is maokai, I am also really disappointed by this charred skin!\nI really hope they listen to the community like they did with that sion skin.\nWhen I look at it I wonder if Riot actually took the time to look at it :P.. people all seem to think its bad, so why don't they.\nGuess I shouldve bought Haunted Maokai when I had the chance.. never gonna play with this skin again if this is the end result :P\n\nOn a more positive note, I really like the VU in general and IMO all skins except charred (which just happens to be my only maokai skin) look a lot better. Nice skill animations and all. Just hope they take another look at charred maokai","replies":[{"poster":"Gragas Undressed","date":"2014-11-12T16:19:30.107+0000","up_votes":2,"down_votes":1,"body":"I agree with you. I think the updated champion model looks really good, the spell effects look awesome, and I really like how he claps his hands over his head when he activates his ult. The majority of skins look good now. It's just the Charred skin that doesn't live up to expectations.","replies":[]}]},{"poster":"Wynsl","date":"2014-11-12T06:05:06.530+0000","up_votes":3,"down_votes":1,"body":"I kind of liked the old Charred Maokai better. It really looked badass.","replies":[]},{"poster":"Sisuwolf","date":"2014-11-12T00:07:46.506+0000","up_votes":2,"down_votes":1,"body":"Well then VU, sure am glad I didn't buy Charred Maokai. Already had Christmas Tree Mao and really wanted the Charred version also as IMO it WAS one of the coolest looking Mao skins. Already dissappointing enough to see how Festive Mao turned out, glad I didn't waste money on Charred since I'd never use it post-VU. Reminds me of the Orange Crush Rammus they destroyed with a \"VU.\" Dat Orange powerball used to be my favorite Ramm skin, now i use anything except that one, would've been the same for Charred for me.\n\nTo be fair, I don't hate all VU's. In actuality I think most of the time they get it right. For example I think base Mao and Haunted are good upgrades, on the fence about the Totem(some good changes but also some bad), but hate the other two. Just so happens that the ones they always ruin happen to be my favorite skins. Maybe I got bad taste or something? IDK\n\nAnd WHY IN THE WORLD is Charred now PINK???????????????????????\n\nIs it gonna get name changed to Valentines Day Mao, or Fake Malphite Mao??? Sure doesn't make me think of Charred when I look at a pink, washed out, no detail Mao.","replies":[]},{"poster":"Thoroniul","date":"2014-11-11T18:47:12.097+0000","up_votes":2,"down_votes":1,"body":"Did the previous forum get deleted?","replies":[]},{"poster":"Xivus Arkan","date":"2016-01-07T17:29:51.874+0000","up_votes":1,"down_votes":0,"body":"I'm going to get hate for this, but I don't see any issue. Maokai is my main.","replies":[]},{"poster":"Kryophyre","date":"2016-01-07T07:10:34.823+0000","up_votes":1,"down_votes":0,"body":"On top of the lackluster textures, would it be too much to ask for orange ability effects? Just something to tie the skin together and make it worth 975RP?","replies":[]},{"poster":"Centuros","date":"2014-11-16T01:24:22.439+0000","up_votes":1,"down_votes":0,"body":"It's the smooth textures on the \"wood\" that makes it look like stone, IMO.\nHe needs to looks a little more rough and cracked like the skin was originally.","replies":[]},{"poster":"PhoenixSlayer13","date":"2014-11-12T23:38:45.825+0000","up_votes":1,"down_votes":0,"body":"Hey guys, update to Charred is on Surrender at 20: http://www.surrenderat20.net/2014/11/1112-pbe-update.html#more","replies":[{"poster":"Gragas Undressed","date":"2014-11-13T13:58:25.140+0000","up_votes":1,"down_votes":0,"body":"Definitely a step in the right direction! Good job everyone on bringing this to Riot's attention!","replies":[]}]},{"poster":"Mewington","date":"2014-11-12T18:54:08.590+0000","up_votes":1,"down_votes":0,"body":"There is also the issue of the particle colors - they only fit the original Maokai's color scheme, which has blue details. The particle colors should be modified in accordance to which skin is selected. A purple Charred Maokai with blue particle effects isn't very aesthetically pleasing.","replies":[]},{"poster":"iMaB3AST","date":"2014-11-11T22:32:51.951+0000","up_votes":1,"down_votes":0,"body":"Speaking of Malphite, is he getting a visual or texture update soon?","replies":[{"poster":"Gragas Undressed","date":"2014-11-12T16:24:32.968+0000","up_votes":1,"down_votes":0,"body":"I'm sure he's on the list. I think Riot listened when the community said they wanted to update the sizes on certain champs after Sion was re-released. I'm sure Malphite is on that list. Maybe Nautilus, too.","replies":[]}]},{"poster":"Auz the Ripper","date":"2014-11-12T14:11:43.360+0000","up_votes":1,"down_votes":0,"body":"Remind me of what happened to ravanger Nocturne.\nUsed to be my favorite skin, now I can't play it without expecting Noc to yell out \"UNLEASH THE POWER OF THE SUN\" at random intervals \n\nAnyway, my apologies for Malphkai","replies":[]},{"poster":"Burkhart","date":"2014-11-12T01:07:21.567+0000","up_votes":1,"down_votes":0,"body":"When I saw it at first I thought they were making a \"Golem Maokai\" skin. Then I looked again and was confused even more.","replies":[]},{"poster":"leg fetish","date":"2014-11-11T18:51:59.966+0000","up_votes":1,"down_votes":0,"body":"LMFAO\n{{champion:54}}","replies":[]},{"poster":"junglerboy16","date":"2014-11-12T01:27:27.522+0000","up_votes":4,"down_votes":4,"body":"The old charred Maokai was also just a recolor of his base skin.","replies":[]},{"poster":"TheHobbits","date":"2014-11-11T21:31:31.446+0000","up_votes":1,"down_votes":5,"body":"has anyone stopped to think that this skin may be more focused around the new particles? Has any of it been released yet? Ive seen the new particles for normal skin, but the Charred effects may be all fire.","replies":[{"poster":"roflSong","date":"2014-11-16T01:39:54.582+0000","up_votes":1,"down_votes":0,"body":"If the point of the visual changes to rift and champions are to clarify gameplay, than this argument *really* doesn't make sense. If a champion on screen is easily confused with another champion the game is *less *clear, not more, no matter what you do with the spell particles. \n\nHas anyone ever been camping and seen charred wood/ charcoal? The wood turns a matte black. It's not pink-ish purple-y, colors of an unpolished chunk of pink jasper or an agate. Regardless of what they do with the fire/embers parts of this skin, the wood shouldn't be pink.","replies":[]}]}]}