{"poster":"xConsti72x","date":"2017-05-30T20:52:32.576+0000","title":"Die E-mail Adresse ist Tod","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"So ja ich wollte heute wiedermal meine email &ouml;ffnen um mal alles zu s&auml;ubern nur da gibts jetzt nen problem ich hatte noch ne alte UPC email addresse (Inode) die haben sie aber vor nem ca. nen monat gel&ouml;scht bzw abgeschaltet von heute auf morgen sozusagen. Mein vader hat sich da auch aufgeregt und ich hab da nur so gedacht ach die geht bald wieder leider war dem nicht so und ich vergess alles immer so schnell und schwupps, heute sitz ich im stuhl schreib das hier. \n\nUnd jetzt zum eigentlichem problem X3 wenn man seine email addresse hier wechseln will sendet der server ja nen best&auml;tigungs code an die derzeitige email addresse und wie schon gesagt die gibts nicht mehr was mach ich jetzt ?\n\nUnd PS: Ich schreib das hier um 22:30uhr deswegen vllt schreibfehler etc. bin schon total {{summoner:3}}  weil ichs erst heute gecheckt hab mit der email naja bin auch irgendwie selbst schuld und ich muss morgen fr&uuml;h raus {{summoner:3}} zur arbeit :/\n\nIch schau morgen nochmal vorbei kann heute nicht mehr warten.\n\nIch sag schon mal allen danke im voraus :))","replies":[{"poster":"legofreak1","date":"2017-05-30T21:02:23.405+0000","up_votes":2,"down_votes":0,"body":"Wenn deine E-Mailadresse nicht mehr gültig ist und du diese trotzdem ändern möchtest, musst du dich für die Accountwiederherstellung an den [Support](https://support.riotgames.com/hc/de/requests/new?ticket_form_id=72416) wenden. In dem Formular wirst du einige Daten angeben müssen, mit denen du dich als Ersteller des Accounts identifizierst, wenn das gelingt, kann die Adresse geändert werden.","replies":[{"poster":"xConsti72x","date":"2017-05-31T20:34:55.045+0000","up_votes":1,"down_votes":0,"body":"Oh DANKE DANKE DANKE tausend mal danke ^^  {{sticker:slayer-pantheon-thumbs}} \n\nWürds jetzt schon Teleporter geben hätt ich schon nen Riesen COOKIE geschickt :DDD","replies":[]}]}]}