{"poster":"Excorpion","date":"2017-07-10T13:15:17.805+0000","title":"Compraste Pebetero, si no tenemos ADC !!! - Molestias en Aram","subforum":"Comportamiento del jugador","up_votes":12,"down_votes":10,"body":"Acabo de terminar una partida con Lux en Aram\nla cual, a mi parecer, me fue super bien... pero seg&uacute;n mis teammates, hice la peor elecci&oacute;n.\n\nEmpezamos una partida normal, me sale lux, voy runas ap, y maestr&iacute;as &quot;supp&quot; que llevan rey del trueno (falsas supp, es para tener man&aacute;, oro, y da&ntilde;o del rey nada m&aacute;s), cosa que hago siempre, dado que no tomo mucha atenci&oacute;n en esto.\nTodos pickean, y Syndra y yo, llevamos Claridad, siendo un hechizo 200% necesario, no me parece mal que hayan 2, pero hay gente reclamando que no lleven eso, pero tampoco dicen que lleven otra cosa, asi que se quedan sin reclamos.\n\nEmpezamos la partida normal, me quedo r&aacute;pidamente sin man&aacute;, y gasto mi Claridad, pasados unos minutos, Syndra y yo nos quedamos sin man&aacute;, le pido su claridad, y no responde, insisto, y nada, quedamos sin mana durante al menos 2 minutos, hasta que le escribi repetidamente en el chat que lo usara... cuando lo usa, al mio le quedaba 1 minuto para que se volviera a usar... ya me estaba empezando a tiltear...\nTeniamos en frente a 4 ap, y por instinto (sin pensarlo mucho), saqu&eacute; GRIAL primero que nada junto con Rabadon... esto mas que nada, debido a la no iniciaci&oacute;n que ten&iacute;amos (entrar primeros en early era solo un suicidio), el pokeo enemigo, y el escudo que ahora pod&iacute;a curar, adem&aacute;s del ap que obtenia con ello.\nLuego m&aacute;s adelante, estaba un tanto muy cabreado con el tema del man&aacute; y Syndra que no daba el suyo, as&iacute; que me ~~desconecté~~ me desentendí de la partida, y arm&eacute; algo m&aacute;s situacional... PEBETERO ARDIENTE.\n\n{{item:3504}} Para los que no sepan...\nhttp://fotos.subefotos.com/26ecb0ff65b03a943b1a3c05a8a57460o.png\n\nUsar Pebetero, con la composici&oacute;n que ten&iacute;a, era algo raro (eran, leona, poppy, rengar, syndra y yo, lux)\nDa ap, cd, reg. man&aacute;, curaci&oacute;n y escudo extra, mov. speed, PERO !!!! su tercera pasiva es usada m&aacute;s que nada, por campeones de da&ntilde;o constante... cosa que no exactamente tenia en mi team...\nTeniendo en cuenta que el Rengar estuvo afk 5 minutos, no entraba por que lo destrozaban y habia muerto muchas veces, leona entraba mal un 70% de las veces, y solo Poppy con Syndra eran m&aacute;s decentes, no le di importancia, y compre eso primero.\n\nAl otro lado, hab&iacute;a un Swain, y raramente, no hab&iacute;amos armado ni Morello, ni Liandry, para contrarrestarlo (Ni Syndra ni yo nos habiamos preocupado de ello)... cuando lo empezaron a notar, obvio que empezaron a reclamar, pero vieron que ten&iacute;a pebetero ardiente encima, y se abalanzaron sobre mi con el desprecio.\nTerminaron flammeandome de un lado para el otro... creo que solo Poppy se qued&oacute; callada. Al terminar la partida, Leona me acuso de inutil, de mala, etc etc etc. Siendo que en KDA, termine super bien, y en da&ntilde;o, fui el 2do que m&aacute;s da&ntilde;o hizo en mi team, y 5to en total (ya dije, leona mor&iacute;a demasiado junto con rengar, el da&ntilde;o era gratis con sus avances)\n\nhttps://i.gyazo.com/57c190ef6b524b31047832ad339870c8.png\n\nLo que yo no entiendo, es como tal descargo se produjo, por haber comprado un pebetero ardiente, terminar con el mejor score, y 2do en da&ntilde;o parece haber sido nada. Es como si lo que importara, es sacar kills por todos lados, y morir un mont&oacute;n por ello...\n\nCuento a parte, hice una partida con Camille reci&eacute;n, y fui full tank, termin&eacute; 4/3/24, un score muy cercano al anterior, y ac&aacute; nadie reclamo para nada porque ellos si hicieron su parte en totalidad, y la din&aacute;mica funciono como debia, tankie las torres y me regeneraba en 10 seg.\n\nLo unico que me queda claro, es que a las personas no les importa que hagan los dem&aacute;s, a menos que vayan perdiendo, asi culpan a otros de los errores que ellos cometieron, y se descargan de un estres acumulado que seguro tenian guardado.","replies":[{"poster":"Hnk Kenshiro","date":"2017-07-10T13:40:26.634+0000","up_votes":6,"down_votes":1,"body":"> Lo unico que me queda claro, es que a las personas no les importa que hagan los demás, a menos que vayan perdiendo\n\nPeus porque si van ganando significa que lo hacen esta funcionado! ,\n\nPara que vas a quejarte de una vayne con guinso que te carrea, en vez de una sivir con muramana en vez de segador de esencias donde van perdiendo.\n\n\n\n> Luego más adelante, estaba un tanto muy cabreado con el tema del maná y Syndra que no daba el suyo, así que me desconecté,\n\n\nTe molesta que alguien no use un spell, a otro le molesta que te armes cierto item, cosas del juego.\n\n\n-_-\n\nY si, pebetero fue una desicion casi estúpida, tu composición tenia un tanke, un tank-sup, 2 de burst y tu, no necesitaban un ap-soporte que haga las peleas largas, necesitaban matar.\n\nEs decir tenían mejor iniciación y contra-iniciación, el rival ganaba en poke con zigs y heimer, el poke de tu team eras tu.\n\n\nEl combo era iniciar y borrar a quien fuera mientra la front line no los dejaba pasar, Rengar y en especial Syndra no hacen nada en los tiempos muertos donde tienen sus habilidades en cdr, a diferencia del Yasuo o del Swain que peleas largas le van geniales, ese \"un poco de todo\" que da el pebetero te hizo no ser fuerte en nada.","replies":[{"poster":"Excorpion","date":"2017-07-10T13:49:38.682+0000","up_votes":1,"down_votes":1,"body":"> Peus porque si van ganando significa que lo hacen esta funcionado! ,\nPara que vas a quejarte de una vayne con guinso que te carrea, en vez de una sivir con muramana en vez de segador de esencias donde van perdiendo.\n\nNo, si van ganando no reclaman, si van perdiendo, recién se vienen a fijar en sus teammates.\nEs como cuando iba Braum Jg... habían personas que no se daban cuenta que era Jg hasta el minuto 20, y era porque me soleaba al top enemigo, o cosas que un Braum Supp no haría.\n\n> _Luego más adelante, estaba un tanto muy cabreado con el tema del maná y Syndra que no daba el suyo, así que me **desconecté**,_\n\n> Te molesta que alguien no use un spell, a otro le molesta que te armes cierto item, cosas del juego.\n\nNo me desconecté del juego si es lo que piensas, me refería a que me desconecté de lo que estaba haciendo, iba a ir por morello, pero no lo hice, y fui por pebetero.\nAhí lo corregí para que se entienda de buena manera :D como un desconectado compra pebetero ? no tiene sentido XD\n\n\n> Es decir tenían mejor iniciación y contra-iniciación, el rival ganaba en poke con zigs y heimer, el poke de tu team eras tu.\n\nEse es el tema, no lo hacían de ese modo, leona iniciaba, pero rengar se quedaba afk, no había como iniciar ni contra iniciar, lo unico que pude hacer, es darle las kills a syndra, y ayudar a poppy hice las del supp.","replies":[]}]},{"poster":"iNGENiO","date":"2017-07-10T14:04:46.160+0000","up_votes":1,"down_votes":0,"body":"Sos mujer?","replies":[{"poster":"Excorpion","date":"2017-07-10T14:05:14.221+0000","up_votes":1,"down_votes":4,"body":"Hay una diferencia en que lo sea ?","replies":[{"poster":"iNGENiO","date":"2017-07-10T14:24:49.052+0000","up_votes":1,"down_votes":0,"body":"No. Solo me dio Curiosidad.","replies":[{"poster":"Excorpion","date":"2017-07-10T14:28:11.784+0000","up_votes":2,"down_votes":5,"body":"Bueno, entonces no importa que responda esa pregunta","replies":[{"poster":"iNGENiO","date":"2017-07-10T14:33:39.412+0000","up_votes":5,"down_votes":0,"body":"{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Hell Darking","date":"2017-07-10T18:20:20.115+0000","up_votes":2,"down_votes":0,"body":"#porsilapongo \ny \n#putanomesalio","replies":[]}]}]}]}]}]},{"poster":"Ayvwa","date":"2017-07-10T13:30:57.321+0000","up_votes":3,"down_votes":0,"body":"Me pasa lo mismo en mis clasificatorias, últimamente no sé porque siento que el nivel bajó muchísimo incluso hasta en partidas normales que la gente ya no le interesa ganar o jugar bien solo por eso, porque son normales y me parece que la comunidad ya está decayendo bastante también. Estoy muy seguro como dijiste de que a los demás no les importan sus compañeros hasta que ven una derrota asegurada y empiezan a remarcar los errores de sus compañeros sin poder ver los suyos o detenerse a pensar sobre que están diciendo o haciendo.","replies":[{"poster":"davichost","date":"2017-07-11T01:33:59.681+0000","up_votes":1,"down_votes":0,"body":"Llevo años jugando y puedo decirte que esto es normal en tiempo de vacaciones, ahí lo dejo","replies":[{"poster":"Ayvwa","date":"2017-07-11T01:38:10.204+0000","up_votes":2,"down_votes":0,"body":"Oh es verdad.. hay gente en vacaciones lo había olvidado","replies":[]}]},{"poster":"Excorpion","date":"2017-07-10T13:50:02.909+0000","up_votes":1,"down_votes":0,"body":"Eso mismo es lo que digo","replies":[{"poster":"Ayvwa","date":"2017-07-10T14:13:08.046+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=excorpion2013,realm=LAS,application-id=PJAKt7ph,discussion-id=xW18z2EW,comment-id=00000000,timestamp=2017-07-10T13:50:02.909+0000)\n>\n> Eso mismo es lo que digo\n\nLo sé, solo quería desahogarme xD","replies":[{"poster":"Excorpion","date":"2017-07-10T14:13:59.222+0000","up_votes":1,"down_votes":0,"body":"esta bien :3","replies":[]}]}]}]},{"poster":"Koijhy","date":"2017-07-10T18:26:13.372+0000","up_votes":2,"down_votes":0,"body":"Sacando de lado de que es Aram y podes armarte lo que creas conveniente para tu forma de jugar en ese momento, es 100% recomendable llevar full ap a un lux en ese modo","replies":[{"poster":"Nerf Aery","date":"2017-07-12T14:27:57.069+0000","up_votes":1,"down_votes":0,"body":"Si bueno, hay gente que no tiene mucha noción de a que juega o contra que juega.","replies":[]}]},{"poster":"Escrache","date":"2017-07-10T17:31:19.970+0000","up_votes":2,"down_votes":0,"body":"Yo hace bastante que juego casi exclusivamente aram.. y te puedo asegurar que claridad no es necesario..\nLux + Flash + Barrier.\n\nLux es un campeón al que aram le viene muy bien por su kit de habilidades.. necesita daño, cdr y regen de mana.. estas 3 cosas las conseguís armandote morello como primer item.. (En aram se arma siempre morello como primer item para casi todos los AP)\n\nEl resto del build no me parece bien.. lo ideal seria algo asi.. Morello - Botas del hechicero - Rabbadon - zhonya - Luden - Void staff/Lich (Void o lich depende de la composicion que haya en frente y lo que te haga falta.. si necesitas mas penetracion magica o si queres aprovechar tu pasiva + la pasiva de lich.\n\nLo que dijiste del KDA no tiene nada que ver, es un aram.. y muchas veces cuidarse de no morir te imposibilita la participación.. ya sea por que no tenes mana o vida por el desgaste de estar vivo tanto tiempo, o que pasas tanto tiempo sin comprar que no sos relevante en la teamfight. \nY hay otros que no matan y mueren mas, pero hacen que se gane la pelea y por consecuente la partida.. \n\nPor la composición de tu team, tu trabajo era hacer el mayor daño posible y fuiste armando algo medio soporte..","replies":[{"poster":"Excorpion","date":"2017-07-10T17:59:27.473+0000","up_votes":1,"down_votes":0,"body":"El tema con claridad, es que me quedo sin maná rápidamente, yo, si o si, la necesito.\n\nEs raro lo de la build, siempre que me armo Zhonyas, nunca lo uso, porque no llego a ese extremo, cuando muero, es porque debo comprar. Y liche nunca me ha gustado la verdad.\n\nLo del KDA, uff que si importa segun mi experiencia... he tenido partidas donde he comprado menos de 2 veces, incluso, partidas con ziggs, donde solo la compra inicial importa, y me mantenia con claridad, carreando en pokeo y molestia, no se como lo hacia, solo lo hacia.\n\n> Por la composición de tu team, tu trabajo era hacer el mayor daño posible y fuiste armando algo medio soporte..\n\nEl tema es que no podia hacer daño si no cooperaban, estuve como 5 minutos en total sin hacer nada porque Syndra no daba maná","replies":[]}]},{"poster":"Main Troll","date":"2017-07-10T13:58:35.425+0000","up_votes":2,"down_votes":3,"body":"es un aram, por q t preocupas tanto? yo me armo huracan con Soraka, y nunca se dan cuenta xD","replies":[{"poster":"Excorpion","date":"2017-07-10T14:01:38.617+0000","up_votes":2,"down_votes":0,"body":"No me preocupa el mapa donde sea, me molesta la actitud de la gente, que si cometen errores, no se autocritican, sino que siempre buscan culpar a otros, aunque ellos vayan mejor que los demás.","replies":[{"poster":"Tilting Machine","date":"2017-07-10T14:14:38.493+0000","up_votes":1,"down_votes":0,"body":"Es algo muy típico de la gente. Como culpándose a si mismos se sentirían mal, o a veces se sienten el centro del mundo y juran que todo lo que hacen esta bien, pues... ¿Porque no tirarle la carga a otra persona? \n{{sticker:zombie-brand-facepalm}} \n\nPor la falta de autocrítica yo opino que la gente está donde está\n\n¡Saludos! {{champion:121}}","replies":[]}]}]},{"poster":"Hendrix","date":"2017-07-10T14:07:16.110+0000","up_votes":3,"down_votes":1,"body":"Cuando vas ganando, a nadie le importa si le compras un rabadon a garen\nCuando se pierde, todo pasa a ser discutible. Inclusive va a discutirte todo el tipo que esta 1/12\nAl no haber adc, una de las pasivas del pebetero se pierde, pero el resto de su kit permanece intacto, incluso el 10% extra de escudo que beneficia a todos ya que el escudo de lux no es unico, sin contar su AP, su CDR y su regeneracion de mana, tan necesaria en aram","replies":[{"poster":"Nerf Aery","date":"2017-07-12T14:27:11.932+0000","up_votes":1,"down_votes":0,"body":"Le rendía mas un serafín, tormento y capaz vara del vacío, en aram es burstear y mas con luz/velkoz. Sinceramente el pebetero me parece al pedo, pero como se dice por ahí, \"si no te caben las puteadas, juga bien\".","replies":[]},{"poster":"Excorpion","date":"2017-07-10T14:08:53.411+0000","up_votes":1,"down_votes":0,"body":"A eso me refiero, entendiste a la perfección mi punto :D","replies":[]}]},{"poster":"Nerf Aery","date":"2017-07-12T14:23:28.567+0000","up_votes":1,"down_votes":0,"body":"\"rey del trueno\" y eso?:O.","replies":[{"poster":"Excorpion","date":"2017-07-12T16:21:04.760+0000","up_votes":1,"down_votes":0,"body":"El nombre real es \"Decreto del Señor del Trueno\" :3\nes la maestría final de en medio, de la barra de Astucia\nofrece daño extra al 3er golpe cuando está disponible.","replies":[{"poster":"Nerf Aery","date":"2017-07-13T22:57:07.901+0000","up_votes":1,"down_votes":0,"body":"Entonces, escriba bien, hombre horrible.","replies":[{"poster":"Excorpion","date":"2017-07-13T23:06:20.088+0000","up_votes":1,"down_votes":0,"body":"Es a posta jajaja, para siempre será Rey del Trueno","replies":[]}]}]}]},{"poster":"Mikeel Cornish","date":"2017-07-10T22:12:16.009+0000","up_votes":1,"down_votes":0,"body":"Y eres mujer o no ?","replies":[]},{"poster":"TSW Rorschach","date":"2017-07-10T17:02:51.779+0000","up_votes":1,"down_votes":0,"body":"Igual eso depende mucho, en un aram me re flammearon por sacar Graves con rey arruinado y bailarin y me fue bastante bien.\n\nCon respecto a lo otro, creo que deberias haberte armado mas ap que inclinandote a supp. Tal vez con un daño de morello+eco de luden+rabaddón hubieras podido tener un impacto mas fuerte y con las heridas graves cagabas a mas de uno. Creo que Lux puede sacarse utilidad cuando ya hay un daño ap muy potente de por si y no hay casi nada de utilidad en el equipo. Si no hay daño ap potente, tenes dos tanks y el asesino encima esta afk, armarse utilidad se me hace una mala decisión. Mas con Lux que fulmina las barras de vida con el ulti(?","replies":[{"poster":"Excorpion","date":"2017-07-10T17:06:49.658+0000","up_votes":1,"down_votes":0,"body":"Bailarín es bueno es Graves, como jungla lo he usado varias veces, y rey arruinado es siempre situacional, por ser un item full enfocado al tema de la vida, yo siempre lo saco en conjunto con ultimo suspiro","replies":[{"poster":"TSW Rorschach","date":"2017-07-10T18:44:16.650+0000","up_votes":1,"down_votes":0,"body":"Claro. Yo igual nunca usé Graves ni vi builds suyas. Me tocó justo porque estaba en la rotación y lo saqué mas como adc que otra cosa porque ni idea. (capaz una cuchilla oscura me hubiera ido bien tambien, entre otros items).\n\nMe pareció buena idea sacar rey por el tema de los tanques, el robo de vida, etc. Pero mi Soraka comenzó a decirme de todo por /all luego de sacarme esos dos items que fue re wtf. Capaz no era lo mejor con Graves pero de matar, maté y de ganar, gané xD si no me hubiera rendido los vendia y probaba otra combinacion.","replies":[]}]}]},{"poster":"Nuke","date":"2017-07-10T17:44:53.675+0000","up_votes":1,"down_votes":0,"body":"¡WEEE! Ni que fuera para tanto lo del pebetero jaja xDD. No me queda claro si este post es serio o de humor, estoy entre ambos. Pero te llevas mi +1 porque da igual cual sea, ta bueno v:","replies":[{"poster":"Excorpion","date":"2017-07-10T18:06:10.654+0000","up_votes":1,"down_votes":0,"body":"serio","replies":[]}]},{"poster":"Nabuze","date":"2017-07-10T18:01:03.772+0000","up_votes":1,"down_votes":0,"body":"No merecías que te flameen pero estoy de acuerdo con que hiciste una mala decisión con tu build en esa partida, Lux puede ser support pero no es su rol principal y se aprovecha mucho mejor full ap en aram más que como soporte.\nSaludos sigue mejorando ;)","replies":[]},{"poster":"Lince Salvaje","date":"2017-07-10T16:23:58.561+0000","up_votes":1,"down_votes":0,"body":"El tema es que terminaron perdiendo xD\nsi hubieran terminada ganando nadie te  iba a reclamar nada..\nes como vamos ganando tenemos un garen y un trynda ap con un darius mid ap :v  no importa como pero no vamos a criticar nada porque vamos ganando.\nahora misma situación si van perdiendo es que son unos trolls y cagan el juego a la gente :v\n\nen realidad tu elección no esta mal, tiene su lógica. \nsi bien una pasiva del item no se aprovecha del todo las otras sirven y bastante.\nlo ideal es mutearlos, porque cuando se entran a tiltear ellos les sale el coach coreano de adentro experto en builds.\n\nhay items que sirve hacerlos en determinadas situacion y aunque no se aprovechen todos los stats la gente te manda al muere.\n{{champion:86}}  con {{item:3110}} cuando hay un team con mucho ats \n{{champion:23}}  con {{item:3508}} por el daño y el % de critico mas el cdr\n\n\nsimplemente ignora la gente que se cree saber la mejor composicion o mejor buildeado. por lo general son los que peor terminan","replies":[{"poster":"Excorpion","date":"2017-07-10T17:01:24.293+0000","up_votes":1,"down_votes":0,"body":"lo que más me impresiona, es que no quieren ser ayudados, quieren ser carreados.","replies":[{"poster":"Lince Salvaje","date":"2017-07-10T17:31:21.999+0000","up_votes":1,"down_votes":0,"body":"Es que consideran inferior a los demas...\nentonces como ellos estan a un nivel de challenger importante no van a aceptar consejos o ayudas de alguien :l  (asi funciona en su mente).\n\npor mas argumentos que les presentes no vas a cambiar nada....\nNo importa la logica de la build ni nada.\nes mas puedes carrearles y segun ellos todo el trabajo y la partida se gano gracias a el solo :v","replies":[{"poster":"Excorpion","date":"2017-07-10T17:39:24.526+0000","up_votes":1,"down_votes":0,"body":"bueno, en eso tienes razón.","replies":[]}]}]}]},{"poster":"rokushoger","date":"2017-07-10T14:41:33.410+0000","up_votes":1,"down_votes":0,"body":"A ver, establezcamos que de ninguna manera justifico flameos e insultos, y que la culpa de perder no es solo tuya sino de todo el team (vos incluido claro).\n\nHabiendo aclarado eso, te comento otras cosas:\n\n1- Claridad 100% necesario? Con la regen que tenés en aram? Me parece un gasto de hechizo pudiendo poner o bien alguno defensivo como curación o barrera, o bien la bolita para revelear arbustos de forma barata.\n\n2- Grial está bueno, de eso no tengo nada para decir, para la situación que tenían te servía de maravilla.\n\n3- El pebetero es cierto, no tiene razón de ser en ese team. Si querías aumento de escudos te podías llevar un mikael, o gastarte ese dinero en más ap o regen de mana por otros lados. De todas maneras tampoco era un item inútil, las demás stats seguian siendo útiles.\n\n4- Habiendo un swain del otro lado, capaz que como segundo item estaba bueno si hacer un morello y luego si querías si el pebetero.\n\nEn cuanto a la conducta de estos individuos claro que no es justificable, y si, cuando la gente va perdiendo siempre intenta hecharle culpas a los otros.","replies":[{"poster":"AresC","date":"2017-07-10T15:30:25.547+0000","up_votes":1,"down_votes":0,"body":"Concuerdo con rokus, si comienzas con el item \"Capítulos Perdidos\" {{item:3802}} nunca vas a tener que usar la claridad, menos con Lux que tiene cooldowns tan altas en niveles bajos.","replies":[{"poster":"rokushoger","date":"2017-07-10T15:56:14.533+0000","up_votes":1,"down_votes":0,"body":"{{item:3112}} y {{item:1052}} es mi inicio, y en seguida que puedo {{item:3802}}. Eso es lo que hago con el 99% de los magos que me tocan.\nDe ahí puede que termine {{item:3165}} o puede que me juegue a otros items primero, depende como vaya la cosa y cuanto oro junte (a veces es bueno ya comprar la {{item:1058}} si vas con el oro suficiente porque en aram a veces se complica para hacerlo luego).","replies":[{"poster":"Excorpion","date":"2017-07-10T17:02:47.334+0000","up_votes":1,"down_votes":0,"body":"Sin importar como empiece, al min 3 puedo quedar sin maná por mi uso, soy agresivo y esto en aram, hace gastar mucho. Por eso siempre me falta maná, si no, tendría que morir 1 vez por minuto hasta tener maná que recargue lo suficiente.","replies":[{"poster":"rokushoger","date":"2017-07-10T17:05:25.738+0000","up_votes":1,"down_votes":0,"body":"Yo también soy bastante agresivo.","replies":[{"poster":"Excorpion","date":"2017-07-10T17:05:59.208+0000","up_votes":1,"down_votes":0,"body":"Hay que jugar arams juntos entonces para que veas a que me refiero.","replies":[{"poster":"rokushoger","date":"2017-07-10T17:11:30.008+0000","up_votes":1,"down_votes":0,"body":"Definitivamente! Nunca coincidimos en horarios XD, pero cuando lo logremos hay que hacer un aram.","replies":[]}]}]}]}]}]},{"poster":"Excorpion","date":"2017-07-10T14:43:16.054+0000","up_votes":1,"down_votes":0,"body":"> 1- Claridad 100% necesario? Con la regen que tenés en aram? Me parece un gasto de hechizo pudiendo poner o bien alguno defensivo como curación o barrera, o bien la bolita para revelear arbustos de forma barata.\n\nPara nada, para el consumo que tengo, me sirve hasta lvl16 sin parar de usarlo.\n\n> 4- Habiendo un swain del otro lado, capaz que como segundo item estaba bueno si hacer un morello y luego si querías si el pebetero.\n\nLo iba a hacer de 3ro, pero me desligué de la partida por el tilteo del momento.","replies":[{"poster":"rokushoger","date":"2017-07-10T14:47:12.716+0000","up_votes":1,"down_votes":0,"body":"Igual tengo que decirte que eso de \"desligarse\" no está nada bueno. \n\nComo haces para gastar tanto mana? Ni con ziggs que spameo skills llego a esas cuotas XD.\nIgual yo al inicio siempre le compre el orbe azul (el equivalente del doran en aram) y con eso me da y sobra (cuando voy magos claro)","replies":[{"poster":"Excorpion","date":"2017-07-10T14:48:53.646+0000","up_votes":1,"down_votes":0,"body":"> Igual tengo que decirte que eso de \"desligarse\" no está nada bueno.\n\nClaro que no, perdí el hilo de lo que estaba haciendo y compre otra cosa, yo iba a comprar morello XD\n\n> Como haces para gastar tanto mana? Ni con ziggs que spameo skills llego a esas cuotas XD.\nIgual yo al inicio siempre le compre el orbe azul (el equivalente del doran en aram) y con eso me da y sobra (cuando voy magos claro)\n\nEntonces no spammeas lo suficiente","replies":[]}]}]}]},{"poster":"WhiteMax","date":"2017-07-10T15:07:32.083+0000","up_votes":1,"down_votes":0,"body":"> Lo unico que me queda claro, es que a las personas no les importa que hagan los demás, a menos que vayan perdiendo, asi culpan a otros de los errores que ellos cometieron, y se descargan de un estres acumulado que seguro tenian guardado.\n\nSiempre me pasa en normales, todos son lamebotas hasta que te ven morir y luego piden report cuando sin ti no hacen nada (cuando estas carreando hablo).","replies":[]}]}