{"poster":"qpKrayz","date":"2016-08-31T11:24:26.263+0000","title":"Trolle und Feeder","subforum":"Spielerverhalten & Moderation","up_votes":7,"down_votes":8,"body":"Hey liebe Com. \r\nIch spieler in Plat. IV und ich krieg so viele Trolle und Feeder ab, was ich nicht mehr verstehe...{{sticker:zombie-brand-facepalm}} \r\nDamit meine ich keine Spieler die sich m&uuml;he geben und einfach mal ein schlechtes Spiel haben, sonder die die wirklich trollen und Spa&szlig; haben auf andere Spieler kosten.\r\nMan kann das doch gerne in Normals machen, wo es nerven kann aber nicht wirklich &quot;tragisch&quot; ist.\r\nIch w&uuml;nsch mir soooo sehr das Riot h&auml;rter gegen solche Spieler vorgeht und sie stark bestraft.{{summoner:11}} \r\nDIe Communtiy ist in League echt sp&uuml;rbar schlechter geworden und Riot sollte da einfach mal h&auml;rter durchgreifen.{{sticker:zombie-nunu-bummed}} \r\n\r\nich w&uuml;rde gerne mal eure Meinung h&ouml;ren und ob es euch auch so geht.\r\n\r\nmit freundlichen Gr&uuml;&szlig;en","replies":[{"poster":"MeMyselfandBaal","date":"2016-08-31T13:02:23.907+0000","up_votes":3,"down_votes":0,"body":"Auch wenn ich eigentlich gerade übelst am Ragen sein sollte, weil mein letztes Spiel durch einen Level 2 Ragequit nach dem Firstblood und einem Intentional Feeder bestand... Zucke ich nur mit den Schultern und denke mir \"Kommt vor\"... \n\nDas liegt natürlich hauptsächlich daran, dass man eine gewisse Gelassenheit entwickelt, wenn man sein Saisonziel erreicht hat... \n\nUnd ja, so was kommt vor. In jeder Elo. Ich rege mich über solche Sachen aber halt auch nicht übermäßig auf. Schließlich war das der erste Spieler, den ich diese Saison wegen absichtlichen Feedens reported habe. Und mein erster Level 2 Ragequit des Jahres. Es passiert mir also zumindest sehr selten...","replies":[{"poster":"XenesisCH","date":"2016-08-31T13:51:44.069+0000","up_votes":1,"down_votes":0,"body":">  Es passiert mir also zumindest sehr selten...\n\nDiesem Fazit kann ich mich anschliessen.","replies":[]}]},{"poster":"Schlampe des ADC","date":"2016-08-31T11:26:16.323+0000","up_votes":1,"down_votes":5,"body":"Jeder sieht es so (sry, viele), aber dann gibt es wiederrum leute, die solche threads downvoten und andere leute die sowas nicht Upvoten :p\nSeit wann beschwert sich ein plat über Troller und feeder ? :o","replies":[{"poster":"hshtagniemehrcdu","date":"2016-08-31T11:40:40.567+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Schlampe des ADC,realm=EUW,application-id=KYnfKGf0,discussion-id=nH9rs9n7,comment-id=0000,timestamp=2016-08-31T11:26:16.323+0000)\n>\n> Jeder sieht es so (sry, viele), aber dann gibt es wiederrum leute, die solche threads downvoten und andere leute die sowas nicht Upvoten :p\n> Seit wann beschwert sich ein plat über Troller und feeder ? :o\n\nDer TE machts richtig.\nTrolle.\nKeine Autos.","replies":[{"poster":"Schlampe des ADC","date":"2016-08-31T15:05:32.589+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Cantabrum,realm=EUW,application-id=KYnfKGf0,discussion-id=nH9rs9n7,comment-id=00000000,timestamp=2016-08-31T11:40:40.567+0000)\n>\n> Der TE machts richtig.\n> Trolle.\n> Keine Autos.\n\nWo trolle ich dann ?\nMich wundert es nur, das ein Platin schreibt, das es hier unendliche viele troller sind... sonst beschweren sich nur die bronzi und goldis ....","replies":[{"poster":"hshtagniemehrcdu","date":"2016-08-31T16:16:08.380+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Schlampe des ADC,realm=EUW,application-id=KYnfKGf0,discussion-id=nH9rs9n7,comment-id=000000000000,timestamp=2016-08-31T15:05:32.589+0000)\n>\n> Wo trolle ich dann ?\n> Mich wundert es nur, das ein Platin schreibt, das es hier unendliche viele troller sind... sonst beschweren sich nur die bronzi und goldis ....\n\nDu fährst grad auf der falschen Straße :)","replies":[{"poster":"Haudruppmoor","date":"2016-09-01T09:49:51.539+0000","up_votes":1,"down_votes":1,"body":"http://www.radiohamburg.de/var/ezflow_site/storage/images/media/images/emoji-mit-freudentraenen/50749952-2-ger-DE/Emoji-mit-Freudentraenen_image_660.jpg","replies":[]},{"poster":"Schlampe des ADC","date":"2016-08-31T17:07:05.395+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Cantabrum,realm=EUW,application-id=KYnfKGf0,discussion-id=nH9rs9n7,comment-id=0000000000000000,timestamp=2016-08-31T16:16:08.380+0000)\n>\n> Du fährst grad auf der falschen Straße :)\n\nwas habt ihr den für ein problem ?","replies":[{"poster":"Haudruppmoor","date":"2016-09-01T09:47:35.181+0000","up_votes":1,"down_votes":1,"body":"http://i2.kym-cdn.com/entries/icons/facebook/000/000/554/facepalm.jpg","replies":[]}]}]}]}]}]},{"poster":"Temudschinn","date":"2016-08-31T15:14:33.698+0000","up_votes":3,"down_votes":1,"body":"An deinem Post stören mich zwei Dinge.\n\nErstens: Du gehst davon aus, dass du Trolle erkennen kannst. Aber wenn wir ehrlich sind: Wir alle hatten schon Spiele, in den wir unser bestes gaben und trotzdem höllisch gefeedet haben. Sei es, weil wir lagspikes hatten, sei es wegen übelm Camping inklusive Supportganks auf der Toplane oder weil wir einfach einen richtig beschissenen Tag hatten und JEDER skillshot uns traf.\nWenn wir also quasi all schon ab und zu als int. Feeder bezeichnet wurden und uns dabei immer dachten \"was für ein nertötender Idiot\" - ist es dann nicht grenzenlos arrogant zu meinen, man selber erkenne den unterschied zwischen schlechtem Spiel und int. feeding?\n\nZweitens: Du forderst härtere Strafen. Du kommst aber nicht auf die Idee, zu begründen, warum die etwas bringen sollen. Es gibt hunderte Studien zum Einfluss von Strafen auf zukünftiges Verhalten und das Fazit ist sehr durchzogen. Im Klartext: Die Chancen stehen sehr gut, dass deine gewünschten härteren Strafen zu MEHR TROLLING führen. Warum genau willst du das?","replies":[{"poster":"qpKrayz","date":"2016-08-31T16:20:51.830+0000","up_votes":1,"down_votes":3,"body":"Wie ich schon unten in einem Kommentar schrieb hat der Spieler selbst gesagt \" ich Troll\".\nund man sehr wohl erkennen kann, ob ein Spieler nur ein schlechtes spiel hat, z.b. wenn er mit 5er Boots bei min 3 im Tower rennt und das mehr fach hintereinander... \nich rede nur von ganz offensichtlichen Trolls","replies":[{"poster":"Temudschinn","date":"2016-08-31T21:59:59.692+0000","up_votes":1,"down_votes":0,"body":"Ja, in Einzelfällen ist es wirklich klar. Aber sehr, sehr, sehr selten.\n\n> z.b. wenn er mit 5er Boots bei min 3 im Tower rennt und das mehr fach hintereinander...\n\nNur hattest du in letzter Zeit kein solches Spiel, zumindest nicht im Ranked (normals hab ich mir jetzt nicht auch noch angeschaut). Schon komisch, wo es doch angeblich sooo viele sind.\n\nUnd wegen Einzelfällen neue Regeln zu fordern, die vermutlich zu ehr Trollen führen werden...klingt sehr dumm, wenn du mich fragst.","replies":[]}]}]},{"poster":"ruasl9r","date":"2017-02-05T19:30:15.480+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"Abasin","date":"2017-06-14T08:26:18.754+0000","up_votes":1,"down_votes":0,"body":"Naming und Shaming ist verboten. Streich bitte den Namen.\nWenn der Spieler in jedem Spiel für sein Verhalten reportet wurde, dann passiert auch irgendwann etwas. Also übe Dich ein wenig in Geduld.","replies":[]}]},{"poster":"BelArk","date":"2016-08-31T14:37:24.735+0000","up_votes":1,"down_votes":4,"body":"In Silber ist das extrem. Letztendlich ist das aber uhrzeitabhängig (meiner Erfahrung nach). Je später man ins Spiel geht, desto eher kommts vor, dass Leute völlig tilt ins Spiel kommen und beim kleinsten Missverständnis Zwischen Top+Jungle, Top+Mid, alles+Jungle oder Sup+Bot der Zickenkrieg beginnt. Wenn es da keinen Hypercarry gibt, der die Leute verbal an die Leine nimmt und dem entgleitenden Spiel Struktur gibt, dann endet es oft im Feed, Ragequit oder am ehesten doch im heftigsten Tilt und geflame des ganzen Teams.","replies":[{"poster":"SequADC v2","date":"2016-08-31T14:44:44.771+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=BelArk,realm=EUW,application-id=KYnfKGf0,discussion-id=nH9rs9n7,comment-id=0004,timestamp=2016-08-31T14:37:24.735+0000)\n>\n> In Silber ist das extrem. Letztendlich ist das aber uhrzeitabhängig (meiner Erfahrung nach). Je später man ins Spiel geht, desto eher kommts vor, dass Leute völlig tilt ins Spiel kommen und beim kleinsten Missverständnis Zwischen Top+Jungle, Top+Mid, alles+Jungle oder Sup+Bot der Zickenkrieg beginnt. Wenn es da keinen Hypercarry gibt, der die Leute verbal an die Leine nimmt und dem entgleitenden Spiel Struktur gibt, dann endet es oft im Feed, Ragequit oder am ehesten doch im heftigsten Tilt und geflame des ganzen Teams.\n\nHabe heute morgen ein Spiel gehabt da waren 3 Deutsche drinne du weißt garnicht welche neuen Beleidigungen ich alle gelernt habe als ich dann fragte wann der Jungler mal die Botlane ganken möchte da wir ja bereits einen Tower verloren haben weil ständig 4 Leute auf der Lane sind da kam nur ein halt deine .... \n\ntraurig was gerade abgeht ist echt schwer zu climben aber ich schaffe es irgendwie doch noch wenn ich meine Trolle und Feeder bis ins Late im Stall halte knall ich da mit Twitch durch carry die Teamfights oder mache shotcalling und anstatt sich zu streiten tun sie einfach was ich sage und gg.\nbtw musste heute morgen einen int feeder dazu überreden ein Game mal nicht zu trollen und er hat es echt nicht gemacht :D","replies":[]}]},{"poster":"TIOlOlOlOIT","date":"2016-08-31T12:00:26.458+0000","up_votes":1,"down_votes":0,"body":"Kannst du uns vielleicht ein Beispiel aus einen deiner letzten Spiele nennen? Ich kann es mir ehrlich gesagt schlecht vorstellen, dass du so häufig derartige Mitspieler bekommst. Ich habe die ganze Season noch nicht einen gesehen, der absichtlich in die Gegner rein gelaufen ist.","replies":[{"poster":"qpKrayz","date":"2016-08-31T12:09:32.127+0000","up_votes":1,"down_votes":3,"body":"Ich hatte allein heute eine Champion Sel. wo ein Spieler rein kommt, mit dem Wort \"Troll\" und sup picked obwohl er Jgl war... \nund ein anderer Spieler denkt sich \"yolo mach ich auch\".\nDiese hab ich darauf verlassen und bekam die Strafe ...\nAber es gibt auch genug Situation, wo sich Spieler denken kein bock auf das Game und irgendein Sch... machen.","replies":[]}]},{"poster":"Cárrý Potter","date":"2017-06-13T22:52:03.471+0000","up_votes":1,"down_votes":1,"body":"Ich persönlich hab 3 / 10 Spielen ( i.d.R. ) nette und vernünftige Teamplayer ... der Rest beleidigt, geht afk wenn er mal einen Gank nicht bekommt, surrendert pausenlos\noder lässt seine Fehler an anderen raus...möglichst auch im /all chat. Die Beleidigungen sind teils echt grenzwertig und sollten mit einem direkten Bann sofort bestraft werden !!!! Das höre ich aber auch öfter als mir lieb ist von vielen anderen Spielern. Vielen fehlt es einfach an Anstand und Respekt.\nIch würde ja vorschlagen die Spieler an einen geistigen Eignungstest zu Binden .... vermute aber dass das eher dazu führen würde, dass sich die Spielerschaft ziemlich minimieren würde. Wenn ich ein schlechtes Spiel mal habe rege ich mich zwar auch auf  aber nur außerhalb der Bildschirms und nicht gegen irgendwen gerichtet. Ich stimme dir da aber voll und ganz zu dass hier sehr viel härter durchgegriffen werden muss und solche Idioten möglichst niemandem den Spielspaß weiter verderben. Schönreden ist da leider nicht möglich. Man könnte natürlich auch versuchen zu Ignorieren aber wenn das ganze Team nach unten gezogen wird, machts echt keinen Spaß mehr.","replies":[]},{"poster":"BGM Starsky3012","date":"2016-08-31T13:40:10.349+0000","up_votes":1,"down_votes":4,"body":"Ich habe heute eine ähnlich \"schöne Erfahrung\" gemacht und dazu folgende Diskussion aufgemacht, die wohl reichlich kontrovers ist: http://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/jPZp4phY-liebes-riot-team","replies":[]}]}