{"poster":"Kata Ga Kill","date":"2018-09-27T02:51:05.418+0000","title":"Den richtigen Prozessor finden","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"M&ouml;chte gerne meine CPU aufstocken nur bin ich da nicht erfahren genug und brauche Tips welche ich mir f&uuml;r mein Notebook zulegen kann bzw. auf welche Faktoren in bei der Suche beachten muss damit er in mein System passt und schnurrt.\n\nHabe nen Dell Latitude Notebook, mit nem Intel Core i5 520M CPU, Duo Kern 2,4 GHz, Sockel 989 rPGA.\n\nWenn ich zB. Amazon suche spuckt er mir teils welche raus aber immer unterschiedliche Sockeln.\nKann ich auch nen i7 einsetzten oder sollte ich bei i5 bleiben?\n\nMeine vorstellungen sind Duo/Quad mit 3 GHz aufw&auml;rts.\nIst ein Quad mit 2,4 deutlich schneller als ein Duo 2,4? Oder lieber doch mehr GHz selbst bei Quad?","replies":[{"poster":"KhaZix on Weed","date":"2018-09-28T13:54:00.243+0000","up_votes":1,"down_votes":0,"body":"also ich hab mich mal etwas erkundigt und die cpu ist schon ziehmlich alt außerdem passt die cpu auf 2 verschiedene sockel bevor du nun wissen kannst welche cpus bei dir überhaupt eingesetzt werden können musst du herrausfinden was für ein sockel dein mainboard hat, dann schaust du einfach welche cpus du in den sockel einsetzen kannst es ist egal ob i3/i5/i7. Die ganzen alten cpus sind kaum noch was wert darum würde ich dir empfehlen den besten zu kaufen den du in den sockel bekommst, außerdem ist die grafikeinheit auch auf dem prozessor drauf, das heißt wenn du eine cpu ohne grafikeinheit kaufst wirst du kein bild haben \nEDIT: bin blind zu viel {{champion:64}} letzte zeit gespielt du hast den sockel ja schon erwähnt \nhier ist die CPU list die auf dein mainboard verwendet werden können http://www.cpu-world.com/Sockets/Socket%20G1%20(rPGA988A).html \ndeine jetztige cpu die du benutzt hat eine tdp von 35 watt die\"besten\" cpus die du einsetzten kannst haben aber 55 watt theoretisch würden die auch laufen aber würde an deiner stelle lieber eine cpu mit max 45 watt tdp kaufen da er sonst zu heiß wird ( warscheinlich wird er bei dir schon heiß, kannst ja beim ausbauen auch direkt alles sauber machen im notebook )\ndie würde ich dir empfehlen xD jedoch seh ich grad das die keine integrierte grafikkarte haben: Core i7-840QM Core i7-820QM Core i7-740QM Core i7-720QM\nund die mit 55 watt auch keine.\nalle anderen lohnen sich aber nicht da es zwei kerner sind und einen lowen takt haben ( wie deiner bereits ) \n\nBRAUCHST DIR DEN OBEN SCHEISS NICHT DURCHZULESEN ICH HAB GRAD ZU VIEL ZEIT XD\n\nALSO ENDERGEBNIS: upgraden kannst du den nicht und müsstest dir einen neuen kaufen x: ( am besten kein laptop sondern normalen computer auf kleinanzeigen bekommst du recht gute mit 4 kernen 3,2 ghz taktung (i5er) mit 8gb ram und grafikkarten wie gtx 770 für 200 euro und das ist dann auch ausreichend für league {{sticker:poppy-wink}}","replies":[]},{"poster":"Qbert","date":"2018-09-27T07:44:52.351+0000","up_votes":1,"down_votes":0,"body":"Ich rate jedem von Notebooks ab.\nWenn es unbedingt sein muss, dann bleib ruhig beim i5, die i7 sind zwar extrem stark, aber mMn den Preis nicht Wert.\n\nDennoch würde ich immer zu einem PC raten.\nPersönlich bin ich auch der Meinung, dass ein DualCore reicht, an meinem PC ist der Quad-Core nie wirklich ausgelastet, die ersten beiden Kerne schon ... aber Kern 3 und 4 Schaukeln sich zu 97% die Eier.","replies":[{"poster":"rammsteinsgate","date":"2018-09-27T12:07:25.223+0000","up_votes":1,"down_votes":0,"body":"i5 und i7 zu verallgemeinern ist nicht sinnvoll. es gibt starke i5 und schwache i7. das hyperthreading der i7 brauchen die meisten leute nicht, das wird erst in den nächsten jahren relevant.\nein dualcore reicht für die meisten esporttitel wie LoL, Fortnite, CS:GO usw locker aus, ich würde aber, wenn ich jetzt umsteigen würde, wohl auf einen AMD Prozessor umsteigen, da die 2700X und auch die anderen 2000er prozessoren von AMD sehr stark sind und im vergleich zur grafikkarte kosten die eh recht wenig.\nBei Laptops ist meist alles verlötet, weshalb du wohl kaum den Prozessor austauschen kannst. mit etwas glück, kannst du noch den RAM austauschen.","replies":[{"poster":"Qbert","date":"2018-09-27T12:15:06.587+0000","up_votes":1,"down_votes":0,"body":"Ich habe es doch gar nicht verallgemeinert :S\n\nUnd ja, die AMD (Serie habe ich jetzt nicht im Kopf) sollen sehr stark sein.","replies":[{"poster":"rammsteinsgate","date":"2018-09-27T12:22:57.364+0000","up_votes":1,"down_votes":0,"body":"hab mal ausführlicher geantwortet s.o. vielleicht hast du dazu auch noch was zu ergänzen","replies":[{"poster":"Qbert","date":"2018-09-27T12:46:11.054+0000","up_votes":1,"down_votes":0,"body":"ich bin angeschlagen und meine Konzentration ist ... minderwertig ... aber ich versuch's :D \n\nKurz zu den Prozessoren:\nAMD glänzt mit der Ryzen Serien, jedoch nur im PC-Bereich soweit ich weiß, deshalb hatte ich sie hier mal ausgeblendet ... da der TE ja von einem Notebook sprach (wovon ich echt abrate ôo)\n\ndie genauen Unterschiende i7 <> i5 wusste ich mal, hatte ich aber nicht mehr auf dem Schirm, bei Hyperthreading hat's bei mir geklingelt :D\nDa sind wir uns einig, i7 ist im privaten Bereich mMn Kanonen auf Spatzen ... es sei denn man spielt absolut High-End.\n\nDualCore sind wir uns auch einig.\n\nWo ich mir auch nicht sicher bin ist, ob die Prozessoren da fest verlötet sind ... Sinn würde es aber machen.\n\nBack to Topic:\nMeiner Meinung nach kann man bei so gut wie keinem Prozessor heutzutage mehr etwas falsch machen. Alle sind mit 9nm-Technologie, haben mehr als ausreichende Taktungen und wenigstens 2, meist schon 4 Kerne.\nDa würde ich eher Fokus auf anderes wie bspw. RAM(DDR4-5) oder Festplatte(SSD) legen ... auch die Grafikkarte ist tragend ... da fehlt mir aber die Kenntnis über aktuelle Geräte.","replies":[]}]}]}]}]},{"poster":"rammsteinsgate","date":"2018-09-27T12:17:41.651+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kata Ga Kill,realm=EUW,application-id=YnZkMR0R,discussion-id=Txnl75U0,comment-id=,timestamp=2018-09-27T02:51:05.418+0000)\n>\n> M&amp;ouml;chte gerne meine CPU aufstocken nur bin ich da nicht erfahren genug und brauche Tips welche ich mir f&amp;uuml;r mein Notebook zulegen kann bzw. auf welche Faktoren in bei der Suche beachten muss damit er in mein System passt und schnurrt.\n> \n> Habe nen Dell Latitude Notebook, mit nem Intel Core i5 520M CPU, Duo Kern 2,4 GHz, Sockel 989 rPGA.\n> \n> Wenn ich zB. Amazon suche spuckt er mir teils welche raus aber immer unterschiedliche Sockeln.\n> Kann ich auch nen i7 einsetzten oder sollte ich bei i5 bleiben?\n> \n> Meine vorstellungen sind Duo/Quad mit 3 GHz aufw&amp;auml;rts.\n> Ist ein Quad mit 2,4 deutlich schneller als ein Duo 2,4? Oder lieber doch mehr GHz selbst bei Quad?\n\nes ist nicht sinnvoll einen laptop aufzurüsten, wenn das überhaupt möglich ist bei deinem modell (die kühlung würde vermutlich für einen leistungsstärkeren prozessor nicht ausreichen, was dazu führen könnte, dass dein laptop überhitzt und im schlimmsten fall sogar das mainboard beschädigen, wenn dein rechner sich nicht automatisch abschaltet). da ich vermute, dass du ein sehr kleines budget hast, empfehle ich einen budget desktop-pc. du solltest wert darauf legen ein zukunftsfähiges mainboard  zu verwenden. ob du amd oder intel verwenden willst, musst du entscheiden. intel ist aktuell im single-core-gaming noch etwas weiter vorne, amd wäre dennoch meine wahl, da ich die vielen kerne verwenden kann (im gaming wird das wohl erst in einigen jahren relevant).\nempfehlungsweise solltest du mit 16 GB RAM anfangen (2 mal 8er riegel), denn dann kannst du ohne probleme auf 32 aufrüsten. das teuerste ist die GPU (grafikkarte), hier musst du sehen, was genau du brauchst. für LoL brauchst du keine vega 64 oder 1080 TI (mal ganz abgesehen von 2080 oder so). eine 1060 6GB dürfte stark genug auch für die nächsten jahre sein (es sei denn du willst AAA titel spielen).","replies":[{"poster":"rammsteinsgate","date":"2018-09-27T12:21:55.687+0000","up_votes":1,"down_votes":0,"body":"du kannst natürlich auch erstmal ganz ganz günstig anfangen, aber das mainboard sollte zukunftsfähig sein, ist auch nicht teuer. für 500 € kannst du dir einen soliden desktop PC zusammenbauen, weniger wird irgendwann schwierig. optimal wären wohl ca 1000 €, dann kannst du auch eine richtig gute grafikkarte, einen starken prozessor und 16 GB RAM verbauen","replies":[]}]},{"poster":"Wísecheese","date":"2018-09-27T08:54:05.983+0000","up_votes":1,"down_votes":0,"body":"Also wenn ich dich richtig verstehe, dann möchtest du die CPU in deinem Notebook tauschen?\n\nSollte dies der Fall sein kann ich dir hiermit schon direkt sagen, dass sich das als recht schwer erweisen wird. Geschweige denn, dass dies nicht üblich ist.\nBei manch einem Modell klappt das, aber die meisten Notebooks sind dafür einfach nicht geeignet. Du würdest dabei vermutlich mehr kaputt machen, als verbessern.\n\nDa alleine schon die Wärmeentwicklung ein etwas größeres Problem darstellen wird/kann. Dann kommt noch hinzu, dass das Mainboard die neue CPU vermutlich nicht unterstützen wird, ohne weiters zu tun(im einfachsten Falle könnte ein BIOS Update helfen). Zu mal dann zu beachten ist, dass die CPU auch für den Mainboard-Sockel geeignet sein muss.\n\nUnd das sind nur die Dinge, die mir dazu spontan einfallen, wobei ich sicherlich noch weitere Probleme aufzählen könnte. {{sticker:zombie-nunu-bummed}} \n\nTL,DR: CPU im Notebook austauschen solltest du sein lassen. Du solltest dir lieber ein Desktop-PC zu legen.","replies":[]}]}