{"poster":"Kata Ga Kill","date":"2015-09-09T12:57:36.971+0000","title":"AP Champs vom Austerben bedroht?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":11,"body":"Zurzeit ist das Meta sehr stark in Richtung Tank und ADC skalliert.\n\nADC kann schnell und von Anfang an hohen DMG an Champs verursachen, w&auml;hrend der Mage/Assassine erst nutzlos daneben steht und erst reingehen kann wenn die Gegner Low sind um den \"Burst\" zu machen.\n\nADC kann direkt effizient den Drachen killen allein, w&auml;hrend der AP Champ das selbst nicht mit Full LV & Full Equip schafft, ab da ist es witzlos schon zu sagen AP f&uuml;r den Burst dmg, das kann ein ADC besser.\n\nGenauso Towers, ADC macht das in sekunden allein Platt, w&auml;hrend der AP Monate daf&uuml;r braucht, soviel zum Burst DMG von dem alle \"labern\".\n\n--------------------------------------------------------------------------------------------------------\nWieso wird &uuml;berhaupt noch AP gespielt? - Denke es ist nur noch ein Gewohnheits-Traditions-Relikt der Leute da das Meta so sein muss in den Köpfen der Leute anstatt sich Gedanken darum zu machen.\n\nEs ist doch gleich sinnvoller Mitte mit nem ADC zu best&uuml;cken oder warum nicht besser:\n2 Bot> Tank Support und ADC\n2 Top> Ebenfalls Tank Support und ADC\n1 Mid> Ein Bruiser (Mobil, tanky, und hoher dmg)\n\nDa br&auml;uchte man ja keinen Jungler wuzo auch, der gegnerische Jungler wird kaum Ganken k&ouml;nnen durch diese Aufstellung, wer als Jungler mal nen Tank Top ganken wollte weis das es kaum geht wegen viel DEF/HP genauso ist es mit Mitte dann.\nTop macht druck durch die selbe aufstellung wie Bot (und kommt mir nicht mit Gold fehlt ohne Jungle, daf&uuml;r haben die Support Tanks, die Golditems).\nBruiser kann ebenfalls effektiv Roamen, bestes Beispiel Shyvana sie ist auch ein Jungler die gut ganken kann, also sprich kann sie genauso effektiv Roamen und Mitte positioniert werden.\n\nUnd durch 2 ADC ist der DMG Output viel st&auml;rker in kombintaion mit 3 Tanks/Bruiser unbesiegbar in Teamfights.\n\n---------------------------------------------------------------------------------------------------------\n\nZuletzt noch glaube ich das das gro&szlig;e Problem bei AP Champs ist das die Autohits nicht auf AP skallieren k&ouml;nnen bisher, daher verlieren sie das Rennen im Meta. Daher ist Diana noch gut da sie durch Ihre Passive und 2 Items noch gut mit Autohits arbeiten kann da die dann auf AP zu teil skallieren.","replies":[{"poster":"Evenrider","date":"2015-09-09T13:27:43.821+0000","up_votes":2,"down_votes":0,"body":"> Wieso wird &uuml;berhaupt noch AP gespielt? - Denke es ist nur noch ein Gewohnheits-Traditions-Relikt der Leute da das Meta so sein muss in den Köpfen der Leute anstatt sich Gedanken darum zu machen.\n\nMan braucht auch magischen Schaden. Ja es gibt ein paar Champions, die magischen Schaden mitbringen und auf AD gespielt werden. Allerdings sind das immer noch sehr wenige.\n\n> Bruiser kann ebenfalls effektiv Roamen, bestes Beispiel Shyvana sie ist auch ein Jungler die gut ganken kann, also sprich kann sie genauso effektiv Roamen und Mitte positioniert werden.\n\nShyvana hat ein beschissenes Gankpotential.\nPre 6 kann sie nur laufen und besitzt kein CC. Rengar, Diana, Zed oder KogMaw haben dort besseres Potential.\nPost 6 hat sie einen kurzen Dash mit Knockback. Rengar, Diana, Zed dürften immer noch besseres Potential haben, zumindest wenn ich bedenke wie schwer es ist, diesen Knockback zu treffen.\n\n> \n> Und durch 2 ADC ist der DMG Output viel st&auml;rker in kombintaion mit 3 Tanks/Bruiser unbesiegbar in Teamfights.\n\nKommt drauf an. Viele werden danach dann eine Full AD kombo haben und geplättet werden, da auch der LW Grenzen hat und man einen Taric, einen Amumu oder eine Sejuani mit über 400 Rüstung nicht mehr töten kann.\n\n> \n> ---------------------------------------------------------------------------------------------------------\n> \n> Zuletzt noch glaube ich das das gro&szlig;e Problem bei AP Champs ist das die Autohits nicht auf AP skallieren k&ouml;nnen bisher, daher verlieren sie das Rennen im Meta. Daher ist Diana noch gut da sie durch Ihre Passive und 2 Items noch gut mit Autohits arbeiten kann da die dann auf AP zu teil skallieren.\n\nKogMaw hat einen OnhitEffekt auf AP. Orianna hat dies. Lux hat dies. Ziggs hat dies. Und im Gegensatz zu Diana muss davon keiner 3 AAs machen.\nDurch eine Masterie und Nashors Tooth kann jeder diesen Effekt haben.\nCassio besitzt ihre E, die, schlimmer als jede AA, gespammt werden kann.\n....","replies":[]},{"poster":"4 R4nd0m N008","date":"2015-09-09T13:18:18.573+0000","up_votes":2,"down_votes":0,"body":"> Genauso Towers, ADC macht das in sekunden allein Platt, während der AP Monate dafür braucht, soviel zum Burst DMG von dem alle \"labern\".\n\nEin AP-Champ macht genauso viel DMG per Auto-Hit an Towern wie ein ADC. Zumindest wenn er einiges an AP hat. Nur es fehlt das Attackspeed. Ansonsten wären sie genauso schnell darin Tower zu plätten. Und wie soll man einen Tower \"bursten\", wenn der Burst auf den Spells liegt und Spells nicht auf Tower funktionieren? Es ist auch einfach nicht geplant, dass AP-Champs genauso schnell Tower einreißen wie ADCs.\n\nIm Teamfight macht ein Brand mit seiner Combo definitiv mehr Schaden, als jeder ADC in dieser Zeit schafft. Nur danach ist sein Burst aufgebraucht und der ADC hat immernoch seine Autoattacks. Sobald Brand keine CDs mehr hat kann er aber wieder mehr DMG machen als ein ADC in dem Zeitraum. Wo macht ein ADC jetzt also so unfassbar viel mehr Schaden?","replies":[]},{"poster":"HonkyTonk","date":"2015-09-09T21:46:49.645+0000","up_votes":2,"down_votes":1,"body":"Ich möchte mal meine Idee hier mit rein schmeissen...was haltet ihr von der Idee Statt den ap carry , den adc zu ersetzen? Sprich , auf der botlane mit apc + sup zu spielen. Natürlich kann man das nicht mit jedem apc machen , das ist mir klar.\nDie weitere teamzusammensetzung kann sehr flexibel sein. In der Mitte kann ein weiterer ap carry stehen , dann sollten aber definitiv Top und jgl ad Champs sein. Genauso sollte man ein champ im Team a la yi haben , der Tower genauso schnell einreißen kann , wie ein adc. \n\nMfg\n\nHonkytonk","replies":[{"poster":"Skyy22","date":"2015-09-10T07:10:05.676+0000","up_votes":1,"down_votes":0,"body":"Genau das hatte riot doch vor xD adcs werden immer schwächer und mordekaiser kriegt nen botlane rework :D","replies":[]}]},{"poster":"BìgM","date":"2015-09-10T05:42:40.564+0000","up_votes":1,"down_votes":0,"body":"Es gibt zwei Möglichkeiten:\n\n1. Entweder du hast das Spiel nicht richtig verstanden oder\n2. du bist der beste Troll, den ich hier je gesehen hab.","replies":[]},{"poster":"Project Chimera","date":"2015-09-09T13:28:03.553+0000","up_votes":1,"down_votes":0,"body":"Lass mich dich korrigieren: \n\nZurzeit ist das Meta sehr stark in Richtung **Off**tank und **Tristana+Vayne** skalliert.\n\n//Der Rest der adc's schaut aktuell ganz schön in die Röhre weil sie entweder nicht den konstanten Schaden oder die nötige Mobilität/Reichweite haben.. wegen? den viel zu krassen offtanks/juggernauts, whatever aktuell.\n\nNebenbei geht es den mid lanern vorallem dank der letzten Ap itemization ziemlich gut, das ganze hört sich von dir nur nach *rant* an..","replies":[]},{"poster":"SoloQisMentlBoom","date":"2015-09-09T13:27:28.163+0000","up_votes":1,"down_votes":0,"body":"Ich glaube du hast keine Vorstellung davon wie ein AP-Champion zu spielen ist.\n\nDer APler wartet nicht bis alle low-HP sind, sondern er macht alle low-HP. Hast du schonmal in der Spielzusammenfassung den verursachten Schaden angegeguckt? Den höchsten hat hier oft (einer) der AP-Champion(s) des Teams.\nADCs machen meist nur Singletarget-DMG, wobei APler oft AOE-DMG verursachen.\n\nDeine Teamzusammenstellung hat einige Schwächen (auf die Stärken werde ich nicht eingehen):\n1. Ungenutzer Jungle\n2. Gegner braucht nur Armor zu kaufen (sag jetzt nicht es gibt ja Armor Penetration. Gegen zwei 3k-Leben und 250 Armor (und Thornmail) Tanks wirst du kaum/keinen Schaden verursachen (außer bei Thornmail an dir selbst))\n3. Geringen/Kaum AOE-Schaden. Wie oben genannt machen ADCs meist Singletarget-DMG. Während die Gegner 3 von euch auf einmal downbursten, kriegt ihr nichtmal deren Tank auf unter 50% HP","replies":[]},{"poster":"Synatics","date":"2015-09-09T13:06:14.057+0000","up_votes":1,"down_votes":0,"body":"{{item:3143}} {{item:3075}} {{item:3110}} {{item:3047}} {{item:3083}} {{item:3748}} \n\nTanks werden sich freuen :)","replies":[]}]}