{"poster":"Kata Ga Kill","date":"2015-08-20T15:39:03.665+0000","title":"Garen und Darius: Eindruck zu 5.16","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Habe die 2 Champs kurz angetestet und mein pers&ouml;nliches Fazit erstellt wie die sich nun spielen etc.\n**(Selbstverst&auml;ndlich kann das jeder anders sehen)**\n\n____________________________________________________\n\n**Darius:**\n- Seine Passive ist OP, 5 Stacks Blutungen anzusammeln lohnt sich immens, man killt damit instant mit R und anderen Attacken und kann weitere Gegner ebenfalls deutlich Schaden zuf&uuml;gen bzw. killen\n- Sein Q gef&auml;llt mir allerdings nicht und ist nach meiner Meinung generft da sie nun eine lange Vorbereitungszeit braucht um dann zuschlagen zu k&ouml;nnen, w&auml;hrend der langen Zeit ist man in einem Silenced Status inklusive keiner AutoHits.\n- Die neuen Items machen aus Darius einen Terminator eine echte Killermaschine mit hohen DMG und genauso robust und Tanky\n**\nFazit: Siehste einen Darius heist es \"Asta la Vista Baby!\"**\n\n\n____________________________________________________\n\n**Garen:**\n- Sein Q ist deutlich generft er ist langsamer nun und sein silence h&auml;lt k&uuml;rzer an.\n- Sein W ist auch komplett dem Bach runter es ist nicht mehr kofortabel und so sch&ouml;n Passiv wie fr&uuml;her.\n- Sein R allerdings ist der schlimmste Nerf, wer der B&ouml;sewicht ist h&auml;ngt immer vom letzten T&ouml;tung ab heist soviel wie du kannst nicht immer &uuml;berall dort sein um den \"B&ouml;sewicht\" zu bek&auml;mpfen und in Teamfights kannste nicht immer den focusen. Im Fazit die R kann sich nicht der Situation anpassen was sie schlecht macht, weiter hinzu kommt das jetzt Permanent ein nervends Avatar Bild vom B&ouml;sewicht &uuml;ber Garen erscheint.\n\n**Fazit: Weniger mobiel, weniger sofort Tanky wegen W und seine Passive R ist selten durchf&uuml;hrbar in der Praxis.**","replies":[{"poster":"Awecoolsome","date":"2015-08-20T17:35:54.093+0000","up_votes":3,"down_votes":0,"body":"Ich möchte nicht sagen, dass Garen schlechter geworden ist, er macht jetzt aber weniger Spaß irgendwie. Es war halt eine Veränderung, die seine Stärke verändert ohne massiv zu beschneiden, doch Spielspaß weg nimmt. Was der Sinn davon sein soll verste ich nicht. \n\nDas schlimmste ist aber, dass Riot absolut Zwangsmäßig ihn als Tank haben möchte! Kein damage Garen - dazu hat er jetzt goßer HP nerf und weniger Utility (-silence, -Lauftempodauer -cc Redzuizerung...) So kippt er gleich um, bevor er an einen Gegner heran kommen kann.","replies":[]},{"poster":"Awecoolsome","date":"2015-08-22T12:47:04.317+0000","up_votes":1,"down_votes":0,"body":"Garen is OP - ich hab die letzten beiden Games 23/6 und 20/5 Stats gehabt. Beim alten Garen ist mir das nicht gelungen. Er fühlt sich etwas langsamer an, wegen dem Q nerf. Irgendwie ist seine Spielweise aber nicht so flüssig. Schade finde ich den Health nerf. Ich hätte eher ein Damage nerf gewollt, statt Sustain.","replies":[]},{"poster":"Wolffighter8","date":"2015-08-20T18:43:12.212+0000","up_votes":1,"down_votes":0,"body":"Garen is soo ein scheiß ich hab durch ein spiel gegen ihn den GANZEN spielspaß verloren er is einfach viel zu stumpf und zu strong :( RITO pls","replies":[]}]}