{"poster":"ooWARWICKoo","date":"2017-06-19T03:19:34.123+0000","title":"Nightbringer Yasuo Boarder","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hello everyone so basically i bought the icon for the border and i realised that its not showing up. So i went to some discussions and some of them said that you need to buy the skin as well. And i did buy the skin and the icon and its not showing up. Is this some sort of glitch or bug that is gonna be fixed next patch or something else? Thanks","replies":[{"poster":"Broporo","date":"2017-06-19T04:05:21.854+0000","up_votes":1,"down_votes":0,"body":"That border will only show up when you're using the Nightbringer Yasuo skin, and will not show on any other champion or skin. If you're using the skin and the border is still not showing, try to grab a quick screenshot and post it here so I can see what's going wrong.","replies":[{"poster":"Phantasmal Dawn","date":"2017-06-19T04:17:57.336+0000","up_votes":1,"down_votes":0,"body":"Have you adjusted the borders as well?  As it currently stands the borders are a bit off center and too large for their actual images on the loading screen, meaning you don't get to see the full borders.","replies":[{"poster":"Broporo","date":"2017-06-19T04:19:04.546+0000","up_votes":1,"down_votes":0,"body":"Please grab me a picture of that if you can! With a clear screenshot showing the error, I should be able to get the process started to fix it!","replies":[{"poster":"Phantasmal Dawn","date":"2017-06-19T05:24:43.543+0000","up_votes":1,"down_votes":0,"body":"I think it's just a sizing issue with the original borders, some of my custom skin pals released two replacement files that adjust their size to make them look a bit nicer, I can link you to the tweet where there's a link to the modified placement(and a gif showing the before and after for them).  It's most likely just a placement issue with monitors and resolutions if I had to guess.  Could you also tell me if the 3D character artist positions at RIOT games are for the Skins team, new champions, or both? \n\nThe tweet which links to the before and after images for the border edits can be found here.  https://twitter.com/Map_Skins/status/875870622521450496  \n\n","replies":[]}]}]}]}]}