{"poster":"TheGanera","date":"2018-05-19T22:44:12.837+0000","title":"[Championkonzept] Kuko, der Seelensammler","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":0,"body":"> #KUKO\n> ##Der Seelensammler\n\nDie Alten erz&auml;hlen in Bilgewasser von einem einsamen Wanderer, der die K&uuml;sten nach den Ertrunkenen absucht um ihre Seelen seiner schier unersch&ouml;pflichen Sammlung hinzuzuf&uuml;gen...\n\n> **Aussehen**\n\nKuko tr&auml;gt einen dunklen, flachen, breitkrempigen Hut und einen langen Mantel, der um seinen knochigen K&ouml;rper schlottert. Um den Hals tr&auml;gt er eine Art schmalen Schal. Er tr&auml;gt Lederhandschuhe und -Stiefel. In seiner rechten h&auml;lt er einen schartigen Bootshaken, in seiner Linken, wenn er mindestens eine aufgelesen hat, ein golden glühendes Bündel Seelen. \nSein Gesicht ist hager und umrahmt von kinnlangen, struppigen schwarzen Haaren. Seine Augen sind dunkel und Leer.\n\n> **Hintergrundgeschichte**\n\nEinst flehte ein Fischer, der in einen Sturm geraten war, den Himmel um Hilfe an und wie seine Augen so voller Panik den Horizont nach einem Zeichen für göttlichen Beistand absuchten, so erblickte er in der Ferne ein kleines, goldenes Licht.\nSüße Hoffnung floss durch seine Adern. Er glaubte die Rettung nah.\nDas Ruder wurde herumgerissen, die Segel neu ausgerichtet und Kurs auf die Küste gesetzt. \nDoch die Freude währte nicht lange.\nDer Seemann hatte in seiner Euphorie nicht auf das Wasser geachtet und nun war es gespickt mit schroffen Felszacken. Verzweifelt versuchte er noch zu entkommen, doch für diese Entscheidung war es bereits zu spät.\nSein Schiff zerbarst an den scharfen Felsen und der Fischer wurde am Strand angespült.\nSchlamm und Algen auswürgend öffnete er die Augen und atmete gierig wieder Luft statt Meerwasser. Er war dem Tod noch gerade so entronnen.\nUnd wie er so erleichtert aufsah, erblickte er einen Mann, der auf den vergammelten Überresten einer Kiste hockte.\n\"Wer bist du, mein Freund?\", fragte der Fischer seinen vermeintlichen Retter.\nDer Fremde erhob sich.\n\"Ich bin der Sammler.\"\nZwei Schritte, dann war er bei ihm. Ein Seil wand sich wie eine Schlange um ihn und fesselte seine Glieder. Kalte hände ergriffen ihn und zogen ihn zurück ins Wasser. Stahl blitzte auf, dann durchdrang ein scharfes Messer seinen Bauch und nagelte ihn am Boden fest.\nDas Meer drang in ihn ein und füllte seine Lungen. Mit jeder Welle breitete sich die Kälte weiter aus, bis er weder die kleinen Steine, die durch seine Haut schnitten, noch das Messer in seinem Leib spürte. Bis er gar nichts mehr spürte. \nDer Fremde bäugte sich zu ihm herrunter. \n\"Ich bin Kuko.\"\nDas, was von dem Geist des Fischers noch übrig war, verließ seinen Körper und verschwand zwischen behandschuhten Fingern. Es hatte die gleiche Farbe, wie das Licht, dass der Seemann gesehen hatte.\n\"Irgendwann werden sie alle mir gehören.\"\n\n> **Werte**\n\nLeben: 550 (+ 92)\nMana: 270 (+ 40)\nLebensreg.: 7 (+ 0,55)\nManareg.: 5,5 (+ 0,8)\nAngriffsschaden: 63 (+ 3,5)\nAngriffstempo: 0,658  (+ 2,5%) \nRüstung: 42 (+ 4)\nMagieresistenz: 32 (+ 1,25)\nLauftempo: 335\nReichweite: 140\n\n(4 / 10) Schaden                 \n(3 / 10) Konstitution       \n(8 / 10) Massenkontrolle \n(6 / 10) Beweglichkeit   \n(0 / 10) Supporter  _*_\n_* Mit Supporter sind hier nur Heilungen, Schilde und andere Boni f&uuml;r Verbündete gemeint._\n\n> **F&auml;higkeiten**\n\n**Passiv - \nStrandgang:**\nAbklingzeit: 32 - 15 Sekunden (Abhängig vom Level)\nKuko kann durch Rechtsklick auf eine Mauer in einer geraden Linie mit einer Geschwindigkeit von 900 durch sie hindurch gleiten\n**Kollektion:**\nKuko sieht die Seelen der Ertrunkenen, die über dem Fluss schweben und kann sie seiner Sammlung hinzufügen.\nEs taucht alle 2 Minuten eine Seele über jedem Fluss auf, die, sollte sie nicht eingesammelt werden, nach 4 Minuten wieder verschwindet. \nAlle sterbenden Champions außer Kuko hinterlassen ebenfalls Seelen.\n_Hier sind sowohl gegnerische, als auch verbündete Champions gemeint.\nSollten zwei Kukos im Spiel sein werden dem jeweils anderen trotzdem Seelen hinterlassen._\n\n**Q - Trepanation:**\nAbklingzeit: 12 Sekunden\nKosten: 80 Mana\nKuko durchbohrt ein gegnerisches Ziel, das nicht weiter als 140 Einheiten entfernt ist mit seinem Bootshaken und fügt ihm \n60/80/100/120/140 (+  50% Angriffsschaden) normalen Schaden zu.\nEr kann diesen Bootshaken nun bis zu 2 Sekunden in seinem Opfer stecken lassen, um es zu betäuben. Während dieser Zeit kann er keine Fähigkeiten oder Gegenstände verwenden.\nReaktivierung dieser Fähigkeit oder ein Lauf- bzw. ein Angriffsbefehl brechen den Effekt vorzeitig ab.\nWenn der Bootshaken wieder herrausgezogen wird, \nerleidet der Gegner abermals 60/80/100/120/140 (+  50% Angriffsschaden) normalen Schaden.\nKuko kann diese Fähigkeit auf angekettete Gegner bereits aus 750 Einheiten Entfernung aktivieren, um so schnell zu ihnen zu springen, bevor er sie festnagelt.\n\n\n**W - Gnadenfrist:**\nAbklingzeit: 32/30/28/26/24 Sekunden\n(Keine Kosten)\n**Passiv:** Wenn Kuko mindestens eine Seele bei sich trägt, ist er in der Lage mit bis zu \n- (16/18/20/22/24 * Anzahl der gesammelten Seelen) Lebenspunkten zu überleben. \nSollte das Leben des Wanderers unter 1 gesunken sein, kann er nicht mehr geheilt werden, bis der Effekt, sobald er die Plattform betritt, oder sich 6 Sekunden lang nicht im Kampf befunden hat, endet und Kuko geheilt wird, bis er wieder 1 Leben hat.\n_Das Ganze funktioniert in etwa, wie ein Schild, der bei 1 Leben gewirkt wird.\nDie negativen Leben sollen durch einen neuen, anders farbigen Lebensbalken, der den \"normalen\" ersetzt, dargestellt werden.\nDie Abklingzeit wird erst ausgelöst, wenn Kuko sich geheilt hat._\n\n**E - Beseelter Zwirn:**\nAbklingzeit: 22/20/18/16/14 Sekunden\nKosten: 70/75/80/85/90 Mana\nKuko schleudert ein magisches Seil in einer geraden Linie 750 Einheiten nach vorne. Trifft es einen Gegner verursacht es 80/120/160/200/240 (+ 5 * Anzahl der gesammelten Seelen) magischen Schaden und kettet ihn, sollte sich eine Wand in 350 Einheiten Entfernung befinden, für 2,5 Sekunden an.\n\nAngekettete Gegner können sich nicht weiter von dem Hinderniss, an das sie gefesselt sind entfernen, als sie es waren, als die Verbindung aufgebaut wurde.\n_Auch durch Sprünge, Sprints oder Teleportationen lässt sich die Verbindung nicht lockern oder lösen.\nDen Mittelpunkt des Kreises, in dem sich der angekettete Gegner noch bewegen kann, ist der Punkt, an dem der Zwirn das Hinderniss getroffen hat._\n\n**R - Uferlicht:**\nAbklingzeit: 140/120/100 Sekunden\nKosten: 100 Mana; 1 Seele eines Ertrunkenen\nKuko opfert eine seiner Seelen und lässt sie als Irrlicht mit einer Geschwindigkeit von 450 zum Zielort, der maximal 1750/2000/2250 Einheiten und mindestens 450 Einheiten entfernt lliegen darf, fliegen, wobei Hindernisse immer umgangen werden. \nDas Irrlicht gewährt Sicht, macht wenn es beim Zielort angekommen ist kehrt und fliegt wieder zum Ausgangspunkt zurück. Dort angekommen erlischt es.\nNach 1 Sekunde Flugzeit kehrt das Irrlicht vorzeitig um, sobald sich ein gegnerischer Champion im Wirkungsradius(300 Einheiten) befindet, und bezaubert alle Gegner in Reichweite für maximal 2 Sekunden. \nWährend die Bezauberung anhält, beträgt das Lauftempo der Betroffenen immer 450 und kann nicht verändert werden.\nDer Effekt endet vorzeitig, sollte das Ziel sich zu weit entfernen.\n_Das Irrlicht kann sich nur über die Wege bewegen._\n_Auch wenn ein Gegner sich dem Irrlicht zu einem späteren Zeitpunkt nähert, wird er bezaubert._\n_Wenn das Irrlicht erlischt, wird das Bezaubern auch vor ablauf der 2 Sekunden beendet._\n\n> **Gameplay**\n\n**Rollen:**\nSupporter\nevtl. Top-Laner oder Jungler\n_Der geringe Schaden verhindert, dass Kuko sich auf zu vielen lanes breitmachen kann._\n\nKuko ist kein Kämpfer. Er hält seine Opfer nur an Ort und Stelle, bis seine Verbündeten sich um sie gekümmet haben und der Seelensammler seine Kollektion erweitern kann.\nDer einsame Wanderer ist im Roamen und Catchen eine tödliche Gefahr. Er taucht urplötzlich aus der Wand auf, fesselt seinen Gegner mit beseelter Zwirn, springt sie an und durchbohrt sie mit Trepanation, bis alles Leben aus ihnen heraus geflossen ist.\nCarrys, die sich im Jungle verirrt haben, werden Uferlicht schnell fürchten lernen, wenn sie wehrlos in ihr eigenes Verderben gelockt und abgeschlachtet werden.\nIm Teamfight sieht es jedoch weniger rosig aus, auch wenn Gnadenfrist für einen gewissen Spielraum sorgt. Kuko kann zwar versuchen einzelne Gegner zu sich zu ziehen oder sein Irrlicht loszuschicken um für Chaos zu sorgen, doch im vergleich zu der Effektivität, die diese Werkzeuge haben, wenn sie aus dem Hinterhalt eingesetzt werden, ist das eher weniger berauschend.\nGerade die Lane ist die Schwäche des Sammlers. Er kann nur versuchen Druck aufzubauen und hoffen, dass er Zeit findet, sich den herrenlosen Seelen, die über dem Fluss schweben, zu widmen.\nUnd so tödlich das Roaming des Wanderers auch sein mag - wenn jedes mal auch der eigene allein gelassene Carry stirbt, bringt es einen auch nicht weiter.\nDie größte Gefahr für Kuko besteht jedoch im zurückfallen, da das Einzige, was ihn so gefährlich macht, seine Fähigkeit ist, die Bewegungen einzelner Gegner auf grausamste Art und Weise einzuschränken. Sollte sein Team jedoch nicht in der Lage sein, die Opfer des Sammlers schnell genug zu töten, versinkt er schnell in dem tiefen Ozean, der Irrelevanz genannt wird. \n\n>**Patch Notes**\n\n**1.1 (20. 5. 2018)**\n\n* Die verbleibende Abklingzeit von Strandgang wird durch das Einschränken von gegnerischen Bewegungen nun nicht mehr verringert\n\n* Seelen können nun auch über dem Fluss schwebend gefunden werden\n\n* Ziele, die von Kukos E betroffen sind, können mit Trenapation aus großer Entfernung angesprungen werden\n\n* Kukos W wird zu Gnadenfrist, einer Fähigkeit, die es den Lebenspunkten des Sammlers \nerlaubt, in die roten Zahlen zu gehen\n\n* Es kann nur noch ein Gegner, der nun nicht mehr herangezogen werden kann und eine Wand von beseelter Zwirn getroffen werden; der Schaden skaliert mit der Anzahl eingesammelter Seelen\n\n* Kukos ultimative Fähigkeit wird zu Uferlicht, was ihm erlaubt Gegner mithilfe eines Irrlichts zu ihm zu locken, oder sich stattdessen zu ihnen zu teleportieren.\n\n**1.2 (21. 5. 2018)**\n\n* Kuko kann mit seinen Lebenspunkten nun weniger weit in die roten Zahlen gehen\n\n* Anpassung der Reichweite von beseelter Zwirn\n\n* Die Teleportation von Uferlicht wurde entfernt\n\n**1.3 (22. 5. 2018)**\n\n* Anpassung der maximalen Menge negativen Lebens von Gnadenfrist\n\n* Anpassung der maximalen Verbindungslänge von beseelter Zwirn\n\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n_Alle Zahlen, die ich hier verwendet habe, sollen nur eine ungefähre Richtung angeben und dass ich nicht wirklich Ahnung von Balancing habe macht sie auch nicht genauer. Die Werte stammen alle aus dem Vergleich verschiedener Champions miteinander._","replies":[{"poster":"SSF LastAngel","date":"2018-05-23T18:52:36.716+0000","up_votes":1,"down_votes":0,"body":"Hi .\nIch persönlich finde das Championkonzept sehr gelungen, wenngleich die Geschichte vielleicht noch mehr Potenzial hat.\nIch würde mich sehr freuen diese Lore in eine sammlung von Championstorys zu übernehmen, damit man sich auch später noch dran erinnert. Schreib mich an sofern du Interesse hast das diese Geschichte ein Teil der Runeterra Adventures wird.\n\nMfg Chris","replies":[{"poster":"TheGanera","date":"2018-05-24T23:36:16.613+0000","up_votes":1,"down_votes":0,"body":"Bitte, bedien dich.","replies":[]},{"poster":"INoKami","date":"2018-05-23T18:57:55.867+0000","up_votes":1,"down_votes":0,"body":"Schon interessant... zum einen sagst du, dass du die Lore nicht so toll findest und gleich im nächsten Satz willst du sie trotzdem für die Nachwelt aufheben... damit sich alle über die schlechte Lore kaputt lachen können oder was? :)\nMuss man jetzt nicht auf Anhieb verstehen, oder?\n\nUnd außerdem: wieso hab ich noch nie was von dir oder deinem Projekt gehört? Aber vor allem: Wieso stellst du ein solches Angebot nicht für meine Lores aus?????  Bin ich etwa so schlecht geworden? :(\n\n_\nSo, nach dieser Schleichwerbung für meine Lores... zurück an die Arbeit!_","replies":[{"poster":"SSF LastAngel","date":"2018-05-24T18:12:31.706+0000","up_votes":1,"down_votes":0,"body":"Ich habe lediglich gesagt die Lore hat noch mehr Potenzial, denn \"Ich finde das Konzept sehr gelungen, wenngleich die Geschichte vielleicht noch mehr Potenzial hat\". \nder Grund warum du noch nie was davon gehört hast ist das ich nicht jeden darüber vollspame und so viele Storys sind es auch noch nicht als das man irgendwie von nem Riesen Projekt reden kann von dem alle was gehört haben müssen.\n\nDrittens und da gebe ich dir keine Schuld. Ich habe dich mehrere Male über meinen Main Account adden wollen jedoch nie eine Reaktion bekommen. KED Chikara hieß der Account. Ich würde mich natürlich über jede weitere Lore freuen je mehr desto besser..--> Hättest auch einfach fragen können ob ich sie aufnehme, wenn du das möchtest sehr gern xd\n\nMit Freundlichen Grüßen,\nChris","replies":[{"poster":"INoKami","date":"2018-05-24T18:49:31.462+0000","up_votes":1,"down_votes":0,"body":"Du musst ja auch nicht jeden zuspammen (wie so gewisse andere Leute... Grüße an meine Rengaroo-Freund!), ein einfacher Thread hätte es z.B. auch getan. Weil irgendwie ist es so, plötzlich kommt da jemand ohne Ankündigung um die Ecke und will die Mega-Fanfic schreiben (Ok, es ist nicht wirklich eine Fanfic, aber wie so oft fällt mir gerade nichts besseres ein :* ) Oder anders rum gesagt: wenn du keine \"Werbung\" für dein Projekt machst, wird auch fast niemand darüber stolpern. BZw., um bei der Steinmetapher zu bleiben: Es kann niemand über deinen Stein stolpern, wenn du ihm diesen nicht in den Weg legst. So, soviel dazu.\n\nUnd noch eine Info meinerseits: Random FA von Leuten, die ich nicht kenne, lehne ich grundsätzlich ab. Eben, weil ich sie nicht kenne. Wenn du mich vorher benachrichtigen würdest a la \"Hey, kann ich dir mit meinem Main-Acc [Name des Accs] adden?\", würde das schon ganz anders ablaufen.\nOb meine Lores da auch rein sollen... von mir aus. Ich lege mich da nicht fest, wenn du es willst, kannst du die auch verarbeiten. Wobei... bitte nicht die ganzen cringigen Lores aus meiner Anfangszeit, also Nr. 1-3 (wobei bei Nr. 2 die die (gereworkte) englische Fassung doch ganz gut geworden...), über Nr. 4 und 6 müssen wir mal reden, Nr.5... schwieriges Thema, Nr. 7... die englische Fassung ist ok, aber sonst... Nr. 8 wird sowieso irgendwann mal (also wahrscheinlich eher gar nicht) komplett gereworkt, Nr. 10 ist auch so ne Sache, gleiches gilt für Nr. 12, Nr. 13 kann man sowieso nicht ernst nehmen, Nr. 17... mit zwei zugekniffenen Augen, der Rest (alle nicht genannten) sollte in Ordnung sein. Puh, ist doch etwas ausufernder geworden als gedacht :D\nUnd nur mal so, an alle Außenstehenden: die Zahlen sind nicht ausgedacht, ich bin gerade nochmal eigens meine Sammlung durchgegangen. Ich glaube, meine Rengaroo-Freund hatte doch recht, als er meinte, ich hätte keine Hobbies... wobei, ne, warte, das war über ein anderes Thema...\n\n_\nLeise vor mich hin murmelnd das Bild verlass..._","replies":[{"poster":"SSF LastAngel","date":"2018-05-24T19:06:24.956+0000","up_votes":1,"down_votes":0,"body":"Hey. da du mich ja jetzt kennst wäre es sehr freundlich , wenn du mir eine Auswahl an Storys die für dich gut genug sind schickst. Ob per Email / Client oder wie auch immer ist mir egal.\nWas den thread angeht das hab ich auch schon gemacht gab leider kaum antworten damals.\nAber danke für die hinweise!\n\nDaher kannst du mir ne FA auf meinen Account schicken wenn nicht ist es auch okay aber dann wäre das thema von meiner seite erledigt --> Chris Roshan","replies":[]}]}]}]}]},{"poster":"INoKami","date":"2018-05-20T12:11:18.256+0000","up_votes":1,"down_votes":0,"body":"Uiiiiii, frisches Blut in der Szene! Na, dann wollen wir mal!\n\n**Aussehen:** Nicht schlecht. Ob das jetzt kreativ ist oder nicht, ist schwer zu sagen (oder eher so rum: das herausstechende Merkmal fehlt), aber zumindest ist es gut beschrieben.\n\n**Lore:** Naaaa jaaaa... hat schon was Thresh-haftes _hust_ Tiefsee-Thresh _hust_, aber dazu unten mehr.\n\n**Texte:** Ach, schade, keine da :(\n\nGut, dann schauen wir uns mal die Fähigkeiten an:\n\n**\nDie Passive:** Was passiert, wenn Kayn und Talon gemeinsam laut \"FUSION!!!\" rufen...\n\n**\nDie Q:** Hui... also entweder Schaden oder ein Stun, für den man aber 2 Sekunden lang gar nichts machen darf. An sich gute Idee, aber vor allem den Stun wirst du in Temafights nie durchbringen können... oder doch, schon, aber du willst es nie, weil dann 5 Leute 2 Sekunden lang auf dich wehrlosen Typen einprügeln können. Kannst dir ja denken, wie so was ausgeht...\n\n**\nDie W:** Eine Urgot-E in besser. Na ja...\n\n**\nDie E:** Das ist abartig. Besonders wegen dem Effekt, dass sich die Ziele nicht weiter auseinander bewegen können... und dann noch ein Knockback dazu? Viel zu stark. Da ist mir schon die Bard-Q lieber.\n\n**\nDie R:** Nette Idee, bis auf zwei Sachen:\n\n* Erstens: Die Idee mit dem Reaktivieren ist zwar ganz nett, aber etwas zu stark für den Effekt, den der Dash hat.\n* Zweitens: Stell dir vor, dein Team ist behind und ihr schafft es nicht, auch nur einen einzigen Kill zu erzielen, weil jeder Gegner so gefeedet ist, dass er euch 1v5 umbrezelt. Heißt also, du kriegst keine einzige Seele und damit kannst du die Ult auch nie einsetzen. Wie sagte schon ein Riot-Mitarbeiter: \"Es ist besser, Spieler für gutes Gameplay zu belohnen, als sie für schlechtes Gameplay zu bestrafen.\" \n_Oder so ähnlich zumindest..._\n\nUnd auch hier wieder zum Ende: **Die wichtigste Frage:**\n\nÄhm, kleine Korrektur, heute sind es zwei Fragen: Zum einen: Wieso keine Zahlen? Weil ohne diese ist es fast unmöglich, einzuschätzen, ob, und wenn ja, wie stark das Kit ist. Macht die Q jetzt z.B. 250 oder 400 Schaden? Beträgt die Range bei der W 300 oder 500 Einheiten? Alles Zahlen, die über Leben oder Tod entscheiden... metaphorisch gesprochen, wir töten hier niemanden... oder?\nZum anderen: Weniger eine Frage als eine Bemerkung: Dein Konzept hat irgendwie das Gefühl von Thresh mit einem Hauch Pyke. Gäbe es da nicht was anderes? Also in dem Sinne, dass man ihm eine andere Geschichte o.Ä. gibt, in der das Kit trotzdem sinnvoll funktioniert?\n\n**\nDas Fazit:** Gut, jeder hat mal klein angefangen, also etwas milder heute: Das Kit an sich passt zusammen, das Thema stimmt, auch wenn wir das schon in der Kluft haben, die Lore und Aussehen sind ok und wenn die Fähigkeiten nicht zu stark sind oder andere gameplaytechnische Mängel aufweisen, sind sie sogar ganz nett und durchaus kreativ. Aber wegen der oben angesprochenen Dinge reicht das für mich nur für **4/10 Punkte**, aber mach dir keinen Kopf, setz dich einfach mal hin, lass dir nochmal die Sachen durch den Kopf gehen und dann sollte es was werden. Ich bleibe dran!\n\nMfG\n\nIncaedeus\n{{sticker:galio-happy}} \n_Leidenschaftlicher Galio-Main_","replies":[{"poster":"TheGanera","date":"2018-05-20T12:28:39.380+0000","up_votes":1,"down_votes":0,"body":"Texte muss ich mal gucken ob ich da noch welche hinzufüge.\n\nPassiv und Q werde ich vermutlich beibehalten, ch muss aber gucken ob ich die da von dir angesprochenen Probleme noch behebe.\n\nFür die W arbeite ich bereits an einer Verbesserung.\n\nDie E habe ich auch schon angepasst, da sich ein derartiger Spell eher für eine Ulti eignet, als für eine Grundfähigkeit.\n\nDas mit der Seele bei der R ist tatsächlich ein problem - mal gucken ob mir da etwas einfällt.\n\nDie Zahlen habe ich bewusst weggelassen, da ich das ganze ein bisschen im Stil eines Champion Reveals aufziehen wollte(nur ohne Bilder oder Videos dafür fehlen mir die Mittel) aber evtl. füge ich das noch hinzu.\n\nDie Geschichte werde ich denke ich mal bei behalten, aber vermutlich noch weiter ausführen, genauso wie das Bilgewasser-Thema, da ich ihn ein bisschen an einen Strandräuber anlehnen wollte.\n\nVielen Dank für das konstruktive feed back, ich werde auf jeden Fall noch ein bisschen an Kuko weiter arbeiten.","replies":[{"poster":"INoKami","date":"2018-05-22T17:02:32.144+0000","up_votes":1,"down_votes":0,"body":"Huiuiui, da hat sich was getan!\nDa es aber nur einige Stellen betrifft, hier die Kurzfassung:\n\n* Zahlen. Geil! Passen soweit alle bis auf den Ankettradius der E. 300 Einheiten sind einfach etwas zu wenig/zu stark, ich sehe das eher bei 350-400 Einheiten.\n* Die Idee der W ist verdammt interessant, aber die Umsetzung ist nicht ganz gelungen. Zum einen könnte man damit noch schöne Synergien auf andere Fähigkeiten packen, ist geradezu einladend, zum anderen ist der \"Schild\" viel zu schwach, um wirklich einen Impact zu haben. 20 Basewert x10 gesammelte Seelen sind 200 HP als Rettung, das haut dir jeder ADC mit 1,5 Items in einem AA weg (...hatte ich nicht mal behauptet, dass sonst die Zahlen passen würden? xD)\n* Die Ult... wenn eine Kalista-W für 7 Tage in Hormonbehandlung war. Nein, ernsthaft, die Idee ist nice! Und es passt auch zum Kit/Style des Champs, ich könnte mir den wirklich als roamenden Supporter vorstellen...\n\nGut, Lore hab ich ja angesprochen, über das Aussehen müssen wir noch mal reden, sonstige nette Kleinigkeiten wie Texte fehlen und ein, zwei Kleinigkeiten bei den Fähigkeiten muss man noch überarbeiten, aber für ein erstes Konzept ist das hier ansonsten echt nicht schlecht! Daher bin ich auch gewillt, auf **7/10 Punkte** zu erhöhen! Geht doch!\n\nMal schauen, was sonst noch so kommt, ich bleibe dran!\n\nMfG\n\nIncaedeus\n{{sticker:galio-happy}} \n_Leidenschaftlicher (und kopfrauchender(, weil neue Konzepte erfinden ist schwer :* )) Galio-Main_","replies":[{"poster":"TheGanera","date":"2018-05-22T17:08:49.161+0000","up_votes":1,"down_votes":0,"body":"Die Zahlen von der W werde ich dann vermutlich noch anpassen.\nGrößere Änderungen an den Fähigkeiten werde ich aber denke ich mal nicht mehr vornehmen.\n\nVielen Dank für das positive Feed Back. Ich werde die Zahlen dann evtl. noch ein bisschen anpassen","replies":[]}]}]}]},{"poster":"Kayantao","date":"2018-05-19T23:07:25.923+0000","up_votes":1,"down_votes":0,"body":"das wort was du bei \"supporter\" suchst - ist \"utility\" ^^,\nund der gehemmt debuff müsste erdung heissen, denselben debuff hat ja cassiopeia und singed.\n\nPassiv erinnert mich leider etwas zu doll and kayns E,\noder Talons jump, ist als passive ability vermutlich etwas zu stark ,\n\nDas größte \"problem\" bei deinem champion ist die kombo aus mobilität und cc,\nDu kannst entweder oder haben, weil wenn du beides hast, erschaffst du ein unglaublich starkes monster gegen das es wenig counterplay gibt.\n\nIch mag die Q ability, weil sie unique ist, mit einem drawback - willst du cc nutzen, setzt du dich selbst der gefahr aus nicht kämpfen zu können.\n\ndie W ist ok allerdings wie gesagt zu viel cc vermutlich.\n\ndie E ist definitiv zu stark für eine normale ability - erinnert mich stark an  varus ult.\n\ndie ultimate ist allerdings eine interessante fähigkeit - zwar ähnlich wie anni, oder ivern, allerdings mit zusätzlicher fähigkeit.\n\n\nWie anfangs gesagt - gute idee , leider zu viel cc auf einmal, dieser champion würde wenn es ihn so geben würde das game in der pro szene zur hölle machen, denn er könnte von überall her kommen, und hat massive cc zum ganken. wenn du aber die E oder W ändern würdest für einen anderen spell, dann hättest du ein sehr solides kit. Da dein champion der \"Seelen sammler\" solltest du das vllt etwas mehr ins kit einbauen.","replies":[{"poster":"TheGanera","date":"2018-05-19T23:27:40.807+0000","up_votes":1,"down_votes":0,"body":"Ersteinmal Danke für dein Feedback.\n\nIch hab bei den Werten einfach die Skala genommen, die auch im Client verwendet wird.\n\nMit deinem Einwand, der Champion hätte zu viel oder zu starke CC hast du vermutlich recht.\nIch werde daher die E etwas nerfen.","replies":[]}]}]}