{"poster":"NEW Xenox","date":"2017-01-23T17:56:44.821+0000","title":"Newage Gaming sucht jungler und top laner für tryhard team","subforum":"Clans & Teams","up_votes":4,"down_votes":2,"body":"Hallo ich bin Max(16). Ich und xp froxy (Lukas) 15 und Jan (17) wollen ein semi professionelles Team aufbauen das l&auml;nger zusammenspielt und nicht nur ein paar Wochen. Wir orientieren uns Richtung Turniere and werden uns auf diese mit 4 mal Training in der Woche und mit vergangenen Spiel analysen vorbereiten. Wir suchen noch einen jung und Top laner die ihre Rolle beherrschen sollten.\n\nZu uns: ich spiele derzeit auf diesem Account da mein main Account Froggnivia ungl&uuml;ckerweise nicht mehr zur Verf&uuml;gung steht. Wir befinden uns derzeit in Gold 1 und plat 5 und plat 5. Ich war letzte season Platin 2 und xp froxy jan war diamond . Wir haben alle schon in mehreren Teams gespielt und schon Turnier Erfahrung gesammelt.\n\nUnsere trainingszeiten sind\n\nDienstag 18-21\nDonnerstag 18-20\nMittwoch: 16-18\nSamstag 14-18/19\nSonntag 16-20\nDie trainingszeiten am Wochenende k&ouml;nnen sich durch scrims oder Turniere &auml;ndern\n\nBei Interesse bitte NEW Xenox ing adden","replies":[{"poster":"GhostMokomo","date":"2017-01-23T18:16:48.542+0000","up_votes":1,"down_votes":0,"body":"Also ich bin absoluter Jgl Main kann eig so gut wie jeden jgler.\nAlso falls ihr noch sucht stehe ich gern zur verfügung für ein Testspiel.","replies":[{"poster":"404 Froxy","date":"2017-01-23T18:25:52.751+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"IS12265a04a5411c","date":"2017-01-23T19:04:32.056+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nspiele Lol schon seit ca. 5 Jahren, hatte zwischenzeitlich eine längere Pause, spiele aber seit Anfang der Season wieder. Hauptsächlich Jungle oder Adc. Bin zur Zeit noch Gold, war aber die vorherigen Seasons als ich noch aktiv war Platin-Diamond. \nKönnt mich gerne Ingame adden - Matzdosch (19jahre)","replies":[]}]}]},{"poster":"DC Jadenfire","date":"2017-01-23T18:44:36.901+0000","up_votes":1,"down_votes":0,"body":"Hallo Mein Name ist Tizian, ich bin 21 Jahre alt und spiele so aus spass seit es das Spiel gibt. Nach 1 Jahr Pause habe ich nun dieses Jahr das erste Mal angefangen zu Climben und bin seit Season Beginn von Silber 5 auf Gold 4 - Gold 3 hochgekommen. Bin Jungle Main (Zac, Hecarim, Kha Zix & Elise) Ich konnte diese Season so gut climben weil ich mir jeden Tag den Stream von Nightblue3 angesehen und ihn studiert habe. In Duo Q bin ich meistens Jungle, Ich komm aber auch als Top (Nautilus, Darius) - und Midlaner (Orianna, Vel'Koz, Karma), sowie als Support (Braum, Leona & Karma) klar. \n\nIch habe Clanerfahrung (wie man am Tag merkt) aber offen dafür einen neuen Tag anzunehmen.\n\nIch spiele jeden Tag bis zu 7 Games und bin lernfähig und geduldig (ausserdem eher ein vorsichtiger Spieler - lieber farmen und nicht sterben als Kills abzustauben und den Gegner vielleicht zu feeden)\n\nBei weiteren Fragen schickt mir in-Game einfach eine PM. \n\nLiebe Grüsse\nDC Nightseth3","replies":[]}]}