{"poster":"NamiUltHitMe","date":"2018-04-09T13:58:12.741+0000","title":"Void Story That I Wrote: The Girl From Below (10min read)","subforum":"FanFiction","up_votes":1,"down_votes":0,"body":"(10min read)\n\nOk, so I wrote this for the Touch of The Void entry a couple weeks back :3. I just wanted to post this here for anyone :D . I really put a lot of energy into it (even though I wrote it in 2 hours before the due time xD). So yeah, here it is. :D Please comment! :D I&#039;ll really appreciate it!\n\nThe Girl From Below\n\nThe purple beast is screeching, roaring from beneath.\n&ldquo;Below me,&rdquo; she utters under her breath.\nThe floor rumbles, it echoes. A halting screech from below.\nHer left foot stumbles in the eery, dark lit underground. \n&ldquo;Come out!&rdquo;\nI will live. I will keep on going. I will destroy you. I will find my way out of here!\nShe ruffles her body.\nThe brown ground erupts, revealing a purple and blue creature with great teeth and sharp claws.\nShe dodges to her right. Her body disappears leaving behind air. \nThe creature pounces on nothing.\nIt lets out a piercing scream and turns towards various directions. The girl reappears from nowhere.\n&ldquo;Go back void spawn!&rdquo; she exclaims with a huge, circle purple glow from behind her with vines entangling all around it.\nA plethora of purple needles eject from her armoured skin. Her face and her eyebrows are creased as she grits her teeth. \nThe creature recoils and swings its tail swiftly, leaving a heart stopping gleam.\nIt digs back down, making the ground tremble.\nShe gets on her feet, moving paces to the left. \nI can do this!\nFrom the edge of her right eye, she sees a part of it, seep to the surface.\nA swift, purple beam shoots towards her.\nHer eyes enlarge.\nIt collides with her body. She flies a great few metres as she lets out a short yelp and grunt.\nShe rolls on her body.\n&ldquo;Kai&rsquo;sa get up!&rdquo;\nImages of her flare up in her mind. She is small, with a deep space in her eyes. She looks at a hole in which its depths, radiate a hungry purple as she walks closer to the ground. With a stumbling left foot, she falls down. &ldquo;Papa!&rdquo; the sun slowly disappears.\nThe older girl grits her teeth and grunts. \nThen images of her days, come up too. The skin is becoming a part of her. Purple substance oozes from a creature of six legs in front of her, twice her size. Her eyes are covered in red and water. &ldquo;Someone help me!&rdquo; \nShe can&rsquo;t help but think of this event. It is at that moment, when she realised, she was alone. She wants to live and to keep going, to go back to father. No one will save her but herself. The younger girls wipes her eyes and clenches her fists.\n&ldquo;No matter what, you fight.&rdquo; Another memory crops up. It was her father eating dinner with her. \nHer eyes light up brightly. Her body gracefully gets back up in a twist. The creature is but a second away from her on the surface with it&rsquo;s familiar scream. It lifts its left arm in a quick motion. \nThe girl, in a blink of an eye appears behind it. She shoots out the most illuminating, purple orb from her hands after sharp needles from the other. Her right hand joins in as well as her body as she takes steps back. \nThe creature leaps at her distance, revealing its sharp, humangous jowls. \nOnce again, she disappears, reappearing a good distance to its side as she pierces its skin. \n&ldquo;Void rule number one: don&rsquo;t die.&rdquo;\n\t\t\t\t\t******\nThe sky is a dance of purple, low yellow and thunder.\n&ldquo;For Noxus!&rdquo; inspires a combatant wielding a huge mace from a great distance.\nThe familiar girl turns the the village children. Her face reveals itself.\n&ldquo;Go to your family and warn them now! They&rsquo;re coming!&rdquo;\nA girl with dark brown eyes, stumbles as well as the two other boys with eyes as if they see death. They instantly turn around.\n&ldquo;Mom! Dad!&rdquo;\n&ldquo;Good&hellip;&rdquo; she sighs under her breath.\nHowever, one stays. Kai&rsquo;sa&rsquo;s eyebrows raise. She has the same hair and eyes as her but her knees shake rapidly.\n&ldquo;What will you do?!&rdquo;\n&ldquo;Don&rsquo;t worry child. I&rsquo;ve fought on my own before. I can do this. I&rsquo;ve done this a million times. Down there, I had to.&rdquo; She smiles at the child.\n&ldquo;I once was prey to the void, waiting for someone to save me but then I realised I had to save myself. I remembered the world&rsquo;s beauty and realised, I wanted to live in the world.&rdquo;\n&ldquo;No matter what, you keep going. You fight for the beauty, for the people, for your world.&rdquo;\nThe child&rsquo;s knees stop shaking, her eyes light up and her lower jaw drops slightly. She joins the other children. Her mask comes back up.\nKai&rsquo;sa turns around. She sees a huge army and some purple and blue in an entangling mess. Some making their way to where she is. \nI can save them from monsters, but who will save them from theirselves&hellip;\nShe places her hand on her stomach and arms as she grunts and stances her knees.\nHer body slowly glows a hungry purple.\n\t\t\t\t\t\t*****\nRoars of men dominate the air as their spears and sword poke into a humongous being many times their size as tall as the tallest tree, as wide as a village. \nIt reaches down, grabbing men using its mouth. It devours them.\n&ldquo;You are such hideous creatures!&rdquo; it echoes a in a grumbling tone after a laugh.\nIt swings its arms, sending the men and Kai&rsquo;sa in a dodge. \nSome of the men turn to her, hurling their spears and swinging their swords.\nTheir bodies although, meet needles and they fall to the floor after she leans back, crouches down and jumps to her left and darts behind. \n&ldquo;Five down.&rdquo;\nA huge eye with tentacles hover above a huge crowd, which shoot arrows. \nIt laughs, in a screechy tone as it erupts a purple beam from it&rsquo;s eyes, decimating everything it touches and sending men dodging.\nThe other huge creature keeps devouring everything in its path and the eye shoots out purple, burning everything down.\n&ldquo;Hey!&rdquo; Kai&rsquo;sa shoots a similar yet different orb. \nIt meets the eye, as it shuffles back and places its tentacles over its front.\nKai&rsquo;sa lets out a short laugh. \nShe disappears, appearing behind the creature. \nHer body cooperates with her arms, shooting needles. \nThe eye lets out a sharp grunt, clapping its arms together. \n&ldquo;Too slow&hellip;&rdquo; Kaisa disappears to the side. \nShe looks back. The ground bursts leaving behind a purple, oozing crater. \n&ldquo;I&rsquo;ve slain many creatures like you before!&rdquo; exclaims Kai&rsquo;sa within the battleground of men and purple clashing each other.\nKai&rsquo;sa lets out a slight smile. \n\t\t\t\t\t\t*****\nThe same skies still battle each other even though there is only silence in the grounds.\nKai&rsquo;sa stands in the middle.\nHer face reveals within her skin as she stares deep within the sky.\n&ldquo;The Void will swallow everything in it&rsquo;s path.&rdquo; Grumbles a deep, husky voice behind her.\nHer suit glows as sudden, sharp purple. Her eyes light up as she looks at her body but swiftly turns around. \nShe lets out a short exclaim, as her knees bend and she grips her strength in her arms. \n&ldquo;The balance and power must be preserved!&rdquo; \nIt looks more human than anything she ever sees. Her eyes dart to the ground for a millisecond.  \nHer armour hardens.\nThe creature glows the familiar hungry purple but with a glowing blade in it&rsquo;s hand and tubes on it&rsquo;s face. It takes the shape of a human, a bit taller than her. \nKai&rsquo;sa within a flash, shoots her purple orb. \nHer eyes light up as she lets out a grunt.\nThe creature, blinks appearing to the side.\nShe releases her needles from her body but the creature releases an orb towards her, making a purple glow around its own body. The needles fall to the ground like paper, not piercing the creature&rsquo;s skin. \nShe tries to dodge the creature&rsquo;s orb but she does not. Something holds her. She looks to the floor. Nothing. \nShe flies to the ground in a sharp yelp, stumbling.\n&ldquo;Your magic is powerless against me!&rdquo;\nShe shakes her head. Kai&rsquo;sa what are you doing? Why did you not move?\nShe lets out a roar and swiftly rockets up.\nThe creature laughs, swinging its blade.\nIt blinks towards her.\nKai&rsquo;sa disappears, appearing at the creature&rsquo;s side.\nShe tries her needles again as she creatures swings it&rsquo;s blade at nothing but the air, where she was a second ago.\nHer needles violates its space as it lets out a sharp grunt and a step back. \nIt turns its&rsquo; head towards her, revealing a yellow glow it in its eyes.\nKai&rsquo;sa gasps as her eyes light up. \nSomehow, memories of her father crops up in her head. The dinner, the day it happened.\nKai&rsquo;sa shakes her head. She lets out a purple orb from her hands, hitting the stumbling creature.\nKai&rsquo;sa blinks next to it. She sends a sharp kick to it&rsquo;s head and shoots needles from her left hand. \nThe creature grunts loudly.\nShe sends out another kick from her other leg. However, the creature blinks behind her and drives it&rsquo;s blade, violating Kai&rsquo;sa&rsquo;s left leg. \nShe lets out a grunt and falls to the floor.\nKai&rsquo;sa grits her teeth as they both dance in the battlefield, blink after blink, two void creatures battling as the skies dance in yellow, purple and thunder.\nHer body burns as the orbs hit her and her body nimbles as it drives it blades to her, bit by bit.\nShe yelps. She stops moving. She falls to the floor in loud breaths. \nThe creature slowly moves on top of her, flirting the blade above her face.\n&ldquo;Foolish girl,&rdquo; it comments with sighs in between.\n&ldquo;Why do you fight for the world? The void is the answer! Humans are corrupt and dark. They don&rsquo;t want order. They want war! They will do whatever it takes to achieve their selfish needs! The world just takes and takes!&rdquo;\nIt kicks Kai&rsquo;sa in the gut, she lets out a large gasp. Her senses are dulling. The skies blurs as Kai&rsquo;sa&rsquo;s eyes close for longer times and her breaths shorten. \n&ldquo;I was once like you, holding onto faith. Until the void gave me a taste.&rdquo;\nFurther memories, haunt and enter her head. \nWhy now?!\nShe remembers the people, images of beauty, flowers, images of cooperation and children. Kai&rsquo;sa brings herself back to the present.\n&ldquo;It&rsquo;s what is beautiful in the world is what is worth saving, what is human!&rdquo;\nWithin a flash of lighting, she twists her body in a dance, shooting needles and sending kicks to the creature&rsquo;s face. It stumbles back and grunts. \nShe gets back up. The slight sunlight touches her face in midst of the battlefield, revealing her eyes which roar and glitter. \n&ldquo;In the void, I had no one. I only had myself! You will not take this world! You will leave! I will send you back! I&rsquo;ve slain many before!&rdquo;\n&ldquo;Justice will be served!&rdquo; it replies.\n\t\t\t\t\t\t*****\nThe girl stands before the tens of steps. Two towers guard its entrance. Huge words are on top of the towering, roaring, gleaming building and entrance.\nShe crosses her arms and chuckles slightly.\nI used to be a little girl, I used to have no hope. But now, I&rsquo;ve changed. I may look like the Void but I am not the Void. I fight for the world, I will keep fighting for my home. I can&rsquo;t let the Void take that away from me. This is why I came back. \nThe sun illuminates the side of her face and she lets out a slight smile. She saved that village, all of those people. She defeated those voidspawns. For now, they are safe. \nShe remembers her father, his smile, the dinner he cooked. The words he would say to her.\nFather, you would be so proud of me if you could see me now. After all that, I lived. I made it through. You told me about how beautiful the world is and how we should fight to keep the people and the world in it.  Before I didn&rsquo;t understand but I do now. I&rsquo;ve never seen you ever since I was little. I may have lost you but I haven&rsquo;t lost my memories of you.\nI will fight for this world. Kai&rsquo;sa, remember the name.\nShe remembers the last creature she encountered. Something was familiar about it, something eery and dark.\nI hope I never see it again.\nKai&rsquo;sa steps towards the entrance with closed fists. \n&ldquo;Summoner&rsquo;s rift&hellip; Now I will tell this tale.&quot;\n*****\n\n\nA/N: Ok, so pretty much, Kai&rsquo;sa fights Rek&rsquo;sai from entering the human world. Kai&rsquo;sa then also fights Noxus, Vel&rsquo;koz and Cho&rsquo;gath. She then fights Kassadin. She then heads on the League of Legends to fight in the Summoner&rsquo;s Rift! :D And yes, the 2nd part was inspired by her canon lore xD Trivia: I didn&rsquo;t notice it before but, did you know, most void champions have three letters then an apostrophe? Lol oWo \nSo yeah, be sure to comment! I&rsquo;ll really appreciate it! :D\nBtw, I might repost this to reddit. :3","replies":[]}