{"poster":"Kîng v1","date":"2015-05-07T13:12:34.616+0000","title":"Disconnected","subforum":"Allgemeiner Chat","up_votes":16,"down_votes":0,"body":"Hey,\r\n\r\nbin grad in nem Ranked einfach disconnected und jz kann ich nicht Reconnecten da kommt irgendwas mit Firewall problemen.... im ts 40er ping, riot?","replies":[{"poster":"Grînsekater","date":"2015-05-07T17:47:53.049+0000","up_votes":5,"down_votes":1,"body":"Also, \nein paar Fakten:\n10 leute haben SYNCHRON einen DC im SELBEN spiel! ->> Serverseitiges problem ODER problem im Client code, was zu einem DC mit dem server führt wenn irgend etwas spezifisches im spiel geschieht.\n\n->> KEIN fehlverhalten seitens der spieler, firewall ändern, Spiel reinstallieren und co oder da allseits beliebte \"lösch doch mal den cache\" sind vergebene mühe.\n\nviel intressanter finde ich das das problem hier im Forum seid 4! stunden bekannt ist, und nicht mal eine Service meldung, oder eine \"achtung Verbindung kann abbrüche haben\" im Spiel auftaucht. \n\noh und wenn man das spiel verliert wegen einem massen dc, und ein gegner ist schneller wieder im spiel und macht den final push .. \n\noder man ist nicht im spiel und das game wird \"verloren\" weil ein gegner mal eben durchpusht ..\nFreut euch auf LEAVER BUSTER ! ES SIND KEINE VERGEBENEN NIEDERLAGEN etcpp.\n\nalso, das war nun seid etwa 2 wochen mein erstes spiel da ich auf HotS umgestiegen bin ( primär nicht ausschließlich )\n\nkann ich leider nur sagen, ich geh zurück zum großen B da funktionieren die server wengistens.","replies":[{"poster":"Shâcos Clone","date":"2015-05-07T20:03:02.999+0000","up_votes":2,"down_votes":0,"body":"Soll ich dir mal einen Witz erzählen ? Diese Probleme sind nicht nur seid 4 Stunden sondern seid TAGEN bekannt !\nMir ist das sogar schon am Sonntag Passiert... Oder am Dienstag...\n\nDiese Probleme sind schon Mindestens seid Dienstag bekannt und es gab nicht mal eine Meldung dazu !","replies":[]}]},{"poster":"broxnight","date":"2015-05-08T10:11:48.169+0000","up_votes":3,"down_votes":0,"body":"hab sogar das problem, das er noch nicht al verbindung zum pvp server aufbaut repair exe laufen lassen usw nützt alles nichts -.- gg tiot","replies":[]},{"poster":"Vathek","date":"2015-05-07T13:41:21.886+0000","up_votes":2,"down_votes":1,"body":"Servus,\n\njo hab genau das gleiche Problem. Was soll man da nun bitte machen? Das war meine Promo... {{champion:222}}","replies":[{"poster":"MrChinostyle","date":"2015-05-07T14:17:16.107+0000","up_votes":2,"down_votes":0,"body":"dich auf den leaver buster freuen weil du das spiel nicht zuende gespielt hast :) und auf den loss.. ~ riot eben","replies":[{"poster":"Vathek","date":"2015-05-07T14:20:44.945+0000","up_votes":2,"down_votes":0,"body":"Klasse >.> das geht schon ne Stunde so, jedoch danke für die Antwort. {{summoner:3}}","replies":[{"poster":"PlanetenPlatzer","date":"2015-05-07T17:21:50.158+0000","up_votes":1,"down_votes":0,"body":"Hatte ich auch schon ein oft. Und da kann man rein gar nichts dagegen tun, außer auf die verringerte Warteschlange zu warten","replies":[]}]}]},{"poster":"Yarazor","date":"2015-05-07T16:51:12.644+0000","up_votes":1,"down_votes":1,"body":"Hab das selbe problem ebenfalls promo.... danke riot!! ziemlich unfähig","replies":[{"poster":"Yarazor","date":"2015-05-07T17:36:57.996+0000","up_votes":1,"down_votes":1,"body":"und danke das ich nicht mehr zocken kann, weil verbindung wiederherstellen dauerhaft da steht!!!!!!!!!!!!!!!!","replies":[{"poster":"Gordash","date":"2015-05-08T12:20:57.188+0000","up_votes":1,"down_votes":0,"body":"Genau das Problem habe ich auch ARGH!!!! \nKann bloß mit Freunden schreiben, aber das hilft mir nicht.... kotzt an sowas!","replies":[]}]}]}]},{"poster":"WEAZ3L","date":"2015-05-07T14:09:54.912+0000","up_votes":2,"down_votes":2,"body":"Gleiches Problem. Anstatt ständig irgendeinen Mist zu patchen, wäre es mal sinnvoll, würde sich Riot seinen Client-, oder im speziellen, Server-Problemen widmen, aber was will man machen. Heißt mal wieder abwarten {{summoner:3}}","replies":[{"poster":"Veezey","date":"2015-05-07T16:21:02.773+0000","up_votes":1,"down_votes":1,"body":"Dumm daher reden kann jeder. Mal daran gedacht, dass das Problem komplexer ist, als du es glaubst?","replies":[{"poster":"MrChinostyle","date":"2015-05-07T16:33:51.851+0000","up_votes":1,"down_votes":1,"body":"naja festzustellen ist das andere unternehmen nicht so häufig ausfälle haben...","replies":[{"poster":"PlanetenPlatzer","date":"2015-05-07T17:23:07.819+0000","up_votes":2,"down_votes":1,"body":"Bei anderen Unternehmen ist die Community nicht auch so schrecklich und heult wegen jedem Scheiß","replies":[]},{"poster":"Veezey","date":"2015-05-07T18:19:03.447+0000","up_votes":1,"down_votes":0,"body":"Andere Unternehmen haben auch nicht so eine riesige Spielerzahl.","replies":[]}]}]}]},{"poster":"Natures Spirit","date":"2015-05-11T17:35:25.421+0000","up_votes":1,"down_votes":0,"body":"Man sollte Allerdings auch ein bisschen daran denken dass das eher die Ausnahme ist und nicht die Regel.\nAlso nicht gleich Riot ausbuhen.\nRiot wird die Probleme sicherlich so schnell wie möglich beheben.","replies":[]},{"poster":"Rodîan","date":"2015-05-09T16:56:46.081+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HÔW2PentaKill,realm=EUW,application-id=YnZkMR0R,discussion-id=GrHGqEvb,comment-id=,timestamp=2015-05-07T13:12:34.616+0000)\n>\n> Hey,\n> \n> bin grad in nem Ranked einfach disconnected und jz kann ich nicht Reconnecten da kommt irgendwas mit Firewall problemen.... im ts 40er ping, riot?\n\nBei mir eben genau dasgleiche. Komme auch nicht mehr ins Spiel rein, zwar einloggen geht, aber eben nicht ins Spiel.\nSagt mir auch was von Firewall, kann aber nicht sein, da es vorher ja auch immer lief.","replies":[]},{"poster":"Cosmic Hope","date":"2015-05-08T12:30:00.982+0000","up_votes":1,"down_votes":0,"body":"Moin Moin, hab das gleiche Problem grad. 2 Verbindungsabbrüche. Ich versuche schon über 15 mal zurück ins Spiel zu kommen, da steht auch bei mir das Die Verbindung nicht hergestellt werden kann und ich die Firewall überprüfen sollte. Dies passiert bei mir zwar ab und zu, aber heute ist es extrem. Und jetzt kann ich mich auf einen saftigen Report freuen fürs Spiel verlassen + bekomme dann noch ne Strafe dafür. Im Enddefekt um ein Spiel beizutreten jeweils 5 mal 20 min. warten, toll oder.","replies":[{"poster":"TheDevilis","date":"2015-05-08T17:48:10.003+0000","up_votes":1,"down_votes":0,"body":"Hast du es wieder hinbekommen? würde mich mal interessiern denn ich kann seid 2 stunden nichr reconnecten aber auch kein anderes game machen rito pls mein freitag geht durch warten drauf?! dann zock ich{{champion:48}} lieber ps4","replies":[]}]},{"poster":"K33p Sm1l1ng","date":"2015-05-08T13:36:05.919+0000","up_votes":1,"down_votes":0,"body":"Selbes Problem und keine Information seitens Riot....... super...","replies":[]},{"poster":"SilloChillo","date":"2015-05-08T12:49:14.651+0000","up_votes":1,"down_votes":0,"body":"Hey habe genau das gleiche problem, gerade mit meinem Bruder am zocken gewesen und dann ist das SPIEL abgestürzt und wir kommen auch seid 10min nicht mehr ins game rein!!!!!!!!!\nkönnt ihr da mal etwas regeln danke!","replies":[]},{"poster":"saarbazi","date":"2015-05-08T11:22:44.343+0000","up_votes":1,"down_votes":0,"body":"Äußert sich Riot mal dazu? bin gestern auch raus geflogen, hab dann sogar den PC neugestartet. Nach dem Neustart konnte ich einfach ein anderes Game beginnen xD Das Ranked aus dem ich rausgeflogen bin erscheint aber auch nicht in der History xD","replies":[]},{"poster":"Ender Chest","date":"2015-05-08T10:08:43.607+0000","up_votes":1,"down_votes":0,"body":"Hab dasselbe Problem. Bis jetzt eine Stunde im Spiel, heisst es aus der Seite des Clients. Wahrscheinlich eingefroren.","replies":[]},{"poster":"Redman07","date":"2015-05-08T09:04:44.351+0000","up_votes":1,"down_votes":0,"body":"hatte jetzt erst ein spiel bei dem alle 10 dc hatten, nach 5-10min war ich wieder drin, sowie 7eifrige spieler, 2 haben wohl aufgegeben zu connecten, dann haben wir eben 5on3 beendet, sieg zählte!!\n\njetzt nach 8min im nächsten spiel das selbe, aber nach 1 minute, {{summoner:6}} game....nichtmal in der history garnichts.","replies":[]},{"poster":"Enriser 1","date":"2015-05-08T07:25:22.706+0000","up_votes":1,"down_votes":0,"body":"Langsam sollte doch mal was geschehen kann doch net sein das mann mittlerweile fast ne Woche kein spiel starten kann... warteschlange für ein game fängt an und schon Verbindung verloren. Komischer weise kann ich normal spielen wenn ich mal drin bin und ständigen dc´s wie hier beschrieben habe ich nur einen gehabt und später beim Team Kollegen und Kontrahenten.. gabs irgendwie mal ne rückmeldung von seiten´s Riot ?","replies":[]},{"poster":"wellis13","date":"2015-05-08T05:55:48.356+0000","up_votes":1,"down_votes":0,"body":"hhi","replies":[]},{"poster":"I3Iackout","date":"2015-05-07T23:01:55.305+0000","up_votes":1,"down_votes":0,"body":"Selbe bei mir. Im Ladeblidschirm gecrasht und dann kam ich nicht mehr rein. Nach mehrfachen Versuchen kann ich jetzt nicht mehr aufs Spiel reconnecten...","replies":[]},{"poster":"Captain Zaoizz","date":"2015-05-07T21:31:16.952+0000","up_votes":1,"down_votes":0,"body":"das haben wir auch bekommen nach dem Spielund das zählt nicht , desweiteren sind wir seit einer gefühlten ewigkeit im Spiel obwohl das schon ewig aus is\n\nTYPISCH RITO","replies":[]},{"poster":"xJaCkPrOTx","date":"2015-05-07T20:59:26.410+0000","up_votes":1,"down_votes":0,"body":"bei mir wars so: ganzes spiel normaler ping und ca ab min 40 fängts an zu laggen und plötzlich 500 ping und nix geht mehr. jeder reconnect versuch gescheitert und so nach 10 min kann ich mich wieder einloggen. spiel war zuende, ich schau in die matchhistory und das spiel existierte gar nicht. zum glück hab ich auch keine strafe wegen afk bekommen.","replies":[]},{"poster":"Mr Cha0s","date":"2015-05-07T20:49:07.918+0000","up_votes":1,"down_votes":0,"body":"Same here !!!!","replies":[]},{"poster":"Death Vision","date":"2015-05-07T20:05:24.272+0000","up_votes":1,"down_votes":0,"body":"{{champion:107}} Bin auch grad rausgehauen worden ist auch nicht das erstel al, dass das passiert... \nReconnecten geht auch nicht. Da komtm immer einer Fehlermeldung \"Keine Verbindung zum Server Bla Bla Bla\".\nFinde es langsam echt eine Schanden, dass jeden Monat so viele Skins etc rausgehauen werden, aber wegen der\nProbleme auf den Server nicht wirklich was unternommen wird.. Echt schade.","replies":[]},{"poster":"l Steven l","date":"2015-05-07T19:14:45.096+0000","up_votes":1,"down_votes":0,"body":"Hat bei mir geklappt wie es scheint :\n 1. Win + R\n2. \"services.msc\" eingeben\n3. \"IP-Hilfsdienst\" deaktivieren und beenden","replies":[]},{"poster":"Le CaptnBlaubaer","date":"2015-05-07T18:40:09.057+0000","up_votes":1,"down_votes":0,"body":"Ich hab jetzt schon seit 30 minuten nen dc bei nem spiel das schon bei 40 minuten war, ich kann nicht reconnecten und nicht verbinden. so und jetzt sitze ich hier im niemandsland fest {{item:3070}} \nden client neu starten bringt auch rein garnichts","replies":[]},{"poster":"xShreddeX","date":"2015-05-07T18:25:55.279+0000","up_votes":1,"down_votes":0,"body":"Hey Leute , an alle die das Problem mit dem dauerhaften reconnecten haben : CCleaner Regestry nach fehlern suchen und beheben.\n\nViel Spaß beim weiter zocken.","replies":[]},{"poster":"Legender888","date":"2015-05-07T18:11:49.204+0000","up_votes":1,"down_votes":0,"body":"Habe das gleiche Problem... Was Ist Da Looos??!   {{champion:412}}","replies":[]},{"poster":"Ugandi","date":"2015-05-07T16:43:57.084+0000","up_votes":1,"down_votes":0,"body":"Ich und mein Freund haben es auch. Wsl. wird das game abgebrochen wenn alle 10Leute dcn","replies":[]},{"poster":"Legènd","date":"2015-05-07T16:43:13.834+0000","up_votes":1,"down_votes":0,"body":"hab das Problem auch mitten im ranked bekommen... bin im ts, bekomme aber nen dc in lol und kann nicht reconnecten.. glückwunsch.... hoffentlich kommt bald ein neuer champ in lol, damit das spiel wieder neu ist... -.-","replies":[]},{"poster":"Noctis san","date":"2015-05-07T16:21:18.199+0000","up_votes":1,"down_votes":0,"body":"hab auch das probleme :v ist aber schon seit einigen tagen so..letztens beim aram spielen haben alle währenddem ladebildschirm DC bekommen und als man reconnectet hat hatte man keinen champs konnte nichts kaufen nix :D . Das war aber halb so schlimm da man mit einem relog den Fehler \"behoben\" hat und normal weiterspielen konnte.","replies":[]},{"poster":"Wahooka","date":"2015-05-07T15:17:27.479+0000","up_votes":1,"down_votes":0,"body":"hab das selber problem auch.\n\nHIGH Ping. Disconnect server. stimmt was mit dem server nicht?","replies":[]},{"poster":"Krabax","date":"2015-05-07T15:03:17.415+0000","up_votes":1,"down_votes":0,"body":"Wir hatten gerade das Selbe in einem Normal, plötzlich ein 9-Mann Diconnect mitten im Spiel... nach ca. 10 Minuten konnten wieder alle rein. Wird wahrscheinlich mit den neuen Championmeisterschaften zusammenhängen...","replies":[]},{"poster":"This is Destıny","date":"2015-05-07T14:13:58.472+0000","up_votes":1,"down_votes":0,"body":"es liegt nicht and der firewall das wirdn ur gesagt weil man keine verbindung zum akutellen spiel server aufgebaut werden kann ci hahbe dgerade das gleiche probleme aber keine sorge leute xD eure teammates haben auch alle dc","replies":[]},{"poster":"MrChinostyle","date":"2015-05-07T14:12:20.716+0000","up_votes":1,"down_votes":0,"body":"hab das gleiche ~ warten alle 5-6 minuten reconnecten und in den 2 minuten mid pushen und hoffen das game so zu gewinnen xD","replies":[]},{"poster":"Quetzalcoatlx","date":"2015-05-07T14:05:36.671+0000","up_votes":1,"down_votes":0,"body":"Ebenfalls das selbe Problem, aber reconnect klappt auch nicht mit ausgeschalteter/modifizierter Firewall. {{summoner:3}}","replies":[]},{"poster":"DSyRgelberharibo","date":"2015-05-07T17:40:33.189+0000","up_votes":1,"down_votes":1,"body":"Hoffentlich gibt es dafür einen Skin kostenlos :D Ich wtte das es nicht dazu kommen wird aber naja hoffen tu ich es trotzdem xD{{summoner:13}}","replies":[]}]}