{"poster":"Elessarz","date":"2018-07-22T15:54:07.181+0000","title":"tickets de clash","subforum":"Problemas Técnicos","up_votes":8,"down_votes":0,"body":"Estimados(as):\r\nque ocurre con clash y los tickets de clash finalmente? hubo en su minuto un reembolso, pero independiente de ello, mucha gente sigui&oacute; comprando tickets de clash (dentro de los cuales me incluyo). me dedique a comprar pr&aacute;cticamente cada vez que pod&iacute;a, pensando en que clash volver&iacute;a alg&uacute;n d&iacute;a, pues sino, pens&eacute;, habr&iacute;an desactivado la compra de los ticket. por lo mismo, segu&iacute; comprando, y ahora al ver que los sacaron de la tienda, not&eacute; que parece que no volver&aacute;. significa eso que perd&iacute; toda la esencia que use para comprar los ticket? asimismo, puse un post sobre el uso de la cpu y estado del cliente, que nadie del foro o equipo de riot siquiera contest&oacute;. Agradecer&iacute;a tener algo mas de di&aacute;logo con la gente del foro, pues ambas son preocupaciones reales para un usuario habitual del juego\r\nsaludos!","replies":[{"poster":"Hnk Kenshiro","date":"2018-07-22T17:05:55.033+0000","up_votes":2,"down_votes":0,"body":"Volvera, pero no se sabe cuando, cuando ocurra los tendras de nuevo, seguramente.","replies":[{"poster":"Elessarz","date":"2018-07-22T18:15:06.319+0000","up_votes":1,"down_votes":0,"body":"agradezco el comentario, pero no se en que aporta a resolver mi pregunta. es precisamente ese \"seguramente\" lo que quiero descartar. Además, si es así, por qué ya no se pueden seguir comprando?\nsaludos!","replies":[{"poster":"Tarta35","date":"2018-07-22T21:22:03.696+0000","up_votes":1,"down_votes":0,"body":"Por que como va a tardar en volver mejor las sacan en ves de q las compren al pepe\nSi antes las dejaron pero es mejor sacarlas","replies":[]}]}]},{"poster":"Bloshan","date":"2018-07-22T22:10:18.611+0000","up_votes":1,"down_votes":0,"body":"Clash va a volver. No se sabe cuando si dentro de un año, o a fin de año. Pero que va a volver va a volver. No te hagas problema por lo de los tickets igual yo que vos los anoto en un papel o algo y cuando salga clash fijate que tenes todos los tickets que comprastes y si no los tenes cuando esta clash habilitado ahi vas a soporte y el comentas todo. Saludos {{sticker:slayer-jinx-catface}}  PD: Igual me parecio mal eso de riot que dejaran comprar a la gente tickets cuando a clash le habian cancelado la salida. PD2: Si te quedo alguna duda comunicate con el soporte. Ahora si saludos xD","replies":[]},{"poster":"N1MBUH","date":"2018-07-22T20:31:30.345+0000","up_votes":1,"down_votes":0,"body":"Riot dijo que tienen planeado que vuelva a fin de año es decir a largo plazo ya que tienen que corregir errores y mejorarlo. Si tenés dudas podés consultar en noticias, tags, Clash.\nSaludos.\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}