{"poster":"BludelLOL2","date":"2016-10-08T13:07:54.389+0000","title":"Köszi again :)","subforum":"Minden egyéb","up_votes":1,"down_votes":10,"body":"Sr&aacute;cok, elkezdtem egy meccset a haverommal, mind a kettőnknek nem engedett bannolni, majd kifagyott a lol.... 30 percest kaptam a semmire. Meg a haverom is, meg &uacute;gy mindenki, basszus naponta sokmilli&oacute; j&aacute;t&eacute;kos &eacute;s p&eacute;nz, &eacute;s nem tudnak egy rendes szervert csin&aacute;lni....","replies":[{"poster":"Kecses","date":"2016-10-08T13:10:14.609+0000","up_votes":2,"down_votes":0,"body":"Honnan tudod, hogy a szerverrel volt a baj? ;)\n\n\"mind a kettőnknek nem engedett bannolni, \". Ha már az egyikőtök nem tilt, akkor automatikusan kidob, tehát a partnerednek már esélye sincs tiltani már. Kicsit sántít a történet.","replies":[{"poster":"BludelLOL2","date":"2016-10-08T13:13:25.440+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Kecses","date":"2016-10-08T13:20:44.804+0000","up_votes":1,"down_votes":0,"body":"Szóval, mint magyar ember, aki Magyarországon lakik, nincsen jogom a magyar fórumba írnom csak azért, mert EUW-en játszok, mert itt vannak a barátaim? Ha szerver hiba van olyankor a Riot, kiírja és nem kapsz büntetést. Ez már sokszor előfordult. Sőt olyanok is voltak, hogy vesztes meccseket eltöröltek a szerverhiba végett. \n\nMost mindenkit kidobott, csak a haverodat nem? Haverod sem tudott bannolni? Már te sem tudod mit beszélsz. \n\nNem lehet, hogy az ISP-del volt gond? Lehetséges, hogy az adott útvonal nem volt megfelelő. Előfordul az ilyen.\n\nDe amúgy a megoldás egyszerű. Írj a játékostámogatásra, a technikai problémáddal, ők segítenek abban, hogy többé ne forduljon elő, illetve ha szerverhiba volt akkor ők azt elfogják neked mondani. :)","replies":[{"poster":"HiperKarma","date":"2016-10-08T17:22:19.239+0000","up_votes":1,"down_votes":0,"body":"Nálunk is volt egy ilyesmi meccs. Lement az előválasztás, hogy ki mivel akar majd jönni... számolt vissza 0-ig, de ott megállt, és nem lépett át a bannolási fázisba. Vártunk 1 percet, majd kiírta, hogy szerverhiba miatt a csapatod feloszlott.\nÚgyhogy nem egyedi volt az eset. \n\nÖröm az ürömben, hogy mi legalább nem kaptunk büntit! :)","replies":[{"poster":"Kecses","date":"2016-10-08T17:41:00.464+0000","up_votes":1,"down_votes":0,"body":"Ha szerverhiba van sose kapsz büntit, azt a Riot mindig elismeri. :) Sokszor az a gond ami régen is volt, hogy ugyebár vannak útválasztók, tehát a szolgatónál van a gond, és nem feltétlen kell, hogy mindenkinek gondja legyen aki annál a szolgáltatónál van. Ez egyszerűen hálózati probléma. Ezt meg a Riot nem tudja szűrni, ha meg lenne ilyen módszer, hogy az ilyen hibákért nem kapsz büntit, akkor lenne bőven visszaélés ebből.","replies":[]}]}]}]}]},{"poster":"Lord Babkonzerv","date":"2016-10-08T15:58:24.104+0000","up_votes":1,"down_votes":0,"body":"Szívesen : )","replies":[]},{"poster":"derX","date":"2016-10-08T13:08:45.166+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"BludelLOL2","date":"2016-10-08T13:10:28.646+0000","up_votes":1,"down_votes":0,"body":"Tegnap léptem ki utoljára véletlenül :)","replies":[]}]}]}