{"poster":"Arzenon","date":"2015-08-13T22:17:31.293+0000","title":"Wen würdet ihr nehmen ?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"{{champion:35}} als Jungler\r\n{{champion:432}}  supp\r\n{{champion:245}} \r\n{{champion:113}}","replies":[{"poster":"Maexle","date":"2015-08-13T23:17:59.825+0000","up_votes":4,"down_votes":0,"body":"Also ich würde {{champion:245}} nehmen, da er relativ variable einsetzbar ist ( Mid, Jungle, Top) und dabei sehr viel Schaden und ein Stück weit Utility bzw. eher CC mitbringt. Er liegt meinem Spielstil am nächsten, aber ich kann deinen Spielstil natürlich nicht einschätzen, deswegen musst du das wissen ^^\nIm Zweifel kannst du ja {{champion:17}} nehmen, der auf jeder Position spielbar ist, wenn du weißt, was du mit ihm machen musst {{champion:17}}","replies":[{"poster":"Th3is","date":"2015-08-14T02:30:26.469+0000","up_votes":3,"down_votes":0,"body":"NEIN! Nicht Satan!","replies":[]}]},{"poster":"oasterlukas","date":"2015-08-14T10:01:09.131+0000","up_votes":2,"down_votes":0,"body":"Ich gib mal mein Kommentar zu Brand, da er der einzige ist von den genannten die ich oft spiele. \n\nAlle Champions die du auflistest sind dafür geeignet (gemacht) sich im Jungle aufzuhalten. Ekko ist zwar ein guter Sololaner aber auch im Jungle stark. {{champion:113}} und {{champion:35}}  sind hervorragende Jungler und {{champion:432}}  ist aufgrund seiner passiven oft im Jungle unterwegs. Ich selber spiele Bard sehr oft und finde ihn toll. Aber er ist einfach nicht gut geeignet für unerfahrene Mitspieler, die mit Bard nicht häufig etwas zu tun haben. Bard muss mobil sein und mal die Botlane verlassen, das kann viele ADC-spieler zur Verzweiflung bringen. Desweiteren muss man sehr auf das positionieren seiner W achten und rennt mal einer ausversehen rein obwohl er den Heal nicht braucht, tja Shit happens. Aber seine E gibt dir deinem Team noch mal nen Patzen Mobilität, das kann sehr hilfreich sein, wenn euch diese Mobilität fehlt. Es ist auch immer ein hilfreicher Escape. Kurz zusammengefasst. Mit Bard erlebst du das Supporten komplett neu!\n\nDaher ich nehme {{champion:432}} ","replies":[]},{"poster":"Ashuna","date":"2015-08-14T06:48:32.169+0000","up_votes":2,"down_votes":0,"body":"{{champion:432}} {{champion:12}} {{champion:40}} {{champion:89}} {{champion:25}} {{champion:16}} {{champion:267}}  Als Supps\n{{champion:51}} {{champion:104}} {{champion:18}} {{champion:222}} {{champion:429}}  Als ADC's\n{{champion:1}} {{champion:103}} {{champion:115}}  Als Midlaner\n{{champion:106}} {{champion:72}} {{champion:76}} {{champion:56}} {{champion:60}}  Als Jungler\n{{champion:39}} {{champion:57}} {{champion:8}}  Als Top","replies":[]},{"poster":"dugg","date":"2015-08-14T06:22:51.529+0000","up_votes":2,"down_votes":0,"body":"Ist halt immer die Frage wo du hin möchtest. Bist du ein Jungler oder Midlaner? Wechselst du ständig deine Position?\n\n{{champion:35}} <- Ein schwerer Jungler und auch schwer effektiv einzusetzen. Er bedarf viel Übung und ist anders als alle anderen Champions\n{{champion:432}} <- Ist ein sehr unterschätzter Support, bedarf auch viel Übungen um ihn gut einzusetzen. Habe mir ihn gleich nach dem Releas geholt, weil ich überzeugt war, dass er eine ganz neue Ära von Supports einleitet. Was soll ich sagen? Es war mein größter Fehlkauf. Ich hätte vorher ein paar Mal mit ihm spielen sollen. ;) Nicht weil er schlecht ist, sondern weil mir seine Mechaniken nicht liegen.\n{{champion:245}} <- Sehr universell einsetzbarer Champion. Bedarf auch wieder etwas mehr Übung. Solltest du einen AP Nahkampf Champions benötigen, der auf vielen Lanes gespielt werden kann, nimm ihn.\n{{champion:113}} <- Wäre für mich persönlich die erste Wahl. Seju ist eine geniale Junglerin, die viel Tankyness und CC mitbringt. Sie wird in Ranks zwar oft gebannt, sollte allerdings in jedem Championpool vorhanden sein.\n\nSo... das ist meine persönliche Meinung. Diese kann komplett von deiner abweichen. Du musst wissen, welche Mechaniken du dir von einem Champion wünscht, auf welche Lane du gehst und ob der Champ eine Lücke in deinem Pool füllen kann.\n\nIch würde dir vorschlagen, dass du mal abwartest, bis diese Champions in der Rota sind und du testest sie einfach mal.","replies":[]},{"poster":"Arzenon","date":"2015-08-14T15:25:14.204+0000","up_votes":1,"down_votes":0,"body":"Ok ich habe mir nun überlegt das ich entweder {{champion:245}}  als Mid laner und Jungler hole oder {{champion:113}} und noch einen anderen Champ.","replies":[]},{"poster":"OrangeBubble","date":"2015-08-14T09:33:31.588+0000","up_votes":1,"down_votes":0,"body":"{{champion:48}} - wird immer der Trollking sein.","replies":[]},{"poster":"Arzenon","date":"2015-08-14T09:09:09.599+0000","up_votes":1,"down_votes":1,"body":"Also inmoment Maine ich {{champion:80}} ,{{champion:22}} und {{champion:201}}, da ich für jede Lane ca 2-3 Champs haben will bräuchte ich noch ideen für Supp, Jungle und Mid. Ich weiß momentan nicht mal was die Meta ist o.0","replies":[]},{"poster":"Xyre","date":"2015-08-13T22:21:51.006+0000","up_votes":1,"down_votes":4,"body":"Also wenn du weißt wie man ihn spielt ist Shaco ein sehr starker Jungler mit Snowball-Potenzial (Was vielen Solo-Q Spielern am wichtigsten ist). Allerdings hat er einen recht schwierigen Spielstil und mit hoher wahrscheinlich kannst auch du ihn nicht auf einem hohen Niveau spielen (soll nicht böse gemeint sein). Wenn du Shaco lernen willst empfehle ich dir **Shaclone** auf Twitch zu verfolgen. Nach verschiedenen Seiten ist er einer der besten Shaco Spieler.\nHier sein Twitch Kanal: http://www.twitch.tv/shaclone\n\n-Carpe Diem\nMfG BackFIips","replies":[]}]}