{"poster":"Chimre1","date":"2019-01-17T23:02:54.731+0000","title":"Mein Problem mit Cassio...","subforum":"Allgemeiner Chat","up_votes":5,"down_votes":2,"body":"Guten Abend Menschen!\r\n\r\nIch habe in letzter Zeit - wenn auch durch aramischen Zufall - mehrmals {{champion:69}} gespielt und da kam mir doch ein Gedanke:\r\n\r\n_Irgendwie ist das Kit von {{champion:69}} sehr... schwammig bzw. bildet es f&uuml;r mich kein gro&szlig;es Ganzes; etwas, dass von vorne bis hinten an manchen Ecken nicht richtig durchdacht ist._\r\n\r\nIch versuche, zu erkl&auml;ren:\r\n\r\n{{champion:69}} ist ein recht schwieriger Champion und ich behaupte nicht, ich sei gut mit ihr, jedoch habe ich in meinen League-Jahren ein bisschen Erfahrung gesammelt. Das tut jedoch eigentlich nichts zur Sache, denn mir geht es hier nicht darum, wie ich als {{champion:69}} oder gegen sie spiele. Nein. Es geht mir darum, wie das Spielgef&uuml;hl ist, {{champion:69}} zu spielen.\r\n\r\nWisst ihr: Riot hat {{champion:69}} hier und da immer mal ein bisschen angepasst. Und ich glaube, dass Riot ihr diesen Movement-Tag verpasst und dabei andere wichtige Sachen vergessen hat. Was ich mit dem Movement-Tag meine:\r\n\r\n* Sie darf keine Schuhe kaufen, bekommt daf&uuml;r durch ihre Passive MS.\r\n* Trifft sie jemanden mit ihrem &quot;Q&quot;, erh&auml;lt sie MS\r\n* Mit ihrer &quot;W&quot; verlangsamt und &quot;grounded&quot; sie ihre Gegner, was ihr erm&ouml;glicht, schneller am Gegner zu sein, wenn sie ihn mit ihren &quot;E&quot;s bombardiert und kitet.\r\n\r\nAlso... ich erkenne Riots Plan: Ihre Haupt-Schadens-Quelle ist ihre &quot;E&quot;. Um diese effizient zu benutzen, muss sie am Gegner dranbleiben. Sie soll also wie ein Adc kiten. Und das funktioniert doch gut mit all&#039; der MS, die {{champion:69}} bekommt... _Aber f&uuml;hlt sich das auch gut an?_\r\n\r\n**Hier kommen wir nun auch zum Knackpunkt:**\r\n\r\n_Wof&uuml;r all&#039; diese Movement Speed, wenn sie f&uuml;r jeden einzelnen Spell stehenbleiben muss?!_\r\n\r\nDas ist es, was mir Probleme bereitet. Ein regelrechter Anti-Spa&szlig;-Faktor. Und das finde ich schade: Denn vom Konzept her macht {{champion:69}} eigentlich Spa&szlig;. Doch diese Kleinigkeit, dieses Spielgef&uuml;hl, macht es leider _f&uuml;r mich_  kaputt. Es wirkt nicht so fl&uuml;ssig, wie bei {{champion:8}} oder {{champion:134}}. \r\n\r\nMich w&uuml;rde es interessieren, wie andere Spieler - bitte auch {{champion:69}} Mains - das sehen. Mir ist ganz egal, wie gut ihr mit ihr zurechtkommt. Mich w&uuml;rde das Spielgef&uuml;hl, welches ihr erlebt, wenn ihr {{champion:69}} spielt, interessieren. \r\n\r\nGr&uuml;&szlig;e\r\n\r\nChimre1","replies":[{"poster":"Humpelstilzche","date":"2019-01-18T08:42:54.789+0000","up_votes":3,"down_votes":0,"body":"> Das ist es, was mir Probleme bereitet. \n\nUnd auch das, was Cassio halbwegs balanced bleiben lässt. Diese kleine Cast-Zeiten zu entfernen wäre ein MASSIVER buff, den Cassio imo nicht nötig hat.","replies":[]},{"poster":"Nordwolf87","date":"2019-01-18T07:23:48.032+0000","up_votes":3,"down_votes":0,"body":"Naja soweit ich weiß ist es allgemeiner Standard, dass man für einen Moment stehenbleiben muss. Egal ob für ne AA oder eine Fähigkeit. Es gibt einzelne Ausnahmen wie Vladimirs E und W.\n\nUnd gerade bei Cassio macht das ganze finde ich Sinn. Der MS ergänzt sich gut mit dem Stehenbleiben für die E. Ja sie muss stehenbleiben, holt aber aufgrund der MS wieder auf. Ich glaube, dass sie zu stark wäre müsste sie für ihre E nicht stehenbleiben bzw wenn sie nicht mehr stehenbleiben muss, müsste man im Gegenzug den MS boost von ihrer Q entfernen denke ich.","replies":[]},{"poster":"AI Marko","date":"2019-01-17T23:06:59.322+0000","up_votes":3,"down_votes":0,"body":"stehen bleiben?\n\nnach jeden spell bewege ich mich\nob nach vorne oder nach hinten\nund die ms die ich bekomme hilf da sehr","replies":[{"poster":"Chimre1","date":"2019-01-17T23:33:59.768+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nerf Inori Pls,realm=EUW,application-id=YnZkMR0R,discussion-id=ZJ9yTUeE,comment-id=0000,timestamp=2019-01-17T23:06:59.322+0000)\n>\n> stehen bleiben?\n> \n> nach jeden spell bewege ich mich\n> ob nach vorne oder nach hinten\n> und die ms die ich bekomme hilf da sehr\n\nJa richtig! **Nach** jedem Spell bewegen ergibt ja Sinn! Aber für die Cast-Animation muss {{champion:69}} stehen bleiben. Das ist nicht so wie bei  {{champion:134}} , bei der man viele ihrer Spell **während des Bewegens** casten kann.","replies":[{"poster":"AI Marko","date":"2019-01-18T01:52:22.971+0000","up_votes":2,"down_votes":0,"body":"{{champion:103}} {{champion:1}} {{champion:268}} {{champion:63}} {{champion:69}} {{champion:42}} etc.\nkönnen sich auch nicht bewegen wenn sie einen spell casten\nglaub sogar die wenigsten können sich bewegen wenn sie etwas casten \n\n\nso Höcher der Cast timer so länger \"cc\" man sich\n\nda Cassio aber sehr kurze Cast timer hat ist es bei ihr sehr irrelevant","replies":[{"poster":"Metalmonni","date":"2019-01-18T07:26:20.059+0000","up_votes":2,"down_votes":0,"body":"Bei den von dir angegebenen Champions gehört das Bewegen, bzw das Kiten, bzw das konstante Bewegen aber auch nicht unbedingt elementar zum Championdesign. Naja, außer bei Ahri vielleicht, aber auch da ist der Fall ein wenig anders gelagert. \n\nEs geht hier ja offenbar auch nicht darum, dass Cassio irgendwie schlecht wäre, sondern nur darum, dass ihr Spielgefühl einfach irgendwie *unsauber* wirkt. Da ihr Kit viel auf Bewegung und Spam aufbaut fühlt es sich einfach nicht *flüssig* an, wenn man sich für jedes \"E\" zwangsläufig selbst rooten muss. \n\nIch vermute, wenn Riot hier mal ein bisschen tweaken will wäre das ein netter Ansatzpunkt... Ggf den Schaden ein wenig runter, dafür das \"E\" aus der Bewegung heraus ermöglichen. Würde dem Spielgefühl vermutlich entgegen kommen. \n\nEs gibt ja durchaus Beispiele für Champs, die das können. Vielleicht wäre {{champion:28}} kein schlechtes Beispiel. Ich weiß, dass sie auch ein Assassin ist, aber auch sie baut mit dem Q und ihren MS Buffs ein wenig auf dem Kiting Gedanken auf... Wenn sie für jedes Q stehen bleiben müsste, würde sich das einfach clunky anfühlen.","replies":[{"poster":"eingew","date":"2019-01-18T08:36:49.713+0000","up_votes":1,"down_votes":0,"body":"Das hat aber letztlich auch einiges mit dem Balancing zu tun, oder? Ich schätze Riot müsste an den Schadenszahlen schrauben, wenn Cassio plötzlich beim Casten einfach weiter laufen könnte.\nZumal man ja für AAs auch stehen bleibt.","replies":[{"poster":"Metalmonni","date":"2019-01-18T09:16:07.590+0000","up_votes":2,"down_votes":0,"body":"Absolut :).\n\nIch habe in dem Kommentar, auf den ich geantwortet habe, einfach nur den TE falsch verstanden gesehen und wollte das, was der TE (in meinen Augen) gemeint hat etwas besser herausstellen. \n\nKlar wäre das ein absoluter Buff für Cassio, vermutlich sollte man erst mal das zusätzliche Lauftempo auf der Q entfernen... Und ggf etwas am Schaden drehen (Bin ja kein Balancing Spezialist). Auf der Haben - Seite stünde unbestreitbar ein besseres Spielgefühl, die ganze Kiting - Mechanik wäre einfach smooth. \n\nAber du hast Recht, für AA's bleibt man auch stehen und für die Skills der meisten Champions ebenfalls. Bei vielen ist das auch kein Ding, aber manche würden denke ich auch zusätzlich von einem Casten aus der Bewegung heraus profitieren, da ihr Kit ohnehin stark auf Bewegung ausgelegt ist. \n\nIch denke da zum Beispiel an {{champion:120}}; Bei ihm ist das Ganze wunderbar gelöst. Bewegungschampion - Kann **alles** was er hat casten ohne stehen bleiben zu müssen.\n\nGegenbeispiel {{champion:76}}; Will sich in ihrer Katzenform eigentlich auch viel bewegen, bleibt aber alle Nase lang stehen wenn sie jemanden kratzen will. \n\nHecarim zu spielen ist angenehm, das hat einfach einen gewissen Fluss. Kätzchen spielen fühlt sich dagegen unsauber an. (Sind jetzt spontane Beispiele, also bitte nicht hauen)\n\nEs geht ja auch nicht darum, ob ich persönlich das gut oder schlecht finde, so sind die Champs halt gebaut und gebalanced ^^. Ich denke nur wir könnten uns einig werden, dass es hier eine Möglichkeit gibt, bei *manchen* Champions das Spielgefühl zu verbessern ^^","replies":[{"poster":"AI Marko","date":"2019-01-18T10:39:43.696+0000","up_votes":1,"down_votes":0,"body":"für jeden cast bleibt die {{champion:76}}  stehen aber für jeden autoattack bleib {{champion:120}} stehen","replies":[{"poster":"Metalmonni","date":"2019-01-18T10:42:19.714+0000","up_votes":2,"down_votes":0,"body":"Wir reden ja hier von Fähigkeiten, nicht von Autohits ^^. \n\nAber ich sehe deinen Punkt, Hecarim ist für seinen maximalen Schaden auf seine Autohits zwingend angewiesen, was seinen Spielfluss wieder hemmt. \n\nAber ich bleibe bei meiner Aussage, Hecarim fühlt sich *flüssiger* an ^^","replies":[]}]}]}]},{"poster":"AI Marko","date":"2019-01-18T10:36:13.989+0000","up_votes":1,"down_votes":0,"body":"ja gut,\n\nman muss aber halt auch berücksichtigen das Cassio eine andere art von champion ist\n( q treffen + e spam + kiten)[als APer kiten ist halt \"neu\" wenn man es nicht kennt]\n\nich persönlich finde ihr spiel gefühl sehr angenehm \n\naber ich kann verstehen was der TE meint als ich Cassio zum ersten mal gespielt habe dachte ich mir auch \n\"huu was den das\"\n\nps eve ist glaub ein nicht so guter beispielt da sie ein Assassine ist und die in der regel schnell sein sollten ","replies":[{"poster":"Metalmonni","date":"2019-01-18T10:39:18.608+0000","up_votes":1,"down_votes":0,"body":"Jop, denke das trifft es ganz gut... \n\nViel persönlicher Geschmack und Gewöhnung, mehr Gefühl und weniger ein Problem mit den \"nackten Zahlen\" ;).\n\nIch wünsche ein schönes Wochenende, ich hab gleich Feierabend!!!","replies":[{"poster":"AI Marko","date":"2019-01-18T10:43:31.085+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}} \njo dir auch ein schönes Wochenende","replies":[]}]}]}]}]},{"poster":"killer of death","date":"2019-01-17T23:52:58.239+0000","up_votes":2,"down_votes":0,"body":"Stimmt, ich würde es auch besser finden, aber man müsste es mal testen, denn ansonsten wäre sie zu op.\nIch finde man focust eh immer den Gegner und haut auf die e Taste, also kommt der Intervall von dem Cooldown, den das e hat.\nSo sehr ist es mir noch nicht aufgefallen, aber wenn ich recht habe ist das der Grund.\n\nIch hoffe ich konnte dir weiterhelfen\n\nGl & hf\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]},{"poster":"Qbert","date":"2019-01-18T07:32:19.393+0000","up_votes":2,"down_votes":0,"body":"Es gibt eigentlich eher wenige Fähigkeiten, die die Bewegung vom Champion **nicht** unterbrechen ... also verstehe ich dein Problem nur bedingt.\nDas Move+Cast-Verhalten macht einen großen Anteil deines Skills aus ...wenn du damit nicht zurecht kommst, weißt du ja jetzt, wo du dich verbessern musst.\n\nUnd sei doch froh, dass sie bei einem Q-Hit noch MS bekommt ... das bekommen die anderen Champions nämlich nicht.","replies":[]},{"poster":"ΔRC RΔFUNZΞL","date":"2019-01-18T14:40:12.064+0000","up_votes":1,"down_votes":0,"body":"stell dir mal vor ein ADC muss sich nichtmehr rumdrehen zum autoattacken und kann wie syndra einfach weiter laufen","replies":[]}]}