{"poster":"CKC Zekken","date":"2016-04-18T11:58:59.127+0000","title":"Wo sind die Rengar Mains ;)","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Ich hab mich die letzten Tage mal bisschen im Jungle versucht (als Main Mid, macht zwar keinen Sinn, aber egal) und hab angefangen Rengar zu spielen. Da ich vorher so gut wie keinen anderen Champ als Shaco und auch Lee im Jungle gespielt hab bin ich noch ziemlich bad mit Rengar und suche jemanden der mir vlt. bischen was beibringen kann zum Chaamp selbst und auch zum junglen allgemein :)\r\n\r\nEinfach adden oder kommentieren.","replies":[{"poster":"Sikn3ss","date":"2016-04-18T12:12:33.782+0000","up_votes":1,"down_votes":0,"body":"Hellou Rengar und Jungle Main anwesend {{champion:107}}.\n\nWas willst du den gerne wissen?  Kann dir einige Fragen hier beantworten und wenn du magst mal ein paar Dinge in einem Custom zeigen mit TS.","replies":[{"poster":"CKC Zekken","date":"2016-04-18T12:16:05.265+0000","up_votes":1,"down_votes":0,"body":"Perfekt :) Hab Probleme mit ziemlich banalen Dingen im Jungle z.B. wann wo sein und wann wo ganken usw.\nUnd mit Rengar bin ich einfach nur bad weil ich noch nie wirklich den Champ gespielt hab :D Weiß du, dass man seine 5 Stacks sammelt und dann jemanden mit Ult killt :D","replies":[{"poster":"Sikn3ss","date":"2016-04-18T12:31:56.326+0000","up_votes":1,"down_votes":0,"body":"Da der Jungle an sich eine sehr grosse Rolle ist und auch komplexer ist als man denkt, schreibe ich hier mal keinen Roman xD Kann dir aber wie gesagt mal per TS ein wenig was erzählen wie du dich auf ganks vorbereiten kannst und worauf du achten solltest. \n\nIch nehme mal an du möchtest wie jeder den One-Shot Rengar spielen. Alles was du brauchst sind 2 Items und die ADC werden weinen. Hast du mal dein Jungle Item ausgebaut also Warriors und dein Ghostblade steht dir eigentlich nichts im weg.\n5 Stacks in die ulti. Nun kannst du bereits deine verstärke Q aktivieren da diese ein paar Sekunden bleibt. Weiter geht es mit der Bola, die musst du gleich beim Absprung werfen, sonst könntest du sie über den Gegner werfen da sie mittlerweile eine Castzeit hat. Deine W Fähigkeit aktivierst du auch noch während du in der Luft bist. Nach weiteren 1,2 Autoattacks sollte der adc auch schon tot sein =)\n\nWenn du allerdings mit Rengar eine Lane ganken möchtest, empfiehlt es sich deine 5 Stacks für den Root also deine verstärkte E zu benutzen, da du so den Kill eher rausholst als wenn du mit der Q eröffnest. Da du nach der Ulti auch wieder 5 stacks generierst, ist es sogar möglich den Gegner 2 mal zu rooten und so holst du den Kill garantiert beim Ganken. Wenn dein Laner auch noch CC hat ist gg.\n\nHat dein Gegner Team z.B. ne Kalista als ADC oder sonst ein Champion der gut kiten kann empfehel ich dir auf diese IMMER den root zu nehmen ausser du bist so hart ahead dass du zuversichtlich bist diese ohne root zu killen :)\n\nGuter One-Shot-Build währe: {{item:1412}} {{item:3158}}  {{item:3142}} {{item:3046}} {{item:3087}} {{item:3031}} später kannst du deine Schuhe für {{item:3078}} verkaufen. So kommst du auf 100% Krit hast enorm viel Schaden bist aber extrem squishy.\n\nEine weitere Option währe statt {{item:3046}}  {{item:3074}}  zu wählen, mag ich persönlich aber nicht und erschwert die Oneshot-Kombo, da du die Aktive dann auch noch in der Luft casten müsstest.","replies":[{"poster":"Reggae Rengar","date":"2016-05-12T12:50:37.969+0000","up_votes":1,"down_votes":0,"body":"Jgl item verkaufen oder garnicht erst ausbauen, hydra must have!","replies":[]},{"poster":"CKC Zekken","date":"2016-04-18T12:36:58.040+0000","up_votes":1,"down_votes":0,"body":"Okay dass mit in der Luft casten, müsste man dann mal üben xD Früher war das ja noch einfacher wo Rengar E noch kein Skillshot war :P","replies":[{"poster":"Sikn3ss","date":"2016-04-18T12:43:33.961+0000","up_votes":1,"down_votes":0,"body":"Seit seinem \"nerf\" hat die E eine Cast zeit aber in einem Custom kannst du das eigentlich easy auf der Top- oder Botlane an Minions üben. Einfach im Gebüsch sitzen und raushüpfen. Nach ein paar Mal solltest du das schon hinkriegen ;)\n\nUnd noch was.. verliere bitte nicht gegen {{champion:121}}  :O er ist ein stinkender Käfer.","replies":[{"poster":"Shadow l Eagle","date":"2016-04-18T13:33:52.132+0000","up_votes":1,"down_votes":0,"body":"Lüge, er darf ruhig gegen Kha verlieren :p Rengar stinkt eindeutig mehr !","replies":[{"poster":"Sikn3ss","date":"2016-04-18T13:52:41.921+0000","up_votes":1,"down_votes":0,"body":":O Du, du du.. du wagst es?! Naja auch wenn man sagen kann das es im late einfach nur darauf ankommt wer den anderen zuerst findet xD","replies":[{"poster":"Shadow l Eagle","date":"2016-04-18T18:43:06.137+0000","up_votes":1,"down_votes":0,"body":"Nichts ist KHA gewinnt egal wo und wann !! schluusss aus ENDE KHA HAT GESPROCHEN !! ;D","replies":[]}]}]},{"poster":"CKC Zekken","date":"2016-04-18T12:45:30.277+0000","up_votes":1,"down_votes":0,"body":"Den Rest kann man ja auf TS klären, würde noch gerne wissen wen man hier im Early fighten kann und wen nicht :D","replies":[{"poster":"Sikn3ss","date":"2016-04-18T12:55:55.852+0000","up_votes":1,"down_votes":0,"body":"Ein gutes Beispiel für einen schwachen early Jungler wäre Wukong. Da er relativ low dropt am Anfang könntest du ihn invaden.\nAufpassen solltest du z.B. vor {{champion:60}}, trefft ihr euch im jungle auf lvl 3 z.B. und sie gibt dir den cumshot bist du so gut wie tot. Später aber kein Problem mehr für dich.\n{{champion:64}} wird dich invaden und wenn nicht dann ist er noch noch neu mit ihm aber er kann dich easy bei deinem Buff killen und er wird dir dein early zur Hölle machen, wenn er gut ist.\n\nGenerell wenn du unsicher bist und das Gefühl hast der gegnerische Jungler wird öfters bei dir sein, dann setze bei deinen Eingängen ein Ward um vor seinen invades geschützt zu sein.","replies":[{"poster":"xXTheGreyWolfXx","date":"2016-04-18T14:08:26.613+0000","up_votes":1,"down_votes":0,"body":"Will mal was zu Lee sagen bin selber Rengar und Lee Main die Meisten Lee sin Mains werden invaden nicht wie ich wollte mal sagen, es kommt auf den Spieler ansich wenn der Lee AS mit nimmt kannst du davon ausgehen dass er am Farm Intressiert ist :D","replies":[]},{"poster":"CKC Zekken","date":"2016-04-18T12:57:28.611+0000","up_votes":1,"down_votes":0,"body":"Hab wirklich null Plan von Jungle Matchups :D Weiß nur dass man mit Shaco nen Rengar im Jungle killn kann xD","replies":[{"poster":"Sikn3ss","date":"2016-04-18T13:00:07.300+0000","up_votes":1,"down_votes":0,"body":"Ist eine Lehre für sich. Es ist bekannt, dass ein Shaco, Lee, Udyr sehr starke und nervige early game Jungler sind. Aber auch nur in den richtigen Händen. Schlussendlich kommt es auf den Spieler und nicht auf den Champion an =)\n\nIch hab auch schon einen Shaco auf lvl 2 bei meinem Red outplayed. Vergiss nie: Der Jungle ist Rengars zuhause also nutze deine Passive.","replies":[{"poster":"CKC Zekken","date":"2016-04-18T13:02:13.675+0000","up_votes":1,"down_votes":0,"body":"Okay das wars glaub ich erstmal mit den Fragen, bleibt nur noch das wann wo ganken usw.","replies":[{"poster":"Sikn3ss","date":"2016-04-18T13:16:39.970+0000","up_votes":1,"down_votes":0,"body":"Jop, wie gesagt können uns mal im TS für ne kurze Session treffen. Heute bin ich leider nicht da aber morgen Abend würde es mir passen :)","replies":[{"poster":"CKC Zekken","date":"2016-04-18T13:18:28.743+0000","up_votes":1,"down_votes":0,"body":"Okay","replies":[{"poster":"Sikn3ss","date":"2016-04-18T13:19:21.856+0000","up_votes":1,"down_votes":0,"body":"Add mich sonst schon mal ingame, dann sehen wir weiter.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Reggae Rengar","date":"2016-05-12T12:48:17.980+0000","up_votes":1,"down_votes":0,"body":"Joa wenn du bock hast kannst du mich adden IGN siehste ja, Spiele hauptsächlich jungle/support und queue normal meistens ausser 5 man dynamic ranked. Habe Ca. 4k Games gespielt davon 60% jgl deshalb würde ich behaupten weiss ich ein bisschen was über jungle Routen/ cj/ deep ward/ split/ drake/baron calls/ gank und counter gank. Zur Zeit vertiefe ich mich auch in rengar hab zwar erst 70k champion mastery aber bisschen was kann ich schon ;)","replies":[]},{"poster":"Z3ndom","date":"2016-04-22T08:32:23.123+0000","up_votes":1,"down_votes":0,"body":"r/Rengarmains","replies":[]},{"poster":"Killerkante","date":"2016-04-18T12:39:43.560+0000","up_votes":1,"down_votes":0,"body":"Gibt doch genug Rengar guides auf Youtube\nSchau mal Silphi gameplays an mit {{champion:107}} \nKommentiert eigentlich viel und spielt(e) auf Master/Challenger.\n\nWenn du welche fragst, dann such dir welche raus die wirklich Ahnung haben und es nicht nur behaupten.","replies":[]}]}