{"poster":"Shes my Princess","date":"2017-10-10T00:00:13.741+0000","title":"Can I get confirmation by a real person on this permaban?","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"Game 1\r\nShes my Princess: i rate it ay\r\nShes my Princess: let&#039;s fuck\r\nShes my Princess: oh\r\nShes my Princess: kys\r\nShes my Princess: jebaited\r\nShes my Princess: really?\r\nShes my Princess: kys\r\nShes my Princess: CHEESE ABORTED\r\nShes my Princess: MANNN rengar top is so gay\r\nShes my Princess: especially for such a shitty laner like gp\r\nShes my Princess: bl\r\nShes my Princess: blbl\r\nShes my Princess: i saw\r\nShes my Princess: so close\r\nShes my Princess: yeah saw that coming\r\nShes my Princess: so much cheese holy shit\r\nShes my Princess: yep\r\nShes my Princess: cheese\r\nShes my Princess: hes had it all game\r\nShes my Princess: it did..\r\nShes my Princess: i did?\r\nShes my Princess: i barrelled you for the kill\r\nShes my Princess: we gotta group up as 5\r\nShes my Princess: asap\r\nShes my Princess: focus rengar\r\nShes my Princess: dont go alone\r\nShes my Princess: stay together\r\nShes my Princess: as 5\r\nShes my Princess: lesko\r\nShes my Princess: need 5\r\nShes my Princess: varus can you go guinsoos for your w passive for mundo?\r\nShes my Princess: everyone stay together\r\nShes my Princess: right now\r\nShes my Princess: lesko\r\nShes my Princess: whats the call\r\nShes my Princess: which one\r\nShes my Princess: 5 top\r\nShes my Princess: lesko kayn\r\nShes my Princess: um\r\nShes my Princess: yes\r\nShes my Princess: lux\r\nShes my Princess: lesko\r\nShes my Princess: lux whyd you back :(\r\nShes my Princess: bad call friendo\r\nShes my Princess: and?\r\nShes my Princess: we get an inhib tower\r\nShes my Princess: if varus stayed we&#039;d have the inhib\r\nShes my Princess: and they&#039;d have gotten what, the inhib tower before we backed\r\nShes my Princess: as 5\r\nShes my Princess: fuck off\r\nShes my Princess: yep\r\nShes my Princess: prob 45s cd\r\nShes my Princess: tho\r\nShes my Princess: push\r\nShes my Princess: as 5\r\nShes my Princess: actually push\r\nShes my Princess: as 5\r\nShes my Princess: together we&#039;re strong &lt;3\r\nShes my Princess: teamwork\r\nShes my Princess: op\r\nShes my Princess: sb\r\n\r\nThe only thing that really stands out to me is the first passage,\r\n\r\nShes my Princess: i rate it ay\r\nShes my Princess: let&#039;s fuck\r\nShes my Princess: oh\r\nShes my Princess: kys\r\nShes my Princess: jebaited\r\nShes my Princess: really?\r\nShes my Princess: kys\r\n\r\nWhich was a humorous conversation between myself and the opposing botlane in the first 90 seconds of the game, which is taken out of context here. Their support typed the lyrics to legends never die, the new song starting games, and it went from there.\r\n\r\nTheir Janna: Legends never dieeeeee\r\nShes my Princess: i rate it ay\r\nJanna: I rate you\r\nShes my Princess: Let&#039;s fuck\r\nJanna: 0/10\r\nJanna: HAHAHAHAAHAHAA ily &lt;3\r\nShes my Princess: oh\r\nShes my Princess: kys (obviously joking, actual banter with someone that can speak English and talks for once - that&#039;s not a joke either)\r\nShes my Princess: jebaited\r\nTristana: Be careful, you can get permed by saying that, it happened to one of our friends (unjustly, if i remember - was a few days ago)\r\nJanna: (Something to the same effect)\r\nShes my Princess: really?\r\nShes my Princess: kys (obviously joking/banter, again)\r\n\r\nLater on, saying &quot;fuck off&quot;, was when my lane opponent Rengar jumped on my frail ass and instagibbed me. Simply said to myself in local chat.\r\n\r\nI&#039;ve been trying to curb my toxicity of late, but feel like this has simply been detected by a bot out of context, and it was pretty obviously said in a joking manner with some friendly dudes. The rest of the game depicts a positive attitude, communicating to win the game and that&#039;s generally what I&#039;ve been doing. Is this the unfortunate end of the road? And yes, I know it was my last chance. I take responsibility for this slip-up, I really do. But is this considered strike-worthy?\r\n\r\nCheers, potentially for the last time,\r\n\r\nMe.","replies":[{"poster":"Tomblade","date":"2017-10-10T02:28:03.847+0000","up_votes":7,"down_votes":3,"body":"Hi Shes my Princess,\n\nAs mentioned before in other similar threads, most permabans are not the result of a single instance of negative behaviour.\n\nI had a look through your account and in the last 12 months, you have received 5 (6 including this perma) punishments for negative behaviour. Every time you recieve a punishment, your account gets escalated and based on your record, you were on very thin ice already after 3 chat restrictions and 2 time bans. \n\nIt was your behaviour as a whole that resulted in your permaban, though it was the reports by players in your last game that tipped you over the edge.\n\nI would also like to note that the assumption that Riot has a list of god-level \"no-no\" terms is not entirely correct. The automated system is populated based on reports by other players and the community as a whole has deemed (through their reports) that some things are not acceptable.\n\nHope that gives you and others enough context!","replies":[{"poster":"JasonWazza","date":"2017-10-10T03:28:05.584+0000","up_votes":5,"down_votes":2,"body":">I would also like to note that the assumption that Riot has a list of god-level \"no-no\" terms is not entirely correct. The automated system is populated based on reports by other players and the community as a whole has deemed (through their reports) that some things are not acceptable.\n\nSo in other words, riot DOES have a list of god-level \"no-no\" words.\n\nWhether determined by the \"community as a whole\" (which really means the community that reports people, lets not pretend that it's determined by EVERYONE, if that were the case, it'd be a vote in client as to whether saying something is ok or not) or not, it's still a list of words we can't say or we are likely to get banned.","replies":[{"poster":"Ninox","date":"2017-10-10T03:52:14.270+0000","up_votes":6,"down_votes":4,"body":"It means that while Riot doesn't strictly have a list of keywords, those keywords will often prompt people to report. For a lot of people, saying \"kys\" is enough reason to straight away report someone, regardless of context or what else they say. So in that sense, yes there is a list of keywords that contribute to punishments, but it's not nearly that simple overall.\n\nIf you're being reported in the majority of your games, safe to say a majority (or at least very significant portion) of the community thinks that behaviour isn't ok. If you think a certain behaviour is ok, then don't report it, people can agree or disagree with their own reports same as you. Essentially, if you care about the behaviour being demonstrated, you'll vote on it, and if not, then you aren't who reports are for and they shouldn't affect you.","replies":[{"poster":"JasonWazza","date":"2017-10-10T04:10:59.501+0000","up_votes":2,"down_votes":2,"body":"Seras, please just don't talk when you don't know what your talking about.\n\nThey have a bot that automatically bans people, meaning that the bot has a list of keywords.\n\n>If you're being reported in the majority of your games, safe to say a majority (or at least very significant portion)\n\n\"Majority\" being reported doesn't mean a majority is mad, it means a MINORITY is mad.\n\n1 person reports you in every single game for example.\n\nYou have been reported by 11% of the people you encounter.\n\nTHIS IS NOT A MAJORITY.","replies":[{"poster":"Ninox","date":"2017-10-10T04:18:54.476+0000","up_votes":4,"down_votes":2,"body":"except if someone is being reported and likely to receive a significant punishment from that game (i.e an actual restriction or ban as opposed to a mark on their history) then more than likely it's not just one or two people reporting them. I've seen people on boards who say \"why did I get banned?\" then we find out they are being reported by nearly everyone on their team (if not in the game) in pretty much all of their games.\n\nIf the behaviour is something mundane enough to take a while to warrant a punishment then sure it might be a minority per game, but if you're saying shit like \"kys\" then that's unlikely.\n\nThere is more to the system than just keywords. That players history is taken into account (do they get reported a lot), how many people reported them this game (was it just one salty person or was there a real reason), were there comments on the reports etc etc.\n\nIf it was only keywords then people who abused their teammates without swearing would never be punished, but they are. I never said there wasn't a list of keywords, because there is (it's just not generated by Riot, or at least not anymore), what I'm saying is that keywords aren't the only thing that get you punished.","replies":[{"poster":"JasonWazza","date":"2017-10-10T04:56:08.029+0000","up_votes":2,"down_votes":3,"body":">I've seen people on boards who say \"why did I get banned?\" then we find out they are being reported by nearly everyone on their team (if not in the game) in pretty much all of their games.\n\nWhere's the proof other then taking riot's word?\n\n>If it was only keywords then people who abused their teammates without swearing would never be punished, but they are.\n\nBurden of proof is here, says your talking out your ass.\n\nFact is i want you to prove it's not keywords, you can't, because it is.\n\nIf it's automated, it's looking for keywords, bot's can't determine context, now please shut up about shit you don't understand.","replies":[{"poster":"Ninox","date":"2017-10-10T08:21:45.012+0000","up_votes":4,"down_votes":1,"body":"Where's the proof they are lying? If they were lying do you not think those people would call them out? Say something like \"there's no way I was reported in that many games\" or something? They don't, which would in most circumstances mean they know what they did, but were just trying to get out of responsibility.\n\nAgain, I never said keywords aren't involved, I said it wasn't *only* keywords. Besides your argument goes both ways, prove to me that it's only keywords that prompt bans. There are recorded cases here on boards where no swears were said, but in abusing a teammate someone still gets banned.\n\nA simple yes or no bot can't determine context sure, but that's obvious. The automated system is designed to see patterns in behaviour, not just keywords, it learns those patterns from what players report. If x pattern is reported by 90% of players, chances are it's negative.\n\nYou're assuming I'm wrong because I don't have hard proof, while you also lack any hard proof to the contrary. \n\nIf Riot lied about such things they'd get called out, like they do when something gets bungled with a 3rd party banned but compromised account. The fact that they don't says to me that those people know exactly what they did and how many games they are more than likely being reported in.\n\nIf the automated system only functioned on keywords you wouldn't see people not saying 'bad words' getting banned, and people who say 'bad words' but aren't abusive not getting banned. But hey, what do I know right?","replies":[{"poster":"JasonWazza","date":"2017-10-11T04:39:24.474+0000","up_votes":1,"down_votes":1,"body":"First what i want you to do is reread the main post, and the Rioter post before you read anymore of this.\n\nNow, remember that riot posts are PR'd the fuck up, they don't get to just post like you do, hey that's why your a volunteer here in the first place, because rioters can't just speak up whenever they like.\n\n>It was your behaviour as a whole that resulted in your permaban, though it was the reports by players in your last game that tipped you over the edge.\n\nLet's first go over this bit, looking at the chat log we can see, and the fact that the rioter didn't post anything else, tells me that it's accurate, because remember all rioters correct this shit.\n\nThe rest of this post being about the automated no-no words, means it was done by the bot, or else why mention it?\n\nSo given the main post again, he posted that 2 of the players mentioned that their friend got banned unjustly, meaning they don't agree with banning for just saying kys, and given NONE of the chat is in all chat, it's also fair to say, that enemy team reports aren't a thing.\n\nThat means at most 2 players reported this guy.\n\nGoing back to our previous fight, that's not a majority, hell ask the team, and we'd get at best a split vote on whether or not to ban him (since again, 2 clearly don't mind the saying of that).\n\nBut going back to the fact that it was a bot ban, this is fairly clear, as the only thing that comes up as aggressive at all, is the kys stuff early in the game, and even then, only if your a bot reading it, because again, the bot doesn't care for context.\n\nSo that is why i refuse all this \"it's not keywords\" bullshit, because it clearly is, why else would this ban have happened?\n\nBack again to the riot post, the main thing that gets said is you've had prior bad behaviour, almost nothing gets said about the game posted, why? because the game posted wasn't bad enough, they damn well know that, and that's why it's PR'd to be all \"look at your previous behaviour\"\n\nRemember this is a company that had one of the tips for the game being \"90% of players don't get banned again after being banned once\" so of course they have to hold firm and pretend their shitty bot is actually doing things, it's all about PRing and pretending they are banning toxic players, when again, it's clearly not the case.\n\nAs for your whole \"why wouldn't people say something?\"\n\nThat's because we can't have proof, only riot can have the proof we would need, and they wouldn't show it, they'd only show the stats they want to show, as they have shown in the past, hell they refused to even tell us how much they donated to a charity because of \"privacy reasons\"\n\nA lot of riots stats are deliberately shown as a PR move, just like any other company, they only show you the stats they want you to see.\n\nBut hey why should i bother, you have your head lodged too far up riot's ass to see anything clearly.\n\nEspecially since you said this line.\n\n>If the automated system only functioned on keywords you wouldn't see people not saying 'bad words' getting banned, and people who say 'bad words' but aren't abusive not getting banned. But hey, what do I know right?\n\nGood to know your learning your PR speech, but are still yet to be brushed up on anything that shows proof, you can say this all you want but you can't prove it, lets go back to that old stat i brought up, the 90% don't reoffend, ever wonder why i found that stat funny?\n\nBecause what it really proved is that 90% of the players that offended once, found a way around a shitty bot that doesn't actually know how to track context.\n\nBut hey, it's totally not keywords, and there is no one toxic in league of legends at all right?\n\nCan't get your head out of riots ass long enough to get you to realize that can i?","replies":[{"poster":"Tomblade","date":"2017-10-11T06:01:51.650+0000","up_votes":4,"down_votes":1,"body":"Hey JasonWazza,\n\nYou're drawing a lot of assumptions based on incomplete information.\n\n>So given the main post again, he posted that 2 of the players mentioned that their friend got banned unjustly, meaning they don't agree with banning for just saying kys, and given NONE of the chat is in all chat, it's also fair to say, that enemy team reports aren't a thing.\n\nActually, most of the chat was in ALL chat - the transcript you saw simply did not show it. The Janna and Tristana mentioned in OP's post was actually on the enemy team.\n\n>Back again to the riot post, the main thing that gets said is you've had prior bad behaviour, almost nothing gets said about the game posted, why? because the game posted wasn't bad enough, they damn well know that, and that's why it's PR'd to be all \"look at your previous behaviour\"\n\nPersonally as a League player myself, I would have reported OP for using that phrase because it's something I don't want to see when I'm playing. More importantly, the players in that match had that same view regardless of \"banter\" context and felt the need to report OP for it.\n\nWhile I can't comment on the exact details of how the automated system works (as in, the literal logic it uses), I can say that your interpretation of it is not quite right. It's not so much that the system scans games for words, but rather Player Reports, bring games for review. \n\nHad no one reported OP for saying \"KYS\", the system would not have actioned anything. It is because players in that match felt - even with so called \"banter\" context - that what OP said was unacceptable and reported it, that the system then took action. This is how it was intended to work - you, the players as a collective, decide what is acceptable or not. The idea is that the person(s) in the best position to make a judgement on behaviour, are the players in that specific game. \n\nI am by no means saying this is a perfect system - far from it - but definitely something that is continually being iterated and improved upon.","replies":[{"poster":"Outis","date":"2017-10-11T14:50:12.833+0000","up_votes":2,"down_votes":2,"body":"\"This is how it was intended to work - you, the players as a collective, decide what is acceptable or not.\"\n\nthat's obviously not ACTUALLY the case. when someone gets reported for \"feeding\" do you punish the person because the players in that match deemed that unacceptable. no, because you are not gonna punish people for being bad at the game. this is arguably the most reported thing, especially when \"unskilled\" was an option back in the day. yet you're obviously disregarding what the \"community\" wants here.\n\nwhen someone reports a person for \"racism/hate speech\" their report, like you said, triggers a review. but you yourself, or your system rather, is the one identifying the specific words. YOU are the ones ultimately deciding which words are punishable and which are not. what if i report someone for \"racism/hate speech\" and none of these common trigger words are present? what if the reason i reported was because i was offended by someone for saying something else, something that you obviously don't (yet) consider punishable?\n\nriot employees have pointed out many times that \"gg ez\" is something that you have seen the \"community\" deeming as unacceptable. can you tell me if anybody has ever been punished or not yet for saying this phrase or something similar? can you tell me how many games it would take of this \"behaviour\"? either way, im sure nobody has received instant suspensions for saying \"gg ez\" like they do for saying \"kys\" or \"f g t\". again, YOU are deciding that, not the community. i'm willing to bet that nobody has actually ever been punished for this in any way because you actually know how bad a precedent this would be. literally anything will be punishable if the \"community\" truly decides.\n\nLike jason said, you're heavily PRing this. what game somehow detects chat related behavior without it being reported by someone? you're somehow twisting it around so that \"you reported it, therefore you, the community decided!!!!\" when you are the ones deciding what is or isnt acceptable.\n\nyou must realise how out of hand the punishments are getting for chat. it was bad enough before but now you're accelerating it. who the fuck decided that using specific words skips chat restrictions? fresh accounts are receiving instant suspensions so your \"past behaviour\" bs doesn't actually apply for specific words. it seems someone realised you can make it appear like you're really cracking down on \"toxicity\" without actually doing anything more than you were before. \n\n\ncensor these bad words in-game\n\nactually use chat restrictions for chat related offenses. restrict their chat totally as higher tier punishments and these can be for a long time for continual offenses. 1 year mute. maybe even a permanent mute. chat and pings can already be muted by someone so the \"what about communication\" argument is rubbish.\n\nfocus suspensions and bans on cheaters, int feeders and trolls, afk/leavers, account sharing/boosting, chargebacks/stolen credit card.","replies":[]},{"poster":"JasonWazza","date":"2017-10-11T21:12:50.160+0000","up_votes":1,"down_votes":3,"body":"Hey Tomblade, quit the PR talk.\n\nLet's face it, one overly sensitive person reported him, or probably even more likely, one person who didn't even remember him saying kys reported him because they were salty and he got flagged.\n\nThat is the more likely case here, and again it's not the community as a collective, or a whole, or whatever buzz word you want to use next.\n\nIt's the community members that want to whinge and complain that are doing the reports.\n\nBut hey lets face it, we both know the system is shit.\n\nBecause this player has been here for 5+ years, and the system has only picked him up in the last 12 months according to you.\n\nEither like me the system never caught the \"toxic\" behaviour for years, and decided only recently that it's \"not ok\" in which case the system doesn't work, OR his gotten similar bans for sweet fuck all, and the system doesn't work.\n\nBut hey, your probably a good person Tomblade, I get that's it's the company, not the individuals that are the issue.\n\nThe system is bad, you can defend it all you want, but it always has to be considered bad.\n\nHell i had been playing for years with the same attitude, only got banned by manual review.\n\nBut hey as seras the lapdog said \"it catches people who don't use keywords\"\n\nYep totally caught me, totally caught this guy, totally caught the daily people who post this sort of thing.\n\nThese people that post these daily show the issue brighter than anything i can say, daily new people get banned, because lets face it, if you have been banned before you won't come here and complain again, you know how useless riot is for this at that point.\n\nSo these are brand new people being banned every time, people that have played for years without these bans, players that haven't changed their attitude, but the bot hasn't noticed for years.\n\nBut hey, let's pretend the bot is better than just a list of words, it's better for PR that way, says the massive blob Rito Game.","replies":[]}]}]},{"poster":"Mozzie25","date":"2017-10-11T06:00:20.635+0000","up_votes":2,"down_votes":1,"body":"I think you'll be better off letting this one go Seras, your not going to get anywhere.","replies":[{"poster":"Ninox","date":"2017-10-11T14:36:40.838+0000","up_votes":3,"down_votes":1,"body":"Yeah Tomblade pretty much said it better than I could anyway. It's real nice to see more Red responses on threads like these :) Coloured names or no people only believe us so far, and at the end of the day we still really only have access to public information anyway, it's just easier for us to find it.","replies":[{"poster":"Mozzie25","date":"2017-10-11T23:13:17.211+0000","up_votes":2,"down_votes":1,"body":"It is nice to see more Rioters on the boards. Though I'd like to see them more on the fun threads and discussions than this crap. \n\nI don't think it's your fault, some people just see riot as Weyland Utani level of evil with all actions the result of careful planned conspiracies.","replies":[{"poster":"Ninox","date":"2017-10-12T03:17:54.330+0000","up_votes":2,"down_votes":1,"body":"And some people also see them as the opposite. I agree it would be good to see them just engaging with the community more, but they don't really have the resources. There aren't enough of them, and as far as I know they don't get paid for boards interactions outside of actual organisational or annoucement-y things. They do it all on their own time, often for little to no thanks.","replies":[{"poster":"Mozzie25","date":"2017-10-12T07:24:11.505+0000","up_votes":1,"down_votes":0,"body":"Yeah I never really expected to see them much. In fact from the few game relatedness boards I've been on, only the indie devs tend to be more active.","replies":[]}]},{"poster":"JasonWazza","date":"2017-10-12T05:00:58.365+0000","up_votes":1,"down_votes":2,"body":"I mean i don't see the individuals as bad people, i see the corporation they work for as a bad thing.\n\nThe rioters themselves are fine.\n\nBut either way you won't see them doing that, all their posts are PR'd out the ass, and that's more of a requirement then you'd think.","replies":[{"poster":"Mozzie25","date":"2017-10-12T07:36:00.293+0000","up_votes":1,"down_votes":0,"body":"As far as gaming companies go Riot is rather benign. There's things they could improve on but even they admit that. If you want to have a civil discussion about those improvements fine but I'm not arguing with with about why you think riot is evil","replies":[{"poster":"JasonWazza","date":"2017-10-12T21:18:35.007+0000","up_votes":1,"down_votes":2,"body":"Riot itself is benign sure, but riot having been acquired by 2cent isn't, but hey whatever.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"DarkSoul1994","date":"2017-10-11T12:07:33.033+0000","up_votes":1,"down_votes":0,"body":"No, 'kys' is a blacklisted word. The thing with Riot's system is that it relies on player reports to trigger it into scanning chat. If you say 'kys' and don't get instantly banned, it's because nobody reported you to trigger the scan.","replies":[{"poster":"Ninox","date":"2017-10-11T14:45:02.765+0000","up_votes":1,"down_votes":0,"body":"From my post:\n> It means that while Riot doesn't strictly have a list of keywords, those keywords will often prompt people to report. For a lot of people, saying \"kys\" is enough reason to straight away report someone, regardless of context or what else they say. So in that sense, yes there is a list of keywords that contribute to punishments, but it's not nearly that simple overall.\n\nFrom Tomblade's post:\n> While I can't comment on the exact details of how the automated system works (as in, the literal logic it uses), I can say that your interpretation of it is not quite right. It's not so much that the system scans games for words, but rather Player Reports, bring games for review.\n\nIt is only keywords in the sense of the keywords players feel are report worthy. There isn't a Riot side list of words.","replies":[{"poster":"DarkSoul1994","date":"2017-10-11T15:52:23.195+0000","up_votes":1,"down_votes":0,"body":"https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/Jy25XVyR-no-chat-restrictions-level-5-honor-14-day-ban-for-trolling-in-chat-for-1-normal-game","replies":[{"poster":"Outis","date":"2017-10-11T16:38:31.198+0000","up_votes":1,"down_votes":0,"body":"Riot Tomblade\n> I would also like to note that the assumption that Riot has a list of god-level &quot;no-no&quot; terms is not entirely correct. The automated system is populated based on reports by other players and the community as a whole has deemed (through their reports) that some things are not acceptable.\n\nRiot Tantram\n> [{quoted}](name=Riot Tantram,realm=NA,application-id=ZGEFLEUQ,discussion-id=Jy25XVyR,comment-id=0004,timestamp=2017-10-09T21:45:39.910+0000)\n>\n>\n> We take this type of behavior extremely seriously. Telling people to kill themselves and hate speech are big no-no&#x27;s. A simple litmus test is, what would happen if you walked up to a stranger and repeated your chat?\n\none is stating that there is no \"list of no-nos\" and that these are terms that the community has decided are unacceptable.\n\nthe other clearly states that it is RIOTS position that these are unacceptable and even says that they are \"no-nos\" lmao. even uses a real life example to show that it is their position, not just the \"communities\".\n\ni mean, i don't even know how this convo exists here. obviously riot has got \"a list\" of sorts of words/phrases they deem bad enough to hand out instant suspensions/bans for. how else would the bot do it? for some really weird peculiar reason on oce they are denying it.","replies":[{"poster":"Ninox","date":"2017-10-12T03:08:46.518+0000","up_votes":1,"down_votes":1,"body":"For the more sever, yes, Riot has their own stance, just as any company does. No smart company is going to say racism or suicide encouragement is ok, and I like to think that very few actual people even believe that it is (though the cynic in me says otherwise).\n\nBut the discussion wasn't whether Riot has their own stance on some words, it was about how the automated system functions with relations to keywords. Kys etc were used as examples. \n\nIf the community's stance on such words differed from Riot's then it's entirely possible they would set a rule and put measures in place to prevent that behaviour beyond what the system does, but as it is they don't have to because the community has already prompted the automated system to do so.","replies":[{"poster":"Outis","date":"2017-10-12T04:26:27.207+0000","up_votes":1,"down_votes":0,"body":"yeah i don't believe (i think) anybody is saying Riot shouldn't have a stance on these things.\n\nthe issue people were having with it is the lack on context and for me personally, the severity of punishment (especially the instant suspensions with no priors) when there are better ways to punish for chat related offenses.\n\nthis whole argument only started when on the oce boards they claimed there \"is no no-nos\" when clearly there is for what is considered severe.","replies":[{"poster":"JasonWazza","date":"2017-10-12T05:04:55.743+0000","up_votes":1,"down_votes":2,"body":"Yeah but his the riot lapdog, he has to defend them regardless of if he is being stupid or not.","replies":[{"poster":"Mozzie25","date":"2017-10-12T07:31:51.918+0000","up_votes":2,"down_votes":0,"body":"Give it a rest dude.","replies":[]}]},{"poster":"Ninox","date":"2017-10-12T04:53:32.411+0000","up_votes":1,"down_votes":1,"body":"On my part at least it was never intended to be \"there are no no-nos\" but more \"Riot doesn't decide the no-nos (with some obvious, possible but more than likely unnecessary exceptions)\". People were trying to claim that Riot created a list of keywords that automatically triggered the automated system. I was only trying to explain that that isn't how it works.\n\nBut I also don't know if there are exceptions to that. I don't believe so, but it is possible that a manual connection was made for some things like kys or racial slurs. On the other hand, I don't think making that manual connection would have ever be necessary, since as a whole the community reports those things pretty consistently.\n\nI disagree that there are better ways to punish chat related offenses, since the idea isn't to hide the behaviour it's to show why it's not okay and hopefully change it (i.e reform) and things like permanent chat restrictions don't accomplish that at all, though there is an argument that they *might* protect other players better (though also one that they would simply find other ways to be toxic).\n\nI do agree that Riot isn't the best at communicating on some things though. They can't make \"the rules of toxicity\" too specific, because then they would have to just keep adding more and more specific rules while people find more and more ways to get around them (\"don't be a jerk\" is much simpler and gets things done a lot faster), but there are instances where even a bit of effective communication would go a long way.","replies":[]}]}]},{"poster":"JasonWazza","date":"2017-10-11T21:03:15.449+0000","up_votes":1,"down_votes":1,"body":"Your expecting Seras to pull his head out of riot's ass, it ain't happening man, he is lodged too far up there.","replies":[]}]}]},{"poster":"Outis","date":"2017-10-11T15:00:55.174+0000","up_votes":1,"down_votes":0,"body":"ok and what if the report hasn't specified anything other than ticking the box? obviously riot has a list of words they have as unacceptable that the bot detects.....","replies":[{"poster":"Ninox","date":"2017-10-11T15:05:01.294+0000","up_votes":1,"down_votes":1,"body":"The bot detects patterns in behaviour. Basically stuff that's been reported a lot before. It could be as simple as a keyword, or it could be phrases or combinations of things.","replies":[{"poster":"Outis","date":"2017-10-11T15:16:58.620+0000","up_votes":1,"down_votes":0,"body":"yes but why do specific words trigger a skip in tiers of punishments?\n\nwhy does \"gg ez\" not trigger this even though it's something, according to riot, that is reported a lot?\n\nare you telling me this bot has determined this action by itself through figuring out what the most reported is or something?\n\nno it's because riot has decided so...... ie what darksoul said is correct.","replies":[{"poster":"Ninox","date":"2017-10-12T03:04:24.859+0000","up_votes":1,"down_votes":1,"body":"Because gg ez is something that is reported a lot, but also sporadically. A lot of people see it as real bm but a lot also see it as a non issue and this is reflected in reports. \n\nAs a result it is something that would be classed less severely by the system, whereas racial slurs or things like kys are going to be reported a lot more consistently and by a much higher percentage of people so the system treats them as much more severe.\n\nIf you are being reported (accurately) for hate speech on a regular basis then chances are you're going to skip tiers.","replies":[{"poster":"Outis","date":"2017-10-12T04:17:34.321+0000","up_votes":1,"down_votes":0,"body":"except it doesnt need to be on a regular basis. people are receiving instant suspensions the first time they use it, or more accurately, the first time they are reported for it. in the case of my lvl 3 account it literally was the first time it used it. meaning, essentially, there is a list.","replies":[{"poster":"Ninox","date":"2017-10-12T04:58:08.635+0000","up_votes":2,"down_votes":1,"body":"I don't mean one player being reported on a regular basis, I mean the usage being reported. If a particular hypothetical phrase or word is reported every single time it is used by any player, then it's pretty safe to say that the vast majority of the community feels it is worthy of punishment. The more players reporting it that don't normally report indicates the community feels it is a more serious offense.\n\nThe result once the system has enough data to support action on that hypothetical word/phrase is that it is treated very harshly when it is brought to attention. It's words/phrases like this (the usual culprits like kys/racial slurs) that will get you banned very quickly, sometimes on the first offense, because the community has proven to the system that there isn't really a scenario where such things aren't offensive/toxic, and therefore it can action them very quickly. \n\nIt doesn't have to leave wiggle room for banter like it does with simple swears.","replies":[{"poster":"JasonWazza","date":"2017-10-12T05:03:29.554+0000","up_votes":1,"down_votes":2,"body":">If a particular hypothetical phrase or word is reported every single time it is used by any player, then it's pretty safe to say that the vast majority of the community feels it is worthy of punishment.\n\nYeah except that would never happen.\n\nThing is if this was tribunal or something, then fine it's what the public wants, but quit trying to sell that horseshit.\n\nIt's not the majority, it's not the community as a whole, it's like reddit, is controlled by the people who actively vote on it, it's the same for league, the report system is used by a vocal minority.\n\nBut hey tribunal worked and got deleted so you know, riot is totally the good guy here.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"SOOM","date":"2017-10-10T02:32:52.624+0000","up_votes":3,"down_votes":1,"body":"Ily tomblade","replies":[]},{"poster":"Outis","date":"2017-10-10T05:58:28.994+0000","up_votes":2,"down_votes":1,"body":"yeah nah not true. it's 100% possible to get perm banned in 2 matches by just saying a certain word once in each game, assuming you get reported.\n\nfresh low level accounts getting insta 14 day suspension for literally saying 1 word. are you telling me it won't receive a perm ban the next match it plays if using x word?\n\nthat wouldnt make sense instantly punishing someone that severely but then being lenient and giving chances after.","replies":[]},{"poster":"Shes my Princess","date":"2017-10-10T04:12:11.084+0000","up_votes":1,"down_votes":0,"body":"No worries, thanks for your time. Shit result, but what can you do. Have a good one.","replies":[]}]},{"poster":"Fitzky","date":"2017-10-10T05:08:15.620+0000","up_votes":3,"down_votes":2,"body":"It still surprises me how players can be PERMANENTLY banned from the game for \"typing a bunch of words in chat\". It's so fucking childish, if the person is THAT offended there's a MUTE BUTTON FOR A REASON. PERMA bans should be restricted to people who INTENTIONALLY FEED or CHEAT because those are things that ruin the game for EVERYONE and most importantly they are things that everyone else in the game CANNOT DO ANYTHING ABOUT. If you really want to stop someone from typing swear words in chat, or stop someone being toxic in chat altogether. Then instead, give them a CHAT BAN for 2 weeks (That way they won't just grind out a bunch of games over 2 days and not have time to think about what they did), and if they still haven't improved afterwards keep giving them the chat ban until they show improvement. If you perma ban their account they are just going to be more pissed off and create another account to be toxic on. This way, the player will know they will be rewarded with the freedom to speak if they are nice. The longer they go on for, the less harsh the system will be in giving back the chat ban.","replies":[]},{"poster":"Project Xayah","date":"2017-10-10T00:45:31.549+0000","up_votes":3,"down_votes":3,"body":"Well, the Tristana wasn't (entirely) wrong, you can definitely get perma-banned from using \"kys\", though I wouldn't say it's \"unjust\". The fact is, the single most common use (by a very large margin) of the term is \"kill yourself\", which falls under \"suicide encouragement\", something that Riot takes very seriously, regardless of context (and I heartily agree with that). There's never an appropriate time to jokingly use \"suicide encouragement\" terms (among other things) in a public setting. If you want to do that in private among friends (specifically people who wont take offence or who aren't struggling with suicidal thoughts/tendencies) then that is your choice, but never publicly.\n\nIf you want to appeal the ban, you can submit a ticket to [Support](https://support.riotgames.com/hc/en-us), but I see no reason why it would be revoked.","replies":[{"poster":"JasonWazza","date":"2017-10-10T01:27:38.141+0000","up_votes":3,"down_votes":2,"body":"Because lets wrap the children in bubble wrap, the choking sound isn't an issue they are safe in there.\n\nBecause who cares about context, bubble wrap keeps things safe, so obviously it keeps children safe when they are wrapped in it.\n\nBut hey, a bot can't distinguish between context can it?\n\nThat's why youtube is going down the shitter due to ads, because everything is ad unfriendly until a human verifies it.\n\nSo how about that, you use chat, you get banned until you get a manual review, i mean that's the natural place this all goes to.","replies":[]}]},{"poster":"Akkordian Zoeve","date":"2017-10-10T00:05:47.529+0000","up_votes":2,"down_votes":1,"body":"Riot doesn't care about the context. If they did, less players would make a new account and spend RP on XP Boosts to get back to Level 30, meaning Riot would lose money.\n\nSo between money and caring for the community, they would naturally pick money.","replies":[]},{"poster":"Roguestoney","date":"2017-10-10T01:45:24.725+0000","up_votes":1,"down_votes":0,"body":"Kys is an auto trigger and you said it multiple times. Simple really.","replies":[]},{"poster":"SOOM","date":"2017-10-10T02:31:59.421+0000","up_votes":1,"down_votes":1,"body":"lol were you high in this game XD","replies":[]}]}