{"poster":"Legendz Razor","date":"2014-11-02T03:01:15.506+0000","title":"New player*ADC tips and tricks?","subforum":"Tips & Tricks","up_votes":4,"down_votes":0,"body":"Usually I pick last because I want to just learn all I can, the one thing I don't really like to do is fill the bottom lane damage role as an \"adc\" .  A mix of boredom and lack of skill on my part if im being honest, Ive played ziggs and mundo to some success, but I know that I will have to eventually make the transition into a good damage role for bottom lane, ive googled some of the champions and I have enough RP/IP to buy 1 6300 champion for that role.\n\n* Which champion do you think is a good idea to get a feel for \n\nIve been debating ashe because it s\neems simple enough but like i said if im going to invest some ip i want to make sure im picking something relevant for the level I play at.\n\n\nAlso a list of cool tips and tricks for adc would be nice i tried searching the forum but I didnt get anything coherent.","replies":[{"poster":"Wulf Helhammer","date":"2014-11-02T03:24:00.864+0000","up_votes":4,"down_votes":0,"body":"If you want to learn a good ADC, Ashe is a good first pick for learning the role, not so much for playing in higher level games; Tristana is also available for free for liking the LoL Facebook page. You say you have enough IP to buy a 6300 champ - I would wait until you have either gained enough experience playing the ADC role before you spend anything. It could turn out that Trist is the champ that fits your play style perfectly, or it could be that ADC isn't the role for you at all. First try out the free ADC champs of the week to see if one of them suits you, also pick up Trist (she is one of the safest ADCs around because of her range). Just keep trying out the free ADCs each week, and work on CSing well (one of the most important parts of being a good ADC). Also, don't be afraid to look up guides for specific champs. They can be great to get you started and set you up well for making decisions about runes, masteries, and builds for yourself.\n\nPersonally, my ADC is Quinn. She, is however, somewhat of an unconventional pick, and she takes quite bit of skill to play properly. I wouldn't recommend her to someone who is new to the role, and doesn't yet have the skill required to play her effectively.\n\nPS, I can't see if you've done this, but don't spend too much time playing bot games. Try to move to intermediate as soon as you feel confident about it, and make the jump to normals or team builder when you feel confident in your skill. At least wait until level 12 (and get some Flash Summoner Spell experience) before you move to PvP games, but don't wait to long after that. PvP games give you more experience and IP, and make you a better player. Don't make the mistake I did where I played bot games until level 20....it's not a good idea. Another tip: Don't buy runes until you hit level 20 and unlock tier 3. Any others that you buy before that are just a waste of IP, especially tier 2","replies":[{"poster":"Legendz Razor","date":"2014-11-02T04:00:18.964+0000","up_votes":2,"down_votes":0,"body":"> If you want to learn a good ADC, Ashe is a good first pick for learning the role, not so much for playing in higher level games; Tristana is also available for free for liking the LoL Facebook page. You say you have enough IP to buy a 6300 champ - I would wait until you have either gained enough experience playing the ADC role before you spend anything. It could turn out that Trist is the champ that fits your play style perfectly, or it could be that ADC isn't the role for you at all. First try out the free ADC champs of the week to see if one of them suits you, also pick up Trist (she is one of the safest ADCs around because of her range). Just keep trying out the free ADCs each week, and work on CSing well (one of the most important parts of being a good ADC). Also, don't be afraid to look up guides for specific champs. They can be great to get you started and set you up well for making decisions about runes, masteries, and builds for yourself.\n> \n> Personally, my ADC is Quinn. She, is however, somewhat of an unconventional pick, and she takes quite bit of skill to play properly. I wouldn't recommend her to someone who is new to the role, and doesn't yet have the skill required to play her effectively.\n> \n> PS, I can't see if you've done this, but don't spend too much time playing bot games. Try to move to intermediate as soon as you feel confident about it, and make the jump to normals or team builder when you feel confident in your skill. At least wait until level 12 (and get some Flash Summoner Spell experience) before you move to PvP games, but don't wait to long after that. PvP games give you more experience and IP, and make you a better player. Don't make the mistake I did where I played bot games until level 20....it's not a good idea. Another tip: Don't buy runes until you hit level 20 and unlock tier 3. Any others that you buy before that are just a waste of IP, especially tier 2\n\nhttp://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/1615734968/224818519\n\nJust played some ashe 450 ip lol got crushed :(","replies":[{"poster":"Wulf Helhammer","date":"2014-11-02T04:24:16.167+0000","up_votes":5,"down_votes":0,"body":"Don't feel bad because you lost (that wukong carried their team HARD). You did very well for someone just starting that role; 22/11/11 is an AMAZING score. My best score with Quinn on my match history was 11/1/8 (BTW, I'm counting score as the best KDA calculated as kills+assists/deaths. I've had a couple other games where I got more kills, but I also had more deaths), and that was also due to having a great support and two other players who did well on my team. Never beat yourself up just because you lost a game. Play the best you can play, and sometimes you just get beat by better players.","replies":[{"poster":"Tannhäuser Gate","date":"2014-11-02T15:15:01.582+0000","up_votes":1,"down_votes":0,"body":"> Don't feel bad because you lost (that wukong carried their team HARD). You did very well for someone just starting that role; 22/11/11 is an AMAZING score. My best score with Quinn on my match history was 11/1/8 (BTW, I'm counting score as the best KDA calculated as kills+assists/deaths. I've had a couple other games where I got more kills, but I also had more deaths), and that was also due to having a great support and two other players who did well on my team. Never beat yourself up just because you lost a game. Play the best you can play, and sometimes you just get beat by better players.\n\ni think best game I've had was a 40-3-15 yasuo\nall lanes lost but me\nhit {{item:3031}} {{item:3087}} and hard carried","replies":[]}]},{"poster":"Direwolfiez","date":"2014-11-03T20:38:43.249+0000","up_votes":1,"down_votes":0,"body":"Quick tip: Ruunan's isn't that good on Ashe.  Sure, it applies a second Q for free, but in teamfights you'll be wanting to stun teams with her R when they're in bad positions, then have an AS item like Shiv or PD to take out a single target (Shiv early for waveclear, PD later for dueling), and then applying her slow to as many targets as possible with her W.  If you can't take out a single target fast enough, you may get into trouble if their bruiser dives you and your team isn't ready for it.  Also, getting the blue Trinket is kinda redundant, since it's a shorter-ranged version of the active on her E.  You always want to be getting the yellow Stealth Ward Trinket as ADC.  Also, her skill order is R > W > Q > E.  W is more useful than Q, even though it applies the current level of Q to  W.  Trust me on this, W is so useful for Ashe it's not even funny.  It's a great counter-diving and harassment tool.\n\nEDIT: If that was the first time you played Ashe, you did *great*.  Try checking a few guides for general tips on builds and playstyles; I find that always helps whenever I play a champ for the first time.","replies":[]},{"poster":"TonyTonyMordecai","date":"2014-11-02T04:03:00.974+0000","up_votes":1,"down_votes":0,"body":"That's fine.\nThat's to be expected when you go first time with a champion.\nThe ADC role is the most dependent role because if the lane is lost, then the bot lane duo will be able to perma push the lane with almost no worry of ever dying.\nI get crushed horribly sometimes if I haven't played Jinx in a while, It happens to all of us\n\nEDIT: I just looked at the match stats, and it seems like you did pretty well, you just got outplayed near the end, especially with the opposing Yi. Stuff like that happens too","replies":[]}]}]},{"poster":"Drukyul","date":"2014-11-02T14:56:02.241+0000","up_votes":2,"down_votes":2,"body":"DO NOT START WITH ASHE\n\nwtf people, throwing new players into the deep end\n\nstart with Cait","replies":[{"poster":"Wulf Helhammer","date":"2014-11-02T20:26:14.538+0000","up_votes":1,"down_votes":0,"body":"Please explain how Ashe is the \"deep end\". She has good range (tied for 3rd highest base), a toggle slow, extra gold earning, and one of the champions that everyone is acquainted with, as long as you played the tutorial.","replies":[{"poster":"a0IP9RlIBC","date":"2014-11-02T22:42:52.463+0000","up_votes":3,"down_votes":0,"body":"no escapes, completely relies on her ult for teamfights.\n\nCaitlyn is a much better training-wheels adc.","replies":[{"poster":"Akenero","date":"2014-11-03T19:34:51.529+0000","up_votes":1,"down_votes":0,"body":"that sums up like. half of adc champs imo.\nespecially the second part.\nImho {{champion:6}} is a good learning champ, due to his tankiness, he's able to let people decide what they want to do. but seriously...best escape adc has to be ezreal","replies":[]}]}]}]},{"poster":"TonyTonyMordecai","date":"2014-11-02T03:32:19.523+0000","up_votes":3,"down_votes":0,"body":"To be honest, the ADC role is reliant on the player's understanding of the champions abilities, their damage output, when to go in, and when to use certain abilities, like Jinx's R, Super Mega Death Rocket.\nI enjoy Jinx a lot because I'm most accustomed to her skillset, but Ashe, to go with your statement, is a little different because she has only  two damaging abilities, which are her volley, and her R, which is the global frozen arrow.\nBeing an ADC is fun, because having the extra attack speed greatly increases your damage output, but there needs to be a consistent balance between building damage, attack speed, and defense.\nKnowing when to get these items can make or break your laning phase, IMO\n\nAs for an ADC to get a feel for the role, that's up to you.\nI chose Jinx because I really like her appearance, and she is fun to play as, as well as listen to her voice overs.\nQuinn is different because she benefits from more critical strike chance than having the extra attack speed, and Quinn has an ability sequence combo that will help to bring out the most damage when approaching an enemy. Her ultimate, which turns her into a melee hawk, changes how you set up your trading, as well as how you contribute in team fights, but her AOE returning damage is pretty nice.\nTeemo... Is better suited in the top lane, IMO, so dont bother with him.\nTwitch is good, but he needs a certain set up and positioning to give the most damage before your opponent runs away.\nDraven, is just not liked by me. I just don't like his abilities. Maybe you will, I don't know.\nLucian is also different, but his ultimate might be the one thing that helps him get kills easier. And his passive allows for easier killing potentiall.\nSivir has a lot of DoT abilities, and her Q(boomerang blade) can pass through minions and allows for easy damage output, especially if you have squishy lane opponents.\nVayne is somewhat combo based for giving max damage output, but she is different where she is very auto attack reliant, because her W is a stacking passive on one target at a time. And her activated ultimate just adds bonus attributes to her other abilties.\nThere are many other characters who can be the ADC. But to be honest, choosing the ADC is all about preference for how they look, what you like about their abilities, and if you want to get into being a frequent ADC.\n\nI hope I helped!","replies":[{"poster":"Legendz Razor","date":"2014-11-02T04:02:11.008+0000","up_votes":2,"down_votes":0,"body":"> To be honest, the ADC role is reliant on the player's understanding of the champions abilities, their damage output, when to go in, and when to use certain abilities, like Jinx's R, Super Mega Death Rocket.\n> I enjoy Jinx a lot because I'm most accustomed to her skillset, but Ashe, to go with your statement, is a little different because she has only  two damaging abilities, which are her volley, and her R, which is the global frozen arrow.\n> Being an ADC is fun, because having the extra attack speed greatly increases your damage output, but there needs to be a consistent balance between building damage, attack speed, and defense.\n> Knowing when to get these items can make or break your laning phase, IMO\n> \n> As for an ADC to get a feel for the role, that's up to you.\n> I chose Jinx because I really like her appearance, and she is fun to play as, as well as listen to her voice overs.\n> Quinn is different because she benefits from more critical strike chance than having the extra attack speed, and Quinn has an ability sequence combo that will help to bring out the most damage when approaching an enemy. Her ultimate, which turns her into a melee hawk, changes how you set up your trading, as well as how you contribute in team fights, but her AOE returning damage is pretty nice.\n> Teemo... Is better suited in the top lane, IMO, so dont bother with him.\n> Twitch is good, but he needs a certain set up and positioning to give the most damage before your opponent runs away.\n> Draven, is just not liked by me. I just don't like his abilities. Maybe you will, I don't know.\n> Lucian is also different, but his ultimate might be the one thing that helps him get kills easier. And his passive allows for easier killing potentiall.\n> Sivir has a lot of DoT abilities, and her Q(boomerang blade) can pass through minions and allows for easy damage output, especially if you have squishy lane opponents.\n> Vayne is somewhat combo based for giving max damage output, but she is different where she is very auto attack reliant, because her W is a stacking passive on one target at a time. And her activated ultimate just adds bonus attributes to her other abilties.\n> There are many other characters who can be the ADC. But to be honest, choosing the ADC is all about preference for how they look, what you like about their abilities, and if you want to get into being a frequent ADC.\n> \n> I hope I helped!\n\nit did thanks","replies":[]},{"poster":"Wulf Helhammer","date":"2014-11-02T03:35:01.460+0000","up_votes":2,"down_votes":0,"body":"hey I saw you on another thread not 30 mins ago, the \"To adc from support\"","replies":[{"poster":"TonyTonyMordecai","date":"2014-11-02T03:41:14.781+0000","up_votes":1,"down_votes":0,"body":"WHOA\nYeah, I'm trying to give my valuable input and advice wherever needed.\nI'm everywhere today :)","replies":[]}]}]},{"poster":"Star Warden","date":"2014-11-02T21:19:17.811+0000","up_votes":2,"down_votes":0,"body":"Safest ADC: {{champion:81}}  (Koreans love him for a reason, watch them play him to understand)\n\nSide note about Ezreal: There are many MANY people that think he is a horrible ADC and will complain at you for picking him, but think of this. Koreans are almost always a step ahead when it comes to meta changes and the best picks. You would be hard pressed to see a meta there that doesn't work here 2x as well. On top of that even if his early game is weak, his late game plays can be VERY strong and using W or E+W can be great for pushing. He is really strong for sieging and ensuring safe lanes where you will not die. You will get a second Flash with your E, but don't forget that it has a slight channel time meaning you can get caught before it goes off if you aren't careful.\n \nSecond Safest: {{champion:51}} (her range makes it stupid easy to poke safely, don't use your passive to farm, but rather to zone and poke)\nHardest ADC: {{champion:67}} (mechanics need to be ballin' otherwise you'll lose)\nStrongest ADC (currently): {{champion:18}} (her scaling into late game is beastly, even compared to Vayne, who has the absolute best scaling she's really good)\nSecond Strongest (currently): {{champion:42}} or {{champion:236}}  (its a close tie and one just peaks at a different time or a bit harder. The best thing you can do is pick whether you want caster or auto attack procs)  \n\nYou must position properly. Stay even (parallel) to your support in lane. If you are behind them you can't get in place when they engage and your support will die. They will also take free harass because there is no fear of retaliation by you. If you are in front, however, you are even worse off. You will take harass, which will hit you harder than most supports. On top of that, a support can't save you if they can't get to you and most don't have gap closers. You and your support are equal and should play as one.\n\nAs a newbie to the ADC role I suggest staying away from: {{champion:22}} {{champion:119}} {{champion:222}} {{champion:96}} {{champion:21}} as these champions have little chance of escaping from a point where you have bad positioning. Since positioning your artillery in battle is one of the most important parts of war, you must ensure you do it properly, or have a backup plan. These champs have no backup plan. They either get fed and snowball like a beast (ashe being the least of these) or they lose hard and will never recover. This is a gap closer meta. That means that most if not ALL of your enemies will have extremely high mobility or some form of jump where they can ignore your slows/snares if they are smart. I don't play Jinx because every time I do, I get hard focused and can't escape without using flash. Once that is down, the enemy just tries that much harder since they know I now can't escape. When Jinx first came out, I found that every team I ever played against had a J4 pick into me. {{champion:29}} has his Q for an escape, but remember that it is on a delay and it is also an increased delay if you are being hit by anything.\n\nTo practice farming: Play as {{champion:30}} who has the lowest attack damage at the start of the game, and one of the most frigged auto attack animations. Go into a solo match and try to get 35 farm (within 5) by 5 minutes. Next, turn off your runes and masteries (just use blank pages) get the same score or better. Then practice moving between each attack. Then add in a bot. Then add in 2. (to your lane) Next try to harass the bot out of lane. Do all this while maintaining the 35 at 5 rule to become an expert farmer. Doing this will net you the 100 cs per 10 goal you are looking for as an adc.","replies":[{"poster":"Legendz Razor","date":"2014-11-03T04:54:26.594+0000","up_votes":1,"down_votes":0,"body":"> Safest ADC: {{champion:81}}  (Koreans love him for a reason, watch them play him to understand)\n> \n> Side note about Ezreal: There are many MANY people that think he is a horrible ADC and will complain at you for picking him, but think of this. Koreans are almost always a step ahead when it comes to meta changes and the best picks. You would be hard pressed to see a meta there that doesn't work here 2x as well. On top of that even if his early game is weak, his late game plays can be VERY strong and using W or E+W can be great for pushing. He is really strong for sieging and ensuring safe lanes where you will not die. You will get a second Flash with your E, but don't forget that it has a slight channel time meaning you can get caught before it goes off if you aren't careful.\n>  \n> Second Safest: {{champion:51}} (her range makes it stupid easy to poke safely, don't use your passive to farm, but rather to zone and poke)\n> Hardest ADC: {{champion:67}} (mechanics need to be ballin' otherwise you'll lose)\n> Strongest ADC (currently): {{champion:18}} (her scaling into late game is beastly, even compared to Vayne, who has the absolute best scaling she's really good)\n> Second Strongest (currently): {{champion:42}} or {{champion:236}}  (its a close tie and one just peaks at a different time or a bit harder. The best thing you can do is pick whether you want caster or auto attack procs)  \n> \n> You must position properly. Stay even (parallel) to your support in lane. If you are behind them you can't get in place when they engage and your support will die. They will also take free harass because there is no fear of retaliation by you. If you are in front, however, you are even worse off. You will take harass, which will hit you harder than most supports. On top of that, a support can't save you if they can't get to you and most don't have gap closers. You and your support are equal and should play as one.\n> \n> As a newbie to the ADC role I suggest staying away from: {{champion:22}} {{champion:119}} {{champion:222}} {{champion:96}} {{champion:21}} as these champions have little chance of escaping from a point where you have bad positioning. Since positioning your artillery in battle is one of the most important parts of war, you must ensure you do it properly, or have a backup plan. These champs have no backup plan. They either get fed and snowball like a beast (ashe being the least of these) or they lose hard and will never recover. This is a gap closer meta. That means that most if not ALL of your enemies will have extremely high mobility or some form of jump where they can ignore your slows/snares if they are smart. I don't play Jinx because every time I do, I get hard focused and can't escape without using flash. Once that is down, the enemy just tries that much harder since they know I now can't escape. When Jinx first came out, I found that every team I ever played against had a J4 pick into me. {{champion:29}} has his Q for an escape, but remember that it is on a delay and it is also an increased delay if you are being hit by anything.\n> \n> To practice farming: Play as {{champion:30}} who has the lowest attack damage at the start of the game, and one of the most frigged auto attack animations. Go into a solo match and try to get 35 farm (within 5) by 5 minutes. Next, turn off your runes and masteries (just use blank pages) get the same score or better. Then practice moving between each attack. Then add in a bot. Then add in 2. (to your lane) Next try to harass the bot out of lane. Do all this while maintaining the 35 at 5 rule to become an expert farmer. Doing this will net you the 100 cs per 10 goal you are looking for as an adc.\n\nok","replies":[{"poster":"Legendz Razor","date":"2014-11-03T04:57:18.772+0000","up_votes":1,"down_votes":0,"body":"ya going to do this tonight good call","replies":[]}]}]},{"poster":"Direwolfiez","date":"2014-11-02T19:15:26.864+0000","up_votes":2,"down_votes":0,"body":"I really don't think you should start with Ashe.  She's a good choice to practice basic ADC mechanics with, but she's godawful in the current meta, and requires a specific comp to do *good*, let alone great.  The ADCs that fit well in the current meta are Twitch, Lucian and Corki, but if you want an ADC to start with, I'd recommend Sivir, Tristana or Caitlyn.  After you get down the basics I'd recommend getting Jinx and Ezreal, but that's just me.  Here's a great tip: if you press and hold \"S\", your champ will not auto attack, letting you last hit effectively.  Smart casting is a great way to land abilities more effectively too; it makes playing Ezreal a dream.  If you want to practice last hitting as an ADC, go into a custom game and familiarize yourself with their AA animation.  It helps so much.  Also, the best runes for ADCs in general seem to be x9 Greater Marks of AD (can be switched out for Armor Pen. if you like), x9 Greater Seals of Armor, x9 Greater Glyphs of Scaling/Flat Magic Resist (depends on enemy team comp and their AP burst), and x2 Greater Quints of Life Steal and x1 Greater Quint of AD.","replies":[{"poster":"mrackham","date":"2014-11-03T05:16:54.696+0000","up_votes":1,"down_votes":0,"body":"Just a note, pressing 'S' will suffice for stopping attacking; it doesn't need to be held.  But it is really helpful :)","replies":[{"poster":"Direwolfiez","date":"2014-11-03T07:58:23.651+0000","up_votes":1,"down_votes":0,"body":"Really?  Thought you needed to hold it.  Huh.  Thanks for that.","replies":[]}]}]},{"poster":"Linna Excel","date":"2014-11-02T15:21:20.346+0000","up_votes":2,"down_votes":0,"body":"1.  Learn to CS is custom bot games.  70-80 CS by 10 minutes is okay, but you want 100.\n2.  Learn to play Ashe.  She teaches you all the mechanics you need to know to do well as an ADC because you have to know them to do well with her.  She also lets you initiate team fights, which is rare for an ADC.  Also she's 450 IP and has a 51% win rate.  You literally can't go wrong with getting her and learning her.  Is she the most modern ADC?  No.  But she gets the job done.\n3.  Try to get in the habit of looking at the map every 2-3 CS you get.\n4.  Learn when to push and freeze the lane, bot lane is different for this than top and mid.","replies":[]},{"poster":"AbyssionKnight","date":"2014-11-02T09:45:13.178+0000","up_votes":2,"down_votes":0,"body":"Ashe is definitely a solid choice. While she's a little lacking in damage, she's great for teaching you how to properly kite, helps you learn global skillshots, and proper positioning. You wont be a hyper carry, but you'll have the foundations to become one. \n\nsince you're new that's a champion I highly recommend.  Saving that much ip also means once you get better, you can buy a new adc later once you're more experienced. \n\nAnother adc you might enjoy is Miss Fortune.  Her Q can be a little hard to aim the second shot on properly, but she has good movespeed for getting around the map, and while AA reliant can be somewhat caster-like.","replies":[]},{"poster":"flibitydoo","date":"2014-11-02T06:26:42.228+0000","up_votes":2,"down_votes":0,"body":"I personally find Kog'maw and Twitch are very easy to use ADCs. They don't have dashes/mobility so you tend to focus more on positioning behind your team mates to stay safe and you also focus more on the damage you dish out.\n\nMechanical tip: Use attack-move commands. This means pressing the \"A\" button (below Q), and then left clicking. What it does is it will command your champion to walk towards that location, attacking any enemy minions, champions, hostile jungle monsters or towers that move in the way that you have vision of. It will always *target the closest attackable unit.* It can be used to force an attack instead of walking to a location and ignoring hostile units.\n\nThe way you should be using attack move is for the purpose of kiting, and stutter stepping.\n\n**Kiting**: Means fighting your opponent by attacking them when they are in your range of attack, but dodging enemy attacks and otherwise staying outside of the range of your enemies attacks. Kiting is easier if you have mobility control based abilities (such as Ashe's slow, or Sivir's Move speed buff, or if you have items like{{item:3044}}  Phage or {{item:3022}} Frozen Mallet). As an ADC, kiting is important because you have a very small health pool and usually not enough burst damage to kill enemies before they kill you. So your best defence is to stay away and get \"free\" attacks against them.\n\n**Stutter stepping**: Means cancelling attack animations to reposition yourself. It's a mechanical technique that pretty much all professional ADC players have mastered. Being good at stutter stepping usually means that you can kite a lot better. A common misconception is that it will increase your attack speed, IT DOES NOT INCREASE IT. The way it works is you throw an attack animation, then immediately make a move command once the ranged projectile has left your champion, then command yourself to attack the enemy. This is because auto attacks can actually be considered spells that deal targeted physical damage equal to your total AD, with a coold own equal to your attack speed. If done right, you end up dealing just as much damage as if you were standing still, but with the added benefit of having moved a small distance. This is useful for dodging skill shots, dealing damage when running away (most likely to get out of the attack range of your enemy), and when chasing an enemy (it also helps to charge{{item:3087}}  stattik shiv a little bit more quickly).\n\nStutter stepping and kiting become much more easier the more attack speed you have. Most players find that they are able to kite once they finish building their berserker greaves and zeal. But if you are like the pro players, you can begin kiting as early as once you finish your berserker greaves by putting some attack speed runes in your rune page. Usually 10-15% attack speed is good. A Life steal quint or two is also useful.\n\nBy far the most important tip to anyone looking into becoming a good ADC is this:\n**FARM**\nEarly game, ADC's tend to have the lowest kill potential out of any champion due to their lack of cc and burst damage early on. Killing the enemy champion's in lane depends on you poking them to low amounts of hp and relying on the idea that your opponents are dumb enough to stay in lane until you they die. Most enemies you face won't be that dumb and they will actually leave and heal and buy health potions/sustain items. Don't depend on kills as farm. Last-hit minions to earn gold. As the ADC, you need gold more than anyone else on the team due to you being the best champion on your team at actually taking objectives (mainly towers) and therefore winning the game.One of the biggest differences between a pro player and a new player is that a pro player can farm minions efficiently and quickly and easily beat out the competition in CS. If you find that farming lane minions is too dangerous, then try snagging some easy jungle camps (provided you have the lifesteal and damage to take them out quickly). Try to spot free farm: large minion waves pushed to your side lane towers.","replies":[{"poster":"Legendz Razor","date":"2014-11-04T09:51:47.981+0000","up_votes":1,"down_votes":0,"body":"oh man that was alot to read, thanks for the tips.","replies":[]}]},{"poster":"Zydron","date":"2014-11-02T06:15:38.119+0000","up_votes":2,"down_votes":0,"body":"The most important thing to remember is that you are not just an adc, (which technically could also be champions like {{champion:266}} {{champion:24}} {{champion:126}} {{champion:157}} {{champion:11}} etc....) but you are a RANGED adc. always remember you have range and to never be in melee range of ANYONE. the hardest thing about adc is that they all have different ranges, and you have to know your range to be truly effective. \n\nYou are also squishy af, so try not to put yourself in bad situations.\n\nMy fav adcs are {{champion:29}} {{champion:236}}  {{champion:18}} {{champion:96}}  cuz their ranges at times are op, but Twitch and Lucians range comes from their ults, not their autos (even tho Twitchs are autos -_-","replies":[]},{"poster":"StOrmysLIVE","date":"2014-11-04T22:10:04.172+0000","up_votes":1,"down_votes":0,"body":"[IMG]http://i57.tinypic.com/iz96c5.jpg[/IMG]\n\nJust showing some ashe love. Its because you don't have a safety escape skill, that you really have to learn how to position yourself (which is a skill you carry on to any other adc). You aren't trying to training wheel yourself into this, you want to learn how to adc right, and a no escape, high utility, high atk range adc will do it. Ignore what people say about the \"meta\"","replies":[]},{"poster":"The Chin","date":"2014-11-02T08:31:35.540+0000","up_votes":1,"down_votes":0,"body":"{{champion:18}}  easiest and one of the safest ADC's to learn.","replies":[{"poster":"Legendz Razor","date":"2014-11-03T06:14:01.081+0000","up_votes":1,"down_votes":0,"body":"ya gonna buy her with ip","replies":[{"poster":"Direwolfiez","date":"2014-11-03T08:00:32.250+0000","up_votes":1,"down_votes":0,"body":"You can get her for free if you like LoL on Facebook.  Go to her LoL Wiki page and you'll find a link to get her and a Riot Girl Tristana skin.","replies":[{"poster":"Legendz Razor","date":"2014-11-04T09:52:19.302+0000","up_votes":1,"down_votes":0,"body":"going to look into that thanks","replies":[]}]}]}]},{"poster":"Hyrum Graff","date":"2014-11-02T16:21:06.509+0000","up_votes":1,"down_votes":0,"body":"Ashe is good for learning, but I think caitlyn is probably the best adc for learning, because she's easy, safe, and VERY meta.\n\nThat said, my best recommendation for learning adc is to play support.\n\nAs a support, you just know when you have a good adc and when you have a bad one, and how to act with each (well, you learn to know all this with practice). You also learn when you wish your adc would ward, push, freeze, etc, based on who you're playing and how fed you/your opponents are.\n\nWatch your adcs, and figure out what makes the good ones, good, and the bad ones, bad. NOW go pick up adc. I promise it'll help you -- my adc mechanics are crap, but I do pretty well in lane because I'm able to work with my support (especially with vision - adcs who buy wards are the best).","replies":[]},{"poster":"GildedCreed","date":"2014-11-02T11:09:27.053+0000","up_votes":1,"down_votes":0,"body":"Start off with champs like Ezreal or Lucian who play similar to AP Burst Mages (AD equivalent would be AD Casters). Then slowly transition into the \"more common\" Crit based champs like Jinx, Ashe, etc. After that you can play champs like Miss Fortune or Graves, who build slightly different items (in MF's case, Frozen Mallet is viable for her ult, where Graves would build more damage-heavy over attack speed heavy crit items).","replies":[]},{"poster":"DrNova","date":"2014-11-02T09:11:11.516+0000","up_votes":1,"down_votes":0,"body":"First off, Kog and Twitch arent easy ADC's. Twitch a bit more, but Kog, you better have your positioning down pat.\n\nNow my ADVICE.  First off, a good deal of learning ADC, is learning all the ADC's and all the SUPPORTS to some degree.  Knowing what skills an enemy ADC may use, and an enemy SUPPORT may use, are vital to you knowing how to stay alive, when to be aggressive, when to be sae.  Champ ranges and damages.  Part of that you can learn just by playing against them, but also as dude said, try them when they are free. Will help you even once you get a preferred adc.\n\nTIPS - Communication with your Support is vital. You guys MUST be on the same page. Let them know if your going to be aggressive, let them know if you want to hold back and farm. ect.\n\n-BE SURE YOUR WARDED. Especially if your pushing. Dont just assume Support is buying wards. If they are great, but if you need to as well, do it.  If they onlt throw one in the bush, make sure there is another in Tribush if your top, or farther up river if your bottom. The extra time knoowing when a gank is incoming is invaluable.\n\n-BE CAREFUL EXNTENDING LANE.  If your going to have a pushed lane, make sure you keep your mobility/escape skill ready. Dont OOM. Be sure your warded, this time above all. A gank when your pushed to far can really set you back hard.\n\n-KEEP MOVING. Alot if not all ADC's have some poke skill. Dont get hit by it. For that matter dont get hit by the supports either.  Keep moving, so  you cant easily be poked and dove on or forced B cause your low. Dont stand in one spot and hit creeps.\n\n-LAST HITTING. Ultra important, of course. ALSO, dont just auto hit every minion, if you werent aware of this, though I assume you are. If you dont need to push lane, dont. Freeze it and just farm gold.\n\n-DONT BE NEEDLESSLY AGGRESSIVE.  15 minions is a kill esssentially. Dont waste skills and resources poking and attacking enemies just to run out with no kills and a bunch of lost last hits.  You will end up behind.\n\nAll I can think of atm, I've had a few beers.","replies":[]}]}