{"poster":"laureano22","date":"2016-02-02T00:24:06.789+0000","title":"GG Server vamonos a dota 2 (Lag en Las)","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Arregla el server riot, no podemos seguir jugando asi con un server asi. Empezamos el 2016 s6 con tremendo lag. Pero ojo que todavia ellos tienen una solucion, saquemos mas skins y un campeon nuevo por que no????. Pero es temporal por que arreglan algo pero cagan otra cosa, dios mio. Es que a la final nos vamos a tener que ir a otro juego a pasar el rato. Podran decir que dota es tal cosa y que esto y que lo otro pero sin duda debe tener mejor server que el lol.\r\n\r\n#ArreglaElServerRiot","replies":[{"poster":"ONLYTALENT","date":"2016-02-02T00:37:37.022+0000","up_votes":1,"down_votes":0,"body":"Creo que antes de reclamar por algo\n\npreocupate por salir de bronce\n\n\nLlevo jugando algunos a単os este juego y nunca he tenido problema alguno con el LAG","replies":[{"poster":"laureano22","date":"2016-02-02T16:57:41.283+0000","up_votes":1,"down_votes":0,"body":"Lo siento creo que me equivoque xD. Creo que eras platino creo no se. xD","replies":[]},{"poster":"laureano22","date":"2016-02-02T16:53:33.213+0000","up_votes":1,"down_votes":0,"body":"Me lo dice alguien que es plata? ajajaj por favor no me hagas reir. Incluso hay mucho bronces que juegan mejor que un platino. Y tal vez no tengas problemas con el lag VOS. Pero hay mucha gente que si. Por sierto lo que dije en ese post es un sarcasmo de irnos a jugar al dota simplemente me parece absurdo que todavia no puedan arreglar el server de las. Saludos xD","replies":[]}]},{"poster":"RussianPony","date":"2016-02-02T00:28:47.955+0000","up_votes":1,"down_votes":1,"body":"Primero, esto se va a solucionar en algun momento, no van a dejar el servidor como esta. Creo que nunca paso algo de tal magnitud en este servidor, y de ser que paso es una vez cada mil a単os.\n\nSegundo, Riot LAS no es el que crea y saca Skins y Campeones nuevos, eso se hace y se dise単a en NA.\n\nTodo esto ya se va a solucionar, saludos.","replies":[{"poster":"laureano22","date":"2016-02-02T16:55:25.690+0000","up_votes":1,"down_votes":0,"body":"Espero que sea pronto, ya que venimos con esto hace como 10 mil a単os (sarcasmo). Saludos xD","replies":[]}]},{"poster":"Mascheranox","date":"2016-02-02T00:37:03.802+0000","up_votes":1,"down_votes":0,"body":"es una mierda loco siempre con el lag se van al carajo y nosotros somos los que les damos el sueldo comprando RP y o hacen una mierda","replies":[{"poster":"laureano22","date":"2016-02-02T16:54:40.871+0000","up_votes":1,"down_votes":0,"body":"La verdad que si. Yo espero que lo arreglen pronto no quisiera dejar de jugar al lol por el server man: Saludos xD","replies":[]}]},{"poster":"Yumeno Maki","date":"2016-02-02T00:46:58.814+0000","up_votes":1,"down_votes":0,"body":"yo no tengo lag xD?","replies":[{"poster":"laureano22","date":"2016-02-02T16:54:08.505+0000","up_votes":1,"down_votes":0,"body":"Me alegro, pero date cuenta que hay muchas mas personas con lag al igual que hay gente que no tiene. Saludos","replies":[]}]}]}