{"poster":"Alessandro","date":"2015-03-14T18:36:35.138+0000","title":"LoL-Account sinnlos gesperrt!","subforum":"Hilfe & Support","up_votes":1,"down_votes":3,"body":"Mein LoL-Account wurde wegen angeblichen nutzen von Drittprogrammen für 2 Wochen gesperrt, obwohl ich nie solche Programme genutzt habe. Ich habe schon mehrfach den Support angeschrieben diese sagten mir nur, dass ich solche Programme benutzt habe und ich jetzt meine Strafe absitzen muss und sollte ich weiterhin solche Programme benutzen führt es zu einer permanenten Sperre! Ich finde das so unfair das mein Account so sinnlos gesperrt wurde!!!!!!!!!!!!!\r\nBitte schreibt mal ob eure Accounts auch sinnlos gesperrt wurden.\r\nMfg Alessandro","replies":[{"poster":"Madchickendinner","date":"2015-03-14T19:16:09.900+0000","up_votes":3,"down_votes":2,"body":"Jop 90% Aller bestehenden Accounts wurden von Riiot 2 Wochen gesperrt. Bist also nicht der einzige :(","replies":[{"poster":"Yaxtee","date":"2015-03-14T19:18:36.146+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Madchickendinner,realm=EUW,application-id=7hciEY9w,discussion-id=AMzeNIVE,comment-id=0001,timestamp=2015-03-14T19:16:09.900+0000)\n>\n> Jop 90% Aller bestehenden Accounts wurden von Riiot 2 Wochen gesperrt. Bist also nicht der einzige :(\n\nDas ist schlichtweg übertrieben und nicht richtig^^","replies":[{"poster":"Madchickendinner","date":"2015-03-14T19:40:10.118+0000","up_votes":3,"down_votes":0,"body":"oh rly ?","replies":[]}]}]},{"poster":"BeebySoapx3","date":"2015-03-15T17:51:27.200+0000","up_votes":1,"down_votes":0,"body":"Ich hab genau das gleiche Problem und ich hab auch nichts gemacht oder installiert. Ich weiß ja nicht mal was so ein verdammter Zoomhack sein soll! Jetzt weiß ich gar nicht was ich machen soll, weil ich keine Ahnung habe wie ich das weg bekommen soll. Einfach nach den 2 Wochen weiter spielen ist ja auch nicht sinnvoll, weil die bestimmt wieder sagen das da was nicht korrekt ist!","replies":[]},{"poster":"Yaxtee","date":"2015-03-14T19:17:47.638+0000","up_votes":1,"down_votes":0,"body":"Riot überprüft schon ziemlich genau, wenn sie Banns vergeben.\nBenutzt du irgendwelche Makros, hast du Shortcuts für deine Tastatur, benutzt du Curse Voice, n Zoomhack oder ähnliches?","replies":[]},{"poster":"ÆonFox","date":"2015-03-14T18:58:12.630+0000","up_votes":1,"down_votes":0,"body":"Schau ganz genau nach ob du Treiberzusätze, eine Hotkeytastatur oder so hast, solche Sachen können dich teils gerechtfertigt, teils ungerechtfertigt belasten und so den Tempbann rechtfertigen, Riot ist inzwischen gut darin Drittanbieterprogramme zu erkennen und zu ahnden, achte darauf nicht versehentlich den Verdacht zu wecken, davon ausgegangen das du die Wahrheit sagst...\n\nSinnlos ist hier höchstens dein QQ\n\nSitz die Strafe ab, überprüfe alles genau und hab dann wieder Spass beim LoLspielen.\n\nGruß Fox","replies":[]}]}