{"poster":"Kalo1992","date":"2016-11-09T23:01:25.079+0000","title":"Flamming e Feeding","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Ragazzi io non so se son l&#039;unico a trovarmi certe persone in team, mi sembra impossibile!...o trovo i troll oppure trovo i flammatori professionisti!, vi racconto l&#039;ultima che mi &egrave; successa perch&egrave; ha dell&#039;incredibile.\nho trovato una ashe premade con il mid laner,io ero supp con alistar, e come tutte le volte aiuto il jungler( mentre la mia ashe era in lane) e dopo vado in lane, vado sui minion e uso le stack per ridargli salute, l&#039;avessi mai fatto... ha cominciato ad offenmdermi dicendo che gli rubavo il farm, che dovevo morire, che la mia famiglia doveva morire, mi augurava dei tumori e altre cose che evito di dire...io sono rimasto basito...nemmeno stessi trollando o rubandogli il farm...io mi auguro presto che certa gente venga bannata, perch&egrave; rovinano completamente il gioco... E per piacere Riot fate QUALCOSA PER QUESTA GENTAGLIA!!!!! LA GENTE NON NE PUOLE PI&ugrave; DI QUESTI ESSERI!\nP.S il fenomeno mi ha anche reportato perch&egrave; diceva che lei aveva feedato perch&egrave; gli avevo &quot;rovinato&quot; il farm, ha finito 3/13 e il suo compagno 4/10 \n{{sticker:zombie-brand-facepalm}} GG","replies":[{"poster":"Frattaglia","date":"2016-11-09T23:30:36.101+0000","up_votes":1,"down_votes":0,"body":"Lamentele veramente da basso elo peraltro...\n\nMutali e reportali, cerca di ignorarli invece di dargli spago. Non ne vale la pena :-/\n\nP.s. per cose molto gravi i ban e le punizioni scattano prima e in maniera più severa... penso che capirà presto.","replies":[{"poster":"Laiho88","date":"2016-11-10T09:32:16.644+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=UmI58Ex3,comment-id=0001,timestamp=2016-11-09T23:30:36.101+0000)\n\n> P.s. per cose molto gravi i ban e le punizioni scattano prima e in maniera più severa... penso che capirà presto.\n\nMa anche no, su sto punto non sarò mai d'accordo con te fino a che 2 player che conosco non verranno permabannati....sono stati talmente tossici (in una coop vs ia tra l'altro), ma talmente tossici ma talmente tossici che hanno preso report per abuso verbale, comportamento negativo, feed intenzionale (in coop chissenefrega) auguri di morte, cancro, razzismo, omofobia, offese a religioni varie, incitamento all'odio e al terrorismo  e stanno ancora in giro, sono stati talmente schifosi che a distanza di 1 anno e mezzo ricordo ancora molto bene i nick, e ancora non sono permabannati.....capisco che sono necessari vari report prima di procedere al ban, ma tutto ha un limite e quando si supera il permaban DEVE ESSERE IMMEDIATO, anche sul singolo game, A PRESCINDERE DALLA MODALITA' DI GIOCO.","replies":[{"poster":"Ardens33","date":"2016-11-10T13:49:15.360+0000","up_votes":1,"down_votes":0,"body":"Scusa ma tu hai tipo la blacklist aggiornata a ogni game? A meno che non siani sempre gli stessi di cui parli","replies":[{"poster":"Laiho88","date":"2016-11-10T14:35:42.871+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ardens33,realm=EUW,application-id=MJVj50Jw,discussion-id=UmI58Ex3,comment-id=000100000000,timestamp=2016-11-10T13:49:15.360+0000)\n>\n> Scusa ma tu hai tipo la blacklist aggiornata a ogni game? A meno che non siani sempre gli stessi di cui parli\n\nblacklist aggiornata + block notes con la lista dei nick da riportare a fine di ogni game :D:D:D Se dimentico di reportare mi sento male :D:D","replies":[{"poster":"Ardens33","date":"2016-11-10T20:14:46.500+0000","up_votes":1,"down_votes":0,"body":":/ si.... ma se ne reincontri uno che ha flammato 257  game fa, quel game non flamma e lo report succedono 2 cose, 1 falsi il sistema. se ha flammato una vola 247 game fa e basta non dovresti farlo bannare 1 mese dopo a random infatti la riot ha inventato un sistema per prevenire questo genere di cose il che ci porta al puno 2:\nreportando a vuoto, i tuoi report hanno perso valore, ergo nessuno di quelli reportati da te verrà mai realisticamente bannato,edè il motivo per cui spesso ti lamenti che la gente \"non viene bannata\n\nin sintesi più reporti  (a caso)  più i tuoi report perdono valore e la gene non viene bannata, paradossale non trovi?","replies":[{"poster":"Laiho88","date":"2016-11-10T20:45:49.624+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ardens33,realm=EUW,application-id=MJVj50Jw,discussion-id=UmI58Ex3,comment-id=00010000000000000000,timestamp=2016-11-10T20:14:46.500+0000)\n>\n> :/ si.... ma se ne reincontri uno che ha flammato 257  game fa, quel game non flamma e lo report succedono 2 cose, 1 falsi il sistema. se ha flammato una vola 247 game fa e basta non dovresti farlo bannare 1 mese dopo a random infatti la riot ha inventato un sistema per prevenire questo genere di cose il che ci porta al puno 2:\n> reportando a vuoto, i tuoi report hanno perso valore, ergo nessuno di quelli reportati da te verrà mai realisticamente bannato,edè il motivo per cui spesso ti lamenti che la gente &quot;non viene bannata\n> \n> in sintesi più reporti  (a caso)  più i tuoi report perdono valore e la gene non viene bannata, paradossale non trovi?\n\ndire che ho la blacklist era ironico:D:D:D Non ricordo mica i nick di quelli che mi hanno flammato :D:D:D:D e il block notes mi serve solo per il singolo game, per ricordarmi che a fine partita devo reportare tizio e caio, non è che mi metto a controllare a ogni game chi sono i player ( dimenticare di reportare tizio che mi ha flammato per tutta la partita è imperdonabile, è capitato e mi sono sentito preso per il culo da solo) :D:D:D:D:D\nCmq da quando reporto a manetta gli avvisi di gente che è stata punita è aumentata a dismisura....Faccio un esempio. uno mi scrive \"rekt\", faccio una semplice analisi:\nil rekt è qualcosa di\n1- positivo\n2-negativo\n3-neutro\n\nNeutro non può essere in quanto ha un significato ben preciso, quindi il significato può essere solo positivo o negativo e in questo caso è negativo, quindi scatta il report :D:D:D:D:D:D:D Ovvio non me la prendo col semplice rekt, tuttavia se posso reportare perché non dovrei farlo?","replies":[{"poster":"Ardens33","date":"2016-11-10T21:57:59.043+0000","up_votes":1,"down_votes":0,"body":"perchè reporta per giocare non giocare per il report. cioè se hai deto che non te la prendi appunto perchè dovresti reportare? se uno ha fatto una bella outpplay e lo scrive in chat ci sta dai un po di ironia no? \nnel senso dalla tua ultima frase si evince che quasi provi piacere a reportare per il solo gusto di farlo,secondo me dovresti essere un po' meno vigilantes e prendere gli \"insulti\" in modo diverso, io un rekt lo prendo con mola autoironia, se mi ha rektato è perchè pochi secondi prima ero in una sitauzione di vantaggio che non ho saputo sfruttare e l altro se l' è giocata meglio, voglio dire ci sta x)","replies":[{"poster":"Laiho88","date":"2016-11-11T08:45:07.807+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ardens33,realm=EUW,application-id=MJVj50Jw,discussion-id=UmI58Ex3,comment-id=0001000000000000000000000000,timestamp=2016-11-10T21:57:59.043+0000)\n>\n> perchè reporta per giocare non giocare per il report. cioè se hai deto che non te la prendi appunto perchè dovresti reportare? se uno ha fatto una bella outpplay e lo scrive in chat ci sta dai un po di ironia no? \n> nel senso dalla tua ultima frase si evince che quasi provi piacere a reportare per il solo gusto di farlo,secondo me dovresti essere un po&#x27; meno vigilantes e prendere gli &quot;insulti&quot; in modo diverso, io un rekt lo prendo con mola autoironia, se mi ha rektato è perchè pochi secondi prima ero in una sitauzione di vantaggio che non ho saputo sfruttare e l altro se l&#x27; è giocata meglio, voglio dire ci sta x)\n\nGli scrivo WP nice play e mi scrive fuck u noob.....Capita spesso che mi congratulo e vengo insultato.....La community è tutta uguale, chi ti scrive rekt per ironia è anche in grado di darti del noob e di scriverti EZ a fine partita......Basta poco per capire chi hai davanti....\n\nI sono del parere che se prendi un account a caso, un qualsiasi account random (e mi ci metto anche io) e lo permabanni, non ti sbagli mai.....","replies":[{"poster":"Ardens33","date":"2016-11-11T21:15:36.337+0000","up_votes":1,"down_votes":0,"body":"ma scusa vorrsti essre permabannato ? :o io scrivo rekt se rekto, se l altro si congratula sempre \"ty dude\"","replies":[{"poster":"Laiho88","date":"2016-11-12T08:33:56.726+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ardens33,realm=EUW,application-id=MJVj50Jw,discussion-id=UmI58Ex3,comment-id=000100000000000000000000000000000000,timestamp=2016-11-11T21:15:36.337+0000)\n>\n> ma scusa vorrsti essre permabannato ? :o io scrivo rekt se rekto, se l altro si congratula sempre &quot;ty dude&quot;\n\nnon mi hai capito, sono io che mi congratulo e puntualmente rispondono male.....per questo sto gioco mi sta scocciando.....\nLa community è talmente tossica che anche chi fa un complimento viene offeso male.....Siamo arrivati al delirio assoluto.....","replies":[{"poster":"Ardens33","date":"2016-11-12T10:16:07.116+0000","up_votes":1,"down_votes":0,"body":"nono avevo capito. intendevo che non sempre su uno esterna la sua mainanza in chat è per forza incivile","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"uFere","date":"2016-11-10T16:02:06.500+0000","up_votes":1,"down_votes":0,"body":"Sai com'è, un minion vale, un minion, UNO, gli altri può missarli tutti, tanto il flame lo beccano i support, mica gli adc che flammano, giusto no?\nIn certi momenti quando gioco supp, mi viene voglia di andarmene a rommare e aiutare le altre lane invece che ascoltare uno che mi augura le peggiori cose, certi adc hanno seri problemi nel capire che il support è la loro ancora di salvezza, se il support decide di non supportare più a causa del flame, loro saranno un ammasso di pixel morti dato che giocheranno 1vs2/3","replies":[]},{"poster":"xMCM","date":"2016-11-10T10:36:34.720+0000","up_votes":1,"down_votes":0,"body":"Avresti dovuto semplicemente mutare questi bruchi. Ricordati che ci sono 16.000.000 di post uguali e questo, anche in inglese.","replies":[]},{"poster":"Dr LouD","date":"2016-11-10T09:56:53.109+0000","up_votes":1,"down_votes":0,"body":"Io gli avrei detto: READ MY FUCKING SUPPORT ITEM YOU BOOSTED APE \n\nGiusto per non esser tossico.","replies":[]},{"poster":"Sorcio84","date":"2016-11-10T03:52:03.496+0000","up_votes":1,"down_votes":0,"body":"Anche a me è successo.\nDiciamo che ho trovato la risposta a certi comportamenti.\nPrendi il caso, di quando entri in dynamoQ e devi scegliere il ruolo.\nMid ti dice che servirà più tempo, supp e fill invece ridurranno il tempo di coda.\nPerchè ? nessuno vuole giocare supp, e di conseguenza **ignorano altamente qualsiasi meccanica dei supp** a meno che tu non riesca a spiegargli cosa stai facendo. Questo si rifà anche alle attive/passive di alcuni item.\n\nSono loro ad essere ignoranti, porta pazienza e prova a spiegargli come funziona, se non ti ascoltano, mute, e continua a far eil tuo lavoro usando i ping. Se loro vanno mad e fanno gli ebeti, non è colpa tua.","replies":[]},{"poster":"DoubleT","date":"2016-11-09T23:23:43.243+0000","up_votes":1,"down_votes":0,"body":"Flamer peraltro molto ignorante visto che i minion che uccidi con le stack del relic hanno epserienza e gold condivisi, quindi contano come se li aveste farmati entrambi XD\n\nTi capisco non sei il solo, anche io a suo tempo ne ho ricevute di flammate per questo motivo...un bel mute e passa tutto.","replies":[]}]}