{"poster":"GarviD","date":"2019-04-06T15:59:14.836+0000","title":"Como se supone que subire de liga si...","subforum":"Charlas Generales","up_votes":3,"down_votes":5,"body":"Si los champs estan rotisimos.. absurdo que un urgot me delete con un orn full tanque como si fuera un adc... trolls, gente que muere y te culpa a vos xD cada partida va a peor en este servidor... Como se supone que puedo subir de liga si tengo la partida encontra desde el principio??? cuando rito va a hacer algo???\r\n\r\nAyuda pls!!","replies":[{"poster":"Shirotani","date":"2019-04-06T16:46:12.103+0000","up_votes":1,"down_votes":0,"body":"> Si los champs estan rotisimos.. absurdo que un urgot me delete con un orn full tanque como si fuera un adc... \n\nSi según vos los champs están rotísimos, entonces jugá con esos para subir...\n\nhttps://i.imgur.com/H7QTD8x.gif?nodirect","replies":[{"poster":"GarviD","date":"2019-04-06T19:46:06.162+0000","up_votes":1,"down_votes":3,"body":"No los se usar o no me interesan.","replies":[{"poster":"Shirotani","date":"2019-04-06T19:56:31.599+0000","up_votes":1,"down_votes":0,"body":"Y bueno, entonces no te queda otra que mejorar o seguir cómo ahora poniendo excusas...","replies":[{"poster":"GarviD","date":"2019-04-06T21:00:45.645+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Shirotani","date":"2019-04-06T21:29:22.364+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=GarviD,realm=LAS,application-id=v7qsfXsE,discussion-id=YVgt2Efa,comment-id=0001000000000000,timestamp=2019-04-06T21:00:45.645+0000)\n>\n> Naa, si es que este servidor tiene gente pelotudaza... dale padre seguí defendiendo esta mierda de server xD\n\nNo sé en qué parte de lo que escribí estoy defendiendo el server... y aparte de eso en ningún momento te insulté.\n\n---\n\nEn cuánto al cry post:\n\n¿Pensás que sos el único al que le tocan trolls, afks o feeders?, de hierro hasta retador los hay y eso pasa en cada uno de los servidores, y aún así se puede subir, si ese no es tu caso, te falta mejorar (viendo tu historial de partidas se nota claramente). Pero bueno, es más fácil echarle la culpa al otro que tratar de mejorar uno mismo.\n\n\nSaludos!","replies":[]}]}]}]}]},{"poster":"Ad hominem","date":"2019-04-06T18:29:15.119+0000","up_votes":3,"down_votes":0,"body":"Cuando te pones a jugar ranked apenas subiste a lv 30...","replies":[{"poster":"GarviD","date":"2019-04-06T19:47:15.875+0000","up_votes":1,"down_votes":3,"body":"El 30 era el limite cuando me fui de jugar porque me pudri","replies":[]}]},{"poster":"r1mS","date":"2019-04-06T16:40:16.040+0000","up_votes":4,"down_votes":1,"body":"Típico que cree que debería estar en challenger, lol.","replies":[{"poster":"GarviD","date":"2019-04-06T19:45:29.568+0000","up_votes":1,"down_votes":4,"body":"No, simplemente me gustaria una partida ajustada a mi habilidad y subir gracias a esta... no le veo el sentido al elo bust","replies":[{"poster":"Deigex","date":"2019-04-13T12:47:04.655+0000","up_votes":1,"down_votes":0,"body":"Si no subis entonces es porque no tenes la habilidad para hacerlo,  se llama soloq es decir que del unico que podes esperar algo es de vos y a lo sumo de tu duo.  Carrea o no subas, salgo de tu liga trolleando con braum jungla full efectos de impacto..","replies":[{"poster":"GarviD","date":"2019-04-17T20:22:24.675+0000","up_votes":1,"down_votes":0,"body":"Man, aunque se llame solo q dependes de otros 4 que si se ponen en contra no carreas ni siendo faker... no jodas man si el 80% de las partidas si no mas no te toca un team decente ni de casualidad... ami dame a otros 4 compañeros que sepan jugar y sepan lo que hace un jg y yo voy a la par y ganamos... pero si ya de primeras me toca un team que muere y automaticamente te culpan a vos y ya empiezan a trollear y flamear....","replies":[]}]}]}]},{"poster":"bombastico","date":"2019-04-06T18:35:35.124+0000","up_votes":1,"down_votes":0,"body":"¿Y los que suben crees que lo hacen por arte de magia?","replies":[{"poster":"GarviD","date":"2019-04-06T19:47:34.855+0000","up_votes":1,"down_votes":3,"body":"Y seguro tienen mas tiempo que yo para jugar... yo trabajo xD","replies":[{"poster":"bombastico","date":"2019-04-07T15:23:18.831+0000","up_votes":1,"down_votes":0,"body":"Yo igual, por lo que el impedimento para subir es que nos falta practica para estar a la par con los demas jugadores.\nNo es necesario echarle la culpa a los demás.","replies":[{"poster":"GarviD","date":"2019-04-13T10:51:26.973+0000","up_votes":1,"down_votes":2,"body":"Man, no juego nunca y juego mejor que lvl 200 es que dan pena que se pasen todo el dia jugando y no sepan ni farmear xD","replies":[{"poster":"Deigex","date":"2019-04-13T12:50:23.133+0000","up_votes":3,"down_votes":0,"body":"Vos farmeamdo 4 minions por min se supone sabes farmear? XD","replies":[{"poster":"GarviD","date":"2019-04-17T20:20:20.250+0000","up_votes":1,"down_votes":0,"body":"Yo no soy liner, no me interesa farmear. y cuando voy linea trato de farmear lo mejor posible... aun asi hay mains adc nivel 200 que farmean horrible...","replies":[]}]}]}]}]}]},{"poster":"WhiteMax","date":"2019-04-06T17:41:54.536+0000","up_votes":1,"down_votes":0,"body":"Si tu problema son los campeones, banealos o juegalos tu.\n\nSi tu problema es que no te toca un team que te carree, aprende a carrear o no juegues rankeds.","replies":[{"poster":"GarviD","date":"2019-04-06T19:46:58.139+0000","up_votes":1,"down_votes":3,"body":"No quiero que me carren, pero tampoco el anticarro","replies":[]}]},{"poster":"Shíru","date":"2019-04-06T17:25:03.877+0000","up_votes":1,"down_votes":0,"body":"Pues sube como todos lo hacen, carreando","replies":[{"poster":"GarviD","date":"2019-04-06T19:46:34.690+0000","up_votes":1,"down_votes":2,"body":":O como no se me ocurrio. que genio que sos chabon increible con tu consejo seguro me vuelvo challenger y hasta rioter","replies":[]}]}]}