{"poster":"GarviD","date":"2016-08-18T19:41:22.857+0000","title":"Vale la pena saber jugar todas las lineas?","subforum":"Charlas Generales","up_votes":7,"down_votes":1,"body":"Siempre me hice esa pregunta, hasta que un dia que no podia dormir, mirando el techo me puse a pensar, de supp aprendes a mirar el mapa, preocuparte por alguien mas que vos, la vicion y objetivos. De adc aprendes a pararte, cuando tradear a estar siempre con tu team. De top, te concentras en farmear, en estar atento para los tp, al estar solo con un enemigo aprendes a leer que va a hacer, que harias tu en su lugar. De jg aprendes a ayudar a todos por igual, toma de desiciones cruciales de objetivos y prioridades. Y de mid? diganmelo ustedes xD completenmen esta parte. Yo siempre trate saber jugar un poquito de todo, antes por obligacion y ahora por mejorar.","replies":[{"poster":"ThisCharmingMann","date":"2016-08-18T19:53:38.320+0000","up_votes":6,"down_votes":0,"body":"Como mid tenés que estar más pendiente del mapa y aprendés a ver al jg enemigoy  a estar pendiente del tuyo, porque sos la línea más fácil de gankear (por eso se estila que vaya un mago, que tienen más opciones de cc), sos la línea por la que van cuando bajan una torreta los enemigos, sos quien está a la misma distancia del dragón que del barón y lo más importante, que sos el único que puede ayudar a otra línea cuando el jg no está/no puede/está en otra línea; ejemplo: bot está siendo gankeado y corren a la jungla, pero tu jg está en top gankeando (y ganando?); obvio es el mid quien tiene que salir a ayudar a los de bot para que esa victoria en top no se arruine con la derrota en bot, aunque ayudar no es conseguir una kill, sino asegurar que escapen.\n Ah, y aprendés por qué tanta gente odia a Zed.","replies":[{"poster":"zelaya19","date":"2016-08-18T20:04:57.610+0000","up_votes":1,"down_votes":0,"body":"Y al soporte enemigo también hay que estar atento por el roaming que pueden realizar. Que te aparezca un Blitz por atrás o Bard con el jungla por un tunel mínimo es un destello gastado o incluso morir.","replies":[]}]},{"poster":"Borriic II","date":"2016-08-18T20:58:30.736+0000","up_votes":6,"down_votes":2,"body":"te dejaste algunas cosas mi bro xD ademas de todo lo que ya pusiste\n\nde SUP: aprendes a hacer peel, aprendes a hacer los calls y leer los calls rivales, aprendes a hostigar al contrario y en parte a timear los subditos y calcular el daño de estos (ya que no estas enfocado en farmear se facilita mucho)\n\nde ADC: aprendes a farmear evitando el daño gratis, aprendes a hacer daño gratis, aprendes a compensar daño con farm y si tienes la madurez suficiente aprendes (a la mala) a tomar la mejor decision para el team en cuanto a objetivos... aun me duele ver vaynes platino+ que persiguen una kill en vez de enfocarse en el baron cuando el jg rival esta muerto\n\nde TOP: aprendes a respetar realmente a los subditos (siendo melee el daño que te comes por meterle una piña al rival en una mala posicion a lvl 2 te lo encargo), aprendes a estar siempre atento a la vida de tus aliados y al movimiento en la botlane, dominas el split y comienzas a relacionarte con las rotaciones basicas del juego\n\nde JG: creo que ya lo dijiste todo, quizas tambien dominar el tracking se puede aprender siendo jungla\n\ny de MID: de mid tenes que aplicar TODO lo de las otras lineas y a eso sumarle que debes saber leer todas las posibilidades que te da el mapa; el jg rival esta campeando top? dale jungla y bot nos hacemos el draco pero ya; el jg acaba de pasar por mi linea es minuto 3 y no tenia red, ping al rojo rival y le caes con tu jg FIRST BLOOD casi segura, el mid rival se fue a gankear bot, el jungla rival tambien y no tengo la movilidad suficiente para seguirlos... seria una pena si alguien decidiera botarles sus 2 lindas torres de mid, mi top es un hyper carry como jax nasus o fiora ¿Y que hago yo aqui perdiendo mi tiempo como sub.normal tratando de feedearme? deberia tener una cabaña en la toplane... junto a la del jungla y subirnos despues al carrito y asi un largo etc\n\nlamentablemente la midlane se ha vuelto un nido de ratas donde todos \"mainean\" zed/yasuo pero no tienen ni pico idea de las rotaciones mas basicas de los midlaners, mid es la linea mas dificil y la que suelen jugar los peores jugadores (fuera del ambito del high elo obvio, donde por lo general el mid es el 1°/2° mejor del team)","replies":[{"poster":"FedecarboneroUY","date":"2016-08-19T15:48:15.452+0000","up_votes":1,"down_votes":1,"body":"Mid es la línea más difícil? {{sticker:slayer-pantheon-popcorn}}","replies":[]}]},{"poster":"Auren Seven","date":"2016-08-18T22:09:24.854+0000","up_votes":2,"down_votes":0,"body":"Yo creo que si, por el hecho de ver el juego de distintas formas y asi comprender mas las situaciones que pasan.","replies":[]},{"poster":"Vaendrys","date":"2016-08-19T00:40:53.375+0000","up_votes":1,"down_votes":0,"body":"Juga {{champion:4}} ,y vas a tener que hacer todo eso.","replies":[]},{"poster":"iTzFacu20","date":"2016-08-19T00:16:23.318+0000","up_votes":1,"down_votes":0,"body":"Si vos no jugas Normal Seleccion oculta,NO.","replies":[]},{"poster":"Uli con azúcar","date":"2016-08-18T22:28:35.813+0000","up_votes":1,"down_votes":0,"body":"Depende de tu personalidad igual. A la mayoría nos gusta jugar todas las posiciones y con distintos campeones y estilos. Pero hay muchos que por ahí disfrutan jugar siempre una posición y más aún con un solo champ.\nSi sos de los primeros mandale mecha nomás, vas a disfrutar muchísimo del juego","replies":[{"poster":"GarviD","date":"2016-08-18T23:26:54.709+0000","up_votes":1,"down_votes":0,"body":"Soy de los que les gusta jugar todo con todos lso pj, asi ni sepa usarlos, eso si, si soy nuevo en la line y el pj muteo a todos xD","replies":[]}]},{"poster":"Hnk Kenshiro","date":"2016-08-18T19:54:58.156+0000","up_votes":1,"down_votes":1,"body":"El roaming supongo.\n\nMi linea más complicada es adc, farmeo mal, pierdo trades, me siento con poca vida y poco daño y siento que mi soporte no sabe jugar ( :P )\n\nJuego principalmente soporte y Jg, top y mid me mantengo, adc o no hago nada o fedeo (Exepto cuando cierta personita me suportea).","replies":[{"poster":"Seven Teemo Army","date":"2016-08-18T22:20:12.152+0000","up_votes":1,"down_votes":0,"body":"Yo aprendi a jugar de adc con estos consejos: farmea mucho, pegale siempre al enemigo que tengas mas cerca en tf, quedate siempre atras, no vale la pena tirarse 1v5 para hacerle focus al adc, si tenes dos enemigos igual de cerca pegale al mas blandito y si ves que se esta por morir todo tu equipo escapate a defender como puedas, acorate de que estar vivo es lo mas importante de todo.","replies":[{"poster":"Hnk Kenshiro","date":"2016-08-18T22:27:10.220+0000","up_votes":1,"down_votes":0,"body":"Si, yo siempre trato de pegar sin que me peguen, al más cercano y a la distancia, pero no se me da, asi que aprendo con adc más faciles, como tristana.","replies":[]}]}]},{"poster":"zelaya19","date":"2016-08-18T20:09:32.043+0000","up_votes":1,"down_votes":0,"body":"Además de todo lo que dijeron también depende del rol que cumple tu mid.\n\nNo es lo mismo pickear a Lulu, un Azir o un Talon, tienen diferentes funciones dentro de la partida y no siempre se los puede pickear aunque solo Q es un mundo diferente. En general es de acuerdo a la composición de tu equipo (y el mid de enfrente también es un condicionante porque si tenés un counter te va a limitar a la hora de moverte en el mapa) aunque personajes como Orianna o Ahri se adaptan muy bien a la mayoría de las composiciones(Por no decir casi todas), con buen juego medio y tardío.","replies":[]},{"poster":"KarmaUnder","date":"2016-08-18T19:59:04.594+0000","up_votes":1,"down_votes":0,"body":"nunca lo habia pensado asi, yo a ver el mapa aprendi en top, gracias a tener que tener buena vision de mapa para poder tirar los tps cuando se deben, a tradear aprendi en top, los tradeos en top son constantes, todo el tiempo estas hostigando al otro o tratando de que no te hostigue y tratar de farmear siempre lo mejor posible, a ayudar y priorizar objetivos aprendi en top, esos tps le dan kills al adc  y un dragon a tu equipo, pero cuando volves a linea el enemio te saca un nivel, 20 minions y te tiro media torre, obvio que lo vale, pero te deja atras en lo que es fase de lineas.\nToma de deciciones la tienen todas las lineas a todo momento :P","replies":[]},{"poster":"GinTaicho","date":"2016-08-18T19:56:12.536+0000","up_votes":1,"down_votes":0,"body":"Pues es bien como lo dices, y al igual que tu la última linea que jugué fue mid xD\nSiento que es crucial estar **atento**, y esa palabra adquiere peso en todo, ya sea por los posibles ganks de cualquiera de los 2 lados del río, actuar a tiempo si el rival se lanza sobre ti (esto teniendo en cuenta que la mayoría de los campeones que van a mid son de daño explosivo y matar rápido), darte cuenta cuando un enemigo de prioridad esta mal posicionado, como un adc por ejemplo para acabarlo si se da la oportunidad, etc.\n\nBásicamente tu función es matar y/o hacer daño, lo demás depende del campeón que uses y lo que le puedas aportar a tu team. Si puedes matar seguidamente al adc o mid enemigo ya dejaste al otro equipo muy atrás respecto a daño.","replies":[]},{"poster":"xZeik","date":"2016-08-18T19:51:48.453+0000","up_votes":1,"down_votes":0,"body":"De mid aprendes lo que es el placer de deletear a alguien :v","replies":[]}]}