{"poster":"Officer Useless","date":"2018-03-11T18:37:23.558+0000","title":"Leaver Buster","subforum":"Hilfe & Support","embed":{"description":"Kostenlos Bilder hochladen. Bilder Upload ohne Anmeldung","url":"http://www.bilder-upload.eu/show.php?file=da5120-1520793422.jpg","image":"http://bilder-upload.eu/upload/da5120-1520793422.jpg"},"up_votes":1,"down_votes":0,"body":"Hallo wertes Riot Team,\n\nso bl&ouml;d wie ich war, hab ich ein Windows Update auf &quot;sp&auml;ter&quot; verschoben und es hat sich unverhofft selbstst&auml;ndig gemacht.\nDadurch bin ich nicht nur aus dem Spiel geflogen, sondern habe auch einen Leaver Buster aufgebrummt bekommen.\nDiesen nehme ich eigentlich ja gerne in kauf (bin ja schlie&szlig;lich selber Schuld an der Sache), nur habe ich das Problem, dass bei mir die Zeiten spinnen. Eigentlich sollte ich +20min Prio bekommen, sch&ouml;n und gut, nur ist es bei mir jetzt so, dass ich teilweise mehr angezeigt bekomme, als es sein sollte.\nIm Hauptfenster steht zum Beispiel noch 11 Minuten und rechts daneben das selbe, nur halt von 0 heraufgerechnet.\nWenn ich den Client jedoch nicht im Vordergrund habe, bleibt die Zeit im vorderen Fenster stehen, bzw verlangsamt sich.\nNun wurde ich, trotz &quot;Low Priority queue&quot; Fenster anscheinend doch in eine aktive Warteschleife gesetzt, nur wurde mir das nicht angezeigt, sodass ich jetzt zum dritten Mal die selben 20 Minuten zur Warteschleife warte.\n\nLieben Gru&szlig;\n\nOfficer Useless\n\n\nEDIT:\nOkay, habe gerade festgestellt, dass, sofern das Leaverbuster Fenster im Vordergrund ist und ich den Client im Hintergrund laufen lasse, der Client nicht automatisch wie sonst in den Vordergrund springt sobald ich in eine Queue eingereiht werde, sondern im Hintergrund bleibt.\n\nWahrscheinlich mein Fehler, habe halt umsonst jetzt eine Stunde auf eine neue Runde LOL warten müssen.\n\nSchönen Gruß noch","replies":[{"poster":"Gin","date":"2018-03-12T09:42:03.089+0000","up_votes":2,"down_votes":0,"body":"> Wahrscheinlich mein Fehler, habe halt umsonst jetzt eine Stunde auf eine neue Runde LOL warten müssen.\n\nJop. Einsicht ist der erste Schritt zur Besserung. Es ist dein PC, und deine Verantwortung. \n\nDu kannst einstellen dass die Windows Updates nicht automatisch heruntergeladen und installiert werden. (Und es dich nicht erinnern soll.)","replies":[]}]}