{"poster":"DELITTO DI COGNE","date":"2018-08-07T08:05:22.841+0000","title":"Piccoli blocchi del gioco durante il game","subforum":"Aiuto e supporto","up_votes":1,"down_votes":7,"body":"Buongiorno,\nho da poco cambiato pc. \nLe specifiche tecniche sono\nI7 8700k con dissipatore a liquido\nAsus rog strix z370e\nCorsair 2x8gb 3200hz\nSSD m.2 970 evo\nEVGA gtx770 -&egrave; quella del pc vecchio che non voglio ancora sostituire-\n\nWindows 10 \n\nFibra telecom 100gb, ping medio in game 30 fisso senza sbalzi.\n\nNiente, mentre gioco ogni tanto ho dei piccoli frozz in game che possono variare dai 2 ai 10 secondi, molto fastidiosi.\nSe alt-tabbo per&ograve; il pc va bene senza problema alcuno.\nLa cosa che noto &egrave; che la % di sfruttamento delle cpu &egrave; molto alta, sopra all&#039;85% per intenderci... cosa che con altri giochi [tipo overwatch] non mi accade.\n\nLe temperature dei core sono ottimali, la stanza dove gioco &egrave; molto calda... diciamo temperatura ambiente oltre i 30&deg; per&ograve; le cpu come temperatura non passano mai i 60&deg; e mediamente vanno dai 45 ai 55 gradi.\n\nPotete aiutarmi? Grazie in anticipo... saluti.\n\np.s. non ho mai avuto problemi con il mio vecchio pc che montava un modestissimo i7 2600k.\np.s.s. se dai dati che ho riportato, che a me sembran giusti, c&#039;&egrave; qualcosa di sballato fatemi sapere.\n\n{{champion:202}}","replies":[{"poster":"Diyoza","date":"2018-08-07T17:44:10.065+0000","up_votes":1,"down_votes":0,"body":"ma che nickname hahahahahaha degno di andare su degradoland","replies":[]},{"poster":"JLuke","date":"2018-08-07T17:39:40.842+0000","up_votes":1,"down_votes":0,"body":"Ciao! Scusa per la tarda risposta, durante questi micro-freeze senti dei rumori fastidiosi provenire dalle cuffie/altoparlanti?","replies":[]},{"poster":"bossuccio","date":"2018-08-07T08:57:02.806+0000","up_votes":1,"down_votes":0,"body":"Il tuo hardware va più che bene per giocare a LOL, e anche le temperature mi sembrano più che accetabili, visto che siamo in piena estate. A questo punto proverei a controllare se hai aggiornato i driver video/audio e farei anche un repair del client con lo strumento Hextech.","replies":[{"poster":"DELITTO DI COGNE","date":"2018-08-07T09:14:24.726+0000","up_votes":1,"down_votes":0,"body":"E' la stessa cosa che mi ha scritto un rioter privatamente come risposta alla mia richiesta di supporto... \nOnestamente non capisco a cosa possa servire un repair visto che ho installato lol domencia sera... comunque proverò","replies":[{"poster":"TheViceroys","date":"2018-08-07T09:16:44.703+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DELITTO DI COGNE,realm=EUW,application-id=98NGV4Al,discussion-id=AYpExEcP,comment-id=00000000,timestamp=2018-08-07T09:14:24.726+0000)\n>\n> E&#x27; la stessa cosa che mi ha scritto un rioter privatamente come risposta alla mia richiesta di supporto... \n> Onestamente non capisco a cosa possa servire un repair visto che ho installato lol domencia sera... comunque proverò\n\nLoL pesa più di 10Gb di file è possibile che durante il download un file si sia corrotto ciò può comportare colpi di FPS dato che il PC deve elaborare una scappatoia per  arginare l'errore\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"DELITTO DI COGNE","date":"2018-08-07T09:31:01.167+0000","up_votes":1,"down_votes":0,"body":"magari fosse così, ci farei al firma","replies":[{"poster":"bossuccio","date":"2018-08-07T09:56:15.492+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DELITTO DI COGNE,realm=EUW,application-id=98NGV4Al,discussion-id=AYpExEcP,comment-id=0000000000000000,timestamp=2018-08-07T09:31:01.167+0000)\n>\n> magari fosse così, ci farei al firma\n\nahahaahah mica avevo visto il tuo nome evocatore! XD comunque guardando la tua match history, ho notato che hai fatto un solo match 2 giorni fa e nulla più, magari era un problema \"momentaneo\", prova a farti una partita contro i bot e vedi come va, se è tutto okkei torni a giocare PvP, facci sapere ;)","replies":[{"poster":"DELITTO DI COGNE","date":"2018-08-07T10:18:55.790+0000","up_votes":1,"down_votes":0,"body":"Certo... non posso rischiare di prendermi dei report... anche perché durante alcuni blocchi prolungati ho dovuto chiudere e riaprire il client.\n\nHo provato con la training mode anche ieri.... mettendo 2 pupazzi sotto le torri [per creare aggro] e il problema si verificava lo stesso\n\nedit- avevo aperto un ticket e mi hanno detto di dover cambiare nome... rip DELITTO DI COGNE {{champion:105}} ","replies":[{"poster":"bossuccio","date":"2018-08-07T13:24:09.951+0000","up_votes":1,"down_votes":0,"body":"ahahahahaah alla fine il problema più importante era il nick e non il fatto che tu avessi difficoltà in game?! ma LOL!","replies":[]}]}]}]}]}]}]}]}