{"poster":"Lederhosn","date":"2015-05-05T19:13:18.018+0000","title":"meine tattoos","subforum":"Community-Kunstwerke","up_votes":2,"down_votes":2,"body":"was haltet ihr von meinen tattoos","replies":[{"poster":"FailerOfWorld","date":"2015-05-05T20:40:04.480+0000","up_votes":1,"down_votes":0,"body":"Ich finds iwie klasse :D Natürlich nerdig und du willst es in ein paar jahren wieder lossein, aber ich finds toll :D","replies":[{"poster":"Kiun","date":"2015-05-11T22:44:03.730+0000","up_votes":5,"down_votes":0,"body":"LoL ist ein wichtiger Teil seines Lebens, damit verbringt er viel Zeit wie andere es mit Fußball oder sonstwas machen.\n\nEine Erinnerung an sein Hobbie bei sich zu haben ist doch nice :)","replies":[]},{"poster":"eingew","date":"2015-05-11T22:34:53.492+0000","up_votes":3,"down_votes":1,"body":"Wieso sollte man die wieder loswerden wollen? Sind doch hübsch.","replies":[{"poster":"FailerOfWorld","date":"2015-05-12T07:47:27.512+0000","up_votes":1,"down_votes":0,"body":"Hab auch nicht gesagt dass es nicht hübsch sei, aber stell dir mal einen 60jährigen mit Gaming Tatoos vor. Ist vielleicht mal Alltag aber ich persönlich finde das etwas strange (ohne jedoch den OP angreifen zu wollen) ;)","replies":[{"poster":"eingew","date":"2015-05-12T09:15:08.345+0000","up_votes":2,"down_votes":1,"body":"Ich wüsste nicht, was daran falsch wäre :P Wir sind alle strange, mansche schmieren sich Pampe ins Gesicht um besser auszusehen, andere kriechen unterwürfig durch die Gegend um ein letztendlich nutzloses Ziel zu erreichen, was ist dann an Tattoos besonders? (Letztendlich hat es dann auch eine ähnliche Funktion wie Makeup, nur eben langlebiger.)","replies":[]}]}]}]},{"poster":"Ariya","date":"2015-05-11T22:23:44.658+0000","up_votes":4,"down_votes":1,"body":"Renekton gefällt mir auch am besten! {{champion:58}}","replies":[]},{"poster":"dugg","date":"2015-05-21T10:53:07.922+0000","up_votes":2,"down_votes":0,"body":"Wenn sie dir nicht mehr gefallen sollten, dann kannst du 3 davon im LoL-Shop zurückgeben. ^^;;\n\nWirklich klasse! Ich liebe Comic-Tattoos! Kata ist qualitativ leider nicht so gut und ob man es mag oder nicht, ist halt Geschmackssache. Ich finde es super!","replies":[]},{"poster":"roseBRA","date":"2015-06-20T13:08:40.084+0000","up_votes":1,"down_votes":0,"body":"Ich will ja niemandem zu nahe treten, aber einige Linien sind sowas von schief.. unabhängig von dem Motiv sieht das wirklich banane aus stellenweise. Zum Beispiel Veigars Augen.","replies":[]},{"poster":"BiBaButz","date":"2015-06-03T14:26:59.827+0000","up_votes":1,"down_votes":0,"body":"sind alle 3 fotos von dir? oder hast du die nur gestochen?\nWeil sehen nicht so aus als währen die für die ewigkeit, eher wie abziehtattoos von kleinkindern :P\n\nSind aber echt gut, egal ob perma oder abziehbild","replies":[]},{"poster":"Groath","date":"2015-05-17T12:54:03.491+0000","up_votes":1,"down_votes":0,"body":"Es ist so schön, zu sehen, wie viel League of Legends in den Spielern auslösen kann! Sich Tatoos zu machen ist eine ziemliche Liebeserklärung und unser Freund hier scheint über beide Ohren verknallt zu sein.\n\nDass du dich so mit dem Spiel und der Community identifizierst, es auf diese Art herausposaunst und sicher nicht selten angesprochen wirst zeigt, welche Passion dahintersteckt. Deine Tattoos sind Klasse!\n\nUnd zu einigen Menschen, die sich keinen 60-Jährigen mit Gaming-Tattoos vorstellen können... Ich werde solange ich Maus und Tastatur bedienen kann ein Gamer sein. Ich werde als Rentner meinen Tag in Sport, Essen, Schlafen und Gaming einteilen. Weder habe ich mich jemals dafür geschämt, Gamer zu sein, noch werde ich mich jemals dafür schämen. Es wird viel von wegen \"Du musst professionell aussehen, du darfst keine außergewöhnlichen Hobbies haben\" geredet, aber wenn ihr euch so für einen Arbeitgeber verstellen und verstecken müsst, dann solltet ihr wirklich mal euren beruflichen Werdegang überdenken. Vielleicht ist diese altmodische Firma, die nicht mit dem Lauf der Zeit mithalten kann nichts für euch. Für mich wäre sie nichts. Ich habe meine heutigen Skills erlangt durch meine Vergangenheit, durch meine Hobbies und Interessen. Ich verstecke diese nicht. Wahrscheinlich würde ich mir eher mit 60 ein paar Tattoos stechen lassen. Glurak, Shenron und Katarina in der engeren Auswahl :D","replies":[]},{"poster":"SwissKeks","date":"2015-05-05T20:26:09.201+0000","up_votes":1,"down_votes":0,"body":"Renekton sieht gut aus, Teemo und Fiddl eher weniger.. Wie viel hats gekostet?\n\nIch weiss, es ist sicher nicht die beste Idee ein Tatoo von einem Spiel zu machen was man in ein paar Jahren nicht mehr spielt aber Hey! Warum nicht? :D","replies":[{"poster":"Lederhosn","date":"2015-05-05T21:40:27.472+0000","up_votes":1,"down_votes":0,"body":"die ganze rechte hand 3500€","replies":[{"poster":"Lederhosn","date":"2015-05-05T21:41:22.795+0000","up_votes":1,"down_votes":0,"body":"hab leider noch kein foto von der ganzen","replies":[{"poster":"OrangeBubble","date":"2015-05-17T12:30:56.230+0000","up_votes":1,"down_votes":0,"body":"Veigar sieht so nice aus :)\nDas Kata Tattoo mag ich nicht :C","replies":[]}]}]}]},{"poster":"XOFree","date":"2015-05-06T01:26:51.663+0000","up_votes":1,"down_votes":0,"body":"wtf lol","replies":[]}]}