{"poster":"Wuks","date":"2016-11-15T14:28:47.707+0000","title":"Support Singed isn't banable, but that's not the point.","subforum":"Player Behavior","up_votes":317,"down_votes":107,"body":"It's been a while since I've done a comprehensive Player Behavior post, so here's a shot at one of the most discussed concerns right now - Singed Support and other off-meta picks. \n\nI'm not going to leave you hanging; no, Singed Support is not banable, and going off-meta is not banable. What is punishable, however, is refusing to cooperate with your team. And I'm not talking about muting other players because they're toxic or because you don't want to tilt yourself, but rather a refusal to ~~explain what the actual heck you're doing to your team and subsequently work with your team to carry out something that they aren't used to and/or comfortable with~~ work with your team even when they are uncomfortable with the position that you're putting them into. \n\nAllow me to explain further. I like to go Swain Support. It gives a good return on value and allows you to steamroll their marksman at level 6. During champion select, I explain that I'm going to go Swain Support and we're going to be an aggressive lane. We enter the Rift. This is an example of playing off-meta (and is hella dirty; give it a shot sometime maybe). Picking the \"Support\" role, I know my primary responsibilities are to protect my AD carry (death is the best form of crowd control) and to ~~shut down their bot lane~~ control the lane. \n\nLet's pivot to Singed Support. I've done it once. It ended up badly, but I made it clear that I would be playing Singed Support, and I played the role the best I could. Playing badly isn't against the rules, but refusing to play the role is another story. Had I gone smite Singed and just left my AD carry alone botlane AND our AD carry didn't understand that I was going to leave botlane for 5+ minutes, that's another story. \n\nI'm going to wrap this thread up by quoting the Summoner's Code and asking you to put yourself in the AD carry's shoes. You're in series to promote into Platinum, and you see a Singed Support. They tell you that they usually top, and when they get support, they don't spend the first few levels botlane. They don't give you a choice but to comply or dodge. You can't dodge, and he seems pretty confident. The match begins. You're trying to farm, but the enemy botlane is harassing you hard. You're zoned off of the minion wave, and you become irrelevant fast. \n_______________\n\n> # [**The Summoners Code**](http://gameinfo.na.leagueoflegends.com/en/game-info/get-started/summoners-code/):\n\n(1) Support Your Team\n\n> Being a good team player begins at champion select. Be open minded when considering the needs of your team. If you're the last one to pick, try to fill a niche in your team that hasn't already been filled. If everyone's picked and something stands out as a deficiency in your team composition, try asking for another player to fill the gap, or change roles to embrace that responsibility yourself. Remember, that by taking on a role you don't normally play, you'll learn more about unfamiliar champions and increase your own skill level.\n\n(4) Enjoy Yourself, but not at Anyone Else's Expense\n\n> Once communication breaks down, the likelihood of victory is drastically diminished.\n\n________________\n\n\n**Additional Links:**\n \n* http://ask.fm/RiotGhostcrawler/answers/141466561931\n\nThere are clearly a lot of opinions on this topic, so if you'd like to contribute to the discussion, don't hesitate to drop a comment below. I'll be checking in throughout the day, and hopefully we can try to understand where each of us is coming from. Cheers!","replies":[{"poster":"Lunar Blade","date":"2016-11-15T16:46:39.082+0000","up_votes":135,"down_votes":13,"body":"This is what I've gotten from reddit and Na Boards\n\nJust to clarify I joined this discussion netrual and I'm going to point out what I think is weird about this after all the information I've gathered. \n\nThings AdellaideSkyhart did :\n\n- Proxy Duo Jungle Singed (Invades and Split Pushes) \n\n- Q'ed as Support\n\n- Leaves his adc in lane alone for 3+ mins\n\n- Origianlly played singed top, Climbed to Plat 5 using duo jungle strat, played after ban \"following riots decision\" and dropped to gold 5\n\nSource : https://www.reddit.com/r/leagueoflegends/comments/5cyde6/3_million_mastery_smite_support_singed_ama_and/\n\nThings people see wrong with it :\n\n- Adc + Teams experience is ruined due to **off-meta** role <--- I specify Off meta role because this will be very important later on\n\n- Adc becomes worthless because they're zoned off for first few levels *he claims to return to lane before the adc can be doved*\n\n- He queues for support, but doesn't play support \n\n- He doesn't communicate with team (Not true, he has a copy and paste written of his strat every game) although, regardless if his team likes it or not, he will still do it \n\nWhat people said he should do :\n\n\"Play jungle instead\" - Duo Jungling is all about taking advantage of the fact that you can completely deny the enemy jungler while your primary jungler can apply map pressure to other lanes, the sacrifice being a lane, may it be top mid or adc.\n\n\"Just play singed support\" - he could, but clearly he is far less successful with that role thus dropping from plat 4 to gold 5.\n\nMy Stance on it all:\n\nHe doesn't play an Off-Meta pick, he plays an Off-Meta Role, now the issue with all of this is that, you can't exactly, queue for an off meta role, can you? \nI'm sure if there was a queue for off-meta he'd queue for it (not saying that's the solution) but what I'm trying to say that there's no way he can apply his strat without queuing for the position we all know as support. \n\nThis means people will say \"he queues for support but doesn't intend to play it\". Well ask yourself how is it his fault? He can't dm riot and ask them to add a new role. If riot want the meta to be as it is forever, they should clearly add \"You can never play anything outside the realms of ADC, TOP, MID, JUNG or SUPP.\" They've designed ranked/draft to support this idea but have not clearly stated that it's the case. Meaning that the rules are **vague**. \n\nI won't deny the fact that I personally, think his tactic is absolutely stupid and if you were to do that in diamond or above, they'd be at your nexus in 15mins but it works for his current elo and maybe he can evolve it to work in higher elos (probably not tbh xD) but you really never know what can happen. \n\nAlso about the part about ruining peoples experience,  that's subjective and really can't be used as a strong argument, people could get frustrated for hundreds of reasons. \n\nI probably won't be responding since I'm doing my uni work byeeeeee","replies":[{"poster":"RavenMagus","date":"2016-11-15T22:55:30.957+0000","up_votes":25,"down_votes":16,"body":"> This means people will say \"he queues for support but doesn't intend to play it\". Well ask yourself how is it his fault? He can't dm riot and ask them to add a new role. If riot want the meta to be as it is forever, they should clearly add \"You can never play anything outside the realms of ADC, TOP, MID, JUNG or SUPP.\" They've designed ranked/draft to support this idea but have not clearly stated that it's the case. Meaning that the rules are vague.\n\nWhat he should do is ask in each champion select if it's okay for him to be playing such a wildly off meta team.  Sometimes he will get a team that will be okay with his choice - and knowing his decision, they can play safer (maybe select a Caitlyn or Ezreal ADC instead of Vayne or Twitch, for example) and try to work with him.   Sometimes he will get a team that will ask him not to, in which case he should go for a more traditional support, even if it's a bit off meta (like support Singed).  But what he shouldn't do is just use his copy-pasta to bully his team into accepting his choice.","replies":[{"poster":"CooL Ice Tea","date":"2016-11-16T06:50:17.085+0000","up_votes":26,"down_votes":6,"body":"You can also ask if everyone is fine if you play teemo, you won't play teemo in 70 % of the games since 3 people will say no. BUT people are picking teemo since they don't communicate. And no, I am no troll. I am pissed about this topic and what Riot did here.","replies":[]},{"poster":"Troll for Trump","date":"2016-11-16T07:10:34.606+0000","up_votes":23,"down_votes":12,"body":"But the people are meta sheep. If you have to get a team's opinions to legitimize any pick, then:\n\n-That would just further give power to premades. Which is bad.\n-People would further impose meta picks, and just standardize everything. Things can be borderline meta, but, Galio/Karthus Top (which have had a high winrate/low playrate on na.op.gg)? Won't happen.","replies":[{"poster":"Glory ln Death","date":"2016-11-16T16:47:46.967+0000","up_votes":25,"down_votes":8,"body":"No one is arguing that you need the team's permission to play an off-meta champion in a certain role. But you **do** need to get the team's approval to play an off-meta _role_, because that requires the entire team to play differently to accommodate you.\n\nIf the adc isn't comfortable playing solo bot, you shouldn't play double jungle and leave them solo.","replies":[]}]}]},{"poster":"Cardinal Sinveil","date":"2016-11-15T18:19:27.251+0000","up_votes":18,"down_votes":5,"body":"I just wanted to congratulate you sir for giving a competent opinion I can absolutely stand behind.\n\nThank you!","replies":[]}]},{"poster":"Gromp123","date":"2016-11-16T21:01:51.342+0000","up_votes":124,"down_votes":42,"body":"EDIT: grammar\n\nOkay, so we got together with game designers, player behavior folks, and player support agents to take a hard look at this player, the penalties, and the support tickets associated with it. It's clear this wacky Smite, Support Singed plays to win. It’s also clear the player struggles to effectively communicate intentions and strategy to teammates. In this case, unwieldy communication and the wacky Smite, Support Singed pick are tightly linked. So let’s pick them apart some.\n\nInnovative and unconventional approaches to League keep the game fresh, and finding new ways to win motivates a ton of players. We 100% support the opportunity to innovate with surprising picks and strategies in League. The only real condition we place on that right to experimentation is that you play to win. However, sometimes unconventional approaches to the game have costs that outweigh benefits. This player might have a respectable(-ish) winrate on Support Singed with Smite and no Sightstone, but the pick and build also nets them a frankly enormous number of reports and probably gives their ADC high blood pressure.\n\nThat leaves us with two tricky questions:\n\nQ: If intentions are clearly aimed at victory, is there an outer boundary for too unconventional a pick/build/strategy?\nA: No.\n\nThis is where we break from the Support ticket linked in the original reddit discussion. Real talk, this player is far from the only support in Gold V to skip out on a Sightstone. No one should ever get banned for skipping Sightstone. On the other hand, asking an ADC to lane alone while their support farms the enemy jungle truly pushes that teammate out of their comfort zone and that should mean something. We can all sympathize with the lonely Miss Fortune facing down Lucian and Alistar at her own turret, and it makes sense to us when they report this Singed player. \n\nQ: Do unconventional picks/strategies increase the burden of communications for the player and their teammates?\nY: Yes.\n\nIf you're gonna throw a curveball at teammates, you also need to communicate your intentions to teammates. You shouldn’t just expect everyone to \"get it\", so tell them what's up. To be clear, this player does attempt to communicate intent and strategy, but a good chunk of teammates across hundreds of games just don’t want to sign up for the plan. That lack of agreement on the new plan makes for a pretty chaotic game and leads to a huge share of this player’s reports. If a teammate in champ select says, “pls no, this is game 5 of promos”, maybe stick with something conventional and skip tilting your teammates off the face of the earth. In short, argue for your idea, but stay ready to be flexible.\n\nIn the same vein, teammates should be willing give unconventional picks/strategies a fair shot. They could surprise your opponents more than they surprise you. We need to leave plenty of space for experimentation in League (Hi Support MF), even if it sometimes leaves us in less than perfectly comfy games. \n\nIf you're about to play stunbot Twisted Fate tank support with Talisman, Righteous Glory, and Protobelt, let your team know the special kind of hell you're aiming to create for your enemies, and how they should adjust their expectations and approach to the game. If, instead of that, you wholly fail to communicate, or completely disrupt game after game, it makes sense that you’d rack up a ton of reports, net manual reviews and even potential penalties from Player Support. \n\nThe net result is that players, if playing to win, have a fundamental right to experiment in League. It’s good for the game. At the same time, common sense and good sportsmanship say that experimenting players need to clearly communicate intent and win conditions to their teammates. \n\nIn this Singed player’s case, the two-week ban’s already expired. For what it’s worth, we believe the penalty was warranted because in literally hundreds of games the player inflicted a huge amount of disruption on players who didn’t agree to their chemistry experiments. On the other hand, the player’s communication issues fall well short of permaban territory, and in retrospect the threat of a perma in the Player Support response was a bit much. We also see marked improvement in their efforts communicate with teammates in more recent games. It’s worth mentioning that cases like these are handled by humans and any player in a (pretty dang rare) situation like this can request further detail and a full review from Player Support.\n\nStill, with intent to win confirmed, gameplay experimentation and innovation is something we stand behind even if it ruffles feathers. After all, conventional picks lose half their games too. We think this player could still do a much better job of communicating with teammates, but we also believe players should be more tolerant of different approaches to the game. The line here is the player repeatedly showing no flexibility in the face of resistance to their strategies, and consistently forcing teammates into a wildly different bot lane experience hundreds of times.","replies":[{"poster":"AdellaideSkyhart","date":"2016-11-16T22:37:23.638+0000","up_votes":44,"down_votes":13,"body":"Thank you very much for the thorough post.\n\nDoes this mean I can use my strategy without fear of being suspended, as long as I communicate a lot with my team?","replies":[{"poster":"WookieeCookie","date":"2016-11-17T04:42:24.570+0000","up_votes":52,"down_votes":19,"body":"It’s a difficult question to answer directly because cases like this will always depend on a lot of factors.  So hear me out.\n\n\nCommunication is def key here.  But keep in mind that there is a difference between communicating **AT** someone vs communicating **WITH** someone.  In many games I reviewed you would inform your team mates of what your plan was but you failed to adapt to what was being said by your team mates in response.   \n\n\nYou can craft an innovative strategy but half of any plan to win a match of League will involve your teammates.  If the team isn’t able to adopt the strategy at hand needs your help to recover the pressure falls on you to evolve your tactics and support them.\n\n\nAn example of this is a match where you were filling the ADC role.  Intent on fulfilling a similar strategy as when you fill your support role you left your support Janna alone bot lane.  Much to her own confusion on what to do she tried to handle the lane solo but it’s clear it wasn’t working.  A moment like this is a time to pivot on strategy; adapting to the circumstances that develop in a match.  As bot lane begins to fall so does the team, eventually cascading to other lanes as the enemy gets more objectives and kills.\n\n\nAnother example is one particularly unfortunate match where your team’s jungler was unhappy that you had killed friendly jungle creeps, starving him of XP he needed for his jungle rotation.  Later in the match this led the jungler to going to mid lane to get some minions, which made the mid unhappy that they were now sharing XP.  At one point they asked you to leave blue for mid, but you took it anyways; an important part of your strategy perhaps, but failing to acknowledge how the rest of your team is playing.  The unusual strategy ends up backfiring; not because it may fundamentally be flawed, but because the human element of League wasn’t addressed and your team fell into disarray.\n\n\nThe methods of communication within League are pretty limited to chat and conveying difficult plays or strategies can be tough.  This isn’t a reason to not try something unusual, nor is it an excuse to ignore the thoughts of your team mates.  But it is something that you’ll have to factor in when trying something new.  If you are interested in trying crazy stuff I would encourage you to get like minded people together.  2017 will be the year of Flex Queue, finding and playing with players who understand your strategy, are excited to try it and are even willing to make picks that compliment it will never be easier.  Queuing solo will always remain an option, but the difficulty of uniting 4 strangers to something unheard of is something you will have to be aware of and account for. \n\n\nWe don’t have a specific system or feature that moderates this kind of behavior.  Incidents like these are reviewed by Rioters only after they are flagged to us by a variety of possible variables we look at in League matches.  We would never ban an account based off something basic like unusual picks, unusual builds, or weird roles.  To be honest those kinds of things might get complaints from other players but they are not the kind of things that make a measurable impact on how painful a match might be for our players.  However, players that feel ignored, disrespected, hijacked, or marginalized do report increased pain and frustration with League.\n\n\nIn your case various factors we use to monitor pain in League were being set off in the matches you played.  Your strategy was leaving a wake of discontent and frustration in a consistent pattern of games you played.  If this happens again it’s possible your account may be flagged again.  Should that happen; you (and anyone else who may be flagged in a similar way) are always encouraged to write us back.  Since these are hand reviewed cases we will re-review the circumstances if you contact us.\n\n\nFor my own part out of this, I’m going to talk to the team to see how we can communicate the issue better through Support.  Our goal is to never permanently remove someone who’s honest desire is to try new things and aim to win their matches.  But if the pursuit of **Science!** leads to measurable harm to other players (even if unintentional) then we may have to intervene.  Not to punish (unless it is being done for the purpose of being a jerk) but to educate and find ways to mitigate the frustrating experience that is being created.","replies":[{"poster":"AdellaideSkyhart","date":"2016-11-17T05:37:03.442+0000","up_votes":43,"down_votes":7,"body":"thank you for your lengthy reply. i think i finally understand the issue. i will be more mindful of my impact on other players in future games.","replies":[{"poster":"DeathBurst","date":"2016-11-17T15:04:54.689+0000","up_votes":6,"down_votes":0,"body":"For what it's worth (not much), I suggest adding to your c/c paragraph in pre-game chat a detailed explanation to your ADC. Not only what YOU will try to achieve (invading and putting the enemy jungler behind), but also what THEY should do to adapt to this situation (not push, not fight, CS under tower, play safe, and wait for you to come back). Also make it clear that you WILL come back and that you're not going to abandon them 1v2 all game long.","replies":[]}]},{"poster":"UpTheHuia","date":"2016-11-17T18:14:12.682+0000","up_votes":29,"down_votes":2,"body":"I don't think he does understand the issue hear and this is why.\n\nYou guys at riot are saying that he is bannable for communicating at teammates and not with them. The problem here is that he'd have to give in to whatever his teams desires are. if mid says he wants blue then skyhart has to give it over, but then mid lane is communicating at him and not with him. A far worse issue especially at my elo is when someone picks lee sin or yasuo. Not only does the team not want this but it also generates lower win rates on average than skyharts support singed, something that'd obviously frustrate teammates.\n\nAnother problem I have with this post is how you guys at riot are laying down the worst case scenario, where bot lane gets stomped. They influence other lanes and it's gg where you could also say the positive effect skyhart has. he puts there jungler way behind so he cant gank and has no minions to farm, this frees up their jungler to gank mid and top which in turn frees them to party down in bot lane. The fact that an adc demands for him to be in lane means he is the one now communicating at someone and not with them. Any time a regular jungler takes blue from mid can now be regarded as bannable by riot from these posts technically speaking. As long as he's still trying his best to win and not flaming etc then I don't see the problem.","replies":[]},{"poster":"Zok72","date":"2016-11-17T07:17:56.709+0000","up_votes":19,"down_votes":1,"body":"> [{quoted}](name=WookieeCookie,realm=NA,application-id=ZGEFLEUQ,discussion-id=79aGu3wR,comment-id=006b00030004,timestamp=2016-11-17T04:42:24.570+0000)\n> We don’t have a specific system or feature that moderates this kind of behavior.  Incidents like these are reviewed by Rioters only after they are flagged to us by a variety of possible variables we look at in League matches.  We would never ban an account based off something basic like unusual picks, unusual builds, or weird roles.  To be honest those kinds of things might get complaints from other players but they are not the kind of things that make a measurable impact on how painful a match might be for our players.  However, players that feel ignored, disrespected, hijacked, or marginalized do report increased pain and frustration with League.\n> \n> \n> In your case various factors we use to monitor pain in League were being set off in the matches you played.  Your strategy was leaving a wake of discontent and frustration in a consistent pattern of games you played.  If this happens again it’s possible your account may be flagged again.  Should that happen; you (and anyone else who may be flagged in a similar way) are always encouraged to write us back.  Since these are hand reviewed cases we will re-review the circumstances if you contact us.\n\n\n\nThanks for taking the time to type this out. An official response is a good start to addressing this. I would like to look at your underlying philosophy. Your response can be (somewhat reductively) stated as \"a bunch of us looked at your account and agreed there was a problem despite not having a _clear_ rules justification\". There's a problem with this, mostly because there's no way forward from this rule/decision. There's not a clear behavior to avoid. It means that players have to guess what's okay or what's too far etc. For example, a situation taken directly from your post. Two players demand that one of them gets blue, I disagree. In what situation is it okay for me to ignore them and when do I have to do what they say? Alternately (now my own hypothetical to build on what you said), I would like to play (for example) Azir in the bottom lane. My team disagrees. Am I in the wrong by picking him? What if I pick first, but my team hovers AP champions, have I failed to communicate with my team? What if I pick last and they already picked those champions, does pick order somehow determine who gets to play what (and wasn't the whole point of team builder/dynamic queue to get rid of that exact issue)? What if it's graves or kindred? How close to the meta is okay? What if my team demands I play Caitlyn or Jhin? Or what if I want to support my top laner, who has to agree? All four of my teammates, just my top laner, just my bot laner?\n\nI'm not asking these questions because I need an answer to all of them, I'm asking because it seems that your _official_ stance (at least as far as I can tell from your post) seems to be \"we'll look at it eventually and decide\" and that's a terrible position for us players to be in. We don't know and never can know how much we have to listen to what our teammates tell us to do. So please, reconsider, have a meeting, whatever it takes, but come up with a very clear official stance and communicate it to us. Because as it stands currently, the next time someone tells me that my champion is trash and not to play them, I will seriously have to ask myself whether they're right and I could get suspended/banned/etc. for playing it.\n\nEDIT: I missed your earlier post where you spelled out somewhat more clearly riot's stance (not having a rioter rundown caused a bit of confusion for me). I will leave this post here because I think the ideas still express very clearly a relevant concern but I am much less worried seeing part one of your post. Part two still worries me because it's pretty nebulous (especially your anecdote about teammates in promo series) and still leaves open the question of what constitutes the line between communication and capitulation?","replies":[]},{"poster":"Aptest","date":"2016-11-17T18:06:00.183+0000","up_votes":12,"down_votes":1,"body":"> Communication is def key here. But keep in mind that there is a difference between communicating AT someone vs communicating WITH someone. In many games I reviewed you would inform your team mates of what your plan was but you failed to adapt to what was being said by your team mates in response.\n\nAren't you conflating communication with compliance? and in addition to that, you're faulting him for lack of skill and lack of success. This is unfair. \n\n> The unusual strategy ends up backfiring; not because it may fundamentally be flawed, but because the human element of League wasn’t addressed and your team fell into disarray.\n\nIt is reasonable to expect Skyhart will struggle with some elements of implementing his strategy. It is expected - he is neither Gorilla nor CorJJ. \n\nAnd so, since unskilled low silvers like me want to also do new things once in a while - it is important that the skill by which these stratagems are implemented is not the measure by which the players engaging in them are judged in the report system. \n\n> find ways to mitigate the frustrating experience that is being created.\n\nStory time. I play caster type supports: Lulu, Nami, Karma and bard. Time and time again I am told by the team: tank sup. Thresh or leona. Braum will be great. \n\nI used to think: why are all these players taking liberties with my pick? It really tilted me a lot. \n\nThen I realized: These other players, they are just telling me what they want, and what they think. They are not trying to pressure me, or to coerce me, they are just being nice and polite and **telling me what they think**.  I thought they were all a bunch of douches but _actually _they were trying to be helpful and informative!\n\nSo now since I don't think they are trying to pull one over the support, I am quite happy to hear \"can we have a braum here\". I don't play him, but i don't mind hearing it either. And since they are taking their time to type what they want in chat, I do the same and get them to switch from Khazix and Rengar to Hecarim and Amumu (both OP).\n\nImagine that: once you don't think first that they other guy is out to get you, that he's a troller and a feeder and a junk person who just want you to suffer alone in a 1v2... well you don't have a problem with the other guy going smite singed and into the enemy buffs anymore.","replies":[]},{"poster":"Luna Ather Solis","date":"2016-11-17T04:55:34.689+0000","up_votes":13,"down_votes":3,"body":"get rid of the support role","replies":[]},{"poster":"Chamuel85","date":"2016-11-17T15:16:59.466+0000","up_votes":7,"down_votes":0,"body":"Thanks for the post.  I have a few questions.  I tried to phrase all of these questions out of pure curiosity.  I apologize ahead of time if any of this comes off not in that light.\n\n1) What worth does the unusual have over the usual?  A lot of the aspects listed here can be true for someone playing a usual pick.  Does that mean similar disruption from someone who is playing a usual pick also equally reportable as it can have the same affect?  Is that more akin to trolling (which I'm not sure if I've seen someone actually receive a punishment for trolling)?\n\n> [{quoted}](name=WookieeCookie,realm=NA,application-id=ZGEFLEUQ,discussion-id=79aGu3wR,comment-id=006b00030004,timestamp=2016-11-17T04:42:24.570+0000)\n> \n>  At one point they asked you to leave blue for mid, but you took it anyways; an important part of your strategy perhaps, but failing to acknowledge how the rest of your team is playing.\n\n2) Who does Blue belong to in a match?  What rules are around to whom the blue or red buff belongs?  Who gets to decide to whom the buff belongs?  Does it belong to the jungler by default since it is in the jungle?  Blue is important to a lot of people in the game's strategy.  Why does a Support taking it seem to be more disruptive?\n\n> [{quoted}](name=WookieeCookie,realm=NA,application-id=ZGEFLEUQ,discussion-id=79aGu3wR,comment-id=006b00030004,timestamp=2016-11-17T04:42:24.570+0000)\n> \n> Another example is one particularly unfortunate match where your team’s jungler was unhappy that you had killed friendly jungle creeps, starving him of XP he needed for his jungle rotation.  Later in the match this led the jungler to going to mid lane to get some minions, which made the mid unhappy that they were now sharing XP.\n\n3) When is it disruptive?  Is taking a camp from your jungler have a limit to where you can start taking it?  I don't think anyone would ever say like after 30 minutes that it is bad.  Where is the boundary line for when it is acceptable?  Is a jungler 'taxing a lane' by taking farm reportable?  The same question for just standing near lane to soak up XP from some laner.\n\n4) Is the support on the bottom of the totem pole for decision making in the game or even champion select?  Which makes sense, as they are there purely to support everyone else as the name would suggest.  I'm just curious if that is the case.  Is it more of a democracy?\n\nFor example, some mid laners ({{champion:91}}) rarely stay in their lane but roam constantly (this can cost mid tower... which is probably the most important T1 tower and I have seen some people get highly tilted because mid tower is down).  I believe that a pod cast Scarizard mentions that Talons pretty much never want to lane.  While a mid leaving lane doesn't leave a player alone on his team, but a tower is left alone.  You lose all XP and gold (setting the team further behind since an ADC can stay and farm xp/gold under tower most likely) in the Talon leaving mid alone circumstance.\n\nI'm a support main so I'm highly interested in this mainly because I want to know how much agency I actually have as a support.","replies":[]}]}]},{"poster":"Wuks","date":"2016-11-16T21:16:24.107+0000","up_votes":37,"down_votes":3,"body":"Hey Gromp,\n\nThank you and the PB team for providing more clarity on what happened as well as touching on the implications moving forward. \n\n{{summoner:13}} OP.","replies":[{"poster":"Gromp123","date":"2016-11-17T00:14:19.511+0000","up_votes":40,"down_votes":8,"body":"*Ribbit*","replies":[]}]},{"poster":"Kassimila","date":"2016-11-17T03:06:07.909+0000","up_votes":29,"down_votes":2,"body":"Hey Gromp, \n\n    I realize I'm just  gold 3 scrubtrash, but I've been playing this game since season 2. When dynamic queue was introduced RIOT made it very clear that they did not want to 'enforce the meta'. With this kind of decision, that's exactly what is being done here. Singed by himself is a troll champion. He runs around, proxy farms, feeds 3 kills, and still wins games. He's been that way since he existed. I've seen many popular youtubers pick troll support picks all the time, for example dyrus picking urgot support. It's not a good support champion, yet the ADC deals with it. This player isn't an innovator, the support lvl 1 jungle invade is a strategy I've seen many pro players exploit to get an advantage. Not just in LCS, but in solo queue as well. I myself have done this strategy, and been flamed by the adc because they were too stupid to realize they were 1v2 and died. (Not with singed, but with more traditional support champions.) Support is a boring role at times, and sometimes it's fun to spice it up. \n\nNow every Diamond or higher player has always preached the same thing. Your teammates don't matter. Focus on your play, do well, and you will advance up the ladder. As long as the 'doing something wacky' is a plan designed for victory, I see no issue with this players actions. If he's just running it down mid, intentionally feeding, yeah ban him. Meanwhile 1 out of 3 games someone is telling someone else to go slit their wrists. Why is this player worthy of your attention? Have you combed through all the reports on him and looked at what the reporters said to him? I'll be there's some good stuff in there, stuff that's actually against the code of conduct. \n\nYou speak of communication with teammates as if actual conversation takes place during champ select. People ban whatever they want, regardless of champion pre-picks. They pick whatever champion they want to play in whatever role they got, regardless of team comp. No actual conversation takes place, it's soloq, no one explains anything that they intend to do EVER. So why is this guy special? Why does he have to explain his every thought and decision to his team, pre champion pick, or in game for that matter? Why when you've literally handed every player TWO wards, FOR FREE, do people still complain about a support choosing to not get sitestone? The facts here are simple: He did some stuff against the meta that people didn't like, they got mad about it and reported him.  That's not report worthy offense. You owe him an apology, and some free RPs for his trouble. \n\nIf RIOT chooses to go the 'enforced meta' route, I doubt I'll continue to play LoL. This is a game, and the players should be able to play it however they wish. As long as there is an honest effort to win the game, and they aren't spamming chat with \"Kill yourself trash\" nonsense, who cares what they are doing. \n\n- Kassimila","replies":[]},{"poster":"bHukey","date":"2016-11-16T23:48:58.482+0000","up_votes":33,"down_votes":10,"body":"I really, REALLY, do not agree with your statement on being punished for a lack of communication.\n\nLeague is not a game that requires communication. It will greatly improve your chances but it is not required. If a player pretended that everyone in the game was a robot and that he was playing by himself, he could still play the game. I would argue he could even become good at the game. Saying that league is a team game does not refute my point because working together does not actually require communication. It just requires that decisions are made that make sense with each other. Obviously it is much, much, much easier to win if you do properly communicate but that does not indicate a necessity.\n\nAssuming you are playing solo and you join a game with total strangers, you always start with zero communication. Coordinating and working together creates positive communication while toxicity and flaming is negative communication. Now obviously negative communication should be punished and positive communication should be rewarded. What about zero communication? Let's assume that every player is trying their best to win.\n\nIf we take a player who is playing totally normal (meta), we see no issue. Let's say a jinx queues botlane and plays exactly as expected. Jinx goes 0/5/0 that game ending in a loss and did not type or ping at all that game. Totally acceptable behavior. \n\nNow imagine that jinx did not group for half of the calls her team made and decided to split push? Well her team might report her for not listening to calls/getting caught/being useless, etc. Assuming she is still trying to win at all times, this is still totally acceptable. One might argue that she had strategically made an error but perhaps grouping up would have been worse. All we can say is that she is trying to win. She may even get some reports based on her play.\n\nNow what if our jinx never groups up, is always doing the opposite of what everyone wants, and upsets her teammates with her play? She gets 9 reports. All we know is she was trying her best to win. Her teammates didn't like that she went duo toplane tank jinx. In fact its so outrageous that everyone feels that she is trolling. She may have been trying something new or she may even think its truly the best strategy.\n\nNow your stance right now is that the more one deviates from the norm, the more you MUST explain yourself to your teammates at threat of punishment. From the situation I laid out and statements from riot games, I can assume that the burden of explanation is somewhat proportional to the amount of reports you are getting. Now you've clearly drawn a line somewhere that our singed player has crossed. You've said that enough players have voted to kick our player out of the game that it is legitimate to at least punish him. \n\nMy issue with this is that the line that has been drawn is arbitrary. \n\nLets create another scenario. Lets say that playing Teemo is so unanimously outrageous that picking Teemo results in a 100% report rate. In fact, only one player in the whole game plays Teemo and the entire community rises up to get this Teemo player banned. Our Teemo player tries to win every game and does his best but it doesn't matter. No one in the community cares, he needs to be banned. Does the volume of outrage merit his punishment? If Teemo has a zero communication level should he still be punished?\n\nLet's take it a step down. Let's say Teemo in an effort to appease his aggressors starts to type a paragraph at the beginning of the game explaining what he's about to do. This creates at least a level of positive communication. It is disingenuous to say he is not communicating. Lets say 1% of the community is now satisfied. Is that now at a level of satisfaction?\n\nRiot steps in and says you must have at least a 15% approval rating before what you're doing is acceptable. To be quite frank, it is entirely within the power of Riot to do this. I believe such a decision should be made extremely public and made very clear. To keep such a decision hidden would be to give Riot the power to decide on a whim whether something is ok or not without giving a clear explanation. I personally would immediately end my support of such a company. However, I believe in the people at Riot who are always trying their best to be transparent which is proven by the very post I am responding to.\n\nCommunication in a competitive game is a tool used to increase your chance at winning. It is of course very nice when a team comes together with a very positive attitude and teamwork but it is not a requirement at all. No communication simply means a player must play the game to the best of his ability within the framework provided to him regardless if that is a counter-jungling singed. Toxicity is of course punishable and a line has already been drawn for what level of toxicity is acceptable. It is to Riot's virtue that they provide what I believe to be a generous amount of leeway to try and prevent punishing players unnecessarily. \n\nThe human review process is a safety net to catch potential cases that have been unjustly punished and I believe that is what was potentially the case here. But that safety net is entirely dependent on the views of the person reviewing them and that is why I am writing this response here so that an issue like this can be averted in the future.\n\nTL;DR\n\nZero communication should not be punishable","replies":[{"poster":"Gromp123","date":"2016-11-17T09:40:02.621+0000","up_votes":19,"down_votes":12,"body":"This is worth discussing, thanks for the thoughtful dissent. I'm not sure I agree on the count that the game doesn't require communication, but I want to lay out my logic. Sure, in simply literal terms, ten people could play with no chat, no pings, etc. It'd work, but I think something would feel like it's missing for a lot of players. League's (obviously) a team game, and while you're under no obligation to be some sparkling paragon of sportsmanship, it makes sense to do some communicating around intent and strategy if you're playing to win. I know this retreads ground from your post. I think the reason I'm shouting it out is that while comms aren't required to play, I believe they are required to play at your highest potential, and that's what I think is worth aspiring toward. Faker-senpai communicates an immense amount of game-relevant info to his teammates while also being the most mechanically gifted player on the planet. \n\nIn terms of drawing an exceptionally clear line in cases like this Singed player, it's not something I think we should do. Hear me out. Let's toss out a total hypothetical. In some far off world that is definitely not this one, there's a rule laid out that 80% of players in your games must agree to a pick. Frankly, that's bullshit, and a rule like that is as draconian as it is arbitrary. I don't want to play in a world where Riot lays out exact rules on when and how you have to communicate picks and strategies at the risk of penalties. So I understand the desire for specificity because it's easy to understand when a rule is broken or not, but I strongly, strongly believe it's counterproductive, weaponizable, and overly-restrictive for this type of case. It's worth emphasizing that an extreme edge case like this is super, super rare. One of the biggest reasons we wanted to share our thoughts around this was to come down firmly on the side of experimentation and innovation. It's a crucial part of what makes League special. Spitballing from our internal discussions across design, PS, and PB, we imagine that >99% of cases like this would never even be reviewed by Player Support (Instant Feedback does not punish cases like these), let alone net a penalty. \n\nNow let's talk about that human safety net of manual reviews, because that's a part of why we're talking about this too. A big, messy, open conversation like this forms the bedrock of the guidance we're currently formulating to give Player Support Rioters when they encounter cases like this. They wouldn't be shooting in the dark. They'd have documentation based on the logic we've laid out today, and feedback from players in the discussion. With that in mind, they would indeed be making a judgment call. It's worth reiterating that a player could also request a review of that call. In this player's case, we see evidence of where better documentation and guidance would've helped the Player Support Rioter. Like we say in the original response, this player shouldn't have been threatened with a perma, and these discussions and precedents better equip us for thoughtful outcomes in nuanced, edge case scenarios.","replies":[{"poster":"Aptest","date":"2016-11-17T17:41:50.972+0000","up_votes":23,"down_votes":1,"body":"TL;DR: \n\nLike I've said before this is an edge case. Who should be considerate of whom and under what circumstances? If there is a line, that when it is clearly communicated, puts the \"onus of consideration\" on the \"other side\" than we're certain to see it used time and time again whether it is or is not justified. \n\nfor instance, last pick \"cant support\", \"don't own any supports\", etc. remember that? \n\nWhat we have here is a case of the desire for achieving team harmony being weaponized, armed with the power of the report system and used to bludgeon an unconventional player into submission and conformity. \n\nThe correct approach is this: \"we desire for players to attempt and achieve harmony within the team, and we will promote this as best we can. But ultimately it the right of each player to solely determine his way of playing the game, and this is what we will enforce\". \n\n\nPoint by Point: \n\n>  It’s also clear the player struggles to effectively communicate intentions and strategy to teammates.\n\nBut also it is clear that he makes an invested, wholehearted attempt at engaging in said communication. Therefore, you are faulting him not for not communicating, but for not succeeding in communication.\n\nWhich can result from his lack of skill, lack of flexibility of mind of personality, or simply because his team will not listen. \n\n> We can all sympathize with the lonely Miss Fortune facing down Lucian and Alistar at her own turret, and it makes sense to us when they report this Singed player.\n\nWe feel for the lonely MF. However your previous analisys leads to one single conclusion: the singed is playing in a legitimate manner which should be allowed. Therefore the onus is on the MF to not get pissed and not lash out in rage with a \"report\". She should, in other words, suck it up, and you owe it to the singed to throw her report to the trash bin.\n\nLet's assume for the sake of argument that counterjungling support is shown to be a super effective strategy. Suddenly all supports CJ and all ADCs are pissed all the time. The possibility of this discovery is desirable. \n\n> Q: Do unconventional picks/strategies increase the burden of communications for the player and their teammates?\n> Y: Yes.\n\nAnd the follow up question is: \"by how much\". Which means you're faulting a player not for lack of effort, but for lack of success, or lack of skill. Essentially, this argument leads to: \"different play styles OK in diamond and challenger, experimenting bronzes will be banned on sight\" \n\n>  but a good chunk of teammates across hundreds of games just don’t want to sign up for the plan.\n\nI feel you are conflating \"communication\" with \"consent\". that team mates fail to accept your plan does not mean they have not been given information on it. More than that: failure to agree implies very strongly that successful communication has occurred. \n\n>  If a teammate in champ select says, “pls no, this is game 5 of promos”\n\nWhich will invariably happen in 95% of all the games an unconventional player plays, especially if he makes an honest effort in communication. Therefore this is the same as \"team consent or go home\". You're just siding with compliance to the team's wishes under the guise of consideration. \n\nLike I've said before this is an edge case. Who should be considerate of whom and under what circumstances? If there is a line, that when it is clearly communicated, puts the \"onus of consideration\" on the \"other side\" than we're certain to see it used time and time again whether it is or is not justified. \n\nfor instance, last pick \"cant support\", \"don't own any supports\", etc. remember that? \n\n> experimenting players need to clearly communicate intent and win conditions to their teammates.\n\nThe problem here is that in banning him you have conflated \"communicating with the team\" with \"successfully attaining the team's agreement.\" Communication has clearly occurred; so why the ban in the first place?\n\nLet's prevent the next time he or any other non-traditional player is banned: say you've made a mistake. Apologize. \n\n> For what it’s worth, we believe the penalty was warranted because in literally hundreds of games the player inflicted a huge amount of disruption on players who didn’t agree to their chemistry experiments.\n\nyou've spent half a post writing that differing play styles are desirable. From that you reach a conclusion that the punishment was warranted? how does that even work? \n\noh, i get it. Tons of reports, punish. Let's make up the reason why. The morals and summoner code are an unrelated issue. Do i get it? \n\n>  in retrospect the threat of a perma in the Player Support response was a bit much\n\nIf there is no intention to perma ban this player for continuing his positive and desirable play style, than why the 2 weeks suspension? Either you've made a mistake, we get it they happen, say you were wrong and made a mistake then we move on it's just two weeks suspension no harm done, OR you really intend to \"reform\" skyheart and any other deviant in which case you say the ban was warranted and then everything you say about differing play styles is an empty PR facade since we know what will happen to the next \"smite singed support\".\n\n> The line here is the player repeatedly showing no flexibility in the face of resistance to their strategies, and consistently forcing teammates into a wildly different bot lane experience hundreds of times.\n\nWe deal here with an edge case. The core game-play of both styles is so different that it is either coercion from one side or coercion from another. The bottom line is that if you demand flexibility here, it is the same as demanding to mostly abandon this different play style since lack of agreement is going to be much, much, much more common than agreement. \n\nTherefore your demand is unreasonable and I respectfully request that you rescind it. \n\n> it's the lack of social agreement and cooperation on the approach to the game across hundreds and hundreds of instances.\n\nI.E. your team is allowed to coerce you into the play style desirable to them. And if you don't comply, big bad riot will give you a 2 week suspension. \n\n> there's a rule laid out that 80% of players in your games must agree to a pick. Frankly, that's bullshit, and a rule like that is as draconian as it is arbitrary. I don't want to play in a world where Riot lays out exact rules on when and how you have to communicate picks and strategies at the risk of penalties.\n\nIf you don't want this reality, don't support it with your actions. Simple as that. \n\n>  I understand the desire for specificity because it's easy to understand when a rule is broken or not, but I strongly, strongly believe it's counterproductive, weaponizable, and overly-restrictive for this type of case. \n\nWhat we have here is a case of the desire for achieving team harmony being weaponized, armed with the power of the report system and used to bludgeon an unconventional player into submission and conformity. \n\nAnd what we also have here is the mechanism that should have kept that player safe from this sort of abuse fail because the people who apply them believe that the spirit and the letter of the summoner's code should be bent if there are enough reports. \n\nHere is not the case of the edge case being in some gray area. It is evident that the rules have been completely adhered to - both in spirit and in letter. You've bent them to mean he is in the gray and now they look like a pretzel. Why do you think there is so much backlash against you? \n\n> One of the biggest reasons we wanted to share our thoughts around this was to come down firmly on the side of experimentation and innovation.\n\nI cant decide where your opinion is, honestly. Either you are for innovation, in which case ban is unwarranted, or you are for conformity, in which ban is warranted. Now I understand i'm being a douche by portraying you in a black or white situation where you can't really come out clean thought claiming the half-way point. But I think this is where we are - at the end of the day you are either for the ban, with everything this entails, or against it. \n\n> Now let's talk about that human safety net of manual reviews, because that's a part of why we're talking about this too.\n\nI think it is clear that either they safety net is faulty by design, or it has failed. I want to assume the latter: but your justification of the ban worries me.","replies":[]}]}]},{"poster":"Guardman","date":"2016-11-16T21:47:08.327+0000","up_votes":12,"down_votes":11,"body":"> On the other hand, asking an ADC to lane alone while their support farms the enemy jungle truly pushes that teammate out of their comfort zone and that should mean something. We can all sympathize with the lonely Miss Fortune facing down Lucian and Alistar at her own turret, and it makes sense to us when they report this Singed player. \n> \n\nMy one question with this is how is this any different than a Bard that spends most of the game roaming. I've been in more than a few games where the Bard was barely in bot lane at all other than for a \"gank\". Or does a perma roaming Bard also fall into the category described above?","replies":[{"poster":"Gromp123","date":"2016-11-17T06:36:31.355+0000","up_votes":15,"down_votes":13,"body":"Mm. It's not really the pick we're talking about, it's the lack of social agreement and cooperation on the approach to the game across hundreds and hundreds of instances. So let's stress test the logic and apply the standard to a roaming Bard player. Because Bard roaming like crazy is a broadly understood gameplay concept, we probably never ever reach a situation quite like this one.","replies":[{"poster":"emernic","date":"2016-11-17T06:49:13.903+0000","up_votes":19,"down_votes":2,"body":"> [{quoted}](name=Riot Gromp,realm=NA,application-id=ZGEFLEUQ,discussion-id=79aGu3wR,comment-id=006b00020003,timestamp=2016-11-17T06:36:31.355+0000)\n>\n> Mm. It&#x27;s not really the pick we&#x27;re talking about, it&#x27;s the lack of social agreement and cooperation on the approach to the game across hundreds and hundreds of instances. So let&#x27;s stress test the logic and apply the standard to a roaming Bard player. Because Bard roaming like crazy is a broadly understood gameplay concept, we probably never ever reach a situation quite like this one.\n\nSo does this mean that if proxy singed were invented today rather than a few years ago the player would be permanently banned by Riot instead of allowed to continue? Because if you look back at the old threads from Druiddroid EVERYBODY hated his strategy A LOT and basically considered it to be trolling/intent feeding. But, back then, Riot actually manually unbanned his account after it was auto-banned due to reports. Is it fair to say that the stance has changed?","replies":[]},{"poster":"1 800 Top Lane","date":"2016-11-17T12:46:58.829+0000","up_votes":10,"down_votes":0,"body":"\"it's the lack of social agreement and cooperation\"\n\nYou realize that is literally how solo queue is right?\n\nI've played hundreds upon hundreds of games where not a single word was said in champ select or in-game.","replies":[]}]},{"poster":"LuckerNoob","date":"2016-11-16T23:27:27.455+0000","up_votes":20,"down_votes":4,"body":"Bard has the option of leaving his carry a nest of heals to compensate for his absence, and has other abilities that allow him to roam quick enough to be back before/when the heals have been spent. A good Bard won't roam before his carry is set up nicely.","replies":[]}]},{"poster":"Elikain","date":"2016-11-16T21:23:36.123+0000","up_votes":6,"down_votes":2,"body":"Thank you for clarifying.\nHonestly, i don't really care what people play as long as they try to win. But as you said, showing no flexibility with some wacky experimental strategies, picks and summoner spells and then forcing their team (by action) to deal with it in the middle of the game when no one wanted to sign up for that, is the reason they got themselves into this mess.\n\nThere has to be a line drawn where they sometimes get what they want and sometimes, they accept the team may not be open for an experiment of this magnitude.","replies":[{"poster":"Cardinal Sinveil","date":"2016-11-16T21:27:05.891+0000","up_votes":16,"down_votes":6,"body":"What about (and I quote) _\" literally hundreds of games the player inflicted a huge amount of disruption on **players** who didn’t agree to their chemistry experiments\"_ and THEIR lack of flexibility?","replies":[{"poster":"Dominick Destine","date":"2016-11-17T01:54:25.877+0000","up_votes":11,"down_votes":4,"body":"> [{quoted}](name=Cardinal Sinveil,realm=EUW,application-id=ZGEFLEUQ,discussion-id=79aGu3wR,comment-id=006b00010000,timestamp=2016-11-16T21:27:05.891+0000)\n>\n> What about (and I quote) _&quot; literally hundreds of games the player inflicted a huge amount of disruption on **players** who didn’t agree to their chemistry experiments&quot;_ and THEIR lack of flexibility?\n\nThe needs of the many outweigh the needs of the few.\n\nIn other words; Don't troll.","replies":[]}]}]}]},{"poster":"theArtifacts","date":"2016-11-15T14:32:42.265+0000","up_votes":60,"down_votes":19,"body":"THANK YOU","replies":[]},{"poster":"Shadòw","date":"2016-11-15T14:34:20.671+0000","up_votes":68,"down_votes":41,"body":"there is no clear line on what's bannable and what not.\n\nuntil today i always thought you can play what you want as long as you try to win (he had >50% winrate)\n\nimo he shouldn't get banned.\n\npicking off META should never be reportable even if your team doesn't agree with you.","replies":[{"poster":"Wuks","date":"2016-11-15T14:46:52.092+0000","up_votes":43,"down_votes":22,"body":"You bring up a great point, but the issue isn't that they picked off meta or even that they played off meta, but rather that they refused to communicate with their team in the way that they played. As per roles, you're expected to play the map unless you want to do otherwise and your team agrees. If the roles were minorly reversed and the AD carry left lane to AFK farm jungle or decided to duo top or duo mid, wouldn't that be a similar situation? Trying is one thing, but playing to what your team needs and expects is another thing.","replies":[{"poster":"Shadòw","date":"2016-11-15T14:59:11.614+0000","up_votes":24,"down_votes":24,"body":"but is Duo jungling really reportable?\n\nRiot even clearly stated that you can't report sb for not sticking to the META-Game \n\nhttps://support.riotgames.com/hc/en-us/articles/201752884-Reporting-a-Player#h2q5\n\n_but aren't this expectations just there because Solo Jungling and Duo Bot are META?_\n\nIt is arguable if forcing not only an Off-META pick, but an whole tactic _should be_ reportable and even bannable, but then Riot needs to rewrite their statements on what's reportable and what not.","replies":[{"poster":"Wuks","date":"2016-11-15T15:04:55.871+0000","up_votes":27,"down_votes":8,"body":"Again, the issue isn't the pick. Duo jungle is fine. I've done it plenty of times. I've done it with Cho'Gath. I've done it with Kayle. I've done it with Fiddlesticks. It's hilarious, it works, it's allowed. \n\nIn this case, the problem isn't that there's a double jungler. With your example, the problem arises when a player holds a pick and then changes to a jungler and picks up smite at the last second and says \"I'm jungle now\" (bonus points when both junglers try to contest each other for camps). The way you choose to communicate (or not communicate) with your team determines the atmosphere of the game and affects the match's win conditions.","replies":[{"poster":"Shadòw","date":"2016-11-15T15:14:30.205+0000","up_votes":21,"down_votes":12,"body":"i don't have exact informations on how the champ selects of the player looked like,\n\nbut i don't think the player (he had 2 Million Mastery points) did actually last second pick smite.\n\ni think he had {{champion:27}}  and {{summoner:6}} {{summoner:11}} listed from the beginning as he played it every game.\nPicking a role and then forcing out another player out of a role is clearly reportable, but did he really do that?\n\nHis intention was never to force the Jungler out of his Role, but simply play completely off-META with Duo Jungle. And that worked out pretty good as he had >50% Winrate on over 1000 Games.\n\nfrom a gameplay Video from a {{champion:27}} {{summoner:6}} {{summoner:11}} Support Main that i think the player was (as i have never actually read his name somewhere) he mostly counterjungled and proxy-farmed.\n\nbut my point is, is actually playing completely Off-META reportable if your intention is NOT to force out a teammate out of his role?","replies":[{"poster":"AeroWaffle","date":"2016-11-15T15:38:07.355+0000","up_votes":25,"down_votes":4,"body":"From what I understand, his >50% winrate was primarily from his adventures in top lane, not his \"support but actually just jungling\" games.","replies":[{"poster":"Diggi Fetti Aiär","date":"2016-11-16T19:25:39.729+0000","up_votes":8,"down_votes":3,"body":"> [{quoted}](name=AeroWaffle,realm=NA,application-id=ZGEFLEUQ,discussion-id=79aGu3wR,comment-id=000200000000000100000000,timestamp=2016-11-15T15:38:07.355+0000)\n>\n> From what I understand, his &gt;50% winrate was primarily from his adventures in top lane, not his &quot;support but actually just jungling&quot; games.\n\nhttp://213.133.99.163/test/result.html\n\ndoesn't look like the winrate comes from 200 games in toplane but rather from 1750 games as smite support.","replies":[{"poster":"AeroWaffle","date":"2016-11-16T21:06:34.842+0000","up_votes":6,"down_votes":0,"body":"I took a dive into that analyzer. It looks like it will list him as DBLJNGL if he records himself and someone else as jungle in a match (when he's playing as singed). It doesn't record what role he actually queued as.\n\nDoes he only double jungle when he plays support?\n\nEdit:\nOn further delving (because I was interested in the code, and data gathering code is always interesting), it looks like the analyzer gives a vastly different result compared to the static \"result.html\" you linked.\n\nFiltering out any match that isn't TEAM_BUILDER_DRAFT_RANKED_5x5, isn't singed, and isn't him, only gives 454 games as DBLJNGL. A lot of games, true, but JUNGLE had 1408 games.\n\nI also added some code (because I was curious). And **_DAMN_**.\n\nI fear for this man's health if the data is correct.\n\nCombining his total match duration places him at 68.44 days spent **_in game_** in 2970 games. That's over 21% of the year (so far) he's spent playing league. This doesn't even account for the additional time of queue, champ select, dodges, etc.\n\nAnalyzer and data link that I used;\nhttp://213.133.99.163/test/","replies":[{"poster":"AdellaideSkyhart","date":"2016-11-17T05:56:53.134+0000","up_votes":7,"down_votes":1,"body":"my health is fine lol, ty <3","replies":[]}]}]}]},{"poster":"TheHappyReaperz","date":"2016-11-15T16:36:28.467+0000","up_votes":13,"down_votes":5,"body":"Playing off-meta isn't reportable. Refusing to cooperate with your team is. If your ADC and Jungle agree to it, the players your decision directly effects, go ahead and do it.","replies":[]}]},{"poster":"ShaolinToilet","date":"2016-11-15T17:16:39.133+0000","up_votes":21,"down_votes":20,"body":"I think k you need to do more research. Every champ select this singed player would post a paragraph of what he was going to do. It should NOT be up to his team if that's okay. As long as he isn't harassing anyone or intentionally losing it should be perfectly OK. you should NOT have to get your whole teams approval before going off meta. Think about this. If he only played blind pick do you really think he would get banned?","replies":[{"poster":"Battlecast Sona","date":"2016-11-15T17:32:48.270+0000","up_votes":22,"down_votes":21,"body":"it should absolutely be up to your team in Ranked whether you can do a weird off-meta strategy.\n\nCopy pastaing a paragraph is **NOT** communication.","replies":[{"poster":"ShaolinToilet","date":"2016-11-15T20:11:27.644+0000","up_votes":11,"down_votes":1,"body":"Why should it be up to your team? If the meta becomes something where support always goes double jungle(this is just an example) and someone decides to support bot Lane for all of his games then can he get banned? His team doesn't like it but he believes it's the best way to win with his champion. There ARE off meta strategies that are better than meta ones. You should not have to get your teams permission every single game in order to play a certain way. In fact I'm guessing it's almost impossible to have 4 other people agree with an off meta strat. Considering there's at least 1 sheep out of those people. They will report and call him a troll even if 3 other players think it's OK.","replies":[]}]}]}]}]}]}]},{"poster":"Masterkerfuffle","date":"2016-11-15T17:35:51.090+0000","up_votes":17,"down_votes":1,"body":"http://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/Be9Zbj6O-riot-is-this-breaking-the-summoners-code\n\nTake a loot at that thread. About 6 months ago, I asked whether it was okay for me to play Smite \"Support\" Roaming Shaco and counterjungle. Wuks replied and said that's okay, as long as I got my team's permission. \n\nThis situation isn't new.","replies":[{"poster":"Wuks","date":"2016-11-15T18:36:33.112+0000","up_votes":17,"down_votes":2,"body":"It's times like these that I'm glad I'm consistent. Thanks for the link.","replies":[]}]},{"poster":"N Pelosi","date":"2016-11-15T14:42:48.027+0000","up_votes":40,"down_votes":23,"body":"> [{quoted}](name=Wuks,realm=NA,application-id=ZGEFLEUQ,discussion-id=79aGu3wR,comment-id=,timestamp=2016-11-15T14:28:47.707+0000)\n>\n\n> \n> Once communication breaks down, the likelihood of victory is drastically diminished.\n\nYet the player in question maintained a respectable win rate. I'd go so far as to say his winrate was actually depressed by the intolerance of the people who reported him, rather than his own actions.\n\n\n> [{quoted}](name=Wuks,realm=NA,application-id=ZGEFLEUQ,discussion-id=79aGu3wR,comment-id=,timestamp=2016-11-15T14:28:47.707+0000)\n>\n> (4) Enjoy Yourself, but not at Anyone Else's Expense\n\nNow that is an awfully subjective basis for anything. I hate supporting Ezreal players because their playstyle doesn't match mine. I hate supporting Vayne players because....reasons. Does that mean they should get banned for ruining my enjoyment? Absolutely not. I don't have control over what my team is and isn't allowed to do so long as their efforts are made in good faith to win the match, and their chat conduct is within reason.\n\nThis decision is seriously disappointing. It is catering to a majority that refuses to, or is unable to, handle when things don't go how they want them to go. It will drive creativity out of the game, further stifling an already stagnating meta. Riot already works hard on balance issues to keep the meta from being overly stagnant, and this decision from the player behavior team is in direct opposition to that.\n\nStating that off meta isn't bannable is all nice and well, but this is exactly what many of us perceive has been punished here. Meta isn't strictly champion, it's also strategy. Riot is playing semantic games. By banning that player, they are in fact banning off meta because the number of teams that will accept off meta strategies in practice is all but nonexistant if you give them the ability to reject it. It's the same logic that has been used to strike down many laws. Allow one thing, then place legal barriers in front of it such the thing that is supposedly allowed is unreachable in practice. Usually those barriers get removed by higher courts.","replies":[]},{"poster":"Chamuel85","date":"2016-11-15T14:53:03.285+0000","up_votes":16,"down_votes":2,"body":"I cannot find it now, but wasn't there a communication from Riot saying \"You may want to play Singed support, but your teammates don't want you to play Singed Support.\"  That doesn't sound much in line with everything else that I've heard.   I'm unsure how I feel about a Riot employee even mentioning this in any sort of communication on why you are banned.  It makes me feel like I'm reportable if my teammates don't like my choice (regardless of the fact that he wasn't even 'supporting' in the traditional sense).\n\nI'm also unsure how I feel about the 'my primary job' is to protect the ADC.  As a low ELO (silver 2 on my main account), there are more than enough games where my ADC is quite possibly new or just flat out having a bad game.  In these scenarios my best bet is not to spend most of my time (outside of laning phase) with the ADC as a lot of those games he'll be a non factor.  Isn't the primary job of the support is to make sure your carries get fed and engage or peel?  Making it seem mandatory that you must do this for your ADC just makes me feel like it's tying my hands even further when climbing as a support.\n\nWhile supports 'carry', it's a carry by proxy where you carry by spoon feeding the people who'll do the damage and get the kills.  Without that, your carry style can't / won't happen (unless you're an AP Mage Support like {{champion:63}} {{champion:143}} {{champion:161}} etc).\n\nAlso, Support isn't necessarily about shutting down their bot lane (unless you think certain support champions like {{champion:40}} aren't supports as while you can do a lot to protect your adc in bot, but really she's good at going even in lane... Especially if you're {{champion:81}} + {{champion:40}} vs like {{champion:202}} {{champion:25}}... just won't be a lane you do well in)","replies":[]},{"poster":"YondorDaChrusher","date":"2016-11-15T15:12:55.966+0000","up_votes":13,"down_votes":0,"body":"Those two codes are very fuzzy and opened to interpretation. The first one basically says, pick what your team needs. Well if singed is what get you wins, it's probably what your team needs. The second simply says communicate with your team. Does that mean chat? Pings? \n\nPersonally I've played all roles and encountered a variety of playstyles. As an ADC, if I've encountered off-meta, I just adjust my playstyle accordingly. Being able to adapt to situations as they arise should be a skill any decent player can utilize. If singeds off-meta style is winning the game, then I don't see anything wrong with it. You'd think supporting a winning strategy, no matter how unfamiliar, would be a positive experience.","replies":[]},{"poster":"AFK Push","date":"2016-11-16T00:09:04.216+0000","up_votes":11,"down_votes":7,"body":"Before the alleged singed support main chooses his pick he tells his team what his intentions are everygame. He is a complete victim, because he does in fact communicate. Research into the subject a little more before you post this stuff.","replies":[]}]}