{"poster":"DarkAngel2727","date":"2016-09-01T18:48:16.095+0000","title":"Game client keeps crashing","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"It doesn't constantly happen but when it does it is really annoying and gets me 5 minute bans from matchmaking when ever I'm loading into dynamic queue (I haven't tried to see if it happens on the other game types) but the client doesn't give any warning and just closes out. When I try to reopen league it says that it is still open but it is nowhere to be found i have searched through every process I  have open at the time and it just isn't there the only way I can describe it is when you get finished picking champs and the game goes into the minimized state but when i go to look where it usually would be its no there. Please give me a suggestion on what I should do because repairing doesn't fix it either.\r\n\r\nThank you and have a wonderful day! :D","replies":[{"poster":"Targons Blade","date":"2016-09-01T23:03:34.770+0000","up_votes":1,"down_votes":0,"body":"When the client disappears after champ select or random closes out, it's typically due to the client dropping its connection to the game servers. Most of the time this happens if there are local network configurations that conflict with League, so I recommend working through our [connection guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) as a first step.\n\nLet me know if you continue to have these issues.","replies":[{"poster":"DarkAngel2727","date":"2016-09-03T10:42:25.970+0000","up_votes":1,"down_votes":0,"body":"It isn't after champ select it is during champ select like just a few minutes ago i queued up and went to pick who I was going to ban and the client just closed out without warning it didn't even put up a not responding screen. After this has happened and I go to reopen league again it says another client is open and asks if i want to terminate the one that glitched out. So that made me think that it is open somewhere but i went through each of my processes and i couldn't find that client running anywhere and when I get back on it gives me a 5 minute queue ban. I am worried that this is going to stack up and result into a more serious ban rather than just the 5 minute queue ban.\n\nI have an idea but I'm not really sure. It may be when a systems CPU gets maxed out in processes such as opening up another program or doing a scan or watching a video that it doesn't give league the space it needs and it throws the client into a loophole or a non responsive state and makes it into a sort of ghost program or whatever the term is about a program that doesn't show up under the task manager or anywhere else.","replies":[{"poster":"Targons Blade","date":"2016-09-04T16:28:32.533+0000","up_votes":1,"down_votes":0,"body":"Ah, let me clarify. Basically, any issues while in champ select and the client closing out are caused by the connection issues I mentioned previously. I definitely recommend working through that guide to see if anything changes.\n\nLet me know if something does.","replies":[]}]}]}]}