{"poster":"AwesomeChad","date":"2017-05-22T20:17:25.462+0000","title":"PSA to all the people saying SKT should let other teams win. this is a COMPETITION.","subforum":"Esports","up_votes":115,"down_votes":11,"body":"Only the best deserves to win.  The fact that you&#039;re asking a team to go &quot;easy&quot; on the other teams shows that you don&#039;t care about seeing good gameplay and only want your favorite teams to win.  If these other teams want to win, they need to step up their game.  Korea does NOT have to provide ANY handicap for the other regions.  If you really care about these other teams,  then instead of whining, invest your time and money into helping these teams become better.   /end rant","replies":[{"poster":"NineTailedMystic","date":"2017-05-22T20:48:28.417+0000","up_votes":12,"down_votes":39,"body":"It is _boring_ to watch SKT continually win. Why bother watching when I can bet on SKT and go on with my day. I want SKT to be crushed. I don't care who wins, I only care SKT loses. No more SKT skins, no more Faker worship.","replies":[{"poster":"SithesisLord","date":"2017-05-22T20:55:07.592+0000","up_votes":42,"down_votes":1,"body":"Then maybe, just maybe, all the other teams from all the other regions should see that as a sign that they still need to improve a lot in all sections?","replies":[{"poster":"NineTailedMystic","date":"2017-05-22T21:10:50.102+0000","up_votes":5,"down_votes":21,"body":"Like that'll happen. My only hope is Faker finally gets his mandatory military service to boot him out of esports for a long while.","replies":[{"poster":"MissingKayo","date":"2017-05-23T01:51:32.121+0000","up_votes":15,"down_votes":2,"body":"Except pro players like him are absolved of said draft.\n\nSo you can keep crying.","replies":[{"poster":"NineTailedMystic","date":"2017-05-23T02:50:18.608+0000","up_votes":3,"down_votes":15,"body":"That's actually disgusting. Also, crying? Excuse me for wanting an actual reason to get invested into esports. Not the train wreck it is now.","replies":[{"poster":"JaxMoonStealer","date":"2017-05-23T03:26:24.012+0000","up_votes":14,"down_votes":0,"body":"Then the rest of the world should just git gud.","replies":[]},{"poster":"NiceTryVi","date":"2017-05-23T17:37:42.123+0000","up_votes":3,"down_votes":2,"body":"You can get invested in your local splits, you know. Nobody is forcing you to watch Worlds/MSI. And even then, SKT is only playing 1 team at a time. So just don't watch SKT's games. Instead of bitching about it here.","replies":[{"poster":"NineTailedMystic","date":"2017-05-23T21:51:22.698+0000","up_votes":2,"down_votes":5,"body":"Worlds and MSI have an actual impact in game via skins and advertisement.\n\nEdit: Also how other teams still have to face SKT and they'll still lose.","replies":[{"poster":"NiceTryVi","date":"2017-05-23T23:28:14.396+0000","up_votes":2,"down_votes":2,"body":"Nobody is forcing you to buy the skins either. And by the way, did you ever consider the fact that maybe people like to watch the SKT games because since they are expected to win, any upset is huge and awesome to watch? Or that they come up with and execute cool plays that people like to see? Or are you just so fixated on wanting *your* team to win that you just don't give a shit about what other people like? That is like hating on Ohio State and Clemson because they win almost every game they play. Clemson went 14-1 this year in football. Should I hope that their star player gets drafted and someone shitstomps them just because they are dominant? No, I should hope that other teams train and improve in order to climb to their level and beat them that way. You are such a whiny brat, making a problem where there is none.","replies":[{"poster":"NineTailedMystic","date":"2017-05-23T23:52:07.155+0000","up_votes":1,"down_votes":5,"body":"Considering how dedicated I am to playing Ahri and I feel obligated to buy all of her skins... yea it'd infuriate me to no end if they give her SKT Ahri especially with it being associated with Faker. And an upset is unlikely considering how dominant they are. At least when ZeRo was dominant in Smash 4, his matches were often close 3-2s. With SKT in League, teams in _finals_ are lucky to get 1 game off of them. The closest match was last years Worlds vs ROX and nothing has come close since.\n\nI don't have a team I want to win, only SKT to lose. I don't want more SKT skins, I don't want to hear more about SKT. I can't even go to the League subreddit because of how infested it with SKT and other Esports stuff when I just want to discuss gameplay.\n\n\"whiny brat\", excuuuuuse me princess, for wanting an actual _competitive_ tournament scene. Go fuck yourself too, if you're gonna treat me like that.","replies":[{"poster":"NiceTryVi","date":"2017-05-24T02:12:36.260+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"NineTailedMystic","date":"2017-05-24T02:17:47.102+0000","up_votes":2,"down_votes":4,"body":">You don't want to see SKT Ahri? DON'T BUY IT.\n\nToo bad not buying it doesn't make it go away.","replies":[{"poster":"About99Penguins","date":"2017-05-24T03:36:50.535+0000","up_votes":6,"down_votes":1,"body":"Are you such a child that you cannot even deal with it existing? Jesus Christ, you are such a little baby. You should be embarrassed of yourself for acting like this, grow up.","replies":[]}]}]}]}]}]}]}]},{"poster":"Masala Chai","date":"2017-05-23T14:04:41.335+0000","up_votes":2,"down_votes":1,"body":"That's wrong.\n\nUnder RoK law, everyone including public figures is reqiured to enter military service. Public figures are allowed to delay their military service by up to 6 months when they are called and unless Faker has physical or mental illness, (which spoiler alert, he doesn't) he is required to go or face deportation. University students, police and firefighters are allowed temporary exemptions as well.\n\nThe Defensr Ministry is also seeking to end exemptions so there's that as well.","replies":[{"poster":"Maszii","date":"2017-05-24T12:56:24.634+0000","up_votes":1,"down_votes":0,"body":"So enroll him in a uni and fixed","replies":[]}]}]}]},{"poster":"Stars Shaper","date":"2017-05-22T20:56:16.536+0000","up_votes":11,"down_votes":3,"body":"Team Players have little to do with the money they get from doing that \"job\".\n\nSouth Korea teams are financed by the government itself if I recall right.","replies":[{"poster":"ChaoticPinecone","date":"2017-05-23T03:31:07.583+0000","up_votes":3,"down_votes":1,"body":"Yes, South Korean teams are financed by basically the biggest companies in South Korea, like Samsung and SK Telecom. But its not like South Korea is paying its players leaps and bounds above their EU or NA contemporaries, and I think they pay less than the Chinese (which is why the whole \"exodus\" happened). Its just a different view toward gaming culture - Faker reportedly denied a massive contract in China to stay in Korea for less money, but the chance to win more championships. \n\nNeither is particularly wrong. From another perspective, the Korean players are stupid - they are giving up hundreds of thousands (or even millions) of dollars, which could keep them and their family living comfortably for generations. But they are winning Championships.","replies":[{"poster":"Kinjishi","date":"2017-05-23T04:55:29.943+0000","up_votes":3,"down_votes":2,"body":"Wouldn't cry for Faker, he's still making a lot of money.\nhttps://www.esportsearnings.com/players/3832-faker-lee-sang-hyeok","replies":[{"poster":"ChaoticPinecone","date":"2017-05-23T07:36:22.711+0000","up_votes":5,"down_votes":1,"body":"Nobodys crying for Faker. But as the best player in the world, he probably could make the most money out of any player too. But he decided not to. He still makes a lot, but he could double or triple his current income if he wasnt so adamant on chasing championships. \n\nAnd again - Faker is the best player in the world. What about players like Peanut? Peanut doesnt have prize winnings anywhere near as much as Faker or the salary. He still puts in just as much time as Faker though.\n\nKoreans arent automatically better at gaming than NA or EU. But its this type of \"winning over everything\" mentality that makes KR win so often. While players in other regions are spending a lot of time streaming (either as part of their contract for sponsors or for donations), KR is scrimming.","replies":[]}]}]}]}]},{"poster":"TwitchInMyPants","date":"2017-05-22T21:20:38.065+0000","up_votes":7,"down_votes":0,"body":"What's boring is the teams that play like crap when they fight SKT.  Bad play isn't fun to watch, the other regions need to step up their game.","replies":[{"poster":"zaire90","date":"2017-05-23T01:49:35.957+0000","up_votes":5,"down_votes":0,"body":"Thats why I loved the Rox vs SKT  last year that was such a good game wished that was a final rather than i think it was ssg","replies":[{"poster":"OHminus","date":"2017-05-24T12:41:23.783+0000","up_votes":1,"down_votes":0,"body":"SKT vs SSG was a nice series too. Game 3 was amazing in particular.","replies":[]}]}]}]},{"poster":"Straley","date":"2017-05-22T21:45:51.798+0000","up_votes":17,"down_votes":1,"body":"Well I mean maybe if these teams stopped going to these Korean bootcamps to try unsuccessfully to copy KOREAN strategies and actually come up with something unique to their own team or region maybe there would be a better chance of them winning.","replies":[{"poster":"Sauceyapples","date":"2017-05-22T23:45:28.599+0000","up_votes":6,"down_votes":1,"body":"Isn't learning what your opponent does part of coming up with a strategy to oppose them?","replies":[{"poster":"Tormentula","date":"2017-05-23T00:03:22.397+0000","up_votes":20,"down_votes":1,"body":"Except they hardly learn anything, instead they try to copy it.\n\nThen what results is KR vs. Diet KR \n\nHonestly, if you ever watched pro players streaming their korean games, they're just playing like they normally would, you don't notice anything new adjusting to Korean metas from their end and you never see them take their games anymore seriously than their usual games. Hell one livestream I watched was a c9 player do nothing but try to get faker to say something. Is this what the training is for? \n\nMeanwhile when you watch the SKT members stream, they look like they're trying their hardest and preparing for LCS taking every game seriously, and for that, is why I say \"SKT deserves to win, they're actually putting their all into this\"","replies":[]}]},{"poster":"Anidan","date":"2017-05-22T23:13:56.045+0000","up_votes":2,"down_votes":1,"body":"I think last teams tried to come up with their own strategies they still got stomped out by KR/CN. So there's that.","replies":[{"poster":"ChaoticPinecone","date":"2017-05-23T03:43:41.724+0000","up_votes":2,"down_votes":0,"body":"Well, to be fair China did beat Korea when they decided to make their own strategies. The most memorable being the \"everybody counter Faker\" strat at MSI 2015.","replies":[{"poster":"Tormentula","date":"2017-05-23T03:49:20.964+0000","up_votes":10,"down_votes":0,"body":"Or the \"play ADCs that throw off SKT and win\"\n\n{{champion:21}} supp almost won worlds and brought a 2-0 to a 2-2, almost making SKT lose until SKT had enough and banned her the last game.\n{{champion:236}} mid snowballed faker as hard as a solo q game recently. \n\nI'm yelling ya NA... use a teamcomp of {{champion:51}} {{champion:29}} {{champion:236}} {{champion:22}} {{champion:21}} and SKT will have no fucking clue what to do.","replies":[{"poster":"SpecterVonBaren","date":"2017-05-23T05:20:57.309+0000","up_votes":6,"down_votes":0,"body":"So what we need is Season 5 Unicorns of Love?","replies":[{"poster":"Anidan","date":"2017-05-23T05:39:22.329+0000","up_votes":7,"down_votes":0,"body":"We need Season 5 Unicorns of Love every year. Those were some fun games to watch. Games that remind you that the rest of the roster and weird strats exist even in pro games, and I like that.","replies":[{"poster":"Fondling Gems","date":"2017-05-23T06:28:52.241+0000","up_votes":5,"down_votes":0,"body":"Unicorns of Love and Team Impulse.  I loved Team Impulse, I don't care if their strats were closer to bronze strats than their competitors, they mixed shit up.\n\nHyper aggressive top and jungle, with a dependable mid laner who was flexible and was good at capitalizing on kills.  Then to round it off they would just run Janna/Sivir bot lanes 24/7 to turn bot into a non factor the whole game until they were speeding the whole team towards the enemy in a sudden bomb rush.\n\nGod I miss Impulse.  Great team to watch.","replies":[]}]}]}]}]}]}]},{"poster":"58697132DEL1","date":"2017-05-22T21:44:57.075+0000","up_votes":13,"down_votes":0,"body":"True facts.\n\nPersonal conspiracy theory: Korea fully supports their esports team and well, esports as a whole. EU and NA \"support\" it like via fans and us players and teams, but look at the support for say LCS vs any \"Jock\" sport game. Baseball, basketball, oh man waaayyy too many football examples. I just think Korea's embrace of esports athletes as REAL athletes and treating them as such helps, whteher it's via finances or support or training or whatever. So they just get to perform better. \nAgain just a theory, stemming mainly from the fact people mock how i can sit and watch Worlds matches in my TSM gear all day, but they all gather for the superbowl in full body paint and fail to see the irony.....","replies":[{"poster":"JedenVojak","date":"2017-05-23T03:06:24.709+0000","up_votes":4,"down_votes":14,"body":"> [{quoted}](name=StarGuardianWeeb,realm=NA,application-id=9hBQwnEU,discussion-id=z4pb9zE9,comment-id=0003,timestamp=2017-05-22T21:44:57.075+0000)\n>\n> True facts.\n> \n> Personal conspiracy theory: Korea fully supports their esports team and well, esports as a whole. EU and NA &quot;support&quot; it like via fans and us players and teams, but look at the support for say LCS vs any &quot;Jock&quot; sport game. Baseball, basketball, oh man waaayyy too many football examples. I just think Korea&#x27;s embrace of esports athletes as REAL athletes and treating them as such helps, whteher it&#x27;s via finances or support or training or whatever. So they just get to perform better. \n> Again just a theory, stemming mainly from the fact people mock how i can sit and watch Worlds matches in my TSM gear all day, but they all gather for the superbowl in full body paint and fail to see the irony.....\n\nThey aren't real athletes though. They're just a bunch of dudes playing video games; not that there's anything wrong with that, because there isn't. I don't really think video game tournaments need to pretend to be sports to be legitimate.","replies":[{"poster":"58697132DEL1","date":"2017-05-23T04:29:54.278+0000","up_votes":2,"down_votes":0,"body":"I feel you, athletes really isn't a way to describe them, but I use it until we have a better term to cross both forms of sports as \"these players are the peak performance examples of their respected games and fields\" or something. Oh and I just remembered I saw this video that helped this theory, oddly enough called game theory, and it kinda makes what i mean. \n\nhttps://www.youtube.com/watch?v=qYlpxFWXCM8\n(i agree with and disagree with parts of it, but it helps what i mean)\n(EDIT: also everyone should just like, check this video out. It even mentions League in a lot of examples!)\n\nBasically this is how all of NA and most of EU see esports, \"just some guys playing games, no big deal\" and such, but Korea basically puts it on the levels we put shit like NFL and what not, so I think that leads to a sorta \"snowball\" where every time they win, it just means MORE investing in keeping them top of the game so they win _MORE_! \n\n~~But again, thats just me speculating into the advanced politics and psycology of various countries with no real basis of info lol.~~","replies":[{"poster":"JedenVojak","date":"2017-05-23T05:46:01.500+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=StarGuardianWeeb,realm=NA,application-id=9hBQwnEU,discussion-id=z4pb9zE9,comment-id=000300000000,timestamp=2017-05-23T04:29:54.278+0000)\n>\n> I feel you, athletes really isn&#x27;t a way to describe them, but I use it until we have a better term to cross both forms of sports as &quot;these players are the peak performance examples of their respected games and fields&quot; or something. Oh and I just remembered I saw this video that helped this theory, oddly enough called game theory, and it kinda makes what i mean. \n\nHow about Gamestro's? Playmeister's?\n\nAlso I've seen the game theory video before, and the problem I have with it is that he makes a lot weird equivalencies that don't actually get to the heart of why a sport is a sport. I mean, actors have to work out for their roles, they're competing against other actors for role selection in movies as well as the movies themselves competing. Guess that means movie acting is a sport too, right?\n\nThe thing that makes me sad is that this \"esports\" thing seems more an attempt to try and get video game tournaments branded under some other label (i.e. a sport), which actually delegitimizes video game tournaments as being worth attention - I mean, it doesn't need to be a sport to be competitive or require lots of skill, so why are they forcing this?","replies":[{"poster":"58697132DEL1","date":"2017-05-24T00:34:06.813+0000","up_votes":2,"down_votes":1,"body":"I'm not going to lie, I'm generally so dumbfounded and ecstatic that you share a different opinion than me but said so in an intelligent and polite manner without implying that me holding my opinion made me less of a person!\n\nthat is just so damn rare on the internet, much less in a community so stereotyped as toxic that I'm at a loss for words, but in a good way :D I like you random commentator.\n\nI actually see where you're coming from, the video itself is pretty shallow and I agree it makes a lot of stretches. I definitely hope more people look into the philosophy of what considers something to be a sport in the competitive sense and a sport as we know it nowadays and that video game tournaments have their own unique Place. Among the mainstream, but not in place of it is all I want. Then maybe we can see more (and better playing from the current) NA teams and such.","replies":[{"poster":"JedenVojak","date":"2017-05-24T02:55:23.049+0000","up_votes":1,"down_votes":0,"body":"I have no reason to be rude to people who aren't rude to me first.\n\nAs for what is or isn't a sport, the most important thing is: are you moving your body?\n\nEvery sport from football to water polo to even golf require the players to move from one place to another. If you are sedentary, then you are not playing a sport.\n\nRather than solving the problem of competitive video games not getting recognition by branding them as \"sports\", I think the superior option is to push the value of video games as a medium in and of itself.","replies":[{"poster":"58697132DEL1","date":"2017-05-24T05:17:06.469+0000","up_votes":1,"down_votes":0,"body":"Excellent point! Then yes I would say our games may not be sports, but i feel like if things such as Chess can be considered \"Athleticsof the mind\" I would consider most MOBAs and even a few FPS games to be in that same level. Strategy and skill are required alongside the teamwork and communication needed in almost any other sport.\n\nI liked your suggestion of \"Playmeisters\" and would like a spcific brand of \"Competitive Gaming\" but until then i suppose just calling it Esports and the players....players (lol) will do. Who knows ten years in the future maybe League will be in the olympics!!!!\n~~im just kidding lol~~","replies":[]}]}]}]}]}]}]},{"poster":"Mig89","date":"2017-05-22T22:37:24.746+0000","up_votes":10,"down_votes":1,"body":"I personally root for the best. I'm one of those bandwagon fans who is more loyal to players than teams in every sport except football. I love watching SKT play their game. As far as league of legends play goes, theirs is beautiful to watch. \nNA and EU win in just about every other sport so who really cares if they have esports. They've earned it the same way the US owns basketball and football, Canadians/Russians own hockey, Brazil/EU with soccer. \nDifferent regions worship different activities. It's just how it is. No reason to get upset. No one asks dominant countries to handicap their athletes in the olympics. No one asked Bolt to run on one leg","replies":[{"poster":"I Am Ravi","date":"2017-05-23T16:06:36.693+0000","up_votes":1,"down_votes":5,"body":"Just gonna say this, It's american football and football, not football and soccer. Just saying.\n\nAgree with the rest of your post though.","replies":[{"poster":"Hello I am Bird","date":"2017-05-23T19:57:30.008+0000","up_votes":4,"down_votes":0,"body":"In America, we call it football\nThis is the NA boards, so we're gonna call it football ._.","replies":[{"poster":"I Am Ravi","date":"2017-05-25T13:50:05.996+0000","up_votes":1,"down_votes":0,"body":"I live in South Africa, football is also known as soccer here, was just clarifying that's all.\nThe downvotes though XD.","replies":[{"poster":"Hello I am Bird","date":"2017-05-25T14:21:47.337+0000","up_votes":1,"down_votes":0,"body":"Yeah, I know it's a very american exclusive thing to call American football football, but I mean it's the NA boards, so the majority of us are american, so it's probably gonna be called football on the boards, clarification or not\n\nAlso, I didn't even downvote you lmao","replies":[]}]}]}]}]},{"poster":"BlackHairedGirl","date":"2017-05-23T00:20:55.216+0000","up_votes":7,"down_votes":2,"body":"I've always been cheering for SKT~ they're amazing, really.\nWhen they win it's not boring for me, they deserve it with their amazing play.","replies":[]},{"poster":"III BAKURYU III ","date":"2017-05-23T07:34:11.268+0000","up_votes":4,"down_votes":0,"body":"Yeah, it makes 0 sense to lose on purpose for other teams.  If you want to beat me or my team YOU put in the work, YOU put in the time, YOU \"get gud and carry\".  There might be an excuse for god given talent, but no excuses on improving.","replies":[]},{"poster":"Smitty Manjensen","date":"2017-05-23T17:43:21.389+0000","up_votes":3,"down_votes":0,"body":"I also think it's boring that they are winning, and I do know that NA and EU are garbage, but still would rather watch them. It's entertaining to watch 2 garbage team fighting each other than the top team fighting the garbage team.","replies":[]},{"poster":"ADC5LUT","date":"2017-05-23T02:47:48.368+0000","up_votes":3,"down_votes":0,"body":"I do agree that watching SKT win time and time again is boring af, but it is a competition and they're the best, they deserve to win. Their culture is just a better gaming culture than ours.","replies":[{"poster":"RainbowIcee","date":"2017-05-23T15:43:51.054+0000","up_votes":2,"down_votes":1,"body":"I don't honestly think they're that good above everyone else skill wise. I think it's just that the changes in league have made people afraid to fight on skill vs skill. Teams now won't dare go for a 1 v 1 they only fight if they have the advantage in numbers only because they're scared that the second they die an objective will be lost and that will be game. SKT gives no fucks and trust their skill levels, if team can make it in time and kill can be secure they go for it and they've been playing the same way since forever. Other teams are desperately trying to adapt to the riot changes to \"take advantage of the situation\" skt just practices git gud and it works wonders for them.","replies":[]}]},{"poster":"SpecterVonBaren","date":"2017-05-23T02:18:15.085+0000","up_votes":2,"down_votes":2,"body":"I'm fine with SKT winning again, I'm not fine with another bunch of skins with their horrible color scheme on them.","replies":[{"poster":"Tormentula","date":"2017-05-23T03:13:19.721+0000","up_votes":4,"down_votes":1,"body":"Then don't buy them.\n\nAlso is **both** of their color schemes bad? Both team skins they got had completely different color schemes.","replies":[]}]}]}