{"poster":"zork824","date":"2017-06-10T10:25:50.650+0000","title":"Come è finita la questione Telecom?","subforum":"Aiuto e supporto","up_votes":6,"down_votes":1,"body":"Io ho risolto usando una VPN. Mi hanno anche cambiato il modem ma zero, continua a dare problemi sui giochi Blizzard, Riot, tutti quelli online. Qualcuno ha sentito qualche tecnico serio (non gli operatori del 187 che non sanno praticamente nulla) e si &egrave; fatto spiegare quale &egrave; effettivamente il problema e se ci stanno lavorando? Gran parte della mia frustrazione viene dall&#039;assenza di spiegazioni sul fatto.","replies":[{"poster":"Arkadium","date":"2017-06-10T11:15:39.109+0000","up_votes":1,"down_votes":0,"body":"a me si e' risolto tutto \"magicamente\", avevo lo stesso problema di tutti, 25,30,40% di packet loss ogni partita , mi sono svegliato ( e anche alzato dal letto ) ieri e facendo un'aram per prova ha funzionato bene, ho cominciato a giocare ranked e non ho avuto molti problemi (tranne in alcuni punti ma raramente)","replies":[{"poster":"Ronqvist","date":"2017-06-10T18:25:39.350+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Uncle Rat,realm=EUW,application-id=98NGV4Al,discussion-id=5EyJeEIA,comment-id=0000,timestamp=2017-06-10T11:15:39.109+0000)\n>\n> a me si e&#x27; risolto tutto &quot;magicamente&quot;, avevo lo stesso problema di tutti, 25,30,40% di packet loss ogni partita , mi sono svegliato ( e anche alzato dal letto ) ieri e facendo un&#x27;aram per prova ha funzionato bene, ho cominciato a giocare ranked e non ho avuto molti problemi (tranne in alcuni punti ma raramente)\n\nBeato te. Io e molti altri siamo ancora in alto mare.","replies":[]}]},{"poster":"Freakìx","date":"2017-06-10T12:03:58.338+0000","up_votes":1,"down_votes":0,"body":"Non hanno risolto ancora nulla","replies":[]},{"poster":"Biciø 777","date":"2017-06-10T11:32:12.714+0000","up_votes":1,"down_votes":0,"body":"Quale vpn? Anche a me ieri notte non ha laggato ma oggi è un altro giorno e non si sa finchè non si prova","replies":[{"poster":"zork824","date":"2017-06-10T12:06:46.572+0000","up_votes":1,"down_votes":2,"body":"A me da ancora problemi, mi son rotto e sto usando PureVPN, 0 lag","replies":[]}]},{"poster":"DarkMagicianIT","date":"2017-06-11T11:54:55.912+0000","up_votes":1,"down_votes":1,"body":"Ragazzi, ho trovato la soluzione a tutto.\n\nhttps://boards.euw.leagueoflegends.com/it/c/aiuto-e-supporto-it/g9MMXqZE-trovata-la-soluzione-per-fixare-il-lag-dovuto-a-telecom","replies":[]},{"poster":"Keitech","date":"2017-06-10T18:05:49.346+0000","up_votes":1,"down_votes":1,"body":"idem utilizzo anche io una VPN (tunnelbear)\npurtroppo ci sono partite che non si hanno packet loss e tutto va bene ma poi senza motivo arriva il problema e diventa impossibile giocare","replies":[]},{"poster":"Etoclas","date":"2017-06-10T16:30:31.658+0000","up_votes":1,"down_votes":1,"body":"Che voi sappiate esistono vpn gratuiti per provare ad evitare i packet loss?","replies":[]},{"poster":"Sitrik","date":"2017-06-10T14:37:42.855+0000","up_votes":1,"down_votes":2,"body":"Qualcuno può consigliarmi come utilizzare correttamente PUREVPN? Mai utilizzato uno e vedendo le tante funzioni che ha il programma non credo di utilizzarlo nel modo migliore, io vado semplicemente nella modalità sicurity/private connection e mi connetto a uno spot italiano, tutto qui? La situazione è migliorata ma comunque laggo 45-70 ping, ogni tanto un freeze ci sta ma sicuramente molto molto meglio...","replies":[{"poster":"zork824","date":"2017-06-10T14:54:28.836+0000","up_votes":1,"down_votes":2,"body":"Metti la modalità streaming. Connettiti al server che ti da meno lag in game e hai fatto. Ti consiglio anche di cambiare protocollo nelle impostazioni e mettere quello meno sicuro ma più veloce. Io per giocare a overwatch e lol mi connetto a munich e funziona perfetto","replies":[{"poster":"Sitrik","date":"2017-06-10T15:37:35.313+0000","up_votes":1,"down_votes":2,"body":"di che zona sei? io Roma, come miglior spot mi da Italy (milano credo..) con 19ms e poi germania (Frankfurt) con 29ms... te? Io nella sezione Streaming metto per Entertainment Channels (Faster Streaming)...\nPer il protocollo metto PPTP è il meno protetto con solo 2 scudini :p","replies":[]}]}]}]}