{"poster":"howrang80","date":"2015-06-01T12:56:14.115+0000","title":"Suchen Leute oder Team im Bronzebereich","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Gr&uuml;&szlig;e, wir sind 2 Gelegenheitszocker der &auml;lteren Generation (30+)und d&uuml;mpeln in den Niederungen von B5-B2 herum. Wir suchen also ein Team, dem wir uns anschlie&szlig;en k&ouml;nnen oder Gleichgesinnte, um ein Team erstellen zu k&ouml;nnen. Da wir werkt&auml;tig sind, beschr&auml;nkt sich unsere Onlinezeit auf die Abendstunden (nicht vor 18.30 uhr). Da es sich als nicht praktikabel erwiesen hat, sich auf eine LAne festzulegen, sind wir quasi Allrounder, wobei wir nat&uuml;rlich schon unsere Lieblingsposition haben. Unser Mittel der Kommunikation ist ausschlie&szlig;lich TS3.\n\nWas wir wollen/suchen: Ein paar Mitstreiter, die &uuml;ber einen gewissen geistigen Horizont verf&uuml;gen, mit denen man sich normal unterhalten kann. Einen gem&uuml;tlichen Spiele-Abend, um vom Alltagsstress abschalten zu k&ouml;nnen, ohne da&szlig; st&auml;ndig einer verbal austickt, afk geht oder eine Lane/Champ pickt, von dem er nicht im geringsten Plan hat, was dort zu tun ist.\n\nWas wir nicht wollen: Gold(oder h&ouml;her)-Spieler, die sagen, die Elo w&auml;re egal und uns dann vorhalten, wie schlecht wir sind und nach dem ersten Spiel schon wieder das weite suchen. Leute die gro&szlig;artig ank&uuml;ndigen \"I counter Champ-XY\" und dann derbe eingehen. \n\nSo, wen da&szlig; jetzt nicht abgeschreckt hat, der m&ouml;ge sich melden.\n\n\n...mal etwas nach oben schieben. Also falls noch wer Interesse hat, einfach melden ;)","replies":[{"poster":"Hydronius","date":"2015-06-01T16:09:20.131+0000","up_votes":1,"down_votes":0,"body":"Hi!\nIch bin 16, Bronze 1 (nachdem ich dooferweise meine Silber Promo verhauen hab :D) und hätte Interesse, weil ich immer gerne mit anderen Spiele und außerdem am Ende der Saison einen Wardskin bekommen möchte... :P\nIch kann ebenfalls in der Regel immer ab so viertel vor 7 spielen, außer es kommt irgendetwas dazwischen. \nIch adde dich mal, bis dann.\nHydronius | Simon","replies":[]}]}