{"poster":"Daner","date":"2017-08-10T19:25:47.638+0000","title":"Acerca del Nuevo Campeón Ornn","subforum":"Off-topic y temas personales","up_votes":3,"down_votes":4,"body":"Bueno, yo y creo que muchos incluyendo ustedes opina que Ornn esta literal... Literal... LITERAAAAL...mente ROTO y necesita un balance antes de lanzarlo.\r\n\r\nPor acotaci&oacute;n m&iacute;a, les tengo una sugerencia:\r\n&gt; La Pasiva &quot;Forja viviete y maestro artezano&quot;: que al ser asesinado Ornn, &eacute;ste en su cad&aacute;ver deje su martillo el cual pueda ser recogido tanto por el oponente que pueda solo cargar con 1 el cual se a&ntilde;ada como un buff y pueda usarlo para tanto comprar 1 objeto en la tienda o mejorar 1 objeto y luego se rompa dicho martillo (usarlo cuando desee), y si no lo ocupa durante un tiempo, &eacute;ste se romper&aacute;, pero tambi&eacute;n pueda recogerlo un aliado para romperlo y el enemigo no pueda aprovecharlo.\r\n\r\n&gt; R &quot;Llamado del dios de la forja&quot; (opcional): no se si act&uacute;e as&iacute;, pero que la Cabra Gigante cuando sea llamada, &eacute;sta venga de una direcci&oacute;n aleatoria hacia Ornn.\r\n\r\nUna acotaci&oacute;n de Balanceo para que tener a Ornn en un equipo, no sea injusto para el otro. Muchas gracias.\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"9081913DEL1","date":"2017-08-10T19:56:04.703+0000","up_votes":3,"down_votes":0,"body":"Buenas!\n\nNo esta roto ornn, bueno es que aun no esta XD.\nEn cuanto a la pasiva, bueno eso es lo nuevo que trae el campeon, como siempre hay que ver como se da. Parece algo muy bueno, pero hay que ver como se puede explotar.\n\nEn cuanto a su w, la duracion es bastante corta pareciera.\n\nSu q, tiene bastante delay segun se muestra, con lo cual puedes salir de la trayectoria de combo como una poppy o algo.\n\nY su R, pues hay que ver, en si no parece que haga gran daño, pero el derribo si puede ser, ademas que es algo bueno saber de donde va a venir. Lo que pides es como no saber para donde saldria el ulti de lux XDDDD.\n\nEs mi opinion, hay que esperar que salga.\n\nSaludos!","replies":[]},{"poster":"Kawatori","date":"2017-08-10T19:40:18.774+0000","up_votes":3,"down_votes":0,"body":"Nisiquiera salio y ya estan diciendo que esta roto,paso lo mismo con kayn y con ivern.. todavia no esta al 100% dejen de llorar un poco y esperen al lanzamiento","replies":[]},{"poster":"Daner","date":"2017-08-10T20:10:09.217+0000","up_votes":1,"down_votes":2,"body":"Bueno, quiza tengan razon que no este Roto, pero la pasiva si que la encuentro un poco injusta, las otras habilidades estan bien, no me quejo tanto, para eso digo que le nerfeen las habilidades a Riven XDDD.\n\nLo que digo es que su Pasiva esta rota e injusta tanto para el adversario line como para el equipo enemigo entero.","replies":[]}]}