{"poster":"Panda Senseî","date":"2017-09-11T16:32:43.023+0000","title":"Matchmaking Queues sind nicht fair.","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":9,"body":"Sehr geehrtes Riot-Team. Ich befinde mich nun schon l&auml;ngere Zeit in Silber IV und habe gro&szlig;e Probleme, da raus zu kommen. Dies liegt zum einem daran, dass meiner Meinung nach die Matchmaking Queue nicht fair genug zusammengestellt bzw programmiert ist. In den meisten meiner Spiele habe ich damit zu k&auml;mpfen, dass entweder ein Spieler das Spiel verl&auml;sst, oder diese ein nicht angebrachtes Fehlverhalten an den Tag legen. Dazu geh&ouml;ren unter anderem Chat Spamming, aber auch Beleidigung sowie Provokationen. Ich w&uuml;rde mich diesbez&uuml;glich auf eine R&uuml;ckmeldung freuen, da ich der Ansicht bin, dass sich schnellstm&ouml;glich wieder etwas tun muss. \r\nDenn jeder kennt das Problem mit der Elo-Hell. Einmal drin, ist man lange Zeit dort gefangen, wegen der bereits oben genannten Gr&uuml;nde.","replies":[{"poster":"Time2Whine","date":"2017-09-12T15:41:27.445+0000","up_votes":3,"down_votes":0,"body":"In den letzten 20 Spielen im Schnitt 9 mal sterben und damit dem gegnerischen Team ordentlich Gold schenken. \nÖfters nur 3-5 CS/Minute haben und damit einen grauenhaften Farm haben sowie schlechtes Lasthitting haben.\nAls Supporter mit Sighstone mit am wenigsten Wards im Game setzen\n\nAber von Elo Hell sprechen.........erstmal solltest du deine eigenen Fehler erkennen und besser werden. Tust du das nicht und schiebst deine Elo weiter auf dein Team, das wohlgemerkt immer deinem Leistungsniveau entspricht, wirst immer in deiner Elo stecken bleiben","replies":[]},{"poster":"Abasin","date":"2017-09-11T19:28:38.944+0000","up_votes":2,"down_votes":0,"body":"Matchmaking und Spielerverhalten im Spiel haben mal gar nix miteinander zu tun. {{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"Sirrkas","date":"2017-09-11T17:06:49.855+0000","up_votes":3,"down_votes":1,"body":"Die Elohell wird allgemein als Ausrede benutzt, um sich selbst nicht zugestehen zu müssen, nicht gut genug zum Aufsteigen zu sein. Ansonsten wäre wohl noch die Definition als der Ort möglich, an dem man mit dem aktuellen eigenen Skilllevel nicht mehr aufsteigen kann. Da würde dann jemand, der zum Beispiel nach Silber 2 gehört, irgendwo in Silber 3 bis 1 merken, dass es schwierig wird, zu gewinnen. Das liegt aber nicht an den Mitspielern, sondern daran, dass man sich selbst nicht weit genug verbessert hat, um dem eigenen Team ausreichend Vorteile zu erbringen.","replies":[]},{"poster":"Temudschinn","date":"2017-09-11T19:44:01.488+0000","up_votes":1,"down_votes":1,"body":"EloHell ist ein Märchen.\nJa, es gibt ab und zu mal Leute die Leaven. Aber bei den Gegnern sogar öfters als im eign en Team, sprich sie HELFEN dir sogar! (auch wenn die einzelnen Spiele ätzend sind).\n\nDass die EloHell eine Erfindung ist sieht man auch gut daran, dass für jeden ein anderes Elo die Hölle ist...für die einen ist es Bronze, für dich silber, für wieder andere Gold, Platin oder Dia...","replies":[{"poster":"Qbert","date":"2017-09-12T07:33:56.307+0000","up_votes":1,"down_votes":0,"body":"Vielleicht ist die EloHell ein Märchen, aber mir ergeht es momentan auch oft so, dass ich Pech mit Teammates habe.\nLass uns gerne mal 5 games SoloQ machen, dann weißt du wovon ich rede ^^\n(soll nicht heißen, dass ich nur wegen meiner Teammates verliere!)","replies":[{"poster":"Temudschinn","date":"2017-09-12T08:02:55.172+0000","up_votes":2,"down_votes":1,"body":"5 Games sind halt nicht sehr repräsentativ^^","replies":[{"poster":"Qbert","date":"2017-09-12T08:05:27.873+0000","up_votes":1,"down_votes":2,"body":"Ein Freund der mir helfen wollte heraus zu kommen, war schon noch 3 bedient :D \nIch weiß, 5 sind nicht repräsentativ, aber sie würden eine Richtung zeigen ... es ist nicht so, dass ich auch gewinne. Sogar mehrere Spiele in Folge(!), aber die Strafe folgt auf dem Fuße :S\n\nNun ja, ich stecke den Kopf nicht in den Sand ^^\nUnd für die nächste Season suche ich mir dann für die Placements etc. einen Partner, damit ist alles viel entspannter :)","replies":[{"poster":"Temudschinn","date":"2017-09-12T08:09:29.488+0000","up_votes":3,"down_votes":2,"body":"> Ich weiß, 5 sind nicht repräsentativ, aber sie würden eine Richtung zeigen ...\n\nGenau dieser Irrglaube sorgt dafür, dass es immernoch Leute gibt die von \"EloHell\" sprechen.\nExtremfall: Ich hatte vor kurzem in einem Spiel einen ADC, der erstmal 10 Minuten afk war. Dann einen Toplaner, der bei Minute 15 fand, dass der ADC ihm 10 farm \"gestohlen\" hat und darum begonnen hat absichtlich zu feeden. Und, man glaubt es kaum, im nächsten Spiel schon wieder einen AFK.\nDie \"Richtung\" wäre also klar: Ich bin ganz tief in der Elo Hell.\n\nWenn man aber meine letzten 500 Spiele ansieht merkt man, dass die Gegner etwas öfter AFKs etc. haben...","replies":[{"poster":"Qbert","date":"2017-09-12T08:16:28.916+0000","up_votes":1,"down_votes":0,"body":"Weiiiiß ich doch, geht mir doch ähnlich. Dennoch ist es ->gefühlt<- derzeit schwer.\nOverall ist das Bild eben Durchschnitt. Trotzdem deprimierend.... deshalb plane ich für mich ja bereits die nächste Saison.\n\nIch hatte so etwas ähnliches schon in Season4. Damals habe ich noch bis zum Schluss gekämpft und vielleicht Dia zu erreichen, das Ende vom Lied war statt P1 in P5 zu sein, weil ich es viel zu verbissen probiert habe. In Season 5 habe ich dann von Anfang an mit einem guten Partner gespielt und war rasch auf Dia :)","replies":[]}]}]}]}]}]},{"poster":"Panda Senseî","date":"2017-09-12T23:01:08.759+0000","up_votes":1,"down_votes":0,"body":"Also. Ich bin keiner, der sich nicht auch mal nen Fehler eingesteht. Im Gegenteil. Wenn ich etwas dummes mache, oder gerade falsch handel, dann entschuldige ich mich für mein Verhalten und versuche normal weiter zu machen. Aber wenn man in nem Game 7/0 oder ka wie hoch startet und das early und mid game carried, aber dein Team dann anfängt sinnlos zu splitten, obwohl du sie zum groupen aufforderst, kann man als einzelner Spieler auch nicht viel machen, weil LoL nunmal ein Teamgame ist. Ist einer scheiße, bekommt es das ganze Team zu spüren. Ich habe Verständnis dafür, wenn man mal nen schlechten Tag hat und feedet, aber nicht, wenn man auf die Hinweise seiner Teammates keine Rücksicht nimmt, und jemanden, der bloß nen Tipp geben wollte, sofort anflamet. Was soll das? Und mit \"Matchmaking\" meine ich die Tatsache, dass man überhaupt mit genau solchen negativ auffallenden Spielern in eine Queue kommt. Wofür gibt es die lower priority queue, wenn man selber nicht mit drin steckt und trotzdem solche Spieler ins Team bekommt? Und vor allem geschieht das immer nur 1 Win vor der Promo oder in der Promo. Alle anderen spiele sind fast von guten und kompetenten/teamfähigen Spielern gefüllt. Macht RIot das mit absicht, damit man es extra schwer hat, sich aus bronze silber etc hochzucarryn? Ich weiß es nicht. Aber \"Fair\" ist das sicherlich nicht. Reports sollten auch ab einem einzigen Report zurückverfolgt und überprüfut werden. Dann würden bald keine Feeder, Flamer, Rassisten o.a in Silber und höher stecken bzw. man wird als normaler Spieler mit solchen Personen nicht mehr in eine Queue kommen.","replies":[{"poster":"Sirrkas","date":"2017-09-13T00:13:03.931+0000","up_votes":2,"down_votes":1,"body":">Aber wenn man in nem Game 7/0 oder ka wie hoch startet und das early und mid game carried, aber dein Team dann anfängt sinnlos zu splitten, obwohl du sie zum groupen aufforderst, kann man als einzelner Spieler auch nicht viel machen, \n\nMan hat immer die Möglichkeit, sich an die anderen anzupassen. Wenn also 4 aus deinem Team splitten wollen, wäre es dann vielleicht für das Team besser, mitzuziehen, auch wenn es weniger gut wäre, als Teamfights. \n\nZudem hast du keine Führungsposition im Team. Auch wenn du mal gute Stats hast, heißt das nicht, dass man auf dich hören muss. \n\n>weil LoL nunmal ein Teamgame ist. Ist einer scheiße, bekommt es das ganze Team zu spüren.\n\nDie Gegner haben mit den selben Problemen zu kämpfen. Ich hatte auch schon genug Spiele, bei denen sich jemand für den tollsten gehalten hat, dauernd sinnlos stirbt und vom Rest des Teams gecarriet wurde. Aus welchen Gründen auch immer, haben die Gegner dann den Spieler sogar als den Carry angesehen, weil das ein Assassine war, der, wenn er doch mal nicht ganz so sinnlos rein ist, auch die Kills abgestaubt hat. \n\n>Ich habe Verständnis dafür, wenn man mal nen schlechten Tag hat und feedet, aber nicht, wenn man auf die Hinweise seiner Teammates keine Rücksicht nimmt, und jemanden, der bloß nen Tipp geben wollte, sofort anflamet. \n\nHängt davon ab, wie diese Hinweise und Tipps aussehen. Wenn ich meinem Team einen Call gebe, sieht das etwa so aus:\n\nPing Drachentimer\nChat: drake?\n\nEin Tipp bezüglich Items sieht so aus:\nThey got a lot of AD, we probably should get more armor. \n\nIch weiß nicht wie deine Tipps aussehen, sollten sie aber so aussehen, wie von der Diana, die sich für die Größte gehalten hat und unserem Jungler sagt, er soll das erste fertiggestellte Item verkaufen, um an Rüstung zu kommen, kann ich das nicht ernst nehmen. Vor allem dann, wenn die am Drachen nicht hilft und ihr Lanegagner uns dafür aufräumt, weil der aus dem 3vs3, das wir gewinnen, ein 3vs4 macht, das wir verlieren. \n\nOder der Yasuo, der meinte, er wäre Gold im 3vs3 und wir müssen deswegen im gewundenen Wald auf ihn hören, obwohl alle im Team Gold waren. Nie im Kampf hilft, die Lane farmt, jammert, wie blöd alle sind und das wir Müll bauen. Dann aber, als ich ihn mal frage, was ich denn als Jungler hätte bauen sollen, das eine Item von ihm kommt, das vor 2 Tagen für den Modus deaktiviert wurde. \n\nAndere schlechte Tipps wären:\nStop feed\nplay safe\njust farm\netc. \n\nDer Angesprochene weiß da meist selber schon, dass er gerade gestorben ist, das hilft ihm alles nichts. Das sind Cpt. Obvious Kommentare, die man sich auch sparen kann. Wenn eine Bedienung das Tablett mit den Getränken oder dem Essen fallen lässt und alles verschüttet, muss man da ja auch nicht sagen \"He, du hast da was verloren\". Das ist in etwa das verbale Äquivalent dazu, das Gesicht der Person in die Essensreste zu drücken. \n\nDu kannst gerne versuchen sie zu motivieren etwa mit:\ndont worry, we can still win this\nstay a bit back, i will come and gank soon (und das auch machen)\n\nAuf derartiges habe ich auch noch nicht erlebt, dass jemand mit Flame antwortet. \n\n>Und mit \"Matchmaking\" meine ich die Tatsache, dass man überhaupt mit genau solchen negativ auffallenden Spielern in eine Queue kommt.\n\nIn LoL gibt es keine Prisoners Island. Das ist etwas, bei dem die toxischen Spieler, nur untereinander spielen dürfen. Das wird hier auch nicht in absehbarer Zeit eingeführt mit Tendenz zu niemals. Riot will das nicht und das wird sich sicher nicht so schnell ändern. Die Spieler werden nur nach Spielstärke sortiert. Die Flamer verlieren schon mehr, weil sie das Team mit ihrem Chat behindern. Die verteilen sich aber relativ gleichmäßig auf alle Elobereiche. \n\n>Wofür gibt es die lower priority queue, wenn man selber nicht mit drin steckt und trotzdem solche Spieler ins Team bekommt?\n\nDie Low Priority Queue ist eine Wartestrafe für Leaver, keine eigene Warteschlange. So etwas (Prisoners Island) wird unter anderem nicht eingeführt, weil es:\nDie Toxicity in der Warteschlange weiter steigert, da sich die Flamer noch mehr daran gewöhnen, dass Flame normal ist.\nEs Probleme mit Spielern geben würde, die mit Leuten auf der Insel spielen wollen, entweder packt man die Flamer in die normale Warteschlange und hebelt die Strafe so aus oder man bestraft die Freunde der Flamer mit und steckt sie in die toxische Warteschlange. Nimmt dann aber in kauf, dass deren Freunde verrohen und Flame auch als normal ansehen und sich daran anpassen. \n\n>Und vor allem geschieht das immer nur 1 Win vor der Promo oder in der Promo. Alle anderen spiele sind fast von guten und kompetenten/teamfähigen Spielern gefüllt. Macht RIot das mit absicht, damit man es extra schwer hat, sich aus bronze silber etc hochzucarryn? \n\nDas nennt man selektive Wahrnehmung. Du erinnerst dich viel stärker an die negativen Erlebnisse, da das menschliche Gehirn darauf ausgelegt ist. Da die Niederlage in der Promo besonders schlimm ist, wird das von dir viel stärker wahrgenommen. Bei 70 LP würde es dich wohl nicht kümmern, bist danach halt auf 55 und mit 2 Siegen in der Promo. Aber in der Promo kommt es dir darauf an, unbedingt alle zu gewinnen. \n\nAber selbst wenn du in einem Spiel in der Promo immer garantiert Trolle und Flamer hast, sind da noch 2 bis 3 andere Spiele und auch der freie Sieg, bei erneuten Versuchen, das sollte also kein Problem darstellen, das dich am Aufstieg hindert, selbst wenn es wahr ist. \n\n>Reports sollten auch ab einem einzigen Report zurückverfolgt und überprüfut werden.\n\nIst schon der Fall. Ein einzelner Report kann zu einer Strafe führen. Bei besonders schlimmen Vergehen, kann es dafür auch sofort einen Bann geben.\n\n>Dann würden bald keine Feeder, Flamer, Rassisten o.a in Silber und höher stecken bzw. man wird als normaler Spieler mit solchen Personen nicht mehr in eine Queue kommen.\n\nWarum sollten die dann nur noch in Bronze sein? Willst du etwa, dass das Reportsystem in Bronze deaktiviert wird? Ich dachte du willst das man da raus kann und nicht zum Sammelbecken aller toxischen Spieler machen. \n\nZudem würdest du, auch mit einem strengeren System, noch immer, auch in Silber, Gold etc. auf toxische Spieler treffen. Du vergisst scheinbar, dass das System nicht präventiv arbeiten kann. Wie willst du denn jemanden aussortieren, der sich noch nichts zu schulden hat kommen lassen? Der Spieler wird immer erst negativ auffallen müssen, ehe er bestraft wird. \n\nOb das System zu streng oder zu lasch ist, darüber kann man streiten. Ein absolut flamefreies LoL, wird aber wohl für immer ein Wunschtraum bleiben.","replies":[{"poster":"Time2Whine","date":"2017-09-13T08:08:24.646+0000","up_votes":1,"down_votes":0,"body":"Amen","replies":[]}]},{"poster":"Pure Cynicism","date":"2017-09-13T17:24:38.361+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Panda Senseî,realm=EUW,application-id=KYnfKGf0,discussion-id=BloGwy6O,comment-id=0007,timestamp=2017-09-12T23:01:08.759+0000)\n>\n Aber wenn man in nem Game 7/0 oder ka wie hoch startet und das early und mid game carried, aber dein Team dann anfängt sinnlos zu splitten, obwohl du sie zum groupen aufforderst, kann man als einzelner Spieler auch nicht viel machen, weil LoL nunmal ein Teamgame ist. Ist einer scheiße, bekommt es das ganze Team zu spüren. \n\nDer objektiv beste Call unterscheidet sich vom relativ besten Call. Lieber zu 5. Bullshit machen als solo das Richtige zu tun. Außerdem stimmt es nicht, dass man als Einzelner nutzlos ist. 1-2 Feeder kann man mit Skill kompensieren. Und wie oft hat man 3 oder 4 Feeder? Das ist extrem selten.","replies":[{"poster":"Panda Senseî","date":"2017-09-14T21:26:24.253+0000","up_votes":1,"down_votes":0,"body":"Bei mir hab ich leider im Durchschnitt (Wenn ich solo spiele) jedes 2. Game mindestens 2 feeder und einen, der bereits nach den ersten 5-10 minuten aufgibt. Im mid bis late, falls ich es so weit schaffe fängt der rest, der zuvor gut gespielt hat dann auch an zu feeden, da wegen der ersten 2-3 Mann das Team stark behind ist.\n\nIm übrigen ein neuer Post von mir, wo man sieht, dass es Personen gibt, die auch nach dem Game noch toxisch sind und beleidigen.","replies":[{"poster":"Pure Cynicism","date":"2017-09-15T04:17:10.097+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Panda Senseî,realm=EUW,application-id=KYnfKGf0,discussion-id=BloGwy6O,comment-id=000700010000,timestamp=2017-09-14T21:26:24.253+0000)\n>\n> Bei mir hab ich leider im Durchschnitt (Wenn ich solo spiele) jedes 2. Game mindestens 2 feeder und einen, der bereits nach den ersten 5-10 minuten aufgibt. Im mid bis late, falls ich es so weit schaffe fängt der rest, der zuvor gut gespielt hat dann auch an zu feeden, da wegen der ersten 2-3 Mann das Team stark behind ist.\n> \n> Im übrigen ein neuer Post von mir, wo man sieht, dass es Personen gibt, die auch nach dem Game noch toxisch sind und beleidigen.\n\nAlso feeden immer nur die anderen, oder was? Wenn ich mir deine Match History angucke, finde ich so einige Games, in denen du der Feeder bist. 1-8 Yasuo, 2-12 Yasuo, 0-9 Kayn, 3-12 Vi, 1-5 Shyvana, 5-14 Fiora, 1-11 Ahri usw.\n\nSolange du dir immer wieder solche Spiele erlaubst, kannst du es dir gar nicht leisten, dein Team zu blamen. Verbessere dich selbst, dann klappts auch mal mit einem Aufstieg. Wenn du nur jedes 5. Spiel so eine Leistung abrufst, sind das im Endeffekt 20% weniger Winrate.","replies":[{"poster":"Panda Senseî","date":"2017-09-16T15:38:59.035+0000","up_votes":1,"down_votes":0,"body":"Dazu muss ich sagen, ja auch ich habe mal schlechte Spiele. Aber wenn ich ein Spiel spiele und einen Gank ankündige, dabei sehe, dass mein Mate full hp ist und genug mana hat, sich dann aber herausstellt, dass er nicht followed ohne mich vorher zurükzupingen, dann will wohl der andere Spieler nicht im Team spielen. Entweder ich follow und mache nen Kill oder baite zumindest flash heraus, oder aber ich pinge meinen Jungle zurück, da ich gerade den Tower deffen muss oder ähnliches. Ich habe Verständnis dafür, wenn man eimal unaufmerksam ist, aber nicht, wenn das das gesamte Game über so läuft.","replies":[{"poster":"Pure Cynicism","date":"2017-09-17T05:57:07.374+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Panda Senseî,realm=EUW,application-id=KYnfKGf0,discussion-id=BloGwy6O,comment-id=00070001000000000000,timestamp=2017-09-16T15:38:59.035+0000)\n>\n> Dazu muss ich sagen, ja auch ich habe mal schlechte Spiele. \n\nRichtig, deine Teammates eben auch. Und solange du nicht in jedem Spiel der ausgleichende Faktor bist, climbst du auch nicht. Die Rechnung ist ganz einfach. Reduziere deine schlechten Spiele auf ein Minimum und du wirst climben. Aber die Schuld auf deine Mates abzuwälzen macht dich nicht zu einem besseren Spieler. Mit schlechten Mates muss jeder zurechtkommen, von Bronze bis Challenger.","replies":[]}]}]}]}]}]},{"poster":"Allerbester Biss","date":"2017-09-11T18:57:35.933+0000","up_votes":1,"down_votes":0,"body":"Mmh für mich ist Dia5 die Elo Hell...\n\nVorallem, was hat das matchmaking mit dem Spielerverhlten zu tun? XD","replies":[{"poster":"Qbert","date":"2017-09-12T07:36:09.306+0000","up_votes":1,"down_votes":0,"body":"Das wissen aber die Leute nicht, die nie dort waren.\nMeiner Meinung nach ist gerade Dia5-3 wirklich schlimm! Dort hat man viele die ihr Ziel \"Dia\" erreicht haben und die dann nur rumprobieren, trollen oder wirklich schnell tilten. Frei nach dem Motto „du bist doof zu mir, dann versaue ich dir das Spiel“. Es gibt nur noch wenige in der Elo, die weiter wollen.\nAuch wenn es bei mir schon eine Weile her ist, dass ich dort war, aber ich glaube nicht, dass sich daran viel verändert hat :/","replies":[{"poster":"Pure Cynicism","date":"2017-09-13T17:21:36.607+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=KYnfKGf0,discussion-id=BloGwy6O,comment-id=00010000,timestamp=2017-09-12T07:36:09.306+0000)\n>\n> Das wissen aber die Leute nicht, die nie dort waren.\n> Meiner Meinung nach ist gerade Dia5-3 wirklich schlimm! Dort hat man viele die ihr Ziel &quot;Dia&quot; erreicht haben und die dann nur rumprobieren, trollen oder wirklich schnell tilten. Frei nach dem Motto „du bist doof zu mir, dann versaue ich dir das Spiel“. Es gibt nur noch wenige in der Elo, die weiter wollen.\n> Auch wenn es bei mir schon eine Weile her ist, dass ich dort war, aber ich glaube nicht, dass sich daran viel verändert hat :/\n\nDas ist in Gold aber genauso, gerade Gold V ist die Hölle pur. Dort sammeln sich\n\n- gute Silberspieler, die endlich ihr Ziel erreicht haben und nicht mehr tryharden wollen\n- niedrige Silberspieler, die eine lange, glückliche Winningstreak hatten, ggf. auf einem Patch, auf dem ihr Main broken war\n- Bronze-Spieler, die sich für die Belohnung boosten lassen\n\nIch muss ehrlich sagen, Platin II-IV ist die angenehmste Elo, in der ich bisher war. Herausfordernde Gegner, aber auch gute Teammates und insgesamt ein tolles Spielniveau. Meistens jedenfalls... :p","replies":[]},{"poster":"Allerbester Biss","date":"2017-09-12T15:49:27.688+0000","up_votes":1,"down_votes":0,"body":"Leider nicht..","replies":[]}]}]},{"poster":"Night Lead","date":"2017-09-12T06:16:41.523+0000","up_votes":1,"down_votes":1,"body":"Manchmal glaube ich das elohellmärchen dann bekomme ich nen adc der sich carryin lässt und gewinne. In den letzten 20 Spielen hatte ich keinen leaver, zwar flamer aber die kann man ja muten. Also gegen Leaver kann man zwar nichts machen aber gegen Flamer einfach muten und nach dem Spiel reporten und bloß nicht zum report aufrufen das kann man nämlich auch reporten.\n\nSagen wir es bzgl der \"Elo-Hell\" so\n\ndein team hat ein 4 zu 5 chance einen Troller zu haben und die gegner eine  5 zu 5 chance was ist da nun besser? Wenn du nicht weiter kommst dann ist es auch deine Elo wo du hingehörst. Climben kann mann nur wenn man sich selbst verbessert, fertig aus","replies":[]},{"poster":"three stodges","date":"2017-09-12T14:41:33.906+0000","up_votes":1,"down_votes":2,"body":"Das Problem fängt schon damit an das Riot nicht 100% Garantieren kann das der tatsächliche Besitzer des acc Spielt \nwas folglich dazu führt das unausgeglichene Spiele statt finden können.","replies":[]}]}