{"poster":"WutsKraken","date":"2015-02-25T22:48:27.130+0000","title":"Let's put this Kassadin nerf into perspective...","subforum":"Gameplay","up_votes":21,"down_votes":2,"body":"So, Ult range drastically reduced after Riot:\n\n1) Removed his Silence (This was arguably warranted) in place of a shield which they also nerfed -_-\n2) Reduced his overall damage several times, including removing his ult's AP Ratio\n3) Gave his ult an unforgivingly long amount of time to reduce the mana cost\n4) Lowered his base combat stats in return for more mana (meh)\n\nSo, what DID Riot give Kassadin after all this time? Well, slightly better last hitting with his new W and lowered ult CD to \"preserve\" his mobility fantasy but now his ult has less range than:\n\nEzreal's E which costs much less mana but isn't the worst offender\nGragas' E which does more damage, costs less mana, and has CC tacked onto it to boot\nFizz's E which does more damage AND doubles as a zhonyas\nZed's FREE W that also gives him BONUS AD and sets up his harass and waveclear combined\nNidalee's FREE W that does more damage than Kassadin's ult\nKalista's FREE hop that is a passive on EVERY Autoattack (After t2 boots she gets more range when jumping that is) and can also be procced with her Q which costs MUCH less mana and hurts probably as much as Kassadin's ult\nEVERY ADC's Autoattacks...except Urgot...but it's Urgot (sorry bro)\nBasically every ranged midlaner's Autoattacks...except Urgot (ritoplz, Urgot needs help too)\n*obligatory J4 EQ, Vi Q, and Lee Sin Q/W*\n\nRiot, you continued to nerf everything about Kassadin so he could keep his defining mobility. Now you finally slash off his legs so his Riftwalk is essentially a Riftcrawl with no compensation. At the very least, revert some of his other nerfs if you're going to keep this damn nerf.\nI said before that the only reason Kassadin didn't suck was because of his mobility. Heck, a lot of us proposed ways to keep his mobility in check without all the other dumb nerfs to him. But they go overboard with the mobility nerf and give no compensation\n\nDon't get me started on how you planned to \"help\" Veigar after DFG removal. Improve his Q slightly then nerf everything else...why? I hate QQ'ing about balance but this pisses me off just as much as Olaf's first gutting\n\nThere, bring on the hate, I know how much people love to rip up the mains of a recently nerfed champ","replies":[{"poster":"Truly Prideful","date":"2015-02-26T00:11:32.650+0000","up_votes":12,"down_votes":0,"body":"Kassadin wasn't even the biggest offender of what they nerfed him for and that's why it's so stupid.  Look at LeBlanc's combo.  She's extremely mobile, her jumps don't have a stacking mana cost, and they do a lot more damage.  If they keep the low range on him, they need to knock down the stack duration or give him a mechanic to reduce it.  Also, give back his ult's AP ratio because there's no reason for it to be gone at this point.","replies":[{"poster":"WutsKraken","date":"2015-02-26T00:26:06.110+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Solaire,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=0007,timestamp=2015-02-26T00:11:32.650+0000)\n>\n> Kassadin wasn't even the biggest offender of what they nerfed him for and that's why it's so stupid.  Look at LeBlanc's combo.  She's extremely mobile, her jumps don't have a stacking mana cost, and they do a lot more damage.  If they keep the low range on him, they need to knock down the stack duration or give him a mechanic to reduce it.  Also, give back his ult's AP ratio because there's no reason for it to be gone at this point.\n\nThis is what I mean as well","replies":[{"poster":"Desmond Law","date":"2015-02-26T01:21:18.189+0000","up_votes":2,"down_votes":2,"body":"I recommend these changes:\nForce Pulse:\nPassive: Kassadin draws energy from spells cast in his vicinity, gaining a charge of Void Force whenever a spell is cast near him. Max 6 stacks. No timer.\nKassadin can consume 4 stacks to use Force Pulse to deal 80/105/130/155/180 (+70% Ability Power) magic damage and slow enemies by 50/60/70/80/90% for 1 second in a cone in front of him.\n\nRift Walk:\nCost: 100 Mana\nCool Down: 5/4/3 seconds\nKassadin consumes 2 stacks of Void Force teleports to a nearby location dealing 80/100/120 (+0) magic damage to surrounding enemy units. Using Rift Walk grants Kassadin a stack of Void Rift for 2 seconds. Max 3 stacks. Casting Rift Walk with stacks of Void Rift costs an additional 50 mana per stack and deals an additional 40/50/60 (+0) magic damage per stack.","replies":[{"poster":"thinking man","date":"2015-02-26T01:23:30.536+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Desmond Law,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=000700000000,timestamp=2015-02-26T01:21:18.189+0000)\n>\n> I recommend these changes:\n> Force Pulse:\n> Passive: Kassadin draws energy from spells cast in his vicinity, gaining a charge of Void Force whenever a spell is cast near him. Max 6 stacks. No timer.\n> Kassadin can consume 4 stacks to use Force Pulse to deal 80/105/130/155/180 (+70% Ability Power) magic damage and slow enemies by 50/60/70/80/90% for 1 second in a cone in front of him.\n> \n> Rift Walk:\n> Cost: 100 Mana\n> Cool Down: 5/4/3 seconds\n> Kassadin consumes 2 stacks of Void Force teleports to a nearby location dealing 80/100/120 (+0) magic damage to surrounding enemy units. Using Rift Walk grants Kassadin a stack of Void Rift for 2 seconds. Max 3 stacks. Casting Rift Walk with stacks of Void Rift costs an additional 50 mana per stack and deals an additional 40/50/60 (+0) magic damage per stack.\n\nHe'd be faceroll as hell against any comp with spammy users.\n\nIt'd be too situationally good and too situationally bad but I'd probably just have to adjust to it since I'm used to just using Force Pulse whenever I have stacks.","replies":[{"poster":"Rinky Dinky","date":"2015-02-26T02:37:42.265+0000","up_votes":1,"down_votes":0,"body":"That's balance\n\nHe would have a niche as an anti-mage, which is who he is supposed to be","replies":[{"poster":"thinking man","date":"2015-02-26T02:38:24.313+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cameron2325,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=00070000000000000000,timestamp=2015-02-26T02:37:42.265+0000)\n>\n> That's balance\n> \n> He would have a niche as an anti-mage, which is who he is supposed to be\n\nHard counters shouldn't exist in the game, and he'd counter more than just mages with that.","replies":[]}]}]},{"poster":"WutsKraken","date":"2015-02-26T04:12:39.917+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Desmond Law,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=000700000000,timestamp=2015-02-26T01:21:18.189+0000)\n>\n> I recommend these changes:\n> Force Pulse:\n> Passive: Kassadin draws energy from spells cast in his vicinity, gaining a charge of Void Force whenever a spell is cast near him. Max 6 stacks. No timer.\n> Kassadin can consume 4 stacks to use Force Pulse to deal 80/105/130/155/180 (+70% Ability Power) magic damage and slow enemies by 50/60/70/80/90% for 1 second in a cone in front of him.\n> \n> Rift Walk:\n> Cost: 100 Mana\n> Cool Down: 5/4/3 seconds\n> Kassadin consumes 2 stacks of Void Force teleports to a nearby location dealing 80/100/120 (+0) magic damage to surrounding enemy units. Using Rift Walk grants Kassadin a stack of Void Rift for 2 seconds. Max 3 stacks. Casting Rift Walk with stacks of Void Rift costs an additional 50 mana per stack and deals an additional 40/50/60 (+0) magic damage per stack.\n\nAs much as I'd like some Kassadin buffs, that's honestly probably a bit much. Very situationally faceroll as Kaellrus said","replies":[]}]}]}]},{"poster":"ZippoBolter","date":"2015-02-26T09:54:01.030+0000","up_votes":4,"down_votes":0,"body":"Okay, as someone who has mained kassadin on and off ever since i picked him up in early season 1 or season 2 i've had the opportunity to play this sleeping beast at his peak when he was considered trash due to being as useful as a magikarp early game and during his highlight while being considered a completely broken champion with 0 counterplay. I have played against many kassadins and due to my experience with kass i always asked for lane against him so i could exploit his early game weakness and lack of ability to do anything against ranged AD champions (which i main, specifically tristana and vayne). I would say that while i'm no pro, i am certainly very familiar with this champion and this is my analysis:\n\nBefore the recent nerf, rift walk was the best ultimate in the game hands down. A low cooldown, high range blink with increasing damage per stack leading into a massive nuke of over 1k magic damage is absolutely beastly. To compensate, kassadin had only 2 ranged nuking abilities, a useless w ability, melee range, conditional wave clear, huge mana costs and an extremely weak early game. This was especially exploitable before flask and trinkets were introduced which allowed kassadin to handle early game pressure much more consistently and could allow him to survive even against his hardest counters such as pantheon. \n\nOnce kassadin became popular, a never ending stream of nerfs followed which gutted this champion like never before seen. His base damage is the lowest by far of any assassin, mediocre scaling, ult gated with extreme mana costs and longer cooldown period for resetting stacks, much weaker CC with completely removed silence and heavily nerfed force pulse slow. Even then, kassadin was still a strong champion due to having incredible mobility on his ult which allowed for excellent positioning in team fights and ganks from fog of war. Completely viable, still a strong pick in tournament level games and one of the best late game assassins with insane chasing potential. \n\nHowever this last nerf with the reduced range on kassadins ultimate is by far the hardest nerf he could ever receive. Lowering his ultimate range by over 1/3rd is not just a simple nerf to his chasing , escaping and assassination potential, but a devastating nerf to how his kit functions in combat. For example, if a target is over a wall in a team fight, as kassadin you would blink over the wall, unload your combo and then either walk away or hourglass until your rift walk is available. Simple and effective way to unload your burst onto a target. \n\nNow the main point here is that about half of your damage (especially if you have lichbane) is necessary to deal your maximum damage. If you get into melee range as needed, you will be completely unable to rift walk back over the wall to escape since you are now required to dry hump the wall before you can rift walk to pass it and a 450 range blink is not going to help much to escape when you were just on top of someone's face with their team around them. This weakness is even more pronounced by the fact that kassadin can rarely 100-0 his targets until late game (or never really if they get banshees) or if the adc is further from bushes, walls, fog etc they have much more reaction time and you may even need 2 rift walks to gap close which is way too unnecessary when other assassins or like zed, shaco or akali can flank, deal much more threatening burst with longer range gap closers and/or stealth. \n\nAnother problem is that you can often no longer rift walk diagonally, as i mentioned you need to by right next to a wall in order to pass it so your possible positioning is severely limited and often out of a threatening range. Your maximum range harass/kill/chase combo is also severely weakened. As kassadin it's often useful when chasing to linger outside of your opponents range while chasing them and then ulting in when your cooldowns are available to go back in. Basically in all instances, your ability to position to assassinate and combo champions is completely crippled and while 450 range is nice for an adc to gain distance from a bruiser it is just too low for an assassin to instantly get onto of an opponent and attempt to kill them especially when that damage is far weaker then the competition of other assassins (fizz, leblanc, zed, etc). \n\nBasically kassadin can no longer position the same as before and positioning is very important to winning this game. Walls, jungle skirmishes in fog and chasing were kassadins greatest strengths and now kassadins ability to position in these situations to ambush and kite has been gutted. People who say kassadin has no counter play have no idea how powerful a banshees is against his damage and how a warded map can prevent his roam. Many champions are excellent picks into kassadin and if you decide to start with a flask alongside him there is no way in hell his 70+25 damage/lvl Q every 9 seconds is going to be an overwhelming harass which leads him to killing you. Even if you do manage to kill someone like lux, there is no way you will be escaping an adc like jinx who will continue shooting you in the face even after you ult away due to the low range. \n\nEven a fed kassadin is quite mediocre now, many champions like a fed irelia, nasus or vayne could already outcarry a fed kassadin quite easily unless kass reaches full build where he is one of the strongest late game champions but now he is a complete joke and deserves the title worst assassin in the game. Lowest burst, low cc, mediocre laning, massive cost and low range on blink ability/gap closer, no stealth, poor wave clear, cant jungle or duo lane at all, extremely low base damage that requires massive farm and kills to scale and has his utility (chasing,escaping,silence,aoe slow) completely gutted. A kassadin who doesn't snowball hard is going to be a complete liability for his team and even while snowballed is not even on the same level as the old kassadin with little to no farm and 1 early drive by kill.","replies":[]},{"poster":"excodar","date":"2015-02-25T23:06:43.441+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=WutsKraken,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=,timestamp=2015-02-25T22:48:27.130+0000)\n>\n> So, Ult range drastically reduced after Riot:\n> \n> 1) Removed his Silence (This was arguably warranted) in place of a shield which they also nerfed -_-\n\nThe shield was .3 ratio then was later buffed to .8 ratio and having a 700 magic shield was op so they undid that buff.\n\nTo be honest im sick of this kassadin nerf shit and I would much rather him get a full relaunch than him keeping his signature mobility that is now shit mobility. Right now, I feel like mages can assassinate better than most assassins.","replies":[{"poster":"WutsKraken","date":"2015-02-25T23:47:14.581+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Acherus,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=0004,timestamp=2015-02-25T23:06:43.441+0000)\n>\n> The shield was .3 ratio then was later buffed to .8 ratio and having a 700 magic shield was op so they undid that buff.\n> \n> To be honest im sick of this kassadin nerf shit and I would much rather him get a full relaunch than him keeping his signature mobility that is now shit mobility. Right now, I feel like mages can assassinate better than most assassins.\n\nI'm actually comparing it to the initial draft of his .5 ratio shield that turned into .3, THEN became .8 and .3 again","replies":[]}]},{"poster":"thinking man","date":"2015-02-25T22:58:38.655+0000","up_votes":3,"down_votes":8,"body":"Kassadin's gonna be unhealthy as long as he's a burst champ.\n\nThat's why I propose gutting his burst, upping his sustain damage, and giving him back his ult range.","replies":[{"poster":"WutsKraken","date":"2015-02-25T23:05:17.504+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kaellrus,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=0002,timestamp=2015-02-25T22:58:38.655+0000)\n>\n> Kassadin's gonna be unhealthy as long as he's a burst champ.\n> \n> That's why I propose gutting his burst, upping his sustain damage, and giving him back his ult range.\n\nWell, can't do that now that his W's so weak now as well or when his ult has less range than Jax or Irelia's jumps\n\nFirst incarnation of Kassadin's rework where his W was incredibly powerful pissed me off first, but then got me thinking about the possibility of Kassadin as an autoattacking carry or bruiser who specialized in taking out mages like he was originally intended to be. But then they had to lower his W damage and remove his AS passive and I was like \"nope, guess he's still better off as an assassin or a tank in forthelulz builds like Blue Kassadin\".\nEven harder to play Blue Kassadin with that nerf to his ult as well\n\nI won't oppose improving his sustained damage, but you can't logically do that without giving him back a lot of stuff that Riot apparently refuses to give back. Even if they return to first incarnation of Kassadin's rework (which was just a theory) that'd still basically make him an inferior Jax. He needs a lot back.\n\nI expect Kassadin to disappear completely from competitive after they play on that patch until Riot gives him back compensation or some pro player finds some silly cheese to do like...idk blue Kassadin jungle","replies":[{"poster":"thinking man","date":"2015-02-25T23:09:02.933+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=WutsKraken,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=00020000,timestamp=2015-02-25T23:05:17.504+0000)\n>\n> Well, can't do that now that his W's so weak now as well or when his ult has less range than Jax or Irelia's jumps\n> \n> First incarnation of Kassadin's rework where his W was incredibly powerful pissed me off first, but then got me thinking about the possibility of Kassadin as an autoattacking carry or bruiser who specialized in taking out mages like he was originally intended to be. But then they had to lower his W damage and remove his AS passive and I was like \"nope, guess he's still better off as an assassin or a tank in forthelulz builds like Blue Kassadin\".\n> Even harder to play Blue Kassadin with that nerf to his ult as well\n\n? His W's much stronger compared to what it was before, although in a different way.\n\nThey could literally just take his old kit and change the Q while nerfing the ratios on everything but his W (which they buff) and he'd be a cool bruiser.\n\nThey can't really keep the current ult while giving him a new W because his new W is hilariously broken for mana regen in most situations and he'd need his ult to be gated less to be usable, which is why they could just take his old kit with a new Q and reduced numbers.\n\nAlso I didn't know people on boards knew anything about Blue Kassadin since I thought Caristinn and I were the only ones that did it.\n\nCaristinn doesn't even really do it anymore since the W nerf awhile back since the troll sheen/murumana build doesn't work quite as well.","replies":[{"poster":"WutsKraken","date":"2015-02-25T23:14:20.029+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kaellrus,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=000200000000,timestamp=2015-02-25T23:09:02.933+0000)\n>\n> ? His W's much stronger compared to what it was before, although in a different way.\n> \n> They could literally just take his old kit and change the Q while nerfing the ratios on everything but his W (which they buff) and he'd be a cool bruiser.\n> \n> They can't really keep the current ult while giving him a new W because his new W is hilariously broken for mana regen in most situations and he'd need his ult to be gated less to be usable, which is why they could just take his old kit with a new Q and reduced numbers.\n> \n> Also I didn't know people on boards knew anything about Blue Kassadin since I thought Caristinn and I were the only ones that did it.\n> \n> Caristinn doesn't even really do it anymore since the W nerf awhile back since the troll sheen/murumana build doesn't work quite as well.\n\nNot comparing his W to old W (I think they're fairly even). I mean the initial idea. Basically how it works with higher ratios and still had the synergy of his old passive and no mana regain\nAs a former Kassadin main, I did indeed go blue Kassadin here and there when I was much more active on the old boards. It already got hit by the W nerf and it's even weaker with the slashed ult range","replies":[{"poster":"thinking man","date":"2015-02-25T23:20:36.447+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=WutsKraken,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=0002000000000000,timestamp=2015-02-25T23:14:20.029+0000)\n>\n> Not comparing his W to old W (I think they're fairly even). I mean the initial idea. Basically how it works with higher ratios and still had the synergy of his old passive and no mana regain\n> As a former Kassadin main, I did indeed go blue Kassadin here and there when I was much more active on the old boards. It already got hit by the W nerf and it's even weaker with the slashed ult range\n\nIt's technically stronger in short-range situations since you can cast it more often to deal more damage :^)","replies":[{"poster":"WutsKraken","date":"2015-02-25T23:22:32.606+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kaellrus,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=00020000000000000000,timestamp=2015-02-25T23:20:36.447+0000)\n>\n> It's technically stronger in short-range situations since you can cast it more often to deal more damage :^)\n\nIt's the same CD though and his W's still got a pretty long CD so I don't see it...especially since with blue Kassadin your goal was to dive the backline anyways and you kinda can't anymore with that change","replies":[{"poster":"thinking man","date":"2015-02-25T23:24:53.612+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WutsKraken,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=000200000000000000000000,timestamp=2015-02-25T23:22:32.606+0000)\n>\n> It's the same CD though and his W's still got a pretty long CD so I don't see it...especially since with blue Kassadin your goal was to dive the backline anyways and you kinda can't anymore with that change\n\nYou can cast it more often since you'll have the mana.\n\nIt's still a 1.8/1.95 second CD though.","replies":[{"poster":"WutsKraken","date":"2015-02-25T23:30:59.224+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kaellrus,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=0002000000000000000000000000,timestamp=2015-02-25T23:24:53.612+0000)\n>\n> You can cast it more often since you'll have the mana.\n> \n> It's still a 1.8/1.95 second CD though.\n\nOk, when you finally close the distance, sure the lowered mana does shine. But how are you gonna close the distance on the backline unless the enemy's already way out of position? Diving into a teamfight's a lot harder with reduced range","replies":[{"poster":"thinking man","date":"2015-02-25T23:33:14.728+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WutsKraken,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=00020000000000000000000000000000,timestamp=2015-02-25T23:30:59.224+0000)\n>\n> Ok, when you finally close the distance, sure the lowered mana does shine. But how are you gonna close the distance on the backline unless the enemy's already way out of position? Diving into a teamfight's a lot harder with reduced range\n\nFlash+ult\n\nHe's definitely nerfed, I was saying it as a joke.\n\nalthough if you don't flash ult anyways you're a pleb tier kass main so","replies":[{"poster":"WutsKraken","date":"2015-02-25T23:38:25.006+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kaellrus,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=000200000000000000000000000000000000,timestamp=2015-02-25T23:33:14.728+0000)\n>\n> Flash+ult\n> \n> He's definitely nerfed, I was saying it as a joke.\n> \n> although if you don't flash ult anyways you're a pleb tier kass main so\n\nI've done it before already. Massive range boost for initiating fights as Blue Kassadin or for assassinating people as traditional Kassadin, I'm not stupid. Still, needing a 300CD Summoner now to get barely a better effect of his old ult alone is pretty bad\nAnyways, I am pleb tier anyways down here in mid-Gold because all my other mechanics suck. It's not like I'm pulling rank or anything here. I bascially just screw around in normals these days anyway","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"WutsKraken","date":"2015-02-25T23:02:50.851+0000","up_votes":2,"down_votes":0,"body":"Lilx, about that Lich Bane...that's a pretty significant nerf. 25% AP and 100% of AD? Most champs who use it build a lot of AP and generally have meh base AD\n\nAlso, Rageblade would STILL only fit into a few builds just for lolz. Kassadin would definitely not benefit, based on what you've said here only Jax would really benefit from it on a more serious build and even then, BOTRK would probably still outshine it on AA champs which is who its supposed to be on. You'd have to make a new build around that item\nThat Shyvana build is basically a \"forthelolz\" build as well since it'd take a long time for that to really come online","replies":[{"poster":"LilxPaprika","date":"2015-02-25T23:15:12.367+0000","up_votes":1,"down_votes":1,"body":"Except the ad on lichbane is converted into magic damage. Thereby benefitting from magic pen. Also keep in mind i recommended giving lb 100 base ap. also its designed for the many champions that benefit from life steal and have kits that apply on hit effects like eve, nidalee, fizz. Or benefit from attack speed. \nAnd since all champions have base ad some life steal can be worth while. \nAs you might of noticed I deleted that post. \nI made a separate thread for it. Just though it sorta applied to Kass. It would be along with gunblade though not so much ragebalde. \nIf you buff rageblade its not just for the lolz since it'll legitimately rival alternative items. \nAnd that shyvana build... Wits end and rageblade should be a match made in heaven. I wouldnt doubt that that build would hold up in challenger.","replies":[{"poster":"WutsKraken","date":"2015-02-25T23:21:35.173+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LilxPaprika,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=00030000,timestamp=2015-02-25T23:15:12.367+0000)\n>\n> Except the ad on lichbane is converted into magic damage I made a separate thread for that post. Just though it sorta applied to Kass. It would be along with gunblade though not so much ragebalde. \n> If you buff rageblade its not just for the lolz since it'll legitimately rival alternative items. \n> And that shyvana build... Wits end and rageblade should be a match made in heaven. I wouldnt doubt that that build would hold up in challenger.\n\nI'd need to see it for myself. Yes they two synergize very well, but would Shyvana be able to reliably get the gold needed for those items AND get tanky enough for mid-game teamfights in this current meta? Probably not unless your jungler got hella tanky as well. I need to see it for myself because while it'd probably work where I am right now (mid Gold), I don't see it working in challenger.\nAnd yes I know what you meant for lichbane unless I read it wrong, it's similar to how it is right now. I'm just saying that it won't change the fact that only certain people build it.\nThat and putting those items on Kassadin would basically be a soloq build, on the old ult range of Kassadin it might work but with this recent nerf I don't see it","replies":[]}]}]},{"poster":"Romans VI XXIII","date":"2015-02-25T22:55:20.547+0000","up_votes":1,"down_votes":1,"body":"To be fair he has seen alot of competitive play with a pretty high win rate to boot. But I don't think this was the right think to Nerf.","replies":[{"poster":"WutsKraken","date":"2015-02-25T22:57:38.574+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BIitskrieg,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=0001,timestamp=2015-02-25T22:55:20.547+0000)\n>\n> To be fair he has seen alot of competitive play with a pretty high win rate to boot. But I don't think this was the right think to Nerf.\n\nI expected him to be picked back up in competitive after a while after his first rework. After all, they did nothing to curb his mobility which was the only reason he was picked competitively in the first place.\nThen all these other nerfs made me think, alright well now even if they finally DO hit his mobility, he'll be incredibly weak after every other nerf\nTheeeeen they finally hit his mobility harder than anything else I proposed. I would approve of a longer CD, a mechanic like Gragas' E (Hitting a champ lowers CD while base CD is much higher), but his ult has less range than many other champs' non-ultimate skills","replies":[]}]},{"poster":"Big Bang Bob","date":"2015-02-26T02:51:06.186+0000","up_votes":1,"down_votes":0,"body":"I think Kass can keep his ult range and damage. \n\nIf his mobility is a problem, just make his ult slightly more delayed.","replies":[]},{"poster":"Rinky Dinky","date":"2015-02-26T02:36:47.163+0000","up_votes":1,"down_votes":0,"body":"This nerf should have been the first nerf honestly.\n\nNow we gotta go back and give him random shit back.","replies":[]},{"poster":"LANWhale","date":"2015-02-25T23:30:50.035+0000","up_votes":2,"down_votes":3,"body":"We all know that his Q gives him a shield now. Why not make it act like Morgana's Black Shield.\nThat way it has the feel of having silenced, but due to its scaling it will probably block only one CC. Which is fine, just make it act like that and not touch any damage.","replies":[{"poster":"WutsKraken","date":"2015-02-25T23:32:35.345+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LANWhale,realm=NA,application-id=3ErqAdtq,discussion-id=8WeHN4ME,comment-id=0006,timestamp=2015-02-25T23:30:50.035+0000)\n>\n> We all know that his Q gives him a shield now. Why not make it act like Morgana's Black Shield.\n> That way it has the feel of having silenced, but due to its scaling it will probably block only one CC. Which is fine, just make it act like that and not touch any damage.\n\nThat's something that I proposed myself a long time ago with my initial suggestion on how to nerf his ult. I guess that's still something I guess, all the more useful now that diving the backline is a lot harder","replies":[]}]},{"poster":"LilxPaprika","date":"2015-02-25T23:07:46.719+0000","up_votes":1,"down_votes":3,"body":"What if they gave his ult a longer range to initiate but smaller range to escape. If you have not received any damage for up to (same duration as mobility boots) your ult range is the same as it was. If you did incur damage its the range of patch 5.4's","replies":[{"poster":"LilxPaprika","date":"2015-02-26T00:00:41.649+0000","up_votes":1,"down_votes":1,"body":"Or how about if an enemy is within 525 range of him (taken from kayle's E auto range as rule of thumb) his ult gets reduced to patch 5.4 range. That way people have a better chance of catching up to him (since he could often escape far too easily). But he still gets his element of surprise when engaging.\n\nA bit like how eve can be detected when stealth in she gets too close. Fitting for an assassin. Keep their distance until its time for the kill.\n","replies":[]}]}]}