{"poster":"WutsKraken","date":"2015-08-22T16:06:29.385+0000","title":"Remind me why suddenly everyone's so up in arms against Vayne?","subforum":"Gameplay","up_votes":22,"down_votes":19,"body":"Honest question. This is like Season 3 all over again\n\nSeriously, she completely disappeared during the big tank/tanky bruiser meta about 6 patches ago. She was my priority ban whenever I would pick a Cinderhulk jungler like Sion. I was insulted by teammates for Vayne bans whenever I took a high HP tank.\n\nThen oh snap, tank meta basically disappears now she comes back? \"Well her counters disappeared\" I see her picked INTO Graves Kalista Tristana and Jinx, they dominated the meta during the time of Cinderhulk top laners and tanks. Her counters haven&#039;t disappeared, they&#039;re still freaking there. Did everyone forget that?\n\nShe has received basically NO changes since Season 3 except a tiny E nerf and a moderate ult buff, she was considered trash tier even after that little buff, I had people accuse me of trolling when I tried to play her during the tank meta.\n\nExplain this. No don&#039;t bring up something like her \"true damage, self peel, stealth, blahblah\" give me a reason why she came back and why people are complaining about it. She has remained basically the same, her counters still exist in this meta, but she wasn&#039;t a common pick in the tank meta and now that&#039;s its basically gone she&#039;s back\n\nAnd no, I'm not a Vayne player, barely touched her because I don't play ADC and would rather pick Twitch over the meta ADC's like her anyway. Check my match history and you'll see it full of immobile tanks, bruisers, and mages. Vayne is honestly the worst nightmare of most of my champ pool","replies":[{"poster":"Aeolian Melodies","date":"2015-08-22T16:20:23.335+0000","up_votes":27,"down_votes":1,"body":"What do you mean, suddenly? The boards always hated her guts.","replies":[{"poster":"doiminat0r3600","date":"2015-08-23T02:42:14.893+0000","up_votes":2,"down_votes":0,"body":"I think what he is talking about is why nobody complained about her during the tank meta.\n\nI complained about her and how you cant get away a few patches ago. I got downvoted so much that it was below threshold and was removed from the boards. It's a bit ridiculious how the boards is always behind on this kind of thing.","replies":[]}]},{"poster":"SEKAI","date":"2015-08-22T16:08:38.461+0000","up_votes":21,"down_votes":0,"body":"Vayne was only witch hunted during S3 because the introduction of BotRK effectively made her completely and utterly broken for a season.","replies":[{"poster":"Yosuke Apperu","date":"2015-08-22T16:43:11.863+0000","up_votes":8,"down_votes":1,"body":"And still to this day XD","replies":[]},{"poster":"Remlap1223","date":"2015-08-22T18:37:02.917+0000","up_votes":2,"down_votes":0,"body":"And with BORK being OP as it is, compiled with the fact that all of her counters got dumpstered, is it any wonder why she's seeing as much play as she is?","replies":[]}]},{"poster":"Lord Boltrix","date":"2015-08-22T16:40:12.316+0000","up_votes":9,"down_votes":0,"body":"Vayne is one of those peculiar champions who can take advantage of a team with less than stellar coordination and earn the infamous Pentakill, often because it can be difficult to catch her out unless she makes a mistake or you expend serious effort (summoners, cc, cooldowns) to remove the threat of her. It is the same issue behind the hate towards Riven: the excuses are similar if not the same, but everyone simply dislikes a single high-mobility champion who can earn Pentakills by their lonesome. High-elo smurfs often take champions like Riven and Vayne and carry games by themselves because mechanically those champions CAN get those Aces all by themselves if they snowball hard.","replies":[{"poster":"BluePolarizer","date":"2015-08-22T17:50:56.052+0000","up_votes":9,"down_votes":0,"body":"Her win rate is higher in plat and diamond than in bronze and silver. She stomps high elos more effectively than low elos.","replies":[]},{"poster":"Yosuke Apperu","date":"2015-08-22T16:43:52.453+0000","up_votes":2,"down_votes":1,"body":"Atleast I can itemize against riven tho :P","replies":[{"poster":"LoL aint life","date":"2015-08-22T18:31:02.407+0000","up_votes":7,"down_votes":0,"body":"{{item:3035}} {{item:3071}} {{item:3142}} {{item:3111}} {{item:3074}} {{item:3072}} {{champion:92}} wot?","replies":[{"poster":"BluePolarizer","date":"2015-08-22T19:02:48.472+0000","up_votes":1,"down_votes":1,"body":"A riven with that build will die to Vayne dealing zero damage. All Vayne needs to do is E the 3rd Q.","replies":[{"poster":"MohawkBird","date":"2015-08-22T19:12:10.646+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"BluePolarizer","date":"2015-08-22T19:19:06.207+0000","up_votes":1,"down_votes":1,"body":"You can counterbuild Riven with HP since she has no %HP damage, or counterpick her with long ranged champs that have self peel like Vayne, Trist or Ahri.","replies":[{"poster":"MohawkBird","date":"2015-08-22T19:21:26.246+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"BluePolarizer","date":"2015-08-22T19:26:39.513+0000","up_votes":4,"down_votes":0,"body":"I have. Turns out that a little armor + HP is superior to just stacking more armor. There's a reason high elos recommend sunfire first vs. Riven instead of Thornmail or Frozen Heart.","replies":[{"poster":"doiminat0r3600","date":"2015-08-23T02:47:02.245+0000","up_votes":2,"down_votes":0,"body":"They recommend it because she doesnt deal much auto damage. She is practically an AD mage. With the old {{item:3075}} you would deal about 5% of the physical damage she put on to you back as even more reduced magic damage. It was almost useless. Even Frozen Heart is almost useless because she doesnt depend on autos. Yeah youll slow down her farm by 15% (not really) but that won't do much. Whilst sunfire helps your farm, damages her with a small aura, and still blocks a good chunk of her bursty kit.","replies":[]},{"poster":"IcyPepper","date":"2015-08-22T19:46:04.401+0000","up_votes":1,"down_votes":0,"body":"Not to mention the passive is better.\n\nMelee damage passive is better than two armor items that affect her autoattacks, considering she's a bit of an AD caster. Really helps winning trades.","replies":[]}]}]}]}]}]},{"poster":"Yosuke Apperu","date":"2015-08-22T18:34:36.814+0000","up_votes":1,"down_votes":0,"body":"I can still itemize better against that than I can against a vayne :P","replies":[]}]}]}]},{"poster":"Narasimha","date":"2015-08-22T16:30:41.002+0000","up_votes":10,"down_votes":3,"body":"There must always be a ~~Lich King~~ scapegoat. If it's not Vayne, it's Kalista. If its not Kalista, its Tristana. If its not an adc, its the assassins. Or the tanks. Or SOMEONE. People just like to point fingers. Human nature is weird like that.","replies":[{"poster":"Yosuke Apperu","date":"2015-08-22T16:44:28.950+0000","up_votes":6,"down_votes":2,"body":"Nope, just Kalista and Vayne.. lol","replies":[{"poster":"Narasimha","date":"2015-08-22T16:52:24.898+0000","up_votes":2,"down_votes":1,"body":"You're too young to remember the good times, back on the old boards. People were taking potshots at everything, from Fiora, to Swain, to Heimerdinger. You couldn't play a champion without it being \"broken, so op, they'll nerf it to the ground.\"","replies":[{"poster":"doiminat0r3600","date":"2015-08-23T02:48:00.986+0000","up_votes":1,"down_votes":0,"body":"Used to be {{champion:39}}. \n\n*well, lets nerf her again*","replies":[]},{"poster":"Yosuke Apperu","date":"2015-08-22T17:32:15.924+0000","up_votes":1,"down_votes":0,"body":"I'm saying atm XD I'm aware of how jax used to be, etc. Same with heimer :P Tho I wasn't active on the boards back then","replies":[]}]}]}]},{"poster":"BluePolarizer","date":"2015-08-22T19:02:10.731+0000","up_votes":4,"down_votes":0,"body":"btw Vayne has the 3rd highest base AD out of all ADCs. Just sayin'.","replies":[]},{"poster":"General Murica","date":"2015-08-22T16:58:18.292+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=WutsKraken,realm=NA,application-id=3ErqAdtq,discussion-id=iGIE1Y0o,comment-id=,timestamp=2015-08-22T16:06:29.385+0000)\n>\n> Honest question. This is like Season 3 all over again\n> \n> Seriously, she completely disappeared during the big tank/tanky bruiser meta about 6 patches ago. She was my priority ban whenever I would pick a Cinderhulk jungler like Sion. I was insulted by teammates for Vayne bans whenever I took a high HP tank.\n> \n> Then oh snap, tank meta basically disappears now she comes back? &quot;Well her counters disappeared&quot; I see her picked INTO Graves Kalista Tristana and Jinx, they dominated the meta during the time of Cinderhulk top laners and tanks. Her counters haven&#039;t disappeared, they&#039;re still freaking there. Did everyone forget that?\n> \n> She has received basically NO changes since Season 3 except a tiny E nerf and a moderate ult buff, she was considered trash tier even after that little buff, I had people accuse me of trolling when I tried to play her during the tank meta.\n> \n> Explain this. No don&#039;t bring up something like her &quot;true damage, self peel, stealth, blahblah&quot; give me a reason why she came back and why people are complaining about it. She has remained basically the same, her counters still exist in this meta, but she wasn&#039;t a common pick in the tank meta and now that&#039;s its basically gone she&#039;s back\n\nPeople are dumb, that easy","replies":[]},{"poster":"Knight SoIaire ","date":"2015-08-22T18:49:17.393+0000","up_votes":3,"down_votes":0,"body":"Vayne didnt get a change \n\nmeanwhile constant item tweaking goes unnoticed while it gave vayne some good power boost","replies":[]},{"poster":"Hexs Fortune","date":"2015-08-22T16:39:51.936+0000","up_votes":5,"down_votes":2,"body":"Botrk and her true damage allows her to deal damage as if she had 2 items, all the while lifestealing","replies":[]},{"poster":"Knalxz","date":"2015-08-22T18:58:07.613+0000","up_votes":2,"down_votes":0,"body":"is this really recently, no. It's just been on your radar recently. I've been saying she's OP shortly after i discovered her a year ago when I started playing the game. A guy on the old boards explained to me something about League.\n\n\nSome champions are just immune to nerfs.\n{{champion:64}}\n\n\nHe went on to say they normally don't get nerfed but everyone else gets buffed. Saying that's how we ended up with the burst META. Someone was OP so instead of nerfing them everyone else got buffed in their field so they could compare. So then other fields fell off and ended buffs and were continuing the cycle.","replies":[{"poster":"WutsKraken","date":"2015-08-22T23:49:04.639+0000","up_votes":2,"down_votes":0,"body":"Bro, I feared Vayne in the tank meta immediately banning her. Otherwise if she got picked guess who was my first target? Otherwise she would carry the game. Besides, even Lee Sin wasn't immune to nerfs. Back in the old boards I was one of the people who believed that as well but w/e\n\nBesides, the powercreep trend existed briefly before quickly disappearing and reappearing. Lee did get his nerfs, they just occurred during the powercreep trend as well","replies":[]}]},{"poster":"Remlap1223","date":"2015-08-22T18:43:05.450+0000","up_votes":2,"down_votes":0,"body":"Honestly, the problem is BORK.  The problem is that Vayne can rush BORK and get better damage output than all other carries get with Infinity Edge, just due to all of the catch all stats it has.  It just has wayyyy too much synergy with Vayne's kit, and it's the exact same problem why SD is so stupid.  You build SD and BORK on farm junglers like Yi, Jax, or Shyvana, or just BORK on Vayne, and they get a ridiculous damage spike that's extremely gold efficient.  The only other champion that has that kind of ridiculous synergy within their kits is Rammus and Thornmail, but Rammus is a tank and Thornmail is a defensive item.","replies":[]},{"poster":"I is Illiterate","date":"2015-08-22T18:31:25.550+0000","up_votes":3,"down_votes":1,"body":"The tank meta made Vayne more powerful than ever, and a possible upcoming bruiser meta will keep her strong. Bork is too good with her, and she has so many tools at her disposal to duel and team fight well, with stealth, mobility, and self peel. \n\nTl;dr: Vayne is super popular because of what the meta has been lately, and so more people get annoyed by her consistently.","replies":[]},{"poster":"Terff","date":"2015-08-22T16:12:42.587+0000","up_votes":6,"down_votes":7,"body":"Nerf bork and I'll be fine.  No reason a lategame adc should reach \"lategame\" at one item.","replies":[{"poster":"MohawkBird","date":"2015-08-22T19:15:38.467+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"Terff","date":"2015-08-22T23:11:08.345+0000","up_votes":1,"down_votes":0,"body":"The fact that she has a tumble and a condemn really is too much, it makes her too safe.","replies":[]}]}]},{"poster":"TahmKench Expert","date":"2015-08-23T00:42:53.686+0000","up_votes":1,"down_votes":0,"body":"If I had to pin it to something, I'd say the Malphite and tank reworks. Malphite was fucking off the charts in terms of shutting off an ADC, especially Vayne. If you can narrow Vayne's damage down to _**just**_ the true damage, you have a shield, movement steal, hard CC tied to some mobility, and you have an attack speed slow, the world of Vayne isn't that bad. When they switched him around, people stopped playing him as much. That's not to say he's bad now, he just lost traction. Other tanks had a similar fate, but on a smaller scale.","replies":[]},{"poster":"Crett","date":"2015-08-22T23:46:26.940+0000","up_votes":1,"down_votes":0,"body":"She didn't get better. She just got more popular, which made people notice how annoying she is","replies":[]},{"poster":"manbearswine","date":"2015-08-22T19:14:33.651+0000","up_votes":1,"down_votes":0,"body":"What do you mean vayne disappeared? vayne never disappeared,she was always one of the most popular champions.","replies":[{"poster":"WutsKraken","date":"2015-08-22T23:44:49.450+0000","up_votes":1,"down_votes":0,"body":"She suddenly rose back in pick rate in the last 5 months. Before that her pick rate was one of the lowest of ADC's","replies":[]}]},{"poster":"2yordles1cupcake","date":"2015-08-22T19:25:58.248+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=WutsKraken,realm=NA,application-id=3ErqAdtq,discussion-id=iGIE1Y0o,comment-id=,timestamp=2015-08-22T16:06:29.385+0000)\n>\n> Honest question. This is like Season 3 all over again\n> \n> Seriously, she completely disappeared during the big tank/tanky bruiser meta about 6 patches ago. She was my priority ban whenever I would pick a Cinderhulk jungler like Sion. I was insulted by teammates for Vayne bans whenever I took a high HP tank.\n> \n> Then oh snap, tank meta basically disappears now she comes back? &quot;Well her counters disappeared&quot; I see her picked INTO Graves Kalista Tristana and Jinx, they dominated the meta during the time of Cinderhulk top laners and tanks. Her counters haven&#039;t disappeared, they&#039;re still freaking there. Did everyone forget that?\n> \n> She has received basically NO changes since Season 3 except a tiny E nerf and a moderate ult buff, she was considered trash tier even after that little buff, I had people accuse me of trolling when I tried to play her during the tank meta.\n> \n> Explain this. No don&#039;t bring up something like her &quot;true damage, self peel, stealth, blahblah&quot; give me a reason why she came back and why people are complaining about it. She has remained basically the same, her counters still exist in this meta, but she wasn&#039;t a common pick in the tank meta and now that&#039;s its basically gone she&#039;s back\n\nOh stop it,{{summoner:32}}  You Vayne mains are some of the most delusional players that I have ever seen{{summoner:32}} . \nContinuously neglecting the new items/spells that are a core on Vayne by claiming she never changed. \n{{item:3153}} {{summoner:7}} \nVayne changed the moment she could peel for dayz without facing any risks which magically happened right at s3 and after it.\nRemove these items/spells or modify them and you will notice a huge change on her just as galio has felt ever since Force of Nature and the mana from banshee was removed.","replies":[{"poster":"WutsKraken","date":"2015-08-22T23:44:19.580+0000","up_votes":1,"down_votes":0,"body":"You know that basically she's the same as Season 3 right?\n\nNot to mention, check my match history and you'll see it's full of immobile people whom Vayne is designed to destroy. She is quite frankly the bane of my champ pool's existence. You're quite silly to think I'm a delusional Vayne main when she's probably one of my least played champs this season","replies":[]}]},{"poster":"dinkaroo","date":"2015-08-22T22:38:47.031+0000","up_votes":1,"down_votes":0,"body":"When Vayne was going up against mostly tanks before, the 20 / 30 / 40 / 50 / 60 true damage on her W wouldn't be a problem as opposed to the 4 / 5 / 6 / 7 / 8% health true damage. The flat rate true damage really isn't a problem for tanks and it's really just the % that hurts. As we begin to move away from the tank meta, less tanky champions come into play so the flat rate true damage really hurts. \n\nWith that true damage, she's become more of an assassin and not as much of an ADC since 60+8% hp as true damage is more damage than most ADC's have to offer. That damage comes to about 230 true damage on champions who don't usually build hp. That, paired with her Q (~450 total damage) and the stun on her e as well as the damage from {{item:3153}} adds up to a little too much damage in 3 hits.\n\nAlong with all that, her true damage lets her ignore being punished in lane more than any other ADC.\n\nTL;DR Vayne has flat rate true damage and that's pretty strong paired with %hp true damage, {{item:3153}}, her Q and her stun. She also isn't punished as hard as other ADC's which sucks.","replies":[]},{"poster":"Nimba","date":"2015-08-22T22:16:41.857+0000","up_votes":1,"down_votes":0,"body":"Boards need someone to complain about when Jinx or Kalista aren't being nerfed. \n\nVayne mains are super toxic, I won 600000 vaynespotting points yesterday when Vayne tried to fight someone haha up votes plsz, she can peel herself from the 100000 different brusiers with insane gapclosers or pointclick CC wtf pls get rid of this champ. \n\nThe boards wanted the people who could kill Vayne nerfed, they got nerfed and now they want Vayne nerfed. When Graves and Lucian are strong again, they'll be nerfed and Vayne will come back, just a cycle.","replies":[]},{"poster":"Orders","date":"2015-08-22T18:34:00.348+0000","up_votes":1,"down_votes":0,"body":"Vayne is one of those champs who I believe will never be a \"bad\" pick. Her damage is always relevant because of Silver Bolts, no matter how far behind she is.\n\nThat and I also believe Vayne is one of those champions that can abuse the environment of soloQ. Unlike in competitive play, soloQ is much less organized and strategies often don't go as planned.\n\nThis is probably why Jinx, Katarina, and Tryndamere are such forgiving champions in soloQ.","replies":[{"poster":"LostFr0st","date":"2015-08-22T22:08:04.499+0000","up_votes":1,"down_votes":0,"body":"Completely agree.\n\nAdd to this that she can \"fall behind\" then press R to catch up {{item:1038}} with tumble in AD to her opponent.","replies":[]}]},{"poster":"Binxy Prime","date":"2015-08-22T20:29:01.180+0000","up_votes":1,"down_votes":0,"body":"Because after repeated nerfs of the champs around her she has no weaknesses (in solo queue where 99.9999 percent of players play) She has over a 55% win rate above diamond with the highest pick rate in the game.  She even has a high win rate in lower level games which should not be the case on a champ with such strong mobility.\n\nShe is one of the safest late game carries because she can kill bruisers really fast with multiple self peels, tumble, invis, and a knockback.  And she can easily duel and kill every other carry once she completes a single item.","replies":[]},{"poster":"Haunt","date":"2015-08-22T19:12:32.538+0000","up_votes":1,"down_votes":0,"body":"Because she used to hardly be played. Why would everyone complain about a champion that is hardly played?\n\nNow she's the most popular champion in the game. Because of this, she is in WAY more games than she used to be, so people are finally coming to their senses and realizing how bull shit she is. \n\nYou see threads about Swain and Malzahar? They are both great picks but hardly anyone plays them, so of course there won't be 1000 threads complaining about them. Vayne however has been on my personal shit list ever since BotRK was released. ","replies":[]},{"poster":"Smitty Manjensen","date":"2015-08-22T19:05:18.592+0000","up_votes":1,"down_votes":0,"body":"People act as if changes don't happen, she got only buffed and the item she uses also got buffed while other carries got nerfed, guess what will happen?","replies":[]},{"poster":"Nekusen","date":"2015-08-22T19:03:03.018+0000","up_votes":1,"down_votes":0,"body":"its funny because most tanks get scaling armor that ends up giving more armor than the lost due to the item changes.\n\nthe only thing this parch nerfed is tank items on non tanks, but tanks are stronger","replies":[]},{"poster":"ChaosThief","date":"2015-08-22T18:41:27.970+0000","up_votes":1,"down_votes":0,"body":"During the tank meta you had the gromp buff and thornmail effectively murdering vayne for you, or so people thought. Vayne herself has not been changed, but the items around her have. The armor nerfs (mainly the attack speed slows being weakened on frozen heart and [I think] removed on randuins) hinder her less late game. \n\nThat's just my guess though.","replies":[]}]}