{"poster":"SIR ADMIRAL KLED","date":"2017-08-04T15:21:57.629+0000","title":"aiutatemi a capire","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"non capisco, in un game ero 8/1 al minuto 10, ma non sono riuscito a carriare perch&egrave; la bot la mid e il jungler hanno intato male, eppure li ho aiutati. \r\nNon do la colpa al team perch&egrave; ogni partita &egrave; carriabile. Voglio capire come snowballare partite al meglio, come vincere partite 1v9..\r\nplease help me.{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Jon Moxley","date":"2017-08-04T15:39:27.990+0000","up_votes":2,"down_votes":1,"body":"^ And that's why ho smesso di giocare mid e ho cominciato a giocare jungle.\nNeppure Bjergsen può fare 1v9, hell neppure Faker può. Devi sempre avere la fortuna di avere dei team mates che non dico vincano la lane ma almeno non ti complichino la vita. Ammettiamo che hai vinto la mid o la top e sei 5/0, se contro hai una Vayne che è 12/0 e ha un tahm kench o un trundle frontline, come pensi di carriare?","replies":[{"poster":"Pellah","date":"2017-08-04T16:08:48.198+0000","up_votes":2,"down_votes":0,"body":"Smurfando in bronzo e silver io ho avuto circa il 90% wr (Come qualunque smurf sopra il Diamond che conosco) e alcune di quelle perse sono consapevelo che giocando meglio le avrei carryate, ho carryato pure afk e una partita addirittura con 1 afk per i primi 10 minuti e 2 afk in mid game per più di 15 minuti.... per salire ti basta vincere come minimo 6 games su 10, se tu mi dici che hai la sfortuna di beccarti 5 games su 10 con 0 possibilità di carryare ho forti dubbi a crederti, probabilmente ti mancano le conoscenze per carryare :)\n(Mid e giungla sono entrambi ruoli che carryano molto grazie alla possibilità di potersi muovere tranquillamente per la mappa e gankare le altre lane)\n\nSe fosse basato sulla fortuna chi sarebbero gli eloboosters? I giocatori fortunati? :)\nL'abilità di scalare la soloqueue è proprio quella di saper carryare le partite perse, se non lo sai fare la tua wr rimarrà attorno al 50%","replies":[]}]},{"poster":"Pellah","date":"2017-08-04T15:50:46.607+0000","up_votes":2,"down_votes":0,"body":"Vincere la lane è inutile se non si sa come sfruttare il vantaggio preso.\n\nLa prima cosa (e anche più facile) da fare è prendere la torre, presa quella puoi roammare con meno pressione, invadere la giungla top e fare l'herald, quindi il tuo primo obiettivo è la torre, presa quella cerca di wardare la giungla top nemica (anche con l'uso di control ward) e di prendere il jungler nemico alla sprovvista uccidendolo o portandolo ad abbastanza poca vita da recallare (a questo punto i tuoi alleati sono più safe da gank), oltre ad invadere la giungla puoi roammare mid o bot per aiutare queste lane a prendere le torri nemiche o difendere le loro, tenendo sempre un occhio per difendere la top. Come main kled ti dovrebbe essere facilissimo roammare: (con il tp pronto per tornare top) recalli, ti dirigi verso mid o bot (La più pushata verso le tue torri) e ulti da fuori visione nemica per gankare, se hai un paio di kill, la kill è assicurata e di conseguenza anche il push la torre. Facendo prendere vantaggio alle altre lane dovrebbe essere più facile vincere. Oltre a questo prendi nemici isolati grazie a delle ward nella giungla nemica (o in altri sentieri percorsi spesso dai nemici), killali e il tuo tam si troverà 5v4 con fight e obiettivi come nash e drake assicurati :)\n\nInoltre cerca sempre di pingare i pericoli che vedi nella mappa (come gank imminenti nelle altre lane, roam dei laner, nemici avvistati sulle ward etc.), non sempre gli alleati rispetteranno i tuoi ping ma provarci di certo non peggiora le cose ;D","replies":[{"poster":"SIR ADMIRAL KLED","date":"2017-08-04T16:02:46.292+0000","up_votes":1,"down_votes":0,"body":"grazie cercherò di usare al meglio questi consigli :) \nso come giocare kled e con lui ho scalato carriando le peggiori partite, dal b4 al s2 è tutto uguale, è un easy carry, ma adesso sono stacked s1 e droppo s2 per poi carriare e tornare s1 e boh, unlucky.","replies":[]}]}]}