{"poster":"SIR ADMIRAL KLED","date":"2016-05-27T20:32:19.252+0000","title":"Skarner?","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Salve ho comprato da poco Skarner e mi &egrave; sorto un dubbio, perch&eacute; si fa ad skarner quando le sue abilit&agrave; han danni magici? E che build mi consigliate per giocarlo jungler? E secondo voi &egrave; un buon champ? Verr&agrave; nerfato/buffato? Grazie Dell riposte in anticipo","replies":[{"poster":"Giunco171","date":"2016-05-27T21:20:04.617+0000","up_votes":1,"down_votes":0,"body":"Non sunnita cambiamenti di statistiche perche è apposto così com'è. Se non lo vedi usato da \"pro\" è perché il mega di adesso prevede dei marksman ( tiratori ) come jungler ( quindi kindred e graves, bannati/ piccati loro due si va per elise ) si builda ad perché ha scaling bassi sulle skill mi sembra e poi si basa molto sugli auto attacchi e sugli stun che applica.","replies":[{"poster":"Darth Ponzius","date":"2016-05-28T17:48:14.246+0000","up_votes":1,"down_votes":2,"body":"cosa c'entrano i marksman jungler? la cosa che rende Graves, Kindred e Nidalee (che marksman non è) i top jungler al momento è il clear veloce e l'aggressione in early che portano. Skarner non sarà mai usato in competitivo per il fatto che le sue chiare debolezze in quell'ambiente verrebbero immediatamente e costantemente punite.","replies":[{"poster":"Giunco171","date":"2016-05-29T12:22:29.678+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Darth Ponzius,realm=EUW,application-id=cAOZwaUi,discussion-id=NeIEexYn,comment-id=00000000,timestamp=2016-05-28T17:48:14.246+0000)\n>\n> cosa c&#x27;entrano i marksman jungler? la cosa che rende Graves, Kindred e Nidalee (che marksman non è) i top jungler al momento è il clear veloce e l&#x27;aggressione in early che portano. Skarner non sarà mai usato in competitivo per il fatto che le sue chiare debolezze in quell&#x27;ambiente verrebbero immediatamente e costantemente punite.\n\nQualcuno qua non sa leggere e comprendereeee","replies":[{"poster":"Darth Ponzius","date":"2016-05-29T12:37:24.955+0000","up_votes":1,"down_votes":0,"body":"se dici \"il meta prevede dei marksmen jungler\" praticamente dai una risposta incompleta perchè manca decisamente NIdalee e perchè dicendo marksman non spieghi una fava del perchè Kindred e Graves siano dei top tier, sembra che lo siano perchè sono marksman, senza contare che dici che Skarner non è usato in competitivo perchè ci sono quei due, non pensando minimamente alle debolezze intrinseche del suo kit  che lo portano a non essere considerato (è stato usato mezza volta quando era op appena uscito il suo rework, poi non lo si è usato più per le debolezze di cui sopra). Quindi impara a leggere tu prima di fare certe uscite. E magari prova a spiegare meglio quello che dici.","replies":[{"poster":"Giunco171","date":"2016-05-31T16:16:17.205+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Darth Ponzius,realm=EUW,application-id=cAOZwaUi,discussion-id=NeIEexYn,comment-id=0000000000000000,timestamp=2016-05-29T12:37:24.955+0000)\n>\n> se dici &quot;il meta prevede dei marksmen jungler&quot; praticamente dai una risposta incompleta perchè manca decisamente NIdalee e perchè dicendo marksman non spieghi una fava del perchè Kindred e Graves siano dei top tier, sembra che lo siano perchè sono marksman, senza contare che dici che Skarner non è usato in competitivo perchè ci sono quei due, non pensando minimamente alle debolezze intrinseche del suo kit  che lo portano a non essere considerato (è stato usato mezza volta quando era op appena uscito il suo rework, poi non lo si è usato più per le debolezze di cui sopra). Quindi impara a leggere tu prima di fare certe uscite. E magari prova a spiegare meglio quello che dici.\n\nIo non ho bisogno di imparare a leggere o a spiegarmi meglio, lo so già fare. Comunque, mi dispiace che non capisci molto del perché skarner non è usato jungler e non è nel meta, ripeto, vanno di moda i marksman jungler nel meta attuale. ( vanno di moda i TIRATORI in GIUNGLA nel meta attuale [ te l'ho pure tradotta ;D ] ).","replies":[{"poster":"Darth Ponzius","date":"2016-05-31T16:41:34.122+0000","up_votes":1,"down_votes":0,"body":"io non capisco molto? \nte lo ricordi quando skarner era op da far schifo appena dopo il rework dei juggernaut? bene, lo sai quante volte è stato pickato in competitivo ai mondiali? 1 e con esiti del menga. Perchè? Perchè ha delle grosse debolezze dovute al fatto che è kittabile a morte, che basta una qss per farlo diventare ignorabile e annullare la parte più importante del suo kit (cosa che in campo competitivo non esitano a comprare).\nRoba che ho detto sopra.\nTu invece \"il meta prevede jungler marksmen\" cosa che non spiega una fava. Il meta prevede Jungler con fortissima pressione in early, jungle carry e con buoni clear visto anche la presenza di champ tank nella top lane forti al momento. E questi jungler sono Kindred, Graves e Nidalee, o altri buoni pick come Rek'sai, Elise, Lee e Gragas.\nSe come sembra, visto i vari nerf e buff, i jungler con cinderhulk torneranno ad essere meta, Skarner con tutta probabilità non sarà tra questi, visto che c'è gente con molte meno debolezze nel kit attorno a cui un team competitivo possa giocare (ulti con qss, poca efficacia fuori dai cristalli, il fatto che debba fare chase forzatamente). \nSe gli dici solo \"prevede marksmen\" non spieghi una fava ne del perchè Skarner non venga mai pickato in competitivo (e difficilment lo sarà come il suo compagno di giochi Volibear) e nemmeno cosa abbiano sti 2 marksmen di particolare per dominare il meta.\nSei riuscito a dare una risposta non argomentando una ceppa solo per tirare frecciatine a muzzo.","replies":[{"poster":"Giunco171","date":"2016-06-01T14:21:20.688+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Darth Ponzius,realm=EUW,application-id=cAOZwaUi,discussion-id=NeIEexYn,comment-id=000000000000000000000000,timestamp=2016-05-31T16:41:34.122+0000)\n>\n> io non capisco molto? \n> te lo ricordi quando skarner era op da far schifo appena dopo il rework dei juggernaut? bene, lo sai quante volte è stato pickato in competitivo ai mondiali? 1 e con esiti del menga. Perchè? Perchè ha delle grosse debolezze dovute al fatto che è kittabile a morte, che basta una qss per farlo diventare ignorabile e annullare la parte più importante del suo kit (cosa che in campo competitivo non esitano a comprare).\n> Roba che ho detto sopra.\n> Tu invece &quot;il meta prevede jungler marksmen&quot; cosa che non spiega una fava. Il meta prevede Jungler con fortissima pressione in early, jungle carry e con buoni clear visto anche la presenza di champ tank nella top lane forti al momento. E questi jungler sono Kindred, Graves e Nidalee, o altri buoni pick come Rek&#x27;sai, Elise, Lee e Gragas.\n> Se come sembra, visto i vari nerf e buff, i jungler con cinderhulk torneranno ad essere meta, Skarner con tutta probabilità non sarà tra questi, visto che c&#x27;è gente con molte meno debolezze nel kit attorno a cui un team competitivo possa giocare (ulti con qss, poca efficacia fuori dai cristalli, il fatto che debba fare chase forzatamente). \n> Se gli dici solo &quot;prevede marksmen&quot; non spieghi una fava ne del perchè Skarner non venga mai pickato in competitivo (e difficilment lo sarà come il suo compagno di giochi Volibear) e nemmeno cosa abbiano sti 2 marksmen di particolare per dominare il meta.\n> Sei riuscito a dare una risposta non argomentando una ceppa solo per tirare frecciatine a muzzo.\n\nAmo far tilta re le pseudo persone come te per un gioco. Si sì, avrei meglio da fare ma questo è molto più divertente.","replies":[{"poster":"Darth Ponzius","date":"2016-06-02T10:48:41.456+0000","up_votes":1,"down_votes":1,"body":"l'unica cosa che hai fatto è stata nasconderti dietro queste frecciatine insulse, vabbè contento tu","replies":[]}]}]}]}]}]}]}]},{"poster":"vondarck","date":"2016-05-30T15:46:37.364+0000","up_votes":1,"down_votes":0,"body":"io lo gioco come jaggernout\n\nla Q che è la sua principale fonte di danno in combo con la {{item:3078}} /{{item:3025}} scala AD (e una infima % AP) e con gli AA diminuisce i cd\n\nla W scala sia AP che HP..\n\nla E scala AP ma ha cd lunghi e serve poco + per rallentare e stunnare\n\nla R è ibrida.. ed è un altro CC\n\nio lo gioco così e mi diverto molto\n\n{{item:1401}} {{item:3025}} / {{item:3078}} {{item:3009}} / {{item:3111}} {{item:3748}} {{item:3053}} \n\n6th item situazionale.. {{item:3075}} / {{item:3065}} / {{item:3124}} / {{item:3800}}","replies":[]},{"poster":"SIR ADMIRAL KLED","date":"2016-05-28T15:18:36.242+0000","up_votes":1,"down_votes":0,"body":"Capito, grazie a tutti delle risposte","replies":[]},{"poster":"Ucr0niA","date":"2016-05-28T10:55:47.131+0000","up_votes":1,"down_votes":0,"body":"Ciò con cui fai Danno è la Q, che è una spell da spammare in modo assurdo, ed è AD, inoltre essendo forse nella top 5 delle spell spammabili (in ordine di CD) di questo gioco, rende Skarner uno dei più grandi sfruttatori del {{item:3057}} , si buffa l'Ad quindi per massimizzare la {{item:3078}} .","replies":[]},{"poster":"x A N D R E","date":"2016-05-28T10:54:15.032+0000","up_votes":1,"down_votes":0,"body":"La q è ad, per la giungla io faccio lama del cacciatore Gemma rossa, uomo morto, mannaia, gauntlet e spirituale","replies":[]}]}