{"poster":"janhennes","date":"2016-10-17T20:19:03.279+0000","title":"Midlane farm bei groupender botlane?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo erstmal ^^,\r\nhier kurz ein paar allgemeine Informationen zu meiner Frage zum besseren Verst&auml;ndnis. Ich bin zurzeit ein Midlanemain(silber 2 xD) und mir ist schon seit einiger Zeit aufgefallen ,dass sobald die 20.-25 Minute beginnt, ich nicht mehr in der Lage bin ein ausreichendes Goleinkommen zu haben da es (zumindestens auf meiner Low elo) zum festen Bestandteil einer Runde geh&ouml;rt, dass die Botlane in die Mitte roamt und mir der Adc s&auml;mtlichen Farm deniet. Meine Frage ist jetzt trotzdem an Gold komme ohne mit meiner Botlane einen Krieg anzuzetteln und unserem Jungler und Toplaner keinen Farm klaue. Meistens ist es dann n&auml;mlich so dass die Botlane bis zum T2 Tower gepusht ist oder falls nicht , sp&auml;testens nachdem ich dort ein bis zwei waves genommen so stehen wird. Da ich meistens eher zu Controlmages tendiere f&auml;llt f&uuml;r mich das splitpushen wohl weg obwohl das ( neben dem Counter jungling )wohl meine einzige Option w&auml;re was nat&uuml;rlich sehr riskant ist, da in low elo meistens keine Vision vorhanden oder keine ausreichende Map awarness (auch meinerseits) vorhanden ist. Hat irgendwer eine Idee ? :)","replies":[{"poster":"daBearSky","date":"2016-10-18T10:29:15.417+0000","up_votes":1,"down_votes":0,"body":"Midlanemain (dia 3) sagt dir: nimm dir den botlanefarm stattdessen wenn du musst und nimm etwas mit waveclear, dass sich der adc verarscht vorkommt wenn er mid kommt und max 1 minion/wave kriegt (sorgt auch dafür dass du grob >200 farm in min 20-25 hast; auch als silver, weil z.b. viktor e zu machen nicht schwer ist :b)","replies":[]},{"poster":"Zulwar","date":"2016-10-18T08:04:54.206+0000","up_votes":1,"down_votes":0,"body":"Ich als ADC main, kann dir nur zustimmen. Wenn ich Botlane gewinne und unser Midlaner hilfe brauch oder am Pushen ist, gehe ich auch dort hin und farme mit. Da mein Ziel halt ist, so schnell wie möglichen den Tower zu erreichen, bevor die Gegner reagieren.\nMeist fallen dann ein  bis zwei Waves an mich. Ehrliche gesagt, sollte dich das nicht allzu stören. Denn wenn der Tower down ist, kannst du ja noch das ein oder andere Junglecamp machen, um den Farm den du jetzt nicht bekommen hast auszugleichen. Dem Jungler sollte dies jetzt auch nicht allzu stören, da dieser zur not auch beim Gegner sich was holen kann.\nIn meinen Spielen, macht der Jungler dann eh kaum noch camps im eigenen Jungle, wodurch ich sie mir selber nehme. Das Geld soll ja nicht schlecht werden. ;)","replies":[]},{"poster":"Freiherr Alex","date":"2016-10-18T07:04:47.945+0000","up_votes":1,"down_votes":0,"body":"Also aus meiner eigenen Erfahrung als regelmäßiger (premate) Bot-Support Spieler:\nWenn die 20. Minute kommt ist man i.d.R. schon oft soweit dass man eine Lane Gewonnen oder Verloren hat. Hat die Botlane Verloren, sollte der ADC eigentlich nicht zwingend Mid kommen sondern auf Bot weiter Farmen und rauspushen bevor er kurz in die Mid roamt. Als Support gehe ich zu dem Zeitpunkt schon eher in die Mid um hier zu Versuchen dir den Rücken zu stärken dass wenigstens du deine Lane Gewinnst. Außerdem zieht die enemy Bot dann meist Richtung Mitte (und das ist der zweite Fall) um als Bot Lane \"Sieger\" die Mitte auch möglichst schnell zu fall zu bringen um den Vorsprung mehr zu sichern. Wenn du dabei allerdings mit dem Geld nichtmehr hinterher kommst solltest du versuchen mit dem ADC zu kommunizieren , Jung Camps machen (Raptoren) oder während ADC die Melees nimmt wenigstens versuchen die Range Minions zu holen. Kommunikation ist meistens der Schlüssel zum Erfolg :)\nViel Glück und Spaß weiterhin.","replies":[{"poster":"janhennes","date":"2016-10-18T07:30:03.470+0000","up_votes":1,"down_votes":0,"body":"Danke dir ^^ . Die Frage ist auch eigentlich mehr aus Tilt entstanden da es in der Soloque ja bekanntlich schwer ist diese Kommunikation zu erzeugen und auf nettem Level zu halten.","replies":[]}]},{"poster":"HHaie tabbian","date":"2016-10-17T20:59:29.651+0000","up_votes":1,"down_votes":0,"body":"Wenn du Controlmages spielst, sollte es dir eigentlich nicht zu schwer fallen, dir auch dann einen nennenswerten Teil des Farms zu nehmen. Ansonsten gibt es noch die Möglichkeit, deine Mitspieler zu bitten, dir auch Farm zu lassen. Allerdings sollten diese Situationen in der Regel nicht sehr lange andauern, zumindest nicht um Minute 20 herum. Und wenn doch, heißt das ja, dass die gegnerische Botlane ja auch in der Midlane sein muss, da ihr sonst einfach durchpushen würdet. Und dann entsteht für dich/dein Team ja kein Nachteil.","replies":[{"poster":"janhennes","date":"2016-10-18T07:28:39.860+0000","up_votes":1,"down_votes":0,"body":"Danke erstmal für deinen Kommentar :) . Stimme dir da auch zu aber einen nennenswerten Teil des Farms zu nehmen xD In meinem konkreten Beispiel war unsere Botlane als Sieger aus ihrem Matchup hervorgegangen ( unsere Jinx auch dementsprechend gefeeded ) und Jinx hat die Waves mit 2 aas ins jenseits befördert O_o das nenn ich waveclear","replies":[]}]}]}