{"poster":"Graßjockel02","date":"2018-09-07T14:08:23.795+0000","title":"5 Spiele jeweils 20 min Wartezeit wegen nichts!!!!","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo, \r\negal wer das liest, der muss wissen ich bin extrem w&uuml;tend auf riot. Ich wollte nur eine entspannte runde mit meinem gro&szlig;em Bruder spielen. Als dann die runde anfing begann schon der Bug. Ich konnte meine Kamera nichtmehr bewegen was daf&uuml;r sorgte dass ich nicht spielen konnte. Aufgrund dessen habe ich den PC neugestartet und wollte weiter spielen, da ich dachte dass der bug sich behoben hatte. Nach der Runde die ich absitzen musste, da ich nicht spielen konnte, kam auf einmal die Nachricht dass ich f&uuml;r 5 spiele eine Wartezeit von jeweils 20 min. warten muss OBWOHL ICH NICHTS DAF&Uuml;HR KANN !!!!!!!!! Das war jetzt schon das zweite mal wo das passierte und jetzt kann ich mich nichtmehr zusammen reisen. RIOT FIX YOUR GAME!!!!!!","replies":[{"poster":"damn bad kitty","date":"2018-09-07T14:10:40.129+0000","up_votes":2,"down_votes":0,"body":"Soweit ich weiß kann man die Kamera mit irgeneiner Tastenkombination fixieren... Google das mal, hatte das auch schon mal. Als ich dann die Kombination wusste ist es mir nicht mehr passiert.","replies":[]},{"poster":"Sidia","date":"2018-09-07T21:09:37.626+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\nmit der Taste Z oder mit dem Icon neben der Minimap kannst du deine Ansicht entsperren.\n\nDa du bereits 20 Minuten erhalten hast wird es nicht das erste mal sein, dass du Spiele verlassen hast. Einzelne Spiele bei denen Bugs auftreten toleriert der Leaverbuster.\n\nMit freundlichen Grüßen\nSidia","replies":[{"poster":"Graßjockel02","date":"2018-10-01T18:12:47.255+0000","up_votes":1,"down_votes":0,"body":"danke für den Kommentar aber leider funktioniert dies mit Z drücken nicht. Vllt. weil ich auf I mac spiele","replies":[{"poster":"Sidia","date":"2018-10-06T09:54:38.311+0000","up_votes":1,"down_votes":0,"body":"Hat der Mac denn keine Z Taste?","replies":[]}]}]},{"poster":"TheRealStubet","date":"2018-09-07T17:39:28.635+0000","up_votes":1,"down_votes":0,"body":"bei mir ist etwas ziemlich endliches und ich weis nicht wie ich das hinkriege ohne 5 mal 20 min zu warten","replies":[]}]}