{"poster":"Yuuki Terumi","date":"2015-03-12T05:23:58.007+0000","title":"Ping Spikes - TPG","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Now, before you go off and instantly dismiss this as a typical blaming servers, I think this has something to do with the connectivity of TPG's lines or my modem to Riot's OCE server, considering I get very stable download speeds, the spiking appears to only happen whilst I am playing League of Legends.\r\n\r\nI'd like some assistance in trying to smooth this out and figure out what line, route or whatever is related, and ask TPG for assistance in fixing that line or improving it.\r\n\r\nIt might be a recent problem too, since I did not get this problem prior to patch 5.4, so it could have something to do with the patch, but considering when I play and no one else is lagging, it's probably something like compatibility.\r\n\r\nThank you.","replies":[{"poster":"Jonius7","date":"2015-03-12T09:43:44.199+0000","up_votes":2,"down_votes":0,"body":"I am in the same boat. I didn't have any ping problems really until 2-3 weeks ago (about the time of Cyclone Marcia), I used to have 50 stable ping, but during that time it would be min 200, and very unstable spiking up to 600+. Now it will hover around 50-80 ping and spike to 400+, not being stable at all. On TPG, I called TPG on 1 March about these problems, seems they couldn't do much.\nI have noticed that it is relatively stable 95% of the time when I'm the only one using the Wi-fi, at certain times of the day.","replies":[]},{"poster":"Yuuki Terumi","date":"2015-03-14T07:03:12.846+0000","up_votes":1,"down_votes":0,"body":"I actually found the problem.\n\nAnyone who has uTorrent, PLEASE check your processes for \"EpicScale\". If you have that process, end it, AND THEN uninstall it. It should appear normally in your install/uninstall programs in Control Panel so don't panic. uTorrent is currently sneaking this program into recent installs of their client, and the program mines bitcoins and really eats your internet and CPU usage.","replies":[]},{"poster":"HORSE OF FORCE","date":"2015-03-14T03:43:00.664+0000","up_votes":1,"down_votes":0,"body":"Well it *is* TPG...\n\nHave you tried calling them? It could just be they didn't update your personal connection when they fixed their connections to Riot's servers.","replies":[]},{"poster":"ChicKhadee","date":"2015-03-12T06:41:49.720+0000","up_votes":1,"down_votes":0,"body":"Do you share your wifi with others? I used to have this problem, and I realised I can only play league when I'm the only one using wifi.","replies":[{"poster":"Yuuki Terumi","date":"2015-03-12T09:44:47.460+0000","up_votes":1,"down_votes":0,"body":"I do, but we both play together and have not had this problem before. We've checked with downloads and everything and it appears that we have  not done anything to increase the ping.","replies":[]}]}]}