{"poster":"Yuuki Terumi","date":"2015-09-15T05:48:27.493+0000","title":"Seara, The Fallen Star","subforum":"Player Creations","embed":{"description":"Thanks to GriningReaper's idea, you could make it so she has a great speed boost whilst moving the direction of Nova Ball and if she catches it her Nova Ball will either refresh it's cooldown and have the ability to shoot the ball and turn it into a beam, I don't know what ability the beam would be on though, probably the E while it remains on cooldown or the W while it remains on cooldown.","url":"http://forums.oce.leagueoflegends.com/board/showthread.php?t=75120&page=3","image":"http://cdn.leagueoflegends.com/apollo/assets/vb/small.jpg"},"up_votes":3,"down_votes":1,"body":"I&#039;m linking this back over. It&#039;s a year old (one year and one month old to be exact), but I think it&#039;s worth bringing up again as a concept rather than a contest entry. When I wrote this up, I kind of want to see it well, happen. I think it&#039;s an incredibly fun concept, and to be honest I was thinking about Lissandra and Syndra while making her QWE skills. Her ult on the other hand was a random idea coming from &quot;what if I could launch myself from across the map?&quot; and then basically turn it into a skillshot dash with semi-global range. It could be cool as hell.\r\n\r\n**Changelog**\r\n1. * Added (16/8/2014)\r\n2. * Added Cooldowns, Costs and numbers for skills. Passive still needs numbers. Also need to work on range.\r\n3. * Cooldowns for W have changed, as well as damage nerf. She can now have two Nova Balls out if she casts a 2nd one the moment she can, assuming a 1st one is already out. It&#039;s ballin&#039;. I&#039;m considering making the cooldown at first rank even lower (5 seconds), and max rank at 3 seconds, or 2.5 seconds. If this idea is good, let me know.\r\n4. * New E spell created. Is up for debate to replace the current one. Still need to make range though.\r\n5. * Clarity added to Passive.\r\n6. * Changes added to Afterburner (Q). Weaker early, but lasts longer. General damage and burst nerf early.\r\n7. * Number changes to Nova Ball (W). Base damages reduced all across the board, and AP scaling reduced slightly.\r\n8. * Scaling for Shooting Star (R) has been reduced.\r\n9. * Lore added.\r\n10. * Added ranges, and some more numbers. Also reformated to match requirements for contest.\r\n11. * Appearance added.\r\n12. * Concept for Q, W and Ultimate have been added.\r\n13. * Added to new boards (15/9/2015)\r\n\r\n**Design Direction**\r\nSeara&#039;s role is a ranged engage mage, with incredible AoE prowess in a closed area, as well as her ultimate, Shooting Star, allowing her to join fights from afar, or engage them if she sees an opportunity. Her kit is definitely suited for the mid lane, and is more team fight centric than laning phase.\r\n\r\n**Lore**\r\nSeara is a celestial being born from fire, representing the light of hope, she would appear as a shooting star in the night sky every so often, watching over all of Runeterra from the stars. Year after year, her presence in the night sky was adored, she was fed energy by all the earnest wishes people would make of her brief appearance every night.\r\n\r\nThough over time, the amount of energy she was receiving was becoming less and less, and less. She wondered why, but for now kept to her duties as a celestial being. Eventually, this decrease in energy, led to her crashing into Valoran. Her burning form was found in a crater by Soraka, and was nursed to health by her. The two recognized one another as fellow celestial beings, though it appears Soraka had broken the rules around her dominion, and lost her more radiant form. Seara on the other hand had only lost her full power, simply because wishes and faith in her appearance was much smaller than she could sustain with.\r\n\r\nAfter hearing of the League of Legends, Seara decided to join, and to try and garner as much faith as possible, to restore her powers and return to the night sky.\r\n\r\n**Role**: She fulfills mage and assassin quite well, but her style can also favor a few tanky stats due to getting in close occasionally.\r\n\r\n\r\n**Appearance**\r\n**Standard Appearance** (http://i.imgur.com/wh6Chgm.png)\r\n**Ultimate** (http://i.imgur.com/28efg81.png)\r\n**Q Afterburner** (http://i.imgur.com/S3eROme.png)\r\n**W Nova Ball** (http://i.imgur.com/MbGohHO.png)\r\n\r\n**Personality**\r\nPositive and peppy really. She did fall from heaven technically, and no it didn&#039;t hurt. She&#039;s a god**** star. Also great friends with Soraka maybe. She keeps getting calls from her.\r\n\r\n\r\n**Stats**\r\n_HP_: 375 (+83 per level)\r\n_HP Regen_: 6 (+0.55 per level)\r\n_Mana_: 240 (+45 per level)\r\n_Mana Regen_: 6 (+0.4 per level)\r\n_AD_: 48 (+2.5 per level)\r\n_Armor_: 15 (+3.7 per level)\r\n_Atk Spd_: 0.625 (+1.24% per level)\r\n_Magic Resistance_: 30 (+0 per level)\r\n_Movement_: 325\r\n\r\n\r\n**Skills and Kit**\r\n\r\n\r\n**Passive - Cosmic Retribution:** Upon death she will turn into a comet and fly off the map, and in the next 7 seconds can land anywhere within 2500 units and deal true damage (scaling with level, similar numbers to Zyra or Kog&#039;Maw passives) to enemies in that location after an 0.5 second delay (AoE effect area is around double one shot from Xerath ult, delay is similar to Kog&#039;maw ult). (This is another death-attack similar to Zyra).\r\n\r\n\r\nRange: 2000\r\nDamage: 80+ (20 x level) True Damage\r\n\r\n\r\n\r\n\r\n**Q - Afterburner:** Seara will cast a line of fire in one direction dealing (75/130/185/225/300+0.1AP) total magic damage over 4 seconds. Upon hitting an enemy unit or her Nova Ball, the fire will spread into a cone, damaging enemies behind the first target for 75% of the total damage. When in use, Seara&#039;s direction is locked, but she can also move and cast her other spells while this is active.\r\nQuote:\r\n\r\n**Cost:** 40/45/50/55/60\r\n**Cooldown:** 7/6.75/6.5/6.25/6 (cooldown starts upon cast, not when it ends)\r\n**Range:** 550 (+300 with cone spread, max range possible is 850)\r\n**Beam Width:** 80\r\n\r\n\r\n\r\n**W - Nova Ball:** Seara will throw out a slow moving skillshot that slowly moves in one direction for 4 seconds, that upon impact with an enemy unit will explode, dealing (50/75/150/225/300+0.75AP) magic damage to enemies within the blast radius, and slowing all struck targets by 40% for 1 second. The ball can be pushed to move faster by Seara&#039;s Afterburner, and can even change direction if Seara uses Afterburner from another angle. Nova Ball moves just slow enough to change positioning.\r\nQuote:\r\n\r\n**Cost:** 65/70/75/80/85\r\n**Cooldown:** 9/8/6.75/5/4 (starts upon cast) \r\n**Missile Width:** 120\r\n**Missile Speed: **150-1500 (speeds up to max 1500 with Afterburner over 1.5 seconds)\r\n**Blast Radius:** 250\r\n**Range:** No maximum range. It will explode after 1.5 seconds upon reaching maximum speed. Otherwise will linger or move until it expires or hits a target.\r\n\r\n\r\n\r\n**E - Star Launch: **Seara will charge for up to 3 seconds, and upon cast will launch herself instantly to one location after an 0.5 second delay, dealing (50/75/125/200/275 +0.75AP) magic damage to the first champion she hits, dealing 75% damage to minions on the way as well as stunning them for 1 second. The spell will move her further if she charges for longer, reaching full range at 2 seconds. While charging she moves slower, starting at 10% and going up to 50% at full charge. If she catches a Nova Ball inside the cast, she will shift it&#039;s path in the direction of the Star Launch, and immediately cause it to go at full speed, allowing it to follow her.\r\n\r\n**Cost:** 50/60/70\r\n**Cooldown:** 20/18/16/14/12 (cooldown starts when the charging starts)\r\n**Dash Range:** 200-700\r\n**Beam Width:** 120\r\n\r\n**NOTES and ANIMATION:** Casting style is very similar to Xerath, furthermore she cannot cast any other spells while charging, so it is ideal to use Afterburner and Nova Ball before charging this spell. The animation is a fireball, and it will only affect the one target that is hit.\r\n\r\n\r\n\r\n\r\n**R - Shooting Star:** Seara will channel for 3 seconds, and then launch herself to the target location as a living skillshot, dealing (200/300/400+0.8AP) magic damage to the first enemy hit, as well as stunning them. Enemies who are within the blast radius when she lands will also be slowed, and hit for a 90-50% of the full damage depending on how far away they are from the centre. Seara&#039;s ultimate has a maximum range, she will stop under three conditions. When she hits an enemy champion, when she reaches the &quot;target location&quot;, or when she reaches the maximum range. \r\n\r\n**Cost:** 100 mana all levels\r\n**Cooldown: **120/105/85\r\n**Range:** 3000/4000/5000\r\n**Area of Effect:** 600\r\n**Missile Speed:** 1800-2500\r\n**Missile Width:** 100-500 (gets larger starting at halfway towards &quot;target location&quot; or maximum range. &quot;Stun&quot; hitbox remains at 100.)\r\n\r\n\r\n\r\n**Tips and Tricks**\r\n**Playing As**\r\n1. * Afterburner (Q) is the core of her kit. She can use it to cover her escape while she charges Star Launch (E) simultaneously, which is especially useful if she has a Rylais built, or even play games with her Nova Ball. Since she can also cast while Afterburner is active, she can cast a Nova Ball right into her Afterburner, and cause it to fly fast right away.\r\n2. * Shooting Star (R) will allow Seara to join fights from far away, or engage enemies from unexpected positions. Since she also moves with it, it can be a reliable chase tool also. Unlike Pantheon, you can&#039;t actually see this one coming. (You can see her on minimap though).\r\n3. * Nova Ball (W) can be cast at point blank for instant AoE damage. It will also slowly float through walls. Nova Ball also lasts a very long time, so those skilled can make use of it as more than just a straight line skillshot.\r\n4. * Seara is very well suited in a team combination that aims for longer fights, and her Star Launch gives her assassination potential, as well as cleanup potential.\r\n\r\n**Playing Against**\r\n1. * Similar to Vi&#039;s Vault Breaker, Seara&#039;s Star Launch can be body blocked, so keep that in mind if you want to cut off her escape.\r\n2. * Seara&#039;s ultimate can be dodged like any other long range skillshot (Ashe, Ezreal, Jinx), but it cannot be blocked by say a Yasuo Windwall. If it is dodged, she doesn&#039;t stun anyone, and only slows whoever is in her radius.\r\n3. * Seara&#039;s direction is locked while she uses Afterburner, meaning while dueling her, it is ideal to flank her and reduce the total damage she can do to you.\r\n4. * Learn to dodge. Everything in her kit is a skillshot. Everything.\r\n\r\n\r\n**Design Summary**\r\nSeara is definitely a mid range mage, with her Afterburner and Nova Ball for safer play, while leaving the use of her Star Launch for assassination, with clean-up potential, but at the same time it functions as her only reliable escape tool, meaning if she goes in with it and cannot grab a kill, she is at risk with a long cooldown.\r\n\r\nAs a fallen star, and a shooting one, she flies fast and mows a low health enemy team down with a dazzling display of cosmic powers.\r\n\r\n\r\n**NOTE**: Numbers may need adjustment, all numbers here are tentative obviously, and there&#039;s no way to really test them and get accurately balanced results.","replies":[]}