{"poster":"ßêštTëęmøTrøłł","date":"2016-01-31T22:07:24.277+0000","title":"Mi triste historia de reembolsos","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Esta es mi historia de como perdi mis reembolsos...muy muy noob xD \r\nCuando era lvl bajo (1-5) no jugue nada con jinx, si no que con varus, el tema es que luego de el nivel 6 nunca mas lo jugue (yo muy noob presionaba la w para que hiciera algo, es peor que cuando tirabas la e de ashe esperando que hiciera da&ntilde;o) el tema es que descubri que se podian reembolsar campeones!! OMG! decidi jugar sin parar para comprarme a varus.. el tema es que tenia casi 4000 pi y lo deseaba impacientemente, que hice... xD... reembolse a nasus y a xin zhao para comprarme a varus... si matenme.. el tema es que luego de muchas partidas (3 o 4 diria yo) en las cuales me fue asquerosamente con varus lo reembolse xD, y con este reeembolso gaste mis 3 unicos reembolsos, el tema es que luego de pensar mucho me decidi comprar a jinx la cual habia probado en una rotacion de campeones gratuita... el tema es que no me gusto jinx tampoco y hasta hoy no la se usar, pero no termina aqui mi historia.. no xDD al nivel 23-25 mas o menos, ahi recien aprendi a jugar jungla, y adivinen a quien me compre, nada mas ni nada menos que a xin zhao!!! fuf (xin zhao en ese entonces lo devolivi porque me esperaba que fuera un campeon que matara solo tipo maestro yi, y me lo compre porque ahora que sabia junglear me podria ir mejor, hoy en dia es uno de mis picks favoritos) luego de eso en diciembre salio las ofertas navide&ntilde;as (tienda helada creo que se llamaba) y me salio a varus mas su skin a un precio ridiculo (obvio tenia -70%) y me la compre xDD (ahora que se jugar mas o menos bien varus en mi campeon favorito) si si compre denuevo dos de los campeones que reembolse... o un momento.. hace un tiempo me volvi a comprar a nasus (sigue sin gustarme) y haci perdi mis tres reembolosos por nada pues me volvi a comprar a los champs xD y deseo reembolsar a jinx pero no puedo jajajaja... si lo se soy retrasado xD","replies":[{"poster":"Maycoltf2","date":"2016-01-31T22:47:44.289+0000","up_votes":2,"down_votes":1,"body":"Yo no sabia que solo te daban 3 rembolsos crei que se recargaban y rembolsa a shaco heimerdinger  chogath pero alfinal me los compre denuevo{{item:3070}}","replies":[]},{"poster":"FXT Bengoku","date":"2016-01-31T23:52:23.529+0000","up_votes":1,"down_votes":0,"body":"Yo reembolse a trynda amumu y fiddle para comprarme a olaf :v","replies":[]},{"poster":"Nyán","date":"2016-01-31T22:58:49.214+0000","up_votes":1,"down_votes":0,"body":"Yo reembolsé a Ashe para comprar a Ahri. . . luego me compré de nuevo a Ashe XD","replies":[]},{"poster":"Zetha","date":"2016-01-31T22:30:41.070+0000","up_votes":1,"down_votes":0,"body":"Yo también quiero contar mi historia! (?\nApenas me adentraba al mundo de League of Legends, y vi que me habian dado 400 de rp, ¡Me emocione mucho! Asi que decidi gastarlo de la emocion...¿En Master Yi asesino? ¡No! ¡Compre a Master Yi con rp! Pero no me gustó ni un poco y a día de hoy tampoco me gusta, asi que lo reembolsé. Luego compre a Kayle con pi pero también la reembolsé, despues compre a Nasus con pi y tambien lo reembolsé. \nEn fin, con los 400 rp que volvi a tener compre la skin de Twisted Fate Rey de corazones cuando estuvo en oferta, el tema es que hace unos cuantos meses cargué rp y me compré a Twisted Fate Tanguero...Y me gusta mucho mas esa skin xD\nCon el paso del tiempo me compré a Master Yi porque si, pero no lo uso nunca, y también volvi a comprar a Kayle (otra que no uso nunca xD). Estuve pensando en si comprarme a Nasus pero me decidi por Renekton...Y creo que ese es el fin de mi historia. (?\n¿Me arrepiento de como gasté mis 3 reembolsos y mis rp de forma tonta? ¡Si, y mucho! \nSaludos! {{champion:51}} {{champion:119}} {{champion:90}} {{champion:106}} {{summoner:31}}","replies":[{"poster":"ßêštTëęmøTrøłł","date":"2016-01-31T22:34:52.209+0000","up_votes":1,"down_votes":0,"body":"Yo si me compre a yi asesino xDDD ez ermozo :3","replies":[]}]},{"poster":"Xan Irelia","date":"2016-01-31T22:30:55.065+0000","up_votes":1,"down_votes":0,"body":"mis primeros reembolsos fueron gangplank, draven Y GAREN jajaj, garen esta siempre gratis junto con ashe aunque no recuerdo que siempre haya sido asi (fue en la temporada 3)","replies":[]},{"poster":"KevinMarchant","date":"2016-01-31T22:18:27.739+0000","up_votes":1,"down_votes":0,"body":"a mi igual me paso :c\n{{item:3070}}","replies":[{"poster":"ßêštTëęmøTrøłł","date":"2016-01-31T22:19:23.762+0000","up_votes":1,"down_votes":0,"body":"{{item:3070}}","replies":[]}]}]}