{"poster":"Jhilista","date":"2017-07-18T15:47:00.030+0000","title":"Netzteil macht geräusche NUR wärhend dem spielen","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Hallo..\n\nmein Pc war vor 2 Wochen in Garantie eingeschickt wegen dem Netzteil es war eine Art Fiepen , kr&auml;zen..\nVor  3 Tagen habe ich den Pc wieder bekommen.\nUnd das netzteil macht immet noch leise strom ger&auml;usche.. mir kommt das bissl komisch vor deswegen frage ich mal euch..\nISt es normal dass das Netzteil w&auml;hrend dem Spielen strom ger&auml;usche (Wie ich es h&ouml;re) von sich gibt?\n\nBesitze eine GTX 1080 und einen i7-6700k das netzteil reicht daf&uuml;r maximal daf&uuml;r aus knapp 1000w soweit ich wei&szlig;.\n\nbitte um hilfe..\nAnsonsten l&auml;uft er 1A habe auch weder Ruckler noch FPS troz ingame..\nnur das ger&auml;usch kommt mir komisch vor aber vllt ist es normal ? :o\n\n\n","replies":[{"poster":"La vida Loca 38","date":"2017-07-19T14:36:18.182+0000","up_votes":1,"down_votes":0,"body":"Haben sie versucht das Gerät aus- und wieder einzuschalten xD?","replies":[]},{"poster":"Not2nice","date":"2017-07-18T20:49:37.600+0000","up_votes":1,"down_votes":0,"body":"Hallo, \nalso\n 1. 1000W keine ahnung ob dir dies jemand gesagt hat oder du dir eingebildet hast, aberr die sist zu 1000000 % viel zu viel. Ich sage dires nur, denn mit max.750W (und dies ist schon viel) hast du immer noch VIEL Polster nach oben)\n\nund zu deiner Frage, nein es ist nicht normal, denn es kann sein das dein Netzteil defekt ist, vlt. sogar falsche Spannungen sendet zu deinen anderen Komponenten und dies wieder kann dafür sorgen, dass deine Hardware Kaput geht.\n\nBeim Kauf vom Netzteil sollte man auf Marken Produkte setzten und auch etwas mehr investieren, damit die Versorgung nicht zu schwankend ist und somit die Lebendsdauer deines GESAMTEN Pc erhöht.\n\n\nlg","replies":[]},{"poster":"Nocì","date":"2017-07-18T17:07:07.898+0000","up_votes":1,"down_votes":0,"body":"Mit einem 1000W netzteil sollte man eigentlich alles schaffen...\n\nVorallem da eine 1070/80 weniger Strom verbraucht als die älteren Karten (700er Reihe bei Nvidia).\nDa liegt eindeutig ein Problem am Netzteil vor. \n\nIch selber ein ein 550W teil und dass reicht locker für ne 1070, I5-4440 auf nem Standart MB. \n\noder hast du noch nen ganzen LED-Zirkus angeschlossen, das es dadruch irgendwie zu engpässen kommen sollte?","replies":[{"poster":"Jhilista","date":"2017-07-18T17:30:42.847+0000","up_votes":1,"down_votes":0,"body":"Der Pc leuchtet rot aber das ist auch das einzigste.\nnaja werde ihn wieder einschicken\nfuking asus..","replies":[]}]},{"poster":"franticFurball","date":"2017-07-18T16:09:20.179+0000","up_votes":1,"down_votes":0,"body":">ISt es normal dass das Netzteil während dem Spielen strom geräusche (Wie ich es höre) von sich gibt?\n\nNein, ist es nicht.\n\nund wenn es nur beim Zocken passiert (auch bei anderen Spielen?) dann heisst dass das es das nur unter Last macht.\n\nDas widerum heisst dass im einfachsten fall einer der Lüfter im A... ist und die Nasen beim Service keinen Lasttest gemacht haben.","replies":[{"poster":"Jhilista","date":"2017-07-18T16:57:00.371+0000","up_votes":1,"down_votes":0,"body":"ok danke werde ihn direkt wieder einschicken","replies":[]}]}]}