{"poster":"Worst Riven 2016","date":"2019-11-18T10:34:19.650+0000","title":"unban dei perma test?","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Ciao, per caso con questo nuovo anno 2020 è previsto dall'inizio della season il test di sbannare tutti gli account perma come fu fatto in NA?\r\nO noi di euw non valiamo niente?","replies":[{"poster":"Khail the Crow","date":"2019-11-18T10:48:25.530+0000","up_votes":2,"down_votes":0,"body":"Noi di EU valiamo di più, per questo ci eviteranno questa inutile e dannosa perdita di tempo.","replies":[{"poster":"Worst Riven 2016","date":"2019-11-18T14:10:48.602+0000","up_votes":1,"down_votes":1,"body":"Non è una perdita di tempo c'è gente magari che è stata bannata 4 anni fa tipo me ed ora é honor 5.. Crescendo si impara uno passando da 17 a 22 anni cambia","replies":[{"poster":"Khail the Crow","date":"2019-11-18T22:41:25.368+0000","up_votes":1,"down_votes":0,"body":"Vero, ma il test sui grandi numeri ha già dato un risultato statistico molto forte. Tu saresti un'eccezione.","replies":[]},{"poster":"mangialavandini","date":"2019-11-18T15:10:28.614+0000","up_votes":1,"down_votes":1,"body":"l'honor non significa nulla e solo una stelletta che ti permette di prendere le cose, ma non significa che tu o altri o io, non sei/siamo/sono flammoni del cavolo.\n\nSbannare di massa è un insulto verso tutti i giocatori leali e un insulto verso le regole che hai firmato prima di entrare, oltretutto una mancanza enorme di rispetto verso tutta la communty di LoL, il ban è permanente prima di arrivarci ci sono delle fasi, dopo sono cavolacci tuoi il perdono non è più contemplato che io abbia 12 o 33 anni, LoL conta come maturi nel gioco non al di fuori, ci sei arrivato dopo e hai maturato per conto tuo? bene. rifatti l'account e di conseguenza rifatti una nuova \"vita\".","replies":[{"poster":"Worst Riven 2016","date":"2019-11-18T15:28:12.328+0000","up_votes":1,"down_votes":1,"body":"Ma ho già l'account era solo per sapere se facevano il test anche qua, due account sono meglio di uno","replies":[{"poster":"mangialavandini","date":"2019-11-18T15:30:51.567+0000","up_votes":1,"down_votes":0,"body":"ma hai capito il nesso di ciò che ho scritto?","replies":[]}]}]}]}]},{"poster":"mangialavandini","date":"2019-11-18T10:47:13.828+0000","up_votes":1,"down_votes":0,"body":"eh?","replies":[]}]}