{"poster":"HunterSeeger","date":"2017-03-13T01:46:09.758+0000","title":"Rinde tahm kench jungla??","subforum":"Guias y consejos","up_votes":7,"down_votes":1,"body":"Me podr&iacute;an ayudar con una build para tahm kench jg??? Las mec&aacute;nicas del campeon me parecen muy buenas con el tema del gankeo, pero para limpiar la jungla lo veo que puede tener muchos problemas y por ende, pierda su viabilidad como jungla. Si alg&uacute;n jugador experimentado o cualquiera que lo haya usado, plis comente y diganme que opinan del champ en la jungla.\nEDIT: Muchas gracias a todos los que opinaron en el post!","replies":[{"poster":"Turing Test","date":"2017-03-13T06:15:47.279+0000","up_votes":1,"down_votes":0,"body":"Tendrías que armarlo con runas de AD y apenas tengas 1200 comprar una {{item:3077}} . Tiene sentido que te armes tanque y no daño. Simplemente vas a asistir a las líneas que tengan buen DPS o burst. Con el slow de la Q de {{champion:223}} es suficiente para robar un flash. Podés ultear cerca del enemigo, ralentizar con la Q apenas entres y comer un súbdito del carril para un segundo slow. Convendría siempre ultear a las espaldas de el adc enemigo y en un bush de ser posible. No te centres en hacer un clear, no vas a poder nunca. Ganá oro a través de las asistencias. No tengas miedo en armarte {{item:3302}} para robar unos minions del carril. Armar {{item:3401}} es buena idea ya que es un item tanque-asistencia. No le veo sentido a centrarse en items de daño/clear ya que con el sapo vas a ir lento te armes lo que te armes (al menos más lento que un jungla regular) . Por eso en vez de daño en el item de jg , armate vida {{item:1413}} . Que quede claro que sí necesitás armarte el ítem de jg completo. Si bien, no vas a hacer un dragón, sos tanque y robarlo es una opción viable con el ulti de {{champion:223}} . El resto de los ítems de jg va a depender de lo que tengas enfrente. Particularmente, armaría un ZZ, un GA. En un determinado momento vas a divear quieras o no. Así que, concentrate en la utilidad.","replies":[{"poster":"Lëgolas","date":"2017-03-13T08:38:06.414+0000","up_votes":1,"down_votes":0,"body":"No usaste mucho a tk por lo visto.\nYa viene con un daño exageradisimo, incluso hace 1 año creo que lo nerfearon.\n\nApenas salio tk me volvi loco por el campeon, de tanto usarlo me aburrio, pero conozco todo de tk, no hace falta decir que en la jg, limpiaba rapidisimo la vieja jg, la de ahora no.\n\nAntes solo tardaba en el red y blue nada mas, ahora mas en todo porque son campamentos con muchos bichos.\n\n\"Por eso en vez de daño armate vida\", justamente, tk escala en vida, mientras mas vida mas daño.\n\nY te repito por si no quedo claro, daño, TIENE DE SOBRA, creo que casi deletear un super subdito, de los que aparecen cuando tiran un inibidor, casi deletear a uno con una sola habilidad, como la W, es tener daño exagerado.\n\nNi veigar con 1500 de ap le hace tanto daño.","replies":[{"poster":"Turing Test","date":"2017-03-13T22:40:53.679+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lëgolas,realm=LAS,application-id=8sKIclmi,discussion-id=iEKJPHIp,comment-id=00050000,timestamp=2017-03-13T08:38:06.414+0000)\n>\n> No usaste mucho a tk por lo visto.\n> Ya viene con un daño exageradisimo, incluso hace 1 año creo que lo nerfearon.\n> \n> Apenas salio tk me volvi loco por el campeon, de tanto usarlo me aburrio, pero conozco todo de tk, no hace falta decir que en la jg, limpiaba rapidisimo la vieja jg, la de ahora no.\n> \n> Antes solo tardaba en el red y blue nada mas, ahora mas en todo porque son campamentos con muchos bichos.\n> \n> &quot;Por eso en vez de daño armate vida&quot;, justamente, tk escala en vida, mientras mas vida mas daño.\n> \n> Y te repito por si no quedo claro, daño, TIENE DE SOBRA, creo que casi deletear un super subdito, de los que aparecen cuando tiran un inibidor, casi deletear a uno con una sola habilidad, como la W, es tener daño exagerado.\n> \n> Ni veigar con 1500 de ap le hace tanto daño.\n\nBásicamente, venís a traer noticias de dos años atrás y a decir que lo juegue como yo digo pero por razones diferentes. Buen aporte, dejame anotarlo en mi máquina de escribir invisible\n\nhttps://2.bp.blogspot.com/-8W896rZvviU/WBhkFOKejBI/AAAAAAAA9t4/GE-vHGhHQvIvkL_KYOBi__nBbYodfFdYACLcB/s1600/s-227.gif","replies":[{"poster":"Lëgolas","date":"2017-03-14T00:25:43.633+0000","up_votes":1,"down_votes":0,"body":"Emmm sea 2, 4 o 10 años atras, siempre escalo el daño con vida tk cosa que no sabias :)","replies":[{"poster":"Turing Test","date":"2017-03-14T02:36:03.590+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lëgolas,realm=LAS,application-id=8sKIclmi,discussion-id=iEKJPHIp,comment-id=0005000000000000,timestamp=2017-03-14T00:25:43.633+0000)\n>\n> Emmm sea 2, 4 o 10 años atras, siempre escalo el daño con vida tk cosa que no sabias :)\n\nhttp://m.memegen.com/ni3din.jpg","replies":[]}]}]}]}]},{"poster":"Soy Una Galleta","date":"2017-03-13T17:20:29.437+0000","up_votes":1,"down_votes":0,"body":"Runas de velocidad de ataque y daño o full velocidad de ataque (así lo uso yo) y tanke, item de jungla tanke, puedes comprar una tiamat para limpiar mas rápido, después la conviertes en una titanica","replies":[]},{"poster":"Tsume Asterisk","date":"2017-03-13T12:04:23.043+0000","up_votes":1,"down_votes":0,"body":"Cuando salió era god tier en la jungla, pero entre tanto nerfeo se fue a la b en cualquier posición. No lo recomiendo y menos para la jungla {{sticker:zombie-nunu-bummed}}","replies":[]},{"poster":"rokushoger","date":"2017-03-13T11:55:06.997+0000","up_votes":1,"down_votes":0,"body":"El tema es que tiene un clear tan lento que se queda atrás en oro y niveles, y cuando va a gankear (que tampoco es la gran cosa) suele terminar siendo más molestia que ayuda.","replies":[]},{"poster":"TSM Biøfrost","date":"2017-03-13T11:08:50.677+0000","up_votes":1,"down_votes":0,"body":"Me toco un TK en ranked ayer, y te puedo decir que no salio casi nada de la jungla para gankear, porque se quedaba atras en lvl. Salio 1/6 y encima culpaba al team. No recomendable","replies":[]},{"poster":"Nutria Lucida","date":"2017-03-13T07:45:48.227+0000","up_votes":1,"down_votes":0,"body":"con lo que te cuesta todo lo de la jungla vas a terminar tardando mucho y todo esto por el precio de ser \"bueno para el gankeo\"\nconclusion: sirve mas otro jg, aun uno que sea peor para gankear pero va a poder ir a gankear rapido y con mucha vida\n\nsi te gusta el champ ponete un poster de el en tu cuarto y mientras tanto jungleas con uno que rinda mas","replies":[]},{"poster":"Yitán","date":"2017-03-13T02:01:27.685+0000","up_votes":1,"down_votes":0,"body":"a mi me rindio MUCHO","replies":[{"poster":"HunterSeeger","date":"2017-03-13T02:14:41.567+0000","up_votes":1,"down_votes":0,"body":"con que runas y build lo usabas??","replies":[{"poster":"Yitán","date":"2017-03-13T02:33:09.235+0000","up_votes":1,"down_votes":0,"body":"nada de ap, el item azul de tanque para la jg (si queres el rojo, depende que tanta velocidad de ataque tengas) placa del hombre muerto, hidra (la gris), apariencia espiritual, quizas guantelete, el portal zz dependiendo del team y que tanto pusheen, puede servirte mucho final del ingenio...\nlas maestrias con velocidad de ataque en las rojas, cdr y mr en azules, vida en quitaesencias y armadura en amarillas\nlas botas a gusto propio, gralmente las de rapidez o movimiento","replies":[{"poster":"HunterSeeger","date":"2017-03-13T02:52:06.947+0000","up_votes":1,"down_votes":0,"body":"muchas gracias por el consejo loco, mañana lo pruebo. salu2","replies":[]}]}]}]},{"poster":"Sunday Holiday","date":"2017-03-13T02:11:43.781+0000","up_votes":1,"down_votes":0,"body":"Cuando salio Tahm kench lo subí maestría 5 en la jungla pero ahora sin los pequeñitos en el blue y en el red para usarlos como proyectiles en area no se como estará la cosa.","replies":[]},{"poster":"OS Lucky","date":"2017-03-13T02:06:07.660+0000","up_votes":1,"down_votes":0,"body":"rinde tanke y con attack speed...","replies":[]},{"poster":"Kappa japones","date":"2017-03-13T02:04:02.211+0000","up_votes":1,"down_votes":0,"body":"{{item:1419}} {{item:3153}} {{item:3124}} {{item:3078}} {{item:3146}} {{item:3672}}","replies":[]},{"poster":"Elmito Guapeton","date":"2017-03-13T02:00:54.294+0000","up_votes":1,"down_votes":2,"body":"si  y  no :(","replies":[]}]}