{"poster":"MasterCobra98","date":"2017-10-29T01:24:10.270+0000","title":"Possibili script pre condizionati in ranked?","subforum":"Aiuto e supporto","up_votes":3,"down_votes":2,"body":"Allora, ho passato tutta la season a giocare tranquillo autofill in solo a trovarmi con e contro cani e porci e le solite cose bellissime (rimanendo sempre dal silver 4 al silver 2), sono arrivato UNA volta in promo per gold e l&#039;ho persa perch&eacute; ho avuto un afk 3 volte di fila in 3 game della promo, mi &egrave; sembrato normale, ora &egrave; quasi 3 mesi che oscillo tra silver 2 e silver 1, ho giocato in tutto 18 promo e TUTTE e 18 contenevano almeno un troll a partita o un afk. Io non sono molto fedele al &quot;se sei forte sali&quot; ma pi&ugrave; al &quot;se sei forte hai pi&ugrave; possibilit&agrave; di salire&quot;, che &egrave; diverso.\r\nParlando ora per quel che riguarda lol penso da questi 3 mesi che ci sia un rank assegnato gi&agrave; da alcuni fattori, dove se sfori vieni considerato &quot;boostato&quot; e quindi da matchare con dei troll o bannati ripetutamente per afk, se cos&igrave; fosse filerebbe solo a un certo punto perch&eacute; in 18 promo diverse ormai &egrave; la prova del 9 del fatto che sia impossibile per me salire sopra il s1, anche giocando con smurf da low gold a high plat non si riesce a vincere nessuna fottuta partita con me in silver uno, nemmeno una.{{champion:32}}","replies":[{"poster":"mikellazzo","date":"2017-10-29T08:30:09.349+0000","up_votes":4,"down_votes":0,"body":"Mh, no, la riot non fa complotti per farti stare allo stesso elo e non farti sforare. Comunque guardando il tuo op.gg mi è saltata subito una cosa all'occhio, che è molto semplice, fai troppe troppe morti. Seriamente sono troppe 6/7 morti in media a partita in oltre 50 partite. Dovresti averne 3/4 massimo, anzi con Janna forse meno. E il motivo è presto detto, non wardi praticamente mai e al contempo fai giocate fin troppo aggressive o suicidi/dive senza visione. Da support devi prendere una pink ogni volta che vai back per i primi 10 minuti, dopo anche 2 se non 3 in caso di baron. Anche quella dannata sighstone usala, se no son 400 g sprecati.","replies":[{"poster":"MasterCobra98","date":"2017-10-29T09:46:37.556+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=mikellazzo,realm=EUW,application-id=98NGV4Al,discussion-id=FzEBZbjy,comment-id=0000,timestamp=2017-10-29T08:30:09.349+0000)\n>\n> Mh, no, la riot non fa complotti per farti stare allo stesso elo e non farti sforare. Comunque guardando il tuo op.gg mi è saltata subito una cosa all&#x27;occhio, che è molto semplice, fai troppe troppe morti. Seriamente sono troppe 6/7 morti in media a partita in oltre 50 partite. Dovresti averne 3/4 massimo, anzi con Janna forse meno. E il motivo è presto detto, non wardi praticamente mai e al contempo fai giocate fin troppo aggressive o suicidi/dive senza visione. Da support devi prendere una pink ogni volta che vai back per i primi 10 minuti, dopo anche 2 se non 3 in caso di baron. Anche quella dannata sighstone usala, se no son 400 g sprecati.\n\nCommento severo ma giusto, purtroppo janna non riesco proprio a giocarla safe! volevo impararla allora mi sono messo a giocarla (play for learn and not for win) ma nada, il resto delle critiche mi sembrano molto giuste, anche se mi lasciano con l'amaro in bocca... Beh hai ragione, da adesso proverò a dare il 100% della visione al team, grazie mille davvero","replies":[]}]},{"poster":"Floppyz","date":"2017-10-29T09:34:09.799+0000","up_votes":2,"down_votes":0,"body":"Non esiste alcun sistema del genere. Inoltre il gioco non può sapere in anticipo se un giocatore si comporterà male o andrà AFK.\n\nIo questa season (per ora) ho giocato 3 ranked, di cui una avevo un giocatore AFK in squadra, ma non credo ci sia un complotto contro di me; ci siamo messi d'impegno e abbiamo vinto lo stesso, grazie anche al fatto che i nemici litigavano fra di loro. :)","replies":[]},{"poster":"Sorcio84","date":"2017-10-30T19:30:16.852+0000","up_votes":1,"down_votes":0,"body":"se tu hai un mmr basso, vieni messo in un team alto per bilanciare\nstessa cosa se sei alto, ti matcha con gente bassa, questo per creare un team bilanciato, ma generalmente il sistema cerca di creare squadre il più possibile bilanciate, il resto lo fanno i pick e e la skill.","replies":[]}]}