{"poster":"exterra","date":"2018-10-31T02:51:48.577+0000","title":"Freeze de pantalla en plena partida","subforum":"Problemas Técnicos","up_votes":8,"down_votes":0,"body":"Hace unos dias (aprox desde el ultimo parche 8.21) he tenido problemas que en mitad de partida ma sale un bugsplat y me cierra la pantalla.\nSe soluciono al reinstalar el juego completo pero ahora en plena partida se escucha un sonido de notificacion y la pantalla se queda freeze, sería poco si es que pudiera cerrar la pantalla y reloguear pero no me deja cerrarlo ni siquiera con el administrador de tareas(la pantalla de la partida no se puede minimizar). Para poder hacer algo en el pc tengo que apagarlo apretando el boton de inicio\nAlguna persona que me ayude por favor o algun rioter amable =(","replies":[{"poster":"Kevrah","date":"2018-10-31T18:34:50.466+0000","up_votes":5,"down_votes":0,"body":"A mi me pasa exactamente lo mismo sin diferencia alguna, abrí mi discusión también porque si somos más, Riot se va a dar cuenta  y va a intentar solucionar el error en algún momento ya que no son solo un par de personas, sino una banda de gente que está quejándose del mismísimo problema.. a TODOS nos está pasando que 1)comienza la partida   2)se escucha el sonido de windows notificaciones    3)se queda tildada la pantalla y se mueve SOLO el cursor (en mi caso se mueve como en cámara lenta con algún retraso)       4)Intentas cerrar la ventana del juego pero al presionar las téclas de emergencia de igual manera sigue sin salirse    5) no te queda otra que apagar la computadora desde el BOTÓN   6)Al lograr entrar nuevamente, se te vuelve a crashear igual que antes, o ya terminó la partida y para la mala suerte te aplican el Leaver Buster por quedarte afk..   {{sticker:sg-lux-2}} {{sticker:sg-ahri-1}} {{champion:122}}","replies":[]},{"poster":"BryanGuti112","date":"2018-10-31T05:37:40.246+0000","up_votes":2,"down_votes":0,"body":"Yo dejé de jugar por este motivo antes jugaba unas 6 partidas diarias ahora con suerte 3 este bug me ha saltado mucho en la grieta del invocador y en aram el archivo que está dañado es uno de las torretas que se dañaron con el último parche eso crashea el juego y te saca","replies":[{"poster":"exterra","date":"2018-10-31T11:05:46.761+0000","up_votes":1,"down_votes":0,"body":"Alfin alguien que tiene alguna idea de lo que provoca el error.Lo malo es que empezo a ocurrir desde el 8.21. Pero hasta ahora no hay forma de reparar ese archivo cierto???","replies":[]}]},{"poster":"PerroooxD","date":"2019-06-18T00:37:44.522+0000","up_votes":1,"down_votes":0,"body":"Pudieron solucionar el problema?\na mi me sigue pasando deje de jugar por ese problema, hace poco me comunique con el soporte pensando que era el antivirus, pero es otra cosa, la vedad que no tengo ni idea de lo que pasa.","replies":[]},{"poster":"Fk u","date":"2019-02-10T01:03:23.640+0000","up_votes":1,"down_votes":0,"body":"Vengo porque tengo este mismo problema, parece que no tiene solucion verdad?\n:C","replies":[]},{"poster":"xLime","date":"2018-11-01T21:56:26.497+0000","up_votes":1,"down_votes":0,"body":"a mi también me pasa lo mismo, he cambiado drivers y reparado muchas veces, nada funciona","replies":[]}]}