{"poster":"sleeping atm","date":"2019-03-28T17:42:32.768+0000","title":"Coaching bis Gold","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Heei,\r\n\r\nwie oben stehend, gebe ich Coaching bis Gold, da es meine Freizeit ist und ich für höhere Elo zu tief in das Gameplay eingehen müsste.\r\n\r\n**Erst einmal zu mir:**\r\n\r\nIch bin Miguel, 23 Jahre und wieder durchgehend aktiver LoL Spieler seit Season 6. Hierbei habe ich auch durchgehend immer wieder Jngl und ADC gespielt und mich Season 8/9 bereits im Dia Bereich behauptet (Last Season Dia 1 mit Master Promo). Da ich mich gerne beweisen wollte, habe ich daher jede Season einen neuen Account erstellt und bin richtung Dia geclimped. Derzeit möchte ich mich jedoch etwas zurückziehen und erstmal in Gold/Platin chillen, weshalb ich mich mehr auf das Coaching konzentrieren möchte. Als Mains hatte ich im Jngl Evelynn und als ADC Draven. Jedoch habe ich bereits mit Lucian, Xayah, Twitch, Warwick, Yi, Amumu,... 70%+ wr in G+ erreicht, weshalb ich diese Champs auch sehr gut beherrsche und nicht nur ein OTP spieler bin.\r\n\r\n**Was ihr mitbringen solltet:**\r\n\r\nDa ich meine Zeit hierfür aufwände, solltet ihr auch selbst jemand sein, der willig ist zu Lernen und sich zu verbessern. Ansonsten kein tilter, da es sonst sowieso schwierig im ranked werden würde. Desweiteren solltet ihr euch eurer Rolle sicher sein oder mit mir zusammen eine passende Rolle für euch finden. Ein funktionierentes Headset, sowie ts sollte vorhanden sein, Discord ginge im Notfall auch.\r\n\r\nSollte euer Interesse da sein, könnt ihr mich erstmal auf **RG SoIoCarry** adden ( I ist ein großes i ) oder einen Kommentar da lassen mit kurzen Infos zu euch.\r\n\r\nPS: Bei zu vielen Anfragen werde ich Leute im Bereich Eisen/Bronze/Silber vorziehen.\r\n\r\nMfG\r\n\r\nMiguel | sleeping atm {{sticker:sg-ahri-2}}","replies":[{"poster":"7ΞΞΞΞΞΞ7ΞΞΞΞΞΞ7","date":"2019-03-28T18:02:36.089+0000","up_votes":1,"down_votes":0,"body":"netter Text, nur mal als Anmerkung. \n\nDerzeit möchte ich mich jedoch etwas zurückziehen und erstmal in Gold/Platin chillen, weshalb ich mich mehr auf das Coaching konzentrieren möchte.\n\ndieser Text ist meiner Meinung nach nicht Hilfreich, ein Dia 1 Spieler kurz vor der MasterPromo, der in Gold/Platin chillt, klingt für mich komisch. \n\nNur meine Meinung","replies":[{"poster":"sleeping atm","date":"2019-03-28T18:06:10.569+0000","up_votes":1,"down_votes":0,"body":"Hab diese Season nur bis Dia4 gespielt, wegen Internetproblemen letzte Woche (Verstärker ist verreckt) bin ich dann Platin gedropt. Da ich allerdings bereits Ziel erreicht habe, spiele ich mich erst mal nicht wieder hoch und ziehe meine restlichen Accounts auch nur bis Gold/Platin, da ich net mehr so viel zocken möchte und eben mehr auf das Coaching konzentriere {{sticker:sg-ahri-2}}","replies":[]}]}]}