{"poster":"CAZUELA DE POLL0","date":"2019-02-08T21:15:55.757+0000","title":"Algun main irelia","subforum":"Guias y consejos","up_votes":4,"down_votes":0,"body":"Que configuraci&oacute;n usa en irelia? cuando veo jugar irelia en el competitivo, a la hora de farmear lo hacen super clean, de una q en otra super rapido, pero a mi no me sale tan r&aacute;pido","replies":[{"poster":"Ivaroc","date":"2019-02-08T21:27:09.171+0000","up_votes":2,"down_votes":0,"body":"Eso es practica, al principio le vas a pifear, despues te acostumbras al daño que hace la q y ni lo pensas, una sola recomendacion, tradea solo cuando tengas cargada la pasiva, eso es mucho muy importante","replies":[{"poster":"CAZUELA DE POLL0","date":"2019-02-08T21:38:54.546+0000","up_votes":1,"down_votes":0,"body":"no me referia a eso","replies":[{"poster":"Ivaroc","date":"2019-02-08T21:50:52.849+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AK DicckMachine,realm=LAS,application-id=8sKIclmi,discussion-id=HeENsEsi,comment-id=00000000,timestamp=2019-02-08T21:38:54.546+0000)\n>\n> no me referia a eso\n\nRunas?","replies":[]}]}]},{"poster":"GR33NGOBLIN","date":"2019-02-09T13:01:07.573+0000","up_votes":1,"down_votes":0,"body":"estoy fascinado con este campeon, me encanta usarlo, pero como soy un noob siempre me rompen el orto, suopngo q debere practicar mas, pero siento q en early me ganan los trades mmuy facil","replies":[]},{"poster":"IRE 3 Booty Bae","date":"2019-02-09T08:45:38.529+0000","up_votes":1,"down_votes":0,"body":"Agregame si quieres y te ayudo. Soy otp irelia \n\nLB3 (nombre de mrda q me puse)","replies":[]},{"poster":"DNZ PROSTAGMA","date":"2019-02-09T00:35:59.086+0000","up_votes":1,"down_votes":0,"body":"Si por configuración te referis a build, generalmente lo más conveniente es un Tiamat o un brillo, y de ahí rushear Trinidad.\nAhora con los \"\"\"buffos\"\"\" de \"\"\"compensación\"\"\" la Q se nota un poco menos el daño reducido a Minions, yo lo noto mucho porque estuve acostumbrado a todos los buffos y nerfs que tuvo desde que la reworkearon, pero si sos nuevo es cuestión de acostumbrarte al nuevo daño determinado.\nSi te referis a runas, a mí siempre me gustó llevarla con conquistador, triunfo, la de velocidad de atq y última batalla, y para secundarias en inspiración con las galletitas y las potis mejoradas, antes se usaba con crisálida pero la sacaron :(.\nSuerte y si necesitas algo agregame, DNZ 505.","replies":[]},{"poster":"Lengz","date":"2019-02-08T22:10:32.692+0000","up_votes":1,"down_votes":0,"body":"Y practica, nada mas, no vas a cambiar una configuracion y vas a farmear super clean.","replies":[]}]}