{"poster":"MrSc0tty","date":"2014-09-25T19:24:14.699+0000","title":"\"We release a traditional skin when we change a champions look drastically\"","subforum":"Concepts & Creations","up_votes":22,"down_votes":10,"body":"Sion changes skin color, completely changes his outfit, gets a hole in his chest, loses his hair, loses his skull face, gains a metal jaw, loses his ornate bone axe, loses his bone arm, gets stitches across his back: no traditional skin. \r\n\r\nLee Sin changes his shorts and gets a haircut: Traditional Lee Sin. \r\n\r\nThe bias is hilarious.","replies":[{"poster":"Pryotra","date":"2014-09-26T03:21:39.262+0000","up_votes":17,"down_votes":0,"body":"As much as I know he deserves one, Sion will *never* get a traditional skin for his original look.\n\nWhy? China. \n\nAs racist as that sounds, it isn't. China, and alot of eastern asian cultures, find it offensive to display bones of the deceased in any form, and there are infact laws against it over there. \n\nLeague is trying to go international. As a result, they need a consistent character model across all regions. Hence why they will never have Sion getting a \"traditional\" skin.","replies":[{"poster":"He Who is Pale","date":"2014-09-26T13:05:46.200+0000","up_votes":2,"down_votes":0,"body":"Oh look, someone that's been paying attention, have an upvote.","replies":[]}]},{"poster":"MrSc0tty","date":"2014-09-25T19:26:05.630+0000","up_votes":6,"down_votes":5,"body":"Oops also forgot: COMPLETE PERSONALITY DELETION huehuehue. \nSure his personality is changed. \n\nBut even trundle didn't get THAT level of shift, at least he was still a \"silly character\". Sion is now Urgot 2.","replies":[{"poster":"sp441","date":"2014-09-25T22:29:27.632+0000","up_votes":13,"down_votes":1,"body":"Yeah, Sion used to be so different to Urgot, he used to be a reckless warrior that one day got himself into more trouble that he could handle and got himself killed, only to be brought back from the dead.\n\nWhereas Urgot is a reckless warrior that one day got himself into more trouble that he could handle and got himself killed, only to be brought back from the dead as a robotic crab man.","replies":[]},{"poster":"Rinky Dinky","date":"2014-09-25T20:56:17.498+0000","up_votes":6,"down_votes":0,"body":"Uh, by that logic, he was Urgot 2 in the first place","replies":[]},{"poster":"Pryotra","date":"2014-09-26T03:18:29.382+0000","up_votes":2,"down_votes":2,"body":"um, Bullsh!t?\n\nTrundle got exactly that. He used to be a runt that oportunisicly screwed his race out of their regenerative ability to become wolverine, even though that meant their eventual dieing out. Now he is a brute that screws over his race to \"save\" them and also rule as their king, and is no longer wolverine. Complete character deletion.\n\nSion looks like he is getting more grimdark, but honestly I think that could have hid behind the Ahnuld voice over terribad model, as while he may have looked goofy, his lore was anything but.","replies":[{"poster":"Angry Monster","date":"2014-09-26T08:55:25.420+0000","up_votes":1,"down_votes":5,"body":"another person that does not know the old lore and yet talks.","replies":[{"poster":"Pryotra","date":"2014-09-26T14:17:13.776+0000","up_votes":4,"down_votes":0,"body":">Prior to the creation of the League of Legends, the city-states of Demacia and Noxus were locked in a brutal series of on-again-off-again wars that spanned the course of centuries. Both powers sought an advantage over the other, but Noxus was the city-state willing to forego conventional morality to achieve its goals. Only brute strength and the will to use it mattered to Noxus, and this is best exemplified in the murderous warrior, Sion. Used by the Noxians as a human battering ram, Sion would be sent thundering ahead of Noxian troops. He would mercilessly slaughter foes with his large double-bladed axe, \"Chopper\". His complete disregard for caution ultimately cost him his life, as he was captured and summarily executed by Demacian forces.\n\n>The Demacians thought that the beheading of Sion would be the end of his bloodthirsty ways. Death, however, was merely the beginning of Sion's rise to power. The famed Noxian assassin, {{champion:55}}  Katarina, recovered Sion's remains and Noxian necromancers reanimated the behemoth to serve Noxus once again. Sion's reanimation actually bestowed new powers on him and increased the potency of his existing abilities, making him even more of a terror to behold on the battlefield. The Noxian High Command had a powerful new weapon in their hands - one they have brought to bear as a champion in the League of Legends. Even though Sion's increased powers would make him a powerful tool for the High Command's use outside the Fields of Justice, Noxus no longer risks losing one of their greatest champions in the League to chance or circumstance; Sion's days as a front-line fighter for Noxus' military conquests are at an end. \n\nHere is the old lore. Re-read it.\n\nYes, the quality of writing is bad, but at the same time, most of the new story doesn't contradict the old. With notable exceptions being that the league no longer exists, and instead of being captured he gave his life to take a king's. A bit more heroic, but at the same time not that different. If you translate \"Noxian Necromancers\" to be the Black rose, then even that adds up, even if the old lore skimped on details.\n\nIt's basically the same character, but better written.","replies":[]}]}]},{"poster":"Qiyeanu Reeves","date":"2014-09-26T10:12:29.950+0000","up_votes":2,"down_votes":0,"body":"Are you trying to say anything about old Sion was better? Because old Sion was a huge joke. Like, nothing about him was even scary, the champion, his art, and his lore were all laughable.","replies":[]}]},{"poster":"PsycloneJoker","date":"2014-09-25T20:33:05.273+0000","up_votes":9,"down_votes":1,"body":"I'm wondering about this as well. They gave Sej a traditional skin when they simply changed what she wore. So it would be VERY weird not to give Sion a traditional skin when they change him completely. I am concerned it isn't happening though since it isn't on the PBE or on the reveal page.\n\nWould really love if some Rioter could just answer whether he is getting one or not.","replies":[]},{"poster":"Angry Monster","date":"2014-09-26T08:48:59.834+0000","up_votes":5,"down_votes":0,"body":"I love when people make threads about things they do not understand. \n\nTraditional Lee Sin was never given out. The traditional line concept came out after the skin was named and put into the store. \n\nThe only Traditional Skins that were given out are for Karma, Trundle, and Sej. These skins are also locked up while Lee's is not.\n\nYou got to love when people make threads and know nothing about what they are posting. For the love of god please try to do some research. I am not even going to bother with the rest of your ideas. \n\n DOWN VOTES INCOMING FOR THE TRUTH.","replies":[]},{"poster":"Xyphios","date":"2014-09-25T22:43:11.839+0000","up_votes":4,"down_votes":0,"body":"part of the reason why they arent selling a traditional is because in most asian culture they find it disrespectful to show human remains( bones). That is also why the karthus's chinese splash art doesnt show his face because it his face looks like a skull. I hope they at least tweak it so that the bones dont show so we still get a sion traditional skin.","replies":[{"poster":"Remlap1223","date":"2014-09-26T02:06:24.598+0000","up_votes":1,"down_votes":1,"body":"So what, was Sion just permabanned in China then?  I doubt it.  They probably just censored him and gave him more skin.  They really can't be assed to do that to Sion for his traditional skin?  Give me a break.  Riot needs to calm their eSports boners and stop ruining this game.","replies":[]}]},{"poster":"BalanceProblem","date":"2014-09-25T23:31:59.350+0000","up_votes":4,"down_votes":2,"body":"This. It isn't just a new champion mechanically; The very flavor and essence of him as been altered. A traditional skin is needed.","replies":[]},{"poster":"Final GirI","date":"2014-09-25T20:07:46.136+0000","up_votes":2,"down_votes":6,"body":"So... you just expected them to go through a whole re-work and release a skin at the same time? Gotta love your high expectations. He isn't even out yet and you don't even know anything about what he is getting, skin wise. Try again once he is released.","replies":[{"poster":"Remlap1223","date":"2014-09-25T21:49:21.389+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"Final GirI","date":"2014-09-25T21:53:02.193+0000","up_votes":1,"down_votes":8,"body":"Oh I'm sorry Mr. Riot Employee, obviously that's what you are if you know what all the work has to be done is! Cuz obviously releasing a Traditional Skin would require different animations for all his new skills. Oh wait, you didn't think that through did you? You just expected him to keep using his old skills because he has a Traditional Skin? Because that's not how it works. They would have to change the animations and tweak everything because he has a whole new kit. Think before you speak next time.","replies":[{"poster":"Remlap1223","date":"2014-09-25T21:59:51.116+0000","up_votes":5,"down_votes":1,"body":"Maybe you should.  It's his goddamn traditional skin.  Let's run down all of the traditional skins in the game?  Trundle?  New textures.  Karma?  Nothing.  Sejuani?  Nothing.  Lee Sin?  Nothing.  Sion?  Probably textures at most, but most likely... NOTHING.  It literally will just be a recolor of his current skin with a bony arm, and his AHNOLD voicelines.  To quote Dr. House,\n\n>  Somewhere out there there is a tree, tirelessly producing oxygen so you can breathe. I think you owe it an apology.","replies":[]},{"poster":"MrSc0tty","date":"2014-09-25T22:37:37.845+0000","up_votes":2,"down_votes":0,"body":"Traditional Sion would proooobably just use default particles, because, you know. Entirely new move set except for the shield which is the same but visually improved.","replies":[]}]}]}]},{"poster":"CaptainMårvelous","date":"2014-09-25T23:17:23.488+0000","up_votes":4,"down_votes":3,"body":"My guess is it isn't done yet or it's in the works.\n\nAlso, Traditional Lee is a terrible example because A.) it was his original, ORIGINAL look and B.) it was before traditional skins were a thing.","replies":[]},{"poster":"Remlap1223","date":"2014-09-25T21:48:53.727+0000","up_votes":3,"down_votes":2,"body":"Riot really?  No traditional Sion?  You mean I'm not going to be able to play as the Govenator?  I'm disappointed.","replies":[]},{"poster":"Flintfall","date":"2014-09-25T23:52:15.693+0000","up_votes":2,"down_votes":1,"body":"My guess is that Sion's old model is so gnarled that to do a traditional skin they'd have to invent a Tradional Sion.\n\nLeaving out all irrelevant animations, creating a highly complicated model (all those changes you mentioned would have to be plowed over, it's essentially starting from scratch), and losing a lot of quotes (no grunts or anything, would sound awkwardly silent), you get left with a really crappy skin that had a whole ton of effort put into it.\n\nIt's not bias, it's way easier to redo textures and add a few animations for a skin, then to redo an entire model (which is way more complex then the updated base), dealing with a new VO, and an entirely new set of animations for said specific model.\n\n","replies":[]},{"poster":"ProfTayogasm","date":"2014-09-25T23:41:05.736+0000","up_votes":2,"down_votes":1,"body":"The is most likely because of what they said a very long time ago, and why they have almost zero skeletal champions in game. China, on of leagues biggest usebase, is very superstitious when it comes to skeletons and undead. Sion has always been barely able to skate by for that reason. So when they remade him they did away with all the skeletal parts because of that exact superstitious belief. \n\nAlthough, I totally agree most of my favorite parts of sion was his goofy zombie/skeleton look AND DAT ARNOLD voice. Please riot keep the hilarious arnold puns, stop being so god damn worried about copy right problems. Seriously if anythigng bugs me about LoL its that they are deathly afraid to make ANY reference to pop culture stuff besides dances in their game.","replies":[]},{"poster":"Coltsdale","date":"2014-09-30T18:43:28.114+0000","up_votes":1,"down_votes":0,"body":"Sion didn't dramatically change. The resemblance is still obvious. As for Lee Sin, that has another story of its own.","replies":[]},{"poster":"Old Man Teeto","date":"2014-09-26T10:18:22.030+0000","up_votes":1,"down_votes":0,"body":"He won't get a traditional skin since China doesn't approve of bones in video games out of respect for the deceased.\n\nThis game is owned by Tencent.  They will not create ANYTHING that Tencent doesn't approve of.\n\nAs a game that they want to be played internationally, they respect when a large percentage of customers are against a product.","replies":[]},{"poster":"Pika310","date":"2014-09-25T23:40:19.696+0000","up_votes":1,"down_votes":5,"body":"Can Sona get traditional versions for all her skins too?  The new versions look like trash.\n\nPlease and thank you.","replies":[]}]}