{"poster":"Mad Loony","date":"2018-04-21T20:24:04.927+0000","title":"Das fehlerhafte Zufallssystem!  Erklärung + Beispiel","subforum":"Spielerverhalten & Moderation","up_votes":6,"down_votes":22,"body":"Seit es lol gibt kommt es zu Beschwerden über ungerechtfertigte Strafen. In diesem Thread erläutere ich wie es zu diesen, teilweise an den Haaren herbeigezogenen, Urteilen kommen kann, welche das gesamte System dahinter sehr zufällig wirken lassen.\r\n\r\nDer Anfang liegt hierbei in der Community selbst. So kann ein äußerst toxischer Spieler, welcher nach nur wenigen Spielen einen Permabann verdient hätte, einfach Glück mit seinen Mitspielern haben und nicht reportet werden, wodurch er unter dem Radar bleibt. Gleichzeitig kann ein braver Gamer, dem nicht einmal in den Sinn kommen würde zu flamen oder auch nur etwas negatives zu schreiben, nach einem Spiel von einem getiltetem Mitspieler reportet werden. Wieso ein Report auch bei einem solchen Musterspieler eine Rolle spielt wird in Folge noch erklärt.\r\nHier haben wir also schon den Beginn, wo Pech und Zufall eine große Rolle spielen. \r\n\r\nNach einem Report kommt der allseits bekannte \"Chatfilter\" zum Einsatz. Dieser Filtert den Chatlog soweit bekannt ist \"automatisch\" nach Schimpfwörtern, toxischen bzw. negativen Verhalten etc.\r\nWo dies zu einem Problem wird veranschauliche ich in folgendem Chatverlauf. Rengar und Yasuo sind im Beispiel Premades, gewinnen das Spiel und werden von Khazix des gegnerischen Teams reportet, obwohl sie selbst den All-Chat gar nicht benutzt haben:\r\n\r\nRengar: gj Janna\r\nJanna: ty\r\nRengar: wp, not like the \r\nRengar: bronze supp\r\nRenagar: in our last game\r\nYasuo: nice one\r\nKhazix: (All-Chat) Rengar noob\r\nJanna: :D\r\nRengar: lel, yas u noob :)\r\nYasou: true\r\nYasou (Pentakill) \r\nRengar: worst yas ever \r\nKhazix: (All-Chat) yas reportet\r\nRengar: report for winning :)\r\nYasuo: dunno :)\r\nRengar: gj\r\nKhazix: (All-Chat) peace of shit\r\nRengar: \"peace\" of shit xD\r\nJanna: i would be tiltet as well in their team\r\nRengar: i would ff\r\nRengar: yas carry\r\n\r\n\r\nMit etwas Fantasie könnte man diesen Chatverlauf noch ewig weiterführen. Aber die Essenz ist klar. Der Chatfilter ist nicht dazu in der Lage komplizierte Sprachnutzung, wie Sarkasmus, Fragen, Antworten, Sprachkorrekturen etc. richtig zu bewerten. Rengar bekommt eine Nachricht mit folgendem Chatverlauf und zugehöriger CR:\r\n\r\nRengar: gj Janna\r\nRengar: wp, not like the \r\nRengar: bronze supp\r\nRenagar: in our last game\r\nRengar: lel, yas u noob :)\r\nRengar: worst yas ever \r\nRengar: report for winning :)\r\nRengar: gj\r\nRengar: \"peace\" of shit xD\r\nRengar: i would ff\r\nRengar: yas carry\r\n\r\n\r\nUnd jetzt stellt euch diesen einseitigen Chatverlauf hier im Forum unter dem Titel \"ungerechtfertigte CR\" vor!\r\nNach dem der Chatfilter über dieses Spiel läuft bleibt auch nur noch mehrfaches toxisches bzw. negatives Verhalten übrig.\r\nDer vom Support zugesendete Chatlog wirkt absolut toxisch, da der Kontext fehlt. Dieser manchmal sehr wichtige Kontext wird vom Chatfilter ignoriert, und Rengar bekommt in diesem Beispiel eine ungerechtfertigte und rein zufällige CR. Gleichzeit waren die Premades so gut gelaunt, dass sie Khazix nicht einmal reportet haben und er kommt einfach so davon.\r\n\r\nFalls dieses eine Spiel nicht für eine Bestrafung bzw. Benachrichtigung ausreicht, fällt Rengar trotzdem in das Radar des Systems, OHNE es jemals zu erfahren! Im schlimmsten Fall wird er später noch einmal reportet, weil ihm einmal in einem richtig brutalen Spiel ein einziges \"Noob\" herausrutscht. Und dieses Spiel bringt ohne Rengars Wissen das Fass zum Überlaufen und er bekommt auch in diesem Fall eine ungerechte und zufällige CR. Da Riot solche Daten grundsätzlich geheim hält, ist dieses Bestraffungssystem völlig undurchsichtig. Fehler, welche deffinitiv vorkommen, können von Spielern nicht überprüft werden. Nein, sie bekommen nicht einmal den kompletten Chatlog zugesendet.\r\n\r\nDas obige Beispiel zusammen mit den Erörterungen zeigt deutlich: \r\n\r\ndas Bestraffungssystem ist nicht gerecht, es kann zu zufälligen Strafen kommen und es ist das absolute Gegenteil von einem durchsichtigen, den Spielern gegenüber fairen System!\r\n\r\nToxische Spieler werden auf lange Sicht hin gebannt. Aber wie schnell und fair das passiert hängt von einem fehlerhaften Zufallssystem ab. Welches auf diesem Weg durchaus unschuldige Spieler mitnehmen kann. Und dieses System ist für Spieler komplett uneinsichtig.\r\n\r\nDieser Thread soll EUCH dazu anregen, auch einmal kritisch über alle möglichen Gegebenheiten im Leben nachzudenken.","replies":[{"poster":"HyperionCH","date":"2018-04-21T21:14:44.300+0000","up_votes":4,"down_votes":1,"body":"Niemand behauptet (auch Riot nicht), dass das System fehlerfrei ist.\nWobei es wohl nirgends ein fehlerfreies System gibt.\n\nAber sind wir einmal ehrlich:\n\nDie meisten schreiben nicht so:\n\n> Rengar: gj Janna\nRengar: wp, not like the\nRengar: bronze supp\nRenagar: in our last game\n\nWarum schreibt man dies nicht in einer einzigen Nachricht? (zumindest die letzten 3 Nachrichten)\nDenn dann wäre es weniger missverständlich. Du liegst nämlich mit einer Behauptung falsch: die Chatanalyse ist kein reiner Wortfilter. Es kann recht gut den Kontext verstehen. Aber wenn mann so abgehakt schreibt, wird es schwieriger.\n\nAbgesehen davon muss ich sagen, dass ich sehr, sehr selten so etwas lese ingame. Kaum jemand schreibt ingame über das letzte Game und lästert über die damaligen Mates (was btw. mich wohl nerven würde -> hat wohl auch einer deiner Mates, da du reportet wurdest).\n\nIch selbst würde bei einer guten Aktion höchstesn ein \"gj :)\" schreiben, bzw. jetzt wo es Emotes gibt: einen Daumen hoch.\nDenn grundsätzlich interessiert es meine Random-Mates überhaupt nicht, wie meine Mates im letzten Game waren. Also muss ich ihnen dies auch nicht mitteilen.\n\nBei Premates gibt es eh TS, Discord, etc. Da kann ich mit denen über diese Weise über meine Random-Mates im letzten Game lästern, wenn ich dies als nötig erachte (und meine Premates damit nicht allzu genervt werden). \n\nAls letztes kommt hinzu, dass man nicht wegen einem einzigen Game eine Strafe kriegt.\nRiot drückt insbesondere am Anfang ein Auge zu. Denn es ist möglich, dass man gerade einen schlechten Tag hatte (viel Arbeit, schlechte Note in der Schule gekriegt, etc.) und dann noch jemand toxisches im Team kriegt, der ständig beleidigt. Wenn man da ausnahmsweise einmal Contra gibt (und dieser nicht übertrieben ist), dann kommt man noch ohne Strafe davon.\nDeshalb kriegt man gerade in den ersten Strafstufen üblicherweise Chatlogs von 3 Games, in denen man toxisch war. Es ist sehr unwahrscheinlich, dass man innerhalb kurzer Zeit 3 solche Chatlogs - bei denen die Chatanalyse den Kontext falsch verstehen könnte - hat. Da ist es wahrscheinlicher, dass ein Spieler in 2 dieser Games wirklich toxisch war und einem das System ein Fehlurteil machte. Aber die 2 toxischen Games berechtigen immer noch zu einer CR-Strafe.\n\nSelbst wenn man 3x nicht toxisch war, kann man den Fall immer noch beim Riot Support melden und sie bitten, den Fall genauer zu untersuchen. Fehlerfrei ist das System wie gesagt nicht, auch wenn die Fehlerquote recht tief ist.\n\nTrotzdem sollte man sich überlegen, ob man diese Art von Konversation wirklich im Chat führen sollte.\nWie gesagt: warum sollte man so etwas schreiben? Schreiben von DIngen, die nichts mit dem laufenden Game zu tun haben, bringen eh nichts (ausser Ärger mit der Chatanalyse).\nEine CR-Strafe ist noch kein Weltuntergang. Wenn man zukünftig diese Art von Kommunikation unterlässt, wird man mit der Chatanalyse nie mehr ein Problem haben.","replies":[{"poster":"Mad Loony","date":"2018-04-21T21:42:37.653+0000","up_votes":1,"down_votes":3,"body":"Das jemand über das vorige Spiel lästert ist mir auch noch nie passiert. Eher das wer mit einem Pentakill oder so angibt. War halt ein gutes Beispiel hier.\n\nDas mit dem abgehackten Schreiben kommt vor wenn man während dem farmen den Chat benutzen will. Ist halt eigentlich auch dumm. \n\nAber ansonsten kommen so ähnlich Chatverlaufe schon vor. Wenn man kreativ ist oder eine Zeit lang den ingame Chat mitschreibt stößt aber sicher auf noch viel abstraktere Beispiele, welche den Chatfilter aushebeln.","replies":[{"poster":"Darkr3sQ","date":"2018-04-21T21:53:55.784+0000","up_votes":8,"down_votes":1,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=00060000,timestamp=2018-04-21T21:42:37.653+0000)\n>\n> Das jemand über das vorige Spiel lästert ist mir auch noch nie passiert. Eher das wer mit einem Pentakill oder so angibt. War halt ein gutes Beispiel hier.\n> \n\nWarte mal... Dir ist das mit dem über das vorherige Spiel lästern noch nicht passiert, aber du hast es jetzt einfach mal als Beispiel genommen, weil es für Deine These so super gepasst hat?\nWillst Du eigentlich über ein in Deinen Augen vorhandenes Problem mit stichhaltigen Argumenten diskutieren, oder willst Du sehr unwahrscheinliche Beispiele finden, die Deine These stützen?\n\n> Das mit dem abgehackten Schreiben kommt vor wenn man während dem farmen den Chat benutzen will. Ist halt eigentlich auch dumm. \n> \n\nWenn ich farme, will ich eigentlich den Chat nicht nutzen, da er mich vom Farmen ablenkt. Darüber hinaus muss ich nicht immer wieder Enter drücken, wenn ich den Satz noch nicht beendet habe, da ich beim Farmen in der Regel nicht die Tastatur benutze. Also wieder nur etwas absolut unwahrscheinliches, um Deine These zu untermauern.\n\n> Aber ansonsten kommen so ähnlich Chatverlaufe schon vor. Wenn man kreativ ist oder eine Zeit lang den ingame Chat mitschreibt stößt aber sicher auf noch viel abstraktere Beispiele, welche den Chatfilter aushebeln.\n\nWenn man lange nachdenkt, und viel Kreativität aufwendet, findet man selbstverständlich Sachen, die zu einem Problem führen **könnten**. Dies ist allerdings eher unwahrscheinlich, da meistens für solche kreativen Sachen im Spiel eher nicht die Zeit ist. \nIch könnte mir mit etwas Kreativität auch Szenarien konstruieren, wo ich von der Polizei mit aufs Revier genommen und erst einmal in eine Zelle komme. Allerdings werde ich auch da wieder rausgelassen, sobald sich die Angelegenheit geklärt hat. Wie in LOL auch.\nUnd darüber hinaus werden die wenigen Spieler, die fälschlicherweise bestraft wurden, von RIOT wieder entbannt. Wo also ist genau Dein Problem?","replies":[]}]}]},{"poster":"Lotuskobra","date":"2018-04-21T21:03:43.776+0000","up_votes":5,"down_votes":0,"body":"Niemand hat in diesem Forum je behauptet, dass Riot immer Recht hat. Es gab bereits etliche Fälle, in den Spieler (vor allem durch das Zitieren von Flame) zu unrecht bestraft wurden – es ist nur eben nicht der Regelfall. Du stellst es allerdings so dar, als ob man sich nicht dagegen wehren könnte – und das ist schlicht falsch! Mit deinem Beispiel beschreibst du eine Situation die wenige Prozent der Spieler betrifft, die eine Strafe bekommen haben.\n\nSind wir doch mal ehrlich: Der Regelfall sieht anders aus. Jemand flamet, weil er unzufrieden ist, die Fehler nicht bei sich, sondern jedem anderen sucht und schreibt sich das im Chat von der Seele, weil er über mangelnde Impulskontrolle verfügt. Dein beschreibener Sonderfall baut auf komplett ironischen Aussagen auf und könnte jederzeit mit dem Support geklärt werden, da sie die Spielstatistiken inklusive Timemarker des Chats sehen:\n\nDer Support weiß dann also, dass du nach dem Pentakill scherzhaft gesagt hast: \"Yasuo Noob, report for feed ;)\" einfach, weil du dich mit deinem Team ein wenig über die Gegner lustig machen wolltest (aber nicht im Allchat). Das kann man erklären und anschließend so ein Missverständnis aufklären.\n\n> Dieser Thread soll EUCH dazu anregen, auch einmal kritisch über alle möglichen Gegebenheiten im Leben nachzudenken.\n\nVielen Dank für die Denkhilfe, allerdings schießt du dir damit leider auch ein gewisses Eigentor, da man deinen Thread ebenso kritisch hinterfragen muss, wenn man diese Zeilen liest, wie das Bannsystem, von dem du sprichst. ;)\n\nFakt ist, dass du dich mit etlichen Zusammenhängen leider nicht wirklich befasst hast und auf Grundlage falscher Annahmen Dinge in den Raum stellst oder vermutest, die so nicht funktionieren:\n\n> Der vom Support zugesendete Chatlog wirkt absolut toxisch, da der Kontext fehlt.\n\nEs wird kein Chatlog durch den Support gesendet. Das Softwaretool, das mit Chatfilter, Feederbuster und Leaverbuster zusammenarbeitet, erstellt automatisch generierte Meldungen, sofern bestimmte Strafen/Szenarien getriggert werden. Der Riot Support wird erst dann in die Sache involviert, wenn du ihm ein Ticket schreibst – davor hat Riot selbst keinen händischen Einfluss auf alle Schritte, da das System komplett automatisch arbeitet.\n\n> Im schlimmsten Fall wird er später noch einmal reportet, weil ihm einmal in einem richtig brutalen Spiel ein einziges \"Noob\" herausrutscht. Und dieses Spiel bringt ohne Rengars Wissen das Fass zum Überlaufen und er bekommt auch in diesem Fall eine ungerechte und zufällige CR.\n\nLeider wirfst du in diesem Absatz jede Logik, die die Menschheit bisher erfunden hat über Bord: Offensichtlich hat der Rengar doch geflamet, wenn er jemand anderen als Noob bezeichnet oder? Und dafür wird er schließlich auch bestraft. Man muss schon deutlich häufiger als ein zwei mal so \"harmlos\" flamen, um vom System erkannt zu werden, wenn man sich die klassichen Chatlogs anguckt, sind das oftmals Romane die in einem Spiel zustande kommen. Deine Annahmen beziehen sich auf ein Szenario von 1:100.000, was einer Fehlerquote von unter einem Promille entspricht.\n\nHey wer hätte es gedacht, jedes automatische System hat eine Fehlerquote, so wie auch wir als Menschen nicht jede Entscheidung korrekt einschätzen können. Eine Fehlerquote von unter einem Promille ist unfassbar gut. Jeder Entwickler leckt sich danach die Hände. Du kritisierst also einen Umstand der vollkommen normal ist, der nicht vermieden werden kann und der so gering wie möglich gehalten wird.\n\n> das Bestraffungssystem ist nicht gerecht, es kann zu zufälligen Strafen kommen und es ist das absolute Gegenteil von einem durchsichtigen, den Spielern gegenüber fairen System!\n\nDas sehe ich komplett anders, wenn ich ehrlich sein soll.\n\n1. Weil ich dir gerade die Fehlerquote des automatischen Systems erklärt habe und das genau der Grund ist, warum es zu teils ungerechten Strafen kommen kann, diese jedoch so selten auftreten, dass es die normale Community nicht betrifft.\n\n2. Das System für alle anderen Spieler, die nicht das Pech haben einer von 100.000 zu sein, der zu unrecht bestraft wird, komplett einsichtig, logisch und in der Anwendung simpel ist: Flame nicht, mute Leute die dir auf den Sack gehen und du hast keine Probleme im Spiel. Ich schreibe gg wp, gj, wp team, nice one (auch mal in den Allchat) und glhf – fertig ist die Kiste. Wer dieses Mindestmaß an Zurückhaltung und Selbstdisziplin nicht besitzt, sollte kein kompetitives Spiel mit anderen Menschen spielen.\n\n> Toxische Spieler werden auf lange Sicht hin gebannt. Aber wie schnell und fair das passiert hängt von einem fehlerhaften Zufallssystem ab. Welches auf diesem Weg durchaus unschuldige Spieler mitnehmen kann.\n\nWenn du es nicht so hinstellen würdest, als ob das System eine Fehlerquote von 10 Prozent hätte, könnte man den Satz gerne so unterschreiben. Im übrigen ist das auch der Grund, warum es so schwer ist Absichtliches Feeden genau zu erkennen. Legt man die Grenzen zu scharf, werden zu viele Unschuldige gebannt und das kann Riot sich nicht erlauben – das ist aber auch kein Systemfehler, sondern ein Parameter, den man einstellen muss.\n\nIch rate dir, dich in deiner Freizeit (sofern dich das interessiert) mit Statistik und Systemtheorie zu beschäftigen. Ist an sich nen spannendes Fach und du scheinst dir über sowas ja durchaus den Kopf zu zerbrechen. Wenn du eine Möglichkeit findest die Fehlerquote zu halbieren und das System noch besser zu machen, nur zu (manche werden jetzt vielleicht lachen – aber nur so entstehen eben neue Ideen und Methoden). \n\nAber nimm ein wenig die Polemik aus deinen Texten, sonst bekommt man den Eindruck du möchtest deine Behauptungen mit unsachgemäßen Argumenten unterstützen.\n\nAlles Gute und viel Spaß beim Stöbern mit dem freien Mitarbeiter Google.","replies":[{"poster":"Mad Loony","date":"2018-04-21T21:22:44.600+0000","up_votes":1,"down_votes":3,"body":"Ich mache so polarisierende Aussagen damit mein Thread auch gelesen wird, war ja doch etwas aufwendig zu schreiben. In diesem Forum ist halt nicht so viel los, da ist sowas notwendig. Mir ist schon klar das sie Fehlerquoten viel niedriger sind als mein Kommentar vermuten lässt.\n\nTrotzdem handelt es sich um reale Probleme, über die sich auch Riot gedanken macht. Zusammenhänge sind für mich halt auch viel schwerer zu erkennen, da ich nur ein Spieler bin und kein Insiderwissen habe ;)\n\nEiner meiner größten Kritikpunkte ist ja auch das Riot den Spielern in vielen Punkten keine Einsicht gibt. Das bewirkt halt das einige Dinge für Spieler sehr unklar und  schwer nachvollziehbar sind. Das Bestrafungssystem fällt hier halt besonders auf, weil wirklich sehr wenig durchsichtigkeit gegeben ist. Es werden halt laufend Spieler mit unterschiedlich schweren Vergehen auf die gleiche Weise bestraft.\n\nDanke für die nette Anregung am Ende deines Kommentares :)","replies":[{"poster":"HyperionCH","date":"2018-04-21T21:42:09.430+0000","up_votes":5,"down_votes":0,"body":"Was würde es denn bringen, wenn Riot Games mehr Einsicht über die Funktionsweise der Chatanalyse gibt bzw. für alle Spieler klar ersichtlich ist, was man darf und was nicht?\n\n- Für normale Spieler (die nicht toxisch sind)\nFür den normalen Spieler ändert sich nichts. Denn sie waren vorher nicht toxisch, sind immer noch nicht toxisch und haben nicht vor toxisch zu werden. Es ist für sie also z.B. völlig egal, ab wann genau die Chatanalyse triggert und Strafen ausspricht. Denn sie werden mit der Chatanalyse keinen Kontakt haben.\n\n- Für toxische Spieler\nSie würden dann wissen, ab wann genau eine Strafe verhängt werden. Dies können sie ausnutzen, indem sie das System umgehen, weil nun klar erkennbar wird, wo es Schlupflöcher gibt wie z.B. was das Systen nicht erkennt oder man nur genau so viel flamet, wie das System noch akzeptiert.\n\nRiot Games hat kommuniziert, wie die Chatanalyse grundsätzlich funktioniert. Mehr ist aus meiner Sicht nicht nötig bzw. wäre wohl kontra-produktiv.","replies":[{"poster":"Mad Loony","date":"2018-04-21T22:19:59.601+0000","up_votes":1,"down_votes":3,"body":"Ich habe oben ja ausführlich erläutert, dass es sehr Wohl auch normale Spieler treffen kann.","replies":[{"poster":"Jastol","date":"2018-04-26T08:46:03.966+0000","up_votes":3,"down_votes":0,"body":"Ich bin ein relativ normaler Spieler (Kein Engel und kein Teufel), ab und an mal toxisch, wenn Ich nen schlechten Tag hatte oder so und dann auch irgendwie es nicht laufen will. Ich schreibe dann aber halt längere Texte statt nur Schimpfwörtern. Meist entschuldige Ich mich dann auch bei meinen Mates, wenn Ich so nen Ausraster hatte. Reportet wurde Ich also bestimmt schon recht häufig. Manchmal auch gerechtfertigt. Trotzdem hatte Ich jetzt in 3 Jahren noch keinen einzigen Bann oder CR. Liegt wohl einfach daran, dass Ich zwar manchmal toxisch bin, also z.Bsp. (\"Account from eBay?\", \"Have you ever played this champ before\", \"Why u dont watch map, i pinged several times\"...), und dass vll in einem von 25 Rankeds. Oft fange Ich an zu tippen und lösche es dann wieder, da Ich ja eigentlich weiß, das so ein verhalten absolut Kontraproduktiv ist. \n\nStrafe bekam Ich nie. Meiner Meinung nach, weil Ich \na) Nur sehr selten toxisch bin. \nb) Es immer relativ große Sätze sind anstatt die Buzzwords der Flamer (\"Noob\", \"Report\") oder das ganz schlimme Zeug zu verwenden.\nc) Ich selbst in den Spielen in dennen Ich toxisch bin selten mehr als drei oder vier Sätze von mir gebe.\nd) Ich auch sehr oft gehonerd werde für mein Verhalten in den zwei Dutzend Spielen in denen Ich nicht toxisch bin.\ne) Es eigentlich immer seltener wird, dass Ich so getriggert werde, dass Ich toxisch bin.\n\nIn meinen Augen hätte ich eine CR bestimmt mal verdient, dass System scheint aber noch weit mehr Freiheit zu lassen als Ich mir selbst eingestehen würde (Wenn Ich ein Spiel hatte, bei dem Ich toxisch war, mach Ich danach kein weiteres Game und lasse manchmal sogar ein paar Tage die Finger ganz von lol). Bisher habe Ich auch noch niemanden gesehen, der hier im Forum mit seinem Chatlog kam und nicht sehr viel toxischer war als Ich.\n\nPS:\nRengar: wp, not like the\nRengar: bronze supp\nRenagar: in our last game\n\nDas ist in meinen Augen auch Flame, also zurecht reportet und bestraft. Nur weil er nicht den support aus dem aktuellen Spiel sondern dem aus seinem letzten Spiel Flammed ist es trotzdem Flamme. Oder ist es deiner Meinung dann keine Beleidigung mehr wenn Ich jetzt in einem anderen Thread schreiben würde \"Oh, man, Ich habe gerade bei einem totalen Idioten einen Kommentar in dessen Thread hinterlassen\"?","replies":[]},{"poster":"manial fly","date":"2018-04-22T05:26:00.932+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=0004000000020000,timestamp=2018-04-21T22:19:59.601+0000)\n>\n> Ich habe oben ja ausführlich erläutert, dass es sehr Wohl auch normale Spieler treffen kann.\n\nNö, ich spiele seit S4 und hab noch nie auch nur mal eine Verwarnung oder so bekommen. Ich hab Premades die seit der Beta spielen und welche ebenfalls noch nie ein Problem mit sowas hatten.\nDas ganze wird bei uns auch niemals der Fall sein, weil wir wissen wie man sich im Spiel zu benehmen hat.\n\nDie \"normalen\" Leute von denen du sprichst sind Spieler die lediglich nicht so hart Flamen und für die es normal ist im Chat sowas zu schreiben wie: \"Report that noob.\"\nUnd wenn sie dann ihren Bann haben heulen sie hier im Forum rum das sie gar nicht beleidigt haben weil sie ja nicht so Wörter wie \"fgt\" oder \"kys\" geschrieben haben.","replies":[]}]}]},{"poster":"Darkr3sQ","date":"2018-04-21T21:41:16.328+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=00040000,timestamp=2018-04-21T21:22:44.600+0000)\n>\n> Ich mache so polarisierende Aussagen damit mein Thread auch gelesen wird, war ja doch etwas aufwendig zu schreiben. In diesem Forum ist halt nicht so viel los, da ist sowas notwendig. Mir ist schon klar das sie Fehlerquoten viel niedriger sind als mein Kommentar vermuten lässt.\n> \n\nWenn Du willst, dass Dein Thread gelesen und vor allem auch ernst genommen wird, solltest Du nicht unbedingt so polarisierende und vor allem extreme Aussagen treffen. Sie sorgen in erster Linie, dass Dein Thread nicht ernst genommen wird, weil Du Dich offenbar mit dem System und den dazu veröffentlichten Information absolut nicht auseinandergesetzt hast, und aufgrund Deiner CR gegen das System ziehen willst, und es als ein System darstellen willst, was zufällig mit Strafen um sich wirft.\n\n> Trotzdem handelt es sich um reale Probleme, über die sich auch Riot gedanken macht. Zusammenhänge sind für mich halt auch viel schwerer zu erkennen, da ich nur ein Spieler bin und kein Insiderwissen habe ;)\n> \n> Einer meiner größten Kritikpunkte ist ja auch das Riot den Spielern in vielen Punkten keine Einsicht gibt. Das bewirkt halt das einige Dinge für Spieler sehr unklar und  schwer nachvollziehbar sind. Das Bestrafungssystem fällt hier halt besonders auf, weil wirklich sehr wenig durchsichtigkeit gegeben ist. Es werden halt laufend Spieler mit unterschiedlich schweren Vergehen auf die gleiche Weise bestraft.\n\nNatürlich werden die Spieler - wenn es nicht rassistische, schwulenfeindliche oder extreme Sachen wie kys - gleich behandelt. Das hat auch absolut nichts mit Zufallssystem oder so etwas zu tun. Zufallssystem wäre, wenn das System quasi würfelt, welcher zufällig ausgewählte Spieler für welchen zufällig ausgewählten Grund eine zufällig lange Strafe erhält.\nNichts davon trifft bei dem IFS zu. Hier werden Spieler geprüft, die reportet werden. Liegt im Chat toxisches Verhalten vor, und fällt es nicht in oben genannte Ausnahmen, dann wird die entsprechend nächste Strafstufe ausgesprochen.\nDadurch, dass es alle Spieler gleich behandelt, ist es durchaus fair.\nWie hier aber bereits angesprochen, ist auch dieses System nicht unfehlbar und auch nicht perfekt, aber dadurch dass es eine sehr geringe Fehlerquote hat, ist es durchaus recht gut.\nDarüber hinaus: In was willst Du denn mehr Einsicht? Vielleicht gibt es hierzu bereits Informationen, die Du nur noch nicht berücksichtigt hast? \n","replies":[{"poster":"Mad Loony","date":"2018-04-21T22:14:51.345+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=ZcDQ0Dt6KV,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=000400000001,timestamp=2018-04-21T21:41:16.328+0000)\n>\n> Wenn Du willst, dass Dein Thread gelesen und vor allem auch ernst genommen wird, solltest Du nicht unbedingt so polarisierende und vor allem extreme Aussagen treffen. Sie sorgen in erster Linie, dass Dein Thread nicht ernst genommen wird, weil Du Dich offenbar mit dem System und den dazu veröffentlichten Information absolut nicht auseinandergesetzt hast, und aufgrund Deiner CR gegen das System ziehen willst, und es als ein System darstellen willst, was zufällig mit Strafen um sich wirft.\n\nIch habe aber das Gefühl das mein Beitrag, zumindest von den Riot Mitarbeitern, sehr ernst genommen wird.","replies":[{"poster":"eingew","date":"2018-04-22T05:18:27.937+0000","up_votes":4,"down_votes":0,"body":"Die lesen den Beitrag vermutlich nicht. Also klar huschen die hier ab und an durch, aber vieles, was hier geschrieben wird, bleibt in dieser Hinsicht unter dem Radar.\n\nFalls du damit uns \"bunte\" meinst, wir sind keine Rioter, sondern \"[Volunteers](http://en.volu-eu.org/)\", also Ehrenamtliche, die zwar von Riot abgenickt werden, aber eben keine Angestellte, sondern freiwillige Helfer sind. Abgesehen von der Farbe meines Namens unterscheide ich mich also nicht sonderlich von dir.","replies":[{"poster":"Sirrkas","date":"2018-04-22T08:17:38.031+0000","up_votes":3,"down_votes":0,"body":"Du hast deine Eule vergessen und dass unsere Ingameicons davon überschrieben werden.","replies":[{"poster":"Lotuskobra","date":"2018-04-22T08:45:28.632+0000","up_votes":3,"down_votes":0,"body":"https://i0.wp.com/mipap.de/wp-content/uploads/2015/12/xmas-owl.gif?resize=250%2C304\n\n","replies":[{"poster":"Sirrkas","date":"2018-04-22T22:22:38.575+0000","up_votes":3,"down_votes":0,"body":"Ich habe schon viele Eulengifs gesehen (die meisten glaube ich von Humpel) aber das gehört zu den besseren.\n\nWobei mein persönliches Lieblingbild noch immer das hier ist:\n\nhttp://www.demotivation.us/media/demotivators/demotivation.us_SELF-CONTROL-The-only-way-to-survive-in-a-world-full-of-idiots_136051333172.jpg\n\n","replies":[]}]}]},{"poster":"Mad Loony","date":"2018-04-22T13:26:07.680+0000","up_votes":1,"down_votes":1,"body":"Achso. Ich dachte das ein paar Mitarbeiter des Support-Teams mit ganz normalen Accounts hier im Forum posten.","replies":[{"poster":"Darkr3sQ","date":"2018-04-22T14:12:27.675+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=000400000001000000010001,timestamp=2018-04-22T13:26:07.680+0000)\n>\n> Achso. Ich dachte das ein paar Mitarbeiter des Support-Teams mit ganz normalen Accounts hier im Forum posten.\n\nHier ist wieder mal ein schönes Beispiel: Du nimmst etwas an, betrachtest es als Fakt und berufst Dich darauf.\nWie kommst Du auf die Idee, dass RIOT-MA deinen Thread ernst nehmen, wenn Du gar nicht weißt ob sie es überhaupt lesen?","replies":[]}]}]}]}]},{"poster":"Sirrkas","date":"2018-04-22T08:14:45.706+0000","up_votes":3,"down_votes":0,"body":">Das Bestrafungssystem fällt hier halt besonders auf, weil wirklich sehr wenig durchsichtigkeit gegeben ist. Es werden halt laufend Spieler mit unterschiedlich schweren Vergehen auf die gleiche Weise bestraft.\n\nDas nicht gesagt wird, ab wann genau jemand die erste CR oder ähnliches erhält macht doch Sinn. Wenn man ganz genau darlegt, wie die Systeme für Strafen funktionieren, kann man die vermutlich auch gleich wieder einstampfen. Die Leute wissen dann zwar, wie die funktionieren, aber daraus kann man ganz einfach ableiten, wie man die Systeme umgeht. \nDas kann man sich vielleicht ein wenig wie polizeiliche Ermittlungen vorstellen. Wenn die Polizei Spuren findet, macht es wenig Sinn, damit sofort an die Öffentlichkeit zu gehen, außer man möchte den Täter darüber informieren, dass er besser das Land verlassen sollte, ehe man etwas handfestes gegen ihn gefunden hat.\n\nAußerdem werden Spieler doch gar nicht für so viele unterschiedlich Dinge gleich bestraft. Stattdessen gibt es ziemlich simple vorlagen. Chatvergehen bringen 2 mal CR, 2 Wochenbann und Permabann. Mit der Option auf das Überspringen einiger Stufen, bei richtig schlimmen Fällen. Trolle etc. kriegen einen 2 Wochen- und dann den Permabann. Accountsharing und Nutzung unerlaubter Programme (etwa alles was unter Cheating fällt) gibt einen Permabann. \n\nIch schätze mal du spielst hier darauf an, dass jemand für ein \"Noob\" ebenso einen Permabann erhalten kann, wie jemand anderes für \"die on cancer, faggot\". Aber die beiden werden nicht auf die gleiche Weise bestraft. Die haben ganz unterschiedliche Hintergründe. Der \"noob\" Typ kriegt den Permabann, nachdem er 3 vorherige Stufen ignoriert hat, der andere fängt direkt beim 2 Wochenbann an und der nächste Fehltritt ist der Perma. \nDas ist hier so ähnlich wie mit Wiederholungstätern. Wenn man immer und immer wieder beweist, dass man sich nicht ändern kann und will, werden die Freiheitsstrafen eben auch härter. Am Anfang ist es wohl noch eine Bewährungsstrafe. Beim nächsten mal dann nicht mehr.","replies":[]}]}]},{"poster":"MeMyselfandBaal","date":"2018-04-22T01:32:03.726+0000","up_votes":4,"down_votes":0,"body":"Ok, hier ist das Grundproblem an deiner \"These\": Für dein Beispiel würde ein Spieler maximal eine 5 Spiele Chat Restriction erhalten. Was genau genommen (in Zeiten der Smartpings braucht man den Chat kaum) keine Strafe, sondern eine Warnung ist.\nUnd dann liest der besagte Spieler sein Chatprotokoll und stellt dann fest: Ok, ich sollte aufhören meine Zeit in Game damit zu verbringen, über Spieler aus vergangenen Spielen zu flamen (und ja, genau genommen flamed er in deinem Beispiel sogar... nur halt seinen letzten Support...). Und er stellt fest, dass negatives Verhalten durchaus geahndet wird.\nWas im Endeffekt dazu führt, dass er ohne große Konsequenzen (er kann halt für 5 Spiele nicht chatten... OMG!!) zu erfahren sein Verhalten anpasst und ein vorbildlicher Spieler wird...\n\nWenn es ein Szenario gäbe, in dem dein beschriebener Spieler dafür einen 14 Tages Bann bekommt, hättest du eine Diskussionsgrundlage. Aber den wird er dafür nie bekommen. Damit komme ich zu dem Schluss: Ja, es kann sein, dass ein Spieler dafür eine Chat Restriction bekommt, aber das ist zum einen (wie du selbst zugibst) unwahrscheinlich, zum anderen auch nicht so schlimm...","replies":[{"poster":"Mad Loony","date":"2018-04-22T06:24:03.551+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=000a,timestamp=2018-04-22T01:32:03.726+0000)\n> \n> Wenn es ein Szenario gäbe, in dem dein beschriebener Spieler dafür einen 14 Tages Bann bekommt, hättest du eine Diskussionsgrundlage. \n\nTausche halt irgend einen Begriff mit was härterem aus und du hast deinen Bann. Es haben auch schon Spieler wegen weit weniger einen 14 Tage Bann bekommen. Hättest du meinen Post durchgelesen wüsstest du, dass hier ein Zufallsfaktor eine große Rolle spielt.\n\nZusätzlich zur CR verliert man auch Ehre und es gibt keine Schlüssel mehr. Das ist sehr wohl als kleine Strafe gedacht. Man bekommt auch mindestens 10 Spiele CR soweit ich weis.","replies":[{"poster":"HyperionCH","date":"2018-04-22T08:22:21.503+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=000a0000,timestamp=2018-04-22T06:24:03.551+0000)\n>\n> Tausche halt irgend einen Begriff mit was härterem aus und du hast deinen Bann. Es haben auch schon Spieler wegen weit weniger einen 14 Tage Bann bekommen. Hättest du meinen Post durchgelesen wüsstest du, dass hier ein Zufallsfaktor eine große Rolle spielt.\n> \n> Zusätzlich zur CR verliert man auch Ehre und es gibt keine Schlüssel mehr. Das ist sehr wohl als kleine Strafe gedacht. Man bekommt auch mindestens 10 Spiele CR soweit ich weis.\n\nDu hast ja selbst bereits zugegeben, dass das Szenario nicht wirklich praxis-nah ist (dass ein Spieler sich massiv über seine Mates des letzten Games beschwert). Was also bringt es, dieses übertriebene und unrealistische Beispiel noch toxischer umzuschreiben, also noch übertriebener und unrealistischer zu gestalten?","replies":[{"poster":"Mad Loony","date":"2018-04-22T12:44:07.293+0000","up_votes":1,"down_votes":8,"body":"Mein Beispiel ist praxis-nah. Bitte behaupte nicht irgend welchen Blödsinn. Denk doch mal kurz nach. Es wäre total einfach zig solcher realitätsnahen Chatverläufe zu schreiben, die alle den Filter austricksen.\n\nManchmal habe ich echt das Gefühl die Leute in diesem Forum wollen ihr Gehirn gar nicht einschalten. Muss ich echt jeden noch so einfachen Gedankengang bis ins kleinste Detail beschreiben.\n\nWenn du meine Erläuterung auch nur ein ganz kleines bisschen objektiv betrachtest, wirst du schnell merken das meine Argumente ihre Richtigkeit haben.","replies":[{"poster":"Darkr3sQ","date":"2018-04-22T13:56:30.095+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=000a000000000000,timestamp=2018-04-22T12:44:07.293+0000)\n>\n> Mein Beispiel ist praxis-nah. Bitte behaupte nicht irgend welchen Blödsinn. Denk doch mal kurz nach. Es wäre total einfach zig solcher realitätsnahen Chatverläufe zu schreiben, die alle den Filter austricksen.\n> \n> Manchmal habe ich echt das Gefühl die Leute in diesem Forum wollen ihr Gehirn gar nicht einschalten. Muss ich echt jeden noch so einfachen Gedankengang bis ins kleinste Detail beschreiben.\n> \n> Wenn du meine Erläuterung auch nur ein ganz kleines bisschen objektiv betrachtest, wirst du schnell merken das meine Argumente ihre Richtigkeit haben.\n\nDu bezeichnest irgendwelche erfundenen Zeilen, Die Du selbst in Deinen Spielen nie erlebt hast, und für Die Du auch keine realen Beispiele hast, als praxisnah? Natürlich kannst Du Dir irgendwelche Zeilen überlegen, die in Deinen Augen den Chatfilter \"austricksen\", keine Frage. Aber diese fiktiven Dinge ohne jegliche Links zu passierten Fällen dahin zu spinnen, behaupten dass dies so zahlreich passiert, und das dann als realitätsnah zu bezeichnen ist schon wirklich realitätsfern.\n\nDas hat absolut nichts mit Gehirn nicht einschalten oder fehlende Objektivität zu tun. Du denkst Dir irgendwelche Zusammenhänge aufgrund Deiner erhaltenen Strafe aus, ohne dass Du Dich auch nur ansatzweise mit den zur Verfügung stehenden Informationen des IFS auseinandergesetzt hast, und stellst Deine Thesen zum IFS als Fakten dar, und konstruierst um diese Thesen dann Beispiele die Deine Problemstellung stützen. Du konstruierst Probleme, die keine Probleme sind.\nWie Dir bereits mehrfach gesagt wurde: Kein System ist unfehlbar, aber das IFS hat eine wirklich geringe Fehlerquote. Wenn ein Spieler einmal fälschlicherweise bestraft wurde, und sich dann mit RIOT in Verbindung setzt, wird diese Strafe auch wieder aufgehoben.","replies":[{"poster":"Mad Loony","date":"2018-04-22T14:01:58.924+0000","up_votes":1,"down_votes":6,"body":"Geh doch einfach in einen x-beliebigen Thread, wo sich wer über einen Bann beschwert und du hast dein reales Beispiel. Teile Chates oben habe ich ja aus Chatverläufen hier im Forum entnommen.\n\nMuss hier echt jeder noch so simplen Gedankengang bis ins kleinste Detail erklärt werden. Es ist doch offensichtlich, dass solche Fälle vorkommen.","replies":[{"poster":"Darkr3sQ","date":"2018-04-22T14:13:28.637+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=000a00000000000000000000,timestamp=2018-04-22T14:01:58.924+0000)\n>\n> Geh doch einfach in einen x-beliebigen Thread, wo sich wer über einen Bann beschwert und du hast dein reales Beispiel. Teile Chates oben habe ich ja aus Chatverläufen hier im Forum entnommen.\n> \n> Muss hier echt jeder noch so simplen Gedankengang bis ins kleinste Detail erklärt werden. Es ist doch offensichtlich, dass solche Fälle vorkommen.\n\nDann liefere doch einfach mal einen Chatverlauf, der nur die von Dir genannten Kriterien erfüllt ohne anderweitig toxisch zu sein. Also wirklich ein Fehlurteil.","replies":[{"poster":"Mad Loony","date":"2018-04-22T14:25:13.807+0000","up_votes":1,"down_votes":3,"body":"Es gab doch erst vor zwei Tagen einen solchen eindeutigen Fall.","replies":[{"poster":"Darkr3sQ","date":"2018-04-22T14:41:38.980+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=000a0000000000000000000000000000,timestamp=2018-04-22T14:25:13.807+0000)\n>\n> Es gab doch erst vor zwei Tagen einen solchen eindeutigen Fall.\n\nFalsch. Es gab vor einigen Tagen einen Fall, der möglicherweise ein Fehlurteil war. Es besteht aber auch die Möglichkeit, dass er einen falschen Chatlog zugeschickt bekommen hat, oder die Strafe für den Pre- und/oder Aftergame Chat bekommen hat.\nDies wurde aber auch genauso in diesem Thread gesagt. Der TE sollte sich an den Support wenden, der entweder die Strafe aufhebt, oder ihm den Grund für die Strafe nennt. Diesen Fall also als eindeutigen Beweis für Deine These, dass das System so oft falsch Urteilt herzunehmen, ist gelinde gesagt mehr als nur gewagt. Eindeutig ist bei diesem Fall nämlich nur eins: dass es für den dort gezeigten Chatlog allein keinen direkten 14 Tagesbann hätte geben sollen. Das heißt aber noch lange nicht, dass dieser gezeigte Chatlog tatsächlich der richtige Chatlog ist, den das System hätte mitschicken sollen, oder dass nicht im Pre- und/oder Aftergame-Chat extrem über die Stränge geschlagen wurde.\n**Und gesetzt der Fall ** es handelt sich tatsächlich um ein Fehlurteil, dann wird diese Strafe auch vom RIOT-Support wieder aufgehoben. Ist allerdings immer noch kein Beweis für Deine steile These, dass dieser Fall so häufig auftritt.","replies":[]}]}]}]}]}]}]},{"poster":"Darkr3sQ","date":"2018-04-22T08:45:09.533+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=000a0000,timestamp=2018-04-22T06:24:03.551+0000)\n>\n> Tausche halt irgend einen Begriff mit was härterem aus und du hast deinen Bann. Es haben auch schon Spieler wegen weit weniger einen 14 Tage Bann bekommen. Hättest du meinen Post durchgelesen wüsstest du, dass hier ein Zufallsfaktor eine große Rolle spielt.\n> \n> Zusätzlich zur CR verliert man auch Ehre und es gibt keine Schlüssel mehr. Das ist sehr wohl als kleine Strafe gedacht. Man bekommt auch mindestens 10 Spiele CR soweit ich weis.\n\nDiese Spieler haben sich aber auch konstant daneben benommen, sodass sie eben die Strafstufenleiter nach oben geklettert sind. \nHat ebenfalls nichts mit Zufall zu tun, sondern schlicht und ergreifend mit Lernresistenz.\nWarum hängst Du Dich in Deinen Threads und Posts immer so sehr an dem Begriff Zufall auf? Zufall hat nicht das Geringste mit dem Strafsystem zu tun.\nZufall wäre, wenn jeden Tag RIOT hingeht, und eine zufällige Anzahl an zufälligen Spielern eine zufällige Strafe ohne jedweden Grund aufbrummt. Das ist aber - wenn Du Dich informieren würdest - nicht der Fall. Abgesehen von der sehr geringen Fehlerquote hat ansonsten jede Strafe ihre Berechtigung. Auch ein Perma ist dann gerechtfertigt, wenn der Spieler für nicht so harten Flame bereits 2 mal die CR und den 14 Tagesbann durchlaufen hat.\nDu solltest also langsam mal davon ablassen, immer wieder zu Behaupten, das IFS wäre zufällig.","replies":[{"poster":"clair de lune289","date":"2018-04-22T12:52:14.775+0000","up_votes":3,"down_votes":0,"body":"selbst die falschen Strafen haben immer einen logischen Grund der ziemlich eindeutig zu erkennen ist.\nz.B. gabs Fällen in denen zitiert wurde (was nicht grade sehr klug ist) oder eben Spieler sich selbst geflamet haben.","replies":[]}]}]}]},{"poster":"Noxempire","date":"2018-04-22T00:07:41.055+0000","up_votes":4,"down_votes":0,"body":"Natürlich macht Riot auch Fehler. \nIch bin aber nicht so überheblich als Einzelperson anzunehmen alle Faktoren zu kennen, um diese Fehler einschätzen zu können. Weder beim Balancing, noch beim Bestrafungssystem.\nWas genau qualifiziert dich dazu, ein System zu kritisieren, dass nach Jahren von Datenauswertung und konstanten Überarbeitungen quasi perfektioniert wurde.\n\nIch möchte auch mal anmerken, dass du als \"Vorbestrafter\", relativ befangen in dieser Situation bist und vermutlich nicht zugeben wirst, dass du unrecht hast oder zumindest maßlos übertreibst. Komischerweise sind es nämlich immer nur die Bestraften, die das Bansystem kritisieren und nicht die Anderen.\n\nFakt ist: Flamer werden gebannt und das nicht random, sondern dann, wenn sie vom System durch Reports erfasst werden. Wenn ich nicht flame oder gar nicht erst auf Trolls etc. eingehe, werde ich zu 100% nicht wegen flamen gebannt oder gar erst reported werden. \n\nDas ist einfach unmöglich. \n\nWas spricht denn dagegen die Leute einfach sofort zu muten und einfach mal ruhig zu bleiben? Es muss niemanden ein \"noob\" rausrutschen, wenn man persönlich gefestigt ist und sein Temperament unter Kontrolle hat. Wie L.Xenon schon sagte. Das ist einfach nur Selbstbeherschung im Internet. Es ist Kindergartenlogik zu behaupten, dass der Kontext da großartig relevant wäre.\n\nFür so Kleinigkeiten, wie diesen Chatlog, gibt es noch den Support.\n\nEin zuverlässiges System für Sarkasmus wird es niemals geben, und das ist kein \"Fehler von Riot\", dass ist einfach simple Logik. Wenn du dich mal näher mit dem Tribunal und seinen wirklich MARKANTEN Problemen auseinandersetzt, wird dir auffallen, warum das jetzige System deutlich besser ist und selbst Menschen diesen Sarkasmus einfach nicht richtig einschätzen können.","replies":[{"poster":"Mad Loony","date":"2018-04-22T06:26:45.722+0000","up_votes":1,"down_votes":1,"body":"Welche qualifikation bräuchte ich denn, damit du mir erlaubst das System zu kritisieren?","replies":[{"poster":"HyperionCH","date":"2018-04-22T08:19:57.450+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=00090000,timestamp=2018-04-22T06:26:45.722+0000)\n>\n> Welche qualifikation bräuchte ich denn, damit du mir erlaubst das System zu kritisieren?\n\nAus meiner Sicht:\n\n- mehr Wissen, wie das heutige System funktioniert (z.B. hast du von Wortfilter gesprochen, was so nicht stimmt)\n- am besten auch Erfahrung als Tribun im alten System (jeder - der nicht toxisch ist - durfte Tribun werden)\n- Erfahrung im Spielerverhalten-Forum (z.B. habe ich sicherlich hunderte chatlogs von bestraften Spielern durchgelesen)\n- Konkrete Beispiele aufzeigen, die tatsächlich passierten (und nicht fiktive \"hätte, wäre, wenn\" Beispiele)\n\nMan verliert einfach viel Glaubwürdigkeit, wenn man Behauptungen aufstellt, die so nicht stimmen. Und wie gesagt ist dein Beispiel so an den Haaren beigezogen (hast du selbst zu gegeben, dass du noch nie ein Game hattest, bei dem ein Mate massiv über seine letzten Mates herzog), dass es auch nicht glaubwürdig wird.\n\nKlar, du hast geschrieben, dass du provozieren wolltest, damit du Aufmerksamkeit bekommst.\nDies tut die Bild-Zeitung auch. Aber die FAZ, welche mehr auf Fakten als auf Provokation setzt, ist deshalb trotzdem glaubwürdiger. \nWenn du die Community ansprechen willst, dann OK: da holst du mit der \"Bild-Strategie\" mehr raus. Wenn du aber möchtest, dass Riot Games liest und Verbesserungsvorschläge annimmt, dann solltest du dich eher an Fakten halten.","replies":[{"poster":"Mad Loony","date":"2018-04-22T12:51:06.031+0000","up_votes":1,"down_votes":4,"body":"Jeder darf seine Meinung kundtun und bestehendes kritisieren! Ich habe sehr gute Argumente, auch wenn viele das nicht so sehen wollen.","replies":[{"poster":"Homunculi","date":"2018-04-22T13:55:54.371+0000","up_votes":3,"down_votes":0,"body":">Ich habe sehr gute Argumente\n\n\nLeider nein. \n\nUnd wenn doch habe ich sie noch nicht gefunden.","replies":[]}]}]},{"poster":"Darkr3sQ","date":"2018-04-22T08:33:11.605+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=00090000,timestamp=2018-04-22T06:26:45.722+0000)\n>\n> Welche qualifikation bräuchte ich denn, damit du mir erlaubst das System zu kritisieren?\n\nMit erlauben hat das recht wenig zu tun. Du kannst gerne alles und jeden zu jeder Zeit kritisieren.\nUm aber ernsthaft etwas zu kritisieren, und dabei auch ernst genommen zu werden, solltest Du zumindest vorher Dich einmal über das System informieren. Einen Link dazu hast Du ja bereits bekommen, wo sämtliche Quellen von RIOT verlinkt sind. Das wäre zumindest mal ein Anfang.","replies":[]}]}]},{"poster":"manial fly","date":"2018-04-21T21:27:40.172+0000","up_votes":3,"down_votes":0,"body":"Das einzig undurchsichtige an dem System ist wohl eher das es viel zu lange dauert bis ganz offensichtlich falsches Verhalten im Spiel bestraft wird.","replies":[{"poster":"Mad Loony","date":"2018-04-22T06:28:43.357+0000","up_votes":1,"down_votes":5,"body":"Es werden halt oft unschuldige Spieler statt harten Flamern gebannt.","replies":[{"poster":"Lotuskobra","date":"2018-04-22T06:38:56.110+0000","up_votes":2,"down_votes":0,"body":"Oft = Unter einem Promille der gebannten Spieler?\n\nHast du für deine Behauptungen (obwohl du selbst zugibst, dass sie übersteigert sind) irgendwelche Beweise? Beispielfälle von Leuten, die es so getroffen hat und die einen großen Stock an Spielern wiederspiegeln?\n\nDu kannst so viele polemische Behauptungen in den Raum stellen wie du möchtest, keine davon verbessert deine Aussage, im Gegenteil: Du wirkst mit jedem Mal, in jedem Thread in dem du dieses Thema ansprichst unseriöser, unbelehrbarer und schlichtweg nur reißerisch als informativ.\n\nDu versuchst einen Sachverhalt zu überspitzen, der schlichtweg nicht überspitzt werden muss. Ein simples Rechenbeispiel:\n\nSagen wir, auf dem EUW Server spielen 10 Millionen Spieler, angesichts der 100 Millionen ca. aktiven Spieler kommt das ganz gut hin. Nehmen wir an, ca. 1% der Spieler bekommen einen Bann, auf Grund von Flame.\n\n1% von 10.000.000 = 100.000 –> 100.000 Spieler wegen Flame gebannt (die Zahl ist zu hoch, aber das ist nicht so wichtig)\n\nVon diesen 100.000 gibt es 0,1% (1 Promille), die diesen Bann zu unrecht erhalten haben. –> Die tatsächliche Fehlerquote ist nochmals geringer.\n\n0,1% von 100.000 = 100\n\nEs gibt also auf dem EUW Server mit 10 Millionen Spielern, maximal 100 Menschen, deren Bann zu Unrecht ausgesprochen wurde...\n\nUnd das ist jetzt oft?\n\nEdit:\n\nGenaueres kannst du dazu hier nachlesen:\n\nhttp://en.volu-eu.org/pbkb_general_user_view.php?art=7\n\nDie Seite der wurde dir von den Bunten ja schon empfohlen, vielleicht solltest du sie dir einfach mal anschauen. Zudem sind dort Original-PDF Dokumente von Riot als Quellen angeheftet, in denen sie zu verschiedenen Punkten Stellung nehmen und vieles von dem, was du als \"undurchsichtig\" empfindest, aufklären.\n\nSchau doch einfach mal rein.","replies":[{"poster":"Mad Loony","date":"2018-04-22T16:35:57.862+0000","up_votes":1,"down_votes":2,"body":"Ich habs mir den Link angeschaut. Jetzt bin ich etwas enttäuscht. Der Artikel widerspricht sich teilweise selber und die Quellenangaben sind Links zu Redditposts. Da gibt es gibt es so subjektive Aussagen wie: \"wir haben empfunden, das die Fehlerquote 0,1% ist\". Ohne Belege, ohne Ensicht in die Unterlagen bzw. in die Statistik. Dafür mit mehreren Verweisen, wie toll das doch ist. \nDas ist schlicht und ergreifend von Riot schöngeredet.\n\nEdit: Aber danke für den Link. Der zeigt ziemlich gut das im System etwas falsch läuft.","replies":[{"poster":"Lotuskobra","date":"2018-04-22T17:16:21.140+0000","up_votes":4,"down_votes":0,"body":"Ich zitiere mal aus dem reddit-Thread zu dem Thema:\n\n> We generally hold our systems to a 0.1% standard, which means that a system needs to have less than 0.1% false positives for us to release it to players.\n\n> The 0.1% standard is our bare minimum to launch a feature, but usually our systems are more accurate.\n> For example, in our last wave of manual reviews, we had 1 false positive in every 6000 reviews.\n\nIn dem gesamten Artikel steht nichts von \"wir haben empfunden\". Was soll Riot denn deiner Meinung nach tun? Sollen sie den Artikel mit den Testergebnissen der letzten 10 Zufallstest veröffentlichen – und damit jegliche Datenschutzrichtlinien verletzen, indem sie die Daten und Chatverläufe der jeweiligen Spieler veröffentlichen?\n\nSie müssten von jedem überprüftem Spieler eine Genehmigung einholen, um diesen Bereicht öffentlich posten zu können, nur um potentiellen Flamern noch mehr Einblick zu geben, was genau und warum betraft wird. Du bist dir schlichtweg nicht der Konsequenzen bewusst, was bei einem vollkommen offenem System passieren würde:\n\nRiots Erhebungen werden detailierte Bewertungen enthalten, ob das aufgeschriebene als Flame gilt oder nicht. Um eine Fehlerquote von 1:6000 zu erreichen, müssen sie also auch mindestens 6000 verschiedene Szenarien untersuchen. Es werden also 6000! Fälle für alle aufgedeckt, warum und was daran strafbar ist.\n\nSuper Sache, dann haben anschließend alle, die unter mangelnder Impulskontrolle leiden, feste Beweise in der Hand, was sie besser nicht schreiben sollten, um aufzufallen.\n\nDu schreibst in deinem Post selbst, dass dir viele Dinge zu sehr ins Detail gehen (Rechnungen, Systemangaben, etc.) aber möchtest selber so detailierte Informationen wie möglich haben, ja warum eigentlich?\n\nDie Testberichte werden mehrere hundert Seiten lang sein und X Beispiele enthalten, die du alle einzeln durcharbeiten musst.\n\n> Edit: Aber danke für den Link. Der zeigt ziemlich gut das im System etwas falsch läuft.\n\nAhja, wieso ist Reddit dann nicht voll von Leuten, die aufgrund von falsch vergebenen Strafen auf die Barrikaden steigen und das System anprangern? Du bist der einzige, den ich bisher kennenlernen dürfte, der der Meinung ist, dass die Fehlerquote des Systems zu hoch ist.\n\nUnd noch dazu bist du nicht in der Lage auch nur ansatzweise Belege, Beispiele oder Rechnungen anzubringen, die dein gesagtes ansatzweise unterstützen.\n\nIch war die ganze Zeit sehr zurückhaltend und möchte dich auch nicht mit einem negativen Gefühl in die neue Woche lassen, ABER, mich hast du mit diesem Satz in der Diskussion ehrlich gesagt verloren:\n\n> Es ist dir vielleicht noch nicht aufgefallen, aber wenn ich etwas schreibe dann stimmt es auch!\n\nZu behaupten, dass das was man sagt richtig ist, weil man es schließlich selbst sagt, ist so ziemlich das dreisteste Argument, das ich bisher so lesen dürfte und strotzt vor absoluter Selbstüberschätzung, Überheblichkeit und Unbelehrbarkeit; vielleicht hast du es auch einfach unglücklich ausgedrückt – was ich persönlich sehr hoffe – aber ich bin erst mal raus aus der Diskussion.\n\nJemand, der selbst allen anderen Argumenten aus dem Weg geht oder sie als emotionalen Schwachsinn abledert, obwohl er selbst nicht in der Lage ist seine Argumente auf mehr als nur \"ich schreibe es auf, weil ich Recht habe\"-Idiologien aufzubauen, hat, so unfair du das jetzt vielleicht finden wirst, keine weitere Unterhaltung nötig.\n\nIch empfehle mich und wünsche frohes Schaffen!","replies":[]}]},{"poster":"Mad Loony","date":"2018-04-22T13:04:48.579+0000","up_votes":1,"down_votes":4,"body":"Tut mir echt Leid, aber wenn du siehst wie lächerlich sich so mancher über meinen Thread aufregt, wirst du verstehen wieso ich deine Rechnung jetzt auch nicht ganz ernst nehmen kann. Fundierte Argumente wären halt schön, wenn man meinen Thread auch auf diese Weise in misskredit bringen will.","replies":[{"poster":"Darkr3sQ","date":"2018-04-22T14:05:54.834+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=0007000000000001,timestamp=2018-04-22T13:04:48.579+0000)\n>\n> Tut mir echt Leid, aber wenn du siehst wie lächerlich sich so mancher über meinen Thread aufregt, wirst du verstehen wieso ich deine Rechnung jetzt auch nicht ganz ernst nehmen kann. Fundierte Argumente wären halt schön, wenn man meinen Thread auch auf diese Weise in misskredit bringen will.\n\nGanz ehrlich: Um Deinen Thread in Misskredit zu bringen, brauchst Du keinen anderen für. Dadurch, dass Du alles wirklich so überspitzt und reißerisch darstellst, sorgst Du ganz alleine dafür, dass Dein Thread nicht ernst genommen wird.\nDu redest von zahlreichen Fehlurteilen, und erfindest irgendwelche abwegigen Beispiele, schaffst es aber nicht für Deine zahlreichen Fehlurteile irgendwelche Belege zu liefern.\nDie Personen, die Dir widersprechen, liefern jedoch Links, bei denen Du die Informationen zum IFS bekommst, deren Existenz Du anzweifelst.\nUnd der Knaller ist, dass Du auf ein durchaus plausibles Rechenbeispiel welches zeigt, dass - anders als von Dir suggeriert - eben nicht so viele Fehlurteile gesprochen werden, nicht eingehst, weil andere Dir aufzeigen wollen, dass Du mit Deinen abstrusen und völlig überspitzten Thesen ohne jegliche Belege falsch liegst, und Probleme erfindest, die in der von Dir genannten Ausprägung nicht existent sind.\nGehst Du vielleicht deswegen nicht auf das Rechenbeispiel ein, weil Du dann zugeben müsstest, dass die von Dir beschriebenen Fehlurteile deutlich geringer ausfallen, als von Dir angenommen?\nKeiner versucht Deinen Thread in Misskredit zu bringen. Wir wollen Dir lediglich zeigen, dass Du Probleme siehst, die in dem von Dir genannten Ausmaß nicht anzutreffen sind. Wir bringen Dir also fundierte Argumente, die Dein Konstrukt zum Einsturz bringen, da von Dir keinerlei fundierte Argumente kommen. Und wenn Dir so ein Argument nicht in Deinen Kram passt, nimmst Du es nicht ernst, weil Du von anderen Leuten Gegenwind bekommst.","replies":[{"poster":"Mad Loony","date":"2018-04-22T14:19:50.562+0000","up_votes":1,"down_votes":3,"body":"Der Großteil hier postet irgendwelchen emotionalen Unsinn. Keine Ahnung wieso sich so viele von meinen Post persönlich angegriffen fühlen. Das kann ich schwer nachvollziehen.\n\nEinige User hier haben in der Tat fundierte Argumente, was ich auch zu schätzen weis. \n\nDie meisten versuchen den Thread aber einfach nur lächerlich zu machen. Dabei vergessen sie halt auch, wie leicht es sich gegen sowas zu diskuttieren lässt.","replies":[{"poster":"Darkr3sQ","date":"2018-04-22T14:37:00.190+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=000700000000000100000000,timestamp=2018-04-22T14:19:50.562+0000)\n>\n> Der Großteil hier postet irgendwelchen emotionalen Unsinn. Keine Ahnung wieso sich so viele von meinen Post persönlich angegriffen fühlen. Das kann ich schwer nachvollziehen.\n> \n> Einige User hier haben in der Tat fundierte Argumente, was ich auch zu schätzen weis. \n> \n> Die meisten versuchen den Thread aber einfach nur lächerlich zu machen. Dabei vergessen sie halt auch, wie leicht es sich gegen sowas zu diskuttieren lässt.\n\nDann musst Du mir bitte erklären, weshalb Du auf ein fundiertes Argument nicht eingehst? Du merkst doch hoffentlich selbst, dass es ziemlich blöd klingt wenn Du ein fundiertes Argument mit der Begründung beiseite wischst \"Du hast zwar schön gerechnet, aber andere sind so gemein zu mir, und deswegen musst Du verstehen, dass ich auf Deine Rechnung nicht eingehe\". Das lässt doch eigentlich nur die Interpretation zu, dass Du auf dieses Argument nicht eingehen willst, weil es Dein gesamtes Konstrukt zerstört.\nLeute, die etwas lächerlich machen wollen, hast Du überall. Wenn Du vernünftig diskutieren wollen würdest, würdest Du diese Posts ignorieren, und dich mit den vernünftigen Argumenten auseinandersetzen. Aber noch nicht einmal das machst Du.\nDu stellst hier eine gewagte These auf, zu der Du keine Beispiele lieferst, bei der man merkt, dass Du Dich nicht richtig mit dem System auseinandergesetzt hast, und sobald Du Gegenwind bekommst bist Du der Meinung, dass alle Deinen Thread lächerlich machen wollen. Diese Einstellung sorgt nicht gerade dafür, dass Du ernst genommen wirst.","replies":[]}]}]}]}]},{"poster":"manial fly","date":"2018-04-22T07:48:37.786+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=00070000,timestamp=2018-04-22T06:28:43.357+0000)\n>\n> Es werden halt oft unschuldige Spieler statt harten Flamern gebannt.\n\nSo ein Schwachsinn. Wenn ich mich hier durch die täglichen Entbannungsanträge lese, wird in 90% davon rumgeheult das man überhaupt nicht toxisch war und ein anderer Spieler viel schlimmer war und man sich ja nur gewehrt habe.\nDann liest man den Chatlog und da stehen da so Sachen wie: report xy for feed; yx noob; pls uninstall; you are bad; usw. Das ist genauso Flame wie \"kys\", der einzige Unterschied ist das man bei letzterem direkt nen 14-Tage Bann bekommt und es bei den anderen Bespielen ein paar Spiele dauert bis man überhaupt bestraft wird.\n\nDes Weiteren wird in diesen Enbannungsanträgen auch gern behauptet das der andere der ja so viel schlimmer war nicht bestraft wurde. Hier stellt sich mir die Frage, woher will man das wissen? Riot teilt ja niemandem mehr mit wenn jemand bestraft wurde. \nIch gebe dir in dem Punkt recht das ich selbst oft das gefühl habe das Riot nicht direkt durchgreift und Leute trotz extremen Fehlverhalten nicht sofort bestraft werden. Aber nur weil der ein oder andere harte Flamer nicht direkt nen 14 Tage Bann bekommt, kann man ja nicht allen etwas \"harmloseren\" Flamern nen Freifahrtschein geben.\nIm RL sagt ja auch keiner: \"Och du hast mit jemandem nem Bank ausgeraubt, aber wir bestrafen dich mal nicht weil dein Komplize dabei wen umgbracht hat und die nicht.\" Du hast trotzdem eine Straftat begangen, auch wenn sie nicht so schlimm wie die eines anderen war.\n\nSo und bevor du jetzt weiter darüber diskutiertst, nenn mir vorher ein paar Bespiele in denen Spieler zu unrecht gebannt wurden. Dürfte ja kein Problem sein, kommt laut dir ja oft vor.","replies":[]}]}]},{"poster":"Haudruppmoor","date":"2018-04-23T09:14:30.298+0000","up_votes":2,"down_votes":0,"body":">Seit es lol gibt kommt es zu Beschwerden über ungerechtfertigte Strafen.\n\nDieser erste Satz beinhaltet eigentlich 3 Aussagen. Über die man sicherlich diskutieren kann. Als Grundlage dient dafür dieses Forum, denn es als  Quelle zu benutzen ist für alle verfügbar und nachvollziehbar. \n\nDein nachfolgendes Beispiel ist komplett frei erfunden, basiert nur auf Deine persönliche Annahme und da Du keine nachvollziehbaren Fallbeispiele angibst (z.B. in Form von Links hier aus dem Forum), wo es tatsächlich so gewesen ist/war , ist es somit komplett irrelevant/obsolete/ignorierbar . Wenn Du einfach nur ne Geschichte schreiben wolltest, dann wärst Du damit bei Wattpad besser aufgehoben.\n\nDarum erstmal die Fakten :\n\n1 + 2 :\n>Seit es lol gibt kommt es zu ~~Beschwerden über~~ ungerechtfertigte(n) Strafen.\n\nRichtig, ein bis zwei Beispiele gibt es hier im Forum . Die Leute haben sich auch hier beschwert, womit\n\n>Seit es lol gibt kommt es zu Beschwerden über ungerechtfertigte Strafen.\n\nebenfalls stimmt. Die Strafen wurden auch zurückgenommen . Betrachtet man die Menge an verhängten Strafen, dann repräsentieren die wirklich ungerechtfertigten einen gewissen Prozentsatz, die der Fehlertoleranz des System's entsprechen. Ich will damit sagen, daß der überwiegende Teil gerechtfertigt ist. Wenn man mal das letzte halbe Jahr betrachtet, komm ich, wenn ich die Suchergebnisse aus dem Forum werte, auf 2 ungerechtfertigten (wenn noch jemand Beispiele hat, dann her damit)\n\n\nhttps://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/00p21Apu-14-tage-ban-aufgehoben\nund\nhttps://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/FGlv1WEm-permabanned-nach-einem-jahr-entbannt-da-bann-ein-fehler-war\n\ngegenüber der Liste an gerechtfertigten :\n\nhttps://boards.euw.leagueoflegends.com/de/search?query=ungerechtfertigt&application_id=KYnfKGf0&created_from=now-1y&content_type=discussion\n\nWas uns zur 3. Aussage bringt :\n\n>Seit es lol gibt kommt es zu Beschwerden über Strafen.\n\nUnd das ist sowas von wahr ! Da müssen wir nicht drüber diskutieren, das Suchergebnis spricht für sich. Jeder der gerechtfertigt gebannt wurde und hier aufschlägt beschwert sich. Manchmal sehr plump, aggressiv und manchmal schon sehr kreativ, aber eben deutlich mit verzerrter Wahrnehmung der Realität in Mißachtung der Regeln und der Bedingungen die derjenige akzeptiert hat.\n\nAlso was ich sagen bzw. fragen wollte, worüber genau wolltest Du jetzt diskutieren ? Oder wolltest Du Dich auch über einen gerechtfertigten Ban beschweren ? Mir erschließt sich jetzt nicht, wozu dieser Thread dienen soll ? Kannst Du das mal erklären ?\n\nmfg\nMB","replies":[{"poster":"Darkr3sQ","date":"2018-04-23T09:24:36.028+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Haudruppmoor,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=000b,timestamp=2018-04-23T09:14:30.298+0000)\n>\n> Dieser erste Satz beinhaltet eigentlich 3 Aussagen. Über die man sicherlich diskutieren kann. Als Grundlage dient dafür dieses Forum, denn es als  Quelle zu benutzen ist für alle verfügbar und nachvollziehbar. \n> \n> Dein nachfolgendes Beispiel ist komplett frei erfunden, basiert nur auf Deine persönliche Annahme und da Du keine nachvollziehbaren Fallbeispiele angibst (z.B. in Form von Links hier aus dem Forum), wo es tatsächlich so gewesen ist/war , ist es somit komplett irrelevant/obsolete/ignorierbar . Wenn Du einfach nur ne Geschichte schreiben wolltest, dann wärst Du damit bei Wattpad besser aufgehoben.\n> \n> Darum erstmal die Fakten :\n> \n> 1 + 2 :\n> \n> Richtig, ein bis zwei Beispiele gibt es hier im Forum . Die Leute haben sich auch hier beschwert, womit\n> \n> ebenfalls stimmt. Die Strafen wurden auch zurückgenommen . Betrachtet man die Menge an verhängten Strafen, dann repräsentieren die wirklich ungerechtfertigten einen gewissen Prozentsatz, die der Fehlertoleranz des System&#x27;s entsprechen. Ich will damit sagen, daß der überwiegende Teil gerechtfertigt ist. Wenn man mal das letzte halbe Jahr betrachtet, komm ich, wenn ich die Suchergebnisse aus dem Forum werte, auf 2 ungerechtfertigten (wenn noch jemand Beispiele hat, dann her damit)\n> \n> \n> https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/00p21Apu-14-tage-ban-aufgehoben\n> und\n> https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/FGlv1WEm-permabanned-nach-einem-jahr-entbannt-da-bann-ein-fehler-war\n> \n> gegenüber der Liste an gerechtfertigten :\n> \n> https://boards.euw.leagueoflegends.com/de/search?query=ungerechtfertigt&amp;application_id=KYnfKGf0&amp;created_from=now-1y&amp;content_type=discussion\n> \n> Was uns zur 3. Aussage bringt :\n> \n> Und das ist sowas von wahr ! Da müssen wir nicht drüber diskutieren, das Suchergebnis spricht für sich. Jeder der gerechtfertigt gebannt wurde und hier aufschlägt beschwert sich. Manchmal sehr plump, aggressiv und manchmal schon sehr kreativ, aber eben deutlich mit verzerrter Wahrnehmung der Realität in Mißachtung der Regeln und der Bedingungen die derjenige akzeptiert hat.\n> \n> Also was ich sagen bzw. fragen wollte, worüber genau wolltest Du jetzt diskutieren ? Oder wolltest Du Dich auch über einen gerechtfertigten Ban beschweren ? Mir erschließt sich jetzt nicht, wozu dieser Thread dienen soll ? Kannst Du das mal erklären ?\n> \n> mfg\n> MB\n\nWenn ich das richtig verfolgt habe - weil der TE wird sich wahrscheinlich wieder auf seinen Thread berufen, dass man dort doch bitte nachlesen soll - hat der TE eine [gerechtfertigte CR](https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/GBOwhsnF-far-sowas-bekommt-man-ne-chatsperre) erhalten. Nach eigenen Angaben hat ihn das dazu gebracht, über das Strafsystem nachzudenken, und kam so auf die Idee, dass das Strafsystem absolut zufällig ist, und so Fehlerhaft dass massenhaft unschuldige Spieler zu unrecht eine Strafe erhalten. Darüber hinaus kritisiert er das Strafsystem als absolut undurchsichtig und dass es dazu ja keinerlei Informationen gäbe, ohne vorher mal ein wenig diesbezüglich recherchiert zu haben, da er sonst die Informationen dazu gefunden hätte.","replies":[{"poster":"Haudruppmoor","date":"2018-04-23T09:33:53.580+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ZcDQ0Dt6KV,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=000b0000,timestamp=2018-04-23T09:24:36.028+0000)\n>\n>https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/GBOwhsnF-far-sowas-bekommt-man-ne-chatsperre\n\nThx, für den Hinweis . {{sticker:sg-ahri-2}} \n\n\nVerdammt, die berechtigten Chatsperren hab ich gar nicht berücksichtigt ^^ . Gehört ja auch zu Strafen . \n\nBtw. wurde denn da mal ne ungerechtfertigte ausgesprochen und dann vlcht. sogar noch zurückgenommen !? Wär ja auch mal was hypothetisches ... \n\nLanger Rede kurzer Sinn : Also im Endeffekt ist das auch nur wieder ein Mecker-Mimi-Beschwerde-Thread . \n\nIn der Programmierung oder bei bestimmten Betriebssystemen (FreeBSD) gibt es das sogenannte **dev0** . Das ist ein Gerät bzw. eine Datei, in die man Daten reinschreiben kann, welche dann weg sind. Quasi ein Nulldevice, ein Papierkorb mit nem Loch in die Unendlichkeit. Gibt es sowas nicht auch für Foren ?\n\nmfg\nMB","replies":[{"poster":"Darkr3sQ","date":"2018-04-23T09:43:46.252+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Haudruppmoor,realm=EUW,application-id=KYnfKGf0,discussion-id=vBFvqT33,comment-id=000b00000000,timestamp=2018-04-23T09:33:53.580+0000)\n>\n> Thx, für den Hinweis . {{sticker:sg-ahri-2}} \n> \n> \n> Verdammt, die berechtigten Chatsperren hab ich gar nicht berücksichtigt ^^ . Gehört ja auch zu Strafen . \n> \n> Btw. wurde denn da mal ne ungerechtfertigte ausgesprochen und dann vlcht. sogar noch zurückgenommen !? Wär ja auch mal was hypothetisches ... \n> \n> Langer Rede kurzer Sinn : Also im Endeffekt ist das auch nur wieder ein Mecker-Mimi-Beschwerde-Thread . \n> \n> In der Programmierung oder bei bestimmten Betriebssystemen (FreeBSD) gibt es das sogenannte **dev0** . Das ist ein Gerät bzw. eine Datei, in die man Daten reinschreiben kann, welche dann weg sind. Quasi ein Nulldevice, ein Papierkorb mit nem Loch in die Unendlichkeit. Gibt es sowas nicht auch für Foren ?\n> \n> mfg\n> MB\n\nZumindest erinnere ich mich an keine Chatsperre in der letzten Zeit, die ein Fehlurteil war.Ich kann mich hier aber auch irren. Ich glaube aber im NA-Forum war jemand, der sich selbst im Chat beleidigt hatte. Weiß allerdings nicht, ob hier lediglich eine Chatsperre ausgesprochen wurde. Auf jeden Fall wurde hier ebenfalls die Strafe wieder zurück genommen.\n\ndev0 wäre hier durchaus praktisch, aber ich fürchte dass es so etwas in automatisierter Form - spart enorme Zeit bei einer Datensicherung ;) - nicht gibt.","replies":[{"poster":"Mad Loony","date":"2018-04-24T22:47:25.773+0000","up_votes":1,"down_votes":3,"body":"https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/WvELfkwg-14-tage-far-nichts\n\nHier hast du einen ungerechtfertigten Bann.","replies":[]}]}]}]}]}]}