{"poster":"I like Tortles","date":"2016-12-11T18:38:40.588+0000","title":"Reconecting to league browser","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"After entering a game the reconnect icon popped up and as told I clicked cancel but when I moved to reconnect to the right one it moved out of my screen and even though it was still their I couldn't see it ,and after trying to restart my computer the browser for league won't pop up and after using the hrt it still won't work.\n\nCan I have some help on this?\n\n","replies":[{"poster":"I like Tortles","date":"2016-12-12T01:43:28.494+0000","up_votes":1,"down_votes":0,"body":"Every time I want to play I hve to remove league files then download them again and sometimes it doesn't work right","replies":[{"poster":"Targons Blade","date":"2016-12-12T04:39:58.363+0000","up_votes":1,"down_votes":0,"body":"Are you installing to the default locale? It's **C:\\Riot Games\\League of Legends**\n\nAlso, it sounds like a lot of your issues are tied to an *unstable connection*, so I'd really like you to work through our [**connection guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to ensure all your local network settings are configured properly for League.\n\nLet me know if this caused any change.","replies":[{"poster":"I like Tortles","date":"2016-12-13T23:56:08.996+0000","up_votes":2,"down_votes":0,"body":"Targons Blade I apreciate your help and because of that help I was able to solve this problem thank you very much","replies":[]},{"poster":"I like Tortles","date":"2016-12-13T01:31:54.520+0000","up_votes":1,"down_votes":0,"body":"I am sorry I have seen the connection guide used the hrt and I have re-tried installing it and un stalling it again but it hasn't worked also whenever I try and get it updated it always says there is an error and 0 files scanned after a while\n","replies":[{"poster":"Targons Blade","date":"2016-12-13T21:45:53.831+0000","up_votes":1,"down_votes":0,"body":"Did you clear off some space on your hard drive? Not having enough space to patch can definitely cause big issues.","replies":[{"poster":"I like Tortles","date":"2016-12-13T22:38:47.670+0000","up_votes":1,"down_votes":0,"body":"Yes but that doesn't seem to be the case","replies":[{"poster":"Targons Blade","date":"2016-12-13T23:12:14.202+0000","up_votes":1,"down_votes":0,"body":"How much free space is on your hard drive before you start patching?","replies":[{"poster":"I like Tortles","date":"2016-12-13T23:37:07.087+0000","up_votes":1,"down_votes":0,"body":"559 mg of space \n\nI will free some up","replies":[]}]}]}]}]},{"poster":"I like Tortles","date":"2016-12-12T23:36:18.418+0000","up_votes":1,"down_votes":0,"body":"I have tried this and it is installed into the locale but what is weird is that I have run out of memory so that could be it but I tried the hrt and it didn't seem to help because I recently installed something to help my connection and I don't think anything like that has occurred since then\n\nI will try to get rid of some of my files I don't need\n","replies":[]},{"poster":"I like Tortles","date":"2016-12-12T22:59:42.275+0000","up_votes":1,"down_votes":0,"body":"I will try this\n  \nThank you","replies":[]}]}]},{"poster":"I like Tortles","date":"2016-12-11T18:57:55.075+0000","up_votes":1,"down_votes":0,"body":"I have recently tried to reinstall it 3 times and each time my internet connection just for some reason went away ,and it keeps on telling me to reinstall the alpha client which I did in the hrt and the site for league","replies":[]}]}