{"poster":"Stiv1234","date":"2015-05-30T08:06:35.813+0000","title":"Surrender@10 in Normals bei Leavern?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"Hey Community,\r\n\r\nmir ist schon &ouml;fter der Gedanke gekommen, dass man in Normals eigentlich einf&uuml;hren k&ouml;nnte, schon ab Minute 10 aufgeben zu k&ouml;nnen, **falls** man einen Leaver im Team hat. Das w&uuml;rde auch die F&auml;lle einschlie&szlig;en, bei denen jemand technische Probleme hat und nicht zum Spiel connecten kann. \r\n\r\nDadurch m&uuml;sste man nicht immer so lange warten, da doch die Meisten das Game noch in die L&auml;nge ziehen, anstatt kurz und b&uuml;ndig Mid durchzupushen. Mir jedenfalls w&uuml;rde diese Option gut gefallen. Schreibt einfach eure Meinungen drunter oder stimmt ab!\r\n\r\nLG\r\nStiv","replies":[{"poster":"Maë","date":"2015-05-30T10:19:09.077+0000","up_votes":1,"down_votes":0,"body":"Ich bezweifle, dass es jemals eine derartige Funktion ins Spiel eingebaut wird. Der Grund hierfuer liegt einfach dabei, dass man nich' immer feststellen kann, ob jemand das Spiel aus Wut verlassen hat oder es bei dessen Internetverbindung liegt. Er koennte ja versuchen wieder beizutreten - und ich mag stark glauben, dir is' das auch schon einmal passiert. Ist natuerlich nur meine Meinung und meine Sicht der Dinge. (:","replies":[{"poster":"Stiv1234","date":"2015-05-30T14:47:21.060+0000","up_votes":1,"down_votes":0,"body":"Guter Punkt. Man könnte hier vielleicht nur dann Surr@10 machen, wenn der Betroffene eine gewisse Zeit lang (ca. 5 - 10 Minuten) DC hat. Dann hätte er genug Zeit, wieder beizutreten, falls überhaupt möglich.","replies":[]}]},{"poster":"Y4l0","date":"2015-05-30T08:47:59.149+0000","up_votes":1,"down_votes":0,"body":"Ich denke nicht, dass es funktionieren  würde. Viel zu viele Spiele würden einfach aufgegeben werden sobald einer die Lane verliert, vor allem im Low-Elo. Sonst wäre es einer nette erweiterung zu dem Spiel.","replies":[{"poster":"Stiv1234","date":"2015-05-30T09:01:48.469+0000","up_votes":1,"down_votes":0,"body":"Wenn das Early nicht läuft, dann ist es sowieso schon so gut wie vorbei, denn im Late ein 4v5 zu gewinnen ist fast unmöglich. Wenn nur einer die Lane verliert, heißt das doch noch lange nicht, dass gleich 3/4 aufgeben. Wie gesagt wäre das auch **nur für Normals** gedacht.","replies":[{"poster":"haha weed lol xd","date":"2015-05-30T10:07:55.119+0000","up_votes":1,"down_votes":0,"body":">Wenn das Early nicht läuft, dann ist es sowieso schon so gut wie vorbei \n>\n>\n\nwas :D ? Nie im leben","replies":[{"poster":"Stiv1234","date":"2015-05-30T14:42:08.255+0000","up_votes":1,"down_votes":0,"body":"Wenn die Teamfights mal beginnen, dann merkt man schon stark, wenn man einen zu wenig hat.","replies":[]}]}]}]},{"poster":"erzi222","date":"2015-05-30T15:17:44.701+0000","up_votes":1,"down_votes":1,"body":"es sollte generell immer möglich sein zu surrendern, da bleibt einem einiges erspart.\ndann würde sich auch nieamnd über afks und trolls beschweren, aber das system zwingt ja einen dazu zu spielen.","replies":[]}]}