{"poster":"BestPudgeNA","date":"2019-07-19T21:42:41.188+0000","title":"If random item numbers are good and fun i have great ways to improve the game!","subforum":"Teamfight Tactics","up_votes":8,"down_votes":0,"body":"Why not make it so you get Random amounts of Champions to select from too!\r\nWouldn't it be awesome if you randomly couldn't buy a single champ the first creep round? It would be super sweet if you randomly got to see 10 units each round right?\r\nOh next you could add random amounts of XP per round. Wouldn't it be sweet randomly be level 6 when some is still level 3! \r\nOh and how about random gold too. Like if your econ is about 50 you can randomly between +0 and +10 Wouldn't that be so fun. \r\nOh and how about the carousel why not make it so your in a random pick order.\r\nI just love it when my strategic choices don't matter in a strategy game, makes it feel worthwhile.  \r\n\r\n\r\n/Sarcasm off\r\n\r\nI hope i made my point. \r\nGetting random resources is fun because it makes every game different and adds a level of complexity that wouldn't exist otherwise.\r\nGetting random amounts of resources is just frustrating when you don't get them and an empty victory when you do.","replies":[{"poster":"iainB85","date":"2019-07-20T02:39:40.772+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=BestPudgeNA,realm=NA,application-id=RaE1aOE7,discussion-id=KQOuxBHx,comment-id=,timestamp=2019-07-19T21:42:41.188+0000)\n>\n> Why not make it so you get Random amounts of Champions to select from too!\n> Wouldn't it be awesome if you randomly couldn't buy a single champ the first creep round? It would be super sweet if you randomly got to see 10 units each round right?\n\nTroll post, didn't also suggest that the champions could randomly be FREE as well! Why should the champion price be static? That's not fun and dynamic!","replies":[]},{"poster":"Von8","date":"2019-07-20T15:10:52.022+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}]\n> Oh and how about the carousel why not make it so your in a random pick order.\n\nThe carousel is already pretty damn random.  Being first pick in no way guarantees you will get what you want.","replies":[]},{"poster":"J Epstein","date":"2019-07-20T03:03:09.219+0000","up_votes":2,"down_votes":0,"body":"Yes, it seems silly that the number of item drops is still not normalized.","replies":[]},{"poster":"KFCeytron","date":"2019-07-19T21:47:31.178+0000","up_votes":2,"down_votes":0,"body":"https://i.imgur.com/EsdXPs4.gifv","replies":[]}]}