{"poster":"Flaccid Willy","date":"2015-06-13T20:02:12.016+0000","title":"There should be Achievements. ( PLEASE READ )","subforum":"Maps & Modes","up_votes":67,"down_votes":18,"body":"(**EDIT**)\n\nFirst of all, when I posted earlier about daily quests it seemed like the community did not like that idea at all. So to edit my idea I would like to say this is not daily quests. I think riot has done a good job with the first win of the day. To make it different than other games such as Heroes of the Storm and Hearthstone I think you should keep the first win of the day but add an achievements tab in your profile. Some of you don't realize that this should not be mandatory. It's not something you are forced to do. It's like getting an achievement on any other game but once you complete your achievement you will have earned a reward. Example: Say you got a pentakill in a game and you are really proud of yourself and when you log on you get 1000 ip to celebrate your first pentakill. Tell me that sounds bad ;)\n\nSecond of all, a lot of you are worried of how this will affect the gameplay.'' You got that Idiot choosing a champion they don't know how to play so that they can get that extra 50 ip... Ends up feeding.'' I don't believe that achievements will affect gameplay as much as you guys think. If we or RIOT comes with smart enough ideas it will work. Example: You have an achievement called ''Get to SILVER league in solo queue''. How is that going to make people try new things or feed. More examples could be ''Get 20 Double Kills'', Get First Blood 15 times'', ''Deal the most damage'', ''Tank the most damage in 5 matches'' and ''Own all 450 ip Champions''. Truly there are at least 100 ideas I believe we come up with including using the new creative champion mastery idea.\n\nThird, If you think about it, you could have sort of an achievements slot that would check off whenever you completed that quest. I'm thinking that quests could give off around 10-6000ip. 50 would equal an achievement close to win 2 games in a row and then 500 would be winning 5 games in a row. For my final example 6000 would be achievements close to get 10 pentakills or master 30 lvl 5 champions or you can make the challenge inferior to receive a smaller amount of ip.\n\nFourth, I believe it would be really cool for those players that want to complete everything. When you have a slot in your profile that has all your achievements and you see them, it makes you want to complete them. To see something get checked off like that will bring in a bunch of new players and enhance the bond with the old ones. You could attract a brand new type of gamer known as the completionists. These guys will play this game all the way to the end of time to get all those achievements and get the giant reward for completing all of them. Reward for getting all achievements could be like a skin, background for your summoners page, Icon or even a champion. It's really cool to see what ideas you could come up with since this is a very open discussion.\n\nTo conclude, I would love to see your ideas and support so that riot could get their eyes on this page. It would be great  to see us come together to enhance the gameplay for League of Legends. Extra information would include that this will be banned in ranked (or maybe accepted in ranked if you have smart ideas...you get first pentakill in a ranked would suck so much if it did not count. \n\nThank you for the help in making my forum better, all the problems you found have helped me clean this up a little bit.\n\nFeel free to leave your ideas for achievements in the comments below.\n\n-Fernhilt","replies":[{"poster":"YOU BEEN WARNED","date":"2015-06-13T21:54:30.888+0000","up_votes":6,"down_votes":0,"body":"That's awesome, there has got to be item specific quests; damage thresholds and champion mastery quests! I fully support this.","replies":[{"poster":"Aych Pii","date":"2015-06-14T03:44:57.662+0000","up_votes":10,"down_votes":0,"body":"Finish a game with five more kills than deaths while using Ohmwrecker: 500 IP\n\nBuild Nashor's Tooth and win a game: 150 IP\n\nBuild Avarice Blade and earn the most gold on your team: 400 IP\n\nSounds like fun!","replies":[{"poster":"Only Play Darius","date":"2015-06-14T04:02:52.799+0000","up_votes":16,"down_votes":1,"body":"This would **need** to be disabled in ranked.","replies":[{"poster":"B Monkee","date":"2015-06-16T19:02:18.424+0000","up_votes":2,"down_votes":0,"body":"My imagination has already gone wild.... {{champion:92}} {{item:3043}}","replies":[]},{"poster":"Aych Pii","date":"2015-06-14T05:05:12.711+0000","up_votes":2,"down_votes":0,"body":"Oh yeah, for sure.","replies":[]}]},{"poster":"Academy Kayn","date":"2015-06-16T06:02:23.654+0000","up_votes":2,"down_votes":0,"body":"but...but... {{champion:268}} {{item:3115}}","replies":[]}]}]},{"poster":"Loken Stoneheart","date":"2015-06-14T03:22:38.531+0000","up_votes":12,"down_votes":1,"body":"Problems\n\n1) Favors only \"normals\" instead of ranked. Creates awful clusterfluck in ranked where players are playing strange champion-roles that they are unfamiliar with in order to get credit for the daily.\n2) Dailies are lame. They are a chore, and give the company the excuse to have low per-game rewards (see HotS and Hearthstone).\n\nI actually quit Guildwars 2 because of the daily system. It made the game not fun. It isn't fun to log in every day and have a chore list that I have to go down, checking off, in order to \"keep up\" with other players.","replies":[{"poster":"PickleBabah","date":"2015-06-14T04:20:00.240+0000","up_votes":6,"down_votes":1,"body":"I agree. Instead of being daily, why not something that can always be achievable but have higher needs? (i.e Have a total of 3 million stacks on Nasus: 1500 IP, or Deal a total of 20 million damage on Veigar: 2500 AP) \nOr maybe when you log in, you have a set of 3 quests that are completely different. You can choose one of those for that day.\nAnd then there are hidden ones (Gain the Baron buff 3 times in one game: 300 IP and Baron Icon).\nOr perhaps after you start a game you are given a certain quest to have some sort of score. (gain more than 250 minion kills)\nShouldn't apply in ranked.","replies":[{"poster":"commit an hero","date":"2015-06-14T05:07:16.881+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=PickleBabah,realm=NA,application-id=LFfTlAky,discussion-id=8MhcEEz0,comment-id=000b0000,timestamp=2015-06-14T04:20:00.240+0000)\n>\n> I agree. Instead of being daily, why not something that can always be achievable but have higher needs? (i.e Have a total of 3 million stacks on Nasus: 1500 IP, or Deal a total of 20 million damage on Veigar: 2500 AP) \n> Or maybe when you log in, you have a set of 3 quests that are completely different. You can choose one of those for that day.\n> And then there are hidden ones (Gain the Baron buff 3 times in one game: 300 IP and Baron Icon).\n> Or perhaps after you start a game you are given a certain quest to have some sort of score. (gain more than 250 minion kills)\n> Shouldn't apply in ranked.\n\n3 million stacks would be about 6,000 games assuming you get 500 per game. So yeah, that's awful.","replies":[{"poster":"insaiyanbacca","date":"2015-06-14T18:25:17.985+0000","up_votes":1,"down_votes":0,"body":"depends on how long each game goes, if they are 40 mins you should hit 700-800 before the end, 30 mins should be 500-600","replies":[]}]},{"poster":"Aych Pii","date":"2015-06-14T05:06:22.089+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PickleBabah,realm=NA,application-id=LFfTlAky,discussion-id=8MhcEEz0,comment-id=000b0000,timestamp=2015-06-14T04:20:00.240+0000)\n>Deal a total of 20 million damage on Veigar: 2500 AP\n\nI see what you did there.","replies":[]}]}]},{"poster":"MVDuneCats","date":"2015-06-14T03:55:51.278+0000","up_votes":6,"down_votes":0,"body":"I played a bit of Hearthstone, and did just enough Heroes of the Storm to see that it had the same kind of daily quests.  Personally, I hate the way Blizz implemented daily quests with those two games.  To effectively farm those rewards, I often found myself having to play in ways I didn't want to play.  It would be like if the daily quest rewarded me if I played as a mage today, but I don't really feel like playing a mage.  Or if the quest is to get a large number of CS today, but I want to play support.\n\nThat's what I like about the first win of the day bonus.  It's a generic \"daily quest\" that lets me accomplish it the way I want to accomplish it.","replies":[]},{"poster":"AFK Push","date":"2015-06-14T06:22:00.790+0000","up_votes":3,"down_votes":0,"body":"Dailies are lame as hell. It seems what you want is a kind of trophy/commendation style system. As in get x kill/multikills/assists/wins/objectives as said champion which in turn could expand the mastery system.","replies":[]},{"poster":"AFK Push","date":"2015-06-14T18:22:14.942+0000","up_votes":2,"down_votes":0,"body":"OP stop bumping the thread. It is getting attention just be patient.","replies":[{"poster":"Flaccid Willy","date":"2015-06-14T18:33:55.278+0000","up_votes":1,"down_votes":1,"body":"I wanted to make sure the old people who did not like this forum saw to new thread","replies":[]}]},{"poster":"Totalis","date":"2015-06-14T06:53:55.985+0000","up_votes":2,"down_votes":0,"body":"First time in a while i completely disagreed with a thread. league is already good enough it doesnt need gimmicky and cliche out-of-game quests.","replies":[]},{"poster":"5000000000000000","date":"2015-06-13T20:40:52.945+0000","up_votes":4,"down_votes":3,"body":"The mastery system should be based on achievement system.\nGive about 50~100 achievements for each champion, and gain mastery based on how many you got.","replies":[{"poster":"RoyaiChaos","date":"2015-06-14T05:30:59.444+0000","up_votes":2,"down_votes":0,"body":"Champion mastery shouldn't be determined based on pre-set goals by Riot, it should be based on how good you are with them. Champions are played differently by different people. Some don't really kill about kills, only objectives, some like to kill as many people as possible. Some like to split push, others like to group.","replies":[]},{"poster":"T RexHasTinyArms","date":"2015-06-14T00:40:01.044+0000","up_votes":2,"down_votes":1,"body":"I would have loved this. I was really hoping for it, but I think too many in the community would complain, and I can kind of see the point of not forcing players to be super specific in their champ mains to get achievements. I know I'd be bored as hell with the system if a champ that I main and am going to have at least 50 ranked games on had achievements that could be picked up in 10 games w/ silver or gold level skill (which I assume is reasonable for what someone considers their favorite champ maybe, I don't know, I have over 150 ranked games on my favorite champ this season, but I like just playing my favorite champ a ton).\n\nOn the other hand, while someone like me would love a \"get 200 double kills\" or \"get 50 first blood kills\" achievement that was champ specific, no one who didn't play mostly one champ or stream and play a ton of games every day would look at an achievement like \"get 50 first blood kills w/ X champ\" and think that sounded like a fun thing to try and get. Even assuming you did it every other game (which is still kinda hard to do unless you play something that is cheesy about first blood, like invading w/ jg shaco or S3 jg mundo w/ smite exhaust :D good times man, good times), it would still take 100 games on one champ to get that one achievement. People would complain about how \"that is unreasonable,\" rather than be like wow,  that must be crazy to get.","replies":[]}]},{"poster":"ElJanitorFrank","date":"2015-06-14T01:16:16.551+0000","up_votes":2,"down_votes":0,"body":"The rewards seem pretty weird to me.  6000 ip wounded ridiculous as a reward, until you stated the reasoning, having all the champions.\n\n\nBut then why would you need the ip if you have all the champions?","replies":[{"poster":"RoyaiChaos","date":"2015-06-14T05:30:21.727+0000","up_votes":1,"down_votes":0,"body":"Runes, and icons too.","replies":[{"poster":"ElJanitorFrank","date":"2015-06-14T06:25:18.194+0000","up_votes":1,"down_votes":0,"body":"You only have a limited number of runes you can own.","replies":[]}]}]},{"poster":"RottedApples","date":"2015-06-13T21:35:14.561+0000","up_votes":3,"down_votes":1,"body":"wasn't there an achievements tab in the client a long time ago? I remember it being pointless because you could never use it.","replies":[]},{"poster":"Avios1","date":"2015-06-13T20:26:53.236+0000","up_votes":2,"down_votes":1,"body":"{{champion:17}} main approves...","replies":[]},{"poster":"Average Shen","date":"2015-06-18T02:11:37.122+0000","up_votes":1,"down_votes":0,"body":"I don't know if they should make achievements for rank that might be kind of condescending to lower elo players. They also already have those with the end of season rewards","replies":[]},{"poster":"Arcelia","date":"2015-06-16T07:35:31.408+0000","up_votes":1,"down_votes":0,"body":"There used to be an achievements tab in the client that was removed a few season ago (beginning of S3 iirc) so I don't think riot intends to add achievements anytime soon","replies":[]},{"poster":"OshGoshBoGosh","date":"2015-06-14T22:21:50.593+0000","up_votes":1,"down_votes":0,"body":"The problem with these achievement systems is shown in many MMORPGs such as WoW. Where a player's account has achieved a high rating (such as diamond + in ranked)... It increases the number of people who will pay real money to get carried to these ranks. Then these players advertise on forums that they are this rank - see achievement. And it ruins the game quality for players who actually earned their status. \n\nAlso a drawback to this concept is a player might have obtained Diamond or higher a few seasons ago, but might be platinum now. A few season's ago diamond is NOT the same as being diamond this season. See how finding teammates for serious rank push players would be affected by an achievement system where you cannot track their true qualifications. \n\nThe current portrait post-season is effective enough to display what you achieved in the prior season. I strongly stand against the achievement system and hope it doesn't happen at least in regards to ranked play unless its just win streaks, kills, etc.\n\nAlso, making it easier to obtain IP is insulting to those of us who have unlocked most, if not all of the champions and runes already. We worked hard for these and if it is handed out like candy many will leave the game like you see in many online games that die.","replies":[]},{"poster":"Sarutobi","date":"2015-06-14T14:01:08.334+0000","up_votes":1,"down_votes":0,"body":"While I would like something like this. For this game I'm not sure how they would work that differs from other games that does this. You can't make it champion based eg using a champion in x amount of games. Because then people will play those champs possibly not knowing how they would work, and more than likely costing the game.\nYou can't make it items based because again some items barely get touched. You wouldn't want to lose a match because someone wanted an achievement because they needed to use an item.\nAbout the only thing you could do is play x matches like normals/aram/other modes and if that's the case that would lose its charm after awhile.\n\nAll in all its a good idea, but I doubt something like this could work in LoL being out this long!","replies":[]},{"poster":"iainB85","date":"2015-06-14T00:12:50.585+0000","up_votes":1,"down_votes":0,"body":"This is what Heroes of the Storm does.... and Hearthstone.... and WoW.","replies":[{"poster":"remotayy1","date":"2015-06-14T12:40:31.436+0000","up_votes":1,"down_votes":0,"body":"and only one of those is a MOBA","replies":[]}]},{"poster":"Kouga","date":"2015-06-14T09:11:04.711+0000","up_votes":1,"down_votes":0,"body":"I had a similar idea, not so much about long term \"quests\" but just little \"achievements\" that you'd unlock in each game. Similar to what shooters like CoD or Halo do, where you'd get medals for getting multikills or special/unique kills. In League it could also apply to things like health healed or surviving a big team fight and being the last man standing.\n\nI go into this in-depth [Here](http://boards.na.leagueoflegends.com/en/c/gameplay-balance/ZEePP9xK-proposal-post-game-badges-or-accomplishments-for-positive-player-feedback) but it could also work similar to your idea. I have a list of achievements in there you could look over for similar ideas.","replies":[]},{"poster":"Flaccid Willy","date":"2015-06-14T05:29:01.078+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"AbodyHUN666","date":"2015-06-14T09:02:36.064+0000","up_votes":1,"down_votes":0,"body":"We all know that it's a bonus for us, but think about it from the new player's perspective. The regular IP gain from matches is low and a casual player usually needs a month to farm up for a 6300 IP champ. They would feel that the only way to really get a big champ pool like the \"big guys\" they have to go for dailies. Though I'm in favour of once in a lifetime achievements like your first penta, some of them should only be achieveable with premade 5 teams.","replies":[]}]},{"poster":"Pengod","date":"2015-06-14T06:53:29.403+0000","up_votes":1,"down_votes":0,"body":"Heroes of the storm has them. win 3 games. play 3 games as support.\nThat'd be great!","replies":[]},{"poster":"Urdnot Entar","date":"2015-06-14T04:38:36.947+0000","up_votes":1,"down_votes":0,"body":"Riot's already been stealing ideas from Heroes of the Storm, so daily quests will probably be along soon. Of course, Riot also tends to make them worse in the stealing, so we'll see how it turns out...","replies":[]},{"poster":"Sirin Gioro","date":"2015-06-14T03:56:18.265+0000","up_votes":1,"down_votes":0,"body":"ya but it's going to be magma chamber 2.0","replies":[]},{"poster":"SuperJediNinja","date":"2015-06-14T01:07:29.983+0000","up_votes":1,"down_votes":0,"body":"We just need them for every map and role !","replies":[]},{"poster":"T RexHasTinyArms","date":"2015-06-14T00:25:56.386+0000","up_votes":1,"down_votes":0,"body":"Honestly this is kinda what I was hoping for in the mastery system. My best friend is stupid good at FPS games, and so I used to play a lot of those w/ him, and the achievement unlocks for different guns or specific sub weapon kills (ie 500 head shots w/ x gun, 100 double kills w/ a grenade/claymore) were pretty fun and usually cool to reflect in the achievement w/ the gun.\n\nI'd love to see this tied to champ mastery or the champions in some way. I'm never going to play an ARAM game or TT even if the daily quest was \"win 5 matches on TT or something,\" but unlocking something (even just a badge or level 6 mastery or something) for doing stuff like \"get 500 kills with X champ\" \"get 100 double kills with X champ\" \"get first blood 25 times with X champ\" would be supper cool. Also it lets you customize stuff for the champs that feels more meaningful for mastery and being rewarded. Getting level 5 mastery doesn't mean you're any good w/ the champ, it just means you play them, but if you see a soraka who has something like \"Timely Medic: Heal a teammate who would otherwise have died to damage taken within 2 seconds of being healed 500 times\" you know they probably play soraka a whole lot AND are at least decent at making clutch plays w/ the heal.","replies":[]},{"poster":"Flaccid Willy","date":"2015-06-13T22:09:41.647+0000","up_votes":1,"down_votes":0,"body":"I don't remember there being an achievements tab but I think it should be a feature that could be great for more players to have fun completing objectives","replies":[]},{"poster":"TwitchInMyPants","date":"2015-06-14T00:50:32.981+0000","up_votes":1,"down_votes":1,"body":"If it was based around wins and playing roles it'd be great for LoL, as well as if they tied it to the existing mastery system.  It'd promote trying new things while not encouraging people to do stupid stuff like try and get as much farm as possible.  Tho I don't think it'd be bad to have something like a pentakill achievement since all that does is encourage you to cleanup a winning fight which is a rare situation that you'll naturally take action for.","replies":[]}]}