{"poster":"VenTene","date":"2015-09-11T17:10:48.408+0000","title":"Patch 5.17!","subforum":"Hilfe & Support","up_votes":7,"down_votes":0,"body":"Ich wei&szlig;, dass viele es schon beschrieben haben, aber seit dem Patch 5.17 haben viele das Problem, dass sie w&auml;hrend des Games in regelm&auml;&szlig;igen Abst&auml;nden die Verbindung verlieren oder, dass der Ping pl&ouml;tzlich in die H&ouml;he schie&szlig;t und nach ca. 5 Sek wieder auf seinen normalen Wert f&auml;llt.\r\nDiese 5 Sekunden k&ouml;nnen fatal sein und leider sind sie das in den meisten F&auml;llen auch. Die Kr&ouml;nung ist, dass der Ping komischerweise immer dann hochschie&szlig;t wenn gerade ein Teamfight ist oder ein Gegner den Angriff einleitet. Ich denke nicht, dass ein oder mehrere Spieler im Gegnerteam etwas im Hintergrund laufen haben. Riot w&uuml;rde das erkennen und es ist schwer Spiele in LoL in dem Sinne zu beeinflussen. Und dann m&uuml;sste auch jedes Spiel einer was laufen haben.\r\n\r\nHabe folgendes versucht:\r\n* Den Client neugestartet\r\n* Den Client repariert\r\n* Den Client neu installiert\r\n* Den Router neu aufgesetzt\r\n* Den PC neugestartet\r\n* Virensuchlauf gestartet (keine Funde)\r\n\r\nIch und viele andere wissen leider nicht weiter und langsam st&ouml;rt es. Ich denke abwarten auf den n&auml;chsten Patch und hoffen, dass das Problem behoben wird.\r\n\r\nMfG MHIUA","replies":[{"poster":"EefFenZ","date":"2015-09-11T21:26:55.859+0000","up_votes":2,"down_votes":2,"body":"Schonmal drangedacht, dass das Problem auch bei eurem Internetanbieter liegen kann? Das Problem hatte ich nämlich früher bei der Telekom, da ging ein Backbone (Zwischenserver) kaputt und der Datenverkehr von einem relativ großem Gebiet wurde auf einen anderen umgeleitet, was vermutlich zu dessen regelmäßiger Überlastung geführt hat, weil er jetzt die doppelte Arbeit hatte. Ich kann mir nicht vorstellen, dass das ein Problem seitens League of Legends ist. Wie du es selbst schon beschrieben hast, weder neu installieren noch reparieren hat etwas gebracht, aber der Fehler tritt nicht bei jedem auf. Klingt für mich sehr verdächtig nach einem Problem auf der Strecke von dir zum Riot Server.","replies":[{"poster":"xDerHobbitx","date":"2015-09-11T21:53:04.575+0000","up_votes":3,"down_votes":1,"body":"Das liegt nicht am Anbieter ich bin bei Kabel Deutschland und hab die selben Probleme ich hab nen Ping von 26 und verliere trotzdem die Verbindung das liegt definitiv an den neuen Patch mit den komischen Projekt Sachen.\nAußerdem kann ich das komplette Spiel beobachten mich nur nicht bewegen und dann steht da immer nur das ich die Verbindung verliere es läuft aber alles weiter und ich kann mit meinem Team schreiben ","replies":[{"poster":"EefFenZ","date":"2015-09-12T09:44:44.020+0000","up_votes":2,"down_votes":0,"body":"Klingt für mich immer noch nicht wie ein Problem des Patches. Dass du alles sehen kannst aber dich nicht bewegen kannst heißt nur, dass dein Upstream im Ar*** ist aber dein Downstream nicht, dass heißt du kannst sehen aber nicht handeln. Außerdem habe ich nie behauptet, dass man die Telekom dafür veranwortlich machen kann: das kann unterschiedliche Anbieter gleichzeitig betreffen weil sie über den selben Backbone etc. arbeiten ( btw. wieso downvoted man Beiträge wie diese? )","replies":[{"poster":"VenTene","date":"2015-09-12T10:19:37.606+0000","up_votes":1,"down_votes":0,"body":"Was mich an der Sache noch stört ist, dass seiten Riots noch keine Aussage dazu gemacht wurde, weil ja wirklich viele sich beschweren, dass sie diese Probleme haben. Unabhängig vom Anbieter. \nAber mal ein kleines Statusupdate: \n\nHabe bei meinem Anbieter (Telekom) angerufen und nachgehorcht ob es irgendwelche Unregelmäßigkeiten gab und der Herr an dem anderem Ende der Leitung konnte nichts feststellen. Es ist ja auch so, dass dieses Problem nur bei LoL auftritt. ich habe heute nochmal getestet wie es in LoL läuft. [Hat sich leider nichts verändert.] Und habe als Vergleich mal Guild Wars 2 gespielt, welches auch wirklich viele Spieler hat und dort hatte ich keine Probleme mit dem Ping. Es scheint wohl an LoL zu liegen, heißt für mich bis zum nächsten Patch oder Hotfix Finger Weg von LoL.","replies":[{"poster":"EefFenZ","date":"2015-09-12T10:32:16.080+0000","up_votes":1,"down_votes":0,"body":"Hm das ist dann natürlich sehr seltsam. Immerhin mal einer der sich wirklich erkundigt hat und nicht gleich alles auf die einfachste Lösung schiebt ^^. Aber woran kann so etwas dann liegen, ich hab das mit den Lags nämlich bis jetzt nur von Deutschen gehört und da sind es allerhöchstens 5%. \n\nEdit: Bzw. ich habs jetzt nicht nachgesehen aber ich gehe davon aus, dass der GuildWars Server vermutlich nicht in Amsterdam liegt? Sprich es kann eben daran liegen dass ein bestimmtes Stück des Netzes von Deutschland in Richtung Amsterdam leidet und das logischerweise keinen Einfluss auf andere Nationen hat. Gibt es denn zum Beispiel auch Briten die sich über Lags seit 5.17 beschweren?","replies":[{"poster":"VenTene","date":"2015-09-12T10:38:37.443+0000","up_votes":1,"down_votes":0,"body":"Vielleicht liegt es auch einfach an meiner Leitung, wir haben 16k und es kommen Augrund unseres Standortes nur 7k an.. \nBei Guild Wars 2 ist das mit den Servern ja auch in ich glaube 20 verschiedene unterteilt. Und bei LoL sind es 35 Mio Spieler alleine auf EUW. Wenn mein Internet den Traffic nicht mehr packt wäre das echt schade und es dürfte eigentlich auch nicht daran liegen, da es vor dem Patch einwandfrei lief.","replies":[]}]}]}]}]}]},{"poster":"Comettee","date":"2015-09-14T16:34:28.382+0000","up_votes":1,"down_votes":0,"body":"Selbe Problem bei mir und ein paar bekannten . Seit dem Patch Probleme wie vom TE beschrieben . Ich habe alles getestet Wlan, Dlan , LAN , Hub, etc. ob auch nur ein gerät bei mir ne Fehlfunktion hat. \nKeines hatte auch nur ein Problem bei anderen spielen nur bei LoL . \nEefFenz hat nicht unrecht es liegt wahrscheinlich an unseren Upload allerdings nicht an unseren Anbieter sondern wahrscheinlich ehr das die Server und unsere Uploads sich gegenseitig Blockieren irgendwie. \nIch gehe auch davon aus das die , die sich hier beschweren nen Paket Verlust haben der enorm ist mich mit eingeschlossen allerdings nur bei LoL ,bei anderen spielen wahrscheinlich nicht...","replies":[]},{"poster":"oVeRRatedCoCaine","date":"2015-09-13T15:42:05.674+0000","up_votes":1,"down_votes":0,"body":"Habe das selbe problem seitdem 5.17 da ist.\nVorher hatte ich nie iwelche probleme.\nHab es jetz mal bei csgo,dota2 und smite probiert und die Spiele Funktionieren wunderbar.\n\nmfg","replies":[]},{"poster":"iScoutx","date":"2015-09-12T08:13:04.886+0000","up_votes":1,"down_votes":0,"body":"Same. Habe das selbe Problem.","replies":[]}]}