{"poster":"Easlay","date":"2016-09-05T17:35:24.883+0000","title":"Matchmaking sballato?","subforum":"Discussioni generali","up_votes":2,"down_votes":2,"body":"Ho appena finito una ranked dove il matchmaking era a dir poco sballato:\r\nmio team: 2 silver 3, un silver I e un unranked + io (g1)\r\nteam nemico: 4 gold 5 e un silver 1\r\n\r\ninutile dire che il mio team ha preso le peggio pizze (nessuno smurfava, dai dati)\r\n\r\n\r\nora, potrei capire se avessi un mmr sputtanato, ma fino a ieri i miei game, compreso l&#039;ultimo, vinto, oscillavano da g2 a p4, quindi il dubbio mi viene....oggi il sistema matcha a caso? (ho fatto 2 minuti di coda pure, quindi escludo pure l&#039;ampliamento della forbice a causa lunga attesa)","replies":[{"poster":"Etoclas","date":"2016-09-05T18:27:38.452+0000","up_votes":1,"down_votes":0,"body":"Stavo per fare un post uguale: ho fatto una partita NORMAL contro un platino 5 e un gold, nella mia solo un gold e bronzo e unranked.\nIo cerco di giocare per imparare, ma così è impossibile.\n\nIn un'altra partita stavo giocando Yasuo mid (per la quarta volta, comprato l'altro giorno), io sono Silver 5 e mi trovo contro un'Akali gold 5, mi ha aperto, mi shottava sotto torre dopo 2 kill.\n\nCosì il gioco si rovina, devo iniziare a giocare solo ranked allora?","replies":[{"poster":"SickAnto","date":"2016-09-05T19:00:25.239+0000","up_votes":1,"down_votes":0,"body":"Credo che, anche se Akali era S5 ti apriva lo stesso xD (specialmente se sei ancora un principiante con lui)\nE' un counter di Yasuo in un certo senso.","replies":[{"poster":"Etoclas","date":"2016-09-05T19:56:55.310+0000","up_votes":1,"down_votes":0,"body":"Beh, da S5 a G5 c'è una bella differenza, non da ignorare almeno xD","replies":[{"poster":"SickAnto","date":"2016-09-05T20:47:21.864+0000","up_votes":1,"down_votes":0,"body":"E' comunque una normal, dove si viene giudicati in base al mmr non al proprio elo.","replies":[]}]}]}]},{"poster":"Frattaglia","date":"2016-09-05T19:44:39.470+0000","up_votes":1,"down_votes":0,"body":"Si, partite del genere capitano anche a me.\n\nMa credo che sia molto legato alla nuova champion select, sai il fatto che la gente si sceglie i ruoli etc... partite così capitavano regolarmente col team builder.\n\nNelle ultime partite che ho fatto in solo (non in duo), delle volte ero la più bassa di elo della squadra (gold 1), altre volte la più alta, con in squadra e contro gente gold5 e silver 2...","replies":[]},{"poster":"Laiho88","date":"2016-09-05T18:17:01.651+0000","up_votes":1,"down_votes":0,"body":"giudica tu\n[IMG]http://i63.tinypic.com/vshq89.jpg[/IMG]","replies":[{"poster":"Easlay","date":"2016-09-05T18:52:52.886+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Laiho88,realm=EUW,application-id=MJVj50Jw,discussion-id=NntIAJAo,comment-id=0001,timestamp=2016-09-05T18:17:01.651+0000)\n>\n> giudica tu\n> [IMG]http://i63.tinypic.com/vshq89.jpg[/IMG]\n\nli posso pure pensare a una duoQ del platino, ma questa non si spiega, sul serio..\nhttp://i.imgur.com/qLFVLLV.jpg[/IMG]","replies":[]}]},{"poster":"MonkeyCarriesU","date":"2016-09-05T18:41:02.215+0000","up_votes":1,"down_votes":0,"body":"Io ho beccato qualche low diamond, ma credo perchè abbiano l'mmr abbastanza basso in quanto sono p3 io.","replies":[]},{"poster":"Ludwigfasana","date":"2016-09-05T18:11:50.806+0000","up_votes":1,"down_votes":0,"body":"Tutto normale, capitano cose molto strane in questo periodo in ranked pure a me tra unranked silver gold e bronzo in uno stesso team.... Un bel minestrone ahaahhaha","replies":[]}]}