{"poster":"ShadowForky","date":"2016-05-09T17:23:39.739+0000","title":"WLAN Ports für LoL umgehen","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Guten Tag Beschwörer :)\r\nIch habe ein Problem. Mein Vater hat als Reaktion auf einen Streit an unser Fritzbox vor einem Jahr den Port für Online Spiele gesperrt. Ich kann also kein League mehr spielen. Nun bin ich aber 18 geworden und er weigert sich nach wie vor, diese wieder zu entsperren. Weiß jemand wie man die umgehen kann? Und glaubt mir, ich habe lang und schlapp mit ihm gesprochen, aber es bringt nichts. Ich würde mich sehr über Antworten freuen! :) \r\nUnd sonst wünsche ich euch noch viel Spaß in der Kluft :)","replies":[{"poster":"FMG Zaan","date":"2019-04-11T19:00:48.246+0000","up_votes":1,"down_votes":0,"body":"HILFEEEE!\n\n\nDieser Post ist zwar mittlerweile 3 Jahre her aber ich habe 1zu1 das selbe Problem und hoffe wirklich sich hier nochmal jemand nach 3 Jahren meldet :D\n\n\nMein Stiefvater hat mir über die Fritzbox den normalen Internetzugang freigeschaltet (Gastzugang) doch den Internetzugang für Online Spiele blockiert.\nBei meiner Playstation ist das Problem das ich keinen Nat- Typ habe. Das bedeutet das ich mich mit keinem Host verbinden kann und kein Spiel Online zocken kann. Ich kann kein Fifa Cod etc. zocken, das stört mich garnicht großartig aber ich kann auch kein LoL mehr zocken und das seid mittlerweile einem Jahr. Ich kann mich einfach nicht anmelden ich hänge ewig in der Warteschlange und irgendwann flieg ich raus.\n\n \nIch kenne mich leider mit sowas garnicht aus und finde auch keinen weg dies irgendwie zu umgehen. Ich hoffe wirklich jemand kann mir hier Helfen :D\n\nLG \nFMG Zaan \n\nDer leider seinen Gold Rush wegen seinem Stiefvater nie bis Platin zu ende bringen konnte.","replies":[]},{"poster":"coday","date":"2016-05-10T10:09:52.684+0000","up_votes":1,"down_votes":0,"body":"Da du nun (wie du selbst angibst) 18 Jahre alt bist, hast du mit Sicherheit auch genügend Reife zu wissen wie man im Internet sucht. Natürlich gibt es genügend Mittel und Wege diese Sperre zu umgehen. Das Problem wird es aber nicht lösen, denn wenn es tatsächlich deinem Vater darum geht dir ein Spiel zu verweigern, wird er einen guten Grund dazu haben. Vielleicht wäre das ein guter Ansatz da nachzuharken und das friedlich zu klären....ggf. einen Kompromiss zu finden.\n\nlg\ncoday","replies":[]},{"poster":"Rucking Fiot","date":"2016-05-09T18:03:50.973+0000","up_votes":1,"down_votes":0,"body":"Mein Kumpel hatte auch so ein Problem..\nEr hat sich dann einfach ein Wlan-aus-der-Steckdose-Modem gekauft (Ich hab keine Ahnung wie das Ding heißt, ok?xD)\nPlan B wäre ausziehen xD\nIch bin keine große HIlfe nehme ich mal an ;_;","replies":[{"poster":"ShadowForky","date":"2016-05-09T18:09:53.957+0000","up_votes":1,"down_votes":0,"body":"Wlan aus der Steckdose Modem? Klingt interessant, aber damit kann ich echt nichts anfangen XD \nUnd ausziehen... Ich gehe halt noch in die Schule, da dauert das noch n bisschen mit ausziehen...","replies":[{"poster":"Rucking Fiot","date":"2016-05-09T19:03:52.799+0000","up_votes":1,"down_votes":0,"body":"Google mal danach ^^","replies":[]}]},{"poster":"Darkr3sQ","date":"2016-05-09T18:12:43.176+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NightcraftpvpYT,realm=EUW,application-id=7hciEY9w,discussion-id=PPPU1v3Y,comment-id=0001,timestamp=2016-05-09T18:03:50.973+0000)\n>\n> Mein Kumpel hatte auch so ein Problem..\n> Er hat sich dann einfach ein Wlan-aus-der-Steckdose-Modem gekauft (Ich hab keine Ahnung wie das Ding heißt, ok?xD)\n> Plan B wäre ausziehen xD\n> Ich bin keine große HIlfe nehme ich mal an ;_;\n\nDas Problem bei dem Ganzen ist, dass die Ports in dem Router gesperrt sind, der die Internetverbindung verteilt. Da hilft meines Wissens nach auch kein WLAN-Repeater.\nMir sind leider auch keine Wege bekannt, die Ports zu umgehen.","replies":[{"poster":"ShadowForky","date":"2016-05-09T18:15:00.970+0000","up_votes":1,"down_votes":0,"body":"Das stimmt. Wenn nur meine IP gesperrt wäre, könnte ich einfach die IP ändern, aber das Problem liegt wirklich \"in der Fritzbox\".","replies":[]}]}]},{"poster":"Eibert Rümmel","date":"2016-05-09T18:45:30.519+0000","up_votes":1,"down_votes":0,"body":"könnte mir vorstellen, dass in einer Textdatei Portnummer und Zieladresse hinterlegt sind. Wenn dem so wäre, einfach Port ändern und loszocken.\n\nAber keine AHnung ob so ist und keine Lust zu suchen :P\n\nEntweder mit Papi ne Lösung finden oder hoffen dass hier ein technisch verisierter user drüberstolpert","replies":[{"poster":"ShadowForky","date":"2016-05-09T18:49:24.078+0000","up_votes":1,"down_votes":0,"body":"Haha ok, dann werde ich wohl noch auf Hilfe einer solchen Person warten müssen. Trotzdem Danke für die Hilfe! :)","replies":[]}]},{"poster":"Eibert Rümmel","date":"2016-05-09T18:32:23.014+0000","up_votes":1,"down_votes":0,"body":"kann man vlt in der lol config den Port ändern?","replies":[{"poster":"ShadowForky","date":"2016-05-09T18:33:38.656+0000","up_votes":1,"down_votes":0,"body":"Hmm ich weiß nicht. Klingt gut, aber ich habe davon leider echt keine Ahnung...","replies":[]}]},{"poster":"Prophet Kola","date":"2016-05-09T17:32:52.050+0000","up_votes":1,"down_votes":0,"body":"Ich bin so krass auf deiner Seite! Ich habe ein ähnliches Problem, kann dir auf deine Frage also leider keine Antwort geben, aber ich hoffe für uns so sehr, dass noch jemand antwortet! \nLG Kola","replies":[]},{"poster":"lKawaiiNeko","date":"2016-05-09T18:30:49.993+0000","up_votes":1,"down_votes":1,"body":"Irgendwie das Passwort knacken und wieder entsperren? :D Geht das? :D","replies":[]}]}