{"poster":"Frankant","date":"2015-11-03T16:11:36.529+0000","title":"Hecarim o Renekton?","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"So benissimo che sono due champ davvero diversi, ma se doveste comprarne uno quale prendereste e perch&eacute;?","replies":[{"poster":"GiardiniereWilly","date":"2015-11-03T16:21:44.934+0000","up_votes":3,"down_votes":0,"body":"sono 2 champion diversi come hai detto, la scelta dipende più che altro dal tuo stile di gioco e se vuoi un champion che funzioni bene a fine partita o un champion che funzioni bene ad inizio partita.\n\nse vuoi un inizio partita forte prendi renekton ma a questo punto prendi darius che fa più o meno le stesse cose ma in modo migiore, ricorda però che renekton oltre ad essere forte ad inizio e metà game non porta alcuna utilità al tuo team. te lo consiglio se è uno dei tuoi primi approcci alla top lane\n\nse vuoi un champion che possa snowballare rapidamente e che porti un sacco di utilità nel team hecarim è la scelta per te, non è semplicissimo giocarlo top ma nessuno nasce capace, a metà e in late game puoi fare degli ingaggi spettacolari mandando in FEAR i nemici e vincendo quasi tutti  i fight se ulti come sei deve (richiede pratica) .  hecarim lo puoi utilizzare anche in giungla dato che quello sarebbe il suo ruolo di casa.\n\nse vuoi qualcosa di utile vai per hecarim se vuoi qualcosa di forte in early c'è di meglio dell'attuale renekron.(parlo nelle giuste mani)","replies":[]},{"poster":"Aegis Winebeard","date":"2015-11-03T17:21:07.488+0000","up_votes":1,"down_votes":0,"body":"Renekton è un bullo da lane, pick molto forte in early e relativamente facile da usare, countera campioni come Riven che altrimenti potrebbero causare non pochi problemi a giocatori inesperti.\nMa in late porca poca utility, bisogna saper approfittare della sua forza in early per poter essere un passo avanti agli altri nelle fasi più avanzate della partita.\n\nTuttavia renekton puoi usarlo praticamente solo top, mentre hecarim è viabile anche in jungle.\n\nPer quanto mi riguarda adoro il mid game di hecarim, infatti è stato uno dei miei Main per molto tempo.\nChe dire di lui? Tanti cc e ottimi engage, non contando la possibilità di andare molto sul tank in lategame per sfruttare la sua utility al meglio (ingaggia per poi rimanere in mezzo al team avversario cercando di dividerli). \n\nPoi i gank di hecarim sono tra i più divertenti del gioco Lol (non contando rammus con tp+ homeguard ovviamente) \n\nRicapitolando\nDa una parte hai un Champion relativamente facile da usare, che può portare tante soddisfazioni in lane (Renekton)\nDall'altra, un campione che si esprime al massimo dal mid game (Hecarim). Scegli bene pensando al tuo stile di gioco, più aggressivo o più eclettico? :D","replies":[]},{"poster":"Tankerous","date":"2015-11-03T16:14:59.048+0000","up_votes":1,"down_votes":0,"body":"Direi Renekton, più che altro perché è un pick più sicuro e semplice da usare. Ma a livello di efficienza sono entrambi ad ottimi livelli, qui parliamo di pura preferenza personale.","replies":[]}]}