{"poster":"Jack N a Box","date":"2019-08-21T22:22:26.700+0000","title":"Replay System - Unabhängiges Replay Programm ?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Heyho Leute / Riot Mitarbeiter\r\n\r\nund zwar habe ich mal eine kurze Frage. \r\nVor ein paar Jahren hat Riot das Replay System von League \"überarbeitet\" bzw in den eigenen Client eingefügt... was an sich ja auch ganz super war.\r\nDas einzige Problem was ich damit habe ist dass, durch diese Entscheidung auch ein verlässlicher Weg mit dem man sich Replays von Freunden anschauen kann verschwunden ist. \r\nNun ist meine Frage... gibt es einen Verlässlichen Weg sich Replay von anderen Spielern anzusehen (hauptsächlich Custome Games) oder unterbindet das League ? \r\nBzw gibt es für diese Problem schon eine Lösung ? -> ist eine Lösung geplant auf der Seite von Riot ?\r\n\r\nChaisen","replies":[{"poster":"legofreak1","date":"2019-08-22T09:31:12.030+0000","up_votes":1,"down_votes":0,"body":"Heruntergeladene Replaydateien können geteilt werden und damit kannst du dir dann auch die Spiele anderer anschauen, wenn diese dir zur Verfügung gestellt wurden. Das funktioniert aber auch nur für den aktuellen Patchzyklus halb zuverlässig, danach benötigst du eine Kopie des Spiels des jeweiligen Patches, zu dem das Replay gehört.","replies":[{"poster":"Jack N a Box","date":"2019-08-26T20:51:56.213+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=legofreak1,realm=EUW,application-id=7hciEY9w,discussion-id=lEUw8rAa,comment-id=0001,timestamp=2019-08-22T09:31:12.030+0000)\n>\n> Heruntergeladene Replaydateien können geteilt werden und damit kannst du dir dann auch die Spiele anderer anschauen, wenn diese dir zur Verfügung gestellt wurden. Das funktioniert aber auch nur für den aktuellen Patchzyklus halb zuverlässig, danach benötigst du eine Kopie des Spiels des jeweiligen Patches, zu dem das Replay gehört.\n\nOh ok, und wie genau genau Teile ich solche Replays ? Und ich meine jetzt keine Rankeds bzw Normals ... die Ingame funktion ist mit schon bekannt ^^ Es geht mir fast Primär um Custom games. Funktioniert das mit diesen auch ?","replies":[]},{"poster":"Gin","date":"2019-08-24T18:47:45.948+0000","up_votes":1,"down_votes":0,"body":"Ergänzend hierzu: Der Player Support hat Zugriff auf so ziemlich alle Replays. Solltest du also ein bestimmtes Spiel von einem bestimmten Patch brauchen - und ein Backup vom jeweiligen Patch haben - und vergessen haben ein Replay herunterzuladen gibt es noch die Möglichkeit diesen anzuschreiben um eine Kopie eines Replays nachträglich zu bekommen.\n\nAber bevor sich alle hier große Hoffnungen machen: Der Support hat auch seine Limits wie weit zurück dieser Replays herunterladen kann, und man kann nur Replays für seine eigenen Spiele anfordern und nicht für Spiele anderer Spieler.","replies":[]}]},{"poster":"Necromant","date":"2019-08-22T06:17:42.694+0000","up_votes":1,"down_votes":0,"body":"Du kannst Ranglistenspiele von jedem anderen anschauen, auch im Clienten. Sprich auch von deinen Freunden.\nMeines Wissens nach gibt es aber darüber hinaus keine andere Möglichkeit aktuell irgendwelche Customs, Arams, Normals sich anzuschauen, sollten es nicht die Eigenen sein.","replies":[]}]}