{"poster":"iKyun","date":"2015-06-08T21:20:29.602+0000","title":"danke riot!","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":6,"body":"promo game, und was ist? ich komme nicht mehr ins game. mein inet geht offensichtlich. liegt wohl am server das die v erbindung zum server nicht hergestellt werden konnte. gg deswegen verlier ich nun wiedder alle meine games. thx","replies":[{"poster":"rekt by MyArea","date":"2015-06-08T21:34:49.579+0000","up_votes":1,"down_votes":1,"body":"jop me 2 ich war im ranked game war mega am gewinnen und brauchte die punkte und aufeinmal alle sind rausgeflogen gg eben schon wieder rito pls !!!{{summoner:14}} {{summoner:11}}","replies":[{"poster":"Dermel","date":"2015-06-08T21:53:17.068+0000","up_votes":1,"down_votes":0,"body":"Das klingt eher nach Drophack, die sind ja gerade in. (Wird bereits behoben->Bann)","replies":[{"poster":"Kaitri","date":"2015-06-09T06:14:27.058+0000","up_votes":1,"down_votes":0,"body":"naja sind wir ehrlich, mit bannen ists nicht getan :D","replies":[{"poster":"SFG Deathstroke","date":"2015-06-09T06:59:37.742+0000","up_votes":1,"down_votes":0,"body":"Stellt sie an den Pranger damit alle sie sehen können XD","replies":[{"poster":"Kaitri","date":"2015-06-09T08:00:44.213+0000","up_votes":2,"down_votes":0,"body":"gibt ein spiel das tut das... bevor leute permagebannt werden können spieler sie nochmal ansehen und mit faulen tomaten bewerfen (alles ingame natürlich). \nfind ich recht amüsant :D","replies":[{"poster":"Irrsinn","date":"2015-06-09T08:18:51.919+0000","up_votes":1,"down_votes":0,"body":"Welches wäre das? Höre ich zum ersten Mal. Würde ich mir mal gerne ansehen.","replies":[{"poster":"Kaitri","date":"2015-06-09T12:40:52.108+0000","up_votes":1,"down_votes":0,"body":"das spiel nennt sich runescape. spielt heutzutage nur fast keiner mehr.\nhaben aber gerade letztens einen livestream gemacht wo sie bot user gesucht, auf eine insel geportet haben (damit diese nicht abhauen konnten) und dann mit ihren super mod kräften in 1schlag gekillt haben. sie haben alles an sich genommen was der spieler bei sich trug, den acc gebannt und den wert der sachen dann irgendwie in cent umgerechnet und irgendwie gespendet.\nfrag mich nicht, hab mir das nicht vollens angesehn, wie gesagt runescape spielt kaum mehr einer. hab ich aktiv zuletzt vor 4 jahren gezockt!","replies":[]}]},{"poster":"Alustus","date":"2015-06-09T08:23:24.359+0000","up_votes":1,"down_votes":0,"body":"Gab auch schon fälle in dem Spieler hingerichtet wurden ;D \n\n> Das Vorgehen gegen eines Moglers in Guild Wars 2 hat eine völlig neue Dimension erreicht, das für viel Aufsehen und auch einiges an Kritik in der Community sorgte.\n> Dabei geht es um den Mogler DarkSide, den mehrere Spieler bei ArenaNet meldeten und erklärten, dass dieser sich teleportieren oder auch einfach sehr hohen Schaden anrichten konnte. Jemand, der quasi unbesiegbar ist.\n> Also verschaffte sich ArenaNets Sicherheitschef Chris Cleary Zugriff auf den Account des Spielers und versuchte ihn erst zu demütigen, indem er die virtuellen Kleider der Spielefigur ablegte. Schließlich stellte er sich halbnackt auf eine Erhöhung und richtete die Figur öffentlich hin, indem er sie in den Tod springen ließ. Der Spieler wurde natürlich gebannt","replies":[]},{"poster":"SFG Deathstroke","date":"2015-06-09T08:09:29.786+0000","up_votes":1,"down_votes":0,"body":"Riot bitte umsetzen :D","replies":[]}]}]}]}]}]},{"poster":"PremiumKartoffel","date":"2015-06-08T21:41:37.954+0000","up_votes":1,"down_votes":0,"body":"BRING THE MADNESS dududududududuudddu bin ich der einizge der solche Problem noch nie hatte?","replies":[{"poster":"Nainya","date":"2015-06-09T15:11:27.637+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PremiumKartoffel,realm=EUW,application-id=YnZkMR0R,discussion-id=9QB2UZ4A,comment-id=0001,timestamp=2015-06-08T21:41:37.954+0000)\n>\n> bin ich der einizge der solche Problem noch nie hatte?\n\nnope","replies":[]},{"poster":"Dermel","date":"2015-06-08T21:51:35.521+0000","up_votes":1,"down_votes":0,"body":"Alle die ich kenne hatten schon mal bugs, einer war mal angeblich 1684 Stunden in einem Spiel... Bei manchen stürzt nach jeder Runde das Spiel ab, ein paar waren schon mal in einer verbindungsaufnahmeschleife gefangen, nach jedem login hängt mein PC also ja du bist der einzige...","replies":[]}]}]}