{"poster":"iKyun","date":"2018-10-13T14:31:17.549+0000","title":"Permanent gebannte Accounts Vorschlag.","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":18,"body":"Leute die durch was auch immer gebannt wurden haben nicht nur viel seiner Lebens Zeit sondern auch sein Geld verloren. Man muss fairer  Weise sagen das so etwas nie eine L&ouml;sung ist.\n\nEs bringt nur wut womit man mit neuen Accounts neue Spieler zu Trollen damit diese aufh&ouml;ren zu spielen um lol eine rein zu dr&uuml;cken. Bzw mit lvl 30 dann mit Absicht Leuten das ranked zu versauen. \n\nViele dieser &#039;b&ouml;sen&#039; Menschen k&ouml;nnte dein bester Kumpel sein der nur emotional wurde.  Was ist denn schon dabei Leute zu schreiben das sie schlecht sind. Oftmals wissen die Leute selber das sie selber oft auch der flashenhals sind und bemitleiden sich nur selber und lasse es an andere raus.\n\nIch finde ein 14 Tage bann f&uuml;r Beleidigung gerechtfertig. Aber ein perma bann?\nDas finde ich nicht gut.\n\nPerma bann sollten Leute nur bekommen wenn die in &uuml;ber 30% ihrer spiele mit Absicht afk rumlaufen bzw lang nur rumstehen oder nur afk Farmen im jgl und das auch sagen das die nun &quot;afk Farmen&quot;\n\nOder Leute die mit Absicht sehr rassistisch vorgehen bzw einen Krebs w&uuml;nschen.\nSo was ist eher etwas das man permanent bestrafen kann. \n\nAber nur weil man aus Frust Leute die 1/7 Stehen sagt das die scheise gespielt haben? \nNein.  \n\nDas ist unter der Menschen w&uuml;rde und auch veruntreuung des fremden Geldes wo man kein Zugang mehr zu hat.\n\nMein Vorschlag ist nun das perma gebannte Leute zu Anfang einer Season entbrannt werden.mit Einschr&auml;nkungen.\n\nZb k&ouml;nnen die nur 2x ranked am Tag spielen f&uuml;r die ersten 3 Monate. Um zu gucken ob diese sich verbessert haben und dankbar sind ihren Account wieder zu haben.\n\nIch f&auml;nde das ne gute Sache da sicherlich Leute dabei sind die &uuml;ber die Zeit eingesehen haben und sich verbessert haben.\n\nIch wei&szlig; es gibt Nun viele die sagen &quot;blo&szlig; nicht&quot; aber was ist daran so verwerflich? Menschen machen Fehler und haben Chancen verdient.","replies":[{"poster":"Sirrkas","date":"2018-10-13T15:08:06.078+0000","up_votes":7,"down_votes":0,"body":">Viele dieser 'bösen' Menschen könnte dein bester Kumpel sein der nur emotional wurde. \n\n\nUm den Perma zu erreichen, braucht man viel mehr als nur mal emotional zu werden. \n\n>Das ist unter der Menschen würde und auch veruntreuung des fremden Geldes wo man kein Zugang mehr zu hat.\n\nEs ist durchaus irgendwo eine Verletzung der Menschenwürde, andere in einem Spiel nieder machen zu wollen, weil die im PvP mal nicht glänzen. Aber niemand veruntreut Geld bei einem Bann. Beim Kauf von RP ist jedem klar, dass die RP ans Konto gebunden sind. Wenn man gegen die Vertragsbestimmungen verstößt, kann einem der Zugriff entzogen werden. Ergo, ist man selbst schuld, am verlorenen Geld. \n\n>Ich weiß es gibt Nun viele die sagen \"bloß nicht\" aber was ist daran so verwerflich? Menschen machen Fehler und haben Chancen verdient.\n\nWie wäre es mit den üblichen 3 Chancen auf Besserung, die davor gekonnt ignoriert wurden? Zählen die nicht als Chance? Sollte jemand, der unverbesserlich ist, wirklich immer wieder noch eine Chance erhalten?","replies":[]},{"poster":"Mezzo","date":"2018-10-13T14:44:35.075+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=iKyun,realm=EUW,application-id=KYnfKGf0,discussion-id=Tq2dQQyM,comment-id=,timestamp=2018-10-13T14:31:17.549+0000) Menschen machen Fehler und haben Chancen verdient.\n\nSchön und gut, aber sie hatten 3 Chancen! Die 10er und 25er Chatrestriction, sowie den 14 Tage Ban. Beim 14 Tage Ban wird auch darauf aufmerksam gemacht, dass die nächste Banstufe permanent ist. Von daher gab es genug Warnungen und Chancen sein Verhalten zu verbessern. Der Permaban bedeutet doch nur, dass Riot den Spieler nicht mehr in der Kluft sehen möchte. Sollte er sein Verhalten bessern steht es jedem gebannten Spieler frei einen neuen Account zu leveln. Problem dabei ist die meisten erreichen nicht mal Level 30, weil sie wieder gebannt werden.\n\n> [{quoted}](name=iKyun,realm=EUW,application-id=KYnfKGf0,discussion-id=Tq2dQQyM,comment-id=,timestamp=2018-10-13T14:31:17.549+0000) Aber nur weil man aus Frust Leute die 1/7 Stehen sagt das die scheise gespielt haben?\n\nWas bringt es jemanden das zu sagen? Nichts. Zieht nur die Stimmung noch weiter runter, der Spieler weiß eh schon, dass es nicht sein bestes Spiel ist und wegen so einer nutzlosen Aussage vermiest du ihm die seine schlechte Stimmung weiter. Völlig unnötig solch ein Verhalten. Wenn es dich frustet mach nach so einem Spiel ein paar min Pause, aber lass doch solch unnötigen Flame.","replies":[]},{"poster":"Amycos Cyrus","date":"2018-10-13T19:20:55.023+0000","up_votes":2,"down_votes":0,"body":"Aspekt Geld: Art 4 der AG und damit hat sich das auch erledigt.\nStrafsystem inklusive Strafgründe: Art 5 der AGB und damit hat sich das auch erledigt.\n\nUnd für alle, die denken, sie müssten sich nicht daran halten hier ein Zitat aus der AGB Einführung:\n\n> Bitte lies die Bestimmungen dieser Vereinbarung sorgfältig. Mit dem Anklicken der nachstehenden Schaltfläche „Ich stimme zu“ oder mit der Nutzung der Riot-Dienste stimmst du zu, dass diese Vereinbarung ebenso durchsetzbar ist wie ein von dir unterzeichneter schriftlicher Vertrag.\n\nUnd für alle, die den Kram nochmal nachlesen wollen; https://euw.leagueoflegends.com/de/legal/termsofuse","replies":[]},{"poster":"VIP tombtomb","date":"2018-10-13T14:50:07.353+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=iKyun,realm=EUW,application-id=KYnfKGf0,discussion-id=Tq2dQQyM,comment-id=,timestamp=2018-10-13T14:31:17.549+0000)\n>\n> Leute die durch was auch immer gebannt wurden haben nicht nur viel seiner Lebens Zeit sondern auch sein Geld verloren. Man muss dauert Weise sagen das so etwas nie eine L&amp;ouml;sung ist.\n\nNaja, es gibt genug andere Situationen, wo das auch der Fall sein kann. Zum Beispiel, wenn man irgendwo hausverbot bekommt. Läuft im endeffekt aufs gleiche raus, außer dass das Hausverbot nur an einen Acc gebunden ist. \n\n> \n> Es bringt nur wut womit man mit neuen Accounts neue Spieler zu Trollen damit diese aufh&amp;ouml;ren zu spielen um lol eine rein zu dr&amp;uuml;cken. Bzw mit lvl 30 dann mit Absicht Leuten das ranked zu versauen. \n\nWenn man sich einen neuen Account erstellt, nur um das gleiche nochmal zu machen, ist der Bann mMn. definitiv begründet und auch gut.\n\n> \n> Viele dieser &amp;#039;b&amp;ouml;sen&amp;#039; Menschen k&amp;ouml;nnte dein bester Kumpel sein der nur emotional wurde.  Was ist denn schon dabei Leute zu schreiben das sie schlecht sind. Oftmals wissen die Leute selber das sie selber oft auch der flashenhals sind und bemitleiden sich nur selber und lasse es an andere raus.\n\n1. Tut es nichts zur Sache, ob der gebannte in einem Persöhnlichem Kontakt mit jemand anderem besteht und \n2. Ich selbst schreibe auch sehr oft den leuten meine Meinung zu ihrem Spielstil, manchmal agressiver und manchmal netter. Trotzdem bin ich in fast allen fällen nicht beleidigend. Und wenn man Kritik äußert, dann ist das ja nicht schlechtes, man muss sie halt konstruktiv zum Ausdruck bringen. \n> \n> Ich finde ein 14 Tage bann f&amp;uuml;r Beleidigung gerechtfertig. Aber ein perma bann?\n> Das finde ich nicht gut.\n\nDa sind wir anscheindend unterschiedlicher Meinung. \n> \n> Perma bann sollten Leute nur bekommen wenn die in &amp;uuml;ber 30% ihrer spiele mit Absicht afk rumlaufen bzw lang nur rumstehen oder nur afk Farmen im jgl und das auch sagen das die nun &amp;quot;afk Farmen&amp;quot;\n\nIch frage mich, warum man nicht AFK farmen kann? Ich habe lieber einen Jngler, der AFK-farmt, als einen der 0/16 steht. Und inwiefern ist es denn bitte weniger störend, wenn man AFK ist, als wenn jemand intet oder anderen Menschen den Spaß am SPiel raubt, weil er mal wieder mehr Anschläge auf der Tastatur im Chat hast, als mit dem Mauszeiger.\n> \n> Oder Leute die mit Absicht sehr rassistisch vorgehen bzw einen Krebs w&amp;uuml;nschen.\n> So was ist eher etwas das man permanent bestrafen kann. \n\nSo sieht Riot das auch und hat eine Null-Toleranz-Politik dem gegenüber. \n> \n> Aber nur weil man aus Frust Leute die 1/7 Stehen sagt das die scheise gespielt haben? \n> Nein.  \n\nDoch, das ist aber wie gesagt nur meine Meinung. \n> \n> Das ist unter der Menschen w&amp;uuml;rde und auch veruntreuung des fremden Geldes wo man kein Zugang mehr zu hat.\n\nWürde jeder die AGBs durchlesen, bevor er sich einen Account erstellt würde dieser Punkt sich erübrigen.\n1. hast du eine Leistung für dein Geld bekommen, auch wenn sie virtuell und unbegrenzt verteilbar ist, also einen Wert von 0 hat.\n2. Ist das definitiv nicht unter der Menschenwürde, jemanden anhand von Richtlinien zu bestrafen, die öffentlich einsehbar sind. \n> \n> Mein Vorschlag ist nun das perma gebannte Leute zu Anfang einer Season entbrannt werden.mit Einschr&amp;auml;nkungen.\n> \n> Zb k&amp;ouml;nnen die nur 2x ranked am Tag spielen f&amp;uuml;r die ersten 3 Monate. Um zu gucken ob diese sich verbessert haben und dankbar sind ihren Account wieder zu haben.\n\nMan kann über so ein System bestimmt nachdenken, allerdings würde ich persöhnlich das nach dem 14 Tage Bann einschalten. \n> \n> Ich f&amp;auml;nde das ne gute Sache da sicherlich Leute dabei sind die &amp;uuml;ber die Zeit eingesehen haben und sich verbessert haben.\n\nDann wären sie nicht perma Gebannt. \n> \n> Ich wei&amp;szlig; es gibt Nun viele die sagen &amp;quot;blo&amp;szlig; nicht&amp;quot; aber was ist daran so verwerflich? Menschen machen Fehler und haben Chancen verdient.\n\nDeswegen bekommt jeder von Riot mehrere Chancen. Die erste Chance bekommt man wenn man sich den Account erstellt. Die zweite und dritte bekommt man durch die Chatrestrictionvund die vierte und letzte durch den 14 Tage Bann. \n\nLG tombtomb\n\n*ich entschuldige mich schonmal für jegliche Rechtschreibfehler.","replies":[]},{"poster":"Abasin","date":"2018-10-18T13:36:20.150+0000","up_votes":1,"down_votes":0,"body":"> Leute die durch was auch immer gebannt wurden haben nicht nur viel seiner Lebens Zeit sondern auch sein Geld verloren.\n\nZweimal falsch.\n\nDie Lebenszeit hast Du mit dem Spiel verbracht und dabei eine Menge Spass gehabt. Ist also nicht verloren. Auch nicht in der Retrospektive. Was tatsächlich verloren wurde ist die Möglichkeit, so wie bisher weiterzumachen.\n\nWenn Du allerdings der Ansicht bist, ein Neuanfang auf einem Smurf ist reine Zeitverschwendung und dann machst Du es doch, dann ist das wirklich Zeitverschwendung. Und auch hier steht wieder Deine konkrete Entscheidung für Dein Handeln davor. \n\nDas Geld ist auch nicht verloren, Du hättest es ja nie ausgeben müssen. Auch hier hast Du wieder entschieden, das Geld für einen Dir seinerzeit wichtigen Zweck auszugeben. Und Du hast ein positives Nutzererlebnis erfahren.\n\nUnd wäre da nicht dieser blöde selbstverschuldete Bann, dann käme dieses \"Verlustgefühl\" auch nicht auf.","replies":[]},{"poster":"GahExecuter","date":"2018-10-13T14:44:40.454+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=iKyun,realm=EUW,application-id=KYnfKGf0,discussion-id=Tq2dQQyM,comment-id=,timestamp=2018-10-13T14:31:17.549+0000)\n>\n\n> Aber nur weil man aus Frust Leute die 1/7 Stehen sagt das die scheise gespielt haben? \n\nDas muss nicht zwingend die Schuld des Spielers sein.\nIch hatte soeben ein Spiel als Support wo zum einen der ADC sich wie ein Anfänger verhalten hat, damit gingen 4 kills an die gegnerische botlane. Ausserdem war das Team absolut unfähig zu irgendwelchem Teamplay.. somit war ich als Support zum einen nutzlos, hatte kein income und zum anderen sterbe ich wenn ich mich exponiere aber die Mitspieler sich nicht einigermassen sinnvoll verhalten.\nSomit habe ich das Spiel gefeedet, war underleveled etc (scores um die 0/7/0).\nDas Spiel zuvor haben wir 4v5 gewonnen, im nächsten hatte ich ein S-...\nDas Scoreboard alleine sagt nicht alles.","replies":[]},{"poster":"ΔRC RΔFUNZΞL","date":"2018-10-13T14:41:54.112+0000","up_votes":1,"down_votes":4,"body":"fände ich gut, ich finde auch das trashtalk einfach nicht gepermabannt werden sollte, das ist teil des spiels und es macht in manchen spielen einfach mehr spaß als das spiel für sich. \"kys\" o.ä. ist was anderes.","replies":[]},{"poster":"AdministraTHOR","date":"2018-10-13T14:45:30.217+0000","up_votes":1,"down_votes":6,"body":"Riots Banverfahren ist sowieso weird wenn man mal ehrlich ist.\nGrößtenteils kann ich viele Bans nachvollziehen und unterstütze diese auch.\nUnd deiner Aussage demnach kann ich auch einige Dinge an für sich unterstützen.\n\nWie gesagt das Bannverfahren ist wirklich komisch, mein Smurf wurde laut Riots Aussage gebannt wegen \"ungereimtheiten\".\nNach langer Diskussion dass ich nicht mal weiß, wieso weshalb und warum hätte ich oder jmd. darauf angeblich gescriptet.\nSelbst in Supporttickets wenn man Sie darauf anspricht widersprechen Sie sich teilweise selbst zu ihren letzten Aussagen {{champion:48}}","replies":[]}]}