{"poster":"DarkestBlood4","date":"2019-02-05T00:09:48.258+0000","title":"Como evitar ser baneado y que es reportable en este juego + Explicación detallada","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":1,"body":"**Bienvenidos**\r\n\r\n {{sticker:slayer-jinx-wink}} \r\n\r\nBuenas gente de Latam, espero les vaya bien hoy, en este post les dar&eacute; consejos para evitar ser baneados en el juego (Obviamente respetando el c&oacute;digo del invocador), adem&aacute;s de que usare los c&oacute;digos de el antes mencionado para poner en demostraci&oacute;n las actitudes deportivas y las antideportivas (Lo que debes hacer y lo que no), junto a la explicaci&oacute;n detallada.\r\n\r\nSecci&oacute;n 1: &iquest;Como evitar ser baneado de forma correcta y legal?\r\nTipos de conductas correctas\r\nCosas que hacer para mejorar estas actitudes\r\n\r\nSecci&oacute;n 2: &iquest;Qu&eacute; cosas son reportables en este juego?\r\nTipos de conductas incorrectas\r\nEl c&oacute;digo del invocador\r\n\r\nSecci&oacute;n 3: Actitudes irracionales\r\nLos Cry-posts (Posts de quejas) de gente antideportiva\r\nLa gente que culpa a Riot por no banear a los antideportivos\r\n\r\n**&iquest;Como evitar ser baneado de forma correcta y legal?:**\r\n\r\nLos jugadores de League of Legends muchas veces se preguntan que deben hacer para evitar ser baneados, as&iacute; que en estos puntos explicare los tipos de conducta que evitan estos baneos, adem&aacute;s de mencionar que se puede hacer para mejorar estos &uacute;ltimos.\r\n\r\n**Tipos de conductas correctas:**\r\n\r\n1- Respeto entre los jugadores: Cada jugador esta en el derecho de hablar con los dem&aacute;s jugadores, siempre y cuando no uses palabras hirientes o busque alg&uacute;n tipo de da&ntilde;o emocional a los dem&aacute;s jugadores de su equipo o del equipo contrario.\r\n\r\n2- Concentraci&oacute;n en la partida: Lo importante en este juego es divertirse (La mayor&iacute;a lo sabe), pero si quieres mantener ese estatus-quo de buena onda en el juego, debes concentrarte en el partida, **Ojo**, no dije ignorar actitudes antideportivas, en caso de que alguien desobedezca las reglas del juego y o te trate mal a ti o a alguien m&aacute;s, debes seguir jugando hasta que se termine la partida y puedas hacer el reporte correspondiente, tu puedes meterte en la conversaci&oacute;n del que esta actuando de mala manera siempre y cuando no insultes y respetes a los dem&aacute;s (Incluso si ese jugador no lo hace, ya que recibir&aacute; su correspondiente sanci&oacute;n)\r\n\r\n3- Juego sin programas de terceros que dan ventajas(Hacks): Esto es un tema serio, ya que quienes usan estos programas se est&aacute;n dando ventajas injustas frentes a los dem&aacute;s jugadores, se que dir&aacute;n: &quot;Pero con los hacks solo pueden sacar RP, osea campeones y skins&quot;.\r\n\r\nBueno, a eso voy, si uno obtiene ventajas de forma ilegal frente a los dem&aacute;s jugadores, esta tomando ventaja de los que si respetan las reglas y obtienen sus objetos del juego de forma correcta.\r\n\r\n**Cosas que hace para mejorar estas actitudes:**\r\n\r\n1- Aprende a respetar a los dem&aacute;s: No insultes y trata bien a los dem&aacute;s jugadores, as&iacute; generaras un mejor entendimiento entre todos.\r\n\r\n2- Ignorar si no estas con buen humor: Si ya no estas en un estado en el que puedas mantener la calma como el Tilteo (Estado de enojo), intenta evitar hablar con los dem&aacute;s, ya que se te pueden escapar malas palabras que te lleven a una sanci&oacute;n.\r\n\r\n3- No uses hacks: Date la oportunidad de conseguir las cosas por ti mismo, quieres un campe&oacute;n o una skin? Juega y gana cofres para obtenerlos, como digo yo: &quot;Si tienes todo, te aburrir&aacute;s de lo que tienes y ya no sera divertido&quot;.\r\n\r\n**&iquest;Qu&eacute; cosas son reportables en el juego?:**\r\n\r\nHay distintas razones para ser sancionado en este juego, las cuales explicare en los siguientes puntos.\r\n\r\n**Tipos de conductas antideportivas:**\r\n\r\n1- Insultar o tratar mal a tus compa&ntilde;eros o a los rivales: A menos que estemos en el Call of Duty (Carlos Duty conocido por muchos xd), tienes que respetar a los dem&aacute;s jugadores y evitar insultarlos o tratarlos de mala forma.\r\n\r\n2- Quedarse AFK (Lejos del teclado): Qu&eacute; es esto? Es cuando uno decide dejar la partida desde el inicio o en el transcurso de ella, lo cual perjudica a tu equipo y es sancionable (Tanto que tienen un sistema que se encarga de sancionar a los que lo hagan automaticamente :3).\r\n\r\n3- Fedear (Dar nivel y oro) al rival: Esta conducta es muy toxica (Molesta), ya que el jugador que la hace le esta dando ventaja a los dem&aacute;s.\r\n\r\n4- Usar hacks: Ya lo mencione explicando que no se debe usar, as&iacute; que esta la salto.\r\n\r\n**El c&oacute;digo del Invocador:**\r\n\r\nEste es el c&oacute;digo de conductas y normas que debe seguir un jugador en el juego, existen 9 c&oacute;digos en este ultimo, los cuales son:\r\n\r\n1- Apoya a tu equipo: si ves que tus compa&ntilde;eros est&aacute;n en problemas intenta ayudarlos, no digo tirarse en un 2 vs 5 para ayudar a un compa&ntilde;ero, sino que ayudes cuando puedas, y si alguno de tus compa&ntilde;eros te reprocha por no ayudar en un momento en el que no era posible, expl&iacute;cale tranquilamente la raz&oacute;n del porque no pod&iacute;as ayudar.\r\n\r\n2- Realiza criticas constructivas: Crees qu&eacute; tu compa&ntilde;ero no dio lo mejor de si mismo? Fallo en algo que podr&iacute;a haber logrado?.\r\n\r\nExpl&iacute;cale (De forma respetuosa) los errores que cometi&oacute; y lo que puede hacer para mejorar en ello.\r\n\r\n3- Facilita las discusiones: No se refiere a discutir de mala forma, sino a facilitar el dialogo entre jugadores para llegar a una buena convivencia, **Ojo**, esto es aplicable a que te quiten una sanci&oacute;n de esta tem&aacute;tica siempre y cuando hayas hablado de forma respetuosa con los dem&aacute;s jugadores y hayas demostrado tus puntos de vista de igual forma.\r\n\r\n4- Disfruta, pero no a expensas de los dem&aacute;s: A qu&eacute; se refiere esto? A que no es lo mismo hacerle una broma que puede ser insultante a un amigo a que se lo digas a alguien que no conoces, ya que se lo puede tomar de mala forma.\r\n\r\n5- Fomenta las relaciones: El trabajo en equipo y el compa&ntilde;erismo son lo ideal para mantener un buen juego, as&iacute; que no te olvides de respetar y disfrutar del juego junto a tus aliados.\r\n\r\n6- Ten humildad en la victoria y deportividad en la derrota: B&aacute;sicamente, que si le ganas a otro jugador no uses frase ofensivas y degradantes, sino que menciones que fue un buen juego y que jugaron bien los dem&aacute;s jugadores, al igual que si pierdes no trates mal a los dem&aacute;s por ello, es un juego en el cual el respeto es lo fundamental.\r\n\r\n7- Se decidido y no te irrites: Manten la calma y conc&eacute;ntrate en dos cosas, el destruir el nexo y el buen trato entre todos.\r\n\r\n8- &iexcl;No dejes a los novatos atr&aacute;s!: Todos iniciamos desde abajo, as&iacute; que si quieres ayudar a mejorar el juego debes ayudar primero a los que inician en esto, dales apoyo como consejos y explicaciones de como mejorar.\r\n\r\n9- Predica con el ejemplo: Has lo correcto usando el ejemplo de lo correcto para transmitir ese mensaje a los dem&aacute;s.\r\n\r\n**Actitudes irracionales:**\r\n\r\nEstas actitudes son irracionales ya que no constan de un sentido valido (Excepto si se presentan pruebas, pero no ocurre que todos los casos sean reales)\r\n\r\n1- Los Cry-Posts de gente antideportiva: Si cometes una falta del c&oacute;digo del juego, tienes que aceptar la culpa y no poner excusas, ya que si se te sanciono, fue por una raz&oacute;n.\r\n\r\n2- La gente que culpa a Riot por no banear a los antideportivos: En este tema me pondr&eacute; neutral, es cierto que aveces los moderadores cometen errores en cuanto a sanciones, pero hay que entender que son humanos y que al igual que todo cometen errores, si un moderador da una sanci&oacute;n que te parece que es injusta, expl&iacute;cale de buena forma tu punto de vista y las razones de que esta mal esa sanci&oacute;n, esta en el decidir si escucharte tus puntos y darlos como validos, y recuerden, no se pueden sancionar a todos, ya que siempre va a haber gente que har&aacute; lo incorrecto (Es como lo del bien y el mal, debe existir mal para que haya bien y viceversa).\r\n\r\nBueno gente, hasta aqu&iacute; llego el post, espero les haya gustado :D\r\n\r\n{{sticker:slayer-jinx-catface}}","replies":[]}