{"poster":"BTS Tae","date":"2018-06-10T16:22:29.065+0000","title":"Dark star lucian","subforum":"Skin- & Champion-Konzepte","up_votes":6,"down_votes":2,"body":"Hallo liebe riot mitarbeiter \n\nIch w&uuml;rde mich &uuml;ber einen dark star lucian skin sehr freuen weil es einfach richtig gut zu ihm passen w&uuml;rde  und weil Lucian gerade meta ist und , ich w&uuml;rde mir das ungef&auml;hr so vorstellen\n\nDas aussehen: er h&auml;tte einen &auml;hnlichen kopf wie dark star varus , hinten am kopf so lila schwarzen sternenstaub (so &auml;hnlich wie bei dark star varus) sein k&ouml;rper lila schwarz und das sein mantel auch aus lila schwarzen sternenstaub besteht. Bei den Waffen das sie aussehen wie zwei k&ouml;pfe schwarz und ganz vorne ein bisschen lila und sie halt lila schwarze ,,sterne,, schie&szlig;en und das seine autoattacks und seine stimme anders ist\n\nF&auml;higkeiten:\nPassiv: das sie lila leuchten und seine auto attacks etwas gr&ouml;&szlig;er werden\n\n auto attack: blau schwarze sch&uuml;sse\n\nQ: ein strahl der lila und ein kleines bisschen orange oder blau ist \n\nW: dass er ein dark star verschie&szlig;t der am ende sich ,,ausbreitet,, und auch lila und ein bisschen orange und blau oder schwarz ist \n\nE: wenn er nach vorne dasht das hinter ihm eine kleine schwarz lila spur auftauchst und seine waffen lila schwarz leuchten\n\nR: dass er viele kleine dark stars verschie&szlig;t die blau schwarz sind\n\nSeine emotes ,tanz und lachen  k&ouml;nnte gleich bleiben \n\nSein backport: das er vielleicht mit seinen waffen auf den boden schie&szlig;t dass dann ein schwarzes loch entsteht und dann reinspringt \n\nPreis:1350rp\n\nW&auml;re echt cool wenn er rauskommen w&uuml;rde, ich w&uuml;rde ihn mir direkt kaufen und ich denke das sich viele andere spieler sich den auch kaufen w&uuml;rden","replies":[{"poster":"Tempellord29","date":"2018-06-10T16:53:06.070+0000","up_votes":4,"down_votes":0,"body":"das ist echt eine gute idee,ich würd mir ihn sofort kaufen auch wenn ich nicht adc-main bin..trotzdem einfach aus prinzip würd ich ihn kaufen. aber meiner meinung nach fehlt noch ein darkstar-support skin. also dark star botlane halt..zum beispiel für braum oder so. ","replies":[{"poster":"INoKami","date":"2018-06-10T18:38:27.397+0000","up_votes":1,"down_votes":0,"body":"_*_ _hust_ _*_ Dark Star Thresh _*_ _hust_ _*_","replies":[{"poster":"Tempellord29","date":"2018-06-10T20:55:52.319+0000","up_votes":1,"down_votes":0,"body":"omg ich mein damit das es eine coole idee wär eine zweite darkstar-{{sticker:zombie-brand-facepalm}} botlane raus zubringen wie bei poolparty draven mit lulu und leona mit missfortune.","replies":[]}]}]},{"poster":"xFireginx","date":"2018-06-10T20:36:29.284+0000","up_votes":3,"down_votes":0,"body":"OMG das wäre der beste skin ever. Ich würde mir den direkt kaufen, sogar für 1820. Wenn Riot das rausbringt sind sie Ehrenmänner und es gibt einen kuss auf die Nuss.","replies":[]},{"poster":"BlackNess78","date":"2018-06-10T18:26:27.741+0000","up_votes":2,"down_votes":0,"body":"Die sache ist... es ist eine gute idee jedoch glaub ich eher nicht dass Riot davon inspierien würde habs schon versucht + Abstimmung  von einen Dark Star Lee sin und die abstimmen war ja:136 Nein:2 Vllt:365 aber Riot tut es anscheinend nicht so intressieren","replies":[{"poster":"BTS Tae","date":"2018-06-10T19:42:10.658+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BlackNess78,realm=EUW,application-id=L7E6lhzo,discussion-id=mmqHXPYQ,comment-id=0001,timestamp=2018-06-10T18:26:27.741+0000)\n>\n> Die sache ist... es ist eine gute idee jedoch glaub ich eher nicht dass Riot davon inspierien würde habs schon versucht + Abstimmung  von einen Dark Star Lee sin und die abstimmen war ja:136 Nein:2 Vllt:365 aber Riot tut es anscheinend nicht so intressieren\n\ndas wäre echt schade :/","replies":[]}]},{"poster":"Shotroqu","date":"2018-06-10T19:30:03.234+0000","up_votes":2,"down_votes":0,"body":"Man, da hast du aber sicherlich lange dran gearbeitet, ich finde die Fähigkeiten sehr schön durchdacht und der Preis ist auch passend. Ich würde mir den Skin sehr gerne kaufen, doch erst müsste ich wohl noch etwas mit {{champion:236}} trainieren. ;)","replies":[{"poster":"BTS Tae","date":"2018-06-10T19:33:12.006+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Shotroqu,realm=EUW,application-id=L7E6lhzo,discussion-id=mmqHXPYQ,comment-id=0002,timestamp=2018-06-10T19:30:03.234+0000)\n>\n> Man, da hast du aber sicherlich lange dran gearbeitet, ich finde die Fähigkeiten sehr schön durchdacht und der Preis ist auch passend. Ich würde mir den Skin sehr gerne kaufen, doch erst müsste ich wohl noch etwas mit {{champion:236}} trainieren. ;)\n\nfreut mich das er dir gefällt :){{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"raymanhh","date":"2018-06-11T19:35:36.506+0000","up_votes":1,"down_votes":1,"body":"Dies ist ein interessantes Konzept mein lieber, aber ich finde dies ist nicht umsetzbar wie du es aufgeschrieben hast. Zu eins da die Sinuskurve der Parralele und der Ankarthete zur Ultimate nicht Rechtwinklig sind können die Pixel dort schonmal nicht auf blau/schwarz geändert werden. Zu der Q und dem Rest…. die sind sehr gute Ideen, ABER da diese Gleichungen Negativ am ende sind und man keine Wurzel ziehen kann, kriegt man keine Nullstellen und wiederum das bedeutet, dass der Graph Positiv ist und c über 0 sein muss und ax² positiv. Wie du siehst habe ich es geometrisch und Programmetisch bewiesen, dass deine Idee leide nicht umsetzbar ist. \n\nMFG\nraymanhh\n\nPS: Ihr könnt mich gerne Adden für weitere exponentialrechnungen zu diesem Konzept von Skin!","replies":[{"poster":"INoKami","date":"2018-06-11T20:31:01.723+0000","up_votes":1,"down_votes":0,"body":"Hey... ist zwar nicht ganz das selbe... aber könntest du mal das für meine Konzepte machen? Nur mal aus Interessen, will mal schauen, was da so für Rechnungen dabei heraus kommen :)","replies":[]}]}]}