{"poster":"Corvis Rex","date":"2016-02-25T14:07:54.366+0000","title":"Zwängen Soraka","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hey liebe Spieler, es geht mir zzt um folgendes Problem.\r\nDurch den damaligen REWORK von Soraka, wurde sie auf die Support lane verbannt, ohne eine andere Position vern&uuml;nftig spielen zu k&ouml;nnen. Dies fand ich dato schon sehr unfair. Andere Champions wie Karma, Lissandra, Elise usw k&ouml;nnen schlie&szlig;lich auch mehrere Postionen ausf&uuml;llen, was den Champion dann auch abwechslungsreicher macht.\r\nIch habe dann nach dem Rework trotz allem Soraka ab und an auf der Toplane gespielt. Wenn man ihre Q gut getimed hat und mit dem inneren Kreis traf war sie echt spielbar. Sie brachte ein wenig dmg, ein bisschen tankyness und f&uuml;rs late Heal mit!\r\n\r\nNun wird sie jedoch weiter generfed in Sachen DMG. Da der innere Kreis nun nicht mehr den Zusatzdmg macht, sondern nur noch slowed, ist sie nur noch als Supporter zu gebrauchen. Bei Nami war es damals &auml;hnlich, wenn man sie ge&uuml;bt hat und sicher mit ihrer Q war, konnte man sie gut in der Mitte spielen. Dann kam jedoch ihr Nerf auf ihrer W. Die Abklingzeit wurde so hoch gesetzt, dass sie in der Mitte bei einem gank kaum noch Chancen hat.\r\n\r\nWas denkt ihr dar&uuml;ber? Finde es schade das manche Champions auf eine Lane verbannt wird.\r\n\r\nLG :)","replies":[{"poster":"Cyrilya","date":"2016-02-25T14:23:14.827+0000","up_votes":1,"down_votes":0,"body":"Ich finde die PBE-Änderungen absolut schrecklich. Warum wird schon wieder an Soraka rumgefummelt. \nSie haben ihr nun schon einen Nerf verpasst inkl. des Entfernen des Effekts auf der Ulti, das Klaffende Wunden entfernt werden. \n\nIch find Soraka so gut, wie sie immo ist. Sie brauch keine Changes. \nUnd überstark ist sie auch nicht. Man muss nur wissen wie man Focused. \n\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"TerrorRaven","date":"2016-02-25T17:59:27.312+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cyrilya,realm=EUW,application-id=Wj1wcocU,discussion-id=08deAcqu,comment-id=0002,timestamp=2016-02-25T14:23:14.827+0000)\n>\n> Ich finde die PBE-Änderungen absolut schrecklich. Warum wird schon wieder an Soraka rumgefummelt. \n> Sie haben ihr nun schon einen Nerf verpasst inkl. des Entfernen des Effekts auf der Ulti, das Klaffende Wunden entfernt werden. \n> \n> Ich find Soraka so gut, wie sie immo ist. Sie brauch keine Changes. \n> Und überstark ist sie auch nicht. Man muss nur wissen wie man Focused. \n> \n> {{sticker:zombie-brand-facepalm}}\n\nIch verstehe nicht so ganz, was an den Änderungen schrecklich sein sollen?\n\nIhr Q kostet weniger Mana, hat weniger Cooldown und slowt auch Gegner, die nicht im Zentrum stehen. Gut, der Bonusschaden wurde entfernt, aber ein Supporter muss nicht zwangsweise Schaden machen.\nLediglich der Buff, den sie bekommt, müsste noch ein wenig ausgebessert werden, da sind die aber noch am experimentieren (mal hat sie damit Leben und Mana wiederhergestellt, mal bekam Lauftempo dazu und nun bekommt man Lauftempo, wenn man nicht auf Gegner zuläuft).\n\nWartet einfach mal ab, was mit ihr passieren wird.","replies":[]}]},{"poster":"Shacoláde","date":"2016-02-25T14:20:35.615+0000","up_votes":1,"down_votes":0,"body":"Ich versteht dich, dass du Champs wie Soraka und Nami gern, variable einsetzten willst.\nSoraka ist aber dafür ausgelegt, rein als Supp zu fungieren.\nSie kann sich selbst nur mit dem Q healen. Sein aktiven Heal kann sie nur auf andere einsetzten.\nR ist global heal. Da ist es fast unmöglich sie auf andere Line, alleine wegen ihreren Fähigkeiten zu spielen.\nSogar wenn du die Skalierung und den dmg anpasst, wird es schwer genug sein. \nWürde sie aber wieder gebufft, siehst sie halt wieder nur noch BOt jedes Game wie nach dem Rework.\nIch find es in Ordnung so wie sie ist. \nGleiches gilt eigentlich für Nami. Durch die neue Mastery durch Patch 2.4 wird sie als Supp warscheinlich wieder öfter zu sehen sein.","replies":[{"poster":"Alustus","date":"2016-02-25T15:11:03.506+0000","up_votes":1,"down_votes":0,"body":"> Gleiches gilt eigentlich für Nami. Durch die neue Mastery durch Patch 2.4 wird sie als Supp warscheinlich wieder öfter zu sehen sein.\n\n\nGlaube ich nicht, momentan passt nami nicht in die meta, da müsste generell viel verändert werden. (Meiner Meinung nach)\n\nBotlane matchups sind für sie meistens schlecht, ihr cc ist leicht auszuweichen und sie ist leicht zu bursten.\nAdc sind momentan mobil und die supporter haben viel cc wenn nami 1 mal erwischt wird ist sie tot.\nSie ist außedem gegen gank anfällig.\n\nMan müsste sie also weit hinten stehen und nur heilen und da ist Soraka die bessere alternative.\n\nIch persönlich würde gerne nami spielen aber sie ist einfach momentan zu risikoreich bzw. es gibt kaum matchups bei denen sie gut reinpasst.","replies":[{"poster":"Corvis Rex","date":"2016-02-25T16:22:03.245+0000","up_votes":1,"down_votes":0,"body":"Ich denke mit Ezreal, gibt sie immernoch ein hervorragendes Matchup ab.","replies":[{"poster":"Alustus","date":"2016-02-25T17:27:54.728+0000","up_votes":1,"down_votes":0,"body":"naja gegen eine leona, thresh, alistar usw. ist nami sehr riskant.\n\n1 cc getroffen und nami ist geschichte, und hinten stehen bleiben und heilen kann soraka besser.\nDas soll jetzt nicht heißen das nami schlecht ist, aber ich finde das sie sehr riskant ist und meistens gibt es bessere lternativen.\n\nman müsste ihr mMn mehr tankyness geben.\nOder einen escape/mobility \n\nIn Teamfights kann sie hingegen ziemlich gut sein, aber die laningphase gefällt mir persönlich im moment nicht so.","replies":[]}]}]}]},{"poster":"Bemte","date":"2016-02-25T14:21:19.518+0000","up_votes":1,"down_votes":0,"body":"Problem ist, dass diese Champs ohne die Nerfs zu stark werden.\nDas sind halt Champs, die wirklich gut supporten können.\nChamps, die auch noch andere Positionen ausfüllen können, eignen sich dafür halt nur bedingt als Support, haben keinen so guten Heal,Peel,...\n\nIch find das voll ok, dass Champs die wirklich gut als Support sind nicht auch noch auf anderen Lanes überragend sind.\nEs gibt doch zum Beispiel auch eine ganze Reihe Midchamps, die man sonst nirgends sinnvoll spielen kann (Top sind die Gegner zu starke Tanks, Jungle ist man selbst nicht tanky genug, Bot nur wenn man nicht Meta spielen will).","replies":[]}]}