{"poster":"Voy Shaco","date":"2016-10-26T21:33:03.901+0000","title":"El LoL,¿\"fomenta\" la toxicidad?","subforum":"Charlas Generales","up_votes":4,"down_votes":3,"body":"Eso, ya que hay varias opciones para burlarte del enemigo ctrl 3,4 y 6, y el chat /All y el lobby al final, aunque obviamente, se supone que en /all te cag*s de risa con tu laner enemigo por un error tuyo por ejemplo, pero todos sabemos que no hay mucha gente que haga esto, en su mayor&iacute;a los jugadores usan el /All para decir cosas como &quot;QUERES QUE TE ARME CARPA, PEL*TUDO?&quot; o &quot;CON ESE CHAMP PARA P*TES CUALQUIERA&quot;.\n&iquest;Uds que dicen?\nEdit: Me faltó poner en el titulo \"con el enemigo\" xd","replies":[{"poster":"Desaroll","date":"2016-10-26T22:02:53.359+0000","up_votes":3,"down_votes":0,"body":"Hayo!\n\nSi vamos al caso, ¿El lenguaje fomenta la violencia verbal? ¿La anatomía humana fomenta la violencia física?\n\nLas herramientas no son inherentemente malas.\n\nLo malo es como las usan.\n\nSuerte!","replies":[{"poster":"JustoxGames","date":"2016-10-26T22:22:41.748+0000","up_votes":1,"down_votes":0,"body":"Hermosas palabras... Deberias escribir un libro ;-;","replies":[{"poster":"Desaroll","date":"2016-10-26T22:35:16.475+0000","up_votes":1,"down_votes":0,"body":"http://www.generadormemes.com/media/created/kys7yp78ohra12tsjf09pxdn9g2muid7gevrd0v6tv9geigb5tvpyhvgtjlcdlm.jpg","replies":[]}]}]},{"poster":"martincarp","date":"2016-10-26T21:40:19.086+0000","up_votes":2,"down_votes":0,"body":"Las personas tóxicas y negativas que ya son así en la vida cotidiana, lamentablemente también vienen y lo son en el juego, sumados a las personas que utilizan el juego para descargarse y hacer catarsis (el anonimato de Internet es el culpable, no el juego en si), hacen que un porcentaje bastante elevado hagan lo que tu dices durante las partidas.\n\nPero que utilicen esas herramientas no quiere decir que Rito lo fomenta, sino que son las herramientas que los negativos encuentran para explotar. Si las eliminaran o las limitaran, encontrarían otro modo de descargar la frustración, bronca e ira, y simplemente seguirían contribuyendo a la negatividad en las partidas por otro medio.","replies":[]},{"poster":"Omnipaws","date":"2016-10-26T21:39:30.038+0000","up_votes":2,"down_votes":0,"body":"Si el juego la fomenta claramente. Sino yasuo proyecto spameador de maestria 7 no existiria.","replies":[]},{"poster":"Tazztania","date":"2016-10-26T21:36:51.935+0000","up_votes":1,"down_votes":0,"body":"Es un tema complicado... pero si es cierto que hay veces en que el spam de risas o de ciertas acciones pueda irritar pero OJO, no solo al enemigo, a tu equipo también. Es casi un juego de quien es más tolerante jeje pero igual son herramientas que fueron diseñadas para otro proposito, creo que llevarlos al extremo de \"fomentar\" pues no se...","replies":[{"poster":"WKH4 Sans","date":"2016-10-26T22:03:59.474+0000","up_votes":1,"down_votes":0,"body":"Para mi tendria que ser reportable el disrespect, yo amenazo de trollear a la gente de mi equipo que hace disrespect, como es obvio si lo siguen haciendo no trolleare, pero la mayoria paran.","replies":[{"poster":"martincarp","date":"2016-10-26T22:15:41.899+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WKH4 Sans,realm=LAS,application-id=v7qsfXsE,discussion-id=wYHNQEGt,comment-id=00010000,timestamp=2016-10-26T22:03:59.474+0000)\n>\n> Para mi tendria que ser reportable el disrespect, yo amenazo de trollear a la gente de mi equipo que hace disrespect, como es obvio si lo siguen haciendo no trolleare, pero la mayoria paran.\n\nEl tema es que la única manera de comprobar si hubo disrespect o no sería viendo las partidas, y creo que sería casi imposible que todas las partidas donde hubo reportes por disrespect (creo que serían la gran mayoría) sean especteadas y analizadas por moderadores, además de que habría que analizar más de una partida por jugador reportado. Lamentablemente lo veo difícil de implementar.","replies":[{"poster":"WKH4 Sans","date":"2016-10-27T00:17:48.171+0000","up_votes":1,"down_votes":0,"body":"es imposible de implementar, pero, que este el boton. XD","replies":[]}]}]}]},{"poster":"Diosmo","date":"2016-10-26T22:44:08.337+0000","up_votes":1,"down_votes":0,"body":"Todo eso se solucionaria simplemente con un par de tips:\n\n- Chat (ya implementado): Uno puede mutear a quien sea molesto.\n- Maestria y otras animaciones: Asi si lo encuentras molesto, poder bloquear los comandos Ctrl + 1/2/3/4/6 de alguien.\n- Pings: Al igual que el anterior, poder bloquear pings del aliado. Un caso muy usado es el signo de (?) para indicarte que hiciste algo mal o que no le gusto y te lo spamea a mas no poder como si con esto fuera a hacerte mejor jugador.\n\nCon 3 simples puntos (y la desicion de uno de usarlos o no) se podrian evitar las molestias.","replies":[]},{"poster":"Sir Crucifix ","date":"2016-10-26T22:40:37.136+0000","up_votes":1,"down_votes":0,"body":"solo si el rival pickea brandifiora y su vals de fuego o VEIGAR , ese pj puede hacer que un bronce puro sea platino , eso si , si le sacas ese champ al mainer , termina 0/20 flameado , escupido y con rival honorable por hacerle ganar al otro equipo","replies":[]},{"poster":"WKH4 Sans","date":"2016-10-26T22:03:04.874+0000","up_votes":1,"down_votes":0,"body":"Despues de jugar por 4 años aproximadamente, y llegar a platino 2 he llegado a una conclusión:\n-El lol fomenta el suicido OOC.","replies":[]},{"poster":"Bienzahar","date":"2016-10-26T21:54:11.887+0000","up_votes":1,"down_votes":0,"body":"A mi da risa que se enojen tanto por un juego, pasa a ser ridiculo cuando lo hacen xD","replies":[]},{"poster":"arondightFTW","date":"2016-10-26T21:45:08.605+0000","up_votes":1,"down_votes":0,"body":"No, siempre se encuentra algo para molestar.","replies":[]},{"poster":"RaResz","date":"2016-10-26T21:35:13.509+0000","up_votes":2,"down_votes":2,"body":"El odio y la toxicidad ya está en cada persona. El juego no tiene nada que ver!","replies":[]}]}