{"poster":"ManuelAlcayaga","date":"2018-12-25T23:38:47.324+0000","title":"Esta navidad queríamos regalar 10 skins pero Riot no nos deja..","subforum":"Off-topic y temas personales","up_votes":87,"down_votes":7,"body":"https://i.imgur.com/GpHXwJZ.jpg\n\nEl día de ayer mi amigo \"Rebel Clown\" miembro del grupo \"filantropos\" publicó un post en donde regalaba 3 skins a la comunidad, es la octava vez que regala skins en el foro, lleva años aportado con RP para iniciativas de ayuda a la comunidad y beneficencia:\n\nhttp://oi68.tinypic.com/2ugp0cx.jpg\nhttps://i.ibb.co/vZmKbrc/zPlUWtk.png\n\nPueden revisar nuestras iniciativas y confirmar que tenemos un historial totalmente transparente y confiable, siempre mostramos evidencia de que entregamos los premios.\nsin embargo a los 10 minutos de haber publicado su post se lo censuran, lo banean y le dan este motivo:\n\nhttps://i.imgur.com/lUwR8dx.jpg\n\n**Lo curioso es que las reglas NO prohiben sorteos en el foro** (lo que SI está prohibido es usar sorteos como publicidad para canales), aunque esta regla nunca se ha respetado, basta con buscar en el foro y puedes encontrar facil unos 20-30 post al mes de personas usando sorteos para publicitar canales.\nEsos post NO son censurados, pero si censuran y banean exclusivamente a mi amigo rebel clown\n\nhttps://i.ibb.co/NFwNnDf/XQplz3bl.jpg\n\n**[Riot PREMIA a los tóxicos con una oportunidad de conseguir las recompensas de temporada](https://boards.las.leagueoflegends.com/es/c/comportamiento-del-jugador/1k7ozEMK-gente-1-si-creen-que-riot-se-equivoca-con-la-nueva-polautica-de-recompensas),\npero CASTIGA censurando y baneando al jugador solidario que quiere ayudar a la comunidad.**\nRiot CONFÍA en que un jugador toxico va a reformarse dejando de ser egoista y flamer,\nPero NO CONFÍA en que un jugador que lleva años siendo solidario entregará un regalo de navidad..\n**¿Que debería hacer Rebel Clown entonces? ¿ganarse la confianza de Riot siendo toxico??**\n\nhttps://i.ibb.co/cCRrXBT/xtmqevL.jpg\n\nTeníamos pensado regalar 10 skins en navidad ademas de otros sorteos y premios, pero al parecer riot no quiere que ayudemos a la comunidad, supuestamente riot apoya el compañerismo, el honor y la solidaridad **pero parece que les importa mas que los tóxicos sigan jugando y comprando skins**, censuran mis post sin tener ninguna empatía por las [presuntas victimas de acoso sexual](https://boards.las.leagueoflegends.com/es/c/charlas-generales/L7f2K8kx-director-de-riot-acusado-de-acoso-sexual-es-sancionado-pablicamente-censurado-resubido), me tratan [pésimo](https://i.imgur.com/ruNheCN.png) en soporte y ahora censuran a mis amigos, me cuesta creer que no exista una mala intención.. espero que sea un error.\n\nFeliz navidad amigos, esperemos que la próxima navidad si nos permitan hacer regalos..\n{{sticker:zombie-nunu-bummed}}","replies":[{"poster":"ImNw","date":"2018-12-26T00:42:02.891+0000","up_votes":21,"down_votes":1,"body":"Habria que llevar a reddit o contactarse con la central, es un asco la moderacion de este foro","replies":[]},{"poster":"MILFortune","date":"2018-12-25T23:50:01.896+0000","up_votes":19,"down_votes":2,"body":"Se cansaron de vos. \nQueridos Rioters , esperando que no hayan visto el post del sorteo y solamente haya sido borrado a causa de la clásica ineptitud de los que tienen moderando acá, ¿podrían permitir que este muchacho regale las skins? Presten atención a lo que les estamos pidiendo. Hay que pedirles permiso para ser amables. Hay que pedirles permiso para compartir, para generar expectativa, emoción. Cosas que hicieron grande a este juego y a su comunidad. Comunidad que, obviamente, hoy está diezmada. Es ahora convivencia. Donde la premisa nominal es \"tolerar\" a los demás- Ya se perdió el espíritu de ser amigos y generar relaciones y fortalecerlas en el juego. Esto ya no es un reclamo. Los reclamos están hechos. La salud deteriorada de los foros, la comunidad en general, es una realidad conocida. No podemos obligarlos a hacer algo al respecto si no quieren. En todo caso, concluirá la salud del juego al final de todo esto. El caso es que ahora nadie les está pidiendo nada. Es una ayuda gratis de la comunidad hacia la comunidad. Es como una autoreparación. Una herida que se cura sola. Si ustedes no permiten esto, entonces claramente el daño que sufre la comunidad viene desde sus manos. No es un enunciado trágico. Piensenlo un rato. Vos que sos rioter y tenés un tiempo acá laburando para mantener la máquina andando ¿cómo ves esto?","replies":[{"poster":"vaVav","date":"2018-12-26T00:16:41.242+0000","up_votes":7,"down_votes":6,"body":">  Vos que sos rioter y tenés un tiempo acá laburando para mantener la máquina andando ¿cómo ves esto?\n\ny es todo un tema","replies":[{"poster":"ˇOverlordˇ","date":"2018-12-26T00:38:54.920+0000","up_votes":2,"down_votes":6,"body":"Si es re jodido...","replies":[]}]}]},{"poster":"ISG gear","date":"2018-12-25T23:43:48.847+0000","up_votes":15,"down_votes":1,"body":"Me da mucha lastima ver censuras que le ocurren a estas personas por querer poner de sus PROPIOS medios para ayudar a la comunidad.            \n                  \n{{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"Mi Padre se fue","date":"2018-12-25T23:40:59.958+0000","up_votes":15,"down_votes":3,"body":"Me parece algo muy triste que RiotGames censure a la gente que de verdad quiere apoyar y hacer crecer al comunidad de manera positiva. Se sabe que andan con complicaciones debido a la unificación de los servidores pero por lo menos deberían dejarnos a nosotros los usuarios hacer nuestros \"Mini eventos\" en el foro. \n\nLa iniciativa de Filantropos es una iniciativa excelente, la comunidad que esta detrás de ella también, han intentado reiteradas veces ayudar a la comunidad y tuve la suerte de formar parte de uno de sus equipos de trabajo. Bastante profesionales y apañadores. Mucha suerte con el sorteo.\n\nFelices fiestas para todos. {{sticker:sg-miss-fortune}}","replies":[]},{"poster":"Shiny Yordle","date":"2018-12-26T03:31:18.520+0000","up_votes":12,"down_votes":1,"body":"No hables de Riot en general, el problema es Riot LAS.\nAcá se están haciendo bastante los boludos, estos últimos meses no hicieron nada, y como vos decís, te tratan para el culo.\nHace dos días mandé un ticket porq el Sistema de Baneos Automático me restringio el chat por básicamente haber hablado mucho.\nEl tema es que estaba defendiendo a un compañero q estaba siendo insultado por otro compañero, del frente le creían al flammer y yo me dediqué a explicarles la verdadera historia.\nCopio el chat para mostrar mí inocencia en soporte, pidiendo si podían devolverme el honor, y según ellos yo tuve una muy mala actitud, fui muy negativo, q yo si tuve lineas en las que flammeaba y q entienden mí forma de saltar al ser agredido.\nLes puse -disculpa no? Me encanta el copy paste. le mandé, veinte mil veces me mandaron mensajes parecidos, y lo que me mandaron no correspondía a los sucesos.\nMe decían que no me podían devolver el honor por haber reaccionado como no se debía. \nSon. Re. Pajeros los rioters de acá, otra de las cosas que les mandé fue, y me confirmaron, q no van a hacerse cargo de aquellos que defiendan a los flammers, van a dejar q el sistema elija si castigarlos o no, porque ellos no son los q pusieron el mal ambiente en el juego, pero si banean gente como yo q no insultamos ni atacamos y tratamos de calmar la situación o defender a un compañero q no hizo nada para q no lo reporten, y esto es razón de flammeo.\n\nVOLVIENDO AL POST\nAcá pasa exactamente lo mismo, se prohíbe la propaganda en sorteo, no los banean, pero SI banean a los q hacen un sorteo gratuito para los q no tienen, ayudando a la comunidad, mejorando el autoestima de otros, y hacer felices a más gente.\nPero parece que la norma de Riot LAS es hacer lo contrario.\n\nYo quiero sugerir un pequeño movimiento de supervisión a las oficinas de LAS.\nSe unirían para armar un post en r/leagueoflegends (Reddit) y tratar de hacerlo top trending? Para q más jugadores y otras oficinas vean como se manejan los rioters de acá\nEs la única forma de mejorar LAS, q manden supervisión y les pongan un límite a estos rioters, porque ellos siguen cobrando y gratis. Dejan todo en automático. O dejan q los forros hagan de las suyas. Porque el día en q me baneen la cuenta por ser buena persona, soy capaz de hacer un escándalo.","replies":[]},{"poster":"Nuke","date":"2018-12-26T00:07:16.727+0000","up_votes":14,"down_votes":3,"body":"Mira Riot, soy Nuke. Supuestamente yo acá aparezco e intento justificar tus cagadas. Pero esto no tiene sentido, si ustedes no van a regalar skins para navidad dejen que otros lo hagan. Y no lo digo por interesado en las skins (seguramente ni participe), digo porque es un acto realmente solidario de parte de Rebel Clown.","replies":[{"poster":"BlackFlág","date":"2018-12-26T03:55:15.630+0000","up_votes":1,"down_votes":6,"body":"primera vez que no defendes a rito, +| btw.","replies":[{"poster":"Nuke","date":"2018-12-26T05:17:23.307+0000","up_votes":5,"down_votes":3,"body":"Defender a Riot tampoco es algo malo. Tengo opinión critica propia, lo que sucede es que luego la gente te llama chupamedias por no estar deacuerdo con la comunidad, como si yo consiguiera dinero por apoyar a Riot. Cuando hacen las cosas mal lo digo. Lo dije con el rework de Rengar por ejemplo o con otros cambios en la jugabilidad que  a nadie le gustó.\n\nPero por sobretodo, odio que la gente al estar en desacuerdo con Riot vaya a los insultos. No hay que hacer eso. El feedback no tiene por qué tener tanto acoso.","replies":[{"poster":"WhiteMax","date":"2018-12-26T12:18:28.338+0000","up_votes":1,"down_votes":2,"body":"> Defender a Riot tampoco es algo malo. Tengo opinión critica propia, lo que sucede es que luego la gente te llama chupamedias por no estar deacuerdo con la comunidad, como si yo consiguiera dinero por apoyar a Riot. Cuando hacen las cosas mal lo digo. \n\n+1","replies":[]}]}]}]},{"poster":"Margelrox","date":"2018-12-26T00:05:58.529+0000","up_votes":11,"down_votes":1,"body":"Esto ya parece una censura dictatorial","replies":[]},{"poster":"Dat Butterfly","date":"2018-12-25T23:45:40.112+0000","up_votes":10,"down_votes":1,"body":"Pues vaya timo por parte de riot, solo por subir el RP no les dejan hacer cosas como dar skins a la comunidad por que si, o sea.  y los que tuvimos buena actitud en todo el año para que solo para que los toxicos sean recompensados que injusto. \n\n¿y mi duda es desde cuando comenzaron a premiar a los toxicos? ¿o solo que los latinoamericanos somos a si ?","replies":[{"poster":"Shiny Yordle","date":"2018-12-26T03:42:50.004+0000","up_votes":1,"down_votes":3,"body":"\" solo por subir el RP no les dejan hacer cosas como dar skins a la comunidad por que si \"\n Igual está persona tiene q dar de sí para regalar skins, tampoco aplicaría la falta económica de parte de riot, así q esto es una excusa invalida para ellos.\nChe espera no entiendo los dislikes xD acá alguien no entendió lo que dije xD\nEstoy diciendo q, compren los jugadores o regalen otros, la plata le va a llegar igual a riot, q no es una excusa q algún rioter diga \"no permitimos estos sorteos y los baneamos porq es una forma de robar\", por ejemplo.","replies":[]}]},{"poster":"TurØK","date":"2018-12-26T01:26:55.652+0000","up_votes":9,"down_votes":1,"body":"Hace 2 años que el foro está muriendo y actualmente es un chiste de lo mal que esta, desde que se fueron los rioter es una porquerí@,  fijate que tardaron como 2 semanas en responder por el asunto de los MS alto, y además no se quien esta moderando, pero es muy malo, parece un bot.\n\nQue tu amigo mande un ticket al soporte y que no regale mas skinn, no le hagan buena campaña a riot, que se jod@n ellos mismos con sus actitudes de merda.\n\n","replies":[]},{"poster":"Yamisuke","date":"2018-12-26T01:59:10.737+0000","up_votes":8,"down_votes":1,"body":"La no compra de Riot Points se empieza a notar","replies":[{"poster":"The Fall of Troy","date":"2018-12-27T16:55:04.865+0000","up_votes":1,"down_votes":3,"body":"Con eventos pay2win que si no compras el pase no te llevas mas de unas cuantas cajas","replies":[]}]},{"poster":"WhiteMax","date":"2018-12-26T02:21:11.105+0000","up_votes":6,"down_votes":1,"body":"Publicalo en Reddit, seguro hace polemica.","replies":[]},{"poster":"Hnk Kenshiro","date":"2018-12-26T00:34:09.179+0000","up_votes":2,"down_votes":1,"body":"La parte de 100 comentarios sobraba, eso podía favorecer spam (Aunque al menos dentro del hilo)\n\n¿Hubo ban además de borrado?  Me aparece la última sanción el dia 20/12 (Igual puedo equivocarme)\n\nEl resto de los sorteos publicitarios ya aparece textual que no se puede, pero igual suelen safar xd","replies":[{"poster":"ManuelAlcayaga","date":"2018-12-26T01:14:23.838+0000","up_votes":5,"down_votes":1,"body":"> ¿Hubo ban además de borrado?  Me aparece la última sanción el dia 20/12\n\nprimero rebel publicó el sorteo el dia 20, lo banearon y lo censuraron a los 10 minutos.\nme pidió ayuda porque nunca antes le habia pasado eso, pensamos que podria haber sido un error de moderación por lo que decidimos usar ese RP para hacer varios sorteos navideños,\nluego cuando rebel publica por segunda vez el sorteo se lo censuran a los 10 minutos,\npero permiten sin ningun problema cualquier otro sorteo:\nhttps://i.imgur.com/4ru9WfP.png\nme cuesta mucho creer que no se trate de algo personal, pero doy el beneficio de la duda.","replies":[{"poster":"Hnk Kenshiro","date":"2018-12-26T10:48:35.651+0000","up_votes":1,"down_votes":2,"body":"Me pareció extraño como el post comienza diciendo el día de ayer xd \n\nGracias","replies":[]}]}]},{"poster":"facundoGT","date":"2018-12-26T04:46:13.354+0000","up_votes":4,"down_votes":1,"body":"SIP la verdad que los de riot siguen volviéndose más tontos haciendo estás pelotudeces y es por esas cosas que lol está muriendo y cada vez más rápido.","replies":[]},{"poster":"chesterx","date":"2018-12-26T10:28:11.491+0000","up_votes":3,"down_votes":1,"body":"Últimamente ya no me sorprende nada que riot haga esa clase de cosas. Al parecer los tóxicos, los flamers,etc, etc le dejan más ganancia.","replies":[]},{"poster":"Excorpion","date":"2018-12-26T03:58:04.864+0000","up_votes":3,"down_votes":1,"body":"Están super raros para los temas de moderación... andan muchos descontentos ahora mismo con ello...\n\nSúbanlo de nuevo, pero sin los 100 comments... y que solo sea para quienes comenten en el post... superarán igual los 100 comments.","replies":[]},{"poster":"lukitasLDZ","date":"2018-12-26T03:52:17.489+0000","up_votes":3,"down_votes":1,"body":"lol yo siempre que te vi en el foro era para aportar cosas positivas a la comunidad sin ningun interes y no puedo creer que te traten asi espero que esto no te tire abajo ya que creo que sos un jugador como los que ya no hay y pareces una buena persona tambien :)","replies":[]},{"poster":"Lycanroc","date":"2018-12-26T01:22:50.435+0000","up_votes":4,"down_votes":3,"body":"> [{quoted}](name=ManuelAlcayaga,realm=LAS,application-id=J8qpiO2I,discussion-id=oPMKG9Zy,comment-id=,timestamp=2018-12-25T23:38:47.324+0000)\n>\n me tratan [pesimo](https://i.imgur.com/ruNheCN.png) en soporte \n\nPero que clase de respuesta de un ticket es esa?! Ni siquiera es mi ticket y me enoja la forma de responder.","replies":[]},{"poster":"xM4XIx","date":"2018-12-26T00:16:57.827+0000","up_votes":4,"down_votes":3,"body":"Una vergüenza lo de Riot, pero bueno. Por algo LAS es reconocido como la peor comunidad.","replies":[{"poster":"Mioen","date":"2018-12-26T15:20:00.183+0000","up_votes":1,"down_votes":4,"body":"Los DEV/Rioters/MODs no son parte de la comunidad. Son parte de la empresa y ellos no tienen nada que ver con el comportarmiento de los jugadores, solo hacen su trabajo(Bien o mal).","replies":[]}]},{"poster":"SW Qui Gon Jinn","date":"2018-12-26T13:30:57.023+0000","up_votes":2,"down_votes":1,"body":"Fijate que RIOT tiene un bot de izquierda, para los problemas grosos y demas como trolls, eloboost y eso se lava las manos pero lelgas a decirle ''bobo'' a alguien y ya automaticamente se pone en modo ''moralista 2018'' y te caga baneando el comentario, y te lo digo yo que tengo mas baneos que post aca solo por decir una simple cosita, pero claro a la gente que putea no le hace nada jaja la moderacion se va a la v3rg4.","replies":[]},{"poster":"exrex","date":"2018-12-26T01:24:23.336+0000","up_votes":6,"down_votes":10,"body":"Es lo mas seguro que en realidad le sacaron el post porque incentivaba al spam de comentarios. \nEl problema es que no lo detallaron como motivo de sancion porque probablemente hayan puesto a alguien nuevo en moderación que no esta relacionado con el foro de LAS o un agente de soporte que este aprendiendo a moderar. \n\nPor otro lado, la moderación no tiene por qué dar privilegios solo porque son tus amigos o porque comparten un club contigo. Imagínate que yo ahora haga el mismo post pero con malas intenciones?\n\"Hola denme 100 positivos si quieren skin, soy un filantropo, cuidado\"\n \nNo es asi, chabon. A ti se te conoce, incluso yo que soy rancio te tengo confianza en estas cosas, pero no hagas que los demas hablen en tu nombre.","replies":[{"poster":"ManuelAlcayaga","date":"2018-12-26T01:50:11.400+0000","up_votes":5,"down_votes":4,"body":"pedir comentarios, positivos, firmas, compartir, etc. no viola ninguna regla.\nde hecho los mejores post del foro estan repletos de ejemplos asi:\nhttps://i.imgur.com/pVS2MZO.png\nhttps://boards.las.leagueoflegends.com/es/?sort_type=best\nno es ningun privilegio, es algo totalmente permitido a todos los jugadores.\nno es spam, no existe absolutamente nada negativo en pedir comentarios para un sorteo, eso solo incentiva a que el sorteo se comparta más y participe mas gente.\nno puede existir ninguna \"mala intencion\" porque no se gana nada regalando RP.","replies":[{"poster":"iBaam","date":"2018-12-26T13:30:33.999+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ManuelAlcayaga,realm=LAS,application-id=J8qpiO2I,discussion-id=oPMKG9Zy,comment-id=000e0000,timestamp=2018-12-26T01:50:11.400+0000)\n>\n> pedir comentarios, positivos, firmas, compartir, etc. no viola ninguna regla.\n> de hecho los mejores post del foro estan repletos de ejemplos asi:\n> https://i.imgur.com/pVS2MZO.png\n> https://boards.las.leagueoflegends.com/es/?sort_type=best\n> no es ningun privilegio, es algo totalmente permitido a todos los jugadores.\n> no es spam, no existe absolutamente nada negativo en pedir comentarios para un sorteo, eso solo incentiva a que el sorteo se comparta más y participe mas gente.\n> no puede existir ninguna &quot;mala intencion&quot; porque no se gana nada regalando RP.\n\nUn clásico de achungo en no dar la cara, **no es la primera vez.** ¿Quien será el que esta a cargo de los agentes de soporte?\nDesde hace ya un tiempo, antes de la ola de baneos por boosting a finales de la S8, que noto un quiebre entre agentes de soportes, rioters y comunidad (o quizas solo pasa conmigo ya que soy bien incadiente).  Pero ya no les creo nada e intento reflejarlo en mis mensajes. Además todo mensaje que envies será respondido por defecto (bot) y cerrado automaticamente, sin derecho a replica.\n\nConcuerdo con exrex:\n> [{quoted}](name=exrex,realm=LAS,application-id=J8qpiO2I,discussion-id=oPMKG9Zy,comment-id=000e00000000,timestamp=2018-12-26T03:41:26.094+0000)\n> \n> Tienes la opción de rehacer el post pero con otras condiciones. Y si ahi te banean, te doy la razón. \n\nTampoco tengo nada en contra tuyo, cada uno libra sus propias batallas (discusiones), habra gente que se opondrá y otros que te apoyarán, solo que **no bajes los brazos**, nunca ha sido tu estilo.\n\n/FF (Felices Fiestas)","replies":[]},{"poster":"exrex","date":"2018-12-26T03:41:26.094+0000","up_votes":6,"down_votes":6,"body":"Estas quejandote porque banearon a  tu \"amigo\" \"miembro del grupo filantropos\"  no a un usuario común y  corriente.\nY en ninguno de esos post veo que alguien pida positivos o comentarios por ser amigo de alguien o para regalar una skin.  \n\nTienes la opción de rehacer el post pero con otras condiciones. Y si ahi te banean, te doy la razón. \n\nYo no tengo nada en contra tuyo, solo soy neutral. En tu anterior post te di la razon, con este no, y tampoco viene al caso que lo menciones para \"reforzar\" la suposición de que hay algo en tu contra cuando era un tema polémico de por si, no por quien lo estaba posteando. Asi como tampoco la parte en donde dices que banean a tus amigos cuando en la captura se ve que tiene sanciones antiguas y banean a cualquiera. \n\nLo unico que esta mal en esa sanción fue no haberte el motivo que invalidaba ese sorteo. \nPero en este post veo planteos que estan mal.","replies":[]}]}]},{"poster":"Get Jïnxed","date":"2018-12-26T03:57:39.307+0000","up_votes":2,"down_votes":1,"body":"GG","replies":[]},{"poster":"Niyinja","date":"2018-12-28T05:32:38.136+0000","up_votes":1,"down_votes":1,"body":"Tranquilo amigo,Riot solo tiene miedo de que tus sorteos se hagan famosos y se fijen en ti,yo se que lo lograras Bro...si queres regalarme una Skin estaria feliz de recibir a leblanc programa 7u7\nDiciendo esto suerte en esto y sigue asi,que una piedra no estorbe tu camino","replies":[]},{"poster":"ZYNOOJI","date":"2018-12-27T13:20:54.596+0000","up_votes":2,"down_votes":2,"body":"Hola a todos felices fiestas. Total mente de acuerdo con el post y da para buscar respuestas después de todo la rehabilitación de tóxicos jamás llega sino hasta el ban y en este caso fallaron completamente pues hicieron totalmente lo contrario a lo que se llama moral del administrador. Un apoyo de corazón a la gente de los filántropos y una queja directa a los administradores que banean arem y llevados por intereses, es que Riot se infectó por la corrupcion y los intereses externos..? Bueno saludos y respetos.","replies":[]},{"poster":"Tortuguita","date":"2018-12-26T01:20:35.670+0000","up_votes":1,"down_votes":1,"body":"Damn. Me recuerda a los moders de Fallout 4 tan solo que aquí los banean por intentar reparar a esta tan dejada comunidad.","replies":[]},{"poster":"Emissang","date":"2018-12-27T17:37:19.428+0000","up_votes":1,"down_votes":2,"body":"Riot Condor volve t perdonamos","replies":[]},{"poster":"FNZC","date":"2018-12-26T21:00:25.877+0000","up_votes":1,"down_votes":2,"body":"ami me regalaron 1skin pero no se q paso mi amigo dice q la skin se le regalo a el mismo\ny no podia rembolsar xP\ncosas raras xP","replies":[]},{"poster":"Mioen","date":"2018-12-26T15:27:04.733+0000","up_votes":1,"down_votes":2,"body":"No tengo idea del por que el borronaso del post.\n>Riot PREMIA a los tóxicos con una oportunidad de conseguir las recompensas de temporada,\npero CASTIGA censurando y baneando al jugador solidario que quiere ayudar a la comunidad.\nRiot CONFÍA en que un jugador toxico va a reformarse dejando de ser egoista y flamer,\nPero NO CONFÍA en que un jugador que lleva años siendo solidario entregará un regalo de navidad..\n¿Que debería hacer Rebel Clown entonces? ¿ganarse la confianza de Riot siendo toxico??\n\nNo creo que tengan ninguna relacion. Pero si debo decir que ultimamente hubo una muy mala moderación, lo comentaron el post de Excorpion y yo tambien creo que se esta realizando un mal trabajo.\n\nLos Mods del foro no estan dando razones para borrar post o censurar ciertas cosas, en el mejor de los casos vas a soporte y le preguntas por que borraron el post y te responden que fue un error. Pero para aquel entonces pierde su impacto.(Igual que en este caso, si realizas un sorteo para cierta fecha, pero te borran el post y te contestan 1 dia despues perdiste el sorteo).","replies":[]},{"poster":"Diosmo","date":"2018-12-26T05:56:54.199+0000","up_votes":3,"down_votes":5,"body":"Es Navidad y le estas quitando el negocio a Riot!!! :P","replies":[{"poster":"Del0reaN","date":"2018-12-27T20:37:54.627+0000","up_votes":1,"down_votes":1,"body":"Para nada... Las skins no se las regalan. Las compran ellos. A Riot incluso le conviene, porque estarían adquiriendo skins para jugadores que, posiblemente, no comprarían nunca RP.","replies":[]}]},{"poster":"Yoen","date":"2018-12-27T05:10:25.943+0000","up_votes":1,"down_votes":5,"body":"Se me caído un ídolo :c\n\nSe que no tiene que ver con el post,\npero el que mencionas, sobre supuestas\nvíctimas de acoso o abuso.\n\nEstoy en total desacuerdo,\n\nActualmente parece que no existe la presunción de inocencia\ncualquier mujer que denuncie, lo toman como verídico \ny si una persona que es denunciada por acoso o abuso.\nes escrachada y recibe condena social.\n\nSolo por una denuncia que no llega a fallo jurídico\n\nPor estos movimientos ideológicos de  la\ndiversidad sexual y esas cosas.\nConlleva a que las empresas eviten contratar mujeres\npara evitar problemas legales.\nAl final el movimiento feminista, termina perjudicando a las\nmujeres por sobre lo que supuestamente  los beneficios que\nhan logrado.\n\n\nYo creo que el foro esta moderado por uno, y pienso quizás\nvan a hacer cumplir las reglas como deben ser.\n\nMe parece perfecto\n\nSaludos","replies":[]},{"poster":"SG naiko ","date":"2018-12-26T06:35:23.592+0000","up_votes":1,"down_votes":12,"body":"Aun siguen ardidos con lo de el perdon de riot hacia los flamers Xd","replies":[]},{"poster":"ILoner","date":"2018-12-25T23:52:49.667+0000","up_votes":1,"down_votes":13,"body":"La verdad muy indignante la situación, si te hace sentir mejor te acepto los premios del sorteo para que te sientas mejor ( ͡° ͜ʖ ͡°)","replies":[{"poster":"Fokus","date":"2018-12-25T23:55:27.556+0000","up_votes":1,"down_votes":13,"body":"Ni se te ocurra, yo ya mande solicitud al payaso rebelde {{champion:17}}","replies":[]}]},{"poster":"vaVav","date":"2018-12-26T00:15:17.555+0000","up_votes":2,"down_votes":12,"body":"Digamos que cien comentarios, más los +1 que regalan instantáneamente los del club, hacen que un post se posicione alto en Populares. Con ello para la pobre moderación que hay es fácil encontrar y sancionar.","replies":[]},{"poster":"ˇOverlordˇ","date":"2018-12-26T00:38:29.277+0000","up_votes":1,"down_votes":16,"body":"Me regalas a Soraka Elsa de Frozen? quiero sentirme princesa una sola vez, aunque sea en la grieta","replies":[]}]}