{"poster":"LeftyRaydy","date":"2018-11-28T22:27:32.333+0000","title":"Best Current Pre-season Strategy","subforum":"Gameplay","up_votes":2,"down_votes":1,"body":"I mean this is as skillful as it gets.\r\n1 get as many dark harvest abusing champions on your team as you can\r\n2 stack dark harvest (cause it&#039;s easy)\r\n3 ??????\r\n4 bend the enemy team over a barrel and give them a dark harvest enema","replies":[{"poster":"Just 4 Memes","date":"2018-11-28T22:49:18.379+0000","up_votes":2,"down_votes":0,"body":"I think Dark Harvest is overrated and it doesn't work optimally in every situation/match up/champion. Personally I do twice as much damage at every stage of the game with {{champion:62}} running Electrocute.","replies":[{"poster":"LeftyRaydy","date":"2018-11-28T23:00:36.425+0000","up_votes":1,"down_votes":0,"body":"yes of course this is because Melee champs have a harder time procing and stacking dark harvest. Think Brand, Karthus, Annie, with AOE abilites that can easily proc it and you will see the problem. My main is the same poor {{champion:245}}","replies":[]}]},{"poster":"mack9112","date":"2018-11-28T22:37:05.716+0000","up_votes":2,"down_votes":0,"body":"Idk man in my games it definitely is not the easy to get stacks \n\nThe most I have ever seen is 30 stacks and that was in a 41min game with the average 27min game sees between 15 and 20\n\nAnd the thing is getting nerfed ","replies":[{"poster":"LeftyRaydy","date":"2018-11-28T22:40:03.695+0000","up_votes":1,"down_votes":0,"body":"It doesn't matter when you have 3-5 Dark harvest users and after 50% health 2 procs and you are dead then they are both reset for the next person. \n\nJust had a Brand Annie and Evelyn dark harvest can you imagine how teamfights are especially when you have constant damage (brands passive, Annie's Tibbers) which will proc Dark harvest for you automatically once it can be.","replies":[{"poster":"mack9112","date":"2018-11-28T22:45:01.944+0000","up_votes":2,"down_votes":0,"body":"Idk I compare it to damage done with electrocute users at the end of my games and games ending early or mid game electrocute users are coming out on top while late game DH users are coming out on top so in that regard it is doing it's job.\n\nEarly game the proc is not even worth an auto in many circumstances.\n\nI mean I like the nerf going through as it will take 24 stacks to bring it to par damage with electrocute compared to now what in is 20 but I just haven't seen it be busted in my games.","replies":[{"poster":"LeftyRaydy","date":"2018-11-28T23:02:30.245+0000","up_votes":1,"down_votes":0,"body":"again you are comparing to champions that can use electrocute better thats fine, but Dark harvest on a lot of long range mages with consistent damage especially are becoming issues.\n\nThink Heimer, Brand, Zyra, Karthus, and others where electrocute sucks on them and now consider their team fighting with dark harvest. its absolutely disgusting.","replies":[{"poster":"mack9112","date":"2018-11-28T23:17:41.424+0000","up_votes":1,"down_votes":0,"body":"I really don't know if I would say disgusting I just haven't experienced that in any of my games . Definitely makes karthus a viable pick.","replies":[{"poster":"LeftyRaydy","date":"2018-11-29T00:23:56.580+0000","up_votes":1,"down_votes":0,"body":"Just check the top 2 winrates for \"ADC\" in plat plus Elo\nhttps://www.leagueofgraphs.com/champions/stats/adc/platinum/by-winrate\n\nThen look at the top 3 for support for plat plus. This is what dark Harvest Created.\nhttps://www.leagueofgraphs.com/champions/stats/support/platinum/by-winrate","replies":[{"poster":"mack9112","date":"2018-11-29T00:27:28.866+0000","up_votes":1,"down_votes":0,"body":"If the play rate was anything strong I would definitely call it a problem\n\nSonas highest win rate build is still summon sery the other two AP supports definitely have always been strong ","replies":[{"poster":"LeftyRaydy","date":"2018-11-29T00:50:50.337+0000","up_votes":1,"down_votes":0,"body":"Fair enough on Sona, but once people start realizing this it will get worse and the double mage bot lanes have been coming back. I know a lot of people are probably not doing it, because we know Dark Harvest will get a change whether that is a Nerf or it will be reworked idk.","replies":[{"poster":"mack9112","date":"2018-11-29T00:52:55.833+0000","up_votes":1,"down_votes":0,"body":"It's getting a pass next patch and one more after that probably I wouldnt be too worried","replies":[]}]}]}]}]}]}]}]}]}]}