{"poster":"Lïttlefinger","date":"2017-12-10T13:44:32.382+0000","title":"Solucion ANTI-TROLL en ranked. O no....","subforum":"Charlas Generales","up_votes":1,"down_votes":9,"body":"Me gustaria algo asi para las rankeds, ya que siempre esta el troll, es inevitable, a mi me da igual que trolleen, lo unico que molesta, es que es por LP, si me trollean una normal me da totalmente igual, ya es costumbre, pero en ranked no.\r\n\r\nSiempre esta el que le toco supp y elige teemo para fedear, el que dice que trollea esperando que alguien dodgee nadie lo hace y trollea de verdad, el que pide cambio de linea y si no le cambian trollea, etc etc etc.\r\n\r\nMe gustaria algo, seria un sistema complejo de desarrollar quizas, pero me gustaria algo asi en rankeds:\r\n\r\n- 1) Jugador sale 0/15/0. Obviamente es troll, se tira bajo torre a cada rato, pero el sistema (obsoleto por cierto), seguro lo tome como &quot;mala partida&quot;.\r\n\r\n- 2) Jugador sale 0/15/8, o con score similar, el juego lo toma como mala partida, lo que es correcto, intento jugar y le fue mal, a diferencia del primer jugador.\r\n\r\nLamentablemente, el sistema no sabe reconocer rendimiento, solo acumulacion de reportes y para lo que esta basado casi el 80% del sistema de reportes es para el flameo.\r\n\r\nEn base a esos dos scores, el sistema tendria que evaluar lo siguiente:\r\n\r\n- Participacion\r\n- Segundo en relacion entre muerte y muerte.\r\n\r\nVolvamos nuevamente a los dos jugadores con scores similares:\r\n\r\n- 1) Muere aproximadamente, entre 15-25 segundos despues de nacer sucesivamente.\r\n\r\n- 2) Muere con diferencia de tiempo, incluso hay intervalos en los que pasa sin morir mas tiempo de lo que lo venia haciendo.\r\n\r\nEn base a esto, el sistema, deberia reconocer que algo mal anda con el jugador numero uno, si no logra durar vivo, significa que se esta sacrificando intencionalmente, a diferencia del jugador dos, porque estaria variando los segundos de muertes, obviamente, lo intenta aunque sea.\r\n\r\nTambien, tendria que entrar en juego, el oro gastado en la partida entre los dos jugadores:\r\n\r\n- 1) No va a comprar, casi la mayoria de trolls no compra y va directamente a morir.\r\n\r\n- 2) Eventualmente, va a comprar, el gasto de oro, va a ser notable, va a ver una diferencia notable, ya que va a participar con asistencias, a farmear, etc etc.\r\n\r\n\r\nPara mi, evaluando estas cosas, un sistema podria reconocer el &quot;troll&quot; de la persona que tiene una mala partida, evaluando cantidad muertes, participacion, gasto de oro, tiempo entre muerte y muerte.\r\n\r\nTomando estos cuatro datos en forma de evalucion, se podria castigar al troll y darle ban.\r\nObviamente, que esto tambien seria apoyado por minimo, tres reportes, lo que ayudaria mas al sistema a reconocer un jugador troll.\r\n\r\nSeamos realistas, los trolls son los que arruinan la partida al 100%, los flamers tambien, obviamente.\r\n&iquest;Pero por que empieza a ser flamer uno?, gran mayoria, no se un porcentaje, empieza por los trolls.\r\n\r\nNo justifico para nada, pero es lo mas molesto, tambien existe el frustrado que le va mal y flamea y, el flamer natural, que ese flamea por cualquier cosa, con o sin troll.\r\n\r\nPero la gran mayoria que flamea al troll, se vuelve toxico con cada partida, un poco por cansancio, un poco porque ya lo hizo parte de el el flameo, pero viendo cientos y cientos de videos de youtubers, de elo relativamente alto, diamante para arriba, cuando flamean, lo hacen al que se sacrifica &quot;intencionalmente&quot;, algunos escriben, pero gran parte no lo hace, solo insultan en microfono, pero si no fueran youtubers, yo creo que varios de esos ya hubieran perdido su cuenta.","replies":[{"poster":"WhiteMax","date":"2017-12-10T14:04:12.390+0000","up_votes":5,"down_votes":2,"body":"> Siempre esta el que le toco supp y elige teemo\n\nRiot permite el antimeta.\n\n>  para fedear, el que dice que trollea esperando que alguien dodgee nadie lo hace y trollea de verdad, el que pide cambio de linea y si no le cambian trollea\n\nY bueno, por eso es que esta bronce, y encima sera baneado muy pronto (adios al todo el tiempo invertido).\n\n> 1) Jugador sale 0/15/0. Obviamente es troll, se tira bajo torre a cada rato, pero el sistema (obsoleto por cierto), seguro lo tome como \"mala partida\".\n\nReportado por feeder intencional.\n\n> 2) Jugador sale 0/15/8, o con score similar, el juego lo toma como mala partida, lo que es correcto, intento jugar y le fue mal, a diferencia del primer jugador.\n\nFeeder intencional.\n\n> Tambien, tendria que entrar en juego, el oro gastado en la partida entre los dos jugadores:\n\nNo. Eso seria solamente ser malo, en el sentido de que no sabes comprar o que comprar. Siendo honesto nisiquiera se si se toma en cuenta los que se compran 6 lagrimas o botas (a no ser que Riot mire el caso).\n\n> Obviamente, que esto tambien seria apoyado por minimo, tres reportes, lo que ayudaria mas al sistema a reconocer un jugador troll.\n\nY las premades reportando sin motivo...\n\n> Pero la gran mayoria que flamea al troll, se vuelve toxico con cada partida,\n\nUn toxico es un toxico, punto. Si no te flamea porque hay troll, te flamea porque vamos perdiendo, porque no le gankean, porque quieren que el jg sea su niñera, porque uno de su team le va mal y ya lo tacha de troll, etc. Este tipo de gente no es aceptada y por eso se les banea.","replies":[{"poster":"Lïttlefinger","date":"2017-12-10T14:06:50.458+0000","up_votes":1,"down_votes":6,"body":"Me tomaria el tiempo de elaborar una respuesta.\n\nPero viendo tu perfil, de 100 comentarios 99 son mala leche, mala onda, negatividad, sarcasmo o ironia, asi que ni me gasto, suerte que tengas buen dia! :D","replies":[{"poster":"WhiteMax","date":"2017-12-10T14:12:10.895+0000","up_votes":5,"down_votes":0,"body":"> Asi que, dentro de poco vas a tener tu dosis de humillacion como todos, saludos.\n\n.\n\n> Escondiendome?, tengo varias cuentas, todas en plata, esta es la que tengo logeada ahora, cual es el problema?, de verdad te pensas que me esconderia \"virtualmente\"?, vaya amigo, psicologo urgente jajaja.\n\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]}]}]},{"poster":"SolidDisk","date":"2017-12-10T14:04:25.157+0000","up_votes":2,"down_votes":0,"body":"Yo encontre un jugador con todas partidas asi. Trolleaba, se hacia matar, todos escores muy malos y hasta compraba dos veces el mismo item, o iba ponele mlazahar jungla.\n\nAgarre el op.gg y lo lleve a soporte. De ahi que ellos tomen medidas.\n\nLa verdad no se como funciona el sistema. Pero a mi no me tomo mucho darme cuenta que hacia el jugador, fue ver 5 minutos una partida, ver el historial y era obvio.\nSi es obsoleto o no, no lo se, pero debe tener baches, porque este jugador que encontre tenia la pagina llena de partidas iguales.","replies":[]},{"poster":"NLG Walter","date":"2017-12-10T16:37:42.817+0000","up_votes":1,"down_votes":0,"body":"Lo mismo plantee hace mucho, y se que podria programar algo para al menos detectar casos extremos usando las estadisticas que brinda el juego y un historial de partidas previas.\n\nhttps://boards.las.leagueoflegends.com/es/c/charlas-generales/Bdy2EEaZ-por-que-el-mmr-de-lol-no-puede-tener-en-cuenta-el-desempeao-individual","replies":[]}]}