{"poster":"Lïttlefinger","date":"2017-12-19T21:20:52.807+0000","title":"¿Podria ser por ese motivo el cambio del PI al EA?...","subforum":"Off-topic y temas personales","up_votes":4,"down_votes":4,"body":"Hoy estuve pensando, mientras estaba fastidioso de tardar 10 dias en subir de nivel para ganar 600 EA.\r\n\r\n&iquest;Si el sistema anterior de PI, estaba bien, por que lo sacaron?\r\nNo me vengan con cuentas inventadas de que a la larga, SE GANA MAS, porque es una total mentira, se gana mucho menos, cualquiera que haga la cuenta lo va a notar.\r\n\r\nTe metias 10 partidas por dia y ganabas 600 de pi, suponiendo que perdias todas, ahora te tenes que meter casi 20 para subir de nivel (desde el nivel que estoy yo, 21) y ganar 600 de EA.\r\n\r\nPero no es solo eso, nos sacaron las skins gratis, las cajitas, dan solo champs, por lo menos a mi, desde que salio el nuevo metodo, todas las cajas capsulas o lo que sea que haya abierto, me dieron champs. Solamente, una sola cajita me dio a Ashe la verde, esa tribal no me acuerdo el nombre.\r\n\r\n&iquest;Sera que esto estaba planeado?, como que dijeron en el momento que se implemento el hextech: &quot;Le damos cajas, le damos skins gratis, total despues mas adelante le cortamos todo&quot;.\r\n\r\nPara mi estaba planeado y, si no fue asi, habran tenido una baja importante en la venta de skins y inventaron esta estupidez (a mi parecer), del EA, de manera de recuperar todo lo perdido, sino, no entiendo el motivo de sacar algo que estaba funcionando bien y poner algo peor.","replies":[{"poster":"martincarp","date":"2017-12-19T21:45:22.401+0000","up_votes":2,"down_votes":0,"body":"El cambio de los Puntos de Influencia a las Esencias Azules es porque con el nuevo sistema de runas se sabía que iban a ser todas gratuitas, por lo que los PI perdían gran parte de su utilidad. Es por eso que decidieron fusionar las EA (antes exclusivas de la artesanía Hextech) con los PI (además de las runas, exclusivos para comprar campeones y algún que otro ícono), porque era inútil tener 2 \"monedas\" que cumplían la misma función (conseguir campeones) en dos métodos distintos, era más fácil fusionarlas y que sirva tanto en un método como en el otro, tanto en la tienda como en la artesanía.\n\nAhora, el cambio del sistema no tiene nada que ver con el ataque de inflación que le agarró a Rito, son dos cosas totalmente distintas. El sistema nuevo es más práctico y creo que nadie puede negarlo, el tema es que la forma en la que está implementado, los precios que tiene todo actualmente y las cantidades de esencias que se consiguen, hace que NO sea apto para impacientes, porque con los precios actuales el sistema está orientado hacia el ahorro, la paciencia de que te toquen los fragmentos de campeones que uno quiere conseguir (para que su precio sea más efectivo que siendo comprado en la tienda).... algo que a la gente que quiere todo ya mismo no le va ni le viene.","replies":[]},{"poster":"Łuck","date":"2017-12-19T21:30:24.646+0000","up_votes":2,"down_votes":1,"body":"https://boards.las.leagueoflegends.com/es/c/charlas-generales/zInd3Fc9-puntos-de-influencia-vs-sistema-ea\n\nA decir verdad, si, ganas mas a la larga, siempre y cuando las capsulas te den sobre 960 ea, **a corto plazo esta muy deficiente el sistema** y sobretodo bajo 960 ea.\nYo hice ese post, pero nadie le dio bola. Incluso gaussrik me respondio y yo le respondi de vuelta con** datos solidos**, pero ahi quedo, de ahi no se apareció más. Así es la vida.\nSi recibes bajo 810 ea en las capsulas de nivel escribe a soporte, porque eso es lo minimo que deberías recibir como mala tirada.\n\nSaludos!","replies":[]},{"poster":"WhiteMax","date":"2017-12-19T21:28:35.739+0000","up_votes":2,"down_votes":1,"body":"Eres lv21, obviamente recibes eso, de 1 a 30 es 21k en total + algunos campeones.\n\nEl sistema esta hecho para que consigas a todos los campeones mas rapido que antes gracias a los descuentos. Pero en el tema de comprar un campeon \"especifico\" no cambio nada, sigues teniendo que ahorrar, igual que antes.\n\nLo unico que hay para quejar es: \n\n1. el aumento al coste de mejorar skin y maestria.\n2. que las cajas hextech sigan dando campeones (al menos que quiten los campeones de las que se compran con rp).\n3. que desencantar skins te den menos Esencia naranja que antes.\n4. Que quitaran la victoria del dia de 575 xp por la de 400 xp + 50 ea en vez de dejar los 575 xp y agregarle esos 50 ea.","replies":[]},{"poster":"Tenshi cL","date":"2017-12-19T21:22:27.629+0000","up_votes":1,"down_votes":1,"body":"Salfate es tu primo?","replies":[]}]}