{"poster":"edrok","date":"2018-04-08T01:57:39.670+0000","title":"quiero mejorar","subforum":"Guias y consejos","up_votes":2,"down_votes":0,"body":"hola invocadores estoy buscando consejos de como mejorar siendo supp como poder ayudar al adc y al equipo cualquier idea o estrategia por mas sencillo que sea va a ser de mucha ayuda yo como supp trato de mantener la vicion en la jg enemiga al inicio de la partida me compro el item de supp  {{item:3098}} una {{item:2003}} y un {{item:2055}} para poner en la jg enemiga por momentos dejo al adc solo pero cuando el adc enemigo no esta para ayudar a invidar a nuestro jg y robar campamentos pero suelo perder lvl no se si eso esta bien o no todavia soy nuevo asi que capaz me pierdo en algunas cosas y antes que se me aga un mal habito quiero corregir \r\n\r\nella si te ama \r\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Kanngaroo","date":"2018-04-08T16:30:51.217+0000","up_votes":1,"down_votes":0,"body":"Mira yo soy nuevo tengo 5 semanas jugando solo de support.\nLo que yo hago y hacia mal, los adC me corregían y me guiaban.\nAhora si quieres ser support de por vida me parece genial, tengo algunos consejos.\n- Pokea lo mas que puedas al adC enemigo, si ves un minion tuyo con poca vida osea farmeable, lo q yo hago es acercarme lo mas que puedo al adC y tirar todos mis skill y básicos, ahí haces la diferencia en la fase de linea.\n- Cuando tu adC regrese a base, tienes varias opciones,1 hacer un gank a medio, 2 ayudar al jg a campear jg enemiga, 3 si los enemigos también fueron a base y la linea esta pusheada, podrías tankear la oleada si ya esta cerca tu adC, pero si esta lejos aprovecha esos minions.\n- Te recomiendo a 2 que hacen gameplays en youtube, a mi me ayudaron mucho y espero que a ti igual. LOGGI y BloodRain. Te explican muy bien que hacer y no se tiltean lo mejor.\n- Si tu adC no le fue bien en la fase de linea, le preguntas si lo puedes dejar solo, lo normal es que te responda de que NO, ahí tu aplicas los juegos psicológicos xd le dices que para que el gane nivel y farm pero que siempre va a estar waerdeado. Y buscas quien esta causando mas impacto en la partida y a el lo supporteas, cuando ya te des cuenta que tu adC ya puede dar pelea, ya no te separas de el nunca.\n- en el posicionamiento, yo antes tenia problemas, pero ya mejore un poco, como te das cuenta de eso, tus muertes ya son pocas, en una TF yo siempre me pongo casi atrás pero nunca quieto, siempre clikeando en todo momento moviéndome, siempre avisando de mis poderes cuando estan en cdd.\n- Los enemigos cuando vean que no puedan matar a tus compañeros porque tu los curas o proteges, empezaran a ir por ti, ahí es cuando tu debes resistir la mayor cantidad de daño, pero sin dejar de proteger a los tuyos, obviamente vas a morir pocas veces vives.\n\nESO ES TODO CREO, mientras nas juegues mas te darás cuenta lo que debes de hacer, Espero te sirva y lo leas xd Mucha suerte.\n Yo uso estos champ: Lulu, Janna, Soraka, Nami, Taric, Bardo, Blitz, el q se come a sus compañeros xd no me se su nombre y  braun creo q se llama (tiene un escudo que evade poderes).","replies":[]},{"poster":"MILFortune","date":"2018-04-08T02:07:00.491+0000","up_votes":1,"down_votes":0,"body":"Apenas empezás el juego el adc no sabe qué hacer. Por lo pronto hacé lo posible por que lo dejen farmear. Y molestá al adc o soporte rivales sin pasar al lado de sus minions. Si sos un soporte de escudo, protegelo si golpea a los rivales por si los rivales quieren devolver el daño. Si sos una Morgana, el escudo es anti cc así que ponelo cuando las cosas se vuelven complicadas. Si el adc tiene pocas chances de sobrevivir, ponete el escudo vos y salí corriendo","replies":[{"poster":"edrok","date":"2018-04-08T02:12:30.286+0000","up_votes":1,"down_votes":0,"body":"gracias y si quiero iniciar o en una tf siempre tengo que estar protegiendo al adc o al mid ?","replies":[{"poster":"ParedSinRevoque","date":"2018-04-08T04:22:17.800+0000","up_votes":1,"down_votes":0,"body":"Otra cosa que me olvide, si inicias protege al que el asesino le haga focus, normalmente cuando inicias toda la atencion se centra en vos, excepto la del asesino que va por el mas blando. Claro si inicias bien. Hay mas cosas que podria poner pero te hago una biblia si lo escribo, si queres agregame y hablamos luego.\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"ParedSinRevoque","date":"2018-04-08T03:37:07.436+0000","up_votes":1,"down_votes":0,"body":"Si deseas iniciar tene encuenta que los mjeores supp para iniciar son los tanques y los magos EJ.: {{champion:63}} O {{champion:53}} . Intentas iniciar y si sale mal vas para atras y esperas tus CDs (enfriamientos) y lo vuelves a intentar de vuelta. Tene encuenta que cuando incias estas condenando a tu equipo ya que te seguiran aunque inicias mal, claro si estas acompañado de tu equipo si te tiras solo nadie te va a seguir y si inicias y no te siguen ve para atras, a la hora de iniciar tenes que ver bien a tu equipo y el del enemigo, si estan todos y las formas que te pueden cagar la iniciacion. Hay campeones que puede hacer un Todo o nada en sus iniciacion EJ.: {{champion:14}} mucho cuidado, mientras un blitz puede tirar una Q fallar ir hacia tras y volverlo a hacerlo, estos son capaces de meterse en medio de los 5 y meterles un buen CC ya sea a 1 o varios, tanquear el daño recibido, y esperar a que su equipo entre para ayudarlos. Mientras que PJ como {{champion:25}} o {{champion:53}} requiren Momentum osea, el momento oportuno para meter un buen CC e iniciar, los demas como {{champion:14}} o {{champion:89}} lo pueden forzar.\n\nP.D.: aunque una {{champion:25}} es capaz de forzar una iniciacion con un {{summoner:4}}, R, o un {{champion:53}} con un {{summoner:4}}, E, requiere mas de un mal posicionamiento enemigo.\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"edrok","date":"2018-04-08T03:53:32.826+0000","up_votes":1,"down_votes":0,"body":"creo que los supp que tengo por ahora son {{champion:40}} y {{champion:12}}  tendria que juntar para comprar a {{champion:53}}  o {{champion:25}} mmm con que aprenda a jugar bien con 4 supp me tendria que ir bien cuando tenga que jugar las ranked \n{{sticker:sg-janna}} \nalmenos para no fedear jajaja","replies":[{"poster":"ParedSinRevoque","date":"2018-04-08T03:58:42.389+0000","up_votes":1,"down_votes":0,"body":"http://champion.gg/ entra esta pagina y fijate que esta con mayor winrate de acuerdo a tu liga. Tomalo con una pequeña guia de posibilidades si realemnte quieres subir cualquier cosa que te de ventaja sirve, por pequeña que sea.\n\n{{sticker:slayer-pantheon-popcorn}} ","replies":[]}]},{"poster":"edrok","date":"2018-04-08T03:54:13.165+0000","up_votes":1,"down_votes":0,"body":"gracias por los consejos me sirvieron mucho \n{{sticker:sg-zephyr}}","replies":[]}]},{"poster":"MILFortune","date":"2018-04-08T03:08:33.463+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=edrok,realm=LAS,application-id=8sKIclmi,discussion-id=1V5PrqAe,comment-id=00000000,timestamp=2018-04-08T02:12:30.286+0000)\n>\n> gracias y si quiero iniciar o en una tf siempre tengo que estar protegiendo al adc o al mid ?\n\nTu mayor sinergia es con el ADC pero siempre priorizas al aliado que mayor destrozo pueda hacer. Por ejemplo, si los rivales están juntos y tenés una Syndra que sabés que puede stunear a los 5, hacés lo posible por que eso pase. Podés darle velocidad a la Syndra (suponiendo que usás Lulú, por ejemplo) y después darle daño al adc para que golpee a los stuneados. O darle velocidad al tanque (suponé, un Malphite) para que inicie y stunee a los rivales, luego el daño al adc o al mid. \n\nPero de nuevo, siempre depende. Por ejemplo, tu MID es vVeigar. Veigar tiene mucho daño pero es contra un solo objetivo. Podrías darle velocidad al Veigar para que aprisione rivales. Y suponete que tu adc tiene {{item:3087}} {{item:3085}} que son items que dañan en área, pudiendo alcanzar a más de un campeón. Ahí la estarías dando el daño a él. Al adc. Revisá las habilidades de lulú para entender lo que te digo.\n\nEs todo muy \"depende\" . Para serte sincero, estas cosas las aprendés jugando. Es la experiencia.","replies":[]}]}]},{"poster":"ParedSinRevoque","date":"2018-04-08T03:08:23.135+0000","up_votes":1,"down_votes":0,"body":"Lo mas importante como supp es wardear (y en todas las lineas es importante pero la cosa es que los demas casi nunca lo hacen) tenes que llegar a un punto que te traumes con los wards, que nunca te falte el ward rojo. Y claro tampoco en lente de vision (no te olvides de mejorarlo, traumate con eso tambien). Si ves al jg enemigo en top no wardees no hace falta por ahora, si los ves en mid y ves que baja hacelo si podes y avisa a tu adc que hay posible peligro. Si tenes la linea psuheada y estas bajo torre pone wards atras solo si ves intencion de DIV claro que hay que verlo con tiempo suficiente. Si estas a mitad de linea del lado de arriba (creo que es equipo rojo) ward en punta de dragon y si ves que pueden pushear la linea ponelo en el bush pequeño que tienen al lado de la torre los enemigos. Si pushean, ponete modo bisco y pone un ojo en los enemigos y otro en el mapa si avanza el enemigo vayan para atras es posible que venga el jg por un punto ciego si no lo viste. Si estas del lado azul, el de abajo, y te pushean ward en el bush de atras poco probable el DIV pero si van a divear los vas a vaer antes en los dos que tenes enfrente, osea se vana adelantar. Si estas en el medio de la linea del lado azul ward en el bush pequeño que esta al lado de la torre y en punta de dragon y tambien atras de bush que esta en el rio, justo donde esta la piña. Siempre fijandose si lo podes poner de forma segura, osea que no te pusheen mientras lo pones. Si te enfrentas a un WW trinket rojo en drake recien empezar a lv3 se suelen hacer Drake. Otra cosa si te pishean linea y luego parece que retroceden pone ward en los bush de la linea puede llegar el jg por linea esconderse en esos bushes y sorpresa. Y tenes que estar siempre pensando que el jg puede salir de la nada y matar a tu pobre adc. Esto lo que genera que te campeen la linea. Y esto es solo en la fase de lineas y tambien omiti algunas cosas.\n\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"edrok","date":"2018-04-08T03:19:05.353+0000","up_votes":1,"down_votes":0,"body":"ponele que mi adc volvio a base y los minions estan pusheando a nuestra torre dejo que lleguen y los trato de farmear o trato de tankearme el daño para que no lleguen a la torre (claro que tratando de no perder mucha vida ) porque vi que muchos adc se enojan si le roban el farm capaz sean preguntas tontas pero son dudas que tengo xD se que muchas cosas las voy a ir aprendiendo mientras jugue","replies":[{"poster":"ParedSinRevoque","date":"2018-04-08T03:42:05.519+0000","up_votes":1,"down_votes":0,"body":"Otro consejo, nunca dejes sola la linea de bot, osea no backeen juntos excepto que hayan pusheado la linea hasta la torre enemiga, de esa forma no se desperdicia la Exp. Si el adc backea y deja minions LastHitea, osea dale el ultimo golpe nada mas, si ves que van a caer todos bajo la torre, tanquealos, hasta que llegue la proxima oleada, claro si podes (y con esto me refiero a que no haya un enemigo cerca acosandote).\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]}]}]}]}