{"poster":"HalfLife 3 ","date":"2016-01-04T23:34:48.257+0000","title":"Harto de este problema","subforum":"Problemas Técnicos","up_votes":1,"down_votes":1,"body":"quiero comprar rp con una tarjeta visa y no funciona, pongo otra y tampoco funciona, un amigo tambien queria comprar rp con visa y con mastercard y como no podia se tuvo q comprar con tarjeta local q sale el doble, que ganas de hacernos gastar plata.","replies":[{"poster":"WenaMapache","date":"2016-01-04T23:48:05.901+0000","up_votes":2,"down_votes":1,"body":"El es Jose, un usuario promedio del foro de LAS de League Of Legends. El no anda por la vida posteando sus problemas ni rageando contra los moderadores. Se inteligente, se como Jose.\n\nOk, no mentira... Normalmente, eso es problema del PC.","replies":[{"poster":"HalfLife 3 ","date":"2016-01-05T01:50:46.532+0000","up_votes":1,"down_votes":0,"body":":v","replies":[]}]},{"poster":"BoxiColi","date":"2016-01-04T23:54:12.153+0000","up_votes":1,"down_votes":0,"body":"Jajaj yo tengo exactamente el mismo problema hoy me respondieron el ticket (el mismo problema que el tuyo tengo) este es el ticket\n\nDrZoitberg Hoy a las 13:40 \n\n\nSaludos,\n\nLas tarjetas de crédito y los bancos tienen límites por razones de seguridad y protección de fraude. Generalmente los sistemas automáticos son más estrictos con transacciones de productos o servicios digitales, ya que no hay producto físico.\n\nEs común que una institución financiera limite el número de transacciones digitales que se pueden procesar al día o al mes. Lamentablemente, no tenemos control sobre estos límites, y por lo tanto no podemos evitarlos. Igualmente, no tenemos información más específica sobre los límites de este tipo ya que no son límites de nuestro sistema.\n\nAl revisar tu cuenta, parece que las últimas transacciones intentadas fueron aceptadas por nuestro sistema, pero rechazadas por la empresa de la tarjeta de crédito o el banco. Recomiendo que contactes con tu institución financiera para preguntar sobre los límites automáticos que puedan tener.\n\nNo dudes en hacerles cualquier pregunta que puedas tener.\n\nDrZoitberg\n\nOsea ellos me dice que es problema de la tarjeta y que llame albanco, y el banco me dice que es problema de RIOT, asi qu averiguando bien las cosas para mi es problema de RIOT por que la tarjeta esta en todas sus formas. nose por que vienen a dar tantas vueltas a la gente del foro con esto,sabemos que no se puede cargar RP por que no se les da la gana de ponerlo es asi la cosa, ya estoy esperando hace mas 1 semana para cargar RP y no puedo entonces no me vengas a joder aca con tener paciencia por que yo esperaba comprarme la Bola De Skin Legendarias antes que el 7 de Enero y no lo voy a poder tener, espero que arregluen este problema por que ahí muchas quejas sobre este método de pago sobre  VISA.","replies":[{"poster":"HalfLife 3 ","date":"2016-01-05T01:53:47.571+0000","up_votes":1,"down_votes":0,"body":"por fin alguien q esta en la misma, q se puede hacer sobre esto? esperar? reclamar no sirve de nada.","replies":[]}]},{"poster":"Pablove90","date":"2016-01-05T01:21:53.036+0000","up_votes":1,"down_votes":0,"body":"que sea visa.... que sea master ... que puedas comprar dolares... que puedas usar en mercosur.... no quiere desir que sea una tarjeta internacional.... claramente sos argentino como yo..... llama y pedi que sea internacional desile que te vas a europa a madrid nose inventa algo (porque son medios pelo***dos los del call) y depende del cliente que seas te van a hacer....","replies":[]},{"poster":"PockPack","date":"2016-01-04T23:37:36.208+0000","up_votes":1,"down_votes":0,"body":"Pues, yo uso visa y me funciona bien, debe ser un problema de tu PC o la tarjeta, pero no es culpa de Riot","replies":[{"poster":"ZeNch","date":"2016-01-04T23:45:57.485+0000","up_votes":1,"down_votes":0,"body":"quizas depende de que banco sea la tarjeta visa todas las entidades bancarias no responden las mismas decisiones recordemos lo que paso en argentina con el cepo provablemente se solucione de aca a mitad de enero (opinion mia)","replies":[{"poster":"PockPack","date":"2016-01-04T23:47:20.403+0000","up_votes":1,"down_votes":0,"body":"Pos ni idea, yo soy Uruguayo y pago con Visa","replies":[{"poster":"ZeNch","date":"2016-01-04T23:49:29.834+0000","up_votes":1,"down_votes":0,"body":"el problema de pagos con visa es propio de argentina creo","replies":[]}]}]}]},{"poster":"DojaaCat","date":"2016-01-04T23:37:47.354+0000","up_votes":1,"down_votes":0,"body":"Es gracioso porque con la tarjeta local sale lo mismo :u","replies":[{"poster":"HalfLife 3 ","date":"2016-01-04T23:38:43.328+0000","up_votes":1,"down_votes":0,"body":"no, sale exactamente el doble, por lo menos si eres de argentina sale el doble","replies":[]}]}]}