{"poster":"MadGiorg","date":"2019-08-15T11:56:53.643+0000","title":"Consigli per TFT","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Innanzitutto buon ferragosto a tutti. In ogni caso ho provato la nuova modalità, veramente caruccia, anche se il fatto di non poter ottenere esperienza dalle partite mi ha fatto storcere un po' il naso all'inizio. Chiedevo consigli per le sinergie, in realtà al momento non conosco quali siano le sinergie e cosa facciano, so solo per certo che i Pirati ti fanno guadagnare più oro e che gli assassini fanno più danni critici. Per caso avreste consigli da darmi in merito, magari anche sulle sinergie da provare? Io di solito dato che ho un pc di legno che non mi carica la schermata del carosello iniziale, inizio con un campione a caso e quindi organizzo tutta la mia strategia attorno a quel campione.","replies":[{"poster":"sbepuz","date":"2019-08-15T12:48:23.566+0000","up_votes":1,"down_votes":1,"body":"tft al momento (come già detto per dicembre il gioco muore, in quanto dopo 4 patch credo, la gente ne ha già le palle piene della riot) vede nuovamente solo 2 build viabilili, in quanto non sanno bilanciare\n\nrank god: gunslinder+hextech, metti rapidfire+bt+item attack speed su jiin e ggwp (degli hextech vuoi vi e ovviamente jiinx che è gunslinder hextech)\nmutaforma+wild: che dire....tirali giù x)","replies":[{"poster":"AebelothAngel","date":"2019-08-15T15:38:42.896+0000","up_votes":1,"down_votes":1,"body":"Che palle, di nuovo i gunslinger....sempre i gunslinger....solo i gunslinger....!!!!!!\n\n","replies":[{"poster":"sbepuz","date":"2019-08-15T18:40:59.754+0000","up_votes":1,"down_votes":0,"body":"welp...non ho letto nemmeno tutta la patch, basta leggere jiinx per capire che non ha senso x)\n\npuò auto attaccare 4 target diversi(6 gunslinder) facendo aoe dmg...kappa","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-08-15T19:14:33.651+0000","up_votes":1,"down_votes":1,"body":"É forte ma non eccezionale. Vedendola in azione da 4 é molto molto meglio Draven (oltre che ill bonus degli hextech é facilmente aggirabile e comunque molto debole per jinx che necessita di danno)","replies":[{"poster":"sbepuz","date":"2019-08-16T00:08:03.279+0000","up_votes":1,"down_votes":0,"body":"...ecco perchè jiinx può disattivare gli item a draven mentre draven non può disattivare quelli di jiinx\n\ned ecco perchè jiinx targetta (in aoe) tutti i target sul campo, motivo per cui il suo danno è no sense\n\nprova a giocare gunslinder e fammi sapere","replies":[]}]},{"poster":"AebelothAngel","date":"2019-08-15T19:54:39.073+0000","up_votes":1,"down_votes":0,"body":"Il problema non è che jinx è forte, essendo un tier 4 ci può anche stare. Il problema di tft sono gli oggetti che permettono ad alcune sinergie di workare meglio ed andare oltre le loro possibilità. Faccio un esempio: la sinergia degli yordle gli permette di schivare gli attacchi base ergo dovrebbero essere forti contro gunslinger e ranger. Invece gunslinger e ranger si itemizzano rapid fire cannon e li distruggono. Tutto questo non è giusto, perchè gli yordle sono fatti per counterare le sinergie che si basano gli aa e dovrebbero perdere contro i soucerer non contro ranger e gunsliger.\nPurtroppo, anche se questa è solo una beta, non credo che la riot ritorni sui suoi passi eliminando gli oggetti. La situazione questa è e credo che questa rimarrà. Peccato perchè tft è carino...","replies":[{"poster":"sbepuz","date":"2019-08-16T00:12:10.307+0000","up_votes":1,"down_votes":0,"body":"io ho già abbandonato tft e son già tornato a dota auto-chess, ma ancora prima di questa patch..gioco solo per le emote gratuite\n\ntft detto in parole povere mi fa schifo (letteralmente) fin dalla open beta sul pbe\nqui di seguito spiego i motivi\n1) item con rng (curse blade/silence/disarm, etc)\n2) sinergie no sense\n3) la mappa è troppo piccola per spaziare sul positioning...e tutto si conclude nei soliti 2 positioning fissi in base alla comp\n4) ci saranno massimo 2 tier comp per patch e se non fai quelle perdi (a causa degli item)\n5) l'aggiunta dei gold nel caso non si trovano item\n6) il fatto che QUALSIALSI comp è item dipendete","replies":[]}]}]}]}]},{"poster":"AebelothAngel","date":"2019-08-15T18:23:42.767+0000","up_votes":1,"down_votes":0,"body":"Aggiungo anche una cosa, ieri mattina, prima di giocare ero p3 57 lp. Ho voluto sperimentare diverse comp e alla fine sono una volta ho giocato gunslinger + due hextech, il resto ho sperimentato. Risultato che sono sceso g1 17lp e quell'unica volta che ho giocato gunslinger + hextech sono arrivato secondo. Fatevi un po' voi i conti.","replies":[]},{"poster":"V3LK0ZMAST3R","date":"2019-08-15T19:12:58.665+0000","up_votes":1,"down_votes":1,"body":"Guarda personalmente punta sempre a:\n- 6 nobili (per qualche motivo continuano a Buffarli nonostante siano rotti in culo). Cercando di portare al 3 almeno vayne (guinsoo + BT) o Lucian (hextech revolver). Letteralmente puoi avere fatto item a cazzo,sbagliare i posizionamenti ecc,ma una volta ottenuti tutti e 6 con vayne un po' itemizzata hai vinto o quasi.\n- quando riesci piazza un kennen, va bene ovunque e sempre\n- se ti salta fuori all'inizio piazza Darius e punta a Draven successivamente ( se li abbini ai 6 nobili hai la vittoria al 100%)\nPS: fregatene del champ che prendi all'inizio,se non ti piace lo vendi e hai più Gold per comprare i primi champ che escono","replies":[]},{"poster":"Luckynanix","date":"2019-08-15T12:50:30.080+0000","up_votes":1,"down_votes":1,"body":"Devi basarti su cosa ti esce nello shop nei primi round.\nPer il resto prova un po' di tutto le sinergie che puoi creare dipendono da cosa ti esce.\nPer il resto guarda video a riguardo","replies":[]}]}