{"poster":"MadGiorg","date":"2019-03-04T08:54:55.808+0000","title":"Primus, il Ranc&#hdlx*#@","subforum":"Discussioni generali","up_votes":1,"down_votes":2,"body":"Primus fu il primo campione ad essere programmato da Riot. Quando Lol uscì ufficialmente nel 2009 era praticamente giocato da chiunque. Era davvero forte, e sembrava quasi che quando il giocatore sbagliava qualcosa, Primus rimediava da solo agli errori del suo evocatore. La sua inspiegabile e forse magica intelligenza lo spinse a chiedersi chi fosse e come fosse finito in quello strano luogo, la Landa degli Evocatori. Dopo aver scoperto che tutto era un gioco, Primus lo disse agli altri campioni proponendo loro di evadere. Ma Riot scopri i piani del personaggio, e come lo aveva creato, lo distrusse, eliminando lo dal gioco e dalla memoria dei giocatori. Ora, dopo 10 anni, Primus ha deciso che se non potrà uscire dal gioco, lo romperà, così potrà avere la sua vendetta.\nPassiva: dove Primus cammina, scompone il terreno in dati e codici, infliggendo danni ai nemici circostanti e applicando cariche di Glitch. Dopo aver applicato tre cariche, il campione colpito subisce danni nel tempo e acquista la passiva di Primus col quale può danneggiare i suoi compagni. Quando Primus muore si scompone per riapparire nella fontana un po' in anticipo del normale. \nQ - un colpo a corto raggio che contamina tutta l'area dove colpisce infliggendo danni, rallentando, diminuendo armatura e resistenza magica e applicando cariche a chi ci cammina di sopra. \nW - Primus scatta diventando invisibile e creando una copia che ripeterà il movimento dopo 1 secondo. I nemici attraversati da Primus vengono danneggiati, quelli colpiti dalla copia vengono storditi. Se il bersaglio viene colpito da entrambi si corrompe, perdendo salute aggiuntiva e oro. Riprendendo la w si può cambiare la direzione verso la quale scatterà la copia\nE - passiva: le torri alleate colpite dalla passiva di Primus dopo aver distrutto il loro bersaglio colpiranno automaticamente un campione nemico se esso è nell'area della torre.\nAttiva: la velocità d'attacco di Primus inizia a aumentare nell'arco di 5 secondi, superando il limite e infliggendo danni extra ad area. \nR - Primus espelle un aura circolare che infligge all'istante danni ai nemici vicini,3 cariche di passiva e un lieve rallentamento. Dopodiché, se i nemici non lasciano l'area vengono trascinati al centro della stessa.\nCosa ne pensate? Fatemelo sapere","replies":[{"poster":"TheViceroys","date":"2019-03-04T09:27:48.625+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=MadGiorg,realm=EUW,application-id=MJVj50Jw,discussion-id=EQaPETiA,comment-id=,timestamp=2019-03-04T08:54:55.808+0000)\n>\n> Cosa ne pensate? Fatemelo sapere\n\n#**_~~Non puoi rompere la terza parete nella lore!~~_**\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"MadGiorg","date":"2019-03-04T09:59:54.264+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheViceroys,realm=EUW,application-id=MJVj50Jw,discussion-id=EQaPETiA,comment-id=0000,timestamp=2019-03-04T09:27:48.625+0000)\n>\n> #**_~~Non puoi rompere la terza parete nella lore!~~_**\n> {{sticker:zombie-brand-mindblown}}\n\nMi sembrava un'idea carina{{sticker:sg-poppy}}","replies":[]}]}]}