{"poster":"ParliaMént","date":"2016-03-24T07:21:06.598+0000","title":"Falsos...","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hay momentos en donde vengo a leer post solo para pasar el rato y tomarme un descanso del juego o simplemente por curiosidad a las novedades que hay en el foro, y en un gran porcentaje quizas el 95%, todos son educados, hablan bien sin recurrir a la violencia, ahora yo me pregunto por que carajos actuan asi aca y dentro del juego son el peor votimo que puedan crear?? sera por que en el foro los reportes sirven y en unos minutos se te borra el post? sera por que en el juego reportas a alguien que te arruino la partida y luego tuviste la mala suerte de que te toque otra ves y te vuelva a joder el game y asi y todo seguira jugando? por que no actuan asi en el juego?? si todos se comportaran como en el foro aunquesea al igual que aca asi bien falsos que lo hagan dentro del juego no serian unas partidas mas entretenidas y divertidas enves de tan frustradas y fomentadoras de la ira?? sera por que piensas que la cominidad ya esta arruinada y no va a cambiar en nada que vos empiezes a actuar diferente??? Gracias por leer.","replies":[{"poster":"Vi Sexual","date":"2016-03-24T07:25:16.619+0000","up_votes":2,"down_votes":0,"body":"Te cruzaste a alguien en el game y lo viste comentando bonito en el foro? xD\n\nMas alla de las bromas, es verdad que la hipocresia esta al abrir la puerta, pero te recuerdo que no todos los que juegan, usan el foro (lamentablemente...o tal vez afortunadamente viendo la cantidad de flamer que anda suelto). Pero no generalices, no todos los que somos \"bien educados\" (yo soy mal aprendido que es distinto) aca en el foro, somos flamers en el game, de hecho yo nunca tuve ningun tipo de sancion en el juego por flamear, y si la tuve aca en el foro siendo que tampoco flamee, pero soy de hablar/escribir palabras fuertes asi que, sancionao'. \n\nNo te desanimes.","replies":[{"poster":"ParliaMént","date":"2016-03-24T07:28:59.196+0000","up_votes":1,"down_votes":0,"body":"por supuesto que no me desanimo gracias al hermoso boton mute. pero cansa que en 3 años desde que juego al lol no vea mejoria de la comunidad.","replies":[{"poster":"Vi Sexual","date":"2016-03-24T07:30:27.471+0000","up_votes":1,"down_votes":0,"body":"Yo si he notado mejoria, o tal vez cambie yo mi forma de pensar. De todas formas mi comentario iba ambientado a los del foro> game , en el juego en si hay de todo..lamentablemente","replies":[{"poster":"ParliaMént","date":"2016-03-24T07:33:03.612+0000","up_votes":2,"down_votes":0,"body":"sep, cree un post generalista sin darme cuenta y no fue mi intencion. IS","replies":[{"poster":"Vi Sexual","date":"2016-03-24T08:09:22.778+0000","up_votes":1,"down_votes":0,"body":"No hay drama amigo, si queres agregame, y nos jugamos algunas arams, yo hago eso para distraerme, o jugo con amigos y se me pasa el tilteo jajaja.","replies":[]}]}]},{"poster":"Fighter Slayer","date":"2016-03-24T08:02:26.818+0000","up_votes":1,"down_votes":0,"body":"pero es el servidor de latinoamerica, lugar en el que todos se insultan por quien es mas negro... aaahhh me encanta latam.\n\n\n~~Me cago de la risa con el bardo no me juzguen{{summoner:4}} ~~","replies":[]}]}]},{"poster":"MercäJR","date":"2016-03-24T07:24:19.834+0000","up_votes":2,"down_votes":0,"body":"Es porque la mayoría de los que andan por acá de manera frecuente, son esos pocos que apenas hablan en partidas, o son súper positivos. Pocos son los que vienen acá y en el juego son súper flamers y tóxicos.","replies":[{"poster":"ParliaMént","date":"2016-03-24T07:30:53.669+0000","up_votes":1,"down_votes":0,"body":"al menos, el foro se mantiene decente, de no ser asi, no se que haria para despejarme un rato.","replies":[{"poster":"MercäJR","date":"2016-03-24T07:35:11.940+0000","up_votes":1,"down_votes":0,"body":"Yo vicio a otras cosas, o molesto gente en Twitter, es casi lo mismo que acá solo que con menos caracteres.","replies":[{"poster":"ParliaMént","date":"2016-03-24T07:38:04.570+0000","up_votes":1,"down_votes":0,"body":"hahaha {{sticker:slayer-jinx-wink}}","replies":[]}]}]}]},{"poster":"Asturios","date":"2016-03-24T15:39:00.328+0000","up_votes":1,"down_votes":0,"body":"Hay varias razones que se me ocurren:\n\n* ¿Por qué vas a estar enojado en el foro? Como vos bien dijiste aquí se viene a discutir, conversar, pasar el rato. Dentro del juego hay muchos factores que inducen la ira inclusive entre los más pacíficos, ni hace falta mencionarlos. De hecho la mayoría de los rage-post, cry-post, cualquier tipo de critica no constructiva (por decirle de alguna forma) que veas en el foro son de jugadores iracundos venidos del juego con una mala experiencia.\n\n* Creo que solo un 20% de los que juegan LoL visitan los foros, ni hablar de comentar de forma regular, es mucho menos. ¿Qué tiene que ver? Que la toxicidad es contagiosa, es una enfermedad. Imagínate que existan 10 foreros y de esos 3 sean tóxicos. Los otros 7 los van a identificar enseguida y los van a ignorar. Sin embargo si existen 100 foreros y 30 son tóxicos, aunque relativamente sea igual la cantidad respecto del total, es mucho más difícil mantener controlados a 30 tóxicos aunque existan 70 otras personas. Por lo tanto al ser un grupo más pequeño (20% del total) la toxicidad se contagia menos como expliqué.\n\n*  ¿Qué tipo de persona visita los foros? Creo que la mayoría de los tóxicos son niños pequeños  (12~17 años) que quieren parecer importantes. Obviamente existen personas mayores (22~27 años) de personalidad conflictiva que no se dieron cuenta que de nada sirve esa actitud dentro del juego. Dichas personas por su corta edad o su personalidad no se ven tentadas de entrar al foro.\n\n* Sumado a lo anterior el sistema de sanción es mucho más simple y eficaz lo que reduce aún más la tentación de ser agresivos de aquellos pocos que lo son o bien deben de buscar otras palabras lo cual amortigua mucho el impacto psicológico en los demás de querer responder de forma agresiva.\n\nMe disculpo si es muy largo y aburrido, es que me encanta hacer este tipo de análisis. Saludos y suerte en el juego ^_^","replies":[]},{"poster":"70veces7","date":"2016-03-24T08:12:55.391+0000","up_votes":1,"down_votes":0,"body":"mira yo en un comentario puse una palabra que ni siquiera es una fuerte ni nada por el estilo, y me banean la cuenta del foro por un dia, y no la pongo por las dudas, es una palabra muy de la jerga argentina. y en el chat de juego insulta con cosas mucho pero mucho peores y no pasa nada.","replies":[]}]}