{"poster":"FranklinDancec","date":"2015-10-12T00:04:26.607+0000","title":"I dont care about your meta e trollpick vari","subforum":"Discussioni generali","up_votes":4,"down_votes":1,"body":"Ultimamente mi sta succedendo molto spesso (deve averlo fatto qualche &quot;pro&quot; in streaming sicuro&quot;) chi non ottiene la sua posizione preferita dice qualcosa tipo &quot;i dont care about your meta, u cant report me for this so i trollpick&quot; e trollpicka robe tipo shaco adc o malzahar adc.\n\nOra, &egrave; una cosa reportabile? Se si per cosa? negative attitude? prenderanno mai provvedimenti o sono report sprecati?\n\ngrazie","replies":[{"poster":"R3lion","date":"2015-10-12T00:39:41.806+0000","up_votes":4,"down_votes":5,"body":"nha tempo sprecato, attualmente non è punibile alcun genere di troll, forse è possibile per feeding intenzionale ( ma deve essere veramente notevole e anche quello potrebbe essere una leggenda ) \n\ncmq quello che bisogna capire, è che se lui trolla, tu devi fargli capire che esiste sempre un troll maggiore.\n\nse sei in ranked il mio consiglio è: fermati al gold tanto li ti regalano la skin e poi fregatene e giu normal a nastro con amici\n\nse sei in normal, gioca quando puoi con amici, e in ogni caso aspetta l'ultimo pick, se nessuno fà stronzate ottimo, ti giochi il tuo game e tutto apposto, se qualcuno trolla, fagli capire che trollare non è una cosa per bimbi, ma che anche per trollare ci vuole skill, del tipo uno va malzar adc? perfetto io ti supporto con {{champion:223}} , cosa cè di male? che io al livello 1 sblocco la W, quella che mangi la gente, prendo l'item classico da support cosi sono grossino, poi appena arriviamo in lane che lui inizia a farmare lo mangio e lo porto dritto in faccia al nemico e glielo sparo contro poi me la telo, indovina che dei 2 inseguono i nemici XD. quando glielo hai fatto x 15 volte dietro fila tu ti becchi di certo 1 report per qualcosa, ma se non scrivi nulla non vieni bannato, lui prendimi sulla fiducia che, opzione 1 ragequitta e con un pò di culo si becca i game con coda lunga, gia ottima punizione perkè tanto tu ti sarai divertito tt il game come un matto a portarlo a morire ( certe volte ti toccherà flashare pur di portarlo contro il nemico a morire )  opzione 2 inizia a flammarti come non ci fosse un domani, in quel caso non dovrai dire assolutamente una singola parola, ma reportarlo a fine game, e vedi di sti tempi come fioccano bene i ban per linguaggio offensivo.\n\nquesto trucchetto funziona ovunque ovviamente, se lui non crede in questa meta o in quell'altra, io credo nella meta di aver un panzone che gira a fare duo top/mid/jungla o support/adc che mangia la gente e la sputa random.\n\npoi va bè ce ne sono tanti altri, anche solo basati sul rubare farm/kill, quello che conta è insegnare a un troller che se lo vuole fare lo deve fare bene, perkè in un game quello che conta è divertirsi, in genere preferisco divertirmi vincendo e giocare bene, ma se costretti anche il troll può rivelarsi molto divertente","replies":[{"poster":"BrattishSolid6","date":"2015-10-12T11:01:00.961+0000","up_votes":7,"down_votes":1,"body":"Quindi rispondi al troll trollando? Wow, così sì che capirà che trollare è sbagliato :D 10+","replies":[]},{"poster":"Exploooooosion","date":"2015-10-13T09:27:19.381+0000","up_votes":2,"down_votes":0,"body":"Trolli per counterare il troll.. e intanto quei 3 poveracci che vi han trovato in squadra perdono il game per colpa di non 1 ma bensì 2 troll.\nChe poi magari il malz adc giocava anche bene ma per colpa tua è andato 0-15 .\nNon so che dire sono veramente sconcertato","replies":[]},{"poster":"PrinceUsuiTakumi","date":"2015-10-12T09:51:40.435+0000","up_votes":1,"down_votes":1,"body":"report troll premade ;)","replies":[{"poster":"PrinceUsuiTakumi","date":"2015-10-12T09:53:11.052+0000","up_votes":1,"down_votes":1,"body":"E poi non conosci neppure come funziona tham devourer;il tuo alleato può scegliere in che direzione uscire.","replies":[]}]}]},{"poster":"FranklinDancec","date":"2015-10-12T13:02:00.136+0000","up_votes":2,"down_votes":1,"body":"Sinceramente comportarmi peggio di loro non mi sembra il caso e la mia visione di Lol è un pò diversa dalla tua, io lo prendo come un gioco competitivo dove migliorarmi (o almeno cercare di...) in continuazione, se dovessi giocare solo 4fun giocherei a Hots o una di quelle robacce li.\n\nmai trovato un trollpick che ha vinto la lane\n\nBoh vabe a questo punto sono sempre io quello che deve sorbirsi 30 minuti di attesa per i dodge pur di non giocare con sta gente, loro tutelati e io no, vabbbbe","replies":[{"poster":"FuryTheFenix ITA","date":"2015-10-12T13:44:11.673+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=FranklinDancec,realm=EUW,application-id=MJVj50Jw,discussion-id=2jFj8Ndv,comment-id=0004,timestamp=2015-10-12T13:02:00.136+0000)\n>\n> Sinceramente comportarmi peggio di loro non mi sembra il caso e la mia visione di Lol è un pò diversa dalla tua, io lo prendo come un gioco competitivo dove migliorarmi (o almeno cercare di...) in continuazione, se dovessi giocare solo 4fun giocherei a Hots o una di quelle robacce li.\n> \n> mai trovato un trollpick che ha vinto la lane\n> \n> Boh vabe a questo punto sono sempre io quello che deve sorbirsi 30 minuti di attesa per i dodge pur di non giocare con sta gente, loro tutelati e io no, vabbbbe\n\nIo mi sono trovato Rengar adc e Zac support.\nHanno Stra vinto o.o","replies":[{"poster":"FranklinDancec","date":"2015-10-12T14:21:44.530+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=FuryLegend1,realm=EUW,application-id=MJVj50Jw,discussion-id=2jFj8Ndv,comment-id=00040000,timestamp=2015-10-12T13:44:11.673+0000)\n>\n> Io mi sono trovato Rengar adc e Zac support.\n> Hanno Stra vinto o.o\n\nEd è per questo che tutti i team competitivi giocano zac e rengar in botlane","replies":[{"poster":"Frattaglia","date":"2015-10-12T14:26:30.294+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=FranklinDancec,realm=EUW,application-id=MJVj50Jw,discussion-id=2jFj8Ndv,comment-id=000400000000,timestamp=2015-10-12T14:21:44.530+0000)\n>\n> Ed è per questo che tutti i team competitivi giocano zac e rengar in botlane\n\nSi parla di normal, mica siamo ai mondiali o in una ranked team!","replies":[{"poster":"FranklinDancec","date":"2015-10-12T14:32:24.611+0000","up_votes":1,"down_votes":0,"body":"Io non ho mai parlato di normal ._.\nMi è capitato anche in normal ma il post era sopratutto per le ranked, in normal dodgio e aspetto in ranked perdo lp (cmq meno di quelli che avrei perso giocando con certa gente)","replies":[{"poster":"Frattaglia","date":"2015-10-12T15:21:26.836+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=FranklinDancec,realm=EUW,application-id=MJVj50Jw,discussion-id=2jFj8Ndv,comment-id=00040000000000000000,timestamp=2015-10-12T14:32:24.611+0000)\n>\n> Io non ho mai parlato di normal ._.\n> Mi è capitato anche in normal ma il post era sopratutto per le ranked, in normal dodgio e aspetto in ranked perdo lp (cmq meno di quelli che avrei perso giocando con certa gente)\n\nCapisco il problema (e quando becco disco nunu dodgio anche io), però non prendere quello che giocano ai mondiali come se fosse l'unica cosa giocabile, specie perché soloQ =/= ranked team.\nUna volta ho vinto una soloQ in cui avevo una LeBlanc adc (non stava trollando ma aveva sbagliato a pickare).","replies":[{"poster":"Ste the ripper","date":"2015-10-13T17:42:32.370+0000","up_votes":1,"down_votes":1,"body":"Beh vedendo questi mondiali non si può certo dire avessero il meta ristretto... hanno giocato ben 69 champ, mai così tanti nella storia. \nDirei che se non segui i mondiali questa volta un pochino trolli dato che hanno giocato quasi tutto il giocabile, persino kennen adc...","replies":[]}]}]}]}]}]},{"poster":"Ulamog95","date":"2015-10-12T15:06:06.089+0000","up_votes":1,"down_votes":0,"body":"io ho vinto una ranked con vel'koz fulltank top contro jax, non è stata la mia prima trollata e non sarà l'ultima","replies":[]}]},{"poster":"FranklinDancec","date":"2015-10-19T11:08:35.727+0000","up_votes":1,"down_votes":2,"body":"Quindi mi confermate che se devo giocare un ruolo che non mi piace posso pickare qualcosa di totalmente assurdo e sbagliato senza incorrere in sanzione alcuna?","replies":[{"poster":"Frattaglia","date":"2015-10-19T12:00:03.603+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FranklinDancec,realm=EUW,application-id=MJVj50Jw,discussion-id=2jFj8Ndv,comment-id=0007,timestamp=2015-10-19T11:08:35.727+0000)\n>\n> Quindi mi confermate che se devo giocare un ruolo che non mi piace posso pickare qualcosa di totalmente assurdo e sbagliato senza incorrere in sanzione alcuna?\n\nNo.","replies":[]}]},{"poster":"Ulamog95","date":"2015-10-12T15:26:01.075+0000","up_votes":1,"down_votes":0,"body":"allora ci sono due tipi di troll:\n1) chi trolla il proprio team\n2) chi trolla i nemici\nsappiamo benissimo che le persone che appartengono alla prima categoria meritano punizioni, anche in normal, perchè magari tu sei lì che provi un nuovo champ o magari stai imparando bene il tempismo  per le combo e perdi per il feeding smisurato di qualcuno.\nperò distinguere i due casi non è facile, io ad esempio faccio parte del secondo ordine, cioè uso champ in posizioni e con build insolite, per esempio teemo support (non prendo le kill all'adc), vel'koz top (più o meno tank), lissandra fulltank, cho'gath juggernaut(idra titanica, pegno di sterak e mannaia oscura) e l'irriducibile thresh full ad top(non adc, quella è roba da femminucce, io parlo di {{item:3078}} {{item:3072}} {{item:3508}}  {{item:3031}}  {{item:3139}} per oneshottare benbene), oppure gioco delle trollbotlane premade e ti assicuro che se te la giochi bene cercando di vincere l'unico ad essere trollato è il nemico, anche malzahar adc può funzionare, se spari la full combo mentre hai già tre cariche di passiva il nemico si ritrova con i danni base delle tue mosse e con 2 voidling che gli tritano le chiappe.\nil fatto è che a volte un troll \"sano\" perde la lane onestamente, cioè si becca il counter, se la gioca meglio l'altro, lo camperano o altra roba così e tutti magari credono lo abbia fatto apposta, certo, se prima ha detto \"omg ffs i troll feed lel\" sei abbastanza sicuro che fosse tutto calcolato, ma guardati i video dello youtuber \"discoheat\" e vedrai che non sempre è il troll ad avere torto.\novviamente la riot non sempre prende provvedimenti perchè purtroppo non può entrare nella testa dei reportati :/","replies":[{"poster":"Ste the ripper","date":"2015-10-13T17:40:05.831+0000","up_votes":1,"down_votes":0,"body":"In entrambi casi gli unici a venir trollati sono i tuoi compagni mentre i nemici si fanno sonore risate pensando a quanto siete cretini...\nCome lo yasuo adc di ieri, che poi io suo compagno sfigato mi trovo a dover carriare quel caso umano che insieme al support avevano dato 8 kill all'adc in 12 minuti... meno male io stavo snowballando e irelia ha un mid game devastante","replies":[]},{"poster":"Sorcio84","date":"2015-10-12T15:53:27.694+0000","up_votes":1,"down_votes":0,"body":"anche io appartengo alma seconda categoria\ndio\nche bello fare impazzire i nemici con {{champion:17}} full AP che gira per la mappa spammando funghi. 40% cdr {{item:3028}} e viaaaa :D\n\n{{champion:10}} {{champion:25}} bot e quella volta abbiano vinto a forza di scudarci a vicenda\n\n{{champion:1}} supp con un adc e poi si scopre che io mi faccio full AP e il mio adc full Apsd. indovina chi shotta XD","replies":[]},{"poster":"FranklinDancec","date":"2015-10-12T15:48:52.426+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ulamog95,realm=EUW,application-id=MJVj50Jw,discussion-id=2jFj8Ndv,comment-id=0005,timestamp=2015-10-12T15:26:01.075+0000)\n>\n> allora ci sono due tipi di troll:\n> 1) chi trolla il proprio team\n> 2) chi trolla i nemici\n> sappiamo benissimo che le persone che appartengono alla prima categoria meritano punizioni, anche in normal, perchè magari tu sei lì che provi un nuovo champ o magari stai imparando bene il tempismo  per le combo e perdi per il feeding smisurato di qualcuno.\n> però distinguere i due casi non è facile, io ad esempio faccio parte del secondo ordine, cioè uso champ in posizioni e con build insolite, per esempio teemo support (non prendo le kill all'adc), vel'koz top (più o meno tank), lissandra fulltank, cho'gath juggernaut(idra titanica, pegno di sterak e mannaia oscura) e l'irriducibile thresh full ad top(non adc, quella è roba da femminucce, io parlo di {{item:3078}} {{item:3072}} {{item:3508}}  {{item:3031}}  {{item:3139}} per oneshottare benbene), oppure gioco delle trollbotlane premade e ti assicuro che se te la giochi bene cercando di vincere l'unico ad essere trollato è il nemico, anche malzahar adc può funzionare, se spari la full combo mentre hai già tre cariche di passiva il nemico si ritrova con i danni base delle tue mosse e con 2 voidling che gli tritano le chiappe.\n> il fatto è che a volte un troll \"sano\" perde la lane onestamente, cioè si becca il counter, se la gioca meglio l'altro, lo camperano o altra roba così e tutti magari credono lo abbia fatto apposta, certo, se prima ha detto \"omg ffs i troll feed lel\" sei abbastanza sicuro che fosse tutto calcolato, ma guardati i video dello youtuber \"discoheat\" e vedrai che non sempre è il troll ad avere torto.\n> ovviamente la riot non sempre prende provvedimenti perchè purtroppo non può entrare nella testa dei reportati :/\n\n\n\nIo non concepisco proprio questo concetto di \"trollare\" ne amici ne nemici, sarà che son vecchio boh.\nNon si usa più outplayare meccanicamente l'avversario per farlo sentire inferiore?","replies":[]}]},{"poster":"taylorume","date":"2015-10-13T13:53:37.757+0000","up_votes":1,"down_votes":0,"body":"Ovviamente non puoi reportare un pick, ci mancherebbe, puoi reportare solo il comportamento. Nel tuo caso, a giudicare da quella frase, sembra qualcuno che trolla per protesta, se poi rovina il game intenzionalmente reportalo, se ne riceve tanti verrà punito. Se invece \"trollpicka\" ma gioca normalmente, non vedo il perché...","replies":[]},{"poster":"MrFix0o","date":"2015-10-12T11:35:07.775+0000","up_votes":1,"down_votes":0,"body":"Per quanto questo comportamento io lo ritengo scorretto, attualmente non è reportabile, a meno che non feedi intenzionalmente o flammi...\nNe parlavo con un utente qualche giorno fa qui sul forum riguardo i trollpick e gli instalock\nMeritano una punizione, ma non c'è scritto da nessuna parte che devi seguire il meta, ne che chi si prenota la lane nessuno gle la può fregare, è semplicemente una cortesia tra player per un game più godibile, che alcuni decidono di ignorare...se ti da tanto fastidio vai ad aspettare anni nella modalità cerca squadra\nSembra assurdo, ma i bimbiminchia che instalockano o trollpickano non sono reportabili a meno che non trasgrediscono altre regole {{champion:32}}","replies":[]},{"poster":"Frattaglia","date":"2015-10-12T12:51:42.821+0000","up_votes":1,"down_votes":1,"body":"E' un comportamento fastidioso e a mio parere reportabile (se fatto per ripicca).\nCiò non toglie che shaco ad e malzahar ad sono forti. :P","replies":[]},{"poster":"BrattishSolid6","date":"2015-10-12T11:02:58.363+0000","up_votes":1,"down_votes":1,"body":"Non penso siano report presi in considerazione. Nel caso prenda Malzahar adc e feedi allora conviene reportarlo per feeding intenzionale (poiché era sua intenzione andare con un trollpick ed era scontato il feed). Se prende Malzahar adc e flamma allora conviene reportarlo per luingaggio offensivo. Se prende Malzahar adc e vince la lane aiutando anche il team, beh, di cosa ti lamenti allora? :D In questo caso secondo me non c'è motivo di reportare.","replies":[]}]}