{"poster":"Bami96","date":"2016-03-11T13:35:03.672+0000","title":"Wie bekomme ich mid in dynamic queue?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Am liebsten spiele ich mid und ansonsten am ehesten noch support. Aber es ist einfach unm&ouml;glich mid zu bekommen, wenn man support als Ausweichrolle nimmt... \r\nIch habe auch schon probiert jgl oder top als ausweichrolle zu w&auml;hlen (obwohl ich diese Rollen nicht wirklich gut beherrsche) und auch dann bekomme ich einfach nicht mid :/\r\n\r\nHat jemand ein Tipp f&uuml;r mich oder habe ich einfach nur Pech?","replies":[{"poster":"Maexle","date":"2016-03-11T14:17:36.972+0000","up_votes":3,"down_votes":0,"body":"Das ist wahrscheinlich Pech, aber es liegt eben daran, dass es sehr viele Midlaner gibt. {{champion:17}}","replies":[]},{"poster":"Rayendriel","date":"2016-03-14T13:31:36.900+0000","up_votes":2,"down_votes":0,"body":"Es ist einfach ein Teufelskreis.\nLeute die auch gerne mal Support spielen geben es als zweites an, merken, dass sie damit fast immer supporten müssen und ändern es ab -> dadurch gibt es noch weniger Supporter im Pool und die Chancen für diejenigen die als zweites Support angeben steigen weiter die Rolle zu bekommen > dadurch ändern sie das vielleicht auch und es gibt wieder weniger Supporter....\n\n","replies":[{"poster":"The Real SLeYgA","date":"2016-03-16T01:05:02.028+0000","up_votes":1,"down_votes":0,"body":"Ja, hab ich genau so gemacht. Werde jetzt mid als zweites mainen statt Support, so Leid es mir tut, dass ich damit die Wartezeiten verlängere.","replies":[{"poster":"Rayendriel","date":"2016-03-16T13:10:46.404+0000","up_votes":2,"down_votes":0,"body":"Kann ich durchaus gut verstehen. Es wäre gut wenn es eine Art Beschränkung geben könnte. \nEin System das trackt wie oft man welche Rolle bekam und dann das Spiel auch wirklich stattfand und das darauf achtet die Leute nur ungefähr zu 25% in ihre Secondrolle zu schicken. Gibt es zu dem Zeitpunkt nicht genug Supporter muss eben gewartet werden. Aber ich denke so etwas zu entwickeln wäre nicht so einfach.","replies":[]}]}]},{"poster":"Sikn3ss","date":"2016-03-11T14:42:47.574+0000","up_votes":2,"down_votes":0,"body":"Ich frag mich wie du das hinkriegst:D\n\nIch wähle immer jngl/mid und kriege bei 3 von 4 spielen meine secondary Rolle: MIDLANE.\nIch bin zwar gut in der mitte will aber eig nur noch Jungle spielen und wähle Mid weil ich der Meinung war, dass Midlane am beliebtesten ist und trotzdem kriege ich midlane die meiste Zeit =( wir haben einfach Pech","replies":[]},{"poster":"Maíko","date":"2016-03-11T13:59:05.477+0000","up_votes":2,"down_votes":0,"body":"Ich wähle meistens Mid/Top...\nIn den Letzten 20 Spielen habe ich:\n16x Mid\n4x Top\nbekommen.\n\nScheinbar hast du nur großes Pech...oder ich viel Glück, aber einen besseren Weg Mid zu bekommen, als wenn man Top als sekundäre Rolle hat, wird es nicht geben.\nDa Top zurzeit wohl die 2. beliebteste Rolle ist.\n\nDu kannst natürlich auch in der Champselect deine Kameraden fragen ob sie mit dir tauschen...die meisten sagen zwar nein aber ich hatte auch schon einige dabei, die dazu bereit waren^^\n\nMfG Blacky","replies":[]},{"poster":"Anraton","date":"2016-03-11T13:50:07.187+0000","up_votes":2,"down_votes":0,"body":"du verstehst, wie das System arbeitet?\n\nich werde ein verkürztes Beispiel mit Mid, ADC & support machen ...\n\nstell dir vor, wir haben 6 Spieler .. 4x Mid/ADC, einmal ADC/Support, einmal Mid/Fill\n\nes gibt jetzt nur relativ wenig Möglichkeiten, aus diesen 6 Spielern ein Game zu starten, wobei der X/Support und X/Fill jeweils auf der Support Position landen und die anderen 4 sich Mitte und ADC teilen\n\n\nDas Qeueue System ist darauf ausgelegt, möglicht schnell games zu starten und Leute \"aus der Queue zu entfernen\"\n\nDeshalb passiert es eben regelmäßig, das überlaufene Positionen wie z.b. Mid seltener erhalten werden als \"unbeliebte\" wie z.B. Support. Hierbei sei gesagt, das es von den in der Queue angemeldeten Spielern abhängig ist, was gerade gefragt ist und was nicht. Riot selbst hat darauf keinen Einfluss (sie könnten höchstens Feedback geben, welche Positionen gerade überlaufen sind und welche gesucht werden)\n\nHoffe das war verständlich und hilft dir ein wenig weiter - auch wenn es nicht die Antwort war, die du dir erhofft hast ..\n\nEDIT:\nFeedback, ob diese Erklärung hilfreich war wäre nett.","replies":[]},{"poster":"Pain Hail","date":"2016-03-11T13:39:21.303+0000","up_votes":2,"down_votes":0,"body":"Ich denke, du hast Pech. Ich bekomme meistens Mid wenn ich Mid und Top wähle. ca. 20% der Games mal Top aber das ist halt lowelo, wie es bei dir dort aussieht weiß ich nicht so ganz aber wenn du ADC oder Supp wählst kommst du sicher nicht auf die Midlane.","replies":[]},{"poster":"JackTheStrípper","date":"2016-03-18T08:23:58.834+0000","up_votes":1,"down_votes":2,"body":"Scheiss doch drauf welche Rolle dir DynQ empfiehlt. Du willst Mid? Nimm es dir.","replies":[{"poster":"El Capitán TSV","date":"2016-03-18T15:29:47.728+0000","up_votes":1,"down_votes":0,"body":"Und wie? Wenn ein weiterer ebenfalls Mid gewählt hat und diese Position auch bekommt?\nEinfach wie in Season 5 Instalock? \n\nJeder weiß was dann passiert. Dir wird Krebs gewünscht, du und deine Familie soll sterben und die nächsten 20 Minuten sind einfach pures Warten. \"Surr 20 gg\". \n\nHat man nicht wirklich bock drauf. Ich zumindest nicht.","replies":[]}]},{"poster":"Nuix","date":"2016-03-14T10:15:30.536+0000","up_votes":1,"down_votes":0,"body":"Wenn du Support angibst, egal ob als erstes oder zweites, wirst du in 99% der Fälle auch Support sein.\nWähle also mid und x und du solltest zumindest eine 50% Chance haben, auch die Mitte zu bekommen.\nAchtung: Auffüllen wird ebenfalls als Support gewertet :)","replies":[]}]}