{"poster":"Kendomovie","date":"2015-08-28T01:56:34.855+0000","title":"Los que no saben jugar, que no les importa perder... ¿Para que rankean?","subforum":"Charlas Generales","up_votes":3,"down_votes":4,"body":"Siempre que le pregunto a un feeder, que no sabe farmear, o que no sabe buildearse, por que rankean... Siempre me responden \r\n&quot;Juego para divertirme ~~rata toxica~~&quot;\r\npero... por que rankean? \r\n\r\nLos que sepan la respuesta, y que jueguen para divertirse, y que no juegan del todo bien... porfavor, respondan :)\r\n\r\n~~OIE TOXICO RATA RATA RATA~~","replies":[{"poster":"ZanahoriaAsesina","date":"2015-08-28T02:26:50.231+0000","up_votes":3,"down_votes":0,"body":"Hay muchos tipos de personas en los juegos:\n\nEl que juega para divertirse y no para mejorar ni escuchar consejos.\n\nEl que juega para divertirse y a su vez no le importa el resultado final.\n\nEl que juega para divertirse y a su vez le importa mejorar.\n\nEl que juega para ganar pero no acepta consejos y le hecha la culpa a otros.\n\nEl que juega para ganar pero aun así se detiene a pensar si hace o no las cosas bien.\n\nEl que juega por jugar porque no tiene nada que hacer y usa el juego como un desestresante (me cruce varias veces en partidas coop vs IA donde simplemente se quedan vagando por el mapa sin comprar items siendo nivel 20-30).\n\nEl que juega sin importar el resultado y solo quiere lucir sus aspectos recién comprados.\n\nEl que según el día te puede insultar o piropear.\n\nEl que juega para ganar pero si pierde se rinde facilmente.\n\nPodría seguir todo el día pero bueno,no hay que buscarle mucho la vuelta hay personas que no son tan pasionales a la hora de jugar y hay otras que sienten mucha felicidad/tristeza cuando les aparece el cartel de victoria/derrota.\n\nAdemás no todos entienden lo importante que es una partida clasificatoria para algunos en general.\n\nSuerte!","replies":[]},{"poster":"materman 200","date":"2015-08-28T02:44:35.345+0000","up_votes":2,"down_votes":1,"body":"por que les faltan algunos cables","replies":[]},{"poster":"rokushoger","date":"2015-08-28T15:13:47.623+0000","up_votes":1,"down_votes":0,"body":"Y porque no van a jugar? Porque pueden, tienen ganas, les divierte, quieren jugar más seriamente, no quieren jugar con gente que les diga esa misma frase, no se razones hay miles.","replies":[]},{"poster":"AlienKirby","date":"2015-08-28T02:59:26.788+0000","up_votes":1,"down_votes":0,"body":"mmmm yo soy del los que juega sin importar el resultado aunque siempre busco hacer lo posible por ganar... juego para desestresarme y juego de todo: normal, aram, rankeds y a a veces dominion... \nPara mi subir de liga y esas cosas solo tiene sentido si buscas ser un jugador profesional, sino ¿para que?... \nAunque ahora que leo tu post veo que hay gente que se toma mas en serio las rankeds, no lo habia pensado y solo jugaba pensando en lo que a mi me importaba... desde ahora lo pensare mejor antes de entrar a ranked.","replies":[{"poster":"Dyaebl","date":"2015-08-28T13:51:30.609+0000","up_votes":1,"down_votes":0,"body":"Aunque jueges para divertirte queres ganar, el 90% con la opinion del que creo el post son los tipicos flammers de LAS que creen que se merecen 2 o 3 ligas(ligas, no divisiones) mas alto de lo que estan y culpan a los team de no llegar","replies":[]}]},{"poster":"Gordolfo","date":"2015-08-28T13:39:53.351+0000","up_votes":1,"down_votes":0,"body":"Por que pueden.","replies":[]},{"poster":"mapachinx","date":"2015-08-28T03:33:43.672+0000","up_votes":1,"down_votes":0,"body":"por que al estar en bronce 0 no pierden lp la idea seria que si pierdes 3 veces en bronce 0   te expulsan hasta que pages la reincorporación que te saldría 2000 pi o rps. asi los troles no existirían. si son los bronces 0","replies":[{"poster":"Kendomovie","date":"2015-08-28T05:10:02.590+0000","up_votes":1,"down_votes":1,"body":"es elo de oro... soy plata 1, no es bronce \"O\"","replies":[{"poster":"Natchin","date":"2015-08-28T12:55:52.306+0000","up_votes":1,"down_votes":0,"body":"que tierno eres xD\noro, plata, bronce es lo mismo xD","replies":[]}]},{"poster":"Assert","date":"2015-08-28T04:04:17.471+0000","up_votes":1,"down_votes":0,"body":"Disculpe señor pero **el rango es mayor cuando desciende el orden numérico**, un bronce 0 es mejor que un bronce 1 y peor que un plata 5. Pero como los romanos no inventaron el 0 xD, no existe tal rango. Por lo que uds se refiere a los bronces 5, 6 ..., XL , XXX.\n\nSaludos","replies":[{"poster":"mapachinx","date":"2015-08-28T05:35:13.599+0000","up_votes":1,"down_votes":0,"body":"lp 0","replies":[]}]}]},{"poster":"nifu","date":"2015-08-28T12:15:46.769+0000","up_votes":1,"down_votes":0,"body":"yo soy un manco.","replies":[]},{"poster":"Pecris","date":"2015-08-28T11:29:04.954+0000","up_votes":1,"down_votes":0,"body":"Lo que yo pienso sin ser uno de ellos es porque les gusta el modo de juego, me explico; es un juego más organizado que las normales, en donde se banea, se pickea por orden, etc (está de más explicarlo si todos aquí lo sabemos) entonces eso de cierta forma atrae, a mi personalmente me gusta eso de las rankeds, ser algo más \"estratégico\" que las normales. Creo de hecho que en otros servidores hay un modo de normal \"estilo ranked\"\n\nSaludos!","replies":[]},{"poster":"lordeman10","date":"2015-08-28T07:31:34.148+0000","up_votes":1,"down_votes":0,"body":"no tendría que molestarte, ese va bajar y vos vas a seguir subiendo, no dependés de el es solo una partida\n\nno podes obligar a la gente a jugar mejor o igual que vos.. pensa en vos mejora tu juego que siempre algo mejor se puede hacer \n\ny ojo, se ve que estás ofendiendo a la gente para que te contesten así muchas veces esa respuesta es en defensa de que lo estes flameando, no es que realmente no le importe la partida, si querés ganar evita hablar porque vas a bajarle la moral a tu equipo y hacer que te reporten de gusto (no van a mejorar porque se los digas pero si lograrás que jueguen peor o abandonen) \n\npersonalmente creo que no hay que olvidarse que ante todo, esto es un juego, a ninguno nos pagan por entrenar y prepararnos para una partida antes de jugarla nos puede ir mal no es un trabajo, jugamos a intentar ser los mejores en soloQ nada más.. no hay que ofender a nuestros compañeros de juego todos estamos para divertirnos al fin","replies":[]},{"poster":"Silver000","date":"2015-08-28T03:23:27.832+0000","up_votes":1,"down_votes":0,"body":"Me gusta el ambiente que generan las rankeds, de todas formas las pocas veces que la jugué hago lo que puedo para ir con algo que maneje bien","replies":[]},{"poster":"Kobalth","date":"2015-08-28T03:00:53.134+0000","up_votes":1,"down_votes":0,"body":"Cuando te quieres quejar de alguien o algo. Usa sarcasmo","replies":[]},{"poster":"Assert","date":"2015-08-28T02:56:53.061+0000","up_votes":1,"down_votes":0,"body":"A mi me gusta jugar, no me importa perder; por que se que le di todo{{champion:44}} ... a la partida.\nEso si reporto a los que se lo merecen : {{summoner:14}}, {{champion:48}}, {{champion:17}} y {{item:3340}}  \n\nnos vemos","replies":[]},{"poster":"Runth","date":"2015-08-28T03:23:19.142+0000","up_votes":2,"down_votes":3,"body":"porque son bronces, no quieren mejorar lo q le falta","replies":[]}]}