{"poster":"Sylasi Elvtárs","date":"2017-11-21T11:47:41.712+0000","title":"A Magyar LoL Fórumközösség Discord Szervere","subforum":"Minden egyéb","embed":{"description":"Step up your game with a modern voice & text chat app. Crystal clear voice, multiple server and channel support, mobile apps, and more. Get your free server now!","url":"https://discord.gg/JQaTtsN","image":"https://discordapp.com/assets/ee7c382d9257652a88c8f7b7f22a994d.png"},"up_votes":8,"down_votes":1,"body":"Üdvözlet fiúk, lányok... és Yasuo main-ek!\n\nMegragadnám a lehetőséget, hogy a \"kis\" közösségünket hirdessem.\n Egy baráti csatornát kínálunk ahol nyugodtan kérdezhetsz bármit, útbaigazítást kaphatsz ha bármi gondod van a játékkal, klienssel (lényegesen hamarabb mint a fórumon) de meghallgatjuk a 16. promo vereséged történetét is. \n\nTagjaink szinte minden Rangsorolt osztályban képviseltetik magukat, nem lehet probléma ha játékostársakat keresel komoly mérkőzésekre, de nem maradsz egyedül akkor sem ha a Normál módot preferálod. Ki tudja, talán itt találod meg a következő csapatod/duo társad.\n\nKezdő játékosokat is szívesen látunk, tippekkel és tanácsokkal gazdagodhatnak nálunk.\n\nAmennyiben felkeltettem az érdeklődést, [erre tessék](https://discord.gg/JQaTtsN). Itt egy rövid **regisztrációs folyamat után, beengedjük az illetőt a szerverre és csak ezt követően válnak láthatóvá a szobák.** Az első teendő a #betoppano szobába való beköszönés.\n\nEgy kis ismertető azoknak akik most hallanak előszőr róla: **Mi az a Discord**?\n\n> Egy játékosok számára létrehozott hang és szöveg továbbítására alkalmas alapvetően ingyenes program.\n> A Teamspeak és a Skype leváltását tűzte ki céljául. Böngészőből, telepítés nélkül, továbbá Android illetve iOS eszközökön is elérhető egy applikáció formájában.","replies":[{"poster":"Tundra","date":"2017-11-21T12:30:14.229+0000","up_votes":2,"down_votes":0,"body":"Mindenkinek, aki nem ismerné vagy még nem vette rá magát arra, hogy kipróbálja: Nagyon tudom ajánlani a Discord-ot! Remek program! :)\n\nEleinte ódzkodtam tőle, mert körülményesnek és szokatlannak tűnt. De amióta kicsit megismertem, már gyakorlatilag csak ezt használom TeamSpeak és Skype helyett.\n\nItt van, hogy lényegében miért: https://discordapp.com/features","replies":[]},{"poster":"kriistoof12","date":"2019-05-18T14:22:23.765+0000","up_votes":1,"down_votes":0,"body":"Nekem az a kerdesem lenne hogy menyi idobe telik hogy a szervere be engedjenek?","replies":[]},{"poster":"Neith3d","date":"2017-11-22T23:56:16.600+0000","up_votes":1,"down_votes":1,"body":"Valaki yasuo main-t emlitett ?","replies":[]}]}