{"poster":"Seamus83","date":"2016-12-06T20:31:57.288+0000","title":"Consigli Su Luciano","subforum":"Aiuto e supporto","up_votes":2,"down_votes":2,"body":"Ragazzi volevo qualche consigli su Lucian il pistolero , ho da poco iniziato a giocarlo e mi piace tantissimo .\r\nFaccio veramente schifo come adc , farmo decentemente 75 cs circa in 10 min , Ho notato che Lucian con quel farm riesce a farsi il drake a lvl 6 anche da solo (ma usando la ulti)!\r\nCosa ne pensate , sarebbe worth usare la ulti per il drake appena fatto il livello 6 (con bot nemica magari che ha fatto il racall) !? per poi rimanere in laning phase senza?! \r\nScusate la mia bronzaggggggine","replies":[{"poster":"Viktòr","date":"2016-12-07T00:11:41.145+0000","up_votes":1,"down_votes":0,"body":"Ciao Seamus83,\nPremetto che la tua è una domanda alquanto insolita, anche per me che sono un ex Lucian main.\nComunque, ti sconsiglio fin da subito di provare a fare il drake da solo (o comunque senza il tuo jungler) quando sei ADC, è una scelta rischiosa che può portare a conseguenze rovinose per il tuo team.\nTi faccio un esempio (molto pessimistico, ma comunque possibile): la bot nemica è assente, quindi tu e il tuo support decidete di fare il drake da soli. Per caso (o forse per una ward) arrivano il jungler e il mid nemici, seguiti dalla bot che intanto ha fatto ritorno dalla base.\nPuoi immaginare le conseguenze... e un'idea che in principio sembrava buona si rivelerebbe pessima, quindi ti consiglio sempre di aspettare il jungler alleato, prima di fare il drake, anche quando la situazione sembra abbastanza tranquilla.\nSe per prendere il drago hai dovuto usare la ulti e quindi ti ritrovi in lane senza, non preoccuparti. Cerca solo di evitare di ingaggiare (e quindi ovviamente cerca anche di evitare gli ingaggi nemici) fino a che non ti torna disponibile, così sarai di nuovo in grado di fightare i nemici.\nSpero di esserti stato utile con il mio commento, ciao!","replies":[{"poster":"Seamus83","date":"2016-12-07T00:19:11.528+0000","up_votes":2,"down_votes":0,"body":"Ciao Viktor, lo so che è insolito il fatto è Che solitamente sono molto accorto delle posizioni nemiche e chiamo il drago solo se sono sicuro che non ci sia il jungler o mid nemico (sapendo che la bot ,ha fatto il recall) così io starto il drago con il supp mentre pongo al mio mid ed il mio jungler.\nIl quesito era solo su quanto fosse worth \"sprecare\" la ulti per il drago sapendo che in early ha in cd abbastanza elevato","replies":[{"poster":"Viktòr","date":"2016-12-07T10:02:58.388+0000","up_votes":1,"down_votes":0,"body":"Personalmente credo valga la pena di usare la ulti solo per assicurarsi un drago infernale o uno della montagna, mentre dubito valga la pena \"sprecarla\" per uno degli altri due.\nRicordati sempre di giocare difensivo mentre la tua ulti è in cooldown, a meno che non ti trovi contro degli ADC le cui ulti non servono a fare danni, ad esempio {{champion:429}} o {{champion:15}} .","replies":[]}]}]}]}