{"poster":"Seamus83","date":"2016-10-24T18:38:17.071+0000","title":"BUG Syndra - Lux","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"ragazzi ultimamente volevo imparare ad usare Syndra , mentre giocavo un paio di normal spesso mi &egrave; capitato di trovarmi contro lux .\r\nCome da titolo ho riscontrato quello che penso possa essere un bug sia grafico che di gioco..\r\nSe  {{champion:99}}  sta ultando e {{champion:134}} mentre la ulti &egrave; in channeling ,la stunna  di Q E la ulti di {{champion:99}}  continua tranquillamente il channeling e l&#039;animazione (nonostante lei sia stata graficamente stunnata ed allontanata ) , facendo comunque il danno ... ora mi chiedo , &egrave; un bug o &egrave; cos&igrave; che funziona?! del tipo se lux mi fa una full combo il mio unico modo per salvarmi &egrave; zhonyare!?!?!","replies":[{"poster":"Chroniicles","date":"2016-10-24T19:06:44.510+0000","up_votes":2,"down_votes":0,"body":"La ulti di lux non è un channeling, addirittura se la sposti mentre ulta il laser parte dalla posizione pre cc ^^","replies":[{"poster":"Seamus83","date":"2016-10-24T22:24:44.987+0000","up_votes":1,"down_votes":0,"body":"ok , ma è normale come cosa?! cioè se io la stunno mentre ulta non dovrebbe annullare la ulti !? >.<","replies":[{"poster":"Phrasant","date":"2016-10-25T05:50:37.414+0000","up_votes":2,"down_votes":0,"body":"purtroppo (o per fortuna) è normale, è sempre stata così. O la stunni prima della full combo o la eviti, non c'è modo di bloccare quella ulti","replies":[{"poster":"Seamus83","date":"2016-10-25T07:51:10.506+0000","up_votes":1,"down_votes":0,"body":"#FeelsBad mate T.T verrò perma instashottato con syndra , visto che non ha molta mobility e provare a dodgiare la q .. con quell'hitbox sopratutto se prima di tira la W è quasi impossibile","replies":[{"poster":"Pasticcionex","date":"2016-10-25T12:11:24.011+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Seamus83,realm=EUW,application-id=98NGV4Al,discussion-id=8jEcXYEa,comment-id=0000000000000000,timestamp=2016-10-25T07:51:10.506+0000)\n>\n> #FeelsBad mate T.T verrò perma instashottato con syndra , visto che non ha molta mobility e provare a dodgiare la q .. con quell&#x27;hitbox sopratutto se prima di tira la W è quasi impossibile\n\nSe ti alleni un pò con syndra vedi che ce la fai, non è impossibile come pensi te... Prima del 6 gli fail il Culetto a Lux perchè gli spammi Q e combo varie. Poi mettiti barriera e flash e non ignite e flash che ti aiuta al livello 6 a resistere al burst di lux, poi cmq se tu te la giochi bene, spammi qualche Q poi vedi quando è il momento giusto gli butti le E per stunnarla su una Q che sta in lane, poi fai W-Q e R e lei muore credimi! Poi vai a gankare e gg! Cmq se ti riesci a gestire il mana diventi OP, magari come primo item dopo il recall comprati il primo pezzo del Morello{{item:3802}} .","replies":[]}]}]}]}]},{"poster":"Chroniicles","date":"2016-10-25T07:18:02.571+0000","up_votes":1,"down_votes":0,"body":"Esatto, è considerata uno skillshot e quindi una volta castata parte in quella direzione, ha un tempo di animazione più lungo rispetto altri skillshot e si è portati a pensare abbia un tempo di canalizzazione ma non è così.","replies":[]}]}