{"poster":"Yuutaro","date":"2015-07-04T21:22:10.180+0000","title":"¿Cuál es la idea?","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":0,"body":"Ah, ya no soporto m&aacute;s esto y por lo mismo ven&iacute;a a ver si en el foro exist&iacute;a gente con razonamiento y con la que se pueda discutir.\n\n&Uacute;ltimamente me ha pasado que mi pc me bota del lol (pc viejo pls) y por lo mismo a veces entro tarde a las partidas, cosa que por lo general molesta a los jugadores, pero una vez te pones al d&iacute;a y ayudas, consigues \"perd&oacute;n\" o buena onda (rara vez pasa).\n\nPero hoy hubo algo que colm&oacute; mi paciencia.\n\nMe puse a jugar un aram desde otro computador y nuevamente me bot&oacute; el lol, ahora con una cosa de la tarjeta de video, blah, entr&eacute; tarde y por mala suerte no s&eacute; usar a Tristana, y lamentablemente llegu&eacute; a morir, algo que hizo que todo mi \"team\" (ni equipo quiero llamar a esas personas) empezara a reclamarme, recib&iacute; muchos insultos por no haber podido hacer mucho, y bueno admito que no fui de mucha ayuda, pero me llev&eacute; todo el odio e incluso todos amenazaron con reportarme, cosa que imagino hicieron y espero hoy se golpeen el dedo chiquito del pie por su estupidez, en fin, volviendo al tema &iquest;c&oacute;mo es posible que la gente se ponga as&iacute; por perder un aram? &iquest;De verdad que toda la comunidad es as&iacute;? &iquest;o yo tengo la ENORME mala suerte de toparme justo con los pesados que a veces ni ellos mismos se dan cuenta de sus errores? y que para variar, nadie les remarca, pero cuando te atacan a ti no puedes hacer nada porque \"eres p&eacute;simo\", \"comprate manos\" y un sin fin de cosas.\n\nSi alguien t&oacute;xico llega a responder por estos lugares **&iquest;Cu&aacute;l es la idea de ser un horrible ser humano y arruinar la experiencia de juego? ** En serio tengo curiosidad por saber qu&eacute; demonios hay dentro de esas mentes que no juegan por diversi&oacute;n, sino por competencia y al parecer dejar en claro que en su casa se tratan a insultos como para que pase lo mismo en un juego online.\n\nSinceramente me hart&eacute; de la toxicidad y me encantar&iacute;a recibir consejos para combatirla, y no el mute, porque a final de cuentas imagino que los ardidos que pierden normales de todas formas reportan y no es la idea tampoco &iquest;Acaso lo &uacute;nico que queda es jugar s&oacute;lo con amigos para pasarla bien? &iquest;O acaso Riot est&aacute; haciendo algo para eliminar a esas personas?.\n\nEn realidad no s&eacute; qu&eacute; espero conseguir de este post, pero al menos ya saqu&eacute; lo que ten&iacute;a en mente antes de perder los estribos, ojal&aacute; que todos tengan un muy buen d&iacute;a y no les toquen a los t&oacute;xicos infelices que ning&uacute;n juego quiere dentro.\n\nSaludos.","replies":[{"poster":"Rebkans","date":"2015-07-04T21:45:11.963+0000","up_votes":3,"down_votes":0,"body":"Nosotros justamente creamos un grupo antiflamer donde   agregamos a gente  que  quiere jugar con gente respetuosa y sobretodo, divertirse sin tener que preocuparse de la gente  toxica. Si queres unirte, avisame","replies":[{"poster":"Cedriel","date":"2015-07-06T14:07:37.428+0000","up_votes":2,"down_votes":0,"body":"Buena iniciativa. :)","replies":[]},{"poster":"Yuutaro","date":"2015-07-04T21:56:22.943+0000","up_votes":1,"down_votes":0,"body":"Woah, me parece una excelente solución ¿Cuál es el grupo O:?","replies":[{"poster":"EzeK","date":"2015-07-04T22:37:38.575+0000","up_votes":1,"down_votes":0,"body":"x2 cual es el grupo ?.","replies":[{"poster":"Rebkans","date":"2015-07-04T22:52:16.395+0000","up_votes":1,"down_votes":0,"body":"https://www.facebook.com/groups/851871568235518/\nLo que si, tambien hay lvl bajos, porque la idea es tambien ayudar a los nuevos","replies":[]}]}]}]},{"poster":"judas94","date":"2015-07-05T04:11:16.258+0000","up_votes":2,"down_votes":0,"body":"Vos también arruinas la experiencia de juego del resto jugando desde una computadora que sabes que te va a sacar del juego.","replies":[]},{"poster":"arondightFTW","date":"2015-07-04T21:42:36.552+0000","up_votes":2,"down_votes":0,"body":"cual es la idea de jugar con un pc que sabes que te va a botar? xd \nlo de ellos no esta bien, pero lo tuyo como que tampoco :/","replies":[{"poster":"Yuutaro","date":"2015-07-04T21:55:55.319+0000","up_votes":2,"down_votes":0,"body":"Por algo me cambié de pc xD no pensé que pasaría eso, y lo otro me empezó a pasar ante ayer que el server me bote :/","replies":[]}]},{"poster":"OG Noah do Bree","date":"2015-07-06T20:59:41.073+0000","up_votes":1,"down_votes":0,"body":"a mi por perder un aram (jugue una de esas partidas en las que no tenes ni un mínimo de reflejos)  me agregaron para poder seguirme insultando, lo pero es que creo que estaba enojado porque tenia una skin para ese campeón. Todavía me arrepiento de no denunciarlo en el soporte","replies":[]}]}