{"poster":"awdaf","date":"2016-06-27T20:08:47.767+0000","title":"Explain yourself Riot","subforum":"Gameplay","up_votes":147,"down_votes":44,"body":"Champion pool has grown to more than 140 Champions, still only 3 bans a team\r\n\r\nNew champ select gives only the bottom 3 people one ban each\r\n\r\nCan we please have one ban per person.","replies":[{"poster":"Ghostcrawler","date":"2016-06-29T19:59:36.496+0000","up_votes":69,"down_votes":67,"body":"In my mind, here are the reasons to increase number of bans:\n\n- Give each player on the team a choice\n- Increase champion diversity by making it easier to shut down no-brainer or over-dominant picks\n- Potentially make spectating (especially esports) champ select more interesting\n- Maybe less motivation to use picks as an additional ban? I concede this one is iffy.\n\nAnd here are the reasons not to increase bans:\n\n- Champion select lasts long enough already\n- If you just keep increasing bans, at some point it gets silly (30 bans?)\n- Could shut down some very specialized comps (e.g. protect the Kog)\n- Could shut down signature picks (e.g. Froggen Anivia, or just the one champ that you really like to main)\n\nFor champ select, it doesn't have to be the case that duration just keeps increasing, and it still feels a little long to me personally today. Maybe we should just shorten it. \n\nFor the slippery-ish slope argument that ban numbers could potentially get silly, we could also just not do that, and as I've said before, it doesn't have to be the case that ban numbers just increase forever. Maybe we go to 10 bans and that lasts for the next several years? (We also make new champions at a slower cadence than we used to, so \"What do when you have 200 champs?\" isn't a problem we'll need to tackle soon.) \n\nThe final two cons (\"could shut down\") is a little trickier, but could potentially be mitigated with some kind of snake draft so that all the bans don't happen at once. If you sense the enemy team is specifically trying to shut down your strategy, go ahead and lock in those champs you do need, or else pivot to a new strategy. I do think it would be unfortunate if pros and players alike just shifted to more generalist champions since they couldn't count on important team synergies.\n\nIt's not uncommon in game design to be dealing with competing goals (such as making champion select fairly quick but also making it interesting). You just have to decide if one goal is ultimately more important, or try to come up with a novel solution that can meet both.","replies":[{"poster":"Keevalroy","date":"2016-06-29T20:39:57.192+0000","up_votes":134,"down_votes":23,"body":"You talked a bit about your views for the reasons not to add more bans, but I'll just share my own reactions to them since I've seen them re-used way too many times with nothing new added.\n\n\n>Champion select lasts long enough already\n\nRemove the few seconds at the start of the game where you are supposed to pick what champion you want to play and decrease the ban timer slightly.  It might be a little bit longer, but i'd think 4 more bans is worth it.  I know the concern now, what about people worried about bans of the champs they want to play? A work-around is when you queue up for your roles, you could have the champion screen pop up and you would select the champion you want to play for the selected roles. That way, you're loaded in with who you have in mind, and everyone can see it.\n\n>If you just keep increasing bans, at some point it gets silly (30 bans?)\n\nI wish Riot would stop using this argument. It's not going to be a slippery slope - all we're asking for is that the last two members of each team  have an option to ban someone they don't want to see in their game.  The argument made on one of the podcasts was paraphrased as \"Well, if we give them 4 more, pretty soon, there's gonna be 100\" or something along those lines. It's purposefully over dramatic for the sake of the idea, I get it, but it remains to be a poor argument with the current roster and their kits.  The counter-argument of \"we wouldn't demand more bans if the champions were both balanced and healthy for the game\" works here was well...just something to keep in mind.  Ten is a good even number, and everyone gets to ban one champ - that's about as fair as you can make pick / ban. \n\n>Could shut down some very specialized comps (e.g. protect the Kog)\n\nI thought diversity by means of strategy and strategic banning was something Riot wanted?  \n\n>Could shut down signature picks (e.g. Froggen Anivia, or just the one champ that you really like to main)\n\nShutting down one trick ponies...oh how awful.  It's their fault for not knowing how to play more than two champions. I'll use the game health point again; maybe if the perma banned  were healthy and balanced, those champions wouldn't be banned so much.  As for the pro scene, once again, if it's that important that people in the pro scene don't get banned out (because let's be honest, Riot doesn't want someone in the LCS to be forced onto something they're uncomfortable on because it makes for a cringy viewing for their precious show) then let them have 6 bans and introduce 10 to everyone else. Everybody wins. \n\n\nThe one over-used argument I'm surprised I didn't see was \"If 10 overpowered champions get banned, people will move to the next 10 overpowered champions.\"  It's not going to happen, I can almost guarantee that.  If Riot prides itself in diversity after artificially changing the meta by constantly buffing champs sometimes over the edge and nerfing others out of existence, this will bring _natural_ diversity back into the game. \n\nLet's say junglers are being targetted in a champ select, and your jungler realizes that their current mains are banned, and is forced to reach for pocket picks or to remember champions they used to play like...Olaf? After hesitantly locking him in, the Ashe on the other team is now panicking at the thought of Olaf running her down like an animal, so she needs protection.  The Bard that was about to be picked isn't going to be very useful against an Olaf, but _Tahm_ can save her. Even though he's not meta anymore, he can protect Ashe, and although that's just one example, that game's bot lane is now that much more diverse.\n\nEdit: For the one-trick segment, I should have specified I was talking about FotM abusers claiming that Fiora is their main when tank Fiora was meta or how they mained Ezreal when blue build first started with Elder Lizard. ","replies":[{"poster":"Rabid Husky","date":"2016-06-29T22:00:13.739+0000","up_votes":42,"down_votes":17,"body":"aw shit someone just smited riot","replies":[{"poster":"Blackquill","date":"2016-06-30T11:22:07.862+0000","up_votes":11,"down_votes":0,"body":"If anything at all he smited Ghostcrawler...and not even that. From what i have heard so far he is not really opposed to having 10 bans, 1 for each player.","replies":[]}]},{"poster":"ssìpsae","date":"2016-06-30T00:09:42.917+0000","up_votes":15,"down_votes":4,"body":"I couldn't have worded this any better. These are true facts, spoken well and true.\n\nI can't believe Riot made some of those arguments as a valid idea.\n\n> If you just keep increasing bans, at some point it gets silly (30 bans?) \n\nLike...Are we dealing with a 10 year old? We asked for an appropriate amount of bans which would be 4 on each team or 5. Not some retarded 50 bans of champions. Have you seen any game (Moba) that banned half the champion pool? Atleast Dota 2 has a very nice pick/ban phase that brings diversity and amazing combos. \n\n> Champion select lasts long enough already\n\nReally? Try to lower the queue times and make a better system for it. If you don't want the queue times long why even make that 15 seconds of wait on champion select.","replies":[]},{"poster":"Swag McYoloScope","date":"2016-06-29T21:58:46.201+0000","up_votes":3,"down_votes":27,"body":"consider posting less","replies":[{"poster":"Keevalroy","date":"2016-06-29T22:02:48.936+0000","up_votes":10,"down_votes":2,"body":"> [{quoted}](name=Swag McYoloScope,realm=NA,application-id=3ErqAdtq,discussion-id=BXOezvo6,comment-id=001900030000,timestamp=2016-06-29T21:58:46.201+0000)\n>\n> consider posting less\n\nOh no, I think you hurt one of my delicate feelings. I don't have many left so it's kinda serious...or maybe not.","replies":[{"poster":"I was Lupxel","date":"2016-06-30T01:03:57.070+0000","up_votes":4,"down_votes":1,"body":"What a God\n(no sarcasm)","replies":[]}]}]},{"poster":"Dengeden","date":"2016-06-30T02:19:11.790+0000","up_votes":2,"down_votes":9,"body":">I wish Riot would stop using this argument.\n\nSorry, it's the counter to the original argument for more bans which was the ever-increasing champion roster. (Not to mention you guys would undoubtedly keep finding things you consider \"unhealthy\").\n>we wouldn't demand more bans if the champions were both balanced and healthy for the game\n\nYou see? Now that is an argument *I* wish you would stop using. We have had what? A 100 patches? 200? Every champion, every item build, every strategy has been viable ... only never at the same time.\n\nThat's simply how the game works. How any game works. A strat either works because it gives players ample opportunity to execute it (and the enemy limited room to counter it) or it doesn't. It's a somber state of affairs, I know, but it's the truth.  \n>I thought diversity by means of strategy and strategic banning was something Riot wanted?\n\nThat depends on wether the bans would telegraph the teams' strategy. If, on the other hand, you could ban out one or two meta picks and neuter Juggermaw thusly, Juggermaw would become unreliable.\n>this will bring natural diversity back into the game.\n\nHow? I don't see how that makes any sense. What? Are you saying a ban technically constitutes as a nerf? If so, you still did the same thing Riot did, which, according to you, \"artificially changes the meta\". And then we're indeed at the point where 10 new OP picks crop up.\n>After hesitantly locking him in,\n\nBecause he usually doesn't play immobile full tank junglers and will inevitably be a detriment to his team because of it.\n>the Ashe on the other team is now panicking at the thought of Olaf running her down like an animal\n\nRiiiiight, she didn't consider what could be picked into Ashe. What theoretical elo is this again?\n>so she needs protection. The Bard that was about to be picked isn't going to be very useful against an Olaf, but Tahm can save her. \n\nAnd lose lane for her too, turning her into an arrow bot who relies on Hurricane waveclear ... at best. Heck she might give up a few kills because a meta support (or you know, a counter to Tahm) will crush the AsheKench lane.\n\nOlaf doesn't even need to go bot, he can go to other lanes, making the Tahm counterpick completely worthless. If Tahm eats Ashe in teamfights, he's already removed her as a damage threat, allowing Olaf to run down the midlaner instead.\n>Even though he's not meta anymore, he can protect Ashe, and although that's just one example, that game's bot lane is now that much more diverse.\n\nIn your dreams. If it were that simple, we would see more counterpicks. \nIn reality, it's a game of \"Hah! I counter you in lane or in teamfights!\"\n\"That's cute, I beat you at everything else because my numbers make me meta and yours don't.\"\n\"Shucks, I guess I shouldn't pick that then, huh?\"\n\"Nooooope\"","replies":[{"poster":"Blackquill","date":"2016-06-30T11:33:44.804+0000","up_votes":3,"down_votes":1,"body":"> Sorry, it's the counter to the original argument for more bans which was the ever-increasing champion roster. (Not to mention you guys would undoubtedly keep finding things you consider \"unhealthy\").\n\nYep!\n\n> You see? Now that is an argument I wish you would stop using. We have had what? A 100 patches? 200? Every champion, every item build, every strategy has been viable ... only never at the same time.\n\n>That's simply how the game works. How any game works. A strat either works because it gives players ample opportunity to execute it (and the enemy limited room to counter it) or it doesn't. It's a somber state of affairs, I know, but it's the truth.\n\nShots fired. More people should realize that not everything can be top tier at the same time. That being said though Riot can do a better job at diversifying certain roles. For 1 1/2 year now we had the utterly obnoxious reign of Alistar/Braum in pro play and as a support main myself i hated watching pro play. What am i supposed to learn from the best if they dont play the champions i like? Right now we have a much better botlane meta. Karma, Thresh, Janna, Zyra (for the first time since S3 worlds), Braum, Nami (for the first time since S4 worlds, if i might add) are all more viable and picked and i think that the Forbidden Idol changes in 6.13 further allow diversity.\n\nAnother thing i want to add: Yes, some champions are stronger by the numbers but what we call \"meta\" is only 50% made up by champions being flat out stronger than others. The other 50% is player perception. I played Zyra before the MYMU came around and only now i hear her laning phase being called \"obnoxious\". I dunno, i have been oneshotting marksmen for months now but everyone percieved her to be a weak or troll pick.","replies":[{"poster":"Dengeden","date":"2016-06-30T17:47:22.364+0000","up_votes":2,"down_votes":0,"body":"*Holycrapsomeoneagrees.*\n\nYe, what's considered \"meta\" is usually only relevant in pro play. And even then, we had UOL with their TF jungle, Yorick-Cassio and their assassin Poppy getting 2nd place in IEM. \n\nThe meta is often the safest option because if you go outside of it, you can lose hard, not a risk many LoL players want to take. \n\n(I gotta say, I prefer the old Zyra, her plant spawn feels too spammy these days)","replies":[{"poster":"Blackquill","date":"2016-07-02T02:19:18.809+0000","up_votes":2,"down_votes":0,"body":"The downvotes, man. Seeing the truth is really an unpopular opinion xD\n\nYeah, many people dont want to take risks but ill say it here once and for all: If you only gate yourself to what *insert name of some unkillable demon god or the guy who solo killed him twice at MSI here* you will sooner or later lose interest in LoL and that doesnt have to happen. Like...go out there and be crazy, play Illaoi support and have fun slapping people with a tentacle god or something. Go Kogmaw jungle, farm for 15 minutes and then continue to 1v5 as your midlane Lulu shields you and laughs maniacally.\n\nAlso: The old Zyra was not bad but the 15 more MS and the small damage adjustments as well as the passive are just too good. I dont want to go back to the days where i had a passive that was \"maybe\" useful after i died. Death passives are normally horrible design (Karthus and Sion being an exception because they can still impact the fight like they would if they were alive). But then again, when im playing Zyra im pretty straight forward: See Champion - Kill Champion. After lvl 6 i gleefully blow up both botlaners at the same time in a single spell rotation :>","replies":[]}]}]}]}]},{"poster":"purplekun","date":"2016-06-30T00:07:31.895+0000","up_votes":3,"down_votes":27,"body":"> [{quoted}](name=Ghostcrawler,realm=NA,application-id=3ErqAdtq,discussion-id=BXOezvo6,comment-id=0019,timestamp=2016-06-29T19:59:36.496+0000)\n>\n> In my mind, here are the reasons to increase number of bans:\n> \n> - Give each player on the team a choice\n> - Increase champion diversity by making it easier to shut down no-brainer or over-dominant picks\n> - Potentially make spectating (especially esports) champ select more interesting\n> - Maybe less motivation to use picks as an additional ban? I concede this one is iffy.\n> \n> And here are the reasons not to increase bans:\n> \n> - Champion select lasts long enough already\n> - If you just keep increasing bans, at some point it gets silly (30 bans?)\n> - Could shut down some very specialized comps (e.g. protect the Kog)\n> - Could shut down signature picks (e.g. Froggen Anivia, or just the one champ that you really like to main)\n> \n> For champ select, it doesn&#x27;t have to be the case that duration just keeps increasing, and it still feels a little long to me personally today. Maybe we should just shorten it. \n> \n> For the slippery-ish slope argument that ban numbers could potentially get silly, we could also just not do that, and as I&#x27;ve said before, it doesn&#x27;t have to be the case that ban numbers just increase forever. Maybe we go to 10 bans and that lasts for the next several years? (We also make new champions at a slower cadence than we used to, so &quot;What do when you have 200 champs?&quot; isn&#x27;t a problem we&#x27;ll need to tackle soon.) \n> \n> The final two cons (&quot;could shut down&quot;) is a little trickier, but could potentially be mitigated with some kind of snake draft so that all the bans don&#x27;t happen at once. If you sense the enemy team is specifically trying to shut down your strategy, go ahead and lock in those champs you do need, or else pivot to a new strategy. I do think it would be unfortunate if pros and players alike just shifted to more generalist champions since they couldn&#x27;t count on important team synergies.\n> \n> It&#x27;s not uncommon in game design to be dealing with competing goals (such as making champion select fairly quick but also making it interesting). You just have to decide if one goal is ultimately more important, or try to come up with a novel solution that can meet both.\n\nso when are you going to get fired?","replies":[{"poster":"Theorchero","date":"2016-06-30T00:09:11.701+0000","up_votes":31,"down_votes":2,"body":"> [{quoted}](name=purplekun,realm=NA,application-id=3ErqAdtq,discussion-id=BXOezvo6,comment-id=00190012,timestamp=2016-06-30T00:07:31.895+0000)\n>\n> so when are you going to get fired?\n\nHe's actually been the only rioter in years to respond to this question on the forums.\n\nDon't be a fucking asshole and drive him off.","replies":[]}]},{"poster":"Quepha","date":"2016-06-29T21:01:34.917+0000","up_votes":15,"down_votes":2,"body":"> [{quoted}](name=Ghostcrawler,realm=NA,application-id=3ErqAdtq,discussion-id=BXOezvo6,comment-id=0019,timestamp=2016-06-29T19:59:36.496+0000)\n>\n> here are the reasons not to increase bans:\n> \n> - Champion select lasts long enough already\n\nI think the ban timer could definitely be decreased as long as you made players lose the ban if time runs out instead of marking them afk and sending everyone back to queue.","replies":[]},{"poster":"Salron","date":"2016-06-29T23:00:02.975+0000","up_votes":9,"down_votes":0,"body":"> [{quoted}](name=Ghostcrawler,realm=NA,application-id=3ErqAdtq,discussion-id=BXOezvo6,comment-id=0019,timestamp=2016-06-29T19:59:36.496+0000)\n\n> - Could shut down some very specialized comps (e.g. protect the Kog)\n> - Could shut down signature picks (e.g. Froggen Anivia, or just the one champ that you really like to main)\n\nEver considered increasing bans to 10 while keeping it at 6 for competitive play?","replies":[]},{"poster":"Athenes Lulu","date":"2016-06-29T21:16:39.702+0000","up_votes":8,"down_votes":1,"body":"> [{quoted}](name=Ghostcrawler,realm=NA,application-id=3ErqAdtq,discussion-id=BXOezvo6,comment-id=0019,timestamp=2016-06-29T19:59:36.496+0000)\n> \n> - Champion select lasts long enough already\n\nThis one that's for sure.\n\n> - If you just keep increasing bans, at some point it gets silly (30 bans?)\n\n1 ban per person is more than fair enough. It's more of a chance for everyone to ban the things they don't want to see rather than a certain percentage of the entire champ pool.\n\n> - Could shut down some very specialized comps (e.g. protect the Kog)\n\nWith a champion pool this large, very unlikely to happen.\n\n> - Could shut down signature picks (e.g. Froggen Anivia, or just the one champ that you really like to main)\n\nBanning one tricks' main champs have long been a thing in soloQ, this is nothing new.\n\nLast two sounds like preserving for the sake of competitive scenes.","replies":[]},{"poster":"Hellioning","date":"2016-06-29T20:09:50.048+0000","up_votes":7,"down_votes":2,"body":"Don't pros play enough generalist picks as is?","replies":[]},{"poster":"The Bearded Bard","date":"2016-06-29T21:07:11.083+0000","up_votes":5,"down_votes":1,"body":"I mean you could easily take away the wasted 18 seconds of the start up of champ select. You can pick what champion to show throughout champ select, you don't need 18 seconds of extra time to do that. Then you could shave off some of the end waiting time. I dunno about everyone else, but the biggest reason champ select takes forever is because people use all of the time they're given when they don't have to. Can't tell you how many times I've seen someone hover the same champ the entire select as last pick, then take the full amount of time to lock in that champ.","replies":[{"poster":"Yulyana","date":"2016-06-29T22:43:20.253+0000","up_votes":3,"down_votes":0,"body":"> Can't tell you how many times I've seen someone hover the same champ the entire select as last pick, then take the full amount of time to lock in that champ.\n\nChances are they're doing masteries and choosing their runes. Not saying it should take _that_ long, but it's not very uncommon for people to have 1 mastery page that they just redo every game (I'm one of these)","replies":[{"poster":"Dragyen","date":"2016-06-30T10:10:40.445+0000","up_votes":2,"down_votes":0,"body":"i have but redo of masteries don't take me fucking 2 mins to do","replies":[]}]}]},{"poster":"Eirixoto","date":"2016-06-30T12:18:57.744+0000","up_votes":2,"down_votes":0,"body":"While the argument about champion select lasting long is good, I don't really agree on the others. \n\nYou won't keep increasing bans. It's been 6 years and you've not done it once. It will take another 6 years before you _maybe_ add another, so I really don't see how this is a problem or an argument at all. \n\nYou can shut down very specialized comps with a single ban. Ban Kog'Maw and you shut down \"Protect the Kog\". You can shut down Yasuo comps by - you guessed it - banning Yasuo. Most comps can be shut down by banning a single champion, maybe two. \n\nAnd signature picks goes under the same. That's what bans are for? Banning what you don't want to or cannot play against. If that means banning a one-tricks champion then so be it. You can't protect a player from having its champion banned just because they only wanna play it.","replies":[]},{"poster":"DrCyanide","date":"2016-06-30T00:24:55.334+0000","up_votes":2,"down_votes":0,"body":"> Champion select lasts long enough already\n\nYou can save 10 seconds by changing the animation at the start to show all roles at once (or nearly at once) and letting pick intent instantly happen. Additional time can be saved by then letting players hover bans and lock them in.\n\n> If you just keep increasing bans, at some point it gets silly (30 bans?)\n\n10 bans is a naturally breaking point, due to there being 10 people in the game. So until Hexakill becomes the norm you're not likely to see a request for more bans unless the champion pool gets much larger or the balance of the game becomes unbearable.\n\n> Could shut down some very specialized comps (e.g. protect the Kog)\n\nIf the 5 bans on the enemy team is enough to destroy a protect the Kog comp then it's safe to say too much emphasis has been placed on making champions who's only contribution is damage. \n\nA full poison team (centered around Cass) is already shut down by 3 bans, but the chances that the enemy knows you're planning on running it before pick and bans even start is abysmally small. Thus the only chance of a team comp being banned out is if it's a) common and OP/annoying or b) it's the signature comp for a team in an organized tournament. Both of those are acceptable reasons for something to be banned.\n\n> Could shut down signature picks (e.g. Froggen Anivia, or just the one champ that you really like to main)\n\nLet's be clear, that \"one champ that [I] really like to main\" isn't going to be banned because I'm on the other team, because no one I play against knows I'm on the other team or who my main is. I'm in more danger of my allies banning it then my enemies.\n\nI think everyone expects LCS grade players to have a pick they excel at and to have deep champion pools. If you ban Froggen's Anivia, then you've got to deal with someone else on his team having their power pick, in addition to whatever's OP that patch.\n\n------\n\nLet's be honest, League has too many champs that are either too frustrating to deal with or flat out OP on any given patch. The new champion team, the champion rework teams, and balance team need to really step up their game when it comes to creating content that's fair and only reasonably frustrating to play against. In the meantime, more bans can help ease the frustration of players when things don't go as planned.","replies":[]},{"poster":"Xyltin","date":"2016-06-29T23:00:12.641+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Ghostcrawler,realm=NA,application-id=3ErqAdtq,discussion-id=BXOezvo6,comment-id=0019,timestamp=2016-06-29T19:59:36.496+0000)\n> \n> - Champion select lasts long enough already\n> - If you just keep increasing bans, at some point it gets silly (30 bans?)\n> - Could shut down some very specialized comps (e.g. protect the Kog)\n> - Could shut down signature picks (e.g. Froggen Anivia, or just the one champ that you really like to main)\n> \n\n- longer champ select is not really a problem. Take away 5 sec from each ban and 5 sec from the intended pick and you get most of it back\n- People don't want 30 total bans. 10 (5/5) would be enough for the time being and when it gets to 10/10 you can start thinking about that point\n- Shutting down Juggermaw is easy: Ban Kog'Maw. You don't need +2 bans for that. It is similar with other comps like that. Can you do it more easy? Yes, but if you want to ban that comp you are going to do it with 3 bans or 5 bans anyways\n- last thing is the same as before. Regardless of the amount of bans you can ban signiture picks. it is the same as now just with more bans and more choices. Do you want to ban the open Irelia with the 5th ban or the signiture pick?","replies":[]}]},{"poster":"LostFr0st","date":"2016-06-27T20:23:57.855+0000","up_votes":20,"down_votes":1,"body":"They already said that more bans were potentially on the table, with one per person the likely conclusion if that was to occur.\n-----------------------\nQuestion:\nWait, isn't 10 bans (one per person) just more intuitive? Instead of two people don't get to ban their lane match up, or have to beg to ban whomever is the new champ.\nAnswer:\nHaving one ban per person is intuitive, though our experience is most folks just ban their lane, so the teams aren't really strategically collaborating.\nGiving each player a chance to ban one champion would be a good reason to go to 10 bans. The point I was trying to make earlier was that going to 10 bans just because the champion pool has increased is not a good reason in our opinion. That isn't scalable. If 10 is good, is 20 better? There needs to be some logic to it. One per player makes more sense to me than \"it's been awhile since it was 6, so it's time to make it more.\"\n------------------\nSource: 5 months ago on RiotGhostcrawler's ask.fm","replies":[{"poster":"Dreadlocks","date":"2016-06-27T20:37:35.519+0000","up_votes":25,"down_votes":4,"body":"Lol how is it a bad reason..  the champion roster grows then so should the amount of bans. And if they're afraid of too many champions being banned out that are good, maybe they should focus more on making a larger amount of champions competitively viable. Or at the very least keep pro scene at 6 and let Yolo Queue have 10.","replies":[{"poster":"LostFr0st","date":"2016-06-27T20:43:38.415+0000","up_votes":12,"down_votes":1,"body":"The pros will always skim the champ pool down.\nThey calculate the optimal champs and that's all they play.\nYes it's a snoozefest and no I don't think it'll change unfortunately...","replies":[{"poster":"Dreadlocks","date":"2016-06-27T20:47:12.706+0000","up_votes":6,"down_votes":2,"body":"Unfortunately is probably the best word to use when talking abt a lot of riots decisions lol.","replies":[{"poster":"LostFr0st","date":"2016-06-27T20:55:35.224+0000","up_votes":5,"down_votes":2,"body":"It's not Riot, it's the pros on that count.\nUnless Riot was to put a cd on champs we won't see that much variety other than in mid.","replies":[{"poster":"Dreadlocks","date":"2016-06-27T21:05:59.081+0000","up_votes":12,"down_votes":1,"body":"The pros only abuse what riot fails to balance...","replies":[{"poster":"LostFr0st","date":"2016-06-27T21:17:28.278+0000","up_votes":3,"down_votes":1,"body":"Gotta shake stuff up.  They'll always be someone who lands on top.\nIt'd be even more stagnant if there were no changes to the game.\nAt least with the current system we don't see Maokai top ALL year :^)","replies":[{"poster":"Dreadlocks","date":"2016-06-27T22:32:57.681+0000","up_votes":9,"down_votes":1,"body":"Season 4... Mao ryze rumble all the time lol.","replies":[]}]}]}]}]},{"poster":"MrPharmD","date":"2016-06-28T09:57:12.041+0000","up_votes":3,"down_votes":0,"body":"I think the LCS would get more interesting with 10 bans. There are usually a couple OP picks. After that, the pool is relatively more even. So if we take away the \"must have\" picks, I think we would see a lot more diversity in pro play...which would be more entertaining to watch. I can only watch so many games where the teams are:\n\n{{champion:48}} Top\n{{champion:421}} Jg\n{{champion:268}} Mid\n{{champion:236}} ADC\n(supports are generally diverse, imo. we see tanky supports and now the mage supports have started to come back)","replies":[]}]},{"poster":"Elikain","date":"2016-06-27T23:43:38.342+0000","up_votes":5,"down_votes":5,"body":">the champion roster grows then so should the amount of bans. \n\nThis is bad reasoning. At what point you'd say it's enough of bans?\nWhat if they finally make it to 40? Am i going to spend 3 hours before the game starts banning champions or am i going to ban just the troublemakers and play the game? Banning someone is a simplest form of not dealing with the problem champion.\nNot all champions are viable as well. So banning this much may not even be necessary.\n\nSure, 10 bans seems intuitive (1 ban per player) and i most certainly don't ban for my own lane. I ban the problem champions so i don't have to watch my team auto lose whenever Vlad is in the game.","replies":[{"poster":"Dreadlocks","date":"2016-06-28T03:18:37.825+0000","up_votes":3,"down_votes":1,"body":"It should be % based.. Not just a random number. If riot wants to keep making champions fine, but keep the % of bans relative to the amount of champions available.","replies":[{"poster":"Elikain","date":"2016-06-28T09:29:54.531+0000","up_votes":3,"down_votes":5,"body":"That's again, bad reasoning.\nI see no real reason why should we have so many bans and waste 10 minutes just banning champions. \"Champion pool is growing and so should the ban pool\" is not a good reason.","replies":[{"poster":"MLDzXnRRR","date":"2016-06-28T09:54:03.005+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Elikain,realm=EUNE,application-id=3ErqAdtq,discussion-id=BXOezvo6,comment-id=00010001000100000001,timestamp=2016-06-28T09:29:54.531+0000)\n>\n> That&#x27;s again, bad reasoning.\n> I see no real reason why should we have so many bans and waste 10 minutes just banning champions. &quot;Champion pool is growing and so should the ban pool&quot; is not a good reason.\n\nBecause you they often break a champion and fix their mistake only after 2-3 months of suffering.\nYou can ban all OP champions with more bans.","replies":[]}]}]}]}]},{"poster":"Spôôked","date":"2016-06-28T11:54:19.316+0000","up_votes":5,"down_votes":2,"body":"I personally would LOVE 10 bans.\n\nI don`t want to see {{champion:53}} {{champion:63}} {{champion:238}} {{champion:157}} {{champion:39}} {{champion:122}} {{champion:86}} {{champion:245}} {{champion:7}} or {{champion:143}}.\n\nAnd I hope Riot nerfs LeBlanc into the ground with the Assassin Rework. She does stupid dmg even at level 2. Same with Irelia. I hope they nerf the Hell out of her. It`s dumb when she jumps on you with just {{item:3078}} and detroys you because you`re stunned for 5 years and she`s also tanky.","replies":[{"poster":"LostFr0st","date":"2016-06-28T14:22:58.320+0000","up_votes":3,"down_votes":0,"body":"See, {{champion:63}} is nowhere near as dumb as he used to be.  At least now he has to land 3 spells to chunk someone.\n\nRiot won't nerf {{champion:7}} into the ground if she gets picked for the roster project.  They'll probably give her more tools (if anything) and stretch out the time needed to do her burst combo.  That's apparently their plan with all assassins from what they wrote.\n\n{{champion:39}} is pretty dumb and needs reworking too.  It's dumb when any champ punishes you for doing what you're supposed to do (in her case winning the fight).  \nThey changed the vessel mechanic on {{champion:420}} for that reason so I don't see why they wouldn't change Irelia too.","replies":[{"poster":"Duhpope","date":"2016-07-01T17:21:49.301+0000","up_votes":3,"down_votes":0,"body":"As an Irelia main, I even agree that she needs a little tweaking after the {{item:3078}}  update. I've enjoyed the power boost she's gotten, and the attack speed now is great, but it's almost sad getting dived by a bruiser top who has the upper hand, stunning them and W-Qing with TF for half of their health, then Ulting to regen and chase until Q's up again, get the kill, and get out before they even know what hit them. It happens all too often lol","replies":[]}]}]},{"poster":"Xonra","date":"2016-06-27T20:27:37.802+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LostFr0st,realm=NA,application-id=3ErqAdtq,discussion-id=BXOezvo6,comment-id=0001,timestamp=2016-06-27T20:23:57.855+0000)\n>\n> They already said that more bans were potentially on the table, with one per person the likely conclusion if that was to occur.\n> -----------------------\n> Question:\n> Wait, isn&#x27;t 10 bans (one per person) just more intuitive? Instead of two people don&#x27;t get to ban their lane match up, or have to beg to ban whomever is the new champ.\n> Answer:\n> Having one ban per person is intuitive, though our experience is most folks just ban their lane, so the teams aren&#x27;t really strategically collaborating.\n> Giving each player a chance to ban one champion would be a good reason to go to 10 bans. The point I was trying to make earlier was that going to 10 bans just because the champion pool has increased is not a good reason in our opinion. That isn&#x27;t scalable. If 10 is good, is 20 better? There needs to be some logic to it. One per player makes more sense to me than &quot;it&#x27;s been awhile since it was 6, so it&#x27;s time to make it more.&quot;\n> ------------------\n> Source: 5 months ago on RiotGhostcrawler&#x27;s ask.fm\n\nAs much as that is a good response, I really wish it wasn't Ghost Crawler answering these questions, seeing as he has very little experience with LoL even still (comparitively speaking) and wasn't around when it was increased to 6, or when well over half of the champions were released.\n\nSeems like an odd person to be making that comment in general, when 5 months ago he worked at Riot less than 2 years.","replies":[{"poster":"The Yetii Rider","date":"2016-06-28T06:21:38.584+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Xonra,realm=NA,application-id=3ErqAdtq,discussion-id=BXOezvo6,comment-id=00010000,timestamp=2016-06-27T20:27:37.802+0000)\n>\n> As much as that is a good response, I really wish it wasn&#x27;t Ghost Crawler answering these questions, seeing as he has very little experience with LoL even still (comparitively speaking) and wasn&#x27;t around when it was increased to 6, or when well over half of the champions were released.\n> \n> Seems like an odd person to be making that comment in general, when 5 months ago he worked at Riot less than 2 years.\n\nI mean Lol is only 7 years old. 30% of its lifespan is a long time.","replies":[]}]},{"poster":"dEAdbUs","date":"2016-06-28T11:09:14.525+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LostFr0st,realm=NA,application-id=3ErqAdtq,discussion-id=BXOezvo6,comment-id=0001,timestamp=2016-06-27T20:23:57.855+0000)\n> The point I was trying to make earlier was that going to 10 bans just because the champion pool has increased is not a good reason in our opinion. \n\nBefore GhostCrawler became Design Director it actually WAS a reason. Following his logic, why do we have bans at all?","replies":[{"poster":"LostFr0st","date":"2016-06-28T14:08:22.139+0000","up_votes":1,"down_votes":0,"body":"Yes, League used to do random stuff all the time; they still do that sometimes but they tell us that they try not to.\nJust 'because' isn't a good enough reason to me either -_-\n\nIn this case they have to think before acting.\n\nWhat happens if someone's ghosting a player and their team decides 'oh, we can get a free win if we ban out this enemy player's entire champ pool.\"  Saying 'oh that's rare' or 'learn more than 5' is all fine and dandy but to the person that got banned out it's not.\nStreamers are a big part of the League foundation.\n\nNot to mention that people need to buy 4 additional champs for draft pick then as well.\n\nIf we get a change it'll likely be this fall, with the new season and hopefully the new client.\nThey're not going to change the ban count in the middle of a season.","replies":[{"poster":"dEAdbUs","date":"2016-06-28T14:48:18.484+0000","up_votes":2,"down_votes":0,"body":"You can ban champion of one-trick-pony player with just one ban. And he might be a popular streamer. So what? Remove bans? I personally suffering from all this reworks, because my pool was made of old champions. And there was more than 5 champions. But Riot doesn't care about me as player at all. \n\nImho more bans - more fun. I'd like to see how game will react if all ADC will be banned or all supports, but I doubt it will happen because people can ban 6 ADCs right now, but nobody is doing it. \n\nMore bans will make Riot to work more, because what people will ban first after OP? Champions they don't like to play against: Fizz, LB, Zed, Rengar, Irelia (mostly assassins, right). And Riot don't like it. \n\nIn rankeds you can't ban entire player's champion pool, because you don't know who are you facing (unless you're challenger). In pro games - I don't really care. It's their work, they do it for money. If someone won't be able to main 5, they team will hire someone who can main 6. But imho this will be good for pros too - what can be more fun than surprise pick or improvisation?","replies":[]}]}]}]},{"poster":"Gloom Shroom","date":"2016-06-27T20:10:42.824+0000","up_votes":16,"down_votes":2,"body":"There is only 131 champions, including Taliyah.","replies":[{"poster":"awdaf","date":"2016-06-27T20:12:25.307+0000","up_votes":7,"down_votes":40,"body":"STFU, YOUR NOT HELPING","replies":[{"poster":"Ralanr","date":"2016-06-27T20:26:48.543+0000","up_votes":20,"down_votes":1,"body":"Getting your facts straight makes your case stronger.","replies":[{"poster":"The Last Ballad","date":"2016-06-28T02:28:19.053+0000","up_votes":5,"down_votes":0,"body":"Too many people ignore this. Getting facts straight also makes your opponent's case weaker, as he cannot discredit you by saying \"x is wrong, it is actually y\"(no one in their right minds would put it that way, but it gets the point across well enough). Not getting facts correct(or not having evidence for a claim) makes my job when I disagree so much easier.","replies":[]}]}]}]},{"poster":"Ryzing2Diamond","date":"2016-06-27T21:20:42.606+0000","up_votes":3,"down_votes":15,"body":"We don't need more bans. 5 bans per team is a whole 10 champions out of the game. That's too damn many. by the 5th ban people would just be choosing a random champion because all the in flavor champs would already be banned. The only people asking for more bans are lower elo because they don't know how to deal with each champion...","replies":[]}]}