{"poster":"kraiwa2","date":"2015-03-24T17:38:26.764+0000","title":"Lag Spikes","subforum":"Hilfe & Support","up_votes":2,"down_votes":0,"body":"Habe seit ca. 3 Tagen ständige La-Spikes. anfangs von 50 auf 300 später sogar über 1000.\r\nBin ich alleine oder gibt es andere Betroffene?","replies":[{"poster":"Rkoturdo Ndo","date":"2015-03-24T17:51:48.308+0000","up_votes":1,"down_votes":0,"body":"Heya\nMagst du mal ein Tracert erstellen?\n> Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\n> Zusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\n> Ein gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download:\n> http://www.pingplotter.com/downloads/pngplt_std.exe\n> 1. Das 'Trace Interval' sollte auf '1 second' eingestellt werden.\n> 2. Die 'Address to Trace' ist in unserem Fall 185.40.65.1\n> 3. trace starten\n> 4. Es wird jetzt jede Sekunde ein tracert durchgeführt. Während Pingplotter im Hintergrund läuft, kann man ein Testspiel in LoL starten um zu testen ob Probleme auftreten.\n> Sollte es Verbindungsprobleme geben, geht es mit Schritt 5 weiter. Gibt es keine Verbindungsprobleme sind die tracerts >vermutlich nutzlos.\n> 5. Sollten Verbindungsprobleme aufgetreten sein, müssen die tracerts abgespeichert werden. File -> Export to textfile...  http://fs1.directupload.net/images/141125/hmj3jxtl.png\n> 6. Samples to Export: All Samples  http://s14.directupload.net/images/141125/tn9c75t4.png\n> 7. 'Export...' Speichert die Textdatei am besten auf dem Desktop oder an einem Ort wo ihr diese auch wieder findet.\n> 8. Datei im Forum hochladen wenn ihr eure Antwort erstellt\n>\n> Anhand der tracerts kann man häufig die Fehlerquelle finden, wenn es sich bei den Verbindungsproblemen um Paketverlust oder einen hohen Ping handelt.\n\nMfG Rkoturdo","replies":[{"poster":"kraiwa2","date":"2015-03-24T21:01:38.390+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nhab eben nochmal ein Spiel gestartet. Kurz nach beginn schon der erste spike mit einem Ping von über 5000... Wenige Sekunden später alles wieder normal.\nHier der Tracert:","replies":[{"poster":"Rkoturdo Ndo","date":"2015-03-24T21:04:18.237+0000","up_votes":1,"down_votes":0,"body":"Heya\nBenutzt du WLan?\nWenn ja kannst du mal eine Lanverbindung austesten?\n\nMfG Rkoturdo","replies":[{"poster":"kraiwa2","date":"2015-03-24T21:12:11.700+0000","up_votes":1,"down_votes":0,"body":"LAN-Verbindung wäre leider nicht möglich, Router zu weit weg.\nKonnte gerade auf www.speedtest.net beobachten, dass mein Ping (auf örtlichem Server) ziemlich gering ist, Download- und Upload-Geschwindigkeit jedoch sehr schlecht für übliche Verhältnisse.","replies":[{"poster":"Rkoturdo Ndo","date":"2015-03-24T21:19:30.752+0000","up_votes":1,"down_votes":0,"body":"Heya\nDas Problem liegt aber am Wlan.\nEin Tracert Pingt jede Station auf deiner Route zum Server an. Der Ping zu deinem Router sollte dabei normalerweise bei Lan zwischen 0-1 liegen und bei Wlan etwas höher. In deinem Tracert findet man folgende Zeilen(bedenke, die Erste Zahl nach der Uhrzeit ist die Ping zu deinem Router):\n\"24.03.2015 21:54:08\",2289,*,2209,2164,2109,2071,2083,1982,1944,1626,*,*,1516,*,*,1862,\n\"24.03.2015 21:54:46\",2067,*,2006,2282,2252,2201,2166,2122,2087,2051,2009,*,*,*,1913,1874\n\"24.03.2015 21:55:12\",1598,*,1455,1421,1463,1446,1510,1467,1549,1709,1670,*,1921,1889,*,1820,\n\nIst es wenigstens Testweise möglich, eine Lanverbindung aufzubauen?\n\nMfG Rkoturdo","replies":[{"poster":"kraiwa2","date":"2015-03-24T21:24:43.822+0000","up_votes":1,"down_votes":0,"body":"Müsste meine komplette Ausrüstung zwei Zimmer weiter schleppen..\nIch glaube ich versuche es erstmal mit der altmodischen aus/an -Technik. Vielleicht löst es das Problem.\nKönnte es evtl. auch an meiner Netzwerkkarte liegen?","replies":[{"poster":"Rkoturdo Ndo","date":"2015-03-24T21:28:18.552+0000","up_votes":1,"down_votes":0,"body":"Heya\nDas Problem liegt irgendwo zwischen deinem Rechner und deinem Router.\nAm Wahrscheinlichsten ist dabei das Wlan, weswegen ich die Lanverbindung als erstes Probieren würd(so schwer ist nen pc nun auch nicht umzustellen^^).  Es ist gut möglich, das innerhalb der letzten Tage eine Störquelle dazugekommen ist. Du kannst auch den Wlan-Kanal wechseln, aber ob das das Problem lösen wird weiß ich nicht.\n\nMfG Rkoturdo","replies":[{"poster":"kraiwa2","date":"2015-03-25T19:02:13.793+0000","up_votes":1,"down_votes":0,"body":"So die Lags haben isch jetzt nach dem Patch behoben. Vielleicht doch ein Problem mit den Riot-Servern?\nTrotzdem nochmal danke für  deine Hilfe!","replies":[{"poster":"Rkoturdo Ndo","date":"2015-03-25T20:37:52.503+0000","up_votes":1,"down_votes":0,"body":"Heya\nWird wohl Zufall sein. Wie gesagt, im Tracert war klar zu sehen, das das Problem zwischen deinem Rechner und deinem Router lag. Eindeutigere Tracerts kann man kaum haben.^^ Hattest du denn schon den Kanal gewechselt? Eventuell ist die Störquelle auch wieder weg. \n\nMfG Rkoturdo","replies":[{"poster":"kraiwa2","date":"2015-03-26T17:07:16.600+0000","up_votes":1,"down_votes":0,"body":"Das einzige das ich gemacht habe, ist meine Netzwerkkarte von minimalem Staub zu befreien. Ich bezweifle, dass es daran lag. Wie erwähnt, wahrscheinlich ein Zufall.","replies":[]}]}]},{"poster":"kraiwa2","date":"2015-03-24T21:32:55.164+0000","up_votes":1,"down_votes":0,"body":"Danke für die Antwort, werde gleich mal ein anderen Kanal testen, falls das nichts hilft muss ich es mit der LAN-Verbindung probieren.","replies":[]}]}]}]}]}]}]}]},{"poster":"Schesam","date":"2015-03-25T19:47:44.137+0000","up_votes":1,"down_votes":0,"body":"Hab das seit paar Tagen auch und immer wieder schreiben ingame welche dasselbe.\n ALso anfangs ist es meist normal (40-50er ping), dann gehts meistens nach 2-3min los: Der Ping geht für ca 20-30sec, manchmal auch länger, auf 300-700. Danach geht er wieder runter auf 40-50 (normal) nach paar minuten gehts wieder los... Hba eihc jetzt seit 3 Tagen in jedem Gmae gehabt..\nISt besonders in Rankeds nervig, wenn du dadurch stirbst und einfach nichts machen kannst bzw im early trades verlierst und cs.\n\nKann nachher mal son nen tracert über das Programm erstellen, wenns wieder auftritt.","replies":[]},{"poster":"TSM TheSaltyOne","date":"2015-03-25T19:41:00.021+0000","up_votes":1,"down_votes":0,"body":"Habe dasselbe Problem. Denke, dass es an Riot liegt.. Habe in unterschiedlichen Networks unterschiedlicher Provider Lagspikes..","replies":[]},{"poster":"Braillok","date":"2015-03-24T18:53:45.414+0000","up_votes":1,"down_votes":0,"body":"So habe das selbe Problem und gleich mal ein Tracert erstellt. \nHoffe ihr könnt mir weiterhelfen.\n\nMit freundlichen Grüßen","replies":[]}]}