{"poster":"Plutooh","date":"2016-07-16T22:52:22.696+0000","title":"ARAM Dodgers","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"So before I start can the &#039;Who cares it&#039;s just ARAM&#039; community stay silent as some of us don&#039;t care about ranked and just want to play for fun.\r\n\r\nThe whole point of ARAM is you get a random champ or use the 2 rolls, if you don&#039;t like the idea of random champs why even play the mode.\r\n\r\nSo this might of been mentioned before but why not penalise queue dodgers with the same champ they dodged on, i.e. They dodge and join another game and they have to use the champ they dodged on previously or use their rolls.","replies":[{"poster":"Gravelord","date":"2016-07-16T23:24:25.838+0000","up_votes":1,"down_votes":1,"body":"The problem I have with ARAM is that a lot of my friends have a specific ARAM account where they have all the great ARAM champs. They will just keep getting the same champs to absolutely Shrek in this game mode. So if I was playing on ARAM and pulled out a Draven, I'd hell want to bail from that queue (I am hella floppy shit with Draven). Why penalise me for me knowing I will be playing a bad game, Letting my mates down, I will not be learning because I have skill shots coming at me every 0.02 seconds and most important of all I will not be enjoying the game.","replies":[{"poster":"TwoHeadedFreak","date":"2016-07-18T08:38:03.230+0000","up_votes":2,"down_votes":0,"body":"Because you're the reason I miss out on my favourite champs. More often than not (Murphy's law I guess), I have one of my favourite champs that i rarely get only to miss out completely because someone dodged. No, I don't want to go and play sr.","replies":[]},{"poster":"Plutooh","date":"2016-07-17T03:14:24.649+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Gravelord,realm=OCE,application-id=T8eq2lFQ,discussion-id=wQ2mHil7,comment-id=0000,timestamp=2016-07-16T23:24:25.838+0000)\n>\n> So if I was playing on ARAM and pulled out a Draven, I&#x27;d hell want to bail from that queue (I am hella floppy shit with Draven). Why penalise me for me knowing I will be playing a bad game.\n\nOne of the reasons to play ARAM, learn how to play Draven or other champs in a less competitive environment. \n\nSome of us play LoL for fun so dodgers or players who go AFK because they didn't get the champ they wanted are wasting everyone else's 15-20 minutes.","replies":[{"poster":"Gravelord","date":"2016-07-24T00:13:30.152+0000","up_votes":1,"down_votes":0,"body":"But I never want to play Draven in my lifetime.","replies":[]}]}]},{"poster":"Sloth Almighty","date":"2016-07-27T23:47:07.257+0000","up_votes":1,"down_votes":0,"body":"Instead of penalizing the ones for leaving, why not keep the players/champions and re-open the queue for another to come in?\nIf someone dodges, you're going to have to wait anyway, why not let the queue wait for a solo queue'r and slide them right on in?\n\nThis way people will get to play their desired random pick in ARAM for that game, and not waste a re-roll or skin boost because someone dodged.","replies":[{"poster":"Plutooh","date":"2016-07-28T22:05:37.904+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sloth Almighty,realm=OCE,application-id=T8eq2lFQ,discussion-id=wQ2mHil7,comment-id=0003,timestamp=2016-07-27T23:47:07.257+0000)\n>\n> Instead of penalizing the ones for leaving, why not keep the players/champions and re-open the queue for another to come in?\n> If someone dodges, you&#x27;re going to have to wait anyway, why not let the queue wait for a solo queue&#x27;r and slide them right on in?\n> \n> This way people will get to play their desired random pick in ARAM for that game, and not waste a re-roll or skin boost because someone dodged.\n\nNot a bad idea. +1","replies":[]}]},{"poster":"Im a CAT","date":"2016-07-25T00:56:46.518+0000","up_votes":1,"down_votes":0,"body":"Wow, pls when I dodge an aram game and still get the champion from my last dodge.\n I am ready to just call it quits and go back to overwatch.\n\nHonestly, other players have the right to dodge in Aram of all modes too. \nIt isnt great fun to get flame when you are a warwick and just get kited to death pre 6 and post 6.\n#norerolllyfe :(","replies":[{"poster":"Plutooh","date":"2016-07-27T22:09:08.357+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Im a CAT,realm=OCE,application-id=T8eq2lFQ,discussion-id=wQ2mHil7,comment-id=0002,timestamp=2016-07-25T00:56:46.518+0000)\n>\n> Wow, pls when I dodge an aram game and still get the champion from my last dodge.\n>  I am ready to just call it quits and go back to overwatch.\n> \n> Honestly, other players have the right to dodge in Aram of all modes too. \n> It isnt great fun to get flame when you are a warwick and just get kited to death pre 6 and post 6.\n> #norerolllyfe :(\n\nSimple solution, don't play ARAM if you don't like getting a random champ, go play one of the other modes where you can choose a champ.","replies":[]}]},{"poster":"WoadKethunt","date":"2016-07-17T01:58:51.797+0000","up_votes":1,"down_votes":0,"body":"yeah i would argue the most toxic side of the lol community is the aram only players, aram is the kind of game mode that should be in the rotating game mode que. There really isn't a reason to play aram competitively yet there are people who have accounts specifically for aram with around 10-20 champs unlocked to get the edge\n\nas far as the bouncing goes sometimes it can be a blessing in disguise you can use your reroll and skin boost get not only a bad champ but a bad skin then someone on the other team bounces you get to go again","replies":[]}]}