{"poster":"UrielJajaSalu2","date":"2018-03-12T14:43:33.615+0000","title":"Petición a rioters.","subforum":"Charlas Generales","up_votes":2,"down_votes":8,"body":"Hola, me llamo Uriel y hoy vengo a hacer una propuesta a los Rioters (dudo que alguno lea la propuesta pero con intentar no pierdo nada) la cosa es as&iacute;, algunos jugadores tenemos skin definitiva en nuestro bot&iacute;n y que no podemos encantar por falta de escencia naranja, vi que en este parche (o el siguiente no recuerdo) si te toca una skin definitiva o hextech te la dan permanente entonces la cosa es &iquest;y los que ya tenemos la skin y no podemos encantarla por que no podemos cargar rp y abrir muchas cajas? no seria bueno que los que ya las tengamos nos las dieran permanente de igual forma? solo es una opinion y espero a ver si llega a un rioter. Un saludo los quiero.","replies":[{"poster":"BackToPartyCity","date":"2018-03-12T21:07:52.934+0000","up_votes":2,"down_votes":0,"body":"Hola! Ese cambio no es retroactivo. Solo es válido si te tocó un fragmento de esos después del parche.\nPor eso avisamos antes del cambio, como lo hacemos con las ofertas y cambios de precio. :)","replies":[{"poster":"BigVen","date":"2018-03-13T21:12:28.789+0000","up_votes":1,"down_votes":0,"body":"Hola Riot Shade, Cargue hace mas de 2 horas 200 pesos argentinos con tarjeta de credito MasterCard. Aun no me llegan, antes me llegaba en minutos. Saludos y gracias por las gestiones =)","replies":[]}]},{"poster":"Pliosaurio","date":"2018-03-12T17:43:01.281+0000","up_votes":1,"down_votes":0,"body":"No es aplicable, porque fue una obtención anterior del botín a la actual.\nEn cualquier caso, no dudes en comunicarte con el soporte para cualquier duda o consulta.\n\nSaludos, Atte.","replies":[]},{"poster":"llMickeyMousell","date":"2018-03-12T15:25:16.039+0000","up_votes":1,"down_votes":0,"body":"no lo harán :/","replies":[]},{"poster":"Killer Bean","date":"2018-03-12T14:45:26.316+0000","up_votes":1,"down_votes":0,"body":"No, simplemente nunca lo haran y ya lo han aclarado xD","replies":[]},{"poster":"Oblivion awaits","date":"2018-03-12T15:30:21.822+0000","up_votes":1,"down_votes":2,"body":"¿Y perder dinero así? ¿Realmente crees que eso va a hacer Riot Games? Amigo, a esta empresa solo le importa el dinero.","replies":[]}]}