{"poster":"Princess Mipha","date":"2015-03-23T17:23:42.232+0000","title":"Ban injusto del foro. Exijo una respuesta por parte de Riot","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":1,"body":"Buenas Invocadores.\nEspero que este mensaje llegue a algún miembro del Staff de Riot y que me de una solución y mínimo una respuesta clara y concreta de qué sucedió. (No me voy a poner a pedir disculpas porque el daño ya fue hecho)\n\nSuelo comentar bastante seguido aquí en el foro, respondiendo dudas, compartiendo opiniones, etc, etc. Sin embargo, hace 2 días me llego el siguiente mensaje, impidiendo que pudiera responder cualquier tema y dar calificación a los mismos:\n\n___\nYou're currently banned, old sport. Take it from a gentleman and follow the rules of good discourse:\nRespeta a tus compañeros jugadores\nMantén un lenguaje civilizado, incluso si estás enfadado\nLa liga no es lugar para\nNo es apropiado buscar clientes en los foros; te sugerimos otro sitio para ofrecer tus aceites de serpiente y tus camisas antiarrugas.\n___\n\nPunto 1: Si van a banear, mínimo pónganlo en español. No se me da bien el inglés y sólo comprendí la sigla \"banned\". Me di el tiempo de tratar de buscar qué significaba old sport, pero mi escaso conocimiento me permitió solo entender \"viejo deporte\". WTF?\n\nPunto 2: Mantengo siempre todas las reglas que aparecen en la lista. No hago ni siquiera spam, no hago publicidad de ningún tipo y siempre respeto en mis opiniones con argumentos sólidos (es decir, no recurro nunca a insultos ni nada por el estilo).\n\nBajo estas condiciones, considero que el ban que me dieron en el foro fue totalmente injusto, y quiero saber como carajos (si, carajos) banean acá, ¿por reportes random? ¿otra cosa?\n\n\nEspero que respondan porque la verdad quedé bastante indignada. Estuve 2 días sin poder responder unas 6 preguntas importantes en el foro y no pude crear un tema para reclutar en team ranked por esta estupidez (tuve que pedirle a otra persona que lo realizara por mi). \n\nSaludos\nJyanne{{champion:40}}","replies":[{"poster":"Sir DaL","date":"2015-03-25T15:46:46.664+0000","up_votes":2,"down_votes":1,"body":"Hola Jyanne\nHace unos días que el foro tiene un bug el cual impide a los moderadores enviarte la razon de baneo (en realidad la mandan pero no llega ^^')\n\nTe comento la razón del baneo ya que estuve investigando el tema\n\nTu has dejado este mensaje:\n-----------------\nQué estupidez mas grande. No tiene nada de malo que un jugador en la season pasada sea X división.\nNací bronce, viví en plata, salte a oro y me arrastré a platino jugando sólo support y la gente me insulta por terminar silver la season pasada? por no saber jugar otros roles mas que support y mid? Me parece una estupidez.\n\nEspero que le hayas tomado foto a sus comentarios y los mandaras a soporte, porque la verdad estoy dudando mucho de que el report clasico funcione. Con pruebas de toda la partida debería suceder algo, sino, este juego estará (o está) cagado.\n\nSaludos\nJyanne\n-----------------\n\nEl moderador te suspendio 24 horas y te envio este mensaje\n\"Quedas suspendido por usar un mal lenguaje en el foro. Por favor lee las normas antes de volver a participar en la comunidad.\"\n\n\nComo recomendación personal, cuando alguien comente algo que a tu parecer es una estupidez, solo dile que no estas de acuerdo, no hace falta ese tipo de agresiones. \n\nSaludos y al menos espero haber solucionado tu duda\nPD: Tu cuenta ya debería estar habilitada, la sanción que te han puesto es la más leve (24 horas) y es solo un \"aviso\"","replies":[{"poster":"Princess Mipha","date":"2015-03-25T21:18:02.922+0000","up_votes":1,"down_votes":0,"body":"Disculpe señor Dal, pero me referí que era estúpido el argumento que dan otras personas, no el argumento que presentó el creador del post. De hecho, se ve que al final le recomiendo que omita esos comentarios (porque yo los considero tontos) y que aplique las medidas correspondientes como son reportar a soporte porque son mas factibles que hacer caso.\n\nSe nota que no comprenden a quién va dirigido el mensaje y apenas uno coloca \"estupidez\" asocian que va dirigido a la misma persona que creó el post o comenta arriba.\nRecomiendo que revisen a quienes revisan los post porque claramente tienen problemas con la comprensión de lectura.\n\nPor cierto, el ban no duró 24 horas, duro 48. \n\nSaludos","replies":[]}]},{"poster":"KGrisly","date":"2015-03-23T23:11:27.241+0000","up_votes":2,"down_votes":0,"body":"No se porque te banean es como si fuera un bot tambien, hay 20 personas insultando y diciendo cualquier cosa en el foro uno va dice \" tonto\" y lo banean\nA mi me banearon por decir que a bardo le falta daño, comente eso a los 5 minutos entro a ver otra cosa, veo el comentario borrado y estaba baneado jajaja","replies":[]},{"poster":"Eireen","date":"2015-03-25T18:50:38.709+0000","up_votes":1,"down_votes":0,"body":"A mi me pasó lo mismo. Pero dejé una especie de reclamo/constancia en la página de Riot, y ahí lo están viendo, quizás podrías hacer lo mismo. A mi se me borró el comentario y me dieron 24 horas de ban, y lo peor es que no sabía la razón.\n\nSaludos!","replies":[]},{"poster":"Princess Mipha","date":"2015-03-24T16:59:18.169+0000","up_votes":1,"down_votes":0,"body":"Seguiré insistiendo en este tema hasta que Riot me responda por este medio o se digne a responderme vía correo electrónico.\n\nHe dicho","replies":[]},{"poster":"Sonatic","date":"2015-03-24T04:40:37.183+0000","up_votes":1,"down_votes":0,"body":"A mi igual me pasó, me quejé en soporte al final me dijeron que era un bug y si seguía el problema que respondiera el mensaje nuevamente, al final no contestaron la solicitud pero ya puedo comentar otra vez, raro. \nDe todas formas igual pienso lo mismo que el comentario que leí acá, los demás escriben insultos peores y uno por poner tonto lo banean, mal por los moderadores del foro.","replies":[]},{"poster":"Estwood","date":"2015-03-24T03:10:09.409+0000","up_votes":1,"down_votes":0,"body":"de que te sorprenden, sicen que banean y no ponene listas, dicen que hay tribunal pero sigue habiendo troll, dicen dicen dicen\n\nojo paso el dato en brasil no hay tanto ping y no hay casi nada de troll y lo mejro que al menos riot brasil SE PREOCUPA DE HACER ALGO MAS QUE PONER TEMAS WEONES EN EL FORO.\n\nsaludos....","replies":[]},{"poster":"Nombre ofensivo","date":"2015-03-23T23:30:53.757+0000","up_votes":1,"down_votes":0,"body":"no hay moderadores en el foro te banean simplemente por la acumulacion de denuncias, a algunas personas no le gusto tu respuesta y es instaban","replies":[{"poster":"Princess Mipha","date":"2015-03-24T00:34:20.890+0000","up_votes":1,"down_votes":0,"body":"Si fuese ese el caso, entonces caeríamos en el antiguo problema que tenía el tribunal por reportes falsos acumulados. No puede ser que porque a alguien no le guste tu comentario te baneen Dx","replies":[]}]},{"poster":"alvaroxxxhd","date":"2015-03-23T17:35:02.140+0000","up_votes":1,"down_votes":0,"body":"muestra las chichis y te sacarin el ban y te daran asta cajita","replies":[{"poster":"Princess Mipha","date":"2015-03-23T17:48:24.833+0000","up_votes":1,"down_votes":0,"body":"Jamás mostraría las chichis xD\nSólo quiero una explicación coherente y que a nadie mas le vuelva a pasar.","replies":[{"poster":"RenKoQL","date":"2015-03-23T19:30:38.936+0000","up_votes":1,"down_votes":0,"body":"sí me di cuenta que te borraron un comentario que hiciste en un post mio =(","replies":[{"poster":"Princess Mipha","date":"2015-03-23T20:55:34.554+0000","up_votes":1,"down_votes":0,"body":"o_o ¿Y cuál comentario y qué post era? \nDios santo o_o","replies":[]}]}]}]},{"poster":"Franketox","date":"2015-03-23T17:47:42.079+0000","up_votes":1,"down_votes":0,"body":"banean por banear eso sabelo a mi me banearon 3 veces del foro","replies":[]},{"poster":"Sopapo Nuclear","date":"2015-03-23T17:30:45.373+0000","up_votes":1,"down_votes":0,"body":"Señorita , mis mas sinceras condolencias con usted, yo también me enfadaría si me sucediera algo por el estilo , nadie es culpable hasta que se demuestre lo contrario, estoy de tu parte hasta que haya una prueba irrefutable de su baneo señorita, me despido de usted y espero suerte en su tema {{champion:201}}","replies":[]}]}