{"poster":"Blaze09","date":"2015-04-01T21:50:02.987+0000","title":"Main ADC sucht Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo liebe Community,\r\n\r\nwie nat&uuml;rlich der Titel schon sagt bin ich auf der Suche nach einem Ranked Team als ADC.\r\n\r\nJetzt kommen nat&uuml;rlich wieder die &uuml;blichen Dinge die jeder wissen m&ouml;chte also werde ich versuchen sie nacheinander zu beantworten:\r\n\r\n1. Welche Elo spiel ich eigentlich: \r\nZur Zeit bin ich in Gold V \r\n\r\n2. Welche Champions sind so meine Mains: \r\nMein lieblings ADC ist {{champion:81}} , mein wohl aktuell st&auml;rkster ADC {{champion:236}}, gerne spiele ich auch {{champion:15}} ,{{champion:104}}  und {{champion:222}} \r\n\r\n3. Was erwarte ich von einem Team:\r\nIch finde immer was viele erwarten ist immer viel zu hochgesteckt deswegen denke ich das wichtigste ist einfach das man mit den Leuten klar kommt sich auch so ein wenig auf die anderen einstellen kann witze machen darf ohne das es gleich als flame oder negativ abgestempelt wird, nat&uuml;rlich sollte auch Kommunikation da sein das ist so das einzige was ich erwarte das man mit jemanden redet weil wer m&ouml;chte bitte 45 minuten sich einfach anschweigen, niemand deswegen suchen wir ja Teams sonst k&ouml;nnte man ja auch einfach weiter still Solo-q spielen.\r\n\r\n4. Wie alt ich bin und was ich an Erfahrung in League mitbringe:\r\nMittlerweile bin ich 24 Jahre jung und wurde von meiner Mutter damals Devin gennant.\r\nMeine Erfahrungen in League sind w&uuml;rde ich sagen guter Durchschnitt mit weg nach oben, lass mich eigentlich gern auf Kritik ein versuche aus jedem Match zu reflektieren was hab ich gut gemacht wo waren meine eigenen Fehler (gelingt meist recht gut aber nicht immer), zudem versuche ich auch meinen Teammates egal ob es premate oder auch randoms sind IG Tipps zu geben (wie sich jeder denkt fall ich da bei Randoms teils ziemlich auf dir Schnautze und bekomm meist Flame als danke).\r\n\r\nSo die wichtigsten Dinge habe ich zu mir geschrieben wer es bis hierher geschafft hat dem danke ich und hoffe auf eine Antwort IG oder hier im Forum.\r\nKleine Sache noch TS3 ist vorhanden genauso wie ein Headset f&uuml;r die Kommunikation.\r\n\r\nund damit wars das mit dem Suche Team Thread und ihr d&uuml;rft nun wieder Leuten auf den Richtfeldern auf den Latz geben :) {{champion:17}}","replies":[{"poster":"Blaze09","date":"2015-04-02T19:07:48.233+0000","up_votes":1,"down_votes":0,"body":"*push","replies":[]}]}