{"poster":"BlackSun","date":"2016-06-20T16:00:57.969+0000","title":"eXo Sons of Tilt LF Jungler/ Support Gold III +","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hi Community,\r\n\r\nwir das Team SoT vom Multigaming Clan Exodus (my-exodus.de) suchen wie im Titel schon genannt einen Jungler sowie eine Supporter ab Gold 3 III.\r\nWir drei kennen uns mittlerweile seid einem Jahr und hackfleisch zocken regelm&auml;&szlig;ig zusammen. Wir hatten bereits zwei lang bestehende Team Roster mit denen wir auch einige Erfahrungen in Sachen Teamplay und Kommunikation Ingame gesammelt haben. Diese Teams sind aus zeitlichen Gr&uuml;nden leider verfallen. Nun wollen wir wieder durchstarten.\r\n\r\nKurz zu uns:\r\n\r\nToplane:\r\nSven aka Shinto 18 Jahre (aktuell Plat V, peak letzte Season Plat III)\r\nMidlane:\r\nLucas aka eXo Blacksun 22 Jahre Teamleader (aktuell Plat IV, peak letzte Season Plat II)\r\nAD:\r\nMoritz aka eXo Nemoxius 18 Jahre Teamleader (aktuell Gold III, peak letzte Season Plat II)\r\n\r\nDas bieten wir euch:\r\n\r\ngro&szlig;er TS3 ( Exodus)\r\ngro&szlig;e Community mit ca 150 Mitgliedern und ca 10 Teams in der LoL Sektion\r\nregelm&auml;&szlig;iges Teamtraining ( Scrimms, Meetings, Tuniere)\r\nentspanntes und humorvolles &quot;Teamklima&quot;\r\nDas erwarten wir von euch:\r\n\r\ngeistige Reife ( Ihr m&uuml;sst leider min. 18 Jahre alt sein um Exodus beizutreten)\r\nmin. Gold III\r\nihr maint die Position f&uuml;r die ihr euch meldet ( die Rollen werden im Team auch nicht &quot;mal f&uuml;r ein Game&quot; getauscht)\r\nregelm&auml;&szlig;ige Aktivit&auml;t\r\nKritikf&auml;higkeit (nat&uuml;rlich d&uuml;rft auch ihr andere kritisieren)\r\nihr spielt einiger Ma&szlig;en Meta getreu\r\nTeamerfahrung\r\ngutes Headset\r\n**[Bitte meldet euch NICHT wenn ihr eine dieser Anforderungen NICHT erf&uuml;llt]**\r\n\r\nBei diesem Team steht der Spa&szlig; am Spiel im Vordergrund. Jedoch m&uuml;llhaufen wollen wir als Team Erfolge erzielen und ehrgeizig darauf hinarbeiten.\r\n\r\nAdded mich Ingame und ich notiere mir alles zu euch. Wenn es zeitlich passt machen wir Tryouts.\r\nWenn ihr noch Fragen habt Added mich einfach. (Und nein keine Ausnahmen)\r\n\r\nMFG\r\n\r\neXo BlackSun","replies":[{"poster":"BlackSun","date":"2016-06-23T18:53:45.571+0000","up_votes":1,"down_votes":0,"body":"#push","replies":[]},{"poster":"iBlìtzcrank","date":"2016-06-20T17:08:54.378+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nbin 18jahre und plat5 main support. Mein main ist blitz aber ich spiele auch die Meta picks wie zyra bard braum... Nur Nami besitze ich noch nicht\nLetzte Season hatte ich über 100 teamrankeds und war mit dem team am ende der preseason gold, obwohl 2 Silber Spieler dabei waren.\n\nMFG \niBlìtzcrank","replies":[]},{"poster":"Hi im Borgsi","date":"2016-06-20T16:44:10.423+0000","up_votes":1,"down_votes":0,"body":"Hallo, bin 18 Jahre jung. plat4 SUpport. Kann alles spielen, was ich spielen soll. Habe alle Supports bis auf Zyra + Bard, die aber als nächstes eingekauft werden.\nHabe demnächst Sommerferien, also sehr viel Zeit. Spiele seit Season3 Support.\nMfG Borgsi.   -> IgN: Hi Im Borgsi\n\nEdit: Peak war Plat2","replies":[]},{"poster":"Loneex","date":"2016-06-20T16:40:47.272+0000","up_votes":1,"down_votes":0,"body":"Moin, bin 21 plat 4 Main Jungle Lee, Nauti, Vi kann bei training erweitert werden je nach team abstimmung. regelmäßig aktiv aus beruflichen gründen erst ab 17/18 uhr bis 24 da sonst eigentlich ziemlich aktiv. bin seit season 2 dabei. kritik nimm ich immer gern an. bei interesse meldet euch einfach ign Loneex würde mich auf ein testspiel freuen.","replies":[]}]}