{"poster":"Rosewell8","date":"2016-10-19T00:47:44.461+0000","title":"Removing the Low Priority Queue on the PBE","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":1,"body":"Why is there a Low priority Queue on the BUGGY AND UNSTABLE PBE? I was trying to get into a game, and my game crashed. I sent the error report and tried to join, 7 more times before I just thought \"Fuck it, they'll remake\". And I get place in Low Priority Queue for 10 games. Next time I tried to play, IT CRASHED AGAIN, and then added 10 more games of waiting 20 minutes before a game. Please, remove this annoyance on the PBE at least, nothing there matters anyway, So why should whether someone stays for an entire game or not matter? If you can't/won't, at least attempt to put a system in that protects people from getting place in the queue if their game crashes and they can't do anything about it.","replies":[{"poster":"Targons Blade","date":"2016-10-19T22:20:38.100+0000","up_votes":2,"down_votes":0,"body":"Regardless if it's in the testing environment of PBE or in a ranked match on the live servers, a disconnection still negatively impacts everyone in the match. This is why disconnections are all treated equally by the system and why penalties cannot be removed.\n\nIf you can give me more details about specific error messages you saw or behaviour around the crash, maybe we can resolve this together.","replies":[{"poster":"WaterPoloGuy","date":"2018-01-22T23:21:12.766+0000","up_votes":1,"down_votes":0,"body":"I totally understand but what about the people who's computers crash or if the PBE glitches\nAs members of the PBE we are supposed to give Riot Games feedback and its hard to do that because you lag every other game. I think if Riot works on the lags then it would be reasonable to include penalties, but now it's kinda unfair.  {{champion:64}}","replies":[]},{"poster":"Tusillody","date":"2017-04-07T12:25:43.828+0000","up_votes":1,"down_votes":0,"body":"Hate to necro a post, but there is a bug currently with low priority queues on pbe where you can't find a game after your leave timer is done. This post was made a month ago but might not have been noticed: https://boards.pbe.leagueoflegends.com/en/c/general-pbe-feedback/rx8l4ZiR-low-priority-broken\n\nI have to play custom games or play nothing at all due to the bug, hope it's fixed at some point\n\nedit: I see now it's specifically with the new client","replies":[]},{"poster":"ThaddeusPrrime","date":"2017-04-04T23:06:11.531+0000","up_votes":1,"down_votes":0,"body":"I have not been able to find a single game because of low priority queue, I login ok I have a 5 penalty and 1 hour goes by I can't get into a game because it puts my party or me solo into the category of you are NOT really important right now sorry. I like testing out something and if I get penalized of not picking my champion on time, then not being able to get a game on THE PBE, in low priority queue, what is the purpose of the pbe?","replies":[{"poster":"ThaddeusPrrime","date":"2017-04-04T23:06:45.408+0000","up_votes":1,"down_votes":0,"body":"I know this is not related but still that is my problem","replies":[]}]},{"poster":"A Clever Pun","date":"2017-01-12T01:41:08.450+0000","up_votes":1,"down_votes":0,"body":"Oh, and to clarify, I was queued in to Fill, to get the fastest queue possible.  And it was STILL an hour long queue that didn't even end in a game.","replies":[]},{"poster":"A Clever Pun","date":"2017-01-11T21:07:18.823+0000","up_votes":1,"down_votes":0,"body":"I know this is a pretty old topic/comment, but I kinda have the same problem.  Unfortunately my computer crashed a lot and was very unhappy with League around the time of Doom Bots.  I got it fixed, but now I have a ton of bad merit attached to my PBE account, in the form of low priority queue.  \n\nNormally I would be fine with this, in Live I just played through my low priority games and dealt with it.  But on the PBE, wait times are already high due to the lower volume of players, and last night I had a 56 minute queue time that I didn't even end up getting into a game from; it just stopped queuing me and I had to reset it which meant another 20 min wait minimum, so I just gave up.  I've tried to get into a game twice now and had 40+ minute wait times in both instances, and haven't even been able to get into a game; I don't have that much free time to burn!  That's an entire LoL game spent just sitting there waiting fruitlessly.\n\nI am not petitioning to remove leaverbuster from PBE, but perhaps the inherently longer wait times on the PBE could be taken into account?","replies":[]}]},{"poster":"haytamkiller","date":"2017-07-03T13:56:36.061+0000","up_votes":1,"down_votes":0,"body":"Pleas let the lower priority queue remove, one time my dad ran in my room because he was mad and closed my pc while i was in a match.\nI think that lower priotity queue is useless just for wasting time of people...{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"DarkSlasher6369","date":"2018-03-11T02:18:55.298+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=haytamkiller,realm=EUW,application-id=osqw6G4M,discussion-id=cEgq6LWc,comment-id=0001,timestamp=2017-07-03T13:56:36.061+0000)\n>\n> Pleas let the lower priority queue remove, one time my dad ran in my room because he was mad and closed my pc while i was in a match.\n> I think that lower priotity queue is useless just for wasting time of people...{{sticker:slayer-jinx-unamused}}","replies":[]}]}]}