{"poster":"Luchowjs","date":"2015-02-08T21:21:52.432+0000","title":"USTEDES QUE OPINAN DE ESTO?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Soy main jungla y siempre pensé que el jungla es lo que marca la diferencia en el juego, ya que el jungla puede tener presencia en todas las lineas, ayudar a la linea que se necesite garantizando asi la victoria en esa lane, junglee toda la s4 con ese pensamiento hasta que empeze a jugar de adc para variar un poco, y de 12 partidas que jugue gane 10 y carreando en muchas de ellas, asi que esto de alguna manera reformulo lo que pienso sobre el rol que marca la diferencia en una partida, dejando de lado las características de nuestro team. ya que cuando se gana botlane uno puede sumar su ayuda en los otros carriles sumada a la ayuda del jungler. asi que ahora me pregunto, que rol es el que marca la diferencia realmente en una partida sin importar que team se tenga, ustedes que opinan?","replies":[{"poster":"ReturnSpeedTwo","date":"2015-02-08T21:26:34.272+0000","up_votes":1,"down_votes":0,"body":"Mid y Jg creo que son los mas importantes para mi, claro esta que si feedea el ADC y gana la linea van a hacer muchisima ayuda pusheando otras lineas y jodiendo al otro jungla pero ponete en esta situacion.\n\nLas 3 lineas empatadas, el jg quiere hacer counter jg o un gank en top o bot, el mid siempre puede estar ahí ya que al ser la linea del medio puede rotar a donde sea y puede ayudar a snowbollear las demas lineas.\n\nEs mi punto de vista ojo, quizás no sea así.","replies":[{"poster":"Ministevo","date":"2015-02-09T00:38:21.464+0000","up_votes":1,"down_votes":0,"body":"Los ayudaremos siempre, mantendremos la culpa cuando fallen y dejaremos que se lleven el crédito en sus victorias.\nAtte: {{champion:12}} {{champion:53}} {{champion:201}} {{champion:40}} {{champion:89}} {{champion:117}} {{champion:25}} {{champion:267}} {{champion:37}} {{champion:16}} {{champion:44}} {{champion:412}} {{champion:26}} {{champion:143}}","replies":[{"poster":"ReturnSpeedTwo","date":"2015-02-09T02:45:20.521+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ministevo,realm=LAS,application-id=v7qsfXsE,discussion-id=FKEQMuxK,comment-id=00000000,timestamp=2015-02-09T00:38:21.464+0000)\n>\n> Los ayudaremos siempre, mantendremos la culpa cuando fallen y dejaremos que se lleven el crédito en sus victorias.\n> Atte: {{champion:12}} {{champion:53}} {{champion:201}} {{champion:40}} {{champion:89}} {{champion:117}} {{champion:25}} {{champion:267}} {{champion:37}} {{champion:16}} {{champion:44}} {{champion:412}} {{champion:26}} {{champion:143}}\n\nYo digo mas en la fase de lineas, en las Tf los supports son los mas importantes siempre.","replies":[{"poster":"Ministevo","date":"2015-02-09T13:53:26.616+0000","up_votes":1,"down_votes":0,"body":"Tranquilo, nosotros los supps push estamos bien con su apreciación. {{item:3151}} \nAtte: {{champion:54}} {{champion:161}} {{champion:101}} {{champion:143}} y otros que no firmaron.","replies":[]}]}]}]},{"poster":"LEYENDA236","date":"2015-02-08T23:43:26.266+0000","up_votes":1,"down_votes":0,"body":"El jungla en early (mas si eres un J4, Vi, Lee, Shaco) hace la diferencia, sobre todo en top y mid donde la linea es sola, si sabes hacer counterganks y adivinas donde esta su jungla, gg easy.","replies":[]},{"poster":"Windergard","date":"2015-02-08T22:52:02.082+0000","up_votes":1,"down_votes":0,"body":"Yo creo que cada rol tiene muchísima importancia en una partida, pero es cierto que un buen jg puede definir partidas desde el inicio hasta el final, y un buen sup puede hacer que el adc sea imparable. De todas, creo que la menos destacada sería top, que suele ser un mundo aparte hasta que se arman las tf. Pero todos son importantes e indispensables.","replies":[]},{"poster":"Ks Erwyn","date":"2015-02-08T21:43:49.178+0000","up_votes":1,"down_votes":0,"body":"yo creo que existen tres fases de impacto en los que considero los roles mas importante de un equipo, según esta 5, primero, el JG, en fase de linea, luego el Supp, ya en fase de Team fight, y finalmente el ADC cuando ya se alarga el juego dado el daño que logra alcanzar.\n\npero de todos los roles ay uno, que siempre puede o tiene inpacto inmediato en el juego, y creo que es el jg.El adc su presencia comienza a ser notoria ya pasado el mid game dado lo que escalo en daño a bace de farmeo y kills, en el supp, es muy importante en los inicios para que el adc llegue bien la mid game, y luego no decae en cuanto a aporte terminada la fase de linea, pero con el jg, pasa que su precencia o impacto en el juego sucede en cada fase del juego, y un mal comienzo o gran inicio o las decisiones que este tome, estan directamente ligadas a como se encaminaran las partidas, un dragon temprano, o snow balear las lineas mediante gank, o dejar nulo al jg rival mediante contra jungla o contra gankeo, no dudo en decir que el JG tiene el rol de mas importancia dentro del juego, pero no se confundan, eso no quiere decir, que el recabe siempre la obligación de carrear el juego, como jg uno, busca las mejores oportunidades siempre de generar una ventaja, para el o sus aliados, si un aliado esta en mejores condiciones de CARREAR, un jg astuto aprovechara tal fuerte de su aliado, por mas lee sin fedeado que vaya, si se que tengo por ej. una irelia, una akali, o ese tipo de campeones, que con algo de snow ball, te rompen el juego y te lo deciden, para que llevarte la kills?.","replies":[]}]}