{"poster":"Spinuz","date":"2015-10-14T09:34:12.517+0000","title":"Problemi WiFi Fritz Box","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"Ciao a tutti.\r\nHo recentemente comprato un Fritz Box 3490 e sto riscontrando gravissimi problemi di connettivit&agrave; SOLAMENTE su LoL e SOLAMENTE su rete WiFi (tutto perfetto via ethernet). Il problema consiste in disconnessioni nella schermata di caricamento della partita e, quelle poche volte che riesce a entrare, in continui &quot;tentativi di riconnessione&quot;. Le ho provate tutte, aprendo porte e abilitando UPnP, ma escludo comunque che il problema sia questo, visto che su ethernet funziona tutto alla perfezione. Aggiungo che nella navigazione normale via WiFi Internet va benissimo, cio&egrave; non sembrano esserci disconnessioni. Ho provato LoL su tre computer diversi, sempre in WiFi, un Mac e due Windows, e il problema si presenta sempre.\r\n\r\nQualcuno con il mio stesso problema che possa aiutarmi? Grazie!","replies":[{"poster":"OblivionTwoCombo","date":"2015-12-16T12:42:38.219+0000","up_votes":1,"down_votes":0,"body":"Stesso problema.... questo è il posto che ho messo anche io, ma con nessuna risposta... http://boards.euw.leagueoflegends.com/it/c/aiuto-e-supporto-it/cr9EEJgp-problema-dopo-la-selezione-del-champ","replies":[]},{"poster":"Hunter1897","date":"2015-10-14T11:39:19.582+0000","up_votes":1,"down_votes":0,"body":"Hai provato a verificare se il tuo pc ha in memoria altre reti wifi e che ogni tot di minuti prova ad agganciarsi ad esse disconnettendo quella con cui realmente vuoi collegarti? Da come descrivi il problema sembra proprio questo. Spesso quando il pc memorizza rete wifi ( impostante con \" connetti automaticamente\") prova in continuazione ad agganciarsi perdendo la rete a cui vuoi accedere in quel momento. Se il problema dovesse essere questo basta spuntare il flag \" connetti automaticamente\".","replies":[]},{"poster":"Whommy","date":"2015-10-14T11:20:56.443+0000","up_votes":1,"down_votes":0,"body":"ottimo modem\n\nprovider?\nbanda?\nfreq. wifi?\nprogrammi, device collegati contemporaneamente?\n\nforse hai dei disturbi, lol è suscettibile con le disconnessioni anche temporanee, forse le hai anche in navigazione ma non te ne accorgi","replies":[]}]}