{"poster":"Hunny","date":"2016-06-21T01:35:08.266+0000","title":"¿Es posible reportar a un jugador fuera de la partida?","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":0,"body":"No estoy muy habituada al sistema de soporte de Riot Games y no me queda m&aacute;s que preguntar, &iquest;Es posible reportar a un jugador fuera de la partida? Es decir, adem&aacute;s de utilizando el sistema de reportes in-game, c&oacute;mo se da en otros v&iacute;deo juegos Online, donde una persona se encarga directamente del tema.","replies":[{"poster":"ANYASZOMORÍTÓK","date":"2016-06-21T01:39:22.479+0000","up_votes":6,"down_votes":0,"body":"No, no se puede. Lo que si podés es agregarlos, hacer dúo y reportarlos a propósito al final de la partida. GG IZI baiteo.","replies":[{"poster":"XsR reddaS","date":"2016-06-21T03:01:11.877+0000","up_votes":1,"down_votes":0,"body":"con que hagan dúo unas 10 partidas y lo reportes al final de cada partida lo banearian? \n\naunque no creo que funcione ya que no creo que en todas las partidas haya un motivo para reportarlo por ende tus reportes serian catalogados como falsos :/ aunque estaba buena la idea xD","replies":[]}]},{"poster":"Ryuushin","date":"2016-06-21T18:40:15.021+0000","up_votes":2,"down_votes":0,"body":"no, lo que se podría hacer, sería venir al foro, y ensuciarles el nombre, y poniendo varias imagenes demostrando porque lo reportas y porque pedis un bann, sería ideal para ciertos jugadores, pero riot prefiere poner esas leyes idiotas del foro, y en vez de encontrar fácil a una persona con comportamiento inapropiado en el juego y bannearla un tiempito, te bannean a vos, así que no, no se puede xD","replies":[]},{"poster":"Yrox the Third","date":"2016-06-21T01:36:58.542+0000","up_votes":1,"down_votes":0,"body":"Un metodo directo, no, en el cliente del juego solo puedes reportar al final de la partida.\n\nEl otro modo es por el soporte, pero ahi necesitas enviar pruebas para apoyar el report.\n\nNo puedes reportar de ninguna otra manera.","replies":[{"poster":"Hunny","date":"2016-06-21T01:43:28.023+0000","up_votes":1,"down_votes":0,"body":"Gracias ¿Pero sabes que tipo de solicitud debería enviar en Soporte? ¿O en qué categoría cabe este tipo de reporte?","replies":[{"poster":"Yrox the Third","date":"2016-06-21T01:46:58.397+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hunny,realm=LAS,application-id=PJAKt7ph,discussion-id=btb2K1Kt,comment-id=00000000,timestamp=2016-06-21T01:43:28.023+0000)\n>\n> Gracias ¿Pero sabes que tipo de solicitud debería enviar en Soporte? ¿O en qué categoría cabe este tipo de reporte?\n\nYo acabo de reportar a alguien en el soporte, solo le di a \"Tengo una pregunta de League of legends/Riot games\" y luego a \"Juego y Caracteristicas > Preguntas generales\"","replies":[]}]}]},{"poster":"KarmaUnder","date":"2016-06-21T01:37:04.965+0000","up_votes":1,"down_votes":0,"body":"Es posible si mandas un ticket a soporte hablando el porque, aunque si es una estupides ni te gastes, osea no vas a reportar en soporte porque alguien dijo izi :V a eso me refiero pero si es algo serio como uso de scrips porsupuesto que se puede","replies":[]}]}