{"poster":"Don KeKeiras","date":"2015-09-17T00:49:49.861+0000","title":"Entiendo que no es la misma situación, pero sigue siendo injusto!","subforum":"Problemas Técnicos","up_votes":3,"down_votes":2,"body":"http://puu.sh/kdUfY/df2beeaa25.png\r\n\r\nDesde las 7 de la tarde hay problemas en Argentina, est&aacute;n las rank como si nada, si chile anda algo mal o pasa algo malo apaguemos todo y nos vimo en disney, se que la situaci&oacute;n ah&iacute; en este momento es dura, pero este no es un servidor chileno, es un servidor LATINO.\r\n\r\nFuerza chile, pero rito, dejate de embromar.","replies":[{"poster":"Temiblor","date":"2015-09-17T00:56:50.571+0000","up_votes":6,"down_votes":1,"body":"\"Estoy al tanto de la situación en Chile, sé que hay alerta de tsunami, que hay un muerto confirmado y 12 heridos y que lo mas probable es que ese número aumente... Fuerza Chile!!!! \nPERO YO QUIERO JUGAR LOCO! TOP O AFK! \n¿Qué, que no se puede jugar? RITO PLS CHILE ES TODO PARA USTEDES, SE VAN REPÓRRRR\"\n\nEso es, básicamente, lo que se puede leer en este post.","replies":[{"poster":"Don KeKeiras","date":"2015-09-17T01:21:37.584+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Temiblor","date":"2015-09-17T01:41:40.655+0000","up_votes":4,"down_votes":0,"body":"No sé realmente quién no entendió a quién.\nEn primer lugar \"tengo un amigo en Chile\" es un argumento tan válido como que un racista diga \"ojo que yo tengo amigos negros eh, no soy racista\" y sentirse libre de culpa de los comentarios imbéciles que puede llegar a hacer (tal es el caso de tu post, en relación a la situación en Chile, pero se ve que sos tan corto que no entendes lo que implica tu propuesta).\nSegundo: el servidor esta en Chile, si hay un problema en Chile, es probable que otros lugares puedan llegar a sufrir problemas de conexión, la magia no existe papito.\nTercer y último punto (quizás el más difícil para tu cerebrito limitado): al principio del comentario hay comillas, que en un punto se cierran. Acá te dejo con un pequeño juego, a ver si adivinas qué significa, mi vida.\n\nDa la impresión de que sos vos quien no entiende, y debo decir que una persona de dos años puede interpretar mejor que vos lo que escribí.\n\nY si tanto querés saber de mí, mi amor, tengo 22 años, estoy terminando la carrera de Sociología en la Universidad Nacional de Cuyo, estoy en varios proyectos de investigación y tengo una lista considerable de artículos científicos escritos. Avisame si querés un link (aunque dudo que entiendas media palabra... Mierda, seguramente ni sepas lo que significa la palabra \"ciencia\").\n\nUn beso en la boca =)","replies":[{"poster":"Don KeKeiras","date":"2015-09-17T01:48:21.222+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Revolución","date":"2015-09-17T01:52:10.801+0000","up_votes":2,"down_votes":0,"body":"De onda, ojalá te borren el tema y te suspendan, me han suspendido varias veces por mucho menos. Y por favor empezá a estudiar que no entendés nada. El pibe te tiró la posta y lo único que hacés es decir \"tenés problemitas blablabla\".","replies":[{"poster":"Don KeKeiras","date":"2015-09-17T01:55:53.508+0000","up_votes":1,"down_votes":2,"body":"Sabes de los bans que tengo en el foro? Es mas, una vez puse porque no ponian nada del competitivo de LATAM en facebook (subiendo una foto de las boludeces que tenían) y me banearon por 1 semana por mostrar la incompetencia que tiene esta gente. \n\nSuena rudo decirle a alguien que tenga problemitas? Sí. Me importa su estado emocional? No.","replies":[{"poster":"Revolución","date":"2015-09-17T01:57:04.799+0000","up_votes":2,"down_votes":0,"body":"Dejá de embarrarla, si te gusta estar suspendido es tu problema, a mí me gustaría dejar de leer las barbaridades que decís una tras otra.","replies":[{"poster":"Don KeKeiras","date":"2015-09-17T02:01:14.716+0000","up_votes":1,"down_votes":1,"body":"Me encanta un buen ban en las mañanas.","replies":[]}]}]}]}]}]}]}]},{"poster":"gambito700","date":"2015-09-17T01:21:30.168+0000","up_votes":2,"down_votes":0,"body":"se aguanta mijo si en arg tubieran mejor calidad de internet y banda ancha seguro el servidor estaria en ese lugar. pero esta en chile ya sea por marketing por costos por publicidad por lo que sea. pero esta en chile por lo que si se le mueve el piso a la maquina, la maquina se puede apagar y explotar. y eso no te combiene a ti ni a mi. \n\naguanta 1 dia sin lol que mas pierden ellos que tu. \n\npor lo demas sal de tu habitacion. yo baje a la cocina. y encontre gente. me flamearon un poco pero les dije que la actitud competitiva sana es mejor. se rieron y me fedearon. Son re buena gente. quizas los agrege.","replies":[{"poster":"Don KeKeiras","date":"2015-09-17T01:26:17.115+0000","up_votes":1,"down_votes":3,"body":"Vos lees lo que estas escribiendo? Tenes algún problema en especial? la verdad el foro está lleno de estos bronces que no entienden nada, aman hacerse los chistositos pero odian que los insulten. Simplemente no se que decir de tu retraso, recuperate pronto.","replies":[{"poster":"gambito700","date":"2015-09-17T01:55:24.475+0000","up_votes":3,"down_votes":0,"body":"pues el server estara llena de enfermitos que se creen chistosos. pero tambien hay enfermitos que entran insultando por que les responden sus dudas.\n\nte lo explico simple amigo. terremoto en chile GG rankeds para arg y el resto. asi de simple. si te gusta bien y si no te aguantas. \n\nun terremoto no se compara con tu ''fibertelcito'' que se cae de 12 a 00","replies":[{"poster":"Don KeKeiras","date":"2015-09-17T02:05:30.383+0000","up_votes":1,"down_votes":1,"body":"1- No tengo fibertel\n2- El servidor no es chileno, si se cae el server se cae el juego, cual hay.\n\nNo se que mierda leen, no estoy diciendo \"QUIERO JUGAR\", estoy diciendo que hay países sin problemas y no los dejan jugar ranked, a mi personalmente no me gusta jugar normals y no creo ser el único. Y no, no estoy reclamando por mi, estoy reclamando por el resto de LATAM Sur.","replies":[{"poster":"gambito700","date":"2015-09-17T02:10:47.049+0000","up_votes":2,"down_votes":0,"body":"pero en una partida ranked, no son todos argentinos ni peruanos ni uruguallos ni bolivianos. lo mas comun es 2 argentinos 3 chilenos o 3 arg 1 chileno 1 peruano. si quieres jugar rankeds y irte a perdida con 2 afk o 1 afk es cosa tulla. pero a riot no le combiene.","replies":[{"poster":"Don KeKeiras","date":"2015-09-17T02:11:27.788+0000","up_votes":1,"down_votes":1,"body":"What the fuck im talking about. Argentina no puede jugar y no deshabilitan nada, flaco, que pedo!","replies":[{"poster":"gambito700","date":"2015-09-17T02:21:18.246+0000","up_votes":2,"down_votes":0,"body":"con esto me despido. y te pido que no abras hilos si no lees antes lo que dicen los rojos. use el red traket para salir de dudas. \npermiso señor riot rocofu:\n\n> Riot Rocofu (LATS)  - about 2 hours ago\n> No es negligencia, pero si decisión.\n> Derrota Evitada no se activa para un país o un ISP o sólo lo que tienen problemas. Se activa para todo el servidor completo, los que tienen problemas y los que no.\n> El efecto de derrota evitada no es sólo inmediato sobre los jugadores que no pierden PL si no que tiene la capacidad de dañar el ecosistema de las ligas clasificatorias debido a que tiene un efecto sobre la acumulación de PL de los derrotados y los victoriosos. Tiene el potencial de dañar el ecosistema entero a más largo plazo que el efecto de un evento de desconexión.\n> \n> Es por eso que somos muy cuidadosos en cuando lo activamos y porqué y el tipo de efecto que tendrá y no lo hacemos para todo. Tenemos políticas claras y límites específicos sobre cuando sí y cuando no se activa.","replies":[]}]}]}]}]}]}]},{"poster":"Guilson","date":"2015-09-17T00:57:10.906+0000","up_votes":2,"down_votes":0,"body":"Y bueno, que dejen las colas abiertas y entre un chileno en tu equipo, PUM se termina la electricidad para el y  tenes un afk, te convendria?","replies":[{"poster":"Don KeKeiras","date":"2015-09-17T01:18:43.871+0000","up_votes":1,"down_votes":1,"body":"En Argentina no se puede jugar, hay mucho lag, estamos en la misma.","replies":[{"poster":"Escualo","date":"2015-09-17T02:13:27.387+0000","up_votes":2,"down_votes":0,"body":"¿Entonces? Si sabés los problemas que hay ¿para qué quejarse de que no hay rankeds?","replies":[{"poster":"Don KeKeiras","date":"2015-09-17T02:15:10.890+0000","up_votes":1,"down_votes":1,"body":"Las habilitaron de vuelta, sigue habiendo problemas G_G","replies":[]}]}]}]},{"poster":"EclipseOfWinter","date":"2015-09-17T00:54:56.521+0000","up_votes":1,"down_votes":0,"body":"Te sorprende que sean así las cosas?","replies":[]},{"poster":"I am bl4z","date":"2015-09-17T00:58:29.814+0000","up_votes":1,"down_votes":1,"body":"Yo quería jugar ranked u.u","replies":[]}]}