{"poster":"First Time Karma","date":"2018-02-13T18:57:59.495+0000","title":"Frage an Riot - Karma hat 20 Armor seit dem Runen-Update","subforum":"Champions & Gameplay","up_votes":2,"down_votes":0,"body":"Hallo,\nich wollte fragen, ob es beabsichtigt ist, dass Karma nur 20 Armor auf Level 1 hat. Zumal da alle anderen Support die ihr &auml;hnlich sind Armor-Werte von 28-33 haben. Kann es sein, dass sie bei den Runen Anpassungen vergessen wurde? Das macht ca einen Damage Unterschied von 10% und entspricht ca einem Gold Unterschied von 200-300 Gold. \n\nVor mehreren Patches wurde Karma als Champion mit den W Veränderungen scheinbar eher auf die Support Position geforced. Weshalb es mich besonders wundert, dass sie so geringe Armor Werte hat. \n\nDieser extreme Armor Unterschied erklärt eventuell auch die konstante Winrate von 45-46,5% - mit der sie auf Platz 35 von ca. 40 gelisteten Supportern auf OP GG ist. \n\nMFG ValkyrieRodrigis","replies":[{"poster":"Allerbester Biss","date":"2018-02-14T05:02:34.628+0000","up_votes":1,"down_votes":0,"body":"Thresh hat 19 oder 17...","replies":[{"poster":"Gin","date":"2018-02-14T13:06:45.637+0000","up_votes":1,"down_votes":0,"body":"Orianna sitzt auch auf 17","replies":[{"poster":"BlackAjani","date":"2018-02-14T13:18:04.491+0000","up_votes":1,"down_votes":0,"body":"aber die hat ihren Kugel Bonus :)","replies":[{"poster":"Gin","date":"2018-02-14T13:24:14.543+0000","up_votes":1,"down_votes":0,"body":"Das stimmt schon, wir reden allerdings von Base Stats. Und Thresh's Armor Auf Stufe 1 ist 28.","replies":[]}]}]}]},{"poster":"MeMyselfandBaal","date":"2018-02-13T23:20:02.667+0000","up_votes":1,"down_votes":0,"body":"hmm... das könnte erklären, warum meine Karma diese Saison so grausam ist... \n\nAber laut Patchnotes hat sie keine Rüstung bekommen, dafür aber mehr Leben und Leben pro Level. Anders ausgedrückt: Sie wurde als Midlaner und nicht als Support behandelt. Was interessant ist und ihr auf der Botlane wirklich Nachteile geben könnte... \n\nDa ich sie bisher immer in der Midlane gezockt habe, gilt diese Ausrede für mich allerdings nicht...","replies":[]},{"poster":"AI Marko","date":"2018-02-13T21:20:45.535+0000","up_votes":1,"down_votes":0,"body":"Und was genau möchtest du genau damit sagen?\nich bin auch ein Karma Spieler und feier eig jedes mal großen erfolg mit der ob es auf der botlane oder auch auf der midlane ist\nMit mehr Rüstung wäre sie glaub auch zu dominant","replies":[]}]}