{"poster":"China Syndrome","date":"2016-11-07T13:43:44.780+0000","title":"Accountprobleme","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Folgende Situation:\r\n\r\nHatte mir damals als Smurf einen Account auf EUW und EUNE parallel erstellt. War glaube ich zu s3 Zeiten. Selber Name / Passwort. Beide habe ich hochgelevelt und hin und wieder gespielt.  \r\nNach einer l&auml;ngeren Zeit wollte ich diesen mal wieder benutzen. Beim Einloggversuch kam die Nachricht, dass entweder PW oder Benutzername falsch sind. Das galt sowohl f&uuml;r EU NE als auch EU W . Sowohl PW und Name m&uuml;ssten aber richtig sein. \r\nAuch wenn Keylogger oder Weitergabe in meinem Falle ausgeschlossen sind, habe ich trotzdem auf op.gg &uuml;berpr&uuml;ft, ob der Account vllt verwendet wird. Auf EUNE existiert er garnicht mehr und auf EUW wurde er nicht mehr weitergespielt. D.h. auf EU NE ist der Name weg und auf EUW muss das PW falsch sein, was seltsam ist, weil ich meine Passw&ouml;rter weder vergesse noch in diesem Fall ver&auml;ndert habe.\r\n\r\nJetzt kommt das eigentliche Problem. Ich wei&szlig; leider nicht mehr, welche Email ich damals verwendet habe, was leider dazu f&uuml;hrt, dass ich mich nicht bei Riot support einloggen kann, um mein PW oder die Emailadresse zu &auml;ndern. \r\nBesteht da &uuml;berhaupt ne Chance, dass mir ein Mitarbeiter helfen kann? Im Grunde wei&szlig; ich aktuell ja nur den Benutzernamen, was nicht gerade beweist, dass ich auch der Besitzer des Accounts bin.\r\n\r\nmfg China","replies":[{"poster":"xBlitzlichTx","date":"2016-11-07T14:34:26.259+0000","up_votes":2,"down_votes":0,"body":"Hallo,\nwenn du Hilfe bei der Accountwiederherstellung brauchst, musst du dich auf der Supportseite nicht einloggen. Gib am besten soviele Informationen wie möglich zu deinem Account an. Dann besteht die Chance, dass dir geholfen werden kann.\n\n[Hier](https://support.riotgames.com/hc/de) findest du die Supportseite.\nGehe dort am oberen Rand auf Sende eine Anfrage und wähle \"Ich brauche Hilfe bei der Wiederherstellung meines Kontos\" aus.\nGibt auf jeden Fall eine Email-Adresse an auf die du Zugriff hast. Die Email-Adresse muss nicht die deines verlorenen League of Legends Account sein.","replies":[]},{"poster":"Svaineprizta","date":"2016-11-07T15:18:57.539+0000","up_votes":1,"down_votes":0,"body":"Mein Fehler. \nWollte nur Bescheid geben, dass es geklappt hat.\n\nthx alot","replies":[]},{"poster":"China Syndrome","date":"2016-11-07T14:38:20.817+0000","up_votes":1,"down_votes":0,"body":"danke für die Antwort. Wo genau gebe ich diese Informationen an. Via PM an staffmitglieder?","replies":[{"poster":"Crounty","date":"2016-11-07T15:11:39.072+0000","up_votes":1,"down_votes":0,"body":"https://support.riotgames.com/hc/de/requests/new?ticket_form_id=72416\n\nUnd bitte in Zukunft die \"Antworten\" Funktion unter der Antwort nutzen, sonst kriegt man keine Nachricht, dass du geantwortet hast","replies":[]}]}]}