{"poster":"HyproxGaming","date":"2015-02-08T09:19:36.099+0000","title":"Teamranked BRONZE 5 ? WTF","subforum":"Clans & Teams","up_votes":1,"down_votes":2,"body":"In unserem 5v5 Ranked Team befinden sich zwei Silver5 Spieler, zwei Bronze2 Spieler und ein Unranked.\r\nWir haben dennoch in unseren Promos NUR gegen Silver Typen gespielt (was eigentlich auch ok ist, weil es ja nicht SoloQ ist) haben trotzdem 3 von 5\r\nSpielen gewonnen, und wurden einfach mal Bronze 5 platziert. Das letzte Team gegen das wir gespielt haben wurde nach einem Win auch Bronze5 platziert... Kann jemand das erklären und vllcht mal sagen ob wir ein paar Ligen überspringen werden ? Wir wollten nämlich noch Silver erreichen xD\r\n\r\nDanke im Vorraus","replies":[{"poster":"Verdammnis","date":"2015-02-08T10:06:29.652+0000","up_votes":2,"down_votes":0,"body":"Gut das es nach den Einstufungsspielen weiter geht. Also ist relativ egal wo man landet, denn man ändert eh die Position. Und da es nicht an Randoms liegt, ist der Aufstieg dann doch sicher.","replies":[]},{"poster":"AkaiHono","date":"2015-02-08T09:30:39.428+0000","up_votes":2,"down_votes":0,"body":"Mir ist das ähnliche mit meinem 3v3 Team passiert und natürlich werdet ihr Liegen überspringen, wenn ihr gut genug seit und es ist auch ganz normal, dass man unter seinem Niveau eingestuft wird, aber es kann natürlich ganz einfach sein: Ihr habts nicht drauf.\nKlingt blöd, aber 5v5 ist etwas ganz anderes als SoloQ und wir mussten uns auch eingestehen, dass wir nicht umsonst Bronze3 sind obwohl wir einzeln alle im Silber bis Gold Bereich sind. Übung ist wichtig und ich wünsche euch viel Glück ^^","replies":[]},{"poster":"Hammerschlag1","date":"2015-02-18T20:49:50.733+0000","up_votes":1,"down_votes":0,"body":"hir ist genau das selbe passiert 3 von 5 gewonnen  3 leute waren silber 2 bronze und wir wurden bronze 5 eingestuft ist glaube normal","replies":[]},{"poster":"Ougi Oshino","date":"2015-02-08T09:26:41.245+0000","up_votes":1,"down_votes":0,"body":"Ihr seid halt einfach scheiße lol.\nScherz beiseite, es gibt viele Faktoren die dazu beitragen wo ihr eingestuft werdet. Erstens wird geschaut ob die Teammitglieder schon einmal in einem Ranked Team eingestuft wurden und in welcher Elo. Dies wird hinzu gerechnet zu eurer Einstufung. Desweiteren kommt halt eure Preformance, nicht nut ob ihr nur gewonnen habt zu tragen und das letzte was ich noch weiß ist, dass am Anfang des Jahres alle immer etwas schlechter Eingestuft werden\n\n\nGrüße \nTanky Sheep\n\nPS: ich wurde das gleiche mit meinem 3v3 Ranked Team und wir bekommen um die 30 Punkte pro win und überspringen unsere Promos xD","replies":[]}]}