{"poster":"fastrob","date":"2015-05-10T04:54:26.163+0000","title":"Rishi, The Enlightened","subforum":"Player Creations","up_votes":1,"down_votes":1,"body":"Rishi, The Enlightened \n\n\nPassive: Incarnation- When rishi is killed his re-spawn time will be cut in half(quarter?).\n\n\nq: Silent enemy- Rishi will attack an enemy&#039;s head dealing x damage and silencing them for a short time.\n\nMind Search (enlightened active)- Rishi reaches into the mind of the closest enemy champ to him(dealing x damage) and stunning them for a short time. \n\n\nw: (Does cost mana I just don't know how much, if you want  you can leave a comment)Phase out(toggle) - Rishi&#039;s body phases out of the physical world, and as such, he can move through obstacles such as walls. He also gains a small speed bonus.\n\nUntethered (Enlightened passive)- Rishi does not move like other champs, instead he charges up whenever he is not moving and can teleport the distance he would of gone. \n\n\ne: Rishi will hit critical points of the opponent dealing x amount of true damage.\n\nRinging Power (Enlightened Active)- Rishi releases a ring of energy around him dealing x damage.  \n\n\nr: Enlightenment- Rishi gains energy whenever he is not moving or in combat. Once the bar is full and the ability is activated he becomes enlightened, increasing his sight, allowing invisible players(including those in the bush) to be seen, and increase his health, magic resist and armour. \n\n\nStory: As a young boy Rishi and his village was attacked by an unknown monster with a living sword. His mother told him to run knowing that the harsh winter storms of the Frejlord would be kinder than this being slaughtering the village. Rishi had no clue where to go but to run from this beast, as such he headed to the mountains. He climbed as far as his child body would let him but the wind and cold were too great to bare. At the brink of death he saw figures quickly lift his small fragile body. After some time he woke to find that he was inside some sort of spiritual monastery deep in the mountainside. There the monks taught him how to let go of his rage and become untethered from this earth. He quickly grew in spiritual and physical power becoming ready to take on any evil that haunts this realm. Not too long after he left, he discovered the league of legends and decided to help them. \n\n\nI don&#039;t mind about his stats, but by all means if it annoys you or if you want to take the time to fill it in ill update it for you.","replies":[{"poster":"Sylpharion","date":"2015-05-10T13:56:04.164+0000","up_votes":1,"down_votes":0,"body":"I don't really know what you just typed. There is no clear description and no actual stats for me to base it off but I'll try to do a review in exchange for you giving Adora a review, but really I don't even care if you do.\n\nPassive: There's a reason why they removed Karthus' passive which only reduced death timers by 10% and the mastery that further reduced death timers by 10%. There is no way you need a death timer to be reduced by 50% or even 25% if Riot doesn't let 10% and 20% on 1 CHAMPION.\n\nQ: I think a better name for Silent Enemy is Headbash and rather than being a silence, it's a stun regardless of enlightenment, there's a reason why all point and click silences were removed.\n\nEnlightened Q is very unreliable, a minion could stand just a tiny bit closer than you and you could've lost a free stun that would've gotten you a kill or gotten away.\n\nW: N to the O. No explanation needed, multiple gap closers and free escapes. New LB, just keep walking through walls like base gates.\n\nE: I don't even know what this is...\n\nR: Uh just no.","replies":[{"poster":"kJs","date":"2015-05-14T15:52:38.897+0000","up_votes":1,"down_votes":0,"body":"{{champion:9}} has a point and click silence btw.","replies":[{"poster":"Sylpharion","date":"2015-05-15T06:02:59.140+0000","up_votes":1,"down_votes":0,"body":"Eh. He doesn't really have any 'burst' other than his ultimate. He's not like Kassadin, Talon or LeBlanc whose point and click are extremely strong plus his kit needs this so people can't really escape during his ultimate, also his E is his only other source of damage while Rishi looks like a huge burst / sustained damage champion.","replies":[]}]}]},{"poster":"kJs","date":"2015-05-14T16:05:05.646+0000","up_votes":1,"down_votes":0,"body":"**Passive:** I think that can work. Lowering respawn timers is not OP in my opinion, as long as it's not on an assassin or extremely high damage champion. A little lacklustre though.\n\n**Q:** The range is going to have to be mentioned here as well as the cooldown and damage, how it scales with items i.e. AP or AD; the duration of the stun as well.\nEnlightened Q seems like a great mechanic, it offers counterplay for the ability.\n\n**W:** The cost, cooldown and duration of the ability has to be mentioned. Mechanical issues like, what happens if you're in the obstacle that you're trying to get through when you phase out. \nEnlightened version; I don't understand. How is it going to indicate how far you'll teleport. This is going to be really counter productive in lane phase, you have to move around a lot in most of the game to do things.\n\n**E:** Mentioning that it does true damage whilst not mentioning how much is just useless. Cool, he can deal true damage but no one really knows if it's good or bad. \nEnlightened version; how much damage?\n\n**R:** What do you mean by this? So if he moves he cannot gain stacks at all? Or does this only apply whilst he's in combat?\n\nI think most people won't be bothered to make the champion for you. I certainly can't be. You'll have to specify CD, Cost, Durations, Base stats, item scaling and elaborate on how your new mechanics will work/interact with environment.","replies":[]},{"poster":"Ghazan","date":"2015-05-11T08:03:00.983+0000","up_votes":1,"down_votes":0,"body":"as a {{champion:43}} main im offended considering her title is \"the enlightened one\" {{item:3070}}","replies":[]},{"poster":"TouchMyKimchi","date":"2015-05-10T05:37:21.854+0000","up_votes":1,"down_votes":0,"body":"So \"Rishi\" can:\n\nSilence, Stun, Move through terrain, Speed bonus, Teleport an undisclosed distance, deal True damage, AOE damage\n+ on Ult: Total Vision, increased health, magic resist and armour.\n\nNot Op at all lel.\n\nAlso, the idea of having to remain still and out of combat to charge 2 of his skills encourages camping/not assisting team.\n\n\n\nSeems legit","replies":[]},{"poster":"ShuffledPancake","date":"2015-05-10T05:02:25.423+0000","up_votes":1,"down_votes":0,"body":"cost for w or is it costless? if so another op thing","replies":[{"poster":"fastrob","date":"2015-05-10T05:13:59.933+0000","up_votes":1,"down_votes":0,"body":"its ok mate im more than happy to change :) im just throwing ideas out there mate","replies":[{"poster":"ShuffledPancake","date":"2015-05-10T05:18:41.707+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=fastrob,realm=OCE,application-id=hIjvqaz6,discussion-id=nK9x59HE,comment-id=00010000,timestamp=2015-05-10T05:13:59.933+0000)\n>\n> its ok mate im more than happy to change :) im just throwing ideas out there mate\n\nIk :D Just some criticism might of been caught out as rude soz","replies":[]}]}]},{"poster":"ShuffledPancake","date":"2015-05-10T05:00:33.268+0000","up_votes":1,"down_votes":0,"body":"that passive is super op, has to have like a 8 minute + timer bcz aa and anivia have a delay so its balanced, also how much hp you got on respawn","replies":[]}]}