{"poster":"SiirFox","date":"2017-03-17T13:23:59.620+0000","title":"[PlatIV] [Mid] searching [Team]&[Coach]","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Me\r\nAlter: 17\r\nVoice: Discord pref. but ts3 available\r\nLeague related stuff:\r\nSpiele aktiv seid Season 2. Ich bin seid 3 Seasons Platin und Preseason V Dia V\r\nMain role ist mid mit einem gro&szlig;en championpool, ich kann alles spielen und wenn irgendwo schw&auml;chen auftauchen werde ich die selbstverst&auml;ndlich ausbessern.\r\nTeam Erfahrung, Season V Plat/dia rankedteam (Vantages) Season VI Gold/Platin, tournament expericene\r\nshotcall experience\r\nMeine Zeit:\r\nTraining unter der Woche sollte kein Problem sein, au&szlig;erdem schaffe ich min 2 soloq pro tag, Wochenenden verf&uuml;gbar\r\nwhat do i search for:\r\nein Coach der mir bei folgendem hilft laningphase/migame/lategame/shotcalling\r\nreq: ich m&ouml;chte dein op.gg sehen und du solltest dia V oder h&ouml;her sein. (wenn mir dein Coaching viel hilft w&auml;re ich sogar bereit etwas zu zahlen)\r\nEin Team das tryharden m&ouml;chte, mit discord or teamspeak, soloQ Gold I++, (Coach) und Turniere spielen  \r\nMy Main: https://euw.op.gg/summoner/userName=nVis%20BiLL \r\nMy Smurf: https://euw.op.gg/summoner/userName=2389546239847650 (i only put my smurf here so you can see i am not boosted, ~70% winrate in low elo ~60 games)\r\nfeel free to add me on my main please\r\nnVis BiLL","replies":[{"poster":"BertaDieMilchkuh","date":"2017-03-17T14:57:17.431+0000","up_votes":2,"down_votes":1,"body":"wieso muss der coach dia 5 sein? :D was hat coachingskill mit Elo zu tun? :) aber ist natürlich deien entscheidung welche kriterien du stellst :)","replies":[{"poster":"SiirFox","date":"2017-03-19T12:09:20.191+0000","up_votes":1,"down_votes":1,"body":"\"laningphase/migame/lategame/shotcalling\"\n\nDas sind die Aspekte, in welchen ich mich verbessern möchte und ich bin der Meinung das mein Verständnis des Spiels ausreicht um Bronze/Silber/Gold überlegen zu sein. Außerdem ist es für Spieler mit schlechteren Mechaniks trotzdem möglich bis Platin/Dia zu kommen, allein durch die vorher genannten Aspekte. Deshalb möchte ich mir nicht von einem Gold II Tipps geben lassen, da ich finde Platin V ist für jeden erreichbar, der das Spiel im Kern verstanden hat. Alles unter Platin V sind ausreden dafür sich nicht genügen mit dem Spiel auseinander gesetzt zu haben. Viele dieser Spieler spielen nur nach Gefühl oder einfach drauf los, das ist mit unter einer der Gründe für Low Elo.\nAber danke für deine Meinung.","replies":[]}]}]}