{"poster":"GameArmy23","date":"2016-11-19T18:46:06.082+0000","title":"Autofill einfach nur TROLL!","subforum":"Champions & Gameplay","up_votes":6,"down_votes":6,"body":"Hallo Leute!\r\nEinige kennen sicher die &quot;super tolle&quot; Funktion Autofill... \r\nWieso gibt es Autofill im Ranked? Ist das extra um vor dem Aufsteigen abzuhalten? Mal im ernst. Ich kriege Leute als\r\n {{summoner:4}}Support{{summoner:3}} die noch nie {{summoner:4}}Support{{summoner:3}}  gespielt haben. Dann ists klar das ich die Lane h&ouml;chstwahrscheinlich verliere, weil mein {{summoner:4}}Supp{{summoner:3}}  gar keine Ahnung hat was er tun soll. Dann warte ich lieber 5-10min und kriege einen vern&uuml;nftigen {{summoner:4}} Supp{{summoner:3}}  als jemanden der gar keine Ahnung davon hat.\r\nW&uuml;rde mich mal interessieren was ihr dazu sagt.\r\n\r\n5/5 WHY&#039;s + ein {{champion:107}}  oben drauf.","replies":[{"poster":"Cr0wnWolf","date":"2016-11-20T11:54:31.352+0000","up_votes":4,"down_votes":0,"body":"Wie gern denk ich bei diesem Post an die gute alte Yoloqueue aus season 3,4 und 5 in der jeder gebettelt hat nicht Lastpick zu sein weil das zu 99% Support war.... Um auf diesem Post zu antworten: Sei lieber froh, dass du momentan eine hohe Wahrscheinlichkeit hast eine von zwei Lanes zu spielen die du willst und nicht jedes Ranked schauen musst in welcher Position du landest. Um es auf den Punkt zu bringen, Riot kann auch die alte Queue wiedereinführen aber dann werden wieder genügend Leute rumheulen weil sie ihre Lanes nicht bekommen.","replies":[{"poster":"Music in my mind","date":"2016-11-20T17:02:20.757+0000","up_votes":1,"down_votes":1,"body":"Das Rumgeheule ist auch verständlich,nur weil es Leute gibt die sich allem fügen und hinnehmen was auch immer gemacht wird ist es noch lange nicht gut,wie darf ich mir den die Ansichtsweise vorstellen?...\"Wenn juckt es ob die Server Laggen,früher gab es nichtmal Internet also sei froh das es überhaupt läuft...\"","replies":[{"poster":"Cr0wnWolf","date":"2016-11-22T09:32:29.750+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Music in my mind,realm=EUW,application-id=Wj1wcocU,discussion-id=EeAbyL2M,comment-id=00060001,timestamp=2016-11-20T17:02:20.757+0000)\n>\n> Das Rumgeheule ist auch verständlich,nur weil es Leute gibt die sich allem fügen und hinnehmen was auch immer gemacht wird ist es noch lange nicht gut,wie darf ich mir den die Ansichtsweise vorstellen?...&quot;Wenn juckt es ob die Server Laggen,früher gab es nichtmal Internet also sei froh das es überhaupt läuft...&quot;\n\nNun, weil das in den meisten Fällen die selben Leute sind die sich dann wieder über zu Warterei aufregen^^{{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"OrangeBubble","date":"2016-11-20T12:22:06.801+0000","up_votes":1,"down_votes":0,"body":"Weißt, dass war der Grund, warum ich Main Support wurde.\nDieses Gezanke war mit einfach zu blöd.\nUnd jetzt kann man schon 2 Rollen auswählen und tdm heult man weiter T.T","replies":[{"poster":"Sirrkas","date":"2016-11-20T12:38:49.323+0000","up_votes":1,"down_votes":0,"body":"Ist bei mir auch so. Eigentlich wollte ich immer Mitte spielen, hab in den Normals aber meistens nachgegeben und bin dann eben Mainsupporter geworden^^\n\nAm lustigsten waren dann die Rankeds, in denen der Lastpick sich schon in der CS über das Spiel gefreut hat, weil er nicht gezwungen wurde Support zu spielen^^","replies":[]}]}]},{"poster":"Music in my mind","date":"2016-11-20T01:57:28.490+0000","up_votes":2,"down_votes":3,"body":"Autofill ist der größte müll überhaupt,ist vergleichbar mit nem Autopick(Hast main Champ gepicked und bekommt jemand anderes)versteh eh nicht warum es in sovielen Spielen eine Support Rolle gibt,die Leute die die Rolle gerne spielen ist einfach zu gering und im umkehrschluss werden Leute die damit garnichts am hut haben genötigt die Rolle wahrzunehmen(was die Mehrheit entspricht)einfach alle Supp Champs entfernen und gut ist und ich kann mit sicherheit sagen was mich betrifft,wenn die Autofill funtion bleibt werde ich kein LoL mehr zocken.Es ist nunmal ein komplett anderes Spielgefühl wenn man eine andere Rolle spielt und warum sollte ich mich in sowas drängen lassen wenn es mir nicht gefällt,ich warte bis der Client aus der Beta Live geht und wenn es immer noch die Autofill Funktion gibt zock ich halt was anderes.","replies":[{"poster":"Awsane","date":"2016-11-20T12:24:00.057+0000","up_votes":2,"down_votes":0,"body":"riot hat sich die Support rolle nicht ausgedacht\nes war die spieler Basis, die die meta entworfen hat und riot hat dann darauf reagiert und eben diese gewünschten Champions erstellt\n\nnur so als info\n\nsoraka war in der testphase des spiels einer der am meist gewünschten Champions von der community was das fähigkeitsset betrifft","replies":[{"poster":"Music in my mind","date":"2016-11-20T13:08:00.926+0000","up_votes":1,"down_votes":4,"body":"Danke für die Info.\nDann müsste sich Riot dementsprechend auch anpassen,seltsam ist auch das vor dem Client mit Autofill es ja auch funktioniert hat mit der Rollen belegung,ja man hat zwischendurch etwas warten müssen aber es war mir persönlich lieber wie ne Autofill Funktion die Spiel entscheidend sein kein,wenn ich in richtung Placement/Promo denke,bestimmt toll wenn man in der Promo das letzte Spiel hat und nen Win braucht und aufeinmal in die Supp-Rolle gesteckt wird(stört einen auch nur wenn man kein Supp Spieler ist).\nNaja wie dem auch sei,ich mach keine games mehr bis der Client Live geht und wenn es die Funktion noch gibt war es das für mich mit LoL","replies":[{"poster":"Awsane","date":"2016-11-20T13:41:04.954+0000","up_votes":2,"down_votes":0,"body":"ich glaube die rolle des Supports jetzt rauszunehmen ist beinahe unmöglich\nweil ja es ist die am wenigsten gespielte rolle\ndennoch gibt es viele, sprich einer von 6-8 spielt gerne und oft Support und denen die rolle nun wegnehmen würde doch ein krasser schritt sein\n\nzudem würde es einschnitte für andere rollen haben, gibt es keine beschützende Champions mehr, müssen Champions die auf schutz angewiesen sind (carries) und Champions die zu den verwundbaren zielen durchbrechen wollen neu überdacht werden (also bruiser tanks und assasins) weil es wäre denen dann zu einfach\n\ngibt es keine supporter mehr will auch keiner mehr carrie spielen\ndu kannst ja nicht den Team aspekt aus einem teamspiel entfernen\n\naber ich bin für neue Ideen offen, aber ich selber weiß nicht wie man das geschickt lösen kann ohne das eine gruppe stark benachteidigt wird, oder das spiel sich in der grundstruktur total ändert","replies":[{"poster":"Music in my mind","date":"2016-11-20T16:47:27.682+0000","up_votes":1,"down_votes":2,"body":"Es gab ne Zeitlang ne Meta wo man 2 Jungler hatte,da fiel auch der supp weg...Richtig darüber nachgedacht bezüglich einer Lösung hab ich nicht,weil es einfach nicht meine Aufgabe ist.","replies":[{"poster":"CMan","date":"2016-11-20T16:55:17.594+0000","up_votes":1,"down_votes":0,"body":"Wann soll das denn Meta gewesen sein?","replies":[{"poster":"Music in my mind","date":"2016-11-20T17:04:25.940+0000","up_votes":1,"down_votes":2,"body":"Puhh ich notieren mir sowas nicht,es wurde in der LCS mal so gespielt wenn ich micht nicht irre und sowas landet ja recht schnell aufn Public,war villt 2-3Monate also nicht all zu lang,könnte S4/S5 gewesen sein,bin aber wie gesagt nicht mehr sicher","replies":[{"poster":"Andrej553","date":"2016-11-21T10:27:52.346+0000","up_votes":1,"down_votes":0,"body":"Es gab mal vereinzelt Spiele in welchen mit 2 Junglern gespielt wurde, so wirklich etabliert und in einem Großteil der Spiele wurde es aber nie gespielt.","replies":[]}]},{"poster":"OrangeBubble","date":"2016-11-20T19:19:34.962+0000","up_votes":1,"down_votes":0,"body":"Von S2 - S6 wurde durchgehend mit Support gespielt und es gab NIE eine Meta mit 2 Junglern, es gab lediglich eine Zeit, da wurde sowas wie Shyvanna mit Smite gespielt auf der Toplane. Der Typ redet einfach nur reinen Bullsh.t.","replies":[]}]}]}]}]}]},{"poster":"OrangeBubble","date":"2016-11-20T15:28:14.456+0000","up_votes":1,"down_votes":0,"body":"Wenn man die Support Rolle komplett entfernt, dann bricht das Spiel zusammen und wäre nicht mehr zu balancen. Durch die Supports können Assassinen und Bruiser so existieren, wie sie es eben tun. Nimmst du Support raus, dann kannst du gleich ADC's mit entfernen. Entfernst du sie, kannst du gleich Assassinen entfernen usw. usf. Das Spiel würde zusammenbrechen. \n\nAutofill wird bleiben, also kannst du das Spiel gleich quitten.","replies":[{"poster":"Music in my mind","date":"2016-11-20T16:53:39.559+0000","up_votes":1,"down_votes":1,"body":"Würde es nicht,der Supp war einfach Komfortable was Engage/disengage anbelangte,und profitieren von einem Supp wird das Team auch erst im Mid/Late-Game,man müsste die anderen Rollen wieder der neuen Situation anpassen und nen Tank Supp erfüllt nicht die gleiche Aufgabe wie ein Heal/CC Supp,wenn man ein weiches Team hat und keiner Engagen kann bringt dir auch der falsche Supp nichts usw.\nZusammenbrechen würde garnichts,man könnte es auch mit Blizzards MOBA vergleichen,ja dort gibts es auch Supp's aber nicht in dem ausmaß bzw. in der wichtigkeit wie sie es in LoL sind .\nAls letzten Hinweis \"Jungle Meta als man 2 Jungler im Setup hatte und kein Supp\"","replies":[{"poster":"Sirrkas","date":"2016-11-20T18:40:15.048+0000","up_votes":1,"down_votes":0,"body":">Als letzten Hinweis \"Jungle Meta als man 2 Jungler im Setup hatte und kein Supp\"\n\n\n\nIch bin mir sicher, die Meta hätte ich mitgekriegt, da ich gerne Doublejungle spielen will, aber eigentlich Mainsupport sind. Das war also vielleicht mal vor Season 2, das ist aber schon ewig her.","replies":[{"poster":"Music in my mind","date":"2016-11-20T18:53:07.367+0000","up_votes":1,"down_votes":1,"body":"https://www.youtube.com/watch?v=sIn-8WE6v6I hab jetzt nur das gefunden aber nicht so lange her :)","replies":[{"poster":"OrangeBubble","date":"2016-11-20T19:13:50.700+0000","up_votes":1,"down_votes":0,"body":"\"Als letzten Hinweis \"Jungle Meta als man 2 Jungler im Setup hatte und kein Supp\"\"\n\nSeit neusten sind Janna und Thresh keine Supports oder was möchtest du mit dem Video sagen?\n\nDouble Jungle war NIE Meta ~\nEs war einmal Meta Smite auf Toplane mit zu nehmen, als die Jungle Items so stark waren, dass es sich eben gelohnt hatte, ein Jungle Item auf Top zu nehmen. Dadurch wurde aber nicht der Support abgeschafft \n\n{{sticker:zombie-brand-facepalm}}\n\nAußerdem macht der Support im Early Game 80% die Lane aus.... \n","replies":[]},{"poster":"Sirrkas","date":"2016-11-20T19:05:19.584+0000","up_votes":1,"down_votes":0,"body":"Du sagtest es wäre Meta gewesen, nicht nur in einzelnen Spielen vorgekommen.  Da besteht durchaus ein Unterschied.","replies":[]},{"poster":"CMan","date":"2016-11-20T18:59:24.942+0000","up_votes":1,"down_votes":0,"body":"Das ist Smite Toplane. Ja daran erinnere ich mich auch. Hatte damit zu tun dass Cinderhulk komplett OP war. +25% Bonus HP oder sowas gab das damals. In dem Game hat Huni komplett reingesuckt, dann aber den Baron geklaut und irgendwie seine Murks-Performance noch gerettet.\n\nZumal das kein zweiter Jungler war, sondern ein ansonsten ziemlich normaler Toplaner. Bloß dass er halt Smite hatte statt Flash. Da waren halt die Champs vorne mit dabei, wo man auf Flash verzichten kann. Shyvana, Fizz, Heca und halt hier der Lee, wobei der abgesehen von diesem einen Game keine nennenswerte Präsenz hatte.\n\nDennoch sehe ich da in jedem der beiden Teams einen regulären Supporter. Von daher ist das nicht das was du gemeint hast.","replies":[]}]}]}]}]},{"poster":"Andrej553","date":"2016-11-21T10:25:38.962+0000","up_votes":1,"down_votes":0,"body":"Tschüß","replies":[]}]},{"poster":"MacDeath","date":"2016-11-19T21:03:31.570+0000","up_votes":2,"down_votes":0,"body":"Das hat denk ich mal weniger was mit der queue zeit zu tun als mit dem Fakt, dass einfach keiner supp spielen will im ranked.\nDu kannst 20 min auf nen supp warten, aber das hilft den anderen leuten die auch nen supp brauchen nicht weiter...\n\nDadurch dass du länger wartest gibt es ja nicht automatisch mehr supporter, nur ne höhere chance, dass jemand die 30 min wartezeit nicht haben will und deswegen die queue abbricht.","replies":[]},{"poster":"BigSnipe","date":"2016-11-20T00:46:48.059+0000","up_votes":2,"down_votes":1,"body":"Es gibt zü wenige Süpports, wenn dü climben willst, spiel doch süpp ünd carry deinen adc!\nOder dü gehst af nen Ts ünd süchst süpps.\n\nAls ich als ADC climben wollte, hab ich einfach nach den Spielen die güten Spps angeschrieben, ünd mit denen weitergespielt. \nMeine Freündesliste besteht aüs Leüten die ich kenne ünd dazü so etwa 10 Main Süpporter (ünd die sind echt güt) \n\nAber meistens spiel ich mit Freünden ünd da wechseln wir ünd als Süpp einfach ab. \n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Caaarl","date":"2016-11-20T09:39:42.778+0000","up_votes":1,"down_votes":0,"body":"verstehe gar nicht worin das problem liegt. wenn ihr jemanden in euer team kriegt, der kein support spielen kann, seid froh, dass er \"nur\" support ist. gute spieler können ja wohl grundlegend alle positionen spielen.","replies":[]},{"poster":"Awsane","date":"2016-11-19T20:42:41.711+0000","up_votes":1,"down_votes":0,"body":"ich denke das die q zeit wenn man autofill wieder abschaffen würde deutlich mehr als 10 minuten verlängern würden\nweil es so wenig supps gibt\nwielange wärst du den bereit im schnitt auf ein game zu warten und ab wann würdest du autofill akzeptieren damit die q nicht zulange dauert?","replies":[{"poster":"Kantax","date":"2016-11-19T20:53:49.734+0000","up_votes":1,"down_votes":0,"body":"Also mir ist es komplett egal wie lange ich warten muss ohne den autofill solange die Leute auch IHRE posi kriegen, einfach da es die Qualität der Runde enorm verringert wenn jemand mit dem Autofill in ne Posi gezwungen wird die er möglicherweise noch nie gespielt hat.","replies":[{"poster":"Awsane","date":"2016-11-20T00:13:42.594+0000","up_votes":1,"down_votes":0,"body":"das Problem daran ist, das deine Position nicht so oft vertreten ist\nalso ich will nicht 1 stunde auf ein game warten, was jetzt kein Unglaublich unrealistischer wert ist\naber 10 Minuten wären ok für mich\n\nes müsste ein System geben wie man seine Zeit/Rollenpriorität einstellen kann (Optimalfall)\nwobei ich keine Ahnung habe ob sowas überhaupt realisierbar ist, weil es das warteschlangensystem unglaublich komplexer machen würde, als was es schon ist\n\nund ich sehe auch einige Probleme, dass es zu einer art Wettrüsten wird, wer länger bereit ist zu warten bekommt seine Hauptrolle und so werden die Zeiten immer weiter hoch gehen \n\ndaher wird es momentan so gemacht, das die Mehrzahl der spieler zufrieden sind (die meisten können mit autofill leben(weil früher musste ja im ranked jeder mal Supporten, und die Mentalität der meisten ist auch so, das sie denken ja es gibt nicht genügen supporter, wenn ich in jeden 6. game einmal Supporten muss ist das ok wenn ich danach meine rollen bekomme in den anderen 5 spielen)\nalle kann man leider nie zufriedenstellend machen und wie gesagt deine Position ist eine meiner Erfahrung nach eher selten vertretende Position und wird daher weniger berücksichtigt denke ich","replies":[{"poster":"BigSnipe","date":"2016-11-20T00:42:41.168+0000","up_votes":1,"down_votes":0,"body":"Das System ist realisierbar, jedoch sehr afwändig. Riot hatte aüch in den Testphasen ähnliche Systeme asprobiert. Jedoch wird dürch solche möglichkeiten die Spielsüche sehr kompliziert, ünd sehr Resorcen lastig. Das kostet Riot viel Geld. \nBei so einem System waren man dann wahrscheinlich mindestens 5min, weil es so viele Kriterien sind die stimmen müssen. \nnd wie dü schon sagtest, dadürch gibt es aüch nicht mehr Süpporter.\n\nD.h. mann müsste wahrscheinlich als only Mid so üm die 2-3 Stünden warten\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]},{"poster":"Match not found","date":"2016-11-23T12:40:02.689+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=GameArmy23,realm=EUW,application-id=Wj1wcocU,discussion-id=EeAbyL2M,comment-id=,timestamp=2016-11-19T18:46:06.082+0000)\n>\n> Hallo Leute!\n> Einige kennen sicher die &amp;quot;super tolle&amp;quot; Funktion Autofill... \n> Wieso gibt es Autofill im Ranked? Ist das extra um vor dem Aufsteigen abzuhalten? Mal im ernst. Ich kriege Leute als\n>  {{summoner:4}}Support{{summoner:3}} die noch nie {{summoner:4}}Support{{summoner:3}}  gespielt haben. Dann ists klar das ich die Lane h&amp;ouml;chstwahrscheinlich verliere, weil mein {{summoner:4}}Supp{{summoner:3}}  gar keine Ahnung hat was er tun soll. Dann warte ich lieber 5-10min und kriege einen vern&amp;uuml;nftigen {{summoner:4}} Supp{{summoner:3}}  als jemanden der gar keine Ahnung davon hat.\n> W&amp;uuml;rde mich mal interessieren was ihr dazu sagt.\n> \n> 5/5 WHY&amp;#039;s + ein {{champion:107}}  oben drauf.\n\nRichtig. Da sich RIOT natürlich nicht den Kopf anstrengt und jetzt Autofill permanent an ist wird es noch schlimmer.\n_**Weg mit Autofill im Ranked pls!!!**_","replies":[]},{"poster":"Kampfgnuppel","date":"2016-11-19T19:41:29.881+0000","up_votes":1,"down_votes":7,"body":"Ist so xD wenn ich Support kriege trolle ich auch nur rein ... einfach impossible to win","replies":[]}]}