{"poster":"IGotScuttleCrabs","date":"2017-04-08T15:47:30.718+0000","title":"I have a feeling the new GA will be a nightmare.","subforum":"Gameplay","up_votes":101,"down_votes":7,"body":"I doubt it&#039;ll ever be a rush item but probably a 3-4 item and the likes of {{champion:104}} {{champion:92}} {{champion:23}} {{champion:157}} running it will cause it to be a good item on few and shit on others or just overall shit. \r\n\r\nAs it {{champion:104}} {{champion:92}} {{champion:23}} like to pick when they fight; easily running to live another day and {{champion:157}} Windwall can save is ass fairly well. But now even if you catch them out they have a second chance. It&#039;s going to be edge of night all over again. \r\n\r\nSide note, I&#039;ll be adding it to my top lane {{champion:56}} cockblock build items {{item:3814}} {{item:3026}}{{item:3102}}{{item:3156}}","replies":[{"poster":"Big Lincoln","date":"2017-04-08T15:53:14.661+0000","up_votes":41,"down_votes":2,"body":"worrying about the wrong champions lel\n\n{{champion:122}} {{champion:420}} {{champion:86}}","replies":[{"poster":"IGotScuttleCrabs","date":"2017-04-08T16:04:01.175+0000","up_votes":9,"down_votes":0,"body":"I see anyone that likes to fight and scales with AD loving this thing. {{champion:122}} {{champion:86}} {{champion:420}} build pretty tanky and second lives with be rather annoying. Just be glad {{champion:266}} is shit otherwise he'd be a monster","replies":[{"poster":"AirKingNeo","date":"2017-04-08T17:41:55.633+0000","up_votes":18,"down_votes":0,"body":"GA sucks on Aatrox. It takes priority over hsi passive meaning he comes out of GA with bloodwell at 0.","replies":[{"poster":"macromite","date":"2017-04-08T20:36:42.615+0000","up_votes":4,"down_votes":0,"body":"funny thing is it used to be reverse. ga was god on trox because it took priority over passive, which ate his bloodwell.","replies":[]}]},{"poster":"o Eon O","date":"2017-04-08T17:56:01.206+0000","up_votes":3,"down_votes":0,"body":"No, it won't be getting built on tanks because it only returns 50 percent of BASE hp now, not max. Super wildly inefficient for them to take, they may as well just go with Steraks, Maw, titanic, or just about anything","replies":[{"poster":"RainbowIcee","date":"2017-04-09T16:15:27.364+0000","up_votes":1,"down_votes":0,"body":"But GA never returned the champion at max hp.. it revives with more hp now or maybe i'm misunderstanding your statement?","replies":[{"poster":"o Eon O","date":"2017-04-09T16:45:29.066+0000","up_votes":2,"down_votes":0,"body":"It didn't return the champ to full max HP, but it gave you hp back BASED on your max hp. Now that it gives you HP back Based on your BASE HP, getting extra hp items has no effect on how much hp it gives you. Someone with 5 warmogs and a GA will get the same health back as someone with no items, only a GA. It's better that way for people who don't look to stack hp at all.","replies":[]}]},{"poster":"woodvsmurph","date":"2017-04-09T07:43:48.414+0000","up_votes":1,"down_votes":1,"body":"Except tanks will be respawning with about 1k hp while squishies will have about 800hp on respawn - not much different from current ga. I could definitely see them buffing the %hp gained on reviving via ga to make it about 1k for squishies. Otherwise they are pretty much guaranteed to be dying again right away if they don't have an immediate escape or the enemy is running from the fight.\nYes ga won't be an item for tanks, but some ad bruisers will get it as a second damage item. Like renek might use it as a replacement for hydra or bruisers may build other hp-based tank items like sterak's and make up for those items lacking resistances by building new ga to get resistances and some more damage. Guaranteed whether it proves to be good or not, people will build it - at least for awhile.","replies":[{"poster":"o Eon O","date":"2017-04-09T13:02:24.944+0000","up_votes":1,"down_votes":0,"body":"The only way they revived with 1k hp is if they are at level 18, so ultra ultra late game. It's not going to happen.","replies":[{"poster":"Hemulen Magi","date":"2017-04-09T15:42:44.540+0000","up_votes":2,"down_votes":0,"body":"Bruisers have more resistances than marksmen applied onto that revived health in any case.  I can imagine this new GA being very good on the champs like {{champion:2}} especially, because he'll revive and start healing due to his innate lifestealing, or he'll take the chance to slow his opponent and run away while his resistances allow that ~800 hp to eat a skill shot or two thrown after him.\n\nBy the way, I don't think it's a problem that bruisers might like this item.  It seems like it will be healthier on {{champion:2}} than {{champion:67}}, since Vayne will probably sometimes just take it so that even if you manage to catch and kill her, she'll revive and condemn you away while rolling off into the horizon... Or she'll condemn and resume perma-kiting while quickly lifestealing back to full health...\n\nSo for Olaf, it's a tool to encourage him to do his job engaging into the middle of the fray.  On Vayne, it's a contingency plan to let her keep her 20 kill streak even if she messes up and should get shutdown...","replies":[]},{"poster":"woodvsmurph","date":"2017-04-10T17:53:54.819+0000","up_votes":1,"down_votes":0,"body":"It will happen simply because people build literally every item in the game in some elo or another.\nBesides that, look at lcs currently - people building ga even when they would survive the fight much longer with an hp+resistance item simply because of ga passive (revive). So as long as it has it's passive, they will build it - unless the revive number becomes so low that it is trash on everyone. \nAs in ... currently late game squishies will revive with 800-900ish hp via new ga. Well if you can land a good sion q or some other cc perfectly timed and have any low cd burst, that person just dies after coming out of ga because they have no resistances. A tank or bruiser would have roughly 1000hp and survive longer due to their resistances. And if they get out of the fight for a bit, they can regen up much faster. Finally, with the hp nerfs to tank items, they won't be missing as much hp upon revive as you would expect with current items AND will probably be building 2 hp+damage items or one more hp-focused defensive item than they currently do - making a resistance item with no hp stats like ga more desirable than it currently actually is.\n\n{{item:3068}} or {{item:3742}} or {{item:3748}} {{item:3025}} {{item:3065}} {{item:3026}} {{item:3110}} or {{item:3190}} \nthose item combos are the tank builds we are currently seeing more-or-less\nrenekton builds\n{{item:3071}} {{item:3748}} {{item:3065}} {{item:3143}} {{item:3026}} \nwe don't know what darius would build for sure but likely between the renek and tank build as he is a tanky bruiser\n\nwith changes, it is 100% plausible that tanky bruisers - if not tanks themselves still build ga. Sample tanky bruiser build with new ga\n{{item:3071}} {{item:3053}} or{{item:3748}} {{item:3065}} {{item:3026}} {{item:3143}} \n\nDue to the hp nerfs to tank items - tanky bruisers feel less bad about having a second hp+damage item - although still sad to lose hp on their core tank items. While they are slightly less tanky than before by building second hp+ damage item, they get more overall damage with ga. For instance, renekton might delay titanic hydra 2nd item to get ga second. He still gets more damage via the purchase and he gets earlier access to resistances for early game teamfights. He can then go 3rd item spirit visage if the enemy has one or more strong ap champs or vice versa for ga and spirit visage build order. Titanic can slot in as 4th item and round off build with randuin's or some other final armor+hp item.\n\nWhile I am not a fan of many of the proposed changes, I will tell you that a renekton reviving with 1k hp late game is not something the enemy team can ignore. Especially when you consider the new items would give him MORE raw ad than his current build. So while tanks and bruisers have less hp to work with when they revive with the new ga - champs like renek or darius can land q to heal up further and dish out more pain faster than before if not immediately put down again.","replies":[{"poster":"o Eon O","date":"2017-04-10T18:43:58.504+0000","up_votes":1,"down_votes":0,"body":"You're an idiot, I didn't say it would be bad on bruisers, I said tanks wouldn't be buying it.  Of course bruisers wouldn't mind that extra 50 ad.","replies":[{"poster":"woodvsmurph","date":"2017-04-11T22:55:27.687+0000","up_votes":1,"down_votes":0,"body":"1. Half the people on boards do not know there is a difference - excuse ME.\n2. I already explained why tanks will still buy an inefficient item. It's resistances are currently redundant and worse than some other options for them based on the other items they build; however it is still bought. Why? For the revive - this will not likely change in most scenarios simply because the hp gained upon reviving is brought down some.\nBut thank you for your kindness.{{sticker:zombie-nunu-hearts}}","replies":[]}]}]}]}]}]}]},{"poster":"Smitty Manjensen","date":"2017-04-09T11:12:43.430+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Big Lincoln,realm=NA,application-id=3ErqAdtq,discussion-id=z9YMy6ov,comment-id=0000,timestamp=2017-04-08T15:53:14.661+0000)\n>\n> worrying about the wrong champions lel\n> \n> {{champion:122}} {{champion:420}} {{champion:86}}\n\nThen you realize you can just run away from Garen, so by the time he gets out of the revive, you can be in the next game.","replies":[{"poster":"FTWolf","date":"2017-04-09T16:42:12.352+0000","up_votes":1,"down_votes":0,"body":"Guys, guys, guys don't forget {{champion:240}}","replies":[]}]},{"poster":"SteelMankind","date":"2017-04-08T21:01:58.832+0000","up_votes":2,"down_votes":0,"body":"And of those three, Illaoi is on a new level entirely.","replies":[]},{"poster":"Alex h8721","date":"2017-04-08T15:58:23.137+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Big Lincoln,realm=NA,application-id=3ErqAdtq,discussion-id=z9YMy6ov,comment-id=0000,timestamp=2017-04-08T15:53:14.661+0000)\n>\n> worrying about the wrong champions lel\n> \n> {{champion:122}} {{champion:420}} {{champion:86}}\n\ncrap this guy is right.  {{champion:58}}  already built old GA too, now it'll be an even better 3rd item for him after {{item:3071}} {{item:3748}}","replies":[{"poster":"Sun Wu Ryuumoku","date":"2017-04-09T04:15:30.346+0000","up_votes":2,"down_votes":1,"body":"not agree... it ur exemple it mean your lacoste have 3 ad item... without any restistance outside boots Oo so it left just 2 possible resistance item.","replies":[]}]}]},{"poster":"OverpoweredSoap","date":"2017-04-08T18:10:38.663+0000","up_votes":8,"down_votes":0,"body":"GA tends to be a problem when its consistently good.","replies":[{"poster":"Anidan","date":"2017-04-09T00:01:57.640+0000","up_votes":3,"down_votes":0,"body":"I've noticed that, too. A revive passive is always incredibly strong in a game like this. Strong enough that in DotA2 the Aegis of the Immortal (their version of GA) has absolutely no stats, and only one is allowed on the field at any time. Granted, DotA2 is a bit different in its balance so that a single item not having stats isn't the end of the world even in the late-game, but it's still a very strong item to have and it can decide games. For League to allow it to be purchased by absolutely anyone, and up to all 10 people, makes it a very strong kind of item, and potentially problematic, when the balance allows for it to be.","replies":[{"poster":"MrHaZeYo","date":"2017-04-09T00:41:01.440+0000","up_votes":2,"down_votes":0,"body":"If all 10 people have one wouldn't it be fair?","replies":[{"poster":"Anidan","date":"2017-04-09T00:51:48.741+0000","up_votes":2,"down_votes":0,"body":"In theory, it would be. In practice, many times a lot of those champions were essentially forced into grabbing it because if they didn't then they'd be at an inherent disadvantage in Round Two because they don't want the item as much. It was part of why certain champions were picked during S2 (I believe) when GA was by far at its strongest in relation to other items: they synergized with the meta at the time, and they utilized GA well, while people who don't play nice with GA and that meta were less popular.","replies":[{"poster":"MrHaZeYo","date":"2017-04-09T01:13:44.235+0000","up_votes":1,"down_votes":0,"body":"I'ma start off by saying I don't disagree with you, but what champions really don't synergism with GA?\n\nIf one mid lane mage, say Syndra bought it, she gives up that extra slot worth of damage, so the other Mage say Orianna wouldn't really be put at a disadvantage by buying one, and vise versa.","replies":[{"poster":"Anidan","date":"2017-04-09T01:28:55.138+0000","up_votes":4,"down_votes":0,"body":"Burst mages don't play well against it, and neither do champions that operate best with team comboing. Orianna wouldn't be put off in theory, but in practice this means her burst pattern is less effective whereas Syndra's isn't since Orianna doesn't have GA. This also means that if a team combo comes out and kills everyone on the enemy team, the enemy team all comes back and now the team that killed them has everything on cooldown, and if they saved cooldowns for when they die the first time then you run risk of them surviving the initial burst and letting them get \"extra credit\" damage. This leads to both teams having to buy it when it's incredibly prevalent. It also impacts certain champions who revolve around killing and need that maintain presence or gain momentum. Karthus and Morde as examples for the former, and champions like Yi and Kat for the latter. Yi and Kat, for example, like using GA themselves but don't like when their enemies have it because it denies them resets and forces them wait before the enemy truly dies, since GA doesn't revive instantly. \n\nIt also devalues massive burst champions like Annie and Veigar when it's strong because they typically rely on killing their target in one large burst and if they live that burst, or come back in the case of GA, then they have no more really effective killing tools against that target. \n\nEssentially: it adds value to champions with low cooldowns and sustained damage/support patterns (Orianna, for example, isn't a terrible pick when GA is en vogue due to her kit, her burst just becomes a bit less valuable but she has support ability to fall back on) while subtracting value from combo-based champions with larger cooldowns, and champions that maintain larger presence through enemy death (Karthus, Morde, Kat, Yi, to name some). It seems balanced and fine if you only think about it 1v1 or in smaller scales, but as soon as it becomes meta for everyone to buy it then you instantly dictate the raised or lowered value of certain picks just off that one item pick-up alone. This is part of why GA always becomes a problem when it's popular: it's a meta-warping item when it's really strong.","replies":[]}]}]},{"poster":"Voluug13","date":"2017-04-10T02:22:19.490+0000","up_votes":1,"down_votes":0,"body":"GA on Riven and GA on anyone that isnt as overloaded as Riven is very different.","replies":[]}]}]}]},{"poster":"LEEROY KLEDKINS","date":"2017-04-08T21:43:06.402+0000","up_votes":7,"down_votes":0,"body":"{{champion:240}} Goes all in. Loses Skaarl. Gets 90% courage. Regains skaarl. Fights. Loses Skaarl (Again). Takes forever to die. Dies. Gets Resurrected by {{item:3026}}. Skaarl passive is active. Gains full courage. Regains Skaarl (Again! *Snorts*). Fights. Loses Skaarl. (AAAGAIN!). Takes forever to die again. Dies.\n\nDed!  took like 10 years to kill kled.... mmm very balanced.","replies":[{"poster":"Bladerunner7777","date":"2017-04-09T14:12:44.118+0000","up_votes":2,"down_votes":0,"body":"Don't forget the part where he is cleansed from Malz ult every time he loses Skaarl\n\nIm salty","replies":[{"poster":"LEEROY KLEDKINS","date":"2017-04-10T01:24:53.381+0000","up_votes":1,"down_votes":0,"body":"Chance of you getting hit by a long cd is pretty low but yeah its hilarious when someone waists a long cd spell on your kled and you get a free cleanse XD.\n\nI even had a garen on my lane who ulted me when my skaarl was low hp then he flamed in chat calling me a scripter XD because i didn't die XD.","replies":[]}]},{"poster":"no to toxic","date":"2017-04-09T10:15:10.241+0000","up_votes":1,"down_votes":0,"body":"More like he gets dropped and before he knows it the minions burst him down.","replies":[{"poster":"LEEROY KLEDKINS","date":"2017-04-10T01:25:59.463+0000","up_votes":1,"down_votes":0,"body":"lol you sure those minions weren't AD {{champion:90}} voidlings?\n\nNo, Im serious. Just try AD malz its freaking hilarious.","replies":[]}]}]},{"poster":"SteelMankind","date":"2017-04-08T20:59:10.681+0000","up_votes":5,"down_votes":0,"body":"What struck me as OP moreso than GA passive on an AD item was **armor on an AD item**.\n\nThis hasn't been in the game since Atma's. I can see ADC's rushing it because it would be impossible to ever win a duel against a champion with a armor/ad item with an ad/as item.","replies":[]},{"poster":"The Sword Saint","date":"2017-04-08T18:39:32.354+0000","up_votes":5,"down_votes":0,"body":"Implying those champions didn't already like ga as a 5-6 item.\n\nBtw they specifically said they made it gold and slot inefficient to make it a bad 3-4 item.","replies":[]},{"poster":"PhDs Nuts","date":"2017-04-08T19:05:09.487+0000","up_votes":1,"down_votes":2,"body":"lol all this worry about carries and bruisers...\n\nMeanwhile I'm just imagining new GA and Gargoyle on {{champion:54}}","replies":[{"poster":"My Waifu Vanilla","date":"2017-04-08T23:21:15.427+0000","up_votes":4,"down_votes":0,"body":"new GA is terrible on tanks since it is an awful revive on any thing that actually buys healths.","replies":[]}]},{"poster":"AirKingNeo","date":"2017-04-08T17:43:26.706+0000","up_votes":3,"down_votes":2,"body":"Why are we complaining about the new version of GA? It's not even slot efficient stat wise compared to most items. Seriously, 40 AD and 30 armor? You call that \"broken\"? Kid, I'd rather have the current one here. At least it's a solid armor MR item that fits onto anyone and has stats worth it's slot. 40 AD and 30 armor is not worth a slot compared to other items.\n\nWho cares of others use it.","replies":[{"poster":"Oakleaf Ranger","date":"2017-04-08T18:58:27.576+0000","up_votes":2,"down_votes":1,"body":"Its not going to be a rush item, but after the first 1-2 items, every ad bruiser/tank is going to rush it. \n\nWhy?\n\nbecause its going to make you split pushing/tower diving/team fighting significantly better compared to anyone who doesn't have it. Your really underestimating how effective what essentially is going to be a second life bar now that it has damage stats to keep the user's damage relevant and while being tanky at the same time.","replies":[{"poster":"AirKingNeo","date":"2017-04-08T19:05:16.358+0000","up_votes":3,"down_votes":0,"body":"GA was already a rush item 3-4.","replies":[]}]}]},{"poster":"Guy Fox Teemo","date":"2017-04-08T20:09:30.532+0000","up_votes":6,"down_votes":3,"body":"if yasuo built GA 3rd or 4th item his DPS would be *COMPLETE* garbage, may as well have afk'd.\n\nYour blowing it way out of porportion.","replies":[{"poster":"QuickenedBlade","date":"2017-04-08T21:16:56.987+0000","up_votes":1,"down_votes":1,"body":"IE PD Mercs then GA. Instantly dead. Next item BT and Frozen Mallet and he's unkillable","replies":[{"poster":"Guy Fox Teemo","date":"2017-04-09T03:37:18.406+0000","up_votes":2,"down_votes":0,"body":"You forget how much gold it takes to buy all 4 of those items, and by that time, Yasuo's already scaled to be decent or is complete shit and probably is losing the game.\n\nHe's feast or famine, you either complete shit on them with a ton of damage or you dont do anything at all.","replies":[]}]},{"poster":"Automated Riven","date":"2017-04-08T21:03:28.561+0000","up_votes":1,"down_votes":0,"body":"Idk man. If I was snowballing out of control with riven IE like 5-0 I would sure as hell be picking this up second item to cement my lead. Thats 40 AD in addition to the GA passive not even counting the armor. and the 50% base health is a pretty nice buff for fighters who dont build alot of health.\n\nIts super cheap too. If i was going for a Hydra or any lethality item I would be sacrifising like when I bought it but then when I acrued the same amount of gold I would have components to make up for it. \nLike Ravenous hydra is 3500 gold so you end up with GA which is 40 ad 30 armor and passive. and then for +100 gold you could have tiamat and your minus 15 ad 12 lifesteal and a bit of damage on the active. but your up 30 armor and the passive. \nEven comparing the differance to EON If you went GA you would have 40 ad 30 armor and passive plus at +200 gold you would have 50 ad and 25 mr 30 armor and passive. you would be trading the spellshield for revive and 10 mr/5ad for 30 armor. ","replies":[{"poster":"Guy Fox Teemo","date":"2017-04-09T03:37:54.637+0000","up_votes":3,"down_votes":1,"body":">If I was snowballing out of control with riven IE like 5-0\n\n\nBy that time GA in the first place is irrelevant because your snowballing out of control......","replies":[]}]}]},{"poster":"Sp33d Zer0","date":"2017-04-09T04:54:24.547+0000","up_votes":2,"down_votes":0,"body":"But the new Banshees is shit for noc.","replies":[]},{"poster":"QuickenedBlade","date":"2017-04-08T21:16:04.584+0000","up_votes":2,"down_votes":0,"body":"GA gold cost being lowered made it op\n\nthis....\n\nthis is cancer....","replies":[]},{"poster":"AmazoX","date":"2017-04-08T18:50:33.866+0000","up_votes":4,"down_votes":2,"body":"Yasuo will never build GA 3rd-4th item, There are many other options that are way better.","replies":[{"poster":"yay nibbers","date":"2017-04-08T19:48:43.887+0000","up_votes":2,"down_votes":0,"body":"Not to mention most Yasuos already build it fifth or sixth item. But yeah, I don't think anyone will be building it over huge power spikes like IE or BT","replies":[]}]},{"poster":"GrReaper96","date":"2017-04-08T19:17:07.947+0000","up_votes":2,"down_votes":0,"body":"> Side note, I&amp;#039;ll be adding it to my top lane {{champion:56}} cockblock build items {{item:3814}} {{item:3026}}{{item:3102}}{{item:3156}}\n\nBut but..... {{item:3102}} gives ap now......","replies":[]},{"poster":"Cosmic Warper","date":"2017-04-08T18:02:16.789+0000","up_votes":2,"down_votes":0,"body":"I have a bad feeling about all of the new tank items... adaptive helmet seems broken","replies":[]},{"poster":"MrHaZeYo","date":"2017-04-08T16:44:38.674+0000","up_votes":3,"down_votes":1,"body":"Except all of those champions could already build GA before. Now they will just do slightly more damage,  with a shit ton of less resistances.","replies":[]}]}