{"poster":"Mystelaine","date":"2018-02-07T18:55:07.895+0000","title":"¿Beneficio real para los que tenemos AFKs en Clasificatorias?","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Buenas tardes. Quiero consultar algo referente a los Afks que suelen haber con mucha frecuencia en este servidor, sobre todo, en las partidas de clasificatorias. La verdad es que el sistema de remake es muy &uacute;til, pero, &iquest;qu&eacute; pasa con esta gente que se va afk al minuto 20-30?. Probablemente a futuro si repite conducta lo banean. &iquest;Pero que soluci&oacute;n tenemos NOSOTROS los afectados?. Yo personalmente estoy podrido de que por 10 partidas que juego tenga que irse en 2 o 3 un afk a la mitad y derrochar puntos. &iquest;Existe o se ha hablado de alg&uacute;n sistema que pueda reembolsar algo de lo perdido a medida de esto?. Porque actualmente soy plata y con lo que cuesta subir en estas ligas, tener que lidiar con un afk ya es un peso cruel. \r\n\r\nAgradecer&iacute;a sus comentarios. {{item:2056}}","replies":[{"poster":"Dyaebl","date":"2018-02-07T19:00:33.051+0000","up_votes":1,"down_votes":2,"body":"> ¿Existe o se ha hablado de algún sistema que pueda reembolsar algo de lo perdido a medida de esto?\n\nSe ha hablando, la respuesta fue un \"No.\"\nSi los puntos fueran configurables por algun otro sistema podria dar lugar a un rioter gracioso vendiendo lp.\n\nOtra solucion seria reducir/aumentar los lp en relacion si hay o no afk en la partida, pero esto seria aprovechado por muchos(incluyendome)\n\n\nSi no podes subir de plata no es por culpa de afk, es por culpa TUYA y nada mas que TUYA.","replies":[{"poster":"Get Jïnxed","date":"2018-02-08T00:32:57.654+0000","up_votes":2,"down_votes":0,"body":"\"Si no podes subir de plata no es por culpa de afk, es por culpa TUYA y nada mas que TUYA.\"\n\n\nke sad :'( {{summoner:3}} {{item:3151}}","replies":[]},{"poster":"leogamer96","date":"2018-02-07T19:14:59.054+0000","up_votes":2,"down_votes":1,"body":"A entonces queres decir que si rankea 10 partidas y le salen en 5 de 10 partidas 5 afk y pierde esos puntos es culpa de el ??? Que estas diciendo no entiendo tu manera de pensar","replies":[{"poster":"Dyaebl","date":"2018-02-07T22:11:25.427+0000","up_votes":1,"down_votes":0,"body":"Confundiste 2 temas, uno es el de perder por afk y otro es el de subir de liga.\n\nSi no puede subir de liga es porque el no lo merece, no es culpa de nadie mas que de su skill que el no pueda subir.\nPerder por un afk es injusto, pero eso no afecta realmente a alguien que se empeña en subir, si el quiere subir y se pone a mejorar probablemente suba sin importar si le toca un afk, un troll, un flammer, riot gabvy, un feeder, dasant ko o barbakhan.\n\n\nNunca te toco en afk en contra? un troll? siempre te tocan a vos? no, esta gente te puede retrasar un poco pero nunca va a ser la causa de que uno este estancado.","replies":[]},{"poster":"Rito JeZylZ","date":"2018-02-07T19:41:45.112+0000","up_votes":1,"down_votes":0,"body":"No es la de el riot puso eso de ejemplo en un post hace mucho","replies":[{"poster":"Dyaebl","date":"2018-02-07T22:07:30.656+0000","up_votes":1,"down_votes":0,"body":"Eso es lo que siempre pense, se que en un momento tambien se explico el tema asi.","replies":[]}]}]},{"poster":"Mystelaine","date":"2018-02-07T19:06:15.378+0000","up_votes":1,"down_votes":0,"body":"Veo que te quedaste con lo último que era lo más probable. Mi tema no es que debido a esto yo no suba de liga, eso esta claro, a pesar de que es un factor innegable (mínimo) aunque no estés de acuerdo. El resto de tu comentario lo suscribo ya que respondió mi pregunta principal. Gracias por tu opinión.","replies":[]}]}]}