{"poster":"R4iot","date":"2015-06-30T21:46:43.158+0000","title":"This game.","subforum":"Miscellaneous","up_votes":2,"down_votes":3,"body":"The fact that i am level 14 vsing people who are 30 with runes and mastries it the most bullshit thing i have seen. Why the f#ck do i need f#cking runes and mastries......Why are they even in the game?! what the f#ck? Just take them out of the game ffs.....Learn something from f#cking dota omfg.....first i had to buy champs which i dont really mind anymore then i discovered this mastries and runes bullsh!t. I am trying to f#cking play vayne with 61 ad at the start against some numbnut who is playing graves or lucien or some other champ with bloody 80 ad and ofcourse i fucking die and feed and quit because i have better things to do than coming back into a game while i'm 1-11-4....Either match me up with people under level 21 or make it so people under level 21 can buy them teir 3 runes OR better just delete the fucking damn things ffs.","replies":[{"poster":"Ingénue","date":"2015-07-01T01:57:41.757+0000","up_votes":3,"down_votes":0,"body":"The true reason you are matched up against lvl 30s despite being only lvl 14, is not because you are good (sorry to burst your bubble), but because on our tiny little server we don't have enough pre-level 30s to match you up against. \n\nJust deal with not having runes or masteries for another 6 levels and don't buy any champions (to save for runes) and then go hard.","replies":[]},{"poster":"Legends man1","date":"2015-07-01T03:35:12.340+0000","up_votes":1,"down_votes":0,"body":"You're level 14. When did you start normals? You will play against level 30's occasionally but not every game. As you near level 20 you'll start playing against players who have runes and you will have a disadvantage but just get through the games and once you're level 20 you can buy the runes too. \n\nAlso one reason why I think new players get matched with players way past their skill level is because when you start normals on a fresh account, I heard you start with a mmr equivalent to a silver 5 player. Now from the next few levels and games this mmr will rise or decrease so you will get games where your team rages at you for not doing something obvious to a seasoned player but unknown to a newbie. Take these games as a chance to learn how to play properly. Once you lose like 10 games you'll eventually win one and get placed against players your skill level.","replies":[{"poster":"Ingénue","date":"2015-07-01T10:11:36.154+0000","up_votes":1,"down_votes":0,"body":"While the first portion of your post is true, the second part is not. Your second explanation applies solely to \"ranked\" games and not normals.\n\nNormals do have mmr, but it is not that greatly influenced by wins and losses as ranked. They always try to match people pre 30 with people also pre 30 but with such a tiny player base this is simply not possible. On the other servers it works better. In oce normal matchmaking is pretty much match whoever is queuing up together, no matter their rating.","replies":[]}]},{"poster":"SorakaXHealBoT","date":"2015-07-01T04:17:46.081+0000","up_votes":1,"down_votes":0,"body":"Graves is the worst matchup for Vayne","replies":[]},{"poster":"Wiggy","date":"2015-07-01T00:59:59.538+0000","up_votes":1,"down_votes":0,"body":"also mate starting adc as vayne is a hard route to take, just sayin.","replies":[]},{"poster":"Mid Dumbledore","date":"2015-07-01T00:56:17.336+0000","up_votes":1,"down_votes":0,"body":"The reason ur placed with them is because your obviously good and the matchmaking system is placing you with higher ranked players since ur just too good for ur lvl","replies":[]},{"poster":"BladeSensual","date":"2015-07-01T00:45:36.943+0000","up_votes":1,"down_votes":0,"body":"u vs them because u have the same \"skill level\" as them. ur mmr must be the same as some of those level 30's i guess. take it as an honour","replies":[]},{"poster":"R4iot","date":"2015-07-01T22:56:28.897+0000","up_votes":1,"down_votes":1,"body":"Someone delete this post, i was angry and i lost it.... :/","replies":[]}]}