{"poster":"Legend Alpha","date":"2015-10-20T18:03:50.411+0000","title":"Galio Buff?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"Ich spiele LoL schon ziemlich lange deshalb kenne ich Galio auch lange.\r\nAber in Season 5 wird Galio sogut wie nicht gepickt und so stark &amp; gut ist er auch nicht in diesem matter,\r\nGepickt wird er auch nie \r\nDa frag ich mich langsam wann wird er entlich gebufft?!\r\nein {{item:2010}} f&uuml;r Galio damit er gepatch wird und evtl. ein kleinen aber feinen Buff bekommt","replies":[{"poster":"Kata Ga Kill","date":"2015-10-21T06:37:24.118+0000","up_votes":2,"down_votes":0,"body":"Also nur weil Ihn keiner spielt heist es nicht das er Weak ist, ganz im Gegenteil.\nSei froh das Ihn niemand spielt dann haste wenigstens keine Main Konkurenz.\n\nLaut Statisktik auf Lolking liegt seine Gewinnchanche weit über 50%-60%.\nEr wird halt nur gepickt von \nA) Leuten die Ihn mögen/spielen können\nB) Wenn genug AP beim Gegner vorhanden ist.\n\nDenn dann zerstört Galio alles.\nEs liegt einfach am Meta das in der Regel nur 1 Damage Dealer AP gespielt wird oft und mehr Gewicht auf Tanks und dem ADC gelegt wird.\nAber nicht desto trotz kann man Ihn dennoch spielen wenn du Ihn magst spricht ja nix gegen nen Tanky Mage den man genauso Top wie Vladimir spielen kann und dazu ne Ult hat die einfach nen Krater hinterlässt.","replies":[]},{"poster":"Metalmonni","date":"2015-10-21T16:47:25.857+0000","up_votes":1,"down_votes":0,"body":"Galio ist nicht schwach, er passt nur absolut nicht ins Meta. Davon abgesehen hat seine Ulti ein paar \"unglückliche\" Mechaniken... Aber an sich ist Galio ein starker Champ mit viel Tankyness und Schaden.","replies":[]},{"poster":"Im a Papaya","date":"2015-10-20T18:36:51.449+0000","up_votes":1,"down_votes":0,"body":"Ich find das Galio an sich ziemlich stark sein kann, beim richtigen Matchup, aber er ist halt für viele zu langweilig zu spielen. Ein Windhauch, eine kleine Explosion und ein Schild sind nichts gegen die Fähigkeiten von anderen Champs die einfach größtenteils mehr Reichweite in der Mitte haben. Seine Ult kann ganze Teamfights entscheiden und seine Passive ist ein wahrer Alptraum für alle Magier. \nEin Buff würde nicht Schaden aber ich denke das er wohl eher Reworked wird, weil er beinahe so beliebt ist wie Yorick.\nIch hab Galio bisher 2 mal in meiner Laufbahn gesehen. Das sagt schon einiges.","replies":[{"poster":"zadok","date":"2015-10-21T14:38:03.669+0000","up_votes":1,"down_votes":0,"body":"ich seh ihn auch so selten gewinn aber 80 prozent der spiele mit ihm genau deswegen :D   aber langweilig ist der lieber was spielen was die gegner mehr nerft ww oder fiddle :P","replies":[{"poster":"Im a Papaya","date":"2015-10-21T14:52:28.448+0000","up_votes":1,"down_votes":0,"body":"WW nervt ? Wenn du als Top lane ww mit Hyänen Skin Strg 4 spammst dann nervst du aber sonst nervt er mich nicht sonderlich xD (VOR level 6 -_-)","replies":[{"poster":"zadok","date":"2015-10-21T14:55:25.744+0000","up_votes":1,"down_votes":0,"body":"er nerft ich sage nicht das er stark ist er nerft einfach nur gegen ww musst du meist qss bauen ( es sei den du hast ma nen team das rafft das cc die ult untebricht, und 2tens sind die animationen so was von nerfig ich hab immer das gefühl mit / bzw gegen einen %%%%%en zu spielen ( besonders die leute die immer 2 sec stehen bleiben wenn der gegner nicht mehr in sichtweite ist ...","replies":[]}]}]}]},{"poster":"zadok","date":"2015-10-21T14:36:31.401+0000","up_votes":1,"down_votes":0,"body":"Galio ist ein nischenpick er ist nicht wie lee sin in jedes team pickbar aber er hat seine stärken und ein buff ist nicht nötig wenn du ein team mit 3 apc als gegner hast nimmste nen galio und schon is das game gewonnen\nund der demage lässt sich auch sehen wenn man ihn buffen würde das er richtig stark ist würd er jeden apc aus der meta drängen ....","replies":[]},{"poster":"OrangeBubble","date":"2015-10-21T13:40:21.663+0000","up_votes":1,"down_votes":0,"body":"Wenn ich ein Galio mein im Gegnerteam hab, graust es mir nur noch {{champion:32}} \nDie Main kriegen ziemlich gut DMG raus und können meist auch gut carrien {{champion:32}} \nScheint also nicht ganz so schlecht zus ein... in meinem Elo Bereich...","replies":[]}]}