{"poster":"LehPanteraRosa","date":"2018-03-06T15:07:06.521+0000","title":"Superar una racha de derrotas?","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Simplemente eso, tuve 3 rachas de derrotas de 7 partidas cada una mas o menos, (baje de p2 99lp a silver 3 con 20 lp(porque gane una reci&eacute;n). Solo me cuesta mucho cortarlas, y a veces (aunque me gustar&iacute;a pensar que no tengo la habilidad suficiente para carrer partidas, pienso que hasta silver 1 podr&iacute;a hacerlo) me tilteo duro, pero nunca flammeo. Wardeo bastante bien, compro pinks sea la l&iacute;nea que vaya, miro el mapa cada 7 segundos, roameo, gankeo, snowballeo etc. Pero estas partidas perd&iacute; el toque, de tener 58 wins y 45 L pase a 65w64L. Magicamente deje de carrear hasta con mis mejores campeones. Ya prob&eacute; distendiendome del lol unos d&iacute;as pero a veces no me sirve, y eso que no me mand&oacute; de una a ranked porque s&eacute; que despu&eacute;s de un receso hay que calentar. Alg&uacute;n consejo para cortar este tipo de rachas? Y d&iacute;ganme si tambi&eacute;n les pas&oacute; algo parecido, porque es la primera vez que me pasa nada 3 a&ntilde;os que llevo jugando este juego :v","replies":[{"poster":"Tortuguita","date":"2018-03-06T15:22:52.507+0000","up_votes":2,"down_votes":1,"body":"Practicar en otra cuenta o simplemente seguir dándole pero con consciencia de progreso. Hablo que veas cada uno de tus errores en la partida y en la siguiente los intentes arreglar , con suficiente concentración al final volverás a lo que una vez fuiste.\n\nHacer duo es de NOOBS (?","replies":[{"poster":"Exelbat","date":"2018-03-06T16:27:21.501+0000","up_votes":1,"down_votes":0,"body":"todo lo contrario, que mejor que jugar con una persona que conoce perfectanmente tu estilo de juego antes que un desconocido que juega solo para el mismo, la mejor forma de carrear a oro es tener un premade con el cual tener una buena comunicacion y hacer buenas sinergias para carrear toda la partida solos, saludo!!\nPd:Te lo digo por que a mi me funciona","replies":[{"poster":"Tortuguita","date":"2018-03-06T16:38:51.319+0000","up_votes":1,"down_votes":0,"body":"Esto es SoloQ , no digo que no funciona , pero si es mucho mas fácil subir. Estamos hablando de las ligas mas bajas así que sino puedes salir por tu cuenta del pozo entonces muy pulidas tus habilidades no son.\nEl tener ayuda solo te hace aun mas perezoso.","replies":[{"poster":"Exelbat","date":"2018-03-06T17:03:30.172+0000","up_votes":1,"down_votes":0,"body":"en algún momento vas a tener que si o si mejorar tus habilidades, un dúo de plata no carrea una partida en diamante, a eso me refiero, a través de la ayuda mutua se puede subir tranquilamente, no te hace mas perezoso tener una ayuda, te ayuda a mejorar mecánica y técnicamente, de que sirve un duo que tiene una tremenda sinergia y comunicación si no pueden stomepar una partida o por lo menos carrearla, tener un duo no te hace mas perezoso, te hace mas dedicado y objetivo, te lo digo yo, que tengo a mi duo que siempre me supportea cuando voy adc y me conoce mejor que nadie el estilo de juego que tengo con los pjs que siempre practicamos. un saludo","replies":[{"poster":"Tortuguita","date":"2018-03-06T17:22:33.135+0000","up_votes":1,"down_votes":0,"body":"El 80% de las veces te las veras tu solo por que esto es SoloQ , el estar haciendo Premade desde las ligas mas bajas en donde careces de todas mecánicas (nuestro amigo ya tiene historia) solamente hará que te hagas mas dependiente del carrito y no generes carrito por tu cuenta.Lo que expones es bueno si es que ambos tienen el mínimo de habilidad y se van puliendo uno con otro pero esto es un caso de elo muy bajo y si o si debes \"Aprender a Carrear Solo\" por que , a menos que estés 24/7 con tu duo , mas adelante no estarás en premade y te las veras con un vació enorme que debe ocupar ese \"duo\" cuando tu solo pudiste haberlo hecho con un mínimo de esfuerzo y consciencia. (Estamos hablando de ligas menores a D1 , low elo)","replies":[{"poster":"Exelbat","date":"2018-03-06T17:30:36.710+0000","up_votes":1,"down_votes":0,"body":"en el caso que tu expones te doy toda la razón, por eso digo que hay que tener un dúo que se de suma confianza y que ambos puedan mejorar mutuamente (en mi caso salí de bronze con el, pasamos de ser unos mancos a cada ves entender mas de macrogame y el meta del juego), pero como tu dices, en algún momento te vas a ver en una liga mas alta que plata sin tu dúo y al ser premade dependiente no vas a ganar nada, en eso si te doy la razón, yo creo que tener un dúo funciona tranquilamente si se tiene el tiempo y la condición para llevarlo a cabo, sino, como dices tu, no funcionara jaja","replies":[{"poster":"Tortuguita","date":"2018-03-06T18:00:45.813+0000","up_votes":1,"down_votes":0,"body":"Son pocas las veces que las personas pueden complementarse y aun menos tener el tiempo para hacerlo (los tiempos que corren , utilidad y rapidez , asco me da xD) Por eso digo que es poco recomendable desde abajo (low elo) hacer duo por que tus bases se están forjando y debes hacerlo por tu cuenta , pero si alguien te da consejos esta de 10.","replies":[]}]}]}]}]}]}]},{"poster":"blizgas","date":"2018-03-06T15:18:53.195+0000","up_votes":1,"down_votes":1,"body":"ganando?","replies":[{"poster":"LehPanteraRosa","date":"2018-03-06T20:31:46.223+0000","up_votes":1,"down_votes":0,"body":"Te juro que no se me ocurrió, muchas gracias master","replies":[]}]},{"poster":"Zubii","date":"2018-03-06T17:08:32.059+0000","up_votes":1,"down_votes":0,"body":"Baje de oro 2 a oro 4 con una racha de 11 partidas perdidas no te preocupes:v","replies":[]},{"poster":"Oblivion awaits","date":"2018-03-06T15:26:28.804+0000","up_votes":1,"down_votes":0,"body":"¿Mi consejo? Aprende a cuando descansar de las Partidas Clasificatorias. A veces cuando ya tenemos 3 o 4 partidas consecutivas que perdemos en un solo dia, continuamos y es un error que todos hemos cometido. Ya que la carga de estrés de las partidas pasadas aun están presentes, asi como el desgaste mental que hubo en ellas, por ende no vas a estar rindiendo al 100%. Muchas veces vas a estar tilteado porque jugaste una partida de 40 minutos y el subnormal de turno la vendió, otras porque tu equipo entero feedeo hasta el Señor Cangrejito del rio, etc. No tienes que preocuparte si tienes una racha de derrotas, ya que después tendrás una racha de victorias. Además tu winrate es del 50% (64w-64l) algo completamente normal. Tomate un pequeño descanso y trata de analizar tus errores. Por ejemplo, de primeras estoy viendo que no juegas con las Runas Reforjadas optimas con cada campeón. ¿Por qué jugar con Garras del inmortal con {{champion:32}} si Replica está 100 veces mejor en todos los sentidos con ese campeón? ¿Por qué jugar Sobre la Marcha con {{champion:81}} si la Cleptomania encaja a la perfección con dicho campeón? Estos errores corrigelos para luego volver a la carga con las rankeds. Ah y otro consejo, tienes una ensalada de campeones. Trata de jugar 1 o 2 lineas con 2 o 3 campeones como máximo y no jueges muchos campeones en muchas lineas, porque como bien dice el dicho: \"El que mucho abarca, poco aprieta\". Espero que te sirva y suerte :)","replies":[]},{"poster":"N 0","date":"2018-03-06T15:26:06.202+0000","up_votes":1,"down_votes":0,"body":"Te daré un consejo...\nHace 3 partidas por cada 8h, 12h o 24h. (Según tu disposición horaria para el juego)\nEntrena en la herramienta de practica o has algún otro modo de juego.\nToma una breve pausa después de cada partida.\n\n¿Porque te recomiendo esto? \n1. Porque te tilteas si haces muchas partidas seguidas.\n2. Puede que te emparejen con la misma gente con la que perdiste.\n3. Pierdes el deseo de jugar por jugar \"mal\" o fallar tus habilidades.\n4. Según tu resistencia mental, según tu rendimiento, puede que varíe para \"carrear o ser el carreado\".\n\nPor esto y mucho mas, trata de tomar la decisión correcta. {{champion:74}}","replies":[]},{"poster":"BG King Fratus","date":"2018-03-06T15:24:35.927+0000","up_votes":1,"down_votes":0,"body":"A mi me paso hace poco, baje dos divisiones por los tipicos adc que se creen Gosu. Lo mejor es tomar un descanso, no meter partidas constantemente. Tomate un descanso de 10 a 30 mins entre partida, independientemente si ganas o perdes, para que el desgaste mental no te condiciones en la proxima partida. Tambien es siempre confiar en tus habilidades y capacidades de poder revertir esta situacion. Muchas veces es apostar a tus mejores picks independientemente de la composicion de team. Me ha tocado ganar partidas donde ni frontlane ni iniciadores tenia, pero eso ya requiere mas habilidad.\n\nRelajate, recien van 3 meses de la season. Es solo reducir un poco la intensidad con las que jugas las rankeds, y es mejor jugar 3 partidas al dia y salir 3 - 0 o 2 - 1, a salir 2 - 8 en el global.","replies":[]},{"poster":"WhiteMax","date":"2018-03-06T15:14:13.753+0000","up_votes":1,"down_votes":2,"body":"Juega con premade (?).","replies":[]}]}