{"poster":"HyperTrek Spock","date":"2015-05-11T20:04:56.489+0000","title":"Vayne q o w??","subforum":"Campioni e gameplay","up_votes":1,"down_votes":1,"body":"Ecco la domanda? In base a cosa decido se portare avanti per prima la q o la w? Io seguo molto gosu e vedo che spesso lui porta avanti la w prima della q, in base a cosa compie questa decisione? grazie","replies":[{"poster":"Dantazzo","date":"2015-05-12T11:32:00.625+0000","up_votes":2,"down_votes":0,"body":"Io preferisco in botlane maxare la Q secondo me offre più vantaggi in botlane, in top dipende dall'avversario, se è un tankone con pochi gap closer tipo nasus, singed e simili preferisco maxare la W, se invece ha tanti gap closer preferisco maxare la Q.","replies":[]},{"poster":"PePPeiLMaS","date":"2015-05-13T07:57:00.852+0000","up_votes":1,"down_votes":0,"body":"Q se è una lane difficile, w se pensi di poter sopravvivere tranquillamente. Non devi per forza maxare un'abilità al massimo, puoi anche decidere di portare al 3 la w e poi al 5 la q, non ti dice niente nessuno. Bisogna sentirsele certe cose.","replies":[]},{"poster":"kirchhoff","date":"2015-05-12T23:34:34.857+0000","up_votes":1,"down_votes":0,"body":"Q tutta la vita.","replies":[]},{"poster":"DdLulo004","date":"2015-05-12T15:37:52.995+0000","up_votes":1,"down_votes":0,"body":"Q se gli avversari hanno poca mobiliti\nW se possono farti molti stun","replies":[]},{"poster":"masumune","date":"2015-05-12T13:19:03.071+0000","up_votes":1,"down_votes":0,"body":"In questo metà di tank si maxa spessissimo la w. Comunque la logica e' semplice in bot\n Supp nemico tank preferisco la w , supp nemico da utility con tante Spell meglio la q","replies":[]},{"poster":"Br0ken Sword","date":"2015-05-12T12:29:04.011+0000","up_votes":1,"down_votes":0,"body":"Si maxa sempre la Q, il motivo è semplice, quando sei in ulti ti permette ti diventare invisibile più volte, inoltre schivare una spell ogni 2 secondi non è malaccio, e fai più danni maxando la Q che la W visto che la Q fa danni bonus sull'attacco base mentre la W necessita di 3 attacchi consecutivi per fare il danno, cosa che non sempre riesci a fare, specialmente in early, a meno che il tuo avversario non sia idiota, ma si maxa la Q sempre.","replies":[]},{"poster":"Il Freddo","date":"2015-05-12T11:02:06.596+0000","up_votes":1,"down_votes":0,"body":"La w fa fare più danni ogni 3 attacchi sullo stesso bersaglio","replies":[]},{"poster":"One Tax Man","date":"2015-05-11T20:57:23.358+0000","up_votes":1,"down_votes":0,"body":"Allora la q è la tua spell da riposizionamento/engage/disengage ed è prettamente legata alla mobility.\nLa w è ciò che rende Vayne la macchina distruttrice che è : fa un sacco di danni , ma davvero molti considerato che si attiva spesso se buildi attack speed ( cosa che su vayne sei obbligato a fare proprio per abusare di questa spell ) . Io starto di q ma maxo la w per i danni impressionanti che fà , ma se vuoi spammare la capriola perché ti piace muoverti molto anche maxare la q è fattibile , anche se i danni che predi inizialmente si sentono.\nAlla fine è abbastanza soggettiva la cosa , dipende cosa cerchi : vuoi più mobilità e capacità di evitare gli skillshot nemici o preferisci massacrare brutalmente i nemici prima che ti colpiscano?\nA te la scelta 😊","replies":[]},{"poster":"Axelney","date":"2015-05-13T01:58:38.261+0000","up_votes":1,"down_votes":1,"body":"Boh, è stupido secondo me maxare q su vayne. Sei un ad carry, la maggior parte del tuo danno viene dagli autoattacchi non da una q che ti fa infliggere danni extra solo al prossimo autoattacco. \nMaxa la w e fai danni extra soprattutto perchè quando avrai completato {{item:3006}} {{item:3153}} farai tantissimi danni con la tua w, mentre la tua q sarà abbastanza inutile. Io faccio così ed il motivo è semplice: Sei un ad carry, devi autoattaccare e stop. \nUsa la q come utility per posizionarti per un combattimento.","replies":[]},{"poster":"Asnuf","date":"2015-05-11T20:42:23.052+0000","up_votes":1,"down_votes":1,"body":"La W fa danni puri, e in % alla salute massima dell'avversario. Quindi taaaaanti danni. E se fai la combinazione in corsia AA+Q+E riesci a far molti danni e molto fastidio al tuo avversario.","replies":[]}]}