{"poster":"Yamató","date":"2017-01-29T20:34:51.954+0000","title":"Pentakill geben oder nicht ?","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":2,"body":"Hey HO \r\n\r\nFolgende Situation:\r\n\r\nIn einem meiner NORAML games hab ich Vayne gespielt, ich war verdammt fed und alle 3 Inhibs der Gegner waren down.\r\nBeim wohl letzten Teamfight des Spiels, schaffe ich es 4 Leute zu t&ouml;ten. \r\nLee Sin welcher gerade erst gespawned ist war so freundlich mir den Penta zu schenken. Das Gegnerteam and das nicht so toll\r\nund rief dazu auf Lee zu report.\r\n\r\nWas sagt ihr dazu, ist ein report gerechtfertigt? Das spiel war einerseits eh schon gegessen, aber es ist streng genommen immer noch intentionally feeding.....","replies":[{"poster":"TerrorRaven","date":"2017-01-29T20:40:46.874+0000","up_votes":7,"down_votes":2,"body":"Ja. Den Gegner freiwillig einen Kill geben zählt als \"Vorsätzliches Feeden\" bzw. \"Unterstützung des Gegnerteams\". Ob das zur einer Strafe führt ist ein anderes Thema.","replies":[]},{"poster":"Alekra","date":"2017-01-29T20:41:44.085+0000","up_votes":2,"down_votes":0,"body":"Ist nicht gerechtfertigt. Außer er hätte es verteidigen können.","replies":[{"poster":"clair de lune289","date":"2017-01-29T20:53:14.415+0000","up_votes":3,"down_votes":0,"body":"es klingt für mich nach einem letzten fight 4vs5 (für den gegner) unter dem Nexustower bei dem grade Superminons (evt sogar mit Baron) pushen. In dem Fälle hätte er auch lebend nichts machen können. Das ist allerdings auch er einzige Fall im dem ich absolut nichts sagen/machen würde, wenn der Lee den letzten Kill zum Penta ohne wirkliche Gegenwehr gibt.\nIn jedem anderen Fall in dem noch die geringste Chance besteht zu gewinnen würde ich es aber reporten solang es offensichtlich war (z.B. greift er nicht an).","replies":[]}]},{"poster":"HyperionCH","date":"2017-02-03T10:32:30.741+0000","up_votes":2,"down_votes":0,"body":"Grundsätzlich ist es strafbar, da es absichtliches Feeden ist.\nIm Fussball lässt man selbst in Freunschaftsspielen ja auch nicht das Tor absichtlich offen, damit der gegnerische Stürmer nach 2 Toren einen lupenreinen Hattrick schiessen kann. ;)\n\nDer Leaverbuster bestraft jedoch nicht, wenn es sehr selten passiert und dies ist wohl der Fall.\nWie oft passiert dies denn, dass ein Gegner einen Quadra macht, der letzte Spieler noch lebt, genug Zeit vorhanden ist (bevor jemand anderes respawnt) und der letzte Spieler wieder der selbe ist? Dies sind zu viele Kriterien und passiert wojl weniger als alle 100 Games.","replies":[]},{"poster":"One Eyed Øwl","date":"2017-02-03T08:35:12.715+0000","up_votes":2,"down_votes":0,"body":"Selbst wenn er dafür reportet wurde, so führt ein \"Int-Tod\" nicht zu nem Bann.\n\nIch würde trotzdem nie nen penta schenken, fühlt sich doch wesentlich besser an wenn man ihn selbst verdient...^^","replies":[]},{"poster":"XenesisCH","date":"2017-01-30T10:10:13.828+0000","up_votes":2,"down_votes":0,"body":"Wenn du ihn ohne Gegenwehr töten konntest, dann wäre es formell gesehen Inting. Rein aus der Situation betrachtet, wo das Spiel zu 100 % entschieden war, kann man das eher als Anerkennung deiner Leistung (Seitens des Lees) betrachten und ich glaube kaum, dass der Feederbuster je so etwas bestrafen wird.","replies":[{"poster":"WC9 Umbra","date":"2017-01-30T14:13:05.505+0000","up_votes":1,"down_votes":0,"body":"ICh glauve da kann man sogar den Lee reporten. so weit ich weiß ist es reportable Spieler onhe guten Grund zu reporten.","replies":[]}]},{"poster":"ü ö","date":"2017-01-30T05:57:51.668+0000","up_votes":2,"down_votes":1,"body":"Nein ist es nicht, um dafür bestraft zu werden müsste er schon inten und nicht 1x absichtlich sterben, darüber hinaus war das Game offenbar eh schon durch und Penta geben ist halt \"Höflichkeit\".","replies":[{"poster":"MacDeath","date":"2017-01-30T09:51:16.168+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lee Keane,realm=EUW,application-id=KYnfKGf0,discussion-id=zh6QMl5B,comment-id=0002,timestamp=2017-01-30T05:57:51.668+0000)\n>\n> Nein ist es nicht, um dafür bestraft zu werden müsste er schon inten und nicht 1x absichtlich sterben, darüber hinaus war das Game offenbar eh schon durch und Penta geben ist halt &quot;Höflichkeit&quot;.\n\nNe also Höflichkeit ist das nicht. Es gibt kein Etikett jemanden einen Penta schenken zu müssen soweit ich das weiß. Dann eher Großmütigkeit oder Freundlichkeit.","replies":[]}]},{"poster":"Lynuin","date":"2017-02-07T00:03:35.843+0000","up_votes":1,"down_votes":0,"body":"Ich für meinen Teil sehe das Problem nicht so wie sich das anhört war das Spiel bereits entschieden und der Tod vom Lee Sin war nur Kosmetik für das gewinnende Team und nicht relevant  - dementsprechend sollte das keinen wirklich kümmern.","replies":[]}]}