{"poster":"lernenlernen","date":"2017-05-20T20:10:10.532+0000","title":"Rankvergabe hat nichts mit Talent oder Skill zu tun","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":10,"body":"Hallo allerseits,\r\n\r\nich w&uuml;rde gern mal eure allgemeinen Gedanken zu diesem Thema h&ouml;ren.\r\n\r\nIch spiele seit kurzem LoL (Dies ist meine erste Saison).\r\nSpieltechnisch habe ich mich in die Klasse des Supporters eingefunden und f&uuml;hle mich auch wohl.\r\n\r\nNun komme ich aber mal zu den starken defiziten, die mir wirklich die Laune am Spiel nehmen.\r\nIm Solo queue kann ich als Supporter das Spiel logischerweise nicht entscheiden.\r\n\r\nIch bekomme zu 90\r\n% meiner spiele nen A oder ein S am ende, spiele aber trotzdem nur Silber 5, da ich dauern Leaver, AFKler oder Feeder im Team habe.\r\nDer Rang sagt somit nichts &uuml;ber das eigentliche Spielverhalten aus.\r\n\r\nWieso kann dieses System nicht mal ge&auml;ndert werden?\r\n\r\nFall A:\r\nIn jedem Spiel reisst man sich aufs neue den Ar... auf, nicht zu feeden.\r\nMan spielt vorsichtig und versucht seinem ADC nen sch&ouml;nen kill vorzubereiten.\r\nFazit am Ende z.B.\r\nDer Support steht 4/3/22 bekommt ein A oder S verliert jedoch mal wieder um die 20 Punkte.\r\n\r\nFall B:\r\nOch ich hab heut mal lust auf Jungler.\r\nDas Spiel startet und ich fail gleich ein paar mal.\r\nDer Spielverlauf gestaltet sich zwischen den Teams dennoch ausgeglichen, da man im Team einen\r\nstarken Zed auf der Midlane hat.\r\nFazit zum Spielende: \r\nWir haben das Spiel gewonnen, ich stehe z.B. als jungler 3/9/4\r\ngewinne aber 18 Punkte f&uuml;r dieses &quot;gute&quot; Spiel.","replies":[{"poster":"Alustus","date":"2017-05-21T01:34:04.813+0000","up_votes":3,"down_votes":0,"body":"> Ich bekomme zu 90\n> % meiner spiele nen A oder ein S am ende, spiele aber trotzdem nur Silber 5, da ich dauern Leaver, AFKler oder Feeder im Team habe.\n> Der Rang sagt somit nichts über das eigentliche Spielverhalten aus.\n> \n> Wieso kann dieses System nicht mal geändert werden?\n> \n\nÜber Spielverhalten nur bedingt.\nWie du dich ingame verhältst kann man aus dem System nicht auslesen, man kann nur auslesen wie du durchnittlich performst.\nEs gibt in Silber sicher Spieler welche in Gold oder höher wären wenn sie nie AFK gehen würden oder eine anständige Internetverbindung hätten.\nEs gibt Spieler in Silber die sicher Gold oder höher wären wenn sie nicht flamen würden.\nEs gibt Spieler in Silber die sicher Gold oder höher wären wenn sie nicht neue Champs/Rollen das erste mal  im Rank auspacken.\nEs gibt Spieler in Silber die sicher Gold oder höher wären wenn sie mit einer anderen Motivation rangehen würden.\nEs gibt Spieler in Silber die sicher Gold oder höher wären wenn sie konstant spielen würden und nicht ein Spiel wie Bronze und das andere wie Gold Spieln.\n\nDie Gründe warum man in einer Elo festhängt sind vielseitig und bei jedem wahrscheinlich etwas anders.\nim durchschnitt ist in jeder Elo jeder Spieler ziemlich gleich stark (wenn nicht steigen diejenigen auf/ab)\nKlar wird das ganze durch afk/feeder/trolle/flamer etwas durcheinander gebracht aber nach einer Gewissen anzahl an Spielen haben diese keinen Spürbaren einfluss mehr auf dein Rank.\nIm endeffekt steigt man auf wenn man besser ist, sofern man auch genügend spielt.\n\n\nNaja Talent/Skill wird jetzt sicher nicht in einem Spiel, wie in deinem Beispiel richtig bewertet bzw. gezeigt sondern an der Summe aller Spiele (je mehr desto genauer wird man eingeteilt)\n\nAuch sagt die K/D/A nicht zwangsläufig etwas aus.\nAuch gibt es beim Spielverständniss viele dinge die man auf allen Rollen/Champions anwenden kann wodurch man ein gewisses Grundniveau an \"können\" hat, auch wenn man Champs/Rollen wechselt.\nAuch Mapawarness/Reaktionszeit/klickgenauigkeit/klickgeschwindigkeit.","replies":[]},{"poster":"Namlesshero","date":"2017-05-20T20:22:23.132+0000","up_votes":2,"down_votes":0,"body":"[Read me](https://de.wikipedia.org/wiki/Dunning-Kruger-Effekt)","replies":[]},{"poster":"Kleriker85HH","date":"2017-05-20T20:19:16.493+0000","up_votes":2,"down_votes":1,"body":"350 Spiele und Silber 5 ich denke du bist genau da wo du hingehörst Skillmäßig. Du stirbst zu viel und deine KDA`s sind auch nicht berauschend.","replies":[{"poster":"lernenlernen","date":"2017-05-20T20:46:22.088+0000","up_votes":1,"down_votes":0,"body":"Ja wie auch oben beschrieben steht da das ich relativ neu bin. Somit muss ich auch genug Helden testen und die KDA ist demnach auch dann nicht immer gut.\nSchaust du dir aber mal die letzten Wochen an, dann sieht das ganze von den Werten komplett anders aus.","replies":[{"poster":"XenesisCH","date":"2017-05-21T06:55:46.262+0000","up_votes":1,"down_votes":0,"body":"> Ja wie auch oben beschrieben steht da das ich relativ neu bin. \n\nIch kann dir nur empfehlen den [Rankedguide](https://boards.euw.leagueoflegends.com/de/c/level-up-guides-tipps-de/c0e2BmdT-der-ranked-guide-far-dummies-i-am-a-champion. ) zu lesen. Mir hat das vermittelte Wissen damals gut geholfen, um mich im Ranked zurechtzufinden und Wege zu finden um aufzusteigen ;-).","replies":[]}]}]},{"poster":"TheGratefulDead","date":"2017-06-02T12:52:40.655+0000","up_votes":1,"down_votes":0,"body":"https://steamuserimages-a.akamaihd.net/ugc/270595996991879023/576E6364D09F92E98A2CDA8D7138FCF8429928BA/","replies":[]},{"poster":"YasuOhSoOP Kappa","date":"2017-05-22T11:25:21.817+0000","up_votes":1,"down_votes":0,"body":"Du bist verdient in Silver. Du hast fast jedes game 5-10 Tode, vielleicht bist du sogar der Grund warum DEIN Team verliert, guck erst auf dich bevor du auf andere schaust, und so kommst du auch higher Elo. Immer sich selbst erst unter die Lupe nehmen ;) gl.","replies":[]},{"poster":"Released Ape","date":"2017-05-21T01:09:45.501+0000","up_votes":1,"down_votes":0,"body":"Ich fasse jetzt ein paar Zitate von dir zusammen:\n\n1. Du bist \"neu\" in League of Legends\n2. Du hast Lust \"neue Champions\" zu testen und deswegen sind deine KDAs nicht immer gut\n3. Du denkst das einzelne Spiele eine Aussagekraft haben über das System\n4. Behauptest das die Supportrolle nichts/fast nichts zum Sieg beitragen kann\n\nDann kommt hinzu das du über 300 Spiele in der Elo gespielt hast, ich bin mir daher relativ sicher das Silber V deine Spielleistung gut wiederspiegelt. Das System ist ein Langzeit-System, je mehr man spielt desto genauer wird die Einstufung.","replies":[]},{"poster":"eimoH","date":"2017-05-20T21:05:23.930+0000","up_votes":1,"down_votes":0,"body":"-Halte Champions in deinem Pick Pool mit denen du erfolgreich bist wie Sona und Amumu\n-Versuche dich in deinen konstanten Picks wie z.B. Nautilus zu verbessern.(Probiere verschiedene Runen-Setups aus mit denen andere Erfolgreich waren, schaue andere Leuten zu die ihn picken und was ihre Kernpunkte im Playstyle sind).\n-Lasse solche Picks sein mit denen du wenig bis keine Übung hast oder keine Ahnung hast wie man sie richtig spielt bzw Picks mit denen du auch nach an die 30 Games noch eine Winrate von unter 40% hast (Leona).\n-Schaue was für generelle Fehler du in deinem Spielstil machst die sich einfach oder mit etwas Bemühungen entfernen lassen(Schlechtes Positioning, Unaufmerksamkeit, Laufen in Areas ohne Vision und ohne jegliche Infromationen wo sich der Gegner befindet usw.).","replies":[]},{"poster":"Nycaria","date":"2017-05-20T20:16:19.784+0000","up_votes":1,"down_votes":0,"body":"> Im Solo queue kann ich als Supporter das Spiel logischerweise nicht entscheiden.\n\nDas ist Unsinn. Man kann als Supporter genauso gut Games entscheiden, wie auf einer anderen Lane (meiner Meinung nach sogar noch einfacher). Man carriet eben nur nicht durch Damage, sondern anders :)\n\nStats sind nicht alles. Durch eine gute KDA gewinnt man Games nicht, durch Objectives gewinnt man Games.","replies":[{"poster":"lernenlernen","date":"2017-05-20T20:48:15.516+0000","up_votes":1,"down_votes":0,"body":"Grundlegend geb ich Dir recht.\nAber wie wollst Objectives holen wenn dein Team sich um nichts kümmert und lieber rumganked etc.\n\nWie oft Pinge ich den Dragon an weil er frei ist, die Gegner nicht in der nähe sind etc..... nur es rührt sich keiner.\nOhne Leute kann man als Support da nicht unbedingt ran.","replies":[{"poster":"Nycaria","date":"2017-05-20T20:54:53.697+0000","up_votes":1,"down_votes":0,"body":"Indem du deinem Team beweist,dass deine Calls gut sind. Du wirst bis in wirklich hohe Elos immer das Problem haben, dass Leute denken ihre Gedankengänge was als Nächstes gut wäre seien besser. Manchmal stimmt es, manchmal eben nicht.  \nFinde deine individuelle Art als Support zu carrien und das climben ist wirklich einfach.","replies":[]}]}]},{"poster":"thefire7","date":"2017-05-20T21:38:11.742+0000","up_votes":1,"down_votes":6,"body":"Ich bin platin und hab mit bronze 4 angefangen.\n\nBtw. Wenn es dir nur ums besser werden geht, spiel kein supp","replies":[]}]}