{"poster":"zPiePvPx01","date":"2018-05-14T21:43:02.285+0000","title":"SONO STANCO! BASTA! (SFOGO)","subforum":"Discussioni generali","up_votes":4,"down_votes":6,"body":"Ciao, allora. Ditemi tutto quello che volete, sono scarso, faccio schifo, non so giocare, flammatemi quanto vi pare. \r\nMA NON &egrave; MINIMAMENTE POSSIBILE CHE IN OGNI FOTTUTO GAME LA MIA SQUADRA FORMATA DA ALTRI 4 GIOCATORI DEBBA SEMPRE FARE 1/9 0/11 0/8 E 2/9. Poi ci sono, che ho 4/0 e poi finisco ovviamente in 4/4. Adesso ripeto, ditemi tutto quello che vi pare ma questa storia non &egrave; possibile. Stavo per arrivare gold 5 per la prima volta in tutta la mia vita di LoL e in una settimana ritorno S5. Adesso voglio scritto/spiegato da qualcuno di voi se &egrave; normale. Essere gli unici a giocare &#039;&#039;Decentemente&#039;&#039; in un team da 5. Vorrei caricarvi l&#039;immagine che ho fatto agli score, ma non so come si mette e non sto qui a perderci tempo. Scusate ma dovevo sfogare. Me sto a sent&igrave; male per un gioco dove ci sono persone che giocano con i piedi. Buona serata.","replies":[{"poster":"zPiePvPx01","date":"2018-05-14T21:46:06.670+0000","up_votes":2,"down_votes":2,"body":"***","replies":[{"poster":"Aurelion Shmoll","date":"2018-05-14T22:21:51.068+0000","up_votes":4,"down_votes":1,"body":"Dona il tuo corpo alla ricerca, ti prego.\n\n{{sticker:sg-soraka}}","replies":[]},{"poster":"FireM1nd","date":"2018-05-14T22:11:34.641+0000","up_votes":1,"down_votes":0,"body":"... è un collegamento dal tuo desktop. -.-\"","replies":[{"poster":"zPiePvPx01","date":"2018-05-16T20:27:42.188+0000","up_votes":1,"down_votes":0,"body":"Come posso farti vedere lo screen che ho fatto ?","replies":[]}]}]},{"poster":"Dangerous Vayne","date":"2018-05-14T21:50:45.379+0000","up_votes":4,"down_votes":1,"body":"Silver non ce la faccio più\n\n[{quoted}](name=Maso93,realm=EUW,application-id=98NGV4Al,discussion-id=79KcKE5y,comment-id=,timestamp=2018-05-14T15:11:42.069+0000)\n\nanche lui ha aperto lo stesso post, e li ho risposto, che le vincite sono dettate dal matchMaking pilotato dalla Riot.\nHo fatto una ricerca con tanto di statistiche e ho le Prove su 900 campioni/persone che i giochi sono fatti dalla Riot.","replies":[{"poster":"Náos","date":"2018-05-14T22:02:53.991+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Zombi92,realm=EUW,application-id=MJVj50Jw,discussion-id=wEZoiTJL,comment-id=0001,timestamp=2018-05-14T21:50:45.379+0000)\n>\n> Silver non ce la faccio più\n> \n> [{quoted}](name=Maso93,realm=EUW,application-id=98NGV4Al,discussion-id=79KcKE5y,comment-id=,timestamp=2018-05-14T15:11:42.069+0000)\n> \n> anche lui ha aperto lo stesso post, e li ho risposto, che le vincite sono dettate dal matchMaking pilotato dalla Riot.\n> Ho fatto una ricerca con tanto di statistiche e ho le Prove su 900 campioni/persone che i giochi sono fatti dalla Riot.\n\n\nVai, appena hai tempo mi posti i dati di questi 900 utenti\nUno per uno ovviamente, altrimenti sei un parolaio","replies":[{"poster":"Dangerous Vayne","date":"2018-05-14T22:10:03.144+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Náos,realm=EUW,application-id=MJVj50Jw,discussion-id=wEZoiTJL,comment-id=00010001,timestamp=2018-05-14T22:02:53.991+0000)\n>\n> Vai, appena hai tempo mi posti i dati di questi 900 utenti\n> Uno per uno ovviamente, altrimenti sei un parolaio\n\nSi ho tutti i dati in formato .ods(estensione di OpenOffice la suite scaricabile gratuitamente)\nQuando postero` i dati alleghero` anche il documento.\nHo anche i 100 screenshots delle partite giocate. Quelle le posto solo in caso di necessita e dovro` anche scancellare i nomi dei players che non si possono postare qui.\nMa Si`, ho statistiche fatte, su ben 900 persone, ci ho messo 3-4 ore a fare il tutto.","replies":[{"poster":"Náos","date":"2018-05-14T23:19:31.898+0000","up_votes":1,"down_votes":1,"body":"E che statistiche avresti fatto in 3-4 ore su 900 persone?\nMi sa che qui il problema non è il matchmaking della riot","replies":[{"poster":"Dangerous Vayne","date":"2018-05-15T02:52:39.811+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Náos,realm=EUW,application-id=MJVj50Jw,discussion-id=wEZoiTJL,comment-id=0001000100000000,timestamp=2018-05-14T23:19:31.898+0000)\n>\n> E che statistiche avresti fatto in 3-4 ore su 900 persone?\n> Mi sa che qui il problema non è il matchmaking della riot\n\nChe ti aspettavi di fare tutti i calcoli a mano?\nOvvio che ho messo i dati dentro il foglio di calcolo come una specie di dataBase e poi con le formule ho calcolato le statistiche.","replies":[{"poster":"Náos","date":"2018-05-15T17:13:09.269+0000","up_votes":1,"down_votes":1,"body":"finchè non pubblichi questi dati stiamo parlando di aria fritta","replies":[]}]}]}]}]},{"poster":"Pellah","date":"2018-05-15T01:53:29.856+0000","up_votes":3,"down_votes":2,"body":"Aspettiamo con ansia il tuo Thread con tesi e prove sul matchmaking pilotato dalla Riot.","replies":[{"poster":"Linkimaru","date":"2018-05-15T06:42:22.072+0000","up_votes":2,"down_votes":2,"body":"Ahahahaha non vedo l’ora","replies":[]}]},{"poster":"mangialavandini","date":"2018-05-15T06:56:20.434+0000","up_votes":1,"down_votes":0,"body":"mhhh\n\norpheus: Immagino che in questo momento ti sentirai un po' come Alice che ruzzola nella tana del Bianconiglio.\n\nNeo: L'esempio calza.\n\nMorpheus: Lo leggo nei tuoi occhi: hai lo sguardo di un uomo che accetta quello che vede solo perché aspetta di risvegliarsi. E curiosamente non sei lontano dalla verità. Tu credi nel destino, Neo?\n\nNeo: No.\n\nMorpheus: Perché no?\n\nNeo: Perché non piace l'idea di non poter gestire la mia vita.\n\nMorpheus: Capisco perfettamente ciò che intendi. Adesso ti dico perché sei qui. Sei qui perché intuisci qualcosa che non riesci a spiegarti. Senti solo che c'è. È tutta la vita che hai la sensazione che ci sia qualcosa che non quadra nel mondo. Non sai bene di che si tratta, ma l'avverti. È un chiodo fisso nel cervello, da diventarci matto. È questa sensazione che ti ha portato da me. Tu sai di cosa sto parlando...\n\nNeo: Di Matrix.\n\nMorpheus: Ti interessa sapere di che si tratta, che cos'è? Matrix è ovunque, è intorno a noi, anche adesso nella stanza in cui siamo. È quello che vedi quando ti affacci alla finestra o quando accendi il televisore. L'avverti quando vai al lavoro, quando vai in chiesa, quando paghi le tasse. È il mondo che ti è stato messo dinanzi agli occhi, per nasconderti la verità.\n\nNeo: Quale verità?\n\nMorpheus: Che tu sei uno schiavo. Come tutti gli altri sei nato in catene, sei nato in una prigione che non ha sbarre, che non ha mura, che non ha odore, una prigione per la tua mente. Nessuno di noi è in grado purtroppo di descrivere Matrix agli altri. Dovrai scoprire con i tuoi occhi che cos'è. È la tua ultima occasione: se rinunci, non ne avrai altre. Pillola azzurra: fine della storia. Domani ti sveglierai in camera tua e crederai a quello che vorrai. Pillola rossa: resti nel paese delle meraviglie e vedrai quanto è profonda la tana del Bianconiglio. Ti sto offrendo solo la verità, ricordalo. Niente di più.\n\nRIOT GAMES è MATRIX","replies":[]},{"poster":"zPiePvPx01","date":"2018-05-14T21:52:15.614+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zombi92,realm=EUW,application-id=MJVj50Jw,discussion-id=wEZoiTJL,comment-id=0001,timestamp=2018-05-14T21:50:45.379+0000)\n>\n> Silver non ce la faccio più\n> \n> [{quoted}](name=Maso93,realm=EUW,application-id=98NGV4Al,discussion-id=79KcKE5y,comment-id=,timestamp=2018-05-14T15:11:42.069+0000)\n\nA chi lo dici Frà...","replies":[]}]},{"poster":"Linkimaru","date":"2018-05-14T22:09:06.672+0000","up_votes":1,"down_votes":1,"body":"Ma trollate vero? Vincite pilotate dalla riot??? Ho avuto oltre 10 account negli ultimi tre anni  (perché in passato venivo bannato spesso) e sono sempre arrivato a diamond partendo da unranked, ormai ci metto una cinquantina di Game al massimo per arrivarci. Il silver l’ho visto solo il mio primo anno di gioco (season 3) dove ho chiuso la mia prima stagione competitiva in gold 5.\nLa riot mi vuole bene si vede.","replies":[{"poster":"Dangerous Vayne","date":"2018-05-14T22:49:42.921+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Final Linkimaru,realm=EUW,application-id=MJVj50Jw,discussion-id=wEZoiTJL,comment-id=0002,timestamp=2018-05-14T22:09:06.672+0000)\n>\n> Ma trollate vero? Vincite pilotate dalla riot??? Ho avuto oltre 10 account negli ultimi tre anni  (perché in passato venivo bannato spesso) e sono sempre arrivato a diamond partendo da unranked, ormai ci metto una cinquantina di Game al massimo per arrivarci. Il silver l’ho visto solo il mio primo anno di gioco (season 3) dove ho chiuso la mia prima stagione competitiva in gold 5.\n> La riot mi vuole bene si vede.\n\nHo specificato che loro alterano i giochi inizio-mid season, dopodiche ti matchano bene.\nQuesta cosa e` utile a loro per portare i bronzi in silver, usando i silver, poi dalla mid season verso la fine li matchano bene e se giocano come si deve arrivano a silver alto/gold, non so se e` cosi anche per le leghe successive.\nCredo che fanno questo giochino ad elo basso tipo bronzo, silver, gold. perche` sono i primi a gettare la spugna.(Me compreso)\nIo sono un antiFlammer per eccellenza, cio` non toglie che anche io mi possa innvervosire e tiltare moooolto ma veramente moooolto, sopratutto trattenendo e non dicendo niente perche` e` giusto che sia cosi`.\n\nSe io arrivo, a quello che io considero un buon WinRate con un certo champ, se arrivo a giocare delle partite dove sembra che sono il challenger dei challenger e poi mi vedo messo in delle partite dove non mi ci ritrovo e si vede lontano un miglio l`ingiustizia allora certo che me la prendo.\nMa ripeto tutto quanto e` documentato, un giorno postero` tutte le statistiche che parlano chiaro, non c`e` nemmeno bisogno di spiegarle perche` si vede ad occhio nudo cosa sta succedendo.","replies":[]}]},{"poster":"Aristotelicus","date":"2018-05-14T23:16:22.516+0000","up_votes":1,"down_votes":0,"body":"Secondo me, basterebbe che la gente non trollasse le ranked. L'anno scorso ho finito le placement poco prima della fine season e mi sono piazzato bronzo 3; ho fatto 6 partite circa e sono salito bronzo 2. Non mi ricordo di aver trovato trollate, perchè ovviamente a fine stagione tutti sono molto più motivati a salire.\nQuest'anno è la prima volta che faccio ranked a metà stagione e dopo le placement mi ritrovo bronzo 3, come l'anno scorso. Per ogni partita seria, ce n'è una dopo in cui uno trolla. Così è molto più difficile salire.\nSperiamo che, come hanno annunciato, l'aggiunta di una nuova lega dopo il bronzo, scremi un po' la gente che gioca le ranked peggio delle normal.","replies":[]},{"poster":"Aurelion Shmoll","date":"2018-05-14T22:11:14.930+0000","up_votes":1,"down_votes":0,"body":"haha ^^","replies":[]},{"poster":"Garbaman","date":"2018-05-15T05:47:02.492+0000","up_votes":1,"down_votes":1,"body":"In questo gioco hanno messo di nascosto un algoritmo dove quello che ha score/MMR alto debba giocare con i mongoloidi. Comunque esiste sempre il flame","replies":[]}]}