{"poster":"Bredy1","date":"2017-09-14T17:10:28.324+0000","title":"problemi con il monitor","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"salve, ho un problema. mentre facevo una partita ho combinato un casino. nelle impostazioni si ha la possibilit&agrave; di scegliere la lunghezza e l&#039;altezza della finestra di gioco, es. 1200x600 o 1000x720, e nel cambiare la finestra il monitor &egrave; diventato oscuro e mi dice che non regge l&#039;impostazione modificata. ora, io sarei tentato di rimettere la finestra come prima, per&ograve; non riesco perch&eacute; ho lo schermo nero e non mi fa vedere niente, cosa posso fare?\nho controllato nella home del client, per&ograve; non trovo l&#039;impostazione per modificare la finestra di gioco.","replies":[{"poster":"Chroniicles","date":"2017-09-14T17:56:14.174+0000","up_votes":2,"down_votes":0,"body":"Potete tranquillamente modificare il file di configurazione game.cfg! Unica cosa, devi farlo mentre sei loggato nel client, o ti si ripristina al file precedente in automatico ;)","replies":[{"poster":"Sexy Win","date":"2017-09-14T18:02:34.721+0000","up_votes":1,"down_votes":0,"body":"Giustamente le impostazioni sono nel lato server, se non sei loggato come fa a passargliele ? ahaha Grazie per l'integrazione :)","replies":[]}]},{"poster":"Sexy Win","date":"2017-09-14T17:16:41.606+0000","up_votes":1,"down_votes":0,"body":"l'unico modo che mi viene in mente è \"hard resettarlo\" cancellando le impostazioni del client nella cartella , teoricamente non sarebbe permesso accedere ai file interni però se vuoi ti dico il path e provi\n\n\nEdit : p.s. te lo passo subito , poi puoi cancellarlo per resettarle a predefinito o modificarlo manualmente.\n\"C:\\Riot Games\\League of Legends\\Config\\game.cfg\" aprilo con un qualsiasi editor di testo e modifica i campi Height\nWidth con le tue specifiche(inserendo =xxxx, dove xxxx è la risoluzione che vuoi avere). Spero di esserti stato utile :)","replies":[{"poster":"Bredy1","date":"2017-09-14T17:23:17.385+0000","up_votes":1,"down_votes":0,"body":"si grazie, te ne sarei grato! però intuisco qualcosa di rischioso, ci sono conseguenze alquanto gravi nel farlo?","replies":[{"poster":"Sexy Win","date":"2017-09-14T17:24:56.867+0000","up_votes":1,"down_votes":0,"body":"Ovviamente modificare i file del client è considerato il limbo dalla riot, però non è punibile. Io ti consiglio di farlo , facile , veloce e intuitivo. \nP.s. ho modifcato il post di prima con le informazioni. Qualsiasi cosa ricontattami o qui o in game. :)","replies":[{"poster":"oO0oMo0Oo","date":"2017-09-14T17:32:40.313+0000","up_votes":1,"down_votes":0,"body":"io\nti consiglio di scaricare questo\nGeForce Experience\nti registri metti leagueoflegends migliori le prestazioni e in fine si resetta tutto... se ti ritorna qualche problema ritorna su GeForce Experience e resetti dinuovo tutto.","replies":[{"poster":"Sexy Win","date":"2017-09-14T17:36:23.054+0000","up_votes":1,"down_votes":0,"body":"Scaricare un programma per inserire 8 numeri mi sembra esagerato però ognuno ha le sue preferenze :)","replies":[{"poster":"oO0oMo0Oo","date":"2017-09-14T18:44:45.381+0000","up_votes":1,"down_votes":0,"body":"per i nabbi come me è molto utile!","replies":[]}]}]}]}]}]}]}