{"poster":"Çhμa","date":"2016-09-07T20:56:51.491+0000","title":"Caricamento lento partita","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"Salve a tutti, &egrave; da un po&#039; di giorni che la prima partita del giorno quando finisce la Champion select impiega quasi 5 minuti ad aprirsi la schermata che rimane nera ed alrettanti per far vedere i campioni alleati ed avversari nella schermata di caricamento... Quando poi entr&ograve; in partita il game &egrave; gi&agrave; cominciato da un paio di minuti. Quale pu&ograve; essere la causa?","replies":[{"poster":"Çhμa","date":"2016-09-11T00:40:29.105+0000","up_votes":1,"down_votes":0,"body":"Okay grazie per le risposte fulminee\nChua","replies":[]},{"poster":"Floppyz","date":"2016-09-08T14:05:54.555+0000","up_votes":1,"down_votes":0,"body":"Peraltro il caricamento della partita dipende praticamente per intero dalla velocità a cui l'hard disk riesce a leggere i dati di LOL, quindi se hai un SSD sposta LOL li sopra e vedrai che i caricamenti diventeranno istantanei, se invece non lo hai potrebbe essere utile eseguire una deframmentazione dei dati e/o svuotarlo un po' se hai meno del 30% libero.","replies":[]},{"poster":"Chroniicles","date":"2016-09-07T21:11:15.332+0000","up_votes":1,"down_votes":0,"body":"Ciao, prova ad avviare il client come amministratore e ad effettuare un repair. \nTi consiglio anche di controllare che firewall e antivirus non stiano interferendo col gioco (crea delle eccezioni)!\nProva anche a dare una \"ripulita\" al pc con CCleaner e magari, se non l'hai fatto di recente, anche una deframmentazione del disco rigido","replies":[{"poster":"Çhμa","date":"2016-09-08T10:19:56.208+0000","up_votes":1,"down_votes":0,"body":"Grazie per la risposta, ho creato le eccezioni e fatto una bella pulizia e ora è un po' più veloce ma non come un tempo, cosa può essere cambiato?","replies":[{"poster":"Chroniicles","date":"2016-09-08T10:36:08.416+0000","up_votes":1,"down_votes":0,"body":"Il gioco è in continua evoluzione, e con l'aumentare delle patch e miglioramenti grafici vari ne risulta per forza appesantito rispetto un tempo ( infatti sono stati anche cambiati i requisiti minimi\\consigliati) e quindi non è detto che con si abbiano le stesse prestazioni che si avevano, non so, 1 anno fa.\nPotresti fare un controllo approfondito con questo strumento:\nhttp://netalyzr.icsi.berkeley.edu/\n(devi scaricare java per poterlo usare)  per rilevare se ci sono impedimenti sulla linea\ne quest'altro strumento:\nhttps://support.riotgames.com/hc/it/articles/224826367-Risoluzione-problemi-automatizzata-strumento-di-riparazione-Hextech\nper verificare l'integrità del client","replies":[]}]}]}]}