{"poster":"PoroPuccino","date":"2018-07-25T16:07:33.635+0000","title":"Come scegliere che support usare","subforum":"Discussioni generali","up_votes":1,"down_votes":2,"body":"Ciao a tutti, sono una ragazza di 20 anni che ha iniziato da pochi mesi a giocare a lol.\r\nMi chiedevo se esistesse una guida per capire al meglio  che tipo di support usare, uno da peeling, tank, ap aggressive,  healer etc\r\nCi sono partite in cui &egrave; scontato, ma a volte non so veramente cosa pickare e mi butto sul champ che mi d&agrave; pi&ugrave; sicurezza, ma non lo trovo sempre una scelta corretta.\r\n\r\nLa mia champion pool &egrave; la seguente\r\nMorgana\r\nSoraka\r\nLeona\r\nNami\r\nLulu\r\nLux\r\nJanna\r\nThresh\r\nRakan\r\n\r\nSto imparando Alistar perch&eacute; l&#039;unico tank che utilizzo &egrave; leona.\r\nSe avete link o consigli sono qui per ascoltarvi o meglio leggervi.\r\n\r\nGrazie, un saluto a tutti\r\nWhite","replies":[{"poster":"uFere","date":"2018-07-25T19:50:42.645+0000","up_votes":2,"down_votes":0,"body":"In genere il supp prende quello che serve al team, tipo\n    \n* Il team nemico è pieno di assassin/bruiser? In tal caso prenderai {{champion:40}} {{champion:117}} o qualsiasi altro peeler, consiglio anche {{champion:44}} che è diventato op a merda\n\n* Il mio team non ha frontline? {{champion:12}} {{champion:516}} {{champion:89}} \n\n* Hai un tank e non ci sono molti assassin nel team nemico? (COSA PARECCHIO RARA) {{champion:63}} {{champion:1}} {{champion:555}} \n\n* La bot nemica è squisy as fuck? {{champion:53}} {{champion:412}} {{champion:111}} \n\nAh per gli hypercarry {{champion:222}} {{champion:67}} {{champion:29}}  ti consiglio gli healer o comunque champ che abusano di scudi {{champion:16}}...sappi che se giochi soraka sei davvero una brutta persona..\n\nDa ex main {{champion:12}}  posso darti qualche dritta, rusha sempre le {{item:3117}} e fai pratica con la combo WQE, la ulti è ottima per divare o tankare colpi, è terribilmente sottovalutato come support ma è d'impatto\n\nAd ogni modo, se serve aiuto ti consiglio di consultare reddit, ogni champion ha una pagina dedicata con build e tutto, esiste anche un reddit dei main supp: https://www.reddit.com/r/supportlol/\n\nBuon game ;)","replies":[]},{"poster":"sbepuz97","date":"2018-07-25T17:06:01.956+0000","up_votes":2,"down_votes":0,"body":"dovrei averti mandato l'invito ^^ se ti servirà una mano sarò felice di aiutarti, sono pure io main supp ^_^\n\nle build sui support sono molto standart al momento, nel senso, non hai \"troppa\" scelta\n\ni champ dipendono molto dal tuo stile di gioco, se sei aggressiva oppure preferisci difendere i tuoi alleati in modo che possano fare danno\n\ntresh è un pick solido che va sempre bene praticamente, è un jolly da sempre\nleona è un ottimo champ da all-in, il suo problema è che una volta che ingaggia va fino in fondo\nrakan è una leona potenziata grazie alla sua mobility\nmorgana ottimo pick contro gente che vuole ingaggiare sul tuo adc o sul tuo team\nnami/lulu/janna sono tra i miei champ preferiti, in particolare nami, devi riuscire a capire come utilizzare il loro danno durate la laning phase ma senza ricevere troppe botte ^^\nsoraka è un ottimo champ per soloq al momento","replies":[]},{"poster":"JohannesKT","date":"2018-07-25T17:27:56.786+0000","up_votes":1,"down_votes":0,"body":"anche io sono main support; generalmente scelgo il support rispondendo ad alcune facili domande:\n1) c'è un tank nel mio team? se sì, passo alla domanda dopo. Se no, prendo un support tank ( di norma Leona o Alistar o Nautilus o Malphite).\n2) il mio team ha un engage decente? Se no, prendo ad esempio un malphite o un Alistar per poter ingaggiare e tankare in teamfight.\n3) il mio adc ha bisogno di molta protezione e il team nemico ha molti skillshot con molto range o che stunnano? se sì, prendo un campione che possa difendere il mio adc o salvarlo ( quindi con una cura o con una barriera, come ad esempio Soraka, Morgana e Nami).\nIn base alle risposte a queste 3 domande, scelgo il campione che ritengo più idoneo.","replies":[]}]}