{"poster":"Guppy Fish","date":"2017-07-19T21:56:02.969+0000","title":"Das Geschenk","subforum":"Allgemeiner Chat","up_votes":4,"down_votes":0,"body":"Er sah sie an, z&auml;rtlich und mit einem sp&ouml;ttischen Funkeln im Auge.\r\n\r\n_&bdquo;Hast du jetzt vor wieder still zu sein?&ldquo;_\r\n\r\nSie schwieg, seine Miene verh&auml;rtete sich. Und das machte es ihr noch schwerer zu antworten. \r\n\r\n_&bdquo;Was ist blo&szlig; los mit dir?&ldquo;_\r\n\r\nSie versuchte sich wegzudrehen, doch er hielt sie fest.\r\n\r\n_&bdquo;Jetzt dreh dich nicht weg, antworte mir, verdammt!&ldquo;_\r\n\r\nSie riss sich los und wandte sich ab, kr&uuml;mmte sich in der Ecke zusammen, weg vom hellen Bildschirm des Computers, weg von ihm, unf&auml;hig was zu sagen. Wenn blo&szlig; diese Leere nicht w&auml;re. Wenn sie blo&szlig; antworten k&ouml;nnte. Sie konnte noch nicht mal mehr sagen welcher Tag heute war, die Nummern verschwammen in ihrem Kopf, ergaben keinen Sinn mehr, weil es egal war, blo&szlig; eine Zahl, nichts von Bedeutung. Es gab keine Bedeutung mehr, nichts woran sie sich h&auml;tte festkrallen k&ouml;nnen, keinen Rettungsring. War sie noch am Leben? \r\n\r\nIhre Fingern&auml;gel krallten sich so fest in ihren Unterarm, dass es anfing zu bluten, sie brauchte das. Sie wollte wissen, ob sie noch lebte, wollte wieder atmen k&ouml;nnen, wollte endlich frei sein. Als sie sich endlich umdrehen konnte war er immer noch da, geschockt, starrte in die Leere. Das war nicht das erste Mal, dass er einen ihrer Anf&auml;lle miterlebt hatte, aber das erste Mal seit sie sich kannten, dass sie es wieder gebraucht hatte. \r\n\r\n&bdquo;Es tut mir Leid, aber vielleicht ist der Tod wirklich das sch&ouml;nste Geschenk, was wir bekommen.&ldquo;","replies":[{"poster":"SwissKeks","date":"2017-07-19T22:03:25.875+0000","up_votes":4,"down_votes":0,"body":"Erleichtert nahm ich das Telefon vom Ohr. Ich schien noch am Leben zu sein.\nDie Worte von Ihr, \"Alle ist okay, es wird gut\" hatten mich beruhigt.\nBeruhigt für einen Moment.\n\nAls das Handy wieder auf dem Bett lag realisierte ich wss Sie sagte. Ich wusste vorher nicht was sie sagte, ich wusste nicht was ich sagte. Ich war nicht anwesend. Jetzt war ich es plötzlich.\n\nHier. In all dieser Bewegung - mitten in den Farben. Dunkle Farben, böse Farben, Farben die einem weh tun wollen.\n\nIch war noch am nachdenken was Sie sagte, da sah ich Sie vor mir. Wie wir uns umarmten, wie Sie sagte \"Alles wird gut\".\nEs wäre schön gewesen, wäre nicht alles in einer Sekunde zusammengebrochen und am Boden zerschellt.\n\nDu darfst mich ruhig adden, ich glaube ich weiß ganz gut was du gerade durchmachst. Vorausgesetzt es ist so, wie ich es mir denke.","replies":[{"poster":"ReDcOrSaIr2","date":"2017-07-20T05:45:48.818+0000","up_votes":1,"down_votes":1,"body":"Vielleicht denkt ihr Schweizer zu viel?{{summoner:31}}","replies":[{"poster":"Fresh Dumbeldore","date":"2017-07-20T05:57:10.890+0000","up_votes":2,"down_votes":0,"body":"Wieso sollten wir? ;P","replies":[]}]},{"poster":"ReDcOrSaIr2","date":"2017-07-20T06:10:07.846+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SwissKeks,realm=EUW,application-id=YnZkMR0R,discussion-id=vJRnG0oP,comment-id=0001,timestamp=2017-07-19T22:03:25.875+0000)\n>\n\n> \n> Du darfst mich ruhig adden, ich glaube ich weiß ganz gut was du gerade durchmachst. Vorausgesetzt es ist so, wie ich es mir denke.\n\nVielleicht ist es so, dass er zu wissen glaubt was Guppy Fish weiss, dabei weiss er gar nicht das der Andere etwas anderes denkt. Somit weiss Swisskeks nicht was der Andere weiss und weiss nicht das er es nicht weiss.\n{{summoner:3}} {{summoner:31}} {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Fresh Dumbeldore","date":"2017-07-20T06:20:37.691+0000","up_votes":1,"down_votes":0,"body":"_Es ist nicht so wie du denkst wenn du denkst was ich denke was du denkst_\n\nHier ist nur ein kleiner Ausschnitt aus meine Song \"Wenn du denkst\".\n\nhttps://www.youtube.com/watch?v=5E3uXpGuZ-0\n\nKauft alle mein Album um mich zu supporten danke Bros","replies":[{"poster":"ReDcOrSaIr2","date":"2017-07-20T06:24:25.148+0000","up_votes":1,"down_votes":0,"body":"Oh ja, daran habe ich jetzt nicht gedacht. Dann denkt er also dass es nicht so ist wie du denkst wenn du denkst was ich denke was du denkst?\n\nJa ist gut, ich finde die Tür von alleine..{{summoner:6}}","replies":[{"poster":"Fresh Dumbeldore","date":"2017-07-20T06:49:55.737+0000","up_votes":1,"down_votes":0,"body":"Hast du sie dumm gerade genannt?","replies":[{"poster":"ReDcOrSaIr2","date":"2017-07-20T06:52:58.698+0000","up_votes":1,"down_votes":0,"body":"Wen?{{summoner:1}}","replies":[{"poster":"Fresh Dumbeldore","date":"2017-07-20T07:10:09.791+0000","up_votes":1,"down_votes":0,"body":"ich dachte du hättest mein Musikvideo angesehen :(","replies":[{"poster":"ReDcOrSaIr2","date":"2017-07-20T07:14:54.296+0000","up_votes":1,"down_votes":0,"body":"Nein :C","replies":[]}]}]}]}]}]}]}]},{"poster":"The mute Swan","date":"2017-07-20T08:43:37.350+0000","up_votes":2,"down_votes":0,"body":"Ich denke immer noch nicht, dass er\\*sie\\*es auf Kommentare antworten wird, scheint wohl sein\\*ihr Stil zu sein.\nWeiterhin verfolge ich die Theorie, dass der\\*die Autor\\*in nicht umbedingt von sich oder seiner\\*ihrer aktuellen Lage schreibt, wie man vielleicht daran erkennt, dass Guppy Fish bereits mehrere Beiträge in ähnlichem Stil verfasst und mit wechselndem Geschlecht der Hauptfiguren gearbeitet hat.\n\nVielmehr denke ich mittlerweile, handelt es sich hier um Verarbeitung von Erinnerungen, Gedankenfetzen und vielleicht auch tatsächlichen Erlebnissen über den literarischen Weg. Dieses Nicht-kommentieren ließe sich auch in mehreren Hinsichten deuten. Einerseits vielleicht um den Interpretationshorizont nicht zu schmälern, andererseits vielleicht um das Werk an sich einzelner und herausstechender zu gestalten. Ich halte dies auf jeden Fall für einen bewussten Schritt.\n\nDiese Geschichten zeigen immer nur einen kleinen Ausschnitt aus dem Leben der Hauptperson, meist Wendepunkte, die Perspektive manchmal von oben, manchmal von ganz nah dran. Die Perspektive in dieser Geschichte ist überraschend nah, was die Geschichte intensiver wirken lässt.\n\nAuch die Kursivschreibung der Wörtlichen Rede und der letzte, plötzlich nicht kursive Satz, lassen nahe liegen, dass es sich hierbei um eine Art literarischer Kunst handelt.\n\nAllerdings ist das nur meine Interpretation der Dinge und es wird so viele Arten geben das zu interpretieren, wie es Menschen auf der Welt gibt.\n\nSvenson Out","replies":[]},{"poster":"Reliable Support","date":"2017-07-19T21:59:03.768+0000","up_votes":1,"down_votes":1,"body":"Welp wenn das ein Hilferuf ist.. lass mich dir eine Sache sagen.\nDer Tod ist erst schön, wenn man überzeugt ist, dass das Leben ein Erfolg war.","replies":[{"poster":"Reliable Support","date":"2017-07-19T22:08:38.999+0000","up_votes":1,"down_votes":1,"body":"Achso, außerdem sollte der Typ anders an die Sache rangehen und sie sollte lockerer sein <w<\n\nVerbesserungsvorschlag: Ihr geht einfach mal raus spazieren, ode andere Aktivitäten außerhalb des PC. Mal in den Wald. Da riecht es gut, und es ist frisch, und... warm. iihh.. vergesst nicht, Wasser mitzunehmen. \nWas ihr wahrscheinlich vermeiden wollt sind Menschenmengen (einerseits wegen ihrer bereits existenten Fluchtversuche, andernseits ist Zeit voller Zweisamkeit vorallem in der Natur _voller Magie_, der Wald ist daher eine gute Option. Andernfalls, falls eine gewisse Menge an Menschen nichts ausmacht: Kletterpark! Das ist super spaßig, vorallem zu zweit (und wenn man sich helfen kann òwó).\n\nIhr solltet eine gute Bindung aufbauen, außerhalb des virtuellen Lebens. Denn irgendwann solltet ihr lernen, dass das virtuelle Leben nicht einmal ansatzweise so schön ist wie das reale; auch, wenn das virtuelle Leben mit so manchem Panorama verlockt. Das Gefühl des Lebens geht dort unter, weil man nicht da ist, es nicht anfassen kann. \nFindet eure eigenen Panoramen. Lebt sie, fühlt sie.","replies":[]}]}]}