{"poster":"BooMheadshot7792","date":"2017-03-28T09:53:33.088+0000","title":"Empfiehlt ihr mir ins Ranked zu gehen ?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hallo Leute,\r\nbin seit gestern Level 30 und m&ouml;chte heut Abend anfangen meine Placement Matches zu machen.\r\nW&uuml;rdet ihr mir das empfehlen ? \r\nIch w&uuml;rde ADC oder Midlane Spielen\r\nWer dabei sein will einfach adden und mir eine nachricht ingame schicken\r\n\r\nGru&szlig; Headshot","replies":[{"poster":"IQ FortyTwo ","date":"2017-03-28T10:01:25.971+0000","up_votes":2,"down_votes":13,"body":"Spiel am besten Midlane + Jungle, ADC würde mich persönlich nur nerven bei den Schwachmaten die da rumlaufen sich Support nennen afk am tower stehen und genug zeit haben im ALL chat zu spammen. Als Jungler hast du halt wie auch auf der Midlane die möglichkeit überall einzugreifen, mehr control, höhere chance aufs gewinnen.\n\nPS: Beachte nicht die downvotes bei mir, ich werde von einigen Leuten stark getrollt, die downvotes haben nichts mit dem inhalt meiner texte zutun, das sind einfach leute die was gegen mich persönlich haben, weil ich das system kritisiere und fankids mögen kritik nicht und haten deshalb. ","replies":[{"poster":"eingew","date":"2017-03-28T12:30:11.395+0000","up_votes":3,"down_votes":1,"body":"> fankids mögen kritik nicht und haten deshalb.\n\nDiese Bezeichnung zeugt aber nicht gerade von einem sinnvollen Umgang mit der Kritik dieser \"Fankids\". Deeskalation und konstruktive Diskussionen funktionieren anders.","replies":[{"poster":"Scrotum 420","date":"2017-03-29T11:22:37.881+0000","up_votes":1,"down_votes":1,"body":"Ne, der Gummipflanzen-IQ-Mann sagt das schon richtig, vor einiger Zeit habe ich ähnliches festgestellt. \nIrgendwie gammeln hier ständig dieselben Leute rum und downvoten alles, was mit direkter Kritik am Spiel oder ähnlichem zu tun hat. Und das nervt. Das ganze Up- und Downvote-System nervt, weil es in vielen Fällen 0 mit dem Inhalt des Verfassers zu tun hat. Riot schenkt euch keinen Skin, egal wie gross die Schleimspur ist.\n\nEr hat halt auch recht mit der Aussage zu den Supportern. Ich bin ADC- und Suppmain und merke wenn ich ADC spiele sehr gut, wenn jemand überhaupt keine Ahnung als Supporter hat. Sie bemühen sich nicht einmal, das ist das traurige. In 2-3/10 Games sehe ich vom Supporter schon im Champselect \"some1 wants to supp? Autofill sucks...\". Na das motiviert mich ungemein als ADC, ne? Schlussendlich wird höchstens ein AP-Supp auf Full-AP gespielt, nix mit Peel. Oder aber einen Thresh, ohne dass man jemals einen Gegner AA'en würde. Einfach hinter dem ADC stehen und höchstens mal eingreifen, wenn der ADC bereits in ein 2v1 verwickelt und 30% HP bereits verloren hat.\nSie erzeugen 0 Druck und flamen dich dann, weil du 20 Lasthits weniger hast als der Gegner :D lächerlich. Es gibt natürlich auch gute Supporter und gar Supporter die dich carrien, die haben selbstverständlich lobende Worte verdient. Ich sehe einfach eine Problematik in der Botlane, die immer wieder zu Spannungen führt. Sieht man ja auch schon bei der Wartezeit, dass niemand supporten möchte. \n\nUm auf den Punkt zu kommen: ADC würde ich dir zu Beginn auch nicht empfehlen, weil die Rolle meiner Meinung nach die Schwierigste ist und du wie gesagt auf deinen Supporter angewiesen bist. Sammle etwas Erfahrung, dann kannst du dich nochmals an die Rolle wagen. Oder übe die Rolle in einigen Normals, bis du dich sicher fühlst.\n\nCheers","replies":[{"poster":"eingew","date":"2017-03-30T09:41:45.145+0000","up_votes":3,"down_votes":0,"body":"> Irgendwie gammeln hier ständig dieselben Leute rum und downvoten alles, was mit direkter Kritik am Spiel oder ähnlichem zu tun hat. Und das nervt. Das ganze Up- und Downvote-System nervt, weil es in vielen Fällen 0 mit dem Inhalt des Verfassers zu tun hat. Riot schenkt euch keinen Skin, egal wie gross die Schleimspur ist.\n\nWenn man die Threads auf der Startseite nach Wertung sortiert, tauchen die beiden Threads auf, die mit Abstand die meisten Upvotes haben (800 und 700). Beide kritisieren Riot. Erst danach kommen andere Threads. Oder um es anders auszudrücken: So wie ich das erlebe wird permanent an Riot kritik geübt, von allen Seiten, die einzigen, die dabei keine Zustimmung bekommen, sind solche, die zum x-ten Mal ein Thema einfach alte Punkte wiederholen, statt die Forensuche zu benutzen die Diskussion in einem bereits bestehenden Thread wieder aufleben zu lassen oder absolut invalide Punkte aufzeigen. Valide Punkte werden dagegen so wie ich das sehe nahezu nie gedownvotet oder auf unsinnige Weise kritisiert.\n\nAber dein Nachtrag, dass das alles Gammler sind schlägt ja in genau dieselbe Kerbe, wie die von IQ FortyTwo, was mich zu der Frage führt, ob du an validen Diskussionspunkten überhaupt interessiert bist oder ob dein Hauptaugenmerk vielleicht eher auf emotionaler Stigmatisierung und Diffamierung der von dir zu Feinden erklärten User liegt? Oder, um es, wie bei einigen anderen Usern beliebt, wozu nutzt du das [argumentum ad hominem](https://de.wikipedia.org/wiki/Argumentum_ad_hominem)? Die meisten User hier werden dir dafür erfahrungsgemäß keine Zustimmung zukommen lassen, weil derlei Straßenverkäufertricks nun mal in einer Diskussion absolut zweitklassig und wenig überzeugend sind.\nWie gesagt: Eine konstruktive und sinnvolle Diskussion führt man anders.\n\nDie anderen Punkte sind mir egal, auf die bin ich schon am Anfang nicht eingegangen und werde das auch hier nicht tun.","replies":[]}]}]},{"poster":"FearTheWalkinCat","date":"2017-03-28T12:52:38.924+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=IQ FortyTwo ,realm=EUW,application-id=Wj1wcocU,discussion-id=OXrpQHOA,comment-id=0000,timestamp=2017-03-28T10:01:25.971+0000)\n>\n> Spiel am besten Midlane + Jungle, ADC würde mich persönlich nur nerven bei den Schwachmaten die da rumlaufen sich Support nennen afk am tower stehen und genug zeit haben im ALL chat zu spammen. Als Jungler hast du halt wie auch auf der Midlane die möglichkeit überall einzugreifen, mehr control, höhere chance aufs gewinnen.\n> \n> PS: Beachte nicht die downvotes bei mir, ich werde von einigen Leuten stark getrollt, die downvotes haben nichts mit dem inhalt meiner texte zutun, das sind einfach leute die was gegen mich persönlich haben, weil ich das system kritisiere und fankids mögen kritik nicht und haten deshalb.\n\nwenn du nicht als Forumtroll bekannt wärst würde es ja keine Downvotes hageln ^^\n\nPS. Einmal Troll immer Troll","replies":[{"poster":"IQ FortyTwo ","date":"2017-03-28T18:22:15.259+0000","up_votes":1,"down_votes":2,"body":"Beweis es mir, gib mir den beweis dass ich ein ''Troll'' bin, kannst du nicht, gibts nicht.","replies":[{"poster":"FearTheWalkinCat","date":"2017-03-29T10:48:34.248+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=IQ FortyTwo ,realm=EUW,application-id=Wj1wcocU,discussion-id=OXrpQHOA,comment-id=000000010000,timestamp=2017-03-28T18:22:15.259+0000)\n>\n> Beweis es mir, gib mir den beweis dass ich ein &#x27;&#x27;Troll&#x27;&#x27; bin, kannst du nicht, gibts nicht.\n\nWer so viel Dumme Kommentare und Posts macht wie du gilt für mich als ein Forumtroll nicht zu verachten das du von anderen Forumtrolls auch als einer von ihnen Betrachtet wirst","replies":[]}]}]},{"poster":"Ηastur","date":"2017-03-30T14:06:23.542+0000","up_votes":1,"down_votes":0,"body":"Tu dir doch bitte selbst den Gefallen und denke nur einmal darüber nanch wem du hier Tipps gibst. Den Inhalt deines Textes zu befolgen, ist absolut nicht empfehlenswert. Grade als Mitte oder Jungle hat man den meisten Einfluss, das ist richtig. Aber jemanden der grade erst ins Spiel gestartet ist auf diese Positionen zu setzen ist ein geschenkter Sieg für jeden Gegner.\nDenk nochmal darüber nach was du da eigentlich gesagt hast.\n\n\nTop und SUp sind weitaus empfehlenswerter um Sachen wie Mapawareness, Wavekontrolle etc zu lernen. Du bist Top auf ner Insel, da kanns aber passieren, dass du Firstblodd abgibst und ab dem Moment gesnowballed wirst. Als Sup hat man die besten Möglichkeiten Mapvision, Warding, Tiimer, Pathing etc zu lernen ohne den Farm und Trading zu vernachlässigen.","replies":[]}]},{"poster":"Alustus","date":"2017-03-28T12:07:40.348+0000","up_votes":3,"down_votes":0,"body":"Zum besser werden ist Ranked sicher besser als weiterhin normals zu spielen.\nWenn du aber gewinnen willst oder hoch einsteigen willst würde ich dir davon abraten.\n\nIch für meinen Teil würde erstmal Runen und Runenseiten farmen, was sicher nich etwas Zeit in anspruch nehmen wird, und erst dann Ranks spielen.","replies":[]},{"poster":"ELOW Cronos","date":"2017-03-28T11:51:30.841+0000","up_votes":3,"down_votes":0,"body":"Ich persönlich würde es dir nicht empfehlen. Gerade am Anfang macht es mehr Spass wenn man einige Erfolgsmomente verzeichnen kann und nicht nur permanent (virtuell) vermöbelt und nach Bronze 5 durchgereicht wird, verbittertes Ranken gibts später noch genug ;). Ich zumindest fände das ziemlich frustrierend und hätte wohl wieder aufgehört mit dem Spiel. Damals als ich angefangen habe zu Ranken hatte isch schon gegen 600 5v5 Normal Wins und wurde dementsprechend auch direkt Silber 2 geranked. Das man in Normals nicht richtig üben kann halte ich für Quatsch. Auch Normals haben eine MMR, wenn du da immer Tryhardest und heufig gewinnst wird diese steigen und deine Gegner werden besser. Mag sein das es in Normals viele gibt die das Spiel nicht so ernst nehmen...aber wenn du irgendwann als Bronze/Silber gegen einen Platin-Spieler, der das ganze gerade nicht so ernst nimmt, ran darfst hast du locker genug Herausforderung um was zu lernen. Ab und zu hast du dann sogar einen Platin LvL 7 Onetrick Riven Spieler im Gegnerteam, der sich gerade fürs Ranked aufwärmt...das ist dann viel anspruchsvoller als gegen einen Silberspieler zu lanen.\n\nTLDR: Geh nur ins Ranked wenn du eine wirklich grosse Frustrationsgrenze hast und darauf klar kommst erstmal nur zu feeden.","replies":[]},{"poster":"Angel Ayume","date":"2017-03-28T11:09:03.254+0000","up_votes":2,"down_votes":0,"body":"Also ich rate dir eher davon ab, wenn du nicht frustriert sein willst. \nDie 10 Placementgames zum einranken kannst du gerne machen, aber ich würde keine weiteren spielen.\n\nDa du so gut wie nur Aram und Funmodes spielst, hast du so gut wie keine Erfahrung in der Kluft im 5v5. \nSpiele erstmal normals mit Freunden damit du lernst wie man richtig farmt und das traden auch nicht immer negativ für dich ausgeht.\nSpiele die Champs und Positionen die dir Spaß machen, mach es nicht davon abhängig was andere sagen was besser oder sowas ist.. \n\nIch zitiere mich mal aus einem anderen Beitrag, der dir sicher auch helfen kann. \n\n> Wenn du aufsteigen willst, dann musst du an dir arbeiten und dich verbessern. Es hat keinen Zweck seine Mates zu kritisieren. Die wirst du im besten Fall nie wieder in deinen Games haben. Deine Mates kannst du nunmal nicht ändern und du kannst sie dir nicht aussuchen, leider.\nAlso bist du die einzige Konstante die änderbar ist. Und wenn du dich verbesserst. steigst du auch auf. Trotz Flamer, Feeder und Afkler. ;)\nDu musst nur etwas dafür tun und ein wenig Aufwand dafür betreiben.\n\n> Erwarte nicht, dass du dich innerhalb von ein paar Games verbesserst aber mit der Zeit kommt das alles. Spiele auch nicht um zu gewinnen, so absurd das klingt, sondern spiele um dich zu verbessern. Dann macht es dir nämlich weniger aus, wenn du mal nicht gewinnst. :)\n\n> Ich kann dir auch die Videoreihe \"Besser werden im Ranked\" von letsreadsmallbooks aka Maxim sehr empfehlen. Findest du natürlich auf Youtube. Die Videoreihe ist schon was älter und einiges ist veraltet aber das meiste lässt sich immer noch anwenden und wird sich auch nie ändern.\n\n>Auch der Youtuber LessQQ hat so eine Reihe \"Besser werden im Ranked\". Die kannst du dir auch mal zur Gemüte führen. :)\nEr hat auch viele Guides zu einem bestimmten Champion und erklärt diesen sehr ausführlich. Von Runen und Masteries, bin hin zu Itembuild und Tipps und Tricks. Und sogar 1-2 Gameplays gehören dazu. Er ist ein Midlane Main.","replies":[]},{"poster":"MelikeWombat","date":"2017-03-28T10:18:55.242+0000","up_votes":2,"down_votes":0,"body":"Laut deinem Profil spielst du ja hauptsächlich Funmodes und ARAM, da ist ein Ranked nochmal was ganz anderes. Ich würde mir für jede deiner Rollen zwei oder drei recht einfache Champions suchen, die du in Normals übst und dann irgendwann ins Ranked gehst. Für die Mitte fielen mir da Annie, Malzahar und Morgana ein. Als ADC finde ich MF recht einfach, bin aber sonst was Picks angeht etwas überfragt.\n\nGrundsätzlich kannst du auf jeder Rolle ein Spiel carrien, du musst sie nur eben beherrschen und nach Möglichkeit ein positives Mindset behalten, auch wenn es mal nicht gut läuft.","replies":[]},{"poster":"Ηastur","date":"2017-03-30T13:57:05.337+0000","up_votes":1,"down_votes":0,"body":"Ich würde dir davon abraten.\nLern das Spiel noch etwas. Du hast grade erst den Einstieg und höchstwahrscheinlich noch lange nicht genug Basicwissen.","replies":[]},{"poster":"Undy1ng","date":"2017-03-29T08:34:26.785+0000","up_votes":1,"down_votes":0,"body":"Also es wurde schon gesagt. Warte noch. Ein gutes Ziel ist 100 Normal Games. Wenn du dies hast, schau deine  Winns  Loos  an wenn du mehr Loos  hast, die nächsten 100. So hab ich es gemacht. Nach einer Weile hab ich besser gespielt, hab Rangliste angefangen und bin in Season 4 Challenger  geworden.  Seit dem reicht mir Dia. Aber das hat 4 Jahre gedauert, jeden Tag sehr viel gezockt. Heute ist Familie wichtiger","replies":[]},{"poster":"Jannanomana","date":"2017-03-28T10:38:59.476+0000","up_votes":2,"down_votes":2,"body":"***","replies":[{"poster":"Sydney26","date":"2017-03-28T10:57:13.639+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MagicAnimeGirl,realm=EUW,application-id=Wj1wcocU,discussion-id=OXrpQHOA,comment-id=0003,timestamp=2017-03-28T10:38:59.476+0000)\n>\n> huhu, \n> es empfielt sich, das du dich auf 1 bzw. maximal 2 champs spezialisiert, welche dir spaß machen, eine nicht alzuhohe popularity/bann rate haben und ggf. auf 2 positionen spielbar sind.\n> \n> Ich spiele z.b. nur Janna und Lux. da ich eig zu 99% eh support kriegt, kann ich immer lux bzw janna support picken. krieg ich midlane, kann ich ebenfalls beide spielen. da lux und janna nie gebannt sind hab ich immer die freie wahl. Lux oder Janna :) bevorzuge meistens Lux, wegen dem schicken skin :).\n> \n> liebe grüße,\n> MagicAnimeGirl\n\njanna mitte? hmm ja gut :D {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"FearTheWalkinCat","date":"2017-03-28T12:56:21.103+0000","up_votes":1,"down_votes":1,"body":"es wird doch extra gesagt das sie nur Supp spielt und net Mitte","replies":[{"poster":"Sydney26","date":"2017-03-29T08:19:56.664+0000","up_votes":1,"down_votes":0,"body":"er hatte geschreiben \"krieg ich midlane, kann ich ebenfalls beide spielen\"","replies":[]}]}]},{"poster":"Megamaexx","date":"2017-03-28T10:55:49.678+0000","up_votes":1,"down_votes":0,"body":"Janna ist aber kein effizienter pick für die midlane, während Lux zwar durchaus Support-Potential hat, aber andere diesen Job bedeutend besser erfüllen können.\nAlso Janna sup absolut empfehlenswert und Lux mid ebenso. \nFür beide Positionen kommen noch Malzahar, Brand und Velkoz infrage","replies":[]},{"poster":"Time2Whine","date":"2017-03-28T11:20:50.199+0000","up_votes":1,"down_votes":3,"body":"Janna für die Midlane? Bitte hör auf Anfänger so einen Floh ins Ohr zu setzen, da Janna nichts in der Mitte zu suchen hat.  Support ist sie top, auf anderen Rollen sollte man sie nicht spielen.","replies":[]}]},{"poster":"Gebudsan","date":"2017-03-28T10:47:36.515+0000","up_votes":1,"down_votes":0,"body":"Spiel auf jeden Fall Rankeds, aber stell dich darauf ein in S5-B2 geranked zu werden.... und dann stell dich darauf ein in B5 durchgereicht zu werden. Das ist normal und sollte dich nicht demotivieren. Echtes können wirst du erst in den rankeds erlangen, und nimm die Tipps und Kritik deiner Mitspieler ernst und versuche sie umzusetzen, dann verbesserst du dich auch schnell.","replies":[{"poster":"Megamaexx","date":"2017-03-28T10:52:40.138+0000","up_votes":1,"down_votes":0,"body":">nimm die Tipps und Kritik deiner Mitspieler ernst\n\nBesser wäre, darüber nachzudenken, ob dies sinnig wäre. Wenn er teamfights verpasst, weil er 2 tower einreißt und dann vom Team kritisiert wird, würde ich auch in der nächsten gleichen Situation wieder die tower zerstören, als auf einer lane aram zu spielen.\n\nAlso immer drüber nachdenken, nie blind die Vorschläge oder Anweisungen annehmen.","replies":[{"poster":"Gebudsan","date":"2017-03-28T11:02:29.191+0000","up_votes":1,"down_votes":0,"body":"Da muss ich dir zustimmen, ich meinte mit der Aussage: Denke über die Kritik nach. \nGerade in Low Elos denkt jeder nur an sich und an Kills. Wenn Dein Team einen TF verliert und 2 vs 3 Tradet ihr dafür aber 2 Tower bekommt oder auch nur einen dann ist das gut. \nDie Objectives sind das was die games gewinnt, nicht die Kills.","replies":[]}]}]},{"poster":"ninju7su","date":"2017-03-28T10:41:22.841+0000","up_votes":1,"down_votes":0,"body":"Klar :D mach nich den selben Fehler wie ich und spiel nur Normals weil du vor Rankeds iwie zu viel Respekt hast. Wegen der Einstellung habe ich viel Zeit früher verschwendet. Einfach reingehen und schauen was passiert. Man fühlt sich da recht schnell rein und es wird dir auf jedenfall helfen selbstbewusster zu spielen und besser zu werden. Hauptsache man gibt sein bestes und dann läuft das sschon :)","replies":[]},{"poster":"Mi3zekatze","date":"2017-03-28T10:29:36.310+0000","up_votes":1,"down_votes":2,"body":"Ja spiel ranked.\nDu bist höchstwarscheinlich nicht auf Silber Niveau wirst aber in deinen ersten 10 Games trotzdem mit besseren Spielern gematched. Die ersten 10 Games werden also hart werden und du wirst oft verlieren und feeden. Danach bist du aber in deiner \"Elo\" UNGEFÄHR angelangt (zumindest wirst du nicht Gold sein mit Bronze Niveau, d.h. auf die Division genau klappt oft).\n\nAb dann kannst du richtig mitspielen und wirdt hoffentlich mehr Spaß am Ranken haben als am Normals spielen.\n\nDeine einzige Alternative wäre einfach kein Ranked zu spielen was ja auch irgendwie nicht gut ist.\n\nDu musst nur wissen das die ersten 10 Games warscheinlich hart werden ^^","replies":[]}]}