{"poster":"Meitser","date":"2016-03-23T09:47:37.289+0000","title":"Langsam MUSS etwas gegen die Bots getan werden!","subforum":"Spielerverhalten & Moderation","up_votes":8,"down_votes":1,"body":"Hallo liebe League-Community.\r\nIn JEDEM Post von euch auf der Neuigkeiten-Seite, steht ein link wo man angeblich bis zu 10000 RP kostenlos bekommen kann. Das ist betr&uuml;gerisch und unmoralisch. Diese Bots voten sich selbst hoch und andere Kommentare runter, damit sie im Vordergrund stehen und m&ouml;glichst viele darauf reinfallen. BESCHEUERT! \r\nIch bitte darum eine h&ouml;here Sicherheitsstufe gegen&uuml;ber Bots zu machen, und die jeweiligen Links zu sperren. (Falls es m&ouml;glich ist)\r\n\r\nDanke. Langsam wird es echt schlimm damit.\r\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Maíko","date":"2016-03-23T09:58:55.724+0000","up_votes":1,"down_votes":1,"body":"Man müsste vor jedem Vote und jedem Kommentar prüfen, ob du ein Bot bist oder nicht.\n\nMan müsste also vor jeder Aktion ein captcha ausfüllen lassen und das wäre noch nerviger als die Bots selbst.","replies":[{"poster":"drexxsack","date":"2016-03-23T10:27:42.066+0000","up_votes":4,"down_votes":0,"body":"http://www.spiegel.de/netzwelt/web/google-knackt-den-captcha-code-a-964955.html\n\nFunfact: Captchas sind in den meisten Fällen von Bots sehr gut lösbar und selbst wenn nicht haben die weniger effektiven Bots ne Trefferrate von 20-30%. Das ist mehr als genug, um trotz Captcha zu spammen. Captchas verkommen mittlerweile zu einem nutzlosen Relikt.\n\nBtw werden die Bots gebannt:\nZum Zeitpunkt meines Posts (11:26) gibt es in den letzten 5 News keinen einzigen Link zu diesen Scamseiten. Wer ein wenig aufmerksam ist, wird aber wissen, dass dort aber immer mal wieder welche standen. Die sind nun weg.","replies":[]},{"poster":"Alustus","date":"2016-03-23T10:29:44.725+0000","up_votes":2,"down_votes":0,"body":"Mal davon abgesehen dass gute Bots auch captcha umgehen können und somit wieder fast nur den \"normalen\" user stört.","replies":[]}]},{"poster":"Alustus","date":"2016-03-23T10:32:12.370+0000","up_votes":3,"down_votes":0,"body":"Wenn du einen Vorschlag hast wie dann wird Riot sich das ganze anschauen.\n\nDas Problem ist momentan wurde schon eine Menge dagegen getan, wie man sieht aber nicht sehr effektiv.\n(mindestlevel usw.)\n\nMir fällt zumindest nichts effektives gegen die Bots ein, welche sie auch nachhaltig von der Website weghält.","replies":[]},{"poster":"FrankerX","date":"2016-03-23T22:04:13.070+0000","up_votes":2,"down_votes":1,"body":"also wenn man sich gegen levelbots aufregt dann kriegt man downvotes aber bei dem free rp shit drehen alle durch?","replies":[]},{"poster":"K0reanSupp","date":"2016-03-23T22:00:40.096+0000","up_votes":1,"down_votes":0,"body":"jop da steht das man immer 950 rp kostenlos bekomt man muss nur seine login daten eingeben aber das mache ich nicht tun und werde auch nicht !","replies":[]},{"poster":"Kiimahrii","date":"2016-03-23T19:11:58.001+0000","up_votes":1,"down_votes":0,"body":"Find die persönlich recht irrelevant. Letzendlich sind die nichts anderes als die standard advertisements die auf jeden sozialen Netzwerk, wie zB Facebook oder Youtube, aufzufinden sind. Auch userorentierte Werbung hat bei mir persönlich dieselbe Wirkung wie die Spambots: man weißt es ist da, und man weißt dass es ein Versuch ist, einem die Kohle rauszuhauen, deshalb nehmt man die posts, links oder bilder nicht vollkommend wahr.","replies":[]},{"poster":"Megamaexx","date":"2016-03-23T10:32:43.799+0000","up_votes":1,"down_votes":0,"body":"Mittlerweile werden diese Kommentare (vermutlich von den Mods) gelöscht.\nDa auf diesem Wege allerdings menschliches Eingreifen erforderlich ist, werden diese nicht sofort gelöscht.\nEs wäre vermutlich eine Lösung, Kommentare mit Links über ein Captcha zu sichern. Es kommt ja eher selten vor, dass normale Kommentarschreiber unter den Neuigkeiten andere Seiten verlinken","replies":[]},{"poster":"ikslhairtuz","date":"2016-03-23T09:57:29.563+0000","up_votes":1,"down_votes":0,"body":"Wieso nicht wie jeder normale Ignorieren? :)","replies":[{"poster":"Meitser","date":"2016-03-23T10:27:15.680+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ikslhairtuz,realm=EUW,application-id=KYnfKGf0,discussion-id=UyGGX2V6,comment-id=0000,timestamp=2016-03-23T09:57:29.563+0000)\n>\n> Wieso nicht wie jeder normale Ignorieren? :)\n\nauf dauer kann man das nicht. :(","replies":[]}]},{"poster":"Tree Trunk","date":"2016-03-23T11:49:17.648+0000","up_votes":1,"down_votes":4,"body":"Ich wäre sogar dafür das man diese anzeigt","replies":[{"poster":"Rainbow Dashie","date":"2016-03-24T17:03:54.403+0000","up_votes":2,"down_votes":0,"body":"und wegen was, in welchem Land?","replies":[]}]},{"poster":"okbückdich","date":"2016-03-23T21:50:40.222+0000","up_votes":1,"down_votes":4,"body":"aber das klappt doch hab mir damit alle meine skins finanziert ...\n\nach auserdem estellt das kein bot sondern die leute die auch die seite gemacht haben : wäre es ein bot hättest du unter jedem forumsthread 900 links","replies":[]}]}