{"poster":"Meitser","date":"2016-10-06T16:15:04.110+0000","title":"Warum gibt es so viele Trolls in low-elo?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":4,"body":"Hallo Community.\r\nDies ist keine diskusion dar&uuml;ber, wie schlecht Riot doch w&auml;re oder wie schei&szlig;e die Community doch w&auml;re.\r\nIm gegenteil, ich liebe die Community und finde, dass Riot ein tolles Spiel gemacht hat.\r\nJKetzt aber mal zum Forenbeitrag. Da ich ja low-elo bin, habe ich keine sehr gro&szlig;en Queue-zeiten. Aber dies gleicht sich irgendwie wieder mit der Anzahl von Trolls in low-elo aus. Ich spiele seit einiger Zeit nur noch Ranked und hier ist es mir besonders aufgefallen. In Nomarls ist es ja nicht so schlimm. \r\nEin beispiel w&auml;re, ich war mal wieder ADC und wollte, wie so h&auml;ufig Jinx nehmen. Die habe ich auch gepickt. Aber mein Support pickt dann Lucian und sagt &quot; Well, bad for you. I&#039;m gonna int&quot; Sobald ich so etwas sehe l&auml;uten bei mir sofort die Alarmglocken und ich dodge die Championselect. \r\nJetzt mal die Frage: ihr wart ja sicherlich auch alle mal low-elo (auch wenn ihr es nicht zugeben wollt). Woran denkt ihr, liegt es, dass es so vile Trolls da unten gibt?","replies":[{"poster":"FearTheWalkinCat","date":"2016-10-07T08:29:09.293+0000","up_votes":1,"down_votes":0,"body":"Es gibt in jeder elo Trolls auch wenn meist schon ein nicht Meta pick als Troll angesehen wird was ich echt lächerlich finde. Und Villeicht wollte er dich nur aufziehen und hätte später mit jemand anders getauscht Lucian kann man auch top spielen finde ich zumindest gegen manche LanerXD.","replies":[{"poster":"Meitser","date":"2016-10-07T14:12:35.668+0000","up_votes":1,"down_votes":0,"body":"top waar ja schon gepickt","replies":[]}]},{"poster":"Brymax","date":"2016-10-06T16:31:02.289+0000","up_votes":1,"down_votes":0,"body":"Einfacher Kreislauf --> Wer Trollt verliert öfter --> Wer öfter verliert steigt in der Elo nicht auf --> Wer in der Elo nicht aufsteigt ist Frustriert --> Wer Frustriert ist Trollt.","replies":[{"poster":"Zulwar","date":"2016-10-07T08:40:32.045+0000","up_votes":1,"down_votes":0,"body":"Mhm. Also ich bin ehrlich gesagt leicht frustriert, weil ich aufsteige. Leider kann ich es nur nicht verhindern, da meine Gegner schnell zu schwach werden, wenn ich versuche Spiele zu verlieren.\nAlso ich freue mich eher über ein verlorenes Spiel als über ein gewonnenes.","replies":[]}]},{"poster":"Flüssigsubstanz","date":"2016-10-06T16:38:52.515+0000","up_votes":1,"down_votes":0,"body":"Also ich denke es gibt da unten nichtmal wirklich viele trolls, es spielt sich alles nur in den Kopf wahrscheinlich immer stärker wieder. Negative erfahrungen bleiben halt stärker in erinnerung. Ausserdem gibt es auch viele leute die \"trollen\" anders definieren. \nDas was du als beispiel genannt hast ja sowas würde ich als trollen bezeichnen, manche sagen aber auch trollen wäre wenn was off-meta mäßiges gepickt wird und andere sagen widerrum nur weil jemand schlecht spielt das er trollt. Ein \"troll\" kann auch häufig entstehen wenn jemand einfach negative drauf ist und flamed, dann hat der spieler kein bock mehr und versucht garnicht erst zu gewinnen in 80% der fälle.\n\nGenerell spiel ich selten bis garnicht ranked deswegen kann ich da die umgebung schlecht einschätzen aber von dem was ich mitgekriegt habe habe ich niemals nen troll erwischt. In normal games schon 1-2 mal aber wenn man das auf die 4k+ normalgames die ich gespielt habe hochrechne ist das vielleicht nur 0,5% höchstens, wo jemand ein troll ohne vorherigen einflüssen von mir oder anderen spielern war. \nJa ich schließe mich als einfluss von mir ein weil ich auch mal toxisch war :P und wahrscheinlich auch fast jeder spieler es mal war.","replies":[]}]}