{"poster":"Shmeeve","date":"2019-08-26T02:42:43.761+0000","title":"Koraak - The Wings of Carnage (Darkin champion concept) (AP assassin)","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"Let's be real here, if darkin are ascended that went mad after azir died and witnessing the void take hold, imagine ALL the different shapes and kinds of darkin that there could be. We have Aatrox who looks like a fallen angel, Rhaast who is like a minotaur or wendigo sort of thing, and Varus... which the only forms of his body that we can see are the arms and legs, the rest of varus is that of the two gay dudes that fused along with him, so we don't know much there.\r\nThis darkin is more or less on the \"MORE\" corrupt side, but for very good reason. Considering this darkin really didn't HAVE a weapon, the least that would happen is that this darkin would be trapped in a coccoon state, then it was freed, into a humanoid, gargoyle, imp, esque.... thing. Like a demogorgon from stranger things but on wings, and not the flower mouth. This darkin had no prison, it was freed after is constructed a horrific image of itself over hundreds of years, hatching from a coccoon of its own flesh and blood. Originally, before the darkin wars, Koraak was a ravenous god warrior of hunting. If there was a foe that has done deeds that cruel and demanding of punishment, the god warriors will send Koraak, who will tear his foes to shreds with his four arms and golden claws. However, he was born as a blind man. Eventually, his eyes seemed to have vanished after focusing on every other sense, he can see visions or outlines of any other creature's life force in the world, and can identify each and every one of them, even that of the god warrior's.\r\nDesign-wise, Koraak has a large, tall humanoid appearance, made entirely of blood and flesh constricted and coiled into a humanoid shape. He bears no eyes, only two holes that represent nostrils, and a mouth filled with sharp fangs. He has four arms, one pair having equipped with claws, the other having two sickle-like claws at the tips of the appendages. He also is capable of flight, having large demonic wings.\r\nGameplay-wise I wanted to make him more of a mage/assassin type, kind of like evelynn. Most other darkin don't use the blood magic they contain that often in gameplay, the most I can see is rhaast (probably?) using his ult. Anyway, Koraak is able to demonstrate the true capabilities of blood magic. Similar to morde's ult, Koraak's ult puts him and his opponent in a whole entirely different plane, but wouldn't it be that op since he is an ap assassin who can easily single out enemies? No, and I will explain why in his kit.\r\n\r\nRole: Assassin, Mage\r\nLane: Jungle\r\nDamage: AP\r\n\r\nPassive - Malefic Terror\r\nEvery time Koraak damages an enemies, he takes 3-6% of the damage dealt and applies it as bonus ability power to his stats, each stat buff from a hit lasts 15 seconds, and all stat buffs he gains from this passive can stack. Damage from items or summoner spells does not apply.\r\n(In other words, the more you damage opponents, the more temporary bonus AP you can have.)\r\n\r\nQ - Razor-Bleed\r\nKoraak unleashes two streams of blood shaped into blades, which move slowly at first, then quickly accelerate, dealing damage and slowing targets struck. Enemies hit by the intersection of the blade take increased damage, and reduces their magic resistance slightly for 4 seconds.\r\n(Hard skill to master landing due to the acceleration part of the skillshot, it takes a lot of predicting) \r\n\r\nW - Ravenous Bloodlust\r\nKoraak dashes (glides) over a target direction, which can go over all terrain. The first enemy champion that he collides with, he stops and slashes with all four of his arms at once, dealing damage and healing for 15% of the damage dealt. If koraak is at full health, the attack does increased damage. \r\n(His main form of engage tool, and quite a scary one since the dash is pretty fast. It's also a nice escape tool.)\r\n\r\nE - Scarlet Sever\r\nKoraak shifts one of his arms into an elongated blade, stabbing a target enemy, dealing damage. The blade extends beyond the first target struck, and can strike a nearby enemy, up to three times (4 targets stuck including the initial target. The attack increases damage based on the target's missing health.\r\n(A Multi-Execute, it has a channel (the shifting of his arm into a blade) and it signifies what the target is so you have some time to get away before the bloody armblade pierces through them and at you, be aware of its bonus damage the lower your health is.)\r\n\r\nR - Carnal Corruption\r\nKoraak fires a small stream of blood magic from his body in a target direction, going through any other minion or monster but hitting the first enemy champion hit, dealing a very small amount of damage at first. However, once the champion is hit, they are immediately transported into the \"realm of their sanity,\" an alternate arena like morde's ult. Koraak's health is reduced to the exact amount that the target's health is at that very moment, he however cannot heal up to the target's current health. If the enemy champion kills Koraak while in this realm, they break free from the corruption and koraak is pretty much dead. However if Koraak wins, not only he kills the enemy champion, but he can possess the enemy champion's body for 10-16 seconds.\r\nRules of possessing an enemy champion:\r\n*Koraak is able to temporarily play as the enemy champion he killed during his ult.\r\n*The possession expires immediately once the enemy respawns, the duration ends, or if he simply recasts his ultimate. Which then Koraak bursts right out of their body.\r\n*He can use his possessed champion's basic attack range, stats, and abilities with their exact current cooldowns (except their ultimate).\r\n*possessing the enemy champion doesn't act as a shield for Koraak, he still takes damage directly even while possessing.\r\n*Yes he is able to use the possessed champion's Laugh/dance/joke/taunt animations.\r\n\r\nSome random Voice-lines\r\nLock-in: If you acknowledge any gods, now is the time to pray!\r\nBan: Scared of a little bloodshed?\r\nFirst move: One minute is a peaceful land, the next is a pile of corpses...\r\nFirst move: So many things to sever, cut, decapitate, KILL!","replies":[{"poster":"BlackKnightJack","date":"2019-08-26T02:47:52.904+0000","up_votes":1,"down_votes":0,"body":"I'm gonna be honest: The whole \"Darkin are just ascendeds who went mad\" angle shouldn't be encouraged. It's really dumb and fortunately Riot retcons lore often enough that it might be reworked eventually if they don't keep committing to it. That said, if we're going to have a Darkin in the mid lane it should be an honest to god mage instead of an assassin since Rhaast is already an assassin.","replies":[{"poster":"Shmeeve","date":"2019-08-26T05:14:50.778+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BlackKnightJack,realm=NA,application-id=3ErqAdtq,discussion-id=E6usyJ09,comment-id=0000,timestamp=2019-08-26T02:47:52.904+0000)\n>\n> I'm gonna be honest: The whole \"Darkin are just ascendeds who went mad\" angle shouldn't be encouraged. It's really dumb and fortunately Riot retcons lore often enough that it might be reworked eventually if they don't keep committing to it. That said, if we're going to have a Darkin in the mid lane it should be an honest to god mage instead of an assassin since Rhaast is already an assassin.\n\nRather have them as horsemen of the apocalypse who just exist because?","replies":[{"poster":"BlackKnightJack","date":"2019-08-26T05:34:29.374+0000","up_votes":1,"down_votes":0,"body":"I'd rather have them being cursed sapient weapons from the outset that want hosts to do what weapons were born to do.","replies":[]}]}]},{"poster":"Cotten Eyed Joe","date":"2019-08-26T02:58:03.097+0000","up_votes":1,"down_votes":1,"body":"Please no. Not another AP Assassin. My Zed can't take it.","replies":[{"poster":"Shmeeve","date":"2019-08-26T05:14:26.524+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cotten Eyed Joe,realm=NA,application-id=3ErqAdtq,discussion-id=E6usyJ09,comment-id=0001,timestamp=2019-08-26T02:58:03.097+0000)\n>\n> Please no. Not another AP Assassin. My Zed can't take it.\n\nmercury treads.","replies":[]}]}]}