{"poster":"SuperplexP","date":"2015-11-26T18:33:24.706+0000","title":"Kamerakontrollschaltflächen erscheinen schwarz","subforum":"Melde einen Bug","up_votes":2,"down_votes":0,"body":"Der Bug siehe oben:\r\n\r\nDIe beiden Schaltfl&auml;chen f&uuml;r die Kamerakontrolle (links neben der Minimap) erscheinen bei mir seit dem letzten Patch vollkommen ohne Grafik.\r\nStatt Symbolen habe ich also schwarz.\r\n\r\nIch hoffe das kann behoben werden. Danke im Vorraus.","replies":[{"poster":"gyyyr","date":"2015-11-27T12:04:01.755+0000","up_votes":1,"down_votes":0,"body":"Das hat Riot in den Patchnotes erwähnt.\n> Hinweis: Wir wissen von einem Grafikfehler mit der Anzeige und 5.23, durch den Optionen, Kameraeinstellung, Stumm und die Umschaltflächen von DJ Sonas Musik als schwarze Quadrate angezeigt werden. Dies beeinflusst ihre Funktionalität in keiner Weise und außer DJ Sonas Symbolen informieren euch alle, worum es sich bei ihnen handelt, sobald ihr darüber fahrt. Spätestens mit 5.24 werden wir das behoben haben. Tschuldigung!\n\nWieso lesen so viele Leute die Patchnotes nicht und beschweren sich dann über etwas das in den Patchnotes stand?","replies":[{"poster":"SuperplexP","date":"2015-11-27T20:35:42.997+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=gyyyr,realm=EUW,application-id=ImBE6GqA,discussion-id=YKpZxZ94,comment-id=0001,timestamp=2015-11-27T12:04:01.755+0000)\n>\n> Das hat Riot in den Patchnotes erwähnt.\n> \n> Wieso lesen so viele Leute die Patchnotes nicht und beschweren sich dann über etwas das in den Patchnotes stand?\n\nVielleicht lese ich mir in den Patchnotes nur die wichtigsten Sachen durch und nur die behalte ich dann? Also Champion und Itemchanges, 1/2 Coole Skins und wirklich schwerwiegende Bugs, bei denen dann Champs disabled werden etc.\n\nSomit ist der zweite Teil deines Posts einfach mal vollkommen sinnlos, denn zwischen Patchnotes nicht lesen und einen in den Patchnotes angegebenen kleinen Bug zu lesen und zu behalten ist nunmal noch ein wenig mehr.","replies":[]}]},{"poster":"Raystlin82","date":"2015-11-27T11:49:24.139+0000","up_votes":1,"down_votes":0,"body":"Ich hab das gleiche Problem. Das stört echt, weil ich im Spiel oft die Schaltflächen benutze.\n\nBetriebssystem: Windows\nGrafikkarte: AMD Radeon HD 8570D\n\nWäre super, wenn ihr den Bug schnell beseitigt. Bin mir sicher, dass wir beide nicht alleine davon betroffen sind.","replies":[]}]}