{"poster":"SquashCannon","date":"2017-05-27T17:40:57.931+0000","title":"I have been playing ranked solo duo on my main for the past few days, but there's an inactivity...","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"countdown. It's saying that in 8 days im going to start decaying even though ive been playing ranked for the past few days now. Is this just new client bugging out?","replies":[{"poster":"Porocles","date":"2017-05-27T18:35:23.242+0000","up_votes":1,"down_votes":0,"body":"I can see that being really confusing, and I'm glad you reached out to see what's going on.  It looks like you just reached Platinum- Super freaking congrats, that's amazing!  Past Gold, your[ ranking can decay due to inactivity](https://support.riotgames.com/hc/en-us/articles/204010760-Ranked-Play-FAQ) and the messaging was sent out to let you know about that.  It's after 28 days though, not 8, so that piece is interesting and could be a bug.   Let me know if that otherwise clears things up, though.","replies":[{"poster":"SquashCannon","date":"2017-05-27T18:56:51.557+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Porocles,realm=NA,application-id=osqw6G4M,discussion-id=v4X8c8oT,comment-id=0000,timestamp=2017-05-27T18:35:23.242+0000)\n>\n> I can see that being really confusing, and I&#x27;m glad you reached out to see what&#x27;s going on.  It looks like you just reached Platinum- Super freaking congrats, that&#x27;s amazing!  Past Gold, your[ ranking can decay due to inactivity](https://support.riotgames.com/hc/en-us/articles/204010760-Ranked-Play-FAQ) and the messaging was sent out to let you know about that.  It&#x27;s after 28 days though, not 8, so that piece is interesting and could be a bug.   Let me know if that otherwise clears things up, though.\n\n\"just reached\"\n\nMy main is Tychusfindlay919, sorry for the confusion. But yeah, it has this countdown. Im not sure if it will actually decay, or if client is bugging out on me. When I check my profile it does show that I am gaining LP (currently climbing thank god) so Im not sure what is going on exactly.\n\nYesterday it said 9 days, now it says 8 days, tomorrow I would assume 7 days.\n\nI just played 2 ranked games today though, and I was active all throughout the week.","replies":[{"poster":"LostFr0st","date":"2017-05-27T19:16:39.770+0000","up_votes":2,"down_votes":0,"body":"You sure it's not Flex queue?  Their decay timers are separate.","replies":[]},{"poster":"Porocles","date":"2017-05-27T19:02:19.661+0000","up_votes":1,"down_votes":0,"body":"Thanks for the follow up.  Grab some screenshots of this notice for us, and hit us up in a [support ticket](https://support.riotgames.com/hc/en-us/requests/new).  We'd like to take a closer look and figure out why you're getting these weird days.  We'll see you there!","replies":[]}]}]}]}