{"poster":"Lee Sung Kyung","date":"2015-06-22T15:39:36.600+0000","title":"\"Timore\"","subforum":"Discussioni generali","up_votes":3,"down_votes":2,"body":"Ciao ragazzi, sono qui per dirvi alcune cose.\nMa e&#039; mai possibile che io debba avere il \"timore\" di dover giocare a League of Legends? A causa di questi problemi col drophack o comunque disconnessioni random non causati dell&#039;utente, e quindi problemi \"causati\" dai server, io devo essere reportato perche&#039; ho ipoteticamente abbandonato la partita prima che questa cominciasse? (O magari gia&#039; awiata pero&#039; crasho nel bel mezzo). Non sto aggredendo nessuno, sia ben chiaro, ma per me questa cosa non e&#039; giusta perche&#039; se dovessero esserci eventi come questo del Pool Party dove, se hai subito sanzioni disciplinari da parte della Riot, non ricevi le ricompense.\nIo non ho mai avuto problemi del genere, riguardo alla disconnessione individuale fino ad ora, pero&#039; alcuni amici miei si! Son stato solamente vittima di una dozzina di partite \"fantasma\". Non ho neanche mai avuto punizioni del tipo della chat ristretta, ban dalle ranked e cose simili. Non voglio che una cosa del genere mi venga data solo perche&#039;, magari in futuro saro&#039; reportato per aver abbandonato la partita a causa di un problema che principalmente, NON E&#039; MIO. Fino a quando e' un problema mio, mi sto zitto e mi tengo i report con la punizione perche' so che il problema e' stato mio, ma quando non e' a causa mia, beh... avrei qualcosa da ridire.\nNuff'said.","replies":[{"poster":"Ste the ripper","date":"2015-06-22T15:57:30.807+0000","up_votes":2,"down_votes":0,"body":"Il drophack non ti dà problemi con il leaverburster.\nChi si becca punizioni è perché va afk volontariamente o per problemi personali, chi doce il contrario mente","replies":[{"poster":"Lee Sung Kyung","date":"2015-06-22T16:00:54.666+0000","up_votes":1,"down_votes":0,"body":"Sei sicuro? Non voglio avere report per aver abbandonato una partita random se il problema non e' mio, ergo, non sono andato AFK perche' l'ho voluto fare cosi, tanto per sport, se inizio una partita a League e' perche' voglio giocarla, non voglio vedere come giocano le altre persone, per questo c'e' Twitch.\nIo comunque so poco e nulla al riguardo perche' appunto ancora non sono stato vittima di questa cosa del firewall etc.. che ultimamente sono molto frequenti.","replies":[{"poster":"NiraBlade","date":"2015-06-22T16:56:35.048+0000","up_votes":1,"down_votes":0,"body":"se la tua partita crasha/viene drophackata nessuno può reportarti perchè nessuno ci arriva alla schermata finale. Il leaverbuster non riesce ad attivarsi nemmeno perchè il server non risponde. Se ricevi punizioni non sono dovute a queste cose","replies":[{"poster":"Lee Sung Kyung","date":"2015-06-22T17:00:39.884+0000","up_votes":1,"down_votes":0,"body":"Forse sono un po' scemo per spiegare cosa intendo.\nAllora, ci sono persone che crashano ed altre no, in una partita. Spesso e volentieri coloro che son rimasti nella partita e che non hanno avuto problemi, o che magari li hanno avuti pero' son riusciti a riconnettersi, reportano a FINE PARTITA. E non voglio essere reportato in quella situazione, okay?!?","replies":[{"poster":"NiraBlade","date":"2015-06-22T17:15:56.691+0000","up_votes":1,"down_votes":0,"body":"se il singolo crasha non è un problema del server ma della sua connessione/provider, perchè se il server avesse problemi crashereste tutti nello stesso momento. Quindi il report ci sta tutto. Anche se per gli afker il report è un po' \"inutile\" visto che il leaverbuster si attiva in automatico quando un player va afk, anche se nessuno ti reportasse (illusione platonica) avresti lo stesso la punizione.","replies":[{"poster":"Lee Sung Kyung","date":"2015-06-22T17:20:01.333+0000","up_votes":1,"down_votes":0,"body":"A me e' capitato di spectare un match di un mio amico nel quale, 5 players; 3 nel suo team e 2 nell'altro, son crashati nello stesso momento e solo 3 son ritornati dopo tipo 10 minuti di partita, gli altri 2 poi non son rientrati piu'.","replies":[{"poster":"NiraBlade","date":"2015-06-22T17:27:10.920+0000","up_votes":1,"down_votes":0,"body":"questo è un drophack: probabilmente non è stato eseguito su quella partita e quindi una parte di giocatori è riuscita a giocare mentre il restante no, anche se molto probabilmente il drophack è terminato prima di far collassare il server, che non permetterebbe di rientrare in partita. Ma il singolo crash di un singolo giocatore non dipende né dal drophack né dal server","replies":[{"poster":"Lee Sung Kyung","date":"2015-06-22T17:33:12.175+0000","up_votes":1,"down_votes":0,"body":">questo è un drophack: probabilmente non è stato eseguito su quella partita e quindi una parte di giocatori è riuscita a giocare mentre il restante no\n\nOkay perfetto, quindi mettiamo il caso che io sono vittima di quel drophack che fortunatamente e' andato \"male\", non riesco a collegarmi pero' per il resto della partita e quindi vengo reportato, verro' quindi sanzionato, giusto?","replies":[{"poster":"NiraBlade","date":"2015-06-22T17:38:16.273+0000","up_votes":1,"down_votes":0,"body":"se anche venissi reportato il sistema che controlla gli afker è automatico come ti ho scritto sopra. A prescindere dal report si attiva in automatico se e solo se sei andato afk non per il drophack e né per un problema al server. Se ti è arrivata la punizione da - appunto - il leaverbuster vuol dire che hai un problema con la tua connessione e puoi chiedere aiuto al supporto riot per scoprire cosa non va.","replies":[{"poster":"Lee Sung Kyung","date":"2015-06-22T17:49:55.264+0000","up_votes":1,"down_votes":0,"body":"Well, spero solo che comunque il tutto vada per il verso giusto, perche' e' praticamente difficile che io crashi o che vada afk volontariamente. Grazie per le delucidazioni.","replies":[]}]}]}]}]}]}]}]}]}]}]}