{"poster":"SoundWav3","date":"2016-04-22T04:51:14.743+0000","title":"Los minions.","subforum":"Charlas Generales","up_votes":6,"down_votes":3,"body":"Si, exactamente como dice el titulo, queria hablar sobre los minions, &iquest;puede que los minions estorben mas que antes, o es mi imaginacion? Antes no te trababan tanto como ahora y no se metian en el camino, se que su intencion es ayudar pobrecitos pero... &iexcl;&iexcl;&iexcl;PORQUE NO SE CORREN CUANDO ME ESCAPO BAJO DE VIDA!!! Son diabolicos, creados por teemo, parecen inocentes pero nooooo, ellos quieren arruinarte la play aglomerandose alrededor tuyo para que no puedas escapar de bajo de torre enemiga, quieren verte morir como bronce, que tus compa&ntilde;eros te reporten, te digan troll, rata, etc {{item:3151}} . Y lo peor de todo es que cuando les vas a dar el ultimo golpe al minion enemigo ellos te lo roban&iquest;Para que? Nunca lo sabremos, ellos no necesitan items, se llevan el oro a la tumba, o capaz no mueren, capaz respawnean como nosotros, capaz el oro se lo llevan para alimentar a su familia de minions y en realidad somos nosotros los malos, o.... capaz somos malos farmeando y no sabemos dar el ultimo golpe y culpamos a los minions por nuestra propia manquedad. En relidad esta discusion iba destinada a el porq los minions estorban tanto, o te traban mucho pero me inspire y cree esta mini historia sobre los minions. Espero que les saque una sonrisa minimo. \r\nSe despide el comandante de la tropas nordicas.... ah no ese no es mi saludo, se despide atte: Soundwav3 {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Chisolin","date":"2016-04-22T04:58:55.354+0000","up_votes":6,"down_votes":0,"body":"Te estorban cuando escapas con poca vida y se aparecen cuando quieres huir de un yasuo, report minions.","replies":[{"poster":"SoundWav3","date":"2016-04-22T16:49:22.705+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chisolin,realm=LAS,application-id=v7qsfXsE,discussion-id=JnNW4sAF,comment-id=0000,timestamp=2016-04-22T04:58:55.354+0000)\n>\n> Te estorban cuando escapas con poca vida y se aparecen cuando quieres huir de un yasuo, report minions.\n\njajaja exactamente","replies":[]}]},{"poster":"Loli de Grafo","date":"2016-04-22T06:50:11.152+0000","up_votes":2,"down_votes":6,"body":"http://i.imgur.com/qWu4fSa.png\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"SoundWav3","date":"2016-04-22T16:50:57.064+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=LGD Enju Senpai,realm=LAS,application-id=v7qsfXsE,discussion-id=JnNW4sAF,comment-id=0001,timestamp=2016-04-22T06:50:11.152+0000)\n>\n> http://i.imgur.com/qWu4fSa.png\n> {{sticker:slayer-jinx-wink}}\n\njajajajaja gracias por recordarmelo {{sticker:slayer-jinx-unamused}}. estoy en promo y perdi la primera ya. puta bida {{sticker:zombie-nunu-tears}}","replies":[]}]}]}