{"poster":"xXDarkPepperXx","date":"2018-11-04T15:12:28.522+0000","title":"Riot nur B?!?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":6,"body":"* Ich will mich an Riot wenden, weil ich habe in meiner letzten Runde B bekommen und habe mich gefragt wie man bei 11/0/10 ein B  bekommt.{{champion:157}} \r\n* ich habe vor wenigen Runden ein S- bei 9/2/3 bekommen.  {{champion:157}} \r\n\r\nwie kann das sein.\r\n\r\nHoffe ihr k&ouml;nnt mir helfen bin jetzt Mastery 6 mit Yasou","replies":[{"poster":"Rei Kagene","date":"2018-11-09T15:01:16.277+0000","up_votes":1,"down_votes":0,"body":"Ganz einfach:\n\n* Dein CS/Minute ist grauenhaft - Der ideale CS/M ist 10, du bist bei 4,7 unter der hälfte. Ein Yasuo sollte eigentlich immer zumindest auf 7-8 sein, vorallem wenn er snowballed.\n\n* Du bist trotz den ganzen Kills/Assists und wenigen Toden unterlevelt. Die Ahri gegen die du gelaned hast (die 7/6/3 steht) war Level 14, ein level über dem 10/0/11 Yasuo, keine Ahnung wie das geht, allein um das herauszufinden würde ich schon gern das Replay sehen. Erst recht Yasuos sind dafür bekannt mal schnell 1-2 Level über allen zu sein.\n\n* Du hast einen passablen Vision Score, aber auch nicht mehr. 8 Wards platziert in 26 Minuten, aber nicht einen zerstört und nur einen Control Ward platziert.\n\n*Du hast trotz deiner meisten kills, weniger Damage als Zed und Ahri gemacht, also eher kills genommen als sie selbst zu verdienen.\n\n*Und das wichtigste, der Score ist abhängig davon wie gut du im Verhältnis zu anderen Yasuo Spielern auf deiner ELO spielst. Also spielst du ziemlich durchschnittlich für einen Yasuo in deiner ELO, wahrscheinlich weil andere zwar nicht immer mehr kills haben, aber besser Leveln/Farmen.","replies":[]},{"poster":"SSI CptHaunted","date":"2018-11-05T07:25:14.720+0000","up_votes":1,"down_votes":0,"body":"Wie bitte? Für 4,2CS/min gibts n S-? Darf ja wohl nicht wahr sein. Grundsätzlich ist dein CS/Wert gern mal ziemlich bescheiden, genau wie bei deinem 11/0/10 Spiel.\n\nÜbrigens sind deine Builds extrem merkwürdig. Keine Ahnung wozu man Phantomtänzer + Stich + Schnellfeuer + Klinge der Unendlichkeit baut (360% Krit?), an anderer Stelle dann Phantomtänzer + Stich aber keine KDU, irgendwann dann mal Warmogs obwohl du niemals auf 3000 Leben gekommen bist um Warmogs Herz zu triggern...","replies":[]},{"poster":"Amycos Cyrus","date":"2018-11-04T16:16:59.725+0000","up_votes":1,"down_votes":0,"body":"Wenn man einfach mal nach deinen Stat-Grafen geht, was dein 9/2/3 bis auf die Sichtwertungen und die Gold-Einkommen, in jedem Aspekt überdurchschnittlich. (Dein Durchschnitt auf Yasuo-Mid is B+)  (Das Spiel ist in deinen Grafen sehr leicht zu finden, da es fast immer das Maximum ist)\n\nWenn man nun dein 11/0/10 Spiel anguckt, so fällt auf, dass nahe zu nur die KDA und Schadenswerte, sowie der Vision-Score überdurchschnittlich sind. Wohingegen viele Wertungen sogar deinen Yasuo-Bot Durchschnitt von B- unterschreiten.\n\nDaher ist es eine gerechtfertigte Note.","replies":[]},{"poster":"Humpelstilzche","date":"2018-11-04T15:36:44.624+0000","up_votes":1,"down_votes":0,"body":"Das liegt daran, dass nicht nur die KDA zählt, sondern auch jede Menge anderer Stats. Und natürlich zählen diese Stats in Bezug auf die Länge des Spiels.","replies":[{"poster":"Amycos Cyrus","date":"2018-11-04T16:07:29.660+0000","up_votes":1,"down_votes":0,"body":"Um dir einen Überblick über die Stats zu machen, kannst due einfach mal im Register Stats gucken, was für Stats gefragt sind, und welche Leitung man für sie benötigt.\n(Ich vermute, dass das Stat-Register auf dem selben Wertungssystem aufbaut, da es auch von S+ bis D wertet.)","replies":[]}]}]}