{"poster":"Mr Portugas","date":"2016-09-12T11:48:46.878+0000","title":"Ranked 3v3","subforum":"Discussioni generali","embed":{"description":"Regione Programma giorni feriali (durata) Programma fine settimana (durata) Classificate 3v3 BR 20:00 - 2:00 BRST (6 ore) 20:00 - 2:00 BRST (6 ore) Sì EUNE 17:00 - 23:00 CEST (6 or...","url":"https://support.riotgames.com/hc/it/articles/209964886","image":"http://p6.zdassets.com/hc/settings_assets/43400/200033224/PPdMQgJ1pY2QOw3T6eTmCg-logo.png"},"up_votes":2,"down_votes":2,"body":"Buongiorno gente!\r\nCredo sia assurdo che ci siano degli orari per poter giocare le partite classificate di squadra! Questi orari sono vincolanti per le persone che spesso lavorano o hanno altri impegni che non gli consentono di giocare nei momenti previsti dal calendario! Mi piacerebbe che la situazione tornasse ad essere la medesima dell&#039;anno scorso. Voi che ne pensate?","replies":[{"poster":"Mr Portugas","date":"2016-09-13T14:18:45.268+0000","up_votes":1,"down_votes":0,"body":"E comunque sia oggi neanche le hanno attivate!!! SCANDALOSO. Siamo a fine season e non posso manco passarmi il piacere di giocare con i miei amici le 3v3...","replies":[]},{"poster":"Frattaglia","date":"2016-09-12T12:36:17.469+0000","up_votes":1,"down_votes":0,"body":"Che sarebbe bello ma che purtroppo ci sono orari in cui ci sono troppe poche squadre in coda per garantire dei match equilibrati. Questo gli anni passati portava anche ad abusi, c'erano squadre che si mettevano in coda in piena notte \"scambiandosi\" le vittorie e ottenendo in modo non meritato dei posti in challenger (parlo delle 3v3).\n\nPenso che sia questo il motivo che li ha portati a limitare gli orari.","replies":[{"poster":"Mr Portugas","date":"2016-09-12T13:02:34.610+0000","up_votes":1,"down_votes":1,"body":"Capisco, però ci sono diversi modi per poter risolvere un problema del genere.. limitare le code a degli orari vuol dire limitare i giocatori stessi a quegli orari e perdere tutti quei giocatori che non possono invece rispettare il calendario...","replies":[]}]}]}