{"poster":"Dean Thusam","date":"2016-09-10T19:17:36.717+0000","title":"Importante dar segundas oportunidades","subforum":"Charlas Generales","up_votes":1,"down_votes":6,"body":"Hola gente espero que anden muy bien, mucho no hablo en el foro y es mi primer post que hago digamos. Me acercaba al post para dar mi opini&oacute;n sobre la restriccion de chat, opino que esta bueno la restriccion de chat cuando uno flamea y digamos que lo creo muy necesario, pero dar solo una oportunidad para cambiar, esto de dar solo una oportunidad para cambiar para mi es lo que no estoy de acuerdo.\r\nEmpecemos con mi historia y creo que a varios de ustedes les paso y antes que me digan &quot; no debes jugar estando mad y de m&aacute;s&quot;, valga la redundancia jugue madeado un  2 dos partidas ten&iacute;a problemas familiares y de mas y decidi jugar y la verdad que me equivoque.\r\nIgualmente despues de la restriccion me di cuenta que estaba mal y cambie totalmente , ahora soy &quot;compa&ntilde;erismo op &quot; xD, TRATO  de levantar al team siempre q flamean y apenas veo q siguen flameando los muteo ni les respondo... Lo que vengo q pedir o a poner en debate es que ( pueden advertir con la restriccion de chat pero despues de esa restriccion ahi empiezen a tener en cuenta lo de las recompensas osea, tratar  de que la primera sea un llamado de atenci&oacute;n  para que la persona sepa que est&aacute; mal y que sepa que lo va a perder todo si no cambia). En el caso de que siga con el flameo ahi si creo que merece la sanci&oacute;n de las recompensas .. Todo este es mi punto de vista no se que opina la gente y los moderadores. Tampoco se si este post esta bien ubicado. \r\n\r\nDesde ya, muchas gracias, att Vant Thusam","replies":[{"poster":"McBlack","date":"2016-09-10T20:13:29.226+0000","up_votes":2,"down_votes":1,"body":"No importa quien tiene la razon, si el flammer, el mal redactor, rito o carbonera, lo que importa aca es que a mi el bigote me queda muy bien! {{champion:201}}","replies":[]},{"poster":"xX TuOniichan Xx","date":"2016-09-10T19:42:34.278+0000","up_votes":1,"down_votes":0,"body":"La verdad, no creo que a nadie lo castiguen la primera vez. Si flameas tanto como recibir un castigo y tu mismo no te das cuenta de lo que haces para detenerte, tienes un serio problema de autocontrol.\n\nEl tema de los reportes, no se, yo creo que funcionan, pero la gente espera que su reporte siempre castigue automaticamente y que se le avise siempre que X jugador fue castigado, y no funciona así, hay que reportar a quien lo merece, incluso si alguien no te flamea a ti directamente. He visto mucha gente que ni lo intenta, y ese es el problema, primero nos olvidamos de dar Rival Honorable y Compañerismo, y luego nos olvidamos de Reportar. No valoramos ni lo bueno, ni lo malo, lo dejamos pasar por que creemos que no sirve de nada.\n\nConsejo, sigue como estas haciendo ahora, y si estas mad, pues juega, despejate, pero no te desquites con otros y no dejes que lo que te pueda llegar a decir la gente te afecte.","replies":[{"poster":"Dean Thusam","date":"2016-09-10T20:12:22.295+0000","up_votes":1,"down_votes":0,"body":"Eso estoy haciendo.. gracias por tu aporte.","replies":[]}]},{"poster":"XsR reddaS","date":"2016-09-10T19:45:55.494+0000","up_votes":1,"down_votes":0,"body":"mejora tu redacción que hace un tanto difícil leer tu post, aquí sobran muchas \"Y\" \n> valga la redundancia jugue madeado un 2 dos partidas tenía problemas familiares y de mas y decidi jugar y la verdad que me equivoque.","replies":[]}]}