{"poster":"Italianknife","date":"2020-01-03T18:49:59.621+0000","title":"Opinione personale per la Riot Games","subforum":"Discussioni generali","up_votes":1,"down_votes":3,"body":"Buona sera a tutti, mi auguro che questo post arrivi anche ai/alle signori/e della Riot Games in qualità di opinione/suggerimento.\r\nSono un giocatore di LOL da qualche anno e gioco prevalentemente nel ruolo di Supporto. Ad oggi mi sono reso conto che solo il'5% dei giocatori di LOL onora e apprezza il Supporto, onore che viene dato quasi esclusivamente dal ADC. Nonostante uno giochi una buona/ottima partita gli altri giocatori, che probabilmente non guardano come si gioca ma solo il risultato finale, onorano e si complimentano solo ed esclusivamente con il ADC che compie le uccisioni e che fa una quantità ingente di danni, ignoranto totalmente la capacità del Supporto nel permettere al ADC stesso di compiere tali azioni oppure ignoranto totalmente quando il Supporto, anche con il sacrificio della propria vita virtuale salva la loro oppure permette alla squadra di conquistare un obiettivo. E' davvero frustrante giocare bene e non ricevere mai un complimento, non ricevere onore e soprattutto e sconfortante che la Riot Games non cerchi di istruire soprattutto i nuovi giocatori ad aprrezzare e rispettare il giocatore che prediligie il ruolo di Supporto, che specifico a tutti non è il Supporto del ADC ma **è il Supporto di tutta la squadra**. E' irritante quando un ADC al posto di lasciarti uccidere un minion, nonostante uno abbia l'oggetto idoneo e le \"palle che girano\" ad indicare a tutti che c'è la condivisione di oro ed esperienza, faccia di tutto per impedirti di prenderlo utilizzando addirittura le abilità del personaggio scelto per ottenere quei pochi spiccioli. E' irritante vedere come molti giocatori di Giungla utilizzino addirittura la Punizione per uccidere un minion pur non lasciare al Supporto la possibilità di \"elemosinare\" quel piccolo numero giallo che verrebbe condiviso. E' irritante quando anche chiedendo gentilmente al giocatore di turno di lasciare \"farmare\" il minion tali richieste vengano non solo ingorate ma, molte volte sono motivo di insulti da parte di tutti i giocatatori perché tanto il Supporto non può e non deve farmare tanto l'oro arriva col tempo. E' irritante quando l'ADC continua a giocare da solo nella corsia ignorando che il Supporto è tornato alla base per acquistare 1 oggetto oppure per rigenerare la vita che ha perso per salvare l'ADC o semplicemente perché ha osato più del dovuto. E' fastidioso quando l'ADC continua imperterrito nell'avventura solitaria facendo perdere esperienza al Supporto e se muore è colpa dell'assente anche se giustificato.\r\nVorrei tanto che per la prossima stagione la Riot Games ponga una maggiore attenzione nel disciplinare gli oggetti dedicati al supporto e soprattutto vorrei che aggiunga nuovi testi durante il caricamento delle partite che facciano capire a tutti i giocatori che il Supporto non è uno stupido che non sa usare 4 tasti e 1 mouse ma è un giocatore che predilige essere di aiuto alla squadra e non è un giocatore solitario come lo possono essere i giocatori negli altri ruoli. \r\nGrazie per aver letto questo messaggio con l'augurio che nella prossima partita avrai maggiore riguardo nei confronti del Supporto e che se ha giocato bene darai la giusta considerazione alle sua azioni.","replies":[{"poster":"V3LK0ZMAST3R","date":"2020-01-03T20:09:09.201+0000","up_votes":2,"down_votes":0,"body":"La riot ha dedicato letteralmente due season a incentivare l'importanza del ruolo del support,sia in qualità di itemizzazione, che efficacia che di importanza della bot lane stessa che con l'autofill. Al momento il supporto e uno dei ruoli più \"sani\", personalmente i complimenti li ricevo di rado li come in qualsiasi altro ruolo, con gli Honor é pure più facile prenderli da supp (seppur sia più difficile prenderne 3-4 a botta).\nSe non riesce a lasthittare i Minion con l'oggetto da supp sbagli qualcosa, visto che li giustizia a un buon quantitativo di Hp. Fatto sta che il supp é effettivamente il più semplice dei 5 ruoli ( non meno importante ). Se l'adc rimane da solo quando muori o recalli non é detto sia una brutta idea, in questo modo prende un sacco di exp in più, poi che facciano %%%%%% quando roammi o recalli é un altro discorso e capita spesso.\nSe come supp non ti senti calcolato probabilmente non hai davvero un grosso impatto nel game, ma se senti di aver svolto un buon lavoro non hai bisogno di nessun Honor o complimento per sentirti realizzato","replies":[]},{"poster":"parky82","date":"2020-01-06T17:32:49.144+0000","up_votes":2,"down_votes":1,"body":"non sono d'accordo che il ruolo del support sia uno dei piu semplici anzi forse è uno dei piu difficili dopo la giungla cmq tutti i ruoli hanno difficoltà ma dire che il supporto è semplice quando deve proteggere il suo adc fare in modo che farmi abbastanza tranquillo fare in modo che abbia visione per non essere gankato facilmente e per la fase di corsia giocare sempre contro 2 con il rischio che si raddoppino con giungler e mid o top di ausilio ps deve essere bravo anche nel ragruppamento ad utilizzare bene scudi effetti di controlli sfinimenti guarigioni garantisco non è per niente semplice e se nella squadra hai un buon supporto hai buone probabilità di vincere la bot e perchè no con almeno un'altra linea buona vincere la partita","replies":[]},{"poster":"Italianknife","date":"2020-01-05T21:35:37.611+0000","up_votes":1,"down_votes":0,"body":"Mi dispiace doverti contraddire, se la Riot ha implementato il sistema dell'onore evidentemente bisogna usarlo altrimenti a che serve? In questo gioco i livelli sono estremamente importanti tanto quanto l'oro. Se sono sotto di 1, 2 oppure 4 livelli come spesso succede rispetto ai giocatori della corsia centrale e superiore mi è praticamente impossibile andare ad aiutare le altre corsie tranne che con campioni che attaccano dalla distanza; Con tutti campioni che attaccano da vicino oppure che hanno abilità che li portano a strettissimo contatto con l'avversario capisci bene che avere una differenza di livelli così importante implica una estrema difficoltà nel girovagare per le altre corsie soprattutto quando i giocatori pensano solo a loro stessi ignorando totalmente gli altri giocatori (parlo ovviamente del bronzo dove sono inchiodato). Su una cosa sono d'accordo con te, non mi servono onore o complimenti ma per quello che ho detto all'inizio del post se ci sono andrebbero usati.\nForse sono io che sbaglio a pensare sul fatto che fare il 60-65% di partecipazioni alle uccisioni e salvare le vite virtuali degli altri non sia un buon motivo per essere onorato. E' più corretto onorare che fa le uccisioni oppure chi fa la prima uccisione oppure ancora che distrugge la prima torre.","replies":[{"poster":"V3LK0ZMAST3R","date":"2020-01-06T06:30:42.870+0000","up_votes":1,"down_votes":0,"body":"Si onora chi e se si vuole onorare, non c'é vincolo nel farlo e sicuramente non esiste vincolo che debbano onorare te. Il fatto che non ti arrivino quanto vorresti non é indice che il sistema onori non venga utilizzato. Oltrettutto non c'é nemmeno l'onore riservato a \"chi ha fatto meglio o chi ha più partecipazione kill\", i parametri per cui assegnarli sono totalmente soggettivi. Come già detto poi il ruolo del supp é più che importante al momento ed é pure quello che solitamente prende gli onori più facilmente (che era il punto della tua discussione). A me capita più che spesso di giocare supp e prendere 2-3 onori e giocare mid-top, hardcarriare 1 vs 9 e non prenderne nemmeno uno,sticazzi, é uno specchio per allodole che non offre praticamente nulla sopra il LV 2.\nPoi per il resto della tua risposta, non prenderla come offesa, ma capisci da te che se sei inchiodato da varie season nell'elo riservato di norma ai principianti é più che evidente tu non stia facendo così bene come credi. I k/d/a sono buoni ma valgono fino a una certa (specialmente da supp da utility,dove i k/d/a buoni si fanno anche senza far nulla di che), a livello di build investi spesso male quei pochi Gold che hai (es {{item:3065}}, {{item:3742}}  e {{item:3800}}  non servono a una cippa su Leona e Nauti, o il {{item:3143}} che é un item che di base fa schifo e tu prendi anche contro poco o nulla danni Crit, o ancora il {{item:3109}}  1 item quando non sei abbastanza resistente per addossarti altri danni,oppure non prendere mai le {{item:3117}} ecc ecc..) ,se poi ti trovi già sotto di 3-4 livelli significa tu ti sia mosso molto tardi, inoltre con champ come Leona o Nautilus ma dei supp da utility in generale il livello è molto relativo, devi aiutare non fare gli 1 vs 1 (anche se in realtà con build un po' offensive con Nautilus é più che fattibile)\nPS: se non usi l'opzione \"rispondi\" la notifica non arriva","replies":[{"poster":"Italianknife","date":"2020-01-07T11:39:50.137+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=V3LK0ZMAST3R,realm=EUW,application-id=MJVj50Jw,discussion-id=BZ4rwALq,comment-id=00010000,timestamp=2020-01-06T06:30:42.870+0000)\n>\n> Si onora chi e se si vuole onorare, non c'é vincolo nel farlo e sicuramente non esiste vincolo che debbano onorare te. Il fatto che non ti arrivino quanto vorresti non é indice che il sistema onori non venga utilizzato.\n\nNon ho mai detto che devo essere onorato oppure essere l'unico a dover meritare onore. Mi da però fastidio che tutta la squadra faccia i complimenti solo al ADC, perché è riuscito a fare una doppia uccisione, senza dare il giusto merito anche al supporto (non per forza io ma è un discorso in generale). Mi da fastidio quando tutta la squadra si complimenta con l'ADC perchè negli scontri di squadra fa una quadrupla senza dare considerazione al supporto che magari è riuscito a fare un blocco su 4 avversari permettendo la quadrupla uccisione.\n\n>Oltrettutto non c'é nemmeno l'onore riservato a \"chi ha fatto meglio o chi ha più partecipazione kill\", i parametri per cui assegnarli sono totalmente soggettivi. \n\nSono pienamente d'accordo; Nessuno è obbligato a dare l'onore (anche se fin troppo spesso i giocatori dimenticano di onorare per la fretta di giocare la partita successiva).\n\n>Come già detto poi il ruolo del supp é più che importante al momento ed é pure quello che solitamente prende gli onori più facilmente (che era il punto della tua discussione). A me capita più che spesso di giocare supp e prendere 2-3 onori e giocare mid-top, hardcarriare 1 vs 9 e non prenderne nemmeno uno,sticazzi, é uno specchio per allodole che non offre praticamente nulla sopra il LV 2.\n\nIo che gioco solo con gruppi non organizzati ho sempre avuto difficoltà ad avere onore anche giocando una buona partita. Inoltre ho difficoltà a comunicare con gli altri perché secondo gli altri giocatori il supporto non può dire quali obiettivi fare, che strategie adottare e ribadisco nuovamente, il supporto seppur dotato di un oggetto per condividere oro ed esperienza non deve uccidere i minions.\n\n> Poi per il resto della tua risposta, non prenderla come offesa, ma capisci da te che se sei inchiodato da varie season nell'elo riservato di norma ai principianti é più che evidente tu non stia facendo così bene come credi. \n\nHo fatto anche io la tua stessa considerazione ed in effetti in passato ho sempre osato più del dovuto facendo numerosi errori. Ma da 2 stagioni il mio modo di giocare è migliorato parecchio. Purtroppo come supporto non posso essere incisivo in una partita ma posso limitarmi ad essere di aiuto alla squadra; Il problema sorge quando la squadra che mi capita è indecente, giocatori che pensano solo a se stessi o ancor peggio giocatori che non hanno minimamente idea di come si gioca; giocatori che provano per la prima volta un nuovo campione in una partita classificata, gente arrogante che pensa che siccome usa un assassino può uccidere tutti gli avversari da solo ecc ecc. Forse un giocatore che è inchiodato in un elo basso non sempre ha tutte le colpe essendo LOL un gioco di squadra dove ogni singolo giocatore ha un ruolo fondamentale.\n\n>I k/d/a sono buoni ma valgono fino a una certa (specialmente da supp da utility,dove i k/d/a buoni si fanno anche senza far nulla di che), a livello di build investi spesso male quei pochi Gold che hai (es {{item:3065}}, {{item:3742}}  e {{item:3800}}  non servono a una cippa su Leona e Nauti, o il {{item:3143}} che é un item che di base fa schifo e tu prendi anche contro poco o nulla danni Crit, o ancora il {{item:3109}}  1 item quando non sei abbastanza resistente per addossarti altri danni,oppure non prendere mai le {{item:3117}} ecc ecc..) ,se poi ti trovi già sotto di 3-4 livelli significa tu ti sia mosso molto tardi, inoltre con champ come Leona o Nautilus ma dei supp da utility in generale il livello è molto relativo, devi aiutare non fare gli 1 vs 1 (anche se in realtà con build un po' offensive con Nautilus é più che fattibile)\n\nSo bene che gli oggetti che uso non sono perfetti... se non fosse che con una squadra casuale sono necessari in quanto manca la sinergia, la sintonia e molto spesso la capacità di giocare bene in squadra pertanto ho bisogno di avere delle protezioni a prova di carro armato. \nMi fa piacere che sei andato a guardare lo storico delle mie partite, lo apprezzo veramente perché vuol dire che non sei il tipico giocatore che parla perché è nascosto dietro ad un monitor.\n\n\n> [{quoted}](name=parky82,realm=EUW,application-id=MJVj50Jw,discussion-id=BZ4rwALq,comment-id=0002,timestamp=2020-01-06T17:32:49.144+0000)\n>\n> non sono d'accordo che il ruolo del support sia uno dei piu semplici anzi forse è uno dei piu difficili dopo la giungla cmq tutti i ruoli hanno difficoltà ma dire che il supporto è semplice quando deve proteggere il suo adc fare in modo che farmi abbastanza tranquillo fare in modo che abbia visione per non essere gankato facilmente e per la fase di corsia giocare sempre contro 2 con il rischio che si raddoppino con giungler e mid o top di ausilio ps deve essere bravo anche nel ragruppamento ad utilizzare bene scudi effetti di controlli sfinimenti guarigioni garantisco non è per niente semplice e se nella squadra hai un buon supporto hai buone probabilità di vincere la bot e perchè no con almeno un'altra linea buona vincere la partita\n\nSono pienamente d'accordo con te. Il supporto è un ruolo importantissimo soprattutto quando negli scontri 5vs5 si è in prima linea a subire ingenti danni misti per cercare di bloccare o quanto meno rallentare gli avversari in modo che l'ADC o gli assassini possano cercare di vincere lo scontro. ","replies":[{"poster":"V3LK0ZMAST3R","date":"2020-01-08T06:38:49.157+0000","up_votes":1,"down_votes":0,"body":"Ricordati sempre una cosa, se sei INCHIODATO in un certo elo,qualsiasi esso sia, la colpa é solo tua. Il ruolo del supp limita nel carriare ma d'altra parte limita i danni di quando giochi male, quindi scalare da support é un processo più facile ma indubbiamente anche più lento. Questo per dire che se esempio vado a smurfare in low elo, da mid magari torno diamond  in 100 game, da support magari ce ne metterò 150, ma MAI rimarrei bloccato. I player arroganti, i 1 time, gli inter ecc ecc.. ti assicuro che ci sono li come a diamond, e no, la situazione nemmeno migliora come potresti credere. I player indecenti capitano a te come agli avversari, i game già persi (come quelli già vinti) ci sono sia chiaro, ma non sono quelli a tenerti fermo.\nIl problema degli item che prendi é che sono davvero solo Gold buttati, questo perché:\n- gli item da tank fanno schifo di base da alcune season\n- sono item che costano troppo e un supp non può permettersi (in linea di massima) senza rimanere indietro. \n- essendo tu un supp, sottolivellato e con pochi Gold, avere quell'item da tank non ti aiuta comunque, instaesplodi lo stesso,da support é importantissimo ottimizzare le spese. Piuttosto gli item da vero supp, costano meno, portano un sacco di utilità e ti rendono comunque un po' più tank (vedi es {{item:3190}} , {{item:3107}} )Andare di item puramente tank sul supp va bene come 5-6 (es con {{item:3193}}) non prima (anche in questo caso in alternativa alla {{item:3065}} che non sfrutti visto la mancanza di cure, ci sono {{item:3194}} e {{item:3001}} ). Per farti un esempio, se buildi {{item:3143}} +{{item:3047}} +{{item:3065}}  (quindi 2 item più boots) non tanki  abbastanza,0 utility e 0 danno e nel tutto hai  speso quasi gli stessi Gold per buildare {{item:3117}} +{{item:3050}} +{{item:3190}} + {{item:3109}} (3 item + boots)\n- i boots sono opzionabili, ma tendenzialmente le {{item:3117}} su champ del genere vanno sempre meglio dato che costano meno e a champ così avere quel boost di ms sia per entrare in range di CC, sia per roammare é davvero importante.\n- il {{item:3109}}  va bene, ma non come 1 item (eccetto su {{champion:44}}  e {{champion:12}}  che hanno sustain e sono molto tankosi di base). Non riuscirai a sfruttarlo e inoltre nelle fasi iniziali é sempre meglio puntare sui danni per prendere vantaggio. Quindi se punti su build utility opta quasi sempre su {{item:3050}} 1 item.\nNon é questione di sinergia con il team., ma proprio di inefficacia di quelle build fidati. \nIn generale gli item hanno un costo più o meno bilanciato nel complesso di ciò che danno, il non sfruttare a pieno (o quasi) quell'item vuol dire che stai sprecando un sacco di Gold (es:{{item:3143}} oltre ad essere già un item pessimo di suo, non necessiti dell'attiva visto che sei già pieno di CC)\nPer i minion basta che te li prendi, non é che devi chiedere il permesso, se flammano muti,se spampingano muti, non perdere tempo a dare spiegazioni. Per le call se ti seguono bene,altrimenti non puntarti e segui il loro game. In generale (a prescindere dal ruolo) non devi autoproclamarti leader, ma i ping e le call puoi farle, solo non devi aspettarti vengano sempre seguite (e qui devi adeguarti di conseguenza). Migliorando aumenteranno le vittorie, l'elo così come gli onori.\nUn ulteriore consiglio: cerca di giocare ogni tanto altri ruoli, in particolar modo mid e jng (non necessariamente in ranked) così da capire meglio come comportarti con il roaming.","replies":[]}]}]}]}]}