{"poster":"Sangsau","date":"2016-11-01T06:00:25.198+0000","title":"Ping is around 250 - 320.","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I'm originally from Vietnam, but I have to say that most of people here can't play as serious. They bought accounts, or they let somebody play for their ranks and shit, or borrow accounts. But evenly, I'm at Diamond V and I see these people play like they are Gold or just Platinum, I'm not saying that I'm a professional player but if you see it, you'll know. I have watched and now reached to this server for just training myself. But when I get ingame, my ping is so high, it was around 280 and 300. I've searched everything to lower the ping but it didn't work, some people said because I'm from Vietnam, and that IP or something has fucked me up. Now, can somebody helps me with this ? I really want to play Korean or NA but what I can do is just NA, Korean is too hard and I can't even reach into their forums. \r\nI've tried WTFast too but it didn't work, I've tried everything. Now, if somebody has an idea or something for me, please cmt at the bottom and let me know please. \r\nI thank to you all for reading it.","replies":[{"poster":"Targons Blade","date":"2016-11-01T23:29:32.259+0000","up_votes":1,"down_votes":0,"body":"High latency (ping) like this are often caused by routing issues to our servers and are sometimes exacerbated by certain network settings that conflict with League. Before we investigate into potential routing issues, I'd like you to work through our [connection guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to ensure that your local network settings are compatible with League.\n\nLet me know if those steps caused any change.","replies":[{"poster":"Sangsau","date":"2016-11-02T11:15:28.643+0000","up_votes":1,"down_votes":0,"body":"People say because I'm at Vietnam and this IP from Vietnam, so it makes some difficulties to us and the ping will be high. I've looked that thread but I didn't see where it says high ping or something. It just happens to NA server. I've never tried the others before but in SEA my ping is 80, it's okay. I hope you can help me, I wanted to play this server since last year but I couldn't try due to this.","replies":[{"poster":"Targons Blade","date":"2016-11-02T21:58:11.484+0000","up_votes":1,"down_votes":0,"body":"Can you try all the steps in that connection guide and let me know if you still have high latency (ping)?","replies":[{"poster":"Sangsau","date":"2016-11-03T05:40:46.447+0000","up_votes":1,"down_votes":0,"body":"Honestly I did, but it didn't work for me. I really want to play this server, am I able to play? I mean about my ping.","replies":[{"poster":"Targons Blade","date":"2016-11-03T21:01:01.857+0000","up_votes":1,"down_votes":0,"body":"In that case, this is likely caused by both your physical distance from the servers, and potentially some poor routing to them. We can check your route by running a traceroute log using [WinMTR](http://winmtr.net/). After opening the app, plug **104.160.131.1** into the host field, then start the trace. After 5 minutes has passed by, export the result of your trace as **text** and paste them in a reply to me.\n\nLet me know if you run into any issues completing those steps.","replies":[{"poster":"Sangsau","date":"2016-11-04T05:22:17.755+0000","up_votes":1,"down_votes":0,"body":"You mean this?\n\n\n|------------------------------------------------------------------------------------------|\n|                                      WinMTR statistics                                   |\n|                       Host              -   %  | Sent | Recv | Best | Avrg | Wrst | Last |\n|------------------------------------------------|------|------|------|------|------|------|\n|                             192.168.1.1 -    0 |  666 |  666 |    0 |    0 |    5 |    0 |\n|                            100.123.0.94 -   10 |  479 |  435 |    0 |  116 | 4220 |  159 |\n|                           183.80.133.73 -   11 |  467 |  419 |    0 |  135 | 4547 |   22 |\n|                           100.123.0.251 -    9 |  485 |  445 |    0 |  152 | 4195 |    1 |\n|                          118.69.241.181 -   10 |  483 |  439 |    0 |  124 | 4209 |  245 |\n|                          118.69.132.181 -   11 |  456 |  406 |    0 |  135 | 4558 |   41 |\n|                          118.69.132.174 -   10 |  480 |  436 |    0 |  136 | 4061 |  202 |\n|                           118.69.163.73 -   11 |  459 |  410 |    0 |  227 | 4026 |  128 |\n|riotsgamesdirect.as6507.any2ix.coresite.com -   12 |  452 |  402 |    0 |  248 | 4043 |  532 |\n|                          104.160.133.35 -   12 |  450 |  400 |    0 |  239 | 4241 |   97 |\n|          ae36-br01.chi01.riotdirect.net -   14 |  429 |  370 |    0 |  244 | 2233 |  263 |\n|                           104.160.131.1 -    1 |  658 |  656 |    0 |  235 |  664 |  190 |\n|________________________________________________|______|______|______|______|______|______|\n   WinMTR v0.92 GPL V2 by Appnor MSP - Fully Managed Hosting & Cloud Provider","replies":[{"poster":"Targons Blade","date":"2016-11-06T21:29:05.926+0000","up_votes":1,"down_votes":0,"body":"Yup, that's the one. \n\nThis traceroute reveals you encounter packet loss along your entire route to the servers, which starts at the first hop outside of your home network. A consistent rate of ~10% packet loss will certainly cause strange behavior and delays in-game, paired with the 4000+ms of latency as well.\n\nYou'll certainly want to reach out to your ISP about these issues and be sure to provide them with a copy of this traceroute for additional context. Let me know if you have any further questions.","replies":[{"poster":"Sangsau","date":"2016-11-07T04:52:52.921+0000","up_votes":1,"down_votes":0,"body":"So, all I want is just play in NA. I've reached to the softwares that helped my ping but it didn't work, I came to the Gcafe Net and it was still at 280. What shall I do to play in this server now? Isn't there some ways else to play?","replies":[{"poster":"Targons Blade","date":"2016-11-07T21:49:42.321+0000","up_votes":1,"down_votes":0,"body":"Your physical distance from the server and the fact that your connection has to travel so far just to reach our servers is going to cause high latency. Realistically, latency in the 200's is to be expected from where you are now. If you can, you can reach out to your Internet Service Provider about this with those traceroutes, but if you're using a netcafe, that doesn't seem like an option.\n\nYou can try using a VPN such as [Hotspot Shield](https://www.hotspotshield.com/) or [WTFast](https://www.wtfast.com), however, they may or may not lower your latency. Let me know if you have any other questions.","replies":[]}]}]}]}]}]}]}]}]}]}