{"poster":"Skiipee","date":"2016-02-03T03:42:51.599+0000","title":"Guia para subir en soloq","subforum":"Charlas Generales","up_votes":4,"down_votes":1,"body":"Hola gente, les traigo una guia para subir facil y eficazmente en el soloq sin necesidad de tener habilidad/mecanicas. No importa que tengas lag, simplemente tenes que seguir estos pasos:\r\n\r\n1) Si sos de Argentina o Uruguay, y tenes la suerte de ser amigo de 4 jugadores de nacionalidad chilena, pediles para hacer premade. PERO OJO, solamente es recomendable que sea 1 argentino/uruguayo por equipo, ya que tener 2 o mas puede hacer fallar esta guia.\r\n\r\n2) Meter queue para ranked, al fin y al cabo, que podria salir mal? Si no hay lag en el server todos podrian jugar en igual de condiciones, pero en caso de que haya lag no hay problema, simplemente tenes que quedarte quieto spammeando laugh mientras tus 4 compa&ntilde;eros amablemente pushean una lane, y como plus, no olvides de disfrutar esos hermosos mensajes de la gente quejandose de que a 3/4 del servidor le anda mal y no da derrota evitada, te moriras de risa.\r\n\r\n3) Otra estrategia para jugar ranked y no perder lp en el intento es preguntar si a los jugadores de chile en el momento tienen 5-10 ms de mas, ya que esto significa que activaran derrota evitada y esta mas que perfecto. Que clase de criatura malvada no daria derrota evitada por que alrededor del 30% tiene 10 ms de mas? Serie imperdonable siquiera imaginarse algo asi.\r\n\r\nGracias a todos por tomarse el tiempo de leer mi super guia para climbear en Las de forma rapida y eficiente. Saludos.\r\n\r\n\r\nPD: NOTESE EL SARCASMO.","replies":[{"poster":"MaiooSL","date":"2016-02-03T03:51:09.971+0000","up_votes":2,"down_votes":0,"body":"Asco de servidor. El problema somos nosotros porque le damos de comer pagando rp a estos giles a pesar del juego que nos dan es un ASCO","replies":[{"poster":"Apocalyptopy","date":"2016-02-03T04:34:12.876+0000","up_votes":2,"down_votes":0,"body":"Despedite de tu cuenta maquilince","replies":[]}]},{"poster":"PpunisherR","date":"2016-02-03T03:45:23.173+0000","up_votes":2,"down_votes":0,"body":"{{sticker:zombie-brand-clap}} crack","replies":[]},{"poster":"Federace","date":"2016-02-03T04:20:02.934+0000","up_votes":1,"down_votes":2,"body":"Buen post tucan mistico de los montes siberianos del sureste, pero quedaria mejor si hubiese sido un poco mas origninal tigre de bengala potenciado por uranio enriquesido de los desiertos de Kazajistan. Van mis +10, denuciado, -8, bloqueado, desfaveado, vuelto a bloquear, posteado en mi fb en publicacion marcada, desbloqueado. Asi que despedite de tu cuenta bombardero cosmico del septimo comando irani de los altos cargos galacticos Mira lince galactico del valle artico de la galaxia de andromeda, verdaderamente tu post me parece muy malo papu, por que? Porque me parece que no te tomaste el tiempo para analizarlo, solo posteas lo primero que te sale del orto, lo captas pibe? Antes de postear lee bien tu post, todos los dias es lo mismo contigo hijo de la re mil putas, todos los dias tengo que estar viendo tus posts de mierda, no te basta con publicar tus puterias una vez, NO! Todo el dia estas pegado a la pc pensando en que mierda publicar, ya me tenes las bolas llenas rufian de pacotilla, asi que escuchame bien pendejo del orto, ve despidiendote de tu cuenta dragon milenario de 3 cabezas de la antigua babilonia, en este momento te denuncio y fiuu te despedis de tu cuenta, -10 y denunciado pero TE DIGO UNA COSA MASTER? Una sola cosa nomas queria decirte, me agrado mucho tu post, en serio, es de lo mas sensacional que he visto por el momento, es una obra de arte, sin exagerar, es algo que, a simple vista. podria haber sido echo por el mismisimo Da Vinci, la genialidad que tiene se puede notar desde kilometros de distancia, ni siquiera la peor de las malas lenguas podria decir que no nos encontramos ante una majestuosidad vista una sola vez cada mil años. no he visto en todos mis años de vida algo de esta magnitud , te provoca una sensacion indescriptible, una alegria inmensa a pesar de no haber echo accion alguna, un sentimientoraro de encontrar pero fantastico, algo asi como lo que se siente una brisa en un caluroso verano, o ver la alegria de un niño al abrir sus regalos de navidad, o simplemente estar con esa persona que tanto queremos. No hagas caso a las malas lenguas que critican sin cesar a cualquiera que no cumpla con absolutamente todas sus expectativas, solo creeme a mi y a todos aquellos seres que consideran y admiran a tan grandiosa obra de arte. Siempre va a haber personas que te van a decir que lo que hiciste no tiene valor, pero el secreto esta en ignorarlas, esas personas darian lo que fuera por haber creado algo tan magnifico como lo que estamos viendo. Asi como Dios en su infinita sabiduria creo a la humanidad, o asi como un hombre enamorado crea un poema para expresar sus mas profundos sentimientos, o como un pintor crea una obra de arte de algun tiempo que ni siquiera el conoce, asi es como fue creado este post, de la misma forma. Puede parecer que estoy exagerando , repito, pero no es asi, ni de cerca, exageraria al decir que no me encuentro ante una creacion admirable, increible, de una belleza de proporciones biblicas. De escho estoy tan encantado con semejante aporte que decidi escribir un poema al respecto, se titula \" Mis ojos te lo agradecen \", aqui va : \" Mis ojos te lo agradecen, ya que han sido acariciados, mis sentimientos te alaban, ya que han sido despertados, mi corazon te idolatra, porque lo has echo bailar,y mi ser te dice gracias, por tan delicioso manjar , estare esperando nuevamente, que me compartas la alegria , aun es medio de la noche, o en el mas radiante dia, solo sigue creando, creando hasta que las manos pesen, asi te dire nuevamente, mis ojos te lo agradecen\" . Espero que hayas disfrutado mi poema tanto como yo disfrute escribiendolo, te diria que lo disfrutes como yo disfrute tu post, pero no creo que haya situacion en el mundo que se asemeje a tanta dicha. Para terminar siendo breve, le quiero agradecer de corazon, uno en esta vida se encuentra con situaciones que lo ponen de malas, piensa que no va encontrar nada bueno en estos dias y de repente se encuentra con algo asi, es dificil decidir donde uno va a dejar sus puntos, y de echo ya cansa denunciar la mayoria de los post que vé, siendo que muchos creados por trolls y personas con ganas de molestar, nada que ver con lo que estamos observando, aqui uno piensa todo lo contrario, simplemente lo ve y se dice a si mismo \" no debe haber lugar en esta tierra, ni en el cielo, ni en el inframundo, ni en otros planetas, galaxias o universos, donde sea mejor dejar mis puntos, he encontrado la verdadera Atlantida, aunque no sea un lugar fisico, su simple belleza es suficiente para no titubear en hacer dicha comparacion\" . A veces me pregunto cuanta destreza o cuanta habilidad hace falta tener para poder realizar una creacion de esta indole, a veces me comparo con los creadores de hermosuras como esta y pienso que no soy siquiera un simple ser humano, al lado de dichos creadores me siento como una hormiga frente a un imponente elefante, como un peon al lado de una reina, como un niño frente a un superheroe","replies":[{"poster":"The Mystic","date":"2016-02-04T00:57:45.428+0000","up_votes":1,"down_votes":0,"body":"Me va a costar leerlo, pero bueno :'v","replies":[]}]},{"poster":"GodA 1826","date":"2016-02-03T04:15:40.335+0000","up_votes":1,"down_votes":0,"body":"Ya soy CHASHENSHER(?{{summoner:11}} {{summoner:11}} {{summoner:11}} {{summoner:11}} {{summoner:2}} {{summoner:13}}","replies":[]},{"poster":"naic","date":"2016-02-03T04:14:37.626+0000","up_votes":1,"down_votes":0,"body":"10/10 perro, a favoritos lince","replies":[]},{"poster":"Viejo verdoso","date":"2016-02-03T04:07:54.079+0000","up_votes":1,"down_votes":0,"body":"Pa que quiero una guia si no anda el server","replies":[{"poster":"Skiipee","date":"2016-02-03T04:08:17.114+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KasiKE21,realm=LAS,application-id=v7qsfXsE,discussion-id=7V0NEVEx,comment-id=0003,timestamp=2016-02-03T04:07:54.079+0000)\n>\n> Pa que quiero una guia si no anda el server\n\nLeiste siguiera? ahi te da la solucion","replies":[]}]},{"poster":"Meet the enemy","date":"2016-02-03T03:44:31.526+0000","up_votes":1,"down_votes":0,"body":"10/10. Denle un premio al muchacho","replies":[]}]}