{"poster":"lagartor","date":"2015-10-21T23:34:59.559+0000","title":"Sobre los auto ataques","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Pos eh visto gente en youtube y adc que autoatacan mientras corren por ejemplo con Kalista. La cosa es que me gustaria saber como hacen eso. porque yo tengo que clickar para pegar y otro para correr ._.","replies":[{"poster":"FurchiDC","date":"2015-10-22T05:48:58.689+0000","up_votes":1,"down_votes":0,"body":"Lo que usan es el click con ataque al objetivo mas próximo, para no desplazarse hacia el que te persigue si le erras el click. Está como Shift+Click Derecho en el cliente.","replies":[]},{"poster":"Revolución","date":"2015-10-22T00:14:51.183+0000","up_votes":1,"down_votes":0,"body":"De lo que estás hablando es de kiteo. El kiteo es una técnica que se usa sobre todo en tiradores, que trata de aprovechar el enfriamiento entre un ataque básico y el otro para desplazarse y seguir atacando mientras uno se aleja de su objetivo conservando el conveniente rango. Kalista particularmente tiene una pasiva orietnada a este ejercicio, pero es una técnica que te conviene dominar con todos los tiradores.\n\nUna forma es la de hacer los clics sobre el objetivo y sobre el territorio intercaladamente, pero para la forma segura de hacerlo (porque un clic mal hecho puede significar ponerte en gran peligro) es usando el comando attack move, que viene por defecto en la tecla A y se puede asignar a otra tecla.","replies":[]},{"poster":"Deigex","date":"2015-10-21T23:37:20.435+0000","up_votes":1,"down_votes":0,"body":"Usan Attack move, basicamente mientras corren tocan una tecla la cual hace pegarle al objetivo mas cercano para poder kitear de forma mas eficiente, imaginate que hacerlo con el mouse si pifias un click hacia el que queres pegarle y lo das al piso te le pones a melee y gg, son formas distintas de utilizarlo y hay dos o tres configuraciones dentro del juego que se pueden realizar fijate en la configuracion de teclas.","replies":[{"poster":"martincarp","date":"2015-10-22T00:03:46.529+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Deigex,realm=LAS,application-id=v7qsfXsE,discussion-id=qwOYh3A7,comment-id=0001,timestamp=2015-10-21T23:37:20.435+0000)\n>\n> Usan Attack move, basicamente mientras corren tocan una tecla la cual hace pegarle al objetivo mas cercano para poder kitear de forma mas eficiente, imaginate que hacerlo con el mouse si pifias un click hacia el que queres pegarle y lo das al piso te le pones a melee y gg, son formas distintas de utilizarlo y hay dos o tres configuraciones dentro del juego que se pueden realizar fijate en la configuracion de teclas.\n\nLa configuración si no mal recuerdo es \"Clic de movimiento con ataque del jugador\" o algo por el estilo, si lo quieres cambiar para hacerlo más cómodo puedes fijarte ahí. La configuración predeterminada es Shift+Clic Derecho (creo que aparece como MB2 o algo así), pero puedes ponerlo en otra tecla para que sea presionar solo una y no dos.\nPor ejemplo yo lo tengo en la X, también he visto gente que lo utiliza en la barra espaciadora, otros en la A, otros en un botón extra en el mouse (los que los tienen).","replies":[]},{"poster":"lagartor","date":"2015-10-21T23:58:54.226+0000","up_votes":1,"down_votes":0,"body":"Gracias por la info","replies":[]}]},{"poster":"Platinum491","date":"2015-10-21T23:35:49.400+0000","up_votes":1,"down_votes":0,"body":"A+click derecho","replies":[{"poster":"lagartor","date":"2015-10-21T23:58:30.965+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias!","replies":[]}]}]}