{"poster":"lagartor","date":"2015-11-24T10:10:19.044+0000","title":"Velocidad de descarga del launcher","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Es exasperante ya esto, no termina mas, estoy apunto ya de dejarlo y ponerme a jugar otro moba. El hots descargo en seguida, no se porque se rebaja tanto la velocidad del launcher, pongo a descargar cualquier pavada y se descarga bien, no entiendo. de saber que seguia asi de mal esto ni lo hubiera puesto a descargar desde un principio.","replies":[{"poster":"Dim Light","date":"2015-11-24T13:16:19.294+0000","up_votes":1,"down_votes":0,"body":"sera abran tocado algo sin querer por lo del launcher nuevo que están diseñando? (esto es solo una especulación)","replies":[{"poster":"lagartor","date":"2015-11-24T14:22:25.821+0000","up_votes":1,"down_votes":0,"body":"Desde que tengo memoria el launcher descarga mal","replies":[{"poster":"Dim Light","date":"2015-11-24T19:20:18.914+0000","up_votes":1,"down_votes":0,"body":"entonces es cosa tulla ya sea tu Internet o tu pc a mi nunca me dio problemas","replies":[{"poster":"lagartor","date":"2015-11-24T19:35:30.171+0000","up_votes":1,"down_votes":0,"body":"No es ni mi pc ni mi internet porque juego HOTS o World of Warship y me va lo mas bien. Tengo curiosidad de porque siempre culpan a lo que lso demas tienen, en vez de darse cuenta que el server es un asco y el personal esta al pedo....","replies":[{"poster":"Dim Light","date":"2015-11-24T20:03:46.262+0000","up_votes":1,"down_votes":0,"body":"pero ten en cuenta que no puede ser el servidor yo me descargo el lol en una noche (eso si hay días en el que el servidor se cae y no hay por donde mirarle) pero lo que quiero decir es que tu problema no le pasa a todo el mundo por lo que el problema debe ser un problema en tu área local ya sea tu Internet o tu pc - incluso si es wifi o Internet por cable puede ser un factor -","replies":[]}]}]}]}]},{"poster":"Pablidoc","date":"2015-11-24T15:07:21.820+0000","up_votes":1,"down_votes":0,"body":"Yo cuando lo descargue en la PC, lo deje toda la noche y cuando me desperté estaba descargado","replies":[]}]}