{"poster":"lagartor","date":"2016-06-16T01:02:31.580+0000","title":"Que opinan sobre que este juego sea de pura suerte y azar?","subforum":"Charlas Generales","up_votes":4,"down_votes":4,"body":"La verdad es que este juego ya no va por tu habilidad si no por pura suerte, tenes que tener suerta para ganar una partida, es lo que me eh dado cuenta. Loco iba ganando mi linea bien iba 2/1 tranquilazo y me baja el trynda de top me matan con el ez y mas encima me tiran torre mientras mi top esta dando vueltas por el azul viendo que tiran la torre y no ahcen nada, flaco en una tf el malp tira ulti para salvarse no para que ulte el Yasuo, y mas encima cuando el yasuo se tira ulti contra el team enemigo los pelotudos se van corriendo tras trynda que tenia ulti y el yasuo y yo con el culo roto en el piso y todavia el trynda se los viola a todos. por dios no puede ser esto loco, cada vez menos ganas de jugar.\r\n\r\n para peor no falta el pelotudo culo roto que comente &quot;Entonces deja de jugar&quot; O cosas asi. Y rito? a rito le chupa un huevo este server.","replies":[{"poster":"ZanahoriaAsesina","date":"2016-06-16T01:18:09.459+0000","up_votes":6,"down_votes":0,"body":"Jugale al 17, al 83 y al 13.","replies":[{"poster":"Tsurugi Momotaro","date":"2016-06-16T02:12:23.820+0000","up_votes":1,"down_votes":0,"body":"¿Alguien que explique? U.U","replies":[]}]},{"poster":"Vi Sexual","date":"2016-06-16T01:23:25.457+0000","up_votes":3,"down_votes":0,"body":"Si fuese suerte entonces porque la mayoría del server esta en bronce/plata? :v\n\nHay una \"estadistica\" que se llama 20/60/20 , que es:\nEl 20% de tus partidas las vas a perder SIN IMPORTAR LO QUE HAGAS PARA GANAR.\nEl otro 20% las vas a ganar sin importan que tan mal juegues (osea, te carrean) \nY el 60% restante depende pura y exclusivamente de tu desempeño. \n\nBasicamente, para subir, tenes que dar lo mejor de vos y demostrar que sos de ligas mayores, en ese 60% de partidas.","replies":[{"poster":"rokushoger","date":"2016-06-16T12:10:38.650+0000","up_votes":1,"down_votes":0,"body":"Excelente!","replies":[]}]},{"poster":"L9 Letalis Umbra","date":"2016-06-16T01:13:43.827+0000","up_votes":2,"down_votes":0,"body":"Lindo icono :VVV","replies":[]},{"poster":"ANYASZOMORÍTÓK","date":"2016-06-16T01:05:03.299+0000","up_votes":2,"down_votes":0,"body":"Qué mala suerte tenes entonces, emanas yeta.","replies":[{"poster":"lagartor","date":"2016-06-16T01:06:57.826+0000","up_votes":2,"down_votes":2,"body":"La yeta la emana la comunidad basura esta, ratas de 14 años jugando este juego cuyos padres no supieron educar bien, y ahora se creen machitos insultando tras un teclado porque el anonimato les da poder a los pendejos.","replies":[{"poster":"ANYASZOMORÍTÓK","date":"2016-06-16T01:08:27.213+0000","up_votes":2,"down_votes":0,"body":"JAJAJAJAA!!!!!!!","replies":[]},{"poster":"rokushoger","date":"2016-06-16T12:12:15.433+0000","up_votes":1,"down_votes":0,"body":"https://i.ytimg.com/vi/-DKXZ7uNaqI/hqdefault.jpg","replies":[]}]}]},{"poster":"Tsurugi Momotaro","date":"2016-06-16T01:04:21.463+0000","up_votes":2,"down_votes":0,"body":"Pus no tuviste la habilidad de evitarlo.","replies":[]},{"poster":"rokushoger","date":"2016-06-16T12:09:17.823+0000","up_votes":1,"down_votes":0,"body":"Opino que si fuera suerte podríamos llamar al viejo de 80 años que sacó el 5 de oro (una lotería de mucha plata de uruguay) hace una semana, ponerlo en frente a la pc, y el tipo tendría chance de ganar, pero no es así.\nEl problema ahí es no se si de habilidad motriz, pero si de pensar y actuar en el momento propicio. Faltan buenas decisiones. O bien el equipo enemigo era mejor (lo que pasa el 80% de las veces que uno pierde, pero a la gente por alguna razón le cuesta admitirlo).\nDejá de mirar que tanto se equivoca tu team y fijate en que te equivocas vos, que si los demás impidieran que un jugador suba no habría gente en challegner.","replies":[{"poster":"lagartor","date":"2016-06-16T18:44:25.283+0000","up_votes":1,"down_votes":0,"body":"Te respondo, el problema aqui no es tu habilidad, es que los de tu team te hace caso. te doy un ejemplo que me paso la otra vez en una ranked, yo iba mid y iba muy bien. ahora iba perdiendo porque mi team no hacia nada, yo les intentaba decirles que hacer. y me termine enjoando y admito que lso flamee, pero al rato me empezaron a hacer caso a lo que decia y terminamos ganando, pero terminamos ganando a tal punto que parecia que ellos me carreaban a mi y no que era yo el que guiaba los hilos por decirlo de una manera (Si soy un asco expresandome) Todos tienen potencial de challenger, que lo ignoren o no esta en ellos, ahora todos pueden jugar bien el tema es saber como actuar con otra persona, si estos optan por escuchar al que sabe podes ganr, pero un team que la caga y se ciega a no querer ganar es un caso perdido, yo tambien eh tenido partidas donde la eh cagado feo y me flamean, pero esta gente me flamea por jugar mal y no me dice lo que tengo que hacer. Porque yo en ese momento podia estar mal pero la gente en vez de decirme que hacer, en vez de guairme me insulta, otra cosa que sirve para ganar es elogiarlos. cuando hacen algo bien hacerselo saber y estos les da animos en plan \"Estoy jugando bien y mi jg,mid bot, supp o top lo sabe\" ahora si la cagan les escribis \"Loco para un poco, juga defensivo, me hago un tiempo y voy a tu linea\" pero si quieren perder, perderan. es todo psicologico.","replies":[]}]},{"poster":"Lucrexio","date":"2016-06-16T02:10:55.164+0000","up_votes":1,"down_votes":0,"body":"Jugate algo con lo que puedas carrear, osea, hace de cuenta que estas haciendo un 1v5, si queres ganar, tenes que agarrar a tu equipo y carrearla vos, no hay otra, eso si, si te tocan incarreables x4, no te queda otra que el surrender.","replies":[]},{"poster":"Soulwhite96","date":"2016-06-16T01:47:57.241+0000","up_votes":1,"down_votes":0,"body":"supondre que hablas de partidas PvP.\n\nveamos juegas con personas que no conoces ya que el lol pierdes solo por el factor humano. exigir una coordinación va si tienes un equipo( que conzcoas ) o te puedas entender con tu colega cosa que es al azar ya que te puedo tocar cualquier cosa y cada quien juega de manera distinta y piensa de manera distinta y te pueden tocar veteranos o experimentados. para eso existe la comunicación. por ejemplo cuando juego con janna que es una campeona soporte de mis preferidas siempre me pasa que el adc da por que soy tanque y que deberia lanzarme o por que no hago lo que me dice, la respuesta es simple NO conoces a mi campeón y me toco por ejemplo que un jugador adc me dijo(esto fue hace mucho tiempo) \"janna subite la E asi aprovecho ese daño extra al lanzarme y usa tu W para tener tiempo\" ese es un campeón que entiende mis fortalezas también pasa que no saben. Pero les digo que mi E te da un escudo y da daño y lo captan rápido y se lanzan tiro  E y listo tiene mas daño o una kill, es cuestión de comunicación saber con quien estas jugando para entenderse. piensa que la \"mayoria\" de la gente no es tonta hay algunos que si \"el sabio escucha al maestro y el tonto ignora al maestro\" suerte en tus partidas","replies":[]},{"poster":"Kput","date":"2016-06-16T12:46:33.996+0000","up_votes":1,"down_votes":1,"body":"Guaton tomate un armonil","replies":[]},{"poster":"FDX","date":"2016-06-16T02:30:53.233+0000","up_votes":1,"down_votes":1,"body":"Entonces no es suerte o mala suerte, es mala habilidad :)","replies":[]}]}