{"poster":"Rohaerlynn","date":"2015-03-10T11:36:52.171+0000","title":"Dota2 Vs LoL","subforum":"Charlas Generales","up_votes":39,"down_votes":5,"body":"Todos sabemos que este tema es un tema que enfurece hasta a la lulu mas dulce, pero aun asi siento la necesidad de hablar de el, aviso desde este momento que este probablemente sea un tl:dr extremadamente grande, y no es un lugar para fangirls arenosas que no saben debatir un tema sin insultar, asi que si sos de eso, favor de ingresar a otro tema para no generar conflictos.\n\n\nTodos somos conocedores de lo bueno que es el league of legends, sus mayores virtudes asi como sus grandes desventajas a la hora de jugar, y aunque seamos muchos, no todos jugamos lol y dota 2 por igual, asi que el dia de hoy vengo a dar una critica constructiva a ambos juegos, sin ponerme del lado de ninguno.\n\n**La calidad grafica**\n\nAsi como la jugabilidad, la calidad grafica juega un papel importante en la mayoria de juegos, la calidad grafica de [LoL](http://riot-web-static.s3.amazonaws.com/images/news/June_2014/SRDB2/srdb2-3.jpg), y la de [DotA2](http://gyazo.com/a1a94ce20966c1addc47414a5e91fec8), no tienen comparacion alguna, yo por mi parte, podria decir que la calidad grafica de dota 2 empieza donde termina la de lol, cosa que es bueno y malo, depende de donde se vea, ya que el tener altos grados de calidad grafica si bien le permite a los jugadores con buenos recursos aprovechar al maximo el juego, los jugadores con pocos recursos pueden verse severamente afectados, y cuando se tiene poca calidad grafica, los jugadores con pocos recursos se ven beneficiados, pero los que tienen muchos recursos no pueden experimentar una calidad grafica que les gustaria poder disfrutar.\n\n**La jugabilidad**\nCada juego tiene sus puntos simples y sus lados complicados, En dota 2, existe una excelsa complejidad en respecto al movimiento en el mapa, ya que se puede pasar atravez de los arboles, lo que abre la puerta a jukes y outplays increibles, sin mencionar la existencia de la [daga de traslacion](http://dota2.gamepedia.com/Blink_Dagger/es) [La hoja sombria](http://dota2.gamepedia.com/Shadow_Blade/es) y el [baston de la fuerza](http://dota2.gamepedia.com/Force_Staff/es) \nLeague of legends por su parte cuenta su dificultad en el lado del balance, si, el balance, creanme chicos, los que no jugaron nunca a dota 2 no conocen lo que es el verdadero desbalance, zed le lustra las botas a una PA armada, o a un phantom lancer ~~cancer~~ **incluso un ursa que te mata de 4 golpes al minuto 10**\nleague of legends se rige por una regla universal, si sos tanque, no haces daño, si haces daño, no sos tanque, los bruisers por su parte si bien pueden hacer mucho daño, ese daño no es un daño super explosivo, sino un daño sostenido que requiere que el enemigo este quieto y se deje golpear, cosa que rara vez pasa.\nEn dota 2 eso no sucede, Una PA, O un void, en tanto esten armados (nisiquiera con full build, con 4 items alcanza) pueden saltar de cabeza a una pelea 1v5 y matar a 4 por lo menos, sin ayuda de nadie, porque sucede esto? simple, en dota 2, existe el objeto mas ROTO del mundo de los Mobas, la  [vara del rey negro](http://dota2.gamepedia.com/Black_King_Bar/es) {{champion:236}}  este objeto, otorga inmunidad total a casi todos los hechizos y conjuros del juego (con algunas excepciones) lo que provoca que dota2 sea un juego asi:          Carry >>>>>>>>>>>>>Mago\nEn dota2, casi todos los magos son soportes o disablers, si un mago que no sea un invoker con 10 dedos en cada mano carrea un partido, es porque el enemigo no sabe jugar bien. EDIT : se me olvido recalcar, en dota2, no existen los ratios, por eso la mayoria de los magos son soportes\n\n\n**La mobilidad y las dependencias de los personajes**\nsi bien existen muchas formas de mobilidad en LoL, en dota 2 la mobilidad no es algo que deberia existir en este mundo, objetos como la daga de traslacion se quedan atras comparados con la mobilidad de algunos superheroes de D2, algunos de estos, como el Nature's Prophet, que puede teletransportarse a cualquier punto del mapa cada 20 segundos, o el WISP, que puede, al igual que el nature's prophet, teletransportarse a cualquier punto del mapa, y encima, llevarse a un aliado consigo, para despues regresar al punto de origen pasados unos segundos, el keeper of the light, que puede teleportar a cualquier heroe aliado hacia el utilizando una de las sub habilidades de su definitiva. esto provoca que la mayoria de las veces que ves un nature prophet del lado contrario, sueltes un suspiro largo y brusco, como el que das cuando ves a un yi o a un tryndamere en el team enemigo.\n\nUna de las dependencias mas importantes de dota 2 en respecto a sus personajes, es que la mayoria de los hard carries dependen de la chance de algo.\nFaceless void, depende de la chance de bash, y la chance de backtrack, que lo hace esquvar cualquier tipo de daño o conjuro, imaginate que le tiras el ulti de darius a un enemigo, y no le haces daño, algo asi seria\nPhantom assasin, depende de su **chance de critico de 450% de daño**si, 450%. sin contar sus 50% de chances de evasion, si, en dota 2 todavia existe la evasion. asi como la de jax.\nPhantom lancer, depende de su chance de hacer ilusiones, imaginate un shaco que tira 8 clones, bueno, asi es PL en dota 2.\npodria seguir, pero no tendria sentido, el punto ya se entendio\n\nLas mayores dependencias de LoL, son\nLa dependencia del adc de tener soporte, peel, etc.\nLa dependencia del jungla de un buen leash temprano en la partida\nY la dependencia de un soporte de tener un equipo bien organizado\nparece simple no? si pensas eso entonces estas muy equivocad@.\n\n**Soportes y magos**\nEn league of ~~draven~~ legends existen muchos tipos de soportes, tanques, magos, utility, la mayoria de los soportes son nerfeados de vez en cuando porque los jugadores tratan de jugarlos como magos Full AP, lo que termina volviendolos desbalanceados y provocando que el nerfeo afecte su rol principal, en dota 2, solo existen dos tipos de soportes, el soporte y el soporte de linea. mientras que el soporte normal, se encarda de colocar sentinelas y hacer el famoso [pulling](http://youtu.be/KFFu-Q4X9mM?t=18s) para conseguir oro y hacer que los creeps enemigos avancen hacia la torre aliada provocando que el enemigo avance la linea involuntariamente. los soportes de linea se ocupan de ~~babysittear~~ cuidar al carry mientras farmea y preocuparse de que no lo harraseen demasiado. simple como eso no? haha, cuando juego de soporte siempre termino con 5 enemigos ~~poniendomela~~ encima, ya que no existen los soportes tanques, el soporte esta condenado a ser el blanco de todo, ya que muere de un spell cualquiera.\n\n\n**La linea del medio**\n\nSi bien en lol el midlaner solo se encarga de, farmear, ganar su linea, y hacer algun roam ocasionalmente, en dota 2 la midlane es algo totalmente diferente, y se podria decir, mucho mas compleja, ya que en dota 2, los gankeos, son responsabilidad del midlaner, ya que se juega duo top, solo mid y duo bot generalmente, el midller es el que obtiene la mayor ventaja de experiencia, asi que tener un mal middler te puede costar la partida facilmente.\n\n\n**la vision del mapa y otros**\nEn dota 2 el mapa es mucho mas chico, y solo se puede comprar un stock de wards (dos wards) cada cierto tiempo, en league of legends no pasa eso, el mapa es enorme comparado al de dota 2, y gracias a la existencia del bush, la vision del mapa es un constante problema.\nAlgo que me gustaria recalcar, es que en dota2, existe un amigo, muy util, que se llama el courier, o animal mensajero, este pequeño amigo se encarga de llevar objetos desde la base hasta el laner sin la necesidad de que el jugador regrese a base.\nsi bien en dota 2, no existe el recall, existe un objeto, llamado vitela de teletransporte, que te permite teleportarte a cualquier estructura aliada.\n\n**dificultad**\n\nLos champs de lol y los heroes de dota2 son totalmente diferentes, eso es lo que me encanta, ya que existen juegos, como HoN, que son copias baratas de dota2, algo que amo de league of legends es que sus personajes son ideas originales, no copias mugrosas de otros juegos Btw sirdal si lees esto, dofus c:\n\nalgunos de los personajes mas complejos de LoL, son zed, syndra y kalista, ya sea porque dependen de muchas mecanicas o por otras razones\nLos personajes mas complejos de dota 2 son, Invoker, catalogado como el mas dificil de jugar, consta de 3 esferas elementales y una habilidad definitiva, la habilidad definitiva, combina los 3 orbes elementales que posee invoker activos, para crear un conjuro nuevo, invoker tiene esferas de hielo, fuego, y rayo, y puede tener activas 3 al mismo tiempo, lo que le da una combinacion total de 11 conjuros que debes aprender a utilizar y combinar para poder utilzar bien a invoker\nPudge, es un heroe que posee el gancho de blitzcrank, pero golpea a la primera unidad que toca, sin favoritismos, si la unidad golpeada es enemiga, hace daño **puro, o verdadero** como les parezca mejor nombrarlo, a esa unidad y la arrastra hacia pudge, o mejor dicho, la arrastra hacia una muerte segura.\nMeepo,  el nombre les sonara a teemo, pero no es como teemo, meepo es un heroe que su definitiva le permite tener hasta 4 copias de si mismo, permanentes en el campo de batalla, cada uno de esos meepos, tiene las mismas habilidades que el original, y comparte sus botas, pero no otros objetos, alguna vez imaginaste lo que se siente controlar a 5 campeones simultaneamente? meepo lo hace posible, aunque si, si pickeas meepo, preparate para el blaming torrencial que vas a recibir, en eso si se parece a teemo.\n\nah, y ni hablar de zeus, imaginate un ulti de karthus que no tiene retraso, solo te explota en la cara de un momento a otro, eso si es hermoso de dota2.\n\n**Adicionales**\n\nDia y noche.\nSi bien en league of legends no existen el dia y la noche, estos dos juegan un papel importantisimo en dota2, de noche, los heroes pierden rango de vision, lo que provoca que los gankeos sean mas dificiles, aunque hay algunos heroes, como luna, lycan o el night stalker, que no padecen estas restricciones, ya que tienen habilidades que les otorgan vision nocturna adicional.\n\nY como en todo, no se puede hablar de un juego online sin tener en cuenta el trolleo!\n\nsi bien en ambos juegos el trolleo es un problema serio, en dota 2 es mucho mas serio,\n\nsi yo te dijera, que ademas de tirarse a feedear, en dota 2 te pueden tirar a feedear a vos? como te quedas? UOUOUOUOUO.\n\nSi, eso mismo, en dota 2, existe un heroe, el padre de todo trolleo, que se llama tiny, con su segunda habilidad, arroja a la unidad mas cercana hacia una unidad objetivo, asi que si, el tiny te puede arrojar hacia la torre enemiga aunque vos te resistas.\nwisp te puede teleportar a la fuente  (plataforma de spawneo) enemiga\nel baston de la fuerza empuja al objetivo 600 unidades en la direccion que esta mirando\nlos personajes que te hacen etereos, impidiendote atacar\ny el trolleo mas hermoso de todos, el recien agregado winter wyvern, que maldice a un enemigo, haciendo que todos sus aliados en un circulo a su alrededor se vean obligados a atacarlo en contra de su voluntad :'D\n\nEdit 2: en dota 2, farmear es mucho mas dificil, ya que el enemigo puede last hittear sus propios minions para denegarte totalmente la experiencia y el oro de esa unidad, asi que tenes que estar atento ヽ༼ຈل͜ຈ༽ﾉ\n\nalgo que me gustaria agregar, ya que ando leyendo muchos posts sobre lag y esas cosas, es que en dota2 no hay muros entre los servers, vos podes elejir en que servidor jugar en todo momento sin tener que pagar, eso me parece un muy buen agregado al juego.\n\nBueno, yo paro aca porque ya me duelen las manos, si te gusto dame un +1 asi lo ve mas gente, si jugas ambos juegos como yo, decime si me falto algo importante!\nme gustaria recalcar, que por mas que intento no logro ponerle un puntaje superior a uno sobre otro, asi que a los dos les pondria un 9/10, porque si a un juego le falta algo, lo compensa con otra cosa que lo hace excelente, y ademas me parece necesario comentarles a algunos, que jugar dos juegos diferentes no te hace hitler ni nadie parecido asi que no es necesario insultar por eso.","replies":[{"poster":"Riot Cóndor","date":"2015-03-10T18:26:54.696+0000","up_votes":22,"down_votes":2,"body":"Hola,\n\nGracias por la publicación. Yo intenté jugar Dota 2 en una ocasión pero realmente no me gustó mucho. De todas formas aprendí bastante sobre las diferencias entre ambos juegos con toda la información que nos diste.\n\nSaludos y procuren disfrutar del juego que sea que elijan.\n\nRiot Cóndor","replies":[{"poster":"FB BigDix","date":"2015-03-11T00:41:13.813+0000","up_votes":13,"down_votes":1,"body":"> [{quoted}](name=Riot Cóndor,realm=LAS,application-id=v7qsfXsE,discussion-id=QNoz7F0T,comment-id=000b,timestamp=2015-03-10T18:26:54.696+0000)\n>\n> Hola,\n> \n> Gracias por la publicación. Yo intenté jugar Dota 2 en una ocasión pero realmente no me gustó mucho. De todas formas aprendí bastante sobre las diferencias entre ambos juegos con toda la información que nos diste.\n> \n> Saludos y procuren disfrutar del juego que sea que elijan.\n> \n> Riot Cóndor\n\nSr. Tryndamere: \"Dijo DOTA un Rioter.. Sr. Condor, deme 100 abdominales....\"\nRiot Condorito: \"Pero Sr. Dije que no me gust.\"..\nSr. Tryndamere:\" 200 ABDOMINALES EH DICHO!\".-","replies":[]},{"poster":"Nombre ofensivo","date":"2015-03-10T19:40:29.258+0000","up_votes":8,"down_votes":0,"body":"esta no es la repuesta que alguien se espera, guerra{{summoner:14}} {{summoner:11}} (XD)","replies":[{"poster":"ArtoriasBerkut","date":"2015-03-11T02:11:27.851+0000","up_votes":3,"down_votes":0,"body":"lean entre lineas, condor solo quiere ver sufrir a dota y a los poros","replies":[{"poster":"OMG Its Selith","date":"2015-03-11T13:31:49.111+0000","up_votes":2,"down_votes":2,"body":"Rito Cóndor, podrían aprender algo de Dota, por ejemplo, en Dota2 se puede comunicar por medio de la vos aparte de por el chat.","replies":[{"poster":"Shappaw","date":"2015-03-11T13:41:18.575+0000","up_votes":4,"down_votes":0,"body":"En el LoL sería algo desastrozo... imaginate, todo el mundo insultándose con el simple hecho de cometer un pequeño error (como suele actualmente).   u.u'","replies":[{"poster":"OMG Its Selith","date":"2015-03-11T13:44:44.079+0000","up_votes":1,"down_votes":0,"body":"existe la posibilidad de mutear, así como podes mutear el chat, esto solo es un extra que podemos aplicar si tenemos ganas de usar. si no lo querés usar es tan facil como mutearlo.","replies":[{"poster":"Shappaw","date":"2015-03-11T14:07:55.147+0000","up_votes":1,"down_votes":0,"body":"Clarín","replies":[{"poster":"OMG Its Selith","date":"2015-03-26T08:13:48.161+0000","up_votes":1,"down_votes":0,"body":"Clarín miente jajaja","replies":[]}]}]}]},{"poster":"MANOLOL0909","date":"2015-03-29T22:50:49.005+0000","up_votes":1,"down_votes":0,"body":"o que un bot reemplaze al troll o al AFK","replies":[{"poster":"OMG Its Selith","date":"2015-03-31T08:27:50.825+0000","up_votes":1,"down_votes":0,"body":"Claro! asi no solo tenes un afk sino también un feeder! lógica de MANOLOL0909  mai fren.","replies":[]}]}]}]}]},{"poster":"Yeinoo","date":"2015-03-11T03:44:06.243+0000","up_votes":7,"down_votes":0,"body":"* Mente de Riot Cóndor *\nA este lo baneo permanentemente.","replies":[]},{"poster":"ALEXKOND","date":"2015-03-11T04:30:37.361+0000","up_votes":1,"down_votes":1,"body":"¿Jugasté algún otro moba como Smite, HotS o el ahora fallecido Dawngate? ¿Que opinas de ellos?","replies":[{"poster":"Rohaerlynn","date":"2015-03-11T19:32:48.250+0000","up_votes":2,"down_votes":0,"body":"Los jugue todos menos HoTS, Que el malvado blizzard no me da mi key y estoy esperando a poder permitirme comprar el paquete de ingreso previo,\nsmite la verdad que no me gusto mucho,  es muy complicado hacia los jugadores realmente nuevos, ya que es un moba extremadamente diferente no puedo aplicar mis conocimientos de otros mobas, lo que se me hizo muy pesado, btw thor op.\n\ndawngate me parecia un juego hermoso, simplemente hermoso, me dio mucha lastima que dejaran de trabajarlo, tenia mucho potencial, RIP Dawngate.","replies":[]},{"poster":"MANOLOL0909","date":"2015-03-30T15:31:35.261+0000","up_votes":1,"down_votes":0,"body":"juge al smite pero era un juego de aparetar botones y  matarr en cambio el lol gana en el trabajo en equipo y la estrategia\n\nademas no tenia hechizos{{summoner:11}} {{summoner:21}} {{summoner:13}} {{summoner:6}} {{summoner:4}} {{summoner:7}} {{summoner:14}}","replies":[]}]},{"poster":"Munen","date":"2015-04-06T16:56:38.628+0000","up_votes":1,"down_votes":0,"body":"Riot, creo que te estoy defendiendo en todos los comentarios que leo \"Rito\"... Me merezco un regalo de cumpleaños.","replies":[]},{"poster":"Brudd4","date":"2015-04-05T23:21:57.314+0000","up_votes":1,"down_votes":0,"body":"Tirando hacia abajo al DotA xD","replies":[]}]},{"poster":"ElectricViolet","date":"2015-03-11T02:24:42.629+0000","up_votes":3,"down_votes":1,"body":"Muchos de los personajes del LOL no son ideas originales, no tenés idea de lo que decís. Más de la mitad de ellos se basan en otros personajes de otros juegos, hasta los skins. Y varios son prácticamente iguales a los del DOTA (caso Ashe-Drow Ranger; Corki-Girocoopter).\nLa lista de los personajes \"tomados prestados\" es bastante larga (vamos, si hasta Yasuo es IDÉNTICO a Mitsurugi de la saga Soul Calibur... Recuerdo haber hecho la comparación hace un tiempo con una foto de ambos y la única diferencia que tienen es la ropa.), por lo que considero que no has sido imparcial en ese punto.","replies":[{"poster":"ImSlenderGuy","date":"2015-03-11T05:08:46.812+0000","up_votes":5,"down_votes":0,"body":"Primero: No es lo mismo \"robar ideas\" que \"inspirarse. Por ejemplo, Azir no es una copia de un campeón de Smite. Ambos juegos se inspiraron en un antiguo Dios egipcio\nSegundo: La enorme similitud entre ciertos campeones (de los primeros) del lol con campeones de Dota, es porque algunos de los creadores de Dota (el primero, de War3) son los iniciadores del LoL. Phreak, Guinsoo. Te suenan?\nY tercero: Los skins también son guiños. Me vas a decir que el skin de Warwick Feroz es un plagio del cuento de hadas de Caperucita Roja? No, querido. Es un guiño al cuento.","replies":[]},{"poster":"Rohaerlynn","date":"2015-03-11T17:24:02.502+0000","up_votes":1,"down_votes":0,"body":"a lo que me refiero con ''ideas originales'' es que riot hace sus propios campeones, si se inspira de otras series o juegos es irrelevante, todos necesitamos una inspiracion, el problema, es que HoN, tal y como lo mencione arriba, agarro las habilidades de los heroes de dota1 y los copio al pie de la letra, cambiandoles el nombre, ESO, es algo que no merece respeto alguno a mi parecer.\nsi bien hay algunos bichos de HoN que son ideas muy buenas, como el emeral warden, no me alcanzan los dedos para contar las copias exactas que tiene, earthskaer void mirana pudge  zeus sven sniper bloodseeker y la lista sigue y sigue","replies":[{"poster":"omegasigfrid","date":"2015-03-12T14:36:04.297+0000","up_votes":1,"down_votes":0,"body":"Hasta el nombre del Baron nashor es en honor a roshan (leido al reves) :D","replies":[{"poster":"javiiabregu","date":"2015-03-14T16:15:20.816+0000","up_votes":3,"down_votes":0,"body":"es que guinsoo es un diseñador que estuvo en ambas companias y fue el encargado de ponerle nombre al boss :P","replies":[]}]}]}]},{"poster":"OKGG Frëddy","date":"2015-03-11T04:24:13.860+0000","up_votes":4,"down_votes":0,"body":"Jugué los dos MOBA's, y tienen así como muchas similitudes, muchas diferencias.\nEn la dificultad el Dota lo pasa por arriba al LoL, las mecanicas de muchos campeones/héroes son dificiles y cuestan demasiado tiempo adaptarse, en cambio en el LoL con un par de partidas te adaptas (no a mainearlo, hablo sobre adaptarse).\nEn lo gráfico, me quedo con el LoL porque es más simple y lo simple genera una muy buena jugabilidad, por ende, más cómididad para el jugador, en este caso, yo.","replies":[]},{"poster":"ReformedPlayer","date":"2015-03-11T23:22:28.136+0000","up_votes":3,"down_votes":0,"body":"Es muy simple... DotA 2 es un juego de ABSOLUTA estrategia que requiere un total control del tiempo, mapa y oro. EL lol es 400.000 veces mas facil","replies":[]},{"poster":"LeagueofNoobs","date":"2015-03-10T15:56:43.590+0000","up_votes":3,"down_votes":0,"body":"recuerdo cuando bloodseeker podía correr como una auto de carreras xD","replies":[]},{"poster":"Gate","date":"2015-03-10T15:25:19.820+0000","up_votes":2,"down_votes":0,"body":"Increible eso de que te tiren a la base enemiga, y nosotros nos quejamos de bard...","replies":[{"poster":"Rohaerlynn","date":"2015-03-10T15:31:23.106+0000","up_votes":3,"down_votes":0,"body":"https://www.youtube.com/watch?v=7mmxJ2WVbLA\n\nヽ༼ຈل͜ຈ༽ﾉ","replies":[]}]},{"poster":"Acel","date":"2015-03-11T17:06:58.289+0000","up_votes":2,"down_votes":0,"body":"Me voy a poner a llorar, enserio. Rara vez, MUY RARA VEZ, tengo el placer de leer un post tan bueno y completo como este. Me encanta tu manera de expresarte y como diferencias juegos que apesar de ser el mismo genero son MUY distintos. No se que decir... creo que te amo.","replies":[{"poster":"Ministevo","date":"2015-05-04T23:46:34.240+0000","up_votes":2,"down_votes":0,"body":"http://cdn.meme.am/instances/250x250/60983197.jpg","replies":[]}]},{"poster":"XVII The Star","date":"2015-03-10T14:40:38.468+0000","up_votes":1,"down_votes":0,"body":"Nunca he jugado dota pero... Nerf invoker pls... De verdad ahora voy a ver un gameplay de ese heroe.","replies":[{"poster":"BlackkDoor","date":"2015-03-10T14:46:25.319+0000","up_votes":1,"down_votes":0,"body":"Deberías ver a meepo es como manejar 4 héroes en 1 y si muere uno mueren todos","replies":[{"poster":"Shappaw","date":"2015-03-11T14:10:30.083+0000","up_votes":1,"down_votes":0,"body":"Yo era main Meepo, pero en DOTA. Viejos tiempos...","replies":[{"poster":"omegasigfrid","date":"2015-03-12T14:38:48.760+0000","up_votes":2,"down_votes":0,"body":"Recuerdo lo bueno que era andar con la daga, usarla y teletransportar a todos los meepos donde tu XD","replies":[]},{"poster":"javiiabregu","date":"2015-03-14T16:17:35.923+0000","up_votes":1,"down_votes":0,"body":"pensé que eras main meepo en lol...","replies":[{"poster":"Shappaw","date":"2015-03-14T21:03:39.313+0000","up_votes":1,"down_votes":0,"body":"A veces juego Meepo... top (?).","replies":[]}]}]},{"poster":"XVII The Star","date":"2015-03-10T15:05:52.386+0000","up_votes":2,"down_votes":0,"body":"Oh god... ¡Rito abrázame!","replies":[]}]}]},{"poster":"Desaroll","date":"2015-03-11T13:04:03.767+0000","up_votes":2,"down_votes":0,"body":"Muy buena comparativa :-)\n\nJugué en su tiempo Dota (No demasiado, pero lo jugué), y recuerdo ciertos campeones que mencionas. Zeus en especial. Recuerdo el modo WTF (Imaginen un modo URF, pero 0 de CD en cualquier habilidad) en Dota 1, y Zeus era uno de los prohibidos para usar, pero siempre estaba el troll.\n\nProbé el dota 2, pero me pareció un juego mucho mas \"egoísta\" que el LoL. Con \"Egoísta\" me refiero a que, prácticamente, no dependes de tu equipo. Es muy común que un solo jugador carree de forma bestial, por mas malo que sea tu equipo.\n\nUna diferencia mas, que descubrí hablando con un amigo que jugaba Dota 2 (Si, la amistad es posible), es que en Dota, son mucho mas comunes las habilidades pasivas que en LoL, pero en LoL hay muchos menos objetos activables que en Dota 2. Al menos, es a la conclusión que llegamos, ya que ambos solo habíamos probado superficialmente al otro juego.\n\nSuerte!\n\nPD: Lulu es demasiado dulce, no se molesta por estas cosas. Ni le importan :3 {{champion:117}}","replies":[]},{"poster":"HillS","date":"2015-03-10T12:11:13.314+0000","up_votes":2,"down_votes":1,"body":"\"En dota 2 el mapa es mucho mas chico ... \"  KEH? Acá le pifiaste feo jajajaj. Por todo lo demás muy bien planteado y argumentado.","replies":[{"poster":"FB BigDix","date":"2015-03-11T00:38:06.306+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=HillS,realm=LAS,application-id=v7qsfXsE,discussion-id=QNoz7F0T,comment-id=0002,timestamp=2015-03-10T12:11:13.314+0000)\n>\n> \"En dota 2 el mapa es mucho mas chico ... \"  KEH? Acá le pifiaste feo jajajaj. Por todo lo demás muy bien planteado y argumentado.\n\nPosta... yo cuando jugaba DOTA2 sentía q tenía tiempo de ir al baño y volver, y mi pj todabía no había llegado de la plataforma de respawn al medio jajaja","replies":[]},{"poster":"BlackkDoor","date":"2015-03-10T14:48:07.650+0000","up_votes":2,"down_votes":0,"body":"El de dota es muchooo mas grande","replies":[]}]},{"poster":"MetalManiac","date":"2015-03-10T21:17:04.360+0000","up_votes":2,"down_votes":0,"body":"Los rojos comentan los posts que menos atención requieren xD","replies":[]},{"poster":"ALEXKOND","date":"2015-03-10T14:04:52.388+0000","up_votes":2,"down_votes":0,"body":"Juego de vez en cuando DOTA2 con unos amigos, esta bueno pero simplemente me quedo en el LoL\nHonestamente, siempre me pareció más grande el mapa de dota que el de LoL, hora de comprarme anteojos","replies":[{"poster":"HillS","date":"2015-03-10T17:12:53.549+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ALEXKOND,realm=LAS,application-id=v7qsfXsE,discussion-id=QNoz7F0T,comment-id=0005,timestamp=2015-03-10T14:04:52.388+0000)\n>\n> Juego de vez en cuando DOTA2 con unos amigos, esta bueno pero simplemente me quedo en el LoL\n> Honestamente, siempre me pareció más grande el mapa de dota que el de LoL, hora de comprarme anteojos\n\nEs 3 veces mas grande el del Dota.","replies":[]}]},{"poster":"Ionian Blade","date":"2015-03-10T12:21:29.915+0000","up_votes":2,"down_votes":0,"body":"> si yo te dijera, que ademas de tirarse a feedear, en dota 2 te pueden tirar a feedear a vos? como te quedas? UOUOUOUOUO.\n\n*Cof* deja de mirar Dalas que trollea y pickea Teemo top *cof* Ok, no\n¡Excelente comparación!\nLa verdad no puedo debatir mucho del tema, jugué muy poco a Dota 2\nPor el tema del desbalanceo terrible que tiene, las pocas partidas que jugué me toco uno que diveaba hasta el nexo contra los 5 y salia, feliz de la vida, como si fuera un Kha nivel 18 contra 5 niveles 1, saltando de uno en otro","replies":[]},{"poster":"Chill Your Mind","date":"2015-03-10T12:03:53.864+0000","up_votes":2,"down_votes":0,"body":"Muy buenas diferencias, me gusto tu forma de escribir.\nYo probe el Dota2 hace poco y lo unico que puedo decir es que me parecio MUCHISIMO mas lento y aburrido que el LOL. Sentia que farmear era un suplicio e iba todo en camara lenta ^^\n\n**Buenos Humos** y +1 {{champion:236}}","replies":[]},{"poster":"SaMx22","date":"2015-03-12T15:17:12.277+0000","up_votes":1,"down_votes":0,"body":"Lo que me encanta del Dota 2 son como sos explotado por las torres xD","replies":[{"poster":"Ministevo","date":"2015-05-04T23:49:43.221+0000","up_votes":1,"down_votes":0,"body":"Atacan tan rapidooooo D:","replies":[]}]},{"poster":"BlackStarDark","date":"2015-04-22T00:40:02.919+0000","up_votes":1,"down_votes":0,"body":"Edicion horrible [Lo se] Pero es uno de los 3 videos de DotA que hicimos con mis teammates en Dota1\nhttps://www.youtube.com/watch?v=dsbbdqxCYyg","replies":[]},{"poster":"060Nacho","date":"2015-04-22T00:31:22.507+0000","up_votes":1,"down_votes":0,"body":"te falto la comunidad","replies":[]},{"poster":"terere style","date":"2015-03-26T14:55:22.642+0000","up_votes":1,"down_votes":0,"body":"yo juego los 2...son bastante divertidos,lo que me gusta de dota es que todos los heroes son op...en cambio en lol solo algunos son viables de tantos nerfeos exagerados que les aplican","replies":[]}]}