{"poster":"POD2 Midnight","date":"2018-07-25T01:55:37.038+0000","title":"[VIDEO] Control de Oleadas - Entendiendo el Slow Pushing","subforum":"Creaciones de la comunidad","up_votes":5,"down_votes":0,"body":"[](https://i.imgur.com/avdHUq1.jpg)\n\nhttps://lolstatic-a.akamaihd.net/frontpage/apps/prod/rg-champion-aatrox/es_ES/3a2cd8032f93d3aadf42219a6c19ccfcc5e7792f/assets/img/global/accents/accent-1.png\n\nhttps://i.imgur.com/5AArw7n.png\n\nhttps://i.imgur.com/s3FAEni.png\n\nhttps://youtu.be/Nh3G-Lym3qs\n\nhttps://i.imgur.com/s3FAEni.png\n\nBuenas :)\n\nEn esta ocasi&oacute;n, les traigo un video acerca de un 2 VS 2 que jugu&eacute; hoy, espont&aacute;neamente. El objetivo de este video es analizar el **control de oleadas**, toma de decisiones y como poder implementar esto para ganar partidas, ya sea generando mucha presi&oacute;n o para tirar torres con campeones de AP, que requieren de m&uacute;ltiples s&uacute;bditos para realizar este proceso.\n\nSaludos.\n\nhttps://i.imgur.com/s3FAEni.png\n\n#Redes Sociales\n\n#Twitch: [Haz Click Aqu&iacute;](https://www.twitch.tv/midnightlas)\n#Youtube: [Haz Click Aqu&iacute;](https://www.youtube.com/channel/UCQkfRXnqVnY2Qf6hX6NYcIA)\n#Comunidad de Discord: [Haz Click Aqu&iacute;](https://discord.gg/TC7nyQS)\n#Facebook: [Haz Click Aqu&iacute;](https://www.facebook.com/midnightlas/)\n#Twitter: [Haz Click Aqu&iacute;](https://twitter.com/midnightLAS?lang=es)\n#Instagram: [Haz Click Aqu&iacute;](https://www.instagram.com/midnight_las/?hl=es-la)\n#Mail de contacto: midnightlasoficial@gmail.com\n\nhttps://i.imgur.com/0hUv9OU.png","replies":[{"poster":"Runth","date":"2018-07-25T05:05:37.950+0000","up_votes":1,"down_votes":0,"body":"ese slow puch es algo sencillo de leerlo pero dificil si eres nuevo haciendolo, si usas bien el control del mapa tanto el oponente que a ti , solo lo unico que puede caer eso, es un error de velocidad y el sobrextender la linea que estas casi obligado llevar vision para hacerlo de manera segura y usar la logica que el oponente llege antes lo previsto.\n\ncomo es una partida de 2v2 se ve facil porque puedes controlar a 1 solo(ya q los zeds hicieron open), ahora imagina controlar a 5 de ellos, lo mejor es q los carrileros hagan la misma manera, o sea el top , el mid (que tengan buen split push) y el carry(ap o ad) mientras q los jg y soporte son de apoyo tanto la vision que darlos peel o provocar una tf hacer un bailecito de ula ula  y q uno haga esa tactica\n\nen realidad requiere mucha comunicacion hacer ese metodo, pero al ver el video seguro q si es efectivo solo si el oponente cae un error de limpieza apresurada por ir al objetivo obvio de matarte xD\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"POD2 Midnight","date":"2018-07-25T06:08:42.290+0000","up_votes":1,"down_votes":0,"body":"Exacto :) de hecho, algo que pensé y no sé si lo dije en el video es que se han hecho muchísimos videos del tema, que wave control, que como usarlo y tal, pero en esta ocasión me pareció algo casi caído del cielo, porque se podía apreciar muy bien, y con los resultados y tal. Yasuo y cualquier hypercarry son campeones a los que no quieres hacerles slow push, pero era la única manera de ganar que tenía yo. Si lo ves de cierto modo, es casi un jaque-mate, es por esto que me pareció tan interesante como logré mantener al Yasuo moviéndose donde yo quisiese, tratando de no perder el control.\n\nSobre lo de la limpieza apresurada, tiene 2 opciones: farmear rápido o ignorar; si farmea rápido (lo que hace durante todo el game), tiene mucho oro, me deniega el slow, pero la desventaja es que tuvo que moverse a esa línea. Es cuando deja de ir a las huge wave que sus torres caen, y mi plan funciona. Probablemente hubiese durado menos si el no hubiera limpiado todas las waves.\n\nEso más que nada, siempre todo del punto de vista de la lógica más que de la pauta (\"asesina x número de súbditos y deja tal número vivos\"), es como me gusta enseñar.\n\nSaludos, buen comentario ;)","replies":[]}]}]}