{"poster":"XLoftMentalityO","date":"2017-11-17T23:09:07.049+0000","title":"20 Minute Queue Wait Times Are....","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So ANNOYING****.\r\nI've been having the trouble of League of Legends randomly disconnecting in my games. Sometimes I'm lucky enough for it to happen right in the middle of a fight, god when that happens and I die its so frustrating words cannot explain. This has been happening for some time and I'm REALLY sick of it, went to my lag report to see if my connection is just trash and NO. \r\nYOUR ISP'S CONNECTION SCORE\r\nComcast\r\nYOUR CONNECTION SCORE\r\nComcast\r\nBEST ISP CONNECTION SCORE\r\nComcast\r\n97\r\nGREAT\r\nIs it really though???? I've been dealing with League just RANDOMLY CRASHING, either in champion select making me not able to select a champ/ ban a champ, and I run out of time, and I have to wait like 5 minutes in queue for another queue. ITS SO DAMN ANNOYING. Now I have a 20 minutes queue, not too bad, but friendly ol' League decides to now disconnect, AND MY INTERNET IS FINE...ITS \"GREAT\". So why am I being disconnecting and having to RESTART MY 20 MIN QUEUE, OVER AND OVER, AND OVER, AND OVER AGAIN? I've now waited more than an hour and a half FOR A SINGLE DAMN GAME. Just let me play my game PLEASE. I some_how made it to 20 minutes, well more like 21 minutes and 59 seconds, somehow, and when I was waiting for a real queue to happen, I waited 4 minutes for a queue to pop up on my screen....4 min?? So my queue broke AND I HAD TO RESTART MY QUEUE AGAIN WAITING ANOTHER 20 MINUTES PRAYING I WONT DISCONNECT AND WAIT ANOTHER 20 MINUTES_. This is just pure time wasting man, holy mother of god its so annoying. Why am I being randomly disconnected????? I've now restarted this ONE 20 MIN QUEUE 7 TIMES. I'M TIRED MAN. Can Riot just delete these 20 min queues? PLEASE? Maybe 10, or 13, WHY 20? God. The frustration. Fix this please. annoying queue wait times. Please. Please.","replies":[{"poster":"Porocles","date":"2017-11-17T23:40:37.370+0000","up_votes":1,"down_votes":0,"body":"Your ISP might be great, but your local network can still be struggling.  I know this is a frustrating period, and I don't recommend queueing up for anymore matchmaking games until this is fixed up.  Run a [log reader](https://support.riotgames.com/hc/en-us/articles/209765743-Connection-Troubleshooting-Log-Reader) when you get a chance to get an overview of your issue.  \n\nYou can also download [WinMTR](http://winmtr.net/winmtr-v0-92-now-available/) and run a traceroute to 104.160.131.1so we can see where the hiccup is coming from.  Run it for about 5 minutes, remove the IP on the first two rows, and let me know what you find.","replies":[]}]}