{"poster":"Nebbly","date":"2016-05-06T19:48:58.749+0000","title":"Yasuo kann nicht auto-attacken","subforum":"Melde einen Bug","up_votes":6,"down_votes":0,"body":"Hi mir f&auml;llt schon eine ganze Weile auf, dass Yasuo manchmal einfach nicht angreift. Egal wie viel mal die rechte Maustaste dr&uuml;ckt.Mir ist das nach mehren Situationen aufgefallen:\r\n1.Situation\r\nDirekt nach der ultimativen F&auml;higkeit bleibt Yasuo in 60%(gesch&auml;tzt) der F&auml;lle einfach stehen, wenn man verzweifelt auf den Gegner klickt.Das ganze dauert so meist 1 Sekunde. Ich wei&szlig; ,dass sich das nicht vielt anh&ouml;rt,aber das ist quasi ein &quot;Stun&quot;.Auch wenn man noch andere Spells benutzen kann ist es trotzdem manchmal entscheident ob man jemanden t&ouml;tet oder selber stirbt.\r\n2.Situation\r\nBei dieser Variante bin ich mir nicht ganz sicher aber dieser &quot;Stun&quot; kommt auch ab und zu nach der E Q combo vor.\r\nIch habe in einem Custom game ausprobiert ob dieses nicht-angreifen mit dem attackspeed zu tun hat, aber die Antwort lautet Nein.Ich habe 2,5 attackspeed gekauft und das kam das gleiche bei raus.\r\nBitte fixt diesen bug :=).","replies":[{"poster":"Hexenjäger Teru","date":"2016-05-06T23:48:05.161+0000","up_votes":2,"down_votes":0,"body":"Ist schon lange so und lange bekannt. Riot scheint das allerdings nicht zu interessieren.\nEs gibt auch noch einen Bug (wenn es denn einer ist)\nWenn man während der Yasuo q-Animation cc'd wird, wird die \"Stich-Animation\" ausgeführt, ohne dass die Fähigkeit wirklich benutzt wird (kein Q Stack und kein Schaden)\n\nSchade, dass solche Bugs leider über Jahre bestehen. Damit müssen wir uns wohl abfinden.","replies":[]},{"poster":"Staatsanwalt","date":"2016-05-07T10:58:45.695+0000","up_votes":1,"down_votes":0,"body":"Kennt ihr den Bug, wo der Reichweitenindikator für das dritte q permanent angezeigt wird? Das ist lästig, weil du ständig denkst, du kannst wirbeln, aber nix is..... Most bugged Champ ingame^^","replies":[]},{"poster":"Samuraisub","date":"2016-05-07T10:40:14.235+0000","up_votes":1,"down_votes":0,"body":"Ich krieg %%%%%%, bei dem Bug. Das kann bei Trades und Towerdives entscheidend sein.","replies":[]},{"poster":"StillYasuoMain","date":"2016-05-06T22:48:50.374+0000","up_votes":1,"down_votes":0,"body":"Also bin ich nicht der einzige der das auch sieht^^","replies":[]}]}