{"poster":"J8ker","date":"2020-02-19T14:15:46.514+0000","title":"Diskussion über Toxicity in League / in Spielen allgemein","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":5,"body":"Als erstes möchte ich klarstellen, dass dieser Thread keineswegs dazu da ist um meine kontroverse Meinung mit allen Mitteln zu vertreten und zu popularisieren, sondern um eine Diskussion zu eröffnen über ein paar Punkte, die meines Erachtens eine Diskussion verdienen. \n\nEs geht um eine abstrakte Betrachtungsweise über toxisches Verhalten (**damit gemeint sind hier Sticheleien / einfache Beleidigungen**) in League. Dazu habe ich 1 Punkt, den ich versuche zu erläutern und der hoffentlich Anregung für weitere Meinungen bringt.\n\nToxicity ist in League über die Jahre zu einem Tabuthema geworden und wird von einer absoluten Mehrheit der Spieler verachtet. Bei kleinsten Sticheleien werden (teilweise) Vermutungen über Intelligenz, Alter, Leben oder Vergangenheit der Spieler angestellt um irgendwie das Verhalten von seiner eigenen Person zu distanzieren, da man sich ja nicht in der selben Kategorie sehen will, wie besagte Leute.\n\nWas bei der Diskussion natürlich auch nicht ausser Acht gelassen werden kann ist die Bestrafungspolitik von Riot. Ausfälligkeiten im Chat sind zusammen mit Verlassen des Spiels die beiden grossen Ansätze für Strafen und Banns. Logisch, denn dies sind auch die einzig einfach nachweisbaren Verhaltensmuster. Dieser Thread ist jedoch nicht dazu da Riot's Handlungen diesbezüglich zu verurteilen, da eine perfekte Bestrafungspolitik beinahe unmöglich / unglaublich Aufwendig wäre. Sondern um die Auswirkungen und die Bestrafungsvorstellung der Spielerbasis zu thematisieren\n\nAussen vor bei den \"Reports und Banns\" bleibt ein riesiger Grauzonenpunkt, der grundsätzlich nicht nachweisbar ist und daher auch keine Folgen mit sich zieht. Spieler die sich keine Mühe geben / Spiele aus purer Gleichgültigkeit verlieren und hier kommt meine Frage: \n\nWelches Verhalten ist verwerflicher? Das Verhaltens des Spielers, der sich nicht für einen Sieg einsetzt weil er autofilled ist oder weil sein champ gebannt wurde oder weil es sein 10tes spiel heute ist etc. etc. oder das Verhalten des Spielers der eine abwertende Nachricht im Chat verfasst als Reaktion darauf, dass diese Person gerade die Zeit von 4 zufälligen Leuten verschwendet. \n\nMeiner Meinung nach ist jemand, der zwar im Chat aufbrausend ist, sich aber trotzdem Mühe gibt wesentlich akzeptabler als ein Spieler der (entgegen seines eigentlichen Könnens) das Spiel erschwert / verliert. Alleine schon dadurch, dass man sich über die mute Funktion ohne Probleme gegen negative Kommentare wehren kann, jedoch gegen besagte Gleichgültigkeit sind einem jegliche Hände gebunden.\n\nWas nun zurecht eingewendet werden kann ist, dass sich die Anzahl von unnötigen Niederlagen aufgrund von Spielern, die grundsätzlich gar nicht gewinnen wollen, über 100 games vermutlich ausgleicht, indem auch im Gegnerteam solche Situationen entstehen. Trotzdem kann man schwer dagegen argumentieren, dass League aufgrund von solchen Gegebenheiten eine unbestreitbare Quelle von kurzzeitiger Frustration ist. Doch dies ist gar nicht wirklich weiter tragisch, denn diese Frustration ist letztendlich bei vielen Spielen über die Jahre eine Erfolgsformel gewesen. Hineinsteigern, Schadenfreude, Frustration und ab und an das Erfolgserlebnis sind die Dinge, die Spiele über längere Zeit interessant machen. Warum also sind kleine Manifestationen dieser Frust zu einem derartigen Tabuthema geworden? Wenn jemand beim Fussball zu faul ist um zu rennen wird er auch die ein oder andere Bemerkung ertragen müssen und das im Internet gleich alles eine Stufe extremer ist, ist ja kein Geheimnis. Warum ist es also, dass simple Kraftausdrücke wie ab und an ein \"Idiot\" so stark gewichtet werden von einem Teil der Spieler und vor allem von Riot?\n\nDie etwas tollpatschigen Fragen in die Runde wären also nun: Wie steht ihr zu Toxicity in League und wo ist bei euch die Grenze? und wie sollte Riot dies handhaben wenn man bedenkt, wie schwer es ist, bestimmte Dinge nachzuweisen?\n\nBin gespannt auf weitere Meinungen und Beiträge","replies":[{"poster":"Yuiwara","date":"2020-02-19T16:03:39.676+0000","up_votes":2,"down_votes":0,"body":"> Welches Verhalten ist verwerflicher? [...]\n\nToxisches Verhalten ist definitiv verwerflich, genauso wie absichtliches verlieren. Solange der spieler nur schlecht spielt und es nicht aus absicht/böswilligkeit tut, ist mir seine mentalität egal. Es ist zwar schade, dass man dann solche leute drin hat im team, die sich keine mühe geben, aber es ist nichts verwerfliches daran.\n\n> Meiner Meinung nach ist jemand, der zwar im Chat aufbrausend ist, sich aber trotzdem Mühe gibt wesentlich akzeptabler als ein Spieler der (entgegen seines eigentlichen Könnens) das Spiel erschwert / verliert.\n\nNein definitiv nicht. Spieler mit toxischen verhalten ziehen die allgemeine motivation extrem runter. ich spiele persönlich deutlich schlechter, wenn mich wer aus dem team das ganze game über beleidigt und niedermacht oder es mit anderen teammates tut. es lenkt ab, senkt motivation usw. \nIch habe lieber lustlose spieler als toxische.\nZudem kommt der punkt, dass nicht jeder die mute-funktion kennt bzw weiß, wie man sie einstellt. besonders neuere spieler. außerdem verliert man durch mutes eventuelle wichtige infos wie absprachen, wichtige pings oä und somit kann mute eines mitspielers genauso zum verlieren führen (einer der gründe, warum ich mich meist ungemutet mit den toxischen spielern spiele).\n\n> Warum also sind kleine Manifestationen dieser Frust zu einem derartigen Tabuthema geworden?\n\nBeleidigung bleibt beleidigung, egal wie \"milde\" man diese ausdrückt.\n\n> Wie steht ihr zu Toxicity in League und wo ist bei euch die Grenze?\n\nSollte absolutes nogo sein. jeder toxische spieler gehört nicht ins game.\n\n> und wie sollte Riot dies handhaben?\n\nUngefähr so wie jetzt. Mir wären schnellere und härtere strafen gg toxische spieler aber noch lieber. Es gibt zu viele cr bevor man zu den eigentlichen banns kommt und für die cr braucht man dann schon recht viele games mit auffälligen verhalten. Die strafen sollten zügiger, härter und konsequenter sein für flamer.","replies":[{"poster":"J8ker","date":"2020-02-19T16:25:43.038+0000","up_votes":1,"down_votes":1,"body":"Find ich ne absolute vertretbare Meinung, wenn man das als komplette Null-Toleranz sieht. Bist du denn auch sonst jemand, der nie jemanden als Depp oder Idiot bezeichnen würde, also komplett abgeneigt gegenüber jeglichen abwertenden Begriffen, oder ist da die Grenze bei irgendeiner gegebenen Situation im echten Leben tiefer?","replies":[{"poster":"Aymira","date":"2020-02-19T16:51:57.129+0000","up_votes":5,"down_votes":0,"body":"Zu sagen das ich nie jemanden als depp oder idioten bezeichnen würde, wäre vermutlich falsch.\n\nUnd nun das bekannte aber:\n\n* Unter Freunden eine kleine Stichelei anzufangen, zählt nicht mit rein. Und selbst in dieser Situation muss ich meinen Gegenüber schon so gut kennen, das ich mir sicher sein kann, das er von dieser Art nicht beleidigt ist.\n\n* zu fremden würde ich das nie im Leben sagen. Um eine ähnliche Situation wie in der Liga zu erzeugen.\nIch fahre auf ein Turnier, Bogenschießen in meinem Fall. Dort kenne ich keinen meiner Gegner, genau wie in LoL. Es sind wildfremde Menschen. \nDenen würde ich nie im Leben, genau so wie in LoL auch, eine Beleidigung an den Kopf werfen, nur weil ich nicht gewonnen hab, oder weil die schlecht geschossen haben. (das obligatorische ggez hat auf dem Treppchen ja auch nichts verloren... ¯\\\\\\_(ツ)_/¯) \n\n* es gibt Leute in meinem Leben, die ich für idioten halte, aber das muss ich ja keinem sagen. xD\n\nRealität mit einem Spiel zu Vergleichen ist schwierig, schließlich ist man im Netz weitestgehend anonym. Jedoch sollte Anonymität dir nicht erlauben tun und lassen zu können was man will. \nSportsgeist sollte es in beiden Situationen geben oder Menschlichkeit, reife... Wie auch immer.","replies":[{"poster":"J8ker","date":"2020-02-19T17:47:08.348+0000","up_votes":1,"down_votes":2,"body":"Um die Analogie hier komplett zu machen müsste man das auch aus der Sicht eines Teamspiels betrachten.\n\nSagen wir also man geht an ein Bogenschiessturnier wo man im 3 gegen 3 mit zufälligen Leuten gegeneinander antritt. Ab und an gibt es aber  Leute die grundsätzlich nicht da sind um ihr bestes zu geben, schon 4 Bier hatten vor der ersten Runde und denen auch egal ist ob sie am Ende gewinnen.\n\nUnter diesen Gegebenheiten wären wir wieder an dem Punkt den ich versucht habe zu umschreiben, wo ich mir die Frage stelle ob es wirklich  ideal ist, das Verhalten der Person einfach zu ignorieren und ob es wirklich so unmenschlich ist wenn man mal eine abwertende Bemerkung macht.","replies":[{"poster":"Aymira","date":"2020-02-19T21:33:27.840+0000","up_votes":3,"down_votes":0,"body":"> Um die Analogie hier komplett zu machen müsste man das auch aus der Sicht eines Teamspiels betrachten.\n\nStimmt. Aber ändern tut das prinzipiell nicht besonders viel an meiner Einstellung :D \n\n> denen auch egal ist ob sie am Ende gewinnen.\n\nUnd das ist es halt. Ich kann an anderem Verhalten nichts ändern, ich muss damit zurecht kommen. \nEin Spiel also zu gewinnen ist eine Sache, wenn es aber aufgrund \"Spielverweigerer\" nicht möglich ist, reicht es mir völlig, meine Leistung als Sieg zu betrachten. ¯\\\\\\_(ツ)_/¯ \n\nGab Turniere, da hab ich gegen mich selbst geschossen, weil in meiner Alters und Bogenklasse niemand war. Da lernt man dann auch, den Sieg anders, bzw Leistungsbezogen zu betrachten bzw. war ich trotz \"1.\" Medaille oft unzufrieden damit, dass mein Ergebnis bescheiden war. :D\n\n> wo ich mir die Frage stelle ob es wirklich ideal ist, das Verhalten der Person einfach zu ignorieren und ob es wirklich so unmenschlich ist wenn man mal eine abwertende Bemerkung macht.\n\nDas Ding ist einfach, wohin führt mich das? \nAn dem Verhalten einer Person in Liga der Legenden kann ich nur selten etwas ändern. Wenn die sich dazu entschließt, das Spiel aufzugeben und nichtmehr mit ernst zu spielen, dann bin ich machtlos. \n\nAlso würde ich persönlich schon sagen, das es die ideale Lösung ist das einfach zu ignorieren, denn alles andere führt nur dazu das die Situation eskaliert. Man kanns freundlich versuchen, aber wenn das nicht greift, dann kann ich mir nur schwer vorstellen das ein \"Du Idiot spiel gefälligst\" irgendwas an der Situation rettet. :D\n\nAlso mitnehmen was geht... Die Erfahrung die man aus dem Gegenüber mit Champion XY gesammelt hat nimmt dir schließlich keiner weg. :D","replies":[{"poster":"Awsane","date":"2020-02-21T16:31:10.529+0000","up_votes":3,"down_votes":0,"body":"Ich würde das hier gerne noch mal aufmachen. Einfach weil ich es interessant finde.\n\nGerade den Satz\n\n> Und das ist es halt. Ich kann an anderem Verhalten nichts ändern,\n\nfinde ich spannend. \nWeil so wirklich stimmt das ja nicht. Du machst es nicht allein, aber du bist als Teil der Gesellschaft auf jeden Fall auch ein Faktor.\nAber natürlich ist das nicht so einfach zu erkennen weil es sehr subtil und verschwommen ist.\n\nWer sich nicht an die Regeln hält(und das müssen ja nicht Gesetzte sondern können auch Werte sein)  hat Probleme und bekommt auch Gegenwind. Und Faulheit ist definitiv ein eher in unserer Gesellschaft missbilligtes Verhalten. Und dieser Druck führt dann schon zu einer Veränderung im verhalten.\n\nIn LoL bekommt man das auch ohne Flame mit. Wenn hier ein Bronze Spieler ankommt hat der es viel schwerer sich bei bestimmten Themen verhör zu verschaffen als ein Platin Spieler. \nWas an LoL so tricky ist, ist das man kein feedback geben darf während des spielens (weil das online auch so schlecht geht). Weil wir geben eigentlich ständig unterbewusst feedback an unsere Umwelt ab (quasi unser ganzes Verhalten mit Körpersprache.)\n\nWenn wir auf der Straße an jemanden vorbei gehen können wir auf sehr viele Arten ohne ein Wort zu sagen oder gar eine bewusste Aktion einer Person klar machen, dass wir es nicht gut finden, was sie macht/aussieht/etc.. Oft merken wir selber das ja nicht einmal, dass wir diese Signale aussenden.\n\nDaher kann ich verstehen, wenn es einigen schwer in LoL fällt damit umzugehen, wenn sie unterbewusst Feedback geben wollen und es nicht abgeben können. Das ist nämlcih eine sehr ungewohnte Situation.","replies":[]}]}]}]},{"poster":"Yuiwara","date":"2020-02-19T16:29:47.996+0000","up_votes":2,"down_votes":0,"body":"Das Real-Life hat mit dem Game null zu tun. Wenn sich wer im echten Leben verbal vergreift, heißt es nicht, dass es ingame ok wäre. Ich bin gegen persönliche verbale angriffe auf andere leute. Andere menschen niedermachen ist mobbing und gehört verboten. **Besonders, da hier im internet jeder anonym ist und die hemmschwelle somit niederiger ist, sollte hier null-toleranz gelten!**","replies":[{"poster":"J8ker","date":"2020-02-19T16:39:09.742+0000","up_votes":1,"down_votes":2,"body":"Aber genau wegen der Anonymität und der tiefen Hemmschwelle sollten Beleidigungen ja auch ein viel kleineres Gewicht tragen und das spielt in meinen Punkt, dass sie in League, im Verhältnis zu anderweitigem verwerflichem Verhalten, unproportional stark im Mittelpunkt stehen. Wie gesagt es geht mir nicht zentral darum Toxicity zu rechtfertigen sondern aufzuzeigen, dass andere Arten das Game negativ zu beeinflussen viel eher als akzeptabel abgestempelt werden","replies":[{"poster":"Yuiwara","date":"2020-02-19T17:10:13.832+0000","up_votes":1,"down_votes":0,"body":"> [...] sollten Beleidigungen ja auch ein viel kleineres Gewicht tragen \n\nähm bitte was? Mentale angriffe auf den gegenüber sind nicht weniger effektiv, nur weil man das gesicht seines gegenübers nicht sieht...\n\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"J8ker","date":"2020-02-19T17:14:37.407+0000","up_votes":1,"down_votes":2,"body":"Klar ist es weniger effektiv wenn dir ne zufällige Person, die du nie wieder sehen wirst über ein Spiel das bekannt ist für Streitereien \"Idiot\" schreibt als wenn dir im echten Leben jemand gegenüber sitzt und dich beleidigt. Das ist ja ein Grund warum die Hemmschwelle tiefer ist, weil auch das Gewicht viel kleiner ist. (Natürlich in Verbindung mit der Anonymität)","replies":[{"poster":"Burtor","date":"2020-02-20T08:21:42.309+0000","up_votes":1,"down_votes":0,"body":"Also da würde ich gerne einhaken, dass nach meiner Meinung, zu der ich immer noch zu gemütlich bin selbst hier einen Thread zu verfassen, der Grund für die Hemmschwelle nicht durch die die niedrigere Gewichtung der gemachten Aussagen sondern der fehlenden/zu schwachen Konsequenzen bei negativem Verhalten ist.\n(Sorry für diesen langen und verschachtelten Satz. Bin Grad mit dem Handy während der Frühstückpause auf den Boards)\n\nDie Anonymität im Internet gibt vielen Leuten die Vorstellung, dass sie sich im Internet Verhalten können wie sie wollen, da niemand weiß wer sie sind. Und die schlimmsten strafen sind meist die Sperrung das Benutzerkontos der jeweiligen Seite oder des Spiels.\n\nDazu kommt bei League of Legends die Einfachheit sich einen neuen Account zu erstellen. Ich selbst besitze keine smurfaccounts aber in meinem Bekanntenkreis  ist es oft normal 2-3  extra zu haben, sei es um mit Leuten anderer elos rankeds zu spielen oder was auch immer.\n\nNatürlich entspringt ein großer Teil der Toxizität auch dem Fehlverhalten von Spielern die im allgemeinen als Trolle bezeichnet werden. Aber auch deren Verhalten wird durch die Anonymität verstärkt.\n\nIch persönlich reporte jedwede Art von Toxizität, nicht weil ich mich davon angegriffen fühle (ich wurde mehrere Jahre in der schule gemobbt und habe mittlerweile ein dickes Fell), sondern weil ich die Einstellung und Bereitschaft dieser Leute sich unsportlich/unsozial zu verhalten mit den entsprechenden Konsequenzen konfrontieren will.","replies":[]},{"poster":"Yuiwara","date":"2020-02-19T21:45:31.123+0000","up_votes":1,"down_votes":0,"body":"Die Auswirkung auf den Moment ist genau gleich in beiden situation (rl beleidigung, Ingamebeleidigung). und sowohl ingame als auch außerhalb des games kann man den beleidigenden wiedertreffen. Der einzige unterschied ist, dass man mit höherer wahrscheinlichkeit die ingame-beleidigung schneller vergisst, weil man keine verbindung zu den menschen hat, die es längerfristig im gehirn abspeichern würden.\n\nFolglich: Es ist **NICHT **weniger effektiv und sie tragen **kein** \"kleineres Gewicht\". somit sollte sowohl ingame als auch außerhalb des games beleidigung als strafbestand gelten. Da man verbal geäußerte beleidigungen schlecht verfolgen kann, kann man das schlecht zur anzeige bringen, ist aber potentiell möglich. bei schwarz auf weiß beleidigungen ist es nunmal gut verfolgbar und man kann gut ne nulltoleranz anwenden. und genau das sollte gemacht werden meiner meinung nach.","replies":[]},{"poster":"Aymira","date":"2020-02-19T21:38:06.382+0000","up_votes":1,"down_votes":0,"body":"> Klar ist es weniger effektiv wenn dir ne zufällige Person, die du nie wieder sehen wirst über ein Spiel das bekannt ist für Streitereien \"Idiot\" schreibt als wenn dir im echten Leben jemand gegenüber sitzt und dich beleidigt.\n\nGlaube das ist absolut nicht zu pauschalisieren. \nMich juckt es überhaupt nicht, wenn jemand so einen Unsinn schreibt. \n\nAber eine andere Person könnte sich trotzdem angegriffen und verletzt fühlen. \n\nIch weiß nicht mehr wie, aber ich hab ein Gespräch mit meinem Vater über die Online Welten geführt. Und das man sich Todesdrohungen, Beleidigungen und so weiter oft anhört und damit lebt, drüber lacht wie lächerlich sich manche Menschen verhalten und und und. \n\nWas meint du wie entsetzt und besorgt er dann wirkte. \nKönnte mir also schon vorstellen das es Menschen gibt, die sich ernsthaft Gedanken darüber machen wenn Person XY hinter irgendeinem Monitor was böses gesagt hat. Egal in welchem Ausmaß :D","replies":[]}]}]}]}]}]}]},{"poster":"Megamaexx","date":"2020-02-20T08:37:46.215+0000","up_votes":4,"down_votes":0,"body":"> Welches Verhalten ist verwerflicher? Das Verhaltens des Spielers, der sich nicht für einen Sieg einsetzt weil er autofilled ist oder weil sein champ gebannt wurde oder weil es sein 10tes spiel heute ist etc. etc. oder das Verhalten des Spielers der eine abwertende Nachricht im Chat verfasst als Reaktion darauf, dass diese Person gerade die Zeit von 4 zufälligen Leuten verschwendet.\n\nIch frage mich gerade, ob ich zur ersten Kategorie gehöre, immerhin spiele ich das Spiel, wenn ich Bock drauf hab und zocke gemütlich vor mich hin und nicht, um mit allen Mitteln gewinnen zu wollen. Vielleicht bin ich gerade deswegen so entspannt, wenn da mal jemand kacke spielt. Die Gründe dahinter jucken mich nicht.\nWas mich dann allerdings stört, sind die Leute, die dann den Chat zum Jammern und Heulen missbrauchen. Ich hab doch gerade mitbekommen, wie schlecht jemand spielt, das muss doch nicht noch mal im Chat wiederholt werden. Da muss man dann auch kein \"Idiot\" dahintersetzen, das hilft niemandem weiter. (Wobei \"Idiot\" wohl zu den selteneren Beleidigungen zählt, die mir so auffallen.) \n\n> Meiner Meinung nach ist jemand, der zwar im Chat aufbrausend ist, sich aber trotzdem Mühe gibt wesentlich akzeptabler als ein Spieler der (entgegen seines eigentlichen Könnens) das Spiel erschwert / verliert.\n\nKurz gesagt, lieber nen Flamer als nen Spieler, der nen schlechten Tag bzw n schlechtes Spiel hat? ;) Nein danke.\n\n> Alleine schon dadurch, dass man sich über die mute Funktion ohne Probleme gegen negative Kommentare wehren kann, jedoch gegen besagte Gleichgültigkeit sind einem jegliche Hände gebunden.\n\nKlar kann man den dann muten. Allerdings macht das sein Geschreibsel nicht ungeschrieben und der Spieler ist dann als Flamer geflaged. Mal abgesehen davon, dass man für den Mute sich kurz selbst aus dem Spiel nimmt, was in Kampfsituationen eben nicht möglich ist, zB Teamkampf läuft, Flamer stirbt, weil jemand nicht schnell genug reagiert, Beschimpfungen folgen, Spam-Ping folgt, man selbst ist am Kämpfen und kann sich dann entscheiden, ob man stirbt und mutet oder das erträgt und kämpft. \n\n> [...] Trotzdem kann man schwer dagegen argumentieren, dass League aufgrund von solchen Gegebenheiten eine unbestreitbare Quelle von kurzzeitiger Frustration ist.\n\nDas ganze Leben ist gespickt mit kurzzeitiger Frustration xD Man tickt ja auch nicht komplett aus und beleidigt Leute im Supermarkt, nur weil das Wunschprodukt bereits ausverkauft ist. Wobei, manche machen sowas... Die finde ich aber auch sehr störend. \n\n> Doch dies ist gar nicht wirklich weiter tragisch, denn diese Frustration ist letztendlich bei vielen Spielen über die Jahre eine Erfolgsformel gewesen.\n\nJa, jedes gute Spiel sollte sowas haben, dafür ist die Belohnung danach auch immerhin vorhanden. Das Problem ist eben, dass es nicht nur auf Eigenleistung ankommt. Das ist eben auch der Grund, warum ich denke, dass viele Leute nicht für diese Sorte von Spiel geeignet sind.\n\n> Warum also sind kleine Manifestationen dieser Frust zu einem derartigen Tabuthema geworden?\n\nNaja, Beleidigungen sind streng genommen gesetzeswidrig. Ich persönlich finde die Chatausartungen einfach nur störend. Ich will zocken, nicht chatten. Und das auch fair.\n\n> Wenn jemand beim Fussball zu faul ist um zu rennen wird er auch die ein oder andere Bemerkung ertragen müssen und das im Internet gleich alles eine Stufe extremer ist, ist ja kein Geheimnis.\n\nMeine Erfahrungen mit Fußball liegen schon eine Weile zurück, da gab's dann schon Kommentare, allerdings beleidigungsfrei und es wurde dann schon versucht, die Person bestmöglich einzubinden. Da haben die Leute aber auch rechtzeitig gemerkt, dass sie gerade unnötig quatschen und da ist auch der Unterschied. In der Hitze des Gefechts können Worte deinen Mund verlassen. Bis diese die Tastatur erreichen, dauert es länger. Bis dahin sollte man seine Sinne wieder beisammen haben und reflektieren können, was einem das Getippte denn bringt. Scheinbar reagiert das Gehirn bei manchen aber für mehrere Sekunden nicht mehr, sobald die die Tastatur berühren...\n\n> Wie steht ihr zu Toxicity in League und wo ist bei euch die Grenze?\n\nToxisch sein ist kacke. Wer es nicht lassen kann, sollte den Chat ausschalten. Andere Spieler sind nicht das Ventil, an dem ihr euren Frust ablassen dürft. Also keine Grenze.\n\n> wie sollte Riot dies handhaben wenn man bedenkt, wie schwer es ist, bestimmte Dinge nachzuweisen?\n\nDie Chatanalysen können gerne so weiterlaufen wie bisher. Die sind ja doch noch relativ lasch, sofern man nicht gleich mit Hatespeech um die Ecke kommt.\n\n> wie sollte Riot dies handhaben wenn man bedenkt, wie schwer es ist, bestimmte Dinge nachzuweisen?\n\nSchlechtes Spielen sollte weiterhin nicht bestraft werden, auch wenn der Spieler vielleicht gerade unter seinem eigentlichen Niveau spielt und/oder unmotiviert ist.\n\nAbsichtliche Sabotage, also das aktive Verlieren von Spielen, sollte auch weiterhin so bestraft werden wie bisher, die Erkennung ist aber weiterhin stark verbesserungswürdig. Ein Community-Projekt könnte da helfen, wo Spieler ihre Meinung zu Spielen angeben, wo angeblich geintet wird. Sind die Spieler für einen Bann, müsste das von Riot noch nachgecheckt werden und dann können die ihren Algorithmus damit füttern. Ich hoffe doch, dass Riot bei dem Thema Bot-Erkennung und Inting auch machine learning betreibt, leider wirkt es aber nicht so.\n\nWas ich nicht unerwähnt lassen möchte, nur weil die Erkennung bei einer Art negativen Verhaltens nicht gut funktioniert, muss man nicht die Regeln für andere Arten des Fehlverhaltens lockern.","replies":[]},{"poster":"eingew","date":"2020-02-20T19:12:45.412+0000","up_votes":3,"down_votes":0,"body":"Mal von den ganzen anderen Argumenten abgesehen, muss ich sagen, dass ich das in meinen Spielen nicht so wahrnehme, dass der meiste Flame gegenüber schlechten Spielzügen geäußert würde. LoL ist viel zu komplex, als dass man aus der Situation heraus so oft sagen könnte, dass der andere Spieler eine von vorneherein offensichtlich falsche Entscheidung getroffen hat. Oft wird aus anderen Gründen so gespielt, wie gespielt wurde, als der Flamer denkt. Nicht selten war es auch der Flamer selbst, der einen gravierenden Fehler gemacht hat.","replies":[]},{"poster":"Aymira","date":"2020-02-19T14:57:29.024+0000","up_votes":3,"down_votes":0,"body":"Werd einfach mal auf die Frage antworten, anstatt jeden Punkt in deinem Text zu kommentieren.. :D\n\n> Wie steht ihr zu Toxicity in League und wo ist bei euch die Grenze?\n\nIm allgemeinen würde ich sagen, das ich der ganzen giftgikeit ziemlich abgeneigt bin, welch Wunder. Ich sehe keinen Sinn darin mir sowas zu geben, ich sehe keinen Sinn darin mich damit zu beschäftigen und ich sehe auch keinen Sinn mich daran zu beteiligen. \nIch finds einfach nur albern und kindisch, wenn man sich giftig gegenüber anderen verhält. \n\nWo zieht man nun also die Grenze. \nIch versuche stets normale Aussagen im Chat zu treffen, sollte ich überhaupt mal was schreiben. Ich schalte Spieler nicht stumm, egal was sie sagen um am Ende zu schauen wo die Meldungen berechtigt getätigt werden müssen. \n\nUnd dabei geht es schon los, wenn mich jemand Idiot nennt. Das liegt nicht daran, dass mich das groß stört, nein. Aber es hat in einem Spielchat irgendwie nichts verloren, genau wie eine Konversation über das heutige Mittagessen dort nichts zu suchen hat. Soll sich die Person denken was sie will, aber es einfach aus dem Chat rauslassen wäre dann schön.\n\nDas heißt, ich melde Leute auch schon für Kleinigkeiten, weil ich eben diese schon als \"berechtigt\" betrachte. \nMag vielleicht auch kindisch sein, sowas bestraft sehen zu wollen, aber ich spring im Spiel, egal obs Liga der Legenden oder irgendwas anderes ist, nie drauf an und lass mich aus der Ruhe bringen. Was ich im Nachhinein also mache in Bezug auf die Meldung muss keiner wissen, während ich aber immer wieder hoffe das diese ganze Giftigkeit mit jeder Meldung etwas abnimmt. Wird aber nie passieren, glaube ich. :D\n\n> und wie sollte Riot dies handhaben wenn man bedenkt, wie schwer es ist, bestimmte Dinge nachzuweisen?\n\nAlso ich finde, das man Leute die AFK gehen, absichtlich - quasi auf Ansage, härter rannehmen muss.\nGibt ja gelegentlich mal Leute die das androhen und dann wirklich durchziehen, wenn man auch nur den kleinsten Fehler macht. \nAlles andere in Bezug auf AFK gehen ist immer so eine Sache. Das Argument, das man ja nicht immer was dafür kann, ist irgendwo berechtigt, irgendwo auch nicht...(schließlich hat man dafür zu sorgen [was nicht immer in eigener Macht steht] das die Verbindung stimmt) Und am Ende kann Riot das sowieso nicht nachvollziehen ob der Netzstecker des Routers gezogen wurde oder aber der Provider Probleme macht. \n\nIn Bezug auf jene Leute, die dir ein Spiel absichtlich ruinieren, oder dem Gegner zuspielen. \n\nDa muss ich sagen, das ich diese Fälle bislang wirklich sehr sehr selten nur erlebt habe, das jemand offensichtlich das Spiel verlieren will. \nEs gibt ja aber auch die Leute, die versuchen das ganze so bedeckt zu halten, das es eben nicht offensichtlich ist. Hab ich das bislang erlebt? Nein. \n\nWomöglich liegt das aber auch dran, das ich mir während des Spiels keine Gedanken darüber mache ob mein Toplaner eventuell, vielleicht, möglicherweise versucht absichtlich zu verlieren ohne das es auffällt. Dafür hab ich die Situation nicht groß im Blick. Also ist das für mich einfach ein schlechtes Spiel, oder der Gegner war einfach bedeutend besser. \n\nWenn ich jedoch jemanden ertappt habe, der absichtlich das Spiel verliert, dann melde ich das über den normalen Weg, aber schreibe parallel dazu dem Support. Auch wenn der Support sich nie dazu äußert, ob es was gebracht hat oder nicht, waren meine Erfahrungen in Bezug darauf immer gut. \n\n***\n\nAbschließend sei eins noch gesagt:\nIch gehöre nicht zu den Personen die nach einer Meldung täglich die Profile der Leute stalken um zu gucken, ob sie tatsächlich bestraft wurden. Ich schließe mit der getätigten Meldung ab und überlasse den Rest der höheren Macht des Bannhammers von Riot. ¯\\\\\\_(ツ)_/¯\n\nIm Bereich, in Bezug auf meinen Rang, sehe ich diese Leute sowieso nicht wieder, oder kann mich selbst 5 Spiele später nicht mal mehr an diese Personen erinnern. Die demenz macht mir dann doch zu schaffen... Oder ist ein Segen? Kann man sehen wie man will. xD\n\nDoch viel Text für 2 Fragen. Uff. Eigentlich wollt ich mich kurz fassen. :]","replies":[{"poster":"Yuiwara","date":"2020-02-19T16:14:12.290+0000","up_votes":1,"down_votes":0,"body":"> Es gibt ja aber auch die Leute, die versuchen das ganze so bedeckt zu halten, das es eben nicht offensichtlich ist.\n\nja sowas hatte ich mal. der hat glaub teemo jng gepickt und ist auf verschiedene lanes zum sterben gelaufen, hat teils auch noch bisschen gefarmt und auch ab und zu ein attack raufgesetzt für assist um keine absolut negative kda zu haben, aber hat sich nicht wirklich gewehrt, während er gekillt wurde. wenn ich mich recht erinnere war es, weil ihm sein champ im select vom teammate gebannt wurde.\n\nSo spielt er dem gegner zu, ohne dass es direkt offensichtlich ist und natürlich schwer nachzuweisen. glaub aber er wurde dennoch gebannt (hatte zumindest kurz danach ne ingamemitteilung zu bestrafung erhalten, durch mehrere tickets gleichzeitig aber schwer zu sagen ^^).","replies":[{"poster":"Aymira","date":"2020-02-19T16:32:29.390+0000","up_votes":1,"down_votes":0,"body":"Ich kann dir halt nicht sagen ob ich sowas schonmal erlebt habe.\n\nGrundsätzlich, wie bereits gesagt, achte ich nicht so explizit drauf. Und selbst wenns mir mal aufgefallen ist, dann hab ichs halt schnell wieder vergessen... xD","replies":[{"poster":"J8ker","date":"2020-02-19T16:46:40.980+0000","up_votes":1,"down_votes":1,"body":"Wenn du mehr als 20 Spiele gespielt hast ist die Chance sehr hoch, dass du das schon erlebt hast. \n\nFinde ich sehr achtenswert, dass man sich trotz der Tatsache, das solches Verhalten an jeder Ecke zu finden ist komplett isoliert auf sein eigenes Gameplay konzentrieren kann.","replies":[{"poster":"Aymira","date":"2020-02-19T17:01:20.794+0000","up_votes":2,"down_votes":0,"body":"Ich bin in der Liga seit der Beta. Mal mehr, mal weniger.\n\nIch häng mich nicht mehr dran auf, wenn was stört. Wozu auch. :D\nMan wird ja auch nicht jünger. xD\n\nUnd tatsächlich muss ich sagen, das mir offensichtliches verlieren echt selten untergekommen ist in all den Jahren. Ich kann mich an keinen Fall spezifisch erinnern... Auf die Masse an Spielen ist es also in meinem Fall verschwindend gering. \n\nUnd wie bereits erwähnt. Die andere Art von absichtlich verlieren, wo es versucht wird zu verschleiern, gab es bei mir nie, oder ich bekomm das einfach nicht mit xD","replies":[{"poster":"Sirrkas","date":"2020-02-21T16:51:02.484+0000","up_votes":1,"down_votes":0,"body":"Ich glaube ich hatte bisher eine Hand voll Spieler, die absichtlich verlieren wollten. Ein Draven, der 5 mal in der Lane geschnappt wurde und dann afk ist oder in der Base im Kreis tanzt. Am Ende hat er dann doch noch richtig gespielt.\n\nEin mal jemand, der mir die Lane gestohlen hat und dann, obwohl ich es ihm nach anraten des Teams überlassen habe, dennoch getrollt hat.\n\nUnd ich glaube noch einer, bei dem ich mir nicht sicher bin, ob das Absicht war oder ein sehr verwirrter Spieler. Der hat 3 mal in 40 Minuten alle Items verkauft und neue geholt.","replies":[]}]}]}]}]}]},{"poster":"Rena","date":"2020-02-19T15:38:29.779+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=J8ker,realm=EUW,application-id=KYnfKGf0,discussion-id=EAFR5qxo,comment-id=,timestamp=2020-02-19T14:15:46.514+0000)\n>\n> Welches Verhalten ist verwerflicher? Das Verhaltens des Spielers, der sich nicht für einen Sieg einsetzt weil er autofilled ist oder weil sein champ gebannt wurde oder weil es sein 10tes spiel heute ist etc. etc. oder das Verhalten des Spielers der eine abwertende Nachricht im Chat verfasst als Reaktion darauf, dass diese Person gerade die Zeit von 4 zufälligen Leuten verschwendet. \n\n\nIch werde es wohl nie verstehen weshalb so viele Leute diese Frage stellen.\nEs geht doch nicht darum welches verhalten jetzt verwerflicher ist.\n\nFakt ist, **beides** trägt negativ zum Spiel bei und reduziert die Gewinnchancen.\nBeides ist daher strafbar und es ist egal wer angefangen hat bzw. wer zuerst am griefen/flamen war.\nWir sind ja nicht mehr im Kindergarten.\n\nIch rege mich auch innerlich auf, wenn jemand die Mitte runter rennt und da nehme ich es auch niemandem übel, wenn er mal im Chat tilted als Reaktion.\nAber hier ist schon das Problem... Das kommt echt selten vor.\n90% sind es einfach Leute, die missplayen/Autofilled sind/sich mit dem Matchup nicht auskennen etc.\nIst es nervig? Ja. \nIst es ein Grund zum Flamen? Nein.\nJeder versucht zu Gewinnen, also wieso sollte da Flamen okay sein?\nIch weiss, dass viele high Rank Streamer teilweise daran Schuld sind. \"Omg this guy doesn't wanna win he is trolling so I wont play\" obwohl dies gar nicht stimmt.\nIn diesem Falle habe ich kein Verständnis für flamen.\nIch würde sogar sagen, dass Flamen in diesem Falle griefen ist, da es die Gewinnchancen reduziert obwohl jeder versucht zu gewinnen.\n\nAber hey...  ist auch nur meine kontroverse Meinung.","replies":[{"poster":"Aymira","date":"2020-02-19T15:45:48.196+0000","up_votes":2,"down_votes":0,"body":"> Ich weiss, dass viele high Rank Streamer teilweise daran Schuld sind. \"Omg this guy doesn't wanna win he is trolling so I wont play\" obwohl dies gar nicht stimmt.\n\nWas mich an manch Streamern irgendwie stört ist, dass diese mit einer echt miesen Mentalität sogar noch im Partnerprogramm von Riot sind. \n\nDie sind teilweise im Chat offensiv, aber das meiste hauen die halt im Stream selbst gegen Leute raus. \n\nTwitch und LoL sind zwar 2 Plattformen, aber wenn jene Streamer irgendwie repräsentativ für LoL sind, dann find ich das irgendwie nicht gut. \n\nWie du schon sagst, viele gucken sich solch Verhalten dann ab und denken es sei ok. &lt;.&lt;","replies":[]},{"poster":"J8ker","date":"2020-02-19T16:14:00.489+0000","up_votes":1,"down_votes":1,"body":"Ich bin schon der Meinung, dass die Frage nach der Verwerflichkeit eine Berechtigung hat, einfach dadurch dass die Reaktion der Community und von Riot auf die beiden Verhalten so unterschiedlich ist und dass eben selten beides wirklich eine Strafe nach sich zieht \n\nMein Punkt war, dass sowohl flamen als auch gleichgültiges vor sich hinspielen oder Sachen ausprobieren einen sehr negativen, unnötigen Impact auf ein Game haben können, flamen aber ein unendlich höheres Gewicht zu tragen scheint. Ich will nicht eine Normalisierung von Fehlverhalten, aber eine rationale Abwägung von kleinen Sticheleien und von absichtlicher Chancenverschlechterung für das Team dadurch, dass man einfach z.B. 10 Games hintereinander auf Autopilot durchrattert. Dabei rede ich auch nicht von absichtlichem runterrennen oder AFK gehen, sondern einfach von einer Gleichgültigkeit bezüglich des Outcomes.\n\nSolches Verhalten ist meines Erachtens nach nicht sonderlich selten und kann ich auch bei mir selber oder bei Freunden feststellen und die Tatsache, dass es hier als selten angesehen wird ist für mich nur ein Indiz, dass es eben selten thematisiert wird. Besagtes Verhalten würde auch im Arbeitsleben / in der Sportmannschaft oder sonst irgendwo im echten Leben auf Kritik stossen. Natürlich ist eine Beleidigung in keiner Situation eine Lösung, aber ist es wirklich lobenswert in einem Spiel, das man offensichtlich selber verloren hat alle Hebel in Bewegung zu setzen, dass ja niemand mehr unter der seelischen Last leiden muss, übers Internet \"Idiot\" genannt zu werden?","replies":[]}]},{"poster":"Moonéyé","date":"2020-02-19T14:59:33.515+0000","up_votes":2,"down_votes":2,"body":"Ich finde, dass ein großer Teil der Community auch einfach lächerlich empfindlich ist. Manchmal gibt es Momente, da sieht man, dass jemand absoluten Unsinn baut oder einen Spell völlig falsch benutzt, weil er ihn vllt nicht richtig versteht oder so. Dann sagt man FREUNDLICH auf normale Art und Weise \"you make more damage, if you...\" oder sowas. Einfach so. \nEs ist auch nur ein Ratschlag, an den man sich halten kann, aber ja nicht MUSS. Was kommt zurück? Geflame! Dabei war es nett gemeint. Entweder man wird beleidigt oder es kommt sowas wie \"I dont do what YOU want, I do what I want... shut up!\" oder sowas. Weil die Leute sich einfach weigern auch nur 2 Sekunden drüber nachzudenken, ob man vielleicht Recht haben könnte.\nEs ist anstrengend. Ich weigere mich halt den Chat auszuschalten, weil ich finde, dass man in einem Teamspiel miteinander kommunizieren können sollte. Zudem spiel ich Support, bin also auf einer DuoLane und da nicht zu lesen, wenn man mit mir kommuniziert find ich bescheuert. Früher konnte man Leute REPORTEN für \"Refuse to communicate\" und heute ist es ein Spielfeature, dass man diese komplett blocken kann. Tolle Lösung...\n\nGenerell bleib ich dabei: Die Leute sind lächerlich empfindlich. Wenn jemand das Caitlyn-Netz in die falsche Richtung macht und sich in 3 Gegner schießt, dann lach ich. Wenn ein Warwick 5 Leute direkt vor der Nase hat und genau zwischendurch ultied statt einen zu treffen auch. Wenn mir sowas passiert, darf man das gerne auch tun. Wenn man aber dann im Chat was schreibt (wohlgemerkt amüsiert und nicht flamend), reagieren die Leute als hätte man sie böse beleidigt. Es ist für mich halt nach wie vor ein SPIEL. Wenn ich was wirklich Doofes mache, was manchmal halt passiert, wenn einfach mal gefühlt einen Aussetzer hatte, dann darf man darüber lachen oder von mir aus auch sarkastisch kommentieren. Flamen und beleidigen natürlich nicht, aber ich finde die Leute nehmen das viel, viel, viel zu schnell negativ auf und rasten aus wegen fast allem was man schreibt.\nZu dem \"Game leaven/afk sein\" muss ich sagen, dass das doch eben NICHT bestraft wird, weil man da eben NICHT sagen kann, ob es Absicht ist (außer man schreibt es explizit vorm Quit).","replies":[{"poster":"Aymira","date":"2020-02-19T15:02:52.015+0000","up_votes":2,"down_votes":0,"body":"> Es ist auch nur ein Ratschlag, an den man sich halten kann, aber ja nicht MUSS. Was kommt zurück? Geflame!\n\nDa muss ich sagen, ich weiß nicht ob die Leute zu empfindlich sind, oder ob sie einfach fest davon überzeugt sind das sie nichts falsch gemacht haben und deswegen sich nicht belehren lassen wollen (mit einem Ratschlag...)\n\nBeides albern, aber ich glaube es ist nicht immer die Empfindlichkeit sondern ggf. auch oft völlige Selbstüberschätzung. :D","replies":[{"poster":"Moonéyé","date":"2020-02-19T15:12:57.258+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Aymira,realm=EUW,application-id=KYnfKGf0,discussion-id=EAFR5qxo,comment-id=00010000,timestamp=2020-02-19T15:02:52.015+0000)\n>\n> Da muss ich sagen, ich weiß nicht ob die Leute zu empfindlich sind, oder ob sie einfach fest davon überzeugt sind das sie nichts falsch gemacht haben und deswegen sich nicht belehren lassen wollen (mit einem Ratschlag...)\n> \n> Beides albern, aber ich glaube es ist nicht immer die Empfindlichkeit sondern ggf. auch oft völlige Selbstüberschätzung. :D\n\nJoah, aber wenn man meint wie man es selber macht ist es richtiger, okay. Aber das wäre ja kein Ding, wenn man sagt \"thanks, but I do it may way\" oder von mir aus auch einfach nix. Aber flamen ist natürlich eine völlig unangebrachte Reaktion... ;)","replies":[{"poster":"Aymira","date":"2020-02-19T15:17:50.777+0000","up_votes":1,"down_votes":0,"body":"> Aber das wäre ja kein Ding, wenn man sagt \"thanks, but I do it may way\"\n\nStimmt, man könnte bei selbstüberschätzung auch freundlich bleiben. Also ja doch. Ist überwiegend die Empfindlichkeit ¯\\\\\\_(ツ)_/¯ \n\n> Aber flamen ist natürlich eine völlig \nunangebrachte Reaktion... ;)\n\nGut, das sowieso. xD","replies":[]}]}]},{"poster":"eingew","date":"2020-02-20T19:09:03.858+0000","up_votes":3,"down_votes":1,"body":"Ich persönlich höre Tipps zu Items, Runen oder Summoners auch nicht gerne. Ich habe mir bereits vor dem Spiel Gedanken darüber gemacht, was ich baue und habe ehrlich gesagt kein Interesse an weiteren Meinungen, als denen, die ich mir dazu im Internet eingeholt habe. Ich brauche keine Kritik dieser Art. Und dazu kommt noch das aufgeheizte Klima im Spiel, wo solche Tipps üblicherweise eher als Schuldzuweisung gedacht sind, selbst bei höflicher Formulierung. Da wirft man dich nun mal schnell in einen Topf mit den falschen Leuten. Natürlich ist der Flame dennoch völlig ungerechtfertigt. Ich persönlich hätte dich womöglich allerdings auch stumm geschaltet, wenn du mit sowas bei mir im Spiel anfangen würdest, aus purer Erwartung, dass gleich ständig an irgendwelchem Krams herumgeknittelt wird.","replies":[{"poster":"Sirrkas","date":"2020-02-21T16:48:28.183+0000","up_votes":2,"down_votes":1,"body":"Kommentare zu Items wirken meist sehr arrogant. Zumindest, wenn es weiter geht als \"they got a lot of ad, we need some armor\". \n\nIch hatte schon einige Spiele, bei denen die Person die mit etwas wie \"omg why you dont buy XY\" oder \"XY is bad, sell it an go ZY\" kommt, zugleich die einzige Person ist, die nicht im Team spielen kann. Sei es weil sie sich für besser hält, meint die Weisheit mit Löffeln gefressen zu haben oder sonst was. Bisher lief es immer darauf hinaus, dass man im 4vs5 besser aufgehoben war, als auf den arroganten Spieler zu hören, insbesondere, wenn dieser gerade das dritte mal in Folge im gegnerischen Jungel gestorben ist, weil er sich einen einfachen Kill am Bluebuff erhofft hat.","replies":[]}]}]}]}