{"poster":"Te voy a Trolear","date":"2019-11-06T05:36:38.820+0000","title":"tengo una duda, si alguien es tan amable de responder...","subforum":"Charlas Generales","up_votes":3,"down_votes":1,"body":"Es bueno alguien en platino 4  0 pl con casi 700 partidas soloq? mas de 250 en flex en plata 2? nada solo una duda cosmica.","replies":[{"poster":"Bad Gyal","date":"2019-11-06T06:43:49.877+0000","up_votes":2,"down_votes":4,"body":"Es necesario hacer un post por cada bolu2 que te topás en el foro stucked en p4? xD\nPointless. {{item:3151}}","replies":[{"poster":"Te voy a Trolear","date":"2019-11-06T06:49:13.268+0000","up_votes":2,"down_votes":2,"body":"es el primer post que hago sobre esto, no se si te equivocaste de nombre.","replies":[{"poster":"Bad Gyal","date":"2019-11-06T06:56:22.030+0000","up_votes":1,"down_votes":4,"body":"Tal vez hay muchos cry babies así aquí nevermind \n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Ðragón","date":"2019-11-06T07:19:27.969+0000","up_votes":3,"down_votes":0,"body":"Si te molesta, para que entras y lo lees?","replies":[{"poster":"Bad Gyal","date":"2019-11-07T04:11:22.682+0000","up_votes":1,"down_votes":1,"body":"porque siempre son los mismo bebes en el foro llorando por cosas irrelevantes como tu lo estas haciendo ahora","replies":[{"poster":"Ðragón","date":"2019-11-07T04:32:20.805+0000","up_votes":1,"down_votes":0,"body":"Ojala te recuperes &lt;3","replies":[]}]}]},{"poster":"Te voy a Trolear","date":"2019-11-06T07:33:41.166+0000","up_votes":2,"down_votes":0,"body":"estaria bueno un comentario que aportara algo ¿no? osea sin hate sin sentido, ni deshaogo por malas partidas. algo asi como manúte.","replies":[{"poster":"Bad Gyal","date":"2019-11-07T04:11:40.659+0000","up_votes":1,"down_votes":1,"body":"lo mismo con tu post y lo que comentas en cada post","replies":[{"poster":"Te voy a Trolear","date":"2019-11-07T05:28:23.045+0000","up_votes":1,"down_votes":1,"body":"me puedes decir que te molesta?, acepto criticas constructivas, ahora si son webadas sin sentido por que estas triste pues... creo que no me serviran las criticas... como al comentario al que le estoy respondiendo..","replies":[]}]}]}]}]}]},{"poster":"Manúte","date":"2019-11-06T05:39:15.845+0000","up_votes":2,"down_votes":0,"body":"JAJAJAJAJA me tente por el otro post.\na mi criterio no,estaria por debajo del promedio,tengo amigos que empezaron a jugar este año y llegaron a oro con 25 o 30 partidas,a platino con 60,pero es lo que yo vi,deberias buscar estadisticas en paginas como op.gg","replies":[{"poster":"Te voy a Trolear","date":"2019-11-06T05:43:11.651+0000","up_votes":2,"down_votes":0,"body":"gracias, si ya me fije en op.gg pero queria ver la opinion de otras personas tambien.","replies":[]}]},{"poster":"Ðragón","date":"2019-11-06T06:13:05.396+0000","up_votes":2,"down_votes":1,"body":"No...","replies":[]},{"poster":"Sztrinka","date":"2019-11-07T13:19:14.137+0000","up_votes":1,"down_votes":0,"body":"yo pienso que desde hierro hasta platino nadie es bueno, si bien en platino alto capaz se tiene un poco mas de conocimiento del juego y capaz toman mejores deciciones pero oro ya es cuelquier cosa (para mi oro es un desastre de liga, los jugadores ahi no saben jugar ni la propia linea  o personaje que mainean, no toman buenas decisiones para nada!!) pero en verdad la gente que si sabe mucho y aparte de saber sabe usar las manos es diamante alto en adelante.\n\ncreo que si alguien esta en platino 4 con demasiadas partidas es porque ya no puede subir mas que eso y aparte de eso esta rosando oro, platino bajo es lo mismo que oro alto. 700 partidas son demasiadas, yo me miraria guias y videos si estoy asi de estancada porque eso significa que no puedo progresar y no lo estoy haciendo del todo bien, solo hay que prestar mucha atencion y practicar! asi se sube facil jaja esta persona con 700 partidas se ve practico mucho jajajaaj pero creo le falto verse videos de algun pro para aprender tips y aprender a tomar buenas decisiones y ponerlas en practica.","replies":[{"poster":"Te voy a Trolear","date":"2019-11-08T04:39:04.952+0000","up_votes":1,"down_votes":0,"body":"ty por la respuesta {{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"Assassin Whisper","date":"2019-11-07T05:43:12.241+0000","up_votes":1,"down_votes":0,"body":"Hay que ver todo, no es lo mismo en 1 cuenta sin MMR/ELO porque jugaras clasificatorias por primera vez que una cuenta que lleva sus años en ligas inferiores y arranca con el MMR/ELO por el piso. Pero me da que son demasidas 700 partidas.","replies":[{"poster":"Te voy a Trolear","date":"2019-11-07T07:56:03.293+0000","up_votes":1,"down_votes":0,"body":"a mi me tocan adc con mas de 1000 partidas la mayoria de veces, pero si considero que pasando las 400-500 ya son demasiadas, ty por la respuesta.{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}