{"poster":"LucyXChaan","date":"2015-11-12T13:49:56.756+0000","title":"Euer Soraka Build und Masteries?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":0,"body":"Da ja die neue Preseason gestartet ist, gibt es nat&uuml;rlich auch neue Masteries.\r\nWas sind eure wichtigsten f&uuml;r Soraka und warum?\r\nIch pers&ouml;nlich habe viele Punkte auf R&uuml;stung, Leben und Manaregeneration vergeben.\r\nBis jetzt bin ich ganz gut damit ausgekommen.\r\nWas haltet ihr davon das es keine Manapots mehr gibt? Soraka braucht diese eigentlich ja im earlygame und man muss &ouml;fters zur Base zur&uuml;ck. Mich st&ouml;rt das sehr wenig.\r\n\r\nFreue mich &uuml;ber Antworten von anderen Supportern :)","replies":[{"poster":"YouMadBroLTP","date":"2015-11-14T12:54:37.902+0000","up_votes":1,"down_votes":0,"body":"uralte Münze für Gold\ncdr/ap items mit hp\n3k hp+warmongs\n\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2385958254/29431441","replies":[]},{"poster":"Lagbeard","date":"2015-11-12T18:40:17.320+0000","up_votes":1,"down_votes":0,"body":"Lohnt sich denn Soraka überhaupt noch? Ruf des Henkers ist schnell und billig zu bekommen, und braucht nicht mal <50% Life um klaffende Wunden auszulösen, wie es das Morellos tut. Ich selbst habe immer gerne Soraka gespielt, aber macht mich der Henker nicht schon in der Laningphase useless? Und in der Kombination mit Hurrikan finde ich auch im Teamfight keine Möglichkeit mehr, effektiv Schaden zu verhindern. Da man Soraka ja eh eher in teams mit Squishy Burstchamps und/oder Assassins spielt, fält nicht einmal der verlust des Prozentualen DMG des anderen Armorpenbogens ins Gewicht, da die Lebensunterschiede zwischen den Carries und Assassins nicht so gewaltig sind. Was meint ihr, und was kann ich dagegen tun?","replies":[{"poster":"Lady Yunalesca","date":"2015-11-12T19:38:34.290+0000","up_votes":1,"down_votes":0,"body":"Das item verursacht nur  klaffende Wunden für lifereg/lifesteal und etc, das heißt ihr Q wird dadurch geschwächt nicht aber ihr Teamheal,außerdem ihre ult cleanst ja die Wunden.\nAußerdem sind ihre heals mit der Mastery einfach retarded strong,hatte bisher noch keine probleme~","replies":[{"poster":"Lagbeard","date":"2015-11-13T14:19:23.809+0000","up_votes":1,"down_votes":0,"body":"Häh? Ich hab das Morellos gegen Soraka die ganze Zeit umsonst gebaut? Galt das Ding nicht gerade wegen den Klaffenden Wunden als Mittel gegen Soraka? Die Erklärung steht da zwar nicht mehr, aber Ich meine da stand was von \"Erhaltener Heilung\". Oder Wirken die Wunden nun auch anders?","replies":[{"poster":"Lady Yunalesca","date":"2015-11-13T14:22:42.944+0000","up_votes":1,"down_votes":0,"body":"Es ging nicht um morello sondern um ruf des henkers :)","replies":[{"poster":"Lagbeard","date":"2015-11-13T14:27:20.497+0000","up_votes":1,"down_votes":0,"body":"Beides verusacht \"Klaffende Wunden\" galt in LoL nicht irgendwann mal \"gleicher Buff, gleiche Wirkung\"?","replies":[{"poster":"Nezraddin","date":"2015-11-13T14:51:39.055+0000","up_votes":1,"down_votes":0,"body":"Zitat: „Klaffende Wunden“ betrifft nun nur noch die Selbstheilung und nicht mehr die gesamte Heilung.\n\nWurde also so verändert, dass \"Heilung von anderen\" (eben eine Soraka die dich heilt) nicht mehr reduziert wird. Nur noch das was du selbst als Heilung mitbringst (Lebensreg, Lebensraub, Heilung die du auf dich selbst wirkst).","replies":[{"poster":"Lagbeard","date":"2015-11-13T16:04:08.545+0000","up_votes":1,"down_votes":0,"body":"Okay, danke. Habs nun auch in den Patchnotes gefunden. Schade, dass die Wirkung nicht mehr beim Item dabeisteht, wenn später jemand einsteigt möchter er bestimmt nicht 200 Seiten Patchnotes lesen (Je nach dem wann er mit LoL anfängt :D) um das rauszufinden :D","replies":[{"poster":"Bergelmir32","date":"2015-11-13T16:16:15.985+0000","up_votes":1,"down_votes":0,"body":"Das Problem besteht schon länger. LoL kommt schon ziemlich nah an ein Wiki-Spiel ran, wo man eben immer wieder Sachen im Wiki nachlesen muss z.B. was zählt alles als Projektil und wird von Yasuo und Braum geblockt, welche Fähigkeiten wenden keien Zaubereffekte an und lösen desshalb auch kein Luden Echo oder Berührung des Todesfeuers aus, obwohl sie klar die Bedingungen im Text unter dem Item / der Meisterschaft erfüllen etc.","replies":[{"poster":"Lagbeard","date":"2015-11-13T18:16:34.923+0000","up_votes":1,"down_votes":0,"body":"Ja, ich hatte letztens auch schon mal so etwas mit Kayle. Da wird der AOE ihres E´s nicht von Ruaans geprocct. Rein von der Spielinfo her müsste jemand, der zwischen 2 Minions steht, von beiden den AOE-Schaden bekommen, wenn ich alle 3 gelichzeitig mit Ruunans angreife. Wär natürlich viel zu OP, daher proccen Runaans Pfeile nur den Singletarget DMG. Steht aber nirgends (nicht mal auf LoL Wiki:D) Ich finde schon länger, dass RIOT die Tooltips überarbeiten sollte um die Kategorien zu erweitern. Schon allein, damit man wegen dem Davourer nicht ellenlange Listen bei Wiki hat :D. Einfach präzise schreiben was da los ist, auch wenn dabei so sachen wie \"Konzentriert sich\" \"Kanalisiert Arkane Macht\" etc. Wegfallen. Tooltips les ich ohnehin nur einmal, und danach nur, wenn ich sie nciht kapiere oder was nicht funktioniert :D","replies":[{"poster":"Bergelmir32","date":"2015-11-13T18:48:25.412+0000","up_votes":1,"down_votes":0,"body":"Tatsächlich steht das mit Kayle auch im Wiki aber ein bisschen versteckt unter Strategy.","replies":[{"poster":"Lagbeard","date":"2015-11-13T18:59:43.037+0000","up_votes":1,"down_votes":0,"body":"Tatsache.","replies":[]}]}]}]}]}]},{"poster":"Bergelmir32","date":"2015-11-13T14:39:51.199+0000","up_votes":1,"down_votes":0,"body":"Patchnotes aufmerksam lesen hilft.\nKleiner Tipp: unter \"Systeme\"","replies":[{"poster":"Lagbeard","date":"2015-11-13T15:57:26.067+0000","up_votes":1,"down_votes":0,"body":"Ich hab die Patchnotes gelesen. Aber das ist mir tatsächlich entgangen, da ich nur im Bereich der besagten Items gesucht habe. Danke für die Hinweise!","replies":[]}]}]}]}]}]}]},{"poster":"Bergelmir32","date":"2015-11-13T14:42:18.788+0000","up_votes":1,"down_votes":0,"body":"Da ich grade auf Supports meine Fähigkeiten ganz gerne spamme bin ich schon vor einiger Zeit dazu über gegangen ein Paar Mreg Runen zu benutzen. Da habe ich vorher meist den einen Manapot den ich mir geholt habe letzten Endes wieder verkauft.","replies":[]},{"poster":"Lady Yunalesca","date":"2015-11-12T14:27:36.563+0000","up_votes":1,"down_votes":0,"body":"Bei den neuen Masteries spiele ich Soraka mit 0/18/12 .\nHole mir dabei natürlich movemenstspeed- Cookies- Manareg. -Gold - Cdr- und die Heal Keystone Mastery ich denke da macht es nicht viel Sinn irgendwas anderes zu drehen.\nIm 2. baum nehme ich als erstes die Hpreg. da sich der prozentuale wert von Armor und mr gar nicht so stark lohnen würde,da man als Soraka jetzt nicht unbedingt so viel resi stackt und die hpreg einem early game sehr helfen kann,aber das ist dann eher entscheidung zwischen early oder lategame stat :)\nIch nehme dann den movementspeed für besseres roamen bzw kann es einem auch auf der lane helfen zu entkommen. Und als letztes dann Runic Armor und Insight\n\nich hatte bisher weniger probleme ohne manapots,zumal ja alle manareg. Werte von Champs erhöht wurden,vermutlich musst du einfach besser auf deinen Manahaushalt achten :) d.h vll weniger mit Q poken -was ja viele machen- usw\nZumal du jetzt über längeren zeitraum einen besseren mana-sustain hast\nZusammen mit Coin hast du da langfristig eine gute lane \nbzw beim ersten back hole ich mir gerne das kleine mana reg item was du dann zur 2. stufe vom golditem mit ausbauen kannst- spätestens dann hab ich keine probleme mehr :)","replies":[{"poster":"MacDeath","date":"2015-11-12T17:16:06.801+0000","up_votes":1,"down_votes":0,"body":"Stimme zu\nhttp://imgur.com/g2fnh3n\nWobei ich mich beim Mana-regen auch umstimmen lassen würde, da es im late keine Relevanz hat.","replies":[]}]}]}