{"poster":"BXiviti","date":"2019-06-01T18:22:51.241+0000","title":"Para jugar al LOL no PODES tener vida. Cola De Baja Prioridad. Idea para nuevo sistema? .","subforum":"Problemas Técnicos","up_votes":5,"down_votes":4,"body":"Hola, soy un jugador veterano ya,  soy un smurf en este cuenta. Mi idea es la siguiente:\r\nPara personas como yo que ya estan en la cola de 20 minutos, tipo que cada x partidas jugadas o cada semana o cada mes que resten 5 minutos a cada cola de prioridad. Y arreglen el LAG ;,V.\r\n\r\nPrimero no soy flamer ni toxico, mis razones por irme afk son por eso mismo por irme afk ajaja. No enserio, ej yo soy una personas con hermanos, mi hermano me pide ayuda con algo rapido, SON 2 MINUTOS ME VOY DE LA PARTIDA, Es decir me levanto de la mesa y ta dejo el juego andando, VUELVO LUEGO DE 2 MINUTOS Y QUE PASA? LEVERBUSTER!!, Yo podria perfectamente en ese punto salir de la partida pero NO sigo jugando sabiendo que me VAN A CLAVAR ESA COLA DE BAJA PRIORIDAD.\r\n\r\nSe que este post vendria ser como me desahogo para mi, yo porque se que no sacare nada escribiendo esto, soy solo un jugador mas de los 100 millones que juegan al LOL...","replies":[{"poster":"AMD Radeon RDNA","date":"2019-06-01T18:48:16.250+0000","up_votes":5,"down_votes":0,"body":"Podes tener vida, pero hay otras personas que estan en la partida que han hecho todos sus quehaceres antes de meterse a jugar. Es ley pareja para todos. Si salta leavebuster, es porque no es la primera vez en menos de 5 dias que has hecho lo mismo y el sistema te tiene en la mira....","replies":[]},{"poster":"SoySusan","date":"2019-06-01T19:52:13.035+0000","up_votes":2,"down_votes":0,"body":"Si, son cosas normales  ajenas a nuestro control.\nMuchos con familia o inlcuso cuando viven solos tienen algo que necesitan de su tiempo y tiene que ser atendido. Te llaman por telefono del trabajo, tus hermanos necesitan algo, tus padres te mandan a comprar, el gato te mordisquea los cables...\n\nPor eso nunca perderas la cuenta, pero minimamente te castigan con leaverbuster si cometiste falta mas de una vez, esto es así para todos. Por tu parte, debes entenderlo.\n\n{{sticker:sg-ahri-2}}","replies":[]},{"poster":"Nuke","date":"2019-06-01T19:24:41.869+0000","up_votes":2,"down_votes":0,"body":"Cuando aceptas la partida te comprometes a estar presente xD si no podés, pues no le des a aceptar.","replies":[]},{"poster":"LucianoKD","date":"2019-06-02T21:26:42.346+0000","up_votes":1,"down_votes":0,"body":"Yo solo digo que hace tiempo tuve 20 minutos de baja prioridad y actualmente me metieron una baja de 5 minutos. Así que creo que sí se resetea dentro de un tiempo. Pregúntale a los rioters si pasa o no.{{summoner:4}}","replies":[]},{"poster":"Wz Terri","date":"2019-06-02T14:26:30.273+0000","up_votes":1,"down_votes":0,"body":"Tenés un montón de formas de evitar eso como jugar en horarios que sepas que no haya distracciones, atender tus necesidades antes de jugar, es simple, si sabes que en determinado momento no podes, no juegues ahí y listo, si decís ser smurf y al parecer \"no influye\" irse 2 minutos en una partida... La verdad dudo muchas cosas de lo que contas","replies":[]},{"poster":"RazorToddy","date":"2019-06-01T19:12:59.157+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BXiviti,realm=LAS,application-id=X54mVVp0,discussion-id=WNRBvWvI,comment-id=,timestamp=2019-06-01T18:22:51.241+0000)\n>\n> ej yo soy una personas con hermanos, mi hermano me pide ayuda con algo rapido, SON 2 MINUTOS ME VOY DE LA PARTIDA, Es decir me levanto de la mesa y ta dejo el juego andando, VUELVO LUEGO DE 2 MINUTOS Y QUE PASA? LEVERBUSTER!!\n\nxD","replies":[]},{"poster":"Gahl","date":"2019-06-01T19:14:51.762+0000","up_votes":2,"down_votes":3,"body":"\"Smurf\" con cola de baja prioridad. A mi se me hace que sos terrible toxico, te banearon la main y ahora la smurf","replies":[]}]}