{"poster":"Essembie","date":"2017-11-18T21:59:15.600+0000","title":"Player behaviour going overboard?","subforum":"Player Behaviour","up_votes":12,"down_votes":1,"body":"Today there are 8 posts on the front page of people having gotten 14day suspensions or permas without escalation.\r\n\r\nWhat is going on? Has a new player behaviour team hit town? Has there been a rollout of harsher penalties for lesser offences?\r\n\r\nGenuinely curious because a lot of people seem puzzled at having received punishments which abandoned the punishment tiers for behaviour that has up until now gone on unpunished.","replies":[{"poster":"Tele","date":"2017-11-18T22:51:18.874+0000","up_votes":2,"down_votes":0,"body":"I've noticed it too, I think it could be related to the [recent change in management](https://www.riotgames.com/explore/founders-lane-swap) over at Riot but who knows.\n\nAs to whether this move is good or bad remains to be seen IMO. It's good that the system is going to punish and escalate those who deserve it more quickly, but inevitably we're probably going to see some punishments that aren't very fair or just a bit harsh.\n\nI hope this turns out well though, and we see a big reduction in toxicity :D","replies":[{"poster":"Essembie","date":"2017-11-19T01:21:53.159+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Tele,realm=OCE,application-id=T8eq2lFQ,discussion-id=lz0HkvII,comment-id=0000,timestamp=2017-11-18T22:51:18.874+0000)\n>\n> I&#x27;ve noticed it too, I think it could be related to the [recent change in management](https://www.riotgames.com/explore/founders-lane-swap) over at Riot but who knows.\n> \n> As to whether this move is good or bad remains to be seen IMO. It&#x27;s good that the system is going to punish and escalate those who deserve it more quickly, but inevitably we&#x27;re probably going to see some punishments that aren&#x27;t very fair or just a bit harsh.\n> \n> I hope this turns out well though, and we see a big reduction in toxicity :D\n\nThe war on toxicity is like the war on terror. There is no enemy. There is no victor. It is just a sales pitch.\n\nMy ban was in large part for the use of a racist term which the player behaviour specialist even acknowledged was not being used as an insult but to clarify what the other person said (they said \"goo k work\" and I replied \"did you mean goo k or good\" because I wanted to see whether I was going to report for racism). Got a 14 day suspension on the basis of this even when player behaviour agreed that the system picked me up unfairly and with no context to the conversation.\n\nFrankly I've found the escalation of punishments and the refusal of player behaviour to engage in any serious dialogue about it to be a turn off. Was even encouraged to quit by player behaviour team AFTER the big trigger for the suspension was agreed by player behaviour to have been falsely flagged. And yeah I swear like a pirate but I'm Australian for f*cks sake - this is the land of calling our enemies \"mate\" and our mates \"c*nt\".\n\nPretty pissed off with this direction to be honest. I've played and enjoyed the game for many many years now but this experience has really turned me right off. And it sounds like it is turning others off too.\n\nI'm sure riot will still make a shit tonne of money (particularly so with the changes to BE which appear to be jumping on the \"lets get kids to gamble irresponsibly\" bandwagon). But after respecting the highly profitable business model of riot and promoting it as the \"right\" way to do FTP, the loot-box style direction is fast changing my opinion. Profits at any cost mentalities do have a cost when you exploit players. Look at battlefront 2.\n\nIn less than a month my opinion of the game and the management has been one of \"this is the best game in the world, run by people who care about player experiences\" to \"this is turning into an EA-style shitfest with power tripping player behaviour \"specialists\" who have made a conscious choice to disrespect the players and head towards an exploitative business model because it is run by accountants seeking profit at any cost\".","replies":[{"poster":"kLfBtMarshall","date":"2017-11-19T02:06:43.830+0000","up_votes":2,"down_votes":4,"body":"you got your punishment just move forward and not be a toxic part of this community pls","replies":[{"poster":"Essembie","date":"2017-11-19T04:54:54.164+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=kLfBtMarshall,realm=OCE,application-id=T8eq2lFQ,discussion-id=lz0HkvII,comment-id=000000000000,timestamp=2017-11-19T02:06:43.830+0000)\n>\n> you got your punishment just move forward and not be a toxic part of this community pls\n\nDid you miss this bit:\n\n> Got a 14 day suspension on the basis of this even when player behaviour agreed that the system picked me up unfairly and with no context to the conversation.\n\nThere is a longer description including quotes in this thread: https://boards.oce.leagueoflegends.com/en/c/player-behaviour/ZIpBH3g2-are-riot-employees-racist\n\nPlayer behaviour said, in essence, \"yeah you clearly werent being racist and there is definitely context, but fuck you anyway you keep the 14 day racism ban even though we acknowledge our system picked you up in error\".\n\ndamn just looked through your post history and it looks like you are a  troll. oh well.","replies":[{"poster":"kLfBtMarshall","date":"2017-11-19T11:18:13.114+0000","up_votes":2,"down_votes":5,"body":"troll like you kid.","replies":[]}]}]}]},{"poster":"Hacks4Dayz","date":"2017-11-19T07:36:21.267+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Tele,realm=OCE,application-id=T8eq2lFQ,discussion-id=lz0HkvII,comment-id=0000,timestamp=2017-11-18T22:51:18.874+0000)\n> \n> I hope this turns out well though, and we see a big reduction in toxicity :D\n\nThis is a very easy fix that i am sure Riot can do and overall help everyone.\nI see some people are toxic after a lose streak. I am not talking 1 or 3 games in a row of losing but like 5 or even 10 games in a row.\n\nThis can make someone tilt very easy. Riot should have in place something like lose 3 games in a row they stack the game heavy in your favor to stop you losing.\nEveryone goes on them from time to time. But having away out.. That would help.\n\nBut I am just a lonely player.","replies":[{"poster":"Essembie","date":"2017-11-19T07:48:04.654+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hacks4Dayz,realm=OCE,application-id=T8eq2lFQ,discussion-id=lz0HkvII,comment-id=00000003,timestamp=2017-11-19T07:36:21.267+0000)\n>\n> This is a very easy fix that i am sure Riot can do and overall help everyone.\n> I see some people are toxic after a lose streak. I am not talking 1 or 3 games in a row of losing but like 5 or even 10 games in a row.\n> \n> This can make someone tilt very easy. Riot should have in place a like lose 3 games in a row they stack the game heavy in your favor to stop you losing.\n> Everyone goes on them from time to time. But having away out.. That would help.\n> \n> But I am just a lonely player.\n\nI see what you're trying to say (kinda like a race-assist in mario or something like that) but I dont think that is appropriate for a game like this. And at any rate, a loss streak hits your MMR which means that you generally get teamed up with lower level as your MMR decays so it sortof happens by proxy without riot having to stack the deck in your favour anyway.","replies":[{"poster":"Hacks4Dayz","date":"2017-11-19T10:13:02.605+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Essembie,realm=OCE,application-id=T8eq2lFQ,discussion-id=lz0HkvII,comment-id=000000030000,timestamp=2017-11-19T07:48:04.654+0000)\n>\n> I see what you&#x27;re trying to say (kinda like a race-assist in mario or something like that) but I dont think that is appropriate for a game like this. And at any rate, a loss streak hits your MMR which means that you generally get teamed up with lower level as your MMR decays so it sortof happens by proxy without riot having to stack the deck in your favour anyway.\n\nI understand what your saying there. But lets say your in Bronze 5. Like I was before I got into silver. When your in Bronze 5 your MMR is low as it can go.\nFrom what I have seen going from Bronze to silver is the toxic level drops as you climb. Dont get me wrong thou, people rage. But it is less as time goes on.\nIn bronze 5 to Bronze 3 the toxic level is really insane.. People troll a lot of the time. In fact just like the game I am in right now.. Someone wanted Raka top. The support locked in Raka. So top stole middles pick and now middle and top are going full tilt at one another.\nIf we look at there [history](http://oce.op.gg/summoner/userName=joshuy) { no I am not naming and shaming. They didnt rage or troll they got over it in game} you can see.. A few loses in a row. { This is the [account](http://oce.op.gg/summoner/userName=Istypuff) I am playing on right now }\n\nThis puts the player in a auto defense mode. Meaning they are waiting to be yelled at for not being able to look at the mini map or something like that. Which happens a lot in B5 area. Less as you move up but a lot.\n\nSo when you take into account that they are the lowest MMR.. Where do they fall to to get the heavy sided match?\nWhen someone is losing endlessly.. They be come toxic. When a player wins endlessly they become bored and leave the game. This is why Riot try's for the 50/50.\n\nBut if it was 50/50 like they said. Why is this [player](http://oce.op.gg/summoner/userName=deportednepali) on 37% or better yet this [player](http://na.op.gg/summoner/userName=Imaqtpie) is on 68%.\n\nThis isn't 50/50. So with that in mind.. When a player falls to say 35% win rate. Riot should have something in place to allow to them to get back to 50%. \nIt would reduce the amount of toxic people in the game as they will be saying to them self's. I lost this but that is okay. I know I will win soon.\nRiot can kept it under raps so no one knows this is happening but instead of just going \" BAN HAMMER FOR ANYONE I THINK IS TOXIC \".\n\nFear of disappointment and fear of being thrown out might work on some but it won't work on all. If Riot had a fair system in place. People would respect it. But going from what you see.. There is a issue.","replies":[]}]}]},{"poster":"JasonWazza","date":"2017-11-19T07:34:02.257+0000","up_votes":2,"down_votes":2,"body":"Like Essembie says, it's not to stop toxicity, or it would be banning legitmately toxic players, which it seems to let through the cracks.\n\nIt's to look like they are, because sure as fuck a lot of those bans are false flags, because i can't believe that this system can ban shit, because it can't detect context (which is a lot of what determines what is ban worthy.)","replies":[{"poster":"kLfBtMarshall","date":"2017-11-19T09:28:38.338+0000","up_votes":3,"down_votes":4,"body":"what context? this person is toxic and the punishment is justified yes","replies":[{"poster":"JasonWazza","date":"2017-11-19T10:07:33.382+0000","up_votes":2,"down_votes":2,"body":"Maybe try reading the context, and realise that punishments aren't always justified.\n\nBecause this Community needs no more sheeples thanks.","replies":[{"poster":"kLfBtMarshall","date":"2017-11-19T11:17:47.774+0000","up_votes":2,"down_votes":4,"body":"sheeples? why are you insulting people on the forums","replies":[]}]}]}]},{"poster":"kLfBtMarshall","date":"2017-11-19T02:15:30.011+0000","up_votes":1,"down_votes":3,"body":"on the other end im going as hard as i can and after 2 games of toxic and feeding hard i got 2 14 day suspensions","replies":[]}]},{"poster":"Essembie","date":"2017-11-20T20:41:59.326+0000","up_votes":1,"down_votes":0,"body":"And more 14 day suspensions skipping the tiers. \n\nProtip riot: 14 day suspensions are not candy and it isn't Halloween.","replies":[{"poster":"JasonWazza","date":"2017-11-20T21:13:03.192+0000","up_votes":2,"down_votes":1,"body":"Yeah riot hasn't understood that an \"escalation\" is meant to be for bad things happening constantly and consistently being racist etc. not a one off use of a word that isn't in context.\n\nYou have chat restrictions for a god damn reason, but now i'm not even sure it's possible TO get a chat restriction.","replies":[{"poster":"Essembie","date":"2017-11-21T00:09:08.082+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JasonWazza,realm=OCE,application-id=T8eq2lFQ,discussion-id=lz0HkvII,comment-id=00020000,timestamp=2017-11-20T21:13:03.192+0000)\n>\n> Yeah riot hasn&#x27;t understood that an &quot;escalation&quot; is meant to be for bad things happening constantly and consistently being racist etc. not a one off use of a word that isn&#x27;t in context.\n> \n> You have chat restrictions for a god damn reason, but now i&#x27;m not even sure it&#x27;s possible TO get a chat restriction.\n\nIt was solid of tele to give 2c but shame that riot hasn't commented on what is obviously an issue across the board.","replies":[{"poster":"JasonWazza","date":"2017-11-21T00:30:16.380+0000","up_votes":1,"down_votes":1,"body":"I mean, that's what the volunteers are for, people that can comment on things that riot won't, because of publicity issues, and they can distance themselves from any of the garbage fires they light while still having someone answer it.\n\nAnd if a volunteer fucks up, they aren't a volunteer anymore, and it's not like they have all the info anyway.\n\nThey just don't want to make public speakings when it's not on their side, even before the volunteers, this wasn't something that they would comment on often at all, they would only ever comment on the ones that were justified.","replies":[{"poster":"Essembie","date":"2017-11-28T09:21:15.572+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JasonWazza,realm=OCE,application-id=T8eq2lFQ,discussion-id=lz0HkvII,comment-id=0002000000000000,timestamp=2017-11-21T00:30:16.380+0000)\n>\n> I mean, that&#x27;s what the volunteers are for, people that can comment on things that riot won&#x27;t, because of publicity issues, and they can distance themselves from any of the garbage fires they light while still having someone answer it.\n> \n> And if a volunteer fucks up, they aren&#x27;t a volunteer anymore, and it&#x27;s not like they have all the info anyway.\n> \n> They just don&#x27;t want to make public speakings when it&#x27;s not on their side, even before the volunteers, this wasn&#x27;t something that they would comment on often at all, they would only ever comment on the ones that were justified.\n\nlooks like it isnt just oce too - lots of people getting banned on NA without much warning.","replies":[]},{"poster":"Essembie","date":"2017-11-21T20:53:57.480+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JasonWazza,realm=OCE,application-id=T8eq2lFQ,discussion-id=lz0HkvII,comment-id=0002000000000000,timestamp=2017-11-21T00:30:16.380+0000)\n>\n> I mean, that&#x27;s what the volunteers are for, people that can comment on things that riot won&#x27;t, because of publicity issues, and they can distance themselves from any of the garbage fires they light while still having someone answer it.\n> \n> And if a volunteer fucks up, they aren&#x27;t a volunteer anymore, and it&#x27;s not like they have all the info anyway.\n> \n> They just don&#x27;t want to make public speakings when it&#x27;s not on their side, even before the volunteers, this wasn&#x27;t something that they would comment on often at all, they would only ever comment on the ones that were justified.\n\nYeah. Just a shame there hasn't been better communication of the ban spree and what the drivers are.","replies":[]}]}]}]}]},{"poster":"Krethyan","date":"2017-11-19T12:33:18.793+0000","up_votes":2,"down_votes":1,"body":"Honestly player behaviour and taken a god damn cliff dive, no one's interested in the game any more with the unbalanced rune system and the garbage xp rewards, I've had 7 afk's in 9 different games all in one day.","replies":[{"poster":"Essembie","date":"2017-11-19T18:56:56.245+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Krethyan,realm=OCE,application-id=T8eq2lFQ,discussion-id=lz0HkvII,comment-id=0001,timestamp=2017-11-19T12:33:18.793+0000)\n>\n> Honestly player behaviour and taken a god damn cliff dive, no one&#x27;s interested in the game any more with the unbalanced rune system and the garbage xp rewards, I&#x27;ve had 7 afk&#x27;s in 9 different games all in one day.\n\nThat is definiely the feeling I am getting on the boards.","replies":[]},{"poster":"JasonWazza","date":"2017-11-19T22:32:53.617+0000","up_votes":2,"down_votes":2,"body":"I'd be more interested in the game if it wasn't a fucking dumpster fire right now\n\nEven professional players are having the game get down to 15 FPS due to how crappily they optimised the Preseason.\n\nThis is how they are \"dealing\" with toxicity, tackling people using keywords, and not tackling the people that are actually toxic.\n\nAnd the balance team not having any idea of how balance works really doesn't help either.\n\nOh yeah, and you get away with being an ass, as long as your don't use chat, so feed and troll to your heart's content.\n\nEDIT: oh yeah i forgot the Client that is constantly shitting itself... be great if we could have a client that knows what to do.","replies":[]}]}]}