{"poster":"Essembie","date":"2017-12-29T21:41:40.177+0000","title":"Mute all button","subforum":"Miscellaneous","up_votes":3,"down_votes":0,"body":"So the number of suspensions and bans being handed out over the last few months has become a running joke among those who play LoL.\r\n\r\nThe fact that the system is so sensitive and that player behaviour reps often take the piss with their responses has not created a healthy system to combat toxicity. The system punishes verbal toxicity automatically irrespective of context, and actual trolls are only punished when people report so the frequency of punishing for chat appears to be much higher than for people who actually wreck games with actions (feeding, trolling etc) and not words. You can merely be responding to some sledging thrown your way and then BOOM you get suspended.\r\n\r\nTo balance this out, one feature which has been suggested by many is a mute all button - removes the temptation to respond to sledges because you never see them in the first place.\r\n\r\nPings and emotes are easier than ever to communicate with so chat is in some ways redundant.\r\n\r\nA mute all is not really in the spirit of friendly communication but given the willingness of riot to hand out bans like real estate agent calendar magnets and to that player behaviour - in all but the most talked about cases - ignore context when key words have been triggered (is it banter or abuse? Is it racism or clarification? Is it mates taking the piss or people being nasty?),  I think it would be a good feature for those who like the game but who&#039;s vernacular is too salty for riot&#039;s system. \r\n\r\nDo you think this this idea has legs?","replies":[{"poster":"QAPLA","date":"2018-01-04T04:08:17.129+0000","up_votes":3,"down_votes":0,"body":"I use individual player mutes almost every game.\n\nSomeone says something that might get me into some flame war? I just mute them.\nHowever, playful banter I will jump on and we can go back and forth all game. I enjoy it. Shittalk is fun.","replies":[{"poster":"Essembie","date":"2018-01-04T23:43:15.015+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=QAPLA,realm=OCE,application-id=Ntey9fRZ,discussion-id=kGfJWY8L,comment-id=0003,timestamp=2018-01-04T04:08:17.129+0000)\n>\n> I use individual player mutes almost every game.\n> \n> Someone says something that might get me into some flame war? I just mute them.\n> However, playful banter I will jump on and we can go back and forth all game. I enjoy it. Shittalk is fun.\n\nI'm the same - bit of banter never hurt anyone. Sticks and stones and all that.\n\nBut apparently swearing is more damaging to the game than bots and trolls so......","replies":[]}]},{"poster":"JasonWazza","date":"2017-12-30T00:22:15.252+0000","up_votes":2,"down_votes":2,"body":"And for those who are generally bad with dealing with any toxicity and are the reason for this shitty banning system currently.\n\nType /mute all at the start of your games, this is an Australian server, and you could all use some teaspoons of concrete.","replies":[{"poster":"Essembie","date":"2017-12-30T01:37:07.801+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=JasonWazza,realm=OCE,application-id=Ntey9fRZ,discussion-id=kGfJWY8L,comment-id=0001,timestamp=2017-12-30T00:22:15.252+0000)\n>\n> And for those who are generally bad with dealing with any toxicity and are the reason for this shitty banning system currently.\n> \n> Type /mute all at the start of your games, this is an Australian server, and you could all use some teaspoons of concrete.\n\nagree - I am actually fine with a bit of spicy banter.\n\nbut what I call spicy banter, riot calls a 14 day suspension.","replies":[{"poster":"ThatsBS","date":"2017-12-30T01:52:22.729+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Essembie,realm=OCE,application-id=Ntey9fRZ,discussion-id=kGfJWY8L,comment-id=00010001,timestamp=2017-12-30T01:37:07.801+0000)\n>\n> agree - I am actually fine with a bit of spicy banter.\n> \n> but what I call spicy banter, riot calls a 14 day suspension.\n\nOffence is taken not given. Thats y its soo bad... it could actually get worse.","replies":[{"poster":"Essembie","date":"2017-12-30T02:40:59.353+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ThatsBS,realm=OCE,application-id=Ntey9fRZ,discussion-id=kGfJWY8L,comment-id=000100010000,timestamp=2017-12-30T01:52:22.729+0000)\n>\n> Offence is taken not given. Thats y its soo bad... it could actually get worse.\n\nagree generally but when it is an automated system being triggered by the words instead of an actual person who may or may not get offended, are you gonna risk it?","replies":[{"poster":"Ninox","date":"2017-12-30T08:21:50.748+0000","up_votes":2,"down_votes":2,"body":"Even the recent no tolerance bans are still only triggered by reports. A game isn't reviewed at all if there are no reports.","replies":[{"poster":"JasonWazza","date":"2017-12-30T13:00:38.023+0000","up_votes":1,"down_votes":1,"body":">bans are still only triggered by reports\n\n\"the minority of the league community decides what's ok because reports.\"","replies":[{"poster":"Ninox","date":"2017-12-31T01:01:34.710+0000","up_votes":2,"down_votes":1,"body":"Who says it's the minority? We don't have any stats on that, and I highly doubt as many people wouldn't report this kind of thing as you think.","replies":[{"poster":"JasonWazza","date":"2018-01-02T03:02:16.783+0000","up_votes":1,"down_votes":0,"body":"People who report all the time have always been the minority, i cbf finding the exact place where that info is right now.","replies":[{"poster":"Ninox","date":"2018-01-02T10:03:26.150+0000","up_votes":1,"down_votes":0,"body":"I couldn't find any info on it myself, but if you find the effort it'd be interesting to see for sure. It's hard to find perspective when we lack so many useful stats.\n\nI would still argue that if someone is being reported every game it's worth doing something about even if it's technically a minority (1-2 people per game) since oftentimes I find people will only report negative behaviour directed at them rather than at other people, but I take your point.","replies":[]}]}]}]},{"poster":"Essembie","date":"2017-12-30T21:51:21.095+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Seras Dragon,realm=OCE,application-id=Ntey9fRZ,discussion-id=kGfJWY8L,comment-id=00010001000000000000,timestamp=2017-12-30T08:21:50.748+0000)\n>\n> Even the recent no tolerance bans are still only triggered by reports. A game isn&#x27;t reviewed at all if there are no reports.\n\nthen what is the point of any sort of automated chat policing system if not to make automatic suspensions easier?","replies":[{"poster":"Ninox","date":"2017-12-31T01:03:44.016+0000","up_votes":1,"down_votes":1,"body":"Because ideally there is still power in the hands of the players. Preventing the automated from taking action unless there are reports means that if no-one has a problem with the behaviour then it is not reviewed.","replies":[{"poster":"JasonWazza","date":"2018-01-02T03:01:30.785+0000","up_votes":1,"down_votes":0,"body":"Which contradicts having words on an auto ban list.\n\nBut hey logic is Rito's main forte right?","replies":[{"poster":"Ninox","date":"2018-01-02T10:00:30.679+0000","up_votes":1,"down_votes":0,"body":"The idea is if you're in a full premade you're still 'safe' to use in game chat. I suspect the no tolerance decision was probably made by central (i.e NA) so the cultural difference probably play a part there where they don't with the learning part of the automated system since that's completely separate for OCE. It has it's goods and it's bads. \n\nPersonally I think *generally speaking* it's a good decision that I agree with, especially given the rating of the game, but I also agree that there at the very least needs to be more communication of the appeals process if they're going to take such a black and white stance.\n\nThere have been cases I think that deserve the instant 14, but I think there are also some cases that deserve a chance at appeal for a lesser punishment, and they really shouldn't have to come to boards to find out that it's even an option.","replies":[{"poster":"JasonWazza","date":"2018-01-02T10:11:04.099+0000","up_votes":1,"down_votes":0,"body":"In my personal opinion, unless you are completely going hate speech every game, there is nothing that really deserves an instant escalation, and if your doing that, the report system should have caught you well before now.\n\nThe issue with 14 day bans being instant, is that i doubt all these people are changing their behaviour vastly for these bans, meaning, they haven't actually been banned for what they are doing till they get an escalation, and don't really respect the system for an instant escalation (because it's generally taken YEARS to do anything.)","replies":[{"poster":"Ninox","date":"2018-01-02T10:33:37.582+0000","up_votes":1,"down_votes":0,"body":"I mean, agree to disagree, I think we've both made our points on that first one. As for catching before now, I agree, but we also shouldn't criticise things for getting better right (with regards specifically to the people that haven't been caught but should have)? We can criticise the direction, and criticise it for not happening sooner, but I think things probably *are* better even if it's a hassle for players who have to appeal that might not have otherwise.\n\nI agree that it's perhaps not he best route for some players to change their behaviour, I guess they wanted to impress how severely they are treating it, but the shock even to players who probably should have had punishments in the past is an issue. While I disagree on the nature of your opinion, I wholly agree that the communication has been a train wreck for a long time.","replies":[]}]}]}]}]}]}]}]},{"poster":"JasonWazza","date":"2017-12-30T07:32:08.240+0000","up_votes":1,"down_votes":1,"body":">Offence is taken not given.\n\nThis is the internet, no one cares about your offence, suck it the hell up.\n\nSeriously, fact is a minority having a whinge shouldn't be listened to, but too often, that is what gets listened to.","replies":[]}]}]},{"poster":"QAPLA","date":"2017-12-30T00:30:56.833+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=JasonWazza,realm=OCE,application-id=Ntey9fRZ,discussion-id=kGfJWY8L,comment-id=0001,timestamp=2017-12-30T00:22:15.252+0000)\n>this is an Australian server, and you could all use some teaspoons of concrete.\n\ni.e. harden the fuck up?\n\n[edit] Btw, it's Oceania, not just Aus. I myself am from NZ.","replies":[{"poster":"JasonWazza","date":"2017-12-30T07:20:45.714+0000","up_votes":1,"down_votes":2,"body":"To be fair, i think even most new zealander's would tell you your being a pansy ass, for reporting the things that get reported on this server (at least from the ones that i know)","replies":[{"poster":"QAPLA","date":"2018-01-02T02:19:19.744+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JasonWazza,realm=OCE,application-id=Ntey9fRZ,discussion-id=kGfJWY8L,comment-id=000100000000,timestamp=2017-12-30T07:20:45.714+0000)\n>\n> To be fair, i think even most new zealander&#x27;s would tell you your being a pansy ass, for reporting the things that get reported on this server (at least from the ones that i know)\n\nWe get \"shit\" and \"fuck\" on primetime news, no one cares.","replies":[]}]}]}]},{"poster":"QAPLA","date":"2017-12-30T00:13:31.225+0000","up_votes":3,"down_votes":1,"body":"I can imagine a typo when trying to say \"ks\" (kill steal), turns into \"kys\"... instant ban.\nSad days for lol, the gameplay itself is also worse than it's ever been (I've played since season 2).","replies":[]},{"poster":"Tactictoe","date":"2017-12-30T02:57:38.930+0000","up_votes":1,"down_votes":0,"body":"I think you can type /mute all in chat and that works.","replies":[{"poster":"Nikkip","date":"2017-12-30T03:27:57.364+0000","up_votes":1,"down_votes":0,"body":"Yeah, it's not a button but it is an easy to remember console command, so I guess what the OP ask for is already there. If you're on a tilt and tired of chat toxicity throwing a \"/mute all\" in the box can help, but I've found a better compromise is to turn off all chat in the options — since you never really miss anything not hearing the enemies — and just be far more liberal with personal mutes for teammates. At the first sign that someone is going to be unreasonable and toxic then mute them and get them out of your chat, if it's going to be tempting you to respond in kind or distract you from playing, and then you can still read your other teammates.\nChat does still have some uses. People might be talking about gank chances, dragon or baron opportunities, split pushing intentions, anticipated teleports, teamfight strategy, and stuff like that which may affect your play choices.","replies":[]}]}]}