{"poster":"Łυηα òωó","date":"2018-02-12T21:56:55.443+0000","title":"Ist Matchmaking wirklich fair?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":7,"body":"Hi,\r\nich bin mir sicher, dass jeder einmal so ein Game hatte: Der Bronze-Toplaner verliert gegen den Gold-Toplaner, der Silber-Midlaner intet rein, weil er seinen Champ nicht bekommen hat, der Jungler wei&szlig; gar nicht, was er zu ganken hat und die Botlane besteht aus dir und deinem Premade. Ihr seid beide Silber und spielt mit Bronze, w&auml;hrend die Gegner Full-Gold sind. Da denkt man sich nun: Warum macht Riot es nicht einfach so, dass Silber 5-Spieler mit Silber 5-Spielern zusammengepackt werden und z.B. Silber 1-Spieler mit Silber 1-Spielern. Das k&ouml;nnte man im Low-Elo-Bereich so machen, aber Riot sagt Nein. Im High-Elo-Bereich gibt es ja weniger Spieler, da k&ouml;nnte man es anders machen. Aber warum genau macht Riot es so, wie es jetzt ist? Wo besteht der Sinn darin, Silber 1-Spieler mit Diamond 5-Spielern zu matchen (fast immer und das auch noch in der Mitte der Season und am Ende)?\r\nLG Silica{{sticker:sg-miss-fortune}}","replies":[{"poster":"Alustus","date":"2018-02-13T00:08:59.080+0000","up_votes":2,"down_votes":0,"body":"Kannst du mir bitte ein paar dieser Spiele verlinken?\nIn deiner History finde ich nämlich kein Einziges Spiel in welchem die Gegner mehr als 2 Goldspieler hatten und in diesen Spielen hattet ihr immer jemanden der das ganze ausgeglichen hat.\n\nDas Spiele nicht immer Fair sind sollte auch jedem klar sein, dass hat aber weniger mit dem Matchmaking zu tun sondern damit das ein und der selbe Spieler nicht jedes Spiel exact gleich spielt.\nWenn du 10 mal die selben Teams gegeneinander spielen lässt wirst du nicht jedes mal die selben ergebnisse bekommen.","replies":[]},{"poster":"Nohgolgh","date":"2018-02-12T22:01:47.087+0000","up_votes":1,"down_votes":0,"body":"Bronze-Spieler und Gold-Spieler können nicht im gleichen Spiel sein, zumindest nicht im Ranked. Ansonsten wird hauptsächlich anhand der MMR gematcht. \n\nEdit: Ich wurde daruf hingewiesen, dass das doch nicht stimmt. Die [FAQ](https://support.riotgames.com/hc/de/articles/204010760-FAQ-zu-Ranglistenspielen) sagt zwar etwas derartiges, allerdings nur für das gemeinsame queuen mit einem Partner. Sorry. ","replies":[{"poster":"Cedilu","date":"2018-02-12T22:03:54.496+0000","up_votes":2,"down_votes":0,"body":"Doch natürlich geht das, wenn ein Gold 5 SPieler eine mmr von silber 3 hat und ein Bronze 1 Spieler exakt die selbe können diese beiden gematched werden. Als ich Silber war letzte Season und mit Meinem Gold 2 DuoQ Partner gespielt habe,Hatte ich die ganze Zeit Platin 5er und 4er Drinne","replies":[{"poster":"Avorox","date":"2018-02-12T22:09:04.305+0000","up_votes":1,"down_votes":0,"body":"Wenn du aber in Silber nen Goldmmr hast beschwerst du dich auch nicht über die Goldgegener, da du ja genauso gut spielst. Außerdem gehts hier ja um ein komplettes Bronze/Silberteam gegen Goldspieler, das kann zumindest in der SoloQ so eigentlich nicht passieren.","replies":[{"poster":"Łυηα òωó","date":"2018-02-12T22:59:20.087+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist ja, dass ich keine Gold-MMR habe, da ich wie ein normaler Silber-Spieler halt spiele und auch noch nie Gold war. Allerdings stört es mich schon, wenn ich dann als Support (Silber 3) mit einem ADC (Silber 5) gegen eine Gegner-Botlane antreten muss, die beide Gold 3 sind. Das ergibt einfach überhaupt keinen Sinn und natürlich ist da verlieren vorprogrammiert.","replies":[]},{"poster":"Cedilu","date":"2018-02-12T22:13:50.961+0000","up_votes":1,"down_votes":0,"body":"Nunja heisst ja nicht direkt das du die Gold MMr hast, die Goldspieler können ja auch deine Mmr haben. Und dann kann es gute Bronzespieler geben die deine Mmr haben und die werden dann mit dir gematched. Und das was du beschreibst kann in der Soloq eigentlich wirklich nicht vorkommen. Deswegen finde ich den Beitrag auch sehr fragwürdig","replies":[{"poster":"Avorox","date":"2018-02-12T22:21:05.716+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cedilu,realm=EUW,application-id=Wj1wcocU,discussion-id=8mNo6JcB,comment-id=0001000000000000,timestamp=2018-02-12T22:13:50.961+0000)\n>\n> Nunja heisst ja nicht direkt das du die Gold MMr hast, die Goldspieler können ja auch deine Mmr haben. Und dann kann es gute Bronzespieler geben die deine Mmr haben und die werden dann mit dir gematched. Und das was du beschreibst kann in der Soloq eigentlich wirklich nicht vorkommen. Deswegen finde ich den Beitrag auch sehr fragwürdig\n\nRichtig, wenn sie ein ähnliches MMR haben wie man selbst auch. Den Skill gibt aber sowieso das MMR an. Nen Gold 5 Spieler mit Silber 3 MMR ist halt eigentlich auch ein Silber 3 Spieler, er hat lediglich nen schickeres Symbol aufm Profil.","replies":[]}]}]},{"poster":"Nohgolgh","date":"2018-02-12T22:51:33.163+0000","up_votes":1,"down_votes":0,"body":"Sorry, war falsch, hast recht. Habs editiert.","replies":[]}]},{"poster":"Oriius","date":"2018-02-12T22:07:32.096+0000","up_votes":1,"down_votes":0,"body":"Du kannst auch als Bronze gegen Challenger im ranked antreten (theoretisch)wenn die MMR beider Seiten stimmt. Wer sich die entsprechenden Informationsthreads durchliest sollte das auch wissen das einzig und allein die MMR aufs Matching einfluss nimmt und nicht die Liga.\n\nDa aber Master/Challenger nicht in Divisionen unterteilt ist würde das hier vermutlich nicht gehen. ","replies":[{"poster":"Nohgolgh","date":"2018-02-12T22:49:33.114+0000","up_votes":1,"down_votes":0,"body":"Ah, ich sehe wo die Verwirrung herkommt (meine).\n\nhttps://support.riotgames.com/hc/de/articles/204010760-FAQ-zu-Ranglistenspielen\n\nIch habe glesen, dass Bronze-Spieler nur mit Bronze oder Silberspielern spielen können, was sich aber nur auf das gemeinsame queuen bezieht. \n\nNein okay, ich lag falsch. Sorry.","replies":[]}]}]},{"poster":"Time2Whine","date":"2018-02-13T08:28:15.821+0000","up_votes":3,"down_votes":1,"body":"https://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3529199952/225751364?tab=stats\n\nDas Matchmaking ist schon ziemlich gemein für deine Mitspieler dass sie dich als, von der Elo höchsten Spieler in dem Spiel mit Silber 3, in ihr Team bekommen haben. Gerade einmal 3,6 k Damage hast du gemacht und dann noch schön das Spiel sabotiert in dem du fast 10 Minuten vor Spielende deine besten Items verkauft hast und afk gegangen bist. \nBtw der Spieler mit der niedrigsten Elo, der Bronze 3 Kog Maw, hat das Spiel hart gecarried.","replies":[]},{"poster":"Oriius","date":"2018-02-12T22:06:31.748+0000","up_votes":3,"down_votes":1,"body":"erst einmal handelt es sich um ranked oder normal? denn im normal kannste auch problemlos als bronze 5 gegen Challenger gequeued werden. \n\nGrundsätzlich werden deine Gegner und deine Mitspieler nach der MMR ausgewählt. Durch Siege bzw Niederlagen gewinnst bzw verlierst du MMR. \n\nSprich hier ist es fast unmöglich gegen Leute gemacht zu werden die eine wesentlich höhere Elo haben aber gewisse tricksereien würden einem das noch erlauben.\n\nZudem kann es auch sein das du erst in den Placements bist und da kannst du auch gegen Spieler gematcht werden die ebenfalls trotz Hoher Elo ihre placements gerade machen. Da spielt die MMR scheinbar keine Rolle denn das System denkt sich vermutlich \" schauen wir wie er sich gegen die Gegner macht\" wenn es schwache Gegner waren wirst du beim nächsten Placement bessere Gegner erhalten. Sprich dadurch könnte es ebenfalls erklärbar sein.\n\nEs kann auch einfach sein das ihr eine ungewöhnlich hohe MMR habt so das ihr eben gegen Diamonds spielen müsst.\n\nAngenommen dein Team ist bronze + ihr 2 Silber und spielt gegen full gold dann haben die Goldspieler vermutlich eine schlechte MMR. Am Ende wird eine möglichst gleiche Team-MMR aufgestellt und so wäre das erklärbar. \n\nIch persönlich hatte nie den Fall das ich mit Bronze zb gegen Dia antreten musste sondern nur ich + 3 Platinsund 1 Dia meistens gegen ein gemisch aus platin und dia.","replies":[{"poster":"Łυηα òωó","date":"2018-02-12T22:56:07.487+0000","up_votes":1,"down_votes":0,"body":"Okay, erstmal echt vielen Dank für deine Antwort. Sie hat mir weitergeholfen und ich denke, dass unsere Gold-Gegner einfach eine sehr niedrige MMR haben xd","replies":[]}]},{"poster":"lolibus","date":"2018-02-12T23:36:44.676+0000","up_votes":1,"down_votes":4,"body":"Es könnte besser sein aber sie kriegen es einfach nicht hin. 4 premades im Gegnerteam in soloq is aber schon richtig fail. Sirrkas erzählt uns hier vom Pferd, von wegen fair.","replies":[{"poster":"Sirrkas","date":"2018-02-13T00:02:13.500+0000","up_votes":1,"down_votes":0,"body":">4 premades im Gegnerteam in soloq is aber schon richtig fail.\n\nNur, dass so etwas unmöglich ist. Außer vielleicht, man kriegt es hin die Queue zu snipen. Aber das wäre in EUW im mittleren Ligenbereich wohl etwa so wahrscheinlich, das bei den Gegnern zu haben, wie ein 6er im Lotto.","replies":[{"poster":"OrangeBubble","date":"2018-02-13T11:19:57.777+0000","up_votes":1,"down_votes":0,"body":"Ich habs 2mal geschafft, aber war halt 2 Uhr morgens xD","replies":[{"poster":"Sirrkas","date":"2018-02-13T16:10:05.425+0000","up_votes":1,"down_votes":0,"body":"Wenn man es darauf anlegt zu snipen, ist das wohl die beste Zeit dafür.","replies":[]}]},{"poster":"BlackAjani","date":"2018-02-13T10:45:31.873+0000","up_votes":1,"down_votes":0,"body":">Sirrkas erzählt uns hier vom Pferd, von wegen fair.\n\nxD der böse böse Sirrkas :D","replies":[]}]}]},{"poster":"Sirrkas","date":"2018-02-12T23:20:25.612+0000","up_votes":1,"down_votes":0,"body":"Das Matchmaking ist durchaus fair, es funktioniert im Normal, aber nicht so vor, wie du es beschreibst, bzw. vorgeschlagen hast.\n\nDu beschwerst dich gerade darüber, dass du im Normal ein paar Goldgegner gekriegt hast. Die hatten den Goldrang letzte Season aber im Ranked, nicht im Normal. Das Normal hat ein eigenes Matchmaking mit eigener MMR (Matchmakingrating). Deswegen arbeitet es unabhängig vom Ranked. \nIch schätze du meinst dein Spiel als Thresh bei dem TF, der Heal hatte? Da waren 3 der Gegner Gold. Auch wenn das auf den ersten Blick unfair wirkt, muss das nicht auch aus Sicht des Systems sein. \n\nGründe dafür, dass du im Normal auf Gold triffst, können etwa folgende sein:\n\n1) Die MMR zwischen Ranked und Normals unterscheidet sich deutlich.\n\nWenn du immer auf Goldspieler im Normal triffst, kann es zum Beispiel sein, dass du im Normal auf einem Niveau spielst, auf dem auch diese Goldspieler im Normal sind. Etwa, weil du dich da anstrengst und weiter oben platziert wirst oder weil die Goldspieler im Ranked mehr geben als im Normal und deswegen hier schwächer angesehen werden. Egal ob sie im Normal nicht so verbissen spielen, eher Zeug ausprobieren, neue Champs testen oder einfach riskantere Spielzüge machen als im Ranked. \n\n2) Premades\n\nIm Normal, darf jeder mit jedem Spielen. Das alleine würde schon den Vorschlag verbieten, hier strikt nach Rangliste zu trennen. Wie soll ein Bronze 2 Spieler, denn dann bitte mit seinem Platin 3 Freund spielen? Etwa, indem das System darauf wartet, dass eine anderer Plat 3 + Bronze 2 Premadegruppe antritt? Wenn es so sein würde, wie soll das System dann sicherstellen, dass der Bronzespieler gegen den Bronzespieler auf der Lane antritt? Was wenn der eine Bronze dann Support/Mid angibt, der andere Jungle/Top?\n\n___\n\nAuch im Ranked ist es nicht unbedingt seltsam, als Silberspieler auf Gold zu treffen. Schließlich ist das die nächsthöhere Liga. Vor allem, wenn jemand Gold 5 ist, kann er eine MMR von irgendwo im Silber haben. Der Abstiegsschutz verhindert, dass er absteigt, ehe er auf dem Niveau von unterem Silber angekommen ist. Dazu kommt noch, dass man im oberen Silber auch eine MMR haben kann, die eher im Goldbereich ist. Das erkennt man meist daran, dass man mehr LP gewinnt, als man verliert.  \n\nUm von Silber nach Gold zu kommen, muss man ja im Grunde beweisen, so gut wie Gold zu sein, deswegen wird man spätestens im Bereich der Promo zu Gold, auch mal auf Goldspieler treffen. ","replies":[]},{"poster":"Cedilu","date":"2018-02-12T22:02:11.123+0000","up_votes":1,"down_votes":0,"body":"Hey, anscheinend bist du nicht gut genug über das matchmaking informiert. Der Grund warum du zum Beispiel Gold oder Bronze Spieler in deinen Games hast ist, das die eine ungefähr so hohe mmr haben wie du und so wird Das match dann zusammengetragen. Das Matchmaking macht Sinn und so lange du konstant performst wirst du auch climben. Ich wünsche dir trotzddem Viel Glück, Spass und gute Teamm8s in deinen Games \n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Łυηα òωó","date":"2018-02-12T23:04:16.781+0000","up_votes":1,"down_votes":0,"body":"Danke für deine Antwort! Du hast mir wirklich mal etwas Licht in die Dunkelheit gebracht. Naja, dir auch noch viel Glück, Spaß und klar, die guten Teammates dürfen auch nicht fehlen!","replies":[]}]},{"poster":"Avorox","date":"2018-02-12T22:07:38.401+0000","up_votes":1,"down_votes":0,"body":"Dann spiel halt Ranked denn da passiert dir das sicher nicht.","replies":[{"poster":"Łυηα òωó","date":"2018-02-12T23:02:04.087+0000","up_votes":1,"down_votes":0,"body":"Passiert mir im Ranked halt auch. Deswegen verlier ich ja dauerhaft und frage mich jetzt hier, wie das Matchmaking so funktioniert.","replies":[]}]},{"poster":"Herr Hübsch","date":"2018-02-12T22:39:46.101+0000","up_votes":1,"down_votes":0,"body":"warum muss denn alles fair sein?? mit fairness hat man keine challenge und das spiel um den sieg wäre total sinnlos","replies":[{"poster":"Łυηα òωó","date":"2018-02-12T23:01:12.486+0000","up_votes":1,"down_votes":1,"body":"Ich verlier ja aber alle Games, weil ich und mein Team nicht gegen Gold-Spieler ankommen xd Und sowas nimmt mir wirklich den Spaß, vorallem in Rankeds.","replies":[]}]},{"poster":"antitomatexd","date":"2018-02-12T22:00:22.363+0000","up_votes":1,"down_votes":0,"body":"Viele Spiele sind deine eigenen Schuld aber manche sind einfach \"unlucky\"!","replies":[]}]}