{"poster":"Sneaky Gandalf","date":"2017-12-04T00:08:27.242+0000","title":"PROJECT:HUNTERS mission glitch","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I was playing a match with the intent of completing two missions, Kill 2 barons, and place a control ward in 3 games. On this game my team and I killed 3 barons even though my internet went out i killed one baron and placed a control ward in the match. I checked my missions, it completed my daily win but didn't give me the rewards for completing the mission. Plz help me trying to get the project skin capsule.","replies":[{"poster":"Broporo","date":"2017-12-04T03:24:57.647+0000","up_votes":1,"down_votes":0,"body":"I'm checking now and it still doesn't seem like those missions are registering at all, did you happen to remember which matches should have counted towards it? Specifically, the one where you killed 3 barons so I can double check that for you?","replies":[{"poster":"Sneaky Gandalf","date":"2017-12-04T03:26:49.746+0000","up_votes":1,"down_votes":0,"body":"I played Varus adc with guinsoons game my second game in my match history","replies":[{"poster":"Broporo","date":"2017-12-04T03:41:30.723+0000","up_votes":1,"down_votes":0,"body":"Thanks for the heads up! I checked into that match and as it turns out, you did seem to have had at least 2 barons killed there. I've gone ahead and pushed that mission through for ya, be sure to refresh your client in case you don't see it take effect ^_^!","replies":[{"poster":"Sneaky Gandalf","date":"2017-12-04T03:43:01.340+0000","up_votes":1,"down_votes":0,"body":"Thanks Man!","replies":[{"poster":"Sneaky Gandalf","date":"2017-12-04T03:59:04.243+0000","up_votes":1,"down_votes":0,"body":"Just kidding, missions are still not updating, my dmg one and kills as a team and my control ward mission","replies":[{"poster":"Broporo","date":"2017-12-04T04:04:08.807+0000","up_votes":1,"down_votes":0,"body":"The only one I hit was the Baron one, since I was able to clearly see those Baron kills on the match history. The control ward one I can see 2 games right now where you bought (and assuming you placed them) 2 control wards, but it's hard to know 100% that you had the mission already when placing the others. Looks like you only need one more control ward so it should be easy enough to clear that one, as well as the damage one up. I was able to do the Baron one with solid proof, it's just a little harder to verify these two but should be easy enough to get done with normal play.","replies":[{"poster":"Sneaky Gandalf","date":"2017-12-04T04:46:49.395+0000","up_votes":1,"down_votes":0,"body":"I mean that my missions are not updating, I will obviously do some amount of dmg to champions during the game, but it's not updating at all","replies":[{"poster":"Broporo","date":"2017-12-04T04:55:41.639+0000","up_votes":1,"down_votes":0,"body":"Ah, my bad. I meant to add in there to hit me back after *you* know you've finished the mission, then I can definitely check back up and confirm. It's just right at this moment it's a little hard to line up all the dates and such. If you pop back up letting us know you should have completed it again after now, we'll have a much easier time lining things up now that I have a sort of \"bookmark\" time/date to check back to.\n\nEssentially, I can't really tell 100% right now. If you play some matches that should complete the mission and it bugs out again, let me know the missions and I can confirm that the rest of what you need had been finished! We gotchu fam, I just can't go completing missions left and right like Oprah up in here is all ^_^","replies":[{"poster":"Sneaky Gandalf","date":"2017-12-05T00:23:53.453+0000","up_votes":1,"down_votes":0,"body":"I have completed the artist 4 of 4","replies":[{"poster":"Broporo","date":"2017-12-05T21:45:14.120+0000","up_votes":1,"down_votes":0,"body":"This really sucks to say, but it looks like these 3 missions probably didn't get updated because you changed your icon to a non-project icon a few days ago. They have to be completed while you have one of the project icons equipped for them to track your progress.","replies":[{"poster":"Broporo","date":"2017-12-05T21:46:29.819+0000","up_votes":1,"down_votes":0,"body":"UPDATE: If you know matches that should have counted *where you still had a Project Icon equipped* let me know what those matches were so I can check them out and get this completed if it should have!","replies":[]}]},{"poster":"Sneaky Gandalf","date":"2017-12-05T01:16:59.007+0000","up_votes":1,"down_votes":0,"body":"And also The Vigilinte 4 of 4","replies":[{"poster":"Sneaky Gandalf","date":"2017-12-05T01:41:33.789+0000","up_votes":1,"down_votes":0,"body":"And the Cop 3 of 4","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"Sneaky Gandalf","date":"2017-12-05T02:49:57.307+0000","up_votes":1,"down_votes":0,"body":"If you could respond, that would be great i would love to get PROJECT: skin token","replies":[]}]}