{"poster":"M1k4KilltGerne","date":"2018-06-13T12:05:51.048+0000","title":"Ich flame und tilte nur noch...","subforum":"Spielerverhalten & Moderation","up_votes":9,"down_votes":3,"body":"Hallo Leute,\r\nIch brauche echt ein bisschen Hilfe. Ich wei&szlig; es nicht woran es liegt aber in letzter Zeit raste ich sehr schnell im Chat aus und flame meine Teammates sehr oft. Manchmal spamme ich sogar sehr krasse Beleidungen in den Chat, wof&uuml;r ich auch schon zwei Chatbans und einen 14-Tage-Ban kassiert habe (wof&uuml;r ich mich auch echt sehr entschuldige).\r\n\r\nEs l&auml;uft so ab:\r\n\r\n-Ich spiele z.B Mid und verliere einen Kampf obwohl mein Jungler nur 3 Meter von mir entfernt ist und mir nicht hilft: Ich flame ihn im Chat und pinge ihn ganz oft.\r\n\r\n-Mein Jungler gankt mich sehr selten und ich steh schon 0/3 am Anfang: Ich flame ihn und pinge. (Manchmal quitte ich sogar)\r\n\r\n-Ein Mate von mir stealt mir gezielt alle Kills und lacht mich mit Strg+3 oder Strg+4 aus:\r\nIch flame ihn und raste total aus. (Vor all dem wenn ich selber schlechte Stats habe und die Lane verliere)\r\n\r\n-Meine Teammates flamen MICH weil ich die Lane verliere und helfen mir nicht mal: ich tilte total im Chat und wechsle die Lane einfach so.\r\n\r\n\r\nDas alles sind Dinge, die mir mindestens in jedem 2.-3. Spiel passieren. Ich wei&szlig; nicht was los ist. \r\nIch bin in echt eigentlich voll der nette und freundliche Typ aber in LoL ist es manchmal anders.\r\n\r\nBis jetzt nehme ich mir vor, jedes Spiel alle meine Mates und Gegner im Chat direkt zu muten, damit sowas nicht passiert.\r\n\r\nAber ich glaube das wird noch nicht reichen.\r\nIch brauche echt ein paar Tipps, damit ich NICHT mehr tilte und meine Mates flame...\r\n(Ich sage nochmal es tut mir echt leid...)\r\n\r\nIch hoffe jemand kann mir helfen.\r\n\r\nLG Mika","replies":[{"poster":"WhisperedFire","date":"2018-06-13T13:23:50.619+0000","up_votes":5,"down_votes":0,"body":"Kurz eine Sache vorweg - Ich finde es sehr schade, dass so ein Thread direkt wieder downvotes bekommt.\nKlar, du hast dich als Flamer selbst identifiziert und Flamer sieht man nicht gerne, der Kern deines Threads, dich zu bessern, ist aber durch aus ein sehr positiver!\n\nNun aber direkt zu deiner Sache:\nDeine grundsätzliche Einstellung, dass du dich bessern willst, ist gut, solltest du beibehalten. Leider merkt man aber noch, dass ein Denkfehler vorhanden ist, den viele Flamer haben - Es passiert immer wieder nur dir und nur die anderen sind Schuld.\nDiese Einstellung ist aber falsch. Man hat immer wieder Leute, die einem bewusst den Spielspaß nehmen wollen aber das bleibt eine Minderheit. Oftmals kommen auch Spieler in dein Team, die schlecht spielen. Ist blöd, lässt sich aber nicht vermeiden. Passiert jedem, auch dir selbst.\nWas du aber aktiv machen kannst, um selber mehr Spaß zu haben - versuchen nett zu helfen, konstruktiv zu sein und das Spiel zu gewinnen.\nDu wirst merken, dass das auf Dauer super klappt.\nWenn du es dir gar nicht verkneifen könntest, etwas in den Chat zu schreiben, dann leg die Taste um. Leg sie auf eine Taste, die du nie verwendest, bestenfalls wieder vergisst. Du wirst dann nicht auf die schnelle flamen können und alles andere, also solltest du doch flamen, ist das selbst schuld - Du wirst drüber nachgedacht haben.\n\nDiese Hilfe von mir ist nicht die beste und nicht die best-formulierteste aber das hat einen Grund. Ich habe den Verdacht, dass du hier nicht primär schreibst um diese Hilfe zu bekommen. Ich fürchte, dass du Bestätigung suchst, irgendetwas, was dir sagt, dass man dich verstehen kann, dass du mit dem Flamen nicht übertreibst. Wieso ich das denke? Nun ja... Du beschreibst in deinen Szenarien nur welche, bei denen du absolut keine Schuld trägst, immer das Opfer bist und deswegen schon fast toxisch reagieren musst. Des Weiteren ist es in meinen Augen schwachsinn eine Lösung zu schreiben (/muteall), dann aber direkt auszusagen, dass das bestimmt nichts bringen wird. Wäre es dir so wichtig, dann hättest du es schon lange ausprobiert.\nDiese Bestätigung wirst du von mir aber nicht bekommen, sie würde dir auch nicht helfen. Wenn man 3 mal bestraft wurde und schon bei dem 14-Tage Ban dabei ist, zwischenzeitlich also keine Reformation stattgefunden hat, dann hat man ziemlich viel falsch gemacht und kann dies nicht mehr auf andere schieben.\nVerstehe das nicht offensiv oder falsch. Ich fasse den Thread immer noch positiv auf, du willst scheinbar ja doch eine Besserung, aber anstatt direkt auf deine Frage einzugehen gebe ich dir folgenden Tipp vom ganzen Herzen:\nAchte auf deine Einstellung gegenüber anderen Spielern, reflektiere dein Verhalten und dessen Auswirkungen auf dich und die anderen Spieler und versuche den Sinn hinter dem Weg der Beschwörer zu verstehen.\nDu verfolgst das richtige Ziel, ich fürchte aber, du hast bisher den falschen Weg dafür gesucht. Bleib am Ball und dann wird das!\n\nWhisperedFire {{summoner:14}}","replies":[]},{"poster":"Drachenlord1510","date":"2018-06-13T12:57:10.345+0000","up_votes":3,"down_votes":0,"body":">Ich spiele z.B Mid und verliere einen Kampf obwohl mein Jungler nur 3 Meter von mir entfernt ist und mir nicht hilft: Ich flame ihn im Chat und pinge ihn ganz oft\n\nMein Tipp: Flame ihn nicht und pinge ihn nicht ganz oft.\nWas willst du denn sonst für einen Tipp haben?\nWenn du keinen Spaß am Spiel hast, dann solltest du nicht spielen.\n\nNimm das Spiel einfach nicht so ernst, mach den All-Chat aus (und lass ihn aus!). Der bringt eh nichts außer \"pls report our support for trolling mimi\".\nWenn dich irgendwer in deinem Team nervt, mute ihn direkt. Nein, du bist nicht cooler, wenn du immer das letzte Wort hast und ihn immer einmal mehr beleidigst als er dich.","replies":[]},{"poster":"Izaya Kumiho","date":"2018-06-13T13:11:01.084+0000","up_votes":4,"down_votes":1,"body":"So weird es auch klingt: Nimm dir ein paar Zettel und klebe sie an deinen Monitor, der Tür/Wand vom Badezimmer, Kühlschrank, _Taschentücherbox_ und Nachttisch.\nSchreibe nun diese Worte auf deine Zettel: \"**Ich bin der bessere Spieler, weil ich flaming nicht nötig habe!**\".\n\n\nDu solltest dir auch selbst einige Fragen stellen, wie z.B:_ \"Bringt der Flame etwas positives?\", \"Wie fühlt sich die Person, die ich zuflame?\", \"Könnte das hier ein Fehler von meiner Seite gewesen sein?\" und \"Wie würde ICH mich in seiner/ihrer Situation fühlen?\"._\n\n\nViele Worte werden oft falsch/negativ aufgefasst, weil die meisten Spieler nicht von Freundlichkeit im Internet ausgehen.\nDaher musst du immer auf deine Wortwahl achten. Nimm Dinge, die nicht schnell in ein schlechtes Licht fallen können.\n\nBeispiel:\n>-Mein Jungler gankt mich sehr selten und ich steh schon 0/3 am Anfang: Ich flame ihn und pinge. (Manchmal quitte ich sogar)\n\n\"I really need your help, XY. Would you kindly give me a gank (or even two)?\"\n\"i'm sorry but i kinda lost my lane against XY. Could you help me please?D:\"\n\n>-Ein Mate von mir stealt mir gezielt alle Kills und lacht mich mit Strg+3 oder Strg+4 aus:\nIch flame ihn und raste total aus. (Vor all dem wenn ich selber schlechte Stats habe und die Lane verliere)\n\n\"Hey! I'm already behind. Taking my Kills isn't helping anyone. Could you stop that please?\"\n\n>-Meine Teammates flamen MICH weil ich die Lane verliere und helfen mir nicht mal: ich tilte total im Chat und wechsle die Lane einfach so.\n\n\"Well i asked for help a few times.\"\n\nDu solltest bei solchen Sachen eher zusehen, wie du an Minions kommst. Die Lane einfach so zu wechseln, bringt nichts. Es sei denn, die Laningphase ist over und Splitpushing ist möglich.\n\nMinions>Kills.\nDein Wert wird nur steigen, wenn du viele Kills hast. Wenn du einfach nur farmst und Tower bekommst, hast du am Ende genauso viel Gold und gibst den Gegnern nichts mehr ab, bis du sie zusammen mit deinem Team vernichtest.\n\n>Ich bin in echt eigentlich voll der nette und freundliche Typ aber in LoL ist es manchmal anders.\n\nVielleicht setzt du dich auch einfach selbst sehr stark unter Druck. \nSpiel doch mal mit einer Hand voll Freunden. Das könnte hilfreich sein, da Freunde sich meistens nicht zuflamen. Dann musst du auch nichts befürchten von wegen:\"der wird mich 100% hassen\".","replies":[{"poster":"M1k4KilltGerne","date":"2018-06-13T13:14:37.786+0000","up_votes":1,"down_votes":0,"body":"Woow, das hast du echt toll geschrieben! ich werde es mir sehr an's Herz nehmen","replies":[]}]},{"poster":"Megamaexx","date":"2018-06-13T13:06:08.510+0000","up_votes":2,"down_votes":0,"body":"Kurz gesagt: Lass es.\nEtwas länger: Plündereule hat es ja schon gesagt. Wenn das Spiel keinen Spaß macht, dann spiel nicht. Zu viele Runden am Tag können ebenfalls belasten, gönn dir eine Auszeit. Auch mal mehrere Tage am Stück. Wenn dich die letzte Runde richtig hart gefrustet hat, starte keine neue. Mach was anderes.\nWenn man Alternativen zum Spiel hat, baut allein das schon Frust ab oder lässt diesen gar nicht erst entstehen.","replies":[]},{"poster":"Hurbokuhmar","date":"2018-06-13T12:09:37.658+0000","up_votes":2,"down_votes":0,"body":"Reiß die Enter-Taste aus deiner Tastatur raus :D","replies":[]},{"poster":"Qbert","date":"2018-10-01T08:02:42.667+0000","up_votes":1,"down_votes":0,"body":"Ich persönlich finde, es bringt halt nix irgendwelche Tasten zu entfernen oder den Chat auszublenden oder ähnliches.\nDenn sind wir mal ehrlich, das Problem ist ja nicht das Spiel per se sondern du.\n\nDu solltest deine Einstellung ändern. Jeder ärgert sich, auch über die anderen Mitspieler. Es ist auch viel Einfacher die Fehler den anderen Unterzuschieben, ab und zu hat man damit ja sogar Recht.\nMeiner Meinung nach solltest du jedoch anders herangehen.\n\nNehmen wir dein beschriebenes Beispiel.\nDie Fragen die du dir stellen solltest sind folgende:\n- Warum habe ich den Kampf verloren?\n- Was lief schief? bzw. Was hätte ich besser machen sollen? bzw. Was hat der Gegner besser gemacht? oder Was habe ich nicht bedacht?\n- Wusste mein Jungler, was ich vor habe/hätte er die Situation wirklich ändern können?\n\nIch finde es immer gut, wenn man die Lage aus seiner aber auch aus der Sichtweise der anderen analysiert ... evtl. hätte der Jungler dir helfen können, hätte er gewusst was du vorhast. Klar, er hätte es vllt. auch sehen können, aber erahnen kann man so etwas immer schwer.\n\nEin letztes noch.\nWenn du ein Spiel hast, in dem du wirklich gut warst(du musst natürlich ehrlich zu dir selbst sein) du aber dennoch verlierst, überlege ob du noch ein Spiel machst.\nDenn oft ist man dann in solchen Spielen voreingenommen was die nächsten Teammates angeht.\nWenn du der Meinung bist du kannst neutral ins nächste Spiel gehen, dann mach ruhig weiter ... aber nur beim kleinsten Anzeichen, dass du voreingenommen reingehen wirst, mach eine Pause ... schau dir 10min ein YouTube-Video an oder lies etwas ... kurz den Kopf frei bekommen, dann kannst du weiter rocken. \n\nGrüße vom Forum Poro\n\nhttps://pbs.twimg.com/profile_images/907289673289969665/mUa1DrlT_400x400.jpg","replies":[]},{"poster":"Sakuritou","date":"2018-10-01T07:33:06.989+0000","up_votes":1,"down_votes":0,"body":"Soll nun nicht negativ rüberkommen aber wieso erwartet jeder der den Jungler flamet/spam pinged ganks? Beispiel: Du beleidigst deinen Chef auf der Arbeit konstant und arbeitest null.. erwartest du dann ernsthaft einen besseren Lohn?","replies":[]},{"poster":"Kartoffelking983","date":"2018-07-17T22:41:50.741+0000","up_votes":1,"down_votes":0,"body":"Angenommen du willst hilfe weil dich so ein Typ schlagen will \nFragst du nett oder \" HILF MIR DOCH MANN DER SCHLÄGT MICH HIIIILF MIIIIR \" \nBei letzterem eher unwahrscheinlich das er hilft","replies":[]},{"poster":"SuckThisFist","date":"2018-06-15T01:49:04.705+0000","up_votes":1,"down_votes":0,"body":"Hier 4 Tipps die mir helfen nicht zu Flamen vielleicht ist ja was für dich dabei :)\n\n1. Schrei den Monitor an wenn du das verlangen hast zu Flamen, so kannst du sie Flamen ohne eine Bestrafung zu riskieren.\n\n2. Mute alle sobald du merkst es läuft dieses Spiel nicht bei dir, wenn du 0/2 stehst z.B. so hast du keinen Zwang auf irgendwas zu reagieren,weil du es nicht liest.\n\n3. Mach ein bisschen Sport zwischen jeder Runde z.B. so viele Liegestütze wie du schaffst, das dauert nicht lange und du bist ausgeglichener.\n\n4. Kauf dir nen Hackysack oder wie diese Reißbälle heißen die kannst du zusammen drücken und gegen die Wand werfen und so ein bisschen Wut abbauen wenn nötig\n\n5.  Nimm das Spiel nicht so ernst, wir alle verlieren, wir alle haben Games wo wir nicht gut spielen und besser wird man mit der Zeit, manchmal klappt es mit dem Ranking halt nicht","replies":[]},{"poster":"BigBeardD","date":"2018-06-14T16:50:13.374+0000","up_votes":1,"down_votes":0,"body":"Habe auch erst einen 10 Tage Chatban bekommen. Ich weiß ganz genau wie du dich in deinen Games fühlst. Es ist einfach SCHEIße in diesem Game zu verlieren. Ich bin vor dem Ban auch sehr sehr oft im Chat ausgeflippt (z.B. wenn es nach 10 Minuten 0 10 steht, oder wenn einer AFK geht).\n\nWeißt du wie ich mich gerade nach einem 10 LOSE-STREAK fühle? Beschissen!\nEben ein Game => Support AFK und Remake nicht möglich\nNoch ein Game => Nach 10 Minuten hatte der Mitlander 0 6 0 => Game LOST!\n\nJetzt gehe ich in das nächste Game und mal sehen, ob es das 11. LOSS wird!!!\n\nPS: In den chat schreibe ich aber nix mehr, Eher RAGEQUITTE ich!!!","replies":[]},{"poster":"sN00Bdogg","date":"2018-06-13T14:30:47.093+0000","up_votes":1,"down_votes":2,"body":"EInfach den Chat schliessen ... als Bronzist solltest DU Dich eh mal besser aufs Spiel konzentrieren.","replies":[]},{"poster":"Mad Loony","date":"2018-06-13T13:38:27.593+0000","up_votes":1,"down_votes":12,"body":"~~Anscheinend spielst du total schlecht. Frag den Supp ob sie dich ein paar Divisionen nach unten versetzen können.~~\n\nEdit: Sry, wollte keinen neuen Skandal anzetteln.","replies":[]}]}