{"poster":"NZL Fawn","date":"2016-12-06T02:38:06.824+0000","title":"Auto Fill is the Death of Ranked","subforum":"Player Behaviour","up_votes":3,"down_votes":5,"body":"Im Sick and tired of this Auto fill Crap, And its not even the fact that im being auto filled 24/7 its the fact how people act a pon it, as an adc Main Im getting Troll supports every game, Just bring back Pick order it pretty much is Pick order now anyways, Ive got accs ranging from Silver to Diamond and this shits Pathetic, Wastes 10 mins per Champ Select and can waste 40 mins of a game, Please Sort this out, Otherwise ill be resigning of 4 Years of League of Legends If this shit happens all through the next Season","replies":[{"poster":"Roguestoney","date":"2016-12-06T23:22:48.575+0000","up_votes":4,"down_votes":1,"body":"Nah.  People's little bitchy oppions on auto fill is the death of ranked. \"Oh no i don't know how to play support\" get over it and learn the role... Whiny little twats.","replies":[]},{"poster":"Cakemeisting","date":"2016-12-06T04:53:52.173+0000","up_votes":1,"down_votes":3,"body":"There are two solutions, the way I see it:\n\nONE: \n\nLike I said in a previous thread, Riot could just have a button when you are about to queue that says \"I am prepared to wait for as long as it takes to get one of my roles\". Autofill solved.\n\nOR  TWO:\n\nI doubt that Riot will revert to the old system, because that would be admitting that the whole champion select update has been a failure, and also it will bring back the toxicity for position. If however they made it **a rule** that position is a pick order with notifying your team of the role you picked, this might work. For example, you choose your champion and then you choose the role your want, so that no-one else below you can take that role/position. Would be rather simple programming to implement.","replies":[{"poster":"Zorphiax","date":"2016-12-06T23:06:15.103+0000","up_votes":3,"down_votes":0,"body":"OR THREE\n\nEveryone just learns to play every role without crying about auto fill.\n\nSure have a role you master at but learn to play every role.","replies":[{"poster":"Cakemeisting","date":"2016-12-07T12:56:15.053+0000","up_votes":1,"down_votes":0,"body":"I'd go along with this one, like it used to be back in Seasons 1-5. Kids just want their toys NOW, though it seems.","replies":[]}]}]},{"poster":"Klavinmour","date":"2016-12-06T07:38:21.267+0000","up_votes":2,"down_votes":0,"body":"Pick order was the ultimate cancer.","replies":[]},{"poster":"Mortis Ex","date":"2017-01-09T12:44:14.334+0000","up_votes":1,"down_votes":0,"body":"Well first off if you are diamond and smurfing in silver then I wish more trolling upon you. A full 2 division gap between your main and smurf is bad for the game health. \nThe new system is miles better than the old pick order and if you are smurfing you should be able to carry from any role and if you are smurfing and troll I think that all of your accounts should be penalized faster and more heavily than anyone else. If you are an adc main and filled to sup while smurfing you should take this as an opportunity to help teach a lower elo player more about a role you are better at and you should understand what you expect from a sup so know how to do it. If you smurf and expect someone to play at the same level you do then you are being stupid.","replies":[]},{"poster":"Toni Kroos","date":"2016-12-14T15:07:49.556+0000","up_votes":1,"down_votes":0,"body":"This is what just happened to me. i got a troll supp and  it was so horrible i didn't even want to play","replies":[]},{"poster":"TSM Swish","date":"2016-12-06T02:53:43.071+0000","up_votes":1,"down_votes":0,"body":"As a support I miss the old system actually...while it's not hard to keep supporting I do think the changes are bad for ranked.","replies":[]}]}