{"poster":"00 M4ddin 00","date":"2019-10-09T06:52:48.274+0000","title":"[TGSG] Kurz und knapp","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":2,"body":"Guten morgen :3 \r\n\r\nhttps://images.app.goo.gl/enYxpWqMHsVCMuW58\r\n\r\nWie der kleine sich abmüht ! Genau so geht's mir heute auch mit dem Mittwoch ^^ \r\nEtwas stressig heute deshalb auch von mir nicht ganz so viel und au mich erst jetzt :/ \r\n\r\nHab ich eigentlich bei den ganzen Bildern mal erwähnt das Wildschweine Tiere sind vor denen ich angst hab :0 Also von den ausgewachsenen. Kann nicht genau sagen warum. Aber immer wenn ich an Wald denke denke ich daran von Wildschweinen angegriffen zu werden ^^' \r\n\r\nSo gestern war ein interessanter aber ich hab fast 6 Stunden damit verbracht Sims 4 stream zu schauen ^^' \r\nWas bestimmt nichts damit zu tun hat das mein Sims einfach der übertrieben geil steht Sims aller Zeiten ist ! *hust hust* \r\n\r\nHoffe euch geht es gut und ihr habt noch einen angenehmen restlichen Tag :3","replies":[{"poster":"INoKami","date":"2019-10-09T13:20:41.848+0000","up_votes":1,"down_votes":0,"body":"**[Der TGSG-Blog] Geschichten eines Azubis, Tag 224**\n\nEin bisschen antreiben sollen uns ja die Assistenten, aber man kann es auch bekanntlich übertreiben. Siehe heute. Heute wurde ein Versuch begonnen und direkt auch wieder beendet, eben weil nur ein halber Tag dafür vorhergesehen ist, ein denkbar knapper Zeitrahmen. Vor allem, wenn jeder 7 Lösungen unterschiedlicher Konzentrationen/Gehalte/whatever ansetzen muss und dann eine ca. 20-minütige Messung durchlaufen darf, die immer nur eine Gruppe machen kann, weil nur ein Gerät vorhanden. Aber dadurch, dass wir heute die zweiten waren, die messen konnten, ging es recht zügig und abermals fanden wir uns in einer 1,5-stündingen Phase des Leerlaufs vor. Also noch flugs Protokoll soweit wie möglich ausgewertet und die Zeit genossen. Soll es ja auch geben :D\nGut, aber dann gab es noch einige Noten zurück, diese beinhalteten u.A. meine erste Nachschulung (ich darf irgendwann mal Freitags länger bleiben. Nice) und... ziemlich absurd ausgewertete Protokolle. Ich erspare euch die Details, aber ich sag mal so viel: Wenn man in einem Diagramm eine Ursprungsgerade zu zeichnen hat, die Punkte aber streuen, weil Versuchsergebnisse sich nun mal so verhalten, zeichnet man halt eine Ausgleichsgerade und schaut, dass die ungefähr einen guten Mittelwert abgibt. Nun, sah die korrigierende Lehrerin aber nicht so, wie ich aus ihrem Kommentar \"Die Punkte müssen auf der Gerade liegen!\" herauslas. Aber wie zum geheiligten F _*_ ck soll das gehen, denn die Punkte nicht auf der Gerade sind???\nAber im Endeffekt ein doch recht entspannter Tag. Gut, ich muss nur noch lernen, Versuche auswerten und den Lieblingskratzbaum von einer meiner Katzen zerlegen, weil mein Vater meint, wir brauchen den nicht mehr. Die arme Katze...\nsend help pls\n\n_\nP.S. Habe ich eigentlich schon erwähnt, dass ich am Wochenende einen (ziemlich absurden) Penta mit Jungle Urgot gemacht habe? Nein? Jetzt wisst ihr es. Manchmal muss man halt auch damit angeben, wenn man sonst nichts hat xD_","replies":[{"poster":"00 M4ddin 00","date":"2019-10-09T13:44:03.351+0000","up_votes":1,"down_votes":0,"body":"Will auch etwas angeben :(","replies":[{"poster":"INoKami","date":"2019-10-09T13:56:38.221+0000","up_votes":1,"down_votes":0,"body":"Dann mach es doch. Ich hindere dich nicht daran :)","replies":[]}]}]},{"poster":"00 M4ddin 00","date":"2019-10-09T11:25:32.092+0000","up_votes":1,"down_votes":0,"body":"Noch 2,5 Stunden  :/","replies":[{"poster":"Xayah Strife","date":"2019-10-09T11:44:44.967+0000","up_votes":1,"down_votes":0,"body":"Akali hat das Klo im Zug verstopft. :(","replies":[]}]},{"poster":"5weeds","date":"2019-10-09T08:05:11.925+0000","up_votes":1,"down_votes":0,"body":"> Hab ich eigentlich bei den ganzen Bildern mal erwähnt das Wildschweine Tiere sind vor denen ich angst hab :0\n\nJa, aber schmecken tun die gut.\nUnd wie im Bild wunderbar zu beobachten ist, sind Wildschweine beim Bäume erklimmen nur so mittelprächtig begabt. Also rauf auf den Baum!","replies":[{"poster":"00 M4ddin 00","date":"2019-10-09T11:25:00.732+0000","up_votes":1,"down_votes":0,"body":"Noch nicht gegessen. Bin aber auch nicht so der wild Fan :)\n\nUnd auf Bäume klettern ? Da kommt es aber dann auf dem Baum an ob ich hoch komme ^^","replies":[]},{"poster":"Uranbrennstab","date":"2019-10-09T09:03:33.613+0000","up_votes":1,"down_votes":0,"body":"Hey! Geh weg!","replies":[]}]},{"poster":"Xayah Strife","date":"2019-10-09T11:03:57.979+0000","up_votes":1,"down_votes":0,"body":"Das war es dann wohl mal wieder für heute. ^^","replies":[]},{"poster":"Uranbrennstab","date":"2019-10-09T07:47:16.224+0000","up_votes":1,"down_votes":0,"body":"Und hier etwas Poesie.\nVon mir. \n\nOh Turan what marvelous design\nRoots forgotten in the stream of time\nOnce the raiders of the greatest Khans\nSkilled with bow, the riding clans\nOnce so feared by king and lord\nNow welcomed in every port\n\nOh Turan your golden roofs\nTell no tales of your feral roots\nGold and silk, no fur and steel\nWords and Coin, no sword and steal\nA place of cultue, wealth and song\nTuran a place that I truely long","replies":[{"poster":"Xayah Strife","date":"2019-10-09T07:56:54.190+0000","up_votes":1,"down_votes":0,"body":"Dem schließe ich mich an. :) \n\nMother used to say\n\"You are so special.\nNo one will shine as bright, my dear\".\nWill I tire of slaying endless beasts that hunt them?\nWill the killing rid me of these horns that disgust them?\nLittle demon in the forest all alone\nYou were there\nNow I remember!\nYes! You were there!\nCome with me now\nSo ride on, my DARLING!\nHere comes the sun\nIt won't shine on us forever\nYou touched my heart\nSo ride on, my DARLING!\nWe can win the fight and\nVanquish my fear","replies":[{"poster":"Uranbrennstab","date":"2019-10-09T08:07:58.662+0000","up_votes":1,"down_votes":0,"body":"Selbst geschrieben?","replies":[{"poster":"Xayah Strife","date":"2019-10-09T08:08:45.349+0000","up_votes":1,"down_votes":0,"body":"Songtext. :)","replies":[{"poster":"Uranbrennstab","date":"2019-10-09T09:00:58.601+0000","up_votes":1,"down_votes":0,"body":"Schade. Ich dachte wir tauschen uns hier auf poetischer Ebene aus.","replies":[{"poster":"Xayah Strife","date":"2019-10-09T09:08:58.841+0000","up_votes":1,"down_votes":0,"body":"Zählen Songtexte von Liedern die man feiert etwa nicht? :(","replies":[{"poster":"Uranbrennstab","date":"2019-10-09T09:36:27.074+0000","up_votes":1,"down_votes":0,"body":"Nicht, wenn es um selbstgestaltete Werke geht. Ansonsten jedoch schon","replies":[{"poster":"Xayah Strife","date":"2019-10-09T09:58:36.208+0000","up_votes":1,"down_votes":0,"body":"Tut mir leid aber dafür habe ich kein Talent.","replies":[]}]}]}]}]}]}]}]},{"poster":"Xayah Strife","date":"2019-10-09T07:13:52.425+0000","up_votes":1,"down_votes":0,"body":"Teig ist ein weiches zusammenhängendes Gemisch aus Mehl und Flüssigkeit (Wasser und/oder Milch), das durch Einwirkung von mechanischer Energie (Kneten, Schlagen oder Rühren) entsteht und formbar ist.[1] Typische Beispiele sind Kuchen- und Brotteige. Teig wird als Nahrungsmittel nicht roh verzehrt, sondern wird erhitzt (trocken gebacken, in Speisefett „herausgebacken“ oder in Wasser oder Dampf gegart) und erhält dabei seine endgültige Konsistenz, Geschmack und Aussehen.","replies":[{"poster":"Uranbrennstab","date":"2019-10-09T07:40:43.606+0000","up_votes":1,"down_votes":0,"body":"Und Leute, die Zuckerguss mit Wasser machen haben die Kontrolle über ihr Leben verloren.","replies":[{"poster":"5weeds","date":"2019-10-09T08:25:04.201+0000","up_votes":1,"down_votes":0,"body":"Genau! Mit Spucke wird das gemacht!","replies":[{"poster":"Xayah Strife","date":"2019-10-09T08:39:19.271+0000","up_votes":1,"down_votes":0,"body":"Zuckerguss aus eigener Herstellung. ^^","replies":[{"poster":"Uranbrennstab","date":"2019-10-09T09:00:29.401+0000","up_votes":1,"down_votes":0,"body":"Eklig...","replies":[{"poster":"Xayah Strife","date":"2019-10-09T09:09:30.918+0000","up_votes":1,"down_votes":0,"body":"Dafür ist es 100% Bio und Vegan. \nKann man dann zum doppelten Preis an Ökos verkaufen. :)","replies":[]}]}]}]}]}]}]}