{"poster":"00 M4ddin 00","date":"2019-11-07T09:08:19.631+0000","title":"[TGSG] bald Freitag ^^","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":0,"body":"Guten morgen :3 \r\n\r\nSo da ausser mir alle anderen die Woche wohl wenig Zeit haben schreib ich mal wieder einen theard. Also quasi das beste was passieren kann an einen Donnerstag ^^ \r\n\r\nNa wie geht's euch ? Hoffe bei euch ist alles gut :) \r\n\r\nArbeit ist heute mal wieder super öde -.- Und ich hab eigentlich gar keine Lust :/ Will heim ! \r\nIch müsste jetzt zuhause liegen auf meinen sofa, eingerollt in zwei decken und schlafen :0 Also verdient hätte ich es :/ \r\n\r\nHabt ihr schon Pläne fürs Wochenende? \r\n\r\nIch hab bisher noch nichts geplant. Denke aber ich mach das selbe wie immer ^^' \r\nZocken, Serien schauen, essen gehen und schlafen :D \r\nWerd am Wochenende auch mehr Escape From Tarkov spielen :)\r\nUnd world of warships muss ich spielen hab noch 10 tage Premium Account das muss ausgenutzt werden ! Dann kann ich mir endlich die Bismarck kaufen ohne meine freien ep auszugeben :0 \r\n\r\nIch würde auch gerne nochmal ins Kino gehen und Joker nochmal anschauen aber dafür brauch ich erst ein paar Leute die mit gehen ^^\r\n\r\nNaja hoffe ihr habt einen schönen Tag :3","replies":[{"poster":"Xayah Strife","date":"2019-11-07T12:58:45.188+0000","up_votes":1,"down_votes":0,"body":"Warum sind hier nur 3 Kommentare?\nWas ist los mit euch Leute?","replies":[{"poster":"G2 Slippi","date":"2019-11-07T13:40:22.613+0000","up_votes":1,"down_votes":0,"body":"Weiß auch nicht was los ist, hier fehlen viele Stammschreiber...","replies":[{"poster":"00 M4ddin 00","date":"2019-11-08T06:13:39.990+0000","up_votes":1,"down_votes":0,"body":"Reich ich dir etwa nicht? :0","replies":[{"poster":"G2 Slippi","date":"2019-11-08T06:17:35.865+0000","up_votes":1,"down_votes":0,"body":"Doch, aber wenn mehr Leute kommentieren, kommen natürlich mehr Kommentare zusammen ^^","replies":[{"poster":"00 M4ddin 00","date":"2019-11-08T06:48:12.709+0000","up_votes":1,"down_votes":0,"body":"Ja das stimmt :/","replies":[]}]}]},{"poster":"Xayah Strife","date":"2019-11-07T14:10:54.417+0000","up_votes":1,"down_votes":0,"body":"Dann muss ich wohl mal ein Thread für morgen vorbereiten sonst kommt wieder nichts so letzte Woche...","replies":[]}]}]},{"poster":"INoKami","date":"2019-11-07T16:17:15.102+0000","up_votes":1,"down_votes":0,"body":"**[Der TGSG-Blog] Geschichten eines Azubis, Tag 240**\n\nAusnahmsweise kommt heute mal die Bahn unbeschadet davon.\nUnd jetzt frage ich mich wieder, warum ich unbedingt die Monster-Verspätung für morgen heraufbeschwören muss? Meine Lernkurve fällt noch steiler als ein abgestützter Satellit...\n\nHeute war wie immer Theorie-Tag, allerdings mit ein, zwei Kniffen: wir bekamen spontanen Besuch (und das meine ich ernst, den hat niemand angekündigt) von einem Ex-Schüler, der kurz seine Arbeitsstelle vorgestellt hat und dann eine kleine Fragerunde eröffnet hat. Im Grunde war es nur eine 20-minütige Show, in der dem Schulleiter wieder mal sein _*_ rsch vergoldet werden muss, weil alles andere sein Ego nicht akzeptiert, aber irgendwie immer noch besser als Unterricht. Und einer meiner Freunde hat sich in seinem Privatlabor etwas Menthol gekocht und heute einer Flasche voller Mentholkristalle mit in die Schule gebracht. Ihr wisst schon, das Zeug, was in Hustenbonbons drin ist. Gegen Nachmittag hatte sich schon ein leichter Geruch in unserer Umgebung festgesetzt, aber da gefühlt jeder erkältet war, klagte keiner. Hätte nie gedacht, dass der sich mal um unserer Gesundheit kümmern würde, das passt gar nicht zu ihm,\nAuf der anderen Seite: ich kenne ihn. Ich versuche jetzt schon, herauszufinden, zu was er es weitersynthetisieren will und wie ich ihn kenne, wird es offensichtlich nichts gesundheitsförderndes sein, sonst hätte es sein Interesse nicht geweckt^^","replies":[{"poster":"00 M4ddin 00","date":"2019-11-08T06:16:28.371+0000","up_votes":1,"down_votes":0,"body":"Immerhin ist die bahn mal pünktlich ^^","replies":[]}]},{"poster":"Soul92fly","date":"2019-11-07T15:15:27.213+0000","up_votes":1,"down_votes":0,"body":"Mir geht's soweit ganz gut und dir?\n\nPläne fürs Wochenende?\n\"Genau das selbe, wie jedes Wochenende. Wir versuchen, die Weltherrschaft an uns zu reißen.\"\n:P\n\nAlso Pläne habe ich keine direkt, aber ich mag deinen Plan und werde den einfach mal ganz dreist kopieren. \nZocken, Serien schauen, essen gehen und schlafen :D\nVor allem werde ich Dead by Daylight spielen um noch mehr Skins zu farmen.\n\nIch muss noch ins Kino um Joker zu schauen, bin bisher noch nicht dazu gekommen bzw. habs auch verpennt >.&lt;","replies":[{"poster":"00 M4ddin 00","date":"2019-11-08T06:12:22.417+0000","up_votes":1,"down_votes":0,"body":"Ja ich hab halt auch die besten Pläne :D \nIch hoffe ich kann auch eine Pizza in das Wochenende rein schmuggeln ^^\n\nUnd der Joker film ist echt gut :) \nWieder mal ein Film wo sich der Kino Besuch richtig gelohnt hat :)","replies":[]}]},{"poster":"G2 Slippi","date":"2019-11-07T09:48:45.091+0000","up_votes":1,"down_votes":0,"body":"Meine Pläne fürs WE sehen folgendermaßen aus:\n\nFreitag: In Planet Zoo mit meinem neuen Zoo beginnen und ws ein paar Runden LOL zocken und Haikyuu Staffel 2 suchten\nSamstag: Denke wird nicht viel anders als Freitag \nSonntag: im Kino Worlds Finale anschauen und danach zocken\n\nJoker möchte ich mir auch gerne mal ansehen, jedoch werd ich wahrscheinlich warten bis er auf Amazon Prime Video verfügbar ist.\n\nMein Tag wär sicher schöner, wenn ich nicht im Büro sitzen müsste..","replies":[{"poster":"00 M4ddin 00","date":"2019-11-07T09:53:42.012+0000","up_votes":1,"down_votes":0,"body":"Hab zwar Amazon Prime aber wirklich Filme hab ich da noch nicht geschaut nur Serien :) \n\nAber gute film e werden von mir eh immer als blueray gekauft :3 für die Sammlung  :)","replies":[]}]},{"poster":"II3RDB4NG","date":"2019-11-07T09:35:13.298+0000","up_votes":1,"down_votes":0,"body":"Ich gammel den ganzen Tag nur daheim rum, kiff mir die Birne weg und überleg was Ich als nächstes Essen soll.\nKomischerweise fress ich wie bekloppt und nehm ab.\nDie Frauenwelt würde mich um meinen Stoffwechsel beneiden.\nIch bin ganz stolz mein Zuckerkonsum radikal reduziert zu haben.\nIch ballerte mir am Tag ne Tüte Toblerone Minis rein, sind 300g, dann grad jetzt Weihnachtsmist und brauch im Kaffee in der Woche 1kg Zucker Beutel, nur für den Kaffee und Breikrempel, Rentnerzeugs halt.\nNächsten Monat krieg Ich wieder meine Zähne, da kann ich wieder richtig loslegen.\nBin beim Nachbarn vorbei gegangen der stand grad zufällig mit Besuch aufm Balkon und hat ein gedampft, sag Ich später, du , dein Besuch war aber aber dem Tod näher als dem Leben.\nSagt der, ja der wär fast abgekratzt, hat sich Diabetes angefressen und es nicht gemerkt.\nIch wusst gar nicht das des geht, sich Diabetes selber anfressen durch den ganzen Mist.\nEy, so schnell hab Ich noch nie was aufgeben im Leben wie den Zuckerkonsum.\nDadurch ess ich auf einmal viel mehr Obst und hab die Nahrungsergänzungsmittel weggelassen, was finanziell zwar ein Nachteil ist aber Obst ist irgendwie dann doch mehr der Bringer.\nSo, bevor der Kaffee kalt wird und meine Mitspieler sich wundern warum Ich auf der Lane rumstehe, geh Ich mal zurück ins Spiel und schau was da so geht.\nScherz.","replies":[]}]}