{"poster":"00 M4ddin 00","date":"2019-04-29T09:00:43.248+0000","title":"[TGSG] mal wieder Montag","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":0,"body":"Guten morgen :) \r\n\r\nHoffe euch geht's allen gut? \r\nWie war euer Wochenende? \r\nMein war ok leider ist was sehr doofes passiert aber ja :(\r\nPositives ich bekomme ab nächsten Monat endlich besseres Internet! Endlich ! \r\nHab seit 2 Jahren eine 16k Leitung was das beste war was ging und nun bekomme ich 100 k und kann sogar noch auf 250k rauf gehen :3 \r\nDann nur noch einen neuen PC und dann streamen ich bis twitch mich bannt! Sollte easy gehen ^^ \r\n\r\nDann kann es sein das ich mir demnächst ein neues Handy hole :) \r\nWas haltet ihr von Huawai und hat jemand das p30 ? Das wird es wohl werden.\r\n\r\nAchja ! SKY fick dich ins knie du .... ahhhh kann weder GoT noch was anderes schauen und auch garnicht erst mich ein loggen .... Was soll der scheiß Geld kassieren aber dann geht nichts -.- hoff das geht heute abend sonst eskaliert ich direkt ! \r\nWird direkt deren ihr Bank Einzug gesperrt kein Geld mehr. Ich sammel eh gerne Mahnungen von ungeliebten idioten \r\n\r\nHoffe ihr habt einen schönen Tag :)","replies":[{"poster":"Uranbrennstab","date":"2019-04-29T10:35:13.634+0000","up_votes":1,"down_votes":0,"body":"Jo boys n girls whats crackin?","replies":[{"poster":"Xayah Strife","date":"2019-04-29T11:01:15.794+0000","up_votes":1,"down_votes":0,"body":"Ich hab Ingame eine interessante Person getroffen und nun hab ich wieder lust auf lol. :D \n\nAusserdem hab ich am Samstag Ordinal Scale geschaut und war positive überrascht.\nDas ist der Movie von SAO der 2017 rauskam. :) \n\nhttps://i.redd.it/rmabeqdq32n21.png","replies":[{"poster":"Uranbrennstab","date":"2019-04-29T11:10:22.739+0000","up_votes":1,"down_votes":0,"body":"Heiraten die endlich?","replies":[{"poster":"Xayah Strife","date":"2019-04-29T11:28:16.990+0000","up_votes":1,"down_votes":0,"body":"soll ich das wirklich spoilern?","replies":[{"poster":"Uranbrennstab","date":"2019-04-29T11:32:16.746+0000","up_votes":1,"down_votes":0,"body":"Also ich schaue es definitiv nicht, von daher, klar, aber mit Spoilerfunktion, wir sind ja nicht alleine hier","replies":[{"poster":"Xayah Strife","date":"2019-04-29T11:37:48.755+0000","up_votes":1,"down_votes":0,"body":"> ###*Sie verliert ihr Gedächt in Folge der Ereignisse des Film darum fängt sie an Tagebuch zu schreiben. Als Kirito im RL bei ihr zuhause ist und sie Tee holen geht lies er ihr Tagebuch. Sie kommt rein sagt es nicht schlimm ist. Kirito fängt an zu weinen wirft sie auf ihr Bett und beide sagen \"Ich liebe dich\" . Am Ende des Filmes schauen die beide Sternschnuppen an. Kirito gibt ihr nun auch im RL einen Ring. Dieser Ring gilt als Versprochen das beide irgentwann heiraten werden.*\n\nIch hab auf Reddit ein Beitrag gefunden der erklärt warum die Charaktere so komisch sein:\nhttps://www.reddit.com/r/swordartonline/comments/bi5omp/is_asuna_different_in_the_light_novels_than_she/\n\nZusammenfassung davon: Es wurde viel rausgeschnitten was den Charakteren tiefe nimmt darum werde ich auch lieber die Bücher lesen. ","replies":[{"poster":"Uranbrennstab","date":"2019-04-29T12:26:30.782+0000","up_votes":1,"down_votes":0,"body":"Ja wenigstens ein Happy End. Ich mag das nicht, wenn das auf Krampf verhindert wird.\nAußer jetzt bei Akame Ga Kill, da hat das sehr gut gepasst wie ich fand.","replies":[{"poster":"00 M4ddin 00","date":"2019-04-29T12:57:19.426+0000","up_votes":1,"down_votes":0,"body":"Ich will aber happy ends und dann soll die Geschichte auch noch schön enden ^^","replies":[{"poster":"Uranbrennstab","date":"2019-04-29T13:58:47.656+0000","up_votes":1,"down_votes":0,"body":"Schon Valkyria Chronicles gesehen?","replies":[{"poster":"Xayah Strife","date":"2019-04-29T15:37:30.999+0000","up_votes":1,"down_votes":0,"body":"davon hab ich gehört glaube eine Freundin von mir hat mir den empfohlen.\nMuss ich noch schauen.","replies":[{"poster":"Uranbrennstab","date":"2019-04-29T15:41:46.301+0000","up_votes":1,"down_votes":0,"body":"Würde ich dir sehr empfehlen","replies":[{"poster":"Xayah Strife","date":"2019-04-29T17:23:51.184+0000","up_votes":1,"down_votes":0,"body":"Aber das war kein Mechaanime oder?\nIrgentwas hatte ich vor ein paar Wochen angefangen und wieder aufgehört aber mir fällt der Name nichtmehr ein.","replies":[{"poster":"Uranbrennstab","date":"2019-04-30T05:30:59.041+0000","up_votes":1,"down_votes":0,"body":"Nein ist kein Mechaanime","replies":[{"poster":"Uranbrennstab","date":"2019-04-30T07:13:18.271+0000","up_votes":1,"down_votes":0,"body":"Ja das sollte er sein. Schau ihn dir ganz an, ich fand ihn sehr sehenswert.","replies":[]},{"poster":"Xayah Strife","date":"2019-04-30T07:02:53.904+0000","up_votes":1,"down_votes":0,"body":"Ich habs gecheckt. Den Anime welchen ich meinte heisst:  \"Kakumeiki Valvrave\" oder \"Valvrave - The Liberator\". Davon hatte ich die ersten 3 Folgen geschaut aber den fang ich sehr anstrengend weil der Anfang sehr überladen ist. Damit muss ich mich nochmal beschäftigen ansich hatte er Potenzial.\n\nDeiner ist \"Senjou no Valkyria: Valkyria Chronicles\" richtig? Davon hätte ich mal in die erste Folge reingeschaut.","replies":[]}]}]}]}]},{"poster":"00 M4ddin 00","date":"2019-04-29T14:25:07.415+0000","up_votes":1,"down_votes":0,"body":"Ne der Name sagt mir zwar was aber kennen tu ich es nicht :0","replies":[{"poster":"Uranbrennstab","date":"2019-04-29T15:41:26.160+0000","up_votes":1,"down_votes":0,"body":"Ja und los.","replies":[]}]}]}]},{"poster":"Xayah Strife","date":"2019-04-29T15:47:54.534+0000","up_votes":1,"down_votes":0,"body":"Hmm.. es muss nicht immer ein Happy End sein. Hauptsache das Ende ist nicht super Stumpf sondern reizt einen nochmal so richtig schön mit. \nDas Ende von Darling in the Franxx wird ja von vielen als eher schlecht bezeichnet aber ich finde es ist eines der emotionalsten Enden die ich jemals in einem Anime gesehen habe wenn nicht das emostionalste. Ich hab bisher leider noch keinen Anime gefunden der vom Fealing her mit Darling in the Franxx mithalten kann. \nHier ein schöner Song aus der letzten Folge: https://www.youtube.com/watch?v=zEIGOeouT7Q","replies":[{"poster":"INoKami","date":"2019-04-29T16:27:24.571+0000","up_votes":1,"down_votes":0,"body":"Irgendwie hast du schon Recht. DitF hat wirklich ein emotionales Ende.\nIch saß weinend vor meinem Bildschirm und fragte mich, wie es nur dazu kommen konnte, dass dieses anfängliche Prachtstück von Anime in den letzten Folgen so sehr ruiniert werden konnte.\nWie es mal in einer Parodie hervorragend dargestellt wurde: ab Folge 20 fühlte es sich an, als hätten sich die Macher des Anime nach einer langen Partynacht ein, zwei Lines Koks zu viel durchgezogen. Anders kann man sich die letzten Folgen einfach nicht erklären.\n\nAuf der anderen Seite: das Ende von Katanagatari war noch mal eine Stufe schlimmer, deswegen kann ich beinahe damit leben, dass Darling so endete, wie es endete.","replies":[{"poster":"Xayah Strife","date":"2019-04-29T16:50:41.126+0000","up_votes":1,"down_votes":0,"body":"Ein spanischer Youtuber soll ein Interview mit dem Autor geführt haben und scheinbar soll in 2020 etwas neues geben. Da ich aber kein spanisch spreche kann ich schlecht prüfen ob das stimmt. Ich hab eine Spanierin von meiner FL gefragt und sie meinte das stimmt so. \nIch bin gespanned ob wir 2020 noch was sehen werden. \nAusserdem soll ich Mange ein anderes Ende erzählen aber der steckt noch bei Folge 10 da wird dauern.","replies":[]}]}]},{"poster":"Xayah Strife","date":"2019-04-29T12:45:16.008+0000","up_votes":1,"down_votes":0,"body":"Das ist kein richtiges Ende weil der Movie zwischen Staffel 2 und 3 spielt ausserdem muss er sich immernoch ihrer Mutter vorstellen und die überzeugen.\nEnde Staffel 3 soll Buch 14 sein und er gibt 21 Bücher aktuelle.","replies":[{"poster":"Uranbrennstab","date":"2019-04-29T12:48:02.767+0000","up_votes":1,"down_votes":0,"body":"Boah. Man kann eine Storyline auch echt ausreizen. Deswegen bin ich kein riesiger Fan von Animes. Ich schaue mir gerne kleinere, abgeschlossene an. Valkyria Chronicles zB. Da hab ich das Spiel schon geliebt und fand die Serie noch besser.","replies":[{"poster":"Xayah Strife","date":"2019-04-29T13:01:35.367+0000","up_votes":1,"down_votes":0,"body":"Wenn es stimmt das im Anime bestimmte Dinge rausgeschnitten worden sind kennen wir die richtige Story nicht.\nFand ich auch schon die ganze Zeit komisch das die beiden sind nie streiten schließlich sind die 2 Jahre zusammen.","replies":[]},{"poster":"00 M4ddin 00","date":"2019-04-29T12:58:30.726+0000","up_votes":1,"down_votes":0,"body":"Ich will eine elfenlied OVA :( die sich genau an die mangas hält :(","replies":[]}]}]}]},{"poster":"Uranbrennstab","date":"2019-04-29T11:41:26.182+0000","up_votes":1,"down_votes":0,"body":"Irre. Damit hab ich nicht gerechnet","replies":[]}]}]}]}]}]}]},{"poster":"INoKami","date":"2019-04-29T16:23:25.736+0000","up_votes":1,"down_votes":0,"body":"**[Der TGSG-Blog] Geschichten eines Azubis, Tag 151, revolutionär späte Abendausgabe**\n\nAch ja, Schule. Vermisst man irgendwie gar nicht nach den anderthalb entspannten Wochen zu Hause. Mein Schlafrhythmus weint schon wieder, meine Motivation wurde versehentlich aufgesaugt beim letzten Reinigungsgang und Schule ist sowieso ein gefährlicher Ort. Nicht nur, weil dort der Schulleiter, andere unliebsame Lehrer sowie eine Menge Langeweile dich auflauern, nur, um dich im ersten unaufmerksamen Moment zu überfallen (geschah wirklich heute. Konnte ich aber parieren, weil ich, nicht wie bei anderen Mitschülern, nach 2 Sekunden Blick auf die Tafel wusste, was der Lehrer wollte und es ihm sagen konnte), nein, es hat auch einen anderen Grund...\n\nEs geht um so einen gewissen Kinofilm, der neulich rauskam.\n\nUnd man kennt es ja: man kennt mindestens eine Person, die keine Probleme damit hat, (story-)relevante Details an andere Menschen zu erzählen, bevorzugt natürlich an jene, die betreffenden Film noch nicht gesehen haben. Zu dieser Kategorie zähle, wegen akuten Zeitproblemen, auch ich.\nTja, und jetzt ratet mal, was heute Nachmittag passiert ist.\nGenau, eine Mitschülerin hatte kein Problem damit, zu verraten, dass mindestens eine Person in Endgame draufgehen wird. Leider hat sie auch explizit erwähnt, welcher Charakter (euch zuliebe mache ich das nicht) es sein wird. Danke dafür, du kleine +++++++++++++ +++++++ +++++++++++ ++++++++++++++ ++++ ++++!!!\n\nAuf der anderen Seite kann ich aber jetzt nachvollziehen, warum eine andere Mitschülerin einen Gefühlsausbruch hatte, als wir (a.k.a. mein Freundeskreis) heute etwas über Endgame redeten. Sie mochte diesen Charakter. Sehr.\nStill not worth it.\n\nIn diesem Sinne: Eine schöne Woche euch!","replies":[]},{"poster":"Mjölnir Kind","date":"2019-04-29T12:20:33.307+0000","up_votes":1,"down_votes":0,"body":"https://media.tenor.com/images/5fc12cdb43d214a78dcd2c2128e850a5/tenor.gif?itemid=7786638","replies":[{"poster":"Xayah Strife","date":"2019-04-29T12:47:42.467+0000","up_votes":1,"down_votes":0,"body":"Oh Hallo sie leben also auch noch. :D\n\nhttps://media.tenor.com/images/3e7d551f4edbc139f1372a494eccd01d/tenor.gif","replies":[{"poster":"Mjölnir Kind","date":"2019-04-29T12:58:21.080+0000","up_votes":1,"down_votes":0,"body":"So irgendwie schon ja!\nAber auch nur weil ich erst wieder Do. arbeiten muss!!\nDann bin ich wieder Tod :(","replies":[]}]}]},{"poster":"Xayah Strife","date":"2019-04-29T09:09:15.938+0000","up_votes":1,"down_votes":0,"body":"Ich hab seid bestimmt schon 10 Jahren eine 16k Leitung...Bis die Telekom bei uns endlich mal Glasfaser legt bin ich bestimmt schon in Rente...\nNeuerdings versucht RWE bei uns die Menschen abzuwerben. Die haben aber auch keine neue Leitungen gelegt sondern versuchen aus den alten Kupferkabeln nach soviel wie möglich rauszubekommen. >.&lt;\nAngeblich bieten die 50k an. \nWas davon dann wirklich ankommt? \nBestimmt nichtmal die hälfte. \nSowas unterstütze ich nicht. \nIch möchte vernüftige Kabel bei uns solange bleibe ich bei der Telekom und meinen 16k.","replies":[{"poster":"00 M4ddin 00","date":"2019-04-29T09:40:34.315+0000","up_votes":1,"down_votes":0,"body":"Hatte in meinen alten Dorf nur 2k dann nach Jahren 6k dann irgendwann hybrid 50k dann normale Leitung 50k ... Dann 3 km weg gezogen in meine Wohnung und nur noch 16k aber das ist bald vorbei! :3","replies":[{"poster":"Xayah Strife","date":"2019-04-29T09:45:10.657+0000","up_votes":1,"down_votes":0,"body":"wenn der wechsel denn klappt. :D\nBei Internet weiß man ja nie.\nBei welchem Anbieter bist du?","replies":[{"poster":"00 M4ddin 00","date":"2019-04-29T09:49:05.730+0000","up_votes":1,"down_votes":0,"body":"Telekom :/ Ich weiß ... \n\nAngeblich bekomme ich nur einen neuen Router ohne Techniker \nHatte schon genug Stress und Streit mit der Telekom und ihrem allgemeinen Service -.-","replies":[{"poster":"Xayah Strife","date":"2019-04-29T09:50:54.691+0000","up_votes":1,"down_votes":0,"body":"Haha das könnte eine interessante Story werden.\nBerichte uns davon. Geschichten über die Telekom wären Stoff für ein eigenes TGSG.","replies":[{"poster":"00 M4ddin 00","date":"2019-04-29T09:52:00.485+0000","up_votes":1,"down_votes":0,"body":"Hab mich vor 2 Jahren schon übel ausgelassen das war auch voll der Krampf-.-\n\nBin aber nicht sicher ob das damals schon hier war ? :/glaube nicht damals hab ich das Forum nur gelesen ","replies":[{"poster":"Xayah Strife","date":"2019-04-29T10:30:01.695+0000","up_votes":1,"down_votes":0,"body":"Vor 2 Jahren habe ich gerade erst damit angefangen League zu spielen da kannte ich das Forum noch garnicht. :D","replies":[{"poster":"00 M4ddin 00","date":"2019-04-29T11:34:17.766+0000","up_votes":1,"down_votes":0,"body":"Ich arbeite mich gerade durch mein fünftes Jahr ^^","replies":[{"poster":"Xayah Strife","date":"2019-04-29T12:16:25.340+0000","up_votes":1,"down_votes":0,"body":"dann kannst du ja bald Rente bei Rito beantragen. :D","replies":[{"poster":"00 M4ddin 00","date":"2019-04-29T12:56:24.720+0000","up_votes":1,"down_votes":0,"body":"Sobald ich meinen verdienten Chalanger Platz bekommen habe :)","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Xayah Strife","date":"2019-04-29T09:02:36.978+0000","up_votes":1,"down_votes":0,"body":"Guten Morgen GoT ist wohl der Grund warum es bisher noch kein Thread gibt. :D\nBin auch gerade erst fertig mit der neuen Folge.","replies":[{"poster":"00 M4ddin 00","date":"2019-04-29T09:40:59.476+0000","up_votes":1,"down_votes":0,"body":"Will das heute Abend sehen und wehe es geht nicht -.-","replies":[{"poster":"Xayah Strife","date":"2019-04-29T09:45:36.425+0000","up_votes":1,"down_votes":0,"body":"Freu dich es wird episch mehr brauch ich dazu nicht zu sagen. :)","replies":[{"poster":"00 M4ddin 00","date":"2019-04-29T09:47:55.957+0000","up_votes":1,"down_votes":0,"body":"Ja eine freundin aus Amerika hat mir heute Nacht schon geschrieben das ich unbedingt die Folge sehen muss ^^","replies":[{"poster":"Xayah Strife","date":"2019-04-29T09:51:49.379+0000","up_votes":1,"down_votes":0,"body":"Ohja.\nWas ist eigentlich mit den restlichen Leute von uns?\nSchlafen die noch? Und was is nun mit Maggi? Lebt sie noch?","replies":[{"poster":"Uranbrennstab","date":"2019-04-29T10:42:38.784+0000","up_votes":1,"down_votes":0,"body":"Wir haben uns die Augen ausgestochen, damit wir nicht über GoT gespoilert werden.","replies":[{"poster":"Xayah Strife","date":"2019-04-29T10:58:58.200+0000","up_votes":1,"down_votes":0,"body":"und wenn dir jemand etwas ins Ohr flüstert?","replies":[{"poster":"Uranbrennstab","date":"2019-04-29T11:09:56.416+0000","up_votes":1,"down_votes":0,"body":"Blutadler.","replies":[]}]}]}]}]}]}]}]}]}