{"poster":"Mighty Lubu","date":"2015-05-29T17:31:14.002+0000","title":"Blitzcrank Q Bug????","subforum":"Melde einen Bug","up_votes":1,"down_votes":1,"body":"Hallo, wollte mal fragen ob das hier 2 bugs sind oder eher nicht und ob das noch andere hatten.und zwar kann es sein das Gragas zu Fett f&uuml;r Blitzcranks Q ist weil ich ihn einmal nicht ranziehn konnte und ich hatte getroffen aber meine fast blieb h&auml;ngen wie bei dem drachen und gragas hatte aber kein schild der den bl&ouml;cken k&ouml;nnte wie von morgana meine kumpel und ich waren erstmal &uuml;berrascht. und 2. ist mir heute morgen passiert das ich gegner Ezreal mit meiner Q ranziehn wollte aber er immer mit seiner E rausspringen konnte bowohl ich in schon hatte und in der beschreibung steht das die Q von blitzcrank auch bet&auml;ubt also warum konnte ezreal immer wegspringen und auch er hatte keinen schild. und so ist er immer entkommen und das war echt bl&ouml;d halt.","replies":[{"poster":"Mighty Lubu","date":"2015-05-29T20:29:26.395+0000","up_votes":1,"down_votes":0,"body":"ne das mit gragas war ja in bot und ich war dirket hinter ihm er hatte weder schild noch Zhonyas.und das mit ezreal ich hatte ihn bevor er seine E machte er machte seine E erst wo er  zu hälfte rangezogen war oder ist vllt die betäubung vons blitz Q zu schnell vorbei weil wo ich nen anderen ranzog war das symbol von der betäubung nur ganz kurz da.","replies":[]},{"poster":"recon","date":"2015-05-29T19:57:51.791+0000","up_votes":1,"down_votes":0,"body":"Ezreal: Kein Bug (siehe Kommentar von Rasune)\nGragas: Ich nehme an, dass war das Spiel als Gragas ein Zhonyas hatte. Entweder nutzte er das oder du hast den Drachen/Baron erwischt, falls der Kampf dort stattfand.","replies":[]},{"poster":"Rasune","date":"2015-05-29T18:02:41.895+0000","up_votes":1,"down_votes":0,"body":"Ezrael hat vermutlich in dem Moment wo du deine Q ausgelöst hast, seine E ausgelöst. Und dann bekommst du ihn erst garnicht. Sieht dann so aus, als habe er deiner Q wiederstanden. Genauso kann Sivir mit ihrer E deiner Q wiederstehen. Ebenso wer von Morganas Schild geschützt ist. Da gibts noch so einige und Einiges, was dem Q von Blitz und Thresh wiedersteht.","replies":[]}]}