{"poster":"Mighty Lubu","date":"2015-04-30T07:51:28.928+0000","title":"Tower Bug??????","subforum":"Melde einen Bug","up_votes":1,"down_votes":1,"body":"hallo community meine freunde und ich haben ne frage ob das ein bug ist und zwar das die tower bissen buggen????weil wenn wir auf die zurennen mit den vasallen und die vasallen davor rennen feuern die gegner tower ab und zu trotzdem auf uns obwohl die vasallen davor sind O.o und wenn die gegner bei unsern towern uns sozusagen aufs maul hauen greifen unsere tower nicht den gegner sondern die vasallen weiter an und nicht die gegner obwohl die gegner  direkt vor uns stehn.und die tower feuern erst auf die gegner wenn wir tot sind oder wenn die wegrenen bekommen die noch 1schuss ab- - und das hatten mein kumpel und ich letztens auch im aram da hatte ich bissen laggs und wurde von blitzcrank direkt am unsern tower gekillt sagte mein kumpel weil der tower wieder mal nur die vasallen angriff statt blitzcrank der mich grade killte und das regt halt bissen auf das unsere tower sowas machen.und nun meine frage ob das auch noch andere haben und ob das vllt ein bug ist???","replies":[{"poster":"PottyMcSmoke","date":"2016-07-27T15:55:53.807+0000","up_votes":1,"down_votes":0,"body":"Hatte den Bug in einem Spiel auch. Die habe uns unter dem Tower zu zweit angegriffen und keiner hat die Tower Aggro bekommen. Das Spiel Noobfreundlich machen ist anders :D","replies":[]},{"poster":"Mighty Lubu","date":"2015-04-30T20:20:06.856+0000","up_votes":1,"down_votes":0,"body":"ja das weiss ich nur bissen komisch wenn ich kein ignite habe oder da kein gegnerischer champ ist dann auch??","replies":[]},{"poster":"Alustus","date":"2015-04-30T10:25:05.091+0000","up_votes":1,"down_votes":0,"body":"Wäre schön wenn du ein video machen würdest.\n\nHört sich für mich nämlich nicht sehr glaubwürdig an, kann aber auch sein, dass du die Türme nicht verstehst.\n\nDa ich es gerade in deinem Spielverlauf sehe, dass du immer mit Ignite spielst, und die letzten Spiele ein paar mal Teemo und Darius gespielt hast folgendes:\n\nWenn der Gitschaden/Blutschaden/Feuerschaden auf noch nicht abgelaufen ist und du dem gegner im Tower nachrennst ist es ganz logisch, dass der Tower dich dann angreifft.\n\nDan sehe ich noch, dass du blitzcrank oft spielst welcher öfters durch seine ult passive schaden macht durch was wieder zur turmagro führen kann.\n\n\nEs ist völlig egal ob du vor oder hinter den Vasallen stehst, solange du nicht der erste bist welcher in den Tower rennt, soll heißen :\n\nEs werden in Tower Range immer Vasallen focusiert, außer du greifst einen gegner an (welcher auch in Towerrange ist) .\n(blitz passiv, Darius blutschaden, teemo gift, Ignite zählen als angreiffen)","replies":[]}]}