{"poster":"nahuatl","date":"2015-09-01T13:43:15.990+0000","title":"Lacatich, el señor del viento.","subforum":"Creaciones de la comunidad","up_votes":2,"down_votes":0,"body":"Nombre: Lacatich, el Señor del Viento\n\nLugar: Noxus\n\nRol: Luchador AP, Tanque AP.\n\nTipo de ataque: Con pu&ntilde;os de viento\n\nStats Básicos: \n\nVida: 612.1 (+101 por nivel)\n\nMana: 421.2 (+43 por nivel)\n\nDaño de Ataque: 62.23 (+7.8 por nivel)\n\nVelocidad de Ataque: 0.583 (+5.8% por nivel)\n\nVelocidad de Movimiento: 355\n\nRegeneracion de Vida: 8.12 (+1.1 por nivel) \n\nRegeneracion de Mana: 7.01 (+0.61 por nivel)\n\nArmadura: 28.12 (+2.2 por nivel)\n\nResistencia magica: 30.2 (+1.3 por nivel)\n\nHabilidades:\nPasiva: Los ataques basicos de Lacatich causan 20/23/26/29/32/38/41/44/47/50/56/59/62/65/68/74/77/80 (+25% de Poder de Habilidad) de da&ntilde;o magico a los enemigos que se encuentren detras del objetivo hasta de 90 grados. \n\nQ: Lacatich tiene dos cargas de ataques a distancia que son pu&ntilde;os en forma de arcos, periodicamente uno hacia la izquierda y otro a la derecha causando 30/70/120/200/240 (+40% Poder de Habilidad) de  da&ntilde;o magico (si ambos arcos golpean a un mismo objetivo en menos de 3 segundos marca al objetivo durante 5 segundos, el siguiente ataque basico que ha Lacatich al objetivo este se queda aturdido por 0,5/0,7/1/1,5/2 segundos.\n\nW: Se lanza hacia una zona objetivo y relentiza a todos los objetivos golpeados ademas de causar 80/130/190/230/290 (+20% de Poder de Habilidad) (+15% Vida Maxima de Lacatich) de da&ntilde;o magico. Los objetivos en e foco de impacto son derribados por 1/1,3/1,5/1,7/2 segundos.\n\nE: Lanza una tormenta de arena a una zona objetivo haciendo 20/30/50/60/80 (+20% de Poder de Habilidad) da&ntilde;o por segundo y reduciendo la vision del enemigo poco a poco hasta llegar a un 50%.\n\nR: Dos mazos gigantes de de aire y arena golpean una zona objetivo probocando 250/350/500 (+55% de Poder de Habilidad) a todos los objetivos de la zona y relentizandolos. si en la zona de impacto hay solo un objetivo, este recibe un 10% del da&ntilde;o como da&ntilde;o verdadero. \n\nHistoria:\n\nJaham desde joven fue un guerrero implacable sin ningun tipo de objeto. solo con sus puños lograba derribar hasta a los rivales mas fuertes. Disfrutaba de las peleas dificiles en las cuales aprendia mas sobre sus habilidades y asi poder autosuperarse. Esa ambicion de un muchacho vivo se vio frustrada por la armada de Noxus que lo queria en el campo de batalla a toda costa.\n\nVarios años estuvo en el ejercito de Noxus sin ser muy popular en los frentes de batalla ya que usualmente se centraba en misiones en grupo de hasta 5 miembros. \n\nUna de esas misiones de reconocimiento cerca de La Selva de Kumungu termino mal cobrandose la vida de todos los miembros a excepcion de Jaham, este termino herido de gravedad.\n\nEl audaz guerrero vago por la selva en busca de ayuda y algo con lo cual curarse. Callo desmayado. Desperto en lo que parecia una casa de madera no muy grande, estaban vendadas las heridas y no sentia mas dolor alguno. Lo asistia lo que parecia ser una hermosa bruja del bosque. Durante un par de dias estuvo hospedado en ese lugar, y tuvo que marcharse. Antes de partir la bruja le dijo: -Veo que eres un valiente guerrero, pocos son aquellos que sobreviven a heridas de tal magnitud. Por reconocimiento te concedo el poder de controlar el viento a voluntad. Jaham fue envuelto en una orbe de luz y al dispersarse aparecio un nuevo personaje. Se sentia diferente. Fue la muerte de Jaham. Opto por un nombre, el cual al oir los ejercitos enemigos, su venida sea significado de el asesinato del jefe de guerra, LACATICH. \n\nLacatich volvio a Noxus y se presento ante el general. Tan rapido como volvio a la ciudad, partio para la invasion preparada que tenian hacia Jonia. Se le fue encomendado como mision, el asesinato de un Gran Anciano jonio. utilizando sus nuevas habilidades del control de viento pudo asesinar al Anciano y salir del lugar sin antes acabar con un poñado de soldados jonios. Segun cuenta Lacatich, no hubo ninguna dificultad para llegar hasta el Anciano. \n\nAhora mismo Lacatich se encuentra en La Selva Kumungu, vive con la hermosa bruja que le concedio los poderes y juro que la protegeria como si su vida dependiese de ello. \n\n\"Todo es mejor cuando tienes el viento a tu favor.... y a mi.\"\n                                                                                      Lacatich","replies":[{"poster":"Shappaw","date":"2015-09-01T13:50:51.946+0000","up_votes":1,"down_votes":0,"body":"Okey, más allá de que aún no tiene Lore, parece un campeón simple pero balanceado. Se tiene que ver el tema de los CD, Stats, etc; pero no quita la idea de que podría ser un buen campeón.","replies":[{"poster":"nahuatl","date":"2015-09-01T14:55:39.550+0000","up_votes":1,"down_votes":0,"body":"la verdad voy a subir mas adelante el tema de los stats. el tema aca es el tema de que si es o no muy roto o algo asi","replies":[{"poster":"Shappaw","date":"2015-09-01T15:03:56.510+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=nahuatl,realm=LAS,application-id=J0mxKtkB,discussion-id=c6AU2zap,comment-id=00000001,timestamp=2015-09-01T14:55:39.550+0000)\n>\n> la verdad voy a subir mas adelante el tema de los stats. el tema aca es el tema de que si es o no muy roto o algo asi\n\nNo lo noto desbalanceado. Es más, me atrevo a decir que está muy bien pensado. Sería un campeón para Top lane por lo que veo, no? (confieso que me gustaría que sea melee y top lane).","replies":[{"poster":"nahuatl","date":"2015-09-01T16:09:29.016+0000","up_votes":2,"down_votes":0,"body":"es melee pero le puse algo de rango para que no todo lo que haga sea cuerpo a cuerpo. mas adelante subo la historia y los stats asi como el daño de cada habilidad.","replies":[]}]}]},{"poster":"JACKY FANBOY","date":"2015-09-01T14:51:33.031+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Shappaw,realm=LAS,application-id=J0mxKtkB,discussion-id=c6AU2zap,comment-id=0000,timestamp=2015-09-01T13:50:51.946+0000)\n>\n> Okey, más allá de que aún no tiene Lore, parece un campeón simple pero balanceado. Se tiene que ver el tema de los CD, Stats, etc; pero no quita la idea de que podría ser un buen campeón.\n\nlo bueno es que no este roto como los que generalmente se crean xD","replies":[]}]},{"poster":"Matrox OpKarthus","date":"2015-09-01T16:49:22.977+0000","up_votes":1,"down_votes":0,"body":"Pasiva: me gusta pero me gustaría saber que daño hace y el angulo de este.\n\nQ: Me gusta pero estaría buena que mejor aplique un CC si aplica los 2 combos, ya que no tendria caso reducir la resistencia magica luego de haber lanzado los 2 golpes\n\nw: es como la R de {{champion:54}} ? si es asi esta un poquito op, pero podrias aplicar que solo pueda derribar una X cantidad de enemigos o los mas cercanos al centro y a los demas solo daño\n\nE: Me gusta la habilidad, pero la reduccion de vision podrias aplicarle que se va reduciendo con el tiempo sino seria muy op en una TEAMFIGHT, ademas seria como se debilita la arena naturalmente pareciendo algo logico\n\nR: No la veo muy mal pero esta algo vista y no me gusta mucho :/, lo unico que me gusta es el daño adicional por un solo objetivo\n\nConclusion: me gusta tu campeon en su gran mayoria, pero como todos los conceptos faltan ajustes, igual hay que pensar en la jugabilidad de este que es lo principalmente importante.","replies":[]},{"poster":"MatiHell","date":"2015-09-01T14:58:33.639+0000","up_votes":1,"down_votes":0,"body":"Alguna idea cuando lo lanzan?","replies":[{"poster":"Shappaw","date":"2015-09-01T15:02:12.645+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fachu CLR,realm=LAS,application-id=J0mxKtkB,discussion-id=c6AU2zap,comment-id=0001,timestamp=2015-09-01T14:58:33.639+0000)\n>\n> Alguna idea cuando lo lanzan?\n\nOmg. This people...","replies":[{"poster":"MatiHell","date":"2015-09-01T15:09:35.312+0000","up_votes":1,"down_votes":0,"body":"no se puede preguntar?","replies":[{"poster":"Shappaw","date":"2015-09-01T15:55:15.577+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fachu CLR,realm=LAS,application-id=J0mxKtkB,discussion-id=c6AU2zap,comment-id=000100000000,timestamp=2015-09-01T15:09:35.312+0000)\n>\n> no se puede preguntar?\n\nDije, OMG. (?)","replies":[]}]}]}]},{"poster":"rokushoger","date":"2015-09-01T15:44:17.049+0000","up_votes":1,"down_votes":1,"body":"La idea está buena, pero debieras poner algo de historia, como se ve el personaje, sus relaciones con otros, si es bueno o malo, no se, algo así. Los poderes están buenos pero sin la historia susentando el concepto se ve pobre.","replies":[]}]}