{"poster":"nahuatl","date":"2016-02-11T13:31:46.841+0000","title":"Videojuegos - para mi, el nuevo arte","subforum":"Charlas Generales","up_votes":4,"down_votes":1,"body":"Bueno, como todos sabemos, los videojuegos evolucionaron demasiado en el ultimo sglo, mejores graficas, mas interacciones propuestas, mejores escenarios, acciones mas realistas, personajes mejores estetica y psicologicamente, etc etc etc. \r\nBueno, muchos sabemos que el crear un videojuego puede llegar a ser tan facil como hacer un buscaminas, o algo muuuy complejo y diverso como skyrim, dota, o battlefield. \r\nYo creo que el hacer un videojuego es un arte, una forma de expresion mas adquirida con el tiempo. Ademas de dar entretenimiento, (cosa que todas las artes dan), te da distintas emociones dependiendo de que videojuego estas jugando, como lo hacen al leer un buen libro o al ver una buena pelicula. \r\nEncaro el tema de que es un arte nuevo porque, el dise&ntilde;ador debe de crear personajes, escenarios, sonidos, dialogos, historias, objetos, etc etc. Pero al mismo tiempo, todas estas creaciones, deben de estar a gusto con las personas, debe de tener la imaginacion y la empatia para crear el &quot;producto&quot; que quiere el comprador. \r\nOtro punto que hace que llegue a ser un arte, es el tema de que toma mucho esfuerzo, con el tema de configuraciones de  acciones, interacciones con el ambiente y interaccion en cuanto a mando pantalla. \r\nsolo imaginense, mundos tan grandes y tan extensos en el mundo virtual no pueden crearse de la nada, desde mi punto de vista, skyrim es uno de los juegos con mejor escenarios que nunca vi:\r\nhttp://manatank.com/wp-content/uploads/2011/09/the-elder-scrolls-v-skyrim-lake-vista.jpg\r\nhttp://i13d.3djuegos.com/juegos/5029/the_elder_scrolls_v/fotos/maestras/the_elder_scrolls_v-1485116.jpg\r\nhttp://www.clandlan.org/teswiki/images/thumb/2/23/Soledad.jpg/600px-Soledad.jpg\r\ny no nos olvidemos de tierras subterraneas:\r\nhttp://vignette2.wikia.nocookie.net/elderscrolls/images/2/24/TESV_Blackreach_2.png/revision/latest?cb=20120513090724\r\nhttp://4.bp.blogspot.com/-iKRz1S1EqnQ/T460beg45cI/AAAAAAAAB0g/h2Ga4ECpMJM/s1600/ScreenShot46.bmp\r\nes solo un ejemplo de el hermoso escenario que conjuga skyrim, ademas de otro miles de juegos de mundo abierto, que para mi son los mejores juegos lejos, donde podes hacer lo que quieras, y crear TU historia.\r\nbueno para cerrar, los juegos estan evolucionando, y ya veo cuando se puedan hacer posible lo que pasa en SAO.\r\nAl crear un videojuego, se crean mundos, algunos increiblemente complejos como varios libros o peliculas de fantasia. Y eso es lo que para mi le da la escencia de arte a los videojuegos, el volver &quot;fisico&quot; algo que uno tiene en la cabeza, y que no tiene miedo de expresarlo, seamos sinceros, al conocer un videojuego, practicamente conocemos a su dise&ntilde;ador, si vemos un videjuego muy perverso y terrorifico, sabemos que el creador minimo esta mal de la cabeza XD. Y creo que hay que darle credito a los creadores de videojuego tanto como se le da a los escritores, directores, musicos, compositores, pintores, escultores, arquitectos, bailarines y fotografos. \r\n\r\nEs una opinion, y quiero saber que creen uds sobre esto. TY!{{champion:36}}","replies":[{"poster":"Runth","date":"2016-02-11T23:50:18.380+0000","up_votes":1,"down_votes":0,"body":"La tecnologia 3D + el avanze de los frames y el programa de pantalla verde y entre otros, hacen esas miles de maravillas\n\npero para hacerlos vivir, hay q meter cada codigo, cada punto del programa por segundo para hacerlos mover, darles vida lo q no se mueve una imagen\n\nAsi nacio ese tipo de juegos, tecnologia , programacion , diseños , etc , q la verdad es un precio alto al hacer y cual es lo mas importante.\n\nliteratura","replies":[]},{"poster":"Snooow","date":"2016-02-11T13:36:15.788+0000","up_votes":1,"down_votes":0,"body":"Concuerdo, Skyrim y The Witcher 3 son obras de arte, al punto que al terminar el The Witcher 3 lloré (y eso que me toco el final bueno, si me tocaba el malo me tiraba de un puente) {{item:3070}} {{item:3070}} {{item:3070}} {{item:3070}}","replies":[{"poster":"Neowest1","date":"2016-02-11T23:43:59.013+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tatocapoloco,realm=LAS,application-id=v7qsfXsE,discussion-id=tT2V9Wea,comment-id=0000,timestamp=2016-02-11T13:36:15.788+0000)\n>\n> Concuerdo, Skyrim y The Witcher 3 son obras de arte, al punto que al terminar el The Witcher 3 lloré (y eso que me toco el final bueno, si me tocaba el malo me tiraba de un puente) {{item:3070}} {{item:3070}} {{item:3070}} {{item:3070}}\n\nYo lloré y me toco el final malo , me quede sin triss y sin yen. fue tristisimo ver la historia de geralt el brujo que no la pone :'/. soy culpable de la poca activdad sexual de nuestro amigo geralt.","replies":[]}]},{"poster":"warrior530","date":"2016-02-11T13:57:02.090+0000","up_votes":1,"down_votes":0,"body":"Primera vez que juegas skyrim no? xD","replies":[{"poster":"nahuatl","date":"2016-02-11T14:23:34.804+0000","up_votes":1,"down_votes":0,"body":"nooo jajajaja lo jugue hace 2 años, lo doy de ejemplo porque seria el juego mas conocido con mejor ambientacion a mi parecer. Que persona que juega videojuegos no conoce skyrim? para mi fue es el mejor ejemplo en cuanto a imaginacion desbordada y a mismo tiempo bien controlada","replies":[{"poster":"warrior530","date":"2016-02-11T14:25:09.879+0000","up_votes":1,"down_votes":0,"body":"a mi se me bugearon las misiones asi que simplemente lo deje\naunque no te niego que esta genial, pero el problema de estos juegos es que tienen demasiados glitch y bugs","replies":[{"poster":"nahuatl","date":"2016-02-11T21:59:12.928+0000","up_votes":1,"down_votes":0,"body":"que pena maaan, yo llegue a completar casi todo (si ya se, un vicio xD) y segun la play fueron 300 horas de juego, y no termine todo! es increible lo que es ese mundillo","replies":[]}]}]}]},{"poster":"N1725","date":"2016-02-11T15:31:44.318+0000","up_votes":1,"down_votes":0,"body":"Fotografía no tiene nada que ver con pintura, piensa en el cubismo (incorporación del tiempo al plano), expresionismo, impresionismos, suprematismo etc, la fotografía no llega a nada así, su concepto va para una dirección muy diferente, actualmente sólo podríamos coincidir  que se muestran en plano pero ya es una comparacion limitada.\n\n\nY sobre que no se le da mucho mérito a los creadores de los juegos no me convence tanto, sólo nombremos a kojima y así tienes muchas personalidades reconocidas por sus creaciones.","replies":[{"poster":"nahuatl","date":"2016-02-11T21:57:28.705+0000","up_votes":1,"down_votes":0,"body":"bueno pero.... no hay que generalizar, evidentemente no todos los juegos podrian denominarse un arte, si yo hago un dibujo, no es una obra de arte, es un dibujo, hay ciertos factores que tendrian que conjugarse para denominar un juego una obra de arte. puse skyrim porque me parece el ejemplo perfecto de combinacion en cuanto a trama, ambientacion, asombro, y estetica, ademas de ser muy conocido, si vamos a otros juegos que podrian catalogarse un arte seria the last of us, o... shadow of the colosus, o the witcher, esos son juegazos, pero JUEGAZOS, y creo que se podrian catalogar como arte, porque es una combinacion de varios objetos venido de la cabeza de un hombre, pero bueno, si no te gusta ese nombre vamos a llamarle un \"museo interactivo\" por todos los elementos esteticos que tendria. \notra cosa, yo creo que podrian catalogar a un videojuego como un arte por la armonia perfecta de los distintos artes que ya existen, osea que en una nueva definicion de un BUEN videojuego podria ser, armonia perfecta de elementos artisticos para alcanzar el entretenimiento de quien lo vive, porque eso es un buen videojuego, un juego que te atrapa y te hace desear vivir en ese mundo fantastico","replies":[]}]},{"poster":"N1725","date":"2016-02-11T14:31:05.331+0000","up_votes":1,"down_votes":2,"body":"No estoy de acuerdo con que sea el \"nuevo arte\", solo lograron acercarse a una catalogación que ya tiene muchos años que es el cine, solo que se agrega otro componente que es la interacción, la cual tampoco es nueva ya que el teatro o las instalaciones ya usaron ese concepto.\n\nPor lo cual de nuevo no tiene nada, sólo tenemos mejores avances técnicos que antes no existía.\n\n\nY sólo para dejarlo como discusión, quien es el artista el que lo pensó o el que lo realizo? , que prima idea o técnica?\n( maldito Marcel Duchamp no?)","replies":[{"poster":"nahuatl","date":"2016-02-11T15:22:44.408+0000","up_votes":1,"down_votes":0,"body":"puede ser, pero ya se tomo como arte a la fotografia, y tiene mucho parecido a la pintura. y yo creo que lo que le hace arte a los videojuegos el el hecho de que el diseñador (o diseñadores o creadores) no es/son los que dan por terminada la obra, sino el que adquiere el videojuego es el que la termina, creo que por ahi se le podria tomar.\nel tema de quien es el artista, es justamente eso, no se le da mucho merito a los que crearon el juego","replies":[]}]},{"poster":"Lucrexio","date":"2016-02-11T14:59:22.398+0000","up_votes":1,"down_votes":0,"body":"Dark Souls también es bastante lindo.....{{summoner:14}}","replies":[]},{"poster":"Sirek","date":"2016-02-11T13:45:14.304+0000","up_votes":1,"down_votes":0,"body":"Concuerdo contigo pero creo que las historias de los juegos han decaído muchos (No en todos los juegos). Es demasiado el enfoque que le dan a los gráficos que olvidan la trama que el jugador quiere que le entreguen.\n\nFalta un Metroid, o un Megaman, juegos que dejen la marca. Ejemplo es WatchDog... Era considerado el juego revelación, pero la historia te deja como ñeeeee....","replies":[{"poster":"Tecnicomando","date":"2016-02-11T14:37:12.618+0000","up_votes":1,"down_votes":0,"body":"Yo cai en esa trampa del watch dog,reserve la version the lux a los 3 minutos que se puso a la venta 4 meses antes del lanzamiento...\n\nSalio el juego y con un i7 + titan,no podia jugarlo y los grficos daban pena, y la historia una mierda...\n\nSAlieron los dlc, parches y mas mierda aun...\n\nUn aficionado creo un mod para ver el juego tal cual se mostro en la e3 y ahora esta mucho mejor,graficamente\n\nPero aun no termino el modo historia(ni me intersa) pero si esa mecanica de entrar a otros juegos y cagarme a los que estan jugando, esa mecanica la rescato, pero el juego en si es una mierda con patas\n\nhttp://img.photobucket.com/albums/v665/tecnicomando/Sin%20tiacutetulo_zps10qhifmq.jpg\nsalu2","replies":[]},{"poster":"nahuatl","date":"2016-02-11T14:31:37.793+0000","up_votes":1,"down_votes":0,"body":"es cierto, unos juegos no pueden superar las historias de su precuela, como RE, aunque la historia de todo resident evil, desde el 1 hasta ahora me parece fasinante, hay libros (los compre todos xD) y me encantaron. \nlo de watchdog es cierto, lo jugue, y yo hacia generalmente misiones secundarias porque la historia principal no me estiraba mucho. en serio falta un megaman asi en un juego freeworld o algo que levanten de nuevo las historias buenas. \nUn ejemplo de historia increible puede ser el mismisimo lol, la historia de sus personajes (que cierto que cada vez tienen menos palabras en su lore y eso), la de sus ciudades y pueblos, me parece muy bueno, y ojala se empeñen mas en cuanto a la historia de los personajes, lo que me esta gustando es que estan sacando personajes mas misteriosos, como jhin o kindred. \ny bueno ojala rito se esmere para su prox champ y lo haga a grandes razgos yu con una buena historia detras, pre y post presentacion","replies":[]},{"poster":"Snooow","date":"2016-02-11T14:05:45.937+0000","up_votes":1,"down_votes":0,"body":"Jugastes al TW3? la historia esta basada en una saga de libros, por lo que no decepciona y por eso se llevo el premio al juego del año","replies":[{"poster":"Sirek","date":"2016-02-11T14:19:50.653+0000","up_votes":1,"down_votes":0,"body":"Por eso dije no en todos. No tengo tiempo para jugar muchos juego, pero lo que he leido en Review y Comentarios en internet The Witcher tiene una excelente historia, eso es lo que busca el Gamer.\n\nPor ejemplo, Need for Speed Most Wanted es considerado uno de los mejores juegos de carrera por que tenia una trama, la cual EA Games no ha podido replicar en los siguientes juegos del mismo titulo... Me entiendes a lo que voy.\n\nLos Resident Evil han logrado mantener al publico, pero no logran una trama como lo fue la de RE anteriores. \n\nCreo que hay un dejo en muchos aspectos por darle énfasis al motor gráfico, por ejemplo Batman Arkhan Knight, estuvo lleno de errores por lo que a muchos se les reembolso el pase de temporada (Parece, no recuerdo bien la historia como fue).","replies":[]}]}]}]}