{"poster":"LunarStrike","date":"2017-06-22T13:31:47.283+0000","title":"Diana is getting an Update (Confirmed by meddler)","subforum":"Gameplay","up_votes":2,"down_votes":1,"body":"Saw this on Surrender@20 just now\r\n\r\n&quot;Diana \r\nWe don&#039;t have work currently underway for Diana, wanted to mention her though since it&#039;s been quite a while since we mentioned her however. Our belief is whenever we next look at Diana we should be doing some changes beyond just balance, so probably a mini-update like Rek&#039;Sai or Heimer&#039;s. Unsure when exactly that would be, but did want to mention we&#039;re not just forgetting she exists or unaware of player feeling she needs help.&quot;\r\n\r\n__________________________________________\r\n\r\nReally glad, just thought I&#039;d share this :) really happy they&#039;ve decided to look at her again.","replies":[{"poster":"Weathered","date":"2017-06-22T14:33:16.853+0000","up_votes":1,"down_votes":0,"body":"The first sentence of that quote states that they have no work underway for her. Almost all of the not relatively new champions will get an update eventually, this doesn't really change anything from what we already knew.","replies":[{"poster":"LunarStrike","date":"2017-06-22T22:09:21.563+0000","up_votes":1,"down_votes":0,"body":"The fact that they brought her up is enough to almost assure us an update before Season 8. It's not confirmed... but Meddler clearly has an idea of what he wants to do next to diana. It's not like he's going to wait 3 years before giving her an update that he suggested. My guess is, its coming pre season 8.","replies":[{"poster":"Weathered","date":"2017-06-22T23:58:20.569+0000","up_votes":1,"down_votes":0,"body":"It is helpful. The mere mention is a bit of a reassurance that things are considered, instead of wondering if it is even on the table I guess.","replies":[]}]}]},{"poster":"Mysticman89","date":"2017-06-22T14:29:19.989+0000","up_votes":1,"down_votes":0,"body":"\"Whenever we next look at Diana\" <--- Not currently looking at her. \"probably a mini-update...\" <--probably, but maybe not \"Unsure when...\" <--they don't currently have plans to look at her. \n\nThis isn't exactly my criteria for confirmed update. I mean sure, great that riot knows she exists, but I feel like saying it's a confirmed update is a pretty big leap. I'm sure theres a ton of other champions they're not looking at that could maybe benefit from a mini-update that they currently have no plans for that he could have said the same thing about.","replies":[]},{"poster":"Limmie","date":"2017-06-22T14:20:51.527+0000","up_votes":1,"down_votes":0,"body":"I hope they manage to get her away from Akali's turf tbh, they have too much overlap right now.","replies":[]}]}