{"poster":"Avor Ashkeno","date":"2016-05-01T11:19:17.652+0000","title":"adc vs Magican","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Ich spiele derzeit mit den Gedanken, um meine F&auml;higkeiten im Team zu komplementieren, ein Magier wie Heimerdinger oder Karma anzuschaffen. Grunds&auml;tzlich sei gesagt hab ich bisser meistens auf die Sch&uuml;tzenklasse (adc) gesetzt.\r\n\r\nZu Heimerdinger: Ich sehe in der F&auml;higkeit Gesch&uuml;tze zu bauen, eine gute M&ouml;glichkeit bei der Verteidigung von T&uuml;rmen oder auch als Unterst&uuml;tzung f&uuml;r den Championskill. Sonst ist seine Raketensalve und die automatische Heilf&auml;higkeit noch interessant an ihm.\r\n\r\nZu Karma:  Gerade in Verbindung mir Mantra, glaube ich das sie eine sehr Starke Magierin ist.\r\n\r\nSind die beiden empfehlenswert? Oder soll ich doch eher auf Grave oder Jinx sparen. Zwar k&ouml;nnte ich auch in einen zweiten Tank invistieren, aber einen Tank mit &auml;quivalenten F&auml;higkeiten wie Amumu zu finden ist schwierig.\r\n\r\nMfG\r\n\r\nAvor Ashkeno","replies":[{"poster":"SeaHorseCalamity","date":"2016-05-01T11:30:56.702+0000","up_votes":1,"down_votes":0,"body":"Heimerdinger hat den Vorteil, dass es nicht einfch ist gegen ihn zu spielen. Vor allem gegen unerfahrene Gegner wirst du viel Spaß mit ihm haben. Zu Karma würde ich noch sagen, dass sie nicht extrem viel Schaden macht, sondern durch ihre unterstützenden Fähigkeiten in Kombination mit moderatem Schaden heraussticht. Das heißt, dass Karma mehr vom eigenen Team abhängt, als ein reiner Kampfmagier. \n\nWelche von den Champs dir eher liegt, musst du selbst herausfinden.","replies":[{"poster":"Avor Ashkeno","date":"2016-05-01T11:58:29.152+0000","up_votes":1,"down_votes":0,"body":"Hab gerade beim letzten Botspiel selbst gegen einen Heimerdinger gespielt und mit Miss Fortune verloren. Zur Verteidung, einer war afk. Ich hab trotzdem noch eine positive Bilianz bei den Botspielen.\n\nDie Idee dahinter ist wenn ich einer der Magier hab und mit ihnen klarkomme dann kann ich die Supporter Rolle auch ausfüllen. Das ich mit Karma stärker von Team abhöngig bin, ist für sie bei mir ein Minuspunkt.","replies":[{"poster":"Forunes Of War","date":"2016-05-02T05:49:41.847+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Avor Ashkeno,realm=EUW,application-id=Wj1wcocU,discussion-id=IBzo0k2c,comment-id=00000000,timestamp=2016-05-01T11:58:29.152+0000)\n>\n> Hab gerade beim letzten Botspiel selbst gegen einen Heimerdinger gespielt und mit Miss Fortune verloren. Zur Verteidung, einer war afk. Ich hab trotzdem noch eine positive Bilianz bei den Botspielen.\n> \n> Die Idee dahinter ist wenn ich einer der Magier hab und mit ihnen klarkomme dann kann ich die Supporter Rolle auch ausfüllen. Das ich mit Karma stärker von Team abhöngig bin, ist für sie bei mir ein Minuspunkt.\n\nHey,\nzunächst einmal möchte ich sagen das ich vom Handy aus schreibe und somit meine Rechtschreibung bitte zu entschuldigen ist.\nIn Hinblick auf das kommende MidSeasonUpdate würde ich dir als Dmg dealenden supporter brand, vel koz und zyra empfehlen. Zwar kosten sie alle nicht gerade wenig (4800, 6300) aber du kannst sie notfalls auch auf der midlane zocken.\nAnsonsten ist, wie schon von anderen gesagt worden, lulu eine gute wahl, vll. noch bard fürs eatlygame und eventuell zilean. \nDer Schaden von Morgana wird m.M. nach oft unterschätzt, auch weil sie mit ihrer Pfütze hervorragend zonen kann.\nIch hoffe ich konnte dir ein wenig weiterhelfen.\nMfG For(t)unes of War","replies":[]},{"poster":"TerrorRaven","date":"2016-05-01T15:14:48.066+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Avor Ashkeno,realm=EUW,application-id=Wj1wcocU,discussion-id=IBzo0k2c,comment-id=00000000,timestamp=2016-05-01T11:58:29.152+0000)\n>\n\n> Die Idee dahinter ist wenn ich einer der Magier hab und mit ihnen klarkomme dann kann ich die Supporter Rolle auch ausfüllen. Das ich mit Karma stärker von Team abhöngig bin, ist für sie bei mir ein Minuspunkt.\n\nDann wären Lulu und Morgana was für dich.","replies":[{"poster":"Avor Ashkeno","date":"2016-05-01T16:39:19.265+0000","up_votes":1,"down_votes":0,"body":"Morgana? Ernsthaft?\n\nZwar hat sie auch einen Flächenschaden, aber  ihre Magie macht kaum Schaden. Der Vorteil bei ihr ist das sie relativ günstig ist (1100 Erf) und das sie sehr leicht zu beherschen ist.","replies":[{"poster":"TerrorRaven","date":"2016-05-01T17:05:32.442+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Avor Ashkeno,realm=EUW,application-id=Wj1wcocU,discussion-id=IBzo0k2c,comment-id=0000000000000000,timestamp=2016-05-01T16:39:19.265+0000)\n>\n> Morgana? Ernsthaft?\n> \n> Zwar hat sie auch einen Flächenschaden, aber  ihre Magie macht kaum Schaden. Der Vorteil bei ihr ist das sie relativ günstig ist (1100 Erf) und das sie sehr leicht zu beherschen ist.\n\nSie kostet 1350 EP. Ihr W macht viel Schaden, je mehr Leben dem Ziel fehlt. Durch ihr Schild ist sie sowohl auf der Mid-Lane und als Support spielbar. Ihr Q hat einen hohen Grundschaden, eine gute AP-Skalierung und kann das Ziel bis zu 3 Sekunden festhalten. Und 3 Sekunden sind in LoL eine Ewigkeit. Und ihre Ulti macht, wenn sie voll durchkommt, auch viel Schaden. Zudem hat sie mit ihrer Passiven einen relativ guten Substain.","replies":[{"poster":"Avor Ashkeno","date":"2016-05-01T18:46:13.839+0000","up_votes":1,"down_votes":0,"body":"Also die günstige Morgana.\n\nKann geschlossen werden.\n\nDanke.","replies":[]}]}]}]}]}]},{"poster":"Transfertofeed","date":"2016-05-01T12:50:19.949+0000","up_votes":1,"down_votes":0,"body":"Ich finde Heimer derzeit überhaupt nicht empfehlenswert. Vllt im 1vs1 aber in einem  Team Fight ist er so schnell down und damit auch seine Türme. Alles an AOE macht schaden an seinen Türmen und der ADC sowas wie Cait etc kann die Türme schnell zerstören in einem Fight^^","replies":[]}]}