{"poster":"Womath55","date":"2014-09-08T18:22:41.539+0000","title":"LoL 2014 Világbajnokság","subforum":"E-sport","up_votes":1,"down_votes":0,"body":"Üdv mindenkinek!\r\n\r\nÚgy gondoltam, jó lenne egy téma, ahol kibeszélhetjük a 4. szezon világbajnokságának történéseit, illetve mindent, ami hozzá kapcsolódik. Vélemények a csapatok szerepléséről, esélylatolgatás, kérdések, válaszok, szóval minden, ami VB. \r\n\r\nÉn személy szerint \"Fnatic fanatic\" vagyok, ezért őket látnám legszívesebben végső győztesként, de elég erősnek tűnik a mezőny, a távol-keletieknél pedig teljesen más szinten van a játék. Bár nem követem és soha nem is követtem az ázsiai bajnokságot, azért meglepő, hogy az SKT ennyire széthullt. De így legalább csak két csapat van bent, akinek esélye lehet a 2. világbajnoki cím megszerzésére.","replies":[{"poster":"Womath55","date":"2014-09-08T21:36:24.441+0000","up_votes":1,"down_votes":0,"body":"Időközben megérkezett a csoport kiosztás is, az A csoporton kívül mindegyik érdekesnek tűnik. [Itt a link a csoportokról.](https://fbcdn-sphotos-d-a.akamaihd.net/hphotos-ak-xpa1/v/t1.0-9/10672102_721686641237313_7002598501334254670_n.jpg?oh=6a699ad92b13ccd919d574a593b08340&oe=54A0F6A4&__gda__=1418434076_469fdb5aee7c83752b03e400029566c8)\nC csoport egyértelműen a halál csoport, nagyon össze kell kapnia magát a Fnatic-nak, ha onnan ki akar jutni. D-ből pedig érdekes lesz az Alliance - Cloud 9 meccs, az biztos. SK-nak nem sok jót jósolok, TSM, TPA, Royal Club, mind egy kicsit magasabb szinten vannak szerintem.","replies":[]},{"poster":"RevanV","date":"2014-09-08T21:36:13.526+0000","up_votes":1,"down_votes":0,"body":"TSM mindhalálig :3","replies":[]},{"poster":"M4dr4c","date":"2014-09-08T19:11:24.800+0000","up_votes":1,"down_votes":0,"body":"Látva egy-két ázsiai csapat formáját meglepne, ha nem arról a részéről kerülne ki a világbajnok idén is. A két Samsung csapat elég meggyőző volt pl, kiejtették az SKT T1-et is.","replies":[{"poster":"Womath55","date":"2014-09-08T19:21:31.461+0000","up_votes":1,"down_votes":0,"body":"Igen, engem is nagyon megleptek. Mondjuk valahol mint ha azt olvastam volna, hogy az SKT T1 K-ban volt valami csere, és azóta nem úgy megy nekik, ahogy szeretnék. Bár megmondom őszintén, fogalmam sincs, hogy mi volt a felállásuk, Faker nevén kívül más nem maradt meg. :-D","replies":[{"poster":"CSZDragon","date":"2014-09-08T20:26:54.339+0000","up_votes":1,"down_votes":0,"body":"Igen, egy kicsit túl felkapták őt. Természetesen nagyon jó játékos, nem erről van szó, de nemrég olvastam egy cikket, hogy mennyire rossz az, hogy egy-egy embert ennyire \"istenítenek\", holott ez egy csapatjáték. Egyrészt a játékosnak sem jó, mert nagyon nagy lehet rajta a nyomás, másrészt a csapatösszhangra is rossz hatással lehet, harmadrészt meg sok tehetségre nem figyelnek fel annyira.","replies":[]},{"poster":"M4dr4c","date":"2014-09-08T19:23:52.084+0000","up_votes":1,"down_votes":0,"body":"Volt más is abban a csapatban, mint Faker? ;) Nekem is csak ő maradt meg névre. :D","replies":[]}]}]}]}