{"poster":"Wenscio","date":"2015-08-11T13:32:13.910+0000","title":"Support","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Cerco un support!\r\n\r\nSalve,voglio iniziare a giocare il ruolo del support,ma non ho idea di chi possa prendere per primo.\r\nSemplicemente sono alla ricerca di un buon support,che sia facile da gestire per chi &egrave; alle prime armi con questo ruolo.\r\nOvviamente gradirei la build tipo e le rune, grazie =)","replies":[{"poster":"Whommy","date":"2015-08-11T13:56:19.492+0000","up_votes":2,"down_votes":1,"body":"Inizia con support tankosi\nquindi {{champion:89}}  appena ci hai preso mano ti consiglio di provare {{champion:201}}  ed infine {{champion:412}} \npoi se ti piace il ruolo support/tank vai di {{champion:223}} \n\nrune tank\nmarchi armor /ad in caso ti tresh\nsigilli hp flat\nglifi mr/mrlv\nquinte armor/ vel movimento\n\nmaestrie 0/9/21 o la variante 0/16/14\ncercati qualche guida sul campione che preferisci\n\nappena hai dimestichezza, scegli fra i sempreverdi {{champion:40}}  {{champion:25}} {{champion:37}}","replies":[{"poster":"kirchhoff","date":"2015-08-11T22:19:21.306+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=tommyhaze17,realm=EUW,application-id=cAOZwaUi,discussion-id=qqiKeyOt,comment-id=0001,timestamp=2015-08-11T13:56:19.492+0000)\n>\n> Inizia con support tankosi\n\nno, non ti insegnano a \"supportare\"\nvedi solo kill kill kill","replies":[{"poster":"Whommy","date":"2015-08-12T09:49:30.982+0000","up_votes":1,"down_votes":1,"body":"se inizi a supportare con un champ squishy e non conosci le basi del ruolo\nvedi solo in chat feeder feeder feeder\n\nper iniziare col ruolo meglio stare sicuri con un tank, braum ti insegna più che bene il ruolo","replies":[]}]}]},{"poster":"Sorcio84","date":"2015-08-12T23:08:50.181+0000","up_votes":1,"down_votes":0,"body":"ciao . Per giocare support servono prima di tutto le basi :D\n\nti metto un link ad una pagina che ho creato da poco, con altri link a giide e consigli , per il momento 3/4 sui support (poca roba ma meglio di niente)\nhttps://m.facebook.com/1670526023183980/albums/1672655106304405/\n\nprima cosa imparati gli item {{item:3301}} {{item:3303}} {{item:3302}} \nparti di {{item:3340}} {{item:2044}}  e quando torni in base prendi {{item:2049}} {{item:3341}} {{item:2043}}  .\n\nil pink lo metti nel cespuglio vicino al drago (tribush)\n\nLe maestrie variano da champ a champ come per le rune, ma le maestrie utility (le ultime a destra) ne hanno una per farti partite con più gold all'inizio e volendo anche un +1 gold ogni volta che muore un minion vicino a te.\n\nimpara a tenere d'occhio spesso la minimappa e il raggio d'azione dei nemici davanti a te. warda la zona, il drago, e aiuta il tuo adc in base al champ che usi. usa bene i ping per chiamare SS quando mancano i nemici e per evitare gank dal jungler in bot (se sei bravo anche nelle altre lane)\n\nspero che come base sia utile :)","replies":[]},{"poster":"MasterErmes7206","date":"2015-08-11T19:37:47.439+0000","up_votes":1,"down_votes":0,"body":"Io ho giocato la mia prima vera partita da support oggi quindi al 99.99% delle probabilità mi sbaglio ma io ti consiglio Lulu, visto che è libera provala!","replies":[]},{"poster":"FaFFe","date":"2015-08-11T14:36:42.684+0000","up_votes":1,"down_votes":0,"body":"Ciao,\nnon prendere le mie parole per oro colato, gioco molto supporter ma devo ancora imparare quindi per delle informazioni migliori attenderei altri.\n\nAllora come prima cosa esistono in generale due tipi di supporter, quelli più aggressivi e quelli meno, te ne consiglierò due a parer mio molto performanti, che sono anche quelli che conosco meglio.\n\nSe vuoi un champ molto aggressivo ti consiglio Leona, secondo me molto semplice e potente. Ingaggi di E + Q e nel caso una R, la kill è molto spesso assicurata e nel caso non vada a segno la tua passiva ( applica un marchio che se attivato dagli alleati applica danno) ti permetterà di diminuire in modo considerevole la vita dell'avversario.\nGeneralmente parti di scudo reliquia ed evolvilo, in quanto lo scudo che offre può sempre essere utile.\n Prima però devi assolutamente comprare l'item obbligatorio per tutti i supporter: la pietra della visione, che evolverai più tardi nella partita.\n Successivamente {{item:3190}} : utile contro ap con uno scudo per tutto il team, {{item:3143}} sempre utile grazie alla tankiness che porta. \nBoots generalmente quelli della mobiliy per permetterti di un miglior roaming.\nPoi guardi alle necessità del tuo team: se non avete grandi engage un {{item:3800}} può essere utile, mentre se gli avversari sono tutti ad corri subito a prendere una {{item:3075}} , mentre se sono ap:{{item:3102}} , anche una {{item:3083}} pur essendo una scelta da top laner alle volte può comunque essere utile.\nRune direi tipiche dei tank anche se io personalmente preferisco puntare sull'armatura e magic resist più che sulla vita.\n\nSe invece vuoi un buon supporter più passivo ti consiglio janna, che offre di tutto per la protezione del carry: un knock up sulla Q un rallentamento sulla W uno scudo che dona ad sulla E e un disengage/cura molto potente sulla R.\nIl tuo compito in lane è pokkare all'infinito gli avversari con gli autoattack magari alle volte servendosi dell'ad bonus della E. \nGeneralmente inizio parti di {{item:3301}}  anche se taluni preferiscono {{item:3303}} .  \nNella build poi dovrai includere come prima la pietra della visione e il {{item:3110}}  molto utile contro una squadra che si basa sugli aa e il {{item:3190}} per le motivazioni scritte sopra.\nQuiesti item però incidono solo sulla difesa, tra gli aggetti pseudo offensivi ti consiglio {{item:3504}} la cui passiva è molto utile sugli alleati e il nuovo {{item:3050}}  anch'esso molto forte se utilizzato bene.\nNel caso nel team avversario vi siano troppi cc pesanti consiglio vivamente un {{item:3222}} grazie alla sua attiva molto potente ma dal cd molto lungo.\nInfine se la partita si rivolta considerevolmente in vostro favore un {{item:3041}} non è mai male, aumentando di molto il tuo potere magico e permettendoti di aumentare quindi il tuo potenziale difensivo.\nPer le rune devi adattarti al tuo stile di gioco: se punti al poke usa marchi dell'ad con una runa di critico(sempre utile) per il resto armor magic resist e, se ti ci trovi bene, anche un po' di ap.\n\n\nPoi consigli generali: appena prendi la pietra della visione scambia il trinket con il rivelatore di ward. Warda il più possible e in ogni caso cerca di difendere il carry se ti è possibile. \nNon aver paura di una ks se si corre il rischio che il nemico scappi con 4 hp o se un tuo compagno rischia di morirci.\nSpero di non aver scritto cagate e di esere stato utile ;)","replies":[]}]}