{"poster":"M8G Raver","date":"2019-08-22T21:42:44.822+0000","title":"#wutablassen","subforum":"Ligen & gewertete Spiele","embed":{"description":null,"url":"https://drive.google.com/open?id=16wShDmW4hDumFOtKHdVi0oNX9-TBgNzN","image":"https://lh6.googleusercontent.com/Q1c20vY4tr37sIjkVoUgc47ycfLzt7ZdiXKJP-oGIYpDVyU4HAr33I8jPuw=w1200-h630-p"},"up_votes":1,"down_votes":1,"body":"Hallo zusammen,\r\n\r\nleider habe ich gerade die Erfahrung machen müssen, dass ein Spieler der zuvor drei Ranglistenspiele in Folge verloren hat, mit mir in ein Team gematcht wurde. Er hatte so schlechte laune, dass er von Beginn an einfach nur zu den Gegner glaufen ist um sich töten zu lassen. Das Spiel war nach 17 Minuten beendet und Soraka stand da dann 0-15-0. Sie machte sich zu Anfangs gar nicht erst die Mühe Items zu kaufen und lief dann wie gesagt abwechselt auf jede Lane um sich dort töten zu lassen. Nach jedem Tot gab sie dem Team dafür die Schuld. Sehr positiv überrascht war ich von der Reaktion meines Teams. Niemand hat sich darauf eingelassen oder ist im Chat ausfällig geworden.\r\n\r\nDas solche Spiele dann als Niederlage gewertet werden finde ich unfair.\r\nNaja eigentlich kann ich mir den Beitrag sparen, da man da ja wahrscheinlich sowieso nichts machen kann.\r\n\r\nNur eine Frage stellt sich mir noch\r\n\r\nWarum macht man sowas?\r\nAlso mir geht das nicht in den Kopf. Da kann man dann doch League einfach schließen und was anderes machen gehen. Aber doch bitte nicht auch noch anderen Spielern das Spiel versauen.\r\n\r\n\r\nIhr könnt ja einfach mal eure Storys hier drunter schreiben.\r\nUnd vielleicht findet sich ja auch jemand der mir Hoffnung für die Zukunft machen kann, dass solche Spiele, ähnlich wie die Spiele bei denen jemand von anfang an AFK ist, in Zukunft nicht mehr gewertet werden\r\nStichwort Künstliche Intelligenz\r\n\r\n\r\n[Bild zu den Stats](https://drive.google.com/open?id=16wShDmW4hDumFOtKHdVi0oNX9-TBgNzN)\r\n\r\nVielen Dank fürs lesen und weiterhin viel Erfolg in der Kluft","replies":[{"poster":"SeaHorseCalamity","date":"2019-08-23T10:44:15.908+0000","up_votes":2,"down_votes":0,"body":"Jedes Ranked Game sollte gewertet werden, wenn du mich fragst. Alles Andere wird früher oder später ausgenutzt.","replies":[]},{"poster":"davinci10038","date":"2019-08-23T05:40:58.985+0000","up_votes":2,"down_votes":0,"body":"Ich versteh nicht wieso mann nicht einfach dodged wenn man sieht, dass eine Soraka mit Ghost Cleanse mid Lane geht. Dazu hat sie ja die letzten spiele auch noch schlecht gespielt.\n\nDie 3 LP machen doch nichts aus.","replies":[{"poster":"EuropeanMid","date":"2019-08-23T14:59:05.851+0000","up_votes":1,"down_votes":0,"body":"Es bleibt nicht bei 3 LP, der zweite Dodge kostet 15 LP, auf Dauer wird das ziemlich teuer.","replies":[]}]},{"poster":"JuicyJuju","date":"2019-08-22T23:33:15.934+0000","up_votes":1,"down_votes":2,"body":"Solche Games wird es immer geben Bro, aber cool von euch allen dass ihr nicht toxic wurdet und einfach cool geblieben seid. Ganz ehrlich, wenn du climben willst dann machen solche Game nichts aus, der Gegner wird sie auch haben. \n\nAußerdem ist die Gefahr viel zu groß und das würde sicher passieren, dass wenn man solche Spiele nicht wertet einfach wenn ein Team verliert man runterrennt und dem Mate einen Lose erspart. Es gibt schon Gründe warum das System jetzt schon mehr als 5 Jahre so ist wie es ist.","replies":[{"poster":"EuropeanMid","date":"2019-08-23T14:55:55.645+0000","up_votes":1,"down_votes":0,"body":"Für den Fall, dass man einem Mate den Lose erspart, könnte man den AFKler einfach bannen oder temporär vonm Rankedsystem ausschließen...","replies":[]}]},{"poster":"Megamaexx","date":"2019-08-23T06:29:47.472+0000","up_votes":1,"down_votes":0,"body":"Das war bestimmt So ein Spieler, der der festen Überzeugung war, dass seine kleine loosing streak nur durch seine schlechten Teammates zustande kam. Dass er sich da gar nicht an seinen vorherigen “schlechten mates“ rächt, kam dem wohl nicht in den Sinn.\nHoffe, du hast ihn reportet, dann hat er 2 Wochen Zeit, über das Geschehene nachzudenken ;)","replies":[]},{"poster":"Raystlin82","date":"2019-08-22T22:46:18.441+0000","up_votes":1,"down_votes":5,"body":"ich hab schon mehrere spiele 4v5 gewonnen, wo jemand im team nach ein paar toden afk gegangen ist. hab sogar spiele gewonnen, wo jemand  so wie deine soraka geintet hat.\n\nwenn die nicht gewertet werden wuerden waer's bloed. und wenn's nur bei niederlage nicht gewertet werden wuerde, waer's noch bloeder.","replies":[{"poster":"EuropeanMid","date":"2019-08-23T14:57:34.177+0000","up_votes":1,"down_votes":0,"body":"Gegen gute Spieler kann man nicht 4v5 gewinnen.","replies":[]}]}]}