{"poster":"Pumá D Ace","date":"2016-11-12T15:18:05.149+0000","title":"???---PIngs. Die neue Unart in LoL.","subforum":"Spielerverhalten & Moderation","up_votes":8,"down_votes":2,"body":"Ich habe den Eindruck, dass dieses ganze ???---gepinge extrem zugenommen hat, wenn jemand einen fehler macht. die leute haben das alle bei streamern oder highelo spielern gesehen und finden das dann auch noch cool und machen es nach.\r\nich habe so viele games wo ich von einem einzigen spieler zugespamt werde und mein ganzer screen gelb/rot oder whatever ist.\r\nmir pers&ouml;nlich fehlt da eine option, um pings ganz gezielt von einem spieler zu deaktivieren.\r\ndenn ganz darauf verzichten m&ouml;chte man logischerweise nicht und auch den sound zu muten hilft ja trotzdem nicht viel. man sieht es ja trotzdem.","replies":[{"poster":"OT Riku","date":"2016-11-12T16:39:01.233+0000","up_votes":2,"down_votes":0,"body":"Aber als Unart es gab schon immer Leute die wie wild gespammt haben wenn jemand stirbt.","replies":[]},{"poster":"skhar","date":"2016-11-30T13:10:00.125+0000","up_votes":1,"down_votes":0,"body":"Ach du meine Nase, ich pinge auch gerne mal ein Fragezeichen auf eine andere Lane.\nAlso dass es ein Fragezeichen ist, ist mir dabei relativ wumpe, es könnte auch gern ein Osterhase oder die Mona Lisa sein. Wenn ich beobachte, dass ein gegnerischer Spieler seine Lane verlässt und sein entsprechender Gegenspieler aus meinem Team dies nicht zeitnah kommuniziert, dann greife ich ihm unter die Arme und nehme ihm diesen Ping ab, damit die verbleibenden 3 Spieler im Team es auch mitbekommen und sich vor einem möglichen Gank in Acht nehmen können.\n\nLaufe ich damit jetzt Gefahr, dass ich passiv aggressiv verstanden werde? Interpretiert mein Teamkollege meine Hilfe jetzt so, dass ich ihn dafür anmeckere, dass er es nicht sofort gepingt hat?\n\nIch setze den Ping immer über die Minimap, also nur grob irgendwo auf die Lane. Kann auch gut sein, dass ich dabei mal mitten auf meinen Teamkollegen pinge. Fühlt er sich dann dadurch angesprochen?\nOder wenn mein ADC gerade 3 Lasthits verhauen hat und mir in dem Moment auffällt, dass ich seit 3 Sekunden keinen Gegner auf unserer Lane gesehen habe und ich dies mit einem Fragezeichen anzeige, dabei dank der Mausposition recht nah an meinem ADC bin, denkt er dann, dass ich ihn für seine verpassten Lasthits flame?\n\nPinggespamme ist nervig, keine Frage. Und tatsächlich passiv aggressiv gemeinte Einzelpings auch. Aber kann es nicht auch sein, dass man selber schon so durchkonditioniert ist, dass man auch eigentlich nur hilfreich und normal gemeinte Pings aufgrund der Umstände als negativ empfindet und überempfindlich ist?","replies":[]},{"poster":"dome025","date":"2016-11-12T19:20:24.819+0000","up_votes":1,"down_votes":0,"body":"War schon immer so häufig nicht nur in letzter Zeit. Es kommt halt stark auf die Leute mit denen du gematcht wirst an. Da dies größtenteils (mmr ist nicht zufällig, aber ich denke du verstehst was ich meine) random ist, kann es sein dass dunur solche Leute bekommst oder nur ab und zu.","replies":[]},{"poster":"MoreCookies4me","date":"2016-11-12T16:39:40.293+0000","up_votes":1,"down_votes":0,"body":"Yay ich bin nicht alleine mir geht dieses gespamme der ping funktion auch übelst auf den Keks ^^","replies":[]},{"poster":"Dermel","date":"2016-11-16T17:31:17.622+0000","up_votes":1,"down_votes":1,"body":"Den Ping könnten sie bei mir  gerne öfter benutzen, aber bitte sinnvoll... Also ich kenne das Problem nicht.","replies":[]},{"poster":"FrankerŹ","date":"2016-11-14T14:04:58.640+0000","up_votes":1,"down_votes":1,"body":"was heißt bitte \"neue\"?\ndiese \"neue\" unart gibts seit es die pings gibt.\n\nantworte einfach \"there are no enemys missing here pls watch map\" pisst die kids immer total an :DDD","replies":[]},{"poster":"Waldschrat86","date":"2016-11-12T20:17:29.782+0000","up_votes":2,"down_votes":2,"body":"Ich spam zwar nie Pings, aber das ? benutz ich auch manchmal, besonders, wenn einer grad meinte, lass groupen und dersselbe Spieler dann solo irgendwo hinläuft und gecatched wird. Äh ja \"???\" :D","replies":[]},{"poster":"1951298","date":"2016-11-15T01:22:54.533+0000","up_votes":1,"down_votes":4,"body":"??? \nis doch verdammt geil alter\n???","replies":[]}]}