{"poster":"Vicarious117","date":"2016-04-21T18:00:02.636+0000","title":"Rengar + Fenrir = Rework ideas","subforum":"Gameplay","up_votes":1,"down_votes":1,"body":"So I&#039;ve been playing a lot of Smite recently, and whether you like or dislike that game has no bearing on my ideas in the slightest, I just wanted to make it clear I got these ideas from the &quot;champ&quot; Fenrir from that game because he already has a somewhat similar playstyle, before someone posts about how they hate that game and I&#039;m just stealing ideas and yada yada yada, none of that matters.\r\n\r\nAlso keep in mind this all came to mind cause the next batch of champion reworks will very likely include Rengar, so any ideas I have are not meant to be small fixes and are intended as full rework ideas.\r\n\r\nAnyway...\r\n\r\nRecently based on the new subclass descriptions and words from Rio themselves it seems I was always right in that he is designed to be a diver and not an assassin, but due to his current kit and his ferocity resource system he is currently most effective as an assassin, even though he lacks much of what an assassin should have, which in turn is what makes him so difficult to balance, leading to this feast or famine state he&#039;s in right now.\r\n\r\nThen while playing Smite I was on Fenrir and this fact had always been something I&#039;d known, but not until this moment did I think it could potentially have use in a discussion topic.... Fenrir has a resource system extremely similar to that of Rengar&#039;s in that he gets 5 stacks of his resources and it amplifies his next ability! The difference being he gets these stacks from auto attacking instead of ability use AND he can&#039;t double cast.\r\n\r\nOne of the biggest problems with balancing Rengar has been that he can double cast, that is just simply a fact.\r\n\r\nSo what if this idea was incorporated into Rengar&#039;s kit? Instead of his abilities giving him ferocity stacks his auto attacks did!?\r\n\r\nThat alone of course won&#039;t do, but if his abilities were altered so they were more reminiscent of Fenrir&#039;s, the guy who already has a working resource system like the one I&#039;m proposing, then it might just work! Might, being the keyword.....\r\n\r\nSo ofc he&#039;d still keep his leaping from a brush passive, that is an absolute MUST, but his other abilities would no longer have separate cooldowns between the fully stacked versions and the normal ones, so they could essentially be buffed to the point they wouldn&#039;t have to be abnormally weak to make up for double casting.\r\n\r\nHis Q would no longer grant AS, for starters, that will be added to a different ability.  The main difference though will be that upon activating his Q, his next basic attack will grant him his passive leap even without a brush to leap from (you&#039;ll see why this will be moved here later on).  The AD granted on landing it should also be a flat amount, not a percentage increase, mainly cause in this proposed iteration you really won&#039;t be building much AD.  And if he were to use his Q with a full 5 stacks of ferocity it will do AoE damage (smaller percent for nearby targets ofc) and will cripple targets he hits, like a slow amount that&#039;s higher for his main target and lower for nearby enemies hit.\r\n\r\nHis W then instead of giving him defenses would instead decrease the attack speed of enemies hit and increase his own.  This is intended to make his dueling better, like a fighter, as well as provide synergy with his new ferocity system.  If used with a full 5 stacks of fero then he&#039;d still ofc heal himself, but the heal will increase based on the number of enemies hit, giving him incentive to be in the thick of a fight, as a diver should.  I was also thinking maybe some kind of passive to help out his dueling here should be added, but I can&#039;t think of one that isn&#039;t severally over done or just too much.\r\n\r\nHis E is what I want to change the most, well about as much as his R I guess, but I&#039;d like to put his stealth here instead. It would be more like Twitch&#039;s stealth, where it has a delay, which is a ridiculously long delay if taking damage, and you can move faster while stealthed, minus the attack speed increase upon stealth ending since I think it would be better suited on his W. If used with a full 5 stacks then the stealth can be instantaneous, the idea behind that is instead of using his stacks on engaging with Q or brawling with W, he&#039;d use it to back out of a fight, or even reposition.\r\n\r\nHis R would now also be entirely different. The idea behind this change is that I&#039;ve given a lot of the strengths it granted him to other abilities, which can no longer be double cast so making them more powerful should be alright, to an extent ofc (which I could very well have passed, again, just theory crafting!). Also keep in mind I am trying to make him more of a dive champion then an assassin here, he still has some of that available to him but he definitely will not be one shotting anyone, well hopefully he wouldn&#039;t, so I want to give him some kind of pick tool like most other divers have, and what out of his previous kit have I not mentioned yet? HIS BOLA! Like Fenrir this should be someway to separate someone from their teams, so I propose it being a targeted ability that grabs someone in a net, suppressing them, but Rengar moves at a much slowler rate while holding his prey in his net so he can&#039;t just boost out of there like a Skarner, but to make up for it his defenses will be increased based on how many opponents are around his target when he grabs them. What he does instead is that if he reactivates the ability he can then throw his target a certain distance away, would be a skill shot that can be extended to full length or even just thrown right on the ground in front of you, in any case dealing damage upon landing on the ground.  Unlike Fenrir though I don&#039;t think this ability should be effected by his fero stacks.\r\n\r\nSo his gameplay, in theory, would then be him stealthing into an enemy team, grabbing a target and throwing them at his team, then jumping back onto them with some CC and killing them with his team. That or throwing a threat away from a fight (like Poppy does) and using his W to sustain and get more fero stacks while fighting heavier targets.\r\n\r\nFirst off yes, I am not a professional champion designer therefore I could very well have missed something that makes him OP or even UP, so as I have done here if anyone else has any theory crafting they&#039;d like to do UTILIZING THE NEW FEROCITY STACKING SYSTEM then I&#039;m all ears. I mean it is very unlikely any of this will even reach the ears of anyone who can actually do anything so it&#039;s w/e, craft away! lol\r\n\r\nSecondly, yes I know this will almost destroy his current suicide bomber playstyle, and I&#039;m sorry for anyone who actually likes that feast or famine playstyle but the fact of the matter is that was never his indented playstyle and Riot will most likely be trying to move him in a more diver type direction anyway. So yes the change was intended, and if you seriously want to keep his current unhealthy playstyle intact then this is not a thread for you because it&#039;s main purpose is to successfully change it, something his last reworked was supposed to do but did not because of his double casting, and will most likely be attempted again in some capacity.\r\n\r\nFinally, if you actually read all of that then amazing job and thank you for putting up with me lol","replies":[{"poster":"Venowolf","date":"2016-04-22T00:27:49.378+0000","up_votes":2,"down_votes":1,"body":"Feast or famine still there...","replies":[{"poster":"Vicarious117","date":"2016-04-22T04:22:30.467+0000","up_votes":1,"down_votes":0,"body":"Well I'd imagine to some degree, that's kind of how it works on any melee champ that doesn't have some sort of true damage or auto attack modifier built into their kits, like Jax.\n\nAnd it wouldn't be anywhere near as bad as it is currently, cause right now you jump on someone and they either implode instantly and you did your job or they don't die instantly and you probably will instead.  It's about as feast or famine as any champ can get in this game.\n\nBut if you'd care to actually elaborate then I'm all ears...","replies":[{"poster":"Venowolf","date":"2016-04-22T12:55:28.926+0000","up_votes":1,"down_votes":0,"body":"I want Rengar something to the Predator, you know the same of Arnie mobie in 1987 (get to the \"chopaaa\"), I want to feel something near to that kind of predator, something dangerous, the stealth is a must in his kit. But that part of jump on someone and explote it is no healthy to the game, I mean they need some window to respond at this kind of events, but also don't let Rengar in a dangerous position too. So you need to think in deephly to turn or put him in a good  spot.","replies":[{"poster":"Vicarious117","date":"2016-04-22T20:29:59.908+0000","up_votes":1,"down_votes":0,"body":"I entirely agree, but I don't see where you got this out of my proposed rework ideas......\n\nI kept the stealth in and pretty sure I removed the \"jump on someone and they explode\" type playstyle, while also giving him ways of engaging to catch someone out (as a Predator potentially would), as well as surviving in a larger skirmish and even in duels.  Hell, I even gave him a way to restealth mid fight to reposition, just like the Predators were want to do!\n\nSo I apologize, but I still don't understand your grievances..... I don't mean this in an insulting way, but I'm seriously curious as to whether you read my whole post or gave up due to it's length?\n\nOr ofc if you're seeing something I missed then I'd really appreciate you pointing it out so I could attempt to address it...... it just really seems like you're saying you don't like what I specifically said multiple times I was also trying to correct :/","replies":[]}]}]}]},{"poster":"Nekusen","date":"2016-04-22T00:45:38.115+0000","up_votes":1,"down_votes":1,"body":"Tl;Dr, pls","replies":[{"poster":"Vicarious117","date":"2016-04-22T04:19:09.383+0000","up_votes":1,"down_votes":0,"body":"Well can't really type up a full rework idea if it's not going to be long, sorry.\n\nBasically he'd be more of a skirmishing bruiser then a suicide bombing assassin.","replies":[]}]}]}