{"poster":"GANDIX28","date":"2018-06-14T22:41:33.740+0000","title":"Ma quant'è facile salire","subforum":"Campioni e gameplay","up_votes":4,"down_votes":5,"body":"Io penso che la Riot dovrebbe rendere pi&ugrave; difficile salire su LOL , non &egrave; possibile che con 10 game sono gi&agrave; plat!! Fixate &egrave; troppo facile, non voglio arrivare Diamond senza saper giocare!! Spero che qualcuno faccia qualcosa al pi&ugrave; presto, non voglio che sto gioco che amo diventi cos&igrave; semplice!!!","replies":[{"poster":"Gìove","date":"2018-06-15T10:01:38.480+0000","up_votes":3,"down_votes":0,"body":"_Sniff Sniff_ sento odore di un ignite che è stato lanciato {{summoner:14}}","replies":[{"poster":"GANDIX28","date":"2018-06-15T18:08:43.395+0000","up_votes":2,"down_votes":2,"body":"Mi fa arrabbiare pensare che c'è gente agli LCS che è forte quanto me, io però non riesco a guadagnarci un soldo con sto gioco!!","replies":[]}]},{"poster":"UltraLion","date":"2018-06-15T08:22:59.407+0000","up_votes":2,"down_votes":0,"body":"Per me invece è difficile, se per voi è facile facciamo DUO e vediamo chi ha la meglio, io con il lato oscuro della forza o voi sotto la guida di yoda","replies":[{"poster":"GANDIX28","date":"2018-06-15T18:09:38.549+0000","up_votes":1,"down_votes":1,"body":"No grazie, preferisco fare squadra solo con pro o comunque gente poco sotto a me di livello(Plat alti e diamond bassi).","replies":[{"poster":"UltraLion","date":"2018-06-15T18:28:18.637+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=GANDIX28,realm=EUW,application-id=cAOZwaUi,discussion-id=ijL2n7EJ,comment-id=00030000,timestamp=2018-06-15T18:09:38.549+0000)\n>\n> No grazie, preferisco fare squadra solo con pro o comunque gente poco sotto a me di livello(Plat alti e diamond bassi).\n\nChe c'entra la statura di una persona?","replies":[]}]}]},{"poster":"AnnieFr4nk","date":"2018-06-14T22:45:36.057+0000","up_votes":2,"down_votes":1,"body":"Ah ma allora non sono l'unico che è salito cosi velocemente, ricordo il mio vecchio account con cui feci il diamond ci misi all'incirca 300 win quindi un totale di 550 game circa mentre ora con 60 game sono D5 e credetemi che le mie skill sono le stesse. Anche il livello stesso dei giocatori che stanno in diamond basso è nettamente più basso rispetto a prima  quindi propongo anche io di rendere più difficile scalare.","replies":[{"poster":"GANDIX28","date":"2018-06-15T18:12:50.950+0000","up_votes":2,"down_votes":0,"body":"Finalmente qualcuno che mi capisce, se vuoi dopo facciamo ranked, proviamo a raggiungere sto fantomatico(FACILE) Master!","replies":[]}]},{"poster":"TheConte","date":"2018-06-15T06:36:09.808+0000","up_votes":2,"down_votes":0,"body":"Non ti preoccupare aspetta un po e vedi che il gioco diventerà molto più difficile andando avanti col tempo...\nse sei un nuovo giocatore è anche giustificato (dato che ovviamente se tu ci sai già fare un pochino gli altri nuovi giocatori li trovi dei sempliciotti)\nIntanto se vuoi vai a vedere su youtube qualche video di un pro e magari impara qualcosa.\n\n\nps. comunque vogliono già aggiungere 2 nuove leghe: prima del silver e dopo il gold( mi sembra)","replies":[{"poster":"GANDIX28","date":"2018-06-15T18:11:11.598+0000","up_votes":2,"down_votes":0,"body":"Ma vaaa, ma se sono i pro a dover imparare da me, ogni volta che incontro un diamond in lane lo distruggo. Forse sarò troppo talentuoso io... Bhoo","replies":[]}]},{"poster":"Linkimaru","date":"2018-06-15T07:00:18.789+0000","up_votes":2,"down_votes":0,"body":"Il livello si abbassa di anno in anno ma la prossima season metteranno due nuove leghe per compensare un po’. Certo che i bronzo di adesso probabilmente schiacciano tasti a caso mentre mangiano pane e nutella per rimanere dove sono XD i bronzi di qualche season fa adesso varrebbero come gold in confronto ","replies":[{"poster":"GANDIX28","date":"2018-06-15T18:10:27.681+0000","up_votes":1,"down_votes":0,"body":"Lo ho notato, arrivare plat non è mai stato così facile, sto andando per il diamond giocando solamente akali, faccio tutti i game score senza senso!!","replies":[]}]},{"poster":"The Fluffy Lamb","date":"2018-06-16T10:18:20.656+0000","up_votes":1,"down_votes":1,"body":"Vorrei solo capire se le camionate di arroganza di questo thread sono sarcastice o reali. Puoi illuminarmi?","replies":[]},{"poster":"Mystogan92","date":"2018-06-15T18:48:32.439+0000","up_votes":1,"down_votes":3,"body":"un altro main support","replies":[]}]}