{"poster":"FMG GorillA","date":"2019-07-12T11:42:17.133+0000","title":"ehemaliger Esl Coach/Analyst Sucht Spieler/Teams/Clans","subforum":"Esports","up_votes":3,"down_votes":0,"body":"Hallo zusammen,\r\n\r\nIch suche Spieler/Teams/Clans denen ich mit meinen Erfahrungen als Coach und Analyst helfen kann besser zu werden egal ob ein Team oder für einen ganzen Clan.\r\n\r\nZu mir:\r\n-21 jahre alt\r\n-Azubi\r\n-Spiele wenn ich Zeit finde nur zum Spaß mit Freunden\r\n-Coach seit knapp 4 Jahren\r\n-Coach und Analyst in der Esl für 1 Jahr\r\n-Ich werde euch helfen Individuell sowie im Team zu funktionieren und eure Stärken zu fördern und schwächen auszumerzen\r\n-Außerdem werde ich euch zeigen welche Fehler ihr gemacht habt und wie der korrekte Spielzug aussehen würde \r\n-Teams von Silber - Master 300 Lp trainiert\r\n\r\nZu euch:\r\n1.Ihr seid bereit genug Zeit zu investieren \r\n2.Kritikfähig sein ist ein muss ohne geht es nicht\r\n3.Im Idealfall seid ihr ein fast komplettes Team oder ein Clan der gerade dabei ist ein paar Teams aufzubauen\r\n4.Die Elo ist uninteressant, solange ihr Kritikfähig seid und genug Zeit habt\r\n5.Funktionierendes Mikro/Headset und Teamspeak/Discord ist Pflicht \r\n6.Geistige Reife sollte aufjedenfall vorhanden sein \r\n\r\nVielen Dank im voraus und für eure Zeit, falls ihr Interesse habt schreibt mir doch einfach Ingame --> FMG GorillA","replies":[{"poster":"404 Multigaming","date":"2019-07-20T12:02:28.108+0000","up_votes":2,"down_votes":0,"body":"Falls noch nicht zu spät würden wir auch gern unseren Hut in den Ring werfen!\n\nBitte dazu die FA von 404 Fenríz in League annehmen","replies":[]},{"poster":"Mad Fufu","date":"2019-07-23T13:24:44.580+0000","up_votes":1,"down_votes":0,"body":"Moin, \nUnser Team Iron League Specialists sucht auch noch nen Coach. \nWir sind vollzählig, haben feste Trainingszeiten und sind auch schon vorbereitet auf einen Coach.\nhabe dich mal geaddet.\n\nLG","replies":[]},{"poster":"JumeB","date":"2019-07-13T10:25:30.653+0000","up_votes":1,"down_votes":0,"body":"Das hört sich alles super an wir bauen gerade 2 Master Teams auf und könnten ein Coach noch ganz gut gebrauchen. Für dich als Info es ist englisch also müsstest du schon recht gut englisch sprechen können. Für mehr Infos habe dich geaddet und adde du mich doch bitte auf dc JumeB#1335","replies":[]}]}