{"poster":"Echo iFyroze","date":"2014-10-27T19:11:00.836+0000","title":"Hogy lehet feljebb jutni??","subforum":"Általános beszélgetés","up_votes":1,"down_votes":0,"body":"Sziasztok! Egy nagyon fontos kérdés hogy lehetne bronzól feljebb jutni ?  mert valami borzasztó itt a helyzet ha még jól is játszom elfeedelnek egy két champet pl MasterYi vagy adc-t és vége a játéknak...  és egyre csak lejebb megyek","replies":[{"poster":"GODLIKE Kha Zix","date":"2014-10-27T22:50:10.692+0000","up_votes":3,"down_votes":0,"body":"Szerintem:\n1. Válassz main lane-t.\n2. Azon a lane-en tanulj meg min 5 karaktert nagyon jól játszani és 1-et profin\n3. Válassz másodlagos szerepet és azon is legyen 3 karakter aminvel nagyon jó vagy\n4. Tanulj meg 2 de minimum 1 karakterrel nagyon jól játszani a másik 3 poszt-on, mert néha oda is kerülni fogsz.\n5. Main karakteredre akár több rune page-t is gyárts le, külön AP és AD enemy ellen illetve egyébb finom hangolások. Ajánlok minimum 8 runepaget összesen, szükség lehet rá.\n6. Gondosan csináld meg a masteryket. Szintén lehet 1 karakterre akár 3 is. (AP carry - utilyty (21/0/9), AP carry - deffensive (21/9/0), Full tank with ability (9/21/0) [Mivel mondjuk egy Cho'gath-ot is 1000 képp játszhatsz]\n\n1. Picknél kérd a lane-t és írj alternatívát, mit játszanál szívesen, illetve mi az ami a gyengéd. Értelmes csapat nem fog oda kényszeríteni téged ami nem megy.\n2. A játékra koncentrálj, ne hallgass zenét, szükség van a global soundokra és pingek kellő mértékű meghallására, mert azok is információval bírnak.\n3. Figyelj a csapattársaidra és próbáld mozgásukból megítélni, hogy képesek/tudnak-e neked olyan segítséget adni amire éppen számítasz, és ha igen, akkor meg fogja-e tenni. (Számíthatsz a TF ultira, de lehet nem fog jönni és segíteni. Viszont találkoztam olyan TFel is aki tudta hogy megy a harc és azért hogy a Vayne ulti hatástalan legyen elnyomta a sajátját) Ezt általában a játék első 10 percében meg lehet itélni, ki menyire segitőkész illetve milyen játékstílust preferál.\n4. Ha a te általad eltervezett taktika (BAron, push, fight) nem akarja követni a csapat, akkor ne állj ellen. Jobb egy 5v5 TF ben kikapni mint 4v5-ben és bűnbaknak lenni. Gold felett egyre összetettebb taktikák jöhetnek, fontos a jó ítélő képesség, hogy tudd, mi az amit most NEKED tenned kell.\n5. Ha valaki piszkál, sérteget, némítsd le! Ne pazarolj időt és figyelmet!\n6. A pingek fontosak, jelezz mindent, akár 2 szer is, illetve ha 20 másodperc elteltével is SS ismételd meg a jelzést.\n7. A pingek fontosak, de te profi akarsz lenni, így nem szabad függened ezen a téren a csapatodtól, néz a mini mapre MINIMUM 3 másodpercenként, minden rendben van-e. Ne várd el senkitől hogy SS-t jelezzen, ha megteszi az csak megerősitésnek szolgál, magadnak kell tudnod ki hol van!\n8. Számolj az ellenséges junglerrel, figyeld épp hol volt, merre ment el, menyi élete volt, és tudd mikor várható hogy hozzád ér. Ennek függvényében wardolj. (Ha bot-on volt és te top-on vagy, nem kell letenned a trinketet egyből, hasznosabb ha vársz 20-30 másodpercet.\n9. Egy játék alatt minimum 1 Vision wardot és 2 sima őrszemet vegyél.\n10. Trinketet cseréld mindig a leghasznosabbra!\n11. Soha ne sértegess senkit, ne könyörögj segítségért. Csak kérd. A junglernek is megvan a maga dolga, és nem minden szituációban hasznos egy gank, lehet többet ér más lane-t nyomás alatt tartani vagy feralozni. Ez az ő döntése, neked a saját dolgod a fontos.\n12. Írd mikor jár le az enemy summoner spelljén a CD.\n13*. Csak biztos killért kockáztass, ha nem tudod hol az enemy jungler akkor pedig CSAK akkor támadj ha tudod hogy 100% meg fogod ölni, ellenkező esetben a gank miatt ő fog jól kijönni.\n\nA. Játék után gondold végig mit csináltál jól.\nB. Mit csináltál rosszul.\nC. A pick az adott helyzetben jó volt-e, vagy nagyon sokat jelentett volna egy másik típusú karakter.\nD. Tarts szünetet, és ne játssz napi 1-2 rankednél többet. (Mivel ez tétmérkőzés, figyelmet és összpontosítod is lankad)\nE. Köszönd meg a játékot a csapatársaidnak, dicsérd meg őket ha valamit jól csináltak, és jelezd (ovatosan, ne sértően) ha valamit elrontottak, segíts másoknak fejlődni és legyél te is nyitott a kritikára, főleg ha azt nem azért mondják hogy csak piszkáljanak <lehet igazuk van>.\nF. Határozd meg a játék után, melyik volt az a pont a játékban amikor annak kimenetele eldőlt. És tanulj az esetből, hogy azt következőre elkerült, újra összebírd hozni. Ez gyakran egy Dragon/baron, egy jó fight, vagy összjáték. Lehet nem tudod minig így csinálni, de ha már tudod hogy meglehet, számolni fogsz vele.","replies":[]},{"poster":"Snago","date":"2014-10-27T21:09:43.498+0000","up_votes":2,"down_votes":0,"body":"Szia BazsikaHun!\n\n     Egyetlen tanácsom van számodra, ami szerintem az alapja ennek a játéknak. \nSzerezz minél több barátot, mert egyedül nem győzhetsz! Alakíts csapatot akikkel (akár) személyesen is tudsz találkozni, hogy még jobban összeszokjatok. Fontos a jó kommunikáció, türelem, sok gyakorlás, megértés. A játék ne legyen függőség számodra, inkább egy jó kikapcsolódás, élményszerzés. \nÉn már több mint négy éve játszom és még mindig bronzban vagyok. Szeretek egyedül játszani, ez meg is látszik a statisztikámon, tudom mik a hibáim és mi lenne a megoldás, de nekem jó ez így.(ezzel magyarázom, hogy béna vagyok xD)\nKívánok neked sok jó barátot és eseményekben gazdag csatákat.\n\nTalálkozunk a csatamezőn\n\nÜdv: Snago","replies":[]},{"poster":"skippersd","date":"2014-10-28T17:32:37.384+0000","up_votes":1,"down_votes":0,"body":"Deylitha meglátása szerintem is helyes, néhány további dolog:\n\nIsmerd magad. Tudd hogy milyen játékstílusod van, és mi az amit tudsz. Például én nemes egyszerűséggel rossz vagyok tankkal, és eléggé biztonságosan játszok. így én mid vagy late game karakterekkel játszom, miden vagy ADC-ként. \n\nFogadd el, hogy a meccsek egy része menthetetlen. Én gyémánt szinten vagyok, de amikor bronze 2/3 környéki smurf accountal játszottam, akkor is 'csak' a meccsek 75%-át nyertem meg. Persze ebben benne volt az hogy nincs sok rúnája az accountnak, illetve az hogy direkt olyan karaktert hoztam akivel nem tudok gyémánt szinten játszani, de ha halál komolyan vettem volna, akkor is csak 85-90%-ot nyerek meg.\n\nVálassz olyan karaktereket, akik sebeznek, DE tudnak mást is. Pl. Master Yi baromira nem ilyen, nagyot üt, de csak ennyit tud. Egy Nocturne ellenben majdnem Yi szinten tud sebezni, de van CC-je, és tud gankelni. AAtrox egy másik jó példa. Supportnak Karma vagy Leona (karmának abszurd sebzése van. míg Leona tök egyedül el tud kezdeni egy harcot. Midre Orianna a klasszikus pick, de Lux / Xerath / Ahri  is remekül működhet. Topra Ryze, Rumble vagy Jax, és adc nek amit akarsz (az az egyetlen poszt aminek csak az a dolga hogy sebezzen)\n\nRánéztem a LolKingre, hogy miket játszottál mostanában. Rendre:\n\nKha jungle, és Ahri mid:\nKha jungle itemjei kb rendben voltak. Az épłtési sorrend is. \nAhri: (megjegyzem Ahri a main midesem, szóval itt sokat mondok, de cserébe nem sok jót.)\n\nKezdő item jó, első vásárlás {{item:3108}}  tökéletes. Ha megengedheted magadnak egy {{item:1058}} is jó választás.\nInnentől kaptam agybajt. Első item Ahrira vagy {{item:3128}} (ha jól állsz) vagy {{item:3174}}  ha nem kapsz kéket / rosszul állsz. Nem fogom levezetni a matekot, de a {{item:3128}} a legerősebb item amit vehetsz. Második item a megic pen cipő. Harmadik item Zhonya (Tűz ha az első itemed Athene volt), vagy ha nagyon bátor vagy Rabadon. Ha van az ellennek MR-je (értsd, olyannak akit ki akarsz szedni van egy {{item:1057}} -ból épülő tárgya) akkor Void staff, egyébként Rabadon/zhonya, utána Void. \n\nA többiek: Nasus top, jungle itemmel, {{item:3025}} első itemmel,{{summoner:12}} {{summoner:14}} -al. Na igen, mit kellett volna. {{summoner:14}}  helyett {{summoner:4}} vagy {{summoner:6}} . Főleg NASUS esetén, akinek semmilyen csúszása nincs. A skill order megér egy misét (miért nem W-t maxoltad másodiknak mikor egy YI ellen vagy?) Az item build meg őszintén szólva borzalmas. A {{item:3024}} még rendben van, de utána? Második item lehetett volna egy {{item:3067}} , utána {{item:3075}} , majd {{item:3083}}  és {{item:3110}} . \n\nA thresh supportok: Első szinten E nem Q (kivéve ha invadeltek, de csak akkor!), minek veszel mobi cipőt ha nem használod ki, nincs {{summoner:4}} .\n\nCsak egy gyors számolás: A historyt elnézve 15 meccset buktál ahol nem volt {{summoner:4}} -ed, és 6-ot nyertél. Valami összefüggés lehet.\n\nHirtelen ennyi\n\nPS: Yi-nek te adtál first blood-ot, majd 10. percre meghaltál mégegyszer. Ne akard a csapatra kenni.","replies":[{"poster":"Echo iFyroze","date":"2014-10-28T18:05:29.326+0000","up_votes":1,"down_votes":0,"body":"Szia :D Kösiza  tippeket am hogy láttad a mecset?:O  É is vissza tudom valahogy nézni?:D Am Nasusal nem valami sokat játszottam :D am köszia  buildet :P meg fogadom :) Am treshnél mobi cipőt azért asználom ,hogyha üldözünk valakit utolérjem és le tudjam hookolni am miért kell E vel kezdeni?:O KhaZix az még betanulós fázisba van :D . Am Ahirnál miért kell a {{item:3128}} -el kezdeni?:O adj tanácsot hozzá :P","replies":[{"poster":"skippersd","date":"2014-10-29T10:52:17.702+0000","up_votes":1,"down_votes":0,"body":"Szervusz!\n\nA meccset nem láttam, de az új match historyból elég sok mindent ki lehet lesni \n(http://matchhistory.eune.leagueoflegends.com/en/#match-history/EUN1/210629954)\n\nNasus-nak az egy nagyon szitiációfüggő build, + külön rúna is érdemes hozzá. Ha nem szoktál vele játszani, ne erőltesd. Alapvetően CDR-t kell venni neki minél gyorsabban.\n\nThresh: Azért kezdesz E-vel mert az AA erősítő passzív azon van, így meg tudod csinálni hogy odasétálsz, ütsz egyet majd elsétálsz. Továbbá ha ti lesztek először lvl2-esek, akkor gyorsan tudsz Q-t fejleszteni, ellenben ha az ellen lesz meg előbb 2-es, akkor nem akarsz velük verekedni, és E-vel könnyebb védekezni. Mobi cipő igazából arra jó ha megnyerted botot, akkor elszaladsz bewardolni az ellen jungle-t, vagy midre gankelsz egyet. Nem feltétlen rossz dolog ha üldözni akarsz, de ha csak arra kell, akkor {{item:3009}}  + zöld cipőfejlesztés.\n\nAhrival azért kezdesz DFG-vel mert ugye a DFG 20%-al növeli a bejövő magic sebzést (meg 15% max hp sebzés). Ez azt jelenti hogy az AP-ból lévő és az alap sebzés is 20%-al nő. A rabadon 30%-al növeli az AP-d, azaz \"30%-al nő az AP-ból lévő sebzés\". Ez az alapvető gondolat, ha akarod kimatekozhatod, (én annő megcsináltam és tényleg mindig a DFG az erősebb).\n\nTermészetesen ez csak arra a négy másodpercre igaz, amikor a DFG debuffja aktív, de az alatt illik kikapni az ellent.","replies":[]}]}]},{"poster":"Kadegrow","date":"2014-10-28T22:01:09.875+0000","up_votes":1,"down_votes":0,"body":"Röviden és tömören. Várd meg a Season váltást és majd utána kezdj el rankedezni.\nAddig semmi esélyed nincs.","replies":[]},{"poster":"Echo iFyroze","date":"2014-10-28T09:52:56.751+0000","up_votes":1,"down_votes":0,"body":"Sziasztok! Köszönöm a sok jó tanácsot megfogadom :P","replies":[]},{"poster":"ScreamForMeBaby","date":"2014-10-28T08:16:34.751+0000","up_votes":1,"down_votes":0,"body":"Sosem voltam Bronze-ban, de a haladáshoz 2 dolog szükséges. A saját és a csapatod sikere. A saját sikeredhez ugye az ösvényed megnyerése szükséges, a csapat sikeréhez pedig sokszor a te áldozatod. Sokan próbálnak úgy carry-zni egy meccset, hogy pickelnek valami vandál dmg-vel rendelkező hőst és darálnak ahogy tudnak. Szvsz ez elég könnyű, elfeedelve a legtöbb ember tudja használni a hősét. Viszont kevesebb ember tud helyesen wardolni, roamolni, kommunikálni. Márpedig ezek az elemek 90%-ban szükségesek ahhoz, hogy sok killt szerezz.\n\nÉn S5ből S2-be Rammussal mentem fel kevesebb, mint egy hónap alatt. Több okból választottam ezt a hőst. \n1. Mindenki a dmg-re megy, mivel az a \"menő\". De tank nélkül mehettek a levesbe. Így ha te felvállalod ezt, máris előrébb vagytok. \n2. Wardolás. Ha valamelyik társad jól teljesít az ösvényén, tuti pushol és akkor gankelik. Wardold körbe. Ha gyengélkedik valaki az ösvényén és rátapad az ellenfél jungle, akkor is érdemes wardolni. Ha csak minden 4. ward megmenti a társad egy ganktől, már jól jöttetek ki anyagilag. Ráadásul sok könnyű killt lehet szerezni 1-1 jól elhelyezett warddal.\n3. Add oda a killeket. Ha te ügyesebben pozicionálsz, mint ők, jobb játékos vagy, akkor jobb ha náluk van a több lóvé. Ez kompenzálja majd kicsit a bénaságukat.\n4. Kommunikálj. Ha valaki killt szerez, írogasd, hogy szép munka. Ha valakit szidnak, védd meg finoman. Használd a pingeket.\n5. Nézd folyamatosan azt a fránya minimapot. Szép dolog a wardolás, de semmit se ér ha nem veszed észre mikor átsétálnak rajta. (Na meg sokszor a társunk is teljesen vakon éli a maga kis világát, és sokszor a te odafigyelésed mentheti meg. Ha olyan veszélyt látsz amit ő nem, tessék pingelni.)\n\nHa ezeket betartod, sokkal nagyobb eséllyel fogtok jó csapatként dolgozni és akár úgy is nyerni, hogy az ellenfél egyénenként jobban játszana nálatok. Nem csak úgy lehet lecarryzni egy meccset, hogy beszedsz egy rakat killt. :)","replies":[]},{"poster":"Vasipari Béla","date":"2014-10-28T05:25:50.490+0000","up_votes":1,"down_votes":0,"body":"Vigyél jungle Yi-t teleport/sújtással. Csak farmolj és teleporttal countergankelj. Build:\n{{item:1039}} {{item:3106}} {{item:3144}} {{item:3006}}{{item:3154}} {{item:3153}} {{item:3142}} {{item:3031}} \nUtolsó tárgynak lehet ezek közül egy:{{item:3078}} {{item:3139}} {{item:3035}} {{item:3026}} {{item:3156}} {{item:3102}}","replies":[]}]}