{"poster":"KingOfSupp","date":"2020-02-04T02:50:44.305+0000","title":"Riot Fair?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":34,"body":"Ich habe in einem spiel absichtlich gefeedet weil mir einer denn champ weg gepickt hat und mich dumm angemacht hat deswegen hab ich jetzt einen 14 tage bann wegen einem spiel also kommt schon is riot echt so assozial geworden und ja nur wegen dem einen spiel das steht sogar da wenn ich mich einloge ","replies":[{"poster":"00 M4ddin 00","date":"2020-02-04T06:29:46.694+0000","up_votes":13,"down_votes":1,"body":"Fair wäre ein perma aber man kann nicht alles haben :/","replies":[{"poster":"ΔRC RΔFUNZΞL","date":"2020-02-04T13:46:24.839+0000","up_votes":4,"down_votes":1,"body":"leider. Nichtmal einsicht zeigen.","replies":[]}]},{"poster":"Zavolta","date":"2020-02-04T04:34:13.377+0000","up_votes":12,"down_votes":1,"body":"Asozial ist hier nur einer - und zwar du.","replies":[]},{"poster":"Darkr3sQ","date":"2020-02-04T04:28:57.333+0000","up_votes":10,"down_votes":1,"body":"Um es mal kurz zusammen zu fassen: Du verstößt gegen die von Dir akzeptierten Regeln, und beschwerst Dich jetzt allen ernstes darüber, dass das Konsequenzen hat?\nRIOT ist fair und konsequent. Nur so als Info: Beim nächsten mal, wenn Du so eine Aktion bringst, ist der Account permanent weg. Ohne eine Chance dann den Account wieder zu bekommen. Nur zur Info, dass Du nicht aus allen Wolken fällst, wenn Du nach dem 14 Tagesbann so etwas noch mal vorhast.","replies":[]},{"poster":"Adc Insanity","date":"2020-02-04T03:06:18.404+0000","up_votes":10,"down_votes":1,"body":"Du feedest weil jemand dein Champion wegpickt? Werd lieber erwachsen und lern einfach wie man mit anderen Champions spielt oder dodge das Spiel wen du unbedingt musst. Allein von deinem Namen her kann ich dich schon nicht ernst nehmen da du definitiv weder erwachsen noch gut in diesem Spiel bist. Meiner Meinung nach solltest du direkt nen perma bann kriegen wen du schon wegen solchen Kleinigkeiten rumheulst :)","replies":[]},{"poster":"Yuiwara","date":"2020-02-04T08:23:07.617+0000","up_votes":7,"down_votes":0,"body":"> Ich habe in einem spiel absichtlich gefeedet weil mir einer denn champ weg gepickt hat \n\n... \n{{sticker:sg-janna}} \nWarum verstehen die leute nicht, dass sie kein Anrecht auf ihren \"ich will den Champ spielen\"-Champ haben. Wär sich für sowas am team rächt, der hats echt nicht anders verdient...","replies":[{"poster":"x77","date":"2020-02-04T19:31:17.880+0000","up_votes":2,"down_votes":6,"body":"> [{quoted}](name=Yuiwara,realm=EUW,application-id=KYnfKGf0,discussion-id=mBzwb2ON,comment-id=0007,timestamp=2020-02-04T08:23:07.617+0000)\n>\n> ... \n> {{sticker:sg-janna}} \n> Warum verstehen die leute nicht, dass sie kein Anrecht auf ihren \"ich will den Champ spielen\"-Champ haben. Wär sich für sowas am team rächt, der hats echt nicht anders verdient...\n\nstimmt, solange es keine trollpicks sind, darf jeder picken was er will ;)","replies":[{"poster":"Yuiwara","date":"2020-02-04T19:55:29.162+0000","up_votes":4,"down_votes":0,"body":"> stimmt, solange es keine trollpicks sind, darf jeder picken was er will ;)\n\nNope, jeder darf ohne einschränkung alles picken, was er will! \n(Nur nicht, was gebannt wurde. aber auch hier: jeder kann Bannen, was er will.)\nNiemand hat da ein mitspracherecht. du kannst zwar den wunsch äußern, dass er was anderes spielen möge, aber die entscheidung liegt beim anderen!","replies":[{"poster":"x77","date":"2020-02-05T17:02:33.005+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Yuiwara,realm=EUW,application-id=KYnfKGf0,discussion-id=mBzwb2ON,comment-id=000700000000,timestamp=2020-02-04T19:55:29.162+0000)\n>\n> Nope, jeder darf ohne einschränkung alles picken, was er will! \n> (Nur nicht, was gebannt wurde. aber auch hier: jeder kann Bannen, was er will.)\n> Niemand hat da ein mitspracherecht. du kannst zwar den wunsch äußern, dass er was anderes spielen möge, aber die entscheidung liegt beim anderen!\n\nimmernoch falsch. wenn man trollpicks spielen will kann man das in normals machen, in ranked verdient jeder der trollpickt nen perma :)","replies":[{"poster":"Sirrkas","date":"2020-02-05T17:06:17.363+0000","up_votes":1,"down_votes":0,"body":"Ahja, das erinnert mich an mein erstes Ranked, als mein Team meinte ich würde sie trollen, weil ich Udyr spiele und sie gehen jetzt feeden. Die hatten keine Chance zu feeden, weil ich ihnen ständig Kills auf dem Silbertablett serviert habe. Aber ich schätze, da ich Udyr gespielt habe, muss ich jetzt einen Bann kassieren, war ja ein Trollpick XP","replies":[]}]}]}]}]},{"poster":"Sirrkas","date":"2020-02-04T18:28:36.846+0000","up_votes":5,"down_votes":0,"body":"Das ist die erste Strafstufe für Sabotage, du solltest dich wirklich nicht wundern, dafür bestraft zu werden.","replies":[]},{"poster":"BìgM","date":"2020-02-05T08:23:45.093+0000","up_votes":4,"down_votes":0,"body":"Ich finde, in diesem Fall von eindeutiger Diskriminierung solltest du Strafanzeige gegen RIOT stellen.\n\nIch meine ... jemand anderes aus deinem Team hat den Champions gewählt, den du eigentlich spielen wolltest ... Wenn das nicht dazu legitimiert, das gesamte Spiel für 9 Leute zu ruinieren, was denn bitteschön dann? Ist ja nicht so, als hättest du eine Wahl gehabt. Einen anderen Champion wählen, kann keine Option sein. Wie zur Hölle sollst du dann carrien? Und dodgen kommt für Pro-Player, wie wir sie verkörpern, nicht in Frage. Ehrensache, Brudi.\n\nRegeln sind ja bekanntlich da, um gebrochen zu werden und nur wir Rebellen verstehen, diese eben auch für solche Erziehungsmaßnahmen zu missbrauchen. Ich nehme ja mal an, dass du deine Mitspieler gemäß unserem Ehrenkodex darauf aufmerksam gemacht hast, dass du zu deren lernzwecken das Spiel manipulieren wirst, solltest du den Champion nicht bekommen?!\n\nDann ist alles fine! Der Anwalt unserer Bruderschaft wird sich demnächst mit dir in Verbindung setzen und die Sachen klären. In den meisten Fällen bekommst du als Kompensation sogar noch einen Boost in die nächst höhere Elo spendiert. Kann ja wohl nicht sein, dass du eine Strafe absitzen musst, nur weil deine Teammates dich vom climben abhalten.\n\nKeep going, Bruder!\n\n´#sarcasm","replies":[]},{"poster":"Time2Whine","date":"2020-02-04T07:57:10.833+0000","up_votes":4,"down_votes":0,"body":"Was erwartest du von Riot? Dass sie sich bei dir melden und sagen dass sie es verstehen können dass du absichtlich das Spiel manipulierst und somit die Zeit von 9 anderen Spielern vergeudet bzw. die Spielerfahrung ruiniert hast und deswegen dir gestatten so zu handeln? Hmm um wen sollte sich Riot eher kümmern... um 9 Leute die eine schlechte Erfahrung wegen dir gehabt haben oder um dich der die Regeln gebrochen hat?\nIch denke dass die Entscheidung klar ist und falls du es vergessen hast, hast du nach jedem Patch die Bedingungen und Regeln von Riot zum Spielen von LoL akzeptiert und darin steht dass solch ein Verhalten von dir nicht gestattet ist. \nDas Wegpicken von Champs ist zwar nicht die feine englische Art aber es ist nicht verboten. Jedoch solltest du dann an deinem Mindset arbeiten wenn dich das dazu verleiten lässt die Regeln zu brechen.\nHoffentlich bringt dich der Bann auf den richtigen Weg","replies":[]},{"poster":"MeMyselfandBaal","date":"2020-02-05T01:04:35.648+0000","up_votes":3,"down_votes":0,"body":"Hmm... dir hat also ein Spieler deinen Champion weg gebannt. Und deswegen bestrafst du dann die anderen 8 Spieler, die einfach nur nen vernünftiges Spiel erleben wollten. Und ja, ich mag auch absichtliche Feeder im Gegnerteam nicht...\n\nAlso selbst wenn der eine das verdient haben würde... wie fair war dein Verhalten gegenüber all den anderen, die dir nichts getan haben?","replies":[]},{"poster":"Angel Ayume","date":"2020-02-04T11:42:59.157+0000","up_votes":3,"down_votes":0,"body":"Paradox...  \nWegen EINEM Game, wegen EINEM Champ fängst du an die Regeln zu brechen, ich mein, ist ja nur ein einzelnes Game, was man ja sicher auch hätte dodgen können oder einen anderen Champ picken können... beschwerst dich aber dann, dass du wegen EINEM Game gebannt wirst... \nIhrer paradox oder?","replies":[]},{"poster":"BoostedBonob0 x2","date":"2020-02-04T10:27:28.628+0000","up_votes":3,"down_votes":0,"body":"Jetzt mal ganz ehrlich, welche Antwort hast du dir von dem Forumpost erhofft?","replies":[]},{"poster":"DAD come back XD","date":"2020-02-05T01:51:01.832+0000","up_votes":2,"down_votes":6,"body":"Meine Antwort wurde zwar gelöscht aber um es kurz zu fassen finde ich das du nichts falsch gemacht hast wenn du einen Champion  extra gepickt hast und der wird trotzdem gebannt/gepickt und du wirst beleidigt dann hat der tüp den lose verdient ganz sicher :)","replies":[{"poster":"Angel Ayume","date":"2020-02-05T08:29:51.769+0000","up_votes":3,"down_votes":0,"body":"Und die restlichen Spieler? Wie rechtfertigst du es, dass die den Lose verdient haben?","replies":[]},{"poster":"BìgM","date":"2020-02-05T08:05:21.043+0000","up_votes":1,"down_votes":1,"body":"\"tüp\"xD","replies":[]}]},{"poster":"Cenâreth","date":"2020-02-04T17:44:32.605+0000","up_votes":2,"down_votes":0,"body":"Wie asozial muss man sein um in ein Game absichtlich zu feeden?","replies":[]},{"poster":"SBr3cher","date":"2020-02-18T14:06:47.632+0000","up_votes":1,"down_votes":0,"body":"Danke Riot.\nEndlich sehe ich dass es die richtigen erwischt","replies":[]},{"poster":"G2 Slippi","date":"2020-02-04T07:52:54.953+0000","up_votes":1,"down_votes":1,"body":"{{champion:33}}","replies":[]},{"poster":"Abasin","date":"2020-02-04T06:53:12.291+0000","up_votes":1,"down_votes":1,"body":"{{champion:48}}","replies":[]},{"poster":"xPumy09HD1","date":"2020-02-04T18:11:50.561+0000","up_votes":1,"down_votes":2,"body":"Man merkt schon dass dein Rang nicht höher als silber ist. Entweder dodged man das game oder spielt ein anderen Champ aber inten. Hast du vollkommen verdient.","replies":[]}]}