{"poster":"DeDiam0nd","date":"2015-09-02T08:18:23.050+0000","title":"Suggerimenti Top Laner","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Ciao Ragazzi,\r\n\r\nchi mi consigliate di comprare tra Irelia, Renekton e Jayce ? Chi &egrave; il meno counterato e che posso quindi giocare a prescindere dall&#039;avversario ?\r\nPS: sono in Bronzo quindi per la risposta basatevi su questo tier :D","replies":[{"poster":"lucanomax1994","date":"2015-09-02T08:56:41.847+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"DeDiam0nd","date":"2015-09-02T08:59:41.500+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Heart of Draenor,realm=EUW,application-id=MJVj50Jw,discussion-id=1keW1faw,comment-id=0003,timestamp=2015-09-02T08:56:41.847+0000)\n>\n> Per bronze/silver basso mi sentirei di consigliarti renek: una volta che impari la combo è semplice, e la gente non sa **quasi** mai giocarci contro. \n> Sinceramente maino irelia ma ci ho messo quasi un anno per fare \"qualcosa\" nei game, e ancora adesso fatico in certi game/matchup. Quindi se ti serve un champ immediato per coprire una mancanza di pick nella top ti consiglio renek, se hai piu voglia di metterti lì (si tratta di mesi) a spammare normal vai di irelia. Personalmente quei 3 mesi di allenamento li ho trovati worth, ma è un altro discorso perche mi piace il champ.\n> Jayce: non mi piace molto il kit e lo dovrei ancora provare quando va in free rotation, ma quando ero in s4 mi carriarono molti game con jayce(ero tanto piu scarso).\n\nGuarda a me non piace giocare top...e quando gioco TOP vado di SION per andare safe e basta.\nPerò poi dipendo troppo dal team quindi cercavo appunto un champ che mi permettesse anche di snowballare facilmente e che anche se dovessi essere sotto in termini di Gold ed Exp mi permetta di recupare.","replies":[{"poster":"lucanomax1994","date":"2015-09-02T09:09:22.519+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"DeDiam0nd","date":"2015-09-02T09:36:51.437+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Heart of Draenor,realm=EUW,application-id=MJVj50Jw,discussion-id=1keW1faw,comment-id=000300000000,timestamp=2015-09-02T09:09:22.519+0000)\n>\n> L'ho scritto: se ti serve un toplaner immediato e non troppo difficile vai di {{champion:58}} , ma non aspettarti di vincere i tf da solo, per quello c'è {{champion:39}}  ma devi avere le mani e non andare troppo behind in lane, quindi 1-2 mesi di allenamento in normal ti servono.\n> **Le scelte sono 2: **\n> -Ti serve un champion per non feedare ed essere un minimo utile in termini di danno e cc? Renekton\n> -Vuoi un champion veramente forte ma difficile? Irelia--> quindi ti impegni 2 mesi in normal per imparare.\n> Non c'è scusa che regge: o lavori hard per poi imparare a carriare sul serio(e ci vuole tanto tempo), o giochi per divertirti ma non puoi permetterti ti carriare sul serio.\n> E' come la vita, o studi 5 anni e ti fai un culo con gli esami per andare a fare il medico e guadagnare 3000€, o senza studiare vai a tagliare la legna per quei 800-1000€ al mese(che per un ragazzo che vive da solo vanno piu che bene).\n\nSisi non è un problema,..pensa che l'unico ADC che gioco è Draven e su 90 partite ho il 55 % di winrate con 3.2 di KDA come media.\nNon sono il classico bronzo che vuole il champ per vincere una partita giocando magari senza mani...","replies":[{"poster":"DeDiam0nd","date":"2015-09-02T10:12:14.545+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DeDiam0nd,realm=EUW,application-id=MJVj50Jw,discussion-id=1keW1faw,comment-id=0003000000000000,timestamp=2015-09-02T09:36:51.437+0000)\n>\n> Sisi non è un problema,..pensa che l'unico ADC che gioco è Draven e su 90 partite ho il 55 % di winrate con 3.2 di KDA come media.\n> Non sono il classico bronzo che vuole il champ per vincere una partita giocando magari senza mani...\n\nSai dirmi qual'è la combo di Irelia ?","replies":[]},{"poster":"lucanomax1994","date":"2015-09-02T10:03:20.888+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"DeDiam0nd","date":"2015-09-02T10:06:03.233+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Heart of Draenor,realm=EUW,application-id=MJVj50Jw,discussion-id=1keW1faw,comment-id=00030000000000000000,timestamp=2015-09-02T10:03:20.888+0000)\n>\n> basta che non ti aspetti di  carriare dopo 2 normal.\n> 1) le normal sono giocate per imparare nuovi champs, rilassarsi senza tryhardare\n> 2) in normal magari prendi 2 kill e smettono di giocare seriamente, wardando etc...quindi magari ti resta piu facile snowballare, cosa che non è cosi in ranked(o meglio, non DOVREBBE).\n\nNo bhe io di solito prima di rankare faccio almeno 20 partite..cerco di vedere piu matchup poi dipende se vedo che chi ho contro non è forte faccio anche 50 partite.","replies":[]}]}]}]}]}]},{"poster":"Keìron","date":"2015-09-02T20:11:19.293+0000","up_votes":1,"down_votes":0,"body":"Irelia è un champ con meccaniche \"complesse\" ma dopo averl capita è Dio. Non ha praticamente nessun counter ma se non snowballi un po' in early  la tua potenza cala un po'  Build {{item:3078}} {{item:3153}} {{item:1322}} {{item:3143}} {{item:3065}} {{item:3083}} . Con Renekton invece devi solo imparare la combo E W Q E e grazie ai suoi altissimi danni  in early countera quasi tutti gli AD bruiser(compresa Riven!). Il suo problema è (o era) il suo danno in late, ma ora c'è la Titanic Hydra e sticazzi. Build {{item:3748}} {{item:3111}} {{item:3071}} {{item:3742}} {{item:3065}} {{item:3083}} o{{item:3068}}. Jaice so solo che non è in meta :P","replies":[]},{"poster":"DeDiam0nd","date":"2015-09-02T08:39:02.923+0000","up_votes":1,"down_votes":0,"body":"non mi piacciono i champ troppo aggressivi in early...io sono il classico che va safe all'inizio","replies":[{"poster":"PeLLaX","date":"2015-09-02T12:48:10.487+0000","up_votes":1,"down_votes":0,"body":"Se non ti piacciono i campioni aggressivi early renek non fa per te.... è solo early. Io lo uso sovente toplane e devi aggrare all'inizio, perchè fondamentalmente il late di renek non esiste: o riesci a prendere vantaggio pesante in lanefase (e arrivare anche 5/6-0 non è un utopia) e la chiudi carriando mooolto presto (20-25) o perdi di potenziale. Diciamo che se sei feddato fai sfaceli fino al 25 circa, dopo la tua unica utilità è di buildarti tankoso e ingaggiare di final nei fights, lasciando fare il lavoro sporco ai carry. \nChiudo dicendoti che comunque in lanefase sei un mostro e sono ben pochi i champ i grado di resisterti, e io che sono un giocatore da early mi ci trovo molto bene e mi sento di consigliartelo (gli altri non li conosco).","replies":[]},{"poster":"Polarize","date":"2015-09-02T08:48:40.001+0000","up_votes":1,"down_votes":0,"body":"I campioni forti in early game hanno chiaramente meno counter di quelli che sono scarsi nelle prime fasi di gioco.\n\nPotresti provare vladimir, gnar(complesso) , darius , rumble (complesso) , maokai o malphite.\n\nTutti questi scalano abbastanza bene e sono ok in lane, personalmente per il tuo caso specifico consiglio vladimir visto che è ranged e si cura pure+scala benissimo e non ha counter","replies":[{"poster":"DeDiam0nd","date":"2015-09-02T08:50:01.894+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Xavi Senpai,realm=EUW,application-id=MJVj50Jw,discussion-id=1keW1faw,comment-id=00020000,timestamp=2015-09-02T08:48:40.001+0000)\n>\n> I campioni forti in early game hanno chiaramente meno counter di quelli che sono scarsi nelle prime fasi di gioco.\n> \n> Potresti provare vladimir, gnar(complesso) , darius , rumble (complesso) , maokai o malphite.\n> \n> Tutti questi scalano abbastanza bene e sono ok in lane, personalmente per il tuo caso specifico consiglio vladimir visto che è ranged e si cura pure+scala benissimo e non ha counter\n\nOk perfetto.\nMa riesco a carriare con vlad ? Ormai mi metto in testa che o carrio io o si perde.","replies":[{"poster":"miki2212","date":"2015-09-02T12:34:14.387+0000","up_votes":1,"down_votes":0,"body":"beh, con vladimir non riesci a carriare  se il tuo team non ti segue, tra quelli consigliati dal senpai xavi il migliore che, se ha molte kill/farm, fa i tf 1v5 è gnar per gli alti danni aoe. Dopo l'aggiornamento anche darius è un buon candidato. E anche rumble e maokai non ci scherzano. In definitiva direi che vlad e malphite non li vedo molto da \"op carry 1v5 penta\", ma più come un carry molto potente ma che dipende anche dal team.","replies":[]},{"poster":"Polarize","date":"2015-09-02T08:55:45.077+0000","up_votes":1,"down_votes":0,"body":"Quello sta sul giocatore, non sul champ.","replies":[]}]}]}]},{"poster":"Pls Buff Shen","date":"2015-09-02T11:56:32.180+0000","up_votes":1,"down_votes":0,"body":"{{champion:58}} Difficle da counterare, stunni di W e colpisci Con Q, se scappano o vuoi scappare la E. Easy, bullo per natura.","replies":[]},{"poster":"TerrorVodka","date":"2015-09-02T11:32:47.047+0000","up_votes":1,"down_votes":0,"body":"leggere che ti servono 1 o 2 mesi per imparare irelia .......\najajajajaj ayyyyycaramba","replies":[]},{"poster":"Polarize","date":"2015-09-02T08:33:32.580+0000","up_votes":1,"down_votes":0,"body":"Renekton, è fortissimo in lane anche se hai delle forchette al posto della mani.\nPerò devi giocare aggressivo e prendere un buon vantaggio in lane visto che non scala molto bene.\nIn lane quando raggiungi 50 di furia, fai  E aa W aa q aa e usi la seconda E per tornare indietro, con questa semplice combo togli tipo 50% della vita nemica al livello 3.\n\nAnche irelia è molto forte ma è un pelino più complicata(ma carria di più) quindi se non ti fidi molto delle tue abilità meglio il coccodrillo","replies":[]},{"poster":"Lucouss","date":"2015-09-02T08:30:22.039+0000","up_votes":1,"down_votes":0,"body":"Irelia ({{champion:39}}) è davvero forte, a me piace molto! Riesci a uccidere l'adc nemico e rimanere in vita, di solito come build faccio Trinity, BOTRK e poi Tank.\nRenekton ({{champion:58}}) in quell'elo dicono sia forte, ma non avendo mai provato non so dirti. Di sicuro non è una cattiva scelta (Non l'ho provato con i nuovi item da tank, qualcuno può confermarmi se ne ha tratto molto beneficio oppure è rimasto più o meno uguale a prima?)\nJayce ({{champion:126}}) non saprei, non l'ho quasi mai usato e non credo sia molto valido al momento. L'unico tra i tre che non ti consiglio.","replies":[]}]}