{"poster":"DeDiam0nd","date":"2015-08-05T12:13:27.704+0000","title":"Opinioni Rengar","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Ragazzi attualmente Rengar &egrave; viabile in giungla ?\r\nIn solo Q si possono ottenere ottimi risultati se giocato bene ?\r\nPerch&egrave; ho letto che in questi ultimi tempi &egrave; stato abbastanza nerfato.","replies":[{"poster":"Ste the ripper","date":"2015-08-05T12:20:00.541+0000","up_votes":1,"down_votes":0,"body":"Non mi risultano nerf recenti, l'ultimo dovrebbe essere di qualche mese fa.\nÈ viabile ma è molto difficile secondo me, e in soloq è fortissimo, se impari ad usarlo bene puoi letteralmente shottare i carry e a quelbpunto il fight è in discesa :)","replies":[{"poster":"Giacux","date":"2015-08-05T15:07:53.452+0000","up_votes":1,"down_votes":0,"body":"Molto difficile? È tipo l'assassino più stupido del gioco lol","replies":[{"poster":"Ste the ripper","date":"2015-08-05T15:34:00.471+0000","up_votes":2,"down_votes":0,"body":"Sicuro, un buon rengo ti shotta istantaneamente di combo, tu lo sai fare?\nUn buon rengo dopo averti ucciso non muore dai tuoi teammates non è banale rengo \nSe lo ritieni facile spammalo e facci il challenger\n\nProva fizz e talon poi prova rengo sono un pochino diversi come difficoltà :)","replies":[{"poster":"Giacux","date":"2015-08-05T15:38:05.594+0000","up_votes":1,"down_votes":0,"body":"Non gioco Rengar e non è nei miei prossimi acquisti, ma ho visto molti video e miei amici giocarlo, l'unica cosa che c'è da fare è attivare la ulti, Q, attive varie come l'Hydra e hai oneshottato il bersaglio. \nE non sono l'unico a pensarlo, prova a guardare il video su di lui di Agua o di Terenas.","replies":[{"poster":"Ste the ripper","date":"2015-08-05T15:43:57.924+0000","up_votes":1,"down_votes":0,"body":"Ah quindi tu senza averlo mai giocato puoi assolutamente dire che è il più facile perché lo hai visto giocare in alcuni video... ok... tranquillo che la colpa è mia che perdo tempo con te.\nTrovami il video di agua in cui lo dice e mi rimangio tutto, per ora sei chiacchere e distintivo :)","replies":[{"poster":"Giacux","date":"2015-08-05T15:59:53.614+0000","up_votes":2,"down_votes":0,"body":"È più sotto il video di Agua.\nE lo dice espressamente che \"Rengar è un champ senza counterplay\", e anche qualcos'altro che non ricordo. \nComunque hai ragione, non dovrei giudicare un campione senza averlo provato... Mb.","replies":[]}]}]}]}]},{"poster":"DeDiam0nd","date":"2015-08-05T12:31:07.197+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ste the ripper,realm=EUW,application-id=MJVj50Jw,discussion-id=d9PpXqQh,comment-id=0000,timestamp=2015-08-05T12:20:00.541+0000)\n>\n> Non mi risultano nerf recenti, l'ultimo dovrebbe essere di qualche mese fa.\n> È viabile ma è molto difficile secondo me, e in soloq è fortissimo, se impari ad usarlo bene puoi letteralmente shottare i carry e a quelbpunto il fight è in discesa :)\n\nquindi consigli di comprarlo ? La difficoltà non mi spaventa","replies":[{"poster":"Ste the ripper","date":"2015-08-05T14:50:49.019+0000","up_votes":1,"down_votes":0,"body":"Io l'ho comprato e mollato perché non riuscivo a giocarlo ( io non so giocare gli assassini e la jungla è il mio ruolo peggiore), ma è forte, tecnicamente non ha nulla da invidiare ad altri jungler e per la soloq non ha grossi difetti anzi worka bene perché non ha bisogno di nessuno.\nSe te la senti di perderci un po' di tempo a impararlo io te lo consiglio, magari potresti aspettarlo in free per provarlo, ma ripeto non ha motivi tecnici per non essere giocato se ti troverai male vorrà solo dire che come per me non è il tuo genere di campione.\n\nPs: provalo in combo con orianna è op ( va beh che quasi chiunque è op con orianna) e una volta agli lcs ho visto in combo con {{champion:127}} ultavano entrambi e vicevano il fight lol","replies":[]}]}]},{"poster":"Federico 2001","date":"2016-01-28T15:25:58.722+0000","up_votes":1,"down_votes":0,"body":"Impari a giocarlo e quando salti addosso a qualcuno premi tasti a caso ahahah{{sticker:slayer-pantheon-rainbows}}","replies":[]},{"poster":"SideshowEMS","date":"2015-08-05T15:03:39.255+0000","up_votes":1,"down_votes":0,"body":"Ti prego non usare Rengar, ogni volta che quel coso esce da un cespuglio mi prende un infarto, e mi avvaicino di qualche secondo alla morte. Vuoi essere complice della mia dipartita ?","replies":[]},{"poster":"DeDiam0nd","date":"2015-08-05T13:06:16.479+0000","up_votes":1,"down_votes":0,"body":"grazie ragazzi :)","replies":[]},{"poster":"Avicïï","date":"2015-08-05T13:01:24.342+0000","up_votes":1,"down_votes":0,"body":"Maino Rengar da abbastanza tempo, seguo un canale youtube in cui questo tizio gioca soltanto Rengar, Shyvana e Riven... è challenger e carria le partite facendo tipo 21-2, 24-1 e così via. Te lo consiglio","replies":[]},{"poster":"PolloPowa","date":"2015-08-05T12:56:57.575+0000","up_votes":1,"down_votes":0,"body":"La difficoltà con rengar sta solo nel cercare lo snowball EG senza morire e saper usare l'ulti intelligentemente e al giusto tempo per il resto una volta avviato non ha counterplay.\nl'unico problEma è che è un full assassin (non lo fai tank) e perciò devi avere un compagno che picka tank (non zed top come fanno molti furbi perciò)\nquindi si fa un po fatica a picka rlo più che altro...proprio perchè ci devono essere le condizioni per farlo.non puOi pickare un rengar contro un trundle se non è idiota...\nun'altro punto è che rengar è un champ all in.per questo è considerato rischioso.ma se sai quello che fai non ci sono problemi.\n\nP.s valuta bene quando usare la Q piuttosto che la E empowerata.\nti ho spiegato quello che avresti imparato in almeno una 20ina di ga me ;)\n\nhttps://m.youtube.com/watch?v=j6a63XAWOqE\n\nPiù chiaro di lui?","replies":[]}]}