{"poster":"Aiwenore","date":"2020-01-20T23:02:19.631+0000","title":"Info su Report","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Buonasera a tutti!\r\n\r\nE' qualche tempo che seguo un piccolo streamer che non fa altro che perdere le lane ( e fino a qui capita, nessuno può vincere la sua linea il 100% delle volte ), chiamare open mid,  andare afk,  flame passivo/aggressivo condito di ping molesti.  Dà intereamente la colpa ai suoi compagni di squadra. \r\nHa un comportamento tossico nel 98% dei game.\r\nInsomma, il tipico player che non vorresti mai avere in team. Ma proprio mai.\r\nDal momento che streamma e che rende pubblici i suoi game, è possibile intervenire in qualche maniera?","replies":[{"poster":"Gatto Bipolare","date":"2020-01-21T12:26:39.968+0000","up_votes":2,"down_votes":0,"body":"Esistono streamer anche grandi, che portano account a iron con il 90% di lose usando anivia smite/tp, e nessun ban.\nQuindi trai le conclusioni.","replies":[{"poster":"Aiwenore","date":"2020-01-21T21:17:43.604+0000","up_votes":1,"down_votes":0,"body":"Certo certo, uno può giocare ogni campione come meglio crede. Ma qui parlo di comportamenti scorretti, tossici, afk etc.","replies":[]}]},{"poster":"beppedessi","date":"2020-01-21T07:37:25.374+0000","up_votes":2,"down_votes":1,"body":"L'unica cosa che puoi fare è inviare un ticket al supporto giocatori scegliendo \"Segnala un giocatore per uso di trucchi, phishing o comportamenti scorretti\" tra le motivazioni del ticket, quindi indicando il caso appropriato nelle sottocategorie.","replies":[]},{"poster":"MidZombi92","date":"2020-01-22T17:40:46.589+0000","up_votes":1,"down_votes":0,"body":"Vuoi essere giusto, ma non e` giusto.\nSe un altra persona fa la stessa cosa di questo elemento qui, ma non streamma puo` essere beccata solo dai report interni del gioco.\nOra, se questo elemento qui fa cose brutte, dovrebbe essere punito dai report dei game e non perche` tu oppure un altro lo ha visto in streamming.\n\nQuindi semmai ti dovresti lamentare ma questo non puoi saperlo che qualcuno lo reporta e non vengono presi provvedimenti, potresti dire che non funziona bene il report e ban. \nMa andare a fare il giocatore onesto alla Riot, non e` cosi` onorevole come credi e ne` tanto meno ti danno caramelle o ricompense per aver agito con spirito civico. \nQuindi sarebbe solo andare a piangere alla Riot, perche` tu rosichi senza motivo.\nSarebbe piu` opportuno chiedere come mai se ci sono stati dei report come mai non hanno dato il certo peso(sempre se ci sono stati dei report).\nQuindi, per piacere, capisci che qualche volta e` meglio farsi i cavoli propri.","replies":[{"poster":"Aiwenore","date":"2020-01-22T20:50:46.398+0000","up_votes":1,"down_votes":0,"body":"Guarda, sono indeciso se argomentare ( e quindi investire il mio tempo ) o meno. Non ho capito bene se sei un troll oppure no.\nFammi sapere, ho creato apposta questo Thread per le problematiche che ho sopra illustrato.\n\nps. Non sono nè un white knight, nè un leone da tastiera.","replies":[]}]}]}