{"poster":"Giggio","date":"2018-12-30T11:30:26.102+0000","title":"Come siete arrivati al gold? Datemi e vostre esperienze","subforum":"Campioni e gameplay","up_votes":1,"down_votes":1,"body":"Datemi e vostre esperienze","replies":[{"poster":"AleJESUS","date":"2018-12-31T14:30:42.412+0000","up_votes":2,"down_votes":0,"body":"Gangplank e sbattendo la testa sulla tastiera","replies":[]},{"poster":"ILoveTiramisu","date":"2018-12-30T20:15:53.161+0000","up_votes":2,"down_votes":0,"body":"Oltre alla prima season in cui o giocato non ho mai avuto problemi ad arrivare gold. Il problema è che all'inizio ho dovuto studiare il gioco leggendo molte guide. Gioco principalmente la botlane, supporto o adc. Inizialmente il mio problema come giocatore è che non sapevo cosa fare e quindi dovevo capire cosa fare e perchè. Le regole sono semplici:\n\n0) Banna i campioni rotti: Io banno lucian o pyke.\n1) Impara campioni in meta.\n2) Picka in base a qualche sinergia coi alleati. Un supporto forte (Brand, Leona) nei primi livelli =picko ashe, supporti deboli (Twitch) e cerco di evitare i trade.\n3) Impara a memoria i primi item da comprare (core) e modifica in base ai problemi che hai in partita quelli gli ultimi. Se sei un supporto lascia uno spazio vuoto per le pink.\n4) Impara a controllare la visione e gli obbiettivi. La visione è importante perche da informazione. Guarda la mappa, appariranno le free kill e morirai di meno.\nTi racconto di un episodio successo veramente: Yasuo appena uscito era rotto e se non lo bannavi lo trovavi contro e carriava da solo. Ho vinto una partita perche yasuo ha recallato vicino a una ward, eravamo a conoscenza di essere 4v5 e ho subito ingaggiato con alistar.\n5) Gioca intorno agli altri soprattutto al jungler. (Questa più che altro quando sali in gold) ma sapere dove il jungler alleato vuol dire sapere se in caso di pericolo avrò aiuto= posso giocare aggressivo quando il jungler è vicino.\n\nQuesti sono solo concetti, le informazioni più precise ti conviene cercarle. C'e un canale youtube in italiano che insegna a giocare molto bene: https://www.youtube.com/channel/UCD0gkn2nA8VVjLJrBfu4tHw (è di un tizio che fa coach e ha giocato piu ruoli ed è arrivato challenger piu volte)","replies":[{"poster":"Diyoza","date":"2018-12-31T18:07:58.313+0000","up_votes":1,"down_votes":0,"body":"non sapevo di questo canale youtube, è ben fatto, grazie bro {{sticker:sg-lux}}","replies":[]}]},{"poster":"Barlettano","date":"2018-12-31T17:30:44.740+0000","up_votes":1,"down_votes":0,"body":"Giocando il campione che nel complesso conoscevo meglio. All'epoca ,in season 6, fu Morgana mid giusto per farti capire che non è necessario seguire il meta","replies":[]},{"poster":"ART ØF STEALING","date":"2018-12-31T13:30:04.472+0000","up_votes":1,"down_votes":0,"body":"Gioca campioni rotti o forti in silver/gold come leona/soraka .... se maini support sennò boh","replies":[]},{"poster":"V3LK0ZMAST3R","date":"2018-12-31T11:44:08.917+0000","up_votes":1,"down_votes":0,"body":"Vincendo","replies":[]},{"poster":"Warlor","date":"2018-12-31T09:18:19.484+0000","up_votes":1,"down_votes":0,"body":"Spammando game","replies":[]},{"poster":"Br0ken Sword","date":"2018-12-30T21:43:00.953+0000","up_votes":1,"down_votes":0,"body":"Ho passato un anno in bronzo e un anno in silver, poi, arrivata la season 5 sono migliorato molto perchè ho capito meglio il gioco tramite streaming e video su youtube e ho imparato benissimo un champ che mi ha portato da Argento 1 a Platino IV, {{champion:92}}","replies":[]}]}