{"poster":"Giggio","date":"2019-01-04T01:06:25.424+0000","title":"Ferri con mmr da gold ma perché? (capitato più di una volta in ranked)","subforum":"Discussioni generali","up_votes":3,"down_votes":0,"body":"Faccio le mie solite partite in ranked poi a fine game controllo gli elo e mi trovo in team un ferro con mmr da gold 4 in mezzo ai silver oppure bronzo 1 con mmr da silver 1. Prima non era cos&igrave;. Poi io sono solver 2 ho un mmr da gold 3 con win rate di 58% e mi trovo contro una riven silver 4 con mmr silver 2 ma con win rate 20%. E quella riven non dovrebbe avere un mmr da bronzo con quel win rate?","replies":[{"poster":"nJacob","date":"2019-01-04T10:33:17.653+0000","up_votes":1,"down_votes":0,"body":"Il rank effettivo non conta niente, l'MMR sì. Se tu hai in squadra un Iron con l'MMR da Gold, molto probabilmente si tratta di un account creato da poco e precedentemente Unranked che ha appena completato i suoi placement games. E' un ... bug? Non penso la riot games avesse in mente di farlo così, spero proprio, però molti pro-player e streamer di elo alto si sono ritrovati posizionati in Iron nonostante avessero vinto tutte e 10 le loro partite e abbiano l'MMR di base di un high-plat low-diamond. Quindi sì, se in diamond si trovano i Ferri, succederà a tutti gli elo purtroppo. Spero davvero sistemino sta cosa perché a mio avviso non ha veramente senso. Non partire però con il presupposto che \"Ah, ho un ferro, ho perso\" perché un ferro con l'MMR di un gold è forte quanto un gold con l'MMR di un gold.","replies":[{"poster":"Giggio","date":"2019-01-04T11:26:48.899+0000","up_votes":2,"down_votes":0,"body":"Non partire però con il presupposto che \"Ah, ho un ferro, ho perso\" perché un ferro con l'MMR di un gold è forte quanto un gold con l'MMR di un gold. \n\nNon faccio questo genere di ragionamenti era solo per dire: povero ferro che si deve assorbire svariate partite prima di arrivare al suo elo","replies":[]}]},{"poster":"nikholaos","date":"2019-01-11T09:50:35.150+0000","up_votes":1,"down_votes":0,"body":"sono stato Rankato Iron 3.\n\nmmr 57℅.... eh niente, ogni volta mi dicono \"ahahah sei Iron, zitto e impara\"\n\nalla fine, appena la partita finisce (dopo che li carrio quanto la Madonna carria le mie bestemmie mentre focussano il tank (esempio massimo: Evelyn 22/5/19 pochi giorni fa), non solo non mi chiedono scusa, ma pretendono di essere aggiunti, sti maiali senza pudore....\n\nconcetto finale, non so cosa stia succedendo,  ma non dare troppo peso al rank, ora come ora è mezzo svalvolato.","replies":[]},{"poster":"Lovecrank","date":"2019-01-04T12:10:28.172+0000","up_votes":1,"down_votes":0,"body":"io mi sono trovato un iron 4 in una ranked con high plat/diamond 4","replies":[]},{"poster":"chaoswarrior204","date":"2019-01-04T11:34:35.881+0000","up_votes":1,"down_votes":0,"body":"Come avevo detto in un altro post il problema è che la Riot ha Deciso che i nuovi account partono da iron4 però li fanno partire con mmr da silver alto, dovrebbero risolvere con la nuova season","replies":[]}]}