{"poster":"El Pingu","date":"2017-05-30T09:58:07.579+0000","title":"[OT] Wahlvorbereitungen","subforum":"Allgemeiner Chat","up_votes":25,"down_votes":6,"body":"Liebe Freunde des guten Humors,\n\nDer alte K&ouml;nig hat abgedankt und wir sind nun seit mehreren Stunden bereits ohne K&ouml;nig.\n\nEs wird h&ouml;chste Zeit, das wir uns an die Wahlvorbereitungen machen.\nDas nicht wieder 100.000 Threads entstehen, habe ich f&uuml;r dieses Mal, diesen Sammelthread zum Diskutieren erstellt. Folgende Punkte werden hier ausdiskutiert.\n\n1. Neue Ot B&uuml;rger\nGremium:\n-King Prow \n-Fizz\n-Zamonianer\n-Super Kahlan\n-Der schweizer Keks\n2. Wahl des Wahlvorstands zur K&ouml;nigswahl\n-Markishi\n-Schweizer Keks\n3. Wahlort\nhier(3 Stimmen) externes Forum (0 Stimmen)\n4. K&ouml;nigsvorschl&auml;ge\nBisher: \n-King Prow (X)\n-maexle (x)\n-Luna(x)\n-Großmugister\n-Superkahlan\n-Angel Ayume(x)\n-El Pingu(x)\ndie mit (x) markierten, haben zur Wahl zugesagt\n5. Termine\n\nF&auml;llt euch noch mehr ein, bitte hier Posten.\n\n-------\n\n**1.Neue Ot B&uuml;rger**\n\nEs gibt immer kurz vor der K&ouml;nigswahl, einen gro&szlig;en Anlauf an Leuten, die dem OT beitreten wollen. Hierbei ist dies aber &auml;u&szlig;erst kritisch, da auch der ein oder andere Smurf dabei sein kann.\nIch schlage daher folgendes vor:\nS&auml;mtliche Beitrittsanfragen k&ouml;nnen vorerst nur noch hier gestellt werden und wird von einem Gremium angenommen oder abgelehnt.\nDas Gremium w&uuml;rde ich besetzen aus:\n- King Prow\n- Fizz\n- Zamonianer\n- Super Kahlan\n\nAus folgenden Gr&uuml;nden:\n\n- alle 4 sind schon lange im Ot und k&ouml;nnen evtl. Den ein oder anderen Smurf erkennen.\n- alle 4 hatten, obwohl sie dazu durchaus in der Lage sind noch kein besonderes Bestimmungsrecht.\n- Eibert wollte die jungen Leute mehr ins Ot einbringen evtl. Sogar durch einen jungen K&ouml;nig.\n\n**2.Wahl des Wahlvorstands zur K&ouml;nigswahl**\n\nMarkishi hat sich dazu angeboten, und ich w&uuml;rde ihn dieses Mal dazu vorschlagen.\nDönerlord hat den Schweizer Keks als Nachfolger vorgeschlagen\n\n**3.Wahlort**\n\nAuch wenn mein Vorschlag h&ouml;chstwahrscheinlich abgelehnt wird, bin ich gegen das abkapseln.\nAm liebsten w&uuml;rde ich in diesem Forum w&auml;hlen und um Smurfs zu verhindern, muss jeder OT B&uuml;rger schreiben, wen er w&auml;hlt.\n\n**4.K&ouml;nigsvorschl&auml;ge**\n\nBisher hatten wir in letzter Zeit nur alte, runzlige K&ouml;nige (eibert, Becks, mich), ich w&auml;re einmal f&uuml;r jemand junges und schlage KP vor.\nEr ist schon lange im Ot, sehr aktiv und bringt das Forum durch etliche Threads die noch in Jahren zu sehen sind voran.\n\n**5.Termine. **\nAm liebsten w&auml;re es mir, wenn bis Montag die Vorschl&auml;ge gelaufen sind. Und der Wahlkampf beginnt.\n\nLG, alt-alt-alt K&ouml;nig Pingu","replies":[{"poster":"5weeds","date":"2017-05-30T11:47:13.763+0000","up_votes":7,"down_votes":0,"body":"Ach, die lieben OT's...\n\nJahre der Freude und des Stirnrunzelnz habt ihr uns geschenkt.\nDie An-, Auf- und Erregungen, die mit euch gekommen sind. \nDie Diskussionen, ob man euch die Hand Schütteln, oder abschlagen soll...\n\nSo viele Lacher habt ihr uns geschenkt, so viele Legenden in euren Reihen gehabt!\n\nAuch wenn für Viele die bevorstehende Krönung ein Silberstreifen am Horizont darstellt, brennen Andere darauf, euch aus jenen Hallen zu vertreiben, die für euch ein Heiligtum, ja, sogar eine Heimat darstellen.\n\nAber lasset uns nicht bei der Königswahl von der Freude und Euphorie überkommen, sondern mit klaren Blick auf die Zukunft des OTs achten.\nEin König ist schnell gewählt.\nUnd noch schneller bereut.\n\nLasset uns auf die Suche gehen und den König unter den Bürgern finden, einer der den OT gerecht ist, einer der mehr will, als nur Spielen ',:D auf dass wir mit stolzgeschwellter Brust auf den neuen Monarchen trinken können und nicht in der Scham über einen falschen König unser Angesicht verstecken müssen.\n\nDennoch...\nInmitten all dieser Pläsier und Wonne, mit der es uns nach dieser großartigen Zukunft verlangt, sollten wir Demut und Dank in unser Herz einkehren lassen.\nDankbarkeit für einen Freund, einem Geliebten, einem König.\n\nEibert Rümmel.\n\nEin Mann, eine Legende, ein König, dem ich meine bedingungslose Liebe zugestehe.\nNoch nie bin ich auf jemanden getroffen, der mir mit einer derartigen Klarheit in den Augen gegenübertrat.\nAls ich ihm das erste mal in einem von mir Erstellten Forum traf, wusste ich nicht was von dieser mehr als fragwürdigen Gestallt halten sollte.\n\nJeder meiner frage wich er aus, meinem Blick entzog er sich gekonnt, stets mit einer Bemerkung auf der Zunge.\n\nUnd dennoch...\nEr brachte Freude und Leben.\nWo immer er sein Wort hinrichtete, fand er immer jemanden, dem er den Tag versüßen konnte.\n\nEr mag frech gewesen sein, ließ sich aber nie zur Unsittlichkeit hinreißen.\n\nIch begegnete ihm Anfangs zwar wohlwollend, aber dennoch misstraute ich dem munterem Treiben Eibert's, auf der Kannte des Zynismus tänzelnt\nZu viele habe ich bereits taumeln und fallen sehen.\n\nAber nicht er.\n\nMit der Zeit lernte ich ihn immer mehr zu schätzen.\nIch hatte ihn gern.\nSogar auf den Emissary-Streams haben wir gemeinsam gelacht.\n\n\n\nSelbst wenn mich Eibert nie wirklich wahrgenommen hat, war ich steht's da.\nIch war steht's da.\nUnd das bin ich immer noch.\n\n\nSo hebet die Gläser!\nAuf dass er immer bei uns ist. \nAuf dass er eines Tages wiederkehrt, um mit uns zu lachen.\n\nProst, Eibert!\nNie werden wir dich vergessen.\nProst\n{{item:3028}}","replies":[{"poster":"Eibert Rümmel","date":"2017-05-30T12:57:39.429+0000","up_votes":2,"down_votes":0,"body":"Wow. Ich weiß gar nicht was ich darauf antworten soll. Ich sitz gerade auf Arbeit und bin wirklich bewegt. Alleine wegen dieser Nachricht hat sich jede Minute, die ich in dieses Forum steckte, gelohnt. Danke für diese lieben Worte.\n\nIn einem irrst du dich aber. Ich habe dich sehr wohl wahrgenommen. Und zwar als einen produktiven Forenuser, dessen Kommentare und Threads ich gerne gelesen habe. Als einen, der dem Forum gut tut. Du warst sogar einer von einer Handvoll Forenuser, die ich gerne im Ot begrüßt hätte. Da fast alle die ich unbedingt haben wollte, sich irgendwann von selbst beworben habe, habe ich auf dich einfach gewartet. Leider vergebens.\n\nEs steht dir natürlich frei, dich bei uns zu bewerben. Ich bin mir Sicher Superkahlan würde in meinem Namen willkommen heißen. Und dann kannst du gerne meinem geliebten Sohn shacolade zur Macht verhelfen ;)\n\nIch denke ich werde heute Abend den Stream einschalten, um mich von den Volus zu verabschieden. Vielleicht können wir da ja nochmal im Chat zusammen scherzen und lachen. Würde mich freuen :)","replies":[]}]},{"poster":"Angel Ayume","date":"2017-06-02T17:19:45.470+0000","up_votes":6,"down_votes":0,"body":"Meine lieben OTler,\n\nein kleiner Engel flüsterte mir, halt warte, ICH bin doch der Engel O.o \n*verwirrt den Kopf schüttel* \nwie dem auch sei bin ich bin zu den Entschluss gekommen die Nominierung anzunehmen.\nHiermit nehme ich offiziell meine Ablehnung zur Nominierung zurück.\n\nDas OT hat einen guten und fähigen König verdient, wählt den, den ihr für am geeignetsten und besten haltet. \nWählt MICH. \nNein Scherz, haha. xD \nWählt den, den ihr am sinnvollsten findet und das OT weitere 6 Monde weise zu führen vermag.","replies":[]},{"poster":"Kind Prow","date":"2017-05-31T14:28:50.604+0000","up_votes":1,"down_votes":0,"body":"Du hast wohl heut nen Metzger gefrühstückt.","replies":[{"poster":"Angel Ayume","date":"2017-05-31T14:29:52.455+0000","up_votes":5,"down_votes":0,"body":"Siehst du? Das meine ich. :D \nDamit könntest du jeden meinen der jetzt von Wurst geredet hat xD\n\nNutze die Antwort-Funktion xD","replies":[]}]},{"poster":"Markishi","date":"2017-06-04T16:43:20.283+0000","up_votes":4,"down_votes":0,"body":"Meine verehrten Bürger, Ex-Könige und Königskandidaten.\n\nMorgen beginnt die Wahl, daher bitte ich alle, die noch keine Bestätigung oder Ablehnung der Nominierung gegeben haben, dies zu tun, ansonsten gehe ich automatisch von einer Ablehnung aus.\n\nDesweiteren muss ich leider mitteilen, dass SwissKeks aus Zeitgründen nicht bei dem Wahlvorstand zugegen sein kann. Ich verspreche euch jedoch, dass dies die Wahl nicht beeinträchtigen wird. Auch wenn dann im Wahlvorstand die Keks´chere Kompetenz fehlt, werden wir die Wahl fair und mit einem für das Königreich guten Ergebnis abhalten.\n\nMarkishi\nRümmelbierminister\nWahlvorstand der OT-Königswahl","replies":[]},{"poster":"El Pingu","date":"2017-06-02T13:57:59.082+0000","up_votes":4,"down_votes":0,"body":"Auf das das Agresive zum Vorschein kommen möge.\n\nBtw. Wenn sich bis Montag kein Dritter Kandidat meldet, der König werden möchte, werde ich mich doch aufstellen lassen. \n2 Kandidaten? Wir sind doch nicht in Amerika\n\nHier muss man sich nicht zwischen Pest und Cholera entscheiden. Die Leute haben ein Recht dazu, auch Tripper wählen zu dürfen.\n\nLg","replies":[]},{"poster":"Markishi","date":"2017-05-30T16:53:39.828+0000","up_votes":4,"down_votes":0,"body":"Sehr geehrte Bürger des OTs, liebe Ex-Könige, werte Besucher.\n\nGerne übernehme ich, zusammen mit dem Keks (ich hoffe immer noch, der Name ist euch recht), die Leitung der Wahl und garantiere allen eine Faire Wahl.\n\nDa ich als Wahlvorstand dann sowieso unparteiisch sein muss, habe ich mir noch keine Gedanken darum gemacht, wer denn einen guten König oder eine gute Königin abgeben würde.\n\nLasst mich nur folgende Dinge sagen :\n\nErstens : In meiner Funktion als Vertreter der Grünen möchte ich die vollste Unterstützung für das Königreich in dieser Schweren Stunde des Verlustes anbieten. Wir werden helfen, wo wir können. (Vermutlich nur ich, wisst ihr ja, aber ich wollte es trotzdem gesagt haben.)\n\nZweitens: Wer auch immer diese Wahl gewinnt, sollte sich der Pflichten Bewusst sein, die dieses Amt mit sich bringen. Auch wenn ich als Rümmelbierminister weiterhin versuchen werde, jegliche Lasten von des Königs - oder der Königinschulter zu nehmen, so habt ihr doch einiges zu tun, was euch niemand abnehmen kann.\n\nDrittens: Ich werde mein Amt als Rümmelbierminister so lange erfüllen, bis der neu gewählte König oder die neu gewählte Königin eine andere Aufgabe für mich haben oder jemand anderen für diesen Posten im Sinn haben. So lange werde ich, in dieser schweren Zeit, allen, die Rat und Hilfe benötigen, zur Seite stehen. Sucht mich in der Schänke auf, und wir besprechen euer Problem bei einem Krug Rümmelbier.\n\nViertens: Lieber Keks, ich melde mich heute Abend nach dem Stream bei dir, auf dass wir gemeinsam diese Wahl leiten mögen.\n\n\n\nSehr geehrte Bürger, liebe Ex-Könige, werte Besucher,\n\nauf das wir eine faire Wahl haben und unser neues Oberhaupt Eiberts Erbe weiterführen möge!\n\nMarkishi,\n\nRümmelbierminister,\n\nbald wieder mit König","replies":[]},{"poster":"Doenerlord","date":"2017-05-30T13:30:18.846+0000","up_votes":4,"down_votes":0,"body":"Hallo zusammen,\nWie viele von euch bereits wissen, hatte ich in den letzten Wochen nicht besonders viel Zeit und habe daher meine Pflichten im OT vernachlässigt. Da nun erneut die Königswahl ansteht, habe ich mich entschlossen in dieser Sache zumindest noch ein mal Stellung zu beziehen. Aufgrund meiner Inaktivität und der mangelnden Fähigkeit den Überblick im Forum zu behalten, lege ich meinen Posten als Wahlvorstand und Truchsess ab. Als nachfolge schlage ich SwissKeks vor. Er hat sich von sich aus gemeldet und genießt meine volle Unterstützung.\nIch möchte außerdem anmerken, dass das Königreich sich im laufe der letzten Monate stark verändert hat. Wir durften viele neue Mitglieder begrüßen und mussten einige Abschiede erleben. Wie jedes mal, wenn wir die Verantwortung in unsere Hände nehmen und einen neuen König wählen, will ich auch heute wieder eine Rede an meine MitOTler richten, auch wenn ich mich diesmal nicht selbst zur Wahl stellen werde.\nIn den Jahren, die ich im OT verbracht habe, gab es unzählige Könige und Königinnen, doch nur wenige sind als wahre Anführer in Erinnerung geblieben. Leider gibt es Jahr für Jahr immer wieder das Problem, dass die Aktivität aller OTler im Zeitraum der Wahlen enorm zunimmt, doch sobald diese beendet sind im Sand verläuft. Wiederholt konnten wir Könige sehen, die nach einem Monat ihrer Amtszeit im Exil verschwunden sind, abdanken mussten, oder einfach ihre Bürger vernachlässigten. Ich möchte jeden, der sich dazu bereit erklärt an der Wahl teilzunehmen, daran erinnern, dass das Amt eines Königs mehr als nur ein Titel ist. Es bringt ebenso wie jedes andere Rechte und Pflichten mit sich.\nSolltet ihr also daran denken euch zur Wahl zu stellen, seid euch dessen bewusst.\nObwohl ich, wie gesagt, schon einiges verpasst habe und vielleicht nicht mehr besonders am OT beteiligt bin, ist es für mich immer noch ein kleines Stück Zuhause und die Tradition des Herrschers, der nun gewählt werden soll ist ein wichtiger Teil davon. Ich halte es für wichtig eine Person für dieses Amt zu finden, die das OT beständig und mit Herz vertreten kann. Ich glaube zwar, dass einige der neuen Mitglieder noch gute OT-Bürger und uns in vielerlei Hinsicht bereichern werden, allerdings kann ich es nicht vertreten, sie für das Königsamt antreten zu lassen, denn wir können nicht wissen, ob sie weiterhin so aktiv bleiben, wie sie es sind.\nIch hoffe, dass jemand das Amt an sich nimmt, der sich dem OT ebenso verbunden fühlt, wie ich.\n\nDie meisten, der zur Zeit aktiven älteren OTler habe ich selbst noch in unser Königreich aufgenommen. Unser täglicher Umgang (zB. in der Whatsapp Gruppe) ist vielleicht nicht regelmäßig, aber immer offen und freundschaftlich. Einige von ihnen durfte ich auf dem letzten OT-Treffen persönlich kennen lernen. Mit allen habe ich schon gezockt und gemeinsam Spaß gehabt. Einem habe ich sogar eine beträchtliche Summe Geld geliehen, die er dringend brauchte. Ich behaupte sie recht gut zu kennen. Ich bezeichne sie gerne als meine Freunde.\nIch habe lange nachgedacht um meine Entscheidung bezüglich des Nachfolgers von Markus zu treffen. Natürlich ist Becks immer wieder ein guter Mann für diesen Posten und mit seiner freundschaftlich-väterlichen Art hat er schon ein mal einen guten König abgegeben. Dennoch will ich nicht konservativ sein und habe auch die anderen möglichen Kandidaten in Betracht gezogen. Auch Pingu hat schon ein mal dieses Amt bekleidet und kann schon einiges an Erfahrung mit dem OT vorweisen. Als er damals abdankte, hatte er mit einem schweren Schicksalsschlag zu känpfen und ich bin froh, dass er nach seiner Auszeit wieder so gut zurückgefunden hat. Ich freue mich schon auf nächsten Monat, wenn ich mit ihm zusammen besoffen zu Amon Amarth schaukle.\nAuch an Zamo habe ich gedacht, der zu einem der ältesten OTler hier zählt und sich sehr für das OT eingesetzt hat. Als das Forum aus dem LoL Bereich verdrängt wurde, gab er uns Obdach und stellte ein Forum zur Verfügung, dass wir unter anderem für die Wahl des Königs nutzen konnten. Wie ich, ist er leider sehr beschäftigt und ich kann es ihm nicht verübeln, dass er sich auf anderes konzentriert.\nGerne würde ich jedem meiner Freunde hier ein paar Worte widmen, doch ich will euch armen Leute ja auch nicht unnötig mit Geschwafel eindecken.\nDarum komme ich so langsam mal zum Punkt.\nIch hätte nie gedacht, dass ich das mal sagen würde, aber: Ich schlage King Prow für die Wahl vor.\nEr ist immer aktiv, hängt sich mit voller Leidenschaft in die Sachen des Königreichs und bringt immer wieder frischen Wing in das Forum. Nun da er und so lange dabei ist, hat er sich diese Anerkennung redlich verdient.\nUnd damit will ich wie immer die Vorwahlzeit einleiten.\nMögen die Wahlen beginnen!\n\nLiebe Grüße,\nEuer Doenerlord","replies":[]},{"poster":"Shianmaon","date":"2017-06-02T12:43:52.232+0000","up_votes":3,"down_votes":0,"body":"Bürger des Königreiches OT,\n\nich habe euer Treiben in der Schenke lange unauffällig und bis vor kurzem auch unsichtbar beobachtet und mich umgehört. Ich möchte euch mein Beileid aussprechen. Der Verlust Eiberts muss echt schwerwiegen aber zum Glück habt ihr ja den Zwerg der weiter Rümmelbier braut. \n\nAußerdem würde ich gerne in eurem Königreich schutz suchen.","replies":[{"poster":"Shacoláde","date":"2017-06-02T16:33:19.366+0000","up_votes":3,"down_votes":0,"body":"Ich bin zwar noch nicht alle zu lange her,\naber was mir negativ an dir aufgefallen ist,\n.\n.\n. \ndass du noch keine Shacoskinidee eingereicht hast :(","replies":[]},{"poster":"Eibert Rümmel","date":"2017-06-02T16:37:16.081+0000","up_votes":2,"down_votes":0,"body":"-Schänkenbesucher\n-Ts besucher\n-Beteiligung an Forenspielen\n\nOb er einen Teemohut hat oder Teemo spielt weiss ich nicht, trotzdem befürwortet","replies":[]}]},{"poster":"La vida Loca 38","date":"2017-06-02T11:40:59.444+0000","up_votes":3,"down_votes":0,"body":"Möge der/die beste König/in gewinnen und die netten Gesten und lustigen Threads des OT Königreichs weiterführen. Bin zwar kein Bürger des OT Königreichs jedoch wünsche ich euch eine frohe aber vorallem faire Wahl :).\n{{sticker:slayer-jinx-wink}} \n\n\n\nIch persönlich würde eine Königin bevorzugen um die weibliche Note in den höheren Positionen zu erhalten ;).","replies":[]},{"poster":"Kind Prow","date":"2017-05-31T14:16:22.015+0000","up_votes":2,"down_votes":0,"body":"Der Zweg wird zum Wurstfanatiker...","replies":[{"poster":"dêr zwerg","date":"2017-05-31T14:26:07.993+0000","up_votes":3,"down_votes":0,"body":"Schinken mag ich auch und Schinken ist keine Wurst","replies":[{"poster":"dêr zwerg","date":"2017-05-31T14:26:35.198+0000","up_votes":2,"down_votes":0,"body":"Schinkenwurst ist aber Wurst","replies":[{"poster":"Shacoláde","date":"2017-05-31T14:33:06.249+0000","up_votes":2,"down_votes":0,"body":"aber kein schinken mehr {{sticker:zombie-brand-clap}}","replies":[]}]}]}]},{"poster":"El Pingu","date":"2017-05-31T14:13:24.350+0000","up_votes":3,"down_votes":0,"body":"Ich bin kurz davor, mich doch aufstellen zu lassen i.i\n\nEin Königreich ohne Wurst?\nVerdammt, wollt ihr \"Veganien\" Gründen?\nBitte denkt an eure Wähler!!!","replies":[]},{"poster":"Zamonianer","date":"2017-05-30T21:04:17.052+0000","up_votes":3,"down_votes":0,"body":"Endlich, endlich weiß ich, was mir hier die ganze Zeit so komisch vorkam:\nPingu hat den Thread nicht \"Walvorbereitung\" genannt...\n\nGruß\nZamo","replies":[]},{"poster":"Zamonianer","date":"2017-05-30T17:32:47.879+0000","up_votes":3,"down_votes":0,"body":"Also, um den Beitrag dann hier endlich mal fertig zu bekommen:\n\nZu 1)\nEs ist keine schlechte Idee, dass alle die wählen wollen, kurz auf ihre Wahlberechtigung überprüft werden, aber das sollte nicht den normalen Aufnahmevorgang stören.\nHeißt, jeder darf weiterhin überall auf jede mögliche Art im Forum aufgenommen werden, wenn er kein fieser Troll ist, aber um bei dieser Wahl mitwählen zu dürfen, wird dann eine Bestätigung benötigt.\nWie ich hier und hin und wieder auch mal dort sagte, bin ich absolut kein Freund irgendwelcher Ideen, die es Neuen schwerer macht, Bürger zu werden oder zu irgendwelchen Formalitäten zwingt.\n\nZu 3)\nGrundsätzlich bin ich ein Freund geheimer Wahlen, weshalb ich eben gerne per Umfrage oder auch per PN an den Wahlvorstand wählen können würde.\nIm externen Forum können wir dabei genauso gut Smurfs von Wahlmanipulationen abhalten, da in das interne Forum nur bestätigte OTler können.\nUnd wenn wir ja eh nur OT-Bürger abstimmen lassen, haben wir uns ja sowieso schon abgekapselt, ob wir dafür dann noch die Seite wechseln ist da doch eigentlich recht egal, oder?\n\nGruß\nZamo","replies":[]},{"poster":"Neamhoilte","date":"2017-05-30T13:24:42.770+0000","up_votes":3,"down_votes":0,"body":"Äh Pingu. Wo hab ich denn offiziell zugesagt?  :D\n\nGruß OT Becks\n\n\nP.S. Ohne siegreiche Urgot Skin geht hier garnix","replies":[]},{"poster":"Der Großmugister","date":"2017-05-30T10:19:17.361+0000","up_votes":3,"down_votes":0,"body":"Wie schon vor 2 Jahren, als ich dem OT beigetreten bin, will ich mich auch heute wieder dafür aussprechen, dass der Wahlkampf und auch die Wahl selbst, in diesem Forum stattfinden sollte!","replies":[]},{"poster":"Maexle","date":"2017-06-06T20:19:08.657+0000","up_votes":2,"down_votes":0,"body":"Und an einer Straßenecke steht ein einsamer Teemohut träger, der ab und zu \"Wählt Maexle- KP stinkt\" sagt.\n{{champion:17}}","replies":[]},{"poster":"Maexle","date":"2017-06-03T16:17:59.562+0000","up_votes":2,"down_votes":0,"body":"Sehr gut Pingu {{sticker:slayer-pantheon-thumbs}} \n{{champion:17}}","replies":[]},{"poster":"El Pingu","date":"2017-06-03T14:24:45.094+0000","up_votes":2,"down_votes":0,"body":"Die Königsvorschläge sind nun auf dem neuesten Stand","replies":[]},{"poster":"Kind Prow","date":"2017-06-02T16:53:13.988+0000","up_votes":2,"down_votes":0,"body":"Also einstimmig angenommen, oder wie? ^^","replies":[]},{"poster":"The mute Swan","date":"2017-05-30T19:46:44.418+0000","up_votes":2,"down_votes":0,"body":"So, liebes Forum, liebes OT, \n\nAngesichts der wahlen werde ich KP wählen und unterstützen. Das sollte an sich keine überraschung sein. Aber ich wähle ich nicht nur weil ich ein troll bin und die welt brennen sehen will, sondern auch weil ich ihn für am besten geeignet halte von allen kandidaten.\n\nKP war immer recht aktiv im Forum und auch wenn es manchmal nervt, dass er bestimmte funktionen ignoriert, so kann ich unter jedem fred den ich lese und upvote für gewöhnlich einen mehr oder weniger manchmal dämlichen kommentar von ihm lesen.\nZudem sozialisiert er gerne. Er geht auf neulinge zu, auch auf ältere die wieder dazukommen und auch auf alle anderen. Tatsächlich ist KP so kontaktfreudig, dass ich mich manchmal frage ob er noch ein RL hat...\nWeiterhin hat er auch noch ein gewisses maß an verantwortungsbewusstsein. Das merkt man wenn man mit ihm spielt, z.b. gibt er dinge auf die ihn nach vorne bringen könnten, wie farm, wenn er sieht dass ihn itgendwo irgendwer braucht. Auch beim turnier opa vs ot hat er viel in die hand genommen. Er hat mit rümmel einen Stream auf die beine gestellt und nebenbei mehr schlecht als recht ein team organisiert.\n\nNochmals, von den qualifikationen halte ich kp mehr als geeignet. Und tatsächlich halte ich es auch für möglich, dass er die Wahlen gewinnt. Viele der älteren haben sich für ihn ausgesprochen und grade die älteren haben meistens etwas mehr Einfluss von der meinungsgebung her.\n\nAls mir klar wurde dass KP die wahl tatsächlich gewinnen könnte, wurde mir dann doch etwas bange. Ihr dürft nicht vergessen, KP bleibt KP. Daher bräuchte er ein gegengewicht, jemand, der ihm auch mal auf die nase haut, wenn er es zu bunt treibt. Das kann entweder eine bestimmte person sein oder auch das ganze ot.\n\nAber ich denke doch, bei KP wäre das amt gut aufgehoben. Ach ja und als kleine motivation @KP: wenn du die wahlen gewinnst, sage ich dir meinen alten nick.\n\nSvenson out.","replies":[]},{"poster":"Kind Prow","date":"2017-05-30T17:32:10.223+0000","up_votes":2,"down_votes":0,"body":"Naja, ich weiß nicht. So häufig schaut sie ja nich ins Forum und ob sie als Königin das OT wachhalten kann bezweifle ich. Aber immerhin sieht sie mit Teemohut super aus ^^","replies":[]},{"poster":"Maexle","date":"2017-05-30T17:30:03.307+0000","up_votes":2,"down_votes":0,"body":"Ich schlage SuperKahlan als Königin vor. Sie ist es ja nach der königlichen Hochzeit eh schon und ich bin überzeugt, dass sie eine gute Figur abgeben würde ( laut Eibert braucht sie dafür nichtmal mehr einen Teemohut). \n{{champion:17}}","replies":[]},{"poster":"Megamaexx","date":"2017-05-30T11:29:40.082+0000","up_votes":2,"down_votes":0,"body":"Ich wähle  Shácolade! Oh Moment, ich gehöre ja gar nicht zum Königreich. Hat man Wahlrecht als Bewohner der Grenzlande?","replies":[{"poster":"Zamonianer","date":"2017-05-30T14:38:21.826+0000","up_votes":2,"down_votes":0,"body":"Da deine Grenzlande im Grunde nur einen Katzensprung von unserem Königreich entfernt sind und deinen Nachbarn als guter Nachbar in Erinnerung bist, wäre es uns eine Freude, dich als Bürger des OTs zählen zu dürfen.\nDamit dürftest du dann selbstverständlich auch wählen, nur Beitreten musst du dann doch noch ;)\n\nGruß\nZamo","replies":[{"poster":"Megamaexx","date":"2017-06-04T20:16:13.619+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zamonianer,realm=EUW,application-id=YnZkMR0R,discussion-id=MHhsfYV9,comment-id=00090002,timestamp=2017-05-30T14:38:21.826+0000)\n>\n> Da deine Grenzlande im Grunde nur einen Katzensprung von unserem Königreich entfernt sind und deinen Nachbarn als guter Nachbar in Erinnerung bist, wäre es uns eine Freude, dich als Bürger des OTs zählen zu dürfen.\n> Damit dürftest du dann selbstverständlich auch wählen, nur Beitreten musst du dann doch noch ;)\n> \n> Gruß\n> Zamo\n\nAuch an dich meinen Dank, den ich schon dem Zwerg und Maexle gegeben habe. Eines Tages vielleicht, aktuell habe ich jenseits der Grenzen des OTs zu tun.","replies":[{"poster":"Zamonianer","date":"2017-06-04T20:50:42.793+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank für deinen Dank :)\nIst natürlich kein Problem, wenn du jetzt gerade noch nicht möchtest / kannst, aber wenn du nur deshalb nicht beitreten möchtest, weil du gerade nicht so viel Zeit hier hättest, sei dir versichert, dass wir keine Mindestaktivität erwarten.\n\nGruß\nZamo","replies":[]}]}]},{"poster":"5weeds","date":"2017-05-30T12:25:34.079+0000","up_votes":2,"down_votes":0,"body":"Schácolade genießt mein Wohlwollen in dieser Sache.\nAuch wenn die Stimme eines Autländers wahrscheinlich nicht zählt, wollt ich dass mal kundtuen ^^","replies":[]},{"poster":"dêr zwerg","date":"2017-05-30T11:32:34.410+0000","up_votes":2,"down_votes":0,"body":"du kannst dich gerne bewerben und Eibert als deinen Fürsprecher angeben ;)","replies":[{"poster":"Maexle","date":"2017-05-30T12:04:45.713+0000","up_votes":2,"down_votes":0,"body":"Und mich. Allein wegen des Namens \n{{champion:17}}","replies":[{"poster":"Megamaexx","date":"2017-06-04T20:09:46.690+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=dêr zwerg,realm=EUW,application-id=YnZkMR0R,discussion-id=MHhsfYV9,comment-id=00090000,timestamp=2017-05-30T11:32:34.410+0000)\n>\n> du kannst dich gerne bewerben und Eibert als deinen Fürsprecher angeben ;)\n\n\n> [{quoted}](name=Maexle,realm=EUW,application-id=YnZkMR0R,discussion-id=MHhsfYV9,comment-id=000900000000,timestamp=2017-05-30T12:04:45.713+0000)\n>\n> Und mich. Allein wegen des Namens \n> {{champion:17}}\n\nIch danke euch zwei, aber ich bin wohl zu selten im OT unterwegs und die Grenzlande sind nun mal mein Gebiet. Ihr werdet wohl dennoch ab und zu von mir hören, auch wenn ich mich eurem Königreich nie anschließen werde. Zumindest noch nicht. Vielleicht werden mir meine Grenzlande auch eines Tages zu öde und ich werde mich zu euch begeben.","replies":[]}]}]}]},{"poster":"Kind Prow","date":"2017-05-30T14:32:44.314+0000","up_votes":2,"down_votes":0,"body":"Komm, mach doch mit, je mehr desto besser :<","replies":[]},{"poster":"Angel Ayume","date":"2017-05-30T14:13:36.085+0000","up_votes":2,"down_votes":0,"body":"Ich möchte an dieser Stelle die Nominierung zur Königin ablehnen. Es gibt sicher den einen oder anderen der für mich gestimmt hätte und dafür bin ich auch sehr dankbar und ich fühle mich geehrt. Aber ich bin selbst erst eines der ganz neuen Mitglieder, erst seit ein paar Monaten dabei. Andere, die das OT und ihre Bürger viel länger kennen, sich viel mehr für dieses eingesetzt haben und viel mehr Erfahrung mit sich bringen, haben meiner Meinung nach mehr das Recht König zu werden. \nDeswegen bedanke ich mich für die Nominierung und wünsche allen Kandidaten die die Nominierung annehmen viel Glück. \n\nUnd im Namen des Engels sage ich: Ich werde euch, neuer König, stehts mit Rat und Tat zur Seite stehen. Es ist jedoch euch überlassen, welches Amt ich bekleide. Ob ich weiterhin Beraterin bleibe, ist euch überlassen.","replies":[{"poster":"Eibert Rümmel","date":"2017-05-30T14:26:05.704+0000","up_votes":2,"down_votes":0,"body":"Also das Argument lass ich nicht gelten. Länger war ich auch nicht im Ot, als ich König wurde.... Ich denke die Unbefangenheit war meine größte Stärke. Ich persönlich bin personenunabhängig für einen jungen Otler ;)","replies":[]},{"poster":"Shacoláde","date":"2017-05-30T14:17:28.502+0000","up_votes":2,"down_votes":0,"body":"{{item:3151}}  {{item:3070}} {{item:3070}} {{item:3070}}","replies":[]}]},{"poster":"Kind Prow","date":"2017-05-30T14:24:41.148+0000","up_votes":2,"down_votes":0,"body":"Shaco for the King! Oder wir machen endlich mal dieses Duomvirat, von dem ich seit Pingus Abtritt fasziniert bin.","replies":[]},{"poster":"Kind Prow","date":"2017-05-30T10:10:33.427+0000","up_votes":2,"down_votes":0,"body":"Och du Charmeur ^.^\nIch werd ja ganz rot, du meine Güte.\n\nNun zu den rationalen Dingen des Lebens. (yey, ich habe eine wichtige Aufgabe)\nWie ich schon in der WA Gruppe gesagt habe, bin ich auch dafür, dass wir wieder in diesem unserem Stammforum wählen. Mit der Art die du vorgeschlagen wär ich zufrieden, und denke dass dadurch auch gut Smurfs verhindert werden.\nAllerdings bin ich dafür, Swisskeks, unseren neutralen Schweizer, zum Wahlvorstand zu ernennen, da er ja im Grunde schon das Amt von Döni übertragen bekommen hat. (und ich Markishi gerne Steine in den Weg lege, aber egal, ich hab ne Aufgabe, yey ^^ )\nZu guter letzt wäre ich auch für einen Frischling als König, und würde daher auch Shacolade nominieren, der als unser Narre im Forum auch sehr aktiv ist und im Grunde ja ein Nachkomme von Eibert ist. Außerdem kann er übel gut casten. (wie sein Vater :P )\n\nBei den Terminen.. ich denke die paar tage halten wirs im Königreich aus ohne König und irgendwie sollten wir auch noch den leuten die nur am Wochenende posten (können) ne Chance geben.\n\nEdith: Yey, ich bekomm ne Aufgabe ;D","replies":[{"poster":"Shacoláde","date":"2017-05-30T11:02:15.300+0000","up_votes":1,"down_votes":0,"body":"> Zu guter letzt wäre ich auch für einen Frischling als König, und würde daher auch Shacolade nominieren, der als unser Narre im Forum auch sehr aktiv ist und im Grunde ja ein Nachkomme von Eibert ist. Außerdem kann er übel gut casten. (wie sein Vater :P )\n\nDanke dir KP  :) Mit diesen freundlichen Worten habe ich nicht gerechnet ^^. \nDas casten hat wirklich mehr Spass gemacht als Gedacht <3.\n\nIn diesem Zuge würde ich auch gern  **Angel Ayume ** nominieren.  Ein Frau als Königin hatte wir noch nie (Edit außer Yashia und aktuell Superkahlan) und ein bessere als sie kann ich mir nicht vorstellen. Stehts zuvorkommend, freundlich, hilfsbereit und nimmst sich selbst für andere zurück.  Richtig wertschätzen tu ich sie aber erst, als sie letzents sagte: \"Nein, ich will mit keinen Smurf zusammenspielen um zu climben. Ich will es selbst schaffen oder gar nicht, denn dann habe ich es auch nicht verdient.\" Und das rechne ich hier hoch an.","replies":[{"poster":"El Pingu","date":"2017-05-30T11:04:53.414+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Shácolade,realm=EUW,application-id=YnZkMR0R,discussion-id=MHhsfYV9,comment-id=00000001,timestamp=2017-05-30T11:02:15.300+0000)\n>\n.  Ein Frau als Königin hatte wir noch nie \n\ndoch, Yashia und ich sehe aktuell Superkahlan auch als meine Königin an. Daher ist sie im Gremium!\nHeirat ist Heirat :P\n\nich hab Angel Ayume hinzugefügt","replies":[{"poster":"dêr zwerg","date":"2017-05-30T11:12:15.154+0000","up_votes":1,"down_votes":0,"body":"genau kniet nieder vor Kahlan :)","replies":[{"poster":"Shacoláde","date":"2017-05-30T11:16:26.733+0000","up_votes":2,"down_votes":0,"body":"#Memmo an mich selbst!! \n(Fällt das überhaupt auf wenn ein Zwerg kniet? Seine Füße werden eh durch seinen Bart versteckt. Und die 2 cm wird keiner bemerken. Vielleicht meint er das auch nur bildlich... muss ich bei Gelegentheit in Erfahrung bringen!?!\nOder soll wir knien, sodass er nicht mehr der Kleinste im Raum ist.... mh)\nEgal ...{{sticker:zombie-brand-clap}}","replies":[]}]}]}]}]},{"poster":"Kind Prow","date":"2017-06-06T19:59:14.128+0000","up_votes":1,"down_votes":0,"body":"Von jeder Wand glotzt der Nekromant... beziehungsweise ein Abbiblung seines Gesichtes auf einem Poster. Kein freier Platz ist geblieben, die Untoten haben die Stadt zutapeziert.","replies":[]},{"poster":"El Pingu","date":"2017-06-05T20:16:40.466+0000","up_votes":1,"down_votes":0,"body":"Irgendwo in der Ecke steht ein einsamer Pingu mit einem Schild hoch in die Luft gestreckt \"wählt mich!\"\nEvtl sollte er doch einmal diese neue Erfindung namens \"kleber\" ausprobieren. Angeblich bleiben die Plakate dann von alleine, wie durch Zauberhand an der Wand hängen.\n.... Aber das ist zu verrückt, als das es wahr sein kann.","replies":[]},{"poster":"Kind Prow","date":"2017-06-05T10:13:18.751+0000","up_votes":1,"down_votes":0,"body":"Auf der Straße erschrecken die Menschen: riesige bis winzige verfaulte und nur teilweise erhaltene Wesen watscheln mit Pappaufstellern behängt durch die Straßen. Von überall her tönt es: wählt den Nekromanten, Gründe gibts genug, halt die Fresse, ich hab auch keine Ahnung...","replies":[]}]}