{"poster":"El Pingu","date":"2015-09-29T17:35:13.143+0000","title":"Gewinnspiel: belanglos aber spannend","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Halli hallo, liebe otler.\r\nEben habe ich in der offtopic whatsapp Gruppe in einem Gewinnspiel ein beschw&ouml;rerbild gewonnen. Aber da ich seid Urzeiten das selbe Beschw&ouml;rer Bildchen habe, habe ich mich entschlossen dieses weiter zu vererben, mit einem Gewinnspiel. \r\n\r\nDie Herausforderung ist ganz einfach:\r\nPostet ein absolut belangloses Bild und schreibt eine &auml;u&szlig;erst spannende Geschichte dazu. Derjenige mit dem besten Endergebnis gewinnt.\r\n\r\nDer Gewinner darf sich aussuchen: entweder ein beschw&ouml;rerbild seiner Wahl, oder ein steamspiel aus meiner Bibliothek. Der 2platzierte bekommt das jeweils andere.\r\nKeep it on,\r\n- euer Pingu\r\n\r\nP.s. Einsendeschluss ist morgen, 21 uhr","replies":[{"poster":"Kryptonq","date":"2015-10-04T18:10:40.589+0000","up_votes":1,"down_votes":0,"body":"Hey Pingu,\nSchön, dich mal wieder zu sehen. Eine Anregung/Bitte/wasauchimmer:\nDu könntest doch den Verschenke eine Rose Thread unter Einbeziehung von Zamos neuer Rosenseite editieren, denn das, was gerade dransteht ist alles andere als aktuell ;)\nSchöne Grüße","replies":[]},{"poster":"El Pingu","date":"2015-10-01T11:28:50.211+0000","up_votes":1,"down_votes":0,"body":"Sry Becks. Ich bewertet alle Geschichten und geb die Gewinner heute nach Feierabend (gegen 0 Uhr) bekannt","replies":[]},{"poster":"Neamhoilte","date":"2015-09-30T19:59:08.098+0000","up_votes":1,"down_votes":0,"body":"Yo Pingu,die Zeit ist rum. ; )","replies":[]},{"poster":"Eibert Rümmel","date":"2015-09-29T21:56:49.462+0000","up_votes":1,"down_votes":0,"body":"http://ecx.images-amazon.com/images/I/31UttqjA9lL.jpg\nedit da Geschichte vergessen :O\n\nals waschechter Teemo Fan bin ich selbstverständlich Inhaber eines Teemo Hutes. Schließlich kann man die Dinger ja schon für ein Paar Euro sich aus China kommen lassen. Nur was macht man dann damit ? In den Supermarkt will man dann ja vielleicht doch nicht damit. Und zum zocken ist er einfach zu warm. Klar 1-2 Spiele kann man schon mal schwitzen, um das gute Ding einzuweihen. Aber um ihn zur Zierde irgendwo rumliegen zu lassen, ist er einfach viel zu coool :)\n\nTrotz des geringen Preises ist er anständig verarbeitet und vor dem Spiegel, musst ich echt feststellen, dass er mir auch noch extrem gut steht. Doch er versauerte troztallem weiterhin auf der Spitze meines Kleideständers und erfreute mich lediglich wenn ich mir morgens vor der Arbeit meine jacke überzog. Da muss eine würdige Daseinsberechtigung her, so viel stand fest. Ich überlegte schon ob ich mit einem Rasperry Py einen Teemoroboter zu bauen. Hatte dann aber zu wenig coole Ideen was das Ding so können soll.\n\nSchließlich kam der Tag, der alles ändern sollte. Ich beschloss meinen Geburtstag zu feiern. Und stand vor der Herausforderung, die passende Bekleidung für einen Gartenpartymarathon zu wählen. Und da wurde mir klar: \"Ey das ist meine Party. Da muss ich mich nicht verkleiden. Da kann ich genauso sein wie ich will und setzte mir meinen Teemo Hut auf und ging los.\n\nDas Feedback war überwältigend. Bei den Kiddis stand ich noch höher im Kurs als sonst. Meine Zockerkumpels fandens eh geil. Den ein oder anderen hab ich damit als LOL Zocker enttarnt. Ein liebevolles \"Ich hasse Teemo\" hier oder \"Satan\" da. Von der Damenwelt hab ich auch sehr viele Komplimente eingestrichen. Leider nicht für mein grandioses Aussehen, sondern nur für meinen Hut. Jede wollte ein Bild machen mit dem Hut auf dem Kopf und ey Frauen mit Teemo Hut sind echt Sexy!\n\nAls es dann auch noch kurz zum Nieseln anfing.... man waren die da alle neidisch auf meinen Zauberhut. Als dann der viel zu knapp bemessene Biervorrat zu Ende ging, sagte ein Freund zu mir. Kein Problem, leih mir einfach kurz deinen Hut! Kurze Zeit später war der Hut voller Geld und nochmal kurz darauf standen wieder Kästen rum. Dieser Zauberhut löste einfach alle Problemchen und war natürlich auch dazu bestimmt zu späterer Stunde Tabak, Blätchen und co zu beherbegen, so dass er auch der eindeutige Sieger der After Hour war und begehrter als die letzten Steaks ;)\n\nMein Teemo Hut hat endlich seine Bestimmung gefunden. Er ist ein nicht mehr wegzudenkendes Party Zubehör, dass sich auf nur einer Feier bereits zur Legende gemacht hat.\n\nEin Bericht aus dem Real Life\neuer Eibert\n","replies":[]},{"poster":"SoloQisMentlBoom","date":"2015-09-29T21:45:44.519+0000","up_votes":1,"down_votes":0,"body":"http://i.ytimg.com/vi/UJ8cfQ7rrvM/hqdefault.jpg\n\nEs war einmal ein hässlicher Blaubarsch. Der war so hässlich das alle Leute gestorben sind. ENDE!","replies":[]},{"poster":"El Pingu","date":"2015-09-29T17:41:17.923+0000","up_votes":1,"down_votes":0,"body":"Antworten könnt ihr entweder hier oder in der offtopic whatsapp Gruppe. (Sry min Handy kann ich den post oben nicht editieren)","replies":[]}]}