{"poster":"Chimerageist","date":"2016-01-02T01:46:12.153+0000","title":"Case Study: \"Robot\" Players on the Rise","subforum":"Help & Support (OCE)","embed":{"description":"Every game is a story; visit the new League of Legends match history to check out how this one ends and share your own!","url":"http://matchhistory.oce.leagueoflegends.com/en/#match-details/OC1/117310435/200495576?tab=overview","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":2,"down_votes":0,"body":"This is unlikely the first time this has happened to someone, nor the first time someone has thought &quot;if they have time to make new content all the time, or enough money to host extravagant tournaments, like, five times a year...&quot;, it seems that there are better things that may be done with at least the time, such as maintaining some sort of integrity when it comes to account security or even &quot;client&quot; security. If you look at [the link I have provided](http://matchhistory.oce.leagueoflegends.com/en/#match-details/OC1/117310435/200495576?tab=overview), this is what occurred today; I was matched with four other players, of which I have a sneaking suspicion were all (subject to opinion) using some form of third-party &quot;botting&quot; software.  Counting back to two weeks ago, it was fairly commonplace where one or two players were &quot;botting&quot;, possibly up to three players; however, when it comes to your entire team, intentionally feeding or whatnot, this is the point were one must ask: how does this even happen? Who is there to protect the integrity of YOUR product?\r\n\r\n...but that&#039;s not all...\r\n\r\nHow long will it be before some wiseacre determines how to reverse the process, taking information from the server? How many players have made purchases through your client, and how many of those would be susceptible to such an intrusion?\r\n\r\nWhile there are many would simply beg, plead, even grovel to your fellow staffers to fix the issue, I must beg to differ; you had your chance. You must take action, or you risk losing control of what you have created here. So, get to it.","replies":[{"poster":"Deep Terror Nami","date":"2016-01-04T06:39:32.297+0000","up_votes":1,"down_votes":0,"body":"As long as there is a market for new, pre-leveled accounts, there will always be bots. Riot does their best to ban them en masse as they come through, but they'll always be out there for a little while before getting caught. Just contribute to getting rid of them by remembering to report them for **Cheating** (make sure it's not just a bad brand new player that doesn't speak english, though).\n\nIf you need to report a player outside the post-game lobby, you can submit a [Support Ticket](https://support.riotgames.com/hc/en-us/requests/new).","replies":[]}]}