{"poster":"La Gran Piña","date":"2015-02-02T02:17:32.012+0000","title":"como juego contra una cassio?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"es muy dificil porque te rentaliza y después su ulti no se que hacer  ayúdenme en mi opinión necesita un nerfeo\r\n\r\n{{champion:69}}","replies":[{"poster":"Skyllnex","date":"2015-02-03T04:26:26.744+0000","up_votes":1,"down_votes":0,"body":"esquiva su Q y su W, aléjate de la cassio cuando estés envenenado, de ser posible devuelvele el pokeo y a lvl 6 trata de baitear su R de forma que tu personaje no la vea directamente (si lo haces bien solo te ralentizara unos segundos)","replies":[]},{"poster":"Excorpion","date":"2015-02-02T07:42:44.260+0000","up_votes":1,"down_votes":0,"body":"Evita los pozos del suelo (los evito con Malzahar, no lo evitarás con algo más...)\ny tendrás un camino más libre para atacar dado su gran cd\nsi vez que cassio usa mal la habilidad del colmillo, espera a que termine, y atacala con ganas, le meterás un buen daño a cambio de poco por parte de ella","replies":[]},{"poster":"JinxPagaLaCoca","date":"2015-02-02T04:57:11.398+0000","up_votes":1,"down_votes":0,"body":"naa viejo no es tan complicado igual depende de con quien le juegas un {{champion:157}}  sufre mucho o cualquier mid melee la idea de jugar contra ella es esquivar su Q y su W, si te da con alguna alejarse de ella ya q su E Tiene 0.5 de enfriamiento en enemigos envenenados tienes q esquivar y pokear hace poco juge contra una y yo fui con {{champion:84}}  y asi lo hice esquibe y si me daba me alejaba de ella ya en nivel 6 pumm exploto jaajja me dio pena pero piensa en q su ulti es su unico medio de escape si no tiene flash y si ves q la puedes matar te mandas pero trata de no ir bajo de vida o te tira ulti una W ,E y adios. En general esquiva sus habilidades juegale pasivo y apenas tu jg te ayude la rebientas las {{champion:69}}  dependen mucho de sus habilidades y son todas skillshot menos su E asi q esquiva poke y sera facil.","replies":[]},{"poster":"WuqCT","date":"2015-02-02T04:38:12.595+0000","up_votes":1,"down_votes":0,"body":"Esquiva la Q.\nY alejate de ella si te dio con la Q, porque la E tiene 0.5s de enfriamiento si pasa eso.\nDespués algo de resistencia mágica","replies":[]},{"poster":"GaßY","date":"2015-02-02T02:34:36.997+0000","up_votes":1,"down_votes":0,"body":"Conseguí resistencia mágica, y no creo que necesite un nerfeo '-'.","replies":[]}]}