{"poster":"Rémy the rat","date":"2016-12-07T03:14:46.336+0000","title":"Wann werden Stuns/Festhalten/Slows generft?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":25,"body":"Da es ja immer l&auml;cherlicher mit den Stuns etc. wird, sollte man diese irgendwann doch mal nerfen, oder?\r\nZumal viele Stuns extrem einfach zu treffen sind. Als Singed zum Beispiel hat man kaum Chancen, weil in jedem Spiel 4 von 5 stunnen, slowen, festhalten etc. k&ouml;nnen. Das ist einfach viel zu viel und l&auml;cherlich.\r\n\r\nUnd an die Oberpros, die immer alles kaputtmeckern, weil sie ja &uuml;bergut sind und Riot alles richtig macht (komplett verkehrt), bitte haltet eure Internetgangsterfinger still.\r\n\r\nUnd:\r\nWieso darf Graves keine Zigarre haben, aber jeder zweite Champ eine WAFFE?\r\nIch wei&szlig;, das liegt eher an den Staaten, aber wenn Riot Eier h&auml;tte, w&uuml;rden sie es drinlassen.","replies":[{"poster":"Patter1991","date":"2016-12-07T07:38:27.805+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Rémy the rat,realm=EUW,application-id=Wj1wcocU,discussion-id=EQ8YIWKV,comment-id=,timestamp=2016-12-07T03:14:46.336+0000)\n\n> Und an die Oberpros, die immer alles kaputtmeckern, weil sie ja &amp;uuml;bergut sind und Riot alles richtig macht (komplett verkehrt), bitte haltet eure Internetgangsterfinger still..\n\nMit anderen Worten: \"ich bin an keiner Diskussion interessiert und will nur, dass alle mit mir meckern und weinen\".","replies":[]},{"poster":"RAG Ryve","date":"2016-12-07T04:38:46.886+0000","up_votes":5,"down_votes":0,"body":"Du bist hier eindeutig im falschen Game Genre unterwegs wie mir scheint. \nWas soll denn ein Moba deiner Meinung nach sein, only Dmg Spells ohne CC damit sich alle ohne Unterbrechung aufs Maul geben? \nAlso ich hab in den letzten Wochen so einiges gelesen aber du mein Herr, du verdienst den Preis für \"Unnötigste Forderung in LoL\" diesen Monat.\n\nUnd mal ehrlich, ich bin mir nichtmal sicher ob das ein Trollpost ist denn diese letzte Aussage bezüglich der Zigarre, da sollte dir klar sein das ein Unternehmen sich nicht gegen Gesetze erheben kann oder einfach Strafen oder schlimmere Dinge in Kauf nimmt nur um ne blöde Zigarre ins Spiel zu implementieren.\n\nAuf ne Diskussion bezüglich des CC´s lasse ich mich garnicht erst ein, das ist hier wirklich überflüssig.","replies":[]},{"poster":"Megamaexx","date":"2016-12-07T05:43:06.021+0000","up_votes":3,"down_votes":0,"body":"Genau, wir nehmen einfach die Stuns und schieben sie woanders hin.\nSind die erst mal weg, muss man nur noch Voli, Singed, Garen und alles was Lauftempo for free bekommt nerfen, da man ja kein Counterplay mehr hat und wirklich jeder darf sich dann beschweren. \n\nDie meisten Formen von CC sind skillabhängig, also ist es erst mal wichtig, dass man auch trifft. Als Singed ist man für gewöhnlich schnell genug, um dem CC oft ausweichen zu können. Vielleicht liegt es also nicht daran, dass CC stark ist, sondern daran, dass dir vielleicht etwas Skill fehlt. Also übe einfach, besser auszuweichen. Übrigens hat Singed auch einen Slow ;)","replies":[{"poster":"DontKillMySoraka","date":"2016-12-07T12:36:48.414+0000","up_votes":1,"down_votes":0,"body":"sogar einen Root, wenn gut getimed :P","replies":[]}]},{"poster":"dNiW","date":"2016-12-07T04:45:19.469+0000","up_votes":2,"down_votes":1,"body":"Vorweg ich bin kein Überpro , nichtmal Durchshcnitt bin nur Silber 3, also gehöre zum Bodensatz im Spiel. Ist halt so^^\nIch verstehe den Frust über Hard CC ich selber hasse es gegen z.B. Leona zuspielen. Da hilft nur:\n\n1. Nutze die CC für Dich\n2. Wenn der Gegner seine CC verfehlt, bestrafe den Fehler\n\nIch bin teilweise deiner meinung, habe früher viel Janna gespielt, aber das ist in meiner Elo( Silber) leider zu Teamabhängig und eine Leona/Nautilus\nist annoying ohne Ende für mich. ABER:\n- ich könnte mit viel Übung z.B. Leona noch in ihrem e der als vorraussetzung für den q wichtig ist austricksen\n\nIch würde Euch beiden Recht geben, so doof wie das klingt.\n\nCC ist nervig teilweise OP wenn gute Spieler die CC nutzen, aber der Trick ist , dass viele Champs diese CC treffen MÜSSEN.\nWer CC verfehlt muss / kann die Quittung kriegen. \nGar nicht solange her da war Veigar wirklich stark, jetzt hat man das shcon fast vergessen. Früher war der echt Idiotensicher, da hab ich sogar mit dem\ngewonnen XD\n\nSo genug Senf hinzugegeben, nur meine Meinung.","replies":[{"poster":"Nivoras","date":"2016-12-07T06:08:28.579+0000","up_votes":2,"down_votes":0,"body":"Mit Janna solltest du eigentlich gerade gegen solche Engage Champs recht gut klar kommen :D \nDu hast einen Knock Up der richtig getimed das Leona E interrupted (Im Notfalls funktioniert auch die Ult) und Naut zumindest weghällt, bin mir grad nicht sicher wie weit sein hook duechgeht, und die Leona Ult lässt sich in vielen, wenn auch natürlich nicht allen Fällen, ganz gut denien indem du die Gegner dann halt weg ultest. Schlechte Match Ups für Janna sind vor allem Poke Lanes, weil das Shield da nicht so stark wie ein Heal ist.\nAber naja ist ja Geschmacksache was man in welchem Matchup gerne spielt^^","replies":[]},{"poster":"haha weed lol xd","date":"2016-12-07T15:41:00.108+0000","up_votes":1,"down_votes":0,"body":"> Silber 3 \n\nIst kein Bodensatz, sondern Durchschnitt. 50% der Spieler sind unter Silber 1.","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2016-12-07T03:53:59.689+0000","up_votes":2,"down_votes":0,"body":"Immer mal wieder...\nDas mag jetzt völlig übertrieben klingen, aber Stuns waren früher viel schlimmer... also da hatte Annie quasi auf Level 1 einen 2 Sekunden AOE Stun... Taric hatte einen 2 Sekunden Point an Click Stun... Oh und Veigars Stunfeld kam Instant...\n\nMittlerweile (um mal über Veigar zu reden) kann man dem Ereignishorizont eher ausweichen als früher... und als Veigar muss man Punkte in den Stun legen, wenn man mit ihm die Leute auch relevant betäuben will, so dass sein (dann schwächerer) W Skill überhaupt was trifft. \n\nKlar, HardCC und Kiten ist der Konter für Singed. Aber irgendwas muss man ja gegen den machen können.\nDazu kommt: Wenn der Gegner seine komplette CC auf dich als Tank haut, gewinnt dein Team hinterher den Kampf.","replies":[{"poster":"haha weed lol xd","date":"2016-12-07T15:43:16.971+0000","up_votes":1,"down_votes":0,"body":"Finds immer wieder lustig wenn Leute jetzt noch über OP zeugs sprechen. \n\nDie haben ja die ganze Season 2 - 4 Clown Fiesta gar nicht mitbekommen. DFG, Red Invades, Maokai towerdives, Yi backdoors, ELISE, AP Yi, Rivens alte scaling usw usw.","replies":[{"poster":"MeMyselfandBaal","date":"2016-12-08T05:14:27.521+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Animes are trash,realm=EUW,application-id=Wj1wcocU,discussion-id=EQ8YIWKV,comment-id=00000000,timestamp=2016-12-07T15:43:16.971+0000)\n>\n> Finds immer wieder lustig wenn Leute jetzt noch über OP zeugs sprechen. \n> \n> Die haben ja die ganze Season 2 - 4 Clown Fiesta gar nicht mitbekommen. DFG, Red Invades, Maokai towerdives, Yi backdoors, ELISE, AP Yi, Rivens alte scaling usw usw.\n\nund das über epischte: Eine LeBlanc, die dich auf Level 2 mit vollem Leben garantiert umbringen konnte... good old times...","replies":[{"poster":"Sirrkas","date":"2016-12-08T08:24:37.436+0000","up_votes":1,"down_votes":0,"body":"Ich fand \"Full-AP-Yi-is-going-to-tank-your-base-laser\" nerviger.","replies":[]}]}]}]},{"poster":"Nuix","date":"2016-12-08T20:52:00.279+0000","up_votes":1,"down_votes":0,"body":"Release Xin, sunfire stack auf tanks oder Evelyn, globale Ults, AP-Sion, gangplank mit 4x klinge der Habgier...\nVerrückte Zeiten :)","replies":[]},{"poster":"Uranbrennstab","date":"2016-12-07T08:51:40.648+0000","up_votes":1,"down_votes":2,"body":"How to Trollthread :\n\n1. Absobderliche These mit Rechtschreibfehleren und oder Anfeindungen \n2. Nie wieder in diesem Thread antworten \n3.? \n4. Profit\n\n\n(Edit feststellen das dieses Forum meine Formatierung frisst und mir in der Vorschau eine komplett andere Darstellung anzeigt als im Fertigen Beitrag. Ja GE GE.) ","replies":[{"poster":"Ozuraak","date":"2016-12-07T09:06:03.198+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Uranbrennstab,realm=EUW,application-id=Wj1wcocU,discussion-id=EQ8YIWKV,comment-id=0005,timestamp=2016-12-07T08:51:40.648+0000)\n>\n> How to Trollthread :\n> \n> 1. **Absobderliche** These mit Rechtschreibfehleren und oder Anfeindungen \n> 2. Nie wieder in diesem Thread antworten \n> 3.? \n> 4. Profit\n> \n> \n> (Edit feststellen das dieses Forum meine Formatierung frisst und mir in der Vorschau eine komplett andere Darstellung anzeigt als im Fertigen Beitrag. Ja GE GE.)\n\nAnderen die Rechtschreibung vorhalten und dann selbst nicht besser sein, ist jetzt aber auch nicht unbedingt der richtige Weg.","replies":[{"poster":"Uranbrennstab","date":"2016-12-07T09:09:19.607+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ozuraak,realm=EUW,application-id=Wj1wcocU,discussion-id=EQ8YIWKV,comment-id=00050000,timestamp=2016-12-07T09:06:03.198+0000)\n>\n> Anderen die Rechtschreibung vorhalten und dann selbst nicht besser sein, ist jetzt aber auch nicht unbedingt der richtige Weg.\n\nDu hast das Prinzip verstanden ;-)","replies":[{"poster":"haha weed lol xd","date":"2016-12-07T15:39:55.444+0000","up_votes":1,"down_votes":0,"body":"sagt man dann so hehe","replies":[]}]}]}]},{"poster":"Timethief49","date":"2016-12-07T09:07:56.743+0000","up_votes":1,"down_votes":0,"body":"Man sollte auch den hard cc, den man Tod nennt nerfen. Es kann ja nicht sein, dass sowas verhindert, dass man sich bewegt damage macht irgendetwas anderes macht und einen auch noch zur Base teleportiert. Sowas von unhealthy gameplay","replies":[]}]}