{"poster":"LOLpRoXis","date":"2017-02-25T14:10:04.686+0000","title":"Ivern Tipps,kaufen?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo ich würde gerne Ivern kaufen da er so spaßig aussieht und ich ihn schon mag\nJedenfalls wollte ich fragen ob es sich lohnt den zu kaufen?Wenn ja welche Tipps\nkönnt ihr mit geben{{champion:427}}\n\nHab auch den Zuckerkönig-Skin aus ner Truhe.","replies":[{"poster":"charmelikeahri","date":"2017-02-27T21:02:29.277+0000","up_votes":2,"down_votes":0,"body":"Wenn du climben willst würde ich Ivern weniger empfehlen für Spaß um so mehr ;)\n\nWenn man Ivern spielt KANN man nicht tilten ;)","replies":[{"poster":"LOLpRoXis","date":"2017-02-28T14:57:04.027+0000","up_votes":1,"down_votes":0,"body":"Wie meinst du das der champ schlecht  ist?","replies":[{"poster":"charmelikeahri","date":"2017-02-28T15:32:26.472+0000","up_votes":2,"down_votes":0,"body":"Wenn du climbest mit Ivern dann spielt er sich wie ein Supporter und ich empfehle niemandem der climben will keine Carryrolle. Er ist halt ein Support der auf sein Team vertrauen muss damit er Spiele gewinnt. Außerdem ist mit ihm sehr viel Absprache nötig die du nicht mit dem Team aus der Solo Q hast.\nUNDD er ist schwer zu spielen es dauert sehr lange bis du wirklich viel aus dem Champion rausholst!\nUND Lowelo weiß nicht wie man mit Ivern spielt er hat eine eigene Spielweise. Ja in Challenger und in der LCS ist er broken aber Solo Q ist er nicht effektiv zu climben. \nUND in Solo Q hast du manchmal Teams die nicht gut spielen und die du Supporten kannst wie du willst die dann trz verlieren. Mit Rengar kannst du besser 1vs5 spielen, was du in Solo Q gezwungen bist.\n\nNatürlich ist er okay aber eben nicht der Solo Q Champion. Aber er macht sehr viel Spaß! Machs wie ich! Rengar OTP 68% Winrate auf 150 Games und Ivern im Normal! Ivern im Ranked ist mir persönlich zu riskant weil ich\n\n1 nicht alles aus dem Champion raushole\n2 Rengar einfach besser kann\n3 nicht 1vs5 carrien kann","replies":[{"poster":"LOLpRoXis","date":"2017-02-28T15:56:22.197+0000","up_votes":1,"down_votes":0,"body":"wird rengar überhaupt noch generft wenn du das behauptest?","replies":[{"poster":"charmelikeahri","date":"2017-02-28T17:54:45.188+0000","up_votes":1,"down_votes":0,"body":"Was \"behaupte\" ich?\n\nNein ich denke nicht weil er im Moment zwar immer noch stärker als die meisten anderen Junglwr ist aber nicht mehr Op oder busted as fuck. \n\nIch DENKE nein. Wissen tue ich nichts. Große Nervs (wie den letzten) sollte es nicht mehr geben. Kleine sind auch eher unwarscheinlich\n\nEDIT: nvm kleine Nervs auf 7.5! W heilt nur noch 50% des DMGs von Minions und Rengar verliert 4 Rüstung auf Lvl 1. Macht seinen Clear langsamer und ich überlege wieder auf die Pots umzusteigen damit ich den First Clear auch vernüftig durchbringen kann. Es wird ihn nerven aber defintiv viable und immer noch ein guter Champion","replies":[]}]}]}]}]},{"poster":"Nagsor Inaste","date":"2017-02-25T14:37:26.365+0000","up_votes":2,"down_votes":0,"body":"Das Wichtigste: nicht aufgeben!\nIvern braucht ein paar Spiele bis du raushast wie der Jungleclear funktioniert, deswegen nicht gleich nach 1-2 Games aufgeben und über die verlorenen IP fustriert sein.\nKauf am besten so früh wie möglich Ionia-Schuhe wegen der CDR auf Summonerspells, dadurch kannst du auch öfter Smiten und fällst in lvln nicht so stark zurück wenn es ins Midgame geht.","replies":[{"poster":"LOLpRoXis","date":"2017-02-25T14:39:52.390+0000","up_votes":1,"down_votes":0,"body":"Danke :) für diesen Tipp würde aber  auch wissen\nwie man die W einsetzt und die Kombos ebenfalls :)\n","replies":[{"poster":"Tr3ys","date":"2017-02-25T14:44:20.931+0000","up_votes":2,"down_votes":0,"body":"Wenn er dir Spaß macht sind die IP sowieso schon gut investiert und man hat ja auch schnell wieder genug für nen neuen Champ zusammen. Die Spielweise von ihm ist sehr speziell und nicht mal eben zu erklären, weshalb ich dir empfehlen würde Spiele von High Elo/ Prospielern anzuschauen und zu versuchen die Mechaniken auf dein Spiel zu übertragen. Dabei kannst du auch gleich Runen/Masteries kopieren.\n\nHier einmal Runen Masteries und Buildpath eines Ivern Main im Masterbereich.\nhttp://imgur.com/a/IoFve\n","replies":[{"poster":"LOLpRoXis","date":"2017-02-25T15:17:37.178+0000","up_votes":1,"down_votes":0,"body":"Danke dir das hat mir mehr sogar geholfen da ich nicht wusste wie man ihn baut und so weiter was du geschickt hast.","replies":[{"poster":"LOLpRoXis","date":"2017-02-27T20:27:50.442+0000","up_votes":1,"down_votes":0,"body":"Ebenfalls ist es notwendig ivern mit movement speed zu bauen weil manche leute auch ap mit rein nehmen","replies":[]}]}]}]}]},{"poster":"karsten 45","date":"2019-05-23T15:22:22.857+0000","up_votes":1,"down_votes":0,"body":"Was baut man auf Ihn","replies":[]},{"poster":"Bodycounter","date":"2017-03-01T09:11:57.556+0000","up_votes":1,"down_votes":0,"body":"Ich mache es mal kurz: Ivern ist im richtigen Team sehr stark. Allerdings eignet er sich nicht so gut zum Climben wie andere Champions. Gegen sehr aggressive Jungler kann Ivern ebenfalls schnell scheitern.\n\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3083864421/40694800?tab=overview\n\nIch habe zum Beispiel gestern Ivern gespielt, weil er sehr gut ins Team passte. Ivern ist quasi ein zweiter Supporter und seine Fähigkeiten sind für meinen Toplaner (Fiora) ideal gewesen. Mein Q ist für sie ein idealer Gapcloser und mein E hilft ihr zu überleben und bietet einen Slow. Darüber hinaus kann Caitlyn gut mit Iverns Büschen arbeiten. Für Anivia ist die Menge and Kontrollfähigkeiten von Ivern ideal.","replies":[{"poster":"LOLpRoXis","date":"2017-03-04T15:16:45.809+0000","up_votes":1,"down_votes":0,"body":"ich kann nicht auf match history kp why","replies":[]}]}]}