{"poster":"IInster70","date":"2016-10-19T14:18:53.020+0000","title":"Kalistáról","up_votes":3,"down_votes":2,"body":"&Uuml;dv&ouml;zlet.\r\n\r\nBevallom, kedvenc adcm ugye sz&eacute;tnerfelt&eacute;k &eacute;s el&eacute;gg&eacute; hi&aacute;nyzik. Sajnos nem &eacute;r fel a mostani legjobb adc championokhoz (Caitlyn, Vayne stb.).\r\nA lowest win rate list&aacute;ba szerepel. Ha earlybe nem kap p&aacute;r killt teljesen useless lesz, nem &uacute;gy mint a t&ouml;bbi adcn&eacute;l. Tegy&uuml;k fel egy Caitlyn egy IE-vel &eacute;s hurricannel megrektel mindenkit.\r\n\r\nSzerintetek mi kellene hozz&aacute;, hogy &uacute;jra meta legyen? Megint tank met&aacute;nak kellene lennie vagy buffolni kellene?\r\n\r\nK&ouml;sz&ouml;n&ouml;m, hogy elolvastad! :)","replies":[{"poster":"Vasipari Béla","date":"2016-10-21T15:26:22.465+0000","title":null,"up_votes":1,"down_votes":0,"body":"Reworkre szorul, az 100%.","replies":[]},{"poster":"Son of Vengeance","date":"2016-10-21T11:57:33.280+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem hiszem, hogy buffolni fogják. Ha buffolják túlságosan is erős lesz. Azert ilyen rossz a win rate-je, mert az emberek nem elég jók vele, nem értik a vele való játék lényegét, sok counterje van, és nagyban függ a supportjától (ugye akkor van nagyon-nagy sebzése ha vele összekötött hős auto attackkal támadja az ellenfelet -W passzív-). Pont ezért van, hogy ha találkozol vele rankeden akkor nagy valószínűséggel elég jó játékossal lesz dolgod vagy nagyon rosszal. Szerintem a fent levő buildek sem az igaziak, de az mar egy sokadik pont, hogy miként építed. 1v1ben szinten minden ADC erősebb lesz nála, mert egyszerűen nem egy 1v1 Champ, max akkor jo ha sok skillshotja van az enemynek (varus, ezreal). Teamfightban erős nagyon, csak ne kapjanak el.\nÓrákat tudnék neked mesélni róla, de most nem guide-t kell írni. \nLényeg, hogy szerintem nem nagyon buffoljak majd, maximum egy nagyon kicsit, mert így is erős ha valaki igazán jól tud játszani vele.","replies":[]},{"poster":"VampVik","date":"2016-10-20T20:32:57.080+0000","title":null,"up_votes":1,"down_votes":0,"body":"Most is tank meta van nem? Pont \"Az ősök ereje\" a legOP-b mesterség (nem is véletlenül veszik ki s7-re).\nEgyébként nem szoktam ADC-zni, de akit én láttam Kalistázni az elég jó volt vele. Szerintem nem a win rate a fontos, hanem, hogy milyen jó vagy vele és ha tudsz vele akkor ugyan úgy elolvasztasz bárkit mint a többi ADC. Sőt, a dárdáival a Sárkánynál és a Baronnál is OP.","replies":[]}]}