{"poster":"Boozaa","date":"2017-01-07T14:16:40.290+0000","title":"5x gleicher Skin in Boxen aus Paket","subforum":"Melde einen Bug","up_votes":6,"down_votes":1,"body":"Liebe Riotler,\r\nich habe mir eben die Liste mit den m&ouml;glichen Skins in den verschiedenen Truhen angesehen und dachte, ich k&ouml;nnte doch mal 1400 RP investieren.\r\nAlso habe ich mir das Paket mit 5 &quot;Unendliche Beute&quot;-Truhen gekauft, da mir die potenziellen Skins am meisten zusagten. Kiste 1 enthielt &quot;Galaktischer Azir&quot;, nicht schlecht, aber da ich Azir nicht spiele, eher weniger zu gebrauchen. Kiste 2: &quot;Galaktischer Azir&quot;. Hier musste ich schon etwas schmunzeln, aber was soll&#039;s, dachte ich mir, n&auml;chste Kiste, n&auml;chstes Gl&uuml;ck. &quot;Galaktischer Azir&quot;. Selbes in Kiste 4 &amp; 5. \r\nNehmen wir an, dass die Liste stimmt und in den Boxen 18 m&ouml;gliche Skins sind. Ich nehme auch einfach mal an, dass Legendarys seltener sind, also sagen wir, es besteht eine Chance von ungef&auml;hr 1:15 diesen Skin zu erhalten. Potenziert mit 5 kommt man auf eine Wahrscheinlichkeit von 0,0000016%, 5x in Folge den gleichen Skin zu erhalten.\r\nIch glaube ja gern an den Zufall, aber kann es sein, dass es sich hierbei um einen Bug handelt? Um ehrlich zu sein vergeht mir durch sowas die Lust jemals wieder Punkte zu kaufen bzw &uuml;berhaupt noch zu spielen.\r\nScreenshots sind vorhanden.\r\nMFG","replies":[{"poster":"rrexeν","date":"2017-01-07T19:01:46.847+0000","up_votes":2,"down_votes":0,"body":"Schreib mal den Support an die können da bestimmt was machen.","replies":[]},{"poster":"Sihari","date":"2017-01-07T15:03:34.779+0000","up_votes":2,"down_votes":0,"body":"Ich hab mir das passende Boxenset dazu 2x gekauft und jeweils 2x (also insgesammt 4x) den Galaktischen Azir gezogen. Entweder hat der ne verdammt hohe Dropchance, oder da ist was nicht richtig....","replies":[]},{"poster":"ExaLightyear","date":"2017-01-07T23:24:13.323+0000","up_votes":1,"down_votes":0,"body":"{{item:3070}}","replies":[]},{"poster":"Archmage3000","date":"2017-01-07T16:50:23.191+0000","up_votes":1,"down_votes":0,"body":"Das schein bei diesen Kisten wohl öfter so zu sein. Aus den Gruselkisten bekomme ich ständig Kätzchen-Katarina :/","replies":[]}]}