{"poster":"IWhiteBoyI","date":"2017-01-29T16:16:25.530+0000","title":"Autofill , warum ?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":2,"body":"Moin,\r\n\r\nwarum gibt es den Autofill ? ich kann nicht verstehen warum dieses System erschaffen wurde, ich w&uuml;rde lieber 6 min l&auml;nger auf ein game warten als dauerhaft einen Supporter zu bekommen der unfreiwillig supporten muss. Weder er hat so spa&szlig; am Spiel noch der Adc der ihn auf die lane bekommt.\r\nWelchen sinn macht es denn auf diese Art und weise Spiele zu beeinflussen ?\r\nMal davon abgesehen das es weniger Supporter gibt als die anderen Rollen ,das ist mir vollkommen klar, aber f&uuml;r alle die kein Support spielen oder spielen k&ouml;nnen ist es eine Strafe auf die Botlane zu m&uuml;ssen. Die Meta is eh schon genug &quot;Anti-Adc&quot; und wird durch dieses Systeam nur noch mehr benachteiligt.\r\n\r\nMFG Wecko","replies":[{"poster":"Megamaexx","date":"2017-01-29T16:31:22.725+0000","up_votes":2,"down_votes":0,"body":"Darf ich anmerken, dass solche Posts bereits so oft erstellt wurden, dass sie einfach nur noch nervig sind? Hier ein paar Beispiele:\nhttp://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/fM55IVcQ-autofill\nhttp://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/zfVNeHmt-autofill-macht-keinen-sinn\nhttp://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/7pQpYOvv-wieso-autofill\nhttp://boards.euw.leagueoflegends.com/de/c/champions-gameplay-de/y3N2w1mT-autofill\nhttp://boards.euw.leagueoflegends.com/de/c/champions-gameplay-de/JPAKczGG-autofill\nhttp://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/UxbpGEUz-autofill\n\nMIt Spammen zu den gleichen Themen kann man nicht wirklich was bewirken. Beteilige dich doch einfach an den bestehenden Diskussionen.","replies":[]},{"poster":"Sirrkas","date":"2017-01-29T16:28:34.846+0000","up_votes":1,"down_votes":1,"body":"Weil die Spieler Meta spielen wollen und deswegen jemand die Rolle Support haben muss. Da aber nicht genug Support spielen wollen, wird das eben manchen zugewiesen.","replies":[{"poster":"IWhiteBoyI","date":"2017-01-29T17:15:44.767+0000","up_votes":1,"down_votes":2,"body":"Tja dann hat man halt Pech gehabt würde ich sagen und sollte vieleicht die Support rolle attraktiver machen. Es bringt einem 0 wenn die Rolle nicht gespielt werden will wird der spieler niemals maximalen Einsatz zeigen.","replies":[{"poster":"Sirrkas","date":"2017-01-29T18:01:07.077+0000","up_votes":2,"down_votes":0,"body":"Macht Riot doch ständig. Die meisten Spieler wollen aber Dämätsch machen und nicht helfen.","replies":[]},{"poster":"CMan","date":"2017-01-29T18:14:38.506+0000","up_votes":1,"down_votes":0,"body":"Die Supportrolle wurde seit 2012 jedes Jahr aufs Neue attraktiver gemacht.\n\nDamals hatte man Boots, einen Philostone (der gab Bonus Gold per 10), und jedes weitere Fitzel Gold hatte man in Wards zu investieren. Wo jeder einzelne Ward für 75 Gold zu kaufen war, Pinks sogar 125.\n\nEs folgten in S3 der Sightstone, in S4 Trinkets und die heutigen Gold Income Items, in S5 die Möglichkeit, Sightstone und Golditem zu kombinieren, in S6 Ardent Censer, ZZrot Portal und das neue Zekes und diese Season Redemption und Knights Vow.\n\nDie Leute sind nach wie vor in dem Irrglauben, dass man als Support nicht carrien könnte, was aber kompletter Unsinn ist. Wenn man denn richtige Supporter spielen würde anstatt diese Wannabe Midlaner wo sich wenn man Glück hat ein Sightstone ins Build verirrt, könnte man durch Peel, Heal und Schilde verdammt viel tun.\nUnd natürlich ordentliches Warding. Das ist auch so n Punkt wo man mit sehr wenig Aufwand deutlich besser sein könnte als der Großteil der anderen Spieler.\n\nDas Problem liegt im Mindset der Leute und nicht in der Rolle.","replies":[]}]},{"poster":"Tamamo no mae","date":"2017-01-29T17:16:40.269+0000","up_votes":1,"down_votes":1,"body":"Es macht aber langsam echt keinen spass mehr mit irgendwelchen Trolls die meinen sie müssten riven oder anderes sup spielen ohne sup Item sich den cs nehmen und trollen wos  nur geht egal ob mein oder gegnerteam. -.- und es is ja schon fast täglich was is so schlimm sup zu spielen?¿","replies":[]}]}]}