{"poster":"TheMaster13","date":"2015-12-22T00:42:06.848+0000","title":"Alistar AP oder AD","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hallo liebe lol community,\nIch hab ne frage in letzter Zeit spiele ich sehr oft Alistar, nun das er Tank ist und leben etc kaufen muss weiss ich. Aber wegen den Runen hab ich ne frage, ich habe AD und AP runen welche soll ich für Alistar benutzen, AP oder AD\nDanke im voraus.","replies":[{"poster":"Neeko the Ekko","date":"2015-12-22T13:47:10.168+0000","up_votes":1,"down_votes":1,"body":"Sola zeigt´s wie es geht :)\n\nhttps://www.youtube.com/watch?v=gpxQJVZsyUk","replies":[{"poster":"TheMaster13","date":"2016-02-07T22:13:04.753+0000","up_votes":1,"down_votes":0,"body":"Nice danke für das Video","replies":[]}]},{"poster":"Lyle","date":"2015-12-22T00:53:40.622+0000","up_votes":1,"down_votes":1,"body":"Alistar profitiert in der Support-Rolle von beiden Werten etwa gleichmäßig. Du kannst die AP-Runen nehmen und wirst dadurch mit deiner W-Q-Combo imposanter, außerdem hast du einen etwas stärkeren Heal. Allerdings kannst du auch die AD-Runen nehmen und versuchen, öfter mit Autohits zu traden - das wird nach 'ner Weile für den Gegner ziemlich anstrengend, wenn's richtig gemacht wird.\n\nSofern du keine AD-/AP-Items baust, sondern bei Tank-Items bleibst, nimmt es sich aber, wie gesagt, nicht viel.","replies":[{"poster":"TheMaster13","date":"2015-12-22T00:56:03.855+0000","up_votes":1,"down_votes":0,"body":"Also spielt es eigenlich garkeine Rolle, weil er sowieso FULL TANK gespielt werden muss oder ?","replies":[{"poster":"Lyle","date":"2015-12-22T01:00:28.633+0000","up_votes":1,"down_votes":0,"body":"Wenn du nur AD- und AP-Runen zur Verfügung hast, ist es nahezu irrelevant, solange du nur Tank-Items kaufst - richtig.","replies":[{"poster":"TheMaster13","date":"2015-12-22T18:46:03.342+0000","up_votes":1,"down_votes":0,"body":"hab trotzdem noch ne frage, man kann ja Alistar top spielen, soll man da eher ad oder ap gehen","replies":[{"poster":"Ameyzin","date":"2016-01-03T11:51:38.057+0000","up_votes":1,"down_votes":0,"body":"AP....3 Dorans Ringe, Frostfreeds Claim, Ludens, dann Zhonyas und Rabadons und dann weiter je nach Situation... Damit oneshottest du den gegnerischen adc und Midlaner wenn es gut läuft","replies":[]},{"poster":"arthurs","date":"2015-12-25T13:28:07.735+0000","up_votes":1,"down_votes":0,"body":"Auf der Toplane ganz klar AD, da du damit besser lasthitten kannst.","replies":[]}]},{"poster":"TheMaster13","date":"2015-12-22T11:49:52.931+0000","up_votes":1,"down_votes":0,"body":"oke danke man hast mir sehr geholfen !:D","replies":[]}]}]}]},{"poster":"haha weed lol xd","date":"2015-12-22T05:58:35.620+0000","up_votes":1,"down_votes":0,"body":"AP - Top : )","replies":[]},{"poster":"Aaxsus","date":"2015-12-22T00:48:25.127+0000","up_votes":1,"down_votes":0,"body":"Eigentlich kannst du auf AP bzw. AD Runen auf Alistar verzichten und stattdessen auch auf full tank gehen, wenn du ihn als Support spielst.\nFalls du DMG Runen verwenden willst, dann solltest du nach Möglichkeit AP mitnehmen, da alle Fähigkeiten auf AP Skalieren und du damit mehr Schaden beim Engage und mehr Heilung für deinen Adc bereitstellen kannst.\nSolltest du Alistar Top Lane oder gar Jungle spielen wollen, würde ich eher zu den AD Runen raten, da du sonst einfach keinen Schaden drücken kannst wenn du deinen Q+W verwendet hast. Außerdem würden dir die AD Runen sehr beim Töten der Minions helfen, da es dadurch um einiges einfacher wird.","replies":[{"poster":"TheMaster13","date":"2015-12-22T00:52:33.646+0000","up_votes":1,"down_votes":0,"body":"Aha oke danke für die Antwort \nhast mich sehr gut aufgeklärt :D","replies":[]}]}]}