{"poster":"Hydronius","date":"2015-08-12T23:46:53.945+0000","title":"Wie schätzt ihr mich ein? Bin ich bereit für die SoloQ?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Hallo!\r\nErstmal zu mir: Ich bin Simon, 16 Jahre alt, spiele LoL seit etwa eineinhalb Jahren, allerdings mit einigen Pausen und bin zur Zeit, nachdem ich mich m&uuml;hsam von Bronze 4, wo ich platziert wurde, hochgearbeitet habe, Silber 5. Au&szlig;erdem mag ich offenbar lange S&auml;tze... :D\r\nIch war mir in Bronze sehr sicher, dass ich nicht dort hingeh&ouml;re und dass ich dort auch nicht bleiben kann, weil auch die Normals mit Bronzespielern waren und das teilweise echt keinen Spa&szlig; gemacht hat. Deshalb habe ich mich ordentlich angestrengt und habe jeden Tag mindestens 1-2 Rankeds gespielt, und bin dann mit einer Winrate von etwa 70% bei ca. 75 Spielen nach Silber 5 aufgestiegen, wobei ich leider in Bronze 1 eine richtig doofe Pechstr&auml;hne hatte. Wegen ebendieser Pechstr&auml;hne hatte ich dann, in Silber 5 angekommen, erst einmal keine Lust mehr auf Rankeds, vor allem weil es mir so vorkam, dass in Silber 5 teilweise viel schlimmere Spieler als in Bronze sind. Ich denke, dass sie etwas Gl&uuml;ck in den Platzierungsspielen hatten und somit noch nach Silber gekommen sind. Sie sind dadurch noch schlimmer als die Bronzespieler, dass sie auch noch denken, sie w&auml;ren etwas besseres, nur weil sie Silber sind. Ich habe dann hier und da ein Paar Rankeds gespielt, hatte jetzt, wo ich wieder konsequent anfangen wollte, aber wieder eine Pechstr&auml;hne, sodass ich von kurz vor der Promo auf 0LP gefallen bin. Meine Winrate liegt jetzt nur noch bei kurz unter 60%...\r\nZur Entspannung spiele ich deshalb zur Zeit meinen Smurf hoch (zur Zeit Level 17).\r\nNun meine Frage: Haltet ihr mich und mein Spiel k&ouml;nnen f&uuml;r &quot;reif&quot;, um aufzusteigen (eventuell bis in niedriges Gold), oder geh&ouml;re ich nur in niedriges Silber. Wenn die erste M&ouml;glichkeit der Fall ist, w&uuml;rde ich wieder anfangen mit Rankeds und hoffen, irgendwann aus diesem Silber 5-Schrecken herauszukommen. Bei der zweiten M&ouml;glichkeit, ist es mir der Stress, der durch manche Rankeds entsteht, nicht wert, wenn ich sowieso nicht mehr erreichen k&ouml;nnte.\r\nAls Referenzen schaut gerne meinen Matchverlauf an und einige andere Seiten, die ich hier verlinkte:\r\n[OP.GG](http://euw.op.gg/summoner/userName=Hydronius)\r\n[LoLKing](http://www.lolking.net/summoner/euw/51995354)\r\n[Matchverlauf](http://matchhistory.euw.leagueoflegends.com/de/#match-history/EUW1/207450444)\r\n\r\nWeiter n&uuml;tzliche Seiten fallen mir gerade nicht ein, falls ihr noch welche kennt, berichtet mir von ihnen ;-)\r\n\r\nHydronius | Simon","replies":[{"poster":"FluffyUnicornNR1","date":"2015-08-13T01:05:42.470+0000","up_votes":2,"down_votes":0,"body":"Ich würde mir nicht von fremden Leuten bewerten lassen ob du reif für die SoloQ bist :) Wieso spielst du nicht jeden Tag malwieder ein Game (Ranked)? Und du wirst doch selbst merken wo du landest?\n\nWenn du gerne höher als Silber kommen willst, dann versuch es und hinterfrag nicht alles^^","replies":[]},{"poster":"harpyclaw","date":"2015-08-13T10:21:19.763+0000","up_votes":1,"down_votes":0,"body":"wenn du dich auf 1-2 champions pro lane fokussierst (garen & ahri passt ja schonmal), dann könnte es klappen, spiele nicht zuviele verschiedene champs, achte nicht zu sehr auf counters, das ist in der niedrigen elo sekundär.","replies":[]},{"poster":"Xyre","date":"2015-08-13T01:16:10.579+0000","up_votes":1,"down_votes":0,"body":"Eine gute, wenn auch Subjektive Meinung über deinen Spielstil kann dir die Seite **Freelo.gg** geben. Dort siehst du außerdem auch wo du dich noch verbessern solltest und in was du schon gut bist. \n\n-Carpe Diem\nMfG BackFIips","replies":[{"poster":"hshtagniemehrcdu","date":"2015-08-13T09:05:41.458+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BackFIips,realm=EUW,application-id=ip27PlEH,discussion-id=n62k7F3i,comment-id=0002,timestamp=2015-08-13T01:16:10.579+0000)\n>\n> Eine gute, wenn auch Subjektive Meinung über deinen Spielstil kann dir die Seite **Freelo.gg** geben. Dort siehst du außerdem auch wo du dich noch verbessern solltest und in was du schon gut bist. \n> \n> -Carpe Diem\n> MfG BackFIips\n\nLaut der Seite soll ich meinen CS-Score verbessern.\nVerdammnt nochmal, ich habe fast nur Supp gespielt oO","replies":[]}]},{"poster":"TPA Toyz","date":"2015-08-13T00:34:52.001+0000","up_votes":1,"down_votes":0,"body":"Ich weiß nicht wie man durch eine Text einschätzen kann, wie gut du spielst, aber zu dem, dass Silber schlechter ist als Bronze, kann ich zustimmen.\nAlle Unrankeds kommen direkt in Silber, spielen dann nie mehr ranked und fühlen sich gut..","replies":[{"poster":"Busty Botter","date":"2015-08-13T00:43:57.934+0000","up_votes":1,"down_votes":1,"body":"In Silber fühlt man sich gut? oO\nSilber heißt für mich \"du hast nicht total verkackt, aber gut ist anders\".\nBTW finde ich es diese Saison noch einfacher in Gold zu kommen als letzte Season, da irgendwie das allgemein Spielniveau gesunken ist. (ist zumindest meine Einschätzung)","replies":[]}]}]}