{"poster":"Workshop Shaco","date":"2015-08-14T00:39:11.207+0000","title":"Workshop Shaco's Shaco Workshop [Champion Update Proposal]","subforum":"Gameplay","up_votes":22,"down_votes":4,"body":"Hey G&B. I have been playing Shaco since Season 3 and I absolutely adore this champion. I made a thread pretty recently about how Shaco needs a ton of bug fixes and some QoL changes (http://boards.na.leagueoflegends.com/en/c/gameplay-balance/8yGGgyNw-remember-how-for-most-of-season-4-shacos-q-made-the-turret-switch-aggro-away-from-him?show=flat) and at the bottom I mentioned how I was making up a Shaco champion update. Well, this is it! \n\n I&#039;ve talked to multiple Shaco mains all the way from the bottom of silver to master tier about his current kit and this is the result of all their input.\n \nFirst here is a little basic information about current Shaco. He was made in 2009 and was completely broken for the first two seasons of the game. In the beginning of Season 3 the nerfed him into the floor and he became a troll pick for a while. Some people continued to play him and make him work, me being one of those people. However his insanely outdated kit is really becoming something Riot can&#039;t just ignore any longer. At this time last year his overall win rate was about 56% averaged in from all elos. Currently he sits at a 49% win rate on average.\n \nHe is a giant buggy mess that hasn&#039;t been touched in ages, and he desperately needs some \"modernizing\". I wrote one of these last year and it had mixed results, so here is the result of feedback combined with the ideas I got from other Shaco mains.  \n \nOk now for the changes I think would make his kit less \"toxic\", a bit easier to get the hang of, and easier to balance.\n-----\n**Base Stats**\n~~Health: 582 lvl 1---> 2010 lvl 18~~  Health: 590 lvl 1-->2010 lvl 18\nAttack Damage: 58 lvl 1 &ndash;-> 117 lvl 18\nHealth Regen: 8.4 lvl 1 &ndash; 17.7       \nAttack Speed: 0.694 (+0% &ndash;> 51.0%)\n~~Mana: 297 lvl 1 &ndash;-> 977 lvl 18~~ Mana: 310 lvl 1-->1005 lvl 18\nArmor: 24.9 lvl 1 &ndash;-> 84.4 lvl 18\nMagic Resist:   32.1 lvl 1 &ndash;-> 53.4 lvl 18\nMana Regn: 7.2 lvl 1 &ndash;-> 14.8 lvl 18\nAttack Range: 125 units\nMovement Speed: 350\n \nSlightly better health and mana, nothing too drastic here. I need to think a little more about how much I actually want to change his base stats, they aren&#039;t as important as changing his kit around a bunch but they are still relevant.\n -----\n**Passive: ~~Backstab~~ The other Shiv!**\n \n~~Shaco deals 20% bonus damage when striking an enemy from behind with his basic attacks or Two-Shiv Poison.~~\n \nAfter using an ability Shaco becomes very excited and will use both of his shivs in his next attack for bonus critical strike damage. This bonus physical damage is equal to 60%/70%/80%/90%/100%/120% (at levels 1/3/6/10/13/16) of Shaco&#039;s total attack damage in addition to 30% of his total AP. When attacking a target from behind, this attack will apply all on-hits a second time and do an additional 10% damage. \n\n\nCooldown: 3 seconds after the enhanced attack has been depleted. He can hold said attack for 3 seconds. \n \n_**Edit: I think 45%/60%/75%/90%/105%/120% is more fair. It gimps his early game in exchange for more mid game power. Less snowball potential but less reliant on snowballing. **_\n\nI think this passive will suit him well, his current critical strike animation is him stabbing an enemy with both of his shivs and that was what inspired this new passive. I got rid of his insane damage amp because it was holding back the rest of his kit. Someone needs to think of a better name for it though. This will also make his power curve much healthier.\n-----\n**Q: Deceive**\n \n~~Range: 400 ~~ Range: 450\n~~Cost: 90 / 80 / 70 / 60 / 50 mana~~ Cost: 70 mana at all levels\nCooldown: 11 seconds\n \nACTIVE: Shaco instantly blinks to the target location and stealths for up to ~~3.5 seconds~~ 3 seconds. ~~ also causing his next basic attack within 6 seconds 5 seconds to Critical strike icon critically strike for bonus critical damage.~~~~Bonus critical damage: 140%/160%/180%/200%/220% of your Attack Damage. ~~\n \n_New Effect:_ Shaco gains 15%/20%/25%/30%/35% [decaying] bonus movement speed for 1.5 seconds upon using Deceive or upon killing an enemy champion.\n \nWith the bonus damage after using Shaco&#039;s deceive removed, it leaves a lot of room for some improvement. I lowered the stealth duration and increased the range slightly to make positioning with Shaco a little bit easier and at the same time a little bit more important. The mana cost change was  to keep him from relying heavily upon blue buff for the first 15-20 min of the game, currently Shaco can barely afford to gank without having to recall for mana if he doesn&#039;t have a blue buff.\n \nAs for the new effect, this was to encourage the hit and run assassin playstyle of Shaco and to compensate a little bit for the removal of pretty much half the ability.\n -----\n**W: Jack In The Box** \nRange: 425 / 300\nCost: 50 / 55 / 60 / 65 / 70 mana\nCooldown: 16 seconds\n       \nActive: Shaco summons a box at the target location that stealths after a ~~2-second delay~~ 1 second delay and lasts for up to ~~60 seconds~~ 60/90/120 seconds (at levels 1/11/16). If an enemy springs the trap, it opens and causes surrounding enemies to turn and flee while it attacks nearby enemies for up to ~~5 seconds.~~ 7 seconds.\n \nFlee Duration: 0.5 / 0.75 / 1 / 1.25 / 1.5 seconds\n~~Magic damage per attack: 35 / 50 / 65 / 80 / 95 (+ 20% AP)~~ Magic damage per attack: 50/65/80/100/120 (+10% AP) (10% bonus AD)\n \n_**New Effect: Shaco can now only have a maximum of 3/4/5 boxes placed (at levels 1/11/16)**_\n_**New Effect: JiTBs now take 75% reduced AoE and DoT damage during the 1 second delay before they enter stealth. **_\n_**New Effect: JiTBs now take 20%/25%/30%/35%/40% reduced damage from large monsters. **_\n**_New Effect: JiTBs now prioritize whoever Shaco is attacking first_**\n \nThis is to make boxes not completely useless for AD Shaco later into game while also not completely breaking AP Shaco.\n -----\n**E: Two-Shiv Poison** \n \nRange: 625 units\nCost: 50 / 55 / 60 / 65 / 70 mana\nCooldown: 8 seconds\n \nActive: Shaco throws a dagger at the target enemy, dealing magic damage and slowing them for ~~3 seconds.~~ 2 seconds.\nDamage: 50 / 90 / 130 / 170 / 210 (+ 100% AP) (+ 100% bonus AD) magic damage.\n \nSlow amount: 40%/45%/50%/55%/60%  [decays over 2 seconds]\n \n~~Passive: While Two-Shiv Poison is not on cooldown, Shaco&#039;s basic attacks poison his targets, slowing them for 2 seconds and causing minions and monsters to occasionally miss their attacks.~~\n\nPassive: Every 5 auto attacks Shaco&#039;s shivs blind a monster or minion causing them to miss their next attack. Attacking a target from behind builds up these stacks twice as fast.\n \n~~Minion and monster miss chance: 20 / 22.5 / 25 / 27.5 / 30%~~\n \nThe slow change makes the slow far more potent but as a result is now a decaying slow as opposed to a perma slow and the total duration was reduced. His auto attacks no longer passively apply this slow as they currently do on live.  \n \nAs for the monster and minion debuff part of his passive, I made it far more reliable than the RNG based passive we have on Shaco at the moment. This change encourages Shaco to always pay attention to his positioning similarly to the way the current Shaco does. It helps keep Shaco Shaco while also modernizing him and making him healthier for the game over all.\n -----\n**R: Hallucinate**\n~~Range: 250 ~~ Range: 375\nCost: 100 mana\nCooldown: 100 / 90 / 80 seconds\n       \n~~Active: Shaco vanishes for 0.5 seconds, then creates a clone of himself that lives for up to 18 seconds and explodes upon its death, dealing magic damage to all enemies around it.~~\n \nActive: Shaco vanishes for 0.5 seconds, then creates a clone of himself before reappearing a short distance away from where he was standing. His new position will be as close to your cursor as it can be, and his clone will have moved an equal distance in the opposite direction away from where Shaco was originally standing.\n \nClone stats: The clone lives up to 18 seconds and explodes upon its death, dealing magic damage to all enemies around it. When Shaco dies, his clone automatically explodes.\n \nDamage: 300 / 450 / 600 (+ 100% AP) magic damage\n \n \nPlease give any and all feedback. I plan on posting a follow up thread soon! For the record, the only reason I didn't kill off AP Shaco was because roughly half the people I asked said I definitely shouldn't in any way and the rest said I should try to avoid it.","replies":[{"poster":"RiotRepertoir","date":"2015-08-14T06:28:06.436+0000","up_votes":12,"down_votes":1,"body":"Cool ideas for Shaco! Few questions....\n\nWhat do you think this new passive does for Shaco that makes him either play better/smoother or enhances his play?\nWhat do you think the net effect of the changes here is as it pertains to his contributions to a team in the early, mid, and late game?\n\nI'm especially interested in knowing, from a Shaco main (and other Shaco mains) specifically, what is it that Shaco should be doing (and that Shaco players want to do) in the late game that makes them and their teammates feel good about having him on the team?","replies":[{"poster":"Troy242621","date":"2015-08-14T06:52:13.995+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=0008,timestamp=2015-08-14T06:28:06.436+0000)\n>\n> Cool ideas for Shaco! Few questions....\n> \n> What do you think this new passive does for Shaco that makes him either play better/smoother or enhances his play?\n> What do you think the net effect of the changes here is as it pertains to his contributions to a team in the early, mid, and late game?\n> \n> I'm especially interested in knowing, from a Shaco main (and other Shaco mains) specifically, what is it that Shaco should be doing (and that Shaco players want to do) in the late game that makes them and their teammates feel good about having him on the team?\n\nI'll send one of my friends a link here next time I see him, he was one of the top Shacos NA in S4, he's sitting in Diamond right now. Anyhow,...\n\nI feel as though Two-Shiv Poison contributes the least to his identity.  Backstab adds something to Shaco and isn't just a binary stat stick. You have to not only get to them, but get _behind_ them. With the range of Deceive, the visible smoke puff and the stealth duration being what they are, this isn't always easy. Deceive is half of what makes him the b*stard that he is early game, boxes being the other half. And of course, his infamous clone.\n\nReally, ONLY his E doesn't really add to his identity. If I were in charge of changing Shaco, I'd take aim at that skill for something new. Worth noting that despite the fact it contributes little to his identity, it is universally maxed first for the added CC and damage. That said, it's a pretty uninteresting skill, and I wouldn't lament being rid of it.\n\nIf I were going to change his other skills, I'd keep what they do similar to what they do now, or it may start to dig into his identifying skills.","replies":[{"poster":"KONO RUBICK DA","date":"2015-08-14T09:36:01.015+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Troy242621,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=00080000,timestamp=2015-08-14T06:52:13.995+0000)\n>\n> I'll send one of my friends a link here next time I see him, he was one of the top Shacos NA in S4, he's sitting in Diamond right now. Anyhow,...\n> \n> I feel as though Two-Shiv Poison contributes the least to his identity.  Backstab adds something to Shaco and isn't just a binary stat stick. You have to not only get to them, but get _behind_ them. With the range of Deceive, the visible smoke puff and the stealth duration being what they are, this isn't always easy. Deceive is half of what makes him the b*stard that he is early game, boxes being the other half. And of course, his infamous clone.\n> \n> Really, ONLY his E doesn't really add to his identity. If I were in charge of changing Shaco, I'd take aim at that skill for something new. Worth noting that despite the fact it contributes little to his identity, it is universally maxed first for the added CC and damage. That said, it's a pretty uninteresting skill, and I wouldn't lament being rid of it.\n> \n> If I were going to change his other skills, I'd keep what they do similar to what they do now, or it may start to dig into his identifying skills.\n\n100% right, i would nerf two-shiv poison so hard and buff his other skills. it ads nothing uniqued to shaco TSP made shaco so anti-fun in early game that riot nerfed his deceive range and duration\n\nworkshop shaco's changes to the boxes are also good, because it buff the power of shaco's boxes which make them good if they are only 1 and prevent the abuse of stacking boxes.\n\n. Also: Shaco was made to be a melee carry with 2 steroid (Q and passive) and his clone which is the biggest steroid in the game since it doubles the on hit effect,deals 75% of damage and can crit.\n\nbut right now, one thing prevent shaco from being good in late game: it's his squshiness.\n\nPS: i hope if you do his rework, you will give us the option to use spells on the clone ","replies":[{"poster":"Tyaldan","date":"2015-08-14T13:12:17.844+0000","up_votes":1,"down_votes":0,"body":"Out of all the shaco ideas ive seen over the past two days, id agree with these two posts the most. His e, is only iconic in that it prevents you from flashing away at 1 - 2 ignite ticks from death, because then his e hits you. I once killed someone on their fountain with e, because it was thrown right before the teleport went off. I could agree with that being changed, however id rather have the shaco clone be both more spread out, with you controlling which ones the real, as it makes fighting shacos easy knowing which one it will be, and allowing it to also q and e. No need for double ws, which would be nice if they prioritized hitting the one you are attacking.","replies":[]}]}]},{"poster":"Rundus1","date":"2015-08-15T01:48:01.018+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=0008,timestamp=2015-08-14T06:28:06.436+0000)\n>\n> Cool ideas for Shaco! Few questions....\n> \n> What do you think this new passive does for Shaco that makes him either play better/smoother or enhances his play?\n> What do you think the net effect of the changes here is as it pertains to his contributions to a team in the early, mid, and late game?\n> \n> I'm especially interested in knowing, from a Shaco main (and other Shaco mains) specifically, what is it that Shaco should be doing (and that Shaco players want to do) in the late game that makes them and their teammates feel good about having him on the team?\n\nShaco is a very interesting champion.  He can be built in a variety of ways, but his job is usually to kill someone.  his kit isn't the best at killing multiple targets, but he can do it sometimes.  A fed Shaco can win a teamfight in an instant, while a behind shaco is almost useless except as an executioner, especially against tanks.  Shaco's e is basically a big Screw you to enemies, but it does make him feel playful when he does it.  The rest of his kit adds to his assassin aspect, and his clone adds to his silly/playful nature as well.  The only problem is that he can't handle late game tanks or ahead enemies with good frontlines.  One solution to this could be adding a debuff to his q that procs on the first enemy autoed that grants his teammates in a certain range more movement speed towards them for a short time, or make his e cause the target hit to deal slightly less damage.  For tanks, he could get some passive Armor pen (maybe on his JitB's autos or the clones).  Shaco as a whole isn't meant to be a team player or late game monster, but these would help him contend a bit.","replies":[{"poster":"Workshop Shaco","date":"2015-08-15T03:25:25.990+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rundus1,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=00080002,timestamp=2015-08-15T01:48:01.018+0000)\n>\n> Shaco is a very interesting champion.  He can be built in a variety of ways, but his job is usually to kill someone.  his kit isn't the best at killing multiple targets, but he can do it sometimes.  A fed Shaco can win a teamfight in an instant, while a behind shaco is almost useless except as an executioner, especially against tanks.  Shaco's e is basically a big Screw you to enemies, but it does make him feel playful when he does it.  The rest of his kit adds to his assassin aspect, and his clone adds to his silly/playful nature as well.  The only problem is that he can't handle late game tanks or ahead enemies with good frontlines.  One solution to this could be adding a debuff to his q that procs on the first enemy autoed that grants his teammates in a certain range more movement speed towards them for a short time, or make his e cause the target hit to deal slightly less damage.  For tanks, he could get some passive Armor pen (maybe on his JitB's autos or the clones).  Shaco as a whole isn't meant to be a team player or late game monster, but these would help him contend a bit.\n\nShaco shouldn't bring much to the table as far as helping his team through any other means besides making sure someone on their team dies. He should bring as much to the table for his team as a Rengar or Talon or Kha'zix.","replies":[{"poster":"Rundus1","date":"2015-08-15T18:51:42.914+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Workshop Shaco,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=000800020000,timestamp=2015-08-15T03:25:25.990+0000)\n>\n> Shaco shouldn't bring much to the table as far as helping his team through any other means besides making sure someone on their team dies. He should bring as much to the table for his team as a Rengar or Talon or Kha'zix.\n\nUmmmm Idk if i'm just failing to understand or not, but those guys all have good teamfighting capabilities.  Rengo has his AOE and CC plus his burst and ult to go in on the backline and wipe the entire thing out.  Talon goes in, gets a kill, ults, positions behind their team and AOE hurts them all while getting a second kill, and Kha jumps in for the resets and keeps on jumping.  Shaco is a slower version of them with more escapes and more potential for play-making, at the cost of team fight capabilities.  He can do it, its just hard for him.","replies":[{"poster":"Workshop Shaco","date":"2015-08-15T19:05:51.578+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Rundus1,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=0008000200000000,timestamp=2015-08-15T18:51:42.914+0000)\n>\n> Ummmm Idk if i'm just failing to understand or not, but those guys all have good teamfighting capabilities.  Rengo has his AOE and CC plus his burst and ult to go in on the backline and wipe the entire thing out.  Talon goes in, gets a kill, ults, positions behind their team and AOE hurts them all while getting a second kill, and Kha jumps in for the resets and keeps on jumping.  Shaco is a slower version of them with more escapes and more potential for play-making, at the cost of team fight capabilities.  He can do it, its just hard for him.\n\nThey are all assassins that do more or less the same thing. The only thing is that Shaco has a much smaller window to do it because he is _the least_ _mobile_ assassin with one short range gap closer and 0 ms steroids.","replies":[{"poster":"Rundus1","date":"2015-08-15T21:51:01.052+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Workshop Shaco,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=00080002000000000000,timestamp=2015-08-15T19:05:51.578+0000)\n>\n> They are all assassins that do more or less the same thing. The only thing is that Shaco has a much smaller window to do it because he is _the least_ _mobile_ assassin with one short range gap closer and 0 ms steroids.\n\nThis is true, but the other assassins you named all have teamfighting skills that are better than Shaco's (Rengar is arguable here).  Talons got AOE on his e and r, kha has his jumps and w AOE slows.  Shaco is more of a duelist assassin.  He can very easily take most people 1v1, and even 2v1 sometimes, but in large groups he is heavily reliant on confusion to win.  If the enemies are focused and know he's going to do his thing, he'll die instantaneously unless he builds tanky/bruiser, in which case he'll do little damage comparatively. Shaco's great when snowballing, or even when equal, but a behind shaco has little use except to set up box plays or help make a pick.  Shaco himself isnt likely to be able to 1v1 when behind, unlike those assassins who all have things in their kits to help with that (Kha's isolation damage, rengo's heals/roots and Talons ult are all pretty good tools in a 1v1.  Shaco has his ult, but any debuff gives him away and any ahead bursty enemies are likley to just instakill the both of them).  They may all be assassins, and share similar goals, but they do vastly different things to accomplish those goals.  Rengo's ult can be used to corral enemies into an ideal position for an ambush, Kha jumps in and flies right back out (or just all ins), Talon charges someone, blinks to his actual target and bursts them before running out with ult, but Shaco just appears in the middle of the fray and murders 1 person before trying to get out or ulting and just going in for the long haul.  When it gets harder to burst people later, Kha can still invis and leave, as can talon.  Rengo is a little less luck and so is Shaco.  Those two are similarly screwed when left standing in the middle of a fight with no outs.","replies":[{"poster":"Workshop Shaco","date":"2015-08-16T01:28:24.645+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rundus1,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=000800020000000000000000,timestamp=2015-08-15T21:51:01.052+0000)\n>\n> This is true, but the other assassins you named all have teamfighting skills that are better than Shaco's (Rengar is arguable here).  Talons got AOE on his e and r, kha has his jumps and w AOE slows.  Shaco is more of a duelist assassin.  He can very easily take most people 1v1, and even 2v1 sometimes, but in large groups he is heavily reliant on confusion to win.  If the enemies are focused and know he's going to do his thing, he'll die instantaneously unless he builds tanky/bruiser, in which case he'll do little damage comparatively. Shaco's great when snowballing, or even when equal, but a behind shaco has little use except to set up box plays or help make a pick.  Shaco himself isnt likely to be able to 1v1 when behind, unlike those assassins who all have things in their kits to help with that (Kha's isolation damage, rengo's heals/roots and Talons ult are all pretty good tools in a 1v1.  Shaco has his ult, but any debuff gives him away and any ahead bursty enemies are likley to just instakill the both of them).  They may all be assassins, and share similar goals, but they do vastly different things to accomplish those goals.  Rengo's ult can be used to corral enemies into an ideal position for an ambush, Kha jumps in and flies right back out (or just all ins), Talon charges someone, blinks to his actual target and bursts them before running out with ult, but Shaco just appears in the middle of the fray and murders 1 person before trying to get out or ulting and just going in for the long haul.  When it gets harder to burst people later, Kha can still invis and leave, as can talon.  Rengo is a little less luck and so is Shaco.  Those two are similarly screwed when left standing in the middle of a fight with no outs.\n\nThat's where the Q changes I listed come in. You still need to position correctly but you have a fair bit more wiggle room.","replies":[{"poster":"Rundus1","date":"2015-08-16T05:14:24.161+0000","up_votes":1,"down_votes":0,"body":"> That's where the Q changes I listed come in. You still need to position correctly but you have a fair bit more wiggle room.\n\nThey would help, but removing the bonus damage on his q would make his burst suffer a bit.  With the new passive you defined, he'd end up with better 1v1 potential, but his assassinations would suffer, as he'd never have burst equal to or greater than his current burst.  He'd just have an easier time doing damage continuously and handle tanks and such a tad easier.  I like the speed boost on the q, but I like his current passive better.  It's thematic and easy to use with his q, which gives him wondrous burst against 1v1.  Once a bit ahead, it even allows him to 2v1 or even 3v1 with decent ease by assassinating a carry and just monging his friend.  Still, while i am opposed to the passive, I do like the q speed buff, it'd let him get out a bit easier and cause more of a distraction in team fights, disrupting enemies and whatnot.","replies":[{"poster":"Workshop Shaco","date":"2015-08-16T06:10:02.559+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rundus1,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=00080002000000000000000000000000,timestamp=2015-08-16T05:14:24.161+0000)\n>\n> They would help, but removing the bonus damage on his q would make his burst suffer a bit.  With the new passive you defined, he'd end up with better 1v1 potential, but his assassinations would suffer, as he'd never have burst equal to or greater than his current burst.  He'd just have an easier time doing damage continuously and handle tanks and such a tad easier.  I like the speed boost on the q, but I like his current passive better.  It's thematic and easy to use with his q, which gives him wondrous burst against 1v1.  Once a bit ahead, it even allows him to 2v1 or even 3v1 with decent ease by assassinating a carry and just monging his friend.  Still, while i am opposed to the passive, I do like the q speed buff, it'd let him get out a bit easier and cause more of a distraction in team fights, disrupting enemies and whatnot.\n\nHis burst would be completely fine, the numbers on his passive actually scale to the same point as the numbers on his Q. I would rather him have more chances to get to their backline than for him to be doing almost a thousand damage more than he needs to in order to kill their carry.","replies":[{"poster":"Rundus1","date":"2015-08-16T17:28:21.250+0000","up_votes":1,"down_votes":0,"body":"> His burst would be completely fine, the numbers on his passive actually scale to the same point as the numbers on his Q. I would rather him have more chances to get to their backline than for him to be doing almost a thousand damage more than he needs to in order to kill their carry.\n\nWith his current q and passive damage stacking multiplicatively (or so i've been told), current Shaco will actually have a higher initial burst with q->auto->e (your passive puts his auto at 160% damage lv 1, his current q auto when behind a champ is 168% and his e deals 20% more fro behind, so it's not insubstantial).  While this new shavo would have more overall damage with a q->auto->e->auto, it also makes him take longer to perform his damage, allotting more time for them to react, and shaco already has issues bursting 1 target if he is forced to initiate or the enemy is on the look-out for him.  Just his q->auto->e can be long enough for them to lock you down and stomp you.  However, should a Shaco be fed, his combo practically 1 shots someone and leaves him to fight the rest of the team, which isn't too hard sometimes with his ult and boxes.  Your Shaco though will be more snowball-oriented it seems.  Able to go in, mong a squishy and speed towards the next target.  Bruiser Shaco would be a good deal stronger and his ganks would be too (for bot or counter ganks).  As to his damage being too much, well that's only if you're ahead.  If Shaco falls behind now he needs every ounce of burst to try and pick up kills, and is often forced to be clean-up crew Shaco or die trying to teamfight.  Your Shaco will still have that issue, but it does sound like he'd fare better against tanks and be able to possibly burst a bit better when behind, as it sounds like his 2nd empowered auto would really help.   Its tough to disclaim either Shaco, as yours is better sounding when behind, but also a tad more overbearing when ahead.  As is, Shaco that gets behind is in a pretty bad spot, but an even or ahead Shaco can easily stomp already, so I'm still on the fritz with some of your Shaco's kit still.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"DeadPuddle","date":"2015-08-17T18:00:08.587+0000","up_votes":1,"down_votes":0,"body":"I don't like these suggested changes. workshop shaco clearly has his own view of how to play shaco and this suggestion is a linear design following that playstyle. This flat out removes lane shaco from the game by limiting his boxes and full AP shaco now has no scaling with W,  E + no backstab bonus\n, with the changes to his passive AP shaco now has to dive into a fight where he usually would simply use his boxes, ult + E to hit enemy's with spells.\n\nit's also totally broken for AD shaco (taking his crit off his Q and putting it on his passive puts it right back on his Q and his W, E and R skills, talk about broken, with the AD and AP scaling + two auto attacks hybrid shaco would be dealing twice the damage more AD shaco does now when he has either lick bane or trinity force)\n\nIf you want to work on shaco by all means but he doesn't need a rework. the only thing he's lacking is late game scaling somewhere in his kit and the AI/control of the clone needs work, that's it.\n\nThe late game scaling should help him if he's fallen behind in the match early so he's not completely useless. something akin to the changes just made to Lee Sin.\n\nwhen you command your clone to attack an enemy and you lose sight of them the clone stops moving. something like an attack move to their last known location would be perfect or simply have his normal movement be an attack move command that ignores minions and prioritises champions.\n\nadditional if you could choose to detonate his clone early that may be needed but removes a level of counterplay to his ult. perhaps its too strong.\n\nhigh level shaco mains don't want a rework and lower level players love him but blame his kit for failing to play him properly. no need for a rework.","replies":[{"poster":"Workshop Shaco","date":"2015-08-18T02:16:09.180+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DeadPuddle,realm=EUW,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=00080003,timestamp=2015-08-17T18:00:08.587+0000)\n>\n> I don't like these suggested changes. workshop shaco clearly has his own view of how to play shaco and this suggestion is a linear design following that playstyle. This flat out removes lane shaco from the game by limiting his boxes and full AP shaco now has no scaling with W,  E + no backstab bonus\n> , with the changes to his passive AP shaco now has to dive into a fight where he usually would simply use his boxes, ult + E to hit enemy's with spells.\n> \n> it's also totally broken for AD shaco (taking his crit off his Q and putting it on his passive puts it right back on his Q and his W, E and R skills, talk about broken, with the AD and AP scaling + two auto attacks hybrid shaco would be dealing twice the damage more AD shaco does now when he has either lick bane or trinity force)\n> \n> If you want to work on shaco by all means but he doesn't need a rework. the only thing he's lacking is late game scaling somewhere in his kit and the AI/control of the clone needs work, that's it.\n> \n> The late game scaling should help him if he's fallen behind in the match early so he's not completely useless. something akin to the changes just made to Lee Sin.\n> \n> when you command your clone to attack an enemy and you lose sight of them the clone stops moving. something like an attack move to their last known location would be perfect or simply have his normal movement be an attack move command that ignores minions and prioritises champions.\n> \n> additional if you could choose to detonate his clone early that may be needed but removes a level of counterplay to his ult. perhaps its too strong.\n> \n> high level shaco mains don't want a rework and lower level players love him but blame his kit for failing to play him properly. no need for a rework.\n\nI don't think you realize that the passive has a cooldown, and the reason it works for all abilities is because he doesn't have a free +20% dmg amp anymore. \n\nAlso, it's not a nerf to AP Shaco it's a playstyle shift. You made it sound like I completely gutted it. Meanwhile his ult explosion damage is completely untouched, his E in most cases is untouched, his boxes have a limit on them because they got a fair bit stronger; meaning that while you have to think about where you're placing them now, you're not losing too much power. Currently AP Shaco is extremely unhealthy and the only reason I didn't remove it in my proposed rework was because a lot of the Shaco players I've talked to told me not to remove it. \n\nIn fact with the new passive, AP Shaco has more potential. He no longer needs to wait for enemies to walk into boxes or wait for his ult explosion and E cooldown in order to deal damage. Now instead of a Shaco building {{item:3165}} {{item:3158}} {{item:3135}} {{item:3040}} {{item:3089}} {{item:3285}} and then just sitting there spamming E late game and hoping that he gets to poke them down enough before the enemy team engages and wins the fight because he can't actually do much, he will be able to build something like {{item:3001}} {{item:3020}} {{item:3100}} {{item:3157}} {{item:3089}} {{item:3285}}   and play similarly to a Diana or Fizz. \n\nAs for your comment on Shaco's late game, that clearly indicates that you don't play him because Shaco is actually super item reliant. You can literally go back to page 2 and read everything me and other people said about his power level at every stage of the game. \n\nOne thing I do agree with you on is that his clone is a giant buggy mess and desperately needs some fixes.\n\nLastly, I've talked to maybe 10-15 Shaco players from silver to master tier. Some of them said he just needs QoL changes and bug fixes, other said his E and ult are fine and it's just his Q being op and boxes being borderline useless. I said this at the very top of my first post.","replies":[{"poster":"DeadPuddle","date":"2015-08-18T13:37:11.283+0000","up_votes":1,"down_votes":0,"body":"There's no consistent drive behind these changes, do you want his late game stronger? do you want his mid game stronger? The proposed changes are nothing more than a straight buff to AD shaco.\n\nlet's take a look at the proposed change to his kit more closely, \n\n**His Q**\n[Buff] +50 range (can now clear thicker walls and close distance)\n[Buff] mana cost lowered\n~~[Nerf]~~ loss of .5-second stealth can be ignored due to buff to distance\n~~[Nerf]~~ [Buff] removal of crit can also be ignored as it's now on his passive and stronger than before.\n[Buff] increased movement speed (not sure why it's decaying, this is designed to allow enemies to react but you're invisible??)\n\nyour adding buffs to make him stronger then nerfing some power but adding it elsewhere in his kit resulting in an overall a buff to his Q and kit, he's now stronger early, mid and late game when invading and ganking. this is more \"snowbally\" than before.\n\n**His W**\n[Large Buff] a 1-second delay give's the enemy no counterplay to the boxes.\n[Buff] increasing the boxes timer results in far more objective control around the map and dragon/baron\n[Buff] 7 seconds means more damage output for the boxes on starting camps and enemies\n[Buff] flat damage on the boxes increases their early damage, lowering AP ratio and adding AD ratio reduces effectiveness of building AP shaco/encourages AD shaco build\n[Nerf] limiting number of boxes, yes this limits stacking but is only a small nerf as the boxes are now stronger then before you can stack less and deal the same level of damage.\n[Massive Buff] reduced aoe and damage over time effects, can now be dropped used effectively in team fights as a mini hecarim ult every 10-16 seconds (depending on cooldown), you just gave shaco 2 ults.\n[Buff]reduced damage from monsters, yes the boxes are next to useless on camps later in the game but by then you can destroy them faster with tiamat/hydra, this change encourages a shift to other items such as lichbane or trinity force earlier which coupled with his passive gives a massive boost to his burst damage.\n[Comment](shaco boxes already prioritize whoever shaco is attacking)\n\nOverall a buff to the damage and map control of his boxes.\n\n**His E**\n[Nerf] reduced slow for 1 second\n[Large Nerf] lack of slow on attack, shaco now has an issue when sticking to his target during combat, any enemy with more movement speed can simply walk away from shaco.\n[Massive Buff](your attacks still cause monster to miss attacks, so they miss attacking your new tanking boxes? and is doubled when attacking from behind?? boxes now tank twice or three times more damage, shaco is immune to damage from the jungle? why)\n\n[Comment] with no changes to his AP scaling and the removal of his 20% bonus damage from back attacks his E now deals less damage for AP shaco, that is unless the new passive also procs lunden's echo on-hit effect twice in which case this is a massive buff to a none skill shot ability making AP shaco poke broken as hell.\n\nOverall another large buff to shaco's jungle but adds further issues in combat when ganking.\n\n**His R**\n[Buff] range increase makes it easier to R over walls and increasing his movement and escape. can also send clone into the middle of a teamfight to explode.\n[Small Buff] clown explodes when shaco dies, adds more reliable damage.\n\nOverall a buff to his ult.\n\n\n**********************************************************************************************\n\nIt's strange that you can't see the changes are a straight buff to every ability and shaco's kit overall.\n\n\n> I don't think you realize that the passive has a cooldown, and the reason it works for all abilities is because he doesn't have a free +20% dmg amp anymore.\n\nit could have a 7 second cooldown, you've still boosted his synergy with items to the point of madness,  and he's going to get those items early due to his new \"snowbally kit\"\n\n> his E in most cases is untouched\n\nyou removed the +20% damage his E makes use of, that's a nerf of about...20%??\n\n> his boxes have a limit on them because they got a fair bit stronger\n\nyou've made it so instead of having to stack 3 boxes in one spot I can now place 1 and it does the same level of damage. If i were to stack 3 they would kill a player easily\n\n> Currently AP Shaco is extremely unhealthy\n\nthere are plenty of AP shaco's in diamond and challenger, where is this statement coming from?\n\n> He no longer needs to wait for enemies to walk into boxes or wait for his ult explosion and E cooldown in order to deal.\n\nYea, those were the downsides of those ability's, they have massive damage and some CC, now they have even more damage, the same cc and you can use them offensively. we call that a buff.\n\n> play similarly to a Diana or Fizz.\n\nI'm pretty sure shaco players want to play shaco, they don't want to play diana or fizz, they don't even want to play similarly to diana or fizz\nthey chose to play shaco to play shaco.\n\n\nIt's very clear that the changes increase the damage of shaco, a champion who has had a winrate of 49-55% since his release. the buff is simply not justified, this is just my opinion as a shaco player and a games designer","replies":[{"poster":"KONO RUBICK DA","date":"2015-08-18T15:37:39.070+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DeadPuddle,realm=EUW,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=0008000300000000,timestamp=2015-08-18T13:37:11.283+0000)\n>\n> There's no consistent drive behind these changes, do you want his late game stronger? do you want his mid game stronger? The proposed changes are nothing more than a straight buff to AD shaco.\n> \n> let's take a look at the proposed change to his kit more closely, \n> \n> **His Q**\n> [Buff] +50 range (can now clear thicker walls and close distance)\n> [Buff] mana cost lowered\n> ~~[Nerf]~~ loss of .5-second stealth can be ignored due to buff to distance\n> ~~[Nerf]~~ [Buff] removal of crit can also be ignored as it's now on his passive and stronger than before.\n> [Buff] increased movement speed (not sure why it's decaying, this is designed to allow enemies to react but you're invisible??)\n> \n> your adding buffs to make him stronger then nerfing some power but adding it elsewhere in his kit resulting in an overall a buff to his Q and kit, he's now stronger early, mid and late game when invading and ganking. this is more \"snowbally\" than before.\n> \n> **His W**\n> [Large Buff] a 1-second delay give's the enemy no counterplay to the boxes.\n> [Buff] increasing the boxes timer results in far more objective control around the map and dragon/baron\n> [Buff] 7 seconds means more damage output for the boxes on starting camps and enemies\n> [Buff] flat damage on the boxes increases their early damage, lowering AP ratio and adding AD ratio reduces effectiveness of building AP shaco/encourages AD shaco build\n> [Nerf] limiting number of boxes, yes this limits stacking but is only a small nerf as the boxes are now stronger then before you can stack less and deal the same level of damage.\n> [Massive Buff] reduced aoe and damage over time effects, can now be dropped used effectively in team fights as a mini hecarim ult every 10-16 seconds (depending on cooldown), you just gave shaco 2 ults.\n> [Buff]reduced damage from monsters, yes the boxes are next to useless on camps later in the game but by then you can destroy them faster with tiamat/hydra, this change encourages a shift to other items such as lichbane or trinity force earlier which coupled with his passive gives a massive boost to his burst damage.\n> [Comment](shaco boxes already prioritize whoever shaco is attacking)\n> \n> Overall a buff to the damage and map control of his boxes.\n> \n> **His E**\n> [Nerf] reduced slow for 1 second\n> [Large Nerf] lack of slow on attack, shaco now has an issue when sticking to his target during combat, any enemy with more movement speed can simply walk away from shaco.\n> [Massive Buff](your attacks still cause monster to miss attacks, so they miss attacking your new tanking boxes? and is doubled when attacking from behind?? boxes now tank twice or three times more damage, shaco is immune to damage from the jungle? why)\n> \n> [Comment] with no changes to his AP scaling and the removal of his 20% bonus damage from back attacks his E now deals less damage for AP shaco, that is unless the new passive also procs lunden's echo on-hit effect twice in which case this is a massive buff to a none skill shot ability making AP shaco poke broken as hell.\n> \n> Overall another large buff to shaco's jungle but adds further issues in combat when ganking.\n> \n> **His R**\n> [Buff] range increase makes it easier to R over walls and increasing his movement and escape. can also send clone into the middle of a teamfight to explode.\n> [Small Buff] clown explodes when shaco dies, adds more reliable damage.\n> \n> Overall a buff to his ult.\n> \n> \n> **********************************************************************************************\n> \n> It's strange that you can't see the changes are a straight buff to every ability and shaco's kit overall.\n> \n> it could have a 7 second cooldown, you've still boosted his synergy with items to the point of madness,  and he's going to get those items early due to his new \"snowbally kit\"\n> \n> you removed the +20% damage his E makes use of, that's a nerf of about...20%??\n> \n> you've made it so instead of having to stack 3 boxes in one spot I can now place 1 and it does the same level of damage. If i were to stack 3 they would kill a player easily\n> \n> there are plenty of AP shaco's in diamond and challenger, where is this statement coming from?\n> \n> Yea, those were the downsides of those ability's, they have massive damage and some CC, now they have even more damage, the same cc and you can use them offensively. we call that a buff.\n> \n> I'm pretty sure shaco players want to play shaco, they don't want to play diana or fizz, they don't even want to play similarly to diana or fizz\n> they chose to play shaco to play shaco.\n> \n> \n> It's very clear that the changes increase the damage of shaco, a champion who has had a winrate of 49-55% since his release. the buff is simply not justified, this is just my opinion as a shaco player and a games designer\n\nlimiting his box to 5 isn't a large nerf, with 40% cooldown you would only put 6 boxes at max.","replies":[{"poster":"DeadPuddle","date":"2015-08-18T16:23:09.286+0000","up_votes":1,"down_votes":0,"body":"The nerf was not referring to the limit of 5 boxes late game past level 16.\n\nI'm not sure if you've ever played shaco in lane but zone controlling your opponents movement is the most important aspect of running a lane shaco, without it you cannot lane with him.\n\nThe large nerf is in reference to limiting shaco to 3 boxes in the early laning phase. \n\n> New Effect: Shaco can now only have a maximum of 3/4/5 boxes placed (at levels 1/11/16)\n\nThis practically illuminates shaco being able to play in the lane. without the threat of stacking fears he just gets dove on and killed by any champion.\n\nAs I said before these proposed changes tunnel shaco really hard into only being played AD jungle, it removes the incentive to play AP shaco and remove the possiblity of playing shaco inlane.","replies":[]}]}]}]}]},{"poster":"Workshop Shaco","date":"2015-08-14T17:51:38.776+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=0008,timestamp=2015-08-14T06:28:06.436+0000)\n>\n> Cool ideas for Shaco! Few questions....\n> \n> What do you think this new passive does for Shaco that makes him either play better/smoother or enhances his play?\n> What do you think the net effect of the changes here is as it pertains to his contributions to a team in the early, mid, and late game?\n> \n> I'm especially interested in knowing, from a Shaco main (and other Shaco mains) specifically, what is it that Shaco should be doing (and that Shaco players want to do) in the late game that makes them and their teammates feel good about having him on the team?\n\nThe new passive was simply to retain his burst without having his Q be completely overloaded. Currently his Q is so good that most high elo Shaco (and myself for this matter) max Q at level 11 as opposed to putting another point in his ult because the burst is just more valuable. This strings from his ult being an unreliable buggy mess and his Q being half the power in his kit. I think that says enough for itself as far as the Q really needing to be nerfed so the rest of his kit could have something. \n\nAs for how his team benefits from his new passive, currently Shaco early on is great because of his ganks but what most people don't realize is just how item reliant is. People think Shaco falls off late game, and that's not true in most elos. Shaco's 5-6 item power spiking is one of the best the game. His issue with late game is a result of his terrible mid game, where he is too squishy to skirmish or teamfight without just dying instantly and getting nothing done because he won't have enough burst to actually kill his target before he dies. This makes it hard for him to transition into the late game where he can just auto attack (literally just Q-->Auto) to kill an ADC. The changes are to make his power-curve more linear as opposed to it just being high early, then stagnant for the 20-35 min mark, and then shoot off the charts. This means his team won't have to work around having a Shaco anymore than they would have to work around having a Kha'zix or Rengar. \n\nAs for what I think Shaco should be doing, I currently play him as both an AP support or top laner and as an AD assassin jungler. Shaco mains don't typically agree on how to play him, what runes he needs to take, what jungle routes are the best, or any of that; every Shaco main has developed their own 'Shaco Personality'. This is why I tried not to kill off AP Shaco in this rework, or make him need incredibly high amounts of AD to be relevant. We have high elo Shacos like Shaclone who goes bruiser Shaco and Pink Ward who mains AP lane Shaco; then we have idophinx3 who sat in master tier last season playing Shaco as an AD mid laner. He is incredibly diverse and I want to keep that, that's who he is. \n\nThat being said, Shaco typically specializes in disrupting and killing the enemy backline, just like a normal assassin. Though AP Shaco plays as a \"supportish assassin\" according to Pink Ward, for the most part that's what he does: kill their carries. However, currently people hate Shaco all around. The enemy team doesn't want to play against one and your team doesn't want one either, heck I don't even like having Shacos on my team. People see him as a useless champion that's just annoying and something that is going to be useless after 20 min in. To be completely honest right now there isn't a reason to pick Shaco over meta junglers. \n\nRight now Shaco needs to be a positioning mastermind to do something a Rengar can do by pressing R from halfway across the map and then smashing his forehead into the keyboard once he gets within jumping distance. Shaco's Q range is still not even as long as flash's range so if you're not incredibly careful you're going to die before you even get close because he is hard countered by a 250 gold pink ward trinket. Basically what I'm trying to say is, trading the 20% damage amp to make him getting to do his job better will make him far more reliable and a bit more forgiving without actually making him insanely op; which is really what he needs, he won't have to be a suicide assassin that makes it 4v4 with the Q changes because he has the potential to get away now. He will be better at his job and his team can rely on him later into the game to get stuff done.","replies":[]}]},{"poster":"Shroom Junkie","date":"2015-08-14T18:29:00.062+0000","up_votes":1,"down_votes":0,"body":"Shaco seems like he's in a pretty good place right now, in my opinion....\nHe's really good early game, kinda mid-game, and falls off late. Kinda like Lee Sin.\nBut maybe that's just me, I personally don't play too much Shaco so I can't say anything.","replies":[{"poster":"Workshop Shaco","date":"2015-08-14T18:32:09.772+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Coriandr,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=000e,timestamp=2015-08-14T18:29:00.062+0000)\n>\n> Shaco seems like he's in a pretty good place right now, in my opinion....\n> He's really good early game, kinda mid-game, and falls off late. Kinda like Lee Sin.\n> But maybe that's just me, I personally don't play too much Shaco so I can't say anything.\n\nThat's pretty much Shaco's stereotype summed up. The only part of what you said that is correct is the good early game, and it's not even because he is op early. He can't even 1v1 most junglers anymore, the only reason he was able to in the past was because he had the luxury of starting dblade. He still gets screwed over in counter ganks and that's part of the counter play people seem to don't think that he has, the truth is you can completely negate his early game power if you know what you're doing.\n\nHe isn't in too great of a spot, people just don't know what to do against him. ","replies":[{"poster":"Troy242621","date":"2015-08-14T20:12:39.354+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Workshop Shaco,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=000e0000,timestamp=2015-08-14T18:32:09.772+0000)\n>\n> That's pretty much Shaco's stereotype summed up. The only part of what you said that is correct is the good early game, and it's not even because he is op early. He can't even 1v1 most junglers anymore, the only reason he was able to in the past was because he had the luxury of starting dblade. He still gets screwed over in counter ganks and that's part of the counter play people seem to don't think that he has, the truth is you can completely negate his early game power if you know what you're doing.\n> \n> He isn't in too great of a spot, people just don't know what to do against him.\n\nThis is actually pretty true. People believe he's just strong early then weak late, but the truth about his power curve is this.\n\n\n-----\n**Early game**\nAt level one, he has a wickedly fast first buff clear speed, and most people know this. It poises him for an early game invade (That can be a waste of time if you know how to react properly).\n\nLevel two Shaco is one of the strongest level twos in the game.  Damage steroid, critical hit and CC. I only know Lee Sin and Rek'Sai are able to duel him at this stage.\n\nImmediately at level 3 his advantage compared to other level 3 champions really isn't that great. Yes he has two-shiv poison, but often times, other champions are just starting to get there escape skills here, the enemy jungler probably had their clear speed/sustain skills chosen so they're now taking their CC/Mobility skills, and Shaco is left with a point-and-click slow. That just doesn't compare favorably. Still, pretty decent.\n\nRight around his first back, he becomes outright weak. No, really. Try using Shaco when you've just backed, bought your jungle items but not yet bought a damage item. If the enemies were remotely competent and didn't get cheesed, you're now in a bad spot. Your ganks are,..Okay. Nothing spectacular. Your clear speeds are below average. Things start to look up a bit when you buy that first Pickaxe for the damage spike, but then you **need** to make something happen.\n\nThe last thing compromising his early game is his,...Well I'm sorry to say, his allies. If you want to just screw your Shaco over, as soon as he uses Deceive, go absolute ham. Really. Because when you do this, you make it impossible for him to 1. Get behind them for the backstab amp+deceive crit and 2. To lay down his box to cut off their escape route. Effectively this removes all of his hard CC. What's his gank, then? Basically? He Deceives in, autoattacks while orbwalking to maybe get two attacks in before throwing his shiv and walking off. That's his infamous \"Early game power\" when you do this. Imagine how that stacks up to other junglers.\n------\n**Mid Game**\nShaco's weakest point by far. He has a jungler's budget, which can be constrained even further by the competency of his enemies preventing him from getting kills. He has low income in a situation like this. What makes this worse is that he has the grocery list of an ADC. {{item:3074}} {{item:3087}} {{item:3031}} {{item:3006}} {{item:3035}} are all extremely expensive. Unless he snowballs, his end game isn't that great.\n-----\n**End Game**\nEveryone considers this his weakest point, but I'm not among them. He can damn near instakill the ADC if he has enough items built, and he can demand tremendous levels of attention split pushing. He isn't a Vayne or a Jax, but his end game fall off is severely exaggerated, and is definitely a step up in power compared to his mid game. Half-finished expensive items with poor stats like {{item:3086}}/{{item:3093}} just aren't that intimidating, and the expensive costs greatly delay his power spikes if behind. His end game is fairly decent;  provided he reaches his end game around the time everyone else does. Backstab damage amp, Deceive damage amp, Deceive crit, his clone and so on.Alas, this often times does not happen.","replies":[{"poster":"Workshop Shaco","date":"2015-08-14T20:20:05.533+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Troy242621,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=000e00000000,timestamp=2015-08-14T20:12:39.354+0000)\n>\n> This is actually pretty true. People believe he's just strong early then weak late, but the truth about his power curve is this.\n> \n> \n> -----\n> **Early game**\n> At level one, he has a wickedly fast first buff clear speed, and most people know this. It poises him for an early game invade (That can be a waste of time if you know how to react properly).\n> \n> Level two Shaco is one of the strongest level twos in the game.  Damage steroid, critical hit and CC. I only know Lee Sin and Rek'Sai are able to duel him at this stage.\n> \n> Immediately at level 3 his advantage compared to other level 3 champions really isn't that great. Yes he has two-shiv poison, but often times, other champions are just starting to get there escape skills here, the enemy jungler probably had their clear speed/sustain skills chosen so they're now taking their CC/Mobility skills, and Shaco is left with a point-and-click slow. That just doesn't compare favorably. Still, pretty decent.\n> \n> Right around his first back, he becomes outright weak. No, really. Try using Shaco when you've just backed, bought your jungle items but not yet bought a damage item. If the enemies were remotely competent and didn't get cheesed, you're now in a bad spot. Your ganks are,..Okay. Nothing spectacular. Your clear speeds are below average. Things start to look up a bit when you buy that first Pickaxe for the damage spike, but then you **need** to make something happen.\n> \n> The last thing compromising his early game is his,...Well I'm sorry to say, his allies. If you want to just screw your Shaco over, as soon as he uses Deceive, go absolute ham. Really. Because when you do this, you make it impossible for him to 1. Get behind them for the backstab amp+deceive crit and 2. To lay down his box to cut off their escape route. Effectively this removes all of his hard CC. What's his gank, then? Basically? He Deceives in, autoattacks while orbwalking to maybe get two attacks in before throwing his shiv and walking off. That's his infamous \"Early game power\" when you do this. Imagine how that stacks up to other junglers.\n> ------\n> **Mid Game**\n> Shaco's weakest point by far. He has a jungler's budget, which can be constrained even further by the competency of his enemies preventing him from getting kills. He has low income in a situation like this. What makes this worse is that he has the grocery list of an ADC. {{item:3074}} {{item:3087}} {{item:3031}} {{item:3006}} {{item:3035}} are all extremely expensive. Unless he snowballs, his end game isn't that great.\n> -----\n> **End Game**\n> Everyone considers this his weakest point, but I'm not among them. He can damn near instakill the ADC if he has enough items built, and he can demand tremendous levels of attention split pushing. He isn't a Vayne or a Jax, but his end game fall off is severely exaggerated, and is definitely a step up in power compared to his mid game. Half-finished expensive items with poor stats like {{item:3086}}/{{item:3093}} just aren't that intimidating, and the expensive costs greatly delay his power spikes if behind. His end game is fairly decent;  provided he reaches his end game around the time everyone else does. Backstab damage amp, Deceive damage amp, Deceive crit, his clone and so on.Alas, this often times does not happen.\n\nThis sums it up quite nicely.","replies":[]}]},{"poster":"DeadPuddle","date":"2015-08-18T16:31:38.637+0000","up_votes":1,"down_votes":0,"body":"It's a stereotype because the vast majority share this opinion. that doesn't make it true. shaco's power dips in mid game and comes back strong lategame.\n\nhe can instant kill adc's in teamfights provided he goes in after the fight has started. people consider him weak in teamfights because a large ammount of players with no experience dive into a fight and die right away. there not playing the champion to his strengths.","replies":[]}]}]},{"poster":"KONO RUBICK DA","date":"2015-08-14T02:31:09.186+0000","up_votes":1,"down_votes":1,"body":"I don't know if it is still the case, but riot promised a rework in season 3. Back then they said they would make his clone casting spells by R+Q/W/E (with a shared cooldown). They also said that they will rework his E, because it gives him to much toxicity and it is the least identity spell","replies":[{"poster":"Workshop Shaco","date":"2015-08-14T02:40:06.317+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ZeusHasRefresher,realm=EUW,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=0003,timestamp=2015-08-14T02:31:09.186+0000)\n>\n> I don't know if it is still the case, but riot promised a rework in season 3. Back then they said they would make his clone casting spells by R+Q/W/E (with a shared cooldown). They also said that they will rework his E, because it gives him to much toxicity and it is the least identity spell\n\nRiot probably scrapped it. Remember the Warwick rework they announced and that never happened?","replies":[]}]},{"poster":"Sixofspades","date":"2015-08-14T02:57:09.442+0000","up_votes":2,"down_votes":1,"body":"In my opinion the changes to W seem a bit over tuned. Obviously as AD you will not be maxing W first however the base damage change on top of the increased duration is quite large. With the 1.6 attacks per second on the box you are increasing it from 8 attacks to 11, per box for a total of 45-75 base damage increase per box before the additional 10% bonus AD scaling.\n\nOn top of that a damage reduction buff from large monsters scaling to 40% buffing his target switching which is already a strong part of hit kit will result in him always finishing his jungle clears extremely healthy. \n\nAside from that I'm wondering if the proc rate of E should be changed on your rework idea as currently it synergises extremely bad with the Krugg buff as you will be both stunning and blinding camps at the same time leaving one of the buffs irrelevant.\n\nOther than that cool ideas, they seem to emphasise Shaco's character well.","replies":[{"poster":"Workshop Shaco","date":"2015-08-14T03:09:10.512+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sixofspades,realm=OCE,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=0004,timestamp=2015-08-14T02:57:09.442+0000)\n>\n> In my opinion the changes to W seem a bit over tuned. Obviously as AD you will not be maxing W first however the base damage change on top of the increased duration is quite large. With the 1.6 attacks per second on the box you are increasing it from 8 attacks to 11, per box for a total of 45-75 base damage increase per box before the additional 10% bonus AD scaling.\n> \n> On top of that a damage reduction buff from large monsters scaling to 40% buffing his target switching which is already a strong part of hit kit will result in him always finishing his jungle clears extremely healthy. \n> \n> Aside from that I'm wondering if the proc rate of E should be changed on your rework idea as currently it synergises extremely bad with the Krugg buff as you will be both stunning and blinding camps at the same time leaving one of the buffs irrelevant.\n> \n> Other than that cool ideas, they seem to emphasise Shaco's character well.\n\nI think I might lower the W numbers again. That being said the bonus AD ratio will barely be noticeable early game, it might result in literally +1-2 dmg until you recall and get some AD since it will only be able to scale off of your runes and masteries until then. Also, his level 1 first camp clear will be roughly the same since although he will have less boxes the damage is still going to be enough. \n\nThe damage reduction part of it will only matter later into the game when lets say blue buff is able to kill a box in one attack, and it's meant to address that directly. Currently a good Shaco will just aggro swap in between attacks before taking aggro back, making it so that the camp doesn't get to attack at all and Shaco takes no damage while the box only takes damage from the small creeps. \n\nAs for his E passive, it would be the monster's next attack so it will still be applied if it attacks you after the stun is over.","replies":[]}]},{"poster":"xl Kirito lx","date":"2015-08-14T02:21:24.470+0000","up_votes":2,"down_votes":1,"body":"Looking at it, a few things come to mind\n\n- 3 box maximum at level 1, means his first clear is going to be slower.  idk how you play Shaco, but the 4 box start is really important to his early game imo.  \n- The RNG factor on his E, 1 in 5 hits is effectively a 20% chance.  Even using boxes to shift aggro, that's still 25% - 33% depending on clear speed.  Again, might be personal preference, I'm the guy that gets 3 misses in a row.  \n\nLoss of DFG already hurt ap shaco, don't kill him off more plox.  The biggest worry is that this'll turn out to be a flat buff to Shaco.  I respect that he's not in a great position right now, but he's the type of champion that shouldn't necessarily be in a good position.  Same way if people suggested Nunu buffs or Rengar buffs.","replies":[{"poster":"Workshop Shaco","date":"2015-08-14T02:39:03.296+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=LoneWolfKirito,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=0002,timestamp=2015-08-14T02:21:24.470+0000)\n>\n> Looking at it, a few things come to mind\n> \n> - 3 box maximum at level 1, means his first clear is going to be slower.  idk how you play Shaco, but the 4 box start is really important to his early game imo.  \n> - The RNG factor on his E, 1 in 5 hits is effectively a 20% chance.  Even using boxes to shift aggro, that's still 25% - 33% depending on clear speed.  Again, might be personal preference, I'm the guy that gets 3 misses in a row.  \n> \n> Loss of DFG already hurt ap shaco, don't kill him off more plox.  The biggest worry is that this'll turn out to be a flat buff to Shaco.  I respect that he's not in a great position right now, but he's the type of champion that shouldn't necessarily be in a good position.  Same way if people suggested Nunu buffs or Rengar buffs.\n\nThe boxes got stronger, that's why there is a cap; his first clear will be roughly the same. As for the RNG factor on his E, I can either go an entire jungle clear without needing health pots to stay above 80% HP or I can be almost dead by the 4th camp. It's completely unreliable at the moment and needs to be changed. \n\nAP Shaco is still in an extremely good spot right now regardless of the fact that DFG was removed. If Shaco was given my updated kit, AP Shaco would still be able to nuke people with his E and Ult explosion as well as set traps of boxes. However now he won't be completely unkillable when playing against a melee during lanning phase or be completely ungankable, so it gives the enemy laner some wiggle room. Not to mention he now has a mini lich bane effect after using abilities as compensation for the slight W nerfs. If anything it'll be a healthy playstlye change for AP Shaco while also being a slight buff. \n\nAs for the last bit, I feel like I removed some of the problems with him being 'unfun' to play against. For example, he now longer has a passive permaslow on his auto attacks.","replies":[]}]},{"poster":"Thust","date":"2015-08-19T18:42:16.499+0000","up_votes":1,"down_votes":0,"body":"You are tweaking the numbers but you're not suggesting any cool ideas imo.\nWell if you would be interested, these are mine:\n\n1) Give him an escape. \nDon't say this is crazy, just hear me out: whenever the enemy runs into one of his boxes they receive a debuff that states that when they get killed by shaco in the next 10seconds or so, his deceive resets. \nThis would be nice to get that 'be-aware-of-shaco-feeling' like you have when you play vs a teemo (mushrooms). \nMaybe, if you feel like this would be too overpowered, just give him a 2 seconds stealth with speedbuff that would give him a little bit more breathing room when assassinating the backline. In soloQ your team ins't always that fast to react and the 2 second stealth would give them that slight timewindow to come save you etc. \n\n2) Controlable ult\nLike in the original post: when using your ult let your cursor deceide where and HOW FAR you and your clone (on the opposite side of your starting position) would appear from your original position. Mind there would be a minimum distance so that you cant stack the clone and yourself on the original place. The radius would be the same but it would allow us to be more in control and maybe use it as a more consistant blink when ur in that crappy spot where u just wished you had your deceive up. \n\n3) passive indicator\nDon't change the passive that much, just give us a tooltip only visable for the player that indicates where the backside if the champ is, kinda like fiora is now. Also add something as \"flanking strikes\" where you get part of the damage modifier (i.g. 10%) instead of the full 20% when striking from the side. Maybe even intigrate a %health of the target as true damage when striking from the back after deceive? \nAnyway i wouldn't remove his \"backside\" steroid, its very unique too him. \n\n4) the boxes limiting thingy is a bit meh... \nHis jungle start is fast and thats how it should be. If the enemy team runs in activates your boxes your allready screwed. With the suggested changed, having an extra box to put on the outskirts of the river to prevent them from invading or to get your team to react faster to the invade sounds wonderfull. \n\nWell these are my thoughts. I dont really hate on the TwoShivPoison that much because the icon and the idea behind it are all very \"shaco-like\" too me, just update the projectile animation (the spinning knife is kinda outdated).\n\n\n\nJust a quick remark i would like to make towards potential riot-workers who might scroll throught this post in search of ideas: try to stay away from the exclamation mark that rengar and eve have. It might be unnecessary to say because unlike eve (who has perma stealth) and rengar ( who gets vision of the whole enemy team) shaco does not get any gamechanging info. The visible puff of smoke is all the warning that people would need vs shaco (imo).","replies":[]},{"poster":"Workshop Shaco","date":"2015-08-14T03:49:18.368+0000","up_votes":2,"down_votes":2,"body":"Anyone else?","replies":[{"poster":"AD Ezreal","date":"2015-08-17T09:57:29.701+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Workshop Shaco,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=0005,timestamp=2015-08-14T03:49:18.368+0000)\n>\n> Anyone else?\n\nAre you still actively checking this thread? I have a few ideas I want to add!","replies":[]}]},{"poster":"Workshop Shaco","date":"2015-08-15T18:09:24.590+0000","up_votes":1,"down_votes":0,"body":"boop the snoop","replies":[]},{"poster":"The Loveless","date":"2015-08-14T22:06:32.039+0000","up_votes":1,"down_votes":0,"body":"It's ok but not much different. It won't make him that fun or different IMO.","replies":[{"poster":"Workshop Shaco","date":"2015-08-14T22:45:54.141+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Loveless,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=0010,timestamp=2015-08-14T22:06:32.039+0000)\n>\n> It's ok but not much different. It won't make him that fun or different IMO.\n\nIt doesn't need to be that much different. I mean sure you could Sion him and basically give him a new everything but he doesn't need that. All that was needed was to move power out of the Q and to fix up his W and E. ","replies":[]}]},{"poster":"Workshop Shaco","date":"2015-08-14T17:57:36.154+0000","up_votes":1,"down_votes":0,"body":"I might lower the passive numbers early on and make it scale faster to the same points as they do now. A bit of a weaker early game so he wont' have that much of an insane snowball potential but his mid game comes out better and his late game remains the same. Thoughts?","replies":[]},{"poster":"biomaster","date":"2015-08-14T15:37:12.426+0000","up_votes":1,"down_votes":0,"body":"As a Shaco top main I always felt he could be a bit more of a duelist. One of the things that makes Shaco so attractive to me is his outplay potential Real outplay potential. None of that flashy LC$ big plays garbage. But cold and efficient outplay. You don't see what Shaco is doing behind the scenes with his Q, W, and R but that's why I love him. That's why he's Shaco, he duels you with the odds in his favour. Late game he has the burst of an assassin but early game he has to rely on his wits and outplay potential.\n\nWhat I would like to see in some sort of rework or update would be to see him given more tools to outplay early game (he has one of the highest difficultly ratings in the game after all) and something in his kit that keeps him from dropping off as hard a he does in late game.\n\nAs to the questions repertior asked early game he should be ganking fast and hard. If your or the enemy team isn't going \"OMG SHACO'S EVERYWHERE!\" then he isn't doing it right. Late game he should be all about picks. Getting in on that adc or mid laner and removing them from the equation. Preferably I would like him to get some sort of escape for making a successful pick (such as a reset on q after kill) but if you feel \"getting out\" should be Shaco's weakness then I certainly have no problem with that given you make sure he has adequate strengths with that weakness. \nHis w although iconic champion wise is to me lack luster  in game. Aside for the early game where they pose some threat I pretty much never use it past the 15 min mark once they get 1 shot (often before they even arm) \n\nMy issues with this suggested kit rework is how two-shiv poison still stays. I agree it's a good spell and Shaco certainly should be able to throw his knives, but Idk, the blind only affects monsters and the slow is kinda overkill cause he already has a blink on q and decent movement speed. I definitely think e should be a ranged spell (preferably targeted). Honestly not sure what that means to me. Basically i want two shiv poison as a ranged dmg spell, but maybe just think of something more rewarding/meaningful then the most common cc and a blind that only effects monster occasionally. (this may sound insane but I always felt e would make a good execute, kinda like a reverse Elise q that dealt bonus dmg based on missing health making the Q>AA>HYDRA>E combo more lethal)","replies":[]},{"poster":"Meeks011","date":"2015-08-14T14:23:05.048+0000","up_votes":1,"down_votes":0,"body":"Also it's too easy to tell Shaco's clone from Shaco. Maybe reduce the damage the clone deals and make it cast Shaco's Deceive and Shiv when Shaco does. It's an instant give away when you want to do any chasing and use abilities. Also, Shaco's clone does have the buffs Shaco has so you can tell just by the rings around him.\n\nYour rework is great. The only other thing I'd change is give Deceive something more to scale with rank. Really no reason to put points into it.","replies":[]},{"poster":"Prospector Pete","date":"2015-08-14T01:06:50.469+0000","up_votes":1,"down_votes":0,"body":"I really like this, but the stuff that scales with Champion level on his W should be changed to scale with the ability level. And also how about the clone doesn't explode immediately when Shaco dies, and it continues to attack, but while dead he can activate his ult again to manually detonate it?","replies":[{"poster":"Workshop Shaco","date":"2015-08-14T01:38:41.209+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Prospector Pete,realm=NA,application-id=3ErqAdtq,discussion-id=Fo05hqVe,comment-id=0001,timestamp=2015-08-14T01:06:50.469+0000)\n>\n> I really like this, but the stuff that scales with Champion level on his W should be changed to scale with the ability level. And also how about the clone doesn't explode immediately when Shaco dies, and it continues to attack, but while dead he can activate his ult again to manually detonate it?\n\nThe level thing keeps AP Shaco from abusing the hell out of maxing boxes first. \n\nAs for the ult thing, I made it like that so it falls in line with all the other pets in the game that die when Shaco does.","replies":[]}]},{"poster":"Workshop Shaco","date":"2015-08-14T00:47:54.223+0000","up_votes":1,"down_votes":0,"body":"I lowered the W numbers again... seemed kinda strong.","replies":[]},{"poster":"ShinTwist","date":"2015-08-18T16:38:36.670+0000","up_votes":1,"down_votes":1,"body":"Or we could NOT ruin Shaco for people who like him. Shaco is perfect, don't change him.","replies":[]},{"poster":"Ipols","date":"2015-08-14T11:10:55.395+0000","up_votes":1,"down_votes":1,"body":"I don't really like the passive, it's basically a small sheen, I think you can do better than that!\nAlso isn't ap shaco nerfed? (just asking idk)","replies":[]},{"poster":"TheDrco","date":"2015-08-14T07:49:22.023+0000","up_votes":1,"down_votes":1,"body":"I feel like some of these changes would make Shaco too powerful while others are much needed QoL changes.\n\nPassive: This passive idea would become far too powerful with the right items e.g. build hydra, shiv, triforce, and IE and it would melt many champs.\n\nQ: I agree that the mana cost is too high for low level and the speed boost would be nice for ganking. But I could see split push Shaco being potentially too powerful with this.\n\nW: I dont think the boxes need a damage buff but I completely agree with the stealth faster/75% less aoe damage part.This would actually add utility to Shaco's teamfight whereas currently boxes in teamfights are 90% of the time non existent. I also dont think the reduced damage from jungle camps is necassary, a skilled shaco should not have issues.\n\nE: A more consistent blind on jungle camps would be nice. I disagree that \"permaslow\" is even a problematic aspect of Shaco. Any champion with an escape or flash up can easily escape his AA range and stay that way. Sure if the champ lacks mobility and doesnt have flash up will be permaslowed but how is this an issue when dozens of champions can get the gank/kill on the same immobile/flashless champs.\n\nR: This would be a nice change. Currently it is waaaay to easy to immediately know which is the clone. I would also add the buff animations to the clone as well.","replies":[]},{"poster":"Ultimatesplash","date":"2015-08-14T05:19:57.119+0000","up_votes":1,"down_votes":1,"body":"Personally, I do not like the box limit. I understand what you're saying about AP Shaco, but I think that it severely limits his jungling start, although i would say it's a huge stretch to say that it would make him need a short leash. No other champ has a limit to the amount of items they can place, or at least not that i know of.","replies":[]},{"poster":"Workshop Shaco","date":"2015-08-14T04:34:40.315+0000","up_votes":2,"down_votes":2,"body":"boop","replies":[]},{"poster":"Workshop Shaco","date":"2015-08-14T19:49:33.457+0000","up_votes":1,"down_votes":2,"body":"I really want this to get more vision =(","replies":[]}]}