{"poster":"Riohey","date":"2016-11-05T00:47:29.428+0000","title":"[Championvorschlag] Tric'Cid, der Magen der Leere","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":1,"body":"Hallo, lieber Leser oder liebe Leserin,\r\n\r\nich stelle hier einen Champion vor, der etwas anders sein soll.... w&auml;re auch doof, wenn ich hier einen schon existierenden Vorstelle.\r\nBin  f&uuml;r Ideen offen, sowie f&uuml;r nette und konstruktive Kritik. Rechtschreibfehler und &quot;b&ouml;ses&quot; Verhalten bitte behalten.\r\n\r\n\r\n**_Name_**\r\n\r\nTric&#039;Cid soll eine Kreatur der Leere sein, deshalb das &#039; im Namen. Durch sein &quot;Thema&quot;, dass weiter unten noch offenbar wird, hab ich die Namensteile von &quot;Gastric Acid&quot; genommen, dem englischen Begriff f&uuml;r &quot;Magens&auml;ure&quot;.\r\nH&ouml;rt sich erstmal an, wie ein anderer Name f&uuml;r Kog&#039;Maw, aber Tric&#039;Cid wird anders.\r\nDer Beiname spielt darauf an, dass er und seine Art, wie Insekten und Pilze, Abf&auml;lle, Kadaver und &Auml;hnliches beseitigen und sonst auch alles verschlingen, was sie finden (und verdauen k&ouml;nnen). Andere Ideen von mir waren noch: &quot;Tric&#039;Cid, der schl&auml;nelnde Magen&quot; oder &quot;Tric&#039;Cid, der Hausmeister der Leere&quot;, wobei letzterer eher Spa&szlig; w&auml;re ;)\r\n\r\n**_Aussehen_**\r\n\r\n\r\nTric&#039;Cid ist ein l&auml;nglicher Wurm, der vorne und hinten jeweils ein Maul/Mund hat. An seinen Seiten sind ebenfalls kleine M&auml;uler (drei pro Seite Minimum wegen F&auml;higkeit). Seine untere K&ouml;rperh&auml;lfte ist im Boden und seine Farben sind in Lila gehalten. Seine Laufanimation ist eher eine &quot;Ich fress den Boden vor mir und komm so voran&quot;-Animation. Augen besitzt er nicht, stattdessen F&uuml;hler mit denen er die Welt &quot;sieht&quot;.\r\nAlle M&auml;uler, klein wie gro&szlig;, sind immer weit offen und haben eine &quot;wippende&quot; Bewegung (schlie&szlig;en sich leicht und gehen wieder auf).\r\n\r\nSkins k&ouml;nnten zum Beispiel sein: Stahlkrieger-Tric&#039;Cid, Raupen-Tric&#039;Cid, W&uuml;sten-Tric&#039;Cid \r\n\r\n\r\n**_Geschichte_**\r\n\r\nAuch in der Leere m&uuml;ssen manche Reste von Mahlzeiten oder andere Dinge verschwinden. Wo Valoran Pilze, W&uuml;rmer und Insekten hat, hat die Leere Tric&#039;Cids Spezies. Sie k&ouml;nnen **Alles** verdauen, selbst die &Auml;ltesten Verwandten von Kow&#039;Maw m&uuml;ssen sich auf diese Art verlassen, weil selbst sie nicht alles klein bekommen, was dort in der Leere existiert. Doch obwohl Tric&#039;Cid und Seinesgleichen wichtig sind, werden sie wie Ungeziefer behandelt und get&ouml;tet. Sollte aber ein Exemplar, wie Tric&#039;Cid, es schafft lang genug zu &uuml;berleben, erreichen sie gigantische Ausma&szlig;e und werden f&uuml;r viele Leerenkreaturen eine ernsthafte Bedrohung. Es werden ganze Jagden auf solche Exemplare veranstaltet, weil die Leerenkinder um die Gefahr durch sie wissen.\r\n\r\nTric&#039;Cid entkam jedoch nach Valoran und gedieh selbst dort, wenn auch langsamer, weil die leckere, laufende &quot;Kost&quot;, nicht sehr viel hergibt. Die Menschen meiden ihn und haben viele Legenden zu ihm erdacht, von denen die meisten &uuml;bertrieben zu sein **scheinen**. Die Bekannteste handelt &uuml;ber die Entstehung des Schlangenflusses (Serpentine River). Die Bewohner des umliegenden Landes wollten Tric&#039;Cid beseitigen und rotteten sich zusammen. Das Einzige, das sie schafften, war es ihn zu erz&uuml;rnen, denn sein Essen wehrt sich normalerweise nicht. Er schwoll an und h&auml;tte eine ganze Burg mit einem Mal verschlucken k&ouml;nnen, jedoch wollte er diese kleinen, laufenden Menschlein verschlingen und verfolgte diese. Den Weg, den er und seine Beute dabei zur&uuml;cklegten, war ein tiefe Schneise der Zerst&ouml;rung, in die sich sp&auml;ter ein kleines B&auml;chlein einer sprie&szlig;enden Quelle ergoss. Sie wuchs und wuchs, ganz wie das Monster, welches diesen Weg geebnet hatte, und wurde zu dem noch heute flie&szlig;enden Schlangenfluss (Serpentine River). Sp&auml;ter ergossen sich noch mehr B&auml;che in die Schneise und erwecken nun den Eindruck von Natur und Frieden.\r\n\r\nNicht einmal die Leerenkinder wissen um das Begehren von Tric&#039;Cid oder seiner Art, jedoch wird wegen ihrem immerw&auml;hrenden Schlingen vermutet, dass sie alle Welten und somit alles was auf ihnen lebt, verschwinden lassen wollen. Manche sagen aus Hunger, andere nennen es die ultimative Reinigung im st&auml;rksten Magen und andere meinen sie wollen nur wachsen und fressen deshalb so viel.\r\n\r\nEins ist jedoch jedem klar:\r\n\r\n_&quot;Falls wir Tric&#039;Cid und seine Art nicht klein halten, werden selbst die Leerenkinder nur wie harmlose Welpen aussehen._\r\n                                                                                                          _ -- Meinung von vielen Wesen aus vielen Welten_\r\n\r\n\r\n**_Grundwerte_**\r\n\r\nSind nur ungef&auml;hre Werte, nach Lust, Laune und komischen &quot;Verst&auml;ndnis&quot; von Balancing meiner seits.^^\r\n\r\nLeben: 556 (+72 pro Stufe)\r\nLebenregeneration: 6,9 (+0,8 pro Stufe)\r\nMana: 390 (+48 pro Stufe)\r\nManaregeneration: 6,8 (+0,8 pro Stufe)\r\nAngriffsschaden: 58 (+3,1 pro Stufe)\r\nAngriffstempo: 0,6 (+3,2% pro Stufe)\r\nR&uuml;stung: 28 (+3,1 pro Stufe)\r\nMagieresistenz: 31 (+1,35 pro Stufe)\r\nLauftempo: 335\r\nAngriffsreichweite: 0 (Genauer in der Passiven erkl&auml;rt)\r\n\r\n\r\n**_F&auml;higkeiten_**\r\n\r\n**Passive: Einfach runter!**\r\n\r\nTric&#039;Cid kann sich nach vorne und hinten bewegen, ohne sich zu drehen, jedoch nicht zur Seite, daf&uuml;r muss er einen Bogen &quot;laufen&quot;. Schuhe kann er nicht kaufen, sein Lauftempo wird stattdessen durch Abklingzeitverringerung ( oder besser was anderes?) erh&ouml;ht, in Anlehnung daran, das er den Boden verdaut und sich dadurch nach vorne bewegt. Statt einen Angriff zu haben wie alle anderen Champions, &quot;verschluckt&quot; Tric&#039;Cid das Ziel beim durchlaufen und f&uuml;gt somit dem Ziel einen Debuff zu, genannt &quot;Magens&auml;ure&quot;. W&auml;hrend ein Opfer in Tric&#039;Cid ist, nimmt er von normalen Angriffen nur 70% Schaden, weil die Angriffe durch die S&auml;ure leicht verdaut werden. (Gegnerkollission ist somit nicht vorhanden, Verb&uuml;ndetenkollission schon)\r\n\r\n&quot;Magens&auml;ure&quot; skaliert mit dem Angriffsschaden sowie der Angriffsgeschwindigkeit und bleibt zwei Sekunden auf dem Ziel bestehen (solange das Ziel in Tric&#039;Cids Magen ist, wird der Effekt erneuert). Der Schaden ist physisch.\r\n\r\n**Q: Federsprint/!Federsprung!**\r\n\r\nTric&#039;Cid zieht sich zusammen und schie&szlig;t dann mit der aufgestauten Energie nach vorn. Dabei durchdringt er Hindernisse, weil sie schnell genug durch seinen Magens&auml;ure zersetzt wird. Wenn er dabei einen Gegner verschluckt oder dieser ihn sogar komplett durchquert, bekommt der Gegner ein wenig Extraschaden und zus&auml;tzlich wird er mit &quot;Magens&auml;ure&quot; belegt.\r\n\r\nExtraschaden: 80/105/130/155/180 (+50% Angriffsschaden); physisch\r\nManakosten: 80\r\nReichweite: 750 (l&auml;dt sich &auml;hnlich Zacs F&auml;higkeit bis zu diesem Punkt auf; ben&ouml;tigt 0,5 sec)\r\nAbklingzeit: 15 Sekunden\r\n\r\n**W: Spuckkonzert!**\r\n\r\nTric&#039;Cid spuckt aus seinen seitlichen M&auml;ulern eine, seiner Magens&auml;ure &auml;hnliche, Substanz. Auf jeder Seite fliegen drei Kugeln in einem kleinen Bogen neben ihn auf den Boden und bilden Pf&uuml;tzen, die verlangsamen. Falls er dabei in einem leichten Halbkreis liegen sollte (nicht vergessen er ist Wurm&auml;hnlich), wird an seiner &quot;gestauchten&quot;, k&uuml;rzeren Seite, die gesamte bedeckte Fl&auml;che geringer ausfallen, als wenn er gerade liegt. An seine &quot;gestreckten&quot;, l&auml;ngeren Seite ist das Gegenteil der Fall, jedoch wird zwischen die Pf&uuml;tzen der einzelnen Kugeln ein wenig Platz bleiben, sollte er sich gerade stark drehen.\r\nFalls eine Kugel vor Aufkommen auf den Boden einen Champion trifft, wird dieser stark verlangsamt und die Kugel hinterl&auml;sst keine Pf&uuml;tze. Ein Champion kann von mehreren Kugeln getroffen werden, an der Zeit und Verlangsamung &auml;ndert sich nichts im Vergleich zu einer Kugel. Au&szlig;erdem wird der Effekt &quot;Magens&auml;ure&quot; zugef&uuml;gt.\r\n\r\nVerlangsamung (Pf&uuml;tze): 20/28/36/44/52 %\r\nVerlangsamung (Kugeltreffer): 35/44/53/62/71 %\r\nZeit (Pf&uuml;tze auf Boden): 4 Sekunden\r\nZeit (Verlangsamung): 2 Sekunden\r\nManakosten: 110 Mana\r\nSchleuderweite (Aufschlagspunkt der Kugel): 125\r\nPf&uuml;tzengr&ouml;&szlig;e: 150\r\nAbklingzeit: 12 Sekunden\r\n\r\n**E: Klappe zu!**\r\n\r\nTric&#039;Cid schlie&szlig;t seine beiden gro&szlig;en M&auml;uler und verhindert somit das sein Opfer entkommt (oder neue hinein kommen, Gegnerkollission gilt f&uuml;r ihn in der Zeit) und verursacht erh&ouml;hten Schaden. Das Opfer wird mitgezogen, falls sich Tric&#039;Cid zu weit bewegt, w&auml;hrenddessen kann es weiterhin angreifen und die Bewegung durch Tric&#039;Cid unterbricht keine normalen Attacken, jedoch sind die Einheiten gehemmt (wie bei Cassiopeias &quot;Miasma&quot;). Der Effekt &quot;Magens&auml;ure&quot; ist nat&uuml;rlich schon aktiv und bleibt es, bis das Opfer freigelassen wird und der Effekt ausklingt.\r\nSollte ein Monster w&auml;hrend der F&auml;higkeit sterben, wird die Abklingzeit um 0,5 Sekunden verringert, bei einem Champion um 1 Sekunde.\r\n\r\nSchaden: 50/70/90/110/130 (+90 % Angriffsschaden); physisch\r\nDauer: 1,5 Sekunden; Schaden verteilt sich auf diese Zeit\r\nManakosten: 80 Mana\r\nAbklingzeit: 8 Sekunden\r\n\r\n**R: Nerv nicht!**\r\n\r\nTric&#039;Cid bl&auml;ht sich auf und erlangt doppelte Gr&ouml;&szlig;e (Hitbox f&uuml;r Treffer und &quot;Fressen&quot; somit auch), zudem wird er schneller und erh&ouml;ht den Schaden seiner Passiven F&auml;higkeit. Seine Q- und W-F&auml;higkeiten sind nicht benutzbar, seine E-F&auml;higkeit erh&auml;lt daf&uuml;r einen Teil an zus&auml;tzlichem absoluten Schaden. Zudem hinterl&auml;sst er eine Schleimspur, die verlangsamt (entspricht W-LvL, jedoch mit halbierten Zeiten).\r\n\r\nOptisch schlie&szlig;en sich zudem die kleinen M&auml;uler an den Seiten, weil er die Luft &quot;anh&auml;lt&quot;.\r\n\r\nDauer: 12 Sekunden\r\nSchadensbonus (Passive): 125/140/150% des urspr&uuml;nglichen Wertes\r\nSchadensbonus (E-F&auml;higkeit): 6/8/10 % zus&auml;tzlich\r\nManakosten: 150 Mana\r\nAbklingzeit: 160/140/120 Sekunden\r\n\r\n\r\n**_Freunde und Rivalen_**\r\n\r\nFreunde hat er keine, weil selbst die andren Leerenwesen ihn als Bedrohung wahrnehmen.\r\n\r\nRivalen sind eigentlich alle, aber im besonderen solche Champions wie Ivern, die f&uuml;r die Natur stehen und sie besch&uuml;tzen wollen.\r\n\r\n\r\n**Weiteres**\r\n\r\nDann hatte ich noch eine Idee zu einem anderen Champion, bei dem man darauf achten muss, wo man welches Item h&auml;lt. Das die Ersten beiden Pl&auml;tze das Item verst&auml;rken und die letzten beiden (zum Ausgleich) schw&auml;chen.\r\n\r\nBevor das Forum aktualisiert wurde, hatte ich auch mal einen Champion mit dem Thema &quot;Parasit&quot;, also in dem Sinne das sie ihn besetzen und er sie in gewissem Ma&szlig;e kontrollieren kann und so k&auml;mpft.\r\n\r\nFalls einer von euch eine Idee haben sollte, aber keine Zeit oder gen&uuml;gend Fantasie hat oder m&ouml;chte das eine von diesen beiden mal weiter ausgef&uuml;hrt wird, schreibt es in die Kommentare und ich mach mir dazu Gedanken.\r\n\r\n**_Vielen Dank f&uuml;r das Lesen dieser Idee und noch ein tolles Schlachten in der Kluft_**\r\n\r\n~~Riot darf diese Idee, in dieser Form oder abge&auml;ndert, verwenden, solang ich informiert werde und somit stolz darauf sein kann XDDD~~","replies":[{"poster":"simon22","date":"2016-11-05T13:49:58.868+0000","up_votes":2,"down_votes":0,"body":"Ich finde das Konzept super. Nur wie soll er kämpfen? Er hat wenig Schaden und ich würde vielleicht machen, dass nachdem er einen Gegner aufgefressen hat ihn für z.B. 4 Sekunden nicht mehr den selben Gegner auffressen kann (wie bei einer Braum Passive). Außerdem würde ich machen, dass er nach dem Auffressen den Gegner immer mit seinen Angriffen wegstößt und Schaden macht. Die W könnte ruhig Schaden machen.\nWas auch ziemlich cool sein würde, wäre das er seine Gegner immer wegstößt und Schaden macht wenn er sich krümmt und den Gegner damit trifft. Also, dass er immer die Gegner \"peitscht\".\nDie Rolle wäre auch ziemlich gut zu wissen und ob er ein Off-Tank ist oder Ähnliches.","replies":[]},{"poster":"Dirot","date":"2016-11-05T03:11:59.249+0000","up_votes":1,"down_votes":0,"body":"Die Idee ist an sich selbst schon gut, aber so zum durchlesen ist er mir ziemlich komplex und wirkt durch seine passive bisschen sehr stark möbilitäts eingeschränkt. \n\nDie Ult erinnert mich i-wie einbisschen an Singed =)\n\nEr wäre ein Jgler oder ?","replies":[]}]}