{"poster":"Strawberrycocoa","date":"2015-11-25T05:07:38.107+0000","title":"Does it feel to anyone else that Poppy's new character has lost a lot of her bravado and confidence","subforum":"Story, Art, & Sound","embed":{"description":"This is the voice for the new champion Poppy. Note: The Voice might not be final, you never know what tweaks Riot might make to it. For League of Legends Related News Check Out Surrender@20: http://www.surrenderat20.net/ Feel Free to Follow me on Twitter as well: https://twitter.com/SkinSpotlights","url":"https://www.youtube.com/watch?v=Jiy2XCdHaeE","image":"https://i.ytimg.com/vi/Jiy2XCdHaeE/hqdefault.jpg"},"up_votes":7,"down_votes":6,"body":"Found this video of the VO for Poppy&#039;s relaunch, and on first impression, I really don&#039;t like the new wilting-violet unconfident personality she&#039;s displaying. Poppy, even with her limited former dialogue, used to be all swagger and bravado. She challenged people to stand up or get beat down. Now she&#039;s apologizing to everyone and doubting her own skills.\r\n\r\n:\\ I dunno, I just wish she wasn&#039;t so... unsure.\r\n\r\nI like the long-ass bank robbery anti-joke though. XD","replies":[{"poster":"IcyPepper","date":"2015-11-25T05:09:51.380+0000","up_votes":9,"down_votes":0,"body":"Considering how long it took for her rework, and how little play she's been seeing, can you blame her for lacking confidence?\n\nMan, we just went meta...","replies":[{"poster":"Strawberrycocoa","date":"2015-11-25T05:11:16.172+0000","up_votes":4,"down_votes":0,"body":"Mind. Blown.","replies":[{"poster":"ReZisT Lust","date":"2015-11-25T09:30:20.274+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-brand-mindblown}}","replies":[]}]}]},{"poster":"Blue Kaozi","date":"2015-11-25T15:28:52.308+0000","up_votes":6,"down_votes":1,"body":"I just think her voice sounds too different. I like the quotes, but she really sounds like tristana.","replies":[{"poster":"Milodic Mellodi","date":"2015-11-25T23:59:53.915+0000","up_votes":1,"down_votes":0,"body":"Probably the same voice actor.","replies":[{"poster":"SpecterVonBaren","date":"2015-11-26T04:46:44.496+0000","up_votes":1,"down_votes":0,"body":"I think someone said that she's voiced by the same person that did Sakura from Naruto, which means they aren't the same since Tristana's voice actor is some streamer or something.","replies":[]}]}]},{"poster":"Mimy","date":"2015-11-25T05:13:08.162+0000","up_votes":4,"down_votes":1,"body":"Her personality is... well mine.  I can relate alot to new poppy. \n\nEven the snort at the end of her laugh. \n\nAnd I love it. Sure I liked badass.poppy aswell but how many badass champions do we need?","replies":[{"poster":"Count Buffon","date":"2015-11-25T05:35:03.066+0000","up_votes":4,"down_votes":2,"body":"She was still quite unique, in that she wasn't \"lolol, snarky teen badass\" about it like Jinx and, to a lesser extent, Vi.  She had a sort of gruffness that defined her character.  Her kit was poison and her art was sloppy, so no one played her, but it's really bizarre that they turned her personality inside out for no discernible reason.  They might as well make Taric into a womanizer who hates gems and turn Orianna into a non-robot at the rate they're going.  I like this character more than \"tuff girlz spraypainting things\" stuff they've done in the last year or two, but I don't like it as a complete destruction of an existing character.  They had a totally new champion identity in mind, but they overwrote an old one.","replies":[{"poster":"Mimy","date":"2015-11-25T15:17:23.314+0000","up_votes":2,"down_votes":4,"body":"Complete destruction of an existing charactar? Its not like that many people played her. Less than 1 percent of the playerbase.  So she needed a completely new identity to appeal to people. They needed to make her anew. \n\nIts sad that old poppy is gone you cant ult a support and go ham on a carry. Now you are a peeler who can get some good saves.  And turn the tide if teamfights. \n\nIm sorry if you main her. I played her for a bit too. But she needed this.","replies":[{"poster":"Sneak Dog","date":"2015-11-25T16:11:22.421+0000","up_votes":4,"down_votes":0,"body":"Her kit was broken, and needed to be replaced. This doesn't necessarily mean her identity needs to be replaced.","replies":[{"poster":"Mimy","date":"2015-11-25T16:15:51.094+0000","up_votes":3,"down_votes":3,"body":"Well it happened, and no one knows her original voice.. soo.. yea. they updated her with someone else.. and gave her a semi-new identity.  Shes still in there.. shes just different now.. just like people change why not game charactars? \n\nSorry but i don't think a few nay sayers will bring back her old voice.. or change what riot has done..","replies":[{"poster":"Sneak Dog","date":"2015-11-25T17:08:40.389+0000","up_votes":5,"down_votes":0,"body":">just like people change why not game charactars? \n\nGangplank did that. But for these updates: people generally don't suddenly retroactively have been different all along. Not a fair argument.\n\nI personally haven't made up my mind whether I like the Poppy update from a story perspective. However, I do see that your arguments haven't been very good.\n\n>Sorry but i don't think a few nay sayers will bring back her old voice.. or change what riot has done..\n\nRiot can make mistakes. Be critical. Don't blindly think that whatever Riot does is good, think for yourself or ask Riot for their reasoning.","replies":[{"poster":"Mimy","date":"2015-11-25T17:18:54.226+0000","up_votes":2,"down_votes":6,"body":"I know I jnow. But it is riots game. How often do they take something back?  I learned to apapt or ya....","replies":[{"poster":"Sneak Dog","date":"2015-11-25T22:53:00.244+0000","up_votes":4,"down_votes":0,"body":"Jayces lore got changed because the community pointed out valid flaws.","replies":[{"poster":"Mimy","date":"2015-11-25T23:42:05.320+0000","up_votes":2,"down_votes":3,"body":"Something that's not as easy as typing words on a screen.. \n\nto completely change her personality back they'd have to get the voice for her back in and completely re-do everything. \n\nbut... \n\nHonestly Id rather her personality stay the way it is... so SUSH.  MY OPINION you got your own. \n\n\n#END OF CONVERSATION","replies":[{"poster":"Sneak Dog","date":"2015-11-26T00:12:47.249+0000","up_votes":1,"down_votes":0,"body":">to completely change her personality back they'd have to get the voice for her back in and completely re-do everything. \n\nI haven't decided whether her personality *has* changed yet, I'm going to have to think. But there is a possibility that Poppy's rework removed or changed her core character. Then I will discuss this on these boards and there will be a relatively objective conclusion. \n\nIf this conclusion is that Riot messed up, then it wouldn't be the first time.\n\n>Honestly Id rather her personality stay the way it is... so SUSH. MY OPINION you got your own. \n\nSo I've three issues with this reasoning:\n\nYou want me to stop arguing with mostly objective arguments because of your personal preference?\nThis is not how public discussions work. You can just leave the discussion if you want, though. And contrary to the internet's popular opinion, admitting you're wrong when you are is a laudable trait.\n\nEverything on the PBE is up for change, it may never see the light of the live servers. \nA valid argument had she been released already, would be that changing her at that point would be the same mistake as changing her in the first place.\nBut this is not the case yet. Now is the time where is still *can* be changed without resorting to retcons.\n\nJust liking her new personality more than the old one is just dismissing everyone elses opinion. That is simply a confusing thing to do. If you dismiss my opinion without arguments, then why wouldn't I dismiss yours too? How does one have a discussion with such an attitude?\nAre you even here to have a discussion, where you consider both sides' arguments?","replies":[{"poster":"Mimy","date":"2015-11-26T00:18:51.227+0000","up_votes":2,"down_votes":1,"body":"EVERYONE HAS THEIR OWN OPIONS\n\nYou don't like her new personality\n\nbut I do... \n\nnothing we say is going to change each other's minds... END OF STORY. \n_____________________________\n\nDo you even play poppy to even care? whether her personality was changed...  Are you even going to play her when the changes go live? \n\nIf you answered No to both these questions...... Then see your way out.  because the only thing you wanna do is fight people. \n\nI'm done talking to you.","replies":[{"poster":"Sneak Dog","date":"2015-11-26T00:59:47.767+0000","up_votes":2,"down_votes":0,"body":">EVERYONE HAS THEIR OWN OPIONS\n\nI know. And I'd say none of our opinions presented in this discussion are wrong.\n\n>You don't like her new personality\n\nI do actually like her new personality. That doesn't mean I like the changes.\n\n>nothing we say is going to change each other's minds... END OF STORY. \n\nYou could change my mind. Use valid arguments, unlike those you used so far. Just saying \"end of story\" one-sidedly doesn't really work however. It tells me that you want us both to leave this discussion unfinished and angry. I wouldn't like that.\n\n\n***\n\n\n>Do you even play poppy to even care? whether her personality was changed... Are you even going to play her when the changes go live? \n\nI'm in no way a Poppy main, but I play her as a counterpick to Jax top and sometimes as a support when I'm with a friend adc and playing normals.\nDefinitely going to play her when she goes live. That kit looks awesome!\n\n>If you answered No to both these questions...... Then see your way out. because the only thing you wanna do is fight people. \n\nI want to discuss. It's why I'm here. Valid argumentations and all that. I want to see if my standpoint is valid, if it's well-founded. I want to see if Riots is.\n\nI'm sorry if my attitude is disstressing you. This is not my intention at all.","replies":[{"poster":"Mimy","date":"2015-11-26T01:11:21.325+0000","up_votes":1,"down_votes":2,"body":"Okay I'm sorry but your a little hard to read to be honest... meaning I do not understand what you are trying to say to me at all.. You like my English literature professor and I have to ask you 10,000 questions before I even know what your saying for me to do. \n\nI no longer even know why your trying to argue with me.. I don't like arguing I just want the conversation to end... \n\nThat's what I've been doing the last 3 posts but your not reading the fact that i'm just done because i'm getting frustrated here.. \n\nThis is me telling you.. stop trying to debate with me, i'm backing off... Leave me alone before I start losing my marbles... \n\nI'm explaining my feelings here so you can understand i'm getting frustrated with is conversation..","replies":[]}]}]}]}]},{"poster":"Mimy","date":"2015-11-26T00:05:14.669+0000","up_votes":1,"down_votes":2,"body":"Also you wanna know what, you don't even play poppy... WHY THE HECK ARE YOU QQing about her changes? \n\nIs it wrong for other people to LIKE her changes?  is your opinion the only one that matters? NO it's not. \n\nSO unless you main poppy, (Which you dont) \nor like the changes (Which you also dont seem to) But I do, which is why your fighting me... \n\nThan keep your opinions off the poppy posts!  There's too much negativity all the time.","replies":[{"poster":"Sneak Dog","date":"2015-11-26T00:52:49.314+0000","up_votes":2,"down_votes":0,"body":"I'm not QQing over her changes. I haven't made up my mind whether I like them or not.\n\nI already like the new Poppy though. The whole oblivious hero thing is great. She also feels a lot more like a deep character, rather than the kind of one-dimensional character she felt like before (to me at least).\n\nI'm arguing with you that the arguments you're using aren't really great though. That's all. That does not necessarily make your opinion wrong, for it isn't the sole base you were founding your opinion on.\n\nI think we just think differently. That we're on these forums for different reasons. My apologies if I've disstressed you. That was not my intention at all.","replies":[]}]}]},{"poster":"Brascus","date":"2015-11-25T21:04:18.286+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Onastacia,realm=NA,application-id=6kFXY1kR,discussion-id=YR4QkjEX,comment-id=0003000000000000000000000000,timestamp=2015-11-25T17:18:54.226+0000)\n>\n> I know I jnow. But it is riots game. How often do they take something back?  I learned to apapt or ya....\n\n{{champion:82}}  \"Lord of Death\" was changed to \"Iron Revenant\"","replies":[{"poster":"Mimy","date":"2015-11-26T00:13:18.746+0000","up_votes":1,"down_votes":0,"body":"uhuh, and after all that QQing the community did.. He's back down to 1.7% of the population of players playing him... (Next to poppy) \n\nbut you know.. WELL DONE.. \n\nThat goes to show you how much people really care about morde... Because now he's forgotten... \n\nagain.... \n\nIf you guys really cared about some of these champions..\n\nidk.. maybe.. WHY DON'T YOU PLAY THEM?! \n________________________________________________\n\nMorde didn't really appeal to me, so i mostly kept my opinions of him to myself. \n\nwhat im saying is.. I voice my opinion on poppy because I really do like poppy. Ive been playing her a lot in normals \n\nSo I voice my opinions.. and then people have to fight me on it... \n\n#So what if I love the new poppy changes....","replies":[]}]}]}]}]}]}]},{"poster":"Ralanr","date":"2015-11-25T21:25:45.033+0000","up_votes":1,"down_votes":0,"body":"She's not exactly snarky.","replies":[]}]}]},{"poster":"Lord Boltrix","date":"2015-11-25T06:03:46.508+0000","up_votes":3,"down_votes":0,"body":"Honestly, her old splash art made her look like kind of a douchebag.\n\nNothing against her personally or those who play her, just that between her old splash and the way she played, I kind of got that impression.","replies":[{"poster":"Brascus","date":"2015-11-25T21:06:54.403+0000","up_votes":2,"down_votes":1,"body":"God forbid there's a female yordle that's not giving people diabetes with her sweetness.","replies":[{"poster":"Ralanr","date":"2015-11-25T21:51:12.958+0000","up_votes":2,"down_votes":1,"body":"Yes a pyschopath was much better.","replies":[]}]}]},{"poster":"Lost R","date":"2015-11-25T07:16:45.229+0000","up_votes":4,"down_votes":1,"body":"New Poppy is a different kind of bravado. She seems very bound to her cause and so focused on it, everything around her is a tertiary concern. She isn't concerned with the obstacles in front of her, but at the same time, unlike most champions ({{champion:48}} {{champion:122}} {{champion:62}} {{champion:119}} {{champion:86}} {{champion:268}}) Poppy has nothing to prove. Also her awkwardness is adorable.","replies":[{"poster":"Merxamers","date":"2015-11-25T17:31:58.670+0000","up_votes":3,"down_votes":1,"body":"i'd disagree; it seems like her VO suggests that, rather than having 'nothing to prove', she has everything to prove... to herself. See, she **is **the hero she's been seeking; she just has to realize it. She's basically a hero in the early stages of her hero's journey.\n\nHer new personality may be a bit different from her old (mostly absent) one, but I really like the new one so i don't mind as much; there's a lot of character, emotion, etc. there that Trundle's rework was missing.","replies":[]}]},{"poster":"Count Buffon","date":"2015-11-25T05:12:43.159+0000","up_votes":7,"down_votes":4,"body":"Yeah, she's on Lithium now.  She looks like Tristana cosplaying as Poppy... and not doing a very good job of the acting part.","replies":[]},{"poster":"EwigD","date":"2015-11-26T04:39:42.091+0000","up_votes":2,"down_votes":0,"body":"Nope, I feel like this gave her an actual personality, whereas before she was completely one dimensional in a rather cliched manner.\nBack when the Poppy rework was being planned there was a thread about what defined Poppy as a character, and iirc the main keywords at the time were determined, noble, strong, she is all of those things now, except she actually sounds less like a pokemon who can only repeat one word, or in this case can only portray one personality trait/emotion.\nTo each their own of course, so I can understand people not liking new Poppy, or liking old Poppy better, but she does have a very distinct personality now (completely different from Tristana's btw), regardless of personal preference I think its just fact that her personality is much more developed now, she is still tough and determined, but she is also cute and dorky, little awkward and unaware of just how badass she is, all of which I find make her much more endearing than just angrily shouting.\nA point could be made of why not just retain her old personality exactly as it was, but I think the problem with that was exemplified in how you said it yourself, she was -all- swagger and bravado, personally I think thats the problem, her personality was to be one dimensional, which fit better in the earlier days of lol, but as lore and characterization has become more expansive it was necessary to have a less one dimensional personality, so retaining a personality that was defined by being one dimensional becomes impossible.\nMy opinion is definitely biased as I love new Poppy, so take that as you will, I know for a fact I would be upset/disappointed myself if a champion I liked got their personality changed, so its not like I expect to convince anyone, but it is my genuine opinion on her update nonetheless.","replies":[]},{"poster":"Harmony11","date":"2015-11-25T22:21:04.751+0000","up_votes":2,"down_votes":0,"body":"I would agree, but personally I really don't mind. In fact I kind of think we're seeing the same Poppy, but from a different time. Old Poppy was an ambassador, a fighter, and a Champion in the Institute of War. New Poppy is a brave, though less confident, Yordle who is journeying through the land of her childhood heroes to deliver a weapon to the \"real hero\". She doesn't have the same accomplishments  under her belt. The only reason she's fighting at all, probably, is to protect herself and the hammer from harm.\n\nKeep in mind the new lore is not static, and we have seen that already with Bildgewater. We have seen Sarah's personality slowly start to change from single-minded hatred to realizing the burden of a leader, that killing Gangplank did not turn Biildgewalter into a sudden utopia like she deluded herself into believing and that these people need a strong force to keep them in line. Meanwhile Gangplank has a newfound drive thanks to Illaoi in her expanded lore, and Illaoi herself has shown several different ways of interaction with people and thoughts that may belay her words.\n\nEven if Poppy now lost a lot of her bravado and confidence, that's not to say it's never coming back. Poppy is in a a land of heroes looking for one who is worthy of the hammer, and considering how much she apparently idolizes Demacians (eg. asking for Garen's autograph) it's no surprise that she doesn't look within right now. I'm actually looking forward to the event(s) that make her realize her true worth and potential.","replies":[]},{"poster":"Waffletimewarp","date":"2015-11-25T06:03:42.596+0000","up_votes":2,"down_votes":0,"body":"I really don't see the lack of confidence you do.  Everything in her lines says \"I'd rather you get out of my way, but I'm gonna mess you up if you really have to\"","replies":[]},{"poster":"Ralanr","date":"2015-11-25T21:52:01.996+0000","up_votes":3,"down_votes":1,"body":"After reading her old/current lines, I don't get a confident individual. I see a psychopath.","replies":[]},{"poster":"cuddlykitten4","date":"2015-11-25T21:48:16.121+0000","up_votes":2,"down_votes":1,"body":"Let me get this straight real quick.....Riot gives you the equivalency of Thor and let's you hammer throw the other team's happy asses back to base, and you guys still can't be happy? I mean, SHE THROWS A FREAKING HAMMER AT THEIR FACES!!!","replies":[]},{"poster":"Meep Man","date":"2015-11-26T00:13:47.873+0000","up_votes":1,"down_votes":0,"body":"I think that was the aim. She is a hero that doesn't see the HERO in herself. Just a not so normal yordle to her.","replies":[]},{"poster":"GetMariahCarried","date":"2015-11-25T06:01:06.636+0000","up_votes":1,"down_votes":0,"body":"\"I'm about to hammer you in the j-\\*censored\\*\"\n\nReport Poppy, offensive language.","replies":[]},{"poster":"GetMariahCarried","date":"2015-11-25T05:53:00.351+0000","up_votes":1,"down_votes":0,"body":"Dat hint of southern accent... and... GASP! COMPLETE WITH SOUTHERN HOSPITALITY!\n\n* \"This guy seems nice. I feel bad about killing him.\"\n* \"I really don't have anything against dragons!\"\n* \"N-nothing personal... but, I need to squash you.\"\n\nI'd say she has a DIFFERENT kind of confidence.","replies":[]},{"poster":"Malcha","date":"2015-11-25T05:10:50.292+0000","up_votes":1,"down_votes":1,"body":"To be honest, yes. It feels like all her lines are about being humble and not considering herself to really be a hero. \n\nI miss the line about Hammer Diplomacy. Though to be honest, she's also not a two foot tall plow through your team burst assassin anymore either. So maybe the aim is just an all around change in identity.","replies":[{"poster":"Count Buffon","date":"2015-11-25T05:17:20.996+0000","up_votes":1,"down_votes":3,"body":"They should've maybe toned down her old ult.  For example...\n\n1)  She could neither deal nor receive damage to anyone but the targeted champion, but still be vulnerable to CC.\n2)  Or instead it could've been something like 50% damage and CC reduction to and from all non-target units.\n\nEither of these would feel similar, but it wouldn't be like \"lolol I ulted Soraka and now I'm going crazy on the ADC.\"","replies":[]}]}]}