{"poster":"XxxLumberJackxxX","date":"2017-01-04T13:01:15.178+0000","title":"Is anyone else ok with ADCs being a smidgeon weak and possibly not mandatory on teams?","subforum":"Gameplay","up_votes":117,"down_votes":31,"body":"If anything needs to change with ADCs it&#039;s probably zeal items and some very minor numbers on specific ADCs.\r\nRunaans is rushed too often which makes killing tanks harder.\r\nWhy is runaans rushed?\r\nShiv is mediocre unless you * need * to burst someone, as runaans is way better for waveclear.\r\nPD doesn&#039;t add to waveclear, which makes pushing towers harder, which makes rotating and assisting other lanes harder.\r\n\r\nChampions that can abuse the on hit aspects of runaans are very buffed from this item (see Cait).\r\n\r\nIf you are prioritizing waveclear, you shouldn&#039;t be able to kill champions as easily... it just makes sense.\r\n\r\nTank meta... Guess what? If it&#039;s hard to kill them they will slowly kill you. That is supposed to happen. THis is what tanks have been asking for for 7 odd years.  Now some of them are just too strong (poppers lookin at you) but in general if a tank can do 3 rotations on you you should be dieing...","replies":[{"poster":"Dreadlocks","date":"2017-01-04T13:06:24.717+0000","up_votes":23,"down_votes":1,"body":"if an adc wants to rush 3 crit items vs tanks, they deserve to get out lasted and die","replies":[{"poster":"Handy Sandy ","date":"2017-01-04T13:36:22.245+0000","up_votes":33,"down_votes":5,"body":"But no, they drain tank more than {{champion:8}} can ever do and 1v1 them without getting any peel, like they should need to.","replies":[{"poster":"Rock MD","date":"2017-01-04T16:38:11.987+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=ChromaSpell,realm=NA,application-id=3ErqAdtq,discussion-id=FuJRPGOk,comment-id=00010000,timestamp=2017-01-04T13:36:22.245+0000)\n>\n> But no, they drain tank more than {{champion:8}} can ever do and 1v1 them without getting any peel, like they should need to.\n\nlmao what adc actually 1v1s a tank and doesn't die for it with 3 crit items?","replies":[{"poster":"Daddy Ants","date":"2017-01-04T20:04:14.909+0000","up_votes":12,"down_votes":1,"body":"> [{quoted}](name=Chairman Rock,realm=NA,application-id=3ErqAdtq,discussion-id=FuJRPGOk,comment-id=000100000001,timestamp=2017-01-04T16:38:11.987+0000)\n>\n> lmao what adc actually 1v1s a tank and doesn&#x27;t die for it with 3 crit items?\n\n{{champion:67}}","replies":[{"poster":"Boompenguins","date":"2017-01-05T00:48:56.603+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Antenora,realm=EUW,application-id=3ErqAdtq,discussion-id=FuJRPGOk,comment-id=0001000000010000,timestamp=2017-01-04T20:04:14.909+0000)\n>\n> {{champion:67}}\n\n1v1 a tank and doesnt die? lmao thats the funniest thing i have ever heard. Get your facts right. Dont you mean 1v5 tanks and doesnt die for it with 3 crit items?\nkappa (or maybe not???)\nwhelp.","replies":[]}]}]},{"poster":"aspects1","date":"2017-01-05T02:23:21.359+0000","up_votes":3,"down_votes":0,"body":"{{item:3070}} {{champion:266}} {{item:3070}}","replies":[]},{"poster":"Dreadlocks","date":"2017-01-04T15:26:55.961+0000","up_votes":3,"down_votes":1,"body":"I'm just saying I've had adcs vaynes specifically rush 3 crit items vs a 3 tank team and wonder why she's dying so fast in fights. had she invested in a botrk or at least a vamp scepter, she prob would 1v5 lol.","replies":[]}]},{"poster":"Bernadettas Cat","date":"2017-01-04T19:21:12.697+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Ńø Çígâr,realm=NA,application-id=3ErqAdtq,discussion-id=FuJRPGOk,comment-id=0001,timestamp=2017-01-04T13:06:24.717+0000)\n>\n> if an adc wants to go 3 crit items vs tanks, they deserve to get out lasted and die\n\nBut if an adc doesn't go 3 crit items, they're useless otherwise.\n\nIt's a lose-lose situation.","replies":[{"poster":"Dreadlocks","date":"2017-01-04T19:40:13.807+0000","up_votes":11,"down_votes":3,"body":"uhm, no, adcs should adapt their builds based on their opponent just like everyone else.","replies":[{"poster":"TurquoiseYoshi","date":"2017-01-04T21:41:54.549+0000","up_votes":3,"down_votes":0,"body":"Considering that there's one available %armor pen item, and crit will usually make you do the most damage apart from that, yes, you do have to build crit. At most, you build Merc to get out of the CC that the tanks likely have or Bloodthirster/BoRK to get some lifesteal, but then you're doing even less damage for a bit of protection.","replies":[{"poster":"Blåbæret","date":"2017-01-05T05:00:09.340+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=TurquoiseYoshi,realm=NA,application-id=3ErqAdtq,discussion-id=FuJRPGOk,comment-id=0001000100000001,timestamp=2017-01-04T21:41:54.549+0000)\n>\n> Considering that there&#x27;s one available %armor pen item, and crit will usually make you do the most damage apart from that, yes, you do have to build crit. At most, you build Merc to get out of the CC that the tanks likely have or Bloodthirster/BoRK to get some lifesteal, but then you&#x27;re doing even less damage for a bit of protection.\n\n{{item:3071}} {{item:3036}} {{item:3142}} {{item:3147}} {{item:3814}} {{item:3153}} plenty to choose from + lethality runes you can delete tanks in seconds. Or just get Garen with BC to E into the enemy team, or get a Yasuo and so on. It's like you ADC mains think it's OK to oneshot tanks. Newsflash: tanks are supposed to survive for more than 2 seconds. Don't cry because ADCs actually have counterplay.","replies":[]}]},{"poster":"Jet Sett","date":"2017-01-04T20:26:57.157+0000","up_votes":4,"down_votes":2,"body":"Crit is a core stat for ADC's as well as AD. The only reason they can even get defensive items is because there are AD items like Mercurial and Hexdrinker, otherwise why have one on your team? The most consistent contribution an ADC gives is damage, whether it's siege or champion.","replies":[{"poster":"Dreadlocks","date":"2017-01-04T23:49:59.054+0000","up_votes":3,"down_votes":3,"body":"Yeah so ADC's should just only buy crit, and no lifesteal or res. Items like {{item:3156}} {{item:3139}} {{item:3072}} {{item:3153}} {{item:3026}} {{item:3033}} {{item:3036}} are not worth buying on ADC cuz they have no crit.. #ADClogic?","replies":[{"poster":"Jet Sett","date":"2017-01-05T00:39:11.248+0000","up_votes":3,"down_votes":1,"body":"It was said an ADC has to go 3 crit items, not ONLY crit items. Do you hate them so much that you're spinning comments the wrong way? Or do you hate them to the point where your mind alleviates the details?","replies":[]}]}]}]}]},{"poster":"Chaos689","date":"2017-01-04T23:37:13.952+0000","up_votes":5,"down_votes":1,"body":"The thing is nobody likes tanks.\nTank players hate playing true tanks because they feel useless, so Riot gives them a *bit* of base damage (Garen) and they become antifun for EVERYONE. The tank player still feels sorta useless, but everyone else feels like their backline just got jumped by a 10k HP Garen with a black cleaver and oh look we're DEAD.","replies":[{"poster":"Fondling Gems","date":"2017-01-05T04:41:39.772+0000","up_votes":1,"down_votes":2,"body":"That is because tanks don't function if they don't deal damage.  If tanks posed no kill threat then you could actually just ignore them since the only ones who will be killing you are the carries and the carries are easier to kill than the tanks.  It would mean that you could legitimately walk past a frontline so long as you had a merc because you could get rid of the cc a tank has and kill the enemy carry with no worries about dying to the tank.\n\nThat is why tanks have to have damage and kill pressure, because tanks only function if they are being focused, and if they do no damage there is never a reason to focus them.","replies":[{"poster":"Anidan","date":"2017-01-05T10:17:11.354+0000","up_votes":1,"down_votes":0,"body":"That's not necessarily true. In most games there are generally two types of tanks: the disruptor and the vanguard types. The disruptor controls the battlefield, or at least the flow of the ongoing battle he participates in, by using high amounts of CC (think Leona). The vanguard will typically force themselves into a position so that they're hit by the enemy instead of the intended ally (think Braum). For neither of these do you want to give them kill-threat levels of damage because paired with their role that will make them absurd. Disruptors can't have that damage because high self-contained damage with high amounts of CC generally results in a very frustrating character that can't be fought alone and you can't even save him for last in a teamfight because his high amounts of CC will provide continual peel for allies; likewise, the vanguard can't have that damage because part of their job description is their complete refusal to die in any reasonable frame of time. There is a more complicated kind of tank that pairs damage with CC, but at the cost of built-in survivability, but they tend to be a tank only because their damage tends to be dealt over time at close range or they otherwise have CC that is reapplied constantly throughout a fight (think Sejuani).\n\nSo, no: tanks do not _need_ to have kill pressure. To think so is to immediately dictate incorrectly the role of a tank in video games. Their job is to control the fight through their means, where the kill pressure is almost never from them, but from the teammates they're setting up for.","replies":[{"poster":"Fondling Gems","date":"2017-01-05T20:54:38.022+0000","up_votes":1,"down_votes":0,"body":"The thing is that you can technically ignore them.  Since they don't have kill pressure there is never a need to focus them in a fight unless they are either super low or near a super low ally.  If you can move past them without them ccing you they lose almost all of their utility.  Basically they don't function as tanks.\n\nA tank is someone who specifically makes enemies focus them because that means they are absorbing damage for their team.  If a tank is not doing that then they are not participating in the act of tanking.  They might by _tanky_ but they are not _tanking._\n\nExample.  Sivir can get stupidly tanky.  With 45% cdr she has just over a 5 second cd spellshield.  For a tank that is really strong.  It means it is incredibly hard to kill her.  However her base damage as crap, so she never has kill pressure.  There is literally no need to focus her because you can walk past her.  As such though she is a tank, she is not fulfilling the role of a tank because she might as well no be there as she takes no damage for allies unless she can get in the way of skillshots.\n\nCC \"tanks\" are a bit better off.  However are they really tanking?  The only time they will ever get focused is if they are out of position (this will happen regardless of champion or roll so does not count) or if they are being annoying enough through their cc.  However if they are being annoying then what separates them from something like Janna?  Not much.  They are helping their carry survive, but not contributing damage to a fight.  As such those \"tanks\" are actually just fulfilling the role of an enchanter.\n\nThere still isn't any actual need to focus them if you don't have to though.  Lets pretend this is mid-late game.  We have a real tank (Maokai) and one of your \"tanks\" (Braum)\n\nYour team just got killed, only Maokai is alive.  Enemy starts to siege.  Can a carry afford to get in range of the maokai?  Probably not.  If Maokai goes in the enemy team is actually forced to focus him instead of real objectives.  That is fulfilling the role of a tank, to take damage for more important things like allies or turrets.\n\nEnter Braum.  You team just got killed in a fights.  Only Braum remains.  They start to siege.  Braum goes in.  No on care and hits the turret regardless.  He starts to get the adc a bit low.  Turret goes down.  ADC attacks Braum/minions a few times and heals to full.  Team moves on to win.\n\nSee?  This is why I don't consider most tanky supports to be tanks.  It is because they are just hard to kill enchanters, rather than fulfilling the role of tank and drawing aggro.  They might be hard to kill.  If someone is an idiot and focuses them then they do the job of a tank.  However they don't have the tools to actually tank as per the role of a tank which is to take damage for others.  They do the job of an enchanter at most, they prevent damage to allies.  \n\nYes they tend to amount to similar things, but it means that they are not actually being a tank.  That is why I say if a tank does not have kill pressure then they can't actually fulfill the role of a tank, because you never _have_ to focus them.  You might get zoned off.  You might get cced and die to their ally.  However if they can't kill you there is never a reason to have to kill them over another target.  You might fight them to keep them from moving on to a different target, but you wouldn't fight them over someone else.  If a Maokai was on your face you would fight that because it will kill you after 3 rotations.  You are forced to either fight or flee.  An Alistar isn't going to do that to you.","replies":[{"poster":"Anidan","date":"2017-01-06T02:28:32.237+0000","up_votes":1,"down_votes":0,"body":"In a 1v5 if they have to stop a siege, that's a pretty biased example. Not many tanks really have the damage to require being focused in that situation, and most often neither does Maokai, which often enough is why you won't see a Maokai try to stop them 1v5 because he'd rather just slow them down as much as possible with Saplings and wait for allies.\n\nNow, onward: The job of the CC tanks is to not let you cross them in the first place. If we fiat the whole situation by saying \"if you're able to bypass them without being CC'd\" then you were going to win regardless because you just found a way to bypass the entire role of 20% of their team. This same sort of argument could be applied to your carry's damage capability: if we find a way to bypass his damage (in this case, by killing him before he can deal damage) then we invalidate his entire role and we make it significantly easier to clean up the rest of the enemy team with minimal casualties. The job of a CC tank is to make you think twice about how you engage, because usually their CC isn't something you can side-step, and Braum can't just be outright ignored because how are you going to find a way to ignore the guy standing between you and the carry with a giant shield that absorbs anything meant for the carry? You can't - you have to displace them by using a CC that could have otherwise been used on the carry or kill him outright. This is to say nothing of the CC he contributes to the fight. If you ignore Braum then you allow his CC potential to go unabated. You can't ignore him, you position around him and are mindful of where he is so you can bypass him - you aren't ignoring him, you're wary of him so you can get past his role as best as possible, which can often enough lead to putting yourself in a bad position or force your whole team to shift around. The dynamic of the fight was helped set up by what Braum can do and prevent you from doing. \n\nThe job of a tank, as I mentioned, isn't solely to absorb damage, but that does help: the job of a tank is to control the flow of a battle, which a CC tank does most obviously with their vast amounts of CC. However, those vanguards (Braum, to continue that example) can't be ignored because they'll still control the flow of battle just by the fact that they will forcibly position themselves to take hits for allies. That's not something you can say an enchanter does because they control the battlefield by avoiding _anyone_ getting hit, whereas a Vanguard makes sure that if anyone does, it's them. And you can't ignore any of them, you have to be wary of them and work around it. That's part of the job of a tank. And yes, they do share that kind of role with controllers and enchanters. They are the more physical and direct embodiment of the role, if you want to get on that level. Not very easy to kill a carry when you're being repeatedly slowed, or stunned, or knocked back, etc., and it's also hard to kill them when there is a direct wall between the both of you that comes packaged with his own CC for peel as well. \n\nYou don't tend to ignore a tank, you're wary of them and work around them, which is something they can work to their benefit through coordination with their team. Even if they're the last one alive, you can't say you ignored them unless they screwed everything up so badly that they could be ignored in the first place. You had to minimize his impact knowing what it could be in the first place, and in the case of a CC tank that tends to be much more difficult. How often do you just \"walk past and ignore\" someone like Alistar and Amumu? Not often given the nature of how they work. You have to devote something to them. They do their job, and if they're the first one in, especially as Amumu and Sejuani tend to be, then they have the tankiness to continue to survive long enough to contribute further damage and CC. \n\nNow, you had a point brought up about how you'd never target them over someone else, and my retort to that is: when would you ever prioritize someone over the carry that isn't a healer if you have the chance? Tanks are no special exception to that, it's just that they're there to make sure you don't get to have that choice at all. I wouldn't target a Maokai, for example, over a Vayne if the choice was there, so based on that Maokai is also not a good tank. In that setting I'd only choose Maokai over Vayne if there was something preventing from getting to Vayne, but until then I'll have to hit Maokai so he doesn't disrupt even more of my team. Which is the job of a tank, and more than just Maokai can do that. Leona is a pretty good example. She probably won't directly kill you, but unless something is done about her then she will continue to output some CC throughout the fight and make it generally a pain to do anything about the rest of her team, and if she latches onto a carry then that carry has to get away from her or risk contributing nothing amidst the CC of Leona - Leona, despite not having solo kill threat damage, has become a focus on the back of her CC.\n\n(btw, don't think I instantly think you're wrong or don't understand your perspective, this is just mine and how I see it in games. I'm liking your perspective and how you see this whole situation.)","replies":[{"poster":"Fondling Gems","date":"2017-01-06T05:44:13.400+0000","up_votes":2,"down_votes":0,"body":"Yeah, I definitely see where you are coming from.  It is actually where I used to come from before changing my mind.  A couple things I wanted to point out about your post though.\n\n1)  My scenario wasn't necessarily 1v5 although I totally see that my writing definitely could make it sound like that.  Think of it this way, big fight happens, enemy ADC and top lane bruiser are left alive, your teams Mao/Braum are left alive.  Braum can't do anything in that situation to pull aggro off of the turrets to him.  Mao on the other hand can because he will still kill that carry if he is ignored.\n\n(Also I think Braum is a bit of a special case as far as low damage tanks go due to his E, which actually does allow him to forcefully tank, albeit only for a few seconds at a time.  Alistar/Blitz/Leona is a bit of a better example imo.)\n\n2)  My issue with calling them CC tanks is that their role isn't to tank.  It is to CC people, aka one of the two duties of an enchanter (CC/Protect)  The only reason they are built tanky is because they soak up a lot of AOE, and if they weren't tanky the ease with which they could be killed would mean you would kill them just because it is so easy and you wouldn't have to blow big spells on them.\n\nIf Leona did all her cc from afar and in return wasn't tanky, she would fulfill the same role on a team with a little bit more emphasis on disengage just due to how range works.  So fundamentally she isn't fulfilling the role of a tank but of an enchanter who is given the stats to live in melee due to her lack of range.  She basically can't force people to focus her.\n\nCompare that to any non support tank.  Even those who are CC oriented (Like Mao) still have a lot more damage because they need it to be focused.  Pretty much the only tank that doesn't require damage to function is Rammus, and that is due to his taunt.  However he still needs damage to make his taunt useful because otherwise he isn't fundamentally different from a CC \"tank\"\n\n------------------------------\n\nI just feel like a champion isn't fulfilling a tanking role if it can't force you to focus it under the threat of \"Ignore me and you will die in a few rotations.\"  with Braum being a tad bit of an exception with his E.  It is a definition thing.  Many champions are tanks (class), any champion can be a tank (stats), but not many champions can fulfill the role of a tank (role).\n\nIt is kinda like the support speech where support is both a class and a role.  Or like how ADC is both a class and a role (although at least we can call the class marksman.)\n\nEvery other role has easily definable sections (mid vs mage vs burst mage vs control mage vs assassin) While tank is used to refer to a type of champion, items you buy, and a role you fulfill in a team.  (not role as in position thankfully.  We don't need 4 types of tank)","replies":[{"poster":"Anidan","date":"2017-01-06T05:50:44.828+0000","up_votes":1,"down_votes":0,"body":"You've got a fair point with that. I may have to re-think about my thoughts on the whole subject of tanking in terms of League, but you have given me some pretty good food for thought there, so thank you. Healthy discussion is good for the mind, and it's completely possible that I may have been thinking about the overall structure of the role in the wrong kind of way, so another perspective to bring it to a better line of thinking could prove valuable to further thought on it overall. \n\nThis is where, if I could, I'd give you a cookie, or other baked goody, as thanks.","replies":[{"poster":"Fondling Gems","date":"2017-01-06T06:02:04.783+0000","up_votes":2,"down_votes":0,"body":"Haha, I just love discussions too.  Having a good conversation is always fun and I definitely agree with some of the points you made.  \n\nAs a reward I will go and get myself a cookie.  (You have permission to go get yourself one too so long as you pretend it is from me ;P)","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Oleandervine","date":"2017-01-04T13:05:58.702+0000","up_votes":7,"down_votes":0,"body":"Poppy is getting nerfs. They're already on the PBE.\n\nAs for ADCs, I don't really care one way other. I feel like across the board they do well in any lane, with Yasuo top and mid, Talon and Zed mid, and then marksmen on the Bot. I feel like their itemization is still good, and shouldn't be changed.","replies":[{"poster":"XxxLumberJackxxX","date":"2017-01-04T13:55:56.639+0000","up_votes":20,"down_votes":0,"body":"Zeal items are too homogenized. Pd needs to be a single target dmg item not a weird defensive item as well","replies":[{"poster":"Spârky","date":"2017-01-04T14:06:55.213+0000","up_votes":1,"down_votes":0,"body":"I think the problem with the zeal items is they all are relatively the same minus PD. I think their needs to be some more difference between them. Like PD should more appeal to fighters like graves who can actually use the passive very well. Where as i think runaans is fine but shiv i think needs the passive to be changed it just doesnt wave clear as well as hurricane. So i think they need to think of some way to distinctively make each zeal item different.","replies":[{"poster":"Chromatic Eagle","date":"2017-01-04T14:47:57.900+0000","up_votes":4,"down_votes":0,"body":"Shouldn't shiv be the farming item while hurricane is the team fight item?","replies":[{"poster":"Spârky","date":"2017-01-04T15:32:02.422+0000","up_votes":1,"down_votes":0,"body":"Well the only thing that i dont want them to do is change hurricane so that it doesnt hit multiple targets. Shiv is technically the farming item right now because it can hit the entire minion wave but most adc's do better with ie/hurricane. I think shiv and PD need to be changed around but leave hurricane alone. But maybe tweak a few of the stats on huricane.","replies":[{"poster":"badooga","date":"2017-01-04T21:39:52.621+0000","up_votes":4,"down_votes":0,"body":"If you change Runaan's to not apply on minions only, I think it would solve a few of our problems.","replies":[]}]},{"poster":"XxxLumberJackxxX","date":"2017-01-04T20:22:54.873+0000","up_votes":1,"down_votes":0,"body":"Shiv is burst runs and is on it. Honestly zeal should be out of it and zephyr in","replies":[{"poster":"Votable Jester","date":"2017-01-04T20:27:25.718+0000","up_votes":2,"down_votes":0,"body":"The issue there is that without crit on the item, it'll oftentimes be even weaker for adcs, and it'll no longer be able to crit its passive without another item.","replies":[]}]}]}]}]}]},{"poster":"Surfer Ashe","date":"2017-01-04T15:02:35.010+0000","up_votes":1,"down_votes":8,"body":"What about the mandatory jungler position? How come no one complaining about that?","replies":[{"poster":"AMYS GRAVE","date":"2017-01-04T16:19:32.855+0000","up_votes":18,"down_votes":0,"body":"Jungle is a role, ADC (or more formally marksmen) are a class. ADC dominate the bot position almost exclusively, but jungle is comprised of many classes of champions with mixed degrees of viability (divers, tanks, assassins, etc...)","replies":[]}]},{"poster":"Rivuo","date":"2017-01-04T16:21:08.399+0000","up_votes":9,"down_votes":16,"body":"Platinum diamond challenger and master players on reddit talk about how weak adcs are and need buffs.\n\nBronze silvers and low golds on the boards talking about how they're ok with adcs being shit because they hate getting 1 shot as malphite.\n\nRight.","replies":[{"poster":"Ahristocats","date":"2017-01-04T17:48:05.401+0000","up_votes":9,"down_votes":13,"body":"if you're not diamond you just shut the fuck up and stay back to let your big brothers talking about adc\n\nadc are not weak, and are stil requiered in the game, And i'm not the only diamond saying it i'm sorry.","replies":[{"poster":"Ralanr","date":"2017-01-04T17:56:02.509+0000","up_votes":17,"down_votes":1,"body":"> [{quoted}](name=Dr Sona x Rubick,realm=EUW,application-id=3ErqAdtq,discussion-id=FuJRPGOk,comment-id=00070001,timestamp=2017-01-04T17:48:05.401+0000)\n>\n> **if you&#x27;re not diamond you just shut the fuck up** and stay back to let your big brothers talking about adc\n> \n> adc are not weak, and are stil requiered in the game, And i&#x27;m not the only diamond saying it i&#x27;m sorry.\n\nNo offense, but can we fucking leave that thought process at the door?  If you're understanding of the game is good, you should be able to explain it no matter the rank. \n\nAnd if people don't agree, who cares?  It's not like Riot takes balance that seriously from this board.","replies":[{"poster":"Ahristocats","date":"2017-01-04T18:01:44.831+0000","up_votes":11,"down_votes":4,"body":"i just said this so he realised that the logic \"platine/diamond/master players said this, it must be true\" was flawed, he also said that we're bronze/silver on board which triggered me so hard","replies":[{"poster":"Ralanr","date":"2017-01-04T18:24:06.582+0000","up_votes":4,"down_votes":0,"body":"Ahh.","replies":[]}]}]},{"poster":"SpongebobIsLife","date":"2017-01-04T18:43:43.216+0000","up_votes":5,"down_votes":2,"body":"actually, in imaqtpie's stream yesterday, he stated that ADC currently sucks as it is the only role in which you need a combination of items to be strong (ie plus zeal item), so by the time you get the items, its probably already 20-25 minutes into the game before you are doing meaningful damage to targets, whereas if you pick something like ziggs,  your damage is significantly relevant through all stages of the game nor do you require a combination of items to do damage. Imaqtpie is also the current 5th best player in NA as well as being an adc main, and even he has foregone the role bc it's so much easier to carry in other positions.","replies":[{"poster":"Ralanr","date":"2017-01-04T21:42:37.557+0000","up_votes":5,"down_votes":1,"body":"So the item scaling role sucks without items?\n\nShocker.","replies":[{"poster":"SpongebobIsLife","date":"2017-01-04T22:19:44.044+0000","up_votes":2,"down_votes":0,"body":"well people were getting around that with the pen build, but riot nerfed the champs abusing that build then practically deleted that build, and nerfed fervor (a significant part of their damage output), along with a few other things, it made the already present issues even worse. And the game has become so snowbally with a lot of the changes, that it's really hard for an adc to come back into the game if they are behind or even even (lol). ADC has never been this bad, ive been playing since season four and  have reached diamond these last 2 seasons, and it just  doesn't feel as satisfying to play ad.","replies":[]}]},{"poster":"Gesterr","date":"2017-01-05T22:42:44.218+0000","up_votes":1,"down_votes":0,"body":"Champions that are going for a lategame dps build not getting their power spike until lategame?  Seems to work as intended.\n\nThough I do think the option to opt out of that and build for early game (but trade off lategame power) should be available since Lethality builds are in actually severely gimping that ability.","replies":[{"poster":"SpongebobIsLife","date":"2017-01-06T04:38:47.153+0000","up_votes":1,"down_votes":0,"body":"yeah, but the problem is, most of those champions dont get the chance to reach that powerspike. Games are often decided too quickly and suddenly to give them a chance to actually do damage.","replies":[]}]}]}]},{"poster":"Ralanr","date":"2017-01-04T16:22:54.238+0000","up_votes":3,"down_votes":5,"body":"https://m.reddit.com/r/leagueoflegends/comments/5lv0bz/consider_one_thing_before_you_make/\n\nRemember that neither the boards or Reddit know jack shit about balance.","replies":[{"poster":"Rivuo","date":"2017-01-04T16:33:23.494+0000","up_votes":8,"down_votes":1,"body":"> [{quoted}](name=Ralanr,realm=NA,application-id=3ErqAdtq,discussion-id=FuJRPGOk,comment-id=00070000,timestamp=2017-01-04T16:22:54.238+0000)\n>\n> https://m.reddit.com/r/leagueoflegends/comments/5lv0bz/consider_one_thing_before_you_make/\n> \n> Remember that neither the boards or Reddit know jack shit about balance.\n\nThats just one post by a guy who says be careful how you buff them\n\nEven he knows they're weak","replies":[{"poster":"Ralanr","date":"2017-01-04T16:50:43.602+0000","up_votes":3,"down_votes":5,"body":"I never said they were weak. I just don't sympathize much because it's the only role that's basically required.","replies":[{"poster":"Rivuo","date":"2017-01-04T16:53:05.940+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Ralanr,realm=NA,application-id=3ErqAdtq,discussion-id=FuJRPGOk,comment-id=0007000000000000,timestamp=2017-01-04T16:50:43.602+0000)\n>\n> I never said they were weak. I just don&#x27;t sympathize much because it&#x27;s the only role that&#x27;s basically required.\n\nIt's not required, it's just people get flamed for trying new things. \n\n3 Out of my last 10 ranked games were leblanc adc ( building ap ) and some offbrand supp.\n\nWorked well for them i have to say.","replies":[{"poster":"Ralanr","date":"2017-01-04T16:55:59.998+0000","up_votes":5,"down_votes":2,"body":"> [{quoted}](name=ApexCH,realm=NA,application-id=3ErqAdtq,discussion-id=FuJRPGOk,comment-id=00070000000000000000,timestamp=2017-01-04T16:53:05.940+0000)\n>\n> It&#x27;s not required, it&#x27;s **just people get flamed for trying new things.**\n> \n> 3 Out of my last 10 ranked games were leblanc adc ( building ap ) and some offbrand supp.\n> \n> Worked well for them i have to say.\n\nProbably because the bot lane marksman had been **required** in every meta for the longest time.","replies":[{"poster":"Rivuo","date":"2017-01-04T17:00:45.817+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Ralanr,realm=NA,application-id=3ErqAdtq,discussion-id=FuJRPGOk,comment-id=000700000000000000000000,timestamp=2017-01-04T16:55:59.998+0000)\n>\n> Probably because the bot lane marksman had been **required** in every meta for the longest time.\n\nIf someone takes riven mid i will question their sanity.\nIf someone takes adc mid i will question their sanity.\nIf someone takes kog maw top i will question their sanity.\ntakes urgot jungle i will question their sanity.\n\nLike i said, it's not required it was just so frequently played like that it became meta. \n\nIf fighters mid became a thing for a long time, people would adjust to it and be mad if anything else changed ( see faker taking riven mid ) by anyone else doing it.\n\ni dont want marksman to 2 shot anyone. I dont want marksman to have no counterplay.\n\nBut when theres a video of draven who is not behind auto attacking poppy 36+ times with **_perfect kiting_** and the poppy not dying something is wrong.","replies":[{"poster":"Ralanr","date":"2017-01-04T17:04:33.171+0000","up_votes":4,"down_votes":3,"body":"You mean the video where Draven had two items that were flat damage compared to Poppy's three items and abundance of health (with a level above as well)?","replies":[]}]}]}]}]}]}]}]}]}