{"poster":"Demon Of Sin","date":"2016-11-16T00:37:39.218+0000","title":"6.22 Has Brought Upon The Lag","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hello,\r\n\r\nI'll be quick and precise. Prior to patch 6.22, I had absolutely no issues with ping. The day of the patch, my lag has been insane; the ping would be 49 (normal) and spike up to 200 to about 3k ping here and there. I've never had this issue, and it's quite a nuisance. I also know of multiple individuals who have been experiencing this issue, both online friends and real. I there a fix for this?","replies":[{"poster":"Targons Blade","date":"2016-11-16T02:41:34.409+0000","up_votes":1,"down_votes":0,"body":"Patches only change files inside of your League installation locale, so it's **really unlikely** this is caused by a patch. Large changes or inconsistencies in latency (ping) are caused by an issue between your PC and the server. I'd strongly recommend working through the steps in our [connection guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to ensure this isn't caused by a poor configuration on your local network.\n\nLet me know if those steps caused any change.","replies":[{"poster":"forty two 42","date":"2016-11-18T13:32:49.561+0000","up_votes":1,"down_votes":1,"body":"There are tons of people reporting the exact same problem. Something in patch 6.22 broke LoL for a lot of us. A lot of my friends stopped playing after patch 6.22 because ping spikes have been getting worse (we also all have a different provider and different OS, so it has to be something with the patch).","replies":[]},{"poster":"Most of Asia","date":"2016-11-17T01:48:18.326+0000","up_votes":1,"down_votes":1,"body":"Actually there are a lot of posts from people experiencing lag spikes since 6.22. Including myself. Going to try and use the hextech repair kit. {{item:3152}}","replies":[]},{"poster":"SneakyAzShiite","date":"2016-11-16T02:49:18.744+0000","up_votes":1,"down_votes":1,"body":"There are quite a few people who were experiencing similar problems. Personally I had some FPS issues but things seem to have settled in the past few days.","replies":[]}]}]}