{"poster":"Cyrater","date":"2017-01-18T04:48:06.329+0000","title":"People locking in to feed in champ select","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"Why is this still a thing people have been complaining about it for so long. how one person can just hold everyone hostage. Ive just had the pleasure of a [champ] locking in with [sspell1] and [sspell2] and just run it down mid because his champ was picked. he wont get punished, he gets nothing but wasting the time of 9 other players, 5 of which dont care because hey free win right, so they wont report. This behavior is appalling and nothing is going to be done about it. As I type this the [champ] says _&quot;why report me? giving freelo_&quot;.\n\n  It&#039;s just really sad how one person can ruin the game for others. I guess this post is for rant purposes because ofcourse im mad. Why is it that someone can do something against the rules and not getting punished, this person has likely done it before (speculation) and will do it again.\n\n\nEdit: After looking through his match history I see atleast 6 more games (ranked) where he just buys all tear and has nothing but deaths. How are players like this allowed to keep playing and ruining games for others.","replies":[{"poster":"MooGamer","date":"2017-01-19T23:46:37.186+0000","up_votes":1,"down_votes":0,"body":"This is a very difficult topic for Riot as they have been constantly trying to implement ways of reducing offensive abuse and trolls in the game, adding chat filters, the reporting system and the Leaver Buster system. However, it is not easy to tackle the problems that may occur during the game, for instance, a player may have simply gone and fed mid lane at 2 minutes into the game, but how is the game going to distinguish the difference between a normal kill or just someone feeding? \n\nThis topic is very generalised and possibly the only way for anything good to change or occur, would be the huge playerbase of the league of legends communities to change their whole gaming persona and actually be kind to eachother. However, this would be one of the greatest feats as there are currently 67 million people playing league of legends monthly from gathered statistics.\n\n~Moo","replies":[]}]}