{"poster":"eSports Juice","date":"2015-07-23T07:37:36.220+0000","title":"WO IST FIORA ??? ;(","subforum":"Champions & Gameplay","up_votes":1,"down_votes":10,"body":"Ich hatte von gestern auf heute einen echten alptraum und das mein ich wirklich im ernst hab ich &ouml;fters von &quot;RIOT GAME&quot; S&quot;.\r\nManche Spieler spielen und TRAINIEREN ihre Main&acute;s t&auml;glich bis zu 10 Std. sicherlich manche auch nur 5 Std. aber dann das daf&uuml;r auch t&auml;glich.\r\nSo wenn man das mal jetzt hoch rechnet sind das im Jahr ungef&auml;hr zwischen 2000 und 4000 stunden. Wie kann man den einen champion so stark nerfen das komplett aber wirklich komplett alles anders ist? Ich komm nicht drauf klar und ich sch&auml;tze mal wenn ihr wirklich 25 ~ mil. aktive mitglieder habt das ihr dann sicherlich mehr als 100 mio. regestrierung locker bis lang habt aber wisst auch warum 70 mil. also knapp 70 % das spiel wieder verlassen weil genau so was passiert. Man kann doch nicht ein champion erstellen sich um ihnen jahre lang nicht scheren und pl&ouml;tzlich ihn komplett umgestalten das aussehen sein Q W E R das ist unglaublich warum habt ihr nicht einfach eine &quot;FIORA SCHWESTER&quot; erstellt und ich wette keiner h&auml;tte sich dar&uuml;ber aufgeregt. Au&szlig;erdem fragt man wenn man schon so unendlich viel geld habt wie ihr ERST DIE COM DANN WIRD DEMOKRATISCH ABGESTIMMT UND ERST DANN WERDEN EVENUTELLE &Auml;NDERUNGEN AM SPIEL VORGENOMMEN. \r\n\r\nbei dem was ihr mit dem game anstellt ist es kein wunder das &quot;asien&quot; in die oberhand weltweit hat. schon immer hat. und auch immer haben wird.\r\n\r\neines noch zum schluss ihr werdet es niemals schaffen LoL auszubalancieren ihr habt es in den letzen 5 jahren nicht geschafft und werden es auch nicht in zukunft auszubalancieren counter wird ist meiner ansicht in diesem game immer geben das liegt nicht an euer schlechten arbeit wobei es dazu beitr&auml;gt NEIN es liegt auch daran das menschen nun mal zur professionalit&auml;t neigen d.h &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; DAS INTERNET WIRD NIEMALS SICHER SEIN. &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt; ich mein damit nur weil ein spieler zu gut euer ansicht f&uuml;r das spiel mit dem gewissen champ ist hei&szlig;t es nicht das ein anderer spieler das mit dem generften champ nicht auch kann von dem her sind eure &auml;ndernungen und bastel arbeiten sinnlos.\r\n\r\nauf gehts blizzard ich komme :D","replies":[{"poster":"Ashuna","date":"2015-07-23T07:41:35.442+0000","up_votes":3,"down_votes":0,"body":"Ohne Spaß, ich verstehe dich nicht. \n\nmfg Ashuna {{champion:1}}","replies":[]},{"poster":"Bergelmir32","date":"2015-07-23T09:41:17.469+0000","up_votes":1,"down_votes":0,"body":"Ist doch immer das Selbe. Ein Champ wird verändert, dann kommen die Mains aber vor allem die \"Mains\", heulen rum bis zum geht nicht mehr und spätestens 2 Wochen nach nachdem die Überarbeitung live ist kräht kein Hahn mehr danach.\nWenn Riot irgendwas verändert muss man echt das Forum meiden, was da immer für Leute in die Foren gespühlt werden aber kann man ja froh sein das du das hier nicht komplett mit Capslock verfasst hast, so wie die letzten \"Beiträge\" zu diesem Thema.","replies":[]},{"poster":"Alustus","date":"2015-07-23T09:27:39.227+0000","up_votes":1,"down_votes":0,"body":"Nunja Fiora musste überarbeitet werden, da sie ein sehr problematisches kit hatte.\n\nDas LoL um einiges weniger aktive Spieler als Registrierte hat ist klar.\nDas ist aber bei HotS, Dota, Dota2 nicht anders, und hat nur sehr wenig mit einzelnen reworks zu tun.\n\nEs gibt kaum Spieler die nur einen Champion mainen, und noch weniger die aufhören weil ihr Champ überarbeitet wird.\n\n> \n> eines noch zum schluss ihr werdet es niemals schaffen LoL auszubalancieren ihr habt es in den letzen 5 jahren nicht geschafft und werden es auch nicht in zukunft auszubalancieren counter wird ist meiner ansicht in diesem game immer geben das liegt nicht an euer schlechten arbeit wobei es dazu beiträgt NEIN es liegt auch daran das menschen nun mal zur professionalität neigen d.h >>>>>>>>>>>>>>>>>>>>>>>>> DAS INTERNET WIRD NIEMALS SICHER SEIN\n\nWas ist dass den für eine aussage, LoL ist gebalanct oder kennst du einen CHampion der eine Winrate über 60% hat ?\n\nDie meisten Champions schwanken zwischen 48% und 52% winrate.\nEs gibt keinen Champion der keinen Counter hat oder gegen den es unmöglich ist zu gewinnen.\n\nDie Meta ändert sich bei kleinen Gegenstandänderungen meist komplett bis auf ein paar Champions wo das Kit so vielseitig ist, dass man sie immer spielen kann.","replies":[{"poster":"Ashuna","date":"2015-07-23T09:37:23.923+0000","up_votes":1,"down_votes":0,"body":"Ja LoL ist an sich sehr Balanced. Das Stimmt aber Winratios sind leider gerade auch sehr niedrig bei manchen Champions, es reicht von 42% bis 54%. LoL ist aber sonst immer verdammt balanced und hat keinen Champion der OP ist, das stimmt. Man kann ja mal Highelo Leute fragen die werden meist das gleiche behaupten. Der einzige Champ der OP ist, ist Teemo.\n\nFiora hat sogar im letzten Monat eine Winratio von 53,8%\n\nmfg Ashuna {{champion:1}}","replies":[]}]},{"poster":"Snowgen","date":"2015-07-23T08:33:35.847+0000","up_votes":1,"down_votes":0,"body":"Nur weil ein Champion überarbeitet wird, heißt es nicht dass er direkt schwächer ist. Mir ist bis jetzt kein Rework bekannt, wo ein Champion so schlecht gemacht wurde , dass er unspielbar wurde. ( eventuell Zilean, aber den spiele ich zu wenig um darüber urteilen zu können.)\n\nHier ein paar  Beispiele für positive Reworks: Ryze, Maokai, Sion.\nOhne die Reworks würde man Maokai und Sion bis heute nicht sehen. \nUnd nicht zu vergessen Sivir, vor dem Rework wurde sie nicht mal als ADC anerkannt. \n\nBisher waren die meisten Reworks sehr positiv , und kamen positiv bei der Community an. \nSelbst wenn du eine Umfrage starten würdest, würden die Meisten  für einen Fiora rework sprechen, einfach weil der Champion zurzeit unattraktiv für die mehrzahl der Spieler ist. \n\nDas Ziel von Riot ist sicherlich nicht, alle Counter auszuschalten. Würde es keine Counter in Lol geben, wäre es ziemlich langweilig. \n\nAchja und Blizzard wird ganz bestimmt auch nicht auf deine persönlichen Wünsche eingehen, einfach weil die Masse entscheidet.\n\nIch wünsche dir dennoch alles gute bei Blizzard, bzw bis in einer Woche in LoL :)\n\nMfG\n\nLaw{{champion:42}}","replies":[]},{"poster":"Kaitri","date":"2015-07-23T08:06:47.970+0000","up_votes":1,"down_votes":0,"body":"überarbeitung =/= nerf.\n\nund nur damit du es weißt... blizzard wartet auch nicht auf irgendwelche abstimmugn die machen auch was ihnen passt.\nund wo hat asien die oberhand? japan hatte bis anfang diees Jahres nichtmal LoL.","replies":[]},{"poster":"Red Riding Annîe","date":"2015-07-23T07:41:50.101+0000","up_votes":1,"down_votes":0,"body":"kenne das selbe mit meinem Main GangPlank! \nDen spielt jetzt jeder und joa...ist ne umstellung klar.\n\naber wehren kann man sich dagegen nicht :D","replies":[]}]}