{"poster":"Dænerys Jelmazmo","date":"2017-05-10T23:44:23.466+0000","title":"Harto de  SKT","subforum":"Esports","up_votes":4,"down_votes":34,"body":"&iquest;No est&aacute;n hartos de que siempre gane SKT? &iquest;Y del idolatramiento al Faker? &iexcl;&iexcl;PUES YO SI !!\r\n Nunca Gane TSM o Fnatic.\r\n Es que les tengo tanta rabia a los chinos esos &gt;:v","replies":[{"poster":"Desaroll","date":"2017-05-11T00:02:41.379+0000","up_votes":9,"down_votes":0,"body":"Pues se lo ganaron >_<\n\nMientras sigan ganando, no creo que se merezcan que los bajen del podio solo por ser los mismos xD\n\nSuerte!\n\nPD: Son coreanos.","replies":[]},{"poster":"ZombieCrow","date":"2017-05-10T23:51:16.059+0000","up_votes":6,"down_votes":0,"body":"TSM perdió contra un equipo que proviene de las regiones emergentes, yo no esperaría mucho de tsm y bueno que decir de fnatic ni siquiera están en el msi. SKT tiene lo que merece y nadie tiene el nivel para medirse contra ellos.","replies":[]},{"poster":"sentey26","date":"2017-05-10T23:57:17.064+0000","up_votes":5,"down_votes":0,"body":"Yo el año pasado no queria que ganen, pero ahora el equipo entero lo amo, Peanut , Faker , Huni, es emocionante verlos jugar, aprendes demaciado de ellos , si te cansas de verlos jugar no te gusta el lol xD ( es como el barcelona de antes en el futbol, no me gustaba que ganen todo pero eso era futbol al mas alto nivel )","replies":[{"poster":"AustinAries","date":"2017-05-11T04:05:18.076+0000","up_votes":2,"down_votes":0,"body":"Uno aprende mucho, en especial de Huni, se aprende como tiltear en cada partida.","replies":[]}]},{"poster":"zelaya19","date":"2017-05-10T23:50:48.376+0000","up_votes":4,"down_votes":0,"body":"Por algo son los mejores de mundo, bien merecidos. ¿Cómo nos vamos a cansar de ver a los mejores jugadores? \n\nSi ganan es porque los demás no se han propuesto en como vencerlos, y porque SKT es un excelente equipo.","replies":[]},{"poster":"Salvor","date":"2017-05-10T23:51:49.169+0000","up_votes":1,"down_votes":6,"body":"Si, entiendo, es una lastima que el nivel no sea mas parejo, tengo esperanza de que algun dia pierdan contra un team full antimeta.\nSaludos.","replies":[{"poster":"Sir Crucifix ","date":"2017-05-11T16:55:59.794+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Salvor Hardin,realm=LAS,application-id=Ky2nrTjR,discussion-id=g43EtBjT,comment-id=0003,timestamp=2017-05-10T23:51:49.169+0000)\n>\n> Si, entiendo, es una lastima que el nivel no sea mas parejo, tengo esperanza de que algun dia pierdan contra un team full antimeta.\n> Saludos.\n\nSkt tuvo que banear a miss fortuna porque se les venia la noche","replies":[{"poster":"Salvor","date":"2017-05-11T17:11:08.613+0000","up_votes":1,"down_votes":0,"body":"xD","replies":[]}]}]},{"poster":"Yazzy","date":"2017-05-11T00:34:16.655+0000","up_votes":2,"down_votes":0,"body":"Te muestro la pirámide de nivel en LoL:\n\nDe peor a mejor: Wildcard, EUW, NA, y todos los demás - China - Corea.\n\nMientras siga siendo así, tanto SKT como SSG, ROX Tigers o como se llamen ahora van a seguir siendo los mejores jajajaja","replies":[{"poster":"WT AraelF","date":"2017-05-11T17:39:58.899+0000","up_votes":3,"down_votes":0,"body":"China actualmente no esta segundo. Muchos de los talentos koreanos dejaron China y esta region ahora esta en un proceso de reestructuracion de sus equipos. Honestamente, el power ranking ahora es una ensalada. Lo unico claro es que Korea esta hoy por hoy dos pasos arriba de todo el resto.","replies":[{"poster":"Yazzy","date":"2017-05-12T00:35:52.929+0000","up_votes":1,"down_votes":1,"body":"Y que la Wildcard está subiendo peldaños muy rápidamente","replies":[]}]},{"poster":"AustinAries","date":"2017-05-11T03:53:35.746+0000","up_votes":1,"down_votes":0,"body":"Rox Tigers es un equipo de mitad de tabla actualmente.\nEUW en los ultimos 2 años tuvo 3 semifinalistas en los mundiales, NA tiene suerte si alguno de sus equipos salen de fase de grupos...","replies":[{"poster":"Yazzy","date":"2017-05-11T09:17:19.762+0000","up_votes":1,"down_votes":1,"body":"El año pasado estuvo C9 en semifinales, en 2015 si que no hubo clasificado de NA. En 2014 estuvo TSM.\n\nNo seamos hipócritas. EUW y NA están al mismo nivel, por debajo de China y este por debajo de Corea.","replies":[{"poster":"AustinAries","date":"2017-05-12T01:55:51.845+0000","up_votes":1,"down_votes":0,"body":"A ver, los equipos de NA SIEMPRE choquearon en torneos internacionales...\nEn la S1, que fue prácticamente un interserver entre NA y EW, llegaron a la final 2 equipos de EU (Y lo cómico es que esa vez fue la única que metieron equipos en semifinales de worlds).\nEn la S2 hubieron 2 equipos de EU en semis (CLG.EU y M5), uno de KR (Azubu) y quienes salieron campeones TPA.\nEn la S3 TSM y Vulcum quedaron afuera en fase de grupos y C9 en cuartos de final... Los semifinalistas fueron 1 equipo de EU (Fnatic), 1 de China (SHRC) y 2 Kr (NBS y SKT).\nEn la S4 se puede decir que tuvieron su mejor temporada en el \"lol de verdad\" (Ya que el mundial de la S1 es mas considerado un DreamHack que un mundial) metiendo 2 equipos en cuartos de final. Mientras que fue el \"peor\" de EU. En la semifinal hubieron 2 equipos Chinos (OMG y SHRC) y 2 KR (SSW y SSB).\nEn la S5 ninguno de los equipos de NA paso la fase de grupos... Mientras que EU metido 2 equipos en semifinales (Fnatic y Origen) y los otros 2 fueron de KR (Koo y SKT)\nEn la S6 C9 llego a 4tos de final (Se puede decir que es el \"mejor representante de NA\" en mundiales). EU metió a H2k en semifinales, junto a los 3 equipos de KR (Rox, SSG y SKT).\nEn los únicos 2 torneos que NA mostró \"mejor nivel\" que EU (En torneos de RIOT, no cuento IEMs por que en eso es hasta peor...), fue en el mundial de la S4 y el MSI de la temporada pasada (Que CLG llego a la final)\nBueno, esto fue un poco de historia básica del lol competitivo internacional, nos vemos en otro capitulo.","replies":[]},{"poster":"WT AraelF","date":"2017-05-11T17:46:34.656+0000","up_votes":1,"down_votes":0,"body":"2016 C9 estuvo en cuartos de final (perdio con SSG, a la postre finalista), y H2K de EU llego a semifinales. 2015 ningun equipo de NA paso la fase grupal, EU tuvo a dos semifinalistas (FNC y OG). 2014 Tanto TSM como C9 fueron cuartofinalistas, donde cayeron frente a los dos Samsungs. Ese año EU no salio de la fase grupal con ningun equipo.","replies":[]}]}]},{"poster":"zelaya19","date":"2017-05-11T00:53:30.086+0000","up_votes":1,"down_votes":0,"body":"EUW debajo de NA?","replies":[{"poster":"Yazzy","date":"2017-05-11T09:10:19.427+0000","up_votes":1,"down_votes":0,"body":"Al mismo nivel.","replies":[]}]}]},{"poster":"Liliths","date":"2017-05-11T00:04:59.150+0000","up_votes":1,"down_votes":1,"body":"No es como si no se lo merecieran :'v\nQuieras que no Faker como tri-campeon mundial consecutivo que es se merece  la fama que tiene.\nPor otro parte SKT no ha perdido ni un mundial. Que podemos esperar de ellos :v","replies":[{"poster":"zelaya19","date":"2017-05-11T00:12:40.095+0000","up_votes":2,"down_votes":1,"body":"En 2014 no se clasificaron, y de paso, SSW ese mismo año fue el equipo más arrollador de la historia en un mundial. Daba gusto verlos jugar, al min 15 la partida ya estaba decidida. Lástima que después de ganar el mundial se desarmó :(","replies":[{"poster":"Liliths","date":"2017-05-11T00:27:53.736+0000","up_votes":2,"down_votes":1,"body":"En 2014 no les dejaron participar en el Mundial, debido a que ganaron en 2013.\nIba contra las reglas participar.","replies":[{"poster":"hi im sushi","date":"2017-05-11T03:41:39.862+0000","up_votes":1,"down_votes":1,"body":"What?\n\nPor lo que sé, SKT no clasificó al mundial del 2014 porque perdieron en el repechaje (les ganó Najin creo y samsung white y blue ya tenian los dos primeros puestos de korea)","replies":[{"poster":"Liliths","date":"2017-05-11T19:06:16.530+0000","up_votes":2,"down_votes":0,"body":"Enserio ? Entonces nose de donde carajo saque que era porque no les dejaron.","replies":[{"poster":"AustinAries","date":"2017-05-12T01:42:52.104+0000","up_votes":1,"down_votes":0,"body":"Lo que te referís es la \"maldición\" de los campeones mundiales, que se rompió en la temporada pasada. Esa \"maldición\" decía que los que salían campeones mundiales una temporada, no clasificaban para la siguiente (Le paso a Fnatic en la S2, le paso a TPA en la S3, le paso a SKT en la S4, le paso a SSW en la S5)","replies":[]},{"poster":"Avarøsan","date":"2017-05-11T22:03:34.736+0000","up_votes":1,"down_votes":1,"body":"Yo también escuché lo de que no les dejaron participar en el mundial por la anterior victoria, pero tampoco se donde lo vi xD","replies":[]}]}]},{"poster":"AustinAries","date":"2017-05-11T04:01:02.873+0000","up_votes":1,"down_votes":0,"body":"SKT no participo en el mundial del 2014 por que no se clasifico...\nLos 3 que participaron fueron SSB (Quien clasifico como el primero de de la OGN al tener mas puntos de campeonato), SSW (Equipo con la segunda mayor cantidad de puntos de campeonato, conseguidos al ganarle 3-0 a SKT), y NWS (Que gano el regional de KR, ganándole a SKT en la final 3-1).","replies":[]}]},{"poster":"AustinAries","date":"2017-05-11T04:04:27.752+0000","up_votes":1,"down_votes":0,"body":"SKT en la S5 perdió solo 1 partido, SSW en la S4 perdió 2.","replies":[]}]}]},{"poster":"furikake","date":"2017-05-11T00:38:52.567+0000","up_votes":2,"down_votes":0,"body":"Decir eso es como quejarse de que Messi y el barcelona (en fútbol) se nombran mucho.\nSon los mejores y es normal que pase eso.","replies":[]},{"poster":"Conejito Fufu","date":"2017-05-10T23:59:50.950+0000","up_votes":2,"down_votes":0,"body":"Como en todo, existe alguien o algo que son los mejores. Aca en lol es SKT. En futbol lo era el barsa y asi con todo..\n\nLo que pasa es que es algo re comun que se quiera que gane el de menos nivel o que el mejor caiga, es el reto tmb que tiene alguien cuando es el mejor, de no dejarse caer.\n\nEn el futbol (De nuevo como ejemplo) Si juega un club de primera contra otro de categoria inferior, es normal qe todo el mundo banque al inferior :P","replies":[]},{"poster":"TresBans","date":"2017-05-11T00:17:14.381+0000","up_votes":3,"down_votes":1,"body":"Coseche sus Negativos.\nEstas en todos tus derechos, pero a la gente le gusta ver jugar profesionales, asi como me gusta ver futbol.\notra cosas no son chinos.","replies":[]},{"poster":"The Blanc Senna","date":"2017-05-19T19:06:08.119+0000","up_votes":1,"down_votes":0,"body":"Son coreanos ademas XD son mas buenos que los demás por eso siempre ganan {{champion:51}} {{champion:51}} {{champion:51}} {{champion:51}} {{champion:51}} {{champion:51}}","replies":[]},{"poster":"SnarfRa","date":"2017-05-19T17:31:40.977+0000","up_votes":1,"down_votes":0,"body":"Si tanto te harta armate un team, y superalos, son lejos los mejores y se ganan estar ahi. \nY no lo digo de fan, ni nada por el estilo, si miras las partidas te das cuenta xq ganan y que realmente son buenos.\n\nEn lo personal y no es nada contra quien escribio el post, pero me revienta la gente que dice que no le gusta SKT xq ganan todo. \nLa verdad es que a mi me gusta el buen LOL y las demas regiones dejan mucho que desear realmente (y lamentablemente).","replies":[]},{"poster":"Ray06","date":"2017-05-11T21:56:09.611+0000","up_votes":1,"down_votes":0,"body":"hacete profecional  y destronalos, te estare apoyando","replies":[]},{"poster":"Yaminari","date":"2017-05-11T03:43:35.438+0000","up_votes":1,"down_votes":0,"body":"Yo de lo que estoy harto es de la gente que se pone skt en sus nombres de invocador....... La verdad no entiendo que piensan haciendo eso...","replies":[]},{"poster":"devilman10","date":"2017-05-11T02:21:22.272+0000","up_votes":1,"down_votes":0,"body":"A mi no me importan las ligas internacionales o como se diga {{sticker:slayer-jinx-wink}}  ya que yo juego para divertirme o para jugar con personas agradables, si no ganan debe ser por algo no?","replies":[]},{"poster":"Shion Archimago","date":"2017-05-11T01:07:28.340+0000","up_votes":1,"down_votes":0,"body":"la verdad no ver a god faker y sus compañeros jugar siempre es un espectaculo","replies":[]},{"poster":"VodkaCL","date":"2017-05-10T23:45:24.517+0000","up_votes":1,"down_votes":0,"body":"el problema no es SKT sino que nadie esta realmente al nivel de ellos por eso en las partidas siempre arrasan y se tornan aburridas","replies":[]},{"poster":"8choxD","date":"2017-05-11T00:54:42.075+0000","up_votes":1,"down_votes":6,"body":"No son chinos, son coreanos, y si... pero que se le va a hacer, ni un otro esta a su nivel, ellos pasan 16 hs al dia jugando no se deben ni bañar, deben estar re traumados con el juego..\n\nEn cambio los demas equipos se lo toman en serio, pero viven un poco mas...","replies":[]}]}