{"poster":"Dænerys Jelmazmo","date":"2018-06-16T21:36:15.910+0000","title":"Meta actual","subforum":"Charlas Generales","up_votes":4,"down_votes":2,"body":"Como main adc me siento muy disgustado con lo que est&aacute; pasando con la BotLane actualmente, si ya s&eacute; que quer&iacute;an m&aacute;s variedad pero ya se est&aacute;n pasando {{item:3070}} {{item:3151}}","replies":[{"poster":"Onslaugth","date":"2018-06-17T01:15:04.006+0000","up_votes":4,"down_votes":0,"body":"Se estan pasando...claro...Ni que los adc hubieran estado 8 años fijos en botlane pobres ....Amigo ,literalmente desde que se creo el primer meta el adc estuvo fijo y fue viable mas alla de sus winrate .Porque por 1 parche no sean viables ,ya lloran...Como que muchos personajes y roles sufrieron igual ,pero al parecer si tocan a los adc se muere todo XD .","replies":[{"poster":"ADC 2K20","date":"2018-06-17T02:06:56.803+0000","up_votes":0,"down_votes":1,"body":"> [{quoted}](name=Onslaugth,realm=LAS,application-id=v7qsfXsE,discussion-id=AlAMg7Y9,comment-id=0005,timestamp=2018-06-17T01:15:04.006+0000)\n>\n> Se estan pasando...claro...Ni que los adc hubieran estado 8 años fijos en botlane pobres ....Amigo ,literalmente desde que se creo el primer meta el adc estuvo fijo y fue viable mas alla de sus winrate .Porque por 1 parche no sean viables ,ya lloran...Como que muchos personajes y roles sufrieron igual ,pero al parecer si tocan a los adc se muere todo XD .\n\nPrimero que nada, nadie te dijo nada para que te ofendas como un niño y empiezas a criticar cosas que no sabes.\nVolviendo al principio, a los adc se le han cambiado muchas veces, por ejemplo con el meta de los asesinos donde era mejor llevar un mago en la bot que un adc, o en el meta de los tanques donde se empezó a ver yasuo adc.\n\nLuego, los winrate de los adc nunca estuvieron tan alto como tu dices, si queres hablar de win rate altos, los junglas son los reyes en eso, en algunas season como la 6 durante 2 parches con mas de 57% de winrate, aparte hablas de que los adc estan fijos desde la season 1, no tiene sentido, ya que desde la season 2 que todos los roles tienen lineas fijas, los tiradores van adc junto a los soportes porque así funciona el juego, ya que son débiles en early y necesitan ayuda.\n\nY para terminar hablas de llorar cuando en tu historial de comentarios se ven mas de 3 comentarios en el mismo día criticando a la gente solo porque da su opinión del tema, parece que el que esta llorando acá sos vos.\n\nAmablemente Silver.","replies":[{"poster":"Onslaugth","date":"2018-06-18T04:09:57.267+0000","up_votes":1,"down_votes":0,"body":"No se que dije para ofenderte pero calmate brooo ,porque tan ardido porque no me dan pena los tiradores desplazados por el meta?Tanta arena tenes que te pones a buscar comentarios XD .\n Asi como vos te expresas en tu opinion yo me expreso en la mia ,que problemo hay ?","replies":[]},{"poster":"Isalgin","date":"2018-06-17T03:09:30.085+0000","up_votes":1,"down_votes":0,"body":"> no tiene sentido, ya que desde la season 2 que todos los roles tienen lineas fijas, los tiradores van adc junto a los soportes porque así funciona el juego, \n\nmmm creo que te has perdido en Vayne tops, Graves jg . Ahora en si el rol soporte es aun el mas cuestionable, ya que si bien hay campeones (casi)exclusivamente de esa linea (hablemos de soraka janna y nami que no es meta verlas en otra linea) , el rol se ve colmado de champs que no son intecionadamente soportes . Hablo de magos como Brand o Zyra que eran midlaners y ahora ya son considerados soportes, tenemos tankes luchadores como Malphite, Poppy, Trundle y recordemos el mejor ejemplo en Leona que fue diseñada como una carrilera en solitario.\nEL top, teniendo metas de tankes farmers y luego luchadores de roaming, y el mid que acorde la season se iba o asesino o mago, son roles menos dinamicos ... o al menos lo eran.\n\nNo todos los roles quedaron fijos, pero el meta real se vio sacudido en las ultimas dos seasons. (al menos eso creo, en la primer partida de la LCK jugaron practicamente sin jg con el tirador llevando el smite)\n\nPD: aun me causa gracia que en algun momento Lux mid era el pick favorito en competitivo","replies":[]}]}]},{"poster":"Gonk","date":"2018-06-16T23:45:38.218+0000","up_votes":2,"down_votes":0,"body":"\"ya se están pasando\", como que recién en 1 parche y medio comenzó este meta. Cuando el bot era el que carreaba (que estuvimos desde a mitad de la temporada 7) el top no servia para nada, sino para ver como perdía la linea del bot aliada y decir: que mal, no puedo hacer nada al respecto. Era aburrido el meta de \"adc que gana linea, adc que carrea\", es mejor el de ahora que es: ir con lo que quieras.\n\n\"Como main adc me siento muy disgustado\" Podes seguir usando tiradores, no todos los tirados son los que no estan en el meta ;)","replies":[{"poster":"ADC 2K20","date":"2018-06-17T02:12:00.448+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gonk7137,realm=LAS,application-id=v7qsfXsE,discussion-id=AlAMg7Y9,comment-id=0004,timestamp=2018-06-16T23:45:38.218+0000)\n>\n> &quot;ya se están pasando&quot;, como que recién en 1 parche y medio comenzó este meta. Cuando el bot era el que carreaba (que estuvimos desde a mitad de la temporada 7) el top no servia para nada, sino para ver como perdía la linea del bot aliada y decir: que mal, no puedo hacer nada al respecto. Era aburrido el meta de &quot;adc que gana linea, adc que carrea&quot;, es mejor el de ahora que es: ir con lo que quieras.\n> \n> &quot;Como main adc me siento muy disgustado&quot; Podes seguir usando tiradores, no todos los tirados son los que no estan en el meta ;)\n\nEstoy de acuerdo contigo conque los adc han estado fuertes, pero no se puede decir que lo que esta pasando es normal, en mi caso la queja no vendría porque los adc están débiles, en todo caso la queja es que los adc no existen ya que cualquier cosa les gana, hasta riot ya admito que lo que hicieron los adc fue demasiado, ya que tocaron la estadistica principal de los adc (el critico) y se les fue de la mano.\n\nEl nerfeo era obvio y necesario, pero se les fue de las manos, esa es la queja. Y claro que hay adc en meta, como lucian o mf, pero te aseguro que es 10 veces mejor y con un 4% mas de winrate, sacar yasuo o ornn+sion o darius que sacar cualquier adc.\n\nAmablemente Silver.","replies":[]}]},{"poster":"Sir Crucifix ","date":"2018-06-16T22:13:38.657+0000","up_votes":2,"down_votes":0,"body":"Yo estoty re feliz xD","replies":[]},{"poster":"Vaaš","date":"2018-06-16T22:33:40.246+0000","up_votes":1,"down_votes":0,"body":"Me pasa lo mismo hace semanas creo... o hace muchas pero MUCHAS partidas que no uso a Jhin.\n\nFeelsBadMan.","replies":[]},{"poster":"Mazoku","date":"2018-06-16T21:38:15.605+0000","up_votes":1,"down_votes":0,"body":"Mainea otra cosa.","replies":[]},{"poster":"OpiesChurch","date":"2018-06-16T23:34:10.447+0000","up_votes":1,"down_votes":1,"body":"me parece un asco el meta actual","replies":[]}]}