{"poster":"Naoumi Inoue","date":"2018-03-22T05:48:08.487+0000","title":"8.6 frissítés, supportoknak","up_votes":4,"down_votes":0,"body":"Szerintetek ezzel, hogy kital&aacute;lt&aacute;k, hogy nem j&aacute;r arany az&eacute;rt, ha egy sz&ouml;vets&eacute;ges hős farmol, vagy enemyt gyap, nem fognak s&eacute;r&uuml;lni a supportok???\r\nMi fog most t&ouml;rt&eacute;nni? Minden support elkezd farmolni?\r\n\r\nNem &eacute;rtem,mire volt ez j&oacute;!\r\n\r\nAz &ouml;sszes support itemből kivett&eacute;k ezt a funkci&oacute;t, de mi&eacute;rt???\r\n\r\nK&ouml;szi!","replies":[{"poster":"SilentCircle","date":"2018-03-22T12:29:35.595+0000","title":null,"up_votes":2,"down_votes":2,"body":"Ez a játék egyre sz.abb a community is. Eddig nem mondtam ezt mert nem úgy gondoltam de most kimondom hogy a legfontosabb a reworkok a akinek és az új hősök hogy dőljön a della.","replies":[{"poster":"Storiaron","date":"2018-03-22T17:44:07.671+0000","title":null,"up_votes":1,"down_votes":0,"body":"A legtöbb \"della\" úgy dől, ha kiegyensúlyozott patcheket adnak ki, mert az esport ként való működés közvetlen és közvetett úton is a legjövedelmezőbb. Tehát nem, a riot nem teszi direkt tönkre az egyetlen játékát, és a patcheket diamond-master szintűek rakják össze, tehát biztosan jobban tudják megítélni, hogy mit miért csinálnak, mint azt te, vagy én tudnám.","replies":[{"poster":"Gresident","date":"2018-03-22T19:36:27.131+0000","title":null,"up_votes":1,"down_votes":0,"body":"Csak a kiegyensúlyozott játékban,  a diamond és master stb a játékosok 1% (sem).","replies":[{"poster":"Storiaron","date":"2018-03-22T21:32:44.326+0000","title":null,"up_votes":3,"down_votes":0,"body":"Isten ments, hogy bronz alja igényhez igazítsák a metát. Folyamatosan megy a sírás, hogy ennyire, meg annyira broken megint midnen assasin, és amikor megnézed, akkor rohadtul hátrányból indul mindegyikük, mert nem erősek egyáltalán.\n\nTudod ki a legerősebb assasin az elmúlt hónapban?\nEkko 25. hellyel, kereken 51.9% győzelmi aránnyal. Jah játszhatatlan a játék az assasinok miatt annyira erősek.\nBronzban egyébként 23. helyet foglal el 50.27% győzelmi aránnyal. Hagyom is abba a játékot, mert ez egyre nagyobb szar és csak az érdekli a riotot h dőljön a \"della\".\n\nDe így megmondom, hogy ha a minden bizonnyal a metáról jobb képpel rendelkező unranked művészre bíznánk a dolgokat, akkor egy zed, fizz, talon, yasuo nerfel kezdődne a dolog, folytatódva gondolom az ő mainjének az egekbe buffolásával. Lehet, hogy ne, de ha éppenséggel egy multimillió dolláros céget vezetnék, akkor nem feltétlenül szeretném kipróbálni, hogy mennyire tenné élvezhetőbbé 1-1 bronze szakértő keze a játékot.","replies":[{"poster":"Gresident","date":"2018-03-23T10:07:01.729+0000","title":null,"up_votes":1,"down_votes":0,"body":"Akkor válaszolj arra, hogyan lehet védekezni az assasinok ellen adcvel?\n\nMert én azt látom, hogy ha egy {{champion:238}} {{champion:107}} {{champion:121}} {{champion:141}} {{champion:91}} rápakolok {{item:3147}} +{{item:3142}} +{{item:3071}}, akkor az adc esélytelen.\n\nBár lehet, hogy ezeken az itemeken kellene változtatni, nem véletlenül veszik ezeket a tankok is...","replies":[{"poster":"Storiaron","date":"2018-03-23T13:17:52.607+0000","title":null,"up_votes":2,"down_votes":0,"body":"{{sticker:sg-janna}}","replies":[]}]}]}]},{"poster":"Gamma Ray","date":"2018-03-22T19:31:23.640+0000","title":null,"up_votes":2,"down_votes":1,"body":"Mégis mióta elkezdődött ez a dolog a mikael tégelyének szétszedésével amivel ott rögtön/instant tudtam segíteni egy valakinek, azóta azt érzem, hogy kemény szop*rolleren ülök. Egy embert, csak egyet, de azt instant meg tudtam menteni. Akkor elkezdték szétcincálni az egész mindenséget.\nAzóta azt érzem, hogy folyamatosan a gyors killek vannak előnyben részesítve. Folyamatosan az van sulykolva, hogy hamar gyorsan valaki nyerjen, mindegy milyen áron.\nAz átlag olyan 25 perc körüli játékidő, szemben a tavalyi 40 percekkel. 25 perc call of assassin. A ranak sem véletlen megy el ebbe az irányba. Lószar heal, lószar shield, de repül. A lényeg, hogy t1-től az ellenfél t1-ig repüljön... Semmire nem jó összességében, de repül. Ha jól röptetik dupla kill, ha szarul.. jön a roller.\nOlyan ritka a tank itt, mint a fehér holló. Nem is csodálom, ezeket a frappáns rúnákat így összerakni... Valaki a napokban említette, hogy senki sem akar tankot játszani még topon sem. Tavaly összeraktam 30 armort 12 resistet és tudtam tankolni lvl1-en is. Nem egy nagy was ist das volt, de lehetett. Most fogom előveszem thresht és elmegyek meghalni, instant lepoke-ol az adc 0 itemmel lvl1-en.\n \nMost top, mid és jg assassin, bot dupla ignite és kalap kabát. Ez megy itt. De már a cirkuszban is ott figyel a khazix jg...","replies":[]}]}]},{"poster":"Gresident","date":"2018-03-22T08:45:12.375+0000","title":null,"up_votes":1,"down_votes":0,"body":"Én tényleg nem értem, most megint boostolni kell az assasinokat, a bot lane meg már lassan kuka, szinte minden frissítésben jönnek az adc nerfek, most már a supportoktól is megvonják azt a kevés aranyat?\n\nValaki magyarázza már el, hogy tudom magam megvédeni az assasinok ellen adcvel?  (ezt ne számoljuk){{item:3026}} \n{{champion:107}} {{champion:238}} {{champion:91}} {{champion:121}} {{champion:141}} Már tényleg odajutottunk, hogy ezek a hősök jönnek látnak megöltek, és abszolút tehetetlen vagy velük szemben.\n\nMert régen a {{item:3046}} sűrűn megvédett, csak a halálosság bevezetése óta, legjobb esetben is az ellen véd meg, hogy ne a villám öljön meg...\n{{item:3047}} {{item:3022}}  ezek mind felejtősek, egyik az, hogy inkább hátrányt okoznak, mint sem előnyt. (mert ezektől pont ugyanaz a kimenetel)","replies":[{"poster":"Vemhes Szurikáta","date":"2018-03-22T12:02:46.400+0000","title":null,"up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Gresident,realm=EUNE,application-id=VFnq5EbB,discussion-id=IdWE0Hg1,comment-id=0003,timestamp=2018-03-22T08:45:12.375+0000)\n>\n> Én tényleg nem értem, most megint boostolni kell az assasinokat, a bot lane meg már lassan kuka, szinte minden frissítésben jönnek az adc nerfek, most már a supportoktól is megvonják azt a kevés aranyat?\n(...)\n\nAz EUNE fórum valami bizarr alternatív valóságban él, a játék soha nem volt ennyire botlane domináns kb.\nEgyébként jah, a support gold nerf szar, az assassinokat meg én is rühellem, mivel immobile supportokat játszom általában.","replies":[{"poster":"Storiaron","date":"2018-03-22T21:44:24.662+0000","title":null,"up_votes":3,"down_votes":1,"body":"Bizarr hát. Nagyon nem akarják megérteni az emberek, hogy az adc-knek soha nem is kellene megvédeni magukat 1v1-ben assasinok ellen. Rohadt sok értelme lenne akkor mondjuk zedet játszani, ha még az egyetlen akit minimálisan tudsz sebezni is megver téged 1v1-ben.\n+1,az assasinokat azért buffolták, mert eddig gyengék voltak\n2, a duskbladet nerfelték.\n\nOlyan egyértelműen értelmetlen dolgokon tudnak kiakadni az emberek, hogy az a tragikomédia legmélyebb szintjeit rengeti meg. Néha nem is tudom megkülönböztetni, hogy viccről van-e szó, vagy az illető komolyan gondolja amit mondd.\nMost egy ilyen rövid meta magyarázat után még azzal lenne teljes az életem, ha valaki azt is leírná, hogy lucian mennyire erős, mert már azt is számtalanszor megmagyarázták nekem itt, hogy Lucian ilyen-meg-olyan jó, aztán hónapok óta a legrosszabb adc. \n**Túlzás nélkül, 8.1 óta a 16. legerősebb adc a 16 ból.**","replies":[]}]}]},{"poster":"Complex VN","date":"2018-03-22T18:54:52.393+0000","title":null,"up_votes":2,"down_votes":0,"body":"> Szerintetek ezzel, hogy kitalálták, hogy nem jár arany azért, ha egy szövetséges hős farmol, vagy enemyt gyap, nem fognak sérülni a supportok???\nMi fog most történni? Minden support elkezd farmolni?\n\nA baj az, hogy az emberek nem tudják elolvasni a patch notet. Nem csak ezt vették ki, a banditot is. És cserébe minden supp itemnek növelték a gold bevételét. Nem számoltam utána, de lényeges gold kiesésed nem lesz. Erre azért volt szükség, hogy a toppos gp pl ne {{item:3303}} vagy  {{item:3096}}  itemmel kezdjen, aztán a bandittal farmoljon. \n\nÉn csak azért sajnálom a banditot, mert így kevesebb aktív dolga lesz a supportnak. Bandittal egy kis előnyhöz lehetett szert tenni, az olyanokkal szemben mint pl az OP, aki látszatra nem hallott a banditról.","replies":[]},{"poster":"Colonel Fluff","date":"2018-03-22T06:25:39.916+0000","title":null,"up_votes":2,"down_votes":0,"body":"Ezeket a változtatásokat már 8.5-ben bevezették a Szurdokba, de nem éreztem úgy, hogy le lennék maradva supportként.\nNyolc-kilencezer aranyból gazdálkodok egy ~20 perces meccsen, kb mint az előző szezonban.","replies":[{"poster":"Gamma Ray","date":"2018-03-22T06:32:19.248+0000","title":null,"up_votes":1,"down_votes":1,"body":"> [{quoted}](name=patrikosz,realm=EUNE,application-id=VFnq5EbB,discussion-id=IdWE0Hg1,comment-id=0002,timestamp=2018-03-22T06:25:39.916+0000)\n>\n> Ezeket a változtatásokat már 8.5-ben bevezették a Szurdokba, de nem éreztem úgy, hogy le lennék maradva supportként.\n> Nyolc-kilencezer aranyból gazdálkodok egy ~20 perces meccsen, kb mint az előző szezonban.\n\nMelyik dimenzióban?  Örülsz, ha összekaparsz 6-7 ezret 20 perc alatt.\nEgészítsd ki, hogy összeszedsz minimum 1 kill ami 300 gold és még közel 20 asssistot ami 10 killnek felel meg nagyjából. Ha minden klappol és feedel az enemy botlane, mint a k.élet akkor megvan a 8-9 ezer. Valahogy nem mindegy. :D","replies":[{"poster":"Colonel Fluff","date":"2018-03-22T06:45:16.504+0000","title":null,"up_votes":1,"down_votes":0,"body":"Közben utánaszámoltam és valóban rosszul gondoltam, Rakannal 27 percig tartottak átlagosan a meccseim és 8500 aranyat szereztem átlagosan ez alatt.\nViszont a látókövet már a küldetés teljesítéséért kapjuk.","replies":[{"poster":"Gamma Ray","date":"2018-03-22T06:56:05.334+0000","title":null,"up_votes":2,"down_votes":1,"body":"Ami önmagában semmit nem ér a régi rubinhoz képest. Ad három wardot és pukk. Régen a sima látókő legalább adott némi hp-t. Az nem elhanyagolandó a pálcika vackoknál. Nem értettem miért tudnak olyan könnyen kinyírni a pálcika championokkal. Bűvészkedni kell luluval, mert megesznek keresztbe. Most 40. percnél gazdálkodok maximum 2k hp-val ami yasuonál 3 aa, LOL azért ezt a riot sem gondolja komolyan. Hányszor lestem mikor jön a yasuoka és 3 aa-ból megdöglök. Sima pusztulat aa-ból.\n\nMost sem veszi meg a nagy többség a wardot, most sem használja a trinketet. Ergo az egész felesleges volt. Személy szerint én szopok emiatt. Más nevében nem nyilatkozhatom így magam nevében ez az újítás nem más, mint jó kis szopóroller.\nErről már inkább az adc-k véleményét kérdezném, hogy szerintük az új rendszerrel, hányan wardolnak többen. Semmivel sem többen, ezt elkönyvelhetjük.","replies":[]}]}]}]},{"poster":"StąrLady","date":"2018-03-22T06:19:07.084+0000","title":null,"up_votes":2,"down_votes":0,"body":"Mikor kijöttek az új rúnák már akkor szó volt róla hogy kiveszik ezeket a  funkciókat, de  mivel nem tették meg megnyugodtam egy kicsit. :D\nLátom sajnos nem felejtették el. :/","replies":[]},{"poster":"Gamma Ray","date":"2018-03-22T06:09:47.299+0000","title":null,"up_votes":2,"down_votes":1,"body":"Biztos fájt nekik, hogy kapunk 1goldot miniononként. Én is ledöbbentem rajta. \nSőt nem csak ez döbbentett meg, hanem hogy az ihlet ágon a 3 percenként egy sütit és a hitelt egy sorba rakták. Cseppet sem gusztustalan.\nEz a riot games logika, nehogy már jól érezzed magad!\n\nCsicska szerephez, csicska gold jár.\n\n50 perces, vagy rongyra feedelt játékokon vagyok nagy ritkán full buildes. Az átlag 40 perces csatákon van ennyi itemem {{item:3098}} {{item:3107}} {{item:3905}} {{item:3504}} , na meg egy szutykos csizma keresek valamit{{item:3117}} .\nÍgy összesen három itemem van egy átlagos meccsen a játékok 80%-ban. Így is lategameben bőszen farmolok, 20-30 perc körül csapatom lefelé a minionokat amikor tudom.\n\nEzzel szemben régen mire futotta?  {{item:3098}}{{item:3107}} {{item:3504}}{{item:3190}}  + a rubin látókő 4 ward +20% cd reduction tárgyakra, {{item:3117}}. Ezek mellett a játékok döntő többségében még volt  egy bűbájtolvaj továbbfejlesztésem is amivel csapattam bőszen az ellenfél után, ami most az ikerárnyak. Alsóhangon is 4 item volt régen egy átlag build, szemben a mostani átlag 3 itemes csatákkal.\n\n_**Mindent úgy, hogy összeszarták az összes wardolós itemet, mondván a 15 bites debilek is tudjanak wardolni. Ergo a 16 bites debilek most sem hajlandóak sem megvenni az alap support itemet, pláne nem továbbfejleszteni. **_\n\n27 perces csata 2 item https://matchhistory.eune.leagueoflegends.com/hu/#match-details/EUN1/1934098831/221739151?tab=overview\n20 perc 1 item https://matchhistory.eune.leagueoflegends.com/hu/#match-details/EUN1/1933962093/221739151?tab=overview\n41 perces adok kapok 4v5-ben még mindig nincs meg a full build https://matchhistory.eune.leagueoflegends.com/hu/#match-details/EUN1/1933586798/221739151?tab=overview (Így utólag is üdvözlöm a trynda topost a felmenőivel együtt. Hogy nem tud az ilyen elmenni napszámba kukoricát kapálni és ott rontani a levegőt a dögvész logikájával. Ó nincs szezonja azért eszi itt az ilyeneket a pusztulat.)\n\nAhhoz képest, hogy minden azért van, hogy nekem jó legyen. Állítólag még olcsóbban is jövök ki, meg bla bla bla, na meg bla bla bla.\nValahogy nagyon nem akar összejönni egy átlag meccsen az a build, ami régen összejött úgy, hogy rubin látókövet is vettem.\n","replies":[]}]}