{"poster":"Nàrumi","date":"2015-05-05T11:28:49.776+0000","title":"Sempre gli stessi errori","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Si questo &egrave; un post sfogo, dopo una partita persa malamente.\r\n\r\nIn breve, &egrave; stata una ranked lunghissima, quelle che se pensi alla laning phase ti sembra una partita del giorno prima.\r\nEro Lulu support e il mio adc era Graves.\r\nLa partita &egrave; cominciata relativamente bene, il mio graves non era senza mani e anche gli altri compagni se la cavicchiavano.\r\nArriviamo a fargli due inibitori e noi avevamo ancora 6 torri escluse quelle davanti al nexus.\r\nAbbiamo perso.\r\nIo ho sbagliato tanto durante la partita, soprattutto nel mid game dove il mio graves girava per la mappa farmando e io non gli stavo attaccata al culo abbastanza da poterlo salvare.\r\nHo cominciato a pedinarlo, a fare stalking, e a buttargli addosso tutto quello che avevo, abilit&agrave;, crucible, qualsiasi cosa.\r\nLa cosa che mi fa indemoniare per&ograve; &egrave; il fatto che ad un certo punto il nostro graves si sente godlike e INGAGGIA il team nemico compost da Hecarim, Bard, Sivir, Malzahar e Vladimir.\r\nOvviamente viene shottato.Anzi, cancellato dal pianeta terra, in un nanosecondo non esisteva pi&ugrave;.\r\n\r\nI quattro teamfight successivi vengono persi sempre per la stessa ragione, perch&egrave; Graves ingaggia.\r\nA questo punto mi chiedo, &egrave; colpa mia o sua? O del team? O delle divinit&agrave;? Illuminati?\r\nHo paura di non essere stata capace io a salvarlo, e quindi che sia mia la colpa. \r\n-per fare capire il tipo di giocatore: adc con delle meccaniche (credo) abbastanza buone ma talmente arrogante da fare dash VERSO il team nemico e NON per riposizionarsi, lamentandosi del fatto che non viene aiutato/salvato.-","replies":[{"poster":"Dantazzo","date":"2015-05-05T11:33:22.923+0000","up_votes":8,"down_votes":0,"body":"Io questa la chiamo \"Sindrome da Riven\" perchè in genere sono le Riven feeddate a fare ste cagate.","replies":[{"poster":"Nibbio Bianco","date":"2015-05-05T17:16:39.614+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dantazzo,realm=EUW,application-id=cAOZwaUi,discussion-id=8g1HrJAa,comment-id=0000,timestamp=2015-05-05T11:33:22.923+0000)\n>\n> Io questa la chiamo \"Sindrome da Riven\" perchè in genere sono le Riven feeddate a fare ste cagate.\n\nFaccio la stessa cosa anche io, ma con pOPpy, l'unica differenza è che in quei casi sono io a fare godlike e a shottare il team avversario.","replies":[]},{"poster":"Nàrumi","date":"2015-05-05T11:47:11.001+0000","up_votes":1,"down_votes":0,"body":"Infatti la colpa sicuramente l'abbiamo avuta tutti per non averla chiusa subito, è una di quelle cose che cerco di non fare mai, il nervoso però graves me l'ha fatto venire facendo dash contro di loro.\nAnche tirandogli scudo, ulti e crucible moriva in ogni caso, era fatto di carta come è ovvio che sia.\nAnzi, il nervoso mi è venuto perchè è successa 4 volte la stessa cosa, e non c'era verso di tirare via graves dalla frontline, nonostante avessimo un mundo gigantesco e un wukong.\nEh vabbè.\n\n{{champion:32}}","replies":[]}]},{"poster":"Il Freddo","date":"2015-05-05T11:39:39.216+0000","up_votes":4,"down_votes":0,"body":"colpa di tutti, dovevate chiudere la partita subito al posto di fare gli splendidi. Diciamo che ho esperienze simili, diciamo che io ero quello feddato che faceva il cazzone","replies":[]},{"poster":"Infernity Vei","date":"2015-05-07T13:18:04.778+0000","up_votes":2,"down_votes":0,"body":"Il tuo problema e' nella mentalita che hai. Nella soloq tu migliori come giocatore non come una squadra , quindi evidenziare gli errori degli altri puo' farti perdere la totale concentrazione nella partita. Le cavolate che fanno gli altri hanno 0 % di importanza perche ogni partita becchi giocatori diversi , poi il solo pensiero di aver perso una partita ti diminuisce la moralita' allora non pensarci , vai avanti dando sempre il tuo meglio e rimediando ai propri errori.   Tu sei un solo giocatore e i tuoi strumenti sono : il tuo champion e' niente altro quindi dipende da TE (Soprattutto) la sorte del tuo team. Ti consiglio di non pensare neanche in quale lega ti trovi e gli LP che hai ma concentrati SOLO a migliorarti e vedrai che salirai senza accorgerti. Certo ci saranno gli afk , i flamer , troller ecc. , queste robe le devi tutte ignorare totalmente e continuare a migliorare e un giorno sarai forte per carriare anche un game 4 v 5.","replies":[]},{"poster":"Best Chair Euw","date":"2015-05-12T09:00:15.457+0000","up_votes":1,"down_votes":0,"body":"No escape from this misery, every tier it repeats.\nIl \"non saper chiudere le partite\" è più frequente di quanto crediate. Due inibitori significa che avevate non un buon vantaggio...ENORME xD, e proprio per questa convinzione c'è sempre quello che si sente il più grosso di tutti e vuole fare penta 1v5. Da un lato non seguire l'adc è un errore ma pensaci bene, se l'adc sbaglia completamente posizione perché al 45 deve \"farmare\" (faccio un esempio) non è colpa tua se muore, anzi al 99% seguire l'adc in queste situazioni porta ad una doppia per il team avversario, in quanto loro stanno perdendo e non hanno nulla da perdere nel saltare addosso ad uno 1v5 mentre gli altri farmano la giungla  o Giorgio.","replies":[]},{"poster":"Ulamog95","date":"2015-05-05T17:04:03.209+0000","up_votes":1,"down_votes":0,"body":"non è mica tutta colpa tua se avete perso, eri lulu, mica potevi finire da solo il game scusa eh.\nla gente squishy e senza cc che si butta e dice \"no help\" è scema, puoi farlo con lissandra SOLO SE sai che il tuo team ingaggia subito e non vieni shottato ma è rischioso comunque perchè io la gioco tank e quando ingaggio ci manca poco che muoia io.\ncerto che se sei un champ da splitpush e non fai niente nonostante il vantaggio sei da reportare, ad esempio io se vinco l'early con udyr/skarner/hecarim passo il late a tritare torri ma non mi sembra il tuo caso, l'unica cosa che hai sbagliato è stato sprecare le mosse per salvarlo :D","replies":[]},{"poster":"Lord Valotz","date":"2015-05-05T12:35:25.302+0000","up_votes":1,"down_votes":0,"body":"L'unica cosa è cercare di finirle il più in fretta possibile quando si ha vantaggio. Se poi il tuo Graves si lancia nel mucchio del team nemico dubito che si possa fare qualcosa per salvarlo, è l'errore di molti che quando sono feedati si lanciano in mischia come non ci fosse un domani nonostante usino personaggi che non se lo possono permettere. Se un Adc si posiziona male tu puoi fare di tutto per cercare di difenderlo, qualche volta lo salvi anche, ma è facile che il team nemico ne approfitti per disintegrarlo.","replies":[]},{"poster":"Frattaglia","date":"2015-05-05T11:59:33.194+0000","up_votes":1,"down_votes":0,"body":"Si ho presente, quando tutta la squadra fa di tutto per salvare la tua Vayne feedata e lei continua imperterrita a rotolare in faccia all'Amumu avversario ^_^;\n\n\np.s. ricordati di chiudere sempre le partite il prima possibile!","replies":[{"poster":"Nàrumi","date":"2015-05-05T12:05:04.300+0000","up_votes":1,"down_votes":0,"body":"Già già, è veramente fondamentale chiuderla subito.\nTra l'altro non è stato facile per niente buttargli giù torri e inibitori, è stata una partita molto tirata e per me difficile o comunque estenuante!\nNon meritavamo sicuramente la vittoria, tutti abbiamo sbagliato ^^","replies":[]}]}]}