{"poster":"Jan ahrem","date":"2016-08-25T18:51:22.492+0000","title":"No iban a ser los chromas con PI?","subforum":"Charlas Generales","up_votes":2,"down_votes":6,"body":"Capaz es media &quot;apurada&quot; mi queja pero queria comprar unas chromas de MF y Teemo y solo aparecen con rp","replies":[{"poster":"Lucio22","date":"2016-08-25T19:06:54.723+0000","up_votes":1,"down_votes":0,"body":"capaz deberias leer/releer los post de los chroma, ya que dice claramente que lo de la compra con ip es UNICAMENTE para los chroma que salieron antes de agosto (que, de hecho, lo dicen mas veces que la franja temporal en la que esta habilitado). si queres los nuevos, vna a estar en la siguiente oferta (se supone que son 2 por año, pero dijeron, en el coso de chroma nuevo, que se pone con ip despues de 5 meses de que esten en venta)","replies":[{"poster":"Pollos Hnos","date":"2016-08-25T20:39:25.387+0000","up_votes":1,"down_votes":0,"body":"Tenes idea hasta que fecha van a estar disponibles por compra de PI, me lei toda la info que sale en las noticias pero no dice durante que periodo va a estar, hace un tiempo lei que iba a ser desde el 25 osea hoy, pero no se hasta cuando, ya que no tengo PI y necesito juntar :P","replies":[{"poster":"Lucio22","date":"2016-08-25T21:44:45.786+0000","up_votes":1,"down_votes":0,"body":"emmm no se la fecha exacta, pero eran algo asi como 2 semanas (seria hasta el 8/9). igualmente, a eso me referia con que es mas jodido sabes hasta cuando estan.\n...\nme tuve que meter en surrender at 20 como para saber, te confirmo que es hasta el 8/9. por si queres saber algo mas: http://www.surrenderat20.net/2016/08/chroma-for-ip-sale-august-25-september.html \n(ta en ingles, pero algo se puede sacar)","replies":[{"poster":"Pollos Hnos","date":"2016-08-28T13:13:45.802+0000","up_votes":1,"down_votes":0,"body":"Gracias jaja voy a tener tiempo para comprar zac majin buu entonces.  Un saludo!","replies":[]}]}]},{"poster":"Jan ahrem","date":"2016-08-25T20:35:28.638+0000","up_votes":1,"down_votes":0,"body":"Ah oka, muchas gracias. No pude leer apenas se dio a conocer eso y un conocido me dijo que iban a ser enseguida con pi, no lei esa parte del parche y por eso crei que iba a ser lo mismo con los nuevos","replies":[]}]},{"poster":"Condor","date":"2016-08-25T18:55:12.902+0000","up_votes":1,"down_votes":0,"body":"Los pusieron hace rato ya.\ny los chromas que sacaron este parche no están con descuento.","replies":[{"poster":"Jan ahrem","date":"2016-08-25T20:34:21.580+0000","up_votes":1,"down_votes":0,"body":"si, me referia a los nuevos. no pude leer el post y me deje guiar por lo que me dijeron xD","replies":[]}]}]}