{"poster":"GoForkYourself","date":"2016-06-12T10:05:28.026+0000","title":"Is account sharing still not allowed?","subforum":"Player Behaviour","embed":{"description":"Captured with Lightshot","url":"http://prntscr.com/bfdxhk","image":"http://image.prntscr.com/image/28dfce7303024d4db585b9825c267005.png"},"up_votes":1,"down_votes":0,"body":"It&#039;s fairly common that someone is &quot;just playing on a friends account&quot; and I&#039;m wondering if that&#039;s even worth reporting. only doing it this time because he was a jackass","replies":[{"poster":"Tele","date":"2016-06-12T10:52:44.126+0000","up_votes":4,"down_votes":0,"body":"Hey Summoner!\n\nHere's the rundown on account sharing:\n\n+ **Account sharing is only allowed between family members.** \n\n Chapter III, Section B of the [Terms of Use](http://oce.leagueoflegends.com/en/legal/termsofuse) specifically states it allows account sharing between parents/legal guardians and _\"minors\"_. Otherwise, account sharing is against the rules.\n \n That doesn't mean you can share your log-in details with your family, that is [not allowed](https://support.riotgames.com/hc/en-us/articles/204214670-Shared-accounts). But if you log-in for them and allow them to play on your account, that is perfectly fine.\n\n> _** As for your question:**_\n>If that was a ranked game that they played, it's considered elo boosting and is 100% bannable. In fact I'd encourage you to send in a [support ticket](https://support.riotgames.com/hc/en-us/requests/new) to report it.\n> \n> If it was just bots or normals, you're welcome to report it, but to be honest **Riot** hasn't been known to be super strict on casual account sharing. To be clear though, casual account sharing is still against the Terms of Use (unless it's with parents).\n\nAlso, this is a borderline case of naming and shaming, but please try to cover up the names next time :)","replies":[]},{"poster":"Zorphiax","date":"2016-06-12T10:27:02.863+0000","up_votes":1,"down_votes":0,"body":"Someone is probably going to say in this Post about **Naming and Shaming** I highly recommend you blur out the names of the Summoners speaking and please remove the Summoner's name from your message.","replies":[{"poster":"Omni Presents","date":"2016-06-12T10:39:46.700+0000","up_votes":2,"down_votes":5,"body":"Screw the naming and shaming, players need to learn the rules and stick to them.","replies":[]}]}]}