{"poster":"Monzzee","date":"2017-08-24T00:27:09.556+0000","title":"Account rollback?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So I logged in to do some ranked I queued up and went through the champ select process. But before going to the loading screen it stops. The client goes blank and it gives me the option to reconnect. I was confused? I click the reconnect button but it did not work. I was upset I tried spamming the button. My status said in-game. I quickly restarted my client and it still did not work the same thing was displayed. I assume the others remade cause the screen went away and i could queue up again. I was a bit annoyed, but things happen, so now I have a loss for my promo matches. I say to myself \"no big deal, these things happens I can win my next game\". I queue once again and get to the same point and the same issue happens. Immediately! I restart my computer and log in quickly to see if the issue is resolved, but to no avail. So there's my promos I got to losses and sent back to 68 lp. I'm very upset I got timers now too. Is there a way to rollback 2 games? Please please please help! :(","replies":[{"poster":"Broporo","date":"2017-08-24T01:48:09.221+0000","up_votes":1,"down_votes":0,"body":"It does sound like that game was most likely remade if you had a reconnection possible at first and then it stopped letting you try to reconnect. In that case, there's not much that can be done since you weren't in the match and your team decided to remake. At this point, it's best to focus on troubleshooting that network to make sure this isn't going to keep happening. Hit up this guide on [**network settings**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) and test those changes in a custom or practice game first.","replies":[]},{"poster":"Bąrd","date":"2017-08-24T22:42:19.544+0000","up_votes":0,"down_votes":0,"body":"If you recently updated to windows 10 some version (Newest) its your video drivers. Re install them from a few patches ago","replies":[]}]}