{"poster":"EuropeanMid","date":"2019-07-24T12:12:16.386+0000","title":"Bannsystem-Existiert so etwas?","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":8,"body":"Gibt es zwischen Iron und Diamond ein Bannsystem für Inter/Flamer/AFKs?\n\nIn meinen 3 Jahren LoL habe ich bestimmt 200 Spieler fürs Trollen/Flamen/AFKen reportet. (Eigentlich deutlich mehr, aber diese 200 müssten eig. schon lange gebannt sein). Stand heute ist davon **einer** gebannt, weil das Autobansystem nur Beleidungen erkennen kann und Menschen sich um diese Leute absolut nicht kümmern. Es ist kein Wunder, dass die Community bei solchen Menschen toxisch wird.\n\nIch habe das Gefühl, dass das Riot-Team vor in EUW stark unterbesetzt ist.","replies":[{"poster":"Amycos Cyrus","date":"2019-07-24T16:54:34.455+0000","up_votes":4,"down_votes":0,"body":"> Bannsystem-Existiert so etwas?\n\nJA","replies":[]},{"poster":"Necromant","date":"2019-07-24T12:15:21.999+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=EuropeanMid,realm=EUW,application-id=KYnfKGf0,discussion-id=RyHVGuEN,comment-id=,timestamp=2019-07-24T12:12:16.386+0000)\n>\n> Stand heute ist davon **einer** gebannt\n\nWie kommst du darauf das er gebannt wurde bzw. die anderen nicht?\nDas System gibt dir in den seltensten Fällen ein Report-Feedback und nicht immer zieht eine Bestrafung gleich einen Bann mit sich.","replies":[{"poster":"EuropeanMid","date":"2019-07-24T13:06:39.799+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Necromant","date":"2019-07-24T13:14:52.330+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=EuropeanMid,realm=EUW,application-id=KYnfKGf0,discussion-id=RyHVGuEN,comment-id=00000000,timestamp=2019-07-24T13:06:39.799+0000)\n>\n> Gibt es auch einen Grund dafür? Ich verfolge einige dieser Leute auf op.gg. Wenn sie nach 3 Tagen nicht gebannt sind (), so wie dieser Zed, der absolut kein Interesse am gewinnen hatte, kann ich mir sicher sein, dass sie dafür keine Bestrafung bekommen haben.\n\nZum Thema dein Zed: \nLetztes Game: 1 Month ago. 3x darfst du raten was da passiert sein könnte.\nBzw. ist dein Link oben schon sehr ... sehr alt.\n\nWarum du kein Feedback-Report bekommst hängt glaube mit irgendeiner Datenschutzrichtlinie zusammen.","replies":[]}]}]},{"poster":"611FVNKBlv","date":"2019-07-24T16:57:47.434+0000","up_votes":2,"down_votes":2,"body":"Funfact: Im EUW-Forum wirste downvoted. im NA-Forum hättest jetzt 3-Stellig upvote {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Wernicke","date":"2019-07-26T00:53:03.753+0000","up_votes":2,"down_votes":0,"body":"Da stellt sich mir die ernsthafte Frage, wieso sollte ich hier einen Daumen nach oben verteilen?\nDer thread besteht aus willkürlich herangezogenen Zahlen und gefährlichem Halbwissen. Gewürzt mit einer Prise... Hm, ja ne, mit gar nix. Denn mehr hat der thread leider nicht zu bieten... Mein Fehler.","replies":[]}]},{"poster":"Megamaexx","date":"2019-07-24T14:08:54.706+0000","up_votes":2,"down_votes":0,"body":"https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/0LFYEpwt-gebannt-far-ein-schlechtes-spiel\n\nHättest im Forum bei den neuesten einfach nur ein kleines Stückchen nach unten schauen müssen.","replies":[{"poster":"Izaya Kumiho","date":"2019-07-24T14:22:43.885+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=KYnfKGf0,discussion-id=RyHVGuEN,comment-id=0003,timestamp=2019-07-24T14:08:54.706+0000)\n>\n> https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/0LFYEpwt-gebannt-far-ein-schlechtes-spiel\n> \n> Hättest im Forum bei den neuesten einfach nur ein kleines Stückchen nach unten schauen müssen.\n\nlustig, wo du ein kleines stückchen nach unten hättest schauen können um zu sehen, dass er den thread bereits kommentiert hat x3 lol.\n{{sticker:sg-miss-fortune}}","replies":[{"poster":"Megamaexx","date":"2019-07-24T19:44:47.735+0000","up_votes":2,"down_votes":0,"body":"Nee, dazu hätte ich den Thread anklicken müssen ;P","replies":[]}]}]},{"poster":"Izaya Kumiho","date":"2019-07-24T12:24:55.068+0000","up_votes":2,"down_votes":1,"body":"'ca 1-2 Stunden ist es her, da schrieb jemand, wie er für ein 0/17 sivir game gebannt worden sei. Beantwortet das deine Frage?\nAußerdem findest du weitere Fälle im Forum, wenn du danach suchst.\nEin wichtiger Punkt, weshalb du sonst kaum etwas davon mitbekommst, nennt sich die \"Privatsphäre\".\n\nJeder hat das Recht auf seine Privatsphäre. Es geht dich nichts an, was Spieler xy als Strafe bekommen hat und es geht niemanden etwas an, was du erhalten hast.\n\nUnd das Feedback ist bewusst kontextlos. Das Pop-up kann auch von einem Report stammen der Monate her ist.","replies":[{"poster":"EuropeanMid","date":"2019-07-24T13:01:33.391+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"Izaya Kumiho","date":"2019-07-24T13:18:17.704+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=EuropeanMid,realm=EUW,application-id=KYnfKGf0,discussion-id=RyHVGuEN,comment-id=00010000,timestamp=2019-07-24T13:01:33.391+0000)\n>\n> Ich habe den Beitrag der 0/17/0 Sivir kommentiert, da ich den Bann in seinem Fall ungerechtfertigt finde. Ich rede hier von Leuten die das regelmäßig machen. \n> \n> \n> Als Beispiell hätte ich:  [...]\n\nnimm die links bitte wieder raus. namecalling/witch hunting sind gegen die regeln.","replies":[]}]}]},{"poster":"Lunnaris01","date":"2019-07-26T20:27:17.777+0000","up_votes":1,"down_votes":0,"body":"Trolle und inter werden tatsächlich weniger gebannt als flamer, einfach weil es schwerer ist einen troll zu identifizieren. Kann aber auch gut sein, dass du (nur so als beispiel) botlane spielst, und während du gut spielst, feedet dein toplaner, was du aber nicht verstehst ist, dass der jungler top gecampt hat, und ihr deswegen auch so eine easy botlane hattet, oder der Toplaner einfach einen schlechten Tag hatte, seine Maus spinnt, er laggs hatte oder was auch immer. Sowas kann mal passieren, deswegen wird niemand direkt gebannt. \n\nViele matchups snowballen auch einfach hart, sodass aus einem 0/3 (vllt nur einmal echt unglücklich gestorben und 2 ganks, kann jedem passieren) ein 0/6 wird. Wenn das ganze Team den spieler natürlich auch noch flamed und blamed und als inter bezeichnet, anstatt ihm zu sagen, dass er einfach save spielen soll oder ihm ein laneswap angeboten wird usw, dann wird daraus auch mal ein 1/10 bis zum Spielende.\n\nIst der Spieler deswegen ein Inter und sollte gebannt werden? Sicherlich nicht, denn solche spiele sind nunmal ausnahmefälle, außerdem hat der Spieler ja nicht mit absicht reingefeedet, sondern hat einfach z.B. in Sachen Mini-Map Awareness noch einige Defizite, oder kennt einfach das Matchup nicht gut. Ich spiele auch einen sehr agressiven spilstil, und sterbe deswegen sehr oft, aber bekomme eben auch oft viele plates oder snowballe selbst, wenn der gegnerische Jungler nicht so oft kommt, bzw. mein jungler vielleicht für nen countergank da ist usw. Auch als jungler kann ein Invade leicht im einen Spiel in die Hose gehen, während man sich im anderen spiel 2 frische Buffs+First Blood sichert, spiele sind eben immer sehr unterschiedlich.\n\nKann also sehr gut sein, dass du einfach subjektiv viele Leute als Inter und trolls betrachtest, die gar keine sind.\nUnd jeder kann mal Internetprobleme haben, auch solche leute werden nicht direkt gebannt, dafür gibt es eine low-prio queue.","replies":[]},{"poster":"Alustus","date":"2019-07-24T12:36:49.691+0000","up_votes":1,"down_votes":0,"body":"Ja wenn auch AFKs mMn zu wenig bis gar nicht gebannt werden da Riot da sehr Kulant ist.\nTrolle/Inter werden auch gebannt, wobei diese natülich viel schwerer ausfindig zu machen sind als Flamer, bzw. das ganze Nachzuweisen.\nWenn man nicht gerade High Elo(Da lassen sich massive \"Fehler\" nicht so leich rechtfertigen) ist oder permanent unter den Generischen tower läuft usw. dann tut sich Riot schwer einen Intention dahinter nachzuweisen.\nAber hier werden durchaus Spieler gebannt.\n\nBei Flamern geht das ganze am besten und die werden auch bestraft nur bekommt man nur selten bis gar nicht eine nachricht vom Feedbacksystem.\nIch persönlich verfolge extrem Toxische Spieler nach dem Report immer auf Op.gg und es sind nicht wenige die dannach eine 2 Wochen Pause machen oder gar nicht mehr online gehen.\n(Wobei ich hier wirklich nur die toxischsten \"verfolge\" bzw. die mich richtig triggern, was nicht einfach ist.)","replies":[]},{"poster":"kys rito ret4rds","date":"2019-07-25T08:28:40.381+0000","up_votes":1,"down_votes":3,"body":"Dieses Mistspiel fördert aktiv negatives Verhalten. Es wird Zeit, dem Ganzen endlich den Rücken zu kehren: https://www.quitlol.com","replies":[{"poster":"eingew","date":"2019-07-26T05:58:58.794+0000","up_votes":2,"down_votes":0,"body":"In Verbindung mit diesem Namen wirkt der Vorwurf ein bisschen ironisch. Aber nur minimal.","replies":[]}]}]}