{"poster":"Jabs","date":"2015-06-16T01:26:29.525+0000","title":"skin..","subforum":"Discussioni generali","up_votes":2,"down_votes":6,"body":"{{champion:92}} \r\n.\r\n..\r\n....\r\nSar&agrave; mai possibile poter ottenere Riven della Finale??\r\no in caso contrario avere una nuova skin? come ad esempio &quot;project riven&quot; ??\r\n-----&gt; http://forums.euw.leagueoflegends.com/board/attachment.php?attachmentid=223063 ??\r\nsarebbe fantastico! \r\n-primo perch&eacute; farebbe contenti milioni di player \r\n-secondo sarebbe anche un buon profitto per la Riot\r\npersonalmente pagherei anche 1350/1820 punti {{summoner:4}}","replies":[{"poster":"A Yordle ln Heat","date":"2015-06-16T06:18:08.379+0000","up_votes":2,"down_votes":1,"body":"Riven ha un bordello di skin e ne volete ancora?\nOk. {{champion:33}}","replies":[]},{"poster":"kirchhoff","date":"2015-06-22T00:00:17.132+0000","up_votes":1,"down_votes":0,"body":"http://boards.na.leagueoflegends.com/en/c/miscellaneous/H004gAPw-ecommerce-qa?comment=00350002\n\n> Yes I think Championship Riven will come back someday. Most limited edition skins took four years to come back after release, and it’s been two years for Riven so far.","replies":[]},{"poster":"IrrationalNumber","date":"2015-06-16T08:46:15.910+0000","up_votes":1,"down_votes":0,"body":"Sul server cinese si puo comprare.\n\nLa rito ha detto che non la mettera' in vendita in occidente.","replies":[{"poster":"Whommy","date":"2015-06-16T10:37:11.204+0000","up_votes":1,"down_votes":1,"body":"qui sbagli perchè è esattamente il contrario\n\nqualche mese fa su surr@20 un paio di rioter discutevano sulle skin championship, dicendo chiaramente che essendo stata disponibile per pochissimo e mai rimessa, la rimetteranno a breve.\n\nsi chiama marketing, sbavi su qualcosa (e sono in tanti a sbavarci), aumenti l'hype per la cosa per fare soldoni, ci sarà gente che comprerà riven solo per comprare quella skin.","replies":[{"poster":"UnknownEV","date":"2015-06-16T13:18:10.626+0000","up_votes":1,"down_votes":0,"body":"insomma... non dovrebbero farlo... questo vale per tutte le skin limited...\nE hanno detto che NON hanno fatto quelle skin per guadagnare...ma per festeggiare qualcosa tipo (nuovo anno, campionati, ecc...)","replies":[{"poster":"Whommy","date":"2015-06-16T13:42:49.737+0000","up_votes":1,"down_votes":0,"body":"Considera la skin, un prodotto limitato a costo ormai 0, poiché già ammortizzato da anni, e altamente richiesto (odio a parte, riven rimane popolare come champ)\n\nRimetterla nel negozio frutterà enormi guadagni indipendentemente dalle buone intenzioni delle prime season.\n\nSe non erro la discussione dei rioter si basava su \"è l'unica skin championship mai tornata nello shop\"\n\nDal punto di vista economico chi è il cretino che si nega centinaia di migliaia di euro che costano solo un singolo click del mouse su un terminale?","replies":[{"poster":"UnknownEV","date":"2015-06-16T13:47:44.363+0000","up_votes":1,"down_votes":0,"body":"Be...secondo me se vendono una cosa Limitata come la skin di riven di 2-3 anni fa (ora non ricordo) e poi la rimettono in vendita, sarebbe una presa per il culo per chi l'ha presa prima, non trovi? ^^ {{champion:92}} \nPoi ovvio che tutti la vogliono, compreso me eh!","replies":[{"poster":"Whommy","date":"2015-06-16T14:09:42.090+0000","up_votes":1,"down_votes":0,"body":"Ovviamente la prenderei anche io,\n\nConsiderando l'aspetto economico, è una skin uscita a fine s2  e solo dopo c'è stato il boom del gioco.\n\nMantenerla chiusa in un cassetto non ha senso, incoraggia i pochi possessori al \"mercato nero\".\n\nInfatti non hanno ripetuto l'errore con Thresh e Shyvana.\n\nMa googlando:\n\nhttps://www.change.org/p/riot-games-re-release-championship-riven\n\nla rimettono a ottobre quando finisce questa season XD","replies":[{"poster":"Jabs","date":"2015-06-17T19:47:55.137+0000","up_votes":1,"down_votes":0,"body":"grazie infinite per le info!! T.T aspetterò il re-release della championship o.o","replies":[]},{"poster":"UnknownEV","date":"2015-06-16T15:00:04.107+0000","up_votes":1,"down_votes":0,"body":"oh °L°\nPaura! Ricarico U.U prima rek-sai pool party :P","replies":[]}]}]}]}]}]}]}]}