{"poster":"BrosifTooHeavy","date":"2017-05-02T07:42:39.413+0000","title":"Worth content for 14 day ban?","subforum":"Player Behavior","up_votes":2,"down_votes":21,"body":"Here&#039;s the chat logs, let me know if you guys think this is toxic behavior. Btw I carried all 3 games. \r\nGame 1\r\nBrosifTooHeavy: had to order tacos\r\nBrosifTooHeavy: yo dont play him if u dont know how\r\nBrosifTooHeavy: 11 games and 36% win rate should be a tell all\r\nBrosifTooHeavy: orly your consitant stats dont have anything to do with you?\r\nBrosifTooHeavy: pls tell me more\r\nBrosifTooHeavy: i was able to tell you dont know how to play him before checking stats\r\nBrosifTooHeavy: u sure know when to fight\r\nBrosifTooHeavy: ur support u should know what lanes are mia\r\nBrosifTooHeavy: yea\r\nBrosifTooHeavy: ekko wtf\r\nBrosifTooHeavy: ur not even ahead in cs\r\nBrosifTooHeavy: why r u\r\nBrosifTooHeavy: tunnel vision on mid lane\r\nBrosifTooHeavy: Your ults are very confusing lulu\r\nBrosifTooHeavy: why does this support ward\r\nBrosifTooHeavy: wow\r\nBrosifTooHeavy: you so deserve this loss\r\nBrosifTooHeavy: @ekko\r\nBrosifTooHeavy: for tunnelling mid\r\nBrosifTooHeavy: and letting lux roam bot 3 times\r\nBrosifTooHeavy: this ekko skills are making me cry\r\nBrosifTooHeavy: its helps me\r\nBrosifTooHeavy: idgaf about my online persona brah\r\nBrosifTooHeavy: 3-9\r\nBrosifTooHeavy: wow\r\nBrosifTooHeavy: Lies\r\nBrosifTooHeavy: Just report mid and top \r\nBrosifTooHeavy: Feed\r\nGame 2\r\nBrosifTooHeavy: comon hec, 5 kills before 5 min\r\nBrosifTooHeavy: okay\r\nBrosifTooHeavy: not fighting with u\r\nBrosifTooHeavy: their janna is so much better than you\r\nBrosifTooHeavy: idk what to tell you\r\nBrosifTooHeavy: okay, bad players calling me noob doesn&#039;t hurt my feelings\r\nBrosifTooHeavy: just reassures me how bad you are\r\nBrosifTooHeavy: why are you pushing naut\r\nBrosifTooHeavy: reported\r\nBrosifTooHeavy: this naut is getting x9 reports for sure\r\nBrosifTooHeavy: you&#039;re taking my wave cs when its not under turret\r\nBrosifTooHeavy: Cait you should probably learn how to cs before queing for ad in ranked\r\nBrosifTooHeavy: Makes sense\r\nBrosifTooHeavy: GG ez\r\nGame 3\r\nBrosifTooHeavy: Worth huh?\r\nBrosifTooHeavy: When bronze cheese fails lmao\r\nBrosifTooHeavy: When the bronze jinx has double your cs lmao\r\nBrosifTooHeavy: Was a nice flash, not use to seeing that in this elo\r\nBrosifTooHeavy: ww ur bad tho k kid\r\nBrosifTooHeavy: reported\r\nBrosifTooHeavy: both of u\r\nBrosifTooHeavy: :)\r\nBrosifTooHeavy: Cait shouldn&#039;t have chimed in with ww\r\nBrosifTooHeavy: wow ww\r\nBrosifTooHeavy: feeding\r\nBrosifTooHeavy: ww u just run in 1v3\r\nBrosifTooHeavy: idiot\r\nBrosifTooHeavy: this thresh misses everything\r\nBrosifTooHeavy: yo ww stop feeding bro\r\nBrosifTooHeavy: can u do that\r\nBrosifTooHeavy: if ww stops throwing\r\nBrosifTooHeavy: this ww\r\nBrosifTooHeavy: completely intentionally thowing now\r\nBrosifTooHeavy: Report ww x9 \r\nBrosifTooHeavy: Intentionally throwing\r\nBrosifTooHeavy: Cait u were so bad in lane\r\nBrosifTooHeavy: U got stomped","replies":[{"poster":"Riot Tantram","date":"2017-05-02T17:41:16.094+0000","up_votes":23,"down_votes":0,"body":"You had 6 chat restrictions before this.\n\nIn literally ever game, you tell people how bad they are, tell them they are reported if they are playing poorly, and say 'gg ez' or 'your [lane opponent here] was so bad' if you win.\n\nIt shouldn't really be a surprise, as you had a lot of warnings leading to this. It's just horrible sportsmanship. The next penalty will be a permanent ban.","replies":[{"poster":"Dreampod","date":"2017-05-02T18:19:59.282+0000","up_votes":5,"down_votes":0,"body":"I just want to say that I find this heartening.\n\nI see players like this all the time that spend so much time obsessing about everyone else's play and blaming them for everything that goes wrong and are incredibly whiny and critical.  They drive me nuts and while I generally just mute them and don't report because what they are doing in my game isn't _quite_ ban worthy taken alone they dramatically diminish my enjoyment of the game and are sometimes of the cause of me deciding to not requeue for the night or to play a different game since I would lose my shit if I had to spend another 40 minutes with a Dunning-Kruger effect.  Knowing that these sorts of awful unsportsmanlike players are given warnings and removed if they keep being such a misery for everyone they play with really makes me feel better about the game.","replies":[{"poster":"Mizuki Zahra","date":"2017-05-02T20:35:16.062+0000","up_votes":1,"down_votes":0,"body":"I had a game where we were stomping them and around the 30 min mark our jungler that was the carry started to verbally attack the enemies and I mean like straight up harassment and we didn't like that at all so some how our mid convinced us to ff and allow the enemies to win 4 hits before their nexus went down. (this was normals)","replies":[]}]},{"poster":"angel princess","date":"2017-05-02T20:02:05.825+0000","up_votes":1,"down_votes":0,"body":"hahahahaha someone call 911 i just witnessed a fucking murder hskjdhflkfg;","replies":[]}]},{"poster":"Kei143","date":"2017-05-02T12:06:17.530+0000","up_votes":10,"down_votes":1,"body":"> Worth content for 14 day ban?\n\nA direct 14-day ban worthy, certainly not. A punishment worthy for a chat restriction? Certainly yes.\n\nThe punishment system works on a ladder:\n\n1. 10 game chat restrict\n2. 25 game chat restrict\n3. 14-day ban\n4. permaban\n\nAnything that can yield a chat restriction will eventually make it's way a permaban.","replies":[{"poster":"howareyouthisbad","date":"2017-05-02T12:36:54.891+0000","up_votes":1,"down_votes":20,"body":"Seriously fuck off.....","replies":[]}]},{"poster":"RallerenP","date":"2017-05-02T08:04:26.300+0000","up_votes":5,"down_votes":0,"body":"You shouldn't ask if it's wort a 14-day ban. You probably have already recieved the 10 and 25 game chat restriction, so the next question would be: \"Is this worth a punishment?\". Which yes. Very much so, you are constantly talking down to your teammates and calling for reports. \n\nSummoners Code Rule 2: '_Drive Constructive Feedback_'\n>BrosifTooHeavy: yo dont play him if u dont know how\n>BrosifTooHeavy: 11 games and 36% win rate should be a tell all\n\nNot very constructive. I see no costructive feedback in these chatlogs. \n\nSummoners Code Rules 6: '_Show Humility in Victory, and Grace in Defeat_'\nCarrying your game is no excuse for your actions, and has 0 influence over your punishment.\n\nTake this 14-day as a way to reflect on your actions and calm yourself down. When you get playing again you will have 0 chances left and it will be permanent ban, if you do show negative behaviour that is. Abide the the summoners code, and you will be 100% fine. Break the ToS, and you will get permabanned.","replies":[{"poster":"howareyouthisbad","date":"2017-05-02T12:39:31.657+0000","up_votes":1,"down_votes":12,"body":"Wtf is with you people. He's making a point.ho the hell wants to que with some that has a 36% win rate on ffs......... simple math would tell this person to play a fucking champion he has 55% on jesus christ","replies":[{"poster":"RallerenP","date":"2017-05-02T12:49:45.565+0000","up_votes":3,"down_votes":1,"body":"But don't flame people for playing the champions they want when its not trolling. If i enjoy playing Udyr but have a trash win-rate should I stop playing Udyr? No. No I shouldn't. \n\nThat said, it's not often you encounter this situation so here is the general way to think about it:\n\n20% of games you lose because of teammates\n20% of games you win because of teammates\n60% of games you are the key to winning or the reason you lose.","replies":[{"poster":"howareyouthisbad","date":"2017-05-02T12:55:47.096+0000","up_votes":1,"down_votes":8,"body":"You should take it to normals. Why would you play a champion you lose more on than a champion you win more on unless your goal is to demote yourself. Ranked is meant to be competitive so bring your best. Those percentages are bs.","replies":[]}]}]}]},{"poster":"Kitty Cat Tosha","date":"2017-05-02T07:51:59.206+0000","up_votes":4,"down_votes":1,"body":"Not a single line in those logs was moderately positive. And the only neutral thing I could find was \"BrosifTooHeavy: had to order tacos\".\n\nIf you are like that in every single game, it's no wonder you got escalated to a 14 day ban. No, it's not the worst I have ever seen, but even so, you are a drag for your team.","replies":[{"poster":"howareyouthisbad","date":"2017-05-02T12:40:40.640+0000","up_votes":1,"down_votes":9,"body":"Can't tell a bad player they're bad,, playing at pre school","replies":[{"poster":"Kitty Cat Tosha","date":"2017-05-02T13:47:13.454+0000","up_votes":7,"down_votes":0,"body":"Though you should have learnt in pre school how to play nice. Couldnt hurt to get a refresh course there, I suppose.","replies":[{"poster":"howareyouthisbad","date":"2017-05-03T03:36:00.164+0000","up_votes":1,"down_votes":5,"body":"I'm here to play,  not pander to the fucking social justice warriors","replies":[{"poster":"Kitty Cat Tosha","date":"2017-05-03T06:06:05.170+0000","up_votes":2,"down_votes":0,"body":"So play instead of typing.","replies":[]},{"poster":"Automated Riven","date":"2017-05-03T05:47:55.050+0000","up_votes":1,"down_votes":0,"body":"I just have to ask. are you the op's alt account?","replies":[{"poster":"howareyouthisbad","date":"2017-05-03T11:30:30.006+0000","up_votes":1,"down_votes":2,"body":"No lol. I can play and type what I need to","replies":[]}]}]}]}]},{"poster":"Mizuki Zahra","date":"2017-05-02T20:30:34.532+0000","up_votes":2,"down_votes":0,"body":"not only that but he seems like as soon as someone makes a tiny mistake he will make a big deal out of it causing the team to tilt.","replies":[{"poster":"howareyouthisbad","date":"2017-05-03T03:36:28.977+0000","up_votes":1,"down_votes":6,"body":"Your dumb mistakes cause me to tilt and get behind","replies":[{"poster":"Mizuki Zahra","date":"2017-05-03T05:41:14.691+0000","up_votes":1,"down_votes":0,"body":"So instead if constructive criticism you rage and feed cause I missed 3 cs  or I took 1 cs  from adc by accident ya makes sense good reason to tilt and feed","replies":[{"poster":"howareyouthisbad","date":"2017-05-03T11:28:42.782+0000","up_votes":1,"down_votes":2,"body":"Reason to tilt is 03 top player not warding river one time for example..","replies":[{"poster":"Mizuki Zahra","date":"2017-05-03T14:25:51.179+0000","up_votes":1,"down_votes":0,"body":"Well ya but all you have to do is get a control ward put it in a safe area top and help them ward","replies":[]}]}]}]}]}]},{"poster":"Automated Riven","date":"2017-05-03T05:52:33.774+0000","up_votes":2,"down_votes":0,"body":"Suggestion for not getting banned again. \nDont type. At ALL .. Focus on what you can do better and let your teammates be idiots. You will face some games that are unwinnable but just accept them as a fact of life. type /mute all at the beginning of every game and make your chat box as small as it can get. \nYou can also get extreme and get a special keyboard with nothing but qwer1234567  space and DF and B and whatever other hot keys you use. and remove all the other keys. If you ever want to say something negative turn it into possitive. If your cait died stupidly compliment toplane on what they did right. Ignore the bad and focus on the good and improving your own play\n\nI really hope that you can learn from this and come back and help create a possitive game for everyone involved. \nBest of luck","replies":[]},{"poster":"EvilDustMan","date":"2017-05-02T09:53:35.708+0000","up_votes":3,"down_votes":1,"body":"Yes, you spend each game blathering about how bad someone might be, instead of just playing.","replies":[]},{"poster":"Asterfix","date":"2017-05-02T07:50:16.143+0000","up_votes":2,"down_votes":1,"body":"I swear a lot more when I rage in my games and i've never gotten a ban so... no that was not worth a 14 day ban.","replies":[]},{"poster":"howareyouthisbad","date":"2017-05-02T12:44:27.165+0000","up_votes":1,"down_votes":12,"body":"No its a joke you got banned for this. It's not even offensive. Mute was an option, obviously wasn't that bad to mute. Could be annoying seeing g spam like that but never worth a ban. People int and are abusive that won't get banned and any ban comparing to this is a fucking joke lol","replies":[{"poster":"CannabisOverlord","date":"2017-05-03T03:47:38.636+0000","up_votes":3,"down_votes":0,"body":"Looks like a second account to me, or a buddy, the defense of toxicity is really high","replies":[{"poster":"BrosifTooHeavy","date":"2017-05-03T22:44:31.613+0000","up_votes":1,"down_votes":0,"body":"Nah, I only have 1 friend on league and that's my coach. We're both NA.","replies":[]},{"poster":"howareyouthisbad","date":"2017-05-03T11:36:13.070+0000","up_votes":1,"down_votes":2,"body":"More like people want him banned over nothing, over something that can be muted. Talk like you never flame. Everyone has flamed and everyone has deemed to be toxic in some way. Guess you won't have anyone else to play with","replies":[{"poster":"CannabisOverlord","date":"2017-05-03T17:15:25.338+0000","up_votes":1,"down_votes":0,"body":"The problem is if you mute then you lose communication to potentially win the match, but noone wants to try to communicate with someone this toxic. And i flame and get ragey maybe once every 20 games. And its still nowhere as bad as this.","replies":[]}]}]},{"poster":"Angrychickén","date":"2017-05-02T19:16:44.267+0000","up_votes":2,"down_votes":0,"body":"You are actually what people point to when they say that League has a toxic community.\n\nI feel disgusted to be associate with you in any way.","replies":[{"poster":"howareyouthisbad","date":"2017-05-03T03:37:53.876+0000","up_votes":1,"down_votes":5,"body":"Pc principle","replies":[]}]}]},{"poster":"Imperial Pandaa","date":"2017-05-02T19:36:59.106+0000","up_votes":1,"down_votes":0,"body":"By itself, maybe a chat restriction. Seeing that you have had 6 of those already, then yes a 14-day.","replies":[]},{"poster":"Colgate Gator","date":"2017-05-02T16:30:58.311+0000","up_votes":1,"down_votes":0,"body":"I wonder why people tend to think that their punishment is based on what they say? As if there are \"tiers\" for punishments, that's not how this works. Your punishments escalate with repeating offenses, so, you should know that you're on your last stand here, as after 14 ban, the only next escalation left is a perma.","replies":[]},{"poster":"Periscope","date":"2017-05-02T16:27:27.890+0000","up_votes":1,"down_votes":0,"body":"I took a look at your chat logs. Every game involves harassment: you telling one player or another how bad they are. None of which involves any constructive feedback. You will rarely see improvement of a player simply because they're being told they are bad.\nGame 1\n>BrosifTooHeavy: Your ults are very confusing lulu\nBrosifTooHeavy: why does this support ward\nBrosifTooHeavy: this ekko skills are making me cry\n\nGame 2:\n>BrosifTooHeavy: their janna is so much better than you\nBrosifTooHeavy: okay, bad players calling me noob doesn't hurt my feelings\nBrosifTooHeavy: just reassures me how bad you are\n\nGame 3:\n>BrosifTooHeavy: ww ur bad tho k kid\nBrosifTooHeavy: ww u just run in 1v3\nBrosifTooHeavy: idiot\nBrosifTooHeavy: yo ww stop feeding bro\n\nThese may not seem 14-day ban worthy, but they are punishment worthy. If you recently got off a 25-game chat restriction, then the 14-day ban is the next tier of punishment, as others have pointed out in this discussion.\n\nIf you disagree, you should submit a support [ticket](https://support.riotgames.com/hc/en-us/requests/new).","replies":[]},{"poster":"Starcraft243ver","date":"2017-05-02T09:45:38.527+0000","up_votes":1,"down_votes":0,"body":"Be aware that next ban is the permanent one. And by permanent it means : you LOSE the account forever.\n\nI strongly recommand you dont even type anymore in the chat.","replies":[]},{"poster":"This Is Your Dad","date":"2017-05-02T07:49:59.833+0000","up_votes":1,"down_votes":0,"body":"I don't think it matters how well you do tbh. Chat related offenses are separate from feeding offenses and are handled separately; not partaking in one offense does not mean you are immune from punishment as a result of another offense. \nx9 report is harassment. Belittling your team the entire time is why you were punished. There's like, nothing positive in your chat logs except had to order tacos.","replies":[]},{"poster":"TheStevenWu","date":"2017-05-04T23:07:32.255+0000","up_votes":1,"down_votes":1,"body":"I looked you up on LoLKing\n\n1) You are a high silver/low gold players. This assessment is not because of your current rank but based on the # of games you played to achieve that rank. You are in no position to call other players bad.\n\n2) You have been feeding in most of your games in the past week including games you have won. You are in no position to call other players bad; I also seriously doubt you \"carried in all 3 games\".\n\n3) Based on the posted games, you seem to be one of those players with low game knowledge and blames your teammates when you perform poorly. For examples, players who blame junglers for not counter ganking when pushed up to the enemy tower with no river wards. Don't you just hate those people?\n\n4) You have a 33% win rate on Udyr in 18 games and Thresh in 15 games. Most champions you play have a negative win-rate, including your 44% 29-games caitlyn. Maybe you should follow your own advice before criticizing other people's champion selection?\n\nFrom the observations above, there is no doubt in my mind that your punishment is well-deserved. Sometimes decent players have bad social skills and they come off as toxic when interacting with their teammates. You are hypocritical and relatively sub-par as a player; your criticisms are most likely just flat-out toxic behavior.\n\nYou should seriously consider self-reflecting on the 4 points i just listed. You can only improve yourself by first acknowledging your failings. I hope this sufficiently answers your question.","replies":[]},{"poster":"BrosifTooHeavy","date":"2017-05-03T23:20:02.642+0000","up_votes":1,"down_votes":1,"body":"Interesting feed back guys. I've had 1 other account perma-banned for similar 'toxicity.' I've played the game since Season 2, and i've never considered this type of banter as toxic. Personally, I would rather have someone on my team that carries the game and if he calls me bad so what? He raised my elo. Honors. Anyways, I will not reform and pretend to be someone who i'm not. That's just so fake and cringy. So is there a way to disable chat all-together. I don't have the dedication to just not use chat or mute all. I'm not joking when I say this, I get the same feeling calling someone bad that I do when eating a cheat meal.","replies":[]}]}