{"poster":"Oranjesus","date":"2015-08-12T20:10:54.647+0000","title":"Proyecto: Teambuilder LAS (Entra!!)","subforum":"Charlas Generales","up_votes":8,"down_votes":0,"body":"Hola, hace unos d&iacute;as publiqu&eacute; con referencia a las largas colas de espera en el teambuilder cuando quieres practicar una linea, y lo molesto que es encontrarse con gente pesada en cola normal (---> ac&aacute; el link por si quieren leer la reflexi&oacute;n qe es bastante larga: http://boards.las.leagueoflegends.com/es/c/charlas-generales/PNEGmozJ-como-practicar-un-campean-colas-y-modos-de-juego-una-pequeaa-reflexian-consulta) y con el consejo de una persona y un poco de motivaci&oacute;n hemos decidido abrir un grupo en facebook dedicado a encontrar gente para jugar de manera sencilla, les aclaro que es un grupo nuevo y por ende por la poca cantidad de personas que tendremos al inicio es probable que no funcione de manera tan satisfactoria pero solo es cosa de tiempo para crecer un poco en cantidad! \n\n&iquest;Por qu&eacute;? &iquest;C&oacute;mo? &iquest;Las reglas? todo eso est&aacute; respondido en el grupo, solo tienen que unirse en:\nhttps://www.facebook.com/groups/750904395031662/\n\n(NOTA IMPORTANTE: Por la evidente escasez de integrantes, por ahora, es normal que no funcione de manera fluida y/o fácil, cosa que solventaremos con la llegada de nuevos integrantes, está en su mano difundir el grupo)\n\nSer&aacute;n admitidos de manera inmediata, dentro de poco comenzaremos a difundir el grupo por distintos medios de internet y se pondr&aacute; en modo abierto (foros, fanpages, amigos, etc) as&iacute; que evidentemente crecer&aacute; con referencia a lo que es hoy (muy peque&ntilde;o), se agradece la difusi&oacute;n con amigos, y leer las reglas b&aacute;sicas del grupo.\n\nSaludos, y los espero!\n\nPD: Cualquier duda la pueden dejar ac&aacute; o en el enlace de facebook de m&aacute;s arriba, an&iacute;mense!","replies":[{"poster":"iMonsterQ8","date":"2015-08-12T20:33:27.977+0000","up_votes":4,"down_votes":0,"body":"¿Y los que no tienen FaceBook?","replies":[{"poster":"TDEI","date":"2015-08-12T21:03:27.514+0000","up_votes":1,"down_votes":0,"body":"Yo no uso facebook y entre con la idea de que era una sala de chat o algo parecido. {{champion:32}}","replies":[{"poster":"Oranjesus","date":"2015-08-12T21:06:34.809+0000","up_votes":1,"down_votes":0,"body":"Es la red social más popular que me proporciona las herramientas para que funciona el grupo, pensaré como solucionarlo.\nLo siento, por ahora","replies":[]},{"poster":"Nombre ofensivo","date":"2015-08-13T13:09:44.437+0000","up_votes":1,"down_votes":1,"body":"yo tampoco uso facebook, mi desactive mi cuenta hace 1 año, propongan otro medio","replies":[{"poster":"TDEI","date":"2015-08-13T13:42:23.860+0000","up_votes":1,"down_votes":1,"body":"wtf?","replies":[]}]}]}]},{"poster":"The Inkanus","date":"2015-08-12T23:52:51.488+0000","up_votes":1,"down_votes":0,"body":"¿Y tener una sala de chat permanente en el cliente?.\n\nAsi como existe la sala Evento, la sala Argentina, la sala Chile creen la sala \"Practica\", tildan para conectarse a esta sala automáticamente al loguear y entonces estará siempre activa (uno u otro de los participantes siempre está conectado), desde ahí se arman premades sabiendo que la finalidad es practicar campeones y listo.","replies":[{"poster":"Oranjesus","date":"2015-08-13T01:39:16.265+0000","up_votes":2,"down_votes":0,"body":"Sí, lo que pasa es que es muy susceptible a cerrarse además de que no sabemos cuántos seremos y en ese sentido los límites son menos problemáticos en facebook, además la idea es crear un grupo sano con gente que se identifique con un perfil de modo que haya una convivencia sana y podamos controlar mejor a quiénes participan en ella. Saludos","replies":[]}]},{"poster":"Novanex","date":"2015-08-12T20:24:26.740+0000","up_votes":2,"down_votes":0,"body":"Esto suena genial, y me vendria genial ya que soy un reverendo asco en jg y me gustaria por lo menos ser un jg decente","replies":[]},{"poster":"Arkelius","date":"2015-08-13T22:07:59.168+0000","up_votes":1,"down_votes":0,"body":"Me sale no disponible :/\n\ny por cierto, a los que borraron su cuenta de facebok haganse una si quieren usarlo, no hace falta que tengan las fotos de sus amigos ni nada para usar una cuenta, yo tengo una que uso justamente por los grupos de la facultad y juegos nomas xD (no pongan sus datos reales si tienen miedo de que los hackeen o algo de eso)","replies":[{"poster":"Oranjesus","date":"2015-08-14T00:48:24.110+0000","up_votes":1,"down_votes":0,"body":"Hola y disculpa, error mio, ya está disponible y disculpa por las molestias.","replies":[]},{"poster":"Arkelius","date":"2015-08-13T22:08:58.118+0000","up_votes":1,"down_votes":0,"body":"lo de los datos falsos lo digo porque tengo un conocido que por eso no usaba facebook cuando teniamos que hacer un grupo asi que lo convencimos que se arme uno con datos falsos para que le lleguen nuestros mensajes ... hay de todo en este mundo xD","replies":[]}]},{"poster":"Immeryse","date":"2015-08-13T19:48:02.350+0000","up_votes":1,"down_votes":0,"body":"Me sale no disponible xD!","replies":[{"poster":"Oranjesus","date":"2015-08-14T00:47:59.144+0000","up_votes":1,"down_votes":0,"body":"Hola y disculpa, error mio, ya está disponible y disculpa por las molestias.","replies":[]}]},{"poster":"I Love KaiSa","date":"2015-08-13T19:25:21.622+0000","up_votes":1,"down_votes":0,"body":"Muy bueno.","replies":[]},{"poster":"langosta rockera","date":"2015-08-13T01:42:59.421+0000","up_votes":1,"down_votes":0,"body":"muy buena iniciativa hay gente no que jugamos rank y nos gusta variar campeones por diversión . Tal vez dar el grupo a conocer sería una buena idea en vez de pedir ingresos casi VIP xD. En general todo bien debes tener en cuenta que al igual que team builder en vivo del server, siempre flatara un supp :3 saludos ! \n\nP.D : me gustaría unirme cuando el grupo este conformado :D!","replies":[{"poster":"Oranjesus","date":"2015-08-13T05:32:46.303+0000","up_votes":1,"down_votes":0,"body":"Claro, lo que sucede es lo siguiente, pido que me envíen mensajes a la cuenta de facebook de arriba para tener a varias personas y agregarlos a todos de una, de modo que cuando entren haya por lo menos un par de decenas de personas y sea más o menos \"funcional\", pero espero que entiendan que mientras no seamos una cantidad más elevada va a andar un poco lento (por ahora)\n\nSi quieren unirte envía un mensaje al link del post y en cuanto abra lo sabrás","replies":[]}]},{"poster":"Kurosei","date":"2015-08-12T20:19:15.719+0000","up_votes":1,"down_votes":0,"body":"La idea es super buena, y bastante practica. Yo ya estoy unido, así que espero que entre más gente para que se pueda cumplir el objetivo, que sin duda todos aprovecharemos al máximo.","replies":[]}]}