{"poster":"Yo its ya boi","date":"2017-02-13T09:07:28.035+0000","title":"Profanity Filter","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":0,"body":"I am having trouble disabling the profanity filter. When I am chatting to a friend or in champ select, or whenever im not in game i can see the profanity. Whenever in game, all I see are the asterisks instead of the profanity. I have tried turning it on and off in the top right of the game client, but to no success. I have tried going to Riot Games Folder > League of Legends > RADS > Solutions > lol_game_client_sln > Releases > 0.0.1.162 > air > Preferences but i cant find the air folder. I actually dont seem to have one, although there is a deploy folder.","replies":[{"poster":"chrisvj","date":"2017-02-14T03:15:49.427+0000","up_votes":3,"down_votes":0,"body":"In-game, type \"/chatfilter\" without the quotes. For me, it's off when it says it's on, kinda buggy but whatever.","replies":[{"poster":"Yo its ya boi","date":"2017-02-15T10:27:11.363+0000","up_votes":1,"down_votes":0,"body":"I tried this today and it works! Thank you very much. I also dont have to do this every game!","replies":[]},{"poster":"Yo its ya boi","date":"2017-02-14T07:29:50.907+0000","up_votes":1,"down_votes":0,"body":"Do I have to do this every game?","replies":[]}]},{"poster":"Targons Blade","date":"2017-02-14T00:02:13.380+0000","up_votes":2,"down_votes":1,"body":"Is this happening in both Clients or only in one? Can you try swapping over to the other client to attempt the disable? Some players have reported this fixes the issue, so I'd like you to try it.\n\nLet me know what happens.","replies":[{"poster":"Not Today Buddy","date":"2017-02-14T02:04:58.046+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Targons Blade,realm=NA,application-id=osqw6G4M,discussion-id=nyGke2ek,comment-id=0000,timestamp=2017-02-14T00:02:13.380+0000)\n>\n> Is this happening in both Clients or only in one? Can you try swapping over to the other client to attempt the disable? Some players have reported this fixes the issue, so I&#x27;d like you to try it.\n> \n> Let me know what happens.\n\nit does fix the problem but... my computer lags alot in the new client and i prefer to play in the old client. Can you give me insight on when this will be fixed?\n{{item:3070}}","replies":[{"poster":"Targons Blade","date":"2017-02-14T21:28:18.924+0000","up_votes":1,"down_votes":0,"body":"Can you try enabling *low-spec mode* and disable animation in the New Client to see if it fixes the \"lag\" you're experiencing with it? \n\nhttp://image.prntscr.com/image/598e949fe2904c85b3220875cf13760f.png\n\nThis could drastically improve your experience on the New Client and make it much more enjoyable to use. ^.^ Let me know if those steps worked for you.","replies":[{"poster":"Yo its ya boi","date":"2017-02-17T04:48:55.238+0000","up_votes":1,"down_votes":0,"body":"I updated to the new client and played with it yesterday and got a constant 10-20 fps when in game, even with putting it on low-spec mode and normally with Legacy client I get 60fps. I changed back and tested Legacy client again and my fps was back up.","replies":[{"poster":"Targons Blade","date":"2017-02-19T21:41:09.952+0000","up_votes":1,"down_votes":0,"body":"It definitely sounds like your PC is having a hard time leaving available resources for the Client. I'd recommend to continue using the Legacy Client and to check back in on the new client after we push another update out that will hopefully improve client performance a bit more.\n\nAs for the language filter issue, some players have reported this can be resolved by going into the client settings and **enabling** the filter, then hitting **DONE**. Go back into the settings and then **disable** the filter and hit **DONE** again. Let me know if this resolved the filter issue.","replies":[{"poster":"ThèRedBaron","date":"2017-02-20T04:33:41.297+0000","up_votes":1,"down_votes":0,"body":"For me the issue only happens on the beta client, and there is no way my pc is having a hard time, (16 gb RAM, 980 GTX, 3.0 ghz proccessor, etc).","replies":[]},{"poster":"Yo its ya boi","date":"2017-02-20T02:44:42.442+0000","up_votes":1,"down_votes":0,"body":"Typing /chatfiler when in game resolved my issue, but thanks anyways :)","replies":[]}]}]}]},{"poster":"Yo its ya boi","date":"2017-02-14T07:31:55.901+0000","up_votes":1,"down_votes":0,"body":"Yeah i still use the old client because i know for a fact my computer will lag with the new client.","replies":[]}]},{"poster":"Yo its ya boi","date":"2017-02-14T07:30:17.565+0000","up_votes":1,"down_votes":0,"body":"I feel like chaning the client would cause my pc to lag, as it can barely run the old client.","replies":[{"poster":"Targons Blade","date":"2017-02-14T21:25:53.397+0000","up_votes":1,"down_votes":0,"body":"Can you try upgrading to see if it resolves the issue. If your computer meets the [**minimum requirements**](https://support.riotgames.com/hc/en-us/articles/201752654-Minimum-and-Recommended-System-Requirements/) for League, you shouldn't have any huge issues running the new client. We have a *low-spec* mode and an option to disable animation inside the client for PCs that encounter performance issues in the client.\n\nhttp://image.prntscr.com/image/598e949fe2904c85b3220875cf13760f.png\n\nLet me know if this worked.","replies":[{"poster":"Yo its ya boi","date":"2017-02-15T10:29:42.316+0000","up_votes":1,"down_votes":0,"body":"Ok, I will update my client right now.","replies":[]}]}]}]}]}