{"poster":"Shocky Ninja","date":"2019-11-04T04:28:17.415+0000","title":"What's the point of placements if they don,t actually make any sense lol.?","subforum":"Gameplay","up_votes":2,"down_votes":1,"body":"Just finished my placements: 7-1\r\nWin\r\nWin\r\nWin\r\nWin\r\nWin\r\nLoss\r\nWin \r\n\r\nSilver 2 LOL ok.....","replies":[{"poster":"Kai Guy","date":"2019-11-04T04:54:31.673+0000","up_votes":3,"down_votes":0,"body":"https://imgur.com/a/xqTaXVU\n\nEdit. Clarifying the MMR gap mainly seems to only happen on good results rather then universal ones. added \"strong\" to post to clarify that.\n\n\"Strong\" Placements set a lower \"Rank\" now then the MMR range your in. Its a distraction/to lower folks lucking out into high MMR. Players judge \"rank\" as skill cuz that's whats visable despite MMR being whats used by MM to build a game.  Ego appeasement systems and also work to egg folks on and lower folks getting to luck their way into a higher tier then they reasonably should finish in.\n\nPulling from personal experience and experiments, If you do absolutely nothing besides go WLWL, Lp slant is enough to make it out of silver if your in gold MMR. \n\nhttps://na.op.gg/summoner/userName=NotNotkaiguy\n\nI took it a few steps farther. I went out of my Way to Force failed promo games Via Dodgeing which counts as a loss. I also used /remake abuse to \"lose\" 3 Placement games. Resulting in B1 starting MMR with S2 Match average. \n\nI am actively looking to collect Data and find patterns. Ultimately I would like to have enough information to try and use LP Slant values as workably accurate estimations for an accounts hidden MMR.\n\nIf your down to help, what are your LP Gains? Can I please  get you to screen cap your next few win and your next loss?\n\nMy assumption is your gonna be seeing close to 30 LP for a win, And get -10 for a loss.  give or take 8LP as I don't have enough Data on hand from other players that's been proven Via Screen caps.\n\nIf you don't chain losses then if it takes more then 7 games for you to skip promos + divisions to S1-G3 I will be surprised.\n\nWould love if you get back to me with the results.","replies":[]},{"poster":"Pumpedhero","date":"2019-11-04T04:30:15.443+0000","up_votes":2,"down_votes":0,"body":"its also influenced by your own display of statistics. The old MMR system of being just, Ur placed by the amount of wins in ur promo placements, was removed pretty sure, just because it was an easy tool for boosters and it was unfair to players that actually were decent and got bad promo placements.","replies":[{"poster":"Shocky Ninja","date":"2019-11-04T04:37:29.888+0000","up_votes":1,"down_votes":0,"body":"but I was S+ in most games. And i'm looking at the statistics and my scores are insanely high....","replies":[{"poster":"Daddy Ants","date":"2019-11-04T17:34:35.250+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Shocky Ninja,realm=NA,application-id=3ErqAdtq,discussion-id=m9As5IZe,comment-id=00000000,timestamp=2019-11-04T04:37:29.888+0000)\n>\n> but I was S+ in most games. And i'm looking at the statistics and my scores are insanely high....\n\nYour scores and mastery ranks don't mean a damn when you get placed in ranked.","replies":[{"poster":"Pumpedhero","date":"2019-11-06T21:54:30.351+0000","up_votes":1,"down_votes":0,"body":"^ This. ur score / mastery (like an S+) dont count, thats more leaning toward the average for the champion, not the skill bracket.","replies":[]}]},{"poster":"Typhl0","date":"2019-11-04T23:30:11.203+0000","up_votes":1,"down_votes":0,"body":"The game can't give u a high elo after ur placement so the \"lucky one\" won't get high elo because the got smurfers in their team but u can be a good player also so u will get a high mmr, u will win a lot of lp and lose almost nothing. I did a smurf, went 11-1 and I was silver 1 with a plat 4 mmr doing +35 - 7, and I was jumping every promos.","replies":[]}]}]},{"poster":"MagicFlyingLlama","date":"2019-11-04T04:46:25.632+0000","up_votes":3,"down_votes":1,"body":"Considering you are completely new and have no previous game history, silver 2 is normal. You should be in iron unless you are _vastly_ better than the average new player.\n\nUnless you have an amazing faith in your abilities, dont play ranked yet. You will just drop like a rock and harm your MMR for a long time.\n\n> but I was S+ in most games. And i'm looking at the statistics and my scores are insanely high....\n\nThese have zero effect on anything except your ego and mastery chests.","replies":[{"poster":"Shocky Ninja","date":"2019-11-05T03:17:31.666+0000","up_votes":1,"down_votes":2,"body":"\"considering you're new....\" \n\nI'm plat on 3 accounts lol. this one i'm playing only kennen. Notice the name?","replies":[{"poster":"MagicFlyingLlama","date":"2019-11-05T05:58:32.259+0000","up_votes":1,"down_votes":0,"body":"Curiously your other accounts (if they exist or not) have zero effect on your MMR, just like having silly high KDA or grading has no effect on your MMR. Weird expectations..","replies":[{"poster":"Shocky Ninja","date":"2019-11-05T17:34:55.042+0000","up_votes":1,"down_votes":0,"body":"Curiously it would negate your pointless post that has no real purpose or value to the discussion. \n\nI steamrolled placements- it shouldn't leave me in silver. it's just a stupid ploy by riot to force you to play more games than you should for your league to reflect your MMR. I wouldn't care less if someone was placed high \"by luck\" because like you said- they should drop like rocks. \n\nI was only referencing my previous accounts because you made the assumption that because this is a level 30 account i'm \"new\" - which i'm not. Go troll someone else and allow the adults who understand the game to have a valid discussion. \n\nThanks,","replies":[{"poster":"MagicFlyingLlama","date":"2019-11-05T22:04:15.461+0000","up_votes":1,"down_votes":1,"body":"Insecure about your rank and dont want to start over? Then dont start over. Really easy shit. \n\nYou do have great MMR and winrate, right? Should be no problem to climb a rank in two games, skip divisions entirely..\n\nMost of those \"adults\" you so desperately want to be  are of the opinion that new players starting in high silver/low gold is a blight on the system and almost the entire reason, and that new players should start in bronze or iron.\n\nI started in Iron IV this year not too long ago, about to cross over to plat today or tomorrow. There should be a MMR reset every year to keep arrogant kids in their place instead of them camping on placements each season, and that was exactly what riot had in mind. Expect more resets in future.","replies":[{"poster":"Shocky Ninja","date":"2019-11-05T23:13:04.020+0000","up_votes":1,"down_votes":0,"body":"I'm not suggesting i wont climb- It just should not take 100 games- and in the past It didn't. I had an only vayne account on EUW that was placed in plat a few years ago. That's how it should be. Riot forces you to play too much and it defeats the purpose of placements entirely. They simply have no purpose if 7-1 gets you to silver lol. \n\nLets a lucky player in plat nobody gives a shit because ELO is what determines MM. and hey WILL drop like a rock.","replies":[]}]}]}]}]}]},{"poster":"uNhoLeee","date":"2019-11-04T04:40:21.557+0000","up_votes":3,"down_votes":1,"body":"to make you play more. zzz; riot employs psychology. \n\nhadnt played on the account for 4 years. went 10/0. ended up b1. lp gains were +67 or something. still pointless since i was d5 abroad last season.","replies":[]},{"poster":"Darkdemon653","date":"2019-11-04T17:46:52.010+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Shocky Ninja,realm=NA,application-id=3ErqAdtq,discussion-id=m9As5IZe,comment-id=,timestamp=2019-11-04T04:28:17.415+0000)\n>\n> Just finished my placements: 7-1\n> Win\n> Win\n> Win\n> Win\n> Win\n> Loss\n> Win \n> \n> Silver 2 LOL ok.....\n\nYou have an MMR that's much higher than the equivalent for silver 2, which is why you have been in games with mid-high golds and even a couple plats. You will be gaining a lot more LP for wins than you lose for losses. I suspect this is done to help lessen the impact of getting lucky or unlucky games while still making them matter. Assuming you maintain a decent win rate, you will climb very quickly. It wouldn't surprise me if you skip the promo games into silver 1.","replies":[]},{"poster":"mack9112","date":"2019-11-04T06:29:01.960+0000","up_votes":1,"down_votes":0,"body":"thats pretty good","replies":[]}]}