{"poster":"Blood Moon Pyke","date":"2016-06-26T15:04:29.917+0000","title":"Riot: Duda sobre la ulti de Kindred","subforum":"Charlas Generales","up_votes":12,"down_votes":0,"body":"No es por c&oacute;mo funciona, un bug o algo de jugabilidad, sino el nombre de la ulti en s&iacute;.\r\n\r\nEn Latinoam&eacute;rica la ulti de Kindred es &ldquo;Alivio de Cordero&rdquo; (o &ldquo;Serenidad de Cordero&rdquo; en la Presentaci&oacute;n de Campeones). El problema es que en Latinoam&eacute;rica, Kindred para nosotros son la Oveja y el Lobo, no como por ejemplo en Espa&ntilde;a que son Cordera y Lobo. &iquest;No deber&iacute;a el ulti referirse a la Oveja en vez de decir Cordero?\r\n\r\n**Justificaciones:**\r\n1-\tEn Ingl&eacute;s (el idioma original), la ulti se llama Lamb&rsquo;s Respite, que muestra a Lamb (Oveja) como realizadora de la acci&oacute;n debido a ese** &rsquo;s**. En Espa&ntilde;a, el nombre Respiro de Cordera es correcto ya que ellos se refieren a la Oveja como Cordera. \r\n2-\tLobo tiene su nombre en una habilidad (la W: &ldquo;Frenes&iacute; del Lobo&rdquo;) pero Oveja, en Latinoam&eacute;rica, no tiene su nombre en ninguna.\r\n3-\tRiot tradujo a &quot;Wolf&#039;s Frenzy&quot; como &quot;Frenes&iacute; del Lobo&quot; pero a &quot;Lamb&#039;s Respite&quot; como &quot;Alivio de Cordero&quot;.\r\n4-\tEn el &iacute;cono de la habilidad, se muestra a la m&aacute;scara que usa la Oveja.\r\n5-\tEn latino, el nombre de Cordero/a aparece ocasionalmente en algunas de las habilidades de Kindred, refiri&eacute;ndose a Oveja (&iquest;error de traducci&oacute;n?). Sin embargo, Lobo** nunca** se refiere a la Oveja como Cordero o Cordera en latino en ninguna de sus frases.\r\n\r\n**Comparaciones:**\r\nINGL&Eacute;S: **Lamb** / _Wolf.  _\r\nUlti: **Lamb**&rsquo;s Respite. \r\nW: _Wolf_&rsquo;s Frenzy.\r\n\r\nESPA&Ntilde;OL: **Cordera** / _Lobo. _\r\nUlti: Respiro de **Cordera**. \r\nW: Frenes&iacute; de _Lobo_.\r\n\r\nLATINO:** Oveja** / _Lobo._ \r\nUlti: Alivio de **Cordero.** \r\nW: Frenes&iacute; del_ Lobo._\r\n\r\nNo s&eacute; si fue un error de Riot o llamaron as&iacute; a la ulti a prop&oacute;sito (busqu&eacute; en el P&amp;R de Kindred pero ninguno lo pregunt&oacute; y, por lo tanto, Riot no iba a responder), pero si tomamos en cuenta a los dem&aacute;s idiomas, el nombre correcto en Latinoam&eacute;rica deber&iacute;a ser alguno de estos:\r\n1. Alivio de la **Oveja.**\r\n2. Respiro de la **Oveja.**\r\n3. Serenidad de la **Oveja.**\r\n\r\nMuchas gracias a todos lo que leyeron, y espero que Riot pueda resolverme esta duda.\r\n\r\nNos vemos {{summoner:31}}","replies":[{"poster":"Geeik","date":"2016-06-26T15:29:12.288+0000","up_votes":17,"down_votes":0,"body":"buenas amigo, yo soy latino y te voy a explicar esto:\nCordero, es la cría de la oveja como el lechón es la cría del cerdo y ternero o ternera el de la vaca, por eso se traduce asi su R\nEl lobo le dice asi por que kindred ya es casi adulta en el juego, pero si activas su R, no lo haces cuando tienes toda tu vida, suele ser cuando te queda poca (al estilo tryndamere), y hace referencia a que eres como un \"corderito indefenso\"\nNo se, simplemente es lo que pienso, si no estas de acuerdo con mi razonamiento dime\nDesde aqui el amante de los tanques, Nplayer03!  aqui te dejo la foto del padre de kindred (okno xD){{champion:12}}","replies":[{"poster":"Blood Moon Pyke","date":"2016-06-26T19:26:40.894+0000","up_votes":2,"down_votes":1,"body":"Buena explicación amigo. Aunque no seas miembro de Riot esa explicación es muy buena y convincente.\n\nPero me parece raro que Riot nunca haya aclarado por qué su ulti no hace referencia directa a la Oveja cuando en los demás idiomas sí. Al menos si quisiera referirse a Oveja podría ser Cordera en vez de Cordero, en mi opinión.\n\nTambién Riot podría arreglar las habilidades Q y W si no me equivoco, en la que escribe Cordera en vez de Oveja (parece que hicieron C+V del español :v)\n\nEn fin, gracias por tu opinión amigo!","replies":[{"poster":"Excalibeer","date":"2016-06-26T22:56:07.632+0000","up_votes":4,"down_votes":0,"body":"Hiciste un buen punto que envié al equipo a cargo, pero la respuesta de Nplayer03 fue brillante XD\n\n-Excalibeer","replies":[{"poster":"ZeNch","date":"2016-06-26T23:04:30.347+0000","up_votes":3,"down_votes":0,"body":"Deberia llamarse El silencio de los corderos =v","replies":[{"poster":"Neón Rose","date":"2016-06-27T20:15:39.424+0000","up_votes":1,"down_votes":0,"body":"+10 Xv","replies":[]}]},{"poster":"Geeik","date":"2016-07-02T23:54:32.363+0000","up_votes":1,"down_votes":0,"body":"que se suma a la fiesta! dos comentarios de rioters! :,D","replies":[]},{"poster":"XElektro","date":"2016-06-27T20:29:07.892+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Excalibeer,realm=LAS,application-id=v7qsfXsE,discussion-id=mxR3yGHX,comment-id=000000000001,timestamp=2016-06-26T22:56:07.632+0000)\n>\n> Hiciste un buen punto que envié al equipo a cargo, pero la respuesta de Nplayer03 fue brillante XD\n> \n> -Excalibeer\n\n¿Cuándo se pronuncian con respecto a la conexión con Perú?","replies":[]}]},{"poster":"Blood Moon Pyke","date":"2016-06-26T19:54:56.904+0000","up_votes":1,"down_votes":0,"body":"Estuve investigando un poco más, y la Oveja dice unas frases cuando ultea:\n\"Brilla una vez más antes del final.\"\n\"Saborea el acto final de tu vida.\"\n\"No aquí, no todavía.\"\n\nParece ser que Oveja le da como un respiro más a su víctima antes de que muera (en vez de referirse a ellos mismos), por lo que:\n1. El nombre Serenidad/Respiro/Alivio de Cordero sería correcto si nos referimos a su víctima como un corderito, con Oveja dándole un último momento antes de morir.\n2. El nombre Serenidad/Respiro/Alivio de la Oveja sería correcto si nos referimos a la acción de la Oveja con su víctima, siendo misericordiosa con él antes de asesinarlo.\n\nPor lo que, a partir de distintos puntos de vista, ambos nombres pueden ser correctos.","replies":[]}]},{"poster":"Riot Brujo","date":"2016-06-29T20:03:54.212+0000","up_votes":1,"down_votes":0,"body":"La explicación de Nplayero3 es la correcta. Como dice Cóndor, procuramos no traducir tan literalmente el concepto original (que se idea en inglés, pero el inglés no es nuestro \"idioma oficial\"), para aprovechar las ventajas que nos pueda dar el español; y como lo argumentan ShemandCurly y DarkHelel, dejar abierto a quién se refiere con lo de cordero, si al rival sacrificado o a la \"bondad infantil\" interior de la oveja, es algo que nos pareció muy enriquecedor para la historia de los Kindred. En España optaron por mantener consistencia usando solo Cordera, y les quedó muy lindo, me gusta mucho cómo suena, pero trabajamos por separado e interpretamos al personaje de diferente manera, por lo que solo en ocasiones coincidimos.\nEsta es una de mis historias favoritas de LoL, por cierto (aunque no es el personaje que juego más, jeje).","replies":[{"poster":"Riot Brujo","date":"2016-06-29T20:12:13.965+0000","up_votes":1,"down_votes":0,"body":"No debí decir que era la explicación correcta. Quise decir que era la explicación que coincide con lo que pensamos originalmente al nombrar dicha habilidad. En realidad no hay explicaciones correctas. Lo que apunta inicialmente ShemandCurly es muy cierto también.","replies":[{"poster":"Geeik","date":"2016-07-02T23:51:42.913+0000","up_votes":1,"down_votes":0,"body":"no puedo creer que un rioter me respondió y encima estuvo de acuerdo conmigo :,)    ya puedo morir feliz y en paz","replies":[{"poster":"Geeik","date":"2016-07-02T23:52:31.482+0000","up_votes":1,"down_votes":0,"body":"bah, no \"de acuerdo\" como dice, si no que  fue la explicación original de Rito","replies":[]}]}]}]}]},{"poster":"Dark Helel","date":"2016-06-26T21:04:49.909+0000","up_votes":2,"down_votes":0,"body":"Como lo explicaron, es porque el campeon esta basado en una dualidad,\npues representa en si el clasico duo oveja/lobo, aunque en realidad es un cordero del cual asumimos es hembra.\nLa ultimate aunque la targetea a ella ahora, en realidad estaba hecha para ser una mezcla de ult de trynda con bardo, por ende, se traduce como cordero, pues la ulti hace referencia a los corderos en general y no a la kindred oveja, \nes una especie de juego de palabras bien complicado,\nes una alusion a un \"area segura para corderos\", o sea, donde estan protegidos de daño, como funciona la ulti, y se lo trata asi, pues seria como que la kindred hembra, oveja, crea esta area para proteger a sus corderos(aunque a su vez es una referencia a ella misma, pues ella tambien es un cordero y se la denomina a ella como \"cordero\", en alusion a que es la ulti de ella misma y su poder).\n\nIgual si es complicado el tema, jaja, prefiero decirle kindred a ella, y al lobo lobo, mas comodo{{summoner:31}}","replies":[]},{"poster":"Riot Cóndor","date":"2016-06-29T18:32:10.315+0000","up_votes":1,"down_votes":0,"body":"Hola,\n\nNo soy Riot Brujo, el líder de localización, pero conozco cómo trabaja y puedo darte una respuesta (de todas formas, voy a verificarlo con él). A veces, cuando jugamos con las palabras a la hora de localizar frases de campeones, habilidades y objetos, nos damos cuenta que ciertas palabras no tienen un sonido agradable con otras. Algo así como [_cacofonía_](https://es.wikipedia.org/wiki/Cacofon%C3%ADa))).\n\nUna de las creencias más comunes de los jugadores es que el trabajo de Localización es traducir, cuando en realidad no se trata únicamente de esto. Es crear una experiencia que tenga consistencia linguística y cultural para nuestros jugadores respetando las decisiones de jugabilidad con el fin de mantener la experiencia de juego con el nivel que buscamos. \n\nEsto significa que, a veces, encontrarás sinóminos (o conceptos similares como este caso, ya que cordero y oveja tienen significado distinto).\n\nTambién, no se olviden que LoL es un juego global y no existe una única versión :)\n\nEspero que esta breve explicación haya podido ofrecer un poco de contexto sobre el motivo detrás de algunas decisiones.\n\nSlds,\n~RC","replies":[]},{"poster":"pPaablo","date":"2016-06-27T20:38:00.633+0000","up_votes":1,"down_votes":0,"body":"Te juro invocador, que no entendí nada :v","replies":[]},{"poster":"F0RZAKEN","date":"2016-06-26T21:26:38.799+0000","up_votes":1,"down_votes":0,"body":"Cordero es una oveja menor a un año. No está mal una ni otra forma.","replies":[]},{"poster":"Asturios","date":"2016-06-26T19:02:38.669+0000","up_votes":1,"down_votes":0,"body":"100% de acuerdo con vos y como jugador fan de Kindred me haría feliz este cambio. Incluso fijate que en latino pusieron alivio de cordero, con o, en lugar de cordera. Osea, le erraron dos veces.","replies":[]}]}