{"poster":"Toreole","date":"2017-10-20T10:57:59.197+0000","title":"Es ist mal Zeit, sich über die Urgot Ult zu unterhalten.","subforum":"Champions & Gameplay","up_votes":10,"down_votes":2,"body":"Also um anzufangen, nein ich beschwere mich nicht das sie irgendwie op sei oder sowas nein, hier geht es um was anderes.\r\nEs geht um die Animation die abgespielt wird, wenn man geultet und dann von ihm reingezogen wird und stirbt. Diese Ketten die auf einmal auf dem Bildschirm erscheinen, sind zum ersten manchmal ein bisschen falsch platziert (am unteren bildschirmrand sind 2cm frei, dann sind sie in der luft). Aber der Hauptgrund f&uuml;r den Thread ist das Gef&uuml;hl, das diese Animation in einem ausl&ouml;st. \r\nEs f&uuml;hlt sich einfach scheisse an, als wenn man an Klaustrophobie leidet und in einen 1m&sup2; raum geschmissen wird und man gleichzeitig die Grippe hat.\r\n\r\nMeiner Meinung nach sollte das nicht so sein, auch wenn es zum Champion design an sich passen w&uuml;rde, aber ein spieler sollte nicht so ein Gef&uuml;hl bekommen bei einem Spiel, bei dem Spa&szlig; immernoch der hauptgrund ist, es &uuml;berhaupt zu spielen.\r\nDaher m&uuml;sste es eine Option geben, solche Screen-overlay Animationen zu deaktivieren nach Bedarf, anstatt dass man da immer wieder durch muss..\r\n\r\nLG Toreole","replies":[{"poster":"Necromant","date":"2017-10-20T11:21:36.482+0000","up_votes":1,"down_votes":0,"body":"Halt ich für ne gute Idee.\nBei den Sounds (jetzt auch Pings) haben sie auch jeweils Optionen eingeführt.\n\nWobei man auch sagen muss, das die Urgot Ult Counterplaybar ist. Mit QSS/Cleanse/GP W oder dodgen :)","replies":[{"poster":"Sihari","date":"2017-10-20T11:31:00.603+0000","up_votes":3,"down_votes":0,"body":"Aber sollte man wirklich dazu gezwungen werden seinen Spielstil für eine Sache anzupassen, die spieltechnisch eigentlich keine Anpassung braucht? Es ist ja nur die Visualisierung das Problem und nicht die Ult ansich.","replies":[{"poster":"KledRekt","date":"2017-10-20T11:46:53.429+0000","up_votes":3,"down_votes":4,"body":"Man kann aus einer Mücke auch einen Elefanten machen. Wo liegt das Problem an diesen Ketten? Das ist doch ein schlechter Scherz...","replies":[{"poster":"Sihari","date":"2017-10-20T12:20:47.935+0000","up_votes":6,"down_votes":0,"body":"Jeder Mensch ist anders und die Chance, dass man irrational auf irgendwelche Dinge reagiert, die für andere lachhaft sind, ist gegeben und auch gar nicht mal so gering.\nIch bin einer der Menschen, die gruseligen Mist absolut nicht abkönnen. Ich schlafe verdammt schlecht, wenn ich auch nur für ein paar Sekunden am Tag zuvor ein .gif von irgendeinem Gruselviech gesehen habe und bei der Urgot-Ult bleibt mir kurz der Atem weg. \nIch will mir gar nicht vorstellen, wie das bei Menschen ist, die zB wie der TE das schon angeführt hatte, Klaustrophobie oder sowas haben...\nWenn dich die Animation nicht juckt, dann ist das gut und schön, aber deswegen gleich ausfallend zu werden und andere wegen so eines Wunsches schlecht zu machen ist ein bisschen unfair, findest du nicht auch?","replies":[{"poster":"BlackAjani","date":"2017-10-20T12:24:27.202+0000","up_votes":4,"down_votes":0,"body":"Eine sehr ehrliche Meinung!\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Dreadlord Mike","date":"2017-10-20T17:31:45.015+0000","up_votes":5,"down_votes":2,"body":"Es liegt aber nicht an der Animation sondern eher an der labilen Psyche jener Person die die Ult nicht abkönnen.\nIch finde deine Vorwurf ziemlich lächerlich tbh, und wenn du und Spieler wie du schon solche Probleme bei so etwas läpischem haben dann solltest du dir einfach einen Psychiater suchen.\nWenn Riot für jeden Spieler der irgendein Problem hat die Champion animations verändern würde , wäre lieg zum sterben verurteilt.\nAls nächstes würde sich dann jemand über die Knockups aufregen weil er \"Höhenangst\" hat weil ihm die Animaton daran erinnert dass er aus großer Höhe runterfliegt.\nDann würde man sich wegen Warwick beschweren weil sein \"knurren\" zu bedrohlich klingt usw usw.\nWenn man Urgot verändern würde, würde man zulassen dass dann jeder Champ verändert werden könnte weil irgendjemand irgendwo ein Problem damit hat.\nFinde also deinen Punkt überhaupt nicht umsetzbar und man sollte sich eher helfen lassen als es auf das game zu schieben.","replies":[{"poster":"Sihari","date":"2017-10-20T18:18:27.514+0000","up_votes":1,"down_votes":0,"body":"Man muss ja nicht gleich das ganze Game verändern um dieses Problem zu regeln.\nLoL ist immer noch ein Spiel für Kinder ab 12 Jahren und es sollte immer eine Möglichkeit geben das Spiel so einzustellen, dass auch wirklich jeder Spieler seine Runden gemütlich genießen kann. LoL ist kein Horrorspiel und deswegen verstehe ich nicht, warum man nicht wie beim Chatfilter auch eine Einstellung haben kann um verschiedene Effekte, wie eben Urgots Ult oder Warwicks Passive, so verharmlosen kann, dass sie den Spielspaß nicht mehr vermindern. Wenn die Entwickler nicht wieder Spagetti gekocht haben, dann sollte es eh nur ein true/false sein, das diese Einstellung am Ende beeinflusst.\n\nWas die Höhenangst betrifft gab es glaube ich sogar schon mal ne Anpassung. Wenn mich nicht alles täuscht gab es nämlich einige Fälle von Übelkeit, wenn bei Jhins Ult herausgezoomt wurde und ich glaube, dass da dann irgendwas verändert wurde. Ganz sicher bin ich aber nicht~\n\nPS: nicht jeder Scheiß kann von einem Psychologen \"geheilt\" werden oder ist es überhaupt wert deswegen hunderte Euro aus dem Fenster zu werfen.","replies":[{"poster":"Dreadlord Mike","date":"2017-10-20T18:57:07.042+0000","up_votes":2,"down_votes":1,"body":"Ich weiß das mal was an der Jhin ult geändert wurde, aber bin mir zu 90% sicher dass es nicht wegen Übelkeit von etwaigen Leuten war sondern was gameplaytechnisches da sie sich zu klunky angefühlt hat.\n\nJetzt weiter zum Thema.\nIch finde hier gibt es nichts zu verharmlosen. League ist besonders in Grafik Effekten ein sehr sehr harmloses Spiel meiner Meinung nach und ich denke nicht dass ich jetzt so \"abgehärtet\" bin.\nEs gibt sehr sehr wenig Blut es gibt keine blauen Flecken oder ausgequetsche Augen oder sonstiges was irgendwie abstößig wirkt(abgesehen von Gragas dickem Bauch Kappa ) .\nLeague wurde schon meiner Meinung nach viel zu Anfänger und Kinderfreundlich gemacht durch etwaige Ändernung wie das man in Tab auf die Schnelle die Summs von allen sehen kann, dass man bufftimer, drake und baron timer jetzt sieht , automatische Warding trinkets ecc ecc.\nLeague ist und sollte kein Spiel für Kinder sein und deine Änderung wäre meiner Ansicht nach ein Schritt in die Verkindlichung von League.","replies":[]}]}]}]},{"poster":"BlackAjani","date":"2017-10-20T11:49:13.900+0000","up_votes":1,"down_votes":0,"body":"Ich glaube der TE fühlt sich durch diese Animation deklassiert!?","replies":[{"poster":"KledRekt","date":"2017-10-20T12:02:44.891+0000","up_votes":3,"down_votes":7,"body":"Ich glaube der TE hat eins an der Waffel um ehrlich zu sein.","replies":[{"poster":"BlackAjani","date":"2017-10-20T12:07:33.500+0000","up_votes":1,"down_votes":0,"body":"man kann die Ulti von Urgot ja diskutieren, da spricht ja nichts dagegen.\n","replies":[{"poster":"KledRekt","date":"2017-10-20T12:12:53.020+0000","up_votes":5,"down_votes":4,"body":"_Aber der Hauptgrund für den Thread ist das Gefühl, das diese Animation in einem auslöst.\nEs fühlt sich einfach scheisse an, als wenn man an Klaustrophobie leidet und in einen 1m² raum geschmissen wird und man gleichzeitig die Grippe hat._\n\nDas ist doch nicht normal. Wer so enorm empfindlich ist sollte den Computer ausschalten und Videospiele aller Art meiden. Im Notfall kann man immer noch die Augen schließen... \n\nUrgot ist nun mal eine Abscheulichkeit, ein Monster das aus den tiefsten Abgründen hervor gekrochen kam, um seine Feinde auf grausame Art zu vernichten. Er will gefürchtet werden, und genau das wird durch diese Ketten vermittelt. Er packt dich und zerhackt dich in seinem Schredder. \n\nFinde die Animation mehr als super, wenn auch leicht grausam. ","replies":[{"poster":"Toreole","date":"2017-10-20T12:57:57.161+0000","up_votes":2,"down_votes":0,"body":"ich zitiere mich selbst nochmal \n\n\"auch wenn es zum Champion design an sich passen würde, aber ein spieler sollte nicht so ein Gefühl bekommen bei einem Spiel, bei dem Spaß immernoch der hauptgrund ist, es überhaupt zu spielen.\"\n\nKeine Einwände von mir, dass es nicht zum Champion passt, die Ult passt zum Design von Urgot, aber trotzdem will ich mich bei einem Spiel an dem ich Spaß habe nicht eklig fühlen nur durch eine einzige Fähigkeit.","replies":[{"poster":"BlackAjani","date":"2017-10-20T13:07:00.368+0000","up_votes":1,"down_votes":0,"body":"ja das ist aber eine intuitive Sache. Manche finden es gut manche nicht.\nIch glaube da müssten sich jetzt viele dran stören, dass Riot das als entfernbar mit hinzufügt.\nIch persönlich bräuchte es auch nicht.","replies":[]}]},{"poster":"BlackAjani","date":"2017-10-20T12:22:10.487+0000","up_votes":2,"down_votes":0,"body":"Aber wenn er es bereden möchte, dann darf er es ja in den Raum werfen. Wenn er mit solchen Dingen nicht umgehen kann, dann wären viele Spiele für ihn sicherlich nicht entspannend bzw. gut. Doch ich finde das es durchaus andere Fähigkeiten gibt, die schon ewig so ähnlich eingreifend animiert sind. Bsp. Nocturne ult = macht bei erster Aktivierung den Bildschirm der Gegner dunkel und könnte manche damit erschrecken/verängstigen ;) (kann)","replies":[]}]}]}]}]}]},{"poster":"Necromant","date":"2017-10-20T12:08:11.548+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sihari,realm=EUW,application-id=Wj1wcocU,discussion-id=qm3FEBw9,comment-id=00000000,timestamp=2017-10-20T11:31:00.603+0000)\n>\n> Aber sollte man wirklich dazu gezwungen werden seinen Spielstil für eine Sache anzupassen, die spieltechnisch eigentlich keine Anpassung braucht? Es ist ja nur die Visualisierung das Problem und nicht die Ult ansich.\n\nIch hab nur Lösungsvorschläge gebracht, da wie es klang er auch an sich mit der Ulti nicht zufrieden ist.","replies":[{"poster":"Sihari","date":"2017-10-20T12:25:35.118+0000","up_votes":1,"down_votes":0,"body":"Mhm... Für mich klang der erste Satz mehr nach einem \"hier geht es nicht um das Thema, also fangt bitte gar nicht damit an\" als nach einer Beschwerde über die Mechanik oder den Schaden der Ult. Aber ich kann mich da natürlich auch irren.... Gedanken lesen ist nicht meine Stärke. xD","replies":[{"poster":"Necromant","date":"2017-10-20T12:29:04.689+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sihari,realm=EUW,application-id=Wj1wcocU,discussion-id=qm3FEBw9,comment-id=0000000000010000,timestamp=2017-10-20T12:25:35.118+0000)\n>\n> Mhm... Für mich klang der erste Satz mehr nach einem &quot;hier geht es nicht um das Thema, also fangt bitte gar nicht damit an&quot; als nach einer Beschwerde über die Mechanik oder den Schaden der Ult. Aber ich kann mich da natürlich auch irren.... Gedanken lesen ist nicht meine Stärke. xD\n\nAlso wirklich. Gedankenlesen kommt doch in der Grundschule 1. Klasse dran xD","replies":[{"poster":"Sihari","date":"2017-10-20T12:32:15.803+0000","up_votes":1,"down_votes":0,"body":"In der Woche war ich leider Krank und Nachhilfe zu nehmen war zu teuer... q.q","replies":[]}]}]}]}]},{"poster":"MarCommander2211","date":"2017-10-22T10:46:43.333+0000","up_votes":1,"down_votes":0,"body":"Oder töten. :D","replies":[]}]},{"poster":"Archmage3000","date":"2017-10-21T09:06:01.908+0000","up_votes":3,"down_votes":0,"body":"Hm also das ist jetzt wirklich nicht böse gemeint, aber wenn ein paar mittelmäßig animierte Ketten, die für einen kurzen Augenblick auf deinem Bildschirm erscheinen, bei dir Angstzustände auslösen, dann solltest du dir vielleicht wirklich professionelle Hilfe holen. Versteh das bitte nicht falsch, aber so eine krasse Reaktion ist selbst bei Klaustrophobikern nicht normal. Mit etwas professioneller Hilfe schaffst du es bestimmt, deine Angstzustände zu überwinden.","replies":[]},{"poster":"Nuix","date":"2017-10-20T16:29:45.722+0000","up_votes":3,"down_votes":1,"body":"Was ist den mit arachnophobikern? Müßte Elise dann auch gebannt oder optisch umgearbeitet werden?\nAndere haben angst vor Clowns (shaco) oder sogar vor Frauen (gynophobie / Araber).\nDa hätte Riot viiiiiieeeeel zu tun... :)","replies":[]},{"poster":"mondmann97","date":"2017-10-20T12:55:31.847+0000","up_votes":3,"down_votes":2,"body":"Es gehört einfach zum Champion dazu. Wenn es dich dennoch arg stört kannst du Urgot ja bannen.","replies":[{"poster":"Toreole","date":"2017-10-20T13:01:27.385+0000","up_votes":1,"down_votes":0,"body":"naja bans sind dafür da, dass man die bannt, die den eigenen Champion countern oder es einem schwer machen. Ich spiele hauptsächlich ADC und da ban ich lieber was anderes als nen Urgot :)","replies":[{"poster":"mondmann97","date":"2017-10-21T01:02:28.423+0000","up_votes":1,"down_votes":0,"body":"Als Adc wird man aber auch nie von nem Urgot geultet, und selbst wenn, kannst du {{item:3140}} benutzten","replies":[]}]}]},{"poster":"MarCommander2211","date":"2017-10-22T10:50:08.628+0000","up_votes":1,"down_votes":0,"body":"Ich finde es gibt gruseligeres, als von Urgot geultet zu werden in league. Urgot hat kaum Burst und kämpft meist mehrere dutzende Sekunden gegen dich. Das Ende kommt also auf dich zu. Anders als wenn aus dem Gebüsch ein greller Lichtblitz aufzischt und du dann den Hammer von Jayce im Nacken hast.... falls dieser zu diesem zeitpunkt überhaupt noch auf deinen Schultern sitzt.","replies":[]},{"poster":"Zyzyx","date":"2017-10-20T14:45:37.916+0000","up_votes":1,"down_votes":0,"body":"Auch wenn ich persönlich das Problem nicht habe, klingt das sehr nachvollziehbar. Ich empfehle dir dringend diesbezüglich ein Support-Ticket zu schreiben und die darum zu bitten, das Problem weiterzuleiten. \nAlternativ kannst du das Problem auch in den NA-Boards erläutern, da besteht auch die Chance dass Rioter das sehen (idealerweise nicht am Wochenende).","replies":[]},{"poster":"KledRekt","date":"2017-10-20T11:24:10.364+0000","up_votes":2,"down_votes":3,"body":"Kein Kommentar.","replies":[]}]}