{"poster":"Toreole","date":"2018-04-02T15:49:51.978+0000","title":"Macht MR eigentlich noch einen Unterschied?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Die Situation:\r\n- ein Ornn hat ~300 MR mit 4 MR Items ( {{item:3194}} {{item:3001}} {{item:3190}} {{item:3065}} )\r\n- ein Malzahar mit {{item:3135}} {{item:3020}} {{item:3165}} {{item:3285}} benutzt seine Ulti auf diesen Ornn\r\n-&gt; Ornn erleidet ~1200 magischen Schaden (~40% maxHP)\r\n- Malz&#039; E f&uuml;gt 800 Schaden danach zu.\r\n\r\nWenn ein Fulltank so schnell schmelzen kann... Ist es da &uuml;berhaupt noch sinnvoll, sich auf MR zu verlassen und welche zu kaufen, oder sollte man lieber nur {{item:3194}} und danach nur noch Leben kaufen?\r\n\r\nWenn ein Full-build ADC an einem Tank mit 4 defensiven Items mit einem kritischen Treffer keine 700 Schaden machen kann, warum l&auml;sst magischer Schaden einfach jeden schmelzen?\r\n\r\nUnd warum hat so gut wie jeder Champion fast 2x so viel R&uuml;stung wie MR? ( lvl 18 Ornn z.Bsp: 84 / 53 )\r\nDa fehlen ab lvl hohe Werte an Magieresistenz. Da ist es doch klar, dass magischer Schaden einfach alles zerst&ouml;rt. \r\n\r\nSo wie ich das sehe ist das kein gesundes Design. (liegt vielleicht auch einfach an dem Champion).\r\n\r\n- MfG Toreole","replies":[{"poster":"SSI CptHaunted","date":"2018-04-03T09:00:02.038+0000","up_votes":1,"down_votes":0,"body":"Meine Meinung dazu:\n\nDie Stärke von Tank-Items ist abhängig von der Phase in der das Spiel sich befindet und full Tank ist im Lategame schwach. So gut wie jeder hat im Full Build genug Durchdringung sodass man nur noch im Team und mit CC punkten kann. Das Schmelzen kann man einzig mit Stoneplate und Schilden wie Locket verhindern, dies ist aber nicht speziell Mages zuzuschreiben, sondern der Tatsache, dass der im Lategame verfügbare Damage schon recht heftig ist. Dein Job als Tank ist es also nur noch deinem Team durch einen Engage oder mit CC einen Engage verhindernd im Teamfight einen Vorteil zu verschaffen und möglichst viel Schaden auf dich zu ziehen, letzteres tust du wenn du dahin schmilzt und damit kommt es dann drauf an was dein Team in der Zeit tut.\n\nProblematisch sehe ich das Verhältnis von Armor zu MR eigentlich nicht, schließlich kann man den Unterschied durch den Itembuild anpassen und auf beiden angemessene Werte erreichen, für einen Tank also am Wenigsten ein Problem.","replies":[]},{"poster":"0qbix3","date":"2018-04-02T16:23:19.437+0000","up_votes":1,"down_votes":0,"body":"Es macht sehr wohl sinn das man schlechter gegen Mages vorgehen kann als gegen Physical damage dealer. Größter Faktor ist: Mages sind an spells gebunden die eine (teilweise sogar sehr lange) abklingzeit haben währendessen AD champions einfach sowohl spells haben die auf Ad skalieren als auch autoattacks die mega reinhauen. Wenn dich ein Malzahar autoattacked, kitzelt dich das eher. Malzahar ist in diesem Falle aber sehr schwer zu beurteilen da er einfach sehr strong gegen tanks ist aber als beispiel könnte man auch Brand nehmen gerade mit {{item:3151}} . Aber wie du bereits sagtest {{item:3194}} Countered solche champions. Aber gegen 'normale' mid mages wie {{champion:61}} {{champion:134}} {{champion:103}} ist Magic resitenz immernoch sehr effektiv","replies":[]}]}