{"poster":"Z3ng","date":"2015-07-19T08:42:47.987+0000","title":"Nasus, avagy egy megérett hős a \"nerf-re\"","subforum":"Hibabejelentés","up_votes":1,"down_votes":5,"body":"Sziasztok, azt szeretn&eacute;m meg tudni, hogy a k&ouml;zel j&ouml;vőben v&aacute;rhat&oacute; Nasus-ra nerf, mivel nagyon &quot;OP&quot; ?\r\nT&ouml;bb meccs folyam&aacute;n &eacute;szre vettem azt , hogy egy Nasus megnyer egy eg&eacute;sz meccset az ő Q- skillj&eacute;vel, rettentő egyszerű fel stackelni &eacute;s semmi kock&aacute;zat nincs ugye b&aacute;r hal&aacute;lakor semmit nem vesz&iacute;t ebből a stack-ből. Szerintem nagyon rontja a j&aacute;t&eacute;k &eacute;lm&eacute;ny mikor egy ilyen hőst v&aacute;laszt az ellenf&eacute;l vagy ak&aacute;r a csapatt&aacute;rsunk is. Szer&eacute;ny v&eacute;lem&eacute;nyem szerint meg&eacute;rett egy nerf- re vagy &aacute;tform&aacute;l&aacute;sra mivel ez &iacute;gy nagyon nem j&oacute;! T&ouml;bb j&aacute;t&eacute;kos t&aacute;rsam is jelezte fel&eacute;m!\r\nB&aacute;rmi megold&aacute;s?\r\nK&ouml;sz&ouml;n&ouml;m, sziasztok!","replies":[{"poster":"YiJaegar","date":"2015-07-19T09:23:05.508+0000","up_votes":1,"down_votes":0,"body":"Megoldás játssz nasus-szal és meglátod, hogy a kerítés nincs kolbászból, azaz nem könnyű vele, ha megfelelő hőst hoznak ellene ami erős a játék korai szakaszában és kizónázza gyakorlatilag csak hal egész játékban","replies":[{"poster":"Notorispvp","date":"2017-11-03T22:10:38.636+0000","up_votes":1,"down_votes":0,"body":"Szerintem legalább 1  szuper kari maradjon mert én nagyon szeretem a Nasust","replies":[]}]},{"poster":"Z3ng","date":"2015-07-19T23:44:40.702+0000","up_votes":1,"down_votes":0,"body":"Azért szerintem az elég érdekes, hogy 1v4 be veri a teamet bármilyen is a meccs mert mi vittük volna, de az a nasus 4v1 be vagy 5v1 be leverte a csapatot hihetetlen, tornyok , drake, kill minden a mi javunkra szolgált és még is egy nasus jött és nyert :D\nHozzá teszem ez nem az első eset!","replies":[{"poster":"YiJaegar","date":"2015-07-21T14:46:34.166+0000","up_votes":1,"down_votes":0,"body":"Ne tudtok ellene játszani ennyi nem szabad hagyni hogy 50+ percig farmoljon ugyan úgy ahogy veigart se, sőt sion is ez a kategória (bár mióta nincs atma nem bírja offensive statá alakítani a végtelenül stackelődő életét). \nEzek a hősök azért erősek a játék végén mert ők a full 6 tárgy+potion után is tovább tudják erősíteni magukat a végtelenségig, ha hadják farmolni őket. \nLényeg játék elején be kell zúzni nem engedni farmolni később ki kitolni (nem engeded magadhoz közel és lesebzed) illetve a {{item:3047}} és a {{item:3075}} elég hatásos ellene mivel nem sűrűn vesznek neki armor pent és a q-ja alaptámadásnak számít.","replies":[]}]},{"poster":"M4dr4c","date":"2015-07-19T08:44:45.723+0000","up_votes":1,"down_votes":0,"body":"Csak akkor egyszerű Nasusnak stackelni a Q-t, ha az ellenfele hagyja neki. Semmi baj nincs vele, vigyél ellene egy Teemot mondjuk.","replies":[{"poster":"Sz1ke","date":"2015-07-20T12:49:23.985+0000","up_votes":1,"down_votes":0,"body":"Vagy egy Dariust és megölöd lvl2-n, pláne ha van rajtad egy Red is.","replies":[]}]},{"poster":"Tazsam","date":"2015-07-20T04:19:14.939+0000","up_votes":1,"down_votes":0,"body":"Ahogy én látom nasus win rate kevesebb mint 50% mindezt úgy, hogy a meccsek 1%-ban sem pickelik. Tehát se nem op se nem populáris. Játszani kell ellene tudni.","replies":[]},{"poster":"Tetth","date":"2015-07-19T18:41:28.908+0000","up_votes":1,"down_votes":0,"body":"Verjem meg neked bármikor ösvényen? Abszolút könnyű ellene pickelni és ha nem hagyod farmolni akkor oda az ereje is. Semmi értelme nerfelni, már majdnem high risk high reward champ.\n\n(A \"verjem meg neked\" irónia volt, egy hamar nem fogom újra stresszeltetni magam ezzel a játékkal. :D)","replies":[]},{"poster":"Norb Cena","date":"2015-07-19T15:00:06.699+0000","up_votes":1,"down_votes":0,"body":"Megoldás: tanulj meg játszani ellene. Nincs olyan champion toppon ami ne verné el Nasus-t lanen. Teamfightban meg irtózat egyszerű kiteolni, lévén nincs gapclose képessége.","replies":[]},{"poster":"SS Enforcer","date":"2015-07-19T10:34:38.289+0000","up_votes":1,"down_votes":0,"body":"Személyes tapasztalatom alapján nasus legnagyobb ereje az, hogy az emberek szarnak attól, hogy \"jaj jaj négyszáz stack mi lesz itt gyerekek\"\n\nÉn is hasonló véleményen voltam mint te, ezért fogtam magam és kipróbáltam Nasust, és harminc percet rááldoztam arra, amíg összeszedtem hétszáz stacket.\n\nAkkor azt gondoltam, hogy na akkor most mindenkit jól szétszedek, és természetesen nem így történt, mert nasus egy lassú, gapclosermentes, ingyen kitefogó, és akár végtelen mennyiségű stackje is lehet, de egy Janna/morgana/vayne/vel'koz/ etcetera etcetera úgyis ki fog rajta fogni. Ezért nem akkora rajtam a nyomás, ha az ellenfélnél ott leselkedik egy free farmos nasus, mert\n\n\n1. Ha minél kevesebb időt és egyéb dolgokat ölünk bele abba, hogy nasust távol tartsuk a tornyainktól, annál inkább fog úgy kinézni a játék, mint egy 4v5\n\n\n2. Szarrá lehet kiteolni","replies":[]}]}