{"poster":"OrganicT","date":"2015-07-25T06:39:28.020+0000","title":"Fiora Suggestions","subforum":"Gameplay","up_votes":2,"down_votes":0,"body":"So it&#039;s been a few days since   Fiora rework is released on PBE and there is thing that isn&#039;t working or make her kit way to easy to counter and make her unplayable currently. So i had a few suggestion:\n\nDuelist&#039;s Dance (Passive)\nFiora identifies Vitals on nearby enemy champions. Fiora will reveal a new Vital after striking the last one, or after 15 seconds.\nWhen  strikes a Vital, she deals 3 (+.028 - .045 AD )% of the target&#039;s maximum health in true damage, receives [20% base, increases to 30/40/50% based on R rank ] increased movement speed that decays over 1.75 seconds, and recovers [20 + 5.9 per level] health.\n\n(Personally i love the way her passive as been pushed from just a boost of health regen on old  . However the passive Vital, is sometime not responding on autoattack, or don&#039;t log in the correct angle and just don&#039;t work, so it should be looked at. Another thing that would need a change is the heal she get because currently, if you Q or autoattack your enemy for passive heal, you get minion aggro which deny the heal as minions will hit you for more damage than the base heal. It should be either buffed, or heal over second.)\n\nLunge (Q)\n25/30/35/40/45 Mana\n18/16/14/12/10 sec Cooldown\nRange: [400]\nFiora lunges in a direction and slashes a nearby enemy, dealing 65/75/85/95/105 (+.55/.7/.85/1.0/1.15 bonus AD) physical damage and applying on-hit effects. This attack prioritizes Vitals and targets in kill range.\nIf this ability hits an enemy, 60/60/60/60/60% of its cooldown is refunded.\n\n( Here is the main problem, old used to be able to Lunge twice, yes it was targeted so you couldn&#039;t use it as escape unless you had enemy minions or champion to use it backward. However, you were able to do a great combo such a Lunge+autoattack+Lunge+autoattack wich was taking half of enemy HP level 2. Currently, even with the on-hit effect added, it barely do the half damage of the old Lunge. The ratio and the base damage, should be buffed a bit. The cooldown refund is okay i beleive for level 5, but you need 40% cooldown reduction to use it to it&#039;s max potential, so maybe earlier level refund a bit more of the cooldown and make it at 60% at level 5 so when you will be at this point, you will be either close or at 40% cooldown reduction. Rest is quite fine for me as it provide an escape tool.)\n\nRiposte (W)\n50/50/50/50/50 Mana\n21/19.5/16.5/15 sec Cooldown\nRange: [750]\nFiora parries all incoming damage and disables for the next 0.75 seconds and then slashes in the target direction\nThe slash deals 90/130/170/210/250 (+.6 AP) magic damage to the first enemy champion and slows their movement and attack speed by 50% for 1.5 seconds.\nIf  parries an immobilizing disable, Riposte stuns instead of slowing.\n\n(This skill would be great but they added some problem to it. The delay before the counterattack goes out, is way to slow. Since now  also proc on-hit with her Q, Trinity force became more appealing as if she get 40% cooldown reduction, level 5 Lunge have 2 second cooldown before new activation. So you can make a full use of Sheen proc (1.5 second cooldown), so i beleive the AP ratio could be buffed back to 1=1 AP so we can make use of the small amount of AP from trinity force and baron buff as a small damage counter attack that can be used to kill minions farther but you can&#039;t risk to go autoattack because you would get in kill range for your opponent.)\n\nBladework (E)\n40/45/50/55/60 Mana\n15/13/11/9/7 sec Cooldown\nFiora gains 50% increased attack speed for the next two attacks. The first attack cannot critically strike, but applies a 1 second 25/35/45/55/65% slow. The second attack is guaranteed to critically strike for 140/155/170/185/200% damage\n\n(As i like the new slow addition and garented critical,  lost of her attack speed boost ( 120% attack speed boost for 3 second ) so i suggest that we keep this slow/critical but when the two autoattack is done, she keep the attack speed for a 2 bonus second. The attack speed bonus should be buffed to 75%~100%, 50% is to much of a lost next to her 120%.)\n\nGrand Challenge (R)\n100 Mana\n110/90/70 sec Cooldown\nRange: [500]\nFiora reveals all four Vitals on the target champion, for a potential [4x damage of passive] % max health true damage. In addition,   Fiora gains Duelist Dances&#039;s movement speed bonus (30/40/50%) while near the target.\nIf Fiora hits all 4 Vitals in 8 seconds or if the target dies after she has hit at least one, Fiora and her allies in the area are healed for 80/110/140 (+.6 AD) each second for 5 seconds.\n\n(I like the idea of successful challenge, you get the applause so you get healed, however, hit the 4 spot (without your enemy dieing), is extremely, and i mean it, EXTREMELY difficult. I beleive they should add another option over the heal, that maybe increase the damage dealt but, you don&#039;t get healing, and all you have to do is autoattack facing your opponent, so you only have 1 Vital to focus and attack, but you don&#039;t get the healing circle after 4 successful proc, so maybe you will kill your opponent but you won&#039;t get a safety heal to either make you win against incoming champion trying to take you down, so you will most likely have to retreat, or die, giving more risk to just auto attack the same spot. If  peirce all 4 different Vital, she keep the same damage as she have right now, maybe toning down the ratio of the true damage since she choosed the utility path but increasing the Healing ratio. So she is able to continue to fight on extended teamfight for exemple. It would open the utility on teamfight moment, but the other way would give a chance to be able to win in solo lane against opponent who face you and don&#039;t give a chance to autoattack on every side( Mobility creep).\n\nThis is my idea over her kit overhaul. I hope you will like it.\n\nHere my other concern, Visual Update.\nThey made a small patch today, fixing her base skin hair and face, including the splashart. This is already better than the granny Fiora  we saw in the past few day. However, her Royal Guard  is still not what people expected, Raven Fiora  is fine now, it used to be bad in game but have a nice splash art, but they did it well, same for Headmistress. But Royal guard model, got destroyed. I was always using this skin as i liked her hairstyle being black, and her suit looked like a real Royal Guard, it wasn&#039;t to much, currently she look like a old lady wearing a hat, going to grocery store. Only missing a paper bag. She doesn&#039;t fit anymore the Royal guard fantasy, it need to be fixed. She need her face back/hair back. Her suit need to be changed and color to be lighten up a bit.\n\nHer walking animation need to be changed as well, it feel really ridiculous to play  with this moon walking animation. It need to be more realistic, because currently, it&#039;s not what we expected at all.\n\nOne last suggestion would be, as every character who got remodeled lately, can we get a recall animation for  ? It would be the cherry on the cake.\n\nThanks for listening to my suggestion, i really look forward to be heared by Riot, because i loved  from her creation date until now. Please don&#039;t make me stop play Fiora because her kit is not anymore fitting what i first loved on her.\n\nGabriel.\n\n\nUpdate 2015/07/25 3:38 AM : Q Targeting need to be looked at, often you try to Q to champion but for some reason, it target near minion, it should be automatically targetted to nearby champion if there is a champion on the circle. Minion if there is no champion in the range of the Q.\n\nLunge should also apply her E, either the slow if you don't autoattack, or the critical if you decide to land a first autoattack to slow your enemy and than Q who apply the critical strike.","replies":[{"poster":"Critmaster Garen","date":"2015-07-25T07:08:04.716+0000","up_votes":3,"down_votes":0,"body":"she definitely needs a couple of tweaks to her q targeting. its set up really weird, where it will sometimes strike a minion on low health over a mark on a champion, even though hes technically in range.\n\ntbh, i dont know why you would ever want to strike a minion, when there is an enemy champion in the circle. mark or not.\n\nin that case its safe to assume, that we always rather want to poke at the champion. since the q is supposed to apply on hit effects, it should probably also trigger her e.\n\nmaybe they were just concerned about her lane pattern, that she would activate e, dash at an angle to trigger a mark and too easily retreat while the enemy is slowed. and then hit a crit in case he does follow her.\n\n\ni think in additin to the entire automated targeting system, they could just have her strike the unit that we actively select. meaning, if i select the enemy champion, she will attempt to strike that as her highest priority target if hes in the circle upon using the q. would give us a way to kindof manage the entire thing and select the priority targets ourselves.","replies":[{"poster":"OrganicT","date":"2015-07-25T07:36:36.392+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Critmaster Garen,realm=NA,application-id=3ErqAdtq,discussion-id=JwJ3NWE0,comment-id=0000,timestamp=2015-07-25T07:08:04.716+0000)\n>\n> she definitely needs a couple of tweaks to her q targeting. its set up really weird, where it will sometimes strike a minion on low health over a mark on a champion, even though hes technically in range.\n> \n> tbh, i dont know why you would ever want to strike a minion, when there is an enemy champion in the circle. mark or not.\n> \n> in that case its safe to assume, that we always rather want to poke at the champion. since the q is supposed to apply on hit effects, it should probably also trigger her e.\n> \n> maybe they were just concerned about her lane pattern, that she would activate e, dash at an angle to trigger a mark and too easily retreat while the enemy is slowed. and then hit a crit in case he does follow her.\n> \n> \n> i think in additin to the entire automated targeting system, they could just have her strike the unit that we actively select. meaning, if i select the enemy champion, she will attempt to strike that as her highest priority target if hes in the circle upon using the q. would give us a way to kindof manage the entire thing and select the priority targets ourselves.\n\nForgot to add this, thanks for the info i'll update.","replies":[]}]},{"poster":"Knight SoIaire ","date":"2015-07-25T12:16:31.066+0000","up_votes":1,"down_votes":0,"body":"i think that her w should get an ad ratio thou \n\nher old w didnt get onesimply because it was an utility spell ... not meant to do much in her kit \n\nher new w is diferent ... closer to the core to her gameplay \n\nallowing it to deal only base damage seems kinda wrong","replies":[]},{"poster":"Shénzhì","date":"2015-07-25T12:09:38.530+0000","up_votes":1,"down_votes":0,"body":"LUNGE [Q] + GRAND CHALLENGE [R]\n\n* Have her ultimate allow Lunge to be more useful in maneuvering. Each Vitals hit reducing Lunge cooldown.\n* It could be as it prioritizes Vitals it does so as you  Lunge 'through', hitting the Vital on the opposite side.\n\nskill. speed. chance to survive with Lunge.","replies":[]},{"poster":"Droogzy","date":"2015-07-25T08:08:11.932+0000","up_votes":1,"down_votes":0,"body":"Her ultimate is difficult to pull off I've found, in most cases, I've found it easier just to hit one Vital on a low hp target and then kill to get the heal off.","replies":[{"poster":"OrganicT","date":"2015-07-25T10:56:30.192+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Droogzy,realm=NA,application-id=3ErqAdtq,discussion-id=JwJ3NWE0,comment-id=0002,timestamp=2015-07-25T08:08:11.932+0000)\n>\n> Her ultimate is difficult to pull off I've found, in most cases, I've found it easier just to hit one Vital on a low hp target and then kill to get the heal off.\n\nSadly and it make me sad because you can't really use it to full potential during laning phase since you are facing your opponent and they won't give you the chance to reach the whole 4 Vital.","replies":[]}]},{"poster":"Hupsis","date":"2015-07-25T08:00:23.441+0000","up_votes":1,"down_votes":0,"body":"My suggestions/feedback.\n\nPassive - less ad ratio, a bit more healing.\n(late game ad Fiora in PBE can do 20% max health as true damage from one vital. I think 15% should be the cap)\n\nQ - Fine.\n\nW - Fine. other than having a long cd at early ranks. Could deal more damage to minions though.\n\nE - I think it would be cool if last hitting a minion wouldn't consume the enhance on the auto attack (the critical enhance to be exact). This would give her a bit more wave clearing and possibly remove the need for Hydra together with the W doing more damage to minions.\n\nR - I like the ult. No need to change it. There's a bug however that sometimes denies the healing aoe when killing a target with Fiora's ult. Maybe she has to be the one killing the target by hitting a vital :/\n(Another idea I had was that Fiora could lock the current vital for three hits and each hit to that vital would be more powerful (+5% true damage and +50 healing). It would probably be too easy to hit them and wouldn't be as fancy as the current one)\n_____\n\nThe main problem with Fiora is that she lacks wave clearing. She HAS to buy hydra which restricts her freedom of item choice.\n\nAnother problem I faced is that she's terrible against super minions. I think the vitals should also apply to them.","replies":[]}]}