{"poster":"Rew711","date":"2015-07-13T20:18:33.999+0000","title":"So, you're making a completely new item, Riot?","subforum":"[ARCHIVED] Miscellaneous","up_votes":54,"down_votes":10,"body":"You aren't changing Zeke's Herald. In fact, the only similarity is Zeke in the name. You making a complete new item here. \r\n- New icon\r\n- New passive\r\n- Gained Active\r\n- Loses AD buff\r\n- –10% CD reduction\r\n- replaces health bonus with mana bonus\r\n- Gain's armor\r\n- No lifesteal\r\n\r\nYou guys should just change it to say Harbinger and keep the original Zeke's Herald. The new item is nice, but majority of supports would rather Zeke's Herald. So, why not have both?","replies":[{"poster":"Rinky Dinky","date":"2015-07-14T00:08:56.284+0000","up_votes":36,"down_votes":1,"body":"\"Majority of Supports would rather take Zekes\"\n\nlol these forums crack me up","replies":[{"poster":"B1naryB0t","date":"2015-07-14T02:03:56.683+0000","up_votes":8,"down_votes":1,"body":"Butbut, think of when i play {{champion:40}} blowy-blowy girl?\ny wuld i take mana, ap, and armor over health? health is the best defensive stat ever, perfect for tank blowy-blowy girl\ny wuld i give 1 ally 20% ap or 50% crit? i can give ALL allies 10% lifesteal and 20 ad. thats what mages want, for when spells are off cd.","replies":[{"poster":"Rew711","date":"2015-07-14T02:25:29.598+0000","up_votes":3,"down_votes":4,"body":"But... It does benefit Janna... You can build AP, build this random item, and now your E gives +50 (+10% AP) +20 AD. You can give past 110 AD easily. And the cool down is -20% rather than just -10%. It may not seem like much, but it can help.","replies":[{"poster":"Hyrum Graff","date":"2015-07-14T22:25:26.809+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Rew711,realm=NA,application-id=cIfEodbz,discussion-id=Ebg9RvrA,comment-id=000500000000,timestamp=2015-07-14T02:25:29.598+0000)\n>\n> But... It does benefit Janna... You can build AP, build this random item, and now your E gives +50 (+10% AP) +20 AD. You can give past 110 AD easily. And the cool down is -20% rather than just -10%. It may not seem like much, but it can help.\n\nI think you missed the /s.","replies":[]}]}]},{"poster":"JC DarkOmen","date":"2015-07-14T23:42:45.584+0000","up_votes":1,"down_votes":0,"body":"hey, this is serious. all 7 of the people who (purposefully) build Zeke's Herald are freaking out","replies":[]}]},{"poster":"Kuroi86","date":"2015-07-13T23:42:20.026+0000","up_votes":23,"down_votes":0,"body":">The new item is nice, but majority of supports would rather Zeke's Herald. \n\nThis made me lol.\nTried looking up the build rate for the item, couldn't find a site that gave it above a 0% build rate...","replies":[]},{"poster":"Ironclad Dragon","date":"2015-07-13T20:19:24.105+0000","up_votes":17,"down_votes":1,"body":"I've never seen someone build Zeke's Herald. It's very niche.","replies":[{"poster":"brad","date":"2015-07-13T22:12:59.008+0000","up_votes":13,"down_votes":1,"body":"> [{quoted}](name=Dragonzzilla,realm=NA,application-id=cIfEodbz,discussion-id=Ebg9RvrA,comment-id=0000,timestamp=2015-07-13T20:19:24.105+0000)\n>\n> I've never seen someone build Zeke's Herald. It's very niche.\n\nfucking shit ive never seen anyone build god damn {{item:3124}} but lets remove zeke's because nobody builds it","replies":[{"poster":"BlunterMonk","date":"2015-07-13T22:49:08.421+0000","up_votes":6,"down_votes":1,"body":"{{item:3124}} is very good on supports I find. I build it :D","replies":[]},{"poster":"B1naryB0t","date":"2015-07-14T01:58:50.434+0000","up_votes":2,"down_votes":0,"body":"To be fair, Riot has said that they don't like auras because they're invisible power. Especially since their only interaction is standing near someone.","replies":[]},{"poster":"The Bíg Ticket","date":"2015-07-13T22:49:04.126+0000","up_votes":2,"down_votes":1,"body":"I build it all the time on Jax and Kayle...they completely wreck with that item.","replies":[]}]},{"poster":"Rew711","date":"2015-07-13T20:23:18.619+0000","up_votes":6,"down_votes":4,"body":"I build it on my supports all the time. I even see how it gives a (amazing) bonus to my ADC and others. That extra 10% life steal is nice to have when you are going head on with the other ADC + support. My support can get up to 38% with the core items like BotRK, BloodThirster, and Essence Reaver. I can push it to 48%, easy. And from a good distance too.","replies":[{"poster":"DrinkMoreWhiskey","date":"2015-07-13T22:10:02.255+0000","up_votes":3,"down_votes":10,"body":"> [{quoted}](name=Rew711,realm=NA,application-id=cIfEodbz,discussion-id=Ebg9RvrA,comment-id=00000000,timestamp=2015-07-13T20:23:18.619+0000)\n>\n> I build it on my supports all the time. I even see how it gives a (amazing) bonus to my ADC and others. That extra 10% life steal is nice to have when you are going head on with the other ADC + support. My support can get up to 38% with the core items like BotRK, BloodThirster, and Essence Reaver. I can push it to 48%, easy. And from a good distance too.\n\nIt's a noob trap... *looks at your profile*\n\nYep everything here checks out.","replies":[{"poster":"Sozan5","date":"2015-07-14T02:48:28.851+0000","up_votes":4,"down_votes":5,"body":"Except that Zeke is not a noob trap...\n\nYou really get your money's worth for this item... The gold efficiency might be the best in the game, maybe outside fully stacked Sword of the Occult and Mejai Soulstealer.\n\nI can't say I build this item often, but I tend to build it if we are ahead on lane - especially if I took a few kills as a support. The only downside this item have is the fact that it's a cheap item, so it might be somewhat slot inefficient in late game.","replies":[{"poster":"DrinkMoreWhiskey","date":"2015-07-16T08:17:53.136+0000","up_votes":1,"down_votes":0,"body":"Lol you mean you build it when you play support renkton in normals?  lmfao .... Yea you got me it's not a noob trap","replies":[{"poster":"Sozan5","date":"2015-07-16T11:30:07.705+0000","up_votes":3,"down_votes":0,"body":"See? It's a very effective item when you are playing support Renekton. And honestly - he's not that bad of a support (I was surprised myself).\n\nRegardless... This is not a noob item, as there are situations in which it's good - it's just a very niche item and you need to know when to build it.","replies":[]}]},{"poster":"Frikgeek","date":"2015-07-14T19:54:31.857+0000","up_votes":2,"down_votes":1,"body":"It really is a noob trap as most people on your team won't even be able to use the 20 AD and 10% lifesteal they've been given. Toplaners and are mostly tanks or ability-based bruisers. Some of them might be able to use the AD but most of them deal more damage with their abilities than their autoattacks. AD assassin midlaners aren't very common so you'll end up with 1 person(the adc) being able to fully utilise the item. \n\nA righteous glory, Talisman, or even a real tank item like Randuin's would be a lot better for a support.","replies":[]}]},{"poster":"Rew711","date":"2015-07-13T23:12:34.137+0000","up_votes":3,"down_votes":2,"body":"One day, in my next 10 years of playing. I'll go from noob to semi-good player. Until then, I'll just win games with no Runes and building stuff like this.","replies":[]}]},{"poster":"CubedJustice","date":"2015-07-13T22:11:01.586+0000","up_votes":3,"down_votes":2,"body":"Why would you build essence reaver? Like, ever? I remember there was a Korean player who had this crazy ADC ezreal build in it, and before that, blue ezreal, but other than specifically on that, Essence Reaver is horrible.","replies":[]}]},{"poster":"OJ191","date":"2015-07-14T02:13:04.841+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Dragonzzilla,realm=NA,application-id=cIfEodbz,discussion-id=Ebg9RvrA,comment-id=0000,timestamp=2015-07-13T20:19:24.105+0000)\n>\n> I've never seen someone build Zeke's Herald. It's very niche.\n\nI built it almost every single game when I was support if we had more than one champion that likes AD autoattacks, not early on but it's a nice finisher when everyone is approaching full builds and you already have crucible and shit.\n\nThough with how stupidly one sided games have been since what feels like forever now, usually I never get to build it. But in those rare close games the extra vamp has often been what tips the scales.","replies":[]},{"poster":"Noam Braumsky","date":"2015-07-14T17:53:20.145+0000","up_votes":1,"down_votes":0,"body":"Niche implies it's useful in certain circumstances.","replies":[]},{"poster":"Ulquiorra995","date":"2015-07-14T14:24:06.867+0000","up_votes":1,"down_votes":0,"body":"And that isn't the reason to remove it. New \"Zeke's Herald\" is a completely different item -new build path, stats, active... Hell, even the new icon and name. Give me one valid reason why we shouldn't keep both. Or niche items should not exist in this game?","replies":[]},{"poster":"Davy Crockett","date":"2015-07-13T20:57:00.978+0000","up_votes":1,"down_votes":1,"body":"I build it if there's an aatrox, im in an off-meta support, or i have nothing else to buy.","replies":[]}]},{"poster":"Caeler","date":"2015-07-14T00:01:21.333+0000","up_votes":7,"down_votes":0,"body":"Zeke's Herald is problematic in that the stats it gives on its own aren't enough to justify buying it. Supports can't make good use of the AD or the lifesteal and the CDR often goes to waste due to the high amount of CDR support items. Other roles have far better appealing items that they can buy. The item is a waste of a slot on the champions that could make good use of the aura and completely terrible on any champion that isn't AD. It's bad on supports because the stats and build path are terrible. It's bad on damage dealers because it doesn't give that much damage. For a support it'd be like if your Irelia top built Abyssal so that your all magic damage team could do more damage.\n\nThe only time Zeke's is worth buying is if you have 3+ physical damage dealers on your team who would heavily benefit from it. Even then, though, it's usually still not worth building over other items. It's a weird situation where the only time the item is really effective is when the other four members of your team are all AD. The problem with this is that your team will all be dealing the same type of damage, so the enemy team will just itemize accordingly and hard counter your team. Making full use of Zeke's usually means you have a terrible teamcomp.\n\nNeither the aura nor the stats have leeway to be buffed. The item is already gold efficient on its own. If you nerf the stats to buff the aura, you only further drive it into its niche. If you nerf the aura to buff the stats, then there really becomes no reason to take it over other items that give the same stats with better utility. If you just buff it, then everybody will start taking it because of its gold efficiency. It could be made better for supports by switching some of the cooldown reduction to more health, but this doesn't change any of its core problems.\n\nThe new Zeke's is a far better step in the right direction for multiple reasons.\n\n**First:** It still retains the \"damage boost\" that the previous aura gave albeit as a charging method instead of a constant aura. It only loses out on the lifesteal.\n\n**Second:** Because it's a charging method instead of a constant aura, it has room for counterplay. You can engage when the charges are low and disengage when the charges are high to avoid the damage boost. It also partially negates the \"invisible power\" provided by the aura (hopefully there will be a visual indicator for the passive).\n\n**Third:** The item's stats make it a good pickup for multiple roles. Mages, supports, and tanks could make good use of the mixed stats it provides.\n\n**Fourth:** It has a better build path. This goes hand in hand with reason #3.\n\n**Fifth:** The passive is useful on pretty much every role. Tanks and supports could use it to boost the damage of a team member. Every other role would like the extra crit/ap.\n\nIn fact, I'd guess that the new item is a little bit too strong. It gives a ridiculous amount of stats for only 2300 gold, and the passive looks monstrous. I guess it'd all depend on how fast the charges accumulate and what the stats for the item are when it actually goes live though.","replies":[{"poster":"Rew711","date":"2015-07-14T02:03:35.817+0000","up_votes":2,"down_votes":5,"body":"Though you made great points, I didn't want to get rid of the new item. I never said it was bad or worse except that I'd miss the original passive on the old one. The item, itself, isn't really meant to be multi-useful for every type of champion because there are those few that will not benefit from the new one as well (but pretty much all supports can use it). \n\nMages that will support usually prefer large AP items. Or at least the ones I play against just get AP. I also believe that all supports can benefit from Zeke's Herald in one way or another. Bard could use the CD reduction, Braum could use the health and CD reduction, Janna, Lulu, and Nami would benefit from CD reduction, Nunu would benefit from the health and CD reduction, Sona would benefit from the CD reduction, Soraka would benefit from both the health CDR, Tahm Kench and Taric definitely benefits from the health and CDR, and even Thresh and Zilean would benefit from the CDR. (The CDR is all I got in this argument to keep it... but tanks like Braum and Tahm Kench then Taric too benefit from its health).\n\nYou can also buff Zeke's Herald. If we raise the gold price of Zeke's Herald to 3300 gold and give it the Bilgewater Cutlass item to buff the damage to 30 to those nearby and allow a active to slow an enemy by 25% for 2 seconds dealing 50 (+50% AP) to the enemy (90 second cool down) and makes the passive inactive until active is back up. It's simple trials that they can put on the PBE that could ask for.\n\nI also wish people wouldn't be so harsh to the item. True, its been just sitting in the shop for a long time now, but it can still be used.","replies":[{"poster":"Caeler","date":"2015-07-14T04:57:19.577+0000","up_votes":1,"down_votes":1,"body":"Zeke's Herald is usually taken for its damage boosting passive. The new Zeke's retains a damage boosting passive even if it is somewhat different. The core idea behind the items remains somewhat similar, so it's not as if the item is entirely different.\n\n>Mages that will support usually prefer large AP items. Or at least the ones I play against just get AP.\n\nI was actually referring to mid lane mages using the item, but bot lane mages could too I guess. The item gives a 20% AP boost when the passive is up, which is pretty massive. I couldn't see them getting it during lane phase or in every game, but it could be useful in certain situations.\n\n>The CDR is all I got in this argument to keep it... but tanks like Braum and Tahm Kench then Taric too benefit from its health\n\nOne of the biggest problems with buying Zeke's is that most support items already give 10% CDR. If you buy Zeke's and then buy two other items then you'll probably hit the CDR cap. Buying any other CDR item means that the stats go to waste, which is part of the problem with Zeke's. Zeke's is actually a bad item for tanks because there are other items that give much better tank stats. Most tank items have at least 400 health and come with resists. Locket only costs 350 more gold while giving 150 more HP, 20 more MR (also 20 MR from aura for a total of 40), and an active at the cost of 10% CDR. Zeke's is just pathetic as a tank item in comparison.\n\n>You can also buff Zeke's Herald. If we raise the gold price of Zeke's Herald to 3300 gold and give it the Bilgewater Cutlass item to buff the damage to 30 to those nearby and allow a active to slow an enemy by 25% for 2 seconds dealing 50 (+50% AP) to the enemy (90 second cool down) and makes the passive inactive until active is back up. It's simple trials that they can put on the PBE that could ask for.\n\nI don't think that would solve any of the problems the item has though. It still doesn't give enough damage to warrant an AD buying it and the stats would still be pathetic for anyone else. It'd also be even more of a gold sink for anyone who can't use it very well on their own, with a build path that's still terrible for supports and tanks (why would they build a vamp scepter?) There's also the possibility that the item is actually so good that it becomes a mandatory buy because of the aura, similar to how Bulwark was.","replies":[{"poster":"Rew711","date":"2015-07-14T15:11:22.109+0000","up_votes":1,"down_votes":0,"body":"Side Note: Just wondering who's down voting me. It doesn't feel good.\n\nI actually talked with my friend on this, who gets up to Gold easily and then just stops so he can get the free skin, and he even said he'd recommend the original Zeke's Herald. You keep putting it down since it only gives 20 bonus damage, but you keep forgetting that it is permanent. For ever shot I'd need to activate the new item, I'd shot 20 damage 10 times to \"activate\" the new item. The total damage would raise to 200 damage able to give rather than just 20% of my AP over the next 6 seconds. It also does not give any bonus damage, it just gives +50% critical damage for the next 6 seconds. My AP and my allies are raised by 20% for 6 seconds. \n\nhttp://1.bp.blogspot.com/-e_UFDSUSJ9A/VaQh6E3O6cI/AAAAAAAAti0/95v_UQS9SkQ/s1600/zee.jpg\n\nThis goes well with my point on the matter, **WHO CARES IF THIS ONE IS BETTER TO MOST?**(who for some reason just want ZH to be gone) why can we not keep Zeke's Herald anyway for those who use it? I prefer giving bonus AD over bonus critical chance. This would had been nicer if it (instead) gave +50 AD for 6 seconds, but critical chance...\n\nYou also asked why I'd put that item on there? Well, then again, ask why Riot made a item where you first get AD and lifesteal before the item itself. The item in discussion is in fact **not pathetic** since it gives free lifesteal and bonus AD already. A BF Sword only gives 50 AD, a BloodThirster only gives 80 AD (and they cost 1550 and 3500 respectively while ZH costs 2450).","replies":[{"poster":"Caeler","date":"2015-07-14T22:45:36.399+0000","up_votes":1,"down_votes":0,"body":">The total damage would raise to 200 damage able to give rather than just 20% of my AP over the next 6 seconds.\n\nWell let's say one person did 200 damage with the original Zeke's and one person gained 20% AP with the new Zeke's. At 500 AP, that's a bonus 100 AP (might be more with Deathcap). Even if the mage only had a .5 AP ratio on all their skills, that's still equivalent to the 200 damage provided by old Zeke's for auto attacks. Comparatively, however, the time to get that damage is much lower because it's on spells instead of 10 auto attacks. Hence, the item is now much better on mages than before. There's no way they're going to be able to throw out all those auto attacks without someone jumping on them.\n\n>I prefer giving bonus AD over bonus critical chance.\n\nCritical chance is actually VERY VERY strong. \n\nFor an example, let's assume we have a level 10 Caitlyn with Infinity Edge and Statikk Shiv. At level 10, Cait has 73 attack damage. Let's also assume she has 11 flat AD from runes (1 quint 9 marks).  With Zeke's aura, runes, and IE, this brings Cait to 184 AD. Her auto attack multiplier for auto attacks is 2.5 because of IE. Her attack speed is ~1.07. Theoretically:\n\n40 of 100 attacks will be crits\n60 of 100 attacks will be normal attacks.\n\n40 x 184 x 2.5 = 18400 physical damage.\n60 x 184 = 11040 physical damage.\n11040 + 18400 = 29440 physical damage in 100 attacks. \nWith an attack speed of 1.07, this takes ~93 seconds.\n29440 physical damage / 93 seconds = **~317 average physical DPS with Zeke's.**\n\nWith no Zeke's:\n\n40 x 164 x 2.5 = 16400 physical damage.\n60 x 164 = 9840 physical damage.\n9840 + 16400 = 26240 physical damage in 100 attacks.\n26240 physical damage / 93 seconds = **~282 average physical DPS without Zeke's**\n\nWith new Zeke's (we're calculating the average dps with zeke's passive up):\n\n+50% crit chance so...\n90 of 100 attacks will be crits\n10 of 100 attacks will be normal attacks\n\n90 x 164 x 2.5 = 36900 physical damage\n10 x 164 = 1640 physical damage\n36900 + 1640 = 38540 physical damage in 100 attacks.\n38540 physical damage / 93 seconds = **~414 average physical DPS with new Zeke's**\n\nSo let's compare these in a fight.\n\n414 physical DPS (new Zeke's) - 317 physical DPS (current Zeke's) = 97 more physical DPS\n97 physical DPS x 6 seconds (new Zeke's passive uptime) = 582 more physical damage before reverting to no Zeke's.\n\n317 physical DPS (current Zeke's) - 282 physical DPS (no Zeke's) = 35 more physical DPS.\n582 physical damage / 35 physical DPS = ~17 seconds.\n\n**It would take ~17 seconds for current Zeke's to catch up after new Zeke's passive ends.**\n\nWith how large of a gap in DPS there is, however, it's highly likely new Zeke's passive would come up again before current Zeke's manages to catch up in damage.\n\nConsidering how current Zeke's only gave 35 more physical DPS than without Zeke's for a champion with two crit items, it's highly unlikely that the aura would make a huge impact on the DPS of champions without crit chance (i.e. you need a bunch of physical damage dealers, preferably with crit, to even out the damage difference which just forces you into a bad teamcomp).\n\nAs the game goes on, the extra AD becomes worse and worse in comparison because endgame ADCs will have around 300 AD. An extra 20 won't make that big of a difference but the 50% crit chance will.\n\nAlthough it's up 100% of the time and it has an aura, the only real advantage current Zeke's has over new Zeke's is the lifesteal. There's also numerous benefits for new Zeke's that I described earlier.\n\n>WHO CARES IF THIS ONE IS BETTER TO MOST?\n\nThe new Zeke's is objectively better than the current Zeke's in almost every way.","replies":[{"poster":"Rew711","date":"2015-07-16T14:44:45.892+0000","up_votes":2,"down_votes":0,"body":"so, you don't care that its not a support item anymore. you just care that you get a OP bonus? . . . .\n\nYou fail to realize, this item is too OP and will be nerfed once it hits live. In fact, I'd do my best to stay away from it as a support main. The critical strike is too high. The bonus AP is too high. You don't gain bonus damage, so my \"ADC\" will only get bonus AP and 50% critical for 6 seconds. Don't you even see this will be nerfed? If as a mage, mid or otherwise, gets 20% bonus what he/she has (say 1000 AP) he/she would get a huge bonus easily (200 AP). It only grows as their AP grows, so imagine if Veiger (who I can get up to 1600 AP easily with) get 20% bonus (320 AP), he will have a crazy amount (1920 AP). We just got buffed AP items. But honestly, I'm done with this. I'm done with your lame arguments and the fact you can't see that Zeke's Herald was OP in its own way.","replies":[{"poster":"Caeler","date":"2015-07-16T16:50:35.962+0000","up_votes":1,"down_votes":0,"body":"So I realized as I was writing this reply that I messed up the numbers from my previous calculations because I didn't factor in the attack speed provided by Statikk Shiv. I went ahead and fixed that. The overall result didn't really change.\n\n>so, you don't care that its not a support item anymore. you just care that you get a OP bonus? . . . .\n\nNo, I probably won't even build this item. Support is my least favorite role and I'm too selfish to build an item that forces me to rely on an ally to do the damage. Same reason why I almost never build Aegis outside of Support. And I totally didn't give any reason to believe that the change was good other than for the stats right? Right? Maybe better build paths and ease of use?\n\n>You fail to realize, this item is too OP and will be nerfed once it hits live. In fact, I'd do my best to stay away from it as a support main. The critical strike is too high. The bonus AP is too high.\n\nLast paragraph of my very first comment. Whether it gets nerfed before it hits live doesn't matter as long as it becomes a usable item. In it's current state it's never used.\n\n>If as a mage, mid or otherwise, gets 20% bonus what he/she has (say 1000 AP) he/she would get a huge bonus easily (200 AP). It only grows as their AP grows, so imagine if Veiger (who I can get up to 1600 AP easily with) get 20% bonus (320 AP), he will have a crazy amount (1920 AP).\n\nIt has an uptime of 6 seconds. That means if you aren't already in the fight, you have to engage AND use all your spells within the remaining timeframe in order to get that extra damage. 1000 AP is pretty unrealistic by the way. Most people get around 800 AP tops. It'll probably get nerfed anyways.\n\n>I'm done with your lame arguments and the fact you can't see that Zeke's Herald was OP in its own way.\n\nZeke's isn't even close to OP. It's so bad that it never sees use. A quick glance at its stats on lolking suggests that it appears in around .16% of games. That's **16 in 10000** games. If it was OP in any way, more people would be using it.\n\nFurthermore your entire response was basically you just claiming that the new Zeke's is OP as if that somehow discredits any of what I said. The only thing it being OP would affect in my arguments is the DPS calculation.\n\n For the sake of argument, let's assume the critical chance is nerfed to 25% and reuse those Caitlyn examples. For these examples I will refer to this theoretical Zeke's as \"nerfed Zeke's\"\n\nI calculated previously that the **average physical DPS with current Zeke's would be 317.**\n\nWith nerfed Zeke's:\n\n65 x 164 x 2.5 = 26650 physical damage\n35 x 164 = 5740 physical damage\n26650 + 5740 = 32290 physical damage in 100 attacks.\n32290 physical damage / 93 seconds = **~347 average physical DPS with nerfed Zeke's**\n\n347 physical DPS - 317 physical DPS = 30 more physical DPS\n30 x 6 = 180 physical damage.\n\nI calculated previously that the **average physical DPS without Zeke's would be 282.**\n\n317 physical DPS - 282 physical DPS = 35 more physical DPS.\n180/35 = ~5 seconds for current Zeke's to overtake nerfed Zeke's.\n\nSomeone else mentioned that new Zeke's charges about twice as fast as Statikk Shiv. Assuming they aren't wrong, the damage on this nerfed Zeke's would be about equivalent to the damage provided by current Zeke's for one person at least based on how quickly the passive would be back up. The aura would throw the numbers in favor of current Zeke's. \n\nHowever, new Zeke's would still have an edge in better build path and stats which, along with its very small niche, are the key problems that prevent current Zeke's from being good. Also keep in mind that this is all neglecting any bonuses the support is getting from the item as some people build AP on their supports and would get 20% bonus AP (which would probably get nerfed to 10% or something).\n\n**If we factored in lategame the numbers would tilt back towards nerfed Zeke's** as I will demonstrate using Caitlyn again.\n\nFor an example, let's assume we have a level 17 Caitlyn with Infinity Edge, Berserker's Greaves, Statikk Shiv, Bloodthirster, and Last Whisper. At level 17, Cait has 97 attack damage. Let's also assume she has 11 flat AD from runes (1 quint 9 marks). With Zeke's aura, runes, IE, BT, and LW, this brings Cait to 328 AD. Her auto attack multiplier for auto attacks is 2.5 because of IE. With Berserker's and Statikk, she reaches an attack speed of ~1.42.\n\n40 x 328 x 2.5 = 32800 physical damage.\n60 x 328 = 19680 physical damage.\n32800 + 19680 = 52480 physical damage in 100 attacks.\nWith an attack speed of 1.42, this takes ~70 seconds.\n52480 physical damage / 70 seconds = **~750 average physical DPS with Zeke's.**\n\nWith no Zeke's:\n\n40 x 308 x 2.5 = 30800 physical damage.\n60 x 308 = 18480 physical damage.\n30800 + 18480 = 49280 physical damage in 100 attacks.\n49280 physical damage / 70 seconds = **~704 average physical DPS without Zeke's**\n\nWith nerfed Zeke's:\n\n65 x 308 x 2.5 = 50050 physical damage\n35 x 308 = 10780 physical damage\n50050 + 10780 = 60830 physical damage in 100 attacks.\n60830 physical damage / 70 seconds = **869 average physical DPS with nerfed Zeke's**\n\n869 physical DPS - 750 physical DPS = 119 more physical DPS\n119 physical DPS x 6 seconds = 714 more physical damage\n\n750 physical DPS - 704 = 46 more physical DPS\n714 physical damage / 46 physical DPS = **~16 seconds for current Zeke's to catch up after nerfed Zeke's passive ends.**\n\nAs I stated before, the passive would just come up again and current Zeke's wouldn't be able to catch up.\n\nWe could probably nerf this again to 20 or even 15%, but the results would probably be the same except current Zeke's would be better early game.","replies":[]}]}]}]}]}]}]},{"poster":"Sukishoo","date":"2015-07-14T22:27:06.628+0000","up_votes":4,"down_votes":0,"body":">majority of supports would rather Zeke's Herald.\n\nSince when? LOLOLOL","replies":[]},{"poster":"sp441","date":"2015-07-14T02:13:16.798+0000","up_votes":5,"down_votes":1,"body":">majority of supports would rather Zeke's Herald.\n\nUhn? Objection? I've never seem anybody ever build a Zeke's Herald. Ever.","replies":[]},{"poster":"SociopathFriend","date":"2015-07-14T02:43:23.929+0000","up_votes":6,"down_votes":2,"body":"> [{quoted}](name=Rew711,realm=NA,application-id=cIfEodbz,discussion-id=Ebg9RvrA,comment-id=,timestamp=2015-07-13T20:18:33.999+0000)\n>\n> The new item is nice, but majority of supports would rather Zeke&#039;s Herald. So, why not have both?\n\npfft, nobody builds Zeke's herald; I know this because I'm one of the people that actually tries building it every now and then. It's only good if you've got a bunch of AD damage dealers- and then you have to wonder how well you're going to do anyways once they buy armor.\n\nThe AD is wasted for a Support as you'll either be tanky (Alistar, Taric, Blitz, Leona), or utility (Raka, Lulu, Nami); neither of these benefit from buying Zeke's as you would almost anything else.\n\nI can understand the \"Why not just have both\" mentality- but don't try to justify it by saying people use Zeke's Herald. They do not.","replies":[]},{"poster":"AMYS GRAVE","date":"2015-07-13T20:21:48.412+0000","up_votes":1,"down_votes":0,"body":"Supports don't deserve AD... apparently...","replies":[{"poster":"jersatt","date":"2015-07-14T12:13:52.278+0000","up_votes":3,"down_votes":0,"body":"Support {{champion:41}} {{item:3070}} \nRIP 2009-2015","replies":[]},{"poster":"Rew711","date":"2015-07-13T20:24:23.857+0000","up_votes":1,"down_votes":6,"body":"They should make one that is based off AD.","replies":[{"poster":"AMYS GRAVE","date":"2015-07-13T20:39:45.747+0000","up_votes":3,"down_votes":1,"body":"Yeah Zeke's harbringer is a totally different item, i don't see why you cant keep both when they are this radically different.","replies":[{"poster":"Steelflame","date":"2015-07-14T00:34:10.429+0000","up_votes":1,"down_votes":2,"body":"Well, that could actually cause an issue of the two of them are stacked up on the same support for the sake of carry-amping.\n\nIn the 0.0000000000001% of games it would happen in.","replies":[]}]}]}]},{"poster":"Kobold","date":"2015-07-14T12:54:55.385+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Rezzic,realm=PBE,application-id=2EAF660193FA3B668D7234B3AEBB530C5AB7F651,discussion-id=lEXEsgWL,comment-id=0009000000000003,timestamp=2015-07-04T13:48:21.252+0000)\n>\n> I just want to point out how gold efficient the item is:\n> \n> y = gold efficiency\n> x = bonus AP\n> \n> THESE ARE WIKIA VALUES\n> Gold value per AP = 21.75g\n> Value per Armor = 20g\n> Value per Mana = 2g\n> Value per CDR = 31.67g\n> Value per Crit Chance = 50g\n> \n> \n> Item stats and Value\n> AP 50 = 1087.5g\n> Armor 35 = 700g\n> Mana 250 = 500g\n> CDR 10% = 316.7g\n> Before passive =2604.2g or 113.2% Gold Efficient\n> \n> \n> Passive:\n> Crit 100% = 5000g\n> AP 20% each = varies\n> \n> After Crit added = 7605.2g or 330.6% Gold Efficient\n> \n> \n> Equations\n> (note: I haven't done any mathematics in 3 years so correct me if I am wrong)\n> \n> Gold Efficiency[Y] = 100( ( 2604.2[No Crit value] + 21.75*X[bonus AP] ) / 2300[Item cost] ) \n> \n> OR\n> \n> Y=100((2604.2+21.75*X)/2300)\n> \n> \n> With Crit\n> \n> Gold Efficiency[Y] = 100( ( 7604.2[With Crit value] + 21.75*X[bonus AP] ) / 2300[Item cost] ) \n> \n> OR\n> \n> Y=100((7604.2+21.75*X)/2300)\n> \n> So with 2 APCs being affected by its passive both at 300AP (before bonus ap) the item would give them each 60 AP, 120 total.\n> \n> So ignoring the crit we get 226.7% Efficient, Add in the crit and its 444.1% Efficient.\n\n\nHere is the new zeke's gold efficiency. Also note that the item is able to be proc'd in around double the time it takes to fill shiv's passive, so its passive is up quite often.\n\nFor reference Full stacked {{item:3041}}  is 313.6% gold efficient, and a full {{item:3141}} is 325.7% gold efficient.","replies":[]},{"poster":"IwfiKe3qjM","date":"2015-07-14T04:27:58.121+0000","up_votes":2,"down_votes":0,"body":"I think the only reason they keep the name \"Zeke\" is because that item is from referral or something like that... if not they will removed it altogether like \"Deathfire Grasp\"","replies":[]},{"poster":"Vistha Kai","date":"2015-07-13T22:15:08.863+0000","up_votes":2,"down_votes":0,"body":"Welcome to the League of Retcons, where everything gets a retcon. Even item diversity.","replies":[]},{"poster":"JustMyBassCannon","date":"2015-07-14T08:25:44.615+0000","up_votes":2,"down_votes":1,"body":"The current design for Zeke's Herald is not worth keeping. It really isn't.\n\nAll the (archetype) supports don't use AD efficiently, and by extension, don't use Lifesteal efficiently either. They can use the health and CDR, but pretty much *every* good support item has CDR, and the health on it is basically what they get out of Sightstone.\n\nThe only (role) supports that use Zeke's well are actually bruisers.\n\nOn top of that, Zeke's is a remnant from an older time, when stacking auras for a bunch of team fight power was normal. It was common to see people *double-stack* auras, because the item itself has great stats, and then you'd get double the effect of the aura due to how they stack.\n\nNow, the only remaining real aura items are Aegis/Locket, which has been watered down to the point where I'm surprised it's still an aura, and Zeke's Herald, which has a very low-effect niche. The new Zeke's is not actually worth complaint when you consider that it works on a much larger pool of champions.","replies":[]},{"poster":"shepshifter","date":"2015-07-14T08:07:26.070+0000","up_votes":1,"down_votes":0,"body":"I only ever build zeke's if I'm playing as Yorick, the damage boost affects the gouls","replies":[]},{"poster":"Cindikle","date":"2015-07-14T02:06:01.494+0000","up_votes":1,"down_votes":0,"body":"It's a poor item overall with too strong of a niche. \n\nThey probably were on the verge of just putting it with Atma's. \n\nBut I'd like to see it stay on ARAM.","replies":[]},{"poster":"Silents429","date":"2015-07-14T06:33:41.744+0000","up_votes":1,"down_votes":1,"body":"Ohh. Just shut up about it, they are turning an item that never gets picked into something that will get picked, and all that is complained about is whether both can exist, why would we keep trash items around.","replies":[]},{"poster":"Emperor Time","date":"2015-07-14T02:41:03.110+0000","up_votes":2,"down_votes":2,"body":"what? zeke's herald is a trash tier item????","replies":[]},{"poster":"OverpoweredSoap","date":"2015-07-14T02:16:54.598+0000","up_votes":1,"down_votes":1,"body":"The only time I built Zeke's Herald was when I played support Kalista. \n\nBut maybe it's because I don't really play any supports that would really benefit it that much.\n\nJust because it's not used though, doesn't mean they should remove it.","replies":[]},{"poster":"Remlap1223","date":"2015-07-14T01:11:21.299+0000","up_votes":1,"down_votes":1,"body":"I was going to complain, but then I realized it actually made GP support even better, so I just ate oranges and was K.","replies":[]},{"poster":"CharQueen","date":"2015-07-16T08:19:49.827+0000","up_votes":1,"down_votes":2,"body":"Zeke's Herald was total crap; what 'majority of supports' are buying that useless piece of $ ?","replies":[]}]}