{"poster":"zuperzer0","date":"2016-01-24T05:34:42.001+0000","title":"Gane 6 de 10 y quede en bronce III Temporada S6","subforum":"Off-topic y temas personales","up_votes":1,"down_votes":0,"body":"como puede ser debe haber un error? gane 6 partidas sobre 10 y me mando a bronce III? es un chiste? siendo q en la pretemporada era Plata V asi q mi elo deberia haber subido ya que gane las primeras ranked q jugue para mi hay un error un compa&ntilde;ero q tengo de amigo gano 10/10 y aparecio en bronce I una cagada asi la verdad no da ganas jugar mataria que arregen esto por que asi no se va a mal gastar tiempo dinero y esfuerzo","replies":[{"poster":"Vlazzy11","date":"2016-06-13T23:05:30.887+0000","up_votes":1,"down_votes":0,"body":"Que rabia, me paso lo mismo tambien en bronce 3 y antes era plata, gane 6 de 10 igual -.-\narreglen esto..","replies":[]},{"poster":"zuperzer0","date":"2016-01-25T00:15:09.198+0000","up_votes":1,"down_votes":0,"body":"no se si soy bueno pero voy a salir de bronce el tema es q no me tengo q probar nada ni llegando a platino ni nada por el estilo juego por diversion pero no me gustan las cosas  deshonorables como las que hace riot","replies":[]},{"poster":"Chillout","date":"2016-01-24T17:59:06.905+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=VRv_oo4lDPE\n\naaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa","replies":[{"poster":"zuperzer0","date":"2016-01-24T23:28:54.776+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Solari22,realm=LAS,application-id=J8qpiO2I,discussion-id=pj88tHcA,comment-id=0005,timestamp=2016-01-24T17:59:06.905+0000)\n>\n> https://www.youtube.com/watch?v=VRv_oo4lDPE\n> \n> aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa\n\njajajajajaja","replies":[]}]},{"poster":"zuperzer0","date":"2016-01-24T13:57:37.396+0000","up_votes":1,"down_votes":0,"body":"la verdad una verguenza bajarte de linea para q sea mas competitivo claro echo de q estan haciendo lo q kieran con nosotros o sea podrian hacer eso con los q estan arriba que sabemos q x algo llegaron ahi pero los q recien empiezan nos dejan mas abajo espero que al subir no se pueda bajar de dividion \n\nEJ: de plata a bronce y asi como lei de parte del staff xq sino voy a gritar (?","replies":[]},{"poster":"elgian","date":"2016-01-24T12:18:46.141+0000","up_votes":1,"down_votes":0,"body":"D: yo gane 8/2 y me dejaron en BRONCE 3  y era plata 4","replies":[]},{"poster":"Blanquitow","date":"2016-01-24T05:48:02.129+0000","up_votes":1,"down_votes":1,"body":"Buenas noches invocador, Gane 6 de 10 como usted y me dejaron bronce 5.. BRONCE 5! Encerio ? O recompenzan o me suben la liga o no voy a jugar mas!","replies":[{"poster":"Hwaxinghz","date":"2016-01-24T11:38:33.151+0000","up_votes":1,"down_votes":0,"body":"Nadie te subirá de liga (un elobooster si, pero es ilegal), nadie te recompensará por nada (por la actitud que tienes ahorita, típico de un flamer) y si estás en bronce 5 es porque merecías estar allí, está claro eso. En que liga estabas? porque si estabas en Bronce 1-2-3, por más que ganes las 10 quedarás en bronce 5, muchos de plata 3 para abajo quedaron en bronce 3-4-5, yo estaba en Oro 5 y me dejaron bronce 1 ganando 5 (ya subí a plata por cierto, claramente el sistema puso más bajo para poner a prueba nuestra habilidad), eso no quiere decir que uno morirá en bronce. Si tienes las manos para subir, subirás, deja de quejarte al pedo.","replies":[]},{"poster":"SouI Ąßlaze","date":"2016-01-24T05:54:33.517+0000","up_votes":1,"down_votes":0,"body":"Andate no mas","replies":[{"poster":"EmilianoCL","date":"2016-01-24T07:04:34.078+0000","up_votes":1,"down_votes":0,"body":"Riot está de luto con la perdida {{item:3136}} {{item:3151}}","replies":[]}]}]},{"poster":"Metalkwolf","date":"2016-01-24T09:21:09.708+0000","up_votes":1,"down_votes":0,"body":"Amigo siempre te descienden un par de categorias al principio de la temporada, quizas esta vez fue mas rotundo el descenso, pero bueno...\nEs parte del juego; Como siempre se suele decir, si logras recuperar tu division es porque la merecias, si pudiste llegar alguna vez podes de nuevo, confia un poco mas en ti mismo y dedicale el tiempo que merece y ya. Sino, puedes irte como dijiste, es solo un juego, no te frustres.","replies":[]},{"poster":"Saudade","date":"2016-01-24T06:08:45.748+0000","up_votes":1,"down_votes":0,"body":"Gente lean el foro, hay claras explicaciones de porque pasa esto. Principalmente es porque estamos clasificandonos en INICIO de temporada. Esto significa que la gente en Retador,Maestro y Diamante quedan minimo en Platino 1 y por ende les baja el mmr a todas las divisiones por debajo.\nEsa es la razon, explicada de una manera burda y sencilla.","replies":[{"poster":"Saudade","date":"2016-01-24T06:13:29.445+0000","up_votes":1,"down_votes":0,"body":"Un ejemplo:\nUn challenger juega las 10 clasificatorias y gana las 10, queda en Platino 1\nUn platino 1 juega las 10 y gana las 10. Si clasificara en platino 1 (donde deberia estar) estaria jugando con Retadores, Maestros y Diamantes, por ende hasta que no se asienten los mmr lo va a poner por debajo de donde deberia estar.","replies":[]}]}]}