{"poster":"whyrawr","date":"2017-10-19T00:24:40.286+0000","title":"Problems with website","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hello\r\n\r\nMy problems are\r\n\r\n1) Your site brings people from EUW to Nexus to read info like https://nexus.leagueoflegends.com/en-us/2017/10/champion-roadmap-october-2017/\r\nNexus is NA server and I cant comment or do anything in here.\r\nSo why do you bring players to NA from EUW if they cant actually partisipate in discussions here.\r\nAlso it says \"Login to comment\" I click it reloads the page and nothing happens.\r\n\r\n2) To be able to be a part of community Ive already created NA account. And I still cant comment anything in Nexus. It shows sad Amumu and thats it.","replies":[{"poster":"Broporo","date":"2017-10-19T00:51:47.166+0000","up_votes":1,"down_votes":0,"body":"Any region *should* be able to post on the NA websites, and on that note, I don't believe the Nexus site has other regions for it. Try [**clearing your browser history and cookies**](https://support.riotgames.com/hc/en-us/articles/201752694-Clearing-Browser-History-and-Cookies) or possibly using a different browser or incognito/private window and let me know if that helps or not. You should be able to comment on the NA Nexus using your EUW account AFAIK.","replies":[{"poster":"whyrawr","date":"2017-10-19T01:09:29.120+0000","up_votes":1,"down_votes":0,"body":"Hello\nIt still says \"Login to comment\" I click it reloads the page and nothing happens\nhttp://s16.radikal.ru/i190/1710/6f/8c106a166aa5.jpg\n\nhttp://s019.radikal.ru/i639/1710/55/354c401e64c5.jpg\nI cleared browser, tried other browser and try incognito.\n(also i remember half a year ago I used be able to write in nexus without problems)","replies":[{"poster":"Broporo","date":"2017-10-19T02:11:00.629+0000","up_votes":1,"down_votes":0,"body":"Hmmm that is pretty weird. Hit up our tech guys in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new) and they should be able to walk you through a few steps one on one to get this sorted out.","replies":[{"poster":"whyrawr","date":"2017-10-19T02:17:35.855+0000","up_votes":1,"down_votes":0,"body":"I guess now we are gonna have a good laugh, but its actually support man who brought me here{{sticker:sg-zephyr}} \n\nhttp://s018.radikal.ru/i500/1710/e9/9828358e756a.jpg\n\nSHould I still create another ticket, since now we realise that something wrong on my side?","replies":[{"poster":"Broporo","date":"2017-10-19T02:32:17.050+0000","up_votes":1,"down_votes":0,"body":"Hm....not entirely sure why the EU agents sent you back to the NA boards for an answer. \n\nTBH I'm not super familiar with the EU sides of the Nexus website. I'm gonna go ahead and poke both of your accounts on the backend to see if that does anything to let you post on that Nexus site, but I'm also going to poke that agent again in your ticket to see if they can provide a little more detail for you.","replies":[{"poster":"whyrawr","date":"2017-10-19T02:34:31.101+0000","up_votes":1,"down_votes":0,"body":"Thank you very much.","replies":[]}]}]}]}]}]}]}