{"poster":"xSynx","date":"2015-09-19T17:11:46.560+0000","title":"As a new player starting ranked...","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":3,"body":"Is it normal to be put into other people&#039;s promotion matches? Out of my 9 games so far ive been in 7 promotion matches and am finding it hard to compete against other ranked players, I even had one guy claiming to be a plat 1 player and I myself am unranked.\r\n\r\nSo I found myself wondering, are there any good pointers out there to help me compete a little better with higher ranks? I tend to play ADC and always get run over and others seem to always blame me for a loss.","replies":[{"poster":"Eustace Fysher","date":"2015-09-19T23:34:38.399+0000","up_votes":1,"down_votes":0,"body":"To help you out. First i've not seen you play so any comments I make are based upon the numbers and info I find when searching you on op.gg.\n\nYou die too much, you've had 1 game where you went positive but you still died 9 times. Just think about the deaths and could you have avoided it. Did you think a dive was coming and you hung around anyway.  Had support backed to shop and you pushed over half way in lane with no vision? Was the tower going to die but you thought you could defend it? Things like that are simple to note down and can help you avoid deaths through your next games.\n\nYour cs scores are pretty low, maybe you could go to a few custom games and practice last hitting which will help you get gold quicker and some more items. Are you picking fights with a significant cs deficit and losing them because they have a bf sword and you only have a long sword?\n\nMy final bit of advice, stop playing ranked. Go to normals or team builder and farm ip so you can finish off your rune pages. With out having them full you are significantly disadvantaging yourself.\n\nHope this is useful","replies":[{"poster":"xSynx","date":"2015-09-20T00:28:52.526+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Eustace Fysher,realm=OCE,application-id=FjGAIbRv,discussion-id=tlQsnEHA,comment-id=0002,timestamp=2015-09-19T23:34:38.399+0000)\n>\n> To help you out. First i've not seen you play so any comments I make are based upon the numbers and info I find when searching you on op.gg.\n> \n> You die too much, you've had 1 game where you went positive but you still died 9 times. Just think about the deaths and could you have avoided it. Did you think a dive was coming and you hung around anyway.  Had support backed to shop and you pushed over half way in lane with no vision? Was the tower going to die but you thought you could defend it? Things like that are simple to note down and can help you avoid deaths through your next games.\n> \n> Your cs scores are pretty low, maybe you could go to a few custom games and practice last hitting which will help you get gold quicker and some more items. Are you picking fights with a significant cs deficit and losing them because they have a bf sword and you only have a long sword?\n> \n> My final bit of advice, stop playing ranked. Go to normals or team builder and farm ip so you can finish off your rune pages. With out having them full you are significantly disadvantaging yourself.\n> \n> Hope this is useful\n\n\n\nI understand that perfectly well, but when your support feeds, nobody calls missing, your jungle never ganks your lane because his mate at top really doesn't need a gank but wants one, your support steals a vital kill that will finish off a critical item or any other type of thing of this nature is why my scores look as they do.\n\nYou can't really farm while being 5 man ganked and no ones called missing, you pretty much have to sac your turret and be done with it\n\nI can last hit perfectly fine, in my view its the lack of communication and calls that makes it that much harder to win a game.\n\nAs for your comments about rune pages, I have my ADC and a personal one for Warwick finished, so its not about runes either, Yes i have played some champs without a rune page, but it was more for giggles than anything else really.","replies":[{"poster":"Eustace Fysher","date":"2015-09-20T00:46:35.625+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xSynx,realm=OCE,application-id=FjGAIbRv,discussion-id=tlQsnEHA,comment-id=00020000,timestamp=2015-09-20T00:28:52.526+0000)\n>\n> I understand that perfectly well, but when your support feeds, nobody calls missing, your jungle never ganks your lane because his mate at top really doesn't need a gank but wants one, your support steals a vital kill that will finish off a critical item or any other type of thing of this nature is why my scores look as they do.\n> \n> You can't really farm while being 5 man ganked and no ones called missing, you pretty much have to sac your turret and be done with it\n> \n> I can last hit perfectly fine, in my view its the lack of communication and calls that makes it that much harder to win a game.\n> \n> As for your comments about rune pages, I have my ADC and a personal one for Warwick finished, so its not about runes either, Yes i have played some champs without a rune page, but it was more for giggles than anything else really.\n\nYou're making excuses. You should have some map awareness and not be reliant on people calling mia for you. Be proactive in asking the jungler for ganks or let him know they don't have vision down or are continually pushing forward, give him timing on flashes so he has info to work with. If support steals a kill it's no biggy sure the gold would be helpful but it's not the end of the world.\n\nIf you're being 5 man ganked then apart from a tp play in to account for top you are partly to blame. You should have some awareness of where the enemy team is. Yes this is a team game but you have to be aware that communication isn't always perfect.\n\nYour stats would argue you struggle to last hit perfectly fine.  If communication is lacking then be the voice that makes the calls. You'll either die a hero or see yourself live long enough to be the villain. \n\nThere are so many options available to you, it's easy to point out flaws of your team and how they lacked in responsibility but you need to just focus on yourself","replies":[]}]}]},{"poster":"Lord Sesshomaru","date":"2015-09-19T21:31:12.133+0000","up_votes":1,"down_votes":0,"body":"I think its wrong to be unranked and put into promotion matches, but thats just me i guess.\nmost guys claiming to be platinum are just saying that so they get the lane they want: \"I'm a plat smurf, let me mid and we win\" when they aren't plat at all.\n\nThe thing with playing ADC/Supp in ranked is that if people on the other team are Duoing its most likely that they will play duo bot lane and have excellent communication and synchronisation with each other, and you will find it really hard to compete with that when you cant talk to your own support (who most of the time is some bum who is still sulking for being last pick) so that does put you at a disadvantage in some games. But if it is your best position then dont change lanes because of that, just try to look at their behaviour and if they are too in sync then they are probs duo and just play safe. \nas for people blaming you for a loss, people just don't want to believe that they could possibly contribute to a loss, despite it being a team game. so they just blame whoever happens to be convenient.\n\nim not very high up in ranked so i cant give many tips because that would be hypocritical, but the general gist is to play lots of games, even if you go 50/50 win loss ratio apparently you still rise, but only a little so the more you play the more you rise with that.","replies":[{"poster":"xSynx","date":"2015-09-19T22:45:02.540+0000","up_votes":1,"down_votes":0,"body":"I appreciate both of your inputs and I do agree, its silly for me to be placed in other people's promotion matches as im less experienced and it seems a bit lopsided. On the other hand, yeah I do get some pretty terrible supports, they barely ever harass and they feed like crazy which in turn leaves me in position where I get dived buy the duo bot laners and their aggressive jungler.\n\nAnother problem I seem to have is smurfs. Not bashing smurfs here, but it really does put a bit of a dent in low ranked players confidence when they get trashed by an entire team of smurfs, it really isn't all that fun to be frank.\n\nOh well, ill forge ahead and maybe try to find someone who wants to duo queue with me over voip and see how it goes from there.","replies":[]}]},{"poster":"Nova X","date":"2015-09-19T22:10:03.905+0000","up_votes":1,"down_votes":0,"body":"Im no very high either actually but one word that affects the whole game is cs score bro. if you out cs your opponent and harrass to prevent them from csing you' ll have a massive advantage. And your late-mid game will be stronger.","replies":[]}]}