{"poster":"pulledchicken","date":"2015-06-23T18:38:05.222+0000","title":"Tham König des Flusses","subforum":"Champions & Gameplay","up_votes":5,"down_votes":0,"body":"Hier ein Post wo man &uuml;ber den neuen Champ sprechen kann ;) ( zur Vermeidung von 80 Posts &uuml;ber ein Thema :P ) \r\n\r\n\r\nvor ab h&auml;tte ich eventuell eine Frage , Vorschlag oder Anregung .... \r\n\r\nWieso hat Tham Mana ?    seine Spells sind ja nicht wirklich Spells sondern eher Techniken die er so oder so kann ( hat ) \r\n\r\nich w&uuml;rde es Pers&ouml;nlich besser finden Ihm kein Mana zu geben oder Energy benutzen ! ( aber Mana neeee ) :D naja ist nur meine Pers&ouml;nliche meinung !","replies":[{"poster":"haha weed lol xd","date":"2015-06-23T22:01:53.561+0000","up_votes":7,"down_votes":0,"body":"Für mich ganz klar ein Jungler oder Toplaner. \n\nIch meine hallo ? Stellt euch mal folgendes Szenario vor. \n\nTham Jungle: \" Hey Talon hüpf mal in mich rein wir ganken mal in wenigen Sekunden und vollkommend überraschend die overextendene Botlane.\"\nTalon Mid: \" Hey super Plan Tham ich bin dabei! \" \n\nKurz darauf finden sich Tham und Talon auf der Botlane wieder, wo der nervige gegnerische Thresh erst mal verschluckt wird, während Talon die gegnerische Jinx nuked. Danach wird sich um Thresh gekümmert, der auch sehr schnell ins Gras beißt.\n\nTalon Botlane:\" Hey Tham, das war wirklich gut, immer weiter so mein Freund\"\nJinx (Gegner) Tot:\" Omg Noob so broken gg Rito fck this Champ \" \nVayne Botlane:\" Fck you Tham no kills for me noob Jungler l2p im out fck off \" \nBard Botlane:\" Wtf am i doing ?\" \n\ntrue story","replies":[{"poster":"Veezey","date":"2015-06-23T22:30:47.550+0000","up_votes":2,"down_votes":0,"body":"So wirds kommen.","replies":[]},{"poster":"pulledchicken","date":"2015-06-23T22:35:17.023+0000","up_votes":1,"down_votes":0,"body":"sehe ich genauso ... also als Solo Laner hat er einfach besseres DMG und Roaming Potential ! \n\ndenn ein ADC in der Mid bedeutet nicht gleich ein Vorteil ! \n\nein Midlaner oder Toplaner ist da schon deutlich besser !","replies":[]}]},{"poster":"ZenonTheStoic","date":"2015-06-25T06:24:28.754+0000","up_votes":4,"down_votes":0,"body":"Einen Champ \"resourceless\" zu machen verursacht eine Menge Veränderungen daran, wie er sich in der Lane verhält, wie er gebalancet werden kann, welche Items er bauen kann, und so weiter. Meine Philosophie ist es, mit Mana anzufangen, und nur dann von Mana wegzugehen, wenn es dafür einen guten Grund gibt. Die Kampf-Kurven von Champions mit Mana und Energie sind ganz anders. Champions mit Energie haben direkt eine Menge Auswirkung auf den Kampf, fallen dann aber auf eine weniger mächtige Stufe herab, wenn ihnen die Energie ausgeht und sie vor jeder Fähigkeit warten müssen, bis sie genug Energie haben. Dafür sind sie recht schnell wieder voll einsatzfähig. Mana-Champions funktionieren ganz anders: die haben einen sehr großen Einfluss auf den Kampf solange sie Mana haben und fallen dann fast komplett ab, wenn ihnen das Mana ausgeht. Unser Spiel ist eher um die Mana-Kurve gebaut; wenn man also einen Champion erschaffen will, der Energie benutzt, muss man das ganze Kit um diese andere Kurve bauen. Bei Zed klappt das sehr gut (die Energiekurve überlappt fast perfekt mit der idealen Assassinenkurve; einmal reingehen, schnell viel Schaden machen, rausgehen, auf die nächste Chance warten), bei Kennen klappt es eher mittelmäßig (als Mage will der eigentlich viel länger poken können--wenn Kennen in seinem Ulti niemand umbringt, bringt er nicht mehr sehr viel für sein Team), und bei Shen klappt die Kurve gar nicht (in Teamfights kann sich der Shen Spieler es nicht leisten, jemals unter die Kosten von seinem Taunt zu fallen, muss also Qs und Ws sein lassen; entweder fängt er am Anfang des Kampfs ein wichtiges Ziel im gegnerischen Team, oder er funktioniert nicht wirklich als Tank). \n\nAls klassischer Support-Tank ist Tahm eigentlich nur durch seine Abklingzeiten begrenzt, bis zu dem Zeitpunkt, wo ihm das Mana ausgeht. Das passiert eigentlich fast nur in der ersten Hälfte des Spiels. Eine Energiekurve würde zum Beispiel bedeuten, dass Tahm sich mit seiner Zungenpeitsche zurückhalten muss, wenn er danach nicht genug Energie für das nächste Verschlingen haben würde. Mit Mana kannst du in Teamfights gegen Ende eines Spiels soviele Knöpfe drücken, wie du willst.","replies":[{"poster":"pulledchicken","date":"2015-06-25T07:12:29.320+0000","up_votes":2,"down_votes":0,"body":"also erst mal Hut ab  !!! <3 <3 <3 *____* ich freu mich MEGA das endlich mal ein Riotler und vor allem du Zenon hier schreibst DANKESCHÖÖÖN !\n\nwas du geschrieben hast ergibt Sinn ^^ ..... bei Tham  erkenne ich solch eine Kurve nicht :) \n\n\nund noch mal vielen dank für deine Antwort freut mich ! :)","replies":[]}]},{"poster":"Tamm the Creator","date":"2015-06-23T20:51:44.588+0000","up_votes":3,"down_votes":0,"body":"rein von der PAssiven der Ulti wird er warscheinlich häufig als Jungler oder zumindest mit Smite gespielt (Cynderhulk).\nEr wird praktisch wieder ein Anfang im Ende vom aktuellen Meta werden.\n\nFreue mich schon auf: Full AD Tham, Full HP Tham, Full CDR AP Tham (wenn möglich) und viele weitere neue Spielweisen.","replies":[{"poster":"SuperplexP","date":"2015-06-24T09:52:14.334+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TammDafuq,realm=EUW,application-id=Wj1wcocU,discussion-id=1TpGZd2x,comment-id=0003,timestamp=2015-06-23T20:51:44.588+0000)\n>\n> rein von der PAssiven der Ulti wird er warscheinlich häufig als Jungler oder zumindest mit Smite gespielt (Cynderhulk).\n> Er wird praktisch wieder ein Anfang im Ende vom aktuellen Meta werden.\n> \n> Freue mich schon auf: Full AD Tham, Full HP Tham, Full CDR AP Tham (wenn möglich) und viele weitere neue Spielweisen.\n\nGibts schon Infos über die Skalierung?\nAlso abseits von Full Tank Tamm wirds imo keine andere sinnvolle Variante geben. Je nach Skalierung des Qs werden irgendwelche Trolle AD oder AP bauen, aber das ist halt komplett sinnlos.\n\nEr wird aber auf jeden Fall super op werden. Schaden am maximalen Leben des Gegner plus Schaden, der mit dem eigenen Leben skaliert plus der E ist auf jeden Fall zu stark.\nAuf der Toplane seh ich ihn aber wenn, dann nur aufgrund seines Ws. Aber versuch mal ohne Cc und als Melee die drei Stacks bei nem Gank draufzubekommen.\n\nUnd als Support wird das mit den Stacks noch schwerer. Ein Braum oder eine Leona dürften da einfach besser sein.","replies":[{"poster":"pulledchicken","date":"2015-06-24T11:42:04.538+0000","up_votes":1,"down_votes":0,"body":"Tham skaliert auf full ap ...\n\nich denke mal RoA style ;)","replies":[{"poster":"TurtleMari","date":"2015-06-25T09:47:47.835+0000","up_votes":1,"down_votes":0,"body":"Evtl. so bauen wie den alten Ryze? \n..wenn auch mit mehr Leben.","replies":[{"poster":"pulledchicken","date":"2015-06-25T11:53:37.597+0000","up_votes":1,"down_votes":0,"body":"daran hab ich auch gedacht .... \n\nnur das man eventuell als einziges noch Deathcap mit rein baut ka .... wird man dann sehen !","replies":[]}]}]}]}]},{"poster":"Wekra","date":"2015-06-23T18:52:18.530+0000","up_votes":1,"down_votes":0,"body":"Nach Bard der nächste Übertrolliger Champ...das kann was werden...","replies":[{"poster":"pulledchicken","date":"2015-06-23T19:00:06.211+0000","up_votes":3,"down_votes":0,"body":"naja viele sehen Ihn als Supp .... ICH nicht !\n\nallein das du wenn du auf einer Solo Lane bist mit seiner Ulti einen verbündeten mitnehmen kannst um die anderen Lanes zu Ganken ist einfach echt cool !\n\njeder sieht ihn als Supporter :/  was ich nicht ganz verstehen kann !","replies":[{"poster":"2Face1Evil","date":"2015-06-23T19:15:40.665+0000","up_votes":1,"down_votes":1,"body":"ich werd ihn definitiv junglen, hab ich mit bard auch gemacht\n\nErgebnis: fast schon nützlicher als auf der lane selbst ^^\n\nFreue mich definitiv auf ihn weil er was besonderes ist so wie Bard auch nur das ich Bard für sinnloser halte","replies":[{"poster":"pulledchicken","date":"2015-06-23T19:18:07.474+0000","up_votes":2,"down_votes":1,"body":"jo als Jungler macht er echt mehr sinn finde ich auch ;)","replies":[]}]}]},{"poster":"erzi222","date":"2015-06-23T19:08:12.445+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wekra,realm=EUW,application-id=Wj1wcocU,discussion-id=1TpGZd2x,comment-id=0000,timestamp=2015-06-23T18:52:18.530+0000)\n>\n> Nach Bard der nächste Übertrolliger Champ...das kann was werden...\n\nlol daran musste ich auch denken, bard war ja dafür schon prädestiniert xD !\n\naußerdem soll sich riot mal entscheiden was für champs sie entwickeln, ist es jetzt ein solo lane champ oder support?\nnach dem skillkit und allein wegen der ulti für mich entweder ein support oder fast schon ein jungler, weil er so flücjtenden champ schnell helfen kann.\n\naber eine soraka sololane oh nein das darf natürlich nicht sein, nervt sie bis sie man sie wirklich nur noch auf der botlane spielen wird, wenn überhaupt .... und dann wird der neue champ für die solo lane gepriesen wtf .... macht echt mal wieder keinen sinn.","replies":[{"poster":"XIII BTLmovies","date":"2015-06-23T19:25:08.236+0000","up_votes":2,"down_votes":1,"body":"Man kann mit ihm nicht trollen, der Verbündete kann bei der Ulti entscheiden ob er mit will und wenn er gefressen wird, kann er auch entscheiden wann er wieder raus will.\n\nNicht ganz, sie haben sich schon entschieden er ist eher auf Support bassiert, kann aber auch Top gespielt werden.","replies":[{"poster":"pulledchicken","date":"2015-06-23T20:26:36.484+0000","up_votes":1,"down_votes":1,"body":"lol :D sie haben sich nicht auf Support entschieden ! \n\nin der Geschichte wird  eigentlich eher ersichtlicher das er auf der Top lane und im Jungle gespielt wird da er sagt \" die ganze welt ist ein fluss und ich ihr König ...  ich war schon überall es gibt keinen Ort an den ich nicht wieder gehen könnte \" ! \n\nich weis gar nicht wieso man  Ihn überhaupt zum Supporter ernennt .... seine W ist ziemlich useless für einen ADC um ehrlich zu sein !","replies":[{"poster":"TurtleMari","date":"2015-06-25T09:51:50.565+0000","up_votes":1,"down_votes":0,"body":"Seine Q, W und R sind Supportfaktoren. \nDie W ist alles andere als useless für \neinen ADC, da du selbst als \"Fleischschild\"\nfungieren kannst, bzw. mit deinem Carry\nescapen.","replies":[]},{"poster":"XIII BTLmovies","date":"2015-06-23T20:29:51.869+0000","up_votes":1,"down_votes":0,"body":"schon durch gelesen? da steht warum er ein support sein kann :)","replies":[]}]}]},{"poster":"Zerberus II","date":"2015-06-24T11:48:21.403+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=erzi222,realm=EUW,application-id=Wj1wcocU,discussion-id=1TpGZd2x,comment-id=00000001,timestamp=2015-06-23T19:08:12.445+0000)\n>\n> lol daran musste ich auch denken, bard war ja dafür schon prädestiniert xD !\n> \n> außerdem soll sich riot mal entscheiden was für champs sie entwickeln, ist es jetzt ein solo lane champ oder support?\n> nach dem skillkit und allein wegen der ulti für mich entweder ein support oder fast schon ein jungler, weil er so flücjtenden champ schnell helfen kann.\n> \n> aber eine soraka sololane oh nein das darf natürlich nicht sein, nervt sie bis sie man sie wirklich nur noch auf der botlane spielen wird, wenn überhaupt .... und dann wird der neue champ für die solo lane gepriesen wtf .... macht echt mal wieder keinen sinn.\n\nweißt du warum Dota ständig krasser shit passiert mit den helden? weil die Champions nicht auf irgendeine Rolle hin designed werden. Und wenn du selber nicht kreativ werden willst (könnte ich verstehen) dann nimmst du vorgekaute beschreibungen von Riot an, ist halt einfacher. Aber man kann ja auch einfach selber gucken was mit dem Kit funktioniert und sich was neues ausdenken, ne? :)","replies":[{"poster":"XxFeedMeMore","date":"2015-06-25T10:44:14.730+0000","up_votes":1,"down_votes":0,"body":"wenn dir dota besser gefällt zock uns und geh leuten die lol zocken ent aufen sack?","replies":[]}]},{"poster":"I love you Malon","date":"2015-06-24T20:30:12.983+0000","up_votes":1,"down_votes":0,"body":"Lulu ja ebenfalls O.o\n\nTop \nMid\nSupp Bot ...","replies":[]},{"poster":"LyteHatesSoloQ","date":"2015-06-23T21:44:56.335+0000","up_votes":1,"down_votes":0,"body":"Soraka war damals aber auch OP auf der Sololane...","replies":[]}]}]},{"poster":"Adamus Phillida","date":"2015-06-23T23:07:00.527+0000","up_votes":1,"down_votes":0,"body":"sagt mal, kann er etwa mit der Ulti einfach so ganken kommen\nohne jede vorwahnung wie z.b. bei Shen das Schild?","replies":[{"poster":"ZenonTheStoic","date":"2015-06-25T18:22:31.201+0000","up_votes":2,"down_votes":0,"body":"Du bekommst 2,5 Sekunde bevor er ankommt eine sehr laute, deutlich zu sehende Warnung.","replies":[]}]},{"poster":"Adamus Phillida","date":"2015-06-23T22:19:19.283+0000","up_votes":1,"down_votes":0,"body":"Die W\n\ner verschluckt einen Teammitglied das grade dabei jemanden zu killen und dieser entkommt.\n\nrichtig oder hab ich was übersehen?","replies":[{"poster":"pulledchicken","date":"2015-06-23T22:30:01.349+0000","up_votes":2,"down_votes":0,"body":"ja aber das ist für den ADC nicht unbedingt von vorteil .....\n\nes geht um erster linie darum dem ADC die Kills vor zu gaugeln : sprich Hooks , Knockups , stuns und slows .... CC halt \n\nTamm seine W verschlingt entweder deinen ADC oder den vom enemy Team ... ist meiner meinung nach totall useless da dein ADC nicht immer im Vorteil ist !\n\nich will ja auf der Lane Dominieren ... das einzige was Tham mir bietet als ADC ist im Notfall mich zu fressen ... WOOOOW echt cool Tham Thumps up u know what i mean :P","replies":[{"poster":"Adamus Phillida","date":"2015-06-23T22:43:55.576+0000","up_votes":1,"down_votes":0,"body":"İch weiss das es nicht von vorteil ist,\n\nalle Champions können trollen und feeden aber jemand anderen trollen zu können, das ist schon hart","replies":[]}]}]},{"poster":"erzi222","date":"2015-06-23T21:55:59.111+0000","up_votes":2,"down_votes":0,"body":"sie war auch als support perfekt gewesen und ideal für neulinge auf der botlane. \ndie meisten leute konnten sie nur nicht spielen.\nachja und sie hatte keinen cc ... wie schlimm.\ngewisse andere champs auf anderen lanes haben auch kein cc, drama pur.","replies":[]},{"poster":"Holokom","date":"2015-06-23T20:14:21.945+0000","up_votes":3,"down_votes":1,"body":"ich find ihn sagenhaftund als main support bin ich glücklich mit ihm^^","replies":[]},{"poster":"Alustus","date":"2015-06-23T20:40:17.200+0000","up_votes":2,"down_votes":1,"body":"Hat wie gesagt ein gutes Troll potential.\n\nWerde ihn sicher kaufen.\n\nFreu mich schon auf das mitspieler fressen.\n\nWie er sich dan ingame schlägt müssen wir abwarten.","replies":[]},{"poster":"erzi222","date":"2015-06-24T22:27:59.033+0000","up_votes":1,"down_votes":0,"body":"du hast vergessen lulu adc.\n\nfrühr ging lulu sogar im jungle .... sah man sogar im video von riot zu lulu lol.","replies":[{"poster":"haha weed lol xd","date":"2015-06-25T10:55:37.800+0000","up_votes":1,"down_votes":0,"body":"Dass war aber nur weil Phreak früher jeden Champion gejunglet hat ... :D","replies":[]}]},{"poster":"VanCalle","date":"2015-06-25T07:35:59.025+0000","up_votes":1,"down_votes":0,"body":"Ganz egal ob er nun stark, op, up, useless oder sonst was ist,  das Viech sieht einfach nach Spaß aus und das allein freut mich schon. Glaubt ihr es wäre möglich Kalista mit der ult mitzunehmen während sie mit ult ihren supp mitnimmt? Das wäre trollig:D","replies":[{"poster":"pulledchicken","date":"2015-06-25T09:36:28.136+0000","up_votes":1,"down_votes":0,"body":"das stimmt ! als erster Punkt es ist einfach nur ein Game ! (Spass dabei ist das wichtigste :) ) \n\nja man kann dieses ClownCar machen !\n\nin einem RedPost hat daniel\"blablabla\" gemeint man könne mit Tham Kench einen fressen und dann mit der Kalista mitnehmen :D ... wird auf jedenfall die WOMBOCOMBO schlecht hin ! hahaha :D","replies":[]}]},{"poster":"Holokom","date":"2015-06-24T20:15:59.323+0000","up_votes":1,"down_votes":0,"body":"Ich seh Tham eher so das er in synergie mit vayne steht...einfach den gegnerischen Support schlucken und dem adc ein 1v1 ermöglichen ^^ außerdem ist immer jemand da und wenn plötzlich in der over extendeten mid lane eine vayne hinter dir auftaucht die dich gegen den gegnerischen tower condemmt...nice ^^","replies":[]},{"poster":"erzi222","date":"2015-06-24T12:13:53.163+0000","up_votes":1,"down_votes":0,"body":"bzw ich kenn mich mit dota nicht aus sry.\n\nin lol waren die champs auch so designed das man sie auf mehre lanes spielen kann, da waren auch noch die ganze hybrid items /ad und ap) besser gewesen. und selbst kassasdin war spielbar auf ad gewesen lol. ich finde ja vielfälltigkeit auch besser ... aber sags mal riot.\nmich ärgerts eben das sie soraka so verhunzt haben, gwisse champs auf eine lane fixieren wollen und dann werbung machen auf der homepage \"spielt brand support\" wo ich mir denke \"omg leute ehrlich ?\" ....\n\nich spiele selber oft ungewöhnliche builds zb in aram um die benötigten positionen zu füllen, wie zb AP Miss Fortune oder warwick support-tank, nur um zwei beispiele zu nennen.","replies":[]},{"poster":"Evenrider","date":"2015-06-24T11:20:57.967+0000","up_votes":1,"down_votes":0,"body":"Das was ich mich frage:\n\nHat seine Ulti eine Vorwarnung?\nBei Panth, TF, Shen, Sion und Reksai kommt ja jeweils schon 1 Champ über die Map. Und das mit Vorwarnung und Delay. Bei ihm wären es 2 Champions, nahezu direkt und das ohne Warnung?\n\nWelche Art von CC ist sein Verschlingen? Reicht Mikaels, Cleanse oder braucht man QSS oder geht garnichts wie beim Knockup?","replies":[]},{"poster":"Ahri a Stark","date":"2015-06-23T22:25:21.681+0000","up_votes":2,"down_votes":2,"body":"wow Q ist ein Skillshot der Slowt/Stunned und Damage macht.. Wie einfallsreich... \nbin dafür dass sich Riot noch längere Pausen zwischen den Champions nimmt..\nes wiederholt sich einfach alles/ wird abgeschaut ... Bin echt enttäuscht :/\nwann kommen mal wieder coole und einfallsreiche Sachen ? Vom Design her finde ich ihn allerdings garnicht so schlecht und auch sein Name","replies":[{"poster":"pulledchicken","date":"2015-06-23T22:33:09.887+0000","up_votes":1,"down_votes":1,"body":"nicht falsch verstehen Tham ist schon cool !\n\nich finde das einzige was man an ihm irgendwo wieder erkennt ist die Ulti und zwar von Rek'Sai ..... ( nur besser quasi mit duo oder solo )","replies":[]}]}]}