{"poster":"crystalmath","date":"2016-04-07T04:42:18.597+0000","title":"I think im done","subforum":"Player Behaviour","up_votes":3,"down_votes":1,"body":"Ever met a girl and instantly fell in love to the point where everything she does amazes you then over time she changes and soon you realize you dont like what she is anymore and being with her just bothers you now \r\n\r\nyeah that what i feel about riot/league now\r\n\r\nwhen i first started playing i really did love this game and i thought that riot had made one of the funnest games yet.\r\n\r\nGetting 4 friends to play and hoping into a curse call would be the highlight of my day sometimes but now it just seems like this game just becomes a reason to scream at each other. Im one of the last of my friends that actually still play the game\r\n\r\nsomething has definitely changed about this game the community have become a lot more toxic and salty then when it used to play \r\nand the game is becoming way to competitive \r\n\r\ni ll still play this game because of the time and money i have invested into it but i am not sure ill ever get that fun feeling i used to get when i played back then\r\nwho knows maybe i might go and play counter strike instead\r\n\r\n-crystalmath","replies":[{"poster":"Tele","date":"2016-04-07T06:32:02.049+0000","up_votes":3,"down_votes":0,"body":"Hey man, great post.\n\nI'm not an expert in formal psychology, but I think over my 2 years here on the forums I've learned a bit about the nature of toxicity. \n\nI'm sure you know someone who is a genuinely good person, but they get in-game and become a monster. Or even worse you may have even seen this person grow more and more toxic. \n\n_How does this happen?\nHow do players become **toxic**?_\n\n+ **Expectations.**\nPlayers dedicate a lot of time to this game. The issue appears when people expect results from their time investment and they don't get it. Players might begin to feel resentment towards their teams and the system.\n\n This is where players begin to be hyper critical of their team mates, and will often see them as deadweight. Everyone seems to be a scrub, always making mistakes, always holding you back from your real potential.\n\n The more you expect or dedicate to something, the more it'll hurt when things fall apart. This is why relationships can be so emotionally scarring in some cases.\n\n+ **Mimic.**\n[Studies show](http://press.uchicago.edu/pressReleases/2014/May/0522JCRlowe.html) that your company and who you associate with dictates your character and actions greatly. New players may come from darker areas of the internet, or experience toxicity and assume it's the normal or accepted.\n\n A huge part of the player report system is to fix this. It's very important that players understand that this behavior is not OK. **Riot Lyte** has a great talk on this [here](http://gdcvault.com/play/1017940/The-Science-Behind-Shaping-Player).\n\n+ **Reaction.**\nNot everyone has iron skin when it comes to toxicity. Bad days or simply being fed up with the community can lead to anger and resentment of teams and the system.\n\n These players will flame back at toxic players only worsening the problem and causing it to spiral out of control. They aren't bad people, but they feel the need to take matters into their own hands and correct the issue themselves. They'll stop negative players as people, and just \"more trolls\" or \"the problem in the community\". \n\n The truth is most players are good people, with genuine problems and issues. They don't understand that maybe these players aren't assholes, maybe they are going through financial struggles, death, break-ups... etc. These players don't need to be excluded and unwelcome, they need help and support.\n\nWe're always working to fix toxicity in the community, but the truth is out impact is limited. _**The community is a product of the players**_, what you say and how you act defines the community.\n\nIf you do something nice, you'll generate **positivity**. If you bring hate, you'll generate **negativity**. If you just play, you'll do **nothing**.\n\nIf you're looking for my message in **TL;DR** form, I recommend checking out this video:\nhttps://www.youtube.com/watch?v=nxAabW7JfTQ\n\nI hope this helps ;)","replies":[{"poster":"Omni Presents","date":"2016-04-07T12:32:53.262+0000","up_votes":2,"down_votes":0,"body":"You guys need to learn to suck lesser. Whenever I see green forum posters all I see is a Dyson attached to Riot's ass.\n\nSeriously, we say there is a problem and all you guys ever do is say \"Nah dude, there no problem, here are some old tips we have in template format we just copy and paste every time\".\n\nThere IS A PROBLEM, you guys, whatever the green means, need to stop sucking Riot's ass and actually help fix the issues.","replies":[{"poster":"Tele","date":"2016-04-07T20:05:57.182+0000","up_votes":1,"down_votes":1,"body":"I'm just a player you know. I don't have the power **Riot** does, I can't edit the system, I can't ban more players. \n\nI have the same power you do.\n\nWhat I did in this post was outline why players are toxic within the community. **Never once did I deny the problem**. No shit it's a problem or else we wouldn't have report systems in place to protect you guys.\n\n**Riot** is taking a strong lead in player reform. Before they started their programs, most companies just banned  or ignored toxicity. There was no chat restrictions, or tribunals. **Riot** _actually cares_ and have a whole team dedicated to researching and helping you guys.\n\nIt's not perfect, but nothing ever is. If you have some genius idea for player reform feel free to come forth with it now. Otherwise we'll just have to wait and let them handle it. The tribunal and other systems are coming soon. Work is being done.","replies":[]}]}]},{"poster":"Essembie","date":"2016-04-07T08:47:10.166+0000","up_votes":2,"down_votes":0,"body":"Lets be honest, you've never had a girlfriend.\n\n{{sticker:slayer-jinx-wink}} \n\njust jokes bro and / or sis.","replies":[{"poster":"crystalmath","date":"2016-04-07T10:18:23.878+0000","up_votes":2,"down_votes":0,"body":"lol","replies":[]},{"poster":"CHEESYLEEKS","date":"2016-04-08T01:09:37.333+0000","up_votes":1,"down_votes":0,"body":"http://i899.photobucket.com/albums/ac195/EBXerom/Reactionsgifs/oooh-sick-burn.gif","replies":[]}]},{"poster":"littlebabypanda","date":"2016-04-16T00:34:28.884+0000","up_votes":1,"down_votes":1,"body":"Free to play games = unlimited number of free accounts = toxic players. End of story. Riot certainly doesn't care whether you have fun or not. It's all about $$$ mate, all about $$$.","replies":[{"poster":"Klavinmour","date":"2016-04-16T12:07:33.899+0000","up_votes":1,"down_votes":0,"body":"They actually do care about if you have fun or not.\nIf you don't have fun you wont play the game, if you don't play the game you'll never spend money on it.\n\nToxic players who create new accounts never spend money on the game, this is why accounts pre level 30 get permabanned in single instances of trolling.","replies":[{"poster":"littlebabypanda","date":"2016-04-17T04:37:06.602+0000","up_votes":1,"down_votes":0,"body":"\"accounts pre level 30 get permabanned in single instances of trolling\", hahaha yeah right !","replies":[{"poster":"Klavinmour","date":"2016-04-17T14:03:04.744+0000","up_votes":1,"down_votes":0,"body":"Straight from Riot Lyte himself. Accounts that have yet to reach level 30 don't get any leeway when it comes to punishment.","replies":[]}]}]}]},{"poster":"Klavinmour","date":"2016-04-07T05:10:48.483+0000","up_votes":1,"down_votes":0,"body":"You're complaining that a game is competitive when the whole system of it's genre is competitive.\n\nHell MOBAs started with the original concepts for DotA back in StarCraft a COMPETITIVE GAME, then evolved to DotA All Stars in WarCraft 3, surprise surprise another competitive game, except now a competitive game in a competitive game.\nThen along comes LoL a game based on a competitive game within a competitive game.\n\nAs someone who's played thousands of hours of LoL, DotA All Stars, and games across all genres.\nLoL's community is not the problem, it's nowhere near as toxic as the vocal majority complain about.\n\nLet me just explain Vocal Majority for a second. They are the people who complain for the sake of complaining, people who don't have any issues to complain about don't talk, they are content with not being heard because they have nothing to be heard. So yes, you see most of the posts on the boards or reddit or wheverthefuck are people complaining that the community is toxic, when in reality they are the player base minority but the vocal majority.\n\nNow I don't know your gaming back story, so I don't know if you're ever played DotA All Stars or DotA2, or CS:Source or CS:GO, or hell let's take toxicity to the max crank it up to FUCKING ELEVEN! Eve Online.\nEach of those games have a community FAR FAR WORSE than LoL.\n\nYou said the highlight of your day would be playing with a group of FOUR friends in LoL.\nThat right there is your problem.\nIt's not that the game has gotten toxic, it's that you split yourself off from your friends who made the game fun and eliminated any potential for toxicity on your team.\n\nGet back with your friends and you'll rekindle your love for the game and you wont see any \"toxicity\".\n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"crystalmath","date":"2016-04-07T08:38:24.905+0000","up_votes":1,"down_votes":1,"body":"if you didn't read i  said that we end up screaming at each other now when we play the game \nand usually its not because of the competitive nature its  because of aspects of the game that cant be avoided like someone picking yi and right clicking all of a mate so hes tilted all game long \n\njust small little shit like that\n\nit doesn't matter now cs-go is most likely gonna be our go to game \n\nnot saying i dont wanna play league anymore\nits just cs-go and other titles are becoming a more enjoyable experience\nand yeah i realize the game revolves around competitiveness but when compared to other games league is also a game that can be completly ruined if a team mate decides be salty and feed or just troll around","replies":[{"poster":"Klavinmour","date":"2016-04-07T09:09:56.711+0000","up_votes":1,"down_votes":1,"body":"League isn't the only game that can be ruined by one player.\nHave you never seen a ranked match of CS:GO ruined by one person who team kills his entire team at the start of each round?\n\nAnd don't even get me started on the balancing issues in CS:GO and how it literally is most popular gun = most powerful.","replies":[{"poster":"crystalmath","date":"2016-04-07T10:17:23.291+0000","up_votes":1,"down_votes":1,"body":"yeah i have seen cs-go if you kill 3 people your automatically kicked from the game and put on a 30 minute plus wait timer and its not popular gun = most powerful because the ak47 is the most powerful but at the same time the hardest rifle to master with a harder recoil pattern than other weapons but this isn't about cs-go remember a gun in cs-go is only as powerful if you can control the recoil and burst it properly i can see you might not have known this but thats okay this isn't about cs-go and also you can vote to kick a player from the game in csgo and have a bot that can be controlled by a player witch makes it significantly better than league for dealing with trolls ","replies":[{"poster":"Klavinmour","date":"2016-04-07T11:03:45.521+0000","up_votes":1,"down_votes":1,"body":"Bot's can't play to the same extent as a human.\n\nEspecially in LoL.\nDo you know why bots are horrible in LoL? Because LoL is about decision making, bots can't do that.\nThere is only one way that you can improve bots in games such as LoL and that is to remove the limiter on them that retards their actions and reactions.\nDo you know what happens then? You end up with something that no human can play against because it moves and acts faster than you can process it's movements and actions.\n\nKnow what happens to bots in CS:GO? They get thrashed, bots get thrashed in EVERY game they exist in.\n\nAnd no, I've got no idea how to control recoil in CS:GO. Not like I ever played in multiple tournaments for TF2, CS:Source, Unreal Tournament and several other shooters.\nHell my last competitive season of TF2 (last year) I decided I'm retiring from team based tournaments, etc.\n\nI've played a lot of games over the years, so I've got a lot of experience with how companies control trolls/griefers/etc.\nSo far Riot is the best I've seen, despite their seeming lack of effort over the last two years.","replies":[{"poster":"crystalmath","date":"2016-04-09T09:19:09.448+0000","up_votes":1,"down_votes":1,"body":"do you know what player controllable bot means ..................it means that you can take control of the bot so theres no actual ai controlling it -_- \n\nthat means that the bot wont get destroyed unless you play badly \nit sounds like you dont know alot about cs\n\ni dont want to be salty but pls stop talking","replies":[{"poster":"Klavinmour","date":"2016-04-09T11:29:31.155+0000","up_votes":1,"down_votes":0,"body":"In competitive play the bot is always killed before anyone has a chance to kill it.\n\nLike I've already stated I've put an incredible amount of time in CS:Source and some into CS:GO. But I stopped playing CS:GO because Valve know nothing about competitive play or how to balance a competitive game.","replies":[{"poster":"crystalmath","date":"2016-04-09T13:32:34.281+0000","up_votes":1,"down_votes":1,"body":"I feel like your just disregarded everything ive told you and gone and made a silly conclusion saying \"Valve know nothing about competitive play or how to balance a competitive game\"\ni doubt csgo would get best esport 2015 over league,dota and hearthstone at the international video game awards los angeles December 2015\n\nhttp://www.polygon.com/2015/12/3/9846760/the-game-awards-2015-winners\nresults of the awards night \n\nill adknowledge your opinion but wont think anything of it because you said it your self \"I've got no idea how to control recoil in CS:GO\" so how would you know what good balancing is or how the game play in general works in a game so different to league \n\nagain csgo is a balanced game for every over powered aspect in the game there is also another aspect making it balanced \n\nweapons one shoting people usually means that those weapons are hard to control and learn and take pin point accuracy like the ak47 i told you about before\n\nmaps seeming like they are sided to a team usually means that proper team communication inst being used \n\nalso yes you are right the bot can be killed before you can control it but my point was that there are options to deal with trolls and others that negatively effect the in game compared to league is clearly lacking\n\nif you have anything else to say right now please dont speak\ni really dont want to come of as a know it all but your knowledge about csgo is lacking and your quick to make assumptions based of information my sister could tell me after watching me play a single game i mean your last team based combat game was tf2 was it not? a game that does not fit the competitive scene in fps. so it sounds more like your trying to give opinions on csgo with having much experience with the game?\n\nnow talking to you has really been a blast but i feel like i should probably be talking to a csgo player about csgo\ngoodnight Klavinmour\nand good luck in the fields of justice \n\n-crystalmath","replies":[{"poster":"Klavinmour","date":"2016-04-09T15:54:48.461+0000","up_votes":1,"down_votes":0,"body":"Wow you are incredibly thick if you didn't pick up on my sarcasm when I said \"And no, I've got no idea how to control recoil in CS:GO.\" I even went on to explain how I have experience playing the games professionally.\n\nPretty sure I couldn't have played CS:Source professionally if I didn't know how to control recoil, and it's not like CS:Source isn't literally the same game mechanically as CS:GO, since CS:GO is just CS:Source with a graphical overhaul hence why I was bored of it quickly and haven't bothered to put much time into it.\n\nBy \"last\" what do you mean?\nI still play all these games, I haven't stopped playing them. I've retired from professional play, no more tournaments, no more playing for cash.\nIf anything was my \"last\" multiplayer team based game it would be LoL since I last played that several hours ago, while it's been a few days since I last played TF2.\nDo you know how much of a hassle that is?\nHere is a break down of TF2 for you.\nYou need 9 main players, Scout, Soldier, Pyro, Engineer, Heavy, Demoman, Sniper, Spy and Medic. Then you need at least one substitute for each class. You can cut down by having your back up players be multiclass so you don't need to keep track of 18 people, but it's still pretty rough.\nNow I've played in, six? seasons of TF2 competitive. It's a nightmare keeping track of 18 people like that.\nHell the reason I retired is because end of the day it's not worth it, you don't make enough money and because of that it's not worth cutting into my time with my University work in Biotechnology.\n\nIf you ever have the time and need proof that Valve know nothing about balancing games for competitive play, look up the ban list for TF2 weapons. In competitive play you are pretty much restricted to the stock weapons, unless if you're Medic then you pretty much have free rein as long as it's not the Vita Saw.","replies":[{"poster":"crystalmath","date":"2016-04-10T01:51:34.659+0000","up_votes":1,"down_votes":1,"body":"im not even gonna bother anymore with these keyboard warriors as soon as someones shows them up them become \"professional players\" and instantly know everything stop talking about tf2 its not a esport for a reason so judging valve by that is unfair \n\nthe fact that you need to bring up a completely different game to make valve sound bad talking about csgo just shows that your not even making sense now\n\nall your really saying is that tf2 isnt balanced \nim abandoning this thread please mr keyboard warrior go bother someone who cares now","replies":[{"poster":"Klavinmour","date":"2016-04-10T03:02:27.272+0000","up_votes":1,"down_votes":0,"body":"\"It's not an esport\" Yes. Despite years of tournaments. Let's see, TF2 UGC goes into it's Sixteenth Season this year.\nTF2 is an Esport, it has Tournaments it has Proleague. What else does it need?\nA rock is a rock, you can't argue against that.\n\nAlso it's not difficult to check my claims, if you even participate in a tournament through a Valve game you get a \"badge\" item in your Steam inventory. You can easily go check mine.\nBut why even bother? You're literally the poster child of modern gamers, nothing but lazy children who would even refuse to check their local timezone against an international event despite every mobile phone these days having an international clock inbuilt meaning it'd only take you a few seconds to look it up.\n\nI would talk about DotA2's balance, but Icefrog is a complete moron and was nothing more than a Public Relations face back on DotA All Stars and did nothing but fuck up back in the day when it actually game to character design or ideas on how to improve the game.\nI'd talk more about CS:GO's balance, but that was thrown out the window when they made the AK-47 more powerful than the Galil despite the fact that the Galil is the more advanced version of the AK-47 in real life, and was designed to replace the AK AND IT HAS.","replies":[{"poster":"Ripcord24","date":"2016-04-16T09:50:32.620+0000","up_votes":1,"down_votes":0,"body":"Just gonna chime in here... CSGO isn't meant to be realistic compared to real life, holding a knife with an LMG on your back doesn't make you go fast, none of the rifles should be accurate at all without aiming down sights. \n\nBut I will agree, CSGO is often just as toxic as LoL, and yet you will sometimes be matched with friendly, skilled players as well, just like LoL.\n\nAll online games are toxic, everyone just needs to deal with it.","replies":[{"poster":"Klavinmour","date":"2016-04-16T12:04:54.657+0000","up_votes":1,"down_votes":0,"body":"If you're going to use real life guns in a game, you should use stats based on those real life guns.\nEspecially if you're going to have something like the AK-47 and then it's new upgraded model the Galil which is better than the AK in every single way.\n\nThe only reason to ever make the AK more powerful than the Galil is because it's more popular, which is a bullshit reason for a game to be balanced around.\nIt's why certain weapons in TF2 will never be actually balanced.","replies":[]}]},{"poster":"crystalmath","date":"2016-04-10T04:43:42.072+0000","up_votes":1,"down_votes":0,"body":"k boss i really care pls go on =)","replies":[{"poster":"Klavinmour","date":"2016-04-10T04:45:45.260+0000","up_votes":1,"down_votes":0,"body":"And there we have it, prime example of what is wrong with the current generation.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Omni Presents","date":"2016-04-07T12:39:25.685+0000","up_votes":1,"down_votes":0,"body":"I know exactly what you mean and how you feel and also part of the reason I am still here. Honestly, what other games are there? And think long and hard about this... there are none.\n\nCS is worse in that you need to be 1000% more competitive to even think about enjoying that game. I have been here 5 years and when I tried CS I started hacking like 3 weeks in it was that bad. And I have played all variants of that game. The only one I have played recently that was actually fun was Team Fortress, but that doesn't really have many players on this side of town.\n\nYou could try DoTA, TF, CS, WoW. Unless you are a hardcore gamer there are not many games like LoL where you can, or at least used to, play without hassles, can get into a game and win or lose you still had fun. You can play 30-60 minutes a day, or 4 hours a day, you didn't feel the need to sit here for 2-3 hours every single day minimum.\n\nAll other games I have tried just feels like you need to sit at your PC daily for hours or you are wasting your time trying to be a casual. Than there are the single player games, you can play them for 12 hours and finish the main story, than you can either sit around doing all the side quests, or like some of us, feel like it was a waste as the side quests don't actually do anything to the game and you are playing for nothing.\n\nLoL is a mindless game you don't have to put effort or thought into, you can play to win, you can be serious, but you can do it one game per day and still feel like you have achieved something, that is why we still stick around, you don't feel like you need to be committed to this game to play it.","replies":[{"poster":"crystalmath","date":"2016-04-09T09:16:46.368+0000","up_votes":1,"down_votes":0,"body":"i picked up cs easy i have nearly 5 years experience with other pc fps games lol","replies":[]},{"poster":"Essembie","date":"2016-04-08T00:31:41.005+0000","up_votes":1,"down_votes":0,"body":"Overwatch?","replies":[]}]},{"poster":"Grazer","date":"2016-04-08T07:47:20.824+0000","up_votes":1,"down_votes":0,"body":"League to me is like a girl who you like a lot as a friend, and you'll hook up and play games and bang and stuff but neither of you are interested in commitment. \n\nIf I really tried to invest everything into League I know for a fact it would be disappointing and unfulfilling. Just playing for fun is enough for me to have a good time with it.\n\nYou might want to look up the Sunk Cost Fallacy if the psychology of this interests you.","replies":[]},{"poster":"Bakon","date":"2016-04-07T10:48:32.010+0000","up_votes":1,"down_votes":0,"body":"Stop taking that crystalmath, that stuff's bad for you.","replies":[{"poster":"crystalmath","date":"2016-04-07T10:56:55.892+0000","up_votes":1,"down_votes":0,"body":"lol","replies":[]}]},{"poster":"Im a CAT","date":"2016-04-07T06:33:38.412+0000","up_votes":1,"down_votes":0,"body":"Yeah, a lot of my friends that started season 1 or 2 has stop playing this game due to experiencing _terrific_ players. I mean who wants to waste time on a game where you were suppose to chill but get verbally abused by salty players e.o \n\nHowever, to rekindle your **love** for this game, try playing with friends or add players that you played while soloing if you think you can chill with them. Better still join a club and meet like-minded players.  \n\nIn terms of competitiveness you will always meet that 1 asshole player on your team or enemy team that you have to play a 45 min game with them. Just treat it as a blind date, and you were just unfortunate to meet this poor soul and move on with your life. Pretty sure you won't meet them again unless you are unlucky :/ \n\nIf you ever need someone to play with, I am typically free to join games :)","replies":[]},{"poster":"R3MAG","date":"2016-04-07T08:25:45.057+0000","up_votes":1,"down_votes":1,"body":"in response to some of the comments yes mobas are generally competitive that is the nature of that genre but the state of each player is something completely different, if u do jump into a game for example and have 4 other people on your team who are toxic its basically unavoidable to get blamed for everything by others even if they are doing wrong aswell. that being said u should be allowed to play a game and have fun thats basically been a general concensus produced by gaming since forever, and if u cant find that then wats the point of playing.\n\nif it helps though there are people out there who have same point of view of playing a game for FUN, and u can find them if u search enough, like others have posted there are different options like in games, adding new people and joining new clubs who share that point of veiw, I am basically in a club that shares that point of view of playing the game for fun and without toxicity from each other, even though were small with only bout 20 people its still better having people who share that view and want to enjoy themselves.\n\nto the original poster just try to find wat u originally loved bout the game that wanted u to play it more and that there are people out there who are the same as u and who go through the same thing, ur not alone after all it is a gaming community and not all of it is bad. :D","replies":[]}]}