{"poster":"ç MORPHEUS ç","date":"2017-11-18T20:36:55.206+0000","title":"essere bannati per un problema riot","subforum":"Discussioni generali","up_votes":3,"down_votes":9,"body":"Scusate se mi incazzo ma venire bannati perch&egrave; si va afk non per mio volere ma per un bug del gioco mi sembra una presa per il culo.Qualcuno si rende conto delle cazzate che fanno ?","replies":[{"poster":"RGM Player","date":"2017-11-19T08:09:23.162+0000","up_votes":3,"down_votes":0,"body":"Essere bennati per afk è molto molto difficile, quindi vuol dire che ti sei impegnato. Non vieni bannano per 10 partite afk di seguito, ma per molte di più. E poi, quale sarebbe questo \"bug di gioco\"? Se ti riferisci al bug spalt, basta disconnettere/riavviare il pc e si riesce benissimo a rientrare in game(se non si riavvia il problema potrebbe apparire di nuovo), magari perdi la prima wave, ma non ti rivela come afk sei non sei in game per 2/3 min e poi partecipi all'intero game.","replies":[]},{"poster":"FireM1nd","date":"2017-11-18T20:56:28.225+0000","up_votes":2,"down_votes":0,"body":"L'afk viene punito solo con il leave buster. Non  si può venire bannati per questo. Potrei sbagliarmi, naturalmente. In tal caso, per convincermi completamente della mia svista, potresti postare (se possibile) l'email dove spiegano il Ban? Grazie in anticipo","replies":[{"poster":"Εvelynn","date":"2017-11-18T21:27:36.773+0000","up_votes":1,"down_votes":0,"body":"Si può essere bannati, dipende dal tipo di partita e dalla frequenza","replies":[{"poster":"FireM1nd","date":"2017-11-19T02:47:20.120+0000","up_votes":2,"down_votes":0,"body":"Mm.  Si immagino che lasciare 20 ranked di seguito sia effettivamente un'esperienza molto negativa.  Grazie per l'informazione ^^","replies":[]}]}]},{"poster":"TZombi1234","date":"2017-11-19T14:16:59.006+0000","up_votes":1,"down_votes":0,"body":"Bannato come? Sei stato attivo sia 3 giorni fa, sia 2 giorni fa, sia ieri e sia oggi e questa discussione l'hai aperta 18 ore fa...\n{{sticker:sg-zephyr}} ","replies":[]},{"poster":"ç MORPHEUS ç","date":"2017-11-19T10:58:02.418+0000","up_votes":1,"down_votes":0,"body":"non vado afk in ranked non sono un cazzone,il bug della riot e non è la prima volta e che in fase di scelta dei champ il gioco si blocca e devo riavviarlo,questo e qello che loro considerano andare afk.Avevo già fatto presente alla Riot e loro avevano detto che era vero e lo avevano risolto ora si è ripresentato","replies":[]}]}