{"poster":"RifoWasHere","date":"2015-08-30T16:56:46.373+0000","title":"Para los que esten hartos de los Colosos","subforum":"Charlas Generales","up_votes":3,"down_votes":5,"body":"Antes que nada muy buenas tardes, mi nombre in-game es RifoWasHere y soy parte del team Feronia Skylanders.\nSeguramente no soy el &uacute;nico que esta cansado de los Colosos, los cuales estan demasiado ROTOS ahora mismo (Garen te baja la vida de una sola E, y si falta algo ya te tira otra o la ulti... Darius te puede poner 5 stacks de pasiva inmediatamente... Mordekaiser saca Dragon con su ulti y se lo lleva a linea, ademas del tremendo burst que se le puede sacar... y Skarner tiene ahora una cadena de cc todavia mejor que la de Vi, ademas de poder escaparse o perseguirte facilmente con un cristalito que sale del suelo), asi que, para los que quieran jugar sin los colosos, voy a estar creando partidas personalizadas en el servidor LAS, en modalidad reclutamiento.\nLa idea es que podamos jugar sin volver a ver Colosos hasta que saquen el siguiente parche, en el que deber&iacute;an ser nerfeados, y la partida sera en reclutamiento para poder anular la partida si vemos a alguno y banear al que lo pickeo.\n&iexcl;&iexcl;Nos vemos en la grieta!!\nRITO PLS NERF{{champion:122}} {{champion:86}} {{champion:82}} {{champion:72}}\nPD: LAS PARTIDAS TENDRAN DE NOMBRE \"NO MORE COLOSOS\"","replies":[{"poster":"LGBT Valentina","date":"2015-08-30T17:12:04.298+0000","up_votes":2,"down_votes":2,"body":"Darius esta muy mal, la pasiva ayuda de poco, lo unico bueno de la pasiva es que te haces la BC y le baja la armadura en 2 segundos\ngaren esta \"op\", pero fiora-riven-irelia siguen en su nivel o mas y no me vengas con que fiora no esta op, los mains o los que la sabian usan saben como quedo este champ, ni podes tradearle despues del nivel 4-5\nMorde, el DG sirve de poco en soloq, ya q no lo usan para pushear lo tienen de mastoca y tiene 2k de vida, so\nno tiene movilidad y aunque este su daño en la Q sea op, sigue siendo un champ MUY KITEABLE \nskarner, meh, x al menos hay un poco mas de diversidad hay q admitirlo xD","replies":[{"poster":"RifoWasHere","date":"2015-08-30T17:29:15.310+0000","up_votes":2,"down_votes":0,"body":"-Darius ahora mismo se arma tank con una hidra titanica y a la mierda todo el mundo, creeme lo he visto varias veces\n-A fiora si le puedes tradear si sabes como, si le sacas early a riven no te podra hacer snowball asi que pierde potencial, lo mismo con irelia. Garen en cambio lo unico que tiene que hacer es usar Q para tirarte y darle con la E encima, luego repetir, ademas silencia estando ecima tuyo por lo que la E te la comes casi porque a el le da la gana. Luego esta el tema de la pasiva nueva, que hace que aunque te fedees te haga mierda (lo que esta muy bien para parar snowball, pero es demasiado).\n-Morde es kiteable? si. Te hace mierda si va bot con un supp de gancho o si te acercas? TAMBIEN. Tiene un DPS insano? TAMBIEN, CON SU W. A mi no me digas que eso no esta roto. Y EXISTE EL RYLAYS POR SI NO LO SABIAS, CON ESO Y LA VELOCIDAD QUE DA LA W CON UN ALIADO TE VA A ALCANZAR SEGURO SI TE PEGA APENAS UNA HABILIDAD.\n-Si, con skarner de vuelta hay un poco de diversidad, pero esto no durara mucho mas, porque si no lo nerfean (y se supone que el martes lo iban a hacer con un mini-parche) se vera en todos lados, siendo imposible jugar sin morir de una cadena de stun y suprimir de mil años. Tampoco de lo esta viendo ya en ranked, en EUW, por ejemplo, se lo esta baneando en TODAS las partidas, y en LAS lo he visto yo mismo baneado cada vez que trato de jugar Ranked.\nEDIT 1, 10/8 14:30: Por cierto, morde no necesita mantenerse cerca de todos modos, basta con un golpe o dos con la Q. Si no me crees mira esto:\nhttps://www.youtube.com/watch?v=sdhzn20y3Ek\nhttps://www.youtube.com/watch?v=fDtdZwjJHVI","replies":[{"poster":"oh95","date":"2015-08-30T17:46:16.776+0000","up_votes":2,"down_votes":0,"body":"A skarner ya lo nerfearon y a Darius ya lo buffearon, además que la build de Darius lo principal es Black Cleaver + Deadman's Plate, esos son sus items principales, no la Hidra Titánica (que no esta mal, pero los otros items estan mejor), además que era el peorcito de los 4 y fue un buffeo merecido","replies":[{"poster":"RifoWasHere","date":"2015-08-30T17:47:28.612+0000","up_votes":1,"down_votes":0,"body":"es bueno saberlo, ¿y que nerfero hicieron a skarner exactamente?","replies":[{"poster":"oh95","date":"2015-08-30T17:54:24.783+0000","up_votes":1,"down_votes":0,"body":"Acá lo tenés, http://las.leagueoflegends.com/es/news/game-updates/patch/notas-de-la-version-516#patch-patch-updates\nComo curiosidad el Win Ratio de Skarner bajó de 63% a 56%, sigue fuerte pero no es la bestia parda de hace una semana, Darius en cambio subio de 43% a 52% dejandolo bien ahora.","replies":[{"poster":"RifoWasHere","date":"2015-08-30T18:05:52.038+0000","up_votes":1,"down_votes":0,"body":"Ty, de todos modos aun no hacen nada con garen ni morde, asi que los de las partidas personalizadas sigue en pie","replies":[{"poster":"oh95","date":"2015-08-30T18:07:46.554+0000","up_votes":2,"down_votes":0,"body":"En el PBE hay nerfeos a la Velocidad de Movimiento base y la Velocidad de Movimiento que ofrece la Q en Garen, de Morde nada por ahora.","replies":[]},{"poster":"Ascalius","date":"2015-08-30T18:24:09.239+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RifoWasHere,realm=LAS,application-id=v7qsfXsE,discussion-id=JPpa4zA9,comment-id=000000000000000000000001,timestamp=2015-08-30T18:05:52.038+0000)\n>\n> Ty, de todos modos aun no hacen nada con garen ni morde, asi que los de las partidas personalizadas sigue en pie\n\na garen le tienen nerfeos para la 5.17, esos cambios a darius y skarner fueron realizados antes por que al parecer era necesario.","replies":[]}]},{"poster":"RifoWasHere","date":"2015-08-30T18:02:45.741+0000","up_votes":1,"down_votes":0,"body":"Ty","replies":[]}]}]}]},{"poster":"LGBT Valentina","date":"2015-08-30T19:49:45.084+0000","up_votes":1,"down_votes":1,"body":"la Hidra nueva armale eso a un renek voli y dps veni hablarble, rek'sai tambien volvio arriba con este item op\n\nFiora, te gana todos los trades si sabe usarla, lo mismo riven y irelia, las 2 son dificils de gankear, en especial la ultima x juegan pasivo \nSi queres tanto ganarle a garen, compra Gnar y kitea\nMorde es RECONTRA KITEABLE MAESTRO, si se comen los pull-hook que culpa ahi? Ah no, pero morde es op, ahora si es el otro es un adc: GG SUPP\nSi es duo bot, es facil ganarle\nEsta op, pero no llega a tu punto de exageracion, ese fue Skarner y no te rusheas rilay capo con morde, te haces la garra nueva, la trini y dps el liandry, no son items baratos\n\nSkarner ya fue nerfeado, sigue op, pero who cares\n\n\nJamas dije que morde no fuera op, pero vs llegas al punto de la exageracion\nRepito: Kiteable, MUY\nDificil en lane? Si, el sustain de la W y el escudo de la E pueden joder\nDg: SoloQ no sirve ni de ward\nEarly-mid game es todo suyo\nMid-Late el adc original vuelve a ganar\nPickea una janna o lulu y morde en TF no existe, se va a mover mas lento que michetti en subida","replies":[]}]}]},{"poster":"Rock the Climber","date":"2015-08-30T20:26:04.300+0000","up_votes":1,"down_votes":0,"body":"Lo de garen y skarner a riot se les paso la mano, mira mi partida con garen http://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/240805740/200496729 encima el lee me pateo adrentro de la fuente y sali vivo sin usar flash solo caminando XD, y con skarner hice que los 5 enemegos se vayan afk http://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/239306294/200496729?tab=overview pero igual ya los nerfean. ahora darius no lo veo tan fuerte encima bajo su winrate muy brusco, y morde no lo se, algunos revientan partidas pero otros no hacen nada aunque esten super feed","replies":[]}]}