{"poster":"Vasquehh","date":"2017-02-04T22:09:33.318+0000","title":"¿Veigar fuerte y roto?","subforum":"Charlas Generales","up_votes":1,"down_votes":4,"body":"veigar es un campeon que hace demasiado da&ntilde;o magico.La verdad me gustaria que le bajaran a sus habilidades porque una ventaja que tiene es en los adc que los mata de una sola ulti claro con el stun ademas la ulti no se puede fallar la verdad pienso que se deberia bajar el da&ntilde;o magico {{champion:45}}","replies":[{"poster":"Whenkel","date":"2017-03-06T22:11:49.215+0000","up_votes":1,"down_votes":0,"body":"Items\nBotas de mercurio\nFauces de malmortius\nCimitarra mercurial\nFilo de noche\nVelo de banshee\nRey arruinador\n\nHechizos \nLimpiar y flash\n\nCampeones \nZed \nTalon\nYasuo \nDarius\nVarus\nEtc\n\nGg easy","replies":[]},{"poster":"sanaMATA","date":"2017-02-05T01:38:39.101+0000","up_votes":1,"down_votes":0,"body":"esta rotisimo pero no tiene movilidad.... aunque me  moleste su habilidad con largar q o simple e creo te mata mas con su ulti pero no tiene movilidad la cosa es que hay que saber deletearlo y agarrarlo bien pero eso depende ya como sea el team si lo agarras por detras o con base de cc o mucho daño lo matas rapido pero tenes que saber deletear aunque este rotisimo y facil de usar es","replies":[]},{"poster":"Neo der spieler","date":"2017-02-04T23:28:43.825+0000","up_votes":1,"down_votes":0,"body":"tengo maestría 7 con {{champion:45}}  como todo campeon tiene ventjas y desventajas asi como ventajas injustas \nventajas mucho daño  Q R mata cualquier adc en late game, tiene una face de lineas decente puede farmear  pasivo y a nivel 6 gank kill, \ndesventajas rango medio un mal posicionamiento y explotas. combo lento en bronce 5 1 vs 1 metes el stun pero de oro para arriba es esquivable 90 % la e y la w q tarda mucho en salir, no tiene movilidad y va con {{item:3165}} {{item:3157}} {{item:3089}}  + {{item:1001}}  te quedan 2 lugares q podes hacerte mas ap o tanke si va tanke esta algo resistente sino no es resistente \nestara fuerte pero es facil de matar en mi opinion hay campeones mas rotos como {{champion:134}}  tiene un empujon para acercarte necesitas 2 habilidades de desplasamiento y tiene 3 veces mas rango o {{champion:107}} {{champion:56}} {{champion:121}}  q tocan r q basico con 2 item y deletean al menos veigar da 5 seg para reaccionar","replies":[]},{"poster":"Numerítos","date":"2017-02-04T23:18:52.461+0000","up_votes":1,"down_votes":0,"body":"{{champion:3}} + {{summoner:1}}  = GG","replies":[]},{"poster":"Rìsotto Nero","date":"2017-02-04T22:37:28.565+0000","up_votes":1,"down_votes":0,"body":"Sion tambien tiene stack infinitos y su W es Ap, la cual mientras mas minions mate mas daño hace su W porque escala con Vida maxima, y cada minion que mates te suma vida, es lo igual a nasus, pero este pega AP","replies":[{"poster":"Forero","date":"2017-02-04T23:14:14.823+0000","up_votes":1,"down_votes":0,"body":"El daño de vida máxima es según la vida del rival, no de Sion.","replies":[]}]},{"poster":"SnowHorse","date":"2017-02-04T22:33:00.731+0000","up_votes":1,"down_votes":0,"body":"tiene fortalezas y debilidades marcadas, en el balance general es campeón es regular...  ahora si estas en partidas que se estiran, la gente no sabe aprovechar las ventanas y oportunidades, no saben apretar a los carrys de los otro equipo, y si, mientras mas sencillo sea el campeón mas sensación de que esta OP genera, no es distinto de lo que le pasa a mucha gente jugando vs una annie por ejemplo, o en top vs un darius","replies":[]},{"poster":"Yrox the Third","date":"2017-02-04T22:11:29.042+0000","up_votes":1,"down_votes":0,"body":"Obvio que Veigar va a estar fuerte si es el unico campeon con AP infinito, y mientras mas larga sea la partida, mas ap tendra, asi que si para los 40min+ de la partida no puede oneshottear a un adc entonces hizo todo su trabajo mal.","replies":[{"poster":"Vasquehh","date":"2017-02-04T22:17:15.603+0000","up_votes":1,"down_votes":1,"body":"pero sin duda veigar es facil de usar por lo cual tendria mucho ap y seria facil oneshottear a un adc","replies":[{"poster":"Yrox the Third","date":"2017-02-04T22:21:36.023+0000","up_votes":1,"down_votes":0,"body":"Osea, por que un campeon es facil de usar debe ser nerfeado?","replies":[]}]}]},{"poster":"Maycoltf2","date":"2017-02-04T22:18:02.579+0000","up_votes":1,"down_votes":0,"body":"Sacrificas tu resistencia por daño como adc , obviamente tendrás problemas con Veigar , te recomiendo esperar a que use su E o R para poder mandarte contra el.","replies":[]}]}