{"poster":"santifir45","date":"2015-03-07T21:50:02.740+0000","title":"Ayudemos a cerrar empresas de Elobost","subforum":"Comportamiento del jugador","up_votes":5,"down_votes":2,"body":"Una de las cosas más molestas de del juego es la cantidad de cuentas con elobost ya sabemos que riot hace su parte aplicando Ban a los usuarios que usan esos servicios pero nosotros también podemos hacer nuestra parte lo que yo propongo es que usemos los foros para compartir esas páginas ya sean de Facebook Twitter etc y las denunciemos para que sean cerradas así la gente se tengan que esforzar para llegar a ligas altas y que la gente que cobra por el elobost dejen de empeorar la jugabilidad para los jugadores de ligas altas.\r\n\r\nEste es el primer caso que les traigo que además hacen sorteos de rp para atraer más gente.","replies":[{"poster":"Smiteee3","date":"2015-03-08T00:53:43.155+0000","up_votes":1,"down_votes":0,"body":"espera a que den los premios despues que la cierren","replies":[{"poster":"LGBT Valentina","date":"2015-03-08T01:46:24.159+0000","up_votes":3,"down_votes":0,"body":"http://33.media.tumblr.com/tumblr_m6cb730RqK1rwl09fo2_250.gif","replies":[]}]},{"poster":"Princess Mipha","date":"2015-03-09T16:01:15.205+0000","up_votes":2,"down_votes":0,"body":"Me parece buena tu propuesta pero lamento informarte de lo siguiente: \n\nHace mucho tiempo mandé un ticket a soporte indicando qué podían hacer ellos para cancelar o sancionar a la gente que ofrecía estos servicios (mandé link de la página que venía con el nombre de invocador que eloboostea incluido) y su respuesta fue que ellos no tenían autoridad para interferir en páginas o productos de este tipo, es decir, lo ÚNICO que puede hacer Riot es sancionar a la persona en cuestión cuando se verifica que ha utilizado eloboost.\n\nEn conclusión: de nada sirve que nos pongamos acá a denunciar y poner páginas de twitter, face o lo que sea que promocionen el eloboost, porque no pueden ser cerradas por Riot.\n\nSaludos\nJyanne{{champion:40}}","replies":[]},{"poster":"VodDoo","date":"2015-03-09T03:47:35.611+0000","up_votes":2,"down_votes":0,"body":"Para que paga la gente eloboost? Si la van a usar un par de veces en platino o diamante, de acuerdo a lo que pidan y después van a terminar clavados en oro V","replies":[]},{"poster":"arondightFTW","date":"2015-03-08T08:39:41.662+0000","up_votes":2,"down_votes":0,"body":"me da lo mismo. yo no voy a hacer el trabajo de RIOT. ellos tienen herramientas para identificar eloobost, si en vez de mejorarlo, se ponen a hacer cosas para ganar mas dinero, es su problema. \n\nsi a vos te gusta hacerlo, bien. pero ese tiempo que vas a gastar, para hacerte mala sangre denunciando algo que ellos lo toman como baja prioridad, lo podrias usar para jugar. \n\nantes hacia cosas por el juego, hasta que te das cuenta que los de soporte te toman el pelo, te mandan copy paste, las mayorias de las veces lo hacen sin leer. y si lo decis en el foro, te banean.\n\nellos dicen que les ayudes, pero siempre demostraron, y mucho mas en los baneos en el foro. que no quieren ayuda de nada.","replies":[{"poster":"IrishRageQuitter","date":"2015-03-13T15:30:14.650+0000","up_votes":1,"down_votes":0,"body":"Jojojo, impecable comentario!!!","replies":[]}]},{"poster":"gambito700","date":"2015-03-07T22:27:30.490+0000","up_votes":2,"down_votes":1,"body":"me parece buena la idea. pero hay no dicen que ellos hagan elo bost. solo dice que hacen sorteos. yo puedo abrir una paguina de fb que se llame best diamante LAS y no por eso sere el mejor diamante de LAS. (no soy ni bronce)","replies":[]},{"poster":"GoldenSheep","date":"2015-03-08T02:42:55.434+0000","up_votes":1,"down_votes":0,"body":"cuanto cobran? okno","replies":[]},{"poster":"mauro71404","date":"2015-03-07T22:14:33.566+0000","up_votes":1,"down_votes":0,"body":"No. Que sigan haciendo sorteos :DD","replies":[]},{"poster":"Agnatus","date":"2015-03-09T13:57:37.702+0000","up_votes":1,"down_votes":1,"body":"estoy de acuerdo, es un servicio de buen lucro que deben prestar para la gente incapaces, discapacitadas, retardadas, inútiles, etc. tantos sinónimos.\n","replies":[]}]}