{"poster":"Kleiber","date":"2016-10-13T20:25:32.662+0000","title":"Schlechtes Ränkedsystem und dessen bewertung","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":18,"body":"Hi \r\n\r\nIch glaube vielen Leute geht es so das sie meinen das das jetzige rankedsystem unfair ist. JAJAAJA Riot sagt jeder bekommt mal feeder afks und so ins team das stimmt schon aber nur 1 guter spieler pro 20 spiele ist schon echt schlecht. Jeder spieler sollte eine individuelle Note bekommen die es eh schon gibt und diese sollt f&uuml;r die Bewertung des spiels im rankedsystem genommen werden und nicht ob man gewonnen hat.","replies":[{"poster":"RAG Ryve","date":"2016-10-13T20:32:15.272+0000","up_votes":4,"down_votes":0,"body":"Nope, ist ein Teamgame und keine Sologame. Das spielt geht nunmal danach wer besser zusammenspielt und nicht ne bessere Wertung für sich selbst rausschlägt. Und die Aussage das nur 1 guter Spieler in 20 Games vorkommt ist schlichtweg falsch. Entweder bist du in der Hinsicht eindeutig zu überheblich oder du spielst in Bronze wo die Leute drin sind die das Spiel erst lernen.","replies":[{"poster":"Kleiber","date":"2016-10-13T20:35:05.026+0000","up_votes":1,"down_votes":6,"body":"> [{quoted}](name=RAG Ryve,realm=EUW,application-id=KYnfKGf0,discussion-id=Rz3lr10V,comment-id=0000,timestamp=2016-10-13T20:32:15.272+0000)\n>\n> Nope, ist ein Teamgame und keine Sologame. Das spielt geht nunmal danach wer besser zusammenspielt und nicht ne bessere Wertung für sich selbst rausschlägt. Und die Aussage das nur 1 guter Spieler in 20 Games vorkommt ist schlichtweg falsch. Entweder bist du in der Hinsicht eindeutig zu überheblich oder du spielst in Bronze wo die Leute drin sind die das Spiel erst lernen.\n\n\nja genau das meine ich die Leute sind zu .... um als team zuspielen und wollen immer nur kills kills kils und feeden die gegener dabei übelst oder verlieren Objekte","replies":[{"poster":"Temudschinn","date":"2016-10-13T22:01:07.303+0000","up_votes":3,"down_votes":0,"body":"> ja genau das meine ich die Leute sind zu .... um als team zuspielen und wollen immer nur kills kills kils und feeden\n\nUnd als Lösung gegen Killgeilheit forderst du, dass das Rating neu von den Kills abhängt? Ist dir klar, wie unendlich absurd das Zeug ist dass du da von dir lässt?","replies":[{"poster":"Uranbrennstab","date":"2016-10-14T06:51:32.972+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Temudschinn,realm=EUW,application-id=KYnfKGf0,discussion-id=Rz3lr10V,comment-id=000000000001,timestamp=2016-10-13T22:01:07.303+0000)\n>\n> Und als Lösung gegen Killgeilheit forderst du, dass das Rating neu von den Kills abhängt? Ist dir klar, wie unendlich absurd das Zeug ist dass du da von dir lässt?\n\nIhm ist nicht einmal klar, dass es keine Umlaute in der englischen Sprache gibt.","replies":[]}]},{"poster":"0815xand0r","date":"2016-10-13T21:32:06.091+0000","up_votes":3,"down_votes":0,"body":"Also zum einen ist die Benotung am Ende absolut ungeeignet, um deine Leistung im Spiel wiederzuspiegeln, da sie nur deine Leistung mit diesem Champion auf dieser Position in Relation zu anderen Spielern, die diesen Champion auf dieser Position gespielt haben, setzt. Ob du also für dein Team nützlich warst oder überhaupt gut gespielt hast, ist dabei egal. Nehmen wir einen Champ, der nahezu nie gespielt wird und schon wirst du selbst mit schlechten Stats gute Bewertungen bekommen, weil der Vergleichspool einfach zu klein ist.\n\nZum anderen ist und bleibt LoL ein Teamspiel. Und wie heißt es so schön: There is no \"I\" in Team. Wie gut du für dich allein gesehen spielst, ist egal. Ob du nun hard feedest oder hard carriest spielt keine Rolle. Wichtig ist am Ende nur, welches Team gewonnen hat. Denn du gewinnst als Team, du verlierst als Team. Man kann es auch so betrachten: hättest du wirklich so toll gespielt, dann hättest du das Spiel auch für dein Team gewinnen können. Viele glauben, nur weil sie eine gute KDA und guten Farm haben, würden sie gut spielen. Mitnichten. Das sind nur Werte, die ein Indiz sein können. Aber sie sagen noch lange nicht aus, ob man nun wirklich gut war.\n\nGuck dir doch mal professionelle Spiele an. Da wirst du feststellen, dass es Teams gibt, die bspw. während der Weltmeisterschaft Poppy auf der Toplane picken, im Wissen darum, dass sie die Lane verlieren wird. Sie wird am Ende keinen guten Farm haben und vermutlich auch nur eine mittelmäßige KDA. Aber trotzdem kann sie das Team carrien. Auf der anderen Seite gab es auch die Fälle, in denen ein Spieler massiv ahead war, die Lane hart gewonnen, gute KDA, guter Farm und trotzdem schlicht und ergreifend keinen Impact im Mid- und Lategame.\n\nUnd so ist es auch in der SoloQ. Nicht deine Stats zählen. Nicht der Farm, nicht die Kills, nicht die tollen Outplays 1v1. Es zählt nur, ob du es schaffst, deinem Team zu helfen, das Spiel zu gewinnen. Dabei ist es egal, wie du es machst. Und wenn du als Tryndamere 0/12 mit 150 Farm nach 30 Minuten stehst und einfach 24/7 splitpushst und dadurch den Sieg gewinnst, dann ist das gut.","replies":[]}]},{"poster":"AidsOfSpades","date":"2016-10-13T20:35:49.853+0000","up_votes":1,"down_votes":6,"body":"Seine Idee ist an sich nicht schlecht. Das Problem ist nur, dass die \"Note\" die du am Ende bekommst keinerlei Aussage über dein Gameplay abliefert. Des weiteren kann man nicht außer Acht lassen, dass er das Spiel immer mit seinen Teammates verliert - er könnte ja carrien? :)\nNatürlich hast du recht wenn du sagst, dass es ein Teamspiel sei. Das ist es auch.","replies":[{"poster":"Temudschinn","date":"2016-10-14T09:03:13.427+0000","up_votes":2,"down_votes":1,"body":"Doch. Seine Idee ist schlecht. Sobald du beginnst, irgendetwas ausser dem Sieg zu bewerten, kann es Situationen geben in denen man für suboptimale Entscheidungen mehr LP erhält als für perfekte Plays. Und diese Vorstellung ist fürchterlich: Dann sind die Topränge nicht mehr mit den Leuten besetzt, die am besten im gewinnen sind, sondern mit denen, die die Wertungskriterien am besten ausnutzen und kennen.","replies":[{"poster":"CYPHΕR","date":"2016-10-14T09:12:40.252+0000","up_votes":1,"down_votes":0,"body":"Genau. Denn aktuell bewertet das System auf Dauer (ganz ganz simpel ausgedrückt) wie gut jemand seine Möglichkeiten ausnutzen kann, um ein Match in einen Sieg zu verwandeln.","replies":[]}]}]}]}]}