{"poster":"Kleiber","date":"2016-03-17T15:19:03.321+0000","title":"Was ist mit der LoL Kommunity los","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":4,"body":"Habe 8 Spiele in Folge verloren weil in jedem Spiel immer irgend jemand ist der meinen muss zu trollen, afk geht, flamt. Und wenn man gegen diese leute etwas sagt wird man direkt von allen anderen spielen im eigenen Team und gegener Team als Flamer und toxic abgestempelt. Was diese leute auch f&uuml;r Probleme haben sollten diese nicht an anderen Spielern auslassen. LoL macht eigentlich gro&szlig;en Spa&szlig; aber nicht solchen Menschen ist das Spiel einfach nur der Gr&ouml;&szlig;te ....... . Hab dich Trotzdem Lieb LoL","replies":[{"poster":"MeMyselfandBaal","date":"2016-03-17T16:07:00.327+0000","up_votes":2,"down_votes":0,"body":"Die Frage ist ja: was kam zuerst? Die Niederlagenserie oder die toxischen Mitspieler? Ich tippe aus eigener Erfahrung auf ersteres.\n\nIch kenne das von mir selber nur zu gut. Diese Saison lustiger Weise nur mit einem Champion: Janna. Warum? Weil ich Janna (meinen letztjährigen Main und den derzeit stärksten Support für die SoloQ) nicht zum laufen bekommen habe. Ich hatte nach 20 Spielen eine Winrate von 20%... die danach auch erst mal nicht mehr besser wurde. Warum? Weil mich mein eigenes Janna Spiel selbst so gestört hat, dass ich auf jede Kleinigkeit gereizt reagiert habe. \n\nKlassisches Beispiel: Normalerweise denke ich mir, wenn irgendwo das First Blood abgegeben wird \"Shit happens\"... wenn ich so eine Niederlagenserie habe, wie du jetzt, denke ich an der Stelle sofort \"nicht schon wieder\"... In dem Moment, wo du dich über solche Kleinigkeiten aufregst, hat sich nicht die Community sondern du verändert...\n\nWas an der Stelle hilft... ne Pause machen. Einfach mal nen paar Tage kein LoL zocken. Und wenn doch, dann nur unranked. Das wirkt meistens Wunder.","replies":[]},{"poster":"Pain Hail","date":"2016-03-17T15:50:59.256+0000","up_votes":2,"down_votes":0,"body":"Wenn jemand schlecht spielt und du was dagegen sagst dann bist du halt ein Flamer, der Typ weißt ganz genau das er kacke spielt(oder auch nicht).\n> **Dies:** Und wenn man gegen diese leute etwas sagt wird man direkt von allen anderen spielen im eigenen Team und gegener Team als Flamer und toxic abgestempelt.\n**und dies:** Was diese leute auch für Probleme haben sollten diese nicht an anderen Spielern auslassen.\n\nDa ist jemand wohl toxisch und sieht es nicht ein.","replies":[]},{"poster":"MilliDieFrau","date":"2016-03-17T15:41:24.904+0000","up_votes":1,"down_votes":0,"body":"Hai,\n\nes kommt immer darauf an, was man macht und wie man sich ausdrückt. Wenn dann von dir auch nur der kleinste Hauch von Flame kommt, bist du (auch) der Böse. \n\nUnd was ist, wenn der vermeintliche Troll gar nicht trollt? Meiner Meinung nach wird Fehlverhalten schnell als Trolling abgestempelt; also wenn man mal schlecht farmt oder auf die falsche Taste drückt oder eine Situation falsch einschätzt (es tut mir leid, ich lerne noch. Ehrlich.).\n\nFlame ist aber generell nicht okay. Wenn man ein Spiel so ernst nimmt, dass man andere deswegen beleidigt, ist das ziemlich uncool.\nAFK.. ja, ist auch doof.\n\nKopf hoch, es kommen bessere Spiele! \n\nViele Grüße,\nMilli","replies":[]},{"poster":"Freiherr Alex","date":"2016-03-17T15:36:07.468+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Freiherr Alex","date":"2016-03-17T15:36:58.883+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=seipelsche,realm=EUW,application-id=KYnfKGf0,discussion-id=ABaxp6al,comment-id=0000,timestamp=2016-03-17T15:36:07.468+0000)\n>\n> Vielleicht mal mehr drauf achten ob du vll die Falschen Worte wählst wenn du schon unbedingt was sagen musst. Halt dir vor Augen: Flame wird Bestraft (auch deiner aus der Wut herraus), jemand der in einem Bad Game mal 15 Tode hat nicht. Und wenn wer AFK geht wird derjenige ohnehin bestraft, auch wenn nur 1 ihn Reportet. Generell ist \"9x Report\" immer Unnötig.\n> \n> Kann den ärger verstehen, vor allem da du laut MH nichtmal so schlecht gespielt hast...mehr als Glück wünschen kann man nich, sry :)","replies":[]}]}]}