{"poster":"Spicavius","date":"2018-05-08T09:22:11.534+0000","title":"Kein Fortschritt im Spielerverhalten in LoL","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":3,"body":"Hi!\r\nIch wollte mal eure Meinungen zum Thema Spielerverhalten wissen.\r\n\r\nAls Season 1 Spieler konnte ich bisher sehr gut beobachten, dass Riot, im Thema Spielerverhalten, mal schlechte und mal gute Phasen und vorallem IMMER **Fortschritt** hatte.\r\n\r\nIch sehe immer wieder, dass Riot am Spielerverhalten Besserungen macht. Aber jetzt seit gut 3 Jahren hatte dieses Instant-Feedback-System keinen sp&uuml;rbaren Fortschritt gehabt. Es bannt in den meisten F&auml;llen &quot;nur&quot; die Hardcore-Flamer. Die Leute, die zu dumm sind, um zu verstehen, dass das System sie bannen wird und die einfach nicht aufh&ouml;ren k&ouml;nnen jedes Spiel zu flamen/meckern.\r\n\r\nSo aber dann gibt es die &quot;neutrale&quot; Spielerschaft. Die, die am meisten (in meinen Augen) Flame und Toxicness in LoL zustande bringt. Das ist der Flamer, der mal einen schlechten Tag hat und deswegen anf&auml;ngt st&auml;ndig rumzuheulen wie kacke doch sein Team ist und die Moral vom Team senkt oder gar im alleingang das Spiel f&uuml;r alle wegen seinem Verhalten versaut. &quot;Meh das macht keinen Spa&szlig; mehr. Mir wurde der Spa&szlig; versaut also versaue ich euch auch den Spa&szlig;&quot; So ungef&auml;hr stelle ich mir so einen Spieler vor.\r\n\r\n\r\nDie neutrale Spielerschaft kriegt im Grunde niemals mit dem IFS (instand-Feedback-System) Probleme. Die flamen zu wenig aber genug, dass der Anschein entsteht s&auml;tndig Flamer im Spiel zu haben. Es ist auch nie krasser Flame. Eher sowas wie &quot;we lost&quot;, &quot;this jungler wtf so bad&quot;, &quot;FF at 20&quot;. Rumgeheule eben.\r\n\r\nDiese Spielerschaft wird garnicht erst angefasst.\r\n\r\nDie letzten Jahre merke ich kaum Besserung, Kurzzeitig gab es weniger Flame wegen dem Honorlevel. Um das Honorlevel zu verlieren muss man sich aber schon ziemlich anstellen.\r\nDieser dauerhafte Flamelevel ist immer da. Es gibt immer einen gewissen Flame/Blame/Rumgeheule. Dieser hat sich nicht verbessert (nur bei den Honorlevels).\r\n\r\nIch wei&szlig; ja nicht wie es mit anderen Season 1 Spielern ist, aber ich habe aufgrund der Flamer/Tilter/Afkler irgendwie die Lust am Spiel verloren.\r\nVorallem weil Afk nicht stark genug bestraft wird. Auch hier seit Jahren keine Besserung. Das Spiel macht Spa&szlig;, aber die Spielerschaft mit ihrem Blame/Afk ist super nervrig und das &uuml;bertrifft **mittlerweile** die Vorteile von LoL.\r\n\r\nWie sehen es andere langwierige Spieler?","replies":[{"poster":"MeMyselfandBaal","date":"2018-05-08T13:12:04.869+0000","up_votes":3,"down_votes":0,"body":"Also ich muss den TE ja grundlegend recht geben... Frage mich aber: Ist das wirklich so schlimm?\n\nZumindest in meiner Spielerfahrung ist die LoL Community mittlerweile an einem Punkt angekommen, in der es echt... ertragbar geworden ist. Mittlerweile lese ich ein Mal im Jahr \"Cancer\", wenn überhaupt. \n\nUnd das Spieler ihre Emotionen im Chat auch mal zeigen... in dem sie ein \"FF20\" raushauen... oder eine Abstimmung zur Aufgabe starten... oder mal ein \"OMG why no SS\"... klar, ich mute die dann meistens. Aber wenn ich komplett Emotionslose Mitspieler erleben will, muss ich halt Einzelspieler-Kampagnen spielen. \n\nUnd wenn ich den TE richtig verstehe, will er jeglichen Ausbruch von Emotionen, selbst wenn man danach vernünftig weiter spielt, bestraft sehen... da frage ich mich halt: Muss das sein? \n\nDazu kommt ja, dass es auch keinen vernünftigen Vorschlag gibt, wie diese Spieler bestraft werden sollen... Also kann es wirklich gewollt sein, dass jeder, der ein Mal ein \"We lost this\" im Spiel raus haut, einen 14 Tages Bann bekommt?\n\nOh und es gibt die indirekten Strafen, die man aber nur selten mitbekommt... halt über das Honorlevel. Also ich habe ja einen Kumpel, der auch gerne so reagiert, wie es der TE beschreibt. Und der hat dann plötzlich ein für mich völlig unbekanntes Problem: Er hat haufenweise Kisten, kann diese aber nicht öffnen... Ich dagegen habe 2 Accounts, die kurz vor Honorlevel 4 sind.. und deswegen auf jedem Account 14 Schlüsselfragmente rumliegen. Und ja, das nervt ihn... aber er ist halt auch ein sehr emotionaler Spieler. \n\nUnd ich würde den wirklich nicht als klassisch toxisch beschreiben. Aber er reagiert halt emotionaler als ich... und kriegt dafür auch indirekt seine Strafen...","replies":[{"poster":"Spicavius","date":"2018-05-08T22:11:42.883+0000","up_votes":2,"down_votes":0,"body":"Ich muss auch sagen, dass ich im Verlaufe der Diskussionen bemerkt habe, dass ich mehr ein Problem mit AFKler habe als mit Flamern, weil ihr habt ja recht. Die sind wirklich nicht allzu schlimm, weil man eben die Mute-Funktion hat.\n\nNur Afkler versauen einem das Game und kriegen dafür in meinen Augen eine nicht ausreichend gute Strafe. Diese Strafe ist nicht sehr hart.\nhttps://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/cvwFEXnB-leaverbuster-effektivernerviger-gestalten\nDamals habe ich einen Vorschlag gemacht. (Aber vermutlich an der falschen Stelle)^^","replies":[]}]},{"poster":"Nordwolf87","date":"2018-05-08T10:52:43.628+0000","up_votes":1,"down_votes":0,"body":"Ich bin kein flamer aber du musst eins bedenken: Wir sind alle Menschen und jeder kann mal nen schlechten tag haben. Stress in der arbeit, probleme zu hause (freundìn/gattin/kinder/eltern etc), streit mim nachbarn, schaden am Aito, geplatzter Fernurlaub usw. Das kann man dann nicht mim loginbutton abstellen.  Daher finde ich persönlich es gut, dass hier das system nicht gleich spanische inquisition spielt sondern darauf rücksicht nimmt.\n\nWie du richtig sagst, wenn es sich häuft gehört und wird es bestraft, aber man sollte auch msl die Kirche im Dorf lassen und bedenken, dass ein gewisses maß (!!!) an emotionen menschlich ist.","replies":[{"poster":"Noxempire","date":"2018-05-08T10:59:42.338+0000","up_votes":3,"down_votes":0,"body":"https://m.youtube.com/watch?v=sAn7baRbhx4","replies":[]},{"poster":"Spicavius","date":"2018-05-08T11:13:35.399+0000","up_votes":2,"down_votes":0,"body":"Hmm. Vermutlich habe ich einfach eine wirlich dicke Welle an AFKlern und Flamern abbekommen und seitdem turnt mich LoL ab.\n\nDie Frage war. Wieso spiele ich ein Spiel, was alleine absolut nicht mehr spielbar ist. Man MUSS mit mindestens 3 Freunde zusammen spielen.\nWieso gibt man sich diese FLamer/Afkler/Blamer immer und immer wieder. Es gibt so viel mehr was deutlich entspannter und deutlich mehr Spaß macht.\n\nIch finde es nur schade, weil genau Spieler wie ich von LoL Distanz nehmen. Und ich gehöre eindeutig zu der Kern-Community von LoL. Wenn der Flame/Afk Spieler aus dieser Kern-COmmunity raus ekeln, dann läuft gewaltig etwas schief in LoL.\n\nVllt gibt es auch immer wieder einen kleinen Teil an Spielern, die aufhören LoL zu zocken, weil sie einer der wenigen waren, die am Stück so viele Akfler abbekommen haben, dass einfach dieser Ekelfaktor zu LoL zu groß ist.\n\nE-Sport ist klasse. Hoffentlich verliert LoL nicht irgendwann die gute Kern-Community. W#re schade um den LoL E-Sport. Aber wer weiß wie viele aufgehört haben wegen den unzureichenden Strafen und somit der Häufigkeit der Spiele, die durch AFK/Flame versaut wurden. \n¯\\_(ツ)_/¯","replies":[]}]},{"poster":"Izaya Kumiho","date":"2018-05-08T10:03:54.297+0000","up_votes":3,"down_votes":3,"body":">Es bannt in den meisten Fällen \"nur\" die Hardcore-Flamer.\n\nDie letzten paar QQ-threads mit Chatlogs zeigten relativ wenig Flame tbh. Alles wird bestraft- egal wie \"krass\" der Flame war.\n\n>So aber dann gibt es die \"neutrale\" Spielerschaft. Die, die am meisten (in meinen Augen) Flame und Toxicness in LoL zustande bringt.\n\nWo sind diese Spieler neutral, wenn sie in deinen Augen den meisten Anteil an Flame'n'Hate an den Tag bringen?\n\n>Die neutrale Spielerschaft kriegt im Grunde niemals mit dem IFS (instand-Feedback-System) Probleme. Die flamen zu wenig aber genug, dass der Anschein entsteht sätndig Flamer im Spiel zu haben. Es ist auch nie krasser Flame. Eher sowas wie \"we lost\", \"this jungler wtf so bad\", \"FF at 20\". Rumgeheule eben.\n\nAuch diese Leute werden bestraft, wenn jemand sie reported. Du bekommst nur nicht immer ein Feedback.\n\nDu musst dir immer vor Augen halten, wie viele Menschen League auf EUW und den anderen Servern spielen. Es gibt immer Personen, die mental Probleme haben, geistlich ein Kind sind oder einfach nur eine miese Erziehung genossen haben. Das kannst du bei so einer großen Zahl nicht umgehen.\n\n\n> Um das Honorlevel zu verlieren muss man sich aber schon ziemlich anstellen.\n\nDas erinnert mich an 'nem Fall mit einem Streamer. Mein Duo-mate und ich, sind mit einem seiner Streamerfreunden in ein Game gegangen. \n\nDieser Dude hat einfach ohne Nachfrage seinen Stream gestartet und ging Bot. Ich wurde als Support eingetragen und hatte 0 lust auf unseren Streamerkerl. Also pickte ich Nami und versuchte einfach Spaß am Spiel zu haben.\nJedoch hatte mein bronze4 Adc einen anderen Plan: Voll serious in einem Normal sein und die Gegner ohne CS durchgehend fighten zu wollen!\nEr ging vor die Hunde, ich kam raus. Das ganze passierte ein paar mal und er fing an mich zu blamen. Es war nicht viel im Chat, nur vielleicht drei, vier böse Wörter...\n\nMeanwhile im Ts3 mit meinem Duo-partner: \"Was geht da auf der Bot ab? Warum ist der so sauer? Alles okay dort?:D Soll ich runter Tp-en?\"\n\nNach dem Game folgte ein \"report nami\" von dem Streamer und er kassierte meinen Report zur selben Zeit ein.\nIn meinem Hintergrund lief sein Stream, weil der Dude seinen Link in den Chat geworfen hatte.\n\nNach 10 sec Delay erklang ein Schrei aus dem Stream...\n_\n\"WTF ICH HABE EINE CHATSPERRE?! WAS?!\"\n_\nDer Rage war Godlike.\nMein Duo-partner und ich haben darüber mehr als eine halbe Stunde drüber lachen können. \nWir wurden beide von seinem Stream gebannt, als er plötzlich die zwei Zuschauer bemerkte :D \n\nWorth it.\n\n\n**Was lernen wir daraus? Man kann auch sehr schnell die Honorstufe verlieren :D**\n\n\n>Ich weiß ja nicht wie es mit anderen Season 1 Spielern ist, aber ich habe aufgrund der Flamer/Tilter/Afkler irgendwie die Lust am Spiel verloren.\n\nVersuch doch mal den Chat zu muten und dir einen Clan/ eine Gruppe zu suchen, die mit dir spielt. Wenn du dich gut mit den Leuten verstehst, dürftest du auch wieder Freude am Spiel haben.\n\n\n>Vorallem weil Afk nicht stark genug bestraft wird. Auch hier seit Jahren keine Besserung. Das Spiel macht Spaß, aber die Spielerschaft mit ihrem Blame/Afk ist super nervrig und das übertrifft mittlerweile die Vorteile von LoL.\n\nHuh, alles was das Spiel verlässt, wird vom System automatisch als reported geflagged.\nAußerdem haben deine Gegner genauso auch mal Afk-ler. Das passiert. Was willst du denn auch dagegen machen? Die Leute für alles Permabannen und nach einem Jahr wieder hier hinkommen mit den Worten :\"Yo league ist langweilig weil wir 5h Queue-time haben\"? \nWer zu oft Afk geht, oder in einem Ranked als afk geflagged wird, muss 5-60min (normal) und 30min-2h(ranked) warten. Zusätzlich verlieren rankedafkler mehr LP, egal ob das Game gewonnen oder verloren worden ist.\n\nedited:bamboozled mit der zeitform.","replies":[{"poster":"Spicavius","date":"2018-05-08T10:40:25.081+0000","up_votes":1,"down_votes":0,"body":"> Die letzten paar QQ-threads mit Chatlogs zeigten relativ wenig Flame tbh. Alles wird bestraft- egal wie \"krass\" der Flame war.\n\nNe der Flame, der da gezeigt wird, ist heftig. Diese Leute sind auch wie ich beschrieben habe dumm genug um nicht zu verstehen, dass ständige Nervensägen sind. Die schreiben mehr als ich in 20 Spielen geschrieben habe.\nDas ist ein extremes Ausmaß. Demnach auch heftiger Flamer/Spielverderber.\nEs geht um die \"Ab und zu\" Flamer. Diese Leute sind die wahre Qual in LoL und nicht die \"hefitgen\" Flamer.\n\n> Wo sind diese Spieler neutral, wenn sie in deinen Augen den meisten Anteil an Flame'n'Hate an den Tag bringen?\n\nDie gesamte Anteil. Jeder trägt einbisschen dazu bei und niemand schlägt aus dem Bogen raus, ABER die Gesamtheit dieser vielen kleinen Beiträge führt zu einem negativen Bild und auch ein insgesamt negatives Spielklima.\n\n> Auch diese Leute werden bestraft, wenn jemand sie reported. Du bekommst nur nicht immer ein Feedback.\n\nSeit Season 1 habe ich wirklich viele Spieler kennengelernt (im Freundeskreis und bei der Arbeit). Sooo viele sind kleine Flamer/Blamer, die ständig mal ab und zu einen dummen Spruch bringen. Niemand von denen hat jemals eine CR bekommen niemand.\nIch rede hier von 30 Personen mit denen ich in mehreren Seasons zusammengespielt habe und ihr Verhalten auch gesehen habe.  Niemals kamen Strafen.  Also wird es bei anderen Spielern nicht anders sein.\n\n> Das erinnert mich an 'nem Fall mit einem Streamer.\n\nDieser \"Streamer\" zählt nicht zu der neutralen Spielerschaft. Er ist einer derjenigen die dumm genug sind immer wieder im selben Spiel mehrere Male zu blamen und \"Report XX\" zu schreiben.\n\nDas ist der typische Flamer. Der nach kA 2 Wochen seine erste CR kriegt, wenn er sich oft so verhält. (Vermutlich wird er oft Reportcalls machen)\n\n> Versuch doch mal den Chat zu muten und dir einen Clan/ eine Gruppe zu suchen, die mit dir spielt. Wenn du dich gut mit den Leuten verstehst, dürftest du auch wieder Freude am Spiel haben.\n\nSchön wärs. Ich mute seit Jahren Flamer, aber AFKler sind die Hölle. Ich hatte das auch schon 2-3 Male, dass ich 2-3 Spiele an einem Tag afk war, weil ich Internetprobleme hatte.\n\nDafür hätte ich eine Strafe kriegen sollen. Es gab NICHTS. Nur einen Hinweis, dass es nicht gut ist Afk zu sein. Wow Riot. Das hat mich so richtig abgeschreckt.... Nicht mal 5 malige 5 Minuten Strafe gab es..\nDie AFK Strafen sind sowieso der größte Witz. Es gibt einige Ausnahmen, die es wirklich stört, aber die viele interessiert doch diese Strafe nicht. oh wow 5 minuten. Oh Wow 5 Mal 20 Minuten. Oh Krass. Hmm was mache ich denn jetzt nun? Huch eine Folge Anime dauert ja exakt 20 Minuten? Nice.\nLP juckt nicht. Die Strafe sollte wirklich krasser sein als nur läppische (auf höchter Strafstufe xD ) 20 Minuten.","replies":[{"poster":"Izaya Kumiho","date":"2018-05-08T15:30:54.435+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Spicavius,realm=EUW,application-id=KYnfKGf0,discussion-id=10HNUu8F,comment-id=00020000,timestamp=2018-05-08T10:40:25.081+0000)\n>\n> Ne der Flame, der da gezeigt wird, ist heftig. \n\ntfw you have like 5 threads in your head and all of them have been deleted...\n\nsheesh. Ich könnte natürlich die wayback-seite fragen,aber...eeeh.\nJetzt stehe ich hier ohne proof da. Unlucky.\n\nIn den meisten Fällen handelt es sich um starken Flame. Aber es gibt durchaus auch Chatlogs mit nahe zu kaum Flame. Alles was die Regeln bricht, wird vom System festgehalten. Egal wie stark der Flame war. Teilweise fällt dort auch passives Flamen mit darunter.\n\n> Es geht um die \"Ab und zu\" Flamer. Diese Leute sind die wahre Qual in LoL und nicht die \"hefitgen\" Flamer.\n> Die gesamte Anteil. Jeder trägt einbisschen dazu bei und niemand schlägt aus dem Bogen raus, ABER die Gesamtheit dieser vielen kleinen Beiträge führt zu einem negativen Bild und auch ein insgesamt negatives Spielklima.\n\nIch verstehe was du sagen möchtest, jedoch kann ich nur erneut sagen: Alles wird bestraft. Darum sollte man auch nie jemanden zurück flamen, nur weil er/sie/es \"angefangen\" hat. \n\nWenn du alle paar Monate mal ein Wörtchen rausdrückst, wird dich das System nicht so stark verprügeln, als Leute, die jedes dritte Game einen wortwörtlichen Längenvergleich für den e-pen austragen.\n\n\n> \n> Seit Season 1 habe ich wirklich viele Spieler kennengelernt (im Freundeskreis und bei der Arbeit). Sooo viele sind kleine Flamer/Blamer, die ständig mal ab und zu einen dummen Spruch bringen. Niemand von denen hat jemals eine CR bekommen niemand.\n> Ich rede hier von 30 Personen mit denen ich in mehreren Seasons zusammengespielt habe und ihr Verhalten auch gesehen habe.  Niemals kamen Strafen.  Also wird es bei anderen Spielern nicht anders sein.\n\n\n30 Personen in 7-8 Jahren..\nówó\n_Ich unterlasse einen Kommentar zur Zahl an sich in dem Verhältnis und gehe mal nur auf den Fakt ein, dass das 30 Leute sein sollen, die alle ´\"casual\" Flamer sind. _\n**Wenn die Leute nicht reported werden, liegt das Problem nicht bei Riot, sondern an der Einstellung der Mitspieler/randoms. \nWer nie reported wird, bekommt auch keine CS. **\n\n\n\n> Dieser &quot;Streamer&quot; zählt nicht zu der neutralen Spielerschaft. Er ist einer derjenigen die dumm genug sind immer wieder im selben Spiel mehrere Male zu blamen und &quot;Report XX&quot; zu schreiben.\n\nWie genau bezeichnest du starken und lowen Flame?\nDenn in meiner Story, hatte der dude kaum etwas geschrieben. Dennoch was es genug, um für das Reportsystem zu zählen. Dabei ist der davor grnicht so auffällig gewesen, wenn ich mich nicht vertu. Zwar muss er davor die Verwarnungen bekommen haben, aber der war meines Wissens nach, kein starker Flamer.\n \n> Das ist der typische Flamer. Der nach kA 2 Wochen seine erste CR kriegt, wenn er sich oft so verhält. (Vermutlich wird er oft Reportcalls machen)\n\nDas...kann natürlich gut sein. Es muss aber nicht so sein. \n\n> Schön wärs. Ich mute seit Jahren Flamer, aber AFKler sind die Hölle. Ich hatte das auch schon 2-3 Male, dass ich 2-3 Spiele an einem Tag afk war, weil ich Internetprobleme hatte.\n\nEs geht dir doch in erster Linie um Flamer, nicht?\nUnd dann reicht das Muten nicht?;O\n\nÜber Internetprobleme kann ich dir ein Lied singen. Aber ich sage dir lieber, was man mir damals auch sagte: \"Spiele nicht League wenn dein Internet zu schlecht ist\".\nDas ist besonders dann ätzend, wenn davor die connection wunderbar funktionierte und du random einen 10k-80k ms ping bekommst.\n_Funfact: 500ms ist der deathping._\nAlles darüber und darunter, ist teilweise Spielbar. Frag mich nicht warum. Für mich war alles ab 40k wieder okay,  warum auch immer.\nAlles unter 200 ms war auch prima..\n\nAber trotzdem kannst du gegen Afk-ler nichts tun. Es passiert auf beiden Seiten aus unterschiedlichen Gründen. Mal hat die Schwester vor 9 Monaten das Kondom durchstochen...mal brennt die Katze..\nFutter ist fertig...oder...i dunno \"mom gimme 5 moaar minz plz! kthxbye!\"\n\n\n> Dafür hätte ich eine Strafe kriegen sollen. Es gab NICHTS. Nur einen Hinweis, dass es nicht gut ist Afk zu sein. Wow Riot. Das hat mich so richtig abgeschreckt.... Nicht mal 5 malige 5 Minuten Strafe gab es..\n\nBesser als ein Tempban, right?;O Ich meine..du sagst ja selbst, dass das nicht gewollt war. Und es passiert dir auch nicht so oft.\n\n> Die AFK Strafen sind sowieso der größte Witz. Es gibt einige Ausnahmen, die es wirklich stört, aber die viele interessiert doch diese Strafe nicht. oh wow 5 minuten. Oh Wow 5 Mal 20 Minuten. Oh Krass. Hmm was mache ich denn jetzt nun? Huch eine Folge Anime dauert ja exakt 20 Minuten? Nice.\n> LP juckt nicht. Die Strafe sollte wirklich krasser sein als nur läppische (auf höchter Strafstufe xD ) 20 Minuten.\n\nDu hast nie Teamranked gemacht,eh?D;\nIch musste schon des öfteren mit meinen Leuten 60 min warten, weil jemand die Queue zu oft gestartet hatte mit jemanden, der halt länger auf'm Klo war.\n\nIch schwör dir, das ist nicht lustig wenn du, bzw der eine Teammate das 5 mal durchmacht.\nDie 5h liefen auch nur in der Queue-time ab. Wenn du die Queue abbrechen wolltest, ging der Timer nochmal los...\nEinfach Offline gehen und morgen weiterspielen war keine Option.\nUnd Hut ab, wenn du nach den 60 Min den Invite durch einen Bug nicht gesehen hast. Das System legt gerne Nachschlag drauf.\n\nWer wirklich bewusst Afk geht um dem Team zu schaden, bekommt eine Strafe. Wer in der Teamlobby plötzlich von mr. ocean als 11ter dude gerufen wird, hat halt auch ein Problem.\n\nOnce again: Wie würdest du mit den Leuten umgehen wollen?\n\nedited: ich hab ein N vergessen. ffs.","replies":[{"poster":"Spicavius","date":"2018-05-08T22:20:09.053+0000","up_votes":2,"down_votes":0,"body":"Du hast ja recht. Ich habe eigentlich kein Problem mit Flamern, weil die ja tatsächlich nicht so schlimm sein (Mutebutton OP).\nAber mit AFKlern habe ich ein Problem und ja da spielt es keine Rolle, ob die öfter im Gegnerteam sind als bei mir. Das hat mich nie interssiert^^.\n\nDas habe ich aber auch erst im Verlauf der Diskussion verstanden, dass Flamer für mich nicht das eigentliche Problem sind^^, sondern die AFKler.\nDie Sache ist eben, dass ich mir irgendwan die Frage gestellt habe, wieso ich mir 40 Minuten von einem AFKler versauen lasse bzw auch mal 3 Spiele hintereinander einen AFKler habe (weil Pech). In der Zeit hätte so viel bessere Spiele mit cooler Story und ohne Nervenverlust spielen können.\nNaja Whatever. Fakt ist, dass du recht hast. Flamer sind nicht das große Problem, sondern eher die AFKler :D","replies":[]}]}]}]},{"poster":"Tempname2919","date":"2018-05-08T13:36:34.849+0000","up_votes":2,"down_votes":0,"body":"Grüße!\n\nIch spiele seit Ende Season 1, ich hoffe damit habe ich mich qualifiziert :)\n\nMein Problem ist, ich habe früher nie das Thema Spielerverhalten wirklich verfolgt. Ich war sehr aktiv im Tribunal, aber habe mich nicht sonderlich viel sonst mit der Materie beschäftigt. Daher kann ich leider keinen Vergleich im \"Fortschritt\" machen. \nAber so wie es momentan ist, finde ich es eigentlich ganz gut.\n\nZu dem Thema der \"neutralen\" Spieler:\nIch habe nun schon öfters Fälle gesehen, wo Leute eine Bestrafung bekamen (nicht unbedingt nen Perma :P) welche jetzt nicht übertrieben hart, aber halt genug geflamed haben. Ist das nicht diese neutrale Spielerschaft? \nIch meine, die posten relativ selten hier im Forum, hier bekommt man meist die härteren Fälle mit, aber ist das aussagekräftig? Finde ich persönlich nicht.\n\nDie Frage die ich mir stelle ist also: Wie überwachst du das?\nDu musst ja konkrete Beispiele für deine Beobachtungen haben, dass diese neutralen Spieler nicht hart genug bestraft werden.\nHast du eine Excel-Tabelle und guckst in regelmäßigen Abständen nach, wer evtl. ne Strafe bekommen hat (in dem Wissen das du die CR auch nicht bemerken wirst, sondern nur 14Tage- und Permabann)? Ich persönlich reporte halt einfach die Spieler und starte dann das nächste Spiel, ich verschwende nie wieder auch nur einen Gedanken an diese Spieler. Der Rest sind nur Wahrnehmungen (Stichwort \"Anschein\").\n\nIch meine du hast es quasi selbst gesagt, sie flamen wenig aber genug das der **Anschein** entsteht, jedes Spiel nen Flamer zu haben. Aber das ist doch der Punkt, dass sind doch nie die selben Leute denen du begegnest. Vielleicht haben die genau in deinem Spiel eben diese Ausrutscher, obwohl sie sonst nie flamen.\nIch meine, weder du noch ich können es nachweisen und reiner \"Glaube\" und \"Vermutungen\" zählen nun mal nicht.\n\nNun muss ich noch abschließend sagen, ich finde die Anzahl an Flamer gar nicht so gravierend, eventuell mag das daran liegen das ich fast keine Rankedgames spiele (wo die Gemüter ja ein wenig angespannter sind), sondern meine Zeit in Normals und ARAM's verbringe. Aber selbst in den wenigen Rankedgames, hatte ich nur eine handvoll von unangenehmen Menschen und vielleicht einen Spieler den ich als Flamer bezeichnen würde.\n\nAlso...abschließend kann ich nur folgendes sagen:\nIch kann nicht beurteilen wie der Fortschritt im Spielerverhalten aussieht. Ich bin zufrieden mit der aktuellen Lage, ich habe meinen Spaß in meinen Spielen und beschäftige mich nicht großartig mit Flamern und unangenehmen Spielern.\n\nWünsche euch noch einen angenehmen und sonnigen Tag\n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Spicavius","date":"2018-05-08T22:07:13.872+0000","up_votes":2,"down_votes":0,"body":"Ich habe lustigerweise im Verlauf der Diskussion selber bemerkt, dass ich eher kein Problem mit den Flamern habe, sondern mit den AFKlern xD.\n\nFlamer kann man ja easy kontern :P, aber AFKler kannst du nicht eben muten^^. Naja. Deswegen denke ich, dass ich wohl von den AFKlern genervt bin hehe. Habe ja auch in den letzten 3 Spielen vor einem Monat 3 mal hintereinander AFKler gehabt. Das war wohl zu viel xD. Da habe ich mir dann die Frage gestellt wieso ich mir das antue. Diese Afkler versauen mir 40 Minuten Spielzeit. In der hätte ich so viel bessere Spiele spielen können ohne am Ende genervt zu sein.\n\nAber ja Flamer sind wohl nicht so das Problem. Sehe ich ein. Aber Afkler -.- ^^","replies":[]}]},{"poster":"Noxempire","date":"2018-05-08T09:43:08.185+0000","up_votes":1,"down_votes":1,"body":">Es bannt in den meisten Fällen \"nur\" die Hardcore-Flamer. Die Leute, die zu dumm sind, um zu verstehen, dass das System sie bannen wird und die einfach nicht aufhören können jedes Spiel zu flamen/meckern.\n>\n\nWenn man lange hier im Forum aktiv ist, sieht man dass dies nicht der Fall ist. Nicht Hardcore Flamer brauchen einfach länger bis sie gebannt werden.  Einfach mute + report. \n\nBtw. kann Riot auch erst was gegen Flamer NACH einem Spiel machen. Das heißt der Schaden ist ingame so oder so bereits angerichtet, ganz egal wie hart sie Flamen. \n\n >Vorallem weil Afk nicht stark genug bestraft wird. \n>\n\nAFK ist nun Mal ein happiges Thema. Leuten Perma Bans zu geben nur weil sie halt wirklich Mal öfters Pech haben mit ihrer Connection, ist halt irgendwie unfair. Ich persönlich hab keine gravierenden Probleme mit AFKlern bisher gehabt. (Natürlich gibt es Leute, die absichtlich AFK gegen, aber die kann man nicht von den anderen effektiv unterscheiden) \n\nAuch hier gilt das selbe Prinzip, der Schaden ist so oder so bereits angerichtet. \n\n>aber ich habe aufgrund der Flamer/Tilter/Afkler irgendwie die Lust am Spiel verloren.\n> \n\nMuten und reporten. Flamer gab es schon immer und wird es immer geben. Egal in welchem MOBA du dich befindest. Man muss sich damit einfach arrangieren und da drüberstehen. \nEin Großteil der Spielerschaft Flamed nicht, auch wenn es dir nicht so vorkommt. Auf die muss man sich konzentrieren nicht auf die wenigen schlimmen. \n\nMan gewöhnt sich einfach daran, zu oft nur an die schlechten Games zu denken. Dabei gab es doch auch so viele schöne mit witzigen Teammates. Ich hab bestimmt. 10-15 Leute noch in meiner Freundesliste, die ich nur durch ingame Interaktion kennengelernt habe ^^.","replies":[{"poster":"Spicavius","date":"2018-05-08T10:47:32.109+0000","up_votes":2,"down_votes":0,"body":"> Wenn man lange hier im Forum aktiv ist, sieht man dass dies nicht der Fall ist. Nicht Hardcore Flamer brauchen einfach länger bis sie gebannt werden. Einfach mute + report.\n> \n> Btw. kann Riot auch erst was gegen Flamer NACH einem Spiel machen. Das heißt der Schaden ist ingame so oder so bereits angerichtet, ganz egal wie hart sie Flamen\n\nIch bin schon seit Season 1 im Forum aktiv. Ich weiß wie wer und was bestraft wird. Das ist zu wenig. Vorallem weil ich sehe was nicht bestraft wird. (Aus dem Freundeskreis).\n\n\n> AFK ist nun Mal ein happiges Thema. Leuten Perma Bans zu geben nur weil sie halt wirklich Mal öfters Pech haben mit ihrer Connection, ist halt irgendwie unfair. Ich persönlich hab keine gravierenden Probleme mit AFKlern bisher gehabt. (Natürlich gibt es Leute, die absichtlich AFK gegen, aber die kann man nicht von den anderen effektiv unterscheiden)\n> \n> Auch hier gilt das selbe Prinzip, der Schaden ist so oder so bereits angerichtet. \n\nNe, aber ich die Strafstufen nciht lächerlich. Bis man zu der ersten ankommt muss man schon mal 4 Spiele versaut haben. Ich hatte 2-3 Mal selber Connectionprobleme und nach 3 Spielen AFK sein, habe ich einen Hinweis bekommen, wie schlecht es ist AFK zu sein.\nErst danach kommen die Stufen.  Auf höchster Stufe 20 Minuten. Ernsthaft? Man muss locker erst 6-7 Spiele AFK sein bis man an der höchsten angelangt ist.\nUnd wen interssieren diese 20 MInuten? Eine Animefolge dauert 20 Min. Huch. Schon ist es garnicht so schlimm. Vorallem weil man einfach einen Wecker stellen kann, der einen nach 20 Minuten wieder an die Warteschlange erinnert. Soooo schlecht umgesetzt. Die Strafe ist leicht \"unangenehm\" aber mehr auch nicht.","replies":[{"poster":"Noxempire","date":"2018-05-08T11:13:14.574+0000","up_votes":1,"down_votes":0,"body":">Ich bin schon seit Season 1 im Forum aktiv. Ich weiß wie wer und was bestraft wird. Das ist zu wenig. Vorallem weil ich sehe was nicht bestraft wird. \n>\n\nIrgendwer wird sich bestimmt die Mühe machen und dir ein paar Chatlogs raussuchen. Ich werde das nicht tun. \nEs gibt mehr als genug Beispiele, dass auch \"moderater\" Flame zum Permaban führen kann. Wenn du jedes einzelne kleine Blame Wort bestraft haben willst, wärst du vermutlich selbst bereits gebanned ^^ \n\n>Erst danach kommen die Stufen. Auf höchster Stufe 20 Minuten. Ernsthaft? Man muss locker erst 6-7 Spiele AFK sein bis man an der höchsten angelangt ist.\n>\n\nEs gab früher (vor ca. 2 Jahren) die Tages und Wochenbanne für AFK.\nDie wurden aber abgeschafft eben weil sie ineffizient waren. \nDer Leaverbuster arbeitet besser, weil du die Strafe aktiv abarbeiten musst, während du bei den alten Bestrafungen einfach auf nen Smurf wechseln kannst. \n\nSchlag ein besseres Bestrafungssystem vor für AFKler.\n\nEdit: würde man die Dauer des Leaverbuster erhöhen (sagen wir Mal ne Stunde) wäre es für manche Leute unmöglich sie abzuarbeiten. Nicht jeder hat extrem  viel Freizeit. ","replies":[{"poster":"Spicavius","date":"2018-05-08T11:24:48.847+0000","up_votes":1,"down_votes":0,"body":"> Wenn du jedes einzelne kleine Blame Wort bestraft haben willst, wärst du vermutlich selbst bereits gebanned ^^ \n\nne wäre ich nciht ;) Weil ich nicht flame und blame. Es gibt sowas nicht. Alleine schon weil man sich IMMER damit ins eigene Fleisch sägt.\nImmer. Warum sollte ich mir also mit so einem \"Scheiß\" selber die Spiele versauen?\nAber offensichtlich gibt es genug Leute, die es anders sehen und Riot wohl auch.\nkA Vllt fange ich wieder mal an im Aram oder so. Dann wird sich weiter herangewagt xD\n\n> Schlag ein besseres Bestrafungssystem vor für AFKler.\n\nHabe ich. Stichwort: \"aktives Warten\" und zufällige \"Bist du noch da Beschwörer?\" Anfragen, die man mit Ja beantworten muss, sonst ist man wieder ganz am Anfang.\nStrafen müssen weh tun. Das muss richtig unangenehm sein.\nhttps://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/cvwFEXnB-leaverbuster-effektivernerviger-gestalten\n\nAber deutsches Riot-Forum ist schlecht. Es bringt nur etwas sowas im NA forum zu machen. Dafür braucht man aber wiederum einen NA Account und Lvl 5. Und die Wahrscheinlichkeit ist verschwindend gering, dass es überhaupt irgendwie umgesetzt oder darüber nachgedacht wird. Also ja ich finde immernoch dass diese Idee gut ist, aber \"so what\".^^\n\nBringt eh nichts.\n\nPS. Die Diskussion ist natürlich schon 3 JAhre her. Aber an dem Leaverbuster und der genannten 20 Minuten Problematik hat sich nichts geändert.","replies":[{"poster":"Noxempire","date":"2018-05-08T11:56:43.767+0000","up_votes":1,"down_votes":0,"body":">Habe ich. Stichwort: \"aktives Warten\" und zufällige \"Bist du noch da Beschwörer?\" Anfragen, die man mit Ja beantworten muss, sonst ist man wieder ganz am Anfang.\nStrafen müssen weh tun. Das muss richtig unangenehm sein.\n>\n\nDas wäre tatsächlich ne gute Idee.","replies":[]}]}]}]}]},{"poster":"Bärenmarder","date":"2018-05-10T12:06:30.535+0000","up_votes":1,"down_votes":0,"body":"ist doch lustig.","replies":[]},{"poster":"Soldner57","date":"2018-05-08T10:02:25.928+0000","up_votes":2,"down_votes":5,"body":"Also ich hatte grad ein spiel mit Hirnlosen Lemmingen. Habe bisschen den Gegner aufgezogen aber sonst nix geschrieben, das mein Team z.B. mal Ihr Hirn benutzen sollen und nicht 1-2 vs 5 gehen sollen und es evtl. mal als Team so aka 5 vs 5 besser laufen würde, habe ich gelassen.\n Aber dann hieß es aus dem nix heraus Report {{champion:89}} for Trolling. Da ist MIR EINFACH MAL DER ARSCH MIT DIESEN BESCHISSEN ARSCHLOCHSPIELERN GEPLATZT. D.h. hab Ihnen gesagt das se Hirnlose Affen sein und besser wieder COD spielen sollten..... \n\nschwups Strafe erhalten(Honorlvl verloren).... ich habe es ja drauf angelegt {{sticker:slayer-jinx-wink}} \n\nAber wisst ihr was es geht mir besser also werde ich dies in Zukunft häufiger machen.\n\n\np.S. Ban ist mir egal, wenn ich mit Unsozialen Idioten spielen will, die gibt es auch woanders. {{sticker:vlad-salute}} \n\n\nIn diesem Sinne, vielen dank für diese Erkenntnis","replies":[{"poster":"Spicavius","date":"2018-05-08T10:54:07.279+0000","up_votes":1,"down_votes":0,"body":"Naja gut du siehst es ja selber ein, dass du was falsch gemacht hat.^^ Also hast du aufgehört weil du für deinen Flame eine Strafe bekommen hast?\n\nWärst du einer der ruhigen Spieler, der sich einfach von solchen Spielern wie \"dein Team\", die aus heiterem Himmel \"Report Leona\" schreiben, genervt fühlt, dann würde ich das verstehen.\n\nDu hast nicht aufgehört wegen Flamern, sondern weil du für deinen eigenen Flame eine Strafe bekommen hast. Traurig aber okay.","replies":[{"poster":"Soldner57","date":"2018-05-08T11:09:32.525+0000","up_votes":1,"down_votes":0,"body":"Das mit dem Ban wird noch passieren.... evtl. .... hoffe ich mal ... vielleicht. \nAufhören? Nope, sonst hätten die ja gewonnen.... NÖNÖ so nicht. {{sticker:sg-miss-fortune}}","replies":[]}]}]}]}