{"poster":"CriiTbÄÄm","date":"2016-12-22T20:17:22.052+0000","title":"Main Supp sucht Duo-Partner (Bronze - Silber) auch für Vormittags / Mittags","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Hall&ouml;chen,\r\nich bin eine Main Supporterin und suche einen Duo-Q Partner. \r\nAm besten einen festen ADC. \r\nM&ouml;glich w&auml;ren allerdings auch Jungle oder Mid. Bitte nur, wenn ihr diese Lane Maint und nicht jede Runde auf einer anderen spielt.  \r\n\r\nIch bin t&auml;glich ab ca. 10/11 Uhr Vormittags / Mittags online &uuml;ber den restlichen Tag verteilt. \r\nDaher suche ich jemanden, der/die nicht erst ab 16/17 Uhr abends Zeit haben sondern eben schon vorher. \r\n\r\nZu mir:\r\nIch bin 26 Jahre alt und spiele schon fast immer nur Support.\r\nZwischenzeitlich habe ich auch die Mid-Lane gemaint. Bin jedoch wieder zum Supp zur&uuml;ckgekehrt. \r\nLetzte Season war ich Gold.\r\nJetzt bin ich wieder in Bronze eingestuft worden und versuche eben wieder mindestens Gold zu erreichen oder h&ouml;her. \r\nIch besitze einen eigenen Teamspeak Server der zur Verf&uuml;gung stehen w&uuml;rde. \r\nSupports passe ich meistens an das Game/ an die Kombi an, somit habe ich keine bestimmten Supps, die erw&auml;hnenswert w&auml;ren.\r\n\r\nIch suche: \r\n- Jemanden der Adc, Mid o. Jungle Maint und Interesse an einem Duo hat.\r\n-  ... der Teamspeak besitzt und dieses auch ben&uuml;tzt\r\n- Jemand, der Calls im Game machen kann bzw. Smartpings\r\n- ... der nicht permanent flamt. (mal flamen is nich so schlimm aber permanente flamer vermiesen das Game)\r\n- ... der nicht erst abends lol Spielt sondern auch Vormittags / Mittags des &ouml;fteren online ist","replies":[{"poster":"Galio420","date":"2016-12-23T01:47:10.703+0000","up_votes":1,"down_votes":0,"body":"Huhu, hab dich mal auf meinem Main (den hier) Geaddet. Spiele sehr viel adc bin aber momentan gold 4, hab aber paar Smurfs die sowieso noch ihre Einranked spiele machen müssen :) Kannst mir ja mal schreiben\n\nLg :)","replies":[]},{"poster":"WhoOotBros Bene","date":"2016-12-23T00:44:46.576+0000","up_votes":1,"down_votes":0,"body":"Hey habe dich mal geadded war Silber 1 main ADC und bin jetzt Bronze 1 :)","replies":[]}]}