{"poster":"Auroramancer","date":"2018-09-04T15:31:05.164+0000","title":"Daily Reminder to Hold Riot Accountable","subforum":"General Discussion","up_votes":367,"down_votes":18,"body":"Daily reminder to not forget Riot&#039;s actions at PAX and the inflammatory behavior shown by Rioter Daniel Z. Klein. \n\nhttp://www.espn.com/esports/story/_/id/24314161/riot-games-responds-report-alleging-sexual-harassment\n\nRemember when Raven Keene was let go by Riot Games? Above is the statement released by Riot regarding the issue, as well as statements of their values and examples of behavior they don&#039;t find acceptable. \n\nGuess who has violated those values and displayed unacceptable examples of behavior? Rioter Daniel Z. Klein. I&#039;m not calling for action to be taken against him here, we all know what he&#039;s said. Take a look at Riot&#039;s public stance on certain behaviors. \n\nhttps://i.imgur.com/Xauq3ik.png[/img]\n\nhttps://i.imgur.com/gIUMSn7.png[/img]\n\nCrossing the line from assertive to aggressive? Check.\n\nhttps://i.imgur.com/1X2W9gm.png[/img]\n\nDiscrimination, retaliation, bullying, and general toxicity? Check.\n\nhttps://i.imgur.com/7aEQFfe.png[/img]\n\nhttps://i.imgur.com/9zgQ6Qj.png[/img]\n\nRiot unable to achieve their goals of being a player-focused, non-discriminating, and equal opportunity company with Daniel, someone who condones sex-based discrimination and openly retaliates and bullies the playerbase, as a member of their team? CHECK.\n\nIf Riot is going to be issuing a statement on what happened at PAX and the whole Daniel Z. Klein situation, do not let them get off with fence-sitting. \n\n>\"We missed the mark...\"\n\nI&#039;ve seen Riot say this so many times with regard to game balance or in-game events. DO NOT LET THEM GET AWAY WITH SAYING &quot;WE MISSED THE MARK&quot; THIS FOR DISCRIMINATION. We need a genuine retraction and apology...\n\n>\"The policy we enacted was wrong and discriminatory, and we would like to acknowledge this and apologize for this. We will not be enacting similar policies in the future. We want to hold true to our ideals and culture of being non-discriminatory and player-focused. What we did at PAX did not align with our culture, and we will be reviewing event-related policies in the future to prevent this from happening again\"\n\nWhen it comes to toxic Rioters, Riot is fine with saying &quot;we have to let &lt;name&gt; go, because we cannot meet our goals with &lt;name&gt; on our team&quot;. They can say this with Daniel Z. Klein if they decide to let him go.\n\n&quot;We have taken disciplinary action, and cannot disclose said action&quot; will be totally bullshit, since they said what they did with Raven Keene. \n\nHold all Rioters accountable to the same standard.\n\nHold Riot accountable for letting this happen, and for allowing Rioters to treat the playerbase like this. \n\nSexism and bullying toward the playerbase is not acceptable.","replies":[]}