{"poster":"JKingk","date":"2017-10-25T10:38:41.387+0000","title":"Solo/Duo,Flex Gold5 Jungler/ADC sucht Team im Bereich Gold","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hi, \r\nmein richtiger Name ist Jan und mein Beschw&ouml;rername ist **JKingk**.\r\nIch bin **20 Jahre** alt und **spreche Deutsch und Englisch** flie&szlig;end.\r\n\r\nIch spiele League of Legends seit Mitte Season 1.\r\nIn dieser Zeit habe ich ungef&auml;hr 3000 Normale Spiele gemacht und sicher auch an die 2000 Ranglistenspiele. \r\nIch spiele haupts&auml;chlich **Jungle und Adc** und w&auml;re auch bereit mich f&uuml;r ein Team auf eine dieser Rollen zu spezialisieren und alles n&ouml;tige diesbez&uuml;glich zu lernen. \r\n\r\nMomentan befinde ich mich sowohl in der **FlexQ als auch in der Solo/Duo Q in Gold 5** und bin vorerst sehr gl&uuml;cklich damit die H&uuml;rde von Silber auf Gold das erste mal &uuml;berwunden zu haben, was aber nicht hei&szlig;en soll dass ich nicht vor habe mich weiterhin zu verbessern und weiter aufzusteigen.\r\nVon meinem Team erwarte ich, dass es auch den Wunsch hat aufzusteigen und sich stetig zu verbessern, damit man zusammen st&auml;rker werden kann.\r\nAuch wenn ich mir w&uuml;nsche dass man innerhalb des Teams auch Spa&szlig; hat und nicht immer alles nur ernst nimmt sollte man das Spiel durchaus immer als  M&ouml;glichkeit sehen neue Aspekte zu lernen oder einfach nur Routine zu erlangen, egal welchen Modus man gerade spielt.\r\n\r\nMeine gr&ouml;&szlig;te schw&auml;che ist in meinen Augen meine manchmal zu gelassene Art, die mir aber auch dabei hilft mich nur sehr sehr selten aufzuregen.\r\nZu meinen St&auml;rken geh&ouml;rt, dass ich mich wie ich finde sehr schnell an neue Situationen und generell ver&auml;nderungen gew&ouml;hnen kann und eine gute Auffassungsgabe besitze. Au&szlig;erdem bin ich mir sicher, dass ich dem Team auch in schwierigen Situationen eine mentale St&uuml;tze sein kann.\r\n\r\nIch besitze **Teamspeak, Skype und Discord**, w&uuml;rde aber nur sehr ungerne Skype nutzen.\r\n\r\nWenn ihr Interesse habt einfach mal zu schauen wie wir so zusammen passen dann added mich einfach mit dem oben schon genannten Beschw&ouml;rer Namen: **JKingk**\r\noder schreibt mir hier.\r\nMfg, Jan","replies":[{"poster":"p2a6p1a1","date":"2017-10-25T11:42:24.103+0000","up_votes":1,"down_votes":0,"body":"Hey,ich w체rde gerne in dein Team kommen bin 12  werde n채chsten Monat 13 spiele seit ungef채hr anfang Season 6 bin gerade in meiner silber  2 promo in flexq  will entlich raus aus kack Silber w체rd emich freuen wenn ich mit machen kann","replies":[]}]}