{"poster":"Inada","date":"2015-11-10T19:56:56.069+0000","title":"Anyone know how to do character specific taunts?","subforum":"[ARCHIVED] Miscellaneous","up_votes":1,"down_votes":1,"body":"So I went on to Ekko's wiki page and learned something about this game I didnt know was in it. Ekko has a few taunts at certain champs that are unique. I have been trying to do this in SR to hear them in game but I cant for the life of me figure it out. I just keep getting his normal taunts. Anyone have any idea on how to do this?","replies":[{"poster":"moonstones","date":"2015-11-10T23:07:18.674+0000","up_votes":2,"down_votes":0,"body":"For special taunts, you'll need to have the proper ally/enemy champion in your vicinity. For example, if you're taunting Caitlyn, she'd need to be on the enemy team and she'd need to be close to Ekko when you use /taunt.","replies":[{"poster":"turkeyBACON","date":"2015-11-11T00:53:25.584+0000","up_votes":1,"down_votes":0,"body":"Why don't you guys implement something close to Dawngate's (rip) unique emote system where when two shapers/champs first come in sight range of each other they auto play their emotes?\n\nWould make the game more immersive and doesn't require the player to put in the effort when their trying to focus on the game. I fairly certain i haven't heard a taunt (unique or not) in game for the past couple of months. Maybe, maybe I'll hear a taunt at the end game screen but at that point it's usually done by me. ","replies":[{"poster":"AntiSkillshot","date":"2015-11-11T07:38:38.537+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=turkeyBACON,realm=NA,application-id=cIfEodbz,discussion-id=Nw7KlKYL,comment-id=00010001,timestamp=2015-11-11T00:53:25.584+0000)\n>\n> Why don't you guys implement something close to Dawngate's (rip) unique emote system where when two shapers/champs first come in sight range of each other they auto play their emotes?\n> \n> Would make the game more immersive and doesn't require the player to put in the effort when their trying to focus on the game. I fairly certain i haven't heard a taunt (unique or not) in game for the past couple of months. Maybe, maybe I'll hear a taunt at the end game screen but at that point it's usually done by me.\n\nActually... Riot *did* do something like that.  It's on Atrox.  When Atrox \"sees\" Trynd for the first time in a match, Atrox will say something.\nWhy it's only on Atrox is beyond me, though.","replies":[]}]},{"poster":"darkdill","date":"2015-11-10T23:51:38.940+0000","up_votes":2,"down_votes":0,"body":"I've always disliked how close you actually have to get for it to work, and even then it doesn't always work, or causes you to start auto-attacking.","replies":[]}]},{"poster":"Inada","date":"2015-11-10T23:31:01.482+0000","up_votes":1,"down_votes":0,"body":"Ok figured it out. You just have to spam the taunt sometimes before they will say anything and maybe have them targeted. Didnt test it without a target.","replies":[]},{"poster":"Head Connoisseur","date":"2015-11-10T21:41:42.316+0000","up_votes":1,"down_votes":0,"body":"I believe you have to be within like...500 units of them and targeting them for it to work.","replies":[]},{"poster":"Inada","date":"2015-11-10T23:19:52.175+0000","up_votes":1,"down_votes":1,"body":"hmm maybe thats why I just hit ctrl 2. I'll make a macro for the /taunt and try that. Ty for the help.","replies":[]}]}