{"poster":"sneaQy","date":"2016-05-15T16:33:44.284+0000","title":"Runen Seiten, Hextechwerkstatt, Spracheinstellung","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hallo\r\n\r\n**Runen Seiten**\r\nEs w&auml;re sch&ouml;n wenn man die M&ouml;glichkeit bes&auml;&szlig;e mehr als 20 Runen Seiten zu kaufen. Mehr Champions = mehr Runen Seiten.\r\n\r\n**Hextechwerkstatt**\r\nIch bin im Besitzt aller Champions in League. Wenn ich mir Truhen kaufe und dort &uuml;berwiegend nur Champion Spliter zu finden sind, dann denke ich zweimal nach ob ich daf&uuml;r nochmal Geld ausgeben soll. Eine alternative f&uuml;r Spieler die alle Champions besitzen sollte mal durch dacht werden.\r\n\r\n**Spracheinstellung**\r\nLeague ist ein tolles Spiel das weltweit gespielt wird. Man spielt selten nur mit Leuten aus seinem Land zusammen. Wenn man anderen Spielern w&auml;hrend des Spielens Vorschl&auml;ge f&uuml;r ein Item Build geben m&ouml;chte oder sie auf etwas hinweisen m&ouml;chte, man selbst aber nicht alle Gegenst&auml;nde mit Englischen Namen kennt dann leidet die Kommunikation.\r\nMein Vorschlag w&auml;re das man hinter den Deutschen Bezeichnungen auch die Englischen Begriffe zu lesen bekommt. Genau wie hinter den Spanischen, Polnischen, etc...\r\nAu&szlig;erdem w&uuml;rde ich gern die Sound Einstellung auf Englisch einstellen. Allerdings w&auml;ren damit auch s&auml;mtliche Item Bezeichnungen auf Englisch.\r\nWenn man diese Einstellung unabh&auml;ngig von einander machen k&ouml;nnte w&auml;re ich euch sehr dankbar.\r\n\r\nDanke :)","replies":[{"poster":"SorisDynasty","date":"2016-05-15T16:43:00.200+0000","up_votes":1,"down_votes":0,"body":"Mehr Runenseiten sind immer nett. Jedoch kostet jede weitere Runenseite auch mehr Kapazität vom Server. Ich pers. würde es ebenfalls begrüßen, jedoch kann ich verstehen, wieso Riot das eventuell nicht machen möchte. Zu mal man selten wirklich alle Runenseiten benötigt. Ich benutze aktiv vielleicht 10 Stück davon, den Rest mal vereinzelt. Und das ist jetzt schon eher nach oben gerechnet.\n\nDie Championshards kann man bald verwenden. Es soll via Hextechwerkstatt möglich sein, die Mastery Level 6 & 7 freizuschalten. (Wenn man ab ML5 ein S auf dem Champion bekommt, soll Etwas (hab vergessen, was genau) für diesen Champion droppen und das kann man via blauer Essenz, erhaltbar über Championshards, bauen. Damit sind dann höhere Mastery Level verfügbar)\nAnsonsten... Hextech-Crafting ist eben zufälliger Loot. Dir steht es frei, dafür Geld auszugeben oder zu erspielen. Das ist für alle gleich.\n\nSprache englisch und Rest deutsch geht sogar gleichzeitig. Ich persönlich weiß nicht, wie, da ich es nicht gebrauche, aber es ist möglich.","replies":[]},{"poster":"Enderized","date":"2016-05-15T16:39:21.564+0000","up_votes":1,"down_votes":0,"body":"Wenn wir mal ehrlich sind, verwendest du viele Runenseiten mehrfach.  Du brauchst also nicht 130 Runenseiten...\n\nRiot hat bei veröffentlichung des Hextechsystems bekannt gegeben, dass dazu noch beizeiten etwas kommen soll.\n\nDas wäre eine gute idee","replies":[]}]}