{"poster":"Sayan94","date":"2017-07-05T02:18:03.769+0000","title":"¿Que tan indigno sos?...","subforum":"Comportamiento del jugador","up_votes":6,"down_votes":3,"body":"Hay gente que tiene 0 dignidad, pero 0. Lamentablemente quise volver a mi ex main linea a la jg y me acorde porque lo habia dejado.\r\n\r\nPartida n&ordm; 1:\r\n\r\nEstoy en red, de la parte de abajo donde el red aparece del lado del adc. Termino red, escucho una se&ntilde;a de ayuda de la riven top que estaba contra una quinn. \r\nTermino de hacer los pajaritos, 5 se&ntilde;as seguidas de ayuda desesperado, no hizo mas se&ntilde;as porque se permiten 5 nomas, lvl 2, queria que ya gankee a quinn con un yi.\r\nOsea wtf?, me tira para atras con la y listo no tengo cc nada, encima ni pusheada estaba.\r\n\r\n15/20 min diciendo la riven: GG jg, report yi, 0/10 la riven. Increible, haciendose la cuchilla oscura de primer item contra un adc. No uso riven, no me gusta el campeon me parece de rata al igual que yasuo. Pero creo que hay otros items que te dan cd movilidad para reemplazar la pasiva del bacteriofago y mas da&ntilde;o que la cuchilla oscura. No necitas mucho que digamos la pasiva de la armadura contra un adc no?....\r\n\r\nPartida n&ordm; 2:\r\n\r\nAparezco del lado de arriba, empiezo en blue donde esta el adc tambien, lo mismo. Termino el blue, jax haciendo se&ntilde;a de ayuda como loco que no podia contra una anivia.\r\nToda la partida spameando ayuda, flameando y diciendo gg jg.\r\n\r\nEste aunque sea hizo 2 kills, 2/14, a la salida se le reia el team enemigo le decian que desinstale.\r\nLo epico fue, que en una que flameaba, mi mf, cansado ya le dijo: &quot;FLACO, VOS ELEGISTE TOP, PERDISTE LA TORRE EN 8 MIN Y IBAS COMO 0/5 EN EL MISMO TIEMPO&quot;.\r\n\r\nA lo que humildemente el jax responde: Yo no perdi la linea, la perdio el yi por dejarla pushear, el fue el que no se hizo cargo.\r\n\r\nCuando lei eso, en ese momento hace 2 min habia terminado un cigarrillo, agarre prendi otro porque estaba nervioso, tenia ganas de romperle la cabeza al pibe ese, me ardia la gargante pero lo fumaba igual.\r\n\r\nNo puedo creer el grado de hipocresia, la poca dignidad y lo que se autohumillan algunos.","replies":[{"poster":"ßeats","date":"2017-07-05T02:30:15.802+0000","up_votes":5,"down_votes":0,"body":"A tal punto que no puedo levantar el Martillo de Thor","replies":[]},{"poster":"Lokoth","date":"2017-07-05T02:25:34.025+0000","up_votes":4,"down_votes":0,"body":"Hermano, de esta gente está lleno, lo importante es no dejar que te afecte.\nDesgraciadamente el mundo de los juegos online (generalizando, internet) es un lugar donde la gente no muestra la cara y se da el lujo de decir lo que se le cante del resto, solo porque están enmascarados.\nLo único que te puedo recomendar es que te calmes, report y mejor suerte en la próxima! Saludos!","replies":[]},{"poster":"Vaendrys","date":"2017-07-05T03:38:44.148+0000","up_votes":3,"down_votes":0,"body":"> me ardia la gargante\n\nLinda tomografia va a salir de ahi.","replies":[]},{"poster":"Treant del DOTA","date":"2017-07-05T06:18:22.844+0000","up_votes":1,"down_votes":1,"body":"Denunciado.","replies":[{"poster":"Sayan94","date":"2017-07-05T09:49:52.429+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"Treant del DOTA","date":"2017-07-06T02:36:35.780+0000","up_votes":1,"down_votes":0,"body":"Ya te mande 432 mensajes contestame traidor","replies":[]}]}]},{"poster":"Ks Erwyn","date":"2017-07-05T08:37:24.556+0000","up_votes":1,"down_votes":0,"body":"De echo suelo ser el Jg, y tiendo a avisar que se han quedado sin ganks por subnormales...","replies":[]},{"poster":"Trying Improve","date":"2017-07-05T04:23:50.994+0000","up_votes":1,"down_votes":0,"body":"Si vas a jugar jungla mutea a todos desde que empieza la partida, incluyendo las señales. En especial si vas con campeones que son full farm.\nTe va a ayudar a mejorar tu toma de decisiones y ten por seguro que no te vas a perder de nada.","replies":[]},{"poster":"LAS Caz","date":"2017-07-05T04:03:35.162+0000","up_votes":1,"down_votes":0,"body":"Andate a pasear, bañate, habla con el vago de tu esquina o con el chino pero fumar porque estas nerviosa y ademas que te esta quemando, yo no se si sos tonto o te falta disciplina, cuídate primero y después vas a ver como no te afecta mas esas actitudes, empeza por vos y vas a sentir un cambio que te va a favorecer","replies":[]},{"poster":"elzeta123","date":"2017-07-05T03:35:22.596+0000","up_votes":1,"down_votes":0,"body":"Dignidad? Que es eso? VEO ANIME! (Kappa)\nPd: que asco esa gente que espamea la ayuda o el signo de interrogacion cuando quieres farmear, a esos mute y report","replies":[]}]}