{"poster":"SunriseSolider","date":"2018-04-24T20:20:19.731+0000","title":"Melden von Spieler in der Championauswahl","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":1,"body":"Hallo Riot Games,\r\nich bitte um die Einf&uuml;hrung einer M&ouml;glichkeit Spieler schon in der Championauswahl zu melden. So ist es doch oft so das man hier auf verhaltensauff&auml;llige Spieler trifft, was mich oft dazu bewegt  die Championauswahl zu verlassen. Was mich daran st&ouml;rt ist das man selbst eine Strafe erh&auml;lt der andere Spieler ,mit dem auf&auml;lligen Verhalten jedoch nicht ... Eine M&ouml;glichkeit die mir eingefallen ist wie bereits erw&auml;hnt w&auml;re der Reportbutton in der Champselect. Ich hoffe diese Gesuch wird erh&ouml;rt, da dies ein Faktor ist der mir mehr und mehr dem Spa&szlig; an League of Legends nimmt.\r\n\r\nMit freundlichen Gr&uuml;&szlig;en,\r\n\r\nSunriseSolider\r\n\r\n\r\n\r\nHi Community,\r\nst&ouml;rt euch dieses Verhalten auch ??? Habt ihr vielleicht auch andere Ideen zur L&ouml;sung dieses Problems?\r\nDann schreibt es doch einmal hier drunter?","replies":[{"poster":"XZZEDDX","date":"2018-04-24T21:30:51.292+0000","up_votes":4,"down_votes":0,"body":"Ich muss zugeben, ich war auch lange ein sehr toxischer Spieler, und leider gottes rutschen mir ab und zu immer noch negative Kommentare ab. Deshalb habe ich auch verdient einen 14 Tages Bann erhalten (nach langer Zeit ohne Flaming) aber habe in letzer Zeit etwas die Kontrolle verloren leider. Ich gebe mir auf jeden Fall Mühe meine Einstellung zu ändern und den Mute Boton öfter zu benutzen. Um jetzt zur Sache zu kommen; wie man sieht das Ban-System funktioniert meiner Meinung nach sehr gut. Ich kann mir kaum vorstellen dass irgendjemand aussgerechnet bloss toxisch ist in der Champ Select, dass heisst er wird ohnehin Reports in Game bekommen für sein Fehlverhalten. Und dazu kommz noch, wenn man sowas einführen würde, würde man nur Öl ins Feuer giessen. Das mit dem \"pls report him\" und der report gebrauch ist bereits jetzt ein Chaos. Die Champ select würde sich nur noch um Reports handeln und man würde sich weniger auf das picken des richtigen champs , der Runen zusammenstellung bwz Summonerspells achten. Vor allem high elo spiele die viel von Team-combs und Macro abhängen wäre es ein Problem, zu dem müsse Riot auch noch mehr Polizei spielen und überpfrüfen was \"reportable\" ist.\nWünsche schöne sonnige Tage- geniesst es :) MFG XZZEDDX Viel spass in der Kluft ^^","replies":[]},{"poster":"Nordwolf87","date":"2018-04-25T07:10:21.169+0000","up_votes":1,"down_votes":0,"body":"Was würde dieser \"CS-Report\" bringen?\n\nIch mein der schmeißt den \"verhaltenskreativen Spieler\" nicht aus der Cs sondern bestraft ihn vl nach dem Spiel? Ergo -> kein Unterschied zum status Quo (du musst das spiel mit ihm spielen)\n\nSchmeißt er ihn aus der CS? -> wird das 100% abused um leute rauszukicken, die nicht das tun was man will.\n\nDer Report befreit dich von der Dodge-Strafe? Nice to have! Miese Comp gebaut -> irgendwen reporten -> dodgen -> keine strafe \\o/\n\nIch sehe bisher keinen unmittelbaren Sinn dahinter...hilf mir mal bitte auf die Sprünge.","replies":[{"poster":"Awsane","date":"2018-04-25T13:17:33.011+0000","up_votes":1,"down_votes":0,"body":"> Ich mein der schmeißt den \"verhaltenskreativen Spieler\" nicht aus der Cs sondern bestraft ihn vl nach dem Spiel? Ergo -> kein Unterschied zum status Quo (du musst das spiel mit ihm spielen)\n\nDas stimmt so nicht ganz\n\nLeute die in der CS toxic sind mit dem Ziel eine andere Rolle oder jemanden zum Dodgen zu bekommen würden deutlich schneller bestraft werden, weil die machen das ja nicht immer sondern nur in bestimmten Situationen und bleiben daher relativ lange im System. Zudem ist nicht jeder davon ingame dann toxic und ich behaupte einfach gerade dann vergessen viele was in der CS passiert ist und reporten gar nicht.\n\nKlar, die die ihre Drohungen wahr machen und Trollen, den kann man leicht Herr werden aber diejenigen die das nur androhen und dann aber nicht Trollen bleiben lange im System was dadurch verbessert werden würde.\n\nZudem denke ich, dass dadurch das erpressen bzw klauen von Rollen oder Trollandrohungen seltener passieren werden weil, weil man auch ohne ein Spiel gespielt zu haben bestraft wird.\n\nWIe gesagt geht's hier nur um die Möglichkeit zu reporten, das die Aktuellen Strafen fürs verlassen der Q so bleiben wie sie sind ist auch meine Meinung.","replies":[{"poster":"Nordwolf87","date":"2018-04-25T19:19:00.610+0000","up_votes":1,"down_votes":0,"body":"Hmm ja da geb ich dir recht....dss Problem des \"Report-Vergessens\" würde das dann verbessern.\n\nTja die frage ist hier eine sehr grundsätzliche, die vorher eindeutig geklärt werden müsste: ist schon alleine die Androhung zu trollen strafbar?","replies":[{"poster":"Awsane","date":"2018-04-25T19:33:21.603+0000","up_votes":2,"down_votes":0,"body":"ich würde sagen ja\n\ndas ist im Strafrecht außerhalb von lol ja auch so\n\nwarum sollte das dann in lol anders sein?","replies":[{"poster":"Nordwolf87","date":"2018-04-26T06:39:32.872+0000","up_votes":1,"down_votes":0,"body":"Aber im Strafrecht gibt es den \"Rücktritt vom Versuch\" der strafbefreiend wirkt.\n\nUnd im Rl-Strafrecht kommt es auch auf die drohung an ob es strafrechtlich relevant ist.","replies":[{"poster":"Awsane","date":"2018-04-26T08:25:05.255+0000","up_votes":2,"down_votes":0,"body":"also ich bin dafür, dass es strafbar ist\n\nes gibt für mich keinen Sinnvollen Grund das zu tun in der CS der Straffrei sein sollte.\n\nDas ist mMn immer negatives Verhalten und ich empfinde es als störend. Geht es dir nicht so? Also ich würde mich freuen, wenn es so wäre, weil ich denke, dann würde man deutlich weniger davon in der CS sehen weil es viel riskanter wird es zu tun, weil momentan ist das Risiko wenn man es tut bestraft zu werden echt gering (also wenn man nur Droht um ne Rolle oder einen Dodge zu erzwingen aber nicht wirklich trollt)","replies":[{"poster":"Nordwolf87","date":"2018-04-26T20:29:07.212+0000","up_votes":1,"down_votes":0,"body":"Schau im grunde bin ich nicht dagegen es zu bestrafen, nur es liegt im eigentlichen Sinn noch keine \"Tat\" vor.\n\nKlar ist es negativ, aber er hats ja noch nicht getan...verstehst du was ich meine?","replies":[{"poster":"eingew","date":"2018-04-27T04:57:03.837+0000","up_votes":2,"down_votes":0,"body":"Natürlich hat er etwas getan. Es geht hier um Erpressung. Das ist sogar nach Gesetz ein Straftatbestand (auch wenn dieser wohl kaum auf Spiele angewendet werden würde). Es ist nicht einfach nur negativ. Es geht darum, einen anderen Spieler zu einem gewünschten Verhalten zu zwingen. Natürlich ist das eine Tat.\n\nUnd selbst wenn es nicht darum gehen würde, eine Rolle zu bekommen und der Spieler einfach so aus Jux und Dollerei  damit drohen würde, zu Trollen, wäre es natürlich trotzdem falsch. Er hat ganz klar etwas getan, nämlich seine Mitspieler bedroht. Das alleine ist doch schon eine Tat.","replies":[{"poster":"Nordwolf87","date":"2018-04-27T11:51:16.903+0000","up_votes":1,"down_votes":0,"body":"Uiuiui ich fürchte, da hab ich mich wohl missverständlich ausgedrückt.\n\nWenn er wen damit erpresst à la \"let me go mid or i'll troll\" ist das ganz klar schon eine tat.\n\nWenn ihm aber sein Champ weggebannt oder -gepickt wurde und er schreibt \"i troll now, yasuo was banned\" ist das was anderes in meinen augen. Dann hat er grundsätzlich noch nichts \"getan\". Ich hatte schon einige solcher kandidaten, die dann nicht die beste leistung gebracht haben, aber weit weg von trollen oder inten waren.","replies":[{"poster":"eingew","date":"2018-04-27T12:08:12.962+0000","up_votes":1,"down_votes":0,"body":"Würde ich allerdings trotzdem noch als \"negative Attitude\" auf einem ähnlichen Level wie \"ff15\" betrachten.","replies":[{"poster":"Nordwolf87","date":"2018-04-27T12:29:59.577+0000","up_votes":2,"down_votes":0,"body":"Ja wie gesagt logisch ist es immer noch negativ.","replies":[{"poster":"Awsane","date":"2018-04-28T10:58:57.189+0000","up_votes":1,"down_votes":0,"body":"naja negativ sein, ist ja ein bestrafungsgrund, sehe da nicht so das Problem der fehlenden Tat","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"xBlackthundeRx","date":"2018-04-26T06:22:14.937+0000","up_votes":1,"down_votes":1,"body":"Es könnte so einfach sein.\nEinfach nen Aktiven knopf der sich dodge nennt, dort kann man dann als grund einfach alles so lassen, bekommt seine Strafe und gut ist.\nOder man kann jemanden reporten.\nVon mir aus kann das System da auch etwas genauer sein, für nen \"mid or troll\", wird keiner bestraft. Viele die das schreiben knicken sowieso ein.\nAber hardcore flamer sollten ihre strafe bekommen und sollte es zu einer Strafe kommen, sehe ich auch kein Problem, die Dodge Strafe, zumindest die LP, zu erstatten. (die 5min wartezeit wird schwer nachträglich zu erstatten xD)\nTroll Picks wird schwer zu reporten. Da OffMeta ja ok ist, und nen System nen Discon Nunu schwer von nem Off Meta nunu Mid unterscheiden kann, ohne das ein Spiel gestarted ist.","replies":[{"poster":"Homunculi","date":"2018-04-26T06:46:50.801+0000","up_votes":2,"down_votes":0,"body":"Find ich im Grundgerüst gut.\n\nMan sollte aber die dodge Strafen so lassen wie sie momentan sind. Damit das System nicht abused werden kann.","replies":[]}]},{"poster":"eingew","date":"2018-04-25T04:27:01.113+0000","up_votes":2,"down_votes":0,"body":"Auch wenn ich dir grundsätzlich zustimme, dass eine Reportfunktion in der CS nur Vorteile hätte, so muss ich doch sagen, dass ich *gegen* eine Abschaffung des kleinen Zeitbans für das Verlassen dieser bin. Je nach Stimmung der Mitspieler und vor allem (mEn) in ARAMs bekommt man eine kleine Kostprobe darauf, wie es ist, wenn ständig Spieler die CS verlassen. Oder hast du zufällig den ersten Versuch des Teambuilders gespielt? Wo man tatsächlich ungestraft die Gruppen leaven durfte wie man will und die Spielleiter die Leute kicken durften, wie sie wollen? Wo man als Teamleiter irgendwann komplett verzweifelt *jeden* genommen hat, einfach nur um nach 20-30 Minuten Wartezeit *endlich* in ein verdammtes Spiel zu kommen? \nIch muss sagen, ich habe *überhaupt keine* Lust, dass das in der Rankedqueue die Norm wird, geschweige denn habe ich für Normals Lust auf so einen Quatsch. Da würde ich glatt wieder Blindpick als bevorzugte Queue auspacken, da wäre mir auch die Toxicness egal, ich will, wenn ich in die Queue gehe einfach nur in ein Spiel!\n\nTl, dr: Das \"Problem\" der Zeitstrafe fürs Verlassen der CS schützt uns vor weit größeren Problemen. Eine Abschaffung halte ich daher für eine ganz schlechte Idee. Man sollte also auch, wenn man den anderen Spieler meldet, selbst eine Zeitstrafe bekommen.","replies":[{"poster":"Awsane","date":"2018-04-25T13:22:33.419+0000","up_votes":1,"down_votes":0,"body":"Ich sehe das so wie du\n\nwobei ich es sehr Schade finde, dass wir die Option des reportens in der Q am besten auch so, dass wenn wer anderes die Q verlässt ich jeden noch danach dennoch reporten kann, nicht haben.\nIch finde es auch etwas unverständlich, dass es bisher nicht gemacht wurde, weil so würde man den ganzen lane Dieben, \"mid or feed\", Disco Nunus etc doch deutlich kontra geben können, was dann mMn auch zu einer Abnahme der Häufigkeit führt, weil es weniger attraktiv ist es als Täter zu tun.","replies":[]}]},{"poster":"erlikan92","date":"2018-04-25T13:49:35.835+0000","up_votes":1,"down_votes":1,"body":"finde ich sowieso das total tum das man bei verlassen von chapionauswahl strafe bekommt sorry aber ist einfach nur lächerlich man ist somit ständig gezwungen immer wieder die eine rolle zu spielen wenn man keine strafe haben will ( finde früher besser wo die hatte gemacht das man seine rolle vor der spieler suche zuweißen konnte aber jetzt naja spiel ist im großen un ganzen sehr gut aber das mit der suche verdirbt den ganzen spiel spass -.- ){{champion:32}}","replies":[{"poster":"eingew","date":"2018-04-25T15:30:52.210+0000","up_votes":1,"down_votes":0,"body":"Man weißt sich doch auch jetzt eine Rolle zu?","replies":[]}]},{"poster":"Mad Loony","date":"2018-04-24T21:37:06.502+0000","up_votes":2,"down_votes":3,"body":"Da hast du wohl Recht. Dieses Problem ist vor allem seit Einführung der Autofill Position gewachsen. Autofillte Spieler tendieren dazu in der Champselect zu trollen um der Supp Rolle zu entgehen.","replies":[{"poster":"Homunculi","date":"2018-04-25T06:16:32.732+0000","up_votes":1,"down_votes":0,"body":"Was aber nicht wirklich hilft, wenn sie einmal Support autofilled wurden, wird es ihnen im nächsten Spiel mit Sicherheit erneut passieren.\n\nPersönlich muss ich sagen, dass ich teilweise 20 Spiele mit aktivierter Autofill \"Warnung\" gespielt habe ohne das diese getriggert wurde. \n\nZum TE:\n\nJa eine Strafe für die CS wäre gut, aber nur wenn die Leute damit zurecht kommen das, wenn sie die CS verlassen, für sie eine (Zeit)Strafe drin ist. Ich lasse mich selten von soetwas beeindrucken, wer unbedingt meint stunk machen zu müssen, muss auch damit leben das er die MMR/LP/ELO auch verliert. Wenn man wegen solchen Subjekten die CS verlässt, lässt man ihnen einen kleinen Sieg und ich persönlich möchte das nicht :).","replies":[]}]}]}