{"poster":"Jooel1010","date":"2016-09-23T03:39:30.084+0000","title":"¿como son las clasificatorias?","subforum":"Problemas Técnicos","up_votes":4,"down_votes":0,"body":"quiero saber como son la clasificatorias ya que  llege a nivel 30 hoy y no se de que se trata ese modo","replies":[{"poster":"Ingratitud","date":"2016-09-23T03:57:53.444+0000","up_votes":6,"down_votes":0,"body":"Vallamos por partes Jooel1010 jaja:\n\n1. Debes tener nivel 30 y poseer **al menos 16 campeones** antes de unirte a las colas clasificadoras. (No cuentan los campeones de rotación gratuita).\n\n1.  El invocador debe completar sus 10 primeras **partidas de posicionamiento**. Una vez completadas, el jugador entra en una liga con hasta 250 jugadores del grado correspondiente: Bronce, Plata, Oro y en casos excepcionalmente bueno platino.\n\n1.  Tu liga o no liga (unranked) **NO **afecta al emparejamiento. Competirás contra oponentes de diversos niveles de habilidad, representados por un nivel de emparejamiento (MMR) oculto, en tu caso es el equivalente al de alguien en Oro V o Plata I.  \n\n1.  Por ultimo, una vez que terminaron tu **partidas de posicionamiento**, tu MMR final se usa para determinar tu posición en un grado y división específicos, ejemplo Bronce V o Platino I, Plata III, Oro IV, etc. Después del posicionamiento, tu MMR aumenta o disminuye, según ganes o pierdas partidas. Este valor está oculto y se usa para encontrar oponentes para cada combate.\n\n{{sticker:slayer-jinx-catface}} \n\n\nEspero haberte ayudado en algo y suerte en tus partidas de posicionamiento.\n\n\nPara mas información: https://support.riotgames.com/hc/es-419/articles/204010760-Preguntas-Frecuentes-de-Clasificatorias","replies":[]},{"poster":"Green Ward","date":"2016-09-23T04:07:30.455+0000","up_votes":4,"down_votes":0,"body":"Las clasificatorias (o rankeds) son como las partidas normales 5v5 en modo reclutacion, pero con  ligas y puntos. A medida que vas ganando puntos,  ascendes de liga. Dependiendo que tan bien juegues las primeras 10 partidas, el sistema te va colocar en alguna liga y de ahi tenes que tratar de subir -o al menos no bajar. Seguramente ya escuchaste hablar de las ligas -bronce, plata, oro, platino, diamante, master- y cada una de ellas tiene 5 divisiones.\n\nPara poder moverte entre divisiones y ligas se maneja un sistema de puntos de liga o \"LP\". Ganar te da puntos de liga, perder te resta puntos de liga. Si alcanzas 100 puntos de liga, podes subir de division, si tenes 0puntos de liga y perdes varias veces el sistema te baja de division. La cantidad de puntos que ganas o pierdas depende de tu desempeño general en las ultimas partidas ranked. Si por ejemplo ganas mucho mas de lo que pierdes, el sistema te da muchos puntos al ganar y te resta muy pocos puntos al perder. En cambio si vienes de una mala racha durante varias semanas, cada vez que pierdas el sistema te quita muchos puntos, y al ganar te da muy pocos. Es porque el sistema trata de acomodarte y mantenerte en la liga que cree que perteneces.\n\nPor eso en general cuando recien se llega a lvl 30, es como que a uno todavia  le faltan madurar muchos conceptos en el juego y no es recomendable meterse directamente a clasificatoria. Tene en cuenta que si arrancas perdiendo, el sistema te pone en una liga baja y despues cuesta mucho mas subir, porque el sistema te empareja con gente que tambien juega mal, te da pocos puntos al ganar partidas y parece imposible subir. Recomendaria que no empieces ranked/clasificatoria hasta que sepas usar bien varios champs, entiendas y sepas farmear, que asumas la importancia de los objetivos (torre, dragon, baron) sobre las kills y puedas jugar bien al menos dos roles diferentes.\n\nY otra cosa, el ambiente de clasificatoria es un poco mas tenso. Al ser un modo competitivo, ir a una clasificatoria y tener MUY poco farm o decir cosas \"estoy probando este champ\" o \"cambiame de lane porque solamente se jugar mid\" por ejemplo va poner furiosos a tus compañeros y probablemente terminen reportandote. Lo mismo si feedeas mucho. Es un ambiente bastante mas toxico porque todos estan MUY desesperados por ganar. Y esa toxicidad se mantiene en todas las ligas. \n\nDe todos modos la desicion de jugar es tuya. Si antes de final de temporada llegas a plata te da un marquito para la pantalla de inicio de partida, si llegas a oro te dan una skin, y en las siguientes divisiones no se. Cuando termina la temporada (alrededor de noviembre supongo) se resetean todas las ligas y el año que viene arrancan desde cero de nuevo, asi que es una oportunidad interesante si quieres probar tu desempeño sabiendo que el reseteo está cerca.\n\nEscribi un testamento.  saludos","replies":[]},{"poster":"Snooow","date":"2016-09-23T03:46:48.948+0000","up_votes":3,"down_votes":0,"body":"Es un modo donde la gente trata de dar lo mejor de si para ganar puntos y subir de liga, pero es recomendable que estas bastante experimentado en el juego antes de entrar ahi, sino la gente al jugar para ganar y no para divertirse, son mas propensos a enojarse e insultar si alguien novato les toca en su equipo","replies":[]},{"poster":"MrWhite17","date":"2016-09-23T14:55:02.203+0000","up_votes":1,"down_votes":0,"body":"Mucha gente acordandose de la mama de los otros. Entrá te vas a divertir","replies":[]},{"poster":"Hilario Navarro","date":"2016-09-23T04:54:54.873+0000","up_votes":1,"down_votes":0,"body":"Una vez que entras en ese lugar tu vida cambiara rotundamente , para mal obvio.","replies":[]},{"poster":"PCtronix","date":"2016-09-23T03:54:48.825+0000","up_votes":1,"down_votes":0,"body":"agregando lo que dijo tatocapoloco premian a la gente que esta desde plata o + , pero como siempre es muy recomendable tener experiencia y saber que jugar antes de ir a jugar las clasificatorias","replies":[]},{"poster":"ghost134","date":"2016-09-23T03:41:12.535+0000","up_votes":1,"down_votes":1,"body":"horribles.","replies":[]},{"poster":"PanCoonChancho","date":"2016-09-23T04:21:30.495+0000","up_votes":1,"down_votes":2,"body":"Todo lo que e leido hasta ahora en este post son mentiras \"la gente da lo mejor de si\" \"no flamean\" \"son todos buenos e iran al cielo\" las pelotas son puros pendejos ratas (probablemente igual al 90% de la gente que escribe en esta wea) que te trollearan y lo disfrutan es un modo de juego que por ahora no vale la pena jugar porque solo te hara pasar un mal rato, experiencia propia consigue 4 amigos aunque no sean tan buenos por ultimo sabes que no te trollearan porque el dia que me tope con alguno de los pendejos que me a trolleado las ultimas 8 rankeds les juro que le voy a romper las rodillas xd perdon estoy enojado baje de platino recien y quiero dispararle a los hijos de perra que me trolearon :v","replies":[]},{"poster":"Shion Archimago","date":"2016-09-23T04:05:20.341+0000","up_votes":1,"down_votes":5,"body":"lo mismo q las normales ninguna diferencia","replies":[]}]}