{"poster":"ApJhinOpJhin","date":"2019-07-15T06:24:14.341+0000","title":"Achja, wie ich einige leute dieser communty liebe","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":2,"body":"Hab gerade n game auf mein smurf gemacht (einfach um bissel ruhe von den schwitzern auf high level zu haben) und dann is mir eine bestimmte person aufgefallen im laufe der runde\r\n\r\nPost gamelobby kommentar: http://prntscr.com/of3e7s\r\n\r\nIm spielt hat die person alle nur zugeflamed und ge ragequitted. Hätte nicht gedacht das in Low level bereichen solche vollpfosten sein könn\r\n(Ich war der morde btw)\r\nich hoffe mal die person bekommt immerhin ein 2week ban, da ich mal denke dass Suizid-Wünsche ehr unangemessen sind.","replies":[{"poster":"Volume 15 ","date":"2019-07-15T06:31:11.791+0000","up_votes":1,"down_votes":13,"body":"Ist doch klar dass leute auf den Low Levels Toxic sind, da sie nichts zu verlieren haben ( ist halt ein low level smurf)\nUnd wieso zensierst du überhaupt den Namen?","replies":[{"poster":"ApJhinOpJhin","date":"2019-07-15T06:32:08.318+0000","up_votes":10,"down_votes":1,"body":"hab den zensiert da es ja sein kann das einige leute ihn adden würden und dann zuflamen","replies":[{"poster":"Volume 15 ","date":"2019-07-15T06:39:25.634+0000","up_votes":1,"down_votes":14,"body":"Kein Affe würde das machen, und falls du darauf hoffst dass er eine Sperre bekommt dann zensier den erst recht nicht","replies":[{"poster":"00 M4ddin 00","date":"2019-07-15T07:49:45.998+0000","up_votes":6,"down_votes":0,"body":"Name shaming ist im Forum verboten ;) \n\nWenn er will das er bestraft wird. Reportet oder Ticket schreiben","replies":[{"poster":"eingew","date":"2019-07-15T09:39:25.795+0000","up_votes":4,"down_votes":0,"body":"> Name shaming ist im Forum verboten ;)\n\nDas ist zwar völlig richtig, aber es ist noch hundertmal schöner, wenn die Leute sich da aus eigenem Idealismus dran halten ^^","replies":[]}]}]}]},{"poster":"OT Riku","date":"2019-07-15T07:05:23.358+0000","up_votes":7,"down_votes":1,"body":"Weil es verboten ist im forum leute an den Pranger zu stellen.","replies":[]},{"poster":"Angel Ayume","date":"2019-07-15T08:37:36.733+0000","up_votes":2,"down_votes":0,"body":"Ok, das musste mir mal erklären. Inwiefern hat ein Spieler in low Level denn nichts zu verlieren?","replies":[{"poster":"00 M4ddin 00","date":"2019-07-15T09:01:45.856+0000","up_votes":1,"down_votes":0,"body":"Er mein halt ein Account mit zb lvl 20 hat sicher keine skins und ist im notfall in 3 Tagen wieder hoch gespielt. Vilt noch schneller da tut ein ban nicht weh :)","replies":[{"poster":"Angel Ayume","date":"2019-07-15T09:12:56.399+0000","up_votes":2,"down_votes":0,"body":"Ach so....","replies":[]}]}]}]},{"poster":"renegade2k","date":"2019-07-16T18:30:09.859+0000","up_votes":2,"down_votes":0,"body":"Leider Standard heutzutage.\nDie Community besteht zu 80% aus toxic kiddies und daran wird sich auch nichts ändern, denn in den niedrigen lvl Bereichen sowie non-ranked spielen wird kaum bis gar nicht moderiert.\nDa benehmen sich die Leute wie der letzte Dreck und man kann reporten, bis man schwarz wird, es hat einfach keine Konsequenzen.\nSchreibt man ein Ticket, heißt es \"das gehört hier nicht hin. Du musst das schon ingame reporten\"\nSchreibt man es ins Forum, heißt es \"naming is shaming\", selbst wenn die Person rassistischen Müll und persönliche Beleidigungen und Hassrede verbreitet.\nAlso ... immer brav die Trolle muten, reporten (auch wenn es nichts bringt) und auf block setzen und damit leben ...\n\nGenau das hat mir eigentlich schon lange den Spaß am Spiel geraubt.\nAber egal wie sachlich und konstruktiv man die Kritik äußert, es stößt auf taube Ohren","replies":[{"poster":"Alpacana","date":"2019-07-16T21:21:43.893+0000","up_votes":3,"down_votes":0,"body":">  denn in den niedrigen lvl Bereichen sowie non-ranked spielen wird kaum bis gar nicht moderiert.\n\nFun Fact. Es wird **gar nicht** moderiert. Es läuft alles über ein automatisches System, welches jeden Spieler unter gleichen Bedingungen bestraft. (Wobei permanente Sperren ja doch manuell manchmal nochmal überprüft werden wie manche Leute hier behaupten)\n\n> Da benehmen sich die Leute wie der letzte Dreck und man kann reporten, bis man schwarz wird, es hat einfach keine Konsequenzen.\n\nDa kommt es auch drauf an **was** du reportest. Einen Troll kann das System z.B. nur sehr schwer bis gar nicht erkennen. In diesem Fall solltest du z.B. ein Ticket schreiben.\nBei Flame funktioniert das System allerdings ziemlich gut. \nDie Konsequenzen wirst du auch nicht sehen können. Die Feedback-Meldung bekommst du nur äußerst selten (aus Datenschutz-Gründen), klar, du kannst schauen ob der Spieler die nächsten 14 Tage nicht spielt aber woher willst du wissen, ob er überhaupt einen 14 Tage-Ban bekommen hat? Evtl hat er einfach eine Chatrestriction bekommen, die du überhaupt nicht nachprüfen kannst.\n\n> Schreibt man ein Ticket, heißt es \"das gehört hier nicht hin. Du musst das schon ingame reporten\"\n\nIch persönlich hab auch schon ein Ticket dahingehend geschrieben und als Antwort eher bekommen: \"Danke dass du es gemeldet hast, wir werden uns den Fall ansehen. Ansonsten solltest du aber auf jeden Fall den Spieler auch immer Ingame reporten\".\n\n> Schreibt man es ins Forum, heißt es \"naming is shaming\", selbst wenn die Person rassistischen Müll und persönliche Beleidigungen und Hassrede verbreitet.\n\nIst ja auch nicht falsch oder? Egal wie schlimm jemand geflamed hat, wenn du ihn im Forum anprangerst betreibst du eben Name-Shaming. Das wäre eine Art von Selbstjustiz die eben nicht erwünscht ist.\n\n> Also ... immer brav die Trolle muten, reporten [...] und auf block setzen und damit leben ...\n\nVollkommen richtig. Dem habe ich nichts hinzuzufügen.","replies":[{"poster":"renegade2k","date":"2019-07-17T12:04:05.544+0000","up_votes":1,"down_votes":0,"body":">  Die Feedback-Meldung bekommst du nur äußerst selten (aus Datenschutz-Gründen)\n\n\nOk, das habe ich nicht gewusst. Nach meinem letzten Wissensstand hat man immer eine Rückmeldung bekommen, sobald mehr unternommen wurde, als ein Mute.\n\n> Evtl hat er einfach eine Chatrestriction bekommen, die du überhaupt nicht nachprüfen kannst.\n\nBestes Beispiel: Letzte Woche habe ich mehrfach mit einem flamer gespielt, der mal gezielt einen gemobbt, mal (wenn andere nicht mitgezogen haben bei seinem geflame) alle aus dem Team pauschal aufs übelste beleidigt hat, bevore er das match geleavet hat. Und nicht nur a la \"ihr noobs\" sondern gleich persönlich angegriffen und rassistisch geworden.\nHabe es jedes Mal gemeldet. Nichts ist passiert. Er hat die letzte Woche immer weiter gespielt, er war auch diese Woche mit mir zusammen im Spiel und er flamet genau so weiter wie bisher. de facto gab es da nicht mal ein mute...\n\n>  Das wäre eine Art von Selbstjustiz [...]\n\nDas sehe ich nicht so.\nIch richte nicht über denjenigen. Sage auch nicht \"teert und federt ihn\". Ich lege ihm auch keine Wörter in dem Mund, oder interpretiere etwas hinein, was nicht da ist.\nWenn jemand öffentlich in einem Chat irgend ein Mist, welcher Natur auch immer, verbreitet, sollte er doch auch dafür die Konsequenzen tragen, oder? Es ist ja nicht so, dass ich jemand mit Echt-Namen und Adresse hier outen würde. Ich zeige lediglich symbolisch mit dem Finger auf jemand, der sich bewusst dazu entschieden hat die Community zu verderben und anderen das Spiel zu vermiesen.\n\nPS: da ist mir gerade noch ein Punkt eingefallen, den ich oben nicht erwähnt habe, den ich aber wirklich als DAS Hauptproblem sehe:\nWeil es eben so viele Trolle und flamer gibt, die nicht bestraft werden halten wie wiederum alle zusammen, weil 'man kann dann doch super auch in einer Gruppe Mist bauen, ohne das was passiert.'\nUnd auch das sehe ich ingame immer und immer wieder!\nWir spielen gemeinsam fröhlich ARAM ... bis dato ist kein einziges böses Wort gefallen oder sonstwas ...\nTeamfight, 4 gehen rein, 1 bleibt hinten stehen. Alle kommen mit 10-20% HP wieder zurück, der eine, der hinten stand rennt zum Potition und nimmt ihn, bevor das Team die healzone erreicht.\nIch \"srsly? would you plz wait for all or ping at least\"\ner \"shut up noob. /all report rene for flame\"\ngegnerisches team 2x \"ok\" [an der stelle schon ich wtf?!]\neigenes Team (!!!) \"rene reported\" [W-T-F?!]\nAlles klar, heißt für mich, Spiel ist gelaufen. Ich dümpel also hinter den Tanks rum und farme Minions, ohne was zu riskieren, weil einfach kein Bock für so ein Team rein zu springen und zu sterben, weil die auch mit Absicht dann nicht in den Kampf folgen, sondern weg rennen ...\ngegnerisches Team \"4v5?\"\neigenes Team \"yeah, rene afk\"\nUnd DAS sind so Momente, wo ich mir denke _NOPE_ ... DAS ist nicht die Community, wie sie war, als ich mit dem zocken angefangen habe.\nEinfach jeden grundlos weg bashen, flamen, trollen und die Leute kommen andauern davon und sehen das ganze dann noch als ein größeren \"Spaß\", als das Spiel an sich ...\n","replies":[{"poster":"Alpacana","date":"2019-07-17T12:17:34.594+0000","up_votes":2,"down_votes":0,"body":"> Habe es jedes Mal gemeldet. Nichts ist passiert. Er hat die letzte Woche immer weiter gespielt, er war auch diese Woche mit mir zusammen im Spiel und er flamet genau so weiter wie bisher. de facto gab es da nicht mal ein mute...\n\nEventuell hat er durchaus eine Chatrestriction bekommen und sie einfach schon abgearbeitet?\nDas System gibt aber eine gewisse Toleranz. Nur weil du dich in einem Spiel schlecht verhältst, dich in 1000 anderen aber positiv verhältst wird das System dich nicht sofort bestrafen. Die einzige Ausnahme hierbei ist, wenn du Wörter verwendest die unter Riots 0-Toleranz-Politik fallen. Das wären Dinge die \"kys\", \"faggot\" etc.\n\nIch will diesen Spieler auch gar nicht gut reden. Ich finde Flamer genauso schrecklich wie du. Das System ist auch nicht perfekt, Fehler können immer passieren, aber alles in allem werden permanente Flamer doch ziemlich erfolgreich bestraft.\n\n> Das sehe ich nicht so. Ich richte nicht über denjenigen. Ich lege ihm auch keine Wörter in dem Mund, oder interpretiere etwas hinein, was nicht da ist.\n\nDarauf wollte ich auch gar nicht hinaus. Sagen wir, jemand begeht einen Mord, die Anklage gegen ihn ist aber noch nicht durch. Jetzt kommst du daher und prügelst ihn krankenhausreif.\nIn dem Fall könnte man die Prügel mit dem Name-Shaming vergleichen. Die eigentliche Anklage (die Bestrafung vom Gesetz) ist dir vollkommen egal, du möchtest dem Angeklagten einfach nur schaden.\nDie Bestrafung des Gesetzes (der oberen Instanz) wäre in diesem Fall die Bestrafung von Riot, die du hier schlichtweg ignorierst.\nAuch wenn viele evtl. die Prügel von dir mehr als verstehen würden (schließlich hat der Typ jemanden umgebracht), ist es nicht der richtige Weg mit der Situation umzugehen.\n\n> Es ist ja nicht so, dass ich jemand mit Echt-Namen und Adresse hier outen würde. Ich zeige lediglich symbolisch mit dem Finger auf jemand, der sich bewusst dazu entschieden hat die Community zu verderben und anderen das Spiel zu vermiesen.\n\nSchon, aber nur weil jemand anderen das Spiel vermiest heißt das doch nicht, dass du ihn jetzt vermiesen musst oder?\n\n____\n\nRiot (und auch das Gesetz im realen Leben) bestraft Spieler nicht einfach um sie zu bestrafen, sondern um eine möglichst hohe Reformquote zu erzielen. So wird Flamern z.B. mit einer Chatrestriction gezeigt, dass sie sich im Chat falsch verhalten. Inter dagegen bekommen keine Chatrestriction sondern ihnen wird das Spiel für eine Zeit entzogen um ihnen somit zu zeigen, dass sie sich im Spiel an sich falsch verhalten.\nWenn du Name-Shaming im Forum betreibst wird der Typ sich davon nicht reformen. Damit erzielst du lediglich, dass er womöglich von anderen niedergemacht wird und wenn wir mal ehrlich sind...Wollen wir überhaupt noch mehr Mobbing?","replies":[]}]}]},{"poster":"Aesto","date":"2019-11-04T23:55:18.143+0000","up_votes":1,"down_votes":0,"body":"leider wahr","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2019-07-16T18:43:42.976+0000","up_votes":2,"down_votes":1,"body":"Ich habe ja selber mal nen Smurf gelevelt und werde das nie wieder machen, weil es einer der toxischeren Erfahrungen meines Lebens war... Was aber bei genauerer Betrachtung auch Sinn ergibt.\n\nAlso ich habe damals dann in schöner Regelmäßigkeit folgenden Dialog geführt:\nIch: Go play on your Main then\nEr: Can't, it's banned\nIch: Hmm... wonder why...\n\nDa sich relativ viele gebannte Spieler (sei es nur um den 14 Tages Bann zu überbrücken) doch einen Smurf machen und die Smurf Detection ziemlich gut funktioniert, spielst du halt nicht mit dem Durchschnitt der LoL Community, sondern quasi auf einer \"Prisioners Island\". Darauf muss man sich halt einstellen, wenn man einen Smurf leveln will.\n\nMan sollte da aber keine Schlüsse auf die LoL Community im Allgemeinen ziehen.","replies":[]},{"poster":"AlyssiaLishes","date":"2019-07-22T08:43:31.269+0000","up_votes":1,"down_votes":0,"body":"Ich weis aufjedenfall das auf Todwünsche im allgemeinen sehr schnell reagiert wird. Als ich letztes Jahr jemand gewünscht habe sich und seine Familie zu töten hab ich sofort nen 14 Tage bann bekommen ohne davor auffällig geworden zu sein. Klar, meine Äusserung war nicht sehr vorbildhaft und moralisch total daneben aber irgendwann hat man nunmal die Schnauze voll von Leuten die permanent dich beschuldigen für alles mögliche etc. hatte so genug davon, da hab ich mir mal erlaubt einmal meine gesamte Wut auf den \"armen\" Tropf auszulassen, der war zumindest danach ruhig :x\n\nIm Endeffekt sind wir hier im Internet (die sogenannte Kanalisation der Menscheit), da verhalten sich die meisten total anders als in Real Life. Lernen zu differenzieren ist vorallem im Internet sehr wichtig.","replies":[]}]}