{"poster":"ExQuiiSiT","date":"2017-11-10T02:45:09.636+0000","title":"D5 Jungler im SoloQ sucht Midlane / Toplane Mate zum Runen erkunden & zum Seasonstart duon","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"**Servus Community,**\r\n\r\ndie neuen Runen sind raus, das Chaos ist gro&szlig; und viele Spieler testen einiges aus, zurecht! Vieles scheint viable, auch einiges broken zu sein, jedoch fehlt mir die Motivation diese Fiesta alleine durchzustehen xD. Ich selbst teste nat&uuml;rlich auch noch ein bisschen rum, keine Frage, jedoch auf eine seri&ouml;se Art und Weise. Aus diesem Grund &amp; da ich ebenfalls zum Seasonstart jemand langfristig gerne an meiner Seite h&auml;tte, um die Ladder zu climben, schreibe ich diesen Forum Thread, in der Hoffnung es meldet sich der/die ein oder andere!\r\n\r\n**Grundvoraussetzungen hierf&uuml;r sind folgende:**\r\n\r\n* - Du bist ein Tilter, raged gerne rum, weinst &uuml;ber einen Camp des Enemy Junglers oder deren Setzung der Priority? -&gt; Lies garnicht erst weiter :)\r\n* - Du solltest dich im Elo Bereich ab Platin3 befinden, gerne auch etwas h&ouml;her\r\n* - Du solltest Spa&szlig; am Spielen haben, auch Spa&szlig; verbreiten k&ouml;nnen, sodass man auch mal auf dem Teamspeak lachen kann\r\n* - Main Toplane oder Midlane sein (Synergy mit Jungle meines Erachtens am gr&ouml;&szlig;ten)\r\n* - Kein OTP sein\r\n\r\n_Das sieht zwar erst einmal relativ viel aus, ist es aber garnicht denke ich mal :p_\r\n\r\n**Zu mir:**\r\n \r\n* - Ich bin 21 Jahre jung &amp; Student\r\n* - Ich befinde mich derzeit in Diamond 5 &amp; Diamond 4 FlexQ\r\n* - Erf&uuml;lle meine eigenen Voraussetzungen (w&auml;re horrible wenn nicht)\r\n* - Championpool bin ich flexibel, vermeide aber ganz gerne das Spielen von Assasins oder AFK&#039;junglern\r\n* - Rede ganz gerne mal m&uuml;ll, schwierig zu beschreiben\r\n\r\nSoweit sollte alles gesagt sein, zusammenfassend ist das quasi die Suche nach einem Mate der eine der beiden Rollen maint, um vor&uuml;bergehend Normals zu spielen oder auch FlexQ wenn man die Runen so ein bisschen erforscht hat &amp; um dann zum Seasonstart gemeinsam durchstarten zu k&ouml;nnen.\r\n\r\nSolltest du weitere Fragen haben, schmei&szlig; doch einfach den Add raus, dann kann man da ja weiter schreiben oder sich direkt mal auf dem Teamspeak treffen um zu quatschen.\r\n\r\nIch hoffe das sich der/die ein oder andere angesprochen f&uuml;hlt, ansonsten wenn nicht w&uuml;nsche ich trotzdem ein erfolgreiches Aneignen der Runen &amp; Meisterschaften und zugleich eine wundersch&ouml;ne &amp; angenehme Zeit in der Kluft der Beschw&ouml;rer.\r\n\r\nBis dahin, haut rein :)\r\n\r\n**Ign.: ExQuiiSiT**","replies":[]}