{"poster":"Randomonium","date":"2016-03-25T00:09:09.116+0000","title":"Hextech chests are easier to get than keys...and why that's bad","subforum":"Gameplay","up_votes":37,"down_votes":10,"body":"I&#039;ve already earned 5 Hextech chests so far this season but I&#039;ve only gotten 8 key fragments (translating into 2 keys.)  I haven&#039;t received a single key fragment in my last dozen wins.  Meanwhile, the first day I have a new chest available I&#039;m able to get an S rating within a couple games.\n\nRiot Wingfield in another post said:\n> [{quoted}](name=Wingfield,realm=NA,application-id=LqLKtMpN,discussion-id=rJ4rQmHA,comment-id=0006,timestamp=2016-03-22T20:49:01.290+0000)\n>\n> Hey all,\n> \n> Just want to help clarify some things about key drop rates:\n> \n> Key drop rates are NOT linear and only wins have a chance of dropping a key. So you will earn key fragments much faster in your earlier wins than you will in your later wins. Or said another way, each incremental key fragment drop is harder than the last (on average... there is variance). This resets on a monthly basis for each player individually. The goal is to create a nice ebb and flow.\n> \n> Grade does NOT impact key drop chance.\n> \n> Premades DO increase drop chance.\n> \n> Chests earned has no impact on key drop chance.\n> \n> There is variance and randomness (with limits).  It's unlikely that what happened to your friend will happen to you.\n> \n> Hope that helps clarify :)\n\nSource: http://boards.na.leagueoflegends.com/en/c/bug-report/rJ4rQmHA-after-getting-4-chests-key-fragments-no-longer-seem-to-drop-for-a-lot-of-people?comment=0006\n\nThis is a horrible, horrible idea.  This hextech crafting system was supposed to be about rewarding positive members of the community with rewards for **PLAYER PERFORMANCE**.  The hard part about the system was supposed to be getting the S rating for the champion, not mindlessly grinding games to get key fragments.  Yes, I understand the decayed of key fragment drops will reset every month.  However, as it stands right now with the key fragments dropping less and less the more keys you get it takes away all the sense of accomplishment of getting an S rating with the champion because I know I&#039;ll have to grind 30+ games in order to get enough key fragments to open the damn box.  Its like &quot;Yay!  Another box!  Guess I&#039;ll have to cross my fingers and hope I maybe get ONE key fragment in my next dozen wins!&quot;\n\nWhat&#039;s in the box!  Just freaking tell me what&#039;s in the box!  A skin? A champion? Gwyneth Paltrow&#039;s head?  What&#039;s in the box!\n\nI guess I&#039;ll never know since I&#039;ll have to play an exponential amount of games to open the damn thing since I sure as hell am not going to fork over more RP for this stuff.\n\nEDIT: I realized I should provide a solution, not just state the problem.  I propose that in addition to getting random key fragment drops if you achieve an S rating with a champion and you do not have any chests available you instead receive a key fragment.  This would solve the issue of people \"getting unlucky\" with drops and also give you a reward if you get an S rating when you don't have a chest available.\n\nEDIT 2: I'm all for exploring how much higher the drop rate for keys is with a premade.  If any of you want to group up add me in game.","replies":[{"poster":"Sukishoo","date":"2016-03-25T00:11:44.039+0000","up_votes":12,"down_votes":0,"body":"Clearly it's done so that you can instead get a free chest but in order to open it you must buy the key.","replies":[{"poster":"Randomonium","date":"2016-03-25T00:53:23.467+0000","up_votes":7,"down_votes":1,"body":"That's my fear, that this reward for positive players is just a thin veiled attempt to make more money. I sure hope not because if it is then it will become as useless as the honor system.\n\nThis system has the potential to really cut down on toxicity and improve the community but not if it's going to cost people money to reap the rewards.","replies":[{"poster":"Slamurai Jack","date":"2016-03-25T02:52:38.211+0000","up_votes":10,"down_votes":0,"body":"Notice how you can't buy more than 1 key at a time? There's a reason for that. Riot knew that key drops were never going to match the chest acquisition rate and are going to force you to constantly spend 125 RP over and over to keep up with all the chests you'll be earning.","replies":[{"poster":"YordleJay","date":"2016-06-22T03:05:38.389+0000","up_votes":3,"down_votes":0,"body":"What's wrong with that? they are a COMPANY and need to make money to pay their employees","replies":[{"poster":"Gimpy89","date":"2016-07-29T14:55:53.338+0000","up_votes":4,"down_votes":0,"body":"ikr.  Why are people complaining about riot giving free paid content as a ploy to get people to spend $$ on the game?","replies":[{"poster":"YordleJay","date":"2016-08-05T03:31:38.106+0000","up_votes":2,"down_votes":0,"body":"Not only that. THE GAME IS F2P","replies":[]}]}]},{"poster":"Essembie","date":"2016-10-15T21:35:05.335+0000","up_votes":1,"down_votes":0,"body":"I have 10 keys and no chests.\n\ndepends entirely on how you play lol. If you're good at a few champs, you'll earn keys. If you like trying a range of champs, you'll earn chests.\n\nAfter ranked season is over I'm going to hit norms hard and play a range of new champs to try earn some chests.","replies":[]}]},{"poster":"Essembie","date":"2016-10-15T21:32:29.786+0000","up_votes":1,"down_votes":0,"body":"I've got the opposite issue - I have far more keys than chests.\n\nas I see it, you have 2 paths to get them. try lots of champs and earn chests, get good at some champs and earn keys.","replies":[]}]},{"poster":"Haranimal","date":"2016-09-14T03:33:04.294+0000","up_votes":2,"down_votes":0,"body":"I have 9 keys... 95% solo. I only have a handful of champs in my rotation tho I feel the opposite pain. Although, as others have said, it's free content so hard to complain. We've gotten too whiny Riot has been pretty fair and good to us.","replies":[]}]},{"poster":"A Basic Island","date":"2016-03-25T00:13:32.793+0000","up_votes":12,"down_votes":2,"body":"you honestly thought a system 100% stolen from valves CSGO/Team fortress key+box system was to reward the PLAYER??\n\nhaha\n\nHAHAHAHAHA\n\n\n\nOMG HAHAHAHAHAHAHAHAHAHAHA\n\n\nsuch misguided faith.","replies":[]},{"poster":"gorenzel","date":"2016-03-25T03:37:19.189+0000","up_votes":2,"down_votes":6,"body":"Just play with premades and you'll get your keys faster.","replies":[{"poster":"Randomonium","date":"2016-03-25T03:51:28.961+0000","up_votes":9,"down_votes":0,"body":"You shouldn't have to rely on premades to get the key fragments though.  You should be able to get them at a reasonable rate going solo.","replies":[{"poster":"gorenzel","date":"2016-03-25T04:12:49.546+0000","up_votes":5,"down_votes":3,"body":"I can't agree on all these \"should and shouldn't\" claims, it's content that is being given out for free.  For me I have had no issue getting enough keys without premades,  It's really just a free lottery that some people won't get as lucky with.","replies":[{"poster":"Midar","date":"2016-04-03T12:49:06.216+0000","up_votes":3,"down_votes":0,"body":"They gave out for free a system that generates frustration for their solo players.\nI'm pretty sure there's room for \"shoulds and shouldn'ts\".\n\nEdit. forgot my \"should\" comment: \nWhile I agree with Riot creating a sistem to encourage playing with premades, I think they shouldn't make it harder for casual \"lonely\" players.\nI thought it was obvious nowadays that rewarding \"A\" instead of punishing \"B\" feels better for both \"A\" and \"B\", and this system feels like punishment for \"B\".\nAdd a button for the honor system named \"Deserves a key\" to increase a player's chances to earn a key fragment for that or next game (or even to affect that exponential decreasment in chances to get a key) and then the system transforms from a grind in unconfortable premades to feel less frustrated to an encouragment to play better and be kinder so that other people give them the buff.","replies":[]},{"poster":"Randomonium","date":"2016-03-25T04:52:08.648+0000","up_votes":2,"down_votes":0,"body":"Yeah, I think my point is that its TOO MUCH luck driven.  The whole point is rewards for performing well with a champion.  The isn't a MMO.  Grinding isn't fun in any game so why should we have a system in League where we have to grind games to get keys.\n\nHonestly an easy fix to this is that if you get an S rating with a champion and you don't have any chests available you should get a key fragment (or 2) instead.  That would fix the issue of these keys feeling like a grind.","replies":[]}]},{"poster":"Llanite","date":"2016-03-25T18:25:47.634+0000","up_votes":2,"down_votes":0,"body":"According to you.\n\nAccording to Riot, premade should yield easy keys, and solo players need to work for it.","replies":[]}]}]},{"poster":"Blinq","date":"2016-08-01T21:29:37.398+0000","up_votes":3,"down_votes":0,"body":"I seem to have the opposite problem... I happen to have 9 keys and 0 Hextech chests... Havent got a chest in a few months...","replies":[]},{"poster":"BajungaDustin","date":"2017-03-31T02:11:36.764+0000","up_votes":2,"down_votes":0,"body":"They should do this more like overwatch... Remove the key feature entirely.. \n\nThe key is dumb it basically speaks to the community that you would rather gouge are pocketbooks than you are rewarding us for good play / behavior..  I dont like the system with keys buy I like it without keys. \nMake it so you can earn one chest per champion per month for s games and afterwards make it so you earn chest fragments for S games for repeat play with champions. \n\nThis will effectively accomplish multiple things. \n\n1. You won't get penalized for playing your favorite champions over and over.. You will earn the rewards at a diminished rate. I'm thinking 1/2 of a chest for the 2nd and 3rd S game you get and then 1/4th of a chest from then on.. Resetting every month. \n\n2. This will encourage players to work toward 3 s games with each champion every month. Thus diversifying the meta a little more. Players with limited number of champions will be encouraged to play more and buy more champions. \n\n3. Free rotation champions will be locked to a 1/4th of a chest ratio unless you own that champion. Giving new player something to shoot for \n\nSimply adjust the chest rewards accordingly based on this rate of dispersion and there you go. \n\nThe players will be happier and Riot won't look like a bunch of douches following every other freemium game model out there that everyone hates. \n\nI honestly don't get it.. If riot wanted to make more money just remove the limit on chest purchases per day and throw up a warning after the player purchases more than 10 in one day that reminds them to buy responsibly.. And good to go.","replies":[]},{"poster":"SwordOfWar","date":"2016-12-07T18:48:26.121+0000","up_votes":2,"down_votes":0,"body":"You just have to be patient because its a season long endeavor. And if you can't handle being patient you can just buy a chest / key for like... a dollar or something? OMG such price wow","replies":[]},{"poster":"Gray Hollow","date":"2016-12-07T08:47:51.235+0000","up_votes":1,"down_votes":0,"body":"i have too much keys but no chests, so im kinda jelous of you\nany tips on earning chests?","replies":[{"poster":"Randomonium","date":"2016-12-07T18:34:34.709+0000","up_votes":2,"down_votes":0,"body":"Looking at your stats the thing that's holding you back is your cs/min. When I've gotten an S on junglers I usually have at least 4 cs/min and when I'm on laners I have no less than 6 cs/min (usually 7-9 cs/min.) And on top of that high cs you also need to have typically 4 or less deaths and also have a decent number of kills and assists. If you're a damage dealer you also usually need to have the highest damage on your team and if you're a tank you need to have the highest damage taken.\n\nI recommend going into custom games and working on your jungle clear and also working on your last hitting in lane. A lot of it is just experience. I used to think getting above 3 cs/min as a jungler was impossible and now I can get 5 or more without too much trouble.","replies":[{"poster":"Gray Hollow","date":"2017-01-18T22:27:24.656+0000","up_votes":1,"down_votes":0,"body":"thanks for the tips, will definitely try to use them in games and see if they help me improve","replies":[]}]}]},{"poster":"Apple tater","date":"2016-07-22T22:26:29.428+0000","up_votes":2,"down_votes":0,"body":"_**Meanwhile I can't get a single chest because I've already gotten them with the champs i play**_ {{item:3070}}","replies":[]},{"poster":"Critmaster Garen","date":"2016-03-25T04:03:14.858+0000","up_votes":3,"down_votes":1,"body":"its going to be like this for the first couple of weeks, when you play your mains.\n\nas you run low on champions you actually like, and youre really good at, its going to get harder and harder to get chests and youll stack up keys faster than chests.\n\ndont forget, that a chest regenerates only once every week, even if you have 40 different champions you like to play. youre telling me within the matter of a week you wont win around 10 games, including arams?\n\nby trying to get the chest alone, youre already going to play enough games to get at least 1 or 2 key fragments until the chest drops. (unless youre playing with premades who achieve high mastery scores on their own champions)\n\n\nthis is only happening right now, because when the system was released, everyone started out with 4 chest slots to unlock. if you played your mains and got your chests quickly, then of course youre going to sit on them for the next 2 weeks before you can unlock all of them.\n\n\nit really comes down to the fact that you wont get 4 chests every week, but continue to get keys while playing normally with your mains or arams.","replies":[]},{"poster":"Surr20plz","date":"2017-04-19T10:02:56.007+0000","up_votes":1,"down_votes":0,"body":"OP stfu.\n\nI have 24 keys.","replies":[]},{"poster":"SKlit","date":"2017-02-28T02:28:37.413+0000","up_votes":1,"down_votes":0,"body":"how? I have no chests and 8 hextech keys.... and its been months...","replies":[{"poster":"Raoul","date":"2017-04-19T09:59:41.877+0000","up_votes":1,"down_votes":0,"body":"stop being a one trick pony!","replies":[]}]},{"poster":"tumble","date":"2017-04-19T09:55:51.492+0000","up_votes":1,"down_votes":0,"body":"I have 7 keys (KEYS not fragments) and no chests. I've had more in the past, but that's what I'm at right now. \nWhat am I doing wrong, friends? It's been like this since the launch","replies":[]},{"poster":"Drgaonknight89","date":"2017-03-07T04:47:30.299+0000","up_votes":1,"down_votes":0,"body":"I feel a bit of the \"pain\".\nMainly because I have 23 chests right now and 2 key fragments that I got a long while ago.\nThough I don't know if they should change it. After all, I'm probably just unlucky right now.","replies":[]},{"poster":"GULAG 4 U","date":"2017-02-28T02:30:37.754+0000","up_votes":1,"down_votes":0,"body":"For me it's the opposite lol. I have like 40 keys and 0 chests. Because I try to only play Yi and Jhin these days.","replies":[]},{"poster":"LBmyBB","date":"2016-12-30T04:13:40.472+0000","up_votes":1,"down_votes":0,"body":"Really, its the opposite for me.","replies":[{"poster":"Draco1601","date":"2017-01-17T04:53:11.178+0000","up_votes":1,"down_votes":0,"body":"same","replies":[]}]},{"poster":"Sohleks","date":"2016-12-30T04:23:58.193+0000","up_votes":1,"down_votes":0,"body":"Takes anywhere from 36 wins (very lucky) to 64+ wins to get 12 key frags in the one month period. That is a lot of games at a 50% winrate.\n\nThe first 6 come quicker at like 10 to 24 of those game wins.\n\nBased off 6 months of my own data.\n\nI've got like 10 unopened boxes because playing that much is ridiculous.","replies":[{"poster":"Draco1601","date":"2017-01-17T04:52:42.681+0000","up_votes":1,"down_votes":0,"body":"I ve been playing casually for the last 3 weeks and have pilled up 13 keys. I cant get any chests though no matter how hard i try{{item:3070}}","replies":[]}]},{"poster":"ZephyrDrake","date":"2016-12-30T04:25:24.540+0000","up_votes":1,"down_votes":0,"body":"can people stop posting on a dead thread!? make your own damn thread instead of necroing old ones","replies":[]},{"poster":"Rhoku","date":"2016-12-30T01:44:57.296+0000","up_votes":1,"down_votes":0,"body":"Buddy. I got 10 complete keys, 2 fragments, and 0 chests.","replies":[]},{"poster":"bad arcade kitty","date":"2016-12-16T06:50:15.206+0000","up_votes":1,"down_votes":0,"body":"i got 4 keys (12 frags) the first month i played after a long hiatus\nthen i got 3 keys (9 frags) and bought one\nso i unlocked 8 chests for 125 rp\n\nthere is a formula on the internet, it seems 3 keys per month are reliable to get if you play actively, so it's like 125 rp per month if you get all the 4 possible chests per month, doesn't sound that bad","replies":[]},{"poster":"Camel T Hoe","date":"2016-12-16T06:18:24.627+0000","up_votes":1,"down_votes":0,"body":"i'Ve got 8 chest , 0 fragment , since preseason i opened 1 chest , its about to be a month without a single key fragment lol","replies":[]},{"poster":"Zeref","date":"2016-12-07T19:14:00.335+0000","up_votes":1,"down_votes":0,"body":"Meanwhile \n\nhttps://gyazo.com/0c5bf4765e1d0d10c3b1c0b03d59ec2b","replies":[]},{"poster":"Dominick Destine","date":"2016-09-14T23:11:28.472+0000","up_votes":1,"down_votes":0,"body":"I have like 5 keys and 0 chests.\n\nI get that maybe I'm an outlier but I highly doubt that's the case.","replies":[{"poster":"midnight oil24","date":"2016-12-07T18:40:13.030+0000","up_votes":1,"down_votes":0,"body":"I've never gotten a chest from a fight.","replies":[]}]},{"poster":"Duromaniac","date":"2016-10-29T17:58:27.630+0000","up_votes":1,"down_votes":0,"body":"I have 6 keys and 0 chest, all obtained with key fragments. if only i could sell them and get free rp.","replies":[]},{"poster":"BLACK REALM GOD","date":"2016-09-14T10:25:52.441+0000","up_votes":1,"down_votes":0,"body":"the reason you get more chests than keys is so\n\nyou cant farm chests - that would cut into riot's profits.\n\nbecause not every player plays 24/7 and they wanted them to get keys too. so if you play a game a month you should in theory get about as many as someone who plays 1 game a week.","replies":[{"poster":"Randomonium","date":"2016-09-14T10:30:07.071+0000","up_votes":1,"down_votes":0,"body":"You already can't farm chests, you're limited to one per week.  But when you can't even get enough key fragments to open that one chest per week it makes the system feel really clunky and really bad.\n\nThat said, I do think they increased the drop rate recently because I've been getting more key fragments as of late (maybe its because I've been playing more ranked, key drop rate seems to be higher there.)","replies":[{"poster":"BLACK REALM GOD","date":"2016-09-14T10:39:30.385+0000","up_votes":1,"down_votes":0,"body":"you can farm chests, but riot knew that and put a time limiter on it. i think it's 200 per year-ish\n\nkeys however you literally CAN farm but as you farm you get punished for farming. there's a reason for that.\n\nchests are 125 rp and keys are 125 rp. buy them together and it's 195. now... what's the price of a mystery skin?","replies":[{"poster":"Randomonium","date":"2016-09-14T10:50:30.238+0000","up_votes":1,"down_votes":0,"body":"That's not farming chests, that's buying chests and farming keys.  Farming implies grinding time in game to get a reward.  Your farming on chests is limited to one per week by getting an S on a champion.\n\nThis whole discussion is talking about how it is easier to get an S on a champion one per week than it is to get 3 key fragments per week.  It has nothing to do with purchasing keys or fragments.  All I am asking is that players should be able to get 12 key fragments per month to match the 4 chest they can earn per month.  Right now it seems near impossible to get 11 key fragments per month let alone 12 because the drop rates become so low.","replies":[{"poster":"BLACK REALM GOD","date":"2016-09-14T11:16:45.703+0000","up_votes":1,"down_votes":0,"body":"you read that wrong. are you sleepy?\n\nthose were three separate points. the first being about why chests are easy to get - which is completely in line with what you're talking about. \n\nthe second about why keys arent easy to get - again exactly what you're talking about. you can get 12 keys per month - if you play a lot. \n\nthe final explaining how it affects riots income. - this ties it all together. which once again is completely in line with the post. \n\n\ni'll ask again - are you sure you're cognitive at the moment?","replies":[]}]}]}]}]}]}