{"poster":"Mr Clevah","date":"2015-08-03T13:06:58.645+0000","title":"Lag solo su League of Legends","subforum":"Aiuto e supporto","up_votes":1,"down_votes":3,"body":"Ho sempre giocato a lol senza problemi di lag, fino ad oggi quando di colpo il ping &egrave; salito di botto fino a 11000. Sono stato disconnesso dalla partita e non avevo modo di riaccedere (nel client rimaneva la scritta &quot;Accesso in corso...&quot; anche per 10 minuti). Vorrei puntualizzare che la mia connessione &egrave; veloce, non ho problemi di lag in nessun altro gioco, solo su lol. Dopo qualche ora ho riprovato ad accedere e dopo lunghi caricamenti sono riuscito a entrare in una partita dove avevo 3000-4000 ping fissi. Non credo che il problema sia la mia connessione. Ho provato a visitare il supporto Riot ma &egrave; tutto inutile. Come posso fare?","replies":[{"poster":"Säbbäth","date":"2015-08-03T21:14:10.001+0000","up_votes":1,"down_votes":0,"body":"Anch'io appartendo al vostro \"club\". Ho i ping che sbalzano durante la partita, tutto è rallentato ed io ho Fastweb che è sempre andato bene. Con altri servizi che necessitano di internet va tutto bene, ma Lol proprio non ne vuole sapere. Sono due giorni che laggo e mi sono presa anche una coda per AFK più un report. Spero risolvano presto.","replies":[]},{"poster":"Mr Clevah","date":"2015-08-03T13:15:11.911+0000","up_votes":1,"down_votes":0,"body":"Sì, ho infostrada, ma ho sempre giocato senza problemi con un ping tra i 40 e i 70. Solo oggi ho iniziato ad avere questo problema. Comunque sembra che io non sia l'unico, sembrerebbe un problema dei server quindi aspetterò che risolvano.","replies":[]},{"poster":"GoDzLan ITA","date":"2015-08-03T13:10:03.683+0000","up_votes":1,"down_votes":0,"body":"se hai infostrada , non sei l'unico che ha 11k ping","replies":[]},{"poster":"Elrond il grande","date":"2015-08-03T13:09:52.212+0000","up_votes":1,"down_votes":0,"body":"anche io ho problemi di lag in questi giorni,, non so come fare perché quando gioco i comandi sono rallentati","replies":[]}]}