{"poster":"Raighar","date":"2016-10-29T08:42:35.001+0000","title":"Vorschlag: Profilbanner manuell austauschen","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":0,"body":"Hallo zusammen,\r\n\r\nich kann mit gut vorstellen, dass mein Vorschlag schon mal angesprochen wurde, habe aber per SuFu leider nichts gefunden.\r\nMeiner Meinung nach sollte es m&ouml;glich sein, das Profilbanner unabh&auml;ngig vom Beschw&ouml;rersymbol austauschen k&ouml;nnen. Ich finde viele der neuen Symbole sehr gut, tausche diese aber nur ungerne, und wenn auch nur kurz aus, da ich gerne mein Profilbanner f&uuml;r Pulsefire Ezreal und DJ Sona anzeigen m&ouml;chte. Man hat das Banner ja im Ultimate Skin quasi mitgekauft, wieso sollte man das dann nicht einfach anzeigen k&ouml;nnen?\r\n\r\nWill mal gerne andere Meinungen dazu h&ouml;ren oder, ob vielleicht schon eine Diskussion dazu besteht.\r\n\r\nViele Gr&uuml;&szlig;e! :)","replies":[{"poster":"DarkRaín","date":"2016-10-29T11:40:14.646+0000","up_votes":1,"down_votes":0,"body":"Im neuen Client ist dein Profilbanner entweder das Splashart von dem Champ den du am meisten gespielt hast oder das animierte Splashart von einem Ultimate Skin wenn du das Icon ausgewählt hast.","replies":[]},{"poster":"Nude Collector","date":"2016-10-29T11:17:26.624+0000","up_votes":1,"down_votes":0,"body":"Find ich gut.","replies":[]},{"poster":"Megamaexx","date":"2016-10-29T10:44:53.595+0000","up_votes":1,"down_votes":0,"body":"Das wurde tatsächlich vor einigen Tagen erst angesprochen, aber die SuFu ist nicht so dolle, deswegen wird man da eher selten was finden, vor allem wenn die Bezeichnungen variieren^^\nDer Client ist eh bald Geschichte, in der Preseason kommt ein neuer =)","replies":[]},{"poster":"Nivoras","date":"2016-10-29T09:33:00.758+0000","up_votes":1,"down_votes":0,"body":"Vielleicht wird das ja in Angriff genommen, wenn die wichtigeren Dinge am neuen Client fertig sind, am Alten wird denke ich mal nichts mehe verändert/verbessert","replies":[]}]}