{"poster":"Arcyyy","date":"2017-10-08T15:31:53.980+0000","title":"The Problem with Ornn is that he's insanely clunky and has no front loaded CC for a tank.","subforum":"Gameplay","up_votes":52,"down_votes":11,"body":"All of his CC is situational and his Q, W, E and R all feel clunky as balls. He&#039;s not fun to play as at all because 90% of the time you feel like you got bullshitted by your abilities having a 1 second cast time with no way to change their directions. You won&#039;t ever be able to buff him into playability until these things are fixed, and he&#039;d probably have to be nerfed to be honest if you fixed his clunky ass. \r\n\r\nAlso the fact that he has no way to peel for his team at all if they dive him.","replies":[{"poster":"Marshbouy","date":"2017-10-08T15:48:41.672+0000","up_votes":27,"down_votes":1,"body":"This. \nHe's a great counter engage champ. If you get like a braum or malphite to engage and follow it up with an ornn R it might be pretty good, but he's just so goddamn clunky it's terrible","replies":[{"poster":"Ben Sharpio","date":"2017-10-08T20:04:51.578+0000","up_votes":16,"down_votes":1,"body":"> If you get like a braum or malphite to engage\n\nlmao. Getting someone else on your team to play a tank is a challenge on its own. \n\nEven in high plat, i find myself being the only tank. Whether it be Ornn or Sion i'm playing and everyone expects you to peel for mid/top AND engage properly. The amount of people that just straight up don't care about helping someone else tank is what makes Ornn so shit in solo queue. \n\nAlso, if riot plans to buff him they should remove the weird E animation stun thing (if your E doesnt connect with a wall). Or keep his current W and buff his Q or E. Why does Ornn have so much power located in his W?  I have around 40 games with him in plat 2 elo, 30 percent winrate. And he just seems so fucking weird to play. And i always question where the \"skill curve\" there is in his kit that makes him so ridiculously hard to play? His kit is actually basic and easy to use. It's just shit all around imo.\n\nI actually think my winrate will stabilize with him at some point, but like... I've never had so much trouble playing a tank in my entire time playing league\n\nI mean, i'm someone who has taken the chance of playing RELEASE ORNN all the way up until now in RANKED games and i can't say there's a point in time where i felt truly satisfied with his kit.\n\nThey buffed his mana costs. Why? Ornn's laning phase was actually already good. The problem with Ornn is that he is too difficult to use outside of the laning phase. So riot actually didnt achieve much with his mana costs buff because his core problems exist outside of the laning phase.\n\nAlso, his random AP and AD scalings? Where is the consistency in his kit? what the fuck do you build on him? \n \nThere aren't really so many items that feel good on him either. I guess abyssal mask feels good. But w/e that's my thoughts on him so far. ","replies":[{"poster":"trash sion","date":"2017-10-09T06:59:37.629+0000","up_votes":6,"down_votes":1,"body":"I played a bit of Ornn as well, already gave up. (Context - Sion main so I love telegraphed tanks)\n\nThe problem with Ornn is that he has no combos and therefore cannot make plays happen.\n\nLet's say you want to trade in lane. Q for the slow, W them, and then.... What now? The only way you get to use your E is if your enemy walks to the side of the lane next to a wall, because god knows they won't still be standing on your Q when it pops up.\n\nOrnn's issue is that he can never make plays happen, he has to wait for the enemy laner to make plays on themselves. There is no skill expression for Ornn, you just have to wait for your enemy to display a lack of skill and allow you to go in. If your enemy just stands in the middle of the lane and moves a few steps to the side any time you Q, congrats. You have no combo and no way to trade.\n\nWith a tank like Sion, you can take initiative, land E, and use that to do an easier combo. You're rewarded for hitting a difficult skillshot with making the rest of your kit easier to hit. Ornn is rewarded by hitting his Q with... nothing. Because he doesn't get to hit his Q. His enemy gets to decide if he hits it by choosing to stand in front of it or not. \n\nA champion's power should not be gated by the enemy ALLOWING them to use their kit.","replies":[]}]}]},{"poster":"RiotRepertoir","date":"2017-10-09T00:01:46.916+0000","up_votes":24,"down_votes":1,"body":"I believe one of the things coming into the next patch is removing the cast time on his R2. The thinking in making the change was basically that the skill test should be in lining up the shot without the need for the additional self-imposed timing limitation on Ornn's end, especially when the need to redirect the R is frequently amidst the chaos of a teamfight. We'll be seeing how he's doing after this","replies":[{"poster":"Sire Hippington","date":"2017-10-09T00:31:50.019+0000","up_votes":23,"down_votes":2,"body":"I don't think that will solve anything.\nLineing up the second ult is really not an issue, unless you get CCed duering the required window, in which case no cast-time wouldn't do anything anyway.\n\nActually, his ult is fine and by far the most funktional and awsome part of his kit. The bigger issue is more that his basekit feels very meh, he feels really squishy for beeing rather immobile and unreliabe, and the payoff for landing his shit isn't even that massive. \nAnd his passive also is kinda problematic atm. It accounts for his overall power, yet in most games it has no impact whatsoever as you rarly get even to 6 items. But at the same time, simnply makeing his unique upgrades relevant enough to be bought early might break him aswell, so overall it's a really though to balance mechanic, especially with how few games actually go to 6 items. theses days.","replies":[{"poster":"TotalJerk","date":"2017-10-09T00:56:07.232+0000","up_votes":3,"down_votes":1,"body":"No, his ult isn't fine. The window to hit it is so small combined with the high cast times of his spells that casting any other spells locks him out. Whenever he Casts R1, he has to sit around doing nothing until he hits the R2.","replies":[{"poster":"MonkeyMadness","date":"2017-10-09T06:33:39.393+0000","up_votes":4,"down_votes":0,"body":"I disagree. This is a good payoff. His R2 is very powerful, granting a massive range aoe knock up and applying the brittle debuff which grants additional damage/cc on multiple targets (if used properly). The ability to stop him mid ult requires that someone actually waste time and crowd control on a tank that is otherwise (as you say) \"doing nothing\".","replies":[]}]}]},{"poster":"Iota Theta","date":"2017-10-09T01:52:36.535+0000","up_votes":5,"down_votes":0,"body":"Have you thought of a zoom out for his ult as a possible change, as at the moment if you want to use it at range you can only either look at the target for the aiming or yourself for the timing?\n\nMy other question is why 20% max hp on W? More damage is the last thing he needs, and that amount seems like a bit much on his most spammable and overloaded ability with an additional 16% on brittle proc..","replies":[{"poster":"RiotRepertoir","date":"2017-10-09T02:27:25.038+0000","up_votes":9,"down_votes":0,"body":"We did test out a zoom out on the R, but didn't pull the trigger on it due to some general disagreement internally around whether that was the correct solution to solve some usability issues.\n\nI didn't run the Ornn changes for the coming patch, so I won't be the best source for why 20% was deemed to be the appropriate number, sorry.","replies":[{"poster":"Quepha","date":"2017-10-09T06:51:21.612+0000","up_votes":2,"down_votes":0,"body":"It also seems like Ornn would be a really dangerous champion to put base damage on, since if he becomes a half-decent duelist then any game where he gets a slight lead should be an absolute nightmare for his opponent as he builds items in lane to further snowball his lead.","replies":[]},{"poster":"Iota Theta","date":"2017-10-09T02:53:56.817+0000","up_votes":2,"down_votes":0,"body":"Glad to hear it was something you tested. I knew, at least for me, it was a struggle sometimes trying to keep track of one or the other with no vision, especially when I was in a jungle area, which was a main reason for suggesting it. \n\nWell I appreciate the response either way. I know myself and a few others on the Ornn subreddit have this ominous feeling that 20% would end up breaking him and leading to an Ivern situation or one similar that leads to him getting taken out at the knees due to his sudden power increase. Those that were ok with the change to %max HP from %current HP damage were more hoping for a lower damage buff, just more consistent throughout the fight. My stance was that %current fit him better as a tank than %max hp for W, but I was willing to accept a redistribution.\n\nMy main argument is that more damage is the last thing Ornn needs in his buffs, as he can already farm and trade well enough, but Brittle should be his focus. One discussion I had with a poster on one of my threads here led to them suggesting reducing duration (I though reduced damage could be a good alternative too) in exchange for Brittle to be applied to enemies in other ways, like the initial charge on E, especially if you don’t hit terrain since it does absolutely nothing then.","replies":[{"poster":"Infernape","date":"2017-10-09T03:04:19.380+0000","up_votes":2,"down_votes":0,"body":"To be fair though his W isn't straight up front loaded damage say like Fiora's passive. It's a DoT ability. The chances are people aren't going to be taking the entire duration of his W unless they're already CC'ed. \n\nI personally think that Ornn just needs to be less clunky and at least one of his abilities should be somewhat reliable.\n\nbut my god, his ult is so fun to use. Especially when you land a 5 man ult.","replies":[]}]},{"poster":"Latex Choker","date":"2017-10-10T06:21:13.806+0000","up_votes":1,"down_votes":0,"body":"I remember that zoom out, it was helpful for those long range initiations, but felt awful in all other situations, glad to see you guys pulled it for now.\n\nRemoving the cast time on R2 is a great change, and should do a lot to help those times where you HAVE to be casting spells while waiting for the ram to return. Only other change I could think of for Ornn's usability is reducing the self CC duration of his E when he collides with terrain, as trying to use it to break free from things like anivia wall and J4 ult is often pointless since Eing takes almost a full second to complete anyway.\n\nAll in all I'm super happy to see you guys are dedicated to getting Ornn into not only a balanced spot, but one where he feels satisfying and rewarding to play, rather than just blindly buffing his numbers until he turns into an oppressive lane bully.","replies":[]}]}]},{"poster":"DeadUnborn","date":"2017-10-09T00:08:33.033+0000","up_votes":1,"down_votes":0,"body":"I have no idea what that would look like. If the no cast time on animation looks clunky/not enough powerful maybe making Ornn unstoppable while casting might work. I can see it being a problem if he uses R2 to dodge CC though","replies":[{"poster":"Hello I am Bird","date":"2017-10-09T04:00:42.233+0000","up_votes":3,"down_votes":0,"body":"Can't he... Already use an ability to dodge cc or am I crazy?\nI don't think a tank dodging cc is too terrible.","replies":[{"poster":"DeadUnborn","date":"2017-10-09T04:04:34.346+0000","up_votes":2,"down_votes":0,"body":"Yea with the W, however having 2 abilities on his kit do that might be overbearing... dunno","replies":[{"poster":"Hello I am Bird","date":"2017-10-09T06:00:12.731+0000","up_votes":4,"down_votes":0,"body":"Seems like since he already has an ability that can block cc, he would have no reason to waste his ULT to block cc","replies":[]}]}]}]},{"poster":"commit an hero","date":"2017-10-09T02:00:35.063+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=AxJrWqTV,comment-id=000e,timestamp=2017-10-09T00:01:46.916+0000)\n>\n> I believe one of the things coming into the next patch is removing the cast time on his R2. The thinking in making the change was basically that the skill test should be in lining up the shot without the need for the additional self-imposed timing limitation on Ornn&#x27;s end, especially when the need to redirect the R is frequently amidst the chaos of a teamfight. We&#x27;ll be seeing how he&#x27;s doing after this\n\nWhy not allow him to use his R2 while using his other abilities? The problem is that you are essentially locked out of using your other abilities which results is you just awkwardly sitting there.","replies":[]},{"poster":"Skias","date":"2017-10-09T01:22:43.495+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=AxJrWqTV,comment-id=000e,timestamp=2017-10-09T00:01:46.916+0000)\n>\n> I believe one of the things coming into the next patch is removing the cast time on his R2. The thinking in making the change was basically that the skill test should be in lining up the shot without the need for the additional self-imposed timing limitation on Ornn&#x27;s end, especially when the need to redirect the R is frequently amidst the chaos of a teamfight. We&#x27;ll be seeing how he&#x27;s doing after this\n\nI don't think he has problems with his R. The rest of his kit feels awful and un-synergistic.","replies":[]},{"poster":"DaveedIsPissed","date":"2018-06-10T01:54:10.146+0000","up_votes":1,"down_votes":0,"body":"you should make it so yasuo's wall cant block ornn's r or else if they have ONE YASUO ON THEIR DAM TEAM\nornn is dead meat and his r will do literally nothing ever, its ok if braum is able to block it since it still applies effects to him but yasuo wind wall blocking ornn's ult bad and super easy to block too...","replies":[{"poster":"PhDs Nuts","date":"2018-06-10T05:08:25.012+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DaveedIsPissed,realm=NA,application-id=3ErqAdtq,discussion-id=AxJrWqTV,comment-id=000e000b,timestamp=2018-06-10T01:54:10.146+0000)\n>\n> you should make it so yasuo&#x27;s wall cant block ornn&#x27;s r or else if they have ONE YASUO ON THEIR DAM TEAM\n> ornn is dead meat and his r will do literally nothing ever, its ok if braum is able to block it since it still applies effects to him but yasuo wind wall blocking ornn&#x27;s ult bad and super easy to block too...\n\nDid you google \"Old AF Ornn post\" to reply here or what?","replies":[]}]}]},{"poster":"GorillaBearz","date":"2017-10-08T17:13:06.122+0000","up_votes":9,"down_votes":4,"body":"What about Sion? He’s just as telegraphed and slow?? Yet he’s fun to play definitely viable in solo queue","replies":[{"poster":"JackMcSnipeyz","date":"2017-10-08T19:13:04.000+0000","up_votes":19,"down_votes":1,"body":"Sion has ways to make sure his abilities hit, he has a very simple combo that almost gurantees his main damage spell will hit (Q) E slow into W shield into Q knock up makes you have a very clear combo that is reliable.\n\nOrnn however has huge deleys, cast times, and very lacklaster CC unless they are stupid enough to cluster over his tiny piller, getting hit by his W means you cornered yourself, got knocked up or dont know how his kit works.\n\nHis ult and passive are the only satisfying things about his kit, which is why he is in such a bad state, not many people wants to improve on such a champion","replies":[]},{"poster":"kasfas","date":"2017-10-08T18:03:56.443+0000","up_votes":6,"down_votes":1,"body":"Do you understand how broken sion's abilities need to be in order for him to be viable? His damage is insane if you get it all off, and at the very least he has a fallback plan to use his ult point blank and get the stun. \n\nOrnn lacks a fallback plan for his cc and also lacks gravity in his cc to make it worthwhile. He doesn't even have a cc in his kit that gets extended by his passive, and that is a MASSIVE problem.\n\nOrnn, and to a lesser degree Sion, NEED to get ahead to be useful. Not just to deal damage and carry, but to not be entirely outclassed by the enemy toplaner. That is a massive problem with these champions that is innate in their kits which cannot be solved through number buffs, only through change to their kits. \n\nI don't want Ornn to be like maokai where when even you can still be useful, but he needs to have enough damage to reliably get himself a lead in lane to snowball with. An Ornn that's behind is actually useless.","replies":[]},{"poster":"SpecterVonBaren","date":"2017-10-08T20:53:02.967+0000","up_votes":1,"down_votes":0,"body":"Sion has reliable CC though, his Q can at least slow instantly and so can his E. Sion also has a means of engaging into an enemy team with his ult, Ornn has an engage ult too but he needs someone else to follow up on it because he has no way of getting himself at the enemy himself.","replies":[{"poster":"MorganFreemanBot","date":"2018-06-10T06:41:33.020+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SpecterVonBaren,realm=NA,application-id=3ErqAdtq,discussion-id=AxJrWqTV,comment-id=00020002,timestamp=2017-10-08T20:53:02.967+0000)\n>\n> Sion has reliable CC though, his Q can at least slow instantly and so can his E. Sion also has a means of engaging into an enemy team with his ult, Ornn has an engage ult too but he needs someone else to follow up on it because he has no way of getting himself at the enemy himself.\n\nForgive me, I'm retarded. This is almost a year old post.","replies":[]}]}]},{"poster":"Kerrigan 4 Prez","date":"2017-10-08T21:59:15.845+0000","up_votes":13,"down_votes":2,"body":"Q:  Scales with AD\nW: Scales with health(the shield)\nE:  Scales with resistances\nR: Scales with AP\n\nRito pls","replies":[{"poster":"IGotScuttleCrabs","date":"2017-10-09T00:14:29.211+0000","up_votes":3,"down_votes":0,"body":"That’s my biggest beef with him. Ok I get it, they want him to build tank. But seriously, would it be so bad to focus his scaling on only 2 types rather than 4??? That’s insane. I typically like my toplane tanks with RoA. Not over the top amount of AP or defenses but just enough to help you survive early and provide some damage which Ornn and his delayed non-reliable cc could seriously use. Or even if steraks, black cleaver, or titanic where better options would be nice.","replies":[]}]},{"poster":"Academy Kayn","date":"2017-10-08T19:19:31.394+0000","up_votes":5,"down_votes":1,"body":"I still think people use the term \"Clunky\" wrong.","replies":[{"poster":"The Yetii Rider","date":"2017-10-08T21:30:19.769+0000","up_votes":10,"down_votes":1,"body":"I agree, but having played Orrn, i can assert that \"clunky\" is the DEFINITION of his W. Pressing W cancels Orrn's previous walking commands, so you come to a stop, then you need to start moving again. The auto attack animation for breaking a Brittle target seems like it has a longer wind up and it LOOKS really awkward. It definitely also feels like the W is turning off faster than it should. I don't know, it doesn't feel like I'm spitting fire for 2.5 seconds, ever.","replies":[{"poster":"Latex Choker","date":"2017-10-10T06:25:39.525+0000","up_votes":1,"down_votes":0,"body":"Ornn's W tooltip is just awkwardly written, he shields himself for 2.5s, but only breathes fire for 0.75s","replies":[{"poster":"The Yetii Rider","date":"2017-10-10T14:08:19.251+0000","up_votes":1,"down_votes":0,"body":"OOoooooh, that makes so much more sense.","replies":[]}]}]}]},{"poster":"Sire Hippington","date":"2017-10-08T19:08:02.422+0000","up_votes":8,"down_votes":0,"body":"To be honest, i don't think his ult is clunky, it's actually pretty awsome.\nHowever, without ult(which happens alot due to the long cd), he simnply sucks because it's sooo easy to run in circles aorund him while he can't land any of his shit, and even if he does, the impact exept from a full W is not really impressive and he's not even all that tanky aswell.","replies":[]},{"poster":"RainbowIcee","date":"2017-10-09T02:15:21.328+0000","up_votes":4,"down_votes":1,"body":"If nothing else, can we make it so {{champion:157}}  windwall doesn't delete the ult ? yes if you didn't know Yasuo's windwall deletes the goat ult.\n\n","replies":[{"poster":"LordGeovanni","date":"2017-10-09T05:28:37.228+0000","up_votes":6,"down_votes":0,"body":"Yasou's windwall should be balanced like braums E and only block projectiles from one side or his passive need to completely go away.","replies":[{"poster":"RainbowIcee","date":"2017-10-10T02:24:18.638+0000","up_votes":1,"down_votes":0,"body":"i feel his windwall is a bad mechanic to play against period. I wouldn't call it OP but it irks me it stops all the things it does stop some of which make no sense. ","replies":[{"poster":"LordGeovanni","date":"2017-10-10T08:54:16.751+0000","up_votes":1,"down_votes":0,"body":"I feel that his windwall is the defining spell of his kit more than his q tornado or his ult. but since i feel that is the defining part of his kit i think that all the other stuff he has makes him overloaded and definitely op he doesnt need 2 defensive sheild mobility for offense and defense  and hard cc and all that damage.\nHe can keep the double crit but lose the armor pen armor is already in a bad state and crit beats armor already by amplifying what would be normal damage. he can keep the the hard cc since its to activate his ultimate. but he needs to have his E gated even more either  an actual cooldown with none on the minions or something else. and he needs to lose one of his sheilds I dont think he should lose his w but it should only block from 1 direction just like braums E and he should lose his win every trade sheild and rely on dorans blade like everyone else  for inlane saftey not that a sheild and the rest of his kit or they need to nerf the build up of the sheild so its almost 1.5 minutes -2 minutes of running around to build up so that he has to develop the play pattern of going in when his sheild is comming up else it just gets broken.\nRiot needs to stop nerfing his numbers then buffing it right back when they dumpster him  while yorick got to sit in the dumpster for years got reworked and is still in the dumpster because they reworked him for  a strategy they made unviable Split pushing. sure he wont die in fights if you build as a tank but he wont have any impact either maybe through the adc or a mage just like every other 'support' in the game","replies":[]}]}]}]},{"poster":"ZT Xperimentor","date":"2017-10-09T01:44:33.212+0000","up_votes":4,"down_votes":0,"body":"The only one that bugs me, is his breath; with all the mobility creep, it's so easy to be walked around since it's barely beyond melee range.","replies":[]},{"poster":"Yaskamasandwich","date":"2017-10-08T21:11:49.641+0000","up_votes":4,"down_votes":0,"body":"Never thought Riot would release a champion more clunky and delayed than Sion. Ornn is however, Riot made him way to clunky. I'm surprised he can't place his Q where he wants to. It is placed only at the furthest points. This is useless when a melee is on top of Ornn and he has no way to retaliate. That's what makes Sion get ahead. Sion has a good shield W and can point blank shout E with a slow and armor pen. So Sion can react to someone on his face. Ornn loses when someone gets on top of him which is ironic for a tanky champion.\n\nHowever Riot did it this way because of his passives. All of Ornn's power is put into his item passive and brittle passive. This makes him feel less like a champion and more of a passive bot, basically a glorified shop. He's only there to give his ADC a better IE, his mage a better Deathcap, and attempt to apply brittle from his two unreliable and very telegraphed moves. He suffers from his passives more so than helping him.","replies":[]},{"poster":"The Yetii Rider","date":"2017-10-08T17:41:36.033+0000","up_votes":3,"down_votes":5,"body":"Not fun to play? Speak for yourself. Smashing someone with that ultimate is the most skill expression I've ever felt on a tank. It's so satisfying.","replies":[{"poster":"Ben Sharpio","date":"2017-10-08T20:10:21.590+0000","up_votes":5,"down_votes":1,"body":"He's not fun to play in a **competitive game**.  Being outclassed THIS BADLY is horrible for player experience. You have to work REALLY hard to make use of his kit, whereas other braindead tanks do his job much more effectively. Basically, it comes down to \"why pick Ornn when you can play X\"\n\nHe is so far down in his class and it's a huge problem.","replies":[{"poster":"The Yetii Rider","date":"2017-10-08T20:49:18.420+0000","up_votes":1,"down_votes":0,"body":"We have plenty of noob-stomping champions in the game who are practically useless at high elo. Garen, Master Yi, Sona. ","replies":[{"poster":"Ben Sharpio","date":"2017-10-08T20:57:15.146+0000","up_votes":2,"down_votes":6,"body":"so can we stop balancing around low elo? I dont understand?","replies":[{"poster":"The Yetii Rider","date":"2017-10-08T21:26:36.607+0000","up_votes":5,"down_votes":2,"body":"Why the fuck would you do that? Over 80% of the population, MILLIONS and TENS OF MILLIONS of players are Silver and Bronze and Unranked.","replies":[{"poster":"Hello I am Bird","date":"2017-10-09T04:15:43.661+0000","up_votes":3,"down_votes":1,"body":"Because balancing around High elo makes much more sense.\nBalancing around high elo means accounting for skill ceilings while balancing around low elo accounts for skill floors.\nYou can always get better at the game, but if the game just lets you not get better at your champion and they start becoming useless because *you* hit a brick wall with your champion, that sounds a lot less satisfying than being able to learn your champion up to Diamond/Master.","replies":[]}]}]}]}]}]},{"poster":"LuxandtheMachine","date":"2017-10-08T22:21:17.521+0000","up_votes":1,"down_votes":3,"body":"Ornn was intentionally made to be clunky and have poor scaling, he gives his full team the option to upgrade items that the other team does not have access to, and while most of ornns teammates rush upgrades (for the sake of their novelty) before they complete their core build, this is already a global advantage ornn brings to the table for his team, combine that with the fact ornn can forge whatever he wants on the fly and it's only fair to make him a very clunky champ with horrible scaling. Riot intentionally made his kit handicapped due to the unfair and unprecedented passive he wields.","replies":[{"poster":"LordGeovanni","date":"2017-10-08T23:43:57.445+0000","up_votes":3,"down_votes":0,"body":"you can either be clunky or have poor scaling not both you cant punish a champion for the kit you give them.","replies":[]}]},{"poster":"xelaker","date":"2017-10-08T22:02:53.289+0000","up_votes":2,"down_votes":1,"body":"H does feel clunky, but to be honest I'd rather hard hard cc like knockups have a downside","replies":[{"poster":"LordGeovanni","date":"2017-10-09T00:58:02.539+0000","up_votes":1,"down_votes":0,"body":"what about the long wind up time and even longer cooldown or the no damage on it condition of needing terrain?","replies":[{"poster":"ZT Xperimentor","date":"2017-10-09T01:47:16.544+0000","up_votes":1,"down_votes":0,"body":"He's referring to other champions that can easily apply popups.","replies":[]}]}]}]}