{"poster":"Laphícet","date":"2016-12-23T17:49:48.458+0000","title":"Allgemeiner Chat über Ss, ward und Pingen","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":2,"body":"also Viele heulen &acute;&acute;sry wenn ich das hier schreibe`` rum Look on Map, buy a ward. ich meine man macht es ja jedenfalls ich \r\naber ganz ehrlich ich finde die Leute die kein SS oder sogar von riot gemachtes Gegner Fehlen Alarm Ping zu benutzen fehlt es von anderen am Teamplay so sehe ich das, oder wozu hat riot es sonst im spiel eingef&uuml;hrt? z.b man k&auml;mpft intensiv auf der Botlane ka ashe und annie vs lux und Miss fortune oder so, man hat wards aber man kann keine 100 aufstellen, und aufeinmal kommt von der mitte ein kassadin zed oder Zac oder in der art, und der der in der mitte ist und einfach nur farmen will oder rumdance und frech sagt tja schau auf der karte oder kauf mehr wards, den fehlt es an Mangel an teamspiel und sollte resident evil 4 spielen oder so, \r\n\r\nIch frage mal den Support an ob man eine Karte erstellen kann wo leute 1 vs 1 machen k&ouml;nnen ^^","replies":[{"poster":"Supportsmanlike","date":"2016-12-23T20:47:23.055+0000","up_votes":1,"down_votes":0,"body":"Wenn du nicht darauf achten kannst, ob die Midlane fehlt, oder gerade auf die Botlane gelaufen kommt, wirst du auch nicht darauf achten können, ob dein Midlaner SS gepingt hat.","replies":[]},{"poster":"Sihari","date":"2016-12-23T20:44:13.509+0000","up_votes":1,"down_votes":0,"body":"Die Sache ist die: es ist nett wenn jemand SS-pingt und es zeugt von einem guten Teamgeist, aber es ist kein Muss und niemand sollte dafür schlecht gemacht werden wenn er nicht pingt.\nAuch sollte man sich selbst in einem Teamspiel nur auf sich selbst verlassen, wenn man nicht gerade professionell in einem eingespielten Team unterwegs ist!","replies":[]},{"poster":"Laphícet","date":"2016-12-23T18:48:52.578+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Nycaria","date":"2016-12-23T18:53:05.572+0000","up_votes":1,"down_votes":0,"body":"Niemand hat behauptet, dass du als ADC einen Sightstone kaufen sollst oder für die Main-Vision verantwortlich bist. Benutz dein Trinket und kauf dir ab und zu einen Controllward und dein Supporter wird sich freuen.\n\nAllerdings bringt es einen auch als ADC nicht um hin und wieder auf die Map zu schauen.","replies":[]}]},{"poster":"Nycaria","date":"2016-12-23T18:39:42.639+0000","up_votes":1,"down_votes":0,"body":"Ich finde Maxim hat  [hier](https://www.youtube.com/watch?v=2CMQfLm7PeA&list=PLcRwqrhsTZgCntIwpp6EAwbcFDwHrwTpJ&index=31) den Punkt mit dem SS pingen ganz gut erklärt.\n\nMeine eigene Meinung dazu ist : Ich brauche diese Pings nicht. Gepingt wird es von mir zwar, wenn Gegner weg sind, allerdings bin ich selbst nicht darauf angewiesen einen SS Ping von meinem Midlaner zu haben. Die Zeit die man braucht um in den Chat zu schauen, von dem den der SS-Ping kam, kann man auch darauf verwenden auf die Minimap zu schauen um selbst zu sehen auf welche Gegner man Vision hat.","replies":[]},{"poster":"Supportsmanlike","date":"2016-12-23T17:57:16.067+0000","up_votes":1,"down_votes":0,"body":"Wenn du willst, dass dein Midlaner dir immer sagt, wann sein gegenüber die Lane verlässt dann such dir ein 5er Team. Für gewöhnlich sollte ein Blick auf die Minimap vor einem Fight ja nicht zuviel verlangt sein. Wenn du dann siehst, dass der Midlaner gerade fehlt, ist es für gewöhnlich eher eine schlechte Idee einen Kamp zu starten. Wenn du gerade gesehen hast, wie der gegnerische Jungler seinen Bluebuff macht wirst du ja wahrscheinlich auch erst mal Vorsichtig spielen.","replies":[]},{"poster":"Laphícet","date":"2016-12-23T19:01:07.107+0000","up_votes":1,"down_votes":3,"body":"wenn man oben den Text lesen kann sagte ich ja das ich ja schon drauf schaue aber wenn man in ein Spellfight verwickelt ist kann man nicht jedenfalls ich nicht  mehrzeitig alles gleich machen da wäre der Ping den Riot extra entwickelt hat zu benutzen. finds witzig das ihr einfach Typisch deutsch seid xD nicht bös gemeint.\n\nich mache das ja auch aber trotzdem wäre das mal gut für das Teamplay wozu sonst spielt man ein online spiel wenn man alleine was machen will online soll man Aion oder wow spielen der ist in lol nicht richtig wer kein ss pingen kann oder so obwohl es den Skin Nunu Bot es auch einfach erklärt https://youtu.be/5eIZ7TRcbdM?t=1m2s {{champion:20}} ","replies":[{"poster":"Nycaria","date":"2016-12-24T08:21:41.482+0000","up_votes":1,"down_votes":0,"body":"> wenn man oben den Text lesen kann sagte ich ja das ich ja schon drauf schaue aber wenn man in ein Spellfight verwickelt ist kann man nicht jedenfalls ich nicht mehrzeitig alles gleich machen da wäre der Ping den Riot extra entwickelt hat zu benutzen. finds witzig das ihr einfach Typisch deutsch seid xD nicht bös gemeint\n\nWenn du am fighten bist schaust du also eher in den Chat als auf die Minimap? Sorry aber deine Aussage ergibt so keinen Sinn. \nUnd zu dem Punkt mit dem typisch deutsch: Du wolltest eine Diskussion darüber, aber akzeptierst scheinbar keine andere Meinungen über das Thema :)","replies":[]}]},{"poster":"Laphícet","date":"2016-12-23T21:31:14.426+0000","up_votes":1,"down_votes":1,"body":"wie gesagt wer lesen kann, liest dass ich das kann. Ich habe es für alle in den allgemeinheit geschrieben und wenn du das nicht verstehst dann ka.\nund ausserdem Sagt halt misses an, das is konstrutive Krittik \nwer es immer wieder auf mich beziehen will mit wenn du oder ähnliches dann geht aus dem chat bitte weg sowas mag ich nicht im chat es war ja nur fragen die ich mal so stellen wollte. ","replies":[]}]}