{"poster":"PCG Skip","date":"2016-10-20T15:16:07.482+0000","title":"Item-sets im Alpha Clienten! notwendig oder sinnlos?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Hallo liebe Community,\n\nmein Ziel ist es, herauszufinden was die Spieler wirklich von den Item-sets denken. Wie von Riot bekannt gegeben wurde, wird es diese Funktion im neuen Client nicht mehr geben. Da ich selbst mit den Sets spiele und es f&uuml;r mich ein Komfort ist, den ich nicht missen m&ouml;chte, will ich nun eure Meinung wissen.\nBenutzt Ihr diese Funktion &uuml;berhaupt?\nDazu w&uuml;rde Ich hier gerne eine Umfrage machen. \n\nPS: vielleicht k&ouml;nnen wir die Entwicklung des Clienten ja ein wenig beeinflussen","replies":[{"poster":"Zanlan","date":"2016-10-20T15:33:51.895+0000","up_votes":2,"down_votes":0,"body":"Ich möchte die Sets nicht mehr missen","replies":[]},{"poster":"Sroem","date":"2016-10-20T15:23:20.105+0000","up_votes":2,"down_votes":0,"body":"Ich nutze die Sets auch sehr gerne, vor allem wenn ich einen neuen Champion nutze. Es wäre definitiv nicht schlecht die Funktion beizubehalten aber ich kann auch verstehen das wenn es nur 10% der Spieler nutzen es keinen Sinn macht.","replies":[{"poster":"PCG Skip","date":"2016-10-20T15:30:21.962+0000","up_votes":1,"down_votes":0,"body":"eben das möchte ich hier genau wissen {{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"FuaVentura","date":"2016-12-07T02:54:55.015+0000","up_votes":1,"down_votes":0,"body":"Ist auch gut für Anfänger, die dann in Ruhe Items sich angucken können. Ich glaub die haben es eh schwer genug.\nNahja und ich finde das gehört dazu sich items sets zusammen bauen zu können, genauso wie seine runen und meisterschaften.\nVll wurde die Funktion nicht genutzt, weil sie ja ich sags mal jetzt , kompliziert war und nicht schnell zu kappieren war.","replies":[]},{"poster":"Megamaexx","date":"2016-10-20T15:31:01.084+0000","up_votes":1,"down_votes":0,"body":"Ich schaue mir da maximal die Items an, wenn ich was nachlesen will","replies":[{"poster":"PCG Skip","date":"2016-10-20T15:32:30.952+0000","up_votes":1,"down_votes":0,"body":"na das is doch auch schonmal was >_<","replies":[]}]}]}