{"poster":"Yeoreum","date":"2018-04-12T16:50:02.842+0000","title":"Banned after recovery ended up to perma ban","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"My friend hacked my account by saving my information down and then i recovered it back after realising he hacked it. Riot gets it back for me and I play games like a normal person, Riot out of nowhere gives me a suspension for irregular activity. I explain to them what happened and sudden change of IP . Did they expect me to play at my friends house or something ?? And then later they send me an email telling me to verify the account on the original account my friend hacked, me and friend decide to talk and he gives up and iget it back but riot gives me the perma suspension for compromised activity. I find it stupid that they thought I would have the same IP as my friend and gave me a suspension for irregular activity. I find it stupid why wouldn&rsquo;t they just give the account back do they think they gonna get hacked or something","replies":[{"poster":"Ninox","date":"2018-04-13T02:06:51.011+0000","up_votes":1,"down_votes":0,"body":"Sounds like it was a security ban to me (a ban issued to prevent any further activity on the account until the original owner can recover it). If I'm understanding correctly, your account was stolen, recovered through Riot, then later security banned and when you submitted a ticket they asked you to recover the account again?\n\nIt wouldn't have been just IP addresses that triggered such a thing. Frankly yes, they think that your account is vulnerable, since it has been in the past and they have no reason to believe it isn't now. If the account was banned for irregular activity it means it wasn't fully secured when you last did the recovery. I'd recommend changing the passwords to any emails associated with the account as well and then going through the account recovery process once again.","replies":[{"poster":"Yeoreum","date":"2018-04-13T04:57:44.030+0000","up_votes":1,"down_votes":0,"body":"They said my account is now permantely banned and yes you are understanding correctly. After I got it recovered I changed the email and cleared it up with them but I still got banned","replies":[{"poster":"Ninox","date":"2018-04-13T14:11:37.525+0000","up_votes":1,"down_votes":0,"body":"Assuming there isn't more to the story, it could have been a misban (an agent who didn't realise it had been cleared up so security banned it) or it could be there is still suspicious activity on the account and so it was security banned again. Either way, an account recovery ticket through support should get it cleared up.","replies":[{"poster":"Yeoreum","date":"2018-04-13T14:42:45.556+0000","up_votes":1,"down_votes":0,"body":"Is it still possible to get the account back if they say its been permanently suspended and its final ?","replies":[{"poster":"Ninox","date":"2018-04-14T02:52:57.168+0000","up_votes":1,"down_votes":0,"body":"If it's a security ban or a ban for actions made under compromise (assuming this isn't like the 7th time it's been compromised or something) then yes. That said, if it's a friend doing to compromising, often it comes under the account sharing umbrella (obviously not intentional, but Riot can't exactly determine that) and will remain banned. That said again though, they already unbanned it once, so I don't see why they wouldn't be able to again.\n\nIf you have trouble you can post the support tickets here (remove any identifying info) and I might be able to help a bit more (more context the better an all that).","replies":[{"poster":"Yeoreum","date":"2018-04-14T04:39:07.524+0000","up_votes":1,"down_votes":0,"body":"This is the first time its been compromised, at first it was a security ban and now its a perma ban\n\nMy friend was able to recover the account first by just giving the original email to them(Its still perma banned just saying how it recovered first). Wtf is riot support doing ?","replies":[{"poster":"Ninox","date":"2018-04-14T08:52:40.439+0000","up_votes":1,"down_votes":0,"body":"Your friend wouldn't have been able to do an account recovery with just the original email (they ask you a whole long list of questions), so I'm not sure what he did through support but an account recovery wasn't it..\n\nHave you submitted a ticket to player support yourself?","replies":[{"poster":"Yeoreum","date":"2018-04-15T17:28:11.840+0000","up_votes":1,"down_votes":0,"body":"This is what I got back.\n\nAs you were previously informed, the account was permanently suspended due to the extent it was compromised.\n\nI'm afraid that the security of your account is your responsibility as no one else can or will take care of the account the same way that you would. You should know that accounts that have been compromised frequently pose a risk for other players, and we must do our best to minimize that risk.\n\nI am sorry, but we will not be reversing this decision. If you wish to create another account, please make sure to check out these security tips in order to avoid situations like this in the fut","replies":[]},{"poster":"Yeoreum","date":"2018-04-14T12:46:19.176+0000","up_votes":1,"down_votes":0,"body":"I looked at the support ticket myself and he just recovered it with the original email.\n\nIm currently waiting for a reply by Riot.","replies":[]}]}]}]}]}]}]}]}]}