{"poster":"Thesouker","date":"2017-02-02T17:40:50.512+0000","title":"Bug en Ivern","subforum":"Problemas Técnicos","up_votes":4,"down_votes":0,"body":"Buenas, a todos los usuarios de este foro. Me dirijo con una observacion que note sobre ivern en una partida.\r\n\r\nSe trata de su ulti, la cual al invocar queda haciendo una &quot;caminata&quot; media extra&ntilde;a, es como si estuviera lag pero no. La torre le pegan fura de rango y no fui el unico que observo eso, sino, los demas invocadores a quienes les dije que observaran. No pude grabar no tenia memoria en el celular y no tengo programas en el PC... Me gustar&igrave;a que le puedan hechar un vistazo a este campeon.\r\n\r\nSaludos a todos!","replies":[{"poster":"Nuke","date":"2017-02-02T17:51:36.811+0000","up_votes":2,"down_votes":0,"body":"Hola, yo solo pasaba por aqui y deje un pequeño rastro de arena {{champion:268}}","replies":[]},{"poster":"EdxxEdxx","date":"2017-02-02T18:17:43.438+0000","up_votes":1,"down_votes":0,"body":"XDDDDDD Men llegas muy tarde para esto. Ivern tiene esos bugs desde que salió, mejor dicho, daisy los tiene. Cada tanto (diría que frecuente es), luego de matar a alguien con ella, o de summonear la pasiva de los básicos, empieza a teletransportarse sin sentido, en vez de caminar hace la animación de que está golpeando al aire, mientras se desplaza mejor que michael jackson. No es nuevo, los de rito lo saben hace rato ya, lo que pasa que es como tibbers, son IA's complicadas, es una mecánica que le falta muchísimo por pulir pero que es bestial. No ragees, si usas a ivern más te vale aceptar el contrato que dice que daizi como le digo yo, te va a trollear en los peores momentos existentes, cuando vos y tu enemigo estén a 1 de hp, y le spamees 45 veces que daizi le de UN básico para así matarlo y vos sobrevivir... no, no se lo va a dar, y vas a morir vos D:","replies":[{"poster":"Thesouker","date":"2017-02-02T19:14:37.301+0000","up_votes":1,"down_votes":0,"body":"no debi comprarlo xDDDDDDDDDDD","replies":[{"poster":"EdxxEdxx","date":"2017-02-02T20:22:15.172+0000","up_votes":1,"down_votes":0,"body":"Ohh, tranquilo, y también preparate para las 82 kills que te va a denegar daizi, así es, porque cuando tengas 3 enemigos con 100 de vida, **y uno de ellos tenga la pasiva de daizi**... no, se te va a bugear, y no le va a dar el básico. No los vas a stunear, tu Q no le va a dar a nadie por 0,000000000000000000000001 unidades de distancia, tu E no les va a alcanzar por otras 0,0000001 unidades, y vas a quedarte mirando como se escapan :'D.\n\n-*\"Bienvenido a la familia ethan :d\"*","replies":[]}]}]},{"poster":"Charlôtte","date":"2017-02-02T18:17:03.314+0000","up_votes":1,"down_votes":0,"body":"Está re bugueado, pero al final no termina de afectar mucho en la partida, sólo que el Tibbers de piedra hace teletransportaciones random y golpea como con delay.","replies":[]}]}