{"poster":"Thesouker","date":"2017-09-10T02:59:55.537+0000","title":"Hola, te sientes asi?","subforum":"Off-topic y temas personales","up_votes":6,"down_votes":1,"body":"He analizado mis a&ntilde;os ac&aacute;, en lol... Quiz&aacute;s no muchos, pero los suficientes para ir creciendo en mentalidad de este juego...\r\n\r\nNo ser&eacute; el mejor, ni tan poco el peor. Intento cada cosa, pero este juego dejo de sacar el aburrimiento que ten&iacute;a... &iquest;Rankear? &iquest;Algo serio?, pues no lo veo asi actualmente, digan lo que digan, bronce aprende a jugar bla bla bla... Pero... Cuando dan todo de si, est&aacute;n en un buen nivel y constaaantemente les toca gente que no tiene una cr&iacute;tica de si mismo... Tienen su orgullo tan elevado que evitan leer a los dem&aacute;s aunque esas personas tengan la raz&oacute;n...\r\nEste juego est&aacute; cansando, no lo disfruto, me frustra y creo que hasta es un da&ntilde;o... No le encuentro lo entretenido, mi Nasus, Tryndamere (el personaje con el cual crec&iacute;) y muchos otros dejaron de atraerme a este juego, en especial su comunidad que d&iacute;a a d&iacute;a me decepciona mas con sus rasgos de seres &quot;superiores&quot; y la necesidad de ver en menos y creerse pr&aacute;cticamente los amos y se&ntilde;ores de este juego.\r\nNo es un descargo, es lo que sent&iacute; y puede que sientas t&uacute;. Dej&eacute; este juego por meses, fui feliz no tuve estres me daba lo mismo todo... Volvi y soy un amargado, antes me re&iacute;a de mis compa&ntilde;eros que jugaban y se enojaban por este juego, les comprendo perfectamente, lo viv&iacute; y me disculpo con ellos, no pens&eacute; lo duro que es.\r\nNo excusen con que no se quien pro tiene 1231909498 cuentas desde elo bajo en elo alto, me da lo mismo el es profesional yo no. Yo no aspiro a ser profesional, solo subir para poder encontrar rivales que me hagan divertirme (siendo mejores que yo).\r\n\r\nBueno, con gusto leo sus comentarios, no tengo la mejor escritura pero lo dije. Suerte a todos en sus rankeds, escuchen a los dem&aacute;s puedan que tengan raz&oacute;n, sean corteses no miren en menos a nadie.\r\n\r\nSaludos!{{champion:75}}  {{champion:23}}","replies":[{"poster":"Eternal Rain","date":"2017-09-10T03:35:24.624+0000","up_votes":1,"down_votes":0,"body":"Personalmente también tuve un momento en que me sentí así, pero luego me di cuenta de la ridiculez que es dejarse afectar por terceros, si bien hay partidas en las que hay aliados que tienen un ego al nivel de ser narcisistas, no debería afectarte, porqué si bien como decias que el juego ya no te saca del aburrimiento, creo que quizás lo has malinterpretado y no te saca el aburrimiento por depender o enfocarte mucho en terceros que simplemente no tienen ni la más mínima relevancia en tu vida.\n\n    Mi consejo es que vayas centrandote en ti mismo, si quieres divertirte, hazlo o si quieres jugar a alto nivel, también hazlo y si no te apetece jugar simplemente no juegues ya que eso es lo ideal, pero nunca dejes que te afecte el ambiente externo(se qué es complicado al principio pero después te sentiras a gusto tanto acá como en tu vida personal) obviamente respetando a los demas osea en otras palabras actúa en base lo que quieres y no te dejes afectar por terceros.\n\n    Por mi parte, soy main mid y no me gusta mucho jugar otras lineas aparte de soporte y un poco de top, aunque soporte ya hace mucho que me aburrio por la season pasada(o fue esta¿? xD) con la implementación de las flex que era obligatorio(le cogi asco porqué siempre me tocaba soporte), empecé a jugar Shyvanna top y encuentro más divertido toplaner.\n\n \n\n      Espero haberte dado una distinta perspectiva y que busques por ti mismo la solución, ya que el que más te debe conocer eres tú ^^.\n\n  Saludos","replies":[{"poster":"Thesouker","date":"2017-09-10T03:55:14.168+0000","up_votes":2,"down_votes":0,"body":"Gracias por tomarte la molestia de leer, si me sentí mejor... Veré como tomarle gusto a esto desde mí y no los demás... TY!!","replies":[]}]},{"poster":"Americans","date":"2017-09-10T05:00:25.263+0000","up_votes":1,"down_votes":0,"body":"Siempre te vas hacer mala sangre si entras a una ranked y pretendes que tu team se lleve bien, coordine, y encima discuta cordialmente estrategias en el chat. Se aprende rápidamente que nadie entra a solo q esperando que una persona la cual no conoces, no sentís ningun afecto por el y como mucho reconoces que es humano, te de consejos o te enseñe a jugar.\n\nTambién tenes que ir con la mentalidad que algunos games lo vas a perder, pase lo que pase, por mas que te esfuerces. Es un juego en equipo y si bien uno puede influenciar la mayoría de games, aveces se pierde. El que entra esperando ganar el 100% de sus partidas, mas cuando juega en su nivel (con esto me refiero a que no es una smurf), se va a frustar muy rapido.\n\nLo que podes probar es jugar con 4 personas mas (preferentemente amigos), con ts/discord lo que sea. La experiencia del juego cambia totalmente y en mi caso personal jugar torneos con mi equipo me es 100 veces mas divertido que jugar por mi cuenta (y muchisimo menos frustrante).","replies":[{"poster":"Thesouker","date":"2017-09-10T14:57:35.512+0000","up_votes":1,"down_votes":0,"body":"Juego de vez en cuando con mis amigos, pero todos tenemos una meta a donde llegar... en fin, nadie la cumplió y terminaron yéndose :ccc\nhora sad","replies":[{"poster":"Americans","date":"2017-09-10T18:12:33.529+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Thesouker,realm=LAS,application-id=J8qpiO2I,discussion-id=XXyzLTzA,comment-id=00010000,timestamp=2017-09-10T14:57:35.512+0000)\n>\n> Juego de vez en cuando con mis amigos, pero todos tenemos una meta a donde llegar... en fin, nadie la cumplió y terminaron yéndose :ccc\n> hora sad\n\nCual meta es esa?","replies":[]}]}]}]}